{
  "id": 366,
  "title": {
    "ar": "الباب السادس والستون وثلاثمائة في معرفة منزل وزراء المهدي الظاهر في آخر الزمان الذي بشر به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو من أهل البيت",
    "en": "Chapter Three Hundred and Sixty-Six: Concerning the Knowledge (معرفة) of the Station (منزل) of the Viziers (وزراء) of the Mahdi, who will appear at the End of Time (آخر الزمان), of whom the Messenger of Allah (may Allah bless him and grant him peace) gave glad tidings, and who is from the People of the House (أهل البيت).",
    "ur": "باب تین سو چھیاسٹھ: آخر الزمان میں ظاہر ہونے والے مہدی کے وزراء کے مقام (منزل) کی معرفت (معرفۃ) کے بارے میں، جن کی بشارت رسول اللہ صلی اللہ علیہ وسلم نے دی ہے اور جو اہل بیت میں سے ہوں گے۔",
    "fa": "باب سیصد و شصت و ششم در معرفت منزل وزیران مهدی که در آخرالزمان ظهور می‌کند و رسول خدا صلی الله علیه و سلم به او بشارت داده است و او از اهل بیت است."
  },
  "content": {
    "ar": "## «الباب السادس والستون وثلاثمائة في معرفة منزل وزراء المهدي الظاهر في آخر الزمان الذي بشر به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو من أهل البيت»\n\n\n> إن الإمام إلى الوزير فقير *** وعليهما فلك الوجود يدور\n\n\n> والملك إن لم تستقم أحواله *** بوجود هذين فسوف يبور\n\n\n> إلا الإله الحق فهو منزه *** ما عنده فيما يريد وزير\n\n\n> جل الإله الحق في ملكوته *** عن إن يراه الخلق وهو فقير\n\n\n### [أن لله خليفة يخرج وقد امتلأت الأرض جورا وظلما]\n\n\nاعلم أيدنا الله أن لله خليفة يخرج وقد امتلأت الأرض جورا وظلما فيملؤها قسطا وعدلا لو لم يبق من الدنيا إلا يوم واحد طول الله ذلك اليوم حتى يلي هذا الخليفة من عترة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من ولد فاطمة يواطئ اسمه اسم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم جده الحسين بن علي بن أبي طالب يبايع بين الركن والمقام يشبه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في خلقه بفتح الخاء وينزل عنه في الخلق بضم الخاء لأنه لا يكون أحد مثل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في أخلاقه والله يقول فيه وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ هو أجلي الجبهة أقنى الأنف أسعد الناس به أهل الكوفة يقسم المال بالسوية ويعدل في الرعية ويفصل في القضية يأتيه الرجل فيقول له يا مهدي أعطني وبين يديه المال فيحثي له في ثوبه ما استطاع أن يحمله يخرج على فترة من الدين يزع الله به ما لا يزع بالقرآن يمسي جاهلا بخيلا جبانا ويصبح أعلم الناس أكرم الناس أشجع الناس يصلحه الله في ليلة يمشي النصر بين يديه يعيش خمسا أو سبعا أو تسعا يقفو أثر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لا يخطئ له ملك يسدده من حيث لا يراه يحمل الكل ويقوي الضعيف في الحق ويقري الضيف ويعين على نوائب الحق بفعل ما يقول ويقول ما يعلم ويعلم ما يشهد يفتح المدينة الرومية بالتكبير في سبعين ألفا من المسلمين من ولد إسحاق يشهد الملحمة العظمى مأدبة الله بمرج عكا يبيد الظلم وأهله يقيم الدين ينفخ الروح في الإسلام يعز الإسلام به بعد ذله ويحيا بعد موته يضع الجزية ويدعو إلى الله بالسيف فمن‏\n\n\nأبي قتل ومن نازعه خذل يظهر من الدين ما هو الدين عليه في نفسه ما لو كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لحكم به يرفع المذاهب من الأرض فلا يبقى إلا الدين الخالص أعداؤه مقلدة العلماء أهل الاجتهاد لما يرونه من الحكم بخلاف ما ذهبت إليه أئمتهم فيدخلون كرها تحت حكمه خوفا من سيفه وسطوته ورغبة فيما لديه يفرح به عامة المسلمين أكثر من خواصهم يبايعه العارفون بالله من أهل الحقائق عن شهود وكشف بتعريف إلهي له رجال إلهيون يقيمون دعوته وينصرونه هم الوزراء يحملون أثقال المملكة ويعينونه على ما قلده الله ينزل عليه عيسى ابن مريم بالمنارة البيضاء بشرقي دمشق بين مهرودتين متكئا على ملكين ملك عن يمينه وملك عن يساره يقطر رأسه ماء مثل الجمان يتحدر كأنما خرج من ديماس والناس في صلاة العصر فيتنحى له الإمام من مقامه فيتقدم فيصلي بالناس يؤم الناس بسنة محمد صَلَّى اللهُ عَليهِ وسَلَّم يكسر الصليب ويقتل الخنزير ويقبض الله المهدي إليه طاهرا مطهرا وفي زمانه يقتل السفياني عند شجرة\nبغوطة دمشق ويخسف بجيشه في البيداء بين المدينة ومكة حتى لا يبقى من الجيش إلا رجل واحد من جهينة يستبيح هذا الجيش مدينة الرسول صَلَّى اللهُ عَليهِ وسَلَّم ثلاثة أيام ثم يرحل يطلب مكة فيخسف الله به في البيداء فمن كان مجبورا من ذلك الجيش مكرها يحشر على نيته القرآن حاكم والسيف مبيد ولذلك‏\n\n\nورد في الخبر أن الله يزع بالسلطان ما لا يزع بالقرآن‏\n\n\n> إلا إن ختم الأولياء شهيد *** وعين إمام العالمين فقيد\n\n\n> هو السيد المهدي من آل أحمد *** هو الصارم الهندي حين يبيد\n\n\n> هو الشمس يجلو كل غم وظلمة *** هو الوابل الوسمي حين يجود\n\n\nوقد جاءكم زمانه وأظلكم أوانه وظهر في القرن الرابع اللاحق بالقرون الثلاثة الماضية قرن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو قرن الصحابة ثم الذي يليه ثم الذي يلي الثاني ثم جاء بينهما فترات وحدثت أمور وانتشرت أهواء وسفكت دماء وعاثت الذئاب في البلاد وكثر الفساد إلى أن طم الجور وطمى سيله وأدبر نهار العدل بالظلم حين أقبل ليله فشهداؤه خير الشهداء وأمناؤه أفضل الأمناء وإن الله يستوزر له طائفة خبأهم له في مكنون غيبه أطلعهم كشفا وشهودا على الحقائق وما هو أمر الله عليه في عباده فبمشاورتهم يفصل ما يفصل وهم العارفون الذين عرفوا ما ثم وأما هو في نفسه فصاحب سيف حق وسياسة مدنية يعرف من الله قدر ما تحتاج إليه مرتبته ومنزله لأنه خليفة مسدد يفهم منطق الحيوان يسرى عدله في الإنس والجان‏\n\n\n### [إن وزراء المهدي عليه السلام من الأعاجم‏]\n\n\nمن أسرار علم وزرائه الذين استوزرهم الله له قوله تعالى وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ وهم على أقدام رجال من الصحابة صَدَقُوا ما عاهَدُوا الله عَلَيْهِ وهم من الأعاجم ما فيهم عربي لكن لا يتكلمون إلا بالعربية لهم حافظ ليس من جنسهم ما عصى الله قط هو أخص الوزراء وأفضل الأمناء فأعطاهم الله في هذه الآية التي اتخذوها هجيرا وفي ليلهم سمير أفضل علم الصدق حالا وذوقا فعلموا إن الصدق سيف الله في الأرض ما قام بأحد ولا اتصف به إلا نصره الله لأن الصدق نعته والصادق اسمه فنظروا بأعين سليمة من الرمد وسلكوا بأقدام ثابتة في سبيل الرشد فلم يروا الحق قيد مؤمنا من مؤمن بل أوجب على نفسه نصر المؤمنين ولم يقل بمن بل أرسلها مطلقة وجلاها محققة فقال يا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا وقال وما كانَ لِمُؤْمِنٍ أَنْ يَقْتُلَ مُؤْمِناً إِلَّا خَطَأً وقال والَّذِينَ آمَنُوا بِالْباطِلِ فسماهم مؤمنين وقال وإِنْ يُشْرَكْ به تُؤْمِنُوا فسمى المشرك مؤمنا فهؤلاء هم المؤمنون الذين أيه الله بهم في قوله يا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ ورَسُولِهِ والْكِتابِ الَّذِي نَزَّلَ عَلى‏ رَسُولِهِ والْكِتابِ الَّذِي أَنْزَلَ من قَبْلُ فميزهم عن المؤمنين من أهل الكتاب والكتب وما تم مخبر جاء بخبر إلا الرسل فتعين إن المؤمنين الذين أمروا بالإيمان أنهم الَّذِينَ آمَنُوا بِالْباطِلِ وآمنوا بالشريك عن شبه صرفتهم عن الدليل لأن الذين آمنوا بالباطل كفروا بالله والذين آمنوا بالشريك اشمأزت قلوبهم إِذا ذُكِرَ الله وَحْدَهُ فما أتاهم بهذا الخبر إلا أئمتهم المضلون الذين سبقوهم وكان ذلك في زعمهم عن برهان أعني الأئمة لا عن قصور بل وفوا النظر حقه فما أعطاهم استعدادهم الذي آتاهم الله وما كلف الله نَفْساً إِلَّا ما آتاها وما آتاها غير ما جاءت به فآمن بذلك أتباعهم وصدقوا في إيمانهم وما قصدوا إلا طريق النجاة ما قصدوا ما يرديهم ولما رأوا أن الله يفعل ابتداء ويفعل بالآلة جعلوا الشريك كالوزير معينا على ظهور بعض الأفعال الحاصلة في الوجود فلما ذكر الله وحده رأوا أن هذا الذاكر لم يوف الأمر حقه لما علموا من توقف بعض الأفعال على وجود بعض الخلق وما كان مشهودهم إلا الأفعال الإلهية الحاصلة في الوجود عن الأسباب المخلوقة فلم يقبلوا توحيد الأفعال لأنهم ما شاهدوه ولو قبلوه أبطلوا حكمة الله فيما وضع من الأسباب علوا وسفلا فهذا الذي أداهم إلى الاشمئزاز وعدم الإنصاف فذمهم الله إيثار الجناب المؤمنين الذين لم يروا فاعلا إلا الله وأن القدرة الحادثة والأمور الموقوفة على الأسباب لا أثر لها في الفعل فهذه الطائفة وحدها هي التي خص الله بهذا الخطاب وأما الذين كفروا بالله فهم الذين ستروه بحجاب الشرك وآمنوا بالباطل والباطل عدم وما رأوا من ينتفي عنه التشبيه والشرك إلا العدم فإن الوجود صفة مشتركة\nفإيمانهم بالباطل إيمان تنزيه وكفرهم أي سترهم نسبة الوجود إلى الله لما وقع في ذلك من الاشتراك ولذلك قال تعالى أُولئِكَ هُمُ الْخاسِرُونَ لأنهم خسروا في تجارتهم وجود ربح إظهار تمام الأمر على ما هو عليه ف اشْتَرَوُا الضَّلالَةَ بِالْهُدى‏ أي الحيرة بالبيان فأخذوا الحيرة وعلموا إن الأمر عظيم وأن البيان تقيد وهو لا يتقيد فآثروا الحيرة على البيان وأما أصحاب العقل السليم والنظر الصحيح والايمان العام فهم الذين أثبتوا الحيرة في مقامها وموطنها\n\n\nفقال صَلَّى اللهُ عَليهِ وسَلَّم زدني فيك تحيرا\n\n\nوأثبتوا البيان في مقامه الذي لا يتمكن معرفة ذلك الأمر إلا بالبيان ولا يقبل الحيرة فأعطوا كل ذي حق حقه ووضعوا الحكمة في موضعها فالكل مؤمنون فإن الله سماهم مؤمنين كما سماهم كافرين ومشركين وجعلهم على مراتب في إيمانهم ولهذا قال لِيَزْدادُوا إِيماناً مَعَ إِيمانِهِمْ فيما آمنوا به كما زادهم مرضا ورِجْساً إِلَى رِجْسِهِمْ فيما كفروا به فمنهم الصادق والأصدق فينصر الله المؤمن الذي لم يدخله خلل في إيمانه على من دخله خلل في إيمانه فإن الله يخذله على قدر ما دخله من الخلل أي مؤمن كان من المؤمنين فالمؤمن الكامل الايمان منصور أبدا ولهذا ما انهزم نبي قط ولا ولي أ لا ترى يوم حنين لما ادعت الصحابة رضي الله عنهم توحيد الله ثم رأوا كثرتهم فأعجبتهم كثرتهم فنسوا الله عند ذلك فلم تغن عنهم كثرتهم شيئا كما لم تغن أولئك آلهتهم من الله شيئا مع كون الصحابة مؤمنين بلا شك ولكن دخلهم الخلل باعتمادهم على الكثرة ونسوا قول الله كَمْ من فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ الله فما أذن الله هنا إلا للغلبة فأوجدها فغلبتهم الفئة القليلة بها عن إذن الله‏\n\n\n> فما ثم إلا الله ليس سواه *** وكل بصير بالوجود يراه‏\n\n\n### [تأثير الصدق مشهود في أشخاص ما لهم تلك المكانة]\n\n\nوأما تأثير الصدق فمشهود في أشخاص ما لهم تلك المكانة من أسباب السعادة التي جاءت بها الشرائع ولكن لهم القدم الراسخ في الصدق فيقتلون بالهمة وهي الصدق قيل لأبي يزيد أرنا اسم الله الأعظم فقال لهم أرونا الأصغر حتى أريكم الأعظم أسماء الله كلها عظيمة فما هو إلا الصدق اصدق وخذ أي اسم شئت فإنك تفعل به ما شئت وبه أحيا أبو يزيد النملة وأحيا ذو النون ابن المرأة التي ابتلعه التمساح فإن فهمت فقد فتحت لك بابا من أبواب سعادتك إن عملت عليه أسعدك الله حيث كنت ولن تخطئ أبدا ومن هنا تكون في راحة مع الله إذا كانت الغلبة للكافرين على المسلمين فتعلم إن إيمانهم تزلزل ودخله الخلل وأن الكافرين فيما آمنوا به من الباطل والمشركين لم يتخلخل إيمانهم ولا تزلزلوا فيه فالنصر أخو الصدق حيث كان يتبعه ولو كان خلاف هذا ما انهزم المسلمون قط كما أنه لم ينهزم نبي قط وأنت تشاهد غلبة الكفار ونصرتهم في وقت وغلبة المسلمين ونصرتهم في وقت والصادق من الفريقين لا ينهزم جملة واحدة بل لا يزال ثابتا حتى يقتل أو ينصرف من غير هزيمة وعلى هذه القدم وزراء المهدي وهذا هو الذي يقررونه في نفوس أصحاب المهدي أ لا تراهم بالتكبير يفتحون مدينة الروم فيكبرون التكبيرة الأولى فيسقط ثلث سورها ويكبرون الثانية فيسقط الثلث الثاني من السور ويكبرون الثالثة فيسقط الثلث الثالث فيفتحونها من غير سيف فهذا عين الصدق الذي ذكرنا وهم جماعة أعني وزراء المهدي دون العشرة وإذا علم الإمام المهدي هذا عمل به فيكون أصدق أهل زمانه فوزراؤه الهداة وهو المهدي فهذا القدر يحصل للمهدي من العلم بالله على أيدي وزرائه‏\n\n\n### [ختم الولاية المحمدية]\n\n\nوأما ختم الولاية المحمدية فهو أعلم الخلق بالله لا يكون في زمانه ولا بعد زمانه أعلم بالله وبمواقع الحكم منه فهو والقرآن إخوان كما إن المهدي والسيف إخوان وإنما شك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في مدة إقامته خليفة من خمس إلى تسع للشك الذي وقع في وزرائه لأنه لكل وزير معه سنة فإن كانوا خمسة عاش خمسة وإن كانوا سبعة عاش سبعة وإن كانوا تسعة عاش تسعة فإنه لكل عام أحوال مخصوصة وعلم ما يصلح في ذلك العام خص به وزير من وزرائه فما هم أقل من خمسة ولا أكثر من تسعة ويقتلون كلهم إلا واحدا منهم في مرج عكا في المائدة الإلهية التي جعلها الله مائدة لسباع الطير والهوام وذلك الواحد الذي يبقى لا أدري هل يكون ممن استثنى الله في قوله تعالى ونُفِخَ في الصُّورِ فَصَعِقَ من في السَّماواتِ ومن في الْأَرْضِ إِلَّا من شاءَ الله أو يموت في تلك النفخة\n\n\n### [الشاب الذي يقتله الدجال‏]\n\n\nوأما الخضر الذي يقتله الدجال في زعمه لا في نفس الأمر وهو فتى ممتلئ شبابا هكذا يظهر له في عينه وقد قيل إن الشاب الذي يقتله الدجال في زعمه أنه واحد من أصحاب الكهف وليس ذلك بصحيح عندنا من طريق الكشف وظهور\nالمهدي من أشراط قرب الساعة ويكون فتح مدينة الروم وهي القسطنطينية العظمى والملحمة الكبرى التي هي المأدبة بمرج عكا وخروج الدجال في ستة أشهر ويكون بين فتح القسطنطينية وخروج الدجال ثمانية عشر يوما ويكون خروجه من خراسان من أرض المشرق موضع الفتن تتبعه الأتراك واليهود يخرج إليه من أصبهان وحدها سبعون ألفا مطيلسين في أتباعه كلهم من اليهود وهو رجل كهل أعور العين اليمنى كان عينه عنبة طافية مكتوب بين عينيه كاف فاء راء فلا أدري هل المراد بهذا الهجاء كفر من الأفعال أو أراد به كفر من الأسماء إلا أنه حذف الألف كما حذفتها العرب في خط المصحف في مواضع مثل ألف الرحمن بين الميم والنون وكان صَلَّى اللهُ عَليهِ وسَلَّم يستعيذ وأمرنا بالاستعاذة من فتنة المسيح الدجال ومن الفتن‏\n\n\nفإن الفتن تعرض على القلوب كالحصير عودا عودا فأي قلب أشربها نكتت فيه نكتة سوداء نعوذ بالله من الفتن‏\n\n\nحدثنا المكي أبو شجاع ابن رستم الأصبهاني إمام مقام إبراهيم بالحرم المكي في آخرين كلهم قالوا حدثنا أبو الفتح عبد الملك بن أبي القاسم بن أبي سهل الكروخي قال أخبرنا مشايخي الثلاثة القاضي أبو عامر محمود بن القاسم الأزدي وأبو نصر عبد العزيز بن محمد الترياقي وأبو بكر محمد بن أبي حاتم العورجي التاجر قال أخبرنا محمد بن عبد الجبار الجراحي قال أنا أبو العباس محمد بن أحمد المحبوبي قال أنا أبو عيسى محمد بن عيسى بن سورة الترمذي قال حدثنا علي بن حجر أنا الوليد بن مسلم وعبد الله بن عبد الرحمن بن يزيد بن يحيى بن خالد الطائي عن عبد الرحمن ابن يزيد بن جابر دخل حديث أحدهما في حديث الآخر عن عبد الرحمن بن يزيد ابن جابر عن يحيى بن خالد الطائي عن عبد الرحمن بن جبير عن أبيه جبير بن نفير عن النواس بن سمعان الكلابي قال ذكر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم الدجال ذات غداة فخفض فيه ورفع حتى ظنناه في طائفة النخل قال فانصرفنا من عند رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ثم رحنا إليه فعرف ذلك فينا فقال ما شأنكم فقلنا يا رسول الله ذكرت الدجال الغداة فخفضت فيه ورفعت حتى ظنناه في طائفة النخل فقال غير الدجال أخوف لي عليكم إن يخرج وأنا فيكم فإنا حجيجه دونكم وأن يخرج ولست فيكم فكل امرئ حجيج نفسه والله خليفتي على كل مسلم إنه شاب قطط عينه طافية شبيه بعبد العزى بن قطن فمن رآه منكم فليقرأ فواتح سورة أصحاب الكهف قال يخرج ما بين الشام والعراق فعاث يمينا وشمالا يا عباد الله اثبتوا اثبتوا قلنا يا رسول الله وما لبثه في الأرض قال أربعون يوما يوم كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم قلنا يا رسول الله أ رأيت اليوم الذي كالسنة أ يكفينا فيه صلاة يوم قال لا ولكن أقدروا له قلنا يا رسول الله فما سرعته في الأرض قال كالغيث إذا استدبرته الريح فيأتي القوم فيدعوهم فيكذبونه ويردون عليه قوله فينصرف عنهم فتتبعه أموالهم فيصبحون ليس بأيديهم شي‏ء ثم يأتي القوم فيدعوهم فيستجيبون له ويصدقونه فيأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت فتروح عليهم سارحتهم كأطول ما كانت درا وأمده خواصر وأدره ضروعا قال ثم يأتي الخربة فيقول لها أخرجي كنوزك وينصرف عنها فتتبعه كيعاسيب النحل ثم يدعو رجلا شابا ممتلئا شبابا فيضربه بالسيف فيقطعه جزلتين ثم يدعوه فيقبل يتهلل وجهه يضحك فبينما هو كذلك إذ هبط عيسى بن مريم بشرقي دمشق عند المنارة البيضاء بين مهرودتين واضعا يديه على أجنحة ملكين إذا طأطأ رأسه قطر وإذا رفعه انحدر منه جمان كاللؤلؤ قال ولا يجد ريح نفسه يعني أحد إلا مات وريح نفسه منتهى بصره قال فيطلبه حتى يدركه بباب لد فيقتله قال ويلبث كذلك ما شاء الله قال ثم يوحي الله إليه أن أحرز عبادي إلى الطور فإني قد أنزلت عبادا لي لا يد لأحد بقتالهم قال ويبعث الله يأجوج ومأجوج وهم كما قال الله تعالى من كُلِّ حَدَبٍ يَنْسِلُونَ قال فيمر أولهم ببحيرة طبرية فيشربون ما فيها ثم يمر بها آخرهم فيقولون لقد كان بهذه مرة ماء ثم يسيرون إلى أن ينتهوا إلى جبل بيت المقدس فيقولون لقد قتلنا من في الأرض فهلم فلنقتل من في السماء فيرمون بنشابهم إلى السماء فيرد الله عليهم نشابهم محمرا دما ويحاصر عيسى بن مريم وأصحابه حتى يكون رأس الثور يومئذ خيرا لهم من مائة دينار لأحدكم اليوم قال فيرغب عيسى بن مريم إلى الله وأصحابه قال فيرسل الله عليهم النغف في رقابهم فيصبحون فرسي موتى كموت نفس واحدة قال ويهبط عيسى بن مريم وأصحابه فلا يجد موضع شبر إلا وقد ملأته زهمتهم ونتنهم ودماؤهم قال فيرغب عيسى إلى الله‏\nوأصحابه قال فيرسل الله عليهم طيرا كأعناق البخت فتحملهم فتطرحهم بالمهبل ويستوقد المسلمون من قسيهم ونشابهم وجعابهم سبع سنين ويرسل الله عليهم مطرا لا يكن منه بيت ولا وبر ولا مدر قال فيغسل الأرض ويتركها كالزلفة قال ثم يقال للأرض أخرجي ثمرتك وردي بركتك فيومئذ تأكل العصابة الرمانة ويستظلون بقحفها ويبارك الله في الرسل حتى إن الفئام من الناس ليكتفون باللقحة من الإبل وإن القبيلة ليكتفون باللقحة من البقر وإن الفخذ ليكتفون باللقحة من الغنم فبينما هم كذلك إذ بعث الله ريحا فقبضت روح كل مؤمن ويبقى سائر الناس يتهارجون كما يتهارج الحمر فعليهم تقوم الساعة قال أبو عيسى هذا حديث غريب حسن صحيح‏\n\n\nثم نرجع إلى ما بنينا عليه الباب من العلم بوزراء المهدي ومراتبهم‏\n\n\n### [مدة إقامة المهدي إماما في هذه الدنيا]\n\n\nفاعلم أني على الشك من مدة إقامة هذا المهدي إماما في هذه الدنيا فأتى ما طلبت من الله تحقيق ذلك ولا تعيينه ولا تعيين حادث من حوادث الأكوان إلا أن يعلمني الله به ابتداء لا عن طلب فإني أخاف أن يفوتني من معرفتي به تعالى حظ في الزمان الذي أطلب فيه منه تعالى معرفة كون وحادث بل سلمت أمري إلى الله في ملكه يفعل فيه ما يشاء فإني رأيت جماعة من أهل الله تعالى يطلبون الوقوف على علم الحوادث الكونية منه تعالى ولا سيما معرفة إمام الوقت فأنفت من ذلك وخفت أن يسرقني الطبع بمعاشرتهم وهم على هذه الحال وما أردت منه تعالى إلا أن يرزقني الثبوت على قدم واحدة من المعرفة به وإن تقلبت في الأحوال فلا أبالي ولما رأيته قد قدمني وأخرني ورأيت اختلاف عيني لاختلاف الحال فلم أر عينا واحدة تثبت فما استقر لي أمر أثبت عليه كما كنت عليه في حال عدمي ورأيت أن حكم الوجود ومقام الشهود حكم على عيني بذلك طلبت الإقالة من وجودي فخاطبته نظما وحكما\n\n\n> لك العتبى أقلني من وجودي *** ومن حكم التحقق بالشهود\n\n\n> لقد أصبحت قبلة كل شي‏ء *** وقد أمسيت أطلب بالسجود\n\n\n> عجبت لحالتي إذ قال كوني *** أنا عين المسود والمسود\n\n\n> فأما إن تميزني إماما *** وإما أن أميز في العبيد\n\n\n> لقد لعبت بنا أيدي الخفايا *** خفايا الغيب في عين الوجود\n\n\nفلما سألت ذلك أبان لي عن جهلي وقال لي أ ما ترضى أن تكون مثلي ثم أقام لي اختلاف تجليه في الصور وما يدركه من ذاته البصر فقلت ما علي من اختلاف الأحوال على عين ثابتة لا تقبل التقييد فإني ما أنكرت اختلاف الأحوال فإن الحقائق تعطي ذلك وإنما أقلقني اختلاف العين من وجودي لاختلاف الأحوال فإني أعلم مع كونك كل يوم في شأن إنك العين الثابتة في الغني عن العالمين فإني علمت‏\n\n\n> إن التحول في الصور *** نعت المهيمن بالخبر\n\n\n> وبذاك أنزل وحيه *** فيما تلاه من السور\n\n\n> ولقد رأيت مثاله *** بمطول وبمختصر\n\n\nأردت بالمطول العالم كله وبالمختصر الإنسان الكامل لما رأيت أن التقلب في كل ذلك لازم ففي العالم تقلب الليل والنهار وفي الإنسان الكامل الذي ساد العالم في الكمال وهو محمد صَلَّى اللهُ عَليهِ وسَلَّم سيد الناس يوم القيامة وهو الَّذِي يَراكَ حِينَ تَقُومُ وتَقَلُّبَكَ في السَّاجِدِينَ ولما جرى بنا القلم في حلبة العبارة الرقية لأن التعريف قد يقع لفظا وكتابة وقد يقع في العموم عند الخواص بالنظر وقد وجدته وقد يقع بالضرب وقد وجده رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وبأمور كثيرة غير ما ذكرنا وكل ذلك خطاب وتعريف فطريق علمنا الأخبار ولما كنت على هذه القدم التي جالست الحق عليها إن لا أضيع زماني في غير علمي به تعالى قيض الله واحدا من أهل الله تعالى وخاصته يقال له أحمد بن عقاب اختصه الله بالأهلية صغيرا فوقع منه ابتداء ذكر هؤلاء الوزراء فقال لي هم تسعة فقلت له إن كانوا تسعة فإن مدة بقاء المهدي لا بد أن تكون تسع سنين فإني عليم بما يحتاج إليه وزيره فإن كان واحدا اجتمع في ذلك الواحد جميع ما يحتاج إليه وإن كانوا أكثر من واحد فما يكونون أكثر من تسعة فإنه إليها انتهى الشك من رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في قوله‏\nخمسا أو سبعا أو تسعا في إقامة المهدي وجميع ما يحتاج إليه مما يكون قيام وزرائه به تسعة أمور لا عاشر لها ولا تنقص عن ذلك وهي نفوذ البصر ومعرفة الخطاب الإلهي عند الإلقاء وعلم الترجمة عن الله وتعيين المراتب لولاة الأمر والرحمة في الغضب وما يحتاج إليه الملك من الأرزاق المحسوسة والمعقولة وعلم تداخل الأمور بعضها على بعض والمبالغة والاستقصاء في قضاء حوائج الناس والوقوف على علم الغيب الذي يحتاج إليه في الكون في مدته خاصة فهذه تسعة أمور لا بد أن تكون في وزير الإمام المهدي إن كان الوزير واحدا أو وزرائه إن كانوا أكثر من واحد فأما نفوذ البصر فذلك ليكون دعاؤه إلى الله على بصيرة في المدعو إليه لا في المدعو فينظر في عين كل مدعو ممن يدعوه فيرى ما يمكن له الإجابة إلى دعوته فيدعوه من ذلك ولو بطريق الإلحاح وما يرى منه أنه لا يجيب دعوته يدعوه من غير إلحاح لإقامة الحجة عليه خاصة فإن المهدي حجة الله على أهل زمانه وهي درجة الأنبياء التي تقع فيها المشاركة قال الله تعالى أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي أخبر بذلك عن نبيه صَلَّى اللهُ عَليهِ وسَلَّم فالمهدي ممن اتبعه وهو صَلَّى اللهُ عَليهِ وسَلَّم لا يخطئ في دعائه إلى الله فمتبعه لا يخطئ فإنه يقفو أثره وكذا ورد الخبر في صفة المهدي أنه قال صَلَّى اللهُ عَليهِ وسَلَّم يقفو أثري لا يخطئ‏\n\n\nوهذه هي العصمة في الدعاء إلى الله وينالها كثير من الأولياء بل كلهم ومن حكم نفوذ البصر أن يدرك صاحبه الأرواح النورية والنارية عن غير إرادة من الأرواح ولا ظهور ولا تصور\n\n\nكابن عباس وعائشة رضي الله عنهما حين أدركا جبريل عليه السلام وهو يكلم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم على غير\n\n\nعلم من جبريل بذلك ولا إرادة منه للظهور لهم فأخبرا بذلك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ولم يعلما أنه جبريل عليه السلام فقال لها صَلَّى اللهُ عَليهِ وسَلَّم أو قد رأيتيه وقال لابن عباس أ رأيته قالا نعم قال ذلك جبريل‏\n\n\nوكذلك يدركون رجال الغيب في حال إرادتهم الاحتجاب وأن لا يظهروا للابصار فيراهم صاحب هذا الحال ومن نفوذ البصر أيضا إنهم إذا تجسدت لهم المعاني يعرفونها في عين صورها فيعلمون أي معنى هو ذلك الذي تجسد من غير توقف‏\n\n\n### «وصل» وأما معرفة الخطاب الإلهي عند الإلقاء\n\n\nفهو قوله تعالى وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ أَوْ يُرْسِلَ رَسُولًا فأما الوحي من ذلك فهو ما يلقيه في قلوبهم على جهة الحديث فيحصل لهم من ذلك علم بأمر ما وهو الذي تضمنه ذلك الحديث وإن لم يكن كذلك فليس بوحي ولا خطاب فإن بعض القلوب يجد أصحابها علما بأمر ما من العلوم الضرورية عند الناس فذلك علم صحيح ليس عن خطاب وكلامنا إنما هو في الخطاب الإلهي المسمى وحيا فإن الله تعالى جعل مثل هذا الصنف من الوحي كلاما ومن الكلام يستفيد العلم بالذي جاء له ذلك الكلام وبهذا يفرق إذا وجد ذلك وأما قوله تعالى أَوْ من وَراءِ حِجابٍ فهو خطاب إلهي يلقيه على السمع لا على القلب فيدركه من ألقى عليه فيفهم منه ما قصد به من أسمعه ذلك وقد يحصل له ذلك في صور التجلي فتخاطبه تلك الصورة الإلهية وهي عين الحجاب فيفهم من ذلك الخطاب علم ما يدل عليه ويعلم أن ذلك حجاب وأن المتكلم من وراء ذلك الحجاب وما كل من أدرك صورة التجلي الإلهي يعلم أن ذلك هو الله فما يزيد صاحب هذه الحال على غيره إلا بأن يعرف أن تلك الصورة وإن كانت حجابا فهي عين تجلى الحق له وأما قوله تعالى أَوْ يُرْسِلَ رَسُولًا فهو ما ينزل به الملك أو ما يجي‏ء به الرسول البشري إلينا إذا نقلا كلام الله خاصة مثل التالي قال تعالى فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله وقوله تعالى ونادَيْناهُ من جانِبِ الطُّورِ الْأَيْمَنِ وقَرَّبْناهُ نَجِيًّا وقوله تعالى نُودِيَ أَنْ بُورِكَ من في النَّارِ ومن حَوْلَها فإن نقلا علما وأفصحا عنه ووجداه في أنفسهما فذلك ليس بكلام إلهي وقد يكون الرسول والصورة معا وذلك في نفس الكتابة فالكتاب رسول وهو عين الحجاب على المتكلم فيفهمك ما جاء به ولكن لا يكون ذلك إذا كتب ما علم وإنما يكون ذلك إذا كتب عن حديث يخاطبه به تلك الحروف التي يسطرها ومتى لم يكن كذلك فما هو كلام هذا هو الضابط فاللقاء للرسل والإلقاء للخبر الإلهي بارتفاع الوسائط من كونه كلمه لا غير والكتابة رقوم مسطرة حيث كانت لم تسطر إلا عن حديث ممن سطرها لا عن علم فهذا كله من الخطاب الإلهي لصاحب هذا المقام‏\n\n\n### [علم الترجمة عن الله‏]\n\n\nوأما علم الترجمة عن الله فذلك لكل من كلمه الله في الإلقاء والوحي فيكون المترجم خلاقا لصور الحروف اللفظية أو المرقومة التي يوجدها ويكون روح تلك الصور كلام الله لا غير فإن ترجم عن علم فما هو مترجم لا بد من ذلك يقول‏\nالولي حدثني قلبي عن ربي وقد يترجم المترجم عن ألسنة الأحوال وليس من هذا الباب بل ذلك من باب آخر يرجع إلى عين الفهم بالأحوال وهو معلوم عند علماء الرسوم وعلى ذلك يخرجون قوله تعالى وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ يقولون يعني بلسان الحال وكذلك قوله تعالى إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها فجعلوا هذه الإباية والإشفاق حالا لا حقيقة وكذلك قوله عنهما قالَتا أَتَيْنا طائِعِينَ قول حال لا قول خطاب وهذا كله ليس بصحيح ولا مراد في هذه الآيات بل الأمر على ظاهره كما ورد هكذا يدركه أهل الكشف فإذا ترجموا عن الموجودات فإنما يترجمون عما تخاطبهم به لا عن أحوالهم إذ لو نطقوا لقالوا هذا وأصحاب هذا القول انقسموا على قسمين فبعضهم يقول إن كان هذا وأمثاله نطقا حقيقة وكلاما فلا بد أن يخلق في هؤلاء الناطقين حياة وحينئذ يصح أن يكون حقيقة وجائز أن يخلق الله فيهم حياة ولكن لا علم لنا بذلك إن الأمر وقع كما جوزناه أو هو لسان حال فأما أصحاب ذاك القول فكذا وقع في نفس الأمر لأن كل ما سوى الله حي ناطق في نفس الأمر فلا معنى للأحوال مع هذا عند أهل الكشف والوجود وأما القسم الآخر وهم الحكماء فقالوا إن هذا لسان حال ولا بد لأنه من المحال أن يحيا الجماد وهذا قول محجوب بأكثف حجاب فما في العالم إلا مترجم إذا ترجم عن حديث إلهي فافهم ذلك‏\n\n\n### [تعيين المراتب لولاة الأمر]\n\n\nوأما تعيين المراتب لولاة الأمر فهو العلم بما تستحقه كل مرتبة من المصالح التي خلقت لها فينظر صاحب هذا العلم في نفس الشخص الذي يريد أن يوليه ويرفع الميزان بينه وبين المرتبة فإذا رأى الاعتدال في الوزن من غير ترجيح لكفة المرتبة ولاة وإن رجح الوالي فلا يضره وإن رجحت كفة المرتبة عليه لم يوله لأنه ينقص عن علم ما رجحه به فيجور بلا شك وهو أصل الجور في الولاة ومن المحال عندنا إن يعلم ويعدل عن حكم علمه جملة واحدة وهو جائز عند علماء الرسوم وعندنا هذا الجائز ليس بواقع في الوجود وهي مسألة صعبة ولهذا يكون المهدي يملؤها قسطا وعدلا كما ملئت جورا وظلما يعني الأرض فإن العلم عندنا يقتضي العمل ولا بد وإلا فليس بعلم وإن ظهر بصورة علم والمراتب ثلاثة وهي التي ينفذ فيها حكم الحاكم وهي الدماء والأعراض والأموال فيعلم ما تطلبه كل مرتبة من الحكم الإلهي المشروع وينظر في الناس فمن رأى أنه جمع ما تطلبه تلك المرتبة نظر في مزاج ذلك الجامع فإن رآه يتصرف تحت حكم العلم علم أنه عاقل فولاه وإن رآه يحكم على علمه وأن علمه معه مقهور تحت حكم شهوته وسلطان هواه لم يوله مع علمه بالحكم قال بعض الملوك لبعض جلسائه من أهل الرأي والنظر الصحيح حين استشاره فقال له من ترى إن أولي أمور الناس فقال ول على أمور الناس رجلا عاقلا فإن العاقل يستبرئ لنفسه فإن كان عالما حكم بما علم وإن لم يكن عالما بتلك الواقعة ما حكمها حكم عليه عقله إن يسأل من يدري الحكم الإلهي المشروع في تلك النازلة فإذا عرفه حكم فيها فهذا فائدة العقل فإن كثيرا ممن ينتمي إلى الدين والعلم الرسمي تحكم شهوتهم عليهم والعاقل ليس كذلك فإن العقل يأبى إلا الفضائل فإنه يقيد صاحبه عن التصرف فيما لا ينبغي ولهذا سمي عقلا من العقال وأما الرحمة في الغضب فلا يكون ذلك إلا في الحدود المشروعة والتعزير وما عدا ذلك فغضب ليس فيه من الرحمة شي‏ء ولذلك قال أبو يزيد بطشي أشد لما سمع القارئ يقرأ إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ فإن الإنسان إذا غضب لنفسه فلا يتضمن ذلك الغضب رحمة بوجه وإذا غضب لله فغضبه غضب الله وغضب الله لا يخلص عن رحمة إلهية تشوبه فغضبه في الدنيا ما نصبه من الحدود والتعزيرات وغضبه في الآخرة ما يقيم من الحدود على من يدخل النار فهو وإن كان غضبا فهو تطهير لما شابه من الرحمة في الدنيا والآخرة لأن الرحمة لما سبقت الغضب في الوجود عمت الكون كله ووسعت كل شي‏ء فلما جاء الغضب في الوجود وجد الرحمة قد سبقته ولا بد من وجوده فكان مع الرحمة كالماء مع اللبن إذا شابه وخالطه فلم يخلص الماء من اللبن كذلك لم يخلص الغضب من الرحمة فحكمت على الغضب لأنها صاحبة المحل فينتهي غضب الله في المغضوب عليهم ورحمة الله لا تنتهي فهذا المهدي لا يغضب إلا لله فلا يتعدى في غضبه إقامة حدود الله التي شرعها بخلاف من يغضب لهواه ومخالفة غرضه فمثل هذا الذي يغضب لله لا يمكن أن يكون إلا عادلا ومقسطا لا جائرا ولا قاسطا وعلامة من يدعي هذا المقام إذا غضب لله وكان حاكما وأقام الحد على المغضوب عليه يزول عنه الغضب على ذلك الشخص عند الفراغ منه‏\nوربما قام إليه وعانقه وآنسه وقال له أحمد الله الذي طهرك وأظهر له السرور والبشاشة به وربما أحسن إليه بعد ذلك هذا ميزانه ويرجع لذلك المحدود رحمة كله وقد رأيت ذلك لبعض القضاة ببلاد المغرب قاضي مدينة سبتة يقال له أبو إبراهيم بن يغمور وكان يسمع معنا الحديث على شيخنا أبي الحسين بن الصائغ من ذرية أبي أيوب الأنصاري وعلى أبي الصبر أيوب الفهري وعلى أبي محمد بن عبد الله الحجري بسبتة في زمان قضائه بها وما كان يأتي إلى السماع راكبا قط بل يمشي بين الناس فإذا لقيه رجلان قد تخاصما وتداعيا إليه وقف إليهما وأصلح بينهما غزير الدمعة طويل الفكرة كثير الذكر يصلح بين القبيلتين بنفسه فيصطلحان ببركته والقاضي إن بقي معه الغضب على المحدود بعد أخذ حق الله منه فهو غضب نفس وطبع أو لأمر في نفسه لذلك المحدود ما هو غصب لله فلذلك لا يأجره الله فإنه ما قام في ذلك مراعاة لحق الله وهذا من قوله تعالى ونَبْلُوَا أَخْبارَكُمْ فابتلاهم أولا بما كلفهم فإذا عملوا ابتلى أعمالهم هل عملوها لخطاب الحق أو عملوها لغير ذلك وهو قوله عز وجل أيضا يَوْمَ تُبْلَى السَّرائِرُ وهذا ميزانه عند أهل الكشف فلا يغفل الحاكم عند إقامة الحدود عن النظر في نفسه وليحذر من التشفي الذي يكون للنفوس ولهذا نهي عن الحكم في حال غضبه ولو لم يكن حاكما في حق من ابتلي بإقامة حد عليه فإن وجد لذلك تشفيا فيعلم أنه ما قام في ذلك لله وما عنده فيه خير من الله وإذا فرح بإقامة الحد على المحدود إن لم يكن فرحه له لما سقط عنه ذلك الحد في الآخرة من المطالبة وإلا فهو معلول وما عندي في مسائل الأحكام المشروعة بأصعب من الزنا خاصة ولو أقيم عليه الحد فإني أعلم أنه يبقى عليه بعد إقامة الحد مطالبات من مظالم العباد واعلم أن غير الحاكم ما عين الله له إقامة الحد عليه فلا ينبغي أن يقوم به غضب عند تعدى الحدود فليس ذلك إلا للحكام خاصة ولرسول الله صَلَّى اللهُ عَليهِ وسَلَّم من حيث ما هو حاكم فلو كان مبلغا لا حاكما لم يقم به غضب على من رد دعوته فإنه ليس له من الأمر شي‏ء وليس عليه هداهم فإن الله يقول في هذا للرسول صَلَّى اللهُ عَليهِ وسَلَّم إِنْ عَلَيْكَ إِلَّا الْبَلاغُ وقد بلغ فاسمع الله من شاء وأصم من شاء فهم أعقل الناس أعني الأنبياء وإذا كوشف الداعي على من أصمه الله عن الدعوة فما سمعها لم يتغير لذلك فإن الصائح إذا نادى من قام به الصمم وعلم أنه لم يسمع نداءه لم يجد عليه وقام عذره عنده فإن كان الرسول حاكما تعين عليه الحكم بما عين الله له فيه وهذا علم شريف يحتاج إليه كل وال في الأرض على العالم وأما علم ما يحتاج إليه الملك من الأرزاق فهو إن يعلم أصناف العالم وليس إلا اثنان وأعني بالعالم الذي يمشي فيهم حكم هذا الإمام وهم عالم الصور وعالم الأنفس المدبرون لهذه الصور فيما يتصرفون فيه من حركة أو سكون وما عدا هذين الصنفين فما له عليهم حكم إلا من أراد منهم أن يحكمه على‏\n\n\nنفسه كعالم الجان وأما العالم النوراني فهم خارجون عن إن يكون للعالم البشري عليهم تولية فكل شخص منهم على مقام معلوم عينه له ربه فما يتنزل إلا بأمر ربه فمن أراد تنزيل واحد منهم فيتوجه في ذلك إلى ربه وربه يأمره ويأذن له في ذلك إسعافا لهذا السائل أو ينزله عليه ابتداء وأما السائحون منهم فمقامهم المعلوم كونهم سياحين يطلبون مجالس الذكر فإذا وجدوا أهل الذكر وهم أهل القرآن الذاكرون القرآن فلا يقدمون عليهم أحدا من مجالس الذاكرين بغير القرآن فإذا لم يجدوا ذلك ووجدوا الذاكرين الله لا من كونهم تالين قعدوا إليهم ونادى بعضهم بعضا هلموا إلى بغيتكم فذلك رزقهم الذي يعيشون به وفيه حياتهم فإذا علم الإمام ذلك لم يزل يقيم جماعة يَتْلُونَ آياتِ الله آناءَ اللَّيْلِ والنهار وقد كنا بفأس من بلاد المغرب قد سلكنا هذا المسلك لموافقة أصحاب موفقين كانوا لنا سامعين وطائعين وفقدناهم ففقدنا لفقدهم هذا العمل الخالص وهو أشرف الأرزاق وأعلاها فأخذنا لما فقدنا مثل هؤلاء في بث العلم من أجل الأرواح الذين غذاؤهم العلم ورأينا أن لا نورد شيئا منه‏\n\n\nإلا من أصل هو مطلوب لهذا الصنف الروحاني وهو القرآن فجميع ما نتكلم فيه في مجالسي وتصانيفي إنما هو من حضرة القرآن وخزائنه أعطيت مفتاح الفهم فيه والإمداد منه وهذا كله حتى لا نخرج عنه فإنه أرفع ما يمنح ولا يعرف قدره إلا من ذاقه وشهد منزلته حالا من نفسه وكلمه به الحق في سره فإن الحق إذا كان هو المكلم عبده في سره بارتفاع الوسائط فإن الفهم يستصحب كلامه منك فيكون عين الكلام منه عين الفهم منك لا يتأخر عنه فإن تأخر عنه فليس هو كلام الله ومن لم يجد هذا فليس‏\nعنده علم بكلام الله عباده فإذا كلمه بالحجاب الصوري بلسان نبي أو من شاء الله من العالم فقد يصحبه الفهم وقد يتأخر عنه هذا هو الفرق بينهما وأما الأرزاق المحسوسة فإنه لا حكم له فيها إلا في بقية الله فمن أكل مما خرج عن هذه البقية لم يأكل من يد هذا الإمام العادل وليس مسمى رزق الله في حق المؤمنين إلا بقية الله وكل رزق في الكون من بقية الله وما بقي إلا أن يفرق بينهما وذلك أن جميع ما في العالم من الأموال لا يخلو إما أن يكون لها مالك معين أو لا يكون لها مالك فإن كان لها مالك معين فهي من بقية الله لهذا الشخص وإن لم يكن لها مالك معين فهي لجميع المسلمين فجعل الله لهم وكيلا هذا الإمام يحفظ عليهم ذلك فهذا من بقية الله الذي زاد على المال المملوك فكل رزق في العالم بقية الله إن عرفت معنى بقية الله فمال زيد بقية الله لزيد لما حجر الله عليه التصرف في مال عمرو بغير إذنه ومال عمرو بقية الله لعمرو لما حجر عليه التصرف في مال زيد بغير إذنه فما في العالم رزق إلا وهو بقية الله فيحكم الإمام فيه بقدر ما أنزل الله من الحكم فيه‏\n\n\n### [الناس على حالتين‏]\n\n\nفاعلم ذلك فالناس على حالتين اضطرار وغير اضطرار فحال الاضطرار يبيح قدر الحاجة في الوقت ويرفع عنه حكم التحجير فإذا نال ما يزيلها به رجح عليه حكم التحجير فإن كان المضطر قد تصرف فيما هو ملك لأحد تصرف فيه بحكم الضمان في قول وبغير ضمان في قول فإن وجد أداه عند القائل بالضمان وإن لم يجد فإمام الوقت يقوم عنه في ذلك من بيت المال وإن كان المتصرف قد تصرف فيما لا يملكه أحد أو يملكه الإمام بحكم الوكالة المطلقة من الله له فلا شي‏ء عليه لا ضمان ولا غيره وهذا علم يتعين المعرفة به على إمام الوقت لا بد منه فما تصرف أحد من المكلفين بالوجه المشروع إلا في بقية الله قال الله عز وجل بَقِيَّتُ الله خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ وهو حكم فرعي وإنما الأصل إن الله خلق لنا ما في الْأَرْضِ جَمِيعاً ثم حجر وأبقى فما أبقاه سماه بقية الله وما حجر سماه حراما أي المكلف ممنوع من التصرف فيه حالا أو زمانا أو مكانا مع التحجير فإن الأصل التوقف عن إطلاق الحكم فيه بشي‏ء فإذا جاء حكم الله فيه كنا بحسب الحكم الإلهي الذي ورد به الشرع إلينا فمن عرف هذا عرف كيف يتصرف في الأرزاق وأما علم تداخل الأمور بعضها على بعض فهذا معنى قوله تعالى يُولِجُ اللَّيْلَ في النَّهارِ ويُولِجُ النَّهارَ في اللَّيْلِ فالمولج ذكر والمولج فيه أنثى هذا الحكم له مستصحب حيث ظهر فهو في العلوم العلم النظري وهو في الحس النكاح الحيواني والنباتي وليس شي‏ء من ذلك مرادا لنفسه فقط بل هو مراد لنفسه ولما ينتجه ولو لا اللحمة والسد لما ظهر للشفة عين وهو سار في جميع الصنائع العملية والعلمية فإذا علم الإمام ذلك لم تدخل عليه شبهة في أحكامه وهذا هو الميزان الموضوع في العالم في المعاني والمحسوسات والعاقل يتصرف بالميزان في العالمين بل في كل شي‏ء له التصرف فيه وأما الحاكمون بالوحي المنزل أهل الإلقاء من الرسل وأمثالهم فما خرجوا عن التوالج فإن الله جعلهم محلا لما يلقي إليهم من حكمه في عباده قال تعالى نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ وقال تعالى يُنَزِّلُ الْمَلائِكَةَ بِالرُّوحِ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ فما ظهر حكم في العالم من رسول إلا عن نكاح معنوي لا في النصوص ولا في الحاكمين بالقياس فالإمام يتعين عليه علم ما يكون بطريق التنزيل الإلهي وبين ما يكون بطريق القياس وما يعلمه المهدي أعني علم القياس ليحكم به وإنما يعلمه ليتجنبه فما يحكم المهدي إلا بما يلقي إليه الملك من عند الله الذي بعثه الله إليه ليسدده وذلك هو الشرع الحقيقي المحمدي الذي لو كان محمد صَلَّى اللهُ عَليهِ وسَلَّم حيا ورفعت إليه تلك النازلة لم يحكم فيها إلا بما يحكم هذا الإمام فيعلمه الله أن ذلك هو الشرع المحمدي فيحرم عليه القياس مع وجود النصوص التي منحه الله إياها ولذلك‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في صفة المهدي يقفو أثري لا يخطئ‏\n\n\nفعرفنا أنه متبع لا متبوع وأنه معصوم ولا معنى للمعصوم في الحكم إلا أنه لا يخطئ فإن حكم الرسول لا ينسب إليه خطأ فإنه لا ينطق عَنِ الْهَوى‏ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏ كما أنه لا يسوغ القياس في موضع يكون فيه الرسول صَلَّى اللهُ عَليهِ وسَلَّم موجودا وأهل الكشف النبي عندهم موجود فلا يأخذون الحكم إلا عنه ولهذا الفقير الصادق لا ينتمي إلى مذهب إنما هو مع الرسول الذي هو مشهود له كما إن الرسول مع الوحي الذي ينزل عليه فينزل على قلوب العارفين الصادقين من الله التعريف بحكم النوازل أنه حكم الشرع الذي بعث به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وأصحاب علم الرسوم ليست لهم هذه المرتبة لما أكبوا عليه من حب الجاه والرئاسة والتقدم على عباد الله وافتقار العامة إليهم فلا يفلحون في أنفسهم ولا\nيفلح بهم وهي حالة فقهاء الزمان الراغبين في المناصب من قضاء وشهادة وحسبة وتدريس وأما المتنمسون منهم بالدين فيجمعون أكتافهم وينظرون إلى الناس من طرف خفي نظر الخاشع ويحركون شفاههم بالذكر ليعلم الناظر إليهم أنهم ذاكرون ويتعجمون في كلامهم ويتشدقون ويغلب عليهم رعونات النفس وقلوبهم قلوب الذئاب لا ينظر الله إليهم هذا حال المتدين منهم لا الذين هم قرناء الشيطان لا حاجة لله بهم لبسوا للناس جلود الضأن من اللين إخوان العلانية أعداء السريرة فالله يراجع بهم ويأخذ بنواصيهم إلى ما فيه سعادتهم وإذا خرج هذا الإمام المهدي فليس له عدو مبين إلا الفقهاء خاصة فإنهم لا تبقي لهم رياسة ولا تمييز عن العامة ولا يبقى لهم علم بحكم إلا قليل ويرتفع الخلاف من العالم في الأحكام بوجود هذا الإمام ولو لا أن السيف بيد المهدي لأفتى الفقهاء بقتله ولكن الله يظهره بالسيف والكرم فيطمعون ويخافون فيقبلون حكمه من غير إيمان بل يضمرون خلافه كما يفعل الحنفيون والشافعيون فيما اختلفوا فيه فلقد أخبرنا أنهم يقتتلون في بلاد العجم أصحاب المذهبين ويموت بينهما خلق كثير ويفطرون في شهر رمضان ليتقووا على القتال فمثل هؤلاء لو لا قهر الإمام المهدي بالسيف ما سمعوا له ولا أطاعوه بظواهرهم كما أنهم لا يطيعونه بقلوبهم بل يعتقدون فيه أنه إذا حكم فيهم بغير مذهبهم أنه على ضلالة في ذلك الحكم لأنهم يعتقدون أن زمان أهل الاجتهاد قد انقطع وما بقي مجتهد في العالم وأن الله لا يوجد بعد أئمتهم أحدا له درجة الاجتهاد وأما من يدعي التعريف الإلهي بالأحكام الشرعية فهو عندهم مجنون مفسود الخيال لا يلتفتون إليه فإن كان ذا مال وسلطان انقادوا في الظاهر إليه رغبة في ماله وخوفا من سلطانه وهم ببواطنهم كافرون به‏\n\n\n### [المهدي والمبالغة والاستقصاء في قضاء حوائج الناس‏]\n\n\nوأما المبالغة والاستقصاء في قضاء حوائج الناس فإنه متعين على الإمام خصوصا دون جميع الناس فإن الله ما قدمه على خلقه ونصبه إماما لهم إلا ليسعى في مصالحهم هذا والذي ينتجه هذا السعي عظيم وله في قصة موسى عليه السلام لما مشى في حق أهله ليطلب لهم نارا يصطلون بها ويقضون بها الأمر الذي لا ينقضي إلا بها في العادة وما كان عنده عليه السلام خبر بما جاءه فأسفرت له عاقبة ذلك الطلب عن كلام ربه فكلمه الله تعالى في عين حاجته وهي النار في الصورة ولم يخطر له عليه السلام ذلك الأمر بخاطر وأي شي‏ء أعظم من هذا وما حصل له إلا في وقت السعي في حق عياله ليعلمه بما في قضاء حوائج العائلة من الفضل فيزيد حرصا في سعيه في حقهم فكان ذلك تنبيها من الحق تعالى على قدر ذلك عند الله تعالى وعلى قدرهم لأنهم عبيده على كل حال وقد وكل هذا على القيام بهم كما قال تعالى الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ فانتج له الفرار من الأعداء الطالبين قتله الحكم والرسالة كما أخبر الله تعالى من قوله عليه السلام فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ وأعطاه السعي على العيال وقضاء حاجاتهم كلام الله وكله سعى بلا شك فإن الفار أتى في فراره بنسبة حيوانية فرت نفسه من الأعداء طلبا للنجاة وإبقاء للملك والتدبير على النفس الناطقة فما سعى بنفسه الحيوانية في فراره إلا في حق النفس الناطقة المالكة تدبير هذا البدن وحركة الأئمة كلهم العادلة إنما تكون في حق الغير لا في حق أنفسهم فإذا رأيتم السلطان يشتغل بغير رعيته وما يحتاجون إليه فاعلموا أنه قد عزلته المرتبة بهذا الفعل ولا فرق بينه وبين العامة ولما أراد عمر بن عبد العزيز يوم ولي الخلافة أن يقيل راحة لنفسه لما تعب من شغله بقضاء حوائج الناس دخل عليه ابنه فقال له يا أمير المؤمنين أنت تستريح وأصحاب الحاجات على الباب من أراد الراحة لا يلي أمور الناس فبكى عمر وقال الحمد لله الذي أخرج من ظهري من ينبهني ويدعوني إلى الحق ويعينني عليه فترك الراحة وخرج إلى الناس وكذلك خضر واسمه بليا بن ملكان بن فالغ بن غابر بن شالخ بن أرفخشد بن سام بن نوح عليه السلام كان في جيش فبعثه أمير الجيش يرتاد لهم ماء وكانوا قد فقدوا الماء فوقع بعين الحياة فشرب منه فعاش إلى الآن وكان لا يعرف ما\n\n\nخص الله به من الحياة شارب ذلك الماء ولقيته بإشبيلية وأفادني التسليم للشيوخ وأن لا أنازعهم وكنت في ذلك اليوم قد نازعت شيخا لي في مسألة وخرجت من عنده فلقيت الخضر بقوس الحنية فقال لي سلم إلى الشيخ مقالته فرجعت إلى الشيخ من حيني فلما دخلت عليه منزله فكلمني قبل إن أكلمه وقال لي يا محمد أحتاج في كل مسألة تنازعني فيها أن يوصيك الخضر بالتسليم للشيوخ فقلت له يا سيدنا ذلك هو الخضر\nالذي أوصاني قال نعم قلت له الحمد لله هذي فائدة ومع هذا فما هو الأمر إلا كما ذكرت لك فلما كان بعد مدة دخلت على الشيخ فوجدته قد رجع إلى قولي في تلك المسألة وقال لي إني كنت على غلط فيها وأنت المصيب فقلت له يا سيدي علمت الساعة أن الخضر ما أوصاني إلا بالتسليم ما عرفني بأنك مصيب في تلك المسألة فإنه ما كان يتعين على نزاعك فيها فإنها لم تكن من الأحكام المشروعة التي يحرم السكوت عنها وشكرت الله على ذلك وفرحت للشيخ الذي تبين له الحق فيها وهذا عين الحياة ماء خص الله به من الحياة شارب ذلك الماء ثم عاد إلى أصحابه فأخبرهم بالماء فسارع الناس إلى ذلك الموضع ليستقوا منه فأخذ الله بأبصارهم عنه فلم يقدروا عليه فهذا ما أنتج له سعيه في حق الغير وكذلك من والى في الله وعادى في الله وأحب في الله وأبغض في الله فهو من هذا الباب قال الله تعالى لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ أُولئِكَ كَتَبَ في قُلُوبِهِمُ الْإِيمانَ وأَيَّدَهُمْ بِرُوحٍ مِنْهُ فما يدري أحد ما لهم من المنزلة عند الله لأنهم ما تحركوا ولا سكنوا إلا في حق الله لا في حق أنفسهم إيثار الجناب الله على ما يقتضيه طبعهم وأما الوقوف على علم الغيب الذي يحتاج إليه في الكون خاصة في مدة خاصة وهي تاسع مسألة ليس وراءها ما يحتاج إليه الإمام في إمامته وذلك أن الله تعالى أخبر عن نفسه أنه كُلَّ يَوْمٍ هُوَ في شَأْنٍ والشأن ما يكون عليه العالم في ذلك اليوم ومعلوم أن ذلك الشأن إذا ظهر في الوجود عرف أنه معلوم لكل من شهده فهذا الإمام من هذه المسألة له اطلاع من جانب الحق على ما يريد الحق أن يحدثه من الشئون قبل وقوعها في الوجود فيطلع في اليوم الذي قبل وقوع ذلك الشأن على ذلك الشأن فإن كان مما فيه منفعة لرعيته شكر الله وسكت عنه وإن كان مما فيه عقوبة بنزول بلاء عام أو على أشخاص معينين سأل الله فيهم وشفع وتضرع فصرف الله عنهم ذلك البلاء برحمته وفضله وأجاب دعاءه وسؤاله فلهذا يطلعه الله عليه قبل وقوعه في الوجود بأصحابه ثم يطلعه الله في تلك الشئون على النوازل الواقعة من الأشخاص ويعين له الأشخاص بحليتهم حتى إذا رآهم لا يشك فيهم أنهم عين ما رآه ثم يطلعه الله على الحكم المشروع في تلك النازلة الذي شرع الله لنبيه محمد صَلَّى اللهُ عَليهِ وسَلَّم أن يحكم به فيها فلا يحكم إلا بذلك الحكم فلا يخطئ أبدا وإذا أعمى الله الحكم عليه في بعض النوازل ولم يقع له عليه كشف كان غايته أن يلحقها في الحكم بالمباح ويعلم بعدم التعريف إن ذلك حكم الشرع فيها فإنه معصوم عن الرأي والقياس في الدين فإن القياس ممن ليس بنبي حكم على الله في دين الله بما لا يعلم فإنه طرد علة وما يدريك لعل الله لا يريد طرد تلك العلة ولو أرادها لأبان عنها على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم وأمر بطردها هذا إذا كانت العلة مما نص الشرع عليها في قضية فما ظنك بعلة يستخرجها الفقيه بنفسه ونظره من غير أن يذكرها الشرع بنص معين فيها ثم بعد استنباطه إياها يطردها فهذا تحكم على تحكم بشرع لم يأذن به الله وهذا يمنع المهدي من القول بالقياس في دين الله ولا سيما وهو يعلم أن مراد النبي صَلَّى اللهُ عَليهِ وسَلَّم التخفيف في التكليف عن هذه الأمة ولذلك‏\n\n\nكان يقول صَلَّى اللهُ عَليهِ وسَلَّم اتركوني ما تركتكم وكان يكره السؤال في الدين خوفا من زيادة الحكم‏\n\n\nفكل ما سكت له عنه ولم يطلع على حكم فيه معين جعله عاقبة الأمر فيه الحكم بحكم الأصل وكل ما أطلعه الله عليه كشفا وتعريفا فذلك حكم الشرع المحمدي في المسألة وقد يطلعه الله في أوقات على المباح أنه مباح وعاقبة فكل مصلحة تكون في حق رعاياه يطلعه الله عليها ليسأله فيها وكل فساد يريد الله أن يوقعه برعاياه فإن الله يطلعه عليه ليسأل الله في رفع ذلك عنهم لأنه عقوبة كما قال ظَهَرَ الْفَسادُ في الْبَرِّ والْبَحْرِ بِما كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ فالمهدي رحمة كما كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم رحمة قال الله عز وجل وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ والمهدي يقفو أثره لا يخطئ فلا بد أن يكون رحمة كان‏\n\n\nرسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول لما جرح اللهم اهد قومي فإنهم لا يعلمون‏\n\n\nيعتذر لربه عنهم ولما علم أنه بشر وأن أحكام البشرية قد تغلب عليه في أوقات دعا ربه فقال اللهم إنك تعلم أني بشر أرضى كما يرضى البشر وأغضب كما يغضب البشر يعني أغضب عليهم وأرضى لنفسي اللهم من دعوت عليه فاجعل دعائي عليه رحمة له ورضوانا فهذه تسعة أمور لم تصح لإمام من أئمة الدين خلفاء الله ورسوله بمجموعها إلى يوم القيامة إلا لهذا الإمام المهدي كما أنه ما نص رسول الله‏\nص على إمام من أئمة الدين يكون بعده يرثه ويقفو أثره لا يخطئ إلا المهدي خاصة فقد شهد بعصمته في أحكامه كما شهد الدليل العقلي بعصمة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيما يبلغه عن ربه من الحكم المشروع له في عباده وفي هذا المنزل من العلوم علم الاشتراك في الأحدية وهو الاشتراك العام مثل قوله ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً وقال تعالى قُلْ هُوَ الله أَحَدٌ فوصف نفسه تعالى بالأحدية وهذه السورة نسب الحق تعالى وأفرد العبادة له من كل أحد وفيه علم الإنزال الإلهي وفيه علم المعنى الذي جعل الكتابة كلاما وحقيقة الكلام معلومة عند العقلاء والكلام مسألة مختلف فيها بين النظار وفيه علم الكلام المستقيم من الكلام المعوج وبما ذا يعرف استقامة الكلام من معوجه وفيه علم ما جاءت به الرسل عموما وخصوصا وفيه علم من تكلم بغير علم هل هو علم في نفس الأمر ولا علم عند من يرى أنه ليس بعلم أنه علم مع كونه يعلم أنه لا منطق إلا الله وفيه علم معرفة الصدق والكذب ولما ذا يرجعان والصادق والكاذب وفيه علم إذا علمه الإنسان ارتفع عنه الحرج في نفسه إذا رأى ما جرت به العادة في النفوس من الأمور العوارض أن يؤثر فيها حرجا حتى يود الإنسان أن يقتل نفسه لما يراه وهذا يسمى علم الراحة وهو علم أهل الجنة خاصة فمن فتح الله به على أحد من أهل الدنيا في الدنيا فقد عجلت له راحة الأبد مع ملازمة الأدب ممن هذه صفته في الأمر بالمعروف والنهي عن المنكر بقدر مرتبته وفيه علم ما أظهر الله للابصار على الأجسام أنه حلية الأجسام ومن قبح عنده بعض ما ظهر لما ذا قبح عنده ومن رآه كله حسنا لما رآه وبأي عين رآه فيقابله من ذاته بأفعال حسنة وهذا العلم من أحسن علم في العالم وأنفعه وهو الذي يقول بعض المتكلمين فيه لا فاعل إلا الله وأفعاله كلها حسنة فهؤلاء لا يقبحون من أفعال الله إلا ما قبحه الله فذلك لله تعالى لا لهم ولو لم يقبحوا ما قبح الله لكانوا منازعين لله عز وجل وفيه علم ما وضعه الله في العالم على سبيل التعجب وليس إلا ما خرق به العادة وأما الذين يعقلون عن الله فكل شي‏ء في العادة عندهم فيه تعجب وأما أصحاب العوائد فإنهم لا تعجب عندهم إلا فيما ظهر فيه خرق العادة وفيه علم التشوق إلى معالي الأمور من جبلة النفوس وبما ذا تعلم معالي الأمور هل بالعقل أو بالشرع وما هي معالي الأمور وهل هي أمر يعم العقلاء أو هو ما يراه زيد من معالي الأمور لا يراه عمرو بتلك الصفة فيكون إضافيا وفيه علم دخول الأطول في الأقصر وهو إيراد الكبير على الصغير وفيه علم أحكام الحق في الخلق إذا ظهر وإذا بطن ومن أي حقيقة يقبل الاتصاف بالظهور والبطون وفيه علم الحيرة التي لا يمكن لمن دخل فيها إن يخرج منها وفيه علم من يرى أمرا على خلاف ما هو عليه ذلك الأمر في نفسه وهل يصح لصاحب هذا العلم أن يجمع بين الأمرين أم لا وفيه علم اتساع البرازخ وضيقها وفيه علم ما للاعتدال والانحراف من الأثر فيما ينحرف عنه أو يقابل وفيه علم الأحوال في العالم وهل لها أثر في غير العالم أم لا أثر لها فيه وفيه علم ما يعظم عند الإنسان الكامل وما ثم أعظم منه ولما ذا يرجع ما يعظم عنده حتى يؤثر فيه حالة لا يقتضيها مقامه الذي هو فيه وهل حصل له ذلك العلم عن مشاهدة أو فكر وفيه علم هل يصح من الوكيل المفوض إليه المطلق الوكالة أن يتصرف في مال موكله تصرف رب المال من جميع الوجوه أو له حد يقف عنده في حكم الشرع وفيه علم حكمة طلب الأولياء الستر على مقامهم بخلاف الأنبياء عليهم صلوات الله وفيه علم السياسة في التعليم حتى يوصل المعلم العلم إلى المتعلم من حيث لا يشعر المتعلم أن المعلم قصد إفادته بما حصل عنده من العلم فيقول له المتعلم يا أستاذ لقد حصل لي من فعلك كذا وكذا مع كذا وكذا علم وافر صحيح وهو كذا ويتخيل المتعلم أن الذي حصل له من العلم بذلك‏\n\n\nالأمر لم يكن مقصودا للمعلم وهو مقصود في نفس الأمر للمعلم فيفرح المتعلم بما أعطاه الله من النباهة والتفطن حيث علم من حركة أستاذه علما لم يكن عنده في زعمه أن أستاذه قصد تعليمه وفيه علم من علوم الكشف وهو أن يعلم صاحب الكشف أن أي واحد أو جماعة قلت أو كثرت لا بد أن يكون معهم من رجال الغيب واحد عند ما يتحدثون فذلك الواحد ينقل أخبارهم في العالم ويجد ذلك الناس من نفوسهم في العالم يجتمع جماعة في خلوة أو يحدث الرجل نفسه بحديث لا يعلم به إلا الله فيخرج أو تخرج تلك الجماعة فتسمعه في الناس والناس يتحدثون به ولقد عملت أبياتا من الشعر بمقصورة ابن مثنى بشرقي جامع تونس من بلاد إفريقية عند صلاة العصر في يوم معلوم‏\nمعين بالتأريخ عندي بمدينة تونس فجئت إشبيلية وبينهما مسيرة ثلاثة أشهر للقافلة فاجتمع بي إنسان لا يعرفني فأنشدنى بحكم الاتفاق تلك الأبيات عينها ولم أكن كتبتها لأحد فقلت له لمن هي هذه الأبيات فقال لي لمحمد بن العربي وسماني فقلت له ومتى حفظتها فذكر لي التأريخ الذي عملتها فيه والزمان مع طول هذه المسافة فقلت له ومن أنشدك إياها حتى حفظتها فقال لي كنت جالسا في ليلة بشرق إشبيلية في مجلس جماعة على الطريق ومر بنا رجل غريب لا نعرفه كأنه من السياح فجلس إلينا فتحدث معنا ثم أنشدنا هذه الأبيات فاستحسناها وكتبناها فقلنا له لمن هذه الأبيات فقال لفلان وسماني لهم فقلنا له فهذه مقصورة ابن مثنى ما نعرفها ببلادنا فقال هي بشرقي جامع تونس وهنالك عملها في هذه الساعة وحفظتها منه ثم غاب عنا فلم ندر ما أمره ولا كيف ذهب عنا وما\n\n\nرأيناه ولقد كنت بجامع العديس بإشبيلية يوما بعد صلاة العصر وشخص يذكر لي عن رجل كبير من أهل الطريق من أكابرهم اجتمع به في خراسان فذكر لي فضله وإذا بشخص أنظر إليه قريبا منا والجماعة معي لا تراه فقال لي أنا هو هذا الشخص الذي يصفه لك هذا الرجل الذي اجتمع بنا في خراسان فقلت للرجل المخبر إن هذا الرجل الذي رأيته بخراسان أ تعرف صفته فقال نعم فأخذت أنعته له بآثار كانت فيه وحلية في خلقه فقال الرجل هو والله على صورة ما وصفت هل رأيته فقلت له هو ذا جالس يصدقك عندي فيما تخبر به عنه وما وصفته لك إلا وأنا أنظر إليه وهو عرفني بنفسه ولم يزل معي جالسا حتى انصرفت فطلبته فلم أجده وأما الأبيات التي أنشدنيها لي فهي هذه‏\n\n\n> مقصورة ابن مثنى *** أمسيت فيها معنى‏\n\n\n> بشادن تونسي *** حلوا للما يتمنى‏\n\n\n> خلعت فيه عذاري *** فأصبح الجسم مضنى‏\n\n\n> سألته الوصل لما *** رأيته يتجنى‏\n\n\n> وهز عطفيه عجبا *** كالغصن إذ يتثنى‏\n\n\n> وقال أنت غريب *** إليك يا هذا عنا\n\n\n> فذبت شوقا ويأسا *** ومت وجدا وحزنا\n\n\nوهذا الصبي يقال له أحمد بن الإدريسي من تجار البلد كان أبوه وكان شابا صالحا يحب الصالحين ويجالسهم وفقه الله وكان هذا المجلس بيني وبينه سنة تسعين وخمسمائة ونحن الآن في سنة خمس وثلاثين وستمائة وفيه علم ما يحمد من الجدال وما يذم منه ولا ينبغي لمسلم ممن ينتمي إلى الله أن يجادل إلا فيما هو فيه محق عن كشف لا عن فكر ونظر فإذا كان مشهودا له ما يجادل عنه حينئذ يتعين عليه الجدال فيه بِالَّتِي هِيَ أَحْسَنُ إذا كان مأمورا بأمر إلهي فإن لم يكن مأمورا فهو بالخيار فإن تعين له نفع الغير بذلك كان مندوبا إليه وإن يئس من قبول السامعين له فليسكت ولا يجادل فإن جادل فإنه ساع في هلاك السامعين عند الله وفيه علم قول الإنسان إنا مؤمن إن شاء الله مع علمه في نفسه في ذلك الوقت أنه مؤمن وهذه مسألة عظيمة الفائدة لمن نظر فيها تعلمه الأدب مع الله إذا لم يتعد الناطق بها الموضع الذي جعلها الله فيه فإن تعداه ولم يقف عنده أساء الأدب مع الله ولم ينجح له طلب وفيه علم الشي‏ء الذي يذكرك بالأمر الذي كنت قد علمته ثم نسيته وفيه علم الزيادة في الزمان والنقصان لما ذا ترجع وقول النبي صَلَّى اللهُ عَليهِ وسَلَّم قد يكون الشهر تسعا وعشرين لعائشة في إيلائه من نسائه‏\n\n\nوبما ذا ينبغي الأخذ من ذلك في الحكم الشرعي هل بأقل ما ينطلق عليه اسم الشهر أو بأكثر وفيه علم إيثار صحبة أهل الله على الغافلين عن الله وإن شملهم الايمان وفيه علم ما ينبغي لجلال الله أن يعامل به سواء أرضى العالم أم أسخطه وفيه علم المياه وهو علم غريب وما حد الري منها في المرتوي من الماء الذي يروي فإن من الماء ما يروي ومنه ما لا يروي وما هو الماء الذي جعل الله منه كل شي‏ء حي هل هو كل ماء أو له خصوص وصف من بين المياه ووصف الماء الذي خلق الله منه بنى آدم بالمهانة فقال خلقنا الإنسان من ماءٍ مَهِينٍ وفيه علم علامة من أسعده الله ممن أشقاه في الحياة الدنيا وفيه علم ما هي الدنيا في نفسها وما حياتها وما زينتها وفيه علم ما يبقى وما يفنى وما يقبل الفناء من العالم وما يقبل البقاء وفيه علم صورة الإحاطة بما لا يتناهى وما لا يتناهى لا يوصف بأنه محاط به لأنه يستحيل دخوله في الوجود وفيه علم أحوال الجان وتكليف الحق إياهم بالشرائع المنزلة من عنده هل هو تكليف ألزمهم الحق به ابتداء أو ألزموه أنفسهم فألزمهم الحق به كالنذر وفيه علم الفرق بين الفعل والمفعول وفيه علم من يقبل الإعانة في الفعل‏\nوفيه علم النحل والملل وفيه علم الاستحقاق وفيه علم ما لا ينفع العلم به وفيه علم العلم الغريب بما ذا تقبله النفوس وتقبل عليه أكثر من غيره وفيه علم يصح الإعراض عن العلم مع بقائه علما في المعرض عنه أو يقدح عنده شبهة فيه فلا يعرض عنه حتى يزول عنه أنه علم وهذا عند المحققين العارفين من أخفى العلوم وفيه علم الحجب التي تحول بين عين البصيرة وما ينبغي لها أن تدركه لو لا هذه الحجب وفيه علم الحلم والفرق بينه وبين العفو وعلم الغفور الرحيم هل هو برزخ بين الحليم والعفو ولهما حكم في هذا أم لا وفيه علم لا تتعدى الأمور مقاديرها عند الله وفيه علم ما الذي أغفل الأكابر عن الاستثناء الإلهي في أفعالهم كقصة سليمان وموسى وغيرهما عليه السلام وفيه علم رد ما ينبغي لمن ينبغي وهو أفضل العلوم لأنه يورث الراحة ويسلم من الاعتراض عليه في ذلك والله أعلم وفيه علم ما يحمده من نفسه وينكره من غيره ويذمه وفيه علم الوقوف بين العالمين ما حال الواقف فيه وفيه علم كون الحق ما أوجد شيئا إلا عن سبب فمن رفع الأسباب فقد جهل فمن يزعم أنه رفعها فما رفعها إلا بها إذ لا يصح رفع ما أقره الله وما يعطيه حال الوجود وما الفرق بين الأسباب المعتادة التي يجوز رفعها وبين الأسباب المعقولة التي لا يمكن رفعها وفيه علم من احتاط على عباد الله ما له عند الله وفيه علم اتخاذ الشبه أدلة ما الذي أعماهم عن كونها شبها وفيه علم من يهمل من عباد الله يوم القيامة ممن لا يهمل وفيه علم الخواص والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Sixty-Six: Concerning the knowledge of the station of the Viziers of the Mahdi, who will appear at the End of Time, whom the Messenger of Allah, peace and blessings be upon him, announced, and who is from the People of the House.\n\nThe Imam is poor, in need of the Vizier,\nAnd upon them both the sphere of Existence (فلك الوجود) revolves.\nAnd the kingdom, if its affairs are not set right\nBy the existence of these two, will surely perish.\nExcept for the True God (الإله الحق), He is transcendent;\nHe has no Vizier concerning what He wills.\nExalted is the True God in His Dominion\nFrom being seen by creation while He is in need.\n\n### [That Allah has a Caliph who will emerge when the Earth is filled with tyranny and oppression]\n\nKnow, may Allah support us, that Allah has a Caliph (خليفة) who will emerge when the Earth is filled with tyranny and oppression, and he will fill it with equity and justice. If only one day remained of the world, Allah would lengthen that day until this Caliph takes charge, from the progeny of the Messenger of Allah, peace and blessings be upon him, from the children of Fatima. His name will match the name of the Messenger of Allah, peace and blessings be upon him. His grandfather is Al-Husayn ibn Ali ibn Abi Talib. He will receive the pledge of allegiance (يبايع) between the Corner [of the Kaaba] and the Station [of Abraham] (الركن والمقام). He resembles the Messenger of Allah, peace and blessings be upon him, in his physical form (خَلْقه), but falls short of him in moral character (خُلُقه), because no one can be like the Messenger of Allah, peace and blessings be upon him, in his moral character. Allah says concerning him: <<وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ>> (And indeed, you are upon a magnificent moral character). He is broad-foreheaded (أجلى الجبهة), with a high-bridged nose (أقنى الأنف). The happiest people with him will be the people of Kufa. He will distribute wealth equally, deal justly with the subjects, and decide cases decisively. A man will come to him and say, \"O Mahdi, give me,\" and the wealth will be before him, and he will scoop it into the man's garment as much as he can carry. He will emerge after a period of religious decline. Allah will restrain through him what is not restrained by the Quran. He will go to sleep ignorant, stingy, and cowardly, and wake up the most knowledgeable of people, the most generous of people, the bravest of people. Allah will reform him in a single night. Victory will walk before him. He will live five, or seven, or nine [years]. He follows the footsteps of the Messenger of Allah, peace and blessings be upon him, making no mistake. An angel guides him from where he cannot see him. He bears the burden of all, strengthens the weak in truth, hosts the guest, and assists in rightful calamities, acting upon what he says, saying what he knows, and knowing what he witnesses (يشهد). He will conquer the Roman city [Constantinople] with *Takbir* (Allahu Akbar) alongside seventy thousand Muslims from the progeny of Isaac. He will witness the Great Battle (الملحمة العظمى), the banquet of Allah, at Marj Akka (the plain of Acre). He will destroy oppression and its people, establish the religion, and breathe the spirit back into Islam. Islam will be honored through him after its humiliation, and revived after its death. He will abolish the *Jizya* (poll tax) and call to Allah by the sword. Whoever refuses will be killed, and whoever challenges him will be abandoned. He will manifest the religion as it truly is, such that if the Messenger of Allah, peace and blessings be upon him, were alive, he would rule by it. He will remove the [legal] schools of thought (المذاهب) from the Earth, leaving only the pure religion (الدين الخالص). His enemies are the blind followers (مقلدة) among the scholars and the people of independent legal reasoning (أهل الاجتهاد), because they see him ruling contrary to what their Imams adopted. They will enter under his rule reluctantly, fearing his sword and might, yet desiring what he possesses. The common Muslims will rejoice in him more than their elite. The Gnostics (العارفون بالله) among the people of Realities (أهل الحقائق) will pledge allegiance to him based on witnessing (شهود) and unveiling (كشف), through a Divine introduction. He has Divine men (رجال إلهيون) who establish his call and support him—these are the Viziers. They bear the burdens of the kingdom and assist him in what Allah has entrusted to him. Jesus son of Mary will descend upon the White Minaret in the eastern part of Damascus, wearing two garments dyed with saffron, leaning on two angels, one on his right and one on his left. When he lowers his head, water will drip, and when he raises it, droplets like pearls will roll down, as if he has just emerged from a bathhouse. The people will be performing the afternoon prayer (*Asr*). The Imam will step back from his station, but [Jesus] will advance and lead the people in prayer. He will lead the people according to the Sunnah of Muhammad, peace and blessings be upon him. He will break the cross and kill the swine. Allah will take the Mahdi to Himself, pure and purified. During his time, the Sufyani will be killed near a tree in the Ghouta of Damascus, and his army will be swallowed by the earth (يخسف بجيشه) in the Al-Bayda desert between Medina and Mecca. Only one man from the tribe of Juhaynah will remain from that army. This army will have violated the sanctity of the Messenger’s city [Medina] for three days, then they will depart seeking Mecca. Allah will cause them to be swallowed by the earth in Al-Bayda. Whoever was compelled or coerced in that army will be resurrected according to his intention. The Quran is the judge, and the sword is the destroyer. That is why it was reported in the Hadith that Allah restrains through the ruler what is not restrained by the Quran.\n\nBehold, the Seal of the Saints (ختم الأولياء) is a witness,\nAnd the eye of the Imam of the Worlds is unique.\nHe is the Master, the Mahdi, from the family of Ahmad,\nHe is the Indian Sword (الصارم الهندي) when he destroys.\nHe is the sun that clears every sorrow and darkness,\nHe is the early spring rain when he is generous.\n\nHis time has come to you, and his era has cast its shadow upon you. He appeared in the fourth century, following the three preceding centuries: the century of the Messenger of Allah, peace and blessings be upon him (the Companions), then the one following it, then the one following the second. Then, periods of decline intervened, and events occurred, desires spread, blood was spilled, wolves ravaged the lands, and corruption multiplied until tyranny overflowed and its flood surged, and the daylight of justice turned its back as the night of oppression approached. His martyrs are the best of martyrs, and his trustees are the most excellent of trustees. Allah will appoint for him a group of Viziers whom He has hidden for him in the recesses of His Unseen (مكنون غيبه). He has informed them, through unveiling (كشفا) and witnessing (شهودا), of the Realities (الحقائق) and what Allah has commanded concerning His servants. By consulting them, he decides what he decides. They are the Gnostics who know what is there. As for the Mahdi himself, he is a man of the sword of truth and civil governance (سياسة مدنية). He knows from Allah what his rank and station require, because he is a guided Caliph (خليفة مسدد). He understands the speech of animals. His justice extends to humans and jinn.\n\n### [The Viziers of the Mahdi, peace be upon him, are non-Arabs (Ajam)]\n\nAmong the secrets of the knowledge of his Viziers, whom Allah has appointed for him, is His saying, the Exalted: <<وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ>> (And it was incumbent upon Us to support the believers). They follow the footsteps of the men among the Companions who <<صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ>> (were true to what they pledged to Allah). They are non-Arabs (الأعاجم); there is no Arab among them. Yet, they speak only Arabic. They have a guardian who is not of their kind, who has never disobeyed Allah. He is the most specialized of the Viziers and the most excellent of the trustees. Allah granted them, through this verse which they took as their daily recitation and their nightly companion, the highest knowledge of Truthfulness (الصدق) in state and direct experience. They knew that Truthfulness is the sword of Allah on Earth. It does not reside in anyone, nor is anyone characterized by it, except that Allah grants him victory, because Truthfulness is His Attribute and the Truthful is His Name. They looked with eyes free from affliction and walked with firm steps on the path of guidance. They did not see that the Real (الحق) restricted the believer to a specific type of believer, but rather made it incumbent upon Himself to support *the believers*. He did not specify *by whom* but sent it forth absolutely and manifested it as a reality. He said: <<يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا>> (O you who have believed, believe), and <<وَمَا كَانَ لِمُؤْمِنٍ أَنْ يَقْتُلَ مُؤْمِنًا إِلَّا خَطَأً>> (It is not for a believer to kill a believer except by mistake). And His saying: <<وَالَّذِينَ آمَنُوا بِالْبَاطِلِ>> (And those who believe in falsehood)—He called them believers. And His saying: <<وَإِنْ يُشْرَكْ بِهِ تُؤْمِنُوا>> (And if He is associated with partners, you believe)—He called the polytheist a believer. These are the believers whom Allah addressed in His saying: <<يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَى رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ>> (O you who have believed, believe in Allah and His Messenger and the Book which He has sent down to His Messenger and the Book which He sent down before). He distinguished them from the believers among the People of the Book and the Books. No informant came with news except the Messengers. Thus, it is determined that the believers who were commanded to believe are those who believed in falsehood and believed in a partner due to a misconception that diverted them from the evidence. For those who believed in falsehood disbelieved in Allah, and those who believed in a partner had their hearts shrink with aversion <<إِذَا ذُكِرَ اللَّهُ وَحْدَهُ>> (when Allah alone was mentioned). This news only came to them through their misleading imams who preceded them. And this was, in their estimation, based on proof—meaning the imams, not due to deficiency, but because they fulfilled the right of contemplation. Their readiness granted by Allah did not give them more, and Allah does not burden a soul except with what He has given it (<<وَمَا كَلَّفَ اللَّهُ نَفْسًا إِلَّا مَا آتَاهَا>>). And what He gave it is nothing other than what it brought forth. Their followers believed in this and were truthful in their belief. They intended only the path of salvation; they did not intend what would destroy them. When they saw that Allah acts initially and acts through means, they made the partner like a Vizier, assisting in the manifestation of some acts occurring in Existence (الوجود). So, when Allah alone was mentioned, they saw that the one mentioning Him did not fulfill the matter its due right, because they knew that some acts depend on the existence of some creatures. Their witnessing was only of the Divine Acts (الأفعال الإلهية) occurring in Existence through created causes. Thus, they did not accept the Unity of Acts (توحيد الأفعال) because they did not witness it. Had they accepted it, they would have nullified Allah’s wisdom in establishing causes, both high and low. This is what led them to aversion and lack of fairness. Allah condemned them, preferring the side of the believers who saw no agent except Allah, and that created power and matters dependent on causes have no effect on the Act. This group alone is the one Allah singled out with this address. As for those who disbelieved in Allah, they are those who veiled Him with the curtain of polytheism (الشرك) and believed in falsehood. Falsehood is non-existence (عدم). They saw that nothing is free from anthropomorphism and association except non-existence. For Existence is a shared attribute. Thus, their belief in falsehood is a belief in transcendence (تنزيه), and their disbelief—meaning their veiling—is the attribution of Existence to Allah, due to the partnership that occurs therein. That is why the Exalted said: <<أُولَئِكَ هُمُ الْخَاسِرُونَ>> (Those are the losers), because in their trade, they lost the profit of manifesting the complete matter as it truly is. <<فَاشْتَرَوُا الضَّلَالَةَ بِالْهُدَى>> (So they exchanged error for guidance)—meaning confusion (الحيرة) for clarity (البيان). They chose confusion, knowing that the matter is immense and that clarity imposes limits, while He is not limited. So they preferred confusion over clarity. As for the people of sound intellect, correct contemplation, and general faith, they are those who established confusion in its proper station and place.\n\nThe Prophet, peace and blessings be upon him, said: \"Increase my bewilderment concerning You.\"\n\nAnd they established clarity in its station, where the knowledge of that matter cannot be perfected except through clarity, and which does not accept confusion. So they gave every possessor of right his due and placed wisdom in its proper place. All of them are believers, for Allah called them believers, just as He called them disbelievers and polytheists. He placed them at different levels (مراتب) in their faith. Therefore, He said: <<لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ>> (that they might increase in faith added to their faith) concerning what they believed, just as He increased them in sickness: <<وَرِجْسًا إِلَى رِجْسِهِمْ>> (and filth added to their filth) concerning what they disbelieved. Among them is the truthful and the most truthful. Allah grants victory to the believer whose faith has no defect over the one whose faith has a defect. Allah abandons him according to the measure of the defect that entered him, whichever believer he may be. The believer of perfect faith is always victorious. That is why no Prophet or Saint (ولي) has ever been defeated. Do you not see on the Day of Hunayn, when the Companions, may Allah be pleased with them, claimed the Unity of Allah, then saw their great numbers, and their numbers impressed them? They forgot Allah at that moment. Their great numbers availed them nothing, just as the idols of the others availed them nothing, despite the Companions being believers without doubt. But a defect entered them by relying on their multitude and forgetting Allah’s saying: <<كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ>> (How many a small company has overcome a large company by permission of Allah). Allah only permitted victory here, so He brought it into existence, and the small company overcame them by Allah’s permission.\n\nThere is nothing there but Allah, there is none besides Him,\nAnd every insightful one sees Him in Existence (الوجود).\n\n### [The effect of Truthfulness is witnessed in individuals who do not possess that station]\n\nAs for the effect of Truthfulness, it is witnessed in individuals who do not possess that station due to the means of felicity brought by the Divine Laws, but who have a firm footing in Truthfulness. They kill by spiritual resolve (الهمة), which is Truthfulness. Abu Yazid [al-Bistami] was asked, \"Show us the Greatest Name of Allah.\" He replied, \"Show us the lesser name, and I will show you the Greatest Name.\" All of Allah’s Names are great. It is nothing but Truthfulness. Be truthful, and take whichever Name you wish, and you will do with it whatever you wish. By this [Truthfulness], Abu Yazid revived the ant, and Dhul-Nun revived the son of the woman whom the crocodile had swallowed. If you understand this, a door to your felicity has been opened for you. If you act upon it, Allah will make you happy wherever you are, and you will never err. From this perspective, you will be at ease with Allah when the disbelievers prevail over the Muslims, for you will know that the Muslims’ faith has been shaken and a defect has entered it, and that the disbelievers, in what they believed of falsehood, and the polytheists, have not had their faith shaken or disturbed. Victory is the brother of Truthfulness; it follows it wherever it is. If it were otherwise, the Muslims would never have been defeated, just as no Prophet was ever defeated. You witness the victory and support of the disbelievers at one time, and the victory and support of the Muslims at another. The truthful one from either party is never defeated completely; rather, he remains steadfast until he is killed or withdraws without defeat. The Viziers of the Mahdi stand upon this footing. Do you not see that they conquer the Roman city with *Takbir*? They pronounce the first *Takbir*, and one-third of its wall falls. They pronounce the second, and the second third of the wall falls. They pronounce the third, and the final third falls. Thus, they conquer it without a sword. This is the very essence of the Truthfulness we mentioned. They are a group—meaning the Viziers of the Mahdi—fewer than ten. If the Imam Mahdi knows this, he will act upon it, and thus he will be the most truthful person of his time. His Viziers are the guides, and he is the Guided One. This is the measure of the knowledge of Allah that the Mahdi receives at the hands of his Viziers.\n\n### [The Seal of the Muhammadan Sainthood]\n\nAs for the Seal of the Muhammadan Sainthood (ختم الولاية المحمدية), he is the most knowledgeable of creation concerning Allah. There will be no one in his time, nor after his time, more knowledgeable of Allah and the sources of Divine Rulings than him. He and the Quran are brothers, just as the Mahdi and the sword are brothers. The Messenger of Allah, peace and blessings be upon him, only expressed doubt about the duration of his stay as Caliph—from five to nine [years]—due to the doubt concerning his Viziers, because for every Vizier with him, there is one year. If they are five, he lives five [years]. If they are seven, he lives seven. If they are nine, he lives nine. For every year, there are specific circumstances, and the knowledge of what is appropriate for that year is specialized to one of his Viziers. They are no fewer than five and no more than nine, for this is the limit of the doubt expressed by the Messenger of Allah, peace and blessings be upon him, in his saying: \"five, or seven, or nine\" concerning the Mahdi’s reign. All that is required for the establishment of his Viziership consists of nine matters, no tenth, and they do not fall short of this. They are: Penetrating Insight (نفوذ البصر), knowledge of the Divine Address (الخطاب الإلهي) upon its transmission, the science of translation from Allah (علم الترجمة عن الله), the designation of ranks (تعيين المراتب) for those in authority, mercy in anger (الرحمة في الغضب), knowledge of the provisions (الأرزاق) required by the ruler, both sensible and intelligible, the science of the interpenetration of matters (تداخل الأمور) one into another, diligence and thoroughness in fulfilling people’s needs, and knowledge of the Unseen (علم الغيب) specifically required for the cosmos during his period. These are nine matters that must reside in the Vizier of the Imam Mahdi if the Vizier is one, or in his Viziers if they are more than one.\n\nAs for Penetrating Insight, it is so that his call to Allah is based on clear sight (بصيرة) concerning the one being called, not the caller. He looks into the essence (عين) of every person he calls and sees what makes it possible for that person to respond to his call, and he calls him based on that, even if through insistence. If he sees that the person will not respond, he calls him without insistence, specifically to establish the proof against him. For the Mahdi is Allah’s proof against the people of his time. This is the rank of the Prophets in which participation occurs. Allah the Exalted said: <<أَدْعُوا إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call to Allah upon clear sight—I and those who follow me). He informed this concerning His Prophet, peace and blessings be upon him. The Mahdi is among those who follow him, and the Prophet, peace and blessings be upon him, does not err in his call to Allah, so his follower does not err, for he follows his footsteps. Thus, the Hadith was reported concerning the description of the Mahdi, that the Prophet, peace and blessings be upon him, said: \"He follows my footsteps, making no mistake.\" This is infallibility (العصمة) in the call to Allah, and many Saints attain it, indeed all of them. Part of the ruling of Penetrating Insight is that its possessor perceives the luminous and fiery spirits without any intention from the spirits, nor their manifestation or formation.\n\nLike Ibn Abbas and Aisha, may Allah be pleased with them both, when they perceived Gabriel, peace be upon him, speaking to the Messenger of Allah, peace and blessings be upon him, without Gabriel knowing this or intending to appear to them. They informed the Messenger of Allah, peace and blessings be upon him, of this, but did not know it was Gabriel, peace be upon him. The Prophet, peace and blessings be upon him, asked her, \"Did you see him?\" And he asked Ibn Abbas, \"Did you see him?\" They said, \"Yes.\" He said, \"That was Gabriel.\"\n\nLikewise, they perceive the Men of the Unseen (رجال الغيب) even when they intend to be veiled and not appear to sight. The possessor of this state sees them. Also, part of Penetrating Insight is that when meanings are embodied for them, they recognize them in the very form they take, knowing which meaning has been embodied without hesitation.\n\n### «Section» As for the knowledge of the Divine Address upon its transmission\n\nIt is His saying, the Exalted: <<وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا>> (It is not for any human that Allah should speak to him except by inspiration [wahy], or from behind a veil, or by sending a messenger). As for *wahy* (inspiration), it is what He casts into their hearts in the manner of a communication, resulting in knowledge of a certain matter, which is contained in that communication. If it is not like this, it is neither *wahy* nor an address. For some hearts find knowledge of a certain matter among the necessary sciences known to people; that is sound knowledge, but not from an address or speech. Our discussion is only about the Divine Address called *wahy*. Allah made this type of *wahy* speech, and from the speech, one gains the knowledge for which that speech came. By this, one differentiates when this is found. As for His saying: \"or from behind a veil,\" this is a Divine Address cast upon the hearing, not the heart. The one upon whom it is cast perceives it and understands the intention of the one who made him hear it. This may also occur in the forms of Theophany (صور التجلي), and that Divine Form—which is the very veil—addresses him. He understands from that address the knowledge it indicates, and he knows that this is a veil and that the Speaker is from behind that veil. Not everyone who perceives the form of the Divine Theophany knows that it is Allah. The possessor of this state is only distinguished by knowing that this form, even though it is a veil, is the very manifestation of the Real (الحق) to him. As for His saying: \"or by sending a messenger,\" this is what the angel brings down, or what the human messenger brings to us when they specifically convey the speech of Allah, such as the reciter. The Exalted said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ>> (Then grant him protection until he hears the word of Allah), and His saying: <<وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّا>> (And We called him from the side of the Mount, the right, and brought him near in private conversation), and His saying: <<نُودِيَ أَنْ بُورِكَ مَنْ فِي النَّارِ وَمَنْ حَوْلَهَا>> (He was called: 'Blessed is whoever is in the fire and whoever is around it'). If they convey knowledge and express it, and find it within themselves, that is not Divine Speech. The messenger and the form may occur together, and that is in the very act of writing. The writing is a messenger, and it is the very veil over the Speaker. It makes you understand what it brought. However, this is not the case if one writes what he already knows. It is only the case if one writes based on a communication addressed to him by those very letters he inscribes. If it is not like this, it is not speech. This is the criterion. The transmission is for the Messengers, and the casting of the Divine news is by the removal of intermediaries, in the sense that He spoke to him and nothing else. Writing consists of inscribed figures which, wherever they are, are only inscribed based on a communication from the one who inscribed them, not based on knowledge. All of this is part of the Divine Address for the possessor of this station.\n\n### [The science of translation from Allah]\n\nAs for the science of translation from Allah, this belongs to everyone to whom Allah speaks through casting and inspiration. The translator is the creator of the forms of verbal or inscribed letters that he brings into existence, and the spirit of those forms is the Speech of Allah and nothing else. If he translates from knowledge [he already possesses], he is not a translator. This is necessary. The Saint says, \"My heart narrated to me from my Lord.\" The translator may translate from the tongues of states, but that is not from this chapter; rather, it is from another chapter related to the very understanding of states, which is known to the scholars of external forms. They interpret His saying, the Exalted: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is nothing except that it glorifies Him with praise), saying it means by the tongue of state. Likewise, His saying, the Exalted: <<إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا>> (Indeed, We offered the Trust to the heavens and the earth and the mountains, and they declined to bear it and feared it). They made this refusal and fear a state, not a reality. Likewise, His saying concerning them: <<قَالَتَا أَتَيْنَا طَائِعِينَ>> (They said: 'We have come willingly')—a statement of state, not a statement of address. All of this is incorrect and not the intended meaning in these verses. Rather, the matter is according to its apparent meaning, as it was revealed. This is how the people of Unveiling perceive it. When they translate from existing things, they only translate what those things address them with, not their states. For if they spoke, they would say this. The proponents of this view are divided into two groups. Some say: If this and its like is truly speech and reality, then life must be created in these speakers, and then it is valid for it to be a reality. It is permissible for Allah to create life in them, but we have no knowledge whether the matter occurred as we permitted, or if it is the tongue of state. As for the proponents of the other view, the matter occurred exactly as they said, because everything other than Allah is alive and speaking in reality. Thus, the concept of 'states' has no meaning for the people of Unveiling and Existence. The second group, the philosophers, said: This must be the tongue of state, because it is impossible for inanimate objects to be alive. This is a statement veiled by the thickest veil. There is no one in the world except a translator if he translates from a Divine communication. Understand this.\n\n### [The designation of ranks for those in authority]\n\nAs for the designation of ranks for those in authority, it is the knowledge of what every rank deserves of the benefits for which it was created. The possessor of this knowledge looks into the essence of the person he intends to appoint and raises the scale between him and the rank. If he sees equilibrium in the weighing, without the scale of the rank outweighing, he appoints him. If the scale of the appointee outweighs, it does not harm him. But if the scale of the rank outweighs the appointee, he does not appoint him, because the appointee falls short of the knowledge by which the rank outweighed, and he will undoubtedly commit tyranny. This is the origin of tyranny among rulers. It is impossible, in our view, for one to know [the truth] and then deviate entirely from the ruling of his knowledge. This is permissible according to the scholars of external forms, but in our view, this permissible thing does not occur in Existence. This is a difficult issue. That is why the Mahdi will fill the Earth with equity and justice, just as it was filled with tyranny and oppression. For knowledge, in our view, necessitates action, and if not, it is not knowledge, even if it appears in the form of knowledge. The ranks are three, in which the ruler’s judgment is executed: blood, honor, and wealth. He knows what each rank requires of the Divinely Legislated Ruling. He looks at the people, and whoever he sees has gathered what that rank requires, he then looks at the temperament of that person. If he sees that the person acts under the rule of knowledge, he knows he is rational and appoints him. If he sees that the person rules over his knowledge, and that his knowledge is subdued by the rule of his desire and the authority of his caprice, he does not appoint him, even with his knowledge of the ruling. One of the kings consulted one of his wise and insightful courtiers, asking him, \"Whom do you think I should appoint over the affairs of the people?\" He replied, \"Appoint a rational man over the affairs of the people. For the rational man seeks what is best for himself. If he is knowledgeable, he rules by what he knows. If he is not knowledgeable about that specific incident, his intellect compels him to ask someone who knows the Divinely Legislated Ruling concerning that matter. Once he knows it, he rules by it.\" This is the benefit of the intellect. For many who claim adherence to religion and formal knowledge are ruled by their desires, but the rational man is not like that. The intellect only accepts virtues, for it restrains its possessor from acting improperly. That is why it is called *aql* (intellect), from *iqal* (fetter).\n\nAs for mercy in anger, this only occurs in the prescribed legal punishments and discretionary punishments. Anything other than that is anger devoid of mercy. That is why Abu Yazid [al-Bistami] said, \"My striking is more severe,\" when he heard the reciter read: <<إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ>> (Indeed, the grasp of your Lord is severe). If a person becomes angry for himself, that anger does not contain mercy in any way. But if he becomes angry for Allah, his anger is Allah’s anger, and Allah’s anger is not free from a Divine Mercy that permeates it. His anger in this world is what He established of the legal and discretionary punishments. His anger in the Hereafter is the punishments He establishes for those who enter the Fire. Even though it is anger, it is a purification due to the mercy that permeates it in this world and the Hereafter, because Mercy preceded Anger in Existence, encompassing the entire cosmos and embracing everything. When Anger came into Existence, it found Mercy had preceded it, and since its existence was necessary, it was with Mercy, like water mixed with milk. Just as the water is not free from the milk, the Anger is not free from the Mercy. Mercy ruled over Anger because it is the owner of the place. Allah’s Anger ends for those upon whom He is angry, but Allah’s Mercy never ends. This Mahdi only becomes angry for Allah, so his anger does not exceed the establishment of the limits that Allah has legislated, unlike one who becomes angry for his own caprice or the frustration of his goal. Such a person who becomes angry for Allah can only be just and equitable, not tyrannical or oppressive. The sign of one who claims this station, if he becomes angry for Allah and is a ruler who establishes the punishment upon the one he is angry with, is that the anger towards that person vanishes upon completion. He may even stand up to him, embrace him, and comfort him, saying, \"Praise Allah who purified you,\" showing him joy and cheerfulness, and perhaps even treating him kindly afterward. This is his measure. That person who received the punishment returns to a state of complete mercy. I saw this in one of the judges in the lands of the Maghreb, the Qadi of the city of Ceuta, named Abu Ibrahim ibn Yaghmur. He used to attend the Hadith sessions with us under our Shaykh Abu al-Husayn ibn al-Sa’igh, a descendant of Abu Ayyub al-Ansari, and under Abu al-Sabr Ayyub al-Fihri, and under Abu Muhammad ibn Abdullah al-Hajari in Ceuta during his judgeship there. He never came to the session riding, but walked among the people. If two men met him having a dispute, he would stop and reconcile them. He was profuse in tears, long in contemplation, frequent in remembrance. He would reconcile two tribes himself, and they would make peace through his blessing. If the judge retains anger toward the punished person after taking Allah’s right from him, that anger is anger of the soul and temperament, or for a personal matter concerning that person; it is not anger for Allah. Therefore, Allah will not reward him, for he did not act out of regard for Allah’s right. This relates to His saying, the Exalted: <<وَنَبْلُوَا أَخْبَارَكُمْ>> (And We test your reports). He tests them first with what He commanded them. When they act, He tests their actions: did they perform them for the address of the Real or for something else? This is His saying, the Mighty and Majestic: <<يَوْمَ تُبْلَى السَّرَائِرُ>> (The Day when secrets will be tested). This is the measure according to the people of Unveiling. The ruler must not be heedless of examining his own soul when establishing punishments, and he must beware of the gratification that souls seek. That is why one is forbidden from judging while angry, even if he is not the ruler in the case of one upon whom a punishment is established. If he finds gratification in it, he knows that he did not act for Allah, and he has no good from Allah in it. If he rejoices in establishing the punishment upon the punished, unless his joy is for the fact that the punishment has been removed from him in the Hereafter from the demands [of justice], then his action is flawed. I find no issue in the legislated rulings more difficult than that of fornication specifically, even if the punishment is established upon him, for I know that demands from the injustices of the servants remain upon him after the establishment of the punishment. Know that Allah has not designated the establishment of punishment for anyone other than the ruler. Therefore, anger should not arise in one who is not a ruler when limits are transgressed. That is only for the rulers specifically, and for the Messenger of Allah, peace and blessings be upon him, insofar as he is a ruler. If he were merely a conveyor [of the message] and not a ruler, anger would not arise in him toward one who rejected his call, for he has no authority over the matter, and their guidance is not incumbent upon him. Allah says concerning this to the Messenger, peace and blessings be upon him: <<إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ>> (There is not upon you except the conveyance). He conveyed it, and Allah made whom He willed hear, and whom He willed deaf. They are the most rational of people—meaning the Prophets. If the caller is granted unveiling concerning the one whom Allah has made deaf to the call, and he did not hear it, the caller does not change his attitude because of it. For if the shouter calls someone who is deaf, and he knows that the person did not hear his call, he does not feel resentment toward him, and the deaf person’s excuse is accepted by him. If the Messenger is a ruler, then the ruling that Allah has designated for him becomes incumbent upon him. This is a noble science required by every authority on Earth over the world.\n\nAs for the knowledge of the provisions required by the ruler, it is knowing the categories of the world, which are only two. I mean by 'the world' those over whom the rule of this Imam extends: the world of forms and the world of souls that govern these forms in their movements or stillness. Anything other than these two categories is not subject to his rule, except for those who wish to be ruled by him, such as the world of the Jinn. As for the luminous world, they are outside the scope of human authority. Every individual among them is at a known station designated by his Lord, and he only descends by the command of his Lord. Whoever wishes to bring one of them down must turn to his Lord for that, and his Lord commands him and grants him permission, either in response to the petitioner or by sending him down initially. As for the wanderers among them, their known station is that they are travelers seeking gatherings of remembrance. If they find the people of remembrance—who are the people of the Quran, remembering the Quran—they do not prefer anyone over them among the gatherings of those who remember without the Quran. If they do not find that, and they find those who remember Allah but are not reciters, they sit with them and call one another, \"Come to your desire!\" That is their provision by which they live, and in it is their life. If the Imam knows this, he will continuously establish a group who <<يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَالنَّهَارِ>> (recite the verses of Allah during the hours of the night and day). We were in Fez in the lands of the Maghreb, following this path, in agreement with successful companions who were listening and obedient to us. We lost them, and due to their loss, we lost this pure work, which is the noblest and highest of provisions. When we lost such people, we turned to disseminating knowledge for the sake of the spirits whose nourishment is knowledge. We decided not to present anything of it except from a source sought by this spiritual category, which is the Quran. All that we speak of in my sessions and my writings is only from the Presence of the Quran (حضرة القرآن) and its treasures. I have been given the key to understanding it and the spiritual support from it. This is all so that we do not depart from it, for it is the highest gift, and its worth is known only to those who have tasted it and witnessed its station as a state within themselves, and to whom the Real has spoken with it in their secret heart. For if the Real is the one who speaks to His servant in his secret heart, without intermediaries, then understanding accompanies His speech from you. The very speech from Him is the very understanding from you; it does not lag behind. If it lags behind, it is not the Speech of Allah. Whoever does not find this does not have knowledge of Allah’s speaking to His servants. If He speaks to him through the formal veil by the tongue of a Prophet or whomever Allah wills among creation, understanding may accompany it or it may lag behind. This is the difference between the two. As for the sensible provisions, he has no authority over them except in the \"Remainder of Allah\" (بقية الله). Whoever eats from what is outside this Remainder does not eat from the hand of this Just Imam. The term \"Provision of Allah\" concerning the believers is nothing but the Remainder of Allah. Every provision in the cosmos is from the Remainder of Allah. It only remains to differentiate between them. All wealth in the world is either owned by a specific owner or not owned by anyone. If it has a specific owner, it is the Remainder of Allah for that person, because Allah restricted him from disposing of the wealth of Amr without his permission. If it has no specific owner, it belongs to all Muslims. Allah made this Imam their agent to safeguard it for them. This is part of the Remainder of Allah that is added to owned wealth. Every provision in the world is the Remainder of Allah, if you know the meaning of the Remainder of Allah. Zayd’s wealth is the Remainder of Allah for Zayd, because Allah restricted him from disposing of Amr’s wealth without his permission. Amr’s wealth is the Remainder of Allah for Amr, because Allah restricted him from disposing of Zayd’s wealth without his permission. Thus, there is no provision in the world except that it is the Remainder of Allah. The Imam rules concerning it according to the ruling Allah has revealed regarding it.\n\n### [People are in two states]\n\nKnow that people are in two states: necessity (اضطرار) and non-necessity. The state of necessity permits [taking] the measure of need at that moment and removes the ruling of restriction (التحجير) from him. When he obtains what removes the necessity, the ruling of restriction returns to him. If the person in necessity disposed of something owned by someone else, he disposed of it under the ruling of guarantee according to one opinion, and without guarantee according to another. If he finds [the means], he pays it back according to the opinion that requires guarantee. If he does not find it, the Imam of the Time pays it on his behalf from the public treasury. If the person in necessity disposed of something not owned by anyone, or owned by the Imam by virtue of the absolute agency from Allah to him, then nothing is incumbent upon him, neither guarantee nor anything else. This is a science that must be known by the Imam of the Time; it is indispensable. No accountable person acts in a legislated manner except in the Remainder of Allah. Allah, the Mighty and Majestic, said: <<بَقِيَّتُ اللَّهِ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ>> (The Remainder of Allah is better for you, if you are believers). This is a subsidiary ruling. The origin is that Allah created for us <<مَا فِي الْأَرْضِ جَمِيعًا>> (whatever is on the earth, all of it), then He restricted and left a remainder. What He left as a remainder, He called the Remainder of Allah. What He restricted, He called forbidden—meaning the accountable person is prevented from disposing of it, whether temporarily, spatially, or permanently, along with the restriction. The origin is to refrain from issuing an absolute ruling concerning it. When Allah’s ruling concerning it comes, we act according to the Divine Ruling brought to us by the Law. Whoever knows this knows how to dispose of provisions.\n\nAs for the science of the interpenetration of matters one into another, this is the meaning of His saying, the Exalted: <<يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ>> (He causes the night to enter into the day, and He causes the day to enter into the night). The one causing entry is masculine, and the one entered into is feminine. This ruling is continuous wherever it appears. In the sciences, it is theoretical knowledge. In the sensible world, it is animal and plant copulation. None of this is intended for itself alone, but it is intended for itself and for what it produces. Were it not for the warp and the weft, the lip would not appear. This is pervasive in all practical and theoretical crafts. If the Imam knows this, no ambiguity will enter his rulings. This is the scale established in the world, in both meanings and sensible things. The rational person acts by the scale in both worlds, indeed, in everything over which he has authority. As for those who rule by the revealed inspiration—the people of transmission among the Messengers and their like—they have not departed from interpenetration. Allah made them the locus for what He casts upon them of His ruling concerning His servants. The Exalted said: <<نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ>> (The Trustworthy Spirit brought it down upon your heart), and His saying: <<يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ>> (He sends down the angels with the inspiration [Ruh] of His command upon whom He wills of His servants). No ruling has appeared in the world from a Messenger except through a spiritual copulation, neither in the texts nor in those who rule by analogy. The Imam must know the difference between what occurs through Divine Revelation and what occurs through analogy. The Mahdi does not learn analogical reasoning in order to rule by it, but rather to avoid it. The Mahdi only rules by what the angel casts upon him from Allah, whom Allah sent to guide him. That is the true Muhammadan Law (الشرع الحقيقي المحمدي). If Muhammad, peace and blessings be upon him, were alive and that case were presented to him, he would rule in it only as this Imam rules. Allah informs him that this is the Muhammadan Law, and thus analogical reasoning is forbidden to him, given the existence of the texts that Allah has granted him. Therefore, the Messenger of Allah, peace and blessings be upon him, said in describing the Mahdi: \"He follows my footsteps, making no mistake.\"\n\n### [The youth whom the Dajjal kills]\n\nAs for the youth whom the Dajjal kills—in the Dajjal’s estimation, not in reality—he is a young man full of youth. This is how he appears in the Dajjal’s eye. It has been said that the youth whom the Dajjal claims to kill is one of the People of the Cave, but this is not correct according to us, based on the path of Unveiling (الكشف). The appearance of the Mahdi is among the signs of the Hour’s approach. The conquest of the Roman city, which is Great Constantinople, the Great Battle (الملحمة الكبرى), which is the banquet at Marj Akka, and the emergence of the Dajjal will occur within six months. There will be eighteen days between the conquest of Constantinople and the emergence of the Dajjal. He will emerge from Khurasan, the land of tribulations, followed by the Turks and the Jews. Seventy thousand of his followers, all Jews, wearing cloaks, will emerge from Isfahan alone. He is a middle-aged man, blind in his right eye, which looks like a floating grape. Written between his eyes is *Kaf Fa Ra* (كاف فاء راء). I do not know whether this spelling refers to the act of disbelief (*kufr* from the acts) or the name of the disbeliever (*kafir* from the names), except that the *alif* has been omitted, just as the Arabs omitted it in the script of the Quran in places, such as the *alif* of *al-Rahman* between the *mim* and the *nun*. The Prophet, peace and blessings be upon him, sought refuge and commanded us to seek refuge from the trial of the False Messiah (al-Masih al-Dajjal) and from tribulations.\n\nFor tribulations are presented to the hearts like a mat, reed by reed. Whichever heart absorbs them, a black spot is marked upon it. We seek refuge in Allah from tribulations.\n\nAl-Makki Abu Shuja’ ibn Rustam al-Isbahani, the Imam of the Station of Abraham in the Sacred Sanctuary of Mecca, narrated to us, along with others, all of whom said: Abu al-Fath Abd al-Malik ibn Abi al-Qasim ibn Abi Sahl al-Karukhi informed us, saying: My three Shaykhs informed us: Al-Qadi Abu Amir Mahmud ibn al-Qasim al-Azdi, Abu Nasr Abd al-Aziz ibn Muhammad al-Tiryaqi, and Abu Bakr Muhammad ibn Abi Hatim al-Awraji the merchant, who said: Muhammad ibn Abd al-Jabbar al-Jarahi informed us, saying: Abu al-Abbas Muhammad ibn Ahmad al-Mahbubi informed us, saying: Abu Isa Muhammad ibn Isa ibn Sawra al-Tirmidhi informed us, saying: Ali ibn Hujr narrated to us, saying: Al-Walid ibn Muslim and Abdullah ibn Abd al-Rahman ibn Yazid ibn Yahya ibn Khalid al-Ta’i narrated to us, from Abd al-Rahman ibn Yazid ibn Jabir—the Hadith of one entered into the Hadith of the other—from Abd al-Rahman ibn Yazid ibn Jabir, from Yahya ibn Khalid al-Ta’i, from Abd al-Rahman ibn Jubayr, from his father Jubayr ibn Nufayr, from Al-Nawwas ibn Sam’an al-Kilabi, who said: The Messenger of Allah, peace and blessings be upon him, mentioned the Dajjal one morning, lowering and raising his voice concerning him, until we thought he was in the cluster of date palms. He said: We departed from the Messenger of Allah, peace and blessings be upon him, then returned to him, and he perceived that in us. He said: \"What is the matter with you?\" We said: \"O Messenger of Allah, you mentioned the Dajjal this morning, lowering and raising your voice concerning him, until we thought he was in the cluster of date palms.\" He said: \"I fear something other than the Dajjal more for you. If he emerges while I am among you, I will be his disputant instead of you. But if he emerges and I am not among you, then every man is his own disputant, and Allah is my Caliph over every Muslim. He is a young man with curly hair, his eye is floating [defective], resembling Abd al-Uzza ibn Qatan. Whoever among you sees him, let him recite the opening verses of the Surah of the People of the Cave.\" He said: \"He will emerge between Syria and Iraq, causing corruption right and left. O servants of Allah, be steadfast, be steadfast.\" We said: \"O Messenger of Allah, how long will he remain on Earth?\" He said: \"Forty days: one day like a year, one day like a month, one day like a week, and the rest of his days like your days.\" We said: \"O Messenger of Allah, what about the day that is like a year? Will one day’s prayer suffice us in it?\" He said: \"No, but you must estimate for it.\" We said: \"O Messenger of Allah, what will be his speed on Earth?\" He said: \"Like the rain when the wind drives it.\" He will come to a people and call them, and they will deny him and reject his words. He will depart from them, and their wealth will follow him, and they will wake up with nothing in their hands. Then he will come to a people and call them, and they will respond to him and believe him. He will command the sky to rain, and it will rain, and he will command the earth to grow, and it will grow. Their livestock will return to them in the evening, taller than they were, with fuller udders and distended flanks. He said: Then he will come to a ruin and say to it, \"Bring forth your treasures,\" and he will depart from it, and they will follow him like swarms of bees. Then he will call a young man, full of youth, and strike him with a sword, cutting him into two pieces. Then he will call him, and the youth will come forward, his face beaming and laughing. While he is like that, Jesus son of Mary will descend in the eastern part of Damascus, at the White Minaret, wearing two garments dyed with saffron, placing his hands on the wings of two angels. When he lowers his head, water will drip, and when he raises it, droplets like pearls will roll down. He said: No one who finds his breath—meaning anyone—will remain alive, and his breath reaches as far as his sight. He said: [Jesus] will seek him until he overtakes him at the gate of Lud and kills him. He said: He will remain like that as long as Allah wills. He said: Then Allah will reveal to him: \"Gather My servants to the Mount [Sinai], for I have sent down servants of Mine whom no one has the power to fight.\" He said: And Allah will send forth Gog and Magog, and they will be as Allah the Exalted said: <<مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ>> (from every elevation they will descend). He said: The first of them will pass by Lake Tiberias and drink all its water. Then the last of them will pass by it and say, \"There was once water here.\" Then they will travel until they reach the mountain of Bayt al-Maqdis (Jerusalem), and they will say, \"We have killed those on Earth, so come, let us kill those in the heavens.\" They will shoot their arrows toward the sky, and Allah will return their arrows to them stained with blood. Jesus son of Mary and his companions will be besieged until the head of an ox is better for them that day than a hundred dinars are for one of you today. He said: Then Jesus son of Mary and his companions will turn to Allah in supplication. He said: Allah will send upon them the *Naghf* (worms) in their necks, and they will wake up dead, perished, like the death of a single soul. He said: Jesus son of Mary and his companions will descend, and they will not find a space of a handspan except that it is filled with their stench, putrefaction, and blood. He said: Then Jesus will turn to Allah in supplication, along with his companions. He said: Allah will send upon them birds like the necks of Bactrian camels, which will carry them and cast them into Al-Mahbal [a place]. The Muslims will use the bows, arrows, and quivers of [Gog and Magog] for fuel for seven years. And Allah will send upon them a rain that no house of felt or mud can keep out. He said: It will wash the Earth and leave it like a mirror. He said: Then it will be said to the Earth, \"Bring forth your fruit and restore your blessing.\" On that day, a group of people will eat a single pomegranate and seek shade under its peel. Allah will bless the milk until a large company of people will be satisfied by the milk of one she-camel, and a tribe will be satisfied by the milk of one cow, and a sub-tribe will be satisfied by the milk of one sheep. While they are like that, Allah will send a wind that will take the soul of every believer, and the rest of the people will remain, copulating like donkeys. Upon them, the Hour will be established. Abu Isa said: This Hadith is *Gharib Hasan Sahih* (rare, good, sound).\n\nThen we return to the knowledge of the Mahdi’s Viziers and their ranks, which is the foundation of this chapter.\n\n### [The duration of the Mahdi’s stay as Imam in this world]\n\nKnow that I am in doubt about the duration of this Mahdi’s stay as Imam in this world. I have not sought from Allah the verification of this, nor the designation of any event among the cosmic occurrences, unless Allah informs me of it initially, without my asking. For I fear that I might lose a share of my Gnosis (معرفتي) of Him, the Exalted, during the time I ask Him for knowledge of a cosmic event or occurrence. Rather, I have submitted my affair to Allah concerning His dominion; He does what He wills in it. I have seen a group of the people of Allah, the Exalted, seeking to ascertain the knowledge of cosmic events from Him, especially the knowledge of the Imam of the Time. I disdained that and feared that my nature might steal me away through associating with them while they are in this state. I desired from Him, the Exalted, only that He grant me steadfastness upon a single footing of Gnosis of Him, and I do not care if I fluctuate in states. When I saw that He advanced me and delayed me, and I saw the variation of my essence due to the variation of the state, I did not see a single essence that remained fixed, so no matter settled for me upon which I could remain, as I was in the state of my non-existence. I saw that the ruling of Existence (الوجود) and the station of Witnessing (الشهود) ruled my essence with that, so I sought release from my existence. I addressed Him in verse and wisdom:\n\nI seek Your pardon, release me from my existence,\nAnd from the ruling of realization through Witnessing.\nI have become the *Qibla* of everything,\nAnd I have come to seek by prostration.\nI marvel at my state when He said, \"Be!\"\nI am the essence of the Master and the mastered.\nEither You distinguish me as an Imam,\nOr I distinguish myself among the servants.\nThe hands of the hidden things have played with us,\nThe hidden things of the Unseen in the essence of Existence.\n\nWhen I asked for that, He clarified my ignorance and said to me, \"Are you not content to be like Me?\" Then He established for me the variation of His Theophany (تجليه) in the forms and what the sight perceives of His Essence (ذاته). I said: The variation of states upon a fixed essence that does not accept limitation does not concern me. For I have not denied the variation of states, as the Realities (الحقائق) necessitate that. What troubled me was the variation of my essence from my existence due to the variation of states. For I know, despite Your being every day in [a different] affair, that You are the Fixed Essence in the independence from the worlds. For I knew:\n\nThat transformation in the forms\nIs the attribute of the Guardian (المهيمن) by the report.\nAnd by that He sent down His revelation\nIn what He recited of the Surahs.\nAnd I saw its example\nIn the detailed and the concise.\n\nBy the detailed, I mean the entire world, and by the concise, the Perfect Human (الإنسان الكامل), because I saw that fluctuation is necessary in all of that. In the world, there is the fluctuation of night and day. In the Perfect Human, who is the master of the world in perfection—Muhammad, peace and blessings be upon him, the master of people on the Day of Resurrection—He is <<الَّذِي يَرَاكَ حِينَ تَقُومُ * وَتَقَلُّبَكَ فِي السَّاجِدِينَ>> (Who sees you when you stand and your movements among those who prostrate). Since the pen has run with us in the arena of subtle expression—because definition may occur verbally or in writing, and it may occur generally among the elite through contemplation, and I have found it, and it may occur through striking, and the Messenger of Allah, peace and blessings be upon him, found it, and through many other things besides what we mentioned, and all of that is an address and a definition—the path of our knowledge is through reports. Since I was upon this footing, upon which I sat with the Real, that I would not waste my time on anything other than the Gnosis of Him, the Exalted, Allah prepared one of the people of Allah, the Exalted, and His elite, named Ahmad ibn Uqab, whom Allah specialized with eligibility while he was young. He spontaneously mentioned these Viziers, saying to me, \"They are nine.\" I said to him, \"If they are nine, then the duration of the Mahdi’s stay must be nine years, for I am knowledgeable of what his Vizier requires. If he is one, all that is required is gathered in that one. If they are more than one, they will not be more than nine, for this is the limit of the doubt expressed by the Messenger of Allah, peace and blessings be upon him, in his saying: 'five, or seven, or nine' concerning the Mahdi’s reign.\" All that is required for the establishment of his Viziership consists of nine matters, no tenth, and they do not fall short of this. They are: Penetrating Insight, knowledge of the Divine Address upon its transmission, the science of translation from Allah, the designation of ranks for those in authority, mercy in anger, knowledge of the provisions required by the ruler, both sensible and intelligible, the science of the interpenetration of matters one into another, diligence and thoroughness in fulfilling people’s needs, and knowledge of the Unseen specifically required for the cosmos during his period.\n\nAs for Penetrating Insight, it is so that his call to Allah is based on clear sight concerning the one being called, not the caller. He looks into the essence of every person he calls and sees what makes it possible for that person to respond to his call, and he calls him based on that, even if through insistence. If he sees that the person will not respond, he calls him without insistence, specifically to establish the proof against him. For the Mahdi is Allah’s proof against the people of his time. This is the rank of the Prophets in which participation occurs. Allah the Exalted said: <<أَدْعُوا إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call to Allah upon clear sight—I and those who follow me). He informed this concerning His Prophet, peace and blessings be upon him. The Mahdi is among those who follow him, and the Prophet, peace and blessings be upon him, does not err in his call to Allah, so his follower does not err, for he follows his footsteps. Thus, the Hadith was reported concerning the description of the Mahdi, that the Prophet, peace and blessings be upon him, said: \"He follows my footsteps, making no mistake.\"\n\nThus, we know that he [the Messenger] is followed, not a follower, and that he is infallible (ma‘ṣūm). The meaning of the infallible in judgment is simply that he does not err, for error is not attributed to the Messenger’s judgment, as <<he does not speak out of [his own] desire. It is nothing but a revelation revealed>> (Q. 53:3-4). Just as analogical reasoning (al-qiyās) is not permissible in a place where the Messenger (may Allah bless him and grant him peace) is present, so too, the People of Unveiling (Ahl al-Kashf) consider the Prophet present with them, and they take the ruling only from him. For this reason, the truthful spiritual seeker (al-faqīr al-ṣādiq) does not adhere to a specific school of jurisprudence (madhhab); rather, he is with the Messenger, who is witnessed by him, just as the Messenger is with the Revelation (al-Waḥy) that descends upon him. Thus, the definition (al-ta‘rīf) of the ruling concerning new occurrences (al-nawāzil)—that it is the ruling of the Divine Law (al-Shar‘) with which the Messenger of Allah (may Allah bless him and grant him peace) was sent—descends from Allah upon the hearts of the truthful Gnostics (al-‘ārifīn al-ṣādiqīn). As for the people of the science of outward forms (aṣḥāb ‘ilm al-rusūm), they do not possess this rank, due to their preoccupation with the love of status, leadership, precedence over the servants of Allah, and the dependence of the common people upon them. Thus, they neither succeed themselves nor bring success to others. This is the condition of the jurists (fuqahā’) of this time who desire positions such as judgeship (qaḍā’), witnessing (shahāda), market supervision (ḥisba), and teaching (tadrīs). As for those among them who merely pretend to piety (al-mutanammisūn), they hunch their shoulders, look at people furtively with the gaze of the humble, and move their lips in remembrance (dhikr) so that the observer knows they are remembering. They speak affectedly and pompously. The arrogance of the lower soul (nafs) dominates them, and their hearts are the hearts of wolves. Allah does not look upon them. This is the state of those among them who are outwardly religious, not those who are companions of Satan, for whom Allah has no need. They wear the skins of sheep for people, showing softness; they are brothers in public but enemies in secret. May Allah guide them back and take them by their forelocks toward that which contains their happiness.\n\n[The Mahdi and the Exaggeration and Thoroughness in Fulfilling People’s Needs]\n\nWhen this Imam, the Mahdi, appears, he will have no manifest enemy except the jurists (al-fuqahā’) specifically, for their leadership will cease, their distinction from the common people will vanish, and little of their knowledge of rulings will remain. Disagreement (al-khilāf) regarding legal rulings will be lifted from the world due to the presence of this Imam. Were it not that the sword is in the hand of the Mahdi, the jurists would issue a legal opinion (fatwā) for his execution. But Allah manifests him with the sword and generosity, so they become hopeful and fearful, accepting his judgment without faith, but rather concealing their opposition, just as the Hanafis and Shafi‘is do regarding matters in which they differ. Indeed, we have been informed that the adherents of these two schools fight each other in the lands of the non-Arabs (al-‘Ajam), and many people die between them, and they break their fast in the month of Ramadan to gain strength for the fighting. Such people, were it not for the subjugation by the sword of the Imam Mahdi, would neither listen to him nor obey him outwardly, just as they do not obey him in their hearts. Rather, they believe that if he judges them according to a ruling outside their school, he is in error concerning that judgment, because they believe that the era of the people of independent legal reasoning (Ahl al-Ijtihād) has ended, and that no independent jurist remains in the world, and that Allah will not produce anyone with the rank of Ijtihād after their Imams. As for anyone who claims Divine Definition (al-ta‘rīf al-ilāhī) of the legal rulings, he is considered by them to be insane, corrupted in his imagination (khayāl), and they pay him no heed. If he possesses wealth and authority, they submit to him outwardly, desiring his wealth and fearing his authority, while inwardly they disbelieve in him.\n\nAs for the exaggeration and thoroughness (al-mubālagha wa al-istiqṣā’) in fulfilling people’s needs, this is incumbent upon the Imam specifically, above all other people. For Allah only placed him ahead of His creation and appointed him as their Imam so that he might strive for their welfare. The result produced by this striving is immense. Consider the story of Moses (peace be upon him) when he walked on behalf of his family to seek fire for them to warm themselves and to accomplish the matter that is customarily accomplished only by fire. He had no prior knowledge (khabar) of what was coming to him, but the consequence of that search resulted in the speech of his Lord. Allah Almighty spoke to him concerning the very object of his need—the fire in its form—though that matter had never crossed his mind. What could be greater than this? And this only occurred at the time he was striving on behalf of his dependents, so that Allah might teach him the merit (al-faḍl) inherent in fulfilling the needs of the family, thereby increasing his eagerness in striving for them. This was an admonition from the Real (al-Ḥaqq) Almighty regarding the value of that action in the sight of Allah Almighty, and regarding the value of the dependents, for they are His servants in every state. And He has entrusted this person [the Imam] with their care, as He Almighty said: <<Men are maintainers (qawwāmūn) of women>> (Q. 4:34). His flight from the enemies seeking to kill him resulted in Prophethood (al-ḥukm) and Messengership (al-risāla), as Allah Almighty informed us through Moses’s statement (peace be upon him): <<So I fled from you when I feared you, and my Lord granted me judgment (ḥukman) and made me one of the Messengers>> (Q. 26:21). And the striving for his family and the fulfillment of their needs granted him the Speech of Allah (Kalām Allāh). All of it is striving, without doubt. For the fugitive, in his flight, acted according to an animalistic impulse (nisba ḥayawāniyya)—his soul fled from the enemies seeking salvation and the preservation of the dominion and governance over the rational soul (al-nafs al-nāṭiqa). Thus, he only strove with his animalistic soul in his flight for the sake of the rational soul, which possesses the governance of this body. The just movement of all Imams is only for the sake of others, not for their own sake. If you see a ruler preoccupied with matters other than his subjects and their needs, know that his rank (al-martaba) has dismissed him by this action, and there is no difference between him and the common people. When ‘Umar ibn ‘Abd al-‘Azīz, on the day he assumed the Caliphate, wished to take a nap to rest himself, having been exhausted by his work in fulfilling people’s needs, his son entered upon him and said: “O Commander of the Faithful, you are resting while the people with needs are at the door. Whoever desires rest should not manage the affairs of the people.” ‘Umar wept and said: “Praise be to Allah, Who brought forth from my loins one who reminds me, calls me to the Real (al-Ḥaqq), and assists me in it.” So he abandoned rest and went out to the people.\n\nLikewise, al-Khiḍr—whose name is Balya ibn Malkān ibn Fāligh ibn ‘Ābir ibn Shālikh ibn Arfakhshad ibn Sām ibn Noah (peace be upon him)—was in an army. The commander of the army sent him to scout for water, as they had lost their water supply. He came upon the Spring of Life (‘ayn al-ḥayāh) and drank from it, and thus he lives until now. He did not know what Allah had specifically granted to the drinker of that water, which was life. I met him in Seville, and he advised me to submit to the Shaykhs and not to dispute with them. That day, I had disputed a matter with one of my Shaykhs and left his presence. I met al-Khiḍr at the Arch of al-Ḥaniyya, and he said to me: “Submit the matter to the Shaykh.” I returned immediately to the Shaykh. When I entered his house, he spoke to me before I could speak to him, saying: “O Muḥammad, do I need al-Khiḍr to advise you to submit to the Shaykhs in every matter you dispute with me?” I said to him: “O our master, was that al-Khiḍr who advised me?” He said: “Yes.” I replied: “Praise be to Allah, this is a benefit. Nevertheless, the matter is exactly as I told you.” After some time, I visited the Shaykh and found that he had reverted to my opinion on that matter. He said to me: “I was mistaken in it, and you were correct.” I said to him: “O my master, I now know that al-Khiḍr only advised me to submit; he did not inform me that you were correct in that matter, for it was not incumbent upon me to dispute it, as it was not among the prescribed rulings (al-aḥkām al-mashrū‘a) concerning which silence is forbidden.” I thanked Allah for that and rejoiced for the Shaykh, to whom the Real (al-Ḥaqq) had become clear in that issue. This Spring of Life (‘ayn al-ḥayāh) is water with which Allah specifically granted life to the drinker of that water. Then he returned to his companions and informed them of the water. People rushed to that location to draw from it, but Allah veiled their sight from it, so they could not find it. This is what his striving on behalf of others produced for him. Likewise, whoever allies for the sake of Allah, opposes for the sake of Allah, loves for the sake of Allah, and hates for the sake of Allah, belongs to this category. Allah Almighty said: <<You will not find a people who believe in Allah and the Last Day loving those who oppose Allah and His Messenger, even if they were their fathers or their sons or their brothers or their kindred. Those—He has inscribed faith in their hearts and supported them with a spirit from Him>> (Q. 58:22). No one knows the rank (al-manzila) they hold with Allah, because they neither moved nor rested except for the sake of Allah (fī ḥaqq Allāh), not for their own sake, preferring the Divine Presence (janāb Allāh) over what their nature dictates.\n\nAs for attaining the knowledge of the Unseen (‘ilm al-ghayb) that is specifically needed in the cosmos (al-kawn) during a specific period—this is the ninth requirement, beyond which the Imam needs nothing for his Imamate. This is because Allah Almighty informed us about Himself that <<Every day He is in [some] affair (sha’n)>> (Q. 55:29). The affair (al-sha’n) is the state the world is in on that day. It is known that when that affair manifests in existence (al-wujūd), it becomes known to everyone who witnesses it. This Imam, concerning this requirement, has an insight (iṭṭilā‘) from the side of the Real (al-Ḥaqq) into what the Real intends to bring into existence (yuḥdithuhu) of affairs before they occur in existence. Thus, on the day preceding the occurrence of that affair, he gains insight into it. If it is something beneficial for his subjects, he thanks Allah and remains silent about it. If it is something involving punishment, such as the descent of a general affliction (balā’) or one upon specific individuals, he asks Allah on their behalf, intercedes, and supplicates, and Allah averts that affliction from them through His mercy and grace, answering his prayer and request. For this reason, Allah grants him insight into it before its occurrence in existence, along with his companions. Then, concerning those affairs, Allah grants him insight into the new occurrences (al-nawāzil) involving individuals, and He specifies the individuals for him with their characteristics (ḥilyatihim), so that when he sees them, he has no doubt that they are the very ones he saw. Then Allah grants him insight into the prescribed ruling (al-ḥukm al-mashrū‘) for that occurrence—the ruling that Allah legislated for His Prophet Muḥammad (may Allah bless him and grant him peace) to judge by in that matter. Thus, he judges only by that ruling and never errs. If Allah veils the ruling from him concerning some occurrences, and no unveiling (kashf) occurs for him regarding it, his utmost recourse is to classify it as permissible (al-mubāḥ) in judgment, knowing by the absence of Divine Definition (al-ta‘rīf) that this is the ruling of the Divine Law (al-Shar‘) concerning it. For he is infallible (ma‘ṣūm) regarding personal opinion (al-ra’y) and analogical reasoning (al-qiyās) in religion. Analogical reasoning (al-qiyās) performed by someone who is not a prophet is a judgment against Allah concerning Allah’s religion based on what one does not know. It is merely extending a cause (‘illa), and how do you know that Allah did not intend to extend that cause? Had He intended it, He would have made it clear through the tongue of His Messenger (may Allah bless him and grant him peace) and commanded its extension. This is the case even if the cause was explicitly mentioned by the Divine Law (al-Shar‘) in a specific case. What then do you think of a cause that the jurist extracts by his own self and consideration, without the Divine Law mentioning it in a specific text, and then, after deriving it, he extends it? This is an arbitrary judgment upon an arbitrary judgment, based on a law unauthorized by Allah. This prevents the Mahdi from adopting analogical reasoning (al-qiyās) in the religion of Allah, especially since he knows that the Prophet’s intention (may Allah bless him and grant him peace) was to lighten the burden of obligation (al-taklīf) upon this Community. For this reason, he (may Allah bless him and grant him peace) used to say: “Leave me alone as long as I leave you alone,” and he disliked questioning about religion for fear of increasing the ruling. Everything concerning which silence was maintained, and regarding which he was not granted insight into a specific ruling, he makes the final outcome of the matter a judgment according to the original principle (ḥukm al-aṣl). And everything into which Allah grants him insight through unveiling (kashf) and definition (ta‘rīf), that is the ruling of the Muhammadan Law (al-Shar‘ al-Muḥammadī) concerning the issue. Allah may sometimes grant him insight that the permissible (al-mubāḥ) is permissible and its consequence. Every benefit (maṣlaḥa) that concerns his subjects, Allah grants him insight into it so that he may ask Him for it. And every corruption (fasād) that Allah intends to inflict upon his subjects, Allah grants him insight into it so that he may ask Allah to lift it from them, because it is a punishment, as He said: <<Corruption has appeared throughout the land and sea by [reason of] what the hands of people have earned, so He may let them taste part of [the consequence of] what they have done that perhaps they will return [to righteousness]>> (Q. 30:41). Thus, the Mahdi is a mercy, just as the Messenger of Allah (may Allah bless him and grant him peace) was a mercy. Allah Almighty said: <<And We have not sent you except as a mercy to the worlds>> (Q. 21:107). The Mahdi follows his footsteps unerringly, so he must be a mercy. When the Messenger of Allah (may Allah bless him and grant him peace) was wounded, he used to say: “O Allah, guide my people, for they do not know.” He apologized to his Lord on their behalf. And when he knew that he was human and that the characteristics of humanity might sometimes overcome him, he prayed to his Lord, saying: “O Allah, You know that I am human. I am pleased as humans are pleased, and I am angry as humans are angry”—meaning, I become angry at them and pleased for myself—“O Allah, whoever I have cursed, make my curse upon him a mercy and a pleasure for him.” These are nine matters that, in their totality, have not been confirmed for any Imam among the Imams of the religion, the successors of Allah and His Messenger, until the Day of Resurrection, except for this Imam, the Mahdi. Just as the Messenger of Allah (may Allah bless him and grant him peace) did not explicitly name any Imam of the religion who would come after him, inherit from him, and follow his footsteps unerringly, except the Mahdi specifically. Thus, the Prophet testified to his infallibility (‘iṣma) in his judgments, just as rational proof testified to the infallibility of the Messenger of Allah (may Allah bless him and grant him peace) in what he conveyed from his Lord concerning the prescribed ruling (al-ḥukm al-mashrū‘) for His servants.\n\nIncluded in this station (manzil) of sciences is the science of participation in the Oneness (al-Aḥadiyya), which is the general participation, such as His saying: <<and not associate anyone with the worship of his Lord>> (Q. 18:110). And He Almighty said: <<Say: He is Allah, [the] One (Aḥad)>> (Q. 112:1). Thus, He Almighty described Himself with Oneness (al-Aḥadiyya). This Sura is the lineage (nasab) of the Real (al-Ḥaqq) Almighty and singles out worship for Him from everyone. It includes the science of Divine Descent (al-inzāl al-ilāhī), and the science of the meaning that makes writing speech (kalām). The reality of speech is known to the rational people, but speech is a matter disputed among the speculative theologians (al-nuẓẓār). It includes the science of straight speech from crooked speech, and by what means the straightness of speech is distinguished from its crookedness. It includes the science of what the Messengers brought, generally and specifically. It includes the science of whether one who speaks without knowledge (al-‘ilm) possesses knowledge in reality (fī nafs al-amr), or whether it is not knowledge according to one who sees that it is not knowledge, even though he knows that there is no logic (manṭiq) except Allah’s. It includes the science of knowing truthfulness (al-ṣidq) and falsehood (al-kadhib), and why they return, and the truthful and the liar. It includes a science such that if a person knows it, distress (al-ḥaraj) is lifted from his soul when he sees the customary occurrences in souls—the accidental matters that cause distress, to the point that a person wishes to kill himself because of what he sees. This is called the science of comfort (rāḥa), and it is specifically the science of the People of Paradise. Whoever Allah opens this science to among the people of the world in this life has had the comfort of eternity hastened for him, along with the adherence to proper conduct (adab) by one who possesses this characteristic in enjoining the right and forbidding the wrong, according to his rank (martaba). It includes the science of what Allah manifests to the eyes upon bodies—that it is the adornment (ḥilya) of bodies—and why some of what is manifested is considered ugly by some, and why one who sees all of it as beautiful sees it so, and with what eye he sees it, so that he responds to it from his own essence (dhāt) with good acts. This science is among the most beautiful and beneficial sciences in the world. It is the science concerning which some theologians (al-mutakallimūn) say: “There is no agent (fā‘il) but Allah, and all His acts are beautiful.” These people do not deem ugly any of Allah’s acts except what Allah Himself has deemed ugly. That is for Allah Almighty, not for them; for if they did not deem ugly what Allah deemed ugly, they would be disputing with Allah Almighty. It includes the science of what Allah placed in the world as a source of wonder (ta‘ajjub), which is nothing but what breaks the custom (kharq al-‘āda). As for those who understand from Allah, everything customary (fī al-‘āda) is a source of wonder for them. But the people of customs (aṣḥāb al-‘awā’id) find wonder only in what manifests a break in custom. It includes the science of the yearning for lofty matters (ma‘ālī al-umūr) as an innate disposition of souls (jibilat al-nufūs), and by what means lofty matters are known—is it by intellect (‘aql) or by Divine Law (Shar‘)? And what are lofty matters? Are they a matter common to all rational people, or is what Zayd sees as a lofty matter not seen by ‘Amr in the same way, making it relative (iḍāfī)? It includes the science of the entry of the longer into the shorter, which is the inclusion of the greater upon the smaller. It includes the science of the rulings of the Real (al-Ḥaqq) in Creation (al-Khalq), both when He manifests (ẓahara) and when He is hidden (baṭana), and from which Reality (ḥaqīqa) the attribute of Manifestation (al-Ẓuhūr) and Concealment (al-Buṭūn) is accepted. It includes the science of bewilderment (al-ḥayra) from which it is impossible for one who enters it to exit. It includes the science of one who sees a matter contrary to what that matter is in itself, and whether it is valid for the possessor of this science to combine the two matters or not. It includes the science of the expansion and contraction of the Isthmuses (al-Barāzikh). It includes the science of the effect that moderation (al-i‘tidāl) and deviation (al-inḥirāf) have on what deviates from them or what opposes them. It includes the science of the spiritual states (al-aḥwāl) in the World (‘ālam), and whether they have an effect on what is outside the World or no effect on it. It includes the science of what is magnified in the eyes of the Perfect Human (al-Insān al-Kāmil) and what is greater than that. And why what is magnified in his eyes returns, to the point that it affects him with a state not necessitated by his station (maqām), and whether he attained that knowledge through witnessing (mushāhada) or through reflection (fikr). It includes the science of whether it is valid for the fully authorized agent (al-wakīl al-mufawwaḍ ilayhi al-muṭlaq al-wakāla) to dispose of his principal’s property in all respects as the owner of the property would, or if there is a limit at which he must stop according to the ruling of the Divine Law (Shar‘). It includes the science of the wisdom behind the saints (al-awliyā’) seeking concealment for their station (maqām), unlike the Prophets (upon them be the prayers of Allah). It includes the science of policy (al-siyāsa) in teaching, such that the teacher conveys knowledge to the student without the student realizing that the teacher intended to impart the knowledge he possessed. The student then says to the teacher: “O Master, I have gained from your action such-and-such, along with such-and-such, a vast and correct knowledge, which is thus-and-so.” The student imagines that the knowledge he gained from that matter was not intended by the teacher, while in reality (fī nafs al-amr) it was intended by the teacher. The student rejoices in the intelligence and discernment Allah granted him, having learned from his master’s movement a knowledge that he believed his master did not intend to teach him. It includes a science from the sciences of Unveiling (al-Kashf), which is that the possessor of Unveiling knows that any individual or group, whether few or many, must have one of the Men of the Unseen (Rijāl al-Ghayb) present with them when they speak. That one person transmits their news throughout the World (‘ālam). People find this news originating from their own souls in the World. A group gathers in seclusion, or a man speaks to himself a matter known only to Allah, and then he or that group goes out and hears it among the people, and the people are discussing it. I composed some lines of poetry in the Maqṣūra of Ibn Muthannā, east of the Great Mosque of Tunis in the lands of Ifriqiya, at the time of the afternoon prayer (‘Aṣr) on a specific, historically recorded day in the city of Tunis. I then came to Seville, a journey of three months by caravan between the two cities. A person who did not know me met me and, by chance, recited those very lines of poetry to me, though I had not written them down for anyone. I asked him: “To whom do these verses belong?” He replied: “To Muḥammad ibn al-‘Arabī,” naming me. I asked him: “When did you memorize them?” He mentioned the exact date and time when I composed them, despite the great distance. I asked him: “Who recited them to you so that you memorized them?” He said: “I was sitting one night east of Seville in a gathering of people on the road, and a stranger passed by us whom we did not know, appearing to be one of the travelers (suyyāḥ). He sat with us and spoke, then recited these verses to us. We liked them and wrote them down. We asked him: ‘To whom do these verses belong?’ He said: ‘To so-and-so,’ naming me to them. We said to him: ‘We do not know this Maqṣūra of Ibn Muthannā in our lands.’ He replied: ‘It is east of the Great Mosque of Tunis, and he composed them there at this very hour.’ I memorized them from him. Then he vanished from us, and we did not know what became of him or how he left us, and we did not see him again.” I was once at the Mosque of al-‘Udays in Seville, one day after the afternoon prayer, and a person was telling me about a great man among the People of the Path (Ahl al-Ṭarīq), one of their elders, whom he had met in Khurasan, and he mentioned his merit (faḍl). Suddenly, I saw a person near us whom the group with me could not see. He said to me: “I am that person whom this man is describing to you, the one who met us in Khurasan.” I asked the informant: “Do you know the description of this man you saw in Khurasan?” He said: “Yes.” I began to describe him to the informant by the marks he bore and the characteristics of his creation. The man said: “By Allah, he is exactly as you described! Have you seen him?” I replied: “He is sitting right here, confirming to me what you are reporting about him. I only described him to you while looking at him, and he introduced himself to me.” He remained sitting with me until I departed. When I looked for him, I did not find him. As for the verses he recited to me, they are these:\n\nIn the Maqṣūra of Ibn Muthannā, I spent the evening deeply in love,\nWith a Tunisian fawn, sweet for what is desired.\nI cast off my restraint for him, and my body became exhausted.\nI asked him for union when I saw him acting coy.\nHe shook his sides in wonder, like a branch swaying.\nAnd he said: “You are a stranger! Away from us, O you!”\nSo I melted with longing and despair, and died of passion and grief.\n\nThis young man is called Aḥmad ibn al-Idrīsī, from the merchants of the town. His father was a righteous young man who loved and sat with the righteous—may Allah grant him success. This gathering between him and me took place in the year 590 AH, and we are now in the year 635 AH.\n\nIt includes the science of what is praiseworthy in disputation (al-jidāl) and what is blameworthy in it. It is not proper for a Muslim who attributes himself to Allah to dispute except concerning a matter in which he is correct based on unveiling (kashf), not based on reflection (fikr) or speculation (naẓar). If what he disputes about is witnessed by him, then it becomes incumbent upon him to dispute concerning it <<in the way that is best>> (Q. 16:125), provided he is commanded by a Divine order. If he is not commanded, he has a choice. If benefit to others is determined through it, it is recommended (mandūb) for him. If he despairs of the listeners accepting it, he should remain silent and not dispute, for if he disputes, he is striving for the destruction of the listeners in the sight of Allah. It includes the science of a person saying, “I am a believer, if Allah wills (in shā’ Allāh),” even while knowing in his soul at that moment that he is a believer. This is a matter of great benefit for whoever considers it, teaching him proper conduct (adab) with Allah, provided the speaker does not exceed the place Allah has assigned for it. If he exceeds it and does not stop there, he has behaved improperly with Allah, and his request will not succeed. It includes the science of the thing that reminds you of a matter you had known and then forgotten. It includes the science of the increase and decrease in time (zamān), to what they are attributed, and the saying of the Prophet (may Allah bless him and grant him peace) to ‘Ā’isha concerning his oath of abstinence (īlā’) from his wives: “The month may be twenty-nine [days].” And by what should one take the legal ruling (al-ḥukm al-shar‘ī) from that—by the minimum to which the name of the month applies, or by the maximum? It includes the science of preferring the company of the People of Allah (Ahl Allāh) over those heedless of Allah, even if faith encompasses them. It includes the science of how the Majesty of Allah (Jalāl Allāh) ought to be treated, whether the world is pleased or displeased. It includes the science of waters (al-miyāh), which is a strange science, and what is the limit of quenching (al-riyy) in the one quenched by water that quenches, for some water quenches and some does not. And what is the water from which Allah made every living thing? Is it all water, or does it have a specific description among waters? And the description of the water from which Allah created the children of Adam is described with insignificance, for He said: <<We created man from a despised water (mā’in mahīn)>> (Q. 32:8). It includes the science of the sign of one whom Allah has made happy versus one whom He has made wretched in the life of this world. It includes the science of what the world (al-dunyā) is in itself, what its life is, and what its adornment is. It includes the science of what remains and what perishes, and what part of the World (‘ālam) accepts annihilation (al-fanā’) and what accepts subsistence (al-baqā’). It includes the science of the form of encompassing (al-iḥāṭa) that which is infinite (mā lā yatanāhā), and that which is infinite cannot be described as being encompassed, because its entry into existence (al-wujūd) is impossible. It includes the science of the states of the Jinn, and whether the Real’s (al-Ḥaqq) obligation upon them regarding the Divine Laws (al-Sharā’i‘) sent down from Him is an obligation that the Real imposed upon them initially, or whether they imposed it upon themselves, and the Real then imposed it upon them, like a vow (al-nadhr). It includes the science of the difference between the Act (al-Fi‘l) and the Acted-upon (al-Maf‘ūl). It includes the science of who accepts assistance in the Act. It includes the science of sects (al-niḥal) and religions (al-milal). It includes the science of deservingness (al-istiḥqāq). It includes the science of what knowledge is not beneficial to possess. It includes the science of strange knowledge (‘ilm al-gharīb)—by what means souls accept it and turn to it more than others. It includes the science of whether it is valid to turn away from knowledge while it remains knowledge in the one who turns away, or whether a doubt (shubha) arises in him concerning it, so he does not turn away until the perception that it is knowledge is removed from him. This is one of the most hidden sciences among the verifying Gnostics (al-muḥaqqiqīn al-‘ārifīn). It includes the science of the veils (al-ḥujub) that intervene between the eye of insight (ayn al-baṣīra) and what it ought to perceive were it not for these veils. It includes the science of forbearance (al-ḥilm) and the difference between it and pardon (al-‘afw), and whether the All-Forgiving, the Most Merciful (al-Ghafūr al-Raḥīm) is an Isthmus (Barzakh) between the Forbearing (al-Ḥalīm) and the Pardoner (al-‘Afūw), and whether they have a ruling in this matter or not. It includes the science that matters do not exceed their predetermined measures (maqādīr) with Allah. It includes the science of what caused the great ones (al-akābir) to be heedless of the Divine Exception (al-istithnā’ al-ilāhī) in their acts, such as the story of Solomon, Moses, and others (upon them be peace). It includes the science of returning what is proper to whom it is proper, and this is the best of sciences because it bequeaths comfort (al-rāḥa) and ensures safety from objection concerning it—and Allah knows best. It includes the science of what a person praises in himself but denies and blames in others. It includes the science of standing between the two Worlds (‘ālamayn)—what is the state of the one standing there? It includes the science that the Real (al-Ḥaqq) did not bring anything into existence except through a cause (sabab). Whoever denies the causes (al-asbāb) is ignorant. Whoever claims to deny them only denies them by means of them, since it is not valid to deny what Allah has affirmed and what the state of existence (al-wujūd) grants. And what is the difference between customary causes (al-asbāb al-mu‘tāda) that may be lifted, and intelligible causes (al-asbāb al-ma‘qūla) that cannot be lifted? It includes the science of what awaits one who takes precautions regarding the servants of Allah. It includes the science of taking ambiguities (al-shubah) as proofs—what blinded them from seeing that they are ambiguities? It includes the science of those servants of Allah who will be neglected on the Day of Resurrection versus those who will not be neglected. It includes the science of the elect (al-khawāṣṣ). And <<Allah speaks the truth, and He guides to the way>> (Q. 33:4).",
    "ur": "باب تین سو چھیاسٹھ: آخر زمانے میں ظاہر ہونے والے مہدی کے وزراء کے مقام کی معرفت کے بیان میں، جن کی بشارت رسول اللہ صلی اللہ علیہ وسلم نے دی ہے اور جو اہل بیت میں سے ہوں گے\n\nبے شک امام وزیر کا محتاج ہوتا ہے، اور ان دونوں پر ہستی (الوجود) کا فلک گردش کرتا ہے۔\nاور اگر ان دونوں کے وجود سے بادشاہت کے حالات درست نہ ہوں، تو وہ جلد ہی تباہ ہو جائے گی۔\nسوائے ذات حق (الحق) کے، جو پاک ہے، اس کے پاس اپنے ارادوں میں کوئی وزیر نہیں ہے۔\nذات حق (الحق) اپنی بادشاہت میں اس سے بلند ہے کہ مخلوق اسے محتاجی کی حالت میں دیکھے۔\n\n[بے شک اللہ کا ایک خلیفہ ظاہر ہوگا جب زمین ظلم و ستم سے بھر چکی ہوگی]\n\nجان لو، اللہ ہماری تائید فرمائے، کہ اللہ کا ایک خلیفہ ظاہر ہوگا جب زمین ظلم و ستم سے بھر چکی ہوگی، تو وہ اسے عدل و انصاف سے بھر دے گا۔ اگر دنیا کا صرف ایک دن بھی باقی رہا تو اللہ اس دن کو اتنا لمبا کر دے گا یہاں تک کہ یہ خلیفہ، جو رسول اللہ صلی اللہ علیہ وسلم کی عترت میں سے اور حضرت فاطمہ کی اولاد میں سے ہوگا، حکومت سنبھال لے۔ اس کا نام رسول اللہ صلی اللہ علیہ وسلم کے نام سے موافقت رکھے گا، اس کے دادا حسین بن علی بن ابی طالب ہوں گے۔ اس سے رکن اور مقام کے درمیان بیعت کی جائے گی۔ وہ اپنی خلقت (جسمانی ساخت) میں رسول اللہ صلی اللہ علیہ وسلم سے مشابہت رکھے گا، لیکن اپنے خُلق (اخلاق) میں ان سے کم ہوگا، کیونکہ اخلاق میں کوئی بھی رسول اللہ صلی اللہ علیہ وسلم جیسا نہیں ہو سکتا، اور اللہ تعالیٰ ان کے بارے میں فرماتا ہے: **\"اور بے شک آپ اخلاق کے عظیم مرتبے پر فائز ہیں۔\"** (وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ) وہ کشادہ پیشانی اور اونچی ناک والا ہوگا۔ کوفہ کے لوگ اس سے سب سے زیادہ خوش ہوں گے۔ وہ مال کو برابری سے تقسیم کرے گا، رعایا میں عدل کرے گا، اور مقدمات میں فیصلہ کرے گا۔ ایک شخص اس کے پاس آ کر کہے گا: \"اے مہدی! مجھے عطا کیجیے،\" اور مال اس کے سامنے پڑا ہوگا، تو وہ اس کے کپڑے میں اتنا بھر دے گا جتنا وہ اٹھا سکے۔ وہ دین کی ایک فترت (وقفے) کے بعد ظاہر ہوگا، اور اللہ اس کے ذریعے وہ چیزیں روکے گا جو قرآن کے ذریعے نہیں روکی جا سکیں گی۔ وہ شام کو جاہل، بخیل اور بزدل ہوگا، اور صبح کو سب سے زیادہ عالم، سب سے زیادہ سخی، اور سب سے زیادہ بہادر ہوگا۔ اللہ اسے ایک رات میں سنوار دے گا۔ نصرت اس کے آگے آگے چلے گی۔ وہ پانچ، یا سات، یا نو سال زندہ رہے گا۔ وہ رسول اللہ صلی اللہ علیہ وسلم کے نقش قدم پر چلے گا، کبھی خطا نہیں کرے گا۔ ایک فرشتہ اس کی تائید کرتا رہے گا جسے وہ دیکھ نہیں پائے گا۔ وہ ہر بوجھ اٹھائے گا، حق کے معاملے میں کمزور کو قوت دے گا، مہمان نوازی کرے گا، اور حق کی مصیبتوں میں مدد کرے گا۔ وہ جو کہتا ہے وہ کرتا ہے، اور جو جانتا ہے وہ کہتا ہے، اور جو دیکھتا ہے وہ جانتا ہے۔ وہ روم کے شہر (قسطنطنیہ) کو تکبیر کے ذریعے فتح کرے گا، جو اسحاق کی اولاد میں سے ستر ہزار مسلمانوں کے ساتھ ہوگا۔ وہ مرج عکا میں اللہ کی عظیم ضیافت (ملحمہ کبریٰ) میں شریک ہوگا۔ وہ ظلم اور اس کے اہل کو مٹا دے گا۔ وہ دین کو قائم کرے گا، اسلام میں روح پھونکے گا۔ اس کے ذریعے اسلام کو ذلت کے بعد عزت ملے گی، اور موت کے بعد زندگی ملے گی۔ وہ جزیہ ختم کر دے گا اور تلوار کے ذریعے اللہ کی طرف دعوت دے گا۔ پس جو انکار کرے گا اسے قتل کیا جائے گا، اور جو اس سے جھگڑے گا وہ ذلیل ہوگا۔ وہ دین میں سے وہ چیزیں ظاہر کرے گا جو دین کی اصل ہیں، جن کے مطابق اگر رسول اللہ صلی اللہ علیہ وسلم زندہ ہوتے تو فیصلہ فرماتے۔ وہ زمین سے تمام مذاہب کو ختم کر دے گا، اور صرف خالص دین ہی باقی رہے گا۔ اس کے دشمن اجتہاد کرنے والے علماء کے مقلدین ہوں گے، کیونکہ وہ دیکھیں گے کہ مہدی کا حکم ان کے ائمہ کے مسلک کے خلاف ہے۔ چنانچہ وہ اس کی تلوار اور رعب کے خوف سے اور اس کے پاس موجود چیزوں کی رغبت میں مجبوراً اس کے حکم کے تحت آ جائیں گے۔ عام مسلمان اس سے اپنے خواص سے زیادہ خوش ہوں گے۔ اہل حقائق (أهل الحقائق) میں سے اللہ کے عارفین اس سے الٰہی تعریف کے ذریعے شہود (الشہود) اور کشف (الکشف) کی بنا پر بیعت کریں گے۔ اس کے لیے الٰہی مرد ہوں گے جو اس کی دعوت کو قائم کریں گے اور اس کی مدد کریں گے، یہی وزراء ہوں گے جو بادشاہت کے بوجھ اٹھائیں گے اور اس کام میں اس کی مدد کریں گے جو اللہ نے اسے سونپا ہے۔ عیسیٰ ابن مریم دمشق کے مشرقی جانب سفید منارے پر دو زرد چادروں میں ملبوس، دو فرشتوں پر ٹیک لگائے ہوئے نازل ہوں گے، ایک فرشتہ ان کے دائیں اور ایک بائیں ہوگا۔ ان کے سر سے موتیوں کی طرح پانی ٹپک رہا ہوگا، گویا وہ ابھی غسل خانے سے نکلے ہیں۔ لوگ عصر کی نماز میں ہوں گے، تو امام ان کے لیے اپنی جگہ سے ہٹ جائے گا، تو وہ آگے بڑھیں گے اور لوگوں کو نماز پڑھائیں گے۔ وہ لوگوں کی امامت محمد صلی اللہ علیہ وسلم کی سنت کے مطابق کریں گے۔ وہ صلیب کو توڑیں گے اور خنزیر کو قتل کریں گے۔ اللہ مہدی کو پاکیزہ حالت میں اپنے پاس بلا لے گا۔ اور اسی کے زمانے میں سفیانی کو دمشق کے غوطہ میں ایک درخت کے پاس قتل کیا جائے گا، اور اس کا لشکر مدینہ اور مکہ کے درمیان بیداء میں دھنسا دیا جائے گا، یہاں تک کہ لشکر میں سے صرف ایک شخص، جو جہینہ قبیلے سے ہوگا، باقی بچے گا۔ یہ لشکر رسول اللہ صلی اللہ علیہ وسلم کے شہر کو تین دن تک مباح کرے گا، پھر مکہ کی طرف روانہ ہوگا، تو اللہ اسے بیداء میں دھنسا دے گا۔ اس لشکر میں جو شخص مجبوراً شامل تھا، وہ اپنی نیت کے مطابق حشر کیا جائے گا۔ قرآن حاکم ہوگا اور تلوار مٹانے والی ہوگی۔ اسی لیے حدیث میں آیا ہے کہ اللہ سلطان (حکمران) کے ذریعے وہ چیزیں روکے گا جو قرآن کے ذریعے نہیں روکی جا سکیں گی۔\n\nخبردار! اولیاء کا خاتم گواہ ہے، اور عالمین کے امام کی آنکھ (ابھی) پوشیدہ ہے۔\nوہ سید مہدی آل احمد میں سے ہے، وہ ہندوستانی تلوار ہے جب وہ مٹاتا ہے۔\nوہ سورج ہے جو ہر غم اور تاریکی کو دور کرتا ہے، وہ موسمی بارش ہے جب وہ سخاوت کرتا ہے۔\n\nاور بے شک اس کا زمانہ تمہارے پاس آ چکا ہے اور اس کا وقت تم پر سایہ فگن ہو چکا ہے، اور وہ چوتھی صدی میں ظاہر ہوا جو پچھلی تین صدیوں کے بعد آئی ہے: رسول اللہ صلی اللہ علیہ وسلم کی صدی جو صحابہ کی صدی تھی، پھر اس کے بعد والی، پھر دوسری کے بعد والی۔ پھر ان کے درمیان وقفے آئے، اور نئے معاملات پیش آئے، خواہشات پھیل گئیں، خون بہائے گئے، بھیڑیوں نے ملک میں فساد برپا کیا، اور فساد اتنا بڑھ گیا کہ ظلم چھا گیا اور اس کا سیلاب امڈ آیا، اور عدل کا دن ظلم کے ساتھ پیٹھ پھیر گیا جب اس کی رات آئی۔ پس اس کے شہید بہترین شہید ہوں گے اور اس کے امین افضل ترین امین ہوں گے۔ اور اللہ اس کے لیے ایک گروہ کو وزیر بنائے گا جنہیں اس نے اپنے غیب کے خزانے میں چھپا رکھا ہے۔ اس نے انہیں کشف (الکشف) اور شہود (الشہود) کے ذریعے حقائق (الحقائق) پر اور اس امر پر مطلع کیا ہے جو اللہ کا اپنے بندوں کے بارے میں ہے۔ پس ان کے مشورے سے ہی وہ فیصلہ کرتا ہے جو فیصلہ کرتا ہے۔ اور وہ ایسے عارفین ہیں جنہوں نے اس چیز کو جانا جو وہاں ہے۔ اور جہاں تک خود مہدی کا تعلق ہے، تو وہ حق کی تلوار اور مدنی سیاست کا مالک ہے، وہ اللہ کی طرف سے اتنا جانتا ہے جتنی اس کے مرتبے اور مقام کو ضرورت ہے۔ کیونکہ وہ ایک مسدد (تائید یافتہ) خلیفہ ہے جو حیوانات کی بولی سمجھتا ہے، اور اس کا عدل انسانوں اور جنوں میں جاری ہوتا ہے۔\n\n[بے شک مہدی علیہ السلام کے وزراء عجمی ہوں گے]\n\nان وزراء کے علم کے اسرار میں سے جنہیں اللہ نے اس کے لیے وزیر بنایا ہے، اللہ تعالیٰ کا یہ قول ہے: **\"اور ہم پر مومنوں کی مدد کرنا حق ہے۔\"** (وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ) اور وہ ان صحابہ کے قدموں پر ہیں جنہوں نے **\"اللہ سے کیے گئے عہد کو سچ کر دکھایا۔\"** (صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ) اور وہ عجمی ہیں، ان میں کوئی عربی نہیں ہوگا، لیکن وہ صرف عربی میں بات کریں گے۔ ان کے ساتھ ایک محافظ ہوگا جو ان کی جنس سے نہیں ہے اور جس نے کبھی اللہ کی نافرمانی نہیں کی، وہ سب سے خاص وزیر اور بہترین امین ہے۔ پس اللہ نے انہیں اس آیت میں، جسے انہوں نے دن کا ورد اور رات کا ساتھی بنا لیا ہے، صدق (سچائی) کا بہترین علم حال اور ذوق کے ساتھ عطا فرمایا ہے۔ چنانچہ انہوں نے جانا کہ صدق (سچائی) زمین میں اللہ کی تلوار ہے، جس نے بھی اسے قائم کیا اور اس سے متصف ہوا، اللہ نے اس کی مدد کی، کیونکہ صدق اس کی صفت ہے اور الصادق اس کا نام ہے۔ پس انہوں نے آشوب چشم سے پاک آنکھوں سے دیکھا اور رشد کی راہ پر ثابت قدموں سے چلے۔ انہوں نے نہیں دیکھا کہ ذات حق (الحق) نے کسی مومن کو کسی دوسرے مومن سے مقید کیا ہو، بلکہ اس نے اپنے اوپر مومنوں کی مدد کو واجب کر لیا، اور یہ نہیں کہا کہ کس کے ذریعے، بلکہ اسے مطلق بھیج دیا اور اسے محقق کر کے واضح کیا، چنانچہ فرمایا: **\"اے ایمان والو! ایمان لاؤ۔\"** (يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا) اور فرمایا: **\"اور کسی مومن کے لیے جائز نہیں کہ وہ کسی مومن کو قتل کرے مگر غلطی سے۔\"** (وَمَا كَانَ لِمُؤْمِنٍ أَنْ يَقْتُلَ مُؤْمِنًا إِلَّا خَطَأً) اور فرمایا: **\"اور وہ جو باطل پر ایمان لائے۔\"** (وَالَّذِينَ آمَنُوا بِالْبَاطِلِ) تو انہیں مومن کہا۔ اور فرمایا: **\"اور اگر اس کے ساتھ شرک کیا جائے تو تم ایمان لے آؤ۔\"** (وَإِنْ يُشْرَكْ بِهِ تُؤْمِنُوا) تو مشرک کو مومن کہا۔ پس یہی وہ مومن ہیں جن کے ذریعے اللہ نے اپنے اس قول میں اشارہ کیا: **\"اے ایمان والو! اللہ اور اس کے رسول پر اور اس کتاب پر جو اس نے اپنے رسول پر نازل کی اور اس کتاب پر جو اس نے پہلے نازل کی، ایمان لاؤ۔\"** (يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَى رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ) پس انہیں اہل کتاب اور کتب کے مومنوں سے ممتاز کیا۔ اور کوئی خبر لانے والا مکمل نہیں ہوا سوائے رسولوں کے۔ پس یہ متعین ہوا کہ جن مومنوں کو ایمان لانے کا حکم دیا گیا ہے، وہ وہی ہیں جو باطل پر ایمان لائے اور شبہ کی بنا پر شریک پر ایمان لائے جس نے انہیں دلیل سے پھیر دیا۔ کیونکہ جو باطل پر ایمان لائے انہوں نے اللہ کا کفر کیا، اور جن لوگوں نے شریک پر ایمان لایا، ان کے دل **\"جب صرف اللہ کا ذکر کیا جاتا ہے تو نفرت کرتے ہیں۔\"** (إِذَا ذُكِرَ اللَّهُ وَحْدَهُ) پس یہ خبر ان کے پاس ان کے گمراہ کرنے والے ائمہ کے سوا کسی نے نہیں لائی جو ان سے پہلے گزر چکے تھے۔ اور یہ ان کے گمان میں دلیل کی بنا پر تھا، یعنی ائمہ کے گمان میں، نہ کہ کسی کمی کی وجہ سے، بلکہ انہوں نے نظر کا حق پورا کیا، مگر ان کی استعداد نے انہیں وہ نہیں دیا جو اللہ نے انہیں عطا کیا تھا، اور اللہ نے کسی جان کو مکلف نہیں کیا مگر اس کے مطابق جو اسے عطا کیا، اور جو اسے عطا کیا وہ اس کے سوا نہیں تھا جو وہ لائی تھی۔ پس ان کے پیروکاروں نے اس پر ایمان لایا اور اپنے ایمان میں سچے تھے، اور ان کا مقصد صرف نجات کی راہ تھی، انہوں نے وہ چیز نہیں چاہی جو انہیں ہلاک کرے۔ اور جب انہوں نے دیکھا کہ اللہ ابتداءً بھی فعل کرتا ہے اور آلے کے ذریعے بھی فعل کرتا ہے، تو انہوں نے شریک کو وزیر کی طرح بنا دیا جو ہستی (الوجود) میں حاصل ہونے والے بعض افعال کے ظہور میں مددگار ہو۔ پس جب صرف اللہ کا ذکر کیا گیا، تو انہوں نے دیکھا کہ اس ذکر کرنے والے نے امر کا حق پورا نہیں کیا، کیونکہ وہ جانتے تھے کہ بعض افعال بعض مخلوق کے وجود پر موقوف ہیں۔ اور ان کا شہود (الشہود) صرف مخلوق اسباب سے ہستی (الوجود) میں حاصل ہونے والے افعالِ الٰہیہ تھے۔ پس انہوں نے توحیدِ افعال کو قبول نہیں کیا کیونکہ انہوں نے اس کا شہود نہیں کیا تھا، اور اگر وہ اسے قبول کر لیتے تو اللہ کی حکمت کو باطل کر دیتے جو اس نے اسباب میں اوپر اور نیچے رکھی ہے۔ پس یہی وہ چیز ہے جو انہیں نفرت اور بے انصافی کی طرف لے گئی، تو اللہ نے انہیں اس لیے مذمت کی کہ انہوں نے ان مومنوں کے مقابلے میں خود کو ترجیح دی جنہوں نے اللہ کے سوا کسی کو فاعل نہیں دیکھا، اور یہ کہ حادث قدرت اور اسباب پر موقوف امور کا فعل میں کوئی اثر نہیں ہے۔ پس یہ گروہ ہی ہے جسے اللہ نے اس خطاب کے ساتھ خاص کیا ہے۔ اور جہاں تک ان لوگوں کا تعلق ہے جنہوں نے اللہ کا کفر کیا، تو وہ وہی ہیں جنہوں نے اسے شرک کے پردے سے چھپا دیا اور باطل پر ایمان لائے، اور باطل عدم ہے۔ اور انہوں نے کسی کو نہیں دیکھا جو تشبیہ اور شرک سے پاک ہو سوائے عدم کے، کیونکہ ہستی (الوجود) ایک مشترک صفت ہے۔ پس ان کا باطل پر ایمان لانا تنزیہ کا ایمان ہے، اور ان کا کفر (یعنی چھپانا) ہستی (الوجود) کی نسبت اللہ کی طرف کرنے سے ہے، کیونکہ اس میں اشتراک واقع ہوتا ہے۔ اسی لیے اللہ تعالیٰ نے فرمایا: **\"یہی لوگ خسارہ پانے والے ہیں۔\"** (أُولَئِكَ هُمُ الْخَاسِرُونَ) کیونکہ انہوں نے اپنی تجارت میں نفع کے وجود کو کھو دیا، جو کہ امر کی مکمل صورت کو ظاہر کرنا تھا۔ پس **\"انہوں نے ہدایت کے بدلے گمراہی خرید لی۔\"** (اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ) یعنی بیان کے بدلے حیرت خرید لی۔ پس انہوں نے حیرت کو اختیار کیا اور جانا کہ امر عظیم ہے اور بیان مقید کرتا ہے جبکہ وہ مقید نہیں ہوتا، تو انہوں نے بیان پر حیرت کو ترجیح دی۔ اور جہاں تک عقل سلیم، صحیح نظر اور ایمان عام کے حاملین کا تعلق ہے، تو وہ ہیں جنہوں نے حیرت کو اس کے مقام اور ٹھکانے پر ثابت کیا،\nچنانچہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: **\"مجھ میں میری حیرت کو بڑھا دے۔\"**\nاور انہوں نے بیان کو اس کے مقام پر ثابت کیا، جہاں اس امر کی معرفت بیان کے بغیر ممکن نہیں اور وہ حیرت کو قبول نہیں کرتا۔ پس انہوں نے ہر حقدار کو اس کا حق دیا اور حکمت کو اس کے مقام پر رکھا۔ پس سب مومن ہیں، کیونکہ اللہ نے انہیں مومن کہا ہے، جیسا کہ انہیں کافر اور مشرک بھی کہا ہے۔ اور اس نے انہیں ان کے ایمان میں مراتب پر رکھا ہے۔ اسی لیے فرمایا: **\"تاکہ وہ اپنے ایمان کے ساتھ مزید ایمان میں بڑھ جائیں۔\"** (لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ) اس چیز میں جس پر وہ ایمان لائے، جیسا کہ اس نے ان کی بیماری اور **\"نجاست پر مزید نجاست\"** (رِجْسًا إِلَى رِجْسِهِمْ) بڑھائی اس چیز میں جس کا انہوں نے کفر کیا۔ پس ان میں صادق بھی ہیں اور اصدق بھی۔ پس اللہ اس مومن کی مدد کرتا ہے جس کے ایمان میں کوئی خلل نہ آیا ہو، اس پر جس کے ایمان میں خلل آ گیا ہو۔ کیونکہ اللہ اسے اس خلل کی مقدار کے مطابق چھوڑ دیتا ہے جو اس میں داخل ہوا ہو، خواہ وہ کوئی بھی مومن ہو۔ پس کامل ایمان والا مومن ہمیشہ منصور ہوتا ہے۔ اسی لیے نہ کبھی کوئی نبی ہارا اور نہ کوئی ولی۔ کیا تم نے حنین کے دن نہیں دیکھا، جب صحابہ رضی اللہ عنہم نے توحید کا دعویٰ کیا، پھر اپنی کثرت کو دیکھا، تو ان کی کثرت نے انہیں خوش کر دیا، اور اس وقت وہ اللہ کو بھول گئے، تو ان کی کثرت ان کے کسی کام نہ آئی، جیسا کہ ان (کافروں) کے معبود ان کے کسی کام نہ آئے، حالانکہ صحابہ بلاشبہ مومن تھے، لیکن ان میں کثرت پر بھروسہ کرنے کی وجہ سے خلل آ گیا، اور وہ اللہ کے اس قول کو بھول گئے: **\"کتنی ہی تھوڑی جماعتیں ہیں جو اللہ کے حکم سے بڑی جماعتوں پر غالب آ گئیں۔\"** (كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ) پس یہاں اللہ نے صرف غلبے کا اذن دیا، تو اسے وجود بخشا، اور تھوڑی جماعت نے اللہ کے اذن سے انہیں مغلوب کر دیا۔\n\nپس وہاں اللہ کے سوا کچھ نہیں، اس کے علاوہ کوئی نہیں، اور ہر صاحب بصیرت اسے ہستی (الوجود) میں دیکھتا ہے۔\n\n[صدق (سچائی) کا اثر ان اشخاص میں مشہود ہے جنہیں وہ مقام حاصل نہیں]\n\nاور جہاں تک صدق (سچائی) کے اثر کا تعلق ہے، تو وہ ان اشخاص میں بھی مشہود ہے جنہیں وہ مقام حاصل نہیں جو شرائع کے ذریعے لائی گئی سعادت کے اسباب میں سے ہے، لیکن انہیں صدق میں راسخ قدم حاصل ہے۔ پس وہ ہمت کے ذریعے قتل کرتے ہیں، اور وہ ہمت صدق ہے۔ ابو یزید سے کہا گیا: \"ہمیں اسم اللہ الاعظم دکھائیں،\" تو انہوں نے کہا: \"تم ہمیں اصغر دکھاؤ تاکہ میں تمہیں اعظم دکھاؤں۔\" اللہ کے تمام نام عظیم ہیں۔ پس وہ صرف صدق ہے۔ سچے ہو جاؤ اور جو نام چاہو لے لو، تم اس کے ذریعے وہ کرو گے جو تم چاہو گے۔ اور اسی کے ذریعے ابو یزید نے چیونٹی کو زندہ کیا، اور ذوالنون نے اس عورت کے بیٹے کو زندہ کیا جسے مگرمچھ نگل گیا تھا۔ اگر تم سمجھ گئے تو تمہارے لیے سعادت کے دروازوں میں سے ایک دروازہ کھل گیا، اگر تم اس پر عمل کرو گے تو اللہ تمہیں جہاں کہیں بھی ہو کامیاب کرے گا اور تم کبھی خطا نہیں کرو گے۔ اور اسی سے تمہیں اللہ کے ساتھ راحت ملے گی جب کافروں کو مسلمانوں پر غلبہ حاصل ہو، تو تم جان لو کہ ان کا ایمان متزلزل ہو گیا ہے اور اس میں خلل آ گیا ہے، اور یہ کہ کافروں کا اپنے باطل پر ایمان اور مشرکوں کا ایمان متزلزل نہیں ہوا ہے۔ پس نصرت صدق کا بھائی ہے، جہاں بھی صدق ہوتا ہے، نصرت اس کے پیچھے چلتی ہے۔ اگر معاملہ اس کے برعکس ہوتا تو مسلمان کبھی نہ ہارتے، جیسا کہ کوئی نبی کبھی نہیں ہارا۔ اور تم ایک وقت میں کفار کا غلبہ اور ان کی نصرت دیکھتے ہو اور دوسرے وقت میں مسلمانوں کا غلبہ اور ان کی نصرت۔ اور دونوں فریقوں میں سے صادق شخص مکمل طور پر نہیں ہارتا، بلکہ وہ ثابت قدم رہتا ہے یہاں تک کہ یا تو قتل ہو جائے یا بغیر شکست کے واپس لوٹ جائے۔ اور مہدی کے وزراء اسی قدم پر ہوں گے۔ اور یہی وہ چیز ہے جو وہ مہدی کے ساتھیوں کے دلوں میں راسخ کریں گے۔ کیا تم نہیں دیکھتے کہ وہ تکبیر کے ذریعے روم کے شہر کو فتح کرتے ہیں؟ وہ پہلی تکبیر کہتے ہیں تو اس کی دیوار کا ایک تہائی حصہ گر جاتا ہے، اور دوسری تکبیر کہتے ہیں تو دیوار کا دوسرا تہائی حصہ گر جاتا ہے، اور تیسری تکبیر کہتے ہیں تو تیسرا تہائی حصہ گر جاتا ہے، اور وہ اسے بغیر تلوار کے فتح کر لیتے ہیں۔ پس یہ وہی صدق ہے جس کا ہم نے ذکر کیا۔ اور وہ ایک جماعت ہیں، یعنی مہدی کے وزراء، جو دس سے کم ہیں۔ اور جب امام مہدی یہ جان لیں گے تو اس پر عمل کریں گے اور اپنے زمانے کے سب سے سچے شخص ہوں گے۔ پس اس کے وزراء ہدایت دینے والے ہیں اور وہ مہدی ہے۔ پس اللہ کی معرفت (المعرفۃ) کا یہ حصہ مہدی کو اپنے وزراء کے ہاتھوں حاصل ہوگا۔\n\n[ولایت محمدیہ (الولایۃ المحمدیۃ) کا خاتم]\n\nاور جہاں تک ولایت محمدیہ (الولایۃ المحمدیۃ) کے خاتم کا تعلق ہے، تو وہ مخلوق میں اللہ کو سب سے زیادہ جاننے والا ہے۔ اس کے زمانے میں اور اس کے بعد کوئی بھی اللہ کو اور اس کے احکام کے مواقع کو اس سے زیادہ جاننے والا نہیں ہوگا۔ پس وہ اور قرآن بھائی ہیں، جیسا کہ مہدی اور تلوار بھائی ہیں۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اس کے خلیفہ کے طور پر قیام کی مدت کے بارے میں پانچ سے نو سال تک جو شک کیا، وہ اس شک کی وجہ سے تھا جو اس کے وزراء کی تعداد میں واقع ہوا۔ کیونکہ اس کے ساتھ ہر وزیر کے لیے ایک سال ہے۔ اگر وہ پانچ ہوں گے تو وہ پانچ سال زندہ رہے گا، اگر وہ سات ہوں گے تو سات سال، اور اگر وہ نو ہوں گے تو نو سال زندہ رہے گا۔ کیونکہ ہر سال کے مخصوص حالات ہوتے ہیں، اور اس سال میں جو چیز درست ہو، اس کا علم اس کے وزراء میں سے کسی ایک کے ساتھ خاص ہوتا ہے۔ پس وہ پانچ سے کم نہیں ہوں گے اور نہ ہی نو سے زیادہ۔ اور وہ سب کے سب مرج عکا میں اللہ کی اس الٰہی ضیافت میں قتل کر دیے جائیں گے جسے اللہ نے پرندوں اور حشرات الارض کے درندوں کے لیے دسترخوان بنایا ہے۔ اور وہ ایک جو باقی رہے گا، میں نہیں جانتا کہ کیا وہ ان لوگوں میں سے ہوگا جنہیں اللہ نے اپنے اس قول میں مستثنیٰ کیا ہے: **\"اور صور پھونکا جائے گا تو آسمانوں اور زمین میں جو بھی ہیں سب بے ہوش ہو جائیں گے سوائے ان کے جنہیں اللہ چاہے۔\"** (وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ) یا وہ اسی نفخے میں مر جائے گا۔\n\n[وہ نوجوان جسے دجال قتل کرے گا]\n\nاور جہاں تک اس خضر کا تعلق ہے جسے دجال اپنے گمان میں قتل کرے گا نہ کہ حقیقت میں، اور وہ ایک بھرپور جوانی والا نوجوان ہوگا، اس کی آنکھ میں ایسا ہی ظاہر ہوگا۔ اور کہا گیا ہے کہ وہ نوجوان جسے دجال اپنے گمان میں قتل کرے گا، وہ اصحاب کہف میں سے ایک ہے، لیکن ہمارے نزدیک کشف (الکشف) کے طریقے سے یہ صحیح نہیں ہے۔ اور مہدی کا ظہور قیامت کے قریب ہونے کی نشانیوں میں سے ہے۔ اور روم کے شہر یعنی قسطنطنیہ عظمیٰ کی فتح، اور مرج عکا میں عظیم جنگ (ملحمہ کبریٰ) جو ضیافت ہے، اور دجال کا خروج چھ ماہ میں ہوگا۔ اور قسطنطنیہ کی فتح اور دجال کے خروج کے درمیان اٹھارہ دن کا وقفہ ہوگا۔ اور اس کا خروج مشرق کی سرزمین خراسان سے ہوگا جو فتنوں کی جگہ ہے۔ ترک اور یہودی اس کی پیروی کریں گے۔ صرف اصفہان سے ستر ہزار یہودی اس کے پیروکاروں میں شامل ہوں گے جو چادریں اوڑھے ہوں گے۔ وہ ایک ادھیڑ عمر کا شخص ہوگا، دائیں آنکھ سے کانا ہوگا، اس کی آنکھ ابھرے ہوئے انگور کی طرح ہوگی۔ اس کی دونوں آنکھوں کے درمیان \"ک، ف، ر\" لکھا ہوگا۔ پس میں نہیں جانتا کہ اس ہجے سے مراد افعال کا کفر ہے یا اسماء کا کفر، مگر یہ کہ الف کو حذف کر دیا گیا ہے جیسا کہ عرب نے مصحف کے خط میں بعض جگہوں پر حذف کیا ہے، جیسے \"الرحمن\" کا الف میم اور نون کے درمیان۔ اور رسول اللہ صلی اللہ علیہ وسلم مسیح دجال کے فتنے اور دیگر فتنوں سے پناہ مانگتے تھے اور ہمیں بھی پناہ مانگنے کا حکم دیا:\nبے شک فتنے دلوں پر چٹائی کی طرح ایک ایک تنکا کر کے پیش کیے جاتے ہیں، پس جس دل نے انہیں پی لیا، اس میں ایک سیاہ نقطہ لگا دیا جاتا ہے۔ ہم اللہ کی پناہ مانگتے ہیں فتنوں سے۔\n\nہمیں مکی ابو شجاع ابن رستم الاصبہانی، جو حرم مکی میں مقام ابراہیم کے امام تھے، نے ایک جماعت کے ساتھ حدیث بیان کی، سب نے کہا کہ ہمیں ابو الفتح عبد الملک بن ابی القاسم بن ابی سہل الکروخی نے حدیث بیان کی، انہوں نے کہا کہ ہمیں میرے تینوں شیوخ، قاضی ابو عامر محمود بن القاسم الازدی، ابو نصر عبد العزیز بن محمد التریّاقی، اور ابو بکر محمد بن ابی حاتم العورجی التاجر نے خبر دی، انہوں نے کہا کہ ہمیں محمد بن عبد الجبار الجراحی نے خبر دی، انہوں نے کہا کہ ہمیں ابو العباس محمد بن احمد المحبوبی نے خبر دی، انہوں نے کہا کہ ہمیں ابو عیسیٰ محمد بن عیسیٰ بن سورہ الترمذی نے خبر دی، انہوں نے کہا کہ ہمیں علی بن حجر نے حدیث بیان کی، انہوں نے کہا کہ ہمیں ولید بن مسلم اور عبد اللہ بن عبد الرحمن بن یزید بن یحییٰ بن خالد الطائی نے عبد الرحمن بن یزید بن جابر سے حدیث بیان کی، ان میں سے ایک کی حدیث دوسرے کی حدیث میں شامل ہو گئی، عبد الرحمن بن یزید بن جابر نے یحییٰ بن خالد الطائی سے، انہوں نے عبد الرحمن بن جبیر سے، انہوں نے اپنے والد جبیر بن نفیر سے، انہوں نے نواس بن سمعان کلابی رضی اللہ عنہ سے روایت کی، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک صبح دجال کا ذکر کیا، تو اس میں کمی اور زیادتی کی (یعنی کبھی اس کی اہمیت کم کی اور کبھی بڑھائی) یہاں تک کہ ہم نے گمان کیا کہ وہ کھجوروں کے جھنڈ میں موجود ہے۔ نواس رضی اللہ عنہ نے کہا: پھر ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس سے واپس آئے، پھر دوبارہ ان کے پاس گئے، تو آپ صلی اللہ علیہ وسلم نے ہم میں یہ کیفیت پہچان لی اور فرمایا: \"تمہارا کیا حال ہے؟\" ہم نے عرض کیا: \"یا رسول اللہ! آپ نے صبح دجال کا ذکر کیا، تو اس میں کمی اور زیادتی کی یہاں تک کہ ہم نے گمان کیا کہ وہ کھجوروں کے جھنڈ میں موجود ہے۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"دجال کے علاوہ مجھے تم پر کسی اور چیز کا زیادہ خوف ہے۔ اگر وہ میری موجودگی میں نکلے تو میں تمہاری طرف سے اس کا مقابلہ کرنے والا ہوں، اور اگر وہ میری غیر موجودگی میں نکلے تو ہر شخص خود اپنا مقابلہ کرنے والا ہے، اور اللہ ہر مسلمان پر میرا خلیفہ ہے۔ وہ گھنگریالے بالوں والا نوجوان ہے، اس کی آنکھ ابھری ہوئی ہے، وہ عبد العزیٰ بن قطن سے مشابہت رکھتا ہے۔ پس تم میں سے جو اسے دیکھے تو اسے چاہیے کہ سورۃ اصحاب کہف کی ابتدائی آیات پڑھے۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"وہ شام اور عراق کے درمیان سے نکلے گا، اور دائیں بائیں فساد پھیلائے گا۔ اے اللہ کے بندو! ثابت قدم رہنا، ثابت قدم رہنا۔\" ہم نے عرض کیا: \"یا رسول اللہ! وہ زمین پر کتنی مدت رہے گا؟\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"چالیس دن۔ ایک دن سال کے برابر ہوگا، ایک دن مہینے کے برابر ہوگا، ایک دن ہفتے کے برابر ہوگا، اور باقی دن تمہارے دنوں کی طرح ہوں گے۔\" ہم نے عرض کیا: \"یا رسول اللہ! جو دن سال کے برابر ہوگا، کیا اس میں ہمیں ایک دن کی نماز کافی ہوگی؟\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"نہیں، بلکہ اس کے لیے اندازہ لگانا۔\" ہم نے عرض کیا: \"یا رسول اللہ! فما سرعته في الأرض؟\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"اس بارش کی طرح جسے ہوا پیچھے سے دھکیل رہی ہو۔\" وہ ایک قوم کے پاس آئے گا اور انہیں دعوت دے گا، تو وہ اسے جھٹلائیں گے اور اس کی بات کو رد کر دیں گے۔ پس وہ ان سے واپس چلا جائے گا، تو ان کے اموال اس کے پیچھے ہو جائیں گے، اور وہ صبح کریں گے تو ان کے پاس کچھ نہیں ہوگا۔ پھر وہ دوسری قوم کے پاس آئے گا اور انہیں دعوت دے گا، تو وہ اسے قبول کریں گے اور اس کی تصدیق کریں گے۔ پس وہ آسمان کو حکم دے گا کہ بارش برسائے، تو بارش برسے گی، اور زمین کو حکم دے گا کہ اگائے، تو وہ اگائے گی۔ پس ان کے مویشی شام کو واپس آئیں گے تو ان کے تھن پہلے سے زیادہ بھرے ہوئے ہوں گے، ان کے پہلو زیادہ بھرے ہوئے ہوں گے، اور ان کے تھن زیادہ دودھ والے ہوں گے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: پھر وہ کسی ویرانے کے پاس آئے گا اور اس سے کہے گا: \"اپنے خزانے نکال دے۔\" اور وہ اس سے واپس چلا جائے گا، تو خزانے شہد کی مکھیوں کے جھنڈ کی طرح اس کے پیچھے چلیں گے۔ پھر وہ ایک نوجوان کو بلائے گا جو بھرپور جوانی میں ہوگا، اور اسے تلوار سے مارے گا اور دو ٹکڑے کر دے گا۔ پھر اسے بلائے گا، تو وہ ہنستا ہوا چمکتے چہرے کے ساتھ آئے گا۔ وہ اسی حال میں ہوگا کہ عیسیٰ ابن مریم دمشق کے مشرقی جانب سفید منارے کے پاس دو زرد چادروں میں ملبوس نازل ہوں گے، اپنے ہاتھ دو فرشتوں کے پروں پر رکھے ہوں گے۔ جب وہ اپنا سر جھکائیں گے تو قطرے ٹپکیں گے، اور جب اٹھائیں گے تو موتیوں کی طرح دانے گریں گے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: \"اور کوئی بھی شخص ان کی سانس کی خوشبو نہیں پائے گا مگر مر جائے گا، اور ان کی سانس کی خوشبو ان کی نگاہ کی انتہا تک ہوگی۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"وہ اسے تلاش کریں گے یہاں تک کہ اسے لد کے دروازے پر پا لیں گے اور اسے قتل کر دیں گے۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"اور وہ اسی طرح رہیں گے جب تک اللہ چاہے گا۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"پھر اللہ ان کی طرف وحی کرے گا کہ میرے بندوں کو کوہ طور کی طرف محفوظ کر لو، کیونکہ میں نے اپنے ایسے بندے اتارے ہیں جن سے لڑنے کی کسی میں طاقت نہیں ہے۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"اور اللہ یاجوج ماجوج کو بھیجے گا، اور وہ ایسے ہوں گے جیسا کہ اللہ تعالیٰ نے فرمایا: **'وہ ہر بلندی سے دوڑتے ہوئے آئیں گے۔'** (مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ) آپ صلی اللہ علیہ وسلم نے فرمایا: \"ان کا پہلا گروہ بحیرہ طبریہ سے گزرے گا تو اس کا سارا پانی پی جائے گا، پھر ان کا آخری گروہ وہاں سے گزرے گا تو کہے گا: 'یہاں کبھی پانی ہوا کرتا تھا۔' پھر وہ چلتے رہیں گے یہاں تک کہ بیت المقدس کے پہاڑ پر پہنچیں گے، اور کہیں گے: 'ہم نے زمین والوں کو تو قتل کر دیا، آؤ اب آسمان والوں کو قتل کریں۔' پس وہ اپنے تیر آسمان کی طرف پھینکیں گے، تو اللہ ان کے تیروں کو خون آلود کر کے ان کی طرف واپس کر دے گا۔ اور عیسیٰ ابن مریم اور ان کے ساتھی محصور ہو جائیں گے، یہاں تک کہ اس دن ان کے لیے بیل کا سر تمہارے آج کے سو دینار سے بہتر ہوگا۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"پس عیسیٰ ابن مریم اور ان کے ساتھی اللہ سے دعا کریں گے۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"تو اللہ ان کی گردنوں میں کیڑے (نغف) بھیجے گا، پس وہ سب ایک جان کی موت کی طرح مرے ہوئے پائے جائیں گے۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"اور عیسیٰ ابن مریم اور ان کے ساتھی نیچے اتریں گے، تو انہیں ایک بالشت بھر جگہ بھی ایسی نہیں ملے گی جو ان کی چربی، بدبو اور خون سے بھری نہ ہو۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"پس عیسیٰ اور ان کے ساتھی اللہ سے دعا کریں گے۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"تو اللہ ان پر اونٹوں کی گردنوں جیسے پرندے بھیجے گا جو انہیں اٹھا کر مہبل (ایک جگہ کا نام) میں پھینک دیں گے۔ اور مسلمان سات سال تک ان کی کمانوں، تیروں اور ترکشوں سے آگ جلائیں گے۔ اور اللہ ان پر ایسی بارش بھیجے گا جس سے کوئی گھر یا اونٹ کے بالوں کا خیمہ یا مٹی کا مکان نہیں بچے گا،\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"تو وہ زمین کو دھو ڈالے گی اور اسے آئینے کی طرح صاف کر دے گی۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"پھر زمین سے کہا جائے گا: 'اپنے پھل نکال اور اپنی برکت واپس کر۔' پس اس دن ایک جماعت ایک انار کھائے گی اور اس کے چھلکے سے سایہ حاصل کرے گی۔ اور اللہ دودھ میں برکت دے گا یہاں تک کہ لوگوں کی ایک بڑی جماعت اونٹنی کے ایک وقت کے دودھ سے کفایت کرے گی، اور ایک قبیلہ گائے کے ایک وقت کے دودھ سے کفایت کرے گا، اور ایک خاندان بکری کے ایک وقت کے دودھ سے کفایت کرے گا۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"وہ اسی حال میں ہوں گے کہ اللہ ایک ہوا بھیجے گا جو ہر مومن کی روح قبض کر لے گی، اور باقی لوگ گدھوں کی طرح آپس میں بدکاری کریں گے، پس انہی پر قیامت قائم ہوگی۔\" ابو عیسیٰ نے کہا: یہ حدیث غریب، حسن، صحیح ہے۔\n\nپھر ہم اس علم کی طرف لوٹتے ہیں جس پر ہم نے یہ باب قائم کیا ہے، یعنی مہدی کے وزراء اور ان کے مراتب کا علم۔\n\n[اس دنیا میں مہدی کا بطور امام قیام کی مدت]\n\nپس جان لو کہ میں اس مہدی کے اس دنیا میں بطور امام قیام کی مدت کے بارے میں شک میں ہوں۔ اور میں نے اللہ سے اس کی تحقیق یا اس کے تعین کا مطالبہ نہیں کیا، اور نہ ہی کائنات کے کسی حادثے کے تعین کا، مگر یہ کہ اللہ مجھے ابتداءً اس کا علم دے، نہ کہ میرے مطالبے پر۔ کیونکہ مجھے خوف ہے کہ جس وقت میں اللہ تعالیٰ سے کسی کونی حادثے کی معرفت طلب کروں گا، اس وقت اس کی معرفت (المعرفۃ) میں میرا حصہ فوت ہو جائے گا۔ بلکہ میں نے اپنا معاملہ اللہ کے سپرد کر دیا ہے کہ وہ اپنی بادشاہت میں جو چاہے کرے۔ کیونکہ میں نے اہل اللہ کی ایک جماعت کو دیکھا کہ وہ اللہ تعالیٰ سے کونی حادثات کے علم پر مطلع ہونے کا مطالبہ کرتے ہیں، خاص طور پر امام وقت کی معرفت کا۔ تو میں نے اس سے نفرت کی اور ڈرا کہ ان کی صحبت میں میرا طبع مجھے چرا نہ لے، جبکہ وہ اس حال پر ہیں۔ اور میں نے اللہ تعالیٰ سے صرف یہ چاہا کہ وہ مجھے اس کی معرفت (المعرفۃ) کے ایک ہی قدم پر ثابت قدمی عطا فرمائے، اور اگر میں حالات میں پلٹتا رہوں تو مجھے پرواہ نہیں۔ اور جب میں نے دیکھا کہ اس نے مجھے آگے اور پیچھے کیا، اور میں نے حال کے اختلاف کی وجہ سے اپنی عین (ذات) کا اختلاف دیکھا، تو مجھے کوئی ایک عین ثابت نظر نہ آئی۔ پس میرا کوئی معاملہ ایسا نہ ٹھہرا جس پر میں ثابت رہوں، جیسا کہ میں اپنی عدم کی حالت میں تھا۔ اور میں نے دیکھا کہ ہستی (الوجود) کا حکم اور مقام شہود (الشہود) نے میری عین پر اس کا حکم لگایا، تو میں نے اپنے وجود سے معافی (اقالہ) طلب کی، اور اسے نظم اور حکم کے ذریعے مخاطب کیا:\n\nتیرے لیے عذر ہے، مجھے میرے وجود سے معاف کر دے، اور شہود (الشہود) کے ذریعے تحقق کے حکم سے بھی۔\nمیں ہر شے کا قبلہ بن چکا ہوں، اور شام کو میں سجدے کے ذریعے طلب کیا جاتا ہوں۔\nمجھے اپنے حال پر تعجب ہوا جب اس نے کہا: \"ہو جا!\" میں ہی مسود (سردار بنانے والا) اور مسود (سردار بنایا گیا) کی عین ہوں۔\nپس یا تو تو مجھے امام کے طور پر ممتاز کر دے، یا میں بندوں میں ممتاز ہو جاؤں۔\nبے شک خفايا (پوشیدہ چیزوں) کے ہاتھوں نے ہم سے کھیلا ہے، غیب کی پوشیدہ چیزوں نے ہستی (الوجود) کی عین میں۔\n\nپس جب میں نے یہ سوال کیا تو اس نے میرے جہل کو واضح کیا اور مجھ سے کہا: \"کیا تم اس پر راضی نہیں کہ تم میری طرح ہو جاؤ؟\" پھر اس نے میرے لیے صورتوں میں اپنے ظہور الٰہی (التجلی) کا اختلاف قائم کیا اور وہ جو بصارت اس کی ذات سے ادراک کرتی ہے۔ تو میں نے کہا: \"مجھے ثابت عین پر حالات کے اختلاف سے کوئی فرق نہیں پڑتا جو تقیید قبول نہیں کرتی۔ کیونکہ میں نے حالات کے اختلاف کا انکار نہیں کیا، بے شک حقائق (الحقائق) اسی کا تقاضا کرتے ہیں۔ مجھے تو میرے وجود کی عین کا حالات کے اختلاف کی وجہ سے مختلف ہونا پریشان کر رہا تھا۔ کیونکہ میں جانتا ہوں کہ آپ ہر روز ایک نئی شان میں ہوتے ہوئے بھی، عالمین سے بے نیاز ہونے میں ثابت عین ہیں۔\" کیونکہ میں نے جانا:\n\nبے شک صورتوں میں بدلنا، خبر کے ذریعے مہیمن (نگہبان) کی صفت ہے۔\nاور اسی کے ذریعے اس نے اپنی وحی نازل کی، ان سورتوں میں جن کی اس نے تلاوت کی۔\nاور میں نے اس کی مثال دیکھی ہے، مطول (تفصیلی) میں اور مختصر میں۔\n\nمطول سے میری مراد پوری کائنات ہے، اور مختصر سے مراد انسان کامل (الإنسان الکامل) ہے، کیونکہ میں نے دیکھا کہ ان سب میں پلٹنا ضروری ہے۔ پس کائنات میں رات اور دن کا پلٹنا ہے، اور انسان کامل (الإنسان الکامل) میں، جس نے کمال میں دنیا کی سیادت کی، اور وہ محمد صلی اللہ علیہ وسلم ہیں جو قیامت کے دن لوگوں کے سردار ہوں گے، اور وہ وہی ہیں **\"جو آپ کو دیکھتے ہیں جب آپ کھڑے ہوتے ہیں، اور سجدہ کرنے والوں میں آپ کا پلٹنا۔\"** (الَّذِي يَرَاكَ حِينَ تَقُومُ وَتَقَلُّبَكَ فِي السَّاجِدِينَ) اور جب ہمارا قلم رقیہ (جادو) کی عبارت کے میدان میں چلا، کیونکہ تعریف کبھی لفظاً اور کتابت کے ذریعے ہوتی ہے، اور کبھی خواص کے ہاں عموم میں نظر کے ذریعے ہوتی ہے، اور میں نے اسے پایا ہے، اور کبھی مارنے کے ذریعے ہوتی ہے، اور رسول اللہ صلی اللہ علیہ وسلم نے اسے پایا ہے، اور بہت سے دیگر امور کے ذریعے جو ہم نے ذکر نہیں کیے، اور یہ سب خطاب اور تعریف ہے۔ پس ہمارے علم کا راستہ اخبار (خبریں) ہیں۔ اور جب میں اس قدم پر تھا جس پر میں نے ذات حق (الحق) کے ساتھ مجلس کی کہ میں اپنا وقت اللہ تعالیٰ کی معرفت (المعرفۃ) کے علاوہ کسی اور چیز میں ضائع نہ کروں، تو اللہ نے اہل اللہ اور اس کے خواص میں سے ایک شخص کو مقرر کیا جسے احمد بن عقاب کہا جاتا تھا، جسے اللہ نے بچپن میں ہی اہلیت کے ساتھ خاص کر دیا تھا۔ اس نے ابتداءً ان وزراء کا ذکر کیا اور مجھ سے کہا: \"وہ نو ہیں۔\" تو میں نے اس سے کہا: \"اگر وہ نو ہیں تو مہدی کے قیام کی مدت نو سال ہونا ضروری ہے۔\" کیونکہ میں جانتا ہوں کہ اس کے وزیر کو کس چیز کی ضرورت ہوگی۔ اگر وہ ایک ہوگا تو اس ایک میں وہ تمام چیزیں جمع ہوں گی جن کی ضرورت ہے، اور اگر وہ ایک سے زیادہ ہوں گے تو وہ نو سے زیادہ نہیں ہوں گے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کا شک ان پر ہی ختم ہوا تھا جب آپ نے مہدی کے قیام کے بارے میں \"پانچ یا سات یا نو\" فرمایا تھا۔ اور وہ تمام امور جن کی ضرورت ہوگی اور جن کا قیام اس کے وزراء کے ذریعے ہوگا، وہ نو ہیں، دسواں کوئی نہیں، اور نہ ہی اس سے کم ہیں، اور وہ یہ ہیں:\n۱. نفوذ البصر (بصیرت کی گہرائی)\n۲. القاء کے وقت خطاب الٰہی کی معرفت\n۳. اللہ کی طرف سے ترجمہ کا علم\n۴. حکمرانوں کے لیے مراتب کا تعین\n۵. غصے میں رحمت\n۶. بادشاہ کو محسوس اور معقول رزق کی ضرورت کا علم\n۷. امور کے ایک دوسرے میں داخل ہونے کا علم\n۸. لوگوں کی ضروریات پوری کرنے میں مبالغہ اور استقصاء (مکمل چھان بین)\n۹. غیب کے اس علم پر واقفیت جس کی اس کے دور میں کائنات میں خاص طور پر ضرورت ہوگی۔\nپس یہ نو امور ہیں جو امام مہدی کے وزیر میں ہونا ضروری ہیں، اگر وزیر ایک ہو، یا اس کے وزراء میں اگر وہ ایک سے زیادہ ہوں۔\nجہاں تک نفوذ البصر (بصیرت کی گہرائی) کا تعلق ہے، تو یہ اس لیے ہے تاکہ اس کی اللہ کی طرف دعوت مدعو (جسے دعوت دی جا رہی ہے) کے بارے میں بصیرت پر مبنی ہو، نہ کہ مدعو الیہ (جس کی طرف دعوت دی جا رہی ہے) کے بارے میں۔ پس وہ ہر مدعو کی عین (ذات) میں دیکھے گا جسے وہ دعوت دے رہا ہے، اور دیکھے گا کہ اس کے لیے اس کی دعوت کو قبول کرنا ممکن ہے، تو وہ اسے اس طریقے سے دعوت دے گا، خواہ اصرار کے ذریعے ہو۔ اور جسے وہ دیکھے گا کہ وہ اس کی دعوت قبول نہیں کرے گا، تو اسے بغیر اصرار کے دعوت دے گا، صرف اس پر حجت قائم کرنے کے لیے۔ کیونکہ مہدی اپنے زمانے کے لوگوں پر اللہ کی حجت ہے، اور یہ انبیاء کا وہ درجہ ہے جس میں شراکت واقع ہوتی ہے۔ اللہ تعالیٰ نے فرمایا: **\"میں اللہ کی طرف بصیرت پر دعوت دیتا ہوں، میں اور وہ جو میری پیروی کرتے ہیں۔\"** (أَدْعُوا إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي) اس نے اپنے نبی صلی اللہ علیہ وسلم کے بارے میں یہ خبر دی۔ پس مہدی ان لوگوں میں سے ہے جنہوں نے آپ کی پیروی کی، اور آپ صلی اللہ علیہ وسلم اللہ کی طرف دعوت دینے میں خطا نہیں کرتے، تو آپ کا پیروکار بھی خطا نہیں کرے گا، کیونکہ وہ آپ کے نقش قدم پر چلتا ہے۔ اور مہدی کی صفت میں بھی یہی خبر آئی ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: **\"وہ میرے نقش قدم پر چلے گا، خطا نہیں کرے گا۔\"**\nاور یہی اللہ کی طرف دعوت دینے میں عصمت ہے۔ اور بہت سے اولیاء، بلکہ سبھی اسے حاصل کرتے ہیں۔\nاور نفوذ البصر (بصیرت کی گہرائی) کے حکم میں سے یہ بھی ہے کہ اس کا حامل نوری اور ناری ارواح کو ارواح کی کسی ارادے، ظہور یا تصور کے بغیر ادراک کرے۔\nجیسا کہ ابن عباس اور عائشہ رضی اللہ عنہما نے جبریل علیہ السلام کو اس وقت ادراک کیا جب وہ رسول اللہ صلی اللہ علیہ وسلم سے بات کر رہے تھے، جبکہ جبریل کو اس کا علم نہیں تھا اور نہ ہی ان کا ارادہ تھا کہ وہ ان پر ظاہر ہوں۔ پس انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو اس کی خبر دی، اور وہ نہیں جانتے تھے کہ وہ جبریل علیہ السلام ہیں۔ تو آپ صلی اللہ علیہ وسلم نے عائشہ سے فرمایا: \"کیا تم نے اسے دیکھا ہے؟\" اور ابن عباس سے فرمایا: \"کیا تم نے اسے دیکھا ہے؟\" دونوں نے کہا: \"ہاں۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"وہ جبریل تھے۔\"\nاسی طرح وہ رجال الغیب کو بھی اس حال میں ادراک کرتے ہیں جب وہ پردہ نشین رہنا چاہتے ہیں اور آنکھوں پر ظاہر نہیں ہونا چاہتے، تو اس حال کا حامل انہیں دیکھ لیتا ہے۔\nاور نفوذ البصر (بصیرت کی گہرائی) میں سے یہ بھی ہے کہ جب معانی ان کے لیے مجسم ہو جاتے ہیں، تو وہ انہیں ان کی صورتوں کی عین میں پہچان لیتے ہیں، اور بغیر کسی توقف کے جان لیتے ہیں کہ وہ کون سا معنی ہے جو مجسم ہوا ہے۔\n\n«وصل» اور جہاں تک القاء کے وقت خطاب الٰہی کی معرفت کا تعلق ہے\n\nتو وہ اللہ تعالیٰ کا یہ قول ہے: **\"اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے، یا پردے کے پیچھے سے، یا وہ کوئی رسول بھیجے (جو اس کے حکم سے وحی کرے)۔\"** (وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا)\nپس اس میں سے وحی وہ ہے جو اللہ ان کے دلوں میں حدیث کے طور پر القاء کرتا ہے، تو انہیں اس سے کسی امر کا علم حاصل ہوتا ہے، اور وہی اس حدیث میں شامل ہوتا ہے۔ اور اگر ایسا نہ ہو تو وہ نہ وحی ہے اور نہ خطاب۔ کیونکہ بعض دلوں کے حاملین کو لوگوں کے ہاں ضروری علوم میں سے کسی امر کا علم حاصل ہوتا ہے، تو وہ صحیح علم ہے جو خطاب کے ذریعے نہیں ہوتا۔ اور ہماری بات صرف اس خطاب الٰہی کے بارے میں ہے جسے وحی کہا جاتا ہے۔ کیونکہ اللہ تعالیٰ نے وحی کی اس قسم کو کلام قرار دیا ہے، اور کلام سے اس چیز کا علم حاصل ہوتا ہے جس کے لیے وہ کلام آیا ہے۔ اور اس سے فرق کیا جاتا ہے جب وہ پایا جائے۔\nاور جہاں تک اللہ تعالیٰ کے قول **\"یا پردے کے پیچھے سے\"** (أَوْ مِنْ وَرَاءِ حِجَابٍ) کا تعلق ہے، تو یہ وہ خطاب الٰہی ہے جو کان پر القاء کیا جاتا ہے نہ کہ دل پر، تو جس پر القاء کیا گیا وہ اسے ادراک کرتا ہے اور اس سے وہ بات سمجھتا ہے جو اسے سنانے والے کا مقصد تھا۔ اور کبھی یہ ظہور الٰہی (التجلی) کی صورتوں میں حاصل ہوتا ہے، تو وہ الٰہی صورت اس سے مخاطب ہوتی ہے، اور وہ عین حجاب ہوتی ہے، تو وہ اس خطاب سے اس علم کو سمجھتا ہے جس پر وہ دلالت کرتا ہے، اور جانتا ہے کہ یہ حجاب ہے اور کلام کرنے والا اس حجاب کے پیچھے ہے۔ اور ہر وہ شخص جو ظہور الٰہی (التجلی) کی صورت کو ادراک کرے، وہ یہ نہیں جانتا کہ وہ اللہ ہے۔ پس اس حال کا حامل دوسرے سے صرف اس بات میں بڑھ جاتا ہے کہ وہ جانتا ہے کہ وہ صورت اگرچہ حجاب ہے، لیکن وہ اس کے لیے ذات حق (الحق) کے ظہور الٰہی (التجلی) کی عین ہے۔\nاور جہاں تک اللہ تعالیٰ کے قول **\"یا وہ کوئی رسول بھیجے\"** (أَوْ يُرْسِلَ رَسُولًا) کا تعلق ہے، تو یہ وہ ہے جسے فرشتہ نازل کرتا ہے یا جو بشری رسول ہمارے پاس لاتا ہے، جب وہ خاص طور پر اللہ کا کلام نقل کریں۔ جیسے تلاوت کرنے والا، اللہ تعالیٰ نے فرمایا: **\"پس اسے پناہ دو یہاں تک کہ وہ اللہ کا کلام سن لے۔\"** (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ) اور اللہ تعالیٰ کا قول: **\"اور ہم نے اسے طور کے دائیں جانب سے پکارا اور اسے راز و نیاز کے لیے قریب کیا۔\"** (وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّا) اور اللہ تعالیٰ کا قول: **\"پکارا گیا کہ برکت دی گئی اس کو جو آگ میں ہے اور جو اس کے ارد گرد ہیں۔\"** (نُودِيَ أَنْ بُورِكَ مَنْ فِي النَّارِ وَمَنْ حَوْلَهَا)\nاگر وہ علم نقل کریں اور اسے واضح کریں اور اسے اپنے اندر پائیں، تو وہ کلام الٰہی نہیں ہے۔ اور کبھی رسول اور صورت دونوں ایک ساتھ ہوتے ہیں، اور یہ خود کتابت میں ہوتا ہے۔ پس کتاب رسول ہے اور متکلم پر عین حجاب ہے، تو وہ تمہیں وہ بات سمجھاتی ہے جو وہ لائی ہے، لیکن یہ اس وقت نہیں ہوتا جب وہ وہ لکھے جو وہ جانتا ہے، بلکہ یہ اس وقت ہوتا ہے جب وہ اس حدیث کے بارے میں لکھے جس سے وہ حروف اسے مخاطب کرتے ہیں جنہیں وہ لکھ رہا ہے۔ اور جب ایسا نہ ہو تو وہ کلام نہیں ہے۔ یہ ضابطہ ہے۔ پس رسولوں کے لیے القاء ہے، اور الٰہی خبر کا القاء واسطوں کے ہٹ جانے کے ساتھ ہوتا ہے، اس لحاظ سے کہ اس نے اس سے کلام کیا، بس۔ اور کتابت لکھی ہوئی لکیریں ہیں، جہاں بھی ہوں، وہ صرف اس شخص کی حدیث سے لکھی گئی ہیں جس نے انہیں لکھا ہے، نہ کہ علم سے۔ پس یہ سب اس مقام کے حامل کے لیے خطاب الٰہی میں سے ہے۔\n\n[اللہ کی طرف سے ترجمہ کا علم]\n\nاور جہاں تک اللہ کی طرف سے ترجمہ کے علم کا تعلق ہے، تو یہ ہر اس شخص کے لیے ہے جس سے اللہ نے القاء اور وحی میں کلام کیا ہو۔ پس مترجم ان لفظی یا لکھی ہوئی حروف کی صورتوں کا خالق ہوتا ہے جنہیں وہ وجود دیتا ہے، اور ان صورتوں کی روح صرف اللہ کا کلام ہوتی ہے۔ اگر وہ علم سے ترجمہ کرے تو وہ مترجم نہیں ہے۔ یہ ضروری ہے کہ ولی کہے: \"میرے دل نے میرے رب سے حدیث بیان کی۔\" اور کبھی مترجم احوال کی زبان سے ترجمہ کرتا ہے، لیکن یہ اس باب سے نہیں ہے، بلکہ یہ ایک دوسرے باب سے ہے جو احوال کے ذریعے عین فہم کی طرف لوٹتا ہے، اور یہ علماء الرسوم (ظاہری علوم کے علماء) کے ہاں معلوم ہے۔ اور اسی پر وہ اللہ تعالیٰ کے اس قول کو محمول کرتے ہیں: **\"اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے۔\"** (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ) وہ کہتے ہیں کہ اس سے مراد لسان حال (حالت کی زبان) ہے۔ اور اسی طرح اللہ تعالیٰ کا یہ قول: **\"بے شک ہم نے امانت کو آسمانوں، زمین اور پہاڑوں پر پیش کیا، تو انہوں نے اسے اٹھانے سے انکار کر دیا اور اس سے ڈر گئے۔\"** (إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا) تو انہوں نے اس انکار اور خوف کو حقیقت کے بجائے حال قرار دیا۔ اور اسی طرح ان دونوں (آسمان و زمین) کے بارے میں اس کا قول: **\"انہوں نے کہا: ہم فرمانبردار ہو کر آئے۔\"** (قَالَتَا أَتَيْنَا طَائِعِينَ) یہ قول حال کا ہے، نہ کہ خطاب کا قول۔ اور یہ سب صحیح نہیں ہے اور نہ ہی ان آیات میں مراد ہے۔ بلکہ امر اپنے ظاہر پر ہے جیسا کہ وارد ہوا ہے۔ اہل کشف (أهل الکشف) اسے اسی طرح ادراک کرتے ہیں۔ پس جب وہ موجودات کی طرف سے ترجمہ کرتے ہیں، تو وہ اس چیز کا ترجمہ کرتے ہیں جس سے وہ انہیں مخاطب کرتی ہیں، نہ کہ ان کے احوال کا، کیونکہ اگر وہ بولتے تو یہی کہتے۔ اور اس قول کے حاملین دو قسموں میں تقسیم ہو گئے ہیں: بعض کہتے ہیں کہ اگر یہ اور اس جیسی چیزیں حقیقت میں نطق اور کلام ہیں، تو ان بولنے والوں میں زندگی پیدا کرنا ضروری ہے، اور تب یہ حقیقت میں صحیح ہو سکتا ہے۔ اور یہ جائز ہے کہ اللہ ان میں زندگی پیدا کرے، لیکن ہمیں اس کا علم نہیں کہ معاملہ ویسا ہی ہوا جیسا ہم نے جائز قرار دیا یا یہ لسان حال ہے۔ لیکن اس قول کے حاملین کے نزدیک حقیقت میں ایسا ہی ہوا، کیونکہ اللہ کے سوا ہر چیز حقیقت میں زندہ اور بولنے والی ہے۔ پس اہل کشف (الکشف) اور ہستی (الوجود) کے نزدیک اس کے ساتھ احوال کا کوئی معنی نہیں۔ اور دوسرا گروہ، جو حکماء ہیں، انہوں نے کہا کہ یہ لسان حال ہونا ضروری ہے، کیونکہ یہ محال ہے کہ جمادات زندہ ہوں۔ اور یہ قول ایک گھنے پردے سے محجوب ہے۔ پس دنیا میں کوئی مترجم نہیں ہے مگر وہ جو الٰہی حدیث سے ترجمہ کرے، پس اسے سمجھ لو۔\n\n[حکمرانوں کے لیے مراتب کا تعین]\n\nاور جہاں تک حکمرانوں کے لیے مراتب کے تعین کا تعلق ہے، تو یہ اس علم سے عبارت ہے کہ ہر مرتبہ ان مصالح میں سے کس کا حقدار ہے جن کے لیے وہ پیدا کیا گیا ہے۔ پس اس علم کا حامل اس شخص کی ذات میں دیکھتا ہے جسے وہ والی بنانا چاہتا ہے، اور اس کے اور مرتبے کے درمیان میزان قائم کرتا ہے۔ پس اگر وہ وزن میں اعتدال دیکھے، بغیر اس کے کہ مرتبے کا پلڑا بھاری ہو، تو اسے والی بنا دے گا۔ اور اگر والی کا پلڑا بھاری ہو تو اسے نقصان نہیں دے گا، لیکن اگر مرتبے کا پلڑا اس پر بھاری ہو جائے تو اسے والی نہیں بنائے گا، کیونکہ وہ اس علم سے کم ہوگا جس کی وجہ سے مرتبے کا پلڑا بھاری ہوا، تو وہ بلاشبہ ظلم کرے گا، اور یہی حکمرانوں میں ظلم کی اصل ہے۔ اور ہمارے نزدیک یہ محال ہے کہ کوئی شخص جانتا ہو اور اپنے علم کے حکم سے مکمل طور پر عدول کر جائے، جبکہ علماء الرسوم (ظاہری علوم کے علماء) کے نزدیک یہ جائز ہے۔ اور ہمارے نزدیک یہ جائز وجود میں واقع نہیں ہوتا، اور یہ ایک مشکل مسئلہ ہے۔ اور اسی لیے مہدی زمین کو عدل و انصاف سے بھر دے گا، جیسا کہ وہ ظلم و ستم سے بھری ہوئی تھی۔ کیونکہ ہمارے نزدیک علم عمل کا تقاضا کرتا ہے اور یہ ضروری ہے، ورنہ وہ علم نہیں ہے، اگرچہ وہ علم کی صورت میں ظاہر ہو۔ اور مراتب تین ہیں جن میں حاکم کا حکم نافذ ہوتا ہے، اور وہ ہیں: خون، عزتیں، اور اموال۔ پس وہ جانتا ہے کہ ہر مرتبہ مشروع حکم الٰہی میں سے کیا طلب کرتا ہے۔ اور وہ لوگوں میں دیکھتا ہے، پس جسے وہ دیکھے کہ اس نے وہ سب جمع کر لیا ہے جو وہ مرتبہ طلب کرتا ہے، تو وہ اس جامع شخص کے مزاج میں دیکھتا ہے۔ اگر وہ اسے دیکھے کہ وہ علم کے حکم کے تحت تصرف کر رہا ہے، تو وہ جانتا ہے کہ وہ عاقل ہے اور اسے والی بنا دیتا ہے۔ اور اگر وہ اسے دیکھے کہ وہ اپنے علم پر حکم چلا رہا ہے، اور اس کا علم اس کے ساتھ اس کی شہوت اور اس کی خواہش کے تسلط کے تحت مغلوب ہے، تو وہ اسے والی نہیں بنائے گا، باوجود اس کے کہ وہ حکم کو جانتا ہو۔ بعض بادشاہوں نے اپنے ہم نشینوں میں سے اہل رائے اور صحیح نظر والے سے مشورہ کیا، تو اس نے کہا: \"آپ لوگوں کے معاملات پر کسے والی بنائیں گے؟\" اس نے کہا: \"لوگوں کے معاملات پر ایک عاقل شخص کو والی بناؤ، کیونکہ عاقل شخص اپنے لیے احتیاط کرتا ہے۔ اگر وہ عالم ہو تو اپنے علم کے مطابق حکم کرے گا، اور اگر وہ اس واقعے کا حکم نہ جانتا ہو، تو اس کی عقل اسے حکم دے گی کہ وہ اس شخص سے پوچھے جو اس نازل شدہ معاملے میں مشروع حکم الٰہی جانتا ہو، اور جب وہ اسے جان لے گا تو اس میں حکم کرے گا۔\" پس یہ عقل کا فائدہ ہے۔ کیونکہ بہت سے لوگ جو دین اور رسمی علم سے تعلق رکھتے ہیں، ان پر ان کی شہوتیں حکم چلاتی ہیں، اور عاقل ایسا نہیں ہوتا۔ کیونکہ عقل فضائل کے سوا کسی چیز کو قبول نہیں کرتی، کیونکہ وہ اپنے حامل کو نامناسب تصرف سے روکتی ہے، اور اسی لیے اسے عقل (لگام) سے عقل کہا گیا ہے۔\nاور جہاں تک غصے میں رحمت کا تعلق ہے، تو یہ صرف مشروع حدود اور تعزیرات میں ہوتا ہے۔ اور اس کے علاوہ جو کچھ ہے وہ ایسا غصہ ہے جس میں رحمت کا کوئی حصہ نہیں۔ اسی لیے ابو یزید نے کہا: \"میری پکڑ زیادہ سخت ہے،\" جب انہوں نے قاری کو یہ پڑھتے ہوئے سنا: **\"بے شک تیرے رب کی پکڑ بہت سخت ہے۔\"** (إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ) کیونکہ جب انسان اپنے لیے غصہ کرتا ہے تو اس غصے میں کسی بھی صورت میں رحمت شامل نہیں ہوتی۔ اور جب وہ اللہ کے لیے غصہ کرتا ہے تو اس کا غصہ اللہ کا غصہ ہوتا ہے، اور اللہ کا غصہ کسی الٰہی رحمت سے پاک نہیں ہوتا جو اس میں شامل ہو۔ پس دنیا میں اس کا غصہ وہ حدود اور تعزیرات ہیں جو اس نے مقرر کیں، اور آخرت میں اس کا غصہ وہ حدود ہیں جو وہ ان لوگوں پر قائم کرے گا جو جہنم میں داخل ہوں گے۔ پس اگرچہ وہ غصہ ہے، لیکن وہ اس چیز کی تطہیر ہے جو دنیا اور آخرت میں رحمت سے مشابہت رکھتی ہے، کیونکہ جب رحمت ہستی (الوجود) میں غصے سے سبقت لے گئی تو اس نے پوری کائنات کو گھیر لیا اور ہر چیز کو وسیع کر لیا۔ پس جب غصہ ہستی (الوجود) میں آیا تو اس نے رحمت کو پایا کہ وہ اس سے سبقت لے چکی ہے، اور اس کا وجود ضروری تھا۔ پس وہ رحمت کے ساتھ ایسا تھا جیسے پانی دودھ کے ساتھ ہو جب وہ اس میں شامل ہو جائے اور مل جائے، تو جس طرح پانی دودھ سے خالص نہیں ہوتا، اسی طرح غصہ رحمت سے خالص نہیں ہوتا۔ پس رحمت نے غصے پر حکم چلایا کیونکہ وہ محل کی مالک ہے۔ پس اللہ کا غصہ مغضوب علیہم پر ختم ہو جاتا ہے، اور اللہ کی رحمت ختم نہیں ہوتی۔ پس یہ مہدی صرف اللہ کے لیے غصہ کرے گا، اور اپنے غصے میں اللہ کی مقرر کردہ حدود کو قائم کرنے سے تجاوز نہیں کرے گا، برخلاف اس شخص کے جو اپنی خواہش اور اپنے مقصد کی مخالفت پر غصہ کرتا ہے۔ پس جو شخص اللہ کے لیے غصہ کرتا ہے، وہ عادل اور انصاف کرنے والا ہی ہو سکتا ہے، نہ کہ ظالم اور بے انصاف۔ اور جو شخص اس مقام کا دعویٰ کرتا ہے اس کی علامت یہ ہے کہ جب وہ اللہ کے لیے غصہ کرے اور حاکم ہو اور مغضوب علیہ پر حد قائم کرے، تو حد سے فارغ ہونے پر اس شخص پر سے غصہ زائل ہو جائے۔ اور بسا اوقات وہ اس کی طرف کھڑا ہوتا ہے اور اسے گلے لگاتا ہے اور اس سے انسیت کا اظہار کرتا ہے اور کہتا ہے: \"اللہ کا شکر ہے جس نے تمہیں پاک کر دیا۔\" اور اس سے خوشی اور بشاشت کا اظہار کرتا ہے، اور بسا اوقات اس کے بعد اس کے ساتھ احسان بھی کرتا ہے۔ یہ اس کا میزان ہے۔ اور اس محدود شخص کے لیے یہ سب رحمت ہی رحمت بن کر لوٹتا ہے۔ اور میں نے یہ چیز مغرب کے بعض قاضیوں میں دیکھی ہے، سبتہ شہر کے قاضی جنہیں ابو ابراہیم بن یغمور کہا جاتا تھا، وہ ہمارے شیخ ابو الحسین بن الصائغ، جو ابو ایوب انصاری کی اولاد میں سے تھے، اور ابو الصبر ایوب الفہری، اور ابو محمد بن عبد اللہ الحجری سے سبتہ میں ان کی قضا کے زمانے میں ہمارے ساتھ حدیث سنتے تھے۔ اور وہ کبھی بھی سوار ہو کر سننے کے لیے نہیں آتے تھے، بلکہ لوگوں کے درمیان چل کر آتے تھے۔ اور جب انہیں دو جھگڑنے والے ملتے جو ان کے پاس مقدمہ لاتے، تو وہ ان کے پاس کھڑے ہو جاتے اور ان کے درمیان صلح کرا دیتے۔ وہ بہت زیادہ آنسو بہانے والے، لمبی فکر والے، کثرت سے ذکر کرنے والے تھے، وہ خود اپنے طور پر دو قبیلوں کے درمیان صلح کرا دیتے تھے، تو وہ ان کی برکت سے صلح کر لیتے تھے۔ اور اگر قاضی کے ساتھ محدود شخص سے اللہ کا حق لینے کے بعد بھی غصہ باقی رہے، تو وہ نفس اور طبع کا غصہ ہے، یا اس محدود شخص کے لیے اس کے دل میں کوئی ذاتی معاملہ ہے، وہ اللہ کے لیے غصہ نہیں ہے۔ اس لیے اللہ اسے اجر نہیں دے گا۔ کیونکہ اس نے اس میں اللہ کے حق کی رعایت نہیں کی۔ اور یہ اللہ تعالیٰ کے اس قول میں سے ہے: **\"اور ہم تمہاری خبروں کو آزمائیں گے۔\"** (وَنَبْلُوَا أَخْبَارَكُمْ) پس اس نے پہلے انہیں ان چیزوں سے آزمایا جن کا انہیں مکلف بنایا، اور جب انہوں نے عمل کیا تو ان کے اعمال کو آزمایا کہ کیا انہوں نے انہیں ذات حق (الحق) کے خطاب کے لیے کیا یا کسی اور چیز کے لیے؟ اور یہی اللہ عزوجل کا یہ قول بھی ہے: **\"جس دن بھید کھولے جائیں گے۔\"** (يَوْمَ تُبْلَى السَّرَائِرُ) اور اہل کشف (الکشف) کے نزدیک یہ اس کا میزان ہے۔ پس حاکم کو حدود قائم کرتے وقت اپنے نفس پر نظر ڈالنے سے غافل نہیں ہونا چاہیے، اور اسے اس تشفی سے بچنا چاہیے جو نفوس کو حاصل ہوتی ہے۔ اور اسی لیے اسے غصے کی حالت میں حکم کرنے سے منع کیا گیا ہے، خواہ وہ اس شخص کے حق میں حاکم نہ ہو جسے حد قائم کرنے کی آزمائش میں ڈالا گیا ہے۔ پس اگر اسے اس میں کوئی تشفی ملے، تو وہ جان لے کہ اس نے یہ کام اللہ کے لیے نہیں کیا، اور اس میں اللہ کی طرف سے اس کے لیے کوئی خیر نہیں ہے۔ اور اگر وہ محدود شخص پر حد قائم کرنے پر خوش ہو، اگر اس کی خوشی اس لیے نہ ہو کہ اس سے آخرت میں مطالبہ کی وہ حد ساقط ہو گئی، تو وہ معلول (خراب) ہے۔ اور میرے نزدیک مشروع احکام کے مسائل میں زنا سے زیادہ مشکل کوئی نہیں ہے، خاص طور پر اگر اس پر حد قائم کر دی جائے، کیونکہ میں جانتا ہوں کہ حد قائم کرنے کے بعد بھی اس پر بندوں کے مظالم کے مطالبات باقی رہتے ہیں۔ اور جان لو کہ غیر حاکم کے لیے اللہ نے حد قائم کرنا مقرر نہیں کیا ہے، پس حدود سے تجاوز کرنے پر اسے غصہ نہیں آنا چاہیے۔ یہ صرف حکام کے لیے خاص ہے، اور رسول اللہ صلی اللہ علیہ وسلم کے لیے اس حیثیت سے کہ وہ حاکم تھے۔ پس اگر وہ صرف مبلغ ہوتے نہ کہ حاکم، تو جو شخص ان کی دعوت کو رد کرتا، اس پر انہیں غصہ نہ آتا، کیونکہ ان کے اختیار میں کچھ نہیں ہے اور نہ ہی ان پر ان کی ہدایت کی ذمہ داری ہے۔ کیونکہ اللہ اس بارے میں رسول صلی اللہ علیہ وسلم سے فرماتا ہے: **\"آپ پر صرف پہنچا دینا ہے۔\"** (إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ) اور آپ نے پہنچا دیا، پس اللہ نے جسے چاہا سنا دیا اور جسے چاہا بہرا کر دیا۔ پس وہ سب سے زیادہ عاقل لوگ ہیں، یعنی انبیاء۔ اور اگر داعی کو اس شخص پر کشف (الکشف) ہو جائے جسے اللہ نے دعوت سے بہرا کر دیا ہے، تو اس نے اسے نہیں سنا، تو وہ اس پر متغیر نہیں ہوتا۔ کیونکہ جب پکارنے والا کسی بہرے کو پکارے اور جان لے کہ اس نے اس کی پکار نہیں سنی، تو وہ اس پر کوئی غصہ نہیں کرتا اور اس کا عذر اس کے نزدیک قائم ہو جاتا ہے۔ اور اگر رسول حاکم ہو، تو اس پر لازم ہے کہ وہ اس کے مطابق حکم کرے جو اللہ نے اس کے لیے مقرر کیا ہے۔ اور یہ ایک شریف علم ہے جس کی ضرورت زمین پر ہر اس والی کو ہے جو عالم پر حاکم ہو۔\n\nاور جہاں تک بادشاہ کو رزق کی ضرورت کے علم کا تعلق ہے، تو یہ اس بات کا علم ہے کہ عالم کی اقسام کیا ہیں، اور وہ صرف دو ہیں۔ اور عالم سے میری مراد وہ ہیں جن میں اس امام کا حکم چلتا ہے، اور وہ ہیں عالم الصور (صورتوں کا عالم) اور عالم الأنفس (نفوس کا عالم) جو ان صورتوں کو ان تصرفات میں تدبیر کرتے ہیں جو وہ حرکت یا سکون میں کرتے ہیں۔ اور ان دو اقسام کے علاوہ، اس کا ان پر کوئی حکم نہیں ہے سوائے اس کے جو ان میں سے خود کو اس کے حکم کے تحت لانا چاہے، جیسے عالم جنات۔ اور جہاں تک عالم نورانی کا تعلق ہے، تو وہ اس سے باہر ہیں کہ عالم بشری ان پر کوئی ولایت رکھے۔ پس ان میں سے ہر شخص ایک معلوم مقام پر ہے جو اس کے رب نے اس کے لیے مقرر کیا ہے، تو وہ صرف اپنے رب کے حکم سے ہی نازل ہوتا ہے۔ پس جو ان میں سے کسی ایک کو نازل کرنا چاہے، تو وہ اس بارے میں اپنے رب کی طرف متوجہ ہو، اور اس کا رب اس سائل کی مدد کے لیے اسے حکم دے گا اور اجازت دے گا، یا اسے ابتداءً اس پر نازل کر دے گا۔ اور جہاں تک ان میں سے سیاحت کرنے والوں کا تعلق ہے، تو ان کا معلوم مقام یہ ہے کہ وہ سیاحت کرنے والے ہیں جو ذکر کی مجالس تلاش کرتے ہیں۔ پس جب وہ اہل ذکر کو پاتے ہیں، اور وہ اہل قرآن ہیں جو قرآن کا ذکر کرتے ہیں، تو وہ ان پر کسی ایسے شخص کو ترجیح نہیں دیتے جو بغیر قرآن کے ذکر کرنے والوں کی مجالس میں ہو۔ اور جب وہ اسے نہیں پاتے اور اللہ کا ذکر کرنے والوں کو پاتے ہیں، نہ کہ تلاوت کرنے والوں کی حیثیت سے، تو وہ ان کے پاس بیٹھ جاتے ہیں اور ایک دوسرے کو پکارتے ہیں: \"آؤ اپنی مطلوبہ چیز کی طرف!\" پس یہی ان کا رزق ہے جس سے وہ زندہ رہتے ہیں اور جس میں ان کی زندگی ہے۔ پس جب امام یہ جان لے گا، تو وہ ہمیشہ ایک جماعت کو قائم رکھے گا جو **\"رات اور دن کے اوقات میں اللہ کی آیات کی تلاوت کرتے ہیں۔\"** (يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَالنَّهَارِ) اور ہم مغرب کے شہر فاس میں تھے، ہم نے یہ طریقہ اختیار کیا تھا، کیونکہ ہمیں کامیاب ساتھی ملے تھے جو ہماری بات سنتے اور مانتے تھے۔ اور جب ہم نے انہیں کھو دیا، تو ان کے کھو جانے کی وجہ سے ہم نے یہ خالص عمل کھو دیا، اور یہ سب سے اشرف اور اعلیٰ رزق ہے۔ پس جب ہم نے ایسے لوگوں کو کھو دیا، تو ہم نے ان ارواح کے لیے علم پھیلانا شروع کر دیا جن کی غذا علم ہے، اور ہم نے یہ رائے قائم کی کہ ہم اس میں سے کوئی چیز نہ لائیں مگر اس اصل سے جو اس روحانی صنف کے لیے مطلوب ہے، اور وہ قرآن ہے۔ پس میری مجالس اور میری تصانیف میں ہم جو کچھ بھی کلام کرتے ہیں، وہ سب قرآن کی بارگاہ اور اس کے خزانوں سے ہے، مجھے اس میں فہم کی کنجی اور اس سے مدد دی گئی ہے۔ اور یہ سب اس لیے ہے تاکہ ہم اس سے باہر نہ نکلیں، کیونکہ یہ سب سے بلند عطیہ ہے، اور اس کی قدر وہی جانتا ہے جس نے اسے چکھا ہو اور اپنے نفس سے اس کے مقام کا شہود (الشہود) کیا ہو، اور ذات حق (الحق) نے اس کے راز میں اس سے کلام کیا ہو۔ کیونکہ جب ذات حق (الحق) واسطوں کے ہٹ جانے کے ساتھ اپنے بندے سے اس کے راز میں کلام کرتا ہے، تو فہم اس کے کلام کو تم سے ساتھ لے لیتا ہے، پس اس کا کلام عین تمہارا فہم ہوتا ہے، اس سے پیچھے نہیں رہتا۔ اگر وہ اس سے پیچھے رہے تو وہ اللہ کا کلام نہیں ہے۔ اور جس نے یہ نہ پایا، اس کے پاس اللہ کے اپنے بندوں سے کلام کرنے کا علم نہیں ہے۔ اور جب وہ اس سے صوری حجاب کے ذریعے کسی نبی کی زبان سے یا عالم میں سے جس سے چاہے کلام کرے، تو فہم اس کے ساتھ بھی ہو سکتا ہے اور اس سے پیچھے بھی رہ سکتا ہے۔ یہ ان دونوں کے درمیان فرق ہے۔\nاور جہاں تک محسوس رزق کا تعلق ہے، تو اس میں اس کا حکم صرف \"بقیۃ اللہ\" (اللہ کی باقی ماندہ چیز) میں ہے۔ پس جس نے اس بقیہ سے باہر کی چیز کھائی، اس نے اس عادل امام کے ہاتھ سے نہیں کھایا۔ اور مومنوں کے حق میں اللہ کے رزق کا نام صرف \"بقیۃ اللہ\" ہے۔ اور کائنات میں ہر رزق \"بقیۃ اللہ\" میں سے ہے۔ اور صرف یہ باقی ہے کہ ان دونوں میں فرق کیا جائے۔ اور وہ یہ ہے کہ دنیا میں تمام اموال یا تو کسی معین مالک کے ہوں گے یا ان کا کوئی مالک نہیں ہوگا۔ پس اگر ان کا کوئی معین مالک ہو، تو وہ اس شخص کے لیے \"بقیۃ اللہ\" میں سے ہے، اور اگر ان کا کوئی معین مالک نہ ہو، تو وہ تمام مسلمانوں کے لیے ہے، تو اللہ نے اس امام کو ان کے لیے وکیل بنا دیا ہے جو اس کی حفاظت کرتا ہے۔ پس یہ \"بقیۃ اللہ\" میں سے ہے جو مملوکہ مال سے زیادہ ہے۔ پس دنیا میں ہر رزق \"بقیۃ اللہ\" ہے، اگر تم \"بقیۃ اللہ\" کا معنی جان لو۔ پس زید کا مال زید کے لیے \"بقیۃ اللہ\" ہے، کیونکہ اللہ نے اسے عمرو کے مال میں اس کی اجازت کے بغیر تصرف کرنے سے روک دیا ہے۔ اور عمرو کا مال عمرو کے لیے \"بقیۃ اللہ\" ہے، کیونکہ اللہ نے اسے زید کے مال میں اس کی اجازت کے بغیر تصرف کرنے سے روک دیا ہے۔ پس دنیا میں کوئی رزق نہیں مگر وہ \"بقیۃ اللہ\" ہے۔ پس امام اس میں اسی قدر حکم کرے گا جتنا اللہ نے اس میں حکم نازل کیا ہے۔\n\n[لوگ دو حالتوں پر ہیں]\n\nپس یہ جان لو کہ لوگ دو حالتوں پر ہیں: اضطرار (مجبوری) اور غیر اضطرار۔ پس اضطرار کی حالت وقت کی ضرورت کے بقدر مباح کر دیتی ہے اور اس سے تحجیر (روک تھام) کا حکم اٹھا لیتی ہے۔ پس جب وہ ایسی چیز حاصل کر لے جس سے اس کی مجبوری دور ہو جائے، تو اس پر تحجیر کا حکم غالب آ جاتا ہے۔ اور اگر مضطر نے کسی ایسی چیز میں تصرف کیا جو کسی کی ملکیت ہے، تو ایک قول کے مطابق وہ ضمانت کے حکم سے تصرف کرے گا، اور ایک قول کے مطابق بغیر ضمانت کے۔ پس اگر وہ ضمانت کے قائل کے نزدیک پائے تو اسے ادا کرے، اور اگر نہ پائے تو امام وقت بیت المال سے اس کی طرف سے ادا کرے گا۔ اور اگر تصرف کرنے والے نے کسی ایسی چیز میں تصرف کیا جس کا کوئی مالک نہیں ہے، یا امام اللہ کی طرف سے مطلق وکالت کے حکم سے اس کا مالک ہے، تو اس پر کچھ نہیں ہے، نہ ضمانت اور نہ کوئی اور چیز۔ اور یہ وہ علم ہے جس کی معرفت امام وقت پر ضروری ہے، اس کا ہونا لازمی ہے۔ پس مکلفین میں سے کسی نے بھی مشروع طریقے سے تصرف نہیں کیا مگر \"بقیۃ اللہ\" میں۔ اللہ عزوجل نے فرمایا: **\"اللہ کی باقی ماندہ چیز تمہارے لیے بہتر ہے اگر تم مومن ہو۔\"** (بَقِيَّتُ اللَّهِ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ) اور یہ ایک فرعی حکم ہے۔ اصل یہ ہے کہ اللہ نے ہمارے لیے **\"جو کچھ زمین میں ہے سب پیدا کیا،\"** (مَا فِي الْأَرْضِ جَمِيعًا) پھر روک تھام کی اور باقی رکھا۔ پس جسے باقی رکھا اسے \"بقیۃ اللہ\" کہا، اور جسے روک دیا اسے حرام کہا، یعنی مکلف کو اس میں تصرف کرنے سے روکا گیا ہے، خواہ حالاً، زماناً یا مکاناً، روک تھام کے ساتھ۔ کیونکہ اصل یہ ہے کہ اس میں کسی چیز کے بارے میں حکم جاری کرنے سے توقف کیا جائے، پس جب اس میں اللہ کا حکم آ جائے، تو ہم اس الٰہی حکم کے مطابق ہوں گے جو شریعت کے ذریعے ہم تک پہنچا ہے۔ پس جس نے یہ جان لیا، اس نے جان لیا کہ رزق میں کیسے تصرف کرنا ہے۔\nاور جہاں تک امور کے ایک دوسرے میں داخل ہونے کے علم کا تعلق ہے، تو یہ اللہ تعالیٰ کے اس قول کا معنی ہے: **\"وہ رات کو دن میں داخل کرتا ہے اور دن کو رات میں داخل کرتا ہے۔\"** (يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ) پس داخل کرنے والا مذکر ہے اور جس میں داخل کیا گیا وہ مونث ہے۔ یہ حکم جہاں بھی ظاہر ہو، اس کے ساتھ رہتا ہے۔ پس علوم میں یہ علم نظری ہے، اور محسوسات میں یہ حیوانی اور نباتی نکاح ہے۔ اور ان میں سے کوئی بھی چیز صرف اپنی ذات کے لیے مراد نہیں ہے، بلکہ وہ اپنی ذات کے لیے اور اس کے لیے بھی مراد ہے جو اس سے پیدا ہو۔ اور اگر لحمہ (بناوٹ) اور سد (بندش) نہ ہوتی تو شفا (لب) کی عین ظاہر نہ ہوتی۔ اور یہ تمام عملی اور علمی صنعتوں میں جاری ہے۔ پس جب امام یہ جان لے گا، تو اس کے احکام میں کوئی شبہ داخل نہیں ہوگا۔ اور یہی وہ میزان ہے جو عالم میں معانی اور محسوسات میں رکھا گیا ہے۔ اور عاقل دونوں عالموں میں میزان کے ساتھ تصرف کرتا ہے، بلکہ ہر اس چیز میں جس میں اسے تصرف حاصل ہے۔\nاور جہاں تک نازل شدہ وحی کے ذریعے حکم کرنے والوں، یعنی رسولوں اور ان جیسے لوگوں کا تعلق ہے، تو وہ توالج (داخل ہونے) سے باہر نہیں ہیں۔ کیونکہ اللہ نے انہیں اس چیز کا محل بنایا ہے جو وہ اپنے بندوں میں اپنے حکم سے ان کی طرف القاء کرتا ہے۔ اللہ تعالیٰ نے فرمایا: **\"اسے روح الامین نے آپ کے دل پر نازل کیا۔\"** (نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ) اور اللہ تعالیٰ نے فرمایا: **\"وہ فرشتوں کو اپنے حکم سے روح کے ساتھ اپنے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے۔\"** (يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ) پس کسی رسول کی طرف سے عالم میں کوئی حکم ظاہر نہیں ہوا مگر معنوی نکاح کے ذریعے، نہ کہ نصوص میں اور نہ ہی قیاس سے حکم کرنے والوں میں۔ پس امام پر یہ علم متعین ہے کہ وہ جان لے کہ کون سا حکم الٰہی تنزیل کے ذریعے ہے اور کون سا قیاس کے ذریعے ہے۔ اور مہدی قیاس کا علم اس لیے نہیں جانتا کہ اس سے حکم کرے، بلکہ اس لیے جانتا ہے کہ اس سے بچے، پس مہدی صرف اسی چیز سے حکم کرے گا جو فرشتہ اللہ کی طرف سے اس پر القاء کرے گا، جسے اللہ نے اس کی تائید کے لیے بھیجا ہے۔ اور یہی حقیقی شریعت محمدیہ ہے، کہ اگر محمد صلی اللہ علیہ وسلم زندہ ہوتے اور وہ نازلہ ان کے سامنے پیش کیا جاتا، تو وہ اس میں وہی حکم کرتے جو یہ امام حکم کرے گا۔ پس اللہ اسے سکھا دے گا کہ یہی شریعت محمدیہ ہے، تو اللہ کی طرف سے عطا کردہ نصوص کی موجودگی میں اس پر قیاس حرام ہو جائے گا۔ اور اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے مہدی کی صفت میں فرمایا: **\"وہ میرے نقش قدم پر چلے گا، خطا نہیں کرے گا۔\"**\n\nپس ہم نے جان لیا کہ وہ (رسول) متبوع نہیں بلکہ متبع ہیں، اور وہ معصوم ہیں، اور حکم میں معصوم کا کوئی معنی نہیں سوائے اس کے کہ وہ خطا نہیں کرتے، کیونکہ رسول کے حکم کی طرف خطا منسوب نہیں کی جا سکتی، اس لیے کہ وہ اپنی خواہش سے کلام نہیں کرتے:\n**إِنْ هُوَ إِلَّا وَحْيٌ يُوحىٰ**\n(وہ تو صرف وحی ہے جو نازل کی جاتی ہے)۔\n\nجیسا کہ اس مقام پر قیاس کرنا جائز نہیں جہاں رسول اللہ صلی اللہ علیہ وسلم موجود ہوں، اور اہل کشف کے نزدیک نبی موجود ہوتے ہیں، لہٰذا وہ حکم صرف آپ صلی اللہ علیہ وسلم سے ہی لیتے ہیں۔ اسی لیے سچا فقیر کسی مذہب کی طرف منسوب نہیں ہوتا، بلکہ وہ اس رسول کے ساتھ ہوتا ہے جس کا اسے شہود (الشہود) حاصل ہے، جیسا کہ رسول اس وحی کے ساتھ ہوتے ہیں جو ان پر نازل ہوتی ہے۔ پس اللہ کی طرف سے سچے عارفین کے قلوب پر نازل ہونے والی تعریف (التعریف) کے ذریعے انہیں یہ معلوم ہو جاتا ہے کہ پیش آنے والے واقعات کا حکم وہی شرعی حکم ہے جسے رسول اللہ صلی اللہ علیہ وسلم لے کر مبعوث ہوئے تھے۔\n\nاور علم الرسوم (ظاہری علوم) کے حاملین کو یہ مرتبہ حاصل نہیں ہوتا، کیونکہ وہ جاہ، ریاست، اور اللہ کے بندوں پر برتری کی محبت میں ڈوبے ہوئے ہیں، اور عوام کا ان پر انحصار ہوتا ہے۔ پس وہ نہ تو خود فلاح پاتے ہیں اور نہ ہی ان کے ذریعے کوئی فلاح پاتا ہے۔ یہ زمانہ کے ان فقہاء کا حال ہے جو قضاء، شہادت، حسبہ (احتساب)، اور تدریس جیسے مناصب کی خواہش رکھتے ہیں۔\n\nاور ان میں سے جو دین کا دکھاوا کرتے ہیں، وہ اپنے کندھوں کو سمیٹتے ہیں اور لوگوں کو چھپی ہوئی نظر سے دیکھتے ہیں، ایک خاشع (عاجزی کرنے والے) کی نظر سے، اور اپنے ہونٹوں کو ذکر کے لیے ہلاتے ہیں تاکہ دیکھنے والا جان لے کہ وہ ذاکر ہیں، اور وہ اپنی گفتگو میں بناوٹ کرتے ہیں اور منہ پھاڑ کر بولتے ہیں۔ ان پر نفس کی رعونتیں غالب ہوتی ہیں اور ان کے دل بھیڑیوں کے دل ہوتے ہیں۔ اللہ ان کی طرف نظر نہیں فرماتا۔ یہ ان میں سے متدین (دیندار بننے والے) کا حال ہے، نہ کہ ان کا جو شیطان کے ساتھی ہیں، اللہ کو ان کی کوئی حاجت نہیں۔ انہوں نے لوگوں کے لیے نرمی کی بھیڑ کی کھالیں پہن رکھی ہیں، وہ اعلانیہ بھائی ہیں مگر باطن کے دشمن ہیں۔ پس اللہ ان کی طرف رجوع فرمائے اور ان کی پیشانیوں کو پکڑ کر اس طرف لے جائے جس میں ان کی سعادت ہے۔\n\nاور جب یہ امام مہدی ظاہر ہوں گے تو ان کا کوئی کھلا دشمن نہیں ہوگا سوائے فقہاء کے، خاص طور پر، کیونکہ ان کے لیے کوئی ریاست باقی نہیں رہے گی، نہ عوام سے کوئی امتیاز باقی رہے گا، اور نہ ہی ان کے پاس احکام کا کوئی علم باقی رہے گا سوائے تھوڑے سے۔ اور اس امام کے وجود سے دنیا سے احکام میں اختلاف ختم ہو جائے گا۔ اور اگر مہدی کے ہاتھ میں تلوار نہ ہوتی تو فقہاء ان کے قتل کا فتویٰ دے دیتے، لیکن اللہ انہیں تلوار اور کرم کے ساتھ ظاہر کرے گا، پس وہ لالچ بھی کریں گے اور خوف بھی کھائیں گے، اور ان کے حکم کو بغیر ایمان کے قبول کر لیں گے، بلکہ اپنے دلوں میں اس کی مخالفت چھپائیں گے، جیسا کہ حنفی اور شافعی اس میں کرتے ہیں جس میں ان کا اختلاف ہوتا ہے۔ ہمیں خبر دی گئی ہے کہ وہ عجم کے علاقوں میں ایک دوسرے سے لڑیں گے، دونوں مذاہب کے پیروکار، اور ان کے درمیان بہت سی مخلوق ماری جائے گی، اور وہ رمضان کے مہینے میں روزہ توڑ دیں گے تاکہ قتال کے لیے قوت حاصل کر سکیں۔ ایسے لوگ اگر امام مہدی کی تلوار کے قہر میں نہ ہوتے تو وہ ان کی بات نہ سنتے اور نہ ہی ظاہری طور پر ان کی اطاعت کرتے، جیسا کہ وہ دلوں سے ان کی اطاعت نہیں کرتے، بلکہ ان کے بارے میں یہ اعتقاد رکھتے ہیں کہ جب وہ ان کے مذہب کے خلاف کوئی حکم دیں گے تو وہ اس حکم میں گمراہی پر ہیں، کیونکہ وہ یہ اعتقاد رکھتے ہیں کہ اجتہاد کرنے والوں کا زمانہ ختم ہو چکا ہے اور دنیا میں کوئی مجتہد باقی نہیں رہا، اور یہ کہ اللہ ان کے ائمہ کے بعد کسی کو اجتہاد کا درجہ نہیں دے گا۔ اور جو شخص شرعی احکام کے بارے میں الٰہی تعریف (التعریف) کا دعویٰ کرتا ہے، وہ ان کے نزدیک مجنون اور فاسد خیال والا ہے، وہ اس کی طرف توجہ نہیں کرتے۔ ہاں، اگر وہ مال اور سلطنت والا ہو تو وہ ظاہری طور پر اس کی اطاعت کرتے ہیں، اس کے مال کی رغبت میں اور اس کی سلطنت کے خوف سے، جبکہ وہ اپنے باطن میں اس کے منکر ہوتے ہیں۔\n\n### [مہدی اور لوگوں کی ضروریات پوری کرنے میں مبالغہ اور استقصاء]\n\nاور لوگوں کی ضروریات پوری کرنے میں مبالغہ اور استقصاء (پوری کوشش) کرنا خاص طور پر امام پر متعین ہے، تمام لوگوں کے مقابلے میں۔ کیونکہ اللہ نے اسے اپنی مخلوق پر مقدم نہیں کیا اور نہ ہی انہیں ان کا امام بنایا ہے مگر اس لیے کہ وہ ان کے مفادات کے لیے کوشش کرے۔ یہ کوشش جو نتیجہ پیدا کرتی ہے وہ بہت عظیم ہے۔\n\nاور اس کی دلیل موسیٰ علیہ السلام کے قصے میں ہے، جب وہ اپنے اہل کے حق میں چلے تاکہ ان کے لیے آگ تلاش کریں جس سے وہ گرمی حاصل کریں اور اس کام کو پورا کریں جو عادت کے مطابق اس کے بغیر پورا نہیں ہو سکتا تھا۔ اور آپ علیہ السلام کو اس بات کی خبر نہیں تھی کہ انہیں کیا ملنے والا ہے، پس اس طلب کا انجام ان کے لیے ان کے رب کے کلام کی صورت میں ظاہر ہوا، تو اللہ تعالیٰ نے ان کی عین ضرورت یعنی آگ کے بارے میں کلام فرمایا، ظاہری صورت میں۔ اور یہ معاملہ آپ علیہ السلام کے دل میں کبھی نہیں آیا تھا۔ اور اس سے بڑھ کر کیا چیز ہو سکتی ہے؟ اور یہ انہیں صرف اس وقت حاصل ہوا جب وہ اپنے اہل و عیال کے حق میں کوشش کر رہے تھے، تاکہ اللہ انہیں عیال کی ضروریات پوری کرنے کی فضیلت سے آگاہ کرے، اور وہ ان کے حق میں اپنی کوشش میں مزید حرص پیدا کریں۔ پس یہ حق تعالیٰ کی طرف سے اس بات پر تنبیہ تھی کہ اللہ کے نزدیک اس کا کتنا مقام ہے اور ان (عیال) کا کتنا مقام ہے، کیونکہ وہ بہرحال اس کے بندے ہیں، اور اس (امام) کو ان کی دیکھ بھال پر مقرر کیا گیا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ**\n(مرد عورتوں پر نگہبان ہیں)۔\n\nاور اس کوشش کا نتیجہ یہ نکلا کہ قتل کے طالب دشمنوں سے فرار ہونے کے بعد انہیں حکم (حکمت) اور رسالت ملی، جیسا کہ اللہ تعالیٰ نے ان کے اس قول سے خبر دی:\n**فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ**\n(پس جب میں نے تم سے خوف کھایا تو تم سے بھاگ گیا، پھر میرے رب نے مجھے حکم (حکمت) عطا فرمایا اور مجھے رسولوں میں شامل کر دیا)۔\n\nاور اللہ نے انہیں عیال کے لیے کوشش کرنے اور ان کی ضروریات پوری کرنے کے بدلے میں کلام اللہ عطا فرمایا، اور یہ سب بلاشبہ کوشش تھی۔ کیونکہ بھاگنے والا اپنے فرار میں ایک حیوانی نسبت لے کر آیا، اس کے نفس نے دشمنوں سے نجات کی طلب میں فرار اختیار کیا اور ناطق نفس پر ملک اور تدبیر کو باقی رکھنے کے لیے۔ پس اس نے اپنے حیوانی نفس کے ساتھ اپنے فرار میں صرف ناطق نفس کے حق میں کوشش کی جو اس بدن کی تدبیر کی مالک ہے۔\n\nاور تمام عادل ائمہ کی حرکت غیر کے حق میں ہوتی ہے، نہ کہ ان کے اپنے حق میں۔ پس جب تم دیکھو کہ حکمران اپنی رعایا اور ان کی ضروریات کے علاوہ کسی اور چیز میں مشغول ہے، تو جان لو کہ اس فعل کی وجہ سے اس کا مرتبہ اس سے چھین لیا گیا ہے، اور اس میں اور عام لوگوں میں کوئی فرق نہیں۔\n\nاور جب عمر بن عبد العزیز رضی اللہ عنہ نے خلافت سنبھالی تو انہوں نے لوگوں کی ضروریات پوری کرنے کے کام سے تھک کر اپنے نفس کو آرام دینے کا ارادہ کیا، تو ان کے بیٹے ان کے پاس آئے اور کہا: \"اے امیر المؤمنین! آپ آرام کر رہے ہیں جبکہ حاجت مند دروازے پر ہیں؟ جو شخص آرام چاہتا ہے وہ لوگوں کے معاملات کا والی نہ بنے۔\" تو عمر رو پڑے اور کہا: \"الحمد للہ! جس نے میری پشت سے ایسا شخص نکالا جو مجھے تنبیہ کرتا ہے اور مجھے حق کی طرف بلاتا ہے اور اس پر میری مدد کرتا ہے۔\" پس انہوں نے آرام چھوڑ دیا اور لوگوں کی طرف نکل گئے۔\n\nاسی طرح خضر، جن کا نام بلیا بن ملکان بن فالغ بن غابر بن شالخ بن ارفخشد بن سام بن نوح علیہ السلام ہے، ایک لشکر میں تھے، اور امیر لشکر نے انہیں پانی کی تلاش میں بھیجا، کیونکہ وہ پانی سے محروم ہو چکے تھے۔ پس وہ آب حیات کے چشمے پر جا پہنچے اور اس میں سے پی لیا، تو وہ اب تک زندہ ہیں۔ اور وہ نہیں جانتے تھے کہ اللہ نے اس پانی کے پینے والے کو کس زندگی سے نوازا ہے۔\n\nمیں ان سے اشبیلیہ میں ملا، اور انہوں نے مجھے مشائخ کے سامنے سر تسلیم خم کرنے کی نصیحت کی اور یہ کہ میں ان سے جھگڑا نہ کروں۔ اور میں اس دن اپنے ایک شیخ سے ایک مسئلے میں جھگڑا کر کے ان کے پاس سے نکلا تھا۔ پس میں خضر سے قوس الحنیہ کے مقام پر ملا، تو انہوں نے مجھ سے کہا: \"شیخ کے قول کو تسلیم کر لو۔\" پس میں فوراً شیخ کے پاس واپس آیا۔ جب میں ان کے گھر میں داخل ہوا تو انہوں نے میرے کلام کرنے سے پہلے ہی مجھ سے کلام کیا اور فرمایا: \"اے محمد! کیا تم چاہتے ہو کہ ہر اس مسئلے میں جس میں تم مجھ سے جھگڑو، خضر تمہیں مشائخ کے سامنے سر تسلیم خم کرنے کی وصیت کریں؟\" میں نے ان سے کہا: \"اے ہمارے سردار! وہی خضر تھے جنہوں نے مجھے وصیت کی تھی۔\" انہوں نے کہا: \"ہاں۔\" میں نے کہا: \"الحمد للہ! یہ ایک فائدہ ہے، اس کے باوجود معاملہ وہی ہے جو میں نے آپ سے ذکر کیا تھا۔\"\n\nپھر کچھ مدت بعد میں شیخ کے پاس گیا تو میں نے دیکھا کہ وہ اس مسئلے میں میرے قول کی طرف رجوع کر چکے تھے اور مجھ سے کہا: \"میں اس میں غلطی پر تھا اور تم حق پر تھے۔\" میں نے ان سے کہا: \"اے میرے سردار! مجھے اب معلوم ہوا کہ خضر نے مجھے صرف تسلیم کرنے کی وصیت کی تھی، انہوں نے مجھے یہ نہیں بتایا تھا کہ آپ اس مسئلے میں حق پر ہیں، کیونکہ اس میں آپ سے جھگڑنا مجھ پر متعین نہیں تھا، کیونکہ یہ ان مشروع احکام میں سے نہیں تھا جن پر خاموش رہنا حرام ہو۔\" اور میں نے اس پر اللہ کا شکر ادا کیا اور شیخ کے لیے خوش ہوا کہ ان پر حق واضح ہو گیا۔\n\nاور یہ عین حیات (آب حیات) ہے، ایک ایسا پانی جس سے اللہ نے اس کے پینے والے کو زندگی سے نوازا۔ پھر وہ اپنے ساتھیوں کے پاس واپس آئے اور انہیں پانی کے بارے میں بتایا، تو لوگ اس جگہ کی طرف تیزی سے بڑھے تاکہ اس سے پانی بھریں، لیکن اللہ نے ان کی آنکھوں کو اس سے اندھا کر دیا، پس وہ اسے حاصل نہ کر سکے۔ پس یہ وہ نتیجہ ہے جو انہیں غیر کے حق میں ان کی کوشش سے حاصل ہوا۔\n\nاسی طرح جو شخص اللہ کے لیے دوستی کرے، اللہ کے لیے دشمنی کرے، اللہ کے لیے محبت کرے اور اللہ کے لیے بغض رکھے، وہ بھی اسی باب سے ہے۔ اللہ تعالیٰ فرماتا ہے:\n**لَا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ أُولئِكَ كَتَبَ في قُلُوبِهِمُ الْإِيمانَ وأَيَّدَهُمْ بِرُوحٍ مِنْهُ**\n(تم کسی ایسی قوم کو نہ پاؤ گے جو اللہ اور یوم آخرت پر ایمان رکھتی ہو کہ وہ ان لوگوں سے دوستی رکھیں جو اللہ اور اس کے رسول کی مخالفت کرتے ہیں، خواہ وہ ان کے باپ ہوں یا ان کے بیٹے یا ان کے بھائی یا ان کا قبیلہ۔ یہ وہ لوگ ہیں جن کے دلوں میں اللہ نے ایمان لکھ دیا ہے اور اپنی طرف سے روح کے ذریعے ان کی تائید کی ہے)۔\n\nپس کوئی نہیں جانتا کہ اللہ کے نزدیک ان کا کیا مقام ہے، کیونکہ وہ نہ تو حرکت کرتے ہیں اور نہ ہی سکون اختیار کرتے ہیں مگر اللہ کے حق میں، نہ کہ اپنے نفس کے حق میں، اللہ کی جناب کو اس چیز پر ترجیح دیتے ہوئے جو ان کی طبیعت کا تقاضا ہے۔\n\nاور علم غیب پر واقفیت جو خاص طور پر ایک خاص مدت میں کائنات کے لیے ضروری ہے، یہ نواں مسئلہ ہے، جس کے بعد امام کو اپنی امامت میں کسی چیز کی ضرورت نہیں رہتی۔ اور وہ یہ ہے کہ اللہ تعالیٰ نے اپنے بارے میں خبر دی ہے کہ:\n**كُلَّ يَوْمٍ هُوَ في شَأْنٍ**\n(وہ ہر دن ایک نئی شان میں ہے)۔\n\nاور شان وہ ہے جس پر عالم اس دن ہوتا ہے۔ اور یہ معلوم ہے کہ جب وہ شان وجود میں ظاہر ہوتی ہے تو ہر وہ شخص جو اس کا مشاہدہ کرتا ہے، اسے معلوم ہو جاتا ہے۔ پس اس مسئلے سے اس امام کو حق کی طرف سے اس بات پر اطلاع حاصل ہوتی ہے کہ حق کیا چاہتا ہے کہ وہ وجود میں آنے سے پہلے ہی ان شؤون (شانوں) کو ظاہر کرے۔ پس وہ اس شان کے وقوع سے ایک دن پہلے اس شان پر مطلع ہو جاتا ہے۔ اگر وہ اس کی رعایا کے لیے فائدہ مند ہو تو وہ اللہ کا شکر ادا کرتا ہے اور خاموش رہتا ہے، اور اگر وہ کسی عام بلا یا مخصوص افراد پر عذاب کے نزول کی صورت میں ہو، تو وہ ان کے حق میں اللہ سے سوال کرتا ہے، شفاعت کرتا ہے اور تضرع کرتا ہے، پس اللہ اپنی رحمت اور فضل سے اس بلا کو ان سے دور کر دیتا ہے اور اس کی دعا اور سوال کو قبول فرماتا ہے۔ اسی لیے اللہ اسے وجود میں آنے سے پہلے ہی اس کے ساتھیوں کے ساتھ اس پر مطلع کر دیتا ہے۔\n\nپھر اللہ اسے ان شؤون میں افراد کی طرف سے پیش آنے والے واقعات (نوازل) پر مطلع کرتا ہے، اور ان افراد کو ان کی حلیہ (شکل و صورت) کے ساتھ متعین کر دیتا ہے، یہاں تک کہ جب وہ انہیں دیکھتا ہے تو اسے کوئی شک نہیں ہوتا کہ وہ وہی ہیں جنہیں اس نے دیکھا تھا۔ پھر اللہ اسے اس نازلہ میں مشروع حکم پر مطلع کرتا ہے، جسے اللہ نے اپنے نبی محمد صلی اللہ علیہ وسلم کے لیے اس میں حکم دینے کے لیے مشروع کیا تھا۔ پس وہ صرف اسی حکم سے فیصلہ کرتا ہے اور کبھی خطا نہیں کرتا۔\n\nاور اگر اللہ کسی نازلہ میں اس پر حکم کو پوشیدہ کر دے اور اسے اس پر کشف حاصل نہ ہو، تو اس کی انتہا یہ ہوتی ہے کہ وہ اسے حکم میں مباح کے ساتھ ملحق کر دیتا ہے، اور عدم تعریف (الٰہی آگاہی نہ ہونے) سے جان لیتا ہے کہ اس میں شرع کا یہی حکم ہے۔ کیونکہ وہ دین میں رائے اور قیاس سے معصوم ہے۔ اس لیے کہ جو شخص نبی نہیں ہے اس کا قیاس کرنا اللہ کے دین میں اللہ پر اس چیز کے ساتھ حکم لگانا ہے جسے وہ نہیں جانتا۔ کیونکہ وہ ایک علت کو جاری کرتا ہے، اور تمہیں کیا معلوم، شاید اللہ اس علت کو جاری کرنا نہ چاہتا ہو؟ اور اگر وہ چاہتا تو اسے اپنے رسول صلی اللہ علیہ وسلم کی زبان سے واضح کر دیتا اور اسے جاری کرنے کا حکم دیتا۔ یہ تو تب ہے جب علت وہ ہو جس پر شرع نے کسی معاملے میں نص کی ہو۔ تو تمہارا کیا خیال ہے اس علت کے بارے میں جسے فقیہ اپنے نفس اور نظر سے خود نکالتا ہے، بغیر اس کے کہ شرع نے اس میں کوئی مخصوص نص ذکر کی ہو؟ پھر اسے استنباط کرنے کے بعد اسے جاری کرتا ہے۔ پس یہ ایک حکم پر دوسرا حکم لگانا ہے، ایک ایسی شریعت کے ساتھ جس کی اللہ نے اجازت نہیں دی۔\n\nاور یہی چیز مہدی کو اللہ کے دین میں قیاس سے بات کرنے سے روکتی ہے، خاص طور پر جب وہ یہ جانتے ہیں کہ نبی صلی اللہ علیہ وسلم کا مقصد اس امت پر تکلیف میں تخفیف کرنا تھا، اسی لیے آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے:\n**اتركوني ما تركتكم**\n(مجھے چھوڑ دو جب تک میں تمہیں چھوڑے رکھوں)۔\nاور آپ صلی اللہ علیہ وسلم دین میں سوال کرنے کو ناپسند فرماتے تھے، حکم میں اضافے کے خوف سے۔\n\nپس ہر وہ چیز جس پر آپ صلی اللہ علیہ وسلم خاموش رہے اور اس میں کوئی متعین حکم ظاہر نہ ہوا، تو وہ اس معاملے کا انجام اصل حکم کے ساتھ فیصلہ کرنا قرار دیتے ہیں۔ اور ہر وہ چیز جس پر اللہ انہیں کشف (الکشف) اور تعریف (التعریف) کے ذریعے مطلع کرتا ہے، تو وہ اس مسئلے میں شرع محمدی کا حکم ہے۔ اور بعض اوقات اللہ انہیں مباح پر مطلع کرتا ہے کہ وہ مباح ہے اور اس کا انجام۔\n\nپس ہر وہ مصلحت جو ان کی رعایا کے حق میں ہو، اللہ انہیں اس پر مطلع کرتا ہے تاکہ وہ اس کے بارے میں اللہ سے سوال کریں۔ اور ہر وہ فساد جو اللہ ان کی رعایا پر واقع کرنا چاہتا ہے، اللہ انہیں اس پر مطلع کرتا ہے تاکہ وہ اللہ سے اس کے رفع کرنے کا سوال کریں، کیونکہ یہ ایک سزا ہے، جیسا کہ فرمایا:\n**ظَهَرَ الْفَسادُ في الْبَرِّ والْبَحْرِ بِما كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ**\n(خشکی اور تری میں فساد پھیل گیا ہے، لوگوں کے ہاتھوں کی کمائی کی وجہ سے، تاکہ وہ انہیں ان کے بعض اعمال کا مزہ چکھائے، شاید وہ باز آ جائیں)۔\n\nپس مہدی رحمت ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم رحمت تھے۔ اللہ عزوجل نے فرمایا:\n**وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ**\n(اور ہم نے آپ کو نہیں بھیجا مگر تمام جہانوں کے لیے رحمت بنا کر)۔\nاور مہدی آپ صلی اللہ علیہ وسلم کے نقش قدم پر چلتے ہیں، وہ خطا نہیں کرتے، لہٰذا ان کا رحمت ہونا ضروری ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے جب زخمی ہوئے تو فرمایا:\n**اللهم اهد قومي فإنهم لا يعلمون**\n(اے اللہ! میری قوم کو ہدایت دے، کیونکہ وہ نہیں جانتے)۔\nآپ صلی اللہ علیہ وسلم ان کی طرف سے اپنے رب کے سامنے عذر پیش کر رہے تھے۔\n\nاور جب آپ صلی اللہ علیہ وسلم نے جانا کہ آپ بشر ہیں اور بشریت کے احکام بعض اوقات آپ پر غالب آ سکتے ہیں، تو آپ نے اپنے رب سے دعا کی اور فرمایا:\n**اللهم إنك تعلم أني بشر أرضى كما يرضى البشر وأغضب كما يغضب البشر**\n(اے اللہ! تو جانتا ہے کہ میں بشر ہوں، میں راضی ہوتا ہوں جیسے بشر راضی ہوتے ہیں اور غضبناک ہوتا ہوں جیسے بشر غضبناک ہوتے ہیں)۔ یعنی میں ان پر غضبناک ہوتا ہوں اور اپنے نفس کے لیے راضی ہوتا ہوں۔\n**اللهم من دعوت عليه فاجعل دعائي عليه رحمة له ورضوانا**\n(اے اللہ! جس پر میں نے بددعا کی ہو، تو میری اس بددعا کو اس کے لیے رحمت اور رضوان بنا دے)۔\n\nیہ نو امور ہیں جو قیامت تک دین کے کسی بھی امام، اللہ اور اس کے رسول کے خلفاء میں سے، مجموعی طور پر صرف اس امام مہدی کے لیے صحیح ثابت ہوئے ہیں۔ جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے بعد دین کے کسی امام کے بارے میں نص نہیں فرمائی جو ان کا وارث ہو اور ان کے نقش قدم پر چلے اور خطا نہ کرے، سوائے خاص مہدی کے۔ پس آپ صلی اللہ علیہ وسلم نے ان کے احکام میں ان کی عصمت کی گواہی دی، جیسا کہ عقلی دلیل نے رسول اللہ صلی اللہ علیہ وسلم کی عصمت کی گواہی دی اس حکم مشروع میں جو وہ اپنے رب کی طرف سے اپنے بندوں میں پہنچاتے ہیں۔\n\nاور علوم کے اس مقام میں احدیت (الأحدیۃ) میں اشتراک کا علم ہے، جو کہ عام اشتراک ہے، جیسے اس کا قول:\n**ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً**\n(اور اپنے رب کی عبادت میں کسی کو شریک نہ کرے)۔\nاور اللہ تعالیٰ نے فرمایا:\n**قُلْ هُوَ الله أَحَدٌ**\n(کہہ دو وہ اللہ ایک ہے)۔\nپس اس نے اپنی ذات کو احدیت کے ساتھ متصف کیا، اور یہ سورت حق تعالیٰ کی نسبت ہے اور ہر ایک سے صرف اسی کے لیے عبادت کو خاص کرتی ہے۔\n\nاور اس میں الٰہی انزال (نزول) کا علم ہے۔\n\nاور اس میں اس معنی کا علم ہے جس نے کتابت کو کلام بنا دیا، اور کلام کی حقیقت عقلمندوں کے نزدیک معلوم ہے، اور کلام ایک ایسا مسئلہ ہے جس میں نظریہ سازوں کے درمیان اختلاف ہے۔\n\nاور اس میں کلام مستقیم (سیدھے کلام) اور کلام معوج (ٹیڑھے کلام) کا علم ہے، اور کلام کی استقامت کو اس کے ٹیڑھے پن سے کس چیز سے پہچانا جاتا ہے۔\n\nاور اس میں اس علم کا علم ہے جو رسولوں نے عموماً اور خصوصاً لایا۔\n\nاور اس میں اس علم کا علم ہے کہ جو شخص بغیر علم کے کلام کرتا ہے، کیا وہ نفس الامر میں علم ہے یا اس کے نزدیک علم نہیں ہے جو یہ دیکھتا ہے کہ وہ علم نہیں ہے، باوجود اس کے کہ وہ جانتا ہے کہ اللہ کے سوا کوئی ناطق نہیں ہے۔\n\nاور اس میں صدق اور کذب کی معرفت کا علم ہے، اور وہ دونوں کس چیز کی طرف لوٹتے ہیں، اور صادق اور کاذب کا علم ہے۔\n\nاور اس میں وہ علم ہے کہ جب انسان اسے جان لیتا ہے تو اس کے نفس سے حرج (تنگی) دور ہو جاتا ہے، جب وہ ان عارضی امور کو دیکھتا ہے جو نفوس میں عادت کے مطابق جاری ہوتے ہیں کہ وہ ان میں حرج پیدا کریں، یہاں تک کہ انسان یہ تمنا کرتا ہے کہ جو کچھ وہ دیکھ رہا ہے اس کی وجہ سے خود کو قتل کر دے۔ اور اسے علم الراحۃ (آرام کا علم) کہا جاتا ہے، اور یہ خاص طور پر اہل جنت کا علم ہے۔ پس جسے اللہ نے دنیا میں اہل دنیا میں سے کسی پر اس کے ذریعے کھول دیا، تو اس کے لیے ابدی راحت کو جلد کر دیا گیا، اس کے ساتھ کہ وہ شخص جو اس صفت کا حامل ہے، اپنی مرتبت کے مطابق امر بالمعروف اور نہی عن المنکر میں ادب کو لازم پکڑے۔\n\nاور اس میں اس علم کا علم ہے جو اللہ نے اجسام پر آنکھوں کے لیے ظاہر کیا ہے کہ وہ اجسام کی زینت ہے، اور جس کے نزدیک بعض ظاہر ہونے والی چیزیں قبیح ہیں، تو وہ اس کے نزدیک کیوں قبیح ہیں؟ اور جس نے اسے سب کو حسین دیکھا، تو اس نے اسے کیوں دیکھا اور کس آنکھ سے دیکھا؟ پس وہ اپنی ذات سے اس کا مقابلہ اچھے افعال سے کرتا ہے۔ اور یہ علم دنیا کے بہترین اور سب سے زیادہ نفع بخش علوم میں سے ہے، اور یہی وہ علم ہے جس کے بارے میں بعض متکلمین کہتے ہیں کہ اللہ کے سوا کوئی فاعل نہیں اور اس کے تمام افعال حسین ہیں۔ پس یہ لوگ اللہ کے افعال میں سے صرف اسی کو قبیح قرار دیتے ہیں جسے اللہ نے قبیح قرار دیا ہے، پس یہ اللہ کے لیے ہے نہ کہ ان کے لیے۔ اور اگر وہ اس چیز کو قبیح نہ قرار دیتے جسے اللہ نے قبیح قرار دیا ہے، تو وہ اللہ عزوجل سے جھگڑنے والے ہوتے۔\n\nاور اس میں اس علم کا علم ہے جسے اللہ نے عالم میں تعجب کے طور پر رکھا ہے، اور وہ صرف وہی ہے جس سے عادت ٹوٹتی ہے۔ اور جو لوگ اللہ کی طرف سے عقل رکھتے ہیں، ان کے نزدیک عادت میں ہر چیز میں تعجب ہے۔ اور اصحاب عوائد (عادت کے پابند) کے نزدیک تعجب صرف اسی میں ہوتا ہے جس میں عادت کا ٹوٹنا ظاہر ہو۔\n\nاور اس میں امور عالیہ (بلند امور) کی طرف شوق کا علم ہے جو نفوس کی جبلت میں ہے، اور امور عالیہ کو کس چیز سے جانا جاتا ہے؟ کیا عقل سے یا شرع سے؟ اور امور عالیہ کیا ہیں؟ اور کیا وہ ایسا امر ہے جو عقلمندوں کو عام ہے یا وہ ہے جسے زید امور عالیہ میں سے دیکھتا ہے اور عمرو اسے اس صفت کے ساتھ نہیں دیکھتا، پس وہ اضافی ہو؟\n\nاور اس میں اطول (لمبے) کا اقصر (چھوٹے) میں داخل ہونے کا علم ہے، اور وہ بڑے کا چھوٹے پر وارد ہونا ہے۔\n\nاور اس میں خلق میں حق کے احکام کا علم ہے جب وہ ظاہر ہو اور جب وہ باطن ہو، اور کس حقیقت سے ظہور اور بطون (پوشیدگی) کے ساتھ متصف ہونا قبول کیا جاتا ہے۔\n\nاور اس میں اس حیرت کا علم ہے جس میں داخل ہونے والے کے لیے اس سے نکلنا ممکن نہیں ہوتا۔\n\nاور اس میں اس شخص کا علم ہے جو کسی چیز کو اس کے نفس الامر کے خلاف دیکھتا ہے، اور کیا اس علم والے کے لیے دونوں امور کو جمع کرنا صحیح ہے یا نہیں؟\n\nاور اس میں برزخوں کی وسعت اور تنگی کا علم ہے۔\n\nاور اس میں اعتدال اور انحراف کا اثر اس چیز میں کیا ہے جس سے وہ منحرف ہوتا ہے یا جس کا وہ مقابلہ کرتا ہے۔\n\nاور اس میں عالم میں احوال کا علم ہے، اور کیا ان کا غیر عالم میں کوئی اثر ہے یا ان کا اس میں کوئی اثر نہیں ہے۔\n\nاور اس میں اس علم کا علم ہے جو انسان کامل کے نزدیک عظیم ہوتا ہے، اور اس سے بڑھ کر کوئی چیز عظیم نہیں ہوتی، اور وہ چیز جو اس کے نزدیک عظیم ہوتی ہے وہ کس چیز کی طرف لوٹتی ہے، یہاں تک کہ وہ اس میں ایک ایسی حالت پیدا کرتی ہے جو اس کے مقام کا تقاضا نہیں کرتی جس میں وہ ہے، اور کیا اسے وہ علم مشاہدہ سے حاصل ہوا ہے یا فکر سے؟\n\nاور اس میں اس علم کا علم ہے کہ کیا مطلق وکالت دیے گئے وکیل کے لیے یہ صحیح ہے کہ وہ اپنے موکل کے مال میں مالک مال کی طرح ہر لحاظ سے تصرف کرے یا اس کی کوئی حد ہے جہاں وہ شرعی حکم میں رک جائے؟\n\nاور اس میں اولیاء کے اپنے مقام پر پردہ ڈالنے کی حکمت کا علم ہے، بخلاف انبیاء علیہم الصلوات اللہ کے۔\n\nاور اس میں تعلیم میں سیاست کا علم ہے، یہاں تک کہ معلم علم کو متعلم تک اس طرح پہنچاتا ہے کہ متعلم کو یہ احساس نہیں ہوتا کہ معلم نے اسے وہ علم دینے کا ارادہ کیا ہے جو اس کے پاس حاصل ہوا ہے۔ پس متعلم اسے کہتا ہے: \"اے استاد! مجھے آپ کے اس فعل سے فلاں فلاں علم حاصل ہوا ہے، جو کہ وافر اور صحیح ہے، اور وہ یہ ہے۔\" اور متعلم یہ خیال کرتا ہے کہ جو علم اسے اس امر سے حاصل ہوا ہے وہ معلم کا مقصود نہیں تھا، حالانکہ وہ نفس الامر میں معلم کا مقصود ہوتا ہے۔ پس متعلم اس نباہت اور سمجھداری پر خوش ہوتا ہے جو اللہ نے اسے عطا کی ہے، جہاں اس نے اپنے استاد کی حرکت سے وہ علم جان لیا جو اس کے گمان میں اس کے استاد کا اسے سکھانے کا ارادہ نہیں تھا۔\n\nاور اس میں کشف (الکشف) کے علوم میں سے ایک علم ہے، اور وہ یہ ہے کہ صاحب کشف یہ جانتا ہے کہ کوئی بھی فرد یا جماعت، کم ہو یا زیادہ، ان کے ساتھ رجال الغیب (غیب کے لوگ) میں سے ایک ضرور ہوتا ہے جب وہ گفتگو کر رہے ہوتے ہیں۔ پس وہ ایک شخص ان کی خبریں دنیا میں منتقل کرتا ہے، اور لوگ دنیا میں اپنے نفوس سے یہ پاتے ہیں۔ ایک جماعت خلوت میں جمع ہوتی ہے یا ایک شخص اپنے نفس سے کوئی بات کرتا ہے جسے اللہ کے سوا کوئی نہیں جانتا، پھر وہ شخص یا وہ جماعت باہر نکلتی ہے تو وہ اسے لوگوں میں سنتے ہیں اور لوگ اس کے بارے میں بات کر رہے ہوتے ہیں۔\n\nمیں نے تونس کے جامع کے مشرقی جانب ابن مثنیٰ کے مقصورہ میں ایک معلوم دن، عصر کی نماز کے وقت، جس کی تاریخ میرے پاس تونس شہر میں متعین ہے، کچھ اشعار کہے تھے۔ پھر میں اشبیلیہ آیا، اور ان دونوں کے درمیان قافلے کے لیے تین ماہ کا سفر ہے۔ پس ایک شخص مجھ سے ملا جو مجھے نہیں جانتا تھا، اور اس نے اتفاقاً مجھے وہی اشعار سنائے، حالانکہ میں نے وہ کسی کے لیے نہیں لکھے تھے۔ میں نے اس سے پوچھا: \"یہ اشعار کس کے ہیں؟\" تو اس نے مجھے کہا: \"محمد بن العربی کے۔\" اور میرا نام لیا۔ میں نے اس سے پوچھا: \"اور تم نے انہیں کب یاد کیا؟\" تو اس نے مجھے وہ تاریخ بتائی جس میں میں نے انہیں کہا تھا اور وقت بھی، اس طویل مسافت کے باوجود۔ میں نے اس سے پوچھا: \"اور تمہیں کس نے سنایا تھا کہ تم نے انہیں یاد کر لیا؟\" تو اس نے مجھے بتایا: \"میں ایک رات اشبیلیہ کے مشرق میں راستے پر ایک جماعت کی مجلس میں بیٹھا تھا، اور ہمارے پاس سے ایک اجنبی شخص گزرا جسے ہم نہیں جانتے تھے، گویا وہ سیاحوں میں سے تھا۔ وہ ہمارے پاس بیٹھ گیا اور ہم سے گفتگو کی، پھر اس نے ہمیں یہ اشعار سنائے۔ ہم نے انہیں بہت پسند کیا اور لکھ لیا۔ ہم نے اس سے پوچھا: 'یہ اشعار کس کے ہیں؟' تو اس نے کہا: 'فلاں کے۔' اور میرا نام لیا۔ ہم نے اس سے کہا: 'یہ ابن مثنیٰ کا مقصورہ تو ہم اپنے ملک میں نہیں جانتے۔' تو اس نے کہا: 'وہ تونس کے جامع کے مشرق میں ہے، اور اس نے وہیں اسی وقت کہے ہیں، اور میں نے اسے اس سے یاد کیا ہے۔' پھر وہ ہم سے غائب ہو گیا، اور ہمیں نہیں معلوم کہ اس کا کیا معاملہ تھا اور وہ کیسے ہم سے چلا گیا، اور ہم نے اسے نہیں دیکھا۔\"\n\nاور میں ایک دن اشبیلیہ کی جامع العدیس میں عصر کی نماز کے بعد تھا، اور ایک شخص مجھے ایک بڑے صوفی بزرگ کے بارے میں بتا رہا تھا جو خراسان میں اس سے ملے تھے، اور وہ مجھے ان کی فضیلت بتا رہا تھا۔ اچانک میں نے اپنے قریب ایک شخص کو دیکھا، اور میرے ساتھ والی جماعت اسے نہیں دیکھ رہی تھی۔ اس نے مجھ سے کہا: \"میں ہی وہ شخص ہوں جس کی تعریف یہ شخص کر رہا ہے جو خراسان میں ہم سے ملا تھا۔\" میں نے خبر دینے والے شخص سے پوچھا: \"کیا تم اس شخص کی صفت جانتے ہو جسے تم نے خراسان میں دیکھا تھا؟\" اس نے کہا: \"ہاں۔\" پس میں نے اس کی کچھ نشانیاں اور اس کی خلقت کی حلیہ بیان کرنا شروع کی جو اس میں تھیں۔ تو اس شخص نے کہا: \"اللہ کی قسم! وہ اسی صورت پر ہے جو آپ نے بیان کی ہے۔ کیا آپ نے اسے دیکھا ہے؟\" میں نے اس سے کہا: \"وہ یہ بیٹھا ہے، تمہاری اس بات کی تصدیق کر رہا ہے جو تم اس کے بارے میں بتا رہے ہو۔ اور میں نے تمہیں اس کی صفت بیان نہیں کی مگر اس حال میں کہ میں اسے دیکھ رہا ہوں، اور اس نے خود مجھے اپنا تعارف کرایا ہے۔\" اور وہ میرے ساتھ بیٹھا رہا یہاں تک کہ میں چلا گیا، تو میں نے اسے تلاش کیا مگر وہ نہیں ملا۔\n\nاور جو اشعار اس نے مجھے سنائے تھے وہ یہ ہیں:\n\n> مقصورہ ابن مثنیٰ *** میں نے اس میں شام کی، معنیٰ میں ڈوبا ہوا\n>\n> ایک تونسی ہرن کے ساتھ *** جو میٹھی ہے اس کے لیے جو تمنا کرتا ہے\n>\n> میں نے اس میں اپنی شرم و حیا اتار دی *** پس جسم نڈھال ہو گیا\n>\n> میں نے اس سے وصل کا سوال کیا جب *** میں نے اسے ناز کرتے دیکھا\n>\n> اور اس نے تعجب سے اپنے پہلو ہلائے *** جیسے شاخ جب لچکتی ہے\n>\n> اور کہا: تم اجنبی ہو *** اے یہ شخص! ہم سے دور رہو\n>\n> پس میں شوق اور مایوسی سے پگھل گیا *** اور عشق اور غم سے مر گیا\n\nاور یہ لڑکا احمد بن الادریسی کہلاتا تھا، جو شہر کے تاجروں میں سے تھا، اس کا باپ بھی تاجر تھا، اور وہ ایک نیک نوجوان تھا جو صالحین سے محبت کرتا تھا اور ان کی مجلس میں بیٹھتا تھا۔ اللہ نے اسے توفیق دی۔ اور یہ مجلس میرے اور اس کے درمیان سنہ پانچ سو نوے (۵۹۰ھ) میں ہوئی تھی، اور ہم اب سنہ چھ سو پینتیس (۶۳۵ھ) میں ہیں۔\n\nاور اس میں اس علم کا علم ہے کہ جدال (بحث و مباحثہ) میں کیا قابل تعریف ہے اور کیا قابل مذمت ہے۔ اور اللہ سے نسبت رکھنے والے کسی بھی مسلمان کے لیے یہ مناسب نہیں کہ وہ صرف اسی چیز میں جدال کرے جس میں وہ کشف (الکشف) کی بنا پر حق پر ہو، نہ کہ فکر اور نظر کی بنا پر۔ پس جب اس کے لیے وہ چیز مشہود ہو جس کے بارے میں وہ جدال کر رہا ہے، تب اس پر اس میں **بِالَّتِي هِيَ أَحْسَنُ** (جو بہترین ہو) کے ساتھ جدال کرنا متعین ہو جاتا ہے، اگر اسے الٰہی حکم سے مامور کیا گیا ہو۔ اور اگر وہ مامور نہ ہو تو اسے اختیار ہے۔ اگر اس سے غیر کا نفع متعین ہو تو یہ مستحب ہے، اور اگر وہ سننے والوں کے قبول کرنے سے مایوس ہو جائے تو اسے خاموش رہنا چاہیے اور جدال نہیں کرنا چاہیے، کیونکہ اگر اس نے جدال کیا تو وہ اللہ کے نزدیک سننے والوں کی ہلاکت میں کوشش کرنے والا ہے۔\n\nاور اس میں انسان کے اس قول کا علم ہے کہ \"میں مؤمن ہوں، ان شاء اللہ\"، باوجود اس کے کہ وہ اس وقت اپنے نفس میں جانتا ہے کہ وہ مؤمن ہے۔ اور یہ ایک عظیم فائدے کا مسئلہ ہے اس شخص کے لیے جو اس پر غور کرے، یہ اسے اللہ کے ساتھ ادب سکھاتا ہے، بشرطیکہ کہنے والا اس مقام سے تجاوز نہ کرے جہاں اللہ نے اسے رکھا ہے۔ پس اگر وہ تجاوز کرے اور اس پر نہ رکے تو وہ اللہ کے ساتھ بدتمیزی کرتا ہے اور اس کی طلب کامیاب نہیں ہوتی۔\n\nاور اس میں اس چیز کا علم ہے جو تمہیں اس امر کی یاد دلاتی ہے جسے تم نے جان لیا تھا پھر بھول گئے تھے۔\n\nاور اس میں زمان (وقت) میں زیادتی اور کمی کا علم ہے، کہ وہ کس چیز کی طرف لوٹتی ہے، اور نبی صلی اللہ علیہ وسلم کا عائشہ رضی اللہ عنہا سے ان کی بیویوں سے ایلاء (قسم) کے بارے میں یہ قول کہ:\n**قد يكون الشهر تسعا وعشرين**\n(مہینہ انتیس کا بھی ہو سکتا ہے)۔\n\nاور شرعی حکم میں اس سے کس چیز کو لینا چاہیے؟ کیا اس سے جو مہینے کے نام پر کم سے کم اطلاق ہوتا ہے یا زیادہ سے؟\n\nاور اس میں اللہ والوں کی صحبت کو اللہ سے غافل لوگوں کی صحبت پر ترجیح دینے کا علم ہے، اگرچہ ان میں ایمان شامل ہو۔\n\nاور اس میں اس علم کا علم ہے کہ اللہ کے جلال کے ساتھ کیسا معاملہ کرنا چاہیے، خواہ عالم راضی ہو یا ناراض۔\n\nاور اس میں پانیوں کا علم ہے، اور یہ ایک عجیب علم ہے۔ اور اس میں سیراب ہونے والے کے لیے پانی سے سیرابی کی حد کیا ہے جو سیراب کرتا ہے؟ کیونکہ بعض پانی سیراب کرتے ہیں اور بعض سیراب نہیں کرتے۔ اور وہ پانی کیا ہے جس سے اللہ نے ہر چیز کو زندہ بنایا ہے؟ کیا وہ ہر پانی ہے یا اس میں پانیوں کے درمیان کوئی خاص صفت ہے؟ اور اس پانی کی صفت کیا ہے جس سے اللہ نے بنی آدم کو حقارت کے ساتھ پیدا کیا، پس فرمایا:\n**خَلَقْنَا الْإِنْسانَ مِنْ ماءٍ مَهِينٍ**\n(ہم نے انسان کو حقیر پانی سے پیدا کیا)۔\n\nاور اس میں اس شخص کی علامت کا علم ہے جسے اللہ نے دنیا کی زندگی میں سعادت مند بنایا اور جسے بدبخت بنایا۔\n\nاور اس میں اس علم کا علم ہے کہ دنیا بذات خود کیا ہے، اور اس کی زندگی کیا ہے، اور اس کی زینت کیا ہے۔\n\nاور اس میں اس علم کا علم ہے کہ کیا باقی رہتا ہے اور کیا فنا ہوتا ہے، اور عالم میں سے کیا فنا کو قبول کرتا ہے اور کیا بقا (البقاء) کو قبول کرتا ہے۔\n\nاور اس میں اس چیز کے احاطہ کی صورت کا علم ہے جو لامتناہی ہے، اور لامتناہی کو اس سے متصف نہیں کیا جاتا کہ وہ محاط (گھیرا ہوا) ہے، کیونکہ اس کا وجود میں داخل ہونا محال ہے۔\n\nاور اس میں جنات کے احوال کا علم ہے، اور ان پر اللہ کی طرف سے نازل کردہ شرائع کا مکلف کرنا، کیا یہ ایسا مکلف کرنا ہے جسے حق نے انہیں ابتداءً لازم کیا یا انہوں نے خود کو لازم کیا تو حق نے اسے ان پر لازم کر دیا، جیسے نذر؟\n\nاور اس میں فعل اور مفعول کے درمیان فرق کا علم ہے۔\n\nاور اس میں اس شخص کا علم ہے جو فعل میں مدد قبول کرتا ہے۔\n\nاور اس میں فرقوں اور ملتوں کا علم ہے۔\n\nاور اس میں استحقاق کا علم ہے۔\n\nاور اس میں اس علم کا علم ہے جس کا جاننا نفع نہیں دیتا۔\n\nاور اس میں علم غریب کا علم ہے کہ نفوس اسے کس چیز سے قبول کرتی ہیں اور دوسروں کے مقابلے میں اس کی طرف زیادہ متوجہ ہوتی ہیں۔\n\nاور اس میں اس علم کا علم ہے کہ کیا علم سے اعراض کرنا صحیح ہے، باوجود اس کے کہ وہ اعراض کرنے والے کے نزدیک علم باقی رہے، یا اس کے نزدیک اس میں کوئی شبہ پیدا ہو جاتا ہے، پس وہ اس سے اعراض نہیں کرتا یہاں تک کہ اس سے یہ بات زائل ہو جائے کہ وہ علم ہے۔ اور یہ محققین عارفین کے نزدیک پوشیدہ ترین علوم میں سے ہے۔\n\nاور اس میں ان حجابات کا علم ہے جو بصیرت کی آنکھ اور اس چیز کے درمیان حائل ہوتے ہیں جسے اسے ادراک کرنا چاہیے تھا اگر یہ حجابات نہ ہوتے۔\n\nاور اس میں حلم (بردباری) کا علم ہے اور اس میں اور عفو (معافی) کے درمیان فرق کا علم ہے، اور کیا غفور (بخشنے والا) اور رحیم (رحم کرنے والا) کا علم حلیم اور عفو کے درمیان ایک برزخ ہے اور ان دونوں کا اس میں کوئی حکم ہے یا نہیں؟\n\nاور اس میں اس علم کا علم ہے کہ امور اللہ کے نزدیک اپنی مقداروں سے تجاوز نہیں کرتے۔\n\nاور اس میں اس چیز کا علم ہے جس نے اکابر کو اپنے افعال میں الٰہی استثناء سے غافل کر دیا، جیسے سلیمان اور موسیٰ علیہما السلام اور دیگر کا قصہ۔\n\nاور اس میں اس چیز کو واپس کرنے کا علم ہے جو اس شخص کے لیے مناسب ہے جس کے لیے وہ مناسب ہے، اور یہ بہترین علوم میں سے ہے کیونکہ یہ راحت کا وارث بناتا ہے اور اس پر اعتراض سے محفوظ رکھتا ہے۔ واللہ اعلم۔\n\nاور اس میں اس علم کا علم ہے جسے وہ اپنے نفس سے تعریف کرتا ہے اور دوسروں سے انکار کرتا ہے اور مذمت کرتا ہے۔\n\nاور اس میں دو جہانوں کے درمیان کھڑے ہونے کا علم ہے، اس میں کھڑے ہونے والے کا کیا حال ہوتا ہے۔\n\nاور اس میں اس علم کا علم ہے کہ حق نے کوئی چیز پیدا نہیں کی مگر کسی سبب سے، پس جس نے اسباب کو ختم کیا اس نے جہالت کی۔ پس جو یہ گمان کرتا ہے کہ اس نے انہیں ختم کیا، تو اس نے انہیں صرف ان کے ذریعے ہی ختم کیا، کیونکہ اس چیز کو ختم کرنا صحیح نہیں جسے اللہ نے برقرار رکھا ہے اور جو وجود کی حالت عطا کرتا ہے۔ اور اسباب معتادہ (عادی اسباب) جنہیں ختم کرنا جائز ہے اور اسباب معقولہ (عقلی اسباب) جنہیں ختم کرنا ممکن نہیں، ان کے درمیان کیا فرق ہے؟\n\nاور اس میں اس شخص کا علم ہے جس نے اللہ کے بندوں پر احتیاط کی، اس کا اللہ کے نزدیک کیا مقام ہے۔\n\nاور اس میں شبہات کو دلائل بنانے کا علم ہے، کس چیز نے انہیں اس بات سے اندھا کر دیا کہ وہ شبہات ہیں۔\n\nاور اس میں ان بندوں کا علم ہے جنہیں اللہ قیامت کے دن نظر انداز کرے گا اور جنہیں نظر انداز نہیں کرے گا۔\n\nاور اس میں خواص کا علم ہے۔\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ**\n(اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "**باب سیصد و شصت و ششم: در معرفت منزلت وزیران مهدی که در آخرالزمان ظهور می‌کند و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به او بشارت داده است و او از اهل بیت است.**\n\n> امام به وزیر نیازمند است،\n> و فلک هستی (فلك الوجود) بر مدار آن دو می‌گردد.\n> و اگر احوال مُلک (حکومت) با وجود این دو استوار نشود،\n> به زودی تباه خواهد شد.\n> مگر خدای حق (الإله الحق) که منزه است،\n> و در آنچه اراده می‌کند، وزیری ندارد.\n> خدای حق در ملکوت خود جلیل‌تر از آن است\n> که خلق او را در حالی که نیازمند است، ببینند.\n\n**[اینکه خداوند خلیفه‌ای دارد که خروج می‌کند در حالی که زمین پر از جور و ظلم شده است]**\n\nبدان -خداوند ما را تأیید کند- که خداوند خلیفه‌ای دارد که خروج می‌کند در حالی که زمین پر از جور و ظلم شده است، پس آن را پر از قسط و عدل می‌سازد. اگر از دنیا جز یک روز باقی نمانده باشد، خداوند آن روز را طولانی می‌کند تا این خلیفه از عترت رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از فرزندان فاطمه (س) به حکومت رسد. نام او با نام رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) موافق است و جدش حسین بن علی بن ابی طالب است. بین رکن و مقام با او بیعت می‌شود. او در خَلق (صورت ظاهری) شبیه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است، اما در خُلق (اخلاق) پایین‌تر از اوست؛ زیرا هیچ کس در اخلاق مانند رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نخواهد بود، و خداوند درباره او می‌فرماید: **«و همانا تو بر اخلاق بزرگی هستی» (وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ)**. او پیشانی گشاده و بینی کشیده دارد. خوشبخت‌ترین مردم به او اهل کوفه هستند. مال را به تساوی تقسیم می‌کند و در میان رعیت به عدالت رفتار می‌کند و در قضاوت‌ها فصل (جدایی حق از باطل) می‌نماید. مردی نزد او می‌آید و می‌گوید: ای مهدی، به من عطا کن. در حالی که مال در برابر اوست، به اندازه‌ای که بتواند حمل کند، در جامه‌اش می‌ریزد.\n\nاو در دوره‌ای که دین دچار فترت شده است، خروج می‌کند. خداوند به وسیله او اموری را باز می‌دارد که با قرآن باز داشته نمی‌شوند. شب را در حالی به صبح می‌رساند که جاهل، بخیل و ترسو است و صبح را در حالی آغاز می‌کند که داناترین مردم، کریم‌ترین مردم و شجاع‌ترین مردم است. خداوند او را در یک شب اصلاح می‌کند. نصرت پیشاپیش او حرکت می‌کند. پنج یا هفت یا نُه سال زندگی می‌کند. او قدم جای قدم رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) می‌گذارد و هرگز خطا نمی‌کند. فرشته‌ای دارد که او را از جایی که نمی‌بیند، تأیید می‌کند. بار همه را به دوش می‌کشد و ضعیف را در حق تقویت می‌کند و مهمان را گرامی می‌دارد و در مصائب حق یاری می‌رساند. آنچه می‌گوید، انجام می‌دهد و آنچه می‌داند، می‌گوید و آنچه شهود (الشهود) می‌کند، می‌داند.\n\nاو شهر روم (قسطنطنیه) را با تکبیر در میان هفتاد هزار مسلمان از فرزندان اسحاق فتح می‌کند. در مرج عکا، در مأدبه (سفره) بزرگ الهی (الملحمة العظمى) حضور می‌یابد. ظلم و اهل آن را نابود می‌کند. دین را برپا می‌دارد. روح را در اسلام می‌دمد. اسلام به وسیله او پس از ذلت، عزت می‌یابد و پس از مرگ، زنده می‌شود. جزیه را برمی‌دارد و مردم را با شمشیر به سوی خدا دعوت می‌کند. پس هر کس سر باز زند، کشته می‌شود و هر کس با او نزاع کند، خوار می‌گردد.\n\nاو از دین، آنچه را که دین در ذات خود بر آن است، آشکار می‌سازد؛ آنچه اگر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) زنده بود، به آن حکم می‌کرد. مذاهب را از زمین برمی‌دارد و جز دین خالص باقی نمی‌ماند. دشمنان او مقلدان علما و اهل اجتهاد هستند، زیرا می‌بینند که او بر خلاف آنچه امامانشان بدان رفته‌اند، حکم می‌کند. پس از ترس شمشیر و سطوت او و به دلیل رغبت به آنچه نزد اوست، با اکراه تحت حکم او درمی‌آیند. عموم مسلمانان بیش از خواصشان به او شاد می‌شوند. عارفان بالله از اهل حقایق (أهل الحقائق) بر اساس شهود (الشهود) و کشف (الکشف) و با تعریفی الهی با او بیعت می‌کنند.\n\nاو مردانی الهی دارد که دعوت او را برپا می‌دارند و یاری‌اش می‌کنند. آنان وزیران او هستند که بارهای سنگین مملکت را بر دوش می‌کشند و او را در آنچه خداوند بر عهده‌اش نهاده است، یاری می‌دهند. عیسی بن مریم بر مناره سفید در شرق دمشق فرود می‌آید، در حالی که دو جامه زرد رنگ (مهرودتین) بر تن دارد و بر دو فرشته تکیه کرده است؛ فرشته‌ای در سمت راست و فرشته‌ای در سمت چپ. از سرش آب مانند مروارید می‌چکد، گویی از حمام بیرون آمده است. مردم در نماز عصر هستند. امام (مهدی) از جایگاه خود کنار می‌رود، پس عیسی پیش می‌رود و با مردم نماز می‌خواند. او مردم را بر سنت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) امامت می‌کند. صلیب را می‌شکند و خوک را می‌کشد.\n\nخداوند مهدی را در حالی که پاک و مطهر است، قبض روح می‌کند. در زمان او، سفیانی در نزدیکی درختی در غوطه دمشق کشته می‌شود و لشکرش در بیداء (بیابان بین مدینه و مکه) به زمین فرو می‌رود، به طوری که جز یک نفر از قبیله جهینه از آن لشکر باقی نمی‌ماند. این لشکر سه روز شهر رسول (صَلَّى اللهُ عَليهِ وسَلَّم) را مباح می‌شمارد، سپس حرکت می‌کند و مکه را می‌جوید. پس خداوند او را در بیداء به زمین فرو می‌برد. هر کس از آن لشکر مجبور و مکره بوده باشد، بر اساس نیتش محشور می‌شود. قرآن حاکم است و شمشیر نابودکننده. به همین دلیل:\n\nدر خبر آمده است که خداوند با سلطان (قدرت حاکم) اموری را باز می‌دارد که با قرآن باز داشته نمی‌شوند.\n\n> آگاه باشید که ختم اولیا (ختم الأولياء) شاهد است،\n> و چشم امام جهانیان (إمام العالمين) فقید (گم‌شده) است.\n> او سید مهدی از آل احمد است،\n> او شمشیر هندی است هنگامی که نابود می‌کند.\n> او خورشیدی است که هر غم و تاریکی را می‌زداید،\n> او باران بهاری است هنگامی که می‌بخشد.\n\nو زمان او به شما رسیده و دورانش بر شما سایه افکنده است. او در قرن چهارم که به سه قرن گذشته (قرن رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) که قرن صحابه است، سپس قرن بعد از آن، و سپس قرن بعد از دومی) ملحق می‌شود، ظاهر شده است. سپس بین آنها فترت‌هایی رخ داد و اموری حادث شد و هواها منتشر گشت و گرگ‌ها در شهرها فساد کردند و فساد زیاد شد تا اینکه جور فراگیر شد و سیلش طغیان کرد و روز عدل با ظلم به شب رسید. پس شهیدان او بهترین شهیدان و امینان او برترین امینان هستند.\n\nخداوند برای او گروهی را به وزارت برمی‌گزیند که آنان را در نهان غیب خود پنهان کرده است. آنان را از طریق کشف (الکشف) و شهود (الشهود) بر حقایق (الحقائق) و آنچه امر خداوند در میان بندگانش بر آن است، آگاه ساخته است. پس با مشورت آنان، آنچه را که باید فصل کند، فصل می‌کند. آنان همان عارفانی هستند که آنچه را که در آنجاست، شناخته‌اند.\n\nاما خود او، صاحب شمشیر حق و سیاست مدنی است. او از خداوند به اندازه‌ای که مرتبه و منزلتش نیاز دارد، معرفت (المعرفة) دارد؛ زیرا او خلیفه‌ای است که تأیید شده است. منطق حیوانات را می‌فهمد. عدالت او در میان انس و جن جاری می‌شود.\n\n**[وزیران مهدی (علیه السلام) از عجم‌ها هستند]**\n\nاز اسرار علم وزیران او که خداوند آنان را برایش به وزارت برگزیده است، این سخن خداوند متعال است: **«و یاری مؤمنان بر ما حق بود» (وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ)**. آنان بر قدم مردانی از صحابه هستند که **«به آنچه با خدا عهد بستند، صادق بودند» (صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ)**. آنان از عجم‌ها هستند و هیچ عربی در میانشان نیست، اما جز به عربی سخن نمی‌گویند.\n\nآنان حافظی دارند که از جنس خودشان نیست و هرگز خدا را نافرمانی نکرده است. او مخصوص‌ترین وزیران و برترین امینان است. خداوند در این آیه که آن را ورد شب و روز خود قرار داده‌اند، برترین علم صدق را از نظر حال و ذوق به آنان عطا کرده است. پس دانستند که صدق شمشیر خدا در زمین است. هیچ کس به آن قیام نکرد و به آن متصف نشد، مگر اینکه خداوند او را یاری کرد؛ زیرا صدق صفت او و صادق نام اوست.\n\nپس با چشمانی سالم از رمد (بیماری چشم) نگریستند و با قدم‌هایی ثابت در راه رشد سلوک کردند. ندیدند که حق، مؤمنی را از مؤمن دیگر قید کند، بلکه یاری مؤمنان را بر خود واجب ساخت و نگفت «به وسیله چه کسی»، بلکه آن را مطلق فرستاد و محقق ساخت. پس فرمود: **«ای کسانی که ایمان آورده‌اید، ایمان بیاورید» (يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا)** و فرمود: **«و برای مؤمن جایز نیست که مؤمنی را بکشد، مگر به خطا» (وَمَا كَانَ لِمُؤْمِنٍ أَنْ يَقْتُلَ مُؤْمِنًا إِلَّا خَطَأً)** و فرمود: **«و کسانی که به باطل ایمان آوردند» (وَالَّذِينَ آمَنُوا بِالْبَاطِلِ)**، پس آنان را مؤمن نامید و فرمود: **«و اگر به او شرک ورزیده شود، ایمان می‌آورید» (وَإِنْ يُشْرَكْ بِهِ تُؤْمِنُوا)**، پس مشرک را مؤمن نامید.\n\nاینان همان مؤمنانی هستند که خداوند در سخن خود: **«ای کسانی که ایمان آورده‌اید، به خدا و رسولش و کتابی که بر رسولش نازل کرده و کتابی که پیش از آن نازل کرده، ایمان بیاورید» (يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَى رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ)**، آنان را تأیید کرده است. پس آنان را از مؤمنان اهل کتاب و کتب متمایز ساخت. هیچ خبردهنده‌ای که خبری آورده باشد، جز رسولان، کامل نبوده است. پس مشخص می‌شود که مؤمنانی که به ایمان امر شده‌اند، همان کسانی هستند که **«به باطل ایمان آوردند» (الَّذِينَ آمَنُوا بِالْبَاطِلِ)** و به شریک ایمان آوردند، به دلیل شبهه‌ای که آنان را از دلیل منصرف ساخت. زیرا کسانی که به باطل ایمان آوردند، به خدا کفر ورزیدند و کسانی که به شریک ایمان آوردند، هنگامی که **«خداوند به تنهایی ذکر شود، دل‌هایشان منزجر می‌گردد» (إِذَا ذُكِرَ اللَّهُ وَحْدَهُ)**.\n\nاین خبر را جز امامان گمراه‌کننده آنان که پیش از ایشان بودند، به آنان نرساندند. و این در گمان آنان از روی برهان بود -منظورم امامان است- نه از روی قصور، بلکه حق نظر را ادا کردند. اما استعدادشان که خداوند به آنان داده بود، به آنان این را نداد. و خداوند هیچ نفسی را جز به اندازه‌ای که به او داده است، مکلف نکرده است. و آنچه به او داده است، غیر از آن چیزی نیست که با آن آمده است. پس پیروانشان به آن ایمان آوردند و در ایمان خود صادق بودند و جز راه نجات را قصد نکردند و آنچه آنان را به هلاکت می‌اندازد، قصد نکردند.\n\nهنگامی که دیدند خداوند ابتدا فعل می‌کند و با آلت فعل می‌کند، شریک را مانند وزیر قرار دادند که در ظهور برخی افعال حاصل در هستی (الوجود) یاری‌رسان است. پس هنگامی که خداوند به تنهایی ذکر شد، دیدند که این ذاکر حق امر را ادا نکرده است، زیرا می‌دانستند که توقف برخی افعال بر وجود برخی مخلوقات است. و شهود (الشهود) آنان جز افعال الهی حاصل در هستی (الوجود) از طریق اسباب مخلوق نبود. پس توحید افعال را نپذیرفتند، زیرا آن را شهود نکردند. و اگر آن را می‌پذیرفتند، حکمت خداوند را در آنچه از اسباب علوی و سفلی قرار داده است، باطل می‌کردند.\n\nاین همان چیزی است که آنان را به انزجار و عدم انصاف سوق داد. پس خداوند آنان را به دلیل ترجیح دادن مؤمنانی که فاعلی جز خدا ندیدند، مذمت کرد. و اینکه قدرت حادث و اموری که متوقف بر اسباب هستند، در فعل اثری ندارند. این گروه به تنهایی همان کسانی هستند که خداوند این خطاب را به آنان اختصاص داده است.\n\nاما کسانی که به خدا کفر ورزیدند، همان کسانی هستند که او را با حجاب شرک پوشاندند و به باطل ایمان آوردند. و باطل، عدم است. و آنان کسی را که تشبیه و شرک از او نفی شود، جز عدم ندیدند. زیرا هستی (الوجود) صفتی مشترک است. پس ایمانشان به باطل، ایمان تنزیه است و کفرشان -یعنی پوشاندنشان- نسبت هستی (الوجود) به خداست، به دلیل اشتراکی که در آن واقع شده است. به همین دلیل خداوند متعال فرمود: **«آنان همان زیانکارانند» (أُولَئِكَ هُمُ الْخَاسِرُونَ)**، زیرا در تجارت خود، وجود سودِ آشکار شدن تمام امر بر آنچه هست، را از دست دادند. پس **«گمراهی را به هدایت خریدند» (اشْتَرَوُا الضَّلَالَةَ بِالْهُدَى)**، یعنی حیرت را به بیان. پس حیرت را گرفتند و دانستند که امر عظیم است و بیان، مقید است و او مقید نمی‌شود. پس حیرت را بر بیان ترجیح دادند.\n\nاما صاحبان عقل سلیم و نظر صحیح و ایمان عام، همان کسانی هستند که حیرت را در مقام و موطن خود ثابت کردند.\n\nپس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «تحیر مرا در تو بیشتر کن».\n\nو بیان را در مقام خود ثابت کردند که معرفت آن امر جز با بیان ممکن نیست و حیرت را نمی‌پذیرد. پس حق هر صاحب حقی را به او دادند و حکمت را در جای خود قرار دادند. پس همه مؤمن هستند، زیرا خداوند آنان را مؤمن نامیده است، همانطور که آنان را کافر و مشرک نامیده است و آنان را در ایمانشان بر مراتبی قرار داده است. به همین دلیل فرمود: **«تا ایمانی بر ایمانشان بیفزایند» (لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ)** در آنچه بدان ایمان آوردند، همانطور که بر مرض و **«پلیدی بر پلیدیشان» (رِجْسًا إِلَى رِجْسِهِمْ)** در آنچه بدان کفر ورزیدند، افزود.\n\nپس از آنان صادق و اصدق وجود دارد. خداوند مؤمنی را که خللی در ایمانش وارد نشده است، بر کسی که خللی در ایمانش وارد شده است، یاری می‌کند. زیرا خداوند او را به اندازه خللی که در ایمانش وارد شده است، خوار می‌سازد؛ هر مؤمنی که باشد. پس مؤمن کامل الایمان همیشه یاری شده است. به همین دلیل هیچ پیامبری و هیچ ولی‌ای هرگز شکست نخورد.\n\nآیا نمی‌بینی که در روز حنین، هنگامی که صحابه (رضی الله عنهم) ادعای توحید خدا کردند، سپس کثرت خود را دیدند و کثرتشان آنان را به شگفتی انداخت، پس در آن هنگام خدا را فراموش کردند. پس کثرتشان هیچ سودی به حالشان نداشت، همانطور که خدایان آن گروه دیگر هیچ سودی به حالشان در برابر خدا نداشتند، با وجود اینکه صحابه بدون شک مؤمن بودند، اما خلل به دلیل اعتمادشان بر کثرت وارد شد و سخن خداوند را فراموش کردند: **«چه بسا گروه اندکی که بر گروه بسیاری به اذن خدا پیروز شدند» (كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ)**. پس خداوند در اینجا جز برای غلبه اذن نداد، پس آن را ایجاد کرد و گروه اندک به اذن خدا بر آنان پیروز شدند.\n\n> پس در آنجا جز خدا نیست و غیر او نیست،\n> و هر بینایی او را در هستی (الوجود) می‌بیند.\n\n**[تأثیر صدق در اشخاصی که آن جایگاه را ندارند، مشهود است]**\n\nاما تأثیر صدق، در اشخاصی مشهود است که آن جایگاه را از اسباب سعادتی که شرایع آورده‌اند، ندارند، اما قدمی راسخ در صدق دارند. پس با همت -که همان صدق است- می‌کشند. به ابویزید گفتند: اسم اعظم خدا را به ما نشان بده. گفت: اسم اصغر را به من نشان دهید تا اسم اعظم را به شما نشان دهم. همه نام‌های خدا عظیم هستند. پس آن جز صدق نیست. صادق باش و هر نامی را که می‌خواهی بگیر، زیرا با آن هر چه بخواهی انجام می‌دهی. و به وسیله آن بود که ابویزید مورچه را زنده کرد و ذوالنون پسر زنی را که تمساح او را بلعیده بود، زنده کرد.\n\nاگر فهمیدی، دری از درهای سعادتت برایت گشوده شده است. اگر بر آن عمل کنی، خداوند تو را سعادتمند می‌کند، هر جا که باشی و هرگز خطا نخواهی کرد. و از اینجا است که اگر غلبه برای کافران بر مسلمانان باشد، تو با خدا در آسایش خواهی بود. پس می‌دانی که ایمان آنان متزلزل شده و خلل در آن وارد شده است و ایمان کافران در آنچه به باطل ایمان آوردند و مشرکان متزلزل نشده و خللی در آن وارد نشده است. پس نصرت برادر صدق است، هر جا که باشد، از او پیروی می‌کند. و اگر غیر از این بود، مسلمانان هرگز شکست نمی‌خوردند، همانطور که هیچ پیامبری هرگز شکست نخورد.\n\nو تو غلبه و نصرت کفار را در یک زمان و غلبه و نصرت مسلمانان را در زمانی دیگر مشاهده می‌کنی. و صادق از هر دو گروه به طور کامل شکست نمی‌خورد، بلکه پیوسته ثابت می‌ماند تا کشته شود یا بدون شکست منصرف گردد. و وزیران مهدی بر این قدم هستند. و این همان چیزی است که آنان در نفوس یاران مهدی تثبیت می‌کنند. آیا نمی‌بینی که آنان با تکبیر، شهر روم را فتح می‌کنند؟ تکبیر اول را می‌گویند، یک سوم دیوارش فرو می‌ریزد. تکبیر دوم را می‌گویند، یک سوم دوم دیوار فرو می‌ریزد. تکبیر سوم را می‌گویند، یک سوم سوم فرو می‌ریزد. پس آن را بدون شمشیر فتح می‌کنند. این همان عین صدقی است که ذکر کردیم.\n\nآنان گروهی هستند -یعنی وزیران مهدی- که کمتر از ده نفرند. و هنگامی که امام مهدی این را بداند، به آن عمل می‌کند، پس صادق‌ترین اهل زمان خود خواهد بود. پس وزیران او هدایت‌کنندگان هستند و او مهدی است. این مقدار از علم بالله به دست وزیرانش به مهدی می‌رسد.\n\n**[ختم ولایت محمدیه]**\n\nاما ختم ولایت محمدیه (ختم الولایة المحمدیة)، او داناترین خلق به خداست. در زمان او و پس از زمان او، داناتری به خدا و مواضع حکمت او نخواهد بود. پس او و قرآن برادرند، همانطور که مهدی و شمشیر برادرند.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در مورد مدت اقامت او به عنوان خلیفه، از پنج تا نُه سال شک کرد، به دلیل شکی که در مورد وزیرانش رخ داد. زیرا برای هر وزیر با او یک سال است. اگر پنج نفر باشند، پنج سال زندگی می‌کند و اگر هفت نفر باشند، هفت سال و اگر نُه نفر باشند، نُه سال زندگی می‌کند. زیرا برای هر سال احوال مخصوصی وجود دارد و علم به آنچه در آن سال صلاح است، به وزیری از وزیرانش اختصاص داده شده است. پس آنان کمتر از پنج نفر و بیشتر از نُه نفر نیستند. زیرا شک رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در سخن خود: «پنج یا هفت یا نُه» در اقامت مهدی، به همین تعداد ختم شد.\n\nو تمام آنچه مورد نیاز است و قیام وزیرانش به آن است، نُه امر است که دهمی ندارد و از آن کمتر نمی‌شود. و آن عبارت است از: نفوذ بصر (بینش نافذ)، معرفت خطاب الهی هنگام القاء، علم ترجمه از خدا، تعیین مراتب برای والیان امر، رحمت در غضب، علم به آنچه مُلک (حکومت) از روزی‌های محسوس و معقول نیاز دارد، علم تداخل امور در یکدیگر، مبالغه و استقصاء در برآوردن حوائج مردم، و وقوف بر علم غیبی که به طور خاص در مدت حکومت او در هستی (الکون) مورد نیاز است.\n\nاین نُه امر است که باید در وزیر امام مهدی باشد، اگر وزیر یکی باشد، یا در وزیرانش اگر بیش از یکی باشند.\n\nاما نفوذ بصر (بینش نافذ)، برای این است که دعوت او به سوی خدا بر بصیرت باشد؛ نه در دعوت‌کننده، بلکه در دعوت‌شده. پس در چشم هر دعوت‌شده‌ای که او را دعوت می‌کند، می‌نگرد و می‌بیند که اجابت دعوت او برایش ممکن است، پس او را از آن طریق دعوت می‌کند، حتی به طریق اصرار. و کسی را که می‌بیند دعوت او را اجابت نمی‌کند، او را بدون اصرار دعوت می‌کند، فقط برای اقامه حجت بر او. زیرا مهدی حجت خدا بر اهل زمان خود است. و این درجه انبیا است که در آن مشارکت رخ می‌دهد. خداوند متعال فرمود: **«من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم» (أَدْعُوا إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي)**. او این را درباره پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داد. پس مهدی از کسانی است که از او پیروی می‌کند. و او (صَلَّى اللهُ عَليهِ وسَلَّم) در دعوت به سوی خدا خطا نمی‌کند، پس پیرو او نیز خطا نمی‌کند، زیرا او قدم جای قدم او می‌گذارد. و همچنین در وصف مهدی در خبر آمده است که فرمود (صَلَّى اللهُ عَليهِ وسَلَّم): «قدم جای قدم من می‌گذارد و خطا نمی‌کند».\n\nو این همان عصمت در دعوت به سوی خداست و بسیاری از اولیا، بلکه همه آنان، به آن دست می‌یابند.\n\nو از حکم نفوذ بصر این است که صاحب آن، ارواح نوری و ناری را بدون اراده ارواح و بدون ظهور و تصور، درک می‌کند.\n\nمانند ابن عباس و عایشه (رضی الله عنهما) هنگامی که جبرئیل (علیه السلام) را در حالی که با رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) سخن می‌گفت، درک کردند، بدون اینکه جبرئیل از آن آگاه باشد یا اراده ظهور برای آنان داشته باشد. پس آن را به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خبر دادند و نمی‌دانستند که او جبرئیل است. پس به او (عایشه) فرمود (صَلَّى اللهُ عَليهِ وسَلَّم): «آیا او را دیدی؟» و به ابن عباس فرمود: «آیا او را دیدی؟» گفتند: بله. فرمود: «او جبرئیل بود».\n\nو همچنین رجال الغیب را در حال اراده احتجابشان و عدم ظهورشان برای دیدگان، درک می‌کنند و صاحب این حال آنان را می‌بیند.\n\nو از نفوذ بصر نیز این است که هنگامی که معانی برای آنان تجسد می‌یابند، آنها را در عین صورتشان می‌شناسند و بدون توقف می‌دانند که آن معنایی که تجسد یافته، چیست.\n\n**«وصل» و اما معرفت خطاب الهی هنگام القاء**\n\nاین همان سخن خداوند متعال است: **«و برای هیچ بشری نیست که خداوند با او سخن بگوید، مگر به وحی یا از پشت حجاب یا رسولی بفرستد» (وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا)**.\n\nاما وحی از این موارد، آن چیزی است که خداوند به صورت حدیث در دل‌های آنان القاء می‌کند. پس از آن، علمی به امری برایشان حاصل می‌شود و آن همان چیزی است که آن حدیث در بر داشته است. و اگر چنین نباشد، وحی و خطاب نیست. زیرا برخی دل‌ها، صاحبانشان علمی را به امری از علوم ضروری نزد مردم می‌یابند. آن علم صحیح است و از خطاب نیست. و سخن ما فقط در خطاب الهی است که وحی نامیده می‌شود. زیرا خداوند متعال این نوع از وحی را کلام قرار داده است و از کلام، علم به آنچه آن کلام برای آن آمده است، استفاده می‌شود. و با این، اگر آن را یافت، فرق گذاشته می‌شود.\n\nاما سخن خداوند متعال: **«یا از پشت حجاب» (أَوْ مِنْ وَرَاءِ حِجَابٍ)**، آن خطاب الهی است که بر گوش القاء می‌شود، نه بر قلب. پس کسی که بر او القاء شده است، آن را درک می‌کند و از آن می‌فهمد که گوینده چه قصدی داشته است. و گاهی این در صور تجلی (التجلی) برای او حاصل می‌شود، پس آن صورت الهی با او سخن می‌گوید و آن عین حجاب است. پس از آن خطاب، علم به آنچه بر آن دلالت می‌کند، می‌فهمد و می‌داند که آن حجاب است و متکلم از پشت آن حجاب است. و هر کس که صورت تجلی الهی را درک کند، نمی‌داند که آن خداست. پس صاحب این حال بر غیر خود برتری نمی‌یابد، مگر به اینکه بداند آن صورت، اگرچه حجاب است، اما عین تجلی (التجلی) حق برای اوست.\n\nاما سخن خداوند متعال: **«یا رسولی بفرستد» (أَوْ يُرْسِلَ رَسُولًا)**، آن چیزی است که فرشته نازل می‌کند یا رسول بشری به سوی ما می‌آورد، به ویژه هنگامی که کلام خدا را نقل می‌کنند، مانند تلاوت‌کننده. خداوند متعال فرمود: **«پس او را پناه ده تا کلام خدا را بشنود» (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ)** و سخن او: **«و او را از جانب طور ایمن ندا دادیم و او را در نجوا نزدیک ساختیم» (وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّا)** و سخن او: **«ندا داده شد که مبارک است آنکه در آتش است و آنکه پیرامون آن است» (نُودِيَ أَنْ بُورِكَ مَنْ فِي النَّارِ وَمَنْ حَوْلَهَا)**.\n\nاگر علمی را نقل کنند و از آن فصاحت کنند و آن را در خود بیابند، آن کلام الهی نیست. و گاهی رسول و صورت با هم هستند و آن در خود کتابت است. پس کتاب، رسول است و عین حجاب بر متکلم است. پس آنچه را که آورده است، به تو می‌فهماند. اما این هنگامی نیست که آنچه را که دانسته است، بنویسد، بلکه هنگامی است که از حدیثی بنویسد که آن حروف مسطور با او سخن می‌گویند. و اگر چنین نباشد، کلام نیست. این ضابطه است.\n\nپس لقاء برای رسولان است و القاء برای خبر الهی با برداشته شدن واسطه‌ها از اینکه او با او سخن گفته است و نه غیر آن. و کتابت، ارقامی است که هر جا مسطور شده‌اند، جز از حدیثی از کسی که آن را مسطور کرده است، نه از علم، مسطور نشده‌اند. پس همه اینها از خطاب الهی برای صاحب این مقام است.\n\n**[علم ترجمه از خدا]**\n\nاما علم ترجمه از خدا، آن برای هر کسی است که خداوند در القاء و وحی با او سخن گفته است. پس مترجم، خالق صور حروف لفظی یا مرقوم است که او ایجاد می‌کند و روح آن صور، کلام خداست و نه غیر آن. اگر از علم ترجمه کند، مترجم نیست. این لازم است.\n\nولی می‌گوید: «قلبم از پروردگارم برایم حدیث گفت». و گاهی مترجم از زبان احوال ترجمه می‌کند و این از این باب نیست، بلکه از باب دیگری است که به عین فهم احوال باز می‌گردد و نزد علمای رسوم معلوم است. و بر آن، سخن خداوند متعال را تفسیر می‌کنند: **«و هیچ چیز نیست مگر اینکه با حمد او تسبیح می‌گوید» (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)**. می‌گویند: یعنی به زبان حال. و همچنین سخن خداوند متعال: **«ما امانت را بر آسمان‌ها و زمین و کوه‌ها عرضه کردیم، پس از حمل آن سر باز زدند و از آن ترسیدند» (إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا)**. پس این سر باز زدن و ترسیدن را حال قرار دادند، نه حقیقت. و همچنین سخن او درباره آن دو: **«گفتند: با طاعت آمدیم» (قَالَتَا أَتَيْنَا طَائِعِينَ)**، سخن حال است، نه سخن خطاب.\n\nو همه اینها صحیح نیست و در این آیات مراد نیست، بلکه امر بر ظاهر خود است، همانطور که وارد شده است. اهل کشف (الکشف) اینگونه آن را درک می‌کنند. پس هنگامی که از موجودات ترجمه می‌کنند، فقط از آنچه با آنان سخن می‌گوید، ترجمه می‌کنند، نه از احوالشان. زیرا اگر سخن می‌گفتند، این را می‌گفتند.\n\nو صاحبان این قول به دو دسته تقسیم شدند. برخی از آنان می‌گویند: اگر این و امثال آن، نطق و کلام حقیقی باشد، باید در این ناطقان حیات خلق شود و در آن هنگام صحیح است که حقیقت باشد. و جایز است که خداوند در آنان حیات خلق کند، اما ما علمی به این نداریم که آیا امر همانطور که ما تجویز کردیم، واقع شده است یا زبان حال است. اما صاحبان آن قول، امر در نفس خود اینگونه واقع شده است، زیرا هر آنچه غیر خداست، در نفس امر زنده و ناطق است. پس نزد اهل کشف (الکشف) و هستی (الوجود)، احوال با این معنی ندارد.\n\nاما دسته دیگر، که حکما هستند، گفتند: این زبان حال است و چاره‌ای نیست، زیرا محال است که جماد زنده شود. و این سخنی است که با غلیظ‌ترین حجاب پوشیده شده است. پس در عالم جز مترجم نیست، هنگامی که از حدیث الهی ترجمه می‌کند. پس این را بفهم.\n\n**[تعیین مراتب برای والیان امر]**\n\nاما تعیین مراتب برای والیان امر، آن علم به مصالحی است که هر مرتبه‌ای برای آن خلق شده است و مستحق آن است. پس صاحب این علم در نفس شخصی که می‌خواهد او را والی کند، می‌نگرد و ترازو را بین او و مرتبه بالا می‌برد. پس اگر اعتدال در وزن را دید، بدون ترجیح کفه مرتبه، او را والی می‌کند. و اگر والی ترجیح داشت، به او ضرری نمی‌رساند. و اگر کفه مرتبه بر او ترجیح داشت، او را والی نمی‌کند، زیرا او از علم آنچه مرتبه به آن ترجیح یافته است، کم دارد، پس بدون شک جور می‌کند. و این اصل جور در والیان است.\n\nو نزد ما محال است که کسی بداند و به طور کامل از حکم علم خود عدول کند. و این نزد علمای رسوم جایز است، اما نزد ما این جایز در هستی (الوجود) واقع نمی‌شود. و این مسئله‌ای دشوار است. به همین دلیل است که مهدی زمین را پر از قسط و عدل می‌کند، همانطور که پر از جور و ظلم شده بود. زیرا علم نزد ما مقتضی عمل است و چاره‌ای نیست، وگرنه علم نیست، اگرچه به صورت علم ظاهر شود.\n\nو مراتب سه تا هستند و آنهایی هستند که حکم حاکم در آنها نافذ می‌شود: خون‌ها، آبرو‌ها و اموال. پس می‌داند که هر مرتبه‌ای چه حکمی از حکم الهی مشروع را می‌طلبد. و در مردم می‌نگرد. پس هر کس را دید که آنچه آن مرتبه می‌طلبد، جمع کرده است، در مزاج آن جامع می‌نگرد. اگر دید که تحت حکم علم تصرف می‌کند، می‌داند که او عاقل است، پس او را والی می‌کند. و اگر دید که بر علم خود حکم می‌کند و علمش با او مقهور تحت حکم شهوت و سلطه هوای اوست، با وجود علمش به حکم، او را والی نمی‌کند.\n\nیکی از پادشاهان به یکی از همنشینان خود از اهل رأی و نظر صحیح، هنگامی که با او مشورت کرد، گفت: چه کسی را برای امور مردم والی کنم؟ گفت: بر امور مردم، مردی عاقل را والی کن. زیرا عاقل برای خود استبراء می‌کند. اگر عالم باشد، به آنچه می‌داند حکم می‌کند. و اگر به آن واقعه عالم نباشد، عقلش بر او حکم می‌کند که از کسی که حکم الهی مشروع در آن واقعه را می‌داند، بپرسد. پس هنگامی که آن را شناخت، در آن حکم می‌کند. این فایده عقل است. زیرا بسیاری از کسانی که به دین و علم رسمی منتسب هستند، شهوتشان بر آنان حکم می‌کند. و عاقل چنین نیست، زیرا عقل جز فضائل را نمی‌پذیرد. زیرا صاحب خود را از تصرف در آنچه شایسته نیست، باز می‌دارد. به همین دلیل عقل نامیده شده است، از عقال (بند شتر).\n\nاما رحمت در غضب، این جز در حدود مشروع و تعزیرات نیست. و غیر از آن، غضبی است که هیچ رحمی در آن نیست. به همین دلیل ابویزید گفت: «بطش من شدیدتر است»، هنگامی که قاری را شنید که می‌خواند: **«همانا بطش پروردگار تو شدید است» (إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ)**. زیرا انسان هنگامی که برای نفس خود غضب می‌کند، آن غضب به هیچ وجه رحمتی را در بر ندارد. و هنگامی که برای خدا غضب می‌کند، غضب او غضب خداست. و غضب خدا از رحمتی الهی که با آن آمیخته است، خالی نیست. پس غضب او در دنیا، همان حدود و تعزیراتی است که وضع کرده است. و غضب او در آخرت، همان حدودی است که بر کسانی که وارد آتش می‌شوند، اقامه می‌کند. پس اگرچه غضب است، اما تطهیر است، به دلیل رحمتی که در دنیا و آخرت با آن آمیخته است. زیرا هنگامی که رحمت در هستی (الوجود) سبقت گرفت، همه هستی را فرا گرفت و همه چیز را وسعت داد. پس هنگامی که غضب در هستی آمد، رحمت را دید که بر او سبقت گرفته است و وجود غضب لازم است. پس غضب با رحمت مانند آب با شیر بود، هنگامی که با آن آمیخته و مخلوط شود. همانطور که آب از شیر خالص نشد، غضب نیز از رحمت خالص نشد. پس رحمت بر غضب حکم کرد، زیرا صاحب محل است. پس غضب خدا در مورد کسانی که مورد غضب قرار گرفته‌اند، پایان می‌یابد و رحمت خدا پایان نمی‌یابد.\n\nاین مهدی جز برای خدا غضب نمی‌کند، پس در غضب خود از اقامه حدود خدا که تشریع کرده است، تجاوز نمی‌کند. بر خلاف کسی که برای هوای خود و مخالفت با غرض خود غضب می‌کند. پس چنین کسی که برای خدا غضب می‌کند، ممکن نیست جز عادل و مقسط باشد، نه جائر و قاسط.\n\nو نشانه کسی که ادعای این مقام را دارد، این است که اگر برای خدا غضب کند و حاکم باشد و حد را بر کسی که مورد غضب قرار گرفته است، اقامه کند، غضب از آن شخص پس از فراغت از آن، زائل می‌شود. و چه بسا به سوی او برخیزد و او را در آغوش بگیرد و با او انس بگیرد و به او بگوید: «خدا را شکر کن که تو را پاک کرد» و خوشحالی و بشاشت را به او نشان دهد و چه بسا پس از آن به او احسان کند. این ترازوی اوست. و آن کسی که حد بر او جاری شده است، همه آن برای او رحمت باز می‌گردد.\n\nو من این را برای یکی از قاضیان در بلاد مغرب دیدم؛ قاضی شهر سبته که ابوابراهیم بن یغمور نام داشت. او با ما حدیث را نزد شیخمان ابوالحسین بن صائغ از نسل ابی ایوب انصاری و نزد ابوالصبر ایوب فهری و نزد ابومحمد بن عبدالله حجری در سبته در زمان قضاوتش می‌شنید. و هرگز سواره برای شنیدن نمی‌آمد، بلکه پیاده در میان مردم راه می‌رفت. اگر دو نفر را می‌دید که با هم خصومت کرده و او را به داوری خوانده‌اند، نزد آنان می‌ایستاد و بینشان صلح برقرار می‌کرد. اشک ریزان، طولانی فکر، بسیار ذاکر بود. بین دو قبیله با شخص خود صلح برقرار می‌کرد و به برکت او صلح می‌کردند.\n\nو اگر غضب با قاضی بر کسی که حد بر او جاری شده است، پس از گرفتن حق خدا از او باقی بماند، آن غضب نفس و طبع است یا برای امری در نفس او نسبت به آن محدود است و غضب برای خدا نیست. به همین دلیل خداوند به او پاداش نمی‌دهد، زیرا او در آن، رعایت حق خدا را نکرده است. و این از سخن خداوند متعال است: **«و اخبار شما را بیازماییم» (وَنَبْلُوَ أَخْبَارَكُمْ)**. پس ابتدا آنان را با آنچه مکلف کرده است، می‌آزماید. پس هنگامی که عمل کردند، اعمالشان را می‌آزماید که آیا آنها را برای خطاب حق انجام داده‌اند یا برای غیر آن. و این همان سخن خداوند عز و جل است: **«روزی که اسرار آشکار می‌شود» (يَوْمَ تُبْلَى السَّرَائِرُ)**.\n\nو این ترازوی آن نزد اهل کشف (الکشف) است. پس حاکم هنگام اقامه حدود، از نگریستن در نفس خود غافل نشود و از تشفی که برای نفوس است، برحذر باشد. به همین دلیل از حکم کردن در حال غضب نهی شده است. و اگر حاکم نباشد، در حق کسی که به اقامه حد بر او مبتلا شده است، نباید غضبی در او ایجاد شود. این فقط برای حاکمان است و برای رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از آن جهت که حاکم است. اگر مبلّغ بود و نه حاکم، غضبی بر کسی که دعوت او را رد می‌کرد، در او ایجاد نمی‌شد. زیرا او هیچ امری ندارد و هدایت آنان بر عهده او نیست. زیرا خداوند در این باره به رسول (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: **«بر تو جز ابلاغ نیست» (إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ)**. و او ابلاغ کرد. پس خداوند به هر کس خواست، شنوا ساخت و هر کس خواست، کر ساخت.\n\nآنان عاقل‌ترین مردم هستند، منظورم انبیا است. و هنگامی که دعوت‌کننده بر کسی که خداوند او را از دعوت کر ساخته است، کشف شود، پس آن را نشنیده است، به همین دلیل تغییر نمی‌کند. زیرا فریادزن هنگامی که کسی را که کر است، ندا می‌دهد و می‌داند که ندای او را نشنیده است، بر او خشم نمی‌گیرد و عذر او نزد او پذیرفته است.\n\nاگر رسول حاکم باشد، حکم کردن به آنچه خداوند برای او در آن تعیین کرده است، بر او واجب است. و این علم شریفی است که هر والی در زمین بر عالم به آن نیاز دارد.\n\nاما علم به آنچه مُلک (حکومت) از روزی‌ها نیاز دارد، این است که اصناف عالم را بشناسد و آن جز دو صنف نیست. و منظورم از عالم، کسانی هستند که حکم این امام در میان آنان جاری می‌شود. و آنان عالم صور و عالم نفوس هستند که این صور را در آنچه از حرکت یا سکون در آن تصرف می‌کنند، تدبیر می‌کنند. و غیر از این دو صنف، او بر آنان حکمی ندارد، مگر کسی که از آنان بخواهد که او بر نفس خود حکم کند، مانند عالم جن.\n\nاما عالم نورانی، آنان خارج از آن هستند که عالم بشری بر آنان ولایتی داشته باشد. پس هر شخصی از آنان بر مقام معلومی است که پروردگارش برای او تعیین کرده است. پس جز به امر پروردگارش نازل نمی‌شود. پس هر کس بخواهد یکی از آنان را نازل کند، در آن به پروردگارش توجه می‌کند و پروردگارش به او امر می‌کند و به او در آن اذن می‌دهد، برای یاری رساندن به این سائل، یا او را ابتدا بر او نازل می‌کند.\n\nاما سیاحان از آنان، مقام معلومشان این است که سیاح هستند و مجالس ذکر را می‌جویند. پس هنگامی که اهل ذکر را یافتند -و آنان اهل قرآن هستند که قرآن را ذکر می‌کنند- هیچ کس از مجالس ذاکران غیر قرآن را بر آنان مقدم نمی‌دارند. و اگر آن را نیافتند و ذاکران خدا را یافتند که تلاوت‌کننده نیستند، نزد آنان می‌نشینند و یکدیگر را ندا می‌دهند: «بیایید به سوی مطلوبتان». این روزی آنان است که با آن زندگی می‌کنند و حیاتشان در آن است.\n\nپس هنگامی که امام این را بداند، پیوسته گروهی را برپا می‌دارد که **«آیات خدا را در ساعات شب و روز تلاوت می‌کنند» (يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَالنَّهَارِ)**. ما در فاس از بلاد مغرب این راه را سلوک می‌کردیم، برای موافقت با یارانی موفق که شنونده و مطیع ما بودند. و آنان را از دست دادیم، پس این عمل خالص را به دلیل فقدان آنان از دست دادیم. و این شریف‌ترین و بالاترین روزی‌هاست.\n\nپس هنگامی که مانند اینان را از دست دادیم، به نشر علم پرداختیم، به خاطر ارواحی که غذایشان علم است. و دیدیم که هیچ چیز از آن را وارد نکنیم، مگر از اصلی که مطلوب این صنف روحانی است و آن قرآن است. پس تمام آنچه در مجالس و تألیفات خود درباره آن سخن می‌گوییم، فقط از حضرت قرآن و خزانه‌های آن است. کلید فهم در آن و امداد از آن به من داده شده است. و همه اینها برای این است که از آن خارج نشویم. زیرا آن والاترین چیزی است که بخشیده می‌شود و قدر آن را نمی‌داند، مگر کسی که آن را چشیده باشد و منزلت آن را به حال از خود شهود کرده باشد و حق در سرّ او با آن سخن گفته باشد. زیرا اگر حق، گوینده با بنده خود در سرّ او باشد، با برداشته شدن واسطه‌ها، فهم، کلام او را از تو همراهی می‌کند. پس عین کلام از او، عین فهم از توست و از آن عقب نمی‌ماند. و اگر از آن عقب بماند، کلام خدا نیست. و کسی که این را نیابد، علمی به کلام گفتن خدا با بندگانش ندارد.\n\nو هنگامی که با حجاب صوری با زبان پیامبری یا هر کس که خدا بخواهد از عالم با او سخن بگوید، ممکن است فهم آن را همراهی کند و ممکن است از آن عقب بماند. این تفاوت بین آن دو است.\n\nاما روزی‌های محسوس، او در آنها حکمی ندارد، مگر در بقیة الله. پس هر کس از آنچه خارج از این بقیه است، بخورد، از دست این امام عادل نخورده است. و روزی خدا در حق مؤمنان، جز بقیة الله نامیده نمی‌شود. و هر روزی در هستی (الکون) از بقیة الله است. و فقط باقی می‌ماند که بین آن دو فرق گذاشته شود. و آن این است که تمام اموال در عالم، یا مالک معینی دارند یا مالک ندارند. اگر مالک معینی داشته باشند، آن از بقیة الله برای آن شخص است. و اگر مالک معینی نداشته باشند، آن برای همه مسلمانان است. پس خداوند این امام را وکیل آنان قرار داده است که آن را برایشان حفظ کند. پس این از بقیة الله است که بر مال مملوک افزوده شده است.\n\nهر روزی در عالم بقیة الله است، اگر معنی بقیة الله را بدانی. پس مال زید بقیة الله برای زید است، زیرا خداوند تصرف در مال عمرو را بدون اذن او بر او ممنوع کرده است. و مال عمرو بقیة الله برای عمرو است، زیرا خداوند تصرف در مال زید را بدون اذن او بر او ممنوع کرده است. پس در عالم روزی نیست، مگر اینکه بقیة الله است. پس امام در آن به اندازه‌ای که خداوند حکم آن را نازل کرده است، حکم می‌کند.\n\n**[مردم بر دو حالت هستند]**\n\nپس این را بدان. مردم بر دو حالت هستند: اضطرار و غیر اضطرار. حالت اضطرار، به اندازه نیاز در آن وقت مباح می‌سازد و حکم تحجیر (ممنوعیت) را از او برمی‌دارد. پس هنگامی که به آنچه اضطرار را برطرف می‌کند، دست یافت، حکم تحجیر بر او ترجیح می‌یابد.\n\nاگر مضطر در آنچه ملک کسی است، تصرف کرده باشد، در یک قول به حکم ضمان در آن تصرف کرده است و در قولی دیگر بدون ضمان. اگر نزد قائل به ضمان، آن را یافت، ادا می‌کند. و اگر نیافت، امام وقت از بیت المال به جای او آن را ادا می‌کند. و اگر متصرف در آنچه کسی مالک آن نیست یا امام به حکم وکالت مطلقه از خدا مالک آن است، تصرف کرده باشد، چیزی بر او نیست، نه ضمان و نه غیر آن. و این علمی است که معرفت به آن بر امام وقت واجب است و چاره‌ای از آن نیست.\n\nهیچ مکلفی به وجه مشروع تصرف نکرده است، مگر در بقیة الله. خداوند عز و جل فرمود: **«بقیة الله برای شما بهتر است، اگر مؤمن باشید» (بَقِيَّتُ اللَّهِ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ)**. و این حکم فرعی است. و اصل این است که خداوند آنچه در زمین است، همه را برای ما خلق کرد، سپس ممنوع ساخت و باقی گذاشت. پس آنچه را باقی گذاشت، بقیة الله نامید و آنچه را ممنوع ساخت، حرام نامید. یعنی مکلف از تصرف در آن در حال یا زمان یا مکان با وجود تحجیر ممنوع است. زیرا اصل، توقف از اطلاق حکم در آن به چیزی است. پس هنگامی که حکم خدا در آن آمد، ما بر اساس حکم الهی که شرع به سوی ما آورده است، عمل می‌کنیم. هر کس این را بداند، می‌داند که چگونه در روزی‌ها تصرف کند.\n\nاما علم تداخل امور در یکدیگر، این معنی سخن خداوند متعال است: **«شب را در روز داخل می‌کند و روز را در شب داخل می‌کند» (يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ)**. پس داخل‌کننده مذکر است و داخل‌شده مؤنث. این حکم هر جا که ظاهر شود، همراه اوست. پس در علوم، علم نظری است و در حس، نکاح حیوانی و نباتی است. و هیچ یک از اینها فقط برای خود مراد نیست، بلکه برای خود و برای آنچه تولید می‌کند، مراد است. و اگر لحمه (تار) و سد (پود) نبود، عین شفه (لب) ظاهر نمی‌شد. و این در تمام صنایع عملی و علمی جاری است. پس هنگامی که امام این را بداند، شبهه‌ای در احکامش بر او وارد نمی‌شود. و این همان ترازویی است که در عالم در معانی و محسوسات وضع شده است. و عاقل با ترازو در دو عالم، بلکه در هر چیزی که در آن تصرف دارد، تصرف می‌کند.\n\nاما حاکمان به وحی نازل، اهل القاء از رسولان و امثال آنان، از توالج (در هم تنیدگی) خارج نشدند. زیرا خداوند آنان را محل آنچه از حکم خود در میان بندگانش به آنان القاء می‌کند، قرار داده است. خداوند متعال فرمود: **«روح الامین آن را بر قلب تو نازل کرد» (نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ)** و فرمود: **«فرشتگان را با روح از امر خود بر هر کس از بندگانش که بخواهد، نازل می‌کند» (يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ)**.\n\nهیچ حکمی در عالم از رسولی ظاهر نشد، مگر از نکاح معنوی. نه در نصوص و نه در حاکمان به قیاس. پس بر امام واجب است که علم به آنچه از طریق تنزیل الهی است و آنچه از طریق قیاس است، را بداند. و مهدی علم قیاس را می‌داند -منظورم علم قیاس است- تا به آن حکم کند، بلکه آن را می‌داند تا از آن اجتناب کند. پس مهدی جز به آنچه فرشته از نزد خدا به او القاء می‌کند -که خداوند او را برای تأیید او فرستاده است- حکم نمی‌کند. و آن همان شرع حقیقی محمدی است که اگر محمد (صَلَّى اللهُ عَليهِ وسَلَّم) زنده بود و آن واقعه به او عرضه می‌شد، جز به آنچه این امام حکم می‌کند، حکم نمی‌کرد. پس خداوند به او می‌آموزد که آن همان شرع محمدی است. پس قیاس بر او حرام است، با وجود نصوصی که خداوند به او بخشیده است. به همین دلیل:\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در وصف مهدی فرمود: «قدم جای قدم من می‌گذارد و خطا نمی‌کند».\n\nپس دانستیم که او (مهدی) پیرو است نه متبوع، و او معصوم است. و معنای معصوم در حکم این نیست مگر اینکه خطا نمی‌کند؛ زیرا حکم رسول به او نسبت خطا داده نمی‌شود، چرا که او از روی هوی سخن نمی‌گوید: «إِنْ هُوَ إِلَّا وَحْيٌ يُوحى» (نیست مگر وحی‌ای که به او وحی می‌شود). همان‌طور که قیاس در جایی که رسول (صَلَّى اللهُ عَليهِ وسَلَّم) حضور دارد، جایز نیست. و نزد اهل کشف، پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) حاضر است، پس حکم را جز از او نمی‌گیرند. به همین دلیل، فقیر صادق (سالک راستین) به مذهبی منتسب نمی‌شود، بلکه با رسولی است که برای او مشهود است، همان‌طور که رسول با وحی‌ای است که بر او نازل می‌شود. پس از جانب حق (الحق) بر قلوب عارفان صادق، تعریف (التعريف) حکم حوادث نازل می‌شود که آن حکم شرعی است که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با آن مبعوث شده است.\n\nو اصحاب علم رسوم (فقهای ظاهری) این مرتبه را ندارند، به دلیل روی آوردنشان به حب جاه و ریاست و تقدم بر بندگان خدا و نیاز عمومی مردم به آن‌ها. پس نه خودشان رستگار می‌شوند و نه دیگران به واسطه آن‌ها رستگار می‌شوند. و این حال فقهای زمان است که به مناصب قضاوت، شهادت، حسبه و تدریس راغبند.\n\nاما کسانی از آن‌ها که به دین تظاهر می‌کنند، شانه‌های خود را جمع می‌کنند و از گوشه چشم، با نگاهی خاشعانه به مردم می‌نگرند و لب‌های خود را با ذکر حرکت می‌دهند تا بیننده بداند که آن‌ها ذاکرند، و در کلام خود تصنع و تکلف به خرج می‌دهند و دهان‌درّی می‌کنند. رعونت‌های نفس بر آن‌ها غلبه کرده و قلب‌هایشان قلب‌های گرگ‌هاست. خداوند به آن‌ها نظر نمی‌کند. این حال متدینان از آن‌هاست، نه کسانی که قرین شیطانند و خداوند به آن‌ها نیازی ندارد. آن‌ها برای مردم پوست گوسفند از نرمی پوشیده‌اند؛ در آشکارا برادرند و در نهان دشمن. پس خداوند آن‌ها را باز می‌گرداند و پیشانی‌هایشان را به سوی آنچه سعادتشان در آن است می‌گیرد.\n\nو هنگامی که این امام مهدی خروج کند، دشمن آشکاری جز فقها ندارد، زیرا برای آن‌ها نه ریاستی باقی می‌ماند، نه تمایزی از عوام، و نه علمی به حکمی جز اندکی باقی می‌ماند. و با وجود این امام، اختلاف در احکام از جهان برچیده می‌شود. و اگر شمشیر در دست مهدی نبود، فقها به قتل او فتوا می‌دادند، اما خداوند او را با شمشیر و کرم (بزرگواری) ظاهر می‌سازد. پس طمع می‌کنند و می‌ترسند و حکم او را بدون ایمان می‌پذیرند، بلکه خلاف آن را در دل پنهان می‌دارند، همان‌طور که حنفیان و شافعیان در آنچه اختلاف دارند، انجام می‌دهند. به ما خبر رسیده است که پیروان این دو مذهب در سرزمین‌های عجم با یکدیگر می‌جنگند و خلق بسیاری بین آن‌ها کشته می‌شوند و در ماه رمضان افطار می‌کنند تا بر قتال قوت یابند. پس اگر قهر امام مهدی با شمشیر نبود، چنین کسانی نه به او گوش می‌دادند و نه در ظاهر از او اطاعت می‌کردند، همان‌طور که در قلب‌هایشان از او اطاعت نمی‌کنند، بلکه معتقدند که اگر او در مورد آن‌ها به غیر از مذهبشان حکم کند، در آن حکم بر گمراهی است، زیرا معتقدند که زمان اهل اجتهاد منقطع شده و دیگر مجتهدی در جهان باقی نمانده است و خداوند پس از امامان آن‌ها کسی را که دارای درجه اجتهاد باشد، نمی‌آورد. و اما کسی که ادعای تعریف (التعريف) الهی به احکام شرعی را دارد، نزد آن‌ها دیوانه‌ای است که خیالش فاسد شده و به او توجهی نمی‌کنند. اگر صاحب مال و سلطنت باشد، در ظاهر به او گردن می‌نهند، به دلیل رغبت در مالش و ترس از سلطنتش، در حالی که در باطن به او کافرند.\n\n### [مهدی و مبالغه و استقصاء در برآوردن حوائج مردم]\n\nاما مبالغه و استقصاء (کوشش کامل) در برآوردن حوائج مردم، به طور خاص بر امام واجب است نه بر عموم مردم؛ زیرا خداوند او را بر خلق خود مقدم نساخته و او را امام آن‌ها قرار نداده است مگر برای اینکه در مصالح آن‌ها بکوشد. و آنچه از این کوشش حاصل می‌شود، عظیم است.\n\nو برای او در داستان موسی (علیه السلام) عبرتی است، هنگامی که برای اهل خود رفت تا آتشی برای گرم شدن و انجام کاری که به طور معمول جز با آن انجام نمی‌شود، بیاورد. و او (علیه السلام) خبری از آنچه برایش پیش می‌آمد نداشت، پس عاقبت آن طلب برای او به سخن گفتن پروردگارش انجامید. پس خداوند متعال با او در عین حاجتش که آتش بود، در آن صورت سخن گفت. و آن امر هرگز به خاطر او (علیه السلام) خطور نکرده بود. و چه چیزی عظیم‌تر از این است؟ و این امر برای او حاصل نشد مگر در وقت کوشش برای خانواده‌اش، تا خداوند او را از فضیلت برآوردن حوائج خانواده آگاه سازد تا حرص او در کوشش برای آن‌ها بیشتر شود. پس این تنبیهی از جانب حق تعالی بود بر قدر و منزلت آن نزد خداوند متعال و بر قدر و منزلت آن‌ها، زیرا آن‌ها در هر حال بندگان او هستند. و او (موسی) بر قیام به امور آن‌ها موکل شده است، چنانکه خداوند متعال می‌فرماید: «الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ» (مردان سرپرست زنانند).\n\nو نتیجه آن، فرار از دشمنانی که قصد کشتن او را داشتند، به حکم و رسالت انجامید، چنانکه خداوند متعال از قول او (علیه السلام) خبر می‌دهد: «فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ» (پس چون از شما ترسیدم، از شما گریختم، پس پروردگارم به من حکمتی بخشید و مرا از فرستادگان قرار داد). و کوشش برای خانواده و برآوردن حوائج آن‌ها، کلام خدا را به او عطا کرد. و این بی‌شک همه کوشش بود. زیرا فرارکننده در فرارش با نسبتی حیوانی آمد که نفسش از دشمنان فرار کرد، به طلب نجات و بقای مُلک و تدبیر بر نفس ناطقه. پس او با نفس حیوانی خود در فرارش نکوشید مگر در حق نفس ناطقه که مالک تدبیر این بدن است.\n\nو حرکت همه امامان عادل، تنها در حق غیر است نه در حق خودشان. پس اگر دیدید که سلطان به غیر از رعیت خود و آنچه به آن نیاز دارند مشغول است، بدانید که مرتبه (مقام) او با این کار از او سلب شده است و هیچ فرقی بین او و عوام نیست.\n\nو هنگامی که عمر بن عبدالعزیز در روزی که خلافت را پذیرفت، خواست برای رفع خستگی ناشی از مشغولیت به برآوردن حوائج مردم، اندکی استراحت کند، پسرش بر او وارد شد و گفت: ای امیرالمؤمنین، تو استراحت می‌کنی و صاحبان حاجات پشت در هستند. کسی که آسایش می‌خواهد، نباید امور مردم را بر عهده بگیرد. پس عمر گریست و گفت: الحمدلله که از صلب من کسی را خارج کرد که مرا تنبیه می‌کند و به حق می‌خواند و مرا بر آن یاری می‌دهد. پس استراحت را ترک کرد و نزد مردم رفت.\n\nو همچنین خضر که نامش بلیا بن ملکان بن فالغ بن غابر بن شالخ بن ارفخشد بن سام بن نوح (علیه السلام) است، در لشکری بود. امیر لشکر او را فرستاد تا برای آن‌ها آبی پیدا کند، زیرا آب را گم کرده بودند. پس او به چشمه حیات برخورد و از آن نوشید و تا کنون زنده است. و او نمی‌دانست که خداوند چه خصوصیتی از حیات را به نوشنده آن آب اختصاص داده است.\n\nمن او را در اشبیلیه ملاقات کردم و او به من توصیه کرد که تسلیم شیوخ باشم و با آن‌ها نزاع نکنم. در آن روز من با یکی از شیوخ خود در مسئله‌ای نزاع کرده بودم و از نزد او خارج شدم. پس خضر را در قوس الحنیه (نام مکانی) ملاقات کردم. او به من گفت: سخن شیخ را بپذیر و تسلیم شو. پس فوراً به نزد شیخ بازگشتم. هنگامی که وارد منزل او شدم، قبل از اینکه من سخن بگویم، او با من سخن گفت و فرمود: ای محمد، آیا لازم است که در هر مسئله‌ای که با من نزاع می‌کنی، خضر به تو توصیه کند که تسلیم شیوخ باشی؟ گفتم: ای سید ما، او همان خضر بود که به من توصیه کرد. گفت: بله. گفتم: الحمدلله، این یک فایده است، با این حال، امر همان است که برای شما ذکر کردم.\n\nپس از مدتی، نزد شیخ رفتم و دیدم که او به قول من در آن مسئله بازگشته است و به من گفت: من در آن اشتباه می‌کردم و تو درست می‌گفتی. گفتم: ای سید من، اکنون دانستم که خضر به من جز تسلیم شدن توصیه نکرده بود و مرا آگاه نساخت که شما در آن مسئله بر حق هستید، زیرا نزاع من با شما در آن مسئله واجب نبود، چون از احکام مشروعی نبود که سکوت از آن حرام باشد. و خداوند را بر آن شکر کردم و برای شیخ که حق برایش آشکار شد، خوشحال شدم.\n\nو این عین الحیات (چشمه حیات) است؛ آبی که خداوند حیات را به نوشنده آن اختصاص داده است. سپس به نزد یارانش بازگشت و آن‌ها را از آب خبر داد. پس مردم به سرعت به آن مکان رفتند تا از آن آب بردارند، اما خداوند دیدگانشان را از آن کور کرد و نتوانستند آن را بیابند. پس این چیزی است که کوشش او در حق غیر برایش به ارمغان آورد.\n\nو همچنین کسی که به خاطر خدا دوستی کند و به خاطر خدا دشمنی کند، و به خاطر خدا دوست بدارد و به خاطر خدا کینه ورزد، از این باب است. خداوند متعال می‌فرماید: «لا تَجِدْ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ أُولئِكَ كَتَبَ في قُلُوبِهِمُ الْإِيمانَ وأَيَّدَهُمْ بِرُوحٍ مِنْهُ» (قومی را که به خدا و روز بازپسین ایمان دارند، نمی‌یابی که با کسانی که با خدا و رسولش دشمنی کرده‌اند، دوستی کنند، هر چند پدرانشان یا پسرانشان یا برادرانشان یا خویشاوندانشان باشند. آنان کسانی هستند که ایمان را در دل‌هایشان نوشته و با روحی از جانب خود تأییدشان کرده است). پس هیچ کس نمی‌داند که آن‌ها چه منزلتی نزد خداوند دارند، زیرا آن‌ها حرکت و سکون نکردند مگر در حق خدا، نه در حق خودشان، و جناب الهی را بر آنچه طبعشان اقتضا می‌کند، ترجیح دادند.\n\nو اما وقوف بر علم غیب که به طور خاص در مدت خاصی در امر کَون (جهان هستی) مورد نیاز است، و آن نهمین مسئله است که ورای آن چیزی نیست که امام در امامت خود به آن نیاز داشته باشد. و آن این است که خداوند متعال از خود خبر داده است که: «كُلَّ يَوْمٍ هُوَ في شَأْنٍ» (او هر روز در کاری است). و شأن (امر) همان چیزی است که جهان در آن روز بر آن است. و معلوم است که آن شأن هنگامی که در الوجود (هستی) ظاهر شود، برای هر کس که آن را شهود کند، معلوم می‌شود.\n\nپس این امام، در این مسئله، از جانب حق (الحق) بر آنچه حق می‌خواهد از شؤون (امور) قبل از وقوعشان در الوجود (هستی) ایجاد کند، اطلاع دارد. پس در روز قبل از وقوع آن شأن، بر آن شأن مطلع می‌شود. اگر آن شأن از اموری باشد که در آن منفعتی برای رعیت اوست، خدا را شکر می‌کند و سکوت می‌نماید. و اگر از اموری باشد که در آن عقوبتی است، با نزول بلای عمومی یا بر اشخاص معین، از خداوند برای آن‌ها سؤال می‌کند و شفاعت و تضرع می‌نماید. پس خداوند آن بلا را به رحمت و فضل خود از آن‌ها برمی‌گرداند و دعاء و سؤال او را اجابت می‌کند. به همین دلیل، خداوند او را قبل از وقوعش در الوجود (هستی) بر آن مطلع می‌سازد.\n\nسپس خداوند او را در آن شؤون بر حوادثی که از اشخاص واقع می‌شود، مطلع می‌سازد و اشخاص را با اوصافشان برای او معین می‌کند، به طوری که وقتی آن‌ها را می‌بیند، شک نمی‌کند که آن‌ها عین همان چیزی هستند که دیده است. سپس خداوند او را بر حکم مشروع در آن حادثه مطلع می‌سازد، حکمی که خداوند برای پیامبرش محمد (صَلَّى اللهُ عَليهِ وسَلَّم) تشریع کرده است که در آن حکم کند. پس او جز به آن حکم، حکم نمی‌کند و هرگز خطا نمی‌کند.\n\nو اگر خداوند حکم را در برخی حوادث بر او کور کند و کشفی (الکشف) برای او حاصل نشود، نهایت کارش این است که آن را در حکم به مباح ملحق سازد و با عدم تعریف (التعريف) می‌داند که آن حکم شرع در آن است. زیرا او از رأی و قیاس در دین معصوم است. چرا که قیاس از کسی که پیامبر نیست، حکم بر خدا در دین خداست به آنچه نمی‌داند. زیرا او علتی را تعمیم داده است، و تو چه می‌دانی، شاید خداوند تعمیم آن علت را نخواسته باشد. و اگر آن را می‌خواست، آن را بر زبان رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) بیان می‌کرد و به تعمیم آن امر می‌نمود. این در صورتی است که علت از اموری باشد که شرع در قضیه‌ای بر آن تصریح کرده باشد. پس گمان تو درباره علتی که فقیه با نفس و نظر خود استخراج می‌کند، بدون اینکه شرع با نص معینی آن را ذکر کرده باشد، چیست؟ سپس پس از استنباط آن، آن را تعمیم می‌دهد. این تحکم بر تحکم است با شرعی که خداوند به آن اجازه نداده است.\n\nو این امر، مهدی را از قول به قیاس در دین خدا باز می‌دارد، به ویژه که او می‌داند مراد پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) تخفیف در تکلیف از این امت بوده است. به همین دلیل بود که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرمود: «مرا واگذارید تا زمانی که شما را واگذاشته‌ام» و از سؤال در دین کراهت داشت، از ترس افزایش حکم.\n\nپس هر آنچه که برای او مسکوت گذاشته شده و بر حکم معینی در آن مطلع نشده است، عاقبت امر در آن را حکم به حکم اصل قرار می‌دهد. و هر آنچه خداوند او را بر آن مطلع سازد، از طریق کشف (الکشف) و تعریف (التعريف)، آن حکم شرع محمدی در آن مسئله است. و گاهی خداوند او را در اوقاتی بر مباح بودن چیزی مطلع می‌سازد و عاقبت آن.\n\nپس هر مصلحتی که در حق رعایای او باشد، خداوند او را بر آن مطلع می‌سازد تا در مورد آن از او سؤال کند. و هر فسادی که خداوند بخواهد بر رعایای او واقع سازد، خداوند او را بر آن مطلع می‌سازد تا از خداوند بخواهد که آن را از آن‌ها برطرف کند، زیرا آن عقوبت است، چنانکه فرمود: «ظَهَرَ الْفَسادُ في الْبَرِّ والْبَحْرِ بِما كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ» (فساد در خشکی و دریا به سبب آنچه دست‌های مردم کسب کرده، ظاهر شد، تا خداوند برخی از آنچه را که انجام داده‌اند به آن‌ها بچشاند، شاید بازگردند).\n\nپس مهدی رحمت است، همان‌طور که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) رحمت بود. خداوند عز و جل می‌فرماید: «وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ» (و تو را نفرستادیم مگر رحمتی برای جهانیان). و مهدی قدم جای قدم او می‌گذارد و خطا نمی‌کند، پس ناگزیر باید رحمت باشد.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که مجروح شد، می‌فرمود: «اللهم اهد قومي فإنهم لا يعلمون» (خداوندا قوم مرا هدایت کن، زیرا آن‌ها نمی‌دانند). برای آن‌ها نزد پروردگارش عذر می‌آورد. و هنگامی که دانست او بشر است و احکام بشریت ممکن است در اوقاتی بر او غلبه کند، پروردگارش را خواند و گفت: «اللهم إنك تعلم أني بشر أرضى كما يرضى البشر وأغضب كما يغضب البشر» (خداوندا تو می‌دانی که من بشر هستم، راضی می‌شوم همان‌طور که بشر راضی می‌شود و خشمگین می‌شوم همان‌طور که بشر خشمگین می‌شود) یعنی بر آن‌ها خشم می‌گیرم و برای خودم راضی می‌شوم. «اللهم من دعوت عليه فاجعل دعائي عليه رحمة له ورضوانا» (خداوندا هر کس را که بر او دعا کردم، دعای مرا بر او رحمت و رضوان قرار ده).\n\nاین‌ها نُه امر است که به مجموع آن‌ها برای هیچ امامی از ائمه دین، خلفای خدا و رسولش، تا روز قیامت صحیح نشده است، مگر برای این امام مهدی. همان‌طور که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بر هیچ امامی از ائمه دین که پس از او باشد و از او ارث ببرد و قدم جای قدم او بگذارد و خطا نکند، تصریح نکرده است، مگر مهدی به طور خاص. پس دلیل عقلی بر عصمت رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در آنچه از پروردگارش از حکم مشروع برای بندگانش ابلاغ می‌کند، شهادت داده است، همان‌طور که او (رسول) بر عصمت مهدی در احکامش شهادت داده است.\n\nو در این منزل از علوم، علم اشتراک در احدیت (الأحدية) است، و آن اشتراک عام است، مانند قول خداوند: «ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً» (و هیچ کس را در عبادت پروردگارش شریک نسازد). و خداوند متعال فرمود: «قُلْ هُوَ الله أَحَدٌ» (بگو اوست خدا، یکتا). پس خداوند متعال خود را به احدیت (الأحدية) وصف کرده است و این سوره، نسبت حق تعالی است و عبادت را برای او از هر کسی منحصر کرده است.\n\nو در آن، علم انزال الهی است. و در آن، علم معنایی است که کتابت را کلام قرار داده است، و حقیقت کلام نزد عقلا معلوم است، و کلام مسئله‌ای است که بین نظریه‌پردازان مورد اختلاف است.\n\nو در آن، علم کلام مستقیم از کلام کج است و اینکه استقامت کلام از کجی آن به چه چیزی شناخته می‌شود.\n\nو در آن، علم آنچه رسولان به طور عموم و خصوص آورده‌اند، است.\n\nو در آن، علم کسی است که بدون علم سخن گفته است، آیا آن در نفس الأمر علم است یا نزد کسی که آن را علم نمی‌داند، علم است، با وجود اینکه می‌داند جز خداوند ناطقی نیست.\n\nو در آن، علم معرفت صدق و کذب است و اینکه چرا به آن دو باز می‌گردند، و صادق و کاذب.\n\nو در آن، علمی است که اگر انسان آن را بداند، حرج (تنگی) از نفس او برداشته می‌شود، هنگامی که آنچه را که عادت در نفوس از امور عارضی جاری ساخته است، می‌بیند که در او حرجی تأثیر بگذارد، تا جایی که انسان آرزو می‌کند خود را بکشد به خاطر آنچه می‌بیند. و این علم، علم الراحة (آسایش) نامیده می‌شود و آن علم اهل بهشت به طور خاص است. پس هر کس که خداوند آن را در دنیا بر او بگشاید، آسایش ابدی برای او تعجیل شده است، همراه با ملازمت ادب از سوی کسی که این صفت اوست در امر به معروف و نهی از منکر به اندازه مرتبه‌اش.\n\nو در آن، علم آنچه خداوند برای دیدگان بر اجسام ظاهر ساخته است که آن زینت اجسام است، و اینکه چرا برخی از آنچه ظاهر شده است، نزد کسی قبیح است، و چرا کسی که همه آن را زیبا می‌بیند، آن را زیبا دیده است و با چه چشمی آن را دیده است. پس او با افعال نیکو از ذات خود با آن مقابله می‌کند. و این علم از بهترین و نافع‌ترین علوم در جهان است. و این همان علمی است که برخی از متکلمان در مورد آن می‌گویند: فاعلی جز خدا نیست و افعال او همه نیکوست. پس این‌ها از افعال خدا قبیح نمی‌دانند مگر آنچه را که خدا قبیح دانسته است. پس آن برای خداوند است نه برای آن‌ها. و اگر آنچه را که خدا قبیح دانسته، قبیح نمی‌دانستند، با خداوند عز و جل منازعه می‌کردند.\n\nو در آن، علم آنچه خداوند در جهان بر سبیل تعجب قرار داده است، است. و آن نیست مگر آنچه عادت را شکسته است. اما کسانی که از خداوند تعقل می‌کنند، هر چیزی در عادت نزد آن‌ها تعجب‌آور است. اما اصحاب عادات، نزد آن‌ها تعجبی نیست مگر در آنچه شکستن عادت در آن ظاهر شده است.\n\nو در آن، علم تشوق به معالی امور (امور والا) از جبلت نفوس است، و اینکه معالی امور به چه چیزی دانسته می‌شود، آیا به عقل یا به شرع؟ و معالی امور چیست؟ و آیا آن امری است که عقلا را عمومیت می‌دهد یا آن چیزی است که زید از معالی امور می‌بیند و عمرو آن را با آن صفت نمی‌بیند، پس اضافی است؟\n\nو در آن، علم دخول اطول (درازتر) در اقصر (کوتاه‌تر) است، و آن وارد کردن بزرگ بر کوچک است.\n\nو در آن، علم احکام حق (الحق) در خلق است، هنگامی که ظاهر می‌شود و هنگامی که باطن می‌شود، و از کدام حقیقت، اتصاف به ظهور و بطون پذیرفته می‌شود.\n\nو در آن، علم حیرتی است که برای کسی که وارد آن شود، ممکن نیست که از آن خارج شود.\n\nو در آن، علم کسی است که امری را بر خلاف آنچه آن امر در نفس خود بر آن است، می‌بیند، و آیا برای صاحب این علم صحیح است که بین دو امر جمع کند یا خیر.\n\nو در آن، علم وسعت برزخ‌ها و تنگی آن‌ها است.\n\nو در آن، علم اثر اعتدال و انحراف در آنچه از آن منحرف می‌شود یا با آن مقابله می‌کند، است.\n\nو در آن، علم احوال در جهان است، و آیا آن‌ها در غیر جهان اثری دارند یا در آن اثری ندارند.\n\nو در آن، علم آنچه نزد انسان کامل (الإنسان الکامل) عظیم شمرده می‌شود و چیزی عظیم‌تر از آن نیست، و اینکه چرا آنچه نزد او عظیم شمرده می‌شود، باز می‌گردد تا در او حالتی تأثیر بگذارد که مقام او اقتضای آن را ندارد، و آیا آن علم برای او از مشاهده حاصل شده است یا از فکر.\n\nو در آن، علم این است که آیا برای وکیل مطلق‌العنان که وکالت به او تفویض شده است، صحیح است که در مال موکل خود تصرفی مانند تصرف مالک مال از همه جهات داشته باشد یا حدی دارد که در حکم شرع باید نزد آن توقف کند.\n\nو در آن، علم حکمت طلب اولیاء برای پوشاندن مقام خود است، بر خلاف انبیاء (علیهم صلوات الله).\n\nو در آن، علم سیاست در تعلیم است، به طوری که معلم، علم را به متعلم برساند، بدون اینکه متعلم احساس کند که معلم قصد افاده آنچه نزد او از علم حاصل شده است را داشته است. پس متعلم به او می‌گوید: ای استاد، از فعل شما چنین و چنان، همراه با چنین و چنان، علم وافر و صحیحی برای من حاصل شد و آن چنین است. و متعلم خیال می‌کند که علمی که از آن امر برای او حاصل شده است، مقصود معلم نبوده است، در حالی که در نفس الأمر مقصود معلم بوده است. پس متعلم به آنچه خداوند از زیرکی و فطانت به او عطا کرده است، خوشحال می‌شود، زیرا از حرکت استادش علمی را دانسته است که به گمان او، استادش قصد تعلیم آن را نداشته است.\n\nو در آن، علمی از علوم کشف (الکشف) است، و آن این است که صاحب کشف بداند که هر فرد یا گروهی، کم یا زیاد، ناگزیر باید یکی از رجال الغیب (مردان غیب) هنگام صحبت کردن با آن‌ها باشد. پس آن یک نفر اخبار آن‌ها را در جهان منتقل می‌کند و مردم آن را از نفوس خود در جهان می‌یابند. گروهی در خلوت جمع می‌شوند یا مرد با خود حدیثی می‌گوید که جز خدا کسی از آن خبر ندارد، پس او یا آن گروه خارج می‌شوند و آن را در میان مردم می‌شنوند و مردم درباره آن صحبت می‌کنند.\n\nمن ابیاتی از شعر را در مقصوره ابن مثنی در شرق مسجد جامع تونس در سرزمین افریقیه، هنگام نماز عصر در روز معلوم و معینی که تاریخ آن نزد من در شهر تونس ثبت است، سرودم. سپس به اشبیلیه آمدم، در حالی که بین آن دو، مسافت سه ماه راه کاروان بود. شخصی با من ملاقات کرد که مرا نمی‌شناخت، و به حکم اتفاق، عین همان ابیات را برایم خواند. و من آن را برای هیچ کس ننوشته بودم. به او گفتم: این ابیات از کیست؟ گفت: از محمد بن العربی، و نام مرا برد. گفتم: کی آن را حفظ کردی؟ او تاریخی را که من آن را سروده بودم و زمان آن را، با وجود این مسافت طولانی، ذکر کرد. گفتم: چه کسی آن را برایت خواند تا حفظ کردی؟ گفت: شبی در شرق اشبیلیه در مجلس گروهی در راه نشسته بودم. مرد غریبی که او را نمی‌شناختیم، از کنار ما گذشت، گویی از سیاحان بود. نزد ما نشست و با ما صحبت کرد، سپس این ابیات را برای ما خواند. ما آن را پسندیدیم و نوشتیم. به او گفتیم: این ابیات از کیست؟ گفت: از فلان، و نام مرا برای آن‌ها برد. گفتیم: این مقصوره ابن مثنی را در سرزمین خود نمی‌شناسیم. گفت: آن در شرق مسجد جامع تونس است و در همان ساعت آن را در آنجا سروده است. و من آن را از او حفظ کردم. سپس از ما غایب شد و ندانستیم امر او چیست و چگونه از ما رفت و او را ندیدیم.\n\nو روزی در مسجد جامع العدیس در اشبیلیه، پس از نماز عصر بودم و شخصی برای من از مرد بزرگی از اهل طریقت، از بزرگان آن‌ها، که در خراسان با او ملاقات کرده بود، سخن می‌گفت. و فضیلت او را برایم ذکر می‌کرد. ناگهان شخصی را دیدم که نزدیک ما نشسته است و گروهی که با من بودند او را نمی‌دیدند. او به من گفت: من همان شخصی هستم که این مرد که در خراسان با ما ملاقات کرده است، او را برای تو وصف می‌کند. به مرد خبر دهنده گفتم: آیا این مردی را که در خراسان دیدی، صفاتش را می‌شناسی؟ گفت: بله. پس شروع کردم به توصیف او با آثاری که در او بود و صفاتی در خلقتش. مرد گفت: به خدا قسم او بر همان صورتی است که وصف کردی. آیا او را دیده‌ای؟ گفتم: او همین جا نشسته است و آنچه را که تو از او خبر می‌دهی، نزد من تصدیق می‌کند. و من او را برای تو وصف نکردم مگر در حالی که به او نگاه می‌کردم. و او خود را به من معرفی کرد. و همچنان با من نشسته بود تا اینکه من منصرف شدم. او را طلب کردم، اما او را نیافتم.\n\nو اما ابیاتی که برایم خواند، این‌ها هستند:\n\n> مقصوره ابن مثنی *** أمسيت فيها معنى\n> در مقصوره ابن مثنی *** شب را در آن با معنایی گذراندم\n\n> بشادن تونسي *** حلوا للما يتمنى\n> با نوجوانی تونسی *** که شیرین است برای آنچه آرزو می‌شود\n\n> خلعت فيه عذاري *** فأصبح الجسم مضنى\n> در او پرده حیا را دریدم *** پس جسمم رنجور شد\n\n> سألته الوصل لما *** رأيته يتجنى\n> از او وصل خواستم هنگامی که *** دیدم ناز می‌کند\n\n> وهز عطفيه عجبا *** كالغصن إذ يتثنى\n> و دو پهلوی خود را با تعجب تکان داد *** مانند شاخه‌ای که خم می‌شود\n\n> وقال أنت غريب *** إليك يا هذا عنا\n> و گفت تو غریبه‌ای *** ای این، از ما دور شو\n\n> فذبت شوقا ويأسا *** ومت وجدا وحزنا\n> پس از شوق و یأس ذوب شدم *** و از عشق و اندوه مُردم\n\nو این پسر، احمد بن ادریسی نام داشت، از تجار شهر بود. پدرش مردی صالح بود که صالحان را دوست می‌داشت و با آن‌ها همنشین بود. خداوند او را موفق گرداند. و این مجلس بین من و او در سال پانصد و نود بود و ما اکنون در سال ششصد و سی و پنج هستیم.\n\nو در آن، علم آنچه از جدال ستوده است و آنچه از آن نکوهیده است، است. و برای مسلمانی که خود را به خدا منتسب می‌داند، شایسته نیست که جدال کند مگر در آنچه بر حق است، از طریق کشف (الکشف) نه از طریق فکر و نظر. پس هنگامی که آنچه درباره آن جدال می‌کند، برای او مشهود باشد، در آن هنگام جدال بر او واجب می‌شود، «بِالَّتِي هِيَ أَحْسَنُ» (به نیکوترین وجه)، اگر به امر الهی مأمور باشد. و اگر مأمور نباشد، مخیر است. اگر نفع غیر در آن برای او معین شود، مستحب است. و اگر از پذیرش شنوندگان ناامید شود، باید سکوت کند و جدال نکند. زیرا اگر جدال کند، در هلاکت شنوندگان نزد خدا می‌کوشد.\n\nو در آن، علم قول انسان است که «إنا مؤمن إن شاء الله» (من مؤمن هستم ان شاء الله)، با علم او در نفس خود در آن وقت که مؤمن است. و این مسئله‌ای است که برای کسی که در آن نظر کند، فایده عظیمی دارد و ادب با خدا را به او می‌آموزد، اگر گوینده آن از موضعی که خداوند آن را در آن قرار داده است، تجاوز نکند. و اگر از آن تجاوز کند و نزد آن توقف نکند، با خدا بدادبی کرده و طلبش موفق نمی‌شود.\n\nو در آن، علم چیزی است که امری را که قبلاً می‌دانستی و سپس فراموش کرده‌ای، به یاد تو می‌آورد.\n\nو در آن، علم افزایش و نقصان در زمان است، که چرا باز می‌گردد، و قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به عایشه در مورد ایلاء (سوگند) از زنانش: «قد يكون الشهر تسعا وعشرين» (ماه ممکن است بیست و نه روز باشد). و اینکه در حکم شرعی به چه چیزی باید اخذ کرد، آیا به کمترین چیزی که نام ماه بر آن اطلاق می‌شود یا به بیشتر آن.\n\nو در آن، علم ترجیح همنشینی اهل الله بر غافلان از خداست، هر چند ایمان آن‌ها را شامل شود.\n\nو در آن، علم آنچه شایسته جلال خداست که با آن معامله شود، چه جهان راضی باشد و چه خشمگین.\n\nو در آن، علم آب‌هاست، و آن علمی غریب است. و حد سیرابی از آبی که سیراب می‌کند، چیست؟ زیرا برخی از آب‌ها سیراب می‌کنند و برخی سیراب نمی‌کنند. و آبی که خداوند هر چیز زنده‌ای را از آن قرار داده است، چیست؟ آیا هر آبی است یا وصف خاصی از میان آب‌ها دارد؟ و وصف آبی که خداوند بنی آدم را از آن خلق کرده است، با پستی است، چنانکه فرمود: «خلقنا الإنسان من ماءٍ مَهِينٍ» (انسان را از آبی پست آفریدیم).\n\nو در آن، علم علامت کسی است که خداوند او را سعادتمند کرده است، از کسی که او را در زندگی دنیا شقاوت داده است.\n\nو در آن، علم این است که دنیا در نفس خود چیست، و حیات آن و زینت آن چیست.\n\nو در آن، علم آنچه باقی می‌ماند و آنچه فانی می‌شود، و آنچه از جهان فنا را می‌پذیرد و آنچه بقا را می‌پذیرد، است.\n\nو در آن، علم صورت احاطه به آنچه نامتناهی است، است. و آنچه نامتناهی است، به اینکه محاط به آن است، وصف نمی‌شود، زیرا دخول آن در الوجود (هستی) محال است.\n\nو در آن، علم احوال جن است و تکلیف حق (الحق) آن‌ها به شرایع نازل شده از نزد او، آیا تکلیفی است که حق آن‌ها را به آن ملزم کرده است از ابتدا، یا خودشان آن را بر خود ملزم کرده‌اند، پس حق آن‌ها را به آن ملزم کرده است، مانند نذر.\n\nو در آن، علم فرق بین فعل و مفعول است.\n\nو در آن، علم کسی است که اعانت در فعل را می‌پذیرد.\n\nو در آن، علم نحل (فرقه‌ها) و ملل (ادیان) است.\n\nو در آن، علم استحقاق است.\n\nو در آن، علم آنچه علم به آن نفعی ندارد، است.\n\nو در آن، علم علم غریب است، که نفوس به چه چیزی آن را می‌پذیرند و بیشتر از غیر آن به آن روی می‌آورند.\n\nو در آن، علم این است که آیا اعراض از علم صحیح است، با باقی ماندن آن به عنوان علم نزد اعراض کننده، یا شبهه‌ای نزد او در آن ایجاد می‌شود، پس از آن اعراض نمی‌کند تا اینکه علم بودن آن از او زائل شود. و این نزد محققین عارفین از پنهان‌ترین علوم است.\n\nو در آن، علم حجاب‌هایی است که بین چشم بصیرت و آنچه شایسته است آن را درک کند، حائل می‌شوند، اگر این حجاب‌ها نبودند.\n\nو در آن، علم حلم و فرق بین آن و عفو است. و علم غفور رحیم، آیا برزخی بین حلیم و عفو است و آیا برای آن دو در این مورد حکمی هست یا خیر.\n\nو در آن، علم این است که امور از مقادیر خود نزد خدا تجاوز نمی‌کنند.\n\nو در آن، علم چیزی است که بزرگان را از استثناء الهی در افعالشان غافل کرده است، مانند داستان سلیمان و موسی و غیر آن‌ها (علیهم السلام).\n\nو در آن، علم رد آنچه شایسته است به کسی که شایسته است، است. و آن بهترین علوم است، زیرا آسایش به ارث می‌گذارد و از اعتراض بر آن در امان می‌ماند. و خداوند داناتر است.\n\nو در آن، علم آنچه انسان از نفس خود می‌ستاید و از غیر خود انکار می‌کند و نکوهش می‌نماید، است.\n\nو در آن، علم وقوف بین دو جهان است، که حال واقف در آن چیست.\n\nو در آن، علم این است که حق (الحق) هیچ چیزی را ایجاد نکرده است مگر از سببی. پس هر کس اسباب را بردارد، جاهل است. و کسی که گمان می‌کند آن‌ها را برداشته است، آن‌ها را بر نداشته مگر به واسطه آن‌ها، زیرا برداشتن آنچه خداوند آن را تأیید کرده و حال الوجود (هستی) آن را می‌دهد، صحیح نیست. و فرق بین اسباب معتاد که برداشتن آن‌ها جایز است و اسباب معقول که برداشتن آن‌ها ممکن نیست، چیست.\n\nو در آن، علم کسی است که بر بندگان خدا احتیاط کرده است، که نزد خدا چه دارد.\n\nو در آن، علم اتخاذ شبهات به عنوان دلیل است، که چه چیزی آن‌ها را از شبهه بودن آن‌ها کور کرده است.\n\nو در آن، علم کسی است که از بندگان خدا در روز قیامت مهمل گذاشته می‌شود، از کسی که مهمل گذاشته نمی‌شود.\n\nو در آن، علم خواص است. و «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 14
}