{
  "id": 300,
  "title": {
    "ar": "الباب الموفي ثلاثمائة في معرفة منزل انقسام العالم العلوي من الحضرة المحمدية",
    "en": "Chapter Three Hundred: Concerning the Gnosis of the Station of the Division of the Higher Cosmos (العالم العلوي) from the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب موفی ثلاثمائة: عالم علوی کی تقسیم کی منزل کی معرفت (المعرفۃ) میں جو حقیقت محمدیہ (الحقیقۃ المحمدیۃ) سے ہے۔",
    "fa": "باب سیصد و یکم در معرفت منزل تقسیم عالم علوی از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الموفي ثلاثمائة في معرفة منزل انقسام العالم العلوي من الحضرة المحمدية»\n\n\n> حمل المحقق ما يلقيه خالقه *** فيه ليظهر ما في الغيب من خبر\n\n\n> تمتد منه إلى قلبي رقائقه *** مثل امتداد شعاع الشمس للبصر\n\n\n> فالضم واللثم والتعتيق يجمعنا *** مثل العرائس كالأنثى مع الذكر\n\n\n> على الدوام فلا صبح يفرقنا *** منزهين عن الآصال والبكر\n\n\n> من بيننا تظهر الأسرار في حجب *** الآفاق طالعة شمسا بلا غير\n\n\n> لا شرق يظهرها لا غرب يسترها *** لا عين تدركها من أعين البشر\n\n\n> زمانها الآن ماض فتفقده *** ولا بمستقل يأتي على قدر\n\n\n> فيا أولي الفكر والألباب قاطبة *** لا تعجبوا أنها نتيجة العمر\n\n\n> إني لحي بحي لا حياة له *** ولا حياة لنا في عالم السور\n\n\n> إن الحياة التي تجري إلى أمد *** هي الحياة التي في عالم الصور\n\n\n### [شرف الجماد على الإنسان‏]\n\n\nاعلم أن هذا المنزل يتضمن شرف الجماد على الإنسان وشرف الجن من المؤمنين في استماع القرآن على المؤمنين من الإنس لمعنى خلقهم الله عليه وخلقه فيهم قال تعالى لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ أ ترى هذا الكبر في الجرم وعظم الكمية هيهات لا والله فإن ذلك معلوم بالحس وإنما ذلك لمعنى أوجده فيهم لم يكن ذلك للإنسان يعطيه العلم بالمراتب ومقادير الأشياء عند الله تعالى فننزل كل موجود منزلته التي أنزله الله فيها من مخلوق وأسماء إلهية\n\n\n### [الأمانة الإلهي‏]\n\n\nومن ذلك قوله تعالى إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا أ ترى ذلك لجهلهم لا والله بل الحمل للأمانة كان لمجرد الجهل من الحامل وهل نعت الله بالجهل على المبالغة فيه وبالظلم لنفسه فيها ولغيره إلا الحامل لها وهو الإنسان فعلمت الأرض ومن ذكر قدر الأمانة وأن حاملها على خطر فإنه ليس على يقين من الله أن يوفقه لأدائها إلى أهلها وعلمت مراد الله بالعرض أنه يريد ميزان العقل فكان عقل الأرض والجبال والسماء أوفر من عقل الإنسان حيث لم يدخلوا أنفسهم فيما لم يوجب الله عليهم فإنه كان عرضا لا أمرا فتتعين عليهم الإجابة طوعا أو كرها أي على مشقة لمعرفتهم تعظيم ما أوجب الله عليهم فأتوا طائعين حين قال لهما ائْتِيا طَوْعاً أَوْ كَرْهاً أي تهيئا لقبول ما يلقى فيكما فلما أتيا طائعين وتهيئا لقبول ما شاء الحق أن يجعل فيهما مستسلمين خائفين فقدر في الأرض أقواتها وجعلها أمانة عندها حملها إياها جبرا لا اختيارا وأَوْحى في كُلِّ سَماءٍ أَمْرَها وجعل ذلك أمانة بيدها تؤديها إلى أهلها حملها إياها جبرا لا اختيارا ومن معرفتهم أيضا بما يعطيه حمل الأمانة بالعرض والاختيار من ظلم الحامل إياها لنفسه حيث عرض بها إلى أمر عظيم وإذا لم‏\nيوفق لأدائها كان ظالما لغيره ولنفسه وجهل الإنسان ذلك من نفسه ومن قدرها وإن كان عالما بقدرها فما هو عالم بما في علم الله فيه من التوفيق إلى أدائها بل هو جهول كما شهد الله فيه فكان قبول الإنسان الأمانة اختيارا لا جبرا فخان فيها لأنه وكل إلى نفسه وكان حمل الأرض والسماء لها جبرا لا اختيارا فوفقهما الله إلى أدائها إلى أهلها وعصما من الخيانة وخذل الإنسان‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من طلب الإمارة وكل إليها ومن أعطيها من غير طلب بعث الله أو وكل الله به ملكا يسدده‏\n\n\nومن شرف الأرض والسماء والجبال على الإنسان قول الله فيهم لَوْ أَنْزَلْنا هذَا الْقُرْآنَ عَلى جَبَلٍ لَرَأَيْتَهُ خاشِعاً مُتَصَدِّعاً من خَشْيَةِ الله أ ترى ذلك لجهله بما نزل عليه لا والله إلا بقوة علمه بذلك وقدره أ لا تراه عز وجل يقول لنا في هذه الآية كذلك يضرب الله الأمثال لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ فإنهم إذا تفكروا في ذلك علموا شرف غيرهم عليهم فإن شهادة الله بمقدار المشهود له بالتعظيم كالواقع منه لأنه قول حق وعلموا إذا تفكروا جهلهم بقدر القرآن حيث لم تظهر منهم هذه الصفة التي شهد الله بها للجبل‏\n\n\nخرج أبو نعيم الحافظ في دلائل النبوة أن الله بعث جبريل عليه السلام إلى نبيه صَلَّى اللهُ عَليهِ وسَلَّم بشجرة فيها كوكرى طائر فقعد جبريل في الواحد وقعد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الآخر وصعدت بهما الشجرة فلما قربا من السماء تدلى لهما أمر شبه الرفرف درا وياقوتا فأما جبريل فغشي عليه حين رآه وأما النبي صَلَّى اللهُ عَليهِ وسَلَّم فما غشى عليه ثم قال صَلَّى اللهُ عَليهِ وسَلَّم فعلمت فضل جبريل علي في العلم لأنه علم ما هو ذلك فغشي عليه وما علمت‏\n\n\nفاعترف صَلَّى اللهُ عَليهِ وسَلَّم فلو علم الإنسان قدر القرآن وما حمله لما كانت حالته هكذا فانظر إلى ما كان يقاسي صَلَّى اللهُ عَليهِ وسَلَّم في باطنه من حمله القرآن لمعرفته به وما أبقى الله عليه جسده وعصم ظاهره من أن يتصدع كالجبل لو أنزل عليه القرآن إلا لكون الله تعالى قد قضى بتبليغه إلينا على لسانه فلا بد أن يبقى صورته الظاهرة على حالها حتى نأخذه منه وكذلك بقاء صورة جبريل النازل به وإنما الكلام فينا ومن شرف من ذكرناه على الإنسان وشرف الإنسان إذا مات وصار مثل الأرض في الجمادية على حاله حيا في الإنسانية قول الله تعالى ولَوْ أَنَّ قُرْآناً سُيِّرَتْ به الْجِبالُ أَوْ قُطِّعَتْ به الْأَرْضُ أَوْ كُلِّمَ به الْمَوْتى يعني لكان هذا القرآن فحذف الجواب لدلالة الكلام عليه ومعنى ذلك لو أنزلناه على من ذكرناه لسارت الجبال وتقطعت الأرض وأجاب الميت وما ظهر شي‏ء من ذلك فينا وقد كلمنا به‏\n\n\n### [شرف الجن على الإنس‏]\n\n\nومن شرف الجن علينا\n\n\nأن النبي صَلَّى اللهُ عَليهِ وسَلَّم حين تلا على أصحابه سورة الرحمن وهم يسمعون فقال لهم لقد تلوتها على إخوانكم من الجن فكانوا أحسن استماعا لها منكم وذكر الحديث وفيه فما قلت لهم فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ إلا قالوا ولا بشي‏ء من آلائك ربنا نكذب‏\n\n\nفانظر ما أعلمهم بحقائق ما خوطبوا كيف أجابوا بنفس ما خوطبوا به حتى بالاسم الرب ولم يقولوا يا إلهنا ولا غير ذلك ولم يقولوا ولا بشي‏ء منها وإنما قالوا من آلائك كما قيل لهم لاحتمال أن يكون الضمير يعود على نعمة مخصوصة في تلك الآية وهم يريدون جميع الآلاء حتى يعم التصديق فيلحق الإنسان بهؤلاء كلهم من حيث طبيعته لا من حيث لطيفته بما هي مدبرة لهذا الجسم ومتولدة عنه فيدخل عليها الخلل من نشأتها فجسده كله من حيث طبيعته طائع لله مشفق وما من جارحة منه إذا أرسلها العبد جبرا في مخالفة أمر إلهي إلا وهي تناديه لا نفعل لا ترسلني فيما حرم عليك إرسالي إني شاهدة عليك لا تتبع شهوتك وتبرأ إلى الله من فعله بها وكل قوة وجارحة فيه بهذه المثابة وهم مجبورون تحت قهر النفس المدبرة لهم وتسخيرها فينجيهم الله تعالى دونه من عذاب يوم أليم إذا آخذه الله يوم القيامة وجعله في النار فأما المؤمنون الذين يخرجون إلى الجنة بعد هذا فيميتهم الله فيها إماتة كرامة للجوارح حيث كانت مجبورة فيما قادها إلى فعله فلا تحس بالألم وتعذب النفس وحدها في تلك الموتة كما يعذب النائم فيما يراه في نومه وجسده في سريره وفرشه على أحسن الحالات وأما أهل النار الذين قيل فيهم لا يموتون فيها ولا يحيون فإن جوارحهم أيضا بهذه المثابة أ لا تراها تشهد عليهم يوم القيامة فأنفسهم لا تموت في النار لتذوق العذاب وأجسامهم لا تحيا في النار حتى لا تذوق العذاب فعذابهم نفسي في صورة حسية من تبديل الجلود وما وصف الله من عذابهم كل ذلك تقاسيه أنفسهم فإنه قد زالت الحياة من جوارحهم فهم ينضجون كما ينضج اللحم في القدر أ تراه يحس بذلك بل له نعيم به إذا كان ثم حياة يجعل الله في ذلك نعيما وإلا ما تحمله النفوس كشخص يرى بعينه‏\nنهب ماله وخراب ملكه وإهانته فالملك مستريح بيد من صار إليه والأمير يعذب بخرابه وإن كان بدنه سالما من العلل والأمراض الحسية ولكن هو أشد الناس عذابا حتى أنه يتمنى الموت ولا يرى ما رآه وجميع ما ذكرناه إنما أخبرنا الله به لنتفكر ونتذكر ونرجع إليه سبحانه ونسأله أن يجعلنا في معاملته كمن هذه صفته فنلحق بهم وهو قد ضمن الإجابة لمن اضطر في سؤاله فيكون من الفائزين فأي شرف أعظم من شرف شخص قامت به صفة منحه الله إياها أسعده بها وجعل من خلقه على صورته يسأله تعالى أن يلحق بهم في تلك الصفة فقد علمت قدر كبره على خلق الناس ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ فكن يا أخي بما أعلمتك ونبهتك عليه من القليل الذي يعلم ذلك جعلنا الله منهم آمين بعزته‏\n\n\n### [أول وجود الكون بالسماع وآخر انتهائه من الحق السماع‏]\n\n\nومما يتضمن هذا المنزل السماع الإلهي وهو أول مراتب الكون وبه يقع الختام فأول وجود الكون بالسماع وآخر انتهائه من الحق السماع ويستمر النعيم في أهل النعيم والعذاب في أهل العذاب فأما في ابتداء كون كل مكون فإنما ظهر عن قول كن فأسمعه الله فامتثل فظهر عينه في الوجود وكان عدما فسبحان العالم بحال من قال له كن فكان فأول شي‏ء ناله الممكن مرتبة السماع الإلهي فإن كن صفة قول قال تعالى إِنَّما قَوْلُنا والسماع متعلقة القول وأما في الانتهاء في حق الكفار اخْسَؤُا فِيها ولا تُكَلِّمُونِ فخاطبهم وهم يسمعون وأما في حق أهل الجنة فبعد الرؤية والتجلي الذي هو أعظم النعم عندهم في علمهم فيقول هل بقي لكم شي‏ء فيقولون يا ربنا وأي شي‏ء بقي لنا نجيتنا من النار وأدخلتنا الجنة وملكتنا هذا الملك ورفعت الحجب بيننا وبينك فرأيناك وأي شي‏ء بقي يكون عندنا أعظم مما نلناه فيقول سبحانه رضاي عنكم فلا أسخط عليكم أبدا فأخبرهم بالرضا ودوامه وهم يسمعون قال فذلك أعظم نعيم وجدوه فختم بالسماع كما بدأ ثم استصحبهم السماع دائما ما بين بدايتهم وغاية مراتب نعيمهم فطوبى لمن كانت له أُذُنٌ واعِيَةٌ لما يورده الحق في خطابه فالعارف المحقق في سماع أبدا إذ لا متكلم عنده إلا الله بكل وجه فمن خاطبه من المخلوقين يجعل العارف ذلك مثل خطاب الرسول عن الحق فيتأهب لقبول ما خاطبه به ذلك الشخص وينظر ما حكمه عند الله الذي قرره شرعا فيأخذه على ذلك الحد قال تعالى فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله والمتكلم به إنما كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فليس أحد من خلق الله يجوز أن يخبر عن نفسه ولا عن غيره وإنما إخبار الجميع عن الله فإنه سبحانه هو الذي يخلق فيهم بكن ما يخبرون به فالكل كلماته فليس للعبد على الحقيقة إلا السماع وكلام المخلوق سماع فلا يرمي العارف ولا يهمل شيئا من كلام المخلوقين وينزله منزلته خبيثا ومنكرا وزورا كان ذلك القول في حكم الشرع أو طيبا ومعروفا وحقا\n\n\nفالعارف يقبله وينزله في المنزلة التي عينها الله على لسان الشرع والحكمة لذلك القول ومن علوم هذا المنزل الغمام الذي يقع الإتيان فيه في تجلى القهر والرحمة وهو حين تَشَقَّقُ السَّماءُ بِالْغَمامِ أي بسبب الغمام أي لتكون غماما فتفتح أبوابا كلها فتصير غماما وقد كان الملائكة عمارها وهي سماء فيكونون فيها وهي غمام وفيها يأتون يوم القيامة إلى الحشر التقديري والملائكة في ظُلَلٍ من الْغَمامِ والظلل أبوابها يقول الله في ذلك وفُتِحَتِ السَّماءُ فَكانَتْ أَبْواباً وقال ويَوْمَ تَشَقَّقُ السَّماءُ بِالْغَمامِ ونُزِّلَ الْمَلائِكَةُ تَنْزِيلًا وهو إتيانهم في ذلك الغمام لإتيان الله للقضاء والفصل بين عباده يوم القيامة فالعارف إذا شقت سماؤه بالغمام وتنزلت قواه في ذلك الغمام وأتى الله للفصل والقضاء في وجوده في دار دنياه فقد قامت قيامته واستعجل حسابه فيأتي يوم القيامة آمنا لا خوف عليه ولا يحزن لا في الحال ولا في المستقبل ولهذا أتى سبحانه بفعل الحال في قوله ولا هُمْ يَحْزَنُونَ فإن هذا الفعل يرفع الحزن في الحال والاستقبال بخلاف الفعل الماضي والمخلص للاستقبال بالسين أو سوف‏\n\n\n### [أن للأرض في كل نفس ثلاثة أحوال‏]\n\n\nواعلم أن الأرض في كل نفس لها ثلاثة أحوال قبول الولد والمخاض والولادة ما لم تقم القيامة والإنسان من حيث طبيعته مثل الأرض فينبغي له أن يعرف في كل نفس ما يلقي إليه فيه ربه وما يخرج منه إلى ربه وما هو فيه مما ألقى فيه ولم يخرج منه مع تهيئة للخروج فإنه مأمور بمراقبة أحواله مع الله في هذه الثلاث المراتب والأحوال وإلقاء الله إليه تارة بالوسائط وتارة بترك الوسائط والواسطة تارة تكون محمودة وتارة مذمومة وتارة لا محمودة ولا مذمومة وإن كانت تؤدي هذه الحالة إلى الندم والغبن فالمحقق يسمع ويأخذ ويعرف ممن يسمع وممن يأخذ وما يلد ومن يقبل ولده إذا ولد ومن يربيه هل يربيه ربه أو غير ربه كما\n\n\nورد في الخبر الصحيح أن الصدقة وهي مما يلدها العبد\nتقع بيد الرحمن فالرحمن قابلها فيربيها كما يربي أحدكم فلوه أو فصيله‏\n\n\nولم يقل كما يربي أحدكم ولده فإن الولد قد لا ينتفع به إذا كان ولد سوء فالنفع بالولد غير محقق بل ربما يطرأ عليه منه من الضرر بحيث أن يتمنى أن الله لم يخلقه والفلو والفصيل ليس كذلك فإن المنفعة بهما محققة ولا بد إما بركوبه أو بما يحمل عليه أو بثمنه أو بلحمه يأكله إن احتاج إليه فشبهه سبحانه بما يتحقق الانتفاع به ليعلم المصدق أنه ينتفع بصدقته ولا بد وأول الانتفاع بها إنها تظله يوم القيامة من حر الشمس حتى يقضى بين الناس ومما يلده الإنسان الكلمة الطيبة وقد قال صَلَّى اللهُ عَليهِ وسَلَّم إن الكلمة الطيبة صدقة\n\n\nفتربي أيضا له ويتولى الحق بنفسه تربية كل ما يلده العبد من النكاح لا من السفاح وإذا كان الملك يتولى تربية ولد عبده بنفسه هل يقدر ما يصل إليه من الخير من جهة ولده فأول ذلك إن الولد يعرف منزلة أبيه من الملك وإنه ما رباه الملك وأكرمه بذلك إلا لعلو رتبة أبيه عنده فيرى المنة لأبيه عليه بذلك فيكون بارا به محسنا إليه بنفسه إعظاما لمرتبة الملك وعنايته بأبيه وعلى هذا تجري أفعال العارفين من عباده وكل ما تكلمنا فيه من هذا المنزل فهو من خارج بابه لم نتعرض لما يحوي عليه لضيق الوقت وطلب الاختصار وما اتفق لي مثل هذا في العبارة عن غيره من المنازل لأني وجدت عند باب هذا المنزل صور علم ما ذكرته ولم نستوف جميع ما رأيته على بابه فكان هذا القدر مما في هذا المنزل كالغلمان والحدادين والحجاب الذين على باب الملك وأما فهرست ما يتضمنه هذا المنزل فهو معرفة العالم العلوي والسفلي بين الدارين وعلم إبراز الغيوب من خلف الحجب ولما ذا حجبت ولما ذا أخرجت وما أخرج منها وما بقي وما ينتظر إخراجه من ذلك وما لا يصح إخراجه مما هو ممكن أن يخرج فمنعه مانع فما ذلك المانع وهل يخرج عن سماع أو عن غير سماع وإذا كان عن سماع فعن كراهة أو عن محبة وسرور أو ينقسم إلى هذا وإلى هذا بحسب الأحوال التي تعطيها الأوقات ومن علوم هذا المنزل أيضا علم الزيادة في الشي‏ء من نفسه لا من غيره كنشر المطوي وبسط المقبوض وعلم إخراج الكنوز المحسوسة بالأسماء وما تعطيه من الخواص في ذلك بحيث أن يقف العارف بذلك على موضع الكنز فيتكلم بالاسم فيشق الأرض عن المال المكنوز فيها كما تنشق الكمامة عن الزهرة فإذا أبصرها تكلم باسم آخر فيخرج المال بتلك الخاصية كما ينجذب الحديد إلى المغناطيس حتى لا يبقى من ذلك المال في ذلك الموضع شي‏ء ويتضمن علم الأعمال المشروعة وأين ما لها وما يلقاه منها ويتضمن علم السعادة والشقاء بالعلامات ويتضمن علم الجهات ولما ذا ترجع واتصاف الحق بالفوقية هل هي فوقية جهة أو فوقية رتبة ويتضمن معرفة أحوال الناس في منازلهم التي ينزلونها في الدار الآخرة وما سبب تلك الأحوال التي يتقلبون فيها في تلك المنازل وهل تتكرر عليهم بأعيانها في أزمنتها التي كانت فيها أم لا ويتضمن رؤية الله عباده لآية نسبة ترجع ويتضمن شرف الكواكب والزمان من غير مفاضلة ويتضمن علم نفي الايمان مع وجود العلم وهذا من أقلق الأمور عند المحقق وفيها علم البشري وإنها لا تختص بالسعداء في الظاهر وإن كانت مختصة بالخير فقوله تعالى فَبَشِّرْهُمْ بِعَذابٍ أَلِيمٍ والكلام على هذه البشرى لغة وعرفا فأما البشرى من طريق العرف فالمفهوم منها الخير ولا بد ولما كان هذا الشقي ينتظر البشرى في زعمه لكونه يتخيل أنه على الحق قيل بشره لانتظاره البشرى ولكن كانت البشرى له بعذاب أليم وأما من طريق اللغة فهو إن يقال له ما يؤثر في بشرته فإنه إذا قيل له خير أثر في بشرته بسط وجه وضحكا وفرحا واهتزاز أو طربا وإذا قيل له شر أثر في بشرته قبضا وبكاء وحزنا وكمدا واغبرارا وتعبيسا ولذلك قال تعالى وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضاحِكَةٌ مُسْتَبْشِرَةٌ ووُجُوهٌ يَوْمَئِذٍ عَلَيْها غَبَرَةٌ تَرْهَقُها قَتَرَةٌ فذكر ما أثر في بشرتهم فلهذا كانت البشرى تنطلق على الخير والشر لغة وأما في العرف فلا ولهذا أطلقها الله تعالى ولم يقيدها فقال في حق المؤمنين لَهُمُ الْبُشْرى في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ ولم يقل بما ذا فإن العرف يعطي أن ذلك بالخير وقرينة الحال وفيه العلم بالأبد ولما ذا يرجع وهل الأبد زماني أو هو عين الزمان وبما ذا يبقى الزمان هل يبقى بنفسه أو يبقى بغيره يكون له ذلك الغير كهو معنا ظرفا لبقائه ودوامه أو هو أمر متوهم ليس له وجود حقيقي عيني والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "## Chapter Three Hundred: Concerning the Knowledge of the Station of the Division of the Higher World from the Muhammadan Presence (الحضرة المحمدية)\n\nThe Verifier (المحقق) carries what his Creator casts\nInto him, so that what is hidden in the Unseen (الغيب) may appear as news.\n\nIts subtleties (رقائقه) extend from Him to my heart,\nLike the extension of the sun’s ray to the sight.\n\nThus, embracing, kissing, and ancientness unite us,\nLike brides, as the female with the male.\n\nEternally, no morning separates us,\nPurified (منزهين) from evenings and dawns.\n\nFrom between us, the secrets (الأسرار) appear in the veils\nOf the horizons, rising as a sun without otherness.\n\nNo East reveals it, no West conceals it,\nNo eye of human beings perceives it.\n\nIts time is now past, so seek it out,\nNor is it independent, coming according to measure.\n\nO possessors of thought and intellects (الألباب) altogether,\nDo not wonder that it is the result of a lifetime.\n\nIndeed, I am alive by the Living One (الحي) who has no life,\nAnd we have no life in the world of walls.\n\nVerily, the life that flows toward a limit\nIs the life that is in the world of forms (عالم الصور).\n\n### [The Nobility of Inanimate Objects over Man]\n\nKnow that this station includes the nobility of inanimate objects (الجماد) over man, and the nobility of the believing Jinn in hearing the Qur’an over believing mankind, due to a meaning upon which Allah created them and which He created within them. Allah the Exalted said: <<لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ>> (The creation of the heavens and the earth is greater than the creation of mankind, but most of mankind know not). Do you think this greatness (كبر) refers to physical bulk and vast quantity? Far from it! By Allah, that is known by the senses. Rather, that greatness is due to a meaning (معنى) which He established in them, which was not established for man, granting them Knowledge (العلم) of the Levels (المراتب) and the measures of things before Allah the Exalted. Thus, we place every existent thing in the station (منزلته) in which Allah has placed it, whether it be a created thing or a Divine Name (أسماء إلهية).\n\n### [The Divine Trust]\n\nAmong the proofs of this is the saying of Allah the Exalted: <<إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا>> (Indeed, We offered the Trust (الأمانة) to the heavens and the earth and the mountains, but they refused to bear it and were afraid of it. But man carried it. Indeed, he was ever unjust and ignorant). Do you think that was due to their ignorance? No, by Allah! Rather, the bearing of the Trust (الأمانة) was due solely to the ignorance (الجهل) of the carrier. And whom did Allah describe with ignorance, emphasizing it, and with injustice (الظلم) to himself and others concerning it, except the carrier, who is man?\n\nThus, the earth and those mentioned knew the magnitude of the Trust and that its carrier was in danger, for he was not certain that Allah would grant him success (توفيق) in fulfilling it to those to whom it was due. They knew that Allah’s intent in the offer (العرض) was to test the balance of the intellect (ميزان العقل). Therefore, the intellect (عقل) of the earth, the mountains, and the heaven was more complete than the intellect of man, as they did not involve themselves in what Allah had not made obligatory upon them. For it was an offer, not a command (أمر) that would necessitate their response, whether willingly or unwillingly—that is, with difficulty, due to their knowledge of the magnitude of what Allah had made obligatory upon them.\n\nSo, they came willingly when He said to them both: <<ائْتِيا طَوْعاً أَوْ كَرْهاً>> (Come willingly or unwillingly)—meaning, prepare yourselves to accept what is cast into you. When they came willingly and prepared themselves to accept what the Real (الحق) willed to place in them, submitting and fearful, He decreed its provisions (أقواتها) in the earth and made that a Trust (أمانة) with it, which it carried by compulsion (جبراً), not by choice (اختياراً). And He <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (revealed in every heaven its command), making that a Trust in its hand, which it delivers to those to whom it is due, carrying it by compulsion, not by choice.\n\nIt was also from their knowledge of what the bearing of the Trust by offer and choice entails—namely, the injustice (ظلم) of the carrier to himself, since he exposed himself to a tremendous matter. If he is not granted success in fulfilling it, he is unjust to others and to himself. Man, however, was ignorant of this concerning himself and its magnitude, even if he knew its worth. He was not aware of what was in Allah’s Knowledge concerning his success in fulfilling it; rather, he was ignorant (جهول), as Allah testified concerning him. Thus, man’s acceptance of the Trust was by choice, not compulsion, and he betrayed it (خان فيها) because he was entrusted to his own self. The bearing of the Trust by the earth and the heaven was by compulsion, not choice, so Allah granted them success in fulfilling it to those to whom it was due and preserved them from betrayal, while man was forsaken.\n\nThe Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) said: \"Whoever seeks authority (الإمارة) is entrusted to it, and whoever is given it without seeking it, Allah sends or entrusts an angel to guide him.\"\n\nAmong the proofs of the nobility of the earth, the heaven, and the mountains over man is the saying of Allah concerning them: <<لَوْ أَنْزَلْنا هذَا الْقُرْآنَ عَلى جَبَلٍ لَرَأَيْتَهُ خاشِعاً مُتَصَدِّعاً من خَشْيَةِ الله>> (Had We sent down this Qur’an upon a mountain, you would have seen it humbled and split apart from the fear of Allah). Do you think that was due to its ignorance of what was revealed to it? No, by Allah! It was only due to the strength of its Knowledge (علم) of that and its magnitude. Do you not see that He, the Mighty and Majestic, says to us in this verse: <<كَذَلِكَ يَضْرِبُ اللهُ الْأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ>> (Thus does Allah present examples for the people that perhaps they will give thought)? For if they reflect upon this, they will know the nobility of others over themselves, since Allah’s testimony to the magnitude of what is witnessed by veneration is like a reality occurring from it, because it is the word of the Real (قول حق). And if they reflect, they will know their own ignorance of the Qur’an’s magnitude, since this quality, which Allah testified to for the mountain, did not appear from them.\n\nAbu Nu'aym al-Hafiz narrated in *Dala'il al-Nubuwwa* that Allah sent Gabriel (عليه السلام) to His Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) with a tree containing a bird’s nest. Gabriel sat in one part, and the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) sat in the other. The tree ascended with them. When they approached the heaven, something like a curtain (الرفرف) of pearls and rubies was lowered for them. As for Gabriel, he fainted (غشي عليه) when he saw it. As for the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم), he did not faint. Then the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said: \"I knew the superiority of Gabriel over me in Knowledge (العلم), because he knew what that was, so he fainted, but I did not know.\"\n\nThus, the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) acknowledged this. If man knew the magnitude of the Qur’an and what he carried, his state would not be thus. Look at what the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) endured internally from carrying the Qur’an due to his Knowledge (معرفته) of it. Allah only preserved his body and protected his exterior from splitting apart like the mountain—had the Qur’an been revealed upon it—because Allah had decreed its conveyance to us through his tongue. Therefore, his apparent form had to remain as it was until we received it from him. Likewise, the form of Gabriel who descended with it was preserved.\n\nThe discussion, however, is about us. Among the proofs of the nobility of those we mentioned over man, and the nobility of man when he dies and becomes like the earth in its inanimate state, yet remains alive in his humanity, is the saying of Allah the Exalted: <<ولَوْ أَنَّ قُرْآناً سُيِّرَتْ به الْجِبالُ أَوْ قُطِّعَتْ به الْأَرْضُ أَوْ كُلِّمَ به الْمَوْتى>> (And if there were a Qur’an by which the mountains could be moved, or the earth could be cut into pieces, or the dead could be made to speak)—meaning, it would be this Qur’an. The answer was omitted because the context indicates it. The meaning is: Had We revealed it to those mentioned, the mountains would have moved, the earth would have been cut into pieces, and the dead would have responded. Yet, none of that appeared in us, though we have been addressed by it.\n\n### [The Nobility of the Jinn over Mankind]\n\nAmong the proofs of the nobility of the Jinn over us is that when the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) recited Surah Ar-Rahman to his companions while they listened, he said to them: \"I recited it to your brothers among the Jinn, and they listened to it better than you.\" He mentioned the Hadith, which includes: \"I did not say to them <<فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ>> (Then which of the favors of your Lord will you deny?) except that they said: 'Nor by anything of Your favors, our Lord, do we deny.'\"\n\nObserve how knowledgeable they were of the realities (حقائق) of the address, how they responded with the very words they were addressed with, even using the Name *Rabb* (Lord). They did not say, \"O our God,\" or anything else. And they did not say, \"Nor by anything of them,\" but rather, \"of Your favors (من آلائك),\" just as it was said to them, due to the possibility that the pronoun refers to a specific blessing in that verse, while they intended all favors (الآلاء) so that their affirmation would be comprehensive.\n\nMan, however, is attached to all these creatures through his nature (طبيعة), not through his subtle soul (لطيفته) insofar as it manages this body and is generated from it, allowing corruption to enter from its origin (نشأتها). His entire body, by its nature, is obedient to Allah and fearful (مشفق). There is no limb of his that the servant sends by compulsion into opposition to a Divine command except that it calls out to him: \"We will not do it! Do not send me into what is forbidden for you to send me! I am a witness against you! Do not follow your desire!\" And it disavows his action with it. Every power and limb in him is of this nature.\n\nThey are compelled (مجبورون) under the subjugation of the soul (النفس) that manages them and its coercion. Allah will save them, apart from the soul, from a painful torment (عذاب أليم) when He holds the soul accountable on the Day of Resurrection and places it in the Fire.\n\nAs for the believers who exit to Paradise after this, Allah grants them a death of honor (إماتة كرامة) while they are in the Fire, for the sake of the limbs, since they were compelled in what the soul led them to do. Thus, they do not feel pain, and the soul alone is tormented in that death, just as a sleeper is tormented by what he sees in his sleep while his body is in his bed and on his mattress in the best of states.\n\nAs for the people of the Fire, concerning whom it is said <<لَا يَمُوتُونَ فِيهَا وَلَا يَحْيَوْنَ>> (They will neither die therein nor live), their limbs are also of this nature. Do you not see that they testify against them on the Day of Resurrection? Their souls do not die in the Fire so that they may taste the torment, and their bodies do not live in the Fire so that they may not taste the torment. Their torment is psychological (نفسي) in a sensory form (صورة حسية), such as the changing of the skins and all that Allah described of their torment—all of which their souls endure. For life has departed from their limbs, and they are merely cooked (ينضجون) like meat in a pot. Do you think the meat feels that? Rather, it finds bliss in it if there is life, which Allah places therein as bliss. Otherwise, it is the souls that bear it, like a person who sees with his own eyes his wealth plundered, his property ruined, and himself humiliated. The property is at rest in the hands of whoever acquired it, but the owner is tormented by its ruin, even if his body is free from physical ailments and diseases. Yet, he is the most severely tormented person, to the point that he wishes for death and not to see what he has seen.\n\nAll that we have mentioned, Allah only informed us of it so that we may reflect (نتفكر), remember (نتذكر), and return to Him, the Glorified, and ask Him to make us, in our dealings with Him, like those whose description is such, so that we may join them. He has guaranteed the answer to whoever is compelled in his request, so that he may be among the successful. What nobility is greater than the nobility of a person who possesses a quality granted to him by Allah, by which He makes him felicitous, and who asks the Exalted to join him with those of His creation who are upon His image in that quality? You have known the magnitude of His greatness over the creation of mankind, <<ولَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ>> (but most of mankind know not). So, be, my brother, among the few who know this, by what I have informed you and alerted you to. May Allah make us among them, Amen, by His Might.\n\n### [The Beginning and End of Cosmic Existence is through Hearing]\n\nThis station also includes the Divine Hearing (السماع الإلهي), which is the first of the Levels (المراتب) of the Cosmos (الكون), and by which the conclusion occurs. The first Existence (وجود) of the Cosmos is through Hearing, and its final end from the Real (الحق) is Hearing. Bliss continues for the people of bliss, and torment for the people of torment.\n\nAs for the beginning of the existence of every created thing, it only appeared from the saying *Kun* (Be!), which Allah caused it to hear, so it complied, and its fixed entity (عينه) appeared in Existence (الوجود), having been non-existent. Glory be to the Knower of the state of him to whom He said *Kun*, and he was! The first thing the possible thing attained was the Level of Divine Hearing (مرتبة السماع الإلهي), for *Kun* is the Attribute of Speech (صفة قول). The Exalted said: <<إِنَّما قَوْلُنا>> (Indeed, Our word). And Hearing is related to Speech.\n\nAs for the end, concerning the disbelievers: <<اخْسَؤُا فِيها ولا تُكَلِّمُونِ>> (Remain scorned therein and do not speak to Me). He addresses them, and they hear.\n\nAs for the people of Paradise, after the Vision (الرؤية) and the Theophany (التجلي), which is the greatest of blessings in their Knowledge (علمهم), He says: \"Is there anything remaining for you?\" They say: \"O our Lord, what could remain for us? You saved us from the Fire, admitted us to Paradise, granted us this dominion, and lifted the veils between us and You, so we saw You. What greater thing could we attain?\" Then the Glorified says: \"My satisfaction (رضاي) with you, so I shall never be angry with you.\" He informs them of satisfaction and its permanence, and they hear. He said that this is the greatest bliss they find. Thus, it concludes with Hearing, just as it began.\n\nAnd Hearing accompanies them constantly between their beginning and the ultimate level of their bliss. Blessed is he who has <<أُذُنٌ وَاعِيَةٌ>> (a retaining ear) for what the Real (الحق) conveys in His address.\n\nThe Gnostic Verifier (العارف المحقق) is always in a state of Hearing, for he sees no speaker but Allah in every aspect. When any creature addresses him, the Gnostic treats that like the address of the Messenger conveying from the Real (الحق). He prepares himself to accept what that person addresses him with and examines its ruling according to Allah, which the Law (الشرع) has established, and takes it according to that limit. The Exalted said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله>> (Then grant him protection until he hears the Word of Allah). Yet, the speaker was only the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم).\n\nNo one among Allah’s creation is permitted to speak about himself or about others. Rather, the reporting of all is about Allah, for He, the Glorified, is the One who creates in them, by *Kun*, what they report. Thus, all are His Words. The servant, in reality, has nothing but Hearing, and the speech of the creature is Hearing. The Gnostic does not discard or neglect anything of the speech of creatures, but places it in its proper station (منزلته), whether that speech is wicked, reprehensible, or false according according to the ruling of the Law, or whether it is good, known, and true.\n\nThe Gnostic accepts it and places it in the station that Allah has designated for that speech through the tongue of the Law and Wisdom.\n\nAmong the sciences of this station is the Cloud (الغمام) in which the Divine approach (الإتيان) occurs in the Theophany (التجلي) of Wrath and Mercy. This is when <<تَشَقَّقُ السَّماءُ بِالْغَمامِ>> (the heaven splits open with the clouds)—meaning, because of the clouds, or so that it may become clouds. Its gates all open and become clouds, and the angels, who are its inhabitants, are within it while it is a cloud. In it, they approach the estimated Gathering (الحشر التقديري) on the Day of Resurrection, and <<وَالْمَلَائِكَةُ فِي ظُلَلٍ مِنَ الْغَمَامِ>> (and the angels [will come] in canopies of clouds). The canopies (الظلل) are its gates. Allah says concerning this: <<وَفُتِحَتِ السَّمَاءُ فَكَانَتْ أَبْوَابًا>> (And the heaven was opened and became [as] gates). And He said: <<وَيَوْمَ تَشَقَّقُ السَّمَاءُ بِالْغَمَامِ وَنُزِّلَ الْمَلَائِكَةُ تَنْزِيلًا>> (And the Day the heaven will split open with [i.e., because of] the clouds, and the angels will be sent down in [successive] descent). This is their approach in that Cloud for the approach of Allah to judge and decide between His servants on the Day of Resurrection.\n\nThe Gnostic, when his heaven splits open with the Cloud, and his powers descend in that Cloud, and Allah approaches to judge and decide in his Existence (وجوده) in the abode of his world, his Resurrection (قيامته) has already occurred, and his reckoning has been hastened. He will come on the Day of Resurrection secure, having no fear, nor will he grieve, neither in the present nor in the future. For this reason, the Glorified used the present tense in His saying <<وَلَا هُمْ يَحْزَنُونَ>> (nor will they grieve), for this verb negates grief in the present and the future, unlike the past tense or the future tense marked by *sa* or *sawfa*.\n\n### [That the Earth Has Three States in Every Breath]\n\nKnow that the Earth, in every breath (نفس), has three states: acceptance of the child (قبول الولد), labor (المخاض), and birth (الولادة), unless the Resurrection occurs. Man, by his nature (طبيعته), is like the Earth. It is incumbent upon him to know, in every breath, what his Lord casts into him, what issues forth from him to his Lord, and what remains within him from what was cast into him but has not yet issued forth, while preparing for its emergence. For he is commanded to observe his states with Allah in these three Levels (المراتب) and states.\n\nAllah’s casting into him is sometimes through intermediaries (الوسائط) and sometimes without them. The intermediary is sometimes praiseworthy, sometimes blameworthy, and sometimes neither praiseworthy nor blameworthy, even if this state leads to regret and loss.\n\nThe Verifier (المحقق) hears, takes, and knows from whom he hears, from whom he takes, what he gives birth to, who accepts his offspring when it is born, and who raises it—whether his Lord raises it or someone other than his Lord.\n\nIt is mentioned in the authentic report (الخبر الصحيح) that charity (الصدقة), which is something the servant gives birth to, falls into the Hand of the All-Merciful (الرحمن), and the All-Merciful accepts it and raises it, just as one of you raises his foal (فلوه) or his young camel (فصيله).\n\nHe did not say, \"just as one of you raises his child,\" for the child may not benefit him if he is an evil child. The benefit of the child is not guaranteed; rather, harm may befall him from the child to the extent that he wishes Allah had not created him. The foal and the young camel are not like that, for the benefit from them is guaranteed and necessary, whether through riding, carrying burdens, their price, or their meat if he needs it. Thus, the Glorified likened it to that from which benefit is realized, so that the giver of charity knows that he will inevitably benefit from his charity. The first benefit is that it will shade him on the Day of Resurrection from the heat of the sun until judgment is passed among the people.\n\nAmong what man gives birth to is the Good Word (الكلمة الطيبة). The Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said: \"Indeed, the good word is charity.\"\n\nIt is also raised for him, and the Real (الحق) Himself undertakes the raising of everything the servant gives birth to through lawful union (النكاح), not through fornication (السفاح). If the King undertakes the raising of His servant’s offspring Himself, how can one estimate the good that reaches him through his offspring? The first of that is that the offspring knows the station of his father with the King, and that the King only raised him and honored him with that due to the high rank of his father with Him. Thus, he sees the favor of his father upon him in this, and he is dutiful (باراً) and kind (محسناً) to him personally, out of veneration for the King’s rank and His care for his father. The actions of the Gnostics (أفعال العارفين) among His servants proceed upon this principle.\n\nAll that we have discussed concerning this station is outside its door. We have not addressed what it contains due to the lack of time and the request for brevity. This has not happened to me in expressing the content of other stations, because I found at the door of this station the forms of the knowledge I mentioned. We have not exhausted all that I saw at its door. This amount of content in this station is like the servants, guards, and doorkeepers (الغلمان والحدادين والحجاب) at the King’s gate.\n\nAs for the index (فهرست) of what this station contains, it is the knowledge of the Higher World (العالم العلوي) and the Lower World (السفلي) between the two Abodes (الدارين); the science of manifesting the Unseen (الغيوب) from behind the veils; why they were veiled; why they were brought forth; what was brought forth from them and what remained; what awaits emergence from that; and what is not permissible to emerge, though it is possible to emerge, and what prevents it—and what that impediment is. Does it emerge through Hearing (سماع) or without Hearing? And if it is through Hearing, is it through aversion or through love and joy, or is it divided into both according to the states dictated by the times?\n\nAmong the sciences of this station is also the science of increase in a thing from itself, not from another, such as unfolding the folded (نشر المطوي) and spreading out the grasped. And the science of extracting physical treasures (الكنوز المحسوسة) through the Names (الأسماء) and the properties (الخواص) they grant in that, such that the Gnostic stands by it at the location of the treasure and speaks the Name, and the earth splits open over the buried wealth, just as the sheath splits open over the flower. When he sees it, he speaks another Name, and the wealth emerges by that property, just as iron is attracted to the magnet, until nothing of that wealth remains in that place.\n\nIt includes the science of prescribed actions (الأعمال المشروعة), where their wealth lies, and what one encounters from them. It includes the science of felicity (السعادة) and wretchedness (الشقاء) by signs. It includes the science of directions (الجهات) and why they return, and the attribution of Above-ness (الفوقية) to the Real (الحق)—is it the Above-ness of direction or the Above-ness of rank? It includes the knowledge of the states of people in the stations (منازلهم) they occupy in the Hereafter, and the cause of those states in which they turn in those stations, and whether they are repeated upon them exactly in the times in which they occurred or not. It includes the vision of Allah by His servants for a sign of proportion that returns. It includes the nobility of the stars and time without comparison.\n\nIt includes the science of negating faith (الإيمان) despite the existence of Knowledge (العلم). This is one of the most disturbing matters for the Verifier (المحقق).\n\nIt contains the science of Glad Tidings (البشرى), and that it is not restricted to the felicitous in appearance, even if it is restricted to goodness. Thus, His saying: <<فَبَشِّرْهُمْ بِعَذابٍ أَلِيمٍ>> (So give them tidings of a painful punishment). The discussion of this Glad Tidings (*Bishāra*) is linguistic and conventional. As for *Bishāra* from the conventional perspective, what is understood from it is goodness, necessarily. Since this wretched person (الشقي) awaits Glad Tidings, imagining that he is upon the truth, it was said, \"Give him tidings,\" because he awaits Glad Tidings, but the tidings for him were of a painful punishment. As for the linguistic perspective, it is that which affects his skin (*bashara*). For if good is told to him, it affects his skin with cheerfulness, laughter, joy, excitement, and delight. And if evil is told to him, it affects his skin with contraction, weeping, sorrow, grief, dustiness, and frowning. For this reason, the Exalted said: <<وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضَاحِكَةٌ مُسْتَبْشِرَةٌ * وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ تَرْهَقُهَا قَتَرَةٌ>> (Some faces, that Day, will be bright, laughing, rejoicing at good news. And [other] faces, that Day, will have dust upon them, overcast with darkness). He mentioned what affected their skin. Therefore, *Bishāra* applies linguistically to both good and evil, but not conventionally. For this reason, Allah the Exalted used it without restriction when He said concerning the believers: <<لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ>> (For them are glad tidings (البشرى) in the worldly life and in the Hereafter), and He did not specify with what, because convention implies that it is with goodness, and the context supports this.\n\nIt also contains the Knowledge (العلم) of Eternity (الأبد) and why it returns. Is Eternity temporal, or is it the essence of time? And by what does time subsist? Does it subsist by itself, or by something else, such that that other thing is for it, like it is for us, a vessel (ظرفاً) for its subsistence and permanence? Or is it an imagined matter that has no true essential Existence (وجود حقيقي عيني)?\n\n<<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر تین سو، عالم علوی (العالم العلوي) کے حضرت محمدیہ (الحضرة المحمدیۃ) سے تقسیم ہونے کے منزل (منزل) کی معرفت میں\n\n> محقق (المحقق) اٹھاتا ہے جو اس کا خالق اس میں ڈالتا ہے، تاکہ غیب کی خبر ظاہر ہو جائے۔\n> اس سے اس کی لطافتیں میرے دل تک پھیلتی ہیں، جیسے آنکھ تک سورج کی شعاع کا پھیلاؤ۔\n> پس گلے ملنا، بوسہ لینا، اور قدیم ہونا ہمیں جمع کرتا ہے، جیسے دلہنیں، مادہ کا نر کے ساتھ۔\n> ہمیشہ کے لیے، کوئی صبح ہمیں جدا نہیں کرتی، ہم شام اور صبح کی قید سے پاک ہیں۔\n> ہمارے درمیان سے اسرار افق کے پردوں میں ظاہر ہوتے ہیں، سورج کی طرح طلوع ہوتے ہیں بغیر کسی تبدیلی کے۔\n> نہ مشرق اسے ظاہر کرتا ہے، نہ مغرب اسے چھپاتا ہے، اور نہ ہی انسانوں کی آنکھوں میں سے کوئی آنکھ اسے پا سکتی ہے۔\n> اس کا وقت اب گزر چکا ہے، پس اسے تلاش کرو، اور نہ ہی وہ مستقل ہے جو ایک اندازے پر آتا ہے۔\n> اے تمام فکر اور عقل والوں! تعجب نہ کرو کہ یہ عمر کا نتیجہ ہے۔\n> میں ایک ایسے زندہ کے ساتھ زندہ ہوں جس کے لیے کوئی زندگی نہیں، اور عالمِ صورت (عالم السور) میں ہمارے لیے کوئی زندگی نہیں۔\n> بے شک وہ زندگی جو ایک مدت تک چلتی ہے، وہ عالمِ اجسام (عالم الصور) کی زندگی ہے۔\n\n### [جمادات کی انسان پر فضیلت‏]\n\nجان لو کہ یہ منزل (منزل) جمادات (الجماد) کی انسان پر فضیلت اور جنوں کے مؤمنین کی قرآن سننے میں انسانوں کے مؤمنین پر فضیلت کو شامل ہے، اس معنی کی وجہ سے جس پر اللہ نے انہیں پیدا کیا اور ان میں اسے خلق کیا۔ اللہ تعالیٰ فرماتا ہے: لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (بیشک آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے، لیکن اکثر لوگ نہیں جانتے۔) کیا تم سمجھتے ہو کہ یہ بڑائی جسمانی حجم اور مقدار کی عظمت میں ہے؟ ہرگز نہیں، اللہ کی قسم! کیونکہ وہ تو حس سے معلوم ہے۔ بلکہ یہ بڑائی اس معنی کی وجہ سے ہے جو اللہ نے ان میں پیدا کیا، جو انسان کے لیے نہیں تھا، اور جو انہیں مراتب (المراتب) اور اللہ تعالیٰ کے ہاں اشیاء کی مقداروں کا علم عطا کرتا ہے۔ پس ہم ہر موجود کو اس کے اس مقام پر رکھتے ہیں جس پر اللہ نے اسے اتارا ہے، خواہ وہ مخلوق ہو یا اسماء الٰہیہ۔\n\n### [امانت الٰہی‏]\n\nاور اسی میں اللہ تعالیٰ کا یہ فرمان بھی شامل ہے: إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا (بیشک ہم نے امانت (الأمانة) کو آسمانوں، زمین اور پہاڑوں پر پیش کیا، تو انہوں نے اسے اٹھانے سے انکار کر دیا اور اس سے ڈر گئے، اور انسان نے اسے اٹھا لیا، بیشک وہ بڑا ظالم اور جاہل ہے۔) کیا تم سمجھتے ہو کہ یہ ان کی جہالت کی وجہ سے تھا؟ اللہ کی قسم، ہرگز نہیں! بلکہ امانت (الأمانة) کا اٹھانا اٹھانے والے کی محض جہالت کی وجہ سے تھا۔ اور کیا اللہ نے جہالت کی مبالغہ آرائی اور اس میں اپنی ذات اور دوسروں پر ظلم کرنے کی صفت سے کسی کو متصف کیا ہے سوائے اس کے اٹھانے والے یعنی انسان کے؟ پس زمین اور جن کا ذکر کیا گیا، انہوں نے امانت (الأمانة) کی قدر کو جانا اور یہ بھی جانا کہ اسے اٹھانے والا خطرے میں ہے، کیونکہ اسے اللہ کی طرف سے اس بات کا یقین نہیں تھا کہ وہ اسے اس کے اہل تک پہنچانے میں کامیاب ہو گا۔ اور انہوں نے عرض (پیشکش) کے ذریعے اللہ کی مراد کو جانا کہ وہ عقل کا میزان (ميزان العقل) چاہتا ہے۔ پس زمین، پہاڑوں اور آسمان کی عقل انسان کی عقل سے زیادہ تھی، کیونکہ انہوں نے اپنے آپ کو اس چیز میں داخل نہیں کیا جو اللہ نے ان پر واجب نہیں کی تھی، کیونکہ یہ ایک عرض (پیشکش) تھی نہ کہ امر (حکم) کہ ان پر خوشی یا ناخوشی سے جواب دینا لازم ہو جاتا۔ یعنی مشقت کے ساتھ، کیونکہ وہ اس چیز کی تعظیم کو جانتے تھے جو اللہ نے ان پر واجب کی تھی۔ پس وہ فرمانبردار ہو کر آئے جب اللہ نے ان دونوں سے کہا: ائْتِيا طَوْعاً أَوْ كَرْهاً (تم دونوں خوشی سے آؤ یا ناخوشی سے۔) یعنی اپنے اندر اس چیز کو قبول کرنے کے لیے تیار ہو جاؤ جو تم میں ڈالی جائے گی۔ پس جب وہ دونوں فرمانبردار ہو کر آئے اور ذات حق (الحق) نے جو کچھ ان میں ڈالنا چاہا، اس کے قبول کرنے کے لیے تیار ہو گئے، تسلیم کرتے ہوئے اور خوف زدہ ہوتے ہوئے، تو اللہ نے زمین میں اس کی خوراکیں مقدر کر دیں اور اسے اس کے پاس امانت (الأمانة) بنا دیا، جو اس نے جبراً اٹھائی نہ کہ اختیاراً۔ اور أَوْحى في كُلِّ سَماءٍ أَمْرَها (اور ہر آسمان میں اس کا حکم وحی کیا) اور اسے اس کے ہاتھ میں امانت (الأمانة) بنا دیا جسے وہ اس کے اہل تک پہنچاتی ہے، جو اس نے جبراً اٹھائی نہ کہ اختیاراً۔ اور ان کی معرفت میں یہ بھی شامل تھا کہ امانت (الأمانة) کو عرض (پیشکش) اور اختیار کے ساتھ اٹھانے سے اٹھانے والے کا اپنی ذات پر ظلم لازم آتا ہے، کیونکہ اس نے خود کو ایک عظیم معاملے میں پیش کر دیا، اور اگر وہ اسے ادا کرنے میں کامیاب نہ ہوا تو وہ دوسروں پر اور اپنی ذات پر ظالم ہو گا۔ اور انسان نے اپنی ذات اور اس کی قدر کے بارے میں اس بات کو نہیں جانا، اگرچہ وہ اس کی قدر کو جانتا تھا، لیکن وہ اس بات کو نہیں جانتا تھا کہ اللہ کے علم میں اسے ادا کرنے کی توفیق کے بارے میں کیا ہے، بلکہ وہ جاہل ہے جیسا کہ اللہ نے اس کے بارے میں گواہی دی۔ پس انسان کا امانت (الأمانة) قبول کرنا اختیاراً تھا نہ کہ جبراً، لہٰذا اس نے اس میں خیانت کی کیونکہ وہ اپنے نفس کے سپرد کر دیا گیا تھا۔ اور زمین اور آسمان کا اسے اٹھانا جبراً تھا نہ کہ اختیاراً، پس اللہ نے ان دونوں کو اس کے اہل تک پہنچانے کی توفیق دی اور انہیں خیانت سے بچایا، اور انسان کو ناکام کر دیا۔\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: مَن طَلَبَ الإِمَارَةَ وُكِلَ إِلَيْهَا، وَمَن أُعْطِيَهَا مِن غَيْرِ طَلَبٍ بَعَثَ اللهُ أَو وَكَلَ اللهُ بِهِ مَلَكًا يُسَدِّدُهُ (جس نے امارت طلب کی، وہ اسی کے سپرد کر دیا گیا، اور جسے بغیر طلب کے دی گئی، اللہ نے اس کے ساتھ ایک فرشتہ مقرر کر دیا جو اسے درست رکھتا ہے۔)\n\nاور زمین، آسمان اور پہاڑوں کی انسان پر فضیلت میں اللہ کا ان کے بارے میں یہ فرمان بھی ہے: لَوْ أَنْزَلْنا هذَا الْقُرْآنَ عَلى جَبَلٍ لَرَأَيْتَهُ خاشِعاً مُتَصَدِّعاً من خَشْيَةِ الله (اگر ہم اس قرآن کو کسی پہاڑ پر نازل کرتے تو تم اسے اللہ کے خوف سے جھکتا اور پھٹتا ہوا دیکھتے۔) کیا تم سمجھتے ہو کہ یہ اس چیز کی جہالت کی وجہ سے ہے جو اس پر نازل ہوئی؟ اللہ کی قسم، ہرگز نہیں! بلکہ یہ اس کے بارے میں اور اس کی قدر کے بارے میں اس کے علم کی قوت کی وجہ سے ہے۔ کیا تم نہیں دیکھتے کہ وہ عز و جل ہمیں اس آیت میں فرماتا ہے: كَذلِكَ يَضْرِبُ اللهُ الْأَمْثالَ لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ (اسی طرح اللہ لوگوں کے لیے مثالیں بیان کرتا ہے تاکہ وہ غور و فکر کریں۔) پس جب وہ اس میں غور و فکر کریں گے تو وہ اپنے علاوہ دوسروں کی فضیلت کو جان لیں گے، کیونکہ اللہ کی گواہی اس چیز کی تعظیم کے بارے میں جس کی گواہی دی گئی ہے، اس کے واقع ہونے کی طرح ہے، کیونکہ یہ قول حق ہے۔ اور جب وہ غور و فکر کریں گے تو وہ قرآن کی قدر کے بارے میں اپنی جہالت کو جان لیں گے، کیونکہ ان سے وہ صفت ظاہر نہیں ہوئی جس کی اللہ نے پہاڑ کے لیے گواہی دی۔\n\nحافظ ابو نعیم نے دلائل النبوۃ میں روایت کیا ہے کہ اللہ نے جبرائیل علیہ السلام کو نبی صَلَّى اللهُ عَليهِ وسَلَّم کے پاس ایک درخت کے ساتھ بھیجا جس میں ایک پرندے کا گھونسلا تھا، پس جبرائیل ایک میں بیٹھے اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم دوسرے میں بیٹھے، اور درخت ان دونوں کو لے کر اوپر چڑھ گیا۔ جب وہ آسمان کے قریب پہنچے تو ان کے لیے موتیوں اور یاقوت کا ایک رفرف (پردہ) جیسا امر لٹکایا گیا۔ پس جب جبرائیل نے اسے دیکھا تو ان پر غشی طاری ہو گئی، اور نبی صَلَّى اللهُ عَليهِ وسَلَّم پر غشی طاری نہیں ہوئی۔ پھر آپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"پس میں نے جبرائیل کی مجھ پر علم میں فضیلت کو جانا، کیونکہ وہ جانتے تھے کہ وہ کیا ہے، پس ان پر غشی طاری ہو گئی، اور میں نہیں جانتا تھا۔\"\n\nپس آپ صَلَّى اللهُ عَليهِ وسَلَّم نے اعتراف کیا، لہٰذا اگر انسان قرآن کی قدر اور جو کچھ اس نے اٹھایا ہے، اسے جانتا تو اس کی حالت ایسی نہ ہوتی۔ پس دیکھو کہ آپ صَلَّى اللهُ عَليهِ وسَلَّم اپنے باطن میں قرآن کو اٹھانے کی وجہ سے کیا کچھ برداشت کرتے تھے، اس کی معرفت کی وجہ سے، اور اللہ نے آپ کے جسم کو باقی رکھا اور آپ کے ظاہر کو اس سے محفوظ رکھا کہ وہ پہاڑ کی طرح پھٹ جائے اگر اس پر قرآن نازل ہوتا، مگر اس لیے کہ اللہ تعالیٰ نے آپ کی زبان سے ہم تک اس کی تبلیغ کا فیصلہ کر رکھا تھا، لہٰذا ضروری تھا کہ آپ کی ظاہری صورت اپنی حالت پر باقی رہے تاکہ ہم اسے آپ سے لے سکیں۔ اور اسی طرح جبرائیل کی صورت کا باقی رہنا جو اسے لے کر نازل ہوئے۔ اور بات تو ہم میں ہے۔ اور جن کا ہم نے ذکر کیا ان کی انسان پر فضیلت میں اور انسان کی فضیلت جب وہ مر جاتا ہے اور جمادات (الجمادیۃ) میں زمین کی طرح ہو جاتا ہے، اپنی انسانیت میں زندہ ہوتے ہوئے، اللہ تعالیٰ کا یہ فرمان ہے: ولَوْ أَنَّ قُرْآناً سُيِّرَتْ به الْجِبالُ أَوْ قُطِّعَتْ به الْأَرْضُ أَوْ كُلِّمَ به الْمَوْتى (اور اگر کوئی ایسا قرآن ہوتا جس کے ذریعے پہاڑ چلائے جاتے یا زمین ٹکڑے ٹکڑے کر دی جاتی یا مردوں سے بات کی جاتی) یعنی لکان هذا القرآن (تو یہی قرآن ہوتا)، پس جواب کو حذف کر دیا گیا کیونکہ کلام اس پر دلالت کرتا ہے۔ اور اس کا مطلب یہ ہے کہ اگر ہم اسے ان پر نازل کرتے جن کا ہم نے ذکر کیا، تو پہاڑ چل پڑتے، اور زمین ٹکڑے ٹکڑے ہو جاتی، اور مردہ جواب دیتا۔ اور ہم میں سے کوئی چیز ظاہر نہیں ہوئی، حالانکہ ہم سے اس کے ذریعے بات کی گئی ہے۔\n\n### [جنوں کی انسانوں پر فضیلت‏]\n\nاور جنوں کی ہم پر فضیلت میں یہ بھی ہے کہ نبی صَلَّى اللهُ عَليهِ وسَلَّم نے جب اپنے صحابہ پر سورۃ الرحمن کی تلاوت کی اور وہ سن رہے تھے، تو آپ نے ان سے فرمایا: \"میں نے اسے تمہارے جن بھائیوں پر تلاوت کیا، تو وہ تم سے زیادہ بہتر سننے والے تھے،\" اور حدیث کا ذکر کیا، اور اس میں ہے: \"میں نے ان سے فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ (پس تم دونوں اپنے رب کی کون کون سی نعمتوں کو جھٹلاؤ گے؟) نہیں کہا مگر انہوں نے کہا: وَلَا بِشَيْءٍ مِّنْ آلَائِكَ رَبَّنَا نُكَذِّبُ (اے ہمارے رب! ہم تیری نعمتوں میں سے کسی چیز کو بھی نہیں جھٹلاتے۔)\"\n\nپس دیکھو کہ وہ ان حقائق کو کتنا جانتے تھے جن سے انہیں مخاطب کیا گیا، کہ انہوں نے اسی چیز سے جواب دیا جس سے انہیں مخاطب کیا گیا تھا، یہاں تک کہ اسم رب (الرب) کے ساتھ بھی، اور انہوں نے یہ نہیں کہا کہ اے ہمارے معبود! یا کوئی اور بات، اور انہوں نے یہ بھی نہیں کہا کہ \"ان میں سے کسی چیز کو بھی نہیں\"، بلکہ انہوں نے کہا: \"تیری نعمتوں میں سے\" جیسا کہ ان سے کہا گیا تھا، اس احتمال کی وجہ سے کہ ضمیر اس آیت میں کسی مخصوص نعمت کی طرف لوٹتی ہو، اور وہ تمام نعمتوں کا ارادہ کرتے ہیں تاکہ تصدیق عام ہو جائے۔ پس انسان اپنی طبیعت کے لحاظ سے ان سب سے ملحق ہو جاتا ہے، نہ کہ اپنی لطافت کے لحاظ سے جو اس جسم کو سنبھالتی ہے اور اس سے پیدا ہوتی ہے، جس سے اس پر اس کی نشوونما سے خلل آتا ہے۔ پس اس کا پورا جسم اپنی طبیعت کے لحاظ سے اللہ کا فرمانبردار اور ڈرنے والا ہے، اور اس کا کوئی بھی عضو ایسا نہیں ہے کہ جب بندہ اسے جبراً کسی الٰہی حکم کی خلاف ورزی میں بھیجتا ہے تو وہ اسے نہ پکارتا ہو کہ \"ہم ایسا نہیں کریں گے، مجھے اس چیز میں نہ بھیج جس میں میرا بھیجنا تجھ پر حرام ہے، میں تیرے خلاف گواہی دینے والا ہوں، اپنی شہوت کی پیروی نہ کر۔\" اور وہ اس کے فعل سے اللہ کی طرف براءت کا اظہار کرتا ہے۔ اور اس کی ہر قوت اور عضو اسی طرح ہے، اور وہ اس نفس کے قہر کے تحت مجبور ہیں جو انہیں سنبھالتا ہے اور انہیں مسخر کرتا ہے۔ پس اللہ تعالیٰ انہیں اس سے بچائے گا، اس کے برعکس، اس دن کے عذاب سے جب اللہ قیامت کے دن اس سے مواخذہ کرے گا اور اسے آگ میں ڈالے گا۔ لیکن وہ مؤمنین جو اس کے بعد جنت میں نکلیں گے، تو اللہ انہیں اس میں عزت کی موت دے گا، اعضاء کی خاطر، کیونکہ وہ مجبور تھے اس چیز میں جس کی طرف نفس نے انہیں لے جایا، پس وہ درد محسوس نہیں کریں گے، اور صرف نفس ہی اس موت میں عذاب دیا جائے گا، جیسا کہ سونے والا اپنے خواب میں دیکھتا ہے، جبکہ اس کا جسم اپنے بستر اور فرش پر بہترین حالت میں ہوتا ہے۔ اور رہے اہل نار جن کے بارے میں کہا گیا ہے: لا يَمُوتُونَ فِيها ولا يَحْيَوْنَ (نہ وہ اس میں مریں گے اور نہ زندہ رہیں گے)، تو ان کے اعضاء بھی اسی طرح ہیں۔ کیا تم نہیں دیکھتے کہ وہ قیامت کے دن ان کے خلاف گواہی دیں گے؟ پس ان کے نفوس آگ میں نہیں مریں گے تاکہ وہ عذاب چکھیں، اور ان کے اجسام آگ میں زندہ نہیں ہوں گے تاکہ وہ عذاب نہ چکھیں۔ پس ان کا عذاب نفسیاتی ہے، حسی صورت میں، جیسے کھالوں کا بدلنا اور جو کچھ اللہ نے ان کے عذاب کے بارے میں بیان کیا ہے، وہ سب ان کے نفوس برداشت کرتے ہیں، کیونکہ ان کے اعضاء سے زندگی ختم ہو چکی ہے، پس وہ پکائے جاتے ہیں جیسے گوشت ہانڈی میں پکایا جاتا ہے۔ کیا تم سمجھتے ہو کہ وہ اسے محسوس کرتا ہے؟ بلکہ اگر وہاں زندگی ہوتی تو اللہ اس میں نعمت پیدا کر دیتا، ورنہ وہ نفوس ہی برداشت کرتے ہیں، جیسے کوئی شخص اپنی آنکھوں سے اپنا مال لٹتا ہوا اور اپنی ملکیت کو تباہ ہوتے ہوئے اور اپنی توہین ہوتے ہوئے دیکھتا ہے، تو ملکیت تو اس کے ہاتھ میں آرام دہ ہے جس کے پاس وہ چلی گئی، اور امیر اس کی تباہی سے عذاب میں ہے، اگرچہ اس کا بدن حسی بیماریوں اور امراض سے محفوظ ہو، لیکن وہ سب سے زیادہ عذاب میں ہوتا ہے، یہاں تک کہ وہ موت کی تمنا کرتا ہے اور جو کچھ اس نے دیکھا ہے، اسے نہ دیکھے۔ اور جو کچھ ہم نے ذکر کیا ہے، وہ سب اللہ نے ہمیں اس لیے بتایا ہے تاکہ ہم غور و فکر کریں، نصیحت حاصل کریں، اور اس کی طرف رجوع کریں، اور اس سے دعا کریں کہ وہ ہمیں اپنے معاملات میں ان لوگوں جیسا بنا دے جن کی یہ صفت ہے، تاکہ ہم ان سے ملحق ہو جائیں۔ اور اس نے اس شخص کی دعا قبول کرنے کی ضمانت دی ہے جو اپنے سوال میں مضطر ہو، تاکہ وہ کامیاب ہونے والوں میں سے ہو۔ پس اس شخص کی فضیلت سے بڑھ کر اور کیا فضیلت ہو سکتی ہے جس میں ایک ایسی صفت قائم ہو جائے جو اللہ نے اسے عطا کی ہو، جس سے وہ اسے سعادت مند بنائے، اور اپنی مخلوق میں سے جو اس کی صورت پر ہو، وہ اللہ سے دعا کرے کہ وہ اسے اس صفت میں ان سے ملحق کر دے۔ پس تم نے لوگوں کی تخلیق پر اس کی بڑائی کی قدر کو جان لیا، ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (لیکن اکثر لوگ نہیں جانتے۔) پس اے میرے بھائی! اس تھوڑی سی چیز کے بارے میں جاننے والوں میں سے ہو جاؤ جس سے میں نے تمہیں آگاہ کیا اور متنبہ کیا ہے۔ اللہ ہمیں ان میں سے بنائے، آمین، اپنی عزت کے ساتھ۔\n\n### [کائنات کی پہلی ہستی سماع سے اور اس کا آخری اختتام حق کی طرف سے سماع ہے‏]\n\nاور اس منزل (منزل) میں سماع الٰہی (السماع الإلهي) بھی شامل ہے، اور یہ کائنات کے مراتب میں سے پہلا ہے، اور اسی پر اختتام ہوتا ہے۔ پس کائنات کی پہلی ہستی سماع (السماع) سے ہے، اور اس کا آخری اختتام ذات حق (الحق) کی طرف سے سماع (السماع) ہے۔ اور نعمت اہل نعمت میں اور عذاب اہل عذاب میں جاری رہے گا۔ لیکن ہر مخلوق کی تخلیق کے آغاز میں، وہ صرف \"کن\" (ہو جا) کے قول سے ظاہر ہوئی، پس اللہ نے اسے سنایا، تو اس نے تعمیل کی، اور اس کی عین (حقیقت) وجود میں ظاہر ہوئی، حالانکہ وہ عدم تھی۔ پس پاک ہے وہ جو اس شخص کے حال کو جانتا ہے جسے اس نے \"کن\" کہا تو وہ ہو گیا۔ پس ممکن کو سب سے پہلے جو چیز ملی وہ سماع الٰہی (السماع الإلهي) کا مرتبہ ہے۔ کیونکہ \"کن\" قول کی صفت ہے، اللہ تعالیٰ فرماتا ہے: إِنَّما قَوْلُنا (بیشک ہمارا قول)، اور سماع (السماع) قول سے متعلق ہے۔ اور رہے اختتام میں کفار کے حق میں: اخْسَؤُا فِيها ولا تُكَلِّمُونِ (اسی میں ذلیل ہو کر پڑے رہو اور مجھ سے بات نہ کرو)، پس اللہ نے انہیں مخاطب کیا اور وہ سن رہے تھے۔ اور رہے اہل جنت کے حق میں، تو رؤیت اور ظہور الٰہی (التجلی) کے بعد، جو ان کے علم میں سب سے بڑی نعمت ہے، اللہ فرمائے گا: \"کیا تمہارے لیے کچھ باقی ہے؟\" تو وہ کہیں گے: \"اے ہمارے رب! ہمارے لیے اور کیا باقی ہے؟ تو نے ہمیں آگ سے نجات دی، اور ہمیں جنت میں داخل کیا، اور ہمیں یہ بادشاہت عطا کی، اور ہمارے اور اپنے درمیان سے پردے اٹھا دیے، پس ہم نے تجھے دیکھا۔ اور ہمارے پاس اس سے بڑھ کر اور کیا باقی ہو سکتا ہے جو ہم نے حاصل کیا؟\" تو وہ سبحانہ فرمائے گا: \"میری رضا تم پر ہے، پس میں تم پر کبھی ناراض نہیں ہوں گا۔\" پس اس نے انہیں رضا اور اس کے دوام کی خبر دی اور وہ سن رہے تھے۔ آپ نے فرمایا: \"پس یہ سب سے بڑی نعمت ہے جو انہوں نے پائی۔\" پس سماع (السماع) پر اختتام ہوا جیسا کہ آغاز ہوا تھا۔ پھر سماع (السماع) ہمیشہ ان کے ساتھ رہا، ان کے آغاز اور ان کی نعمتوں کے مراتب کی انتہا کے درمیان۔ پس خوشخبری ہے اس شخص کے لیے جس کے پاس أُذُنٌ واعِيَةٌ (سننے والا کان) ہو، اس چیز کے لیے جو ذات حق (الحق) اپنے خطاب میں وارد کرتا ہے۔ پس عارف محقق (العارف المحقق) ہمیشہ سماع (سماع) میں ہوتا ہے، کیونکہ اس کے نزدیک ہر لحاظ سے اللہ کے سوا کوئی متکلم نہیں ہے۔ پس مخلوق میں سے جو بھی اسے مخاطب کرتا ہے، عارف اسے ذات حق (الحق) کی طرف سے رسول کے خطاب کی طرح سمجھتا ہے، پس وہ اس چیز کو قبول کرنے کے لیے تیار ہو جاتا ہے جس سے اس شخص نے اسے مخاطب کیا، اور وہ دیکھتا ہے کہ اللہ کے ہاں اس کا کیا حکم ہے جسے شریعت (الشرع) نے مقرر کیا ہے، پس وہ اسے اسی حد پر لیتا ہے۔ اللہ تعالیٰ فرماتا ہے: فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله (پس اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے۔) اور اس کا متکلم رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم ہی تھے۔ پس اللہ کی مخلوق میں سے کسی کے لیے جائز نہیں کہ وہ اپنی ذات کے بارے میں یا کسی اور کے بارے میں خبر دے، بلکہ سب کا خبر دینا اللہ کی طرف سے ہے، کیونکہ وہ سبحانہ ہی ان میں \"کن\" کے ذریعے وہ چیز پیدا کرتا ہے جس کی وہ خبر دیتے ہیں۔ پس سب اس کے کلمات ہیں۔ پس بندے کے لیے حقیقت میں صرف سماع (السماع) ہی ہے، اور مخلوق کا کلام سماع (سماع) ہے۔ پس عارف مخلوق کے کلام میں سے کسی چیز کو بھی نظر انداز نہیں کرتا اور نہ ہی اسے چھوڑتا ہے، اور اسے اس کے مقام پر رکھتا ہے، خواہ وہ قول شرع کے حکم میں خبیث، منکر، اور جھوٹ ہو، یا پاکیزہ، معروف، اور حق ہو۔\n\nپس عارف اسے قبول کرتا ہے اور اسے اس منزل (المنزلة) پر رکھتا ہے جسے اللہ نے شرع اور حکمت کی زبان پر اس قول کے لیے مقرر کیا ہے۔ اور اس منزل (منزل) کے علوم میں سے وہ غَمام (الغمام) بھی ہے جس میں قہر اور رحمت کے ظہور الٰہی (تجلى) میں آنا واقع ہوتا ہے، اور یہ اس وقت ہوتا ہے جب تَشَقَّقُ السَّماءُ بِالْغَمامِ (آسمان بادلوں کے ساتھ پھٹ جائے گا) یعنی غَمام (الغمام) کی وجہ سے، یعنی تاکہ وہ غَمام (الغمام) بن جائے، پس اس کے تمام دروازے کھل جاتے ہیں اور وہ غَمام (الغمام) بن جاتا ہے۔ اور فرشتے اس کے آباد کرنے والے تھے، اور وہ ایک آسمان ہے، پس وہ اس میں ہوں گے اور وہ غَمام (الغمام) ہو گا۔ اور اسی میں وہ قیامت کے دن حشر تقدیری کی طرف آئیں گے، اور فرشتے ظُلَلٍ من الْغَمامِ (بادلوں کے سائبانوں) میں ہوں گے، اور سائبان اس کے دروازے ہیں۔ اللہ اس بارے میں فرماتا ہے: وفُتِحَتِ السَّماءُ فَكانَتْ أَبْواباً (اور آسمان کھول دیا جائے گا تو وہ دروازے بن جائے گا) اور فرمایا: ويَوْمَ تَشَقَّقُ السَّماءُ بِالْغَمامِ ونُزِّلَ الْمَلائِكَةُ تَنْزِيلًا (اور جس دن آسمان بادلوں کے ساتھ پھٹ جائے گا اور فرشتے اتارے جائیں گے) اور یہ ان کا اس غَمام (الغمام) میں آنا ہے، اللہ کے آنے کے لیے تاکہ وہ قیامت کے دن اپنے بندوں کے درمیان فیصلہ اور فصل کرے۔ پس عارف جب اس کا آسمان غَمام (الغمام) کے ساتھ پھٹ جاتا ہے، اور اس کی قوتیں اس غَمام (الغمام) میں نازل ہو جاتی ہیں، اور اللہ اس کی دنیا کی زندگی میں اس کے وجود (وجود) میں فیصلہ اور قضاء کے لیے آتا ہے، تو اس کی قیامت قائم ہو چکی ہوتی ہے، اور اس کا حساب جلدی ہو چکا ہوتا ہے، پس وہ قیامت کے دن امن میں آئے گا، نہ اس پر کوئی خوف ہو گا اور نہ وہ غمگین ہو گا، نہ حال میں اور نہ مستقبل میں۔ اور اسی لیے اللہ نے اپنے اس فرمان میں فعل حال لایا ہے: ولا هُمْ يَحْزَنُونَ (اور نہ وہ غمگین ہوں گے)، کیونکہ یہ فعل حال اور استقبال میں غم کو دور کرتا ہے، بخلاف فعل ماضی کے اور استقبال کے لیے سین یا سوف کے ساتھ مخلص کے۔\n\n### [کہ زمین کے لیے ہر سانس میں تین حالتیں ہیں‏]\n\nاور جان لو کہ زمین کے لیے ہر سانس میں تین حالتیں ہیں: بچے کو قبول کرنا، درد زہ، اور ولادت، جب تک قیامت قائم نہ ہو جائے۔ اور انسان اپنی طبیعت کے لحاظ سے زمین کی طرح ہے۔ پس اسے چاہیے کہ وہ ہر سانس میں جانے کہ اس کا رب اس میں کیا ڈالتا ہے، اور اس سے اس کے رب کی طرف کیا نکلتا ہے، اور وہ اس چیز میں کیا ہے جو اس میں ڈالی گئی ہے اور ابھی نکلی نہیں ہے، لیکن نکلنے کے لیے تیار ہے۔ کیونکہ اسے ان تین مراتب اور حالتوں میں اللہ کے ساتھ اپنے احوال کی نگرانی کا حکم دیا گیا ہے۔ اور اللہ کا اس میں ڈالنا کبھی واسطوں کے ساتھ ہوتا ہے اور کبھی واسطوں کے بغیر، اور واسطہ کبھی محمود ہوتا ہے، اور کبھی مذموم، اور کبھی نہ محمود ہوتا ہے اور نہ مذموم، اگرچہ یہ حالت ندامت اور نقصان کی طرف لے جاتی ہے۔ پس محقق (المحقق) سنتا ہے اور لیتا ہے، اور جانتا ہے کہ وہ کس سے سنتا ہے اور کس سے لیتا ہے، اور وہ کیا جنم دیتا ہے، اور جب وہ جنم دیتا ہے تو اس کے بچے کو کون قبول کرتا ہے، اور کون اس کی پرورش کرتا ہے، کیا اس کا رب اس کی پرورش کرتا ہے یا اس کے رب کے علاوہ کوئی اور؟ جیسا کہ\n\nصحیح خبر میں آیا ہے کہ صدقہ، جو بندہ جنم دیتا ہے، رحمن کے ہاتھ میں پڑتا ہے، پس رحمن اسے قبول کرتا ہے اور اس کی پرورش کرتا ہے جیسے تم میں سے کوئی اپنے گھوڑے کے بچے یا اونٹ کے بچے کی پرورش کرتا ہے۔\n\nاور یہ نہیں فرمایا کہ \"جیسے تم میں سے کوئی اپنے بچے کی پرورش کرتا ہے،\" کیونکہ بچہ اگر برا ہو تو اس سے فائدہ نہیں ہوتا۔ بلکہ بسا اوقات اس سے اتنا نقصان پہنچتا ہے کہ وہ تمنا کرتا ہے کہ اللہ نے اسے پیدا ہی نہ کیا ہوتا۔ اور گھوڑے کا بچہ اور اونٹ کا بچہ ایسا نہیں ہوتا، کیونکہ ان سے فائدہ یقینی ہوتا ہے، یا تو اس پر سواری کرنے سے، یا اس پر بوجھ لادنے سے، یا اس کی قیمت سے، یا اس کے گوشت سے جسے وہ ضرورت پڑنے پر کھاتا ہے۔ پس اللہ نے اسے اس چیز سے تشبیہ دی جس سے فائدہ یقینی ہوتا ہے، تاکہ صدقہ کرنے والا جان لے کہ اسے اپنے صدقے سے ضرور فائدہ ہو گا۔ اور سب سے پہلا فائدہ یہ ہے کہ وہ قیامت کے دن اسے سورج کی گرمی سے سایہ دے گا، یہاں تک کہ لوگوں کے درمیان فیصلہ ہو جائے۔ اور انسان جو چیز جنم دیتا ہے، ان میں سے کلمہ طیبہ (الكلمة الطيبة) بھی ہے۔ اور صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: إِنَّ الْكَلِمَةَ الطَّيِّبَةَ صَدَقَةٌ (بیشک کلمہ طیبہ صدقہ ہے۔)\n\nپس اس کی بھی پرورش کی جاتی ہے، اور ذات حق (الحق) خود ہر اس چیز کی پرورش سنبھالتا ہے جسے بندہ نکاح سے جنم دیتا ہے نہ کہ زنا سے۔ اور جب بادشاہ خود اپنے غلام کے بچے کی پرورش سنبھالتا ہے، تو وہ اس خیر کی قدر کیسے کر سکتا ہے جو اسے اپنے بچے کی طرف سے پہنچتی ہے؟ پس سب سے پہلے تو یہ کہ بچہ اپنے باپ کا بادشاہ کے ہاں مقام جانتا ہے، اور یہ کہ بادشاہ نے اس کی پرورش اور اس عزت سے صرف اس لیے کی ہے کہ اس کے باپ کا مقام اس کے ہاں بلند ہے۔ پس وہ اس پر اپنے باپ کا احسان دیکھتا ہے، اور وہ بادشاہ کے مقام کی تعظیم اور اس کے باپ پر اس کی عنایت کی وجہ سے خود اپنے باپ کے ساتھ نیک سلوک کرنے والا اور احسان کرنے والا ہوتا ہے۔ اور عارفین کے افعال اسی پر جاری ہوتے ہیں۔ اور جو کچھ ہم نے اس منزل (منزل) میں بیان کیا ہے، وہ سب اس کے دروازے کے باہر سے ہے، ہم نے اس کے اندر موجود چیزوں کا ذکر نہیں کیا، وقت کی تنگی اور اختصار کی طلب کی وجہ سے۔ اور مجھے دوسرے منازل (المنازل) کے بارے میں بیان کرنے میں ایسا اتفاق نہیں ہوا، کیونکہ میں نے اس منزل (منزل) کے دروازے پر اس علم کی صورتیں پائی ہیں جس کا میں نے ذکر کیا، اور ہم نے وہ سب کچھ بھی پورا نہیں کیا جو میں نے اس کے دروازے پر دیکھا تھا۔ پس یہ مقدار جو اس منزل (منزل) میں ہے، بادشاہ کے دروازے پر موجود غلاموں، چوکیداروں اور دربانوں کی طرح ہے۔ اور رہے اس منزل (منزل) کے مضامین کی فہرست، تو وہ دونوں جہانوں کے درمیان عالم علوی (العالم العلوي) اور سفلی (السفلي) کی معرفت ہے، اور پردوں کے پیچھے سے غیبوں کو ظاہر کرنے کا علم ہے، اور یہ کہ انہیں کیوں پردہ میں رکھا گیا، اور کیوں انہیں نکالا گیا، اور ان میں سے کیا نکالا گیا اور کیا باقی رہا، اور کیا اس میں سے نکالے جانے کا انتظار ہے، اور کیا اس میں سے نکالنا صحیح نہیں ہے جو ممکن ہے کہ نکلے، تو اسے کسی مانع نے روک دیا، تو وہ مانع کیا ہے؟ اور کیا وہ سماع (سماع) سے نکلتا ہے یا سماع کے علاوہ کسی اور چیز سے؟ اور اگر وہ سماع (سماع) سے ہے، تو کیا وہ ناپسندیدگی سے ہے یا محبت اور خوشی سے، یا یہ احوال کے مطابق اس اور اس میں تقسیم ہوتا ہے جو اوقات عطا کرتے ہیں۔ اور اس منزل (منزل) کے علوم میں سے یہ بھی ہے کہ کسی چیز میں اس کی اپنی ذات سے اضافہ کا علم، نہ کہ کسی اور سے، جیسے لپٹی ہوئی چیز کو کھولنا اور بند کی ہوئی چیز کو پھیلانا، اور اسماء (الأسماء) کے ذریعے محسوس خزانوں کو نکالنے کا علم، اور اس میں ان کی خصوصیات کیا ہیں، یہاں تک کہ عارف اس سے خزانے کی جگہ پر کھڑا ہو جاتا ہے، اور اسم سے بات کرتا ہے، تو زمین اس میں دفن مال کے لیے پھٹ جاتی ہے، جیسے پھول غلاف سے پھٹتا ہے۔ پس جب وہ اسے دیکھتا ہے تو دوسرے اسم سے بات کرتا ہے، تو وہ مال اس خاصیت کے ساتھ نکل آتا ہے، جیسے لوہا مقناطیس کی طرف کھنچتا ہے، یہاں تک کہ اس جگہ پر اس مال میں سے کچھ باقی نہیں رہتا۔ اور اس میں مشروع اعمال کا علم شامل ہے، اور ان کا مال کہاں ہے، اور وہ ان سے کیا پاتا ہے۔ اور اس میں علامات کے ذریعے سعادت اور شقاوت کا علم شامل ہے۔ اور اس میں جہات (الجهات) کا علم شامل ہے، اور وہ کیوں لوٹتی ہیں، اور ذات حق (الحق) کا فوقیت (الفوقية) سے متصف ہونا، کیا وہ جہت کی فوقیت ہے یا مرتبہ کی فوقیت؟ اور اس میں لوگوں کے احوال کی معرفت شامل ہے ان منازل (منازل) میں جن میں وہ آخرت میں اتریں گے، اور ان احوال کا سبب کیا ہے جن میں وہ ان منازل (منازل) میں پلٹتے رہیں گے، اور کیا وہ ان پر ان کے اوقات میں بعینہ دہرائے جائیں گے یا نہیں؟ اور اس میں اللہ کا اپنے بندوں کو ایک نسبت کی آیت کے لیے دیکھنا شامل ہے جو لوٹتی ہے۔ اور اس میں سیاروں اور زمانے کی فضیلت شامل ہے بغیر کسی موازنہ کے۔ اور اس میں علم کے وجود کے ساتھ ایمان کی نفی کا علم شامل ہے، اور یہ محقق (المحقق) کے نزدیک سب سے زیادہ بے چین کرنے والے امور میں سے ہے۔ اور اس میں بشریٰ (البشرى) کا علم ہے، اور یہ کہ وہ ظاہر میں صرف سعادت مندوں کے لیے مخصوص نہیں ہے، اگرچہ وہ خیر کے لیے مخصوص ہے۔ پس اللہ تعالیٰ کا فرمان: فَبَشِّرْهُمْ بِعَذابٍ أَلِيمٍ (پس انہیں دردناک عذاب کی خوشخبری سنا دو۔) اور اس بشریٰ (البشرى) پر لغوی اور عرفی لحاظ سے کلام۔ لیکن عرف کے طریقے سے بشریٰ (البشرى) سے مراد خیر ہی سمجھا جاتا ہے، اور یہ ضروری ہے۔ اور چونکہ یہ بدبخت اپنے گمان میں بشریٰ (البشرى) کا انتظار کر رہا تھا، کیونکہ وہ خیال کرتا تھا کہ وہ حق پر ہے، اس لیے کہا گیا کہ اسے بشارت دو، اس کے بشریٰ (البشرى) کے انتظار کی وجہ سے، لیکن وہ بشریٰ (البشرى) اس کے لیے دردناک عذاب کی تھی۔ اور رہے لغت کے طریقے سے، تو وہ یہ ہے کہ اسے وہ بات کہی جائے جو اس کی جلد (بشرة) پر اثر انداز ہو، کیونکہ جب اسے خیر کہا جاتا ہے تو وہ اس کی جلد پر چہرے کے کھلنے، ہنسنے، خوشی اور جھومنے یا طرب سے اثر انداز ہوتا ہے، اور جب اسے شر کہا جاتا ہے تو وہ اس کی جلد پر سکڑنے، رونے، غم، گھٹن اور چہرے پر گرد و غبار اور تیوری چڑھانے سے اثر انداز ہوتا ہے۔ اور اسی لیے اللہ تعالیٰ نے فرمایا: وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضاحِكَةٌ مُسْتَبْشِرَةٌ (کچھ چہرے اس دن روشن ہوں گے، ہنستے ہوئے، خوشخبری پاتے ہوئے) اور وُجُوهٌ يَوْمَئِذٍ عَلَيْها غَبَرَةٌ تَرْهَقُها قَتَرَةٌ (اور کچھ چہروں پر اس دن گرد و غبار ہو گا، انہیں سیاہی ڈھانپ رہی ہو گی۔) پس اس نے ذکر کیا جو ان کی جلد پر اثر انداز ہوا۔ اسی لیے بشریٰ (البشرى) لغت میں خیر اور شر دونوں پر بولا جاتا ہے، لیکن عرف میں نہیں۔ اور اسی لیے اللہ تعالیٰ نے اسے مطلق چھوڑ دیا اور اسے مقید نہیں کیا، پس مؤمنین کے حق میں فرمایا: لَهُمُ الْبُشْرى في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ (ان کے لیے دنیا کی زندگی میں اور آخرت میں خوشخبری ہے) اور یہ نہیں کہا کہ کس چیز سے، کیونکہ عرف یہ بتاتا ہے کہ وہ خیر سے ہے، اور حال کا قرینہ بھی۔ اور اس میں ابد (الأبد) کا علم ہے، اور وہ کیوں لوٹتا ہے، اور کیا ابد (الأبد) زمانی ہے یا وہ عین زمان ہے، اور زمان کس چیز سے باقی رہتا ہے، کیا وہ خود سے باقی رہتا ہے یا کسی اور چیز سے باقی رہتا ہے جو اس کے لیے اس طرح ہو جیسے وہ ہمارے ساتھ اس کے بقا اور دوام کے لیے ظرف ہو، یا وہ ایک وہمی امر ہے جس کا کوئی حقیقی عینی وجود نہیں ہے؟ واللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "«باب سیصدم در معرفت منزل تقسیم عالم علوی از حضرت محمدیه (الحضرة المحمدية)»\n\nمحقق (المحقق) آنچه را که خالقش در او می‌افکند حمل می‌کند، *** تا آنچه در غیب است از خبر آشکار شود.\nلطایف آن از او به قلب من کشیده می‌شود، *** مانند کشیده شدن پرتو خورشید به سوی چشم.\nپس در آغوش گرفتن، بوسیدن و کهنه شدن (عتیق شدن) ما را گرد هم می‌آورد، *** مانند عروسان، همچون مؤنث با مذکر.\nبر دوام، و هیچ صبحی ما را جدا نمی‌کند، *** منزه از شامگاهان و بامدادان.\nاسرار از میان ما در حجاب‌های *** آفاق، چون خورشیدی بی‌همتا طلوع می‌کنند.\nنه شرقی آن را آشکار می‌کند و نه غربی آن را می‌پوشاند، *** و نه چشمی از چشمان بشر آن را درک می‌کند.\nزمان آن اکنون گذشته است، پس آن را بجوی، *** و نه به صورت مستقل و بر اساس تقدیر می‌آید.\nای صاحبان اندیشه و خرد به طور کلی، *** تعجب نکنید که این نتیجه عمر است.\nمن زنده‌ام به زنده‌ای که برایش حیاتی نیست، *** و ما را در عالم دیوارها (صور) حیاتی نیست.\nهمانا حیاتی که تا مدتی جریان دارد، *** همان حیاتی است که در عالم صورت‌هاست.\n\n### [برتری جماد بر انسان‏]\n\nبدان که این منزل شامل برتری جماد (الجماد) بر انسان و برتری جن‌های مؤمن در شنیدن قرآن بر مؤمنان از انسان‌هاست، به دلیل معنایی که خداوند آن‌ها را بر آن آفریده و در آن‌ها خلق کرده است. خداوند متعال می‌فرماید: «آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است، ولی بیشتر مردم نمی‌دانند.» (لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ) آیا این بزرگی را در جِرم و عظمت کمیت می‌بینی؟ هیهات، نه به خدا! زیرا آن با حس معلوم است. بلکه این بزرگی به معنایی است که خداوند در آن‌ها ایجاد کرده و برای انسان نبوده است؛ معنایی که به آن‌ها علم به مراتب و اندازه‌های اشیا نزد خداوند متعال را می‌دهد. پس ما هر موجودی را در منزلتی قرار می‌دهیم که خداوند او را در آن قرار داده است، از مخلوق و اسماء الهی.\n\n### [امانت الهی‏]\n\nو از آن جمله است سخن خداوند متعال: «ما امانت (الْأَمانَةَ) را بر آسمان‌ها و زمین و کوه‌ها عرضه کردیم، پس از حمل آن سر باز زدند و از آن ترسیدند، و انسان آن را حمل کرد؛ همانا او بسیار ستمکار و نادان بود.» (إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا) آیا این را به دلیل نادانی آن‌ها می‌بینی؟ نه به خدا! بلکه حمل امانت (الْأَمانَةَ) صرفاً به دلیل جهل حامل آن بود. آیا خداوند کسی را به جهل مبالغه‌آمیز و ستم بر خود و دیگران وصف کرده است جز حامل آن، یعنی انسان؟ پس زمین و آنچه ذکر شد، قدر امانت را دانستند و اینکه حامل آن در خطر است، زیرا او یقین ندارد که خداوند او را برای ادای آن به اهلش موفق سازد. و آن‌ها مراد خداوند از عرضه کردن را دانستند که او میزان عقل را می‌خواهد. پس عقل زمین و کوه‌ها و آسمان از عقل انسان کامل‌تر بود، زیرا خود را در چیزی که خداوند بر آن‌ها واجب نکرده بود، وارد نکردند. زیرا آن یک عرضه بود نه یک امر (دستور) که اجابت آن بر آن‌ها واجب شود، چه با میل و چه با اکراه. یعنی با مشقت، به دلیل معرفتشان به عظمت آنچه خداوند بر آن‌ها واجب کرده است. پس هنگامی که خداوند به آن‌ها گفت: «با میل یا اکراه بیایید» (ائْتِيا طَوْعاً أَوْ كَرْهاً)، یعنی برای پذیرش آنچه در شما افکنده می‌شود آماده شوید، آن‌ها با میل آمدند و برای پذیرش آنچه حق (الحق) می‌خواست در آن‌ها قرار دهد، تسلیم و ترسان آماده شدند. پس خداوند روزی‌های زمین را در آن مقدر کرد و آن را امانتی نزد آن قرار داد که به اجبار و نه به اختیار آن را حمل کرد. و «در هر آسمانی امرش را وحی کرد» (أَوْحى فِي كُلِّ سَماءٍ أَمْرَها) و آن را امانتی در دست آن قرار داد که به اهلش می‌رساند، و به اجبار و نه به اختیار آن را حمل کرد. و همچنین از معرفت آن‌ها به آنچه حمل امانت به صورت عرضه و اختیار به دنبال دارد، ستم حامل بر نفس خویش است، زیرا خود را در معرض امری عظیم قرار داد. و اگر برای ادای آن موفق نشود، ستمکار بر غیر و بر نفس خویش است. و انسان این را از خود و از قدر آن ندانست، و اگرچه به قدر آن عالم بود، اما به آنچه در علم خداوند درباره توفیق به ادای آن است، عالم نیست، بلکه نادان است، چنانکه خداوند درباره او شهادت داده است. پس قبول امانت توسط انسان به اختیار بود نه به اجبار، و در آن خیانت کرد، زیرا به خود واگذار شد. و حمل زمین و آسمان آن را به اجبار بود نه به اختیار، پس خداوند آن‌ها را به ادای آن به اهلش موفق ساخت و از خیانت حفظ کرد و انسان را خوار ساخت.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «هر کس امارت (حکومت) را طلب کند، به آن واگذار می‌شود، و هر کس بدون طلب به او داده شود، خداوند فرشته‌ای را می‌فرستد یا موکل می‌کند که او را هدایت کند.»\n\nو از برتری زمین و آسمان و کوه‌ها بر انسان، سخن خداوند درباره آن‌هاست: «اگر این قرآن را بر کوهی نازل می‌کردیم، قطعاً آن را از ترس خدا خاشع و متلاشی می‌دیدی.» (لَوْ أَنْزَلْنا هذَا الْقُرْآنَ عَلى جَبَلٍ لَرَأَيْتَهُ خاشِعاً مُتَصَدِّعاً من خَشْيَةِ الله) آیا این را به دلیل نادانی آن نسبت به آنچه بر او نازل شده می‌بینی؟ نه به خدا! بلکه به دلیل قدرت علم آن به آن و قدر آن است. آیا نمی‌بینی که خداوند عز و جل در این آیه به ما می‌فرماید: «خداوند این مَثَل‌ها را برای مردم می‌زند، باشد که بیندیشند.» (كَذَلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ) زیرا اگر در این بیندیشند، برتری غیر خود را بر خود می‌دانند. زیرا شهادت خداوند به مقدار آنچه به تعظیم آن شهادت داده شده، مانند وقوع آن است، چون سخن حق (الحق) است. و اگر بیندیشند، جهل خود را به قدر قرآن می‌دانند، زیرا این صفتی که خداوند برای کوه شهادت داده، از آن‌ها ظاهر نشده است.\n\nابونعیم حافظ در دلائل النبوة آورده است که خداوند جبرئیل (علیه السلام) را نزد پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) با درختی فرستاد که در آن دو آشیانه پرنده بود. جبرئیل در یکی نشست و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در دیگری نشست و درخت با آن دو بالا رفت. هنگامی که به آسمان نزدیک شدند، چیزی شبیه رفرف (پرده) از دُر و یاقوت برای آن‌ها آویزان شد. اما جبرئیل هنگامی که آن را دید، بیهوش شد، ولی پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بیهوش نشد. سپس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «پس برتری جبرئیل بر خود را در علم دانستم، زیرا او می‌دانست که آن چیست، پس بیهوش شد، ولی من نمی‌دانستم.»\n\nپس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) اعتراف کرد. اگر انسان قدر قرآن و آنچه را حمل کرده است می‌دانست، حالش چنین نمی‌بود. پس بنگر به آنچه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در باطن خود از حمل قرآن به دلیل معرفتش به آن تحمل می‌کرد، و آنچه خداوند بر جسد او باقی گذاشت و ظاهر او را از متلاشی شدن مانند کوه حفظ کرد، اگر قرآن بر او نازل می‌شد، تنها به این دلیل بود که خداوند حکم کرده بود که آن را بر زبان او به ما برساند. پس ناگزیر بود که صورت ظاهری او بر حال خود باقی بماند تا ما آن را از او بگیریم. و همچنین بقای صورت جبرئیل که آن را نازل کرد. و سخن در مورد ماست. و از برتری کسانی که ذکر کردیم بر انسان، و برتری انسان هنگامی که می‌میرد و مانند زمین در جمادیت می‌شود، بر حال او در انسانیت زنده، سخن خداوند متعال است: «و اگر قرآنی بود که کوه‌ها به وسیله آن به حرکت درمی‌آمدند، یا زمین به وسیله آن پاره‌پاره می‌شد، یا مردگان به وسیله آن به سخن می‌آمدند، [همانا این قرآن بود].» (وَلَوْ أَنَّ قُرْآناً سُيِّرَتْ بِهِ الْجِبالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ أَوْ كُلِّمَ بِهِ الْمَوْتى) یعنی: این قرآن بود. پس جواب حذف شده است به دلیل دلالت کلام بر آن. و معنای آن این است که اگر آن را بر کسانی که ذکر کردیم نازل می‌کردیم، کوه‌ها به حرکت درمی‌آمدند و زمین پاره‌پاره می‌شد و مرده پاسخ می‌داد. و هیچ یک از این‌ها در ما ظاهر نشد، در حالی که ما با آن سخن گفته‌ایم.\n\n### [برتری جن بر انس‏]\n\nو از برتری جن بر ما این است که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که سوره الرحمن را بر اصحاب خود تلاوت کرد و آن‌ها گوش می‌دادند، به آن‌ها فرمود: «من آن را بر برادران شما از جن تلاوت کردم، و آن‌ها بهتر از شما به آن گوش دادند.» و حدیث را ذکر کرد و در آن آمده است: «و هر بار که به آن‌ها گفتم: «پس کدام یک از نعمت‌های پروردگارتان را انکار می‌کنید؟» (فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ)، گفتند: «هیچ یک از نعمت‌های تو را، پروردگار ما، انکار نمی‌کنیم.»»\n\nپس بنگر که چقدر به حقایق آنچه با آن مخاطب شده‌اند، عالم‌اند؛ چگونه با همان چیزی که با آن مخاطب شده‌اند، پاسخ دادند، حتی با اسم «رب» (پروردگار)، و نگفتند: «ای معبود ما» یا غیر آن. و نگفتند: «هیچ یک از آن‌ها را»، بلکه گفتند: «از نعمت‌های تو» (من آلائك)، همان‌طور که به آن‌ها گفته شد، به احتمال اینکه ضمیر به نعمت مخصوصی در آن آیه بازگردد، و آن‌ها همه نعمت‌ها را می‌خواهند تا تصدیق عمومیت یابد. پس انسان از حیث طبیعتش به همه این‌ها ملحق می‌شود، نه از حیث لطیفه‌اش که مدبر این جسم است و از آن متولد می‌شود و از نشأت آن خلل بر آن وارد می‌شود. پس تمام جسم او از حیث طبیعتش مطیع خدا و ترسان است. و هیچ عضوی از او نیست که بنده آن را به اجبار در مخالفت با امر الهی رها کند، مگر اینکه آن عضو او را ندا می‌دهد: «ما انجام نمی‌دهیم، مرا در آنچه بر تو حرام شده است، رها مکن. من بر تو شاهد هستم. از شهوت خود پیروی مکن.» و آن عضو از کار بنده با آن، به خدا پناه می‌برد. و هر نیرو و عضوی در او چنین است، و آن‌ها تحت قهر نفس مدبر خود و تسخیر آن مجبورند. پس خداوند آن‌ها را به تنهایی از عذاب روز دردناک نجات می‌دهد، هنگامی که خداوند در روز قیامت او را مؤاخذه کند و در آتش قرار دهد. اما مؤمنانی که پس از این به بهشت می‌روند، خداوند آن‌ها را در آن می‌میراند، مرگی از روی کرامت برای اعضا، زیرا آن‌ها در آنچه نفس آن‌ها را به انجام آن واداشته بود، مجبور بودند. پس درد را احساس نمی‌کنند و نفس به تنهایی در آن مرگ عذاب می‌کشد، همان‌طور که شخص خوابیده در آنچه در خواب می‌بیند عذاب می‌کشد، در حالی که جسدش در بستر و رختخوابش در بهترین حالات است. و اما اهل آتشی که درباره آن‌ها گفته شده است: «در آن نمی‌میرند و زنده نمی‌شوند» (لا يَمُوتُونَ فِيها ولا يَحْيَوْنَ)، اعضای آن‌ها نیز چنین وضعیتی دارند. آیا نمی‌بینی که در روز قیامت بر علیه آن‌ها شهادت می‌دهند؟ پس نفس‌های آن‌ها در آتش نمی‌میرند تا عذاب را بچشند، و اجسام آن‌ها در آتش زنده نمی‌شوند تا عذاب را نچشند. پس عذاب آن‌ها روانی است در صورتی حسی، از تبدیل پوست‌ها و آنچه خداوند از عذاب آن‌ها وصف کرده است. همه این‌ها را نفس‌های آن‌ها تحمل می‌کنند، زیرا حیات از اعضای آن‌ها زائل شده است. پس آن‌ها پخته می‌شوند، همان‌طور که گوشت در دیگ پخته می‌شود. آیا آن گوشت آن را احساس می‌کند؟ بلکه اگر در آنجا حیاتی باشد، خداوند در آن نعمتی قرار می‌دهد، وگرنه این چیزی است که نفس‌ها آن را تحمل می‌کنند، مانند شخصی که با چشم خود می‌بیند که مالش غارت شده و ملکش ویران گشته و مورد اهانت قرار گرفته است. پس ملک در دست کسی که به او رسیده راحت است، و امیر به دلیل ویرانی آن عذاب می‌کشد، اگرچه بدنش از بیماری‌ها و امراض حسی سالم باشد، اما او شدیدترین مردم از نظر عذاب است، تا جایی که آرزوی مرگ می‌کند و آنچه را دیده است، نمی‌بیند. و تمام آنچه ذکر کردیم، خداوند ما را از آن آگاه ساخت تا بیندیشیم و متذکر شویم و به سوی او سبحانه بازگردیم و از او بخواهیم که ما را در معامله با او مانند کسی قرار دهد که این صفت را دارد، تا به آن‌ها ملحق شویم. و او اجابت کسی را که در سؤالش مضطر شود، تضمین کرده است، تا از رستگاران باشد. پس چه شرافتی بزرگ‌تر از شرافت کسی است که صفتی در او پدید آمده که خداوند آن را به او بخشیده و او را با آن سعادتمند ساخته است، و از خلق خود کسانی را قرار داده که بر صورت او هستند و از خداوند متعال می‌خواهند که در آن صفت به آن‌ها ملحق شوند. پس قدر بزرگی آن را بر آفرینش مردم دانستی، «ولی بیشتر مردم نمی‌دانند.» (ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ) پس ای برادر من، از جمله اندکی باش که این را می‌دانند، به آنچه تو را آگاه ساختم و بر آن تنبه دادم. خداوند ما را از آن‌ها قرار دهد، آمین به عزت او.\n\n### [آغاز هستی (الوجود) با سماع و پایان آن از حق (الحق) نیز سماع است‏]\n\nو از جمله آنچه این منزل در بر می‌گیرد، سماع (السماع) الهی است، و آن اولین مراتب هستی (الوجود) است و پایان کار نیز به آن واقع می‌شود. پس آغاز هستی (الوجود) هر موجودی با سماع (السماع) است و پایان آن از حق (الحق) نیز سماع است. و نعمت در اهل نعمت و عذاب در اهل عذاب ادامه می‌یابد. اما در ابتدای هستی هر موجودی، تنها از قول «کُن» (باش) ظاهر شد. پس خداوند آن را شنید و اطاعت کرد و عین آن در هستی (الوجود) ظاهر شد، در حالی که عدم بود. پس منزه است دانای به حال کسی که به او گفت: «باش» و او بود. پس اولین چیزی که ممکن (الممکن) به آن دست یافت، مرتبه سماع (السماع) الهی است. زیرا «کُن» صفت قول است. خداوند متعال می‌فرماید: «همانا سخن ما» (إِنَّما قَوْلُنا). و سماع (السماع) متعلق به قول است. و اما در انتها، در حق کافران: «دور شوید در آن و با من سخن مگویید.» (اخْسَؤُا فِيها ولا تُكَلِّمُونِ). پس با آن‌ها خطاب کرد در حالی که می‌شنیدند. و اما در حق اهل بهشت، پس از رؤیت و تجلی (التجلی) که در علم آن‌ها بزرگ‌ترین نعمت است، می‌گوید: «آیا چیزی برای شما باقی مانده است؟» می‌گویند: «پروردگارا، چه چیزی برای ما باقی مانده است؟ ما را از آتش نجات دادی و به بهشت وارد کردی و مالک این ملک ساختی و حجاب‌ها را بین ما و خودت برداشتی و تو را دیدیم. چه چیزی باقی مانده که نزد ما بزرگ‌تر از آنچه به دست آورده‌ایم باشد؟» پس خداوند سبحانه می‌فرماید: «رضایت من از شما، که هرگز بر شما خشمگین نخواهم شد.» پس آن‌ها را از رضایت و دوام آن آگاه ساخت، در حالی که می‌شنیدند. فرمود: «پس آن بزرگ‌ترین نعمتی است که یافتند.» پس با سماع (السماع) ختم شد، همان‌طور که آغاز شد. سپس سماع (السماع) همیشه آن‌ها را همراهی می‌کند، از آغاز تا نهایت مراتب نعمتشان. پس خوشا به حال کسی که «گوش شنوا» (أُذُنٌ واعِيَةٌ) برای آنچه حق (الحق) در خطابش وارد می‌کند، داشته باشد. پس عارف محقق (المحقق) همیشه در سماع (السماع) است، زیرا نزد او متکلمی جز خداوند از هر جهت نیست. پس هر کس از مخلوقات با او سخن بگوید، عارف آن را مانند خطاب رسول از جانب حق (الحق) قرار می‌دهد. پس برای پذیرش آنچه آن شخص با او خطاب کرده است، آماده می‌شود و می‌نگرد که حکم آن نزد خداوند که شرعاً مقرر کرده است، چیست. پس آن را بر همان حد می‌گیرد. خداوند متعال می‌فرماید: «پس به او پناه ده تا کلام خدا را بشنود.» (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله) و متکلم به آن، همانا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بود. پس هیچ کس از خلق خدا جایز نیست که از خود یا از غیر خود خبر دهد، بلکه خبر دادن همه از خداوند است. زیرا او سبحانه است که در آن‌ها با «کُن» آنچه را که خبر می‌دهند، خلق می‌کند. پس همه کلمات او هستند. پس برای بنده در حقیقت جز سماع (السماع) نیست، و کلام مخلوق سماع است. پس عارف هیچ سخنی از مخلوقات را دور نمی‌اندازد و نادیده نمی‌گیرد، و آن را در منزلت خود قرار می‌دهد، چه آن قول در حکم شرع خبیث و منکر و دروغ باشد، یا پاک و معروف و حق.\n\nپس عارف آن را می‌پذیرد و در منزلتی قرار می‌دهد که خداوند بر زبان شرع و حکمت برای آن قول تعیین کرده است. و از علوم این منزل، غمام (الغمام) است که آمدن در آن در تجلی (التجلی) قهر و رحمت واقع می‌شود، و آن هنگامی است که «آسمان به وسیله غمام (الغمام) شکافته می‌شود» (تَشَقَّقُ السَّماءُ بِالْغَمامِ)، یعنی به سبب غمام (الغمام)، یعنی تا غمام شود. پس تمام درهای آن باز می‌شود و غمام می‌گردد. و ملائکه ساکنان آن بودند و آن آسمان است، پس آن‌ها در آن هستند و آن غمام است. و در آن روز قیامت برای حشر تقدیری می‌آیند، و «ملائکه در سایبان‌هایی از غمام (الغمام) هستند» (الْمَلائِكَةُ فِي ظُلَلٍ مِنَ الْغَمامِ). و سایبان‌ها درهای آن هستند. خداوند در این باره می‌فرماید: «و آسمان گشوده شد و درهایی گشت.» (وفُتِحَتِ السَّماءُ فَكانَتْ أَبْواباً) و فرمود: «و روزی که آسمان به وسیله غمام (الغمام) شکافته می‌شود و ملائکه به شدت نازل می‌شوند.» (ويَوْمَ تَشَقَّقُ السَّماءُ بِالْغَمامِ ونُزِّلَ الْمَلائِكَةُ تَنْزِيلًا) و آن آمدن آن‌ها در آن غمام (الغمام) است برای آمدن خداوند جهت قضاوت و فصل میان بندگانش در روز قیامت. پس عارف هنگامی که آسمانش به وسیله غمام (الغمام) شکافته شود و قوای او در آن غمام (الغمام) نازل شوند و خداوند برای فصل و قضاوت در هستی (الوجود) او در سرای دنیایش بیاید، قیامت او برپا شده و در حساب خود شتاب کرده است. پس در روز قیامت ایمن می‌آید، نه ترسی بر اوست و نه اندوهگین می‌شود، نه در حال و نه در آینده. و به همین دلیل خداوند سبحانه فعل حال را در سخن خود آورده است: «و نه آن‌ها اندوهگین می‌شوند.» (ولا هُمْ يَحْزَنُونَ) زیرا این فعل اندوه را در حال و استقبال (آینده) برطرف می‌کند، برخلاف فعل ماضی و آنچه با «س» یا «سوف» برای استقبال خالص شده است.\n\n### [اینکه زمین در هر نفس سه حال دارد]\n\nبدان که زمین در هر نفس سه حال دارد: پذیرش فرزند، درد زایمان (مخاض) و زایمان، تا زمانی که قیامت برپا نشده است. و انسان از حیث طبیعتش مانند زمین است. پس شایسته است که در هر نفس بداند که پروردگارش در آن چه چیزی به او می‌افکند، و چه چیزی از او به سوی پروردگارش خارج می‌شود، و در چه چیزی است که در او افکنده شده و هنوز خارج نشده است، با آمادگی برای خروج. زیرا او مأمور است که احوال خود را با خداوند در این سه مرتبه و حال مراقبت کند. و افکندن خداوند به او گاهی با واسطه‌ها و گاهی بدون واسطه‌هاست. و واسطه گاهی ستوده و گاهی نکوهیده و گاهی نه ستوده و نه نکوهیده است، اگرچه این حالت به پشیمانی و غبن (زیان) می‌انجامد. پس محقق (المحقق) می‌شنود و می‌گیرد و می‌داند که از چه کسی می‌شنود و از چه کسی می‌گیرد و چه چیزی می‌زاید و چه کسی فرزند او را هنگام تولد می‌پذیرد و چه کسی او را تربیت می‌کند؛ آیا پروردگارش او را تربیت می‌کند یا غیر پروردگارش؟\n\nچنانکه در خبر صحیح آمده است که: «صدقه، که از جمله چیزهایی است که بنده آن را می‌زاید، در دست رحمان قرار می‌گیرد. پس رحمان آن را می‌پذیرد و آن را تربیت می‌کند، همان‌طور که یکی از شما کره اسب یا بچه شتر خود را تربیت می‌کند.»\n\nو نگفت: «همان‌طور که یکی از شما فرزند خود را تربیت می‌کند.» زیرا ممکن است فرزند اگر فرزند بدی باشد، سودی به او نرساند. پس منفعت از فرزند محقق نیست، بلکه چه بسا ضرری از او به او برسد که آرزو کند کاش خداوند او را خلق نکرده بود. و کره اسب و بچه شتر چنین نیستند، زیرا منفعت از آن‌ها محقق و حتمی است، یا با سوار شدن بر آن‌ها، یا با بار بردن بر آن‌ها، یا با قیمت آن‌ها، یا با گوشت آن‌ها که اگر نیاز داشته باشد می‌خورد. پس خداوند آن را به چیزی تشبیه کرد که منفعت از آن محقق است، تا تصدیق‌کننده بداند که حتماً از صدقه خود بهره‌مند می‌شود. و اولین منفعت آن این است که در روز قیامت او را از گرمای خورشید سایه می‌افکند تا میان مردم قضاوت شود. و از جمله چیزهایی که انسان می‌زاید، کلمه طیبه است. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا کلمه طیبه صدقه است.»\n\nپس آن نیز برای او تربیت می‌شود. و حق (الحق) خود به تربیت هر آنچه بنده از راه نکاح (حلال) می‌زاید، نه از راه سفاح (حرام)، می‌پردازد. و اگر پادشاه خود به تربیت فرزند بنده خود بپردازد، آیا می‌توان مقدار خیری را که از جانب فرزندش به او می‌رسد، تخمین زد؟ اولین آن این است که فرزند منزلت پدرش را نزد پادشاه می‌داند و اینکه پادشاه او را تربیت کرده و با این کار او را گرامی داشته است، جز به دلیل والایی مرتبه پدرش نزد او نیست. پس او منت را برای پدرش بر خود می‌بیند و به همین دلیل نسبت به او نیکوکار و نیکورفتار می‌شود، به جهت بزرگداشت مرتبه پادشاه و عنایت او به پدرش. و افعال عارفان (العارفين) از بندگان او بر این اساس جریان دارد. و تمام آنچه در این منزل درباره آن سخن گفتیم، از خارج باب آن است و به آنچه در بر می‌گیرد نپرداختیم، به دلیل تنگی وقت و طلب اختصار. و چنین چیزی در عبارت‌پردازی درباره منازل دیگر برای من اتفاق نیفتاده است، زیرا در کنار باب این منزل، صورت‌های علم آنچه ذکر کردم را یافتم و تمام آنچه را که بر باب آن دیدم، به طور کامل بیان نکردیم. پس این مقدار از آنچه در این منزل است، مانند غلامان و نگهبانان و دربانانی است که بر در پادشاه هستند. و اما فهرست آنچه این منزل در بر می‌گیرد، عبارت است از: معرفت عالم علوی و سفلی بین دو سرا (دنیا و آخرت)، و علم آشکار ساختن غیب‌ها از پشت حجاب‌ها، و اینکه چرا حجاب شده‌اند و چرا خارج شده‌اند، و چه چیزی از آن‌ها خارج شده و چه چیزی باقی مانده است، و چه چیزی انتظار خروج آن می‌رود، و چه چیزی خروج آن صحیح نیست از آنچه ممکن است خارج شود، اما مانعی آن را منع کرده است، پس آن مانع چیست؟ و آیا خروج آن از طریق سماع (السماع) است یا از غیر سماع؟ و اگر از طریق سماع (السماع) است، آیا از روی کراهت است یا از روی محبت و سرور؟ یا بر اساس احوالی که زمان‌ها اقتضا می‌کنند، به این و آن تقسیم می‌شود؟ و از علوم این منزل نیز، علم افزایش در شیء از خود آن است نه از غیر آن، مانند باز کردن پیچیده و گشودن فشرده. و علم خارج کردن گنج‌های محسوس با اسماء و خواصی که در این زمینه می‌دهند، به طوری که عارف (العارف) با آن بر جای گنج می‌ایستد و با اسم سخن می‌گوید، پس زمین از مال پنهان شده در آن شکافته می‌شود، همان‌طور که غنچه از گل شکافته می‌شود. پس هنگامی که آن را ببیند، با اسم دیگری سخن می‌گوید، پس مال با آن خاصیت خارج می‌شود، همان‌طور که آهن به سوی مغناطیس جذب می‌شود، تا جایی که چیزی از آن مال در آن مکان باقی نماند. و شامل علم اعمال مشروع و اینکه مال آن‌ها کجاست و چه چیزی از آن به او می‌رسد. و شامل علم سعادت و شقاوت با علامات است. و شامل علم جهات و اینکه چرا باز می‌گردند و وصف حق (الحق) به فوقیت، آیا فوقیت جهت است یا فوقیت رتبه؟ و شامل معرفت احوال مردم در منازلشان است که در سرای آخرت در آن فرود می‌آیند، و سبب آن احوالی که در آن منازل در آن دگرگون می‌شوند چیست؟ و آیا آن‌ها به عین خود در زمان‌هایی که در آن بودند، بر آن‌ها تکرار می‌شوند یا خیر؟ و شامل رؤیت خداوند توسط بندگانش به دلیل آیه نسبتی است که باز می‌گردد. و شامل شرف ستارگان و زمان بدون برتری دادن است. و شامل علم نفی ایمان با وجود علم است، و این از آشفته‌ترین امور نزد محقق (المحقق) است. و در آن علم بشارت است و اینکه در ظاهر مختص به سعادتمندان نیست، اگرچه مختص به خیر است. پس سخن خداوند متعال: «پس آن‌ها را به عذابی دردناک بشارت ده.» (فَبَشِّرْهُمْ بِعَذابٍ أَلِيمٍ) و سخن درباره این بشارت از نظر لغت و عرف. اما بشارت از طریق عرف، مفهوم آن خیر است و حتماً. و چون این شقی در گمان خود منتظر بشارت بود، به دلیل اینکه خیال می‌کرد بر حق است، گفته شد: «او را بشارت ده» به دلیل انتظارش برای بشارت، اما بشارت برای او به عذابی دردناک بود. و اما از طریق لغت، آن است که به او چیزی گفته شود که در پوست (بشره) او تأثیر بگذارد. زیرا اگر به او خیر گفته شود، در پوست او با گشاده‌رویی و خنده و شادی و اهتزاز و طرب تأثیر می‌گذارد. و اگر به او شر گفته شود، در پوست او با گرفتگی و گریه و اندوه و کینه و غبارآلودگی و ترش‌رویی تأثیر می‌گذارد. و به همین دلیل خداوند متعال فرمود: «چهره‌هایی در آن روز درخشان، خندان و شادمانند.» (وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ ضاحِكَةٌ مُسْتَبْشِرَةٌ) و «و چهره‌هایی در آن روز بر آن‌ها غبار است، که تیرگی آن‌ها را می‌پوشاند.» (ووُجُوهٌ يَوْمَئِذٍ عَلَيْها غَبَرَةٌ تَرْهَقُها قَتَرَةٌ) پس آنچه در پوست آن‌ها تأثیر گذاشته است را ذکر کرد. به همین دلیل بشارت از نظر لغت بر خیر و شر اطلاق می‌شود، اما در عرف چنین نیست. و به همین دلیل خداوند متعال آن را مطلق آورد و مقید نکرد و در حق مؤمنان فرمود: «برای آن‌ها بشارت در زندگی دنیا و در آخرت است.» (لَهُمُ الْبُشْرى فِي الْحَياةِ الدُّنْيا وفي الْآخِرَةِ) و نگفت به چه چیزی، زیرا عرف و قرینه حال اقتضا می‌کند که آن به خیر است. و در آن علم به ابد (الأبد) است و اینکه چرا باز می‌گردد. و آیا ابد (الأبد) زمانی است یا عین زمان است؟ و زمان به چه چیزی باقی می‌ماند؟ آیا به خود باقی می‌ماند یا به غیر خود باقی می‌ماند که آن غیر برای او مانند او باشد، به عنوان ظرفی برای بقا و دوامش؟ یا امری موهوم است که وجود حقیقی عینی ندارد؟ و «خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 4
}