{
  "id": 532,
  "title": {
    "ar": "الباب الثاني والثلاثون وخمسمائة في معرفة حال قطب كان منزله إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً",
    "en": "Chapter Five Hundred and Thirty-Two: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: <<إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً>> (Indeed, prayer has been decreed upon the believers a decree of specified times).",
    "ur": "باب پانچ سو بتیس (۵۳۲) قطب (Qutb) کے حال کی معرفت میں جس کا منزل یہ تھا: \"بیشک نماز مومنوں پر مقررہ وقتوں میں فرض کی گئی ہے\" (إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً)",
    "fa": "باب پانصد و سی و دوم در معرفت حال قطبی که منزل او این بود: «إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً» (همانا نماز بر مؤمنان فریضه‌ای وقت‌دار است)."
  },
  "content": {
    "ar": "## «الباب الثاني والثلاثون وخمسمائة في معرفة حال قطب كان منزله إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً»\n\n\n> إن الصلاة لها وقت تعينه *** شمس وآثارها فالحكم للشمس‏\n\n\n> فانظر إليها بعين القلب إن شرقت *** أو أشرقت لا بعين الحس والنفس‏\n\n\n> فظهرنا لزوال الشمس في فلكي *** وعصرنا لانضمام العقل والحس‏\n\n\n> ومغرب لغروب الحق عن نظري *** وذلكم لارتفاع الشك واللبس‏\n\n\n> إن الأفول دليل يستدل به *** لكي يفرق بين العلم والحدس‏\n\n\n> ثم العشاء إذا ما حمرة ذهبت *** ذهاب من أعدم الأشياء بالحس‏\n\n\n> وعند ما انفجرت أنوارها وبدت *** كأنها خرجت من ظلمة الرمس‏\n\n\n> وعاد مغربها شرقا بها فزهت *** وعاد مطلعها للعرش والكرسي‏\n\n\n> ناجيته في شهود لا انقطاع له *** مؤيد بين حصر الجهر والهمس‏\n\n\n> وهذه خمسة في العد حافظة *** وليس يحفظ أكواني سوى الخمس‏\n\n\n### [الصلاة الوسطى ما هي‏]\n\n\nقال الله سبحانه وتعالى حافِظُوا عَلَى الصَّلَواتِ وليست سوى هذه الخمس الموقتة المعينة المكتوبة وكما أن الخمسة تحفظ نفسها وغيرها الذي هو العشرون وهو ثاني عقد العشر من العشرة والعشرة أول العقود وأقل ما يكون العقد بين اثنين فكذلك الصلاة قسمها الحق نصفين نصفا له ونصفا لعبده وجعلها بين تحريم وتحليل فإذا شرع فيها العبد لم يصرف ذاته إلى غيرها من الأعمال بخلاف غيرها من الأعمال المشروعة فحفظت نفسها حتى تسمى صلاة فإن في الصلاة شغلا وحفظت غيرها وهو المصلي ليبقى عليه اسم المصلي وحكمه فلهذا شرعها الله خمسة فعين الوقت فإن قال قائل بالوتر إنه زائد على الخمسة فتكون ستا قلنا فما زاد إلا من يحفظ نفسها وهي الستة وهي أول عدد كامل فما زاد إلا بما يناسب في‏\nالحفظ فلذا قال السائل هل على غيرها يعني الخمس قال لا إلا أن تطوع وجمع له في الصلاة بين الجهر والسر أعني في القراءة وجمع له أيضا بين القول والفعل والحال وإلهيات في الحركات من قيام وركوع وسجود وجلوس وأثنى على من أتى بهن لم يضيع من حقهن شيئا بالدوام عليها والخشوع فيها وأعطاها الليل والنهار حتى يعم الزمان بركتها وقد بينا من أسرارها ما شاء الله في باب الصلاة من هذا الكتاب وكذلك بينا أيضا من شأنها في كتاب التنزلات الموصلية لنا ثم إن الله شرع طهارة لها مائية وترابية فإن النش‏ء الإنساني لم يكن إلا من تراب كآدم وماء كبني آدم فقال خَلَقَكُمْ من تُرابٍ ومن ماءٍ ومن طِينٍ وهو خلط الماء بالتراب فجعل الطهارة للصلاة بما منه خلقنا فطهارتنا منا من ماء وهو الوضوء وتراب وهو التيمم فنحن نور على نور بحمد الله وما كتب الله هذه الصلاة إلا على المؤمنين وليس المؤمن سوى المصدق بأحدية الكثرة الإلهية لما هي عليه من الأسماء الحسنى والأحكام المختلفة من حيث إن كل اسم إلهي يدل على الذات وعلى معنى ما هو المعنى الآخر الذي يدل عليه الاسم الآخر فله أحدية العين فهو مؤمن أيضا بأحدية العين كما هو مؤمن بأحدية الكثرة فمن لم يكن له هذا الايمان وإلا فليس هو المؤمن الذي كتب الله عليه هذه الصلاة وإنما كتبها على المؤمن دون العالم لعموم الايمان فإن المؤمن هو عين المقلد لأنه المصدق بالخبر لما تعطيه حقيقة الخبر من الاحتمال فأبقى الخبر على أصله فالعالم من علمه بالأمور على ما هي عليه أن لا يزيل الخبر عن احتماله بالنظر إلى ذات الخبر فهو عالم بصدق هذا الخبر المعين لأن الخبر وإن اقتضت ذاته الاحتمال فإنه لا بد أن يكون في نفسه موصوفا بأحد الاحتمالين إما صدق وإما كذب ولا يعرف ما هو عليه من هذين الوصفين إلا بدليل فهذا هو حظ العالم فقد صدق به العالم أنه صدق لا كذب أعني هذا الخبر المعين وقلده في هذا التصديق المؤمن فالمؤمن العالم قام له دليل العلم على إن المخبر صادق وأن هذا الخبر المعين صدق فهو مؤمن بلا شك وأعطى العالم نفسه الأمان أن ينقلب العلم جهلا وصدق المقلد العالم فيما أخبره به من صدق هذا الخبر فاشترك الكل في نعت الايمان فلو كتبها الله على العلماء دون المؤمنين لما وجبت على المقلدين والعلماء لهم صفة الايمان فكتب على الوصف العام ولو لا الحق تعالى ما نزل إلى عباده ما وصفهم تعالى بالعلم به ولا بالإيمان فهم أحق بالعلم به من علمه به فإن علم الخلق به علم اضطرار وافتقار ذاتي لما تعطيه ذات الممكن من الاستناد إلى المرجح فبنزوله إلينا عرفناه فهو يظهر بنا ولا يتمكن لنا أن نظهر به فيجمع سبحانه بين نعت السادات والعباد ولا يتمكن للعباد أن يكونوا أربابا في أنفسهم وإن ظهروا بنعوت سيدهم وإنما كلامنا في نفس الأمر لا فيما يجدونه في أوقات فما هو له تعالى فمعلوم من القسمة وما هو للعبد فمعلوم وما وقع فيه الاشتراك فما هو لله فهو لله في عين الاشتراك وما هو للعبد فهو للعبد في عين الاشتراك فهو في نفس الأمر معين وإن وقع الاشتراك فليس إلا في الألفاظ الدالة على الاشتراك وأما في نفس الأمر فلا اشتراك بوجه من الوجوه فإن كل واحد على نصيبه المعين له وإن لم يكن الأمر كذلك اختلطت الحقائق وإِنَّ كَثِيراً من الْخُلَطاءِ لَيَبْغِي بَعْضُهُمْ عَلى‏ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ وقَلِيلٌ ما هُمْ وقليل أيضا ما هم فكل مصل أدى صلاته لوقتها ولم يطلع ولا أنتج له معرفة بسر\n\n\nالقدر الذي قد أومأنا إليه في هذا الكتاب في مواضع كثيرة مختلفة بطرائق عجيبة فما صلى الصلاة لوقتها وذلك أن الله ما شرع هذه العبادات لإقامة نشأة صورتها الظاهرة بل لما تدل عليه وتعطيه من جانب الحق من المعرفة به وإن لم تكن الصورة قد نفخ القائل فيها روحا تحيي به ولا ينفخ فيها روحا إلا بإذن ربه كما قال وإِذْ تَخْلُقُ من الطِّينِ كَهَيْئَةِ الطَّيْرِ فقد شارك كل مصور وما تعلق به ذم كما تعلق بالمصورين فإنه ما صوره عليه السلام إلا بإذن الله ثم قال فَأَنْفُخُ فِيهِ فَيَكُونُ طَيْراً بِإِذْنِ الله فزال‏\n\n\nمن هيأة الطائر وعاد طائرا فكذلك عمل العبد إذا عمله بالإيمان من حيث إن الحق أمره بذلك العمل فقد أذن له في إنشاء تلك الصورة فقد شارك المنافق كما شارك المصورين من خلق من الطين كهيئة الطير فإن المنافق ما أذن الله له أن ينشئ صورة العمل على ذلك الحد وما أمر الله بإنشاء صور الأعمال إلا للمؤمنين فلما وقع الاشتراك في ظاهر الصورة بين المؤمن والمنافق نفخ المؤمن بإيمانه فيها روحا فعادت‏\nحياة لا تشاهد سوى منشئها وهو هذا المؤمن فيجدها يوم القيامة حياة تشفع له وتأخذ بيده والمنافق يجدها ميتة فيقال له أحيها فلا يستطيع وهي حية في نفس الأمر ولكن بإحياء الحق وقد أخذ الله ببصر هذا المنافق عن إدراك حياتها كما أخذ الله بأبصارنا عن إدراك حياة المسمى جمادا ونباتا مع علمنا أنه حي في نفس الأمر إيمانا فإنه مسبح بحمد الله ولا يسبح إلا حي ناطق والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Five Hundred and Thirty-Two: On Knowing the State of a Pole Whose Station Was: <<Indeed, prayer has been decreed upon the believers at fixed times>>\n\nPrayer has a time determined by\nThe sun and its effects, so the ruling belongs to the sun.\n\nLook upon it with the eye of the Heart (القلب) when it rises\nOr shines forth, not with the eye of the senses (الحس) or the lower soul (النفس).\n\nOur Noon (Zuhr) appeared at the sun's decline in my celestial sphere,\nAnd our Afternoon (Asr) is for the joining of the Intellect (العقل) and the Senses.\n\nAnd Maghrib (Sunset) is for the setting of The Real (الحق) from my sight,\nAnd that is due to the lifting of doubt and confusion.\n\nIndeed, the setting (الأفول) is a sign used as proof\nTo distinguish between Knowledge (العلم) and Conjecture (الحدس).\n\nThen Isha (Nightfall) is when the redness departs,\nThe departure of one who annihilates things by the senses.\n\nAnd when its lights burst forth and appeared,\nAs if they emerged from the darkness of the grave (الرمس).\n\nAnd its setting place returned to the East by it, so it flourished,\nAnd its rising place returned to the Throne (العرش) and the Footstool (الكرسي).\n\nI communed with Him in a witnessing (شهود) that has no cessation,\nConfirmed between the restriction of the loud voice (الجهر) and the whisper (الهمس).\n\nAnd these are five in number, preserving,\nAnd nothing preserves my existences (أكواني) except these five.\n\n### [What is the Middle Prayer (الصلاة الوسطى)?]\n\nAllah, the Exalted, said: <<Guard strictly the prayers>> (حافِظُوا عَلَى الصَّلَواتِ). These are none other than these five fixed, specified, prescribed prayers. Just as the number five preserves itself and that which is other than it—which is twenty, being the second multiple of ten from ten, and ten is the first multiple, and the minimum for a multiple is between two—so too, The Real (الحق) divided the prayer into two halves: one half for Him and one half for His servant, and He placed it between prohibition (تحريم) and permission (تحليل).\n\nWhen the servant begins it, he does not divert his essence (ذاته) to any other actions, unlike other prescribed actions. Thus, it preserves itself until it is called a prayer (صلاة), for in the prayer there is occupation. And it preserves that which is other than it—namely, the worshipper—so that the name and ruling of 'worshipper' remain upon him. For this reason, Allah prescribed it as five, thereby specifying the time. If someone argues that the Witr prayer is an addition to the five, making them six, we say: It only increased by that which preserves itself, which is the number six, and six is the first perfect number. Thus, the increase only occurred with what is suitable for preservation. Therefore, when the questioner asked, \"Is there anything besides them [meaning the five]?\" [The Prophet] replied, \"No, unless you perform voluntary prayer.\"\n\nIn the prayer, He combined for the servant the loud voice (الجهر) and the secret voice (السر)—meaning in the recitation—and He also combined for him speech (القول), action (الفعل), spiritual state (الحال), and Divine aspects (إلهيات) in the movements of standing, bowing, prostrating, and sitting. He praised those who performed them, not neglecting any of their rights, by maintaining them constantly and having reverence (الخشوع) within them. He gave them the night and the day so that their blessing encompasses all time. We have already explained, by the will of Allah, some of its secrets in the chapter on Prayer in this book, and likewise, we have explained its significance in our book *Al-Tanazzulat al-Mawsiliyya*.\n\nFurthermore, Allah prescribed for it a purification (طهارة) that is aqueous and terrestrial. For human generation (النش‏ء الإنساني) was only from earth, like Adam, and water, like the children of Adam. He said: <<He created you from dust, and from water, and from clay>> (خَلَقَكُمْ من تُرابٍ ومن ماءٍ ومن طِينٍ)—which is the mixing of water with earth. Thus, He made the purification for the prayer from that out of which we were created. Our purification is from ourselves: from water, which is ablution (الوضوء), and from earth, which is dry ablution (التيمم). Thus, we are light upon light, praise be to Allah.\n\nAnd Allah decreed this prayer only upon the believers (المؤمنين). The believer is none other than the one who affirms the Oneness (أحدية) of the Divine Multiplicity (الكثرة الإلهية) due to the Beautiful Names (الأسماء الحسنى) and the varying rulings they entail, in that every Divine Name indicates the Essence (الذات) and also indicates a meaning—which is the other meaning indicated by the other Name. Therefore, he possesses the Oneness of the Entity (أحدية العين). Thus, he is also a believer in the Oneness of the Entity, just as he is a believer in the Oneness of Multiplicity. Whoever does not possess this faith is not the believer upon whom Allah decreed this prayer.\n\nHe decreed it upon the believer rather than the Knower/Scholar (العالم) due to the generality of faith (الايمان). For the believer is essentially the follower (المقلد), because he affirms the report based on the potential meanings inherent in the reality of the report, thus leaving the report upon its original state. The Knower is one whose knowledge of things as they truly are dictates that he does not remove the report from its potential meanings when considering the essence of the report itself. He knows the truthfulness of this specific report because, although the essence of the report necessitates potential meanings, it must inherently be described by one of two possibilities: either truth or falsehood. And what state it is in regarding these two descriptions is only known through evidence (دليل). This is the portion of the Knower. The Knower has affirmed that this specific report is true, not false, and the believer follows him in this affirmation. The believing Knower has the evidence of knowledge established for him that the Informer is truthful and that this specific report is true; thus, he is undoubtedly a believer. The Knower granted himself security that knowledge would not turn into ignorance, and the follower affirmed the Knower regarding what he reported concerning the truthfulness of this report. Thus, all shared the characteristic of faith. If Allah had decreed it upon the Knowers rather than the believers, it would not have been obligatory upon the followers. Since the Knowers possess the attribute of faith, He decreed it upon the general description [of the believer].\n\nWere it not for The Real (الحق), the Exalted, descending to His servants, He would not have described them with knowledge of Him nor with faith. They are more deserving of knowledge of Him than His knowledge of them, for the knowledge of creation concerning Him is a knowledge of necessity and essential need (افتقار ذاتي), due to what the essence of the contingent being (الممكن) necessitates in relying upon the determinant (المرجح). It is through His descent to us that we know Him. He manifests through us, but it is not possible for us to manifest through Him. Thus, the Exalted combines the attributes of the Masters (السادات) and the servants (العباد). It is not possible for the servants to be Lords (أربابا) in themselves, even if they manifest through the attributes of their Master. Our discussion concerns the reality of the matter (نفس الأمر), not what they experience in certain moments.\n\nWhat belongs to Allah, the Exalted, is known from the division; what belongs to the servant is known. And regarding what involves partnership (الاشتراك): what belongs to Allah remains Allah's in the very entity of the partnership, and what belongs to the servant remains the servant's in the very entity of the partnership. Thus, in the reality of the matter, it is specified. If partnership occurs, it is only in the words indicating partnership. As for the reality of the matter, there is no partnership whatsoever. For everyone is upon his specified portion. If the matter were not so, the Realities (الحقائق) would be confused. <<And indeed, many partners (الْخُلَطاءِ) oppress one another, except for those who have believed and done righteous deeds—and few are they>> (وَإِنَّ كَثِيراً من الْخُلَطاءِ لَيَبْغِي بَعْضُهُمْ عَلى‏ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ وقَلِيلٌ ما هُمْ). And few indeed are they.\n\nEvery worshipper who performs his prayer at its time, yet is not informed of, nor does it produce for him, Gnosis (معرفة) of the secret of Divine Decree (سر القدر)—to which we have alluded in this book in many different places and marvelous ways—has not truly prayed the prayer at its time. This is because Allah did not prescribe these acts of worship merely for the establishment of the phenomenal form (نشأة صورتها الظاهرة), but rather for what they signify and what they yield from the side of The Real (الحق) in terms of Gnosis of Him.\n\nEven if the form has not had a spirit breathed into it by the speaker, by which it lives—and a spirit is only breathed into it by the permission of its Lord—as He said: <<When you created from clay the shape of a bird>> (وإِذْ تَخْلُقُ من الطِّينِ كَهَيْئَةِ الطَّيْرِ). Here, [Jesus] shared the act with every image-maker (مصور), yet no blame attached to him as it attached to other image-makers, because he only formed it, peace be upon him, by Allah's permission. Then He said: <<Then you breathed into it, and it became a bird by My permission>> (فَأَنْفُخُ فِيهِ فَيَكُونُ طَيْراً بِإِذْنِ الله). Thus, it departed from the mere shape of a bird and returned as a bird.\n\nLikewise, when the servant performs an action with faith, in that The Real commanded him with that action, He has permitted him to establish that form. Here, he shares the act with the hypocrite (المنافق), just as [Jesus] shared the act with the image-makers who created from clay the shape of a bird. However, Allah did not permit the hypocrite to establish the form of the action to that extent, for Allah only commanded the establishment of the forms of actions for the believers. When the outward form was shared between the believer and the hypocrite, the believer breathed a spirit into it through his faith, and it returned as a life that is witnessed only by its originator, who is this believer. He will find it on the Day of Resurrection as a life that intercedes for him and takes him by the hand. The hypocrite will find it dead, and he will be told, \"Bring it to life,\" but he will be unable. Yet, it is alive in the reality of the matter, but by the vivification of The Real. Allah has veiled the sight of this hypocrite from perceiving its life, just as Allah has veiled our sights from perceiving the life of what is called inanimate (جمادا) and plant life (نباتا), even though we know by faith that it is alive in the reality of the matter, for it glorifies Allah with praise, and nothing glorifies except that which is living and speaking. And Allah <<speaks the Truth, and He guides to the way>> (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ).",
    "ur": "باب نمبر پانچ سو بتیس: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"بیشک نماز مومنوں پر مقررہ وقت پر فرض کی گئی ہے\" (إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً) [النساء: 103]۔\n\nنماز کا ایک وقت ہے جسے سورج *** اور اس کے اثرات متعین کرتے ہیں، لہٰذا حکم سورج کا ہے\nپس اسے قلب کی آنکھ سے دیکھ جب وہ طلوع ہو *** یا چمک اٹھے، نہ کہ حواس اور نفس کی آنکھ سے\nمیرا ظہر میرے فلک میں سورج کے زوال کے وقت ہے *** اور میری عصر عقل اور حس کے یکجا ہونے کے لیے ہے\nاور مغرب میری نظر سے ذات حق (الحق) کے غروب ہونے کے لیے ہے *** اور یہ شک اور التباس کے دور ہونے کے لیے ہے\nبیشک غروب ہونا ایک دلیل ہے جس سے استدلال کیا جاتا ہے *** تاکہ علم اور گمان (حدس) کے درمیان فرق کیا جا سکے\nپھر عشاء جب سرخی زائل ہو جائے *** اس شخص کے زائل ہونے کی طرح جو حواس کے ذریعے اشیاء کو معدوم کر دیتا ہے\nاور جب اس کے انوار پھوٹ پڑیں اور ظاہر ہوں *** گویا وہ قبر کی تاریکی سے نکلے ہیں\nاور اس کا مغرب اس کے ساتھ مشرق بن کر لوٹ آیا، پس وہ چمک اٹھی *** اور اس کا مطلع عرش اور کرسی کی طرف لوٹ آیا\nمیں نے اس سے ایسے شہود (الشہود) میں سرگوشی کی جس میں کوئی انقطاع نہیں *** جو جہر اور سرگوشی کی قید کے درمیان مؤید ہے\nاور یہ گنتی میں پانچ ہیں جو حفاظت کرنے والی ہیں *** اور میری کائناتوں کی حفاظت ان پانچ کے سوا کوئی نہیں کرتا\n\n[صلاۃ وسطیٰ کیا ہے؟]\n\nذات حق (الحق) سبحانہ و تعالیٰ نے فرمایا: \"نمازوں کی حفاظت کرو\" (حافِظُوا عَلَى الصَّلَواتِ) [البقرۃ: 238]۔ اور یہ ان پانچ مقررہ، معین، اور فرض کی گئی نمازوں کے سوا کوئی نہیں ہیں۔ اور جس طرح پانچ خود اپنی اور اپنے علاوہ کی حفاظت کرتی ہیں جو کہ بیس ہے، اور یہ دس کے دوسرے عقد کا دوسرا ہے، اور دس پہلا عقد ہے، اور عقد کم از کم دو کے درمیان ہوتا ہے، اسی طرح ذات حق (الحق) نے نماز کو دو حصوں میں تقسیم کیا: ایک حصہ اس کے لیے اور ایک حصہ اس کے بندے کے لیے۔ اور اسے تحریم (تکبیر تحریمہ) اور تحلیل (سلام) کے درمیان رکھا۔ جب بندہ اس میں داخل ہوتا ہے تو وہ اپنی ذات کو دیگر اعمال سے اس کی طرف نہیں پھیرتا، برخلاف دیگر مشروع اعمال کے۔ پس اس نے اپنی حفاظت کی یہاں تک کہ وہ نماز کہلائی، کیونکہ نماز میں مشغولیت (شغل) ہے۔ اور اس نے اپنے علاوہ کی حفاظت کی، یعنی نمازی کی، تاکہ اس پر نمازی کا نام اور اس کا حکم باقی رہے۔ اسی لیے اللہ نے اسے پانچ مقرر کیا اور وقت کو معین کیا۔ اگر کوئی کہنے والا وتر کے بارے میں کہے کہ یہ پانچ سے زائد ہے، تو یہ چھ ہو جائیں گی، تو ہم کہیں گے کہ جو چیز زائد ہوئی ہے وہ صرف اس کی حفاظت کرنے والی ہے، اور وہ چھ ہے، اور یہ پہلا کامل عدد ہے۔ پس یہ صرف اس چیز کے ساتھ زائد ہوئی جو حفاظت میں مناسب ہے۔\n\nاسی لیے سائل نے پوچھا: کیا ان (پانچ) کے علاوہ کوئی اور (نماز) ہے؟ فرمایا: \"نہیں، مگر یہ کہ تم نفل پڑھو۔\" اور اس کے لیے نماز میں جہر اور سر (یعنی قراءت میں) کو جمع کیا، اور اس کے لیے قول، فعل اور حال کو بھی جمع کیا، اور حرکات میں الٰہیات کو جمع کیا، جیسے قیام، رکوع، سجدہ اور قعود۔ اور اس شخص کی تعریف کی جس نے ان کو ادا کیا اور ان کے حق میں سے کسی چیز کو ضائع نہیں کیا، ان پر دوام اختیار کرنے اور ان میں خشوع اختیار کرنے کے ذریعے، اور اسے رات اور دن عطا کیے تاکہ اس کی برکت زمانے کو عام ہو جائے۔ ہم نے اس کتاب میں باب الصلاۃ میں اس کے اسرار میں سے وہ کچھ بیان کیا جو اللہ نے چاہا، اور اسی طرح ہم نے اپنی کتاب *التنزلات الموصلیۃ* میں بھی اس کے معاملے میں بیان کیا ہے۔ پھر اللہ نے اس کے لیے آبی اور خاکی طہارت مشروع کی۔ کیونکہ انسانی نشوونما آدم کی طرح مٹی سے اور بنی آدم کی طرح پانی سے ہی ہوئی ہے۔ پس فرمایا: \"اس نے تمہیں مٹی سے اور پانی سے اور گارے سے پیدا کیا\" (خَلَقَكُمْ من تُرابٍ ومن ماءٍ ومن طِينٍ) [الحج: 5]، اور گارا پانی کو مٹی کے ساتھ ملانا ہے۔ پس اس نے نماز کے لیے طہارت کو اس چیز سے بنایا جس سے ہمیں پیدا کیا گیا۔ پس ہماری طہارت ہم میں سے ہے، پانی سے جو کہ وضو ہے، اور مٹی سے جو کہ تیمم ہے۔ پس ہم اللہ کے فضل سے نور پر نور ہیں۔ اور اللہ نے یہ نماز صرف مومنوں پر فرض کی ہے، اور مومن اس شخص کے سوا کوئی نہیں جو الٰہی کثرت کی احدیت کی تصدیق کرتا ہے، اس حیثیت سے کہ وہ اسماء حسنیٰ اور مختلف احکام پر مشتمل ہے، اس لحاظ سے کہ ہر اسم الٰہی ذات پر اور ایک ایسے معنی پر دلالت کرتا ہے جو وہ دوسرا معنی ہے جس پر دوسرا اسم دلالت کرتا ہے۔ پس اس کے لیے عین کی احدیت ہے، لہٰذا وہ عین کی احدیت پر بھی ایمان رکھتا ہے، جیسا کہ وہ کثرت کی احدیت پر ایمان رکھتا ہے۔ پس جس کے پاس یہ ایمان نہیں، تو وہ وہ مومن نہیں جس پر اللہ نے یہ نماز فرض کی ہے۔\n\nاور اس نے یہ نماز عالم کے بجائے مومن پر اس لیے فرض کی کہ ایمان عام ہے۔ کیونکہ مومن عین مقلد ہے، اس لیے کہ وہ خبر کی تصدیق کرنے والا ہے، اس احتمال کی وجہ سے جو خبر کی حقیقت دیتی ہے، پس اس نے خبر کو اس کی اصل پر باقی رکھا۔ جبکہ عالم وہ ہے جو امور کو ان کی حقیقت کے مطابق جانتا ہے کہ وہ خبر کو اس کے احتمال سے، خود خبر کی ذات کو دیکھتے ہوئے، زائل نہیں کرتا۔ پس وہ اس معین خبر کی سچائی کا عالم ہے، کیونکہ اگرچہ خبر کی ذات احتمال کا تقاضا کرتی ہے، لیکن اسے اپنی ذات میں دونوں احتمالات میں سے کسی ایک کے ساتھ موصوف ہونا ضروری ہے، یا تو سچائی یا جھوٹ۔ اور ان دونوں اوصاف میں سے وہ کس پر ہے، یہ دلیل کے بغیر معلوم نہیں ہو سکتا۔ پس یہ عالم کا حصہ ہے۔ عالم نے اس کی تصدیق کی کہ یہ سچ ہے جھوٹ نہیں، یعنی یہ معین خبر۔ اور مومن نے اس تصدیق میں عالم کی تقلید کی۔ پس مومن عالم کے لیے علم کی دلیل قائم ہوئی کہ خبر دینے والا سچا ہے اور یہ معین خبر سچ ہے۔ پس وہ بلاشبہ مومن ہے۔ اور عالم نے اپنی ذات کو یہ امان دی کہ علم جہل میں تبدیل نہ ہو، اور مقلد نے عالم کی تصدیق کی جو اس نے اسے اس خبر کی سچائی کے بارے میں بتایا۔ پس سب ایمان کی صفت میں شریک ہو گئے۔ اگر اللہ اسے علماء پر فرض کرتا مومنوں کے بجائے، تو یہ مقلدین پر واجب نہ ہوتی۔ اور علماء کے پاس ایمان کی صفت موجود ہے، پس اسے عام وصف پر فرض کیا گیا۔ اور اگر ذات حق (الحق) تعالیٰ نہ ہوتا تو وہ اپنے بندوں پر وہ چیز نازل نہ کرتا جس کے ذریعے اس نے انہیں اپنے علم اور ایمان سے متصف کیا۔ پس وہ اس کے علم کے زیادہ حقدار ہیں بہ نسبت اس کے کہ وہ اسے جانیں۔ کیونکہ مخلوق کا اس کا علم اضطرار کا علم ہے اور ذاتی احتیاج کا، اس چیز کی وجہ سے جو ممکن کی ذات مرجح (ترجیح دینے والے) کی طرف استناد کا تقاضا کرتی ہے۔ پس اس کے ہمارے پاس نزول کے ذریعے ہم نے اسے پہچانا۔ پس وہ ہمارے ذریعے ظاہر ہوتا ہے، اور ہمارے لیے یہ ممکن نہیں کہ ہم اس کے ذریعے ظاہر ہوں۔ پس وہ سبحانہ سرداری اور بندگی کی صفات کو جمع کرتا ہے، اور بندوں کے لیے یہ ممکن نہیں کہ وہ اپنی ذات میں رب بن جائیں، اگرچہ وہ اپنے آقا کی صفات کے ساتھ ظاہر ہوں۔ اور ہماری گفتگو نفس الامر کے بارے میں ہے، نہ کہ ان چیزوں کے بارے میں جو وہ اوقات میں پاتے ہیں۔ پس جو کچھ اللہ تعالیٰ کے لیے ہے وہ تقسیم سے معلوم ہے، اور جو کچھ بندے کے لیے ہے وہ معلوم ہے، اور جس میں اشتراک واقع ہوا ہے، تو جو اللہ کے لیے ہے وہ اشتراک کے عین میں اللہ کے لیے ہے، اور جو بندے کے لیے ہے وہ اشتراک کے عین میں بندے کے لیے ہے۔ پس وہ نفس الامر میں معین ہے، اگرچہ اشتراک واقع ہوا ہو۔ اور اشتراک صرف ان الفاظ میں ہے جو اشتراک پر دلالت کرتے ہیں، لیکن نفس الامر میں کسی بھی صورت میں کوئی اشتراک نہیں ہے۔ کیونکہ ہر ایک اپنے معین حصے پر ہے، اور اگر معاملہ ایسا نہ ہوتا تو حقائق خلط ملط ہو جاتے۔ \"اور بیشک بہت سے شریک ایک دوسرے پر زیادتی کرتے ہیں، سوائے ان لوگوں کے جو ایمان لائے اور نیک عمل کیے، اور وہ بہت کم ہیں\" (وَإِنَّ كَثِيراً من الْخُلَطاءِ لَيَبْغِي بَعْضُهُمْ عَلى‏ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ وقَلِيلٌ ما هُمْ) [ص: 24]، اور وہ بھی بہت کم ہیں۔\n\nپس ہر نمازی جس نے اپنی نماز کو اس کے وقت پر ادا کیا اور اسے اس رازِ قدر کی معرفت (المعرفۃ) حاصل نہ ہوئی جس کی طرف ہم نے اس کتاب میں مختلف مقامات پر عجیب طریقوں سے اشارہ کیا ہے، تو اس نے نماز کو اس کے وقت پر ادا نہیں کیا۔ اور یہ اس لیے کہ اللہ نے یہ عبادات ان کی ظاہری صورت کی نشوونما کو قائم کرنے کے لیے مشروع نہیں کیں، بلکہ اس معرفت (المعرفۃ) کے لیے جو وہ ذات حق (الحق) کی طرف سے اس پر دلالت کرتی ہیں اور عطا کرتی ہیں، اگرچہ کہنے والے نے اس صورت میں کوئی روح نہ پھونکی ہو جس سے وہ زندہ ہو، اور وہ اس میں روح نہیں پھونکتا مگر اپنے رب کے اذن سے، جیسا کہ فرمایا: \"اور جب تم مٹی سے پرندے کی شکل جیسی چیز بناتے تھے\" (وَإِذْ تَخْلُقُ من الطِّينِ كَهَيْئَةِ الطَّيْرِ) [المائدۃ: 110]۔ پس ہر صورت گر نے شرکت کی، اور اس پر کوئی مذمت نہیں ہوئی جیسا کہ صورت گروں پر ہوتی ہے، کیونکہ اس (عیسیٰ علیہ السلام) نے اسے صرف اللہ کے اذن سے صورت دی، پھر فرمایا: \"پھر میں اس میں پھونکتا تھا تو وہ اللہ کے حکم سے پرندہ بن جاتا تھا\" (فَأَنْفُخُ فِيهِ فَيَكُونُ طَيْراً بِإِذْنِ الله) [المائدۃ: 110]۔ پس وہ پرندے کی ہیئت سے زائل ہو کر پرندہ بن گیا۔\n\nاسی طرح بندے کا عمل جب وہ اسے ایمان کے ساتھ کرتا ہے، اس حیثیت سے کہ ذات حق (الحق) نے اسے اس عمل کا حکم دیا ہے، تو اس نے اسے اس صورت کو ایجاد کرنے کی اجازت دی ہے۔ پس اس نے منافق کے ساتھ شرکت کی، جیسا کہ اس نے ان صورت گروں کے ساتھ شرکت کی جنہوں نے مٹی سے پرندے کی ہیئت بنائی۔ کیونکہ منافق کو اللہ نے اس حد تک عمل کی صورت ایجاد کرنے کی اجازت نہیں دی، اور اللہ نے اعمال کی صورتیں ایجاد کرنے کا حکم صرف مومنوں کو دیا ہے۔ پس جب مومن اور منافق کے درمیان ظاہری صورت میں اشتراک واقع ہوا، تو مومن نے اپنے ایمان کے ذریعے اس میں روح پھونکی، پس وہ زندگی بن گئی جسے اس کے موجد کے سوا کوئی نہیں دیکھتا، اور وہ یہی مومن ہے۔ پس وہ اسے قیامت کے دن ایک زندگی پائے گا جو اس کی شفاعت کرے گی اور اس کا ہاتھ پکڑے گی، اور منافق اسے مردہ پائے گا، تو اسے کہا جائے گا کہ اسے زندہ کر، مگر وہ ایسا نہیں کر سکے گا۔ حالانکہ وہ نفس الامر میں زندہ ہے، لیکن ذات حق (الحق) کے زندہ کرنے سے۔ اور اللہ نے اس منافق کی بصارت کو اس کی زندگی کے ادراک سے روک دیا، جیسا کہ اللہ نے ہماری بصارتوں کو اس چیز کی زندگی کے ادراک سے روک دیا جسے جمادات اور نباتات کہا جاتا ہے، باوجود اس کے کہ ہم ایمان کے ذریعے جانتے ہیں کہ وہ نفس الامر میں زندہ ہے۔ کیونکہ وہ اللہ کی حمد کے ساتھ تسبیح کرتا ہے، اور تسبیح صرف زندہ اور ناطق ہی کرتا ہے۔ \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ) [الأحزاب: 4]۔",
    "fa": "باب پانصد و سی و دوم در معرفت حال قطبی که منزل او این آیه بود: «إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً» (همانا نماز بر مؤمنان فریضه‌ای وقت‌دار است).\n\nإن الصلاة لها وقت تعينه *** شمس وآثارها فالحكم للشمس‏\nهمانا نماز را وقتی است که خورشید و آثارش آن را تعیین می‌کند، پس حکم از آنِ خورشید است.\n\nفانظر إليها بعين القلب إن شرقت *** أو أشرقت لا بعين الحس والنفس‏\nپس به آن با چشم دل بنگر، اگر طلوع کرد یا درخشید، نه با چشم حس و نفس.\n\nفظهرنا لزوال الشمس في فلكي *** وعصرنا لانضمام العقل والحس‏\nپس نماز ظهر ما برای زوال خورشید در فلک من است، و نماز عصر ما برای پیوستن عقل و حس است.\n\nومغرب لغروب الحق عن نظري *** وذلكم لارتفاع الشك واللبس‏\nو مغرب برای غروب حق (الحق) از نظر من است، و این برای برطرف شدن شک و اشتباه است.\n\nإن الأفول دليل يستدل به *** لكي يفرق بين العلم والحدس‏\nهمانا افول (غروب) دلیلی است که به آن استدلال می‌شود، تا میان علم و گمان (حدس) فرق گذاشته شود.\n\nثم العشاء إذا ما حمرة ذهبت *** ذهاب من أعدم الأشياء بالحس‏\nسپس عشاء (نماز شام) هنگامی است که سرخی (شفق) از بین برود، مانند از بین رفتن کسی که اشیاء را با حس معدوم می‌سازد.\n\nوعند ما انفجرت أنوارها وبدت *** كأنها خرجت من ظلمة الرمس‏\nو هنگامی که انوارش شکافته شد و آشکار گشت، گویی از تاریکی گور (الرمس) خارج شده است.\n\nوعاد مغربها شرقا بها فزهت *** وعاد مطلعها للعرش والكرسي‏\nو مغربش با آن به شرق بازگشت و درخشید، و مطلعش به عرش و کرسی بازگشت.\n\nناجيته في شهود لا انقطاع له *** مؤيد بين حصر الجهر والهمس‏\nبا او در شهودی (الشهود) بی‌انقطاع مناجات کردم، که میان محدودیت آشکار و پنهان (جهر و همس) تأیید شده است.\n\nوهذه خمسة في العد حافظة *** وليس يحفظ أكواني سوى الخمس‏\nو این پنج در شمار، حافظ است، و هستی‌های (أکوانی) مرا جز این پنج حفظ نمی‌کند.\n\n### [نماز وسطی چیست؟]\n\nخداوند سبحان و متعال فرمود: «حافِظُوا عَلَى الصَّلَواتِ» (بر نمازها مواظبت کنید). و این نمازها چیزی جز همین پنج نماز وقت‌دار، معین و واجب نیستند. همان‌طور که عدد پنج، خود و غیر خود را که بیست است (و بیست دومین عقد از ده است، و ده اولین عقود است و کمترین چیزی که عقد میان دو چیز باشد) حفظ می‌کند؛ همچنین حق (الحق) نماز را به دو نیم تقسیم کرد: نیمی برای او و نیمی برای بنده‌اش. و آن را میان تحریم و تحلیل قرار داد. هنگامی که بنده وارد نماز می‌شود، ذات خود را به غیر آن از اعمال دیگر منصرف نمی‌کند، برخلاف سایر اعمال مشروع. پس نماز خود را حفظ کرد تا «نماز» نامیده شود، زیرا در نماز اشتغالی است؛ و غیر خود را که نمازگزار است حفظ کرد تا نام و حکم نمازگزار بر او باقی بماند. به همین دلیل خداوند آن را پنج‌گانه تشریع کرد و وقت را معین نمود. اگر کسی بگوید که نماز وتر (فرد) بر این پنج اضافه است و شش می‌شود، می‌گوییم: اضافه نشد مگر چیزی که خود را حفظ می‌کند، و آن شش است که اولین عدد کامل است. پس اضافه نشد مگر به آنچه در حفظ مناسبت دارد. از این رو، وقتی سؤال‌کننده پرسید: آیا بر غیر این پنج (نماز) چیزی واجب است؟ پاسخ داد: خیر، مگر اینکه داوطلبانه (تطوع) باشد. و در نماز برای او میان جهر (آشکار خواندن) و سر (پنهان خواندن) در قرائت جمع کرد، و همچنین میان قول و فعل و حال جمع نمود، و الهیات (إلهیات) را در حرکات از قیام و رکوع و سجود و جلوس قرار داد. و کسی را که این‌ها را به جا آورد و چیزی از حق آن‌ها را ضایع نکرد، با مداومت بر آن‌ها و خشوع در آن‌ها، ستود. و شب و روز را به آن اختصاص داد تا برکتش زمان را فرا گیرد. و ما از اسرار آن، آنچه را که خدا خواست، در باب نماز همین کتاب بیان کردیم، و همچنین از شأن آن در کتاب «التنزلات الموصلية» خود نیز توضیح دادیم.\n\nسپس خداوند برای آن طهارتی (پاکیزگی) آبی و خاکی تشریع کرد، زیرا نشأت انسانی جز از خاک (مانند آدم) و آب (مانند بنی آدم) نبوده است. پس فرمود: «خَلَقَكُمْ من تُرابٍ ومن ماءٍ ومن طِينٍ» (شما را از خاک و از آب و از گِل آفرید). و گِل همان آمیختن آب با خاک است. پس طهارت برای نماز را از همان چیزی قرار داد که ما از آن خلق شده‌ایم. بنابراین، طهارت ما از خود ماست: از آب که وضو است، و از خاک که تیمم است. پس ما به حمدالله نور بر نور هستیم. و خداوند این نماز را جز بر مؤمنان واجب نکرده است. و مؤمن کسی نیست جز تصدیق‌کننده به احدیت کثرت الهی، به سبب آنچه اسماء حسنی و احکام مختلف بر آن دلالت دارند؛ از این جهت که هر اسم الهی بر ذات و بر معنایی دلالت می‌کند که آن معنای دیگری است که اسم دیگر بر آن دلالت دارد. پس برای او احدیت عین (وحدت ذاتی) وجود دارد، و او به احدیت عین نیز مؤمن است، همان‌طور که به احدیت کثرت مؤمن است. پس کسی که این ایمان را نداشته باشد، مؤمنی نیست که خداوند این نماز را بر او واجب کرده است.\n\nو نماز را تنها بر مؤمن واجب کرد نه بر عالم، به دلیل عمومیت ایمان. زیرا مؤمن همان مقلّد است، چون او تصدیق‌کننده خبر است به سبب آنچه حقیقت خبر از احتمال می‌دهد، پس خبر را بر اصل خود باقی می‌گذارد. اما عالم کسی است که علمش به امور بر همان صورتی است که هستند، یعنی خبر را از احتمالش با نظر به ذات خبر زایل نمی‌کند. پس او به صدق این خبر معین عالم است، زیرا خبر اگرچه ذاتش مقتضی احتمال است، اما ناگزیر باید در نفس خود به یکی از دو احتمال (یا صدق یا کذب) متصف باشد، و با دلیل شناخته می‌شود که بر کدام یک از این دو وصف است. این بهره عالم است. پس عالم به صدق آن تصدیق کرد که صدق است نه کذب، منظورم این خبر معین است. و مؤمن در این تصدیق از او تقلید کرد. پس مؤمنِ عالم، دلیل علم برایش اقامه شده که خبردهنده صادق است و این خبر معین صدق است، پس او بی‌شک مؤمن است. و عالم به خود امان داد که علم به جهل تبدیل نشود. و مقلّد، عالم را در آنچه از صدق این خبر به او خبر داده بود، تصدیق کرد. پس همه در صفت ایمان مشترک شدند. اگر خداوند آن را بر علما واجب می‌کرد نه بر مؤمنان، بر مقلدان واجب نمی‌شد. و علما نیز صفت ایمان را دارند، پس (خداوند) بر وصف عام (ایمان) واجب کرد.\n\nو اگر حق (الحق) تعالی نبود، آنچه را که بندگانش را به علم به آن و ایمان به آن وصف کرده، بر آنان نازل نمی‌کرد. پس آنان به علم به او سزاوارترند تا علم او به آنان؛ زیرا علم خلق به او، علم اضطرار و فقر ذاتی است، به سبب آنچه ذات ممکن (الوجود) از استناد به مرجّح می‌دهد. پس با نزول او به سوی ما، او را شناختیم. او به واسطه ما ظاهر می‌شود، اما برای ما ممکن نیست که به واسطه او ظاهر شویم. پس او سبحانه میان صفت سیادت و بندگی جمع می‌کند، و برای بندگان ممکن نیست که در نفس خود ارباب باشند، اگرچه به صفات سید خود ظاهر شوند. و سخن ما در نفس‌الامر (حقیقت امر) است، نه در آنچه در اوقات می‌یابند. پس آنچه برای حق تعالی است، از تقسیم معلوم است؛ و آنچه برای بنده است، معلوم است؛ و آنچه در آن اشتراک واقع شده، آنچه برای خداست، در عین اشتراک برای خداست، و آنچه برای بنده است، در عین اشتراک برای بنده است. پس او در نفس‌الامر معین است، و اگر اشتراکی واقع شده، فقط در الفاظ دال بر اشتراک است. اما در نفس‌الامر، هیچ اشتراکی از هیچ وجهی وجود ندارد، زیرا هر یک بر نصیب معین خود است. و اگر امر چنین نبود، حقایق در هم می‌آمیختند: «إِنَّ كَثِيراً من الْخُلَطاءِ لَيَبْغِي بَعْضُهُمْ عَلى‏ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ وقَلِيلٌ ما هُمْ» (همانا بسیاری از شریکان بر یکدیگر ستم می‌کنند، مگر کسانی که ایمان آورده و کارهای شایسته انجام داده‌اند، و چه اندک‌اند آنان). و همچنین اندک‌اند آنان.\n\nپس هر نمازگزاری که نمازش را در وقتش ادا کند، اما بر سرّ قدر که در این کتاب در مواضع مختلف و به روش‌های شگفت‌انگیز به آن اشاره کرده‌ایم، آگاه نشود و معرفتی (المعرفة) برایش حاصل نگردد، در واقع نماز را در وقتش نخوانده است. و این بدان سبب است که خداوند این عبادات را برای برپایی نشأت صورت ظاهری آن‌ها تشریع نکرده، بلکه برای آنچه از جانب حق (الحق) به معرفت (المعرفة) او دلالت می‌کند و می‌بخشد، تشریع کرده است. اگرچه گوینده در آن صورت، روحی که با آن زنده شود، ندمیده باشد. و در آن روح دمیده نمی‌شود مگر به اذن پروردگارش، چنانکه فرمود: «وإِذْ تَخْلُقُ من الطِّينِ كَهَيْئَةِ الطَّيْرِ» (و هنگامی که از گِل چیزی به شکل پرنده می‌ساختی). پس او در این کار با هر صورت‌گری شریک شد، و ذمّی (سرزنشی) به او تعلق نگرفت، چنانکه به صورت‌گران تعلق گرفت؛ زیرا او (عیسی علیه‌السلام) آن را جز به اذن خدا صورت نداد. سپس فرمود: «فَأَنْفُخُ فِيهِ فَيَكُونُ طَيْراً بِإِذْنِ الله» (پس در آن می‌دمم و به اذن خدا پرنده‌ای می‌شود). پس از هیئت پرنده بودن زایل شد و پرنده شد. همچنین عمل بنده، هنگامی که آن را با ایمان انجام دهد، از آن جهت که حق (الحق) او را به آن عمل امر کرده است، پس به او اجازه داده است که آن صورت را ایجاد کند. در این صورت، او با منافق شریک شده است، همان‌طور که (عیسی علیه‌السلام) با صورت‌گرانی که از گِل چیزی به شکل پرنده می‌ساختند، شریک شد. زیرا خداوند به منافق اجازه نداده است که صورت عمل را بر آن حد ایجاد کند، و خداوند به ایجاد صور اعمال امر نکرده است مگر برای مؤمنان. پس هنگامی که اشتراک در ظاهر صورت میان مؤمن و منافق واقع شد، مؤمن با ایمان خود در آن روح دمید، و آن عمل به حیاتی بازگشت که جز ایجادکننده‌اش (همین مؤمن) آن را مشاهده نمی‌کند. پس آن را در روز قیامت حیاتی می‌یابد که برایش شفاعت می‌کند و دستش را می‌گیرد. اما منافق آن را مرده می‌یابد و به او گفته می‌شود: آن را زنده کن، اما نمی‌تواند. در حالی که آن عمل در نفس‌الامر زنده است، اما به احیای حق (الحق). و خداوند چشم این منافق را از درک حیات آن گرفته است، همان‌طور که خداوند چشمان ما را از درک حیات آنچه جماد و نبات نامیده می‌شود، گرفته است، با وجود اینکه ما به ایمان می‌دانیم که در نفس‌الامر زنده است، زیرا به حمد خدا تسبیح می‌گوید، و جز موجود زنده و ناطق تسبیح نمی‌گوید. و «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 3
}