{
  "id": 313,
  "title": {
    "ar": "الباب الثالث عشر وثلاثمائة في معرفة منزل البكاء والنوح من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Thirteenth: On the Gnosis of the Station (منزل) of Weeping and Lamentation (البكاء والنوح) within the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو تیرہ (۳۱۳): الحضرة المحمدية (الحضرة المحمدية) سے گریہ و نوح (البكاء والنوح) کے مقام کی معرفت میں۔",
    "fa": "باب سیصد و سیزدهم در معرفت منزل گریه و نوحه (البکاء والنوح) از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الثالث عشر وثلاثمائة في معرفة منزل البكاء والنوح من الحضرة المحمدية»\n\n\n> أقول لآدم أصل الجسوم *** كما أصل الرسالة شرع نوح‏\n\n\n> وإن محمدا أصل شريف *** عزيز في الوجود لكل روح‏\n\n\n> أنا ولد لآباء كرام *** فنوري في الإضاءة مثل يوح‏\n\n\n> إذا حضروا وإخواني وقوف *** لخدمتهم حننت إلى المسيح‏\n\n\n> فإني كنت تبت على يديه *** وساعدني على قتل المسيح‏\n\n\n> وذلك في المنام وكان موسى *** نجيي فيه بالقول الفصيح‏\n\n\n> وأعطاني الغزالة في يميني *** وأفهم بالإشارة والصريح‏\n> وأغناني فروحني علوا *** وأفقرني فأصحبني ضريحي‏\n\n\n> فإن حضروا وضمهم مقام *** إليهم حين أبصرهم جنوحي‏\n\n\n> فبر الوالدين على فرض *** فيا نفسي على التفريط نوحي‏\n\n\n> أنا ابن محمد وأنا ابن نوح *** كما أني ابن آدم في الصحيح‏\n\n\n> فيا من يفهم الألغاز هذا *** لسان رموزنا بالعلم يوحي‏\n\n\n### [أن أصل أرواحنا روح محمد ص‏]\n\n\nاعلم أيدك الله أن أصل أرواحنا روح محمد صَلَّى اللهُ عَليهِ وسَلَّم فهو أول الآباء روحا وآدم أول الآباء جسما ونوح أول رسول أرسل ومن كان قبله إنما كانوا أنبياء كل واحد على شريعة من ربه فمن شاء دخل في شرعه معه ومن شاء لم يدخل فمن دخل ثم رجع كان كافرا ومن لم يدخل فليس بكافر ومن أدخل نفسه في الفضول وكذب الأنبياء كان كافرا ومن لم يفعل وبقي على البراءة لم يكن كافرا وأما قوله تعالى وإِنْ من أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ ليس بنص في الرسالة وإنما هو نص في إن في كل أمة عالما بالله وبأمور الآخرة وذلك هو النبي لا الرسول ولو كان الرسول لقال إليها ولم يقل فيها ونحن نقول إنه كان فيهم أنبياء عالمون بالله ومن شاء وافقهم ودخل معهم في دينهم وتحت حكم شريعتهم كان ومن لم يشأ لم يكلف ذلك وكان إدريس عليه السلام منهم ولم يجي‏ء له نص في القرآن برسالته بل قيل فيه صِدِّيقاً نَبِيًّا فأول شخص استفتحت به الرسالة نوح عليه السلام وأول روح إنساني وجد روح محمد وأول جسم إنساني وجد جسم آدم وللوارثة حظ من الرسالة ولهذا قيل في معاذ وغيره رسول رسول الله وما فاز بهذه الرتبة ويحشر يوم القيامة مع الرسل إلا المحدثون الذين يروون الأحاديث بالأسانيد المتصلة بالرسول عليه السلام في كل أمة فلهم حظ في الرسالة وهم نقلة الوحي وهم ورثة الأنبياء في التبليغ والفقهاء إذا لم يكن لهم نصيب في رواية الحديث فليست لهم هذه الدرجة ولا يحشرون مع الرسل بل يحشرون في عامة الناس ولا ينطلق اسم العلماء إلا على أهل الحديث وهم الأئمة على الحقيقة وكذلك الزهاد والعباد وأهل الآخرة من لم يكن من أهل الحديث منهم كان حكمه حكم الفقهاء لا يتميزون في الوراثة ولا يحشرون مع الرسل بل يحشرون مع عموم الناس ويتميزون عنهم بأعمالهم الصالحة لا غير كما أن الفقهاء أهل الاجتهاد يتميزون بعلمهم عن العامة ومن كان من الصالحين ممن كان له حديث مع النبي صَلَّى اللهُ عَليهِ وسَلَّم في كشفه وصحبه في عالم الكشف والشهود وأخذ عنه حشر معه يوم القيامة وكان من الصحابة الذين صحبوه في أشرف موطن وعلى أسنى حالة ومن لم يكن له هذا الكشف فليس منهم ولا يلحق بهذه الدرجة صاحب النوم ولا يسمى صاحبا ولو رآه في كل منام حتى يراه وهو مستيقظ كشفا يخاطبه ويأخذ عنه ويصحح له من الأحاديث ما وقع فيه الطعن من جهة طريقها فهؤلاء الآباء الثلاثة هم آباؤنا فيما ذكرناه والأب الرابع هو إبراهيم عليه السلام هو أبونا في الإسلام وهو الذي سمانا مسلمين وأقام البيت على أربع أركان فقام الدليل على أربع مفردات متناسبة وكانت النتيجة تناسب المقدمات فانظر من كانت هذه مقدماته وهو محمد وآدم ونوح وإبراهيم عليه السلام ما أشرف ما تكون النتيجة والولد عن هؤلاء الآباء روح طاهر وجسد طاهر ورسالة وشرع طاهر واسم شريف طاهر ومن كان أبو هؤلاء المذكورين فلا أسعد منه وهو أرفع الأولياء منصبا ومكانة ولما كانت النشأة ظهرت في الجنان أو لا واتفق هبوطها إلى الأرض من أجل الخلافة لا عقوبة المعصية فإن العقوبة حصلت بظهور السوآت والاجتباء والتوبة قد حصلا بتلقي الكلمات الإلهية فلم يبق النزول إلا للخلافة فكان هبوط تشريف وتكريم ليرجع إلى الآخرة بالجم الغفير من أولاده السعداء من الرسل والأنبياء والأولياء والمؤمنين ولكن الخلافة لما كانت ربوبية في الظاهر لأنه يظهر بحكم الملك فيتصرف في الملك بصفات سيده ظاهرا وإن كانت عبوديته له مشهودة في باطنه فلم تعم عبوديته جميعه عند رعيته الذين هم أتباعه وظهر ملكه بهم وبأتباعهم والأخذ عنه فكان في مجاورتهم بالظاهر أقرب وبذلك المقدار يستتر عنه من عبوديته فإن الحقائق تعطي ذلك ولذلك كثيرا ما ينزل في‏\n\n\nالوحي على الأنبياء قُلْ إِنَّما أَنَا بَشَرٌ مِثْلُكُمْ يُوحى‏ إِلَيَّ وهذه آية دواء لهذه العلة فبهذا المقدار كانت أحوال الأنبياء الرسل في الدنيا البكاء والنوح فإنه موضع تتقي فتنته ومن كان ذلك حاله أعني التقوى والاتقاء كيف يفرح‏\nأو يلتذ من يتقي فإن تقواه وحذره وخوفه أن لا يوفي مقام التكليف حقه وعلمه بأنه مسئول عنه لا يتركه يفرح ولا يسر بعزة المقام‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم أنا أتقاكم لله وأعلمكم بما اتقى حين قالت له الصحابة في اجتهاده قد غفر الله لك ما تقدم من ذنبك وما تأخر بعد قوله المنزل عليه لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ\n\n\nوأمثال هذا وقال إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ وقال اتَّقُوا الله حَقَّ تُقاتِهِ وقال فَاتَّقُوا الله ما اسْتَطَعْتُمْ واتَّقُوا الله ويُعَلِّمُكُمُ الله وهذا هو حظ الوراثة من النبوة أن يتولى الله تعليم المتقي من عباده فيقرب سنده فيقول أخبرني ربي بشرع نبيه الذي تعبده به ممن أخذه أوحى به إليه فهو عال في العلم تابع في الحكم وهم الذين ليسوا بأنبياء وتغبطهم الأنبياء عليه السلام في هذه الحالة لأنهم اشتركوا معهم في الأخذ عن الله وكان أخذ هذه الطائفة عن الله بعد التقوى بما عملوا عليه مما جاءهم به هذا الرسول فهم وإن كانوا بهذه المثابة وأنتج لهم تقواهم الأخذ عن الله في موازين الرسل وتحت حوطتهم وفي دائرتهم ووقع الاغتباط في كونهم لم يكونوا رسلا فبقوا مع الحق دائما على أصل عبودية لم تشبها ربوبية أصلا فمن هنا وقع الغبط لراحتهم وإن كانت الرسل أرفع مقاما منهم أ لا تراهم يوم القيامة لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ ولا يداخلهم خوف البتة والرسل في ذلك اليوم في غاية من شدة الخوف على أممهم لا على أنفسهم والأمم في الخوف على أنفسهم وهؤلاء في ذلك اليوم لا أثر للخوف عندهم فإنهم حشروا إِلَى الرَّحْمنِ وَفْداً ثم لتعلم بعد أن عرفتك بعلو منصبك أيها الصديق في اتباع ما شرع لك إن الناس غلطوا في الصادقين من عباد الله المثابرين على طاعة الله واشترط من لا يعرف الأمر على ما هو عليه ولا ذاق طريق القوم إن الداعي إلى الله إذا كان يدعو إلى الله بحالة صدق مع الله أثر في نفوس السامعين القبول فلا ترد دعوته وإذا دعا بلسانه وقلبه مشحون بحب الدنيا وأغراضها وكان دعاؤه صنعة لم يؤثر في القلوب ولا تعدى الآذان فيقولون إن الكلام إذا خرج من القلب وقع في القلب وإذا خرج من اللسان لم يتعد الآذان وهذا غاية الغلط فو الله ما من رسول دعا قومه إلا بلسان صدق من قلب معصوم ولسان محفوظ كثير الشفقة على رعيته راغب في استجابتهم لما دعاهم إليه هذه أحوال الرسل في دعائهم إلى الله تعالى وصدقهم ومع هذا يقول صَلَّى اللهُ عَليهِ وسَلَّم إِنِّي دَعَوْتُ قَوْمِي لَيْلًا ونَهاراً فَلَمْ يَزِدْهُمْ دُعائِي إِلَّا فِراراً وإِنِّي كُلَّما دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصابِعَهُمْ في آذانِهِمْ واسْتَغْشَوْا ثِيابَهُمْ وأَصَرُّوا واسْتَكْبَرُوا اسْتِكْباراً وقال تعالى لَيْسَ عَلَيْكَ هُداهُمْ وقال إِنَّكَ لا تَهْدِي من أَحْبَبْتَ وقال ما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ فلو أثر كلام أحد في أحد لصدقه في كلامه لأسلم كل من شافهه النبي عليه السلام بالخطاب بل كذب ورد الكلام في وجهه وقوتل فإن لم يكن لله عناية بالسامع بأن يجعل في قلبه صفة القبول حتى يلقي بها النور الإلهي من سراج النبوة كما وصفه تعالى وسِراجاً مُنِيراً أ لا ترى الفتيلة إذا كان رأسها يخرج منه دخان وهي غير مشتعلة فإذا سامتت بذلك الدخان السراج اشتعل ذلك الدخان بما فيه من الرطوبة وتعلق فيه النور من السراج ونزل على طريقه حتى يستقر في رأس الفتيلة التي انبعث منها ذلك الدخان إلى السراج فتشعل الفتيلة وتلحق برتبة السراج في النورية فإن كانت لها مادة دهن وهي العناية الإلهية بقيت مستنيرة ما دام الدهن يمدها وذلك النور يذهب برطوبات ذلك الدهن الذي به بقاؤه ولم يبق معه للسراج حديث بعد أن ظهر فيه النور وبقي الإمداد من جانب الحق فلا يدري أحد ما يصل إليه فإن الأنبياء ما دعت لا نفسها الناس وإنما دعتهم إلى ربها فأي قلب اعتنى الله به وقام به حرقة الشوق إلى ذلك الدعاء مثل احتراق رأس الفتيلة ثم انبعث من هذا الشوق همة إلى ما دعاه إليه الرسول في كلامه مثل انبعاث الدخان من تلك النارية التي في رأس الفتيلة وهي قوة جاذبة فجذبت من نور النبوة والوحي والهداية ذلك الاشتعال الذي قام بالدخان فرجع به إلى قلب صاحبه فاهتدى واستنار كما اتقدت هذه الفتيلة ثم فارق النبي ومشى إلى أهله نورا فإن اعتنى الله به وأمده بتوفيقه ثبت له في قلبه نور الهداية بذاك الإمداد ولم يبق للرسول بعد ذلك معه شغل إلا بتعيين الأحكام إلا إن ذلك النور وهو نور الايمان ما كُنْتَ تَدْرِي ما الْكِتابُ ولا الْإِيمانُ ولكِنْ جَعَلْناهُ نُوراً نَهْدِي به من نَشاءُ من عِبادِنا قال عليه السلام عن ربه‏\n\n\nأَدْعُوا إِلَى الله ولم يقل ادعوا لي نفسي وإلى حرف موضوع للغاية فإذا أجاب المؤمن مشى إلى ربه على الطريقة التي شرع له هذا الرسول فلما وصل إلى الله تلقاه الحق تلقي إكرام وهبات ومنح وعطايا فصار يدعو إلى الله على بصيرة كما دعا ذلك‏\nالرسول وهو قوله حين قال أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي فأخبر أن من اتبعه يدعو إلى الله أيضا على بصيرة فإن كنت عارفا بمواقع الخطاب الإلهي وتنبيهاته وإشاراته فقد عرفك بحالك مع رسوله صَلَّى اللهُ عَليهِ وسَلَّم وبحالك معه وقد جعلك على صورة نبيه صَلَّى اللهُ عَليهِ وسَلَّم في نوره وإمداده وأبان لك أن صورتك معه في هذا الأمر صورته أيضا مع جبريل عليه السلام الذي اتقدت فتيلته من سراج جبريل واشتعلت نورا وكل واحد من السرج ما انتقل نوره عنه بل هو على نوره في نفسه وانظر إلى من استندت الرسل بعد أخذها عن جبريل عليه السلام هل كان استنادها إلى جبريل أو إلى الله لا والله بل قيل رسول الله وما قيل رسول جبريل وكذلك من أخذ عن النبوة مثل هذا النور ودعا إلى الله على بصيرة فذلك الدعاء والنور الذي يدعو به هو نور الإمداد لا النور الذي اقتبسه من السراج فلينسب إلى الله في ذلك لا إلى الرسول فيقال عبد الله وهو الداعي إلى الله عن أمر الله بوساطة رسول الله بحكم الأصل لا بحكم ما فتح الله به عليه في قلبه من العلوم الإلهية التي هي فتح عين فهمه لما جاء به الرسول صَلَّى اللهُ عَليهِ وسَلَّم من القرآن والأخبار لا أن هذا الولي يأتي بشرع جديد وإنما يأتي بفهم جديد في الكتاب العزيز لم يكن غيره يعرف أن ذلك المعنى في ذلك الحرف المتلو أو المنقول فللرسل صلوات الله عليه السلام العلم ولنا الفهم وهو علم أيضا فإن حققت يا أخي ما أوردناه في هذا الباب وقفت على أسرار إلهية وعلمت مرتبة عباد الله الذين هم بهذه المثابة أين ينتهي بهم ومع من هم وعمن يأخذون ومن يناجون وإلى من يستندون وأين تكون منزلتهم في الدار الآخرة وهل لهم شركة في المرتبة في الدار الآخرة كما كان لهم شركة هنا في النورية والإمداد الإلهي أم لا فأما في الدنيا فليسوا بأنبياء فإنهم عن الأنبياء أخذوا طريقهم وما بقي الأمر إلا في الإمداد هل أثره إبقاء النور الأول أو تتجدد لهم الأنوار مع الأناة من الحق كما يتجدد نور السراج باشتعال الهواء من رطوبات الدهن فليس هو ذلك النور الأول ولا هو غيره ولا ذهب ذلك النور ولا بقي عينه والناظر يرى اتصال الأنوار صورة واحدة في النورية إلا أنه يعرف أنه لو لا أمداد الدهن لطفئ هذا حظ كل مشاهد من ذلك من حيث النظر والصورة ومن حيث المعنى يزيد على النظر معرفة ما يقع به الإمداد وما أثره في ذلك المشهود فيزيد علما آخر لم يكن عنده فمن فقد مثل هذا ينبغي أن يطول نوحه وبكاؤه على نفسه جعلنا الله من أهله وممن دعا إلى الله على بصيرة أو انفرد مع الله على بصيرة أنه الملي بذلك والقادر عليه وهذا القدر كاف في هذا الباب وقد حصلت الفائدة فلنذكر ما يحوي عليه هذا المنزل من العلوم فاعلم أنه يتضمن علم الحقائق الأسمائية وعلم الرسالة من حيث المكانة التي أرسل منها لا من حيث إنها رسالة وعلم التخويف هل يخاف الله أو يخاف ما يكون منه وما مشهود من يخاف الله والخوف إنما هو مما يتعلق بك ويحل فيك والحق تعالى منزه الذات عن الحلول في الذوات فما معنى وأعوذ بك منك وعلم طاعة العباد فيما ذا يطاعون وهل لهم في تلك الطاعة نصيب بطريق الاستحقاق أو ليس لهم فإن الله يقول من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله هذا مقام ومقام آخر وأَطِيعُوا الرَّسُولَ ومقام آخر أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ فهذه مقامات كلها تقتضيها الطاعة ويختلف المطاع وتحقيق ذلك عجيب وتفصيل ما يقع فيه الطاعة كذلك وهل نسبة الطاعة لأولي الأمر كنسبتها إلى الرسول كنسبتها إلى الله أم لا بل تكون مختلفة وعلم نتائج المخالفات والموافقات وعلم الفرق بين الأجلين ولما ذا كان الأول أجلا ولما ذا كان الآخر أجلا هل لعين واحدة أم لأمرين مختلفين وعلم أحوال الناس المدعوين إلى الله ما الذي يحول بينهم وبين الإجابة مع العلم بصدق الداعي وما الذي يدعوهم إلى الإجابة والمجلس واحد والداعي واحد والدعوة واحدة وعلم الثواب المعجل الحسي والمعنوي وعلم الاعتبار وعلم العالم العلوي والعالم‏\n\n\nالسفلي وعلم السر الذي قام في المعبودين من دون الله وما المناسبة التي جمعت بينهم وبين من عبدهم ولما ذا شقوا شقاوة الأبد ولم تنلهم المغفرة ولا خرجوا من النار وعلم الغيرة الإلهية والغيرة من كل غيور ولما ذا ترجع والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 313: Concerning the Knowledge of the Station of Weeping and Lamentation within the Muhammadan Presence (الحضرة المحمدية)\n\nI say that Adam is the origin of bodies,\nJust as the Law (شرع) of Noah is the origin of Messengership (الرسالة).\n\nAnd indeed, Muhammad is a noble origin,\nPrecious in Existence (الوجود) for every spirit (روح).\n\nI am a child of noble fathers,\nAnd my light in illumination is like the light of the daybreak.\n\nWhen they are present, and my brethren stand\nIn service to them, I yearn for the Messiah.\n\nFor I repented at his hands,\nAnd he helped me in the slaying of the Messiah.\n\nAnd that was in a dream (المنام), and Moses was my confidant\nTherein, speaking with eloquent speech.\n\nHe gave me the gazelle in my right hand,\nAnd I understood through both allusion (الإشارة) and explicit statement (الصريح).\n\nHe enriched me, thus elevating my spirit,\nAnd he impoverished me, thus making my tomb my companion.\n\nIf they are present, and a station (مقام) encompasses them,\nMy inclination is toward them when I behold them.\n\nFor honoring the parents is an obligation (فرض),\nSo O my soul, lament over negligence!\n\nI am the son of Muhammad and I am the son of Noah,\nJust as I am truly the son of Adam.\n\nO you who understand riddles, this is\nThe tongue of our symbols (رموزنا) that reveals through Knowledge (العلم).\n\n***\n\n### [That the Origin of Our Spirits is the Spirit of Muhammad]\n\nKnow, may Allah support you, that the origin of our spirits is the Spirit of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم). He is the first of the fathers spiritually, just as Adam is the first of the fathers physically. Noah is the first Messenger (رسول) sent. Those who came before him were only Prophets (أنبياء), each following a Law (شريعة) from his Lord. Whoever wished could enter his Law with him, and whoever wished did not. Whoever entered and then reverted became an unbeliever (كافرا). Whoever did not enter is not an unbeliever. Whoever involved himself in superfluous matters and denied the Prophets became an unbeliever. Whoever did not do so and remained innocent (على البراءة) was not an unbeliever.\n\nAs for His saying, the Exalted: <<وَإِنْ مِنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ>> (And there is no nation but that a warner has passed within it), this is not an explicit text concerning Messengership (الرسالة). Rather, it is an explicit text that in every nation there was one who possessed Knowledge (عالما) of Allah and the affairs of the Hereafter. That is the Prophet (النبي), not the Messenger (الرسول). If it were the Messenger, He would have said \"to it\" and not \"within it.\" We say that there were Prophets among them who possessed Knowledge of Allah. Whoever wished agreed with them and entered their religion and under the ruling of their Law did so. Whoever did not wish was not obligated to do so. Idris (عليه السلام) was one of them, and there is no explicit text in the Quran regarding his Messengership; rather, it is said of him: <<صِدِّيقًا نَبِيًّا>> (A truthful one, a Prophet). Thus, the first person with whom Messengership was inaugurated was Noah (عليه السلام). The first human spirit (روح إنساني) to exist was the Spirit of Muhammad, and the first human body (جسم إنساني) to exist was the body of Adam.\n\nThe inheritor (الوارثة) has a share of Messengership, which is why it was said of Mu'adh and others, \"Messenger of the Messenger of Allah.\" No one attains this rank and is gathered on the Day of Resurrection with the Messengers except the Narrators of Hadith (المحدثون) who transmit the traditions with continuous chains of transmission (الأسانيد المتصلة) back to the Messenger (عليه السلام) in every nation. They have a share in Messengership; they are the transmitters of Revelation (الوحي) and the inheritors of the Prophets in conveying the message. As for the Jurists (الفقهاء), if they do not have a share in the narration of Hadith, they do not possess this degree, nor will they be gathered with the Messengers; rather, they will be gathered among the common people. The name 'Scholars' (العلماء) applies only to the People of Hadith (أهل الحديث); they are the true Imams. Likewise, the Ascetics (الزهاد), the Devotees (العباد), and the People of the Hereafter (أهل الآخرة) who are not among the People of Hadith are judged like the Jurists: they are not distinguished in inheritance, nor are they gathered with the Messengers, but they are gathered with the generality of people, distinguished only by their righteous deeds, just as the Jurists, who are the people of independent reasoning (أهل الاجتهاد), are distinguished from the common folk by their knowledge.\n\nWhoever among the righteous had a conversation with the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) in his Unveiling (كشفه) and accompanied him in the world of Unveiling and Witnessing (عالم الكشف والشهود), and took from him, will be gathered with him on the Day of Resurrection and will be among the Companions (الصحابة) who accompanied him in the most noble station and the highest state. Whoever does not possess this Unveiling (الكشف) is not one of them. The person who sees him only in sleep (النوم) does not attain this degree, nor is he called a Companion, even if he sees him in every dream, until he sees him while awake, through Unveiling (كشفا), addressing him and taking from him, and confirming for him those Hadiths whose chain of transmission has been criticized.\n\nThese three fathers are our fathers in the sense we have mentioned. The fourth father is Abraham (إبراهيم عليه السلام); he is our father in Islam (الإسلام), and he is the one who named us Muslims. He established the House (the Kaaba) upon four pillars, thus establishing the proof upon four corresponding singular premises, and the conclusion was commensurate with the premises. Look at the nobility of the conclusion and the child born of these premises—Muhammad, Adam, Noah, and Abraham (عليهم السلام)—a pure spirit, a pure body, a pure Messengership and Law (شرع), and a noble, pure Name. Whoever has these mentioned as his fathers, none is more fortunate than him, and he is the highest of the saints (الأولياء) in rank and station.\n\nSince the origination (النشأة) first appeared in the Gardens (الجنان), and its descent (هبوطها) to Earth occurred for the sake of the Caliphate (الخلافة), not as a punishment for disobedience—for the punishment occurred through the manifestation of the private parts, and the Divine Selection (الاجتباء) and repentance (التوبة) had already occurred through the reception of the Divine Words (الكلمات الإلهية)—the descent remained only for the Caliphate. Thus, the descent was an honor and a distinction, so that he might return to the Hereafter with a great multitude of his fortunate descendants: the Messengers, Prophets, Saints, and Believers.\n\nHowever, since the Caliphate is outwardly Lordship (ربوبية)—because the Caliph appears by the ruling of kingship and acts in the kingdom with the attributes of his Master outwardly, even though his Servitude (عبوديته) to Him is witnessed inwardly—his Servitude does not encompass all of him in the eyes of his subjects, who are his followers. His kingship appears through them, their followers, and those who take from him. Thus, in his outward proximity to them, he is closer, and by that measure, something of his Servitude is concealed from him, for the Realities (الحقائق) necessitate this. For this reason, the Revelation (الوحي) often descends upon the Prophets: <<قُلْ إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ يُوحَى إِلَيَّ>> (Say: I am only a human being like you, to whom it is revealed). This verse is a remedy for this ailment. By this measure, the state of the Messenger-Prophets (الأنبياء الرسل) in this world was weeping and lamentation (البكاء والنوح), for it is a position where one guards against its temptation. How can one whose state is such—meaning piety (التقوى) and caution (الاتقاء)—rejoice or find pleasure? The one who is cautious finds no pleasure, for his piety, caution, and fear that he might not fulfill the station of obligation (مقام التكليف) its due, and his knowledge that he is accountable, do not allow him to rejoice or be delighted by the honor of the station.\n\nThe Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said, \"I am the most pious of you toward Allah and the most knowledgeable of what He guards against,\" when the Companions spoke to him about his striving, after the verse was revealed to him: <<لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ>> (That Allah may forgive you your sin that preceded and that which followed). And similar examples. He also said: <<إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ>> (Indeed, those who fear Allah among His servants are the Scholars). And He said: <<اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ>> (Fear Allah as is His due), and He said: <<فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ>> (So fear Allah as much as you are able), and <<وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ>> (And fear Allah; and Allah teaches you).\n\nThis is the share of inheritance (حظ الوراثة) from Prophethood: that Allah takes charge of teaching His pious servants. Thus, their chain of transmission becomes close, and they say, \"My Lord informed me of the Law of His Prophet by which He worships Him,\" rather than taking it from someone who received it through Revelation. They are elevated in Knowledge (العلم) and followers in judgment. They are those who are not Prophets, and the Prophets (عليهم السلام) envy them in this state because they shared with them in taking directly from Allah. The taking of this group from Allah occurred after their piety, based on what this Messenger brought them. Although they are at this level, and their piety resulted in their taking from Allah, they remain within the scales of the Messengers and under their protection and within their circle. The envy (الاغتباط) occurs because they were not Messengers, so they remained perpetually with The Real (الحق) upon the principle of Servitude (عبودية) that was never tainted by Lordship (ربوبية) at all. It is from this perspective that the envy occurs, due to their ease, even though the Messengers are higher in station than them. Do you not see that on the Day of Resurrection, <<لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ>> (The greatest terror will not grieve them), and no fear enters them whatsoever? Yet the Messengers on that Day are in the utmost severity of fear for their communities, not for themselves. The communities are in fear for themselves. But these (the pious inheritors) have no trace of fear with them on that Day, for they are gathered <<إِلَى الرَّحْمَنِ وَفْدًا>> (To the Most Merciful as a delegation).\n\nThen, know, after I have informed you of the high rank of the truthful one (الصديق) in following what has been legislated for you, that people have erred concerning the truthful servants of Allah who persevere in obedience to Allah. Those who do not know the matter as it truly is, nor have tasted the path of the folk, stipulate that if the caller to Allah (الداعي إلى الله) calls to Allah with a state of sincerity (صدق) with Allah, it will affect the souls of the listeners with acceptance, and his call will not be rejected. But if he calls with his tongue while his heart is filled with the love of the world and its aims, and his call is merely a craft, it will not affect the hearts nor pass beyond the ears. They say: \"If speech comes from the heart, it falls into the heart; if it comes from the tongue, it does not pass beyond the ears.\" This is the height of error. By Allah, there was no Messenger who called his people except with a sincere tongue from an infallible heart (قلب معصوم) and a preserved tongue, full of compassion for his subjects, desiring their response to what he called them to. These were the states of the Messengers in their call to Allah, the Exalted, and their sincerity. Despite this, the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said, quoting Noah: <<إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا>> (Indeed, I called my people night and day, but my call only increased their flight. And indeed, every time I called them that You might forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were proudly arrogant). And the Exalted said: <<لَيْسَ عَلَيْكَ هُدَاهُمْ>> (Not upon you is their guidance), and He said: <<إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ>> (Indeed, you do not guide whom you love), and He said: <<مَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ>> (The Messenger is only responsible for conveyance). If the speech of anyone affected anyone else merely by the sincerity of his speech, everyone whom the Prophet (عليه السلام) addressed directly would have embraced Islam. Rather, he was denied, his speech was rejected to his face, and he was fought.\n\nIf Allah does not have care (عناية) for the listener by placing in his heart the quality of acceptance, so that the Divine Light (النور الإلهي) may be cast upon it from the Lamp of Prophethood (سراج النبوة), as He described it: <<وَسِرَاجًا مُنِيرًا>> (And a shining lamp)—do you not see the wick (الفتيلة) when smoke issues from its head while it is not lit? If that smoke aligns itself with the lamp, that smoke, due to the moisture within it, ignites, and the light clings to it from the lamp, descending along its path until it settles in the head of the wick from which the smoke ascended to the lamp. Then the wick ignites and attains the rank of the lamp in luminosity. If it has the substance of oil (مادة دهن)—which is the Divine Care (العناية الإلهية)—it remains illuminated as long as the oil feeds it. That light removes the moisture of that oil, which is the cause of its subsistence. After the light appears in it, there is no further mention of the lamp, and the sustenance (الإمداد) remains from the side of The Real (الحق). No one knows what reaches him.\n\nThe Prophets did not call people to themselves; rather, they called them to their Lord. Any heart that Allah cares for, and in which the burning of longing (حرقة الشوق) for that call arises, like the burning of the wick's head, then from this longing, an aspiration (همة) arises toward what the Messenger called him to in his speech—like the rising of the smoke from the fiery element in the wick's head, which is an attractive force—it draws from the light of Prophethood, Revelation, and Guidance that ignition which arose in the smoke. It returns with it to the heart of its owner, who is guided and illuminated, just as the wick was lit. Then he leaves the Prophet and walks to his family as light. If Allah cares for him and sustains him with His success (توفيقه), the light of Guidance (نور الهداية) is established in his heart by that sustenance. After that, the Messenger has no further concern with him except for defining the rulings (الأحكام).\n\nThat light, which is the Light of Faith (نور الايمان): <<مَا كُنْتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ وَلَكِنْ جَعَلْنَاهُ نُورًا نَهْدِي بِهِ مَنْ نَشَاءُ مِنْ عِبَادِنَا>> (You did not know what the Scripture was or [what] Faith [was], but We made it a light by which We guide whom We will of Our servants). The Prophet (عليه السلام) said, quoting his Lord: \"I call to Allah,\" and did not say, \"Call to me myself.\" The preposition 'to' (إلى) is used for the ultimate goal. When the believer responds, he walks toward his Lord upon the path legislated for him by this Messenger. When he reaches Allah, The Real (الحق) receives him with honor, gifts, grants, and bounties. Thus, he begins to call to Allah upon insight (على بصيرة), just as that Messenger called. This is His saying when He said: <<أَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call to Allah upon insight—I and those who follow me). He thus informed that whoever follows him also calls to Allah upon insight.\n\nIf you are knowledgeable of the points of Divine address, its warnings, and its allusions, He has informed you of your state with His Messenger (صَلَّى اللهُ عَليهِ وسَلَّم) and your state with Him. He has made you in the image of His Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) in his light and sustenance (إمداده). He clarified to you that your image with him in this matter is also his image with Gabriel (عليه السلام), whose wick was lit from the lamp of Gabriel and ignited with light. The light of each lamp did not transfer away from it; rather, it remains upon its own light. Look at whom the Messengers relied upon after taking from Gabriel (عليه السلام). Was their reliance upon Gabriel or upon Allah? No, by Allah! Rather, it is said, \"Messenger of Allah,\" and not \"Messenger of Gabriel.\" Likewise, whoever takes such light from Prophethood and calls to Allah upon insight—that call and the light by which he calls is the light of Sustenance (نور الإمداد), not the light he borrowed from the lamp. Therefore, he should be attributed to Allah in that, not to the Messenger. It is said, \"Servant of Allah,\" and he is the caller to Allah by the command of Allah, through the mediation of the Messenger of Allah, by virtue of the origin (الأصل), not by virtue of what Allah opened up for him in his heart of Divine Sciences (العلوم الإلهية), which is the opening of his eye of understanding (فهم) regarding what the Messenger (صَلَّى اللهُ عَليهِ وسَلَّم) brought from the Quran and the traditions. This saint (الولي) does not bring a new Law (شرع جديد); rather, he brings a new understanding (فهم جديد) of the Glorious Book (الكتاب العزيز) that no one else knew—that that meaning was contained within that recited or transmitted letter. For the Messengers (صلوات الله عليه السلام) is the Knowledge (العلم), and for us is the Understanding (الفهم), which is also Knowledge.\n\nIf you verify, my brother, what we have presented in this chapter, you will stand upon Divine Secrets (أسرار إلهية) and know the rank of Allah's servants who are at this level: where they end up, with whom they are, from whom they take, whom they converse with secretly, upon whom they rely, and where their station will be in the Hereafter. Do they share in the rank in the Hereafter, just as they shared here in luminosity and Divine Sustenance (الإمداد الإلهي), or not? As for this world, they are not Prophets, for they took their path from the Prophets. The only remaining question is concerning the Sustenance: Is its effect the preservation of the first light, or are new lights renewed for them with the passage of time from The Real (الحق), just as the light of the lamp is renewed by the ignition of the air from the moisture of the oil? It is neither that first light nor is it other than it; that light neither departed nor remained exactly the same. The observer sees the connection of the lights as a single form in luminosity, yet he knows that were it not for the sustenance of the oil, it would be extinguished. This is the share of every witness (مشاهد) from the perspective of observation and form. From the perspective of meaning, it adds to the observation the knowledge of what causes the sustenance and its effect on the witnessed object, thus adding another knowledge he did not possess. Whoever lacks such a thing should prolong his lamentation (نوحه) and weeping (بكاؤه) over himself. May Allah make us among His people and among those who call to Allah upon insight (على بصيرة) or who are alone with Allah upon insight, for He is capable of that and has power over it.\n\nThis much is sufficient for this chapter, and the benefit has been achieved. Let us mention the sciences contained within this station (المنزل). Know that it encompasses:\n\n1.  The Science of the Realities of the Names (علم الحقائق الأسمائية).\n2.  The Science of Messengership (علم الرسالة) from the perspective of the station from which the Messenger was sent, not from the perspective of its being Messengership itself.\n3.  The Science of Intimidation (علم التخويف): Does one fear Allah, or does one fear what proceeds from Him? And what is witnessed by the one who fears Allah? Fear (الخوف) is only related to what concerns you and resides within you. The Real (الحق), the Exalted, is transcendent in Essence (الذات) from indwelling (الحلول) in essences. So, what is the meaning of \"I seek refuge in You from You\"?\n4.  The Science of the Obedience of the servants: In what are they obeyed? And do they have a share in that obedience by way of entitlement (الاستحقاق) or not? For Allah says: <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ>> (Whoever obeys the Messenger has obeyed Allah)—this is one station. And another station: <<وَأَطِيعُوا الرَّسُولَ>> (And obey the Messenger). And another station: <<أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ>> (Obey Allah and obey the Messenger and those in authority among you). These are all stations necessitated by obedience, and the one obeyed differs. The verification of this is wondrous, as is the detailed explanation of what obedience entails.\n5.  Is the attribution of obedience to those in authority (أولي الأمر) like its attribution to the Messenger, or like its attribution to Allah, or is it different?\n6.  The Science of the results of opposition and agreement.\n7.  The Science of the difference between the two appointed terms (الأجلين): Why was the first an appointed term, and why was the last an appointed term? Is it for a single entity or for two different matters?\n8.  The Science of the states of the people called to Allah: What prevents them from responding, despite knowing the sincerity of the caller? And what calls them to respond, when the assembly is one, the caller is one, and the call is one?\n9.  The Science of the immediate reward, both sensory and spiritual.\n10. The Science of Reflection (الاعتبار).\n11. The Science of the Upper World (العالم العلوي) and the Lower World (العالم السفلي).\n12. The Science of the Secret (السر) that resides in those worshipped besides Allah, and the suitability (المناسبة) that brought them together with those who worshipped them. And why were they wretched with eternal wretchedness, and neither forgiveness reached them nor did they exit the Fire?\n13. The Science of Divine Jealousy (الغيرة الإلهية) and the jealousy of every jealous one, and why it returns. And <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو تیرہ: حضرت محمدیہ (الحضرة المحمديۃ) سے گریہ و زاری اور نوحہ کے مقام کی معرفت میں\n\nمیں آدم کو جسموں کی اصل کہتا ہوں، جیسے نوح کا شرع رسالت کی اصل ہے۔\n(أقول لآدم أصل الجسوم *** كما أصل الرسالة شرع نوح‏)\n\nاور بے شک محمد (صلی اللہ علیہ وسلم) ایک شریف اصل ہیں، ہر روح کے لیے ہستی (الوجود) میں عزیز ہیں۔\n(وإن محمدا أصل شريف *** عزيز في الوجود لكل روح‏)\n\nمیں بزرگ آباء کا بیٹا ہوں، پس میرا نور روشنی میں چمکنے والے ستارے جیسا ہے۔\n(أنا ولد لآباء كرام *** فنوري في الإضاءة مثل يوح‏)\n\nجب وہ حاضر ہوتے ہیں اور میرے بھائی ان کی خدمت کے لیے کھڑے ہوتے ہیں، تو میں مسیح کی طرف جھکتا ہوں۔\n(إذا حضروا وإخواني وقوف *** لخدمتهم حننت إلى المسيح‏)\n\nکیونکہ میں نے ان کے ہاتھ پر توبہ کی تھی، اور انہوں نے مسیح کو قتل کرنے میں میری مدد کی۔\n(فإني كنت تبت على يديه *** وساعدني على قتل المسيح‏)\n\nاور یہ خواب میں تھا، اور اس میں موسیٰ میرے فصیح قول کے ساتھ میرے رازدار (نجیي) تھے۔\n(وذلك في المنام وكان موسى *** نجيي فيه بالقول الفصيح‏)\n\nاور انہوں نے میرے دائیں ہاتھ میں ہرنی دی، اور اشارے اور صریح بیان سے سمجھایا۔\n(وأعطاني الغزالة في يميني *** وأفهم بالإشارة والصريح‏)\n\nاور مجھے غنی کیا، پس مجھے بلندی میں روح بخشی، اور مجھے فقیر کیا، پس مجھے میری قبر کا ساتھی بنا دیا۔\n(وأغناني فروحني علوا *** وأفقرني فأصحبني ضريحي‏)\n\nپس اگر وہ حاضر ہوں اور ایک مقام انہیں جمع کرے، تو جب میں انہیں دیکھتا ہوں تو میرا جھکاؤ ان کی طرف ہوتا ہے۔\n(فإن حضروا وضمهم مقام *** إليهم حين أبصرهم جنوحي‏)\n\nپس والدین کی نیکی فرض ہے، اے میرے نفس! کوتاہی پر نوحہ کر۔\n(فبر الوالدين على فرض *** فيا نفسي على التفريط نوحي‏)\n\nمیں محمد کا بیٹا ہوں اور میں نوح کا بیٹا ہوں، جیسا کہ صحیح (روایت) میں میں آدم کا بیٹا ہوں۔\n(أنا ابن محمد وأنا ابن نوح *** كما أني ابن آدم في الصحيح‏)\n\nپس اے وہ جو ان رموز کو سمجھتا ہے، یہ ہماری رموز کی زبان ہے جو علم کے ساتھ وحی کرتی ہے۔\n(فيا من يفهم الألغاز هذا *** لسان رموزنا بالعلم يوحي‏)\n\n### [بے شک ہماری ارواح کی اصل روح محمد صلی اللہ علیہ وسلم ہے]\n\nجان لو، اللہ تمہاری تائید کرے، کہ ہماری ارواح کی اصل روح محمد صلی اللہ علیہ وسلم ہے، پس وہ روح کے اعتبار سے پہلے باپ ہیں، اور آدم جسم کے اعتبار سے پہلے باپ ہیں، اور نوح پہلے رسول ہیں جنہیں بھیجا گیا، اور جو ان سے پہلے تھے وہ صرف نبی تھے، ہر ایک اپنے رب کی شریعت پر تھا۔ پس جو چاہتا اس کی شریعت میں اس کے ساتھ داخل ہو جاتا، اور جو چاہتا داخل نہ ہوتا۔ پس جو داخل ہوا پھر پلٹ گیا وہ کافر ہو گیا، اور جو داخل نہ ہوا وہ کافر نہیں ہے۔ اور جس نے خود کو فضول باتوں میں ڈالا اور انبیاء کو جھٹلایا وہ کافر ہو گیا، اور جس نے ایسا نہ کیا اور براءت پر باقی رہا وہ کافر نہیں ہوا۔\n\nاور جہاں تک اللہ تعالیٰ کے اس قول کا تعلق ہے: \"اور کوئی امت ایسی نہیں مگر اس میں کوئی ڈرانے والا (نذیر) گزر چکا ہے\" (وَإِنْ مِنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ)، یہ رسالت کے بارے میں نص نہیں ہے، بلکہ یہ اس بات میں نص ہے کہ ہر امت میں اللہ اور آخرت کے امور کا عالم موجود تھا، اور وہ نبی (النبي) ہوتا ہے نہ کہ رسول (الرسول)۔ اگر وہ رسول ہوتا تو \"إلیها\" (اس کی طرف) کہا جاتا، \"فیها\" (اس میں) نہ کہا جاتا۔ اور ہم کہتے ہیں کہ ان میں اللہ کے عالم نبی موجود تھے، اور جو چاہتا ان کی موافقت کرتا اور ان کے دین میں اور ان کی شریعت کے حکم کے تحت داخل ہو جاتا، اور جو نہ چاہتا وہ اس کا مکلف نہ ہوتا۔ اور ادریس علیہ السلام ان میں سے تھے، اور قرآن میں ان کی رسالت کے بارے میں کوئی نص نہیں آئی، بلکہ ان کے بارے میں کہا گیا: \"صدیقاً نبیاً\" (صدیق، نبی)۔ پس پہلی شخصیت جس سے رسالت کا آغاز ہوا وہ نوح علیہ السلام ہیں، اور پہلی انسانی روح جو پائی گئی وہ روح محمد (صلی اللہ علیہ وسلم) ہے، اور پہلا انسانی جسم جو پایا گیا وہ جسم آدم ہے۔\n\nاور وراثت (الوارثۃ) کا رسالت میں ایک حصہ ہوتا ہے، اسی لیے معاذ اور دیگر کے بارے میں کہا گیا: \"رسول اللہ کا رسول\"۔ اور اس رتبے کو نہیں پاتے اور قیامت کے دن رسولوں کے ساتھ نہیں اٹھائے جائیں گے مگر محدثین (المحدثون) جو ہر امت میں رسول علیہ السلام سے متصل اسناد کے ساتھ احادیث روایت کرتے ہیں۔ پس ان کا رسالت میں حصہ ہے، اور وہ وحی کے ناقل ہیں، اور تبلیغ میں انبیاء کے وارث ہیں۔ اور فقہاء، اگر ان کا حدیث کی روایت میں کوئی حصہ نہ ہو، تو انہیں یہ درجہ حاصل نہیں ہوتا، اور وہ رسولوں کے ساتھ نہیں اٹھائے جائیں گے، بلکہ عام لوگوں میں اٹھائے جائیں گے۔ اور علماء کا نام صرف اہل حدیث پر ہی لاگو ہوتا ہے، اور وہی حقیقت میں ائمہ ہیں۔ اسی طرح زہاد، عباد، اور اہل آخرت میں سے جو اہل حدیث میں سے نہیں ہیں، ان کا حکم فقہاء جیسا ہے؛ وہ وراثت میں ممتاز نہیں ہوں گے اور رسولوں کے ساتھ نہیں اٹھائے جائیں گے، بلکہ عام لوگوں کے ساتھ اٹھائے جائیں گے، اور صرف اپنے نیک اعمال کی وجہ سے ان سے ممتاز ہوں گے، جیسا کہ اہل اجتہاد فقہاء اپنے علم کی وجہ سے عام لوگوں سے ممتاز ہوتے ہیں۔\n\nاور صالحین میں سے جس کا نبی صلی اللہ علیہ وسلم کے ساتھ اپنے کشف (الکشف) میں کوئی مکالمہ ہوا ہو اور اس نے عالم کشف و شہود (الشہود) میں آپ کی صحبت اختیار کی ہو اور آپ سے علم حاصل کیا ہو، وہ قیامت کے دن آپ کے ساتھ اٹھایا جائے گا اور ان صحابہ میں سے ہو گا جنہوں نے اشرف ترین مقام اور اعلیٰ ترین حالت میں آپ کی صحبت اختیار کی۔ اور جسے یہ کشف (الکشف) حاصل نہ ہو وہ ان میں سے نہیں ہے۔ اور نیند والا شخص اس درجے کو نہیں پا سکتا، اور اسے صاحب (صحابی) نہیں کہا جائے گا، خواہ وہ آپ کو ہر خواب میں دیکھے، جب تک کہ وہ آپ کو بیداری کی حالت میں کشف (الکشف) کے ذریعے نہ دیکھے، آپ اس سے مخاطب ہوں، وہ آپ سے علم حاصل کرے، اور آپ ان احادیث کی تصحیح کریں جن کے طریق (سند) میں طعن واقع ہوا ہو۔\n\nپس یہ تینوں آباء ہمارے باپ ہیں اس میں جو ہم نے ذکر کیا، اور چوتھے باپ ابراہیم علیہ السلام ہیں، وہ اسلام میں ہمارے باپ ہیں، اور وہی ہیں جنہوں نے ہمارا نام مسلم رکھا۔ اور انہوں نے بیت اللہ کو چار ارکان پر قائم کیا، پس چار متناسب مفردات پر دلیل قائم ہوئی، اور نتیجہ مقدمات کے متناسب تھا۔ پس دیکھو جس کی یہ مقدمات ہوں—اور وہ محمد، آدم، نوح، اور ابراہیم علیہم السلام ہیں—تو نتیجہ کتنا اشرف ہو گا! اور ان آباء سے پیدا ہونے والا بیٹا پاکیزہ روح، پاکیزہ جسم، پاکیزہ رسالت و شریعت، اور پاکیزہ شریف نام کا حامل ہے۔ اور جس کا باپ ان مذکورین میں سے ہو، تو اس سے زیادہ خوش بخت کوئی نہیں، اور وہ اولیاء میں سب سے بلند منصب اور مقام والا ہے۔\n\nاور چونکہ نشأت (پیدائش) پہلے جنتوں میں ظاہر ہوئی، اور اس کا زمین پر اترنا خلافت (الخلافۃ) کی وجہ سے ہوا نہ کہ معصیت کی سزا کے طور پر۔ کیونکہ سزا تو سوآت (شرمگاہوں) کے ظاہر ہونے سے حاصل ہو چکی تھی، اور اجتباء (چن لینا) اور توبہ الٰہی کلمات کے تلقین سے حاصل ہو چکی تھی۔ پس نزول صرف خلافت کے لیے باقی رہا۔ پس یہ نزول تشریف اور تکریم کا تھا تاکہ وہ آخرت میں اپنے خوش بخت بیٹوں—رسولوں، انبیاء، اولیاء، اور مومنین—کے جم غفیر کے ساتھ واپس لوٹے۔ لیکن چونکہ خلافت ظاہر میں ربوبیت (الربوبیۃ) تھی، کیونکہ وہ بادشاہ کے حکم سے ظاہر ہوتا ہے، پس وہ بادشاہت میں اپنے آقا کی صفات کے ساتھ تصرف کرتا ہے، اگرچہ اس کی بندگی (العبودیۃ) اس کے باطن میں مشہود ہوتی ہے۔ پس اس کی بندگی اس کی تمام رعایا، جو اس کے پیروکار ہیں، کے نزدیک عام نہیں ہوئی، اور اس کی بادشاہت ان کے ذریعے، ان کے پیروکاروں کے ذریعے، اور ان سے علم حاصل کرنے کے ذریعے ظاہر ہوئی۔ پس وہ ظاہر میں ان کی مجاورت میں زیادہ قریب تھا، اور اس مقدار سے اس کی بندگی کا کچھ حصہ اس سے پوشیدہ ہو جاتا ہے۔ کیونکہ حقائق اسی کا تقاضا کرتے ہیں۔\n\nاسی لیے انبیاء پر وحی میں کثرت سے نازل ہوتا ہے: \"کہہ دیجیے: میں تو تمہاری طرح کا ایک بشر ہوں، میری طرف وحی کی جاتی ہے\" (قُلْ إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ يُوحَى إِلَيَّ)۔ اور یہ آیت اس علت کے لیے ایک دوا ہے۔ پس اس مقدار کی وجہ سے دنیا میں رسول انبیاء کے احوال گریہ و زاری اور نوحہ تھے، کیونکہ یہ وہ مقام ہے جہاں اس کے فتنے سے بچا جاتا ہے۔ اور جس کا یہ حال ہو، یعنی تقویٰ اور بچاؤ، وہ کیسے خوش ہو سکتا ہے؟ یا وہ شخص کیسے لذت حاصل کر سکتا ہے جو پرہیزگار ہو؟ کیونکہ اس کا تقویٰ، اس کا ڈر، اور اس کا خوف کہ وہ مقام تکلیف کا حق ادا نہیں کر پائے گا، اور اس کا یہ علم کہ وہ اس کے بارے میں جواب دہ ہے، اسے مقام کی عزت پر خوش ہونے یا مسرور ہونے نہیں دیتا۔\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: \"میں تم سب سے زیادہ اللہ سے ڈرنے والا ہوں اور تم سب سے زیادہ جانتا ہوں کہ کس چیز سے بچا جائے،\" جب صحابہ نے آپ کے اجتہاد کے بارے میں کہا کہ اللہ نے آپ کے اگلے پچھلے گناہ معاف کر دیے ہیں، آپ پر یہ قول نازل ہونے کے بعد: \"تاکہ اللہ آپ کے اگلے اور پچھلے گناہ معاف کر دے\" (لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ)۔\n\nاور اسی طرح کی مثالیں ہیں۔ اور فرمایا: \"بے شک اللہ کے بندوں میں سے صرف علماء ہی اس سے ڈرتے ہیں\" (إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ)۔ اور فرمایا: \"اللہ سے ڈرو جیسا کہ اس سے ڈرنے کا حق ہے\" (اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ)۔ اور فرمایا: \"پس اللہ سے ڈرو جہاں تک تم استطاعت رکھو\" (فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ)۔ اور \"اللہ سے ڈرو اور اللہ تمہیں سکھاتا ہے\" (وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ)۔ اور نبوت سے وراثت (الوراثۃ) کا یہی حصہ ہے کہ اللہ اپنے متقی بندے کو تعلیم دینے کی ذمہ داری لے لیتا ہے، پس اس کی سند قریب ہو جاتی ہے، اور وہ کہتا ہے: \"مجھے میرے رب نے اپنے نبی کی شریعت کے بارے میں خبر دی جس کے ذریعے اس نے اس کی عبادت کی، اس شخص سے جس نے اسے لیا، جس کی وحی اس کی طرف کی گئی\"۔ پس وہ علم میں بلند ہے اور حکم میں پیروکار ہے۔ اور یہ وہ لوگ ہیں جو نبی نہیں ہیں، اور انبیاء علیہم السلام ان پر اس حالت میں رشک کرتے ہیں، کیونکہ وہ اللہ سے علم حاصل کرنے میں ان کے ساتھ شریک ہوئے، اور اس گروہ کا اللہ سے علم حاصل کرنا اس تقویٰ کے بعد ہوا جس پر انہوں نے عمل کیا جو یہ رسول ان کے پاس لائے تھے۔\n\nپس اگرچہ وہ اس مرتبے پر ہیں اور ان کے تقویٰ نے انہیں رسولوں کے میزان میں اور ان کی حفاظت کے دائرے میں اللہ سے علم حاصل کرنے کا نتیجہ دیا، اور رشک (الغبط) اس بات پر واقع ہوا کہ وہ رسول نہیں تھے، پس وہ ہمیشہ ذات حق (الحق) کے ساتھ بندگی (العبودیۃ) کی اصل پر باقی رہے جس میں ربوبیت (الربوبیۃ) کی آمیزش بالکل نہیں ہوئی۔ پس اسی وجہ سے ان کے آرام پر رشک واقع ہوا، اگرچہ رسول ان سے زیادہ بلند مقام رکھتے ہیں۔ کیا تم نہیں دیکھتے کہ قیامت کے دن \"انہیں سب سے بڑی گھبراہٹ غمگین نہیں کرے گی\" (لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ)، اور ان میں خوف کا شائبہ تک نہیں ہو گا، جبکہ رسول اس دن اپنی امتوں کے لیے شدید خوف کی انتہا پر ہوں گے، نہ کہ اپنی ذات کے لیے، اور امتیں اپنی ذات کے لیے خوف میں ہوں گی۔ اور ان لوگوں کے پاس اس دن خوف کا کوئی اثر نہیں ہو گا، کیونکہ وہ \"رحمٰن کی طرف وفد بنا کر جمع کیے جائیں گے\" (إِلَى الرَّحْمَنِ وَفْدًا)۔\n\nپھر یہ جان لو، اے صدیق! اس کے بعد کہ میں نے تمہیں تمہارے منصب کی بلندی سے آگاہ کیا جو تمہارے لیے مشروع کی گئی چیز کی پیروی میں ہے، کہ لوگوں نے اللہ کے ان سچے بندوں کے بارے میں غلطی کی جو اللہ کی اطاعت پر ثابت قدم رہتے ہیں۔ اور جو شخص معاملے کو اس کی حقیقت پر نہیں جانتا اور نہ ہی اس قوم کے راستے کا ذائقہ چکھا ہے، اس نے یہ شرط لگائی کہ اللہ کی طرف بلانے والا اگر اللہ کے ساتھ صدق کی حالت میں اللہ کی طرف بلائے تو سامعین کے نفوس میں قبولیت کا اثر ہوتا ہے، پس اس کی دعوت رد نہیں ہوتی۔ اور اگر وہ اپنی زبان سے بلائے اور اس کا دل دنیا کی محبت اور اس کے اغراض سے بھرا ہو، اور اس کی دعوت ایک صنعت ہو، تو وہ دلوں پر اثر نہیں کرتی اور کانوں سے آگے نہیں بڑھتی۔ پس وہ کہتے ہیں کہ جب بات دل سے نکلتی ہے تو دل میں اترتی ہے، اور جب زبان سے نکلتی ہے تو کانوں سے آگے نہیں بڑھتی۔ اور یہ انتہائی غلطی ہے۔\n\nپس اللہ کی قسم! کسی رسول نے اپنی قوم کو نہیں بلایا مگر معصوم دل کی سچی زبان سے اور محفوظ زبان سے، جو اپنی رعایا پر بہت شفیق تھا، اور ان کی طرف سے اس دعوت کو قبول کرنے کا خواہشمند تھا جس کی طرف اس نے انہیں بلایا۔ یہ اللہ تعالیٰ کی طرف دعوت دینے میں رسولوں کے احوال اور ان کا صدق ہے۔ اس کے باوجود نبی صلی اللہ علیہ وسلم فرماتے ہیں: \"میں نے اپنی قوم کو رات دن بلایا، مگر میری دعوت نے ان کے فرار میں ہی اضافہ کیا\" (إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا)۔ اور \"اور بے شک جب بھی میں نے انہیں بلایا تاکہ تو انہیں بخش دے، تو انہوں نے اپنی انگلیاں اپنے کانوں میں ڈال لیں اور اپنے کپڑے اوڑھ لیے اور اصرار کیا اور بڑا تکبر کیا\" (وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا)۔ اور اللہ تعالیٰ نے فرمایا: \"ان کی ہدایت آپ پر نہیں ہے\" (لَيْسَ عَلَيْكَ هُدَاهُمْ)۔ اور فرمایا: \"بے شک آپ جسے چاہیں ہدایت نہیں دے سکتے\" (إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ)۔ اور فرمایا: \"رسول پر صرف پہنچا دینا ہے\" (مَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ)۔\n\nاگر کسی کی بات کسی پر اثر کرتی اور اسے اس کی بات میں سچا کر دیتی، تو ہر وہ شخص اسلام قبول کر لیتا جس سے نبی علیہ السلام نے براہ راست خطاب کیا تھا۔ بلکہ آپ کو جھٹلایا گیا، اور بات آپ کے منہ پر رد کر دی گئی، اور آپ سے جنگ کی گئی۔ پس اگر سامع کے لیے اللہ کی طرف سے عنایت نہ ہو کہ وہ اس کے دل میں قبولیت کی صفت پیدا کر دے تاکہ وہ اس کے ذریعے نور الٰہی کو نبوت کے چراغ سے ڈالے، جیسا کہ اللہ تعالیٰ نے اس کی صفت بیان کی: \"اور ایک روشن چراغ\" (وَسِرَاجًا مُنِيرًا)۔ کیا تم نہیں دیکھتے کہ جب بتی کا سرا دھواں نکال رہا ہو اور وہ روشن نہ ہو، پھر جب وہ اس دھوئیں کو چراغ کے قریب لاتی ہے، تو وہ دھواں اپنی رطوبت کی وجہ سے روشن ہو جاتا ہے اور چراغ سے نور اس میں لگ جاتا ہے اور اپنے راستے پر نیچے اترتا ہے یہاں تک کہ اس بتی کے سرے میں ٹھہر جاتا ہے جہاں سے وہ دھواں چراغ کی طرف اٹھا تھا، پس بتی روشن ہو جاتی ہے اور نوری ہونے میں چراغ کے رتبے کو پہنچ جاتی ہے۔ اگر اس کے پاس تیل کا مادہ ہو، جو کہ عنایت الٰہیہ ہے، تو وہ روشن رہتی ہے جب تک تیل اسے مدد دیتا رہتا ہے۔ اور وہ نور اس تیل کی رطوبتوں کو زائل کر دیتا ہے جس سے اس کا بقا ہے، اور اس میں نور ظاہر ہونے کے بعد چراغ کے ساتھ کوئی تعلق باقی نہیں رہتا، اور امداد حق کی طرف سے باقی رہتی ہے۔\n\nپس کوئی نہیں جانتا کہ وہ کہاں تک پہنچتا ہے۔ کیونکہ انبیاء نے لوگوں کو اپنی طرف نہیں بلایا، بلکہ انہیں اپنے رب کی طرف بلایا۔ پس جس دل پر اللہ نے عنایت کی اور اس میں اس دعوت کے لیے شوق (الشوق) کی حرارت پیدا ہوئی، جیسے بتی کے سرے کا جلنا، پھر اس شوق سے اس چیز کی طرف ہمت پیدا ہوئی جس کی طرف رسول نے اسے اپنی بات میں بلایا، جیسے اس ناریت سے دھوئیں کا اٹھنا جو بتی کے سرے میں ہے، اور یہ ایک جاذب قوت ہے، پس اس نے نبوت کے نور، وحی اور ہدایت سے وہ روشنی کھینچ لی جو دھوئیں میں قائم ہوئی، پس وہ اسے اپنے صاحب کے دل کی طرف واپس لے گئی، پس وہ ہدایت پا گیا اور روشن ہو گیا، جیسے یہ بتی روشن ہوئی۔ پھر وہ نبی سے جدا ہوا اور اپنے گھر والوں کی طرف نور بن کر چلا گیا۔ پس اگر اللہ نے اس پر عنایت کی اور اپنی توفیق سے اسے مدد دی، تو اس امداد کے ذریعے ہدایت کا نور اس کے دل میں ثابت ہو گیا، اور اس کے بعد رسول کا اس کے ساتھ کوئی کام باقی نہیں رہتا سوائے احکام کی تعیین کے۔ مگر یہ نور، یعنی نور ایمان، \"آپ نہ جانتے تھے کہ کتاب کیا ہے اور نہ ایمان کیا ہے، لیکن ہم نے اسے نور بنایا جس کے ذریعے ہم اپنے بندوں میں سے جسے چاہتے ہیں ہدایت دیتے ہیں\" (مَا كُنْتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ وَلَكِنْ جَعَلْنَاهُ نُورًا نَهْدِي بِهِ مَنْ نَشَاءُ مِنْ عِبَادِنَا)۔\n\nآپ علیہ السلام نے اپنے رب کی طرف سے فرمایا: \"میں اللہ کی طرف بلاتا ہوں\" (أَدْعُو إِلَى اللَّهِ)، اور یہ نہیں فرمایا کہ مجھے اپنی طرف بلاؤ۔ اور \"إلی\" (کی طرف) ایک حرف ہے جو غایت (مقصد) کے لیے وضع کیا گیا ہے۔ پس جب مومن نے جواب دیا، تو وہ اس طریقے پر اپنے رب کی طرف چلا جو اس رسول نے اس کے لیے مشروع کیا تھا۔ پس جب وہ اللہ تک پہنچا، تو ذات حق (الحق) نے اسے اکرام، ہبات، بخششوں اور عطیات کے ساتھ وصول کیا۔ پس وہ اللہ کی طرف بصیرت (بصیرۃ) پر بلانے لگا، جیسا کہ اس رسول نے بلایا تھا، اور یہی وہ قول ہے جب آپ نے فرمایا: \"میں اللہ کی طرف بصیرت پر بلاتا ہوں، میں اور وہ جس نے میری پیروی کی\" (أَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي)۔ پس آپ نے خبر دی کہ جس نے آپ کی پیروی کی وہ بھی اللہ کی طرف بصیرت پر بلاتا ہے۔\n\nپس اگر تم خطاب الٰہی کے مواقع، اس کی تنبیہات اور اس کے اشارات کو جاننے والے ہو، تو اس نے تمہیں رسول صلی اللہ علیہ وسلم کے ساتھ تمہارے حال اور اس کے ساتھ تمہارے حال سے آگاہ کر دیا ہے۔ اور اس نے تمہیں نور اور امداد میں اپنے نبی صلی اللہ علیہ وسلم کی صورت پر بنا دیا ہے، اور تمہارے لیے واضح کر دیا ہے کہ اس معاملے میں تمہاری صورت آپ کے ساتھ وہی ہے جو آپ کی صورت جبرائیل علیہ السلام کے ساتھ تھی، جن کی بتی جبرائیل کے چراغ سے روشن ہوئی اور نور سے چمک اٹھی۔ اور چراغوں میں سے ہر ایک کا نور اس سے منتقل نہیں ہوا، بلکہ وہ اپنی ذات میں اپنے نور پر قائم ہے۔ اور دیکھو کہ رسولوں نے جبرائیل علیہ السلام سے علم حاصل کرنے کے بعد کس پر بھروسہ کیا؟ کیا ان کا بھروسہ جبرائیل پر تھا یا اللہ پر؟ نہیں، اللہ کی قسم! بلکہ کہا گیا: \"رسول اللہ\"، اور یہ نہیں کہا گیا: \"رسول جبرائیل\"۔\n\nاسی طرح جس نے نبوت سے یہ نور حاصل کیا اور بصیرت (بصیرۃ) پر اللہ کی طرف بلایا، تو وہ دعوت اور وہ نور جس کے ذریعے وہ بلاتا ہے، وہ امداد کا نور ہے نہ کہ وہ نور جو اس نے چراغ سے لیا تھا۔ پس اس معاملے میں اس کی نسبت اللہ کی طرف کی جائے گی نہ کہ رسول کی طرف، پس اسے \"عبد اللہ\" (اللہ کا بندہ) کہا جائے گا، اور وہ اللہ کے حکم سے، رسول اللہ کی وساطت سے، اصل کے حکم سے اللہ کی طرف بلانے والا ہے، نہ کہ ان الٰہی علوم کے حکم سے جو اللہ نے اس کے دل پر کھولے ہیں، جو کہ قرآن اور اخبار (احادیث) میں رسول صلی اللہ علیہ وسلم کی لائی ہوئی چیزوں کے بارے میں اس کی فہم کی آنکھ کا کھلنا ہے۔ یہ نہیں کہ یہ ولی کوئی نئی شریعت لائے گا، بلکہ وہ کتاب عزیز میں ایک نئی فہم لائے گا جسے کوئی دوسرا نہیں جانتا تھا کہ وہ معنی اس تلاوت شدہ یا منقول حرف میں موجود ہے۔ پس رسولوں کے لیے، صلوات اللہ علیہم، علم ہے، اور ہمارے لیے فہم ہے، اور یہ بھی علم ہی ہے۔\n\nپس اے میرے بھائی! اگر تم نے اس باب میں جو کچھ ہم نے بیان کیا ہے اس کی تحقیق کی، تو تم الٰہی اسرار پر واقف ہو جاؤ گے اور اللہ کے ان بندوں کا مرتبہ جان لو گے جو اس مرتبے پر ہیں کہ وہ کہاں تک پہنچتے ہیں، وہ کس کے ساتھ ہیں، کس سے علم حاصل کرتے ہیں، کس سے سرگوشی کرتے ہیں، کس پر بھروسہ کرتے ہیں، اور آخرت میں ان کا مقام کہاں ہو گا، اور کیا آخرت میں بھی ان کی مرتبے میں شراکت ہو گی جیسا کہ یہاں نوریہ اور امداد الٰہی میں ان کی شراکت تھی یا نہیں؟\n\nجہاں تک دنیا کا تعلق ہے، تو وہ نبی نہیں ہیں، کیونکہ انہوں نے اپنا راستہ انبیاء سے لیا ہے۔ اور معاملہ صرف امداد میں باقی ہے کہ کیا اس کا اثر پہلے نور کو باقی رکھنا ہے یا ذات حق (الحق) کی طرف سے مہلت کے ساتھ ان کے لیے انوار کی تجدید ہوتی ہے، جیسا کہ چراغ کا نور تیل کی رطوبتوں سے ہوا کے جلنے سے تجدید پاتا ہے۔ پس وہ نہ تو وہی پہلا نور ہے اور نہ ہی اس کے علاوہ ہے، اور نہ وہ نور گیا ہے اور نہ ہی اس کی عینیت باقی ہے۔ اور دیکھنے والا انوار کے اتصال کو نوری ہونے میں ایک ہی صورت دیکھتا ہے، مگر وہ جانتا ہے کہ اگر تیل کی امداد نہ ہوتی تو یہ بجھ جاتا۔ یہ ہر مشاہد کا اس سے نظر اور صورت کے لحاظ سے حصہ ہے۔ اور معنی کے لحاظ سے، وہ نظر سے بڑھ کر اس معرفت کو جانتا ہے کہ امداد کس چیز سے واقع ہوتی ہے اور اس مشہود میں اس کا کیا اثر ہوتا ہے، پس اسے ایک اور علم حاصل ہوتا ہے جو اس کے پاس نہیں تھا۔ پس جو شخص ایسی چیز سے محروم ہو، اسے چاہیے کہ وہ اپنے اوپر خوب نوحہ اور گریہ کرے۔ اللہ ہمیں ان لوگوں میں سے بنائے اور ان میں سے جو اللہ کی طرف بصیرت پر بلاتے ہیں یا بصیرت پر اللہ کے ساتھ منفرد ہوتے ہیں، بے شک وہ اس کا مالک ہے اور اس پر قادر ہے۔\n\nاور یہ مقدار اس باب میں کافی ہے، اور فائدہ حاصل ہو چکا ہے۔ پس ہم ان علوم کا ذکر کرتے ہیں جو یہ مقام (منزل) اپنے اندر رکھتا ہے:\n\nجان لو کہ یہ اسمائی حقائق (الحقائق الإسمائيۃ) کے علم، اور رسالت کے علم کو اس مقام کے لحاظ سے شامل ہے جہاں سے وہ بھیجی گئی، نہ کہ اس لحاظ سے کہ وہ رسالت ہے۔\n\nاور خوف دلانے کے علم کو کہ کیا اللہ سے ڈرا جائے یا اس چیز سے جو اس کی طرف سے ہو گی؟ اور جو اللہ سے ڈرتا ہے اس کا مشہود کیا ہے؟ اور خوف صرف اس چیز سے ہوتا ہے جو تم سے متعلق ہو اور تم میں حلول کرے، اور ذات حق (الحق) حلول فی الذوات سے منزہ ہے۔ پس \"میں تیری پناہ مانگتا ہوں تجھ سے\" (أَعُوذُ بِكَ مِنْكَ) کا کیا معنی ہے؟\n\nاور بندوں کی اطاعت کے علم کو کہ ان کی اطاعت کس چیز میں کی جاتی ہے؟ اور کیا اس اطاعت میں ان کا کوئی حصہ استحقاق کے طریقے پر ہے یا نہیں؟ کیونکہ اللہ فرماتا ہے: \"جو رسول کی اطاعت کرتا ہے، اس نے اللہ کی اطاعت کی\" (مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ)۔ یہ ایک مقام ہے۔\n\nاور دوسرا مقام: \"اور رسول کی اطاعت کرو\" (وَأَطِيعُوا الرَّسُولَ)۔\n\nاور تیسرا مقام: \"اللہ کی اطاعت کرو اور رسول کی اطاعت کرو اور اپنے میں سے اولی الامر کی\" (أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ)۔\n\nپس یہ سب مقامات اطاعت کا تقاضا کرتے ہیں اور مطاع (جس کی اطاعت کی جائے) مختلف ہوتا ہے۔ اور اس کی تحقیق عجیب ہے، اور اسی طرح اس کی تفصیل بھی جس میں اطاعت واقع ہوتی ہے۔ اور کیا اولی الامر کی اطاعت کی نسبت رسول کی اطاعت کی نسبت جیسی ہے، جو اللہ کی اطاعت کی نسبت جیسی ہے، یا نہیں، بلکہ وہ مختلف ہوتی ہے؟\n\nاور مخالفتوں اور موافقتوں کے نتائج کا علم۔\n\nاور دو اجلوں (موت کی مدتوں) کے درمیان فرق کا علم، اور کیوں پہلا اجل تھا اور کیوں دوسرا اجل تھا؟ کیا ایک ہی عین کے لیے یا دو مختلف امور کے لیے؟\n\nاور اللہ کی طرف بلائے جانے والے لوگوں کے احوال کا علم کہ کون سی چیز انہیں جواب دینے سے روکتی ہے، باوجود اس کے کہ وہ بلانے والے کی سچائی کو جانتے ہیں؟ اور کون سی چیز انہیں جواب دینے کی طرف بلاتی ہے، جبکہ مجلس ایک ہے، بلانے والا ایک ہے، اور دعوت ایک ہے؟\n\nاور معجل (فوری) حسی اور معنوی ثواب کا علم۔\n\nاور اعتبار (غور و فکر) کا علم۔\n\nاور عالم علوی (بالائی عالم) اور عالم سفلی (زیریں عالم) کا علم۔\n\nاور اس راز کا علم جو اللہ کے سوا معبودوں میں قائم ہوا، اور وہ مناسبت کیا تھی جس نے انہیں اور ان کی عبادت کرنے والوں کو جمع کیا؟ اور کیوں وہ ابدی شقاوت میں مبتلا ہوئے اور انہیں مغفرت حاصل نہ ہوئی اور نہ وہ آگ سے نکلے؟\n\nاور غیرت الٰہیہ (الغيرة الإلهيۃ) کا علم اور ہر غیور کی غیرت کا علم، اور کیوں وہ پلٹتی ہے؟ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب سیصد و سیزدهم در معرفت منزل گریه و نوحه از حضرت محمدیه (الحضرة المحمدية).\n\nمی‌گویم که آدم اصل جسم‌هاست، چنانکه اصل رسالت، شریعت نوح است.\nو همانا محمد اصلی شریف است، که در هستی (الوجود) برای هر روحی عزیز است.\nمن فرزندی برای پدران بزرگوارم، پس نورم در روشنایی مانند درخشش است.\nچون حاضر شوند و برادرانم ایستاده باشند، برای خدمتشان به مسیح مشتاق شدم.\nزیرا من به دست او توبه کردم، و او مرا بر کشتن مسیح (نفس) یاری داد.\nو آن در خواب بود، و موسی در آن با گفتار فصیح، رازدار من بود.\nو آهو را در دست راستم به من داد، و با اشاره و صریح (سخن) فهمانید.\nو مرا بی‌نیاز کرد، پس روحم را به اوج رساند، و مرا فقیر ساخت، پس قبرم را همراهم کرد.\nپس اگر حاضر شوند و مقامی آنان را در بر گیرد، چون ایشان را ببینم، تمایلم به سوی آنهاست.\nپس نیکی به والدین بر من فرض است، ای نفس من، بر کوتاهی (تفریط) نوحه کن!\nمن پسر محمد و پسر نوح هستم، چنانکه به درستی (فی الصحیح) پسر آدم هستم.\nای کسی که رازها را می‌فهمی، این زبان رموز ماست که با علم وحی می‌کند.\n\n### [اینکه اصل ارواح ما روح محمد (ص) است]\n\nبدان، خداوند تو را تأیید کند، که اصل ارواح ما روح محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است. پس او اولین پدران از نظر روح است و آدم اولین پدران از نظر جسم، و نوح اولین رسولی است که فرستاده شد. کسانی که پیش از او بودند، تنها پیامبرانی بودند که هر یک بر شریعتی از جانب پروردگار خود بودند. پس هر کس می‌خواست، با او وارد شریعتش می‌شد و هر کس نمی‌خواست، وارد نمی‌شد. کسی که وارد می‌شد و سپس بازمی‌گشت، کافر بود؛ و کسی که وارد نمی‌شد، کافر نبود. و کسی که خود را در امور زائد (الفضول) وارد می‌کرد و پیامبران را تکذیب می‌نمود، کافر بود؛ و کسی که چنین نمی‌کرد و بر بی‌گناهی (البراءة) باقی می‌ماند، کافر نبود.\n\nو اما قول خداوند متعال: «وَإِنْ مِنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ» (و هیچ امتی نیست مگر اینکه در میانشان بیم‌دهنده‌ای گذشته است)، نص صریح در رسالت نیست، بلکه نص در این است که در هر امتی عالمی به خدا و امور آخرت وجود داشته است، و آن شخص نبی است نه رسول. اگر رسول بود، می‌فرمود «إلیها» (به سوی آن) و نمی‌فرمود «فیها» (در میان آن). و ما می‌گوییم که در میان آنان پیامبرانی بودند که عالم به خدا بودند و هر کس می‌خواست با آنان موافقت می‌کرد و در دینشان و تحت حکم شریعتشان وارد می‌شد، و کسی که نمی‌خواست، مکلف به آن نبود. و ادریس (علیه السلام) از جمله آنان بود و در قرآن نص صریحی بر رسالت او نیامده، بلکه درباره او گفته شده است: «صِدِّيقاً نَبِيًّا» (بسیار راستگو و پیامبر). پس اولین شخصی که رسالت با او آغاز شد، نوح (علیه السلام) است، و اولین روح انسانی که یافت شد، روح محمد است، و اولین جسم انسانی که یافت شد، جسم آدم است.\n\nو برای وارثان، بهره‌ای از رسالت است، و به همین دلیل درباره معاذ و دیگران گفته شده است: «رسول رسول الله» (فرستاده فرستاده خدا). و به این رتبه دست نمی‌یابند و در روز قیامت با رسولان محشور نمی‌شوند، مگر محدثانی (المحدثون) که احادیث را با اسانید متصل به رسول (علیه السلام) در هر امتی روایت می‌کنند. پس آنان بهره‌ای در رسالت دارند و ناقلان وحی (نقلة الوحي) هستند و وارثان انبیا در تبلیغ. و فقها، اگر نصیبی در روایت حدیث نداشته باشند، این درجه را ندارند و با رسولان محشور نمی‌شوند، بلکه در عموم مردم محشور می‌گردند. و نام «علما» جز بر اهل حدیث اطلاق نمی‌شود و آنان در حقیقت امامان هستند. همچنین زاهدان و عابدان و اهل آخرت، اگر از اهل حدیث نباشند، حکمشان حکم فقهاست؛ در وراثت متمایز نمی‌شوند و با رسولان محشور نمی‌گردند، بلکه با عموم مردم محشور می‌شوند و تنها به واسطه اعمال صالحشان از آنان متمایز می‌گردند.\n\nهمان‌طور که فقهای اهل اجتهاد به واسطه علمشان از عوام متمایز می‌شوند. و هر کس از صالحانی باشد که در کشف (الکشف) خود با پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) حدیثی داشته و در عالم کشف و شهود (الکشف والشهود) با او مصاحبت کرده و از او اخذ نموده باشد، در روز قیامت با او محشور می‌شود و از صحابه‌ای خواهد بود که در شریف‌ترین موطن و بر والاترین حالت با او مصاحبت کرده‌اند. و کسی که این کشف (الکشف) را نداشته باشد، از آنان نیست. و صاحب خواب (رؤیا) به این درجه نمی‌رسد و «صاحب» (مصاحب) نامیده نمی‌شود، حتی اگر او را در هر خوابی ببیند، مگر اینکه او را در بیداری به صورت کشف (کشف) ببیند که با او سخن می‌گوید و از او اخذ می‌کند و احادیثی را که از جهت سند مورد طعن واقع شده‌اند، برای او تصحیح می‌نماید.\n\nپس این سه پدر، پدران ما در آنچه ذکر کردیم، هستند. و پدر چهارم، ابراهیم (علیه السلام) است که پدر ما در اسلام است و اوست که ما را مسلمان نامید و خانه (کعبه) را بر چهار رکن بنا نهاد. پس دلیل بر چهار مفرد متناسب استوار شد و نتیجه با مقدمات تناسب یافت. پس بنگر کسی که اینها مقدمات او باشند – و آنها محمد، آدم، نوح و ابراهیم (علیهم السلام) هستند – نتیجه چقدر شریف خواهد بود. و فرزند حاصل از این پدران، روحی پاک، جسمی پاک، رسالتی و شریعتی پاک، و نامی شریف و پاک است. و کسی که پدرش این افراد مذکور باشند، هیچ کس از او سعادتمندتر نیست و او از نظر منصب و جایگاه، والاترین اولیاست.\n\nو چون نشأت (آفرینش) ابتدا در بهشت ظاهر شد و هبوط آن به زمین به خاطر خلافت (الخلافة) بود، نه مجازات گناه (عقوبة المعصية)؛ زیرا مجازات با آشکار شدن شرمگاه‌ها حاصل شد و اجتباء (برگزیدگی) و توبه با دریافت کلمات الهی محقق گشت. پس نزول جز برای خلافت باقی نماند. بنابراین، هبوط، تشریف و تکریم بود تا با انبوهی از فرزندان سعادتمند خود از رسولان، انبیا، اولیا و مؤمنان به آخرت بازگردد. اما چون خلافت در ظاهر ربوبیت (ربوبية) بود، زیرا خلیفه به حکم ملک ظاهر می‌شود و در ملک با صفات سَرور خود تصرف می‌کند، هرچند بندگی (عبوديته) او در باطنش مشهود است، بندگی او بر تمام رعیتش که پیروان او هستند، عمومیت نیافت و مُلک او به واسطه آنان و پیروانشان و اخذ از او ظاهر شد. پس او در مجاورت ظاهری به آنان نزدیک‌تر بود و به همین میزان، بخشی از بندگی او از رعیتش پنهان می‌ماند؛ زیرا حقایق این را اقتضا می‌کنند.\n\nو به همین دلیل، اغلب در وحی بر پیامبران نازل می‌شود: «قُلْ إِنَّما أَنَا بَشَرٌ مِثْلُكُمْ يُوحى‏ إِلَيَّ» (بگو: من بشری هستم مانند شما که به من وحی می‌شود). و این آیه، دارویی برای این بیماری است. به همین میزان، احوال انبیا و رسولان در دنیا، گریه و نوحه بود، زیرا این موضعی است که از فتنه‌اش پرهیز می‌شود. و کسی که حالش چنین باشد، یعنی تقوا و پرهیز و ترس، چگونه شاد می‌شود یا لذت می‌برد؟ کسی که پرهیز می‌کند، زیرا تقوا و احتیاط و ترس او از این است که حق مقام تکلیف را ادا نکند، و علم او به اینکه مسئول است، او را رها نمی‌کند تا شاد شود یا به عزت مقام مسرور گردد.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «أنا أتقاكم لله وأعلمكم بما اتقى» (من پرهیزگارترین شما نسبت به خدا و داناترین شما به آنچه باید پرهیز شود هستم)، هنگامی که صحابه در مورد اجتهاد او به وی گفتند: خداوند گناهان گذشته و آینده تو را آمرزیده است، پس از نزول این قول بر او: «لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ» (تا خداوند گناهان گذشته و آینده تو را بیامرزد).\n\nو امثال اینها. و فرمود: «إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ» (همانا از میان بندگان خدا، تنها دانایان از او می‌ترسند). و فرمود: «اتَّقُوا الله حَقَّ تُقاتِهِ» (از خدا آن‌گونه که شایسته تقوای اوست، پروا کنید). و فرمود: «فَاتَّقُوا الله ما اسْتَطَعْتُمْ» (پس تا می‌توانید از خدا پروا کنید). و «واتَّقُوا الله ويُعَلِّمُكُمُ الله» (و از خدا پروا کنید و خداوند به شما می‌آموزد). و این همان بهره وراثت از نبوت است که خداوند تعلیم بنده پرهیزگار خود را بر عهده می‌گیرد، پس سند او را نزدیک می‌سازد و می‌گوید: پروردگارم مرا به شریعت پیامبرش که او را به آن عبادت کرده، خبر داد، از کسی که آن را از او گرفته یا به او وحی کرده است. پس او در علم والا و در حکم تابع است. و اینان کسانی هستند که پیامبر نیستند و انبیا (علیهم السلام) بر این حالشان غبطه می‌خورند، زیرا آنان در اخذ از خدا با انبیا شریک شده‌اند. و اخذ این طایفه از خدا پس از تقوایی است که بر اساس آنچه این رسول برایشان آورده، عمل کرده‌اند. پس آنان با وجود این مرتبه و با وجود اینکه تقوایشان منجر به اخذ از خدا در موازین رسولان و تحت حمایت و در دایره آنان شده است، غبطه به این دلیل واقع شد که آنان رسول نبودند، پس همیشه با حق (الحق) بر اصل بندگی باقی ماندند که هیچ ربوبیتی (ربوبية) آن را آلوده نکرده است. پس غبطه از این جهت به خاطر آسایش آنان واقع شد، هرچند رسولان مقامی والاتر از آنان دارند. آیا نمی‌بینی که در روز قیامت «لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ» (بزرگترین ترس آنان را اندوهگین نمی‌سازد) و هیچ ترسی به آنان راه نمی‌یابد، در حالی که رسولان در آن روز در نهایت شدت ترس بر امت‌های خود هستند، نه بر خودشان؟ و امت‌ها در ترس بر خودشان هستند. و این گروه در آن روز هیچ اثری از ترس ندارند، زیرا «حُشِرُوا إِلَى الرَّحْمنِ وَفْداً» (به سوی خدای رحمان به عنوان مهمان محشور می‌شوند).\n\nسپس بدان، پس از آنکه تو را به والایی منصب خود، ای صدیق، در پیروی از آنچه برایت تشریع شده، آگاه ساختم، که مردم در مورد بندگان صادق خدا که بر طاعت خدا مداومت دارند، دچار اشتباه شده‌اند. و کسی که امر را آن‌گونه که هست نمی‌شناسد و راه قوم را نچشیده است، شرط می‌گذارد که اگر دعوت‌کننده به سوی خدا (الداعي إلى الله) با حالتی از صدق با خدا دعوت کند، در نفوس شنوندگان اثر پذیرش می‌گذارد و دعوتش رد نمی‌شود. و اگر با زبانش دعوت کند و قلبش مملو از حب دنیا و اغراض آن باشد و دعوتش ساختگی باشد، در قلب‌ها اثر نمی‌کند و از گوش‌ها فراتر نمی‌رود. و می‌گویند: «سخن اگر از دل برآید، بر دل نشیند، و اگر از زبان برآید، از گوش‌ها فراتر نرود.» و این نهایت اشتباه است. به خدا سوگند، هیچ رسولی قوم خود را دعوت نکرد، مگر با زبان صدق از قلبی معصوم و زبانی محفوظ، که بسیار بر رعیت خود شفیق بود و مشتاق به اجابت آنان نسبت به آنچه بدان دعوتشان می‌کرد. اینها احوال رسولان در دعوتشان به سوی خداوند متعال و صدقشان است. با این حال، پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «إِنِّي دَعَوْتُ قَوْمِي لَيْلًا ونَهاراً فَلَمْ يَزِدْهُمْ دُعائِي إِلَّا فِراراً» (من قوم خود را شب و روز دعوت کردم، اما دعوت من جز بر فرارشان نیفزود) و «إِنِّي كُلَّما دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصابِعَهُمْ في آذانِهِمْ واسْتَغْشَوْا ثِيابَهُمْ وأَصَرُّوا واسْتَكْبَرُوا اسْتِكْباراً» (و من هر بار که آنان را دعوت کردم تا تو آنان را بیامرزی، انگشتانشان را در گوش‌هایشان نهادند و لباس‌هایشان را بر سر کشیدند و اصرار ورزیدند و به شدت تکبر کردند). و خداوند متعال فرمود: «لَيْسَ عَلَيْكَ هُداهُمْ» (هدایت آنان بر عهده تو نیست). و فرمود: «إِنَّكَ لا تَهْدِي من أَحْبَبْتَ» (تو کسی را که دوست داری هدایت نمی‌کنی). و فرمود: «ما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ» (بر رسول جز ابلاغ نیست).\n\nاگر سخن کسی در دیگری اثر می‌کرد و او را در سخنش تصدیق می‌نمود، هر کس که پیامبر (علیه السلام) با او رو در رو سخن می‌گفت، اسلام می‌آورد. بلکه او را تکذیب کردند و سخن را به رویش بازگرداندند و با او جنگیدند. اگر عنایت الهی شامل حال شنونده نباشد که در قلب او صفت پذیرش را قرار دهد تا نور الهی را از چراغ نبوت (سراج النبوة) دریافت کند، همان‌طور که خداوند متعال آن را توصیف کرده است: «وسِراجاً مُنِيراً» (و چراغی نوربخش). آیا نمی‌بینی فتیله‌ای را که سر آن دود خارج می‌کند و روشن نیست؟ اگر آن دود با چراغ (سراج) هم‌تراز شود، آن دود به واسطه رطوبتی که در آن است، مشتعل می‌شود و نور از چراغ به آن می‌چسبد و از مسیر آن پایین می‌آید تا در سر فتیله‌ای که آن دود از آن به سوی چراغ برخاسته، مستقر شود. پس فتیله روشن می‌شود و در نورانیت به رتبه چراغ می‌رسد. اگر ماده روغن داشته باشد، که همان عنایت الهی است، تا زمانی که روغن آن را تغذیه می‌کند، روشن باقی می‌ماند. و آن نور، رطوبت‌های آن روغن را که بقای آن به واسطه آن است، از بین می‌برد. و پس از آنکه نور در آن ظاهر شد و امداد از جانب حق (الحق) باقی ماند، دیگر سخنی از چراغ با آن باقی نمی‌ماند. پس هیچ کس نمی‌داند که به کجا می‌رسد.\n\nزیرا انبیا مردم را به سوی خود دعوت نکردند، بلکه آنان را به سوی پروردگارشان دعوت کردند. پس هر قلبی که خداوند به آن عنایت کند و سوزش شوق (حرقة الشوق) به آن دعوت در آن برپا شود، مانند سوختن سر فتیله، سپس از این شوق، همتی (همة) به سوی آنچه رسول او را بدان دعوت کرده است، برانگیخته شود، مانند برخاستن دود از آن آتش‌زنه در سر فتیله، که نیروی جاذبه است. پس آن اشتعال را از نور نبوت و وحی و هدایت جذب می‌کند و با آن به قلب صاحبش بازمی‌گردد، پس هدایت می‌یابد و روشن می‌شود، همان‌طور که این فتیله شعله‌ور شد. سپس از پیامبر جدا می‌شود و به سوی اهلش می‌رود در حالی که نور است. اگر خداوند به او عنایت کند و با توفیق خود او را مدد رساند، نور هدایت در قلبش به واسطه آن امداد (الإمداد) ثابت می‌ماند و پس از آن، رسول دیگر کاری با او ندارد، مگر تعیین احکام. مگر اینکه آن نور، یعنی نور ایمان، «ما كُنْتَ تَدْرِي ما الْكِتابُ ولا الْإِيمانُ ولكِنْ جَعَلْناهُ نُوراً نَهْدِي به من نَشاءُ من عِبادِنا» (تو نمی‌دانستی کتاب چیست و ایمان کدام است، ولی ما آن را نوری قرار دادیم که به وسیله آن هر کس از بندگانمان را بخواهیم هدایت می‌کنیم). پیامبر (علیه السلام) از جانب پروردگارش فرمود: «أَدْعُوا إِلَى الله» (به سوی خدا دعوت می‌کنم) و نگفت: مرا به سوی خودم دعوت کنید. و «إلی» حرفی است که برای غایت (هدف) وضع شده است.\n\nپس هنگامی که مؤمن اجابت کرد، بر روشی که این رسول برایش تشریع کرده، به سوی پروردگارش می‌رود. چون به خدا رسید، حق (الحق) با پذیرایی اکرام و هبه‌ها و بخشش‌ها و عطایا از او استقبال می‌کند. پس او نیز مانند آن رسول، با بصیرت (بصيرة) به سوی خدا دعوت می‌کند، و این همان قول اوست که فرمود: «أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي» (من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). پس خبر داد که هر کس از او پیروی کند، او نیز با بصیرت به سوی خدا دعوت می‌کند.\n\nاگر به مواضع خطاب الهی و تنبیهات و اشارات آن عارف باشی، حال تو را با رسولت (صَلَّى اللهُ عَليهِ وسَلَّم) و حال تو را با خودش شناسانده است. و تو را بر صورت پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) در نور و امداد (الإمداد) او قرار داده است و برایت روشن ساخته که صورت تو با او در این امر، همان صورت او با جبرئیل (علیه السلام) است که فتیله‌اش از چراغ جبرئیل شعله‌ور شد و نورانی گشت. و نور هیچ یک از چراغ‌ها از آن منتقل نشد، بلکه هر یک بر نور خود باقی است. و بنگر که رسولان پس از اخذ از جبرئیل (علیه السلام)، آیا استنادشان به جبرئیل بود یا به خدا؟ نه، به خدا سوگند، بلکه گفته شد: «رسول الله» (فرستاده خدا) و گفته نشد: «رسول جبرئیل». همچنین کسی که از نبوت چنین نوری را اخذ کند و با بصیرت به سوی خدا دعوت کند، آن دعوت و نوری که با آن دعوت می‌کند، نور امداد (الإمداد) است، نه نوری که از چراغ اقتباس کرده است. پس در این امر باید به خدا نسبت داده شود، نه به رسول. پس گفته می‌شود: «عبدالله» (بنده خدا) و او دعوت‌کننده به سوی خداست به امر خدا، با واسطه رسول خدا، به حکم اصل، نه به حکم آنچه خداوند بر قلب او از علوم الهی گشوده است، که همان گشودن چشم فهم او (فتح عين فهمه) نسبت به آنچه رسول (صَلَّى اللهُ عَليهِ وسَلَّم) از قرآن و اخبار آورده است، می‌باشد. نه اینکه این ولی شریعت جدیدی بیاورد، بلکه فهم جدیدی در کتاب عزیز می‌آورد که دیگری نمی‌دانست آن معنا در آن حرف تلاوت شده یا نقل شده وجود دارد. پس برای رسولان (صلوات الله علیهم السلام) علم است و برای ما فهم، که آن نیز علم است.\n\nای برادر من، اگر آنچه را در این باب آوردیم، محقق سازی، بر اسرار الهی (أسرار إلهية) واقف می‌شوی و مرتبه بندگان خدا را که در این جایگاه هستند، می‌دانی که به کجا می‌انجامد، با چه کسانی هستند، از چه کسی اخذ می‌کنند، با چه کسی مناجات می‌کنند، به چه کسی استناد می‌کنند و منزلتشان در سرای آخرت کجاست. و آیا در مرتبه سرای آخرت نیز شرکتی دارند، همان‌طور که در اینجا در نورانیت (النورية) و امداد الهی شریک بودند یا خیر؟ اما در دنیا، آنان پیامبر نیستند، زیرا راه خود را از انبیا گرفته‌اند. و امر تنها در امداد باقی می‌ماند که آیا اثر آن، ابقای نور اول است یا انوار جدیدی با تأنی از حق (الحق) برایشان تجدید می‌شود، همان‌طور که نور چراغ با اشتعال هوا از رطوبات روغن تجدید می‌شود؟ پس آن نور اول نیست و غیر آن نیز نیست، و آن نور نرفته و عین آن نیز باقی نمانده است. و بیننده، اتصال انوار را به صورت واحد در نورانیت (النورية) می‌بیند، جز اینکه می‌داند اگر امداد روغن نبود، خاموش می‌شد. این بهره هر بیننده‌ای از آن است از حیث نظر و صورت. و از حیث معنی، بر نظر می‌افزاید و معرفت به آنچه امداد به واسطه آن واقع می‌شود و اثر آن در آن مشهود چیست، حاصل می‌شود، پس علم دیگری به دست می‌آورد که قبلاً نداشته است. پس کسی که چنین چیزی را از دست داده است، شایسته است که نوحه و گریه او بر خودش طولانی شود. خداوند ما را از اهل آن و از کسانی قرار دهد که با بصیرت به سوی خدا دعوت کردند یا با بصیرت با خدا خلوت گزیدند. همانا او شایسته آن و توانا بر آن است. و این مقدار در این باب کافی است و فایده حاصل شد.\n\nپس آنچه را که این منزل از علوم در بر دارد، ذکر می‌کنیم. بدان که این منزل شامل علم حقایق اسمائی (علم الحقائق الأسمائية)، و علم رسالت از حیث جایگاهی که از آن فرستاده شده است، نه از حیث اینکه رسالت است، و علم تخویف (علم التخويف) است که آیا از خدا می‌ترسد یا از آنچه از او صادر می‌شود؟ و مشهود کسی که از خدا می‌ترسد چیست؟ و ترس تنها از چیزی است که به تو تعلق دارد و در تو حلول می‌کند، در حالی که حق تعالی (الحق تعالی) ذاتش از حلول در ذات‌ها منزه است. پس معنای «و أعوذ بک منک» (و به تو از خودت پناه می‌برم) چیست؟\n\nو علم طاعت بندگان که در چه چیزی از آنان اطاعت می‌شود؟ و آیا آنان در آن طاعت بهره‌ای از طریق استحقاق دارند یا خیر؟ زیرا خداوند می‌فرماید: «من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله» (هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است). این یک مقام است. و مقام دیگر: «وأَطِيعُوا الرَّسُولَ» (و از رسول اطاعت کنید). و مقام دیگر: «أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ» (از خدا اطاعت کنید و از رسول و صاحبان امر از خودتان اطاعت کنید). پس اینها مقاماتی هستند که طاعت آنها را اقتضا می‌کند و مطاع متفاوت است. و تحقیق این امر شگفت‌انگیز است و تفصیل آنچه طاعت در آن واقع می‌شود نیز چنین است. و آیا نسبت طاعت به صاحبان امر مانند نسبت آن به رسول است، مانند نسبت آن به خدا، یا متفاوت است؟\n\nو علم نتایج مخالفت‌ها و موافقت‌ها. و علم تفاوت بین دو اجل (مدت تعیین شده) و اینکه چرا اولی اجل بود و چرا دومی اجل بود؟ آیا برای یک عین واحد است یا برای دو امر مختلف؟ و علم احوال مردمانی که به سوی خدا دعوت می‌شوند، چه چیزی میان آنان و اجابت حائل می‌شود، با وجود علم به صدق دعوت‌کننده؟ و چه چیزی آنان را به اجابت فرا می‌خواند، در حالی که مجلس یکی است و دعوت‌کننده یکی و دعوت یکی است؟ و علم ثواب تعجیل شده حسی و معنوی. و علم اعتبار. و علم عالم علوی و عالم سفلی. و علم رازی که در معبودان غیر از خدا وجود دارد و چه تناسبی میان آنان و کسانی که آنان را پرستیده‌اند، جمع شده است؟ و چرا آنان به شقاوت ابدی دچار شدند و مغفرت شامل حالشان نشد و از آتش خارج نگردیدند؟ و علم غیرت الهی و غیرت هر غیور. و چرا بازمی‌گردد؟ «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}