{
  "id": 444,
  "title": {
    "ar": "الباب الرابع والأربعون وأربعمائة في معرفة منازلة من كتب له كتاب العهد الخالص لا يشقى",
    "en": "Chapter 444: Concerning the Gnosis of the Spiritual Stations of him for whom the Book of the Pure Covenant (كتاب العهد الخالص) was written, [and who] shall not suffer wretchedness.",
    "ur": "باب چار سو چوالیس: اس شخص کے مقام (منازلة) کی معرفت کے بیان میں جس کے لیے خالص عہد نامہ (كتاب العهد الخالص) لکھا گیا، اور وہ کبھی بدبخت نہیں ہوگا۔",
    "fa": "باب چهارصد و چهل و چهارم در معرفت منازل کسی که کتاب عهد خالص برای او نوشته شده است و شقاوت نمی‌بیند."
  },
  "content": {
    "ar": "## «الباب الرابع والأربعون وأربعمائة في معرفة منازلة من كتب له كتاب العهد الخالص لا يشقى»\n\n\n> ليس يمحو الله خيرا قد كتب *** هكذا دل دليلي فوجب‏\n\n\n> وكذا حكم تجليه فما *** يتجلى ثم من بعد احتجب‏\n\n\n> كل ما أعطاك علما لا ترى *** بعد هذا العلم جهلا ينقلب‏\n\n\n> ولهذا عملوا واجتهدوا *** فلهذا الرب ف اسْجُدْ واقْتَرِبْ‏\n\n\n> يحكم الجود به من نفسه *** ما له من ذاته حكم غصب‏\n> فيكون الكل في رحمته *** بامتنان ووجوب قد كتب‏\n\n\n> يطمع الشيطان في رحمته *** وكذا حكم عبيد يكتسب‏\n\n\n### [الإخلاص في الدين‏]\n\n\nقال الله تعالى أَلا لِلَّهِ الدِّينُ الْخالِصُ ألا إنه العهد الذي خلص لنفسه في وفاء العبد به ما استخلصه العبد من الشيطان ولا من الباعث عليه من خوف ولا رغبة ولا جنة ولا نار فإنه قد يكون الباعث للمكلف مثل هذه الأمور في الوفاء بعهد الله فيكون العبد من المخلصين ويكون الدين بهذا الحكم مستخلصا من حد من يعطي المشاركة فيه فيميل العبد به عن الشريك ولهذا قال فيه حُنَفاءَ لِلَّهِ أي مائلين به إلى جانب الحق الذي شرعه وأخذه على المكلفين من جانب الباطل إذ قد سماهم الحق مؤمنين في كتابه فقال في طائفة إنهم آمَنُوا بِالْباطِلِ وكَفَرُوا بِاللَّهِ فكساهم حلة الايمان فما الايمان خصوص بالسعداء ولا الكفر خصوص بالأشقياء فوقع الاشتراك وتميزه قرائن الأحوال فلم يبق يعرف الايمان من الكفر ولا الايمان من الايمان ولا الكفر من الكفر إلا بلابسه فالعهد الخالص هو الذي لما أخذ الله من بَنِي آدَمَ من ظُهُورِهِمْ ذُرِّيَّتَهُمْ وأَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ ثم ولد كل بنى آدم على الفطرة وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم كل مولود يولد على الفطرة\n\n\nوهو الميثاق الخالص لنفسه الذي ما ملكه أحد غصبا فاستخلص منه بل لم يزل خالصا لنفسه في نفس الأمر طاهرا مطهرا ولكن هنا نكتة لا يمكن إظهارها كما كان الحق منزها لنفسه ما هو منزه لتنزيه عباده ولهذا قال من قال من العارفين سبحاني فإذا ولد المولود ونشأ محفوظا قبل التكليف كسهل بن عبد الله وأبي يزيد البسطامي ومن اعتنى الله به من أمثالهما ممن كان من الناس قبلهما وبعدهما وفي زمانهما ممن لم يصل إلينا خبره كما وصل إلينا خبر هذين السيدين ولم يرزأه في عهده هذا بشي‏ء مما ذكرناه آنفا فبقي عهده على أصله خالصا وهو الدين الخالص لا المخلص فقام بالعبد من غير استخلاص فما هو من العباد الذين أمروا أن يعبدوا الله مخلصين إذ لا فعل لهم في الاستخلاص بل لم يعرفوا إلا هذا الدين الخالص من غير شوب خالطه حتى يستخلصوه منه فيكونون مخلصين هذا لم يذوقوا له طعما مثل ما ذاقه الغير ومن كان هذا حاله من الدين فهو صاحب العهد الخالص ف لا يَشْقى‏ فإنه لا يشقى إلا أهل المكابدة والمجاهدة في استخلاص الدين ممن أمرهم الله أن يستخلصوه منه وليس على الحقيقة إلا هوى أنفسهم وهؤلاء في المرتبة الثانية من السعادة والطبقة الأولى هم الذين يغبطهم الأنبياء والشهداء أصحاب المنابر يوم القيامة المجهولون في الدنيا فهم لا يشفعون ولا يستشفعون ولا يرون للشفاعة قدرا في جنب ما هم فيه من الحال الطاهر القدوس لا المقدس ومن هذا المقام قال أبو يزيد لو شفعني الله في جميع الخلائق يوم القيامة لم يكن ذلك عندي بعظيم لأنه ما شفعني إلا في لقمة طين يعني خلق آدم من طين ونحن منه كما قال من نَفْسٍ واحِدَةٍ خلقت تلك النفس من طين فانظر ما أعجب إشارة أبي يزيد وإياك أن يخطر لك في هذا الرجل احتقار منه للمقام المحمود الذي لمحمد صَلَّى اللهُ عَليهِ وسَلَّم يوم القيامة وأنه يفتح فيه أمر الشفاعة وهو مقام جليل‏\n\n\n### [المقام المحمود والشفاعة]\n\n\nواعلم أنه ما سمي مَقاماً مَحْمُوداً لمجرد الشفاعة بل لما فيه من عواقب الثناء الإلهي الذي يثني رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بها على ربه عز وجل مما لا يعلم بذلك الثناء الخاص اليوم فما حمد إلا من أجل الله لا من أجل الشفاعة ثم جاءت الشفاعة تبعا في هذا المقام فيقال له عند فراغه من الثناء سل تعطه واشفع تشفع فيشفع في الشافعين أن يشفعوا فيبيح الله الشفاعة للشافعين عند ذلك فيشفعون فلا يبقى ملك ولا رسول ولا مؤمن إلا ويشفع ممن هو من أهل الشفاعة وأهل العهد الخالص على منابرهم لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ على نفوسهم ولا على أحد لأنهم لم يكن لهم تبع في الدنيا وكل من كان له تبع في الدنيا فإنه وإن أمن على نفسه فإنه لا يأمن على من بقي وعلى تابعه لكونه لا يعلم هل قصر وفرط فيما أمره به أم لا فيحزنه الفزع الأكبر عليه تقول بعض النساء من العارفين لجماعة من رجال الله أ رأيتم لو لم يخلق جنة ولا نارا أ ليس هو بأهل أن يعبد تشير هذه المرأة إلى الدين الخالص وهو هذا المقام وهي رابعة العدوية ذلِكَ فَضْلُ الله يُؤْتِيهِ من يَشاءُ ويقول فيه أبو يزيد الأكبر لا صفة لي فلو استخلص عهده لكان مخلصا وإذا كان مخلصا كان ذا صفة فلم يصدق في قوله وهو عندنا صادق وهذه الطائفة هم الذين عمهم قوله تعالى رِجالٌ صَدَقُوا ما عاهَدُوا الله عَلَيْهِ وهذا العهد الخالص فأمسكه الله عليهم فَمِنْهُمْ من قَضى‏ نَحْبَهُ أي من وفى بعهده فإن النحب العهد ومِنْهُمْ من يَنْتَظِرُ\nلأن العبد ما دام في الحياة الدنيا لا يأمن التبديل ف إِنَّ الله يَفْعَلُ ما يُرِيدُ وما يدري العبد على الحقيقة مما كان عليه من الحال في حال عدمه إذ كان مشهودا لله لا لنفسه إلا ما مضى وما يقع فهو في علم الله فَلا يَأْمَنُ مَكْرَ الله لعلمه بالله وما بَدَّلُوا تَبْدِيلًا فلله رجال بهذه المثابة جعلنا الله منهم فما أعظم بشارتها من آية ولا بلغ إلينا تعيين أحد من أهل هذه الصفة إلا طلحة بن عبيد الله من العشرة\n\n\nصح فيه عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه قال هذا ممن قَضى‏ نَحْبَهُ‏\n\n\nوهو في الحياة الدنيا فآمن من التبديل وهذا عظيم ويدخل في هذا المقام وإن لم يبلغ فيه مبلغ من له العهد الخالص بالأصالة من عهد الله على القيام بدينه عند توبته فوفى بِما عاهَدَ عَلَيْهُ الله قال لي السيد سليمان الدنبلي إن له خمسين سنة ما خطر له خاطر سوء فمثل هذا يلحق بهؤلاء إذا مات عليه ومن أَوْفى‏ بِما عاهَدَ عَلَيْهُ الله وكل من جدد عهدا مع الله فهو من المخلصين ما هو ممن له الدين الخالص فصاحب الدين الخالص مهما تجدد له من الله حكم بشرع لم يكن يعرفه قبل ذلك وقد كلفه الحق به في كتابه أو على لسان رسوله فإن هذا العبد يتلقاه بالدين الخالص والعهد الأول ولا يضره جهله بالمسألة المعينة الخالصة هذا لا يقدح في صاحب هذا المقام كأبي بكر الصديق الذي ما رأى شيئا إلا رأى الله قبله بالدين الخالص والعهد الإلهي الذي كان عليه وفي شهوده ولهذا لما واجهه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بالإيمان برسالته بادر وما تلكأ ولا طلب دليلا على ذلك منه بل صدقه بذلك العهد الخالص فإنه رأى رسالته هناك كما رأى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم نبوته قبل وجود آدم كما\n\n\nروى عنه كنت نبيا وآدم بين الماء والطين‏\n\n\nأي لم يكن موجودا وإنما عرف بذلك لقوله وإِذْ أَخَذْنا من النَّبِيِّينَ مِيثاقَهُمْ وكان هذا الميثاق قبل وجود جسد آدم فلما وجد آدم وقبض الحق على ظهره واستخرج منه كأمثال الذر يعني بنيه أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ كما جاء في القرآن فشهدوا فهذا هو الميثاق الثاني والميثاق الأول هو ما أخذه على الأنبياء فلما ولدوا فَمِنْهُمْ من قَضى‏ نَحْبَهُ ومنهم من خذله الله فأشرك جعلنا الله ممن قضى نحبه ولم يبدل آمين بعزته والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Forty-Four: Concerning the Knowledge of the Stations of those for whom the Book of the Pure Covenant (العهد الخالص) has been written, who shall not suffer wretchedness (لا يشقى)\n\n> Allah does not erase a good deed that He has written,\n> Thus my proof has indicated, and it is necessary.\n> And likewise is the ruling of His Theophany (تجليه), for He does not\n> Manifest Himself and then subsequently veil Himself.\n> Everything He grants you of Knowledge (علما), you shall not see\n> Ignorance (جهلا) return after this Knowledge.\n> And for this they worked and strove,\n> So to this Lord, <<prostrate and draw near>> (اسْجُدْ واقْتَرِبْ).\n> Generosity (الجود) rules through Him from His Essence (نفسه),\n> He has no ruling of compulsion (غصب) from His Being (ذاته).\n> Thus, all shall be within His Mercy (رحمته),\n> Written by grace and necessity.\n> Satan covets His Mercy,\n> And likewise is the ruling for servants who strive.\n\n### [Sincerity/Purity in Religion (الإخلاص في الدين‏)]\n\nAllah the Exalted said: <<Indeed, to Allah belongs the Pure Religion (الدِّينُ الْخالِصُ)>> (Quran 39:3). Know that this is the Covenant (العهد) that was purified for His Essence (لنفسه) in the servant’s fulfillment of it—a covenant that the servant did not have to extract (استخلصه) from Satan, nor from any motive such as fear, desire, Paradise (جنة), or Hellfire (نار). For the motive of the responsible person (المكلف) may be such things in fulfilling the covenant of Allah, and thus the servant is among the Sincere Ones (المخلصين). In this case, the religion (الدين) is *extracted* (مستخلصا) from the limit of that which allows partnership, so the servant inclines away from the partner.\n\nThis is why He said concerning it: <<Hanifs (حُنَفاءَ) for Allah>> (Quran 22:31)—meaning, inclining with it toward the side of the Real (الحق) which He legislated and took upon the responsible ones, away from the side of falsehood (الباطل). For the Real has indeed named them believers (مؤمنين) in His Book, saying concerning one group that they <<believed in falsehood (الْباطِلِ) and disbelieved in Allah>> (Quran 4:51). Thus, He clothed them in the garment of faith (الايمان). Therefore, faith is not exclusive to the fortunate (السعداء), nor is disbelief exclusive to the wretched (الأشقياء).\n\nThus, partnership occurred, and its distinction lies in the contextual indicators (قرائن الأحوال). Consequently, faith cannot be distinguished from disbelief, nor faith from faith, nor disbelief from disbelief, except by the one who wears it.\n\nThe Pure Covenant (العهد الخالص) is that which Allah took when He brought forth from the loins of the Children of Adam (بَنِي آدَمَ) their descendants (ذُرِّيَّتَهُمْ) and made them testify concerning themselves (أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ) (Quran 7:172). Then every child of Adam is born upon the primordial nature (الفطرة), which is his saying, peace and blessings be upon him: \"Every newborn is born upon the primordial nature.\"\n\nThis is the Covenant (الميثاق) purified for His Essence (لنفسه), which no one possessed by compulsion (غصبا) and then extracted from it. Rather, it has always remained pure for His Essence in the reality of the matter (في نفس الأمر), clean and purified. However, there is a subtle point (نكتة) here that cannot be revealed, just as the Real is transcendent (منزها) for His own Essence, not transcendent due to the transcendence declared by His servants. This is why some Gnostics (العارفين) said, \"Glory be to me (سبحاني).\"\n\nWhen the newborn is born and grows up protected before the age of responsibility (التكليف), like Sahl ibn Abdullah and Abu Yazid al-Bistami, and others like them whom Allah cared for—those who came before them, after them, and during their time, whose stories have not reached us as the stories of these two masters have—and who were not afflicted in this covenant of theirs by anything of what we mentioned earlier, their covenant remains pure upon its origin. This is the Pure Religion (الدين الخالص), not the Extracted Religion (لا المخلص).\n\nIt subsists in the servant without extraction (استخلاص). Thus, he is not among the servants who were commanded to worship Allah as Sincere Ones (مخلصين), since they have no action in the process of extraction. Rather, they knew nothing but this Pure Religion without any admixture (شوب) that they needed to extract it from, so as to become Sincere Ones. They have not tasted the flavor of this extraction, unlike others who have tasted it. Whoever’s state in religion is this, he is the possessor of the Pure Covenant, and thus <<he shall not suffer wretchedness (لا يَشْقى)>>.\n\nFor only the people of struggle (المكابدة) and striving (المجاهدة) suffer wretchedness—those who strive to extract the religion from that which Allah commanded them to extract it from, which is, in reality, nothing but the desires of their own souls (هوى أنفسهم). These strivers are in the second rank of felicity (السعادة). The first rank are those whom the Prophets and Martyrs envy—the people of the pulpits (أصحاب المنابر) on the Day of Resurrection, who were unknown in the world (الدنيا).\n\nThey neither intercede (يشفعون) nor seek intercession (يستشفعون), nor do they see any value in intercession compared to the state of pure holiness (الحال الطاهر القدوس)—not the sanctified (لا المقدس)—in which they reside. From this station, Abu Yazid said: \"If Allah granted me intercession for all creatures on the Day of Resurrection, I would not consider that a great thing, because He would only be granting me intercession concerning a morsel of clay.\" He meant the creation of Adam from clay, and we are from him, as He said: <<from a single soul (نَفْسٍ واحِدَةٍ)>> (Quran 4:1), and that soul was created from clay.\n\nObserve how wondrous is the allusion of Abu Yazid. Beware lest it occur to you that this man is showing contempt for the Praised Station (المقام المحمود) belonging to Muhammad, peace and blessings be upon him, on the Day of Resurrection, where the matter of intercession is opened—for it is a glorious station.\n\n### [The Praised Station (المقام المحمود) and Intercession]\n\nKnow that it was not named the Praised Station merely because of intercession, but because of the consequences of the Divine Praise (الثناء الإلهي) with which the Messenger of Allah, peace and blessings be upon him, praises his Lord, the Mighty and Majestic—a specific praise that is unknown today. Thus, it is praised only for the sake of Allah, not for the sake of intercession. Then intercession comes as a consequence (تبعا) in this station. When he finishes the praise, it will be said to him: \"Ask, and you shall be given; intercede, and your intercession shall be accepted.\"\n\nHe intercedes for the intercessors (الشافعين) that they may intercede. At that point, Allah permits intercession for the intercessors, and they intercede. No angel, messenger, or believer who is among the people of intercession remains but intercedes.\n\nAnd the people of the Pure Covenant (العهد الخالص) upon their pulpits (منابرهم)—<<the greatest terror (الْفَزَعُ الْأَكْبَرُ) shall not grieve them>> (Quran 21:103), neither for themselves nor for anyone else, because they had no dependents (تبع) in the world (الدنيا). But everyone who had dependents in the world, even if he is safe concerning himself, he is not safe concerning those who remain and his dependents, because he does not know whether he fell short or neglected what he was commanded regarding them or not. Thus, the greatest terror grieves him concerning them.\n\nOne of the Gnostic women (العارفين) said to a group of the men of Allah: \"Tell me, if He had not created Paradise or Hellfire, would He not still be worthy of worship?\" This woman is pointing to the Pure Religion (الدين الخالص), which is this station. She is Rabi’a al-Adawiyya. <<That is the Grace of Allah, which He grants to whom He wills>> (Quran 5:54).\n\nConcerning this, Abu Yazid the Elder says: \"I have no attribute (صفة).\" If he had extracted his covenant, he would have been a Sincere One (مخلصا), and if he were a Sincere One, he would have possessed an attribute. Thus, he would not have been truthful in his saying, yet he is truthful in our view.\n\nThis group is encompassed by His saying, the Exalted: <<Men who were true to what they covenanted with Allah>> (Quran 33:23). This is the Pure Covenant. Allah preserved it for them. <<So among them is he who fulfilled his vow (قَضى‏ نَحْبَهُ)>> (Quran 33:23)—meaning, he who fulfilled his covenant, for the *nahb* (نحب) is the covenant—<<and among them is he who awaits>> (Quran 33:23).\n\nBecause as long as the servant is in the life of this world (الحياة الدنيا), he is not safe from change, for <<Indeed, Allah does what He wills>> (Quran 14:27). And the servant does not truly know the state he was in during his non-existence, when he was witnessed by Allah, not by himself, except for what has passed. What is yet to occur is in the Knowledge (علم) of Allah. Therefore, <<let no one feel secure from the plan of Allah (مَكْرَ الله)>> (Quran 7:99), due to his knowledge of Allah. Yet, <<they have not altered [their commitment] by any alteration (تَبْدِيلًا)>> (Quran 33:23).\n\nFor Allah has men of this rank; may Allah make us among them. How great is the glad tidings of this verse! No one possessing this attribute has been specifically identified to us except Talha ibn Ubaydullah, one of the Ten. It is authentically reported concerning him from the Messenger of Allah, peace and blessings be upon him, that he said: \"This man is among those who fulfilled his vow (قَضى‏ نَحْبَهُ).\" He was in the life of this world and was thus safe from change. This is a great matter.\n\nInto this station also enters, though not reaching the level of the one who possesses the Pure Covenant by origin, the one who makes a covenant with Allah to uphold His religion upon his repentance and fulfills <<what he covenanted with Allah>> (Quran 48:10). Al-Sayyid Sulayman al-Danbali told me that for fifty years, no evil thought (خاطر سوء) had crossed his mind. Such a person joins these people if he dies upon that state, and he is among those who <<fulfilled what he covenanted with Allah>> (Quran 48:10).\n\nEveryone who renews a covenant with Allah is among the Sincere Ones (المخلصين), but he is not among those who possess the Pure Religion (الدين الخالص). The possessor of the Pure Religion, whenever a ruling of the Law (شرع) is renewed for him by Allah—a ruling he did not know before, and with which the Real (الحق) has charged him in His Book or upon the tongue of His Messenger—this servant receives it with the Pure Religion and the First Covenant. His ignorance of that specific, pure matter does not detract from the possessor of this station.\n\n[This is] like Abu Bakr al-Siddiq, who saw nothing except that he saw Allah before it, by means of the Pure Religion and the Divine Covenant (العهد الإلهي) upon which he stood and in his witnessing (شهوده). This is why, when the Messenger of Allah, peace and blessings be upon him, confronted him with faith in his message, he hastened and did not hesitate or ask for proof of it from him. Rather, he affirmed him by means of that Pure Covenant, for he had seen his message there, just as it was narrated from him: \"I was a Prophet while Adam was between water and clay,\" meaning he was not yet existent.\n\nHe was only known by this due to His saying: <<And [mention] when We took from the Prophets their covenant (مِيثاقَهُمْ)>> (Quran 33:7). This covenant was before the existence of Adam’s body. When Adam came into existence, and the Real took hold of his back and extracted from it the likes of particles (الذر)—meaning his children—He <<made them testify concerning themselves (أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ)>> (Quran 7:172), as came in the Quran, and they testified. This is the Second Covenant. The First Covenant is what He took from the Prophets.\n\nWhen they were born, <<among them is he who fulfilled his vow (قَضى‏ نَحْبَهُ)>>, and among them is he whom Allah abandoned, so he associated partners with Him. May Allah make us among those who fulfilled their vow and did not change [their commitment], Amen, by His Might. And <<Allah speaks the Truth, and He guides to the way>> (Quran 33:4).",
    "ur": "باب نمبر چار سو چوالیس: اس شخص کے مرتبے کی معرفت میں جس کے لیے خالص عہد (العهد الخالص) کا صحیفہ لکھ دیا گیا، جو کبھی بدبخت نہیں ہوگا۔\n\nاللہ تعالیٰ اس نیکی کو نہیں مٹاتا جو اس نے لکھ دی ہو،\nمیرے دلیل نے یہی رہنمائی کی اور یہ واجب ہے۔\nاور اسی طرح اس کے ظہور الٰہی (التجلی) کا حکم ہے، پس وہ جب ظاہر ہوتا ہے تو اس کے بعد پردہ پوش نہیں ہوتا۔\nہر وہ علم جو اس نے تمہیں عطا کیا، تم اس علم کے بعد جہالت میں پلٹتے ہوئے نہیں دیکھو گے۔\nاور اسی لیے انہوں نے عمل کیا اور کوشش کی،\nپس اسی رب کے لیے سجدہ کرو اور قریب ہو جاؤ۔\nجود و کرم کا حکم اس کی اپنی ذات سے جاری ہوتا ہے،\nاس کی ذات کے لیے جبر کا کوئی حکم نہیں ہے۔\nپس سب اس کی رحمت میں ہوں گے،\nاحسان اور وجوب کے ساتھ جو لکھ دیا گیا ہے۔\nشیطان اس کی رحمت میں طمع کرتا ہے،\nاور یہی ان بندوں کا حکم ہے جو (نیکی) کماتے ہیں۔\n\n### [اخلاص دین میں]\n\nاللہ تعالیٰ نے فرمایا: \"خبردار! خالص دین (الدين الخالص) اللہ ہی کے لیے ہے (أَلا لِلَّهِ الدِّينُ الْخالِصُ)\"۔ خبردار! یہ وہ عہد ہے جو اس نے اپنے لیے خالص کر لیا ہے، اس میں بندے کا وفادار ہونا نہ تو شیطان سے خالص کیا گیا ہے اور نہ ہی کسی خوف، رغبت، جنت یا دوزخ کے محرک سے۔ کیونکہ مکلف (المكلف) کے لیے اللہ کے عہد کی تکمیل میں یہ چیزیں محرک ہو سکتی ہیں، تو بندہ مخلصین (المخلصين) میں سے ہو جاتا ہے، اور دین اس حکم کے ساتھ اس حد سے خالص ہو جاتا ہے جو اس میں شراکت دیتا ہے، پس بندہ اس کے ذریعے شریک سے ہٹ جاتا ہے۔ اور اسی لیے اس کے بارے میں فرمایا: \"اللہ کے لیے حنیف (حُنَفاءَ لِلَّهِ)\" یعنی باطل کی طرف سے ہٹ کر اس حق کی جانب مائل ہونے والے جسے اس نے مکلفین پر مشروع کیا اور لازم کیا۔ کیونکہ ذات حق (الحق) نے انہیں اپنی کتاب میں مومن کہا ہے، چنانچہ ایک گروہ کے بارے میں فرمایا کہ انہوں نے \"باطل پر ایمان لایا اور اللہ کا انکار کیا (آمَنُوا بِالْباطِلِ وكَفَرُوا بِاللَّهِ)\"۔ پس اس نے انہیں ایمان کا لباس پہنایا۔ لہٰذا ایمان صرف نیک بختوں کے لیے مخصوص نہیں ہے اور نہ ہی کفر صرف بدبختوں کے لیے مخصوص ہے۔ پس شراکت واقع ہوئی اور اس کا امتیاز احوال کے قرائن سے ہوتا ہے۔ چنانچہ ایمان کو کفر سے، اور ایمان کو ایمان سے، اور کفر کو کفر سے پہچانا نہیں جا سکتا مگر اس کے پہننے والے سے۔\n\nپس خالص عہد (العهد الخالص) وہ ہے جب اللہ تعالیٰ نے بنی آدم کی پشتوں سے ان کی ذریت کو نکالا اور \"انہیں ان کی جانوں پر گواہ بنایا (وَأَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ)\"، پھر ہر بنی آدم فطرت پر پیدا ہوا، اور یہی آپ صلی اللہ علیہ وسلم کا فرمان ہے: \"ہر بچہ فطرت پر پیدا ہوتا ہے۔\"\n\nاور یہ وہ میثاق ہے جو اس نے اپنے لیے خالص کر لیا، جسے کسی نے زبردستی حاصل نہیں کیا کہ اس سے خالص کیا جائے، بلکہ یہ نفسِ امر میں ہمیشہ سے اس کے لیے خالص، پاک اور پاکیزہ رہا ہے۔ لیکن یہاں ایک نکتہ ہے جسے ظاہر کرنا ممکن نہیں، جیسا کہ ذات حق (الحق) اپنی ذات کے لیے منزہ ہے، نہ کہ اپنے بندوں کے تنزیہ کی وجہ سے۔ اور اسی لیے بعض عارفین نے کہا: \"سبحانی (میں پاک ہوں)\"۔\n\nپس جب بچہ پیدا ہوتا ہے اور مکلف ہونے سے پہلے محفوظ نشوونما پاتا ہے، جیسے سہل بن عبداللہ اور ابو یزید بسطامی، اور ان جیسے دیگر جن پر اللہ نے توجہ فرمائی، جو ان سے پہلے، بعد میں یا ان کے زمانے میں تھے اور جن کی خبر ہم تک ان دو سرداروں کی خبر کی طرح نہیں پہنچی، اور اس کے اس عہد میں اسے ان چیزوں میں سے کسی سے نقصان نہیں پہنچا جن کا ہم نے ابھی ذکر کیا، تو اس کا عہد اپنی اصل پر خالص رہا۔ اور یہی خالص دین (الدين الخالص) ہے، نہ کہ مخلص (المخلص)۔ پس یہ بندے کے ساتھ بغیر کسی استخلاص (خالص کرنے کی کوشش) کے قائم ہوا، لہٰذا وہ ان بندوں میں سے نہیں ہیں جنہیں حکم دیا گیا کہ وہ اللہ کی عبادت مخلصین (المخلصين) بن کر کریں، کیونکہ ان کا استخلاص میں کوئی عمل نہیں ہے۔ بلکہ انہوں نے اس خالص دین (الدين الخالص) کے سوا کچھ نہیں جانا جس میں کوئی آمیزش شامل نہیں ہوئی کہ وہ اسے اس سے خالص کریں اور مخلصین بن جائیں۔ انہوں نے اس کا ذائقہ نہیں چکھا جیسا کہ دوسروں نے چکھا۔ اور جس کا دین میں یہ حال ہو، وہ خالص عہد (العهد الخالص) کا مالک ہے، پس وہ بدبخت نہیں ہوگا (لا يَشْقىٰ)۔ کیونکہ بدبخت صرف وہ لوگ ہوتے ہیں جو دین کو اس چیز سے خالص کرنے میں مشقت اور مجاہدہ کرتے ہیں جس سے اللہ نے انہیں خالص کرنے کا حکم دیا ہے، اور حقیقت میں وہ ان کے نفس کی خواہشات کے سوا کچھ نہیں ہے۔\n\nاور یہ لوگ سعادت کے دوسرے مرتبے پر ہیں، جبکہ پہلا طبقہ وہ ہے جن پر انبیاء اور شہداء قیامت کے دن رشک کریں گے، جو دنیا میں گمنام ہیں۔ پس وہ نہ شفاعت کرتے ہیں، نہ شفاعت طلب کرتے ہیں، اور نہ ہی وہ اس طاہر قدوس حال کے مقابلے میں شفاعت کو کوئی قدر دیتے ہیں جس میں وہ ہیں (نہ کہ مقدس حال کے مقابلے میں)۔ اور اسی مقام سے ابو یزید نے کہا: \"اگر اللہ قیامت کے دن تمام مخلوقات کے حق میں میری شفاعت قبول کر لے، تو یہ میرے نزدیک کوئی بڑی بات نہیں ہوگی، کیونکہ اس نے میری شفاعت صرف مٹی کے ایک لقمے کے حق میں کی ہے\" یعنی آدم کی تخلیق مٹی سے ہوئی اور ہم اسی سے ہیں، جیسا کہ فرمایا: \"ایک ہی جان سے (مِنْ نَفْسٍ واحِدَةٍ)\"، اور وہ جان مٹی سے پیدا کی گئی تھی۔ پس دیکھو ابو یزید کا اشارہ کتنا عجیب ہے، اور خبردار! تمہارے دل میں یہ خیال نہ آئے کہ یہ شخص محمد صلی اللہ علیہ وسلم کے مقام محمود (المقام المحمود) کی حقارت کر رہا ہے جو قیامت کے دن آپ کے لیے ہے اور جس میں شفاعت کا معاملہ کھولا جائے گا، حالانکہ وہ ایک عظیم مقام ہے۔\n\n### [مقام محمود اور شفاعت]\n\nاور جان لو کہ اسے مقام محمود (مَقاماً مَحْمُوداً) صرف شفاعت کی وجہ سے نہیں کہا گیا، بلکہ اس میں اس ثنائے الٰہی کے نتائج شامل ہیں جس کے ذریعے رسول اللہ صلی اللہ علیہ وسلم اپنے رب عزوجل کی تعریف کریں گے، اور اس خاص ثنا کا علم آج کسی کو نہیں ہے۔ پس تعریف صرف اللہ کی خاطر کی گئی، نہ کہ شفاعت کی خاطر۔ پھر شفاعت اس مقام میں بطور تابع آئی، چنانچہ جب آپ ثنا سے فارغ ہوں گے تو آپ سے کہا جائے گا: \"مانگو، تمہیں دیا جائے گا، اور شفاعت کرو، تمہاری شفاعت قبول کی جائے گی۔\" پس آپ شفاعت کرنے والوں کے حق میں شفاعت کریں گے کہ وہ شفاعت کریں، تب اللہ تعالیٰ شفاعت کرنے والوں کے لیے شفاعت کی اجازت دے گا، اور وہ شفاعت کریں گے۔ پس کوئی فرشتہ، کوئی رسول، اور کوئی مومن باقی نہیں رہے گا مگر وہ شفاعت کرے گا جو اہل شفاعت میں سے ہے۔\n\nاور خالص عہد (العهد الخالص) والے اپنے منبروں پر ہوں گے، انہیں سب سے بڑی گھبراہٹ (الْفَزَعُ الْأَكْبَرُ) نہ اپنی جانوں پر غمگین کرے گی اور نہ کسی اور پر، کیونکہ دنیا میں ان کا کوئی تابع نہیں تھا۔ اور جس کا دنیا میں کوئی تابع تھا، وہ اگرچہ اپنی جان کے لیے محفوظ ہو جائے، لیکن وہ باقی ماندہ اور اپنے تابع کے لیے محفوظ نہیں ہوگا، کیونکہ وہ نہیں جانتا کہ آیا اس نے اس چیز میں کوتاہی یا زیادتی کی جس کا اسے حکم دیا گیا تھا یا نہیں، پس سب سے بڑی گھبراہٹ اسے اس پر غمگین کرے گی۔ بعض عارف خواتین نے اللہ کے کچھ بندوں سے کہا: \"کیا تم نے دیکھا، اگر وہ جنت اور دوزخ کو پیدا نہ کرتا، تو کیا وہ اس لائق نہ تھا کہ اس کی عبادت کی جائے؟\" یہ خاتون خالص دین (الدين الخالص) کی طرف اشارہ کر رہی ہیں، اور یہی یہ مقام ہے، اور یہ رابعہ عدویہ ہیں۔ \"یہ اللہ کا فضل ہے، وہ جسے چاہتا ہے عطا کرتا ہے (ذلِكَ فَضْلُ الله يُؤْتِيهِ من يَشاءُ)\"۔ اور اس کے بارے میں ابو یزید اکبر کہتے ہیں: \"میری کوئی صفت نہیں ہے۔\" اگر وہ اپنے عہد کو خالص کرتا تو وہ مخلص (مخلصاً) ہوتا، اور جب وہ مخلص ہوتا تو وہ صفت والا ہوتا، لہٰذا اس کا قول سچا نہ ہوتا، حالانکہ وہ ہمارے نزدیک سچا ہے۔\n\nاور یہ گروہ وہ ہے جسے اللہ تعالیٰ کے اس فرمان نے شامل کیا: \"وہ مرد جنہوں نے اللہ سے کیے گئے عہد کو سچ کر دکھایا (رِجالٌ صَدَقُوا ما عاهَدُوا الله عَلَيْهِ)\"۔ اور یہی خالص عہد (العهد الخالص) ہے جسے اللہ نے ان کے لیے تھام لیا۔ \"پس ان میں سے بعض نے اپنی نذر پوری کر دی (فَمِنْهُمْ من قَضى‏ نَحْبَهُ)\" یعنی جس نے اپنا عہد پورا کیا، کیونکہ نذر (النحب) سے مراد عہد ہے۔ \"اور ان میں سے بعض انتظار کر رہے ہیں (وَمِنْهُمْ من يَنْتَظِرُ)\"۔ کیونکہ جب تک بندہ دنیاوی زندگی میں ہے، وہ تبدیلی سے محفوظ نہیں ہے، پس \"بے شک اللہ جو چاہتا ہے کرتا ہے (إِنَّ الله يَفْعَلُ ما يُرِيدُ)\"۔ اور بندہ حقیقت میں اس حال کے بارے میں کچھ نہیں جانتا جس پر وہ اپنی عدم موجودگی کی حالت میں تھا، کیونکہ وہ اللہ کے لیے مشہود تھا نہ کہ اپنی ذات کے لیے۔ سوائے اس کے جو گزر چکا اور جو واقع ہوگا، وہ اللہ کے علم میں ہے۔ پس وہ اللہ کی تدبیر (مَكْرُ الله) سے بے خوف نہیں ہوتا، کیونکہ وہ اللہ کو جانتا ہے، اور \"انہوں نے ذرا بھی تبدیلی نہیں کی (وَما بَدَّلُوا تَبْدِيلًا)\"۔\n\nپس اللہ کے لیے ایسے مرد ہیں، اللہ ہمیں ان میں شامل کرے۔ یہ آیت کتنی عظیم بشارت والی ہے! اور ہمیں اس صفت کے حاملین میں سے کسی ایک کا بھی تعین نہیں پہنچا سوائے عشرہ مبشرہ میں سے طلحہ بن عبیداللہ کے۔ ان کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے صحیح روایت ہے کہ آپ نے فرمایا: \"یہ ان میں سے ہیں جنہوں نے اپنی نذر پوری کر دی (قَضى‏ نَحْبَهُ)\"۔ اور وہ دنیاوی زندگی میں تھے، پس وہ تبدیلی سے محفوظ ہو گئے، اور یہ ایک عظیم بات ہے۔\n\nاور اس مقام میں وہ شخص بھی داخل ہوتا ہے، اگرچہ وہ اس شخص کے مرتبے کو نہ پہنچے جسے اصالتاً خالص عہد (العهد الخالص) حاصل ہے، جو اللہ کے ساتھ اپنے دین پر قائم رہنے کا عہد کرتا ہے جب وہ توبہ کرتا ہے، اور \"اس نے اس عہد کو پورا کیا جو اس نے اللہ سے کیا تھا (بِما عاهَدَ عَلَيْهُ الله)\"۔ سید سلیمان الدنبلی نے مجھ سے کہا کہ پچاس سال سے ان کے دل میں کوئی برا خیال نہیں آیا۔ پس ایسا شخص اگر اسی حال پر مرے تو وہ ان لوگوں سے ملحق ہو جائے گا، اور \"جس نے اللہ سے کیے گئے عہد کو پورا کیا (أَوْفىٰ بِما عاهَدَ عَلَيْهُ الله)\"۔\n\nاور ہر وہ شخص جو اللہ کے ساتھ عہد کی تجدید کرتا ہے، وہ مخلصین (المخلصين) میں سے ہے، وہ ان میں سے نہیں ہے جسے خالص دین (الدين الخالص) حاصل ہے۔ پس خالص دین کا مالک جب بھی اللہ کی طرف سے کسی ایسے شرعی حکم سے دوچار ہوتا ہے جسے وہ پہلے نہیں جانتا تھا اور ذات حق (الحق) نے اسے اپنی کتاب میں یا اپنے رسول کی زبان پر اس کا مکلف بنایا ہے، تو یہ بندہ اسے خالص دین (الدين الخالص) اور پہلے عہد کے ساتھ قبول کرتا ہے، اور اس مخصوص خالص مسئلے سے اس کی لاعلمی اسے نقصان نہیں پہنچاتی۔ یہ بات اس مقام کے مالک کے لیے عیب نہیں ہے۔ جیسے ابو بکر صدیق، جنہوں نے کوئی چیز نہیں دیکھی مگر اس سے پہلے اللہ کو خالص دین (الدين الخالص) اور الٰہی عہد کے ساتھ دیکھا جس پر وہ تھے اور جو ان کے شہود (الشہود) میں تھا۔ اور اسی لیے جب رسول اللہ صلی اللہ علیہ وسلم نے انہیں اپنی رسالت پر ایمان لانے کے لیے کہا تو انہوں نے فوراً پہل کی اور نہ ہچکچائے اور نہ ہی اس پر کوئی دلیل طلب کی، بلکہ اس خالص عہد (العهد الخالص) کی وجہ سے آپ کی تصدیق کی، کیونکہ انہوں نے آپ کی رسالت کو وہاں دیکھا تھا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے آدم کی تخلیق سے پہلے اپنی نبوت کو دیکھا تھا۔ جیسا کہ آپ سے روایت ہے: \"میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے (یعنی ابھی موجود نہیں تھے)\"۔ یعنی وہ موجود نہیں تھے، اور یہ بات اس فرمان سے معلوم ہوئی: \"اور جب ہم نے نبیوں سے ان کا عہد لیا (وَإِذْ أَخَذْنا من النَّبِيِّينَ مِيثاقَهُمْ)\"۔ اور یہ میثاق آدم کے جسم کی تخلیق سے پہلے تھا۔ پھر جب آدم موجود ہوئے اور ذات حق (الحق) نے ان کی پشت پر ہاتھ پھیرا اور ان سے ذرات کی مانند ان کی اولاد کو نکالا، تو \"انہیں ان کی جانوں پر گواہ بنایا (أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ)\" جیسا کہ قرآن میں آیا ہے، تو انہوں نے گواہی دی۔ پس یہ دوسرا میثاق ہے، اور پہلا میثاق وہ ہے جو اس نے انبیاء سے لیا تھا۔ پس جب وہ پیدا ہوئے، \"تو ان میں سے بعض نے اپنی نذر پوری کر دی (فَمِنْهُمْ من قَضى‏ نَحْبَهُ)\" اور ان میں سے بعض کو اللہ نے چھوڑ دیا تو انہوں نے شرک کیا۔ اللہ ہمیں ان لوگوں میں شامل کرے جنہوں نے اپنی نذر پوری کی اور تبدیلی نہیں کی، آمین، اپنی عزت کے ساتھ۔ اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)\"۔",
    "fa": "باب چهارصد و چهل و چهارم در معرفت مقام کسی که کتاب عهد خالص (العهد الخالص) برای او نوشته شده و شقاوت نمی‌بیند\n\nخداوند خیری را که نوشته است، محو نمی‌کند؛\nاین‌گونه دلیل من راهنمایی کرد و واجب شد.\n\nو همچنین حکم تجلی (التجلی) او چنین است؛\nکه تجلی (التجلی) نمی‌کند و سپس پنهان شود.\n\nهر آنچه به تو علم (معرفت) عطا کند،\nپس از آن علم، جهلی را نمی‌بینی که بازگردد.\n\nو به همین دلیل عمل کردند و کوشیدند،\nپس برای این پروردگار سجده کن و نزدیک شو (اسْجُدْ واقْتَرِبْ).\n\nجود (بخشندگی) از جانب ذات خود بر او حکم می‌راند،\nو از ذات او حکم غصب (زور) نیست.\n\nپس همه در رحمت او خواهند بود،\nبا منت و وجوبی که نوشته شده است.\n\nشیطان در رحمت او طمع می‌ورزد،\nو همچنین حکم بندگانی که کسب می‌کنند.\n\n### [اخلاص در دین]\n\nخداوند متعال می‌فرماید: آگاه باشید که دین خالص (الدِّينُ الْخالِصُ) از آن خداست (أَلا لِلَّهِ الدِّينُ الْخالِصُ). آگاه باشید که این همان عهد (پیمان) است که برای ذات او خالص شده است، در حالی که وفای بنده به آن، نه به دلیل استخلاص (خالص‌سازی) بنده از شیطان است، و نه به دلیل انگیزه‌ای از ترس، یا رغبت، یا بهشت، یا دوزخ. زیرا ممکن است انگیزه مکلف در وفای به عهد الهی، چنین اموری باشد؛ در این صورت بنده از مخلصین (خالص‌کنندگان) خواهد بود و دین به این حکم، از حد کسی که در آن مشارکت می‌دهد، خالص شده است، و بنده به واسطه آن از شریک روی می‌گرداند. و به همین دلیل در مورد آن فرمود: یکتاپرستان برای خدا (حُنَفاءَ لِلَّهِ)، یعنی متمایل‌شوندگان به سوی جانب حق (الحق) که آن را تشریع کرده و از مکلفین گرفته است، و از جانب باطل روی گردانده‌اند. زیرا حق (الحق) در کتاب خود آنان را مؤمن نامیده است و در مورد گروهی فرمود: آنان به باطل ایمان آوردند (آمَنُوا بِالْباطِلِ) و به خدا کفر ورزیدند (وَكَفَرُوا بِاللَّهِ). پس لباس ایمان را بر آنان پوشاند. بنابراین، ایمان مخصوص سعادتمندان نیست و کفر نیز مخصوص شقاوتمندان نیست. پس اشتراک رخ داد و تمایز آن به قراین احوال بستگی دارد. پس ایمان از کفر، و ایمان از ایمان، و کفر از کفر، شناخته نمی‌شود مگر به پوشنده آن (کسی که آن را بر تن دارد).\n\nپس عهد خالص (العهد الخالص) همان است که خداوند از پشت فرزندان آدم، ذریه آنان را گرفت (مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ) و آنان را بر خودشان گواه گرفت (وَأَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ). سپس هر فرزند آدم بر فطرت متولد شد، و این همان فرموده پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است که: «هر مولودی بر فطرت متولد می‌شود.»\n\nو آن همان میثاق خالصی است که برای ذات اوست و کسی آن را به زور مالک نشده تا از آن خالص‌سازی کند، بلکه پیوسته در نفس‌الامر (واقعیت امر) برای ذات او خالص، پاک و پاکیزه بوده است. اما در اینجا نکته‌ای است که آشکار کردن آن ممکن نیست، همان‌گونه که حق (الحق) ذات خود را منزه کرده است، نه به دلیل تنزیه بندگانش. و به همین دلیل است که برخی از عارفان (العارفین) گفتند: «سبحانی» (منزه باد من).\n\nپس هنگامی که مولود متولد شود و پیش از تکلیف، محفوظ رشد کند، مانند سهل بن عبدالله و ابویزید بسطامی و کسانی از امثال ایشان که خداوند به آنان عنایت کرده است، از کسانی که پیش از آن دو و پس از آن دو و در زمان آن دو بوده‌اند و خبرشان به ما نرسیده است، آن‌گونه که خبر این دو سید به ما رسیده است؛ و در این عهدش به چیزی از آنچه پیش‌تر ذکر کردیم، آسیب ندیده باشد، عهدش بر اصل خود خالص باقی می‌ماند و آن دین خالص (الدین الخالص) است، نه دین مخلص (خالص‌شده). پس این دین بدون استخلاص (خالص‌سازی) در بنده پدید آمده است. بنابراین، او از آن بندگانی نیست که امر شده‌اند تا خدا را مخلصانه عبادت کنند، زیرا آنان فعلی در خالص‌سازی ندارند، بلکه جز این دین خالص را نشناخته‌اند، بدون هیچ آمیزه‌ای که با آن مخلوط شده باشد تا بخواهند آن را خالص کنند و مخلص شوند. اینان طعم آن را نچشیده‌اند، مانند آنچه دیگران چشیده‌اند.\n\nو هر کس حالش در دین چنین باشد، او صاحب عهد خالص (العهد الخالص) است و شقاوت نمی‌بیند (فَلا يَشْقىٰ). زیرا شقاوت نمی‌بینند مگر اهل مکابده (سختی کشیدن) و مجاهده (جهاد) در خالص‌سازی دین از کسی که خداوند به آنان امر کرده است که از او خالص کنند، و در حقیقت آن کس چیزی جز هوای نفسشان نیست. و اینان در مرتبه دوم سعادت هستند، و طبقه اول کسانی هستند که پیامبران و شهدا به حالشان غبطه می‌خورند؛ صاحبان منبرهایی در روز قیامت که در دنیا ناشناخته‌اند. پس آنان نه شفاعت می‌کنند، نه شفاعت می‌طلبند، و نه برای شفاعت در کنار حالی که در آن هستند، یعنی حال طاهر قدوس (پاک و مقدس)، ارزشی قائل‌اند.\n\nو از این مقام است که ابویزید گفت: «اگر خداوند مرا در مورد تمام خلایق در روز قیامت شفیع قرار دهد، این نزد من امر بزرگی نیست، زیرا مرا شفیع قرار نداده مگر در مورد لقمه‌ای از گِل»؛ یعنی خلقت آدم از گِل، و ما از او هستیم، چنانکه فرمود: از یک نفس (نَفْسٍ واحِدَةٍ) که آن نفس از گِل خلق شده است. پس بنگر که اشاره ابویزید چقدر شگفت‌انگیز است. و مبادا که در مورد این مرد، به ذهنت خطور کند که او مقام محمود (المقام المحمود) را که برای محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در روز قیامت است و امر شفاعت در آن گشوده می‌شود، کوچک شمرده است، در حالی که آن مقامی بزرگ است.\n\n### [مقام محمود و شفاعت]\n\nو بدان که مقام محمود (المقام المحمود) صرفاً به دلیل شفاعت نامیده نشده است، بلکه به دلیل پیامدهای ثنای الهی است که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با آن، پروردگار عزوجل خود را می‌ستاید، ثنایی خاص که امروز کسی از آن آگاه نیست. پس ستایش نشد مگر به خاطر خدا، نه به خاطر شفاعت. سپس شفاعت به تبع در این مقام آمد، و پس از پایان ثنا به او گفته می‌شود: «بخواه تا به تو عطا شود، و شفاعت کن تا شفاعتت پذیرفته شود.»\n\nپس او در مورد شفاعت‌کنندگان شفاعت می‌کند تا آنان شفاعت کنند. در آن هنگام خداوند شفاعت را برای شفاعت‌کنندگان مباح می‌سازد و آنان شفاعت می‌کنند. پس هیچ فرشته، رسول و مؤمنی باقی نمی‌ماند مگر اینکه شفاعت می‌کند، از کسانی که اهل شفاعت هستند. و اهل عهد خالص (العهد الخالص) بر منبرهای خود هستند، و فزع اکبر (ترس بزرگ‌تر) آنان را اندوهگین نمی‌سازد (لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ)، نه بر خودشان و نه بر هیچ کس دیگر، زیرا آنان در دنیا هیچ وابسته‌ای (تبع) نداشتند. و هر کس در دنیا وابسته‌ای داشته باشد، اگرچه خود در امان باشد، اما بر کسی که باقی مانده و بر وابسته خود ایمن نیست، زیرا نمی‌داند که آیا در آنچه به او امر شده بود کوتاهی و تفریط کرده است یا خیر. پس فزع اکبر او را اندوهگین می‌سازد.\n\nبرخی از زنان عارف (العارفین) به گروهی از مردان خدا می‌گویند: «آیا اگر بهشت و دوزخی خلق نمی‌شد، او سزاوار عبادت نبود؟» این زن به دین خالص (الدین الخالص) اشاره می‌کند که همین مقام است، و او رابعه عدویه است. این فضل خداست که به هر کس بخواهد می‌دهد (ذلِكَ فَضْلُ الله يُؤْتِيهِ من يَشاءُ). و ابویزید اکبر در مورد آن می‌گوید: «من صفتی ندارم.» پس اگر عهد خود را خالص می‌کرد، مخلص می‌شد، و اگر مخلص می‌شد، صاحب صفت می‌بود. پس در سخن خود صادق نبود، در حالی که نزد ما صادق است.\n\nو این گروه کسانی هستند که فرموده خداوند متعال شامل حالشان می‌شود: مردانی که بر سر عهدی که با خدا بستند، صادق ماندند (رِجالٌ صَدَقُوا ما عاهَدُوا الله عَلَيْهِ). و این همان عهد خالص (العهد الخالص) است که خداوند آن را برایشان حفظ کرد. پس برخی از آنان پیمان خود را به سر بردند (فَمِنْهُمْ من قَضى‏ نَحْبَهُ)، یعنی به عهد خود وفا کردند، زیرا «نحب» به معنای عهد است، و برخی از آنان در انتظارند (وَمِنْهُمْ مَن يَنْتَظِرُ). زیرا بنده تا زمانی که در زندگی دنیاست، از تبدیل شدن (تغییر حال) ایمن نیست، پس همانا خداوند هر چه بخواهد انجام می‌دهد (إِنَّ الله يَفْعَلُ ما يُرِيدُ). و بنده در حقیقت از حالی که در زمان عدمش بر آن بوده است، آگاه نیست، زیرا در آن حال، مشهود خدا بوده است نه مشهود خودش. مگر آنچه گذشته و آنچه رخ می‌دهد که در علم خداست. پس از مکر خدا ایمن نیست (فَلا يَأْمَنُ مَكْرَ الله)، به دلیل معرفتش به خدا. و آنان هیچ تغییری ندادند (وَما بَدَّلُوا تَبْدِيلًا). پس خداوند مردانی با این مرتبه دارد، خداوند ما را از آنان قرار دهد. چه بشارت بزرگی است این آیه! و تعیین هیچ یک از اهل این صفت به ما نرسیده است، مگر طلحة بن عبیدالله از عشره مبشره.\n\nدر مورد او از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) صحیح است که فرمود: «این از کسانی است که پیمان خود را به سر برد (قَضى‏ نَحْبَهُ)» در حالی که در زندگی دنیا بود. پس از تبدیل شدن ایمن شد، و این امر بزرگی است.\n\nو در این مقام وارد می‌شود، اگرچه به مرتبه کسی که عهد خالص (العهد الخالص) را به صورت اصیل دارد، نرسد؛ کسی که در هنگام توبه، بر اساس عهد الهی مبنی بر قیام به دینش، به آنچه با خدا عهد بسته بود وفا کرد (وَأَوْفَى بِمَا عَاهَدَ عَلَيْهُ اللَّهَ). سید سلیمان دنبلی به من گفت که پنجاه سال است هیچ خاطر سوئی به ذهنش خطور نکرده است. پس چنین کسی اگر بر این حال بمیرد، به این گروه ملحق می‌شود. و هر کس به آنچه با خدا عهد بسته وفا کند (وَمَنْ أَوْفَى بِمَا عَاهَدَ عَلَيْهُ اللَّهَ). و هر کس عهدی را با خدا تجدید کند، او از مخلصین (خالص‌کنندگان) است، نه از کسانی که دین خالص (الدین الخالص) دارند.\n\nپس صاحب دین خالص (الدین الخالص)، هرگاه حکمی شرعی از جانب خدا برایش تجدید شود که پیش از آن نمی‌دانسته و حق (الحق) او را در کتابش یا بر زبان رسولش به آن مکلف کرده است، این بنده آن را با دین خالص (الدین الخالص) و عهد اول دریافت می‌کند. و جهل او به آن مسئله معین خالص، به او ضرری نمی‌رساند. این امر در مقام صاحب این مرتبه، مانند ابوبکر صدیق، که هیچ چیزی را ندید مگر اینکه خدا را پیش از آن دید، با دین خالص (الدین الخالص) و عهد الهی که بر آن بود و در شهود (الشهود) او بود، قدحی وارد نمی‌کند. و به همین دلیل، هنگامی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) او را با ایمان به رسالتش مواجه ساخت، او شتاب کرد و درنگ نکرد و دلیلی بر آن از او نخواست، بلکه او را به واسطه آن عهد خالص (العهد الخالص) تصدیق کرد. زیرا او رسالت پیامبر را در آنجا دیده بود، همان‌گونه که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نبوت خود را پیش از وجود آدم دید، چنانکه از او روایت شده است: «من پیامبر بودم در حالی که آدم میان آب و گِل بود»، یعنی هنوز موجود نشده بود.\n\nو این امر تنها به دلیل فرموده خداوند شناخته شد: و هنگامی که از پیامبران پیمان گرفتیم (وَإِذْ أَخَذْنَا مِنَ النَّبِيِّينَ مِيثَاقَهُمْ). و این میثاق پیش از وجود جسم آدم بود. پس هنگامی که آدم به وجود آمد و حق (الحق) بر پشت او دست کشید و از آن مانند ذرات (مورچگان کوچک) بیرون آورد، یعنی فرزندانش را، آنان را بر خودشان گواه گرفت (أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ)، چنانکه در قرآن آمده است، و آنان شهادت دادند. پس این میثاق دوم است، و میثاق اول همان است که از پیامبران گرفت. پس هنگامی که متولد شدند، برخی از آنان پیمان خود را به سر بردند (فَمِنْهُمْ مَن قَضَى نَحْبَهُ) و برخی را خداوند خوار ساخت و شرک ورزیدند. خداوند ما را از کسانی قرار دهد که پیمان خود را به سر بردند و تبدیل نکردند. آمین به عزت او. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}