{
  "id": 329,
  "title": {
    "ar": "الباب التاسع والعشرون وثلاثمائة في معرفة منزل علم الآلاء والفراغ إلى البلاء وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Twenty-Nine: Concerning the Gnosis (معرفة) of the Station (منزل) of the Knowledge (علم) of Bounties (الآلاء) and Devotion (الفراغ) to Trial (البلاء), and it is from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو انتیس: نعمتوں (الآلاء) کے علم کے منزل کی معرفت اور آزمائش (البلاء) کی طرف یکسوئی کے بیان میں، اور یہ (منزل) الحضرة المحمدیۃ سے ہے۔",
    "fa": "باب سیصد و بیست و نهم در شناخت مقام علم نعمت‌ها (علم الآلاء) و فراغت به سوی بلا (البلاء)، و آن از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب التاسع والعشرون وثلاثمائة في معرفة منزل علم الآلاء والفراغ إلى البلاء وهو من الحضرة المحمدية»\n\n\n> إن العوالم بالرحمن أوجدها *** رب العباد وللرحمن قد وجدت‏\n\n\n> وبالذي قلته الآيات قد نطقت *** في محكم الذكر والإرسال قد شهدت‏\n\n\n> لو لا التألم لم ينكره من أحد *** ولا ورب العلا نعماه ما جحدت‏\n\n\n### [العالم مخلوق بالإنسان على صورته‏]\n\n\nقال النبي صَلَّى اللهُ عَليهِ وسَلَّم إن الله خلق آدم على صورته‏\n\n\nوالعالم مخلوق بالإنسان على صورته فلو فقد منه الإنسان ما كان العالم على الصورة ولو فقد العالم وبقي الإنسان كان على الصورة وقال تعالى كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ وهو عزلها عن تدبير هذا الهيكل الطبيعي الذي كانت تدبره في الدنيا في حال إقامتها فيها وأما قوله تعالى كُلُّ من عَلَيْها فانٍ ويَبْقى‏ وَجْهُ رَبِّكَ ذُو الْجَلالِ والْإِكْرامِ فلم يقل كل من فيها فان لأنه إذا كان فيها انحفظ بها وإذا كان عليها تجرد عنها فهذا يدلك على إن التجلي الإلهي يعم جميع من عليها لأن الفناء لا يكون إلا عن تجل إلهي في غير صورة كونية لأن التجلي في صور المثل إذا عرف أنه عين الصورة اتصف المتجلي له بالخشوع لا بالفناء\n\n\nسئل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عن الكسوف فقال صَلَّى اللهُ عَليهِ وسَلَّم ما تجلى الله لشي‏ء إلا خشع له‏\n\n\nفلهذا قلنا بالخشوع لا بالفناء للمناسبة التي بين الحس والخيال ولهذا يسمى الخيال بالحس المشترك وإذا لم يعرف لم يورث خشوعا يعرف به أنه هو ولكن لا بد أن يورث خشوعا في المتجلي له ولكن لا يعرف المتجلي له أنه هو ولا سيما أهل الأفكار وهذا من علم الظهور والخفاء فظهر بلا شك أنه هو وخفي بالتقييد في ظهوره فلم يعلم أنه هو فإذا كان العارف الكامل المعرفة بالله في هذا النوع الإنساني يعلم أن عين الحق هو المنعوت بالوجود وأن أحكام أعيان العالم هي الظاهرة في هذا العين أو هو الظاهر بها عرف ما رأى فإن اقتضى الموطن الإقرار أقر به عند ما يدعي أنه هو وإن اقتضى الموطن الإنكار سكت العارف فلم ينطق بإنكار ولا إقرار لعلمه بما أراده الحق في ذلك الموطن ولما كان التجلي الإلهي يغني من هو على الصورة عرفنا إن العين لا تذهب بل هو تجريد وخلع لا عزل عن تدبير ملك إلا إذا كان الضمير في عليها يعود على الأرض فهو عزل عن تدبير إلهيا كل التي جعل الله إليها تدبيرها وهذا الظهور والخفاء للاسم الرب لا لغيره وإليه يرجع حكمه وهو ينقسم إلى ثلاثة أقسام فيظهر في هذا الحكم أعني الظهور والخفاء في موطنين ليتخذه صاحب الملك وكيلا فيما هو له مالك فيكون له التصريف فيه والعبد مستريح في جميع أحواله من يقظة ونوم والقسم الآخر من هذا الحكم أن يكون له في أربعة مواطن في طول العالم وعرضه لوجود الإنعام عليه كما قال وأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظاهِرَةً وباطِنَةً فله هذان الحكمان‏\nفي طول العالم ومثله في عرضه وطول العالم عالم الأرواح وعرضه عالم صور الأجسام وإنما قلنا صور الأجسام ولم نقل الأجسام بسبب الأجسام المتخيلة وإن كانت أجساما حقيقية في حضرتها فليست أجساما عند كل أحد لما يسرع إليها من التغيير ولأنها راجعة إلى عين الناظر لا إليها والأجسام الحقيقة هي أجسام لا نفسها لا لعين الناظر فسواء كان الناظر موجودا أو غير موجود هي أجسام في نفسها والأخر أجسام لا في أنفسها كما قال يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏ وهي أجسام في عينها لا حكم لها في السعي فظهرت في عين موسى بصورة الجسم الذي له سعى والأمر في نفسه ليس كذلك والقسم الثالث من هذا الحكم من الظهور والخفاء يظهر في سبعمائة موطن وعشرين موطنا وهو منتهى ما يقبل عالم الدنيا من الاقتدار الإلهي لا إن الاقتدار يقصر أو يعجز فهذا حكم القابل وكذا وقع الوجود ويجوز في النظر الفكري خلافه معرى عن علمه بما سبق في علم الله فما ثم إمكان إلا بالنظر المجرد إلى الأكوان معراة عن علم الله فيها فلا تعرف إلا بالوقوع فانحصرت مواطن الظهور والخفاء بين تجل إلهي واستتار في سبعمائة موطن وستة وعشرين موطنا بأحكام مختلفة وبين كل موطنين من ظهور وخفاء يقع تجل برزخي في قوله الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ ليحفظ هذا البرزخ وجود الطرفين فلا يرى كل طرف منها حكم الطرف الآخر والبرزخ له الحكم في الطرفين فيسخف الكثيف ويكثف السخيف وله في كل موطن حكم لا يظهر به في الموطن الآخر وهو ما يجري عليه أحكام عالم هذه الدار إلى أن يرث الله الوارث الْأَرْضَ ومن عَلَيْها ومن حقيقة هذه المواطن ظهر العالم في الدنيا بصورة الظهور وهو ما أدركه الحس وبصورة الاستتار وهو ما لا يدركه الحس من المعاني وما استتر عن الأبصار من الملائكة والجن قال تعالى فَلا أُقْسِمُ بِما تُبْصِرُونَ وهو ما ظهر لنا وما لا تُبْصِرُونَ وهو ما خفي عنا فالعالم بين الأبد والأزل برزخ به انفصل الأبد من الأزل لولاه ما ظهر لهما حكم ولكان الأمر واحد إلا يتميز كالحال بين الماضي والمستقبل لو لا الحال ما تميز العدم الماضي عن العدم المستقبل وهذا حكم البرزخ لا يبرح دائما في العالم وهو الرابط بين المقدمتين لولاه ما ظهر علم صحيح ثم إن الله سبحانه ولي الاسم الرحمن المملكة كلها وجعل الاسم الرب السادن الأول العام وأعطاه إقليد التكوين والتصريف والنزول والمعراج فهو يتلقى الركبان وينزل بهم على الرحمن والرحمن على عرشه الأبهى يعلم مجموع كلمه في أي عين يظهر من العالم وهو الذي أشرنا إليه بقولنا\n\n\n> علم القرآن كيف ينزل *** اسمه الرحمن لما عملوا\n\n\n> بالذي يعطيهم حكمته *** وهو العامل وهو العمل‏\n\n\n> فرجال الله قدما سبقوا *** وعليهم بعليه عولوا\n\n\n> فهم المطلوب لا غيرهم *** فبه منهم إليه وصلوا\n\n\nفقوله الرَّحْمنُ عَلَّمَ الْقُرْآنَ نصب القرآن ثم قال خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ فينزل عليه القرآن ليترجم منه بما علمه الحق من البيان الذي لم يقبله إلا هذا الإنسان فكان للقرآن علم التمييز فعلم أين محله الذي ينزل عليه من العالم فنزل على قلب محمد صَلَّى اللهُ عَليهِ وسَلَّم نَزَلَ به الرُّوحُ الْأَمِينُ ثم لا يزال ينزل على قلوب أمته إلى يوم القيامة فنزوله في القلوب جديد لا يبلى فهو الوحي الدائم فللرسول صلوات الله عليه وسلامه الأولية في ذلك والتبليغ إلى الأسماع من البشر والابتداء من البشر فصار القرآن برزخا بين الحق والإنسان وظهر في قلبه على صورة لم يظهر بها في لسانه فإن الله جعل لكل موطن حكما لا يكون لغيره وظهر في القلب أحدي العين فجسده الخيال وقسمه فأخذه اللسان فصيره ذا حرف وصوت وقيد به سمع الآذان وأبان إنه مترجم عن الله لا عن الرحمن لما فيه من الرحمة والقهر والسلطان فقال فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله فتلاه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بلسانه أصواتا وحروفا سمعها الأعرابي بسمع أذنه في حال ترجمته فالكلام لله بلا شك والترجمة للمتكلم به كان من كان فلا يزال كلام الله من حين نزوله يتلى حروفا وأصواتا إلى أن يرفع من الصدور ويمحي من المصاحف فلا يبقى مترجم يقبل نزول القرآن عليه فلا يبقى الإنسان المخلوق على الصورة فإذا بقيت صورة جسم الإنسان مثل أجسام‏\n\n\nالحيوان وزالت الصورة الإلهية بالتجريد نُفِخَ في الصُّورِ فَصَعِقَ من في السَّماواتِ ومن في الْأَرْضِ‏\nإلى يوم النشور وهو الظهور الذي لا ضد له فيقابله الخفاء فمن معافى ومبتلى بحسب ما يحكم فيه من الأسماء إلى الأجل المسمى فتعم الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ من الرحمن الذي اسْتَوى‏ عَلَى الْعَرْشِ فتعم النعم العالم وتظهر أحكام الأسماء بالإضافات والمناسبات لا بالتقابل فيكون الأمر مثل قولهم حسنات الأبرار سيئات المقربين ونعيم الأدنى لو أعطى الأعلى بعد ذوقه النعيم الأعلى لتعذب بفقده لا بوجود النعيم الأدنى لعدم الرضاء به فهو عذاب مناسبة وإضافة لبقاء حكم الأسماء الإلهية دائما أ رأيت صاحب منزلة عليا كسلطان أخرجه سلطان آخر من ملكه وولاة ملكا دون ملكه يأمر فيه وينهى ولكن إذا أضفته إلى ما كان فيه أولا وجدته ذا بلاء مع وجود المكانة من حيث ما هي ولاية وتحكم بأمر ونهي ولكن يعلم أن هذه المنزلة بالنظر إلى الأولى عذاب في حق من يحضر الأولى في خاطره فهذا القدر يبقى في الآخرة من حكم الأسماء إذ يستحيل رفعها من الوجود إذ كان لها البقاء الإلهي ببقاء المسمى‏\n\n\n### [أن الظهور ينقسم إلى قسمين‏]\n\n\nثم اعلم أن الظهور الذي نحن بصدده ينقسم الظاهر فيه إلى قسمين قسم له ظهوره خاصة وليس له أمر يعتمد عليه ظهوره من جانب الحق وقسم آخر يكون له من جانب الحق أمر يعتمد عليه وليس ذلك إلا للإنسان الكامل خاصة فإن له الظهور والاعتماد لكون الصورة الإلهية تحفظه حيث كان وغير الإنسان الكامل له الظهور من إنسان وحيوان ونبات وأفلاك وأملاك وغير ذلك فهذا كله نعم أظهرها الحق لينعم بها الإنسان الكامل فلها الظهور وما لها الاعتماد لأنها مقصودة لغير أعيانها والإنسان الكامل مقصود لعينه لأنه ظاهر الصورة الإلهية وهو الظاهر والباطن فليس عين ما ظهر بغير لعين ما بطن فافهم فهو الباقي ببقاء الله وما عداه فهو الباقي بإبقاء الله وحكم ما هو بالإبقاء يخالف حكم ما هو بالبقاء فما هو بالبقاء فله دوام العين وما هو بالإبقاء فله دوام الأمثال لا دوام العين حتى لا يزال المتنعم متنعما والنعم تتوالى عليه دائمة مستمرة وما أنشأ الله من كل شي‏ء زوجين إلا ليعرف الله العالم بفضل نشأة الإنسان الكامل ليعلم أن فضله ليس بالجعل فإن الذي هو الإنسان الكامل ظهر به ازدواج من لا يقبل لذاته الازدواج وما هو بالجعل فضمن الوجود الإنسان الكامل الظاهر بصورة الحق فصار للصورة بالصورة زوجين فخلق آدم على صورته فظهر في الوجود صورتان متماثلتان كصورة الناظر في المرآة ما هي عينه ولا هي غيره لكن حقيقة الجسم الصقيل مع النظر من الناظر أعطى ما ظهر من الصورة ولهذا تختلف باختلاف المرآة لا بالناظر فالحكم في الصورة الأكبر لحضرة المجلى لا للمتجلي كذلك الصورة الإنسانية في حضرة الإمكان لما قبلت الصورة الإلهية لم تظهر على حكم المتجلي من جميع الوجوه فحكم عليها حضرة المجلى وهي الإمكان بخلاف حكم حضرة الواجب الوجود لنفسه فظهر المقدار والشكل الذي لا يقبله الواجب وهو الناظر في هذه المرآة فهو من حيث حقائقه كلها هو هو ومن حيث مقداره وشكله ما هو هو وإنما هو من أثر حضرة الإمكان فيه الذي هو في المرآة تنوع شكلها في نفسها ومقدارها في الكبر والصغر ولما كان الظاهر بالصورة لا يكون إلا في حال نظر الناظر الذي هو المتجلي لذلك نسب الصورة إلى محل الظهور وإلى النظر فكانت الصورة الظاهرة برزخية بين المحل والناظر ولكل واحد منهما أثر فيها يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وهو ما كبر من الجوهر والْمَرْجانُ وهو ما صغر منه وهو أثر الحضرة لا أثر الناظر فقال في زوجية ظهور الإنسان الكامل لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ أي ليس مثل مثله شي‏ء أي من هو مثل له بوجوده على صورته لا يقبل المثل أو لا يقبل الموجود على الصورة الإلهية المثال فعلى الأول نفي المثلية عن الحق من جميع الوجوه لما أثر المحل المتجلي فيه في الصورة الكائنة من الشكل والمقدار الذي لا يقبله المتجلي من حيث ما هو عليه في ذاته وإن ظهر به فذلك حكم عين الممكن في وجوده وعلى الآخر نفي المثلية عن الصورة التي ظهرت فلم يماثلها شي‏ء من العالم من جميع وجوه المماثلة فلما كان من الصورة زوجان كان بالجعل من كُلِّ شَيْ‏ءٍ خَلَقْنا زَوْجَيْنِ لأن الأصل قبل الزوجية فظهر حكمها في الفرع ولكن حكمها في الأصل يخالف حكمها في الفرع وهذه مسألة واحدة من مسائل هذا المنزل فلنذكر ما يتضمن من العلوم كما ذكرنا لسائر منازل هذا الكتاب فمن ذلك علم مراتب الأسماء وعلم الفهم في القرآن وعلم نطق كل شي‏ء ومراتبه في البيان عن نفسه وعلم العدد وعلم اشتراك العالم فيما يشترك فيه من الصفات والمراتب وعلم الفرق بين العوالم واختلاف أحكام العدل لاختلاف المواطن والأعصار فما هو حق في شرع عاد باطلا في‏\nشرع آخر بالنسخ الطارئ والايمان بحقيقته واجب وبنسخه واجب وعلم العدول عن الحق وإلى الحق وما يتعلق بذلك من الذم والحمد وعلم المولدات التي هي الأمهات لما ذا وضعت في العالم ولم تظهر أعيان الأشياء من غير إن يكون أبناء لأمهات وآباء وما تحمله الأمهات مما فيه صلاح الأبناء وعلم تقرير النعم الظاهرة والباطنة ولم تذهب بالكفر وتزيد بالشكر وعلم نشأة الجن والإنس دون غيرهما من الحيوان وعلم الستر والتجلي الذي لأجله لم يكن في الإمكان أبدع من هذا العالم لعمومه جميع المراتب فلم يبق في الإمكان إلا أمثاله لا أزيد منه في الكمال الوجودي الحافظ للأصول وعلم الفواصل بين الأشياء وبين كل اثنين في المعقول والمحسوس كالخط الفاصل بين الظل والشمس لما ذا ترجع هذه الفواصل هل لأمر زائد على أعيان المفصولين أم لا وعلم ما تحوي عليه حروف الوجود من المعاني وعلم الأعلام على ما هي أعلام وعلم الفناء والبقاء وعلم ما يفعله الحق مما يظهر في الحال لا غير وعلم إضافة ما ينزه العقل إضافته عن الحق إلى الحق وعلم السرادق الإلهي وما فيه من الأبواب وما يفتح تلك الأبواب للذين يريدون الخروج منها ولما ذا يخرجون وما يشهدون إذا خرجوا وما يخرجهم وعلم العقاب والعذاب ولما ذا سمي عقابا وعذابا وعلم ما يؤول إليه محل الملإ الأعلى لا بل الملإ الأوسط وعلم الخرس والسكوت عن العالم وما سببه وعلم العلامات هل تقوم مقام الكلام والعبارة من المتكلم أم لا كالمعجزات والنطق المعلوم من قرائن الأحوال وإن لم يكن هناك عبارة بنظم حروف وإظهار كلمات وعلم ما تعطيه العلامات في الأشياء من الأحكام وعلم تردد الأشياء بين الأشياء وعلم نتائج المقامات والأحوال وعلم حكم الشفعية في العالم الأخراوي وعلم الأسباب الموصلة إلى الحكم من السبب إلى المسبب وعلم الأذواق والأفكار وعلم الالتذاذ بما يرد من الحق على الإنسان من طريق شفعيته أي من حيث شفع الصورة الإلهية لا من حيث ما شابه العالم وعلم من يمنع بتجليه النظر إلى غيره مع القدرة عليه فلا يكون في حال فناء وعلم مقام الأسرار من خلف حجاب الغيرة والصون الإلهي وعلم التشبيه والتمثيل وعلم المجازاة بالأمثال كالذهب بالذهب مفاضلة وهو في حكم الدنيا ربا وعلم المفاضلة وعلم بما ذا تقع المفاضلة بين الأمثال وعلم الفرق بين البراقات والرفارف والأوكار في الأشجار وفي الإسراءات وعلم مباسطة الحق في قبضه وقبضه في مباسطته وما يحدث من الزيادة عند صاحب هذه الأحوال فهذا بعض ما يحتوي عليه هذا المنزل من أمهات العلوم التي يتفرع أبناؤها بالتناسل إلى ما يتناهى مع الآنات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Twenty-Nine: Concerning the Station (منزل) of the Knowledge of Divine Favors (علم الآلاء) and the Turning Away (الفراغ) towards Tribulation (البلاء), which belongs to the Muhammadan Presence (الحضرة المحمدية).\n\nIndeed, the worlds were brought into existence by the All-Merciful (الرحمن),\nThe Lord of the servants, and they came into being for the All-Merciful.\n\nThe verses have spoken concerning what I have stated,\nWithin the decisive Remembrance (الذكر), and the Messengership has borne witness.\n\nWere it not for suffering, no one would deny Him;\nAnd by the Lord of High Exaltation, His favors would not be rejected.\n\n[The World is Created by the Perfect Human (الإنسان) upon His Form]\n\nThe Prophet, peace and blessings be upon him, said: \"Indeed, Allah created Adam upon His form.\"\n\nThe World (العالم) is created by the Perfect Human (الإنسان) upon his form. If the Perfect Human were absent from it, the World would not be upon that form. If the World were absent and the Perfect Human remained, he would still be upon the form. And He, the Exalted, said: <<كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ>> (Every soul shall taste death). This is the soul's removal from the administration of this natural structure (الهيكل الطبيعي) which it managed in the world during its residence therein.\n\nAs for His saying, the Exalted: <<كُلُّ مَنْ عَلَيْهَا فَانٍ وَيَبْقَى وَجْهُ رَبِّكَ ذُو الْجَلَالِ وَالْإِكْرَامِ>> (Everyone upon it is perishable, and there remains the Face of your Lord, Owner of Majesty and Honor), He did not say, \"Everyone *in* it\" is perishable, because when one is *in* it, one is preserved by it. But when one is *upon* it, one is stripped bare of it. This indicates that the Divine Self-disclosure (التجلي الإلهي) encompasses everyone upon it, because annihilation (الفناء) only occurs through a Divine Self-disclosure that is not in a cosmic form (صورة كونية). For the Self-disclosure in the forms of similitudes (صور المثل)—if it is known that it is the very essence of the form—causes the recipient of the disclosure to be characterized by awe (الخشوع), not annihilation.\n\nThe Messenger of Allah, peace and blessings be upon him, was asked about the eclipse, and he said: \"Allah does not disclose Himself to anything except that it is awed by Him.\"\n\nThis is why we affirm awe and not annihilation, due to the suitability (المناسبة) between the sensory perception (الحس) and the Imagination (الخيال). For this reason, Imagination is called the common sense (الحس المشترك). If the disclosure is not recognized, it does not produce an awe by which it is known that *He* is the very essence of the form. However, it must produce awe in the recipient of the disclosure, but the recipient does not know that it is *He*, especially those who rely on intellectual reflection (أهل الأفكار). This belongs to the knowledge of Manifestation (الظهور) and Concealment (الخفاء). It is undoubtedly manifest that it is He, yet it is concealed by the restriction inherent in its manifestation, so it is not known that it is He.\n\nThus, if the Gnostic (العارف) who possesses perfect Gnosis (المعرفة) of Allah within this human species knows that the very Essence of the Real (عين الحق) is the one described by Existence (الوجود), and that the rulings of the Fixed Entities (أحكام أعيان العالم) of the world are what appear in this Essence, or that He appears through them, he recognizes what he sees. If the station (الموطن) demands affirmation, he affirms it when it claims to be Him. If the station demands denial, the Gnostic remains silent, neither affirming nor denying, due to his knowledge of what the Real (الحق) intended in that station.\n\nSince the Divine Self-disclosure enriches the one who is upon the Form, we know that the Essence (العين) does not vanish; rather, it is a stripping bare (تجريد) and a divestiture (خلع), not a removal from the administration of dominion (ملك), unless the pronoun in *‘alayhā* (upon it) refers back to the Earth. In that case, it is a removal from the divine administration of all things to which Allah has assigned their administration. This Manifestation and Concealment belong to the Name *al-Rabb* (The Lord), and not to any other. Its ruling returns to Him, and it is divided into three sections.\n\nIt appears in this ruling—meaning Manifestation and Concealment—in two stations (موطنين) so that the owner of the dominion may take the servant as a deputy (وكيلا) in what he owns, allowing the servant to exercise disposal (التصريف) therein, while the servant is at rest in all his states, whether waking or sleeping.\n\nThe second section of this ruling is that it appears in four stations, corresponding to the length and breadth of the World, due to the existence of favor (الإنعام) upon him, as He said: <<وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظَاهِرَةً وَبَاطِنَةً>> (And He has completed His favors upon you, manifest and hidden). Thus, he has these two rulings in the length of the World and likewise in its breadth. The length of the World is the world of Spirits (عالم الأرواح), and its breadth is the world of corporeal forms (عالم صور الأجسام). We say \"corporeal forms\" and not \"bodies\" (الأجسام) because of the imagined bodies (الأجسام المتخيلة). Even though they are real bodies in their own Presence (حضرتها), they are not bodies according to everyone, due to the swiftness of change that affects them, and because they return to the essence of the observer (عين الناظر) and not to themselves. Real bodies are bodies in themselves, not dependent on the essence of the observer. Whether the observer exists or not, they are bodies in themselves. The others are bodies not in themselves, as He said: <<يُخَيَّلُ إِلَيْهِ مِنْ سِحْرِهِمْ أَنَّهَا تَسْعَى>> (It was made to appear to him from their magic that they were moving). They are bodies in their essence, but they have no ruling of movement. They appeared in the eye of Moses in the form of a body that possessed movement, but the matter in itself is not so.\n\nThe third section of this ruling of Manifestation and Concealment appears in seven hundred and twenty stations. This is the limit of what the world of this life accepts of Divine Power (الاقتدار الإلهي)—not that the Power is deficient or incapable. This is the ruling of the recipient, and thus Existence (الوجود) occurred. Intellectual reflection (النظر الفكري) may permit the opposite, stripped of the knowledge of what preceded in Allah's Knowledge. There is no possibility (إمكان) except by looking purely at the cosmos (الأكوان), stripped of Allah's knowledge concerning them, so they are only known through their occurrence.\n\nThe stations of Manifestation and Concealment are confined between a Divine Self-disclosure and a concealment, in seven hundred and twenty-six stations with different rulings. Between every two stations of manifestation and concealment, an Isthmus-like (برزخي) Self-disclosure occurs, based on His saying: <<الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى>> (The All-Merciful settled upon the Throne). This Isthmus (البرزخ) preserves the existence of the two extremes, so that neither extreme sees the ruling of the other. The Isthmus has the ruling over both extremes: it thins the dense (الكثيف) and densifies the thin (السخيف). In every station, it has a ruling that does not appear in the other station. This is what the rulings of the world of this abode are subject to, until Allah, the Inheritor (الوارث), inherits <<الْأَرْضَ وَمَنْ عَلَيْهَا>> (the earth and whoever is upon it).\n\nFrom the reality of these stations, the World appeared in this life in the form of Manifestation—which is what the senses perceive—and in the form of Concealment—which is what the senses do not perceive, such as meanings (المعاني) and what is concealed from sight, like angels and jinn. He, the Exalted, said: <<فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ>> (Nay! I swear by what you see)—which is what is manifest to us—<<وَمَا لَا تُبْصِرُونَ>> (and what you do not see)—which is what is hidden from us.\n\nThe World is an Isthmus between Eternity (الأبد) and Pre-Eternity (الأزل). By it, Eternity is separated from Pre-Eternity. Were it not for the Isthmus, no ruling would appear for them, and the matter would be one, indistinguishable, just like the state between the Past and the Future: were it not for the Present state (الحال), the past non-existence would not be distinguished from the future non-existence. This ruling of the Isthmus remains perpetually in the World. It is the link between the two premises; were it not for it, no sound knowledge would appear.\n\nThen, Allah, the Glorified, entrusted the entire Kingdom (المملكة) to the Name *al-Rahman* (The All-Merciful) and made the Name *al-Rabb* (The Lord) the first general custodian (السادن الأول العام). He gave *al-Rabb* the key to Creation (التكوين), Disposal (التصريف), Descent (النزول), and Ascent (المعراج). Thus, *al-Rabb* receives the riders and brings them down upon *al-Rahman*. *Al-Rahman*, upon His most glorious Throne, knows the totality of His words (كلمه) and in which essence (عين) they will appear in the World. This is what we alluded to in our poetry:\n\n> He taught the Qur'an how it descends,\n> His Name is the All-Merciful (الرحمن) for what they did,\n> By that which grants them His wisdom,\n> He is the Doer, and He is the Deed.\n> The Men of Allah (رجال الله) have long preceded,\n> And upon Him, by Him, they relied.\n> They are the sought, none other than them,\n> For by Him, from them, they reached Him.\n\nThus, His saying: <<الرَّحْمَنُ عَلَّمَ الْقُرْآنَ>> (The All-Merciful taught the Qur'an) established the Qur'an. Then He said: <<خَلَقَ الْإِنْسَانَ عَلَّمَهُ الْبَيَانَ>> (He created the human, taught him the clear expression). The Qur'an descends upon him so that he may translate from it using the clear expression (البيان) that the Real taught him, which only this human accepted. Thus, the Qur'an possessed the knowledge of distinction (علم التمييز), knowing its proper place in the World upon which it should descend. So it descended upon the heart of Muhammad, peace and blessings be upon him: <<نَزَلَ بِهِ الرُّوحُ الْأَمِينُ>> (The Trustworthy Spirit brought it down). Then it continues to descend upon the hearts of his community until the Day of Resurrection. Its descent into the hearts is ever new and does not wear out; it is the perpetual Revelation (الوحي الدائم). The Messenger, peace and blessings of Allah be upon him, has the priority in this, and in conveying it to the ears of mankind, and in the initiation from mankind.\n\nThus, the Qur'an became an Isthmus (برزخ) between the Real (الحق) and the Human. It appeared in his heart in a form different from the one in which it appeared on his tongue. Allah has assigned a ruling to every station that is not shared by another. It appeared in the heart as a singular Essence (أحدي العين). The Imagination (الخيال) embodied it and divided it, and the tongue took it, turning it into letters and sounds, restricting the hearing of the ears with it. It made clear that it is a translation *from* Allah, not *from* the All-Merciful (الرحمن), due to the mercy, subjugation (القهر), and sovereignty (السلطان) contained within it. So He said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ>> (Then grant him protection until he hears the Word of Allah). The Messenger of Allah, peace and blessings be upon him, recited it with his tongue as sounds and letters, which the Bedouin heard with the hearing of his ear during the translation. The speech is undoubtedly Allah's, and the translation belongs to the one who speaks it, whoever he may be.\n\nThe Word of Allah continues to be recited as letters and sounds from the time of its descent until it is lifted from the breasts and erased from the copies (المصاحف). When no translator remains who accepts the descent of the Qur'an upon him, the human created upon the Form will no longer remain. When the physical form of the human remains, like the bodies of animals, but the Divine Form (الصورة الإلهية) vanishes through stripping bare (التجريد), <<نُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ>> (the Trumpet will be blown, and whoever is in the heavens and whoever is on the earth will fall unconscious) until the Day of Resurrection (النشور), which is the Manifestation (الظهور) that has no opposite (ضد) to be countered by Concealment (الخفاء).\n\nThen, some are granted well-being and some are afflicted (مبتلى) according to what the Names (الأسماء) rule over them until the appointed term. The Mercy that <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompasses all things) from the All-Merciful (الرحمن) who <<اسْتَوَى عَلَى الْعَرْشِ>> (settled upon the Throne) becomes universal. The rulings of the Names appear through additions (الإضافات) and correspondences (المناسبات), not through opposition (التقابل). The matter becomes like their saying: \"The good deeds of the pious are the evil deeds of the near ones (المقربين).\" And the bliss of the lower realm (نعيم الأدنى), if given to the higher one (الأعلى) after he has tasted the higher bliss, would cause him suffering due to the loss of the higher, not due to the existence of the lower bliss, because he is not content with it. This is a suffering of correspondence and addition, due to the perpetual persistence of the ruling of the Divine Names. Consider a person of high rank, like a sultan, whom another sultan removes from his kingdom and appoints him to a lesser kingdom where he commands and forbids. But when you compare it to what he had before, you find him in a state of tribulation (بلاء), despite the existence of the position as a governorship and a rule of command and prohibition. Yet, he knows that this rank, when viewed in relation to the former, is a torment (عذاب) for one who keeps the former in mind. This much remains in the Hereafter from the ruling of the Names, since it is impossible to remove them from Existence, given that they possess Divine Subsistence (البقاء الإلهي) through the subsistence of the Named One (المسمى).\n\n[That Manifestation is Divided into Two Sections]\n\nThen know that the Manifestation (الظهور) we are discussing is divided into two sections regarding what is manifest: A section that has its manifestation exclusively, and has no matter upon which its manifestation relies from the side of the Real (الحق). And another section that has a matter from the side of the Real upon which it relies. This latter belongs exclusively to the Perfect Human (الإنسان الكامل). For him is the Manifestation and the Reliance, because the Divine Form (الصورة الإلهية) preserves him wherever he is. Everything other than the Perfect Human—including humans, animals, plants, celestial spheres (أفلاك), angels (أملاك), and so forth—has manifestation. All of this is favor (نعم) that the Real manifested so that the Perfect Human may enjoy it. Thus, they have Manifestation but not Reliance, because they are intended for the sake of something other than their own essences. The Perfect Human is intended for his own essence, because he is the manifest Divine Form; he is the Manifest (الظاهر) and the Hidden (الباطن). The essence of what is manifest is not other than the essence of what is hidden. Understand this. He subsists (الباقي) through the Subsistence of Allah (بقاء الله). Everything else subsists through the Preservation of Allah (إبقاء الله). The ruling of that which is by Preservation differs from the ruling of that which is by Subsistence. That which is by Subsistence has the permanence of the Essence (دوام العين). That which is by Preservation has the permanence of similitudes (دوام الأمثال), not the permanence of the Essence, so that the recipient of bliss remains perpetually in bliss, and the favors continuously flow upon him, permanent and continuous.\n\nAllah only brought forth everything in pairs (زوجين) so that the World might know Allah through the excellence of the creation of the Perfect Human, and know that his excellence is not by imposition (بالجعل). For the Perfect Human is the one through whom the pairing (ازدواج) of the One who does not accept pairing in His Essence appeared, and this is not by imposition. The Perfect Human, who is manifest in the Form of the Real, is contained within Existence. Thus, the Form became a pair through the Form. \"He created Adam upon His form.\" Two similar forms appeared in Existence, like the image of the observer in the mirror: it is neither his essence nor other than him. However, the reality of the polished body (الجسم الصقيل) combined with the gaze of the observer produced the image that appeared. This is why the image differs according to the mirror, not according to the observer. The ruling in the greater image belongs to the Presence of the Manifestation (حضرة المجلى), not to the Manifesting One (المتجلي). Likewise, when the human form accepted the Divine Form in the Presence of Possibility (حضرة الإمكان), it did not appear according to the ruling of the Manifesting One in all respects. Rather, the Presence of the Manifestation, which is Possibility, ruled over it, contrary to the ruling of the Presence of the Necessary Existence (حضرة الواجب الوجود لنفسه). Thus, the measure (المقدار) and the shape (الشكل) appeared, which the Necessary Being does not accept. He is the observer in this mirror. From the perspective of all His realities, He is He (هو هو). But from the perspective of His measure and shape, He is not He. Rather, this is due to the effect of the Presence of Possibility within it, which is the mirror whose shape and measure (in size and smallness) vary in itself.\n\nSince the one who appears in the Form only exists while the observer (the Manifesting One) is looking, the Form is attributed to the locus of manifestation (محل الظهور) and to the gaze. Thus, the manifest Form is Isthmus-like (برزخية) between the locus and the observer, and each of them has an effect upon it: <<يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ>> (From both of them come forth pearls)—which is the large jewel—<<وَالْمَرْجَانُ>> (and coral)—which is the small one. This is the effect of the Presence, not the effect of the Observer. Regarding the pairing of the manifestation of the Perfect Human, He said: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). That is, there is nothing like unto His like (مثل مثله), meaning that the one who is His like by existing upon His Form does not accept a like, or that the existent upon the Divine Form does not accept a similitude (المثال). Based on the first interpretation, the similitude is negated from the Real in all respects, due to the effect of the locus of manifestation upon the resulting Form, in terms of shape and measure, which the Manifesting One does not accept in His Essence, even if He appears through it—that is the ruling of the essence of the possible being in its existence. Based on the second interpretation, the similitude is negated from the Form that appeared, so nothing in the World resembles it in all aspects of resemblance. Since the Form had two pairs, it was by imposition (بالجعل) from <<مِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ>> (Of everything We created pairs), because the origin (الأصل) existed before the pairing, so its ruling appeared in the branch (الفرع). However, its ruling in the origin differs from its ruling in the branch.\n\nThis is one issue among the issues of this Station. Let us mention the sciences it encompasses, just as we have done for the other stations in this book.\n\nAmong these are:\nThe knowledge of the Levels of the Names (مراتب الأسماء).\nThe knowledge of Comprehension (الفهم) in the Qur'an.\nThe knowledge of the utterance of everything and its levels in expressing itself.\nThe knowledge of Number (العدد).\nThe knowledge of the commonality of the World in the Attributes (الصفات) and Levels (المراتب) it shares.\nThe knowledge of the difference between the Worlds and the variation in the rulings of Justice (أحكام العدل) due to the difference in stations and eras.\nThe knowledge of how what is true in one Law (شرع) becomes false in another due to subsequent abrogation (النسخ الطارئ), and that belief in its reality is obligatory, and belief in its abrogation is obligatory.\nThe knowledge of deviation from the Real and turning towards the Real, and the blame and praise related thereto.\nThe knowledge of the generators (المولدات), which are the mothers (الأمهات), why they were placed in the World, and why the essences of things did not appear without being the children of mothers and fathers.\nThe knowledge of what the mothers carry that is beneficial for the children.\nThe knowledge of the confirmation of manifest and hidden favors (النعم الظاهرة والباطنة), and why they do not vanish through disbelief (الكفر) but increase through gratitude (الشكر).\nThe knowledge of the creation of Jinn and Humans, excluding other animals.\nThe knowledge of Concealment (الستر) and Self-disclosure (التجلي), for the sake of which nothing more wondrous than this World could exist in Possibility (الإمكان), due to its encompassing all Levels, leaving nothing in Possibility except its similitudes, not anything greater in existential perfection (الكمال الوجودي) that preserves the fundamentals (الأصول).\nThe knowledge of the dividing lines (الفواصل) between things and between every two things, whether intelligible or sensible, such as the line separating shadow and sun: why do these dividing lines return? Is it due to something added to the essences of the separated things, or not?\nThe knowledge of the meanings contained within the letters of Existence (حروف الوجود).\nThe knowledge of the signs (الأعلام) as they are signs.\nThe knowledge of Annihilation (الفناء) and Subsistence (البقاء).\nThe knowledge of what the Real does that appears only in the present moment (الحال).\nThe knowledge of attributing to the Real what the intellect purifies Him from attributing.\nThe knowledge of the Divine Pavilion (السرادق الإلهي) and the doors within it, and what opens those doors for those who wish to exit them, why they exit, what they witness when they exit, and what causes them to exit.\nThe knowledge of Punishment (العقاب) and Torment (العذاب), and why they are named Punishment and Torment.\nThe knowledge of what the locus of the Highest Assembly (الملإ الأعلى) ultimately returns to—or rather, the Middle Assembly (الملإ الأوسط).\nThe knowledge of muteness (الخرس) and silence concerning the World, and its cause.\nThe knowledge of whether signs (العلامات) stand in place of speech and expression from the speaker or not, such as miracles (المعجزات) and the known utterance derived from circumstantial evidence, even if there is no expression involving the arrangement of letters or the manifestation of words.\nThe knowledge of the rulings that signs bestow upon things.\nThe knowledge of the oscillation of things between things.\nThe knowledge of the results of the Stations (المقامات) and States (الأحوال).\nThe knowledge of the ruling of pairing (الشفعية) in the World of the Hereafter.\nThe knowledge of the means leading to the ruling, from the cause to the effect.\nThe knowledge of Tastes (الأذواق) and Thoughts (الأفكار).\nThe knowledge of finding pleasure in what comes from the Real to the human through the path of his pairing (شفعيته)—that is, from the perspective of the pairing of the Divine Form, not from the perspective of his resemblance to the World.\nThe knowledge of the one who, by his Self-disclosure, prevents gazing upon anything other than Him, despite the ability to do so, so that he is not in a state of annihilation (فناء).\nThe knowledge of the station of secrets (مقام الأسرار) from behind the veil of Divine Jealousy (الغيرة) and Preservation (الصون).\nThe knowledge of Anthropomorphism (التشبيه) and Similitude (التمثيل).\nThe knowledge of recompense by similitudes, such as gold for gold with preference (مفاضلة), which is usury (ربا) according to the ruling of this world.\nThe knowledge of Preference (المفاضلة).\nThe knowledge of what causes preference to occur between similitudes.\nThe knowledge of the difference between flashes (البراقات), canopies (الرفارف), and nests (الأوكار) in trees and in the Night Journeys (الإسراءات).\nThe knowledge of the Real's expansion (مباسطة) in His contraction (قبضه) and His contraction in His expansion, and the increase that occurs for the possessor of these states.\n\nThis is some of what this Station contains of the fundamental sciences (أمهات العلوم) whose offspring branch out through procreation to what is endless, moment by moment. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب تین سو انتیس: علمِ نعمتوں (الآلاء) اور آزمائش (البلاء) کی طرف فراغت کے مقام کی معرفت میں، اور یہ مقام حضرت محمدیہ (الحضرۃ المحمدیۃ) سے ہے۔\n\nبے شک تمام عوالم کو رحمن (الرحمن) نے وجود بخشا،\nرب العباد نے، اور وہ رحمن ہی کے لیے موجود ہوئے۔\nاور جو میں نے کہا ہے، آیات نے اس کی گواہی دی ہے،\nمحکم ذکر (قرآن) میں اور رسالت نے اس کی شہادت دی ہے۔\nاگر تکلیف (التألم) نہ ہوتی تو کوئی بھی اس کا انکار نہ کرتا،\nاور ربِ علٰی کی قسم، اس کی نعمتوں کا انکار نہ کیا جاتا۔\n\n[عالم انسان کے ذریعے اس کی صورت پر تخلیق کیا گیا ہے]\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا۔\"\n\nاور عالم انسان کے ذریعے اس کی صورت پر تخلیق کیا گیا ہے۔ اگر اس عالم سے انسان مفقود ہو جائے تو عالم اس صورت پر نہ رہے گا۔ اور اگر عالم مفقود ہو جائے اور انسان باقی رہے تو وہ صورت پر قائم رہے گا۔ اور اللہ تعالیٰ نے فرمایا: \"كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ\" (ہر جان موت کا ذائقہ چکھنے والی ہے)۔ یہ اس (نفس) کو اس طبعی ہیکل کی تدبیر سے الگ کرنا ہے جس کی تدبیر وہ دنیا میں اپنے قیام کے دوران کر رہی تھی۔ اور جہاں تک اللہ تعالیٰ کے اس قول کا تعلق ہے: \"كُلُّ من عَلَيْها فانٍ ويَبْقى‏ وَجْهُ رَبِّكَ ذُو الْجَلالِ والْإِكْرامِ\" (جو کچھ اس زمین پر ہے سب فنا ہونے والا ہے، اور تیرے رب کی ذات باقی رہے گی جو جلال اور اکرام والا ہے)، تو اس میں یہ نہیں فرمایا کہ \"جو کچھ اس میں ہے وہ فنا ہونے والا ہے\"؛ کیونکہ جب وہ اس (زمین) کے اندر ہوتا ہے تو اس کے ذریعے محفوظ رہتا ہے، اور جب وہ اس (زمین) کے اوپر ہوتا ہے تو اس سے مجرد ہو جاتا ہے۔ یہ بات آپ کو بتاتی ہے کہ ظہور الٰہی (التجلی الإلهی) ان سب کو شامل ہے جو اس (زمین) پر ہیں، کیونکہ فنا (الفناء) صرف غیر کونی صورت میں ظہور الٰہی (التجلی الإلهی) سے ہی ہوتی ہے۔ کیونکہ جب مماثل صورتوں میں ظہور (التجلی) ہوتا ہے اور یہ معلوم ہو جائے کہ وہ عین صورت ہے، تو جس پر ظہور ہوا ہے وہ فنا (الفناء) کے بجائے خشوع سے متصف ہوتا ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم سے سورج گرہن (الکسوف) کے بارے میں پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"اللہ جس چیز پر بھی ظہور (التجلی) فرماتا ہے، وہ اس کے لیے خشوع اختیار کر لیتی ہے۔\"\n\nاسی لیے ہم نے حس اور خیال کے درمیان مناسبت کی وجہ سے فنا (الفناء) کے بجائے خشوع کا قول کیا ہے۔ اور اسی وجہ سے خیال کو حس مشترک کہا جاتا ہے۔ اور اگر (ظہور) کو نہ پہچانا جائے تو وہ ایسا خشوع پیدا نہیں کرتا جس سے یہ معلوم ہو کہ وہ (ذات حق - الحق) ہی ہے، لیکن جس پر ظہور ہوا ہے اس میں خشوع ضرور پیدا ہوتا ہے، مگر وہ یہ نہیں جانتا کہ وہ (ذات حق - الحق) ہی ہے، خاص طور پر اہل فکر۔ اور یہ علمِ ظہور و خفاء میں سے ہے۔ پس بلا شک یہ ظاہر ہوا کہ وہ (ذات حق - الحق) ہی ہے، اور اپنے ظہور میں مقید ہونے کی وجہ سے مخفی رہا، لہٰذا یہ معلوم نہ ہو سکا کہ وہ (ذات حق - الحق) ہی ہے۔ پس جب اس نوعِ انسانی میں اللہ کی کامل معرفت (المعرفۃ) رکھنے والا عارف یہ جانتا ہے کہ عینِ حق (الحق) ہی وہ ہے جو ہستی (الوجود) سے متصف ہے، اور یہ کہ عالم کی اعیان کے احکام ہی اس عین میں ظاہر ہیں، یا وہ (ذات حق - الحق) ہی ان کے ذریعے ظاہر ہے، تو وہ جان لیتا ہے کہ اس نے کیا دیکھا۔ پس اگر وہ مقام اقرار کا تقاضا کرے تو وہ اس وقت اقرار کرتا ہے جب وہ دعویٰ کرتا ہے کہ وہ (ذات حق - الحق) ہی ہے، اور اگر وہ مقام انکار کا تقاضا کرے تو عارف خاموش رہتا ہے اور نہ انکار کرتا ہے اور نہ اقرار، کیونکہ وہ جانتا ہے کہ اس مقام پر حق (الحق) نے کیا ارادہ کیا ہے۔ اور چونکہ ظہور الٰہی (التجلی الإلهی) اس شخص کو بے نیاز کر دیتا ہے جو صورت پر ہے، اس لیے ہم نے جانا کہ عین (ذات) زائل نہیں ہوتی، بلکہ یہ تجرید اور خلع ہے، نہ کہ ملک کی تدبیر سے معزولی، سوائے اس صورت کے جب \"علیھا\" (اس پر) میں ضمیر زمین کی طرف لوٹے، تو یہ اس الٰہی تدبیر سے معزولی ہے جس کی تدبیر اللہ نے اس (زمین) کے سپرد کی ہے۔ اور یہ ظہور و خفاء اسمِ رب (الرب) کے لیے ہے، کسی اور کے لیے نہیں، اور اس کا حکم اسی کی طرف لوٹتا ہے۔ اور یہ (حکم) تین اقسام میں منقسم ہوتا ہے۔ پس یہ حکم، یعنی ظہور و خفاء، دو مقامات پر ظاہر ہوتا ہے تاکہ صاحبِ ملک اسے اس چیز میں وکیل بنا لے جس کا وہ مالک ہے، پس اس (وکیل) کے لیے اس میں تصرف ہو، اور بندہ اپنے تمام احوال میں، بیداری اور نیند میں، راحت میں رہے۔ اور اس حکم کی دوسری قسم یہ ہے کہ یہ چار مقامات پر ظاہر ہو، عالم کی لمبائی اور چوڑائی میں، اس پر انعام کے وجود کی وجہ سے، جیسا کہ فرمایا: \"وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظاهِرَةً وباطِنَةً\" (اور اس نے تم پر اپنی ظاہری اور باطنی نعمتیں پوری کر دیں)۔ پس اس کے لیے یہ دونوں حکم ہیں۔ عالم کی لمبائی میں اور اسی طرح اس کی چوڑائی میں۔ اور عالم کی لمبائی عالمِ ارواح ہے اور اس کی چوڑائی عالمِ صورِ اجسام ہے۔ اور ہم نے صورِ اجسام کہا، اجسام نہیں کہا، اس کی وجہ متخیلہ اجسام ہیں، اگرچہ وہ اپنی حضرۃ میں حقیقی اجسام ہیں، لیکن وہ ہر ایک کے نزدیک اجسام نہیں ہیں، اس تیزی سے آنے والی تبدیلی کی وجہ سے جو ان پر آتی ہے، اور اس لیے بھی کہ وہ دیکھنے والے کی عین (ذات) کی طرف لوٹتے ہیں نہ کہ اپنی طرف۔ اور حقیقی اجسام وہ ہیں جو اپنی ذات میں اجسام ہیں، نہ کہ دیکھنے والے کی عین (ذات) کے لیے۔ پس خواہ دیکھنے والا موجود ہو یا غیر موجود، وہ اپنی ذات میں اجسام ہیں۔ اور دوسرے اجسام وہ ہیں جو اپنی ذات میں نہیں ہیں، جیسا کہ فرمایا: \"يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏\" (ان کے جادو کے زور سے موسیٰ کو خیال ہوا کہ وہ دوڑ رہے ہیں)۔ اور وہ اپنی عین میں اجسام ہیں جن میں دوڑنے کا حکم نہیں ہے، پس وہ موسیٰ کی آنکھ میں اس جسم کی صورت میں ظاہر ہوئے جسے دوڑنا حاصل ہے، حالانکہ امر اپنی ذات میں ایسا نہیں ہے۔ اور اس حکمِ ظہور و خفاء کی تیسری قسم سات سو بیس مقامات پر ظاہر ہوتی ہے، اور یہ وہ انتہا ہے جسے عالمِ دنیا اقتدار الٰہی سے قبول کرتا ہے، نہ کہ اقتدار میں کوئی کمی یا عجز ہے۔ پس یہ قبول کرنے والے کا حکم ہے، اور وجود اسی طرح واقع ہوا۔ اور فکری نظر میں اس کے خلاف جائز ہے، بشرطیکہ وہ اللہ کے علم میں جو کچھ گزر چکا ہے اس کے علم سے عاری ہو۔ پس وہاں کوئی امکان نہیں ہے مگر صرف اکوان کی طرف مجرد نظر سے، جو ان میں اللہ کے علم سے عاری ہو، لہٰذا وہ صرف وقوع سے ہی پہچانی جاتی ہے۔ پس ظہور و خفاء کے مقامات سات سو چھبیس مقامات میں مختلف احکام کے ساتھ ظہور الٰہی (التجلی الإلهی) اور استتار کے درمیان محدود ہو گئے۔ اور ظہور و خفاء کے ہر دو مقامات کے درمیان ایک برزخی ظہور (التجلی) واقع ہوتا ہے، جیسا کہ اس کے قول: \"الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏\" (رحمن عرش پر مستوی ہوا) میں ہے، تاکہ یہ برزخ دونوں اطراف کے وجود کو محفوظ رکھے، پس ان میں سے ہر طرف دوسرے طرف کا حکم نہ دیکھے۔ اور برزخ کے لیے دونوں اطراف میں حکم ہے، پس وہ کثیف کو لطیف بناتا ہے اور لطیف کو کثیف بناتا ہے۔ اور اس کے لیے ہر مقام پر ایک حکم ہے جو دوسرے مقام پر ظاہر نہیں ہوتا، اور یہی وہ ہے جس پر اس دار کے عالم کے احکام جاری ہوتے ہیں، یہاں تک کہ اللہ وارث (الوارث) زمین اور جو کچھ اس پر ہے، کا وارث ہو جائے۔ اور ان مقامات کی حقیقت سے عالم دنیا میں ظہور کی صورت میں ظاہر ہوا، اور یہ وہ ہے جسے حس نے ادراک کیا، اور استتار کی صورت میں ظاہر ہوا، اور یہ وہ ہے جسے حس ادراک نہیں کرتی، جیسے معانی اور وہ جو فرشتوں اور جنوں میں سے آنکھوں سے پوشیدہ ہے۔ اللہ تعالیٰ نے فرمایا: \"فَلا أُقْسِمُ بِما تُبْصِرُونَ\" (پس میں قسم کھاتا ہوں ان چیزوں کی جنہیں تم دیکھتے ہو) اور یہ وہ ہے جو ہمارے لیے ظاہر ہوا، \"وما لا تُبْصِرُونَ\" (اور ان چیزوں کی جنہیں تم نہیں دیکھتے) اور یہ وہ ہے جو ہم سے مخفی رہا۔ پس عالم ابد اور ازل کے درمیان ایک برزخ ہے، جس کے ذریعے ابد ازل سے جدا ہوا ہے۔ اگر یہ نہ ہوتا تو ان دونوں کے لیے کوئی حکم ظاہر نہ ہوتا اور امر ایک ہی رہتا جس میں کوئی امتیاز نہ ہوتا، جیسے ماضی اور مستقبل کے درمیان حال (وقت) ہے۔ اگر حال نہ ہوتا تو عدمِ ماضی عدمِ مستقبل سے ممتاز نہ ہوتا۔ اور یہ برزخ کا حکم ہے جو ہمیشہ عالم میں موجود رہتا ہے، اور یہ دونوں مقدمات کے درمیان ربط قائم کرنے والا ہے۔ اگر یہ نہ ہوتا تو کوئی صحیح علم ظاہر نہ ہوتا۔ پھر بے شک اللہ سبحانہ و تعالیٰ نے اسمِ رحمن (الرحمن) کو پوری مملکت کا والی بنایا، اور اسمِ رب (الرب) کو پہلا عام خادم (سادن) بنایا، اور اسے تکوین، تصریف، نزول اور معراج کی کنجی عطا کی۔ پس وہ سواروں کو وصول کرتا ہے اور انہیں رحمن (الرحمن) کے پاس اتارتا ہے، اور رحمن (الرحمن) اپنے نہایت شاندار عرش پر ہے، وہ جانتا ہے کہ اس کے کلمات کا مجموعہ عالم کی کس عین میں ظاہر ہو گا، اور یہی وہ ہے جس کی طرف ہم نے اپنے اس قول میں اشارہ کیا ہے:\n\nقرآن نے جانا کہ وہ کیسے نازل ہو،\nاس کا نام رحمن (الرحمن) ہے جب انہوں نے عمل کیا۔\nاس چیز کے ساتھ جو انہیں اس کی حکمت عطا کرتی ہے،\nاور وہ (ذات حق - الحق) ہی عامل ہے اور وہ ہی عمل ہے۔\nپس اللہ کے مرد (رجال اللہ) قدیم سے سبقت لے گئے،\nاور انہوں نے اس (ذات حق - الحق) پر بھروسہ کیا۔\nپس وہی مطلوب ہیں نہ کہ کوئی اور،\nپس ان کے ذریعے، ان میں سے، وہ اس تک پہنچے۔\n\nپس اس کا قول: \"الرَّحْمَنُ عَلَّمَ الْقُرْآنَ\" (رحمن نے قرآن سکھایا) نے قرآن کو قائم کیا، پھر فرمایا: \"خَلَقَ الْإِنْسَانَ عَلَّمَهُ الْبَيَانَ\" (انسان کو پیدا کیا، اسے بیان سکھایا)۔ پس قرآن اس پر نازل ہوتا ہے تاکہ وہ اس سے اس بیان کے ذریعے ترجمہ کرے جو حق (الحق) نے اسے سکھایا، جسے اس انسان کے سوا کسی نے قبول نہیں کیا۔ پس قرآن کے لیے تمیز کا علم تھا، لہٰذا اس نے جانا کہ عالم میں اس کے نزول کا محل کہاں ہے، پس وہ محمد صلی اللہ علیہ وسلم کے قلب پر نازل ہوا: \"نَزَلَ بِهِ الرُّوحُ الْأَمِينُ\" (اسے روح الامین لے کر نازل ہوا)۔ پھر وہ قیامت تک ان کی امت کے قلوب پر نازل ہوتا رہے گا۔ پس قلوب میں اس کا نزول نیا ہے جو پرانا نہیں ہوتا، پس وہ دائمی وحی ہے۔ پس رسول صلی اللہ علیہ وسلم کے لیے اس میں اولیت ہے، اور انسانوں کے کانوں تک پہنچانا اور انسانوں سے ابتداء کرنا ہے۔ پس قرآن حق (الحق) اور انسان کے درمیان برزخ بن گیا، اور وہ ان کے قلب میں ایک ایسی صورت پر ظاہر ہوا جس پر وہ ان کی زبان میں ظاہر نہیں ہوا۔ کیونکہ اللہ نے ہر مقام کے لیے ایک ایسا حکم مقرر کیا ہے جو کسی اور کے لیے نہیں ہوتا۔ اور وہ قلب میں احدی العین کے طور پر ظاہر ہوا، پس خیال نے اسے جسم دیا اور اسے تقسیم کیا، پھر زبان نے اسے لے لیا اور اسے حرف اور آواز والا بنا دیا، اور اس کے ذریعے کانوں کی سماعت کو مقید کر دیا۔ اور اس نے واضح کیا کہ وہ اللہ کی طرف سے ترجمان ہے نہ کہ رحمن (الرحمن) کی طرف سے، کیونکہ اس میں رحمت، قہر اور سلطان (غلبہ) شامل ہے۔ پس فرمایا: \"فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ\" (پس اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے)۔ پس رسول اللہ صلی اللہ علیہ وسلم نے اسے اپنی زبان سے آوازوں اور حروف کے ساتھ تلاوت کیا، جسے اعرابی نے ترجمہ کے دوران اپنے کان کی سماعت سے سنا۔ پس کلام بلا شک اللہ کا ہے، اور ترجمہ اس شخص کا ہے جو اسے بولتا ہے، خواہ وہ کوئی بھی ہو۔ پس اللہ کا کلام نزول کے وقت سے حروف اور آوازوں کے ساتھ تلاوت کیا جاتا رہے گا، یہاں تک کہ وہ سینوں سے اٹھا لیا جائے گا اور مصاحف سے مٹا دیا جائے گا۔ پس کوئی ترجمان باقی نہیں رہے گا جو قرآن کے نزول کو قبول کرے، پس وہ انسان باقی نہیں رہے گا جو صورت پر تخلیق کیا گیا تھا۔ پس جب انسان کے جسم کی صورت حیوانوں کے اجسام کی طرح باقی رہ جائے گی اور تجرید کے ذریعے صورتِ الٰہیہ زائل ہو جائے گی، تو \"نُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ\" (صور پھونکا جائے گا تو جو کوئی آسمانوں میں ہے اور جو کوئی زمین میں ہے سب بے ہوش ہو کر گر پڑیں گے)۔ قیامت کے دن تک، اور وہ ایسا ظہور ہے جس کی کوئی ضد نہیں ہے کہ خفاء اس کے مقابل آئے۔ پس کوئی عافیت والا ہو گا اور کوئی مبتلا، اس کے مطابق جو اس میں مقررہ مدت تک اسماء کا حکم ہو گا۔ پس وہ رحمت عام ہو جائے گی جو \"وَسِعَتْ كُلَّ شَيْءٍ\" (ہر چیز پر چھا گئی ہے)، اس رحمن (الرحمن) کی طرف سے جو عرش پر مستوی ہوا، پس نعمتیں عالم کو عام ہو جائیں گی اور اسماء کے احکام اضافات اور مناسبات کے ذریعے ظاہر ہوں گے نہ کہ تقابل کے ذریعے۔ پس معاملہ ان کے قول جیسا ہو گا کہ \"ابرار کی نیکیاں مقربین کی برائیاں ہیں\"۔ اور ادنیٰ کا نعیم اگر اعلیٰ کو اعلیٰ نعیم چکھنے کے بعد دیا جائے تو وہ اس کے فقدان کی وجہ سے عذاب میں ہو گا، نہ کہ ادنیٰ نعیم کے وجود کی وجہ سے، کیونکہ وہ اس پر راضی نہیں ہو گا۔ پس یہ مناسبت اور اضافت کا عذاب ہے، کیونکہ اسماء الٰہیہ کا حکم ہمیشہ باقی رہتا ہے۔ کیا آپ نے کسی اعلیٰ منزلت والے کو دیکھا ہے، جیسے کوئی سلطان، جسے دوسرے سلطان نے اس کی بادشاہت سے نکال دیا اور اسے اس کی بادشاہت سے کم بادشاہت کا والی بنا دیا، جس میں وہ حکم دیتا اور منع کرتا ہے؟ لیکن جب آپ اسے اس چیز سے منسوب کرتے ہیں جو وہ پہلے تھا، تو آپ اسے آزمائش (البلاء) والا پاتے ہیں، باوجود اس کے کہ وہ مقام موجود ہے، اس حیثیت سے کہ وہ ولایت اور حکم و نہی کے ساتھ حکمرانی ہے۔ لیکن وہ جانتا ہے کہ یہ منزلت پہلی منزلت کے مقابلے میں اس شخص کے حق میں عذاب ہے جو پہلی منزلت کو اپنے دل میں حاضر رکھتا ہے۔ پس یہ مقدار آخرت میں اسماء کے حکم میں سے باقی رہے گی، کیونکہ ان کا وجود سے اٹھا لینا محال ہے، اس لیے کہ انہیں مسمیٰ کے بقا کے ساتھ بقائے الٰہی (البقاء) حاصل ہے۔\n\n[ظہور کا دو اقسام میں منقسم ہونا]\n\nپھر جان لو کہ جس ظہور کے بارے میں ہم بات کر رہے ہیں، اس میں ظاہر ہونے والا دو اقسام میں منقسم ہوتا ہے: ایک قسم وہ ہے جس کے لیے خاص طور پر اس کا ظہور ہے، اور اس کے لیے حق (الحق) کی جانب سے کوئی ایسا امر نہیں ہے جس پر اس کا ظہور انحصار کرے۔ اور دوسری قسم وہ ہے جس کے لیے حق (الحق) کی جانب سے ایک ایسا امر ہوتا ہے جس پر وہ انحصار کرتا ہے، اور یہ صرف انسان کامل (الإنسان الکامل) کے لیے خاص ہے۔ پس اس کے لیے ظہور اور انحصار دونوں ہیں، کیونکہ صورتِ الٰہیہ اسے جہاں بھی ہو محفوظ رکھتی ہے۔ اور انسان کامل (الإنسان الکامل) کے علاوہ، انسان، حیوان، نباتات، افلاک اور ملائکہ وغیرہ میں سے جو بھی ہے، اس کے لیے ظہور ہے۔ پس یہ سب نعمتیں ہیں جنہیں حق (الحق) نے ظاہر کیا تاکہ انسان کامل (الإنسان الکامل) ان سے لطف اندوز ہو۔ پس ان کے لیے ظہور تو ہے لیکن انحصار نہیں ہے، کیونکہ وہ اپنی اعیان کے علاوہ کسی اور کے لیے مقصود ہیں۔ اور انسان کامل (الإنسان الکامل) اپنی عین کے لیے مقصود ہے، کیونکہ وہ صورتِ الٰہیہ کا مظہر ہے، اور وہ (انسان کامل) ظاہر اور باطن ہے۔ پس جو عین ظاہر ہوئی وہ اس عین کے علاوہ نہیں ہے جو باطن ہوئی، پس سمجھو۔ پس وہ اللہ کے بقا (البقاء) سے باقی رہنے والا ہے، اور اس کے علاوہ جو کچھ ہے وہ اللہ کے باقی رکھنے (إبقاء) سے باقی رہنے والا ہے۔ اور جو چیز ابقاء سے ہے اس کا حکم اس چیز کے حکم سے مختلف ہے جو بقا (البقاء) سے ہے۔ پس جو بقا (البقاء) سے ہے، اس کے لیے عین کا دوام ہے، اور جو ابقاء سے ہے، اس کے لیے امثال کا دوام ہے نہ کہ عین کا دوام، تاکہ نعمت پانے والا ہمیشہ نعمت پاتا رہے اور نعمتیں اس پر دائمی اور مسلسل آتی رہیں۔ اور اللہ نے ہر چیز کے دو جوڑے (زوجین) صرف اس لیے پیدا کیے تاکہ عالم کو انسان کامل (الإنسان الکامل) کی نشأت کی فضیلت سے اللہ کی معرفت (المعرفۃ) حاصل ہو، تاکہ یہ معلوم ہو جائے کہ اس کی فضیلت جعلیت (بناوٹ) سے نہیں ہے۔ کیونکہ جو انسان کامل (الإنسان الکامل) ہے، اس کے ذریعے اس ذات کا ازدواج ظاہر ہوا جو اپنی ذات کے لیے ازدواج قبول نہیں کرتی، اور جو جعلیت سے نہیں ہے، پس وجود نے انسان کامل (الإنسان الکامل) کو شامل کر لیا جو صورتِ حق (الحق) پر ظاہر ہے۔ پس صورت کے لیے صورت کے ذریعے دو جوڑے بن گئے۔ پس آدم کو اس کی صورت پر پیدا کیا گیا، تو وجود میں دو مماثل صورتیں ظاہر ہوئیں، جیسے آئینے میں دیکھنے والے کی صورت، جو نہ تو عین اس کی ذات ہے اور نہ ہی اس کے غیر ہے۔ لیکن صیقل شدہ جسم کی حقیقت، دیکھنے والے کی نظر کے ساتھ مل کر، اس صورت کو ظاہر کرتی ہے جو ظاہر ہوئی، اور اسی وجہ سے وہ آئینے کے اختلاف سے مختلف ہوتی ہے نہ کہ دیکھنے والے سے۔ پس بڑی صورت میں حکم مجلیٰ (جس میں ظہور ہوا) کی حضرۃ کے لیے ہے نہ کہ متجلی (ظہور کرنے والے) کے لیے۔ اسی طرح انسانی صورت، حضرۃِ امکان میں جب اس نے صورتِ الٰہیہ کو قبول کیا تو وہ متجلی کے حکم پر تمام وجوہ سے ظاہر نہیں ہوئی۔ پس مجلیٰ کی حضرۃ، جو کہ امکان ہے، نے اس پر حکم لگایا، جو واجب الوجود لنفسہ کی حضرۃ کے حکم کے خلاف ہے۔ پس وہ مقدار اور شکل ظاہر ہوئی جسے واجب (الواجب) قبول نہیں کرتا۔ اور وہ (واجب) اس آئینے میں دیکھنے والا ہے، پس وہ اپنی تمام حقائق کے لحاظ سے وہ ہی ہے، اور اپنی مقدار اور شکل کے لحاظ سے وہ وہ نہیں ہے۔ بلکہ یہ اس میں حضرۃِ امکان کا اثر ہے، جو آئینے میں اس کی اپنی شکل کے تنوع اور بڑے یا چھوٹے ہونے کی مقدار ہے۔ اور چونکہ صورت کے ساتھ ظاہر ہونے والا صرف دیکھنے والے کی نظر کی حالت میں ہوتا ہے جو کہ متجلی ہے، اس لیے صورت کو محلِ ظہور اور نظر کی طرف منسوب کیا گیا، پس ظاہر ہونے والی صورت محل اور ناظر کے درمیان برزخی تھی۔ اور ان دونوں میں سے ہر ایک کا اس میں اثر ہے: \"يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ\" (ان دونوں سے موتی نکلتے ہیں) اور یہ وہ جوہر ہے جو بڑا ہو، \"وَالْمَرْجَانُ\" (اور مرجان) اور یہ وہ ہے جو اس سے چھوٹا ہو، اور یہ حضرۃ کا اثر ہے نہ کہ ناظر کا اثر۔ پس انسان کامل (الإنسان الکامل) کے ظہور کی زوجیت کے بارے میں فرمایا: \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثال کوئی چیز نہیں)، یعنی اس کی مثال جیسا کوئی چیز نہیں، یعنی جو اپنی صورت پر موجود ہونے کی وجہ سے اس کی مثال ہے، وہ مثال قبول نہیں کرتا، یا صورتِ الٰہیہ پر موجود مثال کو قبول نہیں کرتا۔ پس پہلی صورت پر، حق (الحق) سے تمام وجوہ سے مثلیت کی نفی کی گئی، کیونکہ جس محل میں ظہور ہوا اس نے صورتِ کائنہ میں شکل اور مقدار کا اثر ڈالا، جسے متجلی اپنی ذات میں جس حال پر ہے اس لحاظ سے قبول نہیں کرتا، اگرچہ وہ اس کے ذریعے ظاہر ہوا، تو یہ ممکن کی عین کا حکم ہے اس کے وجود میں۔ اور دوسری صورت پر، اس صورت سے مثلیت کی نفی کی گئی جو ظاہر ہوئی، پس عالم کی کوئی چیز مماثلت کی تمام وجوہ سے اس کے مماثل نہیں ہوئی۔ پس جب صورت سے دو جوڑے تھے، تو یہ جعلیت سے تھا، \"مِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ\" (ہم نے ہر چیز کے دو جوڑے بنائے)، کیونکہ اصل زوجیت سے پہلے تھی، پس اس کا حکم فرع میں ظاہر ہوا، لیکن اس کا حکم اصل میں اس کے حکم سے مختلف ہے جو فرع میں ہے۔ اور یہ اس منزل کے مسائل میں سے ایک مسئلہ ہے۔ پس ہم ان علوم کا ذکر کرتے ہیں جو اس میں شامل ہیں، جیسا کہ ہم نے اس کتاب کی دیگر منازل کے لیے ذکر کیا ہے۔\n\nان میں سے: اسماء کے مراتب کا علم، قرآن میں فہم کا علم، ہر چیز کے نطق کا علم اور اپنے بارے میں بیان کرنے میں اس کے مراتب کا علم، عدد کا علم، عالم کا ان صفات اور مراتب میں اشتراک کا علم جن میں وہ شریک ہے، عوالم کے درمیان فرق کا علم، اور مقامات اور زمانوں کے اختلاف کی وجہ سے احکامِ عدل کا اختلاف۔ پس جو ایک شریعت میں حق ہے وہ دوسری شریعت میں عارضی نسخ کے ذریعے باطل ہو جاتا ہے، اور اس کی حقیقت پر ایمان لانا واجب ہے اور اس کے نسخ پر بھی ایمان لانا واجب ہے۔ اور حق (الحق) سے انحراف اور حق (الحق) کی طرف رجوع کا علم، اور اس سے متعلقہ مذمت اور تعریف کا علم۔ اور مولدات (پیدا کرنے والی چیزوں) کا علم جو مائیں ہیں، کہ وہ عالم میں کیوں رکھی گئیں اور اشیاء کی اعیان بغیر ماؤں اور باپوں کے بیٹے ہوئے کیوں ظاہر نہیں ہوئیں، اور وہ کیا ہے جو مائیں اٹھاتی ہیں جس میں بیٹوں کی بھلائی ہے۔ اور ظاہری اور باطنی نعمتوں کے تقرر کا علم، اور یہ کہ وہ کفر سے کیوں زائل نہیں ہوتیں اور شکر سے کیوں بڑھتی ہیں، اور جن و انس کی نشأت کا علم، حیوانات کے علاوہ۔ اور ستر اور ظہور (التجلی) کا علم، جس کی وجہ سے اس عالم سے زیادہ حسین کوئی چیز امکان میں نہیں تھی، کیونکہ یہ تمام مراتب کو شامل ہے، پس امکان میں صرف اس کی مثالیں باقی ہیں، اصولوں کو محفوظ رکھنے والے وجودی کمال میں اس سے زیادہ کچھ نہیں۔ اور اشیاء کے درمیان اور معقول و محسوس میں ہر دو چیزوں کے درمیان فواصل کا علم، جیسے سایہ اور دھوپ کے درمیان حد فاصل، کہ یہ فواصل کس چیز کی طرف لوٹتے ہیں؟ کیا یہ مفصولین کی اعیان پر زائد کسی امر کی وجہ سے ہیں یا نہیں؟ اور حروفِ وجود میں شامل معانی کا علم، اور علامات کا علم کہ وہ کس حیثیت سے علامات ہیں، اور فنا (الفناء) اور بقا (البقاء) کا علم، اور حق (الحق) کے ان افعال کا علم جو صرف حال میں ظاہر ہوتے ہیں۔ اور اس چیز کی نسبت کا علم جسے عقل حق (الحق) سے منسوب کرنے سے پاک قرار دیتی ہے، مگر وہ حق (الحق) کی طرف منسوب ہے۔ اور سرادقِ الٰہی کا علم، اور اس میں موجود دروازوں کا علم، اور وہ کیا ہے جو ان دروازوں کو ان لوگوں کے لیے کھولتا ہے جو ان سے باہر نکلنا چاہتے ہیں، اور وہ کیوں نکلتے ہیں، اور جب وہ نکلتے ہیں تو کیا مشاہدہ (الشہود) کرتے ہیں، اور وہ کیا ہے جو انہیں نکالتا ہے۔ اور عقاب اور عذاب کا علم، اور انہیں عقاب اور عذاب کیوں کہا جاتا ہے۔ اور اس مقام کا علم جس کی طرف ملأ اعلیٰ نہیں بلکہ ملأ اوسط لوٹتا ہے۔ اور گونگے پن اور عالم سے خاموشی کا علم، اور اس کا سبب کیا ہے۔ اور علامات کا علم، کہ کیا وہ متکلم کی طرف سے کلام اور عبارت کی جگہ لے سکتی ہیں یا نہیں، جیسے معجزات اور وہ نطق جو قرائنِ احوال سے معلوم ہوتا ہے، اگرچہ وہاں حروف کی ترتیب اور کلمات کے اظہار سے کوئی عبارت نہ ہو۔ اور ان احکام کا علم جو علامات اشیاء میں دیتی ہیں، اور اشیاء کا اشیاء کے درمیان تردد کا علم، اور مقامات اور احوال کے نتائج کا علم، اور عالمِ اخروی میں شفعیت کے حکم کا علم۔ اور سبب سے مسبب تک حکم تک پہنچانے والے اسباب کا علم، اور اذواق اور افکار کا علم، اور اس چیز سے لذت حاصل کرنے کا علم جو حق (الحق) کی طرف سے انسان پر اس کی شفعیت کے ذریعے وارد ہوتی ہے، یعنی اس حیثیت سے کہ اس نے صورتِ الٰہیہ کو جوڑا، نہ کہ اس حیثیت سے کہ وہ عالم سے مشابہ ہوا۔ اور اس شخص کا علم جو اپنے ظہور (التجلی) کے ذریعے غیر کی طرف دیکھنے سے روکتا ہے، باوجود اس پر قدرت رکھنے کے، پس وہ فنا (الفناء) کی حالت میں نہیں ہوتا۔ اور غیرت اور صونِ الٰہی کے حجاب کے پیچھے سے اسرار کے مقام کا علم۔ اور تشبیہ اور تمثیل کا علم، اور امثال کے ذریعے بدلہ دینے کا علم، جیسے سونے کے بدلے سونا تفاضل کے ساتھ، حالانکہ یہ دنیا کے حکم میں سود ہے۔ اور تفاضل کا علم، اور اس چیز کا علم جس کے ذریعے امثال کے درمیان تفاضل واقع ہوتا ہے۔ اور درختوں میں اور اسراءات میں براقات، رفارف اور آشیانوں کے درمیان فرق کا علم۔ اور حق (الحق) کی قبض (تنگی) میں اس کی مباسطت (فراخی) کا علم، اور اس کی مباسطت میں اس کی قبض کا علم، اور ان احوال کے حامل شخص کے ہاں جو اضافہ ہوتا ہے۔ پس یہ ان امہاتِ علوم میں سے کچھ ہیں جو یہ منزل اپنے اندر رکھتی ہے، جن کے بیٹے تناسل کے ذریعے ان چیزوں تک شاخ در شاخ ہوتے ہیں جو آنات (لمحات) کے ساتھ ختم ہو جاتی ہیں۔ اور اللہ \"يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے)۔",
    "fa": "باب سیصد و بیست و نهم: در معرفت منزل علم نعمت‌ها (الآلاء) و فراغت تا بلا، و این منزل از حضرت محمدیه (الحضرة المحمدية) است.\n\nهمانا عوالم را پروردگار بندگان به واسطه رحمان ایجاد کرد، و برای رحمان موجود شدند.\nو به آنچه گفتم، آیات در محکم ذکر (قرآن) نطق کرده‌اند و رسالت‌ها شهادت داده‌اند.\nاگر درد و رنج (التألم) نبود، هیچ کس آن را انکار نمی‌کرد؛ و سوگند به پروردگار والا، نعمت‌هایش انکار نمی‌شد.\n\n[عالم به واسطه انسان و بر صورت او آفریده شده است]\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا خداوند آدم را بر صورت خود آفرید.»\nو عالم به واسطه انسان و بر صورت او آفریده شده است. پس اگر انسان از آن (عالم) مفقود شود، عالم بر این صورت نخواهد بود؛ و اگر عالم مفقود شود و انسان باقی بماند، بر صورت باقی خواهد بود. و خداوند متعال فرمود: «كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ» (هر جانی چشنده مرگ است). و این، عزل نفس از تدبیر این هیکل طبیعی است که در دنیا در حال اقامت در آن، تدبیرش می‌کرد. اما در مورد سخن خداوند متعال: «كُلُّ من عَلَيْها فانٍ ويَبْقى‏ وَجْهُ رَبِّكَ ذُو الْجَلالِ والْإِكْرامِ» (هر که بر آن [زمین] است فانی شونده است و وجه پروردگار با جلال و اکرام تو باقی می‌ماند)، نفرمود: «هر که در آن است فانی شونده است»؛ زیرا هنگامی که در آن باشد، به واسطه آن حفظ می‌شود، و هنگامی که بر آن باشد، از آن مجرد می‌شود. این امر دلالت می‌کند بر اینکه تجلی الهی (التجلی الإلهي) شامل همه کسانی می‌شود که بر آن هستند، زیرا فنا (الفناء) جز از تجلی الهی در غیر صورت کونی رخ نمی‌دهد؛ چرا که تجلی در صور مثال‌ها، اگر شناخته شود که عین صورت است، متجلی‌له به خشوع متصف می‌شود نه به فنا.\n\nاز رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) درباره کسوف (گرفتگی) سؤال شد، پس فرمود (صَلَّى اللهُ عَليهِ وسَلَّم): «خداوند بر هیچ چیزی تجلی نکرد مگر اینکه آن چیز برای او خاشع شد.»\nبه همین دلیل، ما به دلیل مناسبتی که بین حس و خیال وجود دارد، قائل به خشوع هستیم نه فنا (الفناء). و به همین جهت، خیال، حس مشترک نامیده می‌شود. و اگر (تجلی) شناخته نشود، خشوعی را به ارث نمی‌گذارد که به واسطه آن شناخته شود که اوست؛ اما ناگزیر خشوعی را در متجلی‌له به ارث می‌گذارد، ولی متجلی‌له نمی‌داند که اوست، به ویژه اهل افکار. و این از علم ظهور و خفا است. پس بدون شک ظاهر شد که اوست، و به واسطه تقیید در ظهورش پنهان ماند، پس دانسته نشد که اوست. بنابراین، اگر عارف کامل (الکامل) در معرفت به خدا در این نوع انسانی بداند که عین حق (الحق) همان است که به هستی (الوجود) وصف شده، و احکام اعیان عالم همان‌هایی هستند که در این عین ظاهر شده‌اند، یا او (حق) به واسطه آن‌ها ظاهر شده است، آنچه را دیده می‌شناسد. پس اگر آن موطن، اقرار را اقتضا کند، هنگامی که ادعا می‌شود که اوست، به آن اقرار می‌کند؛ و اگر موطن، انکار را اقتضا کند، عارف سکوت می‌کند و به انکار یا اقرار سخن نمی‌گوید، به دلیل علمش به آنچه حق در آن موطن اراده کرده است. و چون تجلی الهی (التجلی الإلهي) کسی را که بر صورت است بی‌نیاز می‌کند، دانستیم که عین از بین نمی‌رود، بلکه تجرید و خلع است، نه عزل از تدبیر مُلک، مگر اینکه ضمیر در «علیها» به زمین بازگردد؛ در این صورت، عزل از تدبیر الهی است که خداوند تدبیر آن را به آن واگذار کرده است. و این ظهور و خفا مخصوص اسم رب است نه غیر آن، و حکم آن به او بازمی‌گردد. و این حکم به سه بخش تقسیم می‌شود: در این حکم، یعنی ظهور و خفا، در دو موطن ظاهر می‌شود تا صاحب مُلک او را وکیل خود در آنچه مالک آن است قرار دهد، پس تصرف در آن برای او باشد و بنده در تمام احوال خود، از بیداری و خواب، آسوده باشد.\n\nو بخش دیگر این حکم آن است که در چهار موطن، در طول و عرض عالم، به دلیل وجود نعمت بر او، ظاهر شود، چنانکه فرمود: «وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظاهِرَةً وباطِنَةً» (و نعمت‌های خود را آشکار و پنهان بر شما کامل گردانید). پس این دو حکم برای او در طول عالم و مانند آن در عرض عالم وجود دارد. و طول عالم، عالم ارواح است و عرض آن، عالم صور اجسام. و ما صور اجسام گفتیم و اجسام نگفتیم، به دلیل اجسام متخیله؛ اگرچه در حضرت خود اجسام حقیقی هستند، اما نزد هر کسی جسم نیستند، به دلیل تغییری که به سرعت در آن‌ها رخ می‌دهد و به دلیل اینکه به عین ناظر بازمی‌گردند نه به خودشان. و اجسام حقیقی، اجسامی هستند که در ذات خود جسم‌اند، نه برای چشم ناظر؛ پس چه ناظر موجود باشد یا نباشد، آن‌ها در ذات خود اجسام هستند. و دیگری اجسامی هستند که در ذات خود جسم نیستند، چنانکه فرمود: «يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏» (از سحرشان به نظرش می‌آمد که آن‌ها می‌دوند). و آن‌ها در عین خود اجسامی هستند که حکم دویدن ندارند، پس در چشم موسی به صورت جسمی ظاهر شدند که دارای دویدن است، در حالی که امر در ذات خود چنین نیست. و بخش سوم این حکم از ظهور و خفا، در هفتصد و بیست موطن ظاهر می‌شود، و این نهایت چیزی است که عالم دنیا از اقتدار الهی می‌پذیرد، نه اینکه اقتدار (الهی) کوتاه یا عاجز باشد. پس این حکمِ قابل است، و وجود نیز این‌گونه واقع شده است. و در نظر فکری، خلاف آن جایز است، در حالی که از علم به آنچه در علم خدا سبقت گرفته، عاری است. پس امکانی نیست مگر با نظر مجرد به اکوان، در حالی که از علم خدا در آن‌ها عاری باشند؛ پس جز با وقوع شناخته نمی‌شوند. بنابراین، مواطن ظهور و خفا بین تجلی الهی (التجلی الإلهي) و استتار، در هفتصد و بیست و شش موطن با احکام مختلف محصور شدند.\n\nو بین هر دو موطن از ظهور و خفا، تجلی برزخی در قول او: «الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏» (رحمان بر عرش استیلا یافت) واقع می‌شود، تا این برزخ وجود دو طرف را حفظ کند و هیچ یک از دو طرف، حکم طرف دیگر را نبیند. و برزخ در هر دو طرف حکم دارد، پس غلیظ را لطیف می‌کند و لطیف را غلیظ می‌سازد. و برای آن در هر موطنی حکمی است که در موطن دیگر به آن ظاهر نمی‌شود، و این همان چیزی است که احکام عالم این سرا بر آن جاری می‌شود تا زمانی که خداوندِ وارث، «الْأَرْضَ ومن عَلَيْها» (زمین و هر که بر آن است) را به ارث ببرد. و از حقیقت این مواطن، عالم در دنیا به صورت ظهور (آنچه حس آن را درک می‌کند) و به صورت استتار (آنچه حس از معانی و آنچه از فرشتگان و جن از دیده‌ها پنهان است، درک نمی‌کند) ظاهر شد. خداوند متعال فرمود: «فَلا أُقْسِمُ بِما تُبْصِرُونَ» (پس سوگند به آنچه می‌بینید) که همان چیزی است که برای ما ظاهر شده، و «وما لا تُبْصِرُونَ» (و آنچه نمی‌بینید) که همان چیزی است که از ما پنهان مانده است. پس عالم بین ابد و ازل، برزخی است که به واسطه آن ابد از ازل جدا شد؛ اگر این برزخ نبود، حکمی برای آن دو ظاهر نمی‌شد و امر یکی بود و تمایزی نداشت، مانند حال بین گذشته و آینده؛ اگر حال (زمان کنونی) نبود، عدم گذشته از عدم آینده متمایز نمی‌شد. و این حکم برزخ است که همیشه در عالم باقی است و رابط بین دو مقدمه است؛ اگر آن نبود، علم صحیحی ظاهر نمی‌شد.\n\nسپس خداوند سبحان، اسم رحمان را ولیّ تمام مملکت قرار داد و اسم رب را سادن (کلیددار/خادم) اول عام قرار داد و کلید تکوین، تصریف، نزول و معراج را به او داد. پس اوست که سواران را می‌پذیرد و آن‌ها را نزد رحمان فرود می‌آورد. و رحمان بر عرش والای خود، مجموع کلمات خود را می‌داند که در کدام عین از عالم ظاهر می‌شود، و این همان است که با سخن خود به آن اشاره کردیم:\n\nرحمان نامش دانست که قرآن چگونه نازل می‌شود، هنگامی که عمل کردند\nبه آنچه حکمتش را به آنان می‌دهد، و اوست عامل و اوست عمل.\nپس مردان خدا از دیرباز سبقت گرفتند، و بر او (حق) به واسطه او (حق) تکیه کردند.\nپس مطلوب، آنانند نه غیر آنان، و به واسطه او (حق) از آنان به سوی او (حق) رسیدند.\n\nپس قول او: «الرَّحْمنُ عَلَّمَ الْقُرْآنَ» (رحمان قرآن را آموخت)، قرآن را نصب کرد. سپس فرمود: «خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ» (انسان را آفرید، به او بیان آموخت). پس قرآن بر او نازل می‌شود تا از آن ترجمه کند به آنچه حق از بیان به او آموخته است، بیانی که جز این انسان آن را نپذیرفت. پس قرآن علم تمییز داشت و دانست که محل نزولش در عالم کجاست. پس بر قلب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نازل شد: «نَزَلَ به الرُّوحُ الْأَمِينُ» (روح الامین آن را نازل کرد). سپس پیوسته بر قلب‌های امت او تا روز قیامت نازل می‌شود. پس نزول آن در قلب‌ها نو است و کهنه نمی‌شود، و آن وحی دائم است. فلذا رسول (صلوات الله علیه و سلامه) در این امر اولویت دارد و ابلاغ به گوش‌های بشر و آغاز از بشر از اوست. پس قرآن برزخی بین حق (الحق) و انسان شد و در قلب او بر صورتی ظاهر شد که بر زبانش به آن صورت ظاهر نشد؛ زیرا خداوند برای هر موطنی حکمی قرار داده که برای دیگری نیست. و در قلب، احدیّت عین ظاهر شد، پس خیال آن را جسمانی کرد و تقسیم نمود، و زبان آن را گرفت و دارای حرف و صوت ساخت و گوش‌های شنونده را به آن مقید کرد و آشکار ساخت که مترجم از جانب خداست نه از جانب رحمان، به دلیل آنچه در آن از رحمت، قهر و سلطنت وجود دارد. پس فرمود: «فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله» (پس او را پناه ده تا کلام خدا را بشنود). پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را با زبان خود به صورت اصوات و حروفی تلاوت کرد که اعرابی با گوش خود در حال ترجمه آن شنید. پس کلام بدون شک از آن خداست و ترجمه از آن کسی است که به آن سخن می‌گوید، هر که باشد. پس کلام خدا از زمان نزولش پیوسته به صورت حروف و اصوات تلاوت می‌شود تا زمانی که از سینه‌ها برداشته شود و از مصحف‌ها محو گردد، و دیگر مترجمی باقی نماند که نزول قرآن را بپذیرد، و در نتیجه انسان مخلوق بر صورت (الهی) باقی نماند.\n\nپس هنگامی که صورت جسم انسان مانند اجسام حیوان باقی بماند و صورت الهی با تجرید زائل شود، «نُفِخَ في الصُّورِ فَصَعِقَ من في السَّماواتِ ومن في الْأَرْضِ» (در صور دمیده می‌شود، پس هر که در آسمان‌ها و هر که در زمین است بیهوش می‌شود) تا روز نشور (برانگیختن). و آن، ظهوری است که ضدی ندارد تا خفا در مقابل آن قرار گیرد. پس برخی معاف و برخی مبتلا هستند، بر حسب آنچه از اسماء بر آن‌ها حکم می‌کند تا اجل مسمی. پس رحمتی که «وَسِعَتْ كُلَّ شَيْ‏ءٍ» (همه چیز را فرا گرفته است) از جانب رحمانی که «اسْتَوى‏ عَلَى الْعَرْشِ» (بر عرش استیلا یافت) فراگیر می‌شود. پس نعمت‌ها عالم را فرا می‌گیرد و احکام اسماء به واسطه اضافات و مناسبات ظاهر می‌شوند، نه به واسطه تقابل.\n\nپس امر مانند قول آن‌ها می‌شود که: «حسنات نیکان، سیئات مقربان است.» و نعمت دنیوی، اگر به کسی که نعمت والاتر را چشیده است داده شود، به دلیل فقدان آن (نعمت بالاتر) عذاب می‌کشد، نه به دلیل وجود نعمت دنیوی، چرا که به آن راضی نیست. پس این عذاب، عذاب مناسبت و اضافه است به دلیل بقای دائم حکم اسماء الهی. آیا دیده‌ای صاحب منزلت والایی مانند سلطان را که سلطان دیگری او را از مُلک خود بیرون کند و او را والی مُلکی پایین‌تر از مُلک خود سازد که در آن امر و نهی کند؟ اما اگر آن را به آنچه در ابتدا در آن بود اضافه کنی، او را دارای بلا می‌یابی، با وجود مقام از آن جهت که ولایت و حکمرانی با امر و نهی است. اما می‌داند که این منزلت، با نظر به منزلت اول، عذاب است در حق کسی که منزلت اول را در خاطر دارد. پس این مقدار از حکم اسماء در آخرت باقی می‌ماند، زیرا محال است که از هستی (الوجود) برداشته شود، چرا که بقای الهی (البقاء الإلهي) به واسطه بقای مسمّی برای آن‌ها وجود دارد.\n\n[ظهور به دو بخش تقسیم می‌شود]\n\nسپس بدان که ظهوری که ما در صدد آن هستیم، ظاهرشونده در آن به دو بخش تقسیم می‌شود: بخشی که ظهورش خاص اوست و از جانب حق (الحق) امری ندارد که ظهورش بر آن تکیه کند؛ و بخش دیگر که از جانب حق امری دارد که بر آن تکیه می‌کند، و این جز برای انسان کامل (الإنسان الکامل) نیست. زیرا او هم ظهور دارد و هم اعتماد، به دلیل اینکه صورت الهی او را هر جا که باشد حفظ می‌کند. و غیر انسان کامل، ظهورش از انسان، حیوان، نبات، افلاک، فرشتگان و غیره است. پس این همه نعمت‌هایی هستند که حق (الحق) آن‌ها را ظاهر کرده تا انسان کامل (الإنسان الکامل) به واسطه آن‌ها متنعم شود. پس آن‌ها ظهور دارند اما اعتماد ندارند، زیرا مقصود برای غیر اعیان خود هستند. و انسان کامل مقصود برای عین خود است، زیرا او مظهر صورت الهی است و اوست ظاهر و باطن. پس عین آنچه ظاهر شده، غیر از عین آنچه باطن است، نیست. پس بفهم. اوست که به بقای خدا باقی است، و غیر او به ابقای خدا باقی است. و حکم آنچه به ابقا است، با حکم آنچه به بقا است متفاوت است. پس آنچه به بقا است، دوام عین دارد، و آنچه به ابقا است، دوام امثال دارد نه دوام عین، تا متنعم پیوسته متنعم باشد و نعمت‌ها به طور دائم و مستمر بر او متوالی شوند.\n\nو خداوند از هر چیزی دو زوج نیافرید، مگر برای اینکه عالم به فضل نشأت انسان کامل (الإنسان الکامل) خدا را بشناسد، تا بداند که فضل او به جعل (قرار دادن) نیست. زیرا کسی که انسان کامل است، ازدواج کسی که به ذات خود ازدواج را نمی‌پذیرد، به واسطه او ظاهر شد. و آنچه به جعل نیست، وجود، انسان کامل ظاهر شده به صورت حق (الحق) را در بر گرفت. پس برای صورت، به واسطه صورت، دو زوج حاصل شد. پس آدم را بر صورت خود آفرید. پس در هستی (الوجود) دو صورت متماثل ظاهر شد، مانند صورت ناظر در آینه که نه عین اوست و نه غیر او، بلکه حقیقت جسم صیقلی همراه با نظر ناظر، آنچه را که از صورت ظاهر شد، به وجود آورد. و به همین دلیل، صورت با اختلاف آینه تغییر می‌کند نه با ناظر. پس حکم در صورت بزرگتر، از آنِ حضرت مجلّی است نه متجلّی. همچنین صورت انسانی در حضرت امکان (الإمکان)، هنگامی که صورت الهی را پذیرفت، از همه جهات بر حکم متجلی ظاهر نشد. پس حضرت مجلّی که همان امکان است، بر آن حکم کرد، برخلاف حکم حضرت واجب الوجود لنفسه. پس مقدار و شکلی ظاهر شد که واجب آن را نمی‌پذیرد، و او (واجب) ناظر در این آینه است. پس او از حیث تمام حقایقش، او اوست؛ و از حیث مقدار و شکلش، او او نیست. بلکه این (مقدار و شکل) از اثر حضرت امکان در اوست، که در آینه، تنوع شکل آن در ذات خود و مقدار آن در بزرگی و کوچکی است. و چون ظاهر شدن به صورت، جز در حال نظر ناظر که همان متجلی است، رخ نمی‌دهد، صورت به محل ظهور و به نظر نسبت داده شد. پس صورت ظاهر شده، برزخی بین محل و ناظر بود و هر یک از آن دو در آن اثری دارند: «يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ» (از آن دو لؤلؤ خارج می‌شود) که همان جوهر بزرگ است، و «وَالْمَرْجانُ» (و مرجان) که همان جوهر کوچک است. و این اثر حضرت (امکان) است نه اثر ناظر. پس در زوجیت ظهور انسان کامل (الإنسان الکامل) فرمود: «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست)، یعنی چیزی مانند مِثل او نیست. یعنی کسی که به واسطه وجودش بر صورت او، مِثل اوست، مِثل را نمی‌پذیرد، یا موجود بر صورت الهی، مثال را نمی‌پذیرد. پس بر اساس تفسیر اول، نفی مثلیت از حق (الحق) از همه جهات است، به دلیل تأثیری که محل تجلی در صورت ایجاد شده از شکل و مقدار می‌گذارد، که متجلی از حیث آنچه در ذات خود بر آن است، آن را نمی‌پذیرد، اگرچه به واسطه آن ظاهر می‌شود، و این حکم عین ممکن در وجود اوست. و بر اساس تفسیر دیگر، نفی مثلیت از صورتی است که ظاهر شده، پس هیچ چیز از عالم از همه جهات مماثلت، با آن مماثل نیست. پس چون از صورت، دو زوج حاصل شد، به جعل (قرار دادن) بود، از: «مِنْ كُلِّ شَيْ‏ءٍ خَلَقْنا زَوْجَيْنِ» (از هر چیزی دو زوج آفریدیم)، زیرا اصل قبل از زوجیت بود، پس حکم آن در فرع ظاهر شد، اما حکم آن در اصل با حکم آن در فرع متفاوت است.\n\nو این یک مسئله از مسائل این منزل است. پس بگذارید علومی را که در بر می‌گیرد، ذکر کنیم، همان‌طور که برای سایر منازل این کتاب ذکر کردیم. از جمله آن علوم: علم مراتب اسماء، علم فهم در قرآن، علم نطق هر چیز و مراتب آن در بیان از خود، علم عدد، علم اشتراک عالم در صفات و مراتبی که در آن‌ها مشترک است، علم تفاوت بین عوالم و اختلاف احکام عدل به دلیل اختلاف موطن‌ها و عصرها. پس آنچه در شریعتی حق است، در شریعت دیگر به واسطه نسخ عارض شده، باطل می‌شود، و ایمان به حقیقت آن واجب است و به نسخ آن نیز واجب است. و علم عدول از حق و به سوی حق و آنچه از ذم و حمد به آن مربوط می‌شود. و علم مولدات (زایشگاه‌ها) که همان مادران هستند، که چرا در عالم قرار داده شدند و اعیان اشیاء بدون اینکه فرزندان مادران و پدران باشند، ظاهر نشدند، و آنچه مادران حمل می‌کنند که در آن صلاح فرزندان است. و علم تثبیت نعمت‌های آشکار و پنهان و اینکه چرا با کفر از بین نمی‌روند و با شکر افزایش می‌یابند. و علم نشأت جن و انس، بدون غیر آن‌ها از حیوانات. و علم ستر و تجلی (التجلی) که به خاطر آن، در امکان، بدیع‌تر از این عالم وجود نداشت، به دلیل فراگیری همه مراتب، پس در امکان جز امثال آن باقی نماند، نه چیزی کامل‌تر از آن در کمال وجودی حافظ اصول. و علم فواصل بین اشیاء و بین هر دو چیز در معقول و محسوس، مانند خط فاصل بین سایه و خورشید، که چرا این فواصل بازمی‌گردند؟ آیا به امری زائد بر اعیان مفصولین است یا خیر؟ و علم آنچه حروف هستی (الوجود) از معانی در بر دارند. و علم اعلام (نشانه‌ها) بر آنچه که اعلام هستند. و علم فنا (الفناء) و بقا (البقاء). و علم آنچه حق (الحق) انجام می‌دهد و فقط در حال ظاهر می‌شود. و علم اضافه کردن آنچه عقل، اضافه کردنش را از حق تنزیه می‌کند، به حق. و علم سرادق الهی و درهایی که در آن است و آنچه آن درها را برای کسانی که می‌خواهند از آن‌ها خارج شوند، می‌گشاید، و چرا خارج می‌شوند و چه چیزی را مشاهده می‌کنند هنگامی که خارج می‌شوند و چه چیزی آن‌ها را خارج می‌کند. و علم عقاب و عذاب و اینکه چرا عقاب و عذاب نامیده شده است. و علم آنچه محل ملأ اعلی، نه بلکه ملأ اوسط، به آن بازمی‌گردد. و علم خفقان و سکوت از عالم و سبب آن. و علم علامات، که آیا جای کلام و عبارت متکلم را می‌گیرند یا خیر، مانند معجزات و نطق معلوم از قرائن احوال، حتی اگر عبارتی با نظم حروف و اظهار کلمات وجود نداشته باشد. و علم آنچه علامات در اشیاء از احکام می‌دهند. و علم تردد اشیاء بین اشیاء. و علم نتایج مقامات و احوال. و علم حکم شفعیت (زوجیت) در عالم اخروی. و علم اسباب رساننده به حکم، از سبب تا مسبب. و علم اذواق و افکار. و علم التذاذ به آنچه از طریق شفعیتش از حق بر انسان وارد می‌شود، یعنی از حیث زوجیت صورت الهی، نه از حیث شباهت به عالم. و علم کسی که با تجلی خود، نظر به غیر خود را منع می‌کند، با وجود قدرت بر آن، پس در حال فنا (الفناء) نیست. و علم مقام اسرار از پشت حجاب غیرت و صیانت الهی. و علم تشبیه و تمثیل. و علم مجازات به امثال، مانند طلا در برابر طلا با تفاضل، در حالی که در حکم دنیا ربا است. و علم مفاضله (برتری دادن). و علم به اینکه مفاضله بین امثال به چه چیزی واقع می‌شود. و علم تفاوت بین براقات (برق‌ها)، رفارف (پرده‌ها) و اوکار (آشیانه‌ها) در درختان و در اسراءها (سفرهای شبانه). و علم مباسطه (گشاده‌رویی) حق در قبض او و قبض او در مباسطه‌اش، و آنچه از زیادی نزد صاحب این احوال رخ می‌دهد. پس این بخشی از علومی است که این منزل در بر دارد، از امهات علوم که فرزندان آن‌ها با تناسل تا بی‌نهایت با آنات (لحظات) متفرع می‌شوند. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}