{
  "id": 418,
  "title": {
    "ar": "الباب الثامن عشر وأربعمائة في معرفة منازلة من لم يفهم لا يوصل إليه شي‏ء",
    "en": "Chapter Four Hundred and Eighteen: Concerning the Gnosis (معرفة) of the Stations (منازلة) of the one who, lacking comprehension, nothing can be conveyed to him.",
    "ur": "باب چار سو اٹھارہ: ان مقامات کے عرفان میں جو اس شخص کے لیے ہیں جو فہم نہیں رکھتا اور جس تک کوئی شے نہیں پہنچتی۔",
    "fa": "باب چهارصد و هجدهم در معرفت منازل کسی که اگر نفهمد، چیزی به او نمی‌رسد."
  },
  "content": {
    "ar": "## «الباب الثامن عشر وأربعمائة في معرفة منازلة من لم يفهم لا يوصل إليه شي‏ء»\n> من يفهم الأمر فذاك الذي *** خاطبه الرحمن من كل عين‏\n\n\n> وهو الذي دار عليه الورى *** وهو الذي في حكمه كل أين‏\n\n\n> إن إياسا خص من بأقل *** لما حوته حكمة القبضتين‏\n\n\n> قد أوضح الله لنا حكمه *** في كل ما في الكون من فرقتين‏\n\n\n> والضد لا يعرفه ضده *** والحق معلوم لنا دون مين‏\n\n\n> قد ثبت المثل له وانتفى *** عني ذاك المثل من بعد بين‏\n\n\nقال الله تعالى وقالُوا قُلُوبُنا في أَكِنَّةٍ مِمَّا تَدْعُونا إِلَيْهِ‏\n\n\n### [الكلام ما هو]\n\n\nاعلم أن الكلام على قسمين كلام في مواد تسمى حروفا وهو على قسمين إما مرقومة أعني الحروف وتسمى كتابا أو متلفظا بها وتسمى قولا وكلاما والنوع الثاني كلام ليس في مواد فذاك الكلام الذي لا يكون في مواد يعلم ولا يقال فيه يفهم فيتعلق به العلم من السامع الذي لا يسمع بآلة بل يسمع بحق مجرد عن الآلة كما إذا كان الكلام في غير مادة فلا يسمع إلا بما يناسبه والذي في المادة يتعلق به الفهم وهو تعلق خاص في العلم فإذا علم السامع اللفظة من اللافظ بها أو يرى الكتابة فإن علم مراد المتكلم في تلك الكلمة مع تضمنها في الاصطلاح معاني كثيرة خلاف مراد المتكلم بها فذلك الفهم وإن لم يعلم مراد المتكلم من تلك الكلمة على التفصيل واحتمل عنده فيها وجوه كثيرة مما تدل عليه تلك الكلمة ولا يعلم على التعيين مراد المتكلم من تلك الوجوه ولأهل أرادها كلها أو أراد وجها واحدا أو ما كان فمع هذا العلم بمدلول تلك الكلمة لا يقال فيه إنه أعطى الفهم فيها وإنما أعطى العلم بمدلولاتها كلها لعلمه بالاصطلاح لأن المتكلم بها عند السامع الغالب عليه أمران الواحد القصور عن معرفة مدلولات تلك الكلمة في اللسان والأمر الآخر أنه وإن عرف جميع مدلولاتها فإنه لا يتكلم بها إلا لمعنى تقتضيه قرينة الحال فالذي يفهم مراده بها فذلك الذي أوتي الفهم فيها ومن لم يعلم ذلك فما فهم فكان المتكلم ما أوصل إليه شيئا في كلامه ذلك وأما كلام الله إذا نزل بلسان قوم فاختلف أهل ذلك اللسان في الفهم عن الله ما أراده بتلك الكلمة أو الكلمات مع اختلاف مدلولاتها فكل واحد منهم وإن اختلفوا فقد فهم عن الله ما أراده فإنه عالم بجميع الوجوه تعالى وما من وجه إلا وهو مقصود لله تعالى بالنسبة إلى هذا الشخص المعين ما لم يخرج من اللسان فإن خرج من اللسان فلا فهم ولا علم وكذلك أصحاب الأخذ بالإشارات فإن إدراكهم لذلك في باب الإشارات في كلام الله تعالى خاصة فهم فيه لأنه مقصود لله تعالى في حق هذا المشار إليه بذلك الكلام وكلام المخلوق ما له هذه المنزلة فمن أوتي الفهم عن الله من كل وجه فقد أوتي الحكمة وفصل الخطاب وهو تفصيل الوجوه والمرادات في تلك الكلمة ومن أوتي الحكمة فَقَدْ أُوتِيَ خَيْراً كَثِيراً فكثره لما فيها من الوجوه فمن كان قلبه في كن أو كان عليه قفل أو كان أعمى البصيرة أو كان صاديا أو كان على قلبه ران فإن الله قد حال بينه وبين الفهم عن الله تعالى وإن تأوله ولهذا يتخذ آيات الله هزوا ودينه لهوا ولعبا لعدم فهمه عن الله ما خاطب به عباده فلهذا قال من لم يفهم لم يوصل إليه شي‏ء فأما الران فهو صدأ وطخاء وليس إلا ما تجلى في مرآة القلب من صور ما لم يدع الله إلى رؤيتها وجلاؤها من ذلك بالذكر والتلاوة وأما الكن فهو كالمقصورات في الخيام فهو في بيت الطبيعة مشغول بأمه ما عنده خبر بأبيه الذي هو روح الله فلا يزال في ظلمة الكن وهي حجاب الطبيعة فهو في حجابين كن وظلمة فهو يسمع ولا يفهم كما قال الله فيهم ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ أي لا يفهمون وأما أن يكون في أذنيه وقر أو صمم فإن كان وقر فهو ثقل الأسباب الدنياوية التي تصرفه عن الآخرة وإن كان طخاء فهو قساوة قلبه إن يؤثر فيه قبول ما يخطر له حديث النفس من النظر والإصغاء إلى هذا الداعي الذي هو الشارع وهو قوله تعالى والْغَوْا فِيهِ لَعَلَّكُمْ تَغْلِبُونَ حتى لا يسمعوا دعاء فلا يرجعون ولا يعقلون لأنه بلسانهم خاطبهم صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَرْجِعُونَ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَعْقِلُونَ فَأَصَمَّهُمْ الله وأَعْمى‏ أَبْصارَهُمْ وختم على ألسنتهم فما تلفظوا بما دعاهم إليه أن يتلفظوا به وأما القفل فهو لأهل الاعتذار يوم القيامة يقولون نحن ما قفلنا على قلوبنا وإنما وجدناها مقفلا عليها وهذا من الجدال الذي قال الله عنهم فيه‏\nما ضَرَبُوهُ لَكَ إِلَّا جَدَلًا بَلْ هُمْ قَوْمٌ خَصِمُونَ ولم نعرف من أقفلها فرمنا الخروج فخفنا من فك الختم والطبع فبقينا ننتظر الذي أقفل عليها عسى يكون هو الذي يتولى فتحها فلم يكن بأيدينا في ذلك شي‏ء وكان منهم عمر بن الخطاب أعني من أهل الأقفال يقول الله تعالى أَمْ عَلى‏ قُلُوبٍ أَقْفالُها فلما تولى الله فتحه أسلم فشد الله به الإسلام وعضده رضي الله عنه وأرضاه فهذا قد ذكرنا سبب عدم الفهم عن الله تعالى موجزا على قدر الوقت والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 418: Concerning the Knowledge of the Station of Him Who Does Not Understand, to Whom Nothing is Conveyed\n\nHe who understands the matter, that is the one\nWhom the All-Merciful addresses from every eye.\n\nAnd he is the one around whom creation revolves,\nAnd he is the one in whose ruling is every 'where.'\n\nIndeed, despair singles out those with less,\nDue to what the wisdom of the Two Graspings encompasses.\n\nAllah has clarified His ruling for us\nRegarding everything in the cosmos concerning the two divisions.\n\nThe opposite does not know its opposite,\nBut the Real (الحق) is known to us without doubt.\n\nThe likeness was established for Him, and then negated;\nThat likeness was removed from me after clarification.\n\nAllah the Exalted said: <<وَقَالُوا قُلُوبُنَا فِي أَكِنَّةٍ مِمَّا تَدْعُونَا إِلَيْهِ>> (And they said: 'Our hearts are in coverings from that to which you invite us').\n\n### [What is Speech]\n\nKnow that Speech (الكلام) is of two types. [The first is] Speech existing in materials, which are called letters (حروفا). This is further divided into two: either written (meaning the letters), and called writing (كتابا), or articulated and called utterance (قولا) and discourse (كلاما).\n\nThe second type is Speech that is not in materials. That Speech which is not in materials is *known* (يعلم), and it is not said concerning it that it is *understood* (يفهم). Knowledge (العلم) is connected to it by the listener who does not hear through an instrument (آلة), but rather hears by a Reality (حق) stripped of the instrument. Just as when the Speech is without material, it is only heard by that which corresponds to it. As for that [Speech] which is in material, understanding (الفهم) is connected to it, and this is a specific connection within Knowledge.\n\nWhen the listener knows the word from the speaker, or sees the writing, if he knows the speaker's intended meaning (مراد المتكلم) in that word—even though the word conventionally (في الاصطلاح) contains many meanings contrary to the speaker's intention—that is understanding (الفهم). But if he does not know the speaker's intended meaning of that word in detail, and it holds many possible interpretations (وجوه كثيرة) for him—interpretations indicated by that word—and he does not know specifically which of those interpretations the speaker intended, whether he intended all of them, or only one, or whatever the case may be; despite this knowledge of the word's signification (مدلول تلك الكلمة), it is not said that he has been granted understanding concerning it. Rather, he has only been granted knowledge of all its significations due to his knowledge of convention (الاصطلاح). This is because the speaker of the word, in the view of the listener, is usually governed by two matters: First, the inability to know the significations of that word in the language; and second, even if he knows all its significations, the speaker only utters it for a meaning necessitated by the context (قرينة الحال). Thus, he who understands the speaker's intention is the one who has been granted understanding concerning it. And he who does not know that has not understood, and therefore the speaker has conveyed nothing to him in that discourse.\n\nAs for the Speech of Allah (كلام الله) when it is revealed in the language of a people, and the people of that language differ in understanding what Allah intended by that word or words, despite the difference in their significations: every single one of them, even though they differ, has understood what Allah intended. For He, the Exalted, is Knower of all interpretations, and there is no interpretation except that it is intended by Allah the Exalted in relation to that specific person, so long as it does not depart from the language [rules]. If it departs from the language, then there is neither understanding nor knowledge. Similarly, those who grasp by means of allusions (الإشارات): their realization of this in the realm of allusions, specifically in the Speech of Allah the Exalted, is understanding therein, because it is intended by Allah the Exalted for the person to whom that Speech alludes. The speech of a creature (كلام المخلوق) does not possess this station (المنزلة).\n\nTherefore, whoever is granted understanding from Allah in every aspect has been granted Wisdom (الحكمة) and decisive discourse (فصل الخطاب), which is the detailed explanation of the interpretations and intentions contained in that word. And whoever is granted Wisdom, <<فَقَدْ أُوتِيَ خَيْراً كَثِيراً>> (he has certainly been given abundant good). Its abundance is due to the interpretations it contains.\n\nThus, whoever has his heart in a covering (كن), or has a lock (قفل) upon it, or is blind of insight (أعمى البصيرة), or is thirsty (صاديا), or has rust (ران) upon his heart, then Allah has intervened between him and understanding from Allah the Exalted, even if he attempts interpretation. For this reason, he takes the signs of Allah (آيات الله) as mockery and His religion as diversion and play, due to his lack of understanding from Allah concerning what He addressed His servants with. This is why it was said: \"He who does not understand, nothing is conveyed to him.\"\n\nAs for the rust (الران), it is corrosion and obscurity (طخاء). It is nothing but the images that manifest in the mirror of the heart (مرآة القلب)—images which Allah did not call [the servant] to see. Its polishing from that is achieved through remembrance (الذكر) and recitation (التلاوة).\n\nAs for the covering (الكن), it is like the secluded chambers (المقصورات) in tents. He is in the house of nature (بيت الطبيعة), preoccupied with his mother, having no knowledge of his father, who is the Spirit of Allah (روح الله). He remains perpetually in the darkness of the covering, which is the veil of nature (حجاب الطبيعة). Thus, he is in two veils: covering and darkness. He hears but does not understand, as Allah said concerning them: <<وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ>> (And be not like those who say, 'We hear,' while they do not hear)—meaning, they do not understand.\n\nAs for having deafness (وقر) or obstruction (صمم) in his ears: if it is deafness, it is the heaviness of worldly causes (الأسباب الدنياوية) that distract him from the Hereafter. If it is obstruction, it is the hardness of his heart (قساوة قلبه) such that it is not affected by accepting what the self whispers to him regarding reflection and listening to this caller, who is the Lawgiver (الشارع). This is [related to] His saying, the Exalted: <<وَالْغَوْا فِيهِ لَعَلَّكُمْ تَغْلِبُونَ>> (And make noise therein, perhaps you will overcome), so that they do not hear the call. Thus, they neither return nor reason, even though He addressed them in their own language. <<صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ>> (Deaf, dumb, and blind—so they will not return). <<صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ>> (Deaf, dumb, and blind—so they do not reason). So Allah made them deaf and blinded their sight, and sealed their tongues, so they did not utter what He called them to utter.\n\nAs for the lock (القفل), it belongs to those who offer excuses on the Day of Resurrection. They will say: \"We did not lock our hearts; rather, we found them locked.\" This is part of the disputation concerning which Allah said about them: <<مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا بَلْ هُمْ قَوْمٌ خَصِمُونَ>> (They presented it to you only for argument. Rather, they are a contentious people). [They will continue:] \"And we did not know who locked them, so we sought to exit, but we feared breaking the seal (الختم) and the stamp (الطبع). So we remained waiting for the one who locked them, hoping he would be the one to undertake their opening. We had no power over that.\" Among them was Umar ibn al-Khattab—I mean, among the people of the locks. Allah the Exalted says: <<أَمْ عَلَى قُلُوبٍ أَقْفَالُهَا>> (Or are there locks upon [their] hearts?). When Allah undertook its opening, he submitted [to Islam], and Allah strengthened Islam through him and supported him, may Allah be pleased with him and grant him satisfaction.\n\nThus, we have briefly mentioned the reason for the lack of understanding from Allah the Exalted, commensurate with the time available. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو اٹھارہ: اس شخص کے مقام کی معرفت میں جسے سمجھ (فہم) حاصل نہ ہو تو اس تک کوئی شے نہیں پہنچتی۔\n\nجو شخص امر (حقیقت) کو سمجھتا ہے، وہی ہے\nجس سے رحمن نے ہر آنکھ (ہر تجلی) سے خطاب کیا۔\n\nاور وہی ہے جس کے گرد مخلوق گھومتی ہے\nاور وہی ہے جس کے حکم میں ہر جگہ (ہر 'کہاں') ہے۔\n\nبے شک، مایوسی نے اسے کم تر کر دیا\nکیونکہ وہ دو قبضوں (قبضتین) کی حکمت کو محیط نہ کر سکا۔\n\nاللہ نے ہمارے لیے اپنا حکم واضح کر دیا ہے\nہر اس چیز میں جو کائنات میں دو فرقوں (متضاد چیزوں) میں ہے۔\n\nاور ضد اپنی ضد کو نہیں پہچانتی\nاور حق (الحق) ہمیں بغیر کسی شک کے معلوم ہے۔\n\nاس کے لیے مثال ثابت ہو گئی اور وہ مثال\nواضح ہونے کے بعد مجھ سے زائل ہو گئی۔\n\nاللہ تعالیٰ نے فرمایا: اور وہ کہتے ہیں کہ جس چیز کی طرف آپ ہمیں بلا رہے ہیں، ہمارے دل اس سے پردوں (أَكِنَّةٍ) میں ہیں۔ (سورۃ فصلت، ۴۱:۵)\n\n### کلام کیا ہے؟\n\nجان لیجیے کہ کلام دو قسم کا ہے۔ ایک وہ کلام جو مواد میں ہوتا ہے جسے حروف کہا جاتا ہے، اور یہ بھی دو قسم کا ہے۔ یا تو وہ حروف لکھے ہوئے ہوں (مرقومہ) اور اسے کتاب کہا جاتا ہے، یا وہ حروف بولے گئے ہوں اور اسے قول اور کلام کہا جاتا ہے۔ دوسری قسم وہ کلام ہے جو مواد میں نہیں ہوتا۔ وہ کلام جو مواد میں نہیں ہوتا، وہ جانا جاتا ہے (یعلم)، اور اس کے بارے میں یہ نہیں کہا جاتا کہ وہ سمجھا جاتا ہے (یفہم)۔ پس اس سے علم (العلم) اس سننے والے کو حاصل ہوتا ہے جو کسی آلے کے ذریعے نہیں سنتا، بلکہ آلے سے مجرد حق (الحق) کے ذریعے سنتا ہے۔ جیسا کہ جب کلام غیر مادی ہو تو اسے صرف اسی چیز سے سنا جا سکتا ہے جو اس کے مناسب ہو۔ اور جو کلام مادہ میں ہوتا ہے، اس سے فہم (الفہم) متعلق ہوتا ہے، اور یہ علم (العلم) میں ایک خاص تعلق ہے۔\n\nپس جب سننے والا بولنے والے سے لفظ کو جانتا ہے یا تحریر کو دیکھتا ہے، اگر وہ اس کلمے میں متکلم کی مراد کو جان لے، حالانکہ اصطلاح میں اس کلمے میں بہت سے معانی شامل ہوتے ہیں جو متکلم کی مراد کے خلاف ہوں، تو یہ فہم (الفہم) ہے۔ اور اگر وہ اس کلمے سے متکلم کی مراد کو تفصیل سے نہ جان سکے، اور اس کے نزدیک اس میں بہت سے ایسے پہلو ہوں جن پر وہ کلمہ دلالت کرتا ہو، اور وہ تعین کے ساتھ یہ نہ جان سکے کہ متکلم کی مراد ان پہلوؤں میں سے کیا ہے، یا اس نے ان سب کا ارادہ کیا ہے یا صرف ایک پہلو کا، یا جو بھی ہو، تو اس کلمے کے مدلول کے اس علم کے باوجود یہ نہیں کہا جائے گا کہ اسے اس میں فہم عطا کیا گیا ہے، بلکہ اسے صرف اس کے تمام مدلولات کا علم عطا کیا گیا ہے کیونکہ وہ اصطلاح سے واقف ہے۔ کیونکہ سننے والے کے نزدیک، جو اس پر غالب ہوتا ہے، اس کلمے کو بولنے والے کے بارے میں دو باتیں ہیں: ایک یہ کہ وہ زبان میں اس کلمے کے مدلولات کی معرفت میں قاصر ہے، اور دوسری یہ کہ اگرچہ وہ اس کے تمام مدلولات کو جانتا ہو، لیکن وہ اسے صرف اسی معنی کے لیے بولتا ہے جس کا تقاضا قرینہ حال کرتا ہے۔ پس جو شخص اس سے اس کی مراد کو سمجھ لیتا ہے، وہی ہے جسے اس میں فہم عطا کیا گیا ہے۔ اور جو یہ نہیں جانتا، اس نے فہم حاصل نہیں کیا، لہٰذا متکلم نے اپنے اس کلام میں اس تک کوئی شے نہیں پہنچائی۔\n\nاور جہاں تک اللہ کے کلام کا تعلق ہے، جب وہ کسی قوم کی زبان میں نازل ہوتا ہے، اور اس زبان کے لوگ اس کلمے یا کلمات سے اللہ کی مراد کو سمجھنے میں اختلاف کرتے ہیں، باوجود اس کے کہ ان کے مدلولات مختلف ہیں، تو ان میں سے ہر ایک نے، اگرچہ وہ مختلف ہوئے، اللہ سے وہی سمجھا جو اس نے ارادہ کیا تھا۔ کیونکہ اللہ تعالیٰ تمام پہلوؤں کا عالم ہے، اور کوئی پہلو ایسا نہیں مگر وہ اس معین شخص کے اعتبار سے اللہ تعالیٰ کا مقصود ہے، جب تک کہ وہ زبان سے خارج نہ ہو۔ اگر وہ زبان سے خارج ہو جائے تو نہ فہم ہے اور نہ علم۔\n\nاسی طرح اشارات (الإشارات) سے اخذ کرنے والے بھی ہیں، کیونکہ اللہ تعالیٰ کے کلام میں اشارات کے باب میں ان کا ادراک اس میں فہم ہے، کیونکہ وہ اس کلام کے ذریعے اشارہ کیے گئے شخص کے حق میں اللہ تعالیٰ کا مقصود ہے۔ اور مخلوق کے کلام کو یہ منزلت حاصل نہیں ہے۔ پس جسے اللہ کی طرف سے ہر پہلو سے فہم عطا کیا گیا، اسے حکمت (الحکمۃ) اور فصل الخطاب (فیصلہ کن بات) عطا کی گئی، اور یہ اس کلمے میں پہلوؤں اور مرادات کی تفصیل ہے۔ اور جسے حکمت عطا کی گئی، تو اسے بہت زیادہ بھلائی (خيراً كثيراً) عطا کی گئی (سورۃ البقرۃ، ۲:۲۶۹)۔ پس اس کی کثرت ان پہلوؤں کی وجہ سے ہے جو اس میں موجود ہیں۔\n\nپس جس کا دل پردے (کن) میں ہو، یا اس پر قفل لگا ہو، یا وہ بصیرت کا اندھا ہو، یا وہ پیاسا ہو، یا اس کے دل پر زنگ (ران) لگا ہو، تو اللہ تعالیٰ نے اس کے اور اللہ کی طرف سے فہم (الفہم) کے درمیان رکاوٹ ڈال دی ہے، اگرچہ وہ اس کی تاویل ہی کیوں نہ کرے۔ اور اسی وجہ سے وہ اللہ کی آیات کا مذاق اڑاتا ہے اور اس کے دین کو کھیل اور تماشا بنا لیتا ہے، کیونکہ وہ اللہ کی طرف سے اس بات کو نہیں سمجھتا جس سے اس نے اپنے بندوں کو مخاطب کیا ہے۔ اسی لیے کہا گیا کہ جسے فہم حاصل نہ ہو، اس تک کوئی شے نہیں پہنچتی۔\n\nجہاں تک ران (الران) کا تعلق ہے، تو وہ زنگ اور دھندلاہٹ ہے، اور یہ کچھ نہیں مگر وہ صورتیں ہیں جو دل کے آئینے میں ان چیزوں کی صورت میں ظاہر ہوتی ہیں جن کے دیکھنے کی طرف اللہ نے دعوت نہیں دی۔ اور اس سے اس کی صفائی ذکر اور تلاوت کے ذریعے ہوتی ہے۔\n\nاور کن (الکن) کا معاملہ خیموں میں مقصورات (پردہ نشین عورتوں) جیسا ہے، پس وہ طبیعت کے گھر میں اپنی ماں (طبیعت) کے ساتھ مشغول ہے، اسے اپنے باپ (روح اللہ) کی کوئی خبر نہیں ہے۔ پس وہ ہمیشہ کن کی تاریکی میں رہتا ہے، اور یہ طبیعت کا حجاب ہے۔ پس وہ دو حجابوں میں ہے: کن اور تاریکی۔ وہ سنتا ہے مگر سمجھتا نہیں، جیسا کہ اللہ نے ان کے بارے میں فرمایا: اور ان لوگوں کی طرح نہ ہو جاؤ جو کہتے ہیں کہ ہم نے سنا، حالانکہ وہ نہیں سنتے (سورۃ الانفال، ۸:۲۱)۔ یعنی وہ نہیں سمجھتے۔\n\nاور جہاں تک اس کے کانوں میں بہرا پن (وقر) یا گونگا پن (صمم) ہونے کا تعلق ہے، اگر وہ وقر (بوجھ) ہے تو وہ دنیاوی اسباب کا بوجھ ہے جو اسے آخرت سے پھیر دیتا ہے۔ اور اگر وہ دھندلاہٹ (طخاء) ہے تو وہ اس کے دل کی سختی ہے کہ وہ اس بات کو قبول کرنے میں اثر انداز نہیں ہوتی جو اسے نفس کی بات سے خطرہ ہوتی ہے، یعنی اس داعی (شارع) کی طرف دیکھنے اور سننے سے جو اللہ کا قول ہے: اور اس میں شور مچاؤ تاکہ تم غالب آ جاؤ (سورۃ فصلت، ۴۱:۲۶)۔ تاکہ وہ دعوت نہ سنیں، پس وہ نہ رجوع کرتے ہیں اور نہ عقل کرتے ہیں، کیونکہ اللہ نے انہیں ان کی اپنی زبان میں مخاطب کیا: وہ بہرے، گونگے، اندھے ہیں، پس وہ رجوع نہیں کرتے (سورۃ البقرۃ، ۲:۱۸)۔ وہ بہرے، گونگے، اندھے ہیں، پس وہ عقل نہیں کرتے (سورۃ البقرۃ، ۲:۱۷۱)۔ پس اللہ نے انہیں بہرا کر دیا اور ان کی آنکھوں کو اندھا کر دیا، اور ان کی زبانوں پر مہر لگا دی، پس انہوں نے وہ بات نہیں کہی جس کے کہنے کی طرف انہیں بلایا گیا تھا۔\n\nاور جہاں تک قفل (القفل) کا تعلق ہے، تو یہ قیامت کے دن عذر پیش کرنے والوں کے لیے ہے، وہ کہیں گے: ہم نے اپنے دلوں پر قفل نہیں لگائے، بلکہ ہم نے انہیں مقفل پایا۔ اور یہ اس جھگڑے (الجدال) میں سے ہے جس کے بارے میں اللہ نے ان سے فرمایا: انہوں نے آپ کے لیے یہ مثال صرف جھگڑے کے طور پر بیان کی ہے، بلکہ وہ جھگڑالو لوگ ہیں (سورۃ الزخرف، ۴۳:۵۸)۔ اور ہم نہیں جانتے تھے کہ کس نے ان پر قفل لگایا، پس ہم نے باہر نکلنے کا ارادہ کیا تو مہر اور طبع (مہر بندی) کو کھولنے سے ڈر گئے، پس ہم اس کا انتظار کرتے رہے جس نے ان پر قفل لگایا تھا، شاید وہی اسے کھولنے کی ذمہ داری لے لے۔ پس اس بارے میں ہمارے اختیار میں کچھ نہ تھا۔ اور ان میں سے عمر بن خطاب رضی اللہ عنہ بھی تھے، میرا مطلب ہے اہل قفل میں سے۔ اللہ تعالیٰ فرماتا ہے: کیا ان دلوں پر ان کے قفل لگے ہوئے ہیں؟ (سورۃ محمد، ۴۷:۲۴)۔ پس جب اللہ نے اسے کھولنے کی ذمہ داری لی تو وہ اسلام لے آئے، اور اللہ نے ان کے ذریعے اسلام کو مضبوط کیا اور ان کی مدد فرمائی، اللہ ان سے راضی ہو اور انہیں خوش رکھے۔ پس ہم نے وقت کے مطابق اللہ کی طرف سے فہم (الفہم) نہ ہونے کا سبب مختصراً بیان کر دیا ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (سورۃ الاحزاب، ۳۳:۴)۔",
    "fa": "«باب چهارصد و هجدهم در شناخت جایگاه کسی که اگر نفهمد، چیزی به او نمی‌رسد»\n\nآن کس که امر را می‌فهمد، او کسی است که\nرحمان از هر چشمه‌ای (عین) با او سخن گفته است\n\nو اوست که مردمان بر گرد او می‌گردند\nو اوست که هر «کجا»یی در حکم اوست\n\nهمانا یأس، کسی را به کمترین اختصاص داد\nبه سبب حکمتی که دو قبضه (قبضتین) در بر داشت\n\nخداوند حکم خود را برای ما روشن ساخت\nدر هر آنچه در هستی (کون) از دو گروه (فرقتین) وجود دارد\n\nو ضد، ضد خود را نمی‌شناسد\nو حق (الحق) برای ما بدون شک معلوم است\n\nهمانا مَثَل برای او ثابت شد و آن مَثَل\nپس از آشکار شدن از من دور گشت\n\nخداوند متعال می‌فرماید: وَقَالُوا قُلُوبُنَا فِي أَكِنَّةٍ مِمَّا تَدْعُونَا إِلَيْهِ (و گفتند: دل‌های ما از آنچه ما را به سوی آن می‌خوانی در پوشش‌هایی (أكنة) است.)\n\n### [سخن (الكلام) چیست]\n\nبدان که سخن (الكلام) بر دو بخش است: سخنی که در مواد است و حروف نامیده می‌شود، و این خود بر دو قسم است: یا نگاشته شده است، یعنی حروف، و کتاب نامیده می‌شود؛ یا به زبان آورده شده است، و قول و کلام نامیده می‌شود. و نوع دوم، سخنی است که در مواد نیست. آن سخنی که در مواد نیست، دانسته می‌شود و گفته نمی‌شود که «فهمیده می‌شود». پس علم (العلم) از شنونده‌ای به آن تعلق می‌گیرد که با ابزار نمی‌شنود، بلکه با حق (الحق) مجرد از ابزار می‌شنود، همان‌گونه که اگر سخن در غیر ماده باشد، جز با آنچه مناسب آن است شنیده نمی‌شود.\n\nو آنچه در ماده است، فهم (الفهم) به آن تعلق می‌گیرد، و این تعلقی خاص در علم است. پس هنگامی که شنونده، لفظ را از گوینده آن می‌داند یا نوشته را می‌بیند، اگر مراد متکلم را در آن کلمه بداند، با وجود اینکه آن کلمه در اصطلاح معانی بسیاری را در بر دارد که خلاف مراد متکلم است، این همان فهم است. اما اگر مراد متکلم را از آن کلمه به تفصیل نداند و نزد او وجوه بسیاری محتمل باشد که آن کلمه بر آن‌ها دلالت می‌کند، و نداند که متکلم کدام یک از آن وجوه را به طور معین اراده کرده است، یا همه آن‌ها را خواسته است یا یک وجه را یا هر چه بوده است؛ با وجود این علم (العلم) به مدلول آن کلمه، گفته نمی‌شود که به او فهم (الفهم) در آن داده شده است. بلکه به او علم به تمام مدلول‌های آن داده شده است، به دلیل آگاهی‌اش از اصطلاح. زیرا متکلم نزد شنونده، غالباً تحت تأثیر دو امر است: اول، کوتاهی در شناخت مدلول‌های آن کلمه در زبان؛ و امر دیگر اینکه، اگرچه تمام مدلول‌های آن را بشناسد، اما جز برای معنایی که قرینه حال اقتضا می‌کند، آن را به زبان نمی‌آورد. پس کسی که مراد او را می‌فهمد، او کسی است که فهم (الفهم) در آن به او داده شده است. و کسی که آن را نداند، نفهمیده است، و گویی متکلم چیزی در آن سخن به او نرسانده است.\n\nاما سخن خداوند (كلام الله)، هنگامی که به زبان قومی نازل می‌شود، اهل آن زبان در فهم مراد خداوند از آن کلمه یا کلمات، با وجود اختلاف مدلول‌هایشان، اختلاف می‌کنند. هر یک از آنان، اگرچه اختلاف کرده‌اند، آنچه را که خداوند اراده کرده است، فهمیده‌اند؛ زیرا او (خداوند) به تمام وجوه داناست. و هیچ وجهی نیست مگر اینکه مقصود خداوند متعال است نسبت به این شخص معین، مادامی که از حدود زبان خارج نشود. اگر از حدود زبان خارج شود، نه فهمی هست و نه علمی. و همچنین اصحاب اخذ به اشارات، درکشان از آن در باب اشارات، به ویژه در کلام خداوند (كلام الله)، فهم (الفهم) محسوب می‌شود، زیرا مقصود خداوند متعال در حق این شخص اشاره شده با آن کلام است. اما کلام مخلوق این جایگاه را ندارد. پس کسی که فهم (الفهم) را از خداوند از هر وجهی دریافت کند، همانا حکمت (الحكمة) و فصل الخطاب (فصل الخطاب) به او داده شده است، و فصل الخطاب همان تفصیل وجوه و مرادات در آن کلمه است. و کسی که حکمت (الحكمة) به او داده شود، فَقَدْ أُوتِيَ خَيْراً كَثِيراً (همانا خیر بسیاری به او داده شده است). این کثرت به دلیل وجوهی است که در آن وجود دارد.\n\nپس کسی که دلش در پوشش (كن) باشد، یا بر آن قفلی باشد، یا بصیرتش کور باشد، یا تشنه باشد، یا بر دلش زنگار (ران) باشد، همانا خداوند میان او و فهم (الفهم) از خداوند متعال حائل شده است، حتی اگر آن را تأویل کند. به همین دلیل است که آیات خداوند را به تمسخر می‌گیرد و دین او را لهو و لعب می‌شمارد، به دلیل عدم فهم او از آنچه خداوند با بندگانش خطاب کرده است. از این رو گفته شد: کسی که نفهمد، چیزی به او نمی‌رسد.\n\nاما زنگار (الران)، همان زنگ و تیرگی است، و آن چیزی نیست جز صورتی که در آینه دل (القلب) تجلی (تجلی) کرده است و خداوند به دیدن آن دعوت نکرده است. و جلای آن از طریق ذکر و تلاوت است. و اما پوشش (الكن)، مانند زنان پرده‌نشین در خیمه‌هاست. او در خانه طبیعت مشغول مادرش است و از پدرش که روح خداست، خبری ندارد. پس پیوسته در تاریکی پوشش (الكن) است که همان حجاب طبیعت است. او در دو حجاب است: پوشش و تاریکی. پس می‌شنود ولی نمی‌فهمد، چنانکه خداوند درباره آنان فرمود: وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ (و مانند کسانی نباشید که گفتند شنیدیم، در حالی که نمی‌شنوند)، یعنی نمی‌فهمند.\n\nو اما اینکه در گوش‌هایشان سنگینی (وقر) یا کری (صمم) باشد: اگر سنگینی (وقر) باشد، سنگینی اسباب دنیوی است که او را از آخرت باز می‌دارد. و اگر تیرگی (طخاء) باشد، قساوت قلب اوست که پذیرش آنچه از حدیث نفس به او خطور می‌کند، از نظر کردن و گوش دادن به این دعوت‌کننده که همان شارع است، در او تأثیر نمی‌گذارد. و این همان قول خداوند متعال است: وَالْغَوْا فِيهِ لَعَلَّكُمْ تَغْلِبُونَ (و در آن لغو کنید، شاید پیروز شوید)، تا ندای دعوت را نشنوند. پس باز نمی‌گردند و تعقل نمی‌کنند، زیرا خداوند با زبان خودشان با آنان سخن گفته است: صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ (کرانند، گنگانند، کورانند، پس باز نمی‌گردند)؛ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ (کرانند، گنگانند، کورانند، پس تعقل نمی‌کنند). فَأَصَمَّهُمُ اللَّهُ وَأَعْمَى أَبْصَارَهُمْ (پس خداوند آنان را کر و چشمانشان را کور ساخت) و بر زبان‌هایشان مهر زد، پس آنچه را که خداوند آنان را به گفتن آن فراخوانده بود، به زبان نیاوردند.\n\nو اما قفل (القفل)، مخصوص اهل عذرخواهی در روز قیامت است که می‌گویند: ما بر دل‌هایمان قفل نزدیم، بلکه آن‌ها را قفل شده یافتیم. و این از همان جدالی است که خداوند درباره آنان فرمود: مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا بَلْ هُمْ قَوْمٌ خَصِمُونَ (آن را برای تو جز به جدال نزدند، بلکه آنان قومی ستیزه‌جو هستند). و ما ندانستیم چه کسی آن‌ها را قفل کرده است، پس قصد خروج کردیم، اما از شکستن مهر و طبع ترسیدیم. پس منتظر ماندیم تا کسی که آن‌ها را قفل کرده است، شاید خود متولی باز کردنشان شود. و در این باره چیزی در دست ما نبود. و عمر بن خطاب (رضی الله عنه) از جمله اهل قفل‌ها بود. خداوند متعال می‌فرماید: أَمْ عَلَى قُلُوبٍ أَقْفَالُهَا (آیا بر دل‌ها قفل‌های آن است؟). پس هنگامی که خداوند متولی گشودن آن شد، او اسلام آورد. و خداوند اسلام را به واسطه او تقویت کرد و یاری نمود، رضی الله عنه و ارضاه.\n\nاین بود آنچه به اختصار و به اندازه وقت، درباره سبب عدم فهم (الفهم) از خداوند متعال ذکر کردیم. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}