{
  "id": 43,
  "title": {
    "ar": "الباب الثالث والأربعون في معرفة جماعة من أقطاب الورعين وعامة ذلك المقام",
    "en": "Chapter Forty-Three: Concerning the Knowledge of a Group of the Poles (أقطاب) of the Scrupulous (الورعين) and the Generality of that Station (المقام).",
    "ur": "تینتالیسواں باب: پرہیزگاروں کے اقطاب (أقطاب) کی ایک جماعت کی معرفت (المعرفۃ) اور اس مقام (المقام) کی عمومی حالت کے بیان میں۔",
    "fa": "باب چهل و سوم در معرفت گروهی از اقطاب پرهیزگاران و عموم آن مقام"
  },
  "content": {
    "ar": "## (الباب الثالث والأربعون في معرفة جماعة من أقطاب الورعين وعامة ذلك المقام)\n\n\n> أنا ختم الولاية دون شك *** لورث الهاشمي مع المسيح‏\n\n\n> كما أنى أبو بكر عتيق *** أجاهد كل ذي جسم وروح‏\n\n\n> بأرماح مثقفة طوال *** وترجمة بقرآن فصيح‏\n\n\n> أشد على كتيبة كل عقل *** تنازعني على الوحي الصريح‏\n\n\n> لي الورع الذي يسمو اعتلاء *** على الأحوال بالنبإ الصحيح‏\n\n\n> وساعدني عليه رجال صدق *** من الورعين من أهل الفتوح‏\n\n\n> يوالون الوجوب وكل ندب *** ويستثنون سلطنة المبيح‏\n\n\n### [الورع واجتناب الشبهات‏]\n\n\nالكلام على الورع وأهله وتركه يرد في داخل الكتاب في ذكر المقامات والأحوال منه إن شاء الله تعالى والذي يتعلق بهذا الباب الكلام على معرفة طائفة من أقطابه وعموم مقامه فاعلم إن أبا عبد الله الحارث بن أسد المحاسبي كان من عامة هذا المقام وأبا يزيد البسطامي وشيخنا أبا مدين في زماننا كانا من خاصته فأعلى أقطاب الورعين اجتناب الاشتراك في‏\nإطلاق اللفظ إذ كان الورع اجتناب المحرمات وكل ما فيه شبهة من جانب المحرم فيجتنب لذلك الشبه وهو المعبر عنه بالشبهات أي الشي‏ء الذي له شبه بما جاء النص الصريح بتحريمه من كتاب أو سنة أو إجماع بالحال الذي يوجب له هذا الاسم مثل أكل لحم الخنزير لمن ليس له حال الاضطرار فهو عليه حرام فلهذا قلنا بالحال الذي يوجب له هذا الاسم كما أن المضطر ليس بمخاطب بالتحريم فأكل لحم الخنزير في حق من حاله الاضطرار هو له حلال بلا خلاف‏\n\n\n### [التحريم الذي لا يحل أبدا]\n\n\nولما كان التحريم معناه المنع من الالتباس به ورأوا أن لذلك أحوالا وأنه ما ثم في الوضع شي‏ء محرم لعينه لهذا قيده الشارع بالأحوال وقد انسحب عليه التحريم للحال فما هو محرم لعينه أولى بالاجتناب فلا بد من اجتنابه باطنا علما وقد يحل هذا المحرم لعينه في ظاهر الحال ما يلزمه وهذا هو التحريم الذي لا يحل أبدا من حيث معناه ولا يصح أن تجي‏ء آية شرعية تحله وهو الاتصاف بأوصاف الحق تعالى التي بها يكون إلها فواجب شرعا وعقلا اجتناب هذه الأسماء الإلهية معنى وإن أطلقت لفظا فينبغي أن لا تطلق لفظا على أحد إلا تلاوة فيكون الذي يطلقها تاليا حاكيا كما قال تعالى لَقَدْ جاءَكُمْ رَسُولٌ من أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ فسماه عزيزا رءوفا رحيما فنسميه بتسمية الله إياه ونعتقد أنه صلى الله عليه وسلم في نفسه مع ربه عبد ذليل خاشع أواه منيب فإطلاق الألفاظ التي تطلق على الحق من الوجه الصحيح الذي يليق بالجناب الإلهي لا ينبغي أن تطلق على أحد من خلق الله إلا حيث أطلقها الحق لا غير وإن أباح ذلك فالورع ما هو مع المباح ولا سيما في هذه المسألة خاصة فلا يطلقها مع كون ذلك قد أبيح له فإذا أطلقها على من أطلقها عليه الحق أو الرسول صلى الله عليه وسلم فيكون هذا المطلق تاليا أو مترجما ناقلا عن رسول الله صلى الله عليه وسلم في ذلك الإطلاق‏\n\n\n### [ما اختص به الأنبياء والرسل من الإطلاق‏]\n\n\nثم من الورع عند هؤلاء الرجال أن ينزلوا إلى ما اختصت به الأنبياء والرسل من الإطلاق فيتورعوا أن يطلقوا عليهم أو على أحد ممن ليس بنبي ولا رسول اللفظ الذي اختصوا به فيطلقون على الرسل الذين ليسوا برسل الله لفظ الورثة والمترجمين فيقولون وصل من السلطان الفلاني إلى السلطان الفلاني ترجمان يقول كذا وكذا فلم يطلقوا على المرسل ولا على المرسل إليه اسم الملك ورعا وأدبا مع الله وأطلقوا عليه اسم السلطان فإن الملك من أسماء الله فاجتنبوا هذا اللفظ أدبا وحرمة وورعا وقالوا السلطان إذ كان هذا اللفظ لم يرد في أسماء الله وأطلقوا على الرسول الذي جاء من عنده اسم الترجمان ولم يطلقوا عليه اسم الرسول لأنه قد أطلق على رسول الله صلى الله عليه وسلم فجعلوه من خصائص النبوة والرسالة الإلهية أدبا مع رسل الله عليهم السلام وإن كان هذا اللفظ قد أبيح لهم ولم ينهوا عنه ولكن لم يوجب عليهم فكان لزوم الأدب أولى مع من عرفنا الله أنه أعظم منا منزلة عنده وهذا لا يعرفه إلا الأدباء الورعون‏\n\n\n### [الطريق الضيق في زحمة الأكوان‏]\n\n\nثم إن لهؤلاء مرتبة أخرى في الورع وهي أنهم رضي الله عنهم يجتنبون كل أمر تقع فيه المزاحمة بين الأكوان ويطلبون طريقا لا يشاركهم فيها من ليس من جنسهم ولا من مقامهم فلا يزاحمون أحدا في شي‏ء مما يتحققون به في نفوسهم ويتصفون به ويحبون من الله أن يدعوا به في الدنيا والآخرة وهو ما يكونون عليه من الأخلاق الإلهية فيكونون مع تحققهم بمعانيها وظهور أحكامها على ظواهرهم من الرحمة بعباد الله والتلطف بهم والإحسان إليهم والتوكل على الله والقيام بحدود الله ويظهرون في العالم أن جميع ما يرى عليهم إن ذلك فعل الله لا فعلهم وبيد الله لا بيدهم وأن المثنى عليه بذلك الفعل إنما ينبغي أن يتعلق ذلك الثناء بفاعله وفاعله هو الله جل جلاله لا نحن فيتبرءون من أفعالهم الحسنة غاية التبري ومن الأوصاف المستحسنة كذلك وكل وصف مذموم شرعا وعرفا يضيفونه إلى أنفسهم أدبا مع الله تعالى وورعا شافيا كما قال الخضر في العيب فَأَرَدْتُ وفي الخير فَأَرادَ رَبُّكَ وكما قال الخليل عليه السلام وإِذا مَرِضْتُ ولم يقل أمرضني وكما قال تعالى في معرض التعليم لنا وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ هذا وإن كان الحق في هذا الخبر يحكى قولهم ولكن فيه تنبيه في التعليم وكما قال عليه السلام في دعائه وهو مما يؤيد ما ذهبنا إليه في التنبيه في هذه الآية\n\n\nفقال والخير كله بيديك‏\n\n\nفأكد بكل وهي كلمة تقتضي الإحاطة في اللسان وقال والشر ليس إليك‏\n\n\nوإن كان لم يؤكده واكتفى بالألف واللام ونفى أضافه الشر أدبا مع الله وحقيقة وهذه المسألة من أغمض المسائل الإلهية عند أهل الله خاصة وأما أهل النظر فقد اعتمدت كل طائفة منهم على ما اقتضاه دليلها في زعمها وهؤلاء الرجال الغالب عليهم‏\nفهم مقاصد الشرع فجروا معه على مقصده وذلك من بركة الورع والاحترام الذي احترموا به الجناب الإلهي حقيقة لا مجازا فتح الله لهم بأدبهم عين الفهم في كتبه وفيما جاءت به رسله مما لا تستقل العقول بإدراكه وما تستقل لكن أخذوه عن الله لا عن نظرهم ففهموا من ذلك كله بهذه العناية ما لم يفهم من لم يتصف بهذه لصفة ولم يكن له هذا المقام‏\n\n\n### [الاستتار بالأسباب الموضوعة في العالم‏]\n\n\nولما كان هذا حال الورعين سلكوا في أمورهم وحركاتهم مسالك العامة فلم يظهر عليهم ما يتميزون به عنهم واستتروا بالأسباب الموضوعة في العالم التي لا يقع الثناء بها على من تلبس بها فلم ينطق على هؤلاء الرجال في العموم اسم صلاح يخرجهم عن صلاح العامة ولا توكل ولا زهد ولا ورع ولا شي‏ء مما يقع عليه اسم ثناء خاص يخرجون به عن العامة ويشار إليهم فيه مع أنهم أهل ورع وتوكل وزهد وخلق حسن وقناعة وسخاء وإيثار فأمثال هذا كله اجتنب رجال الله من هؤلاء الطبقة فسموا ورعين في اصطلاح أهل الله لأن الورع الاجتناب‏\n\n\n### [في القلوب عصمة وستر]\n\n\nوتدبر ما أحسن قول من أوتي جوامع الكلم صلى الله عليه وسلم كيف قال في هذا المقام يعلم رجاله كيف يكونون فيه‏\n\n\nدع ما يريبك إلى ما لا يريبك‏\n\n\nوقال استفت قلبك وإن أفتاك المفتون‏\n\n\nفأحالهم على قلوبهم لما علم ما فيها من سر الله الحاوية عليه في تحصيل هذا المقام ففي القلوب عصمة إلهية لا يشعر بها إلا أهل المراقبة وفيه ستر لهم فإن هؤلاء الرجال لو سألوا وعرف منهم البحث والتفتيش في مثل هذا عند الناس وعند العلماء الذين سألوا في ذلك بالضرورة كان يشار إليهم ويعتقد فيهم الذين الخالص كبشر الحافي وغيره وهو من أقطاب هذا المقام عرف به وسلم له حكي أن أخت بشر الحافي سألت أحد أئمة الدين في الغزل الذي تغزله في ضوء مشاغل الظاهرية إذا مروا بها ليلا وهي على سطحها فعرفت بهذا السؤال أنها من أهل الورع ولو عملت على حديث استفت قلبك لعلمت أنها ما سألت حتى رابها فكانت تدع ذلك الغزل أو لا تغزل بعد ذلك وتترك الغزل فأفتاها الإمام المسئول وهو أحمد بن حنبل وأثنى عليها بذلك حتى نقل إلينا وسطر في الكتب‏\n\n\n### [الدين الخالص الذي لله‏]\n\n\nفأعطانا صلى الله عليه وسلم الميزان في قلوبنا ليكون مقامنا مستورا عن الأغيار خالصا لله مخلصا لا يعلمه إلا الله ثم صاحبه وهو قوله أَلا لِلَّهِ الدِّينُ الْخالِصُ فكل دين وقع فيه ضرب من الاشتراك المحمود أو المذموم فما هو بالدين الخالص الذي لله إن كان الذي وقع به الاشتراك محمودا كمثلة أخت بشر الحافي وإن وقع الاشتراك بالمذموم فليس بدين أصلا فإنه ليس ثم دين إلهي يتعلق به لسان ذم فلما رأى رجال هذا المقام مراعاة النبي صلى الله عليه وسلم ما يحصل في قلب العبد مما قاله وما أحال به لإنسان على نفسه باجتنابه طلبا للتستر تعملوا في تحصيل ذلك وسلكوا عليه وعلموا إن النجاة المطلوبة من الشارع لنا إنما هي في ستر المقام فأعطاهم العمل على هذا والتحقق به الحقيقة الإلهية التي استندوا إليها في ذلك وهو اجتنابه التجلي منه سبحانه لعموم عباده في الدنيا فاقتدوا بربهم في احتجاجه عن خلقه فعلم هؤلاء الرجال أن هذه الدار دار ستر وأن الله ما اكتفى في التعريف بالدين حتى نعته بالخالص فطلبوا طريقا لا يشوبهم فيها شي‏ء من الاشتراك حتى يعاملوا الموطن بما يستحقه أدبا وحكمة وشرعا واقتداء فاستتروا عن الخلق بحنن الورع الذي لا يشعر به وهو ظاهر الدين والعلم المعهود فإنهم لو سلكوا غير المعهود في الظاهر في العموم من الدين لتميزوا وجاء الأمر على خلاف ما قصدوه فكانت أسماؤهم أسماء العامة\n\n\n### [المقام المجهول في العامة]\n\n\nفهؤلاء الرجال يحمدهم الله وتحمدهم الأسماء الإلهية القدسية ويحمدهم الملائكة ويحمدهم الأنبياء والرسل ويحمدهم الحيوان والنبات والجماد وكل شي‏ء يسبح بحمد الله وأما الثقلان فيجهلونهم إلا أهل التعريف الإلهي فإنهم يحمدونهم ولا يظهرونهم وأما غير أهل التعريف الإلهي من الثقلين فهم فيهم مثل ما هم في حق العامة يذكرونهم بحسب أغراضهم فيهم لا غير فلهم المقام المجهول في العامة أما ثناء الله عليهم فلتعملهم استخلاصهم لله فخلصوا له دينه فأثنى عليهم حيث لم يملكهم كون ولا حكم على عبوديتهم رب غير الله وأما ثناء الأسماء الإلهية عليهم فكونهم تلقوها وعلموا تأثيرها وما أثروا بها في كون من الأكوان فيذكرون بذلك الأمر الذي هو لذلك الاسم الإلهي فيكون حجابا على ذلك الاسم فلما لم يفعلوا ذلك وأضافوا الأثر الصادر على أيديهم للاسم الإلهي الذي هو صاحب الأثر على الحقيقة حمدتهم الأسماء الإلهية بأجمعها وأما ثناء الملائكة فلأنهم ما زاحموهم فيما نسبوه إلى أنفسهم بالنسبة لا بالفعل في قولهم نَحْنُ نُسَبِّحُ بِحَمْدِكَ ونُقَدِّسُ لَكَ فقال هؤلاء الرجال لا حول ولا قوة إلا بك فلم يدعوا في شي‏ء مما هم علمه من‏\nتعظيم الله ونسبوا ذلك إلى الله فأثنت عليهم الملائكة فإنها مع هذه الحال لم تجرح الملائكة وتأدبت معها حيث لم تتعرض للطعن عليها بما صدر منها في حق أبيها آدم عليه السلام واعتذرت عن الملائكة لإيثارهم جناب الحق وإصابتهم العلم فإنه وقع ما قالوه في بنى آدم لا شك من الفساد وسفك الدماء ولهذا سر معلوم وأما ثناء الأنبياء والرسل عليهم السلام فلكونهم سلموا لهم ما ادعوه أنه لهم من النبوة والرسالة وآمنوا بهم وما توقفوا مع كونهم على أحوالهم من أجزاء النبوة قد اتصفوا بها ولكن مع هذا لم يتسموا بأنبياء ولا برسل وأخلصوا في اتباع آثارهم قدما بقدم كما روى عن الإمام أحمد بن حنبل المتبع المقتدى سيد وقته في تركه أكل لبطيخ لأنه ما ثبت عنده كيف كان يأكله رسول الله صلى الله عليه وسلم فدل ذلك على قوة تباعه كيفيات أحوال الرسول صلى الله عليه وسلم في حركاته وسكناته وجميع أفعاله وأحواله وإنما عرف هذا منه لأنه كان في مقام الوراثة في التبليغ والإرشاد بالقول والعمل والحال لأن ذلك أمكن في نفس السامع فهو وأمثاله حفاظ الشريعة على هذه الأمة وأما ثناء الحيوان والنبات والجماد عليهم فإن هؤلاء الأصناف عرفوا الحركات التي تسمى عبثا من التي لا تسمى عبثا فكل من تحرك فيهم بحركة تكون عبثا عند المتحرك بها لا عند المحرك يعلم الناظر منهم المشاهد لتلك الحركة البعثية أنه صاحب غفلة عن الله ورأت هذه الطائفة أنها لا تتحرك في حيوان ولا نبات ولا جماد بحركة تكون عبثا ويلحق بهذا الباب صيد الملوك ومن لا حاجة له بذلك إلا للفرجة واللهو واللعب فأثنى من ذكرناه من هؤلاء الأصناف على هذه الطائفة\n\n\n### [كل شي‏ء حي يسبح بحمد ربه‏]\n\n\nفالله يقول وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ولكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كانَ حَلِيماً بإمهالكم حيث لم يؤاخذكم سريعا بما رددتم من ذلك غَفُوراً حيث ستر عنكم تسبيح هؤلاء فلم تفقهوه وقال تعالى في حال من مات ممقوتا عند الله فَما بَكَتْ عَلَيْهِمُ السَّماءُ والْأَرْضُ فوصف السماء والأرض بالبكاء على أهل الله ولا يشك مؤمن في كل شي‏ء أنه مسبح وكل مسبح حي عقلا وورد أن العصفور يأتي يوم القيامة فيقول يا رب سل هذا لم قتلني عبثا\n\n\nوكذلك من يقطع شجرة لغير منفعة أو ينقل حجرا لغير فائدة تعود على أحد من خلق الله فلما أعطى الله هذه المعارف لهؤلاء الأصناف لذلك وصفتها بالثناء على هؤلاء الرجال وعرفت ذلك منهم كشفا حسيا مثل ما كان للصحابة سماع تسبيح الحصى وتسبيح الطعام لأنهم ليس بينهم وبين الحركة العبثية دخول بل يجتنبون ذلك جملة واحدة ولما جهل أكثر الثقلين هذه العلوم لذلك لا يعرفون مراتب هؤلاء الرجال فلا يمدحونهم ولا يتعرضون إليهم ولهذا أخبر تعالى أن كل شي‏ء في العالم يسجد لله تعالى من غير تبعيض إلا الناس فقال أَ لَمْ تَرَ أَنَّ الله يَسْجُدُ لَهُ من في السَّماواتِ ومن في الْأَرْضِ والشَّمْسُ والْقَمَرُ والنُّجُومُ والْجِبالُ والشَّجَرُ والدَّوَابُّ ولم يبعض وكَثِيرٌ من النَّاسِ فبعض فإن فهمت ما ذكرناه لك من صفة أصحاب هذا المقام وسلكت طريقهم كنت من المفلحين الفائزين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الثالث والعشرون‏\n\n",
    "en": "**Chapter Forty-Three: Concerning the Knowledge of a Group of the Poles of Scrupulous Piety (al-Wari'un) and the Generality of that Station (Maqam)**\n\nI am the Seal of Sainthood (Wilaya), without doubt,\nDue to the inheritance of the Hashimi (Muhammad) along with the Messiah (Jesus).\n\nJust as I am Abu Bakr al-Atiq,\nI strive against every possessor of body and spirit,\n\nWith long, straightened spears,\nAnd a translation by means of an eloquent Quran.\n\nI charge against the battalion of every intellect\nThat disputes with me concerning the clear Revelation (Wahy).\n\nMine is the scrupulous piety (al-Wara') that ascends loftily\nAbove the spiritual states (al-Ahwal) through the sound report (al-Naba' al-Sahih).\n\nAnd I am aided in it by men of truth,\nFrom the scrupulous ones (al-Wari'un), from the People of Spiritual Conquest (Ahl al-Futuh).\n\nThey adhere to the Obligatory (al-Wujub) and every Recommended (Nadab),\nAnd they make exception for the sovereignty of the Permitter (al-Mubih).\n\n### [Scrupulous Piety (al-Wara') and Avoiding Ambiguities (al-Shubuhat)]\n\nThe discussion of *wara'* and its people and its abandonment will appear within the book, in the mention of the Stations (al-Maqamat) and the States (al-Ahwal), if God Almighty wills. What relates to this chapter is the discussion concerning the knowledge of a group of its Poles (*Aqtab*) and the generality of its station (*Maqam*).\n\nKnow that Abu Abd Allah al-Harith ibn Asad al-Muhasibi was among the generality of this station, while Abu Yazid al-Bistami and our Shaykh Abu Madyan in our time were among its elite (*khassah*).\n\nThe highest level of the Poles of the Scrupulous is avoiding participation in the unrestricted use of language (*itlaq al-lafz*). This is because *wara'* is the avoidance of forbidden things (*al-Muharramat*) and everything that contains ambiguity (*shubhah*) from the side of the forbidden. Thus, one avoids it due to that ambiguity, which is expressed as *al-Shubuhat* (Doubtful Matters)—meaning, the thing that resembles what the explicit text has declared forbidden, whether from the Book (Quran), the Sunnah, or consensus (*Ijma’*), in a state that necessitates this designation.\n\nFor example, eating pork for one who is not in a state of necessity (*al-Idtirar*) is forbidden for him. This is why we said, \"in a state that necessitates this designation,\" just as the one in necessity is not addressed by the prohibition. Thus, eating pork, in the case of one whose state is necessity, is lawful for him without dispute.\n\n### [The Prohibition That Is Never Made Lawful]\n\nSince prohibition (*al-Tahrim*) means prevention from involvement with it, and they saw that this has states (*ahwal*), and that nothing in creation is inherently forbidden (*muharram li-'aynihi*), the Lawgiver (al-Shari') therefore qualified it by states. That which prohibition has extended to due to the state—that which is inherently forbidden—is more deserving of avoidance. It must be avoided inwardly, through knowledge (*‘ilman*). This inherently forbidden thing may become lawful outwardly due to the state that necessitates it.\n\nHowever, there is a prohibition that is never made lawful, in terms of its meaning, and no legal verse can ever make it lawful. This is the assumption of the Attributes of the Real (Haqq) (صفات الحق تعالى) by which He is God (*Ilah*). It is legally and rationally obligatory to avoid these Divine Names (*al-Asma’ al-Ilahiyyah*) in meaning, even if they are used verbally. They should not be used verbally for anyone except in recitation (*tilawah*), so that the one who uses them is merely reciting or narrating.\n\nAs God Almighty said: <<لَقَدْ جاءَكُمْ رَسُولٌ من أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ>> (There has certainly come to you a Messenger from among yourselves. Grievous to him is what you suffer; [he is] concerned over you, and to the believers, [he is] kind and merciful.) He named him *Aziz* (Mighty), *Ra’uf* (Kind), and *Rahim* (Merciful). We name him by the name God gave him, but we believe that he (peace and blessings be upon him), in himself, is a humble, submissive, penitent, and returning servant before his Lord.\n\nThe use of terms applied to the Real (Haqq) in the true sense that befits the Divine Presence (*al-Janab al-Ilahi*) should not be applied to any of God’s creation, except where the Real Himself has applied them, and nothing else. Even if that usage is permitted, *wara'* is not concerned with the permissible (*al-Mubah*), especially in this specific matter. Thus, one does not use them even if it has been permitted for him. If he does apply them to one upon whom the Real or the Messenger (peace and blessings be upon him) applied them, then this speaker is merely reciting or translating/transmitting from the Messenger of God (peace and blessings be upon him) regarding that application.\n\n### [What the Prophets and Messengers Were Distinguished By in Usage]\n\nFurthermore, part of *wara'* among these men is that they refrain from using the language specifically reserved for the Prophets and Messengers. They scrupulously avoid applying to them, or to anyone who is neither a prophet nor a messenger, the term reserved exclusively for them.\n\nThey apply to the messengers who are not Messengers of God the term 'inheritors' (*al-Warathah*) or 'translators' (*al-Mutarjimun*). They might say: \"A translator (*turjuman*) arrived from such-and-such a sovereign to such-and-such a sovereign, saying thus and thus.\" They did not apply the name 'King' (*al-Malik*) to either the sender or the recipient, out of *wara'* and reverence (*adab*) toward God. They used the name 'Sovereign' (*al-Sultan*), because 'The King' (*al-Malik*) is one of God’s Names, so they avoided this term out of reverence, respect, and *wara'*. They used 'Sovereign' (*al-Sultan*) because this term is not found among the Names of God.\n\nThey applied the name 'Translator' (*al-Turjuman*) to the messenger who came from Him, and did not apply the name 'Messenger' (*al-Rasul*) because it has been applied to the Messenger of God (peace and blessings be upon him). They made it one of the specific characteristics of Prophethood and Divine Messengership, out of reverence for the Messengers of God (peace be upon them). Even though this term may have been permitted for them and not forbidden, it was not made obligatory upon them. Therefore, adhering to reverence (*adab*) was more appropriate toward those whom God has made known to us as having a greater rank with Him than ourselves. Only the scrupulous people of reverence (*al-Udaba’ al-Wari’un*) understand this.\n\n### [The Narrow Path Amidst the Crowding of Existents]\n\nThese people have another level of *wara'*: they (may God be pleased with them) avoid every matter in which there is crowding (*muzahamah*) among the existents (*al-Akwan*). They seek a path in which they are not shared by those who are not of their kind or their station. They do not crowd anyone in anything they realize within themselves or are characterized by, and which they love to be called by God in this world and the Hereafter.\n\nThis refers to the Divine characteristics (*al-Akhlaq al-Ilahiyyah*) they embody: their realization of the meanings of these characteristics, and the manifestation of their effects upon their outward selves—such as mercy toward God’s servants, gentleness toward them, benevolence toward them, reliance upon God (*Tawakkul*), and upholding God’s limits (*Hudud*). They manifest in the world that everything seen upon them is God’s action, not their action, and is by God’s hand, not their hand. They believe that the praise directed toward that action should properly relate to its Agent, and the Agent is God, exalted is His Majesty, not themselves. They utterly disavow their good deeds and likewise their praiseworthy attributes.\n\nConversely, every attribute that is blameworthy legally or customarily, they attribute to themselves, out of reverence for God and complete *wara'*. As al-Khidr said concerning the fault: <<فَأَرَدْتُ>> (So I intended), and concerning the good: <<فَأَرادَ رَبُّكَ>> (And your Lord intended). And as the Friend (Abraham) said (peace be upon him): <<وإِذا مَرِضْتُ>> (And when I am ill), and did not say, \"He made me ill.\" And as God Almighty said, teaching us: <<وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ>> (And whatever evil befalls you is from yourself). Although the Real, in this report, is narrating their saying, it contains an admonition for instruction.\n\nAnd as he (peace be upon him) said in his supplication, which supports what we have concluded regarding the admonition in this verse:\n\nHe said: And all good is in Your hands.\n\nHe emphasized this with the word 'all' (*kull*), which implies comprehensiveness in language.\n\nAnd he said: And evil is not attributed to You.\n\nAlthough he did not emphasize it, he sufficed with the definite article and negated the attribution of evil, out of reverence for God and truth (*haqiqah*).\n\nThis issue is one of the most obscure Divine issues among the People of God (*Ahl Allah*) specifically. As for the people of speculative thought (*Ahl al-Nazar*), each group has relied on what its supposed evidence required. These men are predominantly guided by the understanding of the Lawgiver’s intentions (*Maqasid al-Shar’*), so they proceed according to His intention. This is due to the blessing of *wara'* and the respect (*ihtiram*) with which they truly, not metaphorically, honored the Divine Presence. Through their reverence, God opened for them the eye of understanding (*‘ayn al-fahm*) in His Books and in what His Messengers brought, which the intellects cannot grasp independently, or which they can grasp but they took it from God, not from their own speculation. Thus, through this Divine care (*‘Inayah*), they understood from all of this what was not understood by those who were not characterized by this attribute and did not possess this station.\n\n### [Concealment by Means of the Established Causes in the World]\n\nSince this is the state of the scrupulous ones (*al-Wari'un*), they follow the paths of the common people (*al-Amm*) in their affairs and movements. Nothing appears on them that distinguishes them from the common people. They conceal themselves by means of the established causes (*al-Asbab*) in the world, which do not elicit praise for the one who engages in them.\n\nGenerally, no specific name of righteousness (*salah*) is applied to these men that would distinguish them from the righteousness of the common people, nor *tawakkul* (reliance), *zuhd* (asceticism), *wara'* (scrupulous piety), or anything that carries a name of specific praise by which they would be singled out from the common people and pointed to—even though they are people of *wara'*, *tawakkul*, *zuhd*, good character, contentment (*qana’ah*), generosity (*sakha’*), and altruism (*ithar*). Men of God from this class avoid all such things. They are called *Wari'un* (Scrupulous) in the terminology of the People of God because *wara'* means avoidance (*al-Ijtinab*).\n\n### [In the Hearts is Infallibility and Concealment]\n\nReflect upon how excellent was the saying of him who was given comprehensive speech (peace and blessings be upon him) when he spoke concerning this station, teaching his men how to be in it:\n\nLeave that which makes you doubt for that which does not make you doubt.\n\nAnd he said: Consult your heart, even if the jurists give you a ruling.\n\nHe referred them to their hearts, knowing the secret of God contained within them for the attainment of this station. In the hearts is a Divine infallibility (*‘ismah*) that is only perceived by the People of Vigilance (*Ahl al-Muraqabah*). It also contains concealment for them. If these men were to ask questions, and their searching and investigation in such matters became known among people and among the scholars they consulted out of necessity, they would be pointed out and believed to possess pure religion (*al-Din al-Khalis*), like Bishr al-Hafi and others.\n\nBishr al-Hafi, one of the Poles of this station, was known for this and accepted. It is narrated that the sister of Bishr al-Hafi asked one of the Imams of the religion about the yarn she spun in the light of the lamps of the superficial people (*al-Zahiriyyah*) when they passed by her at night while she was on her roof. By this question, it was known that she was one of the People of *Wara'*. Had she acted upon the saying, \"Consult your heart,\" she would have known that she did not ask until she doubted, and she would have abandoned that spinning or stopped spinning thereafter. The consulted Imam, Ahmad ibn Hanbal, gave her a ruling and praised her for it, so much so that it was transmitted to us and recorded in books.\n\n### [The Pure Religion That Belongs to God]\n\nThe Prophet (peace and blessings be upon him) gave us the scale (*al-Mizan*) in our hearts so that our station might be concealed from others (*al-Aghyar*), pure for God (*khalisan li-Llah*), and sincere (*mukhlasan*), known only to God and its possessor. This is His saying: <<أَلا لِلَّهِ الدِّينُ الْخالِصُ>> (Unquestionably, to Allah belongs the pure religion.)\n\nEvery religion (*din*) in which some form of partnership (*ishtirak*) occurs, whether praiseworthy or blameworthy, is not the pure religion that belongs to God. This is true even if the partnership is praiseworthy, like the example of Bishr al-Hafi’s sister. If the partnership involves the blameworthy, then it is not religion at all, for there is no Divine religion to which the tongue of blame can relate.\n\nWhen the men of this station saw the Prophet’s (peace and blessings be upon him) consideration for what occurs in the servant’s heart, as he stated and as he referred the person back to himself by avoiding it in pursuit of concealment (*tastattur*), they strove to achieve this and followed this path. They knew that the salvation sought for us by the Lawgiver is only found in the concealment of the station (*satr al-Maqam*). Working upon this and realizing it granted them the Divine Reality (*al-Haqiqah al-Ilahiyyah*) upon which they relied in this matter: the avoidance of His Self-disclosure (*al-Tajalli*) to His general servants in this world.\n\nThey imitated their Lord in His veiling Himself from His creation. These men knew that this abode (the world) is the abode of concealment (*dar satr*), and that God was not satisfied in defining religion until He qualified it as 'pure' (*al-Khalis*). They sought a path in which nothing of partnership could taint them, so that they might treat the abode with the respect it deserves, out of reverence (*adab*), wisdom (*hikmah*), legal compliance (*shar’an*), and imitation (*iqtida’*). They concealed themselves from creation by means of the gentleness of *wara'* that is not perceived, which is the apparent and known religion and knowledge. Had they followed a path other than the outwardly known path of religion in general, they would have been distinguished, and the matter would have gone contrary to their intention. Thus, their names remained the names of the common people.\n\n### [The Unknown Station Among the Common People]\n\nThese men are praised by God, praised by the Holy Divine Names (*al-Asma’ al-Ilahiyyah al-Qudsiyyah*), praised by the angels, praised by the Prophets and Messengers, and praised by the animals, plants, inanimate objects, and everything that glorifies God with His praise. As for the two weighty ones (mankind and jinn), they are ignorant of them, except for the People of Divine Definition (*Ahl al-Ta’rif al-Ilahi*), who praise them but do not reveal them. As for those among the two weighty ones who are not the People of Divine Definition, they regard them just as the common people do, mentioning them only according to their own purposes concerning them. Thus, they possess the Unknown Station (*al-Maqam al-Majhul*) among the common people.\n\nAs for God’s praise of them, it is due to their striving for sincerity (*istikhlas*) for God; they purified His religion for Him, so He praised them where no existent (*kawn*) or ruling (*hukm*) made them servants of a Lord other than God.\n\nAs for the praise of the Divine Names upon them, it is because they received these Names and knew their effect, and they did not use them to effect change in any existent (*kawn*) in the cosmos. If they were to mention the matter that belongs to that Divine Name, it would become a veil (*hijab*) over that Name. Since they did not do that, and instead attributed the effect emanating through their hands to the Divine Name which is the true Agent of the effect, all the Divine Names praised them.\n\nAs for the praise of the angels, it is because these men did not crowd them in what the angels attributed to themselves—not in action, but in attribution—in their saying: <<نَحْنُ نُسَبِّحُ بِحَمْدِكَ ونُقَدِّسُ لَكَ>> (We glorify You with Your praise and sanctify You). These men said: \"There is no power nor strength except by You.\" They claimed nothing of what they knew concerning the magnification of God, but attributed it to God. Thus, the angels praised them. Furthermore, despite this state, they did not criticize the angels, but showed reverence toward them by not exposing them to criticism regarding what emanated from them concerning their father Adam (peace be upon him). They offered an excuse for the angels, due to the angels’ preference for the Divine Presence and their attainment of knowledge, for what they said concerning the corruption and bloodshed among the Children of Adam certainly occurred. This has a known secret.\n\nAs for the praise of the Prophets and Messengers (peace be upon them) upon them, it is because they acknowledged what the Prophets claimed for themselves of Prophethood and Messengership, and they believed in them. They did not pause, even though they themselves possessed states that were parts of Prophethood. Despite this, they did not call themselves prophets or messengers. They were sincere in following their footsteps exactly, step by step. As narrated concerning Imam Ahmad ibn Hanbal, the follower and exemplar, the master of his time, regarding his abandonment of eating watermelon because it was not established for him how the Messenger of God (peace and blessings be upon him) used to eat it. This demonstrates the strength of his adherence to the modalities of the Messenger’s states (peace and blessings be upon him) in his movements, stillness, and all his actions and states. This was known of him because he was in the station of inheritance (*al-Wirathah*) in conveying and guiding through word, deed, and state, as that is more effective in the soul of the listener. He and those like him are the guardians of the Sacred Law (*al-Shari’ah*) for this Community.\n\nAs for the praise of the animals, plants, and inanimate objects upon them, it is because these categories recognized the movements that are called 'frivolous' (*‘abathan*) from those that are not. Anyone among them who moves with a movement that is frivolous in the view of the mover (though not in the view of the Mover) is known by the observer who witnesses that frivolous movement to be heedless of God. This group (the *Wari'un*) saw that they should not move in the realm of animal, plant, or inanimate object with a movement that is frivolous. Related to this is the hunting done by kings or those who have no need for it except for amusement, diversion, and play. Therefore, the categories we mentioned praised this group.\n\n### [Everything Alive Glorifies Its Lord]\n\nGod says: <<وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ولكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كانَ حَلِيماً>> (There is not a thing except that it glorifies Him with His praise, but you do not understand their glorification. Indeed, He is Ever-Forbearing) in giving you respite, since He does not swiftly punish you for what you reject of that, <<غَفُوراً>> (All-Forgiving) since He concealed their glorification from you, so you did not understand it.\n\nAnd God Almighty said concerning the state of one who dies hated by God: <<فَما بَكَتْ عَلَيْهِمُ السَّماءُ والْأَرْضُ>> (And the heaven and earth wept not for them). He described the heaven and earth as weeping for the People of God (*Ahl Allah*). No believer doubts that everything glorifies God, and every glorifier is alive, rationally. It is narrated that the sparrow will come on the Day of Resurrection and say: \"O Lord, ask this one why he killed me frivolously (*‘abathan*).\" Likewise, one who cuts down a tree for no benefit, or moves a stone for no advantage that accrues to any of God’s creation.\n\nSince God granted these categories this knowledge, I described them as praising these men, and they knew this from them through sensory unveiling (*kashfan hissiyyan*), just as the Companions heard the glorification of the pebbles and the glorification of the food. This is because there is no involvement between them and frivolous movement; rather, they avoid it entirely. Since most of the two weighty ones are ignorant of these sciences, they do not know the ranks of these men, so they neither praise them nor approach them.\n\nFor this reason, God Almighty informed us that everything in the world prostrates to God Almighty without exception, except for mankind. He said: <<أَ لَمْ تَرَ أَنَّ الله يَسْجُدُ لَهُ من في السَّماواتِ ومن في الْأَرْضِ والشَّمْسُ والْقَمَرُ والنُّجُومُ والْجِبالُ والشَّجَرُ والدَّوَابُّ>> (Do you not see that to Allah prostrates whoever is in the heavens and whoever is on the earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and the moving creatures) — and He did not make an exception — <<وكَثِيرٌ من النَّاسِ>> (And many among mankind) — here He made an exception.\n\nIf you have understood what we have mentioned to you concerning the description of the possessors of this station and you follow their path, you will be among the successful and the triumphant. And God <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تینتالیس: پرہیزگاروں کے اقطاب کی ایک جماعت اور اس مقام کے عمومی احوال کی معرفت میں۔\n\nمیں بلا شک ولایت کا خاتم ہوں،\nہاشمی اور مسیح کی وراثت کے لیے۔\n\nجیسا کہ میں ابوبکر عتیق ہوں،\nمیں ہر جسم اور روح والے سے جہاد کرتا ہوں۔\n\nلمبی نوکدار نیزوں کے ساتھ،\nاور فصیح قرآن کے ذریعے ترجمانی کے ساتھ۔\n\nمیں ہر عقل کے لشکر پر سختی کرتا ہوں،\nجو مجھ سے صریح وحی پر جھگڑتا ہے۔\n\nمیرے لیے وہ پرہیزگاری (الورع) ہے جو بلندی حاصل کرتی ہے،\nصحیح خبر (النبأ الصحیح) کے ذریعے احوال پر۔\n\nاور اس پر میری مدد سچے مردوں نے کی،\nجو پرہیزگاروں میں سے اور اہل فتوح میں سے ہیں۔\n\nوہ وجوب (فرض) اور ہر مستحب کی پیروی کرتے ہیں،\nاور مباح کی سلطنت کو مستثنیٰ رکھتے ہیں۔\n\n### [پرہیزگاری (الورع) اور شبہات سے اجتناب]\n\nپرہیزگاری (الورع)، اس کے اہل اور اس کے ترک پر کلام ان شاء اللہ کتاب کے اندر مقامات اور احوال کے ذکر میں آئے گا۔ اور جو اس باب سے متعلق ہے وہ اس کے اقطاب کی ایک جماعت اور اس مقام کے عمومی احوال کی معرفت پر کلام ہے۔\n\nپس جان لو کہ ابو عبداللہ حارث بن اسد المحاسبی اس مقام کے عام لوگوں میں سے تھے، اور ابویزید بسطامی اور ہمارے شیخ ابو مدین ہمارے زمانے میں اس کے خاص لوگوں میں سے تھے۔\n\nپرہیزگاروں کے اقطاب کا اعلیٰ ترین درجہ لفظ کے اطلاق میں اشتراک سے اجتناب کرنا ہے، کیونکہ پرہیزگاری حرام چیزوں اور ہر اس چیز سے اجتناب کا نام ہے جس میں حرام کی طرف سے شبہ ہو، لہٰذا اس شبہ کی وجہ سے اجتناب کیا جاتا ہے۔ اسی کو شبہات (الشبهات) سے تعبیر کیا جاتا ہے، یعنی وہ چیز جو اس چیز سے مشابہت رکھتی ہو جس کی حرمت کے بارے میں کتاب، سنت یا اجماع سے صریح نص آئی ہو۔ یہ اس حال کے ساتھ ہو جو اس نام کو واجب کرتی ہو، جیسے خنزیر کا گوشت کھانا اس شخص کے لیے حرام ہے جو حالت اضطرار میں نہ ہو۔ اسی لیے ہم نے کہا کہ اس حال کے ساتھ جو اس نام کو واجب کرتی ہو، جیسا کہ مضطر (مجبور) شخص تحریم کا مخاطب نہیں ہوتا، لہٰذا حالت اضطرار میں خنزیر کا گوشت کھانا اس کے لیے بلا اختلاف حلال ہے۔\n\n### [وہ تحریم جو کبھی حلال نہیں ہوتی]\n\nاور چونکہ تحریم کا مطلب اس سے ملوث ہونے سے روکنا ہے، اور انہوں نے دیکھا کہ اس کے لیے احوال ہیں، اور یہ کہ وضع (تخلیق) میں کوئی چیز اپنی ذات کے لیے حرام نہیں ہے، اسی لیے شارع (شریعت بنانے والے) نے اسے احوال کے ساتھ مقید کیا۔ اور اس حال کی وجہ سے اس پر تحریم لاگو ہو گئی، تو جو چیز اپنی ذات کے لیے حرام ہے وہ اجتناب کے لیے زیادہ اولیٰ ہے، لہٰذا باطنی طور پر علمی اجتناب ضروری ہے۔ اور بظاہر حال میں یہ حرام چیز حلال ہو سکتی ہے جو اس کے لیے لازم ہو۔\n\nاور یہ وہ تحریم ہے جو اپنے معنی کے لحاظ سے کبھی حلال نہیں ہوتی، اور نہ ہی یہ صحیح ہے کہ کوئی شرعی آیت اسے حلال کر دے، اور وہ ہے ذات حق (الحق) تعالیٰ کی ان صفات سے متصف ہونا جن کے ذریعے وہ معبود (الٰہ) ہوتا ہے۔ لہٰذا شرعاً اور عقلاً ان الٰہی اسماء سے معنی کے لحاظ سے اجتناب واجب ہے، اگرچہ لفظاً ان کا اطلاق کیا جائے۔ اور مناسب ہے کہ ان کا اطلاق کسی پر بھی لفظاً نہ کیا جائے مگر تلاوت کے طور پر، تو جو ان کا اطلاق کرے وہ تلاوت کرنے والا، حکایت کرنے والا ہو، جیسا کہ اللہ تعالیٰ نے فرمایا:\nلَقَدْ جاءَكُمْ رَسُولٌ من أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ\n(بیشک تمہارے پاس تم ہی میں سے ایک رسول آیا ہے، جس پر تمہارا مشقت میں پڑنا گراں گزرتا ہے، وہ تمہاری بھلائی کا بہت خواہشمند ہے، مومنوں پر نہایت مہربان، رحم کرنے والا ہے۔) [التوبہ: ۱۲۸]\n\nتو اللہ نے انہیں عزیز، رؤف اور رحیم کہا، چنانچہ ہم انہیں اسی نام سے پکارتے ہیں جس سے اللہ نے انہیں پکارا، اور ہم یہ اعتقاد رکھتے ہیں کہ وہ صلی اللہ علیہ وسلم اپنی ذات میں اپنے رب کے ساتھ ایک ذلیل، خاشع، آہ و زاری کرنے والے، رجوع کرنے والے بندے ہیں۔\n\nپس وہ الفاظ جو ذات حق پر اس صحیح پہلو سے بولے جاتے ہیں جو جناب الٰہی کے شایانِ شان ہے، ان کا اطلاق اللہ کی مخلوق میں سے کسی پر نہیں کرنا چاہیے، سوائے اس کے جہاں ذات حق نے خود ان کا اطلاق کیا ہو۔ اور اگرچہ اس کی اجازت ہو، تب بھی پرہیزگاری (الورع) مباح کے ساتھ نہیں ہوتی، خاص طور پر اس خاص مسئلے میں۔ لہٰذا وہ ان کا اطلاق نہیں کرتے، اگرچہ ان کے لیے اس کی اجازت دی گئی ہو۔ پس جب وہ ان کا اطلاق اس پر کرتے ہیں جس پر ذات حق یا رسول صلی اللہ علیہ وسلم نے ان کا اطلاق کیا ہو، تو یہ اطلاق کرنے والا تلاوت کرنے والا یا رسول اللہ صلی اللہ علیہ وسلم سے اس اطلاق کو نقل کرنے والا مترجم ہوتا ہے۔\n\n### [وہ اطلاق جو انبیاء اور رسولوں کے ساتھ خاص ہے]\n\nپھر ان مردانِ حق کے نزدیک پرہیزگاری (الورع) یہ ہے کہ وہ اس اطلاق سے نیچے اتر آئیں جو انبیاء اور رسولوں کے ساتھ خاص ہے، اور وہ اس لفظ کو کسی پر بھی، خواہ وہ نبی یا رسول نہ ہو، استعمال کرنے سے پرہیز کرتے ہیں جو ان (انبیاء و رسل) کے ساتھ خاص ہے۔ چنانچہ وہ ان رسولوں پر جو اللہ کے رسول نہیں ہیں، ورثاء اور مترجمین کا لفظ استعمال کرتے ہیں۔ وہ کہتے ہیں: فلاں سلطان کی طرف سے فلاں سلطان کے پاس ایک ترجمان پہنچا جو یوں کہتا ہے۔\n\nچنانچہ انہوں نے بھیجنے والے اور جس کی طرف بھیجا گیا، دونوں پر 'الملک' (بادشاہ) کا نام پرہیزگاری اور اللہ کے ساتھ ادب کی وجہ سے استعمال نہیں کیا، اور اس پر 'السلطان' (حاکم) کا نام استعمال کیا، کیونکہ 'الملک' اللہ کے اسماء میں سے ہے۔ انہوں نے ادب، احترام اور پرہیزگاری کی وجہ سے اس لفظ سے اجتناب کیا اور 'السلطان' کہا، کیونکہ یہ لفظ اللہ کے اسماء میں نہیں آیا۔\n\nاور جو رسول اس کی طرف سے آیا، اس پر 'الترجمان' (ترجمان) کا نام استعمال کیا، اور اس پر 'الرسول' کا نام استعمال نہیں کیا، کیونکہ یہ رسول اللہ صلی اللہ علیہ وسلم پر بولا گیا ہے، چنانچہ انہوں نے اسے الٰہی نبوت اور رسالت کی خصوصیات میں شامل کر لیا، اللہ کے رسولوں علیہم السلام کے ساتھ ادب کی وجہ سے۔ اگرچہ اس لفظ کی انہیں اجازت دی گئی تھی اور انہیں اس سے منع نہیں کیا گیا تھا، لیکن ان پر اسے واجب بھی نہیں کیا گیا تھا۔ چنانچہ ادب کو لازم پکڑنا زیادہ اولیٰ تھا ان کے ساتھ جنہیں اللہ نے ہم سے زیادہ عظیم مرتبہ والا بتایا ہے۔ اور یہ بات صرف باادب پرہیزگار (الورعون) ہی جانتے ہیں۔\n\n### [اکوان کے رش میں تنگ راستہ]\n\nپھر ان (پرہیزگاروں) کا پرہیزگاری (الورع) میں ایک اور مرتبہ ہے، اور وہ یہ ہے کہ وہ (رضی اللہ عنہم) ہر اس کام سے اجتناب کرتے ہیں جس میں اکوان (کائناتوں) کے درمیان مقابلہ واقع ہو، اور وہ ایسا راستہ تلاش کرتے ہیں جس میں ان کے جنس اور ان کے مقام سے تعلق نہ رکھنے والا کوئی شریک نہ ہو۔ چنانچہ وہ کسی بھی ایسی چیز میں کسی سے مقابلہ نہیں کرتے جس کے ذریعے وہ اپنے نفوس میں متحقق ہوتے ہیں اور جس سے وہ متصف ہوتے ہیں۔\n\nاور وہ اللہ سے محبت کرتے ہیں کہ وہ دنیا اور آخرت میں اس کے ذریعے پکارے جائیں، اور وہ ان الٰہی اخلاق پر قائم رہنا ہے جن پر وہ ہوتے ہیں، جیسے اللہ کے بندوں پر رحم کرنا، ان سے نرمی کرنا، ان کے ساتھ احسان کرنا، اللہ پر توکل کرنا اور اللہ کی حدود پر قائم رہنا۔\n\nاور وہ دنیا میں یہ ظاہر کرتے ہیں کہ جو کچھ ان پر دیکھا جاتا ہے وہ سب اللہ کا فعل ہے، ان کا فعل نہیں، اور اللہ کے ہاتھ میں ہے، ان کے ہاتھ میں نہیں۔ اور یہ کہ اس فعل پر جس کی تعریف کی جاتی ہے، وہ تعریف اس کے فاعل سے متعلق ہونی چاہیے، اور اس کا فاعل اللہ جل جلالہ ہے، نہ کہ ہم۔ چنانچہ وہ اپنے اچھے افعال سے مکمل طور پر براءت کا اظہار کرتے ہیں، اور اسی طرح مستحسن صفات سے بھی۔ اور ہر وہ صفت جو شرعاً اور عرفاً مذموم ہو، اسے وہ اللہ کے ساتھ ادب اور مکمل پرہیزگاری (ورع) کی وجہ سے اپنی طرف منسوب کرتے ہیں۔\n\nجیسا کہ خضر (علیہ السلام) نے عیب میں کہا:\nفَأَرَدْتُ\n(تو میں نے ارادہ کیا) [الکہف: ۷۹]\nاور خیر میں کہا:\nفَأَرادَ رَبُّكَ\n(تو تیرے رب نے ارادہ کیا) [الکہف: ۸۲]\n\nاور جیسا کہ خلیل (علیہ السلام) نے کہا:\nوإِذا مَرِضْتُ\n(اور جب میں بیمار ہوتا ہوں) [الشعراء: ۸۰]\nاور یہ نہیں کہا کہ \"اس نے مجھے بیمار کیا\"۔\n\nاور جیسا کہ اللہ تعالیٰ نے ہمیں تعلیم دینے کے ضمن میں فرمایا:\nوما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ\n(اور جو برائی تمہیں پہنچتی ہے وہ تمہاری اپنی جان کی طرف سے ہے) [النساء: ۷۹]\nیہ اگرچہ اس خبر میں ذات حق ان کے قول کو بیان کر رہی ہے، لیکن اس میں تعلیم کی طرف تنبیہ ہے۔\n\nاور جیسا کہ آپ صلی اللہ علیہ وسلم نے اپنی دعا میں فرمایا، اور یہ اس بات کی تائید کرتا ہے جس کی طرف ہم نے اس آیت میں تنبیہ کی ہے:\nفقال والخير كله بيديك\n(تو فرمایا: اور خیر ساری کی ساری تیرے ہاتھوں میں ہے)۔\nتو آپ نے 'کل' (ساری) کے ساتھ تاکید کی، اور یہ لفظ زبان میں احاطہ کا تقاضا کرتا ہے۔\nوقال والشر ليس إليك\n(اور فرمایا: اور شر تیری طرف نہیں ہے)۔\nاگرچہ آپ نے اس کی تاکید نہیں کی، اور الف لام پر اکتفا کیا، اور شر کی اضافت کی نفی کر دی، اللہ کے ساتھ ادب اور حقیقت کی وجہ سے۔\n\nاور یہ مسئلہ اہل اللہ کے نزدیک خاص طور پر الٰہی مسائل میں سے سب سے زیادہ گہرا ہے۔ البتہ اہل نظر نے ہر گروہ نے اس چیز پر بھروسہ کیا ہے جس کا ان کے گمان میں ان کے دلیل نے تقاضا کیا۔ اور ان مردانِ حق پر شریعت کے مقاصد کا فہم غالب ہوتا ہے، چنانچہ وہ اس کے مقصد کے مطابق چلتے ہیں۔ اور یہ اس پرہیزگاری (الورع) اور احترام کی برکت سے ہے جس کے ذریعے انہوں نے جناب الٰہی کا حقیقی طور پر احترام کیا، نہ کہ مجازی طور پر۔ چنانچہ اللہ نے ان کے ادب کی وجہ سے ان کے لیے اپنی کتابوں میں اور اپنے رسولوں کی لائی ہوئی چیزوں میں فہم کی آنکھ کھول دی، جسے عقلیں ادراک کرنے کی طاقت نہیں رکھتیں، یا اگر طاقت رکھتی بھی ہیں تو انہوں نے اسے اللہ سے لیا، نہ کہ اپنے غور و فکر سے۔ چنانچہ انہوں نے اس ساری چیز سے اس عنایت کے ذریعے وہ کچھ سمجھا جو اس صفت سے متصف نہ ہونے والے اور اس مقام کے حامل نہ ہونے والے نے نہیں سمجھا۔\n\n### [دنیا میں موجود اسباب کے ذریعے پردہ پوشی]\n\nاور چونکہ پرہیزگاروں (الورعین) کا یہی حال ہے، انہوں نے اپنے معاملات اور حرکات میں عام لوگوں کے راستے اختیار کیے، چنانچہ ان پر کوئی ایسی چیز ظاہر نہیں ہوئی جو انہیں عام لوگوں سے ممتاز کرے۔ اور انہوں نے دنیا میں موجود ان اسباب کے ذریعے پردہ پوشی کی جن کے ذریعے ان پر تعریف نہیں کی جاتی جو ان سے متصف ہوں۔\n\nچنانچہ ان مردانِ حق پر عمومی طور پر کوئی ایسا نام نہیں بولا جاتا جو انہیں عام لوگوں کی نیکی سے نکال دے، نہ توکل، نہ زہد، نہ پرہیزگاری (ورع)، اور نہ ہی کوئی ایسی چیز جس پر کوئی خاص تعریفی نام بولا جائے جو انہیں عام لوگوں سے ممتاز کرے اور جس میں ان کی طرف اشارہ کیا جائے، حالانکہ وہ پرہیزگاری، توکل، زہد، حسن خلق، قناعت، سخاوت اور ایثار کے اہل ہیں۔ چنانچہ اللہ کے ان طبقے کے مردانِ حق نے ان سب چیزوں سے اجتناب کیا، چنانچہ اہل اللہ کی اصطلاح میں انہیں پرہیزگار (ورعین) کہا گیا، کیونکہ پرہیزگاری (الورع) اجتناب (بچنا) ہے۔\n\n### [دلوں میں عصمت اور پردہ پوشی]\n\nاور غور کرو کہ جسے جوامع الکلم عطا کیے گئے، اس نبی صلی اللہ علیہ وسلم کا قول اس مقام کے بارے میں کتنا خوبصورت ہے، وہ اپنے مردانِ حق کو سکھا رہے ہیں کہ وہ اس میں کیسے ہوں:\nدع ما يريبك إلى ما لا يريبك\n(اس چیز کو چھوڑ دو جو تمہیں شک میں ڈالے، اس چیز کی طرف جو تمہیں شک میں نہ ڈالے)۔\nاور فرمایا:\nاستفت قلبك وإن أفتاك المفتون\n(اپنے دل سے فتویٰ لو، اگرچہ مفتی تمہیں فتویٰ دے دیں)۔\n\nچنانچہ آپ نے انہیں ان کے دلوں کی طرف لوٹا دیا، کیونکہ آپ جانتے تھے کہ اس مقام کے حصول میں ان کے دلوں میں اللہ کا وہ راز موجود ہے جو اس پر حاوی ہے۔ چنانچہ دلوں میں ایک الٰہی عصمت ہے جسے صرف اہل مراقبہ ہی محسوس کرتے ہیں، اور اس میں ان کے لیے پردہ پوشی ہے۔ کیونکہ اگر یہ مردانِ حق لوگوں کے سامنے اور ان علماء کے سامنے جو اس بارے میں سوال کرتے ہیں، اس طرح کی تحقیق اور تفتیش کرتے، تو ان کی طرف اشارہ کیا جاتا اور ان کے بارے میں خالص اعتقاد رکھا جاتا، جیسا کہ بشر حافی اور دیگر کے ساتھ ہوا، اور وہ اس مقام کے اقطاب میں سے ہیں، انہیں اس سے پہچانا گیا اور ان کے لیے اسے تسلیم کیا گیا۔\n\nحکایت کی جاتی ہے کہ بشر حافی کی بہن نے ایک امام دین سے اس سوت کے بارے میں پوچھا جو وہ رات کو جب ظاہری مشغلوں والے ان کے پاس سے گزرتے تھے اور وہ اپنی چھت پر ہوتی تھیں، تو ان کی روشنی میں کاتتی تھیں۔ اس سوال سے یہ معلوم ہوا کہ وہ اہل پرہیزگاری (الورع) میں سے تھیں۔ اگر وہ حدیث \"اپنے دل سے فتویٰ لو\" پر عمل کرتیں تو جان لیتیں کہ انہوں نے سوال ہی اس لیے کیا کہ انہیں شک ہوا، چنانچہ وہ اس سوت کو چھوڑ دیتیں یا اس کے بعد سوت کاتنا ترک کر دیتیں۔ چنانچہ پوچھے گئے امام، یعنی احمد بن حنبل نے اسے فتویٰ دیا اور اس پر اس کی تعریف کی، یہاں تک کہ یہ ہم تک نقل ہوا اور کتابوں میں لکھا گیا۔\n\n### [وہ خالص دین جو اللہ کے لیے ہے]\n\nچنانچہ نبی صلی اللہ علیہ وسلم نے ہمارے دلوں میں میزان عطا فرمایا تاکہ ہمارا مقام اغیار سے پوشیدہ رہے، خالص اللہ کے لیے ہو، مخلص ہو، جسے اللہ کے سوا کوئی نہ جانے، پھر اس کا صاحب جانے۔ اور وہ اللہ کا یہ قول ہے:\nأَلا لِلَّهِ الدِّينُ الْخالِصُ\n(خبردار! خالص دین اللہ ہی کے لیے ہے) [الزمر: ۳]\n\nچنانچہ ہر وہ دین جس میں کسی قسم کا محمود (قابل تعریف) یا مذموم (قابل مذمت) اشتراک واقع ہو، وہ اللہ کے لیے خالص دین نہیں ہے، خواہ وہ اشتراک محمود ہی کیوں نہ ہو، جیسا کہ بشر حافی کی بہن کی مثال میں ہوا۔ اور اگر اشتراک مذموم کے ساتھ واقع ہو، تو وہ سرے سے دین ہی نہیں ہے، کیونکہ کوئی ایسا الٰہی دین نہیں ہے جس سے مذمت کا تعلق ہو۔\n\nچنانچہ جب اس مقام کے مردانِ حق نے نبی صلی اللہ علیہ وسلم کی اس رعایت کو دیکھا جو بندے کے دل میں پیدا ہوتی ہے، اور جو کچھ آپ نے فرمایا اور جس کی طرف آپ نے انسان کو اپنی ذات کی طرف لوٹایا، تو انہوں نے پردہ پوشی کی طلب میں اس سے اجتناب کرتے ہوئے اس کے حصول میں کوشش کی اور اس پر چلے۔ اور انہوں نے جان لیا کہ شارع کی طرف سے ہمارے لیے مطلوبہ نجات صرف مقام کی پردہ پوشی میں ہے، چنانچہ اس پر عمل کرنے اور اس کے ذریعے متحقق ہونے نے انہیں وہ الٰہی حقیقت عطا کی جس پر انہوں نے اس معاملے میں بھروسہ کیا، اور وہ یہ ہے کہ اللہ تعالیٰ دنیا میں اپنے عام بندوں کے لیے اپنے ظہور الٰہی (التجلی) سے اجتناب کرتا ہے۔\n\nچنانچہ انہوں نے اپنی مخلوق سے پردہ پوشی کرنے میں اپنے رب کی پیروی کی، اور ان مردانِ حق نے جان لیا کہ یہ دنیا پردہ پوشی کا گھر ہے۔ اور اللہ نے دین کی تعریف میں صرف اس پر اکتفا نہیں کیا بلکہ اسے خالص (الخالص) سے بھی موصوف کیا۔ چنانچہ انہوں نے ایسا راستہ تلاش کیا جس میں کوئی بھی اشتراک انہیں آلودہ نہ کرے، تاکہ وہ ادب، حکمت، شرع اور اقتداء کے ساتھ اس مقام کے ساتھ وہ معاملہ کریں جس کا وہ مستحق ہے۔ چنانچہ انہوں نے پرہیزگاری (الورع) کی نرمی کے ذریعے مخلوق سے پردہ پوشی کی جسے کوئی محسوس نہیں کرتا، اور وہ دین اور مروجہ علم کا ظاہر ہے۔ کیونکہ اگر وہ ظاہر میں عمومی طور پر مروجہ دین کے علاوہ کوئی اور راستہ اختیار کرتے تو وہ ممتاز ہو جاتے اور معاملہ ان کے مقصد کے خلاف ہو جاتا۔ چنانچہ ان کے نام عام لوگوں کے ناموں کی طرح رہے۔\n\n### [عام لوگوں میں گمنام مقام]\n\nپس یہ مردانِ حق ہیں جن کی تعریف اللہ کرتا ہے، اور الٰہی قدسی اسماء ان کی تعریف کرتے ہیں، اور فرشتے ان کی تعریف کرتے ہیں، اور انبیاء اور رسول ان کی تعریف کرتے ہیں، اور حیوان، نباتات، جمادات اور ہر وہ چیز جو اللہ کی حمد کے ساتھ تسبیح کرتی ہے، ان کی تعریف کرتی ہے۔\n\nالبتہ ثقلین (جن و انس) انہیں نہیں جانتے، سوائے اہل تعریف الٰہی کے، کیونکہ وہ ان کی تعریف کرتے ہیں لیکن انہیں ظاہر نہیں کرتے۔ اور ثقلین میں سے جو اہل تعریف الٰہی نہیں ہیں، وہ ان کے حق میں عام لوگوں کی طرح ہیں، وہ ان کا ذکر صرف اپنے اغراض کے مطابق کرتے ہیں۔ چنانچہ عام لوگوں میں ان کا مقام گمنام (المقام المجهول) ہے۔\n\nجہاں تک اللہ کی طرف سے ان کی تعریف کا تعلق ہے، تو یہ ان کے اللہ کے لیے اخلاص کے عمل کی وجہ سے ہے، چنانچہ انہوں نے اپنا دین اس کے لیے خالص کر دیا، تو اس نے ان کی تعریف کی کیونکہ کسی کون (کائنات) یا حکم نے ان کی بندگی کو اللہ کے علاوہ کسی اور رب کے لیے نہیں بنایا۔\n\nاور جہاں تک الٰہی اسماء کی طرف سے ان کی تعریف کا تعلق ہے، تو یہ اس وجہ سے ہے کہ انہوں نے انہیں (اسماء کو) حاصل کیا اور ان کا اثر جانا، اور انہوں نے ان کے ذریعے کسی بھی کون میں کوئی اثر نہیں ڈالا، چنانچہ وہ اس امر کے ذریعے یاد کیے جاتے ہیں جو اس الٰہی اسم کے لیے ہے، اور وہ اس اسم پر پردہ بن جاتا ہے۔ پس جب انہوں نے ایسا نہیں کیا اور اپنے ہاتھوں سے صادر ہونے والے اثر کو اس الٰہی اسم کی طرف منسوب کیا جو حقیقت میں صاحب اثر ہے، تو تمام الٰہی اسماء نے ان کی تعریف کی۔\n\nاور جہاں تک فرشتوں کی تعریف کا تعلق ہے، تو یہ اس لیے ہے کہ انہوں نے ان سے اس چیز میں مقابلہ نہیں کیا جسے انہوں نے اپنے لیے منسوب کیا تھا، نسبت کے لحاظ سے نہ کہ فعل کے لحاظ سے، ان کے اس قول میں:\nنَحْنُ نُسَبِّحُ بِحَمْدِكَ ونُقَدِّسُ لَكَ\n(ہم تیری حمد کے ساتھ تسبیح کرتے ہیں اور تیری پاکیزگی بیان کرتے ہیں) [البقرہ: ۳۰]۔\nتو ان مردانِ حق نے کہا: \"لا حول ولا قوة إلا بک\" (تیرے بغیر کوئی طاقت اور قوت نہیں)۔ چنانچہ انہوں نے اللہ کی تعظیم کے بارے میں جو کچھ جانا تھا، اس میں سے کسی چیز کا دعویٰ نہیں کیا اور اسے اللہ کی طرف منسوب کیا۔ چنانچہ فرشتوں نے ان کی تعریف کی، کیونکہ اس حال کے باوجود انہوں نے فرشتوں کو مجروح نہیں کیا اور ان کے ساتھ ادب سے پیش آئے، جہاں انہوں نے ان پر اس چیز کے ذریعے طعن نہیں کیا جو ان کے باپ آدم علیہ السلام کے حق میں ان سے صادر ہوا تھا، اور انہوں نے فرشتوں کی طرف سے عذر پیش کیا کیونکہ انہوں نے جناب حق کو ترجیح دی اور علم کو درست پایا، کیونکہ بنی آدم میں فساد اور خونریزی واقع ہوئی، اس میں کوئی شک نہیں، اور اس کا ایک معلوم راز ہے۔\n\nاور جہاں تک انبیاء اور رسولوں علیہم السلام کی تعریف کا تعلق ہے، تو یہ اس لیے ہے کہ انہوں نے ان کے لیے وہ سب تسلیم کیا جو انہوں نے نبوت اور رسالت کا دعویٰ کیا تھا، اور ان پر ایمان لائے اور توقف نہیں کیا۔ اس کے باوجود کہ وہ نبوت کے اجزاء کے احوال پر تھے اور ان سے متصف تھے، لیکن اس کے باوجود انہوں نے اپنے آپ کو نبی یا رسول نہیں کہا، اور انہوں نے قدم بہ قدم ان کے آثار کی پیروی میں اخلاص برتا۔\n\nجیسا کہ امام احمد بن حنبل سے روایت ہے، جو متبع اور مقتدی تھے اور اپنے وقت کے سردار تھے، کہ انہوں نے تربوز کھانے کو ترک کر دیا کیونکہ ان کے نزدیک یہ ثابت نہیں ہوا تھا کہ رسول اللہ صلی اللہ علیہ وسلم اسے کیسے کھاتے تھے۔ یہ اس بات پر دلالت کرتا ہے کہ آپ صلی اللہ علیہ وسلم کے احوال کی کیفیات کی پیروی میں ان کی قوت کتنی تھی، آپ کی حرکات، سکنات اور تمام افعال و احوال میں۔ اور یہ بات ان سے صرف اس لیے معلوم ہوئی کہ وہ قول، عمل اور حال کے ذریعے تبلیغ اور ارشاد میں وراثت کے مقام پر تھے، کیونکہ یہ سننے والے کے نفس میں زیادہ مؤثر ہوتا ہے۔ چنانچہ وہ اور ان جیسے لوگ اس امت پر شریعت کے محافظ ہیں۔\n\nاور جہاں تک حیوان، نباتات اور جمادات کی طرف سے ان کی تعریف کا تعلق ہے، تو ان اصناف نے ان حرکات کو پہچان لیا جو عبث (بے مقصد) کہلاتی ہیں اور جو عبث نہیں کہلاتیں۔ چنانچہ ان میں سے جو بھی ایسی حرکت کرتا ہے جو حرکت کرنے والے کے نزدیک عبث ہو، نہ کہ حرکت دینے والے کے نزدیک، تو اس عبث حرکت کو دیکھنے والا مشاہد جان لیتا ہے کہ وہ اللہ سے غفلت کرنے والا ہے۔ اور اس جماعت نے دیکھا کہ وہ حیوان، نباتات یا جمادات میں کوئی ایسی حرکت نہیں کرتے جو عبث ہو۔ اور اس باب سے بادشاہوں کا شکار کرنا اور ان لوگوں کا شکار کرنا بھی ملحق ہے جنہیں اس کی ضرورت نہیں ہوتی، سوائے تفریح، لہو اور کھیل کے۔ چنانچہ ان اصناف نے جن کا ہم نے ذکر کیا، اس جماعت کی تعریف کی۔\n\n### [ہر چیز زندہ ہے اور اپنے رب کی حمد کے ساتھ تسبیح کرتی ہے]\n\nاللہ تعالیٰ فرماتا ہے:\nوإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ولكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كانَ حَلِيماً غَفُوراً\n(اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے، لیکن تم ان کی تسبیح کو نہیں سمجھتے۔ بیشک وہ بردبار ہے، تمہاری مہلت دینے والا ہے، جہاں اس نے تمہیں اس چیز پر جلد مؤاخذہ نہیں کیا جسے تم نے رد کر دیا، بخشنے والا ہے، جہاں اس نے تم سے ان کی تسبیح کو چھپا دیا، چنانچہ تم اسے نہیں سمجھتے) [الإسراء: ۴۴]۔\n\nاور اللہ تعالیٰ نے اس شخص کے حال میں فرمایا جو اللہ کے نزدیک مبغوض ہو کر مرا:\nفَما بَكَتْ عَلَيْهِمُ السَّماءُ والْأَرْضُ\n(تو ان پر نہ آسمان رویا اور نہ زمین) [الدخان: ۲۹]۔\nچنانچہ اللہ والوں پر آسمان اور زمین کے رونے کی صفت بیان کی۔\n\nاور کوئی بھی مومن اس میں شک نہیں کرتا کہ ہر چیز تسبیح کرتی ہے، اور ہر تسبیح کرنے والی چیز عقلاً زندہ ہے۔ اور یہ بھی وارد ہوا ہے کہ چڑیا قیامت کے دن آئے گی اور کہے گی: اے رب! اس سے پوچھ کہ اس نے مجھے عبث کیوں قتل کیا؟\n\nاور اسی طرح وہ شخص جو کسی درخت کو بغیر کسی منفعت کے کاٹتا ہے یا کسی پتھر کو بغیر کسی فائدے کے ہٹاتا ہے جو اللہ کی مخلوق میں سے کسی کو پہنچے۔\n\nچنانچہ جب اللہ نے ان اصناف کو یہ معرفتیں عطا کیں، اسی لیے میں نے ان کی تعریف کو ان مردانِ حق پر موصوف کیا، اور انہوں نے اسے ان سے حسی کشف (الکشف) کے ذریعے جانا، جیسا کہ صحابہ کے لیے کنکریوں کی تسبیح اور کھانے کی تسبیح سننا تھا۔ کیونکہ ان کے اور عبث حرکت کے درمیان کوئی دخل نہیں، بلکہ وہ اس سے مکمل طور پر اجتناب کرتے ہیں۔\n\nاور چونکہ اکثر ثقلین (جن و انس) ان علوم سے ناواقف ہیں، اس لیے وہ ان مردانِ حق کے مراتب کو نہیں جانتے، نہ ان کی تعریف کرتے ہیں اور نہ ان سے تعرض کرتے ہیں۔ اسی لیے اللہ تعالیٰ نے خبر دی کہ دنیا میں ہر چیز اللہ کو سجدہ کرتی ہے، بغیر کسی تقسیم کے، سوائے انسانوں کے۔ چنانچہ فرمایا:\nأَ لَمْ تَرَ أَنَّ الله يَسْجُدُ لَهُ من في السَّماواتِ ومن في الْأَرْضِ والشَّمْسُ والْقَمَرُ والنُّجُومُ والْجِبالُ والشَّجَرُ والدَّوَابُّ\n(کیا تم نے نہیں دیکھا کہ اللہ ہی کو سجدہ کرتے ہیں جو آسمانوں میں ہیں اور جو زمین میں ہیں، اور سورج، اور چاند، اور ستارے، اور پہاڑ، اور درخت، اور چوپائے؟) [الحج: ۱۸]\nاور اس نے تقسیم نہیں کی،\nوكَثِيرٌ من النَّاسِ\n(اور (سجدہ کرتے ہیں) بہت سے انسانوں میں سے) [الحج: ۱۸]\nتو اس نے تقسیم کر دی۔\n\nپس اگر تم نے اس مقام کے حاملین کی جو صفت ہم نے تمہارے لیے بیان کی ہے اسے سمجھ لیا اور ان کے راستے پر چلے، تو تم کامیاب ہونے والوں اور فلاح پانے والوں میں سے ہو گے۔\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\n(اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔) [الأحزاب: ۴]\n\nتئیسواں حصہ مکمل ہوا۔",
    "fa": "باب چهل و سوم در شناخت گروهی از اقطاب اهل ورع و عمومیت آن مقام\n\nمن ختم ولایت هستم، بی‌هیچ تردید،\nبرای میراث هاشمی همراه با مسیح.\n\nچنانکه من ابوبکر عتیق هستم،\nبا هر صاحب جسم و روحی جهاد می‌کنم.\n\nبا نیزه‌های بلند و راست‌شده،\nو ترجمه‌ای به قرآن فصیح.\n\nبر سپاه هر عقلی که\nبر سر وحی صریح با من نزاع کند، سخت می‌گیرم.\n\nورعی از آنِ من است که با برتری،\nبر احوال، به واسطه خبر صحیح، تعالی می‌یابد.\n\nو مردان راستی مرا در آن یاری کردند،\nاز اهل ورع و از صاحبان فتوحات (الفتوح).\n\nآنان وجوب و هر مستحبی را دوست می‌دارند،\nو سلطنت مباح‌کننده را استثنا می‌کنند.\n\n### [ورع و دوری از شبهات]\n\nسخن درباره ورع (الورع) و اهل آن و ترک آن، ان‌شاءالله در داخل کتاب، در ذکر مقامات و احوال خواهد آمد. آنچه به این باب مربوط می‌شود، سخن درباره شناخت طایفه‌ای از اقطاب (الأقطاب) آن و عمومیت مقام ورع است. پس بدان که ابوعبدالله حارث بن اسد محاسبی از عامه این مقام بود و ابایزید بسطامی و شیخ ما ابومدین در زمان ما از خاصان آن بودند.\n\nبالاترین مرتبه اقطاب اهل ورع، اجتناب از اشتراک در اطلاق لفظ است؛ زیرا ورع دوری از محرمات و هر چیزی است که از جهت محرم، در آن شبهه‌ای باشد. پس به خاطر آن شبهه از آن دوری می‌شود و این همان است که به شبهات (الشبهات) تعبیر می‌شود؛ یعنی چیزی که شبیه به آن چیزی است که نص صریح بر تحریم آن آمده است، چه از کتاب، چه از سنت، یا اجماع، به حالتی که این نام را بر آن واجب سازد. مانند خوردن گوشت خوک برای کسی که در حال اضطرار نیست، که بر او حرام است. به همین دلیل گفتیم: «به حالتی که این نام را بر آن واجب سازد»، چنانکه مضطر مخاطب به تحریم نیست، پس خوردن گوشت خوک در حق کسی که حالش اضطرار است، بدون اختلاف بر او حلال است.\n\n### [تحریمی که هرگز حلال نمی‌شود]\n\nو چون معنای تحریم، منع از آمیزش با آن است و دیدند که برای آن احوالی وجود دارد و در اصل وضع، چیزی ذاتاً حرام نیست، شارع آن را به احوال مقید کرد. و تحریم به واسطه حال بر آن کشیده شده است. پس آنچه ذاتاً حرام است، به طریق اولی باید از آن دوری کرد. بنابراین، اجتناب از آن در باطن (علماً) ضروری است. و گاهی این محرم ذاتی در ظاهر حال، به واسطه آنچه بر آن لازم می‌شود، حلال می‌گردد.\n\nو این همان تحریمی است که از حیث معنایش هرگز حلال نمی‌شود و جایز نیست که آیه‌ای شرعی برای حلال کردن آن بیاید، و آن عبارت است از متصف شدن به اوصاف حق تعالی (الحق تعالی) که به واسطه آن‌ها خداست. پس اجتناب از معنای این اسماء الهی، شرعاً و عقلاً واجب است، هرچند که لفظاً اطلاق شوند. بنابراین، شایسته است که لفظاً بر هیچ کس اطلاق نشوند، مگر به صورت تلاوت. در این صورت، کسی که آن‌ها را اطلاق می‌کند، تلاوت‌کننده و حکایت‌کننده است، چنانکه خداوند متعال می‌فرماید:\n\nلَقَدْ جاءَكُمْ رَسُولٌ من أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ (به یقین، پیامبری از خود شما به سویتان آمد که رنج‌های شما بر او گران است، بر شما حریص است و نسبت به مؤمنان رئوف و مهربان است).\n\nپس او را عزیز، رؤوف و رحیم نامید. ما نیز او را به نامی که خدا بر او نهاده است می‌نامیم و معتقدیم که او (صلی الله علیه و سلم) در نفس خود با پروردگارش بنده‌ای ذلیل، خاشع، آه کشنده و توبه‌کار است. پس اطلاق الفاظی که بر حق (الحق) اطلاق می‌شوند، از وجه صحیحی که شایسته مقام الهی است، نباید بر هیچ یک از خلق خدا اطلاق شود، مگر آنجا که حق (الحق) خود آن را اطلاق کرده باشد و نه غیر آن. و اگرچه این امر مباح باشد، ورع (الورع) آن است که با مباح همراه نشود، به ویژه در این مسئله خاص. پس آن را اطلاق نمی‌کند، با وجود اینکه ممکن است برای او مباح شده باشد. اما اگر آن را بر کسی اطلاق کند که حق (الحق) یا رسول (صلی الله علیه و سلم) بر او اطلاق کرده‌اند، در این صورت، این مطلق‌کننده، تلاوت‌کننده یا مترجمی است که از رسول خدا (صلی الله علیه و سلم) در آن اطلاق نقل می‌کند.\n\n### [آنچه انبیا و رسولان به اطلاق آن اختصاص یافتند]\n\nسپس، از ورع نزد این مردان آن است که از آنچه انبیا و رسولان (الأنبياء والرسل) به اطلاق آن اختصاص یافته‌اند، فروتر آیند و از اینکه لفظی را که مختص آنان است، بر خود یا بر کسی که نبی و رسول نیست، اطلاق کنند، پرهیز نمایند.\n\nآنان بر رسولانی که رسول خدا نیستند، لفظ ورثه و مترجمین را اطلاق می‌کنند و می‌گویند: از سلطان فلان به سلطان فلان ترجمانی رسید که چنین و چنان می‌گوید. پس از روی ورع و ادب با خدا، نه بر فرستنده و نه بر فرستاده‌شده، نام ملک (پادشاه) را اطلاق نکردند و بر او نام سلطان را اطلاق کردند؛ زیرا ملک (الملک) از اسماء الله است. پس از روی ادب، حرمت و ورع از این لفظ دوری جستند و گفتند: سلطان؛ زیرا این لفظ در اسماء الله نیامده است. و بر رسولی که از جانب او آمده است، نام ترجمان (مترجم) را اطلاق کردند و نام رسول را بر او ننهادند؛ زیرا این نام بر رسول خدا (صلی الله علیه و سلم) اطلاق شده است. پس آن را از خصایص نبوت و رسالت الهی قرار دادند، از روی ادب با رسولان خدا (علیهم السلام)، هرچند که این لفظ برای آنان مباح شده و از آن نهی نشده بودند، اما بر آنان واجب نیز نشده بود. پس رعایت ادب با کسی که خدا او را از نظر منزلت نزد خود بزرگ‌تر از ما معرفی کرده است، اولی بود. و این را جز ادیبان اهل ورع نمی‌دانند.\n\n### [راه تنگ در ازدحام کائنات]\n\nسپس، این مردان مرتبه دیگری در ورع دارند و آن این است که آنان (رضی الله عنهم) از هر امری که در آن مزاحمت میان کائنات (الأكوان) رخ می‌دهد، دوری می‌جویند و راهی را می‌طلبند که کسی از غیر جنس و مقام آنان در آن شریک نشود. پس در هیچ یک از اموری که در نفس خود به آن متحقق می‌شوند و به آن متصف می‌گردند و دوست دارند که خدا آنان را در دنیا و آخرت به آن بخواند، با کسی مزاحمت نمی‌کنند. و آن عبارت است از اخلاق الهی که بر آن هستند.\n\nپس با تحقق به معانی آن اخلاق و ظهور احکام آن‌ها بر ظواهرشان، از رحمت بر بندگان خدا، لطف و احسان به آنان، توکل بر خدا و قیام به حدود الهی برخوردارند. و در عالم آشکار می‌سازند که هر آنچه بر آنان دیده می‌شود، فعل خداست نه فعل ایشان، و به دست خداست نه به دست ایشان، و کسی که به واسطه آن فعل ستایش می‌شود، باید آن ستایش به فاعل آن تعلق گیرد و فاعل آن، خدای جل جلاله است نه ما. پس از افعال نیکوی خود نهایت بیزاری را می‌جویند و از اوصاف نیکو نیز همین‌طور. و هر وصفی که شرعاً و عرفاً مذموم است، از روی ادب با خدای تعالی و ورعی کامل، آن را به خود نسبت می‌دهند.\n\nچنانکه خضر (علیه السلام) در مورد عیب گفت: فَأَرَدْتُ (پس خواستم) و در مورد خیر گفت: فَأَرادَ رَبُّكَ (و پروردگارت خواست). و چنانکه خلیل (علیه السلام) گفت: وإِذا مَرِضْتُ (و هنگامی که بیمار شوم) و نگفت: «مرا بیمار کرد». و چنانکه خداوند متعال در مقام تعلیم به ما فرمود: وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ (و آنچه از بدی به تو رسد، از جانب خود توست). این در حالی است که حق (الحق) در این خبر، سخن آنان را حکایت می‌کند، اما در آن تنبیهی برای تعلیم وجود دارد. و چنانکه پیامبر (صلی الله علیه و سلم) در دعای خود فرمود، که این نیز مؤید همان چیزی است که ما در تنبیه این آیه به آن اشاره کردیم:\n\nفقال: والخير كله بيديك (و خیر تماماً در دستان توست).\n\nپس با کلمه «کُل» تأکید کرد، که در زبان مقتضی احاطه است. و فرمود: والشر ليس إليك (و شر به سوی تو نیست).\n\nو اگرچه آن را تأکید نکرد و به الف و لام اکتفا نمود، اما اضافه شر را از روی ادب با خدا و حقیقت نفی کرد. این مسئله از غامض‌ترین مسائل الهی نزد اهل الله است. اما اهل نظر، هر طایفه‌ای از آنان بر آنچه دلیلشان اقتضا کرده است، تکیه کرده‌اند. اما این مردان، فهم مقاصد شرع بر آنان غالب است، پس با شرع بر مقصود آن جاری شدند. و این از برکت ورع و احترامی است که آنان حقیقتاً و نه مجازاً برای جناب الهی قائل شدند. پس خداوند به واسطه ادبشان، چشم فهم را در کتاب‌هایش و در آنچه رسولانش آورده‌اند، برایشان گشود؛ فهمی که عقول به تنهایی قادر به درک آن نیستند، یا اگر هم قادر باشند، آنان آن را از خدا گرفتند نه از نظر خود. پس به واسطه این عنایت، از همه آن، چیزی را فهمیدند که کسی که به این صفت متصف نشده و این مقام را نداشته است، نفهمیده است.\n\n### [پوشیده شدن در اسباب وضع‌شده در عالم]\n\nو چون حال اهل ورع چنین بود، در امور و حرکات خود، راه و روش عامه را پیمودند و چیزی که آنان را از عامه متمایز سازد، بر ایشان ظاهر نشد. و در اسباب وضع‌شده در عالم که ستایش به واسطه آن‌ها بر کسی که به آن‌ها متلبس است واقع نمی‌شود، پنهان شدند. پس بر این مردان به طور عموم، نام صلاحی که آنان را از صلاح عامه خارج سازد، یا نام توکل، زهد، ورع، یا هیچ نام ستایش خاصی که به واسطه آن از عامه خارج شوند و به آن مورد اشاره قرار گیرند، اطلاق نمی‌شود؛ با اینکه آنان اهل ورع، توکل، زهد، اخلاق نیکو، قناعت، سخاوت و ایثار هستند. مردان خدا از این طبقه، از امثال این امور دوری جستند. پس در اصطلاح اهل الله، ورع نامیده شدند؛ زیرا ورع همان اجتناب است.\n\n### [در دل‌ها عصمت و پوششی است]\n\nو تدبر کن که چه نیکو فرمود کسی که جوامع الکلم (جامع‌ترین سخنان) به او داده شده است (صلی الله علیه و سلم)، چگونه در این مقام فرمود و به مردانش آموخت که چگونه در آن باشند:\n\nدع ما يريبك إلى ما لا يريبك (آنچه تو را به شک می‌اندازد رها کن و به آنچه تو را به شک نمی‌اندازد روی آور).\n\nو فرمود: استفت قلبك وإن أفتاك المفتون (از دلت فتوا بخواه، هرچند مفتیان به تو فتوا دهند).\n\nپس آنان را به دل‌هایشان ارجاع داد، زیرا می‌دانست که در آن‌ها سرّ الهی نهفته است که برای تحصیل این مقام، آن را در بر دارد. در دل‌ها عصمتی الهی است که جز اهل مراقبه آن را در نمی‌یابند و در آن پوششی برای آنان است. زیرا اگر این مردان سؤال می‌کردند و جستجو و تفتیش در چنین اموری نزد مردم و نزد علمایی که در این باره سؤال شده‌اند، از آنان شناخته می‌شد، مورد اشاره قرار می‌گرفتند و درباره آنان اعتقاد خالص پیدا می‌شد، مانند بشر حافی و دیگران. او از اقطاب این مقام بود که به آن شناخته شد و برایش پذیرفته شد. حکایت شده است که خواهر بشر حافی از یکی از ائمه دین درباره نخ‌ریسی که در پرتو چراغ‌های ظاهریه (مأموران حکومتی) می‌ریسید، هنگامی که شب هنگام از کنار او که بر پشت بام بود می‌گذشتند، سؤال کرد. با این سؤال شناخته شد که او از اهل ورع است. و اگر بر اساس حدیث «از دلت فتوا بخواه» عمل می‌کرد، می‌دانست که سؤال نکرده است مگر آنکه به شک افتاده است. پس آن نخ‌ریسی را ترک می‌کرد یا بعد از آن دیگر نمی‌ریسید و نخ‌ریسی را رها می‌کرد. امام مسئول، یعنی احمد بن حنبل، به او فتوا داد و او را به خاطر آن ستود، تا جایی که این امر به ما منتقل شد و در کتاب‌ها ثبت گردید.\n\n### [دین خالصی که از آن خداست]\n\nپس پیامبر (صلی الله علیه و سلم) میزان را در دل‌های ما قرار داد تا مقام ما از اغیار پوشیده و خالص برای خدا باشد، مخلصانه، که جز خدا و سپس صاحب آن، کسی آن را نداند. و این همان قول خداوند است: أَلا لِلَّهِ الدِّينُ الْخالِصُ (آگاه باشید که دین خالص از آن خداست).\n\nپس هر دینی که در آن نوعی از اشتراک، چه ستوده و چه نکوهیده، واقع شود، دین خالصی که از آن خداست، نیست. اگر اشتراک واقع شده ستوده باشد، مانند مثال خواهر بشر حافی، و اگر اشتراک با امر نکوهیده واقع شود، اصلاً دین نیست؛ زیرا دین الهی وجود ندارد که زبان نکوهش به آن تعلق گیرد.\n\nهنگامی که مردان این مقام، رعایت پیامبر (صلی الله علیه و سلم) را نسبت به آنچه در قلب بنده حاصل می‌شود، و آنچه را که انسان را به واسطه اجتناب، به نفس خود ارجاع داده است، برای طلب پوشیدگی دیدند، در تحصیل آن کوشیدند و بر آن راه پیمودند. و دانستند که نجات مطلوبی که شارع برای ما خواسته است، تنها در پوشیده ماندن مقام است. پس عمل بر این اساس و تحقق به آن، حقیقت الهی را به آنان بخشید که در این امر به آن استناد کردند، و آن اجتناب خداوند سبحان از تجلی برای عموم بندگانش در دنیاست. پس در پوشیده ماندن از خلق، به پروردگار خود اقتدا کردند. این مردان دانستند که این دنیا، سرای پوشیدگی است و خداوند در تعریف دین، تنها به آن اکتفا نکرده، بلکه آن را به «خالص» بودن وصف کرده است. پس راهی را طلبیدند که هیچ نوع اشتراکی در آن، آنان را آلوده نسازد تا با موطن (مقام) به آنچه شایسته آن است، از روی ادب، حکمت، شرع و اقتدا رفتار کنند. پس با ورعی پنهان که کسی آن را در نمی‌یابد، از خلق پوشیده ماندند، و این همان دین و علم شناخته‌شده ظاهری است. زیرا اگر آنان راهی غیر از آنچه در ظاهر برای عموم در دین شناخته شده است، می‌پیمودند، متمایز می‌شدند و امر بر خلاف مقصودشان پیش می‌رفت. پس نام‌هایشان، نام‌های عامه بود.\n\n### [مقام ناشناخته در میان عامه]\n\nاین مردان را خدا می‌ستاید، و اسماء الهی قدسیه آنان را می‌ستایند، و فرشتگان آنان را می‌ستایند، و انبیا و رسولان آنان را می‌ستایند، و حیوان و نبات و جماد و هر چیزی که به حمد خدا تسبیح می‌گوید، آنان را می‌ستایند. اما جن و انس (الثقلان) آنان را نمی‌شناسند، مگر اهل تعریف الهی که آنان را می‌ستایند ولی آشکارشان نمی‌سازند. اما غیر اهل تعریف الهی از جن و انس، در حق آنان مانند عامه هستند؛ آنان را فقط بر حسب اغراض خود در ایشان یاد می‌کنند و نه غیر آن. پس آنان در میان عامه، مقام ناشناخته (المقام المجهول) دارند.\n\nاما ستایش خدا بر آنان، به دلیل تلاششان در خالص کردن دین برای خداست، پس دین خود را برای او خالص کردند. پس خدا آنان را ستود، زیرا هیچ کونی و حکمی بر بندگی آنان برای پروردگاری غیر از خدا، مالک نشد.\n\nو اما ستایش اسماء الهی بر آنان، به این دلیل است که آنان اسماء را دریافتند و تأثیر آن‌ها را دانستند، اما با آن در هیچ کونی از کائنات تأثیر نکردند. پس به واسطه آن امری که متعلق به آن اسم الهی است، یاد می‌شوند و این امر حجابی بر آن اسم می‌شود. چون آنان این کار را نکردند و اثری را که به دستشان صادر شد، به اسم الهی که در حقیقت صاحب اثر است، نسبت دادند، اسماء الهی همگی آنان را ستودند.\n\nو اما ستایش فرشتگان، به این دلیل است که آنان با فرشتگان در آنچه فرشتگان به خود نسبت دادند، مزاحمت نکردند، در قولشان: نَحْنُ نُسَبِّحُ بِحَمْدِكَ ونُقَدِّسُ لَكَ (ما تو را با ستایشت تسبیح می‌گوییم و تو را تقدیس می‌کنیم). این مردان گفتند: لا حول ولا قوة إلا بك (هیچ نیرو و قوتی جز به واسطه تو نیست). پس در هیچ یک از اموری که از تعظیم خدا می‌دانستند، ادعایی نکردند و آن را به خدا نسبت دادند. پس فرشتگان آنان را ستودند. زیرا با این حال، فرشتگان را جریحه‌دار نکردند و با آنان ادب ورزیدند، چرا که متعرض طعن بر آنان نشدند به خاطر آنچه از ایشان در حق پدرشان آدم (علیه السلام) صادر شد. و از فرشتگان عذرخواهی کردند، به دلیل ترجیح دادن جناب حق و رسیدن به علم؛ زیرا آنچه گفتند، در بنی آدم رخ داد، بی‌شک از فساد و خونریزی، و این را سرّی معلوم است.\n\nو اما ستایش انبیا و رسولان (علیهم السلام) بر آنان، به این دلیل است که آنچه را که انبیا و رسولان ادعا کردند که از نبوت و رسالت از آنِ ایشان است، برایشان پذیرفتند و به آنان ایمان آوردند و توقف نکردند، با وجود اینکه خودشان بر احوالی از اجزای نبوت متصف بودند، اما با این حال، خود را نبی و رسول ننامیدند و در پیروی از آثار آنان، قدم به قدم اخلاص ورزیدند. چنانکه از امام احمد بن حنبل، آن متبع مقتدا و سید زمان خود، روایت شده است که از خوردن خربزه خودداری کرد، زیرا برایش ثابت نشده بود که رسول خدا (صلی الله علیه و سلم) چگونه آن را می‌خورده است. این امر بر قوت پیروی او از کیفیات احوال رسول خدا (صلی الله علیه و سلم) در حرکات، سکنات و جمیع افعال و احوالش دلالت دارد. و این از او شناخته شد، زیرا او در مقام وراثت در تبلیغ و ارشاد با قول، عمل و حال بود، چون این در نفس شنونده مؤثرتر است. پس او و امثال او، حافظان شریعت بر این امت هستند.\n\nو اما ستایش حیوان، نبات و جماد بر آنان، به این دلیل است که این اصناف، حرکاتی را که «عبث» نامیده می‌شوند، از حرکاتی که عبث نامیده نمی‌شوند، شناختند. پس هر کس از آنان که به حرکتی حرکت کند که نزد متحرک به آن، عبث باشد (نه نزد محرک)، بیننده و شاهد آن حرکت عبثی می‌داند که او صاحب غفلت از خداست. و این طایفه دیدند که در حیوان، نبات و جماد به حرکتی که عبث باشد، حرکت نمی‌کنند. و صید پادشاهان و کسانی که نیازی به آن ندارند و فقط برای تماشا، لهو و لعب است، به این باب ملحق می‌شود. پس کسانی که ذکر کردیم از این اصناف، این طایفه را ستودند.\n\n### [هر چیز زنده‌ای پروردگارش را تسبیح می‌گوید]\n\nخداوند می‌فرماید: وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ولكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كانَ حَلِيماً (و هیچ چیز نیست مگر آنکه با ستایش او تسبیح می‌گوید، ولی شما تسبیح آن‌ها را در نمی‌یابید. او بردبار است) در مهلت دادن به شما، زیرا شما را به سرعت به خاطر آنچه از آن بازگرداندید، مؤاخذه نکرد، غَفُوراً (آمرزنده است) زیرا تسبیح اینان را از شما پوشیده داشت و شما آن را در نیافتید.\n\nو خداوند متعال در مورد کسی که مورد خشم خدا مرده است، می‌فرماید: فَما بَكَتْ عَلَيْهِمُ السَّماءُ والْأَرْضُ (پس آسمان و زمین بر آنان گریه نکردند). پس آسمان و زمین را به گریه بر اهل الله وصف کرد. و هیچ مؤمنی شک ندارد که هر چیزی تسبیح می‌گوید و هر تسبیح‌کننده‌ای عقلاً زنده است. و روایت شده است که گنجشک در روز قیامت می‌آید و می‌گوید: پروردگارا، از این بپرس که چرا مرا عبث کشت؟\n\nو همچنین کسی که درختی را بدون منفعت قطع می‌کند یا سنگی را بدون فایده‌ای که به یکی از خلق خدا برسد، جابجا می‌کند. چون خداوند این معارف را به این اصناف عطا کرده است، به همین دلیل آنان را به ستایش این مردان وصف کردم و این را از آنان به صورت کشف حسی دانستند، مانند شنیدن تسبیح سنگریزه و تسبیح طعام توسط صحابه؛ زیرا میان آنان و حرکت عبثی، دخولی نیست، بلکه از آن به طور کلی دوری می‌جویند. و چون بیشتر جن و انس این علوم را نمی‌دانند، مراتب این مردان را نمی‌شناسند، پس نه آنان را مدح می‌کنند و نه متعرض ایشان می‌شوند.\n\nبه همین دلیل، خداوند متعال خبر داد که هر چیزی در عالم برای خدا سجده می‌کند، بدون تبعیض، مگر انسان‌ها. پس فرمود: أَ لَمْ تَرَ أَنَّ الله يَسْجُدُ لَهُ من في السَّماواتِ ومن في الْأَرْضِ والشَّمْسُ والْقَمَرُ والنُّجُومُ والْجِبالُ والشَّجَرُ والدَّوَابُّ (آیا ندیدی که هر کس در آسمان‌ها و هر کس در زمین است و خورشید و ماه و ستارگان و کوه‌ها و درختان و جنبندگان برای خدا سجده می‌کنند؟) و تبعیض قائل نشد، اما فرمود: وكَثِيرٌ من النَّاسِ (و بسیاری از مردم [نیز سجده می‌کنند])، پس تبعیض قائل شد.\n\nاگر آنچه را که برایت از صفت اصحاب این مقام ذکر کردیم، فهمیدی و راه آنان را پیمودی، از رستگاران و پیروزمندان خواهی بود. و خداوند حق (الْحَقَّ) را می‌گوید و او راه را هدایت می‌کند (وهُوَ يَهْدِي السَّبِيلَ).\n\nپایان جزء بیست و سوم."
  },
  "page_count": 4
}