{
  "id": 47,
  "title": {
    "ar": "الباب السابع والأربعون في معرفة أسرار وصف المنازل السفلية",
    "en": "Chapter Forty-Seven: Concerning the Gnosis of the Mysteries of the Description of the Lower Stations.",
    "ur": "باب سینتالیس: سفلی منازل (المنازل السفلية) کی صفات کے اسرار کی معرفت میں",
    "fa": "باب چهل و هفتم در شناخت اسرار وصف منازل سُفلی (پایین‌تر)"
  },
  "content": {
    "ar": "## (الباب السابع والأربعون) في معرفة أسرار وصف المنازل السفلية\n\n\nومقاماتها وكيف يرتاح العارف عند ذكره بدايته فيحن إليها مع علو مقامه وما السر الذي يتجلى له حتى يدعوه إلى ذلك‏\n\n\n> ولما رأيت الحق بالأول اتصف *** أتيت إلى بحر البداية اغترف‏\n\n\n> بلذة ظمئان لا شرب شربة *** فيشهدني في غاية الحال اعترف‏\n\n\n> فيا بردها من شربة مستلذة *** على كبد حراء فاعمل لها وقف‏\n\n\n> فإن لذاك الشرب في القلب لذة *** ترى ربها في الوقت بالعجب يتصف‏\n\n\n> ولا يحجبنه عجبه عن شهوده *** ولا ما يرى فيه من الزهو والصلف‏\n\n\n> فإن له فيمن تقدم أسوة *** فما خلف إلا ومثل لها سلف‏\n\n\n> وراثة مختار ونعت محقق *** بأسماء حق بالحقيقة مكتنف‏\n\n\n> وإن نهايات الرجال بداية *** لقوم أتوا من بعدهم ما لهم خلف‏\n\n\n> كمثل رسول الله في طوره فما *** له خلف بل عنده الأمر قد وقف‏\n\n\n### [العالم أكرى الشكل ولهذا حن الإنسان في نهايته إلى بدايته‏]\n\n\nاعلم أن العالم لما كان أكرى الشكل لهذا حن الإنسان في نهايته إلى بدايته فكان خروجنا من العدم إلى الوجود به سبحانه وإليه نرجع كما قال عز وجل وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ وقال واتَّقُوا يَوْماً تُرْجَعُونَ فِيهِ إِلَى الله وقال وإِلَيْهِ الْمَصِيرُ وإِلَى الله عاقِبَةُ الْأُمُورِ أ لا تراك إذا بدأت وضع دائرة فإنك عند ما تبتدئ بها لا تزال تديرها إلى أن تنتهي إلى أولها وحينئذ تكون دائرة ولو لم يكن الأمر كذلك لكنا إذا خرجنا من عنده خطا مستقيما لم نرجع إليه ولم يكن يصدق قوله وهو الصادق وإِلَيْهِ تُرْجَعُونَ وكل أمر وكل موجود فهو دائرة يعود إلى ما كان منه بدؤه وأن الله تعالى قد عين لكل موجود مرتبته في علمه فمن الموجودات من خلقت في مراتبها ووقفت ولم تبرح فلم يكن لها بداية ولا نهاية بل يقال وجدت فإن البدء ما تعقل حقيقته إلا بظهور ما يكون بعده مما ينتقل إليه وهذا ما انتقل فعين بدئه هو عين وجوده لا غير ومن الموجودات ما كان وجودها أولا في مراتبها ثم نزل بها إلى عالم طبيعتها وهي الأجسام المولدة من العناصر ولا كلها بل أجسام الثقلين‏\n\n\n### [الداعي المقام في كل مرتبة يدعو الموجودات إليها]\n\n\nوأقام الله لها في تلك المرتبة المعينة لها التي أنزلت منها على غير علم منها بها داعيا يدعو كل شخص إليها فلا يزال يرتقي بالأعمال الصالحة حتى يصل إليها أو يطلبها بالأعمال التي لا يرتضيها الحق فداعي الحق إذا قام بقلب العبد إنما يدعوه من مقامه الذي تكون غايته إليه إذا سلك ولما كان كل وارد ملذوذا لذيذا فإنه جديد غريب لطيف لهذا يحن إليه دائما ومن ذلك حب الأوطان قال ابن الرومي‏\n\n\n> وحبب أوطان الرجال إليهمو *** مآرب قضاها الشباب هنالكا\n\n\n> إذا ذكروا أوطانهم ذكرتهمو *** عهود الصبي فيها فحنوا لذلكا\n\n\nولما لم يتمكن للتائب أن يرد عليه وارد التوبة إلا حتى ينتبه من سنة الغفلة فيعرف ما هو فيه من الأعمال التي مالها إلى هلاكه وعطبه خاف ورأى أنه في أسر هواه وأنه مقتول بسيف أعماله القبيحة فقال له حاجب الباب قد رسم الملك أنك إذا أقلعت عن هذه المخالفات ورجعت إليه ووقفت عند حدوده ومراسمه أنه يعطيك الأمان من عقابه ويحسن إليك ويكون من جملة إحسانه أن كل قبيح أتيته ترد صورته حسنة\n\n\n### [التوقيعات الإلهية الثلاثة]\n\n\nثم أعطاه التوقيع الإلهي فإذا فيه مكتوب بسم الله الرحمن الرحيم الَّذِينَ لا يَدْعُونَ مَعَ الله إِلهاً آخَرَ ولا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ الله إِلَّا بِالْحَقِّ ولا يَزْنُونَ ومن يَفْعَلْ ذلِكَ يَلْقَ أَثاماً يُضاعَفْ لَهُ الْعَذابُ يَوْمَ الْقِيامَةِ ويَخْلُدْ فِيهِ مُهاناً إِلَّا من تابَ وآمَنَ وعَمِلَ عَمَلًا صالِحاً فَأُوْلئِكَ يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ ولما قرأ وحشي هذا التوقيع قال ومن لي بأن أوفق إلى العمل الصالح الذي اشترطه علينا في التبديل‏\nفجاء في الجواب توقيع آخر فيه مكتوب إِنَّ الله لا يَغْفِرُ أَنْ يُشْرَكَ به ويَغْفِرُ ما دُونَ ذلِكَ لِمَنْ يَشاءُ فقال وحشي ما أدري هل أنا ممن شاء أن يغفر له أم لا فجاء في الجواب توقيع ثالث فيه مكتوب يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ فلما قرأ وحشي هذا التوقيع قال الآن فأسلم‏\n\n\n### [التوبة بعد الذنب وحلاوة الأمن عند الرب‏]\n\n\nرجعنا إلى التوقيع الأول فنقول فلما قرأ هذا التوقيع الصادق الذي لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ\n\n\nقال له حاجب الباب وهو الشارع إن التائب من الذنب كمن لا ذنب له‏\n\n\nفلما ورد عليه هذا الأمان عقيب ذلك الخوف الشديد وجد للأمان حلاوة ولذة لم يكن يعرفها قبل ذلك وقد قيل في ذلك‏\n\n\nأحلى من الأمن عند الخائف الوجل‏\n\n\nفعند ما يحصل له طعم هذه اللذة وشرع في الأعمال الصالحة وتطهر محله واستعد لمجالسة الملك‏\n\n\nفإنه يقول أنا جليس من ذكرني‏\n\n\nوتقوت معرفته به سبحانه وعلم ما يستحقه جلاله وعلم قدر من عصاه استحيا كل الحياء وذهبت لذته التي وجدها عند ورود وارد توبته عليه واطلع ورأى الحضرة الإلهية تطالبه بالأدب والشكر على ما أولاه من النعم فيكثر همه وغمه وتنتفي لذته ولهذا ترى العلماء بالله لا يرون في نومهم ما يراه المريدون أصحاب البدايات من الأنوار فإن المبتدئ يستحضر مستحسنات أعماله وأحواله فيرى نتائجها والعالمون ينامون على رؤية تقصير وتفريط لما يستحقه الجناب العالي فلا يرى في النوم إلا ما يهمهم من ظلمات ورعد وبرق وكل أمر مخوف فإن النوم تابع للحس ولما كانت النفس بطبعها تحب الأمور الملذوذة وقد فقدت لذة التوبة في حال معرفتها ونهايتها لذلك حنت إلى بدايتها من أجل ما اقترن بذلك الموطن من اللذة مع علو مقامه ويكون هذا الحنان استراحة لهمه وغمه الذي أعطته معرفته بالله فهو مثل الذي يلتذ بالأماني فهذا سبب حنين أصحاب النهايات إلى بدايتهم‏\n\n\n### [المنازل السفلية وما تعطيه من المقامات العلوية]\n\n\nوأما المنازل السفلية فهي ما تعطيه الأعمال البدنية من المقامات العلوية كالصلاة والجهاد والصوم وكل عمل حسي وما تعطيه أيضا الأعمال النفسية وهي الرياضات من تحمل الأذى والصبر عليه والرضي بالقليل من ملذوذات النفوس والقناعة بالموجود وإن لم تكن به الكفاية وحبس النفس عن الشكوى فإن كل عمل من هذه الأعمال الرياضية والمجاهدات له نتائج مخصوصة ولكل عمل حال ومقام وقد أبان عن بعض ذلك الشارع ليستدل بما ذكره على ما سكت عنه من حيث اختلاف النتائج لاختلاف الصفات وتعريفا بأن النوافل من كل عبادة مفروضة صفتها من صفة فريضتها ولهذا تكمل له منها إذا كانت فريضته ناقصة\n\n\nورد في الحديث الصحيح عن رسول الله صلى الله عليه وسلم أنه قال أول ما ينظر فيه من عمل العبد الصلاة فيقول الله انظروا في صلاة عبدي أتمها أم نقصها فإن كانت تامة كتبت له تامة وإن كان انتقص منها شيئا قال انظروا هل لعبدي من تطوع فإن كان له تطوع قال أكملوا لعبدي فريضته من تطوعه ثم تؤخذ الأعمال على ذاكم‏\n\n\nوأما الحديث الآخر في صفات العبادات فإنه‏\n\n\nورد في الصحيح أن رسول الله صلى الله عليه وسلم قال الصلاة نور والصدقة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها\n\n\nفجعل النور للصلاة والبرهان للصدقة وهي الزكاة والضياء للصوم والحج وهو المعبر عنه بالصبر لما فيها من المشقة للجوع والعطش وما يتعلق بأفعال الحج وجعل لا إله إلا الله في خبر آخر لا يزنها شي‏ء\n\n\nونوافل كل فريضة من هذه الفرائض من جنسها فصفتها كصفتها ثم أدخل في قوله كل الناس يغدو فبائع نفسه فمعتقها وهو الذي باعها من الله قال تعالى إِنَّ الله اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ أو موبقها وهو الذي اشترى الضَّلالَةَ بِالْهُدى‏ والْعَذابَ بِالْمَغْفِرَةِ فعم بقوله كل الناس يغدو فبائع نفسه جميع أحكام الشريعة نافلتها وفريضتها ومباحها ومكروهها\n\n\n### [العبادات الشرعية وارتباطها بالأسماء والحقائق الإلهية]\n\n\nفما من عبادة شرعها الله تعالى لعباده إلا وهي مرتبطة باسم إلهي أو حقيقة إلهية من ذلك الاسم يعطيه في عبادته تلك ما يعطيه في الدنيا في قلبه من منازله وعلومه ومعارفه وفي أحواله من كراماته وآياته وفي آخرته في جناته في درجاته ورؤية خالقه في الكثيب في جنة عدن خاصة في مراتبه وقد قال الله عز وجل في المصلي إنه يناجيه وهو نور\n\n\nفيناجيه الله تعالى من اسمه النور لا من اسم آخر فكما أن النور ينفر كل ظلمة كذلك الصلاة تقطع كل شغل بخلاف سائر الأعمال فإنها لا نعم ترك كل ما سواها مثل الصلاة فلهذا كانت نورا يبشره الله بذلك أنه إذا ناجاه من اسمه النور انفرد به وأزال كل كون بشهوده عند مناجاته ثم شرعها في المناجاة سرا\nوجهرا ليجمع له فيها بين الذكرين ذكر السر وهو الذكر في نفسه وذكر العلانية وهو الذكر في الملإ العبد في صلاته يذكر الله في ملأ الملائكة ومن حضر من الموجودات السامعين وهو ما يجهر به من القراءة في الصلاة\n\n\nقال الله تعالى في الخبر الثابت عنه إن ذكرني في نفسه ذكرته في نفسي وإن ذكرني في ملأ ذكرته في ملأ خير منه‏\n\n\nقد يريد بذلك الملائكة المقربين الكروبيين خاصة الذين اختصهم لحضرته فلهذا الفضل شرع لهم في الصلاة الجهر بالقراءة والسر فكل عبد صلى ولم تزل عنه صلاته كل شي‏ء دونها فما صلى وما هي نور في حقه وكل من أسر القراءة في نفسه ولم يشاهد ذكر الله له في نفسه فما أسر فإنه وإن أسر في الظاهر وأحضر في نفسه ما أحضره من الأكوان من أهل وولد وأصحاب من عالم الدنيا وعالم الآخرة وأحضر الملائكة في خاطره فما أسر في قراءته ولا كان ممن ذكر الله في نفسه لعدم المناسبة فإن الله إذا ذكر العبد في نفسه لم يطلع أحد من المخلوقين على ما في نفس الباري من ذكره عبده كذلك ينبغي أن يكون العبد فيما أسره فإنه ما يناجي في صلاته إلا ربه في حال قراءته وتسبيحاته ودعائه وكذلك إذا ذكره في ملأ في ظاهره وفي باطنه فأما في ظاهره فبين وأما في باطنه فما يحضر معه في نفسه من المخلوقين وهو ما يجهر به من القراءة في الصلاة والتسبيحات والدعاء\n\n\n### [نسبة النورية في الصلاة ومقامات المقربين‏]\n\n\nثم إنه ليس في العبادات ما يلحق العبد بمقامات المقربين وهو أعلى مقام أولياء الله من ملك ورسول ونبي وولي ومؤمن إلا الصلاة قال تعالى واسْجُدْ واقْتَرِبْ فإن الله في هذه الحالة يباهي به المقربين من ملائكته وذلك أنه يقول لهم يا ملائكتي أنا قربتكم ابتداء وجعلتكم من خواص ملائكتي وهذا عبدي جعلت بينه وبين مقام القربة حجبا كثيرة وموانع عظيمة من أغراض نفسية وشهوات حسية وتدبير أهل ومال وولد وخدم وأصحاب وأهوال عظام فقطع كل ذلك وجاهد حتى سجد واقترب فكان من المقربين فانظروا ما خصصتكم به يا ملائكتي من شرف المقام حيث ما ابتليتكم بهذه الموانع ولا كلفتكم مشاقها فاعرفوا قدر هذا العبد وراعوا له حق ما قاساه في طريقه من أجلي فيقول الملائكة يا ربنا لو كنا ممن يتنعم بالجنان وتكون محلا لإقامتنا أ لست كنت تعين لنا فيه منازل تقتضيها أعمالنا ربنا نحن نسألك أن تهبها لهذا العبد فيعطيه الله ما سألته فيه الملائكة فانظروا ما أشرف الصلاة وأفضل ما فيها ذكر الله من الأقوال والسجود من الأفعال ومن أقوالها سمع الله لمن حمده فإنه من أفضل أحوال العبد في الصلاة للنيابة عن الحق‏\n\n\nفإن الله قال على لسان عبده سمع الله لمن حمده‏\n\n\nيقول تعالى إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ الظاهر للتحريم والتحليل الذي فيها ولَذِكْرُ الله أَكْبَرُ يعني فيها من أفعالها\n\n\n### [ذكر الله بالأذكار الواردة في القرآن‏]\n\n\nوينبغي للمحقق أنه لا يذكر الله إلا بالأذكار الواردة في القرآن حتى يكون في ذكره تاليا فيجمع بين الذكر والتلاوة معا في لفظ واحد فيحصل على أجر التالين والذاكرين أعني الفضيلة فيكون فتحه في ذلك من ذلك القبيل وعلمه وسره وحاله ومقامه ومنزله وإذا ذكره من غير أن يقصد الذكر الوارد في القرآن فهو ذاكر لا غير فينقصه من الفضيلة على قدر ما نقصه من القصد ولو كان ذلك الذكر من القرآن غير أنه لم يقصده وقد ثبت أن الأعمال بالنيات وإنما لامرئ ما نوى‏\n\n\nفينبغي لك إذا قلت لا إله إلا الله أن تقصد بذلك التهليل الوارد في القرآن مثل قوله تعالى فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله وكذلك التسبيح والتكبير والتحميد وأنت تعلم أن أنفاس الإنسان نفيسة والنفس إذا مضى لا يعود فينبغي لك أن تخرجه في الأنفس والأعز فهذا قد نبهتك على نسبة النورية من الصلاة\n\n\n### [يسر اقتران البرهان بالصدقة، والضياء بالصبر]\n\n\nوأما اقتران البرهان بالصدقة فهو إن الله تعالى جبل الإنسان على الشح وقال إِنَّ الْإِنْسانَ خُلِقَ هَلُوعاً يعني في أصل نشأته إِذا مَسَّهُ الشَّرُّ جَزُوعاً وإِذا مَسَّهُ الْخَيْرُ مَنُوعاً وقال ومن يُوقَ شُحَّ نَفْسِهِ فنسب الشح لنفس الإنسان وأصل ذلك إنه استفاد وجوده من الله ففطر على الاستفادة لا على الإفادة فما تعطي حقيقته أن يتصدق فإذا تصدق كانت صدقته برهانا على أنه قد وقى شح نفسه الذي جبله الله عليه فلذلك قال الصدقة برهان ولما كانت الشمس ضياء يكشف به كل ما تنبسط عليه لمن كان له بصر فإن الكشف إنما يكون بضياء النور لا بالنور فإن النور ما له سوى تنفير الظلمة وبالضياء يقع الكشف وإن النور حجاب كما هي الظلمة حجاب‏\n\n\nقال رسول الله صلى الله عليه وسلم في حق ربه تعالى حجابه النور\n\n\nوقال إن لله سبعين حجابا من نور وظلمة أو سبعين ألفا\n\n\nوقيل له صلى الله عليه وسلم أ رأيت ربك فقال صلى الله‏\nعليه وسلم نور إني أراه‏\n\n\nفجعل الصبر الذي هو الصوم والحج ضياء أي يكشف به إذا كنت متلبسا به ما تعطيه حقيقة الضوء من إدراك الأشياء\n\n\n### [الصوم صفة صمدانية: فهو لله وهو الذي يجزى به‏]\n\n\nقال رسول الله صلى الله عليه وسلم عن ربه تعالى إنه قال كل عمل ابن آدم له إلا الصوم فإنه لي وأنا أجزي به‏\n\n\nوقال صلى الله عليه وسلم لرجل عليك بالصوم فإنه لا مثل له‏\n\n\nوقال تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فالصوم صفة صمدانية وهو التنزه عن التغذي وحقيقة المخلوق التغذي فلما أراد العبد أن يتصف مما ليس من حقيقته أن يتصف به وكان اتصافه به شرعا لقوله تعالى كُتِبَ عَلَيْكُمُ الصِّيامُ كَما كُتِبَ عَلَى الَّذِينَ من قَبْلِكُمْ قال الله له الصوم لي لا لك أي أنا هو الذي لا ينبغي لي أن أطعم وأشرب وإذا كان بهذه المثابة وكان سبب دخولك فيه كوني شرعته لك فأنا أجزي به كأنه يقول وأنا جزاؤه لأن صفة التنزه عن الطعام والشراب تطلبني وقد تلبست بها وما هي حقيقتك وما هي لك وأنت متصف بها في حال صومك فهي تدخلك علي فإن الصبر حبس النفس وقد حبستها بأمري عما تعطيه حقيقتها من الطعام والشراب فلهذا\n\n\nقال للصائم فرحتان فرحة عند فطره وتلك الفرحة لروحه الحيواني لا غير وفرحة عند لقاء ربه‏\n\n\nوتلك الفرحة لنفسه الناطقة أي لطيفته الربانية فأورثه الصوم لقاء الله وهو المشاهدة\n\n\n### [الصوم مشاهدة والصلاة مناجاة]\n\n\nفكان الصوم أتم من الصلاة لأنه أنتج لقاء الله ومشاهدته والصلاة مناجاة لا مشاهدة والحجاب يصحبها فإن الله يقول وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ وكذلك كلم الله موسى ولذلك طلب الرؤية فقرن الكلام بالحجاب والمناجاة مكالمة\n\n\nيقول الله قسمت الصلاة بيني وبين عبدي نصفين نصفها لي ونصفها لعبدي ولعبدي ما سأل‏\n\n\nيقول العبد الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ يقول الله حمدني عبدي والصوم لا ينقسم فهو لله لا للعبد أجره من حيث ما هو لله وهنا سر شريف فقلنا إن المشاهدة والمناجاة لا يجتمعان فإن المشاهدة للبهت والكلام للفهم فأنت في حال الكلام مع ما يتكلم به لا مع المتكلم أي شي‏ء كان فافهم القرآن تفهم الفرقان فبهذا قد حصل لك الفرق بين الصلاة والصوم والصدقة وأما قولنا إن الله جزاء الصائم للقائه ربه في الفرح به الذي قرنه به فسر ذلك في قوله في سورة يوسف من وُجِدَ في رَحْلِهِ فَهُوَ جَزاؤُهُ‏\n\n\n### [الحج وما فيه من ألوان الصبر]\n\n\nوأما الحج فلما فيه من الصبر وهو حبس الإنسان نفسه عن النكاح ولبس المخيط والصفرة كما حبس الإنسان نفسه عن الطعام في الصوم والشراب والنكاح ولما لم يعم الحج مسك الإنسان نفسه عن الطعام والشراب إلا عن النكاح والغيبة لذلك تأخر في القواعد التي بنى الإسلام عليها فكان حكمه حكم للصائم والمصلي حال صومه وصلاته في التنزه عن مباشرة السكن وذلك التنزه يقول الله هو لي لا لك حيث كان ولما كان النكاح سببا لظهور المولدات من ذلك أعطاه الله إذ تركه من أجله بدله كن في الآخرة ولأوليائه في الدنيا بسم الله لمن أراد الله أن يظهر على يده أثرا فيقول العبد في الآخرة للشي‏ء يريده كُنْ فَيَكُونُ ذلك الشي‏ء وليس قوله إلا من كونه حاجا أو صائما ولهذا شرك بين الحج والصوم في لفظة الصبر فقال والصبر ضياء هذا وإن لم يكن فيه صوم واجب فإن ترك الطعام فيه لشغله بالدعاء في ذلك اليوم من الظهر وهو السنة في ذلك اليوم في ذلك الموضع للحاج خاصة فالمشتغل فيه لا شك أن الجوع جوع العادة يلزمه‏\n\n\n### [الموتات الأربعة عند الصوفية]\n\n\nوالطائفة تسمى الجوع في الموتات الأربعة الموت الأبيض وهو مناسب للضياء فإن لأهل الله أربع موتات موت أبيض وهو الجوع وموت أحمر وهو مخالفة النفس في هواها وموت أخضر وهو طرح الرقاع في اللباس بعضها على بعض وموت أسود وهو تحمل أذى الخلق بل مطلق الأذى وإنما سميت لبس المرقعات موتا أخضر لأن حالته حالة الأرض في اختلاف النبات فيه والأزهار فأشبه اختلاف الرقاع وأما الموت الأسود لاحتمال الأذى فإن في ذلك غم النفس والغم ظلمة النفس والظلمة تشبه في الألوان السواد والموت الأحمر مخالفة النفس شبيه بحمرة الدم فإنه من خالف هواه فقد ذبح نفسه وسيأتي إن شاء الله في هذا الكتاب أبواب مفردات في شهادة التوحيد والصلاة والزكاة والصوم والحج وهي قواعد الإسلام التي بنى عليها ومن أراد أن يعرف من أسرار الصلاة شيئا وما تنتج كل صلاة من المعارف وما لها من الأرواح النبوية والحركات الفلكية فلينظر في كتابنا المسمى بالتنزلات الموصلية وهذا القدر في هذا الباب كاف في المقصود ولنذكر بعض أسرار من المعارف كما ترجمنا عليه بطريق الإيجاز\n\n\n### (فصل) بل وصل سر إلهي [سر القدر المتحكم في البشر]\n\n\nقالت الملائكة وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ وهكذا كل موجود ما عدا الثقلين وإن كان‏\nالثقلان أيضا مخلوقين في مقامهما غير أن الثقلين لهما في علم الله مقامات معينة مقدرة عنده غيبت عنهما إليها ينتهي كل شخص منهما بانتهاء أنفاسه فأخر نفس هو مقامه المعلوم الذي بموت عليه ولهذا دعوا إلى السلوك فسلكوا علوا بإجابة الدعوة المشروعة وسفلا بإجابة الأمر الإرادي من حيث لا يعلمون إلا بعد وقوع المراد فكل شخص من الثقلين ينتهي في سلوكه إلى المقام المعلوم الذي خلق له ومنهم شقي وسعيد وكل موجود سواهما فمخلوق في مقامه فلم ينزل عنه فلم يؤمر بسلوك إليه لأنه فيه من ملك وحيوان ونبات ومعدن فهو سعيد عند الله لا شقاء يناله فقد دخل الثقلان في قول الملائكة وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ عند الله ولا يتمكن لمخلوق من العالم أن يكون له علم بمقامه إلا بتعريف إلهي لا بكونه فيه فإن كل ما سوى الله ممكن ومن شأن الممكن أن لا يقبل مقاما معينا لذاته وإنما ذلك لمرجحه بحسب ما سبق في علمه به والمعلوم هو الذي أعطاه العلم به ولا يعلم هو ما يكون عليه وهذا هو سر القدر المتحكم في الخلق إذ كان علم المرجح لا يقبل التغيير لاستحالة عدم القديم وعلمه بتعيين المقامات قديم فلذلك لا ينعدم‏\n\n\n### [علم الباري بالأشياء ليس زائدا على ذاته‏]\n\n\nوهذه المسألة من أغمض المسائل العقلية ومما يدلك على إن علمه سبحانه بالأشياء ليس زائدا على ذاته بل ذاته هي المتعلقة من كونها علما بالمعلومات على ما هي المعلومات عليه خلافا لبعض النظار فإن ذلك يؤدي إلى نقص الذات عن درجة الكمال ويؤدي إلى أن تكون الذات قد حكم عليها أمر زائد أوجب لها ذلك الزائد حكما يقتضيه ويبطل كون الذات تفعل ما تشاء وتختار لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ فتحقق هذه المسألة وتفرغ إليها فإنها غامضة جدا في مسائل الحيرة لا يهتدي إليها عقل على الحقيقة من حيث فكره بل بكشف إلهي نبوي‏\n\n\n### [التفاضل بين بني آدم وبين الملائكة]\n\n\nثم نرجع ونقول إن جماعة من أصحابنا غلطت في هذه المسألة لعدم الكشف فقالت بطريق القوة ولفكر الفاسد إن الكامل من بنى آدم أفضل من الملائكة عند الله مطلقا ولم تقيد صنفا ولا مرتبة من المراتب التي تقع عليها الفضلية لمن هو فيها على غيره ثم عللت فقالت إن لبني آدم الترقي مع الأنفاس وليس للملائكة هذا فإنها خلقت في مقامها وما علمت الجماعة القائلة بهذا هذه الحقيقة التي نبهنا عليها والصحيح الترقي أن لنا وللملائكة ولغيرهم وهو لازم للكل دنيا وبرزخا وآخره هذا لكل متصف بالموت في العلم أ لا ترى الملائكة مع كونها لها مقامات معلومة لا تتعداها وما حرمت مزيد العلم فإن الله قد عرفنا أنه علمهم الأسماء على لسان آدم عليه السلام فزادهم علما إلهيا لم يكن عندهم بالأسماء الإلهية فسبحوه وقدسوه بها فساوتنا الملائكة في الترقي بالعلم لا بالعمل كما لا نترقى نحن بأعمال الآخرة لزوال التكليف فنحن وإياهم على السواء في ذلك في الآخرة فما ارتقينا نحن في الدنيا إلى المقام الذي قبضنا عليه وهو المقام الذي خلق فيه غيرنا ابتداء لشرفنا على غيرنا وإنما كان ذلك ليبلونا لا غير فلم يفهم القائلون بذلك ما أراده الله مع وجود النصوص في القرآن مثل قوله لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا ولا يقال كونهم خلقوا على الصورة أدى إلى ذلك الابتلاء فإن الجان شاركونا في هذه المرتبة وليس لهم حظ في الصورة فاعلم والله الموفق‏\n\n\n### (وصل سر إلهي) [افتقار العالم إلى الله وغنى الله عن العالم‏]\n\n\nنهاية الدائرة مجاورة لبدايتها وهي تطلب النقطة لذاتها والنقطة لا تطلبها فصح نهاية أهل الترقي من العالم وصح افتقار العالم إلى الله وغنى الله عن العالم وتبين أنه كل جزء من العالم يمكن أن يكون سببا في وجود عالم آخر مثله لا أكمل منه إلى ما لا يتناهى فإن محيط الدائرة نقط متجاورة في أحياز متجاورة ليس بين حيزين حيز ثالث ولا بين النقطتين المفروضتين أو الموجودتين فيهما نقطة ثالثة لأنه لا حيز بينهما فكل نقطة يمكن أن يكون عنها محيط وذلك المحيط الآخر حكمه حكم المحيط الأول إلى ما لا نهاية له‏\n\n\n### [النهاية في العالم حاصلة لا الغاية منه‏]\n\n\nوالنهاية في العالم حاصلة والغاية من العالم غير حاصلة فلا تزال الآخرة دائمة التكوين عن العالم فإنهم يقولون في الجنان للشي‏ء يريدونه كن فيكون فلا يتوهمون أمرا ما ولا يخطر لهم خاطر في تكوين أمر ما إلا ويتكون بين أيديهم وكذلك أهل النار لا يخطر لهم خاطر خوف من عذاب أكبر مما هم فيه إلا تكون فيهم أو لهم ذلك العذاب وهو عين حصول الخاطر فإن الدار الآخرة تقتضي تكوين العالم عن العالم لكن حسا وبمجرد حصول الخاطر والهم والإرادة والتمني والشهوة كل ذلك محسوس وليس ذلك في الدنيا أعني من الفعل بالهمة لكل أحد وقد كان ذلك في الدنيا لغير الولي كصاحب العين والغرانية بإفريقية ولكن ما يكون بسرعة تكوين الشي‏ء بالهمة في الدار الآخرة وهذا في الدار الدنيا نادر شاذ كقضيب البان وغيره وهو في الدار الآخرة للجميع‏\n\n\n### [ليس في الإمكان أبدع من هذا العالم‏]\n\n\nفصدق قول الإمام أبي حامد ليس في الإمكان أبدع من هذا العالم لأنه ليس أكمل من الصورة التي خلق عليها الإنسان‏\nالكامل فلو كان لكان في العالم ما هو أكمل من الصورة التي هي الحضرة الإلهية\n\n\n### (وصل سر إلهي) [وحدة نقطة المركز وكثرة الخطوط الخارجة منها إلى المحيط]\n\n\nكل خط يخرج من النقطة إلى المحيط مساو لصاحبه وينتهي إلى نقطة من المحيط والنقطة في ذاتها ما تعددت ولا تزيدت مع كثرة الخطوط الخارجة منها إلى المحيط وهي تقابل كل نقطة من المحيط بذاتها إذ لو كان ما تقابل به نقطة من المحيط غير ما تقابل به نقطة أخرى لانقسمت ولم يصح أن تكون واحدة وهي واحدة فما قابلت النقط كلها على كثرتها إلا بذاتها فقد ظهرت الكثرة عن الواحد العين ولم يتكثر هو في ذاته فبطل قول من قال إنه لا يصدر عن الواحد إلا واحد فذلك الخط الخارج من النقطة إلى النقطة الواحدة من المحيط هو الوجه الحاصل الذي لكل موجود من خالقه سبحانه وهو قوله إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ فالإرادة هنا هو ذلك الخط الذي فرضناه خارجا من نقطة الدائرة إلى المحيط وهو التوجه الإلهي الذي عين تلك النقطة في المحيط بالإيجاد لأن ذلك المحيط هو عين دائرة الممكنات والنقطة التي في الوسط المعينة لنقطة الدائرة المحيطة هي الواجب الوجود لنفسه‏\n\n\n### [الممكنات محصورة في جوهر متحيز وغير متحيز وأكوان وألوان‏]\n\n\nوتلك الدائرة المفروضة دائرة أجناس الممكنات وهي محصورة في جوهر متحيز وجوهر غير متحيز وأكوان وألوان والذي لا ينحصر وجود الأنواع والأشخاص وهو ما يحدث من كل نقطة من كل دائرة من الدوائر فإنه يحدث فيها دوائر الأنواع وعن دوائر أنواع وأشخاص فاعلم ذلك والأصل النقطة الأولى لهذا كله وذلك الخط المتصل من النقطة إلى النقطة المعينة من محيطها يمتد منها إلى ما يتولد عنها من النقط في نصف الدائرة الخارجة عنها وعن ذلك النصف تخرج دوائر كاملة وعلة ذلك الامتياز بين الواجب الوجود لنفسه وبين الممكن فلا يتمكن أن يظهر عن الممكن الذي هو دائرة الأجناس دائرة كاملة فإنها كانت تدخل بالمشاركة فيما وقع به الامتياز وذلك محال فتكوين دائرة كاملة من الأجناس محال ليتبين نقص الممكن عن كمال الواجب الوجود لنفسه وصورة الأمر فيها هكذا صورة شكل الأجناس والأنواع من غير قصد للحصر إذ للأنواع أنواع حتى ينتهي إلى النوع الأخير كما ينتهي إلى جنس الأجناس‏\n\n\n### [القوتان العلمية والعلمية ساريتان في نفوس الثقلين والحيوان‏]\n\n\nواعلم أن لنفوس الثقلين ونفوس الحيوان قوتين قوة علمية وقوة عملية عند أهل الكشف وقد ظهر ذلك في العموم من الحيوان كالنحل والعناكب والطيور التي تتخذ الأوكار وغيرهم من الحيوانات ولنفوس الثقلين دون سائر الحيوان قوة ثالثة ليست للحيوان ولا للنفس الكلية وهي القوة المفكرة فيكتسب بعض العلوم من الفكر هذا النوع الإنساني ويشارك سائر العالم في أخذ العلوم من الفيض الإلهي وبعض علومها كالحيوان بالفطرة كتلقي الطفل ثدي أمه للرضاعة وقبوله للبن‏\n\n\n### [الفكر من الإنسان بمنزلة التدبير والتفصيل من الله‏]\n\n\nوليس لغير الإنسان اكتساب علوم تبقي معه من طريق فكر فالفكر من الإنسان بمنزلة الحقيقة الإلهية المنصوص عليها بقوله تعالى يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ وقوله تعالى في الخبر الصحيح عنه ما ترددت في شي‏ء أنا فاعله‏\n\n\nوليس للعقل الأول هذه الحقيقة ولا للنفس الكلية فهذا أيضا مما اختص به الإنسان من الصورة التي لم يخلق غيره عليها\n\n\n### [الإنسان الكامل مخلوق على الصورة]\n\n\nونحن نعلم أن الإنسان الكامل موجود على الصورة ونحن تقطع أنه ما أوجد الله غير الإنسان على ذلك فإنه‏\nما ورد وقوع ذلك ولا عدم وقوعه لا على لسان نبي ولا في كتاب منزل وإن غلط في ذلك جماعة فإنهم لم يستندوا فيه إلى تعريف إلهي وإنما يحتجون بالخبر وليس في الخبر ما يدل على إن غير الإنسان الكامل ما خلق على الصورة ويمكن صحة ذلك ويمكن عدم صحته‏\n\n\n### (وصل سر إلهي) [الطبيعة بين النفس الكلية والمادة الأولى‏]\n\n\nالطبيعة بين النفس والهباء وهو رأى الإمام أبي حامد ولا يمكن أن تكون مرتبتها إلا هنالك فكل جسم قبل الهباء إلى آخر موجود من الأجسام فهو طبيعي وكل ما تولد من الأجسام الطبيعية من الأمور والقوي والأرواح الجزئية والملائكة والأنوار فللطبيعة فيها حكم إلهي قد جعله الله تعالى وقدره فحكم الطبيعة من الهباء إلى ما دونه وحكم النفس الكلية من الطبيعة فما دونها وما فوق النفس فلا حكم للطبيعة ولا للنفس فيه وفيما ذكرناه خلاف كثير بين أصحاب النظر من غير طريقنا من الحكماء فإن المتكلم لا حظ له في هذا العلم من كونه متكلما بخلاف الحكيم فإن الحكيم عبارة عمن جمع العلم الإلهي والطبيعي والرياضي والمنطقي وما ثم إلا هذه الأربع المراتب من العلوم‏\n\n\n### [العلم النظري والعلم الوهبي‏]\n\n\nوتختلف الطريق في تحصيلها بين الفكر والوهب وهو الفيض الإلهي وعليه طريقة أصحابنا ليس لهم في الفكر دخول لما يتطرق إليه من الفساد والصحة فيه مظنونة فلا يوثق بما يعطيه وأعني بأصحابنا أصحاب القلوب والمشاهدات والمكاشفات لا العباد ولا الزهاد ولا مطلق الصوفية إلا أهل الحقائق والتحقيق منهم ولهذا يقال في علوم النبوة والولاية إنها وراء طور العقل ليس للعقل فيها دخول بفكر لكن له القبول خاصة عند السليم العقل الذي لم يغلب عليه شبهة خيالية فكرية يكون من ذلك فساد نظره وعلوم الأسرار كثيرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "(Chapter Forty-Seven) Concerning the knowledge of the secrets of describing the Lower Stations (المنازل السفلية) and their Stations (مقاماتها), and how the Gnostic (العارف) finds rest when remembering his beginning, yearning for it despite the loftiness of his station, and the secret that is unveiled (يتجلى) to him that calls him to that.\n\nWhen I saw the Real (الحق) described by the First,\nI came to the sea of the beginning to draw water,\n\nWith the pleasure of one thirsty, not having drunk a single sip,\nSo that He witnesses me acknowledging [Him] in the ultimate state.\n\nOh, how cool is that delightful drink\nUpon a burning liver! Strive for it and dedicate yourself.\n\nFor that drink has a pleasure in the heart,\nSeeing its Lord described by wonder in that moment.\n\nAnd His wonder does not veil him from witnessing Him (شهوده),\nNor what he sees therein of pride and arrogance.\n\nFor he has an example in those who preceded him;\nThere is no successor except that he has a predecessor like him.\n\nAn inheritance of the chosen one, and a description of the realized one,\nEncompassed by the Names of the Real (أسماء حق) through the Reality (الحقيقة).\n\nIndeed, the ends of men are a beginning\nFor a people who came after them, for whom there is no successor.\n\nLike the Messenger of Allah in his stage, for he has no successor;\nRather, the matter stopped with him.\n\n### The World is Spherical, and for this reason, the Human Being Yearns in His End for His Beginning\n\nKnow that since the World (العالم) is spherical (أكرى الشكل), the human being yearns in his end (نهايته) for his beginning (بدايته). Thus, our emergence from Non-existence (العدم) into Existence (الوجود) is through Him, glory be to Him, and to Him we return, as He, the Mighty and Majestic, said: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him the whole matter will be returned). And He said: <<وَاتَّقُوا يَوْماً تُرْجَعُونَ فِيهِ إِلَى الله>> (And fear a Day when you will be returned to Allah). And He said: <<وَإِلَيْهِ الْمَصِيرُ>> (And to Him is the ultimate destination) and <<وَإِلَى اللهِ عَاقِبَةُ الْأُمُورِ>> (And to Allah belongs the outcome of all matters). Do you not see that when you begin to draw a circle, you continue to turn it until you reach its beginning, and only then is it a circle? If the matter were not thus, then if we had departed from Him in a straight line, we would not return to Him, and His saying—and He is the Truthful—<<وَإِلَيْهِ تُرْجَعُونَ>> (And to Him you will be returned) would not be true. Every matter and every existent thing is a circle that returns to the point from which its beginning originated. Allah Almighty has designated for every existent thing its Level (مرتبته) in His Knowledge (علمه). Among existent things are those that were created in their Levels and stopped, never moving, so they had neither a beginning nor an end; rather, it is said they *existed*. For the beginning (البدء) is only truly understood by the appearance of what comes after it, to which it transitions. But this [type of existent] did not transition, so the designation of its beginning is the designation of its Existence (وجوده) and nothing else. Among existent things are those whose Existence was first in their Levels, and then they descended to the world of their nature (عالم طبيعتها)—these are the bodies generated from the elements, though not all of them, but the bodies of the two weighty ones (الثقلين) [humans and jinn].\n\n### The Caller Residing in Every Level Calls Existent Things to It\n\nAllah established for them, in that designated Level (المرتبة المعينة) from which they were sent down—without their knowledge of it—a Caller (داعيًا) who calls every individual back to it. Thus, the individual continues to ascend through righteous deeds (الأعمال الصالحة) until he reaches it, or he seeks it through deeds that the Real (الحق) does not approve. When the Caller of the Real (داعي الحق) stands in the heart of the servant, he calls him only from the station (مقامه) that will be his ultimate destination when he traverses the path. Since every incoming spiritual state (وارد) is delightful and pleasurable, for it is new, strange, and subtle (لطيف), the servant constantly yearns for it. From this comes the love of homelands. Ibn al-Rumi said:\n\nAnd what makes homelands beloved to men\nAre purposes fulfilled by youth there.\n\nWhen they remember their homelands, they remember\nThe covenants of childhood there, and they yearn for that.\n\nSince the penitent (التائب) cannot receive the incoming state of repentance (وارد التوبة) until he awakens from the slumber of heedlessness (سنة الغفلة) and recognizes the deeds he is engaged in that lead to his destruction and ruin, he becomes fearful and sees that he is captive to his desires and slain by the sword of his ugly deeds. The Gatekeeper (حاجب الباب) then tells him: \"The King has decreed that if you cease these transgressions, return to Him, and abide by His limits and decrees, He will grant you security (الأمان) from His punishment and be gracious to you. And among His graces is that every ugly deed you committed will have its form transformed into a beautiful one.\"\n\n### The Three Divine Decrees\n\nThen he gave him the Divine Decree (التوقيع الإلهي), in which was written: In the Name of Allah, the Most Compassionate, the Most Merciful: <<الَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَٰهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا يَزْنُونَ ۚ وَمَن يَفْعَلْ ذَٰلِكَ يَلْقَ أَثَامًا * يُضَاعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيَامَةِ وَيَخْلُدْ فِيهِ مُهَانًا * إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَٰئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ>> (Those who do not invoke with Allah another deity or kill the soul which Allah has forbidden [to be killed], except by right, and do not commit unlawful sexual intercourse. And whoever does that will meet the penalty. The punishment will be doubled for him on the Day of Resurrection, and he will abide therein in humiliation, * Except for those who repent, believe, and do righteous deeds; for those, Allah will change their evil deeds into good deeds). When Wahshi read this Decree, he said: \"Who can guarantee that I will be guided to the righteous deed (العمل الصالح) that He stipulated for us in the transformation?\"\n\nA second Decree came in reply, in which was written: <<إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ>> (Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills). Wahshi said: \"I do not know whether I am among those whom He wills to forgive or not.\" A third Decree came in reply, in which was written: <<يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ>> (O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful). When Wahshi read this Decree, he said: \"Now I submit (أسلم).\"\n\n### Repentance after Sin and the Sweetness of Security with the Lord\n\nWe return to the first Decree and say: When he read this truthful Decree, <<لَا يَأْتِيهِ الْبَاطِلُ مِن بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ ۖ تَنزِيلٌ مِّنْ حَكِيمٍ حَمِيدٍ>> (Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a Wise, Praiseworthy [Lord]), the Gatekeeper—who is the Lawgiver (الشارع)—said to him: \"The one who repents from sin is like one who has no sin.\"\n\nWhen this security (الأمان) came upon him immediately following that intense fear, he found a sweetness and pleasure in the security that he had not known before. It has been said concerning this:\n\nSweeter than security to the fearful, anxious one.\n\nWhen he attains the taste of this pleasure, he begins righteous deeds, his place is purified, and he prepares himself to sit with the King, for He says: \"I am the companion of him who remembers Me.\"\n\nAs his Gnosis (معرفته) of Him, glory be to Him, strengthens, and he learns what His Majesty (جلاله) deserves, and he realizes the measure of the One he disobeyed, he feels the utmost shame. The pleasure he found upon the arrival of the incoming state of repentance (وارد توبته) vanishes. He perceives and sees that the Divine Presence (الحضرة الإلهية) demands from him proper conduct (الأدب) and gratitude for the blessings bestowed upon him. His worry and grief increase, and his pleasure is negated. This is why you see the scholars of Allah (العلماء بالله) do not see in their sleep the Lights (الأنوار) that the novices (المريدون), the people of beginnings (أصحاب البدايات), see. The beginner recalls the beautiful aspects of his deeds and states, and thus sees their results. The Gnostics (العالمون) sleep while perceiving deficiency and shortcoming regarding what the High Presence (الجناب العالي) deserves. Thus, they see nothing in their sleep but what worries them: darkness, thunder, lightning, and every fearful thing. For sleep follows the senses (الحس). Since the soul (النفس) naturally loves pleasurable things, and since it lost the pleasure of repentance in the state of its Gnosis (معرفتها) and end (نهايتها), it therefore yearns for its beginning (بدايتها) because of the pleasure associated with that stage, despite the loftiness of its current station. This yearning is a rest from the worry and grief that his Gnosis of Allah has given him. He is like one who finds pleasure in wishes. This is the reason for the yearning of the people of ends (أصحاب النهايات) for their beginnings.\n\n### The Lower Stations and the Higher Stations they Grant\n\nAs for the Lower Stations (المنازل السفلية), they are what physical deeds (الأعمال البدنية) grant in terms of Higher Stations (المقامات العلوية), such as prayer (الصلاة), struggle (الجهاد), fasting (الصوم), and every sensory deed. They also include what psychological deeds (الأعمال النفسية) grant, which are the spiritual disciplines (الرياضات): enduring harm and being patient with it, being content with little of the soul’s pleasures, accepting what is available even if it is insufficient, and restraining the soul from complaint. Every one of these disciplinary deeds and spiritual struggles (المجاهدات) has specific results, and every deed has a state (حال) and a station (مقام). The Lawgiver (الشارع) has clarified some of this so that what he remained silent about may be inferred from what he mentioned, based on the difference in results due to the difference in attributes, and to make known that the supererogatory acts (النوافل) of every obligatory worship (عبادة مفروضة) share the attribute of their obligatory counterpart. Therefore, they complete the obligatory act if it was deficient.\n\nIt is reported in the authentic Hadith from the Messenger of Allah (peace and blessings be upon him) that he said: \"The first thing that will be examined concerning the servant's deeds is the Prayer (الصلاة).\" Allah will say: \"Look at My servant's prayer. Did he complete it or fall short?\" If it was complete, it is recorded as complete for him. If something was deficient, He says: \"Look, does My servant have any voluntary (تطوع) deeds?\" If he has voluntary deeds, He says: \"Complete My servant's obligatory duty from his voluntary deeds.\" Then the rest of the deeds are taken in the same manner.\n\nAs for the other Hadith concerning the attributes of worship: It is reported in the authentic collection that the Messenger of Allah (peace and blessings be upon him) said: \"Prayer is Light (نور), charity is Proof (برهان), patience is Illumination (ضياء), and the Qur'an is a proof for you or against you. Every person goes out in the morning, selling his soul, either freeing it or destroying it.\"\n\nHe assigned Light (النور) to Prayer, Proof (البرهان) to Charity (الصدقة)—which is Zakat—and Illumination (الضياء) to Fasting and Hajj, which are expressed as Patience (الصبر) due to the hardship involved in hunger, thirst, and the actions related to Hajj. In another report, he stated that *La ilaha illa Allah* (There is no deity but Allah) outweighs everything.\n\nThe supererogatory acts of each of these obligatory duties are of the same genus; their attribute is like its attribute. Then, in His saying, \"Every person goes out in the morning, selling his soul, either freeing it,\"—which is the one who sold it to Allah, as He Almighty said: <<إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ>> (Indeed, Allah has purchased from the believers their lives)—\"or destroying it,\"—which is the one who bought error in exchange for guidance, and punishment in exchange for forgiveness. Thus, His saying, \"Every person goes out in the morning, selling his soul,\" encompasses all rulings of the Sacred Law (الشريعة): its supererogatory, obligatory, permissible, and disliked acts.\n\n### Legal Worship and its Connection to Divine Names and Realities\n\nThere is no act of worship legislated by Allah Almighty for His servants except that it is connected to a Divine Name (اسم إلهي) or a Divine Reality (حقيقة إلهية) derived from that Name. This grants the servant, through that worship, what it grants in this world in his heart—of stations (منازله), sciences (علومه), and Gnosis (معارفه)—and in his states (أحواله)—of miracles (كراماته) and signs (آياته)—and in his Hereafter—in his Gardens (جناته), in his degrees (درجاته), and in the vision of his Creator upon the Dune (الكثيب) in the Garden of Eden (جنة عدن) specifically in his Levels (مراتبه). Allah Almighty said concerning the one who prays that he is conversing privately (يناجيه) with Him, and that it is Light (نور).\n\nAllah converses privately with him from His Name, the Light (النور), and not from another Name. Just as Light dispels all darkness, so too does Prayer cut off every preoccupation, unlike other deeds, for they do not necessitate the abandonment of everything else besides them, like Prayer does. Therefore, it was Light (نور). Allah gives him glad tidings of this: that when He converses privately with him from His Name, the Light, He isolates him and removes every created thing (كون) from his witnessing (شهوده) during his private conversation. Then He legislated it as private conversation (مناجاة) both secretly and openly, so that He might combine for him the two types of remembrance (الذكرين): secret remembrance, which is remembrance within oneself, and open remembrance, which is remembrance in the assembly. The servant in his prayer remembers Allah in the assembly of the angels and those present among the hearing existent things, which is what he recites aloud in the prayer.\n\nAllah Almighty said in the authentic report concerning Him: \"If he remembers Me within himself, I remember him within Myself. If he remembers Me in an assembly, I remember him in an assembly better than it.\"\n\nHe may mean by that assembly the Cherubim (الكروبيين), the closest angels (الملائكة المقربين), whom He specifically chose for His Presence (حضرته). Because of this merit, He legislated for them in the Prayer both audible and silent recitation. Thus, any servant who prays, and whose prayer does not remove everything besides it, has not truly prayed, and it is not Light (نور) in his right. And whoever recites silently within himself but does not witness Allah's remembrance of him within Himself, has not truly kept it secret. For even if he keeps it secret outwardly, if he brings into his mind the created things (الأكوان)—family, children, companions from the world of this life and the world of the Hereafter—and brings the angels into his thought, he has not kept his recitation secret, nor was he among those who remembered Allah within himself, due to the lack of correspondence. For when Allah remembers the servant within Himself, none of the created beings are informed of what is in the Essence (نفس) of the Creator concerning His remembrance of His servant. Likewise, the servant should be in what he keeps secret, for he converses privately only with his Lord during his recitation, glorifications, and supplications. Similarly, when he remembers Him in an assembly, both outwardly and inwardly. As for outwardly, it is clear. As for inwardly, it is what he brings with him in his mind of created beings, which is what he recites aloud in the prayer, the glorifications, and the supplication.\n\n### The Proportion of Luminosity in Prayer and the Stations of the Near Ones\n\nFurthermore, among the acts of worship, nothing attaches the servant to the Stations of the Near Ones (مقامات المقربين)—which is the highest station of Allah's friends (أولياء الله), whether angel, messenger, prophet, saint (ولي), or believer—except the Prayer. Allah Almighty said: <<وَاسْجُدْ وَاقْتَرِبْ>> (And prostrate and draw near). For in this state, Allah boasts of him to the Near Ones among His angels. He says to them: \"O My angels, I brought you near initially and made you among My special angels. But this servant of Mine—I placed many veils and great obstacles between him and the station of nearness (مقام القربة): selfish desires, sensory lusts, management of family, wealth, children, servants, and great terrors. Yet he cut through all of that and struggled until he prostrated and drew near, becoming one of the Near Ones (المقربين). Look at what I have specifically honored you with, O My angels, in the nobility of your station, since I did not test you with these obstacles nor burden you with their hardships. Therefore, recognize the worth of this servant and observe the right of what he endured on My path.\" The angels say: \"Our Lord, if we were among those who enjoy the Gardens (الجنان) and they were a place for our residence, would You not designate for us stations therein necessitated by our deeds? Our Lord, we ask You to bestow those upon this servant.\" And Allah gives him what the angels asked for him. Look then at how noble the Prayer is, and the best parts of it are the remembrance of Allah in words and the prostration (السجود) in actions. And among its words is *Sami‘a Allahu li-man Hamidah* (Allah hears the one who praises Him), for this is one of the best states of the servant in the Prayer, due to the representation of the Real (النيابة عن الحق).\n\nFor Allah said, upon the tongue of His servant: \"Allah hears the one who praises Him.\"\n\nThe Almighty says: <<إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ>> (Indeed, prayer prohibits immorality and wrongdoing)—this is the outward prohibition related to what is lawful and unlawful within it—<<وَلَذِكْرُ اللَّهِ أَكْبَرُ>> (But the remembrance of Allah is greater)—meaning, greater than its actions.\n\n### Remembrance of Allah with the Supplications Mentioned in the Qur'an\n\nThe realized one (المحقق) should remember Allah only with the supplications (الأذكار) mentioned in the Qur'an, so that in his remembrance he is also a reciter (تاليًا), thereby combining remembrance and recitation in a single utterance. Thus, he obtains the reward of both reciters and rememberers—meaning the merit (الفضيلة). His spiritual opening (فتحه), his knowledge (علمه), his secret (سره), his state (حاله), his station (مقامه), and his level (منزله) will be of that category. If he remembers Him without intending the remembrance mentioned in the Qur'an, he is merely a rememberer (ذاكر) and nothing more, and he loses merit (الفضيلة) commensurate with his lack of intention, even if that remembrance is from the Qur'an, provided he did not intend it [ as recitation]. It is established that deeds are judged by intentions, and every person shall have what he intended.\n\nTherefore, when you say *La ilaha illa Allah* (There is no deity but Allah), you should intend the declaration of Unity (التهليل) mentioned in the Qur'an, such as His saying, the Almighty: <<فَاعْلَمْ أَنَّهُ لَا إِلَٰهَ إِلَّا اللَّهُ>> (So know that there is no deity except Allah). The same applies to glorification (التسبيح), magnification (التكبير), and praise (التحميد). You know that the breaths of the human being are precious, and a breath, once gone, does not return. Therefore, you should expend it on the most precious and beloved things. This is how I have alerted you to the proportion of luminosity (نسبة النورية) in the Prayer.\n\n### The Secret of the Association of Proof with Charity, and Illumination with Patience\n\nAs for the association of Proof (البرهان) with Charity (الصدقة): Allah Almighty created man with stinginess (الشح) and said: <<إِنَّ الْإِنسَانَ خُلِقَ هَلُوعًا>> (Indeed, mankind was created anxious)—meaning in the origin of his creation—<<إِذَا مَسَّهُ الشَّرُّ جَزُوعًا * وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا>> (When evil touches him, impatient, * And when good touches him, withholding). And He said: <<وَمَن يُوقَ شُحَّ نَفْسِهِ>> (And whoever is protected from the stinginess of his soul). Thus, He attributed stinginess to the human soul (نفس الإنسان). The origin of this is that man derived his Existence (وجوده) from Allah, so he was created upon the nature of receiving benefit (الاستفادة), not giving benefit (الإفادة). His reality does not naturally incline him to give charity. Therefore, when he gives charity, his charity is a Proof (برهان) that he has been protected from the stinginess of his soul upon which Allah created him. That is why He said: \"Charity is Proof.\"\n\nSince the sun is Illumination (ضياء) by which everything it shines upon is unveiled for the one who has sight, the Unveiling (الكشف) occurs only through the Illumination of Light (ضياء النور), not by the Light (النور) itself. For Light does nothing more than dispel darkness, while Unveiling occurs through Illumination. Indeed, Light is a veil, just as darkness is a veil.\n\nThe Messenger of Allah (peace and blessings be upon him) said concerning his Lord Almighty: \"His Veil (حجابه) is Light.\"\n\nAnd he said: \"Indeed, Allah has seventy veils of Light and darkness,\" or \"seventy thousand.\"\n\nWhen he was asked, \"Did you see your Lord?\" he replied: \"Light (نور). How could I see Him?\"\n\nThus, He made Patience (الصبر)—which is Fasting and Hajj—Illumination (ضياء), meaning that through it, when you are engaged in it, you unveil what the reality of illumination grants in terms of perceiving things.\n\n### Fasting is a Samadānī Attribute: It is for Allah, and He is the One who Rewards for It\n\nThe Messenger of Allah (peace and blessings be upon him) reported from his Lord Almighty that He said: \"Every deed of the son of Adam is for him, except Fasting (الصوم), for it is Mine, and I shall reward for it.\"\n\nAnd he said to a man: \"Hold fast to Fasting, for there is nothing like it.\"\n\nAnd the Almighty said: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). Fasting is a Samadānī attribute (صفة صمدانية), which is the transcendence (التنزه) from nourishment. The reality of the created being is nourishment. When the servant desired to be described by something that is not his inherent reality to be described by, and his being described by it was legislated, based on His saying, the Almighty: <<كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ>> (Fasting has been prescribed for you as it was prescribed for those before you), Allah said to him: \"Fasting is Mine, not yours,\" meaning: \"I am the One who should not eat or drink.\" Since it is of this nature, and the reason for your entering into it is My legislation of it for you, \"I shall reward for it.\" It is as if He is saying: \"And I am its reward,\" because the attribute of transcendence from food and drink seeks Me, and you have clothed yourself with it, though it is not your reality and not for you, even while you are described by it during your fast. Thus, it leads you to Me. For Patience (الصبر) is the restraint of the soul, and you have restrained it by My command from what its reality dictates—food and drink. Therefore, He said:\n\n\"The fasting person has two joys: a joy when he breaks his fast,\" and that joy is only for his animal spirit (روحه الحيواني), \"and a joy when he meets his Lord,\" and that joy is for his rational soul (نفسه الناطقة), meaning his Divine subtlety (لطيفته الربانية). Thus, Fasting bequeathed him the meeting of Allah, which is the Witnessing (المشاهدة).\n\n### Fasting is Witnessing and Prayer is Private Conversation\n\nThus, Fasting was more complete than Prayer because it resulted in the meeting of Allah and His Witnessing (مشاهدته), while Prayer is private conversation (مناجاة), not Witnessing, and the veil (الحجاب) accompanies it. For Allah says: <<وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ>> (It is not for any human being that Allah should speak to him except by inspiration or from behind a veil). And thus did Allah speak to Moses, which is why he sought the Vision (الرؤية). Thus, He coupled speech with the veil, and private conversation (المناجاة) is a form of speaking.\n\nAllah says: \"I have divided the Prayer between Myself and My servant into two halves: half for Me and half for My servant, and My servant shall have what he asks.\"\n\nThe servant says: <<الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (All praise is due to Allah, Lord of the worlds). Allah says: \"My servant has praised Me.\" Fasting, however, is not divided; it is for Allah, not for the servant, and its reward is based on the fact that it is for Allah. Herein lies a noble secret. We said that Witnessing (المشاهدة) and private conversation (المناجاة) do not combine, for Witnessing is for astonishment (البهت), and speech is for understanding (الفهم). In the state of speaking, you are engaged with what is being spoken, not with the speaker, whatever that may be. Understand the Qur'an, and you will understand the Criterion (الفرقان). By this, you have grasped the difference between Prayer, Fasting, and Charity. As for our statement that Allah is the reward of the fasting person due to his meeting his Lord in the joy associated with it, the secret of that lies in His saying in the Surah of Joseph: <<مَن وُجِدَ فِي رَحْلِهِ فَهُوَ جَزَاؤُهُ>> (Whoever it is found in his saddlebag, he is its recompense).\n\n### Hajj and the Types of Patience within it\n\nAs for Hajj, it involves Patience (الصبر), which is the restraint of the human being from sexual intercourse, wearing tailored clothes, and using perfume, just as the human being restrains himself from food in Fasting, and from drink and sexual intercourse. Since Hajj does not generally involve restraining oneself from food and drink, but only from sexual intercourse and backbiting, it was placed later in the foundations upon which Islam is built. Its ruling is the same as the ruling for the fasting and praying person in their state of fasting and praying, regarding the transcendence from physical intimacy (مباشرة السكن). That transcendence, Allah says, is \"Mine, not yours,\" wherever it occurs. Since sexual intercourse is a cause for the appearance of offspring, Allah grants the servant, when he abandons it for His sake, its substitute in the Hereafter, and for His friends (أوليائه) in this world: the word *Be* (كن) for whomever Allah wills to manifest an effect through his hand. The servant in the Hereafter will say to the thing he desires, <<كُنْ فَيَكُونُ>> (Be, and it is). His saying is only due to his having performed Hajj or Fasting. Therefore, He associated Hajj and Fasting in the word Patience, saying: \"And Patience is Illumination (ضياء).\" This is true even if there is no obligatory fast in Hajj, for the abandonment of food therein is due to the preoccupation with supplication on that specific day, from noon—which is the Sunnah in that place for the pilgrim specifically. The one preoccupied therein will undoubtedly be afflicted by the customary hunger.\n\n### The Four Deaths according to the Sufis\n\nThe Sufi community (الطائفة) calls hunger the White Death (الموت الأبيض), which is appropriate for Illumination (الضياء). For the People of Allah (أهل الله) have four deaths: the White Death, which is hunger; the Red Death (الموت الأحمر), which is opposing the soul in its desires; the Green Death (الموت الأخضر), which is patching clothes (طرح الرقاع) one upon the other; and the Black Death (الموت الأسود), which is enduring the harm of creation, or harm in general. Wearing patched garments (المرقعات) is called the Green Death because its state is like the state of the earth in the variety of plants and flowers, resembling the variety of patches. As for the Black Death, which is enduring harm, it is because that involves grief (غم) for the soul, and grief is the darkness of the soul, and darkness resembles blackness in colors. The Red Death, which is opposing the soul, resembles the redness of blood, for whoever opposes his desire has slaughtered his soul. God willing, there will be separate chapters in this book concerning the testimony of Unity (شهادة التوحيد), Prayer, Zakat, Fasting, and Hajj, which are the foundations of Islam upon which it is built. Whoever wishes to know something of the secrets of Prayer, and what every prayer produces in terms of Gnosis (المعارف), and what it possesses of prophetic spirits (الأرواح النبوية) and celestial movements (الحركات الفلكية), should look in our book called *Al-Tanazzulāt al-Mawsiliyya*. This much in this chapter is sufficient for the intended purpose. Let us mention some secrets of Gnosis, as we titled this chapter, by way of summary.\n\n### (Section) A Divine Secret Connection: The Secret of Predestination Governing Humanity\n\nThe angels said: <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَّعْلُومٌ>> (And there is none of us except that he has a known station). Likewise, every existent thing, except for the two weighty ones (الثقلين) [humans and jinn]. Although the two weighty ones are also created in their station, they have designated, predetermined stations (مقامات معينة مقدرة) in Allah’s Knowledge (علم الله) that are hidden from them. Every individual among them reaches this station upon the cessation of his breaths (انتهاء أنفاسه). The last breath is his Known Station (مقامه المعلوم) upon which he dies. This is why they were called to spiritual traversing (السلوك), and they traversed, ascending by responding to the legislated call, and descending by responding to the Volitional Command (الأمر الإرادي) without knowing it until the desired outcome occurred. Every individual among the two weighty ones reaches in his traversing the Known Station for which he was created, and among them are the wretched (شقي) and the felicitous (سعيد). Every existent thing besides them is created in its station and has not descended from it, nor is it commanded to traverse toward it—such as angels, animals, plants, and minerals. It is felicitous (سعيد) with Allah; no wretchedness reaches it. Thus, the two weighty ones are included in the angels' saying: <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَّعْلُومٌ>> (And there is none of us except that he has a known station) with Allah. No created being in the world can have knowledge of his station except through Divine definition (تعريف إلهي), not merely by being in it. For everything other than Allah is contingent (ممكن), and the nature of the contingent is not to accept a designated station by its own essence. Rather, that designation is due to its determinant (مرجحه) according to what preceded in His Knowledge concerning it. The known thing (المعلوم) is what granted the Knowledge (العلم) of it, but it does not know what its state will be. This is the Secret of Predestination (سر القدر) that governs creation, since the Knowledge of the determinant does not accept change, due to the impossibility of the non-existence of the Eternal (القديم), and His Knowledge of designating the stations is eternal; therefore, it does not cease to exist.\n\n### The Creator's Knowledge of Things is not an Addition to His Essence\n\nThis issue is one of the most obscure intellectual matters. What indicates to you that His Knowledge (علمه), glory be to Him, of things is not an addition to His Essence (ذاته), but rather His Essence is that which relates, by virtue of being Knowledge (علمًا), to the known things (المعلومات) exactly as they are. This contradicts some speculative theologians (النظار), for that [view] leads to the deficiency of the Essence from the degree of perfection, and leads to the Essence being governed by an added matter, which necessitates a ruling upon it by that addition. This invalidates the Essence acting as it wills and chooses: <<لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no deity except Him, the Exalted in Might, the Wise). Therefore, realize this issue and dedicate yourself to it, for it is extremely obscure in the matters of perplexity (مسائل الحيرة). The intellect cannot truly be guided to it through mere thought (فكره), but only through prophetic Divine Unveiling (كشف إلهي نبوي).\n\n### The Superiority between the Children of Adam and the Angels\n\nWe return now and say that a group of our companions erred in this matter due to the absence of Unveiling (الكشف). They asserted, based on mere potentiality and corrupt thought (الفكر الفاسد), that the Perfect Human (الكامل من بنى آدم) is absolutely superior to the angels in the sight of Allah. They did not restrict this to a specific class or level (مرتبة) where superiority might apply to one over the other. They then justified this by saying that the Children of Adam have ascent (الترقي) with every breath, while the angels do not, as they were created in their station. This group that asserts this did not know the Reality (الحقيقة) we have pointed out. The correct view is that ascent (الترقي) is necessary for us, for the angels, and for others; it is incumbent upon all, in this world, the Isthmus (برزخًا), and the Hereafter. This applies to everyone described by the death of knowledge (الموت في العلم). Do you not see that the angels, despite having known stations (مقامات معلومة) that they do not transgress, were not deprived of increased Knowledge? Allah informed us that He taught them the Names (الأسماء) through Adam (peace be upon him), thereby increasing them in Divine Knowledge (علمًا إلهيًا) of the Divine Names (الأسماء الإلهية) that they did not possess, so they glorified and sanctified Him through them. Thus, the angels are equal to us in ascent through Knowledge (العلم), not through action (العمل), just as we do not ascend through the deeds of the Hereafter due to the cessation of obligation (زوال التكليف). We and they are equal in this regard in the Hereafter. We did not ascend in this world to the station upon which we were seized—which is the station in which others were created initially—due to our nobility over others. Rather, that was only so that He might test us, and nothing else. Those who hold that view did not understand what Allah intended, despite the existence of texts in the Qur'an, such as His saying: <<لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا>> (That He might test you [as to] which of you is best in deed). It cannot be argued that their creation upon the Form (الصورة) led to that trial, for the Jinn share this level with us, yet they have no share in the Form. Know this, and Allah is the Granter of Success.\n\n### (Section) A Divine Secret Connection: The World's Need for Allah and Allah's Independence from the World\n\nThe end of the circle is adjacent to its beginning. It seeks the point (النقطة) for its own essence, but the point does not seek it. Thus, the end of the people of ascent (أهل الترقي) from the World (العالم) is confirmed, and the World’s need (افتقار العالم) for Allah and Allah’s independence (غنى الله) from the World are confirmed. It becomes clear that every part of the World can be a cause for the Existence of another world like it, but not more perfect than it, ad infinitum. For the circumference of the circle consists of adjacent points (نقط متجاورة) in adjacent spaces (أحياز متجاورة). There is no third space between two spaces, nor a third point between the two assumed or existing points within them, because there is no space between them. Every point can generate a circumference, and that other circumference has the same ruling as the first circumference, ad infinitum.\n\n### The End in the World is Attained, but not the Ultimate Goal of it\n\nThe end (النهاية) in the World is attained, but the ultimate goal (الغاية) of the World is not attained. The Hereafter (الآخرة) will remain in perpetual formation (دائمة التكوين) from the World. For in the Gardens (الجنان), they say to the thing they desire, *Be* (كن), and it is (فيكون). They do not imagine anything, nor does a thought of forming something cross their minds, except that it is formed before them. Likewise, the people of the Fire: no thought of fear of a greater torment than what they are in crosses their minds except that that torment is formed within them or for them, and this is the very occurrence of the thought (الخاطر). For the Abode of the Hereafter (الدار الآخرة) necessitates the formation of the world from the world, but sensually (حسًا) and merely by the occurrence of the thought, the worry (الهم), the will (الإرادة), the wish (التمني), and the desire (الشهوة)—all of this is perceptible. This is not the case in this world—meaning the action by spiritual resolve (الهمة) for everyone. Although it did occur in this world for non-saints (غير الولي), such as the possessor of the Evil Eye (صاحب العين) and the sorceress (الغرانية) in Africa, it does not happen with the speed of formation by spiritual resolve (الهمة) as it does in the Hereafter. This is rare and anomalous in this world, like the bending of the Bān branch and other things, but in the Hereafter, it is for everyone.\n\n### There is Nothing More Wonderful in Possibility than This World\n\nThus, the saying of Imam Abu Hamid [Al-Ghazali] is confirmed: \"There is nothing more wonderful in possibility than this World (العالم),\" because there is nothing more perfect than the Form (الصورة) upon which the Perfect Human (الإنسان الكامل) was created. If there were, there would be something in the World more perfect than the Form, which is the Divine Presence (الحضرة الإلهية).\n\n### (Section) A Divine Secret Connection: The Unity of the Center Point and the Multiplicity of Lines Extending from it to the Circumference\n\nEvery line extending from the Point (النقطة) to the circumference (المحيط) is equal to the others and terminates at a point on the circumference. The Point itself has not multiplied or increased, despite the multiplicity of lines extending from it to the circumference. It confronts every point on the circumference with its own Essence (بذاتها). For if what it confronted one point on the circumference with were different from what it confronted another point with, it would be divided, and it would not be correct for it to be One, yet it is One. Thus, it confronted all the points, despite their multiplicity, only with its Essence. Therefore, Multiplicity (الكثرة) appeared from the One Essence (الواحد العين), yet the Essence itself did not multiply. This invalidates the saying of those who claim that only one thing can emanate from the One.\n\nThat line extending from the Point to the single point on the circumference is the resulting Face (الوجه الحاصل) that every existent thing has from its Creator, glory be to Him. This is His saying: <<إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَن نَّقُولَ لَهُ كُن فَيَكُونُ>> (Our word to a thing when We intend it is only that We say to it, 'Be,' and it is). The Will (الإرادة) here is that line we assumed extending from the center point of the circle to the circumference. It is the Divine Orientation (التوجه الإلهي) that designated that point on the circumference with Existence (الإيجاد), because that circumference is the very circle of the Contingent Things (دائرة الممكنات), and the Point in the center, designated for the point on the surrounding circle, is the Necessary Existent by Himself (الواجب الوجود لنفسه).\n\n### Contingent Things are Limited to Extended and Non-Extended Substance, Existences, and Qualities\n\nThat assumed circle is the circle of the genera of Contingent Things (أجناس الممكنات), which are limited to extended substance (جوهر متحيز), non-extended substance (جوهر غير متحيز), existences (أكوان), and qualities (ألوان). What is unlimited is the existence of species (الأنواع) and individuals (الأشخاص), which arise from every point of every circle. For circles of species arise within it, and from the circles of species arise individuals. Know this. The origin of all this is the First Point. That connecting line from the Point to the designated point on its circumference extends from it to the points generated from it in the outer semicircle, and from that semicircle emerge complete circles. The reason for this is the distinction between the Necessary Existent by Himself (الواجب الوجود لنفسه) and the contingent (الممكن). It is impossible for a complete circle to appear from the contingent, which is the circle of genera, because that would involve participation in the very thing that caused the distinction, and that is impossible. Thus, the formation of a complete circle from the genera is impossible, so that the deficiency of the contingent from the perfection of the Necessary Existent by Himself may be evident. The image of the matter therein is thus: the image of the shape of genera and species, without intending limitation, since species have species until they terminate at the final species, just as they terminate at the genus of genera.\n\n### The Cognitive and Practical Powers Pervading the Souls of the Two Weighty Ones and Animals\n\nKnow that the souls (نفوس) of the two weighty ones (الثقلين) and the souls of animals possess two powers: a cognitive power (قوة علمية) and a practical power (قوة عملية), according to the People of Unveiling (أهل الكشف). This is evident generally in animals, such as bees, spiders, birds that build nests, and other animals. The souls of the two weighty ones, distinct from other animals, possess a third power that neither animals nor the Universal Soul (النفس الكلية) possess: the power of thought (القوة المفكرة). Through thought, this human species acquires certain sciences. It shares with the rest of the world the acquisition of sciences from the Divine Effusion (الفيض الإلهي), and some of its sciences, like those of animals, are innate (بالفطرة), such as the infant seeking its mother's breast for suckling and accepting the milk.\n\n### Thought in Man is Equivalent to Planning and Detailing in Allah\n\nNo being other than the human being acquires sciences that remain with him through the path of thought. Thus, thought (الفكر) in man is equivalent to the Divine Reality (الحقيقة الإلهية) explicitly mentioned in His saying, the Almighty: <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ>> (He plans the matter and details the signs), and His saying in the authentic report concerning Him: \"I have not hesitated in anything I am about to do.\"\n\nThe First Intellect (العقل الأول) does not possess this Reality, nor does the Universal Soul (النفس الكلية). This, too, is something specific to the human being, derived from the Form (الصورة) upon which no one else was created.\n\n### The Perfect Human is Created Upon the Form\n\nWe know that the Perfect Human (الإنسان الكامل) exists upon the Form (الصورة). We assert definitively that Allah did not bring into existence anyone other than the human being upon that [Form]. For the occurrence or non-occurrence of this regarding others has not been reported, neither upon the tongue of a prophet nor in a revealed book, even though a group has erred in this, for they did not rely on Divine definition (تعريف إلهي). They only argue using reports, and the reports do not indicate that anyone other than the Perfect Human was created upon the Form. Its correctness is possible, and its incorrectness is also possible.\n\n### (Section) A Divine Secret Connection: Nature between the Universal Soul and the Prime Matter\n\nNature (الطبيعة) is between the Soul (النفس) and the Prime Matter (الهباء), which is the view of Imam Abu Hamid [Al-Ghazali], and its Level (مرتبتها) can only be there. Every body, from the Prime Matter (الهباء) up to the last existent body, is natural (طبيعي). Everything generated from natural bodies—of matters, powers, partial spirits (الأرواح الجزئية), angels, and lights—has a Divine ruling (حكم إلهي) in it that Allah Almighty has established and decreed. The ruling of Nature extends from the Prime Matter downwards, and the ruling of the Universal Soul (النفس الكلية) extends from Nature downwards. Above the Soul, neither Nature nor the Soul has any ruling therein. What we have mentioned involves much disagreement among the speculative thinkers (أصحاب النظر) outside our path, among the philosophers (الحكماء). For the theologian (المتكلم) has no share in this science by virtue of being a theologian, unlike the philosopher (الحكيم). The philosopher is defined as one who combines Divine Science (العلم الإلهي), Natural Science (الطبيعي), Mathematical Science (الرياضي), and Logical Science (المنطقي). There are only these four Levels of sciences.\n\n### Theoretical Knowledge and Gifted Knowledge\n\nThe path to acquiring these sciences differs between thought (الفكر) and the gift (الوهب), which is the Divine Effusion (الفيض الإلهي). The method of our companions relies on the latter, having no involvement in thought due to the corruption that can affect it and the uncertainty of its correctness. Therefore, what it yields is not trusted. By \"our companions,\" I mean the People of Hearts (أصحاب القلوب), Witnessing (المشاهدات), and Unveilings (المكاشفات), not the mere devotees (العباد), ascetics (الزهاد), or Sufis in general, but only the People of Realities (أهل الحقائق) and realization (التحقيق) among them. This is why the sciences of Prophethood (النبوة) and Sainthood (الولاية) are said to be beyond the scope of the intellect (وراء طور العقل). The intellect has no entry into them through thought, but only acceptance, specifically for the sound intellect that has not been overcome by a speculative, imaginative doubt (شبهة خيالية فكرية) that corrupts its view. The sciences of secrets (علوم الأسرار) are numerous. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "(باب سینتالیسواں) نچلی منازل (المنازل السفلية) کے اوصاف کے اسرار کی معرفت میں، اور ان کے مقامات، اور کس طرح عارف اپنے مقام کی بلندی کے باوجود اپنی ابتدا کو یاد کر کے اس کی طرف مائل ہوتا ہے، اور وہ کون سا راز ہے جو اس پر ظاہر (التجلی) ہوتا ہے جو اسے اس کی طرف بلاتا ہے\n\n> اور جب میں نے ذات حق (الحق) کو اول کے ساتھ متصف دیکھا\n> تو میں ابتدا کے سمندر کی طرف آیا تاکہ چلو بھروں\n> ایک پیاسے کی لذت کے ساتھ، نہ کہ ایک گھونٹ پینے والے کی طرح\n> تاکہ وہ مجھے حال کی انتہا میں مشاہدہ (الشہود) کرائے، میں اعتراف کرتا ہوں\n> تو کیا ٹھنڈک ہے اس لذیذ گھونٹ کی\n> ایک تپتے جگر پر، پس اس کے لیے عمل کر اور ٹھہر جا\n> کیونکہ اس پینے میں دل کے اندر ایک لذت ہے\n> جس کا رب اس وقت حیرت (العجب) کے ساتھ متصف نظر آتا ہے\n> اور نہ ہی اس کی حیرت اسے اس کے مشاہدہ (الشہود) سے روکتی ہے\n> اور نہ ہی وہ غرور اور تکبر جو وہ اس میں دیکھتا ہے\n> کیونکہ اس کے لیے ان لوگوں میں نمونہ ہے جو پہلے گزر چکے\n> پس کوئی بعد والا نہیں مگر اس کے لیے پہلے والا نمونہ ہے\n> یہ ایک منتخب شخص کی وراثت اور ایک محقق کی صفت ہے\n> جو حقیقت (الحقیقۃ) کے ساتھ گھیرے ہوئے ذات حق (الحق) کے اسماء کے ذریعے ہے\n> اور بے شک مردانِ حق کی انتہائیں ابتدا ہیں\n> ان لوگوں کے لیے جو ان کے بعد آئے، جن کا کوئی جانشین نہیں\n> جیسے رسول اللہ ﷺ اپنے دور میں تھے، پس نہیں\n> ان کا کوئی جانشین، بلکہ ان کے پاس معاملہ ٹھہر گیا\n\n### [عالم کروی شکل کا ہے اور اسی لیے انسان اپنی انتہا میں اپنی ابتدا کی طرف مائل ہوتا ہے]\n\nجان لو کہ جب عالم کروی (گول) شکل کا تھا، اسی لیے انسان اپنی انتہا میں اپنی ابتدا کی طرف مائل ہوتا ہے۔ پس ہمارا عدم سے ہستی (الوجود) کی طرف نکلنا اسی ذات سبحانہ کے ذریعے ہوا، اور اسی کی طرف ہم لوٹیں گے جیسا کہ اس نے فرمایا: وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (اور اسی کی طرف تمام معاملات لوٹائے جاتے ہیں) [11:123]۔ اور فرمایا: وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ (اور اس دن سے ڈرو جس میں تم اللہ کی طرف لوٹائے جاؤ گے) [2:281]۔ اور فرمایا: وَإِلَيْهِ الْمَصِيرُ (اور اسی کی طرف لوٹنا ہے) [64:4]۔ اور وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ (اور اللہ ہی کے لیے تمام معاملات کا انجام ہے) [31:22]۔\n\nکیا تم نہیں دیکھتے کہ جب تم ایک دائرہ بنانا شروع کرتے ہو، تو تم اسے گھماتے رہتے ہو یہاں تک کہ وہ اپنی ابتدا پر ختم ہو جائے، اور تب وہ ایک دائرہ بنتا ہے۔ اور اگر معاملہ ایسا نہ ہوتا تو جب ہم اس کے پاس سے سیدھی لکیر میں نکلتے تو اس کی طرف واپس نہ لوٹتے، اور اس کا قول سچا نہ ہوتا، حالانکہ وہ سچا ہے: وَإِلَيْهِ تُرْجَعُونَ (اور تم اسی کی طرف لوٹائے جاؤ گے)۔ اور ہر معاملہ اور ہر موجود ایک دائرہ ہے جو اس کی طرف لوٹتا ہے جہاں سے اس کی ابتدا ہوئی تھی۔ اور بے شک اللہ تعالیٰ نے ہر موجود کے لیے اپنے علم میں اس کا مرتبہ مقرر کر دیا ہے۔ پس موجودات میں سے کچھ ایسے ہیں جو اپنے مراتب میں پیدا کیے گئے اور وہیں ٹھہر گئے اور حرکت نہیں کی، پس ان کی نہ کوئی ابتدا ہے اور نہ انتہا، بلکہ کہا جاتا ہے کہ وہ موجود ہوئے۔ کیونکہ ابتدا کی حقیقت تب ہی سمجھی جا سکتی ہے جب اس کے بعد کوئی چیز ظاہر ہو جس کی طرف وہ منتقل ہو۔ اور یہ وہ ہے جو منتقل نہیں ہوا، پس اس کی ابتدا عین اس کی ہستی (الوجود) ہے، اور کچھ نہیں۔ اور موجودات میں سے کچھ ایسے ہیں جن کی ہستی (الوجود) پہلے اپنے مراتب میں تھی، پھر انہیں ان کی طبعی دنیا میں اتارا گیا، اور وہ عناصر سے پیدا ہونے والے اجسام ہیں، اور نہ کہ سب، بلکہ ثقلین (جن و انس) کے اجسام۔\n\n### [ہر مرتبے میں قائم داعی موجودات کو اپنی طرف بلاتا ہے]\n\nاور اللہ نے ان کے لیے اس مقررہ مرتبے میں، جہاں سے وہ اتارے گئے تھے، ایک داعی (بلانے والا) مقرر کر دیا، حالانکہ وہ اس سے بے خبر تھے، جو ہر شخص کو اس کی طرف بلاتا ہے۔ پس وہ نیک اعمال کے ذریعے ترقی کرتا رہتا ہے یہاں تک کہ وہ اس تک پہنچ جائے، یا وہ ان اعمال کے ذریعے اسے طلب کرتا ہے جنہیں ذات حق (الحق) پسند نہیں کرتا۔ پس ذات حق (الحق) کا داعی جب بندے کے دل میں کھڑا ہوتا ہے تو وہ اسے اس کے مقام سے بلاتا ہے جو اس کی منزل مقصود ہو گا جب وہ سلوک کرے گا۔ اور چونکہ ہر وارد (آنے والا الہام) لذیذ اور خوشگوار ہوتا ہے، کیونکہ وہ نیا، انوکھا اور لطیف ہوتا ہے، اسی لیے انسان ہمیشہ اس کی طرف مائل رہتا ہے۔ اور اسی میں سے وطن کی محبت ہے، ابن الرومی نے کہا:\n\n> اور مردوں کے وطن کو ان کے لیے محبوب بنا دیا\n> وہ مقاصد جو جوانی نے وہاں پورے کیے\n> جب وہ اپنے وطن کو یاد کرتے ہیں تو وہ انہیں یاد دلاتے ہیں\n> ان میں بچپن کے وعدے، پس وہ اس کی طرف مائل ہوتے ہیں\n\nاور جب تک توبہ کرنے والا غفلت کی نیند سے بیدار نہ ہو جائے اور ان اعمال کو نہ پہچان لے جو اسے ہلاکت اور تباہی کی طرف لے جا رہے ہیں، تب تک اس پر توبہ کا وارد (الہام) نہیں آ سکتا۔ وہ ڈر گیا اور دیکھا کہ وہ اپنی خواہشات کی قید میں ہے اور اپنے برے اعمال کی تلوار سے مارا جا رہا ہے۔ پس دربان نے اس سے کہا: بادشاہ نے یہ حکم دیا ہے کہ اگر تم ان خلاف ورزیوں سے باز آ جاؤ اور اس کی طرف لوٹ آؤ اور اس کی حدود اور رسموں پر قائم ہو جاؤ، تو وہ تمہیں اپنے عذاب سے امان دے گا اور تم پر احسان کرے گا، اور اس کے احسان میں سے یہ ہو گا کہ ہر وہ برائی جو تم نے کی ہے، اس کی صورت نیکی میں بدل دی جائے گی۔\n\n### [توقیعات الٰہیہ ثلاثہ]\n\nپھر اسے توقیع الٰہی (شاہی فرمان) دیا گیا، تو اس میں لکھا تھا: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ الَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا يَزْنُونَ وَمَن يَفْعَلْ ذَلِكَ يَلْقَ أَثَامًا يُضَاعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيَامَةِ وَيَخْلُدْ فِيهِ مُهَانًا إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ (شروع اللہ کے نام سے جو نہایت مہربان، رحم والا ہے۔ اور وہ جو اللہ کے ساتھ کسی دوسرے معبود کو نہیں پکارتے، اور نہ اس جان کو ناحق قتل کرتے ہیں جسے اللہ نے حرام کیا ہے، اور نہ زنا کرتے ہیں۔ اور جو کوئی یہ کام کرے گا وہ سزا پائے گا۔ قیامت کے دن اس کا عذاب دوگنا کر دیا جائے گا اور وہ اس میں ذلیل ہو کر ہمیشہ رہے گا، سوائے اس کے جس نے توبہ کی اور ایمان لایا اور نیک عمل کیا، تو یہ وہ لوگ ہیں جن کی برائیوں کو اللہ نیکیوں سے بدل دے گا) [25:68-70]۔\n\nاور جب وحشی نے یہ توقیع پڑھی تو کہا: مجھے کیسے توفیق ملے گی اس نیک عمل کی جو اس نے ہم پر تبدیلی کے لیے شرط لگائی ہے؟\n\nتو جواب میں ایک اور توقیع آئی جس میں لکھا تھا: إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَلِكَ لِمَن يَشَاءُ (بے شک اللہ اس بات کو نہیں بخشتا کہ اس کے ساتھ شرک کیا جائے، اور اس کے سوا جو کچھ ہے وہ جسے چاہتا ہے بخش دیتا ہے) [4:48]۔\n\nتو وحشی نے کہا: میں نہیں جانتا کہ کیا میں ان لوگوں میں سے ہوں جن کے لیے اس نے بخشش چاہی ہے یا نہیں؟\n\nتو جواب میں ایک تیسری توقیع آئی جس میں لکھا تھا: يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ (اے میرے بندو جنہوں نے اپنی جانوں پر زیادتی کی ہے، اللہ کی رحمت سے مایوس نہ ہو جاؤ۔ بے شک اللہ تمام گناہوں کو بخش دیتا ہے، بے شک وہ ہی بخشنے والا، رحم کرنے والا ہے) [39:53]۔\n\nپس جب وحشی نے یہ توقیع پڑھی تو کہا: اب میں اسلام لاتا ہوں۔\n\n### [گناہ کے بعد توبہ اور رب کے پاس امان کی مٹھاس]\n\nہم پہلی توقیع کی طرف لوٹتے ہیں اور کہتے ہیں: پس جب اس نے یہ سچی توقیع پڑھی جو لَا يَأْتِيهِ الْبَاطِلُ مِن بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ تَنزِيلٌ مِّنْ حَكِيمٍ حَمِيدٍ (جس کے پاس باطل نہ اس کے آگے سے آ سکتا ہے اور نہ اس کے پیچھے سے، یہ حکمت والے، قابل تعریف ذات کی طرف سے نازل کردہ ہے) [41:42]۔\n\nدربان نے، جو کہ شارع (شریعت لانے والا) ہے، اس سے کہا: بے شک گناہ سے توبہ کرنے والا ایسا ہے جیسے اس نے کوئی گناہ کیا ہی نہ ہو۔\n\nپس جب اس شدید خوف کے بعد یہ امان اس پر وارد ہوئی، تو اس نے امان کی ایسی مٹھاس اور لذت پائی جو اس سے پہلے کبھی نہیں جانی تھی۔ اور اس بارے میں کہا گیا ہے:\n\nخوف زدہ اور ڈرنے والے کے نزدیک امان سے زیادہ میٹھا کچھ نہیں\n\nپس جب اسے اس لذت کا ذائقہ حاصل ہوا اور اس نے نیک اعمال شروع کیے، اور اس کا مقام پاک ہو گیا اور وہ بادشاہ کی مجلس کے لیے تیار ہو گیا، کیونکہ وہ (اللہ) فرماتا ہے: \"میں اس کا ہم نشین ہوں جو مجھے یاد کرتا ہے\"۔\n\nاور اس کی ذات سبحانہ کے ساتھ اس کی معرفت (المعرفۃ) مضبوط ہو گئی، اور اس نے جان لیا کہ اس کا جلال کیا حق رکھتا ہے، اور اس نے اس شخص کی قدر جان لی جس نے اس کی نافرمانی کی، تو اسے پوری شرمندگی ہوئی اور وہ لذت جاتی رہی جو اسے توبہ کے وارد ہونے پر ملی تھی۔ اور اس نے جھانک کر دیکھا اور پایا کہ بارگاہ الٰہی اسے ان نعمتوں پر ادب اور شکر کا مطالبہ کر رہی ہے جو اس نے اسے عطا کیں، پس اس کی فکر اور غم بڑھ گیا اور اس کی لذت ختم ہو گئی۔\n\nاور اسی لیے تم دیکھتے ہو کہ اللہ والے (علماء باللہ) اپنی نیند میں وہ انوار نہیں دیکھتے جو ابتدائی سالک (اصحاب البدايات) دیکھتے ہیں۔ کیونکہ مبتدی اپنے اعمال اور احوال کی خوبصورتیوں کو حاضر کرتا ہے، پس وہ ان کے نتائج دیکھتا ہے۔ اور علماء (باللہ) اس تقصیر اور کوتاہی کے مشاہدہ پر سوتے ہیں جو عالی جناب (اللہ) کا حق ہے، پس وہ نیند میں صرف وہی دیکھتے ہیں جو انہیں غمگین کرتا ہے، جیسے تاریکیاں، گرج، بجلی اور ہر خوفناک چیز۔ کیونکہ نیند حس کی تابع ہے، اور چونکہ نفس اپنی فطرت کے لحاظ سے لذیذ چیزوں کو پسند کرتا ہے، اور اس نے اپنی معرفت (المعرفۃ) اور انتہا کی حالت میں توبہ کی لذت کھو دی ہے، اس لیے وہ اپنی ابتدا کی طرف مائل ہوتا ہے، اس لذت کی وجہ سے جو اس مقام سے وابستہ تھی، باوجود اس کے کہ اس کا مقام بلند ہے۔ اور یہ میلان اس کی فکر اور غم کے لیے ایک راحت ہوتا ہے جو اسے اللہ کی معرفت (المعرفۃ) نے دیا ہے، پس وہ اس شخص کی طرح ہے جو آرزوؤں سے لذت حاصل کرتا ہے۔ یہ اصحاب النهايات (انتہا کو پہنچنے والوں) کے اپنی ابتدا کی طرف مائل ہونے کا سبب ہے۔\n\n### [نچلی منازل (المنازل السفلية) اور جو وہ بلند مقامات (المقامات العلوية) عطا کرتی ہیں]\n\nاور جہاں تک نچلی منازل (المنازل السفلية) کا تعلق ہے، تو وہ وہ ہیں جو بدنی اعمال، جیسے نماز، جہاد، روزہ، اور ہر حسی عمل، سے بلند مقامات (المقامات العلوية) عطا ہوتے ہیں۔ اور وہ جو نفسانی اعمال بھی عطا کرتے ہیں، جو کہ ریاضتیں ہیں، جیسے تکلیف برداشت کرنا اور اس پر صبر کرنا، اور نفس کی لذتوں میں سے تھوڑی چیز پر راضی رہنا، اور موجود پر قناعت کرنا اگرچہ وہ کافی نہ ہو، اور نفس کو شکایت سے روکنا۔ کیونکہ ان ریاضتی اعمال اور مجاہدات میں سے ہر عمل کے مخصوص نتائج ہیں، اور ہر عمل کا ایک حال اور ایک مقام ہے۔ اور شارع (نبی ﷺ) نے ان میں سے کچھ کو واضح کر دیا ہے تاکہ جو کچھ انہوں نے ذکر کیا ہے اس سے اس چیز پر استدلال کیا جائے جس پر وہ خاموش رہے، صفات کے اختلاف کی وجہ سے نتائج کے اختلاف کے لحاظ سے۔ اور یہ بتانے کے لیے کہ ہر فرض عبادت کی نوافل کی صفت اس کے فرض کی صفت میں سے ہے، اور اسی لیے اگر اس کا فرض ناقص ہو تو نوافل سے اس کی تکمیل کی جاتی ہے۔\n\nصحیح حدیث میں رسول اللہ ﷺ سے روایت ہے کہ آپ نے فرمایا: \"سب سے پہلے بندے کے اعمال میں نماز کو دیکھا جائے گا۔ اللہ فرمائے گا: میرے بندے کی نماز کو دیکھو، کیا اس نے اسے پورا کیا یا اس میں کمی کی؟ اگر وہ پوری ہو گی تو اس کے لیے پوری لکھی جائے گی، اور اگر اس میں کچھ کمی ہو گی تو فرمائے گا: دیکھو، کیا میرے بندے کے پاس کوئی نفل (تطوع) ہے؟ اگر اس کے پاس نفل ہو گی تو فرمائے گا: میرے بندے کے فرض کو اس کے نفل سے پورا کر دو۔ پھر باقی اعمال بھی اسی طرح لیے جائیں گے\"۔\n\nاور جہاں تک عبادات کی صفات کے بارے میں دوسری حدیث کا تعلق ہے، تو صحیح میں آیا ہے کہ رسول اللہ ﷺ نے فرمایا: \"نماز نور ہے، اور صدقہ برہان (دلیل) ہے، اور صبر ضیاء (روشنی) ہے، اور قرآن تمہارے حق میں یا تمہارے خلاف حجت ہے۔ ہر شخص صبح کرتا ہے، پس وہ اپنی جان کا بیچنے والا ہے، یا تو اسے آزاد کرانے والا یا اسے ہلاک کرنے والا\"۔\n\nپس اس نے نور کو نماز کے لیے، اور برہان کو صدقہ کے لیے قرار دیا، جو کہ زکوٰۃ ہے، اور ضیاء کو روزہ اور حج کے لیے، جسے صبر سے تعبیر کیا گیا ہے، اس مشقت کی وجہ سے جو اس میں بھوک، پیاس اور حج کے افعال سے متعلق ہے۔ اور ایک دوسری روایت میں لَا إِلَهَ إِلَّا اللَّهُ کو ایسا قرار دیا کہ کوئی چیز اس کا وزن نہیں کر سکتی۔\n\nاور ان فرائض میں سے ہر فرض کی نوافل اسی کی جنس سے ہیں، پس ان کی صفت ان کی صفت کی طرح ہے۔ پھر اس نے اپنے قول \"ہر شخص صبح کرتا ہے، پس وہ اپنی جان کا بیچنے والا ہے، یا تو اسے آزاد کرانے والا\" میں اسے شامل کیا جس نے اسے اللہ کے ہاتھ بیچ دیا، اللہ تعالیٰ نے فرمایا: إِنَّ اللَّهَ اشْتَرَى مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ (بے شک اللہ نے مومنوں سے ان کی جانیں خرید لی ہیں) [9:111]۔ یا اسے ہلاک کرنے والا، اور وہ وہ ہے جس نے الضَّلَالَةَ بِالْهُدَى وَالْعَذَابَ بِالْمَغْفِرَةِ (گمراہی کو ہدایت کے بدلے اور عذاب کو مغفرت کے بدلے) [2:16, 2:175] خریدا۔ پس اس نے اپنے قول \"ہر شخص صبح کرتا ہے، پس وہ اپنی جان کا بیچنے والا ہے\" کے ذریعے شریعت کے تمام احکام، ان کے نوافل، فرائض، مباح اور مکروہ کو عام کر دیا۔\n\n### [شرعی عبادات اور اسماء و حقائق الٰہیہ سے ان کا تعلق]\n\nپس کوئی ایسی عبادت نہیں جو اللہ تعالیٰ نے اپنے بندوں کے لیے مشروع کی ہو مگر وہ کسی اسم الٰہی یا اس اسم سے نکلنے والی کسی حقیقت الٰہیہ سے وابستہ ہے، جو اسے اس عبادت میں عطا کرتا ہے جو اسے دنیا میں اس کے دل میں اس کی منازل، علوم اور معارف (المعارفۃ) سے، اور اس کے احوال میں اس کی کرامات اور نشانیوں سے، اور اس کی آخرت میں اس کے درجات میں اس کی جنتوں میں، اور خاص طور پر اس کے مراتب میں جنت عدن میں ٹیلے پر اپنے خالق کے دیدار سے عطا کرتا ہے۔ اور اللہ عزوجل نے نماز پڑھنے والے کے بارے میں فرمایا کہ وہ اس سے سرگوشی کرتا ہے، اور وہ نور ہے۔\n\nپس اللہ تعالیٰ اس سے اپنے اسم النور (نور) سے سرگوشی کرتا ہے، کسی دوسرے اسم سے نہیں۔ پس جس طرح نور ہر تاریکی کو دور کرتا ہے، اسی طرح نماز ہر مشغولیت کو کاٹ دیتی ہے، برخلاف دیگر اعمال کے، کیونکہ وہ نماز کی طرح ہر چیز کو ترک نہیں کرتے۔ اسی لیے یہ نور تھی، اللہ اسے یہ خوشخبری دیتا ہے کہ جب وہ اس سے اپنے اسم النور سے سرگوشی کرتا ہے، تو وہ اس کے ساتھ منفرد ہو جاتا ہے اور اپنی سرگوشی کے وقت اپنے شہود (الشہود) سے ہر کائنات کو ہٹا دیتا ہے۔\n\nپھر اس نے اسے سرگوشی میں خفیہ اور اعلانیہ طور پر مشروع کیا تاکہ اس میں اس کے لیے دو ذکروں کو جمع کر دے: خفیہ ذکر، جو کہ اپنے نفس میں ذکر ہے، اور اعلانیہ ذکر، جو کہ مجمع میں ذکر ہے۔ بندہ اپنی نماز میں فرشتوں کے مجمع میں اور حاضر موجودات کے سامنے اللہ کا ذکر کرتا ہے، اور یہ وہ ہے جو وہ نماز میں قراءت کے ذریعے بلند آواز سے کرتا ہے۔\n\nاللہ تعالیٰ نے ثابت شدہ خبر میں فرمایا: \"اگر وہ مجھے اپنے نفس میں یاد کرتا ہے تو میں اسے اپنے نفس میں یاد کرتا ہوں، اور اگر وہ مجھے مجمع میں یاد کرتا ہے تو میں اسے اس سے بہتر مجمع میں یاد کرتا ہوں\"۔\n\nاس سے مراد خاص طور پر مقرب فرشتے، کروبیین ہو سکتے ہیں، جنہیں اس نے اپنی بارگاہ کے لیے خاص کیا ہے۔ اسی فضیلت کی خاطر ان کے لیے نماز میں قراءت کو بلند آواز سے اور خفیہ طور پر مشروع کیا گیا۔ پس ہر وہ بندہ جس نے نماز پڑھی اور اس کی نماز نے اس کے سوا ہر چیز کو اس سے دور نہ کیا، تو اس نے نماز نہیں پڑھی اور نہ ہی وہ اس کے حق میں نور ہے۔ اور ہر وہ شخص جس نے اپنے نفس میں قراءت کو خفیہ رکھا اور اللہ کے اپنے لیے ذکر کا مشاہدہ (الشہود) نہ کیا، تو اس نے خفیہ نہیں رکھا۔ کیونکہ اگرچہ اس نے ظاہر میں خفیہ رکھا، لیکن اپنے نفس میں جو کچھ کائنات سے حاضر کیا، جیسے اہل و عیال، اولاد، دنیا اور آخرت کے دوست، اور اپنے خیال میں فرشتوں کو حاضر کیا، تو اس نے اپنی قراءت میں خفیہ نہیں رکھا، اور نہ ہی وہ ان لوگوں میں سے تھا جنہوں نے اللہ کو اپنے نفس میں یاد کیا، عدم مناسبت کی وجہ سے۔ کیونکہ جب اللہ بندے کو اپنے نفس میں یاد کرتا ہے تو مخلوقات میں سے کوئی بھی اس بات پر مطلع نہیں ہوتا جو باری تعالیٰ کے نفس میں اپنے بندے کے ذکر کے بارے میں ہے۔ اسی طرح بندے کو بھی ہونا چاہیے جو وہ خفیہ رکھتا ہے، کیونکہ وہ اپنی نماز میں اپنی قراءت، تسبیحات اور دعا کے دوران صرف اپنے رب سے سرگوشی کرتا ہے۔ اور اسی طرح جب وہ اسے مجمع میں یاد کرتا ہے، اپنے ظاہر میں اور اپنے باطن میں۔ جہاں تک اس کے ظاہر کا تعلق ہے تو وہ واضح ہے، اور جہاں تک اس کے باطن کا تعلق ہے تو وہ مخلوقات ہیں جو اس کے نفس میں اس کے ساتھ حاضر ہوتی ہیں، اور یہ وہ ہے جو وہ نماز میں قراءت، تسبیحات اور دعا کے ذریعے بلند آواز سے کرتا ہے۔\n\n### [نماز میں نوری نسبت اور مقربین کے مقامات]\n\nپھر عبادات میں کوئی ایسی چیز نہیں جو بندے کو مقربین کے مقامات تک پہنچا دے، جو کہ اللہ کے اولیاء کا اعلیٰ ترین مقام ہے، خواہ وہ فرشتہ ہو، رسول ہو، نبی ہو، ولی ہو یا مومن، سوائے نماز کے۔ اللہ تعالیٰ نے فرمایا: وَاسْجُدْ وَاقْتَرِبْ (اور سجدہ کرو اور قریب ہو جاؤ) [96:19]۔ کیونکہ اللہ اس حالت میں اپنے مقرب فرشتوں کے سامنے اس پر فخر کرتا ہے۔ اور وہ ان سے فرماتا ہے: \"اے میرے فرشتو! میں نے تمہیں ابتداء میں ہی قریب کر دیا اور تمہیں اپنے خاص فرشتوں میں شامل کیا، اور یہ میرا بندہ ہے، میں نے اس کے اور مقام قربت کے درمیان بہت سے حجابات اور بڑی رکاوٹیں رکھی تھیں، جیسے نفسانی اغراض، حسی شہوات، اور اہل، مال، اولاد، خادم اور دوستوں کی تدبیر، اور بڑے بڑے خوف۔ پس اس نے ان سب کو کاٹ دیا اور جہاد کیا یہاں تک کہ سجدہ کیا اور قریب ہو گیا، پس وہ مقربین میں شامل ہو گیا\"۔ \"پس دیکھو، اے میرے فرشتو! میں نے تمہیں مقام کی کیسی شرافت سے نوازا، جہاں میں نے تمہیں ان رکاوٹوں سے نہیں آزمایا اور نہ ہی ان کی مشقتیں تم پر لازم کیں، پس اس بندے کی قدر پہچانو اور اس حق کا خیال رکھو جو اس نے میری خاطر اپنے راستے میں برداشت کیا\"۔ تو فرشتے کہتے ہیں: \"اے ہمارے رب! اگر ہم ان لوگوں میں سے ہوتے جو جنتوں میں نعمتیں پاتے ہیں اور وہ ہمارے قیام کی جگہ ہوتی، تو کیا تو ہمارے لیے اس میں وہ منازل مقرر نہ کرتا جو ہمارے اعمال کا تقاضا کرتی ہیں؟ اے ہمارے رب! ہم تجھ سے سوال کرتے ہیں کہ تو یہ منازل اس بندے کو عطا فرما\"۔ پس اللہ اسے وہ عطا کرتا ہے جو فرشتوں نے اس کے حق میں مانگا۔ پس دیکھو نماز کتنی اشرف ہے، اور اس میں اقوال میں اللہ کا ذکر اور افعال میں سجدہ کتنا افضل ہے۔ اور اس کے اقوال میں سے سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ (اللہ نے سن لیا جس نے اس کی تعریف کی) ہے، کیونکہ یہ نماز میں بندے کے افضل ترین احوال میں سے ہے، ذات حق (الحق) کی نیابت کی وجہ سے۔ کیونکہ اللہ نے اپنے بندے کی زبان پر فرمایا: سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ۔\n\nاللہ تعالیٰ فرماتا ہے: إِنَّ الصَّلَاةَ تَنْهَى عَنِ الْفَحْشَاءِ وَالْمُنكَرِ (بے شک نماز بے حیائی اور برائی سے روکتی ہے) [29:45]، جو اس میں تحریم اور تحلیل کے ظاہر ہونے کی وجہ سے ہے، اور وَلَذِكْرُ اللَّهِ أَكْبَرُ (اور اللہ کا ذکر سب سے بڑا ہے) [29:45]، یعنی اس میں اس کے افعال سے۔\n\n### [قرآن میں وارد اذکار کے ذریعے اللہ کا ذکر]\n\nاور محقق کے لیے ضروری ہے کہ وہ اللہ کا ذکر صرف ان اذکار کے ذریعے کرے جو قرآن میں وارد ہوئے ہیں، تاکہ وہ اپنے ذکر میں تلاوت کرنے والا بھی ہو، پس وہ ایک ہی لفظ میں ذکر اور تلاوت کو جمع کر لے، اور تلاوت کرنے والوں اور ذکر کرنے والوں کا اجر حاصل کرے، یعنی فضیلت۔ پس اس میں اس کا فتح (کشف)، اس کا علم، اس کا راز، اس کا حال، اس کا مقام اور اس کی منزل اسی قبیل سے ہو گی۔ اور اگر وہ اس ذکر کا ارادہ کیے بغیر ذکر کرے جو قرآن میں وارد ہوا ہے، تو وہ صرف ذاکر ہے، پس اس کی فضیلت میں اتنی کمی ہو گی جتنی اس کے ارادے میں کمی ہوئی، اگرچہ وہ ذکر قرآن سے ہی ہو، لیکن اس نے اس کا ارادہ نہیں کیا۔ اور یہ ثابت ہے کہ اعمال کا دار و مدار نیتوں پر ہے، اور ہر شخص کے لیے وہی ہے جو اس نے نیت کی۔\n\nپس تمہارے لیے ضروری ہے کہ جب تم لَا إِلَهَ إِلَّا اللَّهُ کہو تو اس سے قرآن میں وارد ہونے والے تہلیل کا ارادہ کرو، جیسے اس کا فرمان ہے: فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ (پس جان لو کہ اللہ کے سوا کوئی معبود نہیں) [47:19]۔ اور اسی طرح تسبیح، تکبیر اور تحمید۔ اور تم جانتے ہو کہ انسان کی سانسیں قیمتی ہیں، اور جب سانس نکل جاتی ہے تو واپس نہیں آتی، پس تمہارے لیے ضروری ہے کہ تم اسے سب سے قیمتی اور عزیز چیز میں نکالو۔ پس میں نے تمہیں نماز میں نوری نسبت پر متنبہ کر دیا ہے۔\n\n### [صدقہ کے ساتھ برہان (دلیل) اور صبر کے ساتھ ضیاء (روشنی) کا تعلق]\n\nاور جہاں تک صدقہ کے ساتھ برہان (دلیل) کے تعلق کا تعلق ہے، تو وہ یہ ہے کہ اللہ تعالیٰ نے انسان کو بخل پر پیدا کیا، اور فرمایا: إِنَّ الْإِنسَانَ خُلِقَ هَلُوعًا (بے شک انسان جلد باز پیدا کیا گیا ہے) [70:19]، یعنی اپنی اصل پیدائش میں، إِذَا مَسَّهُ الشَّرُّ جَزُوعًا وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا (جب اسے تکلیف پہنچتی ہے تو گھبرا جاتا ہے، اور جب اسے بھلائی ملتی ہے تو روک لیتا ہے) [70:20-21]۔ اور فرمایا: وَمَن يُوقَ شُحَّ نَفْسِهِ (اور جو اپنے نفس کے بخل سے بچا لیا گیا) [59:9]۔ پس اس نے بخل کو انسان کے نفس سے منسوب کیا، اور اس کی اصل یہ ہے کہ اس نے اپنی ہستی (الوجود) اللہ سے حاصل کی، پس وہ استفادہ (فائدہ اٹھانے) پر فطرت میں آیا، نہ کہ افادہ (فائدہ پہنچانے) پر۔ پس اس کی حقیقت یہ نہیں دیتی کہ وہ صدقہ کرے، لہٰذا جب وہ صدقہ کرتا ہے تو اس کا صدقہ اس بات پر برہان (دلیل) ہوتا ہے کہ وہ اپنے نفس کے بخل سے بچا لیا گیا ہے جس پر اللہ نے اسے پیدا کیا تھا۔ اسی لیے فرمایا: صدقہ برہان ہے۔\n\nاور چونکہ سورج ضیاء (روشنی) ہے جس کے ذریعے ہر وہ چیز منکشف ہو جاتی ہے جس پر وہ پھیلتی ہے، اس شخص کے لیے جس کے پاس بصارت ہو۔ کیونکہ کشف (الکشف) صرف نور کی ضیاء (چمک) سے ہوتا ہے نہ کہ صرف نور سے، کیونکہ نور کا کام صرف تاریکی کو دور کرنا ہے، اور ضیاء سے کشف واقع ہوتا ہے، اور بے شک نور بھی حجاب ہے، جیسا کہ تاریکی حجاب ہے۔\n\nرسول اللہ ﷺ نے اپنے رب تعالیٰ کے حق میں فرمایا: \"اس کا حجاب نور ہے\"۔\n\nاور فرمایا: \"بے شک اللہ کے ستر حجاب نور اور تاریکی کے ہیں، یا ستر ہزار\"۔\n\nاور آپ ﷺ سے پوچھا گیا: کیا آپ نے اپنے رب کو دیکھا؟ تو آپ ﷺ نے فرمایا: \"نور ہے، میں اسے دیکھتا ہوں\"۔\n\nپس اس نے صبر کو، جو کہ روزہ اور حج ہے، ضیاء (روشنی) قرار دیا، یعنی جب تم اس سے متصف ہو گے تو اس کے ذریعے وہ چیزیں منکشف ہوں گی جو روشنی کی حقیقت اشیاء کے ادراک سے عطا کرتی ہے۔\n\n### [روزہ صفت صمدانی ہے: وہ اللہ کے لیے ہے اور وہی اس کا بدلہ دیتا ہے]\n\nرسول اللہ ﷺ نے اپنے رب تعالیٰ سے روایت کرتے ہوئے فرمایا کہ اس نے فرمایا: \"ابن آدم کا ہر عمل اس کے لیے ہے سوائے روزے کے، کیونکہ وہ میرے لیے ہے اور میں ہی اس کا بدلہ دوں گا\"۔\n\nاور آپ ﷺ نے ایک شخص سے فرمایا: \"تم پر روزہ لازم ہے، کیونکہ اس کی کوئی مثال نہیں\"۔\n\nاور اللہ تعالیٰ نے فرمایا: لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں) [42:11]۔ پس روزہ ایک صفت صمدانی ہے، اور وہ غذا سے پاک ہونا ہے، جبکہ مخلوق کی حقیقت غذا حاصل کرنا ہے۔ پس جب بندے نے ایسی صفت سے متصف ہونا چاہا جو اس کی حقیقت نہیں ہے، اور اس کا اس سے متصف ہونا شرعی تھا، اس کے فرمان کی وجہ سے: كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ (تم پر روزے فرض کیے گئے ہیں جیسا کہ تم سے پہلے لوگوں پر فرض کیے گئے تھے) [2:183]۔ اللہ نے اس سے فرمایا: \"روزہ میرے لیے ہے، تمہارے لیے نہیں\"، یعنی میں وہ ہوں جسے کھانا اور پینا مناسب نہیں ہے۔ اور جب یہ اس مرتبے کا ہے، اور اس میں تمہارے داخل ہونے کا سبب یہ ہے کہ میں نے اسے تمہارے لیے مشروع کیا، تو میں ہی اس کا بدلہ دوں گا، گویا وہ فرما رہا ہے: اور میں ہی اس کا بدلہ ہوں۔ کیونکہ کھانے پینے سے پاک ہونے کی صفت مجھے طلب کرتی ہے، اور تم نے اسے اختیار کیا ہے، حالانکہ یہ تمہاری حقیقت نہیں ہے اور نہ ہی تمہارے لیے ہے، اور تم روزے کی حالت میں اس سے متصف ہو، پس یہ تمہیں مجھ تک داخل کرتی ہے۔ کیونکہ صبر نفس کو روکنا ہے، اور تم نے میرے حکم سے اسے کھانے پینے سے روکا ہے جو اس کی حقیقت کا تقاضا ہے، اسی لیے فرمایا:\n\n\"روزہ دار کے لیے دو خوشیاں ہیں: ایک خوشی افطار کے وقت، اور وہ خوشی صرف اس کی حیوانی روح کے لیے ہے، اور ایک خوشی اپنے رب سے ملاقات کے وقت\"۔\n\nاور وہ خوشی اس کے ناطق نفس کے لیے ہے، یعنی اس کی ربانی لطافت کے لیے، پس روزے نے اسے اللہ کی ملاقات کی وراثت دی، اور وہ مشاہدہ (الشہود) ہے۔\n\n### [روزہ مشاہدہ (الشہود) ہے اور نماز مناجات]\n\nپس روزہ نماز سے زیادہ کامل ہوا، کیونکہ اس نے اللہ کی ملاقات اور اس کا مشاہدہ (الشہود) پیدا کیا، جبکہ نماز مناجات (سرگوشی) ہے، مشاہدہ (الشہود) نہیں، اور حجاب اس کے ساتھ ہوتا ہے۔ کیونکہ اللہ فرماتا ہے: وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ (اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے یا پردے کے پیچھے سے) [42:51]۔ اور اسی طرح اللہ نے موسیٰ سے کلام کیا، اور اسی لیے انہوں نے دیدار کا مطالبہ کیا، پس کلام کو حجاب کے ساتھ جوڑا گیا، اور مناجات مکالمہ ہے۔\n\nاللہ فرماتا ہے: \"میں نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کر دیا ہے، آدھا میرا ہے اور آدھا میرے بندے کا، اور میرے بندے کے لیے وہ ہے جو اس نے مانگا\"۔\n\nبندہ کہتا ہے: الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔\n\nاللہ فرماتا ہے: \"میرے بندے نے میری تعریف کی\"۔\n\nاور روزہ تقسیم نہیں ہوتا، پس وہ اللہ کے لیے ہے، بندے کے لیے نہیں، اس کا اجر اس لحاظ سے ہے کہ وہ اللہ کے لیے ہے۔ اور یہاں ایک شریف راز ہے، پس ہم نے کہا کہ مشاہدہ (الشہود) اور مناجات جمع نہیں ہو سکتے۔ کیونکہ مشاہدہ (الشہود) حیرت کے لیے ہے اور کلام سمجھنے کے لیے۔ پس تم کلام کی حالت میں اس چیز کے ساتھ ہوتے ہو جس سے کلام کیا جا رہا ہے، نہ کہ متکلم کے ساتھ، خواہ وہ کوئی بھی ہو۔ پس قرآن کو سمجھو تو فرقان کو سمجھو گے۔ پس اس سے تمہیں نماز، روزہ اور صدقہ کے درمیان فرق حاصل ہو گیا۔ اور جہاں تک ہمارے اس قول کا تعلق ہے کہ اللہ روزہ دار کا بدلہ ہے، اس خوشی کی وجہ سے جو اس نے اس کے ساتھ جوڑی ہے، تو اس کا راز سورۃ یوسف میں اس کے قول میں ہے: مَن وُجِدَ فِي رَحْلِهِ فَهُوَ جَزَاؤُهُ (جس کے سامان میں وہ پایا جائے، تو وہی اس کی سزا ہے) [12:75]۔\n\n### [حج اور اس میں صبر کے مختلف رنگ]\n\nاور جہاں تک حج کا تعلق ہے، تو وہ اس صبر کی وجہ سے ہے جو اس میں ہے، اور وہ انسان کا اپنے نفس کو نکاح، سلے ہوئے کپڑے پہننے اور خوشبو سے روکنا ہے، جیسا کہ انسان روزے میں اپنے نفس کو کھانے، پینے اور نکاح سے روکتا ہے۔ اور چونکہ حج میں انسان کا اپنے نفس کو کھانے پینے سے روکنا عام نہیں ہے، سوائے نکاح اور غیبت کے، اس لیے یہ ان قواعد میں پیچھے رہ گیا جن پر اسلام کی بنیاد رکھی گئی ہے۔ پس اس کا حکم روزہ دار اور نمازی کے حکم کی طرح تھا، ان کے روزے اور نماز کی حالت میں، سکن (بیوی) سے مباشرت سے پاک ہونے میں۔ اور وہ پاکیزگی، اللہ فرماتا ہے، جہاں بھی ہو، وہ میرے لیے ہے، تمہارے لیے نہیں ہے۔\n\nاور چونکہ نکاح اولاد کے ظہور کا سبب ہے، اس لیے اللہ نے اسے اس کے بدلے میں، جب اس نے اسے اللہ کی خاطر چھوڑا، آخرت میں \"کُن\" (ہو جا) کی طاقت عطا کی، اور دنیا میں اپنے اولیاء کو اسم اللہ کے ذریعے، جس کے ہاتھ پر اللہ کوئی اثر ظاہر کرنا چاہتا ہے۔ پس بندہ آخرت میں اس چیز کو جو وہ چاہتا ہے، \"کُن\" کہتا ہے تو وہ ہو جاتی ہے، اور اس کا یہ قول صرف اس کے حاجی یا روزہ دار ہونے کی وجہ سے ہے۔ اور اسی لیے اس نے حج اور روزے کو صبر کے لفظ میں شریک کیا، پس فرمایا: \"اور صبر ضیاء (روشنی) ہے\"۔ یہ اگرچہ اس میں واجب روزہ نہیں ہے، لیکن اس دن ظہر سے دعا میں مشغولیت کی وجہ سے کھانے کا ترک کرنا، جو کہ خاص طور پر حاجی کے لیے اس جگہ اس دن سنت ہے، پس اس میں مشغول شخص کو بلاشبہ معمول کی بھوک لاحق ہوتی ہے۔\n\n### [صوفیاء کے نزدیک چار موتیں]\n\nاور یہ گروہ (صوفیاء) بھوک کو چار موتوں میں سے موت ابیض (سفید موت) کہتا ہے، اور یہ ضیاء (روشنی) کے مناسب ہے۔ کیونکہ اہل اللہ کے لیے چار موتیں ہیں: موت ابیض (سفید موت) جو کہ بھوک ہے، اور موت احمر (سرخ موت) جو کہ نفس کی خواہش کی مخالفت ہے، اور موت اخضر (سبز موت) جو کہ لباس میں پیوندوں کو ایک دوسرے پر ڈالنا ہے، اور موت اسود (سیاہ موت) جو کہ مخلوق کی اذیت برداشت کرنا ہے، بلکہ مطلق اذیت۔ اور پیوند لگے کپڑے پہننے کو موت اخضر اس لیے کہا گیا کہ اس کی حالت زمین کی حالت کی طرح ہے جس میں مختلف پودے اور پھول ہوتے ہیں، پس یہ پیوندوں کے اختلاف سے مشابہت رکھتا ہے۔ اور جہاں تک اذیت برداشت کرنے کی وجہ سے موت اسود کا تعلق ہے، تو اس میں نفس کا غم ہے، اور غم نفس کی تاریکی ہے، اور تاریکی رنگوں میں سیاہی سے مشابہت رکھتی ہے۔ اور موت احمر، یعنی نفس کی مخالفت، خون کی سرخی سے مشابہت رکھتی ہے، کیونکہ جس نے اپنی خواہش کی مخالفت کی، اس نے گویا اپنے نفس کو ذبح کر دیا۔\n\nاور انشاء اللہ اس کتاب میں توحید کی شہادت، نماز، زکوٰۃ، روزہ اور حج کے بارے میں الگ ابواب آئیں گے، جو اسلام کے وہ قواعد ہیں جن پر اس کی بنیاد رکھی گئی ہے۔ اور جو شخص نماز کے اسرار میں سے کچھ جاننا چاہے، اور ہر نماز جو معارف (المعارفۃ) پیدا کرتی ہے، اور اس کے لیے جو نبوی ارواح اور فلکی حرکات ہیں، تو وہ ہماری کتاب \"التنزلات الموصلیہ\" میں دیکھے۔ اور اس باب میں یہ مقدار مقصود کے لیے کافی ہے، اور ہم کچھ معارف (المعارفۃ) کے اسرار کو اختصار کے ساتھ بیان کرتے ہیں جیسا کہ ہم نے عنوان میں ذکر کیا ہے۔\n\n### (فصل) ایک الٰہی راز کا بیان [مخلوق میں حکم چلانے والا تقدیر کا راز]\n\nفرشتوں نے کہا: وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَّعْلُومٌ (اور ہم میں سے کوئی نہیں مگر اس کا ایک مقام معلوم ہے) [37:164]۔ اور یہی حال ہر موجود کا ہے سوائے ثقلین (جن و انس) کے، اگرچہ ثقلین بھی اپنے مقام میں مخلوق ہیں، لیکن ثقلین کے لیے اللہ کے علم میں مقررہ، مقدر مقامات ہیں جو ان سے پوشیدہ رکھے گئے ہیں، اور ان میں سے ہر شخص اپنی سانسوں کے اختتام پر ان تک پہنچتا ہے۔ پس آخری سانس ہی اس کا معلوم مقام ہے جس پر وہ مرتا ہے۔ اور اسی لیے انہیں سلوک کی دعوت دی گئی، پس انہوں نے مشروع دعوت کو قبول کر کے بلندی کی طرف سلوک کیا، اور ارادی امر کو قبول کر کے پستی کی طرف، جہاں وہ مراد کے واقع ہونے کے بعد ہی جانتے ہیں۔ پس ثقلین میں سے ہر شخص اپنے سلوک میں اس معلوم مقام تک پہنچتا ہے جس کے لیے وہ پیدا کیا گیا تھا، اور ان میں سے کچھ بدبخت ہیں اور کچھ نیک بخت۔\n\nاور ان کے سوا ہر موجود اپنے مقام میں مخلوق ہے، پس وہ اس سے نیچے نہیں اترا، اور نہ ہی اسے اس کی طرف سلوک کا حکم دیا گیا، جیسے فرشتہ، حیوان، نباتات اور معدنیات۔ پس وہ اللہ کے نزدیک نیک بخت ہے، اسے کوئی بدبختی نہیں پہنچتی۔ پس ثقلین فرشتوں کے اس قول میں داخل ہیں: وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَّعْلُومٌ (اور ہم میں سے کوئی نہیں مگر اس کا ایک مقام معلوم ہے) اللہ کے نزدیک۔ اور عالم کی کسی مخلوق کے لیے یہ ممکن نہیں کہ وہ اپنے مقام کا علم رکھے مگر الٰہی تعریف کے ذریعے، نہ کہ اس میں ہونے کی وجہ سے۔ کیونکہ اللہ کے سوا ہر چیز ممکن ہے، اور ممکن کی شان یہ ہے کہ وہ اپنی ذات کے لیے کوئی مقررہ مقام قبول نہ کرے۔ بلکہ یہ اس کے مرجح (ترجیح دینے والے) کی وجہ سے ہے، اس کے علم میں جو پہلے سے گزر چکا ہے۔ اور معلوم وہ ہے جسے علم نے عطا کیا ہے، اور وہ خود نہیں جانتا کہ وہ کس حال پر ہو گا۔ اور یہ وہ راز ہے جو مخلوق میں حکم چلانے والا ہے، کیونکہ مرجح کا علم تبدیلی قبول نہیں کرتا، قدیم کے معدوم ہونے کے محال ہونے کی وجہ سے، اور اس کا مقامات کے تعین کا علم قدیم ہے، اس لیے وہ معدوم نہیں ہوتا۔\n\n### [باری تعالیٰ کا اشیاء کا علم اس کی ذات پر زائد نہیں ہے]\n\nاور یہ مسئلہ عقلی مسائل میں سے سب سے زیادہ گہرا ہے، اور یہ ان چیزوں میں سے ہے جو تمہیں بتاتی ہیں کہ اس کی ذات سبحانہ کا اشیاء کا علم اس کی ذات پر زائد نہیں ہے، بلکہ اس کی ذات ہی علم ہونے کے ناطے معلومات سے متعلق ہے جیسا کہ معلومات ہیں، بعض نظریاتی علماء کے برعکس۔ کیونکہ یہ ذات کو کمال کے درجے سے کم کرنے کا باعث بنتا ہے، اور اس بات کا باعث بنتا ہے کہ ذات پر کسی زائد امر نے حکم لگایا ہو جس نے اس زائد کے لیے ایک ایسا حکم واجب کر دیا ہو جو اس کا تقاضا کرتا ہے، اور یہ اس بات کو باطل کرتا ہے کہ ذات جو چاہے کرتی ہے اور اختیار کرتی ہے۔ لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ (اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے) [3:6]۔ پس اس مسئلے کی تحقیق کرو اور اس کے لیے فارغ ہو جاؤ، کیونکہ یہ حیرت کے مسائل میں بہت گہرا ہے، عقل اپنی فکر کے لحاظ سے حقیقت تک نہیں پہنچ سکتی، بلکہ صرف الٰہی، نبوی کشف (الکشف) کے ذریعے ہی پہنچ سکتی ہے۔\n\n### [بنی آدم اور فرشتوں کے درمیان فضیلت]\n\nپھر ہم لوٹتے ہیں اور کہتے ہیں کہ ہمارے اصحاب میں سے ایک گروہ کشف (الکشف) نہ ہونے کی وجہ سے اس مسئلے میں غلطی کر گیا، پس انہوں نے قوت کے طریقے پر اور فاسد فکر کی وجہ سے کہا کہ بنی آدم میں سے کامل شخص اللہ کے نزدیک فرشتوں سے مطلقاً افضل ہے۔ اور انہوں نے کسی صنف یا مراتب میں سے کسی مرتبے کو مقید نہیں کیا جس پر فضیلت واقع ہوتی ہے اس شخص کے لیے جو اس میں دوسرے پر ہے۔ پھر انہوں نے دلیل دی اور کہا کہ بنی آدم کے لیے سانسوں کے ساتھ ترقی ہے، اور فرشتوں کے لیے یہ نہیں ہے، کیونکہ وہ اپنے مقام میں پیدا کیے گئے ہیں۔ اور یہ کہنے والا گروہ اس حقیقت کو نہیں جانتا تھا جس پر ہم نے متنبہ کیا ہے، اور صحیح یہ ہے کہ ترقی ہمارے لیے، فرشتوں کے لیے اور ان کے علاوہ دوسروں کے لیے بھی ہے، اور یہ دنیا، برزخ اور آخرت میں سب کے لیے لازم ہے۔ یہ ہر اس شخص کے لیے ہے جو علم میں موت سے متصف ہے۔\n\nکیا تم نہیں دیکھتے کہ فرشتے، باوجود اس کے کہ ان کے معلوم مقامات ہیں جن سے وہ تجاوز نہیں کرتے، انہیں مزید علم سے محروم نہیں کیا گیا؟ کیونکہ اللہ نے ہمیں بتایا ہے کہ اس نے آدم علیہ السلام کی زبان پر انہیں اسماء سکھائے، پس اس نے انہیں ایک ایسا علم الٰہی زیادہ دیا جو ان کے پاس نہیں تھا، پس انہوں نے اس کے ذریعے اس کی تسبیح اور تقدیس کی۔ پس فرشتوں نے علم میں ترقی میں ہمارے ساتھ برابری کی، نہ کہ عمل میں، جیسا کہ ہم بھی آخرت کے اعمال سے ترقی نہیں کریں گے کیونکہ تکلیف (شرعی ذمہ داری) ختم ہو جائے گی۔ پس ہم اور وہ آخرت میں اس معاملے میں برابر ہوں گے۔\n\nاور ہم دنیا میں اس مقام تک ترقی نہیں کر پائے جس پر ہمیں قبض کیا گیا، اور وہ مقام جس میں ہمارے علاوہ دوسرے ابتداء میں پیدا کیے گئے تھے، ہماری دوسروں پر شرافت کی وجہ سے نہیں، بلکہ یہ صرف اس لیے تھا تاکہ وہ ہمیں آزمائے۔ پس یہ کہنے والے وہ نہیں سمجھے جو اللہ نے ارادہ کیا تھا، حالانکہ قرآن میں نصوص موجود ہیں، جیسے اس کا فرمان: لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا (تاکہ وہ تمہیں آزمائے کہ تم میں سے کون عمل میں سب سے بہتر ہے) [67:2]۔ اور یہ نہیں کہا جائے گا کہ ان کا صورت پر پیدا ہونا اس آزمائش کا سبب بنا، کیونکہ جنات نے اس مرتبے میں ہمارے ساتھ شرکت کی ہے اور انہیں صورت میں کوئی حصہ نہیں ملا۔ پس جان لو، اور اللہ ہی توفیق دینے والا ہے۔\n\n### (ایک الٰہی راز کا بیان) [عالم کا اللہ کا محتاج ہونا اور اللہ کا عالم سے بے نیاز ہونا]\n\nدائرے کی انتہا اس کی ابتدا کے قریب ہوتی ہے، اور وہ نقطے کو اپنی ذات کے لیے طلب کرتی ہے، اور نقطہ اسے طلب نہیں کرتا۔ پس عالم میں ترقی کرنے والوں کی انتہا درست ہوئی، اور عالم کا اللہ کا محتاج ہونا اور اللہ کا عالم سے بے نیاز ہونا درست ہوا۔ اور یہ واضح ہوا کہ عالم کا ہر جزو دوسرے عالم کے وجود کا سبب بن سکتا ہے، جو اس جیسا ہو، اس سے زیادہ کامل نہ ہو، لامتناہی تک۔ کیونکہ دائرے کا محیط متصل حیزوں (جگہوں) میں متصل نقطے ہیں، دو حیزوں کے درمیان کوئی تیسرا حیز نہیں، اور نہ ہی ان دو مفروضہ یا موجود نقطوں کے درمیان کوئی تیسرا نقطہ ہے، کیونکہ ان کے درمیان کوئی حیز نہیں ہے۔ پس ہر نقطہ سے ایک محیط ہو سکتا ہے، اور اس دوسرے محیط کا حکم پہلے محیط کے حکم جیسا ہو گا، لامتناہی تک۔\n\n### [عالم میں انتہا حاصل ہے، غایت نہیں]\n\nاور عالم میں انتہا حاصل ہے، لیکن عالم کی غایت (مقصد) حاصل نہیں ہے۔ پس آخرت عالم سے ہمیشہ تکوین (پیدائش) کرتی رہے گی۔ کیونکہ وہ جنتوں میں اس چیز کو جو وہ چاہتے ہیں، \"کُن\" (ہو جا) کہتے ہیں تو وہ ہو جاتی ہے۔ پس وہ کسی چیز کا وہم نہیں کرتے اور نہ ہی ان کے دل میں کسی چیز کی تخلیق کا خیال آتا ہے مگر وہ ان کے سامنے تخلیق ہو جاتی ہے۔ اور اسی طرح اہل نار کے دل میں اس عذاب سے بڑے عذاب کا خوف نہیں آتا جس میں وہ ہیں، مگر وہ عذاب ان میں یا ان کے لیے تخلیق ہو جاتا ہے، اور یہ عین خیال کے حاصل ہونے کے مطابق ہے۔ کیونکہ دار آخرت عالم سے عالم کی تخلیق کا تقاضا کرتی ہے، لیکن حسی طور پر اور محض خیال، فکر، ارادہ، تمنا اور شہوت کے حاصل ہونے سے، یہ سب محسوس ہوتا ہے۔ اور یہ دنیا میں نہیں ہے، یعنی ہر کسی کے لیے ہمت (روحانی قوت) سے فعل کا ہونا۔ اور یہ دنیا میں غیر ولی کے لیے بھی تھا، جیسے صاحب العین اور افریقہ میں غرانیہ کا مالک، لیکن آخرت میں ہمت سے چیز کی تخلیق کی رفتار ایسی نہیں ہوتی۔ اور یہ دنیا میں نادر اور شاذ ہے، جیسے بانس کی چھڑی وغیرہ، اور یہ آخرت میں سب کے لیے ہے۔\n\nپس امام ابو حامد کا قول سچ ثابت ہوا کہ امکان میں اس عالم سے زیادہ حسین کوئی چیز نہیں، کیونکہ اس صورت سے زیادہ کامل کوئی نہیں جس پر انسان کامل (الإنسان الکامل) کو پیدا کیا گیا۔ پس اگر ہوتا تو عالم میں اس صورت سے زیادہ کامل کوئی چیز ہوتی جو کہ بارگاہ الٰہی ہے۔\n\n### (ایک الٰہی راز کا بیان) [مرکز کے نقطہ کی وحدت اور محیط کی طرف نکلنے والے خطوط کی کثرت]\n\nہر خط جو نقطہ سے محیط کی طرف نکلتا ہے وہ اپنے ساتھی کے برابر ہوتا ہے اور محیط کے ایک نقطہ پر ختم ہوتا ہے۔ اور نقطہ اپنی ذات میں متعدد نہیں ہوا اور نہ ہی بڑھا، باوجود اس کے کہ اس سے محیط کی طرف نکلنے والے خطوط کی کثرت ہے۔ اور وہ محیط کے ہر نقطہ کا مقابلہ اپنی ذات سے کرتی ہے، کیونکہ اگر وہ چیز جس سے وہ محیط کے ایک نقطہ کا مقابلہ کرتی ہے، دوسرے نقطہ کا مقابلہ کرنے والی چیز سے مختلف ہوتی، تو وہ تقسیم ہو جاتی، اور اس کا واحد ہونا درست نہ ہوتا، حالانکہ وہ واحد ہے۔ پس اس نے تمام نقطوں کا مقابلہ، ان کی کثرت کے باوجود، صرف اپنی ذات سے کیا۔ پس کثرت عین واحد سے ظاہر ہوئی، اور وہ اپنی ذات میں کثیر نہیں ہوا۔ پس اس شخص کا قول باطل ہو گیا جس نے کہا کہ واحد سے صرف واحد ہی صادر ہوتا ہے۔\n\nپس وہ خط جو نقطہ سے محیط کے ایک نقطہ کی طرف نکلتا ہے، وہ وہ حاصل شدہ وجہ ہے جو ہر موجود کو اس کے خالق سبحانہ کی طرف سے حاصل ہے، اور یہ اس کا فرمان ہے: إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَن نَّقُولَ لَهُ كُن فَيَكُونُ (ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے کہ ہم اسے کہیں: ہو جا، تو وہ ہو جاتی ہے) [16:40]۔ پس یہاں ارادہ وہ خط ہے جسے ہم نے دائرے کے نقطہ سے محیط کی طرف نکلتا ہوا فرض کیا ہے، اور یہ وہ توجہ الٰہی ہے جس نے اس نقطہ کو محیط میں ایجاد کے ذریعے مقرر کیا۔ کیونکہ وہ محیط عین ممکنات کا دائرہ ہے، اور وہ نقطہ جو مرکز میں ہے اور محیط دائرے کے نقطہ کے لیے مقرر ہے، وہ واجب الوجود (الوجود) لنفسہ ہے۔\n\n### [ممکنات جوہر متحیز، غیر متحیز، اکوان اور الوان میں محدود ہیں]\n\nاور وہ مفروضہ دائرہ ممکنات کی اجناس کا دائرہ ہے، اور وہ جوہر متحیز (جگہ گھیرنے والا جوہر)، جوہر غیر متحیز (جگہ نہ گھیرنے والا جوہر)، اکوان (کائناتیں) اور الوان (رنگوں) میں محدود ہے۔ اور جو چیز محدود نہیں ہے وہ انواع اور اشخاص کا وجود ہے، اور یہ وہ ہے جو دائروں میں سے ہر دائرے کے ہر نقطہ سے پیدا ہوتا ہے۔ کیونکہ اس میں انواع کے دائرے پیدا ہوتے ہیں، اور انواع کے دائروں سے اشخاص پیدا ہوتے ہیں۔ پس یہ جان لو، اور ان سب کی اصل پہلا نقطہ ہے۔ اور وہ خط جو نقطہ سے اس کے محیط کے مقررہ نقطہ تک ملا ہوا ہے، وہ اس سے ان نقطوں تک پھیلتا ہے جو اس سے باہر نکلنے والے نصف دائرے میں اس سے پیدا ہوتے ہیں۔ اور اس نصف سے کامل دائرے نکلتے ہیں، اور اس کی وجہ واجب الوجود (الوجود) لنفسہ اور ممکن کے درمیان امتیاز ہے۔ پس ممکن سے، جو کہ اجناس کا دائرہ ہے، کامل دائرہ ظاہر نہیں ہو سکتا، کیونکہ وہ اس امتیاز میں شرکت کے ذریعے داخل ہو جاتا جس سے امتیاز واقع ہوا، اور یہ محال ہے۔ پس اجناس سے کامل دائرے کی تخلیق محال ہے تاکہ ممکن کا نقص واجب الوجود (الوجود) لنفسہ کے کمال سے واضح ہو جائے۔ اور اس میں معاملے کی صورت اجناس اور انواع کی شکل کی صورت میں ہے، بغیر کسی ارادے کے کہ اسے محدود کیا جائے، کیونکہ انواع کی بھی انواع ہیں یہاں تک کہ وہ آخری نوع تک پہنچ جائے، جیسا کہ وہ اجناس کی جنس تک پہنچتا ہے۔\n\n### [علمی اور عملی قوتیں ثقلین اور حیوان کے نفوس میں جاری ہیں]\n\nاور جان لو کہ اہل کشف (الکشف) کے نزدیک ثقلین (جن و انس) کے نفوس اور حیوان کے نفوس کے لیے دو قوتیں ہیں: ایک علمی قوت اور ایک عملی قوت۔ اور یہ حیوانات میں عام طور پر ظاہر ہوا ہے، جیسے شہد کی مکھیاں، مکڑیاں، اور وہ پرندے جو گھونسلے بناتے ہیں، اور دیگر حیوانات۔ اور ثقلین کے نفوس کے لیے، دیگر حیوانات کے برعکس، ایک تیسری قوت ہے جو نہ حیوان کے لیے ہے اور نہ نفس کلیہ کے لیے، اور وہ قوت مفکرہ (سوچنے والی قوت) ہے۔ پس یہ نوع انسانی فکر سے کچھ علوم حاصل کرتی ہے، اور دیگر عالم کے ساتھ فیض الٰہی سے علوم حاصل کرنے میں شریک ہوتی ہے۔ اور اس کے کچھ علوم حیوان کی طرح فطرت سے ہوتے ہیں، جیسے بچے کا دودھ پینے کے لیے ماں کی چھاتی کو لینا اور دودھ کو قبول کرنا۔\n\n### [انسان کی فکر اللہ کی تدبیر اور تفصیل کے مقام پر ہے]\n\nاور انسان کے علاوہ کسی کے لیے فکر کے ذریعے ایسے علوم حاصل کرنا ممکن نہیں جو اس کے ساتھ باقی رہیں۔ پس انسان کی فکر اس حقیقت الٰہیہ کے مقام پر ہے جس پر اس کے فرمان سے نص موجود ہے: يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ (وہ معاملے کی تدبیر کرتا ہے، وہ آیات کو تفصیل سے بیان کرتا ہے) [13:2]۔ اور اس کے بارے میں صحیح خبر میں اس کا فرمان: \"میں نے کسی چیز میں تردد نہیں کیا جسے میں کرنے والا ہوں\"۔ اور عقل اول کے لیے یہ حقیقت نہیں ہے اور نہ ہی نفس کلیہ کے لیے۔ پس یہ بھی ان چیزوں میں سے ہے جو انسان کے لیے خاص ہیں، اس صورت کی وجہ سے جس پر اس کے سوا کوئی اور پیدا نہیں کیا گیا۔\n\n### [انسان کامل (الإنسان الکامل) صورت پر مخلوق ہے]\n\nاور ہم جانتے ہیں کہ انسان کامل (الإنسان الکامل) صورت پر موجود ہے، اور ہم یقین سے کہتے ہیں کہ اللہ نے انسان کے سوا کسی اور کو اس پر موجود نہیں کیا۔ کیونکہ نہ تو کسی نبی کی زبان پر اور نہ ہی کسی نازل شدہ کتاب میں اس کے واقع ہونے یا نہ ہونے کا ذکر آیا ہے، اگرچہ ایک گروہ نے اس میں غلطی کی ہے۔ کیونکہ انہوں نے اس میں کسی الٰہی تعریف پر بھروسہ نہیں کیا، بلکہ وہ خبر سے دلیل پکڑتے ہیں۔ اور خبر میں کوئی ایسی چیز نہیں جو یہ بتائے کہ انسان کامل (الإنسان الکامل) کے سوا کوئی اور صورت پر پیدا نہیں کیا گیا، اور یہ ممکن ہے کہ یہ صحیح ہو اور یہ بھی ممکن ہے کہ صحیح نہ ہو۔\n\n### (ایک الٰہی راز کا بیان) [طبیعت (نیچر) نفس کلیہ اور مادہ اولیٰ کے درمیان ہے]\n\nطبیعت (نیچر) نفس اور ہباء (پہلا مادہ) کے درمیان ہے، اور یہ امام ابو حامد کی رائے ہے، اور اس کا مرتبہ اس کے سوا کہیں اور نہیں ہو سکتا۔ پس ہباء سے لے کر اجسام میں آخری موجود تک ہر جسم طبعی ہے۔ اور جو کچھ طبعی اجسام سے پیدا ہوا، جیسے امور، قوتیں، جزوی ارواح، فرشتے اور انوار، تو ان میں طبیعت کا ایک الٰہی حکم ہے جسے اللہ تعالیٰ نے مقرر اور مقدر کیا ہے۔ پس طبیعت کا حکم ہباء سے لے کر اس کے نیچے تک ہے، اور نفس کلیہ کا حکم طبیعت سے لے کر اس کے نیچے تک ہے۔ اور جو نفس سے اوپر ہے، اس میں نہ طبیعت کا حکم ہے اور نہ نفس کا۔ اور جو کچھ ہم نے ذکر کیا ہے، اس میں ہمارے طریقے کے علاوہ دیگر حکماء (فلسفیوں) کے درمیان بہت اختلاف ہے۔ کیونکہ متکلم (علم کلام کا ماہر) کو اس علم میں متکلم ہونے کی حیثیت سے کوئی حصہ نہیں، برخلاف حکیم کے۔ کیونکہ حکیم اس شخص کو کہتے ہیں جس نے علم الٰہی، علم طبعی، علم ریاضی اور علم منطق کو جمع کیا ہو، اور علوم کے یہ چار مراتب ہی ہیں۔\n\n### [علم نظری اور علم وہبی]\n\nاور ان کے حصول کا طریقہ فکر اور وہب (عطیہ) کے درمیان مختلف ہے، اور وہ فیض الٰہی ہے، اور اسی پر ہمارے اصحاب کا طریقہ ہے، ان کا فکر میں کوئی دخل نہیں، اس فساد کی وجہ سے جو اس میں داخل ہو سکتا ہے، اور اس میں صحت مشکوک ہوتی ہے، لہٰذا اس پر بھروسہ نہیں کیا جاتا جو وہ عطا کرتا ہے۔ اور میرے اصحاب سے مراد اصحاب قلوب، مشاہدات (الشہود) اور مکاشفات (الکشف) والے ہیں، نہ کہ صرف عابد یا زاہد، اور نہ ہی مطلق صوفیاء، بلکہ ان میں سے اہل حقائق اور اہل تحقیق۔ اور اسی لیے نبوت اور ولایت کے علوم کے بارے میں کہا جاتا ہے کہ وہ عقل کی حد سے باہر ہیں، عقل کو فکر کے ذریعے ان میں کوئی دخل نہیں، لیکن اسے قبول کرنے کا حق ہے، خاص طور پر سلیم العقل کے نزدیک، جس پر کوئی خیالی، فکری شبہ غالب نہ آیا ہو جس سے اس کی نظر خراب ہو جائے۔ اور اسرار کے علوم بہت ہیں، اور اللہ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (حق فرماتا ہے اور وہی راستہ دکھاتا ہے) [33:4]۔",
    "fa": "(باب چهل و هفتم) در معرفت اسرار وصف منازل سُفلی و مقامات آن‌ها، و اینکه چگونه عارف هنگام یادآوری آغاز خود، با وجود علو مقامش، به آن مشتاق می‌شود و چه سِرّی بر او تجلی می‌کند که او را به این امر فرا می‌خواند.\n\nچون دیدم که حق (الحق) به صفت اول متصف گشت، *** به سوی دریای آغاز آمدم تا از آن برگیرم.\nبا لذت تشنه‌ای که یک جرعه ننوشیده است، *** پس مرا در نهایت حال به اعتراف و شهود (الشهود) می‌رساند.\nای خنکای آن جرعه لذت‌بخش، *** بر جگر تفتیده؛ پس برای آن عمل کن و بایست.\nزیرا آن نوشیدن در قلب لذتی دارد، *** که پروردگارش را در آن لحظه متصف به شگفتی می‌بیند.\nو شگفتی‌اش او را از شهود (الشهود) باز نمی‌دارد، *** و نه آنچه در آن از خودبینی و تکبر می‌بیند.\nزیرا او در پیشینیان خود الگویی دارد، *** پس هیچ جانشینی نیست مگر آنکه پیش از او مثالی برایش بوده است.\nمیراثی از برگزیده و وصفی محقق، *** که به اسماء حق (الحق) در حقیقت (الحقيقة) پوشیده شده است.\nو همانا نهایت‌های مردان، آغازی است، *** برای قومی که پس از آن‌ها آمدند و جانشینی ندارند.\nمانند رسول خدا (ص) در مرتبه خود، که *** جانشینی ندارد، بلکه امر نزد او متوقف شده است.\n\n### [جهان کروی شکل است و از این رو انسان در نهایت خود به آغازش مشتاق می‌شود]\n\nبدان که چون جهان کروی شکل (أكرى الشكل) بود، از این رو انسان در نهایت خود به آغازش مشتاق می‌شود. پس خروج ما از عدم به هستی (الوجود) به واسطه او سبحانه بود و به سوی او باز می‌گردیم، چنانکه عز و جل فرمود: «و بازگشت همه امور به سوی اوست» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ). و فرمود: «و بترسید از روزی که در آن به سوی خدا بازگردانده می‌شوید» (وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ). و فرمود: «و بازگشت به سوی اوست» (وَإِلَيْهِ الْمَصِيرُ) و «و سرانجام کارها به سوی خداست» (وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ). آیا نمی‌بینی که وقتی شروع به رسم دایره می‌کنی، پیوسته آن را می‌چرخانی تا به نقطه آغازش برگردی و در آن هنگام دایره کامل می‌شود؟ و اگر امر چنین نبود، هرگاه از نزد او خارج می‌شدیم، خطی مستقیم می‌پیمودیم و به سوی او باز نمی‌گشتیم و سخن او که صادق است، تصدیق نمی‌شد: «و به سوی او بازگردانده می‌شوید» (وَإِلَيْهِ تُرْجَعُونَ). و هر امر و هر موجودی دایره‌ای است که به همان جایی باز می‌گردد که آغازش از آنجا بوده است. و خداوند متعال برای هر موجودی مرتبه‌اش را در علم خود معین کرده است. پس برخی از موجودات در مراتب خود خلق شده و متوقف گشته‌اند و حرکت نکرده‌اند، لذا نه آغازی دارند و نه نهایتی، بلکه گفته می‌شود که «یافت شدند». زیرا آغاز، حقیقتش درک نمی‌شود مگر با ظهور آنچه پس از آن می‌آید و به آن منتقل می‌شود، و این موجودات منتقل نشده‌اند، پس عین آغازشان همان عین هستی (الوجود) آن‌هاست و بس. و برخی از موجودات، هستی (الوجود) آن‌ها ابتدا در مراتبشان بود، سپس به عالم طبیعتشان فرود آمدند، و آن‌ها اجسام مولد از عناصر هستند، نه همه آن‌ها، بلکه اجسام دو جهان (جن و انس).\n\n### [دعوت‌کننده (الداعي) در هر مرتبه‌ای موجودات را به سوی آن فرا می‌خواند]\n\nو خداوند برای آن‌ها در آن مرتبه معین که از آن فرود آورده شده‌اند، بدون آنکه خودشان بدان آگاهی داشته باشند، دعوت‌کننده‌ای (الداعي) قرار داده است که هر شخصی را به سوی آن فرا می‌خواند. پس پیوسته با اعمال صالح ارتقا می‌یابد تا به آن برسد، یا آن را با اعمالی که حق (الحق) نمی‌پسندد، طلب می‌کند. دعوت‌کننده حق (الداعي الحق) هنگامی که در قلب بنده قیام می‌کند، او را از مقامی فرا می‌خواند که نهایت سیر و سلوکش به سوی آن است. و چون هر وارد (وارد) لذت‌بخش و شیرین است، زیرا جدید، غریب و لطیف است، از این رو انسان پیوسته به آن مشتاق می‌شود. و از همین روست حب وطن. ابن رومی گفته است:\n\n«و وطن‌های مردان را برایشان محبوب ساخت، *** آرزوهایی که جوانی در آنجا برآورده ساخت.\nهنگامی که وطن‌هایشان را یاد می‌کنند، *** عهدهای کودکی در آنجا را به یاد می‌آورند و از این رو مشتاق می‌شوند.»\n\nو چون برای توبه‌کننده ممکن نیست که وارد (وارد) توبه بر او نازل شود مگر آنکه از خواب غفلت بیدار شود و بشناسد که در چه اعمالی است که سرانجامش هلاکت و تباهی اوست، می‌ترسد و می‌بیند که در اسارت هوای نفس خود است و با شمشیر اعمال زشتش کشته می‌شود. پس حاجب درگاه به او می‌گوید: پادشاه مقرر کرده است که اگر از این مخالفت‌ها دست برداری و به سوی او بازگردی و در حدود و رسوم او بایستی، به تو از عذابش امان می‌دهد و به تو احسان می‌کند، و از جمله احسان‌های او این است که هر کار زشتی که انجام داده‌ای، صورتش به نیکی برگردانده می‌شود.\n\n### [سه توقیع (فرمان) الهی]\n\nسپس توقیع (التوقيع) الهی را به او داد، که در آن نوشته شده بود: «بسم الله الرحمن الرحیم. و کسانی که معبود دیگری را با خدا نمی‌خوانند و کسی را که خدا خونش را حرام کرده است، جز به حق نمی‌کشند و زنا نمی‌کنند؛ و هر کس این کارها را انجام دهد، کیفر آن را خواهد دید. عذاب او در روز قیامت مضاعف می‌گردد و با خواری در آن جاودانه می‌ماند. مگر کسی که توبه کند و ایمان آورد و عمل صالح انجام دهد، پس خداوند بدی‌هایشان را به نیکی‌ها تبدیل می‌کند» (الَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَٰهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا يَزْنُونَ وَمَن يَفْعَلْ ذَٰلِكَ يَلْقَ أَثَامًا يُضَاعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيَامَةِ وَيَخْلُدْ فِيهِ مُهَانًا إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَٰئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ). هنگامی که وحشی این توقیع را خواند، گفت: چه کسی تضمین می‌کند که من موفق به انجام عمل صالح شوم که خداوند آن را شرط تبدیل قرار داده است؟\nپس در پاسخ، توقیع دیگری آمد که در آن نوشته شده بود: «همانا خداوند این را که به او شرک ورزیده شود، نمی‌آمرزد و جز آن را برای هر که بخواهد می‌آمرزد» (إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ). وحشی گفت: نمی‌دانم آیا من از کسانی هستم که او خواسته است بیامرزد یا نه؟ پس در پاسخ، توقیع سومی آمد که در آن نوشته شده بود: «ای بندگان من که بر خود اسراف کرده‌اید، از رحمت خدا ناامید نشوید. همانا خداوند همه گناهان را می‌آمرزد، زیرا اوست آمرزنده مهربان» (يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ). هنگامی که وحشی این توقیع را خواند، گفت: اکنون اسلام می‌آورم.\n\n### [توبه پس از گناه و شیرینی امنیت نزد پروردگار]\n\nبه توقیع اول باز می‌گردیم و می‌گوییم: هنگامی که این توقیع صادق را خواند که «باطل از پیش رو و پشت سرش به آن راه نمی‌یابد، تنزیلی است از سوی حکیمی ستوده» (لَا يَأْتِيهِ الْبَاطِلُ مِن بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ تَنزِيلٌ مِّنْ حَكِيمٍ حَمِيدٍ)،\nحاجب درگاه که همان شارع است، به او گفت: «توبه‌کننده از گناه مانند کسی است که گناهی ندارد.»\nفلما ورد علیه هذا الأمان عقيب ذلك الخوف الشديد وجد للأمان حلاوة ولذة لم يكن يعرفها قبل ذلك وقد قيل في ذلك‏\nهنگامی که این امان پس از آن ترس شدید بر او وارد شد، شیرینی و لذتی برای امان یافت که پیش از آن نمی‌شناخت. و در این باره گفته شده است:\n«شیرین‌تر از امنیت نزد ترسانِ هراسان.»\nهنگامی که طعم این لذت به او دست داد و شروع به اعمال صالحه کرد و جایگاهش پاک شد و برای همنشینی با پادشاه آماده گشت،\nزیرا او می‌فرماید: «من همنشین کسی هستم که مرا یاد کند.»\nو معرفت (المعرفة) او نسبت به حق (الحق) سبحانه تقویت شد و دانست که جلال او مستحق چیست و قدر کسی که او را نافرمانی کرده است را دانست، نهایت حیا را به خود گرفت و لذتی که هنگام ورود وارد (وارد) توبه‌اش یافته بود، از بین رفت. و آگاه شد و دید که حضرت الهی او را به ادب و شکر بر نعمت‌هایی که به او ارزانی داشته است، فرا می‌خواند. پس اندوه و غمش فزونی می‌یابد و لذتش زایل می‌شود. به همین دلیل است که علمای بالله در خواب‌هایشان آنچه را که مریدانِ صاحبان بدايات (آغازها) از انوار می‌بینند، نمی‌بینند. زیرا مبتدی، اعمال و احوال نیکوی خود را حاضر می‌سازد و نتایج آن‌ها را می‌بیند، در حالی که عالمان بر رؤیت کوتاهی و تقصیر در آنچه شایسته جناب عالی است، می‌خوابند. پس در خواب جز آنچه آن‌ها را اندوهگین می‌سازد، از تاریکی‌ها و رعد و برق و هر امر ترسناکی نمی‌بینند. زیرا خواب تابع حس است. و چون نفس به طبع خود امور لذت‌بخش را دوست دارد و لذت توبه را در حال معرفت (المعرفة) و نهایت خود از دست داده است، از این رو به آغاز خود مشتاق می‌شود، به دلیل لذتی که با آن موطن همراه بوده است، با وجود علو مقامش. و این اشتیاق، استراحتی برای هم و غم اوست که معرفت (المعرفة) به خدا به او داده است. پس او مانند کسی است که از آرزوها لذت می‌برد. این است سبب اشتیاق صاحبان نهایت‌ها به آغازشان.\n\n### [منازل سُفلی و آنچه از مقامات عُلوی می‌بخشند]\n\nو اما منازل سُفلی (المنازل السفلية)، آن‌ها چیزهایی هستند که اعمال بدنی از مقامات عُلوی می‌بخشند، مانند نماز، جهاد، روزه و هر عمل حسی. و همچنین آنچه اعمال نفسی می‌بخشند، که همان ریاضت‌ها هستند، از تحمل آزار و صبر بر آن، و رضایت به اندک از لذت‌های نفسانی، و قناعت به موجود، هرچند کفایت نکند، و بازداشتن نفس از شکایت. زیرا هر یک از این اعمال ریاضتی و مجاهدات، نتایج مخصوصی دارد و برای هر عملی حال و مقامی است. و شارع برخی از این‌ها را بیان کرده است تا با آنچه ذکر کرده، بر آنچه مسکوت گذاشته است، استدلال شود، از حیث اختلاف نتایج به دلیل اختلاف صفات، و برای آگاه ساختن به اینکه نوافل (اعمال مستحب) هر عبادت واجبی، صفتش از صفت واجب آن است و از این رو اگر واجبش ناقص باشد، با آن کامل می‌شود.\nدر حدیث صحیح از رسول خدا (صلی الله علیه و سلم) آمده است که فرمود: «اولین چیزی که از عمل بنده به آن نگریسته می‌شود، نماز است. پس خداوند می‌فرماید: به نماز بنده من بنگرید، آیا آن را کامل انجام داده یا ناقص؟ اگر کامل باشد، برایش کامل نوشته می‌شود. و اگر چیزی از آن کم باشد، می‌فرماید: بنگرید آیا بنده من عمل مستحبی (تطوع) دارد؟ اگر عمل مستحبی داشته باشد، می‌فرماید: واجب بنده مرا از مستحب او کامل کنید. سپس اعمال دیگر نیز به همین منوال بررسی می‌شوند.»\nو اما حدیث دیگر در صفات عبادات،\nدر صحیح آمده است که رسول خدا (صلی الله علیه و سلم) فرمود: «نماز نور است، و صدقه برهان است، و صبر ضیاء (روشنایی) است، و قرآن حجتی است به سود یا زیان تو. همه مردم صبح می‌کنند و فروشنده نفس خود هستند، پس یا آن را آزاد می‌کنند یا به هلاکت می‌رسانند.»\nپس نور را برای نماز قرار داد، و برهان را برای صدقه که همان زکات است، و ضیاء (الضیاء) را برای روزه و حج که از آن به صبر تعبیر شده است، به دلیل مشقتی که در گرسنگی و تشنگی و آنچه مربوط به اعمال حج است، وجود دارد. و «لا إله إلا الله» را در خبری دیگر، چیزی قرار داد که هیچ چیز با آن برابری نمی‌کند.\nو نوافل هر یک از این فرایض از جنس آن است، پس صفتش مانند صفت آن است. سپس در سخن خود: «همه مردم صبح می‌کنند و فروشنده نفس خود هستند، پس یا آن را آزاد می‌کنند» کسی را وارد کرد که نفس خود را به خدا فروخته است. خداوند متعال می‌فرماید: «همانا خداوند از مؤمنان جان‌ها و اموالشان را خریده است» (إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ). «یا به هلاکت می‌رسانند» کسی است که «گمراهی را به هدایت و عذاب را به مغفرت خرید» (اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ وَالْعَذَابَ بِالْمَغْفِرَةِ). پس با قول خود: «همه مردم صبح می‌کنند و فروشنده نفس خود هستند» همه احکام شریعت، اعم از نافله، فریضه، مباح و مکروه را شامل شد.\n\n### [عبادات شرعی و ارتباط آن‌ها با اسماء و حقایق الهی]\n\nهیچ عبادتی نیست که خداوند برای بندگانش تشریع کرده باشد، مگر آنکه به یک اسم الهی یا حقیقتی الهی از آن اسم مرتبط است که در آن عبادت به او می‌بخشد؛ آنچه را که در دنیا در قلبش از منازل، علوم و معارف (المعرفة) و در احوالش از کرامات و آیات، و در آخرتش در بهشت‌هایش در درجات و رؤیت خالقش در کثیب (تپه مخصوص) در بهشت عدن، به طور خاص در مراتبش، می‌بخشد. و خداوند عز و جل درباره نمازگزار فرموده است که او با او مناجات می‌کند و او نور است.\nپس خداوند متعال با او از اسم خود «النور» مناجات می‌کند، نه از اسم دیگری. همانطور که نور هر ظلمتی را دور می‌کند، نماز نیز هر مشغله‌ای را قطع می‌کند، برخلاف سایر اعمال، زیرا آن‌ها نه، ترک هر آنچه غیر از نماز است را شامل نمی‌شوند. از این رو نماز نور بود. خداوند او را به این امر بشارت می‌دهد که وقتی از اسم «النور» با او مناجات می‌کند، با او خلوت می‌کند و هر کونی را با شهود (الشهود) خود هنگام مناجات از بین می‌برد. سپس آن را در مناجات، پنهان و آشکار تشریع کرد تا در آن، دو ذکر را برای او جمع کند: ذکر پنهان که همان ذکر در نفس خود است، و ذکر آشکار که همان ذکر در جمع است. بنده در نماز خود، خدا را در جمع فرشتگان و حاضران از موجودات شنونده یاد می‌کند، و این همان چیزی است که در قرائت نماز به صدای بلند می‌خواند.\nخداوند متعال در خبر ثابتی از خود فرموده است: «اگر مرا در نفس خود یاد کند، او را در نفس خود یاد می‌کنم، و اگر مرا در جمعی یاد کند، او را در جمعی بهتر از آن یاد می‌کنم.»\nشاید منظور از آن، فرشتگان مقرب کروبی باشند، به ویژه کسانی که آن‌ها را برای حضرت خود اختصاص داده است. به خاطر این فضیلت، جهر (آشکار خواندن) و سر (پنهان خواندن) قرائت در نماز برای آن‌ها تشریع شد. پس هر بنده‌ای که نماز خواند و نمازش هر چیزی غیر از آن را از او دور نکرد، نماز نخوانده است و آن در حق او نور نیست. و هر کس قرائت را در نفس خود پنهان کرد و ذکر خدا را برای خود مشاهده نکرد، پنهان نکرده است. زیرا اگرچه در ظاهر پنهان کرده است، اما در نفس خود آنچه را که از اکوان (موجودات) از اهل و فرزند و یاران از عالم دنیا و عالم آخرت حاضر کرده است، و فرشتگان را در خاطر خود حاضر کرده است، پس در قرائت خود پنهان نکرده است و از کسانی نبوده است که خدا را در نفس خود یاد کرده‌اند، به دلیل عدم تناسب. زیرا هنگامی که خداوند بنده را در نفس خود یاد می‌کند، هیچ یک از مخلوقات بر آنچه در نفس باری از ذکر بنده خود است، آگاه نمی‌شوند. همچنین شایسته است که بنده در آنچه پنهان می‌کند، چنین باشد. زیرا او در نماز خود مناجات نمی‌کند مگر با پروردگارش، در حال قرائت، تسبیحات و دعای خود. و همچنین هنگامی که او را در جمع، در ظاهر و باطن خود یاد می‌کند. اما در ظاهرش که آشکار است، و اما در باطنش، آنچه از مخلوقین در نفسش با او حاضر می‌شود، و این همان چیزی است که در قرائت نماز و تسبیحات و دعا به صدای بلند می‌خواند.\n\n### [نسبت نوریه در نماز و مقامات مقربان]\n\nسپس، در میان عبادات، چیزی نیست که بنده را به مقامات مقربان (المقربين) برساند، که بالاترین مقام اولیای خدا از ملک، رسول، نبی، ولی و مؤمن است، مگر نماز. خداوند متعال می‌فرماید: «و سجده کن و نزدیک شو» (وَاسْجُدْ وَاقْتَرِبْ). زیرا خداوند در این حالت به مقربان از فرشتگانش مباهات می‌کند. و این بدان سبب است که به آن‌ها می‌گوید: ای فرشتگان من، من شما را از ابتدا نزدیک کردم و شما را از خواص فرشتگانم قرار دادم. و این بنده من است که میان او و مقام قرب، حجاب‌های بسیاری و موانع عظیمی از اغراض نفسانی، شهوات حسی، تدبیر اهل و مال و فرزند و خدمتکاران و یاران و هول‌های بزرگ قرار دادم، اما او همه این‌ها را قطع کرد و جهاد نمود تا سجده کرد و نزدیک شد، پس از مقربان گشت. پس بنگرید به آنچه من شما را به آن اختصاص دادم، ای فرشتگان من، از شرافت مقام، در حالی که شما را به این موانع مبتلا نکردم و مشقت‌های آن‌ها را بر شما تکلیف ننمودم. پس قدر این بنده را بشناسید و حق آنچه را که در راه من متحمل شده است، رعایت کنید. پس فرشتگان می‌گویند: پروردگارا، اگر ما از کسانی بودیم که از بهشت‌ها متنعم می‌شدند و محل اقامت ما بود، آیا تو برای ما منازلی را که اعمالمان اقتضا می‌کرد، تعیین نمی‌کردی؟ پروردگارا، ما از تو می‌خواهیم که آن منازل را به این بنده ببخشی. پس خداوند آنچه را که فرشتگان برای او درخواست کردند، به او عطا می‌کند. پس بنگرید که نماز چقدر شریف است و بهترین چیز در آن، ذکر خدا از اقوال و سجود از افعال است. و از اقوال آن، «سمع الله لمن حمده» است، زیرا این از بهترین احوال بنده در نماز است به دلیل نیابت از حق (الحق).\nزیرا خداوند بر زبان بنده خود فرمود: «سمع الله لمن حمده» (خداوند سخن کسی را که او را ستایش کند، می‌شنود).\nخداوند متعال می‌فرماید: «همانا نماز از فحشا و منکر باز می‌دارد» (إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ) که به دلیل تحریم و تحلیلی است که در آن وجود دارد، و «و قطعاً یاد خدا بزرگتر است» (وَلَذِكْرُ اللَّهِ أَكْبَرُ) یعنی در آن از افعال آن.\n\n### [ذکر خدا با اذکار وارد شده در قرآن]\n\nشایسته است که محقق، خدا را جز با اذکاری که در قرآن وارد شده است، یاد نکند تا در ذکر خود تالی (تلاوت‌کننده) باشد و ذکر و تلاوت را با هم در یک لفظ جمع کند. پس به پاداش تلاوت‌کنندگان و ذاکران دست یابد، یعنی فضیلت را کسب کند. و فتح (گشایش) او در آن از همان قبیل باشد، و علم و سرّ و حال و مقام و منزلتش. و اگر او را بدون قصد ذکر وارد شده در قرآن یاد کند، فقط ذاکر است و بس. پس از فضیلت به اندازه قصدی که کم گذاشته است، کاسته می‌شود، حتی اگر آن ذکر از قرآن باشد، اما قصد آن را نکرده باشد. و ثابت شده است که اعمال به نیت‌هاست و برای هر کس همان است که نیت کرده است.\nپس شایسته است که وقتی می‌گویی «لا إله إلا الله»، قصد تهلیل وارد شده در قرآن را داشته باشی، مانند قول خداوند متعال: «پس بدان که معبودی جز الله نیست» (فَاعْلَمْ أَنَّهُ لَا إِلَٰهَ إِلَّا اللَّهُ). و همچنین تسبیح و تکبیر و تحمید. و تو می‌دانی که نفس‌های انسان نفیس است و نفسی که بگذرد باز نمی‌گردد. پس شایسته است که آن را در نفیس‌ترین و عزیزترین امور خارج کنی. اینک تو را بر نسبت نوریه نماز آگاه ساختم.\n\n### [سرّ همراهی برهان با صدقه، و ضیاء با صبر]\n\nو اما همراهی برهان (البرهان) با صدقه، این است که خداوند متعال انسان را بر بخل سرشته است و فرموده است: «همانا انسان حریص آفریده شده است» (إِنَّ الْإِنسَانَ خُلِقَ هَلُوعًا) یعنی در اصل آفرینش خود، «هنگامی که شری به او رسد، بی‌تاب است» (إِذَا مَسَّهُ الشَّرُّ جَزُوعًا) و «و هنگامی که خیری به او رسد، بازدارنده است» (وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا). و فرمود: «و کسانی که از بخل نفس خود در امان بمانند» (وَمَن يُوقَ شُحَّ نَفْسِهِ). پس بخل را به نفس انسان نسبت داد. و اصل این امر آن است که او هستی (الوجود) خود را از خدا کسب کرده است، پس بر کسب فایده سرشته شده است نه بر افاده (بخشیدن). پس حقیقت او اقتضا نمی‌کند که صدقه دهد. بنابراین، اگر صدقه دهد، صدقه‌اش برهانی است بر اینکه از بخل نفس خود که خداوند او را بر آن سرشته بود، در امان مانده است. از این رو فرمود: «صدقه برهان است.» و چون خورشید ضیاء (روشنایی) است که با آن هر آنچه بر آن می‌تابد، برای کسی که بینایی دارد، آشکار می‌شود، زیرا کشف (الکشف) تنها با ضیاء نور رخ می‌دهد نه با نور (النور). زیرا نور جز دور کردن ظلمت کاری ندارد، اما با ضیاء است که کشف (الکشف) واقع می‌شود. و همانا نور حجاب است، همانطور که ظلمت حجاب است.\nرسول خدا (صلی الله علیه و سلم) در حق پروردگار متعال خود فرمود: «حجاب او نور است.»\nو فرمود: «همانا خداوند هفتاد حجاب از نور و ظلمت دارد، یا هفتاد هزار.»\nو به او (صلی الله علیه و سلم) گفته شد: آیا پروردگارت را دیدی؟ فرمود: «نور است، چگونه او را ببینم؟»\nپس صبر (که همان روزه و حج است) را ضیاء (الضیاء) قرار داد، یعنی اگر به آن متلبس باشی، با آن آنچه را که حقیقت ضوء (روشنایی) از درک اشیاء می‌بخشد، کشف می‌کنی.\n\n### [روزه صفتی صمدانی است: پس آن برای خداست و اوست که پاداش آن را می‌دهد]\n\nرسول خدا (صلی الله علیه و سلم) از پروردگار متعال خود فرمود که او گفت: «هر عمل فرزند آدم برای اوست، مگر روزه که برای من است و من خود پاداش آن را می‌دهم.»\nو به مردی فرمود: «بر تو باد روزه، زیرا هیچ مانندی برای آن نیست.»\nو خداوند متعال می‌فرماید: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ). پس روزه صفتی صمدانی است، و آن تنزه از تغذیه است، در حالی که حقیقت مخلوق تغذیه است. هنگامی که بنده خواست به صفتی متصف شود که از حقیقت او نیست که به آن متصف شود، و اتصاف او به آن شرعی بود، به دلیل قول خداوند متعال: «روزه بر شما واجب شده است، همانطور که بر کسانی که پیش از شما بودند واجب شد» (كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ)، خداوند به او فرمود: «روزه برای من است نه برای تو»، یعنی من کسی هستم که شایسته نیست بخورم و بنوشم. و چون روزه در این مرتبه بود و سبب ورود تو در آن، تشریع من برای تو بود، پس من خود پاداش آن را می‌دهم. گویی می‌گوید: و من جزای آن هستم، زیرا صفت تنزه از طعام و شراب مرا می‌طلبد و تو به آن متلبس شده‌ای، در حالی که حقیقت تو نیست و برای تو نیست، و تو در حال روزه به آن متصف هستی. پس این صفت تو را به سوی من وارد می‌کند. زیرا صبر (الصبر) بازداشتن نفس است، و تو آن را به امر من از آنچه حقیقتش اقتضا می‌کند، یعنی طعام و شراب، بازداشتی. از این رو\nبرای روزه‌دار دو شادی قرار داد: شادی هنگام افطارش، و آن شادی برای روح حیوانی اوست و بس؛ و شادی هنگام لقاء پروردگارش.\nو آن شادی برای نفس ناطقه اوست، یعنی لطیفه ربانی او. پس روزه، لقاء الله (دیدار خدا) را که همان مشاهده (المشاهدة) است، به او به ارث داد.\n\n### [روزه مشاهده است و نماز مناجات]\n\nپس روزه کامل‌تر از نماز بود، زیرا لقاء الله و مشاهده (المشاهدة) او را نتیجه داد، در حالی که نماز مناجات است نه مشاهده (المشاهدة)، و حجاب (الحجاب) همراه آن است. زیرا خداوند می‌فرماید: «و برای هیچ بشری ممکن نیست که خدا با او سخن بگوید مگر از طریق وحی یا از پشت حجابی» (وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ). و خداوند با موسی نیز اینگونه سخن گفت و به همین دلیل موسی طلب رؤیت کرد. پس سخن گفتن را با حجاب همراه ساخت و مناجات مکالمه است.\nخداوند می‌فرماید: «نماز را میان خود و بنده خود نصف کردم، نصفش برای من و نصفش برای بنده من است و برای بنده من است آنچه درخواست کند.»\nبنده می‌گوید: «ستایش مخصوص خداست که پروردگار جهانیان است» (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ). خداوند می‌گوید: «بنده من مرا ستایش کرد.» اما روزه تقسیم نمی‌شود، پس آن برای خداست و اجرش از آنجاست که برای خداست. و در اینجا سرّ شریفی است. گفتیم که مشاهده (المشاهدة) و مناجات با هم جمع نمی‌شوند. زیرا مشاهده برای بهت و حیرت است و کلام برای فهم. پس تو در حال سخن گفتن با آنچه سخن گفته می‌شود هستی نه با گوینده، هر چه که باشد. پس قرآن را بفهم تا فرقان را بفهمی. با این بیان، تفاوت میان نماز، روزه و صدقه برای تو حاصل شد. و اما قول ما که خداوند جزای روزه‌دار را لقاء پروردگارش در شادی به او قرار داده است، سرّ آن در قول او در سوره یوسف است: «هر کس در بار او یافت شود، پس او جزای اوست» (مَن وُجِدَ فِي رَحْلِهِ فَهُوَ جَزَاؤُهُ).\n\n### [حج و آنچه از انواع صبر در آن است]\n\nو اما حج، به دلیل آنچه در آن از صبر (الصبر) است، و آن بازداشتن انسان از نکاح و پوشیدن لباس دوخته و زردی (عطر) است، همانطور که انسان نفس خود را در روزه از طعام و شراب و نکاح باز می‌دارد. و چون حج، بازداشتن انسان از طعام و شراب را شامل نمی‌شود، مگر از نکاح و غیبت، از این رو در قواعدی که اسلام بر آن‌ها بنا شده است، تأخیر یافت. پس حکم آن، حکم روزه‌دار و نمازگزار در حال روزه و نمازشان در تنزه از مباشرت با همسر است. و آن تنزه را خداوند می‌فرماید: «آن برای من است نه برای تو»، هر جا که باشد. و چون نکاح سبب ظهور مولدات است، خداوند به او در ازای ترک آن به خاطر او، بدل آن را در آخرت و برای اولیای خود در دنیا، با «بسم الله» به کسی که خداوند بخواهد اثری بر دست او ظاهر شود، عطا می‌کند. پس بنده در آخرت برای چیزی که می‌خواهد، می‌گوید: «باش، پس می‌شود» (كُنْ فَيَكُونُ). و این قول او نیست مگر به دلیل حاجی بودن یا روزه‌دار بودن او. و از این رو حج و روزه را در لفظ صبر شریک ساخت و فرمود: «و صبر ضیاء است.» این در حالی است که در حج روزه واجبی نیست، اما ترک طعام در آن به دلیل مشغولیت به دعا در آن روز (روز عرفه) از ظهر، که سنت در آن روز و در آن مکان برای حاجی است، می‌باشد. پس کسی که در آن مشغول است، شکی نیست که گرسنگیِ عادت، او را فرا می‌گیرد.\n\n### [مرگ‌های چهارگانه نزد صوفیه]\n\nو طایفه (صوفیه) گرسنگی را در مرگ‌های چهارگانه، مرگ سفید (الموت الأبيض) می‌نامند، و آن مناسب ضیاء (الضیاء) است. زیرا برای اهل الله چهار مرگ است: مرگ سفید که همان گرسنگی است؛ و مرگ سرخ (الموت الأحمر) که همان مخالفت با نفس در هوای آن است؛ و مرگ سبز (الموت الأخضر) که همان انداختن وصله‌ها بر لباس است؛ و مرگ سیاه (الموت الأسود) که همان تحمل آزار خلق، بلکه مطلق آزار است. و پوشیدن مرقعات (لباس وصله‌دار) را مرگ سبز نامیدند، زیرا حالت آن، حالت زمین در اختلاف گیاهان و گل‌هاست، پس شبیه اختلاف وصله‌هاست. و اما مرگ سیاه به دلیل تحمل آزار است، زیرا در آن غم نفس است و غم، ظلمت نفس است و ظلمت در رنگ‌ها شبیه سیاهی است. و مرگ سرخ، مخالفت با نفس است که شبیه سرخی خون است، زیرا هر کس با هوای نفس خود مخالفت کند، نفس خود را ذبح کرده است. و ان‌شاءالله در این کتاب، ابواب جداگانه‌ای در شهادت توحید، نماز، زکات، روزه و حج که قواعدی هستند که اسلام بر آن‌ها بنا شده است، خواهد آمد. و هر کس بخواهد چیزی از اسرار نماز و آنچه هر نماز از معارف (المعرفة) نتیجه می‌دهد و آنچه از ارواح نبوی و حرکات فلکی دارد را بداند، به کتاب ما به نام «التنزلات الموصلية» بنگرد. و این مقدار در این باب برای مقصود کافی است. و برخی از اسرار معارف (المعرفة) را به طریق ایجاز (اختصار) ذکر می‌کنیم، همانطور که عنوان کردیم.\n\n### (فصل) بلکه سرّی الهی [سرّ قدر حاکم بر بشر]\n\nملائکه گفتند: «و هیچ یک از ما نیست مگر آنکه برای او مقامی معلوم است» (وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَّعْلُومٌ). و همچنین هر موجودی، به جز جن و انس (الثقلين). اگرچه جن و انس نیز در مقام خود آفریده شده‌اند، اما برای جن و انس در علم خدا مقاماتی معین و مقدر نزد او وجود دارد که از آن‌ها پنهان شده است و هر شخص از آن‌ها با پایان یافتن نفس‌هایش به آن می‌رسد. پس آخرین نفس، مقام معلوم اوست که بر آن می‌میرد. و از این رو به سلوک فرا خوانده شدند، پس سلوک کردند؛ از طریق علو با اجابت دعوت مشروع، و از طریق سفل با اجابت امر ارادی، بدون آنکه بدانند مگر پس از وقوع مراد. پس هر شخص از جن و انس در سلوک خود به مقام معلومی که برای او خلق شده است، می‌رسد، و از آن‌ها شقی و سعید است. و هر موجودی غیر از این دو، در مقام خود آفریده شده است و از آن فرود نیامده است، پس به سلوک به سوی آن امر نشده است، مانند فرشته، حیوان، نبات و معدن. پس او نزد خدا سعید است و شقاوتی به او نمی‌رسد. پس جن و انس در قول ملائکه: «و هیچ یک از ما نیست مگر آنکه برای او مقامی معلوم است» (وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَّعْلُومٌ) نزد خدا وارد شدند. و برای هیچ مخلوقی از عالم ممکن نیست که به مقام خود علم داشته باشد مگر با تعریف الهی، نه به صرف بودن در آن. زیرا هر آنچه غیر خداست ممکن است و شأن ممکن این است که مقام معینی را به ذات خود نپذیرد، بلکه آن مقام به دلیل مرجّحی است بر حسب آنچه در علم او (خدا) نسبت به آن سبقت گرفته است. و معلوم کسی است که علم به آن را به او داده است، و او نمی‌داند که بر چه خواهد بود. و این همان سرّ قدر (القدر) است که بر خلق حاکم است، زیرا علم مرجّح تغییر نمی‌پذیرد، به دلیل محال بودن عدم قدیم، و علم او به تعیین مقامات قدیم است، از این رو معدوم نمی‌شود.\n\n### [علم باری به اشیاء زائد بر ذات او نیست]\n\nو این مسئله از غامض‌ترین مسائل عقلی است و از جمله چیزهایی است که دلالت می‌کند بر اینکه علم او سبحانه به اشیاء زائد بر ذات او نیست، بلکه ذات اوست که از حیث علم بودن به معلومات، به همان صورتی که معلومات هستند، تعلق گرفته است، برخلاف نظر برخی از متفکران. زیرا آن نظر منجر به نقص ذات از درجه کمال می‌شود و منجر به این می‌شود که امری زائد بر ذات حکم کرده باشد که آن زائد، حکمی را که اقتضا می‌کند، بر ذات واجب کرده است، و این ابطال می‌کند که ذات هر چه بخواهد انجام می‌دهد و اختیار می‌کند: «معبودی جز او نیست، عزیز حکیم» (لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ). پس این مسئله را محقق کن و به آن بپرداز، زیرا در مسائل حیرت بسیار غامض است و عقل به حقیقت آن از طریق فکر راه نمی‌یابد، بلکه با کشف (الکشف) الهی نبوی.\n\n### [برتری میان بنی آدم و ملائکه]\n\nسپس باز می‌گردیم و می‌گوییم: گروهی از اصحاب ما در این مسئله به دلیل عدم کشف (الکشف) دچار اشتباه شده‌اند و به طریق قوت و فکر فاسد گفتند که انسان کامل (الإنسان الکامل) از بنی آدم مطلقاً از ملائکه نزد خدا برتر است. و هیچ صنف یا مرتبه‌ای از مراتب را که فضیلت بر دیگری در آن واقع می‌شود، مقید نکردند. سپس تعلیل آوردند و گفتند: برای بنی آدم ترقی با نفس‌ها وجود دارد، در حالی که برای ملائکه اینگونه نیست، زیرا آن‌ها در مقام خود خلق شده‌اند. و این گروه گوینده، این حقیقتی را که ما بر آن آگاه ساختیم، ندانستند. و صحیح این است که ترقی برای ما و برای ملائکه و برای غیر آن‌ها وجود دارد و برای همه لازم است، در دنیا، برزخ و آخرت. این برای هر کسی است که متصف به موت در علم باشد. آیا نمی‌بینی که ملائکه با وجود اینکه مقامات معلومی دارند که از آن‌ها تجاوز نمی‌کنند، از علم بیشتر محروم نشده‌اند؟ زیرا خداوند به ما شناسانده است که علم اسماء را بر زبان آدم (علیه السلام) به آن‌ها آموخت، پس علم الهی را که نزد آن‌ها نبود، درباره اسماء الهی به آن‌ها افزود. پس آن‌ها خدا را با آن اسماء تسبیح و تقدیس کردند. پس ملائکه در ترقی علمی با ما برابر شدند، نه در عمل، همانطور که ما نیز در آخرت به دلیل زوال تکلیف، با اعمال آخرت ترقی نمی‌کنیم. پس ما و آن‌ها در آخرت در این امر برابر هستیم. و ما در دنیا به مقامی که بر آن قبض شدیم، ترقی نکردیم، در حالی که غیر ما ابتدا در آن مقام خلق شد، به دلیل شرافت ما بر غیر ما. و این تنها برای آن بود که ما را بیازماید و بس. پس گویندگان به این امر، آنچه را که خدا اراده کرده بود، نفهمیدند، با وجود نصوص در قرآن مانند قول او: «تا شما را بیازماید که کدام یک از شما عمل بهتری دارید» (لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا). و گفته نمی‌شود که خلق شدن آن‌ها بر صورت (الهی) منجر به این ابتلا شد، زیرا جن در این مرتبه با ما شریک هستند و بهره‌ای از صورت ندارند. پس بدان، و خداوند توفیق‌دهنده است.\n\n### (وصل سرّی الهی) [نیازمندی عالم به خدا و بی‌نیازی خدا از عالم]\n\nنهایت دایره مجاور آغاز آن است و آن (نهایت) نقطه را به ذات خود می‌طلبد، در حالی که نقطه آن را نمی‌طلبد. پس نهایت اهل ترقی از عالم صحیح است و نیازمندی عالم به خدا و بی‌نیازی خدا از عالم صحیح است. و روشن می‌شود که هر جزئی از عالم می‌تواند سببی برای هستی (الوجود) عالم دیگری مانند خود باشد، نه کامل‌تر از آن، تا بی‌نهایت. زیرا محیط دایره، نقاطی است که در حوزه‌های مجاور یکدیگر قرار دارند، و میان دو حوزه، حوزه سومی نیست، و میان دو نقطه فرض شده یا موجود در آن‌ها، نقطه سومی نیست، زیرا حوزه‌ای میان آن‌ها نیست. پس هر نقطه‌ای می‌تواند محیطی از آن پدید آید و حکم آن محیط دیگر، حکم محیط اول است تا بی‌نهایت.\n\n### [نهایت در عالم حاصل است نه غایت از آن]\n\nو نهایت (النهاية) در عالم حاصل است، اما غایت (الغاية) از عالم حاصل نیست. پس آخرت پیوسته در حال تکوین از عالم است. زیرا آن‌ها در بهشت‌ها برای چیزی که می‌خواهند، می‌گویند: «باش، پس می‌شود» (كُنْ فَيَكُونُ). پس هیچ امری را توهم نمی‌کنند و هیچ خاطری برایشان در تکوین امری خطور نمی‌کند، مگر آنکه در برابرشان تکوین می‌یابد. و همچنین اهل آتش، هیچ خاطر ترسی از عذابی بزرگتر از آنچه در آن هستند، برایشان خطور نمی‌کند، مگر آنکه آن عذاب در آن‌ها یا برای آن‌ها تکوین می‌یابد، و آن عین حصول خاطر است. زیرا سرای آخرت اقتضای تکوین عالم از عالم را دارد، اما به صورت حسی و صرفاً با حصول خاطر، همّ، اراده، آرزو و شهوت. همه این‌ها محسوس است. و این در دنیا نیست، یعنی فعل با همت برای هر کسی. و این در دنیا برای غیر ولی نیز بوده است، مانند صاحب چشم‌زخم و غِرانیه در آفریقا، اما به سرعت تکوین شیء با همت در سرای آخرت نیست. و این در سرای دنیا نادر و شاذ است، مانند شاخه بید و غیره، در حالی که در سرای آخرت برای همگان است.\n\n### [در امکان، بدیع‌تر از این عالم نیست]\n\nپس سخن امام ابوحامد (غزالی) صادق است که: «در امکان، بدیع‌تر از این عالم نیست»، زیرا کامل‌تر از صورتی که انسان کامل (الإنسان الکامل) بر آن خلق شده است، وجود ندارد. اگر وجود داشت، در عالم چیزی بود که کامل‌تر از صورتی باشد که همان حضرت الهی است.\n\n### (وصل سرّی الهی) [وحدت نقطه مرکز و کثرت خطوط خارج شده از آن به سوی محیط]\n\nهر خطی که از نقطه به سوی محیط خارج می‌شود، با خط دیگر برابر است و به نقطه‌ای از محیط منتهی می‌شود. و نقطه در ذات خود متعدد نشده و افزایش نیافته است، با وجود کثرت خطوط خارج شده از آن به سوی محیط. و آن نقطه با ذات خود با هر نقطه‌ای از محیط مقابله می‌کند. زیرا اگر آنچه با آن با نقطه‌ای از محیط مقابله می‌کند، غیر از چیزی باشد که با نقطه دیگری مقابله می‌کند، تقسیم می‌شد و صحیح نبود که واحد باشد، در حالی که واحد است. پس با همه نقاط، با وجود کثرتشان، جز با ذات خود مقابله نکرده است. پس کثرت از عین واحد ظاهر شده است و خود در ذاتش متکثر نشده است. پس قول کسی که می‌گوید: «از واحد جز واحد صادر نمی‌شود» باطل است. و آن خطی که از نقطه به سوی نقطه واحد از محیط خارج می‌شود، همان وجه حاصلی است که برای هر موجودی از خالقش سبحانه حاصل می‌شود، و آن قول اوست: «همانا سخن ما برای چیزی هنگامی که اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود» (إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَن نَّقُولَ لَهُ كُن فَيَكُونُ). پس اراده در اینجا همان خطی است که فرض کردیم از نقطه دایره به سوی محیط خارج می‌شود، و آن توجه الهی است که آن نقطه را در محیط با ایجاد معین کرده است، زیرا آن محیط، عین دایره ممکنات است و نقطه‌ای که در وسط است و برای نقطه دایره محیط معین شده است، واجب الوجود لنفسه است.\n\n### [ممکنات محصور در جوهر متحیز و غیر متحیز و اکوان و الوان]\n\nو آن دایره فرض شده، دایره اجناس ممکنات است و آن‌ها محصور در جوهر متحیز (دارای حیز) و جوهر غیر متحیز و اکوان (حالات) و الوان (کیفیت‌ها) هستند. و آنچه محصور نیست، هستی (الوجود) انواع و اشخاص است، و آن چیزی است که از هر نقطه از هر دایره‌ای از دایره‌ها حادث می‌شود. زیرا در آن، دایره‌های انواع و از دایره‌های انواع، اشخاص حادث می‌شود. پس این را بدان. و اصل همه این‌ها، نقطه اولی است. و آن خط متصل از نقطه به سوی نقطه معین از محیطش، از آن به سوی آنچه از آن متولد می‌شود از نقاط در نیم‌دایره خارج از آن امتداد می‌یابد. و از آن نصف، دایره‌های کامل خارج می‌شود. و علت این امر، امتیاز میان واجب الوجود لنفسه و ممکن است. پس ممکن که دایره اجناس است، نمی‌تواند دایره کاملی را ظاهر سازد، زیرا در این صورت با مشارکتی که امتیاز با آن واقع شده است، وارد می‌شد و این محال است. پس تکوین دایره کامل از اجناس محال است تا نقص ممکن از کمال واجب الوجود لنفسه آشکار شود. و صورت امر در آن چنین است: صورت شکل اجناس و انواع، بدون قصد حصر، زیرا برای انواع، انواعی است تا به نوع اخیر منتهی شود، همانطور که به جنس اجناس منتهی می‌شود.\n\n### [دو نیروی علمی و عملی در نفوس جن و انس و حیوان ساری است]\n\nو بدان که برای نفوس جن و انس (الثقلين) و نفوس حیوان، دو نیرو وجود دارد: نیروی علمی و نیروی عملی، نزد اهل کشف (الکشف). و این در عموم حیوانات آشکار شده است، مانند زنبور عسل، عنکبوت‌ها، پرندگانی که آشیانه می‌سازند و دیگر حیوانات. و برای نفوس جن و انس، بدون سایر حیوانات، نیروی سومی وجود دارد که نه برای حیوان است و نه برای نفس کلی، و آن نیروی متفکره است. پس این نوع انسانی برخی از علوم را از طریق فکر کسب می‌کند و با سایر عالم در گرفتن علوم از فیض الهی شریک است. و برخی از علوم آن مانند حیوان، فطری است، مانند گرفتن پستان مادر توسط کودک برای شیر خوردن و پذیرش شیر.\n\n### [فکر از انسان به منزله تدبیر و تفصیل از خداست]\n\nو برای غیر انسان، کسب علومی که از طریق فکر با او باقی بماند، وجود ندارد. پس فکر از انسان به منزله حقیقت الهی است که در قول خداوند متعال تصریح شده است: «امر را تدبیر می‌کند و آیات را تفصیل می‌دهد» (يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ). و قول او در خبر صحیح از خود: «در هیچ کاری که انجام می‌دهم، تردید نکردم.»\nو عقل اول و نفس کلی این حقیقت را ندارند. پس این نیز از جمله اموری است که انسان به دلیل صورتی که غیر او بر آن خلق نشده است، به آن اختصاص یافته است.\n\n### [انسان کامل بر صورت خلق شده است]\n\nو ما می‌دانیم که انسان کامل (الإنسان الکامل) بر صورت (الصورة) موجود است. و ما قطع داریم که خداوند غیر انسان را بر آن خلق نکرده است. زیرا وقوع یا عدم وقوع آن نه بر زبان پیامبری و نه در کتابی نازل شده وارد نشده است، اگرچه گروهی در این باره اشتباه کرده‌اند. زیرا آن‌ها در این امر به تعریف الهی استناد نکرده‌اند، بلکه به خبر احتجاج می‌کنند، در حالی که در خبر چیزی نیست که دلالت کند بر اینکه غیر انسان کامل بر صورت خلق نشده است. و ممکن است صحت داشته باشد و ممکن است صحت نداشته باشد.\n\n### (وصل سرّی الهی) [طبیعت میان نفس کلیه و ماده اولیه]\n\nطبیعت (الطبيعة) میان نفس (النفس) و هباء (الهباء) است، و این رأی امام ابوحامد (غزالی) است. و مرتبه آن نمی‌تواند جز در آنجا باشد. پس هر جسمی پیش از هباء تا آخرین موجود از اجسام، طبیعی است. و هر آنچه از اجسام طبیعی متولد می‌شود، از امور، قوا، ارواح جزئی، ملائکه و انوار، طبیعت در آن‌ها حکم الهی دارد که خداوند متعال آن را قرار داده و مقدر کرده است. پس حکم طبیعت از هباء تا مادون آن است، و حکم نفس کلیه از طبیعت تا مادون آن است. و در مافوق نفس، نه حکم طبیعت است و نه حکم نفس. و در آنچه ذکر کردیم، اختلاف بسیاری میان اصحاب نظر از غیر طریق ما از حکما وجود دارد. زیرا متکلم از حیث متکلم بودن، بهره‌ای در این علم ندارد، برخلاف حکیم. زیرا حکیم تعبیری است از کسی که علم الهی، طبیعی، ریاضی و منطقی را جمع کرده است. و جز این چهار مرتبه از علوم وجود ندارد.\n\n### [علم نظری و علم وهبی]\n\nو راه تحصیل آن‌ها میان فکر و وهب (الوهب) که همان فیض الهی است، متفاوت است. و روش اصحاب ما بر وهب است. آن‌ها در فکر دخالتی ندارند، زیرا فساد به آن راه می‌یابد و صحت آن مظنون است، پس به آنچه می‌دهد، اعتماد نمی‌شود. و منظورم از اصحاب ما، صاحبان قلوب و مشاهدات (المشاهدات) و مکاشفات (الکشف) هستند، نه عابدان و زاهدان و نه مطلق صوفیه، مگر اهل حقایق و تحقیق از میان آن‌ها. و از این رو در علوم نبوت و ولایت گفته می‌شود که آن‌ها فراتر از طور عقل هستند و عقل با فکر در آن‌ها دخالتی ندارد، بلکه تنها پذیرش دارد، نزد عقل سلیمی که شبهه خیالی فکری بر آن غلبه نکرده باشد که موجب فساد نظر او شود. و علوم اسرار بسیار است و «خداوند حق می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 7
}