{
  "id": 52,
  "title": {
    "ar": "الباب الثاني والخمسون في معرفة السبب الذي يهرب منه المكاشف إلى عالم الشهادة إذا أبصره",
    "en": "Chapter Fifty-Two: Concerning the Knowledge of the Reason for which the Recipient of Unveiling (المكاشف) Flees to the World of Witnessing (عالم الشهادة) when he Perceives It.",
    "ur": "باب باون: اس سبب کی معرفت (المعرفة) میں جس کی وجہ سے صاحبِ کشف (المكاشف) اسے دیکھنے کے بعد عالمِ شہادت (عالم الشهادة) کی طرف فرار اختیار کرتا ہے۔",
    "fa": "باب پنجاه و دوم در معرفت سببی که مکاشف (المكاشف) چون آن را ببیند، از آن به عالم شهادت (عالم الشهادة) می‌گریزد."
  },
  "content": {
    "ar": "## (الباب الثاني والخمسون في معرفة السبب الذي يهرب منه المكاشف إلى عالم الشهادة إذا أبصره)\n\n\n> كل من خاف على هيكله *** لم ير الحق جهارا علنا\n\n\n> فتراه عند ما يشهده *** راجعا للكون يبغي البدنا\n\n\n> وترى الشجعان قد ما طلبا *** للذي يحذر منه الجبنا\n\n\n### [النفوس الإنسانية مجبولة، في أصل نشأتها، على الجزع‏]\n\n\nاعلم أيدك الله بروح منه أن النفوس الإنسانية قد جبلها الله على الجزع في أصل نشأتها فالشجاعة والإقدام لها أمر\nعرضي والجزع في الإنسان أقوى منه في الحيوانات إلا الصرصر تقول العرب أجبن من صرصر وسبب قوته في الإنسان العقل والفكر الذي ميزه الله بهما على سائر الحيوان وما يشجع الإنسان إلا القوة الوهمية كما أنه أيضا بهذه القوة يزيد جبنا وجزعا في مواضع مخصوصة فإن الوهم سلطان قوي وسبب ذلك أن اللطيفة الإنسانية متولدة بين الروح الإلهي الذي هو النفس الرحماني وبين الجسم المسوي المعدل من الأركان المعدلة من الطبيعة التي جعلها الله مقهورة تحت النفس الكلية كما جعل الأركان مقهورة تحت حكم سلطان الأفلاك‏\n\n\n### [الجسم الحيواني هو في الدرجة الخامسة من القهر]\n\n\nثم إن الجسم الحيواني مقهور تحت سلطان الأركان التي هي العناصر فهو مقهور لمقهور عن مقهور وهو النفس عن مقهور وهو العقل فهو في الدرجة الخامسة من القهر من وجه فهو أضعف الضعفاء قال الله عز وجل الله الذي خلقكم من ضعف فالضعف أصله ثم جعل له قوة عارضة وهو قوله ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً ثم رده إلى أصله من الضعف فقال عز وجل ثُمَّ جَعَلَ من بَعْدِ قُوَّةٍ ضَعْفاً وشَيْبَةً فهذا الضعف الأخير إنما أعده لإقامة النشأة الآخرة عليه كما قامت نشأة الدنيا على الضعف ولقد علمتم النشأة الأولى‏\n\n\n### [الجزع في الإنسان دليل افتقاره إلى الله‏]\n\n\nوإنما كان هذا ليلازم ذاته الذلة والافتقار وطلب المعونة والحاجة لي خالقه ومع هذا كله يذهل عن أصله ويتيه بما عرض له من القوة فيدعي ويقول أنا ويمني نفسه بمقابلة لأهوال العظام فإذا قرصة برغوث أظهر الجزع لوجود الألم وبادر لإزالة ذلك الضرر ولم يقربه قرار حتى يجده فيقتله وما عسى أن يكون البرغوث حتى يعتني به هذا الاعتناء ويزلزله عن مضجعه ولا يأخذه نوم فأين تلك الدعوى والإقدام على الأهوال العظام وقد فضحته قرصة برغوث أو بعوضة هذا أصله ذلك ليعلم أن إقدامه على الأهوال العظام إنما هو بغيره لا بنفسه وهو ما يؤيده الله به من ذلك كما قال وأَيَّدْناهُ أي قويناه ولهذا شرع وإِيَّاكَ نَسْتَعِينُ في كل ركعة ولا حول ولا قوة إلا بالله‏\n\n\n### [الوجود لذة وحلاوة والعدم ألم وارتياع‏]\n\n\nولما علم الإنسان أنه لو لا جود الله عز وجل لم يظهر له عين في الوجود وأن أصله لم يكن شيئا مذكورا قال تعالى وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً فللوجود لذة وحلاوة وهو الخير ولتوهم العدم العيني ألم شديد عظيم في النفوس لا يعرف قدر ذلك إلا العلماء ولكن كل نفس تجزع من العدم أن تلحق به كما هو حالها فمهما رأت أمرا تتوهم فيه أنه يلحقها بعدم عينها أو بما يقاربه هربت منه وارتاعت وخافت على عينها وبما كانت أيضا عن الروح الإلهي الذي هو نفس الرحمن ولهذا كني عنه بالنفخ لمناسبة النفس فقال ونفخت فيه من روحي وكذا جعل عيسى بنفخ في صورة طينية كهيئة الطير\n\n\n### [الأرواح: ظهورها، محالها صحتها مرضها]\n\n\nفما ظهرت الأرواح إلا من الأنفاس غير أن للمحل الذي تمر به أثرا فيها بلا شك أ لا ترى الريح إذا مرت على شي‏ء نتن جاءت ريح منتنة إلى مشمك وإذا مرت بشي‏ء عطر جاءت بريح طيبة لذلك اختلفت أرواح الناس فروح طيبة لجسد طيب ما أشركت قط ولا كانت محلا لسفساف الأخلاق كأرواح الأنبياء والأولياء والملائكة وروح خبيث لجسد خبيث لم تزل مشركة محلا لسفساف الأخلاق وذلك إنما كان لغلبة بعض الطبائع أعني الأخلاط على بعض في أصل نشأة الجسد التي هي سبب طيب الروح ووجود مكارم الأخلاق وسفسافها وخبث الروح فصحة الأرواح وعافيتها مكارم أخلاقها التي اكتسبتها من نشأة بدنها العنصري فجاءت بكل طيب ومليح ومرض الأرواح سفساف الأخلاق ومذمومها التي اكتسبتها أيضا من نشأة بدنها العنصري فجاءت بكل خبيث وقبيح ألا ترى الشمس إذا أفاضت نورها على جسم الزجاج الأخضر ظهر النور في الحائط أو في الجسم الذي تطرح الشعاع عليه أخضر وإن كان الزجاج أحمر طرح الشعاع أحمر في رأى العين فانصبغ في الناظر بلون المحل وذلك للطافته يقبل الأشياء بسرعة ولما كان الهواء من أقوى الأشياء وكان الروح نفسا وهو شبيه بالهواء كانت القوة له فكان أصل نشأة الأرواح من هذه القوة واكتسبت الضعف من المزاج الطبيعي البدني فإنه ما ظهر لها عين إلا بعد أثر المزاج الطبيعي فيها فخرجت ضعيفة لأنها إلى الجسم أقرب في ظهور عينها فإذا قبلت القوة إنما تقبلها من أصلها الذي هو النفس الرحماني المعبر عنه بالروح المنفوخ منه المضاف إلى الله فهي قابلة للقوة كما هي قابلة للضعف وكلاهما بحكم الأصل وهي إلى البدن أقرب لأنها أحدث عهدا به فغلب ضعفها على قوتها فلو تجردت عن المادة ظهرت قوتها الأصلية التي لها من النفخ الإلهي ولم يكن شي‏ء أشد تكبرا منها فألزمها الله الصورة الطبيعية دائما في الدنيا وفي البرزخ في النوم وبعد الموت فلا ترى نفسها أبدا مجردة عن المادة وفي الآخرة لا تزال في‏\nأجسادها يبعثها الله من صور البرزخ في الأجساد التي أنشأها لها يوم القيامة وبها تدخل الجنة والنار ذلك ليلزمها الضعف الطبيعي فلا تزال فقيرة أبدا أ لا تراها في أوقات غفلتها عن نفسها كيف يكون منها التهجم والإقدام على المقام الإلهي فتدعى الربوبية كفرعون وتقول في غلبة ذلك الحال عليها أنا الله وسبحاني كما قال ذلك بعض العارفين وذلك لغلبة الحال عليه ولهذا لم يصدر مثل هذا اللفظ من رسول ولا نبي ولا ولي كامل في علمه وحضوره ولزومه باب المقام الذي له وأدبه ومراعاة المادة التي هو فيها وبها ظهر\n\n\n### [أفعال العباد وإضافتها إلى الله وإليهم‏]\n\n\nفهو ردم ملآن بضعفه وفقره مع شهوده أصله علما وحالا وكشفا وعلمه بأصله ومقام خلافته من وجه آخر لو كان حالا له لأدعى الألوهة فإن الأمر الخارج في النفخ من النافخ له من حكمه بقدر ذلك فلو ادعاه ما ادعى محالا وبذلك القدر الذي فيه من القوة الإلهية التي أظهرها النفخ توجه عليه التكليف فإنه عين المكلف وأضيفت الأفعال إليه وقيل له قل وإِيَّاكَ نَسْتَعِينُ ولا حول ولا قوة إلا بالله فإنه أصلك الذي إليه ترجع فصدقت المعتزلة في إضافة الأفعال إلى العباد من وجه بدليل شرعي وصدق المخالف في إضافة الأفعال كلها إلى الله تعالى من وجه بدليل شرعي أيضا وعقلي وقالت بالكسب في أفعال العباد للعباد بقوله تعالى لَها ما كَسَبَتْ وقال في المصورين على لسان رسوله صلى الله عليه وسلم أين من ذهب يخلق كخلقي‏\n\n\nفأضاف الخلق إلى العباد وقال في عيسى عليه السلام وإِذْ تَخْلُقُ من الطِّينِ فنسب الخلق إليه عليه السلام وهو إيجاده صورة الطائر في الطين ثم أمره أن ينفخ فيه فقامت تلك الصورة التي صورها عيسى عليه السلام طائرا حيا وقوله بِإِذْنِ الله يعني الأمر الذي أمره الله به من خلقه صورة الطائر والنفخ وإبراء الأكمه والأبرص وإحيائه الميت فأخبر أن عيسى عليه السلام لم ينبعث إلى ذلك من نفسه وإنما كان عن أمر الله ليكون ذلك وإحياء الموتى من آياته على ما يدعيه فلو لا أن الإنسان من حيث حقيقته من ذلك النفس الرحماني ما صح ولا ثبت أن يكون عن نفخه طائر يطير بجناحيه‏\n\n\n### [الإنسان ابن أمه حقيقة والروح ابن طبيعة بدنه‏]\n\n\nولما كانت حقيقة الإنسان هكذا خوفه الله بما ذكر من صفة المتكبرين ومالهم واسوداد وجوههم كل ذلك دواء للأرواح لتقف مع ضعف مزاجها الأقرب في ظهور عينها فالإنسان ابن أمه حقيقة بلا شك فالروح ابن طبيعة بدنه وهي أمه التي أرضعته ونشأ في بطنها وتغذى بدمها فحكمه حكمها فلا يستغني عن غذاء في بقاء هيكله‏\n\n\n### [المكاشف الذي يهرب إلى عالم الشهادة]\n\n\nفلما كان الغالب هذا على الإنسان رجعنا إلى المكاشف الذي يهرب إلى عالم الشهادة عند ما يرى ما يهوله في كشفه مثل صاحبنا أحمد العصاد الحريري رحمه الله فإنه كان إذا أخذ سريع الرجوع إلى حسه باهتزاز واضطراب فكنت أعتبه وأقول له في ذلك فيقول أخاف وأجبن من عدم عيني لما أراه ولو علم المسكين أنه لو فارق المواد رجع النفس إلى مستقره وهو عينه ورجع كل شي‏ء إلى أصله ولكن لو كان ذلك لانعدمت الفائدة في حق العبد فيما يظهر وليس الأمر كذلك ولذلك قلنا وهو عينه أي عين العبد فالبقاء الذي أراده الحق أولى به بوجود هذا الهيكل العنصري في الدنيا الطبيعي في الآخرة والذي يثبت هنالك أعني عند الوارد إنما يثبت إذا دخل عبدا كما إن الذي لا يثبت إنما دخل وفي نفسه شي‏ء من الربوبية فخاف من زوالها هناك فهرب إلى الوجود الذي ظهرت فيه ربانيته ولهذا تكون فائدته قليلة والثابت يدخل عبدا قابلا بهمة محترقة إلى أصله ليهبه من عوارفه ما عوده فإذا خرج خرج نورا يستضاء به‏\n\n\n### [مثل الداخل إلى الحق بربوبيته ومثل الداخل إليه بعبوديته‏]\n\n\nفمثل الداخل إلى ذلك الجناب العالي بربوبيته مثل من يدخل بسراج موقود ومثل الذي يدخل بعبوديته مثل من يدخل بفتيلة لا ضوء فيها أو بقبضة حشيش فيها نار غير مشتعلة فإذا دخلا بهذه المثابة هب عليهما نفس من الرحمن فطفئ لذلك الهبوب السراج واشتعل الحشيش فخرج صاحب السراج في ظلمة وخرج صاحب الحشيش في نور يستضاء به فانظر ما أعطاه الاستعداد فكل هارب من هناك إنما يخاف على سراجه أن ينطفئ فهو يخاف على ربوبيته أن تزول فيفر إلى محل ظهورها ولكن ما يخرج إلا وقد طفئ سراجه ولو خرج به موقدا كما دخل ولم يؤثر فيه ذلك الهبوب لأدعى الربوبية حقا ولكن من عصمة الله له كان ذلك ومن دخل عبدا لا يخاف وإذا اشتعلت فتيلته هنالك عرف من أشعلها ورأى المنة له سبحانه في ذلك فخرج عبدا منورا كما قال تعالى سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ يعني عبدا فكان في خروجه إلى أمته داعِياً إِلَى الله بِإِذْنِهِ وسِراجاً مُنِيراً كما دخل عبدا ذليلا عارفا بما دخل وعلى من دخل فمن وفقه الله تعالى ولزم عبوديته في جميع أحواله وإن عرف أصليه فيرجح‏\nالأصل الأقرب إليه جانب أمه فإنه ابن أمه بلا شك أ لا ترى إلى السنة في تلقين الميت عند حصوله في قبره يقال له يا عبد الله ويا ابن أمة الله فينسب إلى أمه سترا من الله عليها فأضيف إلى أمه لأنها أحق به لظهور نشأته ووجود عينه فهو لأبيه ابن فراش وهو ابن لأمه حقيقة فافهم ما أعطيناك من المعرفة بك في هذا الباب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Fifty-Two: Concerning the Knowledge of the Reason Why the Knower by Unveiling Flees to the World of Witnessing When He Perceives It\n\nWhoever fears for his physical frame (هيكله),\nWill not see The Real (الحق) openly and clearly.\nYou see him, when he witnesses It,\nReturning to the cosmos, seeking the body.\nAnd you see the brave ones seeking\nThat which the faint-hearted fear.\n\n### [Human Souls are Innately Disposed, in their Origin, to Anxiety]\n\nKnow—may Allah support you with a Spirit from Him—that Allah has disposed human souls (النفوس الإنسانية) to anxiety (الجزع) in the origin of their creation. Courage and daring are therefore accidental qualities (أمر عرضي) for them. Anxiety is stronger in humans than in animals, except for the *ṣarṣar*; the Arabs say, \"More cowardly than a *ṣarṣar*.\" The cause of its strength in humans is the intellect (العقل) and thought (الفكر) with which Allah distinguished humanity over the rest of the animal kingdom. Nothing emboldens a human except the imaginative power (القوة الوهمية), just as this same power also increases cowardice and anxiety in specific situations, for imagination (الوهم) is a powerful sovereign. The reason for this is that the subtle human essence (اللطيفة الإنسانية) is generated between the Divine Spirit (الروح الإلهي), which is the Breath of the All-Merciful (النفس الرحماني), and the balanced, proportioned body (الجسم المسوي المعدل) composed of the balanced elements (الأركان المعدلة) of Nature (الطبيعة), which Allah made subjugated beneath the Universal Soul (النفس الكلية), just as He made the elements subjugated beneath the rule of the sovereign of the celestial spheres (الأفلاك).\n\n### [The Animal Body is in the Fifth Degree of Subjugation]\n\nFurthermore, the animal body (الجسم الحيواني) is subjugated beneath the sovereignty of the elements (الأركان), which are the components. Thus, it is subjugated to the subjugated (the elements), which is from the subjugated (Nature), which is from the subjugated (the Universal Soul), which is from the subjugated (the Intellect). Therefore, from one perspective, it is in the fifth degree of subjugation (القهر); it is the weakest of the weak. Allah, the Mighty and Majestic, said: <<الله الذي خلقكم من ضعف>> (Allah is the One Who created you from weakness). Weakness is its origin. Then He granted it an accidental strength, which is His saying: <<ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً>> (Then He appointed strength after weakness). Then He returned it to its origin of weakness, saying, the Mighty and Majestic: <<ثُمَّ جَعَلَ من بَعْدِ قُوَّةٍ ضَعْفاً وشَيْبَةً>> (Then He appointed weakness and gray hair after strength). This final weakness is prepared only for the establishment of the Hereafter's existence (النشأة الآخرة) upon it, just as the existence of the world (نشأة الدنيا) was established upon weakness. <<ولقد علمتم النشأة الأولى>> (And certainly you have known the first creation).\n\n### [Anxiety in Man is Proof of His Need for Allah]\n\nThis was only so that abasement (الذلة), need (الافتقار), the seeking of aid (المعونة), and dependence upon his Creator would adhere to his essence (ذاته). Yet, despite all this, he forgets his origin and becomes arrogant due to the accidental strength granted to him, claiming and saying, \"I am,\" and promising himself that he can face tremendous terrors. But if a flea bites him, he displays anxiety (الجزع) due to the pain and rushes to remove that harm, finding no rest until he finds and kills it. What is a flea that he should pay it such attention, shaking him from his bed and preventing him from sleeping? Where then is that claim and that daring to face tremendous terrors, when a bite from a flea or a mosquito has exposed him? This is his origin, so that he may know that his daring to face tremendous terrors is only by means of another, not by himself, and that is the support (التأييد) Allah grants him in that regard, as He said: <<وأَيَّدْناهُ>> (And We supported him)—meaning, We strengthened him. For this reason, the prayer <<وإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help) was legislated in every *rak'ah*, and [the saying] \"There is no power nor strength except with Allah.\"\n\n### [Existence is Delight and Sweetness, and Non-Existence is Pain and Terror]\n\nSince man knows that were it not for the Generosity (جود) of Allah, the Mighty and Majestic, no entity (عين) would have appeared for him in Existence (الوجود), and that his origin was not a thing mentioned, Allah the Exalted said: <<وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً>> (And I had created you before, when you were nothing). Thus, Existence (الوجود) holds delight and sweetness, and it is the Good (الخير). And the mere imagination of essential non-existence (العدم العيني) causes a severe and tremendous pain in the souls (النفوس), the measure of which is known only to the Gnostics (العلماء). However, every soul panics (تجزع) at the prospect of non-existence overtaking it, which is its natural state. Therefore, whenever it sees something that it imagines will cause the non-existence of its entity (عينها) or something close to it, it flees from it, is terrified, and fears for its entity. This is also because it originated from the Divine Spirit (الروح الإلهي), which is the Breath of the All-Merciful (نفس الرحمن). For this reason, it was alluded to by the term 'breathing' (النفخ) due to the affinity with the breath (النفس), so He said: <<ونفخت فيه من روحي>> (And I breathed into him of My Spirit). Similarly, Jesus was made to breathe into a clay form resembling a bird.\n\n### [The Spirits: Their Appearance, Their Loci, Their Health, Their Illness]\n\nThe spirits (الأرواح) only appeared from the breaths (الأنفاس), yet the locus (المحل) through which the breath passes undoubtedly has an effect upon them. Do you not see that if the wind passes over something foul, a foul odor reaches your sense of smell, and if it passes over something fragrant, a pleasant scent arrives? For this reason, the spirits of people differ: a pure spirit belongs to a pure body, one that never associated partners [with God] and was never a locus for base morals (سفساف الأخلاق), such as the spirits of the Prophets, the Saints (الأولياء), and the Angels. And a wicked spirit belongs to a wicked body, one that has always associated partners [with God] and been a locus for base morals. This difference arises only from the dominance of certain temperaments—meaning, the humors (الأخلاط)—over others in the original formation of the body, which is the cause of the spirit's purity, the existence of noble morals (مكارم الأخلاق) or base morals, and the spirit's wickedness. The health and well-being of the spirits lie in the noble morals they acquired from the formation of their elemental body (بدنها العنصري), resulting in everything good and beautiful. The illness of the spirits lies in the base and blameworthy morals they also acquired from the formation of their elemental body, resulting in everything wicked and ugly. Do you not see that when the sun pours its light upon a piece of green glass, the light appears green on the wall or the object upon which the ray is cast? And if the glass is red, the ray appears red to the eye. Thus, the light is colored in the eye of the beholder by the color of the locus (المحل). This is due to the spirit's subtlety (لطافته), which accepts things quickly. Since air is one of the strongest things, and the spirit is a breath (نفسا) and resembles air, the strength belonged to it. Thus, the origin of the spirits' formation was from this strength, and they acquired weakness from the natural bodily temperament (المزاج الطبيعي البدني). For no entity (عين) appeared for the spirit except after the natural temperament had an effect upon it. Thus, it emerged weak because it is closer to the body in the appearance of its entity. If it accepts strength, it accepts it only from its origin, which is the Breath of the All-Merciful (النفس الرحماني), expressed as the Spirit (الروح) breathed from Him and attributed to Allah. Thus, it is capable of accepting strength just as it is capable of accepting weakness, and both are by the decree of the origin. Yet, it is closer to the body because it is more recently associated with it, so its weakness overcomes its strength. If it were stripped of matter (المادة), its original strength derived from the Divine Breathing (النفخ الإلهي) would appear, and nothing would be more arrogant than it. Therefore, Allah bound it perpetually to the natural form (الصورة الطبيعية) in this world, in the Isthmus (البرزخ) during sleep and after death. Thus, it never sees itself stripped of matter. In the Hereafter, it will remain in its bodies; Allah will resurrect it from the forms of the Isthmus into the bodies He created for it on the Day of Resurrection, and by means of these bodies, it will enter Paradise and the Fire. This is so that natural weakness (الضعف الطبيعي) may adhere to it, and it may remain perpetually poor (فقيرة). Do you not see how, in moments of heedlessness concerning itself, it displays audacity (التهجم) and daring toward the Divine Station (المقام الإلهي), claiming Lordship (الربوبية) like Pharaoh, and saying, when that spiritual state (الحال) overcomes it, \"I am Allah\" and \"Glory be to me,\" as some Gnostics (العارفين) have said? This is due to the overwhelming nature of the state upon him. For this reason, such a phrase was never uttered by a Messenger, a Prophet, or a Saint (ولي) who was complete in his knowledge, his presence, his adherence to the station (المقام) due to him, his proper conduct (أدبه), and his consideration of the matter (المادة) in which he exists and by which he appeared.\n\n### [The Acts of the Servants and Their Attribution to Allah and to Themselves]\n\nThus, he is a dam filled with his weakness and poverty, despite his witnessing (شهوده) his origin through knowledge (علما), spiritual state (حالا), and unveiling (كشفا). His knowledge of his origin and his station of vicegerency (مقام خلافته) is, from another perspective, such that if it were a permanent state (حالا له), he would claim Divinity (الألوهة). For the matter that emerged in the breathing (النفخ) from the Breather (النافخ) has a ruling corresponding to that measure. If he were to claim it, he would not be claiming an impossibility. It is by that measure of Divine Power (القوة الإلهية) manifested by the breathing that the religious obligation (التكليف) is directed toward him, for he is the very entity (عين) of the obligated one. The acts (الأفعال) are attributed to him, and he is told to say: <<وإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help) and \"There is no power nor strength except with Allah,\" for that is your origin to which you return. Thus, the Mu'tazila were correct in attributing acts to the servants (العباد) from one perspective, based on legal evidence. And the opponent was correct in attributing all acts to Allah the Exalted from another perspective, based on legal and rational evidence. [The Mu'tazila] affirmed acquisition (الكسب) in the acts of the servants for the servants, based on His saying, the Exalted: <<لَها ما كَسَبَتْ>> (For it is what it has earned). And concerning the image-makers, He said, through the tongue of His Messenger, peace and blessings be upon him: \"Where are those who went about creating like My creation?\" Thus, He attributed creation (الخلق) to the servants. And concerning Jesus, peace be upon him, He said: <<وإِذْ تَخْلُقُ من الطِّينِ>> (When you created from clay). Thus, He attributed creation to him, peace be upon him, which was his bringing into existence the form of the bird in the clay, and then He commanded him to breathe into it, whereupon that form which Jesus had shaped stood up as a living bird. His saying <<بِإِذْنِ الله>> (by the permission of Allah) means the command with which Allah commanded him concerning the creation of the bird's form, the breathing, the healing of the blind and the leper, and the raising of the dead. Thus, He informed us that Jesus, peace be upon him, did not undertake this from his own self, but rather by the command of Allah, so that this and the raising of the dead might be among his signs (آياته) supporting his claim. Were it not that man, in terms of his reality (حقيقته), originates from that Breath of the All-Merciful (النفس الرحماني), it would not be sound or established that a bird flying with its wings could result from his breathing.\n\n### [Man is Truly the Son of His Mother, and the Spirit is the Son of His Body's Nature]\n\nSince the reality of man is thus, Allah instilled fear in him by mentioning the description of the arrogant and their fate and the blackening of their faces. All of this is a remedy for the spirits (الأرواح) so that they may remain mindful of the weakness of their temperament (مزاجها), which is closer to the appearance of their entity (عينها). Man is truly the son of his mother, without a doubt. Thus, the spirit is the son of the nature of its body (طبيعة بدنه), which is the mother that nursed it, in whose womb it grew, and by whose blood it was nourished. Its ruling is the ruling of the body, and thus it cannot dispense with nourishment for the subsistence (بقاء) of its physical frame (هيكله).\n\n### [The Knower by Unveiling Who Flees to the World of Witnessing]\n\nSince this state is dominant in man, we return to the Knower by Unveiling (المكاشف) who flees to the World of Witnessing (عالم الشهادة) when he sees what terrifies him in his unveiling (كشفه), such as our companion Ahmad al-Assad al-Hariri, may Allah have mercy on him. When he was seized [by a state], he would quickly return to his senses with trembling and agitation. I used to reproach him and speak to him about this, and he would say, \"I fear and panic at the non-existence of my entity (عدم عيني) due to what I see.\" If only the poor man knew that if he were to separate from the materials (المواد), the soul (النفس) would return to its resting place, which is its entity (عينه), and everything would return to its origin. However, if that were the case, the benefit for the servant (العبد) in what appears would cease to exist, and the matter is not so. For this reason, we said, \"which is its entity,\" meaning the entity of the servant. The Subsistence (البقاء) that The Real (الحق) desired is more appropriate for him through the existence of this elemental physical frame (الهيكل العنصري) in this world, and the natural one in the Hereafter. The one who remains firm there—meaning, during the spiritual influx (الوارد)—only remains firm if he enters as a servant (عبدا). Likewise, the one who does not remain firm only entered while having something of Lordship (الربوبية) within himself, so he feared its removal there and fled to the Existence (الوجود) where his Lordship appeared. For this reason, his benefit is small. The firm one enters as an accepting servant, with an ardent aspiration (همة محترقة) toward his origin, so that [The Real] may bestow upon him the gifts (عوارفه) to which He accustomed him. When he emerges, he emerges as a light by which others are illuminated.\n\n### [The Example of One Who Enters The Real with His Lordship and the Example of One Who Enters Him with His Servitude]\n\nThe example of one who enters that High Presence (الجناب العالي) with his Lordship (ربوبيته) is like one who enters with a lit lamp. And the example of one who enters with his servitude (عبوديته) is like one who enters with a wick that has no light, or with a handful of dry grass containing fire that is not yet kindled. When they enter in this state, a Breath (نفس) from the All-Merciful blows upon them. Due to that blowing, the lamp is extinguished, but the dry grass ignites. The owner of the lamp emerges in darkness, while the owner of the dry grass emerges in a light by which others are illuminated. Look at what preparedness (الاستعداد) granted him! Every one who flees from there only fears that his lamp will be extinguished; he fears that his Lordship will vanish, so he flees to the place of its manifestation. However, he does not emerge except that his lamp has been extinguished. If he had emerged with it lit, just as he entered, and that blowing had not affected him, he would have truly claimed Lordship. But this [extinguishing] was part of Allah's protection (عصمة) for him. As for the one who enters as a servant, he does not fear. When his wick ignites there, he knows Who ignited it and sees the favor (المنة) belonging to Him, the Glorified, in that. Thus, he emerges as an illuminated servant, as the Exalted said: <<سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ>> (Glory be to the One Who carried His servant by night)—meaning, as a servant. Thus, in his emergence to his community, he was <<داعِياً إِلَى الله بِإِذْنِهِ وسِراجاً مُنِيراً>> (one who invites to Allah by His permission, and a luminous lamp). He entered as a humble servant, knowing what he entered and upon Whom he entered. Therefore, whoever Allah grants success and adheres to his servitude (عبوديته) in all his states, even if he knows his two origins, he prioritizes the origin closer to him: the side of his mother. For he is the son of his mother, without a doubt. Do you not see the Sunnah regarding the instruction given to the deceased when he is placed in his grave? He is told, \"O servant of Allah, and O son of the female servant of Allah (ابن أمة الله).\" He is attributed to his mother as a covering (سترا) from Allah upon her. He is attributed to his mother because she has a greater right to him due to the manifestation of his existence (نشأته) and the appearance of his entity (وجود عينه). He is the son of his father by the bed, but he is truly the son of his mother. Understand the gnosis (المعرفة) we have granted you concerning yourself in this chapter. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## (باب نمبر ۵۲: اس سبب کی معرفت میں جس کی وجہ سے مکاشف جب عالمِ شہادت کو دیکھتا ہے تو اس سے بھاگ کر عالمِ شہادت کی طرف لوٹ آتا ہے)\n\n> ہر وہ شخص جو اپنے جسم (ہیکل) سے خوف کھاتا ہے،\n> وہ حق (الحق) کو کھلے عام ظاہر نہیں دیکھتا۔\n\n> پس جب وہ اس کا (حق کا) مشاہدہ کرتا ہے،\n> تو اسے دیکھتا ہے کہ وہ کون (عالمِ خلق) کی طرف لوٹ رہا ہے، بدن کی طلب میں۔\n\n> اور تم بہادروں کو دیکھتے ہو کہ وہ اس چیز کی طلب میں آگے بڑھتے ہیں،\n> جس سے بزدل ڈرتا ہے۔\n\n### [انسانی نفوس اپنی اصل نشوونما میں بے چینی پر جبلت کیے گئے ہیں]\n\nجان لو، اللہ تمہیں اپنی روح سے تائید بخشے، کہ اللہ تعالیٰ نے انسانی نفوس کو ان کی اصل نشوونما میں بے چینی (الجزع) پر جبلت کیا ہے۔ پس شجاعت اور اقدام ان کے لیے ایک عارضی امر ہے، اور انسان میں بے چینی حیوانات کے مقابلے میں زیادہ قوی ہے، سوائے صرصر (ایک قسم کا پرندہ) کے۔ عرب کہتے ہیں: \"صرصر سے زیادہ بزدل۔\" اور انسان میں اس کی قوت کا سبب عقل اور فکر ہے، جن کے ذریعے اللہ نے اسے باقی تمام حیوانات پر ممتاز کیا ہے۔ اور انسان کو صرف قوتِ وہمیہ ہی بہادر بناتی ہے، جیسا کہ اسی قوت کے ذریعے وہ مخصوص مقامات پر بزدلی اور بے چینی میں بھی اضافہ کرتا ہے۔ کیونکہ وہم ایک قوی سلطان ہے۔\n\nاور اس کا سبب یہ ہے کہ لطیفۂ انسانیہ، روحِ الٰہی (الروح الإلهي) جو کہ نفسِ رحمانی (النفس الرحماني) ہے، اور جسمِ مسویٰ (معتدل جسم) جو ارکانِ معتدلہ سے بنا ہے، کے درمیان پیدا ہوا ہے۔ یہ ارکان اس طبیعت سے معتدل ہوئے ہیں جسے اللہ نے نفسِ کلیہ (النفس الکلیۃ) کے تحت مقہور کر دیا ہے، جیسا کہ اس نے ارکان کو افلاک کے سلطان کے حکم کے تحت مقہور کیا ہے۔\n\n### [حیوانی جسم قہر کے پانچویں درجے میں ہے]\n\nپھر حیوانی جسم ان ارکان (عناصر) کے سلطان کے تحت مقہور ہے، لہٰذا وہ ایک مقہور کے تحت مقہور ہے، جو کہ نفس ہے، جو ایک مقہور کے تحت مقہور ہے، جو کہ عقل ہے۔ پس وہ ایک لحاظ سے قہر کے پانچویں درجے میں ہے، لہٰذا وہ کمزوروں میں سب سے زیادہ کمزور ہے۔ اللہ عزوجل نے فرمایا: **\"اللہ ہی ہے جس نے تمہیں کمزوری سے پیدا کیا\"** (اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ)۔ پس کمزوری اس کی اصل ہے، پھر اس کے لیے ایک عارضی قوت پیدا کی، اور یہ اس کا قول ہے: **\"پھر کمزوری کے بعد قوت پیدا کی\"** (ثُمَّ جَعَلَ مِنْ بَعْدِ ضَعْفٍ قُوَّةً)۔ پھر اسے اس کی اصل کمزوری کی طرف لوٹا دیا، پس عزوجل نے فرمایا: **\"پھر قوت کے بعد کمزوری اور بڑھاپا پیدا کیا\"** (ثُمَّ جَعَلَ مِنْ بَعْدِ قُوَّةٍ ضَعْفاً وَشَيْبَةً)۔ یہ آخری کمزوری اس لیے تیار کی گئی ہے تاکہ اس پر آخرت کی نشوونما قائم ہو، جیسا کہ دنیا کی نشوونما کمزوری پر قائم ہوئی، اور تم پہلی نشوونما کو جان چکے ہو۔\n\n### [انسان میں بے چینی اس کے اللہ کی طرف محتاج ہونے کی دلیل ہے]\n\nاور یہ اس لیے تھا تاکہ اس کی ذات کے ساتھ ذلت، محتاجی (الافتقار)، اور اپنے خالق سے مدد اور حاجت کی طلب لازم رہے۔ اس سب کے باوجود، وہ اپنی اصل سے غافل ہو جاتا ہے اور اس قوت پر فخر کرتا ہے جو اسے عارضی طور پر ملی ہے، پس وہ دعویٰ کرتا ہے اور کہتا ہے: \"میں\" اور خود کو بڑے بڑے خوفناک حالات کا مقابلہ کرنے کی امید دلاتا ہے۔ لیکن جب ایک مچھر اسے کاٹتا ہے تو وہ درد کی وجہ سے بے چینی ظاہر کرتا ہے اور اس نقصان کو دور کرنے کے لیے جلدی کرتا ہے، اور اسے اس وقت تک قرار نہیں آتا جب تک کہ وہ اسے ڈھونڈ کر مار نہ ڈالے۔ مچھر کی کیا حیثیت ہے کہ اس کی اتنی دیکھ بھال کی جائے اور اسے اس کے بستر سے ہلا دے اور اسے نیند نہ آئے؟ وہ بڑے بڑے خوفناک حالات پر اقدام کرنے کا دعویٰ کہاں گیا، جبکہ ایک مچھر یا پشہ کے کاٹنے نے اسے رسوا کر دیا؟\n\nیہ اس کی اصل ہے تاکہ وہ جان لے کہ بڑے بڑے خوفناک حالات پر اس کا اقدام اس کے غیر (اللہ کی مدد) سے ہے نہ کہ اس کی اپنی ذات سے، اور یہ وہ چیز ہے جس سے اللہ اس کی تائید کرتا ہے، جیسا کہ فرمایا: **\"اور ہم نے اس کی تائید کی\"** (وَأَيَّدْنَاهُ) یعنی ہم نے اسے قوت دی۔ اسی لیے ہر رکعت میں **\"اور ہم تجھ ہی سے مدد مانگتے ہیں\"** (وَإِيَّاكَ نَسْتَعِينُ) اور \"لا حول ولا قوة إلا بالله\" (اللہ کی مدد کے بغیر نہ کوئی طاقت ہے اور نہ کوئی قوت) مشروع کیا گیا۔\n\n### [الوجود (ہستی) لذت اور مٹھاس ہے، اور العدم (نیستی) درد اور گھبراہٹ ہے]\n\nاور جب انسان نے جان لیا کہ اگر اللہ عزوجل کا جود (سخاوت) نہ ہوتا تو وجود (الوجود) میں اس کی کوئی آنکھ (عین) ظاہر نہ ہوتی، اور یہ کہ اس کی اصل کوئی قابل ذکر چیز نہ تھی، اللہ تعالیٰ نے فرمایا: **\"حالانکہ میں نے تجھے اس سے پہلے پیدا کیا تھا اور تو کوئی چیز نہ تھا\"** (وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئاً)۔ پس وجود (الوجود) میں لذت اور مٹھاس ہے، اور یہی خیر ہے۔ اور عینی نیستی (العدم العيني) کے وہم میں نفوس میں ایک شدید اور عظیم درد ہے، جس کی قدر صرف علماء ہی جانتے ہیں۔ لیکن ہر نفس نیستی سے ڈرتا ہے کہ وہ اس سے جا ملے، جیسا کہ اس کا حال ہے۔ پس جب بھی وہ کوئی ایسا امر دیکھتا ہے جس میں وہ یہ وہم کرتا ہے کہ وہ اس کی آنکھ کی نیستی یا اس کے قریب کی کسی چیز سے جا ملے گا، تو وہ اس سے بھاگتا ہے، گھبراتا ہے اور اپنی آنکھ پر خوف کھاتا ہے۔\n\nاور یہ اس لیے بھی ہے کہ وہ روحِ الٰہی (الروح الإلهي) سے تھا جو کہ نفسِ رحمان ہے، اور اسی لیے اس سے نفخ (پھونکنے) کے ذریعے کنایہ کیا گیا، نفس کی مناسبت کی وجہ سے، پس فرمایا: **\"اور میں نے اس میں اپنی روح میں سے پھونکا\"** (وَنَفَخْتُ فِيهِ مِنْ رُوحِي)۔ اور اسی طرح عیسیٰ علیہ السلام کو مٹی کی صورت میں پرندے کی شکل میں پھونکنے سے بنایا گیا۔\n\n### [ارواح: ان کا ظہور، ان کے محل، ان کی صحت، ان کی بیماری]\n\nارواح صرف سانسوں (الأنفاس) سے ہی ظاہر ہوئیں، مگر جس محل سے وہ گزرتی ہیں، اس کا ان پر اثر ہوتا ہے، اس میں کوئی شک نہیں۔ کیا تم نہیں دیکھتے کہ جب ہوا کسی بدبودار چیز پر سے گزرتی ہے تو تمہاری سونگھنے کی جگہ پر بدبودار ہوا آتی ہے، اور جب کسی خوشبودار چیز پر سے گزرتی ہے تو خوشبودار ہوا آتی ہے؟ اسی لیے لوگوں کی ارواح مختلف ہو گئیں:\n\nایک پاکیزہ روح پاکیزہ جسم کے لیے، جس نے کبھی شرک نہیں کیا اور نہ ہی وہ رذیل اخلاق کا محل بنی، جیسے انبیاء، اولیاء اور فرشتوں کی ارواح۔ اور ایک خبیث روح خبیث جسم کے لیے، جو ہمیشہ مشرک رہی اور رذیل اخلاق کا محل بنی۔\n\nاور یہ سب کچھ جسم کی اصل نشوونما میں بعض طبائع (یعنی اخلاط) کے بعض پر غالب آنے کی وجہ سے ہوا، جو روح کی پاکیزگی، اور مکارمِ اخلاق اور رذیل اخلاق کے وجود، اور روح کی خباثت کا سبب ہے۔\n\nپس ارواح کی صحت اور عافیت ان کے مکارمِ اخلاق ہیں جو انہوں نے اپنے عنصری بدن کی نشوونما سے حاصل کیے، پس وہ ہر پاکیزہ اور خوبصورت چیز لے کر آئیں۔ اور ارواح کی بیماری رذیل اخلاق اور مذموم صفات ہیں جو انہوں نے اپنے عنصری بدن کی نشوونما سے حاصل کیے، پس وہ ہر خبیث اور قبیح چیز لے کر آئیں۔\n\nکیا تم نہیں دیکھتے کہ جب سورج اپنا نور سبز شیشے کے جسم پر ڈالتا ہے، تو نور دیوار پر یا اس جسم پر جس پر شعاع پڑتی ہے، سبز دکھائی دیتا ہے؟ اور اگر شیشہ سرخ ہو تو شعاع آنکھ کو سرخ دکھائی دیتی ہے۔ پس دیکھنے والے میں محل کے رنگ سے رنگین ہو جاتا ہے۔ اور یہ اس کی لطافت کی وجہ سے ہے کہ وہ چیزوں کو تیزی سے قبول کرتا ہے۔\n\nاور چونکہ ہوا سب سے زیادہ قوی چیزوں میں سے ہے، اور روح نفس ہے اور ہوا سے مشابہ ہے، اس لیے قوت اسی کے لیے تھی۔ پس ارواح کی اصل نشوونما اسی قوت سے ہوئی، اور انہوں نے جسمانی طبعی مزاج سے کمزوری حاصل کی، کیونکہ ان کی آنکھ (عین) طبعی مزاج کے اثر کے بعد ہی ظاہر ہوئی، پس وہ کمزور نکلیں کیونکہ وہ اپنی آنکھ کے ظہور میں جسم کے زیادہ قریب ہیں۔\n\nپس جب وہ قوت قبول کرتی ہیں، تو وہ اسے اپنی اصل سے قبول کرتی ہیں جو کہ نفسِ رحمانی (النفس الرحماني) ہے، جسے روحِ منفوخ (پھونکی گئی روح) سے تعبیر کیا گیا ہے جو اللہ کی طرف منسوب ہے۔ پس وہ قوت کو قبول کرنے والی ہے، جیسا کہ وہ کمزوری کو قبول کرنے والی ہے۔ اور دونوں اصل کے حکم سے ہیں۔ اور وہ بدن کے زیادہ قریب ہے کیونکہ وہ اس سے زیادہ نئی ہے۔ پس اس کی کمزوری اس کی قوت پر غالب آ گئی۔\n\nاگر وہ مادے سے مجرد ہو جاتی، تو اس کی اصل قوت ظاہر ہو جاتی جو اسے نفخِ الٰہی (النفخ الإلهي) سے ملی ہے، اور کوئی چیز اس سے زیادہ متکبر نہ ہوتی۔ پس اللہ نے اسے دنیا میں اور برزخ میں، نیند میں اور موت کے بعد ہمیشہ طبعی صورت (الصورة الطبيعية) کے ساتھ لازم کر دیا۔ پس وہ خود کو کبھی بھی مادے سے مجرد نہیں دیکھتی۔ اور آخرت میں وہ ہمیشہ اپنے اجسام میں رہے گی، اللہ اسے برزخ کی صورتوں سے ان اجسام میں اٹھائے گا جو اس نے اس کے لیے قیامت کے دن بنائے ہیں۔ اور انہی کے ذریعے وہ جنت اور دوزخ میں داخل ہو گی۔ یہ اس لیے ہے تاکہ طبعی کمزوری اسے لازم رہے، پس وہ ہمیشہ فقیر رہے۔\n\nکیا تم نہیں دیکھتے کہ جب وہ اپنی ذات سے غافل ہوتی ہے تو اس کی طرف سے الٰہی مقام پر کیسی جسارت اور اقدام ہوتا ہے؟ پس وہ فرعون کی طرح ربوبیت کا دعویٰ کرتی ہے اور اس حال کے غالب آنے پر کہتی ہے: \"میں اللہ ہوں\" اور \"سبحانی\" (میں پاک ہوں)، جیسا کہ بعض عارفین نے کہا۔ اور یہ اس حال کے ان پر غالب آنے کی وجہ سے تھا۔ اسی لیے رسول، نبی، یا اپنے علم اور حضور میں کامل ولی، اور اپنے مقام کے دروازے کو لازم پکڑنے والے، اور اپنے ادب، اور اس مادے کی رعایت کرنے والے جس میں وہ ہے اور جس کے ذریعے وہ ظاہر ہوا، سے ایسا لفظ صادر نہیں ہوا۔\n\n### [بندوں کے افعال اور ان کی نسبت اللہ کی طرف اور ان کی طرف]\n\nپس وہ اپنی کمزوری اور فقر سے بھرا ہوا ایک بند ہے، باوجود اس کے کہ وہ اپنی اصل کا علم، حال، اور کشف (الکشف) کے ذریعے مشاہدہ کرتا ہے۔ اور اس کا اپنی اصل اور خلافت کے مقام کا علم ایک دوسرے پہلو سے، اگر وہ اس کے لیے حال ہوتا، تو وہ الوہیت کا دعویٰ کرتا۔ کیونکہ نفخ کرنے والے سے باہر نکلنے والا امر اس کے حکم سے اس قدر کے مطابق ہوتا ہے۔ پس اگر وہ اس کا دعویٰ کرتا تو وہ محال کا دعویٰ نہ کرتا۔\n\nاور اسی قدر الٰہی قوت کی وجہ سے جو نفخ نے ظاہر کی، اس پر تکلیف (شرعی ذمہ داری) عائد ہوئی، کیونکہ وہ مکلف کی آنکھ (عین) ہے۔ اور افعال کی نسبت اس کی طرف کی گئی اور اسے کہا گیا کہ **\"اور ہم تجھ ہی سے مدد مانگتے ہیں\"** (وَإِيَّاكَ نَسْتَعِينُ) اور \"لا حول ولا قوة إلا بالله\" کہہ، کیونکہ یہ تیری اصل ہے جس کی طرف تو لوٹتا ہے۔\n\nپس معتزلہ نے شرعی دلیل کی بنا پر افعال کی نسبت بندوں کی طرف کرنے میں ایک پہلو سے سچ کہا، اور مخالف نے بھی شرعی اور عقلی دلیل کی بنا پر تمام افعال کی نسبت اللہ تعالیٰ کی طرف کرنے میں سچ کہا۔ اور اس نے بندوں کے افعال میں کسب (کمانے) کا قول کیا، اللہ تعالیٰ کے اس قول کی بنا پر: **\"اس کے لیے ہے جو اس نے کمایا\"** (لَهَا مَا كَسَبَتْ)۔ اور مصوروں کے بارے میں رسول اللہ صلی اللہ علیہ وسلم کی زبان سے فرمایا: \"وہ کہاں ہیں جو میری تخلیق کی طرح تخلیق کرتے ہیں؟\"\n\nپس اس نے تخلیق کی نسبت بندوں کی طرف کی۔ اور عیسیٰ علیہ السلام کے بارے میں فرمایا: **\"جب تم مٹی سے پرندے کی شکل میں تخلیق کرتے تھے\"** (وَإِذْ تَخْلُقُ مِنَ الطِّينِ)۔ پس تخلیق کی نسبت ان کی طرف کی گئی، اور وہ مٹی میں پرندے کی صورت کو وجود دینا تھا۔ پھر اسے حکم دیا کہ اس میں پھونکے، پس وہ صورت جو عیسیٰ علیہ السلام نے بنائی تھی، ایک زندہ پرندہ بن کر کھڑی ہو گئی۔ اور اس کا قول **\"اللہ کے حکم سے\"** (بِإِذْنِ اللَّهِ) یعنی وہ امر جو اللہ نے اسے پرندے کی صورت بنانے، پھونکنے، پیدائشی اندھے اور کوڑھی کو شفا دینے، اور مردے کو زندہ کرنے کا حکم دیا تھا۔ پس اس نے خبر دی کہ عیسیٰ علیہ السلام اپنی ذات سے اس کی طرف مائل نہیں ہوئے، بلکہ یہ اللہ کے حکم سے تھا تاکہ یہ اور مردوں کو زندہ کرنا ان کی نبوت کی نشانیوں میں سے ہو۔\n\nاگر انسان اپنی حقیقت کے لحاظ سے اس نفسِ رحمانی (النفس الرحماني) سے نہ ہوتا، تو یہ صحیح اور ثابت نہ ہوتا کہ اس کے پھونکنے سے کوئی پرندہ اپنے پروں سے اڑے۔\n\n### [انسان حقیقت میں اپنی ماں کا بیٹا ہے اور روح اپنے بدن کی طبیعت کا بیٹا ہے]\n\nاور چونکہ انسان کی حقیقت ایسی ہی تھی، اللہ نے اسے متکبرین کی صفات اور ان کے انجام، اور ان کے چہروں کے سیاہ ہونے کے ذکر سے ڈرایا۔ یہ سب ارواح کے لیے دوا ہے تاکہ وہ اپنے مزاج کی کمزوری کے ساتھ ٹھہریں جو ان کی آنکھ کے ظہور میں زیادہ قریب ہے۔ پس انسان بلا شک حقیقت میں اپنی ماں کا بیٹا ہے۔ پس روح اپنے بدن کی طبیعت کا بیٹا ہے، اور وہی اس کی ماں ہے جس نے اسے دودھ پلایا اور وہ اس کے پیٹ میں پروان چڑھا اور اس کے خون سے غذا حاصل کی، پس اس کا حکم اس کا حکم ہے۔ پس وہ اپنے جسم (ہیکل) کے باقی رہنے کے لیے غذا سے بے نیاز نہیں ہو سکتا۔\n\n### [وہ مکاشف جو عالمِ شہادت کی طرف بھاگتا ہے]\n\nپس جب انسان پر یہ غالب آیا، تو ہم اس مکاشف کی طرف لوٹتے ہیں جو عالمِ شہادت (عالمِ خلق) کی طرف بھاگتا ہے جب وہ اپنے کشف (الکشف) میں کوئی خوفناک چیز دیکھتا ہے، جیسے ہمارے ساتھی احمد العصاد الحریری رحمۃ اللہ علیہ۔ وہ جب بھی کشف میں داخل ہوتے تو لرزش اور اضطراب کے ساتھ تیزی سے اپنے حواس کی طرف لوٹ آتے تھے۔ میں انہیں اس پر ملامت کرتا اور کہتا، تو وہ کہتے: \"میں اپنی آنکھ کی نیستی سے ڈرتا اور بزدلی محسوس کرتا ہوں جب میں وہ دیکھتا ہوں جو میں دیکھتا ہوں۔\"\n\nاگر اس مسکین کو معلوم ہوتا کہ اگر وہ مواد سے جدا ہو جائے تو نفس اپنے مستقر کی طرف لوٹ جائے گا جو کہ اس کی آنکھ (عین) ہے، اور ہر چیز اپنی اصل کی طرف لوٹ جائے گی، لیکن اگر ایسا ہوتا تو بندے کے حق میں جو کچھ ظاہر ہوتا ہے اس میں کوئی فائدہ نہ ہوتا۔ اور معاملہ ایسا نہیں ہے۔ اسی لیے ہم نے کہا: \"اور وہ اس کی آنکھ (عین) ہے\" یعنی بندے کی آنکھ۔ پس وہ بقا (البقاء) جو حق (الحق) نے ارادہ کیا ہے، اس عنصری جسم کے دنیا میں اور طبعی جسم کے آخرت میں وجود کے ساتھ اس کے لیے زیادہ اولیٰ ہے۔\n\nاور جو وہاں ثابت قدم رہتا ہے، یعنی وارد (تجلی) کے وقت، وہ تب ہی ثابت قدم رہتا ہے جب وہ بندہ بن کر داخل ہو۔ جیسا کہ جو ثابت قدم نہیں رہتا، وہ اس لیے داخل ہوا کہ اس کے نفس میں ربوبیت کا کچھ حصہ تھا، پس اسے وہاں اس کے زوال کا خوف ہوا، تو وہ اس وجود کی طرف بھاگا جہاں اس کی ربانیت ظاہر ہوئی تھی۔ اسی لیے اس کا فائدہ کم ہوتا ہے۔\n\nاور ثابت قدم رہنے والا بندہ بن کر داخل ہوتا ہے، ایک جلتے ہوئے ہمت کے ساتھ اپنی اصل کی طرف قبول کرنے والا، تاکہ وہ اسے اپنی ان نوازشات میں سے عطا کرے جن کا وہ عادی ہے۔ پس جب وہ باہر نکلتا ہے تو ایک نور بن کر نکلتا ہے جس سے روشنی حاصل کی جاتی ہے۔\n\n### [حق میں ربوبیت کے ساتھ داخل ہونے والے کی مثال اور عبودیت کے ساتھ داخل ہونے والے کی مثال]\n\nپس اس عالی جناب میں اپنی ربوبیت کے ساتھ داخل ہونے والے کی مثال اس شخص کی طرح ہے جو ایک جلتے ہوئے چراغ کے ساتھ داخل ہوتا ہے، اور جو اپنی عبودیت کے ساتھ داخل ہوتا ہے اس کی مثال اس شخص کی طرح ہے جو ایک ایسی بتی کے ساتھ داخل ہوتا ہے جس میں روشنی نہیں ہے، یا گھاس کے ایک مٹھی کے ساتھ جس میں آگ ہے مگر بھڑکی ہوئی نہیں۔\n\nپس جب وہ اس حالت میں داخل ہوتے ہیں، تو ان پر نفسِ رحمان (نفس من الرحمن) کی ایک پھونک آتی ہے، پس اس پھونک کی وجہ سے چراغ بجھ جاتا ہے اور گھاس بھڑک اٹھتی ہے۔ پس چراغ والا اندھیرے میں باہر نکلتا ہے، اور گھاس والا ایک نور میں باہر نکلتا ہے جس سے روشنی حاصل کی جاتی ہے۔ پس دیکھو کہ استعداد نے اسے کیا عطا کیا۔\n\nپس وہاں سے بھاگنے والا ہر شخص صرف اپنے چراغ کے بجھ جانے سے ڈرتا ہے۔ پس وہ اپنی ربوبیت کے زائل ہونے سے ڈرتا ہے، تو وہ اس محل کی طرف بھاگتا ہے جہاں اس کا ظہور ہوتا ہے۔ لیکن وہ باہر نہیں نکلتا مگر اس حال میں کہ اس کا چراغ بجھ چکا ہوتا ہے۔ اور اگر وہ جلتا ہوا باہر نکلتا جیسا کہ داخل ہوا تھا اور اس پھونک نے اس پر اثر نہ کیا ہوتا، تو وہ حقاً ربوبیت کا دعویٰ کرتا۔ لیکن یہ اللہ کی طرف سے اس کی عصمت (حفاظت) کی وجہ سے تھا۔\n\nاور جو بندہ بن کر داخل ہوا، وہ نہیں ڈرتا، اور جب اس کی بتی وہاں بھڑک اٹھتی ہے، تو وہ جانتا ہے کہ اسے کس نے بھڑکایا، اور وہ اس میں اللہ سبحانہ و تعالیٰ کی نعمت کو دیکھتا ہے۔ پس وہ ایک منور بندہ بن کر باہر نکلتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: **\"پاک ہے وہ ذات جس نے اپنے بندے کو سیر کرائی\"** (سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ) یعنی بندہ۔ پس وہ اپنی امت کی طرف نکلنے میں **\"اللہ کی طرف اس کے حکم سے بلانے والا اور روشن چراغ\"** (دَاعِياً إِلَى اللَّهِ بِإِذْنِهِ وَسِرَاجاً مُنِيراً) تھا، جیسا کہ وہ ایک ذلیل بندہ بن کر داخل ہوا، یہ جانتے ہوئے کہ وہ کس چیز پر داخل ہوا اور کس پر داخل ہوا۔\n\nپس جسے اللہ تعالیٰ توفیق دے اور وہ اپنے تمام احوال میں اپنی عبودیت کو لازم پکڑے، اگرچہ وہ اپنی دونوں اصلوں کو جانتا ہو، تو وہ اس اصل کو ترجیح دیتا ہے جو اس کے زیادہ قریب ہے، یعنی اپنی ماں کا پہلو۔ کیونکہ وہ بلا شک اپنی ماں کا بیٹا ہے۔ کیا تم میت کو قبر میں تلقین کرنے کی سنت کو نہیں دیکھتے؟ اسے کہا جاتا ہے: \"اے اللہ کے بندے اور اے اللہ کی بندی کے بیٹے\" (یا عبد الله ویا ابن أمة الله)۔ پس اسے اس کی ماں کی طرف منسوب کیا جاتا ہے، اللہ کی طرف سے اس پر پردہ ڈالنے کے لیے۔ پس اسے اس کی ماں کی طرف منسوب کیا گیا کیونکہ وہ اس کی زیادہ حقدار ہے، اس کی نشوونما کے ظہور اور اس کی آنکھ کے وجود کی وجہ سے۔ پس وہ اپنے باپ کے لیے بستر کا بیٹا ہے، اور وہ حقیقت میں اپنی ماں کا بیٹا ہے۔\n\nپس اس معرفت کو سمجھو جو ہم نے تمہیں اس باب میں تمہارے بارے میں عطا کی ہے۔ **\"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\"** (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "(باب پنجاه و دوم در شناخت سببی که مکاشف (Al-Mukāshif) چون آن را ببیند، از آن به عالم شهود (Ālam al-Shahāda) می‌گریزد)\n\nهر کس که بر پیکر خود ترسید،\nحق (Al-Ḥaqq) را آشکارا و علنی ندید.\n\nپس او را می‌بینی که هنگام شهود (Al-Shuhūd) حق،\nبه سوی کائنات بازمی‌گردد و بدن را می‌جوید.\n\nو شجاعان را می‌بینی که در طلب چیزی هستند\nکه ترسو از آن حذر می‌کند.\n\n### [نفوس انسانی در اصل آفرینش خود بر جزع (Al-Jaza‘) سرشته شده‌اند]\n\nبدان که خداوند تو را به روحی از جانب خود تأیید کند، که خداوند نفوس انسانی را در اصل نشأتشان بر جزع (Al-Jaza‘) سرشته است. پس شجاعت و اقدام برای آن‌ها امری عارضی است. جزع در انسان قوی‌تر از حیوانات است، مگر صرصر (مورچه). عرب می‌گوید: «ترسوتر از صرصر». سبب قوت جزع در انسان، عقل و فکری است که خداوند او را به واسطه آن دو بر سایر حیوانات متمایز ساخته است. و انسان را جز نیروی وهمی شجاع نمی‌کند، چنانکه به واسطه همین نیرو نیز در مواضع مخصوصی بر جزع و ترس او افزوده می‌شود؛ زیرا وهم سلطانی قوی است. و سبب این امر آن است که لطیفه انسانی بین روح الهی که همان نفس رحمانی (Al-Nafs al-Raḥmānī) است و بین جسم تسویه‌شده و معتدل از ارکان معتدل از طبیعت متولد شده است؛ طبیعتی که خداوند آن را مقهور تحت نفس کلی قرار داده، چنانکه ارکان را مقهور تحت حکم سلطان افلاک قرار داده است.\n\n### [جسم حیوانی در درجه پنجم قهر قرار دارد]\n\nسپس جسم حیوانی مقهور تحت سلطان ارکان است که همان عناصر هستند. پس او مقهورِ مقهورِ مقهور است؛ یعنی مقهور نفس است که مقهور عقل است. پس از یک جهت در درجه پنجم قهر قرار دارد و ضعیف‌ترینِ ضعیفان است. خداوند عز و جل فرمود: **اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ** (خداوند کسی است که شما را از ضعف آفرید). پس ضعف اصل اوست. سپس برای او نیرویی عارضی قرار داد و آن قول اوست: **ثُمَّ جَعَلَ مِنْ بَعْدِ ضَعْفٍ قُوَّةً** (سپس بعد از ضعف، قدرتی قرار داد). سپس او را به اصلش یعنی ضعف بازگرداند و فرمود عز و جل: **ثُمَّ جَعَلَ مِنْ بَعْدِ قُوَّةٍ ضَعْفاً وَشَيْبَةً** (سپس بعد از قدرت، ضعف و پیری قرار داد). این ضعف اخیر را خداوند برای برپایی نشأت آخرت آماده کرده است، چنانکه نشأت دنیا بر ضعف برپا شد. و شما نشأت اول را دانسته‌اید.\n\n### [جزع (Al-Jaza‘) در انسان دلیل نیازمندی او به خداوند است]\n\nاین امر از آن رو بود تا ذلت و افتقار و طلب یاری و نیاز به خالقش ملازم ذات او باشد. با این همه، از اصل خود غافل می‌شود و به آنچه از قوت برایش عارض شده، مغرور می‌گردد و ادعا می‌کند و می‌گوید: «من» و خود را به مقابله با هول‌های عظیم امیدوار می‌سازد. اما اگر پشه‌ای او را بگزد، به دلیل وجود درد، جزع (Al-Jaza‘) را آشکار می‌سازد و برای از بین بردن آن ضرر می‌شتابد و آرام نمی‌گیرد تا آن را بیابد و بکشد. پشه چه ارزشی دارد که انسان این‌گونه به آن اهمیت دهد و او را از بسترش بلرزاند و خواب از او بگیرد؟ پس آن ادعا و اقدام بر هول‌های عظیم کجا رفت؟ در حالی که نیش پشه یا مگسی او را رسوا کرده است. این اصل اوست تا بداند که اقدام او بر هول‌های عظیم تنها به واسطه غیر اوست نه به واسطه خودش، و آن چیزی است که خداوند او را به آن تأیید می‌کند، چنانکه فرمود: **وَأَيَّدْنَاهُ** (و او را تأیید کردیم) یعنی او را قوی ساختیم. و به همین دلیل **وَإِيَّاكَ نَسْتَعِينُ** (و تنها از تو یاری می‌جوییم) در هر رکعت و «لا حول ولا قوة إلا بالله» (هیچ نیرو و قوتی جز به واسطه خداوند نیست) تشریع شده است.\n\n### [هستی (Al-Wujūd) لذت و شیرینی است و نیستی (Al-Adam) درد و هراس]\n\nو چون انسان دانست که اگر جود خداوند عز و جل نبود، برای او چشمی در هستی (Al-Wujūd) ظاهر نمی‌شد و اصل او چیزی قابل ذکر نبوده است، خداوند متعال فرمود: **وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئاً** (و تو را پیش از این آفریدم در حالی که چیزی نبودی). پس برای هستی (Al-Wujūd) لذت و شیرینی است و آن خیر است. و برای توهم نیستی عینی، در نفوس دردی شدید و عظیم است که قدر آن را جز دانشمندان نمی‌دانند. اما هر نفسی از نیستی می‌ترسد که به آن ملحق شود، چنانکه حال اوست. پس هرگاه امری را ببیند که در آن توهم کند که نیستی عین او یا آنچه نزدیک به آن است، به او ملحق می‌شود، از آن می‌گریزد و هراسان می‌شود و بر عین خود می‌ترسد. و همچنین به دلیل آنکه از روح الهی است که همان نفس رحمان (Al-Nafs al-Raḥmānī) است. و به همین دلیل به مناسبت نفس، از آن به «دمیدن» (Nafkh) تعبیر شده است و فرمود: **وَنَفَخْتُ فِيهِ مِنْ رُوحِي** (و از روح خود در او دمیدم). و همچنین عیسی (علیه السلام) به دمیدن در صورتی گلی به هیئت پرنده قرار داده شد.\n\n### [ارواح: ظهور آن‌ها، جایگاه‌هایشان، سلامتی و بیماری‌شان]\n\nارواح جز از انفاس (دم‌ها) ظاهر نشدند، جز اینکه محلی که از آن عبور می‌کنند، بدون شک اثری در آن‌ها دارد. آیا نمی‌بینی که باد اگر از کنار چیزی متعفن بگذرد، بوی گندیده به مشام تو می‌آورد و اگر از کنار چیزی خوشبو بگذرد، بوی خوش می‌آورد؟ به همین دلیل ارواح مردم متفاوت شدند: روح پاک برای جسد پاک که هرگز شرک نورزیده و محل اخلاق پست نبوده است، مانند ارواح انبیا و اولیا و ملائکه. و روح خبیث برای جسد خبیث که پیوسته مشرک و محل اخلاق پست بوده است. و این امر تنها به دلیل غلبه برخی طبایع (یعنی اخلاط) بر برخی دیگر در اصل نشأت جسد است که سبب پاکی روح و وجود مکارم اخلاق و پستی‌ها و خبث روح است. پس سلامت و عافیت ارواح، مکارم اخلاق آن‌هاست که از نشأت بدن عنصری خود کسب کرده‌اند و با هر چیز پاک و زیبا آمده‌اند. و بیماری ارواح، اخلاق پست و مذموم آن‌هاست که آن را نیز از نشأت بدن عنصری خود کسب کرده‌اند و با هر چیز خبیث و قبیح آمده‌اند. آیا نمی‌بینی که خورشید اگر نور خود را بر جسم شیشه سبز بتاباند، نور در دیوار یا جسمی که شعاع بر آن می‌افتد، سبز ظاهر می‌شود؟ و اگر شیشه سرخ باشد، شعاع را در چشم بیننده سرخ می‌اندازد. پس در ناظر به رنگ محل رنگ می‌پذیرد. و این به دلیل لطافت آن است که اشیا را به سرعت می‌پذیرد. و چون هوا از قوی‌ترین اشیا بود و روح، نفس است و شبیه به هوا، پس قوت از آن او بود. و اصل نشأت ارواح از این قوت بود و ضعف را از مزاج طبیعی بدنی کسب کرد؛ زیرا عین آن جز پس از اثر مزاج طبیعی در آن ظاهر نشد. پس ضعیف خارج شد، زیرا در ظهور عین خود به جسم نزدیک‌تر است. اما اگر قوت را بپذیرد، آن را از اصل خود که همان نفس رحمانی (Al-Nafs al-Raḥmānī) است و از آن به روح دمیده شده که به خداوند اضافه شده، تعبیر می‌شود، می‌پذیرد. پس همان‌گونه که پذیرای ضعف است، پذیرای قوت نیز هست. و هر دو به حکم اصل هستند. و به بدن نزدیک‌تر است، زیرا عهدش با آن جدیدتر است. پس ضعفش بر قوتش غلبه کرد. اگر از ماده مجرد می‌شد، قوت اصلی‌اش که از دمیدن الهی دارد، ظاهر می‌شد و هیچ چیز متکبرتر از آن نبود. پس خداوند او را همیشه در دنیا و در برزخ در خواب و پس از مرگ، ملزم به صورت طبیعی کرد. پس هرگز خود را مجرد از ماده نمی‌بیند. و در آخرت پیوسته در اجساد خود است. خداوند او را از صور برزخ در اجسادی که برای او در روز قیامت ایجاد کرده، برمی‌انگیزد و به واسطه آن وارد بهشت و جهنم می‌شود. این امر برای آن است که ضعف طبیعی ملازم او باشد و پیوسته فقیر بماند. آیا نمی‌بینی که در اوقات غفلت از خود، چگونه از او تهجم و اقدام بر مقام الهی سر می‌زند؟ پس ادعای ربوبیت (Al-Rubūbiyya) می‌کند، مانند فرعون، و در غلبه آن حال بر او می‌گوید: «أنا الله» (من خدا هستم) و «سبحانی» (پاکم)، چنانکه برخی از عارفان (Al-Ārifīn) چنین گفتند. و این به دلیل غلبه حال بر اوست. و به همین دلیل چنین لفظی از رسول یا نبی یا ولی کاملی که در علم و حضور و ملازمت باب مقام خود و ادبش و مراعات ماده‌ای که در آن است و به واسطه آن ظاهر شده، صادر نشده است.\n\n### [افعال بندگان و نسبت دادن آن‌ها به خداوند و به خودشان]\n\nپس او سدی است پر از ضعف و فقر خود، با وجود شهود (Al-Shuhūd) اصلش از نظر علم و حال و کشف (Al-Kashf). و علم او به اصلش و مقام خلافتش از جهت دیگر، اگر حال او بود، ادعای الوهیت می‌کرد؛ زیرا امر خارج شده در دمیدن از دمنده، به اندازه آن، از حکم اوست. پس اگر ادعای آن می‌کرد، ادعای محالی نکرده بود. و به همان مقداری که از نیروی الهی در اوست و دمیدن آن را آشکار کرده، تکلیف بر او متوجه شده است؛ زیرا او عین مکلف است. و افعال به او نسبت داده شده و به او گفته شده است که بگو: **وَإِيَّاكَ نَسْتَعِينُ** (و تنها از تو یاری می‌جوییم) و «لا حول ولا قوة إلا بالله» (هیچ نیرو و قوتی جز به واسطه خداوند نیست)، زیرا این اصل توست که به آن بازمی‌گردی. پس معتزله در نسبت دادن افعال به بندگان از یک جهت، به دلیل شرعی، راست گفتند. و مخالفان نیز در نسبت دادن همه افعال به خداوند متعال از یک جهت، به دلیل شرعی و عقلی، راست گفتند. و به کسب در افعال بندگان برای بندگان قائل شدند، به دلیل قول خداوند متعال: **لَهَا مَا كَسَبَتْ** (آنچه کسب کرده برای اوست). و درباره صورتگران (نقاشان) بر زبان رسولش (صلی الله علیه و سلم) فرمود: «کجایند کسانی که رفتند تا مانند خلق من خلق کنند؟»\n\nپس خلق را به بندگان نسبت داد. و درباره عیسی (علیه السلام) فرمود: **وَإِذْ تَخْلُقُ مِنَ الطِّينِ** (و هنگامی که از گِل می‌آفریدی). پس خلق را به او (علیه السلام) نسبت داد و آن ایجاد صورت پرنده در گِل بود. سپس به او امر کرد که در آن بدمد. پس آن صورتی که عیسی (علیه السلام) تصویر کرده بود، پرنده‌ای زنده شد. و قول او **بِإِذْنِ اللَّهِ** (به اذن خداوند) یعنی امری که خداوند به او فرمود از خلق صورت پرنده و دمیدن و شفای کور مادرزاد و پیسی و زنده کردن مرده. پس خبر داد که عیسی (علیه السلام) از نفس خود به سوی آن برانگیخته نشد، بلکه به امر خداوند بود تا آن و زنده کردن مردگان از آیات او بر آنچه ادعا می‌کند، باشد. و اگر انسان از حیث حقیقتش از آن نفس رحمانی (Al-Nafs al-Raḥmānī) نبود، صحیح و ثابت نمی‌شد که از دمیدن او پرنده‌ای با بال‌هایش پرواز کند.\n\n### [انسان حقیقتاً فرزند مادرش است و روح فرزند طبیعت بدنش]\n\nو چون حقیقت انسان چنین بود، خداوند او را با آنچه از صفت متکبران و سرنوشت آن‌ها و سیاهی روی‌هایشان ذکر کرد، ترسانید. همه این‌ها دارویی برای ارواح است تا با ضعف مزاج نزدیک‌تر خود در ظهور عینشان، توقف کنند. پس انسان بدون شک حقیقتاً فرزند مادرش است. و روح فرزند طبیعت بدنش است و آن مادر اوست که به او شیر داده و در شکم او رشد کرده و از خون او تغذیه شده است. پس حکم او حکم مادرش است و برای بقای پیکرش از غذا بی‌نیاز نیست.\n\n### [مکاشفی (Al-Mukāshif) که به عالم شهود (Ālam al-Shahāda) می‌گریزد]\n\nو چون این امر بر انسان غالب بود، به مکاشفی (Al-Mukāshif) بازگشتیم که هنگام دیدن آنچه در کشف (Al-Kashf) او را به وحشت می‌اندازد، به عالم شهود (Ālam al-Shahāda) می‌گریزد، مانند دوست ما احمد العصاد الحریری (رحمه الله). او هرگاه کشف بر او غالب می‌شد، با لرزش و اضطراب به سرعت به حس خود بازمی‌گشت. من او را سرزنش می‌کردم و در این باره به او می‌گفتم. او می‌گفت: «از نیستی عین خود به دلیل آنچه می‌بینم، می‌ترسم و جزع می‌کنم.» اگر این مسکین می‌دانست که اگر از مواد جدا شود، نفس به قرارگاه خود که همان عین اوست بازمی‌گردد و هر چیزی به اصل خود بازمی‌گردد. اما اگر چنین می‌شد، فایده‌ای در حق بنده در آنچه ظاهر می‌شود، از بین می‌رفت. و امر چنین نیست. و به همین دلیل گفتیم: «و او عین اوست» یعنی عین بنده. پس بقایی که حق (Al-Ḥaqq) اراده کرده، با وجود این پیکر عنصری در دنیا و طبیعی در آخرت، برای او سزاوارتر است. و کسی که در آنجا، یعنی هنگام وارد (Al-Wārid) الهی، ثابت می‌ماند، تنها زمانی ثابت می‌ماند که به عنوان بنده وارد شده باشد. چنانکه کسی که ثابت نمی‌ماند، تنها زمانی وارد شده که در نفس خود چیزی از ربوبیت (Al-Rubūbiyya) داشته است. پس از زوال آن در آنجا ترسیده و به هستی (Al-Wujūd) که ربانیت او در آن ظاهر شده، گریخته است. و به همین دلیل فایده او کم خواهد بود. و ثابت‌قدم به عنوان بنده وارد می‌شود، پذیرنده با همتی سوزان به سوی اصل خود، تا خداوند از عطایای خود آنچه را که به او عادت داده، ببخشد. پس چون خارج شود، نوری است که به واسطه آن روشنایی گرفته می‌شود.\n\n### [مثَل کسی که با ربوبیت (Al-Rubūbiyya) خود وارد حق (Al-Ḥaqq) می‌شود و مثَل کسی که با عبودیت (Al-Ubūdiyya) خود وارد او می‌شود]\n\nمثَل کسی که با ربوبیت (Al-Rubūbiyya) خود وارد آن جناب عالی می‌شود، مانند کسی است که با چراغی روشن وارد می‌شود. و مثَل کسی که با عبودیت (Al-Ubūdiyya) خود وارد می‌شود، مانند کسی است که با فتیله‌ای بدون نور یا با مشتی علف که در آن آتشی خاموش است، وارد می‌شود. هنگامی که با این وضعیت وارد می‌شوند، نفسی از رحمان (Al-Raḥmān) بر آن‌ها می‌وزد. پس چراغ به دلیل آن وزش خاموش می‌شود و علف شعله‌ور می‌گردد. پس صاحب چراغ در تاریکی خارج می‌شود و صاحب علف در نوری که به واسطه آن روشنایی گرفته می‌شود، خارج می‌گردد. پس بنگر که استعداد چه چیزی به او بخشیده است. هر فرارکننده‌ای از آنجا، تنها از خاموش شدن چراغ خود می‌ترسد. پس او از زوال ربوبیت (Al-Rubūbiyya) خود می‌ترسد و به محل ظهور آن فرار می‌کند. اما خارج نمی‌شود مگر آنکه چراغش خاموش شده باشد. و اگر با چراغ روشن خارج می‌شد، چنانکه وارد شده بود و آن وزش در او تأثیر نمی‌کرد، حقیقتاً ادعای ربوبیت می‌کرد. اما این از عصمت خداوند برای او بود. و کسی که به عنوان بنده وارد شد، نمی‌ترسد. و اگر اشتعال فتیله‌اش در آنجا شعله‌ور شد، می‌شناسد که چه کسی آن را شعله‌ور کرده و منت (لطف) او را سبحانه در آن می‌بیند. پس به عنوان بنده‌ای نورانی خارج می‌شود، چنانکه خداوند متعال فرمود: **سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ** (پاک و منزه است کسی که بنده‌اش را شبانه سیر داد) یعنی به عنوان بنده. پس در خروجش به سوی امتش، **دَاعِياً إِلَى اللَّهِ بِإِذْنِهِ وَسِرَاجاً مُنِيراً** (دعوت‌کننده به سوی خداوند به اذن او و چراغی نوربخش) بود، چنانکه به عنوان بنده‌ای ذلیل و عارف به آنچه وارد شده و بر چه کسی وارد شده، داخل شد. پس هر کس که خداوند او را توفیق دهد و در همه احوالش ملازم عبودیت (Al-Ubūdiyya) خود باشد، اگرچه اصل خود را بشناسد، جانب اصل نزدیک‌تر به خود، یعنی جانب مادرش را ترجیح می‌دهد؛ زیرا او بدون شک فرزند مادرش است. آیا به سنت در تلقین میت هنگام قرار گرفتن در قبرش نمی‌نگری که به او گفته می‌شود: «یا عبد الله و یا ابن أمة الله» (ای بنده خدا و ای فرزند کنیز خدا). پس به مادرش نسبت داده می‌شود، برای پوششی از جانب خداوند بر او. پس به مادرش اضافه شد، زیرا او به دلیل ظهور نشأت و وجود عین او، به او سزاوارتر است. پس او برای پدرش فرزند فراش است و حقیقتاً فرزند مادرش است. پس آنچه را که از معرفت (Al-Ma‘rifa) به تو در این باب بخشیدیم، بفهم. و **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق (Al-Ḥaqq) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}