{
  "id": 376,
  "title": {
    "ar": "الباب السادس والسبعون وثلاثمائة في معرفة منزل يجمع بين الأولياء والأعداء من الحضرة الحكمية",
    "en": "Chapter Three Hundred and Seventy-Six: Concerning the Knowledge of a Station (منزل) that Unites the Saints (الأولياء) and the Enemies (الأعداء) from the Presence of Divine Judgment (الحضرة الحكمية)",
    "ur": "باب تین سو چھہتر (۳۷۶) الحضرة الحكمية (الحضرة الحكمية) سے اس منزل کی معرفت میں جو اولیاء اور اعداء کو یکجا کرتی ہے۔",
    "fa": "باب سیصد و هفتاد و ششم در معرفت منزلی که اولیا و دشمنان را از حضرت حکمیه (الحضرة الحكمية) گرد هم می‌آورد."
  },
  "content": {
    "ar": "## «الباب السادس والسبعون وثلاثمائة» في معرفة منزل يجمع بين الأولياء والأعداء من الحضرة الحكمية\n\n\nومقارعة عالم الغيب بعضهم مع بعض وهذا المنزل يتضمن ألف مقام محمدي‏\n\n\n> إن المغانم نار الحق تأكلها *** فمن يكن بدلا منها فقد عصما\n\n\n> منها فليس لها عليه سلطنة *** فذلك نائبه في الخلق قد حكما\n\n\n> وما مضى فهو منسوخ بعامله *** يوم القيامة بالنسخ الذي رسما\n\n\n> فالكل ينعم ملتذ بمنزله *** أهل الجنان وأهل النار والقدماء\n\n\n> من لم يكن حظه علما ومعرفة *** فما تقدم في شأو الهوى قدما\n\n\n> الله يرزقها من علم رحمته *** حظا يبلغنا منازل العلما\n\n\n### [أن لله حظا وافرا من حظوظ عباده‏]\n\n\nاعلم أن الله تعالى قد أبان لعباده في هذا المنزل أن له فيه حظا وافرا من حظوظ عباده ومن أجل هذا\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حق الله أحق بالقضاء\n\n\nيعني من حق المخلوق وقال في القرآن العزيز من بَعْدِ وَصِيَّةٍ يُوصِي بِها أَوْ دَيْنٍ فقدم الوصية على الدين والوصية حق الله لأنه الذي أوجبها علينا حين أوجبها الموصي في المال الذي له فيه تصرف والفقهاء يقدمون الدين على الوصية خلافا لما ورد به حكم الله إلا بعض أهل الظاهر فإنهم يقدمون الوصية على الدين وبه أقول وجعل الله الحظ الذي له في الصلاة على النصف وهو دون هذا الحظ الآخر\n\n\nفقال قسمت الصلاة بيني وبين عبدي نصفين نصفها لي ونصفها لعبدي ولعبدي ما سأل‏\n\n\nفساوى سبحانه في هذه القسمة بين الله وبين عبده إذا صلى وقال في حظه في المغنم إن له الخمس وحده من المغنم وما بقي وهو أربعة أخماس تقسم على خمسة فلكل صنف من الحظ دون ما لله فحظ الله في هذا المقسوم أكثر من حظه في الصلاة بالنسبة إلى هذا الحال بينه وبين عبيده وإلا فحظ النصف أعظم من حظ الخمس فقسم الصلاة أكثر من قسم المغنم وبالنظر في عين الموطن والقسمة الخاصة فحظه في المغنم بالنظر إلى ما بقي من الأصناف المقسوم عليهم أعظم فأنزل الحق نفسه من عباده منزلة أنفسهم وعاملهم بما يتعاملون به وفي موطن آخر يقول لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فنفى المماثلة وفي موضع آخر\n\n\nيقول المترجم عنه إن الله خلق آدم على صورته‏\n\n\nثم إنه جعل الإنسان محل ظهور الأسماء فيه وأطلقها عليه فللعبد التسمية بكل اسم تسمى به الحق وإن اختلفت النسب فمعقولية مدلول الاسم واحدة لا تتغير ثم إنه جعل بعضهم خليفة عنه في أرضه وجعل له الحكم في خلقه وشرع له ما يحكم به وأعطاه الأحدية فشرع إنه من نازعه في رتبته قتل المنازع‏\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا بويع لخليفتين فاقتلوا الآخر منهما\n\n\nوجعل بيده التصرف في بيت المال وصرف له النظر عموما وأمرنا بالطاعة له سواء جار علينا أو عدل فينا فقال تعالى يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ وهم الخلفاء ومن استخلفه الإمام من النواب فإن الله قد جعل له أن يستخلف كما استخلفه الله فبأيديهم العطاء والمنع والعقوبة والعفو كل ذلك على الميزان المشروع فلهم التولية والعزل كما أن الحق بيده الميزان يخفض القسط ويرفعه وذلك الميزان هو الذي أنزله إلى الأرض بقوله ووَضَعَ الْمِيزانَ ثم قال إنه يرفع إليه عمل النهار قبل عمل الليل وعمل الليل قبل عمل النهار كذلك الخليفة نرفع إليه أعمال الرعية يرفعها إليه عماله وجباته فيقبل منها ما شاء ويرد منها ما شاء فكل ما ذكره الحق لنفسه من التصرف في خلقه ولم يعينه جعل للإمام أن يتصرف به في عباده ثم إن الله جعل له أعداء ينازعونه في ألوهيته كفرعون وأمثاله كذلك جعل الله للخلفاء منازعين في رتبتهم وجعل له أن يقاتلهم ويقتلهم إذا ظفر بمن ظفر منهم كما يفعل سبحانه مع المشركين ومدة إقامتهم كمدة إمهال الله إياهم وأخذ الخليفة وظفره بهم كزمان الموت لهؤلاء حتى لو قابلت النسختين ما اختلفتا في حرف واحد في الحكم وكما إن الحق يحكم بسابق علمه في خلقه يحكم الخليفة بغلبة ظنه لأن الخليفة ليست له مرتبة العلم بكل ما يجري في ملكه ولا يعلم المحق من المبطل وإنما هو بحسب ما تقوله البينة كما يفعله الله مع خلقه مع علمه‏\nيقيم على خلقه يوم القيامة الشهود فلا يعاقبهم إلا بعد إقامة البينة عليهم مع علمه وبهذا قال من قال إنه ليس للحاكم أن يحكم بعلمه أما في العالم فللتهمة بما له من الغرض وأما في جانب الحق فلإقامة الحجة على المحكوم عليه حتى لا يأخذه في الآخرة إلا بما شرع له من الحكم به في الدنيا على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم ولهذا يقول الرسول لربه عن أمر ربه رَبِّ احْكُمْ بِالْحَقِّ يعني بالحق الذي بعثتني به وشرعت لي أن أحكم به فيهم فإذا علمت إن الحق أنزل نفسه في خلقه منزلتهم وجعل مجلاه الأتم في الخليفة الإمام ثم‏\n\n\nقال كلكم راع وكلكم مسئول عن رعيته‏\n\n\nفعمت الإمامة جميع الخلق فحصل لكل شخص منهم مرتبة الإمامة فله من الحق هذا القدر ويتصرف بقدر ما ملكه الله من التصرف فيه فما ثم إنسان إلا وهو على صورة الحق غير أنه في الإمام الأكبر مجلاه أظهر وأمره أعظم وطاعته أبلغ واعلم أن الله تعالى لما شرع لعباده ما شرع قسم ما شرعه إلى فرض أوجبه على المكلفين من عباده وهو على قسمين فرض أوجبه عليهم ابتداء من عنده كالصلاة والزكاة والصيام والحج والطهارة وما أشبه‏\n\n\nذلك مما أوجبه عليهم من عند نفسه وفرض آخر أوجبوه على أنفسهم ولم يكن ذلك فأوجبه الله عليهم ليؤجروا عليه أجر الواجب الإلهي وليتحقق الله عندنا إن الإنسان على صورته فإن الله أوجب على نفسه نصر المؤمنين والرحمة وأمثال ذلك هذا في حق العلماء بالله وفي حق قوم أوجبه عليهم عقوبة لهم حين أوجبوه على أنفسهم كالنذر وزاحموا الربوبية في الإيجاب على نفسه فأوجبه عليهم ليعرفهم أنهم ليس لهم أن يوجبوا على أنفسهم فيعرفون بذلك مقدارهم فالحق تعالى لو لم يفعل ما أوجب على نفسه فعله لما تعلق به ذم ولا لوم في ذلك لأن رتبته تقتضي بأنه الفعال لما يريد ولهذا ما يتعلق بإيجابه على نفسه حد الواجب والعبد لما أوجب الله عليه ما أوجبه على نفسه تعلق به إذا لم يقم بصورة ما أوجبه على نفسه حد الواجب كالواجب الأصلي إذا لم يقم به يعاقب فأجره عظيم والعقوبة عليه عظيمة فيمن لم يقم به فجزاؤه عظيم في الواجبين معا ثم ما جاء من الأفعال زائدا على صور الواجبات سمي ذلك نافلة أي زائدا على الواجب فإن لم يكن لذلك الزائد عين صورة في الفرائض لم يكن نافلة وكان ذلك عملا مستقلا له مرتبة في الأجر ليست للنوافل ثم مزج النشأة كما مزج نشأة المكلف فجعل في نشأة الفرائض سننا وهي زوائد على الفرائض وجعل في النوافل التي تطوع العبد بها من نفسه من غير وجوب الفرائض في نشأة النوافل ولهذا إذا لم يجي‏ء بالفرائض يوم القيامة تامة يقول الله أكملوا لعبدي فريضة من تطوعه فما نقص من الفرض الواجب كمل من الفرض الذي في النوافل وما نقص من سنن الفرض الواجب كمل من سنن النوافل ألحق كل شي‏ء بمثله قال لي بعض الأرواح فلم سميت الغنائم أنفالا قلنا لا شك ولا خفاء عند كل مؤمن عالم بالشرع إن الله ما جعل القتال للمؤمن إلا لتكون كلمة الله هي العليا وكَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى‏ لتتميز الكلمتان كما تميزت القدمان فإنه خلق من كل شي‏ء زوجين ذاتا وحكما وعرفتنا التراجمة عن الله وهم رسل الله إن الله تعالى من وقت شرع الجهاد والقتال والسبي أعطى المغانم للنار طعمة أطعمها إياها وأوجبها لها وكان من طاعتها لربها أنها لا تتناول إلا ما أحل الله لها تناوله وكان قد حرم الله عليها أكل المغنم إذا وقع فيه غلول من المجاهدين فكانت لا نأكل المغنم إذا غل فيه حتى يرد إليه ما كان أخذ منه ليخلص العمل للمجاهد فلما جاء الشرع المحمدي زاد الله المغانم لأمة محمد صَلَّى اللهُ عَليهِ وسَلَّم طعمة على ما أطعمهم من غير ذلك فكانت تلك الطعمة التي أخذناها من النار نافلة لهذه الأمة وما أعطاها إياهم لكونهم جاهدوا إذ لو كان ذلك حقا لهم على الجهاد ما وقعت لأحد لم يجاهد معهم فيها الشركة فما هي فريضة للمجاهدين وإنما هي طعمة أطعمها الله من ذكر وجعل لنفسه نصيبا لكونه نصرهم فله نصيب في الجهاد فلما كان السبب لكون الله جعل لنفسه فيها نصيبا لنصرته دين الله اندرج في نصيب الله كل من نصر دين الله وهم الغزاة فليس لهم إذا اعتبرت الآية إلا الخمس من المغنم ثم تبقي أربعة أخماس فتقسم فخمسة أيضا واحد الخمسة لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم وبعد الرسول إذا فقد الخليفة الزمان والخمس الثاني لأهل البيت قرابة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم والخمس الثالث لليتامى والخمس الرابع للمساكين والخمس الخامس لابن السبيل وقد ورد عن بعض العلماء وأظنه ابن أبي ليلى أن الحظ الذي هو الخمس من الأصل كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقبضه ويخرجه للكعبة ويقول هذا الله ثم يقسم ما بقي فلما كانت هذه الطعمة للنار نقلها الله لهذه الأمة كما جعل‏\nفي مال الإنسان الزكاة حقا لأصناف مذكورين فأوجب على أصحاب الأموال على وجه مخصوص إخراجها وأوجب على الإمام أخذها ولم يوجب على الأصناف أخذها فهم مخيرون في أخذ حقهم وفي تركه كسائر الحقوق فمن أخذها منهم أخذ حقه ومن ترك أخذها ترك حقه وله ذلك واعلم أن الإمام هو المطلوب بعلم هذه التقاسيم والقيام بها\n\n\n> ما كل من حاز الجمال بيوسف *** إن الجميل هو الإمام المنصف‏\n\n\n> إن كنت تدرك ما تريد وتشتهي *** أنت المحب والمبرأ يوسف‏\n\n\nفإن غلب على ظن الإمام أن المذكورين في قوله تعالى واعْلَمُوا أَنَّما غَنِمْتُمْ الآية والتي في سورة الحشر التي فيها ذكر الأصناف حظهم من المغنم الخمس خاصة يقسم فيهم هكذا وما بقي فلبيت مال المسلمين يتصرف فيه الإمام بما يراه فإن شاء أعطاه المجاهدين على ما يريده من العدل والسواء في القسمة أو بالمفاضلة كما يفعل فيما بقي من المال الموروث بعد أخذ هل الأنصباء ما عين الحق لهم أو أراد هذا الإمام أن يعود بما بقي على أولي الأرحام من أهل الميت فيعطي أصحاب الأنصباء زائدا على انصبائهم من كونهم أولي أرحام الميت وإن غلب على ظن الإمام أن الخمس الأصلي لله وحده وما بقي فلمن سمى الله تعالى وقد جعل الله للمجاهدين في سبيل الله نصيبا في الصدقات وما جعل لهم في المغنم إلا ما نفلة به الإمام قبل القسمة أو ما أعطاه له‏\n\n\nبقوله من قتل قتيلا فله سلبه‏\n\n\nوإنما عرض الكلام في مثل هذا في المنزل لما فيه من الحظ المنسوب إلى الله خاصة فما غرضنا ما هو الحكم في المغانم وقسمتها في علم الرسوم وإنما المغانم عندنا في هذا الطريق ما حصل للإنسان من العلوم الإلهية التي أعطانا الله إياها عن مجاهدة وجهاد نفس كما أنه للمؤمن تجارة في نفس إيمانه وهي التجارة المنجية من العذاب الأليم فكل علم حصل عن جهاد فهو مغنم ويقسم على ما يقسم عليه المغانم فالنصيب الذي لله تعالى منه ما تعلق به الإخلاص والذي لرسول الله منه الايمان به والذي لذي القربى منه المودة فيهم والذي لليتامى منه هو ما حصل من العلم قبل بلوغ العامل إلى الغاية\n\n\nوالغاية حدها الذي يغنيه عن إضافة العمل إليه فإن الصبي قبل البلوغ حركته وأفعاله إليه فإذا بلغ رجع حكم الأفعال منه إلى الله بعد ما كانت إليه والنبي صَلَّى اللهُ عَليهِ وسَلَّم يقول لا يتم بعد حلم‏\n\n\nفكل ما حصل له قبل البلوغ فهو حقه الذي له من نفسه إذ عينه لله له والذي للمساكين فهو الحظ الذي حصل لهم بالعجز وعدم القدرة وسلب القوة فإن الله هو ذُو الْقُوَّةِ الْمَتِينُ والذي لابن السبيل فهو الحظ الذي له من حيث إنه ابن للطريق إلى الله‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم يقول إن للدنيا أبناء وللآخرة أبناء فكونوا من أبناء الآخرة\n\n\nوهم أبناء السبيل ولا تكونوا من أبناء الدنيا فأما صورة الإخلاص في العمل فهو إن تقف كشفا على إن لعامل لذلك العمل هو الله كما هو في نفس الأمر أي عمل كان ذلك العمل مذموما أو محمود أو ما كان فذلك هو حكم الله تعالى فيه ما هو عين العمل وضح في الخبر أن الله تعالى يقول من عمل عملا أشرك فيه غيري فإنا منه بري‏ء وهو للذي أشرك فنكر العمل وما خص عملا من عمل والضمير في فيه يعود على العمل والضمير في منه يعود على الغير الذي هو الشريك وضمير هو يعود على المشرك فإن الله لا يتبرأ من العمل فإنه العامل بلا شك وإنما يتبرأ من الشريك لأنه عدم والله وجود فالله برأ من العدم فإنه لا يلحقه عدم ولا يتصف به فإنه واجب الوجود لذاته فالبراءة صحيحة وكذلك في قوله بَراءَةٌ من الله ورَسُولِهِ إِلَى الَّذِينَ عاهَدْتُمْ من الْمُشْرِكِينَ فهو أيضا تبرأ من الشريك لأن الشريك ليس ثم فهو عدم لأنه قال من المشركين فهو أيضا تبرأ من الشريك فإخلاص العمل لله هو نصيب الله من العمل لأن الصورة الظاهرة في العمل إنما هي في الشخص الذي أظهر الله فيه عمله فيلتبس الأمر للصورة الظاهرة والصورة الظاهرة لا نشك أن العمل بالشهود ظاهر منها فهي إضافة صحيحة فلهذا نقول إنه عين كل شي‏ء من اسمه الظاهر وهنا دليل خفي وذلك أن البصر لا يقع إلا على آلة وهي مصرفة لأمر آخر لا يقع الحس الظاهر عليه بدليل الموت ووجود الآلة وسلب العمل فاذن لآلة ما هي العامل والحس ما أدرك إلا الآلة فكما علم الحاكم أن وراء المحسوس أمرا هو العامل بهذه الآلة والمصرف لها المعبر عنه عند علماء النظر العقلي بالنفس العاقلة الناطقة والحيوانية فقد انتقلوا إلى معنى ليس هو من مدركات الحس فكذلك إدراك أهل الكشف والشهود في الجمع والوجود في النفس الناطقة ما أدرك أهل النظر في الآلة المحسوسة سواء فعرفوا\nإن وراء النفس الناطقة هو العامل وهو مسمى الله والنفس في هذا العمل كالآلة المحسوسة سواء عند أهل الله وعند أهل النظر العقلي ومتى لم يدرك هذا الإدراك فلا يتصف عندنا بأنه أخلص في عمله جملة واحدة مع ثبوت لآلات وتصرفها لظهور صورة العمل من العامل فالعالم كله آلات الحق فيما يصدر عنه من الأفعال لقوم يعلمون‏\n\n\nوقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيما صح عنه أ تدرون ما حق الله على العباد قالوا الله ورسوله أعلم قال فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا ثم قال أ تدرون ما حقهم عليه إذا فعلوا ذلك أن يدخلهم الجنة\n\n\nفنكر صَلَّى اللهُ عَليهِ وسَلَّم بقوله شيئا ليدخل فيه جميع الأشياء وهو قوله تعالى فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً فنكر أحد فدخل تحته كل شي‏ء له أحدية وما ثم شي‏ء إلا وله أحدية وذكر لقاء الله ليدل على حالة الرضي من غير احتمال كما ذكره رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وذلك في الجنة فإنها دار الرضوان فما كل من لقي الله سعيد فالمواطن لها الحكم في ذلك بما جعل الله فيها وكذلك قوله تعالى لَنْ يَنالَ الله لُحُومُها ولا دِماؤُها ولكِنْ يَنالُهُ التَّقْوى‏ مِنْكُمْ فجعل الذي يصيبه منا التقوى فقد أعلم الحق عباده بنصيبه مما هم عليه وفيه في كل شي‏ء وعهد إلى عباده ذلك فقال وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ فحظه منكم أن تفوا له تعالى بما عاهدكم عليه وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم في الصلوات الخمس فمن أتى بهن لم يضيع من حقهن شيئا كان له عند الله عهدا أن يدخله الجنة\n\n\nوالصلاة مناجاة الله على القسمة التي شرع بينه تعالى وبين عباده فمن أعطاه قسمه ومنها وأخذ منها قسمه فقد أعطاه حقه ونصيبه فإذا كان الله تعالى مع اتصافه بالغنى عن العالمين قد جعل له فيما يكون للعالم ويفتقر إليه نصيبا يأخذه وقسما عينه فما ظنك بمن أصله الفقر والمسكنة في ظهور عينه لا في عينه ووجوده وما هو فيه وإنما قلنا لا في عينه لأن أعيانها لا نفسها ما هي بجعل جاعل وإنما الأحوال التي تتصرف عليها من وجود وعدم وغير ذلك فيها يقع الفقر إلى من يظهر حكمها في هذه العين فاعلم ذلك فمن طلب حقه واستقصاه فلا يلام ولكن لما شرع لنا في بعض الحقوق إنا إذا تركناها كان أعظم لنا وجعل ذلك من مكارم الأخلاق وناط به ما في ذلك من الأجر منه تعالى وهو قوله عز وجل فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله ومن طلب حقه وهو قوله تعالى ولَمَنِ انْتَصَرَ بَعْدَ\n\n\nظُلْمِهِ فَأُولئِكَ ما عَلَيْهِمْ من سَبِيلٍ كان له ذلك فكذلك يفعل مع عباده فيما ضيعوه من حقه وحقوقه يعفو ويصفح ويصلح فيكون المال إلى رحمة الله في الدارين فتعمهم الرحمة حيث كانوا ولكن لا يستوون فيها قال تعالى أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ سَواءً مَحْياهُمْ ومَماتُهُمْ ساءَ ما يَحْكُمُونَ كما لم يسو تعالى بين الذين يعلمون والذين لا يعلمون فالكامل من العباد من لم يترك لله عليه ولا عنده حقا إلا وفاه إياه في كل شي‏ء له فيه نصيب أعطاه نصيبه على حد ما شرع له فإذا وفاه رد عليه جميع ما ذكر أنه له بالشرع فإذا وفي الله له بعهده فيأخذه منه امتناع وابتداء فضل لا جزاء ولا يكون هذا إلا من العلماء بالله الذين يعلمون الأمر على ما هو عليه وهم أفراد من الخلق لا يعلمهم إلا هو فقد نبهتك على أكمل الطرق في نيل السعادة التي ما فوقها سعادة ومع هذا يا حي وبعده فالأمر عظيم والخطب جسيم والإشكال فيه أعظم ولهذا جعل أهل الله الغاية في الحيرة وهو العجز وهذا القدر كاف في العلم بأن الله حقا ونصيبا عند عباده يطلبه منهم بحكم الاستحقاق ويطلب منهم أيضا حقوق الغير بحكم الوكالة كما قال ويَأْخُذُ الصَّدَقاتِ بحكم الوكالة فيربيها ويثمرها فهو وكيل في حق قوم تبرعا من نفسه رحمة بهم وإن لم يوكلوه وفي حق قوم وكيل بجعلهم كما أمرهم أن يتخذوه وكيلا وإلا فليس للعبد من الجرأة أن يوكل سيده فلما تبرع بذلك لعباده ونزل إليهم عن كبريائه بلطفه الخفي اتخذوه وكيلا وأورثهم هذا النزول إدلالا وأما حديث ما يقبل الله من صلاة عبده إلا ما عقل يريد أنه يعضد أداء حق الله تعالى فيما تعين عليه وجعل أكثره النصف وهو الحد الذي عينه له من صلاة عبده وأقله العاشر فقال عشرها تسعها ثمنها سبعها سدسها خمسها ربعها ثلثها نصفها وما ذكر النصف إلا في الفاتحة فعلمنا المعنى فعممناه في جميع أفعال الصلاة وأقوالها بل في جميع ما كلفنا من الأعمال به فأما ما عينه فهو ما انحصرت فيه الفاتحة وهي تسعة أقسام القسم الأول بِسْمِ الله الرَّحْمنِ الرَّحِيمِ الثاني الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ الثالث الرَّحْمنِ الرَّحِيمِ الرابع ملك (مالِكِ) يَوْمِ الدِّينِ الخامس إِيَّاكَ نَعْبُدُ السادس وإِيَّاكَ نَسْتَعِينُ السابع اهْدِنَا الصِّراطَ الْمُسْتَقِيمَ‏\nالثامن صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ التاسع غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ ولا الضَّالِّينَ فالخاسر الساهي عن صلاته من لم يحضر مع الله في قسم واحد من هذه الأقسام التي ذكرناها في الفاتحة وهي التي ذكر الله في القبول من العشر إلى النصف فمن رأى أن بِسْمِ الله الرَّحْمنِ الرَّحِيمِ آية منها ولا يفصلها عنها فالقسمة على ما ذكرناه في الفاتحة فإن حكم الله في الأشياء حكم المجتهد فهو معه في اجتهاده ومن أداه اجتهاده إلى الفصل ففصل البسملة عن الفاتحة وإن البسملة ليست آية منها جعل الله له الجزء التاسع ولا الضَّالِّينَ والبسملة أحق وأولى فإنها من القرآن بلا شك عند العلماء بالله وتكرارها في السور مثل تكرار ما يكرر في القرآن من سائر الكلمات وما زاد على التسعة فعقله في التلاوة حروف الكلمة فقد يعقل المصلي حرفا من حروف الكلمة ثم يغفل عن الباقي فهذا معنى قوله صَلَّى اللهُ عَليهِ وسَلَّم العام إنه لا يقبل إلا ما عقل منها فالعاقل من أتى بها كاملة ليقبلها الله كاملة ومن انتقص منها شيئا في صلاته جبرت له من قراءته الفاتحة في نوافله من الصلاة فليكثر من النوافل فإن لم تف قراءتها في النوافل بما نقصه من قراءة الفاتحة في الفريضة أكملت له من تلاوته بحضور في غير الصلاة المعينة وإن كان في جميع أفعاله في صلاة فإنه قد يكون من الَّذِينَ هُمْ عَلى‏ صَلاتِهِمْ دائِمُونَ وهم الذاكرون الله في كل أحيانهم فهم يناجونه في جميع الأحوال كلها فحظ الله من جميع ما كلف عباده به ما فرض عليهم ونصيب العباد من الله ما أوجبه الحق لهم على نفسه والنافلة للنافلة في كل ذلك وأما حظ الرسول صَلَّى اللهُ عَليهِ وسَلَّم من هذه المسألة بتصديقه والايمان به وبما جاء به فمما يحققه الايمان أن خير الأزمان زمان الصلاة والآذان وخير الشفاعة والكلام ما أذن فيهما الرحمن هذا مما جاء به رسول الحق إلينا ووفد به مقبلا علينا فتدلى حين تجلى وما أصعقه بل أيقظه من تجلى ليتجلى فاقبل وما أعرض وتولى فأما التصديق به فلخبر الحق بأنه رسول منه إلينا وهو الوجيه المقرب وأما الايمان بما جاء به فلإخباره عن الحق ففرق بين إخبار الحق في الايمان به وبين إخباره عن الحق فيما جاء به فلا يؤمن به إلا من خاطبه الحق في سره وإن لم يشعر به المخاطب ولا يعرف من كلمه وإنما يجد التصديق به في قلبه وأهل الكشف والحضور يعرفون عن سماع بأذان وقلوب كلام الحق بأن هذا رسول من عنده فيؤمنون به على بصيرة ولا يؤمن بما جاء به هذا الرسول إلا من خاطبه الرسول في سره وإن لم يشعر به المخاطب ولا يعرف من كلمه وإنما يجد التصديق بما جاء به في قلبه وأهل الكشف والحضور يعرفون عن سماع بقلوب وآذان وأبصار كلام الرسول بأن هذا جاء من عند الله ولَوْ كانَ من عِنْدِ غَيْرِ الله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً فيؤمنون به على بصيرة وإنما قلنا فيما جاء به الرسول وأبصار ولم نقل ذلك في سماع كلام الحق لأن الرسول إذا رأيناه فقد رأيناه والحق تعالى ليس كذلك إذا رأيناه فما رأيناه إلا منزلتنا وصورتنا منه فلهذا لم نقل في تصديق خبره إذا كلمنا وأبصار وما جئنا بالقلوب والآذان إلا لمجرد الخبر خاصة لا لكون الحق تكلم به فإن إدراك القلوب والآذان والأبصار للحق على السواء ما أدرك واحد من العالم أي إدراك كان من هذا وغيره إلا منزلته من الحق وصورته خاصة فما أدركه فذكرنا القلوب من كونها سامعة والآذان للخبر خاصة تنبيها على ما ذكرناه وبيناه فإذا علمت هذا فقد وفيت الله والرسول ما تعين عليك من الحق أن تؤديه لله ولرسوله فإن هذه المسألة غلط فيها جماعة من أهل الله إذ لم يخبروا بها عن الله فكيف علماء الرسوم فمن تكلم فيها من طريق الايمان فلا يتكلم فيها إلا بما تكلمنا به فإنه يتكلم عن ذوق ولهذا ترى شخصين بل ثلاثة أشخاص يشهدون المعجزة على يدي الرسول الذي أبرزها الحق في معرض الدلالة على صدقه فيما جاء به والتصديق به نفسه فشخص من الثلاثة يتيقن أنه الحق وجحده والشخص الثاني لم تقم عنده تلك الدلالة لجهله بموضع الدلالة منها والثالث آمن وصدق والمجلس واحد والنظر\n\n\nبالبصر واحد والإدراك في الظاهر واحد فعلمنا إن الذي آمن وصدق لو لا تجلى الحق لقلبه وتعريفه إياه بغير واسطة ما آمن بما جاء به ولا صدق وكان مثل صاحبه وكذلك في إيمانه بما جاء به فما كل مؤمن يعرف من أين حصل له الايمان ولا سيما وقد رأينا وبلغ إلينا أن بعض من آمن برسول الله عند ما رآه وسمع دعوته ولم ير له معجزة ولا دلالة بل وجد في نفسه أنه صادق في دعواه فآمن به من حينه وما تلكأ ولا نلعثم فما كان‏\nإلا مما ذكرناه من التجلي لقلبه ولا يشعر أن ذلك عن تجل وبهذا القدر زاد أهل الكشف على غيرهم من المؤمنين ولو لا كشفهم للأمور ما فصلوها إلى كذا وإلى كذا فحظ الرسول أن يلحقه بربه في نفسه وفيما جاء به من عنده وأما حظ اليتامى من هذا العلم فإنه على الحقيقة أوان بلوغ الخروج عن الدعوى فيما كان لك فحظك قبل مجي‏ء هذا الزمان إن تضاف أفعالك لك ولا يعترض عليك ولا تسلب عنك ولا تحجير عليك فإذا بلغ أوان الحلم صرت محجورا عليك ووقع التقييد في جميع حركاتك وتوجهت عليها أحكام الحق لأنها أفعاله ظهرت فيك ولو لا ما ظهرت فيك ما تعلق بها هذا الخطاب ولا هذا التحكيم ومعنى طهرت فيك هو عين دعواك أن الأفعال لك فأراد الحق بالتحجير بما كلفك إن يعرفك بأن هذه الأفعال لو كانت لك ملكا محققا ما جاز لي أن أتصرف فيما لك وليس لي وسبب ذلك أن أوان بلوغ العقل قد حل واستحكام العقل والنظر قد حصل فكان ينبغي لك بما أعطاك الله من العقل أن ترى أفعالك التي أنت محل لظهورها منك لله تعالى ليست لك فلو حصل لك هذا ابتداء ما كلفك ولا حجرها عليك في هذه الدار أ لا ترى من لم يستحكم عقله ما حجر عليه ولا كلفه وهو المجنون الذي ستر عنه عقله إن يكون له حكم فيه وكذلك النائم وكل من لم يتصف بالعقل ولما وصل في هذه الدار إلى الحد الذي أوجب عليه التكليف بقيام هذه الصفة إذا كشف عنه الغطاء في هذه الدار لم يرتفع عنه التحجير ولا خطاب الشرع لحكم الدار لا لحكم الحال لأنه كان يعطي القياس ارتفاع التحجير عمن هو بهذه الصفة ولكن لا بد للدار من حكم كما يفعل بأطفال المشركين والكفار نلحقهم بآبائهم للدار وإن علمنا أنهم على الفطرة وما أشركوا ولا كفروا فللدار حكم فإذا جاء وعد الآخرة وانتقلنا إليها خرجنا عن حكم الدار فارتفع عنا حكم التكليف في دار الرضوان وأختها كذلك من أطلعه الله هنا في هذه الدار على سعادته وأطلع آخر على شقاوته لم تسقط هذه المطالعة عنهما التحجير ولا التكليف لأن أصل وضع النواميس في هذه الدار إنما هو لمصلحة الدنيا والآخرة فمن المحال رفع التحجير ما دامت الدنيا ودام من فيها فلو لا هذا لكان من كشف عنه الغطاء ارتفع عنه التحجير لأنه لا يرى فاعلا إلا الله والشي‏ء لا يحجر على نفسه وإن أوجب على نفسه ما أوجب فذلك تأنيس لنا فيما توجبه على أنفسنا لنا فإن أوجبناه له أوجبه علينا لنتميز فنعصي بتركه ولو ترك الحق ما أوجبه على نفسه لم يكن له هذا الحكم فإن هذا الحكم لا يتعلق بمن تعلق به إلا من حيث إن الغير أوجبه فلو لا ما أوجبه الحق علينا حين أوجبناه على أنفسنا لم نكن عصاة إذا تركناه فإذا وفى به من لم يوجبه عليه غيره فمنة منه وفضل ومكارم أخلاق فإن قلت هذا إذا كان في الخير فإن كان شرا قلنا ما ثم الأخير والخير على قسمين خير محض وهو الذي لا شر فيه وخير ممتزج وهو الذي فيه ضرب من الشر كما بيناه من شرب الدواء المكره وكالمؤمن إذا عصى وأطاع فإن المؤمن لا تخلص له معصية دون طاعة أصلا فإن الايمان بكونها معصية طاعة وفي هذا تنبيه لِمَنْ كانَ لَهُ قَلْبٌ فيرجع الأمر في الآخرة إلى الأمر الذي كان عليه اليتيم قبل البلوغ وإنما قلنا في اليتيم وكل صبي دون البلوغ كذلك مع كونه ليس بيتيم لأن اليتيم في تدبير وليه والولي الله لأنه ولي المؤمنين وغير اليتيم في تدبير أبيه فلا ينظر إليه مع وجود أبيه لأن الفرع يستمد من أصله الأقرب أ لا ترى الثمرة لا تعرف لها أصلا إلا فرع الشجرة لأنها من الفرع تستمد والفرع يعرف الأصل الذي تجهله الثمرة واليتيم قد علم إن أباه قد اندرج فانكسر قلبه ولم يكن له أصل يدل عليه فعرفه العلماء بالله أنه ليس له إلا من كان لأبيه وهو الله فيرجع إلى الله في أموره فلما كان حال اليتيم مع الله في نفسه بهذه المثابة جعل الله له حظا في المغنم ليتوفر عليه ما هو له وهو ما يرى الصبي من إضافة\n\n\nالأفعال إليه وعدم التحجير عليه فيها فمن يمسح على رأس يتيم كان له بكل شعرة حسنة وليس ذلك لغير اليتيم وحكم المسكين حكم اليتيم من عدم الناصر الظاهر فقوى الله ضعفه أي زاده الله ضعفا إلى ضعفه فإن المخلوق ضعيف بحكم الأصالة فإذا زاده الله ضعفا إلى ضعفه كان مسكينا فما تكون له صولة فإن صال وهو مسكين فقد أبغضه الله فإنه ظهر منه ما يخالف حاله فقد كلف نفسه ما لا يقتضيه مقامه ولذلك‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ثلاثة لا يُكَلِّمُهُمُ الله ولا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيامَةِ ولا يُزَكِّيهِمْ ولَهُمْ عَذابٌ أَلِيمٌ‏\nملك كذاب وشيخ زان وعائل مستكبر\n\n\nأي قد بالغ في التكبر كما أن المسكين قد بالغ الله فيه بالضعف فإنه من كونه مسكينا صاحب ضعفين ضعف الأصل وضعف الفقر فلا يقدر يرفع رأسه لهذا الضعف بخلاف رب المال فإنه يجد في نفسه قوة المال وبهذا سمي المال مالا لأنه يميل بصاحبه ولا بد إما إلى خير وإما إلى شر لا يتركه في حال اعتدال فالمسكين من سكن تحت مجاري الأقدار ونظر إلى ما يأتي به حكم الله في الليل والنهار واطمأن بما أجرى الله به وعليه وعلم أنه لا ملجأ من الله إلا إليه وأنه الفعال لما يريد وتحقق بأن قسمه من الله ما هو عليه في الحال فجبر الله كسره‏\n\n\nبقوله أنا عند المنكسرة قلوبهم‏\n\n\nفإنك إذا جئت لمن انكسر قلب ما تجد عنده جليسا إلا الله حالا وقولا فجعل له حظا عليه في المغنم وإن لم يكن له فيه تعمل فخدمه غيره ونال هو الراحة بما أوصل الله إليه من ذلك مما جهد فيه الغير وتعب كالمؤمن الذي لا علم له وهو من أهل الجنة فيرى منازل العلماء بالله وهو في الموقف فيتحسر ويندم فيعمد الله إلى من هو من أهل النار من العلماء فيخلع عنه ثوب علمه ويكسوه هذا المؤمن ليرقى به في منزلة ذلك العلم من الجنة لأنه لكل علم منزلة في الجنان لا ينزل فيها إلا من قام به ذلك العلم لأن العلم يطلب منزلته من الجنان والعالم الذي كان له هذا العلم هو من أهل النار الذين هم أهلها والعلم لا يقوم بنفسه فينزل بنفسه في تلك المنزلة فلا بد له من محل يقوم به فيخلعه الله على هذا المؤمن السعيد الذي لا علم له فيرقى به العلم إلى منزلته فما أعظمها من حسرة ولكن بقي عليك إن تعرف أي علم يسلبه هذا الذي هو من أهل النار وذلك أنه إذا كان على علم في نفس الأمر إلا أنه قد دخلت عليه في الدنيا فيه شبهة فأما حيرته فهو في محل النظر وأما إزالته عنه مع علمه بما كان عليه غير أنه اعتقد فيه في الدنيا أنه جهل فإذا كان في الآخرة علم أنه علم فذلك العلم هو الذي يسلب ويخلع على هذا الذي ليس بعالم وهو من أهل الجنة وإذا كان الأمر على ما ذكرناه فإن الله لا يبقى في الدنيا عند الموت عند أهل النار الذين هم أهلها سوى العلم الذي يليق أن يكون عليه أهل النار وما عدا ذلك من العلوم التي لا تصلح أن تكون إلا لأهل الجنة يدخل الله بها على العالم به في الدنيا أو عند الاحتضار شبهة يخطرها له تزيله عن العلم أو تحيره ثم يموت على ذلك وكان ذلك في نفس الأمر علما فهذا الصنف من العلم هو الذي يخلع على أهل الجنان إذا لم يتقدم لهم علم به في الدنيا ويطمع فيه من قد كان علمه من أهل النار فيقام عليه الحجة بأنه مات على شبهة فهذا حظ المسكين من المغنم فإن ذلك الذي سلب عنه في الدنيا بالشبهة جاهد نفسه وتعب فلما غنم ودخلت الشبهة كان حظ المسكين ذلك العلم وأما ابن السبيل فأبناء السبيل هم أعلى الطوائف عند الله فإن الابن لا يقدر أن ينتفي عن أبيه وإنما سمي ابن السبيل لأنه علم إن المنزل محال وأن الاستقرار على أمر واحد محال لا في حق نفسه ولا في حق تجلى ربه بل ولا في حق ربه لأنه في شأن خلقه والأمر فيهم جديد دائما أبدا ومن لم يستقر به قدم فلا بد أن يكون ماشيا أي متحركا ولا يتحرك إلا في طريق وهي السبيل والمشي له دائما دنيا وآخرة فهو ابن السبيل دنيا وآخرة ولما كان متفرغا لسبيله مشغولا به مسافرا فيه والمسافر لا بد له من زاد فجعل الله له نصيبا من المغنم فالحق يغذيه بما ليس له فيه تعمل وقد يكون ابن السبيل في هذه الآية عين المجاهد ويكون السبيل من أجل الألف واللام اللتين للعهد والتعريف سبيل الله التي قال الله فيها ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله يعني الشهداء الذين قتلوا في الجهاد فيكون أيضا حظ المجاهد من المغنم القدر الذي عين الله لابن السبيل وهو معروف سوى ما له في الصدقات فاعلم ذلك فإنه تنبيه حسن إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ وما أنزل الله على عبده يوم الفرقان ففرق بما أعلمه الله بين القبضتين بالكلمتين اللتين ظهرتا في الكرسي بالقدمين إذ كان أهل الله وهم أبناء الآخرة أبناء السبيل بِالْعُدْوَةِ الدُّنْيا إلى الله بمحصل القربة والمكانة الزلفى من الله وهُمْ بِالْعُدْوَةِ الْقُصْوى‏ عن الله وهم أبناء الحياة الدنيا وأبناء سبيلها والرَّكْبُ أَسْفَلَ مِنْكُمْ فجعل السفل لهم إذ كانت كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى‏ ومن كان أسفل منك فأنت أعلى منه لأنكم أهل الله الذين لهم السعادة إذ كانت كلمة الله هي العليا وكل هذا بحكم الله وقضائه لا ليد تقدمت بل لعناية إلهية سبقت يقول الله تعالى إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ‏\n> ألا إن أهل الله بِالْعُدْوَةِ الدُّنْيا *** كما إن أهل الشرك بِالْعُدْوَةِ الْقُصْوى‏\n\n\n> فإن الذي أقصاه يمتاز بالسفلى *** وإن الذي أدناه قد فاز بالعليا\n\n\n> ألا تلحظن الركب أسفل منهم *** فكل فريق من مكانته أدنى‏\n\n\nولما رأينا أن الله قد اختص بالخمس في مثل هذا الموطن وفي قسمة هذا النوع الذي هو المغنم علمنا أن الله ما راعى من الأقسام التي تعتبر في العالم إلا مراعاة الجيش عند اللقاء من كونه عز وجل ملكا قاهرا حيث أثبت له أعداء ينازعونه وتقسيم الجيش عند اللقاء على خمسة أقسام قلب وهو موضع الإمام وهو الذي اصطفاه الله من نشأة عبده‏\n\n\nحين قال وسعني قلب عبدي‏\n\n\nوما بقي فميمنة وميسرة ومقدمة وساقة فلهذا كان الخمس لله والأربعة الأخماس الباقية لمن بقي فإن العدو الذي نصبه الله أخبر الله عنه أنه يأتي من بين أيدينا ومن خلفنا فنلقاه بالمقدمة والساقة وعن أيماننا فنلقاه بالميمنة وعن شمائلنا فنلقاه بالميسرة وليس للعدو غرض إلا في القلب ليزيل ملك الجيش من القلب ما له غرض إلا في هذا فذب الله عن قلب العبد الذي هو موضع نظره الذي وسعه بهؤلاء الذين رتبهم في هذه الأماكن التي يدخل العدو منها فعليه يقاتل هذا الجيش وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم إن الذي يقاتل في سبيل الله هو الذي يقاتل لتكون كلمة الله هي العليا وكَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى‏\n\n\nوهم الأعداء فهو يمدهم من القلب في الباطن وهم يذبون عنه من الظاهر من الجهات التي يطلب العدو والفرصة فيها فمن هنا كان له الخمس من المغنم الذي نص عليه أنه نصيبه لأنه ناصر المؤمنين على أعدائه والجيش ناصر دينه ذلِكَ بِأَنَّ الله مَوْلَى الَّذِينَ آمَنُوا وأَنَّ الْكافِرِينَ لا مَوْلى‏ لَهُمْ فما لهم قلب ينصرهم‏\n\n\n> إن لله نصيبا وافرا *** هو خمس الفي‏ء من غير مزيد\n\n\n> فله القلب الذي يعمره *** وهو العرش الإلهي المجيد\n\n\n> والذي يبقى فقد قسمه *** اختصاصا منه في بعض العبيد\n\n\n> فالذي حاز الذي سطره *** قلمي فاز بما يعطي الوجود\n\n\n> فرسول أو ولي وارث *** ما له في علمنا غير الشهود\n\n\n> والذي يعلمه الله فما *** لي علم فيه إلا أن يجود\n\n\nوفي هذا المنزل علم هل يتعلق العلم الواحد بجميع المعلومات أو لكل معلوم علم أو يختلف بالنسبة إلى العالم وما هو العلم هل هو ذات العالم أو صفة قائمة به أو نسبة ما هي ذات العالم ولا صفته وفيه علم ما يؤدي إليه المناسبات بين الأشياء من التألف والاجتماع وفيه علم من عمل بعملك فهو منك وفيه علم الاستناد وحماية المستند ومشاركته في المشقة وترك ما يرى تركه وإن كان محبوبا لك والايمان الذي لا يزلزله شي‏ء وفيه علم ما توجبه مكارم الأخلاق على من قامت به وعلم المقامات وما يختص بهذا المنزل منها وفيه علم الكثير والقليل ومن هو كثير بالقوة وكثير بالعدد وكذلك في القلة وفي علم فيه مزلة قدم وهو أنه يعطيك أن تكون مع كل من يريد منك أمر أما أن تكون له بما يريده منك وإنما هو مزلة قدم لاختلاف الأغراض وتقييد المؤمن بما قلده من الحكم الذي قيده وفيه علم ما ينبغي أن يستعد له مما لا يستعد له وفيه علم معاملة من تجهل أمره كيف تعامله وفيه علم يعلم به أنه ما يقابلك من العالم ولا من الحق إلا صفتك وفيه علم إلحاق الرءوس بالأذناب في الحكم وهو الحال الذي يستوي فيه الرئيس والمرءوس كالنوع الوسط الذي هو نوع لما فوقه وجنس لما تحته وفيه علم التحريش ثم التبري منه هل ينفع ذلك التبري أم لا ينفع وفيه علم إدراك الخيال في صورة المحسوس في اليقظة وما ثم شي‏ء محسوس مخيل من خارج ولا من داخل بل هو كالسراب تراه ماء وكالصغير في السراب تراه كبيرا وكالجبل الأبيض تراه على البعد أسود فهذا خارج عن الحس والخيال وفيه علم السبب الذي يدعو الإنسان إلى أن يدعو على نفسه بالهلاك ويطلب العلامة في نفسه بما يرديه وفيه علم ما يتوهم أنه قادر عليه وليس بقادر عليه ولما ذا يرجع الإعجاز هل يرجع لأمر لا يقدر مخلوق عليه أو لأمر كان يقدر عليه ثم صرف عنه وفبه علم ما تنتجه التقوى في المتقي وفيه علم الفرق بين الرسول الله صَلَّى اللهُ عَليهِ وسَلَّم وبين المؤمنين وفيه علم ما يريده المخاطب من المخاطب إذا\nكلمه وفيه علم ما يظهر أنه لله وهو للكون ويظهر أنه للكون وهو لله وفيه علم الجهات والإحاطة والسكون والحركة وفيه علم المنافع الأخروية وفيه علم السبب الذي يوجب الأمان في موطن الخوف هل يصح ذلك أم لا وما معنى الموطن هل هو الحال في الشخص فيكون موطنه حاله أو الموطن خارج عن الحال وفيه علم الأسباب الموجبة لوجود الأوهام الحاكمة في النفوس وهي صور من صور التجلي الإلهي وفيه علم ما يحمد من السؤال وما يكره وفيه علم الصلاح ومراعاة الأصلح وعلى من يجب ذلك وفيه علم الوعد والوعيد ومع من يجب القتال شرعا إذا تراءى الجمعان وصف الناس للقتال والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Seventy-Six\n\nConcerning the knowledge of a station (manzil) that unites the Friends of God (الأولياء) and the Enemies (الأعداء) within the Divine Presence of Decree (الحضرة الحكمية), and the conflict of the people of the Unseen World (عالم الغيب) among themselves. This station encompasses a thousand Muhammadan stations (مقام محمدي).\n\n> Indeed, the spoils of war (المغانم) are the fire of the Real (نار الحق) that consumes them,\n>\n> So whoever is a substitute for them has been protected.\n>\n> Protected from it, so it has no dominion (سلطنة) over him,\n>\n> That one is His vicegerent (نائبه) in Creation (الخلق), having ruled.\n>\n> What has passed is abrogated (منسوخ) by its agent (عامله),\n>\n> On the Day of Resurrection, by the abrogation (النسخ) that was decreed.\n>\n> All are enjoying bliss, delighted in their station (منزله),\n>\n> The people of the Gardens and the people of the Fire, and the ancients.\n>\n> Whoever’s portion (حظه) was not knowledge (علما) and gnosis (معرفة),\n>\n> Has not advanced a step in the race of passion (شأو الهوى).\n>\n> Allah grants it from the knowledge of His Mercy (علم رحمته),\n>\n> A portion that leads us to the stations of the learned.\n\n### [That Allah has an ample portion of the portions of His servants]\n\nKnow that Allah the Exalted has made clear to His servants in this station (manzil) that He has an ample portion of the portions of His servants therein. Because of this, the Messenger of Allah, peace and blessings be upon him, said: \"The right of Allah is more deserving of fulfillment (حق الله أحق بالقضاء),\" meaning than the right of the created being. And He said in the Glorious Qur’an: <<مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِها أَوْ دَيْنٍ>> (after a bequest has been made or a debt), thus prioritizing the bequest (وصية) over the debt (دين). The bequest is the right of Allah because He is the One who obligated it upon us when the testator obligated it concerning the wealth over which he had disposal. The jurists (الفقهاء), however, prioritize debt over bequest, contrary to the ruling brought by Allah, except for some of the literalists (أهل الظاهر) who prioritize the bequest over the debt, and this is what I hold.\n\nAllah made the portion that is His in the Prayer (الصلاة) to be half, which is less than this other portion. He said: \"I have divided the Prayer between Myself and My servant into two halves: half for Me and half for My servant, and My servant shall have what he asks.\" Thus, the Exalted made equality in this division between Allah and His servant when he prays. Concerning His portion in the spoils of war (المغنم), He said that He has the fifth (الخمس) alone of the spoils, and what remains—which is four-fifths—is divided into five parts. Thus, every category of recipient has a portion less than that of Allah. Allah’s portion in this division is greater than His portion in the Prayer, relative to this specific situation between Him and His servants. Otherwise, the portion of the half is greater than the portion of the fifth, so the division of the Prayer is greater than the division of the spoils. However, by considering the specific context and the particular division, His portion in the spoils is greater relative to the remaining categories upon whom the division is made.\n\nThus, the Real (الحق) placed Himself among His servants in the position of their own selves and dealt with them according to how they deal with one another. In another context, He says: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like Him), thereby negating similitude. In yet another place, the one who translates for Him says: \"Indeed Allah created Adam upon His form (على صورته).\"\n\nThen He made the human being the locus of the manifestation of the Names (الأسماء) within him and applied them to him. Thus, the servant is entitled to be named by every Name by which the Real is named, even if the relations (النسب) differ, for the intelligibility of the meaning of the Name is one and does not change. Then He made some of them a Caliph (خليفة) for Him on His earth and granted him authority (الحكم) over His creation, legislated for him what he should rule by, and gave him the Oneness (الأحدية). Therefore, He legislated that whoever disputes his rank should be killed. The Messenger of Allah, peace and blessings be upon him, said: \"If allegiance (بيعة) is given to two caliphs, kill the latter of them.\"\n\nHe placed in the Caliph’s hand the disposal of the treasury (بيت المال) and granted him general oversight. He commanded us to obey him, whether he acts unjustly toward us or justly among us. The Exalted said: <<يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ>> (O you who have believed, obey Allah and obey the Messenger and those in authority among you). These are the Caliphs and those whom the Imam appoints as deputies, for Allah has granted him the right to appoint a deputy just as Allah appointed him as Caliph. In their hands are giving and withholding, punishment and pardon, all according to the prescribed balance (الميزان المشروع). They have the power to appoint and dismiss, just as the Real holds the Balance (الميزان), lowering and raising the scale. That Balance is what He sent down to earth by His saying: <<وَوَضَعَ الْمِيزانَ>> (And He established the Balance). Then He said that the deeds of the day are raised to Him before the deeds of the night, and the deeds of the night before the deeds of the day. Likewise, the deeds of the subjects are raised to the Caliph by his officials and collectors. He accepts from them what he wills and rejects what he wills. Everything that the Real mentioned for Himself concerning the disposal of His creation, without specifying it, He granted to the Imam to dispose of among His servants.\n\nFurthermore, just as Allah appointed enemies for Himself who dispute His Divinity, such as Pharaoh and his like, so too did Allah appoint for the Caliphs those who dispute their rank. He granted the Caliph the right to fight them and kill those he overcomes, just as the Exalted does with the polytheists (المشركين). The duration of their stay is like the duration of Allah’s respite granted to them, and the Caliph’s capture and victory over them is like the time of death for those people. If you were to compare the two versions, they would not differ by a single letter in the ruling.\n\nJust as the Real judges His creation by His prior knowledge (سابق علمه), the Caliph judges by the preponderance of his opinion (غلبة ظنه), because the Caliph does not possess the rank of knowing everything that occurs in his dominion, nor does he know the truthful from the false, but rather he judges according to what the evidence (البينة) states. This is similar to what Allah does with His creation, despite His knowledge: He establishes witnesses (الشهود) against His creation on the Day of Resurrection, and He does not punish them until after the evidence is established against them, despite His knowledge. Because of this, some have said that the judge (الحاكم) should not judge based on his own knowledge. In the case of the created being, this is due to the suspicion of personal interest (الغرض). In the case of the Real, it is to establish the proof (الحجة) against the one being judged, so that He only takes him to account in the Hereafter based on the ruling He legislated for him in this world through the tongue of His Messenger, peace and blessings be upon him. For this reason, the Messenger says to his Lord, by command of his Lord: <<رَبِّ احْكُمْ بِالْحَقِّ>> (My Lord, judge with the truth), meaning with the truth by which You sent me and which You legislated for me to judge them by.\n\nIf you know that the Real has placed Himself among His creation in their position and made His most perfect manifestation (مجلاه الأتم) in the Caliph/Imam, then He said: \"All of you are shepherds (راع) and all of you are responsible for your flock (رعيته).\" This generalized the Imamate to all creation, so every person attained the rank of Imamate. He has this measure of the Real and disposes of matters according to the measure of disposal Allah has granted him. There is no human being who is not upon the form of the Real (على صورة الحق), except that in the Greater Imam (الإمام الأكبر), His manifestation (مجلاه) is clearer, his command is greater, and obedience to him is more binding.\n\nKnow that when Allah the Exalted legislated for His servants what He legislated, He divided what He legislated into an obligatory duty (فرض) that He imposed upon His accountable servants. This is of two types: an obligatory duty He imposed upon them initially from Himself, such as Prayer, Zakat, Fasting, Hajj, purification, and similar things that He obligated upon them from Himself; and another obligatory duty that they imposed upon themselves, which was not originally obligatory, but Allah obligated it upon them so that they might be rewarded with the reward of a Divine obligation, and so that Allah might confirm to us that the human being is upon His form. For Allah obligated upon Himself the support of the believers, mercy, and similar things. This is concerning the people of knowledge of Allah. As for another group, He obligated it upon them as a punishment when they obligated it upon themselves, such as vows (النذر), thereby presuming to share in the Lordship (الربوبية) in self-obligation. So He obligated it upon them to make them realize that they do not have the right to obligate things upon themselves, thereby knowing their measure.\n\nIf the Real the Exalted had not done what He obligated upon Himself to do, no blame or reproach would attach to Him for that, because His rank necessitates that He is the Doer of what He Wills (الفعال لما يريد). For this reason, the limit of obligation (حد الواجب) does not apply to His self-obligation. However, when the servant fails to fulfill the form of what Allah obligated upon him, which he obligated upon himself, the limit of obligation applies to him, just as the original obligatory duty (الواجب الأصلي) is punished if not fulfilled. Thus, his reward is great, and the punishment for failing to fulfill it is great. His recompense is great for both types of obligations.\n\nThen, actions that exceed the form of the obligatory duties are called supererogatory (نافلة), meaning an addition to the obligatory. If that excess does not have a specific form within the obligatory duties (الفرائض), it is not a supererogatory act but an independent deed (عملا مستقلا) that has a rank of reward not shared by the supererogatory acts.\n\nThen He mixed the constitution (النشأة) just as He mixed the constitution of the accountable servant. He placed within the constitution of the obligatory duties Sunan (recommended acts), which are additions to the obligatory duties. And He placed within the supererogatory acts (النوافل) that the servant performs voluntarily, without obligation, the constitution of the supererogatory acts. For this reason, if the obligatory duties are not brought complete on the Day of Resurrection, Allah says: \"Complete My servant’s obligatory duty from his voluntary acts (تطوعه).\" Thus, what is lacking from the obligatory duty is completed by the obligatory duty found within the supererogatory acts, and what is lacking from the Sunan of the obligatory duty is completed by the Sunan of the supererogatory acts. He joins everything to its like.\n\nOne of the spirits (الأرواح) asked me: \"Why are the spoils (الغنائم) called *Anfal* (supererogatory/extra)?\" We replied: There is no doubt or obscurity for any believer knowledgeable of the Law (الشرع) that Allah only ordained fighting for the believer so that the Word of Allah may be the highest (العليا) and <<وَكَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى>> (and the word of those who disbelieved be the lowest), so that the two words may be distinguished, just as the two feet were distinguished. For He created pairs of everything, in essence (ذاتا) and in ruling (حكما).\n\nThe interpreters of Allah, who are His Messengers, informed us that from the time Allah legislated Jihad, fighting, and captivity, He gave the spoils of war to the Fire (النار) as a sustenance (طعمة) with which He fed it and obligated it to it. It was part of the Fire’s obedience to its Lord that it would only consume what Allah permitted it to consume. Allah had forbidden it from consuming the spoils if there was embezzlement (غلول) by the fighters. Thus, it would not consume the spoils if embezzlement occurred until what was taken was returned, so that the deed might be pure for the fighter.\n\nWhen the Muhammadan Law (الشرع المحمدي) came, Allah added the spoils to the sustenance of the community of Muhammad, peace and blessings be upon him, beyond what He had already fed them. Thus, that sustenance which we took from the Fire became a supererogatory gift (نافلة) for this community. He did not give it to them because they fought, for if that were their right based on fighting, no one who did not fight with them would share in it. Therefore, it is not an obligatory duty (فريضة) for the fighters; rather, it is sustenance that Allah fed to those mentioned, and He made a share for Himself because He granted them victory. Thus, He has a share in the Jihad. Since the reason Allah made a share for Himself was His support for the religion of Allah, everyone who supported the religion of Allah—namely, the fighters (الغزاة)—is included in Allah’s share.\n\nIf the verse is considered, they only have the fifth of the spoils. The remaining four-fifths are then divided into five parts again: one fifth for the Messenger of Allah, peace and blessings be upon him, and after the Messenger, for the Caliph of the time if the Messenger is absent; the second fifth for the family of the House (أهل البيت), the relatives of the Messenger of Allah; the third fifth for the orphans (اليتامى); the fourth fifth for the poor (المساكين); and the fifth fifth for the wayfarer (ابن السبيل).\n\nIt has been reported from some scholars—and I believe it is Ibn Abi Layla—that the portion, which is the fifth of the total, the Messenger of Allah, peace and blessings be upon him, would take and give to the Ka’ba, saying, \"This is for Allah,\" and then divide the remainder.\n\nSince this sustenance was for the Fire, Allah transferred it to this community, just as He made Zakat in a person’s wealth a right for specific categories. He obligated the owners of wealth to give it out in a specific manner and obligated the Imam to take it, but He did not obligate the categories of recipients to take it. They are free to take their right or leave it, like all other rights. Whoever takes it has taken his right, and whoever leaves taking it has left his right, and he is entitled to do so.\n\nKnow that the Imam is the one required to know these divisions and uphold them.\n\n> Not everyone who possesses beauty is Joseph,\n>\n> Indeed, the beautiful one is the just Imam.\n>\n> If you realize what you desire and wish for,\n>\n> You are the lover, and the innocent one is Joseph.\n\nIf the Imam’s preponderance of opinion (غلب على ظن الإمام) is that the categories mentioned in the verse <<وَاعْلَمُوا أَنَّما غَنِمْتُمْ>> and the verse in Surat al-Hashr, which mentions the categories, have their share of the spoils as only the fifth, which is divided among them thus, and the remainder is for the Muslim treasury (بيت مال المسلمين), the Imam may dispose of it as he sees fit. If he wills, he gives it to the fighters according to the justice and equality he desires in the division, or by preference, just as he does with the remaining inherited wealth after the rightful heirs have taken what the Real specified for them. Or, this Imam may wish to return the remainder to the relatives (أولي الأرحام) of the deceased, giving the rightful heirs an addition to their shares because they are the relatives of the deceased.\n\nIf the Imam’s preponderance of opinion is that the original fifth is for Allah alone, and the remainder is for those whom Allah named, then Allah has made a share for those who strive in the way of Allah (المجاهدين في سبيل الله) in the charities (الصدقات), but He did not make a share for them in the spoils except what the Imam grants them before the division, or what He gave him by His saying: \"Whoever kills a slain person, his belongings (سلبه) are for him.\"\n\nWe only presented this discussion in this station (manzil) because of the portion attributed specifically to Allah therein. Our purpose is not the ruling concerning the spoils and their division in the science of jurisprudence (علم الرسوم). Rather, the spoils (المغانم) in this path (الطريق) are the Divine Sciences (العلوم الإلهية) that Allah grants us through spiritual struggle (مجاهدة وجهاد نفس), just as the believer has a trade in his faith itself, which is the trade that saves from painful punishment.\n\nEvery knowledge gained through struggle is a spoil (مغنم) and is divided according to how spoils are divided.\n\nThe portion that is for Allah the Exalted is that which relates to Sincerity (الإخلاص).\n\nThat which is for the Messenger of Allah is the belief (الايمان) in him.\n\nThat which is for the close relatives (ذي القربى) is the love (المودة) for them.\n\nThat which is for the Orphans (اليتامى) is the knowledge gained before the worker reached the goal (الغاية). The limit of the goal is that which makes him independent of attributing the deed to himself. For the child before puberty, his movement and actions are attributed to him. When he reaches maturity, the ruling of the actions reverts from him to Allah, after they were attributed to him. The Prophet, peace and blessings be upon him, said: \"There is no orphanhood after maturity (حلم).\" Thus, everything he gained before maturity is his right from himself, since his essence (عينه) is for Allah.\n\nThat which is for the Poor (المساكين) is the portion they gained through helplessness (العجز), lack of ability, and the stripping away of power, for Allah is <<ذُو الْقُوَّةِ الْمَتِينُ>> (The Possessor of Strength, the Steadfast).\n\nThat which is for the Wayfarer (ابن السبيل) is the portion he has by virtue of being a child of the path to Allah. The Prophet, peace and blessings be upon him, said: \"Indeed, the world has children, and the Hereafter has children, so be among the children of the Hereafter.\" They are the children of the path (أبناء السبيل), so do not be among the children of the world.\n\nAs for the form of Sincerity (الإخلاص) in the deed, it is that you realize through Unveiling (كشفا) that the agent (عامل) of that deed is Allah, as it is in reality, whatever that deed may be, whether blameworthy or praiseworthy. That is the ruling of Allah the Exalted concerning it, not the essence of the deed itself.\n\nIt is clarified in the Hadith that Allah the Exalted says: \"Whoever performs a deed in which he associates another with Me, I am free of it, and it belongs to the one he associated.\" He left the deed indefinite and did not specify one deed over another. The pronoun *in it* (فيه) refers to the deed, and the pronoun *of it* (منه) refers to the other, who is the partner (الشريك), and the pronoun *it* (هو) refers to the one who associated. For Allah does not disavow the deed, since He is the Agent without doubt. Rather, He disavows the partner because the partner is non-existence (عدم) and Allah is Existence (وجود). Thus, Allah is free of non-existence, for non-existence does not attach to Him, nor is He described by it, since He is the Necessary Existent by His Essence (واجب الوجود لذاته). The disavowal is therefore sound. Likewise, in His saying: <<بَراءَةٌ من الله ورَسُولِهِ إِلَى الَّذِينَ عاهَدْتُمْ من الْمُشْرِكِينَ>> (A disavowal from Allah and His Messenger to those with whom you had made a treaty among the polytheists), this is also a disavowal of the partner, because the partner is not there; he is non-existence, since He said \"among the polytheists.\"\n\nThus, the Sincerity of the deed to Allah is Allah’s portion of the deed, because the apparent form (الصورة الظاهرة) of the deed is only in the person through whom Allah manifested His deed. The matter becomes confused due to the apparent form, and we do not doubt that the deed, by Witnessing (الشهود), is manifest from it, so it is a sound attribution. For this reason, we say that He is the essence of everything from His Name, the Manifest (الظاهر).\n\nHere is a subtle proof: the sight only falls upon an instrument (آلة), and this instrument is directed by another matter upon which the apparent sense does not fall, as evidenced by death and the existence of the instrument while the action is stripped away. Therefore, the instrument is not the agent (العامل), and the sense only perceives the instrument. Just as the judge knows that behind the sensible thing there is a matter that is the agent acting through this instrument and directing it—expressed by the scholars of rational speculation (النظر العقلي) as the rational, speaking, and animal soul (النفس العاقلة الناطقة والحيوانية)—they have thus moved to a meaning that is not among the perceptions of the sense. Likewise, the perception of the people of Unveiling (الكشف) and Witnessing (الشهود) in the state of Gathering (الجمع) and Being (الوجود) concerning the rational soul is exactly what the people of speculation perceived concerning the sensible instrument. They knew that the Agent behind the rational soul is the One named Allah, and the soul in this action is exactly like the sensible instrument, both for the people of Allah and the people of rational speculation.\n\nUnless this realization is attained, the person is not described by us as having achieved complete Sincerity (أخلص في عمله), despite the existence of the instruments and their disposal for the manifestation of the form of the deed from the agent. The entire cosmos (العالم) is the instrument of the Real concerning the actions that issue from it, for a people who know.\n\nThe Messenger of Allah, peace and blessings be upon him, said in an authentic narration: \"Do you know what is the right of Allah upon His servants?\" They said, \"Allah and His Messenger know best.\" He said, \"The right of Allah upon His servants is that they worship Him and associate nothing (شيئا) with Him.\" Then he said, \"Do you know what is their right upon Him if they do that? That He admits them to Paradise.\"\n\nThe Prophet, peace and blessings be upon him, used the indefinite term \"nothing\" (شيئا) to include all things, which is similar to the saying of the Exalted: <<فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً>> (Whoever hopes for the meeting with his Lord, let him do righteous work and not associate anyone (أحداً) in the worship of his Lord). He used the indefinite term \"anyone\" (أحد) to include everything that has oneness (أحدية), and there is nothing that does not have oneness. He mentioned the meeting with Allah to indicate the state of satisfaction (الرضي) without reservation, as the Messenger of Allah, peace and blessings be upon him, mentioned, and that is in Paradise, for it is the Abode of Satisfaction (دار الرضوان). Not everyone who meets Allah is happy, for the contexts (المواطن) have a ruling in that, according to what Allah has placed in them.\n\nLikewise, the saying of the Exalted: <<لَنْ يَنالَ الله لُحُومُها ولا دِماؤُها ولكِنْ يَنالُهُ التَّقْوى‏ مِنْكُمْ>> (Their meat will not reach Allah, nor will their blood, but what reaches Him is piety (التقوى) from you). He made piety what reaches Him from us. Thus, the Real has informed His servants of His portion in everything they are engaged in. He made a covenant with His servants concerning that, saying: <<وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ>> (Fulfill My covenant, and I will fulfill your covenant). His portion from you is that you fulfill what He covenanted with you, which is His saying, peace and blessings be upon him, concerning the five prayers: \"Whoever performs them without neglecting any of their rights, he has a covenant with Allah that He will admit him to Paradise.\"\n\nThe Prayer is communion (مناجاة) with Allah according to the division He legislated between the Exalted and His servants. Whoever gives Him His portion from it and takes his portion from it has given Him His right and His share.\n\nIf Allah the Exalted, despite being described by independence from the worlds (الغنى عن العالمين), has made for Himself a share and a specified portion in what belongs to the world and what the world is in need of, then what do you think of one whose origin is poverty (الفقر) and destitution (المسكنة) in the manifestation of his essence (ظهور عينه), not in his essence (عينه) and his existence? We said \"not in his essence\" because their immutable essences (أعيانها) are not made by a maker. Rather, it is in the states (الأحوال) upon which they operate—of existence, non-existence, and so forth—that poverty occurs toward the One who manifests their ruling in that essence. Know this.\n\nWhoever seeks his right and demands it fully is not to be blamed. However, since He legislated for us concerning some rights that if we abandon them, it is greater for us, and He made that among the noble traits of character (مكارم الأخلاق) and attached to it the reward from the Exalted, which is His saying: <<فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله>> (But whoever pardons and makes reconciliation—his reward is due from Allah). And whoever seeks his right, which is His saying: <<ولَمَنِ انْتَصَرَ بَعْدَ ظُلْمِهِ فَأُولئِكَ ما عَلَيْهِمْ من سَبِيلٍ>> (And whoever defends himself after having been wronged—for them there is no cause for blame), he is entitled to that.\n\nLikewise, He deals with His servants concerning what they neglected of His right and His rights: He pardons, overlooks, and reforms, so the matter leads to the Mercy of Allah in both abodes, and Mercy encompasses them wherever they are. However, they are not equal in it. The Exalted said: <<أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ سَواءً مَحْياهُمْ ومَماتُهُمْ ساءَ ما يَحْكُمُونَ>> (Or do those who commit evil deeds think that We will make them like those who have believed and done righteous deeds—that their living and their dying will be equal? How wretched is their judgment). Just as the Exalted did not equate those who know and those who do not know.\n\nThe perfect servant (الكامل) is one who does not leave any right that Allah has upon him or with him unfulfilled, but renders Him His portion in everything in which He has a share, according to the limit He legislated for him. When he fulfills it, Allah returns to him everything that He mentioned as belonging to him by the Law. When Allah fulfills His covenant with him, he takes it from Him as a refusal and an initial grace, not as a recompense. This only occurs for the people of knowledge of Allah (العلماء بالله) who know the matter as it truly is. They are individuals among creation whom none knows but Him.\n\nI have alerted you to the most perfect paths for attaining the happiness above which there is no happiness. Yet, O living one, the matter is immense, the affair is grave, and the difficulty in it is greater. For this reason, the people of Allah made the ultimate goal to be Bewilderment (الحيرة), which is helplessness (العجز).\n\nThis much is sufficient knowledge that Allah truly has a right and a portion with His servants, which He demands from them by right of entitlement, and He also demands the rights of others from them by right of agency (الوكالة), as He said: <<وَيَأْخُذُ الصَّدَقاتِ>> (and accepts the charities) by right of agency, and He increases and fructifies them. He is an agent concerning the right of some people, out of His own grace and mercy toward them, even if they did not appoint Him. And concerning the right of others, He is an agent by their appointment, as He commanded them to take Him as an agent. Otherwise, the servant would not have the audacity to appoint his Master as an agent. When He graciously offered this to His servants and descended to them from His Grandeur (كبريائه) with His subtle kindness, they took Him as an agent, and this descent bequeathed them a sense of intimacy (إدلالا).\n\nAs for the Hadith, \"Allah accepts only what His servant comprehends (عقل) of his prayer,\" it means that it supports the fulfillment of Allah’s right in what was incumbent upon him. He made the maximum of this portion the half, which is the limit He specified for Himself from His servant’s prayer, and the minimum the tenth. He said: \"Its tenth, its ninth, its eighth, its seventh, its sixth, its fifth, its quarter, its third, its half.\" He only mentioned the half concerning the Fatiha. We understood the meaning, so we generalized it to all the actions and words of the Prayer, indeed, to all the deeds with which we are charged.\n\nAs for what He specified, it is confined to the Fatiha, which has nine parts:\n1. <<بِسْمِ الله الرَّحْمنِ الرَّحِيمِ>> (In the Name of Allah, the Most Gracious, the Most Merciful)\n2. <<الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (All praise is due to Allah, Lord of the worlds)\n3. <<الرَّحْمنِ الرَّحِيمِ>> (The Most Gracious, the Most Merciful)\n4. <<مالِكِ يَوْمِ الدِّينِ>> (Master of the Day of Recompense)\n5. <<إِيَّاكَ نَعْبُدُ>> (You alone we worship)\n6. <<وإِيَّاكَ نَسْتَعِينُ>> (and You alone we ask for help)\n7. <<اهْدِنَا الصِّراطَ الْمُسْتَقِيمَ>> (Guide us to the straight path)\n8. <<صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ>> (The path of those upon whom You have bestowed favor)\n9. <<غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ ولا الضَّالِّينَ>> (Not of those who have evoked [Your] anger or of those who are astray)\n\nThe loser, the one heedless of his prayer, is he who was not present with Allah in even one of these parts we mentioned in the Fatiha, which are those Allah mentioned for acceptance, from the tenth to the half.\n\nWhoever considers <<بِسْمِ الله الرَّحْمنِ الرَّحِيمِ>> to be a verse of the Fatiha and does not separate it from it, the division is as we mentioned in the Fatiha. For Allah’s ruling concerning things is the ruling of the one who exercises independent judgment (المجتهد), and He is with him in his judgment. Whoever’s judgment leads him to separate the Basmala from the Fatiha, believing the Basmala is not a verse of it, Allah grants him the ninth part, <<ولا الضَّالِّينَ>>. The Basmala is more deserving and preferable, for it is undoubtedly part of the Qur’an according to the people of knowledge of Allah, and its repetition in the chapters is like the repetition of other words in the Qur’an.\n\nWhat exceeds the nine parts is the comprehension of the letters of the word during recitation. The worshipper may comprehend one letter of the word and then become heedless of the rest. This is the meaning of the general saying of the Prophet, peace and blessings be upon him, that only what is comprehended of it is accepted. The rational one is he who performs it completely so that Allah accepts it completely.\n\nWhoever falls short in his prayer, it is compensated for him from his recitation of the Fatiha in his supererogatory prayers. If his recitation in the supererogatory prayers is insufficient to compensate for what he lacked in the recitation of the Fatiha in the obligatory prayer, it is completed for him from his recitation with presence outside of the specified prayer. If he is in all his actions in a state of prayer, then he is among <<الَّذِينَ هُمْ عَلى‏ صَلاتِهِمْ دائِمُونَ>> (those who are constant in their prayer), who remember Allah at all times. They are in communion (مناجاة) with Him in all states.\n\nAllah’s portion of everything He charged His servants with is what He obligated upon them. The servants’ portion from Allah is what the Real obligated upon Himself for them. The supererogatory act (النافلة) is for the supererogatory act in all of that.\n\nAs for the portion of the Messenger, peace and blessings be upon him, in this matter, it is by believing in him (تصديقه) and having faith in what he brought. What confirms this faith is that the best of times are the time of Prayer and the Call to Prayer (الآذان), and the best of intercession and speech is what the Most Gracious permits in them. This is what the Messenger of the Real brought to us and came forward with, descending when He disclosed Himself (تجلى). He did not strike him unconscious, but rather awakened him from the disclosure so that he might disclose himself. So he accepted and did not turn away.\n\nAs for believing in him, it is due to the Real’s report that he is a Messenger from Him to us, and he is the honored and near one (الوجيه المقرب). As for faith in what he brought, it is due to his reporting from the Real. Thus, there is a difference between the Real’s report concerning faith in Him and His report concerning what the Messenger brought. No one believes in him except one whom the Real addresses in his secret (سره), even if the addressed person does not perceive it or know who spoke to him, but merely finds the confirmation of it in his heart. The people of Unveiling (الكشف) and Presence (الحضور) know through hearing with ears and hearts the speech of the Real that this is a Messenger from Him, so they believe in him with insight (بصيرة).\n\nNo one believes in what this Messenger brought except one whom the Messenger addresses in his secret, even if the addressed person does not perceive it or know who spoke to him, but merely finds the confirmation of what he brought in his heart. The people of Unveiling and Presence know through hearing with hearts, ears, and eyes the speech of the Messenger that this came from Allah, for <<وَلَوْ كانَ من عِنْدِ غَيْرِ الله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً>> (And if it had been from [any] other than Allah, they would have found within it much contradiction). So they believe in it with insight.\n\nWe mentioned \"eyes\" concerning what the Messenger brought, but we did not mention that concerning hearing the speech of the Real, because when we see the Messenger, we have seen him. The Exalted Real is not like that; when we see Him, we only see our station and our form (صورتنا) from Him. For this reason, we did not mention \"eyes\" concerning the confirmation of His report when He speaks to us. We only brought \"hearts and ears\" for the report specifically, not because the Real spoke it, for the perception of hearts, ears, and eyes of the Real is equal: no one in the world perceives any perception, whether this or other, except his station from the Real and his form specifically. We mentioned the hearts as hearing and the ears for the report specifically, as an alert to what we have mentioned and clarified.\n\nIf you know this, you have fulfilled the right of Allah and the Messenger that was incumbent upon you to render to Allah and His Messenger. Indeed, a group of the people of Allah erred in this matter because they did not report it from Allah, so how about the scholars of jurisprudence (علماء الرسوم)? Whoever speaks about this through the path of faith only speaks about it as we have spoken, for he speaks from direct experience (ذوق).\n\nFor this reason, you see two, or even three, people witnessing a miracle at the hands of the Messenger, which the Real manifested as a sign of his truthfulness in what he brought and in confirming his person. One of the three is certain that it is the truth but denies it. The second does not find that sign established for him due to his ignorance of the point of significance in it. The third believes and confirms. The gathering is one, the visual perception is one, and the apparent realization is one. Thus, we know that the one who believed and confirmed would not have believed in what he brought or confirmed him unless the Real had disclosed Himself (تجلى) to his heart and informed him without intermediary. He would have been like his companion.\n\nLikewise, in his faith in what he brought. Not every believer knows how faith was attained by him, especially since we have seen and been informed that some who believed in the Messenger of Allah when they saw him and heard his call did not see a miracle or sign, but merely found in themselves that he was truthful in his claim, so they believed in him immediately and did not hesitate or stammer. This was only due to the disclosure to his heart, even if he did not perceive that it was a disclosure. By this measure, the people of Unveiling (أهل الكشف) surpass other believers. If not for their unveiling of matters, they would not have distinguished them thus.\n\nThe Messenger’s portion is that he is joined to his Lord, both in his person and in what he brought from Him.\n\nAs for the portion of the Orphans (اليتامى) in this knowledge, it is, in reality, the time of maturity (بلوغ) and the departure from the claim of ownership over what was yours. Your portion before the arrival of this time is that your actions are attributed to you, and you are not challenged, stripped of them, or restricted (تحجير) concerning them. When the time of maturity arrives, you become restricted, and the rulings of the Real apply to all your movements, because they are His actions manifested in you. If they had not manifested in you, this address and this judgment would not have applied to them.\n\nThe meaning of \"manifested in you\" is the very claim that the actions belong to you. The Real intended by the restriction (تحجير) of the obligation to make you realize that if these actions were truly your confirmed property, it would not be permissible for Me to dispose of what is yours and not Mine. The reason for this is that the time of the maturity of the intellect (العقل) has arrived, and the strengthening of reason and speculation has occurred. It should have been incumbent upon you, by the intellect Allah gave you, to see that your actions, which are the locus of manifestation from you, belong to Allah the Exalted and are not yours. If this had occurred to you initially, He would not have obligated you or restricted them in this abode. Do you not see that one whose intellect is not strong is not restricted or obligated? This is the madman (المجنون) whose intellect is veiled from him, so he has no ruling applied to him. Likewise, the sleeper and everyone who is not described by intellect.\n\nWhen he reaches the limit in this abode that necessitates obligation due to the establishment of this attribute, if the veil is lifted from him in this abode, the restriction and the address of the Law are not removed from him, due to the ruling of the abode, not the ruling of the state. This is because analogy would dictate the removal of restriction from one who is in this state, but the abode must have a ruling. This is like what is done with the children of polytheists and disbelievers: we attach them to their fathers due to the abode, even though we know they are upon the primordial nature (الفطرة) and did not associate or disbelieve. The abode has a ruling.\n\nWhen the promise of the Hereafter comes and we move to it, we exit the ruling of the abode, and the ruling of obligation is removed from us in the Abode of Satisfaction (دار الرضوان) and its counterpart. Likewise, whoever Allah informs in this abode of his happiness, and another of his wretchedness, this informing does not remove the restriction or the obligation from them, because the fundamental establishment of the laws (النواميس) in this abode is for the benefit of this world and the Hereafter. It is impossible to remove the restriction as long as the world and those in it endure. If not for this, whoever had the veil lifted from him would have the restriction removed, because he sees no agent but Allah, and a thing does not restrict itself, even if it obligates upon itself what it obligates. That is merely to make us feel at ease concerning what we obligate upon ourselves for our own benefit. If we obligate it for Him, He obligates it upon us so that we may be distinguished, and thus disobey by abandoning it. If the Real were to abandon what He obligated upon Himself, He would not incur this ruling, for this ruling only attaches to one upon whom it is imposed by another. If the Real had not obligated upon us what we obligated upon ourselves, we would not be disobedient if we abandoned it. If one who was not obligated by another fulfills it, it is a favor (منة) from him, a grace, and noble character.\n\nIf you say this is only if it is good, we say there is only good, and good is of two types: pure good, which has no evil in it, and mixed good, which contains a degree of evil, as we explained concerning the forced drinking of medicine, or like the believer who disobeys and obeys. The believer’s disobedience is never pure without obedience, for the belief that it is disobedience is itself obedience. In this is an alert <<لِمَنْ كانَ لَهُ قَلْبٌ>> (for whoever has a heart).\n\nThe matter in the Hereafter reverts to the state the orphan was in before maturity. We mentioned the orphan, even though every child below maturity is like that despite not being an orphan, because the orphan is under the management of his guardian (ولي), and the guardian is Allah, for He is the Guardian of the believers. The non-orphan is under the management of his father, and attention is not paid to him while his father exists, because the branch draws sustenance from its nearest origin. Do you not see that the fruit knows no origin except the branch of the tree, because it draws sustenance from the branch, and the branch knows the origin that the fruit is ignorant of? The orphan knows that his father has passed away, so his heart is broken, and he has no origin to guide him. The people of knowledge of Allah inform him that he has no one but the One who was for his father, which is Allah. So he reverts to Allah in his affairs.\n\nSince the orphan’s state with Allah is like this in his person, Allah made a portion for him in the spoils so that what is his may be fully provided for him, which is the child’s perception of the attribution of actions to himself and the absence of restriction concerning them. Whoever strokes the head of an orphan receives a good deed for every hair, and this is not the case for the non-orphan.\n\nThe ruling of the Poor (المسكين) is the ruling of the orphan in lacking a visible helper. Allah strengthens his weakness (قوى الله ضعفه), meaning He adds weakness to his weakness, for the created being is weak by original principle. When Allah adds weakness to his weakness, he becomes poor (miskin), so he has no arrogance (صولة). If he acts arrogantly while being poor, Allah hates him, for he has manifested what contradicts his state. He has burdened himself with what his station does not necessitate. For this reason, the Messenger of Allah, peace and blessings be upon him, said: \"Three whom Allah will not speak to, nor look at on the Day of Resurrection, nor purify them, and for them is a painful punishment: a lying king, an aging adulterer, and a poor man who is arrogant (عائل مستكبر).\"\n\nMeaning, he has exaggerated in arrogance, just as Allah has exaggerated the poor man in weakness. For by being poor, he possesses two weaknesses: the weakness of origin and the weakness of poverty. He cannot raise his head due to this weakness, unlike the owner of wealth, who finds strength in his wealth. For this reason, wealth (المال) is called *mal* because it inclines (يميل) its owner, either toward good or toward evil; it does not leave him in a state of equilibrium.\n\nThe poor person (مسكين) is one who is still (سكن) under the flow of Divine Decrees (مجاري الأقدار), who looks at what the ruling of Allah brings forth night and day, and is content with what Allah has decreed for him and upon him. He knows that there is no refuge from Allah except in Him, and that He is the Doer of what He Wills (الفعال لما يريد), and he is certain that his portion from Allah is what he is currently upon. So Allah mends his brokenness by His saying: \"I am with those whose hearts are broken (المنكسرة قلوبهم).\" For when you come to one whose heart is broken, you find no companion with him but Allah, in state and in word.\n\nThus, He made a portion for him in the spoils, even if he did not exert effort in them. Others served, and he attained comfort through what Allah delivered to him from the effort and toil of others. This is like the believer who has no knowledge but is among the people of Paradise. He sees the stations of the people of knowledge of Allah while in the Standing (الموقف) and feels regret and remorse. Allah then turns to one of the people of the Fire who was knowledgeable, strips him of his garment of knowledge, and clothes this believer with it, so that he may ascend by it to the station of that knowledge in Paradise. This is because every knowledge has a station in the Gardens, and only one who possessed that knowledge may enter it, for knowledge seeks its station in the Gardens. The scholar who possessed this knowledge is among the people of the Fire who belong there. Knowledge does not subsist by itself to descend by itself into that station, so it must have a locus to subsist in. Allah clothes this fortunate believer who has no knowledge with it, and the knowledge ascends with him to its station. How great is that regret!\n\nHowever, you must know which knowledge is stripped from this person who belongs to the Fire. It is that if he possessed knowledge in reality, but doubt (شبهة) entered upon him concerning it in this world—as for his bewilderment (حيرته), it is in the place of speculation. As for its removal from him, despite his knowledge of what he was upon, he believed in this world that it was ignorance. When he is in the Hereafter, he knows that it was knowledge. That is the knowledge that is stripped and bestowed upon this non-scholar who is among the people of Paradise.\n\nIf the matter is as we mentioned, Allah does not leave with the people of the Fire who belong there, at the time of death, anything but the knowledge appropriate for the people of the Fire. As for the other types of knowledge that are only suitable for the people of Paradise, Allah causes a doubt to enter upon the scholar who possesses it in this world or at the time of death, which removes him from the knowledge or causes him bewilderment. Then he dies upon that, even though it was knowledge in reality. This type of knowledge is what is bestowed upon the people of the Gardens if they did not possess knowledge of it in this world. The person who knew it among the people of the Fire desires it, but the proof is established against him that he died upon doubt. This is the portion of the Poor (المسكين) from the spoils, for the one from whom it was stripped due to doubt struggled and toiled, but when he gained the spoil and doubt entered, that knowledge became the portion of the poor.\n\nAs for the Wayfarer (ابن السبيل), the children of the path are the highest groups with Allah. The son cannot deny his father. He is only called the child of the path because he knows that settling (المنزل) is impossible, and stability upon one matter is impossible, neither concerning himself, nor concerning the Theophany (تجلى ربه) of his Lord, nor concerning his Lord, because He is in perpetual creative activity (في شأن خلقه), and the matter concerning them is always new. Whoever’s foot is not stable must be walking, meaning moving, and he only moves on a road, which is the path (السبيل). His walking is perpetual, in this world and the Hereafter, so he is the child of the path in this world and the Hereafter. Since he is devoted to his path, preoccupied with it, and traveling in it, and the traveler must have provision (زاد), Allah made a portion for him in the spoils. The Real nourishes him with what he did not exert effort for.\n\nThe Wayfarer in this verse may also be the fighter (المجاهد) himself, and the Path (السبيل), due to the definite article, refers to the Path of Allah (سبيل الله) about which Allah said: <<ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله>> (And never think of those who have been killed in the cause of Allah), meaning the martyrs who were killed in Jihad. Thus, the fighter’s portion of the spoils is also the measure specified for the Wayfarer, which is known, in addition to what he has in the charities (الصدقات). Know this, for it is a fine alert, <<إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ>> (if you have believed in Allah) and in what Allah revealed to His servant on the Day of the Criterion (يوم الفرقان). He distinguished between the two groups (القبضتين) by the two words that appeared in the Throne (الكرسي) by the two Feet, since the people of Allah, who are the children of the Hereafter, are the children of the path <<بِالْعُدْوَةِ الدُّنْيا>> (on the near side) to Allah, by attaining nearness (القربة) and a high station (الزلفى) from Allah. And <<وَهُمْ بِالْعُدْوَةِ الْقُصْوى>> (and they are on the farther side) from Allah, and they are the children of the life of this world and the children of its path. <<وَالرَّكْبُ أَسْفَلَ مِنْكُمْ>> (And the caravan was lower than you). He made the lower position for them, since <<وَكَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى>> (the word of those who disbelieved was the lowest). Whoever is lower than you, you are higher than him, because you are the people of Allah who have happiness, since the Word of Allah is the highest (العليا). All of this is by the decree and judgment of Allah, not due to any prior effort, but due to a preceding Divine care. Allah the Exalted says: <<إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ>> (Indeed, those for whom the best [reward] has preceded from Us—those will be removed therefrom).\n\n> Behold, the people of Allah are on the near side (بِالْعُدْوَةِ الدُّنْيا),\n>\n> Just as the people of polytheism are on the farther side (بِالْعُدْوَةِ الْقُصْوى).\n>\n> For the one whom He distanced is distinguished by the lowest,\n>\n> And the one whom He brought near has triumphed with the highest.\n>\n> Do you not observe that the caravan is lower than them?\n>\n> So every party is brought near from its station.\n\nSince we saw that Allah specified the fifth for Himself in such a context and in the division of this type, which is the spoils, we knew that Allah only observed the divisions considered in the army at the time of encounter, by virtue of His being a King, the Subduer (ملكا قاهرا), where He established enemies who dispute Him. The division of the army at the encounter is into five parts: the Heart (قلب), which is the position of the Imam, and which Allah chose from the constitution of His servant when He said: \"My servant’s heart encompassed Me (وسعني قلب عبدي).\" The remainder is the right flank (ميمنة), the left flank (ميسرة), the vanguard (مقدمة), and the rear guard (ساقة). For this reason, the fifth was for Allah, and the remaining four-fifths were for the rest.\n\nThe enemy that Allah established informed us that he comes from before us and behind us, so we meet him with the vanguard and the rear guard, and from our right, so we meet him with the right flank, and from our left, so we meet him with the left flank. The enemy’s only objective is the Heart, to remove the King of the army from the Heart. He has no objective but this. So Allah defends the heart of the servant, which is the locus of His gaze that encompassed Him, by means of those whom He arranged in these places from which the enemy enters. This army fights on His behalf. This is His saying, peace and blessings be upon him: \"Indeed, the one who fights in the way of Allah is he who fights so that the Word of Allah may be the highest (العليا) and the word of those who disbelieved be the lowest (السفلى),\" and they are the enemies. He supports them from the Heart inwardly, and they defend Him outwardly from the directions where the enemy seeks opportunity. From this perspective, He has the fifth of the spoils, which He specified as His portion, because He is the Helper of the believers against their enemies, and the army is the helper of His religion. <<ذلِكَ بِأَنَّ الله مَوْلَى الَّذِينَ آمَنُوا وأَنَّ الْكافِرِينَ لا مَوْلى‏ لَهُمْ>> (That is because Allah is the Protector of those who believe, and because the disbelievers have no protector). Thus, they have no Heart to support them.\n\n> Indeed, Allah has an ample portion,\n>\n> It is the fifth of the booty (الفيء), without addition.\n>\n> For Him is the Heart (القلب) that He inhabits,\n>\n> And it is the Glorious Divine Throne (العرش الإلهي المجيد).\n>\n> And what remains, He has divided it,\n>\n> As a specification from Him among some servants.\n>\n> So whoever attained what my pen has inscribed,\n>\n> Has triumphed with what Existence (الوجود) grants.\n>\n> Whether a Messenger or an inheriting Friend of God (ولي وارث),\n>\n> He has nothing in our knowledge but Witnessing (الشهود).\n>\n> And what Allah knows,\n>\n> I have no knowledge of it unless He grants it generously.\n\nIn this station (manzil) is the knowledge of whether a single knowledge relates to all known things, or whether every known thing has a specific knowledge, or whether it differs relative to the knower. And what is knowledge? Is it the Essence (ذات) of the knower, or an Attribute (صفة) subsisting in him, or a relation (نسبة) that is neither the Essence nor the Attribute?\n\nIn it is the knowledge of what affinities (المناسبات) between things lead to, in terms of harmony and gathering.\n\nIn it is the knowledge that whoever acts with your action is from you.\n\nIn it is the knowledge of reliance (الاستناد), the protection of the one relied upon, sharing in hardship, and abandoning what one sees fit to abandon, even if it is beloved to you, and the faith that nothing can shake.\n\nIn it is the knowledge of what noble traits of character (مكارم الأخلاق) necessitate for the one who possesses them, and the knowledge of the Stations (المقامات) and what is specific to this station.\n\nIn it is a knowledge that is a slippery slope (مزلة قدم), which grants you to be with everyone who desires something from you, but only to be for him in what he desires from you. It is a slippery slope due to the difference in objectives and the restriction of the believer by the ruling that has been entrusted to him.\n\nIn it is the knowledge of what one should prepare for and what one should not prepare for.\n\nIn it is the knowledge of how to deal with one whose affair you are ignorant of.\n\nIn it is the knowledge by which one knows that nothing confronts you from the cosmos or from the Real except your own attribute (صفتك).\n\nIn it is the knowledge of joining the heads to the tails in ruling, which is the state in which the leader and the led are equal, like the middle species (النوع الوسط) which is a species for what is above it and a genus for what is below it.\n\nIn it is the knowledge of incitement (التحريش) and then disavowal (التبري) from it: whether that disavowal is beneficial or not.\n\nIn it is the knowledge of perceiving the Imagination (الخيال) in the form of the sensible thing in the waking state (اليقظة), where there is no sensible thing imagined from outside or inside, but it is like the mirage (السراب) that you see as water, or like the small thing in the mirage that you see as large, or like the white mountain that you see as black from afar. This is outside of sense and imagination.\n\nIn it is the knowledge of the reason that prompts a person to pray for his own destruction and to seek a sign in himself of what will ruin him.\n\nIn it is the knowledge of what one imagines he is capable of but is not capable of, and why the inability (الإعجاز) occurs: whether it reverts to something no created being can do, or to something he was capable of but was then diverted from.\n\nIn it is the knowledge of what piety (التقوى) produces in the pious person.\n\nIn it is the knowledge of the difference between the Messenger of Allah, peace and blessings be upon him, and the believers.\n\nIn it is the knowledge of what the speaker desires from the addressed person when he speaks to him.\n\nIn it is the knowledge of what appears to be for Allah but is for the cosmos, and what appears to be for the cosmos but is for Allah.\n\nIn it is the knowledge of directions (الجهات), encompassing (الإحاطة), stillness (السكون), and movement (الحركة).\n\nIn it is the knowledge of the benefits of the Hereafter.\n\nIn it is the knowledge of the reason that necessitates security (الأمان) in a place of fear: whether that is sound or not, and what is the meaning of the place (الموطن)—is it the state (الحال) in the person, so his place is his state, or is the place external to the state?\n\nIn it is the knowledge of the causes that necessitate the existence of the ruling illusions (الأوهام الحاكمة) in the souls, which are forms of the Divine Theophanies (صور التجلي الإلهي).\n\nIn it is the knowledge of what is praiseworthy in asking and what is disliked.\n\nIn it is the knowledge of righteousness (الصلاح) and observing what is most righteous, and upon whom that is incumbent.\n\nIn it is the knowledge of the promise and the threat (الوعد والوعيد), and with whom fighting is legally required when the two armies meet and the people are lined up for battle. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو چھہتر: حکمی حضور (الحضرة الحكمية) میں اس منزل کی معرفت میں جو اولیاء اور اعداء (دشمنوں) کو جمع کرتی ہے، اور عالم غیب (عالم الغيب) کے بعض کا بعض سے مقابلہ کرنا۔ اور یہ منزل ایک ہزار مقام محمدی (مقام محمدي) پر مشتمل ہے۔\n\n> بے شک غنیمتیں حق (الحق) کی آگ ہیں جو انہیں کھا جاتی ہے\n> پس جو اس کا بدل ہو جائے وہ محفوظ ہو گیا\n> اس آگ کا اس پر کوئی تسلط نہیں\n> پس وہی مخلوق میں اس کا نائب ہے جس نے حکم دیا\n> اور جو گزر گیا وہ قیامت کے دن اس نسخ سے منسوخ ہو جائے گا جو مقرر کیا گیا\n> پس سب اپنی منزل میں لذت پاتے ہوئے نعمتوں میں ہوں گے\n> اہل جنت، اہل نار اور قدیم لوگ\n> جس کا حصہ علم اور معرفت (المعرفۃ) نہ ہو\n> تو وہ خواہش کے میدان میں آگے نہیں بڑھا\n> اللہ اسے اپنی رحمت کے علم سے رزق دیتا ہے\n> ایسا حصہ جو ہمیں علماء کی منزلوں تک پہنچا دے۔\n\n### [بے شک اللہ کے لیے اپنے بندوں کے حصوں میں سے ایک وافر حصہ ہے]\n\nجان لو کہ اللہ تعالیٰ نے اس منزل میں اپنے بندوں کے لیے یہ واضح کر دیا ہے کہ اس کے لیے اس میں اپنے بندوں کے حصوں میں سے ایک وافر حصہ ہے۔ اور اسی وجہ سے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا:\n> حق الله أحق بالقضاء\n> (اللہ کا حق ادائیگی کا زیادہ حقدار ہے)\n\nیعنی مخلوق کے حق سے زیادہ۔ اور قرآن عزیز میں فرمایا:\n> مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِها أَوْ دَيْنٍ\n> (اس وصیت کے بعد جو کی جائے یا قرض کے بعد)\n\nاور وصیت کو قرض پر مقدم کیا، اور وصیت اللہ کا حق ہے کیونکہ اس نے ہی اسے ہم پر واجب کیا جب وصیت کرنے والے نے اس مال میں وصیت کی جس میں اسے تصرف کا حق تھا۔ اور فقہاء قرض کو وصیت پر مقدم کرتے ہیں، جو اللہ کے حکم کے خلاف ہے، سوائے بعض اہل ظاہر کے، جو وصیت کو قرض پر مقدم کرتے ہیں، اور میں بھی اسی کا قائل ہوں۔ اور اللہ نے وہ حصہ جو نماز میں اس کے لیے ہے، نصف پر رکھا، اور یہ اس دوسرے حصے سے کم ہے۔\n\nپس فرمایا:\n> قسمت الصلاة بيني وبين عبدي نصفين نصفها لي ونصفها لعبدي ولعبدي ما سأل‏\n> (میں نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کیا، آدھا میرا اور آدھا میرے بندے کا، اور میرے بندے کے لیے وہ ہے جو اس نے مانگا)\n\nپس سبحانہ و تعالیٰ نے اس تقسیم میں اللہ اور اس کے بندے کے درمیان برابری رکھی جب وہ نماز پڑھتا ہے۔ اور مال غنیمت (المغنم) میں اپنے حصے کے بارے میں فرمایا کہ اس کے لیے غنیمت میں صرف پانچواں حصہ (خمس) ہے، اور جو باقی بچا، یعنی چار بٹا پانچ، وہ پانچ حصوں میں تقسیم ہوتا ہے، پس ہر صنف کا حصہ اللہ کے حصے سے کم ہے۔ پس اس تقسیم شدہ مال میں اللہ کا حصہ نماز میں اس کے حصے سے زیادہ ہے، اس حال کے اعتبار سے جو اس کے اور اس کے بندوں کے درمیان ہے، ورنہ نصف کا حصہ خمس کے حصے سے زیادہ عظیم ہے۔ پس نماز کی تقسیم غنیمت کی تقسیم سے زیادہ ہے۔ اور خاص مقام اور تقسیم کے اعتبار سے دیکھا جائے تو باقی ماندہ تقسیم شدہ اصناف کے مقابلے میں غنیمت میں اس کا حصہ زیادہ عظیم ہے۔ پس حق (الحق) نے اپنے آپ کو اپنے بندوں میں ان کی اپنی منزلت پر اتارا اور ان کے ساتھ ویسا ہی معاملہ کیا جیسا وہ آپس میں کرتے ہیں۔ اور ایک دوسرے مقام پر فرماتا ہے:\n> لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\n> (کوئی چیز اس کے مثل نہیں)\n\nپس مماثلت کی نفی کی۔ اور ایک دوسرے مقام پر، جس کے بارے میں ترجمہ کرنے والا کہتا ہے:\n> إن الله خلق آدم على صورته‏\n> (بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا)\n\nپھر اس نے انسان کو اسماء کے ظہور (الأسماء) کا محل بنایا اور انہیں اس پر اطلاق کیا، پس بندے کو ہر اس نام سے موسوم ہونے کا حق ہے جس سے حق (الحق) نے خود کو موسوم کیا، اگرچہ نسبتیں مختلف ہوں، لیکن اسم کے مدلول کی معقولیت ایک ہی ہے جو تبدیل نہیں ہوتی۔ پھر اس نے بعض کو زمین میں اپنا خلیفہ (الخليفة) بنایا اور اسے اپنی مخلوق میں حکم چلانے کا حق دیا اور اس کے لیے وہ شریعت مقرر کی جس کے ذریعے وہ حکم کرے، اور اسے احدیت (الأحدية) عطا کی، پس اس نے یہ شریعت بنائی کہ جو اس کے رتبے میں اس سے جھگڑا کرے، اس جھگڑا کرنے والے کو قتل کر دیا جائے۔\n\nپس رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا:\n> إذا بويع لخليفتين فاقتلوا الآخر منهما\n> (جب دو خلیفوں کی بیعت کی جائے تو ان میں سے دوسرے کو قتل کر دو)\n\nاور بیت المال میں تصرف کا اختیار اس کے ہاتھ میں دیا اور اسے عمومی طور پر نظر رکھنے کا حق دیا اور ہمیں اس کی اطاعت کا حکم دیا، خواہ وہ ہم پر ظلم کرے یا ہم میں عدل کرے، پس اللہ تعالیٰ نے فرمایا:\n> يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ\n> (اے ایمان والو! اللہ کی اطاعت کرو اور رسول کی اطاعت کرو اور اپنے میں سے اولو الامر کی)\n\nاور وہ خلفاء ہیں اور وہ نائب ہیں جنہیں امام نے اپنا خلیفہ بنایا ہے، کیونکہ اللہ نے اسے یہ حق دیا ہے کہ وہ خلیفہ بنائے جیسا کہ اللہ نے اسے خلیفہ بنایا۔ پس عطا کرنا، منع کرنا، سزا دینا اور معاف کرنا سب ان کے ہاتھ میں ہے، یہ سب مقررہ میزان (الميزان) کے مطابق ہے۔ پس انہیں مقرر کرنے اور معزول کرنے کا حق ہے، جیسا کہ حق (الحق) کے ہاتھ میں میزان ہے، وہ قسط کو کم کرتا ہے اور اسے بلند کرتا ہے، اور وہ میزان وہی ہے جسے اس نے زمین پر اتارا اپنے اس قول سے:\n> ووَضَعَ الْمِيزانَ\n> (اور اس نے میزان قائم کی)\n\nپھر فرمایا کہ دن کا عمل رات کے عمل سے پہلے اور رات کا عمل دن کے عمل سے پہلے اس کی طرف اٹھایا جاتا ہے۔ اسی طرح خلیفہ کے لیے بھی، ہم رعایا کے اعمال اس کی طرف اٹھاتے ہیں، اس کے عامل اور وصول کنندگان اسے اٹھاتے ہیں، پس وہ ان میں سے جو چاہے قبول کرتا ہے اور جو چاہے رد کر دیتا ہے۔ پس حق (الحق) نے اپنے لیے مخلوق میں تصرف کا جو بھی ذکر کیا اور اسے متعین نہیں کیا، وہ امام کے لیے مقرر کیا گیا کہ وہ اپنے بندوں میں اس کے ذریعے تصرف کرے۔ پھر اللہ نے اس کے لیے ایسے دشمن بنائے جو اس کی الوہیت میں اس سے جھگڑا کرتے ہیں، جیسے فرعون اور اس جیسے دوسرے، اسی طرح اللہ نے خلفاء کے لیے بھی ان کے رتبے میں جھگڑا کرنے والے بنائے اور اسے یہ حق دیا کہ وہ ان سے قتال کرے اور ان میں سے جس پر قابو پائے اسے قتل کر دے، جیسا کہ سبحانہ و تعالیٰ مشرکین کے ساتھ کرتا ہے۔ اور ان کے قیام کی مدت اتنی ہی ہے جتنی اللہ نے انہیں مہلت دی ہے، اور خلیفہ کا ان پر قابو پانا اور فتح حاصل کرنا ان لوگوں کے لیے موت کے وقت کی طرح ہے۔ یہاں تک کہ اگر تم دونوں نسخوں کا موازنہ کرو تو حکم میں ایک حرف کا بھی فرق نہیں پاؤ گے۔ اور جس طرح حق (الحق) اپنی مخلوق میں اپنے سابق علم کے مطابق حکم کرتا ہے، اسی طرح خلیفہ اپنے غالب گمان کے مطابق حکم کرتا ہے، کیونکہ خلیفہ کو اپنے ملک میں ہونے والی ہر چیز کے علم کا رتبہ حاصل نہیں ہے، اور نہ ہی وہ حق پر ہونے والے اور باطل پر ہونے والے کو جانتا ہے، بلکہ وہ گواہی کے مطابق حکم کرتا ہے، جیسا کہ اللہ اپنے علم کے باوجود اپنی مخلوق کے ساتھ کرتا ہے۔\n\nوہ قیامت کے دن اپنی مخلوق پر گواہ قائم کرے گا، پس وہ انہیں سزا نہیں دے گا مگر ان پر گواہی قائم کرنے کے بعد، باوجود اس کے کہ وہ جانتا ہے۔ اور اسی وجہ سے جس نے کہا کہ حاکم کو اپنے علم سے فیصلہ کرنے کا حق نہیں ہے، اس نے یہی کہا۔ دنیا میں تو اس لیے کہ اس پر غرض کا الزام لگ سکتا ہے، اور حق (الحق) کی جانب سے اس لیے کہ محکوم علیہ پر حجت قائم ہو جائے تاکہ آخرت میں اسے صرف اسی چیز پر پکڑا جائے جس کا حکم دنیا میں اس کے رسول صَلَّى اللهُ عَليهِ وسَلَّم کی زبان پر شریعت میں مقرر کیا گیا تھا۔ اور اسی لیے رسول اپنے رب سے، اپنے رب کے حکم سے کہتے ہیں:\n> رَبِّ احْكُمْ بِالْحَقِّ\n> (اے میرے رب! حق کے ساتھ فیصلہ فرما)\n\nیعنی اس حق کے ساتھ جس کے ساتھ تو نے مجھے بھیجا اور مجھے ان میں فیصلہ کرنے کا حکم دیا۔ پس جب تم نے جان لیا کہ حق (الحق) نے اپنے آپ کو اپنی مخلوق میں ان کی منزلت پر اتارا اور خلیفہ امام میں اپنا کامل ترین ظہور (مجلاہ الأتم) بنایا، پھر فرمایا:\n> كلكم راع وكلكم مسئول عن رعيته‏\n> (تم میں سے ہر ایک نگہبان ہے اور تم میں سے ہر ایک سے اس کی رعیت کے بارے میں پوچھا جائے گا)\n\nپس امامت تمام مخلوق پر عام ہو گئی، چنانچہ ہر شخص کو ان میں سے امامت کا رتبہ حاصل ہو گیا، پس اس کے لیے حق (الحق) کی طرف سے یہ قدر ہے اور وہ اس حد تک تصرف کرتا ہے جس حد تک اللہ نے اسے اس میں تصرف کا مالک بنایا ہے۔ پس کوئی انسان ایسا نہیں مگر وہ حق (الحق) کی صورت پر ہے، سوائے اس کے کہ امام اکبر میں اس کا ظہور (مجلاہ) زیادہ واضح ہے، اس کا حکم زیادہ عظیم ہے، اور اس کی اطاعت زیادہ کامل ہے۔\n\nاور جان لو کہ جب اللہ تعالیٰ نے اپنے بندوں کے لیے جو شریعت مقرر کی، تو اس نے اس شریعت کو دو حصوں میں تقسیم کیا: ایک فرض جو اس نے اپنے مکلف بندوں پر واجب کیا، اور یہ دو قسموں پر ہے: ایک فرض جو اس نے اپنی طرف سے ابتداءً ان پر واجب کیا، جیسے نماز، زکوٰۃ، روزہ، حج، طہارت اور اس جیسی دوسری چیزیں جو اس نے اپنی طرف سے ان پر واجب کیں۔ اور دوسرا فرض وہ ہے جو انہوں نے خود پر واجب کیا اور وہ پہلے سے واجب نہیں تھا، پس اللہ نے اسے ان پر واجب کر دیا تاکہ انہیں الٰہی واجب کا اجر ملے اور ہمارے نزدیک یہ حقیقت ثابت ہو جائے کہ انسان اس کی صورت پر ہے۔ کیونکہ اللہ نے خود پر مومنوں کی مدد کرنا، رحمت کرنا اور اس جیسی دوسری چیزیں واجب کی ہیں۔ یہ اللہ کے علماء کے حق میں ہے۔ اور ایک قوم کے حق میں، اس نے اسے ان پر سزا کے طور پر واجب کیا جب انہوں نے خود پر واجب کیا، جیسے نذر، اور خود پر واجب کرنے میں ربوبیت (الربوبية) کے ساتھ مزاحمت کی، پس اللہ نے اسے ان پر واجب کیا تاکہ انہیں یہ معلوم ہو جائے کہ انہیں خود پر واجب کرنے کا حق نہیں ہے، پس وہ اس سے اپنی قدر جان لیں۔ پس حق تعالیٰ (الحق تعالى) اگر وہ کام نہ کرتا جو اس نے خود پر واجب کیا ہے، تو اس پر کوئی مذمت یا ملامت نہ ہوتی، کیونکہ اس کا رتبہ یہ تقاضا کرتا ہے کہ وہ جو چاہے کرنے والا (الفعال لما يريد) ہے۔ اور اسی وجہ سے اس کے خود پر واجب کرنے سے واجب کی حد متعلق نہیں ہوتی۔ اور بندے پر جب اللہ نے وہ واجب کیا جو اس نے خود پر واجب کیا، تو اگر وہ اس صورت کو پورا نہ کرے جو اس نے خود پر واجب کی ہے، تو اس سے واجب کی حد متعلق ہو جاتی ہے، جیسے اصلی واجب اگر پورا نہ کیا جائے تو سزا دی جاتی ہے۔ پس اس کا اجر عظیم ہے اور اس پر سزا بھی عظیم ہے جو اسے پورا نہ کرے۔ پس اس کا بدلہ دونوں واجبات میں عظیم ہے۔ پھر جو افعال واجبات کی صورتوں سے زائد آئے، اسے نفل (النافلة) کہا گیا، یعنی واجب سے زائد۔ پس اگر اس زائد کے لیے فرائض میں کوئی خاص صورت نہ ہو، تو وہ نفل نہیں ہوگا، بلکہ وہ ایک مستقل عمل ہوگا جس کا اجر میں ایک رتبہ ہوگا جو نوافل کے لیے نہیں ہے۔ پھر اس نے نشأت کو ملا دیا، جیسا کہ اس نے مکلف کی نشأت کو ملایا، پس اس نے فرائض کی نشأت میں سنتیں رکھیں، اور وہ فرائض پر زائد ہیں، اور اس نے نوافل کی نشأت میں وہ نوافل رکھیں جو بندے نے اپنی طرف سے بغیر کسی وجوب کے کیے، اور اسی وجہ سے اگر وہ قیامت کے دن فرائض کو مکمل طور پر نہ لائے، تو اللہ فرماتا ہے: \"میرے بندے کے فرض کو اس کے نفل سے مکمل کر دو۔\" پس واجب فرض میں جو کمی ہوئی، وہ نوافل میں موجود فرض سے مکمل کی جائے گی، اور واجب فرض کی سنتوں میں جو کمی ہوئی، وہ نوافل کی سنتوں سے مکمل کی جائے گی، ہر چیز کو اس کے مثل سے ملایا جائے گا۔\n\nبعض ارواح نے مجھ سے پوچھا: \"غنیمتوں کو انفال (نفل کی جمع) کیوں کہا گیا؟\" ہم نے کہا: ہر مومن جو شریعت کا عالم ہے، اس کے نزدیک کوئی شک اور ابہام نہیں کہ اللہ نے مومن کے لیے قتال صرف اس لیے مقرر کیا تاکہ اللہ کا کلمہ بلند ہو (كَلِمَةَ الله هِيَ الْعُلْيا) اور کافروں کا کلمہ پست ہو (كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلىٰ)، تاکہ دونوں کلمے ممتاز ہو جائیں، جیسا کہ دونوں قدم ممتاز ہوئے۔ کیونکہ اس نے ہر چیز سے جوڑے پیدا کیے، ذات اور حکم کے اعتبار سے۔ اور اللہ کے ترجمان، جو اس کے رسول ہیں، انہوں نے ہمیں بتایا کہ اللہ تعالیٰ نے جہاد، قتال اور قیدی بنانے کی شریعت مقرر کرنے کے وقت سے ہی غنیمتوں کو آگ کے لیے خوراک بنا دیا تھا، جو اس نے اسے کھلائی اور اس پر واجب کی۔ اور یہ اس کی اپنے رب کی اطاعت میں سے تھا کہ وہ صرف وہی کھاتی جو اللہ نے اس کے لیے حلال کیا تھا، اور اللہ نے اس پر غنیمت کھانا حرام کر دیا تھا اگر مجاہدین میں سے کسی نے اس میں خیانت (غلول) کی ہو۔ پس وہ غنیمت نہیں کھاتی تھی اگر اس میں خیانت کی گئی ہو، یہاں تک کہ جو کچھ لیا گیا تھا وہ واپس کر دیا جائے تاکہ مجاہد کا عمل خالص ہو جائے۔ پھر جب شریعت محمدی آئی، تو اللہ نے امت محمد صَلَّى اللهُ عَليهِ وسَلَّم کے لیے غنیمتوں کو اس خوراک پر زائد کر دیا جو اس نے انہیں اس کے علاوہ دی تھی۔ پس وہ خوراک جو ہم نے آگ سے لی، وہ اس امت کے لیے نفل (نافلة) تھی۔ اور یہ جو اللہ نے انہیں دی، یہ اس لیے نہیں کہ انہوں نے جہاد کیا، کیونکہ اگر یہ جہاد کی وجہ سے ان کا حق ہوتا، تو جو ان کے ساتھ جہاد میں شریک نہیں ہوا، اسے اس میں حصہ نہ ملتا۔ پس یہ مجاہدین کے لیے فرض نہیں ہے، بلکہ یہ ایک خوراک ہے جو اللہ نے ان لوگوں کو کھلائی جن کا ذکر کیا گیا، اور اس نے اپنے لیے ایک حصہ رکھا کیونکہ اس نے ان کی مدد کی، پس اس کا جہاد میں حصہ ہے۔ چونکہ اللہ نے اس میں اپنا حصہ اس لیے رکھا کہ اس نے دینِ الٰہی کی مدد کی، اس لیے اللہ کے حصے میں وہ سب شامل ہو گئے جنہوں نے دینِ الٰہی کی مدد کی، اور وہ غازی ہیں۔ پس اگر آیت پر غور کیا جائے تو ان کے لیے غنیمت کا صرف پانچواں حصہ (خمس) ہے، پھر چار بٹا پانچ باقی بچتا ہے، جو تقسیم ہوتا ہے، پس ان پانچ حصوں میں سے ایک پانچواں حصہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے لیے ہے، اور رسول کے بعد، جب وہ موجود نہ ہوں، تو زمانے کے خلیفہ کے لیے۔ اور دوسرا پانچواں حصہ اہل بیت کے لیے ہے، جو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے قریبی رشتہ دار ہیں۔ اور تیسرا پانچواں حصہ یتیموں کے لیے ہے۔ اور چوتھا پانچواں حصہ مسکینوں کے لیے ہے۔ اور پانچواں پانچواں حصہ ابن سبیل کے لیے ہے۔ اور بعض علماء سے روایت ہے، اور میرا خیال ہے کہ وہ ابن ابی لیلیٰ ہیں، کہ وہ حصہ جو اصل کا پانچواں حصہ ہے، رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم اسے وصول کرتے تھے اور کعبہ کے لیے نکالتے تھے اور کہتے تھے: \"یہ اللہ کا ہے۔\" پھر باقی کو تقسیم کرتے تھے۔ چونکہ یہ خوراک آگ کے لیے تھی، اللہ نے اسے اس امت کی طرف منتقل کر دیا، جیسا کہ اس نے انسان کے مال میں زکوٰۃ کو مقررہ اصناف کا حق بنایا، پس اس نے مالداروں پر ایک خاص طریقے سے اسے نکالنا واجب کیا اور امام پر اسے لینا واجب کیا، اور اصناف پر اسے لینا واجب نہیں کیا، پس وہ اپنے حق کو لینے یا چھوڑنے میں مختار ہیں، جیسے دوسرے حقوق۔ پس جو ان میں سے اسے لے لے، اس نے اپنا حق لے لیا، اور جو اسے چھوڑ دے، اس نے اپنا حق چھوڑ دیا، اور اسے اس کا اختیار ہے۔ اور جان لو کہ امام ہی ان تقسیموں کے علم اور ان کو قائم کرنے کا ذمہ دار ہے۔\n\n> ہر وہ نہیں جس نے یوسف جیسا جمال پایا،\n> بے شک خوبصورت تو انصاف کرنے والا امام ہے۔\n> اگر تم وہ پاؤ جو تم چاہتے ہو اور خواہش کرتے ہو،\n> تم ہی محب ہو اور یوسف بری کیے گئے ہیں۔\n\nپس اگر امام کے غالب گمان میں یہ ہو کہ اللہ تعالیٰ کے قول:\n> واعْلَمُوا أَنَّما غَنِمْتُمْ\n> (اور جان لو کہ جو کچھ تم نے غنیمت حاصل کی)\n\nوالی آیت اور سورۃ الحشر کی آیت، جس میں اصناف کا ذکر ہے، ان کا غنیمت میں حصہ صرف خمس (پانچواں حصہ) ہے، جو ان میں اس طرح تقسیم کیا جائے گا، اور جو باقی بچے گا وہ مسلمانوں کے بیت المال کے لیے ہوگا، جس میں امام اپنی رائے کے مطابق تصرف کرے گا۔ اگر وہ چاہے تو اسے مجاہدین کو دے دے، تقسیم میں عدل اور مساوات کے مطابق یا فضیلت کی بنیاد پر، جیسا کہ وہ موروثی مال میں کرتا ہے جب حق (الحق) نے مقرر کردہ حصے والوں کو ان کا حصہ دے دیا ہو۔ یا یہ امام چاہے کہ باقی ماندہ مال کو میت کے رشتہ داروں پر لوٹا دے، پس وہ حصہ داروں کو ان کے حصوں سے زائد دے، اس بنا پر کہ وہ میت کے رشتہ دار ہیں۔ اور اگر امام کے غالب گمان میں یہ ہو کہ اصل خمس صرف اللہ کے لیے ہے، اور جو باقی بچا وہ ان کے لیے ہے جن کا اللہ نے نام لیا ہے، اور اللہ نے مجاہدین فی سبیل اللہ کے لیے صدقات میں حصہ مقرر کیا ہے، اور غنیمت میں ان کے لیے صرف وہی مقرر کیا جو امام نے تقسیم سے پہلے انہیں نفل کے طور پر دیا، یا جو اس نے انہیں اپنے اس قول سے دیا:\n> من قتل قتيلا فله سلبه‏\n> (جس نے کسی مقتول کو قتل کیا تو اس کا سامان اسی کا ہے)\n\nاور اس منزل میں اس طرح کی بات صرف اس لیے کی گئی کہ اس میں وہ حصہ ہے جو خاص طور پر اللہ کی طرف منسوب ہے۔ پس ہمارا مقصد یہ نہیں کہ رسمی علم (علم الرسوم) میں غنیمتوں اور ان کی تقسیم کا حکم کیا ہے۔ بلکہ ہمارے نزدیک اس طریق میں غنیمتیں وہ الٰہی علوم ہیں جو انسان کو مجاہدہ اور نفس کے جہاد کے ذریعے اللہ نے عطا کیے ہیں۔ جیسا کہ مومن کے لیے اس کے ایمان میں تجارت ہے، اور وہ تجارت ہے جو دردناک عذاب سے نجات دلاتی ہے۔ پس ہر وہ علم جو جہاد سے حاصل ہو، وہ غنیمت ہے اور اسے اسی طرح تقسیم کیا جاتا ہے جس طرح غنیمتوں کو تقسیم کیا جاتا ہے۔ پس اس میں جو حصہ اللہ تعالیٰ کے لیے ہے، وہ اخلاص (الإخلاص) سے متعلق ہے، اور جو رسول اللہ کے لیے ہے، وہ ان پر ایمان لانا ہے، اور جو ذوی القربیٰ کے لیے ہے، وہ ان سے محبت رکھنا ہے، اور جو یتیموں کے لیے ہے، وہ وہ علم ہے جو عامل کو غایت تک پہنچنے سے پہلے حاصل ہوا ہو۔\n\nاور غایت کی حد وہ ہے جو اسے عمل کی اضافت سے بے نیاز کر دے۔ کیونکہ بچہ بلوغت سے پہلے اپنی حرکتیں اور افعال اپنی طرف منسوب کرتا ہے، لیکن جب وہ بالغ ہو جاتا ہے تو افعال کا حکم اس کی طرف سے اللہ کی طرف لوٹ جاتا ہے، جبکہ پہلے وہ اس کی طرف تھے۔ اور نبی صَلَّى اللهُ عَليهِ وسَلَّم فرماتے ہیں:\n> لا يتم بعد حلم‏\n> (احتلام کے بعد کوئی یتیمی نہیں)\n\nپس جو کچھ اسے بلوغت سے پہلے حاصل ہوا، وہ اس کا حق ہے جو اس کی طرف سے ہے، کیونکہ اس کی عین (ذات) اللہ کے لیے ہے۔ اور جو مسکینوں کے لیے ہے، وہ وہ حصہ ہے جو انہیں عاجزی، عدم قدرت اور قوت کے سلب ہونے سے حاصل ہوا ہے۔ کیونکہ اللہ ہی ہے جو ذُو الْقُوَّةِ الْمَتِينُ (قوت والا، مضبوط) ہے۔ اور جو ابن سبیل (راہی) کے لیے ہے، وہ وہ حصہ ہے جو اسے اس حیثیت سے حاصل ہوا کہ وہ اللہ کی طرف جانے والے راستے کا بیٹا ہے۔\n\nکیونکہ نبی صَلَّى اللهُ عَليهِ وسَلَّم فرماتے ہیں:\n> إن للدنيا أبناء وللآخرة أبناء فكونوا من أبناء الآخرة\n> (بے شک دنیا کے بیٹے ہیں اور آخرت کے بیٹے ہیں، پس تم آخرت کے بیٹوں میں سے ہو جاؤ)\n\nاور وہ ابن سبیل ہیں، اور دنیا کے بیٹے نہ بنو۔ جہاں تک عمل میں اخلاص (الإخلاص) کی صورت کا تعلق ہے، تو وہ یہ ہے کہ تم کشف (الکشف) کے ذریعے اس حقیقت پر کھڑے ہو جاؤ کہ اس عمل کا عامل اللہ ہی ہے، جیسا کہ حقیقت میں ہے، خواہ وہ عمل مذموم ہو یا محمود، یا جو بھی ہو، پس یہی اس میں اللہ تعالیٰ کا حکم ہے۔ عمل کی عین (ذات) کیا ہے، یہ حدیث میں واضح ہوا ہے کہ اللہ تعالیٰ فرماتا ہے:\n> من عمل عملا أشرك فيه غيري فإنا منه بري‏ء وهو للذي أشرك\n> (جس نے کوئی ایسا عمل کیا جس میں میرے ساتھ کسی اور کو شریک کیا، تو میں اس سے بری ہوں اور وہ اس کے لیے ہے جس کو شریک کیا)\n\nپس اس نے عمل کو نکرہ (عام) رکھا اور کسی خاص عمل کو مخصوص نہیں کیا، اور \"فیہ\" (اس میں) کی ضمیر عمل کی طرف لوٹتی ہے، اور \"منہ\" (اس سے) کی ضمیر اس غیر کی طرف لوٹتی ہے جو شریک ہے، اور \"ھو\" (وہ) کی ضمیر مشرک کی طرف لوٹتی ہے۔ کیونکہ اللہ عمل سے بری نہیں ہوتا، وہ بلا شک عامل ہے، بلکہ وہ شریک سے بری ہوتا ہے، کیونکہ شریک عدم (عدم) ہے اور اللہ وجود (الوجود) ہے۔ پس اللہ عدم سے بری ہے، کیونکہ عدم اس کو لاحق نہیں ہوتا اور نہ ہی وہ اس سے متصف ہوتا ہے، کیونکہ وہ واجب الوجود لذاتہ ہے۔ پس براءت صحیح ہے۔ اسی طرح اس کے قول میں:\n> بَراءَةٌ من الله ورَسُولِهِ إِلَى الَّذِينَ عاهَدْتُمْ من الْمُشْرِكِينَ\n> (اللہ اور اس کے رسول کی طرف سے ان مشرکوں سے براءت ہے جن سے تم نے معاہدہ کیا تھا)\n\nیہاں بھی شریک سے براءت ہے، کیونکہ شریک وہاں نہیں ہے، پس وہ عدم ہے، کیونکہ اس نے کہا \"مشرکین سے\"۔ پس یہ بھی شریک سے براءت ہے۔ پس عمل کا اللہ کے لیے اخلاص (الإخلاص) ہی عمل میں اللہ کا حصہ ہے۔ کیونکہ عمل میں ظاہری صورت صرف اس شخص میں ہے جس میں اللہ نے اپنا عمل ظاہر کیا، پس ظاہری صورت کی وجہ سے معاملہ مشتبہ ہو جاتا ہے، اور ہم شک نہیں کرتے کہ عمل شہود (الشہود) کے ذریعے اس سے ظاہر ہوتا ہے، پس یہ ایک صحیح اضافت ہے۔ اسی لیے ہم کہتے ہیں کہ وہ اپنے اسم الظاہر کے اعتبار سے ہر چیز کی عین (ذات) ہے۔ اور یہاں ایک خفی دلیل ہے، اور وہ یہ کہ بصارت صرف آلہ پر پڑتی ہے، اور وہ آلہ کسی دوسرے امر کے لیے تصرف کر رہا ہے جس پر ظاہری حس نہیں پڑتی، اس کی دلیل موت اور آلہ کا موجود ہونا اور عمل کا سلب ہو جانا ہے۔ پس آلہ عامل نہیں ہے، اور حس نے صرف آلہ کو ہی ادراک کیا ہے۔ پس جس طرح حاکم نے جان لیا کہ محسوس کے پیچھے ایک امر ہے جو اس آلہ کے ذریعے عمل کر رہا ہے اور اسے تصرف دے رہا ہے، جسے عقلی نظر کے علماء نفس عاقلہ ناطقہ اور حیوانیہ سے تعبیر کرتے ہیں، تو وہ ایک ایسے معنی کی طرف منتقل ہو گئے جو حس کے مدرکات میں سے نہیں ہے، اسی طرح اہل کشف (الکشف) اور شہود (الشہود) کا جمع اور ہستی (الوجود) میں نفس ناطقہ کا ادراک وہی ہے جو اہل نظر نے محسوس آلہ میں ادراک کیا، بالکل اسی طرح۔ پس انہوں نے جان لیا کہ نفس ناطقہ کے پیچھے وہی عامل ہے اور وہ مسمیٰ اللہ ہے، اور نفس اس عمل میں اہل اللہ کے نزدیک اور عقلی نظر کے علماء کے نزدیک محسوس آلہ کی طرح ہے۔ اور جب تک یہ ادراک حاصل نہ ہو، تو ہمارے نزدیک وہ اپنے عمل میں مکمل طور پر مخلص (مخلص) نہیں کہلائے گا، باوجود اس کے کہ آلات ثابت ہیں اور ان کا تصرف بھی ہے، کیونکہ عامل سے عمل کی صورت ظاہر ہوتی ہے۔ پس سارا عالم حق (الحق) کے افعال کے لیے آلات ہے، ان لوگوں کے لیے جو جانتے ہیں۔\n\nاور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے اس حدیث میں جو ان سے صحیح ثابت ہے، فرمایا:\n> أ تدرون ما حق الله على العباد قالوا الله ورسوله أعلم قال فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا ثم قال أ تدرون ما حقهم عليه إذا فعلوا ذلك أن يدخلهم الجنة\n> (کیا تم جانتے ہو کہ بندوں پر اللہ کا کیا حق ہے؟ انہوں نے کہا: اللہ اور اس کا رسول بہتر جانتے ہیں۔ آپ نے فرمایا: بے شک بندوں پر اللہ کا حق یہ ہے کہ وہ اس کی عبادت کریں اور اس کے ساتھ کسی چیز کو شریک نہ ٹھہرائیں۔ پھر فرمایا: کیا تم جانتے ہو کہ جب وہ ایسا کریں تو ان پر اللہ کا کیا حق ہے؟ یہ کہ وہ انہیں جنت میں داخل کرے)\n\nپس آپ صَلَّى اللهُ عَليهِ وسَلَّم نے اپنے قول \"شیئاً\" (کسی چیز کو) سے نکرہ (عام) رکھا تاکہ اس میں تمام چیزیں شامل ہو جائیں، اور یہ اللہ تعالیٰ کا قول ہے:\n> فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً\n> (پس جو کوئی اپنے رب سے ملاقات کی امید رکھتا ہو، تو اسے چاہیے کہ نیک عمل کرے اور اپنے رب کی عبادت میں کسی کو شریک نہ ٹھہرائے)\n\nپس اس نے \"احداً\" (کسی کو) کو نکرہ رکھا، پس اس کے تحت ہر وہ چیز داخل ہو گئی جس میں احدیت (أحدية) ہے، اور کوئی چیز ایسی نہیں مگر اس میں احدیت ہے۔ اور اللہ سے ملاقات کا ذکر کیا تاکہ یہ بغیر کسی احتمال کے رضامندی کی حالت پر دلالت کرے، جیسا کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے ذکر کیا، اور یہ جنت میں ہے، کیونکہ وہ دار الرضوان ہے۔ پس ہر وہ شخص جو اللہ سے ملے وہ سعید نہیں ہوتا، پس اس میں مقامات کا حکم ہے، اس کے مطابق جو اللہ نے ان میں رکھا ہے۔ اسی طرح اللہ تعالیٰ کا قول ہے:\n> لَنْ يَنالَ الله لُحُومُها ولا دِماؤُها ولكِنْ يَنالُهُ التَّقْوى‏ مِنْكُمْ\n> (اللہ کو نہ ان کا گوشت پہنچتا ہے اور نہ ان کا خون، لیکن اسے تمہاری طرف سے تقویٰ (التقوىٰ) پہنچتا ہے)\n\nپس اس نے جو چیز ہم سے اس کو پہنچتی ہے، اسے تقویٰ (التقوىٰ) قرار دیا۔ پس حق (الحق) نے اپنے بندوں کو ہر اس چیز میں اپنے حصے کے بارے میں بتا دیا جس پر وہ ہیں اور جس میں وہ ہیں۔ اور اس نے اپنے بندوں سے اس کا عہد لیا، پس فرمایا:\n> وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ\n> (اور میرے عہد کو پورا کرو، میں تمہارے عہد کو پورا کروں گا)\n\nپس اس کا تم پر حق یہ ہے کہ تم اس عہد کو پورا کرو جو اس نے تم سے لیا ہے، اور وہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کا پانچ نمازوں کے بارے میں قول ہے:\n> فمن أتى بهن لم يضيع من حقهن شيئا كان له عند الله عهدا أن يدخله الجنة\n> (پس جو انہیں ادا کرے اور ان کے حق میں سے کچھ بھی ضائع نہ کرے، تو اس کے لیے اللہ کے پاس عہد ہے کہ وہ اسے جنت میں داخل کرے گا)\n\nاور نماز اللہ سے مناجات ہے، اس تقسیم کے مطابق جو اس نے اپنے اور اپنے بندوں کے درمیان مقرر کی ہے۔ پس جس نے اسے اس کا حصہ دیا اور اس میں سے اپنا حصہ لیا، اس نے اسے اس کا حق اور نصیب دے دیا۔ پس جب اللہ تعالیٰ، باوجود اس کے کہ وہ عالمین سے بے نیاز ہے، اس نے اپنے لیے اس چیز میں حصہ مقرر کیا جو عالم کے لیے ہوتی ہے اور جس کی اسے ضرورت ہوتی ہے، اور ایک مقررہ حصہ لیتا ہے، تو تمہارا کیا خیال ہے اس شخص کے بارے میں جس کی اصل فقر اور مسکنت ہے، اس کی عین (ذات) کے ظہور میں، نہ کہ اس کی عین اور وجود (الوجود) میں اور اس چیز میں جس میں وہ ہے۔ اور ہم نے یہ اس لیے کہا کہ \"نہ اس کی عین میں\" کیونکہ ان کی اعیان (ذاتیں) خود سے کسی بنانے والے کے بنانے سے نہیں ہیں، بلکہ وہ احوال جن پر وہ تصرف کرتی ہیں، جیسے ہستی (الوجود) اور عدم (العدم) وغیرہ، ان میں اس کی طرف فقر واقع ہوتا ہے جو اس عین میں ان کا حکم ظاہر کرتا ہے۔ پس یہ جان لو۔ پس جس نے اپنا حق طلب کیا اور اسے پورا کیا، تو اس پر کوئی ملامت نہیں، لیکن جب ہمارے لیے بعض حقوق میں یہ شریعت مقرر کی گئی کہ اگر ہم انہیں چھوڑ دیں تو یہ ہمارے لیے زیادہ عظیم ہوگا، اور اسے مکارم اخلاق میں سے قرار دیا اور اس کے ساتھ اس اجر کو منسلک کیا جو اس کی طرف سے ہے، اور وہ اس کا قول ہے:\n> فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله\n> (پس جس نے معاف کیا اور اصلاح کی، تو اس کا اجر اللہ پر ہے)\n\nاور جس نے اپنا حق طلب کیا، اور وہ اس کا قول ہے:\n> ولَمَنِ انْتَصَرَ بَعْدَ ظُلْمِهِ فَأُولئِكَ ما عَلَيْهِمْ من سَبِيلٍ\n> (اور جس نے اپنے اوپر ظلم ہونے کے بعد بدلہ لیا، تو ان پر کوئی راستہ نہیں)\n\nتو اسے اس کا حق ہے۔ پس اسی طرح وہ اپنے بندوں کے ساتھ کرتا ہے ان حقوق میں جو انہوں نے اس کے اور اس کے حقوق میں ضائع کیے، وہ معاف کرتا ہے، درگزر کرتا ہے اور اصلاح کرتا ہے، پس معاملہ دونوں جہانوں میں اللہ کی رحمت کی طرف لوٹتا ہے، پس رحمت انہیں ہر جگہ شامل کرتی ہے، لیکن وہ اس میں برابر نہیں ہوں گے۔ اللہ تعالیٰ فرماتا ہے:\n> أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ سَواءً مَحْياهُمْ ومَماتُهُمْ ساءَ ما يَحْكُمُونَ\n> (کیا ان لوگوں نے جنہوں نے برے کام کیے، یہ گمان کیا کہ ہم انہیں ان لوگوں جیسا کر دیں گے جو ایمان لائے اور نیک عمل کیے، ان کی زندگی اور موت برابر ہو جائے؟ کتنا برا ہے جو وہ فیصلہ کرتے ہیں)\n\nجیسا کہ اللہ تعالیٰ نے ان لوگوں کو برابر نہیں کیا جو جانتے ہیں اور جو نہیں جانتے۔ پس بندوں میں کامل وہ ہے جس نے اللہ کا کوئی حق نہ اپنے اوپر چھوڑا اور نہ اپنے پاس، مگر اسے پورا کیا، ہر اس چیز میں جس میں اس کا حصہ ہے، اسے اس کا حصہ دیا، اس حد کے مطابق جو اس کے لیے مقرر کی گئی۔ پس جب وہ اسے پورا کر دے گا، تو اللہ اس پر وہ سب کچھ لوٹا دے گا جو شریعت کے ذریعے اس کے لیے ذکر کیا گیا ہے۔ پس جب اللہ اس کے عہد کو پورا کرے گا، تو وہ اسے اس سے روک لے گا، اور یہ ابتداءً فضل ہوگا، نہ کہ بدلہ۔ اور یہ صرف اللہ کے علماء (العلماء بالله) سے ہی ہو سکتا ہے جو امر کو اس کی حقیقت پر جانتے ہیں، اور وہ مخلوق میں سے چند افراد ہیں جنہیں اس کے سوا کوئی نہیں جانتا۔ پس میں نے تمہیں اس سعادت کو حاصل کرنے کے کامل ترین طریق پر متنبہ کر دیا جس سے اوپر کوئی سعادت نہیں۔ اور اس کے باوجود، اے زندہ! اس کے بعد بھی معاملہ عظیم ہے، اور خطرہ سنگین ہے، اور اس میں اشکال سب سے بڑا ہے۔ اور اسی وجہ سے اہل اللہ نے غایت کو حیرت میں رکھا ہے، اور وہ عجز ہے۔ اور یہ مقدار اس علم کے لیے کافی ہے کہ اللہ کا اپنے بندوں کے پاس حق اور نصیب ہے جسے وہ ان سے استحقاق کے حکم سے طلب کرتا ہے، اور وہ ان سے دوسروں کے حقوق بھی وکالت کے حکم سے طلب کرتا ہے، جیسا کہ فرمایا:\n> ويَأْخُذُ الصَّدَقاتِ\n> (اور وہ صدقات لیتا ہے)\n\nوکالت کے حکم سے، پس وہ انہیں بڑھاتا ہے اور پھل دیتا ہے۔ پس وہ ایک قوم کے حق میں اپنی طرف سے تبرع کے طور پر وکیل ہے، ان پر رحمت کرتے ہوئے، اگرچہ انہوں نے اسے وکیل نہ بنایا ہو، اور ایک قوم کے حق میں ان کے بنانے سے وکیل ہے، جیسا کہ اس نے انہیں حکم دیا کہ وہ اسے وکیل بنائیں۔ ورنہ بندے میں اتنی جرات نہیں کہ وہ اپنے آقا کو وکیل بنائے۔ پس جب اس نے اپنے بندوں کے لیے یہ تبرع کیا اور اپنی لطیف مہربانی سے اپنی کبریائی سے ان کی طرف اترا، تو انہوں نے اسے وکیل بنا لیا، اور اس نزول نے انہیں ناز و انداز عطا کیا۔ جہاں تک اس حدیث کا تعلق ہے کہ اللہ اپنے بندے کی نماز میں سے صرف وہی قبول کرتا ہے جو اس نے عقل سے ادا کی، تو اس کا مطلب یہ ہے کہ وہ اللہ کے حق کی ادائیگی کی تائید کرتا ہے جو اس پر متعین کیا گیا ہے، اور اس کا زیادہ تر حصہ نصف مقرر کیا، اور یہ وہ حد ہے جو اس نے اپنے بندے کی نماز میں اس کے لیے مقرر کی، اور کم از کم دسواں حصہ مقرر کیا، پس فرمایا: دسواں، نواں، آٹھواں، ساتواں، چھٹا، پانچواں، چوتھا، تہائی، نصف۔ اور نصف کا ذکر صرف سورۃ فاتحہ میں کیا، پس ہم نے معنی کو جان لیا اور اسے نماز کے تمام افعال اور اقوال پر عام کر دیا، بلکہ ان تمام اعمال پر جن کا ہمیں مکلف بنایا گیا۔ جہاں تک اس حصے کا تعلق ہے جو اس نے متعین کیا، تو وہ فاتحہ میں منحصر ہے، اور وہ نو حصے ہیں:\n\nپہلا حصہ: بِسْمِ الله الرَّحْمنِ الرَّحِيمِ\nدوسرا: الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ\nتیسرا: الرَّحْمنِ الرَّحِيمِ\nچوتھا: ملك (مالِكِ) يَوْمِ الدِّينِ\nپانچواں: إِيَّاكَ نَعْبُدُ\nچھٹا: وإِيَّاكَ نَسْتَعِينُ\nساتواں: اهْدِنَا الصِّراطَ الْمُسْتَقِيمَ‏\nآٹھواں: صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ\nنواں: غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ ولا الضَّالِّينَ\n\nپس وہ شخص جو اپنی نماز سے غافل رہا، وہ خسارہ پانے والا ہے جس نے ان حصوں میں سے کسی ایک میں بھی اللہ کے ساتھ حضور حاصل نہ کیا جو ہم نے فاتحہ میں ذکر کیے، اور یہی وہ ہیں جنہیں اللہ نے قبولیت میں دسویں سے نصف تک ذکر کیا۔ پس جس نے یہ رائے رکھی کہ بِسْمِ الله الرَّحْمنِ الرَّحِيمِ اس کی ایک آیت ہے اور اسے اس سے جدا نہیں کیا، تو تقسیم وہی ہے جو ہم نے فاتحہ میں ذکر کی، کیونکہ اشیاء میں اللہ کا حکم مجتہد کا حکم ہے، پس وہ اس کے اجتہاد میں اس کے ساتھ ہے۔ اور جس کا اجتہاد فصل کی طرف لے گیا، پس اس نے بسملہ کو فاتحہ سے جدا کیا اور یہ کہ بسملہ اس کی آیت نہیں ہے، تو اللہ نے اس کے لیے نواں حصہ \"ولا الضَّالِّينَ\" کو بنایا، اور بسملہ زیادہ حقدار اور اولیٰ ہے، کیونکہ وہ علماء باللہ کے نزدیک بلا شک قرآن میں سے ہے، اور سورتوں میں اس کا تکرار قرآن میں دیگر کلمات کے تکرار کی طرح ہے۔ اور جو نو سے زائد ہے، تو اس کی عقل تلاوت میں کلمہ کے حروف میں ہے، پس نمازی کلمہ کے حروف میں سے ایک حرف کو عقل سے ادا کرتا ہے، پھر باقی سے غافل ہو جاتا ہے۔ پس یہ اس عام قول صَلَّى اللهُ عَليهِ وسَلَّم کا معنی ہے کہ وہ صرف وہی قبول کرتا ہے جو اس نے عقل سے ادا کی۔ پس عاقل وہ ہے جو اسے مکمل طور پر لائے تاکہ اللہ اسے مکمل طور پر قبول کرے، اور جس نے اپنی نماز میں اس میں سے کچھ کمی کی، تو اس کی تلافی اس کی نوافل کی نماز میں فاتحہ کی قراءت سے کی جائے گی۔ پس اسے نوافل کی کثرت کرنی چاہیے، اور اگر اس کی نوافل کی قراءت اس کمی کو پورا نہ کر سکے جو اس نے فرض میں فاتحہ کی قراءت میں کی، تو اس کی تلافی اس کی تلاوت سے کی جائے گی جو اس نے معین نماز کے علاوہ حضور کے ساتھ کی، اگرچہ وہ اس کے تمام افعال میں نماز میں ہو۔ کیونکہ وہ ان لوگوں میں سے ہو سکتا ہے:\n> الَّذِينَ هُمْ عَلى‏ صَلاتِهِمْ دائِمُونَ\n> (جو اپنی نمازوں پر ہمیشہ قائم رہتے ہیں)\n\nاور وہ ہر وقت اللہ کا ذکر کرنے والے ہیں، پس وہ تمام احوال میں اس سے مناجات کرتے ہیں۔ پس اللہ کا حصہ ان تمام چیزوں میں جن کا اس نے اپنے بندوں کو مکلف بنایا، وہ ہے جو اس نے ان پر فرض کیا، اور بندوں کا حصہ اللہ کی طرف سے وہ ہے جو حق (الحق) نے خود پر ان کے لیے واجب کیا، اور نفل (النافلة) ہر اس چیز میں نفل کے لیے ہے۔ جہاں تک رسول صَلَّى اللهُ عَليهِ وسَلَّم کے حصے کا تعلق ہے اس مسئلے میں، تو وہ ان کی تصدیق اور ان پر اور جو کچھ وہ لائے ہیں اس پر ایمان لانا ہے۔ اور ایمان کو جو چیز حقیقت بناتی ہے وہ یہ ہے کہ بہترین زمانے نماز اور اذان کا زمانہ ہے، اور بہترین شفاعت اور کلام وہ ہے جس کی رحمن نے اجازت دی ہو۔ یہ وہ چیز ہے جو حق (الحق) کے رسول ہمارے پاس لائے اور ہماری طرف متوجہ ہو کر آئے، پس وہ قریب ہوئے جب ظہور الٰہی (التجلی) ہوا، اور اس نے انہیں بے ہوش نہیں کیا، بلکہ اس ظہور الٰہی (التجلی) نے انہیں بیدار کیا تاکہ وہ خود ظہور کریں، پس وہ متوجہ ہوئے اور منہ نہیں موڑا اور نہ ہی پیٹھ پھیری۔ جہاں تک ان کی تصدیق کا تعلق ہے، تو یہ حق (الحق) کی خبر کی وجہ سے ہے کہ وہ اس کی طرف سے ہمارے لیے رسول ہیں، اور وہ وجیہ اور مقرب ہیں۔ اور جہاں تک اس پر ایمان لانے کا تعلق ہے جو وہ لائے ہیں، تو یہ ان کے حق (الحق) کی طرف سے خبر دینے کی وجہ سے ہے۔ پس ان پر ایمان لانے میں حق کی خبر اور جو کچھ وہ لائے ہیں اس میں حق کی خبر کے درمیان فرق ہے۔ پس ان پر صرف وہی ایمان لاتا ہے جس سے حق نے اس کے سر (باطن) میں خطاب کیا ہو، اگرچہ مخاطب کو اس کا شعور نہ ہو اور نہ ہی وہ جانتا ہو کہ کس نے اس سے کلام کیا، بلکہ وہ اپنے دل میں اس کی تصدیق پاتا ہے۔ اور اہل کشف (الکشف) اور حضور (الحضور) کانوں اور دلوں سے حق کے کلام کو سن کر جانتے ہیں کہ یہ اس کی طرف سے رسول ہیں، پس وہ بصیرت کے ساتھ ان پر ایمان لاتے ہیں۔ اور اس رسول کے لائے ہوئے پر صرف وہی ایمان لاتا ہے جس سے رسول نے اس کے سر (باطن) میں خطاب کیا ہو، اگرچہ مخاطب کو اس کا شعور نہ ہو اور نہ ہی وہ جانتا ہو کہ کس نے اس سے کلام کیا، بلکہ وہ اپنے دل میں اس کے لائے ہوئے کی تصدیق پاتا ہے۔ اور اہل کشف (الکشف) اور حضور (الحضور) دلوں، کانوں اور آنکھوں سے رسول کے کلام کو سن کر جانتے ہیں کہ یہ اللہ کی طرف سے آیا ہے:\n> وَلَوْ كانَ من عِنْدِ غَيْرِ الله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً\n> (اور اگر یہ اللہ کے سوا کسی اور کی طرف سے ہوتا تو وہ اس میں بہت زیادہ اختلاف پاتے)\n\nپس وہ بصیرت کے ساتھ اس پر ایمان لاتے ہیں۔ اور ہم نے رسول کے لائے ہوئے کے بارے میں \"اور آنکھوں\" کا ذکر اس لیے کیا اور حق کے کلام کو سننے میں ایسا نہیں کہا، کیونکہ جب ہم رسول کو دیکھتے ہیں تو ہم نے انہیں دیکھ لیا، اور حق تعالیٰ ایسا نہیں ہے، جب ہم اسے دیکھتے ہیں تو ہم نے اسے صرف اپنی منزلت اور اپنی صورت سے ہی دیکھا ہے۔ اسی لیے ہم نے ان کی خبر کی تصدیق میں جب وہ ہم سے کلام کرتے ہیں، \"اور آنکھوں\" کا ذکر نہیں کیا، اور ہم دلوں اور کانوں کو صرف خبر کے لیے لائے ہیں، نہ کہ اس لیے کہ حق نے اس سے کلام کیا ہے۔ کیونکہ دلوں، کانوں اور آنکھوں کا حق کا ادراک برابر ہے، عالم میں سے کسی نے بھی کوئی ادراک نہیں کیا، خواہ وہ یہ ہو یا کوئی اور، مگر حق سے اپنی منزلت اور اپنی خاص صورت کا۔ پس اس نے اسے ادراک کیا۔ اور ہم نے دلوں کا ذکر اس لیے کیا کہ وہ سننے والے ہیں، اور کانوں کا خاص طور پر خبر کے لیے، اس چیز پر تنبیہ کرتے ہوئے جو ہم نے ذکر کی اور بیان کی۔ پس جب تم نے یہ جان لیا، تو تم نے اللہ اور رسول کا وہ حق پورا کر دیا جو تم پر اللہ اور اس کے رسول کے لیے ادا کرنا متعین تھا۔ کیونکہ اس مسئلے میں اہل اللہ کی ایک جماعت نے غلطی کی، جب انہوں نے اس کے بارے میں اللہ کی طرف سے خبر نہیں دی، تو رسمی علماء (علماء الرسوم) کا کیا حال ہوگا؟ پس جس نے اس میں ایمان کے طریق سے کلام کیا، وہ صرف اسی طرح کلام کرے گا جس طرح ہم نے کلام کیا، کیونکہ وہ ذوق (باطنی تجربہ) سے کلام کرتا ہے۔ اور اسی وجہ سے تم دو بلکہ تین اشخاص کو دیکھتے ہو جو رسول کے ہاتھوں معجزہ کا مشاہدہ کرتے ہیں، جسے حق نے ان کی صداقت پر دلالت کے طور پر ظاہر کیا جو وہ لائے اور خود ان کی تصدیق کے لیے، پس ان تینوں میں سے ایک شخص یقین کر لیتا ہے کہ وہ حق ہے اور اس کا انکار کر دیتا ہے، اور دوسرا شخص اس کے نزدیک وہ دلالت قائم نہیں ہوتی، کیونکہ وہ اس میں دلالت کی جگہ سے ناواقف ہوتا ہے، اور تیسرا ایمان لاتا ہے اور تصدیق کرتا ہے، حالانکہ مجلس ایک ہے، اور آنکھوں سے دیکھنا ایک ہے، اور ظاہر میں ادراک ایک ہے۔ پس ہم نے جان لیا کہ جس نے ایمان لایا اور تصدیق کی، اگر حق کا اس کے دل پر ظہور (التجلی) نہ ہوتا اور اس نے اسے بغیر کسی واسطے کے نہ بتایا ہوتا، تو وہ اس پر ایمان نہ لاتا جو وہ لائے، اور نہ ہی تصدیق کرتا، اور وہ اپنے ساتھی کی طرح ہوتا۔ اسی طرح اس کے لائے ہوئے پر ایمان لانے میں بھی۔ پس ہر مومن یہ نہیں جانتا کہ اسے ایمان کہاں سے حاصل ہوا، خاص طور پر جب ہم نے دیکھا اور ہمیں یہ بات پہنچی کہ بعض لوگوں نے رسول اللہ پر ایمان لایا جب انہوں نے انہیں دیکھا اور ان کی دعوت سنی، اور انہوں نے کوئی معجزہ یا دلالت نہیں دیکھی، بلکہ انہوں نے اپنے اندر یہ پایا کہ وہ اپنے دعوے میں سچے ہیں، پس انہوں نے اسی وقت ان پر ایمان لایا اور نہ ہچکچائے اور نہ ہی لکنت کی۔ پس یہ صرف اسی وجہ سے تھا جو ہم نے ذکر کیا کہ ان کے دل پر ظہور (التجلی) ہوا، اور انہیں یہ شعور نہیں ہوا کہ یہ ظہور (التجلی) کی وجہ سے ہے۔ اور اسی قدر سے اہل کشف (الکشف) دوسرے مومنوں سے بڑھ گئے، اور اگر ان کا امور کا کشف (کشف) نہ ہوتا، تو وہ انہیں اس طرح جدا نہ کرتے۔\n\nپس رسول کا حصہ یہ ہے کہ وہ انہیں ان کے رب سے ان کی ذات میں اور جو کچھ وہ اس کی طرف سے لائے ہیں، اس میں ملائے۔ جہاں تک اس علم میں یتیموں کے حصے کا تعلق ہے، تو یہ حقیقت میں دعوے سے نکلنے کی بلوغت کا وقت ہے اس چیز میں جو تمہارے لیے تھی۔ پس تمہارا حصہ اس وقت کے آنے سے پہلے یہ ہے کہ تمہارے افعال تمہاری طرف منسوب کیے جائیں، اور تم پر کوئی اعتراض نہ کیا جائے، اور نہ ہی تم سے سلب کیے جائیں، اور نہ ہی تم پر کوئی پابندی ہو۔ پس جب بلوغت کا وقت آ جائے، تو تم پر پابندی لگ جاتی ہے اور تمہاری تمام حرکات میں قید واقع ہو جاتی ہے اور ان پر حق (الحق) کے احکام متوجہ ہو جاتے ہیں، کیونکہ وہ اس کے افعال ہیں جو تم میں ظاہر ہوئے، اور اگر وہ تم میں ظاہر نہ ہوتے تو یہ خطاب اور یہ تحکیم ان سے متعلق نہ ہوتی۔ اور \"تم میں ظاہر ہوئے\" کا معنی تمہارا یہ دعویٰ ہے کہ افعال تمہارے لیے ہیں۔ پس حق (الحق) نے تمہیں مکلف بنا کر پابندی لگانے کا ارادہ کیا تاکہ تمہیں یہ معلوم ہو جائے کہ اگر یہ افعال تمہاری ملکیت ہوتے، تو میرے لیے یہ جائز نہ ہوتا کہ میں تمہاری چیز میں تصرف کروں جو میری نہیں ہے۔ اور اس کی وجہ یہ ہے کہ عقل کی بلوغت کا وقت آ چکا ہے اور عقل اور نظر کا استحکام حاصل ہو چکا ہے، پس تمہیں چاہیے تھا کہ اللہ نے تمہیں جو عقل دی ہے، اس سے تم اپنے افعال کو، جو تم میں ظاہر ہونے کا محل ہیں، اللہ کے لیے دیکھو، نہ کہ اپنے لیے۔ پس اگر تمہیں یہ ابتداءً حاصل ہو جاتا، تو وہ تمہیں مکلف نہ بناتا اور نہ ہی اس دنیا میں تم پر پابندی لگاتا۔ کیا تم نہیں دیکھتے کہ جس کی عقل مستحکم نہیں ہوئی، اس پر پابندی نہیں لگائی گئی اور نہ ہی اسے مکلف بنایا گیا، اور وہ پاگل ہے جس سے اس کی عقل چھپا دی گئی ہے کہ اس کے لیے اس میں کوئی حکم ہو۔ اسی طرح سونے والا اور ہر وہ شخص جو عقل سے متصف نہیں ہے۔ اور جب وہ اس دنیا میں اس حد تک پہنچ گیا جس نے اس صفت کے قیام سے اس پر تکلیف واجب کر دی، تو جب اس دنیا میں اس سے پردہ ہٹا دیا جائے، تو اس سے پابندی اور شرعی خطاب ختم نہیں ہوتا، یہ دار (دنیا) کے حکم کی وجہ سے ہے، نہ کہ حال کے حکم کی وجہ سے، کیونکہ قیاس کا تقاضا یہ تھا کہ اس صفت والے سے پابندی اٹھا لی جائے، لیکن دار کے لیے ایک حکم کا ہونا ضروری ہے، جیسا کہ مشرکین اور کفار کے بچوں کے ساتھ کیا جاتا ہے، ہم انہیں دار کی وجہ سے ان کے آباء سے ملحق کرتے ہیں، اگرچہ ہم جانتے ہیں کہ وہ فطرت پر ہیں اور انہوں نے شرک یا کفر نہیں کیا۔ پس دار کا ایک حکم ہے۔ پس جب آخرت کا وعدہ آئے گا اور ہم اس کی طرف منتقل ہوں گے، تو ہم دار کے حکم سے نکل جائیں گے، پس دار الرضوان اور اس کی بہن (جہنم) میں ہم سے تکلیف کا حکم اٹھ جائے گا۔ اسی طرح جس کو اللہ نے یہاں اس دنیا میں اس کی سعادت پر مطلع کیا اور دوسرے کو اس کی شقاوت پر مطلع کیا، تو یہ اطلاع ان دونوں سے پابندی اور تکلیف کو ساقط نہیں کرتی، کیونکہ اس دنیا میں قوانین (النواميس) کا اصل وضع دنیا اور آخرت کی مصلحت کے لیے ہے۔ پس جب تک دنیا قائم ہے اور جو اس میں ہیں، پابندی کا اٹھ جانا محال ہے۔ اگر ایسا نہ ہوتا، تو جس سے پردہ ہٹا دیا گیا، اس سے پابندی اٹھ جاتی، کیونکہ وہ اللہ کے سوا کسی کو فاعل نہیں دیکھتا، اور چیز خود پر پابندی نہیں لگاتی، اگرچہ وہ خود پر جو چاہے واجب کرے۔ پس یہ ہمارے لیے انس ہے اس چیز میں جو وہ خود پر ہمارے لیے واجب کرتا ہے۔ پس اگر ہم اسے اس کے لیے واجب کریں، تو وہ اسے ہم پر واجب کرتا ہے تاکہ ہم ممتاز ہو جائیں، پس ہم اسے چھوڑ کر نافرمانی کریں۔ اور اگر حق (الحق) وہ چھوڑ دے جو اس نے خود پر واجب کیا، تو اس کے لیے یہ حکم نہیں ہوگا، کیونکہ یہ حکم اس سے متعلق نہیں ہوتا جس سے یہ متعلق ہو، مگر اس حیثیت سے کہ کسی دوسرے نے اسے واجب کیا ہو۔ پس اگر حق نے ہم پر وہ واجب نہ کیا ہوتا جب ہم نے اسے خود پر واجب کیا، تو ہم اسے چھوڑ کر نافرمان نہ ہوتے۔ پس اگر وہ اسے پورا کرے جس پر کسی دوسرے نے اسے واجب نہیں کیا، تو یہ اس کی طرف سے احسان، فضل اور مکارم اخلاق ہے۔ اگر تم کہو کہ یہ تو خیر (بھلائی) میں ہے، تو اگر شر (برائی) ہو؟ ہم کہیں گے: وہاں صرف خیر ہی ہے، اور خیر دو قسموں پر ہے: خیر محض، اور وہ جس میں کوئی شر نہیں، اور خیر ممزوج، اور وہ جس میں شر کی ایک قسم شامل ہے، جیسا کہ ہم نے بیان کیا، جیسے ناپسندیدہ دوا پینا، اور جیسے مومن جب نافرمانی کرتا ہے اور اطاعت کرتا ہے، کیونکہ مومن کی نافرمانی اطاعت کے بغیر خالص نہیں ہوتی، کیونکہ اس کا نافرمانی ہونا ایمان ہے اور یہ اطاعت ہے۔ اور اس میں اس کے لیے تنبیہ ہے جس کے لیے دل ہو (لِمَنْ كانَ لَهُ قَلْبٌ)۔ پس آخرت میں معاملہ اسی امر کی طرف لوٹ جائے گا جس پر یتیم بلوغت سے پہلے تھا۔ اور ہم نے یتیم کا ذکر اس لیے کیا، حالانکہ ہر بچہ بلوغت سے کم اسی طرح ہے، باوجود اس کے کہ وہ یتیم نہیں ہے، کیونکہ یتیم اپنے ولی کی تدبیر میں ہوتا ہے، اور ولی اللہ ہے، کیونکہ وہ مومنوں کا ولی ہے۔ اور غیر یتیم اپنے باپ کی تدبیر میں ہوتا ہے، پس باپ کی موجودگی میں اس کی طرف نہیں دیکھا جاتا، کیونکہ فرع اپنے قریب ترین اصل سے مدد لیتی ہے۔ کیا تم نہیں دیکھتے کہ پھل اپنے لیے کوئی اصل نہیں جانتا مگر درخت کی شاخ کو، کیونکہ وہ شاخ سے مدد لیتا ہے، اور شاخ اس اصل کو جانتی ہے جسے پھل نہیں جانتا۔ اور یتیم جان چکا ہے کہ اس کا باپ ختم ہو چکا ہے، پس اس کا دل ٹوٹ گیا، اور اس کے لیے کوئی اصل نہیں جو اس پر دلالت کرے، پس اللہ کے علماء نے اسے بتایا کہ اس کے لیے صرف وہی ہے جو اس کے باپ کے لیے تھا، اور وہ اللہ ہے۔ پس وہ اپنے معاملات میں اللہ کی طرف رجوع کرتا ہے۔ چونکہ یتیم کا حال اللہ کے ساتھ اس کی ذات میں اس مقام پر تھا، اس لیے اللہ نے اسے غنیمت میں حصہ دیا تاکہ وہ چیز اس پر پوری ہو جائے جو اس کے لیے ہے، اور وہ یہ ہے کہ بچہ افعال کو اپنی طرف منسوب کرتا ہے اور ان میں اس پر کوئی پابندی نہیں ہوتی۔ پس جو یتیم کے سر پر ہاتھ پھیرتا ہے، اسے ہر بال کے بدلے ایک نیکی ملتی ہے، اور یہ غیر یتیم کے لیے نہیں ہے۔\n\nاور مسکین (المساكين) کا حکم یتیم کے حکم جیسا ہے، ظاہری مددگار نہ ہونے کے اعتبار سے۔ پس اللہ نے اس کی کمزوری کو تقویت دی، یعنی اللہ نے اس کی کمزوری میں اضافہ کیا، کیونکہ مخلوق اصلاً کمزور ہے، پس جب اللہ اس کی کمزوری میں اضافہ کرتا ہے تو وہ مسکین ہو جاتا ہے، پس اس میں کوئی حملہ کرنے کی قوت نہیں ہوتی۔ پس اگر وہ حملہ کرے، حالانکہ وہ مسکین ہے، تو اللہ اس سے نفرت کرتا ہے، کیونکہ اس سے وہ ظاہر ہوا جو اس کے حال کے خلاف ہے، پس اس نے خود کو اس چیز کا مکلف بنایا جو اس کے مقام کا تقاضا نہیں کرتی۔ اور اسی لیے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا:\n> ثلاثة لا يُكَلِّمُهُمُ الله ولا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيامَةِ ولا يُزَكِّيهِمْ ولَهُمْ عَذابٌ أَلِيمٌ‏\n> (تین لوگ ہیں جن سے اللہ قیامت کے دن نہ کلام کرے گا، نہ ان کی طرف دیکھے گا، اور نہ انہیں پاک کرے گا، اور ان کے لیے دردناک عذاب ہے)\n> ملك كذاب وشيخ زان وعائل مستكبر\n> (جھوٹا بادشاہ، زنا کرنے والا بوڑھا، اور مستکبر محتاج)\n\nیعنی اس نے تکبر میں مبالغہ کیا، جیسا کہ اللہ نے مسکین میں کمزوری میں مبالغہ کیا ہے۔ کیونکہ وہ مسکین ہونے کی وجہ سے دوہری کمزوری کا مالک ہے: اصل کی کمزوری اور فقر کی کمزوری۔ پس وہ اس کمزوری کی وجہ سے اپنا سر نہیں اٹھا سکتا، برخلاف مالدار کے، جو اپنے اندر مال کی قوت پاتا ہے، اور اسی وجہ سے مال کو مال کہا گیا، کیونکہ وہ اپنے مالک کو مائل کرتا ہے، یا تو خیر کی طرف یا شر کی طرف، وہ اسے اعتدال کی حالت میں نہیں چھوڑتا۔ پس مسکین وہ ہے جو تقدیر کے دھاروں کے نیچے ٹھہر گیا اور اس چیز کو دیکھا جو اللہ کے حکم سے رات اور دن میں آتی ہے، اور اس پر مطمئن ہو گیا جو اللہ نے اس کے ساتھ اور اس پر جاری کیا، اور جان لیا کہ اللہ سے بھاگ کر کوئی پناہ نہیں مگر اسی کی طرف، اور وہ جو چاہتا ہے کرنے والا ہے، اور اس نے یقین کر لیا کہ اس کا حصہ اللہ کی طرف سے وہی ہے جس پر وہ اس حال میں ہے۔ پس اللہ نے اس کے ٹوٹے ہوئے دل کو جوڑ دیا، اپنے اس قول سے:\n> أنا عند المنكسرة قلوبهم‏\n> (میں ان کے پاس ہوں جن کے دل ٹوٹے ہوئے ہیں)\n\nکیونکہ جب تم کسی ٹوٹے ہوئے دل والے کے پاس جاؤ گے، تو تم اس کے پاس اللہ کے سوا کوئی ہم نشین نہیں پاؤ گے، حال اور قول کے اعتبار سے۔ پس اللہ نے اس کے لیے غنیمت میں اپنا حصہ مقرر کیا، اگرچہ اس نے اس میں کوئی عمل نہیں کیا، پس دوسرے نے اس کی خدمت کی اور اسے اس چیز سے راحت ملی جو اللہ نے اس تک پہنچائی، جس میں دوسرے نے محنت کی اور تھکا، جیسے وہ مومن جسے علم نہیں اور وہ اہل جنت میں سے ہے، وہ موقف میں اللہ کے علماء کی منزلیں دیکھتا ہے، پس وہ حسرت کرتا ہے اور نادم ہوتا ہے۔ پس اللہ ان علماء میں سے جو اہل نار میں سے ہیں، ان کی طرف متوجہ ہوتا ہے، اور ان سے ان کے علم کا لباس اتار کر اس مومن کو پہنا دیتا ہے تاکہ وہ اس علم کی منزل میں جنت میں بلند ہو جائے، کیونکہ ہر علم کے لیے جنت میں ایک منزل ہے جس میں صرف وہی اترتا ہے جس نے وہ علم قائم کیا ہو، کیونکہ علم جنت میں اپنی منزل کا طالب ہوتا ہے، اور وہ عالم جس کے پاس یہ علم تھا، وہ اہل نار میں سے ہے جو اس کے اہل ہیں، اور علم خود سے قائم نہیں ہوتا کہ وہ خود سے اس منزل میں اتر جائے، پس اسے کسی محل کی ضرورت ہے جس کے ساتھ وہ قائم ہو، پس اللہ اسے اس سعید مومن کو پہنا دیتا ہے جسے علم نہیں، پس علم اسے اپنی منزل تک بلند کر دیتا ہے۔ پس یہ کتنی عظیم حسرت ہے! لیکن تم پر یہ جاننا باقی ہے کہ یہ اہل نار میں سے کون سا علم سلب کیا جاتا ہے؟ اور وہ یہ ہے کہ اگر وہ حقیقت میں علم پر تھا، لیکن دنیا میں اس پر اس میں شبہہ داخل ہو گیا، پس اس کی حیرت محل نظر میں ہے، اور جہاں تک اس کے علم کو اس سے زائل کرنے کا تعلق ہے، باوجود اس کے کہ وہ جانتا تھا کہ وہ کس پر تھا، مگر اس نے دنیا میں اس کے بارے میں یہ اعتقاد رکھا کہ وہ جہالت ہے، پس جب وہ آخرت میں ہوگا تو اسے معلوم ہوگا کہ وہ علم تھا۔ پس یہی وہ علم ہے جو سلب کیا جاتا ہے اور اس شخص کو پہنا دیا جاتا ہے جو عالم نہیں اور اہل جنت میں سے ہے۔ اور اگر معاملہ وہی ہے جو ہم نے ذکر کیا، تو اللہ دنیا میں موت کے وقت اہل نار میں سے جو اس کے اہل ہیں، ان کے پاس صرف وہی علم باقی رکھتا ہے جو اہل نار کے لیے مناسب ہے، اور اس کے علاوہ وہ علوم جو صرف اہل جنت کے لیے ہی مناسب ہیں، اللہ اس کے عالم پر دنیا میں یا احتضار کے وقت ایک شبہہ داخل کر دیتا ہے جو اسے علم سے ہٹا دیتا ہے یا اسے حیران کر دیتا ہے، پھر وہ اسی پر مر جاتا ہے، حالانکہ وہ حقیقت میں علم تھا۔ پس یہ صنف کا علم ہے جو اہل جنت کو پہنا دیا جاتا ہے اگر انہیں دنیا میں اس کا علم حاصل نہ ہوا ہو، اور اہل نار میں سے جو اسے جانتا تھا، وہ اس کی طمع کرتا ہے، پس اس پر حجت قائم کی جاتی ہے کہ وہ شبہہ پر مرا۔ پس یہ مسکین کا غنیمت میں حصہ ہے۔ کیونکہ وہ علم جو دنیا میں شبہہ کی وجہ سے اس سے سلب کیا گیا، اس نے اس میں اپنے نفس سے جہاد کیا اور تھکا، پس جب اس نے غنیمت حاصل کی اور شبہہ داخل ہوا، تو وہ علم مسکین کا حصہ بن گیا۔\n\nجہاں تک ابن سبیل (راہی) کا تعلق ہے، تو ابن سبیل اللہ کے نزدیک سب سے اعلیٰ گروہ ہیں۔ کیونکہ بیٹا اپنے باپ سے انکار نہیں کر سکتا۔ اور اسے ابن سبیل اس لیے کہا گیا کہ اس نے جان لیا کہ ٹھہرنا محال ہے اور ایک ہی امر پر استقرار محال ہے، نہ اپنی ذات کے حق میں اور نہ اپنے رب کے ظہور (التجلی) کے حق میں، بلکہ نہ اپنے رب کے حق میں، کیونکہ وہ اپنی مخلوق کے شأن میں ہے اور ان میں امر ہمیشہ نیا ہوتا ہے۔ اور جس کا قدم مستحکم نہ ہو، اسے چلنے والا ہونا ضروری ہے، یعنی متحرک، اور وہ صرف ایک راستے میں ہی حرکت کرتا ہے، اور وہ سبیل (راستہ) ہے۔ اور اس کا چلنا ہمیشہ دنیا اور آخرت میں ہے، پس وہ دنیا اور آخرت میں ابن سبیل ہے۔ اور چونکہ وہ اپنے راستے کے لیے فارغ ہے اور اس میں مشغول ہے، اس میں سفر کر رہا ہے، اور مسافر کو زادِ راہ کی ضرورت ہوتی ہے، پس اللہ نے اسے غنیمت میں حصہ دیا، پس حق (الحق) اسے اس چیز سے غذا دیتا ہے جس میں اس نے کوئی عمل نہیں کیا۔ اور ہو سکتا ہے کہ اس آیت میں ابن سبیل سے مراد مجاہد ہی ہو، اور سبیل سے مراد الف لام (ال) کی وجہ سے جو عہد اور تعریف کے لیے ہیں، اللہ کا راستہ (سبیل اللہ) ہو، جس کے بارے میں اللہ نے فرمایا:\n> ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله\n> (اور ہرگز گمان نہ کرو کہ جو اللہ کی راہ میں قتل کیے گئے)\n\nیعنی شہداء جو جہاد میں قتل ہوئے، پس مجاہد کا غنیمت میں حصہ بھی وہی مقدار ہوگی جو اللہ نے ابن سبیل کے لیے مقرر کی ہے، اور وہ معلوم ہے، اس کے علاوہ جو اسے صدقات میں ملتا ہے۔ پس یہ جان لو، کیونکہ یہ ایک اچھی تنبیہ ہے،\n> إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ وما أنزل الله على عبده يوم الفرقان\n> (اگر تم اللہ پر اور اس پر ایمان لائے ہو جو اللہ نے اپنے بندے پر یوم فرقان کو نازل کیا)\n\nپس اس نے اس چیز سے فرق کیا جو اللہ نے اسے دو کلمات کے ذریعے دو قدموں سے کرسی میں ظاہر ہونے والی دو جماعتوں کے درمیان بتایا، جب اہل اللہ، اور وہ آخرت کے بیٹے ہیں، اللہ کی طرف قربت اور مقام زلفیٰ کے حصول کے لیے دنیا کے کنارے پر ابن سبیل تھے (بِالْعُدْوَةِ الدُّنْيا)، اور وہ اللہ سے دور کے کنارے پر تھے (وَهُمْ بِالْعُدْوَةِ الْقُصْوىٰ)، اور وہ دنیاوی زندگی کے بیٹے اور اس کے راستے کے بیٹے ہیں۔\n> وَالرَّكْبُ أَسْفَلَ مِنْكُمْ\n> (اور قافلہ تم سے نیچے تھا)\n\nپس اس نے پستی ان کے لیے مقرر کی، کیونکہ کافروں کا کلمہ پست تھا (كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلىٰ)، اور جو تم سے نیچے ہو، تم اس سے بلند ہو، کیونکہ تم اہل اللہ ہو جن کے لیے سعادت ہے، کیونکہ اللہ کا کلمہ بلند تھا (كَلِمَةَ الله هِيَ الْعُلْيا)۔ اور یہ سب اللہ کے حکم اور فیصلے سے ہے، نہ کہ کسی سابقہ ہاتھ کی وجہ سے، بلکہ ایک الٰہی عنایت کی وجہ سے جو پہلے سے موجود تھی، اللہ تعالیٰ فرماتا ہے:\n> إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ‏\n> (بے شک وہ لوگ جن کے لیے ہماری طرف سے بھلائی سبقت کر چکی ہے، وہ اس سے دور رکھے جائیں گے)\n\n> خبردار! بے شک اہل اللہ دنیا کے کنارے پر ہیں (بِالْعُدْوَةِ الدُّنْيا)\n> جیسا کہ اہل شرک دور کے کنارے پر ہیں (بِالْعُدْوَةِ الْقُصْوىٰ)\n> پس جسے اس نے دور کیا وہ پستی سے ممتاز ہوا\n> اور جسے اس نے قریب کیا وہ بلندی سے کامیاب ہوا\n> کیا تم نہیں دیکھتے کہ قافلہ ان سے نیچے ہے\n> پس ہر فریق اپنے مقام سے قریب ہے۔\n\nاور جب ہم نے دیکھا کہ اللہ نے اس مقام پر اور اس نوع کی تقسیم میں جو کہ غنیمت ہے، خمس (پانچواں حصہ) کو خاص کیا، تو ہم نے جان لیا کہ اللہ نے عالم میں جن تقسیموں کا اعتبار کیا، ان میں سے صرف لشکر کی رعایت کی ہے جب وہ ملاقات کرتے ہیں، اس حیثیت سے کہ وہ ایک قاہر بادشاہ ہے، جہاں اس نے اپنے لیے ایسے دشمن ثابت کیے جو اس سے جھگڑا کرتے ہیں۔ اور ملاقات کے وقت لشکر کی تقسیم پانچ حصوں پر ہوتی ہے: قلب (مرکز)، اور یہ امام کا مقام ہے، اور یہ وہی ہے جسے اللہ نے اپنے بندے کی نشأت سے چنا،\n> حين قال وسعني قلب عبدي‏\n> (جب اس نے فرمایا: میرے بندے کا دل میری وسعت میں آ گیا)\n\nاور جو باقی بچا وہ میمنہ (دایاں بازو)، میسرہ (بایاں بازو)، مقدمہ (اگلا حصہ) اور ساقہ (پچھلا حصہ) ہے۔ اسی لیے خمس اللہ کے لیے تھا اور باقی چار خمس ان کے لیے جو باقی ہیں۔ کیونکہ جس دشمن کو اللہ نے مقرر کیا، اللہ نے اس کے بارے میں خبر دی کہ وہ ہمارے آگے سے اور ہمارے پیچھے سے آئے گا، پس ہم اس سے مقدمہ اور ساقہ سے ملتے ہیں، اور ہماری دائیں جانب سے، پس ہم اس سے میمنہ سے ملتے ہیں، اور ہماری بائیں جانب سے، پس ہم اس سے میسرہ سے ملتے ہیں۔ اور دشمن کا مقصد صرف قلب (مرکز) میں ہوتا ہے تاکہ وہ لشکر کی بادشاہت کو ختم کر دے، اس کا مقصد صرف یہی ہوتا ہے۔ پس اللہ نے بندے کے دل کی حفاظت کی، جو اس کی نظر کا مقام ہے جسے اس نے وسیع کیا، ان لوگوں کے ذریعے جنہیں اس نے ان جگہوں پر مقرر کیا جہاں سے دشمن داخل ہوتا ہے۔ پس یہ لشکر اسی کے لیے قتال کرتا ہے، اور یہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کا قول ہے:\n> إن الذي يقاتل في سبيل الله هو الذي يقاتل لتكون كلمة الله هي العليا وكَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى‏\n> (بے شک وہ جو اللہ کی راہ میں قتال کرتا ہے، وہ وہ ہے جو اس لیے قتال کرتا ہے تاکہ اللہ کا کلمہ بلند ہو اور کافروں کا کلمہ پست ہو)\n\nاور وہ دشمن ہیں۔ پس وہ انہیں باطن میں قلب سے مدد دیتا ہے، اور وہ ظاہر میں ان سمتوں سے اس کی حفاظت کرتے ہیں جہاں سے دشمن موقع تلاش کرتا ہے۔ پس اسی وجہ سے غنیمت میں اس کے لیے خمس تھا، جس پر اس نے نص مقرر کی کہ وہ اس کا حصہ ہے، کیونکہ وہ اپنے دشمنوں کے مقابلے میں مومنوں کا مددگار ہے، اور لشکر اس کے دین کا مددگار ہے۔\n> ذلِكَ بِأَنَّ الله مَوْلَى الَّذِينَ آمَنُوا وأَنَّ الْكافِرِينَ لا مَوْلى‏ لَهُمْ\n> (یہ اس لیے کہ اللہ ایمان والوں کا مولیٰ ہے اور کافروں کا کوئی مولیٰ نہیں)\n\nپس ان کے پاس کوئی قلب نہیں جو ان کی مدد کرے۔\n\n> بے شک اللہ کے لیے ایک وافر حصہ ہے\n> وہ مالِ فے کا خمس ہے بغیر کسی زیادتی کے\n> پس اس کے لیے وہ قلب ہے جسے وہ آباد کرتا ہے\n> اور وہ عظمت والا الٰہی عرش ہے\n> اور جو باقی بچا، اسے اس نے تقسیم کر دیا\n> یہ اس کی طرف سے بعض بندوں کے لیے خاص ہے۔\n> پس جس نے وہ حاصل کیا جو میرے قلم نے لکھا\n> وہ اس سے کامیاب ہوا جو ہستی (الوجود) عطا کرتی ہے\n> پس وہ رسول ہے یا وارث ولی\n> ہمارے علم میں اس کے لیے شہود (الشہود) کے سوا کچھ نہیں\n> اور جو اللہ جانتا ہے، تو\n> مجھے اس میں کوئی علم نہیں مگر یہ کہ وہ عطا کرے۔\n\nاور اس منزل میں یہ علم ہے کہ کیا ایک علم تمام معلومات سے متعلق ہوتا ہے یا ہر معلوم کے لیے ایک علم ہوتا ہے، یا یہ عالم کے اعتبار سے مختلف ہوتا ہے، اور علم کیا ہے؟ کیا وہ عالم کی ذات ہے یا اس کے ساتھ قائم ایک صفت ہے یا ایک نسبت جو نہ عالم کی ذات ہے اور نہ اس کی صفت؟ اور اس میں یہ علم ہے کہ اشیاء کے درمیان مناسبتیں الفت اور اجتماع سے کیا نتیجہ پیدا کرتی ہیں۔ اور اس میں یہ علم ہے کہ جس نے تمہارے عمل کے ساتھ عمل کیا، وہ تم میں سے ہے۔ اور اس میں استناد (بھروسہ) کا علم ہے اور مستند کی حفاظت اور مشقت میں اس کی شرکت، اور اس چیز کو چھوڑ دینا جسے چھوڑنا مناسب سمجھا جائے، اگرچہ وہ تمہیں محبوب ہو، اور وہ ایمان جسے کوئی چیز متزلزل نہ کرے۔ اور اس میں یہ علم ہے کہ مکارم اخلاق اس شخص پر کیا واجب کرتے ہیں جس میں وہ قائم ہوں۔ اور مقامات کا علم اور جو اس منزل سے خاص ہیں۔ اور اس میں کثیر اور قلیل کا علم ہے، اور کون بالقوۃ کثیر ہے اور کون بالعدد کثیر ہے۔ اور اسی طرح قلت میں۔ اور اس میں ایک ایسا علم ہے جس میں قدم پھسلنے کا مقام ہے، اور وہ یہ ہے کہ وہ تمہیں یہ حق دیتا ہے کہ تم ہر اس شخص کے ساتھ ہو جو تم سے کوئی امر چاہتا ہے، یا تم اس کے لیے ہو جاؤ جو وہ تم سے چاہتا ہے، اور یہ قدم پھسلنے کا مقام ہے اغراض کے اختلاف کی وجہ سے اور مومن کو اس حکم کی قید میں رکھنا جو اسے سونپا گیا ہے۔ اور اس میں یہ علم ہے کہ کس چیز کے لیے تیاری کرنی چاہیے اور کس کے لیے نہیں کرنی چاہیے۔ اور اس میں یہ علم ہے کہ جس کے معاملے سے تم ناواقف ہو، اس کے ساتھ کیسا معاملہ کیا جائے۔ اور اس میں یہ علم ہے جس سے یہ معلوم ہوتا ہے کہ عالم میں سے یا حق (الحق) میں سے تمہارے مقابلے میں تمہاری صفت کے سوا کوئی نہیں آتا۔ اور اس میں حکم میں سروں کو دموں سے ملانے کا علم ہے، اور وہ وہ حال ہے جس میں رئیس اور مرئوس برابر ہو جاتے ہیں، جیسے نوع وسط جو اپنے سے اوپر کے لیے نوع ہے اور اپنے سے نیچے کے لیے جنس ہے۔ اور اس میں تحریش (فساد انگیزی) کا علم ہے، پھر اس سے براءت، کیا وہ براءت فائدہ دیتی ہے یا نہیں؟ اور اس میں بیداری میں محسوس کی صورت میں خیال کے ادراک کا علم ہے، اور وہاں کوئی محسوس چیز نہیں ہے جو باہر سے یا اندر سے خیالی ہو، بلکہ وہ سراب کی طرح ہے جسے تم پانی دیکھتے ہو، اور سراب میں چھوٹی چیز کو تم بڑا دیکھتے ہو، اور سفید پہاڑ کو تم دور سے کالا دیکھتے ہو، پس یہ حس اور خیال سے باہر ہے۔ اور اس میں اس سبب کا علم ہے جو انسان کو اپنی ذات کے لیے ہلاکت کی دعا کرنے پر اکساتا ہے اور اپنی ذات میں اس چیز کی علامت طلب کرتا ہے جو اسے تباہ کر دے۔ اور اس میں اس چیز کا علم ہے جسے وہ گمان کرتا ہے کہ وہ اس پر قادر ہے حالانکہ وہ قادر نہیں ہے، اور اعجاز کس چیز کی طرف لوٹتا ہے؟ کیا وہ کسی ایسے امر کی طرف لوٹتا ہے جس پر مخلوق قادر نہیں، یا کسی ایسے امر کی طرف جس پر وہ قادر تھا پھر اسے اس سے پھیر دیا گیا؟ اور اس میں اس علم کا علم ہے جو تقویٰ (التقوىٰ) متقی میں پیدا کرتا ہے۔ اور اس میں رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم اور مومنوں کے درمیان فرق کا علم ہے۔ اور اس میں اس علم کا علم ہے جو مخاطب مخاطب سے چاہتا ہے جب وہ اس سے کلام کرتا ہے۔ اور اس میں اس علم کا علم ہے جو ظاہر ہوتا ہے کہ وہ اللہ کے لیے ہے حالانکہ وہ کون (کائنات) کے لیے ہے، اور ظاہر ہوتا ہے کہ وہ کون کے لیے ہے حالانکہ وہ اللہ کے لیے ہے۔ اور اس میں جہات، احاطہ، سکون اور حرکت کا علم ہے۔ اور اس میں اخروی منافع کا علم ہے۔ اور اس میں اس سبب کا علم ہے جو خوف کے مقام پر امان کو واجب کرتا ہے، کیا یہ صحیح ہے یا نہیں؟ اور مقام کا معنی کیا ہے؟ کیا وہ شخص میں حال ہے، پس اس کا مقام اس کا حال ہے، یا مقام حال سے باہر ہے؟ اور اس میں ان اسباب کا علم ہے جو نفوس میں حکم کرنے والے اوہام کے وجود کو واجب کرتے ہیں، اور وہ الٰہی ظہور (التجلی) کی صورتوں میں سے صورتیں ہیں۔ اور اس میں اس علم کا علم ہے کہ کون سا سوال قابل تعریف ہے اور کون سا ناپسندیدہ ہے۔ اور اس میں صلاح اور اصلح کی رعایت کا علم ہے، اور یہ کس پر واجب ہے۔ اور اس میں وعدہ اور وعید کا علم ہے، اور شرعاً کس کے ساتھ قتال واجب ہے جب دونوں لشکر آمنے سامنے ہوں اور لوگ قتال کے لیے صف آرا ہوں۔\n> وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n> (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)",
    "fa": "«باب سیصد و هفتاد و ششم» در معرفت منزلی که اولیا و دشمنان را از حضرت حکمیه (الحضرة الحكمية) گرد هم می‌آورد و در آن عالم غیب با یکدیگر به مبارزه می‌پردازند. این منزل شامل هزار مقام محمدی است.\n\n> إن المغانم نار الحق تأكلها *** فمن يكن بدلا منها فقد عصما\n> غنیمت‌ها آتشی از حق (الحق) هستند که آن‌ها را می‌بلعد *** پس هر که بدل آن‌ها باشد، در امان مانده است.\n\n> منها فليس لها عليه سلطنة *** فذلك نائبه في الخلق قد حكما\n> از آن آتش، پس بر او سلطه‌ای ندارد *** و آن شخص، نایب حق (الحق) است که در خلق حکم رانده است.\n\n> وما مضى فهو منسوخ بعامله *** يوم القيامة بالنسخ الذي رسما\n> و آنچه گذشته است، به وسیله عاملش نسخ می‌شود *** در روز قیامت، با نسخه‌ای که ترسیم شده است.\n\n> فالكل ينعم ملتذ بمنزله *** أهل الجنان وأهل النار والقدماء\n> پس همه در منزل خود متنعم و لذت‌برنده‌اند *** اهل بهشت و اهل دوزخ و پیشینیان.\n\n> من لم يكن حظه علما ومعرفة *** فما تقدم في شأو الهوى قدما\n> هر کس بهره‌اش علم و معرفت (المعرفة) نباشد *** در میدان هوا و هوس قدمی پیش ننهاده است.\n\n> الله يرزقها من علم رحمته *** حظا يبلغنا منازل العلما\n> خداوند از علم رحمت خود، آن را روزی می‌دهد *** بهره‌ای که ما را به منازل علما می‌رساند.\n\n### [اینکه خداوند بهره‌ای فراوان از بهره‌های بندگانش دارد]\n\nبدان که خداوند متعال در این منزل برای بندگانش آشکار ساخته است که او بهره‌ای فراوان از بهره‌های بندگانش دارد. به همین دلیل، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «حق الله أحق بالقضاء» (حق خداوند سزاوارتر به اداء است)؛ یعنی از حق مخلوق. و در قرآن عزیز فرمود: «من بَعْدِ وَصِيَّةٍ يُوصِي بِها أَوْ دَيْنٍ» (پس از وصیتی که کرده یا دِینی)، و وصیت را بر دِین مقدم داشت. وصیت حق خداست، زیرا اوست که آن را بر ما واجب کرده است، هنگامی که وصیت‌کننده آن را در مالی که در آن تصرف دارد، واجب می‌سازد. اما فقها دِین را بر وصیت مقدم می‌دارند، برخلاف آنچه حکم خدا بر آن وارد شده است، مگر برخی از اهل ظاهر که وصیت را بر دِین مقدم می‌دارند و من نیز به همین قول معتقدم. خداوند بهره‌ای را که برای خود در نماز قرار داده، نصف قرار داده است، که کمتر از آن بهره دیگر است.\n\nپس فرمود: «قسمت الصلاة بيني وبين عبدي نصفين نصفها لي ونصفها لعبدي ولعبدي ما سأل» (نماز را میان خود و بنده‌ام دو نیم کردم؛ نیمی برای من و نیمی برای بنده‌ام، و برای بنده‌ام هر چه بخواهد). پس سبحانه در این تقسیم، میان خدا و بنده‌اش در هنگام نماز مساوات برقرار کرد. و در مورد بهره خود در غنیمت فرمود که خمس (یک پنجم) غنیمت تنها برای اوست، و باقی‌مانده که چهار پنجم است، بر پنج سهم تقسیم می‌شود. پس بهره هر صنف از این سهم، کمتر از بهره‌ای است که برای خداست. بنابراین، بهره خدا در این مال تقسیم‌شده، نسبت به این حال میان او و بندگانش، بیشتر از بهره او در نماز است. وگرنه، بهره نصف (در نماز) از بهره خمس (در غنیمت) عظیم‌تر است؛ پس سهم نماز بیشتر از سهم غنیمت است. اما با نظر به عین موطن و تقسیم خاص، بهره او در غنیمت، با توجه به آنچه از اصناف تقسیم‌شونده باقی می‌ماند، عظیم‌تر است.\n\nپس حق (الحق) خود را در میان بندگانش به منزله خودشان قرار داد و با آنان به گونه‌ای رفتار کرد که خودشان با یکدیگر رفتار می‌کنند. و در موطنی دیگر می‌فرماید: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (هیچ چیز مانند او نیست)، پس مماثلت را نفی کرد. و در موضعی دیگر، کسی که از او ترجمه می‌کند، می‌گوید: «إن الله خلق آدم على صورته» (خداوند آدم را بر صورت خود آفرید). سپس انسان را محل ظهور اسماء در او قرار داد و آن‌ها را بر او اطلاق کرد. پس بنده حق دارد که به هر اسمی که حق (الحق) به آن نامیده شده، نامیده شود، اگرچه نسبت‌ها متفاوت باشند، اما معقولیت مدلول اسم یکی است و تغییر نمی‌کند.\n\nسپس برخی از آنان را خلیفه (الخليفة) خود در زمین قرار داد و برای او در خلق، حکم قرار داد و آنچه را که باید با آن حکم کند، برایش تشریع کرد و احدیت (الأحدية) را به او بخشید. پس تشریع کرد که هر کس در رتبه او با او منازعه کند، منازع کشته شود. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «إذا بويع لخليفتين فاقتلوا الآخر منهما» (اگر با دو خلیفه بیعت شد، دومی را بکشید). و تصرف در بیت‌المال را به دست او سپرد و نظر کلی را به او واگذار کرد و ما را به اطاعت از او امر کرد، چه بر ما ستم کند و چه در حق ما عدالت ورزد. خداوند متعال فرمود: «يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ» (ای کسانی که ایمان آورده‌اید، از خدا اطاعت کنید و از پیامبر و صاحبان امر خود اطاعت کنید)، و آنان خلفا و کسانی هستند که امام، آنان را به نیابت خود گمارده است. زیرا خداوند برای او قرار داده است که جانشین تعیین کند، همان‌گونه که خداوند او را جانشین قرار داده است. پس بخشش و منع، مجازات و عفو، همه بر اساس میزان مشروع، در دست آنان است. آنان حق تولیت و عزل دارند، همان‌گونه که حق (الحق) میزان را در دست دارد و قسط را پایین می‌آورد و بالا می‌برد.\n\nو آن میزان همان است که با قول خود: «وَضَعَ الْمِيزانَ» (و میزان را برقرار کرد)، آن را به زمین نازل کرد. سپس فرمود که عمل روز را قبل از عمل شب و عمل شب را قبل از عمل روز به سوی او بالا می‌برند. همچنین، خلیفه نیز اعمال رعیت را به سوی او بالا می‌بریم؛ کارگزاران و جمع‌آوری‌کنندگان او آن را بالا می‌برند. پس هر چه را بخواهد می‌پذیرد و هر چه را بخواهد رد می‌کند. پس هر تصرفی را که حق (الحق) برای خود در خلقش ذکر کرده و آن را معین نکرده است، برای امام قرار داده شده که آن را در بندگانش تصرف کند.\n\nسپس خداوند برای خود دشمنانی قرار داد که در الوهیت (الألوهية) او منازعه می‌کنند، مانند فرعون و امثال او. همچنین، خداوند برای خلفا نیز منازعانی در رتبه آنان قرار داد و برای او قرار داد که با آنان بجنگد و هر کس از آنان را که بر او ظفر یابد، بکشد، همان‌گونه که سبحانه با مشرکان رفتار می‌کند. و مدت اقامت آنان مانند مدت مهلت دادن خدا به آنان است. و گرفتن خلیفه و ظفر یافتن او بر آنان، مانند زمان مرگ برای این افراد است. به طوری که اگر دو نسخه را با هم مقایسه کنی، در یک حرف از حکم با هم اختلاف نخواهند داشت.\n\nو همان‌گونه که حق (الحق) با علم سابق خود در خلقش حکم می‌کند، خلیفه نیز با غلبه گمان خود حکم می‌کند. زیرا خلیفه رتبه علم به هر آنچه در ملک او می‌گذرد را ندارد و حق‌دار را از باطل‌گر نمی‌شناسد، بلکه حکم او بر اساس آنچه بینه (شاهد) می‌گوید، است؛ همان‌گونه که خداوند با خلق خود رفتار می‌کند، با وجود علمش.\n\nدر روز قیامت، شاهدان را بر خلق خود اقامه می‌کند و آنان را مجازات نمی‌کند، مگر پس از اقامه بینه بر آنان، با وجود علمش. و به همین دلیل، کسی که گفته است حاکم حق ندارد با علم خود حکم کند، این را گفته است. اما در مورد عالم، به دلیل تهمت به غرضی که دارد؛ و اما در جانب حق (الحق)، برای اقامه حجت بر محکوم‌علیه است تا در آخرت او را مجازات نکند، مگر به آنچه در دنیا بر زبان رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) برای او تشریع کرده است. به همین دلیل، رسول به پروردگارش از امر پروردگارش می‌گوید: «رَبِّ احْكُمْ بِالْحَقِّ» (پروردگارا، به حق حکم کن)؛ یعنی به حقی که مرا با آن مبعوث کردی و برایم تشریع کردی که با آن در میان آنان حکم کنم.\n\nپس اگر دانستی که حق (الحق) خود را در خلقش به منزله آنان قرار داده و کامل‌ترین مظهر (مجلاه الأتم) خود را در خلیفه امام قرار داده است، سپس فرمود: «كلكم راع وكلكم مسئول عن رعيته» (همه شما شبانید و همه شما مسئول رعیّت خود هستید). پس امامت همه خلق را در بر گرفت. در نتیجه، هر شخصی از آنان مرتبه امامت را به دست آورد. پس او این مقدار از حق (الحق) را دارد و به اندازه‌ای که خداوند او را مالک تصرف در آن کرده است، تصرف می‌کند. پس هیچ انسانی نیست مگر اینکه بر صورت حق (الحق) است، جز اینکه در امام اکبر، مظهر (مجلاه) او آشکارتر، امر او عظیم‌تر و اطاعت از او رساتر است.\n\nو بدان که خداوند متعال هنگامی که آنچه را برای بندگانش تشریع کرد، آن را به فرض‌هایی تقسیم کرد که بر مکلفین از بندگانش واجب ساخت. و این بر دو قسم است: فرضی که از جانب خود بر آنان واجب کرد، مانند نماز، زکات، روزه، حج، طهارت و آنچه شبیه آن است، از آنچه از جانب خود بر آنان واجب کرد. و فرض دیگری که خودشان بر خود واجب کردند و چنین نبود، پس خداوند آن را بر آنان واجب کرد تا بر آن پاداش واجب الهی بگیرند و تا خداوند نزد ما محقق سازد که انسان بر صورت اوست. زیرا خداوند بر خود واجب کرده است که مؤمنان را یاری کند، و رحمت و امثال آن را. این در حق علمای بالله است. و در حق قومی، آن را به عنوان عقوبت بر آنان واجب کرد، هنگامی که خودشان آن را بر خود واجب کردند، مانند نذر، و در وجوب بر نفس با ربوبیت (الربوبية) مزاحمت کردند. پس خداوند آن را بر آنان واجب کرد تا به آنان بشناساند که حق ندارند بر خود واجب کنند، و بدین وسیله قدر خود را بشناسند.\n\nپس اگر حق (الحق) متعال آنچه را بر خود واجب کرده بود، انجام نمی‌داد، هیچ نکوهش و ملامتی متوجه او نمی‌شد، زیرا رتبه او اقتضا می‌کند که او فعال لما یرید (انجام‌دهنده هر آنچه می‌خواهد) است. به همین دلیل، حد واجب به وجوب او بر نفس خود تعلق نمی‌گیرد. اما بنده، هنگامی که خداوند آنچه را بر خود واجب کرده بود، بر او واجب کرد، اگر به صورت آنچه بر خود واجب کرده بود، عمل نکند، حد واجب به او تعلق می‌گیرد، مانند واجب اصلی که اگر به آن عمل نکند، مجازات می‌شود. پس پاداش او عظیم است و عقوبت بر کسی که به آن عمل نکند، عظیم است، در هر دو واجب.\n\nسپس آنچه از افعال، افزون بر صورت واجبات آمد، نافله (النوافل) نامیده شد؛ یعنی افزون بر واجب. اگر آن افزوده، عین صورتی در فرایض نداشت، نافله نبود، بلکه عملی مستقل بود که مرتبه‌ای در پاداش داشت که برای نوافل نیست. سپس نشئه (النشأة) را در هم آمیخت، همان‌گونه که نشئه مکلف را در هم آمیخت. پس در نشئه فرایض، سنت‌هایی قرار داد که زوائدی بر فرایض هستند. و در نوافلی که بنده از جانب خود و بدون وجوب فرایض، داوطلبانه انجام می‌دهد، در نشئه نوافل قرار داد. به همین دلیل، اگر در روز قیامت فرایض را کامل نیاورد، خداوند می‌فرماید: «فریضه بنده‌ام را از عمل داوطلبانه او کامل کنید.» پس آنچه از فرض واجب ناقص شده، از فرض موجود در نوافل کامل می‌شود. و آنچه از سنت‌های فرض واجب ناقص شده، از سنت‌های نوافل کامل می‌شود. هر چیزی را به مانند خود ملحق کرد. یکی از ارواح به من گفت: پس چرا غنائم، انفال (النوافل) نامیده شدند؟ گفتیم: شکی نیست و بر هیچ مؤمن عالم به شریعت پوشیده نیست که خداوند قتال را برای مؤمن قرار نداد، مگر برای اینکه کلمه الله (سخن خدا) برتر باشد و «كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى‏» (سخن کسانی که کفر ورزیدند، پست‌تر است)، تا این دو کلمه از هم متمایز شوند، همان‌گونه که دو قدم متمایز شدند. زیرا او از هر چیزی دو زوج آفرید، ذاتاً و حکماً.\n\nو مترجمان از جانب خدا، که همان رسولان خدا هستند، به ما شناساندند که خداوند متعال از زمانی که جهاد، قتال و اسارت را تشریع کرد، غنائم را طعمه‌ای برای آتش قرار داد و آن را بر آتش واجب کرد. و از اطاعت آتش نسبت به پروردگارش این بود که جز آنچه خداوند برایش حلال کرده بود، نمی‌خورد. و خداوند بر آتش حرام کرده بود که غنیمت را بخورد، اگر در آن خیانتی (غلول) از سوی مجاهدان رخ داده بود. پس اگر در غنیمت خیانت می‌شد، آتش آن را نمی‌خورد، تا زمانی که آنچه از آن برداشته شده بود، بازگردانده شود تا عمل برای مجاهد خالص شود.\n\nهنگامی که شریعت محمدی آمد، خداوند غنائم را برای امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) طعمه‌ای افزود بر آنچه از غیر آن به آنان خورانده بود. پس آن طعمه‌ای که ما از آتش گرفتیم، نافله‌ای (النوافل) برای این امت بود. و خداوند آن را به آنان نداد به دلیل اینکه جهاد کردند، زیرا اگر این حق آنان به دلیل جهاد بود، هیچ کس که با آنان جهاد نکرده بود، در آن شریک نمی‌شد. پس این فریضه‌ای برای مجاهدان نیست، بلکه طعمه‌ای است که خداوند به کسانی که ذکر شدند، خورانده است. و برای خود نصیبی قرار داد، به دلیل اینکه آنان را یاری کرد. پس او در جهاد نصیب دارد.\n\nچون سبب اینکه خداوند برای خود در آن نصیبی قرار داد، یاری دین خدا بود، پس هر کس دین خدا را یاری کند، در نصیب خدا مندرج می‌شود، و آنان همان غازیان هستند. پس اگر آیه را در نظر بگیری، برای آنان جز خمس (یک پنجم) از غنیمت نیست. سپس چهار پنجم باقی می‌ماند که تقسیم می‌شود. یک خمس از آن پنج سهم برای رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است، و پس از رسول، برای خلیفه زمان است، اگر رسول نباشد. و خمس دوم برای اهل بیت، خویشاوندان رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است. و خمس سوم برای یتیمان، و خمس چهارم برای مساکین، و خمس پنجم برای ابن سبیل (در راه مانده) است.\n\nو از برخی علما، و گمان می‌کنم ابن ابی لیلی، روایت شده است که آن بهره‌ای که خمس از اصل بود، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را می‌گرفت و برای کعبه خارج می‌کرد و می‌فرمود: «این برای خداست.» سپس باقی‌مانده را تقسیم می‌کرد.\n\nچون این طعمه برای آتش بود، خداوند آن را به این امت منتقل کرد، همان‌گونه که زکات را در مال انسان، حقی برای اصناف ذکر شده قرار داد. پس بر صاحبان اموال به وجه مخصوصی واجب کرد که آن را خارج کنند و بر امام واجب کرد که آن را بگیرد. اما بر اصناف واجب نکرد که آن را بگیرند. پس آنان در گرفتن حق خود و ترک آن، مانند سایر حقوق، مخیرند. پس هر کس آن را بگیرد، حق خود را گرفته است و هر کس ترک کند، حق خود را ترک کرده است و این حق اوست. و بدان که امام است که به دانستن این تقسیمات و اجرای آن‌ها موظف است.\n\n> ما كل من حاز الجمال بيوسف *** إن الجميل هو الإمام المنصف‏\n> هر کس که جمال را به دست آورد، یوسف نیست *** همانا جمیل، امام باانصاف است.\n\n> إن كنت تدرك ما تريد وتشتهي *** أنت المحب والمبرأ يوسف‏\n> اگر آنچه را می‌خواهی و آرزو داری، درک کنی *** تو محب هستی و یوسف تبرئه‌شده.\n\nپس اگر بر گمان امام غالب شود که سهم کسانی که در آیه «واعْلَمُوا أَنَّما غَنِمْتُمْ» (و بدانید که هر چه غنیمت گرفتید) و آیه‌ای که در سوره حشر است و در آن ذکر اصناف آمده، تنها خمس از غنیمت است که این‌گونه میان آنان تقسیم می‌شود، و باقی‌مانده برای بیت‌المال مسلمانان است که امام در آن به هر نحو که صلاح می‌بیند، تصرف می‌کند. اگر بخواهد، آن را به مجاهدان می‌دهد، بر اساس عدل و مساوات در تقسیم یا با تفاضل، همان‌گونه که در باقی‌مانده مال موروث پس از گرفتن سهم‌های معین‌شده توسط حق (الحق) عمل می‌شود. یا اگر این امام بخواهد، باقی‌مانده را به خویشاوندان (أولی الأرحام) اهل میت بازگرداند و به صاحبان سهم‌ها، افزون بر سهمشان، به دلیل اینکه از خویشاوندان میت هستند، بدهد.\n\nو اگر بر گمان امام غالب شود که خمس اصلی تنها برای خداست و باقی‌مانده برای کسانی است که خداوند نام برده است. و خداوند برای مجاهدان در راه خدا نصیبی در صدقات قرار داده است، اما در غنیمت برای آنان قرار نداده است، مگر آنچه امام قبل از تقسیم به آنان نافله (النوافل) دهد یا آنچه را که با قول خود به او داده است: «من قتل قتيلا فله سلبه» (هر کس کشته‌ای را بکشد، سلب (اموال) او برای اوست).\n\nو سخن در این منزل تنها به دلیل بهره‌ای که به طور خاص به خدا نسبت داده شده، مطرح شد. پس غرض ما حکم غنائم و تقسیم آن در علم رسوم نیست. بلکه غنائم نزد ما در این طریق، همان علوم الهی است که خداوند از طریق مجاهده و جهاد نفس به ما عطا کرده است، همان‌گونه که برای مؤمن در نفس ایمانش تجارتی است، و آن «التجارة المنجية من العذاب الأليم» (تجارتی که از عذاب دردناک نجات می‌دهد) است. پس هر علمی که از جهاد حاصل شود، غنیمت است و بر اساس آنچه غنائم بر آن تقسیم می‌شود، تقسیم می‌گردد.\n\nپس نصیبی که برای خداوند متعال از آن است، همان است که اخلاص (الإخلاص) به آن تعلق می‌گیرد. و نصیبی که برای رسول خداست، ایمان به اوست. و نصیبی که برای ذی‌القربی (خویشاوندان) است، مودت نسبت به آنان است. و نصیبی که برای یتیمان است، علمی است که قبل از رسیدن عامل به غایت حاصل شده است. و حد غایت، آن حدی است که او را از اضافه کردن عمل به خود بی‌نیاز می‌کند. زیرا کودک قبل از بلوغ، حرکت و افعالش به او اضافه می‌شود، اما وقتی بالغ شد، حکم افعال از او به خدا باز می‌گردد، پس از آنکه به او بود. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «لا يتم بعد حلم» (پس از بلوغ، یتیمی نیست). پس هر چه قبل از بلوغ برای او حاصل شده، حق اوست که از نفس خود دارد، زیرا عین او برای خداست.\n\nو نصیبی که برای مساکین است، بهره‌ای است که به واسطه عجز و عدم قدرت و سلب نیرو برای آنان حاصل شده است. زیرا خداوند «ذُو الْقُوَّةِ الْمَتِينُ» (صاحب قدرت استوار) است.\n\nو نصیبی که برای ابن سبیل (در راه مانده) است، بهره‌ای است که از آن جهت که فرزند راه به سوی خداست، برای اوست. زیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «إن للدنيا أبناء وللآخرة أبناء فكونوا من أبناء الآخرة» (دنیا فرزندانی دارد و آخرت فرزندانی، پس از فرزندان آخرت باشید). و آنان فرزندان سبیل (راه) هستند. و از فرزندان دنیا نباشید.\n\nاما صورت اخلاص (الإخلاص) در عمل، این است که به صورت کشف (الکشف) دریابی که عامل آن عمل، خود خداست، همان‌گونه که در نفس‌الامر است؛ هر عملی که باشد، مذموم یا محمود یا هر چه که بود. و این حکم خداست در آن، نه عین عمل. در خبر روشن شده است که خداوند متعال می‌فرماید: «من عمل عملا أشرك فيه غيري فإنا منه بري‏ء وهو للذي أشرك» (هر کس عملی انجام دهد و در آن دیگری را شریک من سازد، من از آن بیزارم و آن عمل برای کسی است که شریک ساخته است). پس عمل را نکره آورد و عمل خاصی را مشخص نکرد. ضمیر «فیه» به عمل باز می‌گردد و ضمیر «منه» به غیر که شریک است، باز می‌گردد و ضمیر «هو» به مشرک باز می‌گردد. زیرا خداوند از عمل بیزار نمی‌شود، چون او بی‌شک عامل است، بلکه از شریک بیزار می‌شود، زیرا شریک عدم است و خداوند وجود است. پس خداوند از عدم مبراست، زیرا عدم به او نمی‌رسد و به آن متصف نمی‌شود، چون او واجب الوجود لذاته است. پس این بیزاری صحیح است.\n\nو همچنین در قول او: «بَراءَةٌ من الله ورَسُولِهِ إِلَى الَّذِينَ عاهَدْتُمْ من الْمُشْرِكِينَ» (بیزاری از سوی خدا و پیامبرش به سوی کسانی از مشرکان که با آنان پیمان بسته‌اید). این نیز بیزاری از شریک است، زیرا شریک در آنجا نیست، پس عدم است، چون فرمود: «من المشركين». پس این نیز بیزاری از شریک است. پس اخلاص (الإخلاص) عمل برای خدا، نصیب خدا از عمل است. زیرا صورت ظاهری در عمل، تنها در شخصی است که خداوند عمل خود را در او ظاهر کرده است. پس امر به دلیل صورت ظاهری مشتبه می‌شود. و ما شک نداریم که عمل به شهود (الشهود) از آن ظاهر است، پس این انتساب صحیح است. به همین دلیل می‌گوییم که او عین هر چیزی از اسم ظاهرش است.\n\nو در اینجا دلیلی پنهان است. و آن این است که بصر (بینایی) جز بر آلت واقع نمی‌شود، و آن آلت برای امر دیگری تصرف می‌کند که حس ظاهر بر آن واقع نمی‌شود، به دلیل مرگ و وجود آلت و سلب عمل. پس آلت، عامل نیست و حس جز آلت را درک نکرده است. پس همان‌گونه که حاکم دانست که ورای محسوس، امری است که با این آلت عمل می‌کند و آن را تصرف می‌دهد، که نزد علمای نظر عقلی به نفس عاقله ناطقه و حیوانی تعبیر می‌شود، پس آنان به معنایی منتقل شدند که از مدرکات حس نیست. همچنین، ادراک اهل کشف (الکشف) و شهود (الشهود) در جمع و وجود در نفس ناطقه، همان چیزی است که اهل نظر در آلت محسوس درک کردند.\n\nپس دانستند که ورای نفس ناطقه، عامل است و آن مسمای الله است. و نفس در این عمل، نزد اهل الله و نزد اهل نظر عقلی، مانند آلت محسوس است. و تا زمانی که این ادراک حاصل نشود، نزد ما متصف به این نمی‌شود که در عمل خود به طور کامل اخلاص (الإخلاص) ورزیده است، با وجود ثبوت آلات و تصرف آن‌ها برای ظهور صورت عمل از عامل. پس تمام عالم، آلات حق (الحق) هستند در آنچه از افعال از آن‌ها صادر می‌شود، برای قومی که می‌دانند.\n\nو رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در آنچه از او صحیح است، فرمود: «أ تدرون ما حق الله على العباد قالوا الله ورسوله أعلم قال فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا ثم قال أ تدرون ما حقهم عليه إذا فعلوا ذلك أن يدخلهم الجنة» (آیا می‌دانید حق خدا بر بندگان چیست؟ گفتند: خدا و رسولش داناترند. فرمود: حق خدا بر بندگان این است که او را بپرستند و چیزی را شریک او قرار ندهند. سپس فرمود: آیا می‌دانید حق آنان بر او چیست، اگر چنین کنند؟ اینکه آنان را به بهشت وارد کند). پس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) با قول خود «شیئاً» (چیزی) را نکره آورد تا همه اشیاء را در بر گیرد، و آن قول خداوند متعال است: «فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً» (پس هر کس امید دیدار پروردگارش را دارد، باید عمل صالح انجام دهد و هیچ کس را در عبادت پروردگارش شریک نسازد). پس «أحداً» (هیچ کس) را نکره آورد تا هر چیزی که احدیت (الأحدية) دارد، زیر آن داخل شود. و هیچ چیزی نیست مگر اینکه احدیت دارد. و ذکر لقاء الله (دیدار خدا) برای دلالت بر حالت رضایت است، بدون احتمال، همان‌گونه که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) ذکر کرد، و آن در بهشت است، زیرا بهشت سرای رضوان است. پس هر کس خدا را ملاقات کند، سعادتمند نیست. پس موطن‌ها در این مورد حکم دارند، به آنچه خداوند در آن‌ها قرار داده است.\n\nو همچنین قول خداوند متعال: «لَنْ يَنالَ الله لُحُومُها ولا دِماؤُها ولكِنْ يَنالُهُ التَّقْوى‏ مِنْكُمْ» (هرگز گوشت‌ها و خون‌های آن‌ها به خدا نمی‌رسد، بلکه تقوای شما به او می‌رسد). پس آنچه از ما به او می‌رسد، تقوا قرار داد. حق (الحق) بندگانش را به نصیب خود از آنچه آنان بر آن هستند و در آن قرار دارند، در هر چیزی آگاه ساخت. و با بندگانش عهد بست و فرمود: «وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ» (و به عهد من وفا کنید تا من نیز به عهد شما وفا کنم). پس بهره او از شما این است که به آنچه با شما عهد بسته است، وفا کنید، و آن قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در مورد نمازهای پنج‌گانه است: «فمن أتى بهن لم يضيع من حقهن شيئا كان له عند الله عهدا أن يدخله الجنة» (پس هر کس آن‌ها را به جا آورد و چیزی از حق آن‌ها را ضایع نکند، نزد خدا عهدی دارد که او را به بهشت وارد کند).\n\nو نماز، مناجات با خداست بر اساس تقسیمی که میان او متعال و بندگانش تشریع کرده است. پس هر کس سهم خود را از آن به او بدهد و سهم خود را از آن بگیرد، حق و نصیب او را داده است. پس اگر خداوند متعال، با وصف بی‌نیازی از عالمیان، برای خود در آنچه برای عالم است و عالم به آن نیازمند است، نصیبی قرار داده و سهمی را معین کرده است، پس گمان تو درباره کسی که اصل او فقر و مسکنت است، چیست؟ البته در ظهور عین او، نه در عین و وجود او و آنچه در آن است. و ما گفتیم نه در عین او، زیرا اعیان آن‌ها به خودی خود، به جعل جاعل نیستند، بلکه احوالی که بر آن‌ها تصرف می‌شود، از وجود و عدم و غیره، در آن‌ها فقر به سوی کسی واقع می‌شود که حکم آن‌ها را در این عین ظاهر می‌سازد. پس این را بدان.\n\nپس هر کس حق خود را طلب کند و به طور کامل بخواهد، ملامت نمی‌شود. اما چون در برخی حقوق برای ما تشریع شده است که اگر آن‌ها را ترک کنیم، برای ما عظیم‌تر است، و این را از مکارم اخلاق قرار داده و پاداش آن را از جانب خود متعال به آن گره زده است، و آن قول عز و جل است: «فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله» (پس هر کس عفو کند و اصلاح نماید، پاداش او بر عهده خداست). و هر کس حق خود را طلب کند، و آن قول خداوند متعال است: «ولَمَنِ انْتَصَرَ بَعْدَ ظُلْمِهِ فَأُولئِكَ ما عَلَيْهِمْ من سَبِيلٍ» (و هر کس پس از ستمی که بر او رفته، انتقام گیرد، بر آنان هیچ راه ملامتی نیست)، این حق اوست. همچنین، با بندگانش در مورد آنچه از حق او و حقوق او ضایع کرده‌اند، رفتار می‌کند؛ عفو می‌کند، می‌بخشد و اصلاح می‌کند. پس سرانجام کار در هر دو سرا به رحمت خدا می‌رسد. پس رحمت آنان را در هر کجا که باشند، فرا می‌گیرد، اما در آن مساوی نیستند.\n\nخداوند متعال فرمود: «أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ سَواءً مَحْياهُمْ ومَماتُهُمْ ساءَ ما يَحْكُمُونَ» (آیا کسانی که مرتکب بدی‌ها شدند، گمان کردند که آنان را مانند کسانی قرار می‌دهیم که ایمان آوردند و کارهای شایسته انجام دادند، در زندگی و مرگشان یکسان؟ چه بد حکم می‌کنند). همان‌گونه که متعال میان کسانی که می‌دانند و کسانی که نمی‌دانند، مساوات قرار نداد.\n\nپس کامل از بندگان کسی است که هیچ حقی را برای خدا بر خود یا نزد خود باقی نگذارد، مگر اینکه آن را به طور کامل ادا کند، در هر چیزی که خدا در آن نصیب دارد، نصیب او را بر اساس حدی که برایش تشریع شده، بدهد. پس هنگامی که آن را به طور کامل ادا کند، خداوند تمام آنچه را که به شرع برای او ذکر شده، به او باز می‌گرداند. پس هنگامی که خداوند به عهد خود با او وفا کند، گرفتن آن از او امتناع و ابتدای فضل است، نه پاداش. و این جز از علمای بالله که امر را بر همان‌گونه که هست می‌دانند، سر نمی‌زند. و آنان افراد نادری از خلق هستند که جز او کسی آنان را نمی‌شناسد. پس تو را بر کامل‌ترین راه‌ها در رسیدن به سعادتی که بالاتر از آن سعادتی نیست، آگاه ساختم. با این حال، ای زنده، پس از آن، امر عظیم و مصیبت بزرگ است و اشکال در آن عظیم‌تر است. به همین دلیل، اهل الله غایت را در حیرت قرار دادند، و آن عجز است.\n\nو این مقدار کافی است در دانستن اینکه خداوند حق (الحق) و نصیبی نزد بندگانش دارد که به حکم استحقاق از آنان می‌طلبد، و همچنین حقوق دیگران را به حکم وکالت می‌طلبد، همان‌گونه که فرمود: «ويَأْخُذُ الصَّدَقاتِ» (و صدقات را می‌گیرد) به حکم وکالت، پس آن را رشد می‌دهد و ثمر می‌بخشد. پس او در حق قومی، به تبرع از نفس خود و رحمت به آنان، وکیل است، حتی اگر او را وکیل نکرده باشند. و در حق قومی، به جعل آنان وکیل است، همان‌گونه که به آنان امر کرده است که او را وکیل بگیرند. وگرنه، بنده این جسارت را ندارد که مولای خود را وکیل کند. پس چون به این کار برای بندگانش تبرع کرد و با لطف پنهان خود از کبریا (الکبریاء) به سوی آنان فرود آمد، او را وکیل گرفتند و این فرود آمدن، به آنان دلالت (جسارت) بخشید.\n\nاما حدیث «ما يقبل الله من صلاة عبده إلا ما عقل» (خداوند از نماز بنده‌اش نمی‌پذیرد، مگر آنچه را که تعقل کرده باشد)، منظور این است که ادای حق خداوند متعال را در آنچه بر او معین شده است، تقویت می‌کند. و بیشتر آن را نصف قرار داد، و آن حدی است که برای خود از نماز بنده‌اش معین کرده است. و کمترین آن را یک دهم قرار داد و فرمود: یک دهم آن، یک نهم آن، یک هشتم آن، یک هفتم آن، یک ششم آن، یک پنجم آن، یک چهارم آن، یک سوم آن، نصف آن. و نصف را جز در فاتحه ذکر نکرد. پس ما معنا را دانستیم و آن را در تمام افعال و اقوال نماز، بلکه در تمام اعمالی که به آن مکلف شده‌ایم، تعمیم دادیم.\n\nاما آنچه را که معین کرده است، همان است که فاتحه در آن محصور شده است، و آن نُه بخش است: بخش اول: «بِسْمِ الله الرَّحْمنِ الرَّحِيمِ» (به نام خداوند بخشنده مهربان). دوم: «الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (ستایش از آن خداست که پروردگار جهانیان است). سوم: «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان). چهارم: «ملك (مالِكِ) يَوْمِ الدِّينِ» (صاحب روز جزا). پنجم: «إِيَّاكَ نَعْبُدُ» (تنها تو را می‌پرستیم). ششم: «وإِيَّاكَ نَسْتَعِينُ» (و تنها از تو یاری می‌جوییم). هفتم: «اهْدِنَا الصِّراطَ الْمُسْتَقِيمَ» (ما را به راه راست هدایت کن). هشتم: «صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ» (راه کسانی که به آنان نعمت دادی). نهم: «غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ ولا الضَّالِّينَ» (نه راه کسانی که مورد غضب قرار گرفتند و نه گمراهان).\n\nپس زیانکار و غافل از نماز، کسی است که در یک بخش از این بخش‌هایی که در فاتحه ذکر کردیم، با خدا حاضر نباشد. و این همان است که خداوند در پذیرش از یک دهم تا نصف ذکر کرده است. پس هر کس «بِسْمِ الله الرَّحْمنِ الرَّحِيمِ» را آیه‌ای از آن بداند و آن را از آن جدا نکند، تقسیم بر اساس آنچه در فاتحه ذکر کردیم، است. زیرا حکم خدا در اشیاء، حکم مجتهد است، پس او در اجتهادش با اوست. و هر کس اجتهادش او را به جدایی برساند، پس بسمله را از فاتحه جدا کند و بسمله را آیه‌ای از آن نداند، خداوند جزء نهم را «ولا الضَّالِّينَ» قرار داده است. و بسمله سزاوارتر و اولی است، زیرا نزد علمای بالله بدون شک از قرآن است. و تکرار آن در سوره‌ها مانند تکرار سایر کلماتی است که در قرآن تکرار می‌شوند. و آنچه بر نُه بخش افزوده شود، تعقل او در تلاوت، حروف کلمه است. پس ممکن است نمازگزار حرفی از حروف کلمه را تعقل کند، سپس از باقی آن غافل شود. این معنای قول عام پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است که می‌فرماید: «جز آنچه را که تعقل کرده باشد، نمی‌پذیرد.» پس عاقل کسی است که آن را کامل به جا آورد تا خداوند آن را کامل بپذیرد. و هر کس چیزی از آن را در نماز خود ناقص کند، از قرائت فاتحه او در نوافل نماز جبران می‌شود. پس باید نوافل را زیاد کند. اگر قرائت او در نوافل، آنچه را که از قرائت فاتحه در فریضه ناقص کرده است، کفایت نکند، از تلاوت او با حضور در غیر نماز معین کامل می‌شود. و اگر در تمام افعال خود در نماز باشد، پس او از «الَّذِينَ هُمْ عَلى‏ صَلاتِهِمْ دائِمُونَ» (کسانی که بر نماز خود مداومت دارند) است، و آنان کسانی هستند که در تمام اوقات خود خدا را ذکر می‌کنند. پس در تمام احوال با او مناجات می‌کنند.\n\nپس بهره خدا از تمام آنچه بندگانش را به آن مکلف کرده است، همان است که بر آنان فرض کرده است. و نصیب بندگان از خدا، همان است که حق (الحق) برای آنان بر خود واجب کرده است. و نافله (النوافل) برای نافله در تمام این‌هاست.\n\nاما بهره رسول (صَلَّى اللهُ عَليهِ وسَلَّم) از این مسئله، با تصدیق او و ایمان به او و آنچه آورده است، محقق می‌شود. و از آنچه ایمان را محقق می‌سازد، این است که بهترین زمان‌ها، زمان نماز و اذان است، و بهترین شفاعت و کلام، آن است که رحمان در آن اجازه داده باشد. این از چیزهایی است که رسول حق (الحق) برای ما آورده و با روی آوردن به ما وارد شده است. پس هنگامی که تجلی (التجلی) کرد، تدلی (نزدیک شدن) کرد، و او را مدهوش نکرد، بلکه او را بیدار کرد تا تجلی کند. پس روی آورد و اعراض نکرد و پشت ننمود.\n\nاما تصدیق به او، به دلیل خبر حق (الحق) است که او رسولی از جانب او به سوی ماست، و او وجیه و مقرب است. و اما ایمان به آنچه آورده است، به دلیل خبر دادن او از حق (الحق) است. پس میان خبر دادن حق در ایمان به او و خبر دادن او از حق در آنچه آورده است، فرق بگذار. به او ایمان نمی‌آورد، مگر کسی که حق در سرّ او با او سخن گفته باشد، حتی اگر مخاطب متوجه نشود و نداند چه کسی با او سخن گفته است، بلکه تنها تصدیق او را در قلب خود می‌یابد. و اهل کشف (الکشف) و حضور، از طریق شنیدن با گوش‌ها و قلب‌ها، کلام حق (الحق) را می‌شناسند که این رسولی از جانب اوست، پس با بصیرت به او ایمان می‌آورند. و به آنچه این رسول آورده است، ایمان نمی‌آورد، مگر کسی که رسول در سرّ او با او سخن گفته باشد، حتی اگر مخاطب متوجه نشود و نداند چه کسی با او سخن گفته است، بلکه تنها تصدیق آنچه آورده است را در قلب خود می‌یابد. و اهل کشف (الکشف) و حضور، از طریق شنیدن با قلب‌ها و گوش‌ها و دیده‌ها، کلام رسول را می‌شناسند که این از جانب خدا آمده است، و «لَوْ كانَ من عِنْدِ غَيْرِ الله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً» (اگر از جانب غیر خدا بود، در آن اختلاف بسیاری می‌یافتند). پس با بصیرت به آن ایمان می‌آورند.\n\nو ما در مورد آنچه رسول آورده است، دیده‌ها را ذکر کردیم، اما در شنیدن کلام حق (الحق) آن را نگفتیم. زیرا اگر رسول را ببینیم، او را دیده‌ایم، اما حق (الحق) متعال این‌گونه نیست؛ اگر او را ببینیم، او را ندیده‌ایم، مگر منزلت و صورت خودمان را از او. به همین دلیل، در تصدیق خبر او، هنگامی که با ما سخن می‌گوید، دیده‌ها را نگفتیم. و قلب‌ها و گوش‌ها را نیاوردیم، مگر تنها برای خبر، نه به دلیل اینکه حق (الحق) با آن سخن گفته است. زیرا ادراک قلب‌ها و گوش‌ها و دیده‌ها نسبت به حق (الحق) یکسان است؛ هیچ یک از عالمیان، هیچ ادراکی، چه این باشد و چه غیر آن، درک نکرده است، مگر منزلت خود از حق (الحق) و صورت خاص خود را. پس او را درک نکرده است. و ما قلب‌ها را به دلیل شنونده بودن و گوش‌ها را تنها برای خبر ذکر کردیم، تا بر آنچه ذکر کردیم و بیان نمودیم، تنبیه کنیم.\n\nپس اگر این را دانستی، حق (الحق) را به خدا و رسول ادا کرده‌ای، آنچه بر تو معین شده بود که برای خدا و رسولش ادا کنی. زیرا گروهی از اهل الله در این مسئله دچار اشتباه شدند، چون از جانب خدا به آن خبر ندادند. پس علمای رسوم چگونه خواهند بود؟ پس هر کس از طریق ایمان در این باره سخن بگوید، جز به آنچه ما سخن گفتیم، سخن نمی‌گوید، زیرا او از طریق ذوق سخن می‌گوید.\n\nبه همین دلیل، دو نفر، بلکه سه نفر را می‌بینی که معجزه را بر دست رسولی که حق (الحق) آن را در معرض دلالت بر صدق او در آنچه آورده و تصدیق خود او آشکار کرده است، مشاهده می‌کنند. یک نفر از آن سه نفر یقین می‌کند که آن حق (الحق) است، اما آن را انکار می‌کند. و نفر دوم، آن دلالت نزد او اقامه نشده است، به دلیل جهل او به موضع دلالت از آن. و نفر سوم ایمان آورد و تصدیق کرد. و مجلس یکی است و نگاه با بصر یکی است و ادراک در ظاهر یکی است. پس دانستیم که اگر حق (الحق) بر قلب کسی که ایمان آورد و تصدیق کرد، تجلی (التجلی) نکرده بود و او را بدون واسطه آگاه نساخته بود، به آنچه آورده بود، ایمان نمی‌آورد و تصدیق نمی‌کرد و مانند دو نفر دیگر بود.\n\nو همچنین در ایمان او به آنچه آورده است. پس هر مؤمنی نمی‌داند که ایمان از کجا برای او حاصل شده است، به ویژه که دیده‌ایم و به ما رسیده است که برخی از کسانی که به رسول خدا ایمان آوردند، هنگامی که او را دیدند و دعوت او را شنیدند، هیچ معجزه یا دلالتی از او ندیدند، بلکه در نفس خود یافتند که او در ادعای خود صادق است. پس همان لحظه به او ایمان آوردند و درنگ نکردند و لکنت نگرفتند. و این جز از همان تجلی (التجلی) بر قلب او نبود، در حالی که او متوجه نیست که آن از تجلی است. و به همین مقدار، اهل کشف (الکشف) بر دیگر مؤمنان برتری یافتند. و اگر کشف (الکشف) آنان بر امور نبود، آن‌ها را به این و آن تفکیک نمی‌کردند.\n\nپس بهره رسول این است که او را در نفس خود و در آنچه از جانب او آورده است، به پروردگارش ملحق کنی.\n\nاما بهره یتیمان از این علم، در حقیقت، زمان بلوغ خروج از ادعا در مورد آنچه برای تو بود، است. پس بهره تو قبل از آمدن این زمان، این است که افعالت به تو اضافه شود و کسی بر تو اعتراض نکند و از تو سلب نشود و هیچ منعی بر تو نباشد. اما هنگامی که زمان بلوغ (الحلم) رسید، بر تو منع (حجر) واقع می‌شود و در تمام حرکاتت محدودیت ایجاد می‌شود و احکام حق (الحق) متوجه آن‌ها می‌شود، زیرا آن‌ها افعال او هستند که در تو ظاهر شده‌اند. و اگر در تو ظاهر نشده بودند، این خطاب و این تحکیم به آن‌ها تعلق نمی‌گرفت. و معنای «در تو ظاهر شده‌اند» همان عین ادعای توست که افعال برای توست. پس حق (الحق) با تکلیف کردن تو و منع کردن تو، خواست به تو بشناساند که اگر این افعال ملک محقق تو بودند، برای من جایز نبود که در آنچه مال توست و مال من نیست، تصرف کنم.\n\nو سبب آن این است که زمان بلوغ عقل فرا رسیده و استحکام عقل و نظر حاصل شده است. پس سزاوار بود که با عقلی که خداوند به تو داده است، افعال خود را که محل ظهور آن‌ها هستی، از آنِ خداوند متعال ببینی و نه از آنِ خودت. اگر این از ابتدا برای تو حاصل می‌شد، تو را مکلف نمی‌کرد و در این دنیا بر تو منع نمی‌گذاشت. آیا نمی‌بینی کسی که عقلش مستحکم نشده است، بر او منع گذاشته نشده و مکلف نشده است؟ و او همان دیوانه‌ای است که عقلش از او پوشیده شده است که حکمی بر او باشد. و همچنین شخص خوابیده و هر کس که متصف به عقل نباشد. و چون در این دنیا به حدی رسید که تکلیف بر او به دلیل قیام این صفت واجب شد، اگر در این دنیا پرده از او برداشته شود، منع و خطاب شرع از او برداشته نمی‌شود، به دلیل حکم دنیا، نه به دلیل حکم حال. زیرا قیاس اقتضا می‌کرد که منع از کسی که دارای این صفت است، برداشته شود. اما دنیا باید حکمی داشته باشد، همان‌گونه که با کودکان مشرکان و کفار رفتار می‌شود؛ آنان را به دلیل دنیا به پدرانشان ملحق می‌کنیم، اگرچه می‌دانیم که آنان بر فطرت هستند و شرک نورزیده‌اند و کفر نگفته‌اند. پس دنیا حکمی دارد.\n\nپس هنگامی که وعده آخرت فرا رسد و به آن منتقل شویم، از حکم دنیا خارج می‌شویم. پس حکم تکلیف در سرای رضوان و خواهرش (جهنم) از ما برداشته می‌شود. همچنین، کسی که خداوند در این دنیا او را بر سعادتش آگاه سازد و دیگری را بر شقاوتش آگاه سازد، این آگاهی، منع و تکلیف را از آنان ساقط نمی‌کند. زیرا اصل وضع نوامیس در این دنیا، تنها برای مصلحت دنیا و آخرت است. پس رفع منع، تا زمانی که دنیا و اهل آن باقی هستند، محال است. اگر چنین نبود، کسی که پرده از او برداشته شده بود، منع از او برداشته می‌شد، زیرا او جز خدا را فاعل نمی‌بیند. و شیء بر نفس خود منع نمی‌گذارد. و اگر بر خود واجب کند آنچه را که واجب کرده است، این برای انس دادن ماست در آنچه بر خود برای ما واجب می‌کنیم. پس اگر ما آن را برای او واجب کنیم، او آن را بر ما واجب می‌کند تا متمایز شویم. پس با ترک آن، عصیان می‌کنیم. و اگر حق (الحق) آنچه را بر خود واجب کرده بود، ترک می‌کرد، این حکم را نداشت. زیرا این حکم به کسی که به آن تعلق می‌گیرد، تعلق نمی‌گیرد، مگر از آن جهت که دیگری آن را واجب کرده است. پس اگر حق (الحق) آنچه را که ما بر خود واجب کردیم، بر ما واجب نمی‌کرد، ما با ترک آن عاصی نبودیم.\n\nپس اگر کسی که دیگری آن را بر او واجب نکرده است، به آن وفا کند، این از جانب او منت و فضل و مکارم اخلاق است. اگر بگویی: این در صورتی است که در خیر باشد. می‌گوییم: جز خیر در آنجا نیست. و خیر بر دو قسم است: خیر محض، که در آن شری نیست، و خیر آمیخته، که در آن نوعی شر وجود دارد، همان‌گونه که بیان کردیم، مانند نوشیدن داروی ناخوشایند. و مانند مؤمن، هنگامی که عصیان می‌کند و اطاعت می‌کند. زیرا مؤمن هیچ معصیتی را بدون اطاعت خالص نمی‌کند، زیرا ایمان به معصیت بودن آن، خود اطاعت است.\n\nو در این، تنبیهی است «لِمَنْ كانَ لَهُ قَلْبٌ» (برای کسی که قلب دارد). پس امر در آخرت به همان امری باز می‌گردد که یتیم قبل از بلوغ بر آن بود. و ما در مورد یتیم گفتیم، در حالی که هر کودکی قبل از بلوغ نیز چنین است، با وجود اینکه یتیم نیست. زیرا یتیم تحت تدبیر ولی خود است و ولی او خداست، زیرا او ولی مؤمنان است. و غیر یتیم تحت تدبیر پدرش است، پس با وجود پدرش به او نظر نمی‌شود، زیرا فرع از اصل نزدیک‌تر خود مدد می‌گیرد. آیا نمی‌بینی که میوه، اصلی جز شاخه درخت برای خود نمی‌شناسد، زیرا از شاخه مدد می‌گیرد. و شاخه، اصلی را می‌شناسد که میوه از آن جاهل است. و یتیم دانسته است که پدرش از بین رفته است، پس قلبش شکسته است و اصلی ندارد که او را راهنمایی کند. پس علمای بالله به او شناساندند که او جز کسی که پدرش داشت، ندارد، و او خداست. پس در امور خود به خدا باز می‌گردد. چون حال یتیم با خدا در نفس خود این‌گونه بود، خداوند برای او در غنیمت بهره‌ای قرار داد تا آنچه برای اوست، بر او فراوان شود، و آن همان است که کودک از اضافه شدن افعال به خود و عدم منع بر آن‌ها می‌بیند. و هر کس بر سر یتیمی دست بکشد، به تعداد هر مویی، حسنه‌ای برای اوست، و این برای غیر یتیم نیست.\n\nو حکم مسکین، حکم یتیم است، از جهت عدم وجود یاور ظاهر. پس خداوند ضعف او را تقویت کرد؛ یعنی ضعفی بر ضعف او افزود. زیرا مخلوق به حکم اصالت ضعیف است. پس اگر خداوند ضعفی بر ضعف او بیفزاید، مسکین می‌شود. پس او هیچ صولتی ندارد. اگر صولت کند، در حالی که مسکین است، خداوند او را دشمن می‌دارد، زیرا از او چیزی ظاهر شده است که مخالف حال اوست. پس خود را مکلف به چیزی کرده است که مقامش اقتضا نمی‌کند. به همین دلیل، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «ثلاثة لا يُكَلِّمُهُمُ الله ولا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيامَةِ ولا يُزَكِّيهِمْ ولَهُمْ عَذابٌ أَلِيمٌ ملك كذاب وشيخ زان وعائل مستكبر» (سه نفر هستند که خداوند در روز قیامت با آنان سخن نمی‌گوید و به آنان نگاه نمی‌کند و آنان را پاک نمی‌سازد و برای آنان عذابی دردناک است: پادشاه دروغگو، پیرمرد زناکار و فقیر متکبر)؛ یعنی در تکبر مبالغه کرده است. همان‌گونه که خداوند در ضعف مسکین مبالغه کرده است. زیرا او به دلیل مسکین بودن، صاحب دو ضعف است: ضعف اصل و ضعف فقر. پس به دلیل این ضعف نمی‌تواند سر خود را بالا ببرد، برخلاف صاحب مال که در نفس خود قدرت مال را می‌یابد. و به همین دلیل مال، مال نامیده شده است، زیرا صاحب خود را متمایل می‌کند، یا به خیر و یا به شر، و او را در حال اعتدال رها نمی‌کند. مسکین کسی است که زیر مجاری تقدیرات آرام گرفته و به آنچه حکم خدا در شب و روز می‌آورد، نظر کرده است و به آنچه خداوند بر او و به وسیله او جاری کرده، اطمینان یافته است و دانسته است که از خدا جز به سوی او پناهی نیست و او فعال لما یرید (انجام‌دهنده هر آنچه می‌خواهد) است و محقق دانسته است که سهم او از خدا همان است که در حال بر آن است. پس خداوند شکست او را با قول خود جبران کرد: «أنا عند المنكسرة قلوبهم» (من نزد کسانی هستم که قلب‌هایشان شکسته است). زیرا هنگامی که نزد کسی که قلبش شکسته است، می‌آیی، جز خدا را همنشین او نمی‌یابی، چه در حال و چه در قول. پس خداوند برای او در غنیمت بهره‌ای قرار داد، حتی اگر در آن تلاشی نکرده باشد. پس دیگری به او خدمت کرده و او به راحتی رسیده است، به واسطه آنچه خداوند از آن غنیمت به او رسانده است، که دیگری در آن زحمت کشیده و خسته شده است.\n\nمانند مؤمنی که علم ندارد و از اهل بهشت است. او منازل علمای بالله را می‌بیند و در موقف حسرت می‌خورد و پشیمان می‌شود. پس خداوند قصد می‌کند که از علمای اهل دوزخ، جامه علم او را برکند و آن را بر این مؤمن بپوشاند تا با آن به منزلت آن علم در بهشت صعود کند. زیرا برای هر علمی در بهشت منزلی است که جز کسی که آن علم را به جا آورده، در آن فرود نمی‌آید. زیرا علم منزلت خود را در بهشت می‌طلبد. و عالمی که این علم را داشت، از اهل دوزخ است که اهل آن هستند. و علم به خودی خود قیام نمی‌کند تا به تنهایی در آن منزلت فرود آید. پس ناگزیر به محلی نیاز دارد که به آن قیام کند. پس خداوند آن را بر این مؤمن سعادتمند که علم ندارد، می‌پوشاند تا علم او را به منزلت خود بالا ببرد. چه حسرت بزرگی!\n\nاما بر تو باقی است که بدانی کدام علم از این کسی که از اهل دوزخ است، سلب می‌شود. و آن این است که اگر او بر علمی در نفس‌الامر بود، اما در دنیا شبهه‌ای بر او وارد شده بود. اما حیرت او در محل نظر است. و اما سلب آن از او، با وجود علم او به آنچه بر آن بود، این است که در دنیا اعتقاد داشت که آن جهل است. پس هنگامی که در آخرت باشد، می‌داند که آن علم بوده است. پس آن علم همان است که سلب می‌شود و بر این کسی که عالم نیست و از اهل بهشت است، پوشانده می‌شود.\n\nو اگر امر بر اساس آنچه ذکر کردیم باشد، خداوند نزد اهل دوزخ که اهل آن هستند، هنگام مرگ، جز علمی را که شایسته اهل دوزخ است، باقی نمی‌گذارد. و غیر از آن از علومی که جز برای اهل بهشت شایسته نیست، خداوند با آن بر عالمی که در دنیا یا هنگام احتضار به آن عالم است، شبهه‌ای وارد می‌کند که او را از علم دور می‌سازد یا او را متحیر می‌کند، سپس بر آن می‌میرد، در حالی که آن در نفس‌الامر علم بوده است. پس این صنف از علم همان است که بر اهل بهشت پوشانده می‌شود، اگر در دنیا علمی به آن نداشته باشند. و کسی که آن را از اهل دوزخ می‌دانسته، به آن طمع می‌ورزد. پس حجت بر او اقامه می‌شود که بر شبهه مرده است. این بهره مسکین از غنیمت است. زیرا آن کسی که علم از او در دنیا به واسطه شبهه سلب شد، با نفس خود جهاد کرد و زحمت کشید. پس هنگامی که غنیمت گرفت و شبهه وارد شد، آن علم بهره مسکین بود.\n\nاما ابن سبیل (در راه مانده)، فرزندان سبیل بالاترین طوائف نزد خدا هستند. زیرا فرزند نمی‌تواند از پدر خود نفی شود. و او ابن سبیل نامیده شد، زیرا دانست که منزل محال است و استقرار بر یک امر محال است، نه در حق نفس خود و نه در حق تجلی (التجلی) پروردگارش، بلکه حتی در حق پروردگارش، زیرا او در شأن خلق خود است و امر در آنان همیشه جدید است. و کسی که قدمش مستقر نشود، ناگزیر باید رونده (متحرک) باشد. و جز در راه (سبیل) حرکت نمی‌کند. و حرکت او همیشه است، دنیا و آخرت. پس او ابن سبیل است، دنیا و آخرت. و چون برای راه خود فارغ بود و مشغول آن بود و در آن مسافر بود، و مسافر ناگزیر به توشه است، خداوند برای او نصیبی از غنیمت قرار داد. پس حق (الحق) او را با آنچه در آن تلاشی نکرده است، تغذیه می‌کند. و ممکن است ابن سبیل در این آیه، عین مجاهد باشد. و سبیل به دلیل الف و لام عهد و تعریف، سبیل الله (راه خدا) باشد که خداوند در مورد آن فرمود: «ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله» (و گمان مبر کسانی که در راه خدا کشته شدند)؛ یعنی شهدا که در جهاد کشته شدند. پس بهره مجاهد از غنیمت نیز همان مقداری است که خداوند برای ابن سبیل معین کرده است، و آن معلوم است، به جز آنچه در صدقات برای اوست. پس این را بدان، زیرا تنبیه نیکویی است، «إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ» (اگر به خدا ایمان آورده‌اید) و به آنچه خداوند بر بنده خود در روز فرقان نازل کرد. پس خداوند با آنچه به او آموخت، میان دو قبضه با دو کلمه‌ای که در کرسی با دو قدم ظاهر شدند، فرق گذاشت. زیرا اهل الله، که فرزندان آخرت هستند، فرزندان سبیل هستند، «بِالْعُدْوَةِ الدُّنْيا» (در کرانه نزدیک‌تر) به سوی خدا، با حاصل شدن قرب و منزلت زلفی (نزدیکی) از خدا. و «وهُمْ بِالْعُدْوَةِ الْقُصْوى‏» (و آنان در کرانه دورتر) از خدا هستند، و آنان فرزندان حیات دنیا و فرزندان راه آن هستند. و «الرَّكْبُ أَسْفَلَ مِنْكُمْ» (و کاروان پایین‌تر از شما بود). پس پستی را برای آنان قرار داد، زیرا «كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى‏» (سخن کسانی که کفر ورزیدند، پست‌تر است) بود. و هر کس پایین‌تر از تو باشد، تو بالاتر از او هستی، زیرا شما اهل الله هستید که سعادت برای شماست، چون کلمه الله برتر بود. و تمام این‌ها به حکم و قضای خداست، نه به دلیل دستی که پیش فرستاده شده باشد، بلکه به دلیل عنایت الهی که سبقت گرفته است. خداوند متعال می‌فرماید: «إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ» (همانا کسانی که از پیش برای آنان از جانب ما نیکی مقدر شده است، آنان از آن دور داشته می‌شوند).\n\n> ألا إن أهل الله بِالْعُدْوَةِ الدُّنْيا *** كما إن أهل الشرك بِالْعُدْوَةِ الْقُصْوى‏\n> آگاه باشید که اهل الله در کرانه نزدیک‌تر (بِالْعُدْوَةِ الدُّنْيا) هستند *** همان‌گونه که اهل شرک در کرانه دورتر (بِالْعُدْوَةِ الْقُصْوى‏) هستند.\n\n> فإن الذي أقصاه يمتاز بالسفلى *** وإن الذي أدناه قد فاز بالعليا\n> پس آن کس که او را دور کرده، به پستی ممتاز می‌شود *** و آن کس که او را نزدیک کرده، به برتری فائز شده است.\n\n> ألا تلحظن الركب أسفل منهم *** فكل فريق من مكانته أدنى‏\n> آیا نمی‌بینی که کاروان پایین‌تر از آنان است *** پس هر گروهی از جایگاه خود نزدیک‌تر است.\n\nو چون دیدیم که خداوند در چنین موطنی و در تقسیم این نوع که غنیمت است، خمس را به خود اختصاص داده است، دانستیم که خداوند از تقسیماتی که در عالم معتبر است، جز رعایت آرایش سپاه در هنگام برخورد را رعایت نکرده است، از آن جهت که او عز و جل پادشاهی قاهر است، زیرا دشمنانی برای خود اثبات کرده است که با او منازعه می‌کنند. و تقسیم سپاه در هنگام برخورد بر پنج بخش است: قلب (مرکز)، و آن موضع امام است، و آن همان است که خداوند از نشئه بنده خود برگزیده است، هنگامی که فرمود: «وسعني قلب عبدي» (قلب بنده‌ام مرا گنجایش داشت). و باقی‌مانده، میمنه (راست)، میسره (چپ)، مقدمه (جلو) و ساقه (عقب) است. به همین دلیل، خمس برای خدا بود و چهار خمس باقی‌مانده برای کسانی که باقی ماندند. زیرا دشمنی که خداوند او را نصب کرده است، خداوند خبر داده است که از پیش رو و از پشت سر ما می‌آید، پس با مقدمه و ساقه با او روبرو می‌شویم. و از سمت راست ما، پس با میمنه با او روبرو می‌شویم. و از سمت چپ ما، پس با میسره با او روبرو می‌شویم. و دشمن هدفی جز قلب ندارد تا ملک سپاه را از قلب زایل کند. پس خداوند از قلب بنده که موضع نظر اوست و او را با آن گنجایش داده است، با اینانی که در این مکان‌ها که دشمن از آن‌ها وارد می‌شود، مرتب کرده است، دفاع می‌کند. پس این سپاه به خاطر او می‌جنگد. و آن قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است: «إن الذي يقاتل في سبيل الله هو الذي يقاتل لتكون كلمة الله هي العليا وكَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلى‏» (همانا کسی که در راه خدا می‌جنگد، کسی است که می‌جنگد تا کلمه الله برتر باشد و کلمه کسانی که کفر ورزیدند، پست‌تر باشد). و آنان دشمنان هستند. پس او از باطن به آنان مدد می‌رساند و آنان از ظاهر، از جهت‌هایی که دشمن در آن فرصت می‌جوید، از او دفاع می‌کنند. از این رو، خمس از غنیمت برای او بود که تصریح شده است که نصیب اوست، زیرا او یاری‌دهنده مؤمنان بر دشمنانشان است و سپاه، یاری‌دهنده دین اوست. «ذلِكَ بِأَنَّ الله مَوْلَى الَّذِينَ آمَنُوا وأَنَّ الْكافِرِينَ لا مَوْلى‏ لَهُمْ» (این بدان سبب است که خداوند مولای کسانی است که ایمان آوردند و کافران مولایی ندارند). پس آنان قلبی ندارند که یاریشان کند.\n\n> إن لله نصيبا وافرا *** هو خمس الفي‏ء من غير مزيد\n> همانا برای خدا نصیبی فراوان است *** که خمس فیء است، بدون هیچ افزایشی.\n\n> فله القلب الذي يعمره *** وهو العرش الإلهي المجيد\n> پس قلب از آن اوست که آن را آباد می‌کند *** و آن همان عرش الهی مجید است.\n\n> والذي يبقى فقد قسمه *** اختصاصا منه في بعض العبيد\n> و آنچه باقی می‌ماند، آن را تقسیم کرده است *** به اختصاص از جانب او در میان برخی از بندگان.\n\n> فالذي حاز الذي سطره *** قلمي فاز بما يعطي الوجود\n> پس کسی که آنچه را قلم من نگاشته، به دست آورد *** به آنچه هستی (الوجود) عطا می‌کند، فائز شده است.\n\n> فرسول أو ولي وارث *** ما له في علمنا غير الشهود\n> پس رسول یا ولی وارث *** در علم ما جز شهود (الشهود) ندارد.\n\n> والذي يعلمه الله فما *** لي علم فيه إلا أن يجود\n> و آنچه را خدا می‌داند، *** من در آن علمی ندارم، مگر اینکه او جود کند.\n\nو در این منزل، علم این است که آیا علم واحد به تمام معلومات تعلق می‌گیرد یا برای هر معلومی علمی است، یا نسبت به عالم متفاوت است؟ و علم چیست؟ آیا ذات عالم است یا صفتی قائم به او، یا نسبتی که نه ذات عالم است و نه صفت او؟ و در آن، علم آنچه مناسبات میان اشیاء از تألف و اجتماع به آن می‌انجامد، وجود دارد. و در آن، علم این است که هر کس به عمل تو عمل کند، او از توست. و در آن، علم استناد و حمایت از مستند و مشارکت او در سختی و ترک آنچه ترک آن دیده می‌شود، اگرچه محبوب تو باشد، و ایمان (الإيمان) که هیچ چیز آن را متزلزل نمی‌کند، وجود دارد.\n\nو در آن، علم آنچه مکارم اخلاق بر کسی که به آن متصف است، واجب می‌کند، و علم مقامات و آنچه به این منزل اختصاص دارد، وجود دارد. و در آن، علم کثیر و قلیل و اینکه چه کسی به قوه کثیر است و چه کسی به عدد کثیر، و همچنین در مورد قلت، وجود دارد. و در آن، علمی است که محل لغزش قدم است، و آن این است که به تو می‌دهد که با هر کس که امری از تو می‌خواهد، باشی، اما نه اینکه برای او باشی به آنچه از تو می‌خواهد. و آن محل لغزش قدم است به دلیل اختلاف اغراض و محدود کردن مؤمن به حکمی که به او سپرده شده است. و در آن، علم آنچه باید برای آن آماده شد و آنچه نباید برای آن آماده شد، وجود دارد. و در آن، علم نحوه برخورد با کسی که امر او را نمی‌دانی، وجود دارد. و در آن، علمی است که با آن دانسته می‌شود که هیچ چیز از عالم و نه از حق (الحق) با تو روبرو نمی‌شود، مگر صفت تو.\n\nو در آن، علم الحاق رؤوس به اَذناب (سرها به دم‌ها) در حکم است، و آن حالی است که رئیس و مرئوس در آن مساوی می‌شوند، مانند نوع وسط که نوعی برای مافوق خود و جنسی برای مادون خود است. و در آن، علم تحریک (تحریش) و سپس تبری جستن از آن است؛ آیا آن تبری نفع می‌رساند یا نفع نمی‌رساند؟ و در آن، علم ادراک خیال در صورت محسوس در بیداری است، در حالی که هیچ چیز محسوس مخیلی از خارج یا از داخل نیست، بلکه مانند سراب است که آن را آب می‌بینی، و مانند کوچک در سراب که آن را بزرگ می‌بینی، و مانند کوه سفید که از دور آن را سیاه می‌بینی. پس این خارج از حس و خیال است.\n\nو در آن، علم سببی که انسان را به دعا بر خود به هلاکت و طلب علامت در نفس خود به آنچه او را هلاک می‌کند، می‌خواند، وجود دارد. و در آن، علم آنچه توهم می‌شود که بر آن قادر است و قادر نیست، و چرا اعجاز باز می‌گردد؟ آیا به امری باز می‌گردد که مخلوق بر آن قادر نیست، یا به امری که می‌توانست بر آن قادر باشد، سپس از آن منصرف شد؟ و در آن، علم آنچه تقوا در متقی به بار می‌آورد، وجود دارد. و در آن، علم فرق میان رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) و مؤمنان وجود دارد. و در آن، علم آنچه مخاطب از مخاطب می‌خواهد، هنگامی که با او سخن می‌گوید، وجود دارد. و در آن، علم آنچه ظاهر می‌شود که برای خداست و برای کَوْن است، و ظاهر می‌شود که برای کَوْن است و برای خداست، وجود دارد. و در آن، علم جهات، احاطه، سکون و حرکت وجود دارد. و در آن، علم منافع اخروی وجود دارد. و در آن، علم سببی که موجب امنیت در موطن خوف می‌شود، وجود دارد؛ آیا این صحیح است یا نه؟ و معنای موطن چیست؟ آیا حال در شخص است، پس موطن او حال اوست، یا موطن خارج از حال است؟ و در آن، علم اسباب موجب وجود اوهام حاکم در نفوس است، و آن‌ها صورت‌هایی از صور تجلی الهی (التجلی الإلهي) هستند. و در آن، علم آنچه از سؤال ستوده می‌شود و آنچه مکروه است، وجود دارد. و در آن، علم صلاح و رعایت اصلح و اینکه این بر چه کسی واجب است، وجود دارد. و در آن، علم وعد و وعید و اینکه شرعاً با چه کسی باید جنگید، هنگامی که دو گروه با هم روبرو می‌شوند و مردم برای جنگ صف می‌کشند، وجود دارد. «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 9
}