{
  "id": 466,
  "title": {
    "ar": "الباب السادس والستون وأربعمائة في معرفة حال قطب كان هجيره ومنزله سبحان الله",
    "en": "Chapter Four Hundred and Sixty-Six: Concerning the knowledge of the spiritual state (حال) of a Pole (قطب) whose constant refrain and dwelling was \"Glory be to God (سبحان الله).\"",
    "ur": "باب چار سو چھیاسٹھ: ایک قطب (Qutb) کے حال کی معرفت میں جس کا ورد اور منزل سبحان اللہ تھا۔",
    "fa": "باب چهارصد و شصت و ششم در معرفت حال قطبی که ذکر و منزلش «سبحان الله» بود"
  },
  "content": {
    "ar": "## «الباب السادس والستون وأربعمائة في معرفة حال قطب كان هجيره ومنزله سبحان الله»\n\n\n> إن الوجود على التسبيح فطرته *** فهو المنزه عن مثل وتشبيه‏\n\n\n> وثم في ثان حال جاء يعلمنا *** بأنه رب تشبيه وتنزيه‏\n\n\n> له النقيضان فهو الكون أجمعه *** بدري بذلك ذو فكر وتنبيه‏\n\n\n### [إن الله يأمرنا في القرآن بالتسبيح‏]\n\n\nقال الله عز وجل فَسُبْحانَ الله حِينَ تُمْسُونَ وحِينَ تُصْبِحُونَ وقد ورد الأمر بالتسبيح في القرآن في مواضع كثيرة ولكل موضع حكم ليس للآخر وتنقسم الطوائف في تسبيح الحق بحسب كل آية وردت في القرآن في التسبيح لو لا التطويل أوردناها وتكلمنا على الذاكر بها (اعلم) أن هذا الذكر ينتج للذاكر به ما قاله أبو العباس بن العريف‏\nالصنهاجى في محاسن المجالس لما ذكر حال العابد والمريد والعارف قال والحق وراء ذلك كله لا بد من ذلك وإن كان مع ذلك كله أو عين ذلك كله فهو مع ذلك كله بقوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ وهو عين ذلك كله بقوله تعالى سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ أَ ولَمْ يَكْفِ بِرَبِّكَ وهو من وراء جميع ما ذكره محيط بقوله والله من وَرائِهِمْ مُحِيطٌ وبقوله أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ فمن أراد أن يسبح الحق في هجيره فليسبحه بمعنى قوله وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ أي بالثناء الذي أثنى به على نفسه فإنه ما أضافه إلا الله هكذا هو تسبيح كل ما سوانا فإنا لا نفقة تسبيحهم إلا إذا أعلمنا الله به وهذا ضد ما تعطيه حقيقة التسبيح بل هذا تسبيح عن التسبيح مثل قولهم التوبة من التوبة فإن التسبيح تنزيه ولا ينزه إلا عن كل نعت محدث يتصف به المخلوق وما نزل إلينا من الله نعت في كتاب ولا سنة إلا وهو شرب المخلوق وجعل ذلك تعالى حمد نفسه وذكر عن كل شي‏ء أنه يسبح بحمده أي بالثناء الذي أنزله من عنده والْمَلائِكَةُ يَشْهَدُونَ وكَفى‏ بِاللَّهِ شَهِيداً فمن سبحه عن هذه المحامد فما سبحه بحمده بل أكذبه وإنما سبحه بعقله ودليله في زعمه والجمع بين الأمرين أن تسبحه بحمده وهو التنزيه عن التنزيه وذلك عين الاشتراك في النسبة كعدم العدم الذي هو وجود وإن أرادوا به المبالغة في التنزيه فذلك ليس بحمد الله بل حمد الله نفسه بما ذكرناه فإذا سبحه بحمده وهو الإقرار بما ورد من عنده مما أثنى به على نفسه أو مما أنزله عليك في قلبك وجاء به إليك في وجودك مما لم ينقل إليك واجعل ذلك التسبيح كالصورة واجعل قوله والحق وراء ذلك كله كالروح التي لا تشاهد عينها لتلك الصورة ويكفيك من العلم بها مشاهدتك أثرها فإنك تعلم أن وراء تلك الصورة أمرا آخر هو روحها كذلك تعلم أن الحق وراء كل ثناء لك فيه شرب ومن المحال أن يكون عندك ثناء على الله معين في الدنيا والآخرة لا يكون لك فيه شرب فإنه لا يصح لك أن تثني عليه بما لا تعقله ومهما عقلت شيئا أو علمته كان صفتك ولا بد فلا يصح في الكون على ما تعطيه الحقائق التسبيح الذي يتوهمه علماء الرسوم وإنما يصح التسبيح عن التسبيح ما دام رب وعبد ولا يزال عبد ورب فلا يزال الأمر هكذا فسبح بعد ذلك أو لا تسبح فأنت مسبح شئت أو أبيت وعلمت أم جهلت ولو لا ما هو الأمر على هذا في نفسه ما صح أن يظهر في العالم عين شرك ولا مشرك وقد ظهر في الوجود المشرك والشرك فلا بد له من مستند إلهي عنه ظهر هذا الحكم وليس إلا ما ذكرنا من أن العبد له شرب في كل ما يسبح به ربه من المحامد وأعلى المحامد بلا خلاف عقلا وشرعا لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ثم تمم الآية لنعرف المقصود ويصح أول الآية فقال وهُوَ السَّمِيعُ الْبَصِيرُ فلو لم يتمم لكان أول الآية يؤذن بأنا لسنا بعبيد وليس هو لنا بإله فلا بد من رابط وليس إلا الاشتراك إلا أنه عين الأصل في ذلك ونحن فيه كنسبة الفرع إلى الأصل والولد إلى الوالد وإن كان على صورته فليس هو عينه فارتبط به فلا ينسب إلا إليه لأن له عليه ولادة وغيره من الناس من أبناء جنسه ما له عليه ولادة فلا يقال إنه ابنه ونسبتنا من وجه مثل هذه النسبة لأن الوجود له وهو الذي استفاد منه المحدث إلا إن النسبة التي ورد بها السمع نسبة العبد إلى السيد والمخلوق إلى الخالق والرب إلى المربوب والمقدور إلى القادر والمصنوع إلى الصانع فإن نسبة البنوة أبعد النسب لتقلبه في الأطوار بما ليس للأب فيه تعمل وإنما له إلقاء الماء في الرحم عن قصد بنوة وعن لا قصد فبعدت النسبة لذلك كانت النطفة مخلقة وغير مخلقة ولو كان الأمر فيها للأب لكانت تامة أبدا أ لا ترى إلى النسبة القربية في خلق عيسى الطير بيده ثم نفخ فأتم خلقه فقربت نسبة الخلق إليه وكذلك صنائع المخلوقين كلهم فالبنوة\n\n\nمن الأبوة أبعد نسبة من جميع الأمور وهي أصح النسب وما كفر من قال إن المسيح ابن الله إلا لاقتصاره وكذلك كفر من قال نَحْنُ أَبْناءُ الله وأَحِبَّاؤُهُ لاقتصارهم لأنهم ذكروا نسبة تعم كل ما سوى الله إن كانت صحيحة فإن لم تكن في نفس الأمر صحيحة فهم والعالم فيها على السواء ولما كان الأمر النسبي في تولد العالم عن الله وأن وجوده فرع عن الوجود الآلي نبه تعريضا في تصريح لمن فهم الإشارة وقسم العبارة وذلك بقوله لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً فجوز ذلك وإنما نفي تعلق الإرادة باتخاذ الولد الإرادة لا تتعلق إلا بمعدوم والأمر وجود فلا تعلق للإرادة فإن المقصود حكم البنوة لا عين الشخص المسمى ابنا ثم تمم فقال لَاصْطَفى‏ مِمَّا يَخْلُقُ ما يَشاءُ فتدبر هذه الآية إلى تمامها وكذلك قوله تعالى لَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا إِنْ كُنَّا فاعِلِينَ أي ما كنا فاعلين إن نتخذه من غيرنا لأنه‏\nابن مريم المدعو بالابن ومن جعل إن شرطا لا نفيا يكون معنى إِنْ كُنَّا فاعِلِينَ إن نتخذ لهوا نتخذه من عندنا لا من عندكم فإنه ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ فما عندنا هو عند الله ونحن من عند الله وسيأتي هذا الهجير فإنه حال بعض الأقطاب فاعترف الحق بما أنكر ولذلك يكون الإنكار اعترافا بأن دعوى المدعي باطلة فيلزمه اليمين ما لم تقم بينة وبعد أن حصل من البيان ما حصل فلا بد أن نبين ما بقي في المسألة بالإجمال وهو أن التسبيح إذا سبح به المسبح أعني بلفظه الخاص به الدال عليه فلا بد أن يقيده باسم ما من الأسماء الإلهية الظاهرة أو المضمرة والمضافة والمطلقة وهو أن يقول سبحان الله أو سبحان الرب أو العالم فهذا معنى الاسم الظاهر وأما الاسم المضمر فمثل قوله سبحانه وسبحانك وأما المضاف فقوله سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ وأما المطلق سُبْحانَ الله وتَعالى‏ عَمَّا يُشْرِكُونَ فأي اسم نسبحه من أسماء الله تعالى وبأي حال نربطه فإن النتيجة التي تحصل لهذا لذاكر مناسبة لذلك الاسم ومرتبطة بتلك الحال ولا يظهر له صورة في الذاكر إلا بهذه المناسبة الخاصة فلا يتعين في هذا الذكر لنا أمر نقتصر عليه إلا ما ذكرناه مما يعم حكمه فإن النتائج تختلف فإن المحامد لا نقف عند حد والمسبح لا يسبحه إلا بحمده وتتبعنا الكتاب والسنة في طلب الأسماء فوجدناها تدور على الله والرب المضاف والاسم الناقص والاسم المضمر كالهاء والملك والعلي فالله قوله فَسُبْحانَ الله حِينَ تُمْسُونَ والرب قوله سُبْحانَ رَبِّكَ والاسم الناقص سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ والمضمر قوله سُبْحانَهُ وتَعالى‏ والملك مثل الذي‏\n\n\nورد في السنة سبحان الملك القدوس‏\n\n\nوالعلي كما\n\n\nورد في السنة سبحان العلي الأعلى‏\n\n\nوقد ورد من غير تقييد في السنة مثل قوله سبوح وهذا ذكر المذكور ونتيجته أعظم النتائج لأنه كناية عن عين المسبح بالتسبيح فاسمه هنا عينه وهذا أكمل تسبيح العارفين لأنه غاب عن الاسم فيه بالمسمى‏\n\n\n> فاسلك مع القوم أية سلكوا *** إلا إذا ما تراهم هلكوا\n\n\n> وهلكهم أن ترى شريعتهم *** بمعزل عنهم إذا سلكوا\n\n\n> فاتركهم لا تقل بقولهم *** تأسيا بالاله إذ تركوا\n\n\nفإن جماعة من العقلاء جعلوا الشريعة بمعزل فيما زعموا والشريعة أبدا لا تكون بمعزل فإنها تعم قول كل قائل واعتقاد كل معتقد ومدلول كل دليل لأنها عن الله المتكلم فيه قد نزلت وإنما قلنا في هذه الطائفة المعينة إنها جعلت الشريعة بمعزل مع كونها قالت ببعض ما جاءت به الشريعة فما أخذت من الشريعة إلا ما وافق نظرها وما عدا ذلك رمت به أو جعلته خطابا للعامة التي لا تفقه هذا إذا عرفت واعتقدت أن ذلك من عند الله لا من نفس الرسول وهو قوله تعالى الذي قال عنهم على طريق الذم لهم ويَقُولُونَ نُؤْمِنُ بِبَعْضٍ ونَكْفُرُ بِبَعْضٍ ويُرِيدُونَ أَنْ يَتَّخِذُوا بَيْنَ ذلِكَ سَبِيلًا أُولئِكَ هُمُ الْكافِرُونَ حَقًّا وقال تعالى أَ فَتُؤْمِنُونَ بِبَعْضِ الْكِتابِ وتَكْفُرُونَ بِبَعْضٍ فهذا معنى قولي إنهم جعلوا الشرع بمعزل وإن كان قد جاء الشرع بما هم عليه فما أخذوا منه ما أخذوا من كون الشرع جاء به وإنما قالوا به للموافقة احتجاجا وطائفتنا لا ترمي من الشريعة شيئا بل تترك نظرها وحكم عقلها بعد ثبوت الشرع لحكم ما يأتي به الشرع إليها ويقضي به فهم سادات العالم‏\n\n\n> إنما القوم سادة *** ومع المجد يملكون‏\n\n\n> أية يسلكون كن *** معهم حيث يسلكون‏\n\n\n> إنما القول منه كن *** للذي شاء أن يكون‏\n\n\n> كل شي‏ء يريده الحق *** من فعلهم يهون‏\n\n\n> والذي لا يريده *** وهو سهل فلا يهون‏\n\n\n### [التخلق بالأسماء الإلهية سبب ربط العالم بعضه ببعض‏]\n\n\nواعلم أن الله تعالى لما جعل بين الأشياء مناسبات ليربط العالم بعضه ببعض ولو لا ذلك لم يلتئم ولم يظهر له وجود أصلا وأصل ذلك المناسبة التي بيننا وبينه تعالى لولاها ما وجدنا ولا قبلنا التخلق بالأسماء الإلهية فما من حضرة له تعالى إلا ولنا فيها قدم ولنا إليها طريق أمم وسأورد ذلك إن شاء الله في باب الأسماء الإلهية من هذا الكتاب وأعظم الحضرات الإلهية في هذا الباب أنه لا يشبهه شي‏ء وما ثم إلا نحن ومن لم يشبهك فلم تشبهه فكما انتفت المثلية عنه انتفت المثلية عن العالم وهو كل ما سواه بالمجموع فإن العالم إنسان واحد كبير لا يماثل أي لا مثل له ولهذا هو كل مبدع على غير مثال‏\nفلا يخلو أهل الله إما أن يجعلوا الحق عين العالم فلا يماثله شي‏ء لأنه ليس ثم إلا الله والعالم صور تجليه ليس غيره فهو له وإن كان العالم وجودا آخر فما ثم إلا الله ومسمى العالم فلا مثل لله إلا أن يكون إله ولا إله إلا الله فلا مثل لله ولا مثل للعالم إلا أن يكون عالم ولا عالم إلا هذا العالم وهو الممكنات فلا مثل للعالم فصحت المناسبة من وجهين من نفي المثلية ومن قبوله للأسماء والحضرات الإلهية وكل ما في العالم من المماثلة بعضه ببعض فإنه لا يقدح في نفي المماثلة فإن تفاصيل العالم وأجزاءه المتماثلة والمختلفة والمتضادة كالاسماء لله المختلفة والمتماثلة والمتضادة كالعليم والعالم والعلام هذه متماثلة وهو أيضا الضار النافع فهذه المتضادة وهو العزيز الحكيم فهذه المختلفة ومع هذا فليس كمثله شي‏ء فهذه الآية له ولنا من أجل الكاف والاشتراك يؤذن بالتناسب وإذا كان لا بد من التناسب فنظرنا أي شي‏ء من المناسبات بين الحج والتسبيح حتى شبهه به تعالى فقلنا إن التسبيح هو الذكر العام في قوله وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وقال صَلَّى اللهُ عَليهِ وسَلَّم إنما شرعت المناسك لإقامة ذكر الله‏\n\n\nلاختلاف العالم لأن ذكر الله كله تسبيح بحمده أي بما أثنى على نفسه كما جعل التهليل مماثلا لعتق الرقاب النفيسة والعتق إنما هو أمر يخرج العبد من العبودية ولا يخرج من العبودية إلا أن يكون الحق سمعه وبصره وجميع قواه فيكون حقا كله فناسب قوله لا إله إلا الله وقد يكون عتق الرقاب من الألوهية بالعبودة فإن الشخص يتقيد بالربوبية فيطلب منه ما ليس بيده منه شي‏ء وإنما ذلك بيد الله فيحار فيعتقه الله من هذه النسبة إليه بما أظهر فيه عند المعتقد فيه ذلك من الجبر والافتقار وسلب هذه الأوصاف فعاد حرا في عبوديته فلم يكن له قدم في الربوبية فاستراح فهذا عتق أيضا شريف حيث تخلص لنفسه من تعلق الغير به كما خلص بالتهليل الألوهة لله من رق الدعوى بالآلهة المتخذة وهو قولهم أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً كما هو الأمر في نفسه إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ فجعل صَلَّى اللهُ عَليهِ وسَلَّم بوحيه المنزل وكشفه الممثل التهليل مناسبا لعتق الرقاب كما جعل التحميد مناسبا للحمل في سبيل الله وهو باب النعم والحمد لله شكرا لما يكون منه كما يكون من الأسباب للمسببات شكر بما نراه من آثارها فيها كما قال أَنِ اشْكُرْ لِي ولِوالِدَيْكَ وقُلْ رَبِّ ارْحَمْهُما كَما رَبَّيانِي صَغِيراً وسيرد في هجير الحمد لله ما يشفي الغليل إن شاء الله تعالى وكذلك من كبر ناسب بين التكبير وبين عظم ما لصاحبه من غير تعيين وما قرنه بشي‏ء معين مثل ما فعل في التسبيح والتحميد والتهليل فقيد هناك وأطلق هنا ليشمل الذكر التقييد والإطلاق وقد\n\n\nورد في هذا خبر حسن عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه من سبح الله مائة بالغداة ومائة بالعشي وهو قوله عز وجل وسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وقَبْلَ غُرُوبِها وقوله فَسُبْحانَ الله حِينَ تُمْسُونَ وحِينَ تُصْبِحُونَ وقرن ذلك بالمائة\n\n\nلأنه ليس لنا دار نسكنها إلا الجنة أو النار والجنة مائة درجة فمن أكملها مائة فقد حاز من كل درجة حظا وافرا بحسب ذكره بما يناسب ذلك الذكر من تلك الدرجات وكذلك دركات النار مائة درك تقابل درج الجنان له من جانب النار بهذا الذكر التنزيه من كل درك وله من الجنان الإنعام من كل درج فاعلم ذلك ثم نرجع إلى سرد الحديث وهو ما\n\n\nحدثنا به زاهر بن رستم الأصفهاني عن الكروخي عن الثلاثة محمود الأزدي والترياقي والعورجي كلهم عن الجراجى عن المحبوبي عن أبي عيسى الترمذي قال حدثنا محمد بن رزين الواسطي قال حدثنا أبو سفيان الحموي عن الضحاك بن حمزة عن عمرو بن شعيب عن أبيه عن جده قال قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من سبح الله مائة بالغداة ومائة بالعشي كان كمن حج مائة حجة يعني مقبولة ومن حمد الله مائة بالغداة ومائة بالعشي كان كمن حمل على مائة فرس في سبيل الله أو قال غزا مائة غزوة ومن هلل الله مائة بالغداة ومائة بالعشي كان كمن أعتق مائة رقبة من ولد إسماعيل ومن كبر الله مائة بالغداة ومائة بالعشي لم يأت في ذلك اليوم أحد بأكثر مما أتى إلا من قال مثل ما قال أو زاد على ما قال‏\n\n\nقال أبو عيسى هذا حديث حسن غريب ولما كان التسبيح بحمده قربة به‏\n\n\nفقال في الصحيح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في سبحان الله والحمد لله إنهما يملآن أو يملأ ما بين السماء والأرض‏\n\n\nوأراد قوله سبحان الله وبحمده فإن الحمد لله تملأ الميزان فإنها آخر ما يجعل في الميزان فيها يمتلئ كما قال وآخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ فالحمد لله له التأخير في الأمور لأن له الساقة ولا إله إلا الله له التقدمة وسبحان الله له الميسرة والله أكبر\nله الميمنة والقلب له لا حول ولا قوة إلا بالله فأثبت العبد والرب فاستصحاب الاسم الله لكل تسبيح وتحميد وتكبير وتهليل هو معطي القوة لذلك التسبيح أو التهليل أو التحميد والتكبير لأنه لفظ يمكن أن يطلق إذا أطلق ويقيد بغير الله في الإضافة بأن يسبح شخصا ليس الله ويكبره ويحمده ويهلل ما ليس بإله كقوم فرعون فلا قوة لهذا الذكر على أمثاله إلا بالله فإنه ما يتجلى لك بشي‏ء ليس هو الله فيقول لك أَنَا الله فتقول له أنت بالله إلا انعدم من ساعته إذ لم يكن الله وما رأيت من شهد هذا المشهد من رجال الله إلا رجل واحد من أهل قرطبة كان مؤذنا بالحرم المكي يقال له موسى بن محمد القباب كان من ساداتهم وهو تلميذ أبي الحسن بن خرازم بفأس فلا قوة على الثبوت إلا بالله حتى لو قالها بكلام الحق على لسان ذلك المتجلي ويقول له صاحب الكشف أنت بالله ما انعدم وثبت فهذا بعض ما ينتجه هذا الذكر والحمد لله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 466: On the Gnosis of the State of a Pole (قطب) whose Daily Practice (هجيره) and Station (منزله) was ‘Glory be to Allah’ (سبحان الله)\n\nIndeed, Existence (الوجود)—its primordial nature (فطرته) is based upon Glorification (التسبيح),\nThus, He is the Transcendent (المنزه) beyond likeness (مثل) or comparison (تشبيه).\nAnd then, in a second state, He came teaching us\nThat He is the Lord of both Comparison (تشبيه) and Transcendence (تنزيه).\nThe two opposites belong to Him, for He is the Cosmos (الكون) in its entirety;\nMy realization of this is for the one possessing reflection and awareness.\n\n### [Indeed, Allah Commands Us to Glorify Him in the Quran]\n\nAllah, the Mighty and Majestic, said: <<So glory be to Allah [فَسُبْحانَ الله] when you enter the evening and when you enter the morning [حِينَ تُمْسُونَ وحِينَ تُصْبِحُونَ]>>. The command for glorification (التسبيح) has appeared in the Quran in many places, and each place has a ruling (حكم) that the other does not. The spiritual groups (الطوائف) are divided concerning the glorification of the Real (الحق) according to every verse in the Quran that mentions glorification; were it not for the length, we would have cited them and discussed the one who performs the remembrance (الذاكر) through them.\n\nKnow (اعلم) that this remembrance (الذكر) produces for the one who performs it what Abu al-Abbas ibn al-Arif al-Sanhaji stated in *Mahasin al-Majalis* when he mentioned the state of the worshipper, the seeker (المريد), and the Gnostic (العارف). He said: \"And the Real (الحق) is beyond all of that; this is necessary, even if He is with all of that, or the very Essence (عين) of all of that.\" He is with all of that by His saying: <<And He is with you wherever you are [وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ]>>. And He is the very Essence of all of that by His saying, the Exalted: <<We will show them Our signs in the horizons and within themselves until it becomes clear to them that He is the Truth [أَنَّهُ الْحَقُّ]. Is your Lord not sufficient [أَ ولَمْ يَكْفِ بِرَبِّكَ]...>>. And He is encompassing (محيط) beyond everything mentioned, by His saying: <<And Allah is encompassing them from behind [والله من وَرائِهِمْ مُحِيطٌ]>> and by His saying: <<Unquestionably, He is encompassing all things [أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ]>>.\n\nSo, whoever wishes to glorify the Real (الحق) in his daily practice (هجيره), let him glorify Him according to the meaning of His saying: <<And there is not a thing except that it glorifies [يُسَبِّحُ] Him by His praise [بِحَمْدِهِ]>>—that is, by the praise (ثناء) with which He praised Himself, for nothing attributed it except Allah. This is the glorification (تسبيح) of everything other than us, for we do not understand their glorification unless Allah informs us of it.\n\nThis is contrary to what the Reality of Glorification (حقيقة التسبيح) dictates; rather, this is glorification *from* glorification, like their saying, 'Repentance from repentance.' For glorification (التسبيح) is transcendence (تنزيه), and one only transcends Him from every originated attribute (نعت محدث) with which the creature (المخلوق) is described. And no attribute (نعت) has descended to us from Allah, neither in the Book nor the Sunnah, except that the creature has a share (شرب) in it. The Exalted made that His own praise (حمد نفسه), and He mentioned concerning everything that it glorifies Him by His praise (بحمده), meaning by the praise (ثناء) that He sent down from Himself. <<And the angels bear witness [وَالْمَلائِكَةُ يَشْهَدُونَ]>> and <<Sufficient is Allah as a Witness [وَكَفَى بِاللَّهِ شَهِيدًا]>>.\n\nSo, whoever glorifies Him *away* from these praises (المحامد) has not glorified Him by His praise; rather, he has denied Him. He has only glorified Him by his own intellect and his supposed proof. The combination of the two matters is that you glorify Him by His praise, which is transcendence *from* transcendence (التنزيه عن التنزيه). That is the very essence (عين) of sharing in the relationship, like the non-existence of non-existence, which is Existence (وجود). If they intend by it exaggeration in transcendence, then that is not the praise of Allah; rather, the praise of Allah is what we have mentioned.\n\nSo, when you glorify Him by His praise, which is the affirmation of what came from Him—whether what He praised Himself with, or what He sent down upon you in your heart, or what came to you in your existence that was not transmitted to you—make that glorification like the form (الصورة), and make His saying, \"And the Real is beyond all of that,\" like the spirit (الروح) whose essence (عينها) is not witnessed by that form. It is sufficient for you in knowing it to witness its effect (أثرها), for you know that behind that form is another matter which is its spirit. Likewise, you know that the Real (الحق) is beyond every praise in which you have a share (شرب).\n\nIt is impossible that you possess a specific praise of Allah, in this world or the next, in which you do not have a share. For it is not valid for you to praise Him with what you do not comprehend, and whatever you comprehend or know is necessarily your attribute (صفتك). Therefore, the glorification imagined by the scholars of external forms (علماء الرسوم) is not valid in the Cosmos (الكون), according to what the Realities (الحقائق) dictate. Rather, glorification *from* glorification is valid as long as there is a Lord and a servant, and the servant and the Lord will never cease to be, so the matter will always be thus. So, whether you glorify after that or not, you are glorifying, whether you wish it or not, and whether you know it or are ignorant of it.\n\nWere the matter not inherently thus, it would not be valid for the essence (عين) of polytheism (شرك) or the polytheist (مشرك) to appear in the World (العالم). The polytheist and polytheism have appeared in Existence (الوجود), so there must be a Divine basis (مستند إلهي) from which this ruling (حكم) appeared. And this basis is none other than what we mentioned: that the servant has a share (شرب) in all the praises (المحامد) with which he glorifies his Lord.\n\nThe highest of praises, without dispute rationally or legally, is <<There is nothing like unto Him [لَيْسَ كَمِثْلِهِ شَيْءٌ]>>. Then He completed the verse so that we might know the intention and validate the beginning of the verse, saying: <<And He is the All-Hearing, the All-Seeing [وهُوَ السَّمِيعُ الْبَصِيرُ]>>. Had He not completed it, the beginning of the verse would imply that we are not servants and that He is not a God to us. Thus, a connection is necessary, and this connection is none other than sharing (الاشتراك), except that He is the very Essence (عين) of the Origin in that, and we are in it like the relationship of the branch to the root, and the child to the parent: even if the child is upon his form, he is not his very essence (عينه). So, he is connected to him and is only attributed to him, because the parent has given birth to him, while others among his kind have not given birth to him, so they are not called his son.\n\nOur relationship, in one respect, is like this relationship, because Existence (الوجود) belongs to Him, and it is from Him that the originated (المحدث) benefits. However, the relationship transmitted by revelation (السمع) is the relationship of the servant to the Master, the created to the Creator, the Lord to the nurtured (المربوب), the determined to the Determiner (القادر), and the made to the Maker (الصانع). Indeed, the relationship of sonship (البنوة) is the furthest of relationships due to the child's transformation through stages in which the father has no active role. The father's role is merely casting the water into the womb, whether with the intention of sonship or without intention. Thus, the relationship is distant, which is why the sperm is sometimes formed and sometimes unformed. If the matter were entirely up to the father, it would always be perfect. Do you not see the close relationship in the creation of the bird by Jesus (عيسى) with his hand, then he breathed into it, completing its creation? Thus, the relationship of creation to him was close. And likewise are all the products of creatures. Sonship from fatherhood is the furthest relationship of all matters, yet it is the soundest relationship.\n\nThose who said that the Messiah is the Son of God did not disbelieve except due to their limitation (اقتصاره). Likewise, those who said <<We are the children of Allah and His beloved ones [نَحْنُ أَبْناءُ الله وأَحِبَّاؤُهُ]>> disbelieved due to their limitation. Because they mentioned a relationship that encompasses everything other than Allah, if it were true. If it is not true in reality (في نفس الأمر), then they and the rest of the world are equal in it.\n\nSince the relational matter concerning the generation of the World (العالم) from Allah, and that its existence (وجوده) is a branch of the Divine Existence (الوجود الآلي), He gave an implicit warning within an explicit statement for those who understand the allusion (الإشارة) and divide the expression (العبارة). That is by His saying: <<Had Allah intended to take a son [لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً]...>>. Thus, He permitted the possibility, but He negated the attachment of the Will (الإرادة) to the taking of a son. The Will (الإرادة) only relates to what is non-existent (معدوم), and the matter is Existence (وجود), so the Will has no relation. For the intended meaning is the ruling of sonship (حكم البنوة), not the essence (عين) of the person called a son. Then He completed it, saying: <<He would have chosen from what He creates that which He wills [لَاصْطَفى‏ مِمَّا يَخْلُقُ ما يَشاءُ]>>. Reflect upon this verse to its completion.\n\nLikewise, His saying, the Exalted: <<Had We intended to take a diversion (لهْواً), We would have taken it from Ourselves [من لَدُنَّا], if We were to do so [إِنْ كُنَّا فاعِلِينَ]>>. Meaning, we would not have done so by taking it from other than Ourselves, because the son of Mary is called the son. And whoever takes *in* (إن) as conditional, not negative, the meaning of <<if We were to do so [إِنْ كُنَّا فاعِلِينَ]>> is: if we were to take a diversion, we would take it from Our presence, not from your presence. For <<What is with you runs out [ما عِنْدَكُمْ يَنْفَدُ], and what is with Allah remains [وما عِنْدَ الله باقٍ]>> and <<There is not a thing but that its treasures are with Us [وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ]>>. So, what is with us is with Allah, and we are from Allah. This daily practice (هجير) will come, for it is the state (حال) of some of the Poles (الأقطاب).\n\nSo, the Real (الحق) acknowledged what He denied. Therefore, the denial is an acknowledgment that the claimant's assertion is false, and he is required to take an oath unless proof is established. After the clarification that has occurred, we must generally explain what remains in the matter.\n\nThis is that when the glorifier performs glorification—meaning with its specific word that indicates it—he must qualify it with one of the Divine Names (الأسماء الإلهية), whether manifest (الظاهرة), implicit (المضمرة), annexed (المضافة), or absolute (المطلقة). This means saying *Subhan Allah* (Glory be to Allah) or *Subhan al-Rabb* (Glory be to the Lord) or *al-Alim* (the Knower). This is the meaning of the manifest Name. As for the implicit Name (الاسم المضمر), it is like saying *Subhanahu* (Glory be to Him) and *Subhanaka* (Glory be to You). As for the annexed Name (المضاف), it is His saying: <<Glory be to your Lord, the Lord of Might [سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ]>>. As for the absolute Name (المطلق), it is <<Glory be to Allah and Exalted is He above what they associate [سُبْحانَ الله وتَعالى‏ عَمَّا يُشْرِكُونَ]>>.\n\nSo, whichever Name of Allah, the Exalted, we glorify, and to whichever state (حال) we link it, the result obtained by the one performing the remembrance (الذاكر) is appropriate to that Name and connected to that state. And no form appears for it in the one performing the remembrance except through this specific appropriateness. Therefore, in this remembrance, there is no specific matter for us to restrict ourselves to, except what we have mentioned whose ruling is general. For the results differ, and the praises (المحامد) do not stop at a limit, and the glorifier only glorifies Him by His praise (بحمده).\n\nWe tracked the Book and the Sunnah in search of the Names and found them revolving around *Allah*, the annexed *Rabb* (Lord), the incomplete Name, and the implicit Name, such as the *ha'* (He), *al-Malik* (the King), and *al-Ali* (the High). For *Allah* is His saying: <<So glory be to Allah [فَسُبْحانَ الله] when you enter the evening...>>. And *al-Rabb* (the Lord) is His saying: <<Glory be to your Lord [سُبْحانَ رَبِّكَ]...>>. And the incomplete Name is <<Glory be to Him who took His servant [سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ]...>>. And the implicit Name is His saying: <<Glory be to Him and Exalted is He [سُبْحانَهُ وتَعالى‏]...>>. And *al-Malik* (the King) is like what is mentioned in the Sunnah: 'Glory be to the King, the Holy [سبحان الملك القدوس].' And *al-Ali* (the High) is as mentioned in the Sunnah: 'Glory be to the High, the Most High [سبحان العلي الأعلى].'\n\nAnd it has been mentioned in the Sunnah without qualification, such as His saying *Subbuh* (The Glorified). This is the remembrance of the Mentioned One, and its result is the greatest of results, because it is an allusion to the very Essence (عين) of the Glorifier through the glorification. Thus, His Name here is His Essence (عينه). This is the most complete glorification of the Gnostics (العارفين), because in it, they are absent from the Name by the Named.\n\nSo, travel with the people [the Sufis] wherever they travel,\nUnless you see them perish.\nAnd their perishing is that you see their Law (شريعتهم)\nIsolated from them when they travel [the path].\nSo, leave them and do not speak their saying,\nFollowing the example of the Deity when they abandoned [the Law].\n\nIndeed, a group of intellectuals (العقلاء) claimed to isolate the Law (الشريعة), but the Law can never be isolated. For it encompasses the saying of every speaker, the belief of every believer, and the implication of every proof, because it descended from Allah, the One spoken about. We only said concerning this specific group that they isolated the Law, despite the fact that they affirmed some of what the Law brought. They took from the Law only what agreed with their own view, and everything else they discarded or deemed it a discourse for the common folk (العامة) who do not understand. This is if they knew and believed that it came from Allah, not from the Messenger himself. This is His saying, the Exalted, which He spoke about them by way of censure: <<And they say, 'We believe in part and disbelieve in part,' and desire to take a way between that. Those are the disbelievers, truly [أُولئِكَ هُمُ الْكافِرُونَ حَقًّا]>>. And He, the Exalted, said: <<Do you then believe in part of the Book and disbelieve in part [أَ فَتُؤْمِنُونَ بِبَعْضِ الْكِتابِ وتَكْفُرُونَ بِبَعْضٍ]>>? This is the meaning of my statement that they isolated the Law, for even if the Law brought what they hold, they did not take what they took because the Law brought it; rather, they affirmed it merely for agreement, using it as an argument. But our group [the true Sufis] does not discard anything from the Law; rather, they abandon their own view and the ruling of their intellect after the Law is established, submitting to the ruling that the Law brings to them and decrees. Thus, they are the masters of the World (سادات العالم).\n\nIndeed, these people are masters,\nAnd with glory, they possess dominion.\nWherever they travel, be\nWith them, wherever they travel.\nIndeed, the saying from Him is 'Be!'\nFor that which He willed to be.\nEverything that the Real (الحق) wills\nFrom their action becomes easy.\nAnd that which He does not will,\nEven if it is easy, it does not become easy.\n\n### [Assuming the Character of the Divine Names (التخلق بالأسماء الإلهية) is the Reason for Linking the World Together]\n\nKnow that when Allah, the Exalted, established appropriateness (مناسبات) between things in order to link the World (العالم) together, were it not for that, it would not cohere, nor would its existence (وجود) appear at all. The origin of this is the appropriateness that exists between us and Him, the Exalted. Were it not for this, we would not have existed, nor would we have accepted the assumption of the character of the Divine Names (التخلق بالأسماء الإلهية). There is no Divine Presence (حضرة) of the Exalted except that we have a footing (قدم) in it, and we have a clear path to it. I shall mention this, if Allah wills, in the chapter on the Divine Names (الأسماء الإلهية) in this book.\n\nThe greatest of the Divine Presences (الحضرات الإلهية) in this chapter is that nothing resembles Him, and there is nothing there except us. And whoever does not resemble you, you do not resemble him. Just as likeness (المثلية) is negated from Him, likeness is negated from the World (العالم), which is everything other than Him, taken as a whole. For the World is one great human (إنسان واحد كبير) that has no counterpart—that is, it has no likeness. This is why it is entirely an innovation created without precedent.\n\nThe People of Allah (أهل الله) either hold that the Real (الحق) is the very Essence (عين) of the World, so nothing resembles Him, because there is nothing there except Allah, and the World is merely the forms of His Theophanies (تجلي), so it belongs to Him. Or, if the World is another Existence (وجود), then there is nothing there except Allah and the named World. Thus, there is no likeness for Allah unless it be a god, and there is no god but Allah. So, there is no likeness for Allah, and there is no likeness for the World unless it be a world, and there is no world except this World, which is the contingent things (الممكنات). Thus, there is no likeness for the World.\n\nTherefore, the appropriateness (المناسبة) is valid from two aspects: the negation of likeness, and its acceptance of the Names and the Divine Presences (الحضرات الإلهية). And all the resemblance (المماثلة) that exists in the World, one part to another, does not invalidate the negation of likeness (نفي المماثلة). For the details of the World and its parts—the similar, the different, and the contradictory—are like the Names of Allah: the different, the similar, and the contradictory. *Al-Alim* (the Knower), *al-Aalim* (the Knowing), and *al-Allam* (the All-Knower) are similar. He is also *al-Darr* (the Harmer) and *al-Nafi* (the Benefiter)—these are contradictory. And He is *al-Aziz* (the Mighty) and *al-Hakim* (the Wise)—these are different. Despite this, <<There is nothing like unto Him [لَيْسَ كَمِثْلِهِ شَيْءٌ]>>. This verse belongs to Him and to us, due to the *kaf* (like) and the sharing (الاشتراك), which implies appropriateness (التناسب).\n\nSince appropriateness is necessary, we looked at what kind of appropriateness exists between Hajj (Pilgrimage) and glorification (التسبيح) such that the Exalted likened it to Hajj. We said that glorification (التسبيح) is the general remembrance (الذكر العام) in His saying: <<And there is not a thing except that it glorifies Him by His praise [وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ]>>. And the Prophet, peace and blessings be upon him, said: \"The rites (المناسك) were only legislated for the establishment of the remembrance of Allah (ذكر الله).\" Due to the difference in the World, because all remembrance of Allah is glorification by His praise—that is, by what He praised Himself with—just as *Tahlil* (saying *La ilaha illa Allah*) was made analogous to the freeing of precious slaves (عتق الرقاب النفيسة).\n\nAnd freeing is a matter that removes the servant from servitude (العبودية). He is not removed from servitude unless the Real (الحق) becomes his hearing, his sight, and all his powers, so that he is entirely the Real. Thus, it was appropriate to the saying *La ilaha illa Allah* (There is no god but Allah). And the freeing of slaves may also be a freeing from divinity through servitude. For the person is restricted by Lordship (الربوبية), so he seeks from the Lord what is not in the Lord's hand, but rather is in Allah's hand. He becomes confused, so Allah frees him from this relationship to Him by manifesting in him, for the one who believes in Him, the compulsion (الجبر), the need (الافتقار), and the removal of these attributes. Thus, he returns free in his servitude (عبوديته). He had no footing (قدم) in Lordship, so he found rest. This is also a noble freeing, as he freed himself from the attachment of others to him, just as *Tahlil* freed the Divinity of Allah from the bondage of the claim of adopted gods. This is their saying: <<Has he made the gods into one God [أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً]?>> as is the matter in itself: <<Indeed, this is a surprising thing [إِنَّ هذا لَشَيْءٌ عُجابٌ]>>.\n\nSo, the Prophet, peace and blessings be upon him, by his revealed inspiration and his represented unveiling (كشفه الممثل), made *Tahlil* appropriate to the freeing of slaves. Just as he made *Tahmid* (saying *Alhamdulillah*) appropriate to carrying arms in the way of Allah (الحمل في سبيل الله), which is the door of blessings (النعم). And *Alhamdulillah* (Praise be to Allah) is thanks for what comes from Him, just as thanks comes from causes to effects through what we see of their traces in them. As He said: <<Be grateful to Me and to your parents [أَنِ اشْكُرْ لِي ولِوالِدَيْكَ]>> and <<Say, 'My Lord, have mercy upon them as they nurtured me when I was small [رَبِّ ارْحَمْهُما كَما رَبَّيانِي صَغِيراً]'>>. And there will come in the daily practice of *Alhamdulillah* what will quench the thirst, if Allah, the Exalted, wills.\n\nLikewise, whoever performs *Takbir* (saying *Allahu Akbar*) established an appropriateness between *Takbir* and the greatness that belongs to its possessor, without specification. He did not link it to a specific thing, as he did with *Tasbih*, *Tahmid*, and *Tahlil*. He qualified them there and left *Takbir* absolute here, so that the remembrance encompasses both qualification and absolute freedom.\n\nA good report has come concerning this from the Messenger of Allah, peace and blessings be upon him, that whoever glorifies Allah a hundred times in the morning and a hundred times in the evening—which is His saying, the Mighty and Majestic: <<And glorify [وَسَبِّحْ] with the praise of your Lord before the rising of the sun and before its setting [قَبْلَ طُلُوعِ الشَّمْسِ وقَبْلَ غُرُوبِها]>> and His saying: <<So glory be to Allah when you enter the evening and when you enter the morning [فَسُبْحانَ الله حِينَ تُمْسُونَ وحِينَ تُصْبِحُونَ]>>. He linked that to the number one hundred because we have no abode to dwell in except Paradise (الجنة) or the Fire (النار), and Paradise has one hundred degrees (درجة). So, whoever completes the hundred has acquired an ample share of every degree, according to his remembrance, in a manner appropriate to that remembrance from those degrees. Likewise, the levels of the Fire (دركات النار) are one hundred levels, corresponding to the degrees of Paradise. Through this remembrance, he gains transcendence (التنزيه) from every level of the Fire, and he gains blessing (الإنعام) from every degree of Paradise. Know that.\n\nThen we return to citing the Hadith, which was narrated to us by Zahir ibn Rustum al-Isfahani, from al-Krukhi, from the three: Mahmud al-Azdi, al-Tiryaqi, and al-Awraji, all of them from al-Jaraji, from al-Mahbubi, from Abu Isa al-Tirmidhi, who said: Muhammad ibn Razin al-Wasiti narrated to us, who said: Abu Sufyan al-Hamawi narrated to us, from al-Dahhak ibn Hamza, from Amr ibn Shu'ayb, from his father, from his grandfather, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever glorifies Allah a hundred times in the morning and a hundred times in the evening is like one who performed one hundred Hajj pilgrimages\"—meaning accepted ones. \"And whoever praises Allah a hundred times in the morning and a hundred times in the evening is like one who mounted one hundred horses in the way of Allah,\" or he said, \"fought one hundred battles.\" \"And whoever says *La ilaha illa Allah* a hundred times in the morning and a hundred times in the evening is like one who freed one hundred slaves from the descendants of Ishmael. And whoever says *Allahu Akbar* a hundred times in the morning and a hundred times in the evening, no one will come on that day with more than he came with, except one who said the same as he said or added to what he said.\" Abu Isa said: This is a good, rare Hadith.\n\nSince glorification by His praise is a means of drawing near to Him, it is stated in the *Sahih* collection, on the authority of the Messenger of Allah, peace and blessings be upon him, concerning *Subhan Allah* and *Alhamdulillah*, that they fill, or fill up, what is between the heaven and the earth. He meant His saying *Subhan Allah wa bihamdihi* (Glory be to Allah and by His praise), for *Alhamdulillah* (Praise be to Allah) fills the Scale (الميزان), as it is the last thing placed in the Scale, by which it is filled, as He said: <<And the conclusion of their call will be, 'Praise be to Allah, Lord of the Worlds [أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ]'>>.\n\nSo, *Alhamdulillah* has the delay in matters because it holds the rear guard (الساقة). *La ilaha illa Allah* (There is no god but Allah) has the vanguard (التقدمة). *Subhan Allah* (Glory be to Allah) has the left flank (الميسرة). *Allahu Akbar* (Allah is Greater) has the right flank (الميمنة). And the heart (القلب) belongs to *La hawla wa la quwwata illa billah* (There is no power and no strength except with Allah).\n\nThus, He established the servant and the Lord. The accompaniment of the Name Allah (الاسم الله) with every glorification, praise, magnification, and declaration of unity is what grants power to that glorification, declaration of unity, praise, and magnification. Because it is a word that can be used absolutely, and it can be qualified by other than Allah in annexation—such that one glorifies a person who is not Allah, or magnifies him, or praises him, or declares as god what is not a god, like the people of Pharaoh. So, this remembrance has no power over its likes except through Allah. For nothing that is not Allah will manifest (يتجلى) to you and say, \"I am Allah,\" and you respond, \"You are by Allah,\" except that it vanishes instantly, since it was not Allah.\n\nI have not seen anyone among the Men of Allah (رجال الله) who witnessed this station (المشهد) except one man from Cordoba who was a caller to prayer (مؤذنا) in the Sacred Mosque of Mecca, named Musa ibn Muhammad al-Qabbab. He was one of their masters and a student of Abu al-Hasan ibn Kharazim in Fez. There is no power for permanence (الثبوت) except through Allah. Even if the Real speaks it through the tongue of that manifest entity, and the possessor of the Unveiling (صاحب الكشف) says to him, \"You are by Allah,\" the entity does not vanish but remains firm. This is some of what this remembrance produces. And praise be to Allah. <<And Allah speaks the truth, and He guides to the way [وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ]>>.",
    "ur": "باب نمبر چار سو چھیاسٹھ: اس قطب کے حال کی معرفت میں جس کا ورد اور ٹھکانہ \"سبحان اللہ\" تھا۔\n\nبے شک الوجود (ہستی) کی فطرت تسبیح پر ہے،\nپس وہ ہر مثل اور تشبیہ سے منزہ ہے۔\nپھر دوسری حالت میں وہ ہمیں یہ سکھانے آیا،\nکہ وہ تشبیہ اور تنزیہ دونوں کا رب ہے۔\nدونوں متضاد صفات اسی کے لیے ہیں، پس وہ تمام کائنات ہے،\nاس بات کو میرا جاننے والا، صاحبِ فکر و تنبیہ، خوب جانتا ہے۔\n\n### [بے شک اللہ ہمیں قرآن میں تسبیح کا حکم دیتا ہے]\n\nاللہ عزوجل نے فرمایا: **فَسُبْحانَ الله حِينَ تُمْسُونَ وحِينَ تُصْبِحُونَ** (پس اللہ کی تسبیح کرو جب تم شام کرتے ہو اور جب تم صبح کرتے ہو)۔ اور تسبیح کا حکم قرآن میں بہت سے مقامات پر آیا ہے، اور ہر مقام کا ایک ایسا حکم ہے جو دوسرے کے لیے نہیں ہے۔ الحق (ذات حق) کی تسبیح میں گروہ ہر اس آیت کے مطابق تقسیم ہو جاتے ہیں جو قرآن میں تسبیح کے بارے میں وارد ہوئی ہے۔ اگر طوالت کا خوف نہ ہوتا تو ہم انہیں یہاں درج کرتے اور ان پر کلام کرتے جو ان کے ذریعے ذکر کرتے ہیں۔\n\n(جان لو) کہ یہ ذکر کرنے والے کے لیے وہی نتیجہ پیدا کرتا ہے جو ابو العباس ابن العریف الصنہاجی نے *محاسن المجالس* میں بیان کیا تھا، جب انہوں نے عابد، مرید اور عارف کے حال کا ذکر کیا، تو کہا: اور الحق (ذات حق) ان سب کے ماوراء ہے، یہ ضروری ہے۔ اگرچہ وہ ان سب کے ساتھ بھی ہے یا ان سب کا عین بھی ہے۔ وہ ان سب کے ساتھ ہے اپنے اس قول کے ذریعے: **وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ اور وہ ان سب کا عین ہے اپنے اس فرمان کے ذریعے: **سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ أَ ولَمْ يَكْفِ بِرَبِّكَ** (ہم انہیں اپنی نشانیاں آفاق میں اور ان کے نفوس میں دکھائیں گے، یہاں تک کہ ان پر ظاہر ہو جائے کہ وہی الحق (ذات حق) ہے، کیا تمہارا رب کافی نہیں ہے؟)۔ اور وہ ان تمام چیزوں کے ماوراء محیط ہے اپنے اس قول کے ذریعے: **والله من وَرائِهِمْ مُحِيطٌ** (اور اللہ ان کے پیچھے سے محیط ہے) اور اپنے اس قول کے ذریعے: **أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ** (خبردار! بے شک وہ ہر چیز پر محیط ہے)۔\n\nپس جو شخص الحق (ذات حق) کی تسبیح اپنے ورد میں کرنا چاہے، تو اسے اس کے اس قول کے معنی میں تسبیح کرنی چاہیے: **وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ** (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ یعنی اس ثناء کے ساتھ جو اس نے خود اپنی ذات پر کی ہے۔ کیونکہ اسے اللہ کے سوا کسی نے نہیں جوڑا۔ ہمارے سوا ہر چیز کی تسبیح اسی طرح ہے۔ کیونکہ ہم ان کی تسبیح کو نہیں سمجھتے، مگر جب اللہ ہمیں اس کی خبر دے۔ اور یہ اس کے خلاف ہے جو تسبیح کی حقیقت عطا کرتی ہے۔ بلکہ یہ تسبیح سے توبہ کی طرح تسبیح سے تسبیح ہے۔ کیونکہ تسبیح تنزیہ ہے، اور تنزیہ صرف ہر اس صفتِ محدث سے کی جاتی ہے جس سے مخلوق متصف ہوتی ہے۔ اور اللہ کی طرف سے جو بھی صفت کتاب یا سنت میں ہم تک پہنچی ہے، وہ مخلوق کا شرب (حصہ) ہے۔ اور اللہ تعالیٰ نے اسے اپنی حمد قرار دیا ہے، اور ہر چیز کے بارے میں ذکر کیا ہے کہ وہ اس کی حمد کے ساتھ تسبیح کرتی ہے، یعنی اس ثناء کے ساتھ جو اس نے اپنی طرف سے نازل کی ہے، اور **وَالْمَلائِكَةُ يَشْهَدُونَ وَكَفَى بِاللَّهِ شَهِيدًا** (اور فرشتے گواہی دیتے ہیں، اور اللہ بطور گواہ کافی ہے)۔\n\nپس جس نے اس کی تسبیح ان محامد سے ہٹ کر کی، تو اس نے اس کی حمد کے ساتھ تسبیح نہیں کی، بلکہ اسے جھٹلایا۔ اس نے تو صرف اپنے گمان میں اپنی عقل اور دلیل کے ساتھ تسبیح کی۔ اور دونوں امور کو جمع کرنے کا طریقہ یہ ہے کہ تم اس کی حمد کے ساتھ تسبیح کرو، اور وہ تنزیہ سے تنزیہ ہے۔ اور یہ نسبت میں اشتراک کا عین ہے، جیسے عدم کا عدم جو کہ وجود ہے۔ اور اگر وہ اس سے تنزیہ میں مبالغہ مراد لیتے ہیں، تو یہ اللہ کی حمد نہیں ہے، بلکہ اللہ کی حمد وہ ہے جو ہم نے ذکر کی۔\n\nپس جب تم اس کی حمد کے ساتھ تسبیح کرتے ہو، اور وہ اس بات کا اقرار ہے جو اس کی طرف سے وارد ہوا، جس کے ذریعے اس نے خود اپنی ثناء کی، یا جو اس نے تمہارے قلب میں نازل کیا اور تمہارے الوجود (ہستی) میں تمہارے پاس لایا جو تم تک منتقل نہیں ہوا، اور تم اس تسبیح کو صورت کی طرح بناؤ، اور اس کے قول \"اور الحق (ذات حق) ان سب کے ماوراء ہے\" کو اس روح کی طرح بناؤ جس کا عین اس صورت کے لیے مشاہدہ نہیں کیا جاتا۔ اور اس کے علم کے لیے تمہارا اس کے اثر کا مشاہدہ کافی ہے۔ کیونکہ تم جانتے ہو کہ اس صورت کے ماوراء ایک اور امر ہے جو اس کی روح ہے۔ اسی طرح تم جانتے ہو کہ الحق (ذات حق) تمہاری ہر اس ثناء کے ماوراء ہے جس میں تمہارا شرب (حصہ) ہے۔ اور یہ محال ہے کہ تمہارے پاس دنیا اور آخرت میں اللہ کی کوئی ایسی معین ثناء ہو جس میں تمہارا شرب (حصہ) نہ ہو۔ کیونکہ تمہارے لیے یہ درست نہیں کہ تم اس کی ثناء اس چیز سے کرو جسے تم عقل نہ کر سکو۔ اور جب بھی تم کسی چیز کو عقل کرتے ہو یا جانتے ہو، تو وہ لازماً تمہاری صفت ہوتی ہے۔ پس کائنات میں، حقائق کے تقاضے کے مطابق، وہ تسبیح درست نہیں جو علماء الرسوم (ظاہری علم والے) وہم کرتے ہیں۔\n\nبلکہ تسبیح سے تسبیح (التسبيح عن التسبيح) تب تک درست ہے جب تک رب اور عبد موجود ہیں۔ اور عبد اور رب ہمیشہ رہیں گے۔ پس معاملہ ہمیشہ اسی طرح رہے گا۔ اس کے بعد تم تسبیح کرو یا نہ کرو، تم تسبیح کرنے والے ہو، خواہ تم چاہو یا نہ چاہو، اور خواہ تم جانو یا نہ جانو۔ اور اگر معاملہ اپنی ذات میں اسی طرح نہ ہوتا، تو عالم میں شرک کا عین اور مشرک کا ظہور درست نہ ہوتا۔ اور الوجود (ہستی) میں مشرک اور شرک ظاہر ہو چکے ہیں۔ پس اس حکم کے ظہور کے لیے ایک الٰہی سند کا ہونا ضروری ہے، اور وہ وہی ہے جو ہم نے ذکر کیا کہ عبد کا ہر اس حمد میں شرب (حصہ) ہے جس کے ذریعے وہ اپنے رب کی تسبیح کرتا ہے۔ اور اعلیٰ ترین محامد، عقلی اور شرعی طور پر بلا اختلاف، **لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس کی مثل کوئی چیز نہیں ہے)۔ پھر آیت کو مکمل کیا تاکہ ہم مقصود کو جانیں اور آیت کا پہلا حصہ درست ہو، پس فرمایا: **وهُوَ السَّمِيعُ الْبَصِيرُ** (اور وہ سننے والا، دیکھنے والا ہے)۔ اگر اسے مکمل نہ کیا جاتا تو آیت کا پہلا حصہ یہ بتاتا کہ ہم بندے نہیں ہیں اور وہ ہمارا معبود نہیں ہے۔ پس ایک رابط کا ہونا ضروری ہے، اور وہ صرف اشتراک ہے، مگر یہ کہ وہ اس میں اصل کا عین ہے، اور ہم اس میں اصل کے مقابلے میں فرع کی نسبت کی طرح ہیں، اور بیٹے کی والد سے نسبت کی طرح ہیں۔ اگرچہ وہ اس کی صورت پر ہے، مگر وہ اس کا عین نہیں ہے۔ پس وہ اس سے جڑا ہوا ہے، اور اس کی نسبت صرف اسی کی طرف کی جاتی ہے، کیونکہ اس کی اس پر ولادت ہے، اور اس کے ہم جنس دوسرے لوگوں کی اس پر ولادت نہیں ہے، لہٰذا یہ نہیں کہا جاتا کہ وہ اس کا بیٹا ہے۔\n\nاور ایک لحاظ سے ہماری نسبت بھی اسی نسبت کی طرح ہے، کیونکہ الوجود (ہستی) اسی کا ہے، اور محدث نے اسی سے فائدہ اٹھایا ہے۔ مگر یہ کہ جو نسبت سمع (وحی) میں وارد ہوئی ہے، وہ عبد کی سید سے، مخلوق کی خالق سے، رب کی مربوب سے، مقدور کی قادر سے، اور مصنوع کی صانع سے نسبت ہے۔ کیونکہ بنوت (بیٹا ہونے) کی نسبت سب سے دور کی نسبت ہے، اس کے اطوار میں پلٹنے کی وجہ سے جس میں باپ کا کوئی عمل دخل نہیں ہوتا۔ بلکہ اس کا کام صرف رحم میں پانی ڈالنا ہے، خواہ بنوت کے قصد سے ہو یا بغیر قصد کے۔ اس لیے نسبت دور ہو گئی، اسی لیے نطفہ کبھی مکمل ہوتا ہے اور کبھی نامکمل۔ اور اگر اس میں معاملہ باپ کے ہاتھ میں ہوتا تو وہ ہمیشہ کامل ہوتا۔ کیا تم عیسیٰ علیہ السلام کے پرندے کو اپنے ہاتھ سے پیدا کرنے کی قریبی نسبت کو نہیں دیکھتے، پھر پھونک ماری تو اس کی تخلیق مکمل ہو گئی، پس تخلیق کی نسبت ان کی طرف قریب ہو گئی۔ اور اسی طرح تمام مخلوقات کی صنعتیں ہیں۔\n\nپس بنوت (بیٹا ہونا) ابوت (باپ ہونا) سے تمام امور میں سب سے دور کی نسبت ہے، حالانکہ یہ سب سے صحیح نسبت ہے۔ اور جس نے کہا کہ مسیح ابن اللہ ہے، اس نے صرف اس پر اکتفا کرنے کی وجہ سے کفر نہیں کیا، اور اسی طرح جس نے کہا **نَحْنُ أَبْناءُ الله وأَحِبَّاؤُهُ** (ہم اللہ کے بیٹے اور اس کے پیارے ہیں)، انہوں نے بھی صرف اکتفا کرنے کی وجہ سے کفر نہیں کیا، کیونکہ انہوں نے ایک ایسی نسبت کا ذکر کیا جو اللہ کے سوا ہر چیز کو شامل کرتی ہے، اگر وہ صحیح ہو۔ اور اگر وہ نفس الامر میں صحیح نہیں ہے، تو وہ اور تمام عالم اس میں برابر ہیں۔ اور جب عالم کے اللہ سے پیدا ہونے اور اس کے الوجود (ہستی) کا الٰہی الوجود (ہستی) سے فرع ہونے کا نسبتی معاملہ تھا، تو اس نے اشارہ سمجھنے والے اور عبارت کو تقسیم کرنے والے کے لیے تصریح میں تعریض کے ذریعے تنبیہ کی، اور وہ اس کا یہ قول ہے: **لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً** (اگر اللہ ارادہ کرتا کہ وہ کوئی بیٹا بنائے)۔ پس اس نے اس کو جائز قرار دیا، اور صرف بیٹے کو بنانے کے ارادے کے تعلق کی نفی کی ہے۔ ارادہ صرف معدوم سے متعلق ہوتا ہے، اور معاملہ وجود ہے، لہٰذا ارادے کا کوئی تعلق نہیں۔ کیونکہ مقصود بنوت کا حکم ہے، نہ کہ بیٹے نامی شخص کا عین۔ پھر مکمل کیا، پس فرمایا: **لَاصْطَفى‏ مِمَّا يَخْلُقُ ما يَشاءُ** (تو وہ اپنی مخلوق میں سے جسے چاہتا چن لیتا)۔ پس اس آیت پر اس کے اختتام تک غور کرو۔\n\nاور اسی طرح اس کا یہ فرمان: **لَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا إِنْ كُنَّا فاعِلِينَ** (اگر ہم چاہتے کہ کوئی لہو (کھیل) بنائیں، تو ہم اسے اپنے پاس سے بنا لیتے، اگر ہم ایسا کرنے والے ہوتے)۔ یعنی ہم ایسا کرنے والے نہ ہوتے کہ اسے اپنے غیر سے بناتے۔ کیونکہ ابن مریم کو بیٹا کہا جاتا ہے۔ اور جس نے \"إن\" کو شرطیہ لیا نہ کہ نافیہ، تو **إِنْ كُنَّا فاعِلِينَ** کا معنی یہ ہوگا کہ اگر ہم لہو بناتے، تو اسے اپنے پاس سے بناتے، نہ کہ تمہارے پاس سے۔ کیونکہ **ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ** (جو تمہارے پاس ہے وہ ختم ہو جائے گا اور جو اللہ کے پاس ہے وہ باقی رہے گا)۔ اور **وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنا خَزائِنُهُ** (اور کوئی چیز ایسی نہیں مگر اس کے خزانے ہمارے پاس ہیں)۔ پس جو ہمارے پاس ہے وہ اللہ کے پاس ہے، اور ہم اللہ کے پاس سے ہیں۔ یہ ورد (ہجیر) جلد ہی آئے گا، کیونکہ یہ بعض اقطاب کا حال ہے۔ پس الحق (ذات حق) نے اس چیز کا اعتراف کیا جس کا انکار کیا گیا، اور اسی لیے انکار اعتراف ہوتا ہے کہ مدعی کا دعویٰ باطل ہے۔ پس اس پر قسم لازم آتی ہے جب تک کہ کوئی دلیل قائم نہ ہو۔ اور بیان کے حاصل ہونے کے بعد، ہمیں اس مسئلے میں جو کچھ باقی ہے اسے اجمالاً بیان کرنا ضروری ہے۔ اور وہ یہ ہے کہ جب تسبیح کرنے والا تسبیح کرتا ہے، یعنی اس کے خاص لفظ کے ساتھ جو اس پر دلالت کرتا ہے، تو اسے لازماً کسی نہ کسی ظاہری یا پوشیدہ، مضاف یا مطلق الٰہی نام کے ساتھ مقید کرنا چاہیے۔ اور وہ یہ ہے کہ وہ کہے: سبحان اللہ، یا سبحان الرب، یا العالم۔ یہ اسم ظاہر کا معنی ہے۔ اور اسم مضمر (پوشیدہ) کی مثال اس کا قول ہے: سبحانہ اور سبحانک۔ اور مضاف کی مثال اس کا قول ہے: **سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ** (پاک ہے تیرا رب، عزت کا رب)۔ اور مطلق کی مثال: **سُبْحانَ الله وتَعالى‏ عَمَّا يُشْرِكُونَ** (اللہ پاک ہے اور وہ ان چیزوں سے بہت بلند ہے جنہیں وہ شریک ٹھہراتے ہیں)۔\n\nپس ہم اللہ تعالیٰ کے کسی بھی نام کی تسبیح کریں، اور اسے جس حال سے بھی جوڑیں، اس ذکر کرنے والے کو جو نتیجہ حاصل ہوتا ہے وہ اس نام کے مناسب اور اس حال سے مربوط ہوتا ہے۔ اور اس کی صورت ذکر کرنے والے میں اس خاص مناسبت کے بغیر ظاہر نہیں ہوتی۔ پس اس ذکر میں ہمارے لیے کوئی ایسا امر متعین نہیں جس پر ہم اکتفا کریں، سوائے اس کے جو ہم نے ذکر کیا جس کا حکم عام ہے۔ کیونکہ نتائج مختلف ہوتے ہیں۔ محامد کسی حد پر نہیں رکتے، اور تسبیح کرنے والا اس کی تسبیح صرف اس کی حمد کے ساتھ کرتا ہے۔ اور ہم نے اسماء کی تلاش میں کتاب و سنت کا تتبع کیا، تو ہم نے انہیں اللہ، الرب المضاف (مضاف رب)، الاسم الناقص (ناقص نام)، اور الاسم المضمر (پوشیدہ نام) جیسے ہاء، الملک، اور العلیٰ پر گھومتے ہوئے پایا۔ اللہ کا قول: **فَسُبْحانَ الله حِينَ تُمْسُونَ** (پس اللہ کی تسبیح کرو جب تم شام کرتے ہو)۔ اور الرب کا قول: **سُبْحانَ رَبِّكَ** (پاک ہے تیرا رب)۔ اور الاسم الناقص: **سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ** (پاک ہے وہ ذات جس نے اپنے بندے کو سیر کرائی)۔ اور المضمر کا قول: **سُبْحانَهُ وتَعالى‏** (وہ پاک ہے اور بلند ہے)۔ اور الملک کی مثال وہ ہے جو سنت میں وارد ہوا: **سبحان الملك القدوس** (پاک ہے بادشاہ، قدوس)۔ اور العلیٰ کی مثال جیسا کہ سنت میں وارد ہوا: **سبحان العلي الأعلى** (پاک ہے بلند، اعلیٰ)۔\n\nاور سنت میں بغیر کسی قید کے بھی وارد ہوا ہے، جیسے اس کا قول: **سبوح** (انتہائی پاک)۔ اور یہ مذکور کا ذکر ہے، اور اس کا نتیجہ سب سے عظیم نتائج میں سے ہے، کیونکہ یہ تسبیح کرنے والے کے عین سے کنایہ ہے۔ پس یہاں اس کا نام اس کا عین ہے۔ اور یہ عارفین کی سب سے کامل تسبیح ہے، کیونکہ وہ اس میں نام سے مسمیٰ میں غائب ہو جاتا ہے۔\n\n> پس قوم کے ساتھ چلو، جہاں بھی وہ چلیں،\n> مگر جب تم دیکھو کہ وہ ہلاک ہو گئے ہیں۔\n> اور ان کی ہلاکت یہ ہے کہ تم ان کی شریعت کو دیکھو،\n> کہ جب وہ چلیں تو وہ ان سے الگ تھلگ ہو۔\n> پس انہیں چھوڑ دو، ان کی بات نہ کہو،\n> اللہ کی پیروی کرتے ہوئے جب انہوں نے چھوڑ دیا۔\n\nکیونکہ عقلمندوں کی ایک جماعت نے شریعت کو اپنے گمان میں الگ تھلگ کر دیا، حالانکہ شریعت کبھی بھی الگ تھلگ نہیں ہو سکتی۔ کیونکہ وہ ہر کہنے والے کے قول، ہر عقیدہ رکھنے والے کے عقیدے، اور ہر دلیل کے مدلول کو شامل ہے۔ کیونکہ وہ اللہ کی طرف سے نازل ہوئی ہے جو اس میں کلام کرتا ہے۔ اور ہم نے اس معین گروہ کے بارے میں یہ اس لیے کہا کہ انہوں نے شریعت کو الگ تھلگ کر دیا، باوجود اس کے کہ انہوں نے شریعت کی لائی ہوئی بعض باتوں کو مانا۔ پس انہوں نے شریعت سے صرف وہی لیا جو ان کی نظر کے موافق تھا، اور اس کے علاوہ کو پھینک دیا یا اسے عام لوگوں کے لیے خطاب قرار دیا جو اسے نہیں سمجھتے۔ یہ تب ہے جب انہوں نے یہ جانا اور اعتقاد رکھا کہ یہ اللہ کی طرف سے ہے نہ کہ رسول کے نفس کی طرف سے۔ اور یہ اللہ تعالیٰ کا وہ قول ہے جو اس نے ان کی مذمت کے طور پر فرمایا: **وَيَقُولُونَ نُؤْمِنُ بِبَعْضٍ ونَكْفُرُ بِبَعْضٍ ويُرِيدُونَ أَنْ يَتَّخِذُوا بَيْنَ ذلِكَ سَبِيلًا أُولئِكَ هُمُ الْكافِرُونَ حَقًّا** (اور وہ کہتے ہیں کہ ہم بعض پر ایمان لاتے ہیں اور بعض کا انکار کرتے ہیں، اور وہ چاہتے ہیں کہ اس کے درمیان کوئی راستہ نکالیں، یہی لوگ حقیقی کافر ہیں)۔ اور اللہ تعالیٰ نے فرمایا: **أَ فَتُؤْمِنُونَ بِبَعْضِ الْكِتابِ وتَكْفُرُونَ بِبَعْضٍ** (کیا تم کتاب کے بعض حصے پر ایمان لاتے ہو اور بعض کا انکار کرتے ہو؟)۔\n\nپس یہ میرے اس قول کا معنی ہے کہ انہوں نے شرع کو الگ تھلگ کر دیا، اگرچہ شرع ان کے موقف کے ساتھ آیا تھا۔ لیکن انہوں نے اسے اس لیے نہیں لیا کہ شرع اسے لایا تھا، بلکہ موافقت کی وجہ سے بطور احتجاج کہا۔ اور ہمارا گروہ شریعت سے کسی چیز کو نہیں پھینکتا، بلکہ شرع کے ثابت ہونے کے بعد اپنی نظر اور اپنی عقل کے حکم کو چھوڑ دیتا ہے، اس حکم کے لیے جو شرع ان کے پاس لاتا ہے اور اس کا فیصلہ کرتا ہے۔ پس وہ عالم کے سردار ہیں۔\n\n> بے شک یہ لوگ سردار ہیں،\n> اور مجد کے ساتھ وہ مالک ہیں۔\n> جس راستے پر بھی وہ چلیں، تم ہو جاؤ،\n> ان کے ساتھ جہاں وہ چلتے ہیں۔\n> بے شک قول اسی کی طرف سے ہے: \"ہو جا\"،\n> اس کے لیے جسے وہ ہونا چاہتا ہے۔\n> ہر وہ چیز جو الحق (ذات حق) ان کے فعل سے چاہتا ہے، آسان ہو جاتی ہے۔\n> اور جو وہ نہیں چاہتا، اگرچہ وہ آسان ہو، تو آسان نہیں ہوتا۔\n\n### [الٰہی اسماء کے ساتھ متصف ہونا عالم کو آپس میں جوڑنے کا سبب ہے]\n\nاور جان لو کہ اللہ تعالیٰ نے جب چیزوں کے درمیان مناسبتیں رکھیں تاکہ عالم کو ایک دوسرے سے جوڑ دے، اگر ایسا نہ ہوتا تو وہ آپس میں نہ ملتے اور ان کا الوجود (ہستی) بالکل ظاہر نہ ہوتا۔ اور اس کی اصل وہ مناسبت ہے جو ہمارے اور اس کے درمیان ہے، اگر وہ نہ ہوتی تو ہم موجود نہ ہوتے اور نہ ہی الٰہی اسماء کے ساتھ متصف ہونا قبول کرتے۔ پس اس کی کوئی بھی حضرہ (حضور) ایسی نہیں مگر اس میں ہمارا قدم ہے اور اس تک ہمارا ایک سیدھا راستہ ہے۔ اور میں ان شاء اللہ اس کتاب میں الٰہی اسماء کے باب میں اس کا ذکر کروں گا۔ اور اس باب میں سب سے عظیم الٰہی حضرات یہ ہے کہ کوئی چیز اس کے مشابہ نہیں ہے۔ اور وہاں ہمارے سوا کوئی نہیں ہے۔ اور جس نے تمہاری مشابہت نہ کی، تم نے بھی اس کی مشابہت نہ کی۔ پس جس طرح اس سے مماثلت کی نفی ہوئی، اسی طرح عالم سے بھی مماثلت کی نفی ہوئی، جو کہ مجموعی طور پر اس کے سوا سب کچھ ہے۔ کیونکہ عالم ایک بڑا انسان واحد ہے جس کی کوئی مثال نہیں، یعنی اس کی کوئی مثل نہیں ہے۔ اور اسی لیے وہ ہر وہ چیز ہے جو بغیر کسی مثال کے ایجاد کی گئی ہے۔\n\nپس اہل اللہ یا تو الحق (ذات حق) کو عین عالم قرار دیتے ہیں، تو کوئی چیز اس کی مماثلت نہیں کرتی، کیونکہ وہاں اللہ کے سوا کوئی نہیں ہے، اور عالم اس کے التجلی (ظہور الٰہی) کی صورتیں ہیں، اس کے سوا کچھ نہیں۔ پس وہ اسی کا ہے۔ اور اگر عالم ایک دوسرا الوجود (ہستی) ہے، تو وہاں اللہ اور مسمیٰ عالم کے سوا کوئی نہیں ہے۔ پس اللہ کی کوئی مثل نہیں، مگر یہ کہ کوئی الٰہ ہو، اور اللہ کے سوا کوئی الٰہ نہیں۔ پس اللہ کی کوئی مثل نہیں۔ اور عالم کی کوئی مثل نہیں، مگر یہ کہ کوئی عالم ہو، اور اس عالم (ممکنات) کے سوا کوئی عالم نہیں۔ پس عالم کی کوئی مثل نہیں۔ پس مناسبت دو وجوہ سے صحیح ہوئی: مماثلت کی نفی سے، اور الٰہی اسماء اور حضرات کو قبول کرنے سے۔ اور عالم میں جو کچھ بھی ایک دوسرے سے مماثلت رکھتا ہے، وہ مماثلت کی نفی میں کوئی نقص پیدا نہیں کرتا۔ کیونکہ عالم کی تفصیلات اور اس کے اجزاء جو متماثل، مختلف اور متضاد ہیں، وہ اللہ کے مختلف، متماثل اور متضاد اسماء کی طرح ہیں، جیسے العلیم، العالم، اور العلام، یہ متماثل ہیں۔ اور وہ الضار (نقصان پہنچانے والا) اور النافع (نفع دینے والا) بھی ہے، یہ متضاد ہیں۔ اور وہ العزیز (غالب) اور الحکیم (حکمت والا) بھی ہے، یہ مختلف ہیں۔ اور اس کے باوجود **لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس کی مثل کوئی چیز نہیں ہے)۔ پس یہ آیت اس کے لیے ہے اور ہمارے لیے بھی، \"کاف\" (جیسا) کی وجہ سے، اور اشتراک تناسب کی خبر دیتا ہے۔\n\nاور جب تناسب ضروری ہے، تو ہم نے دیکھا کہ حج اور تسبیح کے درمیان کون سی مناسبت ہے، یہاں تک کہ اللہ تعالیٰ نے اسے اس کے ساتھ تشبیہ دی۔ تو ہم نے کہا کہ تسبیح اس کے قول میں عام ذکر ہے: **وإِنْ من شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ** (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: **إنما شرعت المناسك لإقامة ذكر الله** (مناسک صرف اللہ کے ذکر کو قائم کرنے کے لیے مشروع کیے گئے ہیں)۔\n\nعالم کے اختلاف کی وجہ سے، کیونکہ اللہ کا سارا ذکر اس کی حمد کے ساتھ تسبیح ہے، یعنی اس ثناء کے ساتھ جو اس نے خود اپنی ذات پر کی ہے۔ جیسا کہ اس نے تہلیل (لا إله إلا الله) کو نفیس گردنوں کو آزاد کرنے کے مماثل قرار دیا۔ اور آزادی ایک ایسا امر ہے جو بندے کو عبودیت سے نکالتا ہے، اور وہ عبودیت سے نہیں نکلتا مگر یہ کہ الحق (ذات حق) اس کی سماعت، بصارت اور اس کی تمام قوتیں بن جائے، پس وہ سارا کا سارا حق ہو جائے۔ پس یہ اس کے قول **لا إله إلا الله** کے مناسب ہوا۔ اور گردنوں کی آزادی عبودیت کے ذریعے الوہیت سے بھی ہو سکتی ہے۔ کیونکہ شخص ربوبیت کے ساتھ مقید ہو جاتا ہے، پس وہ اس سے ایسی چیز کا مطالبہ کرتا ہے جو اس کے ہاتھ میں نہیں ہے، بلکہ وہ صرف اللہ کے ہاتھ میں ہے۔ پس وہ حیران ہوتا ہے، تو اللہ اسے اس نسبت سے آزاد کر دیتا ہے، اس چیز کے ذریعے جو اس نے اس میں ظاہر کی، اس کے معتقد کے نزدیک، جبر اور افتقار کی صورت میں، اور ان صفات کو سلب کرنے سے۔ پس وہ اپنی عبودیت میں آزاد ہو گیا، اور ربوبیت میں اس کا کوئی قدم نہ رہا، پس اسے راحت ملی۔ پس یہ بھی ایک شریف آزادی ہے، جہاں اس نے اپنے آپ کو غیر کے تعلق سے آزاد کر لیا، جیسا کہ تہلیل کے ذریعے اللہ کے لیے الوہیت کو بنائے گئے معبودوں کے دعوے کی غلامی سے آزاد کر دیا۔ اور یہ ان کا قول ہے: **أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً** (کیا اس نے تمام معبودوں کو ایک ہی معبود بنا دیا؟) جیسا کہ معاملہ اپنی ذات میں ہے: **إِنَّ هذا لَشَيْءٌ عُجابٌ** (بے شک یہ ایک عجیب بات ہے)۔ پس نبی اکرم صلی اللہ علیہ وسلم نے اپنی نازل شدہ وحی اور اپنے ممثل کشف (الکشف) کے ذریعے تہلیل کو گردنوں کو آزاد کرنے کے مناسب قرار دیا، جیسا کہ اس نے تحمید (الحمد لله) کو اللہ کی راہ میں بوجھ اٹھانے کے مناسب قرار دیا، اور یہ نعمتوں کا باب ہے۔ اور الحمد للہ اس چیز کا شکر ہے جو اس کی طرف سے ہوتی ہے، جیسا کہ اسباب سے مسببات کا شکر ہوتا ہے، اس چیز کے ذریعے جو ہم ان میں ان کے آثار دیکھتے ہیں۔ جیسا کہ فرمایا: **أَنِ اشْكُرْ لِي ولِوالِدَيْكَ وقُلْ رَبِّ ارْحَمْهُما كَما رَبَّيانِي صَغِيراً** (کہ تو میرا اور اپنے والدین کا شکر ادا کر، اور کہہ: اے میرے رب! ان دونوں پر رحم فرما جیسا کہ انہوں نے مجھے بچپن میں پالا)۔ اور ان شاء اللہ الحمد للہ کے ورد (ہجیر) میں وہ آئے گا جو پیاس بجھا دے گا۔\n\nاور اسی طرح جس نے تکبیر (اللہ اکبر) کہی، اس نے تکبیر اور اس کے صاحب کی عظمت کے درمیان مناسبت پیدا کی، بغیر کسی تعین کے۔ اور اس نے اسے کسی معین چیز کے ساتھ نہیں جوڑا، جیسا کہ اس نے تسبیح، تحمید اور تہلیل میں کیا، پس وہاں مقید کیا اور یہاں مطلق رکھا، تاکہ ذکر تقیید اور اطلاق دونوں کو شامل کرے۔ اور اس بارے میں رسول اللہ صلی اللہ علیہ وسلم سے ایک حسن خبر وارد ہوئی ہے کہ جس نے صبح کے وقت سو بار اور شام کے وقت سو بار اللہ کی تسبیح کی، اور یہ اللہ عزوجل کا قول ہے: **وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا** (اور اپنے رب کی حمد کے ساتھ تسبیح کرو سورج نکلنے سے پہلے اور اس کے غروب ہونے سے پہلے) اور اس کا قول: **فَسُبْحانَ الله حِينَ تُمْسُونَ وحِينَ تُصْبِحُونَ** (پس اللہ کی تسبیح کرو جب تم شام کرتے ہو اور جب تم صبح کرتے ہو)۔ اور اسے سو کے ساتھ جوڑا۔\n\nکیونکہ ہمارے لیے جنت یا جہنم کے سوا کوئی ٹھکانہ نہیں ہے۔ اور جنت سو درجے کی ہے۔ پس جس نے اسے سو کے ساتھ مکمل کیا، اس نے ہر درجے سے وافر حصہ حاصل کر لیا، اس ذکر کے مناسبت سے جو ان درجات کے ساتھ ہے۔ اور اسی طرح جہنم کے بھی سو درکات ہیں جو جنت کے درجات کے مقابل ہیں۔ اس ذکر کے ذریعے اسے جہنم کی ہر درک سے تنزیہ حاصل ہوتا ہے، اور جنت کی ہر درجے سے انعام حاصل ہوتا ہے۔ پس یہ جان لو۔ پھر ہم حدیث کو بیان کرنے کی طرف لوٹتے ہیں، جو ہمیں زاہر بن رستم الاصفہانی نے الکروخی سے، انہوں نے تینوں (محمود الازدی، التریانی، اور العورجی) سے، ان سب نے الجراجی سے، انہوں نے المحبوبی سے، انہوں نے ابو عیسیٰ الترمذی سے روایت کی، انہوں نے کہا: ہمیں محمد بن رذین الواسطی نے حدیث بیان کی، انہوں نے ابو سفیان الحموی سے، انہوں نے الضحاک بن حمزہ سے، انہوں نے عمرو بن شعیب سے، انہوں نے اپنے والد سے، انہوں نے اپنے دادا سے، کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: **من سبح الله مائة بالغداة ومائة بالعشي كان كمن حج مائة حجة يعني مقبولة ومن حمد الله مائة بالغداة ومائة بالعشي كان كمن حمل على مائة فرس في سبيل الله أو قال غزا مائة غزوة ومن هلل الله مائة بالغداة ومائة بالعشي كان كمن أعتق مائة رقبة من ولد إسماعيل ومن كبر الله مائة بالغداة ومائة بالعشي لم يأت في ذلك اليوم أحد بأكثر مما أتى إلا من قال مثل ما قال أو زاد على ما قال** (جس نے صبح کے وقت سو بار اور شام کے وقت سو بار اللہ کی تسبیح کی، وہ اس شخص کی طرح تھا جس نے سو حج کیے، یعنی مقبول حج۔ اور جس نے صبح کے وقت سو بار اور شام کے وقت سو بار اللہ کی حمد کی، وہ اس شخص کی طرح تھا جس نے اللہ کی راہ میں سو گھوڑوں پر سوار ہو کر جہاد کیا، یا فرمایا: سو غزوات کیے۔ اور جس نے صبح کے وقت سو بار اور شام کے وقت سو بار اللہ کی تہلیل کی، وہ اس شخص کی طرح تھا جس نے اولاد اسماعیل میں سے سو گردنیں آزاد کیں۔ اور جس نے صبح کے وقت سو بار اور شام کے وقت سو بار اللہ کی تکبیر کہی، تو اس دن کوئی بھی اس سے زیادہ لے کر نہیں آیا، مگر وہ جس نے وہی کہا جو اس نے کہا یا اس سے زیادہ کہا)۔\n\nابو عیسیٰ نے کہا: یہ حدیث حسن غریب ہے۔ اور جب اس کی حمد کے ساتھ تسبیح کرنا قربت ہے، تو صحیح حدیث میں رسول اللہ صلی اللہ علیہ وسلم سے **سبحان اللہ والحمد للہ** کے بارے میں فرمایا کہ یہ دونوں آسمان اور زمین کے درمیان کو بھر دیتے ہیں یا بھر دیتا ہے۔\n\nاور اس سے مراد اس کا قول **سبحان اللہ وبحمده** ہے۔ کیونکہ **الحمد للہ** میزان کو بھر دیتا ہے، کیونکہ یہ آخری چیز ہے جو میزان میں رکھی جائے گی، اسی سے وہ بھر جائے گا۔ جیسا کہ فرمایا: **وآخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ** (اور ان کی آخری پکار یہ ہوگی کہ تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔ پس الحمد للہ کو امور میں تاخیر حاصل ہے، کیونکہ اسے ساقی (پیچھے چلنے والا) حاصل ہے۔ اور **لا إله إلا الله** کو تقدم حاصل ہے۔ اور **سبحان اللہ** کو میسرہ (بائیں بازو) حاصل ہے۔ اور **اللہ اکبر** کو میمنہ (دائیں بازو) حاصل ہے۔ اور قلب کے لیے **لا حول ولا قوة إلا بالله** ہے۔ پس اس نے عبد اور رب کو ثابت کیا۔ پس ہر تسبیح، تحمید، تکبیر اور تہلیل کے لیے اسم \"اللہ\" کا استصحاب (ساتھ رکھنا) اس تسبیح، تہلیل، تحمید اور تکبیر کو قوت عطا کرتا ہے۔ کیونکہ یہ ایک ایسا لفظ ہے جسے اگر مطلق چھوڑ دیا جائے تو اسے اضافت میں غیر اللہ کے ساتھ مقید کیا جا سکتا ہے، اس طرح کہ کوئی شخص کسی ایسے شخص کی تسبیح کرے جو اللہ نہیں ہے، اور اس کی تکبیر کرے، اور اس کی حمد کرے، اور اس کی تہلیل کرے جو الٰہ نہیں ہے، جیسے قوم فرعون۔ پس اس ذکر کو اس کی مثالوں پر کوئی قوت حاصل نہیں مگر اللہ کے ذریعے۔ کیونکہ وہ تم پر کسی ایسی چیز کے ساتھ التجلی (ظہور الٰہی) نہیں کرتا جو اللہ نہ ہو، اور وہ تم سے کہے: **أَنَا الله** (میں اللہ ہوں)، اور تم اسے کہو: **أنت بالله** (تو اللہ کے ذریعے ہے)، مگر وہ اسی وقت معدوم ہو جائے گا، کیونکہ وہ اللہ نہیں تھا۔ اور میں نے اہل اللہ میں سے صرف ایک شخص کو اس مشہد کا مشاہدہ کرتے ہوئے دیکھا، جو قرطبہ کا رہنے والا تھا، مکہ کے حرم میں مؤذن تھا، جسے موسیٰ بن محمد القباب کہا جاتا تھا، وہ ان کے سرداروں میں سے تھا، اور فاس میں ابو الحسن ابن خرازم کا شاگرد تھا۔ پس ثبوت پر کوئی قوت نہیں مگر اللہ کے ذریعے۔ یہاں تک کہ اگر وہ متجلی (ظاہر ہونے والا) اس بات کو الحق (ذات حق) کے کلام کے ساتھ اپنی زبان پر کہے، اور صاحب الکشف (کشف) اسے کہے: **أنت بالله** (تو اللہ کے ذریعے ہے)، تو وہ معدوم نہیں ہوگا اور ثابت رہے گا۔ پس یہ ان نتائج میں سے بعض ہیں جو یہ ذکر پیدا کرتا ہے۔ اور الحمد للہ۔ **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و شصت و ششم در معرفت حال قطبی که ذکر روزانه (هجیره) و منزلش «سبحان الله» بود.\n\nهمانا هستی (الوجود) فطرتش بر تسبیح است،\nپس او منزه از مِثل و تشبیه است.\nسپس در حال دوم آمد تا ما را بیاموزد،\nکه او پروردگار تشبیه و تنزیه است.\nدو نقیض از آنِ اوست، پس او تمامی کائنات است،\nدریابنده این نکته، صاحب فکر و آگاهی است.\n\n### [همانا خداوند ما را در قرآن به تسبیح امر می‌کند]\n\nخداوند عز و جل فرمود: «فَسُبْحانَ الله حِينَ تُمْسُونَ وحِينَ تُصْبِحُونَ» (پس خدا را تسبیح گویید آنگاه که شام می‌کنید و آنگاه که صبح می‌نمایید). امر به تسبیح در قرآن در مواضع بسیاری آمده است و هر موضعی حکمی دارد که دیگری ندارد. گروه‌ها در تسبیح حق (الحق) بر اساس هر آیه‌ای که در قرآن درباره تسبیح آمده است، تقسیم می‌شوند؛ اگر اطاله کلام نبود، آنها را می‌آوردیم و درباره ذاکر به آن سخن می‌گفتیم. (بدان) که این ذکر برای ذاکرش همان چیزی را به بار می‌آورد که ابوالعباس بن العریف صنهاجی در *محاسن المجالس* هنگام ذکر حال عابد، مرید و عارف گفته است: «و حق (الحق) ورای همه آن است، ناگزیر از آن است، اگرچه با همه آن یا عین همه آن باشد.» پس او با همه آن است به فرموده‌اش: «وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ» (و او با شماست هر کجا که باشید) و او عین همه آن است به فرموده تعالی: «سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ أَ ولَمْ يَكْفِ بِرَبِّكَ» (به زودی آیات خود را در آفاق و در نفوسشان به آنان نشان خواهیم داد تا برایشان آشکار شود که او حق است. آیا پروردگارت کافی نیست؟). و او از ورای همه آنچه ذکر شد، محیط است به فرموده‌اش: «والله من وَرائِهِمْ مُحِيطٌ» (و خداوند از ورای آنان احاطه دارد) و به فرموده‌اش: «أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ» (آگاه باشید که او بر هر چیزی احاطه دارد). پس هر کس بخواهد حق (الحق) را در ذکر روزانه‌اش تسبیح کند، باید او را به معنای فرموده‌اش تسبیح کند: «وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ» (و هیچ چیزی نیست مگر آنکه با ستایش او تسبیح می‌گوید)، یعنی با ثنایی که او خود بر خویشتن ستوده است، زیرا جز خداوند آن را اضافه نکرده است. تسبیح هر آنچه غیر ماست این‌گونه است، چرا که ما تسبیح آنها را درک نمی‌کنیم مگر آنکه خداوند ما را آگاه سازد. و این بر خلاف چیزی است که حقیقت تسبیح اقتضا می‌کند، بلکه این تسبیح از تسبیح است، مانند قولشان: «توبه از توبه». زیرا تسبیح، تنزیه است و تنزیه جز از هر نعت حادثی که مخلوق بدان متصف می‌شود، صورت نمی‌گیرد. و هیچ نعتی از جانب خداوند در کتاب و سنت بر ما نازل نشده است مگر آنکه بهره‌ای از مخلوق دارد. و خداوند تعالی آن را حمد خود قرار داده و درباره هر چیزی ذکر کرده است که با حمد او تسبیح می‌گوید، یعنی با ثنایی که از نزد خود نازل کرده است. «وَالْمَلائِكَةُ يَشْهَدُونَ» (و فرشتگان گواهی می‌دهند) و «وَكَفى‏ بِاللَّهِ شَهِيداً» (و خداوند به عنوان گواه کافی است). پس هر کس او را از این ستایش‌ها منزه بداند، او را به حمدش تسبیح نکرده، بلکه او را تکذیب کرده است، و تنها او را به زعم خود با عقل و دلیلش تسبیح کرده است. جمع بین دو امر این است که او را به حمدش تسبیح کنی، و آن تنزیه از تنزیه است، و این عین اشتراک در نسبت است، مانند عدمِ عدم که همان وجود است. و اگر مقصودشان مبالغه در تنزیه باشد، این حمد خدا نیست، بلکه حمد خدا همان است که ذکر کردیم. پس هنگامی که او را به حمدش تسبیح کنی، و آن اقرار به چیزی است که از نزد او وارد شده و او خود را بدان ستوده است، یا چیزی که بر قلب تو نازل کرده و در وجودت برایت آورده و به تو منتقل نشده است؛ و آن تسبیح را مانند صورت قرار ده و قول او: «و حق (الحق) ورای همه آن است» را مانند روحی قرار ده که عین آن برای آن صورت مشاهده نمی‌شود. و برای علم به آن، مشاهده اثرش برای تو کافی است. زیرا می‌دانی که ورای آن صورت، امر دیگری است که روح آن است. همچنین می‌دانی که حق (الحق) ورای هر ثنایی است که تو در آن بهره‌ای (شرب) داری. و محال است که تو در دنیا و آخرت ثنای معینی بر خداوند داشته باشی که در آن بهره‌ای نداشته باشی، زیرا صحیح نیست که او را به چیزی ثنا گویی که آن را تعقل نمی‌کنی. و هرگاه چیزی را تعقل کنی یا بدانی، ناگزیر صفت تو خواهد بود. پس در کائنات، بر اساس آنچه حقایق (الحقائق) اقتضا می‌کنند، تسبیحی که علمای رسوم توهم می‌کنند، صحیح نیست. بلکه تسبیح از تسبیح صحیح است، مادامی که رب و عبدی وجود دارد، و بنده و رب همواره خواهند بود، پس امر همواره چنین است. پس بعد از این تسبیح کن یا تسبیح نکن، تو تسبیح‌کننده‌ای، خواه بخواهی یا نخواهی، و خواه بدانی یا نادان باشی. و اگر امر در ذات خود بر این منوال نبود، صحیح نبود که عین شرک و مشرک در عالم ظاهر شود. و حال آنکه مشرک و شرک در هستی (الوجود) ظاهر شده است، پس ناگزیر باید مستند الهی داشته باشد که این حکم از آن ظاهر شده است. و آن مستند چیزی نیست جز آنچه ذکر کردیم که بنده در هر ستایشی که پروردگارش را بدان تسبیح می‌کند، بهره‌ای دارد. و بالاترین ستایش‌ها، بدون اختلاف عقلی و شرعی، «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست) است. سپس آیه را کامل کرد تا مقصود را بدانیم و ابتدای آیه صحیح باشد، پس فرمود: «وَهُوَ السَّمِيعُ الْبَصِيرُ» (و او شنوای بیناست). اگر کامل نمی‌شد، ابتدای آیه دلالت می‌کرد بر اینکه ما بنده نیستیم و او برای ما خدا نیست. پس ناگزیر باید رابطی وجود داشته باشد و آن جز اشتراک نیست، با این حال او عین اصل در آن است و ما در آن مانند نسبت فرع به اصل و فرزند به والد هستیم. اگرچه فرزند بر صورت والد است، اما عین او نیست، پس به او مرتبط است و جز به او نسبت داده نمی‌شود، زیرا والد بر او ولادت دارد و دیگران از هم‌جنسانش بر او ولادت ندارند، پس گفته نمی‌شود که او پسر اوست. و نسبت ما از جهتی مانند این نسبت است، زیرا هستی (الوجود) از آنِ اوست و مُحدَث از آن بهره برده است. جز اینکه نسبتی که سمع (وحی) با آن وارد شده، نسبت بنده به آقا، مخلوق به خالق، رب به مربوب، مقدور به قادر، و مصنوع به صانع است. زیرا نسبت فرزندی (البنوة) دورترین نسبت‌هاست، به دلیل دگرگونی آن در اطوار مختلف که پدر در آن دخالتی ندارد. بلکه پدر تنها آب را با قصد فرزندی یا بدون قصد در رحم می‌اندازد، پس نسبت دور شد. به همین دلیل نطفه گاهی کامل و گاهی ناقص است. و اگر امر در آن به دست پدر بود، همیشه کامل می‌شد. آیا به نسبت نزدیک در خلق پرنده توسط عیسی (ع) با دستش نمی‌نگری که سپس دمید و خلقش را کامل کرد؟ پس نسبت خلق به او نزدیک شد. و همچنین است مصنوعات همه مخلوقات. پس فرزندی از پدری دورترین نسبت از میان همه امور است، در حالی که صحیح‌ترین نسبت‌هاست. و کسی که گفت مسیح پسر خداست، کافر نشد مگر به دلیل انحصار (اقتصار). و همچنین کسانی که گفتند: «نَحْنُ أَبْناءُ الله وأَحِبَّاؤُهُ» (ما پسران خدا و دوستان او هستیم) کافر شدند به دلیل انحصارشان، زیرا نسبتی را ذکر کردند که اگر صحیح باشد، شامل همه ماسوی الله می‌شود. و اگر در نفس‌الامر صحیح نباشد، آنها و عالم در آن مساوی هستند. و چون امر نسبی در تولد عالم از خدا و اینکه وجود آن فرع وجود الهی است، خداوند به کنایه در قالب تصریح، برای کسی که اشاره را می‌فهمد و عبارت را تقسیم می‌کند، هشدار داد و آن به فرموده‌اش است: «لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً» (اگر خدا می‌خواست فرزندی برگزیند). پس این امر را جایز شمرد. و تنها تعلق اراده به اتخاذ فرزند را نفی کرد. اراده تنها به معدوم تعلق می‌گیرد و امر وجود است، پس اراده به آن تعلق نمی‌گیرد. زیرا مقصود حکم فرزندی است نه عین شخص نامیده شده به فرزند. سپس کامل کرد و فرمود: «لَاصْطَفى‏ مِمَّا يَخْلُقُ ما يَشاءُ» (هر آینه از آنچه می‌آفریند، آنچه را می‌خواست برمی‌گزید). پس در این آیه تا تمام شدنش تدبر کن. و همچنین فرموده تعالی: «لَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ مِنْ لَدُنَّا إِنْ كُنَّا فاعِلِينَ» (اگر می‌خواستیم سرگرمی برگزینیم، آن را از نزد خود برمی‌گزیدیم، اگر انجام‌دهنده بودیم). یعنی ما انجام‌دهنده نبودیم که آن را از غیر خود برگزینیم، زیرا او پسر مریم است که به «پسر» خوانده می‌شود. و کسی که «إن» را شرطیه بگیرد نه نافیه، معنای «إِنْ كُنَّا فاعِلِينَ» این می‌شود که اگر لهوی برگزینیم، آن را از نزد خود برمی‌گزینیم نه از نزد شما. زیرا «ما عِنْدَكُمْ يَنْفَدُ» (آنچه نزد شماست تمام می‌شود) و «وَما عِنْدَ الله باقٍ» (و آنچه نزد خداست باقی است) و «وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنا خَزائِنُهُ» (و هیچ چیزی نیست مگر آنکه خزانه‌های آن نزد ماست). پس آنچه نزد ماست، نزد خداست و ما از نزد خدا هستیم. و این ذکر روزانه (هجیر) خواهد آمد، زیرا حال برخی از اقطاب است. پس حق (الحق) به آنچه انکار شده، اعتراف کرد. و به همین دلیل انکار، اعتراف است به اینکه ادعای مدعی باطل است و بر او سوگند لازم می‌شود مگر آنکه بینه‌ای اقامه شود. و پس از آنکه از بیان آنچه حاصل شد، ناگزیر باید آنچه در مسئله باقی مانده را به اجمال بیان کنیم، و آن این است که تسبیح، هنگامی که تسبیح‌کننده آن را به لفظ خاص خود که بر آن دلالت می‌کند، تسبیح کند، ناگزیر باید آن را به اسمی از اسماء الهی، خواه ظاهر یا مضمر، مضاف یا مطلق، مقید سازد. و آن این است که بگوید: «سبحان الله» یا «سبحان الرب» یا «سبحان العالم». این معنای اسم ظاهر است. و اما اسم مضمر، مانند قول او: «سبحانه» و «سبحانک» است. و اما مضاف، قول اوست: «سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ» (منزه است پروردگارت، پروردگار عزت). و اما مطلق، «سُبْحانَ الله وتَعالى‏ عَمَّا يُشْرِكُونَ» (منزه است خدا و برتر است از آنچه شریک می‌سازند). پس هر اسمی از اسماء الله تعالی را که تسبیح کنیم و به هر حالی که آن را مرتبط سازیم، نتیجه‌ای که برای این ذاکر حاصل می‌شود، مناسب آن اسم و مرتبط با آن حال است و صورت آن در ذاکر ظاهر نمی‌شود مگر با همین مناسبت خاص. پس در این ذکر، امری برای ما معین نمی‌شود که بر آن اکتفا کنیم، مگر آنچه ذکر کردیم که حکمش عام است، زیرا نتایج متفاوت است. ستایش‌ها حد و مرزی ندارند و تسبیح‌کننده او را تسبیح نمی‌کند مگر به حمد او. و ما کتاب و سنت را در طلب اسماء دنبال کردیم و یافتیم که حول «الله»، «رب مضاف»، «اسم ناقص» و «اسم مضمر» مانند ضمیر «هاء»، «ملک» و «علی» می‌چرخند. «الله» در فرموده‌اش: «فَسُبْحانَ الله حِينَ تُمْسُونَ» است. «رب» در فرموده‌اش: «سُبْحانَ رَبِّكَ» است. «اسم ناقص» در «سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ» (منزه است آنکه بنده‌اش را شبانه سیر داد) است. و «مضمر» در فرموده‌اش: «سُبْحانَهُ وتَعالى‏» (منزه است او و برتر است) است. و «ملک» مانند آنچه در سنت وارد شده است: «سبحان الملك القدوس» (منزه است پادشاه قدوس). و «علی» چنانکه در سنت وارد شده است: «سبحان العلي الأعلى» (منزه است والای برتر). و در سنت بدون تقیید نیز وارد شده است، مانند قول او: «سبوح». و این ذکرِ مذکور است و نتیجه‌اش بزرگترین نتایج است، زیرا کنایه از عین تسبیح‌کننده با تسبیح است. پس اسم او در اینجا عین اوست. و این کامل‌ترین تسبیح عارفان است، زیرا در آن از اسم به مسمی غایب شده است.\n\nپس با قوم سلوک کن، هر راهی که رفتند،\nمگر آنکه ببینی که هلاک شدند.\nو هلاکتشان این است که شریعتشان را،\nهنگام سلوک، جدا از خود ببینند.\nپس رهایشان کن و سخنشان را مگو،\nبه تأسی از اله (خداوند) آنگاه که رهایشان کرد.\n\nزیرا گروهی از خردمندان، شریعت را به زعم خود جدا (بمعزل) قرار دادند، در حالی که شریعت هرگز جدا نیست، زیرا شامل قول هر گوینده، اعتقاد هر معتقد و مدلول هر دلیلی می‌شود، چرا که از جانب خداوند متکلم در آن نازل شده است. و ما درباره این گروه خاص گفتیم که شریعت را جدا قرار دادند، با وجود اینکه به برخی از آنچه شریعت آورده بود، قائل بودند. پس از شریعت جز آنچه موافق نظرشان بود، نگرفتند و مابقی را دور انداختند یا آن را خطاب به عوام که درک نمی‌کنند، قرار دادند. این در صورتی است که بدانی و اعتقاد داشته باشی که آن از نزد خداست نه از نفس رسول. و این فرموده تعالی است که درباره آنان به طریق مذمت فرمود: «وَيَقُولُونَ نُؤْمِنُ بِبَعْضٍ ونَكْفُرُ بِبَعْضٍ ويُرِيدُونَ أَنْ يَتَّخِذُوا بَيْنَ ذلِكَ سَبِيلًا أُولئِكَ هُمُ الْكافِرُونَ حَقًّا» (و می‌گویند: به برخی ایمان می‌آوریم و به برخی کفر می‌ورزیم و می‌خواهند میان آن راهی برگزینند. آنان کافران حقیقی هستند). و تعالی فرمود: «أَ فَتُؤْمِنُونَ بِبَعْضِ الْكِتابِ وتَكْفُرُونَ بِبَعْضٍ» (آیا به بخشی از کتاب ایمان می‌آورید و به بخشی کفر می‌ورزید؟). این معنای سخن من است که آنان شرع را جدا قرار دادند، اگرچه شرع با آنچه آنان بر آن هستند، آمده است. اما آنچه را گرفتند، به دلیل آن نگرفتند که شرع آن را آورده است، بلکه به دلیل موافقت، به آن قائل شدند و احتجاج کردند. اما طایفه ما چیزی از شریعت را دور نمی‌اندازد، بلکه نظر و حکم عقل خود را پس از ثبوت شرع، برای حکم آنچه شرع برایشان می‌آورد و بدان حکم می‌کند، رها می‌سازد. پس آنان سروران عالم هستند.\n\nهمانا این قوم سرورانی هستند،\nو با مجد و بزرگی فرمان می‌رانند.\nهر راهی که می‌روند، تو باش،\nبا آنان هر جا که سلوک می‌کنند.\nهمانا قول از اوست: «کُن» (باش)،\nبرای آنچه خواست که باشد.\nهر چیزی که حق (الحق) از فعل آنان بخواهد، آسان می‌شود،\nو آنچه را نخواهد،\nاگرچه آسان باشد، آسان نمی‌شود.\n\n### [تخلق به اسماء الهی سبب پیوند عالم به یکدیگر است]\n\nو بدان که خداوند تعالی چون میان اشیاء مناسبت‌هایی قرار داد تا عالم را به یکدیگر پیوند دهد، اگر این مناسبت نبود، عالم به هم نمی‌آمد و اصلاً وجودی برایش ظاهر نمی‌شد. و اصل این، مناسبتی است که میان ما و او تعالی وجود دارد؛ اگر آن نبود، ما وجود نمی‌یافتیم و تخلق به اسماء الهی را نمی‌پذیرفتیم. پس هیچ حظیره‌ای (حضرة) برای او تعالی نیست مگر آنکه ما در آن قدمی داریم و راهی گسترده به سوی آن داریم. و این را ان‌شاءالله در باب اسماء الهی این کتاب خواهم آورد. و بزرگترین حظیره‌های الهی در این باب این است که هیچ چیزی شبیه او نیست، و در آنجا جز ما نیست. و کسی که شبیه تو نباشد، تو نیز شبیه او نیستی. پس همان‌گونه که مثلیت از او منتفی شد، مثلیت از عالم نیز منتفی شد، و عالم مجموعاً همه ماسوای اوست. زیرا عالم یک انسان واحد بزرگ است که مماثل ندارد، یعنی مِثلی برایش نیست. و به همین دلیل، او کلی است که بدون مثال ابداع شده است. پس اهل الله از دو حال خارج نیستند: یا حق (الحق) را عین عالم می‌دانند، پس چیزی شبیه او نیست، زیرا در آنجا جز خدا نیست و عالم صور تجلی (التجلی) اوست و غیر او نیست، پس عالم از آنِ اوست. و اگر عالم وجودی دیگر باشد، پس در آنجا جز خدا و مسمای عالم نیست. پس مِثلی برای خدا نیست مگر آنکه الهی باشد، و «لا إله إلا الله» (هیچ معبودی جز الله نیست)، پس مِثلی برای خدا نیست. و مِثلی برای عالم نیست مگر آنکه عالمی باشد، و عالمی جز این عالم که همان ممکنات است، نیست. پس مِثلی برای عالم نیست. بنابراین، مناسبت از دو جهت صحیح است: از جهت نفی مثلیت و از جهت پذیرش اسماء و حظیره‌های الهی. و هر مماثلتی که در عالم میان اجزاء آن وجود دارد، به نفی مماثلت خدشه وارد نمی‌کند. زیرا جزئیات و اجزای عالم که متماثل، مختلف و متضاد هستند، مانند اسماء مختلف، متماثل و متضاد خداوند هستند؛ مانند علیم، عالم و علّام که متماثل‌اند، و همچنین ضار و نافع که متضادند، و عزیز و حکیم که مختلف‌اند. با این حال، «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست). این آیه هم برای اوست و هم برای ما، به دلیل حرف «کاف» (در کمثله) و اشتراک که دلالت بر تناسب دارد. و چون تناسب ناگزیر است، نگریستیم که چه مناسبتی میان حج و تسبیح وجود دارد که خداوند آن را به حج تشبیه کرده است؟ گفتیم: تسبیح همان ذکر عام است در فرموده‌اش: «وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ» (و هیچ چیزی نیست مگر آنکه با ستایش او تسبیح می‌گوید). و پیامبر (صلی الله علیه و سلم) فرمود: «همانا مناسک برای برپایی ذکر خدا تشریع شده است» به دلیل اختلاف عالم، زیرا ذکر خدا تماماً تسبیح به حمد اوست، یعنی به آنچه خود را بدان ستوده است. همان‌گونه که تهلیل (لا إله إلا الله) را مماثل آزاد کردن بردگان نفیس قرار داد. و آزاد کردن، امری است که بنده را از بندگی خارج می‌کند، و از بندگی خارج نمی‌شود مگر آنکه حق (الحق) گوش و چشم و همه قوای او باشد، پس تماماً حق (الحق) شود. پس با قول «لا إله إلا الله» مناسبت یافت. و گاهی آزاد کردن بردگان از الوهیت به واسطه عبودیت است. زیرا شخص به ربوبیت مقید می‌شود و از آن چیزی را می‌طلبد که هیچ چیز از آن در دست او نیست، بلکه آن تنها به دست خداست. پس حیران می‌شود و خداوند او را از این نسبت به خود آزاد می‌کند، به واسطه آنچه در نزد معتقد به آن، از جبر و افتقار و سلب این اوصاف در او ظاهر می‌سازد. پس در عبودیت خود آزاد باز می‌گردد و در ربوبیت قدمی ندارد و آسوده می‌شود. این نیز آزادی شریفی است، زیرا خود را از تعلق غیر به خویش رها ساخته است، همان‌گونه که با تهلیل، الوهیت را برای خدا از قید ادعای خدایان ساختگی رها ساخت. و آن قولشان است: «أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً» (آیا خدایان را یک خدا قرار داده است؟) چنانکه امر در نفس خود چنین است: «إِنَّ هذا لَشَيْءٌ عُجابٌ» (همانا این چیزی شگفت‌انگیز است). پس پیامبر (صلی الله علیه و سلم) با وحی نازل شده و کشف (الکشف) متمثل خود، تهلیل را مناسب آزاد کردن بردگان قرار داد، همان‌گونه که تحمید (الحمد لله) را مناسب حمل در راه خدا قرار داد، و آن باب نعمت‌هاست. و «الحمد لله» (ستایش از آن خداست) شکر برای چیزی است که از او صادر می‌شود، همان‌گونه که از اسباب برای مسببات شکر است، به واسطه آنچه از آثارشان در آنها می‌بینیم، چنانکه فرمود: «أَنِ اشْكُرْ لِي ولِوالِدَيْكَ وقُلْ رَبِّ ارْحَمْهُما كَما رَبَّيانِي صَغِيراً» (مرا و پدر و مادرت را شکر کن و بگو: پروردگارا، بر آن دو رحمت آور، همان‌گونه که مرا در کودکی تربیت کردند). و ان‌شاءالله در ذکر روزانه (هجیر) «الحمد لله» آنچه تشفی‌بخش است، خواهد آمد. و همچنین کسی که تکبیر (الله اکبر) گفت، میان تکبیر و عظمت آنچه برای صاحبش است، بدون تعیین، مناسبت برقرار کرد و آن را به چیز معینی قرین نساخت، مانند آنچه در تسبیح و تحمید و تهلیل انجام داد. پس در آنجا مقید کرد و در اینجا مطلق گذاشت تا ذکر، تقیید و اطلاق را شامل شود. و در این باره خبر حسن از رسول خدا (صلی الله علیه و سلم) وارد شده است که هر کس صد بار صبح و صد بار شام خدا را تسبیح گوید، و این همان فرموده عز و جل است: «وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وقَبْلَ غُرُوبِها» (و پروردگارت را پیش از طلوع خورشید و پیش از غروب آن با ستایش تسبیح گوی) و فرموده‌اش: «فَسُبْحانَ الله حِينَ تُمْسُونَ وحِينَ تُصْبِحُونَ» (پس خدا را تسبیح گویید آنگاه که شام می‌کنید و آنگاه که صبح می‌نمایید). و این را به عدد صد قرین ساخت، زیرا ما را جز بهشت یا دوزخ، سرایی برای سکونت نیست، و بهشت صد درجه دارد. پس هر کس آن را صد بار کامل کند، بهره‌ای وافر از هر درجه به حسب ذکرش که مناسب آن درجات است، به دست آورده است. و همچنین درکات دوزخ صد درک است که مقابل درجات بهشت است. برای او از جانب دوزخ با این ذکر، تنزیه از هر درک و از جانب بهشت، نعمت از هر درجه است. پس این را بدان. سپس به نقل حدیث باز می‌گردیم، و آن چیزی است که زاهر بن رستم اصفهانی از کرّوخی، از سه نفر: محمود ازدی، تریاقی و عورجی، و همه آنها از جراجی، از محبوبی، از ابوعیسی ترمذی برای ما روایت کرد. او گفت: محمد بن رزین واسطی برای ما روایت کرد، او گفت: ابوسفیان حموی از ضحاک بن حمزه، از عمرو بن شعیب، از پدرش، از جدش روایت کرد که رسول خدا (صلی الله علیه و سلم) فرمود: «هر کس صد بار صبح و صد بار شام خدا را تسبیح گوید، مانند کسی است که صد حج، یعنی مقبول، انجام داده است. و هر کس صد بار صبح و صد بار شام خدا را حمد گوید، مانند کسی است که صد اسب در راه خدا تجهیز کرده است، یا فرمود: صد غزوه کرده است. و هر کس صد بار صبح و صد بار شام خدا را تهلیل گوید، مانند کسی است که صد بنده از فرزندان اسماعیل را آزاد کرده است. و هر کس صد بار صبح و صد بار شام خدا را تکبیر گوید، در آن روز هیچ کس عملی بیشتر از او نیاورده است، مگر کسی که مانند او گفته یا بر آن افزوده باشد.» ابوعیسی گفت: این حدیثی حسن و غریب است. و چون تسبیح به حمد او، تقرب به اوست، در صحیح از رسول خدا (صلی الله علیه و سلم) درباره «سبحان الله والحمد لله» فرمود که آن دو، یا آن، آنچه میان آسمان و زمین است را پر می‌کنند. و مقصودش قول «سبحان الله وبحمده» است، زیرا «الحمد لله» (ستایش از آن خداست) میزان را پر می‌کند، چرا که آخرین چیزی است که در میزان قرار داده می‌شود و با آن پر می‌گردد، چنانکه فرمود: «وآخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (و آخرین دعایشان این است که ستایش از آنِ خداوند، پروردگار جهانیان است). پس «الحمد لله» در امور تأخیر دارد، زیرا ساقه (عقب‌دار) از آن اوست. و «لا إله إلا الله» (هیچ معبودی جز الله نیست) تقدم دارد. و «سبحان الله» میسره (سمت چپ) و «الله اکبر» (خدا بزرگتر است) میمنه (سمت راست) را دارد. و قلب از آنِ «لا حول ولا قوة إلا بالله» (هیچ نیرو و قوتی جز به خدا نیست) است. پس بنده و رب را اثبات کرد. همراهی اسم «الله» با هر تسبیح، تحمید، تکبیر و تهلیلی، همان است که به آن تسبیح یا تهلیل یا تحمید و تکبیر قوت می‌بخشد. زیرا این لفظی است که اگر مطلق شود، می‌تواند مطلق باشد و در اضافه به غیر خدا مقید شود، به این صورت که شخصی را که خدا نیست تسبیح کند و او را تکبیر و تحمید کند و آنچه را که اله نیست، تهلیل گوید، مانند قوم فرعون. پس این ذکر بر امثال آن، قوتی ندارد مگر به واسطه «الله». زیرا هیچ چیزی که خدا نیست بر تو تجلی (التجلی) نمی‌کند که به تو بگوید: «أَنَا الله» (من خدا هستم) و تو به او بگویی: «تو به واسطه الله هستی»، مگر آنکه در همان لحظه معدوم شود، زیرا او خدا نبوده است. و من از رجال الله که شاهد این مشهد بوده‌اند، جز یک مرد از اهل قرطبه را ندیدم که مؤذن حرم مکی بود و به او موسی بن محمد قباب می‌گفتند. او از سروران آنان بود و شاگرد ابوالحسن بن خرازم در فاس بود. پس هیچ قوتی بر ثبوت نیست مگر به واسطه الله، حتی اگر آن متجلی آن را با کلام حق بر زبان آورد و صاحب کشف (الکشف) به او بگوید: «تو به واسطه الله هستی»، معدوم نمی‌شود و ثابت می‌ماند. این برخی از نتایج این ذکر است. و الحمد لله. «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}