{
  "id": 127,
  "title": {
    "ar": "الباب السابع والعشرون ومائة في ترك المراقبة",
    "en": "Chapter One Hundred and Twenty-Seven: Concerning the Abandoning of Spiritual Vigilance (ترك المراقبة)",
    "ur": "خاموشی سے سوچنا:\n۱.  **اصل عربی متن کا تجزیہ:** \"الباب السابع والعشرون ومائة في ترك المراقبة\"\n۲.  **اجزاء کی شناخت اور ترجمہ:**\n    *   \"الباب\": باب\n    *   \"السابع والعشرون ومائة\": ایک سو ستائیسواں (۱۰۰ + ۲۷ = ۱۲۷)\n    *   \"في\": میں/کے بارے میں\n    *   \"ترك\": چھوڑنا، ترک کرنا\n    *   \"المراقبة\": مراقبہ (صوفیانہ اصطلاح، اللہ کی مسلسل نگرانی کا احساس)\n۳.  **صوفیانہ اصطلاح کی جانچ:** \"المراقبة\" ایک کلیدی صوفیانہ اصطلاح ہے، اسے اردو میں بھی \"مراقبہ\" ہی لکھا جائے گا، لیکن چونکہ یہ عنوان ہے، اس لیے اسے قوسین میں محفوظ کرنے کی ضرورت نہیں ہے جب تک کہ یہ متن کے اندر نہ ہو۔\n۴.  **عنوان کی تشکیل:** باب ایک سو ستائیسواں: مراقبہ ترک کرنے کے بارے میں۔\n۵.  **حتمی اردو ترجمہ:** باب ایک سو ستائیسواں: مراقبہ ترک کرنے کے بیان میں۔ (یا: باب ۱۲۷: مراقبہ ترک کرنے کے بارے میں)\n\n**حتمی آؤٹ پٹ کی تیاری (صرف ترجمہ):** باب ایک سو ستائیسواں: مراقبہ ترک کرنے کے بیان میں۔",
    "fa": "باب صد و بیست و هفتم در ترک مراقبه"
  },
  "content": {
    "ar": "## (الباب السابع والعشرون ومائة في ترك المراقبة)\n\n\n> لا تراقب فليس في الكون إلا *** واحد العين وهو عين الوجود\n\n\n> فتسمى في حالة بمليك *** وتكني في حالة بالعبيد\n\n\n> ودليلي ما جاء من افتقار *** الفقراء إلى الغني الحميد\n\n\n> هكذا جاء في التلاوة نصا *** في قريب من سعده وبعيد\n\n\n> ثم جاءوا ب أَقْرِضُوا الله قَرْضاً *** فبدا النقص وهو عين المزيد\n\n\n### [المقولات العشر ترجع إلى اثنتين انفعال محقق وفاعل معين‏]\n\n\nلما كانت المراقبة تنزلا مثاليا للتقريب واقتضت مرتبة العلماء بالله أنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فارتفعت الأشكال والأمثال ولم يتقيد أمر إلا له ولا انضبط وجهل الأمر وتبين أنه لم يكن معلوما في وقت الاعتقاد بأنه كان معلوما لنا ولم يحصل في العلم به أمر ثبوتي بل سلب محقق ونسبة معقولة أعطتها الآثار الموجودة في الأعيان فلا كيف ولا أين ولا متى ولا وضع ولا إضافة ولا عرض ولا جوهر ولا كم وهو المقدار وما بقي من العشرة إلا انفعال محقق وفاعل معين أو فعل ظاهر من فاعل مجهول يرى أثره ولا يعرف خبره ولا يعلم عينه ولا يجهل كونه فلمن نراقب وما ثم من يقع عليه عين ولا من يضبطه خيال ولا من يحدده زمان ولا من تعدده صفات وأحكام ولا من تكسيفه أحوال ولا من تميزه أوضاع ولا من تظهره إضافة فكيف نراقب من لا يقبل الصفات والعلم يرفع الخيال فهو الرقيب لا المراقب وهو الحفيظ لا المحفوظ فالذي يحفظه الإنسان إنما\nهو اعتقاده في قلبه فذلك الذي وسعه من ربه‏\n\n\n### [أنت ما عبدت على الحقيقة سوى ما نصبه في نفسك‏]\n\n\nفإن راقبت فاعلم من راقبت فما زلت عنك ولا عرفت سوى ذاتك فالحادث لا يتعلق إلا بالمناسب وهو ما عندك منه وما عندك حادث فما برحت من جنسك وما عبدت على الحقيقة سوى ما نصبته في نفسك ولهذا اختلفت المقالات في الله وتغيرت الأحوال فطائفة تقول هو كذا وطائفة تقول ما هو كذا بل هو كذا وطائفة قالت في العلم به لون الماء لون إنائه فهذا مؤثر بالدليل مؤثر فيه عند صاحب هذا القول في رأى العين فانظر إلى الحيرة سارية في كل معتقد\n\n\n### [الكامل من عظمت حيرته ودامت حسرته‏]\n\n\nفالكامل من عظمت حيرته ودامت حسرته ولم ينل مقصوده لما كان معبوده وذلك أنه رام تحصيل ما لا يمكن تحصيله وسلك سبيل من لا يعرف سبيله والأكمل من الكامل من اعتقد فيه كل اعتقاد وعرفه في الايمان والدلائل وفي الإلحاد فإن الإلحاد ميل إلى اعتقاد معين من اعتقاد فاشهدوه بكل عين إن أردتم إصابة العين فإنه عام التجلي له في كل صورة وجه وفي كل عالم حال فراقب إن شئت أو لا تراقب فما ثم إلا مثاب ومثيب ومعاقب ومعاقب انتهى الجزء الموفي مائة\n\n\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "## Chapter 127: On Abandoning Contemplation (ترك المراقبة)\n\n> Do not contemplate, for there is nothing in the Cosmos (الكون) except\n> The One Essence (واحد العين), and He is the very Essence of Existence (عين الوجود).\n>\n> So He is named in one state as the Sovereign (مليك),\n> And He is designated in another state as the Servant (العبيد).\n>\n> And my proof is what came concerning the need (افتقار)\n> Of the poor ones (الفقراء) for the Praiseworthy Rich One (الغني الحميد).\n>\n> Thus it came explicitly in the Recitation,\n> Regarding one near to His felicity and one far.\n>\n> Then they came with <<أَقْرِضُوا الله قَرْضاً>> (Lend unto Allah a goodly loan),\n> So the deficiency appeared, yet it is the very Essence of the increase (المزيد).\n\n### [The Ten Categories Return to Two: A Verified Passivity and a Determined Agent]\n\nSince Contemplation (المراقبة) is an imaginal descent (تنزلا مثاليا) for the sake of approximation, and the rank of the Gnostics of Allah (العلماء بالله) necessitated that <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), then forms and similitudes were removed. No matter was restricted except to Him, nor was it contained. The matter became unknown, and it became clear that it was not known to us at the time of belief (اعتقاد) that it was known to us.\n\nNo affirmative matter (أمر ثبوتي) was attained in the knowledge of Him, but rather a verified negation (سلب محقق) and an intelligible relation (نسبة معقولة) given by the effects (الآثار) existing in the Fixed Entities (الأعيان). Thus, there is no Quality (كيف), no Where (أين), no When (متى), no Position (وضع), no Relation (إضافة), no Accident (عرض), no Substance (جوهر), and no Quantity (كم), which is the measure.\n\nNothing remains of the ten categories except a verified passivity (انفعال محقق) and a determined agent (فاعل معين), or an act apparent from an unknown agent whose effect is seen, but whose report is not known, whose Essence (عينه) is not known, yet whose Being (كونه) is not unknown.\n\nSo whom shall we contemplate, when there is none upon whom the eye falls, nor whom the Imagination (خيال) can contain, nor whom time can limit, nor whom attributes and rulings can multiply, nor whom states can obscure, nor whom positions can distinguish, nor whom relation can manifest? How can we contemplate Him who does not accept attributes, when Knowledge (العلم) removes the Imagination?\n\nHe is the Watcher (الرقيب), not the Contemplator (المراقب); He is the Preserver (الحفيظ), not the Preserved (المحفوظ). For that which the human preserves is only his belief (اعتقاده) in his heart, and that is what contained his Lord.\n\n### [You Have Not Truly Worshipped Except What You Have Set Up Within Yourself]\n\nIf you contemplate, then know whom you contemplate, for you have not departed from yourself, nor have you known anything other than your own Essence (ذاتك). For the contingent (الحادث) relates only to what is appropriate to it, which is what you possess of Him, and what you possess is contingent. Thus, you have not left your own kind.\n\nYou have not truly worshipped (على الحقيقة) except what you have set up within yourself. This is why the sayings concerning Allah have differed and the spiritual states (الأحوال) have changed. One group says He is such-and-such, and another group says He is not such-and-such, but rather He is thus. And a group said concerning the knowledge of Him: 'The color of the water is the color of its vessel.' This is an effecter by means of the proof, and it is affected by it, according to the proponent of this saying, in plain sight. So look at the perplexity (الحيرة) flowing through every believer.\n\n### [The Perfect One is He Whose Perplexity is Great and Whose Regret is Continuous]\n\nThe Perfect One (الكامل) is he whose perplexity (حيرته) is great and whose regret/longing (حسرته) is continuous, and he did not attain his goal because of what his object of worship was. That is because he sought to attain what cannot be attained, and he traveled the path of Him whose path is unknown.\n\nAnd the Most Perfect of the Perfect Ones (الأكمل من الكامل) is he who holds every belief concerning Him, and knows Him in faith, in proofs, and in deviation/atheism (الإلحاد). For deviation is merely an inclination toward a specific belief among all beliefs.\n\nSo witness Him with every eye if you desire to hit the mark of the Essence (إصابة العين), for His Theophany (التجلي) is universal for Him in every form of face and in every world of state.\n\nSo contemplate if you wish, or do not contemplate, for there is nothing there except the rewarded and the rewarder, and the punished and the punisher.\n\nEnd of the Part Completing One Hundred.\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)",
    "ur": "## (باب ایک سو ستائیس: مراقبت (المراقبة) کو ترک کرنے کے بیان میں)\n\nمراقبت نہ کر، کیونکہ کائنات میں نہیں ہے مگر\nایک ہی ذات (واحد العین) اور وہی ہستی (الوجود) کی عین حقیقت ہے۔\n\nپس وہ ایک حالت میں بادشاہ (ملیک) کہلاتا ہے\nاور ایک حالت میں بندہ (عبید) سے کنایہ کیا جاتا ہے۔\n\nاور میری دلیل وہ ہے جو فقیروں کے غنی حمید کی طرف\nمحتاج ہونے کے بارے میں آئی ہے۔\n\nاسی طرح یہ تلاوت (قرآن) میں صریحاً آیا ہے،\nاس شخص کے بارے میں جو اس کی سعادت کے قریب ہے اور جو دور ہے۔\n\nپھر وہ اس آیت کے ساتھ آئے: \"اللہ کو قرض حسنہ دو\" (أَقْرِضُوا الله قَرْضاً)،\nتو کمی ظاہر ہوئی، حالانکہ وہ عین زیادتی ہے۔\n\n### [دس مقولات (اقسام) دو چیزوں کی طرف لوٹتے ہیں: ایک محقق انفعال (حقیقی اثر پذیری) اور ایک معین فاعل (متعین عمل کرنے والا)]\n\nچونکہ مراقبت (المراقبة) قربت کے لیے ایک مثالی تنزل ہے، اور اللہ کے علماء کا مرتبہ اس بات کا متقاضی ہے کہ \"اس کی مثل کوئی چیز نہیں\" (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)، لہٰذا اشکال اور امثال اٹھ گئیں۔ اور کوئی امر اس کے لیے مقید نہیں ہوا اور نہ ہی وہ منضبط ہوا۔ اور امر مجہول ہو گیا اور یہ واضح ہو گیا کہ وہ اعتقاد کے وقت معلوم نہیں تھا کہ وہ ہمارے لیے معلوم تھا۔ اور اس کے علم میں کوئی ثبوتی امر حاصل نہیں ہوا، بلکہ صرف محقق سلب (نفی) اور ایک معقول نسبت جو اعیان (موجودات) میں موجود آثار نے عطا کی۔\n\nپس نہ کیفیت (کیف)، نہ جگہ (أین)، نہ وقت (متی)، نہ وضع، نہ اضافہ، نہ عرض، نہ جوہر، اور نہ ہی کم (مقدار) ہے۔ اور دس مقولات میں سے باقی نہیں رہا مگر محقق انفعال (حقیقی اثر پذیری) اور معین فاعل (متعین عمل کرنے والا)۔ یا ایک ایسا فعل جو ایک مجہول فاعل سے ظاہر ہو جس کا اثر دیکھا جائے، مگر اس کی خبر معلوم نہ ہو، نہ اس کی ذات (عین) معلوم ہو، اور نہ ہی اس کا وجود (کون) مجہول ہو۔\n\nتو ہم کس کی مراقبت کریں؟ جبکہ وہاں کوئی نہیں جس پر آنکھ پڑے، نہ کوئی جسے خیال قابو کر سکے، نہ کوئی جسے زمانہ محدود کر سکے، نہ کوئی جسے صفات اور احکام متعدد کر سکیں، نہ کوئی جسے احوال کثیف کر سکیں، نہ کوئی جسے اوضاع ممتاز کر سکیں، اور نہ کوئی جسے نسبت ظاہر کرے۔ تو ہم اس کی مراقبت کیسے کریں جو صفات کو قبول نہیں کرتا؟\n\nاور علم خیال کو اٹھا دیتا ہے۔ پس وہی نگران (الرقیب) ہے نہ کہ مراقبت کرنے والا (المراقب)، اور وہی محافظ (الحفیظ) ہے نہ کہ محفوظ (المحفوظ)۔ پس جو چیز انسان محفوظ رکھتا ہے، وہ درحقیقت اس کا اپنے دل میں موجود اعتقاد ہے۔ پس یہی وہ چیز ہے جو اس کے رب کی طرف سے اس کے لیے وسیع ہوئی۔\n\n### [تم نے حقیقت میں صرف اسی کی عبادت کی جسے تم نے اپنے نفس میں نصب کیا]\n\nپس اگر تم مراقبت کرو، تو جان لو کہ تم کس کی مراقبت کر رہے ہو۔ تم اپنے آپ سے دور نہیں ہوئے اور نہ ہی تم نے اپنی ذات کے سوا کسی کو پہچانا۔ کیونکہ حادث (مخلوق) صرف مناسب چیز سے ہی متعلق ہوتا ہے، اور وہ وہی ہے جو تمہارے پاس اس کی طرف سے ہے، اور جو تمہارے پاس ہے وہ حادث ہے، لہٰذا تم اپنی جنس سے باہر نہیں نکلے۔\n\nاور تم نے حقیقت میں صرف اسی کی عبادت کی جسے تم نے اپنے نفس میں نصب کیا۔ اور اسی وجہ سے اللہ کے بارے میں اقوال مختلف ہوئے اور احوال بدل گئے۔ ایک گروہ کہتا ہے کہ وہ ایسا ہے، اور دوسرا گروہ کہتا ہے کہ وہ ایسا نہیں، بلکہ وہ ایسا ہے۔ اور ایک گروہ نے اس کے علم کے بارے میں کہا کہ پانی کا رنگ اس کے برتن کا رنگ ہے۔ پس یہ دلیل کے ذریعے مؤثر ہے، اور اس قول کے قائل کے نزدیک بظاہر اس میں مؤثر ہے۔ پس دیکھو کہ حیرت ہر معتقد میں سرایت کیے ہوئے ہے۔\n\n### [کامل وہ ہے جس کی حیرت عظیم ہو اور حسرت دائمی ہو]\n\nپس کامل وہ ہے جس کی حیرت عظیم ہو اور اس کی حسرت دائمی ہو، اور اس نے اپنا مقصود حاصل نہ کیا کیونکہ وہ اس کا معبود تھا۔ اور یہ اس لیے کہ اس نے ایسی چیز حاصل کرنے کا ارادہ کیا جس کا حصول ممکن نہیں، اور اس نے ایسے شخص کی راہ اختیار کی جس کی راہ معلوم نہیں۔\n\nاور کامل سے اکمل وہ ہے جس نے اس میں ہر اعتقاد رکھا اور اسے ایمان، دلائل اور الحاد میں بھی پہچانا۔ کیونکہ الحاد (انکار) بھی ایک اعتقاد سے ایک معین اعتقاد کی طرف میلان ہے۔ پس اگر تم عین (حقیقت) کو پانا چاہتے ہو تو اسے ہر آنکھ سے دیکھو (شہود)۔ کیونکہ اس کا ظہور (التجلی) ہر صورت میں عام ہے، اور ہر عالم میں اس کا ایک حال ہے۔\n\nپس اگر تم چاہو تو مراقبت کرو یا نہ کرو، کیونکہ وہاں نہیں ہے مگر ثواب دینے والا اور ثواب پانے والا، اور سزا دینے والا اور سزا پانے والا۔ سوواں حصہ مکمل ہوا۔\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "باب صد و بیست و هفتم در ترک مراقبه\n\nمراقبت مکن، زیرا در کائنات نیست *** جز یگانه‌ای که عین (ذات) هستی (الوجود) است.\nپس در حالتی به «پادشاه» نامیده می‌شود *** و در حالتی به «بنده» کنیه می‌یابد.\nو دلیل من آن است که از نیازمندی *** فقیران (الفقراء) به بی‌نیاز ستوده (الغني الحميد) آمده است.\nاین‌گونه در تلاوت (قرآن) به صراحت آمده است *** در مورد نزدیک و دور از سعادتش.\nسپس با [آیه] «به خدا قرض نیکو دهید» (أَقْرِضُوا الله قَرْضاً) آمدند *** پس نقص آشکار شد، در حالی که آن عین فزونی است.\n\n### [ده مقوله به دو چیز بازمی‌گردد: انفعال محقق و فاعل معین]\n\nاز آنجا که مراقبه (المراقبة) تنزلی مثالی برای نزدیک ساختن است، و مرتبه عالمان به حق (الله) اقتضا کرد که: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)، پس اشکال و امثال مرتفع شدند و هیچ امری جز برای او مقید نشد و [امر] منضبط نگردید و مجهول ماند. و آشکار شد که او در زمان اعتقاد (الاعتقاد) معلوم نبوده است که گمان می‌کردیم برای ما معلوم است. و در علم به او امر ثبوتی حاصل نشد، بلکه سلب محقق و نسبتی معقول که آثار موجود در اعیان (حقایق) آن را بخشیدند [حاصل شد]. پس نه چگونگی (کیف) هست، نه کجا (أین)، نه کی (متی)، نه وضع، نه اضافه، نه عرض، نه جوهر، و نه کم (مقدار). و از [مقولات] دهگانه جز انفعال محقق و فاعل معین، یا فعلی آشکار از فاعلی مجهول که اثرش دیده می‌شود و خبرش دانسته نمی‌شود و عینش معلوم نیست و بودنش مجهول نیست، باقی نمانده است. پس چه کسی را مراقبت کنیم؟ در آنجا کسی نیست که چشم بر او بیفتد، یا خیالی (الخيال) او را در بند کشد، یا زمانی او را محدود سازد، یا صفات و احکامی او را متعدد سازد، یا احوالی او را تیره کند، یا اوضاعی او را متمایز سازد، یا اضافه‌ای او را آشکار کند. پس چگونه کسی را مراقبت کنیم که صفات را نمی‌پذیرد؟ و علم، خیال را برمی‌دارد. پس او نگهبان (الرقيب) است نه مراقبت‌شونده، و او حافظ (الحفيظ) است نه محفوظ. آنچه انسان حفظ می‌کند، همانا اعتقادش در قلب اوست؛ و این همان چیزی است که از پروردگارش او را در بر گرفته است.\n\n### [تو در حقیقت جز آنچه را که در نفس خود برپا داشته‌ای، نپرستیده‌ای]\n\nاگر مراقبت کردی، بدان که چه کسی را مراقبت کرده‌ای؛ زیرا از خودت دور نشده‌ای و جز ذات خود را نشناخته‌ای. موجود حادث (مخلوق) جز به مناسب خود تعلق نمی‌گیرد، و آن همان چیزی است که از او نزد توست، و آنچه نزد توست حادث است. پس از جنس خود خارج نشده‌ای و در حقیقت جز آنچه را که در نفس خود برپا داشته‌ای، نپرستیده‌ای. به همین دلیل، گفتارها درباره حق (الله) مختلف شده و احوال دگرگون گشته است. گروهی می‌گویند او چنین است، و گروهی می‌گویند او چنین نیست، بلکه چنان است. و گروهی در علم به او گفتند: «رنگ آب، رنگ ظرف آن است.» پس این [اعتقاد] با دلیل تأثیرگذار است و نزد صاحب این قول، در ظاهر چشم، در آن تأثیر می‌گذارد. پس به حیرتی بنگر که در هر معتقدی جاری است.\n\n### [کامل کسی است که حیرتش بزرگ و حسرتش پایدار باشد]\n\nپس کامل کسی است که حیرتش بزرگ و حسرتش پایدار باشد و به مقصود خود نرسد، زیرا معبودش چنین است. و این بدان سبب است که او قصد به دست آوردن چیزی را کرده که به دست آوردنش ممکن نیست، و راه کسی را پیموده که راهش شناخته نمی‌شود. و اکمل از کامل کسی است که هر اعتقادی را درباره او باور داشته باشد و او را در ایمان و دلایل و همچنین در الحاد بشناسد؛ زیرا الحاد (کفر) تمایل به اعتقادی معین از میان اعتقادات است. پس اگر قصد رسیدن به عین (حقیقت) را دارید، او را با هر چشمی شهود (الشهود) کنید، زیرا تجلی الهی (التجلی) برای او در هر صورتی از وجه و در هر عالمی از حال، عام است. پس اگر می‌خواهی مراقبت کن یا مراقبت نکن، زیرا در آنجا جز پاداش‌دهنده و پاداش‌گیرنده، و عقوبت‌کننده و عقوبت‌شونده نیست.\n(پایان جزء صد و یکم)\n\nبه نام خداوند بخشنده مهربان"
  },
  "page_count": 2
}