{
  "id": 258,
  "title": {
    "ar": "الباب الثامن والخمسون ومائتان في معرفة اللوامع وهي ما ثبت من أنوار التجلي وقتين وقريبا من ذلك",
    "en": "Chapter Two Hundred and Fifty-Eight: Concerning the Gnosis (معرفة) of the Flashes (اللوامع), which are the established lights of the Theophany (التجلي) that endure for two moments or approximately that duration.",
    "ur": "باب دو سو اٹھاون (۲۵۸): لوامع (اللوامع) کی معرفت کے بیان میں، اور یہ وہ انوار ہیں جو ظہور الٰہی (التجلی) سے دو لمحوں یا اس کے قریب ثابت ہوتے ہیں۔",
    "fa": "باب دویست و پنجاه و هشتم در معرفت لوامع (اللوامع) و آن عبارت است از آنچه از انوار تجلی (التجلی) در دو وقت و نزدیک به آن ثابت شده است."
  },
  "content": {
    "ar": "## «الباب الثامن والخمسون ومائتان في معرفة اللوامع وهي ما ثبت من أنوار التجلي وقتين وقريبا من ذلك»\n\n\n> لمعت أنوار توحيدي *** عند تغريدي بتجريدى‏\n\n\n> كلما أبدت لوامعها *** أذنت فينا بتحديدي‏\n\n\n> كل محدود يؤول إلى *** حل تركيب وتبديد\n\n\n> فصله من جنسه علم *** ظاهر بنقص توحيدي‏\n\n\n### [اللوامع بين الذوق والشرب‏]\n\n\nاللوامع فوق الذوق فإنها تزيد على المبدأ ودون الشرب فإن الشرب قد ينتهي إلى الري وقد لا ينتهي فإذا ثبتت أنوار التجلي وقتين وقريبا من ذلك فهي اللوامع وهذا لا يكون في التجلي الذاتي وإنما يكون في تجلى المناسبات فإذا تجلى في المناسبات دام بقدر ثبوت تلك المناسبة والمناسبات صغيرة الزمان قصيرة في الثبوت لأن الشئون الإلهية لا تتركها وما سوى الأعيان القائمة بأنفسها أعراض سريعة الزوال وإنما ثبتت وقتين وقريبا من ذلك لأن الوقت الأول لظهورها والوقت الثاني لإفادة ما تعطيه مما لمعت له فإن المحل يدهش عند لمعانها وهو حديث عهد بالتجلي الذي فارقه فتتربص هذه اللوامع حتى يزول الدهش والتعلق بما كان عليه فيقبل ما أتته به هذه اللوامع وأعني بتربصها تواليها فإذا حصل القبول مضى حكمها فزالت وجاء غيرها مثلها أو خلافها وصاحبها أبدا سريع الرجوع إلى عالم الحس ولا ترد هذه اللوامع إلا بعلوم إلهية لا تعلق لها بعلوم الكون فهي إلهية مجردة هذه ميزانها فإن وجد الإنسان علما يكون في حاله فما هي لوامع لأن ضروب التجلي كثيرة متنوعة الحكم فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Fifty-Eight: Concerning the Knowledge of the Flashes (اللوامع), which are the Lights of the Theophany (أنوار التجلي) that Remain Fixed for Two Moments or Close to That\n\nThe lights of my Oneness (توحيدي) flashed,\nWhen I sang (تغريدي) of my isolation (تجريدي).\n\nWhenever these flashes (لوامعها) appeared,\nThey signaled the definition (تحديدي) of my state within us.\n\nEvery limited thing (محدود) ultimately leads to\nThe dissolution of composition (تركيب) and dispersion (تبديد).\n\nIts separation (فصله) from its genus (جنسه) is a knowledge\nMade manifest by the imperfection of my Oneness (توحيدي).\n\n### [The Flashes (اللوامع) between Tasting (الذوق) and Drinking (الشرب)]\n\nThe Flashes (اللوامع) are above Tasting (الذوق), for they exceed the initial stage, but they are below Drinking (الشرب), for Drinking may or may not lead to complete satiation. Thus, if the lights of the Theophany (أنوار التجلي) remain fixed for two moments (وقتين) or close to that, they are the Flashes.\n\nThis does not occur in the Essential Theophany (التجلي الذاتي); rather, it occurs in the Theophany of Correspondences (تجلى المناسبات). When the disclosure occurs through Correspondences, it endures for the duration of the fixation of that Correspondence. However, the Correspondences are small in time and short in duration of fixation because the Divine Affairs (الشئون الإلهية) do not leave them [in a fixed state]. Everything other than the Entities (الأعيان) subsisting by themselves are accidents (أعراض) that quickly vanish.\n\nThey are fixed for two moments or close to that because the first moment is for their manifestation, and the second moment is for conveying the benefit they grant from that for which they flashed. For the locus (المحل) is astonished (يدهش) when they flash, being recently separated from the Theophany that departed from it. These Flashes therefore wait (تتربص) until the astonishment and the attachment to what the locus was previously upon vanish, so that it may accept what these Flashes have brought to it. By their waiting, I mean their succession (تواليها).\n\nOnce acceptance (القبول) is achieved, their ruling (حكمها) passes, and they vanish, and another flash comes, either similar to them or different. And the possessor of these flashes is always quick to return to the world of sense perception (عالم الحس).\n\nThese Flashes are only repelled by Divine Knowledges (علوم إلهية) that have no connection to the knowledges of the Cosmos (علوم الكون); thus, they are purely Divine (إلهية مجردة)—this is their measure (ميزانها). If a person finds a knowledge that remains fixed in his state, then those are not Flashes, because the types of Theophany (ضروب التجلي) are numerous and varied in their rulings. Know this. And Allah says the Truth, and He guides to the Way. (<<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>>)",
    "ur": "باب دو سو اٹھاون: اللوامع (جھلکوں) کی معرفت میں، اور یہ وہ ہیں جو التجلی (ظہور الٰہی) کے انوار میں دو وقتوں یا اس کے قریب تک ثابت رہیں۔\n\nمیرے توحید (یکتائی) کے انوار چمکے *** جب میں نے اپنے تجرید (تنہائی) میں نغمہ سرائی کی\n\nجب بھی اس نے اپنی اللوامع (جھلکیں) ظاہر کیں *** اس نے ہم میں میری تحدید (حد بندی) کی اجازت دی\n\nہر محدود چیز کا انجام *** ترکیب کے ٹوٹنے اور بکھرنے کی طرف ہوتا ہے\n\nاس کی جنس سے اس کا جدا ہونا ایک علم ہے *** جو میری توحید (یکتائی) کی کمی کو ظاہر کرتا ہے۔\n\n### [اللوامع (جھلکیں) الذوق (ذوق) اور الشرب (سیرابی) کے درمیان]\n\nاللوامع (جھلکیں) الذوق (ذوق) سے اوپر ہیں، کیونکہ وہ مبدأ (ابتدا) سے زیادہ ہوتی ہیں، اور الشرب (سیرابی) سے نیچے ہیں، کیونکہ الشرب (سیرابی) کبھی تو ری (پیاس بجھنے) پر منتہی ہوتی ہے اور کبھی نہیں ہوتی۔ پس جب التجلی (ظہور الٰہی) کے انوار دو وقتوں یا اس کے قریب تک ثابت رہیں، تو یہی اللوامع (جھلکیں) ہیں۔ اور یہ التجلی الذاتی (ذاتی ظہور) میں نہیں ہوتا، بلکہ یہ مناسبات (تعلقات) کے التجلی (ظہور) میں ہوتا ہے۔\n\nپس جب وہ مناسبات (تعلقات) میں تجلی (ظہور) فرماتا ہے، تو وہ اس مناسبت کے ثبوت کی مقدار تک قائم رہتا ہے۔ اور مناسبات (تعلقات) زمانے کے لحاظ سے چھوٹے اور ثبوت میں مختصر ہوتے ہیں، کیونکہ شؤون الٰہیہ (الٰہی معاملات) انہیں چھوڑتے نہیں ہیں۔ اور اعیان قائمہ بذاتہا (خود قائم رہنے والے حقائق) کے علاوہ جو کچھ ہے وہ اعراض (عارضی کیفیات) ہیں جو تیزی سے زائل ہو جاتے ہیں۔ اور یہ (اللوامع) دو وقتوں یا اس کے قریب تک صرف اس لیے ثابت رہیں، کیونکہ پہلا وقت ان کے ظہور کے لیے ہے اور دوسرا وقت اس فائدے کو پہنچانے کے لیے ہے جو وہ اس چیز سے دیتی ہیں جس کے لیے وہ چمکیں (لمعت)۔\n\nکیونکہ محل (سالک کا قلب) ان کے چمکنے پر حیران ہو جاتا ہے، اور وہ اس التجلی (ظہور) سے نیا نیا جدا ہوا ہوتا ہے جو اسے چھوڑ گیا تھا۔ پس یہ اللوامع (جھلکیں) انتظار کرتی ہیں یہاں تک کہ حیرانی اور اس چیز سے تعلق زائل ہو جائے جس پر وہ تھا، تاکہ وہ اس چیز کو قبول کر لے جو یہ اللوامع (جھلکیں) اس کے پاس لائی ہیں۔ اور میرے نزدیک ان کے انتظار کرنے سے مراد ان کا مسلسل آنا ہے۔ پس جب قبولیت حاصل ہو جاتی ہے تو ان کا حکم ختم ہو جاتا ہے، اور وہ زائل ہو جاتی ہیں اور ان کی جگہ دوسری اللوامع آتی ہیں جو یا تو ان جیسی ہوتی ہیں یا ان سے مختلف۔\n\nاور ان کا صاحب ہمیشہ عالم حس (محسوسات کی دنیا) کی طرف تیزی سے لوٹنے والا ہوتا ہے۔ اور یہ اللوامع (جھلکیں) صرف ان علوم الٰہیہ کے ذریعے ہی واپس لائی جا سکتی ہیں جن کا علوم کون (کائنات کے علوم) سے کوئی تعلق نہیں ہوتا۔ پس یہ مجرد الٰہی علوم ہیں، یہ ان کا معیار ہے۔ اگر انسان کوئی ایسا علم پائے جو اس کی حالت میں ہو، تو وہ اللوامع (جھلکیں) نہیں ہیں، کیونکہ التجلی (ظہور الٰہی) کی اقسام بہت ہیں اور ان کے احکام متنوع ہیں۔ پس یہ جان لو۔ اور اللہ سچ فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب دویست و پنجاه و هشتم در شناخت لوامع (درخشش‌ها) و آن چیزی است که از انوار التجلی (تجلی الهی) برای دو وقت یا نزدیک به آن ثابت می‌ماند.\n\nدرخشش‌های توحید من تابید\nهنگام نغمه‌سرایی‌ام به تجرید (تجريد)\n\nهرگاه لوامع (درخشش‌های) خود را آشکار ساخت\nدر ما به محدودیتم اذن داد\n\nهر محدودیتی بازمی‌گردد به\nگسستن ترکیب و پراکندگی\n\nجدایی آن از جنس خود، دانشی است\nآشکار به نقص توحید من\n\n### [لوامع (درخشش‌ها) میان ذوق و شرب]\n\nلوامع (درخشش‌ها) بالاتر از ذوق هستند، زیرا بر مبدأ می‌افزایند، و پایین‌تر از شرب (نوشیدن) هستند، زیرا شرب ممکن است به سیرابی برسد و ممکن است نرسد. پس اگر انوار التجلی (تجلی الهی) برای دو وقت یا نزدیک به آن ثابت بماند، آن همان لوامع است. و این در التجلی الذاتی (تجلی ذاتی) رخ نمی‌دهد، بلکه تنها در تجلی مناسبات (تجلیات متناسب) اتفاق می‌افتد. پس هرگاه در مناسبات تجلی کند، به اندازه ثبوت آن مناسبت دوام می‌یابد. و مناسبات از نظر زمان کوچک و از نظر ثبوت کوتاه هستند، زیرا شئون الهیه (امور الهی) آن‌ها را رها نمی‌کند. و آنچه غیر از اعیان (ذوات) قائم به خود است، اعراض (کیفیات) زودگذر هستند.\n\nو این لوامع تنها برای دو وقت یا نزدیک به آن ثابت می‌مانند، زیرا وقت اول برای ظهور آن‌هاست و وقت دوم برای افاده آنچه که به خاطر آن درخشیده‌اند. زیرا محل (سالک) هنگام درخشش آن‌ها مبهوت می‌شود، در حالی که او تازه از تجلی‌ای که از آن جدا شده است، فارغ گشته. پس این لوامع (درخشش‌ها) درنگ می‌کنند تا بهت و تعلق به آنچه بر آن بوده است، زایل شود، و آنچه را که این لوامع برایش آورده‌اند، بپذیرد. و منظورم از درنگ کردن آن‌ها، پی در پی آمدنشان است. پس هرگاه پذیرش حاصل شود، حکم آن‌ها سپری می‌شود و زایل می‌گردند و غیر آن‌ها، مانند یا خلاف آن‌ها، می‌آید. و صاحب این لوامع همیشه سریع به عالم حس بازمی‌گردد.\n\nو این لوامع جز با علوم الهیه (علوم الهی) که تعلقی به علوم کون (جهان) ندارند، باز نمی‌گردند؛ پس آن‌ها الهیِ مجرد هستند. این معیار آن‌هاست. پس اگر انسان دانشی بیابد که در حال او باشد، آن لوامع نیست، زیرا انواع التجلی (تجلی الهی) بسیار و احکامشان متنوع است، پس این را بدان. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 1
}