{
  "id": 243,
  "title": {
    "ar": "الباب الثالث والأربعون ومائتان في الكمال",
    "en": "Chapter 243: On Perfection",
    "ur": "باب دو سو تینتالیسواں: کمال کے بیان میں",
    "fa": "باب دویست و چهل و سوم در کمال"
  },
  "content": {
    "ar": "## «الباب الثالث والأربعون ومائتان في الكمال»\n\n\n> ليس الكمال الذي بالنقص تعرفه *** إن الكمال الذي بالنقص موصوف‏\n> العلم يشهده والعين تنكره *** لأنه عدم والنقص معروف‏\n\n\n> لو لم يكن لم تكن عين ولا صفة *** ولا وجود ولا حكم وتصريف‏\n\n\n> أ لا ترى التستري الحبر أثبته *** وهو الصواب الذي ما فيه تحريف‏\n\n\n### [الكمال المطلق الذي لا يقبل الزيادة مختص بالله تعالى‏]\n\n\nأراد بقول سهل أن لكذا سرا لو ظهر بطل كذا اعلم أن الكمال الذي لا يقبل الزيادة لا يكون إلا لله من كونه غنيا عن العالمين وأما الكمال الذي يقبل الزيادة فمثل قوله ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ كما أمر نبيه أن يقول رَبِّ زِدْنِي عِلْماً فالكمال هو وقوف الإنسان على الصورة الرحمانية بطريق الإحاطة لذلك عند مقابلة النسخة حرفا حرفا فيؤثر ولا يتأثر ولا يميل ولا يؤثر عدل في فضل ولا فضل في عدل بل يرتفع الفضل والعدل ويبقى الوجود والشهود وقبول القوابل بحسب استعدادها روحا وجسما فلا ينسب إليه من حيث هو حكم أصلا وجميع النسب تتصف به القوابل وهو على الوجه الواحد الذي يليق به لا يقبل التغير ولا التأثر كما لا يقبل النور من حيث ذاته وعينه ألوان الزجاج مع أنك تنظر إلى النور أحمر وأصفر وأخضر متنوعا بتنوع ألوان الزجاج فالنور ما انصبغ بالألوان ولكن هكذا تشهده العين والعلم يقضي بأنه على صورته التي كان عليها ما تأثر في عينه بشي‏ء من ذلك إلا تنظر إليه في المساحة الهوائية التي بين موضع الزجاج وموضع النور المنعكس المتلون هل ترى في النور في هذه المساحة لونا من تلك الألوان مع كونه قد انبسط على الزجاج وحينئذ عمر المساحة الهوائية التي بين ما يظهر من الألوان وبين الزجاج وكقوس قزح فالكامل من لا يقبل الزائد ونحن في مزيد علم دنيا وآخرة فالنقص بنا منوط فكمالنا بوجود النقص فيه فلنا كمال واحد وللحق كمالان كمال مطلق وكمال يقول به حَتَّى نَعْلَمَ فنسختنا من كمال حتى نعلم لا من الكمال المطلق فافهم فإنه سر عجيب في العلم الإلهي فنشهده تعالى من كونه إلها لا من كونه ذاتا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Forty-Third concerning Perfection (الكمال)\n\nPerfection is not that which you know through deficiency,\nIndeed, Perfection is that which is described by deficiency.\nKnowledge witnesses it, but the eye denies it,\nBecause it is absence, and deficiency is known.\n\nIf it were not, there would be no essence (عين) nor attribute (صفة),\nNor Being (وجود), nor decree (حكم), nor disposition (تصريف).\n\nDo you not see that Al-Tustari, the great scholar, affirmed it,\nAnd that is the truth (الصواب) in which there is no distortion.\n\n### [Absolute Perfection (الكمال المطلق) which does not admit increase is exclusive to Allah, the Exalted]\n\nBy the saying of Sahl [al-Tustari], he meant that such-and-such has a secret, which, if it were revealed, such-and-such would be nullified. Know that the Perfection (الكمال) which does not admit increase (الزيادة) belongs only to Allah, due to His being independent (غنيا) of the worlds (العالمين).\n\nAs for the Perfection which admits increase, it is like His saying: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We shall surely test you until We know), just as He commanded His Prophet to say: <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge).\n\nPerfection, therefore, is the standing of the human being upon the Form of the All-Merciful (الصورة الرحمانية) by way of encompassing it (الإحاطة), when comparing the copy [the human] letter by letter [with the original]. Thus, he influences but is not influenced, and he does not incline, nor does he prefer justice (عدل) over grace (فضل), nor grace over justice. Rather, both grace and justice are transcended, and what remains is Being (الوجود) and Witnessing (الشهود), and the acceptance of the receptive entities (القوابل) according to their preparedness, spiritually and physically.\n\nTherefore, no decree (حكم) is attributed to him [the Perfect Human] essentially, and all relations (النسب) are characterized by the receptive entities. And He [The Real], upon the One Face (الوجه الواحد) that befits Him, does not admit change or influence.\n\nJust as light, in terms of its Essence (ذاته) and Reality (عينه), does not accept the colors of the glass, even though you look at the light as red, yellow, and green, varied by the variation of the glass colors. The light is not dyed by the colors, but this is how the eye witnesses it, while Knowledge (العلم) dictates that it remains upon the form it was upon, having not been influenced in its Reality (عينه) by any of that.\n\nDo you not look at it in the aerial space (المساحة الهوائية) between the location of the glass and the location of the reflected, colored light? Do you see in the light within this space any color from those colors, despite the fact that it has spread over the glass? And at that time, it fills the aerial space between what appears of the colors and the glass, just like a rainbow (قوس قزح).\n\nThe Perfect One (الكامل) is he who does not admit increase, yet we are in continuous increase of knowledge, both in this world and the Hereafter. Thus, deficiency (النقص) is tied to us. Therefore, our perfection exists through the presence of deficiency within it. We have one perfection, while The Real (الحق) has two perfections: Absolute Perfection (كمال مطلق) and the perfection by which He says: <<حَتَّى نَعْلَمَ>> (until We know).\n\nThus, our copy [our perfection] is derived from the perfection of \"until We know,\" not from Absolute Perfection. Understand this, for it is a wondrous secret in Divine Knowledge (العلم الإلهي). So we witness Him, the Exalted, from the perspective of His being God (إلها), not from the perspective of His being the Essence (ذاتا). And Allah <<يَقُولُ الْحَقَّ>> (speaks the Truth) and <<وَهُوَ يَهْدِي السَّبِيلَ>> (He guides to the way).",
    "ur": "باب دو سو تینتالیس: کمال کے بیان میں\n\nوہ کمال نہیں جسے تم نقص (النقص) کے ذریعے پہچانتے ہو،\nبلکہ کمال وہ ہے جو نقص (النقص) کے ساتھ موصوف (منسوب) ہے۔\nعلم (العلم) اس کا شہود (الشہود) کرتا ہے اور آنکھ (العین) اس کا انکار کرتی ہے،\nکیونکہ وہ عدم ہے اور نقص (النقص) معروف ہے۔\nاگر وہ نہ ہوتا تو نہ کوئی عین ہوتی نہ کوئی صفت،\nنہ کوئی ہستی (الوجود) ہوتی، نہ کوئی حکم اور نہ کوئی تصرف۔\nکیا تم نہیں دیکھتے کہ عالم (حبر) تستری نے اسے ثابت کیا ہے؟\nاور یہی وہ درست بات ہے جس میں کوئی تحریف نہیں۔\n\n[کمال مطلق جو زیادتی قبول نہیں کرتا، اللہ تعالیٰ کے لیے خاص ہے]\n\nسہل (تستری) کے قول سے مراد یہ ہے کہ فلاں چیز کا ایک راز ہے، اگر وہ ظاہر ہو جائے تو فلاں چیز باطل ہو جائے گی۔ جان لو کہ وہ کمال جو زیادتی قبول نہیں کرتا، وہ صرف اللہ تعالیٰ کے لیے ہے، اس اعتبار سے کہ وہ تمام جہانوں سے بے نیاز ہے۔ اور رہا وہ کمال جو زیادتی قبول کرتا ہے، تو اس کی مثال اللہ تعالیٰ کا یہ فرمان ہے: \"اور ہم ضرور تمہیں آزمائیں گے تاکہ ہم جان لیں (وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ)\"۔ جیسا کہ اس نے اپنے نبی کو حکم دیا کہ وہ کہیں: \"اے میرے رب! میرے علم میں اضافہ فرما (رَبِّ زِدْنِي عِلْماً)\"۔\n\nپس کمال یہ ہے کہ انسان رحمانی صورت پر اس کا احاطہ (الإحاطۃ) کرتے ہوئے قائم ہو جائے، جب وہ نسخے کا حرف بہ حرف مقابلہ کرتا ہے، تو وہ اثر ڈالتا ہے مگر خود متاثر نہیں ہوتا، نہ مائل ہوتا ہے اور نہ ہی عدل کو فضل میں اور فضل کو عدل میں مؤثر کرتا ہے۔ بلکہ فضل اور عدل دونوں بلند ہو جاتے ہیں اور صرف ہستی (الوجود)، شہود (الشہود)، اور قبول کرنے والوں (القوابل) کا ان کی روحانی اور جسمانی استعداد کے مطابق قبول کرنا باقی رہتا ہے۔\n\nلہٰذا، اس (کامل) کی طرف، اس کی اپنی حیثیت سے، کوئی حکم منسوب نہیں کیا جاتا، اور تمام نسبتیں قبول کرنے والوں (القوابل) کے ساتھ متصف ہوتی ہیں۔ اور وہ (کمال) اس ایک ہی چہرے پر قائم رہتا ہے جو اس کے لائق ہے، وہ نہ تبدیلی قبول کرتا ہے اور نہ ہی متاثر ہوتا ہے۔ جیسا کہ نور اپنی ذات اور عین کے اعتبار سے شیشے کے رنگوں کو قبول نہیں کرتا، حالانکہ تم نور کو شیشے کے رنگوں کے تنوع کی وجہ سے سرخ، پیلا اور سبز مختلف رنگوں میں دیکھتے ہو۔ پس نور ان رنگوں سے رنگین نہیں ہوا، لیکن آنکھ (العین) اس کا شہود (الشہود) اسی طرح کرتی ہے، جبکہ علم (العلم) یہ فیصلہ کرتا ہے کہ وہ اپنی اسی صورت پر ہے جس پر وہ تھا، اور اپنی عین میں ان میں سے کسی چیز سے متاثر نہیں ہوا۔\n\nکیا تم اسے اس ہوائی فضا میں نہیں دیکھتے جو شیشے کی جگہ اور منعکس ہونے والے رنگین نور کی جگہ کے درمیان ہے؟ کیا تم اس فضا میں نور میں ان رنگوں میں سے کوئی رنگ دیکھتے ہو؟ حالانکہ وہ شیشے پر پھیل چکا ہے اور اس وقت اس ہوائی فضا کو بھر چکا ہے جو ظاہر ہونے والے رنگوں اور شیشے کے درمیان ہے۔ اور جیسے قوس قزح (رینبو) ہے۔\n\nپس کامل وہ ہے جو زیادتی قبول نہ کرے۔ اور ہم دنیا و آخرت میں علم کی زیادتی میں ہیں، لہٰذا نقص (النقص) ہم سے وابستہ ہے۔ پس ہمارا کمال اس میں نقص (النقص) کے وجود کے ساتھ ہے۔ لہٰذا ہمارا ایک کمال ہے اور ذات حق (الحق) کے دو کمال ہیں: ایک کمال مطلق اور دوسرا وہ کمال جس کے بارے میں وہ فرماتا ہے: \"تاکہ ہم جان لیں (حَتَّى نَعْلَمَ)\"۔ پس ہمارا نسخہ کمالِ \"تاکہ ہم جان لیں\" سے ہے، نہ کہ کمال مطلق سے۔ پس سمجھو، کیونکہ یہ علم الٰہی میں ایک عجیب راز ہے۔ پس ہم اس (ذات حق) کا شہود (الشہود) اس کے معبود (إلٰہ) ہونے کے اعتبار سے کرتے ہیں، نہ کہ اس کی ذات ہونے کے اعتبار سے۔ اور اللہ حق (الْحَقَّ) فرماتا ہے اور وہی راہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب دویست و چهل و سوم در کمال\n\nکمالی نیست که آن را با نقص بشناسی *** همانا کمالی است که به نقص وصف شده است\nعلم آن را شهود (الشهود) می‌کند و چشم آن را انکار می‌کند *** زیرا آن (نقص) عدم است و نقص شناخته شده است\n\nاگر نبود، نه عین (ذات) بود و نه صفتی *** و نه هستی (الوجود) و نه حکم و تدبیری\n\nآیا نمی‌بینی که تستری، آن عالم بزرگ، آن را اثبات کرد *** و آن همان درستی است که در آن تحریفی نیست\n\n### [کمال مطلق که افزایش نمی‌پذیرد، مختص خداوند متعال است]\n\nمنظور سهل (تستری) از این سخن آن است که برای فلان چیز رازی است که اگر آشکار شود، فلان چیز باطل می‌گردد. بدان که کمالی که افزایش نمی‌پذیرد، جز برای خداوند نیست، از آن جهت که او بی‌نیاز از جهانیان است. و اما کمالی که افزایش می‌پذیرد، مانند سخن اوست: **وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ** (و قطعاً شما را می‌آزماییم تا بدانیم) [سوره محمد، آیه ۳۱]؛ چنانکه به پیامبرش امر کرد که بگوید: **رَبِّ زِدْنِي عِلْماً** (پروردگارا، بر علم من بیفزا) [سوره طه، آیه ۱۱۴].\n\nپس کمال، ایستادن انسان بر صورت رحمانی است از طریق احاطه بر آن، هنگام مقابله نسخه (کونی) حرف به حرف. پس تأثیر می‌گذارد و تأثیر نمی‌پذیرد، و متمایل نمی‌شود، و عدل در فضل و فضل در عدل تأثیر نمی‌گذارد؛ بلکه فضل و عدل مرتفع می‌شوند و هستی (الوجود) و شهود (الشهود) و پذیرش پذیرندگان (قوابل) بر حسب استعدادشان، چه روحاً و چه جسماً، باقی می‌ماند. پس از آن جهت که او (انسان کامل) هست، حکمی اصلاً به او نسبت داده نمی‌شود، و تمامی نسبت‌ها به پذیرندگان (قوابل) متصف می‌شوند. و او بر همان وجه واحدی است که شایسته اوست، تغییر و تأثر نمی‌پذیرد.\n\nهمان‌گونه که نور از حیث ذات و عین خود، رنگ‌های شیشه را نمی‌پذیرد، با اینکه تو نور را سرخ و زرد و سبز، متنوع به تنوع رنگ‌های شیشه می‌بینی. پس نور به رنگ‌ها رنگین نشده است، اما چشم این‌گونه آن را شهود می‌کند، در حالی که علم حکم می‌کند که نور بر همان صورتی است که بوده و در عین خود به هیچ‌یک از آن رنگ‌ها تأثیر نپذیرفته است. آیا به آن در فضای هوایی که میان جایگاه شیشه و جایگاه نور منعکس رنگین شده است، نمی‌نگری؟ آیا در نور در این فضا، رنگی از آن رنگ‌ها می‌بینی، با اینکه نور بر شیشه گسترده شده است؟ و در آن هنگام، فضای هوایی میان آنچه از رنگ‌ها ظاهر می‌شود و میان شیشه را پر کرده است، مانند رنگین‌کمان.\n\nپس کامل کسی است که افزایش نمی‌پذیرد، در حالی که ما در افزایش علم دنیا و آخرت هستیم، پس نقص به ما گره خورده است. پس کمال ما به وجود نقص در آن است. ما یک کمال داریم و حق (الحق) دو کمال: کمال مطلق و کمالی که با آن می‌گوید: **حَتَّى نَعْلَمَ** (تا بدانیم). پس نسخه ما از کمال «حتی نعلم» است، نه از کمال مطلق. پس بفهم، زیرا این رازی شگفت در علم الهی است. پس ما او را از جهت اینکه اله است شهود می‌کنیم، نه از جهت اینکه ذات است. و خداوند **يَقُولُ الْحَقَّ** (حق را می‌گوید) و **هُوَ يَهْدِي السَّبِيلَ** (او راه را هدایت می‌کند) [سوره احزاب، آیه ۴]."
  },
  "page_count": 2
}