{
  "id": 393,
  "title": {
    "ar": "الباب الثالث والتسعون وثلاثمائة في معرفة منازلة من وقف عند ما رأى ما هنا له هلك",
    "en": "Chapter Three Hundred and Ninety-Third: Concerning the Gnosis of the Spiritual Station (منازلة) of him who halts at what he witnesses, and how what is present therein is ruinous for him.",
    "ur": "باب تین سو ترانوے: اس شخص کے مقام کی معرفت میں جو اپنے مشاہدے پر ٹھہر گیا، جس کے سبب اس کے لیے جو کچھ یہاں تھا وہ ہلاک ہو گیا۔",
    "fa": "باب سیصد و نود و سوم، در معرفت منزلت کسی که نزد آنچه دید توقف کرد، [و] به سبب آن هلاک گشت."
  },
  "content": {
    "ar": "## «الباب الثالث والتسعون وثلاثمائة في معرفة منازلة من وقف عند ما رأى ما هنا له هلك»\n\n\n> الخلق تقدير وليس بكائن *** والمبدعات هي التي تتكون‏\n\n\n> الروح والكلمات شي‏ء واحد *** والحق فيه هو الذي يتعين‏\n> فالعالم النحرير ليس بثابت *** في حاله فمقامه يتلون‏\n\n\n> فلذاك أعطى كل شي‏ء خلقه *** وهذا كم لكلامه فتبينوا\n\n\n> لو لم يكن عين الكلام وجودنا *** لم نغتنمه فلم تلذ الأعين‏\n\n\n> بفنون أسماء الإله قلوبنا *** وتوجهات الحق بي تتفنن‏\n\n\n> فجميع ما جئنا به إن كنت ذا *** فهم وتحقيق به تتيقن‏\n\n\n### [أن الله تعالى سوى النشأة الإنسانية]\n\n\nاعلم أيدنا الله وإياك أن الله تعالى لما سوى النشأة الإنسانية بل جميع ما أنشأه من أجسام العالم الطبيعية والعنصرية وعدلها على الترتيب الذي تقتضيه الحكمة في كل جسم وعدله وهياه لقبول ما يريد أن يهبه في نفخه فيه من الروح الإلهي نَفَخَ فِيهِ من رُوحِهِ فظهر فيه عند ذلك نفس مدبرة لذلك الهيكل وظهرت بصورة مزاج الهيكل فتفاضلت النفوس كما تفاضلت الأمزجة كما يضرب نور الشمس في الألوان المختلفة التي في الزجاج فتعطي أنوارا مختلفة الألوان من أحمر وأصفر وأزرق وغير ذلك بحسب لون الزجاج في رأى العين فلم يكن ذلك الاختلاف في النور الذي حدث فيه إلا من المحل ولا تعين في نفسه جزءا عن غيره إلا بالمحل فالمحل عينه والمحل غيره كذلك النفوس المدبرة للهياكل الطبيعية والعنصرية فللنفوس الأثر في الهياكل بحكم التدبير ولا تقبل من التدبير فيها من هذه النفوس إلا بقدر استعدادها وللهياكل أثر في النفوس بحسب أمزجتها في أصل ظهورها عند تعيينها فمنهم الذكي والبليد بحسب مزاج الهيكل فالأمر عجيب بينهما فكل واحد منهما مؤثر فيمن هو مؤثر فيه ثم إن الله أخذ بأكثر أبصار جنس الإنس والجان عن إدراك النفوس المدبرة الناطقة التي للمسمى جمادا ونباتا وحيوانا وكشف لبعض الناس عن ذلك والدليل السمعي على ما قلناه قول الله وإِنَّ مِنْها يعني من الحجارة لَما يَهْبِطُ من خَشْيَةِ الله فوصفها بالخشية وأما أمثالنا فلا يحتاج إلى خبر في ذلك فإن الله قد كشفها لنا عينا وأسمعنا تسبيحها ونطقها لله الحمد على ذلك وكذلك اندكاك الجبل لتجلى الرب له لو لا العظمة التي في نفس الجبل من ربه لما تدكدك لتجليه له فإن الذوات لا تؤثر في أمثالها وإنما يؤثر في الأشياء قدرها ومنزلتها في نفس المؤثر فيه فعلمه بقدر ذلك المتجلي أثر فيه ما أثر فيه ما ظهر له فإنا نرى الملك إذا دخل في صورة العامة ومشى في السوق بين الناس وهم لا يعرفون أنه الملك لم يقم له وزن في نفوسهم فإذا لقيه في تلك الحالة من يعرفه قامت بنفسه عظمته وقدره فأثر فيه علمه به فاحترمه وتأدب وسجد له فإذا رأى الناس الذين يعرفون قرب ذلك العالم من الملك وأن منزلته لا تعطي أن يظهر منه مثل هذا الفعل إلا مع الملك علموا أنه الملك فحادت إليه الأبصار وخشعت الأصوات وأوسعوا له وتبادر والرؤيته واحترامه فهل أثر ذلك عندهم إلا ما قام بهم من العلم به فما احترموه لصورته فقد كانت صورته مشهودة لهم وما علموا أنه الملك وكونه ملكا ليس عين صورته وإنما هي رتبة نسبية أعطته التحكم في العالم الذي تحت بيعته‏\n\n\nورد في الخبر الذي خرجه أبو نعيم الحافظ في دلائل النبوة في بعض إسراءات رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه قال جاءه جبريل عليه السلام ليلة ومعه شجرة فيها كوكرى الطائر فقعد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الوكر الواحد وقعد جبريل عليه السلام في الوكر الآخر ثم إن الشجرة علت بهما حتى بلغا السماء فتدلى إليهما رفرف در وياقوت فأما محمد صَلَّى اللهُ عَليهِ وسَلَّم فلم يعلم ما هو فلم يؤثر فيه وأما جبريل عليه السلام عند ما رآه غشى عليه فقال صَلَّى اللهُ عَليهِ وسَلَّم فعلمت فضله علي في العلم‏\n\n\nفإنه علم ما رأى فأثر فيه علمه بما رآه الغشي ولم يعلمه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فلم ير له أثر فيه فلا يؤثر في الأشياء إلا ما قام بها وليس إلا العلم أ لا ترى شخصان يقرءان القرآن فيخشع أحدهما ويبكي والآخر ما عنده من ذلك كله خبر ولا يؤثر فيه هل ذلك إلا من أثر علمه القائم به لما تدل عليه تلك الآية وشهوده ما تضمنته من الأمر الذي أبكاه وخشع له والآخر أعمى عن تلك المعاني لا يجاوز القرآن حنجرته ولا أثر لتلاوته فيه فلم يكن الأثر لصورة لفظ الآية وإنما الأثر لما قام بنفس العالم بها المشاهد ما نزلت له تلك الآية فلا يؤثر فيك إلا ما قام بك من حيث ما تعلم وتشهد فلو لا علمه بالأمر ما هاله وإذا لم يرتحل ووقف عند ما رآه وقد هاله ذلك فبالضرورة يهلك أي يغيب عن صوابه وحسه ويدهش أو يغشى عليه أو يموت فرقا منه على قدر قوة\nذلك التالي أو ضعفه فهو مع ما حصل في نفسه من ذلك ونُفِخَ في الصُّورِ فَصَعِقَ من في السَّماواتِ ومن في الْأَرْضِ إِلَّا من شاءَ الله وهذا أمر إضافي فقد يكون الأمر عند زيد أهول منه عند عمرو وقد يكون عند عمرو أمر آخر أهول منه عند زيد فتؤثر الأهوال عند كل واحد منهما بحيث أن يقول كل واحد منهما عن صاحبه عجبت لفلان ما الذي رأى حتى أثر فيه بما ظهر عليه كيف به لو علم ما عندي من هذا الذي لم يرفع به رأسا كل واحد منهما يقول هذه المقالة والعالم الكامل الثالث يقول خلاف قولهما ويعلم السبب المؤثر في كل واحد منهما فيعلم منهما ما لا يعلمان من نفوسهما فسبحان الحكم العدل منزل الأشياء منازلها ومعين المراتب لأهلها فإذا علمت هذا علمت علما غريبا هو العجب العجاب يحتوي على سر لا يتمكن كشفه ولا ينبغي التصريح به فإن الله يغار على العبد أن يظهر مثل هذا فإنه أمر يقتضيه الوجود وهو عظيم الفائدة فما ظهر العالم إلا بالنسب ولا حصل القبول من العالم لما قبله من العالم أيضا إلا بالنسب فالموجد بالنسب والقابل بالنسب فالحكم لها وقد علمت ما هي النسب‏\n\n\n> فيها صح وجودي وبها *** صح للكون من الله نسب‏\n\n\n> فله الشكر على ما خصني *** امتنانا من معارف النسب‏\n\n\n> فبها صحت السعادة فينا *** وبها صح للشقي الشقاء\n\n\n> عدم بحكم الوجود وأبدى *** عجبا فيه كيف ليس يشاء\n\n\n> فهو الموجد المؤثر فينا *** وهو الحق ليس فيه امتراء\n\n\nفالله غني عن العالمين والغني صفة تنزيه وأعظم الثناء عندنا في حق الحق قوله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ سواء كانت كاف الصفة أو كانت زائدة وكونها للصفة أبلغ في الثناء عند العالم باللسان الذي نزل به القرآن‏\n\n\nيقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في دعائه وثنائه على ربه عز وجل لا أحصي ثناء عليك أنت كما أثنيت على نفسك‏\n\n\nيريد قوله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وقال الصديق الأكبر رضي الله عنه العجز عن درك الإدراك إدراك والحق سبحانه ما أثنى على نفسه بأعظم من نفي المثل فلا مثل له سبحانه ولهذا قال في حق العالم من حيث ما هو ناطق وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ والتسبيح تنزيه فإذا أسندت العالم إليه تعالى في الوجود وقلت إنه موجد العالم لم يتمكن لك أن تعقل هذا إلا بنسب تثبتها من حياة وعلم وقدرة وإرادة هذا حد نظر العقل ويثبت بالشرع أنه قائل فإن كانت أعيانا زائدة على ذات فما أوجد شيئا بها إلا عن تعلق بالذي حدث والتعلق نسبة منها إلى المتعلق وإن كانت هذه الصفات ليست بزائدة وإنما ثم عين واحدة وهي الذات وتوجهاتها على إيجاد الممكنات فالتوجهات نسب وهي مختلفة لما يظهر في العالم من الاختلاف الذي هو دليل على حكمنا بها فعلى كل حال ما زالت من النسب وهي الثابتة في العقائد وفي نفوس العلماء كانوا ما كانوا\n\n\n> جاء حديث وارد *** عن النبي المصطفى‏\n\n\n> بأن من خالفه *** في عقده على شفى‏\n\n\n> وما له من دائه *** برء يكون وشفا\n\n\n> إلا إذا وافقه *** في أمره ثم وفى‏\n\n\n> بكل ما خاطبه *** به وإن زل عفا\n\n\n> عنه الذي كلفه *** وهو الإله وكفى‏\n\n\nوهذا القول كله صحيح فهل حصل في معلومات الأنسب من جانب الحق ومن جانب المخلوق فأوجدت بنسب وقبلت بنسب وأوضح من هذا الذي ذكرنا فما يكون والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 393: Concerning the Knowledge of the Station of Him Who Stops at What He Sees, Wherein is His Ruin\n\nCreation (الخلق) is determination, not an existent thing;\nThe originated things (المبدعات) are those that come into being.\n\nThe Spirit and the Words are one single thing,\nAnd The Real (الحق) within it is that which is determined.\nThus, the profound knower is not stable in his state,\nFor his station (مقام) changes color.\n\nTherefore, He gave everything its creation (khuluq),\nAnd this is how much for His speech, so understand clearly.\n\nIf the very essence of Speech were not our existence (وجود),\nWe would not benefit from it, nor would the eyes delight.\n\nOur hearts delight in the varieties of the Names of God,\nAnd the orientations of The Real (الحق) diversify through me.\n\nAll that we have brought forth, if you possess\nUnderstanding (fahm) and verification (tahqiq), you will be certain of it.\n\n### [That God Almighty fashioned the human constitution]\n\nKnow, may God support us and you, that when God Almighty fashioned the human constitution (النشأة الإنسانية)—indeed, all that He originated from the natural and elemental bodies of the cosmos (العالم)—and balanced them according to the arrangement required by wisdom in every body, and prepared it to receive what He wished to bestow upon it in His breathing into it of the Divine Spirit (الروح الإلهي), He breathed into it of His Spirit. Thereupon, a soul (نفس) appeared within it, governing that structure (الهيكل), and it appeared in the form of the temperament (مزاج) of the structure.\n\nThus, the souls differed in degree, just as the temperaments differed, similar to how the light of the sun strikes different colors in glass, yielding lights of various hues—red, yellow, blue, and others—according to the color of the glass, in the eye’s view. That difference in the light that occurred within it was only due to the locus (المحل). No part of the light was determined distinctly from another except by the locus. The locus is its essence (عينه) and the locus is other than it.\n\nSimilarly are the souls governing the natural and elemental structures. The souls have an effect upon the structures by virtue of governance (التدبير), yet the structures accept governance from these souls only according to their capacity (استعداد). And the structures have an effect upon the souls according to their temperaments (أمزجتها) at the origin of their manifestation upon their determination. Thus, some are intelligent (الذكي) and some are dull (البليد), according to the temperament of the structure. The matter between them is wondrous, for each one influences that which influences it.\n\nFurthermore, God veiled the sight of most of humankind and jinn from perceiving the governing, speaking souls (النفوس المدبرة الناطقة) belonging to what is called inanimate objects (جمادا), plants (نباتا), and animals (حيوانا). He unveiled this to some people. The transmitted proof (الدليل السمعي) for what we have said is the word of God: <<وَإِنَّ مِنْهَا>> (And indeed, among them)—meaning the stones—<<لَمَا يَهْبِطُ مِنْ خَشْيَةِ اللَّهِ>> (are those which fall down out of fear of Allah). Thus, He described them with fear (خشية). As for people like us, we do not need a report concerning this, for God has unveiled it to us directly (عينا) and has made us hear their glorification (تسبيحها) and their speech (نطقها). Praise be to God for that.\n\nLikewise, the crumbling of the mountain (اندكاك الجبل) due to the Theophany (تجلي) of the Lord to it: had it not been for the magnitude (العظمة) within the soul (نفس) of the mountain derived from its Lord, it would not have crumbled upon His Self-disclosure (تجلي). For essences (الذوات) do not affect their likes. Rather, what affects things is their rank (قدرها) and station (منزلتها) within the soul of the affected entity. Thus, the mountain’s knowledge (علمه) of the rank of that Manifested One (المتجلي) caused the effect that appeared in it.\n\nWe see that if a king enters in the guise of common people and walks in the market among them, and they do not know he is the king, he holds no weight in their souls. But if someone who knows him meets him in that state, the king’s magnitude and rank arise within that person’s soul. His knowledge of the king affects him, so he respects him, shows reverence, and prostrates to him. Then, when the people who know the proximity of that knowledgeable person (العالم) to the king see that his station does not permit such an action except toward the king, they realize that he is the king. Eyes turn toward him, voices are lowered in reverence, they make space for him, and they rush to see and respect him. Did this effect occur in them except through the knowledge (العلم) that arose within them concerning him? They did not respect him for his form, for his form was visible to them before they knew he was the king. His being a king is not the essence of his form; rather, it is a relative rank (رتبة نسبية) that grants him control over the realm under his allegiance.\n\nIt is reported in the tradition narrated by Abu Nu'aym al-Hafiz in *Dala'il al-Nubuwwa* (Proofs of Prophethood) concerning one of the Prophet’s nocturnal journeys (إسراءات), may God bless him and grant him peace, that he said: Gabriel, peace be upon him, came to him one night with a tree containing two bird nests. The Messenger of God, may God bless him and grant him peace, sat in one nest, and Gabriel, peace be upon him, sat in the other. Then the tree ascended with them until they reached the heaven. A cushion (رفرف) of pearls and rubies descended toward them. As for Muhammad, may God bless him and grant him peace, he did not know what it was, so it had no effect on him. But as for Gabriel, peace be upon him, when he saw it, he fainted. The Prophet, may God bless him and grant him peace, then said: \"I knew his superiority over me in knowledge (العلم).\"\n\nFor Gabriel knew what he saw, and his knowledge of what he saw caused him to faint. The Messenger of God, may God bless him and grant him peace, did not know it, so he saw no effect from it. Therefore, nothing affects things except what resides within them, and that is nothing but Knowledge (العلم). Do you not see two people reciting the Quran, one of whom is humbled (يخشع) and weeps, while the other has no awareness of any of that and is unaffected? Is this not due to the effect of the knowledge residing within the first person concerning what that verse indicates, and his witnessing (شهوده) of the matter contained within it that made him weep and be humbled? The other is blind to those meanings; the Quran does not pass beyond his throat, and his recitation has no effect on him.\n\nThus, the effect was not due to the form of the wording of the verse, but rather to what resided in the soul (نفس) of the knower of it, who witnesses (المشاهد) that for which the verse was revealed. Therefore, nothing affects you except what resides within you, based on what you know and witness (تشهد). Had he not possessed knowledge of the matter, it would not have terrified him. If he does not move on and stops at what he sees, and that sight terrifies him, he will necessarily perish (يهلك)—meaning he will lose his soundness and senses, become bewildered, faint, or die from fear, depending on the strength or weakness of that recipient. This is consistent with what occurred within his soul, as in the verse: <<وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ إِلَّا مَن شَاءَ اللَّهُ>> (And the Trumpet will be blown, and whoever is in the heavens and whoever is on the earth will fall dead, except whom Allah wills).\n\nThis is a relative matter (أمر إضافي). An event may be more terrifying to Zayd than to Amr, and another event may be more terrifying to Amr than to Zayd. The terrors affect each of them such that each says of the other: \"I wonder what so-and-so saw that affected him so visibly? What would happen to him if he knew what I have, which he pays no mind to?\" Each of them says this statement. But the third, the Perfect Knower (العالم الكامل), says the opposite of their statements and knows the effective cause (السبب المؤثر) in each of them. Thus, he knows about their souls (نفوسهما) what they do not know themselves. Glory be to the Just Judge (الحكم العدل), Who assigns things to their stations (منازلها) and determines the levels (المراتب) for their people.\n\nIf you know this, you will attain a strange knowledge (علما غريبا) that is the wonder of wonders, containing a secret that cannot be unveiled and should not be explicitly stated, for God is jealous over the servant that such a thing should be revealed. This is a matter necessitated by Existence (الوجود) and is of great benefit. The cosmos (العالم) only manifested through relations (النسب), and acceptance by the world of what it accepts from the world also only occurred through relations. The Originator is through relations, and the recipient is through relations. Thus, the ruling belongs to them, and you already know what the relations are.\n\nThrough them, my existence (وجودي) is validated, and through them,\nThe cosmos (الكون) is validated in its relation (نسب) to God.\n\nTo Him be thanks for what He has singled me out for,\nAs a favor from the gnoses (معارف) of the relations.\n\nThrough them, happiness (السعادة) is validated in us,\nAnd through them, wretchedness (الشقاء) is validated for the wretched.\n\nHe was naught by the ruling of Existence (الوجود) and revealed\nA wonder in it: how is it that he does not will?\n\nHe is the Originator, the Influencer in us,\nAnd He is The Real (الحق); there is no doubt concerning Him.\n\nGod is independent of the worlds (غني عن العالمين), and Independence (الغني) is an attribute of transcendence (تنزيه). The greatest praise, in our view, concerning The Real (الحق) is His saying, <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), whether the *kāf* (ك) is for comparison or is superfluous. Its being for comparison is more eloquent in praise according to the one who knows the language in which the Quran was revealed.\n\nThe Messenger of God, may God bless him and grant him peace, said in his supplication and praise of his Lord, the Mighty and Majestic: \"I cannot enumerate praise upon You; You are as You have praised Yourself.\" He means the verse <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). And the Greatest Verifier (الصديق الأكبر), may God be pleased with him, said: \"Inability to grasp the grasp is itself a grasp.\" The Real (الحق), glory be to Him, has not praised Himself with anything greater than the negation of likeness, for He has no likeness, glory be to Him.\n\nFor this reason, He said concerning the cosmos (العالم), insofar as it speaks: <<وَإِن مِّن شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing except that it glorifies Him with His praise). And glorification (التسبيح) is transcendence (تنزيه). If you attribute the cosmos to Him Almighty in Existence (الوجود) and say that He is the Originator of the cosmos, you cannot rationally conceive of this except through relations (نسب) that you affirm, such as Life, Knowledge (علم), Power, and Will. This is the limit of rational consideration. Furthermore, it is established by the Sacred Law (الشرع) that He is a Speaker.\n\nIf these [attributes] are entities (أعيانا) added to the Essence (ذات), then He only originated something through them by means of a connection (تعلق) to that which came into being, and connection is a relation (نسبة) from them to the connected thing. If these attributes are not additional, but rather there is only one essence, which is the Essence (الذات), and its orientations (توجهاتها) toward the origination of the possibilities (الممكنات), then these orientations are relations (نسب). They are diverse due to the variation that appears in the cosmos, which is proof of our judgment concerning them. In any case, they remain relations, and they are established in creeds (العقائد) and in the souls (نفوس) of scholars, whoever they may be.\n\nA tradition has come down,\nReported from the Chosen Prophet,\n\nThat whoever opposes him\nIn his creed (عقده) is on the brink.\n\nAnd for his ailment, there is\nNo cure or healing,\n\nUnless he agrees with him\nIn his command, and then fulfills\n\nEverything with which he addressed him,\nAnd if he slips, He forgives\n\nHim who charged him,\nAnd He is God, and that suffices.\n\nAnd all this statement is sound. Has the most appropriate knowledge (معلومات الأنسب) been attained from the side of The Real (الحق) and from the side of the creature? Things were originated by relations (نسب) and accepted by relations. What could be clearer than what we have mentioned? <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر تین سو ترانوے: اس شخص کے مقامات کی معرفت میں جو اپنے مشاہدے پر ٹھہر گیا، اس کے لیے ہلاکت ہے۔\n\nخلق (تخلیق) ایک اندازہ ہے، وہ موجود نہیں ہے\nاور مبدعات (نئی ایجاد کردہ چیزیں) ہی ہیں جو وجود میں آتی ہیں۔\n\nروح اور کلمات ایک ہی شے ہیں\nاور الحق (ذات حق) ہی ہے جو اس میں متعین ہوتا ہے۔\nپس عالمِ نحریر (ماہر عالم) اپنی حالت میں ثابت نہیں رہتا\nاس لیے اس کا مقام رنگ بدلتا رہتا ہے۔\n\nاسی لیے اس نے ہر شے کو اس کی خلقت عطا کی\nاور یہ اس کے کلام کی تکمیل ہے، پس تم غور کرو۔\n\nاگر ہمارا الوجود (ہستی) عینِ کلام نہ ہوتا\nتو ہم اسے حاصل نہ کر پاتے اور نہ ہی آنکھیں لذت پاتیں۔\n\nاللہ کے اسماء کے فنون سے ہمارے قلوب (بھرے ہیں)\nاور الحق (ذات حق) کی توجہات (توجهات) مجھ میں فنکاری دکھاتی ہیں۔\n\nپس جو کچھ بھی ہم لائے ہیں، اگر تم صاحبِ فہم ہو\nاور تحقیق رکھتے ہو تو اس سے یقین حاصل کر لو گے۔\n\n### [یہ کہ اللہ تعالیٰ نے انسانی نشأت کو برابر کیا]\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ جب اللہ تعالیٰ نے انسانی نشأت کو، بلکہ تمام اجسامِ عالمِ طبیعیہ اور عنصریہ کو جو اس نے پیدا کیے، برابر کیا (سویٰ کیا)، اور ہر جسم میں حکمت کے تقاضے کے مطابق اسے عدل و توازن بخشا، اور اسے اس چیز کے قبول کرنے کے لیے تیار کیا جو وہ اس میں اپنے نفخ (پھونکنے) کے ذریعے روحِ الٰہی سے عطا کرنا چاہتا تھا، تو اس نے اس میں اپنی روح سے پھونکا (نَفَخَ فِيهِ من رُوحِهِ)۔ تب اس میں اس ہیکل (جسم) کی تدبیر کرنے والی ایک نفس ظاہر ہوئی، اور وہ ہیکل کے مزاج کی صورت میں ظاہر ہوئی۔ پس نفوس میں اسی طرح تفاوت پیدا ہوا جس طرح امزجہ (مزاجوں) میں تفاوت ہے۔ یہ ایسے ہی ہے جیسے سورج کی روشنی شیشے میں موجود مختلف رنگوں پر پڑتی ہے، تو آنکھوں کے سامنے شیشے کے رنگ کے مطابق سرخ، پیلے، نیلے اور دیگر مختلف رنگوں کی روشنیاں پیدا ہوتی ہیں۔ پس اس نور میں جو اختلاف پیدا ہوا، وہ صرف محل (جگہ) کی وجہ سے تھا، اور وہ نور اپنے آپ میں کسی ایک جز کو دوسرے سے ممتاز نہیں کرتا مگر محل کے ذریعے سے۔ پس محل ہی اس کی عین (حقیقت) ہے اور محل ہی اس کا غیر ہے۔ اسی طرح طبیعی اور عنصری ہیکلوں کی تدبیر کرنے والی نفوس کا معاملہ ہے۔ نفوس تدبیر کے حکم سے ہیکلوں پر اثر انداز ہوتی ہیں، اور یہ ہیکل ان نفوس سے تدبیر کو صرف اپنی استعداد کے مطابق قبول کرتے ہیں۔ اور ہیکلوں کا نفوس پر ان کے مزاج کے مطابق اثر ہوتا ہے، ان کے اصل ظہور کے وقت جب وہ متعین ہوتے ہیں۔ پس ان میں سے کوئی ہیکل کے مزاج کے مطابق ذہین ہوتا ہے اور کوئی کند ذہن۔ پس ان دونوں کے درمیان معاملہ عجیب ہے، کیونکہ ان میں سے ہر ایک دوسرے پر اثر انداز ہوتا ہے جس پر وہ اثر انداز ہو رہا ہے۔\n\nپھر اللہ نے جن و انس کی اکثریت کی بصارت کو ان مدبر اور ناطق نفوس کے ادراک سے روک دیا جو جمادات، نباتات اور حیوانات کہلاتی ہیں، اور بعض لوگوں کے لیے اس کا کشف (کشف) کر دیا۔ اور جو کچھ ہم نے کہا ہے اس پر سمعی دلیل اللہ کا یہ قول ہے: (وَإِنَّ مِنْها) یعنی پتھروں میں سے (لَما يَهْبِطُ مِنْ خَشْيَةِ اللَّهِ) \"اور ان میں سے کچھ ایسے ہیں جو اللہ کے خوف سے گر پڑتے ہیں\"۔ پس اللہ نے اسے خشیت (خوف) سے متصف کیا۔ لیکن ہم جیسے لوگوں کو اس کے لیے کسی خبر کی ضرورت نہیں، کیونکہ اللہ نے ہمارے لیے اسے عینی طور پر منکشف (کشف) کر دیا ہے اور ہمیں ان کی تسبیح اور نطق (بولنا) سنایا ہے۔ اس پر اللہ کا شکر ہے۔ اسی طرح رب کے التجلی (ظہور الٰہی) کے سبب پہاڑ کا ریزہ ریزہ ہو جانا۔ اگر پہاڑ کے نفس میں اپنے رب کی طرف سے عظمت نہ ہوتی تو وہ اس کے التجلی (ظہور الٰہی) سے ریزہ ریزہ نہ ہوتا۔ کیونکہ ذوات اپنے جیسوں پر اثر انداز نہیں ہوتیں، بلکہ چیزوں پر ان کا قدر و منزلت اثر انداز ہوتا ہے جو مؤثر (اثر ڈالنے والے) کے نفس میں ہو۔ پس اس متجلی (ظاہر ہونے والے) کی قدر کا علم ہی اس پر اثر انداز ہوا جو اس کے لیے ظاہر ہوا۔\n\nہم دیکھتے ہیں کہ جب کوئی بادشاہ عام لوگوں کی صورت میں بازار میں لوگوں کے درمیان چلتا ہے اور وہ نہیں جانتے کہ وہ بادشاہ ہے، تو ان کے نفوس میں اس کی کوئی قدر نہیں ہوتی۔ لیکن اگر اس حالت میں کوئی ایسا شخص اسے مل جائے جو اسے پہچانتا ہو، تو اس کے نفس میں اس کی عظمت اور قدر قائم ہو جاتی ہے، اور اس کا علم ہی اس پر اثر انداز ہوتا ہے، پس وہ اس کا احترام کرتا ہے، ادب سے پیش آتا ہے اور اسے سجدہ کرتا ہے۔ پھر جب وہ لوگ جو اس عالم (جاننے والے) کو جانتے ہیں، دیکھتے ہیں کہ وہ بادشاہ کے قریب ہے اور اس کا مرتبہ یہ اجازت نہیں دیتا کہ وہ ایسا فعل بادشاہ کے علاوہ کسی اور کے ساتھ کرے، تو وہ جان لیتے ہیں کہ یہ بادشاہ ہے۔ پس نگاہیں اس کی طرف جھک جاتی ہیں، آوازیں پست ہو جاتی ہیں، وہ اس کے لیے جگہ بناتے ہیں، اور اس کے دیدار اور احترام کے لیے لپکتے ہیں۔ تو کیا ان کے نزدیک اس چیز نے اثر کیا سوائے اس علم کے جو ان کے اندر اس کے بارے میں قائم ہوا؟ انہوں نے اس کی صورت کی وجہ سے احترام نہیں کیا، کیونکہ اس کی صورت تو ان کے سامنے تھی جب وہ نہیں جانتے تھے کہ وہ بادشاہ ہے۔ اور بادشاہ ہونا اس کی صورت کی عین (حقیقت) نہیں ہے، بلکہ یہ ایک نسبی رتبہ ہے جس نے اسے اس دنیا پر حکمرانی کا اختیار دیا ہے جو اس کی بیعت میں ہے۔\n\nاس خبر میں آیا ہے جسے حافظ ابو نعیم نے دلائل النبوۃ میں رسول اللہ صلی اللہ علیہ وسلم کے بعض معراج کے واقعات میں روایت کیا ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ایک رات جبرائیل علیہ السلام آپ کے پاس آئے اور ان کے ساتھ ایک درخت تھا جس میں پرندے کے دو گھونسلے تھے۔ رسول اللہ صلی اللہ علیہ وسلم ایک گھونسلے میں بیٹھے اور جبرائیل علیہ السلام دوسرے گھونسلے میں بیٹھے۔ پھر وہ درخت ان دونوں کو لے کر اوپر چڑھا یہاں تک کہ وہ آسمان تک پہنچ گئے۔ پھر ان کی طرف موتیوں اور یاقوت کا ایک رفرف (بچھونا) لٹکا۔ محمد صلی اللہ علیہ وسلم نہیں جانتے تھے کہ وہ کیا ہے، لہٰذا اس نے آپ پر کوئی اثر نہیں کیا۔ لیکن جبرائیل علیہ السلام جب اسے دیکھا تو ان پر غشی طاری ہو گئی، تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"پس میں نے علم میں ان کی فضیلت کو مجھ پر جان لیا۔\"\n\nکیونکہ جبرائیل علیہ السلام نے جو کچھ دیکھا اسے جانا، پس ان کے علم نے ہی ان پر غشی طاری کر دی جو انہوں نے دیکھا۔ اور رسول اللہ صلی اللہ علیہ وسلم اسے نہیں جانتے تھے، لہٰذا آپ پر اس کا کوئی اثر ظاہر نہیں ہوا۔ پس چیزوں پر صرف وہی اثر انداز ہوتا ہے جو ان کے اندر قائم ہو، اور وہ صرف علم ہے۔ کیا تم نہیں دیکھتے کہ دو شخص قرآن پڑھتے ہیں، تو ان میں سے ایک خشوع اختیار کرتا ہے اور روتا ہے، جبکہ دوسرے کو اس سب کی کوئی خبر نہیں ہوتی اور اس پر کوئی اثر نہیں ہوتا؟ کیا یہ اس علم کے اثر کے سوا کچھ اور ہے جو اس کے اندر قائم ہے، اس چیز کے سبب جس پر وہ آیت دلالت کرتی ہے، اور اس کے شہود (شہود) کے سبب جو اس امر میں مضمر ہے جس نے اسے رلایا اور خشوع دلایا؟ جبکہ دوسرا ان معانی سے اندھا ہے، قرآن اس کے حلق سے نیچے نہیں اترتا اور اس کی تلاوت کا اس پر کوئی اثر نہیں ہوتا۔ پس اثر آیت کے لفظ کی صورت کا نہیں تھا، بلکہ اثر اس چیز کا تھا جو اس عالم کے نفس میں قائم تھی جو اس آیت کو جانتا ہے اور اس چیز کا مشاہدہ کرتا ہے جس کے لیے وہ آیت نازل ہوئی ہے۔ پس تم پر صرف وہی چیز اثر انداز ہوتی ہے جو تمہارے اندر قائم ہو، اس حیثیت سے کہ تم کیا جانتے ہو اور کیا شہود (شہود) کرتے ہو۔ اگر اسے اس امر کا علم نہ ہوتا تو وہ اسے خوفزدہ نہ کرتا۔ اور جب وہ سفر نہیں کرتا (آگے نہیں بڑھتا) اور جو کچھ اس نے دیکھا اس پر ٹھہر جاتا ہے، جبکہ اس چیز نے اسے خوفزدہ کر دیا ہے، تو بالضرورت وہ ہلاک ہو جائے گا، یعنی اپنے ہوش و حواس سے غائب ہو جائے گا، یا حیران ہو جائے گا، یا اس پر غشی طاری ہو جائے گی، یا اس خوف سے مر جائے گا، اس تلاوت کرنے والے کی قوت یا ضعف کے مطابق۔ پس وہ اس چیز کے ساتھ جو اس کے نفس میں حاصل ہوئی، (وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ) \"اور صور پھونکا جائے گا تو آسمانوں اور زمین میں جو بھی ہیں سب بے ہوش ہو کر گر پڑیں گے، سوائے ان کے جنہیں اللہ چاہے\"۔ اور یہ ایک اضافی امر ہے، پس ہو سکتا ہے کہ کوئی معاملہ زید کے نزدیک عمرو سے زیادہ خوفناک ہو، اور ہو سکتا ہے کہ عمرو کے نزدیک کوئی دوسرا معاملہ زید سے زیادہ خوفناک ہو۔ پس خوفناک چیزیں ان میں سے ہر ایک پر اس طرح اثر انداز ہوتی ہیں کہ ان میں سے ہر ایک اپنے ساتھی کے بارے میں کہتا ہے: \"مجھے فلاں پر تعجب ہے، اس نے کیا دیکھا کہ اس پر وہ اثر ظاہر ہوا؟ اگر اسے وہ معلوم ہوتا جو میرے پاس ہے، جس کی طرف اس نے سر بھی نہیں اٹھایا، تو اس کا کیا حال ہوتا؟\" ان میں سے ہر ایک یہی بات کہتا ہے، اور تیسرا کامل عالم ان دونوں کے قول کے خلاف کہتا ہے، اور ان میں سے ہر ایک پر اثر انداز ہونے والے سبب کو جانتا ہے، پس وہ ان کے نفوس کے بارے میں وہ جانتا ہے جو وہ خود نہیں جانتے۔ پس پاک ہے وہ حاکم و عادل جو چیزوں کو ان کے مقامات پر نازل کرتا ہے اور اہل کے لیے مراتب کو متعین کرتا ہے۔\n\nپس جب تم یہ جان لو گے تو تم ایک عجیب علم جان لو گے جو حیرت انگیز عجوبہ ہے، جس میں ایک ایسا راز ہے جسے منکشف کرنا ممکن نہیں اور نہ ہی اس کی صراحت کرنا مناسب ہے۔ کیونکہ اللہ بندے پر غیرت کھاتا ہے کہ وہ ایسی چیز ظاہر کرے۔ یہ ایک ایسا امر ہے جس کا تقاضا الوجود (ہستی) کرتا ہے اور یہ بہت فائدہ مند ہے۔ پس عالم ظاہر نہیں ہوا مگر نسب (نسبتوں) کے ذریعے، اور عالم کی طرف سے قبولیت بھی عالم سے قبول نہیں ہوئی مگر نسب (نسبتوں) کے ذریعے سے۔ پس ایجاد کرنے والا بھی نسب (نسبتوں) کے ذریعے ہے اور قبول کرنے والا بھی نسب (نسبتوں) کے ذریعے ہے۔ پس حکم انہی کے لیے ہے، اور تم جان چکے ہو کہ نسب (نسبتیں) کیا ہیں۔\n\nانہی میں میرا الوجود (ہستی) درست ہوا اور انہی کے ذریعے\nکون (کائنات) کے لیے اللہ کی طرف سے نسب (نسبت) درست ہوئی۔\n\nپس اس کا شکر ہے اس پر جو اس نے مجھے خاص کیا\nنسب (نسبتوں) کی معرفتوں کے احسان کے طور پر۔\n\nپس انہی کے ذریعے ہم میں سعادت درست ہوئی\nاور انہی کے ذریعے بدبخت کے لیے شقاوت (بدبختی) درست ہوئی۔\n\nوہ الوجود (ہستی) کے حکم سے معدوم ہوا اور اس میں تعجب ظاہر کیا\nکہ وہ کیسے نہیں چاہتا۔\n\nپس وہی ایجاد کرنے والا ہے، ہم پر اثر انداز ہونے والا ہے\nاور وہی الحق (ذات حق) ہے، اس میں کوئی شک نہیں۔\n\nپس اللہ تمام جہانوں سے بے نیاز ہے، اور غنی (بے نیازی) تنزیہ کی صفت ہے۔ اور ہمارے نزدیک الحق (ذات حق) کے حق میں سب سے بڑی تعریف اللہ تعالیٰ کا یہ قول ہے: (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ) \"اس جیسی کوئی چیز نہیں ہے\"۔ خواہ کاف (ک) صفت کے لیے ہو یا زائد ہو۔ اور قرآن جس زبان میں نازل ہوا ہے، اس کے عالم کے نزدیک کاف کا صفت کے لیے ہونا تعریف میں زیادہ بلیغ ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم اپنی دعا اور اپنے رب عزوجل کی تعریف میں فرماتے ہیں: (لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ) \"میں آپ کی تعریف کا احاطہ نہیں کر سکتا، آپ ویسے ہی ہیں جیسے آپ نے اپنی تعریف خود کی ہے\"۔\n\nآپ کا مطلب اللہ تعالیٰ کا یہ قول ہے: (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ) \"اس جیسی کوئی چیز نہیں ہے\"۔ اور صدیق اکبر رضی اللہ عنہ نے فرمایا: \"ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے\"۔ اور الحق (ذات حق) سبحانہ نے اپنی تعریف نفیِ مثل سے بڑھ کر کسی چیز سے نہیں کی، پس وہ پاک ہے، اس کا کوئی مثل نہیں۔ اور اسی لیے اس نے عالم کے حق میں، اس حیثیت سے کہ وہ ناطق ہے، فرمایا: (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ) \"اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے\"۔ اور تسبیح تنزیہ ہے۔ پس جب تم عالم کو الوجود (ہستی) میں اللہ تعالیٰ کی طرف منسوب کرتے ہو اور کہتے ہو کہ وہ عالم کا موجد ہے، تو تم اس کو عقل میں نہیں لا سکتے مگر ان نسب (نسبتوں) کے ذریعے جنہیں تم ثابت کرتے ہو، جیسے حیات، علم، قدرت اور ارادہ۔ یہ عقل کی نظر کی حد ہے۔ اور شرع سے یہ ثابت ہوتا ہے کہ وہ قائل (بولنے والا) ہے۔ پس اگر یہ صفات ذات پر زائد اعیان (حقیقتیں) ہیں، تو اس نے ان کے ذریعے کسی چیز کو وجود نہیں بخشا مگر اس چیز کے تعلق سے جو حادث ہوئی، اور تعلق ان صفات کی متعلق سے نسبت ہے۔ اور اگر یہ صفات زائد نہیں ہیں، بلکہ وہاں ایک ہی عین (حقیقت) ہے اور وہ ذات ہے، اور ممکنات کو ایجاد کرنے پر اس کی توجہات (توجهات) ہیں، تو توجہات (توجهات) نسب (نسبتیں) ہیں، اور وہ مختلف ہیں اس اختلاف کی وجہ سے جو عالم میں ظاہر ہوتا ہے، جو ان پر ہمارے حکم کی دلیل ہے۔ پس بہر حال وہ نسب (نسبتوں) سے خالی نہیں ہیں، اور وہ عقائد میں اور علماء کے نفوس میں ثابت ہیں، خواہ وہ کوئی بھی ہوں۔\n\nایک حدیث وارد ہوئی ہے\nنبی مصطفیٰ صلی اللہ علیہ وسلم سے۔\n\nکہ جس نے ان کی مخالفت کی\nاپنے عقیدے میں، وہ کنارے پر ہے۔\n\nاور اس کی بیماری کے لیے\nکوئی شفا اور صحت نہیں ہے۔\n\nمگر جب وہ ان کے امر میں موافقت کرے\nاور پھر وفا کرے۔\n\nہر اس چیز کے ساتھ جس کا اس نے اسے مخاطب کیا\nاور اگر وہ پھسل جائے تو معاف کر دے۔\n\nاسے وہ ذات جس نے اسے مکلف کیا\nاور وہ الٰہ (معبود) ہے، اور یہی کافی ہے۔\n\nاور یہ تمام قول صحیح ہے۔ پس کیا مناسب معلومات الحق (ذات حق) کی جانب سے اور مخلوق کی جانب سے حاصل ہوئیں؟ پس چیزیں نسب (نسبتوں) کے ذریعے ایجاد ہوئیں اور نسب (نسبتوں) کے ذریعے قبول کی گئیں۔ اور جو کچھ ہم نے ذکر کیا ہے اس سے زیادہ واضح کچھ نہیں ہو سکتا۔ اور اللہ الحق (ذات حق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "«باب سیصد و نود و سوم در معرفت منزلت کسی که نزد آنچه دیده توقف کند، زیرا آنچه در آنجاست او را به هلاکت می‌اندازد.»\n\nآفرینش (الخلق) تقدیر است و نه موجودی قائم به ذات *** و مبدعات (المبدعات) آنهایی هستند که تکوّن می‌یابند.\n\nروح و کلمات یک چیز واحدند *** و حق (الحق) در آن است که تعین می‌یابد.\nپس عالم نحریر (بسیار دانا) در حال خود ثابت نیست *** و مقام او رنگارنگ می‌شود.\n\nاز این رو به هر چیز خلقتش را عطا کرد *** و این مقدار برای کلام اوست، پس دریابید.\n\nاگر عین کلام، هستی (وجود) ما نبود *** از آن بهره نمی‌بردیم و چشم‌ها لذت نمی‌بردند.\n\nدل‌های ما به فنون اسماء الهی *** و توجهات حق (الحق) در من متنوع می‌شوند.\n\nپس اگر صاحب فهم و تحقیق باشی *** به تمام آنچه آورده‌ایم یقین پیدا می‌کنی.\n\n### [درباره اینکه خداوند متعال نشأت انسانی را سامان داد]\n\nبدان – خداوند ما و تو را یاری کند – که چون خداوند متعال نشأت انسانی، بلکه تمامی آنچه را که از اجسام عالم طبیعی و عنصری ایجاد کرده بود، سامان داد و آن را بر ترتیبی که حکمت در هر جسمی اقتضا می‌کند، تعدیل نمود و آن را برای پذیرش آنچه می‌خواهد در دمیدن روح الهی به آن ببخشد، آماده ساخت، «از روح خود در آن دمید» (نَفَخَ فِيهِ من رُوحِهِ). در آن هنگام، نفسی مدبر برای آن هیکل (کالبد) در آن ظاهر شد و به صورت مزاج آن هیکل درآمد. پس نفوس متفاوت شدند، همان‌گونه که مزاج‌ها متفاوت شدند؛ مانند نور خورشید که در رنگ‌های مختلف شیشه می‌تابد و نورهایی با رنگ‌های گوناگون از سرخ و زرد و آبی و غیره، بسته به رنگ شیشه، در چشم بیننده ایجاد می‌کند. این اختلاف در نوری که در آن پدید آمد، جز از محل (مکان) نبود و هیچ جزئی از آن در ذات خود از دیگری متمایز نشد مگر به واسطه محل. پس محل، عین آن است و محل، غیر آن است. نفوس مدبر برای هیکل‌های طبیعی و عنصری نیز چنین هستند.\n\nپس نفوس به حکم تدبیر، در هیکل‌ها اثر می‌گذارند و هیکل‌ها از تدبیر این نفوس جز به اندازه استعداد خود نمی‌پذیرند. و هیکل‌ها نیز بر نفوس اثر می‌گذارند، بر اساس مزاج‌هایشان در اصل ظهورشان هنگام تعین یافتن. پس برخی از آن‌ها باهوش و برخی کندذهن هستند، بسته به مزاج هیکل. پس امر میان آن دو شگفت‌انگیز است، زیرا هر یک از آن دو در دیگری که بر آن تأثیر می‌گذارد، مؤثر است. سپس خداوند دیدگان بیشتر جنس انس و جن را از درک نفوس مدبر ناطقی که برای آنچه جماد، نبات و حیوان نامیده می‌شود، پوشاند و برای برخی از مردم آن را آشکار ساخت. دلیل نقلی (السمعی) بر آنچه گفتیم، سخن خداوند است: «و همانا برخی از آن‌ها [یعنی از سنگ‌ها] از ترس خدا فرو می‌افتند» (وَإِنَّ مِنْها يَعْنِي مِنَ الْحِجارَةِ لَما يَهْبِطُ مِنْ خَشْيَةِ اللَّهِ). پس آن را به خشیت (ترس) توصیف کرد.\n\nاما امثال ما نیازی به خبر در این باره ندارند، زیرا خداوند آن را به صورت عینی برای ما آشکار ساخته و تسبیح و نطق آن‌ها را به ما شنوانده است. سپاس از آنِ خداوند است بر این امر. همچنین متلاشی شدن کوه به هنگام تجلی (التجلی) پروردگار بر آن؛ اگر عظمت پروردگارش در ذات کوه نبود، به خاطر تجلی او متلاشی نمی‌شد. زیرا ذات‌ها در امثال خود تأثیر نمی‌گذارند، بلکه آنچه در اشیاء تأثیر می‌گذارد، قدر و منزلت آن در نفس کسی است که بر او تأثیر گذاشته می‌شود. پس علم او به قدر آن متجلی (المتجلی) در او تأثیر گذاشت، آنچه که بر او ظاهر شد. ما می‌بینیم که اگر پادشاه در هیئت مردم عادی وارد شود و در بازار میان مردم راه برود، در حالی که او را نمی‌شناسند، در نفوس آن‌ها وزنی ندارد. اما اگر در آن حال کسی که او را می‌شناسد با او ملاقات کند، عظمت و قدر او در نفسش برپا می‌شود و علم او به پادشاه در او تأثیر می‌گذارد، پس او را احترام می‌کند و ادب می‌ورزد و برایش سجده می‌کند. اگر مردمی که نزدیکی آن عالم را به پادشاه می‌دانند و می‌بینند که منزلت او اقتضا نمی‌کند که چنین فعلی از او سر بزند مگر در حضور پادشاه، متوجه شوند که او پادشاه است، دیده‌ها به سوی او متمایل می‌شود، صداها فرو می‌افتد، برایش جا باز می‌کنند و برای دیدن و احترام او شتاب می‌ورزند. آیا این تأثیر نزد آن‌ها جز به واسطه علمی است که در وجودشان نسبت به او قائم شده است؟ آن‌ها او را به خاطر صورتش احترام نکردند، زیرا صورتش برایشان مشهود بود در حالی که نمی‌دانستند او پادشاه است. و پادشاه بودن او عین صورتش نیست، بلکه مرتبه‌ای نسبی است که به او قدرت تسلط بر عالمی را که تحت بیعت اوست، بخشیده است.\n\nدر خبری که ابونعیم حافظ در *دلائل النبوة* در برخی از معراج‌های رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نقل کرده، آمده است که ایشان فرمودند: شبی جبرئیل (علیه السلام) نزد او آمد و درختی همراه داشت که در آن دو آشیانه پرنده بود. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در یکی از آشیانه‌ها نشست و جبرئیل (علیه السلام) در آشیانه دیگر نشست. سپس آن درخت با آن‌ها بالا رفت تا به آسمان رسیدند. در آنجا رفرفی (بستری) از دُرّ و یاقوت به سوی آن‌ها آویزان شد. اما محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نمی‌دانست آن چیست، پس در او تأثیری نگذاشت. اما جبرئیل (علیه السلام) هنگامی که آن را دید، غش کرد. پس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «پس دانستم که برتری او بر من در علم است.»\n\nزیرا او آنچه را دید، می‌دانست، پس علمش به آنچه دید، باعث غش او شد. اما رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را نمی‌دانست، پس اثری در او دیده نشد. بنابراین، در اشیاء تأثیر نمی‌گذارد مگر آنچه در آن‌ها قائم شده باشد، و آن چیزی جز علم نیست. آیا نمی‌بینی که دو نفر قرآن می‌خوانند، یکی خاشع می‌شود و می‌گرید، در حالی که دیگری هیچ خبری از آن ندارد و در او تأثیری نمی‌گذارد؟ آیا این جز از اثر علم قائم در اوست نسبت به آنچه آن آیه بر آن دلالت دارد و شهود (الشهود) او نسبت به امری که آیه دربردارد و او را به گریه و خشوع واداشته است؟ و دیگری نسبت به آن معانی کور است، قرآن از حنجره‌اش فراتر نمی‌رود و تلاوتش در او اثری ندارد. پس تأثیر از صورت لفظ آیه نیست، بلکه تأثیر از چیزی است که در نفس عالم به آن آیه قائم شده و شاهد (المشاهد) چیزی است که آیه برای آن نازل شده است. پس در تو تأثیر نمی‌گذارد مگر آنچه در تو قائم شده باشد، از حیث آنچه می‌دانی و شهود می‌کنی. اگر علم او به آن امر نبود، او را به وحشت نمی‌انداخت. و اگر کوچ نکند و نزد آنچه دیده توقف کند، در حالی که آن امر او را به وحشت انداخته است، به ناچار هلاک می‌شود؛ یعنی از صواب و حس خود غایب می‌شود، یا مبهوت می‌گردد، یا غش می‌کند، یا از ترس آن می‌میرد، به اندازه قوت یا ضعف آن تالی (پیرو). این همان چیزی است که در نفس او حاصل شده است، و «در صور دمیده می‌شود، پس هر که در آسمان‌ها و هر که در زمین است، بیهوش می‌افتد، مگر کسی که خدا بخواهد» (وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّماواتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شاءَ اللَّهُ). این امری اضافی (نسبی) است. ممکن است امری نزد زید هولناک‌تر از عمرو باشد، و ممکن است نزد عمرو امر دیگری هولناک‌تر از زید باشد. پس این اهوال در هر یک از آن‌ها تأثیر می‌گذارد، به طوری که هر یک از آن‌ها درباره دیگری می‌گوید: «تعجب می‌کنم از فلانی، چه دیده که این‌گونه در او تأثیر گذاشته است؟ اگر می‌دانست آنچه نزد من است و او به آن توجهی نکرده، چه می‌کرد؟» هر دوی آن‌ها این سخن را می‌گویند، و عالم کامل سوم خلاف قول آن دو را می‌گوید و سبب مؤثر در هر یک از آن‌ها را می‌داند و از نفوس آن‌ها چیزی را می‌داند که خودشان نمی‌دانند. پس منزه است خداوند حکم عادل، که اشیاء را در منازلشان قرار می‌دهد و مراتب را برای اهلش تعیین می‌کند.\n\nپس اگر این را دانستی، علمی غریب را دریافته‌ای که شگفتیِ شگفتی‌هاست و حاوی رازی است که آشکار کردنش ممکن نیست و نباید به آن تصریح کرد، زیرا خداوند بر بنده غیرت می‌ورزد که چنین چیزی را آشکار سازد. این امری است که هستی (الوجود) آن را اقتضا می‌کند و فایده‌ای عظیم دارد. عالم جز به واسطه نسبت‌ها (النسب) ظاهر نشده است و پذیرش از سوی عالم نسبت به آنچه از عالم پذیرفته است نیز جز به واسطه نسبت‌ها حاصل نشده است. پس ایجادکننده به واسطه نسبت‌هاست و پذیرنده نیز به واسطه نسبت‌هاست. پس حکم از آنِ نسبت‌هاست، و تو می‌دانی که نسبت‌ها چه هستند.\n\nبه واسطه آن‌ها هستی (وجود) من صحیح شد *** و به واسطه آن‌ها برای کَوْن، نسبتی از جانب خدا صحیح شد.\n\nپس شکر از آنِ اوست بر آنچه مرا به آن اختصاص داد *** به عنوان منتی از معارف نسبت‌ها.\n\nپس به واسطه آن‌ها سعادت در ما صحیح شد *** و به واسطه آن‌ها شقاوت برای شقی صحیح شد.\n\nبه حکم هستی (الوجود) معدوم شد و شگفتی را آشکار ساخت *** که چگونه اراده نمی‌کند.\n\nپس اوست ایجادکننده و مؤثر در ما *** و او حق (الحق) است و در آن شکی نیست.\n\nپس خداوند از جهانیان بی‌نیاز است (غنی عن العالمین)، و غنی صفتی تنزیهی است. و بزرگترین ستایش نزد ما در حق حق (الحق)، سخن خداوند متعال است: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)، چه کاف (در کمثله) برای صفت باشد و چه زائد باشد. و نزد کسی که به زبانی که قرآن به آن نازل شده عالم است، صفت بودن آن کاف در ستایش بلیغ‌تر است.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در دعا و ستایش پروردگار عزوجل می‌فرماید: «من نمی‌توانم ثنای تو را بشمارم، تو همان‌گونه‌ای که خودت بر خود ثنا گفته‌ای.» (لا أحصي ثناء عليك أنت كما أثنيت على نفسك)\n\nمنظور ایشان سخن خداوند متعال است: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ). و صدیق اکبر (رضی الله عنه) فرمود: «ناتوانی از درکِ ادراک، خود ادراک است.» و حق (الحق) سبحانه خود را به چیزی بزرگتر از نفی مِثل ستایش نکرده است، پس او را مِثلی نیست، سبحانه. و به همین دلیل در حق عالم از آن جهت که ناطق است، فرمود: «و هیچ چیز نیست مگر اینکه با ستایش او تسبیح می‌گوید» (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ). و تسبیح، تنزیه است. پس اگر عالم را در هستی (الوجود) به او تعالی نسبت دهی و بگویی که او ایجادکننده عالم است، نمی‌توانی این را تعقل کنی مگر به واسطه نسبت‌هایی که آن‌ها را ثابت می‌کنی، از قبیل حیات، علم، قدرت و اراده. این حد نظر عقل است. و به واسطه شرع ثابت می‌شود که او (عالم) قائل است. پس اگر این‌ها اعیانی زائد بر ذات باشند، خداوند چیزی را به واسطه آن‌ها ایجاد نکرده است مگر از طریق تعلقی به آنچه حادث شده است، و تعلق، نسبتی از آن‌ها به متعلق است. و اگر این صفات زائد نباشند، بلکه تنها یک عین وجود داشته باشد که همان ذات است و توجهات آن بر ایجاد ممکنات باشد، پس این توجهات، نسبت‌هایی هستند و به دلیل اختلافی که در عالم ظاهر می‌شود و دلیل بر حکم ما به آن‌هاست، متفاوتند. پس در هر حال، این‌ها از نسبت‌ها خارج نیستند و این نسبت‌ها در عقاید و در نفوس علما، هر که باشند، ثابت هستند.\n\nحدیثی وارد شده است *** از پیامبر مصطفی (صَلَّى اللهُ عَليهِ وسَلَّم).\n\nکه هر کس با او مخالفت کند *** در عقیده‌اش بر لبه پرتگاه است.\n\nو برای بیماری او *** بهبودی و شفایی نیست.\n\nمگر اینکه با او موافقت کند *** در امرش و سپس وفا کند.\n\nبه هر آنچه او را مخاطب قرار داد *** و اگر لغزید، می‌بخشد.\n\nاز او، آن کس که او را مکلف ساخت *** و او خداست و کافی است.\n\nو این سخن تماماً صحیح است. آیا در معلومات، مناسب‌ترین چیز از جانب حق (الحق) و از جانب مخلوق حاصل شده است؟ پس به واسطه نسبت‌ها ایجاد شد و به واسطه نسبت‌ها پذیرفته شد. و واضح‌تر از این که ذکر کردیم، چیزی نخواهد بود. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}