{
  "id": 50,
  "title": {
    "ar": "الباب الخمسون في معرفة رجال الحيرة والعجز",
    "en": "Chapter Fifty: On the Knowledge (Ma'rifa) of the Spiritual Men (Rijāl) of Bewilderment (Ḥayra) and Incapacity ('Ajz)",
    "ur": "پچاسواں باب: حیرت اور عجز کے حاملین (رجال الحيرة والعجز) کی معرفت میں",
    "fa": "باب پنجاهم در معرفت مردان حیرت و عجز"
  },
  "content": {
    "ar": "## (الباب الخمسون في معرفة رجال الحيرة والعجز)\n\n\n> من قال يعلم أن الله خالقه *** ولم يحركان برهانا بأن جهلا\n\n\n> لا يعلم الله إلا الله فانتبهوا *** فليس حاضركم مثل الذي غفلا\n\n\n> العجز عن درك الإدراك معرفة *** كذا هو الحكم فيه عند من عقلا\n\n\n> هو الإله فلا تحصى محامده *** هو النزيه فلا تضرب له مثلا\n\n\n### [سبب الحيرة في المعرفة الإلهية]\n\n\nاعلم أيدك الله بروح منه أن سبب الحيرة في علمنا بالله طلبنا معرفة ذاته جل وتعالى بأحد الطريقين إما بطريق الأدلة العقلية وإما بطريق تسمى المشاهدة فالدليل العقلي يمنع من المشاهدة والدليل السمعي قد أومأ إليها وما صرح والدليل العقلي قد منع من إدراك حقيقة ذاته من طريق الصفة الثبوتية النفسية التي هو سبحانه في نفسه عليها وما أدرك العقل بنظره إلا صفات السلوب لا غير وسمي هذا معرفة والشارع قد نسب إلى نفسه أمورا وصف نفسه بها تحيلها الأدلة العقلية إلا بتأويل بعيد يمكن أن يكون مقصودا للشارع ويمكن أن لا يكون وقد لزمه الايمان والتصديق بما وصف به نفسه لقيام الأدلة عنده بصدق هذه الأخبار عنه إنه أخبر بها عن نفسه في كتبه أو على ألسنة رسله فتعارض هذه الأمور\nمع طلبه معرفة ذاته تعالى أو الجمع بين الدليلين المتعارضين أوقعهم في الحيرة\n\n\n### [أهل الحيرة هم أرباب المعرفة الحقة]\n\n\nفرجال الحيرة هم الذين نظروا في هذه الدلائل واستقصوها غاية الاستقصاء إلى أن أداهم ذلك النظر إلى العجز والحيرة فيه من نبي أو صديق‏\n\n\nقال صلى الله عليه وسلم اللهم زدني فيك تحيرا\n\n\nفإنه كلما زاده الحق علما به زاده ذلك العلم حيرة ولا سيما أهل الكشف لاختلاف الصور عليهم عند الشهود فهم أعظم حيرة من أصحاب النظر في الأدلة بما لا يتقارب‏\n\n\nقال النبي صلى الله عليه وسلم بعد ما بذل جهده في الثناء على خالقه بما أوحى به إليه لا أحصي ثناء عليك أنت كما أثنيت على نفسك‏\n\n\nوقال أبو بكر الصديق رضي الله عنه في هذا المقام وكان من رجاله العجز عن درك الإدراك إدراك أي إذا علمت إن ثم من لا يعلم ذلك هو العلم بالله تعالى فكان الدليل على العلم به عدم العلم به والله قد أمرنا بالعلم بتوحيده وما أمرنا بالعلم بذاته بل نهى عن ذلك بقوله ويُحَذِّرُكُمُ الله نَفْسَهُ ونهى رسول الله صلى الله عليه وسلم عن التفكر في ذات الله تعالى‏\n\n\nإذ من لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ كيف يوصل إلى معرفة ذاته فقال الله تعالى آمرا بالعلم بتوحيده فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله فالمعرفة به من كونه إلها والمعرفة بما ينبغي للاله أن يكون عليه من الصفات التي يمتاز بها عن من ليس بإله وعن المألوه هي المأمور بها شرعا فلا يعرف الله إلا الله‏\n\n\n### [طرق المعرفة الإلهية: العقل والنقل والكشف‏]\n\n\nفقامت الأدلة العقلية القاطعة على أنه إله واحد عند أهل النظر وأهل الكشف فلا إله إلا هو ثم بعد هذا الدليل العقلي على توحيده والعلم الضروري العقلي بوجوده ورأينا أهل طريق الله تعالى من رسول ونبي وولي قد جاءوا بأمور من المعرفة بنعوت الإله في طريقهم إحالتها الأدلة العقلية وجاءت بصحتها الألفاظ النبوية والأخبار الإلهية فبحث أهل الطريق عن هذه المعاني ليحصلوا منها على أمر يتميزون به عن أهل النظر الذين وقفوا حيث بلغت بهم أفكارهم مع تحققهم صدق الأخبار فقالوا نعلم أن ثم طورا آخر وراء طور إدراك العقل الذي يستقل به وهو للأنبياء وكبار الأولياء به يقبلون هذه الأمور الواردة عليهم في الجناب الإلهي فعملت هذه الطائفة في تحصيل ذلك بطريق الخلوات والأذكار المشروعة لصفاء القلوب وطهارتها من دنس الفكر إذ كان المفكر لا يفكر إلا في المحدثات لا في ذات الحق وما ينبغي أن يكون عليه في نفسه الذي هو مسمى الله ولم يجد صفة إثبات نفسية فأخذ ينظر في كل صفة يمكن أن يقبلها المحدث الممكن يسلبها عن الله لئلا يلزمه حكم تلك الصفة كما لزمت الممكن الحادث مثل ما فعل بعض النظار من المتكلمين في أمور أثبتوها وطردوها شاهدا وغائبا ويستحيل على ذات الحق أن تجتمع مع الممكن في صفة فإن كل صفة يتصف بها الممكن يزول وجودها بزوال الموصوف بها أو تزول هي مع بقاء الممكن كصفات المعاني والأولى كصفات النفس ثم إن كل صفة منها ممكنة فإذا طردوها شاهدا وغائبا فقد وصفوا واجب الوجود لنفسه بما هو ممكن لنفسه والواجب الوجود لنفسه لا يقبل ما يمكن أن يكون ويمكن أن لا يكون فإذا بطل الاتصاف به من حيث حقيقة ذلك الوصف لم يبق إلا الاشتراك في اللفظ إذ قد بطل الاشتراك في الحد والحقيقة فلا يجمع صفة الحق وصفة العبد حد واحد أصلا فاذن بطل طرد ما قالوه وطردوه شاهدا وغائبا فلم يكن قولنا في الله إنه عالم على حد ما نقول في الممكن الحادث إنه عالم من طريق حد العلم وحقيقته فإن نسبة العلم إلى الله تخالف نسبة العلم إلى الخلق الممكن ولو كان عين العلم القديم هو عين العلم المحدث لجمعهما حد واحد ذاتي أعني العلمين واستحال عليه ما يستحيل على مثله من حيث ذاته ووجدنا الأمر على خلاف ذلك‏\n\n\n### [وسائل الصوفية في تحصيل المعرفة الإلهية]\n\n\nفتعملت هذه الطائفة في تحصيل شي‏ء مما وردت به الأخبار الإلهية من جانب الحق وشرعت في صقالة قلوبها بالأذكار وتلاوة القرآن وتفريغ المحل من النظر في الممكنات والحضور والمراقبة مع طهارة الظاهر بالوقوف عند الحدود المشروعة من غض البصر عن الأمور التي نهى أن ينظر إليها من العورات وغيرها وإرساله في الأشياء التي تعطيه الاعتبار والإستبصار وكذلك سمعه ولسانه ويده ورجله وبطنه وفرجه وقلبه وما ثم في ظاهره سوى هذه السبعة والقلب ثامنها ويزيل التفكر عن نفسه جملة واحدة فإنه مفرق لهمه ويعتكف على مراقبة قلبه عند باب ربه عسى الله أن يفتح له الباب إليه ويعلم ما لم يكن يعلم مما علمته الرسل وأهل الله مما لم تستقل العقول بإدراكه وإحالته فإذا فتح الله لصاحب هذا القلب هذا الباب حصل له تجل إلهي أعطاه ذلك التجلي بحسب ما يكون حكمه فينسب إلى الله منه أمرا لم يكن قبل ذلك يجرأ على نسبته إلى الله سبحانه ولا يصفه به إلا قدر ما جاءت به الأنباء الإلهية فيأخذها تقليدا والآن يأخذ ذلك كشفا موافقا\nمؤيدا عنده لما نطقت به الكتب المنزلة وجاء على ألسنة الرسل عليهم السلام فكان يطلقها إيمانا حاكيا من غير تحقيق لمعانيها ولا يزيد عليها والآن يطلق في نفسه عليه تعالى ذلك علما محققا من أجل ذلك الأمر الذي تجلى له فيكون بحسب ما يعطيه ذلك الأمر ويعرف معنى ما يطلقه وما حقيقة ذلك‏\n\n\n### [حيرة أهل الله وحيرة أهل النظر]\n\n\nفيتخيل في أول تجل أنه قد بلغ المقصود وحاز الأمر وأنه ليس وراء ذلك شي‏ء يطلب سوى دوام ذلك فيقوم له تجل آخر بحكم آخر ما هو ذلك الأول والمتجلي واحد لا يشك فيه فيكون حكمه فيه حكم الأول ثم تتوالى عليه التجليات باختلاف أحكامها فيه فيعلم عند ذلك أن الأمر ما له نهاية يوقف عندها ويعلم أن الإنية الإلهية ما أدركها وأن الهوية لا يصح أن تتجلى له وأنها روح كل تجل فيزيد حيرة لكن فيها لذة وهي أعظم من حيرة أصحاب الأفكار بما لا يتقارب فإن أصحاب الأفكار ما برحوا بأفكارهم في الأكوان فلهم أن يحاروا ويعجزوا وهؤلاء ارتفعوا عن الأكوان وما بقي لهم شهود إلا فيه فهو مشهودهم والأمر بهذه المثابة فكانت حيرتهم باختلاف التجليات أشد من حيرة النظار في معارضات الدلالات عليه‏\n\n\nفقوله صلى الله عليه وسلم أو قول من يقول من هذا المقام زدني فيك تحيرا\n\n\nطلب لتوالي التجليات عليه فهذا الفرق بين حيرة أهل الله وحيرة أهل النظر فصاحب العقل ينشد\n\n\n> وفي كل شي‏ء له آية *** تدل على أنه واحد\n\n\n> وصاحب التجلي ينشد قولنا في ذلك *** وفي كل شي‏ء له آية\n\n\nتدل على أنه عينه‏\n\n\nفبينهما ما بين كلمتيهما\n\n\n### [شطحات الصوفية وموقف الفقهاء وأولى الأمر منها]\n\n\nفما في الوجود إلا الله ولا يعرف الله إلا الله ومن هذه الحقيقة قال من قال أنا الله كأبي يزيد وسبحاني كغيره من رجال الله المتقدمين وهي من بعض تخريجات أقوالهم رضي الله عنهم فمن وصل إلى الحيرة من الفريقين فقد وصل غير أن أصحابنا اليوم يجدون غاية الألم حيث لا يقدرون يرسلون ما ينبغي أن يرسل عليه سبحانه كما أرسلت الأنبياء عليهم السلام فما أعظم تلك التجليات وإنما منعهم أن يطلقوا عليه ما أطلقت الكتب المنزلة والرسل عليهم السلام عدم إنصاف السامعين من الفقهاء وأولي الأمر لما يسارعون إليه في تكفير من يأتي بمثل ما جاءت به الأنبياء عليهم السلام في جنب الله وتركوا معنى قوله تعالى لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ كما قال له صلى الله عليه وسلم ربه عز وجل عند ذكره الأنبياء والرسل عليهم السلام أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ فأغلق الفقهاء هذا الباب من أجل المدعين الكاذبين في دعواهم ونعم ما فعلوا وما على الصادقين في هذا من ضرر لأن الكلام والعبارة عن مثل هذا ما هو ضربة لازب وفي ما ورد عن رسول الله صلى الله عليه وسلم في ذلك كفاية لهم فيوردونها يستريحون إليها من تعجب وفرح وضحك وتبشش ونزول ومعية ومحبة وشوق وما أشبه ذلك مما لو انفرد بالعبارة عنه الولي كفر وربما قتل وأكثر علماء الرسوم عدموا علم ذلك ذوقا وشربا فأنكروا مثل هذا من العارفين حسدا من عند أنفسهم إذ لو استحال إطلاق مثل هذا على الله تعالى ما أطلقه على نفسه ولا أطلقته رسله عليهم السلام عليه ومنعهم الحسد أن يعلموا أن ذلك رد على كتاب الله وتحجير على رحمة الله أن تنال بعض عباد الله وأكثر العامة تابعون للفقهاء في هذا الإنكار تقليدا لهم لا بل بحمد الله أقل العامة وأما الملوك فالغالب عليهم عدم الوصول إلى مشاهدة هذه الحقائق لشغلهم بما دفعوا إليه فساعدوا علماء الرسوم فيما ذهبوا إليه إلا القليل منهم فإنهم اتهموا علماء الرسوم في ذلك لما رأوه من انكبابهم على حطام الدنيا وهم في غنى عنه وحب الجاه والرئاسة وتمشية أغراض الملوك فيما لا يجوز وبقي العلماء بالله تحت ذل العجز والحصر معهم كرسول كذبه قومه وما آمن به واحد منهم ولم يزل رسول الله صلى الله عليه وسلم يحرس حتى نزل والله يَعْصِمُكَ من النَّاسِ فانظر ما يقاسيه في نفسه العالم بالله فسبحان من أعمى بصائرهم حيث أسلموا وسلموا وآمنوا بما به كفروا فالله يجعلنا ممن عرف الرجال بالحق لا ممن عرف الحق بالرجال والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Fifty: Concerning the Knowledge of the People of Bewilderment and Incapacity\n\n> Whoever claims to know that God is his Creator, *** yet offers no proof, is surely ignorant.\n> None knows God save God, so be vigilant; *** for your state of presence is not like that of the heedless one.\n> Incapacity to grasp the grasp is Gnosis (معرفة); *** such is the judgment concerning it among those who possess intellect.\n> He is the God (الإله), so His praises cannot be enumerated; *** He is the Transcendent (النزيه), so do not strike a likeness for Him.\n\n### The Cause of Bewilderment in Divine Gnosis\n\nKnow, may God strengthen you with a spirit from Him, that the cause of bewilderment (الحيرة) in our knowledge (علم) of God lies in our seeking knowledge of His Essence (ذاته), exalted and sublime, through one of two paths: either by way of rational proofs (الأدلة العقلية) or by a path called Witnessing (المشاهدة).\n\nThe rational proof prevents Witnessing, and the transmitted proof (الدليل السمعي) has alluded to it but has not explicitly stated it. The rational proof has prevented the realization of the reality of His Essence (حقيقة ذاته) through the self-subsistent affirmative Attribute (الصفة الثبوتية النفسية) upon which He, the Glorified, subsists in Himself. The intellect, through its contemplation, has only grasped the attributes of negation (صفات السلوب) and nothing else, and this is called Gnosis (معرفة).\n\nThe Lawgiver (الشارع) has attributed matters to Himself and described Himself with attributes that rational proofs deem impossible except through a far-fetched interpretation (تأويل بعيد), which may or may not have been intended by the Lawgiver. Yet, belief and affirmation of what He described Himself with are incumbent upon the seeker, because proofs establish the veracity of these reports about Him—that He reported them about Himself in His Books or through the tongues of His Messengers. The conflict between these matters and the seeker's demand for knowledge of His exalted Essence, or the attempt to reconcile the two conflicting proofs, is what casts them into bewilderment.\n\n### The People of Bewilderment are the Masters of True Gnosis\n\nThe people of bewilderment (رجال الحيرة) are those who have contemplated these proofs and exhausted them to the utmost degree, until that contemplation led them to incapacity (العجز) and bewilderment concerning Him, whether they be a Prophet or a Veracious One (صديق).\n\nThe Prophet (peace and blessings be upon him) said: \"O God, increase my bewilderment concerning You.\"\n\nFor every time the Real (الحق) increases his knowledge of Him, that knowledge increases his bewilderment, especially for the People of Unveiling (أهل الكشف), due to the variation of forms that appear to them during Witnessing (الشهود). They are therefore in a state of bewilderment incomparably greater than the people of rational contemplation (أصحاب النظر).\n\nThe Prophet (peace and blessings be upon him), after exerting his utmost in praising his Creator with what was revealed to him, said: \"I cannot enumerate Your praise; You are as You have praised Yourself.\"\n\nAbu Bakr al-Siddiq (may God be pleased with him) said concerning this station, and he was one of its people: \"Incapacity to grasp the grasp is Gnosis (إدراك).\" That is, when you know that there is That which cannot be known, that is the Knowledge of God Almighty. Thus, the proof of knowing Him is the absence of knowing Him.\n\nGod has commanded us to know His Unity (توحيده), but He has not commanded us to know His Essence (ذاته); rather, He forbade it by His saying: <<وَيُحَذِّرُكُمُ الله نَفْسَهُ>> (And Allah warns you of Himself). And the Messenger of God (peace and blessings be upon him) forbade contemplation of the Essence of God Almighty.\n\nSince <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing whatever like unto Him), how can one reach the knowledge of His Essence? God Almighty said, commanding knowledge of His Unity: <<فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله>> (So know that there is no god but Allah). Therefore, Gnosis (المعرفة) of Him comes from His being God (Ilah), and the knowledge of what is fitting for God to possess in terms of Attributes (الصفات) that distinguish Him from what is not God and from the worshipped (al-Ma'luh)—this is what is commanded by the Law. Thus, none knows God save God.\n\n### The Paths of Divine Gnosis: Reason, Transmission, and Unveiling\n\nDecisive rational proofs (الأدلة العقلية القاطعة) established for the people of contemplation (أهل النظر) and the People of Unveiling (أهل الكشف) that He is one God: there is no god but Him.\n\nThen, after this rational proof of His Unity and the necessary rational knowledge of His Existence, we saw the people of God’s Path—Messengers, Prophets, and Saints (ولي)—come with matters concerning the Gnosis of the Divine Attributes (نعوت الإله) in their path, which rational proofs deemed impossible, but which Prophetic expressions and Divine reports affirmed as true.\n\nThe People of the Path (أهل الطريق) searched for these meanings in order to attain something by which they could be distinguished from the people of contemplation, who stopped where their thoughts reached, despite their affirmation of the truth of the reports. They said: \"We know that there is another stage (طور آخر) beyond the stage of rational perception (إدراك العقل) that the intellect achieves independently, and this stage belongs to the Prophets and the great Saints. By this, they accept these matters that come to them from the Divine Presence (الجناب الإلهي).\"\n\nThis group worked to achieve that stage through seclusion (الخلوات) and prescribed litanies (الأذكار المشروعة) for the purification of hearts and their cleansing from the defilement of thought (دنس الفكر), since the thinker only contemplates contingent beings (المحدثات), not the Essence of the Real (ذات الحق) and what is fitting for Him in Himself, which is the designation *Allah*.\n\nSince they found no self-subsistent affirmative attribute, they began to look at every attribute that a contingent possible being (المحدث الممكن) could accept, and they negated it from God, lest the ruling of that attribute be incumbent upon Him, as it is incumbent upon the contingent possible being. This is what some rationalists (النظار) among the theologians (المتكلمين) did regarding matters they affirmed and applied universally to the witnessed and the unseen.\n\nIt is impossible for the Essence of the Real (ذات الحق) to share an attribute with the possible being, for every attribute with which the possible being is described either vanishes when the described subject vanishes, or vanishes while the possible being remains (like the attributes of meaning). The former are like the attributes of the soul. Furthermore, every one of these attributes is possible. If they apply them universally to the witnessed and the unseen, they have described the Necessary Existence by Himself (واجب الوجود لنفسه) with what is possible by itself. The Necessary Existence by Himself does not accept what can be and what cannot be.\n\nIf the description is invalidated from the perspective of the reality of that description, then only the sharing of the *word* remains, since the sharing of the definition (الحد) and the reality (الحقيقة) has been invalidated. The attribute of the Real and the attribute of the servant can never be united by a single definition. Therefore, their universal application is invalid.\n\nThus, our saying that God is Knowing (عالم) is not on the same level as our saying that the contingent being is knowing, in terms of the definition and reality of knowledge. For the relation of knowledge to God differs from the relation of knowledge to the contingent creation. If the Eternal Knowledge were identical to the contingent knowledge, they would be united by a single essential definition (حد واحد ذاتي)—meaning the two knowledges—and what is impossible for its like would be impossible for Him in terms of His Essence. We find the matter to be contrary to this.\n\n### The Means of the Sufis in Attaining Divine Gnosis\n\nThis group worked to attain something of what the Divine reports brought forth from the side of the Real (جانب الحق). They began to polish their hearts (صقالة قلوبها) with litanies (الأذكار), recitation of the Quran, emptying the vessel (تفريغ المحل) of contemplation of contingent beings, and maintaining presence (الحضور) and vigilance (المراقبة). This was coupled with the purity of the outward self by adhering to the prescribed limits (الحدود المشروعة): lowering the gaze from forbidden matters, such as nakedness and other things, and directing it toward things that yield reflection (الاعتبار) and insight (الإستبصار). Likewise for their hearing, tongue, hand, foot, stomach, private parts, and heart. There are only these seven outwardly, and the heart is the eighth.\n\nThey completely remove contemplation (التفكر) from themselves, for it disperses their focus. They devote themselves to watching over their heart at the door of their Lord, hoping that God may open the door to Him and that they may know what they did not know—what the Messengers and the People of God (أهل الله) knew, which intellects could not independently perceive and deemed impossible.\n\nWhen God opens this door for the owner of this heart, a Divine Theophany (تجل إلهي) occurs for him. That Theophany grants him knowledge according to its ruling, and he attributes to God something from it that he previously would not have dared to attribute to God, the Glorified, nor describe Him with, except by way of imitation (تقليدا) of what the Divine reports brought forth.\n\nNow, he takes this knowledge through Unveiling (كشفا), confirming and supporting what the revealed Books proclaimed and what came upon the tongues of the Messengers (peace be upon them). Previously, he would utter these things out of faith, merely reporting without realizing their meanings, and without adding to them. Now, he utters that concerning the Exalted as verified knowledge (علما محققا) because of that matter which was disclosed (تجلى) to him. This knowledge is according to what that matter grants him, and he knows the meaning of what he utters and the reality of that meaning.\n\n### The Bewilderment of the People of God and the Bewilderment of the People of Contemplation\n\nIn the first Theophany, he imagines that he has reached the goal and attained the matter, and that there is nothing further to seek except the permanence of that state. Then, another Theophany occurs for him with a different ruling, which is not the first one, yet the One disclosing Himself (المتجلي) is one, about which there is no doubt. His ruling concerning it is like the first. Then the Theophanies (التجليات) follow one after another, with their rulings differing for him.\n\nAt that point, he knows that the matter has no end at which to stop, and he knows that he has not grasped the Divine I-ness (الإنية الإلهية), and that the He-ness (الهوية) cannot be disclosed to him, and that it is the spirit of every Theophany. Thus, his bewilderment increases, but it is a bewilderment accompanied by delight (لذة), and it is incomparably greater than the bewilderment of the people of thought (أصحاب الأفكار).\n\nThe people of thought have never left the realm of contingent existence (الأكوان) with their thoughts, so they have reason to be bewildered and incapacitated. But these (the People of God) have risen above the contingent existences, and they have no Witnessing (شهود) left except in Him. He is their witnessed object (مشهودهم). Since the matter is of this nature, their bewilderment due to the variation of Theophanies is more intense than the bewilderment of the contemplators due to the contradictions in the proofs concerning Him.\n\nTherefore, his saying (peace and blessings be upon him), or the saying of anyone who speaks from this station, \"Increase my bewilderment concerning You,\" is a request for the continuation of Theophanies upon him.\n\nThis is the difference between the bewilderment of the People of God (أهل الله) and the bewilderment of the people of contemplation (أهل النظر).\n\nThe person of intellect recites:\n> And in everything there is a sign for Him, *** which indicates that He is One.\n\nBut the person of Theophany recites our saying concerning that:\n> And in everything there is a sign for Him, *** which indicates that He is its very Essence (عينه).\n\nThe difference between them is the difference between their two words.\n\n### The Ecstatic Utterances of the Sufis and the Position of the Jurists and Rulers Regarding Them\n\nThere is nothing in Existence (الوجود) but God, and none knows God save God. Based on this Reality (الحقيقة), some have said, \"I am God,\" like Abu Yazid, and \"Glory be to me (Subhani),\" like others among the early People of God (رجال الله), may God be pleased with them. These are some of the derivations of their sayings.\n\nWhoever reaches bewilderment (الحيرة) from either of the two groups has reached the goal. However, our companions today find extreme pain because they cannot utter what ought to be uttered concerning the Glorified, just as the Prophets (peace be upon them) uttered. How magnificent those Theophanies are!\n\nWhat prevents them from uttering concerning Him what the revealed Books and the Messengers (peace be upon them) uttered is the lack of fairness from the listeners—the Jurists (الفقهاء) and the Rulers (أولي الأمر)—who hasten to declare as infidels (تكفير) those who bring forth the like of what the Prophets brought forth concerning God. They abandon the meaning of His saying: <<لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ>> (Indeed, in the Messenger of Allah you have an excellent example), just as his Lord, the Mighty and Majestic, said to him (peace and blessings be upon him) when mentioning the Prophets and Messengers: <<أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided; so follow their guidance).\n\nThe Jurists closed this door because of the false claimants (المدعين الكاذبين), and and they did well in doing so. The truthful ones suffer no harm in this, because speech and expression about such matters are not absolutely necessary (ضربة لازب). What has been transmitted from the Messenger of God (peace and blessings be upon him) concerning this is sufficient for them. They transmit these reports, finding comfort in them—reports of wonder, joy, laughter, cheerfulness, descent, companionship, love, longing, and the like—matters which, if the Saint (الولي) were to express them independently, he would be declared an infidel and perhaps killed.\n\nMost scholars of outward forms (علماء الرسوم) lack the knowledge of this through tasting (ذوقا) and drinking (شربا), so they deny such things from the Gnostics (العارفين) out of envy from their own souls. For if it were impossible to utter such things concerning God Almighty, He would not have uttered them about Himself, nor would His Messengers (peace be upon them) have uttered them concerning Him.\n\nTheir envy prevents them from knowing that this denial is a rejection of the Book of God and a restriction upon the Mercy of God from reaching some of His servants. Most common people follow the Jurists in this denial through imitation (تقليدا)—no, praise be to God, only the lesser part of the common people do so.\n\nAs for the rulers (الملوك), they are generally prevented from reaching the Witnessing of these Realities (مشاهدة هذه الحقائق) due to their preoccupation with what they have been entrusted with. Thus, they support the scholars of outward forms in their views, except for a few of them who suspect the scholars of outward forms because they see their eagerness for the debris of the world (حطام الدنيا)—though they are wealthy—and their love of status and leadership, and their facilitating the rulers' desires in what is impermissible.\n\nThe scholars of God (العلماء بالله) remain under the humiliation of incapacity (العجز) and restriction with them, like a Messenger whose people denied him and none of them believed in him. The Messenger of God (peace and blessings be upon him) continued to be guarded until the verse descended: <<وَالله يَعْصِمُكَ من النَّاسِ>> (And Allah will protect you from the people).\n\nConsider what the Gnostic of God (العالم بالله) endures within himself. Glory be to Him who blinded their insights, even though they submitted (أسلموا), were safe (سلموا), and believed in that by which they committed disbelief (كفروا).\n\nMay God make us among those who know the people by the Real (الحق), not those who know the Real by the people. <<وَالْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (And praise belongs to Allah, Lord of the Worlds). <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## (باب پچاسواں: حیرت اور عجز کے حاملین کی معرفت میں)\n\n> جس نے کہا کہ وہ جانتا ہے کہ اللہ اس کا خالق ہے،\n> اور اس نے کوئی دلیل پیش نہیں کی، تو وہ جہالت میں ہے۔\n>\n> اللہ کو اللہ کے سوا کوئی نہیں جانتا، پس ہوشیار ہو جاؤ!\n> تمہارا حاضر (موجود) ہونا اس شخص جیسا نہیں جو غافل ہے۔\n>\n> ادراک کے ادراک سے عاجز ہونا ہی معرفت (المعرفۃ) ہے،\n> عقلمندوں کے نزدیک اس کا یہی حکم ہے۔\n>\n> وہ معبود ہے، پس اس کی تعریفیں شمار نہیں کی جا سکتیں؛\n> وہ پاک ہے، پس اس کے لیے کوئی مثال نہ دو۔\n\n### [معرفت الٰہیہ میں حیرت کا سبب]\n\nجان لو، اللہ تمہیں اپنی روح سے تائید بخشے، کہ اللہ کے بارے میں ہمارے علم میں حیرت (الحیرۃ) کا سبب یہ ہے کہ ہم اس کی ذات جل و تعالیٰ کی معرفت (المعرفۃ) دو طریقوں میں سے کسی ایک کے ذریعے طلب کرتے ہیں: یا تو عقلی دلائل (الأدلۃ العقلیۃ) کے ذریعے، یا اس طریقے کے ذریعے جسے مشاہدہ (المشاھدۃ) کہا جاتا ہے۔ عقلی دلیل مشاہدہ (المشاھدۃ) سے روکتی ہے، اور سمعی دلیل نے اس کی طرف اشارہ کیا ہے مگر صراحت نہیں کی۔ اور عقلی دلیل نے اس کی ذات کی حقیقت کے ادراک سے اس صفات ثبوتیہ نفسیہ کے ذریعے منع کیا ہے جس پر وہ سبحانہ اپنی ذات میں قائم ہے، اور عقل نے اپنے غور و فکر سے صرف صفات سلوب (نفی کی صفات) کا ہی ادراک کیا ہے، اور اسی کو معرفت (المعرفۃ) کا نام دیا گیا ہے۔\n\nاور شارع (شریعت ساز) نے اپنی ذات کی طرف ایسے امور منسوب کیے ہیں اور اپنی ذات کو ان سے متصف کیا ہے جنہیں عقلی دلائل محال قرار دیتے ہیں، سوائے اس کے کہ کوئی بعید تاویل کی جائے جو شارع کا مقصود ہو بھی سکتی ہے اور نہیں بھی۔ اور اس پر ایمان لانا اور اس کی تصدیق کرنا لازم ہے جس سے اس نے اپنی ذات کو متصف کیا ہے، کیونکہ اس کے پاس ان خبروں کی سچائی پر دلائل قائم ہیں کہ اس نے اپنی کتابوں میں یا اپنے رسولوں کی زبانوں پر ان کا ذکر کیا ہے۔ پس ان امور کا اس کی ذات کی معرفت (المعرفۃ) کی طلب سے یا دو متعارض دلائل کو جمع کرنے سے ٹکراؤ انہیں حیرت (الحیرۃ) میں ڈال دیتا ہے۔\n\n### [اہل حیرت ہی حقیقی معرفت کے مالک ہیں]\n\nپس اہل حیرت (الحیرۃ) وہ لوگ ہیں جنہوں نے ان دلائل پر غور کیا اور ان کی انتہا تک چھان بین کی، یہاں تک کہ اس غور و فکر نے انہیں عجز اور حیرت (الحیرۃ) کی طرف پہنچا دیا، خواہ وہ نبی ہو یا صدیق۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا:\n> \"اے اللہ! مجھے تجھ میں مزید حیرت (تحیرا) عطا فرما۔\"\n\nکیونکہ ذات حق (الحق) جتنا زیادہ اسے اپنا علم عطا کرتا ہے، اتنا ہی وہ علم اسے حیرت (الحیرۃ) میں بڑھا دیتا ہے، خاص طور پر اہل کشف (الکشف) کو، کیونکہ شہود (الشہود) کے وقت ان پر صور مختلف ہوتی ہیں، لہٰذا وہ دلائل پر غور کرنے والوں سے کہیں زیادہ حیرت میں ہوتے ہیں۔\n\nنبی صلی اللہ علیہ وسلم نے اپنے خالق کی اس تعریف میں اپنی پوری کوشش صرف کرنے کے بعد جو اس نے آپ پر وحی کی، فرمایا:\n> \"میں تیری تعریف کا احاطہ نہیں کر سکتا، تو ویسا ہی ہے جیسا تو نے خود اپنی تعریف کی ہے۔\"\n\nاور حضرت ابوبکر صدیق رضی اللہ عنہ نے اس مقام پر فرمایا، اور وہ اس کے اہل میں سے تھے: \"ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے،\" یعنی جب تم جان لو کہ کوئی ایسا ہے جو اسے نہیں جانتا، تو یہی اللہ تعالیٰ کا علم ہے۔ پس اس کے علم کی دلیل اس کا عدم علم ٹھہرا۔ اور اللہ نے ہمیں اس کی توحید کے علم کا حکم دیا ہے، نہ کہ اس کی ذات کے علم کا، بلکہ اس سے منع فرمایا ہے اپنے اس قول سے: **\"اور اللہ تمہیں اپنی ذات سے ڈراتا ہے\" (وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ)**۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کی ذات میں غور و فکر کرنے سے منع فرمایا ہے۔\n\nکیونکہ جس کی **\"مثال کوئی چیز نہیں\" (لَيْسَ كَمِثْلِهِ شَيْءٌ)**، اس کی ذات کی معرفت (المعرفۃ) تک کیسے پہنچا جا سکتا ہے؟ پس اللہ تعالیٰ نے توحید کے علم کا حکم دیتے ہوئے فرمایا: **\"پس جان لو کہ اللہ کے سوا کوئی معبود نہیں\" (فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ)**۔ پس اس کی معرفت (المعرفۃ) اس کے معبود ہونے کی حیثیت سے، اور ان صفات کی معرفت جو معبود کے لیے ضروری ہیں اور جو اسے غیر معبود اور مخلوق سے ممتاز کرتی ہیں، شرعاً اسی کا حکم دیا گیا ہے۔ پس اللہ کو اللہ کے سوا کوئی نہیں جانتا۔\n\n### [معرفت الٰہیہ کے طریقے: عقل، نقل اور کشف]\n\nپس اہل نظر اور اہل کشف (الکشف) کے نزدیک قاطع عقلی دلائل اس بات پر قائم ہو گئے کہ وہ ایک ہی معبود ہے، پس اللہ کے سوا کوئی معبود نہیں۔ پھر توحید پر اس عقلی دلیل اور اس کے وجود کے عقلی علم ضروری کے بعد، ہم نے دیکھا کہ اہل طریق اللہ تعالیٰ میں سے رسول، نبی اور ولی ایسی امور معرفت (المعرفۃ) لے کر آئے جو معبود کی صفات سے متعلق تھیں، جنہیں عقلی دلائل محال قرار دیتے تھے، لیکن نبوی الفاظ اور الٰہی خبریں ان کی صحت کے ساتھ آئیں۔\n\nپس اہل طریق نے ان معانی کی تحقیق کی تاکہ وہ ایک ایسا امر حاصل کر سکیں جس سے وہ اہل نظر سے ممتاز ہو جائیں، جو اپنی فکر کی رسائی کی حد پر رک گئے تھے، باوجود اس کے کہ وہ خبروں کی سچائی کو تسلیم کرتے تھے۔ انہوں نے کہا: ہم جانتے ہیں کہ عقل کے ادراک کے طور سے ماورا ایک اور طور ہے جو انبیاء اور کبار اولیاء کے لیے ہے، جس کے ذریعے وہ ان امور کو قبول کرتے ہیں جو ان پر جناب الٰہی سے وارد ہوتے ہیں۔\n\nپس اس گروہ نے خلوتوں اور مشروع اذکار کے ذریعے اسے حاصل کرنے کی کوشش کی تاکہ دلوں کو صاف کیا جائے اور فکر کی آلودگی سے پاک کیا جائے، کیونکہ غور و فکر کرنے والا صرف حادثات میں ہی فکر کرتا ہے، نہ کہ ذات حق (الحق) میں اور نہ ہی اس میں جو اس کی اپنی ذات میں ہونا چاہیے، جو کہ مسمیٰ اللہ ہے۔ اور جب اسے کوئی صفات اثبات نفسیہ نہ ملی تو اس نے ہر اس صفت پر غور کرنا شروع کیا جسے ممکن حادث قبول کر سکتا ہے، اور اسے اللہ سے سلب کر دیا تاکہ اس صفت کا حکم اس پر لازم نہ آئے جیسا کہ ممکن حادث پر لازم آیا۔ جیسا کہ بعض متکلمین اہل نظر نے ایسے امور میں کیا جنہیں انہوں نے ثابت کیا اور حاضر و غائب پر لاگو کیا، حالانکہ ذات حق (الحق) کے لیے محال ہے کہ وہ کسی صفت میں ممکن کے ساتھ جمع ہو۔\n\nکیونکہ ہر وہ صفت جس سے ممکن متصف ہوتا ہے، یا تو موصوف کے زوال سے اس کا وجود زائل ہو جاتا ہے، یا وہ خود زائل ہو جاتی ہے جبکہ ممکن باقی رہتا ہے، جیسے صفات معانی۔ اور پہلی قسم صفات نفس کی طرح ہے۔ پھر ان میں سے ہر صفت ممکن ہے۔ پس جب انہوں نے اسے حاضر و غائب پر لاگو کیا تو انہوں نے واجب الوجود لنفسہ کو اس چیز سے متصف کر دیا جو اس کی اپنی ذات کے لیے ممکن ہے۔ اور واجب الوجود لنفسہ وہ قبول نہیں کرتا جو ممکن ہو کہ ہو یا نہ ہو۔ پس جب اس وصف کی حقیقت کے لحاظ سے اس سے متصف ہونا باطل ہو گیا، تو صرف لفظی اشتراک باقی رہا، کیونکہ حد اور حقیقت میں اشتراک باطل ہو چکا ہے۔ پس ذات حق (الحق) کی صفت اور بندے کی صفت کو اصلاً کوئی ایک حد جمع نہیں کر سکتی۔ لہٰذا ان کا وہ قول باطل ہو گیا جسے انہوں نے کہا اور حاضر و غائب پر لاگو کیا۔\n\nپس اللہ کے بارے میں ہمارا یہ کہنا کہ وہ عالم ہے، اس حد پر نہیں ہے جس حد پر ہم ممکن حادث کے بارے میں کہتے ہیں کہ وہ عالم ہے، علم کی حد اور حقیقت کے لحاظ سے۔ کیونکہ اللہ کی طرف علم کی نسبت ممکن مخلوق کی طرف علم کی نسبت سے مختلف ہے۔ اور اگر قدیم علم ہی عین محدث علم ہوتا تو ان دونوں علموں کو ایک ہی ذاتی حد جمع کرتی، اور اس پر وہ محال ہوتا جو اس کے مثل پر اس کی ذات کے لحاظ سے محال ہوتا ہے، حالانکہ ہم نے معاملہ اس کے برعکس پایا ہے۔\n\n### [معرفت الٰہیہ کے حصول میں صوفیہ کے وسائل]\n\nپس اس گروہ نے ذات حق (الحق) کی جانب سے وارد ہونے والی الٰہی خبروں میں سے کچھ حاصل کرنے کی کوشش کی، اور اذکار اور تلاوت قرآن کے ذریعے اپنے دلوں کو صیقل کرنے میں مشغول ہو گئے، اور محل (دل) کو ممکنات میں غور و فکر سے خالی کیا، اور حضور و مراقبہ اختیار کیا، ساتھ ہی ظاہری طہارت کو مشروع حدود پر قائم رہنے سے حاصل کیا، جیسے ان امور سے نگاہیں نیچی رکھنا جنہیں دیکھنے سے منع کیا گیا ہے، جیسے ستر اور دیگر چیزیں، اور اسے ان چیزوں میں لگانا جو عبرت اور بصیرت عطا کرتی ہیں۔ اسی طرح اس کا سننا، اس کی زبان، اس کا ہاتھ، اس کا پاؤں، اس کا پیٹ، اس کی شرمگاہ اور اس کا دل۔ اور اس کے ظاہر میں ان سات کے سوا کچھ نہیں، اور دل آٹھواں ہے۔\n\nاور وہ غور و فکر کو اپنی ذات سے یکسر دور کر دیتا ہے، کیونکہ یہ اس کی ہمت کو منتشر کرتا ہے۔ اور وہ اپنے رب کے دروازے پر اپنے دل کی نگرانی میں گوشہ نشین ہو جاتا ہے، شاید اللہ اس کے لیے اپنا دروازہ کھول دے اور وہ اسے وہ کچھ سکھا دے جو وہ نہیں جانتا تھا، جو رسولوں اور اہل اللہ نے جانا، جسے عقلیں ادراک کرنے اور محال قرار دینے سے قاصر رہیں۔\n\nپس جب اللہ اس دل والے کے لیے یہ دروازہ کھول دیتا ہے، تو اسے ایک ظہور الٰہی (التجلی) حاصل ہوتا ہے، اور وہ ظہور الٰہی (التجلی) اسے اس کے حکم کے مطابق عطا کرتا ہے، پس وہ اللہ کی طرف ایک ایسا امر منسوب کرتا ہے جس کی نسبت کرنے کی وہ اس سے پہلے اللہ سبحانہ کی طرف جرات نہیں کرتا تھا، اور نہ ہی اسے اس سے متصف کرتا تھا، سوائے اس کے جو الٰہی خبروں میں آیا ہو، اور وہ اسے تقلیداً لیتا تھا۔ اور اب وہ اسے کشف (الکشف) کے طور پر لیتا ہے جو اس کے نزدیک نازل شدہ کتابوں اور رسولوں علیہم السلام کی زبانوں سے آنے والی باتوں کی موافقت اور تائید کرتا ہے۔ وہ پہلے انہیں ایمان کے طور پر بیان کرتا تھا، ان کے معانی کی تحقیق کیے بغیر اور ان میں اضافہ کیے بغیر، اور اب وہ اپنے دل میں اللہ تعالیٰ پر اس کا اطلاق ایک محقق علم کے طور پر کرتا ہے، اس امر کی وجہ سے جو اس پر ظاہر ہوا (التجلی)، پس وہ اس کے مطابق ہوتا ہے جو وہ امر اسے عطا کرتا ہے، اور وہ جانتا ہے کہ وہ کیا کہہ رہا ہے اور اس کی حقیقت کیا ہے۔\n\n### [اہل اللہ کی حیرت اور اہل نظر کی حیرت]\n\nپس وہ پہلے ظہور (التجلی) میں یہ خیال کرتا ہے کہ وہ مقصود کو پا چکا ہے اور امر کو حاصل کر چکا ہے، اور اس کے بعد طلب کرنے کے لیے اس کے دوام کے سوا کچھ نہیں ہے۔ پھر اس کے لیے ایک اور ظہور (التجلی) ایک دوسرے حکم کے ساتھ قائم ہوتا ہے جو پہلے جیسا نہیں ہوتا، حالانکہ ظہور کرنے والا ایک ہی ہے، اس میں کوئی شک نہیں۔ پس اس میں اس کا حکم پہلے جیسا ہی ہوتا ہے۔ پھر اس پر ظہورات (التجلیات) ان کے مختلف احکام کے ساتھ پے در پے وارد ہوتے ہیں، تب وہ جانتا ہے کہ اس امر کی کوئی انتہا نہیں جہاں رکا جا سکے، اور وہ جانتا ہے کہ اس نے انیت الٰہیہ (ذات کی انفرادیت) کا ادراک نہیں کیا، اور یہ کہ ہویت (ذات مطلق) کا اس پر ظہور (التجلی) صحیح نہیں ہے، اور یہ کہ وہ ہر ظہور (التجلی) کی روح ہے۔ پس اس کی حیرت (الحیرۃ) بڑھ جاتی ہے، لیکن اس میں لذت ہوتی ہے۔\n\nاور یہ حیرت (الحیرۃ) اہل فکر کی حیرت سے کہیں زیادہ عظیم ہے، کیونکہ اہل فکر اپنی فکر کے ساتھ اکوان (کائنات) میں ہی رہے، لہٰذا ان کے لیے حیران اور عاجز ہونا جائز ہے۔ اور یہ لوگ اکوان سے بلند ہو گئے، اور ان کے لیے اس (ذات حق) کے سوا کوئی شہود (الشہود) باقی نہیں رہا، پس وہی ان کا مشہود ہے، اور معاملہ اسی طرح ہے۔ لہٰذا ان کی حیرت (الحیرۃ) ظہورات (التجلیات) کے اختلاف کی وجہ سے، اہل نظر کی اس پر دلالتوں کے تعارض میں حیرت سے کہیں زیادہ شدید تھی۔\n\nپس آپ صلی اللہ علیہ وسلم کا یہ قول، یا جو شخص اس مقام سے کہتا ہے: \"مجھے تجھ میں مزید حیرت (تحیرا) عطا فرما،\" یہ اس پر ظہورات (التجلیات) کے تسلسل کی طلب ہے۔ پس یہ اہل اللہ کی حیرت (الحیرۃ) اور اہل نظر کی حیرت (الحیرۃ) کے درمیان فرق ہے۔\n\nاہل عقل یہ شعر پڑھتا ہے:\n> اور ہر چیز میں اس کی ایک نشانی ہے،\n> جو اس بات پر دلالت کرتی ہے کہ وہ ایک ہے۔\n\nاور صاحب ظہور (التجلی) اس بارے میں ہمارا یہ قول پڑھتا ہے:\n> اور ہر چیز میں اس کی ایک نشانی ہے،\n> جو اس بات پر دلالت کرتی ہے کہ وہ (ذات حق) عین وہی ہے۔\n\nپس ان دونوں کے درمیان وہی فرق ہے جو ان کے دو کلمات کے درمیان ہے۔\n\n### [صوفیہ کی شطحات اور فقہاء و اولی الامر کا موقف]\n\nپس ہستی (الوجود) میں اللہ کے سوا کچھ نہیں، اور اللہ کو اللہ کے سوا کوئی نہیں جانتا۔ اور اسی حقیقت کی بنا پر جس نے کہا \"میں اللہ ہوں\" جیسے بایزید بسطامی، اور \"سبحانی\" (میں پاک ہوں) جیسے دیگر متقدمین رجال اللہ نے کہا، اور یہ ان کے اقوال کے بعض نتائج میں سے ہے۔ پس جو بھی دونوں فریقوں میں سے حیرت (الحیرۃ) تک پہنچ گیا، وہ پہنچ گیا۔ البتہ ہمارے ساتھی آج شدید تکلیف محسوس کرتے ہیں کیونکہ وہ اللہ سبحانہ پر وہ اطلاق نہیں کر سکتے جو انبیاء علیہم السلام نے کیا، تو وہ ظہورات (التجلیات) کتنے عظیم ہیں!\n\nاور انہیں اس بات سے جس نے روکا کہ وہ اللہ پر وہ اطلاق کریں جو نازل شدہ کتابوں اور رسولوں علیہم السلام نے کیا، وہ فقہاء اور اولی الامر میں سے سننے والوں کا عدم انصاف ہے، کیونکہ وہ اس شخص کی تکفیر میں جلدی کرتے ہیں جو اللہ کے معاملے میں ویسی ہی بات لائے جیسی انبیاء علیہم السلام لائے تھے۔ اور انہوں نے اللہ تعالیٰ کے اس قول کا مفہوم چھوڑ دیا: **\"یقیناً تمہارے لیے رسول اللہ میں بہترین نمونہ ہے\" (لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ)**۔ جیسا کہ اس کے رب عزوجل نے انبیاء اور رسولوں علیہم السلام کا ذکر کرتے ہوئے آپ صلی اللہ علیہ وسلم سے فرمایا: **\"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کریں\" (أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ)**۔\n\nپس فقہاء نے جھوٹے دعویداروں کی وجہ سے یہ دروازہ بند کر دیا، اور انہوں نے اچھا کیا۔ اور سچوں کے لیے اس میں کوئی نقصان نہیں، کیونکہ اس طرح کے معاملے میں کلام اور عبارت کوئی حتمی چیز نہیں ہے۔ اور اس بارے میں جو رسول اللہ صلی اللہ علیہ وسلم سے وارد ہوا ہے، وہ ان کے لیے کافی ہے، پس وہ انہیں بیان کرتے ہیں اور ان سے راحت پاتے ہیں، جیسے تعجب، خوشی، ہنسنا، مسکرانا، نزول، معیت، محبت، شوق، اور اس سے ملتی جلتی چیزیں، جنہیں اگر کوئی ولی تنہا بیان کرے تو وہ کافر قرار دیا جائے گا اور شاید قتل بھی کر دیا جائے۔\n\nاور اکثر علماء رسوم نے اس علم کو ذوق اور شرب کے ذریعے حاصل نہیں کیا، لہٰذا انہوں نے عارفین کی طرف سے ایسی باتوں کا انکار کیا، اپنے دلوں کے حسد کی وجہ سے۔ کیونکہ اگر اللہ تعالیٰ پر ایسی باتوں کا اطلاق محال ہوتا تو نہ وہ خود اپنی ذات پر اس کا اطلاق کرتا اور نہ ہی اس کے رسول علیہم السلام اس پر اس کا اطلاق کرتے۔ اور حسد نے انہیں یہ جاننے سے روک دیا کہ یہ اللہ کی کتاب کو رد کرنا ہے اور اللہ کی رحمت کو اس کے بعض بندوں تک پہنچنے سے روکنا ہے۔ اور اکثر عوام اس انکار میں فقہاء کی تقلید کرتے ہیں، نہیں، بلکہ الحمد للہ، عوام میں سے کم ہی ایسا کرتے ہیں۔\n\nاور جہاں تک بادشاہوں کا تعلق ہے، وہ ان حقائق کے مشاہدہ (المشاھدۃ) تک نہیں پہنچ پاتے کیونکہ وہ ان امور میں مشغول ہوتے ہیں جو انہیں سونپے گئے ہیں، لہٰذا انہوں نے علماء رسوم کی اس رائے کی تائید کی جس پر وہ قائم تھے، سوائے ان میں سے تھوڑے سے لوگوں کے، جنہوں نے علماء رسوم پر اس معاملے میں شک کیا، جب انہوں نے دیکھا کہ وہ دنیا کے مال و متاع پر جھکے ہوئے ہیں حالانکہ وہ اس سے بے نیاز ہیں، اور انہیں جاہ و ریاست کی محبت ہے، اور وہ بادشاہوں کے ناجائز مقاصد کو پورا کرتے ہیں۔\n\nاور اللہ والے علماء ان کے ساتھ عجز اور محصوری کی ذلت میں رہے، اس رسول کی طرح جسے اس کی قوم نے جھٹلایا اور ان میں سے کسی ایک نے بھی ایمان نہ لایا، اور رسول اللہ صلی اللہ علیہ وسلم کی حفاظت کی جاتی رہی یہاں تک کہ یہ آیت نازل ہوئی: **\"اور اللہ تمہیں لوگوں سے بچائے گا\" (وَاللَّهُ يَعْصِمُكَ مِنَ النَّاسِ)**۔ پس دیکھو کہ اللہ والا عالم اپنی ذات میں کیا کچھ سہتا ہے۔ پاک ہے وہ ذات جس نے ان کی بصیرتوں کو اندھا کر دیا، جہاں انہوں نے اسلام قبول کیا، تسلیم کیا، اور اس چیز پر ایمان لائے جس کا انہوں نے کفر کیا۔ پس اللہ ہمیں ان لوگوں میں شامل کرے جنہوں نے حق کے ذریعے لوگوں کو پہچانا، نہ کہ ان لوگوں میں جنہوں نے لوگوں کے ذریعے حق کو پہچانا۔ **\"اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے\" (وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)**۔ **\"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)**۔",
    "fa": "باب پنجاهم در معرفت مردان حیرت و عجز\n\nآن کس که گوید خالقش را می‌شناسد *** و برهانی بر نادانی خود نیاورد\nخدا را جز خدا نمی‌شناسد، پس بیدار شوید *** زیرا حاضر شما مانند آن که غافل است، نیست\nعجز از درکِ ادراک، خود معرفت است *** و این حکم نزد خردمندان چنین است\nاوست معبود، پس ستایش‌هایش به شمار نیاید *** او منزه است، پس برای او مثلی نزنید\n\n### [سبب حیرت در معرفت الهی]\n\nبدان، خداوند تو را با روحی از جانب خود تأیید کند، که سبب حیرت (الحيرة) در علم ما به خداوند، طلب معرفت ذات (الذات) اوست، جلّ و تعالی، از یکی از دو طریق: یا از طریق دلایل عقلی، یا از طریقی که شهود (المشاهدة) نامیده می‌شود. دلیل عقلی از شهود منع می‌کند، و دلیل سمعی به آن اشاره کرده اما تصریح ننموده است. دلیل عقلی از درک حقیقت ذات (الذات) او از طریق صفت ثبوتی نفسی که او سبحانه در نفس خود بر آن است، منع کرده است. و عقل با نظر خود جز صفات سلب (صفات سلبیه) را درک نکرده است و این را معرفت (المعرفة) نامیده‌اند. شارع (پیامبر) اموری را به خود نسبت داده و خود را به آن‌ها وصف کرده که دلایل عقلی آن‌ها را محال می‌دانند، مگر با تأویلی بعید که ممکن است مقصود شارع باشد و ممکن است نباشد. و بر او (سالک) لازم است که به آنچه خداوند خود را بدان وصف کرده ایمان و تصدیق آورد، زیرا دلایل نزد او بر صدق این اخبار که خداوند آن‌ها را از خود در کتاب‌هایش یا بر زبان رسولانش خبر داده، قائم است. پس تعارض این امور با طلب معرفت ذات (الذات) او تعالی، یا تلاش برای جمع بین دو دلیل متعارض، آنان را در حیرت (الحيرة) افکنده است.\n\n### [اهل حیرت، اربابان معرفت حقیقی هستند]\n\nپس مردان حیرت (الحيرة) کسانی هستند که در این دلایل نظر کرده و نهایت جستجو را به کار بسته‌اند تا آن نظر، آنان را به عجز (العجز) و حیرت در آن رسانده است، خواه نبی باشند یا صدیق.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «اللهم زدني فيك تحيرا» (بار خدایا، حیرت مرا در خودت بیفزا).\n\nزیرا هرگاه حق (الحق) علم او را به خود بیشتر کند، آن علم حیرت او را می‌افزاید، به ویژه اهل کشف (الکشف) که به دلیل اختلاف صور بر آنان هنگام شهود (الشهود)، حیرتشان از اصحاب نظر (أهل النظر) در دلایل، به اندازه‌ای است که قابل مقایسه نیست.\n\nپیامبر (صلی الله علیه و سلم) پس از آنکه نهایت تلاش خود را در ستایش خالقش به آنچه به او وحی شده بود، به کار برد، فرمود: «لا أحصي ثناء عليك أنت كما أثنيت على نفسك» (من نمی‌توانم ثنای تو را به شمار آورم، تو آن‌چنانی که خود بر خود ثنا گفته‌ای).\n\nو ابوبکر صدیق (رضی الله عنه) که از مردان این مقام بود، در این باره فرمود: «العجز عن درك الإدراك إدراك» (ناتوانی از درکِ ادراک، خود ادراک است). یعنی اگر بدانی که کسی هست که آن را نمی‌داند، این همان علم به خداوند تعالی است. پس دلیل علم به او، عدم علم به او بود. خداوند ما را به علم به توحیدش امر کرده است و به علم به ذاتش امر نکرده، بلکه از آن نهی نموده است به این قول: «وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ» (و خداوند شما را از [نافرمانی] خود برحذر می‌دارد). و رسول خدا (صلی الله علیه و سلم) از تفکر در ذات (الذات) خداوند تعالی نهی فرمود.\n\nزیرا کسی که «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست)، چگونه می‌توان به معرفت ذات (الذات) او رسید؟ پس خداوند تعالی در حالی که به علم توحیدش امر می‌کند، فرمود: «فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ» (پس بدان که هیچ معبودی جز الله نیست). بنابراین، معرفت (المعرفة) به او از جهت الوهیتش، و معرفت به صفاتی که شایسته است معبود بر آن‌ها باشد و او را از غیر معبود و از مخلوق متمایز سازد، همان چیزی است که شرعاً به آن امر شده است. پس خدا را جز خدا نمی‌شناسد.\n\n### [راه‌های معرفت الهی: عقل، نقل و کشف]\n\nپس دلایل عقلی قاطع بر یگانگی او به عنوان معبود، نزد اهل نظر (أهل النظر) و اهل کشف (أهل الکشف) اقامه شد، که «لا إله إلا هو» (هیچ معبودی جز او نیست). سپس، پس از این دلیل عقلی بر توحید او و علم ضروری عقلی به وجودش، دیدیم که اهل طریق خداوند تعالی، از رسول و نبی و ولی، اموری از معرفت (المعرفة) به اوصاف الهی در طریق خود آورده‌اند که دلایل عقلی آن‌ها را محال می‌دانند، در حالی که الفاظ نبوی و اخبار الهی صحت آن‌ها را تأیید کرده‌اند. پس اهل طریق به جستجوی این معانی پرداختند تا امری را به دست آورند که به واسطه آن از اهل نظر (أهل النظر) متمایز شوند؛ کسانی که در جایی که افکارشان به آن رسیده بود، متوقف شدند، با وجود اینکه صدق اخبار را تصدیق می‌کردند. پس گفتند: می‌دانیم که مرحله دیگری ورای مرحله ادراک عقل که به تنهایی عمل می‌کند، وجود دارد، و آن برای انبیا و اولیای بزرگ است که به واسطه آن، این امور وارده بر ساحت الهی را می‌پذیرند. پس این طایفه برای تحصیل آن، از طریق خلوت‌ها و اذکار مشروع برای صفای قلوب و طهارت آن‌ها از آلودگی فکر عمل کردند؛ زیرا متفکر جز در امور حادث (المحدثات) تفکر نمی‌کند، نه در ذات حق (ذات الحق) و آنچه شایسته است او در نفس خود بر آن باشد که همان مسمای «الله» است. و چون صفت اثباتی نفسی نیافت، شروع کرد به نظر کردن در هر صفتی که ممکن حادث (المحدث الممكن) می‌تواند بپذیرد، و آن را از خداوند سلب کرد تا حکم آن صفت بر او لازم نشود، همان‌طور که بر ممکن حادث لازم شده است. مانند کاری که برخی از متکلمان اهل نظر در اموری انجام دادند که آن‌ها را اثبات کرده و در شاهد و غایب تعمیم دادند، در حالی که محال است ذات حق (ذات الحق) با ممکن در یک صفت جمع شود. زیرا هر صفتی که ممکن به آن متصف شود، یا وجودش با زوال موصوفش زایل می‌شود، یا خود صفت با بقای ممکن زایل می‌شود، مانند صفات معانی و اولی مانند صفات نفس. سپس هر یک از این صفات ممکن است. پس اگر آن‌ها را در شاهد و غایب تعمیم دادند، واجب الوجود لنفسه را به چیزی وصف کرده‌اند که ممکن لنفسه است. و واجب الوجود لنفسه آنچه را که ممکن است باشد و ممکن است نباشد، نمی‌پذیرد. پس اگر اتصاف به آن از حیث حقیقت آن وصف باطل شد، جز اشتراک در لفظ باقی نمی‌ماند، زیرا اشتراک در حد و حقیقت باطل شده است. پس صفت حق (الحق) و صفت بنده را اصلاً یک حد جمع نمی‌کند. بنابراین، تعمیم آنچه گفتند و در شاهد و غایب تعمیم دادند، باطل است. پس قول ما درباره خداوند که او «عالم» است، بر حدّی نیست که درباره ممکن حادث می‌گوییم «عالم» است، از طریق حد و حقیقت علم. زیرا نسبت علم به خداوند تخالف نسبت علم به خلق ممکن. و اگر عین علم قدیم، عین علم حادث بود، یک حد ذاتی، یعنی دو علم، آن‌ها را جمع می‌کرد و آنچه بر مثل او از حیث ذاتش محال است، بر او نیز محال می‌شد، در حالی که ما امر را بر خلاف این یافته‌ایم.\n\n### [ابزارهای صوفیه در تحصیل معرفت الهی]\n\nپس این طایفه برای تحصیل چیزی از آنچه اخبار الهی از جانب حق (الحق) آورده بود، به کار پرداختند و شروع به صیقل دادن قلب‌های خود با اذکار و تلاوت قرآن و خالی کردن محل (قلب) از نظر در ممکنات و حضور و مراقبه کردند، همراه با طهارت ظاهر با ایستادن بر حدود مشروع، از جمله فرو بستن چشم از اموری که از نظر به آن‌ها نهی شده است، مانند عورت‌ها و غیره، و به کار بردن آن در چیزهایی که عبرت و بصیرت می‌بخشد. و همچنین گوش، زبان، دست، پا، شکم، فرج و قلبش. و در ظاهر او جز این هفت مورد نیست و قلب هشتمین آن‌هاست. و تفکر را به طور کلی از خود دور می‌کند، زیرا تفکر همّ او را پراکنده می‌سازد. و بر مراقبه قلب خود نزد درگاه پروردگارش معتکف می‌شود، باشد که خداوند دری به سوی خود برای او بگشاید و آنچه را که نمی‌دانست، از آنچه رسولان و اهل الله دانسته‌اند و عقول به تنهایی قادر به درک و پذیرش آن نبوده‌اند، بیاموزد. پس هنگامی که خداوند این در را برای صاحب این قلب بگشاید، تجلی الهی (تجلی إلهي) برای او حاصل می‌شود. آن تجلی به حسب حکمی که دارد، به او عطا می‌کند و او امری را به خداوند نسبت می‌دهد که پیش از آن جرأت نسبت دادن آن به خداوند سبحان را نداشت و او را بدان وصف نمی‌کرد، مگر به اندازه‌ای که اخبار الهی آورده بود و آن را از روی تقلید می‌پذیرفت. اما اکنون آن را به صورت کشف (الکشف) می‌پذیرد که نزد او موافق و مؤید چیزی است که کتب نازل شده به آن نطق کرده و بر زبان رسولان (علیهم السلام) آمده است. پس پیش از این، آن را از روی ایمان و حکایت، بدون تحقیق معانی و بدون افزودن بر آن، بیان می‌کرد. اما اکنون، آن را در نفس خود، به عنوان علم محقق، به دلیل آن امری که بر او تجلی کرده است، بر خداوند تعالی اطلاق می‌کند. پس این اطلاق به حسب چیزی است که آن امر به او عطا می‌کند و معنای آنچه را که اطلاق می‌کند و حقیقت آن را می‌شناسد.\n\n### [حیرت اهل الله و حیرت اهل نظر]\n\nپس در اولین تجلی (التجلی)، خیال می‌کند که به مقصود رسیده و امر را به دست آورده است و چیزی ورای آن برای طلبیدن نیست، جز دوام آن. سپس تجلی دیگری با حکمی متفاوت از آن اولی برای او حاصل می‌شود، در حالی که تجلی‌کننده یکی است و در آن شکی نیست. پس حکم آن تجلی جدید، حکم اولی را در بر می‌گیرد. سپس تجلیات (التجلیات) با اختلاف احکامشان بر او پی در پی می‌آیند. در این هنگام می‌داند که این امر پایانی ندارد که بتوان در آن متوقف شد، و می‌داند که انیت الهی (الإنية الإلهية) را درک نکرده است و هویت (الهوية) شایسته نیست که بر او تجلی کند، بلکه هویت روح هر تجلی است. پس حیرتش (الحيرة) افزون می‌شود، اما این حیرت همراه با لذت است و بسیار عظیم‌تر از حیرت اصحاب افکار است، به طوری که قابل مقایسه نیست. زیرا اصحاب افکار (أصحاب الأفكار) با افکار خود از اکوان (مخلوقات) خارج نشده‌اند، پس حق دارند که حیران و عاجز شوند. اما اینان (اهل الله) از اکوان فراتر رفته‌اند و جز شهود (الشهود) در او برایشان باقی نمانده است، پس او مشهود آن‌هاست. و چون امر چنین است، حیرت آن‌ها به دلیل اختلاف تجلیات، شدیدتر از حیرت اهل نظر (النظار) در تعارضات دلایل بر اوست.\n\nپس قول پیامبر (صلی الله علیه و سلم) یا قول کسی که از این مقام می‌گوید: «حیرت مرا در خودت بیفزا»، طلب پی در پی آمدن تجلیات (التجلیات) بر اوست. این تفاوت بین حیرت اهل الله و حیرت اهل نظر (أهل النظر) است. پس صاحب عقل می‌سراید:\n\nو در هر چیزی برای او نشانه‌ای است *** که دلالت می‌کند بر اینکه او واحد است\n\nو صاحب تجلی (التجلی) در این باره قول ما را می‌سراید:\n\nکه دلالت می‌کند بر اینکه او عین آن است\n\nپس میان آن دو، همان تفاوتی است که میان دو کلمه آن‌هاست.\n\n### [شطحیات صوفیه و موضع فقها و اولی‌الامر نسبت به آن‌ها]\n\nپس در هستی (الوجود) جز خدا نیست و خدا را جز خدا نمی‌شناسد. و از این حقیقت (الحقیقة) بود که کسانی چون ابویزید که گفتند «أنا الله» (من خدا هستم) و دیگر مردان متقدم خدا که گفتند «سبحانی» (منزه هستم) سخن گفتند، و این از برخی استنباطات اقوال آنان است، رضی الله عنهم. پس هر کس از هر دو گروه به حیرت (الحيرة) رسیده باشد، به مقصد رسیده است. جز اینکه اصحاب ما امروز نهایت درد را می‌یابند، زیرا نمی‌توانند آنچه را که شایسته است بر خداوند سبحان اطلاق کنند، همان‌طور که انبیا (علیهم السلام) اطلاق کردند. پس آن تجلیات (التجلیات) چه عظیم‌اند! و آنچه آنان را از اطلاق آنچه کتب نازل شده و رسولان (علیهم السلام) بر او اطلاق کردند، باز داشته است، عدم انصاف شنوندگان از فقها و اولی‌الامر است، به دلیل شتابی که در تکفیر کسی دارند که چیزی شبیه آنچه انبیا (علیهم السلام) در حق خداوند آورده‌اند، بیان می‌کند. و معنای این قول خداوند تعالی را ترک کرده‌اند: «لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ» (قطعاً برای شما در [اقتدا به] رسول خدا سرمشقی نیکوست). همان‌طور که پروردگار عز و جل به او (صلی الله علیه و سلم) هنگام ذکر انبیا و رسولان (علیهم السلام) فرمود: «أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ» (آنان کسانی هستند که خداوند هدایتشان کرده است، پس به هدایت آنان اقتدا کن). پس فقها این باب را به خاطر مدعیان دروغین در ادعایشان بستند، و چه کار خوبی کردند. و بر صادقان در این امر ضرری نیست، زیرا سخن گفتن و عبارت آوردن از چنین امری، امری ضروری و حتمی نیست. و آنچه از رسول خدا (صلی الله علیه و سلم) در این باره وارد شده است، برای آنان کفایت می‌کند. پس آن‌ها را نقل می‌کنند و با آن آسوده می‌شوند، از قبیل تعجب، شادی، خنده، تبسم، نزول، معیت، محبت، شوق و امثال آن، که اگر ولی به تنهایی از آن‌ها عبارت آورد، کافر شمرده می‌شود و چه بسا کشته شود. و بیشتر علمای رسوم (ظاهرگرا) علم به این امور را از طریق ذوق و شرب (تجربه عرفانی) از دست داده‌اند، پس چنین اموری را از عارفان انکار می‌کنند، از روی حسدی که در نفس خود دارند. زیرا اگر اطلاق چنین اموری بر خداوند تعالی محال بود، نه خود او بر خویشتن اطلاق می‌کرد و نه رسولانش (علیهم السلام) بر او اطلاق می‌کردند. و حسد مانع آن‌ها شده است که بدانند این انکار، رد بر کتاب خدا و محدود کردن رحمت خداست که به برخی از بندگان خدا برسد. و بیشتر عوام در این انکار، مقلد فقها هستند، نه، بلکه به حمدالله کمترِ عوام چنین‌اند. اما سلاطین، غالب بر آن‌ها عدم وصول به شهود (الشهود) این حقایق است، به دلیل اشتغالشان به آنچه به آن‌ها سپرده شده است. پس با علمای رسوم در آنچه بدان رفته‌اند، همراهی کرده‌اند، مگر اندکی از آنان که علمای رسوم را در این باره متهم کردند، زیرا دیدند که آنان بر حطام دنیا (مال بی‌ارزش) حریص‌اند، در حالی که از آن بی‌نیاز هستند، و به دلیل حب جاه و ریاست و پیش بردن اغراض سلاطین در امور نامشروع. و علمای بالله (عارفان) تحت ذلت عجز و حصر با آنان باقی ماندند، مانند رسولی که قومش او را تکذیب کردند و حتی یک نفر از آنان به او ایمان نیاورد. و رسول خدا (صلی الله علیه و سلم) پیوسته تحت حراست بود تا اینکه نازل شد: «وَاللَّهُ يَعْصِمُكَ مِنَ النَّاسِ» (و خداوند تو را از [آسیب] مردم حفظ می‌کند). پس بنگر که عالم بالله در نفس خود چه رنجی می‌کشد. پس منزه است کسی که بصیرت‌های آنان را کور کرد، در حالی که تسلیم شدند و ایمان آوردند به چیزی که به واسطه آن کفر ورزیدند. پس خداوند ما را از کسانی قرار دهد که مردان را با حق (الحق) می‌شناسند، نه از کسانی که حق را با مردان می‌شناسند. «وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ» (و ستایش از آنِ خداوند، پروردگار جهانیان است). «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 3
}