{
  "id": 275,
  "title": {
    "ar": "الباب الخامس والسبعون ومائتان في معرفة منزل التبري من الأوثان‏ من المقام الموسوي وهو من منازل الأمر السبعة",
    "en": "Chapter Two Hundred and Seventy-Five: Concerning the understanding of the Station of Disavowal from Idols (منزل التبري من الأوثان), which belongs to the Mosaic Station (المقام الموسوي) and is one of the Seven Stations of Command (منازل الأمر السبعة).",
    "ur": "باب دو سو پچھتر (۲۷۵): بتوں سے براءت (التبري من الأوثان) کے منزل کی معرفت کے بیان میں، جو مقام موسوی (المقام الموسوي) سے ہے اور منازل الأمر السبعة (منازل الأمر السبعة) میں سے ایک ہے۔",
    "fa": "باب دویست و هفتاد و پنجم در معرفت منزل بیزاری از بت‌ها (التبري من الأوثان) از مقام موسوی، و آن یکی از منازل هفت‌گانه امر است."
  },
  "content": {
    "ar": "## «الباب الخامس والسبعون ومائتان في معرفة منزل التبري من الأوثان‏ من المقام الموسوي وهو من منازل الأمر السبعة»\n\n\n> منازل الأمر بالندا *** منازل ما لها انتها\n\n\n> يا أي يا أي لا تفارق *** فكونكم ما له انقضا\n\n\n> وأي أي يكون منه *** لوجهه بيننا رآء\n\n\n> عساكر للحروف جاءت *** يضيق عن حملها الفضاء\n\n\n> أرماحها كلها نجوم *** أيدها الأمر والقضاء\n\n\n> سفائن بحرها عميق *** قد مخرت ريحها رخاء\n\n\n> فلتلتزم يا أخي علما *** ضاق له الأرض والسماء\n\n\n> ولتترك الغير في عماه *** بمشهد ما هو العماء\n\n\n### [عباد الوثن‏]\n\n\nاعلم أن الذلة والافتقار لا تكون من الكون إلا لله تعالى فكل من تذلل وافتقر إلى غير الله تعالى واعتمد عليه وسكن في كل أمره إليه فهو عابد وثن وذلك المفتقر إليه يسمى وثنا ويسميه المفتقر إلها وألطف الأوثان الهواء وأكثفها الحجارة وما بينهما ولهذا قال المشركون لما دعوا إلى توحيد الإله في ألوهته أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ فالناس يحملون قوله إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ إنه من قول الكفار حيث دعاهم إلى توحيد إله وهم يعتقدون كثرتها وهو عندنا من قول الحق أو قول الرسول وأما قول الكفار فانتهى في قوله إِلهاً واحِداً والتعجب إنه يأول العقل يعلم الإنسان أن الإله لا يكون بجعل جاعل فإنه إله لنفسه ولهذا وقع التوبيخ بقوله تعالى أَ تَعْبُدُونَ ما تَنْحِتُونَ والإله في ضرورة العقل لا يتأثر وقد كان هذا خشبة يلعب بها أو حجرا يستجمر به ثم أخذه وجعله إلها يذل ويفتقر إليه ويدعوه خوفا وطمعا فمن مثل‏\nهذا يقع التعجب مع وجود العقل عندهم فوقع التعجب من ذلك ليعلم من حجب العقول عن إدراك ما هو لها بديهي وضروري ذلك لتعلموا إن الأمور بيد الله وأن الحكم فيها لله وأن العقول لا تعقل بنفسها وإنما تعقل ما تعقله بما يلقي إليها ربها وخالقها ولهذا تتفاوت درجاتها فمن عقل مجعول عليه قفل ومن عقل محبوس في كن ومن عقل طلع على مرآته صدا فلو كانت العقول تعقل لنفسها لما أنكرت توحيد موجدها في قوم وعلمته من قوم والحد والحقيقة فيهما على السواء فلهذا جعلنا قوله تعالى إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ ليس من قول الكفار\n\n\n### [أن منزل التبري من منازل الستر والكتمان‏]\n\n\nفاعلم يا أخي أن هذا المنزل هو منزل من منازل الستر والكتمان وتقرير الألوهة في كل من عبد من دون الله لأنه ما عبد الحجر لعينه وإنما عبد من حيث نسبة الألوهة إليه ولهذا ذكرنا أنه من منازل الكتمان والستر قال تعالى وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ ولَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله فما ذكروا قط إلا الألوهية وما ذكروا لأشخاص ولكن لم يقبل الله منهم العذر بل قال إِنَّكُمْ وما تَعْبُدُونَ من دُونِ الله أي الذي انفرد بهذا الاسم حَصَبُ جَهَنَّمَ وهو قوله وَقُودُهَا النَّاسُ والْحِجارَةُ وهو كل من دعاكم إلى عبادة نفسه أو عبدتموه وكان في وسعه أن ينهاكم عن ذلك فما نهاكم فمثل هؤلاء يكونون من حصب جهنم فالموحد يعبد الله من طريقين من طريق الذات من كونها تستحق وصف الألوهة ومن طريق الألوهة فالسعيد الجامع بينهما لأن العابد مركب من حرف ومعنى فالحرف للحرف والمعنى للمعنى فلذلك لم نعبد الذات معراة عن وصفها بالألوهية ولم تعبد الألوهية من غير نسبتها إلى موصوف بها فلم تقم العبادة إلا على ما نقتضيه حقيقة العبد وهو التركيب لا على ما تقتضيه حقيقة الحق وهو الأحدية ولهذا يكون القائل في عبادته وفاء لحق الله غير مصيب إذا أراد الذات فإن حقيقتها الأحدية وقد يمكن أن يصح قول من قال إنما أعبده وفاء لحق الربوبية لا لحقيقتها إذ كل حق له حقيقة فالحق من ذلك به تتعلق العبادة من العابد والحقيقة هي الأحدية التي لا تتعلق ولا يتعلق بها ولهذا كانت الألف في الوضع الإلهي بالخط العربي إذا تقدمت في الكلمة لا تتصل ولا يتصل بها وإذا تأخرت اتصل بها بعض الحروف ممن لا علم له بالأحدية المطلقة التي تستحقها هذه الذات إلا خمسة أحرف لا غير من جميع الحروف وهي الدال والذال والراء والزاي والواو وهي خمسة أحوال من اتصف بها عرف الأحدية وكانت عبادته ذاتية لم يقترن بها أمر وهي عبادة المعنى للمعنى فإن الأمر عبادة الحرف للحرف فلا يخطر لعابد المعنى فرق بين الذات والألوهية ولا كثرة بل يرى عينا واحدة تستحق ما هو عليه هذا العارف من حيث معناه لا من حيث حرفه وهذا مقام الجلال والعظمة وأحدية العبد التي أعطته معرفة الأحدية الذاتية والتنزيه والغني فهذه أحوال خمسة تدل عليها الحروف الخمسة التي لا تتصل بها الألف الواقعة في أواخر الكلم مثل جبيرا وعزيزا وأحدا وإذا وعلوا فدلت الألف في أول الكلمة من عدم الاتصال على قوله كان الله ولا شي‏ء معه وهو على ما عليه كان مع وجود الأشياء من عدم الاتصال كما لم تتصل الألف بالكلمة ودل عدم اتصال الحروف الخمسة بها في آخر الكلمة على حال معرفة مقام بعض العباد من العلماء بالله دون غيرهم حيث رفعوا النسبة بينهم وبين الله تعالى وأنهم مشاهدون لما ذكرناه من الجلال والعظمة والأحدية والتنزيه والغني وما عدا هذه الطائفة جعلوا نسبة ورابطة بين الإله والمألوه وما فرقوا بين المرتبة والذات لما لم يعرفوا الله إلا من نفوسهم بحكم الدلالة لاستناد الممكن إلى المرجح فطلبوه وطلبهم ولهم من الحروف كل حرف اتصل بالألف في آخر الكلمة ولهؤلاء الأكابر أيضا قسم وحظ وافر في منزل هذه الحروف التي اتصلت من حيث حرفيتهم لا من حيث معناهم وهؤلائك جهلوا هذا القدر الفارق بينهم لكنهم ستروا ذلك عن العامة وانفردوا به عن أشكالهم يختص برحمته من يشاء ولأجل هذا قال الجنيد سيد هذه الطائفة لا يبلغ أحد درج الحقيقة حتى يشهد فيه ألف صديق بأنه زنديق فإن هذا المقام يضر بمن ليس من أهله كما يضر رياح الورد بالجعل لأن الحال التي هم عليها لا تقبل هذا المقام ولا يقبلها فإذا رآهم الناس في العموم لم يعرفوهم لأنه ليس على حرفهم أمر ظاهر يتميز به عن العامة وإذا رآهم الناس في الخصوص كالفقهاء وأصحاب علم الكلام وحكماء الإسلام قالوا بتكفيرهم وإذا رآهم الحكماء الذين لم يتقيدوا بالشرائع المنزلة مثل الفلاسفة قالوا إن هؤلاء أهل هوس قد فسدت خزانة خيالهم وضعفت عقولهم‏\nفلا يعرفهم سواهم ومن اقتطعهم من خلقه إليه قال تعالى في المعنى وما قَدَرُوا الله حَقَّ قَدْرِهِ ولهؤلاء حظ وافر في هذه الآية حيث جهلهم العام والخاص والمسلم وغير المسلم فهم الضنائن المصانون بحجب الغيرة فلا يعرفهم إلا الحق وهل يعرف بعضهم بعضا فيه توقف وهم المطلوبون من العباد ألحقنا الله بهم وأرجو أن أكون منهم وأما تبري المسلم ممن استند إليه المشرك فليس تبرؤه إلا من النسبة ومن المنسوب إليه لا من المنسوب فاجتمع المشرك والمسلم في المنسوب وافترقا في المنسوب إليه والنسبة ولهذا لم تضرب الجزية على المشرك وفرق بينه وبين الكفار من أهل الكتب المنزلة فإن المشرك قادح في الحق وفي الكون بشركه فلم يكن له مستند يعصمه من القتل لأنه قدح في التوحيد وفي الرسل والكفار من أهل الكتاب لم يقدحوا في التوحيد ولا في الكون أعني الرسل لكن قدحوا في رسول معين لهوى أو شبهة قائمة بنفوسهم أداهم ما قام بهم إلى جحود الحق ظلما وعلوا مع اليقين به وإما لشبهة قامت بهم لم يثبت صدق صاحب الدعوى عندهم فلهذا كان لهم في الجملة مستند صحيح عندهم لا في نفس الأمر يعصمهم من القتل فضربت عليهم الجزية وتركوا على دينهم ليقيموه أو يقيموا بعضه على قدر ما يوفقون إليه وهنا نكتة لمن فهم إن دينهم مشروع لهم بشرعنا حيث قررهم عليه ولهذا كان رسول الله صلى الله عليه وسلم إذا سمع أن الروم قد ظهرت على فارس يظهر السرور في وجهه مع كون الروم كافرين به صلى الله عليه وسلم ولكن الرسول لعلمه صلى الله عليه وسلم كان منصفا لأنه علم إن مستند الروم لمن استند إليه أهل الحق لأنهم أهل كتاب مؤمنون به لكنهم طرأت عليهم شبهة من تحريف أئمتهم ما أنزل عليهم حالت بينهم وبين الايمان والإقرار بنبوة محمد صلى الله عليه وسلم أو بعمومها وكلامنا مع المنصف منهم من علمائهم فعذرهم الشرع لهذا القدر الذي علمه منهم وراعى فيهم جناب الحق تعالى حيث وحدوه وما أشركوا به حين أشرك به فارس وعبدة الأوثان وقدحت في توحيد الإله وما يستحقه من الأحدية وهكذا حال العارفين من أهل هذا المقام وأما قول رسول الله صلى الله عليه وسلم في أمره إيانا بمخالفة أهل الكتاب إنما هو في كونهم آمنوا ببعضه وكفروا ببعضه وأرادوا أَنْ يَتَّخِذُوا بَيْنَ ذلِكَ سَبِيلًا فأمرنا بمخالفتهم في أمور من الأحكام معينة وفيما ذكرناه ولو أمرنا بمخالفتهم على الإطلاق لكنا مأمورين بخلاف ما أمرنا به من الايمان فلا تصح مخالفتهم على الإطلاق فهذا المراد\n\n\nبقوله صلى الله عليه وسلم خالفوا أهل الكتاب‏\n\n\n### [أن المشرك باعتبار عدوله عن أحدية الإله تسمي كافرا]\n\n\nواعلم أن كل مشرك كافر فإن المشرك باتباع هواه فيمن أشرك واتخذه إلها وعدوله عن أحدية الإله يسترها عن النظر في الأدلة والآيات المؤدية إلى توحيد الإله فسمي كافرا لذلك الستر ظاهرا وباطنا وسمي مشركا لكونه نسب الألوهية إلى غير الله مع الله فجعل لها نسبتين فأشرك فهذا الفرق بين المشرك والكافر وأما الكافر الذي ليس بمشرك فهو موحد غير أنه كافر بالرسول وببعض كتابه وكفره على وجهين الوجه الواحد أن يكون كفره بما جاء من عند الله مثل كفر المشرك في توحيد الله والوجه الآخر أن يكون عالما برسول الله وبما جاء من عند الله أنه من عند الله ويستر ذلك عن العامة والمقلدة من أتباعه رغبة في الرئاسة وهو الذي أراد عليه السلام بقوله في كتابه إلى قيصر فإن توليت فإن عليك إثم اليريسيين يعني الأتباع‏\n\n\n### [أن التأيه والنداء مؤذن بالبعد]\n\n\nواعلم أن التأيه والنداء مؤذن بالبعد عن الحالة التي يدعوه إليها من يناديه من أجلها فيقول يا أَيُّهَا الَّذِينَ آمَنُوا فلبعدهم مما أيه بهم أن يؤمنوا به لذلك أيه بهم فإن كانوا موصوفين في الحال بما دعاهم إليه فيتعلق البعد بالزمان المستقبل في حقهم أي اثبتوا على حالكم الذي ارتضاه الدين لكم في المستقبل كما قال يعقوب لبنيه ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ في حال حياتهم فأمرهم بالإسلام في المستقبل أي بالثبوت عليه والاستقبال بعيد عن زمان الحال فيكون التأيه أيضا بما هو موجود في الحال أن يكون باقيا في المستقبل قال تعالى يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ وهم في حال الوفاء بعقد الايمان فإنه نعتهم في تأيهه بهم بالإيمان فكان البعد في العقود إذا قبلوها متى قبلوها\n\n\n### [أن النداء الإلهي عام يشمل المؤمن والكافر والطائع والعاصي‏]\n\n\nواعلم أن النداء الإلهي يعم المؤمن والكافر والطائع والعاصي والأرواح والروحانيين ولا يكون النداء إلا من الأسماء الإلهية ينادي الاسم الإلهي من حكم عليه اسم إلهي غيره إذا علم أنه قد انتهت مدة حكمه فيه فيأخذه هذا الاسم الذي ناداه كذلك دنيا وآخرة فجميع من سوى الله تعالى منادى يناديه اسم إلهي لحال كوني يطلبه به ليوصله إليه فإن أجاب سمي مطيعا وكان سعيدا وإن لم يجب سمي عاصيا\nوكان شقيا فإن قال قائل كيف يكون النداء من اسم إلهي ويقف الكون عن إجابته مع ضعفه وقبوله للاقتدار الإلهي قلنا لم تكن إبايته عن إجابته من حيث نفسه وحقيقته لأنه مقهور دائما ولكن لما كان تحت قهر اسم إلهي لم يتركه ذلك الاسم أن يجيب من ناداه فالتنازع وقع بين الأسماء الإلهية وهم أكفاء والحكم لصاحب اليد وهو الاسم الذي هو في يده في وقت نداء الاسم الآخر فلهذا كان أقوى للحال فإن قلت فلما ذا يؤاخذ بالإباءة قلنا لأنه ادعى الإباية لنفسه ولم يضفها إلى الاسم الإلهي الذي هو تحت قهره فإن قلت فالأمر باق فإنه إنما أبي لقهر اسم إلهي كانت الإباية عنه في هذا المدعو قلنا صدقت ولكنه جهل ذلك فأخذ بجهله فإن الجهل له من نفسه فإن قلت فإن جهله من اسم إلهي حكم عليه قلنا الجهل أمر عدمي لا وجودي والأسماء الإلهية تعطي الوجود ما تعطي العدم فالعدم للمدعو من نفسه والجهل عدم العلم فلم يدر المعترض ما اعترض به والأسماء الإلهية لا تعطي إلا الوجود فلم يلزم ما ذكرته وانقطع الاعتراض من هذا القائل بما ذكرناه وإذا ثبت أن النداء يعم فالمنادي به أيضا يعم ولكن نداء الحق لا يكون إلا بما يكون في إجابته السعادة للعبد وأما النداء بما يكون فيه الشقاوة للعبد فذلك ليس نداء الحق والنداء من صفة الكلام فكل فعل يفعله العبد ينقسم إلى أمرين إلى فعل فيه سعادة ذلك العبد وهو الذي يقترن به نداء الحق تعالى وفعل لا يقترن به سعادة العبد فليس عن نداء الحق لكنه عن إرادة الحق وخلقه لا عن ندائه وأمر شرعه ونفي السعادة فيه على قسمين الواحد أن يكون فعلا لا يقترن به شقاوة ولا سعادة أو يكون فعلا تقترن به شقاوة والفعل الذي تقترن به الشقاوة على قسمين قسم تقترن به على الأبد وهي شقاوة الشرك وشقاوة لا تقترن به على الأبد وهو كل فعل لا يكون شركا ولا نداء للحق فيه البتة فهذا المنزل هو منزل النداء لا منزل الأفعال وسيأتي إن شاء الله منازل الأفعال ويشتبه على بعض العارفين هذا المنزل وإخوانه بمنزل الأفعال لكونه يرى النداء بالأفعال وليس المنزل واحدا في ذلك بل النداء له منزل والفعل له منزل‏\n\n\n### [أن النداء على مراتب‏]\n\n\nواعلم أن النداء على مراتب لكل مرتبة أداة معينة فالأدوات الهمزة ويا وأيا وهيأ وأي مسكنة الياء فأقربها الهمزة في الرتبة وأبعدها هيأ والنداء قد يصحبه التنبيه وقد لا يصحبه التنبيه فإذا كان النداء بأي فهو نكرة فلا بد من التنبيه لأن النداء إنما يطلب التعريف وهو بنفس المنادي فلا بد أن يصحب هاء التنبيه لأي في النداء لأن التنبيه تعريف ثم يردف التنبيه باسم المنادي ليعرف المنادي أنه منادى دون غيره فإن كان اسمه ناقصا كالذين فلا بد له من صلة وهو الذي يصفه به ليتم به المقصود ولا بد من رابط بين هذه الصلة والموصول ليعلم أنه المراد بذلك النداء وإن لم يردف باسم ناقص لم يحتج إلى ما ذكرناه فيقال يا أَيُّهَا النَّاسُ وأمثال هذا وأما إذا لم يقترن بالنداء أي فإن النداء يتصل باسم المنادي وقد يكون منادى منكورا مطولا مثل قوله تعالى يا حَسْرَةً عَلَى الْعِبادِ ومثل قوله يا عجبا قال الشاعر\n\n\n> يا عجبا لهذه الفليقه *** هل تذهبين القر بالربيقة\n\n\nوقد يكون منادى يعرف مثل يا جِبالُ أَوِّبِي مَعَهُ ولا يكون ما بعد النداء أبدا إلا منصوبا إما لفظا وإما معنى ولهذا عطف بالمنصوب على الموضع في قوله تعالى والطَّيْرَ بالنصب عطفا على موضع يا جبال وإن كان مرفوعا في اللفظ فقد يراعي اللفظ في أوقات ولهذا قرئ أيضا والطير بالرفع ولكل فصل من هذه الفصول حقائق إلهية لو لا التطويل لذكرناها فصلا فصلا فتركناها لمن يقف على كلامنا من العارفين كالتنبيه لهم على ما يتضمنه منزل النداء من المعاني الإلهية وأن الكون مرتبط بعضه ببعض ارتباط المعاني بالكلمات وربما جعلوا الواو من أدوات النداء ولكن خصوها بنداء خاص لحال خاص بخلاف سائر الأدوات فخصوها بالانتداب فينادون الميت وأجبلاه واسنداه وبه يعذب الميت الملك يطعنه في خاصرته أن هكذا كنت ويقولون وا زيداه وا سلطاناه ولا بد في هذا النداء من إدخال الهاء هاء السكت في آخره لأنه ليس من شرط هذا النداء أن يقال بعده شي‏ء فلهذا أدخل هاء السكت عليه فيكتفي به فيقول وا جبلاه وا حزناه ولا يحتاج إلى أمر آخر وإذا قلت يا زيد وناديته بسائر حروف النداء من غير نداء الندبة فلا بد أن تذكر السبب الذي ناديته من أجله فتقول يا جِبالُ أَوِّبِي مَعَهُ يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا يا أَيُّهَا النَّاسُ اتَّقُوا فلا تكون هاء السكت إلا في نداء الندبة خاصة وأما النداء المرخم فإنهم يريدون به تسهيل الكلام ليخف على المنادي ليصل إلى المقصود مسرعا بما\nحذفه من الكلمة فإن الترخيم التسهيل ومنه رخيم الدلال في وصف المعشوق المستحسن أي هو سهل ومثل الترخيم في المرخم هو أن تحذف الآخر من اسم المنادي فتقول إذا ناديت من اسمه حارث يا حار هلم فحذفت آخر الكلمة طلبا للتسهيل ولتعلم إن الأسماء وأسماء الأفعال على قسمين معرب ومبني فما تغير آخره بدخول العوامل سمي معربا والإعراب التغيير يقال أعربت معدة الرجل إذا تغيرت وقد تغير هذا الاسم من حال إلى حال هذا بعض وجوه اشتقاقه من كونه سمي معربا والمبني هو كل اسم لفعل كان أو لغير فعل ثبت على صفة واحدة لفظه ولم يؤثر فيه دخول العوامل التي تحدث التغيير في العرب عليه فسمي مبنيا من البناء لثبوته وعدم قبوله للتغيير وهذا له باب في الصفة الثبوتية للاله من كونه ذاتا ومن ثبوت نسبة الألوهية إليه دائما والمعرب له باب في المعارف الإلهية من قوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ وسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ فهذا الفرق بين المعرب والمبني فإذا رخم الاسم فقد ينتقل إعرابه إلى آخر ما يبقى من حروف الكلمة فتقول يا حار هلم بعد ما كانت الراء مكسورة نقل إليها حركة الثاء ليعرف السامع أنه قد حذف من الاسم حرف فإنه إنما يعرف المنادي اسمه إذا كان اسمه حارثا بالثاء فإذا حذف الثاء ربما يقول ما هو أنا فإذا نقل إلى الراء حركة الثاء علم أنه المقصود كذلك إذا نودي العبد باسم إلهي ربما يقع في نفسه أنه جدير بذلك الاسم فينقل وصف عبوديته إلى ذلك الاسم الإلهي الذي نودي به هذا العبد فيعرف أنه المقصود من كونه عبدا لاستصحاب الصفة له هذا إذا نقل وإذا لم ينقل حركة المحذوف من الاسم لما بقي وترك على حاله كان القصد في ذلك قصدا آخر وهو ترك كل حق على حقيقته حتى لا يكون لكون أثر في كون ولا يظهر لكون خلعة على كون ليكون المنفرد بذلك هو الله تعالى فإن الضمة التي على الثاء من حارث هي لباسه فإذا خلعها على الراء في الترخيم فقد خلع كون على كون فربما قصده المخلوع عليه بالعبودية له والثناء عليه والخلع على الحقيقة إنما هو للمتكلم المنادي لا لحرف الثاء فالمنادي هو الذي خلع على الراء الرفع الذي كان لحرف الثاء لما أزال عينه من الوجود كخلع القطبية والإمامة من الشخص الذي فقد عينه إلى الشخص الذي قام في ذلك المقام إذ كان الله هو الذي أقامه لا هذا الإمام الذي درج فهذا قد بينا في هذا المنزل بعض ما عندنا من أسراره ليقع التنبيه على ما فيه للطالب إن شاء الله تعالى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Seventy-Five: Concerning the Knowledge of the Station of Disavowal of Idols (التبري من الأوثان) from the Mosaic Station (المقام الموسوي), which is one of the Seven Stations of Command (منازل الأمر السبعة).\n\nThe stations of Command (الأمر) are by the call (الندا),\nStations that have no end.\n\nO, any, O, any, do not depart,\nFor your existence (كونكم) has no cessation.\n\nAnd any, any, that comes from Him,\nFor His Face, a seer (رآء) among us.\n\nArmies of letters (الحروف) have come,\nThe expanse (الفضاء) is too narrow to bear them.\n\nAll their spears are stars,\nSupported by the Command (الأمر) and the Decree (القضاء).\n\nShips whose sea is deep,\nWhose wind has sailed gently.\n\nSo adhere, O my brother, to a Knowledge (علما),\nFor which the earth and the heaven are too narrow.\n\nAnd leave the other (الغير) in its blindness,\nBy a witnessing (بمشهد) that is not the primordial cloud (العماء).\n\n### [Worshippers of the Idol]\n\nKnow that lowliness (الذلة) and need (الافتقار) can only proceed from existence (الكون) toward Allah, the Exalted. Thus, whoever humbles himself and feels need toward other than Allah, relies upon it, and finds tranquility in it concerning all his affairs, is an idol worshipper (عابد وثن). That object of need is called an idol (وثنا), and the one in need calls it a god (إلها). The subtlest of idols is the air, and the densest is stone, and everything in between.\n\nThis is why the polytheists (المشركون), when called to the unification of the Godhead (توحيد الإله) in its Divinity (ألوهته), said: <<أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ>> (Has he made the gods into one God? Indeed, this is a strange thing). People usually take the statement <<إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ>> (Indeed, this is a strange thing) as the saying of the disbelievers, since he called them to the unification of a Godhead (إله) while they believed in its multiplicity. However, in our view, this statement is from The Real (الحق) or the Messenger. The saying of the disbelievers ends at their statement: إِلهاً واحِداً (one God).\n\nThe astonishment (التعجب) is that the intellect (العقل) knows that the Godhead (الإله) cannot be made by a maker, for it is God unto itself. This is why the reproach occurred in His saying, the Exalted: <<أَ تَعْبُدُونَ ما تَنْحِتُونَ>> (Do you worship that which you carve?). The Godhead, by necessity of the intellect, is unaffected. Yet, this object was a piece of wood used for play or a stone used for cleansing, and then he took it and made it a god, humbling himself and feeling need toward it, calling upon it out of fear and hope. It is from such an act that astonishment arises, given the presence of intellect among them. The astonishment occurs so that those whose intellects are veiled from perceiving what is self-evident (بديهي) and necessary (ضروري) to them may know that all affairs are in the Hand of Allah, that the judgment (الحكم) belongs to Allah concerning them, and that intellects do not comprehend by themselves, but rather comprehend what they comprehend by what their Lord and Creator casts into them.\n\nThis is why their degrees vary: some intellects have a lock placed upon them, some are imprisoned in a hidden place (كن), and some have rust (صدا) appearing on their mirror. If intellects comprehended by themselves, they would not deny the unification of their Originator (موجدها) in some people while knowing it in others, since the definition (الحد) and the Reality (الحقيقة) are the same in both cases. For this reason, we hold that His saying, the Exalted, <<إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ>> is not the saying of the disbelievers.\n\n### [That the Station of Disavowal is among the Stations of Veiling and Concealment]\n\nKnow, O my brother, that this station (منزل) is one of the stations of veiling (الستر) and concealment (الكتمان), and of establishing the Divinity (الألوهة) in everything worshipped besides Allah. This is because the stone was not worshipped for its own sake, but rather it was worshipped from the perspective of the attribution of Divinity to it. For this reason, we mentioned that it is among the stations of concealment and veiling.\n\nThe Exalted said: <<وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ>> (And your Lord has decreed that you worship none but Him). And <<ولَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله>> (And if you ask them who created them, they will surely say, \"Allah\"). They never mentioned anything but the Divinity, and they did not mention the physical forms. Yet, Allah did not accept their excuse, but rather said: <<إِنَّكُمْ وما تَعْبُدُونَ من دُونِ الله>> (Indeed, you and what you worship other than Allah)—meaning that which is singled out by this Name—<<حَصَبُ جَهَنَّمَ>> (are the fuel of Hell). This is His saying: <<وَقُودُهَا النَّاسُ والْحِجارَةُ>> (Whose fuel is men and stones). This refers to everyone who called you to the worship of himself, or whom you worshipped, and who had the capacity to forbid you from that but did not. Such people will be among the fuel of Hell.\n\nThe monotheist (الموحد) worships Allah through two paths: the path of the Essence (الذات), in that it deserves the description of Divinity (الألوهة), and the path of the Divinity itself. The fortunate one is he who combines both, because the worshipper (العابد) is composed of a letter (حرف) and a meaning (معنى). The letter is for the letter, and the meaning is for the meaning. Therefore, we do not worship the Essence stripped of its description of Divinity, nor do we worship the Divinity without relating it to the One described by it. Worship is established only upon what the reality of the servant (العبد) necessitates, which is composition (التركيب), not upon what the Reality of The Real (حقيقة الحق) necessitates, which is absolute Oneness (الأحدية).\n\nFor this reason, the one who says his worship is a fulfillment of the right of Allah (حق الله) is mistaken if he intends the Essence, for its reality is absolute Oneness. It may be correct, however, for one to say, \"I only worship Him in fulfillment of the right of Lordship (الربوبية), not its reality,\" since every right has a reality. The right (الحق) is that aspect to which the worship of the servant relates, while the Reality (الحقيقة) is the absolute Oneness which neither relates nor is related to.\n\nThis is why the letter *Alif* (الألف) in the Divine arrangement (الوضع الإلهي) in Arabic script, if it appears at the beginning of a word, does not connect, nor is anything connected to it. If it appears at the end, some letters connect to it—by those who have no knowledge of the Absolute Oneness (الأحدية المطلقة) that this Essence (الذات) deserves—except for five letters only, out of all the letters: *Dāl* (الدال), *Dhāl* (الذال), *Rā’* (الراء), *Zāy* (الزاي), and *Wāw* (الواو). These are five states (أحوال); whoever is characterized by them knows the absolute Oneness, and his worship is essential (ذاتية), not accompanied by command (أمر). This is the worship of the meaning for the meaning, for the command is the worship of the letter for the letter.\n\nThe worshipper of the meaning perceives no difference between the Essence and the Divinity, nor any multiplicity (كثرة), but sees a single Entity (عينا واحدة) that deserves what this Gnostic (العارف) is upon, from the perspective of his meaning, not his letter. This is the station of Majesty (الجلال), Grandeur (العظمة), and the servant’s absolute Oneness (أحدية العبد) which granted him the knowledge of the Essential Oneness (الأحدية الذاتية), Transcendence (التنزيه), and Independence (الغني).\n\nThese are the five states indicated by the five letters that do not connect to the *Alif* when it occurs at the end of words, such as *Jubayrā*, *Azīzā*, *Ahadā*, *Idhā*, and *‘Uluwwā*. The non-connection of the *Alif* at the beginning of a word indicates His saying: \"Allah was, and there was nothing with Him,\" and He is now as He was, even with the existence of things, due to the non-connection, just as the *Alif* did not connect to the word. The non-connection of the five letters to the *Alif* at the end of the word indicates the state of knowledge of the station of certain servants among the knowers of Allah (العلماء بالله), but not others. They have removed the relationship (النسبة) between themselves and Allah, the Exalted, and they witness the Majesty, Grandeur, Oneness, Transcendence, and Independence that we mentioned.\n\nAs for those outside this group, they established a relationship (نسبة) and a link (رابطة) between the Godhead (الإله) and the object of worship (المألوه), and they did not distinguish between the Level (المرتبة) and the Essence (الذات), because they only knew Allah through their own souls (نفوسهم) by the rule of indication (الدلالة)—the reliance of the contingent (الممكن) upon the determinant (المرجح). They sought Him, and He sought them. They possess every letter that connects to the *Alif* at the end of the word. These great masters (الأكابر) also have a portion and an ample share in the station of these connecting letters, from the perspective of their 'letter-ness' (حرفيتهم), not their 'meaning-ness' (معناهم). The latter group were ignorant of this distinguishing factor between them, but they concealed this from the common people (العامة) and kept it private from their peers. <<يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ>> (He singles out for His mercy whom He wills).\n\nFor this reason, Junayd, the master of this group, said: \"No one reaches the degree of Reality (الحقيقة) until a thousand sincere ones (صديق) testify that he is a heretic (زنديق).\" This station harms those who are not its people, just as the scent of roses harms the dung beetle (الجعل), because the state they are in neither accepts this station nor is accepted by it. When people see them generally, they do not recognize them, because there is no apparent sign (أمر ظاهر) on their 'letter' (حرفهم) by which they are distinguished from the common folk. When people see them specifically—such as jurists (الفقهاء), theologians (أصحاب علم الكلام), and Islamic philosophers (حكماء الإسلام)—they declare them disbelievers (بتكفيرهم). And when philosophers (الفلاسفة) who are not bound by revealed laws see them, they say that these are people of delusion (أهل هوس), whose treasury of imagination (خزانة خيالهم) has been corrupted and whose intellects have weakened.\n\nThus, no one knows them except those like them, and the One who singled them out from His creation to Himself. The Exalted said concerning this meaning: <<وما قَدَرُوا الله حَقَّ قَدْرِهِ>> (And they did not appraise Allah with His true appraisal). These Gnostics have an ample share in this verse, as they are unknown to the common and the elite, the Muslim and the non-Muslim. They are the cherished ones (الضنائن), protected by the veils of jealousy (حجب الغيرة). None knows them but The Real (الحق). As for whether some of them know others, there is hesitation. They are the sought-after ones among the servants. May Allah join us with them, and I hope to be among them.\n\nAs for the Muslim’s disavowal (تبري) of that upon which the polytheist relies, his disavowal is only of the relationship (النسبة) and of the object to which the relationship is made (المنسوب إليه), not of the object itself (المنسوب). Thus, the polytheist and the Muslim agree on the object (المنسوب) but differ on the object to which the relationship is made and the relationship itself.\n\nThis is why the poll tax (الجزية) is not imposed upon the polytheist, and a distinction is made between him and the disbelievers (الكفار) from the People of the Revealed Books. The polytheist, through his polytheism (شركه), impugns The Real (الحق) and Existence (الكون). He has no basis (مستند) that protects him from being killed, because he impugns Monotheism (التوحيد) and the Messengers (الرسل). The disbelievers from the People of the Book did not impugn Monotheism nor Existence—meaning the Messengers—but they impugned a specific Messenger due to passion (هوى) or a doubt (شبهة) residing in their souls. What resided in them led them to deny The Real unjustly and arrogantly, despite their certainty of it, or due to a doubt that arose in them, whereby the truthfulness of the claimant was not established for them. For this reason, they generally had a valid basis in their view—though not in reality—that protected them from being killed. Thus, the poll tax was imposed upon them, and they were left upon their religion, so that they might establish it, or establish part of it, according to what they are guided to.\n\nHere is a subtle point (نكتة) for those who understand: their religion is sanctioned for them by our Law (شرعنا), since He confirmed them upon it. This is why the Messenger of Allah (peace and blessings be upon him), when he heard that the Romans (الروم) had prevailed over the Persians (فارس), showed joy on his face, despite the Romans being disbelievers in him. But the Messenger, due to his knowledge, was fair-minded, for he knew that the basis (مستند) of the Romans was the same as that relied upon by the People of The Real (أهل الحق), because they are People of the Book who believe in it. However, a doubt arose in them due to the distortion (تحريف) by their leaders of what was revealed to them, which prevented them from believing and affirming the prophethood of Muhammad (peace and blessings be upon him), or its universality. Our discussion here is with the fair-minded among their scholars. The Law excused them for this degree of knowledge that He knew they possessed, and He regarded the side of Allah, the Exalted, in them, since they affirmed His Oneness (وحدوه) and did not associate partners with Him, at a time when the Persians and the idol worshippers associated partners with Him and impugned the unification of the Godhead and the absolute Oneness it deserves. Such is the state of the Gnostics (العارفين) of this station.\n\nAs for the saying of the Messenger of Allah (peace and blessings be upon him) commanding us to oppose the People of the Book, it is only because they believed in part of it and disbelieved in part, and they desired <<أَنْ يَتَّخِذُوا بَيْنَ ذلِكَ سَبِيلًا>> (to take a way between that). So, he commanded us to oppose them in specific matters of rulings (الأحكام) and in what we have mentioned. If he had commanded us to oppose them absolutely, we would have been commanded to oppose what we were commanded to believe in. Therefore, absolute opposition to them is not valid. This is the meaning intended by his saying (peace and blessings be upon him): \"Oppose the People of the Book.\"\n\n### [That the Polytheist is Called a Disbeliever due to his Deviation from the Oneness of the Godhead]\n\nKnow that every polytheist (مشرك) is a disbeliever (كافر). The polytheist, by following his passion (هواه) in whom he associates partners with and takes as a god, and by deviating from the absolute Oneness (أحدية) of the Godhead, veils (يسترها) himself from looking at the proofs and signs that lead to the unification of the Godhead. He is therefore called a disbeliever (كافرا) due to that veiling (الستر), outwardly and inwardly. He is called a polytheist (مشركا) because he attributes Divinity (الألوهية) to other than Allah alongside Allah, thus establishing two attributions, and thereby associating partners (أشرك). This is the difference between the polytheist and the disbeliever.\n\nAs for the disbeliever who is not a polytheist, he is a monotheist (موحد), but he disbelieves in the Messenger and in part of his Book. His disbelief is of two types: The first type is that his disbelief concerns what came from Allah, similar to the polytheist’s disbelief regarding the unification of Allah. The second type is that he knows that the Messenger and what came from Allah is indeed from Allah, but he conceals this from the common people and the imitators (المقلدة) among his followers, desiring leadership (الرئاسة). This is what the Prophet (peace be upon him) meant in his letter to Caesar when he said: \"If you turn away, then upon you is the sin of the *Yarīsiyyīn*,\" meaning the followers (الأتباع).\n\n### [That the Vocative Particle and the Call Indicate Distance]\n\nKnow that the vocative particle (التأيه) and the call (النداء) indicate distance (البعد) from the state to which the caller invites the one being called. For example, when He says: <<يا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed), it is because of their distance from what they are called to—that they should believe in it—that they are called by this particle. If they were already characterized by the state to which they are called, then the distance relates to the future time (الزمان المستقبل) concerning them. That is, \"Remain firm upon your state which the religion has approved for you in the future,\" just as Jacob said to his sons: <<ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ>> (And do not die except while you are Muslims) while they were alive. He commanded them to be Muslims in the future, meaning to remain firm upon it. Since the future is distant from the present time, the vocative particle also applies to something existing in the present, commanding it to remain in the future. The Exalted said: <<يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ>> (O you who have believed, fulfill [your] contracts). They were already in the state of fulfilling the contract of faith, for He described them by faith in His call to them. Thus, the distance was in the contracts, whenever they accepted them.\n\n### [That the Divine Call is General, Including the Believer, the Disbeliever, the Obedient, and the Disobedient]\n\nKnow that the Divine Call (النداء الإلهي) is general, encompassing the believer, the disbeliever, the obedient, the disobedient, the spirits (الأرواح), and the spiritual beings (الروحانيين). The call only proceeds from the Divine Names (الأسماء الإلهية). A Divine Name calls upon one who is governed by another Divine Name, when it knows that the duration of the latter’s governance over him has ended. This Name that called him then takes him, both in this world and the Hereafter.\n\nThus, everyone other than Allah, the Exalted, is called (منادى). A Divine Name calls him for a cosmic state (حال كوني) that it seeks from him, so that it may deliver him to it. If he responds, he is called obedient (مطيعا) and is happy (سعيدا). If he does not respond, he is called disobedient (عاصيا) and is wretched (شقيا).\n\nIf someone asks: \"How can the call come from a Divine Name, yet the creature refuses to respond, despite its weakness and acceptance of Divine Power (الاقتدار الإلهي)?\" We reply: His refusal to respond is not from his own self or reality, because he is perpetually subjugated (مقهور). However, since he is under the subjugation (قهر) of another Divine Name, that Name does not allow him to respond to the one who called him. Thus, the conflict occurs between the Divine Names, which are equals (أكفاء). The judgment belongs to the possessor of the hand (صاحب اليد), which is the Name that holds him at the time the other Name calls. For this reason, it is stronger for the present state.\n\nIf you say: \"Then why is he held accountable for the refusal (الإباءة)?\" We reply: Because he claimed the refusal for himself and did not attribute it to the Divine Name under whose subjugation he was. If you say: \"The matter remains that he only refused due to the subjugation of a Divine Name, so the refusal came from that Name in the one called,\" We reply: You speak truly, but he was ignorant of that, so he was held accountable for his ignorance. If you say: \"But his ignorance is due to a Divine Name that governs him,\" We reply: Ignorance (الجهل) is a non-existent matter (أمر عدمي), not an existent one (وجودي). The Divine Names grant existence (الوجود), not non-existence (العدم). Non-existence belongs to the one called, from himself, and ignorance is the non-existence of knowledge. The objector did not understand the nature of his objection. The Divine Names only grant existence, so what you mentioned is not necessary, and the objection from this questioner is cut off by what we have mentioned.\n\nSince it is established that the call (النداء) is general, the Caller (المنادي) is also general. However, the call of The Real (نداء الحق) only occurs through that which brings happiness (السعادة) to the servant in his response. As for the call that brings wretchedness (الشقاوة) to the servant, that is not the call of The Real.\n\nThe call is a quality of Speech (صفة الكلام). Every act (فعل) performed by the servant is divided into two types: an act that brings happiness to that servant, which is accompanied by the call of Allah, the Exalted; and an act that is not accompanied by the servant’s happiness, which is not from the call of The Real, but rather from the Will (إرادة) of The Real and His creation (خلقه), not from His call (ندائه) and the command of His Law (أمر شرعه). The negation of happiness in an act is of two types: one is an act that is accompanied by neither wretchedness nor happiness; the other is an act that is accompanied by wretchedness. The act accompanied by wretchedness is of two types: one that is accompanied by eternal wretchedness, which is the wretchedness of polytheism (الشرك); and one that is not accompanied by eternal wretchedness, which is every act that is not polytheism and contains absolutely no call from The Real. This station is the station of the Call (منزل النداء), not the station of Acts (منزل الأفعال). The stations of Acts will come, God willing. Some Gnostics confuse this station and its brethren with the station of Acts, because they see the call through acts, but the station is not one in this regard; rather, the Call has a station, and the Act has a station.\n\n### [That the Call is of Levels]\n\nKnow that the Call (النداء) is of levels (مراتب), and each level has a specific tool (أداة معينة). The tools are *al-Hamza* (الهمزة), *Yā* (يا), *Ayyā* (أيا), *Hayyā* (هيأ), and *Ay* (أي) with a quiescent *Yā*. The closest in rank is *al-Hamza*, and the farthest is *Hayyā*.\n\nThe call may be accompanied by a warning (التنبيه) or not. If the call is made with *Ay* (أي), it is indefinite (نكرة), so a warning is necessary, because the call seeks definition (التعريف), and it is by the caller himself. Therefore, the *Hā’* of warning (هاء التنبيه) must accompany *Ay* in the call, because the warning is a definition. Then, the name of the one being called is added after the warning, so that the one called knows that he is the one being addressed, not another. If his name is incomplete, like *al-Ladhīna* (الذين), it requires a relative clause (صلة) that describes him, so that the intended meaning is completed. A link (رابط) between this relative clause and the antecedent is necessary to know that he is the one intended by that call. If the call is not followed by an incomplete name, what we mentioned is not needed, and one says: <<يا أَيُّهَا النَّاسُ>> (O mankind) and similar phrases.\n\nIf *Ay* is not attached to the call, the call connects directly to the name of the one being called. The one called may be indefinite and extended (منكورا مطولا), such as His saying, the Exalted: <<يا حَسْرَةً عَلَى الْعِبادِ>> (Oh, the regret upon the servants), and His saying: *Yā ‘ajabā* (Oh, wonder!). The poet said:\n\n> O wonder at this calamity,\n> Will you remove the cold with the rope?\n\nThe one called may be definite, such as: <<يا جِبالُ أَوِّبِي مَعَهُ>> (O mountains, repeat [praises] with him). What follows the call is always in the accusative case (منصوبا), either literally or conceptually. For this reason, the accusative case was used by conjunction (عطف) on the position (الموضع) in His saying, the Exalted, <<والطَّيْرَ>> (and the birds) in the accusative, by conjunction on the position of *Yā Jibāl* (O mountains), even though it is nominative in pronunciation. Sometimes the pronunciation is observed, and for this reason, *wa-al-ṭayru* (والطير) was also read in the nominative.\n\nEach of these sections contains Divine Realities (حقائق إلهية). Were it not for the length, we would have mentioned them section by section. We leave them for the Gnostics who come across our words, as an alert to them regarding the Divine meanings contained within the station of the Call, and that existence (الكون) is linked, one part to another, like the linking of meanings to words.\n\nSometimes the letter *Wāw* (الواو) is considered one of the tools of the call, but they restrict it to a specific call for a specific state, unlike the other tools. They restrict it to lamentation (الندبة). Thus, they call the dead: *Wā Jabalāh* (Oh, my mountain!) and *Wā Sanadāh* (Oh, my support!). By this, the dead person is tormented: the angel stabs him in his side, saying, \"You were like this!\" They say: *Wā Zaydāh* (Oh, Zayd!) and *Wā Sulṭānāh* (Oh, my Sultan!). In this call, the *Hā’* of pause (هاء السكت) must be inserted at the end, because it is not a condition of this call that anything be said after it. Therefore, the *Hā’* of pause is inserted, and it suffices, so one says *Wā Jabalāh* and *Wā Ḥuznāh* (Oh, my sorrow!), and no other matter is needed.\n\nIf you say *Yā Zayd* (O Zayd) and call him with the other letters of the call, excluding the call of lamentation, you must mention the reason for which you called him. So you say: <<يا جِبالُ أَوِّبِي مَعَهُ>> (O mountains, repeat [praises] with him), <<يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا>> (O you who have believed, fulfill), <<يا أَيُّهَا النَّاسُ اتَّقُوا>> (O mankind, fear [Allah]). The *Hā’* of pause is only found specifically in the call of lamentation (نداء الندبة).\n\nAs for the truncated call (النداء المرخم), they intend by it the facilitation of speech (تسهيل الكلام) so that it is light upon the caller, allowing him to reach the intended meaning quickly by what he has omitted from the word. Truncation (الترخيم) is facilitation. From this comes the phrase *rakhīm al-dalāl* (soft in coquetry) in describing the beautiful beloved, meaning he is easygoing. The example of truncation in the truncated name is that you omit the last letter of the name of the one being called. So, if you call someone named *Ḥārith* (حارث), you say *Yā Ḥār* (يا حار), \"Come here,\" having omitted the last letter of the word seeking facilitation.\n\nKnow that nouns and verbal nouns are of two types: inflected (معرب) and uninflected (مبني). That whose ending changes due to the entry of governing particles is called inflected (*mu‘rab*). Inflection (*I‘rāb*) is change; it is said, \"The man's stomach *i‘rabat* (changed/spoiled)\" if it changed. This name changes from one state to another—this is one aspect of its derivation for being called *mu‘rab*. The uninflected (*mabni*) is every noun, whether for a verb or otherwise, whose pronunciation remains fixed upon a single state, and the entry of governing particles that cause change in the inflected noun does not affect it. It is called uninflected (*mabni*) from the concept of building (البناء), due to its permanence and its refusal to accept change.\n\nThis has a chapter in the fixed Attribute (الصفة الثبوتية) of the Godhead, in that He is an Essence (ذات) and in the permanence of the attribution of Divinity to Him always. The inflected (*mu‘rab*) has a chapter in the Divine Gnosis (المعارف الإلهية), from His saying: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in [a different] manifestation) and <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> (We will attend to you, O two heavy ones). This is the difference between the inflected and the uninflected.\n\nWhen a name is truncated, its inflection may be transferred to the last remaining letter of the word. So you say *Yā Ḥār* (O Ḥār), \"Come here,\" after the *Rā’* was originally quiescent. The vowel mark of the *Thā’* is transferred to it, so that the listener knows that a letter has been omitted from the name. If the listener only knows the one being called by his name *Ḥārith* (with the *Thā’*), and the *Thā’* is omitted, he might say, \"That is not me.\" But if the vowel mark of the *Thā’* is transferred to the *Rā’*, he knows that he is the one intended.\n\nSimilarly, when the servant is called by a Divine Name, it may occur to him that he is worthy of that Name. He then transfers the description of his servitude (عبوديته) to that Divine Name by which he was called, and he knows that he is the one intended, due to his being a servant who retains the attribute. This is if the vowel mark is transferred.\n\nIf the vowel mark of the omitted letter is not transferred to the remaining part, and it is left in its original state, the intention behind this is another intention: to leave every right upon its reality (حقيقته), so that no existence (كون) has an effect on another existence, and no robe of honor (خلعة) of one existence appears upon another existence. This is so that the One singled out for this is Allah, the Exalted. The *ḍammah* (vowel mark) on the *Thā’* of *Ḥārith* is its garment. If it is bestowed upon the *Rā’* in truncation, then one existence has bestowed upon another existence. The one upon whom it is bestowed might then intend servitude and praise toward the bestower.\n\nIn reality, the bestowal (الخلع) belongs to the Speaker, the Caller, not to the letter *Thā’*. The Caller is the one who bestowed the nominative case (الرفع) that belonged to the letter *Thā’* upon the *Rā’* when He removed the *Thā’* from existence—like the removal of the Pole (القطبية) or the Imamate (الإمامة) from a person whose physical entity is lost, to the person who stands in that station, since it was Allah who established him, not the departed Imam.\n\nWe have thus explained some of the secrets we possess regarding this station, so that the seeker may be alerted to what it contains, God willing. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر دو سو پچھتر: مقامِ موسوی میں بتوں سے بیزاری (التبري من الأوثان) کے منزل کی معرفت میں، اور یہ سات منازلِ امر میں سے ایک ہے۔\n\nندا کے ذریعے امر کی منازل ہیں، ایسی منازل جن کا کوئی اختتام نہیں۔\nاے کوئی، اے کوئی، جدا نہ ہو، کیونکہ تمہاری کائنات (الکون) کو زوال نہیں۔\nاور کوئی بھی اس سے ہو، اس کے چہرے کے لیے ہمارے درمیان دیکھنے والا ہے۔\nحروف کے لشکر آئے ہیں، جن کے بوجھ سے فضا تنگ ہے۔\nان کے نیزے سب ستارے ہیں، جن کی تائید امر اور قضا نے کی ہے۔\nگہرے سمندر کی کشتیاں، جنہیں نرم ہوا نے چیرا ہے۔\nپس اے میرے بھائی! اس علم کو لازم پکڑ، جس کے لیے زمین و آسمان تنگ ہیں۔\nاور غیر کو اس کی اندھیری میں چھوڑ دے، ایسے مشاہدے کے ساتھ جو اندھیرا نہیں۔\n\n### [بتوں کے پجاری]\n\nجان لو کہ کائنات (الکون) میں ذلت اور محتاجی صرف اللہ تعالیٰ کے لیے ہی ہو سکتی ہے۔ پس جو کوئی بھی اللہ تعالیٰ کے سوا کسی اور کے سامنے ذلت اختیار کرے، اس کا محتاج ہو، اس پر بھروسہ کرے اور اپنے ہر معاملے میں اس کی طرف سکون پائے، تو وہ بت کا پجاری ہے۔ اور جس کا وہ محتاج ہوتا ہے، اسے بت (وثن) کہا جاتا ہے، اور محتاج اسے معبود (إلٰہ) کہتا ہے۔ بتوں میں سب سے لطیف ہوا ہے اور سب سے کثیف پتھر، اور جو کچھ ان دونوں کے درمیان ہے۔ اسی لیے مشرکوں نے جب انہیں الوہیت (الألوهة) میں معبود (إلٰہ) کی توحید کی دعوت دی گئی تو کہا: **أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ** (کیا اس نے سب معبودوں کو ایک ہی معبود بنا دیا؟ بے شک یہ تو بڑی عجیب بات ہے!) (ص: 5)\n\nلوگ اس قول **إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ** کو کفار کا قول سمجھتے ہیں، کیونکہ انہیں ایک معبود کی توحید کی دعوت دی گئی جبکہ وہ کثرتِ معبودان کا عقیدہ رکھتے تھے۔ لیکن ہمارے نزدیک یہ ذات حق (الحق) یا رسول کا قول ہے۔ جہاں تک کفار کے قول کا تعلق ہے، وہ **إِلهاً واحِداً** پر ختم ہو جاتا ہے۔ اور یہ تعجب اس لیے ہے کہ عقل اس کی تاویل کرتی ہے، انسان جانتا ہے کہ معبود کسی بنانے والے کے بنانے سے نہیں بنتا، کیونکہ وہ اپنی ذات کے لیے معبود ہے۔ اسی لیے اللہ تعالیٰ کے اس قول میں سرزنش واقع ہوئی ہے: **أَ تَعْبُدُونَ ما تَنْحِتُونَ** (کیا تم ان چیزوں کو پوجتے ہو جنہیں تم خود تراشتے ہو؟) (الصافات: 95)\n\nاور معبود (الإلٰہ) عقلی ضرورت کے تحت متاثر نہیں ہوتا۔ حالانکہ یہ (بت) پہلے ایک لکڑی تھی جس سے کھیلا جاتا تھا، یا ایک پتھر تھا جسے استنجاء کے لیے استعمال کیا جاتا تھا، پھر اس نے اسے لیا اور ایک معبود بنا دیا جس کے سامنے وہ ذلت اختیار کرتا ہے، محتاجی ظاہر کرتا ہے، اور خوف و طمع سے اسے پکارتا ہے۔ اس طرح کی چیزوں سے تعجب واقع ہوتا ہے، جبکہ ان کے پاس عقل موجود ہے۔ پس یہ تعجب اس لیے واقع ہوا تاکہ وہ لوگ جان لیں جن کی عقلیں ان چیزوں کے ادراک سے پردہ میں ہیں جو ان کے لیے بدیہی اور ضروری ہیں۔ یہ اس لیے تاکہ تم جان لو کہ تمام امور اللہ کے ہاتھ میں ہیں، اور حکم اسی کا ہے، اور عقلیں خود سے نہیں سمجھتیں، بلکہ وہ وہی سمجھتی ہیں جو ان کا رب اور خالق ان پر القا کرتا ہے۔ اسی لیے ان کے درجات میں تفاوت ہوتا ہے۔ بعض عقلیں ایسی ہیں جن پر قفل لگا دیا گیا ہے، اور بعض عقلیں ایسی ہیں جو کسی کن (خزانے) میں محبوس ہیں، اور بعض عقلیں ایسی ہیں جن کے آئینے پر زنگ چڑھ گیا ہے۔ اگر عقلیں خود سے سمجھتیں تو ایک قوم میں اپنے خالق کی توحید کا انکار نہ کرتیں اور دوسری قوم میں اسے جان نہ لیتیں، حالانکہ حد اور حقیقت دونوں میں یکساں ہیں۔ اسی لیے ہم نے اللہ تعالیٰ کے قول **إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ** کو کفار کا قول نہیں قرار دیا۔\n\n### [یہ کہ بیزاری کی منزل پردہ پوشی اور اخفا کی منازل میں سے ہے]\n\nپس اے میرے بھائی! جان لو کہ یہ منزل پردہ پوشی (الستر) اور اخفا (الکتمان) کی منازل میں سے ایک ہے، اور یہ اللہ کے سوا ہر اس چیز میں الوہیت (الألوهة) کے اقرار کی منزل ہے جس کی عبادت کی گئی، کیونکہ پتھر کی عبادت اس کی ذات کی خاطر نہیں کی گئی، بلکہ اس حیثیت سے کی گئی کہ الوہیت کی نسبت اس کی طرف کی گئی۔ اسی لیے ہم نے ذکر کیا کہ یہ اخفا اور پردہ پوشی کی منازل میں سے ہے۔ اللہ تعالیٰ فرماتا ہے: **وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ** (اور تیرے رب نے فیصلہ کر دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو) (الإسراء: 23) اور **وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ** (اور اگر تم ان سے پوچھو کہ انہیں کس نے پیدا کیا تو وہ ضرور کہیں گے: اللہ نے) (الزخرف: 87)۔\n\nپس انہوں نے کبھی بھی الوہیت کے سوا کسی چیز کا ذکر نہیں کیا، اور نہ ہی انہوں نے اشخاص کا ذکر کیا۔ لیکن اللہ نے ان کا عذر قبول نہیں کیا، بلکہ فرمایا: **إِنَّكُمْ وَما تَعْبُدُونَ مِنْ دُونِ اللَّهِ** (بے شک تم اور جن کی تم اللہ کے سوا عبادت کرتے ہو) یعنی وہ جو اس نام میں منفرد ہے، **حَصَبُ جَهَنَّمَ** (جہنم کا ایندھن ہو) (الأنبیاء: 98) اور یہی اس کا قول ہے: **وَقُودُهَا النَّاسُ وَالْحِجارَةُ** (جس کا ایندھن انسان اور پتھر ہیں) (البقرۃ: 24) اور یہ ہر وہ شخص ہے جس نے تمہیں اپنی عبادت کی طرف بلایا یا تم نے اس کی عبادت کی، اور اس کے بس میں تھا کہ وہ تمہیں اس سے منع کرتا مگر اس نے منع نہیں کیا۔ ایسے لوگ جہنم کا ایندھن ہوں گے۔\n\nپس موحد اللہ کی عبادت دو طریقوں سے کرتا ہے: ایک ذات (الذات) کے طریقے سے، اس حیثیت سے کہ وہ الوہیت کے وصف کی مستحق ہے، اور دوسرا الوہیت (الألوهة) کے طریقے سے۔ پس وہ سعید ہے جو ان دونوں کو جمع کرتا ہے، کیونکہ عابد حرف اور معنی سے مرکب ہے۔ پس حرف حرف کے لیے ہے اور معنی معنی کے لیے۔ اسی لیے ہم نے ذات (الذات) کی عبادت نہیں کی جبکہ وہ الوہیت کے وصف سے معریٰ ہو، اور نہ ہی الوہیت کی عبادت کی جبکہ اس کی نسبت کسی موصوف کی طرف نہ ہو۔ پس عبادت صرف اسی چیز پر قائم ہوئی جس کا تقاضا عبد (العبد) کی حقیقت کرتی ہے، یعنی ترکیب پر، نہ کہ اس چیز پر جس کا تقاضا ذات حق (الحق) کی حقیقت کرتی ہے، یعنی احدیت پر۔\n\nاسی لیے وہ شخص جو اپنی عبادت میں کہتا ہے کہ یہ اللہ کے حق کی ادائیگی کے لیے ہے، وہ درست نہیں ہوتا اگر اس کی مراد ذات (الذات) ہو۔ کیونکہ اس کی حقیقت احدیت ہے۔ البتہ اس شخص کا قول صحیح ہو سکتا ہے جو کہے کہ میں اس کی عبادت ربوبیت (الربوبية) کے حق کی ادائیگی کے لیے کرتا ہوں، نہ کہ اس کی حقیقت کے لیے۔ کیونکہ ہر حق کی ایک حقیقت ہوتی ہے۔ پس حق وہ ہے جس کے ساتھ عابد کی عبادت کا تعلق ہوتا ہے، اور حقیقت وہ احدیت ہے جس کا نہ تعلق ہوتا ہے اور نہ ہی اس سے تعلق رکھا جاتا ہے۔\n\nاسی لیے عربی خط میں الٰہی وضع کے اعتبار سے الف جب کلمے میں پہلے آتا ہے تو نہ وہ جڑتا ہے اور نہ ہی اس سے کوئی چیز جڑتی ہے۔ اور جب وہ آخر میں آتا ہے تو اس سے بعض حروف جڑ جاتے ہیں، ان لوگوں میں سے جنہیں اس مطلق احدیت کا علم نہیں جو اس ذات کی مستحق ہے، سوائے پانچ حروف کے اور کوئی نہیں، جو تمام حروف میں سے ہیں: دال، ذال، را، زا، اور واؤ۔ یہ پانچ احوال ہیں، جو ان سے متصف ہوا وہ احدیت کو پہچان گیا، اور اس کی عبادت ذاتی ہو گئی، جس کے ساتھ کوئی امر شامل نہیں ہوا، اور یہ معنی کی معنی کے لیے عبادت ہے۔ کیونکہ امر حرف کی حرف کے لیے عبادت ہے۔\n\nپس معنی کے عابد کے دل میں ذات اور الوہیت کے درمیان کوئی فرق یا کثرت نہیں آتی، بلکہ وہ ایک ہی عین (ذات) کو دیکھتا ہے جو اس چیز کی مستحق ہے جس پر یہ عارف ہے، اپنی معنی کے لحاظ سے نہ کہ اپنے حرف کے لحاظ سے۔ اور یہ جلال، عظمت، اور عبد کی احدیت کا مقام ہے، جس نے اسے ذاتی احدیت، تنزیہ اور غنی کی معرفت (المعرفۃ) عطا کی۔\n\nپس یہ پانچ احوال ہیں جن پر وہ پانچ حروف دلالت کرتے ہیں جو کلمے کے آخر میں واقع ہونے والے الف سے نہیں جڑتے، جیسے: جبیرا، عزیزا، أحدا، إذا، اور علوا۔ پس کلمے کے شروع میں الف کا عدم اتصال اس قول پر دلالت کرتا ہے کہ \"اللہ تھا اور اس کے ساتھ کوئی شے نہیں تھی\"، اور وہ اب بھی ویسا ہی ہے جیسا کہ وہ تھا، اشیاء کے وجود کے باوجود، عدم اتصال کے ذریعے، جیسا کہ الف کلمے سے نہیں جڑا۔ اور کلمے کے آخر میں پانچ حروف کا اس سے نہ جڑنا بعض بندوں کے مقامِ معرفت پر دلالت کرتا ہے جو اللہ کے عالم ہیں، دوسروں کے برعکس، جہاں انہوں نے اپنے اور اللہ تعالیٰ کے درمیان نسبت کو ختم کر دیا، اور وہ اس جلال، عظمت، احدیت، تنزیہ اور غنی کا مشاہدہ کرنے والے ہیں۔\n\nاور اس گروہ کے علاوہ باقی لوگوں نے معبود (الإلٰہ) اور مألوہ (جس کی عبادت کی جائے) کے درمیان ایک نسبت اور رابطہ قائم کیا، کیونکہ انہوں نے مرتبے اور ذات میں فرق نہیں کیا، جب انہوں نے اللہ کو صرف اپنے نفوس سے جانا، دلالت کے حکم کے تحت، ممکن کے مرجح (ترجیح دینے والے) پر انحصار کی وجہ سے۔ پس انہوں نے اسے طلب کیا اور اس نے انہیں طلب کیا، اور ان کے لیے حروف میں سے ہر وہ حرف ہے جو کلمے کے آخر میں الف سے جڑتا ہے۔ اور ان اکابر کے لیے بھی ان حروف کی منزل میں ایک حصہ اور وافر نصیب ہے جو ان سے جڑے ہیں، ان کی حرفیت کے لحاظ سے نہ کہ ان کے معنی کے لحاظ سے۔ اور یہ لوگ اس فرق کرنے والی قدر سے ناواقف رہے، لیکن انہوں نے اسے عوام سے چھپایا اور اپنے ہم شکلوں سے الگ تھلگ رہے، **يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ** (وہ جسے چاہتا ہے اپنی رحمت کے لیے خاص کر لیتا ہے) (البقرۃ: 105)۔\n\nاسی وجہ سے اس گروہ کے سردار جنید نے فرمایا: کوئی شخص حقیقت کے درجے کو نہیں پہنچتا جب تک کہ ہزار صدیق اس کے بارے میں یہ گواہی نہ دیں کہ وہ زندیق ہے۔ کیونکہ یہ مقام اس شخص کو نقصان پہنچاتا ہے جو اس کا اہل نہیں، جیسا کہ گلاب کی خوشبو گندگی کے کیڑے کو نقصان پہنچاتی ہے، کیونکہ جس حال پر وہ ہیں وہ اس مقام کو قبول نہیں کرتا اور نہ ہی یہ مقام انہیں قبول کرتا ہے۔\n\nپس جب لوگ انہیں عام حالت میں دیکھتے ہیں تو انہیں پہچان نہیں پاتے، کیونکہ ان کے حرف پر کوئی ظاہری امر نہیں ہوتا جو انہیں عوام سے ممتاز کرے۔ اور جب لوگ انہیں خاص حالت میں دیکھتے ہیں، جیسے فقہاء، علم کلام کے ماہرین، اور حکماء اسلام، تو وہ ان کی تکفیر کرتے ہیں۔ اور جب وہ حکماء دیکھتے ہیں جو نازل شدہ شریعتوں کے پابند نہیں، جیسے فلاسفہ، تو وہ کہتے ہیں کہ یہ لوگ وہمی ہیں، ان کے خیال کا خزانہ بگڑ گیا ہے اور ان کی عقلیں کمزور ہو گئی ہیں۔\n\nپس انہیں ان کے سوا کوئی نہیں پہچانتا، اور وہ جس نے انہیں اپنی مخلوق سے کاٹ کر اپنی طرف کر لیا۔ اللہ تعالیٰ اس معنی میں فرماتا ہے: **وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ** (اور انہوں نے اللہ کی قدر نہیں کی جیسا کہ اس کی قدر کرنے کا حق ہے) (الأنعام: 91)۔ اور ان لوگوں کا اس آیت میں وافر حصہ ہے، جہاں انہیں عام و خاص، مسلمان اور غیر مسلم سب نے جہالت کا نشانہ بنایا۔ پس وہ غیرت کے پردوں میں محفوظ ضنائن (خزانے) ہیں، جنہیں ذات حق (الحق) کے سوا کوئی نہیں جانتا۔ اور کیا وہ ایک دوسرے کو جانتے ہیں؟ اس میں توقف ہے۔ اور وہ بندوں میں مطلوب ہیں، اللہ ہمیں ان کے ساتھ ملا دے، اور میں امید کرتا ہوں کہ میں ان میں سے ہوں گا۔\n\nجہاں تک مسلمان کی اس چیز سے بیزاری (التبري) کا تعلق ہے جس پر مشرک نے انحصار کیا، تو اس کی بیزاری صرف نسبت اور منسوب الیہ سے ہے، نہ کہ منسوب سے۔ پس مشرک اور مسلمان منسوب میں جمع ہو گئے، اور منسوب الیہ اور نسبت میں جدا ہو گئے۔\n\nاسی لیے مشرک پر جزیہ نہیں لگایا گیا اور اس کے اور نازل شدہ کتابوں کے کفار کے درمیان فرق کیا گیا۔ کیونکہ مشرک اپنے شرک کے ذریعے ذات حق (الحق) اور کائنات (الکون) دونوں میں قدح کرتا ہے۔ پس اس کے پاس کوئی ایسا سہارا نہیں جو اسے قتل سے بچا سکے، کیونکہ اس نے توحید اور رسولوں میں قدح کی۔\n\nاور اہل کتاب کے کفار نے توحید میں یا کائنات (الکون) میں، یعنی رسولوں میں، قدح نہیں کی، لیکن انہوں نے ایک مخصوص رسول میں قدح کی، کسی خواہش یا شبہ کی وجہ سے جو ان کے نفوس میں قائم تھا، جس نے انہیں ظلم اور سرکشی کے ساتھ حق کے انکار کی طرف لے گیا، حالانکہ انہیں اس کا یقین تھا۔ یا پھر کسی شبہ کی وجہ سے جو ان کے ہاں قائم ہوا، اور ان کے نزدیک صاحبِ دعوت کی سچائی ثابت نہ ہو سکی۔ اسی لیے انہیں مجموعی طور پر ایک ایسا سہارا حاصل تھا جو ان کے نزدیک صحیح تھا، نہ کہ نفس الامر میں، جو انہیں قتل سے بچاتا تھا۔ پس ان پر جزیہ لگایا گیا اور انہیں ان کے دین پر چھوڑ دیا گیا تاکہ وہ اسے قائم رکھیں یا اس کا کچھ حصہ قائم رکھیں، جس قدر انہیں توفیق ملے۔\n\nاور یہاں ایک لطیف نکتہ ہے سمجھنے والے کے لیے کہ ان کا دین ہماری شریعت کے ذریعے ان کے لیے مشروع قرار دیا گیا، جہاں انہیں اس پر برقرار رکھا گیا۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم جب سنتے کہ روم نے فارس پر غلبہ پا لیا ہے تو آپ کے چہرے پر خوشی کے آثار ظاہر ہوتے تھے، حالانکہ روم آپ صلی اللہ علیہ وسلم کے کافر تھے۔ لیکن رسول صلی اللہ علیہ وسلم اپنے علم کی وجہ سے منصف تھے، کیونکہ آپ جانتے تھے کہ روم کا سہارا وہی ہے جس پر اہل حق نے انحصار کیا، کیونکہ وہ اہل کتاب ہیں جو اس پر ایمان رکھتے ہیں، لیکن ان کے ائمہ کی تحریف کی وجہ سے ان پر ایک شبہ طاری ہو گیا جو ان کے اور محمد صلی اللہ علیہ وسلم کی نبوت پر ایمان اور اقرار کے درمیان حائل ہو گیا، یا اس کی عمومیت کے درمیان۔ اور ہماری گفتگو ان کے منصف علماء کے ساتھ ہے۔ پس شریعت نے انہیں اس قدر کے لیے معذور قرار دیا جو اس نے ان میں جانا، اور ان میں ذات حق (الحق) تعالیٰ کے پہلو کا لحاظ رکھا، جہاں انہوں نے اس کی توحید کی اور اس کے ساتھ شرک نہیں کیا، جبکہ فارس اور بتوں کے پجاریوں نے شرک کیا اور معبود (الإلٰہ) کی توحید اور اس کے مستحق احدیت میں قدح کی۔ عارفین کا حال بھی اسی مقام میں ایسا ہی ہے۔\n\nجہاں تک رسول اللہ صلی اللہ علیہ وسلم کا ہمیں اہل کتاب کی مخالفت کا حکم دینے کا قول ہے، وہ صرف اس لیے ہے کہ انہوں نے اس کے بعض حصے پر ایمان لایا اور بعض کا انکار کیا، اور ارادہ کیا کہ **أَنْ يَتَّخِذُوا بَيْنَ ذلِكَ سَبِيلًا** (اس کے درمیان کوئی راستہ اختیار کریں) (النساء: 150)۔ پس ہمیں مخصوص احکام کے بعض امور میں اور جو ہم نے ذکر کیا اس میں ان کی مخالفت کا حکم دیا گیا۔ اگر ہمیں مطلقاً ان کی مخالفت کا حکم دیا جاتا تو ہم اس ایمان کے خلاف کام کرنے کے مامور ہوتے جس کا ہمیں حکم دیا گیا ہے۔ لہٰذا مطلقاً ان کی مخالفت صحیح نہیں ہے۔ یہی مراد ہے رسول اللہ صلی اللہ علیہ وسلم کے اس قول سے: **خالفوا أهل الكتاب** (اہل کتاب کی مخالفت کرو)۔\n\n### [یہ کہ مشرک معبود کی احدیت سے انحراف کی وجہ سے کافر کہلاتا ہے]\n\nجان لو کہ ہر مشرک کافر ہے۔ مشرک جس کے ساتھ شرک کرتا ہے اس میں اپنی خواہش کی پیروی کرنے اور معبود (الإلٰہ) کی احدیت سے انحراف کرنے کی وجہ سے، جو اسے توحیدِ الٰہی کی طرف لے جانے والی دلائل اور آیات پر غور کرنے سے پردہ میں رکھتا ہے، اس پردہ پوشی کی وجہ سے ظاہراً اور باطناً کافر کہلاتا ہے۔ اور مشرک اس لیے کہلاتا ہے کہ اس نے اللہ کے ساتھ غیر اللہ کی طرف الوہیت کی نسبت کی، پس اس نے اس کے لیے دو نسبتیں بنا دیں، اور شرک کیا۔ یہ مشرک اور کافر کے درمیان فرق ہے۔\n\nجہاں تک اس کافر کا تعلق ہے جو مشرک نہیں، تو وہ موحد ہے، لیکن وہ رسول اور اس کی کتاب کے بعض حصے کا کافر ہے۔ اور اس کا کفر دو طرح کا ہے: ایک یہ کہ اس کا کفر اس چیز کے ساتھ ہو جو اللہ کی طرف سے آئی ہے، جیسے مشرک کا کفر اللہ کی توحید میں۔ دوسرا یہ کہ وہ رسول اللہ اور جو کچھ اللہ کی طرف سے آیا ہے، اسے اللہ کی طرف سے جانتا ہو، لیکن وہ عوام اور اپنے پیروکاروں کے مقلدین سے اسے چھپاتا ہو، ریاست کی خواہش میں۔ اور یہی وہ ہے جس کا اشارہ علیہ السلام نے قیصر کو اپنے خط میں فرمایا: **فإن توليت فإن عليك إثم اليريسيين** (پس اگر تم نے منہ موڑا تو تم پر یریسیوں (پیروکاروں) کا گناہ ہو گا)۔\n\n### [یہ کہ \"یا ایھا\" اور ندا دوری کی خبر دیتے ہیں]\n\nجان لو کہ \"یا ایھا\" (تأیہ) اور ندا (النداء) اس حالت سے دوری کی خبر دیتے ہیں جس کی طرف پکارنے والا اسے بلاتا ہے۔ چنانچہ وہ کہتا ہے: **يا أَيُّهَا الَّذِينَ آمَنُوا** (اے ایمان والو!) (البقرۃ: 104)۔ پس ان کے اس چیز سے دور ہونے کی وجہ سے جس کے ذریعے انہیں پکارا گیا کہ وہ اس پر ایمان لائیں، اس لیے انہیں اس کے ذریعے پکارا گیا۔ اگر وہ اس حال میں اس وصف سے متصف ہوں جس کی طرف انہیں بلایا گیا ہے، تو دوری کا تعلق ان کے حق میں مستقبل کے زمانے سے ہو گا، یعنی تم اپنی اس حالت پر قائم رہو جسے دین نے تمہارے لیے مستقبل میں پسند کیا ہے۔ جیسا کہ یعقوب نے اپنے بیٹوں سے ان کی زندگی کے حال میں کہا: **وَلا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ** (اور تم ہرگز نہ مرنا مگر اس حال میں کہ تم مسلمان ہو) (البقرۃ: 132)۔ پس انہوں نے انہیں مستقبل میں اسلام کا حکم دیا، یعنی اس پر ثابت قدم رہنے کا۔ اور استقبال (مستقبل) حال کے زمانے سے دور ہوتا ہے۔ پس \"تأیہ\" بھی اس چیز کے ساتھ ہو گا جو حال میں موجود ہے کہ وہ مستقبل میں باقی رہے۔ اللہ تعالیٰ فرماتا ہے: **يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ** (اے ایمان والو! عہدوں کو پورا کرو) (المائدۃ: 1)۔ اور وہ ایمان کے عہد کو پورا کرنے کی حالت میں ہیں، کیونکہ اس نے انہیں ایمان کے ساتھ پکارا ہے۔ پس عقود میں دوری تھی جب انہوں نے انہیں قبول کیا، جب بھی انہوں نے انہیں قبول کیا۔\n\n### [یہ کہ الٰہی ندا عام ہے، مومن، کافر، مطیع اور نافرمان سب کو شامل ہے]\n\nجان لو کہ الٰہی ندا (النداء) مومن، کافر، مطیع، نافرمان، ارواح اور روحانیوں سب کو شامل ہے۔ اور ندا صرف الٰہی اسماء کی طرف سے ہوتی ہے۔ الٰہی اسم اس شخص کو پکارتا ہے جس پر کوئی دوسرا الٰہی اسم حکم فرما ہو، جب وہ جانتا ہے کہ اس کے حکم کی مدت اس پر ختم ہو چکی ہے، تو یہ اسم جو اسے پکارتا ہے، اسے دنیا اور آخرت میں لے لیتا ہے۔\n\nپس اللہ تعالیٰ کے سوا ہر کوئی منادی (جسے پکارا جائے) ہے، جسے ایک الٰہی اسم کسی کونی حال کے لیے پکارتا ہے تاکہ اسے اس تک پہنچائے۔ اگر وہ جواب دیتا ہے تو مطیع کہلاتا ہے اور سعید ہوتا ہے، اور اگر جواب نہیں دیتا تو عاصی کہلاتا ہے اور شقی ہوتا ہے۔\n\nاگر کوئی کہنے والا کہے کہ الٰہی اسم کی طرف سے ندا کیسے ہو سکتی ہے اور کائنات (الکون) اس کے جواب سے رک جائے، جبکہ وہ کمزور ہے اور الٰہی اقتدار کو قبول کرنے والا ہے؟ ہم کہیں گے: اس کا جواب دینے سے انکار اس کی اپنی ذات اور حقیقت کی وجہ سے نہیں تھا، کیونکہ وہ ہمیشہ مقہور (مغلوب) ہے۔ لیکن چونکہ وہ ایک الٰہی اسم کے قہر کے تحت تھا، اس اسم نے اسے پکارنے والے کو جواب دینے سے نہیں روکا۔ پس تنازع الٰہی اسماء کے درمیان واقع ہوا، اور وہ سب ہم پلہ ہیں۔ اور حکم صاحبِ ید (جس کے ہاتھ میں اختیار ہو) کا ہوتا ہے، اور وہ وہ اسم ہے جو دوسرے اسم کے پکارنے کے وقت اس کے ہاتھ میں ہوتا ہے۔ اسی لیے وہ حال کے لیے زیادہ قوی تھا۔\n\nاگر تم کہو: تو پھر انکار پر اسے کیوں مؤاخذہ کیا جاتا ہے؟ ہم کہیں گے: کیونکہ اس نے انکار کو اپنی ذات کی طرف منسوب کیا اور اسے اس الٰہی اسم کی طرف منسوب نہیں کیا جس کے قہر کے تحت وہ تھا۔ اگر تم کہو: تو پھر بھی امر باقی ہے، کیونکہ اس نے صرف ایک الٰہی اسم کے قہر کی وجہ سے انکار کیا، تو انکار اس مدعو کی طرف سے ہوا؟ ہم کہیں گے: تم نے سچ کہا، لیکن اس نے اس سے جہالت برتی، پس اسے اس کی جہالت کی وجہ سے پکڑا گیا۔ کیونکہ جہالت اس کی اپنی ذات سے ہے۔ اگر تم کہو: تو اس کی جہالت بھی اس الٰہی اسم کی طرف سے ہے جس نے اس پر حکم کیا؟ ہم کہیں گے: جہالت ایک عدمی امر ہے، وجودی نہیں، اور الٰہی اسماء وجود کو عطا کرتے ہیں، عدم کو نہیں۔ پس عدم مدعو کی اپنی ذات سے ہے، اور جہالت علم کا عدم ہے۔ پس اعتراض کرنے والے نے یہ نہیں جانا کہ وہ کس چیز پر اعتراض کر رہا ہے۔ اور الٰہی اسماء صرف وجود ہی عطا کرتے ہیں۔ پس جو تم نے ذکر کیا وہ لازم نہیں آتا، اور اس کہنے والے کا اعتراض ہمارے ذکر کردہ سے منقطع ہو گیا۔\n\nاور جب یہ ثابت ہو گیا کہ ندا عام ہے، تو جس کے ذریعے ندا کی جاتی ہے وہ بھی عام ہے۔ لیکن ذات حق (الحق) کی ندا صرف اسی چیز کے ساتھ ہوتی ہے جس کے جواب میں بندے کے لیے سعادت ہو۔ اور جہاں تک اس ندا کا تعلق ہے جس میں بندے کے لیے شقاوت ہو، تو وہ ذات حق (الحق) کی ندا نہیں ہے۔ اور ندا صفتِ کلام میں سے ہے۔\n\nپس بندہ جو بھی فعل کرتا ہے وہ دو امور میں تقسیم ہوتا ہے: ایک وہ فعل جس میں اس بندے کے لیے سعادت ہو، اور یہی وہ ہے جس کے ساتھ ذات حق (الحق) تعالیٰ کی ندا شامل ہوتی ہے۔ اور دوسرا وہ فعل جس کے ساتھ بندے کی سعادت شامل نہیں ہوتی، پس وہ ذات حق (الحق) کی ندا سے نہیں ہوتا، لیکن وہ ذات حق (الحق) کے ارادے اور اس کی تخلیق سے ہوتا ہے، نہ کہ اس کی ندا اور اس کے شرعی حکم سے۔\n\nاور اس میں سعادت کی نفی دو قسموں پر ہے: ایک یہ کہ وہ ایسا فعل ہو جس کے ساتھ نہ شقاوت ہو اور نہ سعادت، یا وہ ایسا فعل ہو جس کے ساتھ شقاوت شامل ہو۔ اور وہ فعل جس کے ساتھ شقاوت شامل ہو، وہ بھی دو قسموں پر ہے: ایک وہ قسم جس کے ساتھ ہمیشہ کے لیے شقاوت شامل ہو، اور وہ شرک کی شقاوت ہے۔ اور دوسری وہ شقاوت جو ہمیشہ کے لیے شامل نہ ہو، اور وہ ہر وہ فعل ہے جو شرک نہ ہو اور اس میں ذات حق (الحق) کی کوئی ندا بالکل نہ ہو۔ پس یہ منزل ندا کی منزل ہے، افعال کی منزل نہیں۔ اور افعال کی منازل ان شاء اللہ آئیں گی۔ بعض عارفین کو یہ منزل اور اس کے بھائی افعال کی منزل سے مشتبہ ہو جاتے ہیں، کیونکہ وہ افعال کے ذریعے ندا کو دیکھتے ہیں، حالانکہ منزل ایک نہیں ہے، بلکہ ندا کی ایک منزل ہے اور فعل کی ایک منزل ہے۔\n\n### [یہ کہ ندا مراتب پر ہے]\n\nجان لو کہ ندا مراتب پر ہے، ہر مرتبے کے لیے ایک مخصوص آلہ (اداة) ہے۔ پس آلات ہمزہ، یا، أیا، ہیأ، اور یائے ساکن کے ساتھ أی ہیں۔ ان میں سب سے قریب مرتبے میں ہمزہ ہے اور سب سے دور ہیأ ہے۔\n\nاور ندا کے ساتھ کبھی تنبیہ شامل ہوتی ہے اور کبھی نہیں ہوتی۔ جب ندا \"أی\" کے ساتھ ہو تو وہ نکرہ ہوتی ہے، لہٰذا تنبیہ ضروری ہے، کیونکہ ندا تعریف کا تقاضا کرتی ہے، اور وہ خود منادی (پکارنے والے) کے ساتھ ہے۔ لہٰذا ندا میں \"أی\" کے ساتھ ہائے تنبیہ کا شامل ہونا ضروری ہے، کیونکہ تنبیہ تعریف ہے۔ پھر تنبیہ کے بعد منادی کا نام لایا جاتا ہے تاکہ منادی کو معلوم ہو کہ وہ دوسروں کے بجائے پکارا گیا ہے۔ اگر اس کا نام ناقص ہو، جیسے \"الذین\"، تو اس کے لیے صلہ ضروری ہے، اور وہ وہ وصف ہے جس کے ذریعے اسے بیان کیا جاتا ہے تاکہ مقصود پورا ہو جائے۔ اور اس صلہ اور موصول کے درمیان ایک رابط کا ہونا ضروری ہے تاکہ معلوم ہو کہ وہی اس ندا سے مراد ہے۔ اور اگر ناقص نام کے بعد نہ لایا جائے تو مذکورہ بالا کی ضرورت نہیں ہوتی، چنانچہ کہا جاتا ہے: **يا أَيُّهَا النَّاسُ** (اے لوگو!) (البقرۃ: 21) اور اس کی مثالیں۔\n\nاور جہاں تک اس صورت کا تعلق ہے جب ندا کے ساتھ \"أی\" شامل نہ ہو، تو ندا منادی کے نام سے جڑ جاتی ہے۔ اور کبھی منادی نکرہ ہوتا ہے جسے طول دیا جاتا ہے، جیسے اللہ تعالیٰ کا قول: **يا حَسْرَةً عَلَى الْعِبادِ** (اے بندوں پر افسوس!) (یس: 30) اور جیسے قول: \"یا عجبا\" (اے تعجب!)۔ شاعر نے کہا:\n\n> يا عجبا لهذه الفليقه *** هل تذهبين القر بالربيقة\n> (اے اس مصیبت پر تعجب! کیا تم ربیقہ کے ذریعے سردی کو دور کرو گی؟)\n\nاور ندا کے بعد آنے والا ہمیشہ منصوب (نصب کی حالت میں) ہوتا ہے، یا تو لفظاً یا معنیً۔ اسی لیے اللہ تعالیٰ کے قول **وَالطَّيْرَ** میں نصب کے ساتھ عطف کیا گیا، جو \"یا جبال\" کے محل پر عطف ہے، اگرچہ لفظ میں وہ مرفوع ہے۔ کبھی اوقات لفظ کا لحاظ رکھا جاتا ہے، اسی لیے **وَالطَّيْرُ** کو رفع کے ساتھ بھی پڑھا گیا ہے۔\n\nاور ان میں سے ہر فصل کے لیے الٰہی حقائق ہیں، اگر طوالت کا خوف نہ ہوتا تو ہم انہیں ایک ایک فصل کر کے ذکر کرتے۔ پس ہم نے انہیں ان عارفین کے لیے چھوڑ دیا جو ہماری بات پر غور کرتے ہیں، تاکہ یہ ان کے لیے اس بات پر تنبیہ ہو کہ ندا کی منزل میں کیا الٰہی معانی پوشیدہ ہیں، اور یہ کہ کائنات (الکون) ایک دوسرے سے اس طرح جڑی ہوئی ہے جیسے معانی کلمات سے جڑے ہوتے ہیں۔\n\nاور کبھی وہ واؤ کو بھی ندا کے آلات میں شمار کرتے ہیں، لیکن اسے ایک خاص حال کے لیے خاص ندا کے ساتھ مخصوص کرتے ہیں، دوسرے آلات کے برعکس۔ پس انہوں نے اسے ندبہ (نوحہ) کے لیے مخصوص کیا، چنانچہ وہ میت کو پکارتے ہیں: \"وا جبلاہ\" (ہائے میرا پہاڑ!) اور \"وا سنداہ\" (ہائے میرا سہارا!)۔ اور اسی سے میت کو عذاب دیا جاتا ہے، فرشتہ اس کے پہلو میں نیزہ مارتا ہے کہ تم ایسے ہی تھے۔ اور وہ کہتے ہیں: \"وا زیداہ\"، \"وا سلطاناہ\"۔ اور اس ندا میں آخر میں ہائے سکت (وقف کی ہ) کا داخل کرنا ضروری ہے، کیونکہ اس ندا کی شرط یہ نہیں کہ اس کے بعد کوئی چیز کہی جائے۔ اسی لیے اس پر ہائے سکت داخل کی جاتی ہے، اور اسی پر اکتفا کیا جاتا ہے، چنانچہ وہ کہتے ہیں: \"وا جبلاہ\"، \"وا حزناہ\" (ہائے میرا غم!)، اور کسی دوسری چیز کی ضرورت نہیں ہوتی۔\n\nاور جب تم \"یا زید\" کہو اور اسے ندبہ کی ندا کے علاوہ دوسرے حروفِ ندا سے پکارو، تو تمہیں وہ سبب ذکر کرنا ضروری ہے جس کی وجہ سے تم نے اسے پکارا، چنانچہ تم کہتے ہو: **يا جِبالُ أَوِّبِي مَعَهُ** (اے پہاڑو! اس کے ساتھ تسبیح کرو) (سبأ: 10)، **يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا** (اے ایمان والو! پورا کرو)، **يا أَيُّهَا النَّاسُ اتَّقُوا** (اے لوگو! تقویٰ اختیار کرو) (البقرۃ: 21)۔ پس ہائے سکت صرف ندبہ کی ندا میں ہی ہوتی ہے۔\n\nجہاں تک ترخیم (آخری حرف کو حذف کرنا) والی ندا کا تعلق ہے، تو اس سے ان کا مقصد کلام کو آسان بنانا ہوتا ہے تاکہ پکارنے والے پر ہلکا ہو، اور وہ کلمے میں سے جو حذف کیا ہے اس کے ذریعے تیزی سے مقصود تک پہنچے۔ کیونکہ ترخیم کا مطلب آسانی ہے۔ اور اسی سے معشوق کی تعریف میں \"رخیم الدلال\" (نرم ناز والا) کہا جاتا ہے، یعنی وہ آسان ہے۔\n\nاور مرخم میں ترخیم کی مثال یہ ہے کہ تم منادی کے نام کا آخری حرف حذف کر دو، چنانچہ جب تم اس شخص کو پکارتے ہو جس کا نام حارث ہے، تو کہتے ہو: \"یا حار ہلم\" (اے حار! آؤ)، پس تم نے آسانی کی طلب میں کلمے کا آخری حرف حذف کر دیا۔\n\nاور جان لو کہ اسماء اور اسماء الافعال دو قسموں پر ہیں: معرب اور مبنی۔ پس جس کا آخر عوامل کے داخل ہونے سے بدل جائے، وہ معرب کہلاتا ہے، اور اعراب کا مطلب تبدیلی ہے۔ کہا جاتا ہے: \"أعربت معدة الرجل\" (آدمی کا معدہ بدل گیا) جب وہ تبدیل ہو جائے۔ اور یہ اسم ایک حال سے دوسرے حال میں بدل گیا ہے۔ یہ اس کے معرب کہلانے کی بعض وجوہِ اشتقاق میں سے ہے۔\n\nاور مبنی وہ ہر اسم ہے، خواہ فعل کا ہو یا غیر فعل کا، جس کا لفظ ایک ہی صفت پر ثابت رہے، اور اس میں ان عوامل کے داخل ہونے سے کوئی اثر نہ پڑے جو عرب میں تبدیلی پیدا کرتے ہیں۔ پس اسے بناء (ثابت رہنے) کی وجہ سے مبنی کہا جاتا ہے، اس کے ثابت رہنے اور تبدیلی کو قبول نہ کرنے کی وجہ سے۔\n\nاور اس کا ایک باب الٰہ کی صفاتِ ثبوتیہ میں ہے، اس حیثیت سے کہ وہ ذات ہے، اور اس کی طرف الوہیت کی نسبت کا ہمیشہ ثابت رہنا ہے۔ اور معرب کا ایک باب الٰہی معارف میں ہے، اس کے قول سے: **كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہے) (الرحمن: 29) اور **سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ** (عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھ والو!) (الرحمن: 31)۔ پس یہ معرب اور مبنی کے درمیان فرق ہے۔\n\nپس جب اسم کی ترخیم کی جاتی ہے، تو اس کا اعراب کلمے کے باقی ماندہ آخری حرف کی طرف منتقل ہو سکتا ہے۔ چنانچہ تم کہتے ہو: \"یا حار ہلم\"، جبکہ راء مکسور تھی، تو ثاء کی حرکت اس کی طرف منتقل کر دی گئی تاکہ سننے والے کو معلوم ہو جائے کہ اسم میں سے ایک حرف حذف کر دیا گیا ہے۔ کیونکہ منادی اپنے نام کو ثاء کے ساتھ \"حارث\" ہونے کی صورت میں ہی پہچانتا ہے۔ اگر ثاء کو حذف کر دیا جائے تو شاید وہ کہے کہ یہ میں نہیں ہوں۔ پس جب ثاء کی حرکت راء کی طرف منتقل کی جاتی ہے، تو وہ جان لیتا ہے کہ وہی مقصود ہے۔\n\nاسی طرح جب بندے کو کسی الٰہی اسم سے پکارا جاتا ہے، تو شاید اس کے دل میں یہ خیال آئے کہ وہ اس اسم کا مستحق ہے۔ پس اس کی عبودیت کا وصف اس الٰہی اسم کی طرف منتقل کر دیا جاتا ہے جس سے اس بندے کو پکارا گیا، تو وہ جان لیتا ہے کہ وہ بندہ ہونے کی حیثیت سے مقصود ہے، کیونکہ صفت اس کے ساتھ رہتی ہے۔ یہ تب ہے جب حرکت منتقل کی جائے۔\n\nاور جب اسم سے حذف شدہ حرف کی حرکت باقی ماندہ حرف کی طرف منتقل نہ کی جائے اور اسے اس کے حال پر چھوڑ دیا جائے، تو اس میں مقصد کوئی اور ہوتا ہے، اور وہ یہ ہے کہ ہر حق کو اس کی حقیقت پر چھوڑ دیا جائے، تاکہ ایک کائنات (الکون) کا دوسرے کائنات پر کوئی اثر نہ ہو، اور ایک کائنات پر دوسرے کائنات کی خلعت ظاہر نہ ہو، تاکہ اس میں منفرد صرف اللہ تعالیٰ ہو۔ کیونکہ حارث میں ثاء پر جو ضمہ ہے وہ اس کا لباس ہے۔ پس جب ترخیم میں اسے راء پر اتارا گیا، تو ایک کائنات نے دوسرے کائنات پر خلعت اتاری۔ پس شاید جس پر خلعت اتاری گئی وہ اس کی عبودیت اور تعریف کا قصد کرے۔\n\nاور حقیقت میں خلعت متکلم (پکارنے والے) کے لیے ہے نہ کہ حرفِ ثاء کے لیے۔ پکارنے والا ہی وہ ہے جس نے راء پر وہ رفع اتارا جو حرفِ ثاء کا تھا، جب اس نے اس کی عین (ذات) کو وجود سے ہٹا دیا۔ یہ قطبیت اور امامت کو اس شخص سے ہٹانے کی طرح ہے جس کی عین (ذات) ختم ہو گئی، اور اس شخص کو دے دی گئی جو اس مقام پر قائم ہوا، کیونکہ اللہ ہی نے اسے قائم کیا نہ کہ اس امام نے جو گزر گیا۔\n\nپس ہم نے اس منزل میں اپنے پاس موجود بعض اسرار کو بیان کر دیا ہے تاکہ طالب کے لیے ان شاء اللہ اس میں موجود چیزوں پر تنبیہ ہو جائے۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے) (الأحزاب: 4)۔",
    "fa": "باب دویست و هفتاد و پنجم در معرفت منزل بیزاری جستن از بت‌ها (التبري من الأوثان) از مقام موسوی، و این منزل یکی از هفت منزل امر است.\n\nمنازل امر با ندا (ندا) *** منازلی است که پایانی ندارد\nای ای، ای ای، جدا مشو *** زیرا هستی شما را انقضایی نیست\nو هر ای ای که از او باشد *** برای وجه او در میان ما بیننده است\nلشکرهایی برای حروف آمده‌اند *** که فضا از حمل آن‌ها تنگ می‌آید\nهمه نیزه‌هایشان ستارگانند *** که امر و قضا آن‌ها را تأیید کرده است\nکشتی‌هایی که دریایشان عمیق است *** و باد آن‌ها را به آرامی می‌راند\nپس ای برادر، علمی را لازم بگیر *** که زمین و آسمان برای آن تنگ آمد\nو غیر (الغیر) را در کوری‌اش رها کن *** در مشهدی که خود کوری نیست.\n\n### [بت‌پرستان (عباد الوثن)]\n\nبدان که خواری (الذلة) و نیازمندی (الافتقار) از سوی هستی (الکون) جز برای خدای تعالی نیست. پس هر کس که در برابر غیر خدا خوار و نیازمند شود و بر او اعتماد کند و در تمام امور خود به او آرام گیرد، او بت‌پرست است. و آن چیزی که مورد نیازمندی قرار گرفته، وثن (بت) نامیده می‌شود و نیازمند آن را إله (معبود) می‌خواند. لطیف‌ترین بت‌ها هوا و غلیظ‌ترین آن‌ها سنگ‌ها هستند و مابین این دو. به همین دلیل، مشرکان هنگامی که به توحید إله در الوهیتش فراخوانده شدند، گفتند: أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ (آیا خدایان متعدد را یک خدا قرار داده است؟ این قطعاً چیزی شگفت‌آور است). مردم این سخن را که إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ (این قطعاً چیزی شگفت‌آور است) از قول کفار می‌دانند، زیرا آن‌ها به توحید إله فراخوانده شدند در حالی که به کثرت معتقد بودند. اما نزد ما، این سخن از قول حق (الحق) یا قول رسول است. و اما سخن کفار در قول او إِلهاً واحِداً (یک خدا) پایان می‌یابد. و این شگفتی به عقل بازمی‌گردد؛ انسان می‌داند که إله با جعلِ جاعل (قرار دادنِ قراردهنده) به وجود نمی‌آید، زیرا او إله برای خود است. به همین دلیل، توبیخ با این سخن خدای تعالی واقع شد: أَ تَعْبُدُونَ ما تَنْحِتُونَ (آیا چیزی را می‌پرستید که خود می‌تراشید؟). إله در ضرورت عقل متأثر نمی‌شود. در حالی که این [بت] قبلاً چوبی بود که با آن بازی می‌شد یا سنگی بود که با آن استنجا می‌شد، سپس آن را گرفت و إله قرار داد و در برابرش خوار و نیازمند شد و او را از روی ترس و طمع می‌خواند. از چنین موردی است که شگفتی رخ می‌دهد، با وجود اینکه عقل نزد آن‌ها موجود است. پس شگفتی از آن جهت واقع شد تا کسی که عقلش از درک آنچه برایش بدیهی و ضروری است محجوب شده، بداند که امور به دست خداست و حکم در آن‌ها از آن خداست و عقل‌ها به خودی خود تعقل نمی‌کنند، بلکه آنچه را تعقل می‌کنند، به واسطه چیزی است که پروردگار و خالقشان به آن‌ها القا می‌کند. به همین دلیل درجات عقل‌ها متفاوت است؛ برخی عقلشان قفل شده، برخی در کن (پوشش) محبوس شده و برخی بر آینه عقلشان زنگار نشسته است. اگر عقل‌ها به خودی خود تعقل می‌کردند، توحیدِ موجِد (ایجادکننده) خود را در قومی انکار نمی‌کردند و در قومی دیگر آن را نمی‌دانستند، در حالی که حد و حقیقت در هر دو به یک اندازه است. به همین دلیل، ما قول خدای تعالی إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ (این قطعاً چیزی شگفت‌آور است) را از قول کفار نمی‌دانیم.\n\n### [اینکه منزل بیزاری جستن از منازل پوشیدگی و کتمان است]\n\nپس ای برادر، بدان که این منزل، منزلی از منازل ستر (پوشیدگی) و کتمان (پنهان‌کاری) و تثبیت الوهیت (الألوهة) در هر چیزی است که غیر از خدا پرستیده شده است؛ زیرا سنگ به خاطر ذاتش پرستیده نشده، بلکه از آن جهت پرستیده شده که نسبت الوهیت به آن داده شده است. به همین دلیل، ما ذکر کردیم که این منزل از منازل کتمان و ستر است. خدای تعالی می‌فرماید: وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ (و پروردگارت حکم کرد که جز او را نپرستید) و لَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله (و اگر از آن‌ها بپرسی چه کسی آن‌ها را آفریده است، قطعاً می‌گویند: الله). آن‌ها هرگز جز الوهیت (الألوهية) را ذکر نکردند و اشخاص را ذکر نکردند، اما خداوند عذر آن‌ها را نپذیرفت، بلکه فرمود: إِنَّكُمْ وما تَعْبُدُونَ من دُونِ الله (شما و آنچه غیر از خدا می‌پرستید) یعنی آن کسی که به این نام (الله) منفرد است، حَصَبُ جَهَنَّمَ (هیزم جهنم) هستید، و این همان قول اوست: وَقُودُهَا النَّاسُ والْحِجارَةُ (سوخت آن مردم و سنگ‌ها هستند). و این شامل هر کسی است که شما را به پرستش خود فراخوانده یا شما او را پرستیده‌اید و در توانش بوده که شما را از آن نهی کند ولی نهی نکرده است. چنین کسانی از هیزم جهنم خواهند بود. موحد خدا را از دو طریق می‌پرستد: از طریق ذات (الذات) از آن جهت که مستحق وصف الوهیت است، و از طریق الوهیت. پس سعادتمند کسی است که بین این دو جمع کند، زیرا عابد مرکب از حرف و معنی است؛ حرف برای حرف و معنی برای معنی است. به همین دلیل، ما ذات را عاری از وصف الوهیت نمی‌پرستیم و الوهیت را بدون نسبت دادن به موصوفش نمی‌پرستیم. پس عبادت جز بر آنچه حقیقت عبد (العبد) اقتضا می‌کند، یعنی ترکیب، استوار نمی‌شود، نه بر آنچه حقیقت حق (الحق) اقتضا می‌کند، یعنی احدیت (الأحدية). به همین دلیل، کسی که در عبادت خود می‌گوید: «برای وفای حق خدا او را می‌پرستم»، اگر منظورش ذات باشد، بر صواب نیست؛ زیرا حقیقت ذات، احدیت است. اما ممکن است سخن کسی که می‌گوید: «من او را برای وفای حق ربوبیت می‌پرستم، نه برای حقیقت آن»، صحیح باشد؛ زیرا هر حقی حقیقتی دارد. پس حق از آن جهت که عبادت عابد به آن تعلق می‌گیرد، و حقیقت همان احدیت است که نه تعلق می‌گیرد و نه چیزی به آن تعلق می‌گیرد. به همین دلیل، الف در وضع الهی در خط عربی، اگر در کلمه مقدم شود، متصل نمی‌شود و چیزی به آن متصل نمی‌گردد، و اگر مؤخر شود، برخی از حروف به آن متصل می‌شوند، مگر پنج حرف که از تمام حروف فقط همین پنج حرف هستند: دال، ذال، راء، زای، و واو. این‌ها پنج حال هستند که هر کس به آن‌ها متصف شود، احدیت (الأحدية) را می‌شناسد و عبادتش ذاتی خواهد بود و امری به آن مقرون نمی‌شود، و این عبادت معنی برای معنی است. زیرا امر، عبادت حرف برای حرف است. پس برای عابد معنی، هیچ فرقی بین ذات و الوهیت و کثرت خطور نمی‌کند، بلکه یک عین واحد را می‌بیند که مستحق آن چیزی است که این عارف از حیث معنایش بر آن است، نه از حیث حرفش. و این مقام جلال و عظمت و احدیت عبد است که معرفت احدیت ذاتی و تنزیه و غنا را به او بخشیده است. این‌ها پنج حال هستند که حروف پنج‌گانه بر آن‌ها دلالت می‌کنند؛ حروفی که الف واقع در اواخر کلمات به آن‌ها متصل نمی‌شود، مانند: جبيرا، عزيزا، أحدا، وإذا، وعلوا. پس الف در اول کلمه، از عدم اتصال، بر این قول دلالت کرد که: «خدا بود و هیچ چیز با او نبود»، و او با وجود اشیاء، بر همان حالتی است که بود، از جهت عدم اتصال، همان‌طور که الف به کلمه متصل نشد. و عدم اتصال حروف پنج‌گانه به آن در آخر کلمه، بر حال معرفت مقام برخی از بندگان از علمای بالله، نه دیگران، دلالت کرد، زیرا آن‌ها نسبت بین خود و خدای تعالی را برداشته‌اند و شاهد آنچه ذکر کردیم از جلال و عظمت و احدیت و تنزیه و غنا هستند. و غیر از این طایفه، نسبتی و رابطه‌ای بین إله و مألوه (معبود) قرار دادند و بین مرتبه و ذات فرقی نگذاشتند، زیرا خدا را جز از نفوس خود نشناختند، به حکم دلالت، به دلیل استناد ممکن به مرجح. پس او را طلب کردند و او نیز آن‌ها را طلب کرد. و برای آن‌ها از حروف، هر حرفی است که در آخر کلمه به الف متصل شده است. و برای این بزرگان نیز قسمتی و بهره‌ای وافر در منزل این حروف متصل وجود دارد، از حیث حرفیتشان نه از حیث معنایشان. و اینان این قدرِ فارق بین خودشان را نادیده گرفتند، اما آن را از عوام پنهان داشتند و از امثال خود جدا شدند. «يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشاءُ» (هر که را بخواهد به رحمت خود اختصاص می‌دهد). و به همین دلیل، جنید، سید این طایفه، گفت: «هیچ کس به درجه حقیقت نمی‌رسد مگر اینکه هزار صدیق بر او شهادت دهند که او زندیق است.» زیرا این مقام به کسی که اهل آن نیست، ضرر می‌رساند، همان‌طور که بوی گل سرخ به سوسک ضرر می‌رساند؛ زیرا حالی که آن‌ها بر آن هستند، این مقام را نمی‌پذیرد و این مقام نیز آن‌ها را نمی‌پذیرد. پس اگر مردم در عموم آن‌ها را ببینند، نمی‌شناسندشان، زیرا بر حرف آن‌ها امر ظاهری نیست که با آن از عوام متمایز شوند. و اگر مردم در خصوص، مانند فقها و متکلمان و حکمای اسلام، آن‌ها را ببینند، حکم به تکفیرشان می‌دهند. و اگر حکمایی که مقید به شرایع نازل شده نیستند، مانند فلاسفه، آن‌ها را ببینند، می‌گویند: «این‌ها اهل هوس هستند که خزانه خیالشان فاسد شده و عقلشان ضعیف گشته است.» پس جز خودشان و کسی که خداوند آن‌ها را از خلقش برای خود برگزیده، کسی آن‌ها را نمی‌شناسد. خدای تعالی در این معنی می‌فرماید: وَما قَدَرُوا الله حَقَّ قَدْرِهِ (و خدا را آن‌گونه که شایسته اوست نشناختند). و برای اینان بهره‌ای وافر در این آیه است، زیرا عام و خاص و مسلمان و غیرمسلمان آن‌ها را نشناخته‌اند. آن‌ها گنجینه‌هایی هستند که با حجاب‌های غیرت محافظت شده‌اند، پس جز حق (الحق) کسی آن‌ها را نمی‌شناسد. و اینکه آیا برخی از آن‌ها برخی دیگر را می‌شناسند، در آن توقف است. و آن‌ها مطلوبان از بندگان هستند. خداوند ما را به آن‌ها ملحق گرداند و امیدوارم که من از آن‌ها باشم. اما بیزاری جستن مسلمان از آنچه مشرک به آن استناد کرده، بیزاری او جز از نسبت و از منسوبٌ إلیه (آنچه نسبت به آن داده شده) نیست، نه از منسوب (آنچه نسبت داده شده). پس مشرک و مسلمان در منسوب (عبادت) جمع شدند و در منسوبٌ إلیه (معبود) و نسبت از هم جدا شدند. به همین دلیل، جزیه بر مشرک وضع نشد و بین او و کفار اهل کتاب‌های نازل شده فرق گذاشته شد. زیرا مشرک با شرک خود، در حق (الحق) و در هستی (الکون) قدح کرده است، پس مستندی نداشت که او را از قتل حفظ کند، زیرا در توحید و در رسولان قدح کرده است. اما کفار اهل کتاب، در توحید و در هستی (یعنی رسولان) قدح نکردند، بلکه در رسولی خاص به دلیل هوا یا شبهه‌ای که در نفوسشان بود، قدح کردند. آنچه در آن‌ها بود، آن‌ها را به انکار حق از روی ظلم و برتری‌جویی، با وجود یقین به آن، یا به دلیل شبهه‌ای که برایشان پیش آمد و صدق صاحب دعوت نزدشان ثابت نشد، سوق داد. به همین دلیل، آن‌ها در مجموع مستندی داشتند که نزد خودشان صحیح بود، نه در نفس الأمر (واقعیت)، که آن‌ها را از قتل حفظ می‌کرد، پس جزیه بر آن‌ها وضع شد و بر دینشان رها شدند تا آن را یا بخشی از آن را به اندازه‌ای که توفیق یابند، اقامه کنند. و در اینجا نکته‌ای است برای کسی که بفهمد که دین آن‌ها به شرع ما برایشان مشروع است، زیرا [شرع ما] آن‌ها را بر آن تأیید کرده است. به همین دلیل، رسول خدا (صلی الله علیه و سلم) هرگاه می‌شنید که روم بر فارس پیروز شده است، با وجود اینکه رومیان به او کافر بودند، شادمانی در چهره‌اش ظاهر می‌شد. اما رسول (صلی الله علیه و سلم) به دلیل علمش، منصف بود، زیرا می‌دانست که مستند رومیان به کسی است که اهل حق به او استناد کرده‌اند، زیرا آن‌ها اهل کتابی هستند که به آن ایمان دارند، اما شبهه‌ای از تحریف پیشوایانشان بر آن‌ها عارض شده که بین آن‌ها و ایمان و اقرار به نبوت محمد (صلی الله علیه و سلم) یا عموم آن حائل شده است. و سخن ما با منصفان از علمای آن‌هاست. پس شرع به خاطر این مقدار که از آن‌ها می‌دانست، عذرشان را پذیرفت و جانب حق تعالی را در مورد آن‌ها رعایت کرد، زیرا او را یگانه دانستند و به او شرک نورزیدند، در حالی که فارس و بت‌پرستان به او شرک ورزیدند و در توحید إله و آنچه از احدیت (الأحدية) سزاوار اوست، قدح کردند. و حال عارفان اهل این مقام نیز چنین است. اما قول رسول خدا (صلی الله علیه و سلم) در امر ما به مخالفت با اهل کتاب، تنها در این است که آن‌ها به بخشی از آن ایمان آوردند و به بخشی کفر ورزیدند و خواستند أَنْ يَتَّخِذُوا بَيْنَ ذلِكَ سَبِيلًا (راهی بین آن دو برگزینند). پس ما را به مخالفت با آن‌ها در امور معینی از احکام و در آنچه ذکر کردیم، امر فرمود. و اگر ما را به مخالفت مطلق با آن‌ها امر می‌کرد، مأمور به خلاف آنچه به آن امر شده‌ایم، یعنی ایمان، می‌شدیم. پس مخالفت مطلق با آن‌ها صحیح نیست. این است مراد از قول او (صلی الله علیه و سلم): خالفوا أهل الكتاب (با اهل کتاب مخالفت کنید).\n\n### [اینکه مشرک به اعتبار روی گرداندن از احدیت إله، کافر نامیده می‌شود]\n\nو بدان که هر مشرکی کافر است. زیرا مشرک با پیروی از هوای نفس خود در کسی که شریک قرار داده و او را إله گرفته و با روی گرداندن از احدیت إله، آن را از نظر در ادله و آیات هدایت‌کننده به توحید إله می‌پوشاند. پس به دلیل این پوشاندن، ظاهراً و باطناً کافر نامیده شده است. و به دلیل اینکه الوهیت را با خدا به غیر خدا نسبت داده و برای آن دو نسبت قائل شده و شرک ورزیده، مشرک نامیده شده است. این فرق بین مشرک و کافر است. اما کافری که مشرک نیست، موحد است، جز اینکه به رسول و به بخشی از کتابش کافر است. و کفر او بر دو وجه است: وجه اول اینکه کفر او به آنچه از نزد خدا آمده، مانند کفر مشرک در توحید خدا باشد. وجه دیگر اینکه به رسول خدا و آنچه از نزد خدا آمده، عالم باشد که آن از نزد خداست، اما آن را از عوام و مقلدان پیروانش به دلیل رغبت در ریاست پنهان کند. و این همان است که پیامبر (علیه السلام) در نامه‌اش به قیصر قصد کرد: «فإن توليت فإن عليك إثم اليريسيين» (اگر روی گردانی، گناه یریسیان [یعنی پیروان] بر گردن توست).\n\n### [اینکه «یا ایها» (التأيه) و ندا (النداء)، نشان‌دهنده دوری است]\n\nو بدان که «یا ایها» (التأيه) و ندا (النداء) نشان‌دهنده دوری از حالتی است که کسی که او را ندا می‌دهد، به خاطر آن او را می‌خواند. مثلاً می‌گوید: يا أَيُّهَا الَّذِينَ آمَنُوا (ای کسانی که ایمان آورده‌اید). پس به دلیل دوری آن‌ها از آنچه به آن فراخوانده شده‌اند که به آن ایمان بیاورند، به آن‌ها «یا ایها» گفته شده است. اگر آن‌ها در حال حاضر به آنچه به آن فراخوانده شده‌اند، متصف باشند، دوری به زمان آینده در حق آن‌ها تعلق می‌گیرد، یعنی: بر حال خود که دین برای شما پسندیده است، در آینده ثابت بمانید. همان‌طور که یعقوب به فرزندانش گفت: ولا تَمُوتُنَّ إِلَّا وأَنْتُمْ مُسْلِمُونَ (و نمیرید مگر در حالی که مسلمان باشید) در حال حیاتشان. پس آن‌ها را به اسلام در آینده امر کرد، یعنی به ثبات بر آن. و آینده از زمان حال دور است. پس «یا ایها» همچنین می‌تواند به آنچه در حال موجود است، تعلق گیرد تا در آینده باقی بماند. خدای تعالی می‌فرماید: يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ (ای کسانی که ایمان آورده‌اید، به پیمان‌ها وفا کنید). و آن‌ها در حال وفای به عقد ایمان هستند، زیرا او در «یا ایها» آن‌ها را به ایمان وصف کرده است. پس دوری در عقود بود، اگر آن‌ها را پذیرفتند، هرگاه که پذیرفتند.\n\n### [اینکه ندای الهی عام است و مؤمن و کافر و مطیع و عاصی را شامل می‌شود]\n\nو بدان که ندای الهی (النداء الإلهي) مؤمن و کافر و مطیع و عاصی و ارواح و روحانیون را شامل می‌شود. و ندا جز از اسماء الهی (الأسماء الإلهية) نیست. اسم الهی کسی را ندا می‌دهد که اسم الهی دیگری بر او حکم کرده است، هنگامی که می‌داند مدت حکم آن اسم به پایان رسیده است. پس این اسمی که او را ندا داده، او را در دنیا و آخرت می‌گیرد. پس تمام کسانی که غیر از خدای تعالی هستند، منادی (ندا داده شده) هستند که اسم الهی آن‌ها را برای حالتی کونی که آن اسم او را به آن می‌طلبد، ندا می‌دهد تا او را به آن برساند. اگر اجابت کند، مطیع نامیده می‌شود و سعادتمند خواهد بود. و اگر اجابت نکند، عاصی نامیده می‌شود و شقی خواهد بود. اگر کسی بگوید: چگونه ندا از اسم الهی باشد و هستی (الکون) از اجابت آن خودداری کند، با وجود ضعف و پذیرش اقتدار الهی؟ می‌گوییم: خودداری او از اجابت، از حیث نفس و حقیقتش نیست، زیرا او همیشه مقهور است، بلکه چون تحت قهر اسم الهی دیگری بوده، آن اسم او را رها نکرده تا کسی را که او را ندا داده، اجابت کند. پس نزاع بین اسماء الهی واقع شده و آن‌ها هم‌تراز هستند، و حکم از آن صاحب دست است، یعنی اسمی که در وقت ندای اسم دیگر، [منادی] در دست اوست. به همین دلیل، او برای آن حال قوی‌تر است. اگر بگویی: پس چرا به خاطر خودداری مؤاخذه می‌شود؟ می‌گوییم: زیرا او خودداری را به خود نسبت داده و آن را به اسم الهی که تحت قهر اوست، اضافه نکرده است. اگر بگویی: پس امر باقی است، زیرا او تنها به دلیل قهر اسم الهی خودداری کرده است، پس خودداری از او در این مدعو (ندا داده شده) بوده است. می‌گوییم: راست گفتی، اما او این را ندانسته است، پس به دلیل جهلش مؤاخذه شده است. زیرا جهل از نفس اوست. اگر بگویی: جهل او از اسم الهی است که بر او حکم کرده است. می‌گوییم: جهل امری عدمی است نه وجودی، و اسماء الهی وجود را عطا می‌کنند، نه عدم را. پس عدم برای مدعو از نفس اوست، و جهل، عدم علم است. پس معترض نفهمید که به چه چیزی اعتراض می‌کند. و اسماء الهی جز وجود را عطا نمی‌کنند. پس آنچه ذکر کردی لازم نمی‌آید و اعتراض این گوینده با آنچه ذکر کردیم، قطع می‌شود. و اگر ثابت شد که ندا عام است، پس منادی به آن نیز عام است. اما ندای حق (الحق) جز به چیزی که در اجابت آن سعادت برای بنده باشد، نیست. و اما ندایی که در آن شقاوت برای بنده باشد، آن ندای حق نیست. و ندا از صفت کلام است. پس هر فعلی که بنده انجام می‌دهد، به دو امر تقسیم می‌شود: فعلی که در آن سعادت آن بنده است، و آن فعلی است که ندای حق تعالی به آن مقرون است؛ و فعلی که سعادت بنده به آن مقرون نیست، پس از ندای حق نیست، بلکه از اراده حق و خلق اوست، نه از ندای او و امر شرع او. و نفی سعادت در آن بر دو قسم است: یکی اینکه فعلی باشد که نه شقاوت به آن مقرون باشد و نه سعادت؛ یا فعلی باشد که شقاوت به آن مقرون باشد. و فعلی که شقاوت به آن مقرون است، بر دو قسم است: قسمی که شقاوت به طور ابدی به آن مقرون است، و آن شقاوت شرک است؛ و شقاوتی که به طور ابدی به آن مقرون نیست، و آن هر فعلی است که شرک نباشد و ندای حق مطلقاً در آن نباشد. پس این منزل، منزل ندا است نه منزل افعال. و منازل افعال ان‌شاءالله خواهد آمد. و این منزل و برادرانش بر برخی از عارفان با منزل افعال مشتبه می‌شود، زیرا او ندا را با افعال می‌بیند، در حالی که منزل در این مورد یکی نیست، بلکه ندا منزلی دارد و فعل منزلی دیگر.\n\n### [اینکه ندا بر مراتب است]\n\nو بدان که ندا بر مراتب است و برای هر مرتبه‌ای ابزار معینی وجود دارد. ابزارها عبارتند از: همزه، یا، أیا، هيا، و أی ساکن الیاء. نزدیک‌ترین آن‌ها در رتبه، همزه و دورترین آن‌ها هيا است. و ندا ممکن است با تنبیه همراه باشد و ممکن است همراه نباشد. اگر ندا با «أی» باشد، نکره است، پس حتماً باید تنبیه همراه آن باشد، زیرا ندا تنها طلب تعریف می‌کند و «أی» به خودی خود منادی است. پس حتماً باید «هاء تنبیه» (ها) در ندا با «أی» همراه شود، زیرا تنبیه تعریف است. سپس اسم منادی به دنبال تنبیه می‌آید تا منادی بداند که اوست که ندا داده شده، نه دیگری. اگر اسم او ناقص باشد، مانند «الذین»، حتماً باید صله‌ای داشته باشد، و آن چیزی است که او را با آن وصف می‌کند تا مقصود کامل شود. و حتماً باید رابطی بین این صله و موصول باشد تا دانسته شود که او مراد آن ندا است. و اگر اسم ناقص به دنبال آن نیاید، به آنچه ذکر کردیم نیازی نیست، پس گفته می‌شود: يا أَيُّهَا النَّاسُ (ای مردم) و امثال آن. اما اگر «أی» با ندا همراه نشود، ندا به اسم منادی متصل می‌شود. و ممکن است منادای نکره‌ای باشد که طولانی شده است، مانند قول خدای تعالی: يا حَسْرَةً عَلَى الْعِبادِ (ای حسرت بر بندگان) و مانند قول: یا عجبا. شاعر می‌گوید:\n\nيا عجبا لهذه الفليقه *** هل تذهبين القر بالربيقة\n(ای شگفتا از این فلیکه [نوعی سنگ] *** آیا سرما را با ریسمان می‌بری؟)\n\nو ممکن است منادای معرفه باشد، مانند: يا جِبالُ أَوِّبِي مَعَهُ (ای کوه‌ها، با او تسبیح گویید). و آنچه بعد از ندا می‌آید، هرگز جز منصوب نیست، یا لفظاً یا معناً. به همین دلیل، در قول خدای تعالی: والطَّيْرَ (و پرندگان) با نصب، عطف بر موضع «یا جبال» شده است، اگرچه در لفظ مرفوع است. گاهی لفظ رعایت می‌شود و به همین دلیل، «والطیر» نیز به رفع خوانده شده است. و برای هر فصل از این فصول، حقایق الهی وجود دارد که اگر طولانی شدن نبود، آن‌ها را فصل به فصل ذکر می‌کردیم. پس آن‌ها را برای کسانی که از عارفان بر کلام ما وقوف می‌یابند، رها کردیم، به عنوان تنبیهی برای آن‌ها بر آنچه منزل ندا از معانی الهی در بر دارد، و اینکه هستی (الکون) برخی از آن به برخی دیگر مرتبط است، مانند ارتباط معانی با کلمات. و گاهی واو را از ابزارهای ندا قرار داده‌اند، اما آن را به ندای خاصی برای حالتی خاص اختصاص داده‌اند، برخلاف سایر ابزارها. پس آن را به ندای ندبه (مصیبت) اختصاص داده‌اند، و مرده را ندا می‌دهند: وا جبلاه (ای کوهم) و واسنداه (ای تکیه‌گاهم). و به همین دلیل، مرده عذاب داده می‌شود، فرشته به پهلویش می‌زند که: این‌گونه بودی. و می‌گویند: وا زیداه، وا سلطاناه. و در این ندا حتماً باید «هاء سکت» (ه) در آخر آن وارد شود، زیرا شرط این ندا نیست که بعد از آن چیزی گفته شود. به همین دلیل، هاء سکت بر آن وارد شده و به آن اکتفا می‌شود، پس می‌گوید: وا جبلاه، وا حزناه. و به امر دیگری نیاز ندارد. و اگر بگویی: یا زید، و او را با سایر حروف ندا، غیر از ندای ندبه، ندا دهی، حتماً باید سببی را که به خاطر آن او را ندا داده‌ای، ذکر کنی. پس می‌گویی: يا جِبالُ أَوِّبِي مَعَهُ (ای کوه‌ها، با او تسبیح گویید)، يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا (ای کسانی که ایمان آورده‌اید، وفا کنید)، يا أَيُّهَا النَّاسُ اتَّقُوا (ای مردم، تقوا پیشه کنید). پس هاء سکت جز در ندای ندبه خاص نیست. و اما ندای مرخم (کوتاه شده)، آن‌ها با آن قصد تسهیل کلام را دارند تا بر منادی سبک باشد و به سرعت به مقصود برسد، به واسطه آنچه از کلمه حذف کرده است. زیرا ترخیم، تسهیل است. و از همین روست که به معشوق نیکو، «رخیم الدلال» (ناز و کرشمه نرم) گفته می‌شود، یعنی آسان است. و مثال ترخیم در مرخم این است که آخر اسم منادی را حذف کنی، پس اگر کسی را که نامش حارث است، ندا دهی، می‌گویی: یا حار هلم (ای حار، بیا)، و آخر کلمه را به قصد تسهیل حذف کردی. و بدان که اسم‌ها و اسم‌های افعال بر دو قسم هستند: معرب و مبنی. آنچه آخرش با ورود عوامل تغییر کند، معرب نامیده می‌شود. و اعراب، تغییر است. گفته می‌شود: «أعربت معدة الرجل» (معده مرد تغییر کرد) اگر تغییر کرده باشد. و این اسم از حالی به حال دیگر تغییر کرده است. این برخی از وجوه اشتقاق آن است که چرا معرب نامیده شده است. و مبنی، هر اسمی است، چه برای فعل باشد یا غیر فعل، که لفظش بر یک صفت ثابت بماند و ورود عواملی که تغییر در اعراب ایجاد می‌کنند، در آن تأثیر نگذارد. پس به دلیل ثبات و عدم پذیرش تغییر، مبنی (ساخته شده) نامیده شده است. و این بابی در صفت ثبوتی برای إله دارد، از آن جهت که او ذات است و از ثبوت دائمی نسبت الوهیت به او. و معرب بابی در معارف الهی دارد، از قول او: كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (او هر روز در کاری است) و سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (به زودی به حساب شما می‌پردازیم، ای جن و انس). این فرق بین معرب و مبنی است. پس اگر اسم ترخیم شود، اعراب آن ممکن است به آخرین حرف باقی‌مانده از کلمه منتقل شود. پس می‌گویی: یا حار هلم، در حالی که راء مکسور بود، حرکت ثاء به آن منتقل شد تا شنونده بداند که حرفی از اسم حذف شده است. زیرا منادی تنها زمانی اسم خود را می‌شناسد که نامش حارث با ثاء باشد. اگر ثاء حذف شود، ممکن است بگوید: آن من نیستم. اما اگر حرکت ثاء به راء منتقل شود، می‌داند که او مقصود است. همچنین، هنگامی که بنده با اسم الهی ندا داده می‌شود، ممکن است در نفسش بیفتد که شایسته آن اسم است، پس وصف عبودیت خود را به آن اسم الهی که بنده با آن ندا داده شده، منتقل می‌کند و می‌داند که او مقصود است، از آن جهت که بنده است، به دلیل استصحاب صفت برای او. این در صورتی است که حرکت منتقل شود. و اگر حرکت محذوف از اسم به آنچه باقی مانده منتقل نشود و بر حال خود رها شود، قصد در آن قصد دیگری است، و آن رها کردن هر حقی بر حقیقت خود است تا هستی (الکون) در هستی دیگر تأثیری نداشته باشد و خلعت هستی بر هستی دیگر ظاهر نشود، تا منفرد به آن، خدای تعالی باشد. زیرا ضمه‌ای که بر ثاء «حارث» است، لباس اوست. اگر آن را در ترخیم بر راء خلع کند، هستی بر هستی خلع کرده است. پس ممکن است کسی که خلعت بر او پوشانده شده، او را به عبودیت و ثنا بر او قصد کند. در حالی که خلع در حقیقت تنها برای متکلمِ منادی است، نه برای حرف ثاء. پس منادی است که رفعی را که برای حرف ثاء بود، بر راء خلع کرده است، هنگامی که عین آن را از هستی (الوجود) زائل کرده است، مانند خلع قطبیت و امامت از شخصی که عینش از دست رفته، به شخصی که در آن مقام ایستاده است، زیرا خداست که او را اقامه کرده، نه آن امامی که درگذشته است. پس ما در این منزل برخی از اسرار خود را بیان کردیم تا ان‌شاءالله برای طالب، تنبیهی بر آنچه در آن است، واقع شود. وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خدا حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}