{
  "id": 158,
  "title": {
    "ar": "الباب الثامن والخمسون ومائة في مقام الرسالة وأسرارها",
    "en": "Chapter 158: Concerning the Station of Messengership (مقام الرسالة) and its Mysteries.",
    "ur": "باب ایک سو اٹھاون: مقامِ رسالت اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و پنجاه و هشتم در مقام رسالت و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثامن والخمسون ومائة في مقام الرسالة وأسرارها)\n\n\n> إلا إن الرسالة برزخية *** ولا يحتاج صاحبها لنية\n\n\n> إذا أعطت بنيته قواها *** تلقتها بقوتها البنية\n\n\n> فيضحى مقسطا حكما عليما *** سؤوسا في تصاريف البرية\n\n\n> يصرفهم ويصرفه إليها *** كما تعطي مراتبها العلية\n\n\n> فمن فهم الذي قلناه فيها *** نفى أحكام كسب فلسفيه‏\n\n\n> وإن الاختصاص بها منوط *** كما دلت عليه الأشعرية\n\n\n> وما من شرطها عمل وعلم *** ولا من شرطها نفس زكيه‏\n\n\n> ولكن العوائد إن تراه *** على خير وأحوال رضية\n\n\n### [الولاية هي الدائرة الكبرى ومن أحكامها الرسالة والنبوة]\n\n\nاعلم أن الولاية هي المحيطة العامة وهي الدائرة الكبرى فمن حكمها أن يتولى الله من شاء من عباده بنبوة وهي من أحكام الولاية وقد يتولاه بالرسالة وهي من أحكام الولاية أيضا فكل رسول لا بد أن يكون نبيا وكل نبي لا بد أن يكون وليا\nفكل رسول لا بد أن يكون وليا فالرسالة خصوص مقام في الولاية والرسالة في الملائكة دنيا وآخرة لأنهم سفراء الحق لبعضهم وصنفهم ولمن سواهم من البشر في الدنيا والآخرة والرسالة في البشر لا تكون إلا في الدنيا وينقطع حكمها في الآخرة وكذلك تنقطع في الآخرة بعد دخول الجنة والنار نبوة التشريع لا النبوة العامة\n\n\n### [أصل الرسالة في الأسماء الإلهية ومقامها عند الكرسي‏]\n\n\nوأصل الرسالة في الأسماء الإلهية وحقيقة الرسالة إبلاغ كلام من متكلم إلى سامع فهي حال لا مقام ولا بقاء لها بعد انقضاء التبليغ وهي تتجدد وهو قوله ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ فالإتيان به هو الرسالة وحدوث الذكر عند السامع المرسل إليه هو الكلام المرسل به وقد يسمى الكلام المرسل به رسالة وهو علم يوصله إلى المرسل إليه ولهذا ظهر علم الرسالة في صورة اللبن والرسل هو اللبن لكن للرسالة مقام عند الله منه يبعث الله الرسل فلهذا جعلنا للرسالة مقاما وهو عند الكرسي ذلك هو مقام الرسالة ونبوة التشريع وما فوق ذلك فنبوة لا رسالة فالرسل لا يفضل بعضهم بعضا من حيث ما هم رسل وإنما فضل الله بعض الرسل على بعض وبَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ‏\n\n\n### [كل واحد من الرسل فاضل من وجه مفضول من وجه‏]\n\n\nوما من جماعة يشتركون في مقام إلا وهم على السواء فيما اشتركوا فيه ويفضل بعضهم بعضا بأحوال أخر ما هي عين ما وقع فيه الاشتراك وقد يكون ما يقع به المفاضلة يؤدي إلى التساوي وهو مذهب أبي القاسم بن قسي من الطائفة ومن قال بقوله فيكون كل واحد من الرسل فاضلا من وجه مفضولا من وجه فيفضل الواحد منهم بأمر لا يكون عند غيره ويفضل ذلك المفضول بأمر ليس عند الفاضل فيكون المفضول من ذلك الوجه الذي خص به يفضل على من فضله‏\n\n\n### [لا بد من إمام في كل نوع‏]\n\n\nوعندنا قد لا يكون التساوي ويجمع لواحد جميع ما عند الجماعة فيفضل الجماعة بجمع ما فضل به بعضهم على بعض لا بأمر زائد فهو أفضل من كل واحد واحد ولا يفاضل فيكون سيد الجماعة بهذا المجموع فلا ينفرد في فضله بأمر ليس عند آحاد الجنس هكذا هو في نفس الأمر في كل جنس فلا بد من إمام في كل نوع من رسول ونبي وولي ومؤمن وإنسان وحيوان ونبات ومعدن وملك وقد نبهنا على ذلك قبل هذا في الاختيارات‏\n\n\n### [الكلمة الإلهية كحكم وأقسامها]\n\n\nفمقام الرسالة الكرسي لأنه من الكرسي تنقسم الكلمة الإلهية إلى خبر وحكم فللأولياء والأنبياء الخبر خاصة ولأنبياء الشرائع والرسل الخبر والحكم ثم ينقسم الحكم إلى أمر ونهي ثم ينقسم الأمر إلى قسمين إلى مخير فيه وهو المباح وإلى مرغب فيه ثم ينقسم المرغب فيه إلى قسمين إلى ما يذم تاركه شرعا وهو الواجب والفرض وإلى ما يحمد بفعله وهو المندوب ولا يذم بتركه والنهي ينقسم قسمين نهي عن أمر يتعلق الذم بفاعله وهو المحظور ونهي يتعلق الحمد بتركه ولا يذم بفعله وهو المكروه‏\n\n\n### [الكلمة الإلهية كخبر وأقسامها]\n\n\nوأما الخبر فينقسم قسمين قسم يتعلق بما هو الحق عليه وقسم يتعلق بما هو العالم عليه والذي يتعلق بما هو الحق عليه ينقسم قسمين قسم يعلم وقسم لا يعلم فالذي لا يعلم ذاته والذي يعلم ينقسم قسمين قسم يطلب نفي المماثلة وعدم المناسبة وهو صفات التنزيه والسلب مثل لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ والْقُدُّوسُ وشبه ذلك وقسم يطلب المماثلة وهو صفات الأفعال وكل اسم إلهي يطلب العالم وهذه الأقسام كلها مجموع الرسالة وبه أتت الرسل‏\n\n\n### [الرسالة اختصاص إلهى الحق بها متكلم والرسول معلم‏]\n\n\nوالرسالة إذا ثبتت وثبت أنها اختصاص إلهي غير مكتسبة يثبت بها كون الحق متكلما أي موصوفا بالكلام فإنه مبلغ ما قيل له قل ولو كان مبلغا ما عنده أو ما يجده من العلم في نفسه لم يكن رسولا ولكان معلما فكل رسول معلم وما كل معلم رسول‏\n\n\n### [الأمر الواحد من غير معقولية سواه لا يقع الفائدة بتبليغه‏]\n\n\nوما سميت رسالة إلا من أجل هذه الأقسام التي تحتوي عليه ولو لا هذه الأقسام لم تكن رسالة لأن الأمر الواحد من غير معقولية سواه لا تقع الفائدة بتبليغه عند المرسل إليه لأنه لا يعقله ولهذا لا يعقل الذات الإلهية لأنها لا سوى لها ولا غير وتعقل الألوهية والربوبية لأن سواها المألوه والمربوب فتنبه لما أشرنا إليه تعثر على العلم المخزون والمرسلات عرفا تنبيه على التتابع والكثرة والتاليات يتلو بعضها بعضا فالرسالة يتلو بعضها بعضا ولهذا انقسمت والله الهادي‏\n\n",
    "en": "Chapter 158: Concerning the Station of Messengership (مقام الرسالة) and its Secrets\n\nKnow that Messengership (الرسالة) is an Isthmus (برزخية),\nAnd its possessor has no need for intention (نية).\n\nIf his structure grants its powers,\nThe structure receives them with its strength.\n\nThus he becomes just, a wise judge (حكما عليما),\nA governor (سؤوسا) in the dispositions of creation (البرية).\n\nHe directs them, and they direct him to it,\nAccording to what their lofty levels (مراتبها العلية) bestow.\n\nWhoever understands what we have said concerning it,\nWill negate the rulings of philosophical acquisition (كسب فلسفيه).\n\nIndeed, the specialization (الاختصاص) in it is tied,\nJust as the Ash'aris (الأشعرية) have indicated.\n\nNeither action nor knowledge is a condition for it,\nNor is a purified soul (نفس زكيه) a condition for it.\n\nBut custom (العوائد) dictates that you see him\nUpon goodness and pleasing states (أحوال رضية).\n\n### [Sainthood (الولاية) is the Greater Circle, and Messengership and Prophethood are among its Rulings]\n\nKnow that Sainthood (الولاية) is the comprehensive encompassment; it is the Greater Circle (الدائرة الكبرى). Among its rulings (حكمها) is that Allah takes charge of whomever He wills among His servants through Prophethood (نبوة), which is one of the rulings of Sainthood. He may also take charge of him through Messengership (رسالة), which is also one of the rulings of Sainthood. Thus, every Messenger (رسول) must be a Prophet (نبي), and every Prophet must be a Saint (ولي).\n\nTherefore, every Messenger must be a Saint. Messengership is a specific station (خصوص مقام) within Sainthood. Messengership among the angels exists in this world (دنيا) and the Hereafter (آخرة), because they are the ambassadors (سفراء) of the Real (الحق) to one another, to their own kind, and to others, such as humans, in this world and the Hereafter. Messengership among humans, however, only occurs in this world, and its ruling ceases in the Hereafter. Similarly, the Prophethood of Law-giving (نبوة التشريع) ceases in the Hereafter after entry into Paradise or the Fire, but not the general Prophethood (النبوة العامة).\n\n### [The Origin of Messengership in the Divine Names and its Station at the Throne (الكرسي)]\n\nThe origin (أصل) of Messengership lies in the Divine Names (الأسماء الإلهية). The reality (حقيقة) of Messengership is the conveyance of speech (كلام) from a speaker to a listener. Thus, it is a state (حال), not a station (مقام), and it has no subsistence (بقاء) after the completion of the conveyance. It is continually renewed, which is indicated by His saying: <<مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ>> (No fresh reminder comes to them from their Lord). The bringing of this reminder is the Messengership, and the occurrence of the reminder (الذكر) with the listener to whom it is sent is the speech that is sent. The speech sent may itself be called Messengership, as it is knowledge (علم) that reaches the recipient. This is why the knowledge of Messengership appeared in the form of milk (اللبن), and the Messenger (الرسل) is the milk. However, Messengership has a station with Allah, from which Allah sends the Messengers. Therefore, we have assigned a station to Messengership, and that is at the Throne (الكرسي). That is the station of Messengership and the Prophethood of Law-giving. What is above that is Prophethood, but not Messengership. Messengers do not excel one another merely by virtue of being Messengers. Rather, Allah has favored some Messengers over others, <<وَبَعْضَ النَّبِيِّينَ عَلَى بَعْضٍ>> (and some Prophets over others).\n\n### [Every single Messenger is Superior in one respect and Inferior in another]\n\nThere is no group that shares a station (مقام) except that they are equal in what they share. They excel one another by other states (أحوال أخر) that are not the essence of the shared aspect. It may be that the basis for preference (المفاضلة) leads back to equality. This is the doctrine (مذهب) of Abu al-Qasim ibn Qasi among the Sufi group (الطائفة) and those who agree with him. In this view, every single Messenger is superior (فاضلا) in one respect and inferior (مفضولا) in another. One of them may be favored by something that is not present in another, and that inferior one may be favored by something that the superior one lacks. Thus, the inferior one, by virtue of that aspect specific to him, excels the one who is superior to him.\n\n### [There must be an Imam (Leader) in every Species]\n\nAccording to our view, equality may not exist, and one individual may combine all that the group possesses. He thus excels the group by combining all the aspects by which some of them excel others, not by an added matter. He is superior to every single individual, yet he is not subject to comparison (لا يفاضل). He becomes the master (سيد) of the group by this totality, and thus he is not unique in his excellence by something that is absent from the individuals of his species. This is the case in the reality of the matter (نفس الأمر) for every species. Therefore, there must be an Imam (إمام) in every type: Messenger, Prophet, Saint, believer, human, animal, plant, mineral, and angel. We have drawn attention to this previously in *Al-Ikhtiyarat*.\n\n### [The Divine Word (الكلمة الإلهية) as Ruling and its Divisions]\n\nThe station of Messengership is the Throne (الكرسي), because it is from the Throne that the Divine Word (الكلمة الإلهية) is divided into information (خبر) and ruling (حكم). For the Saints (الأولياء) and Prophets (الأنبياء), there is information specifically. For the Prophets of Law-giving (أنبياء الشرائع) and the Messengers (الرسل), there is both information and ruling. The ruling is then divided into command (أمر) and prohibition (نهي). The command is divided into two sections: that in which one is given a choice, which is the Permissible (المباح), and that which is encouraged (مرغب فيه). The encouraged is then divided into two sections: that whose abandonment is legally blameworthy (شرعا), which is the Obligatory (الواجب) and the Mandatory (الفرض); and that whose performance is praiseworthy, which is the Recommended (المندوب), and whose abandonment is not blameworthy. The prohibition is divided into two sections: a prohibition concerning an act whose doer incurs blame, which is the Forbidden (المحظور); and a prohibition whose abandonment is praiseworthy but whose performance is not blameworthy, which is the Disliked (المكروه).\n\n### [The Divine Word (الكلمة الإلهية) as Information and its Divisions]\n\nAs for the information (الخبر), it is divided into two sections: a section related to what the Real (الحق) is upon, and a section related to what the World (العالم) is upon. That which relates to what the Real is upon is divided into two sections: a section that is known and a section that is not known. That which is not known is His Essence (ذاته). That which is known is divided into two sections: a section that demands the negation of likeness and the absence of suitability, which are the Attributes of Transcendence (صفات التنزيه) and Negation (السلب), such as <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) and <<الْقُدُّوسُ>> (The Holy), and the like; and a section that demands likeness, which are the Attributes of Acts (صفات الأفعال). Every Divine Name (اسم إلهي) demands the World. All these divisions constitute the totality of Messengership (مجموع الرسالة), and it is with these that the Messengers came.\n\n### [Messengership is a Divine Specialization; The Real is the Speaker, and the Messenger is the Teacher]\n\nWhen Messengership (الرسالة) is established, and it is established that it is a non-acquired Divine specialization (اختصاص إلهي), it proves that the Real (الحق) is a Speaker (متكلما)—that is, described by Speech (الكلام). For the Messenger conveys what he was told to say, \"Say.\" If he were merely conveying what he possessed or the knowledge (العلم) he found within himself, he would not be a Messenger but a teacher (معلما). Thus, every Messenger is a teacher, but not every teacher is a Messenger.\n\n### [A Single Matter, without the Conceivability of its Other, yields no Benefit in its Conveyance]\n\nMessengership was only named as such because of these divisions (الأقسام) that it contains. Were it not for these divisions, it would not be Messengership, because a single matter (الأمر الواحد), without the conceivability of its other (سواه), yields no benefit in its conveyance to the recipient, for he cannot comprehend it. This is why the Divine Essence (الذات الإلهية) cannot be comprehended, because it has no other (لا سوى لها) and no opposite (لا غير). But Divinity (الألوهية) and Lordship (الربوبية) are comprehensible because their 'other' is the worshipped (المألوه) and the nurtured (المربوب). Pay attention to what we have indicated, and you will find the Hidden Knowledge (العلم المخزون). The phrase <<وَالْمُرْسَلَاتِ عُرْفًا>> (By the successive ones, one after another) is an indication of continuity and multiplicity, and <<فَالْتَّالِيَاتِ تَلْوًا>> (and the followers, following) means that some follow others. Thus, Messengership follows itself, and this is why it was divided. And Allah is the Guide.",
    "ur": "## (باب نمبر ایک سو اٹھاون: مقامِ رسالت اور اس کے اسرار کے بیان میں)\n\n> مگر رسالت برزخی ہے،\n> اور اس کے حامل کو نیت کی حاجت نہیں ہوتی۔\n\n> جب وہ اپنی نیت سے اپنی قوتیں عطا کرتی ہے،\n> تو بناوٹ (بنیہ) اسے اپنی قوت سے وصول کرتی ہے۔\n\n> پس وہ منصف، حاکم، دانا،\n> اور مخلوقات کے تصرفات میں سیاست دان بن جاتا ہے۔\n\n> وہ انہیں تصرف میں لاتا ہے اور وہ اسے اس کی طرف پھیرتے ہیں،\n> جیسا کہ اس کے بلند مراتب عطا کرتے ہیں۔\n\n> پس جس نے اس میں ہماری کہی ہوئی بات کو سمجھ لیا،\n> اس نے فلسفیانہ کسب کے احکام کی نفی کر دی۔\n\n> اور اس کے ساتھ اختصاص مشروط ہے،\n> جیسا کہ اشاعرہ نے اس پر دلالت کی ہے۔\n\n> اور اس کی شرط نہ عمل ہے نہ علم،\n> اور نہ ہی اس کی شرط نفسِ پاکیزہ ہے۔\n\n> لیکن عادات یہ ہیں کہ تم اسے\n> خیر اور پسندیدہ احوال پر دیکھو گے۔\n\n### [ولایت ہی دائرہ کبریٰ ہے اور رسالت و نبوت اس کے احکام میں سے ہیں]\n\nجان لو کہ ولایت ہی محیطِ عام ہے اور یہی دائرہ کبریٰ ہے۔ اس کے حکم میں سے یہ ہے کہ اللہ اپنے بندوں میں سے جسے چاہے نبوت کے ذریعے اپنا ولی بنا لے، اور یہ ولایت کے احکام میں سے ہے۔ اور کبھی اسے رسالت کے ذریعے اپنا ولی بنا لیتا ہے، اور یہ بھی ولایت کے احکام میں سے ہے۔ پس ہر رسول کا نبی ہونا ضروری ہے، اور ہر نبی کا ولی ہونا ضروری ہے۔\n\nپس ہر رسول کا ولی ہونا ضروری ہے۔ رسالت ولایت میں ایک خاص مقام ہے۔ اور فرشتوں میں رسالت دنیا اور آخرت دونوں میں ہے، کیونکہ وہ آپس میں ایک دوسرے کے لیے اور ان کے علاوہ دنیا اور آخرت میں انسانوں کے لیے حق (الحق) کے سفیر ہیں۔ اور انسانوں میں رسالت صرف دنیا میں ہوتی ہے اور آخرت میں اس کا حکم منقطع ہو جاتا ہے۔ اسی طرح جنت اور دوزخ میں داخلے کے بعد آخرت میں نبوتِ تشریع (شریعت والی نبوت) منقطع ہو جاتی ہے، نہ کہ نبوتِ عامہ۔\n\n### [رسالت کی اصل اسماء الٰہیہ میں ہے اور اس کا مقام کرسی کے پاس ہے]\n\nاور رسالت کی اصل اسماء الٰہیہ میں ہے۔ اور حقیقتِ رسالت یہ ہے کہ متکلم کی طرف سے کلام کو سامع تک پہنچایا جائے۔ پس یہ ایک حال ہے نہ کہ مقام، اور تبلیغ کے ختم ہونے کے بعد اس کے لیے بقا (البقاء) نہیں ہے۔ اور یہ تجدد (نیا ہونا) اختیار کرتی رہتی ہے، اور یہی اللہ کا قول ہے: **مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ** (ان کے رب کی طرف سے کوئی نئی نصیحت نہیں آتی)۔ پس اس کا آنا ہی رسالت ہے، اور مرسل الیہ (جس کی طرف بھیجا گیا) سامع کے پاس ذکر کا نیا ہونا ہی وہ کلام ہے جو بھیجا گیا ہے۔ اور کبھی بھیجے گئے کلام کو بھی رسالت کہا جاتا ہے، اور یہ وہ علم ہے جو مرسل الیہ تک پہنچایا جاتا ہے۔ اسی لیے علمِ رسالت دودھ کی صورت میں ظاہر ہوا، اور الرسل (رسول) دودھ ہی ہے۔ لیکن رسالت کا اللہ کے ہاں ایک مقام ہے جہاں سے اللہ رسولوں کو مبعوث فرماتا ہے۔ اسی لیے ہم نے رسالت کے لیے ایک مقام مقرر کیا ہے، اور وہ کرسی کے پاس ہے۔ یہی رسالت اور نبوتِ تشریع کا مقام ہے۔ اور جو اس سے اوپر ہے وہ نبوت ہے، رسالت نہیں۔ پس رسول آپس میں ایک دوسرے پر فضیلت نہیں رکھتے اس حیثیت سے کہ وہ رسول ہیں، بلکہ اللہ نے بعض رسولوں کو بعض پر فضیلت دی ہے اور **وَبَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ** (اور بعض نبیوں کو بعض پر)۔\n\n### [ہر رسول ایک پہلو سے افضل اور دوسرے پہلو سے مفضول ہے]\n\nاور کوئی بھی جماعت جو کسی مقام میں شریک ہو، وہ اس چیز میں برابر ہوتی ہے جس میں وہ شریک ہوئے، اور وہ ایک دوسرے پر دیگر احوال کی بنا پر فضیلت رکھتے ہیں جو عین وہ نہیں ہیں جس میں اشتراک واقع ہوا ہے۔ اور کبھی وہ چیز جس سے فضیلت واقع ہوتی ہے، برابری کی طرف لے جاتی ہے، اور یہ طائفہ میں سے ابو القاسم ابن قسی اور ان کے ہم خیال لوگوں کا مذہب ہے۔ پس ہر رسول ایک پہلو سے افضل اور دوسرے پہلو سے مفضول (کمتر) ہوتا ہے۔ ان میں سے ایک کو کسی ایسی چیز سے فضیلت دی جاتی ہے جو دوسرے کے پاس نہیں ہوتی، اور اس مفضول کو کسی ایسی چیز سے فضیلت دی جاتی ہے جو فاضل کے پاس نہیں ہوتی۔ پس وہ مفضول اس پہلو سے جس کے ساتھ وہ خاص کیا گیا ہے، اس پر فضیلت رکھتا ہے جس نے اسے فضیلت دی۔\n\n### [ہر نوع میں ایک امام کا ہونا ضروری ہے]\n\nاور ہمارے نزدیک کبھی برابری نہیں ہوتی، اور ایک شخص کے لیے وہ سب کچھ جمع کر دیا جاتا ہے جو اس جماعت کے پاس ہوتا ہے۔ پس وہ جماعت پر اس مجموعے کی وجہ سے فضیلت رکھتا ہے جس سے ان میں سے بعض کو بعض پر فضیلت دی گئی تھی، نہ کہ کسی زائد امر کی وجہ سے۔ پس وہ ہر ایک فرد سے افضل ہے اور اس میں کوئی مفاضلہ (فضیلت کا مقابلہ) نہیں ہوتا۔ پس وہ اس مجموعے کی وجہ سے جماعت کا سردار ہوتا ہے۔ پس وہ اپنی فضیلت میں کسی ایسے امر میں منفرد نہیں ہوتا جو اس جنس کے افراد کے پاس نہ ہو۔ حقیقتِ امر میں ہر جنس میں ایسا ہی ہوتا ہے۔ پس ہر نوع میں ایک امام کا ہونا ضروری ہے، خواہ وہ رسول ہو، نبی ہو، ولی ہو، مومن ہو، انسان ہو، حیوان ہو، نباتات ہو، معدن ہو، یا فرشتہ ہو۔ ہم اس سے پہلے \"الاختیارات\" میں اس پر تنبیہ کر چکے ہیں۔\n\n### [کلمہ الٰہیہ بطور حکم اور اس کی اقسام]\n\nپس رسالت کا مقام کرسی ہے، کیونکہ کرسی سے ہی کلمہ الٰہیہ خبر اور حکم میں تقسیم ہوتا ہے۔ اولیاء اور انبیاء کے لیے صرف خبر ہے، اور انبیاءِ شرائع اور رسولوں کے لیے خبر اور حکم دونوں ہیں۔ پھر حکم امر اور نہی میں تقسیم ہوتا ہے۔ پھر امر دو قسموں میں تقسیم ہوتا ہے: ایک وہ جس میں اختیار دیا گیا ہے، جو کہ مباح ہے، اور دوسرا وہ جس کی ترغیب دی گئی ہے۔ پھر مرغوب فیہ (جس کی ترغیب دی گئی) دو قسموں میں تقسیم ہوتا ہے: ایک وہ جس کے ترک کرنے والے کی شرعاً مذمت کی جاتی ہے، جو کہ واجب اور فرض ہے، اور دوسرا وہ جس کے کرنے سے تعریف کی جاتی ہے، جو کہ مندوب ہے، اور اس کے ترک کرنے سے مذمت نہیں کی جاتی۔ اور نہی دو قسموں میں تقسیم ہوتی ہے: ایک وہ نہی جس کا تعلق اس امر سے ہے کہ اس کے کرنے والے کی مذمت ہوتی ہے، جو کہ محظور (حرام) ہے، اور دوسری وہ نہی جس کا تعلق اس کے ترک کرنے سے تعریف سے ہے اور اس کے کرنے سے مذمت نہیں ہوتی، جو کہ مکروہ ہے۔\n\n### [کلمہ الٰہیہ بطور خبر اور اس کی اقسام]\n\nاور جہاں تک خبر کا تعلق ہے، وہ دو قسموں میں تقسیم ہوتی ہے: ایک قسم کا تعلق اس سے ہے جس پر حق (الحق) ہے، اور دوسری قسم کا تعلق اس سے ہے جس پر عالم ہے۔ اور وہ جو حق (الحق) سے متعلق ہے، دو قسموں میں تقسیم ہوتا ہے: ایک قسم جو معلوم ہے اور ایک قسم جو معلوم نہیں ہے۔ پس جو معلوم نہیں ہے وہ ذات (الذات) ہے، اور جو معلوم ہے وہ دو قسموں میں تقسیم ہوتا ہے: ایک قسم جو مماثلت کی نفی اور عدمِ مناسبت کا تقاضا کرتی ہے، جو کہ صفاتِ تنزیہ اور سلب ہیں، جیسے **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (اس کی مثال کوئی چیز نہیں) اور **الْقُدُّوسُ** (پاک ذات) اور اس طرح کی چیزیں۔ اور ایک قسم جو مماثلت کا تقاضا کرتی ہے، جو کہ صفاتِ افعال ہیں۔ اور ہر اسمِ الٰہی عالم کا تقاضا کرتا ہے۔ یہ تمام اقسام رسالت کا مجموعہ ہیں، اور رسول انہی کے ساتھ آئے ہیں۔\n\n### [رسالت اختصاص الٰہی ہے، حق اس کے ذریعے متکلم ہے اور رسول معلم ہے]\n\nاور جب رسالت ثابت ہو جائے اور یہ ثابت ہو جائے کہ یہ ایک اختصاصِ الٰہی ہے جو کسبی نہیں ہے، تو اس سے حق (الحق) کا متکلم ہونا ثابت ہوتا ہے، یعنی کلام کے ساتھ موصوف ہونا۔ کیونکہ رسول اس چیز کو پہنچانے والا ہے جو اسے کہا گیا ہے کہ \"کہو\"۔ اور اگر وہ وہ چیز پہنچاتا جو اس کے پاس ہوتی یا جو وہ اپنے نفس میں علم سے پاتا، تو وہ رسول نہ ہوتا بلکہ معلم ہوتا۔ پس ہر رسول معلم ہے، لیکن ہر معلم رسول نہیں ہے۔\n\n### [ایک ہی امر کا ابلاغ بغیر کسی دوسرے کی معقولیت کے فائدہ نہیں دیتا]\n\nاور اسے رسالت صرف ان اقسام کی وجہ سے کہا گیا ہے جو یہ اپنے اندر رکھتی ہے۔ اور اگر یہ اقسام نہ ہوتیں تو رسالت نہ ہوتی، کیونکہ ایک ہی امر کا ابلاغ بغیر کسی دوسرے کی معقولیت کے مرسل الیہ کے نزدیک فائدہ نہیں دیتا، کیونکہ وہ اسے عقل نہیں کر سکتا۔ اسی لیے ذاتِ الٰہیہ کو عقل نہیں کیا جا سکتا، کیونکہ اس کا کوئی سوائے (دوسرا) نہیں ہے، اور الوہیت اور ربوبیت کو عقل کیا جا سکتا ہے، کیونکہ ان کا سوائے (دوسرا) مألوہ (جس کی عبادت کی جائے) اور مربوب (جس کی پرورش کی جائے) ہے۔ پس اس طرف توجہ دو جس کی طرف ہم نے اشارہ کیا ہے، تم مخفی علم (العلم المخزون) کو پا لو گے۔ اور **وَالْمُرْسَلَاتِ عُرْفًا** (اور پے در پے بھیجی جانے والی ہوائیں) تسلسل اور کثرت پر تنبیہ ہے، اور **وَالتَّالِيَاتِ** (اور پے در پے آنے والی) ایک دوسرے کے پیچھے آتی ہیں۔ پس رسالت ایک دوسرے کے پیچھے آتی ہے، اور اسی لیے یہ تقسیم ہوئی ہے۔ اور اللہ ہی ہدایت دینے والا ہے۔",
    "fa": "(باب صد و پنجاه و هشتم در مقام رسالت و اسرار آن)\n\nرسالت، برزخی است و صاحبش را نیازی به نیت نیست\nآنگاه که نیتش قوای خود را ببخشد، سرشت (بنیه) آن را با نیروی خود دریافت می‌کند.\nپس او حاکمی دادگر، دانشمند و مدبر در تدبیر امور خلقت می‌شود.\nاو خلق را تدبیر می‌کند و خلق او را به سوی خود می‌کشاند، همان‌گونه که مراتب والای خود را می‌بخشد.\nپس هر کس آنچه را که در باب رسالت گفتیم بفهمد، احکام کسب فلسفی را نفی می‌کند.\nو اختصاص به رسالت منوط به اراده الهی است، همان‌گونه که اشاعره بر آن دلالت کرده‌اند.\nو عمل و علم شرط آن نیست، و نه نفس پاکیزه شرط آن است.\nبلکه عادات (الهی) چنین است که او را بر خیر و احوال پسندیده می‌بینی.\n\n### [ولایت، دایره بزرگ است و رسالت و نبوت از احکام آن هستند]\n\nبدان که ولایت (الولایة) همان محیط عام و دایره بزرگ است. از احکام آن این است که حق (الحق) هر یک از بندگانش را که بخواهد، به نبوت متولی می‌شود، و نبوت از احکام ولایت است. و گاه او را به رسالت متولی می‌شود، و رسالت نیز از احکام ولایت است. پس هر رسولی ناگزیر باید نبی باشد، و هر نبی‌ای ناگزیر باید ولی باشد.\nپس هر رسولی ناگزیر باید ولی باشد. رسالت (الرسالة)، مقام خاصی در ولایت است. رسالت در میان فرشتگان هم در دنیا و هم در آخرت وجود دارد، زیرا آنان سفیران حق (الحق) برای یکدیگر و برای اصناف خود و برای غیر خود از بشر در دنیا و آخرت هستند. اما رسالت در میان بشر تنها در دنیا وجود دارد و حکم آن در آخرت منقطع می‌شود. همچنین، پس از ورود به بهشت و جهنم، نبوت تشریعی منقطع می‌شود، نه نبوت عامه.\n\n### [اصل رسالت در اسماء الهی و مقام آن نزد کرسی است]\n\nاصل رسالت در اسماء الهی است. حقیقت رسالت، ابلاغ کلام از متکلم به شنونده است. پس رسالت یک حال است نه یک مقام، و پس از پایان ابلاغ، بقایی برای آن نیست. و این حال تجدید می‌شود، و این همان قول خداوند است: ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ (هیچ یادآوری تازه‌ای از پروردگارشان برایشان نمی‌آید). آمدن این ذکر، همان رسالت است، و حدوث ذکر نزد شنونده‌ای که به سوی او فرستاده شده، همان کلامی است که به واسطه آن فرستاده شده است. و گاهی کلام فرستاده شده نیز رسالت نامیده می‌شود، و آن علمی است که به مرسل‌الیه می‌رساند. به همین دلیل، علم رسالت در صورت شیر (اللبن) ظاهر شد، و رُسُل (جمع رسول) همان شیر است. اما رسالت نزد خداوند مقامی دارد که خداوند رسولان را از آنجا مبعوث می‌کند. به همین دلیل، ما برای رسالت مقامی قائل شدیم و آن نزد کرسی (الکرسی) است. آن مقام، مقام رسالت و نبوت تشریعی است. و آنچه بالاتر از آن است، نبوت است نه رسالت. پس رسولان از حیث اینکه رسول هستند، بر یکدیگر برتری ندارند، بلکه خداوند برخی از رسولان را بر برخی دیگر و بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ (برخی از پیامبران را بر برخی دیگر) برتری داده است.\n\n### [هر یک از رسولان از جهتی برتر و از جهتی فروتر است]\n\nهیچ گروهی نیست که در یک مقام مشترک باشند، مگر اینکه در آنچه مشترک‌اند برابرند، و برتری برخی بر برخی دیگر به واسطه احوال دیگری است که عین آن وجه اشتراک نیست. و گاهی آنچه موجب برتری می‌شود، به تساوی می‌انجامد. این مذهب ابوالقاسم بن قسی از طایفه صوفیه و کسانی است که قول او را پذیرفته‌اند. در این صورت، هر یک از رسولان از جهتی فاضل و از جهتی مفضول (فروتر) است. پس یکی از آنان به امری برتری می‌یابد که نزد دیگری نیست، و آن مفضول نیز به امری برتری می‌یابد که نزد فاضل نیست. پس مفضول از آن وجهی که به آن اختصاص یافته، بر کسی که او را برتری داده، برتری می‌یابد.\n\n### [در هر نوعی ناگزیر باید امامی باشد]\n\nنزد ما، ممکن است تساوی وجود نداشته باشد و تمام آنچه نزد آن گروه است، برای یک نفر جمع شود. پس او بر آن گروه برتری می‌یابد به واسطه جمع کردن تمام آنچه که برخی از آنان بر برخی دیگر برتری یافته‌اند، نه به واسطه امری زائد. پس او از هر یک از افراد برتر است و مفاضله‌ای (برتری‌جویی) در کار نیست. او به واسطه این مجموعه، سید آن گروه است. پس در فضیلت خود به امری که نزد آحاد آن جنس نیست، منفرد نمی‌شود. در نفس‌الامر، در هر جنسی چنین است. پس ناگزیر باید در هر نوعی امامی باشد، چه رسول، چه نبی، چه ولی، چه مؤمن، چه انسان، چه حیوان، چه نبات، چه معدن و چه ملک. ما پیش از این در باب اختیارات بر این نکته تنبیه داده‌ایم.\n\n### [کلمه الهی به عنوان حکم و اقسام آن]\n\nمقام رسالت، کرسی (الکرسی) است، زیرا کلمه الهی (الکلمة الإلهیة) از کرسی به خبر و حکم تقسیم می‌شود. برای اولیا و انبیا، فقط خبر است، و برای انبیای صاحب شریعت و رسولان، خبر و حکم است. سپس حکم به امر و نهی تقسیم می‌شود. سپس امر به دو بخش تقسیم می‌شود: یکی آنچه در آن اختیار داده شده است که همان مباح است، و دیگری آنچه به آن ترغیب شده است. سپس آنچه به آن ترغیب شده است به دو بخش تقسیم می‌شود: یکی آنچه ترک‌کننده‌اش شرعاً مذمت می‌شود که همان واجب و فرض است، و دیگری آنچه با انجامش ستایش می‌شود و با ترکش مذمت نمی‌شود که همان مندوب است. و نهی به دو بخش تقسیم می‌شود: نهی از امری که ذم به فاعل آن تعلق می‌گیرد که همان محظور (حرام) است، و نهی‌ای که ستایش به ترک آن تعلق می‌گیرد و با انجامش مذمت نمی‌شود که همان مکروه است.\n\n### [کلمه الهی به عنوان خبر و اقسام آن]\n\nاما خبر به دو بخش تقسیم می‌شود: بخشی که به آنچه حق (الحق) بر آن است تعلق دارد، و بخشی که به آنچه عالم بر آن است تعلق دارد. آنچه به آنچه حق بر آن است تعلق دارد، به دو بخش تقسیم می‌شود: بخشی که دانسته می‌شود و بخشی که دانسته نمی‌شود. آنچه دانسته نمی‌شود، ذات اوست. و آنچه دانسته می‌شود، به دو بخش تقسیم می‌شود: بخشی که نفی مماثلت و عدم مناسبت را می‌طلبد که همان صفات تنزیه و سلب است، مانند لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست) و الْقُدُّوسُ (قدوس) و مانند آن. و بخشی که مماثلت را می‌طلبد که همان صفات افعال است. و هر اسم الهی، عالم را می‌طلبد. این اقسام همگی مجموع رسالت هستند و رسولان با اینها آمده‌اند.\n\n### [رسالت، اختصاصی الهی است؛ حق به واسطه آن متکلم است و رسول معلم]\n\nهنگامی که رسالت ثابت شد و ثابت شد که اختصاصی الهی و غیر اکتسابی است، به واسطه آن ثابت می‌شود که حق (الحق) متکلم است، یعنی به صفت کلام موصوف است. زیرا رسول ابلاغ‌کننده چیزی است که به او گفته شده است: «بگو». و اگر ابلاغ‌کننده آنچه نزد خود دارد یا آنچه از علم در نفس خود می‌یابد بود، رسول نبود، بلکه معلم بود. پس هر رسولی معلم است، اما هر معلمی رسول نیست.\n\n### [امر واحد بدون معقولیت غیر آن، ابلاغش فایده‌ای ندارد]\n\nرسالت نامیده نشد مگر به خاطر این اقسامی که در بر دارد. اگر این اقسام نبودند، رسالتی وجود نداشت، زیرا امر واحد بدون معقولیت غیر آن، ابلاغش نزد مرسل‌الیه فایده‌ای ندارد، چون آن را تعقل نمی‌کند. به همین دلیل، ذات الهی تعقل نمی‌شود، زیرا غیر و سوایی ندارد. اما الوهیت و ربوبیت تعقل می‌شوند، زیرا مألوه و مربوب، سوای آنها هستند. پس به آنچه اشاره کردیم توجه کن تا بر علم مخزون دست یابی. و الْمُرْسَلاتِ عُرْفاً (سوگند به فرستادگان پی در پی) تنبیهی است بر تتابع و کثرت، و التَّالِياتِ (و سوگند به تلاوت‌کنندگان) که برخی به دنبال برخی دیگر می‌آیند. پس رسالت نیز برخی به دنبال برخی دیگر می‌آیند. به همین دلیل تقسیم شد. و خداوند هدایت‌کننده است."
  },
  "page_count": 2
}