{
  "id": 78,
  "title": {
    "ar": "الباب الثامن والسبعون في معرفة الخلوة",
    "en": "Chapter Seventy-Eight: Concerning the Gnosis (معرفة) of Spiritual Retreat (الخلوة)",
    "ur": "باب اڑسٹھواں خلوت کی معرفت میں",
    "fa": "باب هفتاد و هشتم در معرفت خلوت"
  },
  "content": {
    "ar": "## (الباب الثامن والسبعون في معرفة الخلوة)\n\n\n> خلوت بمن أهوى فلم يك غيرنا *** ولو كان غيري لم يصح وجودها\n\n\n> إذا أحكمت نفسي شروط انفرادها *** فإن نفوس الخلق طرا عبيدها\n\n\n> ولو لم يكن في نفسها غير نفسها *** لجادت بها جودا على من يجيدها\n\n\n### [الأصل الشرعي للخلوة]\n\n\nاعلم وفقنا الله وإياكم أن الخلوة أصلها في الشرع‏\n\n\nمن ذكرني في نفسه ذكرته في نفسي ومن ذكرني في ملأ ذكرته في ملأ خير منه‏\n\n\nفهذا حديث إلهي صحيح يتضمن الخلوة والجلوة وأصل الخلوة من الخلأ الذي وجد فيه العالم‏\n\n\n> فمن خلا ولم يجد فما خلا *** فهي طريق حكمها حكم البلا\n\n\nوقال رسول الله صلى الله عليه وسلم كان الله ولا شي‏ء معه‏\n\n\nوسئل رسول الله صلى الله عليه وسلم أين كان ربنا قبل أن يخلق خلقه قال كان في عماء ما فوقه هواء وما تحته هواء\n\n\nثم خلق الخلق وقضى القضية وفرغ من أشياء وهو كل يوم في شأن وسيفرغ من أشياء ثم يعمر المنازل بأهلها إلى الأبد\n\n\n### [الخلوة أعلى المقامات وهي المنزل الذي يعمره الإنسان‏]\n\n\nالخلوة أعلى المقامات وهو المنزل الذي يعمره الإنسان ويملؤه بذاته فلا يسعه معه فيه غيره فتلك الخلوة ونسبتها إليه ونسبته إليها نسبة الحق إلى قلب العبد الذي وسعه ولا يدخله وفيه غير بوجه من الوجوه الكونية فيكون خاليا من الأكوان كلها فيظهر فيه بذاته ونسبة القلب إلى الحق أن يكون على صورته فلا يسع فيه سواه‏\n\n\n### [الأصل الكونى للخلوة]\n\n\nوأصل الخلوة في العالم الخلأ الذي ملأه العالم فأول شي‏ء ملأه الهباء وهو جوهر مظلم ملأ الخلأ بذاته ثم تجلى له الحق باسمه النور فانصبغ به ذلك الجوهر وزال عنه حكم الظلمة وهو العدم فاتصف بالوجود فظهر لنفسه بذلك النور المنصبغ به وكان ظهوره به على صورة الإنسان وبهذا يسميه أهل الله الإنسان الكبير وتسمى مختصره الإنسان الصغير لأنه موجود أو دع الله فيه حقائق العالم الكبير كلها فخرج على صورة العالم مع صغر جرمه والعالم على صورة الحق فالإنسان على صورة الحق وهوقوله إن الله خلق آدم على صورته‏\n\n\nولما كان الأمر على ما قررناه لذلك قال تعالى لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ لكن يعلم القليل من الناس‏\n\n\n### [الإنسان عالم صغير والعالم إنسان كبير والإنسان الكامل هو الوجيز]\n\n\nفالإنسان عالم صغير والعالم إنسان كبير ثم انفتحت في العالم صور الأشكال من الأفلاك والعناصر والمولدات فكان الإنسان آخر مولد في العالم أوجده الله جامعا لحقائق العالم كله وجعله خليفة فيه فأعطاه قوة كل صورة موجودة في العالم فذلك الجوهر الهبائي المنصبغ بالنور هو البسيط وظهور صور العالم فيه هو الوسيط والإنسان الكامل هو الوجيز قال تعالى سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ ليعلموا أن الإنسان عالم وجيز من العالم يحوي على الآيات التي في العالم‏\n\n\n### [أول ما يكشف لصاحب الخلوة آيات العالم قبل آيات نفسه‏]\n\n\nفأول ما يكشف لصاحب الخلوة آيات العالم قبل آيات نفسه لأن العالم قبله كما قال تعالى سَنُرِيهِمْ آياتِنا في الْآفاقِ‏\nثم بعد هذا يريه الآيات التي أبصرها في العالم في نفسه فلو رآها أولا في نفسه ثم رآها في العالم ربما تخيل أن نفسه رأى في العالم فرفع الله عنه هذا الإشكال بأن قدم له رؤية الآيات في العالم كالذي وقع في الوجود فإنه أقدم من الإنسان وكيف لا يكون أقدم وهو أبوه فأبانت له رؤية تلك الآيات التي في الآفاق وفي نفسه أنه الحق لا غيره وتبين له ذلك‏\n\n\n### [آيات الله في الآفاق وفي الأنفس دلالات على أنه هو الظاهر في المظاهر]\n\n\nفالآيات هي الدلالات له على أنه الحق الظاهر في مظاهر أعيان العالم فلا يطلب على أمر آخر صاحب هذه الخلوة فإنه ما ثم جملة واحدة ولهذا تمم تعالى في التعريف فقال أَ ولَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلى‏ كُلِّ شَيْ‏ءٍ من أعيان العالم شَهِيدٌ على التجلي فيه والظهور وليس في قوة العالم أن يدفع عن نفسه هذا الظاهر فيه ولا أن لا يكون مظهرا وهو المعبر عنه بالإمكان فلو لم يكن حقيقة العالم الإمكان لما قبل النور وهو ظهور الحق فيه الذي تبين له بالآيات‏\n\n\n### [الإحاطة بالشي‏ء تستر الشي‏ء فيكون الظاهر هو المحيط لا الشي‏ء المحاط]\n\n\nثم تمم وقال إِنَّهُ بِكُلِّ شَيْ‏ءٍ من العالم مُحِيطٌ والإحاطة بالشي‏ء تستر ذلك الشي‏ء فيكون الظاهر المحيط لا ذلك الشي‏ء فإن الإحاطة به تمنع من ظهوره فصار ذلك الشي‏ء وهو العالم في المحيط كالروح للجسم والمحيط كالجسم للروح الواحد شهادة وهو المحيط الظاهر والآخر غيب وهو المستور بهذه الإحاطة وهو عين العالم ولما كان الحكم للموصوف بالغيب في الظاهر الذي هو الشهادة وكانت أعيان شيئيات العالم على استعدادات في أنفسها حكمت على الظاهر فيها بما تعطيه حقائقها فظهرت صورها في المحيط وهو الحق فقيل عرش وكرسي وأفلاك وأملاك وعناصر ومولدات وأحوال تعرض وما ثم إلا الله فالحق من كونه محيطا كبيت الخلوة لصاحب الخلوة فيطلب صاحب الخلوة فلا يوجد فإن البيت يحجبه فلا يعرف منه إلا مكانه ومكانه يدل على مكانته‏\n\n\n### [خلوة العارفين وخلوة الشرعيين‏]\n\n\nفقد أعطيتك مرتبة الخلوة التي نريد في هذا الكتاب لا الخلوة المعهودة عند أصحاب الخلوات ودرجاتها ألف وسبع وستون درجة فظهر في الدرجات صورة الوترية وإذا لم يعمر الخلأ إلا العالم فهو في خلوة بنفسه هذا أصله ثم إنه لما انصبغ بالنور كان في خلوة بربه وبقي في تلك الخلوة إلى الأبد لا يتقيد بالزمان لا بأربعين يوما ولا بغير ذلك فالعارف إذا عرف ما ذكرناه عرف أنه في خلوة بربه لا بنفسه ومع ربه لا مع نفسه فيرى من حيث أثره في المحيط به بالصور التي ظهر بها المحيط نفسه بنفسه ومن حيث تعدد أعيانه رأى منه به وكانت كل عين مغايرة لصاحبتها\n\n\n### [كثرة العالم ووحدته وكثرة الإنسان ووحدته وقيام العالم بالحق والحق بالعالم‏]\n\n\nولذلك اختلفت صور العالم وإن كان واحدا كما اختلفت صورة الإنسان في نفسه وإن كان الإنسان واحدا فيده ما هي رجله ورأسه ما هو صدره وعينه ما هو أذنه ولا لسانه ولا فرجه وعقله ما هو فكره ولا خياله فهو متنوع متعدد العين بالصور المحسوسة والمعنوية ومع هذا يقال فيه إنه واحد ويصدق ويقال فيه كثير ويصدق فمن حيث أحديته نقول رأى نفسه بنفسه ومن حيث كثرته نقول رأى بعضه ببعضه فتكلم بلسانه وبطش بيده وسعى برجله واستنشق بأنفه وسمع بإذنه ونظر بعينه وتخيل بخياله وعقل بعقله فهذا كثير وما ثم إلا هو فمن حصل له هذا العلم كما قررناه كان صاحب خلوة ومن حرمه فليس بصاحب خلوة فقد تبين لك أن الحق بالعالم والعالم بالحق فهويته عين المجموع كما إن المجموع هو الإنسان بغيبه وشهادته ونطقه وحيوانيته فهو واحد في الكثرة وكثير في الأحدية\n\n\n### [الخلوة التي هي مقام والتي ليست بمقام وعند أهل الكشف‏]\n\n\nفالخلوة من المقامات المستصحبة دنيا وآخرة إلى الأبد من حصلت له لا تزول فإنه لا أثر بعد عين وأما الخلوة المعروفة المعهودة فليست مقاما ولا تصح إلا لمحجوب وأما أهل الكشف فلا تصح لهم خلوة أبدا فإنهم يشاهدون الأرواح العلوية والأرواح النارية ويرون الكائنات ناطقة أكوان ذاته وأكوان بيت خلوته فهو في ملأ كما هو في نفس الأمر فإذا أخذ الله عن بصره هذه المدركات وفصل بين الحيوان والجماد والملائكة وعالم الصمت من عالم الكلام وعالم السكون من عالم الحركات ويحب أن يخلو بربه حتى لا يشغله عنه نطق كون ولا حركة كون فمنهم من يطلب الخلوة لمزيد علم بالله من الله لا من نظره وفكره وهذا أتم المقاصد فإنه مأمور بذلك والعمل على الأمر الإلهي هو غاية كمال العمل والله يقول له قُلْ رَبِّ زِدْنِي عِلْماً\n\n\n### [من تحدث في خلوته في نفسه مع كون من الأكوان فما هو في خلوة]\n\n\nفمن تحدث في خلوته في نفسه مع كون من الأكوان فما هو في خلوة قال بعضهم لصاحب خلوة اذكرني عند ربك في خلوتك فقال له إذا ذكرتك فلست معه في خلوة ومن هنا تعرف‏\n\n\nقوله تعالى أنا جليس من ذكرني‏\n\n\nفإنه لا يذكره حتى يحضر المذكور في نفسه إن كان المذكور ذا صورة في اعتقاده أحضره في خياله وإن كان من غير عالم الصور أو لا صورة له أحضرته القوة الذاكرة فإن القوة الذاكرة من الإنسان تضبط المعاني والقوة المتخيلة تضبط المثل التي أعطتها الحواس أو ما تركبه‏\nالقوة المصورة من الأشكال الغريبة التي استفادت جزئياتها من الحس لا بد من ذلك ليس لها تصرف إلا به‏\n\n\n### [الذكر الخيالى والذكر المعنوي الذي هو ذكر القلب‏]\n\n\nفمن شرط الخلوة في هذا الطريق الذكر النفسي لا الذكر اللفظي فأول خلوته الذكر الخيالي وهو تصور لفظة الذكر من كونه مركبا من حروف رقمية ولفظية يمسكها الخيال سمعا أو رؤية فيذكر بها من غير أن يرتقي إلى الذكر المعنوي الذي لا صورة له وهو ذكر القلب ومن الذكر القلبي ينقدح له المطلوب والزيادة من العلوم وبذلك العلم الذي انقدح له يعرف ما المراد بصور المثل إذا أقيمت له وأنشأها الحس في خياله في نوم ويقظة وغيبة وفناء فيعلم ما رأى وهو علم التعبير للرؤيا\n\n\n### [مقاصد الخلوة عند أهل الخلوة]\n\n\nومنهم من يأخذ الخلوة لصفاء الفكر ليكون صحيح النظر فيما يطلبه من العلم وهذا لا يكون إلا للذين يأخذون العلم من أفكارهم فهم يتخذون الخلوات لتصحيح ما يطلبونه إذا ظهر لهم بالموازين المنطقية وهو ميزان لطيف أدنى هواء يحركه فيخرجه عن الاستقامة فيتخذون الخلوات ويسدون مجاري الأهواء لئلا تؤثر في الميزان حركة تفسد عليهم صحة المطلوب ومثل هذه الخلوة لا يدخلها أهل الله وإنما لهم الخلوة بالذكر ليس للفكر عليهم سلطان ولا له فيهم أثر وأي صاحب خلوة استنكحه الفكر في خلوته فليخرج ويعلم أنه لا يراد لها وأنه ليس من أهل العلم الإلهي الصحيح إذ لو أراده الله لعلم الفيض الإلهي لحال بينه وبين الفكر ومنهم من يأخذ الخلوة لما غلب عليه من وحشة الأنس بالخلق فيجد انقباضا في نفسه برؤية الخلق حتى أهل بيته حتى أنه ليجد وحشة الحركة فيطلب السكون فيؤديه ذلك إلى اتخاذ الخلوة ومنهم من يتخذ الخلوة لاستحلاء ما يجد فيها من الالتذاذ وهذه كلها أمور معلولة لا تعطي مقاما ولا رتبة وصاحب الخلوة لا ينتظر واردا ولا صورة ولا شهودا وإنما يطلب علما بربه فوقتا يعطيه ذلك في غير مادة ووقتا يعطيه ذلك في مادة ويعطيه العلم بمدلول تلك المادة\n\n\n### [الخلوة التي هي نسبة والخلوة التي هي المقام‏]\n\n\nالخلوة لها الدعوى وصاحبها مسئول لها الحجاب الأقرب هي نسبة ما هي مقام أعني الخلوة المعهودة عند القوم لا الخلوة التي هي مقام التي ذكرناها في أول الباب وهذه وإن لم تكن مقاما فإنها تحصل لصاحبها بالذكر مقامات لها إحاطة بالملك والملكوت والجبروت عند العارفين والملامية من الأدباء أرباب المواقف وأما أهل الوصال والأنس من العارفين والملامية فلا يرون لها في الملكوت دخولا وأنها مخصوصة بعالم الجبروت والملك لا غير إلا أنها لها قرب من الملكوت ما بينها وبينه إلا درجتان فالأدباء الواقفون من الملامية يرون لها ستمائة درجة وإحدى وأربعون درجة والعارفون من أهل الأنس يرون لها ألف درجة وسبعا وستين درجة والأدباء من العارفين الواقفين يرون لها ستمائة درجة وسبعا وستين درجة والملامية من أهل الأنس والوصال يرون لها ألف درجة وستة وثلاثين درجة\n\n",
    "en": "Chapter Seventy-Eight: Concerning the Knowledge of Spiritual Retreat (الخلوة)\n\nI secluded myself with the One I love, and there was none other than us;\nHad there been other than me, its existence would not have been sound.\n\nWhen my soul fulfills the conditions of its solitude,\nThen the souls of all creation are entirely its servants.\n\nAnd if there were nothing in itself but itself,\nIt would bestow it generously upon the one who perfects it.\n\n### [The Legal/Scriptural Origin of Retreat]\n\nKnow—may Allah grant us and you success—that the origin of the spiritual retreat (الخلوة) in the Sacred Law (الشرع) is: \"He who remembers Me in himself, I remember him in Myself; and he who remembers Me in an assembly, I remember him in an assembly better than it.\"\n\nThis is an authentic Divine Hadith (حديث إلهي) that encompasses both seclusion (الخلوة) and public manifestation (الجلوة). The origin of the retreat (الخلوة) stems from the Void (الخلأ) in which the Cosmos (العالم) was found.\n\nHe who is empty [in retreat] yet finds nothing, has not truly emptied himself;\nThis is a path whose ruling is the ruling of affliction.\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"Allah was, and there was nothing with Him.\"\n\nThe Messenger of Allah (peace and blessings be upon him) was asked: \"Where was our Lord before He created His creation?\" He replied: \"He was in a Cloud ('Amā'), with no air above it and no air below it.\"\n\nThen He created the creation, decreed the decree, and finished certain things. He is, every day, engaged in a matter (في شأن). He will finish certain things, and then He will populate the stations (المنازل) with their inhabitants forever.\n\n### [Retreat is the Highest of Stations and the Dwelling the Human Populates]\n\nSpiritual retreat (الخلوة) is the highest of the spiritual stations (المقامات). It is the dwelling that the human being populates and fills with his Essence (ذاته), so that nothing other than Him can be contained within it alongside him. That is the retreat (الخلوة). Its relation to him, and his relation to it, is the relation of the Real (الحق) to the heart of the servant, which encompasses Him, yet nothing other than Him enters it, by any of the cosmic aspects (الوجوه الكونية). Thus, the heart is empty of all created things (الأكوان), and the Real manifests therein by His Essence (بذاته). The relation of the heart to the Real is that it must be upon His Form, so that nothing other than Him is contained within it.\n\n### [The Cosmic Origin of Retreat]\n\nThe cosmic origin of the retreat (الخلوة) in the Cosmos (العالم) is the Void (الخلأ) that the Cosmos filled. The first thing that filled it was the Primary Matter (الهباء), which is a dark substance (جوهر مظلم) that filled the Void by its Essence (بذاته). Then the Real (الحق) disclosed Himself (تجلى) to it by His Name, The Light (النور). That substance was thereby dyed, and the ruling of darkness—which is non-existence (العدم)—was removed from it. It was then characterized by Existence (الوجود). It appeared to itself by that dyed Light, and its appearance thereby was upon the Form of the Human. For this reason, the People of Allah (أهل الله) call it the Great Human (الإنسان الكبير), and its summary is called the Small Human (الإنسان الصغير), because it is an existent being in which Allah deposited all the realities (حقائق) of the Great Cosmos (العالم الكبير). Thus, it emerged upon the form of the Cosmos despite the smallness of its body, and the Cosmos is upon the form of the Real. Therefore, the human is upon the form of the Real, which is His saying: \"Indeed, Allah created Adam upon His Form.\"\n\nSince the matter is as we have established, Allah the Exalted said: <<لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ>> (The creation of the heavens and the earth is greater than the creation of mankind, but most of mankind do not know). However, the few among mankind know.\n\n### [The Human is a Small Cosmos, the Cosmos is a Great Human, and the Perfect Human is the Concise One]\n\nThus, the human is a small cosmos (عالم صغير), and the Cosmos is a great human (إنسان كبير). Then, the forms of shapes opened up within the Cosmos: the celestial spheres (الأفلاك), the elements (العناصر), and the generated beings (المولدات). The human was the last generated being (مولد) in the Cosmos, whom Allah brought into existence as a comprehensive synthesis of the realities of the entire Cosmos. He made him a vicegerent (خليفة) within it and granted him the power of every form existing in the Cosmos. That substance of Primary Matter (الجوهر الهبائي) dyed by the Light is the Simple (البسيط). The manifestation of the forms of the Cosmos within it is the Intermediate (الوسيط). And the Perfect Human (الإنسان الكامل) is the Concise One (الوجيز). Allah the Exalted said: <<سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ>> (We will show them Our signs in the horizons and within themselves), so that they may know that the human is a concise cosmos (عالم وجيز) derived from the Cosmos, containing the signs (الآيات) that are in the Cosmos.\n\n### [The First Thing Revealed to the Practitioner of Retreat is the Signs of the Cosmos before the Signs of Himself]\n\nThe first thing revealed to the practitioner of spiritual retreat (صاحب الخلوة) are the signs (آيات) of the Cosmos before the signs of himself, because the Cosmos preceded him, as Allah the Exalted said: <<سَنُرِيهِمْ آياتِنا في الْآفاقِ>> (We will show them Our signs in the horizons).\n\nThen, after this, He shows him the signs that he observed in the Cosmos within himself. If he had seen them first within himself and then seen them in the Cosmos, he might have imagined that his self saw itself in the Cosmos. So, Allah removed this ambiguity from him by presenting the vision of the signs in the Cosmos first, just as it occurred in Existence (الوجود), for it is prior to the human. How could it not be prior when it is his father? The vision of those signs in the horizons (الآفاق) and within himself made it clear to him that He is the Real (الحق) and none other, and this became manifest to him.\n\n### [Allah's Signs in the Horizons and the Selves are Indications that He is the Manifest in the Manifestations]\n\nThe signs (الآيات) are the indications (الدلالات) to him that He is the Real (الحق), the Manifest (الظاهر) in the manifestations (مظاهر) of the fixed entities (أعيان) of the Cosmos. The practitioner of this retreat (الخلوة) does not seek anything else, for there is only one totality (جملة واحدة). For this reason, the Exalted completed the definition by saying: <<أَ ولَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلى‏ كُلِّ شَيْ‏ءٍ>> (Is it not sufficient concerning your Lord that He is, over every thing)—meaning, of the fixed entities of the Cosmos—<<شَهِيدٌ>> (A Witness), regarding the Theophany (التجلي) within it and the manifestation. It is not within the power of the Cosmos to repel this Manifest One within it, nor to cease being a manifestation (مظهر). This is what is expressed by contingency (الإمكان). If the reality of the Cosmos were not contingency, it would not have accepted the Light, which is the manifestation of the Real within it, made clear to him by the signs.\n\n### [Encompassing a Thing Conceals the Thing, so the Manifest is the Encompasser, not the Encompassed Thing]\n\nThen He completed it by saying: <<إِنَّهُ بِكُلِّ شَيْ‏ءٍ>> (Indeed, He is, over every thing)—of the Cosmos—<<مُحِيطٌ>> (Encompassing). Encompassing a thing conceals that thing, so the Manifest (الظاهر) is the Encompasser (المحيط), not the encompassed thing. For the encompassing prevents its manifestation. Thus, that thing, which is the Cosmos, became in the Encompasser like the spirit (الروح) is to the body. The Encompasser is like the body for the spirit. One is witnessing (شهادة), which is the Manifest Encompasser, and the other is the Unseen (غيب), which is concealed by this encompassing, and that is the very essence (عين) of the Cosmos. Since the ruling belongs to the one described by the Unseen (الغيب) in the Manifest (الظاهر)—which is the witnessing (الشهادة)—and since the fixed entities (أعيان) of the things of the Cosmos possess inherent predispositions (استعدادات), they impose their ruling upon the Manifest within them according to what their realities (حقائقها) dictate. Thus, their forms appeared in the Encompasser, who is the Real (الحق). So, it was said: Throne ('Arsh), Footstool (Kursī), celestial spheres (أفلاك), angels (أملاك), elements (عناصر), generated beings (مولدات), and transient states (أحوال تعرض). Yet, there is nothing there but Allah. The Real, by virtue of His being the Encompasser (محيط), is like the house of retreat (بيت الخلوة) for the practitioner of retreat. The practitioner of retreat is sought but not found, for the house screens him. Nothing is known of him except his location, and his location indicates his station (مكانته).\n\n### [The Retreat of the Gnostics and the Retreat of the Legalists]\n\nI have thus given you the degree (مرتبة) of the spiritual retreat (الخلوة) that we intend in this book, not the retreat commonly known among the practitioners of seclusion (أصحاب الخلوات). Its degrees (درجاتها) number one thousand and sixty-seven. Thus, the image of oddness (الوترية) appeared in the degrees. If the Void (الخلأ) is populated only by the Cosmos, then it is in retreat with itself—this is its origin. Then, when it was dyed by the Light, it was in retreat with its Lord. It remains in that retreat forever, not restricted by time, neither by forty days nor by anything else. The Gnostic ('Ārif), when he knows what we have mentioned, knows that he is in retreat with his Lord, not with himself, and alongside his Lord, not alongside himself. He sees from the perspective of his effect in the Encompasser (المحيط به) through the forms by which the Encompasser manifested Himself by Himself. And from the perspective of the multiplicity of His fixed entities (أعيانه), he saw Him through them, and every entity was distinct from its companion.\n\n### [The Multiplicity and Unity of the Cosmos, the Multiplicity and Unity of the Human, and the Subsistence of the Cosmos by the Real and the Real by the Cosmos]\n\nFor this reason, the forms of the Cosmos differ, even though it is one, just as the form of the human differs within himself, even though the human is one. His hand is not his leg, his head is not his chest, his eye is not his ear, nor his tongue, nor his private parts, and his intellect ('aql) is not his thought (fikr) nor his imagination (خيال). Thus, he is diverse and multiple in entity (العين) through sensible and intelligible forms. Despite this, he is called one, and this is true; and he is called many, and this is true. From the perspective of His Oneness (أحديته), we say He saw Himself by Himself. From the perspective of His Multiplicity (كثرته), we say He saw some of Himself by some of Himself. So, He spoke with His tongue, struck with His hand, walked with His leg, inhaled with His nose, heard with His ear, saw with His eye, imagined with His imagination (خيال), and intellectualized with His intellect ('aql). This is multiplicity, yet there is nothing there but Him. Whoever attains this Knowledge ('Ilm) as we have established it is a practitioner of retreat (صاحب خلوة). Whoever is deprived of it is not a practitioner of retreat. It has thus become clear to you that the Real (الحق) subsists by the Cosmos (العالم), and the Cosmos subsists by the Real. His Ipseity (هويته) is the very essence (عين) of the totality, just as the totality is the human, with his unseen and his witnessed aspects, his speaking and his animality. Thus, he is one in multiplicity and multiple in oneness (أحدية).\n\n### [The Retreat that is a Station and the Retreat that is not a Station, According to the People of Unveiling]\n\nThe spiritual retreat (الخلوة) is among the stations (المقامات) that are maintained in this world and the Hereafter forever for the one who attains it; it does not cease, for there is no effect after the entity (عين). As for the well-known, common retreat, it is not a station (مقام) and is only valid for the veiled (محجوب). As for the People of Unveiling (أهل الكشف), retreat is never valid for them, for they witness the celestial spirits (الأرواح العلوية) and the fiery spirits (الأرواح النارية). They see created things speaking—the created things of His Essence (أكوان ذاته) and the created things of His house of retreat. Thus, he is in an assembly (ملأ), just as he is in reality (نفس الأمر). If Allah removes these perceptions from his sight and separates the animate from the inanimate, the angels, the world of silence from the world of speech, and the world of stillness from the world of movements, he desires to be in retreat with his Lord so that the speech of a created thing or the movement of a created thing does not distract him from Him. Among them are those who seek retreat for an increase in Knowledge ('Ilm) of Allah, derived from Allah, not from their own contemplation (نظر) or thought (فكر). This is the most complete of intentions, for he is commanded to do so, and acting upon the Divine Command is the ultimate perfection of action. Allah says to him: <<قُلْ رَبِّ زِدْنِي عِلْماً>> (Say: My Lord, increase me in knowledge).\n\n### [He who speaks in his retreat within himself with any created thing is not in retreat]\n\nHe who speaks in his retreat within himself with any created thing (كون من الأكوان) is not in retreat. One of them said to a practitioner of retreat: \"Remember me to your Lord in your retreat.\" He replied: \"If I remember you, I am not with Him in retreat.\" From this, you understand His saying, the Exalted: \"I am the companion (jalis) of him who remembers Me.\"\n\nFor he does not remember Him until the One remembered is present in his self. If the One remembered has a form in his belief, he makes Him present in his imagination (خيال). If He is not from the world of forms or has no form, the faculty of memory (القوة الذاكرة) makes Him present. For the faculty of memory in the human controls meanings, and the imaginative faculty (القوة المتخيلة) controls the similitudes (المثل) that the senses have provided or what the formative faculty (القوة المصورة) composes from strange shapes whose particulars it gained from the sense perception. This is necessary; it has no action except through this.\n\n### [Imaginal Remembrance and Meaning-based Remembrance, which is the Remembrance of the Heart]\n\nA condition of retreat (الخلوة) on this path is internal remembrance (الذكر النفسي), not verbal remembrance (الذكر اللفظي). The beginning of his retreat is imaginal remembrance (الذكر الخيالي), which is the visualization of the word of remembrance as being composed of numerical and verbal letters, which the imagination (الخيال) holds, either audibly or visually. He remembers by it without ascending to the meaning-based remembrance (الذكر المعنوي) which has no form, and which is the remembrance of the heart (ذكر القلب). From the remembrance of the heart, the desired object and the increase in knowledge (العلوم) are sparked for him. By that knowledge which is sparked, he knows what is intended by the forms of similitudes (صور المثل) when they are established for him and created by the sense perception in his imagination (خيال), whether in sleep, wakefulness, absence, or annihilation (فناء). Thus, he knows what he saw, and this is the science of interpreting visions (علم التعبير للرؤيا).\n\n### [The Objectives of Retreat According to the People of Retreat]\n\nAmong them are those who undertake retreat for the purity of thought (صفاء الفكر), so that their contemplation (نظر) concerning the knowledge they seek is sound. This only occurs for those who derive knowledge from their thoughts (أفكارهم). They adopt retreats to correct what they seek when it appears to them through logical balances (الموازين المنطقية), which is a subtle balance that the slightest breath of air moves, taking it out of equilibrium. So, they adopt retreats and block the channels of passions (الأهواء) lest they affect the balance with a movement that corrupts the soundness of the desired object. The People of Allah (أهل الله) do not enter into this kind of retreat. Their retreat is only through remembrance (الذكر); thought (الفكر) has no dominion over them, nor any effect within them. Any practitioner of retreat whose thought dominates him in his retreat should leave and know that he is not intended for it, and that he is not among the people of sound Divine Knowledge (العلم الإلهي الصحيح). For if Allah had intended him, He would have taught him the Divine Effusion (الفيض الإلهي) and intervened between him and thought. Among them are those who undertake retreat due to the overwhelming sense of alienation (وحشة) from familiarity with creation (الأنس بالخلق). They find contraction (انقباضا) in their soul upon seeing creation, even their own family, to the extent that they feel alienation from movement and seek stillness. This leads them to adopt retreat. Among them are those who adopt retreat for the sweetness of the pleasure (الالتذاذ) they find therein. All these are defective matters (أمور معلولة) that grant neither a station (مقام) nor a degree (رتبة). The practitioner of retreat does not await an incoming spiritual state (وارد), nor a form, nor witnessing (شهود). Rather, he seeks knowledge ('ilm) of his Lord. Sometimes He grants him that without material means (في غير مادة), and sometimes He grants him that through material means (في مادة) and grants him the knowledge of the meaning of that material means.\n\n### [The Retreat that is a Relation and the Retreat that is the Station]\n\nThe retreat (الخلوة) has a claim, and its practitioner is responsible for it. The nearest veil (الحجاب الأقرب) is a relation (نسبة); it is not a station (مقام)—I mean the retreat commonly known among the folk, not the retreat that is a station (مقام) which we mentioned at the beginning of the chapter. Although this [common retreat] is not a station, through remembrance (الذكر) it brings its practitioner to stations (مقامات) that encompass the Dominion (الملك), the Kingdom (الملكوت), and the Realm of Power (الجبروت) according to the Gnostics ('Ārifīn) and the Malamatiyya (الملامية) among the refined people (الأدباء), the masters of the spiritual halts (أرباب المواقف). As for the People of Union (الوصال) and Intimacy (الأنس) among the Gnostics and the Malamatiyya, they do not see its entry into the Kingdom (الملكوت), believing that it is restricted only to the Realm of Power (الجبروت) and the Dominion (الملك). However, it has a proximity to the Kingdom (الملكوت), with only two degrees separating them. The refined people (الأدباء) who stand at the halts (الواقفون من الملامية) see for it six hundred and forty-one degrees. The Gnostics (العارفون) among the People of Intimacy (أهل الأنس) see for it one thousand and sixty-seven degrees. The refined Gnostics who stand at the halts (الأدباء من العارفين الواقفين) see for it six hundred and sixty-seven degrees. And the Malamatiyya among the People of Intimacy and Union (أهل الأنس والوصال) see for it one thousand and thirty-six degrees.",
    "ur": "(باب نمبر اٹھتر: خلوت (تنہائی) کی معرفت میں)\n\nمیں نے اپنے محبوب کے ساتھ خلوت کی، تو ہمارے سوا کوئی نہ تھا\nاور اگر میرے سوا کوئی اور ہوتا تو اس کا وجود درست نہ ہوتا۔\nجب میرا نفس اپنی انفرادیت کی شرائط کو مضبوط کر لیتا ہے،\nتو تمام مخلوقات کے نفوس اس کے غلام ہوتے ہیں۔\nاور اگر اس (نفس) میں اس کے اپنے سوا کچھ نہ ہوتا،\nتو وہ اس شخص پر سخاوت کرتا جو اسے بہتر بناتا ہے۔\n\n### [خلوت کی شرعی بنیاد]\n\nجان لو، اللہ ہمیں اور تمہیں توفیق دے، کہ خلوت کی اصل شریعت میں ہے۔\n(حدیث قدسی):\n\"مَنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَمَنْ ذَكَرَنِي فِي مَلَأٍ ذَكَرْتُهُ فِي مَلَأٍ خَيْرٍ مِنْهُ\"\n\"جس نے مجھے اپنے نفس میں یاد کیا، میں نے اسے اپنے نفس میں یاد کیا، اور جس نے مجھے کسی جماعت میں یاد کیا، میں نے اسے اس سے بہتر جماعت میں یاد کیا۔\"\nیہ ایک صحیح حدیث الٰہی ہے جو خلوت اور جلوت (ظہور) دونوں پر مشتمل ہے۔ اور خلوت کی اصل اس خلا (الخلأ) سے ہے جس میں عالم (کائنات) کو وجود ملا۔\n\nپس جس نے خلوت اختیار کی اور (حق کو) نہ پایا، تو اس نے خلوت اختیار نہیں کی،\nیہ وہ راستہ ہے جس کا حکم آزمائش (البلا) کا حکم ہے۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n\"كَانَ اللَّهُ وَلَا شَيْ‏ءَ مَعَهُ\"\n\"اللہ تھا اور اس کے ساتھ کوئی شے نہ تھی۔\"\nاور رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا: \"ہمارا رب اپنی مخلوق کو پیدا کرنے سے پہلے کہاں تھا؟\" آپ نے فرمایا:\n\"كَانَ فِي عَمَاءٍ مَا فَوْقَهُ هَوَاءٌ وَمَا تَحْتَهُ هَوَاءٌ\"\n\"وہ ایک غیب (عماء) میں تھا، جس کے اوپر کوئی ہوا نہ تھی اور جس کے نیچے کوئی ہوا نہ تھی۔\"\nپھر اس نے مخلوق کو پیدا کیا اور فیصلہ (القضیۃ) صادر فرمایا اور کئی چیزوں سے فارغ ہوا، اور وہ ہر دن ایک نئی شان میں ہے (كُلَّ يَوْمٍ فِي شَأْنٍ)، اور وہ کئی چیزوں سے فارغ ہو گا، پھر وہ ہمیشہ کے لیے منازل کو ان کے اہل سے آباد کرے گا۔\n\n### [خلوت اعلیٰ ترین مقامات میں سے ہے اور وہ منزل ہے جسے انسان آباد کرتا ہے]\n\nخلوت اعلیٰ ترین مقامات میں سے ہے اور وہ منزل ہے جسے انسان آباد کرتا ہے اور اسے اپنی ذات سے بھر دیتا ہے، چنانچہ اس میں اس کے ساتھ کوئی دوسرا سما نہیں سکتا۔ یہی وہ خلوت ہے، اور اس کی نسبت انسان کی طرف اور انسان کی نسبت اس کی طرف، ذات حق (الحق) کی نسبت اس بندے کے قلب کی طرف ہے جو اسے اپنے اندر سمو لیتا ہے، اور اس میں کوئی دوسری کونی (کائناتی) شے کسی بھی صورت میں داخل نہیں ہوتی۔ پس وہ تمام اکوان (الأكوان) سے خالی ہو جاتا ہے، تو ذات حق (الحق) اس میں اپنی ذات کے ساتھ ظاہر ہوتی ہے۔ اور قلب کی نسبت ذات حق (الحق) کی طرف یہ ہے کہ وہ اس کی صورت پر ہو، پس اس میں اس کے سوا کوئی نہ سمائے۔\n\n### [خلوت کی کونیاتی بنیاد]\n\nعالم (کائنات) میں خلوت کی اصل وہ خلا (الخلأ) ہے جسے عالم نے بھر دیا۔ پس سب سے پہلی شے جس نے اسے بھرا وہ ہباء (الہباء) ہے، اور یہ ایک تاریک جوہر ہے جس نے خلا کو اپنی ذات سے بھر دیا۔ پھر ذات حق (الحق) نے اپنے نام النور (روشنی) کے ساتھ اس پر تجلی (التجلی) فرمائی، تو وہ جوہر اس سے رنگین ہو گیا اور اس سے ظلمت (تاریکی) کا حکم، جو کہ عدم (نہ ہونا) ہے، زائل ہو گیا۔ پس وہ وجود (الوجود) سے متصف ہو گیا، اور اس رنگین نور کے ذریعے وہ اپنے لیے ظاہر ہوا۔ اور اس کا ظہور اس نور کے ذریعے انسان کی صورت پر ہوا، اور اسی وجہ سے اہل اللہ اسے انسان کبیر (الإنسان الكبير) کہتے ہیں، اور اس کے مختصر کو انسان صغیر (الإنسان الصغير) کہا جاتا ہے، کیونکہ یہ موجود ہے اور اللہ نے اس میں تمام عالم کبیر کی حقائق کو ودیعت کر دیا ہے۔ پس یہ اپنے چھوٹے حجم کے باوجود عالم کی صورت پر ظاہر ہوا، اور عالم ذات حق (الحق) کی صورت پر ہے، لہٰذا انسان ذات حق (الحق) کی صورت پر ہے۔ اور یہی اس کا قول ہے: \"إِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ\" (بیشک اللہ نے آدم کو اپنی صورت پر پیدا کیا۔)\nاور جب معاملہ اسی طرح تھا جیسا کہ ہم نے بیان کیا، اسی لیے اللہ تعالیٰ نے فرمایا:\n\"لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ\" (یقیناً آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے، لیکن اکثر لوگ نہیں جانتے۔)\nلیکن لوگوں میں سے صرف قلیل ہی جانتے ہیں۔\n\n### [انسان عالم صغیر ہے اور عالم انسان کبیر ہے اور انسان کامل وجیز ہے]\n\nپس انسان عالم صغیر (چھوٹی کائنات) ہے اور عالم انسان کبیر (بڑا انسان) ہے۔ پھر عالم میں افلاک، عناصر اور مولدات (پیدا ہونے والی چیزوں) کی اشکال کی صورتیں کھل گئیں۔ پس انسان عالم میں آخری مولود تھا جسے اللہ نے تمام عالم کی حقائق کو جمع کرنے والا بنا کر وجود بخشا اور اسے اس میں خلیفہ بنایا۔ پس اسے عالم میں موجود ہر صورت کی قوت عطا کی۔ پس وہ جوہر ہبائی جو نور سے رنگین ہوا، وہ بسیط (سادہ) ہے، اور اس میں عالم کی صورتوں کا ظہور وسیط (درمیانی) ہے، اور انسان کامل (الإنسان الكامل) وجیز (مختصر) ہے۔ اللہ تعالیٰ فرماتا ہے:\n\"سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ\" (عنقریب ہم انہیں اپنی نشانیاں آفاق (اطراف) میں اور ان کے اپنے نفوس (ذاتوں) میں دکھائیں گے۔)\nتاکہ وہ جان لیں کہ انسان عالم کا ایک مختصر عالم ہے جو ان نشانیوں کو اپنے اندر رکھتا ہے جو عالم میں ہیں۔\n\n### [خلوت والے کے لیے سب سے پہلے عالم کی نشانیاں منکشف ہوتی ہیں، اس کے اپنے نفس کی نشانیوں سے پہلے]\n\nپس خلوت والے کے لیے سب سے پہلے عالم کی نشانیاں منکشف ہوتی ہیں، اس کے اپنے نفس کی نشانیوں سے پہلے، کیونکہ عالم اس سے پہلے موجود ہے۔ جیسا کہ اللہ تعالیٰ نے فرمایا:\n\"سَنُرِيهِمْ آياتِنا في الْآفاقِ\" (عنقریب ہم انہیں اپنی نشانیاں آفاق میں دکھائیں گے۔)\nپھر اس کے بعد وہ اسے وہ نشانیاں دکھاتا ہے جو اس نے عالم میں دیکھی تھیں، اس کے اپنے نفس میں۔ اگر وہ انہیں پہلے اپنے نفس میں دیکھتا اور پھر عالم میں دیکھتا، تو شاید وہ یہ گمان کرتا کہ اس کے نفس نے عالم میں دیکھا ہے۔ پس اللہ نے اس اشکال کو اس سے دور کر دیا کہ اس نے اسے عالم میں نشانیوں کا مشاہدہ پہلے کرایا، جیسا کہ وجود میں واقع ہوا، کیونکہ وہ انسان سے قدیم تر ہے، اور وہ قدیم تر کیوں نہ ہو جبکہ وہ اس کا باپ ہے۔ پس آفاق (اطراف) اور اس کے اپنے نفس میں ان نشانیوں کے مشاہدے نے اس پر واضح کر دیا کہ وہ ذات حق (الحق) ہے، کوئی اور نہیں۔ اور یہ بات اس پر واضح ہو گئی۔\n\n### [آفاق اور انفس میں اللہ کی نشانیاں اس بات کی دلیل ہیں کہ وہ مظاہر میں ظاہر ہے]\n\nپس نشانیاں (الآیات) اس کے لیے اس بات کی دلیلیں ہیں کہ وہ ذات حق (الحق) ہے جو عالم کے اعیان (حقیقتوں) کے مظاہر میں ظاہر ہے۔ پس اس خلوت کا مالک کسی اور چیز کا طالب نہیں ہوتا، کیونکہ وہاں کوئی ایک مجموعہ نہیں ہے۔ اور اسی لیے اللہ تعالیٰ نے تعریف کو مکمل کرتے ہوئے فرمایا:\n\"أَ وَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلى‏ كُلِّ شَيْ‏ءٍ\" (کیا تمہارے رب کا کافی ہونا یہ نہیں کہ وہ ہر شے پر)\nیعنی عالم کے اعیان میں سے ہر شے پر \"شَهِيدٌ\" (گواہ) ہے، اس میں تجلی (التجلی) اور ظہور کے اعتبار سے۔ اور عالم کی قوت میں یہ نہیں ہے کہ وہ اس ظاہر ہونے والے کو اپنے سے دور کر دے، اور نہ ہی یہ کہ وہ مظہر نہ ہو، اور اسی کو امکان (ممکن ہونا) سے تعبیر کیا جاتا ہے۔ اگر عالم کی حقیقت امکان نہ ہوتی، تو وہ نور کو قبول نہ کرتا، جو کہ اس میں ذات حق (الحق) کا ظہور ہے، جو اسے نشانیوں کے ذریعے واضح ہوا۔\n\n### [کسی شے کا احاطہ کرنا اس شے کو چھپا دیتا ہے، پس ظاہر ہونے والا محیط (گھیرنے والا) ہوتا ہے نہ کہ وہ شے جس کا احاطہ کیا گیا]\n\nپھر اس نے تکمیل کرتے ہوئے فرمایا:\n\"إِنَّهُ بِكُلِّ شَيْ‏ءٍ\" (بیشک وہ ہر شے کا)\nیعنی عالم کی ہر شے کا \"مُحِيطٌ\" (احاطہ کرنے والا) ہے۔ اور کسی شے کا احاطہ کرنا اس شے کو چھپا دیتا ہے، پس ظاہر ہونے والا محیط (گھیرنے والا) ہوتا ہے نہ کہ وہ شے جس کا احاطہ کیا گیا، کیونکہ اس کا احاطہ اس کے ظہور کو روکتا ہے۔ پس وہ شے، یعنی عالم، محیط میں روح کی طرح ہو گیا جسم کے لیے، اور محیط جسم کی طرح ہو گیا روح کے لیے۔ ایک شہادت (ظاہر) ہے، اور وہ محیط ظاہر ہے، اور دوسرا غیب ہے، اور وہ اس احاطے سے مستور (چھپا ہوا) ہے، اور وہ عین عالم ہے۔ اور چونکہ حکم غیب سے موصوف کے لیے تھا ظاہر میں جو کہ شہادت ہے، اور عالم کی شیئیتوں کے اعیان اپنی ذاتوں میں استعدادات پر تھے، انہوں نے اس ظاہر ہونے والے پر اس چیز کا حکم لگایا جو ان کی حقائق عطا کرتی ہیں، پس ان کی صورتیں محیط میں ظاہر ہوئیں، اور وہ ذات حق (الحق) ہے۔ پس کہا گیا: عرش، کرسی، افلاک، املاک، عناصر، مولدات، اور عارضی احوال، حالانکہ وہاں اللہ کے سوا کچھ نہیں ہے۔ پس ذات حق (الحق)، اپنے محیط ہونے کے اعتبار سے، خلوت والے کے لیے خلوت کے گھر کی طرح ہے، پس خلوت والے کو تلاش کیا جاتا ہے تو وہ نہیں ملتا، کیونکہ گھر اسے چھپا لیتا ہے، اور اس کے بارے میں صرف اس کی جگہ معلوم ہوتی ہے، اور اس کی جگہ اس کے مقام (مرتبے) کی دلیل ہے۔\n\n### [عارفین کی خلوت اور شرعی خلوت]\n\nپس میں نے تمہیں خلوت کا وہ مرتبہ عطا کر دیا ہے جو ہم اس کتاب میں چاہتے ہیں، نہ کہ وہ خلوت جو خلوت اختیار کرنے والوں کے ہاں معروف ہے۔ اور اس کے درجات ایک ہزار سڑسٹھ (۱٬۰۶۷) ہیں۔ پس ان درجات میں وتریت (طاق ہونے) کی صورت ظاہر ہوئی۔ اور جب خلا (الخلأ) کو عالم کے سوا کسی نے آباد نہیں کیا، تو وہ اپنے نفس کے ساتھ خلوت میں ہے۔ یہ اس کی اصل ہے۔ پھر جب وہ نور سے رنگین ہوا، تو وہ اپنے رب کے ساتھ خلوت میں تھا، اور وہ ہمیشہ کے لیے اس خلوت میں باقی رہا، وہ زمانے کی قید میں نہیں آتا، نہ چالیس دن کی اور نہ کسی اور کی۔ پس عارف جب اس بات کو جان لیتا ہے جو ہم نے ذکر کی، تو وہ جانتا ہے کہ وہ اپنے رب کے ساتھ خلوت میں ہے نہ کہ اپنے نفس کے ساتھ، اور اپنے رب کے ساتھ ہے نہ کہ اپنے نفس کے ساتھ۔ پس وہ اس حیثیت سے دیکھتا ہے کہ اس کا اثر محیط (گھیرنے والے) میں ان صورتوں کے ذریعے ہے جن کے ذریعے محیط خود اپنے آپ سے ظاہر ہوا، اور اس حیثیت سے کہ اس کے اعیان متعدد ہیں، اس نے اس (محیط) کو اس (محیط) کے ذریعے دیکھا، اور ہر عین اپنی ساتھی سے مختلف تھی۔\n\n### [عالم کی کثرت اور اس کی وحدت، اور انسان کی کثرت اور اس کی وحدت، اور عالم کا ذات حق سے قائم ہونا اور ذات حق کا عالم سے قائم ہونا]\n\nاور اسی لیے عالم کی صورتیں مختلف ہوئیں، اگرچہ وہ ایک ہے، جیسا کہ انسان کی صورت اپنے نفس میں مختلف ہوئی، اگرچہ انسان ایک ہے۔ پس اس کا ہاتھ اس کی ٹانگ نہیں ہے، اور اس کا سر اس کا سینہ نہیں ہے، اور اس کی آنکھ اس کا کان نہیں ہے، نہ اس کی زبان اور نہ اس کی شرمگاہ، اور اس کی عقل اس کا فکر نہیں ہے اور نہ اس کا خیال ہے۔ پس وہ محسوس اور معنوی صورتوں کے اعتبار سے متنوع اور متعدد العین ہے۔ اس کے باوجود اسے واحد کہا جاتا ہے اور یہ سچ ہے، اور اسے کثیر کہا جاتا ہے اور یہ سچ ہے۔ پس اس کی احدیت (وحدت) کے اعتبار سے ہم کہتے ہیں کہ اس نے اپنے آپ کو اپنے آپ سے دیکھا، اور اس کی کثرت کے اعتبار سے ہم کہتے ہیں کہ اس نے اپنے بعض کو اپنے بعض سے دیکھا۔ پس اس نے اپنی زبان سے بات کی، اپنے ہاتھ سے پکڑا، اپنی ٹانگ سے چلا، اپنی ناک سے سونگھا، اپنے کان سے سنا، اپنی آنکھ سے دیکھا، اپنے خیال سے تصور کیا، اور اپنی عقل سے سمجھا۔ پس یہ کثیر ہے، حالانکہ وہاں اس کے سوا کوئی نہیں ہے۔ پس جسے یہ علم حاصل ہو گیا جیسا کہ ہم نے بیان کیا، وہ صاحب خلوت ہے، اور جو اس سے محروم رہا وہ صاحب خلوت نہیں ہے۔ پس تمہارے لیے واضح ہو گیا کہ ذات حق (الحق) عالم کے ساتھ ہے اور عالم ذات حق (الحق) کے ساتھ ہے۔ پس اس کی ہویت (ذات) عین مجموعہ ہے، جیسا کہ مجموعہ انسان ہے اپنے غیب اور شہادت، اپنے نطق اور حیوانیت کے ساتھ۔ پس وہ کثرت میں واحد ہے اور احدیت میں کثیر ہے۔\n\n### [وہ خلوت جو مقام ہے اور وہ جو مقام نہیں ہے، اور اہل کشف کے نزدیک]\n\nپس خلوت ان مقامات میں سے ہے جو دنیا اور آخرت میں ہمیشہ کے لیے ساتھ رہتے ہیں، جسے یہ حاصل ہو جائے وہ زائل نہیں ہوتی، کیونکہ عین (حقیقت) کے بعد کوئی اثر نہیں ہوتا۔ اور رہی وہ خلوت جو معروف اور مشہور ہے، تو وہ مقام نہیں ہے اور وہ صرف محجوب (پردہ نشین) کے لیے ہی درست ہے۔ اور اہل کشف (أهل الكشف) کے لیے خلوت کبھی بھی درست نہیں ہوتی، کیونکہ وہ علوی ارواح اور ناری ارواح کا مشاہدہ کرتے ہیں، اور وہ کائنات کو ناطق دیکھتے ہیں، جو اس کی ذات کے اکوان ہیں اور اس کے خلوت کے گھر کے اکوان ہیں۔ پس وہ ایک جماعت (ملأ) میں ہے جیسا کہ وہ نفس الامر میں ہے۔ پس جب اللہ اس کی بصارت سے ان مدرکات کو ہٹا دیتا ہے اور حیوان اور جماد، اور فرشتوں اور عالم صمت (خاموشی) کو عالم کلام (گفتگو) سے، اور عالم سکون کو عالم حرکات سے جدا کر دیتا ہے، اور وہ اپنے رب کے ساتھ خلوت اختیار کرنا چاہتا ہے تاکہ کوئی کونی نطق یا کونی حرکت اسے اس سے مشغول نہ کرے۔ پس ان میں سے بعض خلوت کا مطالبہ اللہ سے اللہ کے بارے میں مزید علم حاصل کرنے کے لیے کرتے ہیں، نہ کہ اپنے نظر و فکر سے، اور یہ مقاصد میں سب سے مکمل ہے، کیونکہ اسے اس کا حکم دیا گیا ہے، اور حکم الٰہی پر عمل کرنا عمل کی انتہا ہے۔ اور اللہ اسے فرماتا ہے:\n\"قُلْ رَبِّ زِدْنِي عِلْماً\" (کہو: اے میرے رب! میرے علم میں اضافہ فرما۔)\n\n### [جو شخص اپنی خلوت میں اپنے نفس میں کسی کون (کائنات) سے بات کرے تو وہ خلوت میں نہیں ہے]\n\nپس جو شخص اپنی خلوت میں اپنے نفس میں کسی کون (کائنات) سے بات کرے تو وہ خلوت میں نہیں ہے۔ بعض نے ایک صاحب خلوت سے کہا: \"اپنی خلوت میں مجھے اپنے رب کے پاس یاد کرنا۔\" تو اس نے کہا: \"اگر میں نے تمہیں یاد کیا تو میں اس کے ساتھ خلوت میں نہیں رہوں گا۔\" اور اسی سے تم جان سکتے ہو:\nاللہ تعالیٰ کا قول:\n\"أَنَا جَلِيسُ مَنْ ذَكَرَنِي\" (میں اس کا ہم نشین ہوں جو مجھے یاد کرتا ہے۔)\nکیونکہ وہ اسے یاد نہیں کرتا جب تک کہ مذکور (جسے یاد کیا جا رہا ہے) اس کے نفس میں حاضر نہ ہو۔ اگر مذکور اس کے اعتقاد میں صورت والا ہے تو وہ اسے اپنے خیال میں حاضر کرتا ہے، اور اگر وہ عالم صور میں سے نہیں ہے یا اس کی کوئی صورت نہیں ہے تو قوت ذاکرہ (یاد رکھنے والی قوت) اسے حاضر کرتی ہے۔ کیونکہ انسان کی قوت ذاکرہ معانی کو ضبط کرتی ہے، اور قوت متخیلہ (تصور کرنے والی قوت) ان مثالوں کو ضبط کرتی ہے جو حواس نے اسے دی ہیں یا جنہیں قوت مصورہ (تصویر بنانے والی قوت) عجیب و غریب اشکال سے ترکیب دیتی ہے، جن کے جزئیات اس نے حس سے حاصل کیے ہیں۔ یہ ضروری ہے، اس کے بغیر اس کا کوئی تصرف نہیں ہے۔\n\n### [خیالی ذکر اور معنوی ذکر جو کہ قلب کا ذکر ہے]\n\nپس اس راستے میں خلوت کی شرط ذکر نفسی (نفس کا ذکر) ہے نہ کہ ذکر لفظی (لفظوں کا ذکر)۔ پس اس کی پہلی خلوت ذکر خیالی ہے، اور وہ ذکر کے لفظ کا تصور کرنا ہے، اس حیثیت سے کہ وہ رقمی اور لفظی حروف سے مرکب ہے، جسے خیال سماعت یا رؤیت کے ذریعے پکڑتا ہے، پس وہ اس کے ذریعے ذکر کرتا ہے، بغیر اس کے کہ وہ معنوی ذکر کی طرف ترقی کرے جس کی کوئی صورت نہیں ہوتی، اور وہ قلب کا ذکر ہے۔ اور قلبی ذکر سے اس کے لیے مطلوب اور علوم میں اضافہ منقدح (روشن) ہوتا ہے۔ اور اس علم کے ذریعے جو اس کے لیے روشن ہوا، وہ جانتا ہے کہ مثالوں کی صورتوں سے کیا مراد ہے جب وہ اس کے لیے قائم کی جاتی ہیں اور حس انہیں اس کے خیال میں نیند، بیداری، غیبت اور فنا میں پیدا کرتی ہے، پس وہ جانتا ہے کہ اس نے کیا دیکھا، اور یہی رؤیا کی تعبیر کا علم ہے۔\n\n### [اہل خلوت کے نزدیک خلوت کے مقاصد]\n\nاور ان میں سے بعض خلوت اس لیے اختیار کرتے ہیں تاکہ فکر صاف ہو جائے، تاکہ وہ اس علم میں جو وہ طلب کر رہا ہے، صحیح نظر والا ہو سکے۔ اور یہ صرف ان لوگوں کے لیے ہوتا ہے جو اپنا علم اپنے افکار سے حاصل کرتے ہیں۔ پس وہ خلوتیں اختیار کرتے ہیں تاکہ وہ جو کچھ طلب کر رہے ہیں، جب وہ منطقی میزانوں کے ذریعے ان پر ظاہر ہو، تو اسے درست کر سکیں۔ اور یہ ایک لطیف میزان ہے، معمولی سی ہوا بھی اسے حرکت دے کر استقامت سے ہٹا دیتی ہے۔ پس وہ خلوتیں اختیار کرتے ہیں اور خواہشات کے راستے بند کر دیتے ہیں تاکہ وہ میزان پر اثر انداز نہ ہوں اور کوئی ایسی حرکت پیدا نہ کریں جو ان کے مطلوب کی صحت کو خراب کر دے۔ اور اس طرح کی خلوت میں اہل اللہ داخل نہیں ہوتے، بلکہ ان کے لیے ذکر کی خلوت ہے، فکر کا ان پر کوئی تسلط نہیں ہوتا اور نہ ہی اس کا ان میں کوئی اثر ہوتا ہے۔ اور جو بھی صاحب خلوت اپنی خلوت میں فکر سے مغلوب ہو جائے، تو اسے باہر نکل جانا چاہیے اور جان لینا چاہیے کہ وہ اس کے لیے مطلوب نہیں ہے اور وہ صحیح علم الٰہی کے اہل میں سے نہیں ہے، کیونکہ اگر اللہ اسے چاہتا تو علم فیض الٰہی اسے فکر اور اس کے درمیان حائل ہو جاتا۔ اور ان میں سے بعض خلوت اس لیے اختیار کرتے ہیں کہ مخلوق سے انس کی وحشت ان پر غالب آ جاتی ہے، پس وہ مخلوق کو دیکھ کر اپنے نفس میں انقباض (تنگی) محسوس کرتے ہیں، یہاں تک کہ اپنے گھر والوں کو بھی، یہاں تک کہ وہ حرکت کی وحشت محسوس کرتے ہیں، پس وہ سکون طلب کرتے ہیں، اور یہ چیز انہیں خلوت اختیار کرنے کی طرف لے جاتی ہے۔ اور ان میں سے بعض خلوت اس لیے اختیار کرتے ہیں کہ وہ اس لذت کو میٹھا سمجھتے ہیں جو انہیں اس میں ملتی ہے۔ اور یہ سب بیماریاں ہیں جو نہ کوئی مقام دیتی ہیں اور نہ کوئی مرتبہ۔ اور صاحب خلوت نہ کسی وارد (آنے والی چیز) کا انتظار کرتا ہے، نہ کسی صورت کا، اور نہ کسی شہود (مشاہدے) کا، بلکہ وہ اپنے رب سے علم طلب کرتا ہے۔ پس کبھی وہ اسے بغیر کسی مادہ کے عطا کرتا ہے، اور کبھی وہ اسے کسی مادہ میں عطا کرتا ہے اور اس مادہ کے مدلول کا علم عطا کرتا ہے۔\n\n### [وہ خلوت جو نسبت ہے اور وہ خلوت جو مقام ہے]\n\nخلوت کا دعویٰ ہے اور اس کا مالک مسئول (جواب دہ) ہے۔ اس کا قریب ترین حجاب ایک نسبت ہے، وہ مقام نہیں ہے۔ میرا مطلب وہ خلوت ہے جو قوم کے ہاں معروف ہے، نہ کہ وہ خلوت جو مقام ہے جس کا ذکر ہم نے باب کے شروع میں کیا۔ اور اگرچہ یہ (معروف خلوت) مقام نہیں ہے، لیکن یہ اپنے مالک کو ذکر کے ذریعے ایسے مقامات حاصل کراتی ہے جو عارفین کے نزدیک ملک، ملکوت اور جبروت کا احاطہ کرتے ہیں۔ اور ادباء میں سے ملامیہ (ملامت کرنے والے) جو مواقف (مقامات) کے مالک ہیں، اور رہے اہل وصال اور انس میں سے عارفین اور ملامیہ، تو وہ اسے ملکوت میں داخل نہیں سمجھتے، اور یہ کہ یہ صرف عالم جبروت اور ملک کے ساتھ مخصوص ہے۔ البتہ اسے ملکوت سے قرب حاصل ہے، اس کے اور ملکوت کے درمیان صرف دو درجات ہیں۔ پس ملامیہ میں سے کھڑے رہنے والے ادباء اس کے لیے چھ سو اکتالیس (۶۴۱) درجات دیکھتے ہیں۔ اور اہل انس میں سے عارفین اس کے لیے ایک ہزار سڑسٹھ (۱٬۰۶۷) درجات دیکھتے ہیں۔ اور عارفین میں سے کھڑے رہنے والے ادباء اس کے لیے چھ سو سڑسٹھ (۶۶۷) درجات دیکھتے ہیں۔ اور اہل انس اور وصال میں سے ملامیہ اس کے لیے ایک ہزار چھتیس (۱٬۰۳۶) درجات دیکھتے ہیں۔",
    "fa": "## (باب هفتاد و هشتم در معرفت خلوت)\n\nبا آنکه دوست می‌دارم خلوت کردم و جز ما کسی نبود *** و اگر دیگری بود، هستی (وجودها) آن صحیح نمی‌شد.\nاگر نفسم شرایط تنهایی خود را محکم سازد *** همانا نفوس تمام خلق بندگان آن هستند.\nو اگر در نفس خود جز خودش نبود *** آن را با سخاوت بر کسی که آن را نیکو می‌سازد، می‌بخشید.\n\n### [اصل شرعی خلوت]\n\nبدانید، خداوند ما و شما را توفیق دهد، که اصل خلوت (الخلوة) در شریعت است:\n\n> من ذكرني في نفسه ذكرته في نفسي ومن ذكرني في ملأ ذكرته في ملأ خير منه‏\n> هر کس مرا در نفس خود یاد کند، او را در نفس خود یاد می‌کنم؛ و هر کس مرا در جمعی یاد کند، او را در جمعی بهتر از آن یاد می‌کنم.\n\nاین حدیث قدسی صحیحی است که شامل خلوت و جلوت (حضور در جمع) است، و اصل خلوت (الخلوة) از خلأ (الخلأ) است که عالم در آن یافت شد.\n\n> فمن خلا ولم يجد فما خلا *** فهي طريق حكمها حكم البلا\n> پس هر که خلوت کرد و نیافت، خلوت نکرده است *** این راهی است که حکم آن حکم بلا (آزمایش) است.\n\nو رسول خدا (صلی الله علیه و آله و سلم) فرمود: «خداوند بود و هیچ چیز با او نبود.»\n\nو از رسول خدا (صلی الله علیه و آله و سلم) پرسیده شد: «پروردگار ما پیش از آنکه خلقش را بیافریند کجا بود؟» فرمود: «در عماء (ابری غلیظ) بود که نه بالای آن هوا بود و نه زیر آن هوا.»\n\nسپس خلق را آفرید و قضا را مقرر کرد و از اموری فارغ شد، و او هر روز در شأنی است، و از اموری فارغ خواهد شد، سپس منازل را تا ابد با اهلش آباد می‌کند.\n\n### [خلوت بالاترین مقامات و منزلی است که انسان آن را آباد می‌کند]\n\nخلوت (الخلوة) بالاترین مقامات است و آن منزلی است که انسان آن را آباد می‌کند و با ذات خود پر می‌سازد، به طوری که غیر او در آن جای نمی‌گیرد. این است خلوت، و نسبت آن به انسان و نسبت انسان به آن، مانند نسبت حق (الحق) به قلب بنده است که حق آن را فرا گرفته است و غیر حق از هیچ وجهی از وجوه کونی در آن وارد نمی‌شود. پس قلب از تمام اکوان (موجودات) خالی می‌شود و حق با ذات خود در آن ظاهر می‌گردد. و نسبت قلب به حق این است که بر صورت حق باشد، پس جز او در آن جای نگیرد.\n\n### [اصل کونی خلوت]\n\nو اصل خلوت (الخلوة) در عالم، خلأ (الخلأ) است که عالم آن را پر کرده است. پس اولین چیزی که آن را پر کرد، هباء (الهباء) بود، و آن جوهری تاریک است که خلأ را با ذات خود پر کرد. سپس حق (الحق) با اسم نور خود بر آن تجلی (التجلی) کرد، پس آن جوهر به آن نور رنگ پذیرفت و حکم ظلمت که همان عدم است، از آن زائل شد و به هستی (الوجود) متصف گردید. پس با آن نور رنگ‌پذیرفته برای خود ظاهر شد، و ظهور آن بر صورت انسان بود. و به همین دلیل اهل الله آن را انسان کبیر می‌نامند، و مختصر آن را انسان صغیر می‌خوانند، زیرا موجودی است که خداوند تمام حقایق عالم کبیر را در او به ودیعه نهاده است. پس با وجود کوچکی جثه‌اش، بر صورت عالم خارج شد، و عالم بر صورت حق است، پس انسان بر صورت حق است، و این همان قول اوست: «همانا خداوند آدم را بر صورت خود آفرید.»\n\nو چون امر بر همین منوال بود که مقرر کردیم، خداوند متعال فرمود: **لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ** (آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است، ولی بیشتر مردم نمی‌دانند). اما اندکی از مردم می‌دانند.\n\n### [انسان عالم صغیر و عالم انسان کبیر و انسان کامل همان وجیز است]\n\nپس انسان عالم صغیر است و عالم انسان کبیر. سپس در عالم صور اشکال از افلاک و عناصر و موالید (موجودات متولد شده) گشوده شد. و انسان آخرین مولود در عالم بود که خداوند او را جامع حقایق تمام عالم آفرید و او را خلیفه در آن قرار داد، پس نیروی هر صورتی که در عالم موجود است را به او عطا کرد. پس آن جوهر هبائی (الهبائي) که به نور رنگ پذیرفته، بسیط است؛ و ظهور صور عالم در آن، وسیط است؛ و انسان کامل (الإنسان الکامل) وجیز (مختصر) است. خداوند متعال فرمود: **سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ** (به زودی آیات خود را در آفاق و در نفس‌هایشان به آنان نشان خواهیم داد) تا بدانند که انسان عالمی مختصر (وجیز) از عالم است که حاوی آیاتی است که در عالم وجود دارد.\n\n### [اولین چیزی که برای صاحب خلوت کشف می‌شود، آیات عالم است پیش از آیات نفس او]\n\nپس اولین چیزی که برای صاحب خلوت (الخلوة) کشف (الکشف) می‌شود، آیات عالم است پیش از آیات نفس او، زیرا عالم پیش از او بوده است، چنانکه خداوند متعال فرمود: **سَنُرِيهِمْ آياتِنا في الْآفاقِ** (به زودی آیات خود را در آفاق به آنان نشان خواهیم داد).\n\nسپس بعد از این، آیاتی را که در عالم دیده است، در نفس خود به او نشان می‌دهد. اگر ابتدا آن‌ها را در نفس خود می‌دید و سپس در عالم، شاید گمان می‌کرد که نفس خود را در عالم دیده است. پس خداوند این اشکال را از او برطرف کرد به این صورت که رؤیت آیات در عالم را مقدم داشت، همانند آنچه در هستی (الوجود) واقع شده است، زیرا عالم از انسان قدیم‌تر است، و چگونه قدیم‌تر نباشد در حالی که پدر اوست؟ پس رؤیت آن آیات در آفاق و در نفس او برایش آشکار ساخت که او حق (الحق) است و نه غیر او، و این امر برایش روشن شد.\n\n### [آیات خدا در آفاق و در انفس، دلالت‌هایی بر این است که او در مظاهر ظاهر است]\n\nپس آیات، دلالت‌هایی هستند برای او بر اینکه حق (الحق) در مظاهر اعیان عالم ظاهر است. پس صاحب این خلوت (الخلوة) نباید امر دیگری را طلب کند، زیرا در آنجا جز یک جمله (حقیقت واحد) نیست. و به همین دلیل خداوند متعال در تعریف، آن را کامل کرد و فرمود: **أَ ولَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلى‏ كُلِّ شَيْ‏ءٍ** (آیا پروردگارت کافی نیست که او بر هر چیزی) از اعیان عالم **شَهِيدٌ** (گواه است) بر تجلی (التجلی) و ظهور در آن؟ و در توان عالم نیست که این ظاهرِ در خود را از خود دور کند، و نه اینکه مظهر نباشد، و این همان چیزی است که از آن به امکان تعبیر می‌شود. اگر حقیقت عالم امکان نبود، نور را که همان ظهور حق (الحق) در آن است و با آیات برایش روشن شده، نمی‌پذیرفت.\n\n### [احاطه بر شیء، آن شیء را می‌پوشاند، پس ظاهر همان محیط است نه شیء محاط]\n\nسپس کامل کرد و فرمود: **إِنَّهُ بِكُلِّ شَيْ‏ءٍ** (همانا او بر هر چیزی) از عالم **مُحِيطٌ** (احاطه دارد). و احاطه بر شیء، آن شیء را می‌پوشاند، پس ظاهر، همان محیط است نه آن شیء محاط. زیرا احاطه بر آن، مانع ظهورش می‌شود. پس آن شیء که همان عالم است، در محیط مانند روح برای جسم شد، و محیط مانند جسم برای روح. یکی شهادت (ظاهر) است و آن محیط ظاهر است، و دیگری غیب است و آن مستور به این احاطه است که همان عین عالم است. و چون حکم برای موصوف به غیب در ظاهر که همان شهادت است، بود، و اعیان شیئیت‌های عالم بر استعداداتی در نفس خود بودند، بر ظاهرِ در خود حکم کردند به آنچه حقایقشان اقتضا می‌کرد. پس صور آن‌ها در محیط که همان حق (الحق) است، ظاهر شد. پس گفته شد: عرش و کرسی و افلاک و املاک و عناصر و موالید و احوالی که عارض می‌شوند، در حالی که در آنجا جز خدا نیست. پس حق (الحق) از جهت اینکه محیط است، مانند خانه خلوت (الخلوة) برای صاحب خلوت است. پس صاحب خلوت طلب می‌شود و یافت نمی‌شود، زیرا خانه او را می‌پوشاند و از او جز مکانش شناخته نمی‌شود، و مکانش بر مکانت او دلالت می‌کند.\n\n### [خلوت عارفان و خلوت شرعیان]\n\nپس من مرتبه خلوتی را که در این کتاب مد نظر داریم، به تو دادم، نه خلوت معهود نزد اصحاب خلوت‌ها. و درجات آن هزار و شصت و هفت درجه است، پس صورت وتری (فردیت) در درجات ظاهر شد. و چون خلأ (الخلأ) را جز عالم آباد نکرد، پس عالم در خلوت (الخلوة) با نفس خود است. این اصل آن است. سپس چون به نور رنگ پذیرفت، در خلوت با پروردگارش بود و در آن خلوت تا ابد باقی ماند و مقید به زمان نیست، نه به چهل روز و نه به غیر آن. پس عارف (العارف) اگر آنچه را ذکر کردیم بشناسد، می‌داند که در خلوت با پروردگارش است نه با نفس خود، و همراه پروردگارش است نه همراه نفس خود. پس از حیث اثرش در محیط خود، با صورتهایی که محیط با نفس خود ظاهر شده است، می‌بیند؛ و از حیث تعدد اعیانش، از او به واسطه او می‌بیند، و هر عینی با دیگری متفاوت است.\n\n### [کثرت عالم و وحدت آن، و کثرت انسان و وحدت آن، و قیام عالم به حق و حق به عالم]\n\nو به همین دلیل صور عالم متفاوت شد، اگرچه واحد است؛ همانطور که صورت انسان در نفس خود متفاوت است، اگرچه انسان واحد است. دست او پای او نیست، و سر او سینه او نیست، و چشم او گوش او نیست، و نه زبان او و نه فرج او؛ و عقل او فکر او نیست و نه خیال او. پس او از نظر عین (حقیقت) با صور محسوس و معنوی متنوع و متعدد است. با این حال، درباره او گفته می‌شود که واحد است و راست است، و گفته می‌شود که کثیر است و راست است. پس از حیث احدیتش می‌گوییم: خود را با خود دید؛ و از حیث کثرتش می‌گوییم: بعضی از خود را با بعضی دیگر دید. پس با زبانش سخن گفت، و با دستش حمله کرد، و با پایش سعی کرد، و با بینی‌اش استنشاق کرد، و با گوشش شنید، و با چشمش نگریست، و با خیالش تخیل کرد، و با عقلش تعقل کرد. این کثیر است و در آنجا جز او نیست. پس هر کس این علم را چنانکه مقرر کردیم به دست آورد، صاحب خلوت (الخلوة) است، و هر کس از آن محروم شود، صاحب خلوت نیست. پس برای تو روشن شد که حق (الحق) به واسطه عالم است و عالم به واسطه حق. پس هویت او عین مجموع است، همانطور که مجموع، انسان است با غیب و شهادت و نطق و حیوانیت خود. پس او در کثرت واحد است و در احدیت کثیر.\n\n### [خلوتی که مقام است و خلوتی که مقام نیست، نزد اهل کشف]\n\nپس خلوت (الخلوة) از مقامات (المقامات) همراه است که دنیا و آخرت تا ابد برای کسی که آن را به دست آورد، زائل نمی‌شود، زیرا پس از عین (حقیقت) اثری نیست. اما خلوت معروف و معهود، مقام نیست و جز برای محجوب (کسی که در حجاب است) صحیح نیست. اما برای اهل کشف (الکشف)، خلوت هرگز صحیح نیست، زیرا آن‌ها ارواح علوی و ارواح ناری را مشاهده می‌کنند و کائنات را ناطق می‌بینند؛ اکوان ذات او و اکوان خانه خلوت او. پس او در جمع است، همانطور که در نفس‌الامر است. مگر اینکه خداوند این مدرکات را از دید او برگیرد و میان حیوان و جماد و ملائکه، و عالم صمت (سکوت) از عالم کلام، و عالم سکون از عالم حرکات، جدایی اندازد، و او دوست داشته باشد که با پروردگارش خلوت کند تا نطق هیچ کونی و حرکت هیچ کونی او را از حق مشغول نسازد. پس برخی از آنان خلوت را برای علم بیشتر به خدا، از جانب خدا، نه از نظر و فکر خود، طلب می‌کنند. و این کامل‌ترین مقاصد است، زیرا او به این امر شده است و عمل بر امر الهی نهایت کمال عمل است، و خداوند به او می‌گوید: **قُلْ رَبِّ زِدْنِي عِلْماً** (بگو: پروردگارا، علم مرا زیاد کن).\n\n### [هر کس در خلوت خود در نفس خویش با کونی از اکوان سخن بگوید، در خلوت نیست]\n\nپس هر کس در خلوت (الخلوة) خود در نفس خویش با کونی از اکوان سخن بگوید، در خلوت نیست. یکی به صاحب خلوتی گفت: مرا نزد پروردگارت در خلوتت یاد کن. او پاسخ داد: اگر تو را یاد کنم، با او در خلوت نیستم. و از اینجا می‌شناسی\n\nقول خداوند متعال را: «من همنشین کسی هستم که مرا یاد کند.»\n\nزیرا او را یاد نمی‌کند مگر اینکه مذکور در نفس او حاضر شود. اگر مذکور در اعتقاد او دارای صورتی باشد، آن را در خیال خود حاضر می‌کند؛ و اگر از غیر عالم صور باشد یا صورتی نداشته باشد، قوه ذاکره (حافظه) او را حاضر می‌کند. زیرا قوه ذاکره انسان معانی را ضبط می‌کند و قوه متخیله (خیال) امثالی را که حواس به او داده‌اند یا آنچه را که\n\nقوه مصوره (صورت‌ساز) از اشکال غریبه ترکیب می‌کند و جزئیات آن را از حس به دست آورده است، ضبط می‌کند. این امر ضروری است و قوه مصوره جز با آن تصرفی ندارد.\n\n### [ذکر خیالی و ذکر معنوی که همان ذکر قلب است]\n\nپس از شرایط خلوت (الخلوة) در این راه، ذکر نفسی است نه ذکر لفظی. اولین مرحله خلوت او، ذکر خیالی است، و آن تصور لفظ ذکر است از این جهت که مرکب از حروف رقمی و لفظی است که خیال آن را به صورت شنیداری یا دیداری نگه می‌دارد، پس با آن ذکر می‌کند بدون اینکه به ذکر معنوی که صورتی ندارد و همان ذکر قلب است، ارتقا یابد. و از ذکر قلبی، مطلوب و افزایش علوم برای او شعله‌ور می‌شود. و با آن علمی که برایش شعله‌ور شده است، می‌فهمد که مراد از صور امثال چیست، هنگامی که برای او برپا داشته می‌شوند و حس آن‌ها را در خیال او در خواب و بیداری و غیبت و فنا (الفناء) ایجاد می‌کند. پس آنچه را دیده است می‌داند، و این همان علم تعبیر رؤیاست.\n\n### [مقاصد خلوت نزد اهل خلوت]\n\nو برخی از آنان خلوت (الخلوة) را برای صفای فکر برمی‌گزینند تا نظرشان در آنچه از علم می‌طلبند، صحیح باشد. و این جز برای کسانی نیست که علم را از افکار خود می‌گیرند. پس آنان خلوت‌ها را برای تصحیح آنچه می‌طلبند، هنگامی که با موازین منطقی برایشان ظاهر می‌شود، برمی‌گزینند. و آن (منطق) ترازویی لطیف است که کوچک‌ترین هوا آن را به حرکت درمی‌آورد و از استقامت خارج می‌سازد. پس خلوت‌ها را برمی‌گزینند و مجاری هواها را می‌بندند تا مبادا حرکتی در ترازو تأثیر بگذارد و صحت مطلوب را بر آنان فاسد کند. و اهل الله وارد چنین خلوتی نمی‌شوند، بلکه خلوت آنان با ذکر است. فکر بر آنان سلطه‌ای ندارد و در ایشان اثری ندارد. و هر صاحب خلوتی که فکر در خلوتش بر او چیره شود، باید خارج شود و بداند که برای آن خلوت خواسته نشده است و از اهل علم الهی صحیح نیست، زیرا اگر خداوند او را می‌خواست، علم فیض الهی میان او و فکر حائل می‌شد. و برخی از آنان خلوت را به دلیل غلبه وحشت از انس با خلق برمی‌گزینند، به طوری که از دیدن خلق، حتی اهل بیت خود، در نفس خود انقباضی می‌یابند، تا جایی که از حرکت وحشت می‌یابند و سکون را طلب می‌کنند، و این امر او را به برگزیدن خلوت می‌کشاند. و برخی از آنان خلوت را برای شیرینی لذتی که در آن می‌یابند، برمی‌گزینند. و این‌ها همه امور معلول هستند که نه مقام (المقام) می‌دهند و نه رتبه. و صاحب خلوت نه منتظر وارد (الهام) است، نه صورت و نه شهود (الشهود)، بلکه علم به پروردگارش را می‌طلبد. پس گاهی آن را در غیر ماده به او می‌دهد و گاهی آن را در ماده به او می‌دهد و علم به مدلول آن ماده را به او عطا می‌کند.\n\n### [خلوتی که نسبت است و خلوتی که مقام است]\n\nخلوت (الخلوة) ادعایی دارد و صاحب آن مسئول آن است. حجاب نزدیک‌تر، نسبتی است، نه مقام (المقام)؛ منظورم خلوت معهود نزد این قوم است، نه خلوتی که مقام است و در ابتدای باب ذکر کردیم. و این خلوت، اگرچه مقام نیست، اما برای صاحبش به واسطه ذکر، مقاماتی را به دست می‌آورد که نزد عارفان (العارفين) و ملامتیان (الملامية) از ادبا و صاحبان مواقف، احاطه بر مُلک و ملکوت و جبروت دارد. اما اهل وصال و انس از عارفان و ملامتیان، برای آن در ملکوت دخولی نمی‌بینند و معتقدند که آن مخصوص عالم جبروت و مُلک است و نه غیر آن، جز اینکه به ملکوت نزدیکی دارد و میان آن و ملکوت جز دو درجه نیست. پس ادبای واقف از ملامتیان برای آن ششصد و چهل و یک درجه می‌بینند، و عارفان از اهل انس برای آن هزار و شصت و هفت درجه می‌بینند، و ادبای از عارفان واقف برای آن ششصد و شصت و هفت درجه می‌بینند، و ملامتیان از اهل انس و وصال برای آن هزار و سی و شش درجه می‌بینند."
  },
  "page_count": 3
}