{
  "id": 121,
  "title": {
    "ar": "الباب الأحد والعشرون ومائة في مقام ترك الشكر",
    "en": "Chapter One Hundred and Twenty-One, Concerning the Station (مقام) of the Abandonment of Gratitude (الشكر)",
    "ur": "باب ایک سو اکیس: مقام ترک شکر کے بیان میں",
    "fa": "باب صد و بیست و یکم در مقام ترک شکر"
  },
  "content": {
    "ar": "## (الباب الأحد والعشرون ومائة في مقام ترك الشكر)\n\n\n> إذا كان حال الشكر يعطي زيادة *** وكان الإله الحق سمعك والبصر\n\n\n> فلا يقبل الحق الزيادة فانتقد *** كلامي تجده عبرة لمن اعتبر\n\n\n> فقد زال حكم الشكر من كل عالم *** بما قلته فالترك للشكر قد شكر\n\n\n### [ما من أمر وجودى إلا وهو دليل على توحيد الله ووجوده‏]\n\n\nاعلم أنه ما من عمل إلا وهو أمر وجودي وما من أمر وجودي إلا وهو دلالة على وجود الله وتوحيده سواء كان ذلك الأمر مذموما عرفا وشرعا أو محمودا عرفا وشرعا وإذا كان دلالة فهو نور والنور محمود لذاته فما ثم ما يجري عليه لسان ذم على الإطلاق كما أنه ما ثم معصية من مؤمن خالصة غير مشوبة بطاعة وهي الايمان بكونها معصية فتحقق هذا\n\n\n### [التكليف عملا كان أو تركا تصحبه الأولوية]\n\n\nثم حقيقة أخرى إنه ما ثم تكليف من عمل أو ترك إلا والأولوية تصحبه لا بد من ذلك فيقال تركه أولى من العمل أو العمل به أولى من تركه وما دخلته الأولوية فما هو خالص لأمر معين هذا معلوم دلالة عقل وكشف‏\n\n\n### [الصفات المحمودة إذا أخذها التفصيل تميزت بحسب المواطن عرفا وشرعا]\n\n\nوالله قد جعل الشكر عبادة والعبادات لا تترك وجعل الصدق عبادة وما أطلق عليه الحمد في كل موطن فإن الغيبة صدق وهو صدق مذموم والنميمة بالسوء صدق وهو مذموم ومواطن كثيرة للصدق يكون الصدق مذموما فيها مع الإطلاق إذ الصدق صفة محمودة فإذا أخذه التفصيل ميزته المواطن عرفا وشرعا كما إن الكذب بمطلقه صفة مذمومة فإذا أخذه التقييد والتفصيل ميزته المواطن عرفا وشرعا\n\n\n### [حق شكر الله منا الزيادة منا فيما شكر الله منا]\n\n\nفإذا شكر الإنسان ربه ورأى الشكر والنعمة منه فقد أتى صفة محمودة وهو عبادة فمن أداها من حيث ما هي عبادة خاصة ولم يخطر له الشكر من أجل المزيد من جهة هذه العبادة كما أنه أيضا طلب المزيد من العلم عبادة مأمور بها فهنالك يكون طلب الزيادة عبادة وأما في غير ذلك الموطن فما هو عبادة مشروعة فإذا أدى الإنسان شكر رب النعمة بفصولها من غير طلب الزيادة فكأنه ترك ما يعطيه الشكر وما يقتضيه طبع النفوس بذاتها من طلب زيادات النعم ولا يمنع هنا كون الحق سمعه وبصره أن يكون تاركا لطلب الزيادة إذا كان الحق لا ينقصه شي‏ء فإن الله قد اتصف بكونه شاكرا وشكورا وطلب الزيادة من أعمالنا من كونه شكورا فتعين علينا بل وجب أن نعطي الشكر الإلهي حقه وهو الزيادة منا فيما شكر منا والزيادة عبادات سواء كان ذلك تركا أو عملا\n\n\n### [رؤية العمل من الإنسان ترك لحق الشكر الذي يجب له‏]\n\n\nفترك الشكر برؤية العمل من الإنسان ترك صحيح لحق الشكر الذي يجب له وهذا مقام العموم فيصح ترك الشكر من العامة من أهل الله وأما من قال شكر النعمة إنه حجاب على المنعم فما عنده معرفة بالحقائق فإن ذلك لا يصح في كل من شكر نعمة فبالضرورة شكر المنعم بها غير إن بعض الناس لا يرى المنعم إلا السبب وبعض الناس يرى المنعم الله سبحانه والكمل من الناس يرون الله‏\nوالسبب فيشكر الله حقيقة ويشكر السبب عن أمر الله عباده من حيث أمرهم بشكره فقال أَنِ اشْكُرْ لِي ولِوالِدَيْكَ وقال لا يشكر الله من لم يشكر الناس‏\n\n\nفهذا مقام ترك الشكر أي ترك توحيد شكر المنعم الأصلي لأنه شرك في شكره بين المنعم بالأصالة وبين السبب عن أمر الله فإنه مقام صعب غامض أعني ترك الشكر لكون الله اتصف بالشكر وطلب الزيادة مما شكرنا من أجله فالتخلص من ذلك عسير وأما إذا كان مجلاه ووقته أن يكون الحق هو الشاكر والمشكور وسلب الأفعال عن المخلوقين فقد ترك الشكر في حال كونه شاكرا فيرى الحق إما شاكرا مطلقا والعبد لا شكر له البتة وإما أن يرى الحق تعالى شاكرا به أي بعبده بما هو العبد عليه من الشكر فهذا تارك للشكر من وجه موصوف بالشكر من وجه وهذا سار في جميع ما يصدر من العبد من الأفعال مشهد عزيز من عين المنة\n\n\n### [الكسب الذي يقول به قوم والخلق الذي يقول به قوم‏]\n\n\nهذه المسألة كانت عندي من أصعب المسائل وما فتح لي فيها بما هو الأمر عليه على القطع الذي لا أشك علما سوى ليلة تقييدي لهذا الباب في هذه المجلدة وهي ليلة السبت السادس من رجب الفرد سنة ثلاث وثلاثين وستمائة فإنه لم يكن تتخلص لي إضافة خلق الأعمال لأحد الجانبين ويعسر عندي الفصل بين الكسب الذي يقول به قوم وبين الخلق الذي يقول به قوم فأوقفني الحق بكشف بصري على خلقه المخلوق الأول الذي لم يتقدمه مخلوق إذ لم يكن إلا الله وقال لي هل هنا أمر يورث التلبيس والحيرة قلت لا قال لي هكذا جميع ما تراه من المحدثات ما لأحد فيه أثر ولا شي‏ء من الخلق فإنا الذي أخلق الأشياء عند الأسباب لا بالأسباب فتتكون عن أمري خلقت النفخ في عيسى وخلقت التكوين في الطائر قلت له فنفسك إذا خاطبت في قولك افعل ولا تفعل قال لي إذا طالعتك بأمر فالزم الأدب فإن الحضرة لا تحتمل المحاققة قلت به وهذا عين ما كنا فيه ومن يحاقق ومن يتأدب وأنت خالق الأدب والمحاققة فإن خلقت المحاققة فلا بد من حكمها وإن خلقت الأدب فلا بد من حكمه قال هو ذلك فاستمع إذا قرئ القرآن وأنصت قلت ذلك لك أخلق السمع حتى أسمع وأخلق الإنصات حتى أنصت وما يخاطبك الآن سوى ما خلقت فقال لي ما أخلق إلا ما علمت وما علمت إلا ما هو المعلوم عليه فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ وقد أعلمتك هذا فيما سلف فألزمه مشاهدة فليس سواه ترح خاطرك ولا تأمن حتى ينقطع التكليف ولا ينقطع حتى تجوز على الصراط فحينئذ تكون العبادة من الناس ذاتية ليست عن أمر ولا نهي يقتضيه وجوب أو ندب أو حظر أو كراهة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter One Hundred and Twenty-One: Concerning the Station of Abandoning Gratitude\n\n> If the state of gratitude grants increase,\n> And the True God [الإله الحق] is your hearing and your sight,\n> Then The Real [الحق] does not accept increase, so scrutinize\n> My words, you will find them a lesson for those who reflect.\n> The ruling of gratitude has vanished from every knower\n> By what I have said, for the abandonment of gratitude has indeed given thanks.\n\n### [Every Existential Matter is a Proof of God's Unity and Existence]\n\nKnow that there is no action except that it is an existential matter [أمر وجودي], and there is no existential matter except that it is an indication [دلالة] of God’s Existence and His Unity [توحيده], whether that matter is blameworthy conventionally and legally, or praiseworthy conventionally and legally. Since it is an indication, it is a light [نور], and light is praiseworthy in itself [لذاته]. Thus, there is nothing upon which the tongue of blame runs absolutely. Just as there is no pure disobedience [معصية] from a believer that is unmixed with an act of obedience, which is the belief [الإيمان] that it is disobedience. Realize this.\n\n### [Obligation, whether Action or Abandonment, is Accompanied by Priority]\n\nThen there is another reality: there is no obligation [تكليف], whether of action or abandonment, except that priority [الأولوية] necessarily accompanies it. Thus, it is said: abandoning it is more appropriate [أولى] than acting upon it, or acting upon it is more appropriate than abandoning it. Whatever is entered by priority is not purely dedicated to a specific matter. This is known by rational indication [دلالة عقل] and by Unveiling [كشف].\n\n### [Praiseworthy Attributes, when Detailed, are Distinguished According to Contexts Conventionally and Legally]\n\nGod has made gratitude [الشكر] an act of worship [عبادة], and acts of worship are not abandoned. He also made truthfulness [الصدق] an act of worship, yet praise [الحمد] is not applied to it in every context. For backbiting [الغيبة] is truthfulness, yet it is blameworthy truthfulness. And malicious gossip [النميمة بالسوء] is truthfulness, yet it is blameworthy. There are many contexts for truthfulness where truthfulness is blameworthy, despite the general principle that truthfulness is a praiseworthy attribute. Thus, when it is taken into detail [التفصيل], the contexts distinguish it conventionally and legally. Just as lying [الكذب] in its absolute sense is a blameworthy attribute, yet when it is taken into restriction and detail, the contexts distinguish it conventionally and legally.\n\n### [The Right of God's Gratitude from Us is Our Increase in What God is Grateful for from Us]\n\nSo, if a person thanks his Lord and sees the gratitude and the blessing [النعمة] as coming from himself, he has performed a praiseworthy attribute, which is an act of worship. Whoever performs it purely as a specific act of worship, and the gratitude does not occur to him for the sake of increase [المزيد] resulting from this worship—just as seeking increase in Knowledge [العلم] is also a commanded act of worship—in that specific context, seeking increase is worship, but in other contexts, it is not a prescribed worship.\n\nIf a person performs the gratitude due to the Lord of the blessing in its details without seeking increase, it is as if he has abandoned what gratitude grants and what the nature of the souls inherently demands: the seeking of increased blessings. The fact that The Real [الحق] is his hearing and sight does not prevent him from abandoning the seeking of increase, since The Real lacks nothing.\n\nIndeed, Allah has been described as being *Shākir* (Grateful) and *Shakūr* (Abundantly Grateful). The seeking of increase from our actions stems from His being *Shakūr*. Therefore, it is incumbent upon us, indeed obligatory, that we give the Divine Gratitude [الشكر الإلهي] its due right, which is the increase from us in that for which He is grateful from us. And this increase consists of acts of worship, whether that be abandonment or action.\n\n### [Seeing the Action as Originating from the Human is an Abandonment of the Right of Gratitude Due to Him]\n\nThus, the abandonment of gratitude [ترك الشكر] by seeing the action as originating from the human is a correct abandonment of the right of gratitude due to Him. This is the station [مقام] of generality, so the abandonment of gratitude is valid for the common folk among the People of God [أهل الله].\n\nBut as for him who says that gratitude for the blessing is a veil [حجاب] over the Benefactor [المنعم], he possesses no Gnosis [معرفة] of the Realities [الحقائق]. For that is not valid for everyone who gives thanks for a blessing, since, necessarily, the gratitude for the Benefactor is different. However, some people see the Benefactor only as the means [السبب]. And some people see the Benefactor as Allah, the Glorified. And the Perfect Ones [الكمل] among people see both Allah and the means.\n\nSo, he thanks Allah truly, and he thanks the means based on God's command to His servants to thank them, for He said: <<أَنِ اشْكُرْ لِي ولِوالِدَيْكَ>> (Be grateful to Me and to your parents). And He said: \"He who does not thank people does not thank God.\"\n\nThis, then, is the station of abandoning gratitude, meaning the abandonment of unifying the gratitude toward the Original Benefactor, because it involves associating partners [شرك] in His gratitude between the Original Benefactor and the means, based on God's command. Indeed, it is a difficult, obscure station—I mean the abandonment of gratitude—due to the fact that God is described by gratitude and seeks increase from that for which we gave thanks. Thus, escaping from that is difficult.\n\nBut when the locus of its Theophany [مجلاه] and its time is that The Real is the Grateful One (*Shākir*) and the One for whom thanks is given (*Mashkūr*), and actions are stripped away from the creatures, then he has abandoned gratitude while simultaneously being grateful. So, he sees The Real either as the Grateful One absolutely, and the servant has no gratitude whatsoever, or he sees The Real, the Exalted, as being grateful *by means of* him—that is, by means of His servant, through the gratitude that the servant possesses. Thus, this person is one who abandons gratitude from one perspective, and is described by gratitude from another perspective. And this runs through all the actions that issue forth from the servant—a precious witnessing [مشهد عزيز] from the very essence of Divine Favor [المنة].\n\n### [Acquisition which some people affirm, and Creation which some people affirm]\n\nThis issue was among the most difficult issues for me. And nothing was unveiled [فتح] to me concerning it, establishing the matter with the certainty [القطع] of knowledge about which I have no doubt, except on the night I recorded this chapter in this volume. That was the night of Saturday, the sixth of Rajab al-Fard, in the year six hundred and thirty-three [633 AH].\n\nFor the attribution of the creation [خلق] of actions to either of the two sides had not been resolved for me, and it was difficult for me to distinguish between the Acquisition [الكسب] affirmed by some people and the Creation [الخلق] affirmed by others.\n\nThen The Real [الحق] made me stand, through the Unveiling [كشف] of my inner sight, upon His creation of the First Created Thing [المخلوق الأول], which no created thing preceded, since there was nothing but Allah. And He said to me: \"Is there anything here that causes confusion [التلبيس] or perplexity [الحيرة]?\" I said: \"No.\" He said to me: \"Thus is everything you see of originated things [المحدثات]; no one has any effect in it, nor anything of creation [الخلق]. For I am the One who creates things *at the moment* of the means [الأسباب], not *by means* of the means. So they come into being by My command. I created the breathing [النفخ] into Jesus, and I created the formation [التكوين] in the bird.\"\n\nI said to Him: \"Then, when You address the soul in Your saying, 'Do' and 'Do not do'...\" He said to me: \"When I address you with a command, adhere to proper conduct [الأدب], for the Divine Presence [الحضرة] does not tolerate disputation [المحاققة].\" I said: \"But this is exactly what we were discussing: Who disputes and who adheres to proper conduct? You are the Creator [خالق] of both proper conduct and disputation. If You created disputation, its ruling must necessarily apply; and if You created proper conduct, its ruling must necessarily apply.\"\n\nHe said: \"It is so. Therefore, listen when the Quran is recited, and be silent.\" I said: \"That is Yours. Create the hearing [السمع] so that I may hear, and create the silence [الإنصات] so that I may be silent. And nothing addresses You now except what You have created.\"\n\nThen He said to me: \"I only create what I have Known, and I only Know what the object of Knowledge [المعلوم] is upon. <<فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ>> (Thus, the conclusive argument belongs to Allah). I have already informed you of this previously, so adhere to it as a witnessing [مشاهدة], for there is nothing else to comfort your mind. And do not feel secure until the obligation [التكليف] ceases, and it will not cease until you cross the Bridge [الصراط]. At that point, the worship [العبادة] of people will be intrinsic [ذاتية], not resulting from a command or prohibition that necessitates obligation [وجوب], recommendation [ندب], prohibition [حظر], or disapproval [كراهة].\"\n\nAnd Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (says the truth, and He guides to the way).",
    "ur": "## (الباب الأحد والعشرون ومائة في مقام ترك الشكر)\n\nجب شکر کا حال زیادتی عطا کرتا ہے *** اور ذات حق (الحق) ہی تیری سماعت اور بصارت ہو\n\nتو ذات حق (الحق) زیادتی قبول نہیں کرتی، پس میرے کلام پر غور کر *** تو اسے عبرت پائے گا اس کے لیے جو عبرت حاصل کرے۔\n\nجو کچھ میں نے کہا، اس سے ہر عالم سے شکر کا حکم زائل ہو گیا *** پس شکر کو چھوڑ دینا ہی درحقیقت شکر ہے۔\n\n### [کوئی بھی امر وجودی نہیں مگر وہ اللہ کے وجود اور توحید کی دلیل ہے]\n\nجان لو کہ کوئی عمل ایسا نہیں مگر وہ ایک امر وجودی (أمر وجودي) ہے، اور کوئی امر وجودی (أمر وجودي) ایسا نہیں مگر وہ اللہ کے وجود اور توحید (التوحيد) کی دلیل ہے، خواہ وہ امر عرفاً اور شرعاً مذموم ہو یا عرفاً اور شرعاً محمود ہو۔ اور جب وہ دلیل ہے تو وہ نور ہے، اور نور اپنی ذات میں محمود ہے۔ پس کوئی ایسی چیز نہیں جس پر مطلقاً مذمت کی زبان جاری ہو، جیسا کہ کسی مومن کی کوئی معصیت ایسی نہیں جو خالص ہو اور طاعت سے آلودہ نہ ہو، اور وہ طاعت اس معصیت کے معصیت ہونے پر ایمان ہے۔ پس اس حقیقت کو سمجھو۔\n\n### [تکلیف، خواہ وہ عمل ہو یا ترک، اس کے ساتھ اولویت شامل ہوتی ہے]\n\nپھر ایک اور حقیقت یہ ہے کہ کوئی تکلیف (التكليف) نہیں، خواہ وہ عمل کی ہو یا ترک کی، مگر اس کے ساتھ اولویت (الأولوية) ضرور شامل ہوتی ہے۔ پس کہا جاتا ہے کہ اس کا ترک کرنا عمل سے اولیٰ ہے، یا اس پر عمل کرنا اس کے ترک سے اولیٰ ہے۔ اور جس میں اولویت (الأولوية) داخل ہو جائے، وہ کسی ایک معین امر کے لیے خالص نہیں ہوتا۔ یہ عقل اور کشف (الکشف) کی دلیل سے معلوم ہے۔\n\n### [محمود صفات جب تفصیل میں لی جاتی ہیں تو عرفاً اور شرعاً مقامات کے لحاظ سے ممتاز ہو جاتی ہیں]\n\nاور اللہ نے شکر (الشکر) کو عبادت بنایا ہے، اور عبادات ترک نہیں کی جاتی ہیں۔ اور صدق (الصدق) کو عبادت بنایا ہے۔ اور ہر مقام پر جس چیز پر حمد کا اطلاق کیا گیا ہے، تو غیبت (الغيبة) بھی صدق ہے، اور وہ مذموم صدق ہے۔ اور برائی کے ساتھ چغلی (النميمة) بھی صدق ہے، اور وہ مذموم ہے۔ اور صدق کے بہت سے مقامات ہیں جہاں صدق مذموم ہوتا ہے، باوجود اس کے کہ مطلقاً صدق ایک محمود صفت ہے۔ پس جب اسے تفصیل میں لیا جاتا ہے تو مقامات اسے عرفاً اور شرعاً ممتاز کر دیتے ہیں۔ جیسا کہ کذب (جھوٹ) مطلقاً ایک مذموم صفت ہے، لیکن جب اسے تقیید اور تفصیل میں لیا جاتا ہے تو مقامات اسے عرفاً اور شرعاً ممتاز کر دیتے ہیں۔\n\n### [اللہ کے شکر کا حق ہم پر یہ ہے کہ ہم اس چیز میں زیادتی کریں جس پر اللہ نے ہمارا شکر کیا]\n\nپس جب انسان اپنے رب کا شکر ادا کرتا ہے اور شکر اور نعمت کو اپنی طرف سے دیکھتا ہے، تو اس نے ایک محمود صفت کو اپنایا جو کہ عبادت ہے۔ پس جس نے اسے اس حیثیت سے ادا کیا کہ وہ ایک خاص عبادت ہے اور اس عبادت کی وجہ سے مزید (زیادتی) کا خیال اس کے دل میں نہ آیا، جیسا کہ علم میں مزید کا طلب کرنا بھی ایک مامور بہ عبادت ہے۔ تو وہاں زیادتی کا طلب کرنا عبادت ہوتا ہے۔ لیکن اس کے علاوہ دوسرے مقام پر یہ کوئی مشروع عبادت نہیں ہے۔ پس جب انسان نعمت کے رب کا شکر اس کی تمام تفصیلات کے ساتھ ادا کرتا ہے، بغیر زیادتی طلب کیے، تو گویا اس نے وہ چیز ترک کر دی جو شکر عطا کرتا ہے اور جو نفوس کی فطرت بذات خود طلب کرتی ہے، یعنی نعمتوں میں زیادتی کا طلب کرنا۔ اور یہاں اس بات سے کوئی رکاوٹ نہیں آتی کہ ذات حق (الحق) اس کی سماعت اور بصارت ہے کہ وہ زیادتی کے طلب کو ترک کر دے، جب کہ ذات حق (الحق) کو کوئی چیز کم نہیں کرتی۔ بے شک اللہ نے خود کو شاکر (الشاكر) اور شکور (الشكور) ہونے سے متصف کیا ہے۔ اور شکور ہونے کی حیثیت سے ہمارے اعمال میں زیادتی کا طلب کرنا شامل ہے۔ پس ہم پر یہ متعین ہو گیا، بلکہ واجب ہو گیا، کہ ہم شکر الٰہی کو اس کا حق دیں، اور وہ حق ہم سے اس چیز میں زیادتی کرنا ہے جس پر ہمارا شکر کیا گیا، اور یہ زیادتی عبادات ہیں، خواہ وہ ترک ہو یا عمل۔\n\n### [انسان کا اپنے عمل کو دیکھنا اس شکر کے حق کا ترک ہے جو اس پر واجب ہے]\n\nپس انسان کا اپنے عمل کو دیکھتے ہوئے شکر کو ترک کرنا، اس شکر کے حق کا صحیح ترک ہے جو اس پر واجب ہے۔ اور یہ مقام عموم کا ہے، لہٰذا اہل اللہ کے عوام سے شکر کا ترک کرنا صحیح ہے۔ لیکن جس نے کہا کہ نعمت کا شکر منعم (المنعم) پر حجاب (حجاب) ہے، تو اسے حقائق کی معرفت (المعرفۃ) حاصل نہیں، کیونکہ یہ ہر اس شخص کے حق میں صحیح نہیں جو کسی نعمت کا شکر ادا کرے۔ پس بالضرورت اس نعمت کے منعم کا شکر ادا کرنا ضروری ہے۔ البتہ بعض لوگ منعم کو صرف سبب (السبب) دیکھتے ہیں، اور بعض لوگ اللہ سبحانہ کو منعم دیکھتے ہیں، اور کاملین (الکمل) لوگ اللہ اور سبب دونوں کو دیکھتے ہیں۔ پس وہ اللہ کا شکر حقیقت میں ادا کرتے ہیں اور سبب کا شکر اللہ کے حکم سے ادا کرتے ہیں، کیونکہ اللہ نے اپنے بندوں کو ان کا شکر ادا کرنے کا حکم دیا ہے، چنانچہ فرمایا: **أَنِ اشْكُرْ لِي ولِوالِدَيْكَ** (میرا شکر ادا کر اور اپنے والدین کا بھی)۔ اور فرمایا: **لا يشكر الله من لم يشكر الناس** (جو لوگوں کا شکر ادا نہیں کرتا وہ اللہ کا شکر ادا نہیں کرتا)۔\n\nپس یہ ترک شکر (شکر کو چھوڑ دینے) کا مقام ہے، یعنی منعم اصلی کے شکر کی توحید (التوحيد) کو ترک کرنا، کیونکہ یہ شکر میں منعم بالاصالہ اور اللہ کے حکم سے سبب کے درمیان شرک ہے۔ یہ ایک مشکل اور گہرا مقام ہے، یعنی شکر کو ترک کرنا، اس لیے کہ اللہ نے خود کو شکر سے متصف کیا ہے اور اس چیز میں زیادتی کا طلب کیا ہے جس پر ہم نے شکر ادا کیا۔ پس اس سے چھٹکارا پانا مشکل ہے۔ لیکن جب اس کا جلوہ اور وقت یہ ہو کہ ذات حق (الحق) ہی شاکر اور مشکور ہو، اور مخلوقات سے افعال سلب کر لیے جائیں، تو اس نے شکر کو اس حال میں ترک کر دیا جب کہ وہ خود شاکر ہے۔ پس وہ ذات حق (الحق) کو یا تو مطلقاً شاکر دیکھتا ہے اور بندے کے لیے قطعاً کوئی شکر نہیں، یا یہ دیکھتا ہے کہ اللہ تعالیٰ اس کے ذریعے، یعنی اپنے بندے کے ذریعے، شاکر ہے، اس شکر کی بنا پر جو بندے پر ہے۔ پس یہ ایک لحاظ سے شکر کو ترک کرنے والا ہے اور ایک لحاظ سے شکر سے متصف ہے۔ اور یہ تمام افعال میں جاری ہے جو بندے سے صادر ہوتے ہیں، یہ عین منت (احسان) کا ایک عزیز مشاہدہ ہے۔\n\n### [وہ کسب جس کے قائل کچھ لوگ ہیں اور وہ خلق جس کے قائل کچھ لوگ ہیں]\n\nیہ مسئلہ میرے نزدیک مشکل ترین مسائل میں سے تھا، اور اس میں مجھے اس قطعی علم کے ساتھ کوئی کشف (الکشف) حاصل نہیں ہوا جس میں مجھے کوئی شک نہ ہو، سوائے اس رات کے جب میں نے اس جلد میں اس باب کو مقید کیا، اور وہ ۶۳۳ ہجری میں رجب الفرد کی چھٹی شبِ ہفتہ تھی۔ کیونکہ میرے لیے اعمال کی تخلیق (الخلق) کو دونوں فریقوں میں سے کسی ایک کی طرف منسوب کرنے میں خلاصی نہیں ہو رہی تھی، اور میرے لیے اس کسب (الکسب) کے درمیان فرق کرنا مشکل تھا جس کے قائل کچھ لوگ ہیں، اور اس خلق (الخلق) کے درمیان جس کے قائل کچھ لوگ ہیں۔ پس ذات حق (الحق) نے مجھے بصری کشف (الکشف) کے ذریعے اپنی پہلی مخلوق کی تخلیق پر مطلع کیا، جس سے پہلے کوئی مخلوق نہیں تھی، کیونکہ اللہ کے سوا کچھ نہیں تھا۔ اور مجھ سے فرمایا: کیا یہاں کوئی ایسا امر ہے جو الجھن اور حیرت (التلبيس والحيرة) پیدا کرے؟ میں نے کہا: نہیں۔ فرمایا: اسی طرح تمام محدثات (نئی پیدا ہونے والی چیزیں) جنہیں تم دیکھتے ہو، ان میں مخلوق کا کوئی اثر یا کوئی شے نہیں ہے۔ پس میں ہی وہ ہوں جو اسباب کے وقت اشیاء کو خلق کرتا ہوں، نہ کہ اسباب کے ذریعے، تو وہ میرے حکم سے وجود میں آتی ہیں۔ میں نے عیسیٰ میں پھونک کو خلق کیا اور پرندے میں تخلیق (التكوين) کو خلق کیا۔ میں نے عرض کیا: تو پھر آپ کا اپنے آپ کو مخاطب کرنا آپ کے اس قول میں کہ \"کر\" اور \"نہ کر\"؟ فرمایا: جب میں تجھے کسی امر سے مطلع کروں تو ادب لازم کر، کیونکہ یہ بارگاہ محاکمہ (بحث و تکرار) کی متحمل نہیں ہے۔ میں نے کہا: یہ وہی ہے جس میں ہم تھے، اور کون محاکمہ کرے گا اور کون ادب اختیار کرے گا، جب کہ آپ ہی ادب اور محاکمہ کے خالق ہیں؟ پس اگر آپ نے محاکمہ کو خلق کیا تو اس کا حکم ضرور نافذ ہو گا، اور اگر آپ نے ادب کو خلق کیا تو اس کا حکم ضرور نافذ ہو گا۔ فرمایا: بات یہی ہے۔ پس جب قرآن پڑھا جائے تو سنو اور خاموش رہو۔ میں نے کہا: یہ آپ کے لیے ہے، میں سماعت کو خلق کروں گا تاکہ سنوں، اور خاموشی کو خلق کروں گا تاکہ خاموش رہوں، اور جو چیز اب آپ کو مخاطب کر رہی ہے وہ صرف وہی ہے جسے آپ نے خلق کیا ہے۔ تو مجھ سے فرمایا: میں صرف وہی خلق کرتا ہوں جو میں نے جانا، اور میں نے صرف وہی جانا جو معلوم (معلوم) ہے۔ **فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ** (پس اللہ ہی کے لیے کامل حجت ہے)۔ اور میں نے تجھے یہ پہلے بھی بتا دیا ہے، پس اسے مشاہدہ (الشہود) میں لازم کر لے، اس کے سوا کوئی چیز تیرے دل کو سکون نہیں دے گی۔ اور تو اس وقت تک مطمئن نہ ہو جب تک تکلیف ختم نہ ہو جائے، اور وہ اس وقت تک ختم نہیں ہو گی جب تک تو صراط (الصراط) سے گزر نہ جائے۔ تب لوگوں کی عبادت ذاتی ہو گی، جو کسی ایسے امر یا نہی کی وجہ سے نہیں ہو گی جس کا تقاضا وجوب، ندب، حظر یا کراہت ہو۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "## باب صد و بیست و یکم در مقام ترک شکر (الترك للشكر)\n\nاگر حال شکر (الشكر) فزونی می‌بخشد،\nو حال آنکه خدای حق (الحق) شنوایی و بینایی توست.\n\nپس حق (الحق) فزونی را نمی‌پذیرد، پس کلام مرا بررسی کن،\nآن را مایه‌ی عبرت برای کسی که عبرت گیرد خواهی یافت.\n\nپس حکم شکر از هر عالمی زائل گشت،\nبه سبب آنچه گفتم، پس ترک شکر (الترك للشكر) خود شکر است.\n\n### [هیچ امر وجودی نیست مگر آنکه دلیلی بر توحید و هستی (وجود) خداوند است]\n\nبدان که هیچ عملی نیست مگر آنکه امری وجودی است، و هیچ امر وجودی نیست مگر آنکه دلالتی بر هستی (وجود) و توحید خداوند است، خواه آن امر از نظر عرف و شرع مذموم باشد یا از نظر عرف و شرع محمود. و چون دلالت است، پس نور است، و نور به ذات خود محمود است. پس مطلقاً چیزی نیست که زبان نکوهش بر آن جاری شود. همان‌طور که هیچ معصیتی از مؤمن خالص نیست که آمیخته به طاعتی نباشد، و آن ایمان به معصیت بودن آن است. پس این را دریاب.\n\n### [تکلیف، خواه عمل باشد یا ترک، همراه با اولویت است]\n\nسپس حقیقت دیگری هست که هیچ تکلیفی از عمل یا ترک وجود ندارد مگر آنکه اولویت (الأولوية) حتماً همراه آن است. پس گفته می‌شود: ترک آن اولی‌تر از عمل است، یا عمل به آن اولی‌تر از ترک آن است. و آنچه اولویت در آن داخل شود، خالص برای امر معینی نیست. این از طریق دلالت عقل و کشف (الکشف) معلوم است.\n\n### [صفات ستوده اگر به تفصیل درآیند، بر حسب مواطن عرفاً و شرعاً متمایز می‌شوند]\n\nو خداوند شکر را عبادت قرار داده است و عبادات ترک نمی‌شوند. و صدق را عبادت قرار داده است. و آنچه در هر موطنی حمد بر آن اطلاق شده است، غیبت نیز صدق است و صدق مذموم است، و سخن‌چینی (نمیمه) به بدی صدق است و مذموم است. و مواطن بسیاری برای صدق وجود دارد که صدق در آن‌ها مذموم است، با وجود اطلاق (عمومیت) آن، زیرا صدق صفتی ستوده است. پس اگر تفصیل آن را در بر گیرد، مواطن آن را عرفاً و شرعاً متمایز می‌سازد. همان‌طور که دروغ به طور مطلق صفتی نکوهیده است، اما اگر تقیید و تفصیل آن را در بر گیرد، مواطن آن را عرفاً و شرعاً متمایز می‌سازد.\n\n### [حق شکر خداوند از جانب ما، فزونی دادن ماست در آنچه خداوند از ما شکر کرده است]\n\nپس اگر انسان پروردگارش را شکر کند و شکر و نعمت را از جانب خود ببیند، صفتی ستوده را به جا آورده است و آن عبادت است. پس کسی که آن را از آن جهت که عبادتی خاص است انجام دهد و شکر به خاطر فزونی (المزید) از جهت این عبادت به خاطرش خطور نکند، همان‌طور که طلب فزونی در علم نیز عبادتی است که به آن امر شده است، در آن صورت طلب فزونی عبادت خواهد بود. اما در غیر آن موطن، طلب فزونی عبادتی مشروع نیست. پس اگر انسان شکر پروردگار نعمت را با فصول آن، بدون طلب فزونی، ادا کند، گویی آنچه را که شکر می‌بخشد و آنچه را که طبع نفوس به ذات خود از طلب فزونی نعمت‌ها اقتضا می‌کند، ترک کرده است. و در اینجا اینکه حق (الحق) شنوایی و بینایی اوست، مانع از آن نمی‌شود که او ترک‌کننده‌ی طلب فزونی باشد، زیرا حق (الحق) چیزی را کم نمی‌آورد. همانا خداوند به شاكر و شكور بودن متصف شده است. و طلب فزونی از اعمال ما، از جهت شکور بودن اوست. پس بر ما واجب و بلکه متعین است که حق شکر الهی را ادا کنیم و آن فزونی دادن ماست در آنچه از ما شکر شده است. و فزونی، عبادات است، خواه آن ترک باشد یا عمل.\n\n### [دیدن عمل از جانب انسان، ترک حق شکر واجب برای اوست]\n\nپس ترک شکر به واسطه‌ی دیدن عمل از جانب انسان، ترک صحیحی برای حق شکر واجب برای اوست. و این مقام عموم است، پس ترک شکر از عوام اهل الله صحیح است. اما کسی که می‌گوید شکر نعمت حجابی بر مُنعِم است، معرفت (المعرفة) به حقایق (الحقائق) ندارد، زیرا این در مورد هر کسی که نعمتی را شکر کند صحیح نیست. پس شکر مُنعِم به ضرورت انجام می‌شود. غیر از اینکه برخی از مردم مُنعِم را فقط سبب (السبب) می‌بینند، و برخی دیگر مُنعِم را خداوند سبحان می‌بینند، و کاملان از مردم، خداوند و سبب را می‌بینند. پس خداوند را حقیقتاً شکر می‌کنند و سبب را به امر خداوند به بندگانش شکر می‌کنند، از آن جهت که به شکرگزاری از آن‌ها امر فرموده و گفته است: **أَنِ اشْكُرْ لِي ولِوالِدَيْكَ** (که مرا و پدر و مادرت را شکر کن) و فرموده است: «لا يشكر الله من لم يشكر الناس» (کسی که از مردم شکرگزاری نکند، خدا را شکر نکرده است).\n\nپس این مقام ترک شکر است، یعنی ترک توحید شکر مُنعِم اصلی، زیرا در شکر او بین مُنعِم اصیل و سبب به امر خداوند شرک ورزیده شده است. این مقام، مقامی دشوار و غامض است، منظورم ترک شکر است به دلیل اینکه خداوند به شکر متصف شده و طلب فزونی از آنچه ما به خاطر آن شکر کردیم، کرده است. پس رهایی از آن دشوار است. اما اگر مَجلا (تجلی‌گاه) و وقت آن باشد که حق (الحق) خود شاکر و مشکور باشد و افعال از مخلوقات سلب شود، در این صورت او شکر را در حال شاکر بودن ترک کرده است. پس حق (الحق) را یا شاکر مطلق می‌بیند و بنده هیچ شکرگزاری ندارد، یا حق تعالی را شاکر به واسطه‌ی او (بنده‌اش) می‌بیند، به آنچه بنده بر آن از شکر است. پس این شخص از یک وجه تارک شکر و از وجهی دیگر موصوف به شکر است. و این در تمام افعالی که از بنده صادر می‌شود جاری است؛ مشهدی عزیز از عین منّت.\n\n### [کسب (الکسب) که گروهی به آن قائلند و خلق (الخلق) که گروهی به آن قائلند]\n\nاین مسئله نزد من از دشوارترین مسائل بود و در آن به آنچه امر بر آن است، به قطعیت علمی که در آن شک نکنم، گشایشی حاصل نشد، مگر شبی که این باب را در این مجلد می‌نوشتم، و آن شب شنبه ششم رجب الفرد سال ششصد و سی و سه بود. زیرا برای من اضافه کردن خلق اعمال به یکی از دو طرف (کسب یا خلق) خالص نمی‌شد و تفکیک بین کسب (الکسب) که گروهی به آن قائلند و خلق (الخلق) که گروهی به آن قائلند، برایم دشوار بود. پس حق (الحق) مرا با کشف بصری بر خلق مخلوق اول که هیچ مخلوقی بر او تقدم نداشت، متوقف ساخت، زیرا جز خدا نبود. و به من فرمود: آیا در اینجا امری هست که موجب التباس و حیرت شود؟ گفتم: خیر. فرمود: تمام آنچه از پدیده‌ها (محدثات) می‌بینی نیز چنین است. هیچ کس در آن اثری ندارد و هیچ چیز از خلق در آن نیست. زیرا ماییم که اشیاء را نزد اسباب خلق می‌کنیم نه به واسطه‌ی اسباب. پس آن‌ها به امر من تکوّن می‌یابند. من دمیدن در عیسی را خلق کردم و تکوین در پرنده را خلق کردم. به او گفتم: پس خودت را چگونه خطاب می‌کنی در قول خودت: «انجام بده» و «انجام نده»؟ فرمود: اگر تو را به امری مخاطب ساختم، ادب را رعایت کن، زیرا حضرت (الحضرة) تاب محاققه (جدل) را ندارد. گفتم: به آن قائل شدم. و این عین همان چیزی است که در آن بودیم. و چه کسی محاققه می‌کند و چه کسی ادب می‌ورزد؟ و تو خالق ادب و محاققه‌ای. پس اگر محاققه را خلق کردی، حکم آن ناگزیر است، و اگر ادب را خلق کردی، حکم آن ناگزیر است. فرمود: چنین است. پس **فَاسْتَمِعُوا إِذَا قُرِئَ الْقُرْآنُ وَأَنْصِتُوا** (پس چون قرآن خوانده شود، گوش فرا دهید و خاموش باشید). گفتم: این برای توست. گوش را خلق کن تا بشنوم و انصات (خاموشی) را خلق کن تا خاموش باشم. و اکنون جز آنچه خلق کرده‌ای، تو را مخاطب نمی‌سازد. پس به من فرمود: من خلق نمی‌کنم مگر آنچه را که می‌دانم، و نمی‌دانم مگر آنچه معلوم بر آن است. **فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ** (پس حجت رسا از آن خداست). و این را پیش از این به تو اعلام کرده‌ام، پس آن را در مشاهده (مشاهدة) لازم بدار. جز او نیست که خاطر تو را آسوده کند. و ایمن مباش تا زمانی که تکلیف قطع شود، و تکلیف قطع نمی‌شود تا از صراط بگذری. در آن هنگام عبادت از مردم ذاتی خواهد بود، نه از امر و نهی که وجوب یا ندب یا حظر یا کراهت را اقتضا کند. و خداوند **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}