{
  "id": 490,
  "title": {
    "ar": "الباب الموفي تسعين وأربعمائة في معرفة حال قطب كان منزله كَبُرَ مَقْتاً عِنْدَ الله أَنْ تَقُولُوا ما لا تَفْعَلُونَ",
    "en": "Chapter Four Hundred and Ninety: Concerning the Knowledge of the State of a Pole (قطب) whose Station was <<It is greatly hateful in the sight of Allah that you say what you do not do>>.",
    "ur": "باب چار سو نوے (۴۹۰): ایک قطب (Qutb) کے حال کی معرفت میں جس کا روحانی منزل (منزل) یہ تھا: \"اللہ کے نزدیک یہ بات سخت ناپسندیدہ ہے کہ تم وہ کہو جو تم نہیں کرتے۔\" (كَبُرَ مَقْتاً عِنْدَ الله أَنْ تَقُولُوا ما لا تَفْعَلُونَ)",
    "fa": "باب چهارصد و نودم در معرفت حال قطبی که منزلگاهش این بود: «بزرگ است دشمنی نزد خدا که بگویید آنچه را که انجام نمی‌دهید» (كَبُرَ مَقْتاً عِنْدَ الله أَنْ تَقُولُوا ما لا تَفْعَلُونَ)."
  },
  "content": {
    "ar": "## «الباب الموفي تسعين وأربعمائة في معرفة حال قطب كان منزله كَبُرَ مَقْتاً عِنْدَ الله أَنْ تَقُولُوا ما لا تَفْعَلُونَ»\n\n\n> كبر المقت من الله لذا *** كبر المقت من الخلق فمن‏\n\n\n> قال قولا ثم لم يعمل به *** من جميل وهو القول الحسن‏\n\n\n> عمل الله به في خلقه *** وهو لا يدري به في كل فن‏\n\n\n> من فنون الخير فاستبصر به *** في وجود الكون من لفظة كن‏\n\n\n### [أن الأفعال التي متحقق في الخارج ليس إلا لله‏]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن الله ما أضاف الأفعال إلى الخلق إلا لكون من أضاف الفعل إليه هوية باطنه عين الحق فلا يكون الفعل إلا لله غير أنه من عباد الله من أشهده ذلك ومنهم من لم يشهده ذلك فمن أشهده ذلك وقال ما يمكن أن يكون بالفعل وما فعل فيعمل على القطع شهودا أنه ما امتنع وقوع الفعل إلا لخروجه عن الإمكان العقلي لأنه لم ير له صورة في الأعين الثابتة التي أعطت العلم لله فكيف يقع في الوجود ما لا عين له في الثبوت ولهذا أضاف المقت في ذلك لعند الله فإن هذا الاسم جامع المتقابلات من أحكام الأسماء فمن جملة ما يدل عليه إثبات الإمكان فيمقت من حيث إثبات الإمكان فالله هنا هو اسم خاص معين وهو المثبت الإمكان ويقابله نافي الإمكان فيقول ما ثم إلا وجوب غير أنه مقيد ومطلق فلا يصح إطلاق هذا الاسم الله فإذا قيل فالمراد به التقييد ويظهر بما يدل عليه‏\nالحال فيعلم عن أي شي‏ء ناب من الأسماء فينظر في حكم ذلك الاسم فيوجد أثره فيه فتعلق المقت بمن قال خيرا يمكن له فعله فلا يفعله فانظر إلى ذلك القول الخير لا بد أن يجني ثمرته في الخير القائل به ولا سيما إن أعطى عملا في عامل من عباد الله إلا أنه محروم فما يكبر عند الله إلا لكون هذا القائل قال هذا القول ولم يفعل ما قاله إذا أطلع على ما حرم من الخير بترك الفعل فمقت نفسه أعظم المقت ولا سيما إذا رأى غيره قد انتفع به عملا فهو أكبر مقت عنده يمقت به نفسه عند الله في شهوده في الآخرة فهو أكبر مقت عند الله من مقت آخر لا أن الله مقته بل هو بمقت نفسه عند الله إذا صار إليه وللمقت درجات بعضها أكبر من بعض وهذا من أكبرها عنده فيكشف له هذا الهجير هذا العلم فإن الناس يأخذون في هذه الآية غير مأخذها فيقولون إن الله مقتهم وما يتحققون قوله تعالى عِنْدَ الله أي تمقتون أنفسكم أكبر المقت عند الله إذا رجعتم إليه فإن قال ما نعتقد صحته ولم يقل ذلك إيمانا فذلك المنافق وإن قال ذلك إيمانا ولم يفعل فذلك المفرط وهو الذي يكبر مقته عند الله لأن إيمانه يعطيه الفعل فلم يفعل ولَوْ أَنَّهُمْ فَعَلُوا ما يُوعَظُونَ به على ألسنتهم وألسنة غيرهم لَكانَ خَيْراً لَهُمْ وأَشَدَّ تَثْبِيتاً وآتاهم الله أجرا عظيما لأنه أضاف الفعل إلى القول فعظم بالاجتماع على ما تكون صورته إذا انفرد بقول دون فعل وبفعل دون قول وما أيه الله بمن هذه صفته إلا بالاسم المذكر ليزيلهم به من حكم الاسم الخاذل فإن الله ما يؤبه إلا من الاسم الذي لا حكم له في الحال والتأيه على نوعين تأيه بالصفة مثل قوله يا أَيُّهَا الَّذِينَ آمَنُوا ويا أَيُّهَا الَّذِينَ أُوتُوا الْكِتابَ وتأيه بالذات مثل قوله يا أَيُّهَا النَّاسُ فمتى سمعت التأيه فلتنظر ما يأيه به لا من أيه به فاعمل بحسب ما أيه به من اجتناب أو غير اجتناب فإنه قد يؤبه بأمر وقد يؤبه بنهي كما تقول في الأمر يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ وكما يقول في النهي يا أَيُّهَا الَّذِينَ آمَنُوا لا تُحِلُّوا شَعائِرَ الله وكذلك يا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ ما لا تَفْعَلُونَ فهذا تأيه إنكار كأنه يقول في الأمر فيه افعلوا ما تقولون وفي النهي لا تقولوا على الله ما لا تعملون فإنكم تمقتون نفوسكم عند الله في ذلك أكبر المقت كما قررنا فإذا أتى مثل هذا كان له وجه للأمر ووجه للنهي وهذا هو الوجه فيأخذه السامع بحسب ما يقع له في الوقت وأي وجه أخذ به في أمر أو نهي أصاب وإن جمع بينهما جنى ثمرة ذلك فيكون له أجران ومن الناس من يكشف له في هذا الهجير أنه القول الخاص وهو أن يقول بإضافة الفعل إلى نفسه في اعتقاده كالمعتزلي فيطلع في كشفه على إن الأفعال لله ليست له فيمقت نفسه حيث جهلت مثل هذا أكبر المقت عند الله ويكون عند الله هنا عندية الشهود حيث كان في الدنيا أو في الآخرة فمقته في الدنيا رجوع عن ذلك فيسعد ويلحق بالعلماء بخلاف مقته عند الله في الآخرة فكأنه يقول يا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ إن الفعل لكم وما هو كذلك فأضفتم إليكم ما لا تَفْعَلُونَ وكَبُرَ مَقْتاً منكم عِنْدَ الله أَنْ تَقُولُوا ما لا تَفْعَلُونَ إِنَّ الله يُحِبُّ الَّذِينَ يُقاتِلُونَ في سَبِيلِهِ فإنه على صراط مستقيم هذا المنازع الذين نقول له إن الفعل للحق صَفًّا لا خلل فيه كَأَنَّهُمْ بُنْيانٌ مَرْصُوصٌ لا خلل فيه فيضيف الأفعال كلها لله لا لمن ظهرت فيه فقد أفلح من كان هجيره هذه الآية لأنه لا فائدة للهجير إلا أن يفتح لصاحبه فيه فإذا رأيت ذا هجير لا يفتح له فيه فاعلم أنه صاحب هجير لسان ظاهره لا يوافقه لسان باطنه ومن هو بهذه المثابة فما هو مقصودنا بأصحاب الهجيرات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 490: On the Knowledge of the State of a Pole (*Qutb*) whose Station was: <<IT IS GREATLY HATEFUL IN THE SIGHT OF ALLAH THAT YOU SAY WHAT YOU DO NOT DO>> (Q. 61:3).\n\nThe Abhorrence (*Maqt*) from Allah is great, and thus\nThe Abhorrence from creation is great. So whoever\nUtters a beautiful saying, which is a good word,\nThen fails to act upon it,\nAllah acts with it among His creation,\nWhile he remains unaware of it, in every kind\nOf the arts of goodness. So gain insight into it\nIn the existence of the cosmos, originating from the word 'Be' (كن).\n\n[That the Acts Realized in the External World Belong to Allah Alone]\n\nKnow—may Allah support us and you with a Spirit from Him—that Allah only attributed acts (الأفعال) to creation (الخلق) because the inner identity (هوية باطنه) of the one to whom the act is attributed is the very Essence of the Real (عين الحق). Thus, the act belongs only to Allah. However, among Allah’s servants, there are those who are granted the witnessing (الشهود) of this, and those who are not.\n\nAs for the one who is granted this witnessing, and who says what is possible to be done but does not do it, he acts based on the certainty of witnessing (شهودا) that the non-occurrence of the act was only due to its departure from rational possibility (الإمكان العقلي), because he did not see an image of it in the Fixed Entities (الأعيان الثابتة) which provided Knowledge (العلم) to Allah. How, then, can something occur in Existence (الوجود) that has no essence (عين) in Immutability (الثبوت)?\n\nFor this reason, the abhorrence (المقت) in this matter is attributed to the presence *in the sight of Allah* (عِنْدَ الله). This Name [Allah] is the comprehensive container of the opposing judgments of the Names (الأسماء). Among what it signifies is the affirmation of possibility (إثبات الإمكان). Thus, abhorrence arises from the perspective of affirming possibility. Therefore, *Allah* here is a specific, designated Name, which is the Affirmer of Possibility (المثبت الإمكان). Opposing it is the Denier of Possibility, who says there is nothing but Necessity (وجوب), whether restricted or absolute. It is not correct to use the Name *Allah* absolutely [in this context]. If it is mentioned, the restriction is intended, and what the context indicates will clarify it, so that one knows which of the Names it substitutes for. One then looks at the judgment of that Name and finds its effect therein.\n\nThe abhorrence is connected to the one who speaks good that he is able to perform, yet does not perform it. Look at that good saying: it must yield its fruit in goodness for the one who spoke it, especially if it results in an act performed by one of Allah’s servants, even though the speaker himself is deprived. The abhorrence is great *in the sight of Allah* (عِنْدَ الله) only because this speaker uttered the saying but did not do what he said. When he is shown the goodness of which he was deprived by abandoning the act, he abhors himself with the greatest abhorrence (أعظم المقت), especially when he sees that someone else benefited from it through action. This is the greatest abhorrence *in his sight* (عنده) by which he abhors himself *in the sight of Allah* (عِنْدَ الله) in his witnessing (شهوده) in the Hereafter. Thus, it is the greatest abhorrence *in the sight of Allah* compared to another abhorrence. It is not that Allah abhors him, but rather he abhors himself *in the sight of Allah* when he returns to Him. Abhorrence has degrees, some greater than others, and this is one of the greatest degrees *in his sight*.\n\nThis recitation (الهجير) unveils this knowledge (العلم) for him, for people take this verse in a way other than its true meaning, saying that Allah abhors them, without realizing His saying: <<عِنْدَ الله>> (in the sight of Allah)—meaning, you will abhor yourselves with the greatest abhorrence *in the sight of Allah* when you return to Him.\n\nIf he said something whose validity he did not believe, and did not say it out of faith, then that is the hypocrite (المنافق). But if he said it out of faith yet did not act, that is the negligent one (المفرط), and he is the one whose abhorrence is great *in the sight of Allah*, because his faith demanded the act, yet he failed to perform it. <<وَلَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ>> (And if they had done what they were exhorted to do) through their own tongues and the tongues of others, <<لَكَانَ خَيْرًا لَهُمْ وَأَشَدَّ تَثْبِيتًا>> (it would have been better for them and a stronger confirmation), <<وَآتَاهُمُ اللَّهُ أَجْرًا عَظِيمًا>> (and Allah would have given them a great reward). This is because He joined the act (الفعل) to the saying (القول), and thus the combination is greater than the form it takes when separated into a saying without an act, or an act without a saying.\n\nAllah only addresses (أيه) the one possessing this characteristic with the masculine Name [referring to the structure of the address *Ya Ayyuha*] in order to remove them from the judgment of the Name that forsakes (الخاذل). For Allah is only addressed from the Name that has no immediate judgment. The address (التأيه) is of two types: an address by Attribute (الصفة), such as His saying: <<يَا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed) and <<يَا أَيُّهَا الَّذِينَ أُوتُوا الْكِتَابَ>> (O you who were given the Scripture); and an address by Essence (الذات), such as His saying: <<يَا أَيُّهَا النَّاسُ>> (O humankind).\n\nWhenever you hear the address, look at what He addresses *with*, not who He addresses *by*. Act according to what He addresses you with, whether it is avoidance or non-avoidance. For He may address with a command or with a prohibition, just as He says in command: <<يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ>> (O you who have believed, fulfill [your] contracts), and as He says in prohibition: <<يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحِلُّوا شَعَائِرَ اللَّهِ>> (O you who have believed, do not violate the symbols of Allah). Likewise, <<يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ>> (O you who have believed, why do you say what you do not do?).\n\nThis is an address of denial, as if He were saying, in the aspect of command: \"Do what you say,\" and in the aspect of prohibition: \"Do not speak concerning Allah what you do not act upon, for you will abhor your souls *in the sight of Allah* with the greatest abhorrence in that matter, as we have established.\" When such a verse comes, it has an aspect of command and an aspect of prohibition, and this is the correct interpretation. The listener takes it according to what occurs to him at the time, and whichever aspect he takes, whether command or prohibition, he is correct. If he combines both, he reaps the fruit of that and receives two rewards.\n\nAmong people, there is one for whom it is unveiled (يكشف له) in this recitation (الهجير) that the specific saying (القول الخاص) is the one where he attributes the act (الفعل) to himself in his belief, like the Mu'tazilite. He then discovers through his unveiling (كشفه) that the acts belong to Allah, not to him. He abhors himself for having been ignorant of such a matter with the greatest abhorrence *in the sight of Allah* (عِنْدَ الله). The phrase *in the sight of Allah* here refers to the presence of Witnessing (عندية الشهود), whether it occurs in this world or the Hereafter. His abhorrence in this world is a turning away from that [belief], leading him to happiness and joining the ranks of the Gnostics (العلماء). This differs from his abhorrence *in the sight of Allah* in the Hereafter. It is as if He is saying: \"O you who have believed, why do you say that the act belongs to you, when it is not so? Thus, you attributed to yourselves what you do not do. <<وَكَبُرَ مَقْتًا مِنْكُمْ عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ>> (And it is greatly hateful from you in the sight of Allah that you say what you do not do).\"\n\n<<إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ>> (Indeed, Allah loves those who fight in His cause)—for He is upon a straight path—this is the contender to whom we say that the act belongs to the Real (الحق), <<صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ>> (in ranks as though they were a structure joined firmly), without flaw, attributing all acts to Allah, not to the one in whom they appear. Successful indeed is the one whose recitation (هجيره) is this verse, for there is no benefit in recitation unless it opens up [knowledge] for its practitioner. If you see a person of recitation for whom nothing is opened, know that he is a person whose outer tongue does not agree with his inner tongue. And one who is in this state is not the one we mean by the people of recitations. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو نوے، اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اللہ کے نزدیک یہ سخت ناپسندیدہ بات ہے کہ تم وہ کہو جو تم کرتے نہیں ہو۔\" (سورۃ الصف: ۳)\n\nاللہ کی جانب سے ناپسندیدگی (مقت) بڑی ہے، اسی لیے\nمخلوق کی جانب سے بھی ناپسندیدگی بڑی ہے۔\nپس جس نے کوئی خوبصورت اور اچھا قول کہا، پھر اس پر عمل نہ کیا،\nاللہ اس قول کے ذریعے اپنی مخلوق میں عمل کرواتا ہے،\nجبکہ وہ (قائل) خیر کے ہر فن میں اس سے بے خبر رہتا ہے۔\nپس کُن (ہو جا) کے لفظ سے وجودِ کائنات میں اس پر غور کر۔\n\n### [یہ کہ وہ افعال جو خارج میں متحقق ہیں، وہ صرف اللہ کے لیے ہیں]\n\nجان لو، اللہ ہمیں اور آپ کو اپنی روح سے تقویت دے، کہ اللہ نے افعال کو مخلوق کی طرف صرف اس لیے منسوب کیا ہے کہ جس کی طرف فعل منسوب کیا گیا ہے، اس کی باطنی ہویت (ہوية باطنه) عین الحق (ذات حق) ہے۔ لہٰذا فعل صرف اللہ کے لیے ہوتا ہے۔ مگر اللہ کے بندوں میں سے کچھ ایسے ہیں جنہیں اس کا شہود (الشہود) کرایا گیا ہے، اور کچھ ایسے ہیں جنہیں یہ شہود نہیں کرایا گیا۔ پس جسے اس کا شہود کرایا گیا، اور اس نے کہا کہ فعل کا ہونا ممکن نہیں اور نہ ہی وہ ہوا، تو وہ قطعی شہود (الشہود) پر عمل کرتا ہے کہ فعل کا وقوع صرف اس لیے رکا کہ وہ امکان عقلی (الإمكان العقلي) سے خارج تھا۔ کیونکہ اس نے اس کی کوئی صورت اعیان ثابتہ (الأعين الثابتة) میں نہیں دیکھی جنہوں نے اللہ کو علم عطا کیا۔ تو پھر وجود میں وہ چیز کیسے واقع ہو سکتی ہے جس کی ثبوت میں کوئی عین (صورت) نہ ہو؟\n\nاسی لیے اس (آیت) میں مقت (ناپسندیدگی) کی نسبت \"عِنْدَ الله\" (اللہ کے نزدیک) کی طرف کی گئی ہے۔ کیونکہ یہ اسم (اللہ) اسماء کے احکام میں متضاد احکام کو جمع کرنے والا ہے۔ جن چیزوں پر یہ دلالت کرتا ہے ان میں سے ایک امکان (الإمكان) کا اثبات ہے۔ پس وہ اس حیثیت سے مقت کرتا ہے جہاں سے امکان کا اثبات ہوتا ہے۔ لہٰذا یہاں \"اللہ\" ایک خاص معین اسم ہے، اور وہ ہے امکان کا اثبات کرنے والا۔ اور اس کے مقابل امکان کا نفی کرنے والا ہے جو کہتا ہے کہ وہاں وجوب کے سوا کچھ نہیں، مگر وہ مقید اور مطلق ہے۔ لہٰذا اس اسم \"اللہ\" کا اطلاق صحیح نہیں ہے۔ پس جب یہ کہا جائے تو اس سے مراد تقیید (پابندی) ہوتی ہے، اور یہ اس چیز سے ظاہر ہوتا ہے جس پر حال دلالت کرتا ہے۔ پس معلوم ہو جاتا ہے کہ یہ اسماء میں سے کس چیز کا نائب بنا ہے، پھر اس اسم کے حکم پر غور کیا جاتا ہے تو اس کا اثر اس میں پایا جاتا ہے۔\n\nمقت (ناپسندیدگی) کا تعلق اس شخص سے ہے جس نے کوئی ایسی اچھی بات کہی جس کا کرنا اس کے لیے ممکن تھا مگر اس نے وہ نہیں کیا۔ پس اس اچھے قول پر غور کرو، یہ لازمی ہے کہ وہ اپنے قائل کے لیے خیر میں اپنا پھل لائے، خاص طور پر اگر وہ اللہ کے بندوں میں سے کسی عامل (عمل کرنے والے) کو عمل عطا کر دے، مگر وہ (قائل) محروم ہے۔ پس اللہ کے نزدیک یہ صرف اس لیے بڑا ہوتا ہے کہ اس قائل نے یہ قول کہا اور جو کہا وہ نہیں کیا، جب وہ فعل کو ترک کرنے کی وجہ سے جس خیر سے محروم ہوا اس پر مطلع ہوتا ہے، تو وہ خود اپنے آپ سے سب سے بڑی ناپسندیدگی (مقت) کرتا ہے۔ خاص طور پر جب وہ دیکھے کہ کوئی دوسرا اس قول پر عمل کر کے فائدہ اٹھا چکا ہے۔ پس یہ اس کے نزدیک سب سے بڑی ناپسندیدگی ہے جس کے ذریعے وہ آخرت میں اپنے شہود (الشہود) میں اللہ کے نزدیک خود اپنے آپ سے مقت کرتا ہے۔ پس یہ اللہ کے نزدیک سب سے بڑا مقت ہے، کسی دوسرے مقت کے مقابلے میں۔ یہ نہیں کہ اللہ نے اس سے مقت کیا، بلکہ جب وہ اللہ کی طرف لوٹتا ہے تو وہ خود اپنے آپ سے اللہ کے نزدیک مقت کرتا ہے۔ اور مقت کے درجات ہیں، بعض بعض سے بڑے ہیں۔ اور یہ (مذکورہ صورت) اس کے نزدیک سب سے بڑے درجات میں سے ہے۔\n\nپس یہ تکرار (الہجیر) اس علم کو اس کے لیے منکشف کرتا ہے۔ کیونکہ لوگ اس آیت کو اس کے اصل مفہوم کے علاوہ لیتے ہیں، اور کہتے ہیں کہ اللہ نے ان سے مقت کیا، حالانکہ وہ اللہ تعالیٰ کے قول \"عِنْدَ الله\" (اللہ کے نزدیک) کی حقیقت کو نہیں سمجھتے۔ یعنی جب تم اس کی طرف لوٹو گے تو تم خود اپنے آپ سے اللہ کے نزدیک سب سے بڑا مقت کرو گے۔ اگر کسی نے ایسی بات کہی جس کے صحیح ہونے کا وہ اعتقاد نہیں رکھتا تھا اور اس نے اسے ایمان کی بنا پر نہیں کہا، تو وہ منافق (المنافق) ہے۔ اور اگر اس نے اسے ایمان کی بنا پر کہا مگر عمل نہیں کیا، تو وہ کوتاہی کرنے والا (المفرط) ہے، اور یہی وہ ہے جس کی ناپسندیدگی اللہ کے نزدیک بڑی ہوتی ہے، کیونکہ اس کا ایمان اسے عمل کا تقاضا کرتا تھا مگر اس نے عمل نہیں کیا۔\n\nاور لَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ لَكَانَ خَيْرًا لَهُمْ وَأَشَدَّ تَثْبِيتًا (اور اگر وہ کر گزرتے جس کی انہیں نصیحت کی جاتی ہے تو یہ ان کے لیے بہتر ہوتا اور زیادہ مضبوطی کا باعث ہوتا) [النساء: ۶۶] اور اللہ انہیں اجرِ عظیم عطا کرتا۔ کیونکہ اس نے فعل کو قول کے ساتھ جوڑا، پس اجتماع کی وجہ سے عظمت پیدا ہوئی، اس صورت کے مقابلے میں جب وہ صرف قول ہو بغیر فعل کے، یا فعل ہو بغیر قول کے۔ اور اللہ نے اس صفت والے شخص کو صرف مذکر اسم (الاسم المذكر) کے ذریعے پکارا (تأیہ) تاکہ انہیں خاذل (ترک کرنے والے) اسم کے حکم سے نکال دے۔ کیونکہ اللہ صرف اس اسم سے پکارتا ہے جس کا حال میں کوئی حکم نہ ہو۔ اور پکار (التأيه) دو قسم کی ہوتی ہے: صفت کے ذریعے پکار، جیسے اس کا قول: يَا أَيُّهَا الَّذِينَ آمَنُوا (اے ایمان والو) اور يَا أَيُّهَا الَّذِينَ أُوتُوا الْكِتَابَ (اے وہ لوگو جنہیں کتاب دی گئی)، اور ذات کے ذریعے پکار، جیسے اس کا قول: يَا أَيُّهَا النَّاسُ (اے لوگو)۔\n\nپس جب بھی تم پکار (التأيه) سنو، تو اس پر غور کرو کہ کس چیز کے ذریعے پکارا گیا ہے، نہ کہ کس نے پکارا ہے۔ پس اس کے مطابق عمل کرو جس کے ذریعے پکارا گیا ہے، خواہ وہ اجتناب ہو یا غیر اجتناب۔ کیونکہ کبھی کسی امر کے ذریعے پکارا جاتا ہے اور کبھی کسی نہی (ممانعت) کے ذریعے، جیسا کہ تم امر میں کہتے ہو: يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ (اے ایمان والو! عہدوں کو پورا کرو) [المائدہ: ۱]، اور جیسا کہ وہ نہی میں کہتا ہے: يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحِلُّوا شَعَائِرَ اللَّهِ (اے ایمان والو! اللہ کی نشانیوں کو حلال نہ ٹھہراؤ) [المائدہ: ۲]۔ اور اسی طرح: يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ (اے ایمان والو! تم وہ بات کیوں کہتے ہو جو کرتے نہیں ہو؟) [الصف: ۲]۔ یہ انکار کی پکار ہے، گویا وہ امر میں کہہ رہا ہے: جو تم کہتے ہو وہ کرو، اور نہی میں: اللہ پر وہ بات نہ کہو جس پر تم عمل نہیں کرتے۔ کیونکہ جیسا کہ ہم نے واضح کیا، تم اس میں خود اپنے آپ سے اللہ کے نزدیک سب سے بڑا مقت کرتے ہو۔ پس جب ایسی کوئی چیز آئے تو اس کے لیے امر کا بھی پہلو ہوتا ہے اور نہی کا بھی۔ اور یہی وہ پہلو ہے جسے سننے والا اس وقت کے مطابق اختیار کرتا ہے جو اس پر واقع ہوتا ہے۔ اور وہ امر یا نہی میں سے جو بھی پہلو اختیار کرے گا، وہ درست ہو گا، اور اگر وہ دونوں کو جمع کر لے تو اس کا پھل پائے گا اور اسے دوہرا اجر ملے گا۔\n\nاور لوگوں میں سے کچھ ایسے ہیں جن پر اس تکرار (الہجیر) میں یہ منکشف (الکشف) ہوتا ہے کہ یہ خاص قول (القول الخاص) ہے، اور وہ یہ کہ وہ اپنے اعتقاد میں فعل کو اپنی طرف منسوب کر کے کہتا ہے، جیسے معتزلی (المعتزلي)۔ پس وہ اپنے کشف (الکشف) میں اس پر مطلع ہوتا ہے کہ افعال اللہ کے لیے ہیں، اس کے لیے نہیں ہیں۔ پس وہ خود اپنے آپ سے مقت کرتا ہے کہ اس نے ایسی چیز سے جہالت برتی، اور یہ اللہ کے نزدیک سب سے بڑا مقت ہوتا ہے۔ اور یہاں \"عِنْدَ الله\" (اللہ کے نزدیک) سے مراد شہود کی عندیت (عندیۃ الشہود) ہے، خواہ وہ دنیا میں ہو یا آخرت میں۔ پس دنیا میں اس کا مقت اس سے رجوع کرنا ہے، تو وہ کامیاب ہوتا ہے اور علماء سے جا ملتا ہے، بخلاف آخرت میں اللہ کے نزدیک اس کے مقت کے۔ پس گویا وہ کہہ رہا ہے: يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ (اے ایمان والو! تم کیوں کہتے ہو) کہ فعل تمہارے لیے ہے، حالانکہ ایسا نہیں ہے؟ پس تم نے اپنی طرف وہ منسوب کیا جو لَا تَفْعَلُونَ (تم نہیں کرتے)۔ اور كَبُرَ مَقْتًا (سخت ناپسندیدہ بات ہے) تم سے عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ (اللہ کے نزدیک کہ تم وہ کہو جو تم کرتے نہیں ہو)۔ إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ (بے شک اللہ ان لوگوں سے محبت کرتا ہے جو اس کی راہ میں لڑتے ہیں) کیونکہ وہ صراط مستقیم (صراط مستقیم) پر ہے۔ یہ ان لوگوں سے منازعت (بحث) ہے جنہیں ہم کہتے ہیں کہ فعل الحق (ذات حق) کے لیے ہے، صَفًّا (صف بستہ) جس میں کوئی خلل نہیں، كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ (گویا کہ وہ سیسہ پلائی ہوئی دیوار ہیں) جس میں کوئی خلل نہیں۔ پس وہ تمام افعال کو اللہ کی طرف منسوب کرتے ہیں، نہ کہ اس کی طرف جس میں وہ ظاہر ہوئے ہیں۔ پس وہ شخص کامیاب ہوا جس کا ورد (ہجیر) یہ آیت تھی، کیونکہ ورد (ہجیر) کا کوئی فائدہ نہیں جب تک کہ وہ اپنے صاحب کے لیے اس میں کشف نہ کھول دے۔ پس جب تم کسی ورد کرنے والے کو دیکھو کہ اس پر کشف نہیں کھلتا، تو جان لو کہ وہ صرف ظاہری زبان کا ورد کرنے والا ہے جس کی باطنی زبان اس سے موافقت نہیں رکھتی۔ اور جو اس مقام پر ہو، وہ ہمارے اصحابِ ہجیرات (ورد کرنے والوں) میں مقصود نہیں ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے) [الأحزاب: ۴]۔",
    "fa": "باب چهارصد و نودم در معرفت حال قطبی که منزل او «بزرگ است خشمی (مَقْتاً) نزد خدا که بگویید آنچه را انجام نمی‌دهید» (كَبُرَ مَقْتاً عِنْدَ الله أَنْ تَقُولُوا ما لا تَفْعَلُونَ).\n\nمقت (خشم) از سوی حق (الله) بزرگ شد، از این رو *** مقت از سوی خلق نیز بزرگ شد. پس هر کس\nسخنی گفت و سپس بدان عمل نکرد *** از کارهای نیکو، و آن سخن نیکوست\nخداوند آن را در خلق خود به کار می‌بندد *** در حالی که او در هر فنّی از آن آگاه نیست\nاز فنون خیر، پس در آن بینا شو *** در هستی (وجود) کائنات از کلمه «باش» (كن).\n\n[اینکه افعالی که در خارج محقق می‌شوند، جز برای خدا نیستند]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که خداوند افعال را به خلق نسبت نداد مگر به این دلیل که کسی که فعل به او نسبت داده شده، هویت باطنی‌اش عین حق (الحق) است؛ پس فعل جز برای خدا نیست. با این حال، برخی از بندگان خدا هستند که خداوند این امر را به شهود (الشهود) آن‌ها رسانده و برخی دیگر که به شهود آن‌ها نرسانده است. پس کسی که این امر به شهود او رسیده و می‌گوید: «ممکن نیست فعلی باشد و انجام نشود»، با قطعیت و شهود (الشهود) عمل می‌کند که وقوع فعل تنها به دلیل خروج از امکان عقلی (الإمكان العقلي) ممتنع شده است؛ زیرا او برای آن صورتی در اعیان ثابته (الأعين الثابتة) که علم را به خدا داده‌اند، ندیده است. پس چگونه چیزی که در ثبوت (الثبوت) عین ندارد، در هستی (الوجود) واقع شود؟ و به همین دلیل، مقت (خشم) در این مورد به «نزد خدا» نسبت داده شده است. زیرا این اسم (الله) جامع متقابلات از احکام اسماء است. از جمله آنچه بر آن دلالت دارد، اثبات امکان است. پس از حیث اثبات امکان، مورد مقت قرار می‌گیرد. پس «الله» در اینجا اسم خاص معینی است و آن اثبات‌کننده امکان است. و مقابل آن، نفی‌کننده امکان است که می‌گوید: «جز وجوب نیست، هرچند مقید و مطلق است.» پس اطلاق این اسم «الله» صحیح نیست. بنابراین، اگر گفته شود، مراد از آن تقیید است و با آنچه حال بر آن دلالت می‌کند، آشکار می‌شود.\n\nپس دانسته می‌شود که این اسم از کدام یک از اسماء نیابت کرده است. سپس در حکم آن اسم نگریسته می‌شود و اثر آن در آن یافت می‌گردد. مقت (خشم) به کسی تعلق می‌گیرد که سخن نیکی بگوید که انجام آن برایش ممکن است، اما آن را انجام ندهد. پس بنگر به آن سخن نیکو که ناگزیر باید ثمره خود را در خیر برای گوینده‌اش به بار آورد، به ویژه اگر در عاملی از بندگان خدا عملی را ایجاد کند، جز اینکه او (گوینده) محروم است. این امر نزد خدا بزرگ شمرده نمی‌شود مگر به این دلیل که این گوینده این سخن را گفته و آنچه را گفته انجام نداده است. هنگامی که او بر خیری که به دلیل ترک فعل از آن محروم شده است، آگاه می‌شود، نفس خود را به بزرگترین مقت (خشم) دچار می‌سازد، به ویژه اگر ببیند دیگری از آن عمل بهره‌مند شده است. این بزرگترین مقت نزد اوست که نفس خود را در شهود (الشهود) آخرت نزد خدا بدان مقت می‌سازد. پس این بزرگترین مقت نزد خداست، نه اینکه خدا او را مقت کرده باشد، بلکه اوست که نفس خود را نزد خدا مقت می‌کند، هنگامی که به سوی او باز می‌گردد. و مقت دارای درجاتی است که برخی از برخی دیگر بزرگترند، و این (مقت) از بزرگترین آن‌ها نزد اوست. این علم، این هجیر (تکرار آیه) را برای او آشکار می‌سازد. زیرا مردم در مورد این آیه برداشت دیگری دارند و می‌گویند: «خداوند آن‌ها را مقت کرده است.» در حالی که قول خداوند متعال را محقق نمی‌سازند: «نزد خدا» (عِنْدَ الله)؛ یعنی شما نفوس خود را به بزرگترین مقت نزد خدا دچار می‌سازید، هنگامی که به سوی او باز می‌گردید. اگر کسی چیزی را بگوید که صحت آن را باور ندارد و آن را از روی ایمان نگفته باشد، او منافق است. و اگر آن را از روی ایمان گفته باشد و عمل نکرده باشد، او مفرط (کوتاهی‌کننده) است، و او کسی است که مقتش نزد خدا بزرگ شمرده می‌شود، زیرا ایمانش او را به فعل وادار می‌کند، اما او انجام نداده است. و «اگر آنان آنچه را بدان موعظه می‌شوند، بر زبان خود و زبان دیگران انجام می‌دادند، قطعاً برایشان بهتر و در تثبیت (ایمان) شدیدتر بود» (لَوْ أَنَّهُمْ فَعَلُوا ما يُوعَظُونَ به... لَكانَ خَيْراً لَهُمْ وأَشَدَّ تَثْبِيتاً) و خداوند به آنان پاداشی بزرگ می‌داد، زیرا فعل را به قول اضافه کرد. پس با اجتماع (قول و فعل) عظمت یافت، برخلاف صورتی که تنها با قول بدون فعل یا فعل بدون قول باشد. و خداوند کسی را که این صفت را دارد، جز با اسم مذکر مورد خطاب (تأیه) قرار نداد تا آن‌ها را از حکم اسم خوارکننده دور سازد. زیرا خداوند جز از اسمی که در حال حکمی ندارد، مورد خطاب قرار نمی‌گیرد. و خطاب (التأيه) بر دو نوع است: خطاب به صفت، مانند قول او: «ای کسانی که ایمان آورده‌اید» (يا أَيُّهَا الَّذِينَ آمَنُوا) و «ای کسانی که کتاب به شما داده شده است» (يا أَيُّهَا الَّذِينَ أُوتُوا الْكِتابَ). و خطاب به ذات، مانند قول او: «ای مردم» (يا أَيُّهَا النَّاسُ). پس هرگاه خطاب (التأيه) را شنیدی، باید بنگری که با چه چیزی خطاب می‌کند، نه اینکه چه کسی را خطاب می‌کند. پس بر اساس آنچه با آن خطاب شده‌ای، عمل کن، چه اجتناب باشد و چه غیر اجتناب. زیرا گاهی با امر خطاب می‌شود و گاهی با نهی. چنانکه در امر می‌گویی: «ای کسانی که ایمان آورده‌اید، به پیمان‌ها وفا کنید» (يا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ). و چنانکه در نهی می‌گوید: «ای کسانی که ایمان آورده‌اید، شعائر خدا را حلال نشمارید» (يا أَيُّهَا الَّذِينَ آمَنُوا لا تُحِلُّوا شَعائِرَ الله). و همچنین: «ای کسانی که ایمان آورده‌اید، چرا چیزی را می‌گویید که انجام نمی‌دهید؟» (يا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ ما لا تَفْعَلُونَ). این خطاب (تأیه) انکار است، گویی در امر می‌گوید: «آنچه را می‌گویید انجام دهید» و در نهی می‌گوید: «چیزی را که عمل نمی‌کنید، به خدا نسبت ندهید.» زیرا شما نفوس خود را در این کار به بزرگترین مقت (خشم) نزد خدا دچار می‌سازید، همانطور که توضیح دادیم. پس اگر چنین چیزی آمد، وجهی برای امر و وجهی برای نهی دارد، و این همان وجه است. شنونده آن را بر حسب آنچه در آن زمان برایش پیش می‌آید، می‌پذیرد. و هر وجهی را که در امر یا نهی برگزیند، به صواب رفته است. و اگر هر دو را جمع کند، ثمره آن را درو می‌کند و دو پاداش خواهد داشت.\n\nو برخی از مردم هستند که در این هجیر (تکرار آیه) برایشان کشف (الکشف) می‌شود که آن قول خاص است، و آن این است که در اعتقاد خود، فعل را به خویشتن نسبت دهد، مانند معتزلی (المعتزلي). پس در کشف (الکشف) خود آگاه می‌شود که افعال برای خداست و برای او نیست. پس نفس خود را به بزرگترین مقت (خشم) نزد خدا دچار می‌سازد، زیرا چنین چیزی را نادیده گرفته است. و «نزد خدا» (عِنْدَ الله) در اینجا، عندیت شهود (عندية الشهود) است، چه در دنیا باشد و چه در آخرت. پس مقت او در دنیا، بازگشت از آن (اعتقاد) است، در نتیجه سعادتمند می‌شود و به علما ملحق می‌گردد، برخلاف مقت او نزد خدا در آخرت. پس گویی می‌گوید: «ای کسانی که ایمان آورده‌اید، چرا می‌گویید فعل از آن شماست، در حالی که چنین نیست؟ پس چیزی را به خود نسبت دادید که انجام نمی‌دهید. و بزرگ است خشمی (مَقْتاً) از جانب شما نزد خدا که بگویید آنچه را انجام نمی‌دهید» (يا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ إن الفعل لكم وما هو كذلك فأضفتم إليكم ما لا تَفْعَلُونَ وكَبُرَ مَقْتاً منكم عِنْدَ الله أَنْ تَقُولُوا ما لا تَفْعَلُونَ). «همانا خداوند کسانی را دوست دارد که در راه او می‌جنگند» (إِنَّ الله يُحِبُّ الَّذِينَ يُقاتِلُونَ في سَبِيلِهِ). این (جنگیدن) بر صراط مستقیم (صراط مستقيم) است، یعنی این منازعه‌کنندگان که به آن‌ها می‌گوییم فعل از آن حق (الحق) است، «صفی بدون خلل» (صَفًّا لا خلل فيه) هستند، «گویی بنایی محکم و به هم پیوسته» (كَأَنَّهُمْ بُنْيانٌ مَرْصُوصٌ) که در آن خللی نیست. پس افعال را تماماً به خدا نسبت می‌دهند، نه به کسی که فعل در او ظاهر شده است. پس رستگار شد کسی که هجیر (تکرار) او این آیه باشد، زیرا فایده‌ای برای هجیر نیست مگر اینکه برای صاحبش در آن گشایشی حاصل شود. پس اگر صاحب هجیری را دیدی که در آن گشایشی برایش حاصل نمی‌شود، بدان که او صاحب هجیر زبانی است که ظاهرش با باطنش موافق نیست. و کسی که در این مرتبه باشد، مقصود ما از اصحاب هجیرات نیست. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}