{
  "id": 195,
  "title": {
    "ar": "الباب الخامس والتسعون ومائة في معرفة الشطح",
    "en": "Chapter One Hundred and Ninety-Five: Concerning the Knowledge of the Ecstatic Utterance (الشطح)",
    "ur": "پچانوے اور سو (ایک سو پچانوے) کا باب شطح کی معرفت میں",
    "fa": "باب صد و نود و پنجم در معرفت شطح"
  },
  "content": {
    "ar": "## (الباب الخامس والتسعون ومائة في معرفة الشطح)\n\n\n> الشطح دعوى في النفوس بطبعها *** لبقية فيها من آثار الهوى‏\n\n\n> هذا إذا شطحت بقول صادق *** من غير أمر عند أرباب النهي‏\n\n\n### [أن الشطح كلمة حق تفصح عن مرتبته التي أعطاه الله من المكانة عنده‏]\n\n\nاعلم أيدك الله أن الشطح كلمة دعوى بحق تفصح عن مرتبته التي أعطاه الله من المكانة عنده أفصح بها عن غير أمر إلهي لكن على طريق الفخر بالراء فإذا أمر بها فإنه يفصح بها تعريفا عن أمر إلهي لا يقصد بذلك الفخر\n\n\nقال عليه السلام أنا سيد ولد آدم ولا فخر\n\n\nيقول ما قصدت الافتخار عليكم بهذا التعريف لكن أنبأتكم به لمصالح لكم في ذلك ولتعرفوا منة الله عليكم برتبة نبيكم عند الله والشطح زلة المحققين إذا لم يؤمر به فيقولها كما قالها عليه السلام ولهذا بين فقال ولا فخر فإني أعلم أني عبد الله كما أنتم عبيد الله والعبد لا يفتخر على العبد إذا كان السيد واحدا وكذا نطق عيسى فبدأ بالعبودية وهو بمنزلة قوله عليه السلام ولا فخر فقال لقومه في براءة أمه ولما علم من نور النبوة التي في استعداده أنه لا بد أن يقال فيه إنه ابن لله فقال إِنِّي عَبْدُ الله فبدأ في أول تعريفه وشهادته في الحال الذي لا ينطق مثله في العادة فما أنا ابن لأحد فأمي طاهرة بتول ولست بابن لله كما أنه لا يقبل الصاحبة لا يقبل الولد ولكني عبد الله مثلكم آتانِيَ الْكِتابَ وجَعَلَنِي نَبِيًّا فنطق بنبوته في وقتها عنده وفي غير وقتها عند الحاضرين لأنه لا بد له في وقت رسالته أن يعلم بنبوته كما جرت عادة الله في الأنبياء قبله فهم مأمورون بكل ما يظهر عليهم ومنهم من الدعاوي الصادقة التي تدل على المكانة الزلفى والتميز عن الأمثال والأشكال بالمرتبة المثلى عند الله وجَعَلَنِي مُبارَكاً أي محلا وعلامة على زيادات الخير عندكم أَيْنَ ما كُنْتُ يعني في كل حال من الأحوال ما تختص البركة بسببي فيكم في حال دون حال وذكرها كلها بلفظ الماضي وهو يريد الحال والاستقبال فما كان منه في الحال فنطقه شهادة ببراءة أمه وتنبيها وتعليما لمن يريد أن يقول فيه أنه ابن الله فنزه الله وهو نظير براءة أمه مما نسبوا إليها فهو في جناب الحق تنزيه وفي جناب الأم تبرئة ويدل لفظ الماضي فيه وأَيْنَ ما كُنْتُ أن يكون له التعريف بذلك من الله كما كان لمحمد صلى الله عليه وآله وسلم‏\n\n\nلما قال كنت نبيا وآدم بين الماء والطين‏\n\n\nفعلم مرتبته عند الله وآدم ما وجدت صورته البدنية\n\n\n### [أن عيسى كلمة الله‏]\n\n\nوأعلم عيسى بلفظ الماضي أن الله آتاه الكتاب وأوصاه بالصلاة والزكاة ما دام في عالم التكليف والتشريع وهو قوله ما دُمْتُ حَيًّا يريد حياة التكليف في ظاهر الأمر عند السامعين ويريد عندنا هذا وأمرا آخر وهو قوله تعالى في عيسى إنه كلمة الله والكلمة جمع حروف وسيأتي علم ذلك في باب النفس بفتح الفاء فأخبر أنه آتاه الكتاب يريد الإنجيل ويريد مقام وجوده من حيث ما هو كلمة والكتاب ضم حروف رقمية لإظهار كلمة أو ضم معنى إلى صورة حرف يدل عليه فلا بد من تركيب فلهذا ذكر أن الله أعطاه الكتاب مثل قوله أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ ويريد بالوصية بالصلاة والزكاة العبادة كما تدل على العمل هي على العبادة أدل لأنها لا تفتقر في كونها عبادة إلى بيان وإذا أريد بها العمل احتيج إلى تعيين ذلك العمل وبيان صورته حتى يقيم نشأته هذا المكلف به فإذا كانت العبادة دل على أنه لا يزال حيا أينما كان وإن فارق هذا الهيكل بالموت فالحياة تصحبه لأنها صفة نفسية له ولا سيما وقد جعله روح الله ثم ذكر أنه بر بوالدته أي محسن إليها فأول إحسانه أنه برأها مما نسب إليها في حالة لا يشكون في أنه صادق في ذلك التعريف ثم تمم فقال ولَمْ يَجْعَلْنِي جَبَّاراً فإن الجبروت وهو العظمة يناقض العبودة وهو قوله إنه عبد الله‏\nويريد بقوله جَبَّاراً أي لا أجبر الأمة التي أرسل إليها بالكتاب والصلاة والزكاة إنما أنا مبلغ عن الله لا غير لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ فأكون جبارا فأجبر وأبلغ عن الله كما قال يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ وما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ إِنَّما أَنْتَ مُذَكِّرٌ لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ فقوله مذكر والمذكر لا يكون إلا لمن كان على حالة منسية ولو لم يكن كذلك لكان معلما لا مذكرا فدل أنه لا يذكرهم إلا بحال إقرارهم بربوبيته تعالى عليهم حين قبض الذرية من ظهر آدم في الميثاق الأول ثم قال والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ بما نطقت فيكم به من أني عبد الله فسلمت من انتساب وجودي إلى سفاح أو نكاح ويَوْمَ أَمُوتُ فأسلم من وقوع القتل الذي ينسب إلى من يزعم أنه قتلني وهو قول بنى إسرائيل إِنَّا قَتَلْنَا الْمَسِيحَ (عِيسَى) ابْنَ مَرْيَمَ فأكذبهم الله فقال وما قَتَلُوهُ وما صَلَبُوهُ ولكِنْ شُبِّهَ لَهُمْ فقال لهم إن السلام عليه يوم يموت سالما من القتل إذ لو قتل قتل شهادة والشهيد حي غير ميت ولا يقال فيه إنه ميت كما ورد النهي عن ذلك عندنا وكذلك لم يزل الأمر فأخبر أنه يموت ولا يقتل فذكر السلام عليه يوم يموت ثم ذكر أن السلام عليه يوم يبعث حيا يعني في القيامة وهو موطن سلامة الأبرياء من كل سوء مثل الأنبياء وغيرهم من أهل العناية فهو صاحب سلامة في هذه المواطن كلها وما ثم موطن ثالث ما هي إلا حياة دنيا وحياة أخرى بينهما موت فهذه كلها لو لم تكن عن أمر إلهي لكانت من قائلها شطحات فإنها كلمات تدل على الرتبة عند الله على طريق الفخر بذلك على الأمثال والأشكال وحاشا أهل الله أن يتميزوا عن الأمثال أو يفتخروا ولهذا كان الشطح رعونة نفس فإنه لا يصدر من محقق أصلا فإن المحقق ما له مشهود سوى ربه وعلى ربه ما يفتخر وما يدعي بل هو ملازم عبوديته مهيا لما يرد عليه من أوامره فيسارع إليها وينظر جميع من في الكون بهذه المثابة فإذا شطح فقدا تحجب عما خلق له وجهل نفسه وربه ولو انفعل عنه جميع ما يدعيه من القوة فيحيي ويميت ويولي ويعزل وما هو عند الله بمكان بل حكمه في ذلك حكم الدواء المسهل أو القابض يفعل بخاصية الحال لا بالمكانة عند الله كما يفعل الساحر بخاصية الصنعة في عيون الناظرين فيخطف أبصارهم عن رؤية الحق فيما أتوا به وكل من شطح فعن غفلة شطح وما رأينا ولا سمعنا عن ولي ظهر منه شطح لرعونة نفس وهو ولي عند الله إلا ولا بد أن يفتقر ويذل ويعود إلى أصله ويزول عنه ذلك الزهو الذي كان يصول به فذلك لسان حال الشطح هذا إذا كان بحق هو مذموم فكيف لو صدر من كاذب فإن قيل وكيف صورة الكاذب في الشطح مع وجود الفعل والأثر منه قلنا نعم ما سألت عنه أما صورة الكاذب في ذلك فإن أهل الله ما يؤثرون إلا بالحال الصادق إذا كانوا أهل الله وذلك المسمى شطحا عندهم حيث لم يقترن به أمر إلهي أمر به كما تحقق ذلك عن الأنبياء عليهم السلام فمن الناس من يكون عالما بخواص الأسماء فيظهر بها الآثار العجيبة والانفعالات الصحيحة ولا يقول إن ذلك عن أسماء عنده وإنما يظهر ذلك عند الحاضرين أنه من قوة الحال والمكانة عند الله والولاية الصادقة وهو كاذب في هذا كله وهذا لا يسمى شطحا ولا صاحبه شاطحا بل هو كذب محض ممقوت فالشطح كلمة صادقة صادرة من رعونة نفس عليها بقية طبع تشهد لصاحبها يبعده من الله في تلك الحال وهذا القدر كاف في حال معرفة الشطح‏\n\n",
    "en": "Chapter One Hundred and Ninety-Five: Concerning the Knowledge of the Ecstatic Utterance (الشطح)\n\nThe Ecstatic Utterance is a claim arising naturally in the souls,\nDue to a remnant therein of the traces of caprice.\n\nThis is when the utterance is made with a truthful saying,\nWithout a command, according to the people of discernment.\n\n### [That the Ecstatic Utterance (الشطح) is a word of truth that expresses the rank which God has granted him in His presence.]\n\nKnow, may God strengthen you, that the Ecstatic Utterance (الشطح) is a word of rightful claim that expresses the rank which God has granted him in His presence. He expresses it without a Divine command, but rather by way of boasting. However, if he is commanded to speak it, he expresses it as a declaration of a Divine command, intending no boast thereby.\n\nThe Prophet, peace be upon him, said: \"I am the Master of the Children of Adam, and no boast.\"\n\nHe means: \"I did not intend to boast to you by this declaration, but rather I informed you of it for your own benefit, and so that you may know God’s favor upon you through the rank of your Prophet in the presence of God.\" The Ecstatic Utterance is the slip of the Realized Ones (المحققين) if they are not commanded to speak it, even if they say it as the Prophet said it, peace be upon him. This is why he clarified by saying, \"and no boast,\" for \"I know that I am the servant of God, just as you are the servants of God, and a servant does not boast over another servant when the Master is one.\"\n\nSimilarly, Jesus spoke, beginning with Servitude (العبودية), which is equivalent to the Prophet’s saying, \"and no boast.\" He spoke to his people concerning the exoneration of his mother, and because he knew, through the light of Prophethood inherent in his disposition, that it would inevitably be said of him that he was the son of God, he said: <<إِنِّي عَبْدُ الله>> (Indeed, I am the servant of Allah). Thus, he began his first declaration and testimony in a state where one does not usually speak like that. [He meant:] \"I am not the son of anyone; my mother is pure and a virgin. Nor am I the son of God, for just as He does not accept a consort, He does not accept a son. Rather, I am the servant of God, just like you. <<آتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيًّا>> (He has given me the Scripture and made me a Prophet).\" He spoke of his prophethood at the time appointed for it in God’s sight, though it was not the appointed time in the sight of those present. This is because, at the time of his mission, he necessarily had to know of his prophethood, as was God’s custom with the Prophets before him. They are commanded concerning everything that appears from them, including the truthful claims that indicate their high station and their distinction from their peers and counterparts by the most excellent rank in the presence of God.\n\n[He also said:] <<وَجَعَلَنِي مُبَارَكًا>> (And He has made me blessed), meaning a locus and a sign of the increase of goodness among you, <<أَيْنَ مَا كُنْتُ>> (wherever I may be), meaning in every state of affairs, so that the blessing through me among you is not restricted to one state over another. He mentioned all of this using the past tense, yet intending the present and the future. What was present in his state was his utterance, which was a testimony to the exoneration of his mother, and a warning and instruction to anyone who might wish to say that he was the son of God. Thus, he declared God’s transcendence (تنزيه), which is analogous to the exoneration of his mother from what they attributed to her. Therefore, in relation to the side of the Real (الحق), it is a declaration of transcendence, and in relation to his mother, it is an acquittal. The use of the past tense and the phrase <<أَيْنَ مَا كُنْتُ>> (wherever I may be) indicates that this declaration was given to him by God, just as it was given to Muhammad, peace and blessings be upon him and his family, when he said: \"I was a Prophet while Adam was between water and clay.\" Thus, he knew his rank in the presence of God even before Adam’s physical form had come into existence.\n\n### [That Jesus is the Word of God (كلمة الله)]\n\nJesus informed us, using the past tense, that God gave him the Scripture and enjoined upon him prayer and almsgiving as long as he remained in the world of obligation and legislation, which is indicated by his saying: <<مَا دُمْتُ حَيًّا>> (as long as I live). He intends the life of obligation in the apparent sense for the listeners, but for us, he intends this and another matter, which is God’s saying concerning Jesus, that he is the Word of God (كلمة الله). The Word is a collection of letters, and the knowledge of this will come in the chapter on the Soul (النفس). He informed us that He gave him the Scripture, meaning the Gospel, and also meaning the station of his existence insofar as he is a Word. The Scripture is the joining of numerical letters to manifest a word, or the joining of a meaning to the form of a letter that indicates it. Thus, composition is necessary. For this reason, he mentioned that God gave him the Scripture, similar to God’s saying: <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (He gave everything its creation). By enjoining prayer and almsgiving, he means Servitude (العبادة). While these terms indicate action, they indicate Servitude more strongly, because their status as Servitude does not require clarification. If action were intended, it would require specifying that action and clarifying its form so that the obligated person could establish its manifestation. Since Servitude is intended, it indicates that he remains alive wherever he may be, and even if he departs this physical structure through death, life accompanies him because it is an essential attribute of his soul, especially since God made him the Spirit of God (روح الله).\n\nThen he mentioned that he was dutiful to his mother (بر بوالدته), meaning benevolent toward her. His first benevolence was that he acquitted her of what was attributed to her, in a state where they could not doubt the truthfulness of that declaration. Then he completed his statement by saying: <<وَلَمْ يَجْعَلْنِي جَبَّارًا>> (Nor has He made me a tyrant). Tyranny (الجبروت), which is grandeur, contradicts Servitude (العبودة), which is his saying that he is the servant of God. By saying <<جَبَّارًا>> (tyrant), he means: \"I will not compel the community to whom I was sent with the Scripture, prayer, and almsgiving. I am merely a conveyor from God, nothing more.\" [This is like the address to the Prophet:] \"You are not a controller over them (لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ).\" Thus, I would be a tyrant, compelling them, whereas I only convey from God, as He said: <<يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنزِلَ إِلَيْكَ>> (O Messenger, convey what has been revealed to you), and <<وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ>> (And upon the Messenger is only the conveyance), and <<إِنَّمَا أَنتَ مُذَكِّرٌ لَّسْتَ عَلَيْهِم بِمُصَيْطِرٍ>> (You are only a reminder; you are not a controller over them). His saying \"a reminder\" (مُذَكِّرٌ) implies that a reminder is only for one who was in a forgotten state. If it were not so, he would be a teacher, not a reminder. This indicates that he only reminds them of the state of their affirmation of God’s Lordship over them when He took the progeny from Adam’s loins in the First Covenant.\n\nThen he said: <<وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ>> (And peace is upon me the day I was born), due to my utterance among you that I am the servant of God, whereby I was safe from the attribution of my existence to fornication or ordinary marriage. And <<وَيَوْمَ أَمُوتُ>> (and the day I die), whereby I will be safe from the occurrence of the killing attributed to those who claim to have killed me, which is the saying of the Children of Israel: <<إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ>> (Indeed, we killed the Messiah, Jesus, son of Mary). God refuted them, saying: <<وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَكِنْ شُبِّهَ لَهُمْ>> (And they did not kill him, nor did they crucify him; but it was made to appear to them so). So, Jesus told them that peace is upon him the day he dies, safe from being killed, for if he were killed, it would be a martyr’s death, and the martyr is alive, not dead, and it is forbidden for us to say that he is dead. The matter has always been thus. So, he informed us that he will die, but not be killed. Thus, he mentioned peace upon him the day he dies. Then he mentioned that peace is upon him <<وَيَوْمَ أُبْعَثُ حَيًّا>> (and the day I am raised alive), meaning on the Day of Resurrection, which is the station of safety for the innocent from all harm, such as the Prophets and others among the people of Divine care. Thus, he possesses safety in all these stations. There is no third station; there is only the life of this world and the life of the Hereafter, with death between them.\n\nAll these statements, had they not been by Divine command, would have been Ecstatic Utterances (شطحات) from the one who spoke them, for they are words that indicate rank in the presence of God by way of boasting over peers and counterparts. But God’s people (أهل الله) are far removed from distinguishing themselves from their peers or boasting. For this reason, the Ecstatic Utterance is a recklessness of the soul (رعونة نفس), as it never issues from a Realized One (محقق) in the first place. The Realized One witnesses nothing but his Lord, and he does not boast or make claims concerning his Lord. Rather, he adheres strictly to his Servitude (عبوديته), prepared for whatever commands come to him, hastening to fulfill them, and viewing everyone in the cosmos as being in the same position. If he makes an Ecstatic Utterance, he has become veiled from that for which he was created, and he has become ignorant of himself and his Lord. Even if all the power he claims were to manifest through him—so that he gives life and causes death, appoints and dismisses—this holds no station with God. Rather, his status in this regard is like that of a laxative or constipating medicine, which acts by the property of the state, not by station in the presence of God. It is like the sorcerer who acts by the property of his craft in the eyes of the beholders, snatching their sight away from seeing the truth of what they have brought forth.\n\nEveryone who makes an Ecstatic Utterance does so out of heedlessness. We have neither seen nor heard of a saint (ولي) from whom an Ecstatic Utterance proceeded due to the recklessness of the soul—while remaining a saint in the presence of God—without him inevitably becoming poor, humbled, returning to his origin, and losing that pride by which he was acting. That is the true expression of the Ecstatic Utterance (الشطح). This is when the utterance is truthful, yet it is still blameworthy. What then if it proceeds from a liar? If it is asked: \"What is the form of the liar in the Ecstatic Utterance, given that the action and effect proceed from him?\" We reply: \"Yes, you have asked a good question.\" As for the form of the liar in this matter: God’s people only produce effects through a truthful spiritual state (الحال الصادق) if they are truly God’s people. That which is called an Ecstatic Utterance by them is when it is not accompanied by a Divine command, as was verified concerning the Prophets, peace be upon them. Among people, there are those who possess knowledge of the properties of the Names (خواص الأسماء) and manifest marvelous effects and correct spiritual reactions through them. He does not say that this is due to the Names he possesses, but rather makes it appear to those present that it stems from the strength of his spiritual state, his station in the presence of God, and genuine Sainthood (الولاية الصادقة). Yet, he is a liar in all of this. This is not called an Ecstatic Utterance, nor is its author called one who utters *shath*; rather, it is pure, detestable falsehood. The Ecstatic Utterance (الشطح) is a truthful word proceeding from the recklessness of a soul that retains a remnant of its nature, testifying against its author and distancing him from God in that state. This much suffices for the knowledge of the Ecstatic Utterance.",
    "ur": "## (باب ایک سو پچانوے: شطح کی معرفت میں)\n\nشطح دعویٰ ہے نفوس میں اپنی طبیعت کے سبب سے\nاس میں باقی ماندہ آثارِ ہوس کی وجہ سے\n\nیہ تب ہے جب وہ سچے قول کے ساتھ شطح کرے\nاہلِ عقل کے نزدیک کسی حکم کے بغیر\n\n### [شطح ایک کلمہ حق ہے جو اس مرتبے کو ظاہر کرتا ہے جو اللہ نے اسے اپنے ہاں عطا کیا ہے]\n\nجان لو، اللہ تمہاری مدد کرے، کہ شطح ایک دعویٰ کا کلمہ ہے جو حق کے ساتھ اس مرتبے کو ظاہر کرتا ہے جو اللہ نے اسے اپنے ہاں عطا کیا ہے۔ وہ اسے کسی الٰہی حکم کے بغیر ظاہر کرتا ہے، لیکن فخر (الراء) کے طریقے پر۔ اور جب اسے اس کا حکم دیا جاتا ہے تو وہ اسے الٰہی حکم کی تعریف کے طور پر ظاہر کرتا ہے، اس سے فخر کا ارادہ نہیں کرتا۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: \"أنا سيد ولد آدم ولا فخر\" (میں اولادِ آدم کا سردار ہوں اور کوئی فخر نہیں)۔\n\nآپ صلی اللہ علیہ وسلم فرماتے ہیں کہ میں نے اس تعریف سے تم پر فخر کرنے کا ارادہ نہیں کیا، بلکہ میں نے تمہیں اس سے آگاہ کیا ہے تاکہ اس میں تمہارے لیے کچھ مصلحتیں ہوں اور تاکہ تم اللہ کی اس نعمت کو جانو جو تمہارے نبی کو اللہ کے ہاں حاصل ہے۔ شطح محققین کی لغزش ہے جب انہیں اس کا حکم نہ دیا گیا ہو، تو وہ اسے اسی طرح کہتے ہیں جیسے آپ صلی اللہ علیہ وسلم نے فرمایا، اور اسی لیے آپ نے وضاحت فرمائی اور کہا: \"ولا فخر\" (اور کوئی فخر نہیں)، کیونکہ میں جانتا ہوں کہ میں اللہ کا بندہ ہوں جیسے تم اللہ کے بندے ہو، اور بندہ بندے پر فخر نہیں کرتا جب آقا ایک ہو۔ اسی طرح عیسیٰ علیہ السلام نے بھی کلام کیا، تو انہوں نے بندگی سے آغاز کیا، اور یہ آپ صلی اللہ علیہ وسلم کے قول \"ولا فخر\" کے مقام پر ہے۔ انہوں نے اپنی والدہ کی براءت میں اپنی قوم سے کہا، اور چونکہ وہ اپنی استعداد میں موجود نورِ نبوت سے جانتے تھے کہ ان کے بارے میں یہ ضرور کہا جائے گا کہ وہ اللہ کے بیٹے ہیں، تو انہوں نے کہا: \"إِنِّي عَبْدُ الله\" (میں اللہ کا بندہ ہوں)۔ پس انہوں نے اپنی پہلی تعریف اور گواہی میں اس حال میں بندگی سے آغاز کیا جس میں عام طور پر کوئی کلام نہیں کرتا۔ (یعنی) میں کسی کا بیٹا نہیں ہوں، میری والدہ پاک دامن اور کنواری ہیں، اور میں اللہ کا بیٹا نہیں ہوں، کیونکہ وہ نہ تو بیوی کو قبول کرتا ہے اور نہ ہی اولاد کو، لیکن میں تمہاری طرح اللہ کا بندہ ہوں۔ \"آتَانِيَ الْكِتابَ وجَعَلَنِي نَبِيًّا\" (اس نے مجھے کتاب دی ہے اور مجھے نبی بنایا ہے)۔ پس انہوں نے اپنی نبوت کا اعلان اس وقت کیا جو ان کے نزدیک اس کا وقت تھا، اور حاضرین کے نزدیک وہ اس کا وقت نہیں تھا۔ کیونکہ ان کے لیے ضروری تھا کہ وہ اپنی رسالت کے وقت اپنی نبوت کا علم دیں، جیسا کہ ان سے پہلے انبیاء کے بارے میں اللہ کی عادت جاری رہی ہے۔ وہ ہر اس چیز کے اظہار کے مامور ہیں جو ان پر ظاہر ہوتی ہے، اور ان میں سے وہ سچے دعوے بھی ہیں جو اللہ کے ہاں ان کے مقامِ قرب اور دوسروں سے ان کی برتری اور امتیاز کو ظاہر کرتے ہیں۔ \"وجَعَلَنِي مُبارَكاً\" (اور اس نے مجھے بابرکت بنایا ہے)، یعنی تمہارے نزدیک خیر کی زیادتیوں کا محل اور علامت، \"أَيْنَ ما كُنْتُ\" (میں جہاں کہیں بھی ہوں)، یعنی تمام احوال میں، برکت میرے سبب سے تمہارے اندر کسی ایک حال کے ساتھ خاص نہیں ہے۔ اور انہوں نے ان سب کا ذکر ماضی کے صیغے میں کیا ہے، حالانکہ ان کا ارادہ حال اور استقبال کا ہے۔ پس جو کچھ حال میں تھا، وہ ان کا کلام ان کی والدہ کی براءت کی گواہی تھا، اور ان لوگوں کو تنبیہ اور تعلیم تھی جو ان کے بارے میں یہ کہنا چاہتے تھے کہ وہ اللہ کے بیٹے ہیں، تو انہوں نے اللہ کی تنزیہ بیان کی۔ یہ ان کی والدہ کی اس نسبت سے براءت کے مماثل ہے جو ان کی طرف منسوب کی گئی تھی۔ پس یہ جنابِ حق میں تنزیہ ہے اور جنابِ والدہ میں براءت ہے۔ اور اس میں ماضی کا صیغہ اور \"أَيْنَ ما كُنْتُ\" (میں جہاں کہیں بھی ہوں) اس بات پر دلالت کرتا ہے کہ انہیں اس کا تعارف اللہ کی طرف سے حاصل تھا، جیسا کہ محمد صلی اللہ علیہ وآلہ وسلم کو حاصل تھا۔\n\nجب آپ نے فرمایا: \"كنت نبيا وآدم بين الماء والطين\" (میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے)۔\n\nپس آپ نے اللہ کے ہاں اپنے مرتبے کو جان لیا جبکہ آدم کی جسمانی صورت ابھی وجود میں نہیں آئی تھی۔\n\n### [عیسیٰ علیہ السلام کلمۃ اللہ ہیں]\n\nاور عیسیٰ علیہ السلام نے ماضی کے صیغے سے یہ خبر دی کہ اللہ نے انہیں کتاب دی ہے اور انہیں نماز اور زکوٰۃ کی وصیت کی ہے جب تک وہ عالمِ تکلیف اور تشریع میں رہیں گے، اور یہ ان کا قول ہے: \"ما دُمْتُ حَيًّا\" (جب تک میں زندہ رہوں)، وہ سامعین کے نزدیک ظاہری طور پر تکلیف کی زندگی مراد لیتے ہیں، اور ہمارے نزدیک وہ اس کے علاوہ ایک اور امر مراد لیتے ہیں، اور وہ اللہ تعالیٰ کا عیسیٰ علیہ السلام کے بارے میں یہ قول ہے کہ وہ \"كلمة الله\" (اللہ کا کلمہ) ہیں۔ اور کلمہ حروف کا مجموعہ ہوتا ہے، اور اس کا علم بابِ نفس (بفتح الفاء) میں آئے گا۔ پس انہوں نے خبر دی کہ اللہ نے انہیں کتاب دی ہے، اس سے ان کا ارادہ انجیل ہے، اور ان کے وجود کے مقام کا ارادہ ہے اس حیثیت سے کہ وہ ایک کلمہ ہیں۔ اور کتاب رقمی حروف کو جمع کرنا ہے تاکہ ایک کلمہ ظاہر ہو، یا ایک معنی کو ایک حرفی صورت کے ساتھ ملانا ہے جو اس پر دلالت کرے، پس ترکیب ضروری ہے۔ اسی لیے انہوں نے ذکر کیا کہ اللہ نے انہیں کتاب عطا کی، جیسے اس کا قول: \"أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ\" (اس نے ہر چیز کو اس کی تخلیق عطا کی)۔ اور نماز اور زکوٰۃ کی وصیت سے ان کا ارادہ عبادت ہے، جیسا کہ یہ عمل پر دلالت کرتی ہے، یہ عبادت پر زیادہ دلالت کرتی ہے، کیونکہ عبادت ہونے کے لیے اسے بیان کی ضرورت نہیں ہوتی، اور اگر اس سے عمل مراد لیا جائے تو اس عمل کی تعیین اور اس کی صورت کے بیان کی ضرورت ہوتی ہے تاکہ یہ مکلف اس کی نشأت کو قائم کرے۔ پس جب یہ عبادت ہو تو یہ اس بات پر دلالت کرتی ہے کہ وہ جہاں کہیں بھی ہوں گے ہمیشہ زندہ رہیں گے، اگرچہ وہ موت کے ذریعے اس ڈھانچے سے جدا ہو جائیں، کیونکہ زندگی ان کی ایک نفسی صفت ہے، خاص طور پر جب اللہ نے انہیں \"روح اللہ\" بنایا ہے۔ پھر انہوں نے ذکر کیا کہ وہ اپنی والدہ کے ساتھ نیک سلوک کرنے والے ہیں، یعنی ان کے ساتھ احسان کرنے والے ہیں۔ پس ان کا پہلا احسان یہ ہے کہ انہوں نے انہیں اس نسبت سے بری کیا جو ان کی طرف منسوب کی گئی تھی، اس حال میں کہ انہیں اس تعریف میں ان کے سچا ہونے میں کوئی شک نہیں تھا۔ پھر انہوں نے بات مکمل کی اور کہا: \"ولَمْ يَجْعَلْنِي جَبَّاراً\" (اور اس نے مجھے سرکش نہیں بنایا)، کیونکہ جبروت، یعنی عظمت، عبودیت کے منافی ہے، اور یہ ان کا قول ہے کہ وہ اللہ کے بندے ہیں۔\n\nاور ان کا قول \"جَبَّاراً\" (سرکش) سے مراد یہ ہے کہ میں اس امت کو مجبور نہیں کروں گا جس کی طرف مجھے کتاب، نماز اور زکوٰۃ کے ساتھ بھیجا گیا ہے۔ میں صرف اللہ کی طرف سے پہنچانے والا ہوں، اس کے سوا کچھ نہیں۔ \"لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ\" (آپ ان پر داروغہ نہیں ہیں)، پس میں جبار بن کر جبر نہیں کروں گا، بلکہ میں اللہ کی طرف سے پہنچاؤں گا، جیسا کہ اس نے فرمایا: \"يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ\" (اے رسول! جو کچھ آپ پر نازل کیا گیا ہے اسے پہنچا دیجیے) اور \"وما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ\" (اور رسول پر صرف پہنچا دینا ہے)۔ \"إِنَّما أَنْتَ مُذَكِّرٌ لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ\" (آپ تو صرف نصیحت کرنے والے ہیں، آپ ان پر داروغہ نہیں ہیں)۔ پس ان کا قول \"مُذَكِّرٌ\" (نصیحت کرنے والا) ہے، اور نصیحت کرنے والا صرف اس کے لیے ہوتا ہے جو کسی بھولی ہوئی حالت پر ہو، اور اگر ایسا نہ ہوتا تو وہ معلم ہوتا نہ کہ نصیحت کرنے والا۔ پس اس سے یہ ظاہر ہوا کہ وہ انہیں صرف اس حال کی یاد دلاتے ہیں جب انہوں نے میثاقِ اول میں آدم کی پشت سے ذریت کو نکال کر ان پر اللہ تعالیٰ کی ربوبیت کا اقرار کیا تھا۔ پھر انہوں نے کہا: \"والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ\" (اور مجھ پر سلامتی ہو جس دن میں پیدا ہوا)، اس لیے کہ میں نے تم میں یہ کلام کیا کہ میں اللہ کا بندہ ہوں، پس میں اپنے وجود کی نسبت سفاح (زنا) یا نکاح کی طرف ہونے سے محفوظ رہا۔ اور \"يَوْمَ أَمُوتُ\" (اور جس دن میں مروں گا)، پس میں قتل کے واقع ہونے سے محفوظ رہوں گا جس کی نسبت وہ لوگ کرتے ہیں جو یہ گمان کرتے ہیں کہ انہوں نے مجھے قتل کیا، اور یہ بنی اسرائیل کا قول ہے: \"إِنَّا قَتَلْنَا الْمَسِيحَ (عِيسَى) ابْنَ مَرْيَمَ\" (ہم نے مسیح عیسیٰ ابن مریم کو قتل کر دیا)۔ تو اللہ نے انہیں جھٹلایا اور فرمایا: \"وما قَتَلُوهُ وما صَلَبُوهُ ولكِنْ شُبِّهَ لَهُمْ\" (اور نہ انہوں نے اسے قتل کیا اور نہ سولی دی، بلکہ ان کے لیے شبہ پیدا کر دیا گیا)۔ پس انہوں نے ان سے کہا کہ ان پر سلامتی ہے جس دن وہ قتل سے محفوظ رہتے ہوئے مریں گے، کیونکہ اگر وہ قتل ہوتے تو شہادت کا قتل ہوتا، اور شہید زندہ ہوتا ہے، مردہ نہیں ہوتا، اور ہمارے ہاں اس کے بارے میں یہ کہنا منع ہے کہ وہ مردہ ہے۔ اور معاملہ ہمیشہ ایسا ہی رہا۔ پس انہوں نے خبر دی کہ وہ مریں گے اور قتل نہیں ہوں گے۔ پس انہوں نے اس دن سلامتی کا ذکر کیا جس دن وہ مریں گے۔ پھر انہوں نے ذکر کیا کہ ان پر سلامتی ہے جس دن وہ زندہ اٹھائے جائیں گے، یعنی قیامت میں، اور یہ انبیاء اور اہل عنایت میں سے دیگر لوگوں جیسے بے گناہوں کے لیے ہر برائی سے سلامتی کا مقام ہے۔ پس وہ ان تمام مقامات میں سلامتی والے ہیں۔ اور کوئی تیسرا مقام نہیں ہے، یہ صرف دنیا کی زندگی اور آخرت کی زندگی ہے، ان کے درمیان موت ہے۔ یہ سب اگر کسی الٰہی حکم کے تحت نہ ہوتیں تو کہنے والے کی طرف سے شطحات ہوتیں، کیونکہ یہ ایسے کلمات ہیں جو اللہ کے ہاں مرتبے پر دلالت کرتے ہیں، اور یہ دوسروں پر فخر کے طریقے پر ہوتا ہے۔ اور اللہ والوں کو اس سے پاک ہے کہ وہ دوسروں سے ممتاز ہوں یا فخر کریں۔ اسی لیے شطح نفس کی رعونت ہے، کیونکہ یہ کسی محقق سے ہرگز صادر نہیں ہوتا۔ محقق کے لیے اپنے رب کے سوا کوئی مشہود نہیں ہوتا، اور وہ اپنے رب پر فخر نہیں کرتا اور نہ ہی دعویٰ کرتا ہے، بلکہ وہ اپنی عبودیت کو لازم رکھتا ہے، اور جو بھی احکام اس پر وارد ہوتے ہیں ان کے لیے تیار رہتا ہے، پس وہ ان کی طرف تیزی سے بڑھتا ہے، اور کائنات میں موجود ہر شخص کو اسی مقام پر دیکھتا ہے۔ پس اگر وہ شطح کرے تو وہ اس چیز سے پردے میں آ گیا جس کے لیے اسے پیدا کیا گیا تھا، اور اس نے اپنے نفس اور اپنے رب کو جہل میں ڈال دیا۔ اگرچہ اس سے وہ تمام قوتیں ظاہر ہو جائیں جن کا وہ دعویٰ کرتا ہے، جیسے زندہ کرنا، مارنا، ولایت دینا اور معزول کرنا، لیکن اللہ کے ہاں اس کا کوئی مقام نہیں ہے، بلکہ اس کا حکم اس میں مسہل یا قابض دوا جیسا ہے جو حال کی خاصیت سے فعل کرتی ہے، نہ کہ اللہ کے ہاں مقام کی وجہ سے، جیسا کہ جادوگر صنعت کی خاصیت سے دیکھنے والوں کی آنکھوں میں فعل کرتا ہے، پس وہ ان کی بصارت کو اس حق کے دیکھنے سے اچک لیتا ہے جو وہ لائے ہیں۔ اور جو بھی شطح کرتا ہے، وہ غفلت کی وجہ سے شطح کرتا ہے۔ اور ہم نے کسی ایسے ولی کے بارے میں نہ دیکھا اور نہ سنا جس سے نفس کی رعونت کی وجہ سے شطح ظاہر ہوا ہو، اور وہ اللہ کے ہاں ولی ہو، مگر یہ کہ وہ ضرور محتاج اور ذلیل ہوا اور اپنی اصل کی طرف لوٹ آیا، اور وہ غرور جو وہ دکھاتا تھا زائل ہو گیا۔ پس یہ شطح کا لسانِ حال ہے۔ یہ تب ہے جب وہ حق کے ساتھ ہو، پھر بھی مذموم ہے، تو اگر وہ کسی جھوٹے سے صادر ہو تو کیسا ہو گا؟ اگر کہا جائے کہ فعل اور اثر کے موجود ہونے کے باوجود شطح میں جھوٹے کی صورت کیسی ہو گی؟ ہم کہیں گے: ہاں، تم نے صحیح سوال کیا۔ جہاں تک اس میں جھوٹے کی صورت کا تعلق ہے، تو اہل اللہ صرف سچے حال کے ساتھ ہی اثر کرتے ہیں جب وہ اہل اللہ ہوں۔ اور جسے ان کے نزدیک شطح کہا جاتا ہے، وہ اس وقت ہوتا ہے جب اس کے ساتھ کوئی الٰہی حکم نہ ملا ہو جس کا حکم دیا گیا ہو، جیسا کہ انبیاء علیہم السلام سے یہ ثابت ہوا۔ پس لوگوں میں سے کچھ ایسے ہوتے ہیں جو اسماء کی خواص کو جانتے ہیں، تو وہ ان کے ذریعے عجیب و غریب آثار اور صحیح انفعالات ظاہر کرتے ہیں، اور وہ یہ نہیں کہتے کہ یہ ان کے پاس موجود اسماء کی وجہ سے ہے، بلکہ وہ حاضرین کے سامنے یہ ظاہر کرتے ہیں کہ یہ حال کی قوت اور اللہ کے ہاں مقام اور سچی ولایت کی وجہ سے ہے، حالانکہ وہ ان سب میں جھوٹا ہوتا ہے۔ اور اسے نہ تو شطح کہا جاتا ہے اور نہ ہی اس کے صاحب کو شاطح، بلکہ یہ محض مکروہ جھوٹ ہے۔ پس شطح ایک سچا کلمہ ہے جو نفس کی رعونت سے صادر ہوتا ہے، جس پر طبیعت کا کچھ حصہ باقی ہوتا ہے، جو اس حال میں اس کے صاحب کو اللہ سے دور ہونے کی گواہی دیتا ہے۔ یہ مقدار شطح کی معرفت کے حال میں کافی ہے۔",
    "fa": "(باب صد و نود و پنجم در معرفت شطح)\n\nشطح ادعایی است که در نفوس به طبع خودشان پدید می‌آید،\nبه دلیل باقی ماندن آثاری از هوای نفس در آن‌ها.\n\nاین (حکم) زمانی است که شطح با سخنی صادقانه\nو بدون امر (الهی) صادر شود، نزد صاحبان خرد (أرباب النهي).\n\n### [اینکه شطح کلمه‌ای حق است که از مرتبه‌ای که خداوند به او داده است، پرده برمی‌دارد]\n\nبدان، خداوند تو را تأیید کند، که شطح کلمه‌ای است که ادعایی بر حق است و از مرتبه‌ای که خداوند از جایگاه نزد خود به او عطا کرده است، پرده برمی‌دارد. او این را بدون امر الهی بیان می‌کند، اما از طریق فخر (فخر بالراء). اما اگر به بیان آن امر شود، آن را برای معرفی از جانب امر الهی بیان می‌کند و قصد فخرورزی ندارد.\n\nپیامبر (صلی الله علیه و آله و سلم) فرمود: «من سرور فرزندان آدم هستم و فخری نیست (ولا فخر)».\n\n(پیامبر) می‌فرماید: من قصد افتخار بر شما را با این معرفی نداشتم، بلکه شما را از آن آگاه ساختم به خاطر مصالحی که برای شما در آن است و تا نعمت خداوند را بر خودتان به واسطه مرتبه پیامبرتان نزد خداوند بشناسید. شطح لغزش محققان (المحققين) است، اگر به آن امر نشده باشند، و آن را می‌گویند، همان‌طور که پیامبر (ص) فرمود. به همین دلیل توضیح داد و گفت: «و فخری نیست»، زیرا من می‌دانم که بنده خدا هستم، همان‌طور که شما بندگان خدا هستید، و بنده بر بنده فخر نمی‌فروشد وقتی که سَرور یکی باشد. همچنین عیسی (علیه السلام) سخن گفت و با عبودیت (العبودية) آغاز کرد، و این به منزله سخن پیامبر (ص) است که فرمود: «و فخری نیست». او در دفاع از پاکی مادرش به قوم خود گفت، و چون از نور نبوت که در استعدادش بود می‌دانست که ناگزیر درباره او گفته خواهد شد که او پسر خداست، گفت: **إِنِّي عَبْدُ الله** (من بنده خدا هستم). پس در آغاز معرفی و شهادت خود در حالی که در عادت، کسی مانند او سخن نمی‌گوید، شروع کرد (و گفت): من پسر کسی نیستم، مادرم پاک و بتول است، و من پسر خدا نیستم، همان‌طور که او (خداوند) همسر نمی‌پذیرد، فرزند نیز نمی‌پذیرد. بلکه من بنده خدا هستم مانند شما. **آتانِيَ الْكِتابَ وَجَعَلَنِي نَبِيًّا** (به من کتاب داده و مرا پیامبر قرار داده است). پس او به نبوت خود در وقت آن نزد خود، و در غیر وقت آن نزد حاضران، سخن گفت؛ زیرا در وقت رسالتش ناگزیر بود که نبوت خود را اعلام کند، همان‌طور که عادت خداوند در پیامبران پیش از او جاری شده است. پس آنان به هر آنچه از ایشان ظاهر می‌شود، و از جمله ادعاهای صادقانه‌ای که بر جایگاه و منزلت والا و تمایز از امثال و اشباه به واسطه مرتبه برتر نزد خداوند دلالت دارد، مأمورند. **وَجَعَلَنِي مُبارَكاً** (و مرا مبارک قرار داده است)، یعنی محل و نشانه‌ای برای افزایش خیر نزد شما، **أَيْنَ ما كُنْتُ** (هر کجا که باشم)، یعنی در هر حالی از احوال، برکت به سبب من در شما به حالی خاص محدود نمی‌شود. و همه این‌ها را با لفظ ماضی (گذشته) ذکر کرد، در حالی که حال و استقبال (آینده) را اراده کرده است. آنچه از او در حال (تولد) بود، سخن گفتن او شهادتی بر پاکی مادرش و تنبیه و تعلیمی برای کسی بود که می‌خواهد بگوید او پسر خداست، پس خداوند را تنزیه کرد. و این نظیر تبرئه مادرش از آنچه به او نسبت دادند است. پس در ساحت حق (الحق) تنزیه است و در ساحت مادر تبرئه. و لفظ ماضی در آن و **أَيْنَ ما كُنْتُ** دلالت دارد بر اینکه این معرفی از جانب خداوند برای او بوده است، همان‌طور که برای محمد (صلی الله علیه و آله و سلم) بود، هنگامی که فرمود: «من پیامبر بودم در حالی که آدم میان آب و گِل بود». پس مرتبه خود را نزد خداوند دانست در حالی که صورت بدنی آدم هنوز وجود نیافته بود.\n\n### [اینکه عیسی کلمه الله است]\n\nعیسی (علیه السلام) با لفظ ماضی اعلام کرد که خداوند به او کتاب داده و او را به نماز و زکات سفارش کرده است تا زمانی که در عالم تکلیف و تشریع باشد، و این همان سخن اوست: **ما دُمْتُ حَيًّا** (تا زمانی که زنده‌ام). او در ظاهر امر نزد شنوندگان، حیات تکلیف را اراده کرده است، و نزد ما، این و امر دیگری را اراده کرده است، و آن سخن خداوند متعال درباره عیسی است که او کلمة الله است. و کلمه مجموعه‌ای از حروف است و علم آن در باب \"النفس\" (با فتح فاء) خواهد آمد. پس خبر داد که کتاب را به او داده است، مرادش انجیل است و مرادش مقام وجود او از آن جهت که او کلمه است. و کتاب، ضمیمه شدن حروف رقمی برای اظهار یک کلمه است، یا ضمیمه شدن معنایی به صورت حرفی که بر آن دلالت کند، پس ناگزیر از ترکیب است. به همین دلیل ذکر کرد که خداوند کتاب را به او عطا کرده است، مانند سخن خداوند: **أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ** (به هر چیزی آفرینش آن را عطا کرد). و مراد از وصیت به نماز و زکات، عبادت است، همان‌طور که بر عمل دلالت دارد، بر عبادت دلالتش بیشتر است، زیرا عبادت بودن آن نیازی به بیان ندارد، اما اگر مراد از آن عمل باشد، نیاز به تعیین آن عمل و بیان صورتش است تا این مکلف نشأت آن را برپا دارد. پس اگر مراد عبادت باشد، دلالت می‌کند که او هر کجا باشد، پیوسته زنده است، و اگر با مرگ از این هیکل (جسم) جدا شود، حیات همراه اوست، زیرا حیات صفتی نفسانی برای اوست، به ویژه که خداوند او را روح الله قرار داده است. سپس ذکر کرد که او نسبت به مادرش نیکوکار است، یعنی احسان‌کننده به او. اولین احسان او این بود که مادرش را از آنچه به او نسبت دادند، در حالی که شک نداشتند که او در آن معرفی صادق است، تبرئه کرد. سپس کامل کرد و گفت: **وَلَمْ يَجْعَلْنِي جَبَّاراً** (و مرا جبار قرار نداده است)، زیرا جبروت که همان عظمت است، با عبودیت (العبودية) در تناقض است، و این همان سخن اوست که او بنده خداست.\n\nو مراد او از سخن **جَبَّاراً** (جبار) این است که: من امتی را که با کتاب و نماز و زکات به سوی آن‌ها فرستاده شده‌ام، مجبور نمی‌کنم. من تنها ابلاغ‌کننده از جانب خدا هستم و بس. **لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ** (تو بر آنان مسلط نیستی)، تا جبار باشم و مجبور کنم. و ابلاغ از جانب خدا می‌کنم، چنانکه فرمود: **يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ** (ای پیامبر، آنچه بر تو نازل شده ابلاغ کن) و **وَما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ** (و بر پیامبر جز ابلاغ نیست). **إِنَّما أَنْتَ مُذَكِّرٌ لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ** (تو تنها یادآوری‌کننده‌ای، بر آنان مسلط نیستی). سخن او که «یادآوری‌کننده» است، دلالت دارد بر اینکه یادآوری‌کننده تنها برای کسی است که در حالتی فراموش‌شده قرار داشته باشد، و اگر چنین نبود، او معلم بود نه یادآوری‌کننده. پس دلالت می‌کند که او آن‌ها را یادآوری نمی‌کند مگر به حال اقرارشان به ربوبیت خداوند متعال بر ایشان، هنگامی که ذریه را از پشت آدم در میثاق اول گرفت. سپس گفت: **وَالسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ** (و سلام بر من روزی که زاده شدم)، به واسطه آنچه در میان شما به آن سخن گفتم که من بنده خدا هستم، پس از انتساب وجودم به زنا یا نکاح (غیرشرعی) سالم ماندم. و **وَيَوْمَ أَمُوتُ** (و روزی که می‌میرم)، پس از وقوع قتلی که به کسانی که گمان می‌کنند مرا کشته‌اند، نسبت داده می‌شود، سالم می‌مانم. و این همان سخن بنی‌اسرائیل است: **إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ** (ما مسیح، عیسی پسر مریم را کشتیم). پس خداوند آن‌ها را تکذیب کرد و فرمود: **وَما قَتَلُوهُ وَما صَلَبُوهُ وَلكِنْ شُبِّهَ لَهُمْ** (و او را نکشتند و به صلیب نکشیدند، بلکه امر بر آن‌ها مشتبه شد). پس به آن‌ها گفت که سلام بر اوست روزی که می‌میرد، در حالی که از قتل سالم است؛ زیرا اگر کشته می‌شد، قتل شهادت بود، و شهید زنده است و مرده نیست، و نزد ما نهی شده است که درباره او گفته شود مرده است. و امر پیوسته چنین بوده است. پس خبر داد که او می‌میرد و کشته نمی‌شود. سپس سلام بر او را روزی که می‌میرد ذکر کرد. سپس ذکر کرد که سلام بر اوست **وَيَوْمَ يُبْعَثُ حَيًّا** (و روزی که زنده برانگیخته می‌شود)، یعنی در قیامت، و آن موطن سلامت بی‌گناهان از هر بدی است، مانند پیامبران و دیگر اهل عنایت. پس او در همه این مواطن، صاحب سلامت است. و موطن سومی وجود ندارد؛ این‌ها جز حیات دنیا و حیات آخرت نیست که مرگ میان آن‌هاست. اگر همه این‌ها از امر الهی نبود، از جانب گوینده‌اش شطحات (سخنان وجدآمیز) بود، زیرا این‌ها کلماتی هستند که بر مرتبه نزد خداوند دلالت می‌کنند، از طریق فخرورزی بر امثال و اشباه. و حاشا بر اهل الله که از امثال خود متمایز شوند یا فخر بفروشند. به همین دلیل، شطح سبکسری نفس (رعونة نفس) است، زیرا اصلاً از محقق (اهل تحقیق) صادر نمی‌شود. محقق کسی است که مشهودی جز پروردگارش ندارد، و بر پروردگارش فخر نمی‌فروشد و ادعایی نمی‌کند، بلکه ملازم عبودیت (العبودية) خود است و برای آنچه از اوامر پروردگارش بر او وارد می‌شود، آماده است و به سوی آن‌ها می‌شتابد، و همه موجودات در هستی (الوجود) را در این جایگاه می‌بیند. پس اگر شطح بگوید، از آنچه برای آن خلق شده محجوب گشته و نفس و پروردگارش را نشناخته است. حتی اگر تمام آنچه ادعا می‌کند از قدرت در او اثر کند و زنده کند و بمیراند و ولایت دهد و عزل کند، نزد خداوند جایگاهی ندارد، بلکه حکم او در این کارها حکم داروی مسهل یا قابض است که به خاصیت حال عمل می‌کند، نه به جایگاه نزد خداوند، همان‌طور که ساحر با خاصیت صنعت در چشمان بینندگان عمل می‌کند و دیدگان آن‌ها را از دیدن حق (الحق) در آنچه آورده‌اند، می‌رباید. و هر کس شطح بگوید، از روی غفلت شطح گفته است. و ما ندیده‌ایم و نشنیده‌ایم که از ولی‌ای که شطح از او به دلیل سبکسری نفس (رعونة نفس) ظاهر شده باشد، در حالی که او نزد خدا ولی است، مگر اینکه ناگزیر فقیر و خوار شود و به اصل خود بازگردد و آن غروری که با آن جولان می‌داد، از او زایل شود. پس این زبان حال شطح است. این در صورتی است که شطح بر حق باشد و مذموم است، پس چگونه خواهد بود اگر از دروغگو صادر شود؟ اگر گفته شود: صورت دروغگو در شطح چگونه است با وجود فعل و اثر از او؟ می‌گوییم: آری، چه خوب پرسیدی. اما صورت دروغگو در این مورد، این است که اهل الله تنها با حال صادق اثر می‌گذارند، اگر اهل الله باشند. و آن چیزی که نزد آن‌ها شطح نامیده می‌شود، جایی است که امر الهی که به آن امر شده، همراه آن نباشد، همان‌طور که درباره پیامبران (علیهم السلام) محقق شده است. پس برخی از مردم عالم به خواص اسماء هستند و با آن‌ها آثار عجیب و انفعالات صحیح را ظاهر می‌کنند، اما نمی‌گویند که این از اسماء نزد آن‌هاست، بلکه نزد حاضران چنین وانمود می‌شود که این از قدرت حال و جایگاه نزد خداوند و ولایت صادقه است، در حالی که او در همه این‌ها دروغگوست. و این نه شطح نامیده می‌شود و نه صاحبش شاطح، بلکه دروغ محض و مورد نفرت است. پس شطح کلمه‌ای صادق است که از سبکسری نفس (رعونة نفس) صادر شده که بقایایی از طبع بر آن باقی است، و این (شطح) در آن حال بر صاحبش شهادت می‌دهد که او را از خداوند دور می‌کند. و این مقدار در شناخت حال شطح کافی است."
  },
  "page_count": 2
}