{
  "id": 453,
  "title": {
    "ar": "الباب الثالث والخمسون وأربعمائة في معرفة منازلة كرمي ما وهبتك من الأموال وكرم كرمي ما وهبتك من عفوك عن الجاني عليك",
    "en": "Chapter 453: Concerning the Knowledge of the Station of My Generosity in what I bestowed upon you of Possessions, and the Generosity of My Generosity in what I bestowed upon you of your Pardon for the one who transgressed against you.",
    "ur": "باب چار سو ترپنواں (۴۵۳): میرے اس کرم کے مقام کی معرفت جو میں نے تجھے اموال کی صورت میں عطا کیا، اور میرے کرم کے کرم کے مقام کی معرفت جو میں نے تجھے تجھ پر زیادتی کرنے والے کو معاف کرنے کی صورت میں عطا کیا۔",
    "fa": "باب چهارصد و پنجاه و سوم، در معرفت مقام کرم من در آنچه از اموال به تو بخشیدم، و کرمِ کرمِ من در آنچه از عفو تو نسبت به ستمکار بر تو بخشیدم."
  },
  "content": {
    "ar": "## «الباب الثالث والخمسون وأربعمائة في معرفة منازلة كرمي ما وهبتك من الأموال وكرم كرمي ما وهبتك من عفوك عن الجاني عليك»\n\n\n> حكم الكريم بأنه لا يمنع *** ذاك المسمى عندنا كرم الكرم‏\n\n\n> فهو الذي يهب النعيم لذاته *** ولديه بالبرهان مفتاح النعم‏\n\n\n> انظر لحمد الحمد إن حققته *** ما عنده منع ولا في ذاك ذم‏\n\n\n### [أمر إلهى بالعفو]\n\n\nقال الله تعالى معلما ومنبها يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ فنبهه حتى يقول كرمك فهذا من باب كرم الكرم فما أمرك بالعفو عمن جنى عليك إلا ليعفو عنك إذا جنيت عليه في ظنك وما جنيت إلا على نفسك وظنك أرداك حيث ظننت إنك جنيت عليه كما قال الله تعالى ولكِنْ ظَنَنْتُمْ أَنَّ الله لا يَعْلَمُ كَثِيراً مِمَّا تَعْمَلُونَ وذلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْداكُمْ فَأَصْبَحْتُمْ من الْخاسِرِينَ فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ‏\n\n\n### [أن الهتك من أعظم الجنايات‏]\n\n\nاعلم أن أعظم الجنايات من يهتك وهو أن ينسب إليك ما لم يكن منك وإن ظهر منك فيكون من كرم خلقك أن تصدقه فيما نسب إليك إيثارا لجنابه على نفسك وهو على خلق كريم في ذلك وقد علم منك أنك تأدبت معه فما يكون جزاؤك عنده فمثل هذا لا يبلغ كنه ما يستحقه من الإفضال عليه والإنعام لأن الأعراض عند ذوي إلهيات والمروءات أعظم في الحرمة من الدماء والأموال وما فعل مثل هذا في حقك إلا ليرى صبرك وتحملك مثل هذا الأذى والجفاء فإنه يعلم أنك تعلم براءة ساحتك مما نسب إليك من المذام التي كانت منه لا منك إيجادا وحكما وأنت بري‏ء منها إيجادا وحكما فلم تفش له سرا ولم تنازعه ففزت زائدا على ما تستحقه بدرجات الصابرين والراضين والمؤثرين واستعذبت كل ذلك في جنبه ونبهنا تبارك وتعالى على عظيم المنزلة لمن هذه صفته بقوله فَمَنْ عَفا وأَصْلَحَ وأعظم العفو على الجناية العظيمة من العظيم الشأن ثم رميه بها من لم تصدر منه تنزيها له وإيثارا لنفسه قال فَأَجْرُهُ عَلَى الله فيا ليت شعري لم كان أجره على الله ولم يقل فأجره على صبره وإيثاره كذا وكذا فتنبه إلى هذا الأمر العجاب ولا تكن من الغافلين وألزم الحضور والأدب مع الله قلبك إن أردت أن تكون من أهل الله وخاصته الذين جعلوا نفوسهم وقاية لله جعلنا الله ممن اتقاه بنفسه لا به فيحشر في زمرة الأدباء وفي هذه الإشارة في كرم الكرم غنية وكفاية والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 453: Concerning the Knowledge of the Station of My Generosity Regarding the Wealth I Bestowed Upon You, and the Generosity of My Generosity [كرم الكرم] Regarding the Forgiveness I Bestowed Upon You for the One Who Transgressed Against You\n\nThe Generous One rules that He does not withhold,\nThat which is called by us the Generosity of Generosity [كرم الكرم].\nHe is the One who grants bliss for His Essence,\nAnd with Him, by proof, is the key to all favors.\nLook to the Praise of Praise, if you realize it,\nWith Him there is no withholding, nor is there any blame in that.\n\n### A Divine Command for Forgiveness\n\nAllah the Exalted said, teaching and alerting: <<O human being, what has deluded you concerning your Generous Lord?>> (يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ). Thus, He alerted him so that he might say, \"Your generosity.\" This, then, is from the category of the Generosity of Generosity [كرم الكرم]. He only commanded you to forgive the one who transgressed against you so that He might forgive you when you transgress against Him in your assumption. Yet you only transgressed against yourself. And your assumption destroyed you when you assumed that you had transgressed against Him, as Allah the Exalted said: <<But you thought that Allah did not know much of what you were doing. And that was your assumption which you assumed about your Lord. It has destroyed you, and you have become among the losers. So their trade did not profit, nor were they guided.>> (وَلَكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ).\n\n### That Slander is Among the Greatest Transgressions\n\nKnow that the greatest of transgressions is slander (الهتك), which is that someone attributes to you what was not from you. Even if it did appear from you, it would be from the generosity of your character (كرم خلقك) that you affirm him in what he attributed to you, preferring his dignity over your own self. And he (the slanderer) is upon a noble character (خلق كريم) in that matter. He (Allah) knows from you that you maintained proper conduct (تأدبت) with him, so what will your reward be with Him?\n\nSuch a person cannot reach the full extent of what he deserves of favor (الإفضال) and grace (الإنعام), because honor (الأعراض) in the view of those possessing divine qualities (ذوي إلهيات) and chivalry (المروءات) is greater in sanctity than blood and wealth. And he (the transgressor) did not do such a thing against you except so that He (Allah) might see your patience and your endurance of such harm and harshness. For He knows that you know the innocence of your domain from the blameworthy things attributed to you, which originated from him, not from you, in terms of origination (إيجادا) and judgment (حكما). And you are innocent of them in terms of origination and judgment.\n\nSo you neither divulged his secret nor contended with him. Thus, you triumphed, exceeding what you deserve, by attaining the degrees of the patient (الصابرين), the content (الراضين), and those who prefer others (المؤثرين). And you found all of that sweet for His sake.\n\nAnd He, the Blessed and Exalted, alerted us to the great station (عظيم المنزلة) of the one whose attribute this is, by His saying: <<But whoever pardons and makes reconciliation...>> (فَمَنْ عَفَا وَأَصْلَحَ). The greatest forgiveness is for a great transgression from a person of great standing, followed by attributing the transgression to one from whom it did not issue, in order to purify him and prefer his own self. He said: <<...then his reward is due from Allah.>> (فَأَجْرُهُ عَلَى اللَّهِ).\n\nOh, would that I knew why his reward was due from Allah and He did not say, \"His reward is due to his patience and his preference, and so on.\" So pay attention to this wondrous matter and do not be among the heedless (الغافلين). And make your heart adhere to Presence (الحضور) and proper conduct (الأدب) with Allah, if you wish to be among the People of Allah (أهل الله) and His elect, those who made their souls a shield for Allah. May Allah make us among those who fear Him by their own selves, not by Him, so that he may be gathered in the company of those of proper conduct (الأدباء). And in this allusion concerning the Generosity of Generosity [كرم الكرم] there is sufficiency and adequacy. <<And Allah speaks the Truth, and He guides to the Way.>> (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).",
    "ur": "باب نمبر چار سو ترپن: اس معرفت میں کہ میں نے تمہیں جو مال عطا کیا ہے اس میں میری سخاوت کا مقام کیا ہے، اور اس میں میری سخاوت کی سخاوت (کرم الکرم) کا مقام کیا ہے کہ میں نے تمہیں یہ عطا کیا کہ تم اپنے اوپر زیادتی کرنے والے کو معاف کر دو۔\n\nکریم (الکریم) کا حکم ہے کہ وہ منع نہیں کرتا،\nیہی وہ ہے جسے ہم کرم کی سخاوت (کرم الکرم) کہتے ہیں۔\nوہ اپنی ذات (لذاتہ) کے لیے نعمتیں عطا کرتا ہے،\nاور اس کے پاس دلیل (بالبرہان) کے ساتھ نعمتوں کی کنجی ہے۔\nحمد کی حمد (حمد الحمد) کو دیکھو اگر تم اسے سچ کر دکھاؤ،\nاس کے پاس کوئی روک نہیں اور نہ ہی اس میں کوئی مذمت ہے۔\n\n### [امرِ الٰہی بالعفو]\n\nاللہ تعالیٰ نے سکھاتے اور متنبہ کرتے ہوئے فرمایا: \"اے انسان! تجھے تیرے رب کریم (الکریم) کے بارے میں کس چیز نے دھوکے میں ڈال دیا؟\" (سورۃ الانفطار، 82:6) پس اس نے اسے متنبہ کیا تاکہ وہ کہے کہ \"تیرا کرم (کرمک)\"۔ یہ کرم کی سخاوت (کرم الکرم) کے باب سے ہے۔ اس نے تمہیں اپنے اوپر زیادتی کرنے والے کو معاف کرنے کا حکم صرف اس لیے دیا تاکہ وہ تمہیں معاف کر دے جب تم اپنے گمان میں اس پر زیادتی کرو، حالانکہ تم نے صرف اپنی جان پر زیادتی کی، اور تمہارے گمان نے تمہیں ہلاک کر دیا جب تم نے یہ گمان کیا کہ تم نے اس پر زیادتی کی ہے۔ جیسا کہ اللہ تعالیٰ نے فرمایا: \"اور لیکن تم نے یہ گمان کیا کہ اللہ تمہارے بہت سے اعمال کو نہیں جانتا۔ اور تمہارا یہی گمان جو تم نے اپنے رب کے بارے میں کیا، تمہیں ہلاک کر گیا، سو تم خسارہ پانے والوں میں سے ہو گئے۔\" (سورۃ فصلت، 41:22-23) \"پس ان کی تجارت نے کوئی نفع نہ دیا اور نہ ہی وہ ہدایت پانے والے تھے۔\" (سورۃ البقرۃ، 2:16)\n\n### [یہ کہ ہتک عزت سب سے بڑی زیادتیوں میں سے ہے]\n\nجان لو کہ سب سے بڑی زیادتیوں میں سے ہتک عزت (یہتک) ہے، اور وہ یہ ہے کہ تمہاری طرف ایسی چیز منسوب کی جائے جو تم سے سرزد نہ ہوئی ہو۔ اور اگر وہ تم سے ظاہر بھی ہو جائے، تو یہ تمہارے خلق کی سخاوت (کرم خلقک) میں سے ہو گا کہ تم اس شخص کی تصدیق کر دو جس نے تمہاری طرف وہ چیز منسوب کی، اپنی ذات پر اس کی عزت (جنابہ) کو ترجیح دیتے ہوئے، اور وہ اس معاملے میں خلق کریم (خلق کریم) پر ہے۔ اور وہ جانتا ہے کہ تم نے اس کے ساتھ ادب (تأدبت) کا برتاؤ کیا ہے، تو اس کے نزدیک تمہارا کیا بدلہ ہو گا؟\n\nایسا شخص اس فضل (الإفضال) اور انعام کی حقیقت کو نہیں پہنچ سکتا جس کا وہ مستحق ہے۔ کیونکہ اہل الٰہیات (ذوی إلهیات) اور اہل مروت (المروءات) کے نزدیک عزت و آبرو (الأعراض) کی حرمت خون اور مال سے زیادہ ہے۔ اور اس نے تمہارے حق میں ایسا کام صرف اس لیے کیا تاکہ وہ تمہارا صبر (صبرک) اور اس طرح کی اذیت (الأذى) اور جفا کو برداشت کرنا دیکھ لے۔\n\nکیونکہ وہ جانتا ہے کہ تم اپنی ذات کی پاکیزگی (براءۃ ساحتك) کو ان برائیوں سے جانتے ہو جو تمہاری طرف منسوب کی گئیں، جو اس کی طرف سے تھیں نہ کہ تمہاری طرف سے، نہ وجوداً (إیجاداً) اور نہ حکماً (حکماً)۔ اور تم ان سے بری ہو، نہ وجوداً اور نہ حکماً۔ پھر بھی تم نے نہ تو اس کا کوئی راز فاش کیا اور نہ ہی اس سے جھگڑا کیا۔ پس تم اپنے استحقاق سے بڑھ کر صابرین (الصابرین)، راضین (الراضین) اور ایثار کرنے والوں (المؤثرین) کے درجات سے کامیاب ہوئے، اور تم نے یہ سب کچھ اس کی خاطر (فی جنبہ) شیریں جانا۔\n\nاور اللہ تبارک و تعالیٰ نے اس شخص کے عظیم مقام (عظیم المنزلة) پر ہمیں متنبہ فرمایا جس کی یہ صفت ہو، اپنے اس قول سے: \"پس جس نے معاف کر دیا اور اصلاح کر لی\" (سورۃ الشوریٰ، 42:40)۔ اور سب سے بڑی زیادتی پر سب سے بڑی معافی یہ ہے کہ عظیم الشان (العظیم الشأن) شخص کی طرف سے ہونے والی زیادتی کو معاف کر دیا جائے، پھر اس زیادتی کو اس شخص کی طرف منسوب کر دیا جائے جس سے وہ سرزد نہیں ہوئی، تاکہ زیادتی کرنے والے کو پاکیزہ (تنزیہا لہ) رکھا جائے اور اپنی ذات کو ترجیح (إیثارا لنفسہ) دی جائے۔ فرمایا: \"تو اس کا اجر اللہ کے ذمہ ہے\" (سورۃ الشوریٰ، 42:40)۔ کاش میں جانتا کہ اس کا اجر اللہ کے ذمہ کیوں ہے؟ اور یہ کیوں نہیں فرمایا کہ اس کا اجر اس کے صبر اور اس کے ایثار پر ہے، وغیرہ وغیرہ۔\n\nپس اس عجیب معاملے (الأمر العجاب) پر توجہ دو اور غافلوں (الغافلین) میں سے نہ بنو۔ اور اگر تم اللہ کے اہل (أهل اللہ) اور اس کے خاص بندوں (خاصتہ) میں سے ہونا چاہتے ہو جنہوں نے اپنی جانوں کو اللہ کے لیے ڈھال بنا لیا، تو اپنے دل کو اللہ کے ساتھ حضور (الحضور) اور ادب (الأدب) کا پابند بناؤ۔ اللہ ہمیں ان لوگوں میں شامل کرے جو اپنے نفس کے ذریعے اس سے ڈرتے ہیں نہ کہ اس کے ذریعے، تاکہ وہ اہل ادب (الأدباء) کے زمرے میں اٹھائے جائیں۔ اور کرم کی سخاوت (کرم الکرم) کے اس اشارے میں غنا اور کفایت ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔ (سورۃ الاحزاب، 33:4)",
    "fa": "باب چهارصد و پنجاه و سوم در معرفت منزلت کرم من در آنچه از اموال به تو بخشیدم و کرمِ کرمِ من در آنچه از عفو خود نسبت به کسی که بر تو جنایت کرده به تو بخشیدم.\n\nحکم کریم بر این است که منع نمی‌کند\nاین همان است که نزد ما کرمِ کرم (كرم الكرم) نامیده می‌شود.\nپس اوست که نعمت را به ذات خود می‌بخشد\nو نزد او با برهان، کلید نعمت‌هاست.\nبه ستایشِ ستایش بنگر اگر آن را محقق سازی\nنزد او منعی نیست و در آن نکوهشی وجود ندارد.\n\n### [امر الهی به عفو]\n\nخداوند متعال در مقام تعلیم و تنبیه می‌فرماید: «ای انسان، چه چیز تو را در برابر پروردگار کریمت مغرور ساخته است؟» (يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ) پس او را آگاه ساخت تا بگوید: کرم تو (مرا مغرور ساخت). این از باب کرمِ کرم (كرم الكرم) است. و تو را به عفو از کسی که بر تو جنایت کرده، امر نکرد مگر برای آنکه او نیز تو را ببخشد هنگامی که در گمان خود بر او جنایت می‌کنی؛ در حالی که تو جز بر خودت جنایت نکرده‌ای. و گمان تو، تو را به هلاکت انداخت، آنجا که گمان بردی بر او جنایت کرده‌ای، چنانکه خداوند متعال می‌فرماید: «ولی شما گمان کردید که خداوند بسیاری از کارهایی را که می‌کنید نمی‌داند. و این گمان شما بود که درباره پروردگارتان بردید، شما را به هلاکت رساند و از زیانکاران شدید. پس تجارتشان سودی نکرد و هدایت‌یافته نبودند.» (ولكِنْ ظَنَنْتُمْ أَنَّ الله لا يَعْلَمُ كَثِيراً مِمَّا تَعْمَلُونَ وذلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْداكُمْ فَأَصْبَحْتُمْ من الْخاسِرِينَ فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ‏)\n\n### [اینکه هتک حرمت از بزرگترین جنایات است]\n\nبدان که بزرگترین جنایات، هتک حرمت (الهتك) است، و آن این است که چیزی را به تو نسبت دهد که از تو سر نزده است. و اگر هم از تو ظاهر شده باشد، از کرم خُلق توست که او را در آنچه به تو نسبت داده تصدیق کنی، به جهت ترجیح دادن مقام او بر نفس خودت. و او در این کار بر خُلق کریم است و از تو می‌داند که با او مؤدب بوده‌ای، پس پاداش تو نزد او چه خواهد بود؟ پس چنین کسی به کنه آنچه از فضل و انعام بر او سزاوار است نمی‌رسد، زیرا آبرو (الأعراض) نزد صاحبان الهیات و مروت‌ها، در حرمت از خون‌ها و اموال بزرگتر است. و او چنین کاری را در حق تو انجام نداد مگر برای آنکه صبر و تحمل تو را در برابر چنین آزار و جفایی ببیند. زیرا او می‌داند که تو به پاکی ساحت خود از آنچه به تو نسبت داده شده از نکوهش‌ها که از او بوده نه از تو، هم از جهت ایجاد و هم از جهت حکم، آگاهی؛ و تو از آن هم از جهت ایجاد و هم از جهت حکم بری هستی. پس نه رازی را از او فاش کردی و نه با او نزاع نمودی، در نتیجه بیش از آنچه استحقاق داری، به درجات صابران و راضیان و ایثارگران دست یافتی. و همه اینها را در راه او شیرین یافتی. و خداوند تبارک و تعالی ما را بر عظمت منزلت کسی که این صفت اوست، با این قول آگاه ساخت: «پس هر کس عفو کند و اصلاح نماید» (فَمَنْ عَفا وأَصْلَحَ). و بزرگترین عفو، عفو از جنایت بزرگ از سوی شخص بزرگ‌شأن است، سپس نسبت دادن آن جنایت به کسی که از او سر نزده است، برای تنزیه او و ایثار نفس. فرمود: «پس پاداش او بر عهده خداوند است» (فَأَجْرُهُ عَلَى الله). ای کاش می‌دانستم چرا پاداش او بر عهده خداوند قرار گرفت و نگفت: پاداش او بر صبر و ایثارش چنین و چنان است؟ پس به این امر شگفت‌انگیز توجه کن و از غافلان مباش. و اگر می‌خواهی از اهل الله و خاصان او باشی که نفس‌های خود را سپر بلای خداوند قرار دادند، حضور و ادب با حق را بر قلب خود لازم بدار. خداوند ما را از کسانی قرار دهد که با نفس خود از او پروا می‌کنند نه با او، تا در زمره ادیبان محشور شوند. و در این اشاره به کرمِ کرم (كرم الكرم)، بی‌نیازی و کفایت است. و خداوند حق را می‌گوید و او راه را می‌نمایاند (وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 1
}