{
  "id": 37,
  "title": {
    "ar": "الباب السابع والثلاثون في معرفة الأقطاب العيسويين وأسرارهم",
    "en": "Chapter Thirty-Seven: On the Gnosis of the Isaian Poles (الأقطاب العيسويين) and their Mysteries.",
    "ur": "سینتیسواں باب عیسوی اقطاب کی معرفت اور ان کے اسرار کے بیان میں",
    "fa": "باب سی و هفتم در شناخت اقطاب عیسوی و اسرارشان"
  },
  "content": {
    "ar": "## (الباب السابع والثلاثون في معرفة الأقطاب العيسويين وأسرارهم)\n\n\nفاعلم أيدك الله بروح القدس أن‏\n\n\n> القطب من ثبتت في الأمر أقدامه *** والعيسوى الذي يبديه قدامه‏\n\n\n> والعيسوى الذي يوما له رفعت *** بين النبيين في الإشهاد أعلامه‏\n\n\n> وجاءه من أبيه كل رائحة *** كالمسك في شمها بالوحي أعلامه‏\n\n\n> له الحياة فيحيي من يشاء بها *** فلا يموت ولا تفنيه أيامه‏\n\n\n> فلو تراه وقد جاءته آيته *** تسعى لتظهر في الأكوان أحكامه‏\n> مواجها بلسان أنت قلت لهم *** بأنك الله وهو الله علامة\n\n\n> جوابه قيل ما قد قيل فاعف ولا *** تنظر لجرم الذي أرداه إجرامه‏\n\n\n> صلى عليه إله الخلق من رجل *** أعطى وأعطى الذي أعطاه إكرامه‏\n\n\n### [الميراثان: الروحاني والمحمدي‏]\n\n\nاعلم أيدك الله بروح القدس إنا قد عرفناك إن العيسوى من الأقطاب هو الذي جمع له الميراثان الميراث الروحاني الذي يقع به الانفعال والميراث المحمدي ولكن من ذوق عيسى عليه السلام لا بد من ذلك وقد بينا مقاماتهم وأحوالهم فلنذكر في هذا الباب نبذا من أسرارهم‏\n\n\n### [سريان الحال عن طريق اللمس أو المعانقة]\n\n\nفمنها أنهم إذا أرادوا أن يعطوا حالا من الأحوال التي هم عليها وهي تحت سلطانهم لما يرون في ذلك الشخص من الاستعداد إما بالكشف وإما بالتعريف الإلهي فيلمسون ذلك الشخص أو يعانقونه أو يقبلونه أو يعطونه ثوبا من لباسهم أو يقولون له ابسط ثوبك ثم يغرفون له مما يريدون أن يعطوه والحاضر ينظر أنهم يغرفون في الهواء ويجعلونه في ثوبه على قدر ما يحد لهم من الغرفات ثم يقولون له ضم ثوبك مجموع الأطراف إلى صدرك أو ألبسه على قدر الحال التي يحبون أن يهبوه إياها فأي شي‏ء فعلوا من ذلك سرى ذلك الحال في ذلك الشخص المأمور المراد به من وقته لا يتأخر وقد رأينا ذلك لبعض شيوخنا جاء لأقوام من العامة فيقول لي هذا شخص عنده استعداد فيقرب منه فإذا لمسه أو صربه بصدره في ظهره قاصدا أن يهبه ما أراد سرى فيه ذلك الحال من ساعته وخرج مما كان فيه وانقطع إلى ربه وكان أيضا له هذه الحال مكي الواسطي المدفون بمكة تلميذ أزدشير كان إذا أخذه الحال يقول لمن يكون حاضرا معه عانقني أو تعرف الحاضر أمره فإذا رآه متلبسا بحاله عانقة فيسري ذلك الحال في هذا الشخص ويتلبس به شكى جابر بن عبد الله لرسول الله صلى الله عليه وسلم أنه لا يثبت على ظهر الفرس فضرب في صدره بيده فما سقط عن ظهر فرس بعد ونخس رسول الله صلى الله عليه وسلم مركوبا كان تحت بعض أصحابه بطيئا يمشي به في آخر الناس فلما نخسه لم يقدر صاحبه على إمساكه وكان يتقدم على جميع الركاب وركب رسول الله صلى الله عليه وسلم فرسا بطيئا لأبي طلحة يوم أغير على سرح رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم في حق ذلك الفرس إنا وجدناه لبحرا فما سبق بعد ذلك‏\n\n\nوشكى لرسول الله صلى الله عليه وسلم أبو هريرة أنه ينسى ما يسمعه من رسول الله صلى الله عليه وسلم فقال له يا أبا هريرة ابسط رداءك فبسط أبو هريرة رداءه فاغترف رسول الله صلى الله عليه وسلم غرفة من الهواء أو ثلاث غرفات وألقاها في رداء أبي هريرة وقال له ضم رداءك إلى صدرك فضمه إلى صدره فما نسي بعد ذلك شيئا يسمعه‏\n\n\nوهذا كله من هذا المقام‏\n\n\n### [السببية والنسب الأسمائية]\n\n\nفانظر في سر هذا الأمر أنه ما ظهر شي‏ء من ذلك إلا بحركة محسوسة لإثبات الأسباب التي وضعها الله ليعلم أن الأمر الإلهي لا ينخرم وأنه في نفسه على هذا الحد فيعرف العارف من ذلك نسب الأسماء الإلهية وما ارتبط بها من وجود الكائنات وأن ذلك تقتضيه الحضرة الإلهية لذاتها فنصرف العالم المحقق بهذه الأمور والتنبيهات الإلهية على إن الحكمة فيما ظهر وأن ذلك لا يتبدل وأن الأسباب لا ترفع أبدا وكل من زعم أنه رفع سببا بغير سبب فما عنده علم لا بما رفع به ولا بما رفع فلم يمنح عبد شيئا أفضل من العلم والعمل به وهذه أحوال الأدباء من عباد الله تعالى‏\n\n\n### [إعجاز البيان وإعجاز القرآن‏]\n\n\nومن أسرارهم أيضا أنهم يتكلمون في فصول البلاغة في النطق ويعلمون إعجاز القرآن ولم يعلم منهم ولا حصل لهم من العلم بلسان العرب والتحقق به على الطريقة المعهودة من قراءة كتب الأدب ما يعلم أنهم حصل لهم ذلك من هذه الجهة بل كان ذلك لهم من الهبات الإلهية بطريق خاص يعرفونه من نفوسهم إذا أعطوا العبارة عن الذي يرد عليهم في بواطنهم من الحقائق وهم أميون وإن أحسنوا الكتابة من طريق النقش ولكن هم عوام الناس فينطقون بما هو خارج في المعتاد عن قوتهم إذ لم يكونوا من العرب وإن كانوا من العرب فلم يكونوا إلا بالنسب لا باللسان فيعرف الإعجاز فيه منه فمن هنالك يعرف إعجاز القرآن وذلك قول الحق قيل لي في بعض الوقائع أ تعرف ما هو إعجاز القرآن قلت لا قال كونه إخبارا عن حق التزم الحق يكن كلامك معجزا فإن المعارض للقرآن أول ما يكذب فيه أنه يجعله من الله وليس من الله فيقول على الله ما لا يعلم فلا يثمر ولا يثبت فإن الباطل زهوق لا ثبات له ثم يخبر في كلامه عن‏\nأمور مناسبة للسورة التي يريد معارضتها بأمور تناسبها في الألفاظ مما لم يقع ولا كانت فهي باطل والباطل عدم والعدم لا يقاوم الوجود والقرآن إخبار عن أمر وجودي حق في نفس الأمر فلا بد أن يعجز المعارض عن الإتيان بمثله فمن التزم الحق في أفعاله وأقواله وأحواله فقد امتاز عن أهل زمانه وعن كل من لم يسلك مسلكه فأعجز من أراد التصور على مقامه من غير حق‏\n\n\n### [أبو عبد الله الغزال وشيخه ابن العريف‏]\n\n\nومن أسرارهم أيضا علم الطبائع وتأليفها وتحليلها ومنافع العقاقير يعلم ذلك منها كشفا خرج شيخنا أبو عبد الله الغزال كان بالمرية رحمه الله في حال سلوكه من مجلس شيخه أبي العباس بن العريف وكان ابن العريف أديب زمانه فهو بالأحرش بطريق الصماد حية إذ رأى أعشاب ذلك المرج كلها تخاطبه بمنافعها فتقول له الشجرة أو النجم خذني فإني أنفع لكذا وأدفع من المضار كذا حتى ذهل وبقي حائرا من نداء كل شجرة منها تحببا له وتقربا منه فرجع إلى الشيخ وعرفه بذلك فقال له الشيخ ما لهذا خدمتنا أين كان منك الضار النافع حين قالت لك الأشجار إنها نافعة ضارة فقال يا سيدي التوبة قال له الشيخ إن الله فتنك واختبرك فإني ما دللتك إلا على الله لا على غيره فمن صدق توبتك أن ترجع إلى ذلك الموضع فلا تكلمك تلك الأشجار التي كلمتك إن كنت صادقا في توبتك فرجع أبو عبد الله الغزال إلى الموضع فما سمع شيئا مما كان قد سمعه فسجد لله شكرا ورجع إلى الشيخ فعرفه فقال الشيخ الحمد لله الذي اختارك لنفسه ولم يدفعك إلى كون مثلك من أكوانه تشرف به وهو على الحقيقة يشرف بك فانظر همته رضي الله عنه‏\n\n\n### [الأسباب كتجليات للحق من خلف حجابها]\n\n\nوإذا علم أسرار الطبائع ووقف على حقائقها علم من الأسماء الإلهية التي علمها الله آدم عليه السلام نصفها وهي علوم عجيبة لما أطلعنا الله عليها من هذه الطريقة رأينا أمرا هائلا وعلمنا من سر الله في خلقه وكيف سر الاقتدار الإلهي في كل شي‏ء فلا شي‏ء ينفع إلا به ولا يضر إلا به ولا ينطق إلا به ولا يتحرك إلا به وحجب العالم بالصور فنسبوا كل ذلك إلى أنفسهم وإلى الأشياء والله يقول يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله وكلامه حق وهو خبر ومثل هذه الأخبار لا يدخلها النسخ فلا فقر إلا إلى الله ففي هذه الآية تسمى الله بكل شي‏ء يفتقر إليه ومن هذا الباب يكون الفقير من يفتقر إلى كل شي‏ء ولا يفتقر إليه شي‏ء فيتناول الأسباب على أوضاعها الحكمية لا يخل بشي‏ء منها وهذا الذوق عزيز ما رأينا أحدا عليه فيمن رأيناه ولا نقل إلينا سماعا لا في المتقدم ولا في المتأخر لكن رأينا ونقل إلينا عن جماعة إثبات الأسباب وليس من هذا الباب فإن الذي نذكره ونطلبه سريان الألوهية في الأسباب أو تجليات الحق خلف حجاب الأسباب في أعيان الأسباب أو سريان الأسباب في الألوهية هذا هو الذي لم نجد له ذائقا إلا قول الله تعالى فهي الآية اليتيمة في القرآن لا يعرف قدرها إذ لا قيمة لها وكل ما لا قيمة له ثبت بالضرورة أنه مجهول القدر ولو اعتقدت فيه النفاسة\n\n\n### [النشأتان: الطبيعية والروحانية]\n\n\nومن أسرارهم أيضا معرفة النشأتين في الدنيا وهي النشأة الطبيعية والنشأة الروحانية وما أصلهما ومعرفة النشأتين في الدار الآخرة الطبيعية والروحانية وما أصلهما ومعرفة النشأتين نشأة الدنيا ونشأة الآخرة فهي ستة علوم لا بد من معرفتها\n\n\n### [العبودة البشرية والقوى الإلهية]\n\n\nومن أسرارهم أنه ما منهم شخص كمل له هذا المقام إلا ويوهب ستمائة قوة إلهية ورثها من جده الأقرب لأبيه فيفعل بها بحسب ما تعطيه فإن شاء أخفاها وإن شاء أظهرها والإخفاء أعلى فإن العبودة إنما تأخذ من القوي ما تستعين بها على أداء حق أوامر سيدها لثبوت حكم عبوديتها وكل قوة تخرجه عن هذا الباب بالقصد فليس هو مطلوبا لرجال الله فإنهم لا يزاحمون ذا القوة المتين فإن الله ما طلب منهم أن يطلبوا العون منه إلا في عبادته لا أن يظهروا بها ملوكا أربابا كما زعمت طائفة من أهل الكتاب ممن اتخذوا عيسى ربا قالوا إن محمدا يطلب منا أن نعبده كما عبدنا عيسى فأنزل الله تعالى قُلْ يا أَهْلَ الْكِتابِ تَعالَوْا إِلى‏ كَلِمَةٍ سَواءٍ بَيْنَنا وبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا الله ولا نُشْرِكَ به شَيْئاً ولا يَتَّخِذَ بَعْضُنا بَعْضاً أَرْباباً من دُونِ الله‏\n\n\n### [معارج العيسويين‏]\n\n\nومن أسرارهم أيضا أنهم لا يتعدون في معارجهم من حيث أبيهم السماء الثانية إلا أن يتوجهوا إلى الجد الأقرب فربما ينتهي بعضهم إلى السدرة المنتهى وهي المرتبة التي تنتهي إليها أعمال العباد لا تتعداها ومن هناك يقبلها الحق وهي برزخها إلى يوم القيامة الذي يموت فيه صاحب ذلك العمل ويكفي هذا القدر من علم أسرار هذه الجماعة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء العشرون‏\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "The Thirty-Seventh Chapter: Concerning the Knowledge of the Isa-like Poles (الأقطاب العيسويين) and their Secrets\n\nKnow, may Allah support you with the Holy Spirit (روح القدس), that:\n\n> The Pole (القطب) is he whose steps are firm in the Command (الأمر),\n> And the Isa-like one (العيسوى) is he whom He manifests before him.\n\n> And the Isa-like one is he for whom, one day, his banners were raised\n> Among the Prophets during the Witnessing (الإشهاد).\n\n> And to him came from his Father every fragrance,\n> Like musk in its scent, its signs known through Revelation (الوحي).\n\n> Life belongs to him, and by it he revives whom he wills,\n> So he does not die, nor do his days annihilate him.\n\n> If you were to see him when his Sign (آيته) comes to him,\n> Hastening to manifest its rulings throughout the cosmos (الأكوان).\n> Confronted by the tongue: \"Did you say to them\n> That you are Allah?\"—and He is Allah, the Sign.\n\n> His answer is: \"What was said has been said, so forgive, and do not\n> Look upon the crime of him whose transgression destroyed him.\"\n\n> May the God of Creation bless him, a man\n> Who gave, and whose honor gave to him what he gave.\n\n### The Two Inheritances: The Spiritual and the Muhammadan\n\nKnow, may Allah support you with the Holy Spirit, that we have informed you that the Isa-like one (العيسوى) among the Poles (الأقطاب) is he for whom the two inheritances are combined: the spiritual inheritance (الميراث الروحاني) through which influence (الانفعال) occurs, and the Muhammadan inheritance (الميراث المحمدي). However, the taste (ذوق) of Jesus (peace be upon him) is indispensable for this. We have already explained their stations (مقاماتهم) and states (أحوالهم), so in this chapter, we shall mention some of their secrets.\n\n### The Transmission of the Spiritual State via Touch or Embrace\n\nAmong these secrets is that when they wish to bestow a spiritual state (حال) upon someone—a state that is under their authority—due to the readiness (الاستعداد) they perceive in that person, either through Unveiling (الكشف) or Divine Instruction (التعريف الإلهي), they either touch that person, embrace him, kiss him, give him a garment from their clothing, or tell him, \"Spread out your garment.\" Then they scoop up for him what they wish to bestow. The observer sees them scooping up from the air and placing it in his garment, according to the number of scoops they determine. Then they tell him, \"Gather the edges of your garment to your chest,\" or \"Wear it,\" according to the state they wish to grant him. Whatever action they perform, that spiritual state immediately flows (سرى) into the commanded person intended for it, without delay. We have witnessed this with some of our Shaykhs who approached common people. He would say to me, \"This person has readiness.\" He would approach him, and if he touched him or struck his back with his chest, intending to bestow upon him what he desired, that state would flow into him instantly, and he would emerge from his previous condition and devote himself entirely to his Lord. This state was also possessed by Makki al-Wasiti, buried in Mecca, a student of Azdashir. When the spiritual state overtook him, he would say to those present, \"Embrace me.\" The person present would know his intention, and seeing him enveloped in his state, would embrace him. That state would then flow into this person, and he would become imbued with it. Jabir ibn Abdullah complained to the Messenger of Allah (peace and blessings be upon him) that he could not remain steady on the back of a horse. The Prophet struck him on the chest with his hand, and thereafter he never fell from a horse. The Messenger of Allah (peace and blessings be upon him) also prodded a slow mount belonging to one of his Companions, which was walking at the back of the group. After he prodded it, its owner could not restrain it, and it advanced ahead of all the other mounts. The Messenger of Allah (peace and blessings be upon him) rode a slow horse belonging to Abu Talha on the day the Prophet’s grazing camels were raided. The Messenger of Allah (peace and blessings be upon him) said concerning that horse, \"Indeed, we found it to be a sea.\" After that, it was never surpassed. Abu Hurayrah complained to the Messenger of Allah (peace and blessings be upon him) that he forgot what he heard from the Prophet. The Prophet said to him, \"O Abu Hurayrah, spread out your cloak.\" Abu Hurayrah spread it out, and the Messenger of Allah (peace and blessings be upon him) scooped up one measure from the air, or three measures, and cast it into Abu Hurayrah’s cloak. He said to him, \"Gather your cloak to your chest.\" He gathered it to his chest, and thereafter he never forgot anything he heard. All of this stems from this station (مقام).\n\n### Causality and the Relationships of the Names\n\nReflect upon the secret of this matter: nothing of this appeared except through a perceptible action, in order to establish the causes (الأسباب) that Allah has set down, so that it may be known that the Divine Command (الأمر الإلهي) is not violated, and that it is inherently upon this limit. The Gnostic (العارف) thus learns from this the relationships of the Divine Names (نسب الأسماء الإلهية) and what is connected to them from the existence of the created things (وجود الكائنات), and that the Divine Presence (الحضرة الإلهية) necessitates this by its very Essence (الذات). The realized scholar (العالم المحقق) manages the world through these matters and Divine warnings, based on the principle that wisdom lies in what has appeared, that this does not change, and that causes are never abolished. Whoever claims that he abolished a cause without another cause possesses no knowledge, neither of that by which he abolished it nor of that which was abolished. No servant has been granted anything better than Knowledge (العلم) and acting upon it. These are the states (أحوال) of the well-mannered among the servants of Allah the Most High.\n\n### The Inimitability of Eloquence and the Inimitability of the Quran\n\nAmong their secrets also is that they speak with chapters of eloquence (فصول البلاغة) in their discourse and know the inimitability (إعجاز) of the Quran. Yet, they did not acquire or possess the knowledge of the Arabic language and its realization (التحقق به) through the customary method of reading literary books to suggest that they obtained it from that source. Rather, this came to them through Divine Gifts (الهبات الإلهية) by a special path that they recognize within themselves when they are given the expression (العبارة) for the Realities (الحقائق) that descend upon their inner beings. They are unlettered (أميون), even if they are skilled in writing by way of inscription, but they are common people. They speak what is ordinarily beyond their capacity, as they were not Arabs, or if they were Arabs, it was only by lineage, not by language. Thus, the inimitability is recognized in their speech. From this, the inimitability of the Quran is known. This is the saying of the Real (الحق). I was asked in certain occurrences, \"Do you know what the inimitability of the Quran is?\" I said, \"No.\" He said, \"Its being an affirmation of the Real (حق). Commit yourself to the Real, and your speech will be inimitable.\" For the one who challenges the Quran first lies by claiming it is from Allah when it is not from Allah. He speaks about Allah what he does not know, so it bears no fruit and is not established, for falsehood (الباطل) is vanishing and has no permanence. Then, in his speech, he reports matters appropriate to the Surah he wishes to challenge, using words that correspond to it, but these matters have neither occurred nor existed; thus, they are falsehood. Falsehood is non-existence (عدم), and non-existence cannot withstand Being (الوجود). The Quran is a report about an existent, true matter in reality (في نفس الأمر). Therefore, the challenger must inevitably be incapable of producing its like. Whoever commits himself to the Real in his acts, sayings, and states has distinguished himself from the people of his time and from everyone who did not follow his path, thereby rendering incapable anyone who sought to imagine his station (مقامه) without the Real.\n\n### Abu Abdullah al-Ghazzal and his Shaykh Ibn al-Arif\n\nAmong their secrets also is the knowledge of natures (الطبائع), their composition, their analysis, and the benefits of medicinal herbs. This is known through Unveiling (كشفا). Our Shaykh Abu Abdullah al-Ghazzal, who was in Almería (may Allah have mercy on him), during his spiritual journey (سلوكه), left the gathering of his Shaykh, Abu al-Abbas ibn al-Arif—who was the literary master of his time—and was in Al-Ahrash, on the road to Al-Sammad. He saw all the herbs of that meadow addressing him with their benefits. The tree or the plant would say to him, \"Take me, for I am beneficial for such-and-such, and I ward off such-and-such harm,\" until he was bewildered and remained confused by the call of every plant, which was showing affection and drawing near to him. He returned to the Shaykh and informed him of this. The Shaykh said to him, \"It was not for this that you served us! Where was the harmful and the beneficial when the plants told you that they were beneficial and harmful?\" He said, \"My master, repentance (التوبة)!\" The Shaykh said to him, \"Allah has tested you and tried you. I only guided you to Allah, not to anything else. The sincerity of your repentance is that you return to that place, and those plants that spoke to you will not speak to you, if you are sincere in your repentance.\" Abu Abdullah al-Ghazzal returned to the place and heard nothing of what he had heard before. He prostrated to Allah in gratitude and returned to the Shaykh and informed him. The Shaykh said, \"Praise be to Allah, Who chose you for Himself and did not hand you over to a creature (كون) like you, that you might be honored by it, while in reality, it is honored by you.\" Look at his spiritual aspiration (همته), may Allah be pleased with him.\n\n### Causes as Theophanies of the Real from Behind their Veil\n\nWhen one knows the secrets of natures and stands upon their realities (حقائقها), he knows half of the Divine Names (الأسماء الإلهية) that Allah taught Adam (peace be upon him). These are wondrous sciences. When Allah disclosed them to us through this path, we saw a tremendous matter and learned of the secret of Allah in His creation, and how the secret of Divine Power (الاقتدار الإلهي) flows through everything. Nothing benefits except through Him, nothing harms except through Him, nothing speaks except through Him, and nothing moves except through Him. Yet, He veiled the world (العالم) with forms, so they attributed all of this to themselves and to things. But Allah says: <<يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ>> (O mankind, you are the poor [in need] of Allah). His word is the Real (حق), and it is a report, and such reports are not subject to abrogation. Thus, there is no poverty except toward Allah. In this verse, Allah names Himself with everything that is needed. From this chapter comes the poor one (الفقير) who is in need of everything, yet nothing is in need of him. He engages with causes (الأسباب) according to their determined legal placements (أوضاعها الحكمية), without violating any of them. This taste (الذوق) is rare. We have not seen anyone upon it among those we have met, nor has it been transmitted to us by hearing, neither among the predecessors nor the successors. However, we have seen and heard reports about a group who affirm causes (إثبات الأسباب), but this is not the same chapter. For what we mention and seek is the flow of Divinity (الألوهية) through the causes, or the Theophanies (تجليات) of the Real (الحق) from behind the veil of causes in the Fixed Entities (أعيان الأسباب) of the causes, or the flow of the causes within the Divinity. This is what we have not found anyone who has tasted it, except for the saying of Allah the Most High. Thus, it is the unique verse (الآية اليتيمة) in the Quran whose worth is unknown, as it has no price. And everything that has no price is necessarily of unknown worth, even if one believes it to be precious.\n\n### The Two Originations: Natural and Spiritual\n\nAmong their secrets also is the knowledge of the two originations (النشأتان) in this world (الدنيا): the natural origination (النشأة الطبيعية) and the spiritual origination (النشأة الروحانية), and their source. And the knowledge of the two originations in the Hereafter (الدار الآخرة): the natural and the spiritual, and their source. And the knowledge of the two originations: the origination of this world and the origination of the Hereafter. These are six sciences that must be known.\n\n### Human Servitude and Divine Powers\n\nAmong their secrets is that no person among them who has perfected this station (مقام) is without the gift of six hundred Divine Powers (قوة إلهية), inherited from his nearest ancestor on his father's side. He acts with these powers according to what they grant. If he wills, he conceals them, and if he wills, he manifests them. Concealment is superior, for servitude (العبودة) only takes from the powers what assists it in fulfilling the rights of its Master's commands, thereby establishing the ruling of its servitude. Any power that intentionally leads him outside of this boundary is not sought by the men of Allah, for they do not compete with the Possessor of Firm Strength (ذا القوة المتين). Allah did not ask them to seek aid from Him except in His worship, not that they should manifest themselves as kings or lords, as claimed by a faction of the People of the Book who took Jesus as a lord. They said, \"Muhammad asks us to worship him just as we worshipped Jesus.\" So Allah the Most High revealed: <<قُلْ يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ>> (Say, \"O People of the Scripture, come to a word that is equitable between us and you—that we will not worship except Allah and not associate anything with Him and not take one another as lords instead of Allah\").\n\n### The Ascensions of the Isa-like Poles\n\nAmong their secrets also is that in their ascensions (معارجهم) from the station of their father (Isa), they do not pass beyond the Second Heaven, unless they turn toward the nearest ancestor. Some of them may reach the Lote Tree of the Utmost Boundary (السدرة المنتهى), which is the level (المرتبة) where the deeds of the servants terminate and do not pass beyond. From there, the Real (الحق) accepts them, and it is their Isthmus (برزخها) until the Day of Resurrection, when the owner of that deed dies. This much knowledge concerning the secrets of this group suffices. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).\n\nEnd of the Twentieth Part.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "(سینتیسواں باب: عیسوی اقطاب کی معرفت اور ان کے اسرار کے بیان میں)\n\nپس جان لو، اللہ تعالیٰ روح القدس کے ذریعے تمہاری تائید فرمائے، کہ:\n\nقطب وہ ہے جس کے قدم امر (حکم الٰہی) میں ثابت ہو جائیں، اور عیسوی وہ ہے جو اسے اپنے سامنے ظاہر کرے۔\n\nاور عیسوی وہ ہے جس کے لیے ایک دن گواہی کے وقت نبیوں کے درمیان اس کے جھنڈے بلند کیے گئے۔\n\nاور اس کے پاس اس کے باپ (آدم) کی طرف سے ہر خوشبو آئی، جس کی مہک میں وحی کے ذریعے اس کے نشانات (اعلام) ہیں۔\n\nاس کے لیے حیات ہے، پس وہ اس کے ذریعے جسے چاہے زندہ کرتا ہے، نہ وہ مرتا ہے اور نہ اس کے دن اسے فنا کرتے ہیں۔\n\nپس اگر تم اسے دیکھو جب اس کی آیت اس کے پاس آتی ہے، جو کائنات میں اپنے احکام ظاہر کرنے کے لیے کوشاں ہے۔\n\nوہ اس زبان سے سامنا کر رہا ہے کہ \"کیا تم نے ہی ان سے کہا تھا کہ تم اللہ ہو؟\" اور وہ (عیسیٰ) اللہ کی نشانی ہے۔\n\nاس کا جواب ہے: \"جو کہا گیا وہ کہا گیا، پس معاف فرما دے، اور اس شخص کے جرم کو نہ دیکھ جسے اس کے گناہ نے ہلاک کر دیا۔\"\n\nمخلوق کے معبود نے اس شخص پر درود بھیجا، جس نے عطا کیا اور جسے عطا کیا گیا اس نے اس کی عزت کی۔\n\n### [دو وراثتیں: روحانی اور محمدی]\n\nجان لو، اللہ تعالیٰ روح القدس کے ذریعے تمہاری تائید فرمائے، ہم تمہیں بتا چکے ہیں کہ اقطاب میں سے عیسوی وہ ہے جس کے لیے دو وراثتیں جمع کر دی گئی ہیں: روحانی وراثت (الميراث الروحاني) جس کے ذریعے انفعال (اثر اندازی) واقع ہوتی ہے، اور محمدی وراثت (الميراث المحمدي)، لیکن یہ سب حضرت عیسیٰ علیہ السلام کے ذوق کے مطابق ہوتا ہے۔ یہ ضروری ہے۔ ہم ان کے مقامات اور احوال بیان کر چکے ہیں، پس اس باب میں ہم ان کے اسرار میں سے کچھ ذکر کرتے ہیں۔\n\n### [حال کا لمس یا معانقہ کے ذریعے سرایت کرنا]\n\nان اسرار میں سے ایک یہ ہے کہ جب وہ کسی شخص کو ان احوال (روحانی کیفیات) میں سے کوئی حال دینا چاہتے ہیں جن پر وہ قائم ہیں اور جو ان کے اختیار میں ہیں، اس استعداد کی بنا پر جو وہ اس شخص میں دیکھتے ہیں، خواہ کشف (الکشف) کے ذریعے یا تعریف الٰہی (التعريف الإلهي) کے ذریعے، تو وہ اس شخص کو چھوتے ہیں، یا اسے گلے لگاتے ہیں، یا اسے بوسہ دیتے ہیں، یا اسے اپنا کوئی لباس دیتے ہیں، یا اسے کہتے ہیں کہ اپنا کپڑا پھیلاؤ۔ پھر وہ اس میں سے چلو بھر کر ڈالتے ہیں جو وہ اسے دینا چاہتے ہیں۔ حاضرین دیکھتے ہیں کہ وہ ہوا میں چلو بھرتے ہیں اور اس کے کپڑے میں ڈال دیتے ہیں، جتنے چلو بھرنے کا انہیں حکم دیا جاتا ہے۔ پھر وہ اس سے کہتے ہیں کہ اپنے کپڑے کو چاروں طرف سے سمیٹ کر اپنے سینے سے لگا لو، یا اسے اس حال کے مطابق پہن لو جو وہ اسے عطا کرنا چاہتے ہیں۔ وہ ان میں سے جو بھی فعل کرتے ہیں، وہ حال اسی وقت اس مامور شخص میں سرایت کر جاتا ہے اور تاخیر نہیں ہوتی۔ ہم نے یہ اپنے بعض شیوخ کے لیے دیکھا ہے جو عام لوگوں کے پاس آتے تھے اور مجھ سے کہتے تھے کہ \"اس شخص میں استعداد ہے\"۔ پس وہ اس کے قریب جاتے، اور جب اسے چھوتے یا اپنے سینے سے اس کی پیٹھ پر مارتے، اس نیت سے کہ جو وہ چاہتے ہیں اسے عطا کر دیں، تو وہ حال اسی لمحے اس میں سرایت کر جاتا، اور وہ اس کیفیت سے نکل جاتا جس میں وہ تھا، اور اپنے رب کی طرف متوجہ ہو جاتا۔ مکی الواسطی، جو مکہ میں مدفون ہیں اور ازداشیر کے شاگرد تھے، ان کا بھی یہی حال تھا۔ جب ان پر کوئی حال طاری ہوتا تو وہ اپنے حاضرین میں سے کسی سے کہتے کہ \"مجھے گلے لگاؤ\"۔ یا حاضر شخص ان کا معاملہ جانتا ہوتا، اور جب انہیں اس حال میں ملبوس دیکھتا تو انہیں گلے لے لیتا، اور وہ حال اس شخص میں سرایت کر جاتا اور وہ اس سے متلبس ہو جاتا۔ جابر بن عبداللہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی کہ وہ گھوڑے کی پیٹھ پر ثابت قدم نہیں رہتے، تو آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے ان کے سینے پر مارا، اس کے بعد وہ کبھی گھوڑے کی پیٹھ سے نہیں گرے۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اپنے ایک صحابی کی سواری کو، جو سست رفتار تھی اور لوگوں کے پیچھے چل رہی تھی، کچوکا لگایا۔ جب آپ صلی اللہ علیہ وسلم نے اسے کچوکا لگایا تو اس کا مالک اسے قابو نہ کر سکا اور وہ تمام سواریوں سے آگے نکل گئی۔ اور جس دن رسول اللہ صلی اللہ علیہ وسلم کے مویشیوں پر حملہ ہوا، آپ صلی اللہ علیہ وسلم نے ابو طلحہ رضی اللہ عنہ کے ایک سست رفتار گھوڑے پر سواری کی، تو رسول اللہ صلی اللہ علیہ وسلم نے اس گھوڑے کے حق میں فرمایا: \"ہم نے اسے سمندر پایا۔\" اس کے بعد وہ کبھی پیچھے نہیں رہا۔\n\nاور ابو ہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی کہ وہ جو کچھ آپ صلی اللہ علیہ وسلم سے سنتے ہیں بھول جاتے ہیں۔ آپ صلی اللہ علیہ وسلم نے ان سے فرمایا: \"اے ابو ہریرہ! اپنی چادر پھیلاؤ۔\" پس ابو ہریرہ رضی اللہ عنہ نے اپنی چادر پھیلائی، تو رسول اللہ صلی اللہ علیہ وسلم نے ہوا سے ایک چلو یا تین چلو بھرے اور ابو ہریرہ کی چادر میں ڈال دیے، اور ان سے فرمایا: \"اپنی چادر کو اپنے سینے سے لگا لو۔\" پس انہوں نے اسے اپنے سینے سے لگا لیا، تو اس کے بعد وہ کوئی بھی سنی ہوئی چیز نہیں بھولے۔\n\nاور یہ سب اسی مقام سے ہے۔\n\n### [سببیت اور اسمائی نسبتیں]\n\nپس اس امر کے راز پر غور کرو کہ ان میں سے کوئی بھی چیز کسی محسوس حرکت کے بغیر ظاہر نہیں ہوئی، تاکہ ان اسباب کو ثابت کیا جائے جو اللہ نے مقرر کیے ہیں، تاکہ یہ معلوم ہو جائے کہ امر الٰہی (حکم الٰہی) ٹوٹتا نہیں ہے اور وہ بذات خود اسی حد پر قائم ہے۔ عارف اس سے اسماء الٰہیہ (الأسماء الإلهية) کی نسبتوں کو جانتا ہے اور یہ بھی جانتا ہے کہ کائنات کا وجود ان نسبتوں سے کیسے جڑا ہوا ہے، اور یہ کہ یہ سب کچھ حضرہ الٰہیہ (الحضرة الإلهية) کا تقاضا ہے، اس کی ذات کے لیے۔ پس محقق عالم ان امور اور الٰہی تنبیہات کے ذریعے اس بات پر متوجہ ہوتا ہے کہ حکمت اسی میں ہے جو ظاہر ہوا، اور یہ کہ یہ تبدیل نہیں ہو سکتا، اور اسباب کبھی ختم نہیں ہوتے۔ اور جس نے یہ دعویٰ کیا کہ اس نے کسی سبب کو بغیر کسی سبب کے ختم کر دیا، تو اسے نہ اس چیز کا علم ہے جس سے وہ سبب ختم ہوا اور نہ اس چیز کا جو ختم ہوئی۔ پس بندے کو علم اور اس پر عمل سے بہتر کوئی چیز عطا نہیں کی گئی۔ اور یہ اللہ تعالیٰ کے باادب بندوں کے احوال ہیں۔\n\n### [بیان کا اعجاز اور قرآن کا اعجاز]\n\nان کے اسرار میں سے یہ بھی ہے کہ وہ گفتگو میں بلاغت کے ابواب میں کلام کرتے ہیں اور قرآن کے اعجاز کو جانتے ہیں۔ حالانکہ ان کے بارے میں یہ معلوم نہیں کہ انہوں نے عربی زبان کا علم اور اس میں مہارت، ادبی کتابیں پڑھنے کے مروجہ طریقے سے حاصل کی ہو، جس سے یہ معلوم ہو کہ انہوں نے یہ علم اس ذریعے سے حاصل کیا ہے۔ بلکہ یہ انہیں الٰہی عطیات (الہبات الإلهية) کے ذریعے ایک خاص طریقے سے حاصل ہوتا ہے جسے وہ اپنی ذات سے جانتے ہیں، جب انہیں ان حقائق (الحقائق) کے اظہار کے لیے عبارت دی جاتی ہے جو ان کے باطن پر وارد ہوتے ہیں۔ وہ امی (ان پڑھ) ہوتے ہیں، اگرچہ وہ نقش و نگار کے ذریعے لکھنا جانتے ہوں، لیکن وہ عام لوگوں میں سے ہوتے ہیں۔ پس وہ ایسی باتیں کرتے ہیں جو ان کی قوت سے معمول کے مطابق باہر ہوتی ہیں، کیونکہ وہ عرب نہیں ہوتے، اور اگر وہ عرب ہوں بھی تو صرف نسب کے لحاظ سے، زبان کے لحاظ سے نہیں۔ پس اس میں اعجاز اسی سے پہچانا جاتا ہے۔ اور اسی سے قرآن کا اعجاز معلوم ہوتا ہے۔ اور یہ ذات حق (الحق) کا قول ہے۔ مجھے بعض واقعات میں کہا گیا: \"کیا تم جانتے ہو کہ قرآن کا اعجاز کیا ہے؟\" میں نے کہا: \"نہیں۔\" فرمایا: \"اس کا اعجاز یہ ہے کہ وہ حق (الحق) کی خبر ہے۔ تم حق کو لازم پکڑو، تمہارا کلام معجزہ بن جائے گا۔\" کیونکہ قرآن کا مقابلہ کرنے والا سب سے پہلے جس چیز میں جھوٹ بولتا ہے وہ یہ ہے کہ وہ اسے اللہ کی طرف منسوب کرتا ہے حالانکہ وہ اللہ کی طرف سے نہیں ہوتا، پس وہ اللہ پر وہ بات کہتا ہے جو وہ نہیں جانتا، لہٰذا وہ نہ پھل دیتا ہے اور نہ ثابت ہوتا ہے، کیونکہ باطل مٹنے والا ہے اور اس میں کوئی ثبات نہیں۔ پھر وہ اپنے کلام میں اس سورت کے مناسب امور کی خبر دیتا ہے جس کا وہ مقابلہ کرنا چاہتا ہے، ایسے الفاظ میں جو اس کے مناسب ہوں، لیکن وہ امور نہ واقع ہوئے اور نہ موجود تھے، پس وہ باطل ہیں۔ اور باطل عدم (عدم) ہے، اور عدم وجود (الوجود) کا مقابلہ نہیں کر سکتا۔ اور قرآن ایک وجودی امر کی خبر ہے جو نفس الامر میں حق ہے۔ لہٰذا مقابلہ کرنے والا اس کی مثال لانے سے عاجز ہو جاتا ہے۔ پس جس نے اپنے افعال، اقوال اور احوال میں حق کو لازم پکڑا، وہ اپنے زمانے کے لوگوں اور ہر اس شخص سے ممتاز ہو گیا جس نے اس کا راستہ اختیار نہیں کیا، اور اس نے ہر اس شخص کو عاجز کر دیا جو ناحق اس کے مقام کا تصور کرنا چاہتا تھا۔\n\n### [ابو عبداللہ الغزال اور ان کے شیخ ابن العریف]\n\nان کے اسرار میں سے یہ بھی ہے کہ وہ طبائع (فطرتوں) کا علم، ان کی ترکیب، ان کا تجزیہ اور ادویات کے فوائد کو کشف (الکشف) کے ذریعے جانتے ہیں۔ ہمارے شیخ ابو عبداللہ الغزال، جو المریہ میں تھے، اللہ ان پر رحم فرمائے، اپنے سلوک کے دوران اپنے شیخ ابو العباس ابن العریف کی مجلس سے نکلے (ابن العریف اپنے زمانے کے ادیب تھے)۔ وہ الصماد کے راستے پر ایک گھاس کے میدان میں تھے کہ انہوں نے دیکھا کہ اس چراگاہ کی تمام جڑی بوٹیاں ان سے اپنے فوائد کے بارے میں مخاطب ہو رہی ہیں۔ درخت یا پودا ان سے کہتا ہے: \"مجھے لے لو، میں فلاں چیز کے لیے فائدہ مند ہوں اور فلاں نقصان کو دور کرتی ہوں۔\" یہاں تک کہ وہ حیران رہ گئے اور ہر پودے کی پکار سے پریشان ہو گئے جو محبت اور قربت کے اظہار کے لیے انہیں پکار رہا تھا۔ پس وہ شیخ کے پاس واپس آئے اور انہیں اس سے آگاہ کیا۔ شیخ نے ان سے کہا: \"تم نے ہماری خدمت کس لیے کی؟ جب ان درختوں نے تم سے کہا کہ وہ نفع بخش اور نقصان دہ ہیں، تو نفع دینے والا اور نقصان پہنچانے والا (الضار النافع) تمہارے نزدیک کہاں تھا؟\" انہوں نے کہا: \"اے میرے آقا! توبہ۔\" شیخ نے ان سے کہا: \"اللہ نے تمہیں آزمایا اور تمہارا امتحان لیا۔ میں نے تمہیں صرف اللہ کی طرف رہنمائی کی ہے، نہ کہ کسی اور کی طرف۔ تمہاری توبہ کی سچائی یہ ہے کہ تم اس جگہ واپس جاؤ، اور اگر تم اپنی توبہ میں سچے ہو تو وہ درخت جو تم سے بات کر رہے تھے، وہ تم سے بات نہیں کریں گے۔\" پس ابو عبداللہ الغزال اس جگہ واپس گئے، تو انہوں نے وہ کچھ نہیں سنا جو پہلے سنا تھا۔ پس انہوں نے اللہ کا شکر ادا کرتے ہوئے سجدہ کیا اور شیخ کے پاس واپس آ کر انہیں بتایا۔ شیخ نے فرمایا: \"الحمد للہ (تمام تعریفیں اللہ کے لیے ہیں) جس نے تمہیں اپنے لیے چن لیا اور تمہیں اپنی مخلوقات میں سے کسی ایسی مخلوق کی طرف نہیں دھکیلا جس سے تم شرف حاصل کرو، حالانکہ حقیقت میں وہ تم سے شرف حاصل کرتی ہے۔\" پس ان کی ہمت (رضی اللہ عنہ) پر غور کرو۔\n\n### [اسباب، ذات حق کے اپنے حجاب کے پیچھے سے التجلی (ظہور الٰہی) کے طور پر]\n\nاور جب وہ طبائع کے اسرار کو جان لیتا ہے اور ان کی حقائق (حقائق) پر واقف ہو جاتا ہے، تو وہ ان اسماء الٰہیہ (الأسماء الإلهية) میں سے نصف کو جان لیتا ہے جو اللہ نے آدم علیہ السلام کو سکھائے تھے۔ یہ عجیب علوم ہیں۔ جب اللہ نے ہمیں اس طریقے سے ان پر مطلع کیا تو ہم نے ایک ہولناک امر دیکھا اور ہم نے اللہ کے راز کو اس کی مخلوق میں جانا، اور یہ کہ ہر چیز میں اقتدار الٰہی (الاقتدار الإلهي) کا راز کیسے سرایت کیے ہوئے ہے۔ پس کوئی چیز نفع نہیں دیتی مگر اس کے ذریعے، اور نہ نقصان پہنچاتی ہے مگر اس کے ذریعے، اور نہ بولتی ہے مگر اس کے ذریعے، اور نہ حرکت کرتی ہے مگر اس کے ذریعے۔ اور دنیا کو صورتوں کے ذریعے حجاب میں رکھا گیا، پس لوگوں نے یہ سب کچھ اپنی ذات اور اشیاء کی طرف منسوب کر دیا۔ اور اللہ تعالیٰ فرماتا ہے:\n**يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ** (اے لوگو! تم ہی اللہ کے محتاج ہو)۔\nاور اس کا کلام حق ہے اور یہ ایک خبر ہے، اور ایسی خبروں میں نسخ (منسوخ ہونا) داخل نہیں ہوتا۔ پس اللہ کے سوا کسی کی طرف فقر (محتاجی) نہیں ہے۔ پس اس آیت میں اللہ نے ہر اس چیز کے نام سے خود کو موسوم کیا ہے جس کی طرف فقر ہوتا ہے۔ اور اسی باب سے وہ فقیر ہوتا ہے جو ہر چیز کا محتاج ہو، لیکن کوئی چیز اس کی محتاج نہ ہو۔ پس وہ اسباب کو ان کے حکمی (حکمت پر مبنی) اوضاع کے مطابق اختیار کرتا ہے اور ان میں سے کسی کو بھی ترک نہیں کرتا۔ یہ ذوق عزیز ہے؛ ہم نے اپنے دیکھے ہوئے لوگوں میں سے کسی کو اس پر نہیں پایا، اور نہ ہی متقدمین یا متاخرین میں سے کسی کے بارے میں سن کر ہم تک یہ بات پہنچی ہے۔ البتہ ہم نے ایک جماعت کے بارے میں اسباب کے اثبات کو دیکھا اور سنا ہے، لیکن یہ اس باب سے نہیں ہے۔ کیونکہ جس چیز کا ہم ذکر کر رہے ہیں اور جس کے طالب ہیں، وہ ہے اسباب میں الوہیت کا سرایت کرنا، یا اسباب کے حجاب کے پیچھے سے اسباب کی عینیت میں ذات حق (الحق) کے التجلی (ظہور الٰہی)، یا اسباب کا الوہیت میں سرایت کرنا۔ یہ وہ چیز ہے جس کا ذائقہ چکھنے والا ہمیں سوائے اللہ تعالیٰ کے قول کے نہیں ملا۔ پس یہ قرآن میں ایک یتیم آیت ہے، جس کی قدر نہیں پہچانی جاتی، کیونکہ اس کی کوئی قیمت نہیں ہے، اور ہر وہ چیز جس کی کوئی قیمت نہ ہو، یہ بالضرورت ثابت ہے کہ وہ مجهول القدر ہے، اگرچہ تم اسے نفیس ہی سمجھو۔\n\n### [دو نشأتیں: طبعی اور روحانی]\n\nان کے اسرار میں سے یہ بھی ہے کہ دنیا میں دو نشأتوں (پیدائشوں) کی معرفت، جو کہ نشأۃ طبیعیہ (طبعی پیدائش) اور نشأۃ روحانیہ (روحانی پیدائش) ہیں اور ان کی اصل کیا ہے؛ اور دار آخرت میں دو نشأتوں کی معرفت، جو طبعی اور روحانی ہیں اور ان کی اصل کیا ہے؛ اور دنیا کی نشأۃ اور آخرت کی نشأۃ کی معرفت۔ پس یہ چھ علوم ہیں جن کا جاننا ضروری ہے۔\n\n### [بشری عبودیت اور الٰہی قوتیں]\n\nان کے اسرار میں سے یہ ہے کہ ان میں سے کوئی بھی شخص ایسا نہیں جس کے لیے یہ مقام کامل ہوا ہو مگر اسے چھ سو الٰہی قوتیں عطا کی جاتی ہیں جو اسے اپنے قریبی دادا (باپ کی طرف سے) سے وراثت میں ملی ہیں۔ پس وہ ان کے تقاضے کے مطابق ان کے ذریعے عمل کرتا ہے۔ اگر چاہے تو انہیں چھپا لے اور اگر چاہے تو ظاہر کرے۔ اور چھپانا افضل ہے، کیونکہ عبودیت (العبودة) تو قوی (اللہ) سے صرف وہ چیز لیتی ہے جس سے وہ اپنے آقا کے احکام کا حق ادا کرنے میں مدد لے، تاکہ اس کی عبودیت کا حکم ثابت رہے۔ اور ہر وہ قوت جو اسے ارادے کے ساتھ اس باب سے نکال دے، وہ اللہ کے بندوں کے لیے مطلوب نہیں ہے، کیونکہ وہ \"ذو القوۃ المتین\" (طاقتور، مضبوط قوت والے) سے مقابلہ نہیں کرتے۔ اللہ نے ان سے صرف اپنی عبادت میں مدد مانگنے کا مطالبہ کیا ہے، نہ کہ یہ کہ وہ ان قوتوں کے ذریعے بادشاہ یا رب بن کر ظاہر ہوں، جیسا کہ اہل کتاب کے ایک گروہ نے گمان کیا جنہوں نے عیسیٰ کو رب بنا لیا تھا۔ انہوں نے کہا کہ محمد ہم سے مطالبہ کرتے ہیں کہ ہم ان کی عبادت کریں جیسا کہ ہم نے عیسیٰ کی عبادت کی تھی۔ پس اللہ تعالیٰ نے نازل فرمایا:\n**قُلْ يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَىٰ كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِّن دُونِ اللَّهِ** (کہہ دو اے اہل کتاب! آؤ ایک ایسی بات کی طرف جو ہمارے اور تمہارے درمیان یکساں ہے، کہ ہم اللہ کے سوا کسی کی عبادت نہ کریں اور نہ اس کے ساتھ کسی چیز کو شریک ٹھہرائیں اور نہ ہم میں سے کوئی دوسرے کو اللہ کے سوا رب بنا لے)۔\n\n### [عیسویوں کے معراج]\n\nان کے اسرار میں سے یہ بھی ہے کہ وہ اپنے معارج (روحانی عروج) میں اپنے باپ (عیسیٰ) کی طرف سے دوسرے آسمان سے آگے نہیں بڑھتے، مگر یہ کہ وہ جدِ اقرب (قریبی دادا) کی طرف متوجہ ہوں۔ پس بعض اوقات ان میں سے کچھ سدرۃ المنتہیٰ تک پہنچ جاتے ہیں، اور یہ وہ مرتبہ ہے جہاں تک بندوں کے اعمال پہنچتے ہیں اور اس سے آگے نہیں بڑھتے۔ اور وہاں سے ذات حق (الحق) انہیں قبول فرماتا ہے، اور وہ قیامت کے دن تک ان اعمال کا برزخ ہے، جس دن اس عمل کا مالک فوت ہو گا۔ اور اس جماعت کے اسرار کے علم کے لیے یہ مقدار کافی ہے۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\nبیسواں حصہ مکمل ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "(باب سی و هفتم در معرفت اقطاب عیسویین و اسرارشان)\n\nپس بدان، خداوند تو را به روح القدس (روح القدس) تأیید کند که:\n\n> قطب کسی است که گام‌هایش در امر (الهی) ثابت شده است *** و عیسوی کسی است که آن را پیش روی خود آشکار می‌سازد.\n> و عیسوی کسی است که روزی پرچم‌هایش *** در میان پیامبران در صحنه شهود (الإشهاد) برافراشته شد.\n> و از پدرش هر بویی به او رسید *** که نشانه‌هایش در بوییدن، همچون مشک با وحی است.\n> زندگی از آن اوست و هر که را بخواهد با آن زنده می‌کند *** پس نمی‌میرد و روزگاران او را فانی نمی‌سازد.\n> اگر او را ببینی در حالی که آیتش به سویش آمده است *** می‌کوشد تا احکامش را در هستی‌ها (الأکوان) آشکار سازد.\n> با زبانی روبرو می‌شود که: «تو به آنان گفتی» *** که تو خدایی، در حالی که او (عیسوی) نشانه‌ای از حق (الله) است.\n> پاسخ او این است که: «آنچه گفته شد، گفته شده است، پس ببخش و نگاه مکن *** به گناه کسی که جرمش او را به هلاکت رسانده است.»\n> درود فرستد بر او خدای آفرینش، بر مردی *** که بخشید و کسی را که به او بخشید، گرامی داشت.\n\n### [دو میراث: روحانی و محمدی]\n\nبدان، خداوند تو را به روح القدس (روح القدس) تأیید کند، ما به تو شناساندیم که عیسوی از اقطاب (الأقطاب) کسی است که دو میراث برای او جمع شده است: میراث روحانی که انفعال (تأثیرپذیری) به واسطه آن رخ می‌دهد، و میراث محمدی؛ اما این امر ناگزیر باید از ذوق عیسی (علیه السلام) باشد. ما مقامات و احوال آنان را بیان کردیم، پس در این باب مختصری از اسرارشان را ذکر می‌کنیم.\n\n### [سریال حال (انتقال حالت عرفانی) از طریق لمس یا در آغوش گرفتن]\n\nاز جمله اسرارشان این است که هرگاه بخواهند حالی از احوالی را که بر آن هستند و تحت سلطه ایشان است، به کسی ببخشند، به دلیل استعدادی که در آن شخص می‌بینند، چه از طریق کشف (الکشف) و چه از طریق تعریف الهی، آن شخص را لمس می‌کنند یا در آغوش می‌گیرند یا می‌بوسند یا جامه‌ای از لباس خود به او می‌دهند یا به او می‌گویند: «جامه خود را بگستران.» سپس از آنچه می‌خواهند به او ببخشند، برایش غرفه‌ای (مقداری) برمی‌دارند، در حالی که حاضران می‌بینند که آنان از هوا برمی‌دارند و به اندازه غرفه‌هایی که برایشان تعیین شده، در جامه او قرار می‌دهند. سپس به او می‌گویند: «جامه خود را که اطرافش جمع شده، به سینه خود بچسبان» یا «آن را بپوشان» به اندازه حالی که می‌خواهند به او ببخشند. هر کاری از این‌ها که انجام دهند، آن حال در همان لحظه در آن شخص مأمور و مورد نظر جاری می‌شود و تأخیری ندارد. ما این را در مورد برخی از شیوخ خود دیده‌ایم که نزد گروهی از عوام می‌آمدند و به من می‌گفتند: «این شخص استعداد دارد.» پس به او نزدیک می‌شد و اگر او را لمس می‌کرد یا با سینه خود به پشت او می‌زد، با قصد بخشیدن آنچه می‌خواست، آن حال در همان ساعت در او جاری می‌شد و از آنچه در آن بود خارج می‌شد و به پروردگارش روی می‌آورد. مکی الواسطی مدفون در مکه، شاگرد اردشیر، نیز این حال را داشت؛ هرگاه حالی او را فرا می‌گرفت، به حاضران می‌گفت: «مرا در آغوش بگیر» یا حاضر امر او را می‌دانست و چون او را متلبس به حالش می‌دید، در آغوشش می‌گرفت و آن حال در آن شخص جاری می‌شد و او نیز متلبس به آن می‌گشت. جابر بن عبدالله به رسول خدا (صلی الله علیه و سلم) شکایت کرد که بر پشت اسب ثابت نمی‌ماند، پس پیامبر با دست خود بر سینه او زد و پس از آن دیگر از پشت اسب نیفتاد. و رسول خدا (صلی الله علیه و سلم) بر مرکوبی که زیر دست یکی از اصحابش بود و کند راه می‌رفت و در آخر مردم حرکت می‌کرد، با عصا زد. پس از آنکه بر آن زد، صاحبش نتوانست آن را نگه دارد و از همه سواران پیشی می‌گرفت. و رسول خدا (صلی الله علیه و سلم) در روزی که به چراگاه شتران حمله شد، بر اسب کُندِ ابی طلحه سوار شد و در حق آن اسب فرمود: «ما آن را دریایی یافتیم.» و پس از آن دیگر کسی از آن پیشی نگرفت.\n\nو ابوهریره به رسول خدا (صلی الله علیه و سلم) شکایت کرد که آنچه از ایشان می‌شنود، فراموش می‌کند. پس به او فرمود: «ای ابوهریره، ردای خود را بگستران.» ابوهریره ردای خود را گسترد و رسول خدا (صلی الله علیه و سلم) یک یا سه غرفه از هوا برداشت و در ردای ابوهریره انداخت و به او فرمود: «ردای خود را به سینه بچسبان.» او ردا را به سینه چسباند و پس از آن دیگر هیچ چیز از آنچه می‌شنید، فراموش نکرد.\n\nو این همه از این مقام است.\n\n### [سببیت و نسبت‌های اسمائی]\n\nپس در راز این امر بنگر که هیچ یک از این‌ها جز با حرکتی محسوس ظاهر نشد تا اسبابی را که خداوند قرار داده است، اثبات کند؛ تا دانسته شود که امر الهی نقض نمی‌شود و در ذات خود بر همین حد است. عارف از این طریق، نسبت‌های اسماء الهی و آنچه از وجود کائنات به آن‌ها مرتبط است را می‌شناسد و می‌داند که این امر مقتضای ذات حضرت الهیه است. پس عالم محقق با این امور و تنبیهات الهی متوجه می‌شود که حکمت در آنچه ظاهر شده است، نهفته است و آن حکمت تغییر نمی‌کند و اسباب هرگز برداشته نمی‌شوند. و هر کس گمان کند که سببی را بدون سبب دیگری برداشته است، نه به آنچه با آن برداشته شده و نه به آنچه برداشته شده، علم ندارد. پس به هیچ بنده‌ای چیزی بهتر از علم و عمل به آن عطا نشده است، و این‌ها احوال مؤدبان از بندگان خداوند متعال است.\n\n### [اعجاز بیان و اعجاز قرآن]\n\nو از اسرارشان نیز این است که در فصول بلاغت در سخن گفتن، سخن می‌گویند و اعجاز قرآن را می‌دانند، در حالی که از آنان دانشی به زبان عرب و تحقق به آن به شیوه معمول از طریق خواندن کتب ادبی، شناخته نشده و حاصل نشده است که بدانیم این علم را از این جهت به دست آورده‌اند؛ بلکه این برای آنان از عطایای الهی و از طریق خاصی بوده که خودشان آن را از درون خویش می‌شناسند، هنگامی که بیان حقایقی که در باطنشان وارد می‌شود، به آن‌ها داده می‌شود. آنان امی (درس نخوانده) هستند، هرچند ممکن است نوشتن را از طریق نقش‌نگاری نیکو بدانند، اما از عوام مردم هستند. پس به چیزی سخن می‌گویند که به طور معمول خارج از توانایی آن‌هاست، زیرا یا از عرب نبوده‌اند، و اگر هم از عرب بوده‌اند، تنها به نسبت (نژاد) عرب بوده‌اند نه به زبان (فصاحت). پس اعجاز در آن شناخته می‌شود. از همین جا اعجاز قرآن شناخته می‌شود. و این سخن حق (الحق) است. در برخی وقایع به من گفته شد: «آیا می‌دانی اعجاز قرآن چیست؟» گفتم: «نه.» فرمود: «اینکه خبر از حقی می‌دهد. به حق ملتزم باش تا کلامت معجز شود.» زیرا معارض قرآن اولین چیزی که در آن دروغ می‌گوید این است که آن را از جانب خدا می‌داند، در حالی که از جانب خدا نیست، پس بر خدا چیزی می‌گوید که نمی‌داند، لذا ثمری نمی‌دهد و ثابت نمی‌ماند، زیرا باطل رفتنی است و ثباتی ندارد. سپس در کلام خود از اموری خبر می‌دهد که مناسب با سوره‌ای است که می‌خواهد با آن معارضه کند، با اموری که در الفاظ با آن تناسب دارند، در حالی که آن امور واقع نشده و وجود نداشته‌اند، پس باطل هستند. و باطل، عدم است و عدم نمی‌تواند در برابر وجود (الوجود) مقاومت کند. و قرآن خبر از امری وجودی و حق در نفس‌الامر می‌دهد، پس ناگزیر معارض از آوردن مانند آن عاجز می‌ماند. پس هر کس در افعال و اقوال و احوال خود ملتزم به حق (الحق) باشد، از اهل زمان خود و از هر کس که راه او را نپیموده، متمایز شده است و هر کس بخواهد بدون حق، مقام او را تصور کند، عاجز می‌ماند.\n\n### [ابوعبدالله الغزال و شیخ او ابن العریف]\n\nو از اسرارشان نیز علم طبایع و تألیف و تحلیل آن‌ها و منافع داروهاست که این را از طریق کشف (الکشف) می‌دانند. شیخ ما ابوعبدالله الغزال که در المریه بود (رحمه الله)، در حال سلوک خود از مجلس شیخ خود ابوالعباس بن العریف خارج شد، در حالی که ابن العریف ادیب زمان خود بود. او در منطقه احرش در راه صماد حیه بود که دید تمام گیاهان آن مرغزار با او سخن می‌گویند و منافع خود را به او می‌شناسانند. درخت یا گیاه به او می‌گفت: «مرا بگیر، زیرا برای فلان چیز سودمندم و فلان ضرر را دفع می‌کنم.» تا جایی که مبهوت ماند و از ندای هر گیاهی که از روی محبت و تقرب به او سخن می‌گفت، حیران شد. پس نزد شیخ بازگشت و او را از این امر آگاه ساخت. شیخ به او گفت: «ما برای این به تو خدمت نکردیم. آن ضار و نافع (حق) کجا بود، هنگامی که درختان به تو گفتند که سودمند و زیان‌آورند؟» ابوعبدالله گفت: «ای سرورم، توبه.» شیخ به او گفت: «خداوند تو را آزمود و امتحان کرد، زیرا من تو را جز به سوی خدا راهنمایی نکردم، نه به سوی غیر او. نشانه صدق توبه‌ات این است که به آن مکان بازگردی و اگر در توبه‌ات صادق باشی، آن درختانی که با تو سخن گفتند، دیگر با تو سخن نگویند.» پس ابوعبدالله الغزال به آن مکان بازگشت و هیچ یک از آنچه شنیده بود، نشنید. پس سجده شکر به جای آورد و نزد شیخ بازگشت و او را آگاه ساخت. شیخ گفت: «سپاس خدایی را که تو را برای خود برگزید و تو را به سوی کونی از اکوانش (هستی‌هایش) که مانند تو باشد، سوق نداد تا تو به آن شرافت یابی، در حالی که در حقیقت آن کون به واسطه تو شرافت می‌یابد. پس همت او را بنگر، رضی الله عنه.»\n\n### [اسباب به مثابه تجلیات حق از پس حجاب‌هایشان]\n\nو چون اسرار طبایع را بداند و بر حقایق آن‌ها وقوف یابد، نیمی از اسماء الهی را که خداوند به آدم (علیه السلام) آموخت، می‌داند. این‌ها علوم شگفتی هستند. هنگامی که خداوند ما را از این طریق بر آن‌ها آگاه ساخت، امری هولناک دیدیم و از راز خدا در خلقش و چگونگی جریان اقتدار الهی در هر چیز آگاه شدیم. پس هیچ چیز سود نمی‌رساند مگر به واسطه او، و زیان نمی‌رساند مگر به واسطه او، و سخن نمی‌گوید مگر به واسطه او، و حرکت نمی‌کند مگر به واسطه او. و خداوند عالَم را با صورت‌ها محجوب ساخت، پس همه این‌ها را به خود و به اشیاء نسبت دادند، در حالی که خداوند می‌فرماید: «يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله» (ای مردم، شما نیازمندان به سوی خدا هستید). و کلام او حق است و خبری است که نسخ نمی‌پذیرد. پس هیچ فقری جز به سوی خدا نیست. در این آیه، خداوند به هر چیزی که انسان به آن نیازمند است، نامیده شده است. و از این باب، فقیر کسی است که به هر چیزی نیازمند باشد و هیچ چیز به او نیازمند نباشد. پس اسباب را بر اساس وضع حکمی آن‌ها به کار می‌گیرد و هیچ یک از آن‌ها را فرو نمی‌گذارد. این ذوقی است کمیاب؛ ما کسی را که بر آن باشد، در میان کسانی که دیده‌ایم، نیافتیم و به صورت سماع (نقل قول) نیز نه در متقدمان و نه در متأخران به ما نرسیده است. اما اثبات اسباب را از جماعتی دیده‌ایم و به ما نقل شده است، ولی این از آن باب نیست. زیرا آنچه ما ذکر می‌کنیم و می‌جوییم، جریان الوهیت در اسباب، یا تجلیات حق (الحق) از پس حجاب اسباب در عین اسباب، یا جریان اسباب در الوهیت است. این همان چیزی است که ما برای آن ذائقه‌ای (کسی که آن را چشیده باشد) نیافتیم، مگر قول خداوند متعال. پس این آیه یگانه در قرآن است که قدرش شناخته نمی‌شود، زیرا قیمتی ندارد، و هر آنچه قیمتی ندارد، به ضرورت ثابت می‌شود که مجهول‌القدر است، حتی اگر نفیس پنداشته شود.\n\n### [دو نشئه: طبیعی و روحانی]\n\nو از اسرارشان نیز معرفت دو نشئه (نشأة) در دنیاست که عبارتند از: نشئه طبیعی و نشئه روحانی و اصل آن‌ها چیست؛ و معرفت دو نشئه در سرای آخرت: طبیعی و روحانی و اصل آن‌ها چیست؛ و معرفت دو نشئه: نشئه دنیا و نشئه آخرت. پس این‌ها شش علم هستند که معرفت آن‌ها ضروری است.\n\n### [عبودیت بشری و نیروهای الهی]\n\nو از اسرارشان این است که هیچ کس از آنان نیست که این مقام برایش کامل شده باشد، مگر اینکه ششصد نیروی الهی به او بخشیده می‌شود که از جد نزدیک پدری خود به ارث برده است. پس با آن نیروها بر حسب آنچه به او عطا می‌کند، عمل می‌کند؛ اگر بخواهد آن‌ها را پنهان می‌سازد و اگر بخواهد آشکار می‌کند، و پنهان کردن برتر است. زیرا عبودیت (بندگی) تنها از قوی (خداوند) چیزی را می‌گیرد که با آن بر ادای حق اوامر سرور خود یاری جوید تا حکم عبودیتش ثابت بماند. و هر نیرویی که او را با قصد از این باب خارج سازد، مطلوب مردان خدا نیست، زیرا آنان با صاحب نیروی استوار (ذا القوة المتین) مزاحمت نمی‌کنند. خداوند از آنان نخواسته است که از او یاری جویند، مگر در عبادتش، نه اینکه با آن نیروها خود را پادشاهان و ارباب نشان دهند، چنانکه گروهی از اهل کتاب که عیسی را رب گرفتند، گمان کردند و گفتند: «محمد از ما می‌خواهد که او را بپرستیم، همان‌گونه که عیسی را پرستیدیم.» پس خداوند متعال نازل فرمود: «قُلْ يا أَهْلَ الْكِتابِ تَعالَوْا إِلى‏ كَلِمَةٍ سَواءٍ بَيْنَنا وبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا الله ولا نُشْرِكَ به شَيْئاً ولا يَتَّخِذَ بَعْضُنا بَعْضاً أَرْباباً من دُونِ الله» (بگو: ای اهل کتاب، بیایید به سوی سخنی که میان ما و شما یکسان است؛ اینکه جز الله را نپرستیم و چیزی را شریک او قرار ندهیم و برخی از ما برخی دیگر را به جای الله به عنوان رب نگیریم).\n\n### [معراج‌های عیسویین]\n\nو از اسرارشان نیز این است که آنان در معراج‌های خود از جهت پدرشان، از آسمان دوم فراتر نمی‌روند، مگر اینکه به جد نزدیک‌تر روی آورند. پس چه بسا برخی از آنان به سدرة المنتهی برسند، و آن مرتبه‌ای است که اعمال بندگان به آنجا ختم می‌شود و از آن فراتر نمی‌رود، و حق (الحق) از آنجا آن‌ها را می‌پذیرد، و آن برزخ آن اعمال است تا روز قیامت که صاحب آن عمل در آن می‌میرد. و این مقدار از علم اسرار این جماعت کافی است. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند). جزء بیستم به پایان رسید.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 4
}