{
  "id": 477,
  "title": {
    "ar": "الباب السابع والسبعون وأربعمائة في حال قطب كان منزله وفي ذلِكَ فَلْيَتَنافَسِ الْمُتَنافِسُونَ ولِمِثْلِ هذا فَلْيَعْمَلِ الْعامِلُونَ",
    "en": "Chapter Four Hundred and Seventy-Seven, Concerning the Spiritual State (حال) of a Pole (قطب) Whose Station (منزل) Was: <<وَفِي ذَلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ>> (And for that let the competitors compete) and <<وَلِمِثْلِ هَذَا فَلْيَعْمَلِ الْعَامِلُونَ>> (And for the like of this let the workers work).",
    "ur": "باب چار سو ستتر (۴۷۷)\n\nایک قطب (قطب) کے حال کے بیان میں جس کا مقام یہ تھا: \"اور اسی میں چاہیے کہ رغبت کرنے والے رغبت کریں\" (وفي ذلِكَ فَلْيَتَنافَسِ الْمُتَنافِسُونَ) اور \"اور اسی جیسی چیز کے لیے عمل کرنے والوں کو عمل کرنا چاہیے\" (ولِمِثْلِ هذا فَلْيَعْمَلِ الْعامِلُونَ)۔",
    "fa": "باب چهارصد و هفتاد و هفتم در بیان حال قطبی که منزلگاهش «و در این [نعمت‌ها] باید رقابت‌کنندگان رقابت کنند» (فِي ذَلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ) و «و برای مانند این [پاداش] باید عمل‌کنندگان عمل کنند» (وَلِمِثْلِ هَذَا فَلْيَعْمَلِ الْعَامِلُونَ) است."
  },
  "content": {
    "ar": "## «الباب السابع والسبعون وأربعمائة في حال قطب كان منزله وفي ذلِكَ فَلْيَتَنافَسِ الْمُتَنافِسُونَ ولِمِثْلِ هذا فَلْيَعْمَلِ الْعامِلُونَ»\n\n\n> الشخص مستدرج والصدر مشروح *** والكنز مستخرج والباب مفتوح‏\n\n\n> أين الأوائل لا كانوا ولا سلفوا *** العقل يقبل ما تأتي به الروح‏\n\n\n> لكنهم حجبوا بالفكر فاعتمدوا *** عليه والعلم موهوب وممنوح‏\n\n\n> ما فيه مكتسب إن كنت ذا نصف *** فليس للعقل تعديل وتجريح‏\n\n\n> العدل والجرح شرع الله جاء به *** ميزانه فبدا نقص وترجيح‏\n\n\n> العقل أفقر خلق الله فاعتبروا *** فإنه خلف باب الفكر مطروح‏\n\n\n> لو لا إلا له ولو لا ما حباه به *** من القوي لم يقم بالعقل تسريح‏\n\n\n> إن العقول قيود إن وثقت بها *** خسرت فافهم فقولي فيه تلويح‏\n\n\n> ميزان شرعك لا تبرح تزين به *** فإن رتبته عدل وتصحيح‏\n\n\n> إن التنافس في علم يقوم به *** صدر بنور شهود الحق مشروح‏\n\n\n> هذا التنافس لا أبغي به بدلا *** له من الذكر قدوس وسبوح‏\n\n\n> لمثل ذا يعمل العمال ليس لهم *** في غير ذلك تحسين وتقبيح‏\n\n\n### [أن كل ما سوى الله حجاب عن الله‏]\n\n\nقال الله تعالى كُلُّ حِزْبٍ بِما لَدَيْهِمْ فَرِحُونَ وموجب الفرح المناسبة ولما علمنا إن الإنسان مجموع ما عند الله علمنا أنه ما عند الله أمر إلا وله إليه نسبة فله منه مناسب فالعالم لا يرمي بشي‏ء من الوجود وإنما يبرز إليه ما يناسبه منه ولا يغلب عليه حال من الأحوال بل هو مع كل حال بما يناسبه كما هو الله معنا أينما كنا فإن أَكْثَرَ النَّاسِ لا يَعْلَمُونَ ذلك بل هم بهذا القدر جاهلون وعنه عمون وهذا هو الذي أداهم إلى ذم الدنيا وما فيها والزهد في الآخرة وفي الكونين وفي كل ما سوى الله وانتقدوا على من شغل نفسه بمسمى هذه كلها وجعلهم في ذلك ما حكي عن الأكابر في هذا النوع وحملوا ألفاظهم على غير وجه ما تعطيه الحقيقة ورأوا أن كل ما سوى الله حجاب عن الله فأرادوا هتك هذا الحجاب فلم يقدروا عليه إلا بالزهد فيه وسأبين هذا الفن في هذا الباب بيانا شافيا وكون الحق كل يوم في شأن الخلق وكون الجنة وهي دار القربة ومحل الرؤية هي دار الشهوات وعموم اللذات ولو كانت حجابا لكان الزهد والحجاب فيها وكذلك الدار الدنيا فأقول إن الله خلق أجناس الخلق وأنواعه وما أبرز من أشخاصه لننظر فيه نظرا يوصلنا إلى العلم بخالقه فما خلقه لنزهد فيه فوجب علينا الانكباب عليه والمثابرة والمحبة فيه لأنه طريق النظر الموصل إلى الحق فمن زهد في الدليل فقد زهد في المدلول وخَسِرَ الدُّنْيا والْآخِرَةَ ذلِكَ هُوَ الْخُسْرانُ الْمُبِينُ وجهل حكمة الله في العالم وجهل الحق وكان من الخاسرين الذين فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ فالرجل كل الرجل من ظهر بصورة الحق في عبودة محضة فأعطى كل ذي حق حقه ويبدأ بحق نفسه فإنها أقرب إليه من كل من توجه له عليه حق من المخلوقين وحق الله أحق بالقضاء وحق الله عليه إيصال كل حق إلى من يستحقه ولِمِثْلِ هذا فَلْيَعْمَلِ الْعامِلُونَ إذ ولا\nبد من إضافة العمل إلينا فإن الله أضاف الأعمال إلينا وعين لنا محالها وأمكنتها وأزمنتها وأحوالها وأمرنا بها وجوبا وندبا وتخييرا كما أنه نهانا عز وجل عن أعمال معينة عين لنا محالها وأماكنها وأزمانها وأحوالها تحريما وتنزيها وجعل لذلك كله جزاء بحساب وبغير حساب من أمور ملذة وأمور مؤلمة دنيا وآخرة وخلقنا وخلق فينا من يطلب الجزاء الملذ وينفر بالطبع عن الجزاء المؤلم وجعل لي وعلي حقا في رعيتى إذ خلق لي نفسا ناطقة مدبرة عاقلة مفكرة مستعدة لقبول جميع ما كلفها به وهي محل خطابه المقصودة بتكليفه وامتثال أوامره ونواهيه والوقوف عند حدوده ومراسمه حيث حد لها ورسم في حق الحق وحق نفسه وحق غيره فيطلبه أصحاب الحقوق بحقوقهم نطقا وحالا ظاهرا وباطنا فيطلبه السمع بحقه والبصر واللسان واليدان والبطن والفرج والقدمان والقلب والعقل والفكر والنفس النباتية والحيوانية والغصبية والشهوانية والحرص والأمل والخوف والرجاء والإسلام والايمان والإحسان وأمثال هؤلاء من عالمه المتصل به وأمره الحق أن لا يغفل عن أحد من هؤلاء أولا ويصرفهم في المواطن التي عين له الحق وجعل هذه القوي كلها متوجهة على هذه النفس الناطقة بطلب حقوقها وجعلها كلها ناطقة بتسبيح الله تعالى جعلا ذاتيا لا تنفك عنه وجعل هذه الحقوق التي توجهت لها على النفس الناطقة الحاكمة على الجماعة ثابتة الحق جزاء لما هي عليه من تسبيح الله بحمده دنيا وآخرة وما منهم من يخالف أمر الله اختيارا وإنه إذا وقعت المخالفة منهم فجبرا يجبرهم على ذلك الوالي عليهم الذي أمروا بالسمع والطاعة له فإن جار فلهم وعليه وإن عدل فلهم وله ولم يعط الله هؤلاء الرعايا الذين ذكرناهم المتصلين به قوة الامتناع مما يجبرهم على فعله بخلاف ما خرج عنهم ممن له أمر فيهم ثم إن الله نعت لهم الجزاء الحسي وأشهدهم إياه في الحياة الدنيا بضرب مثال من نعيم الحياة الدنيا وبالوعد بذلك في الآخرة ومنهم من أشهده ذلك في الأخرى وهو في الحياة الدنيا مشاهدة عين فرأى ما وقع له برؤيته من الالتذاذ ما لا يقدر قدره وما التذ به إلا من يطلب ذلك من رعيته فأخذ يسأله حقه من ذلك وأن لا يمنعه وفي مثل هذا فَلْيَتَنافَسِ الْمُتَنافِسُونَ وأي نفاسة أعظم من هذا فالعارف المكمل المعرفة يعلم أن فيه من يطلب مشاهدة ربه ومعرفته الفكرية والشهودية فتعين عليه إن يؤدي إليهم حقهم من ذلك وعلم أن فيه من يطلب المأكل الشهي الذي يلائم مزاجه والمشرب والمنكح والمركب والملبس والسماع والنعيم الحسي المحسوس فتعين عليه أيضا أن يؤدي إليهم حقوقهم من ذلك التي عين لهم الحق ومن كان هذا حاله كيف يصح له أن يزهد في شي‏ء من الموجودات وما خلقها الله إلا له إلا أنه مفتقر إلى علم ما هو له وما هو لغيره لئلا يقول كل شي‏ء هو له فلا ينظر من الوجوه الحسان إلا ما يعلم أنه له وما يعلم أنه لغيره يكف بصره ويغضه عنه فإنه محجور عليه ما هو لغيره فهذا حظه من الورع والاجتناب والزهد إنما متعلقة الأولوية بخلاف الورع وكل ترك فأما الأولوية فينظر في الموطن ويعمل بمقتضاه ومقتضاه قد عينه له الحق بما أعلمه به بلسان الشارع فسموا من طريق الأخذ بالأولوية زهادا حيث أخذوا بها فإن لهم تناول ذلك في الحياة الدنيا فما فعلوا لأن الله خيرهم فما أوجبه عليهم ولا ندبهم إليه ولا حجر عليهم ولا كرهه فاعلم ذلك ثم إنه ينظر في هذا المخير فيه فلا يخلو حاله في تناوله أن يحول بينه هذا التناول وبين المقام إلا على الذي رجحه له أو لا يحول فإن حال بينه وبينه تعين عليه بحكم العقل الصحيح السليم تركه والزهد فيه وإن كان عَلى‏ بَيِّنَةٍ من رَبِّهِ إن ذلك لا يقدح ولا يحول بينه وبين المرتبة العليا من ذلك فلا فائدة لتركه كما قال لنبيه سليمان عليه السلام هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ ولا تكون ممن تلبس عليه الأمور فيتحيل أنه بزهده فيما هو حق لشخص ما من رعيته ينال‏\n\n\nحظ ما يطلبه به منه شخص آخر من رعيته فإن ذلك عين الجهل فإن تلك الحقيقة تقول له ما هذا عين الحق لي فالأولى بالعبد الذي كلفه الله تدبير نفسه وولاة أن يعلم فإذا علم استعمله علمه حتى يكون بحكم علمه ولا يستعمل هو العلم فإنه إن استعمل علمه كان علمه بحكمه فوقتا يعمل به ووقتا يتركه أي يترك العمل به وما عمل الترك إلا بالعلم وإذا كان العلم يستعمله ويصرفه ويكون هو معمولا مستعملا للعلم حكم عليه جبرا على الصواب فوفى الحقوق أربابها ومثل هذا الإمام في العالم قليل ولذلك يقول ليس السخي من تسخي بماله وإنما السخي من تسخي بنفسه على العلم فكان تحت سلطان علمه هذا\nهو كبير العالم وأما ما ذكرناه من علم الأوامر والنواهي الإلهية فنوردها إن شاء الله في الباب الأخير من هذا الكتاب وبه ختمنا الكتاب وهو باب الوصية فانظر إلى ما يعطيك هذا الهجير من الفوائد وما ذكرت لك ما نتيجة هذه الهجيرات إلا ليكون ذلك باعثا لك على طلب الأنفس وإلا وجه والأولى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 477: Concerning the State of a Pole [Qutb] Whose Station Was: <<And for that let the competitors compete>> (83:26) and <<And for the like of this let the workers work>> (37:61).\n\nThe person is drawn near, the breast is expanded,\nThe treasure is extracted, and the door is open.\n\nWhere are the ancients? They neither existed nor preceded.\nThe intellect accepts what the Spirit (الروح) brings forth.\n\nBut they were veiled by thought (الفكر), so they relied\nupon it, while Knowledge (العلم) is gifted and bestowed.\n\nThere is nothing acquired in it, if you are fair-minded,\nFor the intellect (العقل) has no power of validation or invalidation.\n\nValidation and invalidation are the Law (شرع الله) brought by\nits Balance, whereby deficiency and preponderance become manifest.\n\nThe intellect is the poorest of Allah’s creation, so reflect,\nFor it is cast behind the door of thought.\n\nWere it not for Him, and were it not for the powers He endowed it with,\nThe intellect would not be able to release itself.\n\nIndeed, intellects are fetters; if you trust them,\nYou lose. So understand, for my saying contains an allusion.\n\nDo not cease to adorn yourself with the Balance of your Law (شرعك),\nFor its rank is justice and rectification.\n\nCompetition is in a Knowledge sustained by\na breast expanded by the light of witnessing The Real (شهود الحق).\n\nThis competition—I seek no substitute for it;\nFor it, there is the remembrance of the Holy (قدوس) and the Glorified (سبوح).\n\nFor the like of this do the workers work; they have\nno power of approval or disapproval concerning anything else.\n\n### [That everything other than Allah is a veil from Allah]\n\nAllah the Exalted said: <<Every party rejoices in what they have>> (Quran 30:32). The cause of rejoicing is suitability (المناسبة). Since we know that the human being is the sum total of what is with Allah, we know that there is no matter with Allah except that the human has a relation to it, and thus a suitability from it. The Gnostic (العالم) does not reject anything in Existence (الوجود); rather, what is suitable to him from Existence is manifested to him. No single state dominates him; rather, he is with every state according to what suits him, just as Allah is with us wherever we are. However, <<most people do not know>> (Quran 7:187) this; rather, they are ignorant of this measure and blind to it. This is what led them to condemn the world (الدنيا) and what is in it, and to practice asceticism (الزهد) regarding the Hereafter, regarding the two worlds, and regarding everything other than Allah (ما سوى الله). They criticized those who occupied themselves with the names of all these things. In doing so, they relied upon what was related concerning the great masters (الأكابر) in this matter, interpreting their expressions contrary to what the Reality (الحقيقة) dictates. They held that everything other than Allah is a veil (حجاب) from Allah, and they sought to tear this veil, but they could not do so except through asceticism regarding it.\n\nI shall provide a sufficient explanation (بيانا شافيا) of this subject in this chapter, including the fact that The Real (الحق) is engaged in the affairs of Creation (الخلق) every day, and that Paradise (الجنة)—which is the abode of proximity (القربة) and the place of vision (الرؤية)—is the abode of desires (الشهوات) and universal pleasures (اللذات). If it were a veil, asceticism and veiling would be required there as well, and likewise in the worldly abode.\n\nI say: Allah created the genera and species of creation, and what He manifested of its individuals, so that we might look upon it with a contemplation that leads us to the Knowledge (العلم) of its Creator. He did not create it for us to practice asceticism regarding it. Therefore, we are obliged to devote ourselves to it, to persevere, and to love it, because it is the path of contemplation that leads to The Real. Whoever practices asceticism regarding the proof (الدليل) has practiced asceticism regarding the Proven (المدلول), and <<has lost the world and the Hereafter. That is the manifest loss>> (Quran 22:11). He is ignorant of Allah’s wisdom in the Cosmos (العالم), ignorant of The Real, and is among the losers <<whose trade has not profited, nor were they guided>> (Quran 2:16).\n\nThe true man (الرجل كل الرجل) is he who manifests in the form of The Real (صورة الحق) in pure servitude (عبودة محضة), giving every possessor of a right his due. He begins with the right of his own self, for it is closer to him than any of the created beings who have a right upon him. The right of Allah is most deserving of fulfillment, and Allah’s right upon him is the delivery of every right to whom it is due. <<And for the like of this let the workers work>> (Quran 37:61).\n\nIt is necessary to attribute the action to us, for Allah has attributed actions to us, designated their places, locations, times, and states, and commanded us to perform them as obligatory (وجوبا), recommended (ندبا), or permissible (تخييرا). Likewise, He forbade us, exalted is He, from specific actions, designating their places, locations, times, and states, as prohibited (تحريما) or disliked (تنزيها). For all of this, He established a reward, calculated or uncalculated, consisting of pleasurable matters and painful matters, in this world and the Hereafter. He created us, and created within us, the inclination to seek pleasurable reward and the natural aversion to painful reward.\n\nHe established a right for me and upon me concerning my subjects, since He created for me a rational, governing, intelligent, thinking soul (نفسا ناطقة) prepared to accept all that He has obligated it with. It is the locus of His address, the intended recipient of His obligation, the implementer of His commands and prohibitions, and the observer of His limits and ordinances, as He defined and ordained them concerning the right of The Real, the right of its own self, and the right of others.\n\nThe possessors of rights demand their rights from it, verbally and actually, outwardly and inwardly. The hearing demands its right, and the sight, the tongue, the two hands, the belly, the private parts, the two feet, the heart (القلب), the intellect (العقل), the thought (الفكر), the vegetative and animal souls, the irascible and appetitive souls, greed (الحرص), hope (الأمل), fear (الخوف), Islam, Faith (الإيمان), Spiritual Excellence (الإحسان), and the like of these from its connected cosmos (عالمه المتصل به).\n\nThe Real commanded it not to neglect any of these first, and to employ them in the stations designated for it by The Real. He made all these powers directed toward this rational soul, demanding their rights. He made them all inherently engaged in the glorification (تسبيح) of Allah, a self-existent designation from which they cannot separate. He made these rights, which are directed toward the rational soul that governs the collective, fixed rights (ثابتة الحق) as a reward for their glorification of Allah with His praise, in this world and the Hereafter. None of them willingly disobeys Allah’s command; if disobedience occurs from them, it is by compulsion (جبرا) imposed upon them by the ruler (الوالي) over them, whom they are commanded to hear and obey. If he acts unjustly, it is against him and for them; if he acts justly, it is for him and for them.\n\nAllah did not grant these subjects we mentioned, who are connected to the soul, the power to resist what compels them to act, unlike those outside of them who have authority over them. Then, Allah described the sensory reward (الجزاء الحسي) to them and made them witness it in the worldly life by giving an example of the bliss of worldly life, and by promising it in the Hereafter. Some of them witness the Hereafter while still in the worldly life, a witnessing of the eye, and they see the pleasure that befalls them through this vision, a pleasure whose measure cannot be estimated. Only those among his subjects who seek this pleasure are truly delighted by it. So, they begin to ask him for their right to it and that he should not withhold it from them. <<And for the like of this let the competitors compete>> (83:26). What competition is greater than this?\n\nThe Gnostic (العارف) perfected in gnosis knows that within him are those who seek the witnessing and the intellectual and experiential Gnosis (المعرفة) of his Lord, so it is incumbent upon him to render their due right from that. He knows that within him are those who seek delicious food that suits their temperament, and drink, and marriage, and conveyance, and clothing, and hearing, and sensible sensory bliss (النعيم الحسي المحسوس). It is also incumbent upon him to render their due rights from that, which The Real has designated for them.\n\nHow can one whose state is this rightly practice asceticism regarding anything in existence (الموجودات)? Allah created them only for him. However, he is in need of knowing what belongs to him and what belongs to others, lest he claim that everything belongs to him. Thus, he only looks at beautiful faces (الوجوه الحسان) that he knows are his right. What he knows belongs to another, he restrains his sight and lowers his gaze from it, for he is forbidden what belongs to others. This is his share of piety (الورع), avoidance (الاجتناب), and asceticism (الزهد).\n\nAsceticism is related to priority (الأولوية), unlike piety. As for priority, one looks at the situation and acts according to its requirement, and its requirement has been designated for him by The Real through what He informed him via the tongue of the Lawgiver (الشارع). They were called ascetics because they adopted priority, even though they were permitted to partake of those things in the worldly life, but they did not do so because Allah gave them a choice; He neither made it obligatory nor recommended it, nor did He forbid or dislike it. Know this.\n\nThen, he looks at this matter of choice. His state in partaking of it will either prevent him from the preferred higher station (المقام الأعلى) or it will not. If it prevents him, sound and healthy intellect dictates that he abandon it and practice asceticism regarding it. But if he is <<upon a clear proof from his Lord>> (Quran 11:17) that this does not impair him or prevent him from the higher rank, then there is no benefit in abandoning it, as He said to His Prophet Solomon (peace be upon him): <<This is Our gift; so bestow or withhold without reckoning>> (Quran 38:39).\n\nDo not be among those whose affairs are confused, who imagine that by practicing asceticism regarding what is the right of one person (faculty) among his subjects, he will attain the share sought by another person (faculty) among his subjects, for that is the essence of ignorance (عين الجهل). That Reality will say to him: \"This is not my due right.\"\n\nThe servant whom Allah has tasked with governing his self and his subjects must first know. Once he knows, his knowledge must employ him, so that he acts according to the ruling of his knowledge, and he does not employ the knowledge. For if he employs his knowledge, his knowledge is subject to his ruling, and sometimes he acts upon it and sometimes he abandons the action—and the act of abandonment is only done through knowledge. But if Knowledge employs him and directs him, and he is the one being employed by Knowledge, he is compelled toward correctness (الصواب) and fulfills the rights of their owners.\n\nSuch an Imam (leader) in the Cosmos is rare. Therefore, it is said: \"The generous person is not he who is generous with his wealth, but he who is generous with his self toward Knowledge, so that he remains under the authority of his Knowledge.\" This is the great one of the Cosmos.\n\nAs for what we mentioned concerning the knowledge of divine commands and prohibitions, we shall present them, if Allah wills, in the final chapter of this book, with which we conclude the book, which is the Chapter of Counsel (باب الوصية). Look at the benefits this midday heat (هجير) grants you. I only mentioned the result of these midday journeys so that it might motivate you to seek the most precious things and the most worthy path. And Allah <<speaks the Truth, and He guides to the way>> (Quran 33:4).",
    "ur": "باب نمبر چار سو ستتر (۴۷۷) قطب کے حال کے بیان میں جس کا مقام یہ تھا: \"اور اسی میں رغبت کرنے والوں کو رغبت کرنی چاہیے\" (فِي ذَلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ) اور \"اور اسی جیسی چیز کے لیے عمل کرنے والوں کو عمل کرنا چاہیے\" (وَلِمِثْلِ هَذَا فَلْيَعْمَلِ الْعَامِلُونَ)۔\n\nشخص (سالک) کو تدریجاً کھینچا جاتا ہے اور سینہ کشادہ (مشروح) ہے\nاور خزانہ نکالا جا چکا ہے اور دروازہ کھلا ہے۔\n\nکہاں ہیں وہ اوائل (پہلے لوگ) جو نہ تھے اور نہ ہی گزرے\nعقل وہی قبول کرتی ہے جو روح لاتی ہے۔\n\nلیکن وہ فکر (غور و خوض) سے پردہ میں رہے، پس انہوں نے اسی پر بھروسہ کیا\nحالانکہ علم موہوب (عطا کردہ) اور بخشا ہوا ہے۔\n\nاس میں کوئی کسب (حصول) نہیں، اگر تم انصاف والے ہو\nپس عقل کے لیے نہ تعدیل (درستگی) ہے اور نہ تجریح (نقص نکالنا)۔\n\nعدل اور جرح (نقصان) اللہ کا شرع ہے جو اس کے ساتھ آیا\nاس کا میزان (ترازو)، پس کمی اور ترجیح ظاہر ہوئی۔\n\nعقل اللہ کی مخلوق میں سب سے زیادہ فقیر ہے، پس عبرت حاصل کرو\nکیونکہ وہ فکر کے دروازے کے پیچھے پڑی ہے۔\n\nاگر اس کی الوہیت نہ ہوتی اور اگر وہ قوتیں نہ ہوتیں جو اس نے اسے عطا کیں\nتو عقل کے ذریعے کوئی رہائی (تسریح) ممکن نہ ہوتی۔\n\nبے شک عقلیں قیدیں ہیں، اگر تم نے ان پر بھروسہ کیا\nتو تم خسارہ اٹھاؤ گے، پس سمجھو، کیونکہ میرے قول میں اشارہ ہے۔\n\nاپنے شرع کے میزان سے کبھی دور نہ ہو، اس سے زینت حاصل کرو\nکیونکہ اس کا مرتبہ عدل اور تصحیح (درستگی) ہے۔\n\nبے شک رغبت اس علم میں ہے جو اس سینے میں قائم ہو\nجو نورِ شہود الحق (ذات حق کا مشاہدہ) سے کشادہ (مشروح) ہو۔\n\nمیں اس رغبت کے بدلے میں کچھ نہیں چاہتا\nاس کے لیے ذکر میں قدوس اور سبوح (پاکیزگی) ہے۔\n\nاسی جیسی چیز کے لیے عمل کرنے والے عمل کرتے ہیں، ان کے لیے\nاس کے علاوہ کسی چیز میں نہ تحسین (اچھا سمجھنا) ہے اور نہ تقبیح (برا سمجھنا)۔\n\n***\n\n### [بے شک اللہ کے سوا ہر چیز اللہ سے پردہ (حجاب) ہے]\n\nاللہ تعالیٰ نے فرمایا: \"ہر گروہ اس پر جو ان کے پاس ہے خوش ہے\" (كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ)۔ اور خوشی کا سبب مناسبت (مناسبۃ) ہے۔ جب ہم نے یہ جان لیا کہ انسان ان تمام چیزوں کا مجموعہ ہے جو اللہ کے پاس ہیں، تو ہم نے یہ بھی جان لیا کہ اللہ کے پاس کوئی ایسا امر نہیں جس کی انسان کی طرف کوئی نسبت نہ ہو، پس اس کے لیے اس میں سے مناسبت ہے۔ لہٰذا عارف (عالم) وجود (الوجود) کی کسی بھی چیز کو رد نہیں کرتا، بلکہ اس کی طرف وہی ظاہر ہوتا ہے جو اس کے لیے مناسب ہوتا ہے۔ اور اس پر کوئی ایک حال غالب نہیں آتا، بلکہ وہ ہر حال کے ساتھ اس مناسبت کے مطابق ہوتا ہے، جیسا کہ اللہ ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں۔ لیکن بے شک \"اکثر لوگ نہیں جانتے\" (أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ) یہ بات، بلکہ وہ اس قدر سے جاہل ہیں اور اس سے اندھے ہیں۔ اور یہی وہ چیز ہے جس نے انہیں دنیا اور اس میں موجود ہر چیز کی مذمت کرنے، اور آخرت میں، دونوں جہانوں (الکونین) میں، اور اللہ کے سوا ہر چیز میں زہد (ترک دنیا) اختیار کرنے پر مجبور کیا۔ اور انہوں نے ان لوگوں پر تنقید کی جنہوں نے اپنے آپ کو ان سب کے ناموں میں مشغول رکھا۔ اور اس معاملے میں انہیں ان باتوں نے گمراہ کیا جو اس نوع کے اکابر (بزرگوں) سے منقول ہیں، اور انہوں نے ان کے الفاظ کو اس حقیقت کے خلاف معنی پر محمول کیا جو وہ دیتے ہیں۔ اور انہوں نے یہ سمجھا کہ اللہ کے سوا ہر چیز اللہ سے پردہ (حجاب) ہے، پس انہوں نے اس پردے کو چاک کرنا چاہا، لیکن وہ اس پر زہد اختیار کیے بغیر اس پر قادر نہ ہو سکے۔\n\nمیں اس باب میں اس فن کو شافی بیان کے ساتھ واضح کروں گا، اور یہ کہ ذات حق (الحق) ہر روز مخلوق کے معاملے میں ایک نئی شان میں ہوتا ہے، اور یہ کہ جنت، جو قربت کا گھر اور رؤیت (دیدار) کا مقام ہے، وہ شہوات اور عمومی لذات کا گھر ہے۔ اگر وہ پردہ (حجاب) ہوتی تو اس میں بھی زہد اور پردہ ہوتا، اور یہی حال دنیا کا ہے۔ پس میں کہتا ہوں کہ اللہ نے مخلوق کی انواع و اقسام اور جو کچھ اس نے ان کے اشخاص میں ظاہر کیا، اسے اس لیے پیدا کیا تاکہ ہم اس میں ایسا غور و فکر کریں جو ہمیں اس کے خالق کے علم تک پہنچا دے۔ اس نے اسے اس لیے پیدا نہیں کیا کہ ہم اس میں زہد اختیار کریں۔ لہٰذا ہم پر واجب ہے کہ ہم اس پر جھکیں، اس میں ثابت قدم رہیں اور اس سے محبت کریں، کیونکہ یہ وہ نظر کا راستہ ہے جو ذات حق (الحق) تک پہنچاتا ہے۔ پس جس نے دلیل میں زہد کیا، اس نے مدلول میں زہد کیا، اور \"اس نے دنیا اور آخرت کا خسارہ اٹھایا، یہ کھلا خسارہ ہے\" (خَسِرَ الدُّنْيَا وَالْآخِرَةَ ذَلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ)۔ اور اس نے عالم میں اللہ کی حکمت سے جہالت کی، اور ذات حق (الحق) سے جہالت کی، اور وہ ان خسارہ اٹھانے والوں میں سے ہوا \"جن کی تجارت نفع بخش نہ ہوئی اور نہ ہی وہ ہدایت یافتہ تھے\" (فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ)۔\n\nپس کامل مرد (الرجل کل الرجل) وہ ہے جو خالص بندگی (عبودۃ محضة) میں ذات حق (الحق) کی صورت میں ظاہر ہو، پس وہ ہر حقدار کو اس کا حق دیتا ہے۔ اور وہ اپنی جان کے حق سے شروع کرتا ہے، کیونکہ وہ اس کے لیے ہر اس مخلوق سے زیادہ قریب ہے جس کا حق اس پر واجب ہے۔ اور اللہ کا حق ادائیگی کے لیے زیادہ حقدار ہے۔ اور اللہ کا حق اس پر یہ ہے کہ وہ ہر حق کو اس کے مستحق تک پہنچائے۔ \"اور اسی جیسی چیز کے لیے عمل کرنے والوں کو عمل کرنا چاہیے\" (وَلِمِثْلِ هَذَا فَلْيَعْمَلِ الْعَامِلُونَ)، کیونکہ عمل کی نسبت ہماری طرف کرنا ضروری ہے۔ بے شک اللہ نے اعمال کی نسبت ہماری طرف کی ہے اور ہمارے لیے ان کے مقامات، جگہیں، اوقات اور احوال مقرر کیے ہیں، اور ہمیں ان کا حکم دیا ہے، وجوباً، ندباً (مستحب کے طور پر) اور تخییراً (اختیار کے طور پر)۔ جیسا کہ اس نے ہمیں بعض مخصوص اعمال سے منع فرمایا ہے، جن کے مقامات، جگہیں، اوقات اور احوال اس نے ہمارے لیے حرام اور تنزیہ (مکروہ) کے طور پر مقرر کیے ہیں۔ اور اس سب کے لیے اس نے حساب کے ساتھ اور بغیر حساب کے جزا مقرر کی ہے، جو دنیا اور آخرت میں لذت بخش اور تکلیف دہ امور پر مشتمل ہے۔ اور اس نے ہمیں پیدا کیا اور ہم میں وہ فطرت پیدا کی جو لذت بخش جزا کی طلب کرتی ہے اور طبعاً تکلیف دہ جزا سے نفرت کرتی ہے۔\n\nاور اس نے میری رعایا میں میرے لیے اور مجھ پر حق مقرر کیا، کیونکہ اس نے میرے لیے ایک ناطق، مدبر، عاقل، مفکر نفس (نفس ناطقہ) پیدا کیا جو ان تمام چیزوں کو قبول کرنے کے لیے تیار ہے جن کا اسے مکلف بنایا گیا ہے۔ اور یہی وہ محل ہے جس سے خطاب کیا گیا ہے، جو اس کی تکلیف (احکام کی پابندی)، اس کے اوامر و نواہی کی تعمیل، اور اس کی حدود و رسوم پر ٹھہرنے کے لیے مقصود ہے، جہاں اس نے ذات حق (الحق) کے حق میں، اپنے نفس کے حق میں، اور دوسروں کے حق میں حد بندی کی اور رسم مقرر کی۔ پس حقوق والے اپنے حقوق کا مطالبہ کرتے ہیں، قولاً اور حالاً، ظاہراً اور باطناً۔ پس کان اپنے حق کا مطالبہ کرتا ہے، اور آنکھ، اور زبان، اور دونوں ہاتھ، اور پیٹ، اور شرمگاہ، اور دونوں پاؤں، اور قلب، اور عقل، اور فکر، اور نفس نباتیہ، اور نفس حیوانیہ، اور غصبیہ (غصہ والی قوت)، اور شہوانیہ (شہوت والی قوت)، اور حرص، اور امید، اور خوف، اور رجاء (امید)، اور اسلام، اور ایمان، اور احسان، اور ان جیسے دیگر جو اس کے ساتھ متصل عالم سے ہیں۔ اور ذات حق (الحق) نے اسے حکم دیا کہ وہ ان میں سے کسی سے بھی غافل نہ ہو، اور انہیں ان مقامات پر استعمال کرے جو ذات حق (الحق) نے اس کے لیے مقرر کیے ہیں۔ اور اس نے ان تمام قوتوں کو اس نفس ناطقہ (نفس ناطقہ) پر متوجہ کر دیا ہے کہ وہ اپنے حقوق کا مطالبہ کریں۔ اور اس نے ان سب کو اللہ تعالیٰ کی تسبیح کرنے والا بنایا ہے، یہ ایک ذاتی (ذاتی) بناوٹ ہے جس سے وہ جدا نہیں ہو سکتیں۔ اور اس نے ان حقوق کو جو اس جماعت پر حاکم نفس ناطقہ پر متوجہ ہوئے ہیں، ثابت حق قرار دیا ہے، اس تسبیح اللہ بحمدہ کی جزا کے طور پر جو وہ دنیا اور آخرت میں کرتے ہیں۔\n\nاور ان میں سے کوئی بھی اپنی مرضی سے اللہ کے حکم کی خلاف ورزی نہیں کرتا۔ اور اگر ان سے خلاف ورزی واقع ہوتی ہے تو یہ جبراً ہوتی ہے، اور ان پر حاکم (والی) انہیں اس پر مجبور کرتا ہے، جس کے لیے انہیں سننے اور اطاعت کرنے کا حکم دیا گیا ہے۔ پس اگر وہ ظلم کرے تو ان کے لیے ہے اور اس پر ہے، اور اگر وہ عدل کرے تو ان کے لیے ہے اور اس کے لیے ہے۔ اور اللہ نے ان رعایا کو، جن کا ہم نے ذکر کیا جو اس سے متصل ہیں، اس چیز سے رکنے کی طاقت نہیں دی جس پر وہ انہیں مجبور کرتا ہے، برخلاف ان کے جو ان سے باہر ہیں اور جن کا ان میں کوئی حکم ہے۔ پھر اللہ نے ان کے لیے حسی جزا بیان کی اور انہیں دنیا کی زندگی میں دنیاوی نعمتوں کی مثال دے کر اور آخرت میں اس کا وعدہ کر کے اس کا مشاہدہ کرایا۔ اور ان میں سے بعض کو اس نے آخرت میں اس کا مشاہدہ کرایا، جبکہ وہ دنیا کی زندگی میں عین مشاہدہ (شہود) میں ہوتا ہے۔ پس اس نے اپنی رؤیت سے جو لذت حاصل کی، اس کی قدر و قیمت کا اندازہ نہیں لگایا جا سکتا۔ اور اس سے لذت صرف وہی حاصل کرتا ہے جو اپنی رعایا سے اس کا مطالبہ کرتا ہے۔ پس وہ اس سے اس حق کا سوال کرنے لگا اور یہ کہ وہ اسے اس سے نہ روکے۔ \"اور اسی جیسی چیز میں رغبت کرنے والوں کو رغبت کرنی چاہیے\" (وَفِي مِثْلِ هَذَا فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ)۔ اور اس سے بڑھ کر کون سی نفیس چیز ہو سکتی ہے؟\n\nپس وہ عارف (العارف) جو معرفت (المعرفۃ) میں کامل ہو، وہ جانتا ہے کہ اس میں وہ بھی ہیں جو اپنے رب کے مشاہدہ (مشاہدۃ) اور اس کی فکری اور شہودی معرفت (المعرفۃ) کے طالب ہیں۔ پس اس پر لازم ہے کہ وہ انہیں اس میں سے ان کا حق ادا کرے۔ اور وہ جانتا ہے کہ اس میں وہ بھی ہیں جو لذیذ کھانے کے طالب ہیں جو ان کے مزاج کے مطابق ہو، اور پینے کی چیز، اور نکاح، اور سواری، اور لباس، اور سماع (سننا)، اور محسوس حسی نعمتوں کے طالب ہیں۔ پس اس پر یہ بھی لازم ہے کہ وہ انہیں اس میں سے ان کے حقوق ادا کرے جو ذات حق (الحق) نے ان کے لیے مقرر کیے ہیں۔ اور جس کا یہ حال ہو، اس کے لیے کیسے درست ہو سکتا ہے کہ وہ موجودات میں سے کسی بھی چیز میں زہد اختیار کرے؟ اور اللہ نے انہیں صرف اسی کے لیے پیدا کیا ہے۔ مگر یہ کہ وہ اس علم کا محتاج ہے کہ کیا چیز اس کے لیے ہے اور کیا چیز دوسرے کے لیے ہے، تاکہ وہ یہ نہ کہہ دے کہ ہر چیز اس کے لیے ہے۔ پس وہ خوبصورت چہروں میں سے صرف اسی کو دیکھے گا جسے وہ جانتا ہے کہ وہ اس کے لیے ہے، اور جسے وہ جانتا ہے کہ وہ دوسرے کے لیے ہے، تو وہ اپنی نظر کو روک لے گا اور اسے جھکا لے گا، کیونکہ جو چیز دوسرے کے لیے ہے وہ اس پر حرام ہے۔ پس یہ اس کا ورع (پرہیزگاری)، اجتناب اور زہد کا حصہ ہے۔ زہد کا تعلق صرف اولویت (ترجیح) سے ہے، برخلاف ورع اور ہر قسم کے ترک کے۔ لیکن اولویت کے معاملے میں، وہ مقام کو دیکھتا ہے اور اس کے تقاضے کے مطابق عمل کرتا ہے، اور اس کا تقاضا ذات حق (الحق) نے اسے شارع (شریعت لانے والے) کی زبان سے بتا کر مقرر کر دیا ہے۔\n\nپس اولویت (ترجیح) کو اختیار کرنے کی وجہ سے انہیں زاہد (زہاد) کہا گیا، کیونکہ انہوں نے اسے اختیار کیا۔ بے شک انہیں دنیا کی زندگی میں اسے استعمال کرنے کی اجازت تھی، لیکن انہوں نے ایسا نہیں کیا، کیونکہ اللہ نے انہیں اختیار دیا تھا، اور اس نے اسے ان پر واجب نہیں کیا تھا، نہ ہی مستحب قرار دیا تھا، نہ ہی ان پر پابندی لگائی تھی اور نہ ہی اسے مکروہ قرار دیا تھا۔ پس یہ جان لو۔ پھر وہ اس اختیاری چیز میں غور کرتا ہے، تو اس کے استعمال کا حال اس سے خالی نہیں ہوتا کہ آیا یہ استعمال اس کے اور اس اعلیٰ مقام کے درمیان رکاوٹ بنتا ہے جسے اس کے لیے ترجیح دی گئی ہے یا نہیں؟ پس اگر یہ اس کے اور اس مقام کے درمیان رکاوٹ بنے، تو صحیح اور سلیم عقل کے حکم سے اس کا ترک کرنا اور اس میں زہد اختیار کرنا اس پر لازم ہو جاتا ہے۔ اور اگر وہ \"اپنے رب کی طرف سے دلیل پر\" (عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِ) ہو کہ یہ چیز اس کے اعلیٰ مرتبے میں کوئی نقص پیدا نہیں کرے گی اور نہ ہی اس کے اور اس کے درمیان رکاوٹ بنے گی، تو اسے ترک کرنے کا کوئی فائدہ نہیں۔ جیسا کہ اللہ نے اپنے نبی سلیمان علیہ السلام سے فرمایا: \"یہ ہماری عطا ہے، پس احسان کرو یا روکے رکھو، کوئی حساب نہیں\" (هَذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ)۔ اور تم ان لوگوں میں سے نہ ہو جن پر معاملات مشتبہ ہو جاتے ہیں، پس وہ یہ حیلہ کرتے ہیں کہ اپنی رعایا میں سے کسی شخص کے حق میں زہد اختیار کر کے، وہ اپنی رعایا میں سے کسی دوسرے شخص کے حق میں جو کچھ طلب کرتا ہے، اسے حاصل کر لے گا۔ کیونکہ یہ عین جہالت ہے۔ بے شک وہ حقیقت اس سے کہتی ہے کہ یہ میرے لیے عین حق نہیں ہے۔\n\nپس اس بندے کے لیے جو اللہ نے اپنی جان اور اپنے والیوں کی تدبیر کا مکلف بنایا ہے، اولیٰ یہ ہے کہ وہ علم حاصل کرے۔ اور جب وہ علم حاصل کر لے تو اس کا علم اسے استعمال کرے، تاکہ وہ اپنے علم کے حکم کے تحت ہو، اور وہ خود علم کو استعمال نہ کرے۔ کیونکہ اگر وہ اپنے علم کو استعمال کرے گا تو اس کا علم اس کے حکم کے تحت ہو گا، پس وہ کبھی اس پر عمل کرے گا اور کبھی اسے ترک کر دے گا، یعنی عمل کو ترک کر دے گا، اور ترک کا عمل بھی علم کے بغیر نہیں ہوتا۔ اور جب علم اسے استعمال کرے اور اسے تصرف میں لائے، اور وہ علم کے لیے معمول اور مستعمل ہو، تو علم جبراً اسے درستگی پر حکم دے گا، پس وہ حقوق کو ان کے حقداروں تک پہنچائے گا۔ اور عالم میں اس طرح کا امام بہت کم ہے۔ اسی لیے کہا جاتا ہے کہ سخی وہ نہیں جو اپنے مال سے سخاوت کرے، بلکہ سخی وہ ہے جو علم پر اپنی جان سے سخاوت کرے، پس وہ اپنے علم کے تسلط کے تحت ہو۔ یہی عالم کا بڑا (کبیر العالم) ہے۔ اور جہاں تک الٰہی اوامر و نواہی کے علم کا تعلق ہے جس کا ہم نے ذکر کیا، تو ہم اسے ان شاء اللہ اس کتاب کے آخری باب میں لائیں گے، اور اسی کے ساتھ ہم کتاب کو ختم کریں گے، اور وہ باب الوصیت ہے۔ پس دیکھو کہ یہ ہجیر (باب) تمہیں کیا فوائد دیتا ہے۔ اور میں نے تمہیں ان ہجیرات (ابواب) کا نتیجہ صرف اس لیے بیان کیا ہے تاکہ یہ تمہارے لیے نفوس (الأنفس) اور اولیٰ (ترجیح) کے چہرے کی طلب کا محرک بنے۔ اور اللہ \"حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و هفتاد و هفتم در بیان حال قطبی که منزل او در این آیه است: «و در این [نعمت‌ها] باید رقابت‌کنندگان رقابت کنند (وَفِي ذَلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ)» و «و برای مانند این [پاداش] باید عمل‌کنندگان عمل کنند (وَلِمِثْلِ هَذَا فَلْيَعْمَلِ الْعَامِلُونَ)».\n\nشخص (سالک) به تدریج جذب می‌شود و سینه گشاده است\nو گنج بیرون کشیده شده و در باز است.\n\nاوایل کجایند؟ نه وجود داشتند و نه پیشینی بودند؛\nعقل آنچه را که روح می‌آورد، می‌پذیرد.\n\nاما آنان با فکر محجوب شدند و بر آن تکیه کردند،\nحال آنکه علم موهبتی و بخشیدنی است.\n\nاگر اهل انصاف باشی، در آن (علم) کسبی نیست؛\nپس عقل را نه تعدیلی است و نه جرحی.\n\nعدل و جرح، شریعت حق (الله) است که میزانش را آورده،\nپس نقص و ترجیح آشکار شد.\n\nعقل فقیرترین خلق حق (الله) است، پس عبرت گیرید،\nزیرا که او پشت درِ فکر رها شده است.\n\nاگر نه برای او (حق) بود و اگر نه برای قوایی بود که به او بخشید،\nعقل نمی‌توانست رهایی یابد.\n\nهمانا عقل‌ها قید و بندند؛ اگر به آن‌ها اعتماد کنی،\nزیان می‌بینی، پس بفهم که سخن من در آن اشاره‌ای دارد.\n\nاز میزان شریعت خود دست نکش و پیوسته خود را با آن بیارای،\nزیرا مرتبه آن عدل و تصحیح است.\n\nهمانا رقابت در علمی است که سینه‌ای با نور شهود حق (الشهود الحق) آن را برپا می‌دارد.\n\nاین رقابتی است که جایگزینی برای آن نمی‌خواهم،\nکه برای آن از ذکر، قدوس و سبوح است.\n\nعمل‌کنندگان برای مانند این عمل می‌کنند، و برایشان\nدر غیر آن، تحسین و تقبیحی نیست.\n\n### [اینکه هر آنچه غیر حق (الله) است، حجاب حق (الله) است]\n\nحق (الحق) تعالی فرمود: «هر گروهی به آنچه نزدشان است شادمانند (كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ)». و موجب شادی، تناسب است. و چون دانستیم که انسان مجموع آنچه نزد حق (الله) است می‌باشد، دانستیم که هیچ امری نزد حق (الله) نیست مگر اینکه نسبتی به انسان دارد، پس مناسبتی از آن برای او هست. بنابراین، عارف (العالم) هیچ چیزی از هستی (الوجود) را دور نمی‌اندازد، بلکه آنچه از هستی که با او تناسب دارد، برایش آشکار می‌شود. هیچ حالی از احوال بر او غلبه نمی‌کند، بلکه او با هر حالی به تناسب آن است، همان‌گونه که حق (الله) با ماست هر کجا که باشیم. اما «بیشتر مردم نمی‌دانند (أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ)» این را، بلکه به این اندازه جاهل و کورند. و این همان چیزی است که آن‌ها را به سوی نکوهش دنیا و آنچه در آن است، و زهد در آخرت و در هر دو جهان (الکونین) و در هر آنچه غیر حق (الله) است، سوق داده است. و بر کسی که خود را به نام‌های این‌ها مشغول کرده، خرده گرفته‌اند. و در این کار، آنچه از بزرگان در این نوع (عرفان) حکایت شده، آن‌ها را به این واداشته است، و الفاظ آنان را بر غیر وجهی که حقیقت (الحقیقة) اقتضا می‌کند، حمل کرده‌اند. و دیدند که هر آنچه غیر حق (الله) است، حجاب حق (الله) است، پس خواستند این حجاب را پاره کنند، اما نتوانستند مگر با زهد ورزیدن در آن. من این فن را در این باب به بیانی شافی روشن خواهم ساخت، و همچنین اینکه حق (الحق) هر روز در شأن خلق است، و اینکه بهشت که سرای قرب و محل رؤیت است، سرای شهوات و عموم لذات است. اگر بهشت حجاب بود، زهد و حجاب در آن نیز لازم می‌شد، و همچنین سرای دنیا. پس می‌گویم:\n\nهمانا حق (الله) اجناس و انواع خلق و آنچه از اشخاص آن‌ها را آشکار ساخت، آفرید تا ما در آن نظر کنیم، نظری که ما را به علم به خالقش برساند. پس آن را نیافرید تا ما در آن زهد ورزیم. بنابراین، بر ما واجب است که بر آن روی آوریم، مداومت کنیم و آن را دوست بداریم، زیرا آن راه نظری است که به حق (الحق) می‌رساند. پس هر کس در دلیل زهد ورزد، در مدلول زهد ورزیده است و «در دنیا و آخرت زیان کرده است، این همان زیان آشکار است (خَسِرَ الدُّنْيَا وَالْآخِرَةَ ذَلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ)». و حکمت حق (الله) در عالم را نادیده گرفته و حق (الحق) را نشناخته و از زیانکارانی بوده که «تجارتشان سودی نکرده و هدایت‌یافته نبودند (فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ)». پس مرد کامل، کسی است که در صورت حق (الحق) در عبودیتی محض ظاهر شود و حق هر صاحب حقی را به او بدهد. و با حق نفس خود آغاز می‌کند، زیرا نفس او از هر کسی که از مخلوقات بر او حقی دارد، به او نزدیک‌تر است. و حق حق (الله) سزاوارتر به ادا شدن است. و حق حق (الله) بر او این است که هر حقی را به مستحقش برساند. و «برای مانند این [پاداش] باید عمل‌کنندگان عمل کنند (وَلِمِثْلِ هَذَا فَلْيَعْمَلِ الْعَامِلُونَ)»، زیرا ناگزیر باید عمل را به خود نسبت دهیم.\n\nهمانا حق (الله) اعمال را به ما نسبت داده و محل‌ها، مکان‌ها، زمان‌ها و احوال آن‌ها را برای ما تعیین کرده و ما را به آن‌ها امر کرده است، به صورت وجوب، ندب (استحباب) و تخییر. همان‌گونه که عزوجل ما را از اعمال معینی نهی کرده که محل‌ها، مکان‌ها، زمان‌ها و احوال آن‌ها را برای ما تعیین کرده است، به صورت تحریم و تنزیه. و برای همه این‌ها جزایی قرار داده است، با حساب و بدون حساب، از امور لذت‌بخش و امور دردناک، در دنیا و آخرت. و ما را آفرید و در ما کسی را آفرید که جزای لذت‌بخش را می‌طلبد و بالطبع از جزای دردناک می‌گریزد. و برای من و بر من در رعیتم حقی قرار داد، زیرا برای من نفسی ناطقه، مدبره، عاقله و متفکره آفرید که آماده پذیرش تمام آنچه به آن مکلف شده است می‌باشد. و این نفس محل خطاب حق (الحق) است و مقصود از تکلیف او و امتثال اوامر و نواهی او و توقف در حدود و رسوم اوست، آنجا که برایش در حق حق (الحق)، حق نفسش و حق غیرش حد و رسم تعیین کرده است.\n\nپس صاحبان حقوق، حقوق خود را از او می‌طلبند، به زبان و حال، ظاهر و باطن. پس گوش حق خود را می‌طلبد، و چشم، زبان، دو دست، شکم، فرج، دو پا، قلب، عقل، فکر، نفس نباتی، حیوانی، غضبی، شهوانی، حرص، آرزو، ترس، امید، اسلام، ایمان و احسان و امثال این‌ها از عالم متصل به او. و حق (الحق) به او امر کرده است که اولاً از هیچ یک از این‌ها غافل نشود و آن‌ها را در مواطنی که حق (الحق) برایش تعیین کرده، به کار گیرد. و این قوا را همگی متوجه این نفس ناطقه قرار داد تا حقوق خود را بطلبند. و همه آن‌ها را ناطق به تسبیح حق (الله) تعالی قرار داد، جعلی ذاتی که از آن جدا نمی‌شوند. و این حقوقی را که بر نفس ناطقه حاکم بر این مجموعه متوجه شده، ثابت‌الحق قرار داد، به عنوان جزای آنچه بر آن از تسبیح حق (الله) به حمد اوست، در دنیا و آخرت. و هیچ یک از آن‌ها به اختیار خود با امر حق (الله) مخالفت نمی‌کند، و اگر از آن‌ها مخالفت واقع شود، به اجبار است. حاکمی که بر آن‌هاست و به شنیدن و اطاعت از او امر شده‌اند، آن‌ها را بر آن مجبور می‌کند. اگر ستم کند، به نفع آن‌ها و به ضرر اوست، و اگر عدالت ورزد، به نفع آن‌ها و به نفع اوست. و حق (الله) به این رعایای متصل به او که ذکر کردیم، قدرت امتناع از آنچه بر انجامش مجبور می‌شوند، نداده است، برخلاف کسی که از آن‌ها خارج است و در آن‌ها امری دارد.\n\nسپس حق (الله) جزای حسی را برای آن‌ها وصف کرد و آن را در زندگی دنیا با زدن مثالی از نعیم زندگی دنیا و با وعده آن در آخرت، به شهود آن‌ها رساند. و برخی از آن‌ها را در آخرت به شهود آن رساند، در حالی که در زندگی دنیا با مشاهده عین (شهود عین) آن را می‌بیند. پس آنچه را که از التذاذ (لذت بردن) به رؤیت برایش حاصل شده، دید، لذتی که قدرش قابل اندازه‌گیری نیست. و از آن لذت نبرد مگر کسی که آن را از رعیت خود می‌طلبد. پس شروع کرد به طلب حق خود از آن و اینکه او را از آن منع نکند. و «در مثل این باید رقابت‌کنندگان رقابت کنند (وَفِي مِثْلِ هَذَا فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ)». و چه نفیس‌تر و بزرگ‌تر از این؟\n\nپس عارف کامل‌المعرفه (المكمل المعرفة) می‌داند که در وجود او کسانی هستند که طلب مشاهده پروردگارش و معرفت فکری و شهودی (الشهودية) او را دارند. پس بر او واجب است که حق آن‌ها را از این بابت ادا کند. و می‌داند که در وجود او کسانی هستند که طلب خوراک لذیذی که با مزاجش سازگار است، و نوشیدنی، نکاح، مرکب، پوشاک، شنیدن و نعمت حسی محسوس را دارند. پس بر او واجب است که حقوق آن‌ها را نیز از این بابت که حق (الحق) برایشان تعیین کرده، ادا کند. کسی که حالش این‌گونه است، چگونه برایش صحیح است که در چیزی از موجودات زهد ورزد؟ در حالی که حق (الله) آن‌ها را جز برای او نیافریده است. جز اینکه او نیازمند علم به این است که چه چیزی برای اوست و چه چیزی برای غیر او، تا نگوید که همه چیز برای اوست. پس از چهره‌های زیبا نمی‌نگرد مگر آنچه را که می‌داند برای اوست، و آنچه را که می‌داند برای غیر اوست، چشم خود را از آن باز می‌دارد و فرو می‌بندد، زیرا آنچه برای غیر اوست، بر او ممنوع است. پس این بهره او از ورع و اجتناب است. زهد تنها متعلق به اولویت است، برخلاف ورع و هر ترک دیگری. اما اولویت، در موطن (مکان و موقعیت) نظر می‌کند و به مقتضای آن عمل می‌کند. و مقتضای آن را حق (الحق) برای او تعیین کرده است، به واسطه آنچه با زبان شارع به او آموخته است.\n\nپس کسانی که از طریق اخذ به اولویت عمل کردند، زاهد نامیده شدند، زیرا آن‌ها می‌توانستند در زندگی دنیا آن را تناول کنند، اما این کار را نکردند، چون حق (الله) آن‌ها را مخیر کرده بود و آن را بر آن‌ها واجب نکرده بود و مستحب ندانسته بود و بر آن‌ها ممنوع نکرده بود و مکروه نساخته بود. این را بدان. سپس او در این امر تخییری نظر می‌کند. حال او در تناول آن از این دو حالت خارج نیست: یا این تناول بین او و مقامی که حق (الحق) برایش ترجیح داده، حائل می‌شود، یا حائل نمی‌شود. اگر بین او و آن حائل شد، به حکم عقل صحیح و سلیم، ترک آن و زهد ورزیدن در آن بر او واجب می‌شود. و اگر «بر دلیل روشنی از پروردگارش (عَلَى بَيِّنَةٍ مِنْ رَبِّهِ)» بود که آن (تناول) خدشه‌ای وارد نمی‌کند و بین او و مرتبه عالی حائل نمی‌شود، ترک آن فایده‌ای ندارد، همان‌گونه که به پیامبرش سلیمان علیه السلام فرمود: «این عطای ماست، پس بی‌حساب ببخش یا نگه دار (هَذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ)». و از کسانی مباش که امور بر آن‌ها مشتبه می‌شود و حیله می‌ورزند که با زهد ورزیدن در آنچه حق شخص خاصی از رعیت اوست، بهره‌ای را که شخص دیگری از رعیت او از او می‌طلبد، به دست می‌آورد. زیرا این عین جهل است. آن حقیقت به او می‌گوید: این عین حق من نیست.\n\nپس سزاوارتر برای بنده‌ای که حق (الله) او را به تدبیر نفس و والیانش مکلف کرده، این است که بداند. و هنگامی که دانست، علمش او را به کار گیرد تا او به حکم علمش باشد، نه اینکه او علم را به کار گیرد. زیرا اگر او علمش را به کار گیرد، علمش تحت حکم او خواهد بود، پس گاهی به آن عمل می‌کند و گاهی آن را ترک می‌کند، یعنی عمل به آن را ترک می‌کند. و عمل ترک جز با علم نیست. اما اگر علم او را به کار گیرد و او را بگرداند و او معمول و مستعمل علم باشد، علم او را به اجبار بر صواب حکم می‌کند، پس حقوق را به صاحبانش ادا می‌کند. و مثل این امام در عالم کم است. و به همین دلیل می‌گوید: سخی کسی نیست که با مالش سخاوت کند، بلکه سخی کسی است که با نفس خود بر علم سخاوت کند، پس تحت سلطنت علمش باشد. این است بزرگ عالم. و اما آنچه از علم اوامر و نواهی الهی ذکر کردیم، ان‌شاءالله در باب آخر این کتاب خواهیم آورد و با آن کتاب را ختم کرده‌ایم، و آن باب وصیت است. پس بنگر به فوایدی که این هجیر (سفر معنوی) به تو می‌دهد. و من نتیجه این هجیرات را برای تو ذکر نکردم مگر برای اینکه باعثی باشد برای تو بر طلب نفوس وگرنه وجه و اولویت. و «حق (الله) سخن حق می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)»."
  },
  "page_count": 3
}