{
  "id": 257,
  "title": {
    "ar": "الباب السابع والخمسون ومائتان في معرفة المحاضرة",
    "en": "Chapter Two Hundred and Fifty-Seven, Concerning the Gnosis of the Spiritual Presence (المحاضرة)",
    "ur": "باب نمبر دو سو ستاون (۲۵۷) المحاضرہ (حضورِ حق) کی معرفت کے بیان میں۔",
    "fa": "باب دویست و پنجاه و هفتم در معرفت المحاضرة (المحاضرة)"
  },
  "content": {
    "ar": "## «الباب السابع والخمسون ومائتان في معرفة المحاضرة\n\n\nوهي حضور القلب بتواتر البرهان ومجاراة الأسماء الإلهية بما هي عليه من الحقائق التي تطلبها الأكوان»\n\n\n> محاضرة الأسماء في حضرة الذات *** دليل على الماضي دليل على الآتي‏\n\n\n> أقول بها والكون يعطي وجودها *** لوجدان آلام ووجدان لذات‏\n\n\n> فلو لا وجود المحو ما صح عندنا *** ولا عند من يدري وجود لإثبات‏\n\n\n### [المحاضرة وهي حضور القلب بتواتر البرهان‏]\n\n\nالمحاضرة صفة أهل الاعتبار والنظر المأمور به شرعا فما يفرغون من نظر في دليل بعد إعطائه إياهم مدلوله إلا ويظهر الله لهم دليلا آخر فيشتغلون بالنظر فيه إلى أن يوفي لهم ما هو عليه من الدلالة فإذا حصلوا مدلوله أراهم الحق دليلا آخر هكذا دائما وهو قوله تعالى سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ فذكر أنه يريهم آيات ما جعل ذلك آية واحدة ثم قال حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ وهو عثورهم على وجه الدليل وحصول المدلول وهذه مسألة تختلف فيها فتوح المكاشفة فمنهم من يعطي الدليل ومدلوله كشفا ولا يعطي أبدا ذلك المدلول دون دليله حتى زعم بعض العلماء به أن علوم الوهب التي من شأنها أن لا تدرك في النظر إلا بالدليل العقلي لا توهب لمن وهبت إلا بأدلتها فإنها بها مرتبطة ارتباطا عقليا ومنهم من‏\nيقول إنه قد يعطي الله ما يشاء من العلوم التي لا تدرك في العقل إلا بالأدلة بغير دليلها لأن المقصود ما هو الدليل وإنما المقصود مدلوله فإذا حصل بوجه من الحق من غير الدليل الذي يرتبط به في النظر العقلي فلا حاجة للدليل إذ قد علمنا أن الدليل يقابل حصول المدلول في النفس وإنهما لا يجتمعان وهذا غلط وإنما الذي لا يجتمع مع المدلول النظر في الدليل لا عين الدليل فإن الناظر في الدليل فاقد واجد ومحصل للمدلول وقد تكون المحاضرة من العبد مع الأسماء الإلهية والكونية من حيث إن الأسماء الكونية قد وسم الحق بها نفسه والأسماء الإلهية قد وسم الكون بها نفسه واستحق الجنابان الأسماء جميعها وهذا مما يقوي حديث خلق العالم على الصورة فإذا حضرت الأسماء الحسنى وأسماء الكون وجرت في ميدان المفاخرة فإن الله يستهزئ بالمنافقين وبأهل الاستهزاء بالجناب الإلهي ويمكر سبحانه بالماكرين ويعجب ممن قهر الطبيعة على قوتها في الحكم وهذا كله سمات المحدثات وقد وسم الحق بها نفسه كما وسمها بكونه قديرا وخلاقا وعليما وغير ذلك فالكل عند طائفة أصل للأصل النسبي الذي أوجد العالم وبعضهم فرق فجعل خلاف الأسماء الحسنى أصلا في الكون منقولا في الجناب الإلهي وحكم هذه المحاضرة في كل شخص بحسب ما يتقوى عنده ويعطيه النظر فتختلف أحوال أهل الله في ذلك وهو قوله إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ والتفكر في ذات الله محال فلا يبقى إلا التفكر في الكون ومتعلق الفكرة الأسماء الحسنى وسمات المحدثات فالأسماء كلها أصل في الكون على هذا النظر فإذا وقف على محاضرة الأسماء ومناظرتها علم من أثر في وجود الكون بعد أن لم يكن هل أثر فيه الحق الوجود أو استعداده أو المجموع هذه فائدة المحاضرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Fifty-Seven: Concerning the Gnosis of the Attainment of Presence (المحاضرة)\n\nIt is the heart’s presence (حضور القلب) achieved through the continuous succession of proofs (البرهان) and the alignment with the Divine Names (الأسماء الإلهية) according to the Realities (الحقائق) they embody, which are demanded by the created realms (الأكوان).\n\n> The Presence (محاضرة) of the Names in the Presence of the Essence (حضرة الذات) *** Is a proof concerning the past, a proof concerning the future.\n> I speak by means of it, while the cosmos grants its existence *** For the finding of pains and the finding of pleasures.\n> Were it not for the existence of effacement (الفناء), the existence of affirmation (البقاء) would not be valid in our view *** Nor in the view of anyone who understands.\n\n### [The Attainment of Presence (المحاضرة), which is the heart’s presence through the continuous succession of proofs]\n\nThe Attainment of Presence (المحاضرة) is the characteristic of the people of contemplation (الاعتبار) and the reflection (النظر) commanded by the Sacred Law. They do not finish reflecting upon one proof, after it has yielded its demonstrated conclusion (مدلوله), but that Allah reveals to them another proof. They then occupy themselves with reflecting upon it until it fulfills its function of demonstration. Once they have attained its conclusion, the Real (الحق) shows them another proof, and so on perpetually.\n\nThis is confirmed by His, the Exalted’s, saying: <<سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ>> (We shall show them Our signs in the horizons and within themselves). He mentioned that He shows them signs (plural), not making it a single sign. Then He said: <<حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ>> (until it becomes clear to them that He is the Truth/The Real). This clarity is their discovery of the aspect of the proof and the attainment of the demonstrated conclusion.\n\nThis is an issue where the openings of Unveiling (فتوح المكاشفة) differ. Some are granted the proof and its demonstrated conclusion through unveiling (كشفا), and they are never granted that conclusion without its proof. This led some scholars of this science to claim that the sciences of Divine Gift (علوم الوهب), which are normally only grasped through rational reflection (النظر) by means of a rational proof, are never gifted to the recipient except accompanied by their proofs, because they are rationally linked to them.\n\nOthers say that Allah may grant whatever He wills of the sciences—which are only grasped rationally through proofs—without their proofs. This is because the proof is not the ultimate objective; rather, the objective is its demonstrated conclusion. If the conclusion is attained through a certain aspect of the Real (الحق) without the proof to which it is linked in rational reflection, then there is no need for the proof.\n\n[This is based on the assumption] that the proof stands opposite to the attainment of the conclusion in the soul, and that they do not coexist. *This is an error.* What does not coexist with the conclusion is the *reflection upon* the proof, not the proof itself. Indeed, the one reflecting upon the proof is simultaneously lacking (the conclusion) and finding (it), and is attaining the demonstrated conclusion.\n\nFurthermore, the Attainment of Presence (المحاضرة) may occur between the servant and the Divine Names (الأسماء الإلهية) and the Cosmic Names (الأسماء الكونية). This is because the Real (الحق) has marked Himself with the Cosmic Names, and the cosmos (الكون) has marked itself with the Divine Names. Thus, both sides (الجنابان) are entitled to all the Names. This strengthens the tradition concerning the creation of the world upon the Image (الصورة).\n\nWhen the Most Beautiful Names (الأسماء الحسنى) and the names of the cosmos are present and engage in the arena of boasting (المفاخرة), then Allah mocks the hypocrites and those who mock the Divine Presence (الجناب الإلهي), and He plots (يمكر) against the plotters, and He marvels at those who conquer Nature (الطبيعة) despite its power in governance. All of these are characteristics of created things (المحدثات), yet the Real (الحق) has marked Himself with them, just as He marked Himself with being All-Powerful (قديرا), the Creator (خلاقا), the All-Knowing (عليما), and so forth.\n\nThus, according to one group, all of these are the origin (أصل) for the relative origin (الأصل النسبي) that brought the world into existence. Others differentiated, making the opposites of the Most Beautiful Names an origin in the cosmos, transferred to the Divine Presence.\n\nThe ruling (حكم) of this Attainment of Presence (المحاضرة) varies for every person according to what is strengthened within him and what reflection (النظر) grants him. Thus, the spiritual states (أحوال) of the people of Allah differ in this regard. This is confirmed by His saying: <<إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ>> (Indeed, in that are signs for a people who reflect).\n\nReflection (التفكر) upon the Essence (الذات) of Allah is impossible, so nothing remains except reflection upon the cosmos (الكون). The object of reflection is the Most Beautiful Names (الأسماء الحسنى) and the characteristics of created things (المحدثات). Therefore, all the Names are fundamentally rooted in the cosmos, according to this view.\n\nWhen one stands upon the Attainment of Presence (محاضرة) of the Names and their dialogue (مناظرتها), one knows who influenced the existence of the cosmos after it was not: Did the Real (الحق) influence it with Existence (الوجود), or did its preparedness (استعداده) influence it, or did the combination of both? This is the benefit of the Attainment of Presence (المحاضرة). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب دو سو ستاون: معرفت المحاضرہ (معرفة المحاضرة) کے بیان میں۔\n\nاور یہ (المحاضرہ) دل کا مسلسل برہان (دلیل) کے ساتھ حاضر ہونا اور ان حقائق کے مطابق اسماء الٰہیہ (الأسماء الإلهية) کے ساتھ چلنا ہے جن کا تقاضا اکوان (کائناتیں) کرتی ہیں۔\n\nاسماء (الأسماء) کی ذات (الذات) کی حضوری میں حاضری\nماضی پر بھی دلیل ہے اور آنے والے پر بھی دلیل ہے۔\nمیں اس کے ذریعے بات کرتا ہوں اور کائنات اس کا وجود عطا کرتی ہے\nتکالیف کے پانے اور لذتوں کے پانے کے لیے۔\nاگر محو (المحو) کا وجود نہ ہوتا تو ہمارے نزدیک درست نہ ہوتا\nاور نہ ہی اس شخص کے نزدیک جو اثبات (إثبات) کے وجود کو جانتا ہے۔\n\n### المحاضرہ (المحاضرة) اور دل کا مسلسل برہان کے ساتھ حاضر ہونا\n\nالمحاضرہ (المحاضرة) اہل اعتبار (اہل الاعتبار) اور شرعاً مامور نظر (غور و فکر) کی صفت ہے۔ وہ کسی دلیل میں غور و فکر سے فارغ نہیں ہوتے جب تک کہ وہ دلیل انہیں اپنا مدلول (مدعا) نہ دے دے، مگر یہ کہ اللہ ان کے لیے ایک اور دلیل ظاہر کر دیتا ہے، چنانچہ وہ اس میں غور و فکر میں مشغول ہو جاتے ہیں یہاں تک کہ وہ انہیں اپنی دلالت (رہنمائی) پوری کر دے۔ جب وہ اس کا مدلول حاصل کر لیتے ہیں تو حق (الحق) انہیں ایک اور دلیل دکھاتا ہے، اور یہ سلسلہ ہمیشہ جاری رہتا ہے۔ یہی اللہ تعالیٰ کا فرمان ہے: \"عنقریب ہم انہیں اپنی نشانیاں آفاق (کائنات) میں اور ان کی اپنی جانوں میں دکھائیں گے\" (سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ)۔ پس اس نے ذکر کیا کہ وہ انہیں نشانیاں دکھائے گا، اس نے اسے ایک نشانی نہیں بنایا۔ پھر فرمایا: \"یہاں تک کہ ان پر واضح ہو جائے کہ وہی حق ہے\" (حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ)۔ اور یہ ان کا دلیل کے چہرے پر عثور (پہنچنا) اور مدلول کا حصول ہے۔\n\nاور یہ ایک ایسا مسئلہ ہے جس میں مکاشفہ (الکشف) کے فتوحات مختلف ہوتے ہیں۔ چنانچہ ان میں سے بعض کو دلیل اور اس کا مدلول کشف (الکشف) کے ذریعے عطا کیا جاتا ہے اور انہیں کبھی بھی وہ مدلول اس کی دلیل کے بغیر عطا نہیں کیا جاتا۔ یہاں تک کہ اس کے بعض علماء نے یہ دعویٰ کیا کہ علوم وہب (علوم الوهب) جن کا خاصہ یہ ہے کہ وہ غور و فکر میں صرف عقلی دلیل سے ہی سمجھے جاتے ہیں، وہ جسے بھی عطا کیے جاتے ہیں تو اپنی دلیلوں کے ساتھ ہی عطا کیے جاتے ہیں، کیونکہ وہ ان کے ساتھ عقلی طور پر مربوط ہیں۔\n\nاور ان میں سے بعض کہتے ہیں کہ اللہ تعالیٰ جو علوم چاہتا ہے وہ بغیر دلیل کے بھی عطا کر دیتا ہے، جو عقل میں صرف دلیلوں کے ذریعے ہی سمجھے جاتے ہیں، کیونکہ مقصود دلیل نہیں ہے بلکہ مقصود اس کا مدلول ہے۔ پس جب وہ حق (الحق) کے کسی رُخ سے حاصل ہو جائے بغیر اس دلیل کے جس سے وہ عقلی نظر میں مربوط ہوتا ہے، تو دلیل کی ضرورت نہیں رہتی۔ کیونکہ ہم جانتے ہیں کہ دلیل نفس میں مدلول کے حصول کے مقابل ہوتی ہے اور یہ دونوں جمع نہیں ہو سکتے۔ اور یہ غلط ہے۔ بلکہ جو چیز مدلول کے ساتھ جمع نہیں ہوتی وہ دلیل میں غور و فکر ہے، نہ کہ عین دلیل۔ کیونکہ دلیل میں غور کرنے والا فاقد (کھونے والا) بھی ہے اور واجد (پانے والا) بھی، اور مدلول کو حاصل کرنے والا بھی ہے۔\n\nاور المحاضرہ (المحاضرة) بندے کی طرف سے اسماء الٰہیہ (الأسماء الإلهية) اور اسماء کونیہ (الأسماء الکونیة) کے ساتھ بھی ہو سکتی ہے، اس لحاظ سے کہ حق (الحق) نے اسماء کونیہ کے ذریعے اپنے آپ کو موسوم کیا ہے اور اسماء الٰہیہ کے ذریعے کون (کائنات) نے اپنے آپ کو موسوم کیا ہے، اور دونوں جانبوں نے تمام اسماء کا استحقاق حاصل کر لیا ہے۔ اور یہ اس حدیث کو تقویت دیتا ہے کہ عالم کو صورت (تصویر) پر پیدا کیا گیا۔ پس جب اسماء حسنیٰ (الأسماء الحسنى) اور اسماء کون حاضر ہوں اور میدان مفاخرت میں چلیں، تو اللہ منافقین اور جناب الٰہی کے ساتھ استہزاء کرنے والوں کے ساتھ استہزاء کرتا ہے، اور وہ سبحانہ مکر کرنے والوں کے ساتھ مکر کرتا ہے، اور اسے اس شخص پر تعجب ہوتا ہے جس نے طبیعت کو اس کے حکم کی قوت کے باوجود مغلوب کر دیا۔ اور یہ سب محدثات (المحدثات) کی علامات ہیں، اور حق (الحق) نے ان کے ذریعے اپنے آپ کو موسوم کیا ہے، جیسا کہ اس نے اپنے آپ کو قدیر (قدیرا)، خلاق (خلاقا)، اور علیم (علیما) ہونے کے ذریعے موسوم کیا ہے۔\n\nچنانچہ ایک گروہ کے نزدیک ہر چیز اس نسبی اصل (الأصل النسبي) کی اصل ہے جس نے عالم کو وجود بخشا۔ اور بعض نے فرق کیا اور اسماء حسنیٰ (الأسماء الحسنى) کے خلاف کو کون (کائنات) میں ایک اصل قرار دیا جو جناب الٰہی میں منتقل ہے۔ اور ہر شخص میں اس المحاضرہ (المحاضرة) کا حکم اس کے مطابق ہوتا ہے جو اس کے نزدیک قوی ہو اور جو اسے نظر (غور و فکر) عطا کرے۔ چنانچہ اس میں اہل اللہ (أهل الله) کے احوال مختلف ہوتے ہیں۔ اور یہی اس کا فرمان ہے: \"بے شک اس میں ان لوگوں کے لیے نشانیاں ہیں جو غور و فکر کرتے ہیں\" (إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ)۔ اور ذات حق (ذات الله) میں غور و فکر محال ہے، لہٰذا صرف کون (کائنات) میں غور و فکر باقی رہتا ہے۔ اور فکر کا تعلق اسماء حسنیٰ (الأسماء الحسنى) اور محدثات (المحدثات) کی علامات سے ہے۔ پس اس نظر کے مطابق تمام اسماء کون میں اصل ہیں۔ چنانچہ جب کوئی اسماء کی المحاضرہ (المحاضرة) اور ان کی مناظرہ (مناظرتها) پر کھڑا ہوتا ہے، تو وہ جان لیتا ہے کہ کون کے وجود میں، بعد اس کے کہ وہ نہ تھا، کس نے اثر ڈالا: کیا حق (الحق) نے وجود میں اثر ڈالا، یا اس کی استعداد نے، یا دونوں کے مجموعے نے؟ یہ المحاضرہ (المحاضرة) کا فائدہ ہے۔ اور اللہ حق (الْحَقَّ) فرماتا ہے اور وہی راہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب دویست و پنجاه و هفتم در معرفت المحاضرة (حضور/مراقبه).\n\nو آن عبارت است از حضور قلب با تواتر برهان و همگامی با اسماء الهیه (الأسماء الإلهية) بر اساس حقایقی که اکوان (عوالم هستی) طالب آن هستند.\n\nحضور اسماء در حضرت ذات *** دلیلی است بر گذشته، دلیلی است بر آینده\nمن به آن سخن می‌گویم و کائنات وجود آن را می‌دهد *** برای یافتن دردها و یافتن لذت‌ها\nاگر وجود محو (المحو) نبود، نزد ما صحیح نمی‌بود *** و نه نزد کسی که وجودی برای اثبات (الإثبات) می‌داند.\n\n[المحاضرة (حضور) و آن حضور قلب با تواتر برهان است]\n\nالمحاضرة (حضور) صفت اهل اعتبار و نظر است که شرعاً به آن امر شده است. آنان از نظر در دلیلی پس از آنکه مدلولش را به ایشان می‌دهد، فارغ نمی‌شوند، مگر آنکه خداوند دلیل دیگری را برایشان آشکار سازد. پس به نظر در آن مشغول می‌شوند تا آنکه دلالت خود را به طور کامل ادا کند. هنگامی که مدلول آن را به دست آوردند، حق (الحق) دلیل دیگری را به ایشان نشان می‌دهد، و این همیشه چنین است. و این همان قول خداوند متعال است: «به زودی آیات خود را در آفاق و در نفوسشان به ایشان نشان خواهیم داد» (سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ). پس ذکر کرد که آیات را به ایشان نشان می‌دهد و آن را یک آیه قرار نداد. سپس فرمود: «تا برایشان آشکار شود که او حق است» (حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ). و این همان دست یافتن ایشان بر وجه دلیل و حصول مدلول است.\n\nاین مسئله‌ای است که فتوحات مکاشفه (المكاشفة) در آن متفاوت است. برخی از ایشان دلیل و مدلولش را به صورت کشفی دریافت می‌کنند و هرگز آن مدلول را بدون دلیلش دریافت نمی‌کنند. تا جایی که برخی از علمای این راه گمان کرده‌اند که علوم وهبی (الوهب) که شأنشان این است که در نظر جز با دلیل عقلی درک نمی‌شوند، به کسی که به او بخشیده شده‌اند، جز با ادله‌شان اعطا نمی‌شوند، زیرا این علوم با ادله‌شان ارتباطی عقلی دارند.\n\nو برخی دیگر می‌گویند که خداوند می‌تواند هر علمی را که بخواهد، از علومی که در عقل جز با ادله درک نمی‌شوند، بدون دلیلش اعطا کند؛ زیرا مقصود، دلیل نیست، بلکه مقصود مدلول آن است. پس اگر مدلول به وجهی از حق (الحق) و بدون دلیلی که در نظر عقلی به آن مرتبط است، حاصل شود، نیازی به دلیل نیست؛ چرا که دانسته‌ایم دلیل در مقابل حصول مدلول در نفس قرار می‌گیرد و این دو با هم جمع نمی‌شوند. و این اشتباه است. آنچه با مدلول جمع نمی‌شود، نظر کردن در دلیل است، نه خود دلیل. زیرا کسی که در دلیل نظر می‌کند، هم فاقد است (در حال جستجو) و هم واجد (در حال یافتن) و محصّل مدلول است.\n\nو المحاضرة (حضور) ممکن است از جانب بنده با اسماء الهیه (الأسماء الإلهية) و کونیه (الأسماء الکونیة) باشد، از این جهت که حق (الحق) خود را به اسماء کونیه متصف ساخته است و اسماء الهیه نیز کون (جهان) را به خود متصف ساخته است و هر دو جانب (حق و خلق) مستحق تمامی اسماء هستند. و این چیزی است که حدیث خلق عالم بر صورت (خداوند) را تقویت می‌کند. پس هنگامی که اسماء الحسنی و اسماء کون حاضر شوند و در میدان مفاخره (فخر فروشی) به جریان افتند، خداوند منافقان و اهل استهزاء به جناب الهی را استهزاء می‌کند و سبحانه با مکرکنندگان مکر می‌ورزد و از کسی که طبیعت را با وجود قدرت حکمش مقهور ساخته، تعجب می‌کند. و این همه، نشانه‌های محدثات (مخلوقات) است و حق (الحق) خود را به آن‌ها متصف ساخته، همان‌گونه که خود را به قدیر، خلاق، علیم و غیره متصف نموده است.\n\nپس نزد طایفه‌ای، همه این‌ها اصلی برای اصل نسبی است که عالم را ایجاد کرده است. و برخی دیگر تفاوت قائل شده‌اند و آنچه خلاف اسماء الحسنی است را اصلی در کون قرار داده‌اند که به جناب الهی منتقل شده است. و حکم این المحاضرة (حضور) در هر شخص، بر حسب آنچه نزد او تقویت می‌شود و نظر به او می‌دهد، متفاوت است. پس احوال اهل الله در این باره مختلف است. و این همان قول اوست: «همانا در این، نشانه‌هایی است برای قومی که تفکر می‌کنند» (إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ). و تفکر در ذات خداوند محال است، پس جز تفکر در کون (جهان) باقی نمی‌ماند. و متعلق فکر، اسماء الحسنی و نشانه‌های محدثات است. پس بر اساس این نظر، تمامی اسماء اصلی در کون هستند. بنابراین، هرگاه سالک بر المحاضرة (حضور) اسماء و مناظره آن‌ها وقوف یابد، درمی‌یابد که چه چیزی در وجود کون پس از آنکه نبود، تأثیر گذاشته است: آیا حق الوجود (الحق الوجود) در آن تأثیر گذاشته، یا استعداد آن، یا مجموع این دو؟ این فایده المحاضرة (حضور) است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}