{
  "id": 514,
  "title": {
    "ar": "الباب الرابع عشر وخمسمائة في معرفة حال قطب كان منزله ومن يَتَوَكَّلْ عَلَى الله فَهُوَ حَسْبُهُ",
    "en": "Chapter 514: Concerning the Knowledge of the Spiritual State (حال) of a Pole (قطب) whose Station (منزل) is: <<وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ>> (And whosoever relies upon Allah, He is sufficient for him).",
    "ur": "باب پانچ سو چودہواں: ایک قطب (قطب) کے حال کی معرفت (المعرفۃ) کے بیان میں جس کی منزل یہ تھی: \"اور جو کوئی اللہ پر بھروسہ کرے تو وہ اسے کافی ہے\" (وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ)۔",
    "fa": "باب پانصد و چهاردهم در معرفت حال قطب (قطب) که منزل او بود: «وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ» (و هر کس بر خدا توکل کند، پس او برای وی کافی است)"
  },
  "content": {
    "ar": "## (الباب الرابع عشر وخمسمائة في معرفة حال قطب كان منزله ومن يَتَوَكَّلْ عَلَى الله فَهُوَ حَسْبُهُ)\n\n\n> ومن يتوكل على ربه *** فإن إله الورى حسبه‏\n\n\n> وإن كان في كل أحواله *** يراه به دائما ربه‏\n> فذاك الولي الذي لم يزل *** على ما يراد به قلبه‏\n\n\n### [ليس للعبد أن يتكل إلا بالحق‏]\n\n\nاعلم أيدنا الله وإياك بروح منه أن هذا الذكر يعطي صاحبه أنه هو إذ لا يكتفي إلا به‏\n\n\nلأن النبي صَلَّى اللهُ عَليهِ وسَلَّم يقول ليس وراء الله مرمى‏\n\n\nفما كان من حجاب فما هو إلا بينك وبينه ما هو وراءه فإنه الأول وأنت الآخر وهو قبلتك فلا يكون له منك إلا المواجهة ثم أرسل بينك وبينه حجب الأسباب والنسب والعادات وجعلها صورا له من حيث لا تشعر فمن قال هي هو صدق ومن قال ما هي هو فللاختلاف الذي يراه فيها فيصدق فإنه يحجبه عن العلم به اختلاف الصور فكما يقطع أن هذه الصورة ليست هذه الصورة أي هذا السبب ما هو هذا السبب يقطع أنها ما هي هو وذهل عن حقيقة الحجاب أو كونها وإن اختلفت فهي واحدة في السببية أو الحجابية كذلك هي عينه وإن اختلفت وإن لم يكن الأمر هكذا وإلا فلا تصح المواجهة أ لا ترى الأعمى إذا واجهته وكافحته لا يقدح عماه وكونه لا يراك وأنت تراه عن حكم المواجهة بينكما مع كون الأعمى يرى الظلمة بلا شك وأنت عنده في عين تلك الظلمة التي يراها فيدركك ظلمة لأنه يواجهك فيقول رأيت فلانا اليوم مواجهة ويصدق مع كونه أعمى فما وراء الله مرمى وما وراءك له مرمى لأن الصورة الإلهية بك كملت وفيك شهدت فهو حسبك كما أنت حسبه ولهذا كنت آخر موجود وأول مقصود ولو لا ما كنت معدوما ما كنت مقصودا فصح حدوثك ولو لا ما كان علمك به معدوما ما صح أن تريد العلم به فهذا من أعجب ما في الوجود أن يكون من أعطاك العلم بنفسه لا يعلم نفسه إلا بك لأن الممكنات أعطت العلم بأنفسها الحق ولا يعلم شي‏ء منها نفسه إلا بالحق فلهذا كان حسبك لأنه الغاية التي إليها تنتهي وأنت حسبه لأنه ما ثم بعده إلا أنت ومنك علمك وما هي إلا المحال وهو عين العدم المحض الذي التبست بظله كما التبست بضوء الوجود النور فقابلت الطرفين بذاتك فإن نسب إليك العدم لم تستحل عليك هذه النسبة لظلمته عليك وإن نسب إليك الوجود لم يستحل لضوئه فيك الذي به ظهرت لك فلا يقال فيك موجود فإن ظل العدم الذي فيك يمنع من هذا الإطلاق إن تستحقه استحقاق من لا يقبل العدم ولا يقال فيك معدوم لأن ضوء الوجود الذي فيك يمنع من هذا الإطلاق إن تستحقه استحقاق من لا يقبل الوجود فأعطيت اسم الممكن والجائز لحقيقة معقولة تسمى الإمكان والجواز وحصل اسم الموجود للواجب بالذات لحقيقة تسمى الوجود وهي عين الموجود كما إن الإمكان عين الممكن من حيث ما هو ممكن لا من حيث هو ممكن ما وحصل اسم المعدوم للمحال وهو الذي لا يقبل الوجود لذاته لحقيقة تسمى العدم المطلق وهو الإحالة فأنت جامع الطرفين ومظهر الصورتين وحامل الحكمين لولاك لأثر المحال في الواجب وأثر الواجب في المحال فأنت السد الذي لا ينخرم ولا ينقصم فلو كان للعدم لسان لقال إنك على صورته فإنه لا يرى منك إلا ظله كما كان للوجود كلام فقال إنك على صورته فإنه رأى فيك صورته فعلمك بك لنوره وجهلك العدم المطلق لظله فأنت المعلوم المجهول وصورة الحق سواء فتعلم من حيث رتبتك لا من حيث صورتك إذ لو علمت من حيث صورتك لعلم الحق والحق لا يعلم فأنت من حيث صورتك لا تعلم فالعلم بك إجمال لا تفصيل فقد عرفتك ما يعطيك هذا الذكر من العلم بالله إن عقلت والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ والهادي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيم‏\n\n",
    "en": "Chapter 514: Concerning the Knowledge of the State of a Pole (Qutb) whose Station was: \"And whoever relies upon Allah, He is sufficient for him.\"\n\nAnd whoever relies upon his Lord,\nThen the God of creation is sufficient for him.\n\nAnd though in all his states,\nHis Lord perpetually sees him by means of Him.\n\nThat is the Friend (Wali) who never ceases\nTo have his heart upon what is desired of him.\n\n### [The servant should rely only upon The Real (al-Haqq)]\n\nKnow—may Allah support us and you with a Spirit from Him—that this invocation (dhikr) grants its possessor that he is [The Real], since he is sufficient only by Him.\n\nBecause the Prophet, peace and blessings be upon him, says: \"There is no goal beyond Allah.\"\n\nThus, any veil (hijab) that exists is only between you and Him, not beyond Him, for He is the First (al-Awwal) and you are the Last (al-Akhir), and He is your direction of prayer (Qibla). Therefore, He receives nothing from you except direct confrontation (al-muwajaha). Then He sent between you and Him the veils of causes (asbab), relationships, and customs, and made them forms (suwar) of Himself without your perceiving it. So, whoever says they are Him speaks the truth, and whoever says they are not Him—due to the difference he perceives in them—also speaks the truth.\n\nFor the difference in forms veils him from the Knowledge (al-Ilm) of Him. Just as he determines definitively that this form is not that form—meaning this cause is not that cause—he determines definitively that they are not Him. And he is heedless of the reality of the veil or the fact that, even though they differ, they are one in their causality or their veiling nature. Likewise, they are His very Essence ('ayn) even though they differ. If the matter were not thus, then direct confrontation would not be valid. Do you not see that if you confront and face a blind person, his blindness and the fact that he does not see you while you see him does not invalidate the ruling of direct confrontation between you? This is despite the fact that the blind person undoubtedly sees darkness, and you are, for him, within the very darkness he sees. Thus, he perceives you as darkness because he confronts you, and he says, \"I saw so-and-so today in confrontation,\" and he speaks the truth, despite being blind.\n\nThere is no goal beyond Allah, and there is no goal beyond you for Him, because the Divine Form (al-Sura al-Ilahiyya) was perfected by you and witnessed within you. Thus, He is sufficient for you (hasbuk), just as you are sufficient for Him (hasbuhu). For this reason, you were the last existent (akhir mawjud) and the first intended (awwal maqsud). If you had not been non-existent (ma'dum), you would not have been intended, and thus your contingency (huduth) is validated. And if your knowledge of Him had not been non-existent, it would not have been valid for you to desire the Knowledge of Him.\n\nThis is among the most wondrous things in Existence (al-Wujud): that He who granted you the Knowledge of Himself does not know Himself except through you. Because the contingent beings (al-mumkinat) granted The Real (al-Haqq) the Knowledge of themselves, yet none of them knows itself except through The Real. For this reason, He is sufficient for you because He is the ultimate goal (al-ghaya) to which you return, and you are sufficient for Him because there is nothing after Him except you, and from you comes His Knowledge. And that [which is after Him] is nothing but the impossible (al-muhal), which is the very Essence of pure Non-existence (al-Adam al-Mahd) whose shadow you have assumed, just as you have assumed the Light (al-Nur) by the illumination (daw') of Existence. Thus, you confront both extremes with your Essence (dhat).\n\nIf Non-existence (al-Adam) is attributed to you, this attribution is not impossible for you, due to its darkness upon you. And if Existence (al-Wujud) is attributed to you, it is not impossible, due to its light within you, by which you became manifest to yourself. Therefore, it cannot be said of you that you are Existent (Mawjud) [absolutely], for the shadow of Non-existence within you prevents this absolute designation, even if you deserve it as one who does not accept Non-existence. Nor can it be said of you that you are Non-existent (Ma'dum), for the light of Existence within you prevents this absolute designation, even if you deserve it as one who does not accept Existence.\n\nThus, you were given the name Contingent (al-Mumkin) and Permissible (al-Ja'iz) due to an intelligible reality called Contingency (al-Imkan) and Permissibility (al-Jawaz). And the name Existent (al-Mawjud) belongs to the Necessary by Essence (al-Wajib bi al-Dhat) due to a reality called Existence (al-Wujud), which is the very Essence of the Existent, just as Contingency is the very Essence of the contingent being insofar as it is contingent, not insofar as it is a specific contingent being. And the name Non-existent (al-Ma'dum) belongs to the Impossible (al-Muhal), which is that which does not accept Existence by its Essence, due to a reality called Absolute Non-existence (al-Adam al-Mutlaq), which is Impossibility (al-Ihala).\n\nTherefore, you are the collector of the two extremes, the manifestation of the two forms, and the bearer of the two rulings. Were it not for you, the Impossible would affect the Necessary, and the Necessary would affect the Impossible. Thus, you are the barrier (al-sadd) that is neither breached nor broken. If Non-existence had a tongue, it would say that you are upon its form, for it sees nothing of you except its shadow. Just as Existence has speech and says that you are upon its form, for it sees its form within you. Thus, your Knowledge of yourself is due to His light, and your ignorance is due to the shadow of Absolute Non-existence.\n\nTherefore, you are the Known and the Unknown, and the form of The Real (al-Haqq) is the same. So, you are known from the perspective of your level (martaba), not from the perspective of your form (sura), for if you were known from the perspective of your form, The Real would be known, and The Real is not known [in His Essence]. Thus, from the perspective of your form, you are not known. Therefore, the Knowledge of you is summary (ijmal), not detailed (tafsil).\n\nI have now made known to you what this invocation grants you of the Knowledge of Allah, if you understand. And Allah says the truth, and He guides the way, and He guides whom He wills to a straight path.",
    "ur": "باب نمبر پانچ سو چودہ: اس قطب (القطب) کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور جو اللہ پر توکل (التوکل) کرتا ہے، تو وہ اسے کافی ہے\" (وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ)۔\n\nاور جو اپنے رب پر توکل (التوکل) کرتا ہے،\nتو مخلوقات کا معبود اسے کافی ہے۔\nاور اگر وہ اپنے تمام احوال میں،\nاپنے رب کو ہمیشہ اسی کے ذریعے دیکھتا ہے۔\nتو وہ ایسا ولی (الولی) ہے جس کا قلب ہمیشہ،\nاسی پر رہتا ہے جو اس سے مطلوب ہے۔\n\n### [بندے کے لیے ذات حق (الحق) کے سوا کسی پر بھروسہ کرنا جائز نہیں]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح سے تائید بخشے، کہ یہ ذکر اپنے صاحب کو یہ عطا کرتا ہے کہ وہ (ذات حق) ہی ہے، کیونکہ وہ (صاحب) صرف اسی سے اکتفا کرتا ہے۔\n\nکیونکہ نبی اکرم صلی اللہ علیہ وسلم فرماتے ہیں: \"اللہ کے ماوراء کوئی ٹھکانہ نہیں\" (لَيْسَ وَرَاءَ اللَّهِ مَرْمَى).\n\nپس جو بھی حجاب (الحجاب) ہے، وہ صرف تمہارے اور اس کے درمیان ہے، اس کے ماوراء کچھ نہیں، کیونکہ وہ (الحق) الاول ہے اور تم الآخر ہو، اور وہ تمہارا قبلہ ہے۔ لہٰذا اس کے لیے تمہاری طرف سے صرف مواجہت (آمنے سامنے ہونا) ہی ہو سکتی ہے۔ پھر اس نے تمہارے اور اپنے درمیان اسباب، نسب اور عادات کے حجابات (الحجاب) بھیج دیے، اور انہیں اس کی صورتیں بنا دیا اس طرح کہ تمہیں شعور بھی نہ ہوا۔ پس جس نے کہا کہ یہ (صورتیں) وہی (الحق) ہیں، تو اس نے سچ کہا، اور جس نے کہا کہ یہ وہ نہیں ہیں، تو اس اختلاف کی وجہ سے جو وہ ان میں دیکھتا ہے، وہ بھی سچ کہتا ہے، کیونکہ صورتوں کا اختلاف اسے ذات حق (الحق) کے علم سے حجاب (الحجاب) میں رکھتا ہے۔ پس جس طرح وہ یقین کرتا ہے کہ یہ صورت اس صورت سے مختلف ہے، یعنی یہ سبب اس سبب سے مختلف ہے، اسی طرح وہ یقین کرتا ہے کہ یہ (صورتیں) وہ (الحق) نہیں ہیں، اور وہ حجاب (الحجاب) کی حقیقت سے غافل ہو جاتا ہے، یا اس حقیقت سے کہ اگرچہ وہ مختلف ہیں، لیکن سببیت یا حجابیت میں وہ ایک ہی ہیں۔ اسی طرح وہ (صورتیں) اس کی عین (ذات) ہیں اگرچہ وہ مختلف ہیں۔ اور اگر معاملہ ایسا نہ ہوتا تو مواجہت (المواجهة) درست نہ ہوتی۔ کیا تم نہیں دیکھتے کہ جب تم کسی نابینا کے سامنے آتے ہو اور اس کا سامنا کرتے ہو، تو اس کا اندھا پن اور یہ حقیقت کہ وہ تمہیں نہیں دیکھتا جبکہ تم اسے دیکھتے ہو، تمہارے درمیان مواجہت (المواجهة) کے حکم میں کوئی نقص پیدا نہیں کرتا؟ اس کے باوجود کہ نابینا بلاشبہ تاریکی دیکھتا ہے، اور تم اس کے نزدیک اسی تاریکی کے عین میں ہوتے ہو جسے وہ دیکھتا ہے، لہٰذا وہ تمہیں تاریکی کے طور پر محسوس کرتا ہے۔ چونکہ وہ تمہارا سامنا کر رہا ہوتا ہے، وہ کہتا ہے: \"میں نے آج فلاں کو آمنے سامنے دیکھا\"، اور وہ سچ کہتا ہے حالانکہ وہ نابینا ہے۔ پس اللہ کے ماوراء کوئی ٹھکانہ نہیں، اور تمہارے ماوراء اس کے لیے کوئی ٹھکانہ نہیں، کیونکہ الٰہی صورت تم سے مکمل ہوئی اور تم میں اس کا شہود (الشہود) ہوا۔ پس وہ تمہارے لیے کافی ہے، جیسا کہ تم اس کے لیے کافی ہو۔\n\nاور اسی لیے تم آخری موجود اور پہلے مقصود بنے۔ اگر تم معدوم نہ ہوتے تو مقصود نہ ہوتے، لہٰذا تمہارا حدوث (پیدا ہونا) درست ہوا۔ اور اگر تمہارا علم ذات حق (الحق) کے بارے میں معدوم نہ ہوتا، تو تمہارا اس کے علم کا ارادہ کرنا درست نہ ہوتا۔ یہ ہستی (الوجود) کی سب سے حیرت انگیز چیزوں میں سے ہے کہ جس نے تمہیں اپنی ذات کا علم عطا کیا، وہ اپنی ذات کو تمہارے بغیر نہیں جانتا، کیونکہ ممکنات (الممکنات) نے ذات حق (الحق) کو اپنی ذات کا علم عطا کیا، اور ان میں سے کوئی بھی چیز اپنی ذات کو ذات حق (الحق) کے بغیر نہیں جانتی۔ اسی لیے وہ تمہارے لیے کافی ہے، کیونکہ وہ وہ غایت ہے جس پر تم ختم ہوتے ہو، اور تم اس کے لیے کافی ہو، کیونکہ اس کے بعد تمہارے سوا کچھ نہیں، اور تم سے ہی اس کا علم ہے۔ اور وہ (جو تمہارے بعد ہے) صرف محال (المحال) ہے، جو عین عدم محض (خالص نیستی) ہے، جس کے سائے سے تم اس طرح لپٹے ہوئے ہو جیسے نور، ہستی (الوجود) کی روشنی سے لپٹا ہوا ہے۔ پس تم نے اپنی ذات سے دونوں کناروں کا سامنا کیا۔\n\nپس اگر تمہاری طرف عدم (العدم) کی نسبت کی جائے تو یہ نسبت تم پر محال نہیں ہوتی، کیونکہ اس کا سایہ تم پر ہے۔ اور اگر تمہاری طرف ہستی (الوجود) کی نسبت کی جائے تو یہ محال نہیں ہوتی، کیونکہ اس کی روشنی تم میں ہے جس کے ذریعے تم ظاہر ہوئے۔ لہٰذا تمہیں موجود نہیں کہا جا سکتا، کیونکہ تم میں موجود عدم (العدم) کا سایہ اس اطلاق سے روکتا ہے کہ تم اس کے مستحق ہو جاؤ جس طرح وہ مستحق ہوتا ہے جو عدم کو قبول نہیں کرتا۔ اور نہ ہی تمہیں معدوم کہا جا سکتا ہے، کیونکہ تم میں موجود ہستی (الوجود) کی روشنی اس اطلاق سے روکتی ہے کہ تم اس کے مستحق ہو جاؤ جس طرح وہ مستحق ہوتا ہے جو ہستی کو قبول نہیں کرتا۔ پس تمہیں ممکن (الممکن) اور جائز (الجائز) کا نام ایک معقول حقیقت کی بنا پر دیا گیا جسے امکان (الإمكان) اور جواز (الجواز) کہا جاتا ہے۔ اور موجود (الموجود) کا نام واجب بالذات (الواجب بالذات) کے لیے ایک حقیقت کی بنا پر حاصل ہوا جسے ہستی (الوجود) کہا جاتا ہے، اور وہ عین موجود ہے، جس طرح امکان (الإمكان) عین ممکن (الممکن) ہے اس حیثیت سے کہ وہ ممکن ہے، نہ کہ اس حیثیت سے کہ وہ کوئی خاص ممکن ہے۔ اور معدوم (المعدوم) کا نام محال (المحال) کے لیے حاصل ہوا، جو اپنی ذات کے لیے ہستی (الوجود) کو قبول نہیں کرتا، ایک حقیقت کی بنا پر جسے عدم مطلق (العدم المطلق) کہا جاتا ہے، اور یہی احالہ (ناممکن ہونا) ہے۔\n\nپس تم دونوں کناروں کو جمع کرنے والے، دونوں صورتوں کو ظاہر کرنے والے، اور دونوں احکام کو اٹھانے والے ہو۔ اگر تم نہ ہوتے تو محال (المحال) واجب (الواجب) میں اثر کرتا اور واجب (الواجب) محال (المحال) میں اثر کرتا۔ پس تم وہ سد (بند) ہو جو نہ ٹوٹتا ہے اور نہ پھٹتا ہے۔ اگر عدم (العدم) کی زبان ہوتی تو وہ کہتا کہ تم اس کی صورت پر ہو، کیونکہ وہ تم میں صرف اپنا سایہ دیکھتا ہے۔ جیسا کہ اگر ہستی (الوجود) کی زبان ہوتی تو وہ کہتا کہ تم اس کی صورت پر ہو، کیونکہ اس نے تم میں اپنی صورت دیکھی۔ پس تمہارا علم تمہارے نور کی وجہ سے ہے اور تمہاری جہالت عدم مطلق (العدم المطلق) کے سائے کی وجہ سے ہے۔ پس تم معلوم بھی ہو اور مجہول بھی، اور ذات حق (الحق) کی صورت بھی ہو۔ پس تم اپنی رتبت (مقام) کے لحاظ سے معلوم ہو، نہ کہ اپنی صورت کے لحاظ سے۔ کیونکہ اگر تم اپنی صورت کے لحاظ سے معلوم ہوتے تو ذات حق (الحق) معلوم ہو جاتا، اور ذات حق (الحق) معلوم نہیں ہوتا۔ پس تم اپنی صورت کے لحاظ سے معلوم نہیں ہو، لہٰذا تمہارا علم اجمالی ہے نہ کہ تفصیلی۔ پس اگر تم نے عقل سے کام لیا تو میں نے تمہیں وہ علم بتا دیا جو یہ ذکر تمہیں اللہ کے بارے میں عطا کرتا ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)، اور وہ جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے (وَالْهَادِي مَن يَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيمٍ)۔",
    "fa": "(باب پانصد و چهاردهم در معرفت حال قطبی که منزل او این آیه بود: «وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ» [و هر کس بر خدا توکل کند، او برایش کافی است])\n\nو هر کس بر پروردگارش توکل کند *** همانا خدای مردمان او را بس است\nو اگر در همه احوالش باشد *** پروردگارش را پیوسته به واسطه او می‌بیند\nپس آن ولی (الولي) است که پیوسته *** قلبش بر آنچه از او خواسته می‌شود، استوار است.\n\n[بنده را جز بر حق (الحق) توکل نیست]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که این ذکر (توکل) به صاحبش این را می‌بخشد که او (حق) است، زیرا جز به او اکتفا نمی‌شود.\n\nزیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «ليس وراء الله مرمى» (ورای خداوند هیچ مقصدی نیست).\n\nپس هر حجابی که هست، تنها میان تو و اوست، نه ورای او. زیرا او اول است و تو آخر، و او قبله توست. بنابراین، از جانب تو برای او جز مواجهه (رو در رو شدن) نیست. سپس میان تو و او حجاب‌های اسباب، نسبت‌ها و عادات را فرستاد و آن‌ها را صورت‌هایی برای خود قرار داد، در حالی که تو آگاه نیستی. پس هر کس بگوید آن‌ها (حجاب‌ها) خود او هستند، راست گفته است؛ و هر کس بگوید آن‌ها او نیستند، به دلیل اختلافی که در آن‌ها می‌بیند، راست می‌گوید. زیرا اختلاف صورت‌ها او را از علم به حق (الحق) محجوب می‌سازد. همان‌طور که یقین دارد این صورت، آن صورت نیست – یعنی این سبب، آن سبب نیست – یقین می‌کند که آن‌ها او نیستند، و از حقیقت حجاب یا از این واقعیت غافل می‌شود که آن‌ها، اگرچه متفاوتند، در سببیّت یا حجابیّت یکی هستند. همچنین، آن‌ها عین او هستند، اگرچه متفاوت باشند. و اگر امر چنین نبود، مواجهه صحیح نمی‌شد. آیا نمی‌بینی که اگر با شخص نابینا روبرو شوی و با او مواجه گردی، نابینایی او و اینکه تو را نمی‌بیند (در حالی که تو او را می‌بینی) به حکم مواجهه میان شما خللی وارد نمی‌کند؟ با وجود اینکه نابینا بی‌شک تاریکی را می‌بیند و تو نزد او در عین همان تاریکی هستی که او می‌بیند. پس تو را به صورت تاریکی درک می‌کند، زیرا با تو مواجه است و می‌گوید: «امروز فلانی را رو در رو دیدم» و راست می‌گوید، با وجود اینکه نابیناست. پس ورای خداوند مقصدی نیست، و ورای تو نیز برای او مقصدی نیست، زیرا صورت الهی به واسطه تو کامل شد و در تو شهود (الشهود) یافت. پس او تو را بس است، همان‌طور که تو او را بس هستی. و به همین دلیل بود که تو آخرین موجود و اولین مقصود بودی. اگر معدوم نبودی، مقصود نبودی، پس حدوث تو صحیح است. و اگر علم تو به او معدوم نبود، صحیح نبود که اراده علم به او کنی.\n\nپس این از شگفت‌انگیزترین امور در هستی (الوجود) است که آن کس که علم به خود را به تو بخشید، خود را جز به واسطه تو نمی‌شناسد؛ زیرا ممکنات (الممكنات) علم به خود را به حق (الحق) دادند، و هیچ یک از آن‌ها خود را جز به واسطه حق نمی‌شناسد. به همین دلیل او تو را بس است، زیرا او غایتی است که به آن منتهی می‌شوی؛ و تو او را بس هستی، زیرا پس از او جز تو نیست و علم تو از توست. و آن (علم) چیزی جز محال (المحال) نیست، که عین عدم محض است و تو به سایه آن آمیخته شدی، همان‌طور که نور به روشنایی هستی (الوجود) آمیخته شد. پس تو با ذات خود با هر دو طرف مقابله کردی.\n\nپس اگر عدم به تو نسبت داده شود، این نسبت به دلیل ظلمت آن بر تو، محال نیست؛ و اگر هستی (الوجود) به تو نسبت داده شود، به دلیل نور آن در تو که به واسطه آن برایت ظاهر شدی، محال نیست. پس در مورد تو گفته نمی‌شود «موجود»، زیرا سایه عدمی که در توست، مانع از این اطلاق می‌شود که شایسته آن باشی، شایستگی کسی که عدم را نمی‌پذیرد. و در مورد تو گفته نمی‌شود «معدوم»، زیرا روشنایی هستی (الوجود) که در توست، مانع از این اطلاق می‌شود که شایسته آن باشی، شایستگی کسی که هستی را نمی‌پذیرد. پس نام «ممکن» و «جایز» به تو داده شد، به خاطر حقیقتی معقول که امکان و جواز نامیده می‌شود. و نام «موجود» برای واجب بالذات (الواجب بالذات) حاصل شد، به خاطر حقیقتی که هستی (الوجود) نامیده می‌شود و آن عین موجود است، همان‌طور که امکان عین ممکن است از آن حیث که ممکن است، نه از آن حیث که ممکن خاصی است. و نام «معدوم» برای محال (المحال) حاصل شد، که به ذات خود هستی را نمی‌پذیرد، به خاطر حقیقتی که عدم مطلق نامیده می‌شود و آن همان احاله (ممتنع بودن) است.\n\nپس تو جامع دو طرف و مظهر دو صورت و حامل دو حکم هستی. اگر تو نبودی، محال (المحال) در واجب (الواجب) اثر می‌گذاشت و واجب در محال اثر می‌گذاشت. پس تو سدی هستی که نه شکافته می‌شود و نه می‌شکند. اگر عدم زبانی داشت، می‌گفت که تو بر صورت اویی، زیرا از تو جز سایه خود را نمی‌بیند. همان‌طور که اگر هستی (الوجود) سخنی داشت، می‌گفت که تو بر صورت اویی، زیرا صورت خود را در تو دید. پس علم تو به واسطه نور اوست و جهل تو به عدم مطلق به واسطه سایه اوست. پس تو معلومِ مجهول و صورت حق (الحق) هستی، به طور یکسان. پس از حیث مرتبه‌ات شناخته می‌شوی، نه از حیث صورتت؛ زیرا اگر از حیث صورتت شناخته می‌شدی، حق (الحق) شناخته می‌شد، و حق شناخته نمی‌شود. پس تو از حیث صورتت شناخته نمی‌شوی. بنابراین، علم به تو اجمالی است نه تفصیلی. به تحقیق تو را آگاه ساختم که این ذکر (توکل) چه علمی از خداوند به تو می‌بخشد، اگر تعقل کنی. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند) و «وَالْهَادِي مَن يَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيمٍ» (و هدایت‌کننده کسی است که بخواهد به سوی راه راست)."
  },
  "page_count": 2
}