{
  "id": 414,
  "title": {
    "ar": "الباب الرابع عشر وأربعمائة في معرفة منازلة ما ترى إلا بحجاب",
    "en": "Chapter Four Hundred and Fourteen: Concerning the Gnosis of the Stations in which nothing is perceived except by a Veil.",
    "ur": "باب چار سو چودہ: ان منازل کی معرفت میں جن میں جو کچھ دیکھا جاتا ہے وہ صرف پردے کے ساتھ ہوتا ہے۔",
    "fa": "باب چهارصد و چهاردهم در معرفت منازل کسانی که جز با حجاب چیزی نمی‌بینند"
  },
  "content": {
    "ar": "## «الباب الرابع عشر وأربعمائة في معرفة منازلة ما ترى إلا بحجاب»\n\n\n> من رأى الحق جهارا علنا *** إنما أبصره خلف حجاب‏\n\n\n> وهو لا يعرفه وهو به *** إن هذا لهو الأمر العجاب‏\n\n\n> كل راء لا يرى غير الذي *** هو فيه من نعيم وعذاب‏\n\n\n> صورة الرائي تجلت عنده *** وهي عين الرائي بل عين الحجاب‏\n### [تجلى الحق تعالى في الصور وتحوله فيها]\n\n\nورد في الصحيح تجلى الحق في الصور وتحوله فيها وهو مرادنا بالحجاب ثبت عقلا وشرعا وكشفا والكشف يعطي ما يعطي الشرع سواء وإن الحق لا يقبل التغيير فأما بالعقل فالأدلة في ذلك معروفة ليس هذا الكتاب موضعها فإنه مبني على الشرع وعلى ما يعطيه الكشف والشهود فإن العقول تقصر عن إدراك الأمر على ما يشهد به الشرع في حقه وأما الشرع فقوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فلو تغير في ذاته لم يصدق هذا الحكم وهو صدق فاستحال أن يتغير في ذاته والحق يقول إن الله قال على لسان عبده سمع الله لمن حمده وقال كنت سمعه وبصره‏\n\n\nفالصور التي تقع عليها الأبصار والصور التي تدركها العقول والصور التي تمثلها القوة المتخيلة كلها حجب يرى الحق من ورائها وينسب ما يكون من هذه الصور من الأعمال إلى الله تعالى كما قال والله خَلَقَكُمْ وما تَعْمَلُونَ فلم يزل الحق غيبا فيما ظهر من الصور في الوجود وأعيان الممكنات في شيئية ثبوتها على تنوعات أحوالها مشهودة للحق غيبا أيضا وأعيان هذه الصور الظاهرة في الوجود الذي هو عين الحق أحكام أعيان الممكنات من حيث ما هي عليه في ثبوتها من الأحوال والتنوع والتغيير والتبديل تظهر في هذه الصور المشهودة في عين الوجود الحق وما تغير الحق عما هو عليه في نفسه كما إن الهباء ما تغير عن كونه هباء مع قبوله لجميع الصور فهي معان في جوهره والمعاني المنسوبة إلى تلك الصور والأعراض والصفات من باب قيام المعنى بالمعنى فلا تزال الحجب مسدلة وهي أعيان هذه الصور فلا يرى إلا من وراء حجاب كما لا يكلم إلا من وراء حجاب فإذا رآه الرائي كفاحا فما يراه إلا حتى يكون الحق بصره فيكون هو الرائي نفسه ببصره في صورة عبده فأعطته الصورة المكافحة إذ كانت الحاملة للبصر ولجميع القوي فتشهده في الصورة عينا من الاسم الظاهر إذ هو بصرك وكفاحا وتشهده من الاسم الباطن علما إذ هو بصر آلتك التي أدركت بها ما أدركت وإنما قلنا كفاحا لما ورد في الخبر النبوي الذي خرجه الترمذي وغيره في سياق هذه اللفظة عينها ثم إن صاحب الرؤيا إذا رأى ربه تعالى كفاحا في منامه في أي صورة يراه فيقول رأيت ربي في صورة كذا وكذا ويصدق ويصدق مع قوله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فنفى عنه المماثلة في قبوله التجلي في الصور كلها التي لا نهاية لها لنفسه فإن كل من سواه تعالى ممن له التجلي في الصور لا يتجلى في شي‏ء منها لنفسه وإنما يتجلى فيها بمشيئة خالقه وتكوينه فيقول للصورة التي يتجلى فيها من هذه صفته كن فتكون الصورة فيظهر بها من له هذا القبول من المخلوقين كالأرواح والمتروحنين من الأناسي كقضيب البان وشبهه يقول الله تعالى في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ فسواه وعدله على مزاج يقبل كل صورة إذا شاء الحق وجعل التركيب لله لا له وفي نسبة الصور لله يقال في أي صورة شاء ظهر من غير جعل جاعل فلا يلتبس عليك الأمر في ذلك ولما لم يكن له تعالى ظهور إلى خلقه إلا في صورة وصوره مختلفة في كل تجل لا تتكرر صورة فإنه سبحانه لا يتجلى في صورة مرتين ولا في صورة واحدة لشخصين ولما كان الأمر كذلك لم ينضبط للعقل ولا للعين ما هو الأمر عليه ولا يمكن للعقل تقييده بصورة ما من تلك الصور فإنه ينتقض له ذلك التقييد في التجلي الآخر بالصورة الأخرى وهو الله في ذلك كله لا يشك ولا يرتاب إلا إذا تجلى له في غير معتقده فإنه يتعوذ منه كما ورد في صحيح الأخبار فيعلم إن ثم في نفس الأمر عينا تقبل الظهور في هذه الصور المختلفة لا يعرف لها ماهية أصلا ولا كيفية وإذا حكم ولا بد بكيفية فيقول الكيفية ظهورها فيما شاء من الصور فتكون الصور مشاءة وكل مشاء معدوم بلا شك فما ظهر لك إلا حادث في عين قديم فما رأيت إلا حادثا مثلك لأنك ما رأيت إلا صورة يقيدها نظرك ببصر هو الحق في عين هو الحق أعني في العين التي ظهرت في تلك الصورة فهو مدرك عينا في الآخرة والنوم وعلما وشرعا وغير مدرك علما ولا نشك إيمانا وكشفا لا عقلا إن بهويته أدرك المدرك جميع ما يدرك سواء أدرك جميع ما يدرك أو بعضه على أي حالة يكون استعداد المدرك اسم مفعول فالبصر من المدرك اسم فاعل هوية الحق لا بد من ذلك وهكذا جميع ما ينسب إلى هذه الآلات من القوي ما هي سوى هوية الحق إذ يستحيل خلاف ذلك فالآلات ومحلها أحكام أعيان الممكنات في عين الوجود الحق وهو لها كالروح للصورة التي لا يمسك عليها ذلك النظام إلا هو ولا تدرك تلك الصورة شيئا إلا به حسا وخيالا والكل بحمد الله خيال في نفس الأمر لأنه لا ثبات لها دائما على حال واحدة والناس نيام وكل ما يراه النائم قد عرف ما يرى وفي أي‏\n\n\nحضرة يرى فإذا ماتوا انتبهوا من هذا النوم في النوم فما برحوا\nنائمين فما برحوا في رؤيا فما برحوا في أنفسهم من هذا التنوع وما برح ما يدركونه في أعينهم من التنوع فلم يزل الأمر كذلك ولا يزال الأمر في الحياة الدنيا وفي الآخرة هكذا كما أوردناه وذكرناه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Fourteen: Concerning the Station of Knowing that You See Only Through a Veil\n\nHe who sees The Real (الحق) openly and plainly,\nHe only perceives Him from behind a veil.\n\nYet he does not know Him, though He is with him;\nTruly, this is the most wondrous affair.\n\nEvery seer sees nothing other than that\nIn which he dwells, be it bliss or torment.\n\nThe form of the seer is manifested before him,\nAnd it is the very essence of the seer, nay, the very essence of the veil.\n\n### [The Self-disclosure (تجلي) of The Real (الحق) in Forms and His Transformation within Them]\n\nIt is mentioned in the sound tradition (صحيح) that The Real discloses Himself (تجلى) in forms (صور) and transforms within them. This is what we mean by the veil (حجاب). This is established by reason (عقلا), by the Sacred Law (شرعا), and by Unveiling (كشفا). Unveiling yields exactly what the Sacred Law yields: that The Real does not accept change.\n\nAs for reason, the proofs concerning this are well-known, but this book is not the place for them, as it is founded upon the Sacred Law and upon what Unveiling (كشف) and Witnessing (شهود) provide. For intellects fall short of grasping the matter as the Sacred Law testifies concerning Him.\n\nAs for the Sacred Law, it is His saying: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing whatsoever like unto Him). If He were to change in His Essence (ذات), this judgment would not be true, yet it is true. Therefore, it is impossible for Him to change in His Essence. The Real says that Allah spoke through the tongue of His servant, \"Allah hears him who praises Him,\" and He said, \"I was his hearing and his sight.\"\n\nThus, the forms upon which the eyes fall, the forms that intellects perceive, and the forms that the imaginative faculty (القوة المتخيلة) represents—all of these are veils (حجب) through which The Real is seen. The actions that arise from these forms are attributed to Allah the Exalted, just as He said: <<وَاللهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do).\n\nThe Real (الحق) has never ceased to be Unseen (غيبا) in what has appeared of forms in Existence (الوجود). And the Fixed Entities (الأعيان الثابتة) of the contingent things (الممكنات) in the substantiality of their permanence, with the variations of their states, are also witnessed by The Real as Unseen.\n\nThe entities of these forms, which are manifest in Existence (الوجود)—which is the very essence of The Real (عين الحق)—are the rulings (أحكام) of the Fixed Entities (أعيان الممكنات) in terms of the states, variations, changes, and substitutions they possess in their permanence. These rulings appear in these witnessed forms within the very essence of True Existence (الوجود الحق).\n\nThe Real has not changed from what He is in Himself, just as the motes (الهباء) have not changed from being motes, despite their acceptance of all forms. These forms are meanings (معان) in His substance (جوهر), and the meanings attributed to those forms, accidents (أعراض), and attributes (صفات) fall under the category of the subsistence of meaning by meaning.\n\nThus, the veils (حجب) remain drawn, and these veils are the very entities of these forms. Therefore, He is only seen from behind a veil, just as He only speaks from behind a veil. If the seer sees Him face-to-face (كفاحا), he only sees Him when The Real becomes his sight (بصره). Thus, the seer is The Real Himself, seeing through His own sight in the form of His servant.\n\nThe form seen face-to-face grants this vision, as it is the bearer of the sight and all the faculties (القوي). You witness Him in the form as an entity (عينا) derived from the Name the Manifest (الظاهر), since He is your sight, and this is face-to-face (كفاحا). And you witness Him from the Name the Hidden (الباطن) as knowledge (علما), since He is the sight of the instrument (آلتك) by which you perceive what you perceive. We only used the term \"face-to-face\" (كفاحا) because it appeared in the Prophetic tradition (الخبر النبوي) narrated by Tirmidhi and others, using this exact wording.\n\nFurthermore, when the person having the vision (صاحب الرؤيا) sees his Lord the Exalted face-to-face (كفاحا) in his sleep, in whatever form he sees Him, he says, \"I saw my Lord in such-and-such a form,\" and he speaks truly. He speaks truly despite His saying, <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing whatsoever like unto Him). He negated resemblance (المماثلة) for Himself in His acceptance of Self-disclosure (التجلي) in all forms, which are endless.\n\nFor everyone other than Him the Exalted who has Self-disclosure in forms does not disclose himself in any of them for his own sake. Rather, he discloses himself in them by the Will of his Creator and His formation (تكوينه). He says to the form in which the one possessing this attribute discloses himself, \"Be!\" and the form comes into being. Through it, those among the creatures who possess this capacity for acceptance appear, such as the spirits (الأرواح) and those humans who have become spiritualized (المتروحنين من الأناسي), like the branch of the Ban tree and its like.\n\nAllah the Exalted says: <<فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ>> (In whatever form He willed, He composed you). He fashioned and balanced him upon a temperament (مزاج) that accepts every form, if The Real wills. And He made the composition (التركيب) belong to Allah, not to him (the human). Regarding the attribution of forms to Allah, it is said: \"In whatever form He willed, He appeared,\" without the making of a maker. So, let the matter not be confused for you in this regard.\n\nSince the Exalted has no manifestation (ظهور) to His creation except in a form, and His forms are different in every Self-disclosure (تجلي)—a form is never repeated—for He, Glory be to Him, does not disclose Himself in one form twice, nor in a single form to two different persons.\n\nSince the matter is thus, neither the intellect nor the eye can grasp what the matter truly is. Nor can the intellect restrict Him to any specific form among those forms, for that restriction would be invalidated for it in the next Self-disclosure by a different form. He is Allah in all of that. No one doubts or wavers, unless He discloses Himself to him in a form contrary to his belief (معتقده), in which case he seeks refuge from it, as is mentioned in the sound traditions (صحيح الأخبار).\n\nThus, he knows that in the reality of the matter (نفس الأمر), there is an Entity (عينا) that accepts manifestation in these various forms, whose quiddity (ماهية) is not known at all, nor is its modality (كيفية). If one must assert a modality, one says: the modality is its manifestation in whatever forms He wills. Thus, the forms are willed, and everything willed is undoubtedly non-existent (معدوم). Therefore, nothing has appeared to you except something originated (حادث) within an Eternal Entity (عين قديم). You have seen nothing but something originated, just like yourself, because you have only seen a form that your gaze restricts by a sight (بصر) that is The Real (الحق) within an Entity (عين) that is The Real—meaning, within the Entity that appeared in that form.\n\nHe is perceived as an entity (عينا) in the Hereafter and in sleep, and He is perceived as knowledge (علما) and by the Sacred Law (شرعا). He is not perceived as knowledge [in the world], yet we do not doubt, by faith (إيمانا) and Unveiling (كشفا)—though not by reason (عقلا)—that by His Ipseity (هوية) the perceiver perceives all that is perceived, whether he perceives all that is perceived or only part of it, regardless of the state of the preparedness of the perceived. Thus, the sight of the perceiver is necessarily the Ipseity of The Real.\n\nAnd similarly, all the faculties (القوي) attributed to these instruments are nothing other than the Ipseity of The Real, since the contrary is impossible.\n\nThus, the instruments and their locus are the rulings (أحكام) of the Fixed Entities (أعيان الممكنات) within the very essence of True Existence (الوجود الحق). He is to them like the spirit (الروح) is to the form: nothing maintains that order upon the form except Him, and that form perceives nothing except through Him, whether sensually or imaginatively (حسا وخيالا).\n\nAnd everything, praise be to Allah, is Imagination (خيال) in the reality of the matter (نفس الأمر), because it does not remain constantly fixed upon a single state. People are asleep, and everything the sleeper sees, he knows what he sees and in which Presence (حضرة) he sees it. When they die, they awaken from this sleep *within* the sleep, yet they have not ceased to be asleep. They have not ceased to be in a vision (رؤيا). They have not ceased to experience this variation within themselves, nor has the variation they perceive in their entities ceased. The matter has always been thus, and the matter in the life of this world and the Hereafter will remain thus, just as we have presented and mentioned. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## «باب نمبر چار سو چودہ: اس معرفت میں کہ تم جو کچھ دیکھتے ہو وہ حجاب کے بغیر نہیں دیکھتے»\n\n> جس نے ذات حق (الحق) کو کھلے عام، ظاہر میں دیکھا\n>\n> اس نے اسے صرف ایک حجاب کے پیچھے سے ہی دیکھا۔\n>\n> اور وہ اسے نہیں پہچانتا حالانکہ وہ اس کے ساتھ ہے\n>\n> بے شک یہ ایک عجیب معاملہ ہے۔\n>\n> ہر دیکھنے والا اس کے سوا کچھ نہیں دیکھتا\n>\n> جس میں وہ نعمت یا عذاب میں ہے۔\n>\n> دیکھنے والے کی صورت اس کے سامنے جلوہ گر ہوئی\n>\n> اور وہ دیکھنے والے کی عین ذات ہے، بلکہ عین حجاب ہے۔\n\n### [ذات حق تعالیٰ کا صورتوں میں تجلی (التجلی) فرمانا اور ان میں تبدیل ہونا]\n\nصحیح احادیث میں وارد ہے کہ ذات حق (الحق) کا صورتوں میں تجلی (التجلی) فرمانا اور ان میں تبدیل ہونا، اور یہی ہماری مراد حجاب سے ہے۔ یہ بات عقل، شریعت اور کشف (الکشف) سے ثابت ہے۔ کشف (الکشف) وہی کچھ دیتا ہے جو شریعت دیتی ہے، اور یہ بھی کہ ذات حق (الحق) تبدیلی کو قبول نہیں کرتی۔\n\nجہاں تک عقل کا تعلق ہے، اس کے دلائل معروف ہیں، لیکن یہ کتاب ان کے بیان کی جگہ نہیں ہے، کیونکہ یہ شریعت اور کشف (الکشف) و شہود (الشہود) کے عطیات پر مبنی ہے۔ عقلیں اس امر کے ادراک سے قاصر ہیں جس کی گواہی شریعت ذات حق (الحق) کے بارے میں دیتی ہے۔\n\nاور جہاں تک شریعت کا تعلق ہے، تو اللہ تعالیٰ کا فرمان ہے: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس جیسی کوئی چیز نہیں ہے)۔ اگر وہ اپنی ذات میں تبدیل ہو جائے تو یہ حکم سچا نہ رہے، حالانکہ یہ سچا ہے۔ لہٰذا، اس کا اپنی ذات میں تبدیل ہونا محال ہے۔ اور ذات حق (الحق) فرماتی ہے کہ اللہ نے اپنے بندے کی زبان سے کہا: \"سمع الله لمن حمده\" (اللہ نے اس کی سن لی جس نے اس کی تعریف کی) اور فرمایا: \"میں اس کا کان اور اس کی آنکھ بن جاتا ہوں۔\"\n\nپس وہ صورتیں جن پر نگاہیں پڑتی ہیں، اور وہ صورتیں جنہیں عقلیں ادراک کرتی ہیں، اور وہ صورتیں جنہیں قوت متخیلہ مجسم کرتی ہے، یہ سب حجاب ہیں جن کے پیچھے سے ذات حق (الحق) کو دیکھا جاتا ہے۔ اور ان صورتوں سے جو اعمال صادر ہوتے ہیں، ان کی نسبت اللہ تعالیٰ کی طرف کی جاتی ہے، جیسا کہ فرمایا: وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا)۔\n\nذات حق (الحق) ان صورتوں میں جو وجود (الوجود) میں ظاہر ہوئیں، ہمیشہ غیب رہی ہے۔ اور ممکنات کی حقیقتیں (أعيان الممكنات) اپنی ثبوتی شیئیت میں، اپنے احوال کے تنوعات کے ساتھ، ذات حق (الحق) کے لیے بھی غیب ہیں۔ اور وجود (الوجود) میں ظاہر ہونے والی ان صورتوں کی حقیقتیں، جو عین ذات حق (الحق) ہیں، ممکنات کی حقیقتوں کے احکام ہیں، اس لحاظ سے کہ وہ اپنے ثبوت میں جن احوال، تنوع، تبدیلی اور تبدل پر ہیں، وہ ان مشہود صورتوں میں عین وجود حق میں ظاہر ہوتے ہیں۔\n\nاور ذات حق (الحق) اس سے تبدیل نہیں ہوئی جس پر وہ اپنی ذات میں ہے، جس طرح ہباء (ذرہ) اپنی ہبائیت سے تبدیل نہیں ہوا، باوجود اس کے کہ وہ تمام صورتوں کو قبول کرتا ہے۔ پس وہ صورتیں اس کے جوہر میں معانی ہیں، اور وہ معانی جو ان صورتوں، اعراض اور صفات کی طرف منسوب ہیں، وہ معنی کا معنی کے ساتھ قائم ہونے کے باب سے ہیں۔\n\nپس حجاب ہمیشہ پڑے رہتے ہیں، اور وہ ان صورتوں کی حقیقتیں ہیں۔ لہٰذا، اسے صرف حجاب کے پیچھے سے ہی دیکھا جاتا ہے، جس طرح اس سے صرف حجاب کے پیچھے سے ہی کلام کیا جاتا ہے۔\n\nجب دیکھنے والا اسے بالمشافہ (کفاحاً) دیکھتا ہے، تو وہ اسے نہیں دیکھتا مگر اس وقت جب ذات حق (الحق) اس کی بصارت بن جاتی ہے۔ پس وہ خود دیکھنے والا ہوتا ہے اپنی بصارت کے ساتھ اپنے بندے کی صورت میں۔ پس اس صورت نے اسے بالمشافہ (المکافحۃ) عطا کیا، کیونکہ وہ بصارت اور تمام قوتوں کو اٹھانے والی تھی۔ پس وہ اسے صورت میں عین اسم الظاہر سے دیکھتا ہے، کیونکہ وہ تیری بصارت ہے اور بالمشافہ ہے۔ اور وہ اسے اسم الباطن سے علم کے طور پر دیکھتا ہے، کیونکہ وہ تیری اس آلے کی بصارت ہے جس کے ذریعے تو نے ادراک کیا۔\n\nاور ہم نے \"بالمشافہ\" (کفاحاً) اس لیے کہا کہ یہ نبی اکرم صلی اللہ علیہ وسلم کی اس حدیث میں وارد ہوا ہے جسے ترمذی اور دیگر نے اسی لفظ کے سیاق میں روایت کیا ہے۔\n\nپھر خواب دیکھنے والا جب اپنے رب تعالیٰ کو اپنے خواب میں بالمشافہ (کفاحاً) دیکھتا ہے، تو وہ اسے جس صورت میں بھی دیکھے، وہ کہتا ہے کہ میں نے اپنے رب کو فلاں فلاں صورت میں دیکھا، اور وہ سچا ہوتا ہے۔ اور یہ اس کے قول لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس جیسی کوئی چیز نہیں ہے) کے ساتھ سچا ہوتا ہے، کیونکہ اس نے اپنی ذات کے لیے تمام صورتوں میں تجلی (التجلی) قبول کرنے میں مماثلت کی نفی کی ہے، جن کی کوئی انتہا نہیں ہے۔\n\nکیونکہ اس کے سوا ہر وہ ہستی جسے صورتوں میں تجلی (التجلی) حاصل ہے، وہ ان میں سے کسی میں بھی اپنی ذات کے لیے تجلی نہیں کرتی، بلکہ وہ ان میں اپنے خالق کی مشیئت اور تکوین سے تجلی کرتی ہے۔ پس وہ اس صورت سے کہتا ہے جس میں وہ تجلی کرتا ہے، جس کی یہ صفت ہے: \"ہو جا\"، تو وہ صورت ہو جاتی ہے۔ پس اس کے ذریعے وہ ظاہر ہوتا ہے جسے مخلوقات میں سے یہ قبولیت حاصل ہے، جیسے ارواح اور انسانوں میں سے روحانیت والے، جیسے قضيب البان (ایک خاص پودا) اور اس جیسے دیگر۔\n\nاللہ تعالیٰ فرماتا ہے: فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ (جس صورت میں چاہا تجھے جوڑ دیا)۔ پس اس نے اسے ایک ایسے مزاج پر برابر اور معتدل کیا جو ہر صورت کو قبول کرتا ہے جب ذات حق (الحق) چاہتی ہے۔ اور ترکیب کو اللہ کے لیے قرار دیا، نہ کہ اس کے لیے۔ اور صورتوں کی نسبت اللہ کی طرف کرنے میں کہا جاتا ہے کہ وہ جس صورت میں چاہے ظاہر ہو، بغیر کسی بنانے والے کے بنانے کے۔ پس یہ معاملہ تجھ پر مشتبہ نہ ہو۔\n\nاور جب اس (اللہ تعالیٰ) کا اپنے مخلوق کے سامنے ظہور صرف صورت میں ہوتا ہے، اور اس کی صورتیں ہر تجلی (التجلی) میں مختلف ہوتی ہیں، اور کوئی صورت دہرائی نہیں جاتی، کیونکہ وہ سبحانہ ایک صورت میں دو بار تجلی نہیں کرتا، اور نہ ہی ایک صورت میں دو اشخاص کے لیے۔\n\nاور جب معاملہ ایسا ہے، تو عقل اور آنکھ کے لیے یہ منضبط نہیں ہو سکتا کہ حقیقت کیا ہے۔ اور عقل کے لیے ممکن نہیں کہ وہ اسے ان صورتوں میں سے کسی ایک صورت کے ساتھ مقید کر سکے، کیونکہ یہ تقیید دوسرے تجلی (التجلی) میں دوسری صورت کے ذریعے ٹوٹ جائے گی۔ اور وہ ان سب میں اللہ ہی ہے، اس میں کوئی شک یا شبہ نہیں، سوائے اس کے کہ جب وہ اس کے سامنے اس کے عقیدے کے خلاف صورت میں تجلی کرے، تو وہ اس سے پناہ مانگتا ہے، جیسا کہ صحیح احادیث میں وارد ہے۔\n\nپس وہ جانتا ہے کہ نفس الامر میں ایک حقیقت (عین) ہے جو ان مختلف صورتوں میں ظہور کو قبول کرتی ہے، جس کی کوئی ماہیت (ماہیۃ) یا کیفیت (کیفیۃ) بالکل معلوم نہیں۔ اور اگر کیفیت کا حکم دینا ضروری ہو، تو وہ کہتا ہے کہ کیفیت ان صورتوں میں اس کا ظہور ہے جنہیں وہ چاہتا ہے۔ پس صورتیں مشیئت کے تحت ہیں، اور ہر مشیئت کے تحت آنے والی چیز بلاشبہ معدوم ہے۔ پس تیرے سامنے صرف ایک حادث (نئی چیز) ظاہر ہوئی ہے جو ایک قدیم (ازلی) حقیقت (عین) میں ہے۔ پس تو نے صرف ایک حادث کو دیکھا ہے جو تیری طرح ہے، کیونکہ تو نے صرف ایک صورت کو دیکھا ہے جسے تیری نظر ایک ایسی بصارت کے ذریعے مقید کرتی ہے جو عین حق ہے، یعنی اس حقیقت (عین) میں جو اس صورت میں ظاہر ہوئی۔\n\nپس وہ آخرت اور نیند میں عیناً مدرک ہے، اور علم اور شریعت کے ذریعے مدرک ہے، اور علم کے ذریعے غیر مدرک ہے۔ اور ہم ایمان، کشف (الکشف) اور عقل کے ذریعے شک نہیں کرتے کہ مدرک نے جو کچھ بھی ادراک کیا، وہ اس کی ہویت (ہویۃ) کے ذریعے ادراک کیا، خواہ اس نے تمام مدرکات کا ادراک کیا ہو یا ان میں سے بعض کا، مدرک (اسم مفعول) کی استعداد جس بھی حالت میں ہو۔ پس بصارت مدرک (اسم فاعل) کی ہویت حق سے ہے، یہ ضروری ہے۔ اور اسی طرح وہ تمام قوتیں جو ان آلات کی طرف منسوب ہیں، وہ ذات حق (الحق) کی ہویت کے سوا کچھ نہیں ہیں، کیونکہ اس کے خلاف محال ہے۔\n\nپس آلات اور ان کا محل، عین وجود حق میں ممکنات کی حقیقتوں کے احکام ہیں، اور وہ ان کے لیے روح کی مانند ہے اس صورت کے لیے جسے وہ نظام اس کے سوا کوئی نہیں تھام سکتا۔ اور وہ صورت اس کے بغیر حسی یا خیالی طور پر کسی چیز کا ادراک نہیں کر سکتی۔ اور سب کچھ، اللہ کی حمد کے ساتھ، نفس الامر میں خیال ہے، کیونکہ وہ ہمیشہ ایک حالت پر قائم نہیں رہتے۔\n\nاور لوگ سوئے ہوئے ہیں، اور ہر وہ چیز جو سونے والا دیکھتا ہے، وہ جانتا ہے کہ وہ کیا دیکھتا ہے اور کس \"حضرة\" (حضور) میں دیکھتا ہے۔ پس جب وہ مریں گے، تو وہ اس نیند میں سے بیدار ہوں گے، لیکن وہ نیند میں ہی رہیں گے۔ پس وہ رؤیا (خواب) میں ہی رہیں گے۔ پس وہ اپنے اندر اس تنوع میں ہی رہیں گے، اور جو کچھ وہ ادراک کرتے ہیں وہ ان کی حقیقتوں میں تنوع میں ہی رہے گا۔ پس معاملہ ہمیشہ سے ایسا ہی رہا ہے اور دنیا کی زندگی اور آخرت میں بھی ایسا ہی رہے گا جیسا کہ ہم نے بیان کیا اور ذکر کیا۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب چهارصد و چهاردهم در معرفت منزلتی که در آن جز از پس حجاب نمی‌بینی»\n\nآن کس که حق (الحق) را آشکارا و علنی دید،\nجز از پس حجاب او را مشاهده نکرد.\nاو حق را نمی‌شناسد، در حالی که حق با اوست؛\nبه راستی که این همان امر شگفت‌انگیز است.\nهر بیننده‌ای جز آنچه در آن است، نمی‌بیند،\nچه از نعمت باشد و چه از عذاب.\nصورت بیننده نزد او تجلی (التجلی) یافت،\nو آن صورت، عین بیننده، بلکه عین حجاب است.\n\n### [تجلی الحق تعالی در صور و تحول او در آنها]\n\nدر حدیث صحیح آمده است که حق (الحق) در صور تجلی (التجلی) می‌یابد و در آنها متحول می‌شود، و این همان مراد ما از حجاب است. این امر عقلاً، شرعاً و کشفاً (الکشف) ثابت شده است، و کشف (الکشف) همان چیزی را می‌دهد که شرع می‌دهد. حق (الحق) تغییر را نمی‌پذیرد. اما از نظر عقلی، دلایل آن شناخته شده است و این کتاب جایگاه ذکر آنها نیست، زیرا این کتاب بر مبنای شرع و آنچه کشف (الکشف) و شهود (الشهود) می‌دهد، بنا شده است. زیرا عقول از درک امر آن‌گونه که شرع در حق او شهادت می‌دهد، قاصرند. و اما شرع، سخن اوست: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی همانند او نیست). پس اگر در ذات خود تغییر می‌کرد، این حکم صادق نبود، در حالی که این حکم صادق است؛ بنابراین محال است که در ذات خود تغییر کند. و حق (الحق) می‌فرماید که خداوند بر زبان بنده‌اش فرمود: «خداوند شنید کسی را که او را ستایش کرد» و فرمود: «من گوش و چشم او بودم.»\n\nپس، صور (الصور)ی که دیدگان بر آنها می‌افتند، و صور (الصور)ی که عقول آنها را درک می‌کنند، و صور (الصور)ی که قوه متخیله آنها را تمثل می‌بخشد، همگی حجاب‌هایی هستند که حق (الحق) از ورای آنها دیده می‌شود. و آنچه از اعمال از این صور (الصور) صادر می‌شود، به خداوند تعالی نسبت داده می‌شود، چنانکه فرمود: **وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ** (و خداوند شما و آنچه را که عمل می‌کنید، آفریده است). حق (الحق) پیوسته غیب بوده است در آنچه از صور (الصور) در هستی (الوجود) ظاهر شده است. و اعیان (الأعيان) ممکنات (الممکنات) در شیئیت ثبوتشان، با تنوعات احوالشان، نیز غیباً برای حق (الحق) مشهودند. و اعیان (الأعيان) این صور (الصور) ظاهر شده در هستی (الوجود) که عین حق (الحق) است، احکام اعیان (الأعيان) ممکنات (الممکنات) هستند از آن حیث که در ثبوت خود دارای احوال، تنوع، تغییر و تبدیل هستند؛ این احکام در این صور (الصور) مشهود در عین هستی (الوجود) حق (الحق) ظاهر می‌شوند. و حق (الحق) از آنچه در نفس خود بر آن است، تغییر نکرده است، همان‌گونه که هباء (ذرات معلق در هوا) با وجود پذیرش همه صور (الصور)، از هباء بودن خود تغییر نکرده است؛ پس آنها معانی در جوهر او هستند. و معانی منسوب به آن صور (الصور)، اعراض و صفات، از باب قیام معنی به معنی است. پس حجاب‌ها پیوسته آویخته‌اند و آنها همان اعیان (الأعيان) این صور (الصور) هستند. بنابراین، جز از پس حجاب دیده نمی‌شود، همان‌گونه که جز از پس حجاب سخن گفته نمی‌شود. پس اگر بیننده او را رو در رو (کفاحاً) ببیند، او را نمی‌بیند مگر آنکه حق (الحق) چشم او باشد؛ در این صورت، او خود بیننده است با چشم خود در صورت بنده‌اش. پس آن صورت، مکافحه (رو در رویی) را به او بخشید، زیرا حامل بصر و همه قوا بود. پس او را در صورت، عیناً از اسم ظاهر مشاهده می‌کنی، زیرا او چشم توست و رو در رو (کفاحاً) است؛ و او را از اسم باطن، علماً مشاهده می‌کنی، زیرا او چشم ابزار توست که با آن آنچه را درک کردی، درک نمودی. و ما از این جهت «رو در رو» (کفاحاً) گفتیم که در خبر نبوی که ترمذی و دیگران آن را در سیاق همین لفظ نقل کرده‌اند، وارد شده است.\n\nسپس، صاحب رؤیا هنگامی که پروردگارش را رو در رو (کفاحاً) در خواب می‌بیند، در هر صورتی که او را ببیند، می‌گوید: «پروردگارم را در صورت فلان و فلان دیدم» و راست می‌گوید. و این امر با قول خداوند متعال که **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی همانند او نیست) صادق است؛ زیرا او مماثلت را از خود نفی کرده است در پذیرش تجلی (التجلی) در همه صور (الصور) بی‌نهایت برای نفس خود. زیرا هر کس غیر از او تعالی که تجلی (التجلی) در صور (الصور) دارد، برای نفس خود در هیچ یک از آنها تجلی (التجلی) نمی‌یابد، بلکه به مشیت خالق و تکوین او در آنها تجلی (التجلی) می‌یابد. پس به صورتی که این صفت را دارد و در آن تجلی (التجلی) می‌یابد، می‌گوید: «باش»، پس آن صورت موجود می‌شود. و با آن، کسی که این پذیرش را دارد از مخلوقات، مانند ارواح و کسانی از انسان‌ها که روحانی شده‌اند، مانند شاخه درخت بان و امثال آن، ظاهر می‌شود. خداوند متعال می‌فرماید: **فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ** (در هر صورتی که خواست تو را ترکیب کرد). پس او را بر مزاجی تسویه و تعدیل کرد که هر صورتی را می‌پذیرد، هرگاه حق (الحق) بخواهد، و ترکیب را برای خدا قرار داد نه برای او. و در نسبت دادن صور (الصور) به خداوند گفته می‌شود: در هر صورتی که خواست، بدون جعل جاعل (قرار دهنده)، ظاهر شد. پس امر بر تو در این باره مشتبه نشود. و چون برای او تعالی ظهوری به سوی خلقش جز در صورتی نبوده است، و صور (الصور) او در هر تجلی (التجلی) متفاوت است و صورتی تکرار نمی‌شود، زیرا او سبحانه در یک صورت دو بار تجلی (التجلی) نمی‌کند و در یک صورت برای دو شخص تجلی (التجلی) نمی‌کند. و چون امر چنین است، آنچه امر بر آن است، برای عقل و چشم قابل ضبط نیست، و عقل نمی‌تواند او را به صورتی خاص از آن صور (الصور) مقید کند، زیرا آن تقیید در تجلی (التجلی) بعدی با صورت دیگر نقض می‌شود. و او در همه اینها خداست، و کسی شک و تردید نمی‌کند، مگر زمانی که در غیر معتقد او تجلی (التجلی) کند، که در این صورت از آن پناه می‌جوید، چنانکه در اخبار صحیح وارد شده است. پس می‌داند که در نفس الأمر، عین (العین)ی وجود دارد که پذیرای ظهور در این صور (الصور) مختلف است و اصلاً ماهیت و کیفیتی برای آن شناخته نیست. و اگر ناچار به حکم کردن به کیفیتی باشد، می‌گوید: کیفیت آن، ظهورش در هر صورتی است که بخواهد. پس صور (الصور) مورد مشیت هستند، و هر مشاء (مورد مشیت) بدون شک معدوم است. پس برای تو جز حادثی در عین قدیم ظاهر نشده است. پس تو جز حادثی مانند خودت ندیده‌ای، زیرا تو جز صورتی ندیده‌ای که نگاه تو آن را با چشمی که حق (الحق) است، در عینی که حق (الحق) است، مقید می‌کند؛ منظورم در عینی است که در آن صورت ظاهر شده است. پس او عیناً در آخرت و خواب، و علماً و شرعاً درک می‌شود، و علماً درک نمی‌شود. و ما ایماناً و کشفاً (الکشف) شک نداریم، نه عقلاً، که مُدرِک (درک کننده) با هویت او، همه آنچه را که درک می‌کند، درک کرده است، چه همه آنچه را که درک می‌کند، درک کرده باشد یا بخشی از آن را، در هر حالتی که استعداد مُدرَک (اسم مفعول) باشد. پس بصر از مُدرِک (اسم فاعل) هویت حق (الحق) است، و این ضروری است. و همچنین همه آنچه به این آلات از قوا نسبت داده می‌شود، چیزی جز هویت حق (الحق) نیست، زیرا خلاف آن محال است. پس آلات و محل آنها، احکام اعیان (الأعيان) ممکنات (الممکنات) در عین هستی (الوجود) حق (الحق) هستند، و او برای آنها مانند روح است برای صورتی که آن نظام را جز او حفظ نمی‌کند، و آن صورت چیزی را جز به واسطه او درک نمی‌کند، چه حسی و چه خیالی. و به حمدالله، همه در نفس الأمر خیال است، زیرا ثبات دائمی بر یک حال ندارند. و مردم در خوابند، و هر آنچه را که شخص خوابیده می‌بیند، می‌داند چه می‌بیند و در کدام حضرت می‌بیند. پس هنگامی که بمیرند، از این خواب در خواب بیدار می‌شوند، اما همچنان در خوابند، و همچنان در رؤیا هستند، و همچنان در نفوس خود از این تنوع هستند، و آنچه در اعیان (الأعيان) خود درک می‌کنند، همچنان از تنوع است. پس امر پیوسته چنین بوده و در زندگی دنیا و آخرت نیز چنین خواهد بود، همان‌گونه که آوردیم و ذکر کردیم. **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}