{
  "id": 435,
  "title": {
    "ar": "الباب الخامس والثلاثون وأربعمائة في معرفة منازلة أخذت العهد على نفسي فوقتا وفيت ووقتا على يد عبدي لم أف وينسب عدم الوفاء إلى عبدي فلا تعترض فإني هناك",
    "en": "Chapter 435: Concerning the Gnosis of a Spiritual Station (منازلة) regarding which I took the Covenant upon Myself: at one time I fulfilled it, and at another time, through the hand of My servant, I did not fulfill it. The non-fulfillment is attributed to My servant, so do not object, for I am the one present there.",
    "ur": "باب چار سو پینتیس: ایک روحانی مقام کی معرفت (المعرفۃ) کے بیان میں جس میں میں نے اپنے اوپر ایک عہد لیا، تو ایک وقت میں میں نے اسے پورا کیا اور ایک وقت میں اپنے بندے کے ہاتھ سے پورا نہ کیا، اور عدمِ وفا میرے بندے کی طرف منسوب کی جاتی ہے، پس اعتراض نہ کرنا کیونکہ میں وہاں موجود ہوں۔",
    "fa": "باب چهارصد و سی و پنجم در معرفت منزلتی که عهد را بر خود گرفتم، پس گاهی وفا کردم و گاهی به دست بنده‌ام وفا نکردم، و عدم وفا به بنده‌ام نسبت داده می‌شود؛ پس اعتراض مکن، زیرا من آنجا هستم."
  },
  "content": {
    "ar": "## «الباب الخامس والثلاثون وأربعمائة في معرفة منازلة أخذت العهد على نفسي فوقتا وفيت ووقتا على يد عبدي لم أف وينسب عدم الوفاء إلى عبدي فلا تعترض فإني هناك»\n\n\n> وعدنا وأوعدنا فأما وعيدنا *** فاتركه إن شئت والوعد ناجز\n\n\n> فإني كريم والكريم نعوته *** كما قد ذكرنا والقضاء يناجز\n\n\n> فإن هم إنفاذ الوعيد لصدقه *** تلقاه قرم للسماح مبارز\n\n\n> فيردعه عن همه بنفوذه *** لأن له الرحى فمنها يبارز\n\n\n> وليس يرى الإنفاذ إلا مقصر *** جهول بما قلنا عن الحق عاجز\n\n\n### [الوعد والوعيد]\n\n\nقال الله تعالى إن الله لا يضيع (إِنَّا لا نُضِيعُ) أَجْرَ من أَحْسَنَ عَمَلًا هذا في الوعد وقال في الوعيد فَيَغْفِرُ لِمَنْ يَشاءُ ويُعَذِّبُ من يَشاءُ فاعلم إن هذه المنازلة هي قوله إن رحمتي تغلب غضبي وهي قوله وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله فإذا وعد العبد وعدا وشاء الله أن يخلف ذلك العبد وعده وما عاهد عليه شاء من العبد أن يشاء نقض العهد ولو لا ذلك ما تمكن للمخلوق أن يشاء فشاء العبد عند ذلك نقض العهد وإخلاف الوعد بمشيئة الله في خلق مشيئة العبد فهوقوله ووقتا لم أف‏\n\n\nفلا تعترض على العبد فإنه مجبور في اختياره بمشيئتي ولكن ينبغي لصاحب هذه المنازلة إذا رأى من وقع منه مثل هذا أن ينظر إلى خطاب الشرع فيه فإن رأى أن ذلك المحل الظاهر منه مثل هذا من نقض العهد وإخلاف الوعد قد أطلق الحق عليه لسان الذم فيذمه بذم الحق فيكون حاكيا ولا يذمه بنفسه هذا هو الأدب وليس ذلك إلا في الخير كما يقيم‏\nالحدود على المتعدي بأمر الحق لا بنفسه ولهذا ليس للعبد أن يوقت حدا ولا يشرعه وأما في الوعيد إذا لم يكن حدا مشروعا وكان لك الخيار فيه وعلمت إن تركه خير من فعله عند الله فلك أن لا تفي به وأن تتصف بالخلف فيه مثل‏\n\n\nقوله من حلف على يمين فرأى خيرا منها فليكفر عن يمينه‏\n\n\nوليأت الذي هو خير قال تعالى ولا يَأْتَلِ أُولُوا الْفَضْلِ مِنْكُمْ والسَّعَةِ أَنْ يُؤْتُوا قال الشاعر\n\n\n> وإني إذا أوعدته أو وعدته *** لمخلف إيعادى ومنجز موعدي‏\n\n\nوإنما عوقب بالكفارة لأنه أمر بمكارم الأخلاق واليمين على ترك فعل الخير من مذام الأخلاق فعوقب بالكفارة وهو عندنا على غير الوجه الذي هو عند العامة من الفقهاء فإن الله قد جعل لنا عينا ننظره به وهو أن المسي‏ء في حقنا الذي خيرنا الله بين جزائه بما أساء وبين العفو عنه أنه لما أساء إلينا أعطانا من خير الآخرة ما نحن محتاجون إليه حتى لو كشف الله الغطاء بيننا وبين ما لنا من الخير في الآخرة في تلك المساءة حتى نراه عيانا لقلنا إنه ما أحسن أحد في حقنا ما أحسن هذا الذي قلنا عنه إنه أساء في حقنا فلا يكون جزاؤه عندنا الحرمان فنعفو عنه فلا نجازيه ونحسن إليه مما عندنا من الفضل على قدر ما تسمح به نفوسنا فإنه ليس في وسعنا ولا يملك مخلوق في الدنيا ما يجازى به من الخير من أساء إليه ولا يجد ذلك الخير ممن أحسن إليه في الدنيا ومن كان هذا عقده ونظره كيف يجازي المسي‏ء بالسيئة إذا كان مخيرا فيها فلما آلى وحلف من أسي‏ء إليه فما وفى المسي‏ء حقه وإن لم يقصد المسي‏ء إيصال ذلك الخير إليه ولكن الايمان قصده فينبغي له أن يدعو له إن كان مشركا بالإسلام وإن كان مؤمنا بالتوبة والصلاح ولو لم يكن ثم إخبار من الله بالخير الأخروي لمن أسي‏ء إليه إذا صبر ولم يجاز لكان المقرر في العرف بين الناس كافيا فيما في التجاوز والعفو والصفح عن المسي‏ء فإن ذلك من مكارم الأخلاق ولو لا إساءة هذا المسي‏ء إلى ما اتصفت أنا ولا ظهرت مني هذه المكارم من الأخلاق كما أني لو عاقبته انتفت عني هذه الصفات في حقه وكنت إلى الذم أقرب مني إلى أن أحمد على العقاب فكيف والشرع قد جاء في ذلك بأن أجر من يعفو ويتجاوز ولا يجازي أنه على الله فقد علمت إن‏\n\n\nقوله وقتا وفيت ووقتا لم أف‏\n\n\nإن ذلك راجع للوعد والوعيد بوجه وراجع لما في خلق الله من الوفاء وعدم الوفاء من كونهم ما فعلوا الذي فعلوه إلا بمشيئة الله فهو بالأصالة إليه ولهذا قال فلا تعترض إلا أن يكون الحق هو المعترض بأمره إياك أن تعترض فاعترض فإنه لا فرق عند ذلك بين أن تعترض أو تقيم الحد إذا كنت من أولي الأمر فيمن عين لك أن تقيمه حتى لو تركته لكنت عاصيا مخالفا أمر الله فالمؤمن العالم المستبرئ لنفسه لا يفوته أمثال هذه المشاهد والمواقف فإنه لا يزال باحثا عن مكارم الأخلاق حتى يتصف بها ويقوم فيها قيام الأدباء الأمناء ويراعون الشريعة في ذلك فرب مكرمة عرفا لا تكون مكرمة شرعا فلا تجعل أستاذك إلا الحق المشروع فإذا أمرك فامتثل أمره وإذا نهاك فانته عما نهاك وإذا خيرك فاعمل الأحب إليه والأرجح والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Thirty-Five concerning the Gnosis of a Spiritual Station (منزلة) where I took a covenant upon Myself, and at one time I fulfilled it, and at another time, through My servant, I did not fulfill it. The lack of fulfillment is attributed to My servant, so do not object, for I am there.\n\nWe have promised and We have threatened, but Our threat,\nleave it if you wish, while the promise is executed.\n\nFor I am Generous (Karīm), and Generosity is My attribute,\nas We have mentioned, and the Decree is executed.\n\nIf the concern is the execution of the threat merely for its truthfulness,\nyou will find Him a champion challenging for forgiveness.\n\nSo He restrains it from its intent by His pervasive power,\nbecause the center (al-Rahā) belongs to Him, and from it He challenges.\n\nAnd none sees the necessity of execution except one who is deficient,\nignorant of what We have said, incapable concerning the Real (al-Haqq).\n\n### [The Promise and the Threat]\n\nAllah the Exalted said concerning the Promise: <<إِنَّا لا نُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا>> (Indeed, We do not allow to be lost the reward of those who do good deeds). And He said concerning the Threat: <<فَيَغْفِرُ لِمَنْ يَشاءُ ويُعَذِّبُ مَنْ يَشاءُ>> (Then He forgives whom He wills and punishes whom He wills).\n\nKnow that this spiritual station (manzila) is His saying: \"My Mercy prevails over My Wrath.\" And it is His saying: <<وَمَا تَشَاؤُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ>> (And you do not will except that Allah wills). So, if the servant makes a promise, and Allah wills that this servant should break his promise and the covenant he made, He wills from the servant that he should will the breaking of the covenant. Were it not for that, the creature would not be able to will. The servant then wills the breaking of the covenant and the failure to fulfill the promise, by the Will (mashī’a) of Allah in the creation of the servant's will. This is His saying: \"and at another time I did not fulfill.\"\n\nTherefore, do not object to the servant, for he is compelled (majbūr) in his choice (ikhtiyār) by My Will. However, it is incumbent upon the possessor of this spiritual station, when he sees someone from whom such an act occurs, to look at the address of the Law (Shar‘) concerning it. If he sees that the Real (al-Haqq) has loosed the tongue of blame upon that locus from which such a breaking of covenant and failure to fulfill a promise appears, then he blames him with the blame of the Real, thus acting as a narrator, and does not blame him by himself. This is the proper etiquette (adab). This applies only to good deeds, just as one establishes the legal punishments (hudūd) upon the transgressor by the command of the Real, not by himself. For this reason, the servant is not permitted to set a limit (hadd) or legislate it.\n\nAs for the Threat (al-Wa‘īd), if it is not a prescribed legal punishment and you have a choice concerning it, and you know that abandoning it is better than performing it in the sight of Allah, then you are permitted not to fulfill it and to be described by the failure to keep it, such as His saying: \"Whoever swears an oath and sees something better than it, let him expiate his oath and do that which is better.\" The Exalted said: <<وَلَا يَأْتَلِ أُولُو الْفَضْلِ مِنْكُمْ وَالسَّعَةِ أَنْ يُؤْتُوا>> (And let not those among you who are endowed with grace and amplitude swear not to give). The poet said:\n\nAnd indeed, when I threaten or promise him,\nI break my threat and fulfill my promise.\n\nHe was only punished with expiation (kaffāra) because he was commanded to noble character traits (makārim al-akhlāq), and swearing an oath to abandon a good deed is among the blameworthy character traits, so he was punished with expiation. This, in our view, is not understood in the same way as it is by the common jurists (fuqahā’). For Allah has granted us an eye through which we look at it: namely, that the one who wrongs us, concerning whom Allah gave us the choice between punishing him for his wrong or pardoning him—when he wronged us, he gave us of the goodness of the Hereafter that which we are in need of. So much so that if Allah were to lift the veil between us and the good that is ours in the Hereafter due to that wrongdoing, until we saw it clearly, we would say that no one has done us a greater favor than this person whom we said wronged us. Therefore, his recompense in our view cannot be deprivation. So we pardon him, we do not punish him, and we show kindness to him from the bounty (fadl) we possess, to the extent that our souls allow. For it is not within our capacity, nor does any creature in this world possess, the means to reward the one who wronged him with the goodness that he received, nor does he find that goodness from the one who was kind to him in this world. And whoever holds this belief and perspective, how could he punish the wrongdoer with evil when he has the choice not to? When the wronged person swore an oath (to punish), he did not fulfill the right of the wrongdoer, even if the wrongdoer did not intend to convey that goodness to him, but faith (al-īmān) intended it. Thus, it is incumbent upon him to pray for the wrongdoer: if he is a polytheist (mushrik), that he embrace Islam; and if he is a believer (mu’min), that he achieve repentance and righteousness. Even if there were no Divine notification of the otherworldly goodness for the one who was wronged, provided he was patient and did not retaliate, the established custom (‘urf) among people would suffice regarding overlooking, pardoning, and forgiving the wrongdoer, for that is among the noble character traits. Were it not for the wrongdoing of this wrongdoer toward me, I would not have been characterized by, nor would these noble character traits have manifested from me. Just as, if I were to punish him, these attributes would be negated from me concerning him, and I would be closer to blame than to being praised for the punishment. How much more so when the Law has come regarding this, stating that the reward of the one who pardons, overlooks, and does not retaliate is incumbent upon Allah?\n\nYou have thus known that His saying: \"at one time I fulfilled and at another time I did not fulfill,\" refers to the Promise and the Threat in one respect, and refers to the fulfillment and lack of fulfillment found in Allah's creation (khalq), based on the fact that they did not do what they did except by the Will of Allah. Thus, the origin of the act returns to Him. For this reason, He said: \"so do not object,\" unless the Real is the one objecting by commanding you to object, in which case you should object. For in that case, there is no difference between your objecting and your establishing the legal punishment, if you are among those in authority (ūlī al-amr) concerning the one designated for you to punish, such that if you abandoned it, you would be disobedient and violating the command of Allah.\n\nThe knowing believer (al-mu’min al-‘ālim) who seeks to clear himself does not miss such unveilings (mashāhid) and stations (mawāqif). For he constantly searches for noble character traits until he is characterized by them, and he stands firm in them with the standing of the trustworthy people of etiquette, observing the Sacred Law (Sharī‘a) in this regard. For many a noble deed recognized by custom is not a noble deed recognized by the Law. Therefore, do not take as your master (ustādh) anything but the Lawful Real (al-Haqq al-Mashrū‘). So, when He commands you, obey His command; when He forbids you, cease from what He forbids; and when He gives you a choice, do what is most beloved and most preferred by Him. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر ۴۳۵: اس منزل کی معرفت میں کہ میں نے اپنے اوپر ایک عہد لیا، تو ایک وقت میں میں نے اسے پورا کیا، اور ایک وقت میں اپنے بندے کے ہاتھ پر میں نے اسے پورا نہیں کیا۔ اور عدمِ وفا کو میرے بندے کی طرف منسوب کیا جاتا ہے، لہٰذا تم اعتراض نہ کرو، کیونکہ میں وہاں موجود ہوں۔\n\nہم نے وعدہ بھی کیا اور وعید بھی، لیکن اگر تم چاہو تو ہماری وعید کو چھوڑ دو، اور وعدہ تو پورا ہونے والا ہے۔\nکیونکہ میں کریم ہوں، اور کرم ہماری صفت ہے، جیسا کہ ہم نے ذکر کیا ہے، اور قضا (فیصلہ) مقابلہ کرتی ہے۔\nاگر وہ اپنی سچائی کی خاطر وعید کو نافذ کرنے کا ارادہ کرے، تو تم اسے سخاوت کے لیے میدان میں اترنے والا بہادر پاؤ گے۔\nپس وہ اپنے نفوذ کے ذریعے اپنے ارادے سے باز آ جاتا ہے، کیونکہ چکی (مرکز) اسی کے لیے ہے، اور وہیں سے وہ مقابلہ کرتا ہے۔\nاور وعید کے نفاذ کو صرف وہی شخص دیکھتا ہے جو کوتاہی کرنے والا، ہماری کہی ہوئی باتوں سے جاہل، اور (ذات) حق (الحق) سے عاجز ہو۔\n\n### [وعدہ اور وعید]\n\nاللہ تعالیٰ نے فرمایا: \"بیشک ہم ضائع نہیں کرتے (إِنَّا لَا نُضِيعُ) اجر اس شخص کا جس نے اچھا عمل کیا\"۔ یہ وعدے کے بارے میں ہے۔ اور وعید کے بارے میں فرمایا: \"پس وہ جسے چاہتا ہے بخش دیتا ہے اور جسے چاہتا ہے عذاب دیتا ہے\" (فَيَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ)۔ پس جان لو کہ یہ منزل اس کے اس قول پر مبنی ہے کہ \"میری رحمت میرے غضب پر غالب ہے\"، اور یہ اس کے اس قول پر بھی مبنی ہے کہ \"اور تم نہیں چاہتے مگر یہ کہ اللہ چاہے\" (وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ)۔\n\nپس جب بندہ کوئی وعدہ کرتا ہے اور اللہ یہ چاہتا ہے کہ وہ بندہ اپنے وعدے اور جس چیز کا اس نے عہد کیا ہے، اس کی خلاف ورزی کرے، تو وہ بندے سے یہ چاہتا ہے کہ وہ عہد توڑنے کا ارادہ کرے۔ اگر ایسا نہ ہوتا تو مخلوق کے لیے ارادہ کرنا ممکن نہ ہوتا۔ پس بندے نے اس وقت اللہ کی مشیئت (مشيئة) کے ذریعے، جو بندے کی مشیئت کو پیدا کرنے میں ہے، عہد توڑنے اور وعدہ خلافی کا ارادہ کیا۔ پس یہی اس کا قول ہے: \"اور ایک وقت میں میں نے پورا نہیں کیا\"۔\n\nلہٰذا بندے پر اعتراض نہ کرو، کیونکہ وہ میری مشیئت (مشيئتي) کے ذریعے اپنے اختیار میں مجبور ہے۔ لیکن اس منزل کے سالک کے لیے ضروری ہے کہ جب وہ کسی کو اس طرح کی عہد شکنی اور وعدہ خلافی کرتے ہوئے دیکھے تو وہ اس میں شریعت کے خطاب کو دیکھے۔ اگر وہ دیکھے کہ اس شخص پر، جس سے یہ عہد شکنی اور وعدہ خلافی ظاہر ہوئی ہے، ذات حق (الحق) نے مذمت کی زبان جاری کی ہے، تو وہ ذات حق (الحق) کی مذمت کے ساتھ اس کی مذمت کرے، پس وہ صرف نقل کرنے والا ہو، اور اپنی طرف سے اس کی مذمت نہ کرے۔ یہی ادب ہے۔ اور یہ صرف خیر کے معاملے میں ہے، جیسا کہ وہ ذات حق (الحق) کے حکم سے حد سے تجاوز کرنے والے پر حدود قائم کرتا ہے، نہ کہ اپنی طرف سے۔ اسی لیے بندے کو یہ حق نہیں کہ وہ کوئی حد مقرر کرے یا اسے مشروع کرے۔\n\nاور جہاں تک وعید کا تعلق ہے، اگر وہ کوئی مشروع حد نہ ہو اور اس میں تمہیں اختیار ہو، اور تم جانتے ہو کہ اللہ کے نزدیک اسے ترک کرنا اس کے فعل سے بہتر ہے، تو تمہیں اختیار ہے کہ تم اسے پورا نہ کرو اور اس میں وعدہ خلافی کی صفت اختیار کرو۔ جیسے اس کا قول: \"جس نے کسی قسم پر حلف اٹھایا، پھر اس نے اس سے بہتر چیز دیکھی، تو اسے چاہیے کہ اپنی قسم کا کفارہ دے اور وہ کام کرے جو بہتر ہے\"۔ اللہ تعالیٰ نے فرمایا: \"اور تم میں سے جو فضیلت اور وسعت والے ہیں وہ قسم نہ کھائیں کہ وہ دیں گے\" (وَلَا يَأْتَلِ أُولُو الْفَضْلِ مِنكُمْ وَالسَّعَةِ أَن يُؤْتُوا)۔ شاعر نے کہا:\n\nاور میں جب کسی کو وعید کرتا ہوں یا وعدہ کرتا ہوں، تو میں اپنی وعید کی خلاف ورزی کرنے والا اور اپنے وعدے کو پورا کرنے والا ہوتا ہوں۔\n\nاور کفارے کی سزا اس لیے دی گئی کہ اسے اخلاقِ حسنہ کا حکم دیا گیا تھا، اور خیر کے فعل کو ترک کرنے کی قسم کھانا اخلاقِ مذمومہ میں سے ہے۔ پس اسے کفارے کی سزا دی گئی۔ اور یہ ہمارے نزدیک اس طریقے پر نہیں ہے جو عام فقہاء کے نزدیک ہے۔ کیونکہ اللہ نے ہمارے لیے ایک ایسی آنکھ بنا دی ہے جس سے ہم اسے دیکھتے ہیں، اور وہ یہ ہے کہ جس شخص نے ہمارے حق میں برائی کی، اور اللہ نے ہمیں اختیار دیا کہ ہم اسے اس کی برائی کا بدلہ دیں یا اسے معاف کر دیں، تو جب اس نے ہمارے ساتھ برائی کی، تو اس نے ہمیں آخرت کی وہ بھلائی عطا کی جس کے ہم محتاج ہیں۔ یہاں تک کہ اگر اللہ ہمارے اور اس بھلائی کے درمیان سے پردہ ہٹا دے جو ہمیں اس برائی کے بدلے میں آخرت میں ملے گی، یہاں تک کہ ہم اسے آنکھوں سے دیکھ لیں، تو ہم کہیں گے کہ کسی نے بھی ہمارے حق میں اتنی بھلائی نہیں کی جتنی اس شخص نے کی جس کے بارے میں ہم نے کہا کہ اس نے ہمارے حق میں برائی کی۔ لہٰذا ہمارے نزدیک اس کی جزا محرومی نہیں ہو سکتی۔ پس ہم اسے معاف کر دیتے ہیں اور اسے بدلہ نہیں دیتے، اور اپنے فضل سے اس کے ساتھ احسان کرتے ہیں جس قدر ہماری جانیں اجازت دیتی ہیں۔ کیونکہ ہمارے بس میں نہیں ہے، اور دنیا میں کوئی مخلوق اس خیر کی مالک نہیں ہے جس کے ذریعے وہ اس شخص کو بدلہ دے جس نے اس کے ساتھ برائی کی، اور نہ ہی وہ اس خیر کو دنیا میں اس شخص سے پاتا ہے جس نے اس کے ساتھ احسان کیا۔\n\nاور جس شخص کا یہ عقیدہ اور نظریہ ہو، وہ برائی کرنے والے کو برائی کا بدلہ کیسے دے گا جبکہ اسے اس میں اختیار دیا گیا ہے؟ پس جب اس شخص نے قسم کھائی جس کے ساتھ برائی کی گئی تھی، تو اس نے برائی کرنے والے کا حق پورا نہیں کیا، اگرچہ برائی کرنے والے نے اس خیر کو اس تک پہنچانے کا ارادہ نہیں کیا تھا، لیکن ایمان نے اس کا ارادہ کیا۔ لہٰذا اسے چاہیے کہ اگر وہ مشرک ہے تو اس کے لیے اسلام کی دعا کرے، اور اگر وہ مومن ہے تو توبہ اور اصلاح کی دعا کرے۔ اور اگر اللہ کی طرف سے اس اخروی خیر کی کوئی خبر نہ بھی ہوتی جو اس شخص کے لیے ہے جس کے ساتھ برائی کی گئی اگر وہ صبر کرے اور بدلہ نہ لے، تب بھی لوگوں کے درمیان رائج عرف کافی تھا اس تجاوز، عفو اور برائی کرنے والے سے درگزر کرنے کے معاملے میں۔ کیونکہ یہ اخلاقِ حسنہ میں سے ہے۔ اور اگر اس برائی کرنے والے کی برائی نہ ہوتی تو نہ میں ان اخلاقِ حسنہ سے متصف ہوتا اور نہ ہی وہ مجھ سے ظاہر ہوتے۔ جیسا کہ اگر میں اسے سزا دیتا تو اس کے حق میں یہ صفات مجھ سے ختم ہو جاتیں، اور میں سزا پر تعریف کیے جانے کے بجائے مذمت کے زیادہ قریب ہوتا۔ تو پھر کیا کہنا جبکہ شریعت میں یہ بات آئی ہے کہ جو شخص معاف کرتا ہے، درگزر کرتا ہے اور بدلہ نہیں لیتا، اس کا اجر اللہ کے ذمہ ہے۔\n\nپس تم جان چکے ہو کہ اس کا قول: \"اور ایک وقت میں میں نے پورا کیا اور ایک وقت میں میں نے پورا نہیں کیا\" (وقتا وفيت ووقتا لم أف) ایک لحاظ سے وعدہ اور وعید کی طرف راجع ہے، اور دوسرے لحاظ سے اللہ کی مخلوق میں وفا اور عدمِ وفا کی طرف راجع ہے، اس اعتبار سے کہ انہوں نے جو کچھ کیا وہ اللہ کی مشیئت (مشيئة) کے بغیر نہیں تھا۔ پس یہ اصل میں اسی (اللہ) کی طرف راجع ہے۔ اسی لیے اس نے فرمایا: \"پس اعتراض نہ کرو\"۔ مگر یہ کہ ذات حق (الحق) ہی تمہیں اعتراض کرنے کا حکم دے، تو تم اعتراض کرو۔ کیونکہ اس وقت اس میں کوئی فرق نہیں رہتا کہ تم اعتراض کرو یا حد قائم کرو، اگر تم ان اولی الامر میں سے ہو جن کے لیے حد قائم کرنا مقرر کیا گیا ہے، یہاں تک کہ اگر تم اسے چھوڑ دو تو تم اللہ کے حکم کی نافرمانی کرنے والے اور خلاف ورزی کرنے والے ہو گے۔ پس وہ مومن، عالم جو اپنے نفس کو بری الذمہ کرنا چاہتا ہے، وہ اس طرح کے مشاہدات اور مقامات کو ہاتھ سے نہیں جانے دیتا۔ کیونکہ وہ ہمیشہ اخلاقِ حسنہ کی تلاش میں رہتا ہے یہاں تک کہ وہ ان سے متصف ہو جائے اور ان میں باادب اور امانت دار لوگوں کی طرح قائم ہو جائے۔ اور وہ اس میں شریعت کا خیال رکھتے ہیں۔ کیونکہ بسا اوقات کوئی عرفی خوبی شرعی خوبی نہیں ہوتی۔ لہٰذا تم اپنے استاد کو صرف ذات حق (الحق) مشروع ہی بناؤ۔ پس جب وہ تمہیں حکم دے تو اس کے حکم کی تعمیل کرو، اور جب وہ تمہیں منع کرے تو جس چیز سے منع کیا ہے اس سے باز آ جاؤ، اور جب وہ تمہیں اختیار دے تو وہ کام کرو جو اسے سب سے زیادہ محبوب اور راجح ہو۔ اور اللہ حق کہتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ) اور وہی سیدھے راستے کی طرف ہدایت دیتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و سی و پنجم در معرفت منزلتی (منازلة) که در آن عهد بر خود گرفتم، پس گاهی وفا کردم و گاهی به دست بنده‌ام وفا نکردم، و عدم وفا به بنده‌ام نسبت داده می‌شود، پس اعتراض مکن، زیرا من آنجا هستم.\n\nوعد دادیم و تهدید کردیم، اما تهدید ما را *** اگر خواهی رها کن، و وعده حتمی است.\n\nزیرا من کریم هستم و صفت کریم بودن ما *** چنانکه ذکر کردیم، و قضا حتمی است.\n\nاگر قصد اجرای تهدید به خاطر صدقش باشد *** او را دلاوری می‌یابی که برای بخشش مبارزه می‌کند.\n\nپس او را از قصدش با نفوذ خود باز می‌دارد *** زیرا آسیاب (قدرت) از آن اوست و از آنجا مبارزه می‌کند.\n\nو اجرای (تهدید) را جز کوتاهی‌کننده *** نادانی که از آنچه گفتیم و از (الحق) عاجز است، نمی‌بیند.\n\n[وعد و وعید]\n\nخداوند متعال فرمود: «ما پاداش کسی را که نیکوکاری کرده است ضایع نمی‌کنیم» (إِنَّا لا نُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا). این در باب وعد است. و در باب وعید (تهدید) فرمود: «پس می‌آمرزد هر که را بخواهد و عذاب می‌کند هر که را بخواهد» (فَيَغْفِرُ لِمَنْ يَشاءُ ويُعَذِّبُ مَنْ يَشاءُ). پس بدان که این منزلت (منازلة) همان سخن اوست که «رحمت من بر غضبم پیشی می‌گیرد» و همان سخن اوست که «و شما نمی‌خواهید مگر آنکه خداوند بخواهد» (وَما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله).\n\nپس اگر بنده وعده‌ای دهد و خداوند بخواهد که آن بنده وعده و عهد خود را بشکند، از بنده می‌خواهد که او نیز شکستن عهد را بخواهد. و اگر چنین نبود، مخلوق نمی‌توانست اراده کند. پس بنده در آن هنگام، شکستن عهد و خلف وعده را به مشیئت (مشيئة) خداوند در خلق مشیئت بنده، اراده می‌کند. پس این همان سخن اوست که: «و گاهی وفا نکردم».\n\nپس بر بنده اعتراض مکن، زیرا او در اختیار خود به مشیئت من مجبور است. اما شایسته است برای صاحب این منزلت (منازلة)، هنگامی که ببیند چنین چیزی از کسی سر زده است، به خطاب شرع در مورد آن بنگرد. اگر ببیند که (الحق) زبان نکوهش را بر آن محلی که چنین نقض عهد و خلف وعده‌ای از او ظاهر شده، جاری ساخته است، پس او را به نکوهش (الحق) نکوهش کند و در این صورت او تنها حکایت‌کننده است و نه اینکه با نفس خود او را نکوهش کند. این همان ادب است. و این (اجرا) جز در خیر نیست، همانطور که حدود را بر متجاوز به امر (الحق) اقامه می‌کند نه به نفس خود. و به همین دلیل، بنده حق ندارد حدی را تعیین یا تشریع کند.\n\nاما در مورد وعید (تهدید)، اگر حدّی مشروع نباشد و تو در آن اختیار داشته باشی و بدانی که ترک آن نزد خداوند بهتر از انجامش است، می‌توانی به آن وفا نکنی و به خلف (وعده) در آن متصف شوی، مانند سخن او: «هر کس سوگندی یاد کند و بهتر از آن را ببیند، پس کفاره سوگندش را بدهد و کاری را که بهتر است انجام دهد». خداوند متعال فرمود: «و صاحبان فضل و وسعت از شما سوگند نخورند که (به دیگران) کمک نکنند» (وَلا يَأْتَلِ أُولُوا الْفَضْلِ مِنْكُمْ وَالسَّعَةِ أَنْ يُؤْتُوا). شاعر می‌گوید:\n\nو من اگر او را تهدید کنم یا وعده دهم *** تهدیدم را خلف می‌کنم و وعده‌ام را به انجام می‌رسانم.\n\nو مجازات کفاره تنها به این دلیل است که به مکارم اخلاق امر شده است، و سوگند بر ترک فعل خیر از اخلاق نکوهیده است، پس به کفاره مجازات شد. و این نزد ما بر خلاف وجهی است که نزد عامه فقهاست. زیرا خداوند برای ما چشمی قرار داده که با آن می‌نگریم، و آن این است که بدکار در حق ما، که خداوند ما را بین مجازات او به خاطر بدی‌اش و عفو از او مخیر ساخته است، هنگامی که به ما بدی کرد، از خیر آخرت به ما چیزی بخشید که ما به آن نیازمندیم، به طوری که اگر خداوند پرده را میان ما و خیری که در آخرت به سبب آن بدی به ما می‌رسد بردارد تا آن را به چشم ببینیم، می‌گوییم: هیچ کس در حق ما به اندازه این کسی که گفتیم در حق ما بدی کرده، نیکی نکرده است. پس جزای او نزد ما محرومیت نخواهد بود، و او را می‌بخشیم و مجازات نمی‌کنیم و از فضل خود به او نیکی می‌کنیم به اندازه‌ای که نفوس ما اجازه دهد.\n\nزیرا در توان ما نیست و هیچ مخلوقی در دنیا مالک چیزی نیست که بتواند با آن به کسی که به او بدی کرده، پاداش خیر دهد، و آن خیر را از کسی که در دنیا به او نیکی کرده است، نمی‌یابد. و کسی که این عقیده و نظر او باشد، چگونه بدکار را با بدی مجازات می‌کند در حالی که در آن مخیر است؟\n\nپس هنگامی که کسی که به او بدی شده، سوگند یاد کرد و قسم خورد، حق بدکار را ادا نکرده است (زیرا او را از خیر محروم کرده است)، اگرچه بدکار قصد رساندن آن خیر را به او نداشته است، اما ایمان قصد او بوده است. پس شایسته است که برای او دعا کند، اگر مشرک است به اسلام و اگر مؤمن است به توبه و صلاح. و حتی اگر خبری از جانب خداوند درباره خیر اخروی برای کسی که به او بدی شده و صبر کرده و مجازات نکرده، نبود، آنچه در عرف میان مردم مقرر است، برای گذشت و عفو و چشم‌پوشی از بدکار کافی بود، زیرا این از مکارم اخلاق است. و اگر بدی این بدکار نبود، من به این مکارم اخلاق متصف نمی‌شدم و این صفات از من ظاهر نمی‌گشت، همانطور که اگر او را مجازات می‌کردم، این صفات در حق او از من زائل می‌شد و به نکوهش نزدیک‌تر بودم تا به ستایش بر مجازات. چگونه چنین نباشد در حالی که شرع در این باره آورده است که پاداش کسی که عفو می‌کند و می‌گذرد و مجازات نمی‌کند، بر عهده خداوند است.\n\nسخن او که «گاهی وفا کردم و گاهی وفا نکردم»، از یک جهت به وعد و وعید باز می‌گردد و از جهت دیگر به آنچه در خلق خداوند از وفا و عدم وفا وجود دارد، از این حیث که آنچه را انجام دادند، جز به مشیئت (مشيئة) خداوند انجام ندادند. پس اصالتاً به او باز می‌گردد. و به همین دلیل فرمود: «پس اعتراض مکن»، مگر آنکه (الحق) خود معترض باشد و به تو امر کند که اعتراض کنی، پس اعتراض کن. زیرا در آن هنگام فرقی نمی‌کند که اعتراض کنی یا حد را اقامه کنی، اگر از اولی‌الامر باشی در مورد کسی که برای اقامه حد بر او تعیین شده‌ای، به طوری که اگر آن را ترک کنی، نافرمان و مخالف امر خداوند خواهی بود. مؤمن عالم و کسی که نفس خود را تبرئه می‌کند، چنین مشاهد و مواقفی را از دست نمی‌دهد، زیرا او پیوسته در جستجوی مکارم اخلاق است تا به آنها متصف شود و در آنها قیام کند، قیام ادیبان امین، و در این راه شریعت را رعایت می‌کنند. چه بسا مکارم اخلاقی که در عرف، مکارم شرعی نباشد. پس استاد خود را جز (الحق) مشروع قرار مده. پس اگر به تو امر کرد، امرش را اطاعت کن، و اگر نهی کرد، از آنچه نهی کرده باز ایست، و اگر تو را مخیر ساخت، محبوب‌ترین و ارجح‌ترین کار نزد او را انجام ده. و خداوند حق را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}