{
  "id": 252,
  "title": {
    "ar": "الباب الثاني والخمسون ومائتان في المحو",
    "en": "Chapter Two Hundred and Fifty-Two, On Effacement (المحو)",
    "ur": "۲۵۲ واں باب محو (المحو) کے بیان میں",
    "fa": "باب دویست و پنجاه و دوم در محو"
  },
  "content": {
    "ar": "## «الباب الثاني والخمسون ومائتان في المحو»\n\n\n> للمحو حكم إلهي يقول به *** في سورة الرعد والبرهان يحمله‏\n\n\n> المحو يثبته الإثبات وهو له *** ضد وهل بوجود الضد تعقله‏\n\n\n> المحو ثبت ولكن حكمه عدم *** فابحث على عالم به يفصله‏\n\n\n### [أن المحو عبارة عن رفع أوصاف العادة وإزالة العلة]\n\n\nاعلم أن المحو عند الطائفة رفع أوصاف العادة وإزالة العلة وما ستره الحق ونفاه قال تعالى يَمْحُوا الله ما يَشاءُ ويُثْبِتُ فثبت المحو وهو المعبر عنه بالنسخ عند الفقهاء فهو نسخ إلهي رفعه الله ومحاه بعد ما كان له حكم في الثبوت والوجود وهو في الأحكام انتهاء مدة الحكم وفي الأشياء انتهاء المدة فإنه تعالى قال كُلٌّ يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى فهو يثبت إلى وقت معين ثم يزول حكمه لا عينه فإنه قال يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى فإذا بلغ جريانه الأجل زال جريانه وإن بقي عينه فالعادة التي في‏\nالعموم يمحوها الله عن الخصوص فمنهم من تمحى عن ظاهره ومنهم من تمحى عن باطنه وتبقي عليه أوصاف العادة وهو الكامل مع كونه صاحب محو كما أنه يكون المسخ في القلوب وهو اليوم كثير\n\n\n«و كان في بنى إسرائيل» ظاهرا بالصورة فمسخهم الله قردة وخنازير وجعل ذلك في هذه الأمة في باطنها تمييزا لها ولكن لا تقوم الساعة حتى يظهر في صورها شي‏ء من ذلك مع خسف وقذف كذا ورد الخبر عن رسول الله صلى الله عليه وسلم‏\n\n\nومن العادة الركون إلى الأسباب والعلل فصاحب المحو يزول عنه الركون إلى الأسباب لا الأسباب فإن الله لا يعطل حكم الحكمة في الأشياء والأسباب حجب إلهية موضوعة لا ترفع أعظمها حجابا عينك فعينك سبب وجود المعرفة بالله تعالى إذ لا يصح لها وجود إلا في عينك ومن المحال رفعك مع إرادة الله أن يعرف فيمحوك عنك فلا تقف معك مع وجود عينك وظهور الحكم منه كما محا الله رسول الله صلى الله عليه وسلم في حكم رميه مع وجود الرمي منه فقال وما رَمَيْتَ فمحاه إِذْ رَمَيْتَ فأثبت السبب ولكِنَّ الله رَمى‏ وما رمى إلا بيد رسول الله صلى الله عليه وسلم وفي الصحيح كنت سمعه وبصره ويده‏\n\n\nفازالة العلة في المحو إنما هي في الحكم لا في العين إذ لو زالت العلة والسبب لزال وهو لا يزول فمن الحكمة إبقاء الأسباب مع محو العبد من الركون إليها على حكم نفي أثرها في المسببات فالأسباب ستور وحجب ولا يكون محو أبدا إلا فيما له أثر وإلا فليس بمحو والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Fifty-Two: Concerning Effacement (المحو)\n\nEffacement (المحو) possesses a Divine ordinance (حكم إلهي) which He declares\nIn the Surah of Thunder (الرعد), and the demonstration (البرهان) bears witness to it.\n\nAffirmation (الإثبات) establishes Effacement (المحو), yet it is\nIts opposite; and can you comprehend it through the existence of its contrary?\n\nEffacement (المحو) is established, but its ordinance (حكمه) is non-existence (عدم)\nTherefore, seek a Gnostic (عالم) who can elucidate it.\n\n### [That Effacement (المحو) is the removal of habitual attributes (أوصاف العادة) and the elimination of causality (العلة)]\n\nKnow that Effacement (المحو), according to the Sufi community (الطائفة), is the removal of habitual attributes (أوصاف العادة) and the elimination of causality (العلة), and that which the Real (الحق) has veiled and negated. The Exalted said: <<يَمْحُوا الله ما يَشاءُ ويُثْبِتُ>> (Allah effaces what He wills and affirms [what He wills]). Thus, Effacement (المحو) is established, which is what the jurists (الفقهاء) refer to as Abrogation (النسخ). It is, therefore, a Divine Abrogation that Allah raises and effaces after it had an ordinance (حكم) in establishment (الثبوت) and existence (الوجود).\n\nIn legal rulings (الأحكام), it is the termination of the ruling’s duration, and in things (الأشياء), it is the termination of the period. For the Exalted said: <<كُلٌّ يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى>> (All runs [its course] to an appointed term). Thus, it is affirmed until a specific time, then its ordinance (حكمه) ceases, but not its entity (عينه). For He said: <<يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى>> (runs [its course] to an appointed term). When its running reaches the term, its running ceases, even if its entity (عينه) remains.\n\nThe habit (العادة) that exists generally, Allah effaces it from the select few (الخصوص). Among them are those from whom it is effaced from their outward aspect (ظاهره), and among them are those from whom it is effaced from their inward aspect (باطنه), while the habitual attributes (أوصاف العادة) remain upon them—and this is the Perfect Human (الكامل) despite being a possessor of Effacement (صاحب محو). Similarly, there is transmutation (المسخ) in the hearts, which is widespread today.\n\n\"And it was among the Children of Israel\" outwardly in form, so Allah transmuted them into apes and swine. He placed this transmutation in the inward aspect of this Community (الأمة) as a distinction for it. However, the Hour will not be established until some of that appears in their forms, accompanied by sinking into the earth (خسف) and pelting (قذف), as the report came from the Messenger of Allah (peace and blessings be upon him).\n\nAmong the habits (العادة) is reliance upon secondary causes (الأسباب) and causality (العلل). The possessor of Effacement (صاحب المحو) is relieved of reliance upon the causes, but not the causes themselves, for Allah does not suspend the ordinance (حكم) of Wisdom (الحكمة) in things. Secondary causes (الأسباب) are established Divine veils (حجب إلهية) that are not lifted. The greatest of these veils is your own entity (عينك), for your entity is the cause of the existence of Gnosis (المعرفة) of Allah the Exalted, since Gnosis cannot properly exist except within your entity.\n\nIt is impossible to remove you entirely while Allah desires to be known. Thus, He effaces you from yourself (يمحوك عنك), so you do not stand with yourself, even though your entity (عينك) exists and the ordinance (الحكم) proceeds from it. Just as Allah effaced the Messenger of Allah (peace and blessings be upon him) in the ordinance (حكم) of his throwing, despite the existence of the throwing originating from him. So He said: <<وما رَمَيْتَ>> (And you did not throw), thereby effacing him, <<إِذْ رَمَيْتَ>> (when you threw), thereby affirming the cause (السبب), <<ولكِنَّ الله رَمى‏>> (but Allah threw). Yet, He only threw by the hand of the Messenger of Allah (peace and blessings be upon him). And in the authentic Hadith: \"I was his hearing, his sight, and his hand.\"\n\nTherefore, the elimination of causality (العلة) in Effacement (المحو) is only in the ordinance (الحكم), not in the entity (العين). For if the causality and the cause (السبب) were removed, the entity would also be removed, and it is not removed. Thus, it is part of Wisdom (الحكمة) to maintain the secondary causes (الأسباب) while effacing the servant from reliance upon them, based on the ordinance of negating their effect in the caused things (المسببات). Secondary causes (الأسباب) are coverings and veils (حجب). Effacement (المحو) never occurs except in that which has an effect; otherwise, it is not Effacement. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو باون: محو (المحو) کے بیان میں\n\nمحو (المحو) کا ایک حکمِ الٰہی ہے جس کا وہ ذکر فرماتا ہے\nسُورۃ الرعد میں اور دلیل اس کی حامل ہے۔\n\nمحو (المحو) کو اثبات (الإثبات) ثابت کرتا ہے، اور وہ (اثبات) اس کی ضد ہے۔\nکیا تم ضد کے وجود سے اسے سمجھ سکتے ہو؟\n\nمحو (المحو) ثابت ہے لیکن اس کا حکم عدم (عدم) ہے،\nپس تم کسی ایسے عالم کو تلاش کرو جو اس کی تفصیل بیان کرے۔\n\n[یہ کہ محو (المحو) سے مراد عادات کی صفات کو اٹھا لینا اور علت کو زائل کرنا ہے]\n\nجان لو کہ اہل تصوف (الطائفة) کے نزدیک محو (المحو) سے مراد عادات کی صفات کو اٹھا لینا اور علت کو زائل کرنا ہے، اور وہ چیز جسے ذات حق (الحق) نے چھپا دیا اور ختم کر دیا۔ اللہ تعالیٰ فرماتا ہے:\n\n> **يَمْحُوا الله ما يَشاءُ ويُثْبِتُ**\n> (اللہ جسے چاہتا ہے مٹا دیتا ہے اور جسے چاہتا ہے قائم رکھتا ہے)\n\nپس محو (المحو) ثابت ہوا، جسے فقہاء کے ہاں نسخ (النسخ) سے تعبیر کیا جاتا ہے۔ یہ ایک الٰہی نسخ ہے جسے اللہ نے اس کے ثبوت اور وجود میں حکم رکھنے کے بعد اٹھا لیا اور مٹا دیا۔ احکام میں یہ حکم کی مدت کا اختتام ہے، اور اشیاء میں یہ مدت کا اختتام ہے۔ کیونکہ اللہ تعالیٰ نے فرمایا:\n\n> **كُلٌّ يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى**\n> (ہر چیز ایک مقررہ مدت تک چلتی ہے)\n\nپس وہ ایک مقررہ وقت تک ثابت رہتی ہے، پھر اس کا حکم زائل ہو جاتا ہے، نہ کہ اس کی عین (ذات)۔ کیونکہ اس نے فرمایا: **يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى** (ایک مقررہ مدت تک چلتی ہے)۔ جب اس کا چلنا اس مدت کو پہنچ جاتا ہے تو اس کا چلنا زائل ہو جاتا ہے، اگرچہ اس کی عین (ذات) باقی رہے۔\n\nپس وہ عادت جو عموم میں ہے، اللہ اسے خصوص (خاص بندوں) سے مٹا دیتا ہے۔ ان میں سے بعض وہ ہیں جن کے ظاہر سے وہ مٹ جاتی ہے، اور بعض وہ ہیں جن کے باطن سے وہ مٹ جاتی ہے، اور ان پر عادات کی صفات باقی رہتی ہیں، اور وہ محو (المحو) کا حامل ہونے کے باوجود انسان کامل (الإنسان الکامل) ہوتا ہے۔ اسی طرح دلوں میں مسخ (بگاڑ) واقع ہوتا ہے اور آج کل یہ بہت زیادہ ہے۔\n\nاور بنی اسرائیل میں یہ (مسخ) ظاہری صورت میں تھا، پس اللہ نے انہیں بندر اور خنزیر بنا دیا۔ اور اس امت میں اللہ نے اسے ان کے باطن میں رکھا ہے، تاکہ اس امت کو امتیاز حاصل ہو۔ لیکن قیامت قائم نہیں ہوگی جب تک کہ ان کی صورتوں میں بھی اس میں سے کچھ ظاہر نہ ہو، ساتھ ہی زمین دھنسنے اور پتھر برسنے کے واقعات بھی ہوں گے۔ اسی طرح رسول اللہ صلی اللہ علیہ وسلم سے خبر وارد ہوئی ہے۔\n\nاور عادات میں سے ایک اسباب (الأسباب) اور علتوں (العلل) پر بھروسہ کرنا ہے۔ پس صاحبِ محو (المحو) سے اسباب پر بھروسہ کرنا زائل ہو جاتا ہے، نہ کہ اسباب۔ کیونکہ اللہ اشیاء میں حکمت کے حکم کو معطل نہیں کرتا۔ اور اسباب (الأسباب) رکھے ہوئے الٰہی پردے (حجب إلهية) ہیں جو اٹھائے نہیں جاتے۔ ان میں سب سے بڑا پردہ تمہاری عین (ذات) ہے۔ پس تمہاری عین (ذات) اللہ تعالیٰ کی معرفت (المعرفۃ) کے وجود کا سبب ہے، کیونکہ اس (معرفت) کا وجود تمہاری عین (ذات) کے بغیر درست نہیں ہے۔ اور تمہارا اٹھا لیا جانا محال ہے جبکہ اللہ کا ارادہ یہ ہے کہ وہ پہچانا جائے، پس وہ تمہیں تم سے محو (المحو) کر دیتا ہے، تاکہ تمہاری عین (ذات) کے موجود ہونے اور اس سے حکم کے ظاہر ہونے کے باوجود تم اپنے ساتھ نہ ٹھہرو۔\n\nجیسا کہ اللہ نے رسول اللہ صلی اللہ علیہ وسلم کو ان کے پھینکنے (رمی) کے حکم میں محو (المحو) کر دیا، باوجود اس کے کہ پھینکنا ان کی طرف سے موجود تھا۔ پس اللہ نے فرمایا:\n\n> **وما رَمَيْتَ**\n> (اور جب تم نے پھینکا تو تم نے نہیں پھینکا)\n\nپس اللہ نے اسے محو (المحو) کر دیا **إِذْ رَمَيْتَ** (جب تم نے پھینکا) کے ساتھ، پس سبب کو ثابت کیا، لیکن **وَلَكِنَّ الله رَمىٰ** (لیکن اللہ نے پھینکا)۔ اور اللہ نے رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ کے سوا کسی اور سے نہیں پھینکا۔ اور حدیث صحیح میں ہے: \"میں اس کی سماعت، اس کی بصارت اور اس کا ہاتھ ہوتا ہوں۔\"\n\nپس محو (المحو) میں علت کا زائل کرنا صرف حکم میں ہوتا ہے، نہ کہ عین (ذات) میں۔ کیونکہ اگر علت اور سبب زائل ہو جائیں تو وہ (معرفت) بھی زائل ہو جائے گی، اور وہ زائل نہیں ہوتی۔ پس حکمت کا تقاضا یہ ہے کہ اسباب (الأسباب) کو باقی رکھا جائے، جبکہ بندے کو ان پر بھروسہ کرنے سے محو (المحو) کر دیا جائے، اس حکم کے تحت کہ مسببات (نتائج) میں ان کے اثر کی نفی کر دی جائے۔ پس اسباب پردے (ستور) اور حجاب (حجب) ہیں۔ اور محو (المحو) کبھی بھی نہیں ہوتا مگر اس چیز میں جس کا کوئی اثر ہو، ورنہ وہ محو نہیں ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "باب دویست و پنجاه و دوم در محو (المحو)\n\nمحو را حکمی الهی است که در سوره رعد بدان اشاره می‌کند *** و برهان آن را حمل می‌نماید.\nمحو را اثبات، ثابت می‌کند، در حالی که اثبات ضد آن است *** و آیا محو را به وجود ضدش درک می‌کنی؟\nمحو ثابت است، اما حکم آن عدم است *** پس در پی عالمی باش که آن را تفصیل دهد.\n\n[اینکه محو عبارت است از رفع اوصاف عادت و ازاله علت]\n\nبدان که محو (المحو) نزد این طایفه (صوفیه)، رفع اوصاف عادت و ازاله علت و چیزی است که حق (الحق) آن را پوشانده و نفی کرده است. خداوند متعال می‌فرماید: «يَمْحُوا الله ما يَشاءُ ويُثْبِتُ» (خداوند آنچه را بخواهد محو می‌کند و آنچه را بخواهد ثابت می‌دارد). پس محو ثابت شد، و آن همان چیزی است که فقها از آن به نسخ تعبیر می‌کنند. بنابراین، محو نسخ الهی است که خداوند آن را پس از آنکه حکمی در ثبوت و وجود داشت، برداشته و محو کرده است. محو در احکام، به معنای پایان یافتن مدت حکم است و در اشیاء، به معنای پایان یافتن مدت وجود. زیرا خداوند متعال فرمود: «كُلٌّ يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى» (هر یک تا سرآمدی معین در جریان است). پس آن شیء تا زمان معینی ثابت می‌ماند، سپس حکمش زائل می‌شود نه عینش. زیرا فرمود: «يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى» (در جریان است تا سرآمدی معین). پس چون جریانش به آن سرآمد برسد، جریانش زائل می‌شود، هرچند عینش باقی بماند.\n\nپس عادتی که در عموم است، خداوند آن را از خصوص محو می‌کند. برخی از ایشان محو از ظاهرشان رخ می‌دهد و برخی محو از باطنشان، در حالی که اوصاف عادت بر ایشان باقی می‌ماند. و او (آن شخص) انسان کامل (الإنسان الکامل) است با وجود اینکه صاحب محو است. همچنان که مسخ در قلب‌ها رخ می‌دهد و این امر امروز بسیار است.\n\nو در بنی اسرائیل مسخ به صورت ظاهری بود، پس خداوند آنان را به صورت بوزینه و خوک مسخ کرد. و این امر را در این امت، برای تمایز بخشیدن به آن، در باطن قرار داد. اما قیامت برپا نمی‌شود مگر آنکه چیزی از آن (مسخ) در صورتهای ظاهری این امت، همراه با فرو رفتن در زمین (خسف) و پرتاب شدن (قذف)، آشکار گردد. اینگونه خبر از رسول خدا (صلی الله علیه و سلم) وارد شده است.\n\nو از جمله عادت‌ها، تکیه کردن (الركون) به اسباب (الأسباب) و علل (العلل) است. پس از صاحب محو، تکیه به اسباب زائل می‌شود، نه خود اسباب. زیرا خداوند حکم حکمت را در اشیاء باطل نمی‌سازد. اسباب، حجاب‌های الهی نهاده شده‌ای هستند که برداشته نمی‌شوند. بزرگترین حجاب، عین توست. پس عین تو سبب وجود معرفت (المعرفة) به خداوند متعال است، زیرا وجود معرفت جز در عین تو صحیح نیست. و محال است که تو برداشته شوی، در حالی که اراده خداوند بر این است که شناخته شود. پس تو را از خودت محو می‌کند، و با وجود عین تو و ظهور حکم از آن، تو با خودت نمی‌ایستی. همانگونه که خداوند رسول خدا (صلی الله علیه و سلم) را در حکم پرتاب کردنش محو کرد، با وجود اینکه پرتاب از او صادر شد، پس فرمود: «وما رَمَيْتَ إِذْ رَمَيْتَ» (و تو پرتاب نکردی آنگاه که پرتاب کردی)، پس آن را محو کرد. سپس سبب را ثابت نمود: «ولكِنَّ الله رَمى‏» (بلکه خدا پرتاب کرد). و پرتاب نکرد مگر به دست رسول خدا (صلی الله علیه و سلم). و در حدیث صحیح آمده است: «کنت سمعه وبصره ویده» (من گوش او، چشم او و دست او بودم).\n\nپس ازاله علت (العلة) در محو (المحو) تنها در حکم است نه در عین. زیرا اگر علت و سبب زائل می‌شد، معلول نیز زائل می‌شد، در حالی که او (خداوند) زائل نمی‌شود. پس از حکمت است که اسباب باقی بمانند، در حالی که بنده از تکیه کردن به آنها محو شود، بر اساس حکم نفی اثر اسباب در مسببات. پس اسباب پرده‌ها و حجاب‌ها هستند. و محو هرگز رخ نمی‌دهد مگر در چیزی که دارای اثر باشد، وگرنه محو نیست. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}