{
  "id": 95,
  "title": {
    "ar": "الباب الخامس والتسعون في معرفة أسرار الجود وأصناف الإعطاءات‏",
    "en": "Chapter Ninety-Five: Concerning the Gnosis of the Mysteries of Munificence (الجود) and the Categories of Bestowals.",
    "ur": "پچانوےواں باب: جود (سخاوت) کے اسرار اور عطیات کی اقسام کی معرفت میں۔",
    "fa": "باب نود و پنجم در معرفت اسرار جود و انواع بخشش‌ها"
  },
  "content": {
    "ar": "## (الباب الخامس والتسعون في معرفة أسرار الجود وأصناف الإعطاءات‏\n\n\nمثل الكرم والسخاء والإيثار على الخصاصة وعلى غير الخصاصة والصدقة والصلة والهدية والهبة وطلب العوض وتركه)\n\n\n> رتب العطاء كثيرة لا تحصر *** وبها على أعدائنا نستنصر\n\n\n> بالجود صح وجودنا في عيننا *** بل نحن منه على الحقيقة مظهر\n\n\n(فصل الجود)\n\n\nعن الجود صدر الوجود والجود بفتح الجيم المطر الكثير وهو مقلوب وجد مثل جذب وجبذ فحروفهما واحدة بالاشتراك في المعنى فمتعلق الجود من الحق في الأعيان التي هي المظاهر ظهوره فيها ومتعلق الجود من المظاهر على الظاهر ما جادت به عليه باستعدادها الذاتي من الثناء بالأسماء الإلهية التي كسبه جودها من وجودها فالجود من الحق امتنان ذاتي والجود من الأعيان ذاتي لا امتناني فهذا الفرق بين الجودين وهذا معنى قولهم في الجود إنه العطاء قبل السؤال‏\n\n\n(فصل) الكرم‏\n\n\nوأما عطاء الكرم فهو العطاء بعد السؤال وهو على نوعين سؤال بالحال وسؤال بالمقال فسؤال الحال عن كشف من الطرفين وسؤال المقال من العبد معلوم يا رب يا رب أعطني اغْفِرْ لِي ارحمني اهدني ارزقني اجبرني عافني اعف عني لا تُخْزِنِي لا تَفْتِنِّي وأمثال ذلك وسؤال الحق ادْعُونِي أَقِمِ الصَّلاةَ لِذِكْرِي أَقِيمُوا الْوَزْنَ بِالْقِسْطِ ولا تُخْسِرُوا الْمِيزانَ فَلا تَكُونَنَّ من الْجاهِلِينَ وكل طلب تصور من الحق يطلبه من عباده وهي الفرائض كلها فمن الكرم تؤدي الفرائض ومن الجود تكون النوافل إلا لمثل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فإنها من الجود فهي تلحق بالفرائض وكون ذلك نافلة أخبار صادق قال تعالى ومن اللَّيْلِ فَتَهَجَّدْ به نافِلَةً لَكَ عَسى‏ أَنْ يَبْعَثَكَ رَبُّكَ مَقاماً مَحْمُوداً\n\n\n(فصل) السخاء\n\n\nورد في حديث أبي بكر النقاش في مواقف القيامة اسم السخي على الله وهو مذكور في هذا الكتاب في باب الجنة منه وأما عطاء السخاء فهو العطاء على قدر الحاجة وذلك عطاء الحكمة فهو من اسمه الحكيم فسخاء الحق قول موسى رَبُّنَا الَّذِي أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ وكُلُّ شَيْ‏ءٍ عِنْدَهُ بِمِقْدارٍ ولَوْ بَسَطَ الله الرِّزْقَ لِعِبادِهِ لَبَغَوْا في الْأَرْضِ ولكِنْ يُنَزِّلُ بِقَدَرٍ ما يَشاءُ وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ وأما سخاء العبد فإعطاؤه كل ذي حق حقه وإنصافه فلنفسه عليه حق ولأهله عليه حق ولعينه عليه حق ولزوره عليه حق‏\n\n\n(فصل) الإيثار\n\n\nأما الإيثار فليس للحق منه صفة إلا بوجه بعيد في ذكره سوء أدب بل ما هو حقيقة فتركه أولى وما ذهب إليه إلا من لا علم له ولا أدب من أهل الشطح فلنقل إن الإيثار قد يكون عطاء محتاج لمحتاج وقد يكون على الخصاصة ومع الخصاصة أو توهم الخصاصة وأما في جانب الحق فهو إعطاؤه الجوهر الوجود لخلق عرض من الأعراض لتعقل الإرادة بإيجاده لا بإيجاد المحل فيوجد المحل تبعا ضرورة إذ من شرط وجود العرض وجود المحل والجوهر محتاج فيا أعطاه الحق من خلق العرض فيه إذ لا يكون له وجود إلا بوجود عرض ما وسواء كان الجوهر متحيزا أو غير متحيز ومؤلفا مع غيره أو غير مؤلف فهذا عطاء على خصاصة مع خصاصة وأما على غير الخصاصة فهو اتصاف العبد في التخلق بالأسماء الإلهية واتصاف الحق في نزوله بأوصاف المحدثات وهذا كله واقع قد ظهر حكمه في الوجود وتبين‏\n\n\n(فصل) الصدقة\n\n\nفقد ذكرنا ذلك في باب الزكاة وهي هاهنا تصدق الحق على العبد بإبقاء عينه في الوجود وبإيجاده أولا مع علمه بأنه إذا أوجده يدعي الألوهية ويقول أَنَا رَبُّكُمُ الْأَعْلى‏ ولا بد من إيجاده لما سبق في العلم والصدقة من العبد على الحق فإن العبد يجد في نفسه عزة الصورة ومع هذا يقر بالعبودة لعزة الله وأيضا هي ما يظهر من المحامد المحدثة التي لا تصح لله إلا بعد وجود المحدث وهو كل ما سوى الله وإنما سميت صدقة لأن العبد المختار في محامد الله في نفسه فإنه قال تعالى في حقه لما بين له السبيل إلى سعادته إِمَّا شاكِراً وإِمَّا كَفُوراً فإنه ذو اختيار في أفعاله ولهذا يصح منه القبول والرد ويعاقب ويثاب وعلى هذا قام أصل الجزاء من الله تعالى لعباده‏\n\n\n(فصل) عطاء الصلة\n\n\nوأما عطاء الصلة فهي لذوي الأرحام حقا وخلقا\n\n\nيقول تعالى الرحم شجنة من الرحمن من وصلها وصله الله ومن قطعها قطعه الله‏\n\n\nفنسبتها للحق نسبتها للعبد فالرحمن رحم لنا ونحن رحم للرحمن‏\n(فصل) عطاء الهدية\n\n\nوهو عطاء عن بيان ولهذا اشتركت في حروف الهدى لأنه بالهدى أهدى فهدية الحق للعبد نفسه وهدية العبد للحق رد تلك النفس إليه بخلعة تكسبه محبة ربه فَاتَّبِعُونِي يُحْبِبْكُمُ الله‏\n\n\n(فصل) عطاء الهبة\n\n\nوهو من الحق إعطاء لينعم لا يقترن معه طلب جزاء ومن العبد عمله لحق الربوبية لا للجزاء\n\n\n(فصل) وأما طلب العوض وتركه‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم حبوا الله لما يغذوكم به من نعمه‏\n\n\nوأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ ومن العبد هو ما يطلبه من الجزاء على عمله الذي وعده الله به إِنْ أَجْرِيَ إِلَّا عَلَى الله‏\n\n\n(فصل) وأما ترك طلب العوض‏\n\n\nفمن الحق أنه العامل ولا يتصور من المالك إذا كان هو العامل أن يطلب ما هو عنده فإن الحاصل لا يبتغى ومن العبد فإنه لا يرى نفسه عاملا فما فعل شيئا يطلب بذلك الفعل عوضا من الله حيث أعطاه من نفسه‏\n\n\n### [العطاء المطلق والعطاء المقيد]\n\n\nفهذه فصول محققة نبهناك بها على ما هو الأمر عليه وتفصيلاتها تبدو لك مع الآنات في نفس سلوكك وهذا كله مقام إلهي في المحسنين خاصة وصاحبه مجهول لا يعرف ونكرة لا تتعرف ثم إن هذا العطاء لا بد أن يكون مطلقا أو مقيدا فمن أعطى بيد حق أطلقه فيعم عطاؤه جميع عباد الله لا يخصص عينا من عين مما يصلح لذلك المعطي مثل ذلك إن كانت الأعطية من النقود فلا يعطيها إلا من له التصرف فيها وهو الإنسان ولا يشترط فيه صغيرا ولا كبيرا ولا ذكرا ولا أنثى ولا غنيا ولا فقيرا ولا مؤمنا ولا كافرا ولا عاقلا ولا مجنونا بل هو في ذلك العطاء كمطلق الرزق على كل حيوان وكذلك إن كان مما يلبس مثل النقود سواء يعطيه لأهله وأما إن كان مأكولا فيعطيه لكل متغذ يأكل ذلك الصنف من الغذاء من حيوان أو إنسان وليس له اختيار ولا تمييز بل هو مع أول من يلقاه فإن رده عليه حينئذ أعطاه الثاني وهكذا حتى يجد من يأخذه منه وهذا لا يكون إلا للربانيين من الاسم الرب والرحمانيين من الاسم الرحمن وليس للالهيين مدخل في العطاء المطلق وأثر هذا العطاء ظاهر في كل موجود لا أحاشي أعني من الأصناف لا في آحاد أشخاص الموجودات وهذا عطاء المحسن لا المؤمن ولا المسلم وأما إن كان العطاء مقيدا فهو بحسب ما تقيد به فحكم ذلك راجع إلى حكم الشرع فيه فيعمل الأولى فالأولى ويبتدئ بالذي أمره الشارع أن يبتدئ به ويبحث عنه حتى يجده ولا يعطي على هذا الحد إلا الإلهي من الاسم الله المؤمن المحسن المسلم وأثر هذا العطاء أيضا عام‏\n\n",
    "en": "Chapter Ninety-Five: Concerning the Knowledge of the Secrets of Generosity (الجود) and the Varieties of Giving\n\nSuch as Nobility (الكرم), Munificence (السخاء), Altruism (الإيثار) when in dire necessity and when not in dire necessity, Charity (الصدقة), Kinship Gift (الصلة), Present (الهدية), Gift (الهبة), and the Seeking or Abandoning of Recompense (العوض).\n\n> The degrees of giving are many and cannot be enumerated,\n> And through them we seek victory over our enemies.\n> Through Generosity (الجود), our existence (وجودنا) is validated in our own essence (عيننا),\n> Rather, in reality (على الحقيقة), we are a manifestation (مظهر) of it.\n\n### Section on Generosity (الجود)\n\nFrom Generosity (الجود) originated Existence (الوجود). *Al-Jūd* (with a *fatha* on the *jīm*) means abundant rain. It is the inversion of *wajd* (finding/ecstasy), just as *jadhaba* (he pulled) is the inversion of *jabhadha* (he pulled); their letters are the same due to the shared meaning.\n\nThe object of Generosity (الجود) from the Real (الحق) in the Fixed Entities (الأعيان الثابتة), which are the manifestations (المظاهر), is His Self-disclosure (ظهوره) within them. The object of Generosity from the manifestations upon the Manifest is what they bestow upon Him through their inherent readiness (استعدادها الذاتي) in the form of praise (الثناء) using the Divine Names (الأسماء الإلهية), which their generosity earned from their existence (وجودها).\n\nThus, Generosity from the Real is an inherent favor (امتنان ذاتي). And Generosity from the Fixed Entities is inherent, not a favor. This is the difference between the two types of Generosity, and this is the meaning of their saying regarding Generosity: that it is the giving before the asking.\n\n### Section on Nobility (الكرم)\n\nAs for the giving of Nobility (الكرم), it is the giving after the asking. This is of two types: asking by state (سؤال بالحال) and asking by speech (سؤال بالمقال). Asking by state is through an unveiling (كشف) from both sides. Asking by speech from the servant is known: \"O Lord, O Lord, grant me, forgive me, have mercy on me, guide me, provide for me, mend me, grant me health, pardon me, do not disgrace me, do not test me,\" and similar requests.\n\nAnd the asking of the Real (الحق) is: \"Call upon Me,\" \"Establish the prayer for My remembrance,\" \"Establish the weight with justice, and do not defraud the balance,\" \"So be not among the ignorant.\" Every conceivable demand that the Real requests from His servants—these are all the obligatory duties (الفرائض).\n\nThus, the performance of obligatory duties is from Nobility (الكرم), and the supererogatory acts (النوافل) are from Generosity (الجود). Except for the likes of the Messenger of Allah (PBUH), for his supererogatory acts are from Generosity, and thus they are annexed to the obligatory duties. The fact that this is a supererogatory act is confirmed by truthful reports. The Exalted said: <<وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَّكَ عَسَىٰ أَن يَبْعَثَكَ رَبُّكَ مَقَامًا مَّحْمُودًا>> (And during the night, wake up for prayer, an additional devotion for you; perhaps your Lord will raise you to a praised station).\n\n### Section on Munificence (السخاء)\n\nThe Name *al-Sakhī* (The Munificent) was mentioned for Allah in the *hadith* of Abu Bakr al-Naqqash concerning the stations of the Day of Resurrection, and it is mentioned in the chapter on Paradise in this book.\n\nAs for the giving of Munificence (السخاء), it is the giving according to the measure of need. This is the giving of Wisdom, and thus it derives from His Name, The Wise (الحكيم). The Munificence of the Real (الحق) is exemplified by the saying of Moses: <<رَبُّنَا الَّذِي أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ>> (Our Lord is He who gave each thing its creation), and <<وَكُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ>> (And everything with Him is by measure), and <<وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ>> (And if Allah were to extend the provision for His servants, they would surely transgress in the earth; but He sends down by measure what He wills), and <<وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ>> (And We do not send it down except in a known measure).\n\nAs for the munificence of the servant, it is his giving to everyone who has a right his due right, and his acting justly. For his soul has a right over him, his family has a right over him, his eye has a right over him, and his visitor has a right over him.\n\n### Section on Altruism (الإيثار)\n\nAs for Altruism (الإيثار), the Real (الحق) does not possess this Attribute (صفة), except in a remote sense, the mention of which constitutes bad manners (سوء أدب). Rather, what is truly real should be abandoned (in this context), and only those lacking knowledge and manners—from the people of ecstatic utterances (*shataḥ*)—have adopted this view.\n\nLet us say that Altruism may be the giving of one in need to another in need, and it may be giving when in dire necessity (على الخصاصة), or alongside dire necessity (مع الخصاصة), or the imagining of dire necessity.\n\nAs for the side of the Real, it is His giving the substance (الجوهر) of Existence (الوجود) to the creation of an accident (عرض) from among the accidents, so that the Will (الإرادة) may be realized by creating the accident, not by creating the locus (المحل). The locus is then created necessarily as a consequence, since the condition for the existence of the accident is the existence of the locus. And the substance is in need of what the Real gives it by creating the accident within it, since the substance cannot exist except through the existence of some accident, whether the substance is spatial or non-spatial, compounded with another or uncompounded. This, then, is giving when in dire necessity alongside dire necessity.\n\nAs for giving when not in dire necessity, it is the servant’s assumption of the Divine Names (الأسماء الإلهية) through ethical transformation (التخلق), and the Real’s assumption of the attributes of created things (المحدثات) in His descent. All of this is actualized, its ruling has appeared in Existence (الوجود), and it has become clear.\n\n### Section on Charity (الصدقة)\n\nWe have already mentioned this in the chapter on *Zakāt*. Here, it refers to the Real’s (الحق) act of charity (تصدق) toward the servant by maintaining his immutable essence (عينه) in Existence (الوجود), and by bringing him into existence initially, even though He knows that when He creates him, the servant will claim divinity and say: <<أَنَا رَبُّكُمُ الْأَعْلَىٰ>> (I am your Lord, the Most High). Yet, He must bring him into existence due to what preceded in Knowledge (العلم).\n\nAnd the charity from the servant to the Real is that the servant finds in himself the glory of the form (عزة الصورة), yet despite this, he affirms servitude (العبودة) due to the glory of Allah. Also, it is the created praises (المحامد المحدثة) that appear, which are not valid for Allah except after the existence of the created thing (المحدث)—which is everything other than Allah.\n\nIt is only called charity (*ṣadaqa*) because the servant has choice regarding the praises of Allah within himself, for the Exalted said concerning him, after showing him the path to his felicity: <<إِمَّا شَاكِرًا وَإِمَّا كَفُورًا>> (Whether grateful or ungrateful). He possesses choice in his actions, and for this reason, acceptance and rejection are valid for him, and he is punished and rewarded. Upon this principle rests the foundation of recompense (الجزاء) from Allah the Exalted to His servants.\n\n### Section on the Gift of Kinship (الصلة)\n\nAs for the gift of Kinship (الصلة), it belongs to those related by blood (ذوي الأرحام), both legally and inherently.\n\nThe Exalted says: \"The womb (الرحم) is a branch (*shujna*) of the All-Merciful (الرحمن). Whoever connects it, Allah connects him, and whoever severs it, Allah severs him.\"\n\nIts relation to the Real (الحق) is like its relation to the servant. Thus, the All-Merciful (الرحمن) is a womb (*raḥim*) for us, and we are a womb (*raḥim*) for the All-Merciful.\n\n### Section on the Gift/Present (الهدية)\n\nThis is a gift based on clarification (بيان), and for this reason, it shares the letters of Guidance (*hudā*), because through Guidance one gives a present (*ahdā*).\n\nThe present from the Real (الحق) to the servant is the servant himself. And the present from the servant to the Real is the return of that self to Him, adorned with a robe that earns him the love of his Lord: <<فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ>> (So follow me, [and] Allah will love you).\n\n### Section on the Gift (الهبة)\n\nFrom the Real (الحق), this is a giving intended for blessing, not accompanied by the seeking of recompense (جزاء). From the servant, it is his action performed for the right of Lordship (الربوبية), not for recompense.\n\n### Section on Seeking and Abandoning Recompense (العوض)\n\nHis saying (PBUH): \"Love Allah for the blessings with which He nourishes you.\"\n\nAnd <<وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ>> (And fulfill My covenant [with you], I will fulfill My covenant [with Me]).\n\nFrom the servant, it is what he seeks as recompense (الجزاء) for his action, which Allah promised him: <<إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ>> (My reward is only upon Allah).\n\n### Section on Abandoning the Seeking of Recompense\n\nFrom the Real (الحق), it is because He is the Doer (العامل), and it is inconceivable for the Owner, when He is the Doer, to seek what is already with Him, for what is already obtained is not sought.\n\nAnd from the servant, it is because he does not see himself as the Doer, so he has done nothing for which he should seek recompense from Allah, since Allah gave him the ability from Himself.\n\n### [Absolute Giving and Restricted Giving]\n\nThese are verified sections by which we have alerted you to the reality of the matter. Their details will become apparent to you moment by moment (الآنات) during the course of your spiritual journey (سلوكك).\n\nAll of this is a Divine Station (مقام إلهي) specific to the Excellent Doers (المحسنين). Its possessor is unknown and unrecognized, an indefinite entity that cannot be defined.\n\nFurthermore, this giving must necessarily be either absolute (مطلقا) or restricted (مقيدا). Whoever gives with the hand of the Real (الحق) makes his giving absolute, so his bestowal encompasses all servants of Allah, without specifying one entity over another from among those suitable for that gift. For example, if the gifts are currency, he only gives them to those who have the capacity to use them, namely humans, and he does not stipulate whether they are young or old, male or female, rich or poor, believer or disbeliever, sane or insane. Rather, in that giving, he is like the absolute provision (الرزق) given to every animal. Likewise, if the gift is clothing, it is exactly like currency; he gives it to those who are suitable for it.\n\nBut if it is food, he gives it to every nourished being, whether animal or human, that eats that type of sustenance. He has neither choice nor discrimination; rather, he gives it to the first person he meets. If that person refuses it, he then gives it to the second, and so on, until he finds someone who accepts it from him.\n\nThis only belongs to the Lordly ones (الربانيين) deriving from the Name The Lord (الرب), and the All-Merciful ones (الرحمانيين) deriving from the Name The All-Merciful (الرحمن). The Divine ones (الالهيين) have no access to Absolute Giving (العطاء المطلق). The effect of this giving is manifest in every existing thing—I mean among the categories, not in the individual persons of existing things. This is the giving of the Excellent Doer (المحسن), not the Believer (المؤمن) or the Muslim.\n\nAs for Restricted Giving (العطاء المقيد), it is according to the restriction imposed upon it. Its ruling refers back to the ruling of the Sacred Law (*Shar’*) concerning it. One performs what is most appropriate first, and begins with what the Lawgiver commanded him to begin with, and he seeks it out until he finds it. No one gives according to this limit except the Divine one (الإلهي) deriving from the Name Allah, the Believer, the Excellent Doer, the Muslim. The effect of this giving is also general.",
    "ur": "پچانوےواں باب: جود (الجود) کے اسرار اور عطیات کی اقسام کی معرفت میں، جیسے کرم (الکرم)، سخاوت (السخاء)، ایثار (الإیثار) (ضرورت کی حالت میں اور غیر ضرورت کی حالت میں)، صدقہ (الصدقة)، صلہ (الصلة)، ہدیہ (الھدیۃ)، ہبہ (الھبۃ)، اور عوض کا طلب کرنا یا اسے ترک کرنا۔\n\n> رتب العطاء كثيرة لا تحصر *** وبها على أعدائنا نستنصر\n> بالجود صح وجودنا في عيننا *** بل نحن منه على الحقيقة مظهر\n\nعطا کے مراتب بے شمار ہیں،\nاور ان کے ذریعے ہم اپنے دشمنوں پر نصرت طلب کرتے ہیں۔\nجود (الجود) کے سبب ہماری ہستی (الوجود) ہماری نظر میں درست ہوئی،\nبلکہ حقیقت میں ہم اسی سے ظاہر ہونے والے مظہر ہیں۔\n\n**فصل: جود (الجود)**\n\nجود (الجود) سے ہی ہستی (الوجود) صادر ہوئی ہے۔ جود (الجود) جیم کے فتحہ کے ساتھ کثرت کی بارش کو کہتے ہیں، اور یہ وجد (الوجد) کا مقلوب ہے، جیسے جذب (الجذب) اور جبذ (الجبذ)۔ پس ان کے حروف ایک ہی ہیں اور معنی میں اشتراک ہے۔\n\nذات حق (الحق) کی طرف سے جود (الجود) کا تعلق اعیان (الأعيان) میں، جو کہ مظاہر (المظاهر) ہیں، ان میں اس کے ظہور سے ہے۔ اور مظاہر (المظاهر) کی طرف سے جود (الجود) کا تعلق ظاہر پر اس چیز سے ہے جو مظاہر نے اپنے ذاتی استعداد (استعداد الذاتی) کے ذریعے ذات حق (الحق) پر نچھاور کی، یعنی ان الٰہی اسماء (الأسماء الإلهية) کی ثنا (تعریف) سے جو ان کے جود (الجود) نے ان کی ہستی (وجود) سے کمائی۔\n\nپس ذات حق (الحق) کی طرف سے جود (الجود) ایک ذاتی احسان (امتنان ذاتی) ہے، اور اعیان (الأعيان) کی طرف سے جود (الجود) ذاتی ہے، احسانی (امتنانی) نہیں۔ یہ ہے دونوں جود (الجودین) کے درمیان فرق۔ اور یہی ان کے اس قول کا معنی ہے کہ جود (الجود) سوال سے پہلے عطا کرنا ہے۔\n\n**فصل: کرم (الکرم)**\n\nاور کرم (الکرم) کی عطا سوال کے بعد عطا کرنا ہے۔ یہ دو قسموں پر ہے: حال کے ذریعے سوال اور قول کے ذریعے سوال۔ حال کا سوال دونوں طرف سے کشف (الکشف) کے ذریعے ہوتا ہے، اور بندے کی طرف سے قول کا سوال معلوم ہے: \"یا رب، مجھے عطا کر، مجھے بخش دے، مجھ پر رحم کر، مجھے ہدایت دے، مجھے رزق دے، میری کمی پوری کر، مجھے عافیت دے، مجھ سے درگزر کر، مجھے رسوا نہ کر، مجھے فتنے میں نہ ڈال،\" اور اسی طرح کی دعائیں۔\n\nاور ذات حق (الحق) کا سوال یہ ہے:\n> ادْعُونِي (مجھے پکارو) [القرآن ۲:۱۸۶]\n> أَقِمِ الصَّلاةَ لِذِكْرِي (میری یاد کے لیے نماز قائم کرو) [القرآن ۲۰:۱۴]\n> أَقِيمُوا الْوَزْنَ بِالْقِسْطِ ولا تُخْسِرُوا الْمِيزانَ (انصاف کے ساتھ وزن قائم کرو اور تول میں کمی نہ کرو) [القرآن ۵۵:۹]\n> فَلا تَكُونَنَّ من الْجاهِلِينَ (پس تم جاہلوں میں سے نہ ہو جانا) [القرآن ۶:۳۵]\n\nاور ہر وہ طلب جو ذات حق (الحق) سے متصور ہو کہ وہ اپنے بندوں سے طلب کرتا ہے، وہ سب فرائض (الفرائض) ہیں۔ پس کرم (الکرم) سے فرائض ادا کیے جاتے ہیں، اور جود (الجود) سے نوافل (النوافل) ہوتے ہیں۔ سوائے رسول اللہ صلی اللہ علیہ وسلم کے، کہ ان کے لیے نوافل بھی جود (الجود) سے ہیں، لہٰذا وہ فرائض کے ساتھ ملحق ہو جاتے ہیں۔ اور اس کا نافلہ ہونا سچی خبروں سے ثابت ہے، اللہ تعالیٰ فرماتا ہے:\n> وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَّكَ عَسَىٰ أَن يَبْعَثَكَ رَبُّكَ مَقَامًا مَّحْمُودًا (اور رات کے کچھ حصے میں اس کے ساتھ تہجد پڑھو، یہ تمہارے لیے ایک زائد عبادت (نافلہ) ہے، قریب ہے کہ تمہارا رب تمہیں مقام محمود پر فائز کرے) [القرآن ۱۷:۷۹]\n\n**فصل: سخاوت (السخاء)**\n\nابو بکر النقاش کی حدیث میں قیامت کے مقامات کے بارے میں اللہ تعالیٰ پر سخی (السخی) کا نام وارد ہوا ہے، اور اس کتاب میں جنت کے باب میں اس کا ذکر ہے۔ سخاوت (السخاء) کی عطا ضرورت کے مطابق عطا کرنا ہے، اور یہ حکمت (الحکمة) کی عطا ہے، پس یہ اس کے نام حکیم (الحکیم) سے ہے۔\n\nذات حق (الحق) کی سخاوت (السخاء) موسیٰ علیہ السلام کا یہ قول ہے:\n> رَبُّنَا الَّذِي أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ (ہمارا رب وہ ہے جس نے ہر چیز کو اس کی خلقت عطا کی) [القرآن ۲۰:۵۰]\n> وَكُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ (اور ہر چیز اس کے پاس ایک اندازے سے ہے) [القرآن ۱۳:۸]\n> وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ (اور اگر اللہ اپنے بندوں کے لیے رزق کشادہ کر دیتا تو وہ زمین میں سرکشی کرنے لگتے، لیکن وہ ایک اندازے سے نازل کرتا ہے جو وہ چاہتا ہے) [القرآن ۴۲:۲۷]\n> وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَّعْلُومٍ (اور ہم اسے صرف ایک معلوم اندازے کے ساتھ ہی نازل کرتے ہیں) [القرآن ۱۵:۲۱]\n\nاور بندے کی سخاوت (السخاء) یہ ہے کہ وہ ہر حقدار کو اس کا حق دے اور انصاف کرے۔ اس کے نفس کا اس پر حق ہے، اس کے اہل کا اس پر حق ہے، اس کی آنکھ کا اس پر حق ہے، اور اس کے مہمان کا اس پر حق ہے۔\n\n**فصل: ایثار (الإیثار)**\n\nایثار (الإیثار) کی صفت ذات حق (الحق) کے لیے نہیں ہے، مگر ایک بعید پہلو سے، اور اس کے ذکر میں سوءِ ادب ہے۔ بلکہ یہ حقیقت (حقیقة) نہیں ہے، لہٰذا اسے ترک کرنا اولیٰ ہے۔ اور اس طرف وہی گیا ہے جو اہل شطح (أهل الشطح) میں سے علم اور ادب سے خالی ہے۔\n\nپس ہم کہتے ہیں کہ ایثار (الإیثار) کسی محتاج کا دوسرے محتاج کو عطا کرنا ہو سکتا ہے، اور یہ ضرورت کی حالت میں (على الخصاصة) یا ضرورت کے ساتھ (مع الخصاصة) یا ضرورت کے وہم (توهم الخصاصة) کے ساتھ ہو سکتا ہے۔\n\nاور ذات حق (الحق) کی جانب سے ایثار (الإیثار) یہ ہے کہ وہ ہستی (الوجود) کا جوہر (الجوهر) کسی عرض (عرض) کو پیدا کرنے کے لیے عطا کرتا ہے تاکہ اس کے ایجاد سے ارادہ (الإرادة) کا تعقل ہو، نہ کہ محل (المحل) کے ایجاد سے۔ پس محل (المحل) تبعاً ضرورتاً موجود ہو جاتا ہے، کیونکہ عرض (العرض) کے وجود کی شرط محل (المحل) کا وجود ہے۔\n\nاور جوہر (الجوهر) اس چیز میں محتاج ہے جو ذات حق (الحق) نے اس میں عرض (العرض) کو پیدا کر کے اسے عطا کی، کیونکہ اس کا وجود کسی نہ کسی عرض (العرض) کے وجود کے بغیر نہیں ہو سکتا۔ اور یہ برابر ہے کہ جوہر (الجوهر) متحیز (جگہ گھیرنے والا) ہو یا غیر متحیز، اور کسی دوسرے کے ساتھ مرکب ہو یا غیر مرکب۔ پس یہ ضرورت کی حالت میں ضرورت کے ساتھ عطا کرنا ہے (عطاء على خصاصة مع خصاصة)۔\n\nاور غیر ضرورت کی حالت میں عطا کرنا (على غير الخصاصة) یہ ہے کہ بندہ الٰہی اسماء (الأسماء الإلهية) کے ساتھ تخلق (اخلاق اپنانا) میں متصف ہو، اور ذات حق (الحق) محدثات (المحدثات) کی صفات کے ساتھ نزول میں متصف ہو۔ اور یہ سب واقع ہے جس کا حکم ہستی (الوجود) میں ظاہر اور واضح ہو چکا ہے۔\n\n**فصل: صدقہ (الصدقة)**\n\nہم نے اس کا ذکر زکوٰۃ کے باب میں کیا ہے۔ اور یہاں یہ ذات حق (الحق) کا بندے پر صدقہ (الصدقة) ہے کہ وہ اس کے عین (عین) کو ہستی (الوجود) میں باقی رکھتا ہے، اور اسے ابتداءً ایجاد کرتا ہے، باوجود اس کے کہ وہ جانتا ہے کہ جب وہ اسے پیدا کرے گا تو وہ الوہیت کا دعویٰ کرے گا اور کہے گا:\n> أَنَا رَبُّكُمُ الْأَعْلَىٰ (میں تمہارا سب سے بڑا رب ہوں) [القرآن ۷۹:۲۴]\n\nاور علم (العلم) میں جو سبقت کر چکا ہے اس کی وجہ سے اس کا ایجاد ضروری ہے۔\n\nاور بندے کی طرف سے ذات حق (الحق) پر صدقہ (الصدقة) یہ ہے کہ بندہ اپنے نفس میں صورت کی عزت (عزة الصورة) پاتا ہے، اس کے باوجود وہ اللہ کی عزت (عزة الله) کے لیے عبودیت (العبودۃ) کا اقرار کرتا ہے۔\n\nاور یہ وہ محدث تعریفیں (المحامد المحدثة) بھی ہیں جو ظاہر ہوتی ہیں، جو اللہ کے لیے محدث (المحدث) کے وجود کے بعد ہی صحیح ہو سکتی ہیں، اور وہ ہر وہ چیز ہے جو اللہ کے سوا ہے۔\n\nاور اسے صدقہ (الصدقة) اس لیے کہا گیا کہ بندہ اپنے نفس میں اللہ کی تعریفوں میں مختار (ذو اختیار) ہے، کیونکہ اللہ تعالیٰ نے اس کے حق میں، جب اسے اس کی سعادت کا راستہ دکھایا، فرمایا:\n> إِمَّا شَاكِرًا وَإِمَّا كَفُورًا (خواہ شکر گزار ہو یا ناشکرا) [القرآن ۷۶:۳]\n\nپس وہ اپنے افعال میں اختیار رکھتا ہے، اسی لیے اس کی طرف سے قبول اور رد صحیح ہے، اور اسے سزا دی جاتی ہے اور ثواب دیا جاتا ہے۔ اور اسی پر اللہ تعالیٰ کی طرف سے اپنے بندوں کے لیے جزا (الجزاء) کی بنیاد قائم ہے۔\n\n**فصل: صلہ (الصلة) کی عطا**\n\nصلہ (الصلة) کی عطا حقاً اور خلقاً ذوی الارحام (رشتہ داروں) کے لیے ہے۔\n\nاللہ تعالیٰ فرماتا ہے:\n> الرَّحِمُ شِجْنَةٌ مِنَ الرَّحْمَنِ، مَنْ وَصَلَهَا وَصَلَهُ اللَّهُ، وَمَنْ قَطَعَهَا قَطَعَهُ اللَّهُ (رحم (رشتہ داری) رحمن سے نکلی ہوئی ایک شاخ ہے، جو اسے جوڑے گا اللہ اسے جوڑے گا، اور جو اسے کاٹے گا اللہ اسے کاٹ دے گا) [حدیث]\n\nپس اس کی نسبت ذات حق (الحق) سے وہی ہے جو اس کی نسبت بندے سے ہے۔ رحمن (الرحمن) ہمارے لیے رحم (رحم) ہے، اور ہم رحمن (الرحمن) کے لیے رحم (رحم) ہیں۔\n\n**فصل: ہدیہ (الھدیۃ) کی عطا**\n\nیہ بیان (بیان) کے ساتھ عطا کرنا ہے، اسی لیے یہ ہدیٰ (الھدیٰ) کے حروف میں شریک ہے، کیونکہ یہ ہدیٰ (الھدیٰ) کے ذریعے ہدیہ کیا جاتا ہے۔ ذات حق (الحق) کا بندے کے لیے ہدیہ (الھدیۃ) اس کا اپنا نفس ہے۔ اور بندے کا ذات حق (الحق) کے لیے ہدیہ (الھدیۃ) اس نفس کو ایک خلعت (خلعۃ) کے ساتھ اس کی طرف لوٹا دینا ہے جو اسے اپنے رب کی محبت عطا کرے:\n> فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ (پس میری پیروی کرو، اللہ تم سے محبت کرے گا) [القرآن ۳:۳۱]\n\n**فصل: ہبہ (الھبۃ) کی عطا**\n\nذات حق (الحق) کی طرف سے یہ عطا کرنا ہے تاکہ بندہ نعمت حاصل کرے، اس کے ساتھ جزاء (جزا) کا مطالبہ شامل نہیں ہوتا۔ اور بندے کی طرف سے یہ اس کا عمل ہے جو وہ حق ربوبیت (حق الربوبیۃ) کے لیے کرتا ہے، نہ کہ جزاء کے لیے۔\n\n**فصل: عوض کا طلب کرنا اور اسے ترک کرنا**\n\nعوض کا طلب کرنا: نبی صلی اللہ علیہ وسلم کا یہ قول:\n> حُبُّوا اللهَ لِمَا يَغْذُوكُمْ بِهِ مِنْ نِعَمِهِ (اللہ سے محبت کرو اس لیے کہ وہ تمہیں اپنی نعمتوں سے غذا دیتا ہے) [حدیث]\n\nاور:\n> وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ (اور میرے عہد کو پورا کرو، میں تمہارے عہد کو پورا کروں گا) [القرآن ۲:۴۰]\n\nاور بندے کی طرف سے یہ وہ جزاء ہے جو وہ اپنے عمل پر طلب کرتا ہے، جس کا اللہ نے اس سے وعدہ کیا ہے:\n> إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ (میرا اجر تو صرف اللہ کے ذمہ ہے) [القرآن ۱۰:۷۲]\n\n**فصل: عوض کا طلب ترک کرنا**\n\nذات حق (الحق) کی طرف سے یہ ہے کہ وہ خود ہی عامل (العامل) ہے، اور مالک (المالک) سے یہ تصور نہیں کیا جا سکتا کہ وہ اس چیز کا مطالبہ کرے جو اس کے پاس پہلے سے موجود ہے، کیونکہ حاصل شدہ چیز کی طلب نہیں کی جاتی۔\n\nاور بندے کی طرف سے یہ ہے کہ وہ اپنے آپ کو عامل (عاملا) نہیں دیکھتا، لہٰذا اس نے کوئی ایسا فعل نہیں کیا جس کے بدلے میں وہ اللہ سے عوض طلب کرے، کیونکہ اللہ نے اسے (عمل کی صلاحیت) اپنے نفس سے عطا کی ہے۔\n\n**[عطا مطلق (العطاء المطلق) اور عطا مقید (العطاء المقید)]**\n\nیہ محققہ فصول ہیں جن کے ذریعے ہم نے آپ کو اس امر کی حقیقت سے آگاہ کیا ہے۔ اور ان کی تفصیلات آپ کے سلوک (سلوک) کے دوران ہر آن (مع الآنات) آپ پر ظاہر ہوتی رہیں گی۔\n\nاور یہ سارا مقام الٰہی (إلهي) ہے جو خاص طور پر محسنین (المحسنین) کے لیے ہے۔ اور اس کا صاحب مجہول (مجهول) ہے، جو پہچانا نہیں جاتا، اور نکرہ (نکرۃ) ہے جو متعارف نہیں ہوتا۔\n\nپھر یہ عطا یا تو مطلق (مطلق) ہو گی یا مقید (مقید)۔\n\nپس جس نے ذات حق (الحق) کے ہاتھ سے عطا کیا، اس نے اسے مطلق (مطلق) کر دیا، لہٰذا اس کی عطا اللہ کے تمام بندوں کو شامل ہو گی، وہ کسی ایک عین (عین) کو دوسرے عین (عین) سے مخصوص نہیں کرے گا جو اس عطا کرنے والے کے لیے مناسب ہو۔\n\nمثال کے طور پر، اگر عطیات نقدی (نقود) ہوں تو وہ صرف اسے دے گا جو اس میں تصرف کی صلاحیت رکھتا ہو، اور وہ انسان ہے۔ اور اس میں چھوٹے، بڑے، مرد، عورت، امیر، غریب، مومن، کافر، عاقل یا مجنون کی شرط نہیں لگائے گا، بلکہ وہ اس عطا میں ہر حیوان پر مطلق رزق (مطلق الرزق) کی طرح ہے۔\n\nاسی طرح اگر وہ پہننے کی چیز ہو تو نقدی کی طرح ہی ہے، وہ اسے اس کے اہل کو دے گا۔ اور اگر وہ کھانے کی چیز ہو تو وہ ہر اس متغذی (کھانے والے) کو دے گا جو اس قسم کی غذا کھاتا ہو، خواہ حیوان ہو یا انسان۔ اور اس کے لیے کوئی اختیار یا تمیز نہیں ہے، بلکہ وہ پہلے شخص کے ساتھ ہے جس سے وہ ملتا ہے۔ اگر وہ اسے رد کر دے تو وہ دوسرے کو دے گا، اور اسی طرح جب تک اسے کوئی لینے والا نہ مل جائے۔\n\nاور یہ (عطا مطلق) صرف اسم رب (الرب) سے ربانیین (الربانیین) اور اسم رحمن (الرحمن) سے رحمانیین (الرحمانیین) کے لیے ہے۔ الٰہیین (الإلهيين) کا عطا مطلق (العطاء المطلق) میں کوئی دخل نہیں ہے۔\n\nاور اس عطا کا اثر ہر موجود (موجود) میں ظاہر ہے، میرا مطلب ہے اصناف (الأصناف) میں، نہ کہ موجودات کے افراد (آحاد أشخاص) میں۔ اور یہ محسن (المحسن) کی عطا ہے، نہ کہ مومن (المؤمن) کی اور نہ مسلم (المسلم) کی۔\n\nاور اگر عطا مقید (مقید) ہو تو وہ اس قید کے مطابق ہو گی جس سے اسے مقید کیا گیا ہے۔ پس اس کا حکم اس میں شرع (الشرع) کے حکم کی طرف لوٹتا ہے۔ وہ اولیٰ فالاولٰی (سب سے بہتر) عمل کرتا ہے، اور اس سے شروع کرتا ہے جس سے شارع (الشارع) نے اسے شروع کرنے کا حکم دیا ہے، اور وہ اسے تلاش کرتا ہے یہاں تک کہ اسے پا لے۔ اور اس حد پر صرف اسم اللہ (اللہ) سے الٰہی (الإلهي)، مومن (المؤمن)، محسن (المحسن)، مسلم (المسلم) ہی عطا کرتا ہے۔ اور اس عطا کا اثر بھی عام ہے۔",
    "fa": "(باب نود و پنجم در شناخت اسرار جود و انواع بخشش‌ها، مانند کرم، سخاوت، ایثار در حال نیاز و در غیر حال نیاز، صدقه، صله، هدیه، هبه، و طلب عوض و ترک آن)\n\nمراتب بخشش بسیار است و قابل شمارش نیست\nو به واسطه آن بر دشمنانمان یاری می‌جوییم\nبا جود (الجود) است که هستی ما در عین ما صحیح شد\nبلکه ما در حقیقت مظهر آن هستیم\n\n(فصل جود)\n\nوجود (الوجود) از جود (الجود) صادر شد. جود (الجود) با فتح جیم به معنای باران فراوان است و مقلوبِ \"وجد\" است، مانند \"جذب\" و \"جبذ\"؛ پس حروف آن‌ها یکی است و در معنا نیز مشترک هستند. متعلق جود (الجود) از جانب حق (الحق) در اعیان (الأعيان) که همان مظاهر (المظاهر) هستند، ظهور حق در آن‌هاست. و متعلق جود (الجود) از جانب مظاهر (المظاهر) بر ظاهر، چیزی است که مظهر با استعداد ذاتی خود از ثنای اسماء الهی بر حق بخشیده است؛ ثنایی که جود (الجود) آن را از وجود (الوجود) کسب کرده است. پس جود (الجود) از جانب حق (الحق) یک امتنان ذاتی است، و جود (الجود) از جانب اعیان (الأعيان) ذاتی است نه امتنان‌آمیز. این تفاوت میان دو جود (الجود) است و این همان معنای سخن آن‌ها درباره جود (الجود) است که می‌گویند: «بخشش پیش از درخواست است.»\n\n(فصل کرم)\n\nاما بخشش کرم (الکرم)، بخشش پس از درخواست است و بر دو نوع است: درخواست به حال و درخواست به گفتار (مقال). درخواست به حال از طریق کشف (الکشف) از هر دو طرف است، و درخواست به گفتار از جانب بنده معلوم است: «ای پروردگار، ای پروردگار، به من عطا کن، مرا بیامرز، به من رحم کن، مرا هدایت کن، به من روزی بده، جبران کن، عافیت بده، از من درگذر، مرا خوار مکن، مرا دچار فتنه مکن» و امثال آن. و درخواست حق (الحق) این است: «ادْعُونِي» (مرا بخوانید)، «أَقِمِ الصَّلاةَ لِذِكْرِي» (نماز را برای یاد من برپا دار)، «أَقِيمُوا الْوَزْنَ بِالْقِسْطِ ولا تُخْسِرُوا الْمِيزانَ» (وزن را به عدالت برپا دارید و در میزان کم نگذارید)، «فَلا تَكُونَنَّ من الْجاهِلِينَ» (پس از جاهلان مباش). و هر طلبی که از حق (الحق) تصور شود و آن را از بندگانش می‌طلبد، همه فرایض هستند. پس فرایض از کرم (الکرم) ادا می‌شوند و نوافل از جود (الجود) حاصل می‌گردند، مگر برای کسی مانند رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) که نوافل او نیز از جود (الجود) است و به فرایض ملحق می‌شود. و اینکه آن نافله است، خبری صادق است. خداوند متعال می‌فرماید: «ومن اللَّيْلِ فَتَهَجَّدْ به نافِلَةً لَكَ عَسى‏ أَنْ يَبْعَثَكَ رَبُّكَ مَقاماً مَحْمُوداً» (و پاسی از شب را با آن [قرآن] بیدار باش، که این نافله‌ای برای توست؛ باشد که پروردگارت تو را به مقامی ستوده برانگیزد).\n\n(فصل سخاوت)\n\nدر حدیث ابوبکر نقاش درباره مواقف قیامت، نام سخی بر خداوند وارد شده است و در این کتاب در باب بهشت ذکر شده است. اما بخشش سخاوت (السخاء)، بخشش به اندازه نیاز است و این بخشش حکمت است، پس از اسم حکیم (الحکیم) اوست. سخاوت (السخاء) حق (الحق) همان سخن موسی است: «رَبُّنَا الَّذِي أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ» (پروردگار ما کسی است که آفرینش هر چیزی را به آن عطا کرد) و «وكُلُّ شَيْ‏ءٍ عِنْدَهُ بِمِقْدارٍ» (و هر چیزی نزد او به اندازه‌ای است) و «ولَوْ بَسَطَ الله الرِّزْقَ لِعِبادِهِ لَبَغَوْا في الْأَرْضِ ولكِنْ يُنَزِّلُ بِقَدَرٍ ما يَشاءُ» (و اگر خداوند روزی را برای بندگانش گسترده می‌ساخت، قطعاً در زمین سرکشی می‌کردند، ولی به اندازه‌ای که بخواهد نازل می‌کند) و «وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ» (و ما آن را جز به اندازه‌ای معلوم نازل نمی‌کنیم). و اما سخاوت (السخاء) بنده، این است که حق هر صاحب حقی را به او بدهد و انصاف ورزد؛ پس نفس او بر او حق دارد، و خانواده‌اش بر او حق دارند، و چشمش بر او حق دارد، و مهمانش بر او حق دارد.\n\n(فصل ایثار)\n\nاما ایثار (الإيثار)، صفتی برای حق (الحق) از آن نیست، مگر به وجهی دور که ذکر آن سوء ادب است، بلکه آنچه حقیقت (الحقیقة) است، ترک آن اولی است. و تنها کسانی به آن روی آورده‌اند که از اهل شطح (الشطح) هستند و علم و ادب ندارند. پس بگوییم که ایثار (الإيثار) گاهی بخشش نیازمندی به نیازمند دیگر است، و گاهی در حال نیاز (الخصاصة) و همراه با نیاز یا توهم نیاز است. اما در جانب حق (الحق)، ایثار (الإيثار) این است که جوهر وجود (الوجود) را به خاطر خلق یک عرض از اعراض می‌بخشد تا اراده به ایجاد آن عرض تعلق گیرد، نه به ایجاد محل؛ پس محل به تبع آن و از روی ضرورت ایجاد می‌شود، زیرا شرط وجود عرض، وجود محل است، و جوهر نیازمند است. پس حق (الحق) به خاطر خلق عرض در آن، به جوهر عطا کرده است، زیرا جوهر وجودی ندارد مگر به وجود عرضی. و فرقی نمی‌کند که جوهر متحیز باشد یا غیر متحیز، و با غیر خود تألیف شده باشد یا تألیف نشده باشد. این بخشش در حال نیاز (خصاصة) و همراه با نیاز است. و اما ایثار (الإيثار) در غیر حال نیاز، عبارت است از متصف شدن بنده در تخلق به اسماء الهی، و متصف شدن حق (الحق) در نزولش به اوصاف پدیده‌ها (المحدثات). و این همه واقع شده و حکم آن در هستی (الوجود) ظاهر و آشکار گشته است.\n\n(فصل صدقه)\n\nما این را در باب زکات ذکر کردیم. صدقه (الصدقة) در اینجا تصدق حق (الحق) بر بنده است به ابقای عین او در هستی (الوجود) و به ایجاد او در ابتدا، با علم به اینکه اگر او را ایجاد کند، ادعای الوهیت خواهد کرد و خواهد گفت: «أَنَا رَبُّكُمُ الْأَعْلى‏» (من پروردگار برتر شما هستم). و به دلیل آنچه در علم (الهی) سبقت گرفته، ناگزیر باید او را ایجاد کند. و صدقه (الصدقة) از جانب بنده بر حق (الحق)، این است که بنده در نفس خود عزت صورت را می‌یابد و با این حال، به خاطر عزت خداوند، به عبودیت اقرار می‌کند. همچنین، صدقه (الصدقة) عبارت است از محامد پدید آمده‌ای که برای خداوند صحیح نیست مگر پس از وجود پدیده (المحدث)، و آن هر چیزی غیر از خداست. و این عمل صدقه (الصدقة) نامیده شد، زیرا بنده در محامد خداوند در نفس خود مختار است. چرا که خداوند متعال در حق او، هنگامی که راه سعادتش را برایش بیان کرد، فرمود: «إِمَّا شاكِراً وإِمَّا كَفُوراً» (یا شکرگزار است و یا ناسپاس). پس او در افعال خود دارای اختیار است و به همین دلیل قبول و رد از او صحیح است و عقاب و ثواب می‌بیند. و اصل جزا از جانب خداوند متعال برای بندگانش بر همین اساس استوار شده است.\n\n(فصل بخشش صله)\n\nاما بخشش صله (الصلة)، برای خویشاوندان است، هم از نظر حق (الحق) و هم از نظر خلق.\nخداوند متعال می‌فرماید: «الرحم شجنة من الرحمن من وصلها وصله الله ومن قطعها قطعه الله» (رحم شاخه‌ای از رحمان است؛ هر کس آن را وصل کند، خداوند او را وصل می‌کند و هر کس آن را قطع کند، خداوند او را قطع می‌کند).\nپس نسبت آن به حق (الحق)، مانند نسبت آن به بنده است؛ رحمان (الرحمن) برای ما رحم است و ما برای رحمان (الرحمن) رحم هستیم.\n\n(فصل بخشش هدیه)\n\nاین بخششی است که از روی بیان است و به همین دلیل در حروف با \"هدایت\" (الهدى) مشترک است، زیرا به واسطه هدایت (الهدى) هدیه داده می‌شود. هدیه (الهدية) حق (الحق) به بنده، نفس خود بنده است، و هدیه (الهدية) بنده به حق (الحق)، بازگرداندن آن نفس به سوی اوست با خلعت و لباسی که محبت پروردگارش را برای او کسب می‌کند: «فَاتَّبِعُونِي يُحْبِبْكُمُ الله» (پس از من پیروی کنید تا خداوند شما را دوست بدارد).\n\n(فصل بخشش هبه)\n\nهبه (الهبة) از جانب حق (الحق)، بخششی است برای نعمت دادن که طلب پاداش به آن ضمیمه نمی‌شود. و از جانب بنده، عمل او برای حق ربوبیت است، نه برای پاداش.\n\n(فصل و اما طلب عوض و ترک آن)\n\nسخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): «حبوا الله لما يغذوكم به من نعمه» (خداوند را دوست بدارید به خاطر نعمت‌هایی که شما را با آن‌ها تغذیه می‌کند).\nو «أَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ» (به عهد من وفا کنید تا من نیز به عهد شما وفا کنم). و طلب عوض از جانب بنده، همان پاداشی است که در مقابل عملش می‌طلبد و خداوند به او وعده داده است: «إِنْ أَجْرِيَ إِلَّا عَلَى الله» (پاداش من جز بر عهده خداوند نیست).\n\n(فصل و اما ترک طلب عوض)\n\nترک طلب عوض از جانب حق (الحق) به این دلیل است که او خود عامل است، و از مالک تصور نمی‌شود که اگر خود عامل باشد، چیزی را که نزد اوست طلب کند، زیرا آنچه حاصل است، جستجو نمی‌شود. و ترک طلب عوض از جانب بنده به این دلیل است که او خود را عامل نمی‌بیند، پس کاری انجام نداده است که به واسطه آن عمل، از خداوند عوضی طلب کند، زیرا خداوند آن را از نفس خود به او عطا کرده است.\n\n[بخشیدن مطلق و بخشیدن مقید]\n\nاین‌ها فصول محققه‌ای هستند که شما را به آنچه امر بر آن است آگاه ساختیم، و تفصیلات آن‌ها در نفس سلوک شما در لحظات (الآنات) بر شما آشکار خواهد شد. و این همه مقام الهی است، به ویژه در نیکوکاران (المحسنين)، و صاحب آن مجهول است و شناخته نمی‌شود، و نکره‌ای است که تعریف نمی‌گردد. سپس این بخشش (العطاء) ناگزیر باید مطلق یا مقید باشد. کسی که با دست حق (الحق) عطا کند، آن را مطلق می‌سازد، پس بخشش او همه بندگان خدا را در بر می‌گیرد و هیچ عینی را از عین دیگر تخصیص نمی‌دهد، در آنچه برای آن بخشنده مناسب است. مثلاً اگر بخشش از نقود (پول) باشد، آن را جز به کسی که تصرف در آن را دارد، یعنی انسان، نمی‌دهد. و در آن شرط نمی‌کند که کوچک باشد یا بزرگ، مرد باشد یا زن، غنی باشد یا فقیر، مؤمن باشد یا کافر، عاقل باشد یا دیوانه؛ بلکه او در این بخشش مانند کسی است که روزی را بر هر حیوانی مطلق می‌سازد. و همچنین اگر بخشش از پوشیدنی‌ها باشد، مانند نقود، آن را به اهلش می‌دهد. و اما اگر خوردنی باشد، آن را به هر متغذی‌ای می‌دهد که آن نوع غذا را می‌خورد، چه حیوان باشد و چه انسان. و او در این کار اختیار و تمییزی ندارد، بلکه با اولین کسی که ملاقات می‌کند، شروع می‌کند. اگر آن شخص آن را رد کرد، به دومی می‌دهد و همین‌طور تا زمانی که کسی را بیابد که آن را از او بگیرد. و این جز برای ربانیون (الربانيين) از اسم رب (الرب) و رحمانیون (الرحمانيين) از اسم رحمان (الرحمن) رخ نمی‌دهد، و الهیون (الإلهيين) را در بخشش مطلق (العطاء المطلق) مدخلی نیست. و اثر این بخشش در هر موجودی ظاهر است، و من استثنا نمی‌کنم، یعنی در اصناف، نه در آحاد اشخاص موجودات. و این بخشش نیکوکار (المحسن) است، نه مؤمن و نه مسلمان. و اما اگر بخشش مقید (العطاء المقيد) باشد، بر حسب قیدی است که به آن مقید شده است. پس حکم آن به حکم شرع در آن باز می‌گردد، و او اولی را بر اولی عمل می‌کند و با کسی شروع می‌کند که شارع به او امر کرده است که با او شروع کند و به دنبال او می‌گردد تا او را بیابد. و بر این حد، جز الهی (الإلهي) از اسم الله (الله)، مؤمن (المؤمن)، نیکوکار (المحسن)، و مسلمان (المسلم) عطا نمی‌کند. و اثر این بخشش نیز عام است."
  },
  "page_count": 2
}