{
  "id": 208,
  "title": {
    "ar": "الباب الثامن ومائتان في حال الانزعاج",
    "en": "Chapter Two Hundred and Eight: Concerning the State of Agitation (الانزعاج)",
    "ur": "دو سو آٹھواں باب: بے چینی کی حالت کے بیان میں",
    "fa": "باب دویست و هشتم در بیان حال بی‌قراری (الانزعاج)"
  },
  "content": {
    "ar": "## «الباب الثامن ومائتان في حال الانزعاج»\n\n\n> إذا انتبه القلب السليم من النوم *** تحرك تحريك انزعاج من الوجد\n\n\n> إلى طلب الأنس الذي قد أقامه *** فأول ما يلقي التحقق بالزهد\n\n\n> فيدعي بعبد وهو سيد وقته *** وشتان ما بين السيادة والعبد\n\n\n> فيفني به عنه ليبقى بربه *** نزيها عن الفصل المقوم والحد\n\n\n> مع الحد للعهد الذي كان بينهم *** وذلك برهان على كرم الود\n\n\n### [الانزعاج حال انتباه القلب من سنة الغفلة والتحرك للانس والوجد]\n\n\nاعلم أن الانزعاج عند الطائفة حال انتباه القلب من سنة الغفلة والتحرك للانس والوجد فالانزعاج حكم العلة على هذا أي العلة أورثته هذا الانزعاج وهو اندفاع النفس من حال صح لها إلى أصلها الذي خرجت عنه لأنه من ذلك الأصل دعاها والأصل طاهر فهو اندفاع بشهوة شديدة وقوة ولهذا الانزعاج أسباب مختلفة فمنهم من تزعجه الرغبة ومنهم من تزعجه الرهبة ومنهم من يزعجه التعظيم فأما انزعاجه للانس والوجد فقد يكون فهما وقد يكون لقاء وقد يكون إلقاء وقد يكون تلقيا فمن ذلك ما يكون عن خاطر إلهي وعن خاطر ملكي وعن خاطر شيطاني وعن خاطر نفسي ولكن لا يكون لهذا الولي عن النفس والشيطان إلا بفهم يرزقه الله فيه عناية من الله لا إن الشيطان له عليه سلطان بل الشيطان في خدمته وهو لا يشعر وساع بما يلقي إليه في سره في ارتقاء درجة هذا الولي من حيث لا يعلم الشيطان وهذا من مكر الله الخفي بإبليس لأنه يسعى في ترقي درجات العارفين من حيث يتخيل أنه ينزلهم عنها وإذا كان الأمر على هذا فلنقل إن حال العلة إذا تحقق في العبد أظهر في النفس انزعاجا ولا بد وانزعاجه أولا إنما هو ليفارق الحال التي كان عليها لما كشف الله عن بصيرته بالعلة فرأى نفسه في محل البعد فانزعج لذلك رغبة في مفارقة ذلك الموطن من غير تعيين حضرة من حضرات القرب فإذا فارق ذلك الموطن بقدم واحدة وزال عن شهوده أخذ نفسه ساعة واستراح وهو ما يجده المريد من اللذة وحلاوة التوبة التي تهون عليه ركوب الشدائد وتسهل عليه صعوبة طريقه يجد كل أحد هذا من نفسه في هذا الحال لا يقدر على إنكاره فإذا فارق موطن المخالفة بانزعاجه واستراح حينئذ يتهدى على نفسه ويفتح عينيه ويعلم أنه قد تخلص مما كان فيه فحينئذ يقوم له ما يؤثر عنده الانزعاج إليه فأول الانزعاج أبدا في هذا الطريق إنما هو منه وفي ثاني حال يظهر حكم الانزعاج إليه فإن أقيم له في أول نظرة ما يستحقه جلال الله من التعظيم أو كان هذا الرجل ممن تقدم له العلم بالله من حيث الأدلة النظرية فيكون انزعاجه تعظيما لله لا رغبة فيما عنده بل ينزعج لأداء حق ما تعين عليه لله تعالى وما تعطيه مرتبة العبد من سيده فما هو مشغول بما ينعم عليه ويرغبه فيه من لذات نفسه بل يرى ما لله عليه من الحقوق فيجهد نفسه في أداء ذلك وهو قوله اتَّقُوا الله حَقَّ تُقاتِهِ‏\nفيعلم أن أحدا لا يطيق ذلك وأن قدر الله أجل وأعلى وأنزه أن يقدره أحد فيؤديه ذلك إلى النظر في نفسه وما آتاه الله من القوة في ذلك لما علم أن قدر الله ليس في وسع المخلوق القيام به وسمع الله يقول لا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها وقال إِلَّا ما آتاها وقال ما اسْتَطَعْتُمْ فانزعج إلى القيام بحق الله على قدر الاستطاعة وما في وسعه ويتفاضل عباد الله في ذلك على نوعين على قدر ما يكشف لهم من جلال الله وعلى قدر أمزجتهم فإن الله قد جعل نفس الإنسان وعقله بحكم مزاج جسده فإن نفس الإنسان لا تدرك شيئا إلا بوساطة هذه القوي التي ركب الله في هذه النشأة فهي للنفس كالآلة فإن كانت الآلة مستقيمة على الوزن الصحيح ظهر حسن الصنعة بها إذا كانت النفس عالمة بالصنعة وعلمهم على قدر ما يكشف لهم الحق من ذلك في سرائرهم فمنهم من يكشف له فيما تطلبه الذات ومنهم من يكشف له فيما تطلبه الأسماء من حيث الدلالات النظرية ومنهم من يكشف له فيما تطلبه الأسماء من حيث ما جاءت به الشرائع من المقابل والمقارن فمنهم من يقام على رأس الستين ألفا من المنازل الإلهية ومنهم من يقام على رأس مائة ألف وعشرين ألفا من هذه المنازل ومنهم من يقام على رأس تسعين ألفا منحصرة في ستة مقامات لا سابع لها ولا يشارك عبد في شي‏ء من هذه المنازل بل يكون فيها كل إنسان منفردا وهو قول الطائفة إن الله لا يتجلى في صورة واحدة لشخصين قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ فهم وإن اجتمعوا في العدد فما لهم اجتماع في الذوق لأنهم لم يجتمعوا في المزاج ولو اجتمعوا في المزاج وهو محال ما تميزوا ولكان العين واحدة وثم موطن يعطي الظهور في صاحب المنزل الذي كان على رأس الستين ألفا خلاف هذا وهو في تلك الدرجة عينها فيكون له بدل الستين ألفا عدد آخر يكون مبلغه ثلاثة آلاف ألف وبكون لصاحب التسعين ألفا أربعة ألف ألف وخمسمائة ألف ويكون لصاحب المائة ألف وعشرين ألفا ستة آلاف ألف وهذا لا يكون إلا لأهل الصعود الذين قال الله فيهم إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وكل من أسرى به سواء كان إسراء روحانيا أو بالجسم فإن له من المنازل هذا العدد الكثير وأما العدد الذي هو أقل منه فذلك للمريدين الذين هم في مقام التربية لا غير وأما حصرهم في ستة لا غير فمن طريقين الطريقة الواحدة نشأتهم القائمة على ست جهات يأتي الشيطان من الأربعة منها وتبقي الاثنان لا سبيل للشيطان عليهما ومن هناك يكون مال الناس إلى عموم الرحمة وشمولها لهاتين الجهتين وأما الستة المعنوية فالصفات الستة التي هي النسب الإلهية التي يتعلق الممكن بها والنسبة السابعة ما هي متوجهة على الممكن وإنما ظهرت لصحة هذه الستة خاصة لا لأمر آخر وهي نسبة كونه حيا إذ بهذه النسبة ثبتت الستة ولما كانت الحدود تحفظ الأشياء ولا سيما الحدود الذاتية جعلت خمسة لما كانت الخمسة لها الحفظ فاتسعت الحدود فأعطيت الحدود مقام الخمسة ولتكون الأعيان تامة كاملة النشأة ما فيها نقص وهذا كله إذا لاح للعبد على بعد انزعج إلى طلبه ليحصله إذ كان فيه تعظيم جناب الحق الذي هو مقصود هذا العبد فهذا حكم من أزعجه التعظيم وأما حكم من أزعجته الرغبة فيما عند الله فإن مشهده وما عِنْدَ الله خَيْرٌ وأَبْقى‏ ومشهد صاحب التعظيم والله خَيْرٌ وأَبْقى‏\n\n\n### [انزعاج الرغبة بحسب ما تعشق به ورغب فيه‏]\n\n\nفاعلم أن انزعاج الرغبة بحسب ما تعشق به ورغب فيه وهو على نوعين متخيل وغير متخيل والمتخيل على نوعين النوع الواحد ما أدركه ببعض حواسه أو بجملتها أو أدركه من طريق الخبر فحمله على المعهود من صفة الجنة وما فيها وغير المتخيل هو ما رغبة فيه من حيث الإجمال وهو ما تحوي عليه الجنة أو تتضمنه مما لا عين رأته ولا أذن سمعته ولا خطر على قلب بشر فقد سمع أن فيها هذا فمثل هذا لا يمكن تخيله فكلما تخيله فقد خطر على قلب بشر فليس ذلك ومن طبع النفس إنها تحب أن تعلم ما لم تكن تعلم فهي تحب المزيد بالطبع إلا أنه يختلف تعلقها بما تستزيد منه فالذي تتعشق به منه تطلب المزيد لا من غيره فإن كان الراغب صاحب محبة لله فلا يخلو إما أن يكون عالما بالله أو غير عالم بالله من المحال أن يكون غير عالم بالله لأنه محب والمحب يطلب بذاته محبوبا يتعلق به من قام به حتى يسمى محبا فلا بد أن يكون عالما به غير أن العلماء به على مراتب منهم مؤمنون خاصة فعلموه من جهة الخبر والأخبار متقابلة فحار المحب فلم ينضبط له صورة في محبوبه ومنهم من رجح في الخبر ما أعطاه الخيال فأحب محدودا متصورا تعلق به فمثل هذا يزعجه طلب الوجد والأنس والوصال والرؤية والحديث على الطريقة المعهودة في الأشكال والأجناس‏\nوهو يتجلى فيها ومنهم العلماء به من حيث التجلي بالعلامة فهم فيه بحسب علامتهم ومنهم العلماء به عن نظر فكري فلا يقيدوه ويؤمنوا بكل تجل يعطي التقييد والتحديد فيفوتهم من الله خير كثير فمحبوبهم أقرب إليهم من حَبْلِ الْوَرِيدِ ولكن لا يعلمون أنه هو فمحبوبهم لا يزال ظاهرا لهم وهم لا يعرفونه وهذه الطائفة على نوعين طائفة تقول إنا نطمع أن نرى محبوبنا وطائفة تقول محال رؤية محبوبنا لكن ليس بمحال علمنا به إذ ليست الرؤية مطلوبة لذاتها وإنما هي طريق إلى حصول علم عند الرائي بالمرئي فبأي وجه حصل فهو ذاك وقد علمناه ومن علمنا به أن رؤيته من حيث إدراك البصر محال فيئسوا من ذلك فهم في نعيم الياس والآخرون في نعيم الطمع فالطائفتان يجتمعان في الانزعاج للفهم عنه تعالى مما خاطبهم به في المسمى قرآنا أو حديثا نبويا أو مما ظهر في العالم من آثار القدرة المؤدية إلى عظمته وكبريائه ولطفه وحنانه كل آية وسورة وصورة بما تعطي فيتفاضلون في الفهم فيطلبون المزيد من العلم وهم الأكابر ومنهم من يقول قد رويت فلا يطلب المزيد ورأيت منهم جماعة وهم أجهل الطوائف ورأيت أئمة من الأشاعرة على هذه القدم يرون أنهم يعرفون الله كما يعلم نفسه سبحانه من غير مزيد فهؤلاء مستريحون بجهلهم قد يئسنا من فلاحهم ويجتمعان أيضا في الانزعاج إلى اللقاء فمنهم من ينزعج إلى لقائه ومنهم من ينزعج إلى لقاء ما يريد منه ويجتمعان أيضا في الانزعاج إلى الإلقاء وإلى التلقي وينقسمون في ذلك على أقسام فمنهم المتلقي عموما وهو الكبير من الرجال ومنهم المتلقي من الملك ومن الله المعرض عما يجي‏ء به غير الخاطر الإلهي وغير الملك ومنهم من يتلقى الخاطر النفسي مضافا إلى هذين الخاطرين ومنهم من يرجح تلقي الخاطر الشيطاني على الملكي والنفسي لكونه مقابلا لأنه إلقاء عدو محض فيلقي خلاف الحق فيريد هذا المتلقي أن يقف على خلاف الحق من حيث ما هو خلاف عند الشيطان ولهذا ألقاه وهذا المتلقي حق كله لأنه نور كله بل هو عين النور فيعرف أن إبليس جهل ما عنده من الحق حيث تخيل أنه ليس بحق فأخذه هذا المتلقي حقا من صورة شيطانية فلم يحصل ما أعطاه الشيطان في صورة ملك ولا في صورة نفس إنسانية وزال حكم الشيطان منه حين قبله هذا المتلقي فإن الشيطان يظن أنه لوهمه أن الذي ألقى إليه أمري وجود وهو عدم عند الشيطان وما علم مرتبة هذا المتلقي وأنه ما تلقى منه إلا أمرا وجوديا فإذا رآه قد تعشق به عند أخذه ولم ير له انحطاط مرتبة ولا أثر جهل تعجب ونظر من أين أتى عليه في أمره وما الذي صير ذلك المعدوم موجودا فعلم أن الجهل إنما قام به لا بالمتلقي وأنه هو الذي ألقى إليه الأمر الوجودي على أنه موهوم الوجود لا محقق فرأى أنه قد سعى في مزيد علو رتبته بما أفاده من العلم وهو لا يريد ذلك بل قصد ما يليق به فما علم أنه لعنه الله محل للوجود وإنما تخيل أنه محل لإيهام الوجود لا لتحققه فيكون هذا المتلقي في هذا التلقي خلاقا وهذا أكمل مراتب الأخذ في التلقي‏\n\n\n### [انزعاج الرهبة]\n\n\nوأما انزعاج الرهبة فمثل الرغبة إما رهبة منه وهوقوله وأعوذ بك منك‏\n\n\nوإما رهبة مما يكون منه من عذاب حسي أو عذاب حجاب وهو عذاب الجهل أو التزين وليس في الحجب أكثف ولا أقوى من حجاب التزين لأن من زين له جهله فمن المحال طلب الحاصل في زعمه لأنه حاصل عنده وليس بحاصل في نفس الأمر فمن أراد أن يعتصم من التزين فليقف عند ظاهر الكتاب والسنة لا يزيد على الظاهر شيئا فإن التأويل قد يكون من التزين فما أعطاه الظاهر جرى عليه وما تشابه منه وكل علمه إلى الله وآمن به فهذا متبع ليس للتزين عليه سبيل ولا يقوم عليه حجة عند الله فإن كان من أهل البصائر فهو يدعو إلى الله على بصيرة ويتكلم على بصيرة فقد بري‏ء من التزين فهو صاحب علم صحيح وكان من أهل الزينة لا من أهل التزين فالانزعاج إلى الله قد يكون رهبة من هذا أيضا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n«بسم الله الرحمن الرحيم»\n\n",
    "en": "The Two Hundred and Eighth Chapter Concerning the State of Agitation [al-Inzi‘aj]\n\nWhen the sound heart awakens from sleep,\nIt moves with the agitation born of spiritual finding [al-Wajd].\nSeeking the intimacy [al-Uns] that He established for it,\nThe first thing it encounters is the realization of asceticism [al-Zuhd].\nHe claims to be a servant [‘abd] while he is the master [sayyid] of his time,\nYet vast is the difference between mastery and servitude.\nHe is annihilated [fanā’] by Him, away from himself, that he may subsist [baqā’] by his Lord,\nUntainted by the defining separation or the limit.\nYet maintaining the limit for the covenant [al-‘Ahd] that was between them,\nAnd that is a proof of the nobility of the affection [al-Wudd].\n\n### [Agitation is the state of the heart awakening from the slumber of heedlessness and moving toward intimacy and finding]\n\nKnow that Agitation [al-Inzi‘aj], according to the Sufi community [al-Ṭā’ifa], is the state of the heart awakening from the slumber of heedlessness [ghafla] and moving toward Intimacy [al-Uns] and Spiritual Finding [al-Wajd]. Agitation is thus the ruling of the cause [al-‘illa] upon this state—meaning, the cause bequeathed this agitation to it. It is the soul’s impulse away from a state that was healthy for it, back toward its origin from which it emerged, because it was called from that origin, and the origin is pure. It is an impulse driven by intense desire and strength.\n\nThis agitation has various causes: some are agitated by desire [al-raghba], some by awe [al-rahba], and some by veneration [al-ta‘ẓīm]. As for the agitation toward Intimacy and Finding, it may be understanding [fahm], or meeting [liqā’], or inspiration [ilqā’], or reception [talaqqī]. This may arise from a Divine thought [khāṭir ilāhī], an angelic thought [khāṭir malakī], a satanic thought [khāṭir shayṭānī], or a psychic thought [khāṭir nafsī].\n\nHowever, for this saint [walī], the agitation arising from the psychic or satanic thought only occurs through an understanding granted to him by Allah, which is a Divine providence. It is not that Satan has authority over him; rather, Satan is in his service without realizing it, striving through what he casts into the saint’s secret consciousness [sirr] to elevate the saint’s degree, without Satan knowing it. This is part of Allah’s subtle cunning [makr] against Iblīs, for he strives to elevate the degrees of the Gnostics [al-‘ārifīn] while imagining that he is lowering them.\n\nIf the matter is thus, let us say that when the state of the cause is realized in the servant, it inevitably manifests agitation in the soul. His initial agitation is only so that he may depart from the state he was in when Allah unveiled his insight [baṣīra] through the cause. He saw himself in a place of distance [bu‘d], and thus became agitated, desiring to leave that station without specifying any particular Divine Presence [Ḥaḍra] of Proximity.\n\nWhen he departs from that station with a single step and it vanishes from his witnessing [shuhūd], he takes a moment to rest and recover. This is the pleasure and sweetness of repentance [tawba] that the seeker [murīd] finds, which makes enduring hardships easy for him and smooths the difficulty of his path. Everyone finds this within himself in this state and cannot deny it.\n\nWhen he departs from the station of opposition [mukhālafa] through his agitation and rests, he then guides himself, opens his eyes, and knows that he has been delivered from what he was in. At that point, that which causes him to be agitated toward it arises for him. The first agitation on this path is always *from* himself, and in the second state, the ruling of agitation *toward* Him manifests.\n\nIf, in his first glance, he is established in the veneration [ta‘ẓīm] that is due to the Majesty [Jalāl] of Allah, or if this man is one who previously attained Knowledge [al-‘Ilm] of Allah through theoretical proofs [al-adilla al-naẓariyya], then his agitation is for the sake of venerating Allah, not out of desire for what is with Him. Rather, he is agitated to fulfill the right [ḥaqq] that has become incumbent upon him toward Allah the Exalted, and what the degree of the servant requires of his Master [Sayyid]. He is not preoccupied with the blessings bestowed upon him or the pleasures of his soul that He makes desirable to him. Instead, he sees the rights that Allah has over him and strives to fulfill them. This is the meaning of the verse: <<اتَّقُوا الله حَقَّ تُقاتِهِ>> (Fear Allah with the fear due to Him).\n\nHe knows that no one can bear that fully, and that Allah’s measure [qadr] is too majestic, too high, and too pure for anyone to measure it. This leads him to look at himself and the strength Allah has given him in that regard, since he knows that Allah’s measure is beyond the capacity of the created being to fulfill. He hears Allah say: <<لا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها>> (Allah does not charge a soul except with what is within its capacity), and He said: <<إِلَّا ما آتاها>> (except what He has given it), and He said: <<ما اسْتَطَعْتُمْ>> (what you are able to do).\n\nThus, he is agitated toward fulfilling Allah’s right according to his ability and capacity. The servants of Allah differ in this based on two types: according to the measure of Allah’s Majesty unveiled to them, and according to the measure of their temperaments [amzija]. For Allah has made the human soul and intellect subject to the ruling of the body’s temperament. The human soul does not perceive anything except through the mediation of these faculties [quwā] that Allah installed in this phenomenal existence [nash’a]. These faculties are like tools for the soul. If the tool is straight and of the correct measure, the beauty of the craft appears through it, provided the soul is knowledgeable of the craft. Their knowledge is proportional to what the Real [al-Ḥaqq] unveils to them of that in their innermost secrets [sarā’ir].\n\nAmong them are those to whom unveiling occurs regarding what the Essence [al-Dhāt] demands; and among them are those to whom unveiling occurs regarding what the Names [al-Asmā’] demand from the perspective of theoretical indications; and among them are those to whom unveiling occurs regarding what the Names demand from the perspective of the corresponding and the juxtaposed as brought by the Divine Laws [al-Sharā’i‘].\n\nAmong them are those established at the head of sixty thousand Divine stations [manāzil]; and among them are those established at the head of one hundred and twenty thousand of these stations; and among them are those established at the head of ninety thousand, confined within six spiritual ranks [maqāmāt] with no seventh. No servant shares in any of these stations; rather, every person is solitary within them. This is the saying of the Sufi community: that Allah does not disclose Himself [yatajallā] in one form to two people. <<قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ>> (Each group has known its drinking place). Even if they agree in number, they do not agree in taste [dhawq], because they do not agree in temperament [mizāj]. If they were to agree in temperament—which is impossible—they would not be distinct, and the entity [al-‘ayn] would be one.\n\nThere is a station that grants a manifestation to the possessor of the station of sixty thousand, which is contrary to this, yet it is in the very same degree. For him, instead of sixty thousand, there is another number whose total is three million. And for the possessor of ninety thousand, the total is four million five hundred thousand; and for the possessor of one hundred and twenty thousand, the total is six million. This only occurs for the People of Ascent [Ahl al-Ṣu‘ūd], concerning whom Allah said: <<إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ>> (To Him ascends the good word). Everyone who is taken on a night journey [isrâ’], whether a spiritual journey [isrâ’ rūḥānī] or a physical one, possesses this great number of stations. As for the number that is less than this, that belongs only to the seekers [murīdūn] who are in the station of spiritual training [tarbiya].\n\nAs for confining them to six and no more, this is from two perspectives. The first perspective is their phenomenal existence [nash’a] which stands upon six directions: Satan approaches from four of them, leaving two directions over which Satan has no path. From this comes the inclination of people toward the universality and comprehensiveness of Mercy [al-Raḥma] in these two directions. As for the six conceptual [ma‘nawiyya] aspects, they are the six Attributes [al-Ṣifāt] which are the Divine relations [nisab] to which the contingent being [al-mumkin] relates. The seventh relation is not directed toward the contingent being; rather, it appeared specifically for the validity of these six and for no other reason. This is the relation of His being Living [Ḥayy], for by this relation the six are established.\n\nSince limits [ḥudūd] preserve things, especially essential limits [ḥudūd dhātiyya], they were made five, because the number five possesses preservation. Thus, the limits expanded and were given the rank of five, so that the Fixed Entities [al-A‘yān al-Thābita] might be perfect and complete in their phenomenal existence, without defect. All of this, when it appears to the servant from afar, causes him to be agitated toward seeking it in order to attain it, since it involves the veneration of the Divine Presence of the Real [al-Ḥaqq], which is the goal of this servant. This is the ruling for one agitated by veneration. As for the ruling for one agitated by desire [al-raghba] for what is with Allah, his witnessing [mashhad] is <<وما عِنْدَ الله خَيْرٌ وأَبْقى>> (And what is with Allah is better and more lasting). The witnessing of the possessor of veneration is: And Allah is better and more lasting.\n\n### [Agitation of desire according to what one loves and desires]\n\nKnow that the agitation of desire is according to what one loves and desires, and it is of two types: imagined [mutakhayyal] and non-imagined [ghayr mutakhayyal]. The imagined type is also of two kinds. The first kind is what he perceives through some or all of his senses, or what he perceives through transmitted reports [khabar] and interprets according to the familiar descriptions of Paradise [al-Janna] and what is in it. The non-imagined type is what he desires in general terms, which is what Paradise encompasses or contains, of that which no eye has seen, nor ear heard, nor has occurred to the heart of man. He has heard that this exists therein, but such a thing cannot be imagined [takhayyul]. For whatever he imagines has already occurred to the heart of man, so it is not that.\n\nIt is the nature of the soul that it loves to know what it did not know; thus, it naturally loves increase [mazīd]. However, its attachment to that from which it seeks increase differs. It seeks increase from that which it loves passionately, not from anything else. If the desirer is a possessor of love [maḥabba] for Allah, he must be either knowledgeable of Allah or ignorant of Allah. It is impossible for him to be ignorant of Allah, because he is a lover [muḥibb], and the lover inherently seeks a beloved to whom the one who stands by Him relates, so that he may be called a lover. Therefore, he must be knowledgeable of Him.\n\nHowever, those knowledgeable of Him are of different ranks. Among them are the believers [mu’minūn] specifically, who know Him through transmitted reports. Since the reports are sometimes contradictory, the lover becomes confused, and no fixed image of his Beloved is established for him. Among them are those who prioritize in the report what their imagination [al-khayāl] provides, so they love a limited, conceived object to which they attach themselves. Such a person is agitated by the search for Finding [al-Wajd], Intimacy [al-Uns], Union [al-Wiṣāl], Vision [al-Ru’ya], and conversation, according to the familiar manner of forms and kinds. And He discloses Himself [yatajallā] within those forms. Among them are those who know Him through the Theophany [al-Tajallī] of the sign [al-‘alāma]; thus, their knowledge of Him is according to their sign.\n\nAnd among them are those who know Him through intellectual speculation [naẓar fikrī]. They do not restrict Him and believe in every Theophany that implies restriction and limitation, thereby missing much good from Allah. Their Beloved is closer to them than <<حَبْلِ الْوَرِيدِ>> (the jugular vein), but they do not know that it is He. Their Beloved is constantly manifest to them, yet they do not recognize Him.\n\nThis group is of two types: one group says, \"We hope to see our Beloved,\" and another group says, \"The vision of our Beloved is impossible, but our knowledge of Him is not impossible.\" For vision is not sought for its own sake; rather, it is a path to the attainment of knowledge by the viewer concerning the object seen. By whatever means that knowledge is attained, that is it, and we have known Him. Part of our knowledge of Him is that His vision, in terms of ocular perception, is impossible. They despair of that, and thus they are in the bliss of despair. The others are in the bliss of hope.\n\nBoth groups agree in their agitation toward understanding [fahm] from Him, the Exalted, concerning what He addressed them with, whether called the Qur’an, or a Prophetic tradition [ḥadīth nabawī], or what has appeared in the cosmos [al-‘ālam] of the traces of Power [al-Qudra] leading to His Greatness, His Majesty, His Kindness, and His Compassion—every sign [āya], chapter [sūra], and form [ṣūra], according to what it conveys. They discuss understanding and seek increase in Knowledge [al-‘Ilm]; these are the great ones [al-akābir]. Among them are those who say, \"I have been quenched,\" and do not seek increase. I have seen a group of them, and they are the most ignorant of all groups. I have seen Imams of the Ash‘arites [al-Ashā‘ira] upon this footing, believing that they know Allah just as He knows Himself, the Glorified, without any increase. These people are resting in their ignorance, and we have despaired of their success.\n\nThey also agree in their agitation toward meeting [al-liqā’]. Among them are those agitated toward meeting Him, and among them are those agitated toward meeting what He desires from them. They also agree in their agitation toward Inspiration [al-Ilqā’] and toward Reception [al-Talaqqī], and they are divided into categories regarding this. Among them is the one who receives generally, and he is the great man [al-kabīr min al-rijāl]. Among them is the one who receives from the Angel [al-Malak] and from Allah, turning away from anything that comes through other than the Divine thought [al-khāṭir al-ilāhī] and the Angel. And among them is the one who receives the psychic thought [al-khāṭir al-nafsī] in addition to these two thoughts.\n\nAnd among them is the one who prefers receiving the satanic thought [al-khāṭir al-shayṭānī] over the angelic and psychic thoughts, because it is an opposite. Since it is the pure inspiration of an enemy, it casts forth the opposite of the Real [al-Ḥaqq]. This receiver desires to grasp the opposite of the Real precisely because it is the opposite in Satan’s view, and that is why he cast it. This receiver is entirely Real [Ḥaqq], because he is entirely Light [Nūr]; indeed, he is the very essence of Light. He knows that Iblīs was ignorant of the Reality that was with him, since he imagined it was not Real. So this receiver took it as Reality from a satanic form. What Satan gave did not occur in the form of an angel or in the form of a human soul, and the ruling of Satan vanished from it when this receiver accepted it.\n\nFor Satan thinks that he is deluding him, believing that what he inspired was a matter of existence [wujūd] which, in Satan’s view, is non-existence [‘adam]. He did not know the rank of this receiver, and that he received from him nothing but a matter of existence. When he saw that the receiver passionately loved it upon taking it, and saw no degradation in his rank or trace of ignorance, he was astonished. He looked to see where he had been overcome in his affair, and what had made that non-existent thing existent. He realized that ignorance resided only in himself, not in the receiver, and that he was the one who had cast the existent matter to him, believing it to be illusory existence [mawhūm al-wujūd], not verified existence [muḥaqqaq]. Thus, he saw that he had striven to increase the receiver’s rank through the knowledge he imparted, though he did not intend that, but rather intended what was appropriate for himself. He did not know—may Allah curse him—that he is a locus for Existence; rather, he imagined he was a locus for the illusion of Existence, not its verification. Thus, this receiver, in this reception, is a creator [khallāq]. This is the most perfect rank of taking in reception.\n\n### [Agitation of Awe]\n\nAs for the agitation of awe [al-rahba], it is like desire [al-raghba]. It is either awe *of* Him, which is the meaning of the saying: \"And I seek refuge in You from You.\" Or it is awe of what may come from Him, whether sensory punishment [‘adhāb ḥissī] or the punishment of veiling [‘adhāb ḥijāb], which is the punishment of ignorance [al-jahl] or self-adornment [al-tazayyun]. Among the veils [al-ḥujub], there is none denser or stronger than the veil of self-adornment, because for one whose ignorance is made appealing to him, it is impossible for him to seek what he presumes to have attained, since he believes he possesses it, though it is not attained in reality [fī nafs al-amr].\n\nWhoever wishes to be protected from self-adornment should stop at the apparent meaning [ẓāhir] of the Book and the Sunna, adding nothing to the apparent meaning, for interpretation [al-ta’wīl] may sometimes stem from self-adornment. Whatever the apparent meaning grants, he follows it; and whatever is ambiguous [mutashābih] in it, he entrusts its knowledge to Allah and believes in it. This is a follower [muttabi‘]; self-adornment has no path to him, nor can any argument be established against him before Allah. If he is one of the People of Insight [Ahl al-Baṣā’ir], he calls to Allah upon insight [baṣīra] and speaks upon insight. He is thus free from self-adornment. He is a possessor of sound knowledge [‘ilm ṣaḥīḥ] and belongs to the People of Adornment [Ahl al-Zīna], not the People of Self-Adornment [Ahl al-Tazayyun]. Thus, agitation toward Allah may also be awe of this. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر دو سو آٹھ: اضطراب (الانزعاج) کی حالت میں\n\nجب قلب سلیم (القلب السليم) نیند سے بیدار ہوتا ہے\nتو وجد (الوجد) کے اضطراب سے حرکت کرتا ہے\n\nاس انس (الأنس) کی طلب میں جسے اس نے قائم کیا ہے\nپس سب سے پہلے جو اسے ملتا ہے وہ زہد (الزهد) کی حقیقت ہے\n\nوہ بندہ ہونے کا دعویٰ کرتا ہے، حالانکہ وہ اپنے وقت کا سید ہے\nاور سیادت اور عبدیت میں کتنا بڑا فرق ہے\n\nپس وہ اس کے ذریعے اپنے آپ سے فنا (الفناء) ہو جاتا ہے تاکہ اپنے رب کے ساتھ بقا (البقاء) پائے\nاس حد اور قائم شدہ فصل سے پاک ہو کر\n\nاس عہد کی حد کے ساتھ جو ان کے درمیان تھا\nاور یہ محبت (الود) کی کرم نوازی پر دلیل ہے\n\n[اضطراب (الانزعاج) غفلت کی نیند سے قلب کے بیدار ہونے اور انس (الأنس) اور وجد (الوجد) کی طرف حرکت کرنے کی حالت ہے]\n\nجان لو کہ طائفہ (صوفیاء) کے نزدیک اضطراب (الانزعاج) قلب کے غفلت کی نیند (سنة الغفلة) سے بیدار ہونے اور انس (الأنس) اور وجد (الوجد) کی طرف حرکت کرنے کی حالت ہے۔ پس اضطراب اس پر علت (العلة) کا حکم ہے، یعنی علت نے اس اضطراب کو پیدا کیا، جو کہ نفس کا اس حالت سے اپنے اصل کی طرف شدید حرکت کرنا ہے جہاں سے وہ نکلا تھا۔ کیونکہ اسی اصل سے اسے پکارا گیا ہے، اور اصل پاک ہے۔ پس یہ شدید شہوت اور قوت کے ساتھ حرکت ہے۔ اس اضطراب کے مختلف اسباب ہیں: ان میں سے کچھ کو رغبت (الرغبة) مضطرب کرتی ہے، کچھ کو رہبت (الرهبة) مضطرب کرتی ہے، اور کچھ کو تعظیم (التعظيم) مضطرب کرتی ہے۔ جہاں تک انس (الأنس) اور وجد (الوجد) کے لیے اس کے اضطراب کا تعلق ہے، تو یہ فہم ہو سکتا ہے، یا ملاقات ہو سکتی ہے، یا القاء (الہام) ہو سکتا ہے، یا تلقی (قبول کرنا) ہو سکتا ہے۔\n\nان میں سے وہ بھی ہے جو خاطر الٰہی (خاطر إلهي) سے، خاطر ملکی (خاطر ملكي) سے، خاطر شیطانی (خاطر شيطاني) سے، اور خاطر نفسی (خاطر نفسي) سے ہوتا ہے۔ لیکن اس ولی (الولي) کے لیے نفس اور شیطان کی طرف سے یہ اضطراب صرف اس فہم کے ذریعے ہوتا ہے جو اللہ اسے عطا کرتا ہے، جو اللہ کی طرف سے ایک عنایت ہے۔ یہ اس لیے نہیں کہ شیطان کو اس پر کوئی تسلط حاصل ہے، بلکہ شیطان اس کی خدمت میں ہوتا ہے اور اسے خبر نہیں ہوتی، اور وہ اس کے سر (راز) میں وہ چیز ڈالنے کی کوشش کرتا ہے جو اس ولی کے درجے کو بلند کرتی ہے، جہاں سے شیطان کو علم نہیں ہوتا۔ یہ ابلیس کے خلاف اللہ کی خفیہ تدبیر (مکر الله الخفي) کا حصہ ہے، کیونکہ وہ عارفین (العارفين) کے درجات کو بلند کرنے کی کوشش کرتا ہے، حالانکہ وہ یہ گمان کرتا ہے کہ وہ انہیں گرا رہا ہے۔\n\nاور جب معاملہ ایسا ہے، تو ہم کہتے ہیں کہ جب بندے میں علت (العلة) کی حالت متحقق ہو جاتی ہے، تو وہ نفس میں اضطراب (الانزعاج) کو ظاہر کرتی ہے اور یہ ضروری ہے۔ اس کا پہلا اضطراب صرف اس حالت کو چھوڑنے کے لیے ہوتا ہے جس پر وہ تھا، جب اللہ نے علت کے ذریعے اس کی بصیرت (بصیرت) سے پردہ ہٹایا۔ پس اس نے اپنے آپ کو دوری (البعد) کے مقام پر دیکھا، تو وہ اس مقام کو چھوڑنے کی رغبت میں مضطرب ہوا، قرب (القرب) کی کسی بھی خاص حضرہ (حضور) کو متعین کیے بغیر۔ جب وہ ایک قدم سے اس مقام کو چھوڑ دیتا ہے اور وہ اس کے شہود (الشهود) سے زائل ہو جاتا ہے، تو وہ ایک لمحے کے لیے اپنے آپ کو روکتا ہے اور آرام کرتا ہے۔ یہی وہ لذت اور توبہ کی مٹھاس ہے جو مرید (المريد) پاتا ہے، جو اس کے لیے سختیوں پر سوار ہونا آسان بنا دیتی ہے اور اس کے راستے کی دشواری کو سہل کر دیتی ہے۔ ہر شخص اس حالت میں اپنے اندر یہ چیز پاتا ہے اور اس کا انکار نہیں کر سکتا۔ جب وہ اپنے اضطراب کے ذریعے مخالفت کے مقام کو چھوڑ دیتا ہے اور آرام کرتا ہے، تب وہ اپنے آپ پر ہدایت پاتا ہے، اپنی آنکھیں کھولتا ہے، اور جانتا ہے کہ وہ اس چیز سے نجات پا چکا ہے جس میں وہ تھا۔ تب اس کے لیے وہ چیز قائم ہو جاتی ہے جو اسے اس کی طرف مضطرب کرتی ہے۔\n\nاس راستے میں پہلا اضطراب ہمیشہ اس کی طرف سے ہوتا ہے، اور دوسری حالت میں اس کی طرف اضطراب کا حکم ظاہر ہوتا ہے۔ اگر پہلی نظر میں اس کے لیے وہ چیز قائم ہو جائے جو اللہ کے جلال (جلال الله) کا حق ہے، یعنی تعظیم (التعظيم)، یا اگر یہ شخص ان لوگوں میں سے ہو جنہیں نظری دلائل (الأدلة النظرية) کے ذریعے اللہ کا علم پہلے سے حاصل ہے، تو اس کا اضطراب اللہ کی تعظیم کے لیے ہوتا ہے، نہ کہ اس چیز کی رغبت میں جو اس کے پاس ہے۔ بلکہ وہ اللہ تعالیٰ پر عائد حق کو ادا کرنے کے لیے مضطرب ہوتا ہے، اور وہ جو بندے کا مرتبہ اپنے آقا سے تقاضا کرتا ہے۔ وہ ان نعمتوں میں مشغول نہیں ہوتا جو اس پر انعام کی جاتی ہیں یا جن کی طرف اسے نفسانی لذتوں کے ذریعے راغب کیا جاتا ہے۔ بلکہ وہ اپنے اوپر اللہ کے حقوق کو دیکھتا ہے، پس وہ اسے ادا کرنے میں کوشش کرتا ہے۔ اور یہی اللہ کا قول ہے: اتَّقُوا الله حَقَّ تُقاتِهِ‏ (ڈرتے رہو اللہ سے جیسا کہ اس سے ڈرنے کا حق ہے) [آل عمران: ۱۰۲]۔ پس وہ جانتا ہے کہ کوئی بھی اس کی طاقت نہیں رکھتا، اور یہ کہ اللہ کی قدر اس سے کہیں زیادہ جلیل، اعلیٰ اور پاک ہے کہ کوئی اس کا اندازہ لگا کر اسے ادا کر سکے۔ یہ چیز اسے اپنے نفس پر غور کرنے کی طرف لے جاتی ہے اور اس قوت پر جو اللہ نے اسے اس سلسلے میں عطا کی ہے، کیونکہ وہ جانتا ہے کہ اللہ کی قدر کو مخلوق کے بس میں نہیں کہ وہ اسے پورا کرے۔ اور اس نے اللہ کو یہ فرماتے ہوئے سنا: لا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها (اللہ کسی جان پر اس کی طاقت سے زیادہ بوجھ نہیں ڈالتا) [البقرہ: ۲۸۶]، اور فرمایا: إِلَّا ما آتاها (مگر جو اسے دیا ہے) [الطلاق: ۷]، اور فرمایا: ما اسْتَطَعْتُمْ (جتنا تم کر سکو) [التغابن: ۱۶]۔ پس وہ استطاعت (الاستطاعة) اور اپنی وسعت کے مطابق اللہ کا حق ادا کرنے کے لیے مضطرب ہوتا ہے۔\n\nاور اللہ کے بندے اس میں دو طرح سے ایک دوسرے سے افضل ہوتے ہیں: اس جلال (جلال الله) کی مقدار کے مطابق جو ان پر منکشف ہوتا ہے، اور ان کے مزاجوں (أمزجتهم) کی مقدار کے مطابق۔ کیونکہ اللہ نے انسان کے نفس اور عقل کو اس کے جسم کے مزاج کے حکم کے تابع کر دیا ہے۔ انسان کا نفس ان قوتوں کے واسطے کے بغیر کسی چیز کا ادراک نہیں کرتا جنہیں اللہ نے اس نشأت (النشأة) میں نصب کیا ہے۔ یہ نفس کے لیے آلے کی مانند ہیں۔ اگر آلہ صحیح وزن پر سیدھا ہو تو اس سے صنعت کی خوبصورتی ظاہر ہوتی ہے، بشرطیکہ نفس صنعت سے واقف ہو۔ اور ان کا علم اس مقدار کے مطابق ہوتا ہے جو ذات حق (الحق) ان کے باطن (سرائر) میں ان پر منکشف کرتا ہے۔ ان میں سے کچھ پر وہ چیز منکشف ہوتی ہے جو ذات (الذات) طلب کرتی ہے، اور کچھ پر وہ چیز منکشف ہوتی ہے جو اسماء (الأسماء) نظری دلالتوں کے لحاظ سے طلب کرتے ہیں۔ اور کچھ پر وہ چیز منکشف ہوتی ہے جو اسماء ان مقابل اور متوازی چیزوں کے لحاظ سے طلب کرتے ہیں جو شرائع (الشرائع) لائی ہیں۔ ان میں سے کچھ کو ساٹھ ہزار الٰہی منازل (المنازل الإلهية) کے سر پر کھڑا کیا جاتا ہے، اور کچھ کو ان منازل کے ایک لاکھ بیس ہزار کے سر پر کھڑا کیا جاتا ہے، اور کچھ کو نوے ہزار کے سر پر کھڑا کیا جاتا ہے جو چھ مقامات (مقامات) میں محدود ہیں اور ان کا کوئی ساتواں نہیں ہے۔ کوئی بندہ ان منازل میں سے کسی میں شریک نہیں ہوتا، بلکہ ہر انسان ان میں منفرد ہوتا ہے۔ اور یہی طائفہ (صوفیاء) کا قول ہے کہ اللہ ایک صورت میں دو اشخاص پر تجلی (يتجلى) نہیں کرتا: قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ (ہر گروہ نے اپنا گھاٹ جان لیا) [البقرہ: ۶۰]۔ پس اگرچہ وہ تعداد میں جمع ہوں، لیکن ذوق (الذوق) میں ان کا اجتماع نہیں ہوتا، کیونکہ وہ مزاج (المزاج) میں جمع نہیں ہوئے۔ اور اگر وہ مزاج میں جمع ہو جاتے—جو کہ محال ہے—تو وہ ممتاز نہ ہوتے اور عین (العين) ایک ہی ہوتی۔ پھر ایک مقام ہے جو ساٹھ ہزار کے سر پر موجود منزل کے مالک میں اس کے برعکس ظہور (الظہور) عطا کرتا ہے، اور وہ اسی درجے میں ہوتا ہے۔ پس اس کے لیے ساٹھ ہزار کے بجائے ایک اور عدد ہوتا ہے جس کی مقدار تین ملین (تین ہزار ہزار) ہوتی ہے۔ اور نوے ہزار کے مالک کے لیے چار ملین پانچ لاکھ (چار ہزار ہزار اور پانچ سو ہزار) ہوتے ہیں۔ اور ایک لاکھ بیس ہزار کے مالک کے لیے چھ ملین (چھ ہزار ہزار) ہوتے ہیں۔ اور یہ صرف اہل صعود (أهل الصعود) کے لیے ہوتا ہے جن کے بارے میں اللہ نے فرمایا: إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ (اسی کی طرف پاکیزہ کلمات چڑھتے ہیں) [فاطر: ۱۰]۔ اور ہر وہ شخص جسے معراج کرائی گئی ہو، خواہ روحانی ہو یا جسمانی، اس کے لیے منازل کی یہ کثیر تعداد ہوتی ہے۔ اور جو عدد اس سے کم ہے، وہ صرف ان مریدین (المريدين) کے لیے ہے جو مقام تربیت (التربية) میں ہیں۔ جہاں تک ان کو صرف چھ میں محدود کرنے کا تعلق ہے، تو یہ دو طریقوں سے ہے۔ ایک طریقہ ان کی نشأت (پیدائش) ہے جو چھ جہتوں پر قائم ہے، جن میں سے چار سے شیطان آتا ہے اور دو باقی رہتی ہیں جن پر شیطان کا کوئی راستہ نہیں ہے۔ اور اسی وجہ سے لوگوں کا میلان ان دو جہتوں کے لیے رحمت (الرحمة) کی عمومیت اور شمولیت کی طرف ہوتا ہے۔ اور جہاں تک چھ معنوی (المعنوية) صفات کا تعلق ہے، تو وہ چھ صفات ہیں جو الٰہی نسبتیں (النسب الإلهية) ہیں جن سے ممکن (الممكن) متعلق ہوتا ہے۔ اور ساتویں نسبت ممکن کی طرف متوجہ نہیں ہے، بلکہ وہ صرف ان چھ کی صحت کے لیے ظاہر ہوئی ہے، کسی اور وجہ سے نہیں، اور وہ اس کا حی (زندہ) ہونے کی نسبت ہے۔ چونکہ ان چھ کا ثبوت اسی نسبت سے ہوا، اور چونکہ حدود چیزوں کی حفاظت کرتی ہیں، خاص طور پر ذاتی حدود (الحدود الذاتية)، اس لیے انہیں پانچ بنایا گیا، کیونکہ پانچ کو حفاظت حاصل ہے۔ پس حدود وسیع ہو گئیں اور انہیں پانچ کا مقام دیا گیا، تاکہ اعیان (الأعيان) کامل اور مکمل نشأت والے ہوں اور ان میں کوئی کمی نہ ہو۔ یہ سب جب بندے پر دوری سے ظاہر ہوتا ہے، تو وہ اسے حاصل کرنے کے لیے مضطرب ہوتا ہے، کیونکہ اس میں جناب حق (جناب الحق) کی تعظیم شامل ہے جو اس بندے کا مقصود ہے۔ پس یہ اس شخص کا حکم ہے جسے تعظیم نے مضطرب کیا۔ اور جہاں تک اس شخص کے حکم کا تعلق ہے جسے اللہ کے پاس موجود چیزوں کی رغبت نے مضطرب کیا، تو اس کا مشاہدہ یہ ہے: وَما عِنْدَ الله خَيْرٌ وَأَبْقى‏ (اور جو کچھ اللہ کے پاس ہے وہ بہتر اور زیادہ باقی رہنے والا ہے) [القصص: ۶۰]۔ اور صاحب تعظیم کا مشاہدہ یہ ہے: وَالله خَيْرٌ وَأَبْقى‏ (اور اللہ بہتر اور زیادہ باقی رہنے والا ہے) [القصص: ۶۰]۔\n\n[رغبت (الرغبة) کا اضطراب اس چیز کے مطابق ہوتا ہے جس سے وہ عشق کرتا ہے اور جس کی وہ خواہش کرتا ہے]\n\nجان لو کہ رغبت (الرغبة) کا اضطراب اس چیز کے مطابق ہوتا ہے جس سے وہ عشق کرتا ہے اور جس کی وہ خواہش کرتا ہے، اور یہ دو قسم کا ہے: متخیل (تصور کیا گیا) اور غیر متخیل (جس کا تصور نہ کیا جا سکے)۔ متخیل دو قسم کا ہے۔ ایک قسم وہ ہے جس کا ادراک اس نے اپنے بعض حواس یا تمام حواس سے کیا، یا خبر (الخبر) کے ذریعے ادراک کیا، پس اس نے اسے جنت کی صفات اور اس میں موجود چیزوں کے معروف وصف پر محمول کیا۔ اور غیر متخیل وہ ہے جس کی اس نے اجمالی طور پر رغبت کی، اور وہ وہ ہے جو جنت اپنے اندر سموئے ہوئے ہے یا جس پر مشتمل ہے، جسے نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی بشر کے دل پر اس کا خیال گزرا۔ اس نے سنا ہے کہ یہ چیز اس میں ہے، تو ایسی چیز کا تصور نہیں کیا جا سکتا۔ پس جو کچھ بھی وہ تصور کرتا ہے وہ بشر کے دل پر گزر چکا ہے، لہٰذا وہ یہ نہیں ہے۔ اور نفس کی فطرت ہے کہ وہ اس چیز کو جاننا پسند کرتا ہے جسے وہ نہیں جانتا تھا، پس وہ طبعاً مزید (المزید) کو پسند کرتا ہے۔ مگر اس کا تعلق اس چیز سے مختلف ہوتا ہے جس سے وہ مزید حاصل کرنا چاہتا ہے۔ وہ اسی چیز سے مزید طلب کرتا ہے جس سے وہ عشق کرتا ہے، نہ کہ کسی اور سے۔ اگر رغبت کرنے والا اللہ سے محبت کرنے والا ہے، تو وہ یا تو اللہ کا عالم ہو گا یا اللہ کا عالم نہیں ہو گا۔ یہ محال ہے کہ وہ اللہ کا عالم نہ ہو، کیونکہ وہ محب ہے، اور محب اپنی ذات سے ایک محبوب کو طلب کرتا ہے جس سے وہ متعلق ہو، جس کے ذریعے وہ قائم ہو، تاکہ اسے محب کہا جائے۔ پس اسے اس کا عالم ہونا ضروری ہے۔ البتہ اس کے عالم مختلف مراتب پر ہیں۔ ان میں سے کچھ صرف مؤمن ہیں، پس انہوں نے اسے خبر (الخبر) کے ذریعے جانا، اور اخبار متقابل ہیں، پس محب حیران ہو گیا اور اس کے محبوب کی کوئی صورت اس کے لیے منضبط نہ ہو سکی۔ اور ان میں سے کچھ نے خبر میں اس چیز کو ترجیح دی جو خیال (الخيال) نے انہیں دی، پس انہوں نے ایک محدود، متصور صورت سے محبت کی، جس سے وہ متعلق ہو گئے۔ ایسا شخص وجد (الوجد)، انس (الأنس)، وصال (الوصال)، رؤیت (الرؤية)، اور گفتگو (الحديث) کی طلب میں مضطرب ہوتا ہے، جو اشکال اور اجناس میں معروف طریقے پر ہو۔ اور وہ ان میں تجلی (يتجلى) کرتا ہے۔ اور ان میں سے کچھ وہ ہیں جو علامت (العلامة) کے ذریعے ظہور الٰہی (التجلي) سے اس کے عالم ہیں، پس وہ اپنی علامت کے مطابق اس میں ہوتے ہیں۔ اور ان میں سے کچھ وہ ہیں جو فکری نظر (نظر فكري) سے اس کے عالم ہیں، پس وہ اسے مقید نہیں کرتے اور ہر اس تجلی پر ایمان لاتے ہیں جو تقیید اور تحدید عطا کرتی ہے، پس ان سے اللہ کی طرف سے بہت سی بھلائی فوت ہو جاتی ہے۔ ان کا محبوب ان سے حَبْلِ الْوَرِيدِ (رگِ جان) [ق: ۱۶] سے بھی زیادہ قریب ہے، لیکن وہ نہیں جانتے کہ وہ وہی ہے۔ ان کا محبوب ہمیشہ ان کے لیے ظاہر رہتا ہے اور وہ اسے پہچانتے نہیں ہیں۔ یہ طائفہ دو قسم کی ہے: ایک طائفہ کہتی ہے کہ ہم اپنے محبوب کو دیکھنے کی امید رکھتے ہیں، اور ایک طائفہ کہتی ہے کہ ہمارے محبوب کا دیکھنا محال ہے، لیکن ہمارا اس کا علم محال نہیں ہے۔ کیونکہ رؤیت (دیکھنا) اپنی ذات کے لیے مطلوب نہیں ہے، بلکہ یہ دیکھنے والے کو دیکھی جانے والی چیز کے بارے میں علم حاصل ہونے کا ایک ذریعہ ہے۔ پس جس بھی طریقے سے وہ حاصل ہو جائے، وہی مطلوب ہے، اور ہم نے اسے جان لیا ہے۔ اور ہمارے علم میں سے یہ ہے کہ بصری ادراک کے لحاظ سے اس کی رؤیت محال ہے۔ پس وہ اس سے مایوس ہو گئے، اور وہ یاس (الْيَاس) کی نعمت میں ہیں۔ اور دوسرے طمع (الطمع) کی نعمت میں ہیں۔ دونوں طائفے اس اضطراب میں جمع ہوتے ہیں کہ وہ اس سے فہم (الفهم) حاصل کریں جو اس نے انہیں قرآن یا حدیث نبوی کے نام سے مخاطب کیا، یا جو عالم میں قدرت (القدرة) کے آثار سے ظاہر ہوا جو اس کی عظمت، کبریائی، لطف اور شفقت کی طرف لے جاتے ہیں۔ ہر آیت، سورت اور صورت اس کے مطابق جو وہ عطا کرتی ہے، پس وہ فہم میں ایک دوسرے سے افضل ہوتے ہیں اور علم میں مزید طلب کرتے ہیں، اور وہ اکابر (بڑے لوگ) ہیں۔ اور ان میں سے کچھ کہتے ہیں کہ میں سیر ہو گیا ہوں، پس وہ مزید طلب نہیں کرتے۔ میں نے ان میں سے ایک جماعت کو دیکھا، اور وہ سب سے زیادہ جاہل طائفے ہیں۔ میں نے اشاعرہ کے ائمہ کو اس قدم پر دیکھا کہ وہ سمجھتے ہیں کہ وہ اللہ کو اسی طرح جانتے ہیں جس طرح وہ خود کو جانتا ہے، بغیر کسی اضافے کے۔ یہ لوگ اپنے جہل میں آرام کر رہے ہیں، اور ہم ان کی فلاح سے مایوس ہو چکے ہیں۔ وہ ملاقات (اللقاء) کے اضطراب میں بھی جمع ہوتے ہیں۔ ان میں سے کچھ اس کی ملاقات کے لیے مضطرب ہوتے ہیں، اور کچھ اس چیز کی ملاقات کے لیے مضطرب ہوتے ہیں جو وہ ان سے چاہتا ہے۔ وہ القاء (الہام) اور تلقی (قبول کرنا) کے اضطراب میں بھی جمع ہوتے ہیں۔ اور وہ اس میں مختلف اقسام میں تقسیم ہوتے ہیں۔ ان میں سے کچھ عمومی طور پر تلقی کرنے والے (المتلقي عموماً) ہیں، اور وہ مردوں میں سے بڑے ہیں۔ اور ان میں سے کچھ فرشتے سے اور اللہ سے تلقی کرتے ہیں، اور خاطر الٰہی (الخاطر الإلهي) اور ملکی (الملكي) کے علاوہ جو کچھ آتا ہے اس سے اعراض کرتے ہیں۔ اور ان میں سے کچھ ان دو خاطروں کے علاوہ خاطر نفسی (الخاطر النفسي) کو بھی تلقی کرتے ہیں۔ اور ان میں سے کچھ شیطانی خاطر (الخاطر الشيطاني) کو ملکی اور نفسی پر ترجیح دیتے ہیں، کیونکہ وہ مقابل ہے، اس لیے کہ وہ خالص دشمن کا القاء ہے جو حق کے خلاف ڈالتا ہے۔ اور یہ تلقی کرنے والا حق کے خلاف پر اس لحاظ سے واقف ہونا چاہتا ہے کہ وہ شیطان کے نزدیک خلاف ہے، اور اسی لیے اس نے اسے ڈالا۔ اور یہ تلقی کرنے والا سب کا سب حق ہے، کیونکہ وہ سب کا سب نور ہے، بلکہ وہ عین نور (عين النور) ہے۔ وہ جانتا ہے کہ ابلیس اس حق سے جاہل تھا جو اس کے پاس تھا، جہاں اس نے یہ گمان کیا کہ وہ حق نہیں ہے۔ پس اس تلقی کرنے والے نے اسے شیطانی صورت سے حق کے طور پر لے لیا۔ جو کچھ شیطان نے اسے دیا وہ نہ تو فرشتے کی صورت میں حاصل ہوا اور نہ ہی انسانی نفس کی صورت میں۔ اور شیطان کا حکم اس سے زائل ہو گیا جب اس تلقی کرنے والے نے اسے قبول کیا۔ کیونکہ شیطان یہ گمان کرتا ہے کہ اس نے اس کی طرف وہم (الوهم) کا ایک امر ڈالا ہے جو شیطان کے نزدیک عدم (عدم) ہے۔ اور اس نے اس تلقی کرنے والے کے مرتبے کو نہیں جانا، اور یہ کہ اس نے اس سے صرف ایک وجودی امر (أمر وجودي) ہی تلقی کیا ہے۔ پس جب اس نے دیکھا کہ وہ اسے لیتے وقت اس سے عشق کر رہا ہے، اور اس میں مرتبے کی کوئی کمی یا جہل کا کوئی اثر نہیں دیکھا، تو وہ حیران ہوا اور دیکھا کہ اس کے معاملے میں یہ کہاں سے آیا، اور کس چیز نے اس معدوم کو موجود بنا دیا۔ پس اس نے جانا کہ جہل صرف اسی میں قائم تھا نہ کہ تلقی کرنے والے میں، اور یہ کہ وہی تھا جس نے اس کی طرف وجودی امر کو ڈالا، یہ سمجھتے ہوئے کہ وہ موہوم الوجود ہے نہ کہ محقق۔ پس اس نے دیکھا کہ اس نے اس علم سے جو اسے فائدہ پہنچایا، اس کے مرتبے کی مزید بلندی میں کوشش کی، حالانکہ وہ یہ نہیں چاہتا تھا، بلکہ اس نے وہ ارادہ کیا جو اس کے لائق تھا۔ اس نے نہیں جانا کہ وہ، اللہ اس پر لعنت کرے، وجود (الوجود) کا محل ہے، بلکہ صرف یہ گمان کیا کہ وہ وہم الوجود کا محل ہے نہ کہ اس کے تحقق کا۔ پس یہ تلقی کرنے والا اس تلقی میں خلاق (خالق) ہوتا ہے، اور یہ تلقی میں لینے کا سب سے مکمل مرتبہ ہے۔\n\n[رہبت (الرهبة) کا اضطراب]\n\nاور جہاں تک رہبت (الرهبة) کے اضطراب کا تعلق ہے، تو وہ رغبت (الرغبة) کی طرح ہے: یا تو اس سے رہبت، اور یہی اس کا قول ہے: وأعوذ بك منك (اور میں تیری پناہ مانگتا ہوں تجھ سے) [حدیث نبوی]۔\n\nیا اس چیز سے رہبت جو اس کی طرف سے ہو، خواہ وہ حسی عذاب (عذاب حسي) ہو یا حجاب (الحجاب) کا عذاب، جو کہ جہل (الجهل) یا آراستگی (التزين) کا عذاب ہے۔ اور حجابات میں آراستگی (حجاب التزين) کے حجاب سے زیادہ گہرا اور قوی کوئی نہیں، کیونکہ جس کے لیے اس کا جہل آراستہ کر دیا گیا ہو، اس کے لیے اس چیز کو طلب کرنا محال ہے جسے وہ اپنے گمان میں حاصل سمجھتا ہے، کیونکہ وہ اسے اپنے پاس حاصل سمجھتا ہے، حالانکہ حقیقت میں وہ حاصل نہیں ہے۔ پس جو شخص آراستگی (التزين) سے بچنا چاہے، اسے چاہیے کہ وہ کتاب اور سنت کے ظاہر (الظاهر) پر ٹھہر جائے، اور ظاہر پر کوئی چیز نہ بڑھائے۔ کیونکہ تاویل (التأويل) بھی آراستگی کی ایک صورت ہو سکتی ہے۔ پس جو کچھ ظاہر اسے عطا کرے، وہ اس پر عمل کرے، اور جو کچھ متشابہ ہو، اس کا علم اللہ کے سپرد کر دے اور اس پر ایمان لائے۔ پس یہ متبع (پیروی کرنے والا) ہے، اور آراستگی کا اس پر کوئی راستہ نہیں، اور نہ ہی اللہ کے ہاں اس پر کوئی حجت قائم ہو سکتی ہے۔ اگر وہ اہل بصائر (أهل البصائر) میں سے ہے، تو وہ بصیرت کے ساتھ اللہ کی طرف بلاتا ہے اور بصیرت کے ساتھ کلام کرتا ہے، پس وہ آراستگی سے بری ہے۔ وہ صحیح علم کا مالک ہے اور اہل زینت (آراستگی والے) میں سے تھا نہ کہ اہل تزین (خود کو آراستہ سمجھنے والے) میں سے۔ پس اللہ کی طرف اضطراب اس سے بھی رہبت ہو سکتا ہے۔ وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے) [الأحزاب: ۴]۔\n\nشروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے",
    "fa": "«باب دویست و هشتم در بیان حال انزعاج (الانزعاج)»\n\nچون قلب سلیم از خواب بیدار شود،\nبا جنبشی از انزعاج (الانزعاج) و وجد (الوجد) به حرکت درآید.\n\nبه سوی طلب اُنس (الأنس) که او را برپا داشته است؛\nو اولین چیزی که می‌یابد، تحقق به زهد است.\n\nپس ادعای بندگی کند، در حالی که سید وقت خویش است؛\nو چه فاصله‌ای است میان سیادت و بندگی.\n\nپس به واسطه او از خود فانی شود تا به پروردگارش باقی بماند؛\nپاک و منزه از فصل مقوم و حد.\n\nهمراه با حدی برای عهدی که میانشان بود؛\nو این برهانی است بر کرامت دوستی.\n\n### [انزعاج (الانزعاج)، حال بیداری قلب از خواب غفلت و حرکت به سوی اُنس و وجد (الوجد)]\n\nبدان که انزعاج (الانزعاج) نزد این طایفه، حال بیداری قلب از خواب غفلت و حرکت به سوی اُنس و وجد (الوجد) است. پس انزعاج (الانزعاج) حکم علت بر این حال است؛ یعنی علت این انزعاج (الانزعاج) را برای او به ارث گذاشته است، و آن عبارت است از رانده شدن نفس از حالی که برایش صحیح بود، به سوی اصلش که از آن خارج شده است؛ زیرا از آن اصل او را فراخوانده است و اصل پاک است. پس این رانده شدن با شهوت و نیرویی شدید است. و این انزعاج (الانزعاج) اسباب مختلفی دارد؛ برخی را رغبت به انزعاج (الانزعاج) می‌آورد، برخی را رهبت (الرهبة) و برخی را تعظیم. اما انزعاج (الانزعاج) او به سوی اُنس و وجد (الوجد) گاهی فهم است، گاهی لقاء، گاهی القاء و گاهی تلقی. از جمله این حالات، آنچه از خاطر الهی، خاطر ملکی، خاطر شیطانی و خاطر نفسی حاصل می‌شود. اما برای این ولی، از جانب نفس و شیطان، جز با فهمی که خداوند به او روزی کرده و عنایتی از جانب حق (الحق) در آن است، حاصل نمی‌شود؛ نه اینکه شیطان بر او سلطه‌ای داشته باشد، بلکه شیطان در خدمت اوست و او نمی‌داند، و در آنچه در سرّ او القا می‌کند، در ارتقای درجه این ولی می‌کوشد، از آنجا که شیطان نمی‌داند. و این از مکر خفی خداوند با ابلیس است، زیرا او در بالا بردن درجات عارفان می‌کوشد، در حالی که گمان می‌کند آنان را از آن درجات پایین می‌آورد. و اگر امر چنین است، پس بگوییم که حال علت، هنگامی که در بنده محقق شود، ناگزیر انزعاجی (الانزعاج) را در نفس آشکار می‌سازد. و انزعاج (الانزعاج) او در ابتدا تنها برای این است که از حالی که بر آن بود جدا شود، هنگامی که خداوند با علت از بصیرت او پرده برداشت، پس خود را در جایگاه دوری دید. از این رو، به دلیل رغبت در مفارقت از آن موطن، بدون تعیین حضرتی از حضرات قرب، دچار انزعاج (الانزعاج) شد. پس هنگامی که با یک قدم از آن موطن جدا شد و از شهود (الشهود) او زایل گشت، ساعتی نفس کشید و آسود. و این همان لذت و شیرینی توبه‌ای است که مرید می‌یابد و سختی‌ها را بر او آسان می‌کند و دشواری راهش را سهل می‌سازد. هر کس این را در این حال از خود می‌یابد و نمی‌تواند آن را انکار کند. پس هنگامی که با انزعاج (الانزعاج) خود از موطن مخالفت جدا شد و آسود، در آن هنگام به خود هدایت می‌شود و چشمانش را باز می‌کند و می‌داند که از آنچه در آن بود رهایی یافته است. در این هنگام، آنچه انزعاج (الانزعاج) به سوی آن در نزد او تأثیر می‌گذارد، برایش برپا می‌شود. اولین انزعاج (الانزعاج) در این راه همیشه از اوست، و در حال دوم، حکم انزعاج (الانزعاج) به سوی او آشکار می‌شود. اگر در اولین نظر، آنچه جلال خداوند سزاوار آن است از تعظیم برای او برپا شود، یا این شخص از کسانی باشد که علم به خداوند از طریق ادله نظری برایشان پیش آمده باشد، انزعاج (الانزعاج) او تعظیم برای خدا خواهد بود، نه رغبت در آنچه نزد اوست. بلکه برای ادای حقی که بر او برای خدای تعالی واجب شده و آنچه مرتبه بنده از مولایش اقتضا می‌کند، دچار انزعاج (الانزعاج) می‌شود. پس او مشغول به نعمت‌هایی که خداوند به او می‌دهد و لذات نفسی که او را به آن ترغیب می‌کند، نیست؛ بلکه حقوقی را که خداوند بر او دارد می‌بیند و خود را در ادای آن به زحمت می‌اندازد. و این همان قول خداوند است: **اتَّقُوا الله حَقَّ تُقاتِهِ** (از خدا آن‌گونه که شایسته پروا کردن از اوست، پروا کنید).\n\nپس می‌داند که هیچ کس طاقت آن را ندارد و قدر خداوند والاتر، بالاتر و منزه‌تر از آن است که کسی بتواند آن را اندازه بگیرد. این امر او را به سوی نگریستن در نفس خود و نیرویی که خداوند در این راه به او داده است، سوق می‌دهد؛ زیرا می‌داند که قیام به قدر الهی در وسع مخلوق نیست. و شنیده است که خداوند می‌فرماید: **لا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها** (خداوند هیچ کس را جز به اندازه توانش تکلیف نمی‌کند) و فرمود: **إِلَّا ما آتاها** (جز آنچه به او داده است) و فرمود: **ما اسْتَطَعْتُمْ** (آنچه در توان دارید). پس به سوی قیام به حق خداوند به اندازه استطاعت و وسع خود دچار انزعاج (الانزعاج) می‌شود. و بندگان خدا در این امر بر دو نوع با یکدیگر تفاوت دارند: به اندازه آنچه از جلال خداوند بر آنان کشف (الکشف) می‌شود و به اندازه مزاج‌هایشان. زیرا خداوند نفس و عقل انسان را تابع مزاج جسم او قرار داده است. نفس انسان چیزی را درک نمی‌کند مگر به واسطه این قوایی که خداوند در این نشئه تعبیه کرده است؛ این قوا برای نفس مانند ابزار هستند. اگر ابزار بر وزن صحیح مستقیم باشد، زیبایی صنعت با آن آشکار می‌شود، به شرطی که نفس به آن صنعت عالم باشد. و علم آنان به اندازه‌ای است که حق (الحق) از آن در سرّهایشان بر آنان کشف (الکشف) می‌کند. پس برای برخی در آنچه ذات می‌طلبد کشف (الکشف) می‌شود، و برای برخی در آنچه اسماء از جهت دلالات نظری می‌طلبند کشف (الکشف) می‌شود، و برای برخی در آنچه اسماء از جهت آنچه شرایع از مقابل و مقارن آورده‌اند می‌طلبند کشف (الکشف) می‌شود. پس برخی بر رأس شصت هزار منزل الهی اقامه می‌شوند، و برخی بر رأس صد و بیست هزار منزل از این منازل اقامه می‌شوند، و برخی بر رأس نود هزار منزل که در شش مقام محصور است و هفتمی ندارد، اقامه می‌شوند. و هیچ بنده‌ای در هیچ یک از این منازل شریک دیگری نیست، بلکه هر انسانی در آن منفرد است. و این همان قول طایفه است که خداوند در یک صورت برای دو شخص تجلی (التجلی) نمی‌کند: **قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ** (هر گروهی آبشخور خود را دانستند). پس اگرچه در عدد جمع شوند، اما در ذوق جمعیتی ندارند، زیرا در مزاج جمع نشده‌اند. و اگر در مزاج جمع می‌شدند (که محال است)، متمایز نمی‌شدند و عین یکی می‌بود. و موطنی هست که ظهور را در صاحب منزلی که بر رأس شصت هزار منزل بود، خلاف این می‌دهد، در حالی که او در همان درجه است. پس به جای شصت هزار، عدد دیگری برای او خواهد بود که مبلغ آن سه میلیون است. و برای صاحب نود هزار، چهار میلیون و پانصد هزار خواهد بود. و برای صاحب صد و بیست هزار، شش میلیون خواهد بود. و این جز برای اهل صعود نیست که خداوند درباره آنان فرمود: **إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ** (سخنان پاکیزه به سوی او بالا می‌رود). و هر کس که به معراج برده شود، چه معراج روحانی باشد و چه جسمانی، این عدد کثیر از منازل را دارد. اما عددی که کمتر از آن است، برای مریدانی است که فقط در مقام تربیت هستند. و اما حصر آنان در شش مقام، از دو طریق است: طریق اول، نشأت آنان است که بر شش جهت استوار است؛ شیطان از چهار جهت آن می‌آید و دو جهت باقی می‌ماند که شیطان را بر آن دو راهی نیست. و از آنجاست که میل مردم به عموم رحمت و شمول آن به این دو جهت است. و اما شش مقام معنوی، صفات شش‌گانه‌ای هستند که نِسب الهی‌اند و ممکن به آن‌ها تعلق می‌یابد. و نسبت هفتم متوجه به ممکن نیست، بلکه تنها برای صحت این شش نسبت خاص ظاهر شده است، نه برای امر دیگری؛ و آن نسبت «حی بودن» است، زیرا با این نسبت، شش نسبت ثابت شده‌اند. و چون حدود، اشیاء را حفظ می‌کنند، به ویژه حدود ذاتی، پنج قرار داده شدند، زیرا پنج دارای حفظ است. پس حدود گسترش یافتند و مقام پنج به حدود داده شد تا اعیان، کامل و تمام النشأة باشند و نقصی در آن‌ها نباشد. و هرگاه این همه از دور بر بنده آشکار شود، برای طلب آن دچار انزعاج (الانزعاج) می‌شود تا آن را به دست آورد، زیرا در آن تعظیم جناب حق (الحق) است که مقصود این بنده است. پس این حکم کسی است که تعظیم او را به انزعاج (الانزعاج) آورده است. اما حکم کسی که رغبت در آنچه نزد خداست او را به انزعاج (الانزعاج) آورده است، مشهد او این است: **وَما عِنْدَ الله خَيْرٌ وَأَبْقى** (و آنچه نزد خداست بهتر و پایدارتر است). و مشهد صاحب تعظیم این است: **وَالله خَيْرٌ وَأَبْقى** (و خدا بهتر و پایدارتر است).\n\n### [انزعاج (الانزعاج) رغبت، بر حسب آنچه به آن عشق ورزیده و بدان رغبت یافته است]\n\nپس بدان که انزعاج (الانزعاج) رغبت، بر حسب آنچه به آن عشق ورزیده و بدان رغبت یافته است، و آن بر دو نوع است: متخیّل و غیر متخیّل. و متخیّل نیز بر دو نوع است: نوع اول، آنچه را که با برخی از حواس یا با همه آن‌ها درک کرده، یا از طریق خبر دریافته و آن را بر صفات معهود بهشت و آنچه در آن است حمل کرده است. و غیر متخیّل، آن چیزی است که به طور اجمالی به آن رغبت یافته است، و آن چیزی است که بهشت در بر می‌گیرد یا متضمن آن است، از آنچه چشمی ندیده و گوشی نشنیده و بر قلب بشری خطور نکرده است. او شنیده است که این در بهشت هست، پس تخیل چنین چیزی ممکن نیست؛ زیرا هر آنچه تخیل کند، بر قلب بشری خطور کرده است، پس آن نیست. و از طبیعت نفس این است که دوست دارد آنچه را نمی‌دانسته، بداند. پس ذاتاً خواهان فزونی است، جز اینکه تعلق آن به آنچه از آن فزونی می‌جوید، متفاوت است. پس از آنچه به آن عشق می‌ورزد، فزونی می‌طلبد، نه از غیر آن. اگر راغب، صاحب محبة لله باشد، خالی از این نیست که یا عالم به خدا باشد یا غیر عالم به خدا. محال است که غیر عالم به خدا باشد، زیرا او محب است و محب ذاتاً محبوبی را می‌طلبد که به او تعلق یابد تا محب نامیده شود. پس ناگزیر باید عالم به او باشد، جز اینکه عالمان به او بر مراتبی هستند: برخی مؤمنان خاص هستند که او را از طریق خبر شناخته‌اند، و اخبار متقابل‌اند، پس محب سرگردان شده و صورتی از محبوبش برای او منضبط نشده است. و برخی در خبر، آنچه را که خیال به او داده ترجیح داده‌اند، پس محبوبی محدود و متصور را دوست داشته و به آن تعلق یافته‌اند. چنین کسی را طلب وجد (الوجد)، اُنس، وصال، رؤیت و سخن گفتن بر طریق معهود در اشکال و اجناس، به انزعاج (الانزعاج) می‌آورد.\n\nو او در آن تجلی (التجلی) می‌کند. و برخی از عالمان به او کسانی هستند که از طریق تجلی (التجلی) با علامت او را می‌شناسند، پس شناخت آنان به اندازه علامتشان است. و برخی از عالمان به او کسانی هستند که از طریق نظر فکری او را می‌شناسند، پس او را مقید نمی‌کنند و به هر تجلی (التجلی) که تقیید و تحدید دهد، ایمان نمی‌آورند، در نتیجه خیر بسیاری از خداوند از دستشان می‌رود. محبوبشان از **حَبْلِ الْوَرِيدِ** (رگ گردن) به آنان نزدیک‌تر است، اما نمی‌دانند که اوست. پس محبوبشان پیوسته بر آنان ظاهر است و آنان او را نمی‌شناسند. و این طایفه بر دو نوع هستند: طایفه‌ای می‌گویند ما طمع داریم که محبوبمان را ببینیم، و طایفه‌ای می‌گویند رؤیت محبوبمان محال است، اما علم ما به او محال نیست؛ زیرا رؤیت مطلوب بالذات نیست، بلکه راهی است برای حصول علم نزد بیننده به مرئی. پس به هر وجهی که حاصل شود، همان است و ما او را شناخته‌ایم. و از علم ما به او این است که رؤیت او از جهت ادراک بصری محال است. پس از آن مأیوس شده‌اند و در نعمت یأس هستند، و دیگران در نعمت طمع. هر دو طایفه در انزعاج (الانزعاج) برای فهم از خدای تعالی، از آنچه با نام قرآن یا حدیث نبوی با آنان سخن گفته است، یا از آنچه در عالم از آثار قدرت که به عظمت و کبریایی و لطف و مهربانی او می‌انجامد، ظاهر شده است، جمع می‌شوند. هر آیه و سوره و صورتی به اندازه آنچه می‌دهد. پس در فهم با یکدیگر تفاوت می‌یابند و طلب فزونی علم می‌کنند، و آنان بزرگان هستند. و برخی می‌گویند سیراب شده‌ایم، پس طلب فزونی نمی‌کنند. و من جماعتی از آنان را دیدم که جاهل‌ترین طوایف هستند. و پیشوایانی از اشاعره را بر این قدم دیدم که گمان می‌کنند خدا را همان‌گونه که خود را می‌داند، می‌شناسند، بدون هیچ فزونی. پس اینان به جهل خود آسوده‌اند و ما از رستگاری آنان مأیوس شده‌ایم. و همچنین در انزعاج (الانزعاج) به سوی لقاء نیز جمع می‌شوند؛ برخی به سوی لقاء او دچار انزعاج (الانزعاج) می‌شوند و برخی به سوی لقاء آنچه از او می‌خواهند. و همچنین در انزعاج (الانزعاج) به سوی القاء و به سوی تلقی نیز جمع می‌شوند. و در این امر به اقسامی تقسیم می‌شوند: برخی متلقی عمومی هستند که از بزرگان مردانند. و برخی متلقی از ملک و از خدا هستند که از آنچه غیر از خاطر الهی و غیر از ملک می‌آید، روی گردانند. و برخی خاطر نفسی را علاوه بر این دو خاطر تلقی می‌کنند. و برخی تلقی خاطر شیطانی را بر ملکی و نفسی ترجیح می‌دهند، به دلیل اینکه مقابل است؛ زیرا القای دشمن محض است و خلاف حق (الحق) را القا می‌کند. و این متلقی می‌خواهد بر خلاف حق (الحق) از آن جهت که نزد شیطان خلاف است، وقوف یابد و به همین دلیل شیطان آن را القا کرده است. و این متلقی تماماً حق (الحق) است، زیرا تماماً نور است، بلکه عین نور است. پس می‌داند که ابلیس آنچه از حق (الحق) نزد او بود را نادانسته، زیرا گمان کرده که حق (الحق) نیست. پس این متلقی آن را به عنوان حق (الحق) از صورت شیطانی گرفت. و آنچه شیطان به او داد، در صورت ملک یا در صورت نفس انسانی حاصل نشد. و حکم شیطان از آن زایل شد، هنگامی که این متلقی آن را پذیرفت. زیرا شیطان به گمان خود می‌پندارد که آنچه به او القا کرده، امری موهوم الوجود است و نزد شیطان عدم است. و مرتبه این متلقی را ندانسته که او جز امری وجودی از او تلقی نکرده است. پس هنگامی که دید او هنگام گرفتن به آن عشق ورزیده و هیچ انحطاط مرتبه یا اثر جهلی در او ندیده است، تعجب کرد و نگریست که امر او از کجا بر او وارد شده و چه چیزی آن معدوم را موجود ساخته است. پس دانست که جهل تنها در او (شیطان) بوده است، نه در متلقی. و او همان کسی است که امر وجودی را بر او القا کرده، در حالی که آن را موهوم الوجود می‌پنداشته نه محقق. پس دید که در افزایش علو مرتبه او با علمی که به او رسانده، کوشیده است، در حالی که این را نمی‌خواسته، بلکه قصد آنچه شایسته خود بود را داشته است. پس ندانست که او (شیطان) محل هستی (الوجود) است، بلکه گمان کرد که محل ایهام هستی (الوجود) است نه تحقق آن. پس این متلقی در این تلقی، خلاق است و این کامل‌ترین مراتب اخذ در تلقی است.\n\n### [انزعاج (الانزعاج) رهبت (الرهبة)]\n\nو اما انزعاج (الانزعاج) رهبت (الرهبة)، مانند رغبت است؛ یا رهبت (الرهبة) از اوست، و آن قول اوست: «و أعوذ بك منك» (و از تو به تو پناه می‌برم). و یا رهبت (الرهبة) از چیزی است که از او صادر می‌شود، مانند عذاب حسی یا عذاب حجاب، که همان عذاب جهل یا تزیّن است. و در میان حجاب‌ها، هیچ حجابی غلیظ‌تر و قوی‌تر از حجاب تزیّن نیست؛ زیرا کسی که جهلش برای او زینت داده شده باشد، طلب آنچه را که به گمانش حاصل است، محال می‌داند، چون نزد او حاصل است، در حالی که در نفس‌الامر حاصل نیست. پس هر کس بخواهد از تزیّن در امان باشد، باید نزد ظاهر کتاب و سنت توقف کند و چیزی بر ظاهر نیفزاید؛ زیرا تأویل ممکن است از تزیّن باشد. پس آنچه ظاهر به او داده، بر آن جاری شود، و متشابهات آن را علمش را به خدا واگذار کند و به آن ایمان آورد. این شخص پیرو است و تزیّن بر او راهی ندارد و حجتی نزد خدا بر او اقامه نمی‌شود. اگر از اهل بصیرت باشد، بر بصیرت به سوی خدا دعوت می‌کند و بر بصیرت سخن می‌گوید، پس از تزیّن بری شده است. او صاحب علم صحیح است و از اهل زینت است نه از اهل تزیّن. پس انزعاج (الانزعاج) به سوی خدا ممکن است رهبت (الرهبة) از این نیز باشد. **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند).\n\nبسم الله الرحمن الرحیم"
  },
  "page_count": 3
}