{
  "id": 528,
  "title": {
    "ar": "الباب الثامن والعشرون وخمسمائة في معرفة حال قطب كان منزله وجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله",
    "en": "Chapter 528: Concerning the knowledge of the state of a Pole (Qutb) whose station is defined by the verse: <<وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله>> (And the recompense of an evil deed is an evil deed like it, but whoever pardons and makes reconciliation, then his reward is due from Allah).",
    "ur": "باب پانچ سو اٹھائیس: اس قطب (قطب) کے حال کی معرفت (معرفة) کے بیان میں جس کا مقام (منزل) یہ تھا:\n**وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ**\n(اور برائی کا بدلہ اسی جیسی برائی ہے، پھر جو کوئی معاف کر دے اور اصلاح کرے تو اس کا اجر اللہ کے ذمہ ہے۔)",
    "fa": "باب پانصد و بیست و هشتم در معرفت حال قطبی (قطب) که منزل او بود: وجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله (و جزای بدی، بدی‌ای مانند آن است؛ پس هر کس عفو کند و اصلاح نماید، پاداش او بر عهده خداست)"
  },
  "content": {
    "ar": "## «الباب الثامن والعشرون وخمسمائة في معرفة حال قطب كان منزله وجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله»\n\n\n> إن القبيح لأقسام مقسمة *** عرفية والتي التشريع بينها\n\n\n> فمن عفا عن مسي‏ء نفسه أنفت *** عن الجزاء لأن السوء عينها\n\n\n> فلا تكن بمحل للقبيح لأن *** الله بالصفة العليا زينها\n\n\n### [لا فقر إلا إلى الله تعالى‏]\n\n\nقال الله تعالى ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ وإن كان له جميع الأسماء التي يفتقر كل فقير إلى مسماها ولا فقر إلا إلى الله فإنه يقول يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله ومع هذا فلا يطلق عليه من الأسماء إلا ما يعطي الحسن عرفا وشرعا ولذلك نعت أسماءه بالحسنى وقال لنا فَادْعُوهُ بِها ثم قال وصية لنا وذَرُوا الَّذِينَ يُلْحِدُونَ في أَسْمائِهِ أي يميلون في أسمائه إلى ما ليس بحسن وإن كان في المعنى من أسمائه لكن منع أن يطلق عليه لما ناط به عرفا أو شرعا بأنه ليس بحسن وهنا قال سَيِّئَةٌ مِثْلُها فالسيئة الأولى سيئة شرعية صاحبها مأثوم عند الله والسيئة الثانية الجزائية ليست بسيئة شرعا وإنما هي سيئة من حيث إنها تسوء المجازي بها كالقصاص فيما لك أن تعفو عنه بهذا الشرط فلما رأى أهل الله أنه تعالى أطلق على ذلك اسم سيئة وقال مِثْلُها ومن اتصف بشي‏ء من ذلك فيقال فيه إنه مسي‏ء على حد ما سمي تلك سيئة سواء فأنف أهل الله أن يكونوا محلا للسوء فاختاروا العفو على الجزاء بالمثل نفاسة وتقديس نفس عن اسم لم يطلقه الله على نفسه كما أطلق الحسن ونبه على الزهد والترك للاخذ عليها بقوله وجَزاءُ سَيِّئَةٍ سَيِّئَةٌ ولم يقل وجزاء المسي‏ء فإن المسي‏ء هو الذي يجازى بما أساء لا السيئة فإن السيئة قد ذهب عينها وهي لا تقبل الجزاء ولو كانت موجودة فإنها لو قبلت الجزاء لزال عينها مثال ذلك إن الجرح الحاصل في الذي تعدى عليه فجرح إذا اقتص من الذي جرحه مثل ما تعدى عليه صار الآخر المجازي مجروحا وما بري‏ء الأول من جرحه فلو قبلت السيئة جزاء لزال عينها منه ولا يزول فلم يبق الجزاء إلا عين المكلف فإن كانت السيئة فعل المكلف لا مفعوله فقد ذهب عين الفعل بذهاب زمانه فلا يقبل الجزاء لأنه قد انعدم فلم يبق إلا المحل المسي‏ء فأنزل المسي‏ء منزلة السيئة وسمي بها وأضيف الجزاء لي السيئة فللمسي‏ء حكم لسيئة فَمَنِ اعْتَدى‏ عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ ما اعْتَدى‏ عَلَيْكُمْ هذا من أقوم القيل وإن كان القيل الإلهي كله قويما ولكن فيه قويم وأقوم بالنسبة إلينا لأنا قد قدمنا ما من شي‏ء يكون فيه كثرة أمثال إلا ولا بد فيه من التفاضل حتما لأنه لا شي‏ء فوق أسماء الله الحسنى ومع هذا تتفاضل بالإحاطة وعدم الإحاطة وينزل اسم إلهي عن اسم إلهي ويعلو اسم إلهي على اسم إلهي فالجزاء بالأمثال أبدا وما خرج عن الوزن والمقدار بالرجحان لا بالنقص فذلك خارج عن الجزاء ولهذا يرجع الحق عليه بعد ما كان له بخلافه في الخير والحسن فإن الرجحان فيه فضيلة يثنى عليه بها وما أحسن‏\n\n\nقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في صاحب التسعة فاسمع الولي وقد حكم له بالقصاص أما إنه إن قتله كان مثله‏\n\n\nيعني قوله وجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها فسمي قاتلا بلا شك فتركه وعفا وهذا من السياسة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 528: Concerning the Knowledge of the State of a Pole [Qutb] Whose Station Was: <<The recompense of an evil deed is an evil deed like it, but whoever pardons and makes reconciliation—his reward is due from Allah>>.\n\nThe ugly (القبيح) is divided into distinct categories,\nSome conventional (عرفية) and others defined by the Sacred Law (التشريع).\n\nWhoever pardons the one who wronged him, his soul disdains\nRetribution, because the evil (السوء) is the very essence of the act.\n\nSo do not be a locus (محل) for the ugly, because\nAllah has adorned it with the Highest Attribute.\n\n### [There is no poverty/need except toward Allah, the Exalted]\n\nAllah, the Exalted, said: <<And to Allah belong the Most Beautiful Names (الأسماء الحسنى)>>. Although He possesses all the Names whose referents every needy person requires, and there is no need (فقر) except toward Allah, for He says: <<O mankind, you are the needy toward Allah>>. Despite this, only those Names are applied to Him that convey beauty (al-ḥusn) conventionally (عرفًا) and legally (شرعًا). For this reason, He described His Names as the Most Beautiful (al-Ḥusnā) and commanded us: <<So invoke Him by them>>. Then, as a counsel to us, He said: <<And leave those who deviate (يُلْحِدُونَ) concerning His Names>>—meaning, those who incline in His Names toward what is not beautiful, even if it is conceptually among His Names. However, it is forbidden to apply such a name to Him because of what is attached to it, conventionally or legally, that renders it not beautiful.\n\nIn this context, He said: <<an evil deed (سيئة) like it>>. The first evil deed (al-sayyi’a) is a legal evil deed (سيئة شرعية); its perpetrator is sinful in the sight of Allah. The second evil deed, which is the recompense (الجزائية), is not legally an evil deed. Rather, it is an evil deed in the sense that it causes distress (tasū’u) to the one being recompensed, like retaliation (القصاص) in a matter where you have the option to pardon under this condition.\n\nWhen the People of Allah (أهل الله) observed that the Exalted One applied the name 'evil deed' to that act [retribution] and said 'like it,' and that whoever is characterized by such an act is called an 'evildoer' (مسئ), just as that act was called an evil deed—the People of Allah disdained to be a locus (محل) for evil. Thus, they chose pardon over retribution in kind (الجزاء بالمثل), out of nobility and the sanctification (تقديس) of the self from a name that Allah did not apply to Himself, just as He applied the beautiful (al-ḥusn). He drew attention to asceticism (الزهد) and the abandonment of taking retribution by His saying: <<The recompense of an evil deed is an evil deed>>.\n\nHe did not say, \"And the recompense of the evildoer (المسيء),\" for the evildoer is the one who is recompensed for the evil he committed, not the evil deed itself (السيئة). The evil deed has already vanished in its essence (عينها), and it does not accept recompense. Even if it were existent, if it accepted recompense, its essence would cease to be. An example of this is the wound inflicted upon the victim of aggression: if retaliation (القصاص) is taken against the aggressor exactly as he transgressed, the second person (the one being recompensed) becomes wounded, but the first person is not healed of his wound. If the evil deed accepted recompense, its essence would vanish from the victim, but it does not vanish. Therefore, the recompense remains only the essence of the responsible agent (المكلف).\n\nSince the evil deed is the act (فعل) of the responsible agent, not the object of his action (مفعوله), the essence of the act has vanished with the passing of its time, so it cannot accept recompense because it has ceased to exist. Nothing remains except the locus (المحل), the evildoer. Thus, the evildoer was treated as the evil deed, named by it, and the recompense was attributed to the evil deed. Therefore, the evildoer takes the ruling of the evil deed.\n\n<<So whoever commits aggression against you, commit aggression against him in the same measure as he committed aggression against you>>. This is among the most upright of sayings (أقوم القيل), even though all Divine Sayings are upright (قويم). However, there is the upright and the more upright (أقوم) relative to us. This is because we have previously established that whenever there is a multiplicity of similitudes (كثرة أمثال) in something, there must inevitably be differentiation (التفاضل) within it. Nothing is above the Most Beautiful Names of Allah (الأسماء الحسنى), yet they differentiate by encompassing or not encompassing, and one Divine Name descends below another Divine Name, and one Divine Name rises above another Divine Name.\n\nThus, recompense is always by similitudes (الأمثال). Whatever exceeds the measure and quantity by increase (الرجحان), not by decrease, that is outside the scope of recompense. For this reason, the right (الحق) returns against the person after it was due to him. This is contrary to goodness (الخير) and beauty (الحسن), where increase is a virtue for which one is praised. And how excellent is the saying of the Messenger of Allah (may Allah bless him and grant him peace) concerning the man of the nine [wounds]: \"Listen, O guardian (ولي)! Retaliation (القصاص) has been decreed for him. However, if he kills him, he will be like him.\"\n\nThis refers to His saying: <<The recompense of an evil deed is an evil deed like it>>. Thus, he would undoubtedly be called a killer. So, he abandoned the retribution and pardoned. This is part of spiritual governance (السياسة). And Allah <<says the truth, and He guides to the way>>.",
    "ur": "باب پانچ سو اٹھائیس: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور برائی (سَيِّئَةٌ) کا بدلہ اسی جیسی برائی (سَيِّئَةٌ) ہے، پھر جس نے معاف کر دیا اور اصلاح کی تو اس کا اجر اللہ کے ذمہ ہے\"۔\n\nبیشک قبیح (برائی) مختلف اقسام میں منقسم ہے،\nکچھ عرفی ہیں اور کچھ وہ جنہیں شریعت نے بیان کیا ہے۔\n\nپس جس نے اپنے برائی کرنے والے کو معاف کر دیا،\nاس کی روح بدلہ لینے سے نفرت کرتی ہے، کیونکہ وہ برائی (السوء) عین اس کی ذات ہے۔\n\nپس تم قبیح (برائی) کا محل نہ بنو،\nکیونکہ اللہ نے اسے (نفس کو) صفت علیا کے ساتھ مزین کیا ہے۔\n\n### [اللہ تعالیٰ کے سوا کوئی فقر نہیں]\n\nاللہ تعالیٰ نے فرمایا: \"اور اللہ ہی کے لیے اسماء حسنیٰ (الْأَسْماءُ الْحُسْنىٰ) ہیں\"۔ اگرچہ اس کے لیے تمام اسماء ہیں جن کے مسمیٰ کا ہر محتاج (فقیر) محتاج ہے، اور اللہ کے سوا کوئی فقر نہیں، کیونکہ وہ فرماتا ہے: \"اے لوگو! تم ہی اللہ کے محتاج (الْفُقَراءُ إِلَى الله) ہو\"۔ اس کے باوجود، اس پر صرف وہی اسماء مطلقاً استعمال کیے جاتے ہیں جو عرفاً اور شرعاً حسن (اچھے) معنی دیتے ہیں۔ اسی لیے اس نے اپنے اسماء کو حسنیٰ (بہترین) قرار دیا اور ہمیں فرمایا: \"پس تم اسے انہی کے ذریعے پکارو (فَادْعُوهُ بِها)\"۔ پھر ہمارے لیے وصیت کرتے ہوئے فرمایا: \"اور ان لوگوں کو چھوڑ دو جو اس کے اسماء میں الحاد (ذَرُوا الَّذِينَ يُلْحِدُونَ في أَسْمائِهِ) کرتے ہیں\"۔ یعنی وہ اپنے اسماء میں اس طرف مائل ہوتے ہیں جو حسن نہیں ہے، اگرچہ وہ معنی کے اعتبار سے اس کے اسماء میں شامل ہو، لیکن اس کا اطلاق ممنوع قرار دیا گیا کیونکہ عرفاً یا شرعاً اس کے ساتھ جو چیز وابستہ ہے وہ حسن نہیں ہے۔\n\nاور یہاں فرمایا: \"اسی جیسی برائی (سَيِّئَةٌ مِثْلُها)\"۔ پس پہلی برائی (سیئہ) شرعی برائی ہے، جس کا مرتکب اللہ کے ہاں گناہ گار ہے۔ اور دوسری برائی (سیئہ) جو بدلے کے طور پر ہے، وہ شرعاً برائی نہیں ہے، بلکہ وہ صرف اس لحاظ سے برائی ہے کہ وہ بدلہ دیے جانے والے کو تکلیف دیتی ہے، جیسے قصاص میں، جبکہ تمہیں اس شرط کے ساتھ معاف کرنے کا اختیار ہے۔\n\nجب اہل اللہ (أهل الله) نے دیکھا کہ اللہ تعالیٰ نے اس (بدلے) پر بھی برائی (سیئہ) کا نام مطلقاً استعمال کیا اور فرمایا: \"اسی جیسی (مِثْلُها)\"، اور جو شخص اس میں سے کسی چیز سے متصف ہو تو اسے اسی طرح مسیء (برائی کرنے والا) کہا جاتا ہے جس طرح اس (پہلی) کو سیئہ کہا گیا، تو اہل اللہ (أهل الله) نے اس بات سے نفرت کی کہ وہ برائی (السوء) کا محل بنیں۔ چنانچہ انہوں نے بدلے کے بجائے عفو (معافی) کو اختیار کیا، یہ ان کے نفس کی نفاس اور تقدیس تھی کہ وہ ایسے نام سے پاک رہیں جسے اللہ نے اپنے اوپر مطلقاً استعمال نہیں کیا، جیسا کہ اس نے حسن (اچھائی) کا اطلاق کیا۔\n\nاور اللہ نے اس پر بدلہ لینے سے زہد اور ترک کی طرف اشارہ اپنے اس قول سے کیا: \"اور برائی (سَيِّئَةٌ) کا بدلہ برائی (سَيِّئَةٌ) ہے\"۔ اور یہ نہیں فرمایا کہ \"مسیء (برائی کرنے والے) کا بدلہ\"۔ کیونکہ مسیء ہی وہ ہے جسے اس کی برائی کا بدلہ دیا جاتا ہے، نہ کہ سیئہ (برائی) کو۔ کیونکہ سیئہ کا وجود (عین) تو جا چکا ہے اور وہ بدلہ قبول نہیں کرتی۔ اگر وہ موجود بھی ہوتی، تب بھی اگر وہ بدلہ قبول کرتی تو اس کا وجود زائل ہو جاتا، جبکہ ایسا نہیں ہوتا۔ اس کی مثال یہ ہے کہ جس شخص پر زیادتی کی گئی اور اسے زخمی کیا گیا، اگر اس شخص سے قصاص لیا جائے جس نے اسے زخمی کیا تھا، تو دوسرا (بدلہ دیے جانے والا) بھی زخمی ہو جاتا ہے، لیکن پہلے شخص کا زخم ٹھیک نہیں ہوتا۔ پس اگر سیئہ بدلہ قبول کرتی تو اس کا وجود اس سے زائل ہو جاتا، حالانکہ وہ زائل نہیں ہوتا۔ لہٰذا بدلہ صرف مکلف (ذمہ دار شخص) کی ذات (عین) پر ہی باقی رہتا ہے۔\n\nاگر سیئہ مکلف کا فعل ہے نہ کہ اس کا مفعول، تو فعل کا وجود (عین) اس کے وقت کے گزر جانے سے ختم ہو چکا ہے، لہٰذا وہ بدلہ قبول نہیں کر سکتا کیونکہ وہ معدوم ہو چکا ہے۔ پس صرف مسیء (برائی کرنے والا) محل باقی رہا۔ چنانچہ مسیء کو سیئہ کے مقام پر اتارا گیا اور اسی کا نام دیا گیا، اور بدلہ سیئہ کی طرف منسوب کیا گیا۔ پس مسیء کے لیے سیئہ کا حکم ہے۔ \"پس جس نے تم پر زیادتی کی (فَمَنِ اعْتَدى‏ عَلَيْكُمْ)، تو تم بھی اس پر اسی قدر زیادتی کرو جس قدر اس نے تم پر کی (فَاعْتَدُوا عَلَيْهِ بِمِثْلِ ما اعْتَدى‏ عَلَيْكُمْ)\"۔ یہ سب سے زیادہ مضبوط قول (أقوم القيل) میں سے ہے، اگرچہ تمام الٰہی قول مضبوط (قویم) ہیں، لیکن ہمارے اعتبار سے ان میں مضبوط اور زیادہ مضبوط (أقوم) موجود ہیں۔ کیونکہ ہم پہلے بیان کر چکے ہیں کہ کوئی بھی چیز جس میں امثال (مثالوں) کی کثرت ہو، اس میں لازماً تفاضل (درجات کا فرق) ہوتا ہے۔ کیونکہ اسماء اللہ الحسنیٰ سے بڑھ کر کوئی چیز نہیں، اس کے باوجود وہ احاطہ کرنے اور احاطہ نہ کرنے کے لحاظ سے ایک دوسرے سے افضل ہوتے ہیں، اور ایک الٰہی اسم دوسرے الٰہی اسم سے نیچے ہوتا ہے اور ایک الٰہی اسم دوسرے الٰہی اسم سے بلند ہوتا ہے۔\n\nپس بدلہ ہمیشہ امثال (مثالوں) کے ساتھ ہوتا ہے۔ اور جو چیز وزن اور مقدار سے زیادہ ہو کر نکل جائے، نہ کہ کمی کے ساتھ، تو وہ بدلے سے خارج ہے۔ اسی لیے حق (بدلہ لینے کا حق) اس پر لوٹ آتا ہے، جبکہ پہلے وہ اس کا حقدار تھا۔ اس کے برعکس خیر اور حسن (اچھائی) میں، جہاں زیادتی (رجحان) ایک فضیلت ہے جس پر اس کی تعریف کی جاتی ہے۔ اور کیا ہی خوب ہے\n\nرسول اللہ صلی اللہ علیہ وسلم کا قول نو (۹) افراد کے ساتھی کے بارے میں۔ پس ولی (جسے قصاص کا حکم دیا گیا تھا) نے سنا: \"خبردار! اگر وہ اسے قتل کرے گا تو وہ بھی اسی جیسا ہو جائے گا\"۔\n\nیعنی اللہ کے اس قول کی وجہ سے: \"اور برائی (سَيِّئَةٌ) کا بدلہ اسی جیسی برائی (سَيِّئَةٌ مِثْلُها) ہے\"۔ پس وہ بلاشبہ قاتل کہلائے گا، چنانچہ اس نے اسے چھوڑ دیا اور معاف کر دیا۔ اور یہ سیاست (تدبیر) میں سے ہے۔ اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے (وَاللهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و بیست و هشتم در شناخت حال قطبی که منزل او بود و [آیه] «و جزای بدی، بدی‌ای است مانند آن؛ پس هر که درگذرد و اصلاح کند، پاداش او بر عهده خداست» (وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله).\n\nهمانا زشتی به بخش‌هایی تقسیم شده است *** که بخشی عرفی است و بخشی که شریعت آن را بیان کرده است\nپس هر کس از بدکار درگذرد، نفسش از جزا دادن ابا کند *** زیرا آن بدی (سوء) عین آن [نفس] است\nپس جایگاه زشتی مباش، زیرا *** خداوند آن را با صفت برتر آراسته است\n\n[هیچ فقری جز به سوی خداوند متعال نیست]\n\nخداوند متعال می‌فرماید: «و نام‌های نیکو (حسنی) از آن خداست» (وَلِلَّهِ الْأَسْماءُ الْحُسْنى). اگرچه همه نام‌هایی که هر فقیر به مسمای آن نیازمند است، از آن اوست و هیچ فقری جز به سوی خدا نیست، زیرا او می‌فرماید: «ای مردم، شما نیازمندان به سوی خدا هستید» (يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله). با این حال، از میان نام‌ها، تنها نام‌هایی بر او اطلاق می‌شود که از نظر عرف و شرع نیکویی (حسن) را افاده کند. به همین دلیل، نام‌های خود را به «حسنی» (نیکوترین) وصف کرد و به ما فرمود: «پس او را با آن‌ها بخوانید» (فَادْعُوهُ بِها). سپس به عنوان وصیتی برای ما فرمود: «و کسانی را که در نام‌های او کج‌روی می‌کنند (الحاد)، رها کنید» (وَذَرُوا الَّذِينَ يُلْحِدُونَ في أَسْمائِهِ). یعنی کسانی که در نام‌های او به سوی آنچه نیکو نیست، متمایل می‌شوند. اگرچه آن نام‌ها در معنا جزو نام‌های اوست، اما از اطلاق آن بر او منع شده است، زیرا عرفاً یا شرعاً به آن چیزی پیوسته است که نیکو نیست.\n\nو در اینجا فرمود: «بدی‌ای مانند آن» (سَيِّئَةٌ مِثْلُها). بدی اول، بدی شرعی است که صاحبش نزد خدا گناهکار (مأثوم) است. و بدی دوم که جزایی است، شرعاً بدی نیست، بلکه از آن جهت بدی است که مجازات‌شونده را ناخوش می‌آید (تسوء)، مانند قصاص در مواردی که با این شرط حق عفو داری. پس چون اهل الله (سالکان) دیدند که خداوند متعال بر آن [جزا] نام بدی (سیئه) نهاده و فرموده است «مانند آن» (مِثْلُها)، و کسی که به چیزی از آن متصف شود، به همان اندازه که آن [جزا] را سیئه نامیده، به او نیز «مسیء» (بدکار) گفته می‌شود. از این رو، اهل الله ابا کردند که جایگاه بدی باشند و از روی نفاس و پاک‌سازی نفس از نامی که خداوند آن را بر خود اطلاق نکرده است (همان‌طور که حسن را اطلاق کرده)، عفو را بر جزا دادن به مثل ترجیح دادند. و با این سخن خود که «و جزای بدی، بدی‌ای است» (وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ) و نفرمود «و جزای بدکار»، بر زهد و ترک گرفتن جزا هشدار داد.\n\nزیرا بدکار (مسیء) کسی است که به خاطر بدی‌اش جزا داده می‌شود، نه خود بدی (سیئه). چرا که عین بدی از بین رفته است و آن [بدی] جزا را نمی‌پذیرد. حتی اگر موجود بود، اگر جزا را می‌پذیرفت، عین آن از بین می‌رفت. مثال آن: زخمی که در کسی که مورد تجاوز قرار گرفته و زخمی شده، ایجاد شده است؛ اگر از کسی که او را زخمی کرده، به همان اندازه که تجاوز کرده، قصاص شود، آن دیگری که جزا داده شده، زخمی می‌شود، اما زخم اولی بهبود نمی‌یابد. پس اگر بدی جزا را می‌پذیرفت، عین آن از بین می‌رفت، در حالی که از بین نمی‌رود. بنابراین، جزا باقی نمی‌ماند مگر بر عین مکلف. اگر بدی، فعل مکلف باشد نه مفعول او، عین فعل با گذشت زمانش از بین رفته است و جزا را نمی‌پذیرد، زیرا معدوم شده است. پس باقی نمی‌ماند مگر محل بدکار (مسیء). بنابراین، بدکار را به منزله بدی قرار داد و او را به آن نامید و جزا را به بدی اضافه کرد. پس بدکار حکم بدی را دارد.\n\n«پس هر کس بر شما تجاوز کرد، شما نیز به همان اندازه که بر شما تجاوز کرده، بر او تجاوز کنید» (فَمَنِ اعْتَدى‏ عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ ما اعْتَدى‏ عَلَيْكُمْ). این از استوارترین گفتارهاست، اگرچه همه گفتار الهی استوار است، اما نسبت به ما، در آن استوار و استوارتر وجود دارد. زیرا پیشتر بیان کردیم که هیچ چیزی که در آن کثرت امثال باشد، نیست مگر اینکه حتماً در آن تفاضل (برتری) وجود دارد. چون هیچ چیز بالاتر از اسماء الله الحسنی نیست، با این حال، آن‌ها به واسطه احاطه و عدم احاطه با یکدیگر تفاوت دارند؛ و یک اسم الهی از اسم الهی دیگر پایین‌تر می‌آید و یک اسم الهی بر اسم الهی دیگر برتری می‌یابد. پس جزا همیشه به مثل‌هاست. و آنچه از وزن و مقدار خارج شود، به واسطه فزونی (رجحان) نه کاستی، از جزا خارج است. به همین دلیل، حق پس از آنکه برای او بود، بر او باز می‌گردد. برخلاف آن در خیر و نیکی، که فزونی در آن فضیلتی است که به واسطه آن ستایش می‌شود. و چه نیکوست\n\nسخن رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) درباره صاحب نُه [نفر]، پس بشنو ای ولی (سرپرست)، در حالی که برای او حکم قصاص صادر شده بود: «اما اگر او را بکشد، مانند او خواهد بود.»\n\nیعنی [مصداق] سخن او: «و جزای بدی، بدی‌ای است مانند آن» (وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها). پس بی‌شک قاتل نامیده می‌شود. از این رو، او را رها کرد و عفو نمود. و این از سیاست [الهی] است. و خداوند حق را می‌گوید و او راه را هدایت می‌کند (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 1
}