{
  "id": 134,
  "title": {
    "ar": "الباب الرابع والثلاثون ومائة في معرفة مقام الإخلاص",
    "en": "Chapter One Hundred and Thirty-Four: On the Knowledge of the Station of Sincerity (مقام الإخلاص)",
    "ur": "باب ایک سو چونتیس: مقام اخلاص کی معرفت میں",
    "fa": "باب صد و سی و چهارم در معرفت مقام اخلاص"
  },
  "content": {
    "ar": "## (الباب الرابع والثلاثون ومائة في معرفة مقام الإخلاص)\n\n\n> من أخلص الدين فذاك الذي *** لنفسه الرحمن يستخلصه‏\n\n\n> فكل نقصان إذا لم يكن *** في كونه فإنه ينقصه‏\n### [الاسم الأحد ينطلق على كل شي‏ء مع كونه نعتا إلهيا]\n\n\nاعلم أن الاسم الأحد ينطلق على كل شي‏ء من ملك وفلك وكوكب وطبيعة وعنصر ومعدن ونبات وحيوان وإنسان مع كونه نعتا إلهيا في قوله قُلْ هُوَ الله أَحَدٌ وجعله نعتا كونيا في قوله ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً وما من صنف ذكرناه من هؤلاء الأصناف الذين هم جميع ما سوى الله وقد حصرناهم إلا وقد عبد منهم أشخاص فمنهم من عبد الملائكة ومنهم من عبد الكواكب ومنهم من عبد الأفلاك ومنهم من عبد العناصر ومنهم من عبد الأحجار ومنهم من عبد الأشجار ومنهم من عبد الحيوان ومنهم من عبد الجن والإنس‏\n\n\n### [المخلص في العبادة التي هي له ذاتية أن لا يقصد بها إلا من أوجده‏]\n\n\nفالمخلص في العبادة التي هي ذاتية له أن لا يقصد إلا من أوجده وخلقه وهو الله تعالى فتخلص له هذه العبادة ولا يعامل بها أحدا ممن ذكرناه أي لا يراه في شي‏ء مما ذكرناه لا من حيث عين ذلك الشي‏ء ولا من حيث نسبة الأحدية له فإن الناظر أيضا له أحدية فليعبد نفسه فهو أولى له ولا يذل لاحدية مثله إذ ولا بد من ذلته لغير أحدية خالقه فيكون أعلى همة ممن ذل لاحدية مخلوق مثله‏\n\n\n### [ما من مخلوق إلا وفيه نفس دعوى ربوبية]\n\n\nوما من شي‏ء من المخلوقات إلا وفيه نفس دعوى ربوبية لما يكون عنه في الكون من المنافع والمضار فما من شي‏ء في الكون إلا وهو ضار نافع فهذا القدر فيه من الربوبية العامة وبها يستدعي ذلة الخلق إليه أ لا ترى الإنسان على شرفه على سائر الموجودات بخلافته كيف يفتقر إلى شرب دواء يكرهه طبعا لعلمه بما فيه من المنفعة له فقد عبده من حيث لا يشعر كرها وإن كان من الأدوية المستلذة لمزاج هذا المريض وهو قد علم إن استعماله ينفعه فقد عبده من حيث لا يشعر طوعا ومحبة وكذا قال الله ولِلَّهِ يَسْجُدُ من في السَّماواتِ والْأَرْضِ طَوْعاً وكَرْهاً وخذ الوجود كله على ما بينته لك‏\n\n\n### [الافتقار إلى جلب المنافع والحاجة إلى دفع المضار أدى النفوس الضعيفة إلى عبادة الأشياء]\n\n\nفإنه ما من شي‏ء في الكون إلا وفيه ضرر ونفع فاستجلب بهذه الصفة الإلهية نفوس المحتاجين إليه لافتقارهم إلى المنفعة ودفع المضار فأداهم ذلك إلى عبادة الأشياء وإن لم يشعروا ولكن الاضطرار إليها يكذبهم في ذلك فإن الإنسان يفتقر إلى أخس الأشياء وأنقصها في الوجود وهو مكان الخلأ عند الحاجة يترك عبادة ربه بل لا يجوز له في الشرع أداؤها وهو حاقن فيبادر إلى الخلأ ولا سيما إذا أفرطت الحاجة فيه واضطرته بحيث تذهب بعقله ما يصدق متى يجد إليه سبيلا فإذا وصل إليه وجد الراحة عنده وألقى إليه ما كان أقلقه فإذا وجد الراحة خرج من عنده وكأنه قط ما احتاج إليه وكفر نعمته واستقذره وذمه وهذا هو كفر بالنعمة والمنعم‏\n\n\n### [الدين الخالص هو الدين المستخلص من أيدى ربوبية الأكوان‏]\n\n\nولما علم الله ما أودعه في خلقه وما جعل في الثقلين من الحاجة إلى ما أودع الله في الموجودات وفي الناس بعضهم لبعض قال فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً أي لا يشوبه فساد ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً أي لا يذل إلا لله لا لغيره وأمر أن نعبده مُخْلِصِينَ لَهُ الدِّينَ وقال أَلا لِلَّهِ الدِّينُ الْخالِصُ وهو الدين المستخلص من أيدي ربوبية الأكوان فإذا لم ير شيئا سوى الله وأنه الواضع أسباب المضار والمنافع لجأ إلى الله في دفع ما يضره ونيل ما ينفعه من غير تعيين سبب فهذا معنى الإخلاص‏\n\n\n### [المخلصون- بفتح اللام- والمخلصون- بكسر اللام-]\n\n\nولا يصح وجود الإخلاص إلا من المخلصين بفتح اللام فإن الله إذا اعتنى بهم استخلصهم من ربوبية الأسباب التي ذكرناها فإذا استخلصهم كانوا مخلصين بكسر اللام وإنما أضاف إليهم الإخلاص ابتلاء ليرى هل يحصل لهم امتنان بذلك على الحق أم لا وقد وجد في قوله يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا فإن منوا بذلك وبخوا ونبهوا بقوله بَلِ الله يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ لِلْإِيمانِ إِنْ كُنْتُمْ صادِقِينَ في دعواكم إنكم مؤمنون فعراهم من هذه الصفة أن تكون لهم كسبا\n\n\n### [ينبغي للعاقل أن لا يأمن مكر الله في إنعامه‏]\n\n\nفينبغي للعاقل أن لا يأمن مكر الله في إنعامه فإن المكر فيه أخفى منه في البلاء وأدنى المكر فيه إن يرى نفسه مستحقا لتلك النعمة وأنها من أجله خلقت فإن الله ليس بمحتاج إليها فهي لي بحكم الاستحقاق هذا أدنى المكر الذي تعطيه المعرفة ويسمى صاحبه عارفا في العامة وهو في العارفين جاهل إذ قد بينا فيما قبل إن الأشياء إنما خلقت له تعالى لتسبح بحمده وكان انتفاعنا بها بحكم التبعية لا بالقصد الأول ففطر العالم كله على تسبيحه بحمده وعبادته ودعا الثقلين إلى ذلك وعرف أن لذلك خلقهم لا لأنفسهم ولا لشي‏ء من المخلوقات مع ما في الوجود من وقوع الانتفاع بها بعضها من بعض وقال تعالى في الحديث الغريب الصحيح من عمل عملا أشرك فيه غيري فأنا منه بري‏ء وهو للذي أشرك‏\n\n\nفطلب من عباده إخلاص العمل له فمنهم من أخلصه له جملة واحدة فما أشرك في العمل بحكم القصد فما قصد به إلا الله ولا أشرك في العمل نفسه بأنه الذي عمل بل عمله خلق لله فالأول عموم والثاني خصوص وهو غاية الإخلاص ولا يصح إخلاص إلا مع عمل أعني في عمل فإنه لا بد من شي‏ء يكون مستخلصا\nبفتح اللام وحينئذ يجد الإخلاص محلا يكون لذلك العمل يسمى به العمل خالصا والعامل مخلصا والله الموفق لذلك‏\n\n",
    "en": "## Chapter 134: Concerning the Knowledge of the Station of Sincerity (مقام الإخلاص)\n\nHe who makes the Religion sincere, that is the one\nWhom the All-Merciful chooses (يستخلصه) for Himself.\n\nFor every deficiency, if it is not\nIn its very being (كونه), then it diminishes it.\n\n### [The Name *al-Ahad* (The One) Applies to Everything While Being a Divine Attribute]\n\nKnow that the Name *al-Ahad* (The One) applies to everything—angel, celestial sphere, star, nature, element, mineral, plant, animal, and human—even though it is a Divine Attribute (نعت إلهي), as in His saying: <<قُلْ هُوَ الله أَحَدٌ>> (Say: He is Allah, [The] One). And He made it a cosmic attribute (نعتا كونيا) in His saying: <<ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً>> (And let him not associate anyone [أحداً] in the worship of his Lord).\n\nThere is no category we have mentioned among these categories, which encompass everything other than Allah, and which we have enumerated, but that individuals have worshipped persons from them. Thus, some have worshipped the angels, some the stars, some the celestial spheres, some the elements, some the stones, some the trees, some the animals, and some the jinn and humans.\n\n### [The Sincere One in Worship, Which is Inherent to Him, Intends None but His Originator]\n\nThe sincere one (المخلص) in the worship that is inherent (ذاتية) to him is he who intends none but the One who brought him into existence and created him, which is Allah, the Exalted. Thus, this worship becomes pure (تخلص) for Him, and he does not deal with it toward anyone we have mentioned. That is, he does not see Him in anything mentioned, neither from the perspective of the essence (عين) of that thing itself, nor from the perspective of the attribution of Oneness (الأحدية) to it.\n\nFor the observer also possesses a oneness (أحدية), so let him worship himself, for that would be more appropriate for him. He should not humble himself to the oneness of his like, since his humility must necessarily be directed toward the Oneness of his Creator. Thus, he possesses a higher aspiration (أعلى همة) than one who humbles himself to the oneness of a creature like himself.\n\n### [There is No Creature Except That It Contains the Very Claim of Lordship]\n\nThere is nothing among the creatures (المخلوقات) except that it contains the very claim of Lordship (دعوى ربوبية) due to the benefits (المنافع) and harms (المضار) that proceed from it in existence (الكون). There is nothing in the cosmos (الكون) except that it is both harmful and beneficial. This measure of general Lordship (الربوبية العامة) is present in it, and by it, it demands the humility (ذلة) of creation toward it.\n\nDo you not see how the human being, despite his nobility over all other existents due to his vicegerency (خلافته), is compelled to drink a medicine that he naturally dislikes, knowing the benefit it holds for him? He has thus worshipped it involuntarily (كرها) without realizing it. And if the medicine is one that is pleasing to the temperament of this patient, and he knows that its use benefits him, he has worshipped it voluntarily (طوعا) and lovingly (محبة) without realizing it. Similarly, Allah said: <<ولِلَّهِ يَسْجُدُ من في السَّماواتِ والْأَرْضِ طَوْعاً وكَرْهاً>> (And to Allah prostrates whoever is in the heavens and the earth, willingly or unwillingly). Apply this to the entirety of Existence (الوجود) as I have explained it to you.\n\n### [Dependence on Attaining Benefits and the Need to Repel Harms Led Weak Souls to the Worship of Things]\n\nFor there is nothing in the cosmos (الكون) except that it contains harm and benefit. By means of this Divine Attribute (الصفة الإلهية), it attracts the souls of those who are in need of it, due to their dependence (افتقارهم) on benefit and the repulsion of harm. This leads them to the worship of things, even if they do not realize it. However, their necessity (الاضطرار) for these things gives the lie to their denial.\n\nIndeed, a human being is dependent upon the basest and most deficient things in Existence (الوجود), such as the place of evacuation (مكان الخلأ) when necessity arises. He abandons the worship of his Lord—indeed, the Law (الشرع) does not permit him to perform it while he is holding back his needs (حاقن)—and rushes to the latrine, especially if the need is excessive and compels him to the point of distraction, making him unable to believe when he will find a way to it. When he reaches it, he finds comfort there and casts off what had distressed him. Once he finds relief, he leaves it as if he had never needed it at all, denying its favor (كفر نعمته), finding it repulsive, and condemning it. This is ingratitude (كفر) toward the favor and the Bestower of the favor.\n\n### [The Pure Religion is the Religion Extracted from the Hands of the Lordship of the Cosmoses]\n\nSince Allah knew what He had deposited in His creation, and the need He placed in the two weighty ones (الثقلين—jinn and humans) for what He deposited in the existents and in people for one another, He said: <<فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً>> (So whoever hopes for the meeting with his Lord, let him do righteous work), meaning, work that is not tainted by corruption. And <<ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً>> (and not associate anyone in the worship of his Lord), meaning, let him not humble himself except to Allah, not to anyone else.\n\nHe commanded us to worship Him <<مُخْلِصِينَ لَهُ الدِّينَ>> (making the religion sincere for Him). And He said: <<أَلا لِلَّهِ الدِّينُ الْخالِصُ>> (Unquestionably, to Allah belongs the pure religion). This is the religion extracted (المستخلص) from the hands of the lordship (ربوبية) of the cosmoses (الأكوان). Thus, when one sees nothing other than Allah, and that He is the Establisher of the causes of harm and benefit, he resorts to Allah for repelling what harms him and attaining what benefits him, without specifying a cause. This is the meaning of Sincerity (الإخلاص).\n\n### [The Purified Ones (*Mukhlaṣūn*) and the Sincere Ones (*Mukhliṣūn*)]\n\nThe existence of Sincerity (الإخلاص) is only valid from the *Mukhlaṣūn* (the purified/chosen ones, with a *fatḥa* on the *lām*). For when Allah cares for them, He extracts (استخلصهم) them from the lordship of the causes (ربوبية الأسباب) we mentioned. When He extracts them, they become *Mukhliṣūn* (the sincere ones, with a *kasra* on the *lām*).\n\nHe only attributed Sincerity to them as a test, to see whether they would feel obliged (امتنان) to The Real (الحق) because of it or not. This is found in His saying: <<يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا>> (They consider it a favor to you that they have submitted). If they consider it a favor, they are rebuked and alerted by His saying: <<بَلِ الله يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ لِلْإِيمانِ إِنْ كُنْتُمْ صادِقِينَ>> (Rather, Allah confers favor upon you that He has guided you to faith, if you should be truthful) in your claim that you are believers. Thus, He stripped them of this attribute being something they earned (كسبا).\n\n### [The Intelligent Person Should Not Feel Secure from Allah’s Subtle Planning in His Bestowal of Blessings]\n\nThe intelligent person (العاقل) should not feel secure from the subtle planning (مكر) of Allah in His bestowal of blessings (إنعامه), for the subtle planning in blessings is more hidden than it is in affliction (البلاء). The least of the subtle planning therein is that one sees himself as deserving (مستحقا) of that blessing, and that it was created for his sake, arguing that Allah has no need of it, so it belongs to me by right of deservingness (الاستحقاق).\n\nThis is the least of the subtle planning that *gnosis* (المعرفة) grants, and its possessor is called a *Gnostic* (*‘Arif*) among the common people, but among the true Gnostics (العارفين), he is ignorant. For we have previously explained that things were only created for Him, the Exalted, so that they might glorify Him with His praise, and our benefit from them is by way of consequence (التبعية), not by primary intention (القصد الأول). Thus, the entire World (العالم) was created upon the natural disposition (فطر) of glorifying Him with His praise and worshipping Him. He called the two weighty ones (الثقلين) to this, and made known that He created them for that purpose, not for themselves nor for any of the creatures, despite the fact that mutual benefit occurs among them in Existence (الوجود).\n\nAnd the Exalted said in the sound, rare *Hadith*: \"Whoever performs a deed in which he associates other than Me, I am free of him, and it belongs to the one he associated.\"\n\nThus, He demanded from His servants the sincerity (إخلاص) of the deed for Him. Some of them made it sincere for Him entirely, not associating anything in the deed by way of intention (القصد), intending none but Allah by it. Nor did he associate himself in the deed by believing that he was the one who performed it; rather, his deed is a creation of Allah. The first is general (عموم), and the second is specific (خصوص), and this is the ultimate degree of Sincerity (غاية الإخلاص).\n\nSincerity (إخلاص) is not valid except with a deed—I mean, within a deed—for there must be something that is extracted (*mustakhlaṣ*, with a *fatḥa* on the *lām*). At that point, Sincerity finds a place, and due to it, the deed is called pure (*khāliṣ*), and the doer is called sincere (*mukhliṣ*). And Allah is the Granter of success for that.",
    "ur": "(باب ایک سو چونتیس: مقام اخلاص کی معرفت میں)\n\nجس نے دین کو خالص کیا، وہ وہی ہے\nجسے رحمن اپنے لیے چن لیتا ہے۔\nپس ہر کمی، اگر وہ\nاس کی ہستی میں نہ ہو، تو اسے ناقص کر دیتی ہے۔\n\n### [اسم الأحد ہر شے پر لاگو ہوتا ہے باوجود اس کے کہ وہ ایک الٰہی صفت ہے]\n\nجان لو کہ اسم الأحد (الاسم الأحد) ہر شے پر لاگو ہوتا ہے، خواہ وہ فرشتہ ہو، فلک ہو، سیارہ ہو، طبیعت ہو، عنصر ہو، معدن ہو، نباتات ہو، حیوان ہو یا انسان ہو، باوجود اس کے کہ یہ ایک الٰہی صفت ہے جیسا کہ اس کے قول میں ہے: قُلْ هُوَ الله أَحَدٌ (کہو وہ اللہ ایک ہے)۔ اور اس نے اسے ایک کونیاتی صفت بنایا ہے اپنے اس قول میں: ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً (اور اپنے رب کی عبادت میں کسی کو شریک نہ کرے)۔ اور ان اصناف میں سے کوئی بھی صنف نہیں ہے جن کا ہم نے ذکر کیا، جو کہ اللہ کے سوا تمام موجودات ہیں اور جن کا ہم نے احاطہ کیا ہے، مگر یہ کہ ان میں سے کچھ افراد کی عبادت کی گئی ہے۔ چنانچہ ان میں سے بعض نے فرشتوں کی عبادت کی، بعض نے سیاروں کی، بعض نے افلاک کی، بعض نے عناصر کی، بعض نے پتھروں کی، بعض نے درختوں کی، بعض نے حیوانات کی، اور بعض نے جنوں اور انسانوں کی عبادت کی۔\n\n### [عبادت میں مخلص (مخلص) ہونے کا مطلب یہ ہے کہ وہ صرف اسی کا قصد کرے جس نے اسے وجود بخشا]\n\nپس وہ شخص جو عبادت میں مخلص (مخلص) ہے، جو اس کے لیے ذاتی ہے، وہ صرف اسی کا قصد کرتا ہے جس نے اسے وجود بخشا اور پیدا کیا، اور وہ اللہ تعالیٰ ہے۔ چنانچہ یہ عبادت اس کے لیے خالص ہو جاتی ہے اور وہ اس کے ذریعے کسی ایسے شخص سے معاملہ نہیں کرتا جس کا ہم نے ذکر کیا، یعنی وہ ان مذکورہ اشیاء میں سے کسی میں بھی اسے نہیں دیکھتا، نہ تو اس شے کی عینیت کے لحاظ سے اور نہ ہی اس کے لیے احدیت (الأحدیۃ) کی نسبت کے لحاظ سے۔ کیونکہ دیکھنے والے کے لیے بھی احدیت (أحدیۃ) ہوتی ہے، لہٰذا وہ اپنی ہی عبادت کرے تو وہ اس کے لیے زیادہ بہتر ہے، اور وہ اپنے جیسے کی احدیت (أحدیۃ) کے لیے ذلیل نہیں ہوتا، کیونکہ اپنے خالق کی احدیت (أحدیۃ) کے علاوہ کسی اور کے لیے اس کی ذلت ناگزیر ہے۔ اس طرح وہ اس شخص سے زیادہ بلند ہمت ہوتا ہے جو اپنے جیسے مخلوق کی احدیت (أحدیۃ) کے لیے ذلیل ہوا۔\n\n### [مخلوقات میں سے کوئی شے ایسی نہیں مگر یہ کہ اس میں ربوبیت (ربوبیۃ) کا دعویٰ موجود ہے]\n\nاور مخلوقات میں سے کوئی بھی شے ایسی نہیں ہے مگر یہ کہ اس میں ربوبیت (ربوبیۃ) کا دعویٰ موجود ہے، اس فائدے اور نقصان کی وجہ سے جو اس سے ہستی (الکون) میں ظاہر ہوتا ہے۔ چنانچہ ہستی (الکون) میں کوئی شے ایسی نہیں جو نقصان دہ اور فائدہ مند نہ ہو۔ یہ مقدار اس میں عمومی ربوبیت (الربوبیۃ العامۃ) کی ہے، اور اسی کے ذریعے وہ مخلوق کی ذلت کو اپنی طرف کھینچتی ہے۔ کیا تم نہیں دیکھتے کہ انسان، باوجود اس کے کہ وہ اپنی خلافت کی وجہ سے تمام موجودات پر شرف رکھتا ہے، کس طرح ایک ایسی دوا پینے کا محتاج ہوتا ہے جسے وہ طبعاً ناپسند کرتا ہے، کیونکہ وہ جانتا ہے کہ اس میں اس کے لیے فائدہ ہے۔ پس اس نے اس کی عبادت کی جہاں سے وہ بے خبری میں تھا، کراہت کے ساتھ۔ اور اگر وہ دواؤں میں سے ایسی ہو جو اس مریض کے مزاج کے لیے لذیذ ہو اور وہ جانتا ہو کہ اس کا استعمال اسے فائدہ دے گا، تو اس نے اس کی عبادت کی جہاں سے وہ بے خبری میں تھا، خوشی اور محبت کے ساتھ۔ اور اسی طرح اللہ نے فرمایا: ولِلَّهِ يَسْجُدُ من في السَّماواتِ والْأَرْضِ طَوْعاً وكَرْهاً (اور اللہ ہی کو سجدہ کرتے ہیں جو آسمانوں اور زمین میں ہیں، خوشی سے اور ناخوشی سے)۔ اور پوری ہستی (الوجود) کو اسی پر قیاس کرو جیسا کہ میں نے تمہارے لیے بیان کیا ہے۔\n\n### [منافع حاصل کرنے کی محتاجی اور نقصانات کو دور کرنے کی ضرورت نے کمزور نفوس کو اشیاء کی عبادت کی طرف مائل کیا]\n\nچونکہ ہستی (الکون) میں کوئی شے ایسی نہیں ہے مگر یہ کہ اس میں نقصان اور نفع موجود ہے، لہٰذا اس الٰہی صفت کے ذریعے اس نے ان محتاجوں کے نفوس کو اپنی طرف کھینچ لیا جو نفع حاصل کرنے اور نقصان کو دور کرنے کے محتاج تھے۔ پس اس چیز نے انہیں اشیاء کی عبادت کی طرف لے گیا، اگرچہ وہ شعور نہ رکھتے ہوں، لیکن ان کی مجبوری انہیں اس معاملے میں جھٹلاتی ہے۔ کیونکہ انسان ہستی (الوجود) میں سب سے گھٹیا اور ناقص شے کا محتاج ہوتا ہے، اور وہ حاجت کے وقت بیت الخلا کی جگہ ہے۔ وہ اپنے رب کی عبادت چھوڑ دیتا ہے، بلکہ شرع میں اسے اس حالت میں عبادت ادا کرنا جائز نہیں جب وہ پیشاب یا پاخانہ روکے ہوئے ہو۔ پس وہ بیت الخلا کی طرف لپکتا ہے، خاص طور پر جب حاجت بہت بڑھ جائے اور اسے اس حد تک مجبور کر دے کہ اس کی عقل زائل ہونے لگے، اور وہ اس بات کی تصدیق کرتا ہے کہ اسے کب راستہ ملے گا۔ جب وہ وہاں پہنچتا ہے تو اسے راحت ملتی ہے اور وہ اس چیز کو نکال دیتا ہے جس نے اسے بے چین کر رکھا تھا۔ جب اسے راحت مل جاتی ہے تو وہ وہاں سے نکلتا ہے اور گویا اسے کبھی اس کی ضرورت ہی نہیں پڑی تھی، اور وہ اس کی نعمت کا کفر کرتا ہے اور اسے گندا سمجھتا ہے اور اس کی مذمت کرتا ہے۔ اور یہی نعمت اور منعم (نعمت دینے والے) کا کفر ہے۔\n\n### [خالص دین وہ دین ہے جو کائنات کی ربوبیتوں (ربوبیۃ الأکوان) کے ہاتھوں سے نکالا گیا ہو]\n\nاور جب اللہ نے جان لیا کہ اس نے اپنی مخلوق میں کیا ودیعت رکھا ہے اور ثقلین (جن و انس) میں موجودات میں ودیعت کردہ چیزوں کی اور لوگوں کی ایک دوسرے سے حاجت کو رکھا ہے، تو اس نے فرمایا: فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً (پس جو کوئی اپنے رب کی ملاقات کی امید رکھتا ہے، تو اسے چاہیے کہ نیک عمل کرے) یعنی اس میں کوئی فساد شامل نہ ہو، ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً (اور اپنے رب کی عبادت میں کسی کو شریک نہ کرے) یعنی وہ صرف اللہ کے لیے ذلیل ہو، نہ کہ کسی اور کے لیے۔ اور اس نے ہمیں حکم دیا کہ ہم اس کی عبادت کریں مُخْلِصِينَ لَهُ الدِّينَ (دین کو اس کے لیے خالص کرتے ہوئے)۔ اور فرمایا: أَلا لِلَّهِ الدِّينُ الْخالِصُ (خبردار! خالص دین اللہ ہی کے لیے ہے)۔ اور یہ وہ دین ہے جو کائنات کی ربوبیتوں (ربوبیۃ الأکوان) کے ہاتھوں سے نکالا گیا ہو۔ پس جب وہ اللہ کے سوا کسی شے کو نہ دیکھے اور یہ دیکھے کہ وہی نقصان اور نفع کے اسباب کو رکھنے والا ہے، تو وہ کسی سبب کو متعین کیے بغیر، اپنے نقصان کو دور کرنے اور اپنے نفع کو حاصل کرنے کے لیے اللہ کی طرف رجوع کرتا ہے۔ یہی اخلاص (الإخلاص) کا معنی ہے۔\n\n### [مُخلَصون (بفتح لام) اور مخلصون (بکسر لام)]\n\nاور اخلاص (الإخلاص) کا وجود صرف مُخلَصین (المخلصون - بفتح لام) سے ہی صحیح ہوتا ہے، کیونکہ جب اللہ ان پر توجہ فرماتا ہے تو انہیں ان اسباب کی ربوبیت (ربوبیۃ الأسباب) سے خالص کر دیتا ہے جن کا ہم نے ذکر کیا۔ پس جب وہ انہیں خالص کر دیتا ہے تو وہ مخلصین (المخلصون - بکسر لام) بن جاتے ہیں۔ اور اس نے اخلاص (الإخلاص) کی نسبت ان کی طرف صرف آزمائش کے طور پر کی تاکہ وہ دیکھے کہ آیا انہیں اس پر ذات حق (الحق) پر احسان حاصل ہوتا ہے یا نہیں۔ اور یہ اس کے قول میں پایا گیا ہے: يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا (وہ تم پر احسان جتلاتے ہیں کہ وہ اسلام لائے)۔ پس اگر وہ اس پر احسان جتلاتے ہیں تو انہیں سرزنش کی جاتی ہے اور اس قول کے ذریعے متنبہ کیا جاتا ہے: بَلِ الله يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ لِلْإِيمانِ إِنْ كُنْتُمْ صادِقِينَ (بلکہ اللہ تم پر احسان کرتا ہے کہ اس نے تمہیں ایمان کی ہدایت دی، اگر تم سچے ہو) اپنے اس دعوے میں کہ تم مومن ہو۔ پس اس نے ان سے یہ صفت چھین لی کہ یہ ان کا کسب ہو۔\n\n### [عقل مند کے لیے مناسب ہے کہ وہ اللہ کی نعمتوں میں اس کی خفیہ تدبیر (مکر اللہ) سے بے خوف نہ ہو]\n\nپس عقل مند کے لیے مناسب ہے کہ وہ اللہ کی نعمتوں میں اس کی خفیہ تدبیر (مکر اللہ) سے بے خوف نہ ہو، کیونکہ اس میں خفیہ تدبیر (مکر) بلاء کی نسبت زیادہ پوشیدہ ہوتی ہے۔ اور اس میں سب سے ادنیٰ خفیہ تدبیر (مکر) یہ ہے کہ وہ اپنے آپ کو اس نعمت کا مستحق سمجھے اور یہ سمجھے کہ یہ اس کے لیے ہی پیدا کی گئی ہے، کیونکہ اللہ اس کا محتاج نہیں ہے۔ پس یہ میرے لیے استحقاق کے حکم سے ہے۔ یہ سب سے ادنیٰ خفیہ تدبیر (مکر) ہے جسے معرفت (المعرفۃ) عطا کرتی ہے، اور عام لوگوں میں اس کے مالک کو عارف کہا جاتا ہے، جبکہ عارفین (العارفین) میں وہ جاہل ہے، کیونکہ ہم پہلے بیان کر چکے ہیں کہ اشیاء کو صرف اس لیے پیدا کیا گیا ہے تاکہ وہ اس کی حمد کے ساتھ تسبیح کریں، اور ہمارا ان سے فائدہ اٹھانا تبعی حکم سے ہے نہ کہ پہلے مقصد سے۔ پس اس نے تمام عالم کو اپنی حمد کے ساتھ تسبیح کرنے اور اپنی عبادت کرنے پر فطرت دی، اور ثقلین (جن و انس) کو اس کی طرف بلایا اور انہیں یہ معرفت دی کہ انہیں اسی لیے پیدا کیا گیا ہے، نہ کہ ان کے اپنے لیے اور نہ ہی مخلوقات میں سے کسی شے کے لیے، باوجود اس کے کہ ہستی (الوجود) میں ان کا ایک دوسرے سے فائدہ اٹھانا واقع ہوتا ہے۔ اور اللہ تعالیٰ نے صحیح غریب حدیث میں فرمایا: \"من عمل عملا أشرك فيه غيري فأنا منه بري‏ء وهو للذي أشرك\" (جس نے کوئی ایسا عمل کیا جس میں میرے ساتھ کسی اور کو شریک کیا، تو میں اس سے بری ہوں، اور وہ اسی کے لیے ہے جسے اس نے شریک کیا)۔\n\nپس اس نے اپنے بندوں سے اپنے لیے عمل میں اخلاص (إخلاص) کا مطالبہ کیا۔ چنانچہ ان میں سے بعض نے اسے مکمل طور پر خالص کر دیا، پس انہوں نے قصد کے حکم سے عمل میں شرک نہیں کیا، اور انہوں نے اس کے ذریعے صرف اللہ کا قصد کیا، اور نہ ہی انہوں نے عمل میں اپنے آپ کو شریک کیا کہ وہ ہی عمل کرنے والا ہے، بلکہ اس کا عمل اللہ کی تخلیق ہے۔ پس پہلا عموم ہے اور دوسرا خصوص ہے، اور یہی اخلاص (الإخلاص) کی انتہا ہے۔ اور اخلاص (إخلاص) عمل کے بغیر صحیح نہیں ہوتا، میرا مطلب ہے عمل میں، کیونکہ کسی شے کا ہونا ضروری ہے جو مُخلَص (مستخلص - بفتح لام) ہو۔ اور اس وقت اخلاص (الإخلاص) کو ایک محل ملتا ہے جو اس عمل کے لیے ہوتا ہے، جس کی وجہ سے عمل کو خالص (خالص) اور عامل کو مخلص (مخلص) کہا جاتا ہے۔ اور اللہ ہی اس کی توفیق دینے والا ہے۔",
    "fa": "باب صد و سی و چهارم در معرفت مقام اخلاص (الإخلاص)\n\nآن کس که دین را خالص گرداند، اوست که\nرحمان او را برای خود خالص می‌گرداند (یستخلصه)\n\nپس هر نقصانی که در هستی او نباشد،\nآن نقصان او را ناقص می‌سازد.\n\n### [اسم احد (الأحد) بر هر چیزی اطلاق می‌شود با وجود اینکه نعت الهی است]\n\nبدان که اسم احد (الأحد) بر هر چیزی از ملک و فلک و کوکب و طبیعت و عنصر و معدن و نبات و حیوان و انسان اطلاق می‌شود، با وجود اینکه نعت الهی است، چنانکه در قول او آمده است: قُلْ هُوَ الله أَحَدٌ (بگو اوست خدای یکتا). و آن را نعت کونی قرار داده است در قول او: ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً (و هیچ کس را در عبادت پروردگارش شریک نسازد). و هیچ صنفی از این اصنافی که ذکر کردیم و همه آنچه سوای خداست و ما آنها را برشمردیم، نیست مگر اینکه اشخاصی از آنها پرستش شده‌اند. پس برخی از آنها ملائکه را پرستیدند، برخی کواکب را، برخی افلاک را، برخی عناصر را، برخی سنگ‌ها را، برخی درخت‌ها را، برخی حیوانات را، و برخی جن و انس را پرستیدند.\n\n### [مخلص در عبادتی که برای او ذاتی است، آن است که جز کسی که او را هستی بخشیده، قصد نکند]\n\nپس مخلص (المخلص) در عبادتی که برای او ذاتی است، آن است که جز کسی که او را هستی بخشیده و خلق کرده، یعنی خدای تعالی، قصد نکند. در نتیجه این عبادت برای او خالص می‌شود و با آن با هیچ یک از کسانی که ذکر کردیم معامله نمی‌کند؛ یعنی او را در هیچ یک از آنچه ذکر کردیم نمی‌بیند، نه از حیث عین آن شیء و نه از حیث نسبت احدیت (الأحدية) به آن. زیرا بیننده نیز خود دارای احدیت است، پس اگر چنین کند، باید خود را بپرستد که این برای او اولی‌تر است و نباید در برابر احدیت (الأحدية) مانند خود ذلیل شود، چرا که ناگزیر باید در برابر غیر احدیت خالقش ذلت پذیرد. پس او بلندهمت‌تر از کسی است که در برابر احدیت مخلوقی مانند خود ذلیل شده است.\n\n### [هیچ مخلوقی نیست مگر اینکه در آن نفسِ ادعای ربوبیت وجود دارد]\n\nو هیچ چیزی از مخلوقات نیست مگر اینکه در آن نفسِ ادعای ربوبیت (ربوبية) وجود دارد، به سبب منافع و مضراتی که از آن در هستی (الکون) حاصل می‌شود. پس هیچ چیزی در هستی نیست مگر اینکه هم زیان‌رسان است و هم سودمند. این مقدار از ربوبیت عامه در آن وجود دارد و به واسطه آن، ذلت خلق را به سوی خود می‌خواند. آیا نمی‌بینی که انسان با وجود شرافتش بر سایر موجودات به واسطه خلافتش، چگونه به نوشیدن دارویی که طبعاً از آن کراهت دارد، نیازمند می‌شود، به دلیل علمش به منفعتی که در آن برای اوست؟ پس او را از آن حیث که نمی‌داند، از روی کراهت پرستیده است. و اگر از داروهای لذت‌بخش برای مزاج این بیمار باشد و او بداند که مصرف آن برایش سودمند است، پس او را از آن حیث که نمی‌داند، از روی میل و محبت پرستیده است. و همچنین خداوند فرمود: ولِلَّهِ يَسْجُدُ من في السَّماواتِ والْأَرْضِ طَوْعاً وكَرْهاً (و هر که در آسمان‌ها و زمین است، خواه ناخواه برای خدا سجده می‌کند). و کل هستی (الوجود) را بر اساس آنچه برایت بیان کردم، در نظر بگیر.\n\n### [نیاز به جلب منافع و احتیاج به دفع مضرات، نفوس ضعیف را به عبادت اشیاء سوق داده است]\n\nزیرا هیچ چیزی در هستی نیست مگر اینکه در آن ضرر و نفعی وجود دارد. پس با این صفت الهی، نفوس نیازمندان را به سوی خود جلب کرده است، به دلیل نیازشان به منفعت و دفع مضرات. این امر آنها را به عبادت اشیاء سوق داده است، هرچند که خود متوجه نباشند، اما اضطرار به آنها، در این ادعا آنها را تکذیب می‌کند. زیرا انسان به پست‌ترین و ناقص‌ترین چیزها در هستی نیازمند می‌شود، و آن مکان قضای حاجت (الخلأ) است. هنگام نیاز، عبادت پروردگارش را ترک می‌کند، بلکه در شرع نیز جایز نیست که در حال احتباس ادرار (حاقن) آن را انجام دهد. پس به سرعت به سوی مکان قضای حاجت می‌رود، به ویژه اگر نیاز مفرط باشد و او را مضطر سازد، به طوری که عقلش را از بین ببرد و نداند چه زمانی راهی برای رسیدن به آن می‌یابد. پس هنگامی که به آن رسید، در آنجا آسایش می‌یابد و آنچه او را آشفته کرده بود، رها می‌کند. وقتی آسایش یافت، از آنجا خارج می‌شود و گویی هرگز به آن نیاز نداشته است، و نعمت آن را کفران می‌کند و آن را پلید می‌شمارد و نکوهش می‌کند. و این همان کفران نعمت و کفران نعمت‌دهنده است.\n\n### [دین خالص، دینی است که از دست‌های ربوبیت کائنات استخلاص شده است]\n\nو چون خداوند آنچه را در خلق خود به ودیعه نهاده و آنچه را در جن و انس از نیاز به آنچه خداوند در موجودات و در مردم نسبت به یکدیگر به ودیعه نهاده است، دانست، فرمود: فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً (پس هر کس به دیدار پروردگارش امید دارد، باید کار شایسته انجام دهد)؛ یعنی فسادی آن را آلوده نسازد، ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً (و هیچ کس را در عبادت پروردگارش شریک نسازد)؛ یعنی جز برای خدا ذلیل نشود، نه برای غیر او. و امر فرمود که او را عبادت کنیم در حالی که مُخْلِصِينَ لَهُ الدِّينَ (دین را برای او خالص گردانیم). و فرمود: أَلا لِلَّهِ الدِّينُ الْخالِصُ (آگاه باشید که دین خالص از آن خداست). و آن دینی است که از دست‌های ربوبیت (ربوبية) کائنات استخلاص شده است. پس هنگامی که چیزی جز خدا نبیند و بداند که اوست که اسباب مضرات و منافع را قرار داده است، به خدا پناه می‌برد در دفع آنچه به او ضرر می‌رساند و در نیل به آنچه به او نفع می‌رساند، بدون تعیین سبب. این است معنای اخلاص (الإخلاص).\n\n### [مُخلَصون (به فتح لام) و مُخلِصون (به کسر لام)]\n\nو وجود اخلاص (الإخلاص) صحیح نیست مگر از مُخلَصون (به فتح لام). زیرا هنگامی که خداوند به آنها توجه کند، آنها را از ربوبیت (ربوبية) اسبابی که ذکر کردیم، استخلاص می‌نماید. پس هنگامی که آنها را استخلاص کرد، آنها مُخلِصون (به کسر لام) می‌شوند. و اخلاص را به آنها نسبت داد تا آزمایشی باشد و ببیند آیا به واسطه آن بر حق (الحق) منت می‌گذارند یا خیر. و این در قول او یافت می‌شود: يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا (بر تو منت می‌گذارند که اسلام آورده‌اند). پس اگر به این منت بگذارند، توبیخ می‌شوند و با این قول آگاه می‌گردند: بَلِ الله يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ لِلْإِيمانِ إِنْ كُنْتُمْ صادِقِينَ (بلکه خدا بر شما منت می‌گذارد که شما را به ایمان هدایت کرده است، اگر راستگو باشید) در ادعای خود که مؤمن هستید. پس این صفت را از اینکه کسب خودشان باشد، از آنها سلب کرد.\n\n### [شایسته است که عاقل از مکر خدا در نعمت‌بخشی او ایمن نباشد]\n\nپس شایسته است که عاقل از مکر خدا در نعمت‌بخشی او ایمن نباشد. زیرا مکر در آن (نعمت) پنهان‌تر از مکر در بلا است. و کمترین مکر در آن این است که شخص خود را مستحق آن نعمت ببیند و گمان کند که آن نعمت به خاطر او خلق شده است، زیرا خداوند به آن نیازمند نیست، پس آن نعمت به حکم استحقاق برای من است. این کمترین مکر است که معرفت (المعرفة) آن را نشان می‌دهد و صاحبش در میان عوام عارف نامیده می‌شود، در حالی که در نزد عارفان جاهل است. زیرا ما پیشتر بیان کردیم که اشیاء تنها برای او تعالی خلق شده‌اند تا او را به حمدش تسبیح گویند، و انتفاع ما از آنها به حکم تبعیت است نه به قصد اول. پس تمام عالم بر تسبیح او به حمدش و عبادت او سرشته شده است و جن و انس را به آن دعوت کرد و شناساند که آنها را برای این خلق کرده است، نه برای خودشان و نه برای هیچ یک از مخلوقات، با وجود اینکه در هستی (الوجود) انتفاع برخی از آنها از برخی دیگر واقع می‌شود. و خدای تعالی در حدیث غریب صحیح فرمود: «من عمل عملاً أشرك فيه غيري فأنا منه بري‏ء وهو للذي أشرك» (هر کس عملی انجام دهد و در آن غیر مرا شریک سازد، من از آن بیزارم و آن عمل از آن کسی است که شریک ساخته است).\n\nپس از بندگانش اخلاص عمل برای او را طلب کرد. برخی از آنها عمل را به طور کلی برای او خالص کردند، به طوری که در عمل به حکم قصد شرک نورزیدند و جز خدا را قصد نکردند. و برخی در خود عمل شرک نورزیدند به اینکه آن را کار خود بدانند، بلکه عمل او خلق خداست. پس اولی عموم است و دومی خصوص، و آن غایت اخلاص (الإخلاص) است. و اخلاص (إخلاص) صحیح نیست مگر با عمل، یعنی در عمل؛ زیرا ناگزیر باید چیزی باشد که مُستَخلَص (به فتح لام) باشد، و در آن هنگام اخلاص محلی می‌یابد که آن عمل به واسطه آن خالص نامیده می‌شود و عامل، مُخلِص (به کسر لام) نامیده می‌شود. و خداوند توفیق‌دهنده برای آن است."
  },
  "page_count": 3
}