{
  "id": 80,
  "title": {
    "ar": "الباب الموفي ثمانين في العزلة",
    "en": "Chapter Eighty: Concerning Seclusion (العزلة)",
    "ur": "باب نمبر اسی (۸۰) خلوت (عزلت) کے بیان میں",
    "fa": "باب هشتادم در عزلت"
  },
  "content": {
    "ar": "## (الباب الموفي ثمانين في العزلة)\n\n\n> إذا اعتزلت فلا تركن إلى أحد *** ولا تعرج على أهل ولا ولد\n\n\n> ولا توالي إذا واليت منزلة *** وغب عن الشرك والتوحيد بالأحد\n\n\n> وأنزع إلى طلب العليا منفردا *** بغير فكر ولا نفس ولا جسد\n> وسابق الهمة العليا تحظ بمن *** سما بأسمائه الحسنى بلا عدد\n\n\n> واعلم بأنك محبوس ومكتنف *** بالنور حبسا جليا لا إلى أمد\n\n\n### [الأسماء الحسنى منها ما هو معقول ومنها ما هو منقول‏]\n\n\nلا يعتزل إلا من عرف نفسه ومن عرف نفسه عرف ربه فليس له مشهود إلا الله من حيث أسماؤه الحسنى وتخلقه بها ظاهرا وباطنا وأسماؤه الحسنى سبحانه على قسمين أسماء يقبلها العقل ويستقل بإدراكها وينسبها ويسمى بها الله تعالى وأسماء أيضا إلهية لو لا ورود الشرع بها ما قبلها فيقبلها إيمانا ولا يعقلها من حيث ذاته إلا إن أعلمه الحق بحقيقة نسبة تلك الأسماء إليه كما علمها أنبياءه وأولياءه‏\n\n\n### [صاحب العزلة والأسماء الإلهية بشطريها: المعقول والمنقول‏]\n\n\nفصاحب العزلة هو الذي يعتزل بما هو له من ربه من غير تخلق بما ينفرد به في زعم العقل من الأسماء الإلهية المشروعة التي لو لا الشرع ما سمي العقل الله بها فهي للحق وقد جبل الإنسان عليها وخلقه مجلى لها فهو المسمى بها ولا يتمكن له الاعتزال عن مثل هذه الأسماء الإلهية وبقي القسم الآخر من الأسماء الإلهية يعتزل عنها لما يطرأ عليه منها من الضرر كما قال ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ وقوله كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ فيعتزل عن مثل هذه الأسماء الإلهية لما فيها من الذم لمن تسمى بها وظهر بحكمها في العالم فالإنسان حقيقته أن يكون عائلا والعائل لا يكون متكبرا فإنه ظهر بما ليس هو له بنعت ولذلك‏\n\n\nلا ينظر الله إليه وهو واحد من الثلاثة الشيخ الزاني والملك الكذاب والعائل المستكبر ذكره مسلم في صحيحه‏\n\n\n### [التخلق بالأسماء الإلهية ومزاحمة العبد الحق فيها]\n\n\nفمن رأى التخلق بالأسماء الحسنى ومزاحمة الحق فيها لكونه خلق على الصورة فلا بد أن يظهر بها ويتلبس على الحد المشروع المحمود فهذه مزاحمة عبودية ربوبية وذلك لما رأى أن له أسماء هي له حقيقة ينفرد بها ورأى أن الحق زاحمه فيها كالضحك والفرح والتعجب والمحب والمتردد والكارة والناسي والاستحياء وما أشبه ذلك مما ورد ذكره في الكتاب والسنة إلى ما يداخل النشأة من يد ويدين وأيد ووجل وعين وأعين إلى ما يداخل النشأة من الأحوال من استواء ومعية ونزول وطلب وشوق وأمثال ذلك ورأى هذا المعتزل قبل اعتزاله أن الحق قد زاحمه في هذه النعوت التي ينبغي أن تكون للعبد كما هي في نفس الأمر عنده قال الأليق بي إن أعتزل بأسمائي عن أسمائه ولا أزاحمه فيها تكون عارية عندي إذ كانت العارية أمانة مؤداة وحامل الأمانة موصوف بالتعريف الإلهي بالظلم والجهل‏\n\n\n### [رجوع العبد إلى خصوصيته وقعوده في بيت شيئيته‏]\n\n\nفاعتزل صاحب هذا النظر التخلق بالأسماء الحسنى وانفرد بفقره وذله وصغاره وعجزه وقصوره وجهله في بيته كلما قرع عليه الباب اسم الإلهي قيل له ما هنا من يكلمك فإذا انقدح له بهذا الاعتزال أن الله له نفي الأولية وأنه أزلي الوجود ونظر في كلامه سبحانه وفيما أمر نبيه صلى الله عليه وسلم أن يوصله إلينا من صفاته وأسمائه لنعرفه بذلك ويخلع علينا بهذا التعريف خلع العلم تشريفا لنا فأعلمنا إن هذه الصفات التي زعمنا إنا نستحقها وأنها لنا حقيقة إن الأمر على خلاف ذلك إذ قد اتصف هو بها وتسمى بها ونحن ما كنا فلا فرق بين هذه الأسماء والتي اعتزلنا عنها فأما أن نعتزل عن الجميع وإما أن نتسمى بالجميع فقلنا له اعتزل عن الجميع واترك الحق إن شاء سماك بالأسماء كلها فأقبلها ولا تعترض وإن شاء سماك ببعضها وإن شاء لم يسمك ولا بواحد منها لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ فرجع العبد إلى خصوصيته وهي العبودة التي لم تزاحم الربوبية فتحلى بها وقعد في بيت شيئية ثبوته لا بشيئية وجوده ينظر تصريف الحق فيه وهو معتزل عن التدبير في ذلك فإن تسمى من هذه حالته بأي اسم كان فالله مسميه ما هو تسمى وليس له رد ما سماه به فتلك الأسماء هي خلع الحق على عباده وهي خلع تشريف فمن الأدب قبولها لأنها جاءته من غير سؤال ولا استشراف وقد أمره رسول الله صلى الله عليه وسلم بأخذ مثل هذا العطاء وترك ما استشرفت النفس إلى أخذه وتمنى ذلك بالاستطلاع إليه ووقف عند ذلك على أنه كان غاصبا لله فيما كان يزعم أنه له فإذا هو لله وهو قوله تعالى وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فأخذ منه جميع ما كان يزعم أنه له إلا العبادة فإنه لا يأخذها إذ كانت ليست بصفة له فقال له تعالى لما قال وإِلَيْهِ إلى يُرْجَعُ الْأَمْرُ كُلُّهُ فَاعْبُدْهُ وهو أصله الذي خلق له وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فالعبادة اسم حقيقي للعبد فهي ذاته وموطنه وحاله وعينه ونفسه وحقيقته ووجهه‏\n\n\n### [عزلة العلماء بالله والعزلة التي عند عامة الناس‏]\n\n\nفمن اعتزل هذه العزلة فهي عزلة العلماء بالله لا هجران الخلائق ولا غلق الأبواب وملازمة البيوت وهي العزلة التي عند الناس أن يلزم الإنسان بيته ولا يعاشر ولا يخالط ويطلب السلامة ما استطاع بعزلته ليسلم من الناس ويسلم الناس منه فهذا طلب عامة أهل الطريق‏\nبالعزلة ثم إن ارتقى إلى طور أعلى من هذا فيجعل عزلته رياضة وتقدمة بين يدي خلوته لتالف النفس قطع المألوفات من الأنس بالخلق فإنه يرى الأنس بالخلق من العلائق والعوائق الحائلة بينه وبين مطلوبه من الأنس بالله والانفراد به فإذا انتقل من العزلة بعد إحكامه شرائطها سهل عليه أمر الخلوة هذا سبب العزلة عند خاصة أهل الله‏\n\n\n### [العزلة التي هي نسبة والعزلة التي هي مقام‏]\n\n\nفهذه العزلة نسبة لا مقام والعزلة الأولى التي ذكرناها مقام مطلوب ولهذا جعلناها في المقامات من هذا الكتاب وإذا كانت مقاما فهي من المقامات المستصحبة في الدنيا والآخرة فللعارفين من أهل الأنس والوصال في العزلة من الدرجات خمسمائة درجة وثمان وثلاثون درجة وللعارفين الأدباء الواقفين مائة وثلاث وأربعون درجة وللملامية فيها من أهل الأنس خمسمائة درجة وسبع درجات وللملامية من أهل الأدب الواقفين معهم مائة واثنتي عشرة درجة والعزلة المعهودة في عموم أهل الله من المقامات المقيدة بشرط لا تكون إلا به وهي نسبة في التحقيق لا مقام إلا أنها تحصل عنها فوائد أقلها العصمة لها الدعوى صاحبها مسئول وعلتها سوء الظن بنفسك أو بمن اعتزلت عنهم وهذا كله في عزلة العموم وهي من عالم الجبروت والملكوت ما لها قدم في عالم الشهادة فلا تتعلق معارفها بشي‏ء من عالم الملك‏\n\n",
    "en": "## Chapter Eighty: Concerning Seclusion (العزلة)\n\nIf you seclude yourself, do not lean upon anyone,\nNor rely upon family nor child.\n\nAnd do not befriend a station if you befriend it,\nAnd be absent from association [shirk] and unification [tawḥīd] by the One.\n\nAnd strive toward the pursuit of the Highest, solitary,\nWithout thought, nor soul [nafs], nor body.\nAnd race the highest aspiration [himma] to attain Him who\nIs exalted by His Beautiful Names without number.\n\nAnd know that you are imprisoned and encompassed\nBy the Light, a manifest imprisonment without end.\n\n### [The Beautiful Names: Some are rationally understood, and some are transmitted]\n\nNone secludes himself except one who knows his self, and whoever knows his self knows his Lord. Thus, he has no witnessed object [mashhūd] except Allah, in terms of His Beautiful Names [al-Asmā’ al-Ḥusnā] and his own ethical realization [takhalluq] of them, outwardly and inwardly.\n\nHis Beautiful Names, glory be to Him, are of two divisions: Names that the intellect accepts and is independent in perceiving, and attributes them to Allah the Exalted, and names Him by them; and also Divine Names [Asmā’ Ilāhiyya] which, were it not for the transmission by the Law [Sharʿ], the intellect would not accept. So, it accepts them through faith, but does not rationally comprehend them in terms of their Essence [Dhāt], unless The Real [al-Ḥaqq] informs him of the reality of the attribution of those Names to Him, just as He taught them to His Prophets and Saints.\n\n### [The Practitioner of Seclusion and the Divine Names in their two parts: the Rational and the Transmitted]\n\nThe practitioner of seclusion [ṣāḥib al-ʿuzla] is he who secludes himself with what belongs to him from his Lord, without ethically realizing those prescribed Divine Names which, in the intellect's estimation, are unique to Him, and by which the intellect would not have named Allah were it not for the Law.\n\nThese Names belong to The Real, and humanity has been naturally disposed toward them, created as a locus of their manifestation [majlan lahā]. Thus, humanity is named by them, and it is not possible for him to seclude himself from such Divine Names.\n\nThe other division of Divine Names remains, from which he secludes himself due to the harm that may arise from them, as He said: <<Taste! Indeed, you are the mighty, the noble>> [Q 44:49]. And His saying: <<Thus does Allah seal up every heart of an arrogant tyrant>> [Q 40:35]. So, he secludes himself from such Divine Names because they contain blame for whoever names himself by them and manifests their ruling in the world.\n\nThe reality of the human being is to be dependent [ʿā’il], and the dependent one cannot be arrogant [mutakabbir]. For he manifests an attribute that does not belong to him. And for this reason, Allah will not look upon him, and he is one of the three: the old man who commits adultery, the lying king, and the dependent one who is arrogant. Muslim mentioned this in his *Ṣaḥīḥ*.\n\n### [Ethical Realization of the Divine Names and the Servant’s Contention with The Real therein]\n\nWhoever sees the ethical realization [takhalluq] of the Beautiful Names and the contention [muzāḥama] with The Real therein—due to being created upon the Divine Form [al-ṣūra]—must necessarily manifest them and be clothed in them according to the prescribed and praiseworthy limit. This is a contention of servanthood [ʿubūdiyya] with Lordship [rubūbiyya].\n\nThis is because he saw that he possesses Names that truly belong to him and by which he is unique, yet he saw that The Real contends with him in them, such as laughter, joy, wonder, the lover, the hesitant, the hater, the forgetful, shyness, and similar attributes mentioned in the Book and the Sunnah. This extends to the physical aspects [al-nash’a] involved, such as hand, two hands, hands, fear, eye, and eyes; and up to the spiritual states [al-aḥwāl] involved, such as settling [istawā’], companionship [maʿiyya], descent [nuzūl], seeking, longing, and their likes.\n\nThis secluded one [al-muʿtazil] saw, before his seclusion, that The Real had contended with him in these attributes which ought to belong to the servant, just as they are in reality according to him. He said: 'It is more fitting for me that I seclude myself with my Names from His Names, and not contend with Him in them, so that they remain a loan [ʿāriyya] with me, since a loan is a trust [amāna] that must be returned, and the bearer of the trust is described by the Divine definition as being unjust [ẓulm] and ignorant [jahl].'\n\n### [The Servant’s Return to His Specificity and His Sitting in the House of His Thingness]\n\nSo, the possessor of this perspective secluded himself from the ethical realization of the Beautiful Names, and became solitary in his poverty [faqr], humiliation [dhull], lowliness [ṣighār], incapacity [ʿajz], deficiency [quṣūr], and ignorance [jahl] in his house. Whenever a Divine Name knocked on his door, it was said to it: 'There is no one here to speak with you.'\n\nWhen, through this seclusion, it became clear to him that Allah possesses the negation of beginning [nafy al-awwaliyya] and that He is Eternal in Existence [azaliyy al-wujūd], and he looked at His speech, glory be to Him, and what He commanded His Prophet (peace and blessings be upon him) to convey to us regarding His Attributes and Names, so that we might know Him thereby, and that He might bestow upon us, through this definition, the robes of Knowledge [khilaʿ al-ʿilm] as an honor for us—He informed us that these attributes which we claimed we deserved and that truly belonged to us, the matter is contrary to that, since He has been characterized by them and named Himself by them, while we were not yet in existence.\n\nThus, there is no difference between these Names and those from which we secluded ourselves. Either we seclude ourselves from all of them, or we name ourselves by all of them. So, we said to him: 'Seclude yourself from all of them, and leave The Real. If He wills, He will name you by all the Names, so accept them and do not object. If He wills, He will name you by some of them. And if He wills, He will not name you by any of them. <<To Allah belongs the command before and after>> [Q 30:4].'\n\nSo, the servant returned to his specificity, which is servanthood [al-ʿubūda] that does not contend with Lordship [al-rubūbiyya]. He adorned himself with it and sat in the house of the thingness [shay’iyya] of his immutability [thubūt], not the thingness of his existence [wujūd], observing the disposal of The Real [taṣrīf al-Ḥaqq] within him, while being secluded from planning [al-tadbīr] in that matter.\n\nIf one whose state is this is named by any Name, it is Allah who names him, not that he names himself, and he has no right to reject what He names him by. Those Names are the robes [khilaʿ] bestowed by The Real upon His servants; they are robes of honor. It is proper etiquette [adab] to accept them because they came to him without asking or seeking. The Messenger of Allah (peace and blessings be upon him) commanded the taking of such a gift and the abandonment of what the soul yearned to take and wished for by looking forward to it.\n\nAnd he realized at that point that he had been usurping what he claimed belonged to him, when in fact it belongs to Allah, which is His saying: <<And to Him is returned the affair, all of it>> [Q 11:123]. So, He took from him everything he claimed belonged to him, except servanthood, for He does not take it, as it is not an Attribute belonging to Him. The Exalted said to him, when He said <<And to Him is returned the affair, all of it>>: <<So worship Him>> [Q 11:123]. This is the origin for which he was created: <<And I did not create the jinn and mankind except to worship Me>> [Q 51:56]. Thus, worship [al-ʿibāda] is a true Name for the servant; it is his Essence [Dhāt], his dwelling place, his state, his entity [ʿayn], his soul [nafs], his reality [ḥaqīqa], and his face.\n\n### [The Seclusion of the Scholars of Allah and the Seclusion of the Common People]\n\nWhoever practices this seclusion, it is the seclusion of the Scholars of Allah [ʿulamā’ bi-Llāh], not the abandonment of creatures, nor the locking of doors and adherence to houses.\n\nThe seclusion known among people is that a person adheres to his house, neither socializing nor mixing, seeking safety as much as possible through his seclusion, so that he may be safe from people and people may be safe from him. This is the goal of the common practitioners of the Path.\n\nThen, if he ascends to a higher stage than this, he makes his seclusion a spiritual discipline [riyāḍa] and a prelude to his retreat [khalwa], so that the soul may become accustomed to cutting off familiar habits of intimacy with creation. For he sees intimacy with creation as one of the attachments [ʿalā’iq] and obstacles [ʿawā’iq] that intervene between him and his goal of intimacy with Allah and solitude with Him. When he moves from seclusion after mastering its conditions, the matter of retreat becomes easy for him. This is the reason for seclusion among the elite of the People of Allah [khāṣṣat ahl Allāh].\n\n### [The Seclusion that is a Relation and the Seclusion that is a Station]\n\nThis seclusion is a relation [nisba], not a station [maqām]. The first seclusion we mentioned is a desired station, and for this reason, we placed it among the Stations in this book. And if it is a station, it is among the stations that accompany one in this world and the Hereafter.\n\nFor the Gnostics [al-ʿārifīn] among the People of Intimacy [Ahl al-Uns] and Union [al-Wiṣāl], there are five hundred and thirty-eight degrees [darajāt] in seclusion. And for the Gnostic practitioners of etiquette [al-adab] who are standing [al-wāqifīn], there are one hundred and forty-three degrees. And for the Malamiyya among the People of Intimacy, there are five hundred and seven degrees. And for the Malamiyya among the People of Etiquette who are standing with them, there are one hundred and twelve degrees.\n\nThe seclusion commonly known among the generality of the People of Allah [ʿumūm ahl Allāh] is among the stations restricted by a condition without which it cannot exist. In reality, it is a relation, not a station. However, benefits are derived from it, the least of which is protection [al-ʿiṣma]. Its claim is questionable, and its cause is poor opinion of oneself or of those from whom one secludes oneself. All of this pertains to the seclusion of the generality, and it belongs to the World of Power [ʿālam al-Jabarūt] and the World of Dominion [ʿālam al-Malakūt]. It has no footing in the World of Witnessing [ʿālam al-Shahāda], so its gnoses [maʿārif] are not related to anything in the World of Sovereignty [ʿālam al-Mulk].",
    "ur": "(باب نمبر اسی: خلوت نشینی کے بیان میں)\n\nجب تم خلوت نشینی اختیار کرو تو کسی پر بھروسہ نہ کرو،\nاور نہ ہی اہل و عیال کی طرف مائل ہو۔\nاور جب تم کسی مقام (منزلة) سے دوستی کرو تو اسے اپنا دوست نہ بناؤ،\nاور شرک اور توحید دونوں سے غائب ہو جاؤ، احد (الأحد) کے ساتھ۔\nاور تنہا ہو کر بلندی (العُلیا) کی طلب کی طرف کھینچے جاؤ،\nبغیر کسی فکر، نفس یا جسم کے۔\nاور اس ذات کی طرف بلند ہمت سے سبقت لے جاؤ جو\nاپنے اسماء حسنیٰ (الأسماء الحسنى) کے ساتھ بے شمار بلندی پر ہے۔\nاور جان لو کہ تم نور (النور) کے ذریعے واضح طور پر قید اور گھیرے ہوئے ہو، ہمیشہ کے لیے نہیں۔\n\n[اسماء حسنیٰ (الأسماء الحسنى) میں سے کچھ عقلی ہیں اور کچھ نقلی]\n\nکوئی بھی اعتزال (العزلة) اختیار نہیں کرتا مگر وہ جو اپنے نفس کو پہچانتا ہے، اور جو اپنے نفس کو پہچانتا ہے وہ اپنے رب کو پہچانتا ہے۔ اس کے لیے کوئی مشہود (مشهود) نہیں ہے سوائے اللہ کے، اس کے اسماء حسنیٰ (الأسماء الحسنى) کے اعتبار سے اور ان کے ساتھ ظاہراً و باطناً تخلق (تخلقه) اختیار کرنے کے اعتبار سے۔ اس کے اسماء حسنیٰ (الأسماء الحسنى) سبحانہ و تعالیٰ دو قسموں پر ہیں: ایسے اسماء جنہیں عقل قبول کرتی ہے اور ان کے ادراک میں خود مختار ہے، اور انہیں اللہ تعالیٰ کی طرف منسوب کرتی ہے اور ان کے ذریعے اسے نامزد کرتی ہے؛ اور ایسے اسماء الٰہیہ (أسماء إلهية) بھی ہیں کہ اگر شریعت (الشرع) ان کے ساتھ وارد نہ ہوتی تو عقل انہیں قبول نہ کرتی۔ لہٰذا، عقل انہیں ایمان (إيمانا) کے ذریعے قبول کرتی ہے اور ان کی ذات (ذاته) کے اعتبار سے انہیں نہیں سمجھتی، مگر یہ کہ الحق (الحق) اسے ان اسماء کی اپنی ذات سے نسبت کی حقیقت سے آگاہ کر دے، جیسا کہ اس نے اپنے انبیاء اور اولیاء کو آگاہ کیا۔\n\n[صاحب خلوت نشینی اور اسماء الٰہیہ (الأسماء الإلهية) ان کے دونوں حصوں: عقلی اور نقلی کے ساتھ]\n\nپس صاحب اعتزال (العزلة) وہ ہے جو اپنے رب کی طرف سے جو کچھ اس کے لیے ہے اس کے ساتھ اعتزال اختیار کرتا ہے، بغیر ان اسماء الٰہیہ (الأسماء الإلهية) کے ساتھ تخلق (تخلق) اختیار کیے جن کے بارے میں عقل یہ گمان کرتی ہے کہ وہ اس کے لیے منفرد ہیں، اور جو شریعت میں مقرر ہیں (المشروعة) – وہ اسماء جن کے ذریعے عقل اللہ کو نامزد نہ کرتی اگر شریعت نہ ہوتی۔ یہ اسماء الحق (الحق) کے لیے ہیں، اور انسان کو ان پر جبلت دی گئی ہے اور اسے ان کے لیے مظہر (مجلى) بنایا گیا ہے۔ پس وہ ان کے ذریعے نامزد ہوتا ہے، اور اس کے لیے ایسے اسماء الٰہیہ (الأسماء الإلهية) سے اعتزال ممکن نہیں ہے۔ اور اسماء الٰہیہ (الأسماء الإلهية) کا دوسرا حصہ باقی ہے، جس سے وہ اعتزال اختیار کرتا ہے اس نقصان کی وجہ سے جو اس سے اس پر لاحق ہو سکتا ہے، جیسا کہ اس نے فرمایا: ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ (چکھ لے، بے شک تو ہی غالب، عزت والا ہے) [الدخان: 49]، اور اس کا قول: كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ (اسی طرح اللہ ہر متکبر، جبار کے دل پر مہر لگا دیتا ہے) [غافر: 35]۔ پس وہ ایسے اسماء الٰہیہ (الأسماء الإلهية) سے اعتزال اختیار کرتا ہے کیونکہ ان میں اس شخص کے لیے مذمت ہے جو ان کے ذریعے نامزد ہوتا ہے اور جس کا حکم دنیا میں ظاہر ہوتا ہے۔ انسان کی حقیقت یہ ہے کہ وہ محتاج (عائلا) ہے، اور محتاج متکبر (متكبرا) نہیں ہو سکتا، کیونکہ وہ اس چیز کے ساتھ ظاہر ہوا جو صفت کے اعتبار سے اس کی نہیں ہے۔ اور اسی وجہ سے:\n\nاللہ تعالیٰ اس کی طرف نظر نہیں فرماتے، اور وہ تین میں سے ایک ہے: بوڑھا زانی، جھوٹا بادشاہ، اور متکبر محتاج (العائل المستكبر)۔ اسے مسلم نے اپنی صحیح میں ذکر کیا ہے۔\n\n[اسماء الٰہیہ (الأسماء الإلهية) کے ساتھ تخلق (التخلق) اور بندے کا اس میں حق (الحق) کے ساتھ مزاحمت کرنا]\n\nپس جس نے اسماء حسنیٰ (الأسماء الحسنى) کے ساتھ تخلق (التخلق) اور ان میں الحق (الحق) کے ساتھ مزاحمت کو دیکھا، اس لیے کہ وہ صورت (الصورة) پر پیدا کیا گیا ہے، تو اسے لازماً ان کے ساتھ ظاہر ہونا چاہیے اور مشروع اور قابل تعریف حد تک ان سے متصف ہونا چاہیے۔ یہ عبودیت (عبودية) کی ربوبیت (ربوبية) کے ساتھ مزاحمت ہے۔ یہ اس لیے ہے کہ اس نے دیکھا کہ اس کے لیے ایسے اسماء ہیں جو حقیقت میں اس کے ہیں اور جن میں وہ منفرد ہے، اور اس نے دیکھا کہ الحق (الحق) نے ان میں اس کے ساتھ مزاحمت کی ہے، جیسے ہنسنا (الضحك)، خوشی (الفرح)، تعجب (التعجب)، محبت کرنے والا ہونا (المحب)، تردد (المتردد)، نفرت کرنے والا ہونا (الكارة)، بھولنا (الناسي)، شرم و حیا (الاستحياء)، اور اس سے ملتی جلتی چیزیں جن کا ذکر کتاب و سنت میں آیا ہے، نیز وہ اعضاء جو نشأت (النشأة) میں داخل ہیں جیسے ہاتھ (يد)، دو ہاتھ (يدين)، کئی ہاتھ (أيد)، خوف (وجل)، آنکھ (عين)، اور کئی آنکھیں (أعين)، اور وہ احوال (الأحوال) جو نشأت میں داخل ہیں جیسے استواء (استواء)، معیت (معية)، نزول (نزول)، طلب (طلب)، شوق (شوق) اور اس جیسی مثالیں۔ اور اس معتزل (المعتزل) نے اپنے اعتزال (اعتزاله) سے پہلے دیکھا کہ الحق (الحق) نے ان صفات میں اس کے ساتھ مزاحمت کی ہے جو بندے (العبد) کے لیے ہونی چاہئیں، جیسا کہ وہ اس کے نزدیک حقیقت میں ہیں۔ اس نے کہا: \"میرے لیے زیادہ مناسب یہ ہے کہ میں اپنے اسماء کے ساتھ اس کے اسماء سے اعتزال اختیار کروں، اور ان میں اس کے ساتھ مزاحمت نہ کروں، تاکہ وہ میرے پاس عاریت (عارية) رہیں، کیونکہ عاریت ایک امانت (أمانة) ہے جسے ادا کرنا ضروری ہے، اور امانت اٹھانے والا الٰہی تعریف کے مطابق ظلم (الظلم) اور جہل (الجهل) سے موصوف ہے۔\"\n\n[بندے کا اپنی خصوصیت کی طرف لوٹنا اور اپنی شیئیت (شيئية) کے گھر میں بیٹھ جانا]\n\nپس اس نظر کے حامل شخص نے اسماء حسنیٰ (الأسماء الحسنى) کے ساتھ تخلق (التخلق) سے اعتزال اختیار کیا اور اپنے فقر (فقره)، ذلت (ذله)، صغارت (صغاره)، عجز (عجزه)، قصور (قصوره)، اور جہل (جهله) کے ساتھ اپنے گھر میں منفرد ہو گیا۔ جب بھی کوئی اسم الٰہی (اسم الإلهي) اس کے دروازے پر دستک دیتا تو اسے کہا جاتا کہ یہاں کوئی نہیں جو تم سے بات کرے۔ جب اس اعتزال (الاعتزال) کے ذریعے اس پر یہ بات واضح ہو گئی کہ اللہ (اللہ) کے لیے اولیت کی نفی (نفي الأولية) ہے اور وہ ازلی الوجود (أزلي الوجود) ہے، اور اس نے اس کے کلام سبحانہ و تعالیٰ میں غور کیا اور اس میں جو اس نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا کہ وہ اس کی صفات اور اسماء کے بارے میں ہم تک پہنچائیں تاکہ ہم اس کے ذریعے اسے پہچانیں، اور وہ اس تعریف کے ذریعے ہمیں علم کی خلعتیں (خلع العلم) عطا کرے تاکہ ہمیں شرف بخشے، تو اس نے ہمیں بتایا کہ یہ صفات جن کے بارے میں ہم نے گمان کیا کہ ہم ان کے مستحق ہیں اور وہ حقیقت میں ہماری ہیں، معاملہ اس کے برعکس ہے، کیونکہ وہ خود ان سے متصف ہوا اور ان کے ذریعے نامزد ہوا، جبکہ ہم تو تھے ہی نہیں۔ لہٰذا، ان اسماء اور ان اسماء میں کوئی فرق نہیں جن سے ہم نے اعتزال اختیار کیا تھا۔ پس یا تو ہم سب سے اعتزال اختیار کریں، یا ہم سب کے ذریعے نامزد ہوں۔ ہم نے اس سے کہا: \"سب سے اعتزال اختیار کر لو اور الحق (الحق) پر چھوڑ دو۔ اگر وہ چاہے تو تمہیں تمام اسماء سے نامزد کر دے، تو انہیں قبول کر لو اور اعتراض نہ کرو۔ اور اگر وہ چاہے تو تمہیں بعض سے نامزد کرے۔ اور اگر وہ چاہے تو تمہیں ان میں سے کسی ایک سے بھی نامزد نہ کرے۔\" لِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ (اللہ ہی کے لیے ہے حکم پہلے بھی اور بعد میں بھی) [الروم: 4]۔ پس بندہ اپنی خصوصیت کی طرف لوٹ آیا، جو کہ عبودیت (العبودة) ہے جس نے ربوبیت (الربوبية) کے ساتھ مزاحمت نہیں کی۔ اس نے اس سے خود کو آراستہ کیا اور اپنی شیئیت (شيئية) کے ثبوت (ثبوته) کے گھر میں بیٹھ گیا، نہ کہ اپنی ہستی (وجوده) کی شیئیت (شيئية) میں، الحق (الحق) کے تصرف کو اپنے اندر دیکھتا رہا، جبکہ وہ اس میں تدبیر (التدبير) سے معتزل تھا۔ اگر اس حال والا شخص کسی بھی نام سے نامزد ہو، تو اللہ ہی اسے نامزد کرنے والا ہے، وہ خود نامزد نہیں ہوتا، اور اسے یہ حق نہیں کہ وہ اس نام کو رد کر دے جس سے اللہ نے اسے نامزد کیا ہے۔ وہ اسماء الحق (الحق) کی طرف سے اپنے بندوں پر خلعتیں ہیں، اور وہ تشریف (تشريف) کی خلعتیں ہیں۔ انہیں قبول کرنا ادب (الأدب) ہے کیونکہ وہ بغیر سوال اور خواہش کے اس کے پاس آئی ہیں۔ اور رسول اللہ صلی اللہ علیہ وسلم نے ایسے عطیہ کو لینے کا حکم دیا ہے اور اس چیز کو چھوڑنے کا حکم دیا ہے جسے نفس نے لینے کی خواہش کی اور اس کی طرف جھانک کر تمنا کی۔ اور وہ اس مقام پر رک گیا کہ وہ اللہ کے لیے غاصب (غاصبا) تھا اس چیز میں جسے وہ اپنا سمجھتا تھا۔ پس وہ اللہ ہی کے لیے ہے، اور یہ اس کا قول ہے: وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (اور اسی کی طرف تمام معاملات لوٹائے جاتے ہیں) [ہود: 123]۔ پس اس نے اس سے وہ سب کچھ لے لیا جسے وہ اپنا سمجھتا تھا، سوائے عبادت (العبادة) کے، کیونکہ وہ اسے نہیں لیتا، اس لیے کہ وہ اس کی صفت نہیں ہے۔ پس جب اس نے فرمایا: وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (اور اسی کی طرف تمام معاملات لوٹائے جاتے ہیں)، تو اس نے اس سے فرمایا: فَاعْبُدْهُ (تو اسی کی عبادت کر) [ہود: 123]۔ اور یہی وہ اصل ہے جس کے لیے اسے پیدا کیا گیا: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا) [الذاریات: 56]۔ پس عبادت (العبادة) بندے (العبد) کے لیے ایک حقیقی نام ہے – یہ اس کی ذات (ذاته)، اس کا ٹھکانہ (موطنه)، اس کا حال (حاله)، اس کی عینیت (عينه)، اس کا نفس (نفسه)، اس کی حقیقت (حقيقته)، اور اس کا چہرہ (وجهه) ہے۔\n\n[اللہ کے ساتھ علماء کی خلوت نشینی (عزلة العلماء بالله) اور وہ خلوت نشینی جو عام لوگوں کے ہاں ہے]\n\nپس جس نے یہ اعتزال (العزلة) اختیار کیا، یہ اللہ کے ساتھ علماء (العلماء بالله) کا اعتزال (عزلة) ہے، نہ کہ مخلوق کو چھوڑنا (هجران الخلائق) اور دروازے بند کر کے گھروں میں رہنا۔ اور وہ اعتزال (العزلة) جو عام لوگوں کے ہاں معروف ہے، وہ یہ ہے کہ انسان اپنے گھر میں رہے، میل جول نہ رکھے اور اپنی خلوت نشینی (عزلته) کے ذریعے جہاں تک ہو سکے سلامتی طلب کرے تاکہ وہ لوگوں سے محفوظ رہے اور لوگ اس سے محفوظ رہیں۔ یہ اہل طریق (أهل الطريق) کی اکثریت کا اعتزال (العزلة) کے ذریعے مطلوب ہے۔ پھر اگر وہ اس سے اعلیٰ مرحلے پر ترقی کرتا ہے تو وہ اپنے اعتزال (عزلته) کو ایک ریاضت (رياضة) اور اپنی خلوت (خلوته) سے پہلے کی تیاری بنا لیتا ہے تاکہ نفس مخلوق کے ساتھ انس کی مانوس چیزوں (المألوفات) کو ترک کرنے کا عادی ہو جائے، کیونکہ وہ مخلوق کے ساتھ انس کو ان تعلقات اور رکاوٹوں (العلائق والعوائق) میں سے سمجھتا ہے جو اس کے اور اللہ کے ساتھ انس (الأنس بالله) اور اس کے ساتھ تنہا ہونے (الانفراد به) کے مطلوب کے درمیان حائل ہیں۔ پس جب وہ اعتزال (العزلة) کی شرائط کو مضبوط کرنے کے بعد اس سے منتقل ہوتا ہے تو خلوت (الخلوة) کا معاملہ اس کے لیے آسان ہو جاتا ہے۔ یہ اللہ کے خاص بندوں (خاصة أهل الله) کے نزدیک اعتزال (العزلة) کا سبب ہے۔\n\n[وہ خلوت نشینی (العزلة) جو نسبت ہے اور وہ خلوت نشینی جو مقام ہے]\n\nپس یہ اعتزال (العزلة) ایک نسبت (نسبة) ہے، مقام (مقام) نہیں۔ اور پہلا اعتزال (العزلة) جس کا ہم نے ذکر کیا وہ ایک مطلوب مقام (مقام مطلوب) ہے، اور اسی لیے ہم نے اسے اس کتاب میں مقامات (المقامات) میں شامل کیا ہے۔ اور جب یہ مقام (مقام) ہے تو یہ ان مقامات میں سے ہے جو دنیا اور آخرت میں ساتھ رہتے ہیں۔ انس (الأنس) اور وصال (الوصال) والوں میں سے عارفین (العارفين) کے لیے اعتزال (العزلة) میں پانچ سو اڑتیس درجات (درجات) ہیں۔ اور باادب عارفین (العارفين الأدباء) جو ثابت قدم ہیں، ان کے لیے ایک سو تینتالیس درجات ہیں۔ اور انس (أهل الأنس) والوں میں سے ملامتیہ (الملامية) کے لیے پانچ سو سات درجات ہیں۔ اور ان کے ساتھ ثابت قدم باادب ملامتیہ (الملامية من أهل الأدب الواقفين) کے لیے ایک سو بارہ درجات ہیں۔ اور اللہ کے عام بندوں (عموم أهل الله) میں جو اعتزال (العزلة) معروف ہے، وہ مقید مقامات (المقامات المقيدة) میں سے ہے جو ایک شرط کے ساتھ ہی ہوتا ہے، اور حقیقت میں یہ ایک نسبت (نسبة) ہے، مقام (مقام) نہیں ہے۔ تاہم، اس سے فوائد حاصل ہوتے ہیں، جن میں سب سے کم عصمت (العصمة) ہے۔ اس کا دعویٰ کرنے والا جواب دہ ہے، اور اس کی وجہ اپنے نفس کے بارے میں یا ان لوگوں کے بارے میں بدگمانی ہے جن سے اس نے اعتزال اختیار کیا ہے۔ یہ سب عام لوگوں کے اعتزال (عزلة العموم) میں ہے، اور یہ عالم جبروت (الجبروت) اور ملکوت (الملكوت) سے تعلق رکھتا ہے۔ عالم شہادت (عالم الشهادة) میں اس کا کوئی قدم نہیں ہے، لہٰذا اس کی معرفتیں عالم ملک (عالم الملك) کی کسی چیز سے متعلق نہیں ہیں۔",
    "fa": "باب هشتادم در عزلت (العزلة)\n\nچون عزلت گزیدی، به هیچ‌کس تکیه مکن *** و بر اهل و فرزندان خود درنگ مکن\n\nو چون منزلتی را دوست داشتی، آن را پیوسته مپندار *** و از شرک و توحید به واسطه احد (الأحد) غایب شو\n\nو برای طلب مرتبه والا، تنها به سوی آن پرواز کن *** بدون فکر، بدون نفس و بدون جسد\n\nو با همت والا مسابقه ده تا به کسی دست یابی *** که با اسماء حسنی بی‌شمارش برتری یافته است\n\nو بدان که تو محبوس و احاطه شده‌ای *** به نوری که حبسی آشکار و بی‌انتهاست\n\n[اسماء حسنی، برخی معقول و برخی منقول هستند]\n\nعزلت (العزلة) نمی‌گزیند مگر کسی که نفس خود را شناخته باشد، و کسی که نفس خود را شناخت، پروردگارش را شناخته است. پس او را شهودی (الشهود) نیست مگر حق (الحق) از حیث اسماء حسنی و تخلق (التخلق) به آن‌ها، چه در ظاهر و چه در باطن. و اسماء حسنی او سبحانه بر دو بخش است: اسمائی که عقل آن‌ها را می‌پذیرد و مستقلاً به ادراک آن‌ها می‌رسد و آن‌ها را به حق (الحق) نسبت می‌دهد و حق تعالی را با آن‌ها می‌نامد؛ و اسمائی الهی نیز هستند که اگر شرع وارد نمی‌شد، عقل آن‌ها را نمی‌پذیرفت. پس آن‌ها را از روی ایمان می‌پذیرد و از حیث ذات خود تعقل نمی‌کند، مگر اینکه حق (الحق) او را به حقیقت نسبت آن اسماء به خود آگاه سازد، همان‌گونه که انبیاء و اولیای خود را آگاه ساخت.\n\n[صاحب عزلت (العزلة) و اسماء الهی با دو بخش آن: معقول و منقول]\n\nپس صاحب عزلت (العزلة) کسی است که با آنچه از جانب پروردگارش برای اوست، عزلت (العزلة) می‌گزیند، بدون اینکه به اسمائی الهی مشروعی که عقل به زعم خود در آن‌ها منفرد است و اگر شرع نبود عقل حق (الحق) را با آن‌ها نمی‌نامید، تخلق (التخلق) جوید. این اسماء از آنِ حق (الحق) هستند و انسان بر آن‌ها سرشته شده و حق (الحق) او را مظهر (مجلی) آن‌ها آفریده است، پس اوست که به آن‌ها نامیده می‌شود و برای او ممکن نیست که از چنین اسماء الهی عزلت (العزلة) گزیند. و بخش دیگر از اسماء الهی باقی می‌ماند که از آن‌ها عزلت (العزلة) می‌گزیند به دلیل ضرری که از آن‌ها بر او عارض می‌شود، چنانکه فرمود: «بچش، همانا تو همان عزیز (العزیز) و کریم (الکریم) هستی» (ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ) و قول او: «این‌گونه خداوند بر هر قلب متکبر جبار مهر می‌نهد» (كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ). پس از چنین اسماء الهی عزلت (العزلة) می‌گزیند به دلیل نکوهشی که در آن‌ها برای کسی است که به آن‌ها نامیده شود و حکم آن‌ها در عالم ظاهر گردد. حقیقت انسان این است که نیازمند (عائل) باشد و نیازمند متکبر نمی‌شود، زیرا او با صفتی ظاهر شده که از آنِ او نیست. و به همین دلیل است که\n\nخداوند به او نظر نمی‌کند، و او یکی از سه نفر است: پیرمرد زناکار، پادشاه دروغگو، و نیازمند متکبر. این را مسلم در صحیح خود ذکر کرده است.\n\n[تخلق (التخلق) به اسماء الهی و مزاحمت بنده با حق (الحق) در آن‌ها]\n\nپس کسی که تخلق (التخلق) به اسماء حسنی و مزاحمت با حق (الحق) در آن‌ها را ببیند، به دلیل اینکه بر صورت (الهی) آفریده شده است، ناگزیر است که با آن‌ها ظاهر شود و در حد مشروع و ستوده ملبس گردد. این مزاحمت، مزاحمت عبودیت (العبودية) با ربوبیت (الربوبية) است. و این بدان سبب است که او دید اسمائی دارد که حقیقتاً از آنِ اوست و در آن‌ها منفرد است، و دید که حق (الحق) در آن‌ها با او مزاحمت کرده است، مانند خنده، شادی، تعجب، دوست‌دار بودن، متردد بودن، بیزار بودن، فراموش‌کار بودن، و حیا، و آنچه شبیه این‌هاست که ذکرشان در کتاب و سنت آمده است؛ تا آنچه که در نشئه (وجود) داخل می‌شود از دست و دو دست و دست‌ها و ترس و چشم و چشم‌ها؛ تا آنچه که در نشئه از احوال داخل می‌شود، مانند استواء، معیت، نزول، طلب و شوق و امثال آن. و این معتزل پیش از عزلتش (العزلة) دید که حق (الحق) در این صفاتی که شایسته بنده است، با او مزاحمت کرده است، همان‌گونه که در نفس‌الامر نزد اوست. گفت: شایسته‌تر برای من این است که با اسمای خود از اسمای او عزلت (العزلة) گزینم و در آن‌ها با او مزاحمت نکنم، تا نزد من عاریه باشند؛ زیرا عاریه امانتی است که باید ادا شود، و حامل امانت به تعریف الهی به ظلم و جهل موصوف است.\n\n[بازگشت بنده به خصوصیت خود و نشستن در خانه شیئیتش]\n\nپس صاحب این نظر از تخلق (التخلق) به اسماء حسنی عزلت (العزلة) گزید و در خانه خود به فقر، خواری، کوچکی، عجز، کوتاهی و جهل خود منفرد شد. هرگاه اسم الهی درِ خانه او را کوبید، به او گفته شد: کسی اینجا نیست که با تو سخن بگوید. پس چون با این عزلت (العزلة) برای او روشن شد که خداوند نفی اولیت را برای خود دارد و وجودش ازلی است، و در کلام او سبحانه و آنچه پیامبرش (صلی الله علیه و سلم) را امر فرمود که از صفات و اسمائش به ما برساند تا او را به واسطه آن بشناسیم و با این تعریف، خلعت علم را به جهت تشریف ما بر ما بپوشاند، نظر کرد. پس ما را آگاه ساخت که این صفاتی که گمان می‌کردیم مستحق آن‌ها هستیم و حقیقتاً از آنِ ماست، امر بر خلاف آن است؛ زیرا او خود به آن‌ها متصف شده و با آن‌ها نامیده شده است، در حالی که ما وجود نداشتیم. پس فرقی بین این اسماء و آن‌هایی که از آن‌ها عزلت (العزلة) گزیدیم نیست. یا باید از همه عزلت (العزلة) گزینیم یا با همه نامیده شویم. پس به او گفتیم: از همه عزلت (العزلة) گزین و حق (الحق) را واگذار. اگر خواست تو را با همه اسماء نامید، بپذیر و اعتراض مکن؛ و اگر خواست تو را با برخی از آن‌ها نامید؛ و اگر خواست تو را با هیچ‌یک از آن‌ها نامید. «امر از پیش و پس از آن، از آنِ خداست» (لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ). پس بنده به خصوصیت خود بازگشت، که همان عبودیت (العبودية) است که با ربوبیت (الربوبية) مزاحمت نمی‌کند. پس به آن آراسته شد و در خانه شیئیت ثبوت خود نشست، نه با شیئیت وجود خود، و به تصریف حق (الحق) در خود می‌نگرد، در حالی که از تدبیر در آن عزلت (العزلة) گزیده است. پس اگر کسی که حالش این است، به هر اسمی نامیده شود، خداوند او را نامیده است، نه اینکه او خود را نامیده باشد، و او را یارای رد آنچه حق (الحق) او را به آن نامیده نیست. آن اسماء، خلعت‌های حق (الحق) بر بندگانش هستند و خلعت‌های تشریف‌اند. پس از ادب است که آن‌ها را بپذیرد، زیرا بدون درخواست و چشم‌داشت به او رسیده است. و رسول خدا (صلی الله علیه و سلم) او را به گرفتن چنین عطایی و ترک آنچه نفس به گرفتن آن چشم دوخته و با نگاه کردن به آن آرزو کرده است، امر فرموده است. و در آنجا متوقف شد بر اینکه او در آنچه گمان می‌کرد از آنِ اوست، غاصب حق (الحق) بوده است، و حال آنکه آن از آنِ حق (الحق) است، و این همان قول حق تعالی است: «و همه امور به سوی او بازگردانده می‌شود» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ). پس حق (الحق) همه آنچه را که بنده گمان می‌کرد از آنِ اوست، از او گرفت، مگر عبودیت (العبودية) را، زیرا آن صفتی برای حق (الحق) نیست. پس حق تعالی به او فرمود، هنگامی که گفت: «و همه امور به سوی او بازگردانده می‌شود» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)، «پس او را بپرست» (فَاعْبُدْهُ)، و این همان اصلی است که برای آن آفریده شده است: «و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند» (وَما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ). پس عبودیت (العبودية) اسمی حقیقی برای بنده است؛ آن ذات، جایگاه، حال، عین، نفس، حقیقت و وجه اوست.\n\n[عزلت (العزلة) عالمان به حق (الحق) و عزلت (العزلة) که نزد عامه مردم است]\n\nپس کسی که این عزلت (العزلة) را گزیند، آن عزلت (العزلة) عالمان به حق (الحق) است، نه دوری جستن از خلایق و نه بستن درها و خانه‌نشینی. و عزلت (العزلة) که نزد مردم رایج است این است که انسان خانه‌نشین شود و معاشرت و اختلاط نکند و تا می‌تواند با عزلت (العزلة) خود طلب سلامت کند تا از مردم در امان باشد و مردم نیز از او در امان باشند. این خواسته عامه اهل طریقت است. سپس اگر به مرحله‌ای بالاتر از این ارتقا یابد، عزلت (العزلة) خود را ریاضت و مقدمه‌ای برای خلوت خود قرار می‌دهد تا نفس به قطع مأنوسات از اُنس با خلق عادت کند؛ زیرا اُنس با خلق را از علایق و موانعی می‌بیند که بین او و مطلوبش، یعنی اُنس با حق (الحق) و انفراد با او، حائل می‌شوند. پس چون پس از محکم کردن شرایط عزلت (العزلة) از آن منتقل شود، امر خلوت بر او آسان می‌گردد. این سبب عزلت (العزلة) نزد خاصان اهل حق (الحق) است.\n\n[عزلت (العزلة) که نسبت است و عزلت (العزلة) که مقام است]\n\nپس این عزلت (العزلة) یک نسبت است نه مقام. اما عزلت (العزلة) اولی که ذکر کردیم، مقامی مطلوب است و به همین دلیل آن را در بخش مقامات این کتاب قرار دادیم. و چون مقام باشد، از مقامات همراه در دنیا و آخرت است. پس برای عارفان (العارفین) از اهل اُنس و وصال در عزلت (العزلة)، پانصد و سی و هشت درجه وجود دارد؛ و برای عارفان (العارفین) ادیبِ متوقف، صد و چهل و سه درجه؛ و برای ملامتیه از اهل اُنس در آن، پانصد و هفت درجه؛ و برای ملامتیه از اهل ادبِ متوقف همراه با آن‌ها، صد و دوازده درجه. و عزلت (العزلة) معهود در عموم اهل حق (الحق)، از مقامات مقیدی است که جز با شرطی محقق نمی‌شود، و در حقیقت یک نسبت است نه مقام. اما فوایدی از آن حاصل می‌شود که کمترین آن‌ها عصمت است. صاحب این ادعا مسئول است و علت آن سوء ظن به خود یا به کسانی است که از آن‌ها عزلت (العزلة) گزیده‌ای. و این همه در عزلت (العزلة) عموم است که از عالم جبروت و ملکوت است و در عالم شهادت قدمی ندارد، پس معارف آن به هیچ چیز از عالم مُلک تعلق نمی‌گیرد."
  },
  "page_count": 3
}