{
  "id": 239,
  "title": {
    "ar": "الباب التاسع والثلاثون ومائتان في الهيبة",
    "en": "Chapter 239: On Awe (الهيبة)",
    "ur": "۲۳۹ واں باب ہیبت کے بیان میں",
    "fa": "باب دویست و سی و نهم در هیبت."
  },
  "content": {
    "ar": "## «الباب التاسع والثلاثون ومائتان في الهيبة»\n\n\n> إن الجمال مهوب حيثما كانا *** لأن فيه جلال الملك قد بأنا\n\n\n> الحسن حليته واللطف شيمته *** لذاك نشهده روحا وريحانا\n\n\n> فالقلب يشهده يسطو بخالقه *** والعين تشهده بالذوق إنسانا\n\n\n### [أن الهيبة أثر تجلى جلال الجمال الإلهي لقلب العبد]\n\n\nاعلم أن الهيبة حالة للقلب يعطيها أثر تجلى جلال الجمال الإلهي لقلب العبد فإذا سمعت من يقول إن الهيبة نعت ذاتي للحضرة الإلهية فما هو قول صحيح ولا نظر مصيب وإنما هي أثر ذاتي للحضرة إذا تجلى جلال جمالها للقلب وهي عظمة يجدها المتجلي له في قلبه إذا أفرطت تذهب حاله ونعته ولا تزيل عينه فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ ذلك التجلي دَكًّا فما أعدمه ولكن أزال شموخه وعلوه وكان نظر موسى في حال شموخه وكان التجلي له من الجانب الذي لا يلي موسى فلما صار دكا ظهر لموسى ما صير الجبل دكا ف خَرَّ مُوسى‏ صَعِقاً لأن موسى ذو روح له حكم في مسك الصورة على ما هي عليه وما عدا الحيوان فروحه عين حياته لا أمر آخر فكان الصعق لموسى مثل الدك للجبل لاختلاف الاستعداد إذ ليس للجبل روح يمسك عليه صورته فزال عن الجبل اسم الجبل ولم يزل عن موسى بالصعق اسم موسى ولا اسم الإنسان فأفاق موسى ولم يرجع الجبل جبلا بعد دكه لأنه ليس له روح يقيمه فإن حكم الأرواح في الأشياء ما هو مثل حكم الحياة لها فالحياة دائمة في كل شي‏ء والأرواح كالولاة وقتا يتصفون بالعزل ووقتا يتصفون بالولاية ووقتا بالغيبة عنها مع بقاء الولاية فالولاية ما دام مدبرا لهذا الجسد الحيواني والموت عزله والنوم غيبته عنه مع بقاء الولاية عليه فإذا علمت إن الهيبة عظمة وأن العظمة راجعة لحال المعظم بكسر الظاء اسم فاعل علمت أنها حالة القلب فهو نعت كياني ومستندة في الإلهية من العلوم التي لا تنقال ولا تذاع ولا يعرفه إلا من علم إن الوجود هو الحق وأنه المنعوت بكل نعت قال تعالى ومن يُعَظِّمْ شَعائِرَ الله فَإِنَّها من تَقْوَى الْقُلُوبِ يعني تلك العظمة ولما كانت العظمة تعطي الحياء والحياء نعت إلهي فإن الله يستحيي من ذي الشيبة يوم القيامة لعظيم حرمة الشيب عنده تعالى فقد نعت نفسه بأن بعض الأشياء تعظم عنده كما قال وتَحْسَبُونَهُ هَيِّناً وهُوَ عِنْدَ الله عَظِيمٌ فقد قامت به العظمة لذلك الذي هان على الجاهل بقدره من الافتراء على بيت رسول الله صلى الله عليه وسلم والألفاظ لما كانت محجورة من الشارع علينا فلا نطلقها إلا حيث أمرنا بإطلاقها فوقع الفرق بين الهيبة والعظمة فنطلق العظمة في ذلك ولا نطلق الهيبة ولا الخوف ولا القبض فاعلم ذلك والله سبحانه يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Thirty-Nine: On Awe (الهيبة)\n\nIndeed, Beauty is awe-inspiring wherever it may be,\nBecause in it, the Majesty of the King has become manifest.\n\nGoodness is its adornment, and gentleness is its nature,\nTherefore, we witness it as spirit and sweet fragrance.\n\nSo the heart witnesses it, overpowering through its Creator,\nAnd the eye witnesses it, through direct experience (الذوق), as a human.\n\n### [That Awe (الهيبة) is the effect of the theophany (تجلى) of the Majesty (جلال) of Divine Beauty upon the heart of the servant]\n\nKnow that Awe (الهيبة) is a state (حالة) of the heart, bestowed by the effect of the theophany (تجلى) of the Majesty of Divine Beauty (الجمال الإلهي) upon the heart of the servant (العبد). If you hear someone say that Awe is an essential attribute (نعت ذاتي) of the Divine Presence (الحضرة الإلهية), that is neither a correct statement nor an accurate view. Rather, it is an essential effect (أثر ذاتي) of the Presence when the Majesty of Its Beauty manifests to the heart.\n\nIt is a grandeur (عظمة) that the recipient of theophany finds in his heart; if it becomes excessive, it removes his state (حال) and his attribute (نعت), but does not remove his essence (عين). Thus, <<فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا>> (When his Lord manifested Himself to the mountain, He made it crumble to dust). That theophany did not annihilate it, but removed its loftiness and height.\n\nMoses’ gaze was upon it while it was still lofty, and the Theophany was directed toward the side that did not face Moses. When it crumbled to dust, that which caused the mountain to crumble became manifest to Moses, so <<خَرَّ مُوسَى صَعِقًا>> (Moses fell down unconscious). This is because Moses possesses a spirit (روح) which has the power to maintain the form as it is. As for anything other than the living being (الحيوان), its spirit is the very essence of its life, not another matter.\n\nThus, the unconsciousness (الصعق) for Moses was like the crumbling (الدك) for the mountain, due to the difference in preparedness (الاستعداد). Since the mountain does not possess a spirit to maintain its form, the name 'mountain' vanished from the mountain. But the name 'Moses' and the name 'human' did not vanish from Moses due to the unconsciousness. Moses recovered, but the mountain did not return to being a mountain after its crumbling, because it does not possess a spirit to sustain it.\n\nFor the rule of spirits (الأرواح) over things is not the same as the rule of life (الحياة) over them. Life is permanent in everything, but spirits are like governors (الولاة): sometimes they are characterized by dismissal (العزل), sometimes by governance (الولاية), and sometimes by absence from it while the governance remains. Governance is maintained as long as the spirit manages this animal body; death is its dismissal, and sleep is its absence from it, while the governance over it remains.\n\nIf you know that Awe (الهيبة) is Grandeur (عظمة), and that Grandeur refers back to the state of the one who glorifies (المعظِّم)—the active participle—you know that it is a state of the heart. Thus, it is an existential attribute (نعت كياني), and its basis in Divinity (الإلهية) is among the sciences that are neither spoken nor divulged, and none knows it except he who knows that Existence (الوجود) is The Real (الحق) and that He is described by every attribute.\n\nThe Exalted said: <<وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ>> (And whoever honors the symbols of Allah—indeed, it is from the piety of the hearts). This refers to that Grandeur. Since Grandeur gives rise to modesty (الحياء), and modesty is a Divine attribute, for Allah is modest before the gray-haired person on the Day of Resurrection due to the great sanctity of gray hair in His sight. Thus, He has described Himself by stating that some things are held in grandeur by Him, as He said: <<وَتَحْسَبُونَهُ هَيِّنًا وَهُوَ عِندَ اللَّهِ عَظِيمٌ>> (And you thought it to be trivial, while it was, in the sight of Allah, tremendous). Grandeur has thus been established in Him regarding that which was trivialized by the ignorant person concerning its worth, such as the slander against the household of the Messenger of Allah, peace and blessings be upon him.\n\nSince the usage of terms (الألفاظ) is restricted upon us by the Lawgiver (الشارع), we only employ them where we have been commanded to do so. Thus, a distinction arises between Awe (الهيبة) and Grandeur (العظمة). Therefore, we apply the term Grandeur in that context, but we do not apply Awe (الهيبة), nor Fear (الخوف), nor Contraction (القبض). Know this. And Allah, the Glorious, <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "## «باب نمبر دو سو انتالیس: ہیبت کے بیان میں»\n\nبے شک جمال جہاں بھی ہو، ہیبت والا ہوتا ہے\nکیونکہ اس میں بادشاہ (ذات حق) کا جلال ظاہر ہو چکا ہوتا ہے\nحسن اس کا زیور ہے اور لطف اس کی خصلت ہے\nاسی لیے ہم اسے روح اور خوشبو کی مانند دیکھتے ہیں\nپس قلب اسے اپنے خالق کے ساتھ غلبہ پاتے ہوئے دیکھتا ہے\nاور آنکھ اسے ذوق کے ذریعے انسان کی صورت میں دیکھتی ہے\n\n### [کہ ہیبت بندے کے قلب پر جمال الٰہی کے جلال کے ظہور الٰہی (التجلی) کا اثر ہے]\n\nجان لو کہ ہیبت (الہیبۃ) قلب کی ایک ایسی حالت ہے جو بندے کے قلب پر جمال الٰہی کے جلال کے ظہور الٰہی (التجلی) کے اثر سے پیدا ہوتی ہے۔ پس اگر تم کسی کو یہ کہتے سنو کہ ہیبت (الہیبۃ) حضور الٰہی کی ذاتی صفت ہے، تو یہ قول صحیح نہیں ہے اور نہ ہی یہ درست نظریہ ہے۔ بلکہ یہ حضور الٰہی کا ذاتی اثر ہے جب اس کا جمالی جلال قلب پر ظاہر ہوتا ہے۔ یہ ایک ایسی عظمت ہے جسے وہ شخص اپنے قلب میں پاتا ہے جس پر ظہور الٰہی (التجلی) ہوا ہو۔ اگر یہ عظمت حد سے بڑھ جائے تو اس کی حالت اور صفت زائل ہو جاتی ہے، لیکن اس کی عینیت (ذات) ختم نہیں ہوتی۔\n\nفَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا\n\"پس جب اس کے رب نے پہاڑ پر ظہور الٰہی (التجلی) فرمایا تو اس نے اسے ریزہ ریزہ کر دیا\" [سورۃ الأعراف ۷:۱۴۳]\n\nتو اس نے اسے معدوم نہیں کیا، بلکہ اس کی بلندی اور اس کے شموخ کو زائل کر دیا۔ اور موسیٰ کا دیکھنا اس کے شموخ کی حالت میں تھا، اور ظہور الٰہی (التجلی) اس جانب سے ہوا جو موسیٰ کے مقابل نہیں تھی۔ پس جب وہ (پہاڑ) ریزہ ریزہ ہو گیا تو موسیٰ پر وہ چیز ظاہر ہوئی جس نے پہاڑ کو ریزہ ریزہ کیا تھا، تو\nخَرَّ مُوسى‏ صَعِقاً\n\"موسیٰ بے ہوش ہو کر گر پڑے\" [سورۃ الأعراف ۷:۱۴۳]\n\nکیونکہ موسیٰ روح کے مالک تھے، اور روح کا حکم یہ ہے کہ وہ صورت کو اسی حالت پر برقرار رکھتی ہے جس پر وہ ہے۔ اور حیوان کے علاوہ، اس کی روح عین اس کی زندگی ہے، کوئی دوسری چیز نہیں۔ پس موسیٰ کے لیے بے ہوشی (الصعق) پہاڑ کے ریزہ ریزہ ہونے (الدک) کی مانند تھی، کیونکہ استعداد مختلف تھی۔ چونکہ پہاڑ کے پاس کوئی روح نہیں تھی جو اس کی صورت کو برقرار رکھتی، اس لیے پہاڑ سے پہاڑ کا نام زائل ہو گیا، لیکن موسیٰ سے بے ہوشی کے سبب نہ موسیٰ کا نام زائل ہوا اور نہ انسان کا نام۔ پس موسیٰ ہوش میں آ گئے، لیکن پہاڑ ریزہ ریزہ ہونے کے بعد دوبارہ پہاڑ نہیں بنا، کیونکہ اس کے پاس کوئی روح نہیں تھی جو اسے قائم رکھتی۔\n\nکیونکہ اشیاء میں ارواح کا حکم ان میں زندگی کے حکم جیسا نہیں ہے۔ زندگی ہر چیز میں دائمی ہے، جبکہ ارواح والیوں (حکمرانوں) کی مانند ہیں؛ کبھی وہ معزولی کی صفت سے متصف ہوتے ہیں، کبھی ولایت (حکمرانی) کی صفت سے، اور کبھی ولایت کے باقی رہتے ہوئے اس سے غائب ہونے کی صفت سے۔ پس ولایت اس وقت تک ہے جب تک وہ اس حیوانی جسم کی تدبیر کر رہی ہے، اور موت اس کی معزولی ہے، اور نیند اس سے غائب ہونا ہے جبکہ ولایت اس پر باقی رہتی ہے۔\n\nپس جب تم یہ جان لو کہ ہیبت (الہیبۃ) عظمت (العظمۃ) ہے، اور یہ کہ عظمت (العظمۃ) اس شخص کی حالت کی طرف لوٹتی ہے جو تعظیم کرنے والا (المُعَظِّم - ظاء کے نیچے زیر کے ساتھ، اسم فاعل) ہے، تو تم جان لو گے کہ یہ قلب کی ایک حالت ہے۔ پس یہ ایک وجودی صفت (نعت کیانی) ہے، اور الوہیت میں اس کا استناد ان علوم سے ہے جو نہ بیان کیے جاتے ہیں اور نہ ہی پھیلائے جاتے ہیں، اور اسے صرف وہی جانتا ہے جو یہ جانتا ہے کہ ہستی (الوجود) ہی ذات حق (الحق) ہے اور وہ ہر صفت سے متصف ہے۔\n\nاللہ تعالیٰ نے فرمایا:\nوَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ\n\"اور جو شخص اللہ کی نشانیوں کی تعظیم کرتا ہے تو یہ دلوں کے تقویٰ میں سے ہے\" [سورۃ الحج ۲۲:۳۲]\nیعنی یہی عظمت۔ اور چونکہ عظمت حیا پیدا کرتی ہے، اور حیا ایک الٰہی صفت ہے، اس لیے اللہ تعالیٰ قیامت کے دن سفید بالوں والے (بوڑھے) سے حیا فرمائے گا، کیونکہ اس کے نزدیک سفید بالوں کی حرمت بہت زیادہ ہے۔ پس اس نے خود کو اس صفت سے متصف کیا ہے کہ بعض چیزیں اس کے نزدیک عظیم ہوتی ہیں، جیسا کہ اس نے فرمایا:\nوَتَحْسَبُونَهُ هَيِّنًا وَهُوَ عِندَ اللَّهِ عَظِيمٌ\n\"اور تم اسے ہلکا سمجھتے ہو، حالانکہ وہ اللہ کے نزدیک بہت بڑا (عظیم) ہے\" [سورۃ النور ۲۴:۱۵]\n\nپس عظمت اس چیز کے ساتھ قائم ہوئی جو رسول اللہ صلی اللہ علیہ وسلم کے گھر پر افترا پردازی کی وجہ سے جاہل کے نزدیک حقیر تھی۔ اور چونکہ الفاظ شارع (شریعت ساز) کی طرف سے ہم پر محدود کیے گئے ہیں، اس لیے ہم انہیں صرف وہیں استعمال کرتے ہیں جہاں ہمیں ان کے استعمال کا حکم دیا گیا ہے۔ چنانچہ ہیبت (الہیبۃ) اور عظمت (العظمۃ) کے درمیان فرق واقع ہوا ہے۔ پس ہم اس معاملے میں عظمت کا اطلاق کرتے ہیں، لیکن ہیبت (الہیبۃ)، خوف (الخوف) یا قبض (القبض) کا اطلاق نہیں کرتے۔ پس یہ جان لو، اور اللہ سبحانہ و تعالیٰ حق فرماتا ہے اور\nوَهُوَ يَهْدِي السَّبِيلَ\n\"وہی راستہ دکھاتا ہے\" [سورۃ الأحزاب ۳۳:۴]",
    "fa": "باب دویست و سی و نهم در هیبت (الهيبة)\n\nهمانا زیبایی هر جا که باشد، هیبت‌انگیز است (إن الجمال مهوب حيثما كانا) *** زیرا در آن، جلال پادشاهی آشکار گشته است (لأن فيه جلال الملك قد بأنا)\nحُسن، زیور اوست و لطف، خوی او *** از این رو، آن را چون روح و ریحان مشاهده می‌کنیم (لذاك نشهده روحا وريحانا)\nپس قلب، آن را در حال غلبه بر خالقش شهود می‌کند *** و چشم، آن را با ذوق، به صورت انسان مشاهده می‌نماید (والعين تشهده بالذوق إنسانا)\n\n[اینکه هیبت، اثر تجلی جلال جمال الهی بر قلب بنده است]\n\nبدان که هیبت (الهيبة) حالتی برای قلب است که اثر تجلی جلال جمال الهی (التجلی) آن را به قلب بنده می‌بخشد. پس اگر شنیدی کسی می‌گوید هیبت، صفتی ذاتی برای حضرت الهی است، این سخنی صحیح و نظری درست نیست. بلکه هیبت، اثری ذاتی برای حضرت (الهی) است هنگامی که جلال جمالش بر قلب تجلی (التجلی) کند. و آن، عظمتی است که متجلی‌له (کسی که تجلی بر او واقع شده) در قلب خود می‌یابد؛ اگر این عظمت افراطی شود، حال و صفت او را از بین می‌برد، اما عینیت او را زایل نمی‌کند.\n\nپس هنگامی که پروردگارش بر کوه تجلی (التجلی) کرد، آن تجلی کوه را متلاشی ساخت (دَكًّا) [قرآن: فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا]. پس آن را معدوم نساخت، بلکه شکوه و بلندی‌اش را از بین برد. و نظر موسی در حال شکوه کوه بود و تجلی (التجلی) از سمتی بود که رو به موسی نبود. پس هنگامی که کوه متلاشی شد، آنچه کوه را متلاشی ساخت، بر موسی آشکار گشت، پس موسی مدهوش بر زمین افتاد [قرآن: خَرَّ مُوسى‏ صَعِقاً]. زیرا موسی دارای روحی است که در حفظ صورت (شکل) بر همان حالتی که هست، حکم دارد. اما غیر از حیوان، روحش عین حیاتش است نه امری دیگر. پس بیهوشی (صعق) برای موسی مانند متلاشی شدن (دک) برای کوه بود، به دلیل اختلاف استعداد. زیرا کوه روحی ندارد که صورتش را حفظ کند، پس نام کوه از آن زایل شد، اما با بیهوشی، نام موسی و نام انسان از موسی زایل نشد. پس موسی به هوش آمد، اما کوه پس از متلاشی شدن، دوباره کوه نشد، زیرا روحی ندارد که آن را برپا دارد.\n\nزیرا حکم ارواح در اشیاء مانند حکم حیات برای آنها نیست. حیات در هر چیزی دائمی است، اما ارواح مانند والیان هستند؛ گاهی به عزل متصف می‌شوند، گاهی به ولایت، و گاهی به غیبت از آن (جسد) با بقای ولایت. پس ولایت تا زمانی است که مدبر این جسد حیوانی باشد، و مرگ عزل اوست، و خواب غیبت او از آن است با بقای ولایت بر آن. پس اگر دانستی که هیبت (الهيبة) عظمت است، و عظمت به حال مُعَظِّم (کسی که تعظیم می‌کند) بازمی‌گردد، دانستی که هیبت حالت قلب است. پس آن صفتی وجودی (کیانی) است و در الهیات، مستند به علومی است که نه قابل گفتن است و نه قابل انتشار، و آن را نمی‌شناسد مگر کسی که بداند هستی (الوجود) همان حق (الحق) است و اوست که به هر صفتی منسوب می‌شود.\n\nخداوند متعال می‌فرماید: و هر کس شعائر الهی را بزرگ دارد، این از پرهیزگاری دل‌هاست [قرآن: ومَن يُعَظِّمْ شَعائِرَ الله فَإِنَّها مِن تَقْوَى الْقُلُوبِ]؛ یعنی همان عظمت. و چون عظمت، حیا را به دنبال دارد و حیا صفتی الهی است، همانا خداوند در روز قیامت از صاحب موی سپید حیا می‌کند، به دلیل حرمت بزرگ پیری نزد او تعالی. پس خداوند خود را به این صفت توصیف کرده که برخی چیزها نزد او بزرگ شمرده می‌شوند، چنانکه فرمود: و آن را آسان می‌پندارید، در حالی که نزد خداوند بزرگ است [قرآن: وتَحْسَبُونَهُ هَيِّناً وهُوَ عِندَ الله عَظِيمٌ]. پس عظمت به خاطر آن چیزی که نزد جاهل به قدرش، از افترا بر خاندان رسول خدا (صلی الله علیه و آله و سلم) آسان بود، در او (خداوند) قائم گشت.\n\nو چون الفاظ از سوی شارع بر ما محدود شده‌اند، آنها را جز در جایی که به ما امر شده است، به کار نمی‌بریم. پس تفاوتی میان هیبت (الهيبة) و عظمت (العظمة) وجود دارد. در آن مورد (که در آیه ذکر شد) عظمت را به کار می‌بریم، اما هیبت، خوف یا قبض را به کار نمی‌بریم. پس این را بدان، و خداوند سبحان حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند [قرآن: وَاللَّهُ سُبْحَانَهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ]."
  },
  "page_count": 1
}