{
  "id": 156,
  "title": {
    "ar": "الباب السادس والخمسون ومائة في معرفة النبوة البشرية وأسرارها",
    "en": "Chapter One Hundred and Fifty-Six: On the Knowledge of Human Prophethood (النبوة البشرية) and its Mysteries.",
    "ur": "باب ایک سو چھپن: نبوت بشریہ اور اس کے اسرار کی معرفت میں",
    "fa": "باب صد و پنجاه و ششم در معرفت نبوت بشری و اسرار آن"
  },
  "content": {
    "ar": "## (الباب السادس والخمسون ومائة في معرفة النبوة البشرية وأسرارها)\n\n\n> إن النبوة إخبار لأرواح *** مقيدين بأرواح وأشباح‏\n\n\n> لها القصور عليهم كلما وردت *** بكل وجه من التشريع وضاح‏\n\n\n> وقد تكون بلا شرع مخبرة *** بما يكون من أتراح وأفراح‏\n\n\n### [القسم الأول من النبوة البشرية]\n\n\nاعلم أن النبوة البشرية على قسمين قسم من الله إلى عبده من غير روح ملكي بين الله وبين عبده بل إخبارات إلهية يجدها في نفسه من الغيب أو في تجليات لا يتعلق بذلك الإخبار حكم تحليل ولا تحريم بل تعريف إلهي ومزيد علم بالاله أو تعريف بصدق حكم مشروع ثابت إنه من عند الله لهذا النبي الذي أرسل إلى من أرسل إليه أو تعريف بفساد حكم قد ثبت بالنقل صحته عند علماء الرسوم فيطلع صاحب هذا المقام على صحة ما صح من ذلك وفساد ما فسد مع وجود النقل بالطرق الضعيفة أو صحة ما فسد عند أرباب النقل أو فساد ما صح عندهم والإخبار بنتائج الأعمال وأسباب السعادات وحكم التكاليف في الظاهر والباطن ومعرفة الحد في ذلك والمطلع كل ذلك ببينة من الله وشاهد عدل إلهي من نفسه غير أنه لا سبيل أن يكون على شرع يخصه يخالف شرع نبيه ورسوله الذي أرسل إليه وأمرنا باتباعه فيتبعه على علم صحيح وقدم صدق ثابت عند الله تعالى‏\n\n\n### [خصائص صاحب القسم الأول من النبوة البشرية]\n\n\nثم إن لصاحب هذا المقام الاطلاع على الغيوب في أوقات وفي أوقات لا علم له بها ولكن من شرطه العلم بأوضاع الأسباب في العالم وما يؤول إليه الواقف عندها أدبا والواقف معها اعتمادا عليها كل ذلك يعلمه صاحب هذا المقام وله درجات الاتباع وهو تابع لا متبوع ومحكوم لا حاكم ولا بد له في طريقه من مشاهدة قدم رسوله وإمامه لا يمكن أن يغيب عنه حتى في الكثيب وهذا كله كان في الأمم السالفة وأما هذه الأمة المحمدية فحكمهم ما ذكرناه وزيادة وهو أن لهم بحكم شرع النبي محمد صَلَّى اللهُ عَليهِ وسَلَّم أن يسنوا سنة حسنة مما لا تحل حراما ولا تحرم حلالا ومما لها أصل في الأحكام المشروعة وتسنينه إياها ما أعطاه له مقامه وإنما حكم به الشرع وقرره بقوله من سن سنة حسنة الحديث كمسألة بلال في الركعتين بعد الأذان وإحداث الطهارة عند كل حدث وركعتين عقيب كل وضوء والقعود على طهارة وركعتين بعد الفراغ من الطعام وصدقة على وجه خاص بسنة وكل أدب مستحسن مما لم يعينه الشارع فلهذه الأمة تسنينه ولهم أجر من عمل بذلك غير أنهم كما قلنا لا يحلون حراما ولا يحرمون حلالا ولا يحدثون حكما ثم لهم الرفعة الإلهية العامة التي تصحبهم في الدنيا والآخرة\n\n\n### [القسم الثاني من النبوة البشرية]\n\n\nوالقسم الثاني من النبوة البشرية هم الذين يكونون مثل التلامذة بين يدي الملك ينزل عليهم الروح الأمين بشريعة من الله في حق نفوسهم يتعبدهم بها فيحل لهم ما شاء ويحرم عليهم ما شاء ولا يلزمهم اتباع الرسل وهذا كله كان قبل‏\nمبعث محمد صَلَّى اللهُ عَليهِ وسَلَّم فأما اليوم فما بقي لهذا المقام أثر إلا ما ذكرناه من حكم المجتهدين من العلماء بتقرير الشرع لذلك في حقهم فيحلون بالدليل ما أداهم إلى تحليله اجتهادهم وإن حرمه المجتهد الآخر ولكن لا يكون ذلك بوحي إلهي ولا بكشف‏\n\n\n### [المكاشف والمجتهد]\n\n\nوالذي لصاحب الكشف في هذه الأمة تصحيح الشرع المحمدي ما له حكم الاجتهاد فلا يحصل لصاحب هذا المقام اليوم أجر المجتهدين ولا مرتبة الحكم فإن العلم بما هو الأمر عليه في الشرع المنزل يمنعهم من ذلك ولو ثبت عند المجتهد ما ثبت عند صاحب هذا المقام من الكشف بطل اجتهاده وحرم عليه ذلك الحكم ولذلك ليس للمجتهد أن يفتي في الوقائع إلا عند نزولها لا عند تقدير نزولها وإنما ذلك للشارع الأصلي لاحتمال إن يرجع عن ذلك الحكم بالاجتهاد عند نزول ما قدر نزوله ولذلك حرم العلماء الفتيا بالتقليد فلعل الإمام الذي قلده في ذلك الحكم الذي حكم به في زمانه لو عاش إلى اليوم كان يبدو له خلاف ما أفتى به فيرجع عن ذلك الحكم إلى غيره فلا سبيل أن يفتي في دين الله إلا مجتهد أو بنص من كتاب أو سنة لا بقول إمام لا يعرف دليله وإذا كان الأمر على ما ذكرناه فلم يبق في هذه الأمة المحمدية نبوة تشريع فلا نطيل الكلام فيها أكثر من هذا ولكن نطيل الكلام إن شاء الله أكثر من هذا في باب الرسالة البشرية لتقرير حكم المجتهدين والأمر الإلهي بسؤالهم فيما جهل من حكم الله في الأشياء انتهى الجزء الخامس ومائة\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "Chapter One Hundred and Fifty-Six: Concerning the Knowledge of Human Prophecy (النبوة البشرية) and its Secrets\n\nIndeed, prophecy is a communication to souls,\nWho are bound by spirits and bodies.\nIt has palaces over them whenever it arrives,\nWith every clear aspect of the Divine Law (التشريع).\nAnd sometimes it may inform without a Divine Law,\nConcerning what will occur, whether sorrows or joys.\n\n### The First Division of Human Prophecy\n\nKnow that Human Prophecy (النبوة البشرية) is of two divisions. The first division is from Allah to His servant without the mediation of an angelic spirit between Allah and His servant. Rather, these are Divine communications (إخبارات إلهية) that the servant finds within himself, originating from the Unseen (الغيب), or through Theophanies (تجليات). These communications do not relate to a ruling of permissibility (تحليل) or prohibition (تحريم). Instead, they are a Divine instruction (تعريف إلهي), an increase in Gnosis (علم) concerning the Deity, or an affirmation of the truth of an established legal ruling (حكم مشروع) that it is indeed from Allah for this prophet who was sent to those to whom he was sent.\n\n[It may also be] an instruction concerning the invalidity (فساد) of a ruling whose soundness has been established by transmission (النقل) among the scholars of external forms (علماء الرسوم). Thus, the possessor of this station (صاحب هذا المقام) becomes aware of the soundness of what is sound and the invalidity of what is invalid, even if the transmission exists through weak chains, or he becomes aware of the soundness of what the masters of transmission deemed invalid, or the invalidity of what they deemed sound. [He also receives] communications regarding the results of actions, the causes of felicity (السعادات), the rulings of religious obligations (التكاليف) both outwardly and inwardly, and the knowledge of the limits therein. He perceives all of this through a clear proof (بينة) from Allah and a Divine, just witness (شاهد عدل إلهي) within himself. However, there is no way for him to possess a specific Divine Law (شرع) that contradicts the Law of his Prophet and Messenger, to whom he was sent and whom we were commanded to follow. Thus, he follows him based on sound knowledge and a firm footing of sincerity (قدم صدق) established with Allah, the Exalted.\n\n### Characteristics of the Possessor of the First Division of Human Prophecy\n\nFurthermore, the possessor of this station (صاحب هذا المقام) has access to the Unseen (الغيوب) at certain times, while at other times he has no knowledge of it. However, a prerequisite for him is the knowledge of the disposition of causes (أوضاع الأسباب) in the World (العالم), and what the one who stops at them out of proper conduct (أدبا) will ultimately reach, and what the one who relies upon them will ultimately reach. The possessor of this station knows all of this. He holds the degrees of followership (الاتباع); he is a follower, not one who is followed; he is ruled, not a ruler. In his path, he must witness the footsteps (قدم) of his Messenger and Imam; it is impossible for this to be absent from him, even in the dune (الكثيب). This entire description applied to the previous nations (الأمم السالفة).\n\nAs for this Muhammadan Nation (الأمة المحمدية), their ruling is what we have mentioned, with an addition: By the ruling of the Divine Law (شرع) of the Prophet Muhammad (peace and blessings be upon him), they are permitted to establish a good practice (سنة حسنة) that neither makes the forbidden permissible nor the permissible forbidden, and which has an origin in the established legal rulings (الأحكام المشروعة). His establishment of such a practice is not granted to him by his station (مقامه); rather, the Divine Law decreed it and confirmed it with the saying: \"Whoever establishes a good practice (سنة حسنة)...\" [the Hadith]. Examples include the case of Bilal regarding the two cycles of prayer (ركعتين) after the call to prayer (الأذان), renewing ritual purity (الطهارة) after every minor ritual impurity (حدث), two cycles of prayer following every ablution (وضوء), remaining in a state of purity, two cycles of prayer after finishing a meal, and giving charity in a specific customary manner. Every commendable ethical practice (أدب مستحسن) that the Lawgiver (الشارع) did not specifically define, this Nation is permitted to establish. They receive the reward of whoever acts upon it. However, as we stated, they neither make the forbidden permissible nor the permissible forbidden, nor do they introduce a new ruling. Furthermore, they possess the general Divine elevation (الرفعة الإلهية العامة) that accompanies them in this world and the Hereafter.\n\n### The Second Division of Human Prophecy\n\nThe second division of Human Prophecy (النبوة البشرية) consists of those who are like students before the Angel (الملك). The Trustworthy Spirit (الروح الأمين) descends upon them with a Divine Law (شريعة) specific to their own souls, by which Allah commands them to worship Him. He makes permissible for them whatever He wills and forbids them whatever He wills, and they are not obligated to follow the Messengers. All of this existed prior to the mission (مبعث) of Muhammad (peace and blessings be upon him).\n\nAs for today, no trace remains of this station (مقامه) except what we mentioned concerning the ruling of the jurists (المجتهدين) among the scholars, by which the Divine Law confirms this for them. Thus, they make permissible, based on evidence, whatever their independent reasoning (اجتهادهم) leads them to permit, even if another jurist forbids it. However, this is not achieved through Divine revelation (وحي إلهي) nor through Unveiling (كشف).\n\n### The Possessor of Unveiling and the Jurist\n\nThe role of the possessor of Unveiling (صاحب الكشف) in this Nation is the verification (تصحيح) of the Muhammadan Law, but he does not possess the authority of independent reasoning (حكم الاجتهاد). Therefore, the possessor of this station today does not attain the reward of the jurists (المجتهدين) nor the rank of ruling (مرتبة الحكم), because the knowledge of the true state of affairs in the revealed Law prevents them from this. If what is established for the possessor of this station through Unveiling were established for the jurist, the jurist’s independent reasoning would be invalidated, and that ruling would be forbidden to him. For this reason, the jurist is not permitted to issue a legal opinion (يفتي) concerning events except when they actually occur, not when their occurrence is merely hypothesized. That [hypothetical ruling] belongs only to the original Lawgiver (الشارع الأصلي), due to the possibility that the Lawgiver might retract that ruling through independent reasoning when the hypothesized event actually occurs.\n\nFor this reason, scholars have forbidden issuing legal opinions based on blind following (التقليد). For perhaps the Imam whom one follows regarding that ruling—the ruling he issued in his time—if he were alive today, a view contrary to what he ruled might become apparent to him, and he would retract that ruling in favor of another. Therefore, there is no way to issue a legal opinion concerning the religion of Allah except by a jurist (مجتهد) or based on a text from the Book [Quran] or the Sunnah, not based on the saying of an Imam whose evidence is unknown.\n\nSince the matter is as we have described, there remains no prophecy of legislation (نبوة تشريع) in this Muhammadan Nation. Therefore, we will not elaborate further on this topic. However, we shall elaborate, God willing, more extensively in the chapter concerning Human Messengership (الرسالة البشرية) to establish the ruling of the jurists (المجتهدين) and the Divine command to consult them regarding what is unknown concerning Allah’s ruling on matters.\n\nEnd of the One Hundred and Fifth Section.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب ایک سو چھپن: نبوّت بشریہ (النبوة البشرية) اور اس کے اسرار کی معرفت میں\n\nنبوّت (النبوة) روحوں کے لیے خبر ہے، جو روحوں اور جسموں (أشباح) کے ساتھ مقید ہیں۔\n\nجب بھی وہ (نبوّت) وارد ہوتی ہے، تو تشریع (التشريع) کے ہر واضح پہلو کے ساتھ ان پر قصر کرتی ہے۔\n\nاور کبھی یہ بغیر شرع کے بھی ہوتی ہے، جو غموں (أتراح) اور خوشیوں (أفراح) کے بارے میں خبر دیتی ہے۔\n\n### [نبوّت بشریہ (النبوة البشرية) کا پہلا حصہ]\n\nجان لو کہ نبوّت بشریہ (النبوة البشرية) دو قسموں پر ہے۔ ایک قسم وہ ہے جو اللہ کی طرف سے اس کے بندے کو روح ملکی (روح ملكي) کے واسطے کے بغیر پہنچتی ہے، بلکہ یہ الٰہی اِخبارات (إخبارات إلهية) ہیں جنہیں وہ اپنے نفس میں غیب سے پاتا ہے، یا ایسے ظہورات الٰہیہ (تجلیات) میں پاتا ہے جن کا تعلق تحلیل (حلال کرنے) یا تحریم (حرام کرنے) کے کسی حکم سے نہیں ہوتا، بلکہ یہ محض ایک الٰہی تعریف (تعريف إلهي) اور ذات حق (الحق) کے بارے میں علم میں اضافہ ہوتا ہے، یا کسی مشروع حکم کی سچائی کی تعریف ہوتی ہے جو ثابت ہو کہ وہ اللہ کی طرف سے ہے، اس نبی کے لیے جسے ان لوگوں کی طرف بھیجا گیا جن کی طرف وہ بھیجا گیا، یا کسی ایسے حکم کے فساد کی تعریف ہوتی ہے جو رسمی علماء (علماء الرسوم) کے نزدیک نقل کے ذریعے صحیح ثابت ہو چکا ہو۔ پس اس مقام کا حامل شخص اس میں سے جو صحیح ہے اس کی صحت پر اور جو فاسد ہے اس کے فساد پر مطلع ہوتا ہے، اگرچہ اس کی صحت یا فساد کے بارے میں ضعیف طریقوں سے نقل موجود ہو۔ یا اس کے برعکس، جو نقل کرنے والوں (أرباب النقل) کے نزدیک فاسد ہے اس کی صحت پر، یا جو ان کے نزدیک صحیح ہے اس کے فساد پر مطلع ہوتا ہے۔ اور یہ اعمال کے نتائج، سعادتوں کے اسباب، اور ظاہری و باطنی تکالیف کے احکام کے بارے میں خبر دیتا ہے، اور اس میں حد کی معرفت بھی شامل ہے۔ یہ سب کچھ اللہ کی طرف سے دلیل اور اس کے نفس سے ایک عادل الٰہی گواہ کے ساتھ ہوتا ہے۔ تاہم، اس کے لیے یہ ممکن نہیں کہ وہ کوئی ایسی شرع (شرع) بنائے جو اس کے نبی اور رسول کی شرع کے خلاف ہو جس کی طرف اسے بھیجا گیا ہے اور جس کی پیروی کا ہمیں حکم دیا گیا ہے۔ پس وہ صحیح علم اور اللہ تعالیٰ کے ہاں ثابت قدم صدق کے ساتھ اس کی پیروی کرتا ہے۔\n\n### [نبوّت بشریہ (النبوة البشرية) کے پہلے حصے کے حامل کی خصوصیات]\n\nپھر اس مقام کے حامل شخص کے لیے غیوب (الغيوب) پر بعض اوقات اطلاع حاصل کرنا ممکن ہوتا ہے اور بعض اوقات اسے اس کا علم نہیں ہوتا۔ لیکن اس کی شرط یہ ہے کہ وہ دنیا میں اسباب کے طریقوں اور ان کے انجام کو جانتا ہو، خواہ کوئی شخص ادب کے طور پر ان پر قائم ہو یا ان پر بھروسہ کرتے ہوئے قائم ہو۔ اس مقام کا حامل شخص یہ سب جانتا ہے۔ اور اس کے لیے اتباع (پیروی) کے درجات ہیں، وہ تابع ہے نہ کہ متبوع، اور وہ محکوم ہے نہ کہ حاکم۔ اور اس کے لیے ضروری ہے کہ وہ اپنے رسول اور امام کے قدم کا مشاہدہ کرے، یہاں تک کہ کثیب (ریت کے ٹیلے) میں بھی اس سے غائب ہونا ممکن نہیں ہے۔ یہ سب کچھ پچھلی امتوں میں بھی تھا، لیکن اس امت محمدیہ (الأمة المحمدية) کا حکم وہ ہے جو ہم نے ذکر کیا، اور اس میں اضافہ یہ ہے کہ نبی محمد صَلَّى اللهُ عَليهِ وسَلَّم کی شرع کے حکم کے مطابق انہیں یہ حق حاصل ہے کہ وہ کوئی اچھی سنت (سنة حسنة) جاری کریں جو نہ حرام کو حلال کرے اور نہ حلال کو حرام کرے، اور جس کی مشروع احکام میں کوئی اصل موجود ہو۔ اور اس کا سنت جاری کرنا اس مقام کی وجہ سے ہے جو اسے عطا کیا گیا ہے، اور شرع نے اسے اپنے اس قول کے ذریعے مقرر کیا ہے: \"من سن سنة حسنة\" (جس نے کوئی اچھی سنت جاری کی) کی حدیث کے مطابق۔ جیسے بلال کا اذان کے بعد دو رکعتیں پڑھنا، ہر حدث کے بعد طہارت کرنا، ہر وضو کے بعد دو رکعتیں پڑھنا، طہارت پر بیٹھنا، کھانے سے فارغ ہونے کے بعد دو رکعتیں پڑھنا، اور کسی خاص طریقے سے صدقہ کرنا جو سنت کے مطابق ہو۔ اور ہر وہ مستحسن ادب جسے شارع نے متعین نہیں کیا، اس امت کے لیے اسے جاری کرنا جائز ہے۔ اور انہیں اس پر عمل کرنے والوں کا اجر بھی ملے گا، تاہم جیسا کہ ہم نے کہا، وہ نہ حرام کو حلال کرتے ہیں اور نہ حلال کو حرام کرتے ہیں، اور نہ ہی کوئی نیا حکم ایجاد کرتے ہیں۔ پھر ان کے لیے وہ عام الٰہی رفعت (الرفعة الإلهية) ہے جو دنیا اور آخرت میں ان کے ساتھ رہتی ہے۔\n\n### [نبوّت بشریہ (النبوة البشرية) کا دوسرا حصہ]\n\nاور نبوّت بشریہ (النبوة البشرية) کا دوسرا حصہ وہ ہے جو بادشاہ (ملک) کے سامنے شاگردوں کی طرح ہوتے ہیں، جن پر روح الامین (الروح الأمين) اللہ کی طرف سے ان کے اپنے نفوس کے حق میں ایک شریعت لے کر نازل ہوتا ہے، جس کے ذریعے وہ انہیں عبادت کا حکم دیتا ہے، پس وہ ان کے لیے جو چاہے حلال کرتا ہے اور جو چاہے حرام کرتا ہے۔ اور ان پر رسولوں کی پیروی لازم نہیں ہوتی۔ یہ سب کچھ محمد صَلَّى اللهُ عَليهِ وسَلَّم کی بعثت سے پہلے تھا۔ لیکن آج کے دور میں اس مقام کا کوئی اثر باقی نہیں رہا، سوائے اس کے جو ہم نے علماء کے مجتہدین (المجتهدين) کے حکم کے بارے میں ذکر کیا کہ شرع نے ان کے حق میں اس کی اجازت دی ہے۔ پس وہ دلیل کی بنیاد پر اس چیز کو حلال کرتے ہیں جس کی طرف ان کا اجتہاد انہیں لے جاتا ہے، اگرچہ دوسرے مجتہد نے اسے حرام قرار دیا ہو۔ لیکن یہ کسی الٰہی وحی (وحي إلهي) یا کشف (كشف) کی بنیاد پر نہیں ہوتا۔\n\n### [مکاشف (المكاشف) اور مجتہد (المجتهد)]\n\nاور اس امت میں صاحب کشف (صاحب الكشف) کے لیے جو کچھ ہے وہ صرف شرع محمدی کی تصحیح ہے، اس کے لیے اجتہاد (الاجتهاد) کا حکم نہیں ہے۔ پس آج کے دور میں اس مقام کے حامل شخص کو مجتہدین (المجتهدين) کا اجر یا حکم کا مرتبہ حاصل نہیں ہوتا، کیونکہ نازل شدہ شرع میں امر کی حقیقت کا علم انہیں اس سے روکتا ہے۔ اور اگر مجتہد کے نزدیک وہ بات ثابت ہو جائے جو صاحب کشف (صاحب هذا المقام) کے نزدیک کشف (الكشف) سے ثابت ہوئی ہے، تو اس کا اجتہاد باطل ہو جائے گا اور اس پر وہ حکم حرام ہو جائے گا۔ اسی لیے مجتہد کے لیے ضروری ہے کہ وہ واقعات کے نزول کے وقت ہی فتویٰ دے، نہ کہ ان کے نزول کے فرض کرنے پر۔ یہ صرف شارع اصلی (الأصلي) کے لیے ہے، کیونکہ یہ احتمال ہے کہ وہ اجتہاد کے ذریعے اس حکم سے رجوع کر لے جب وہ چیز نازل ہو جس کا نزول فرض کیا گیا تھا۔ اسی لیے علماء نے تقلید (التقليد) کے ذریعے فتویٰ دینے کو حرام قرار دیا ہے، کیونکہ ہو سکتا ہے کہ جس امام کی اس نے اس حکم میں تقلید کی ہے، اگر وہ اپنے زمانے میں اس حکم کو جاری کرنے کے بعد آج تک زندہ رہتا، تو اس کے لیے اس کے خلاف کوئی بات ظاہر ہو جاتی اور وہ اس حکم سے رجوع کر کے کسی دوسرے حکم کی طرف چلا جاتا۔ لہٰذا اللہ کے دین میں فتویٰ دینے کا حق صرف مجتہد کو ہے، یا کتاب و سنت کی نص کی بنیاد پر، نہ کہ کسی ایسے امام کے قول پر جس کی دلیل معلوم نہ ہو۔ اور جب معاملہ ایسا ہی ہے جیسا کہ ہم نے ذکر کیا، تو اس امت محمدیہ (الأمة المحمدية) میں نبوّت تشریع (نبوة تشريع) باقی نہیں رہی۔ لہٰذا ہم اس پر زیادہ کلام نہیں کریں گے۔ لیکن ہم ان شاء اللہ رسالت بشریہ (الرسالة البشرية) کے باب میں اس سے زیادہ کلام کریں گے تاکہ مجتہدین کے حکم اور اللہ کے حکم کو ثابت کیا جا سکے کہ جو چیزیں اللہ کے حکم میں مجہول ہوں ان کے بارے میں ان سے سوال کیا جائے۔\n\nایک سو پانچواں حصہ مکمل ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "باب صد و پنجاه و ششم در معرفت نبوت بشری و اسرار آن\n\nنبوت، خبری است برای جان‌هایی *** که به جان‌ها و کالبدها (أشباح) مقیدند\n\nهرگاه که با هر وجهی از تشریع آشکار *** بر آنان وارد شود، کوتاهی (قصور) بر آنان است\n\nو گاهی نیز بدون شریعت، خبردهنده است *** از آنچه از اندوه‌ها (أتراح) و شادی‌ها (أفراح) رخ می‌دهد.\n\n### [بخش اول از نبوت بشری]\n\nبدان که نبوت بشری بر دو بخش است: بخشی که از جانب خداوند به بنده او می‌رسد، بدون واسطه روح ملکی میان خدا و بنده؛ بلکه اخبارهای الهی است که بنده آن را در نفس خود از غیب می‌یابد یا در تجلیات (تجلیات) که حکم حلال کردن یا حرام کردن به آن اخبار تعلق نمی‌گیرد، بلکه تعریفی الهی و افزونی علم به ذات اله یا تعریفی است به صدق حکمی مشروع و ثابت که آن حکم از جانب خداست برای این پیامبر که به سوی کسانی که به سویش فرستاده شده، ارسال گشته است؛ یا تعریفی است به فساد حکمی که صحت آن به نقل نزد علمای رسوم (الرسوم) ثابت شده است. پس صاحب این مقام بر صحت آنچه صحیح است و فساد آنچه فاسد است، آگاه می‌شود، با وجود نقل به طرق ضعیف؛ یا بر صحت آنچه نزد ارباب نقل فاسد است یا فساد آنچه نزد آنان صحیح است، آگاه می‌گردد. و نیز خبر دادن از نتایج اعمال و اسباب سعادت‌ها و حکم تکالیف در ظاهر و باطن و معرفت حد در آن، و آگاهی بر همه این‌ها با برهانی از جانب خدا و شاهد عدل الهی از نفس خود اوست. با این حال، او را راهی نیست که بر شریعتی خاص خود باشد که مخالف شریعت پیامبر و رسولش باشد که به سوی او فرستاده شده و ما به پیروی از او امر شده‌ایم. پس او با علم صحیح و گام صدق (قدم صدق) استوار نزد خدای تعالی از او پیروی می‌کند.\n\n### [ویژگی‌های صاحب بخش اول از نبوت بشری]\n\nسپس، صاحب این مقام در اوقاتی بر غیوب آگاه می‌شود و در اوقاتی علمی به آن‌ها ندارد. اما از شرط‌های او، علم به اوضاع اسباب در عالم و آنچه کسی که از روی ادب نزد آن‌ها توقف می‌کند و کسی که از روی اعتماد بر آن‌ها توقف می‌کند، به آن منتهی می‌شود، می‌باشد. صاحب این مقام همه این‌ها را می‌داند و او دارای درجات پیروی (الاتباع) است؛ او تابع است نه متبوع، و محکوم است نه حاکم. و در راه خود ناگزیر است که گام رسول و امام خود را مشاهده کند و ممکن نیست که حتی در توده خاک (الکثیب) از او غایب شود. و این همه در امت‌های گذشته بود. اما در مورد این امت محمدی، حکم آنان همان است که ذکر کردیم و افزون بر آن، به حکم شریعت پیامبر محمد (صَلَّى اللهُ عَليهِ وسَلَّم) برای آنان جایز است که سنتی نیکو (سنة حسنة) وضع کنند که حرامی را حلال نکند و حلالی را حرام ننماید، و اصلی در احکام مشروع داشته باشد. و وضع کردن آن سنت از سوی او، چیزی است که مقامش به او داده است، و شرع با قول خود آن را مقرر کرده است: «هر کس سنتی نیکو وضع کند...» مانند مسئله بلال در دو رکعت پس از اذان، و احداث طهارت پس از هر حدث، و دو رکعت پس از هر وضو، و نشستن بر طهارت، و دو رکعت پس از فراغت از طعام، و صدقه‌ای بر وجه خاص به سنت، و هر ادب مستحسنی که شارع آن را معین نکرده است. پس برای این امت وضع کردن آن جایز است و برای آنان پاداش کسی است که به آن عمل کند، با این حال، همان‌طور که گفتیم، حرامی را حلال نمی‌کنند و حلالی را حرام نمی‌نمایند و حکمی جدید وضع نمی‌کنند. سپس برای آنان رفعت الهی عامی است که در دنیا و آخرت همراهشان خواهد بود.\n\n### [بخش دوم از نبوت بشری]\n\nو بخش دوم از نبوت بشری کسانی هستند که مانند شاگردان در برابر فرشته قرار می‌گیرند و روح الامین (الروح الأمین) با شریعتی از جانب خدا در حق نفوسشان بر آنان نازل می‌شود که آنان را به آن متعبد می‌سازد؛ پس آنچه را بخواهد برایشان حلال می‌کند و آنچه را بخواهد بر آنان حرام می‌نماید و پیروی از رسولان بر آنان لازم نیست. و این همه پیش از مبعث محمد (صَلَّى اللهُ عَليهِ وسَلَّم) بود. اما امروز، برای این مقام اثری باقی نمانده است، مگر آنچه را که از حکم مجتهدان (المجتهدين) از علما ذکر کردیم که شرع آن را در حق آنان مقرر کرده است؛ پس با دلیل، آنچه را که اجتهادشان به حلال بودن آن منجر شده، حلال می‌کنند، اگرچه مجتهد دیگر آن را حرام کرده باشد، اما این امر نه به وحی الهی است و نه به کشف (کشف).\n\n### [صاحب کشف و مجتهد]\n\nو آنچه برای صاحب کشف (الکشف) در این امت وجود دارد، تصحیح شریعت محمدی است، نه حکم اجتهاد. پس امروز برای صاحب این مقام، پاداش مجتهدان و مرتبه حکم حاصل نمی‌شود؛ زیرا علم به آنچه امر در شریعت نازل شده بر آن است، آنان را از این کار باز می‌دارد. و اگر آنچه نزد صاحب این مقام از کشف ثابت شده، نزد مجتهد نیز ثابت شود، اجتهاد او باطل می‌شود و آن حکم بر او حرام می‌گردد. به همین دلیل، مجتهد حق ندارد در وقایع فتوا دهد مگر هنگام وقوع آن‌ها، نه هنگام فرض وقوع آن‌ها. و این امر تنها برای شارع اصلی است، زیرا احتمال دارد که شارع اصلی هنگام وقوع آنچه فرض شده، از آن حکم اجتهادی بازگردد. به همین دلیل، علما فتوا دادن به تقلید را حرام کرده‌اند؛ زیرا شاید امامی که در آن حکم از او تقلید شده، اگر تا امروز زنده بود، خلاف آنچه فتوا داده بود برایش آشکار می‌شد و از آن حکم به حکم دیگری باز می‌گشت. پس راهی نیست که در دین خدا فتوا داده شود مگر توسط مجتهد یا به نص کتاب یا سنت، نه به قول امامی که دلیلش دانسته نیست. و چون امر بر این منوال است که ذکر کردیم، پس در این امت محمدی نبوت تشریع باقی نمانده است، لذا کلام را در این باره بیش از این طولانی نمی‌کنیم، اما ان‌شاءالله در باب رسالت بشری برای تقریر حکم مجتهدان و امر الهی به سؤال از آنان در آنچه از حکم خدا در اشیاء مجهول است، کلام را بیش از این طولانی خواهیم کرد. پایان جزء صد و پنجم.\n\n(بسم الله الرحمن الرحیم)\nبه نام خداوند بخشنده مهربان"
  },
  "page_count": 2
}