{
  "id": 131,
  "title": {
    "ar": "الباب الأحد والثلاثون ومائة في مقام ترك العبودية",
    "en": "Chapter 131: Concerning the Station (Maqām) of Relinquishing Servitude ('Ubūdiyya)",
    "ur": "باب ایک سو اکتیسواں: مقامِ ترکِ عبودیت۔",
    "fa": "باب صد و سی و یکم در مقام ترک بندگی (العبودية)"
  },
  "content": {
    "ar": "## (الباب الأحد والثلاثون ومائة في مقام ترك العبودية)\n\n\n> إن انتسبت إلى معلول أنت له *** وأنت لله لا للخلق فازدجروا\n\n\n> نحن المظاهر والمعبود ظاهرها *** ومظهر الكون عين الكون فاعتبروا\n\n\n> ما جاء بي عبثا لكن لنعبده *** حقا بذا حكم التشريع والنظر\n\n\n> ولست أعبده إلا بصورته *** فهو الإله الذي في طيه البشر\n\n\n> فما القضاء إذا حققت صورتنا *** وما التصرف والأحكام والقدر\n\n\n> فكلها عبر إن كنت ذا نظر *** ولا يخيب من تسري به العبر\n\n\n### [أعيان الممكنات باقية على أصلها وهي مظاهر للحق الظاهر فيها]\n\n\nترك العبودية لا يصح إلا عند من يرى أن عين الممكنات باقية على أصلها من العدم وإنها مظاهر للحق الظاهر فيها فلا وجود إلا لله ولا أثر إلا لها فإنها بذاتها تكسب وجود الظاهر ما تقع به الحدود في عين كل ظاهر فهي أشبه شي‏ء بالعدد فإنها معقول لا وجود له وحكمه سار ثابت في المعدودات والمعدودات ليست سوى صور الموجودات كانت ما كانت والموجودات سبب كثرتها أعيان الممكنات وهي أيضا سبب اختلاف صور الموجودات فالعدد حكمه مقدم على حكم كل حاكم‏\n\n\n### [أقل الجمع في عددى الوتر والشفع‏]\n\n\nولما وصلت في أول هذا الباب من هذه النسخة إلى العدد والمعدودات نمت فرأيت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في منامي وأنا بين يديه وقد سألني سائل وهو يسمع ما أقل الجمع في العدد فكنت أقول له عند الفقهاء اثنان وعند النحويين ثلاثة فقال صَلَّى اللهُ عَليهِ وسَلَّم أخطأ هؤلاء وهؤلاء فقلت له يا رسول الله فكيف أقول قال لي إن العدد شفع ووتر يقول الله تعالى والشَّفْعِ والْوَتْرِ والكل عدد فميز ثم أخرج خمسة دراهم بيده المباركة ورمى بها على حصير كنا عليه فرمى درهمين بمعزل ورمى ثلاثة بمعزل وقال لي ينبغي لمن سئل في هذه المسألة أن يقول للسائل عن أي عدد تسأل عن العدد المسمى شفعا أو عن العدد المسمى وترا ثم وضع يده على الاثنين الدرهمين وقال هذا أقل الجمع في عدد الشفع ثم وضع يده على الثلاثة وقال هذا أقل الجمع في عدد الوتر هكذا فليجب من سئل في هذه المسألة كذا هو عندنا واستيقظت فقيدتها في هذا الباب كما رأيتها حين استيقظت وخرج عن ذكري مسائل كثيرة كانت بيني وبينه صَلَّى اللهُ عَليهِ وسَلَّم مما يتعلق بغير هذا الباب وأنا في غاية السرور والفرح برؤيته صَلَّى اللهُ عَليهِ وسَلَّم ووجدت في خاطري عند انتباهي صحة النهي عن البتيراء فإنه تكلم في طريقه فما رأيت معلما أحسن منه وأخذت في تقييدي لهذا الكتاب فنرجع ونقول‏\n\n\n### [العدد حكمه مقدم على حكم كل حاكم وإن لم يكن وجود عينى قائم‏]\n\n\nفالعدد حكمه مقدم على حكم كل حاكم فحكم على الممكنات بالكثرة كثرة الممكنات واختلافات استعداداتها على الظاهر فيها مع أحديته فكثرته كثرة الممكنات ولما كان الأمر هكذا لم يمكن أن يكون للعبودية عين فلهذا المقام يقال بترك العبودية ومن حكم العدد وقوة سريانه وإن لم يكن له وجود قول الله تعالى ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ ولا أَدْنى‏ من ذلِكَ يعني الاثنين وهذا يعضد رؤيانا المتقدمة ولا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا من المراتب التي يطلبها العدد فينسحب عليها حكم العدد وقوله صَلَّى اللهُ عَليهِ وسَلَّم إن لله تسعة وتسعين اسما مائة إلا واحد\n\n\nهذا من حكم العدد\n\n\n### [كما الحق واحد لكل كثرة وليس من جنسها كذلك هو الوجود الظاهر للمظاهر وليس من جنسها]\n\n\nوقال لَقَدْ كَفَرَ الَّذِينَ قالُوا إِنَّ الله ثالِثُ ثَلاثَةٍ ولم يكفر من قال إنه سبحانه رابع ثلاثة وذلك أنه لو كان ثالث ثلاثة أو رابع أربعة على ما توطأ عليه أهل هذا اللسان لكان من جنس الممكنات وهو سبحانه وتعالى ليس من جنس الممكنات فلا يقال فيه إنه واحد منها فهو واحد أبدا لكل كثرة وجماعة ولا يدخل معها في الجنس فهو رابع ثلاثة فهو واحد وخامس أربعة فهو واحد بالغا ما بلغت فذلك هو مسمى الله فهو وإن كان هو الوجود الظاهر بصور ما هي المظاهر عليه فما هو من جنسها فإنه واجب الوجود لذاته وهي واجبة العدم لذاتها أزلا فلها الحكم فيمن تلبس بها كما للزينة الحكم فيمن تزين بها فنسبة الممكنات للظاهر نسبة العلم والقدرة للعالم والقادر وما ثم عين موجودة تحكم على هذا الموصوف بأنه عالم وقادر فلهذا نقول إنه عالم لذاته وقادر لذاته وهكذا هي الحقائق‏\n\n\n### [الوجود المستفاد ونسبته إلى الحق والممكنات‏]\n\n\nفالعدد حاكم لذاته في المعدودات ولا وجود له والمظاهر حاكمة في صور الظاهر وكثرتها في عين الواحد ولا وجود\nلها وليس عندنا في العلم الإلهي مسألة أغمض من هذه المسألة فإن الممكنات على مذهب الجماعة ما استفادت من الحق إلا الوجود وما يدري أحد ما معنى قولهم ما استفادت إلا الوجود إلا من كشف الله عن بصيرته وأصحاب هذا الإطلاق لا يعرفون معناه على ما هو الأمر عليه في نفسه فإنه ما ثم موجود إلا الله تعالى والممكنات في حال العدم فهذا الوجود المستفاد إما أن يكون موجودا وما هو الله ولا أعيان الممكنات وإما أن يكون عبارة عن وجود الحق فإن كان أمرا زائدا ما هو الحق ولا عين الممكنات فلا يخلو أن يكون هذا الوجود موجودا فيكون موصوفا بنفسه وذلك هو الحق لأنه قد قام الدليل على أنه ما ثم وجود أزلا إلا وجود الحق فهو واجب الوجود لنفسه فثبت أنه ما ثم موجود لنفسه غير الله فقبلت أعيان الممكنات بحقائقها وجود الحق لأنه ما ثم وجود إلا هو وهو قوله وما خَلَقْنَا السَّماواتِ والْأَرْضَ وما بَيْنَهُما إِلَّا بِالْحَقِّ وهو الوجود الصرف فانطلق عليه ما تعطيه حقائق الأعيان فحدث الحدود وظهرت المقادير ونفذ الحكم والقضاء وظهر العلو والسفل والوسط والمختلفات والمتقابلات وأصناف الموجودات أجناسها وأنواعها وأشخاصها وأحوالها وأحكامها في عين واحدة فتميزت الأشكال فيها وظهرت أسماء الحق وكان لها الأثر فيما ظهر في الوجود غيرة أن تنسب تلك الآثار إلى أعيان الممكنات في الظاهر فيها وإذا كانت الآثار للأسماء الإلهية والاسم هو المسمى فما في الوجود إلا الله فهو الحاكم وهو القابل فإنه قابل التوب فوصف نفسه بالقبول ومع هذا فتحرير هذه المسألة عسير جدا فإن العبارة تقصر عنها والتصور لا يضبطها لسرعة تفلتها وتناقض أحكامها فإنها مثل قوله وما رَمَيْتَ فنفى إِذْ رَمَيْتَ فأثبت ولكِنَّ الله رَمى‏ فنفى كون محمد وأثبت نفسه عين محمد وجعل له اسم الله فهذا حكم هذه المسألة بل هو عينها لمن تحقق فهذا معنى ترك العبودية في خصوص العلماء بالله‏\n\n\n### [عبودية التصريف وعبودية الإمكان‏]\n\n\nوأما من نزل منهم عن هذه الطبقة فإنه يقول لا يصح تركها باطنا لوجود الافتقار الذي لا ينكره المحدث من نفسه فلا بد أن يذله فتلك الذلة عين العبودية إلا أن يؤخذ الإنسان عن معرفته بنفسه وأما تركها من باب المعرفة فهو أن العبد إذا نظرته من حيث تصرفه لا من حيث ما هو ممكن وأطلقت عليه اسم العبودة من ذلك الباب فيمكن في المعرفة تركها من باب التصرف لا من باب الإمكان وذلك أن حقيقة العبودية الوقوف عند أوامر السيد وما هنا مأمور إلا من يصح منه الفعل بما أمر به والأفعال خلق الله فهو الآمر والمأمور فأين التصرف الحقيقي الذي به يسمى العبد عبدا قائما بأوامر سيده أو منازعا له فيتصف بالإباق فبقي المسمى عبدا على ظهور الاقتدار الإلهي بجريان الفعل على ظاهره وباطنه إما بموافقة الأمر أو بمخالفته وإذا كان هذا على ما ذكرناه فلا عبودية تصريف فهو أعني العبد موجود بلا حكم وهذا مقام تحقيقه عند جميع علماء الذوق من أهل الله إلا طائفة من أصحابنا وغيرهم ممن ليس منا يرون خلاف ذلك وأن الممكن له فعل وأن الله قد فوض إلى عباده أن يفعلوا بعض الممكنات من الأفعال فكلفهم فعلها فقال أَقِيمُوا الصَّلاةَ وآتُوا الزَّكاةَ وأَتِمُّوا الْحَجَّ والْعُمْرَةَ لِلَّهِ وجاهِدُوا في الله وأمثال هذا فإذا أثبتوا أن للعبد فعلا لم يصح ترك عبودية التصريف وأما عبودية الإمكان فأجمعوا على كونها وأنه لا يتصور تركها فإن ذلك ذاتي للممكن وبعض أصحابنا يلحظ في ترك العبودية كون الحق قوى العبد وجوارحه فإنه يغيب عن عبوديته في تلك الحال فهو ترك حال لا ترك حقيقة انتهى الجزء المائة\n\n",
    "en": "## Chapter 131: Concerning the Station of Abandoning Servitude\n\nIf you ascribe yourself to a created thing, you belong to it,\nBut you belong to Allah, not to creation, so be restrained!\n\nWe are the manifestations, and the Worshipped One is their Manifestor,\nThe manifestation of the cosmos is the very essence of the cosmos, so reflect!\n\nI was not brought forth in vain, but that we might truly worship Him.\nBy this is the ruling of the Sacred Law (التشريع) and contemplation (النظر).\n\nI do not worship Him except in His form,\nFor He is the God (الإله) within whose fold is humanity (البشر).\n\nWhat then is the Decree (القضاء) if you realize our form?\nAnd what is disposal (التصرف), rulings (الأحكام), and destiny (القدر)?\n\nAll of them are lessons (عبر) if you possess insight (نظر),\nAnd he who is guided by lessons shall not fail.\n\n### [The Fixed Entities (الأعيان الثابتة) remain upon their origin, and they are the manifestations (مظاهر) for The Real (الحق) who is manifest within them]\n\nThe abandonment of servitude (ترك العبودية) is only valid for those who see that the essence (عين) of the contingent things (الممكنات) remains upon its origin, which is non-existence (العدم). They are merely manifestations for The Real (الحق) who is manifest within them. Thus, there is no Existence (وجود) except for Allah, and no effect (أثر) except for them [the Fixed Entities]. For they, by their very essence (بذاتها), bestow upon the existence of the Manifest One (وجود الظاهر) that by which the limits (الحدود) occur in the essence of every manifest thing. They are most similar to number (العدد), for number is an intelligible concept (معقول) that has no existence, yet its ruling (حكمه) is constant and fixed in the counted things (المعدودات). The counted things are nothing but the forms (صور) of existing things (الموجودات), whatever they may be. The cause of the multiplicity (كثرتها) of existing things is the Fixed Entities (أعيان الممكنات). They are also the cause of the variation in the forms of existing things. Therefore, the ruling of number is prior to the ruling of every ruler.\n\n### [The minimum plural in the numbers of the odd (الوتر) and the even (الشفع)]\n\nWhen I reached the beginning of this chapter in this manuscript concerning number and counted things, I slept. I saw the Messenger of Allah (peace and blessings be upon him) in my dream, and I was before him. A questioner asked me, while he (PBUH) listened, \"What is the minimum plural in number?\" I replied to him, \"According to the jurists (الفقهاء), it is two, and according to the grammarians (النحويين), it is three.\" The Prophet (PBUH) said, \"These and those have erred.\" I said to him, \"O Messenger of Allah, how should I answer?\" He said to me, \"Number is even (شفع) and odd (وتر). Allah the Exalted says: <<وَالشَّفْعِ وَالْوَتْرِ>> (By the even and the odd). And all is number, so distinguish.\" Then he took out five dirhams with his blessed hand and threw them onto the mat we were sitting on. He threw two dirhams separately and three dirhams separately. He said to me, \"It is necessary for the one questioned on this matter to say to the questioner: 'About which number are you asking? About the number called even or about the number called odd?'\" Then he placed his hand on the two dirhams and said, \"This is the minimum plural in the number of the even.\" Then he placed his hand on the three and said, \"This is the minimum plural in the number of the odd.\" \"Thus should the one questioned on this matter reply. This is how it is with us.\" I awoke and recorded it in this chapter exactly as I saw it when I woke up. Many issues that were between him (PBUH) and me, relating to matters other than this chapter, escaped my memory. I was in the utmost joy and happiness at seeing him (PBUH). Upon waking, I found in my mind the correctness of the prohibition against the *al-batīrā’* (the truncated way of speaking), for he spoke in his own way, and I have never seen a teacher better than him. I then resumed recording this book. So we return and say:\n\n### [The ruling of number is prior to the ruling of every ruler, even if it does not possess a concrete existence (وجود عيني)]\n\nThe ruling of number is prior to the ruling of every ruler. It ruled over the contingent things (الممكنات) with multiplicity—the multiplicity of the contingent things and the variations in their preparedness (استعداداتها) for The Real who manifests within them, despite His Oneness (أحديته). Thus, His multiplicity is the multiplicity of the contingent things. Since the matter is thus, it is impossible for servitude (العبودية) to have an essence (عين). For this reason, in this station (مقام), the abandonment of servitude is declared. From the ruling of number and the strength of its pervasive influence, even though it has no existence, is the saying of Allah the Exalted: <<مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَى مِنْ ذَلِكَ>> (There is no secret counsel of three but that He is their fourth, nor of five but that He is their sixth, nor of less than that)—meaning two. This supports our preceding vision. <<وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا>> (Nor of more, but that He is with them wherever they may be)—referring to the Levels (المراتب) that number requires, upon which the ruling of number is imposed. And the saying of the Prophet (PBUH): \"Indeed, Allah has ninety-nine Names, one hundred minus one.\" This is from the ruling of number.\n\n### [Just as The Real (الحق) is One for every multiplicity (كثرة) and is not of its genus, so too is He the Existence (الوجود) manifest for the manifestations (المظاهر) and is not of their genus]\n\nAnd He said: <<لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ>> (They have certainly disbelieved who say that Allah is the third of three). But He did not declare disbelief upon those who said that He (Exalted is He) is the fourth of three. This is because if He were the third of three or the fourth of four, according to what the people of this language have agreed upon, He would be of the genus of the contingent things (الممكنات). But He (Exalted and Sublime is He) is not of the genus of the contingent things. Therefore, it cannot be said of Him that He is one of them. He is eternally One (واحد) for every multiplicity and every group, yet He does not enter into the genus with them. Thus, He is the fourth of three—He is One. And the fifth of four—He is One, no matter how far the number reaches. That is what is designated by the Name Allah. Although He is the Existence manifest in the forms (صور) that are the manifestations upon which He appears, He is not of their genus. For He is Necessary Existence (واجب الوجود) by His Essence (لذاته), while they [the contingent things] are necessarily non-existent (واجبة العدم) by their essence eternally (أزلا). Thus, they possess the ruling (الحكم) over the one who is clothed by them, just as adornment possesses the ruling over the one who is adorned by it. The relationship of the contingent things to the Manifest One (الظاهر) is the relationship of Knowledge (العلم) and Power (القدرة) to the Knower (العالم) and the Powerful (القادر). There is no existing entity (عين موجودة) that rules over this described one, declaring him Knower and Powerful. For this reason, we say that He is Knower by His Essence and Powerful by His Essence. And thus are the Realities (الحقائق).\n\n### [The Acquired Existence (الوجود المستفاد) and its relation to The Real (الحق) and the contingent things (الممكنات)]\n\nNumber rules by its essence in the counted things, yet it has no existence. The manifestations rule in the forms of the Manifest One and their multiplicity in the essence of the One, yet they have no existence. In Divine Knowledge (العلم الإلهي), there is no issue more obscure than this one. For the contingent things, according to the doctrine of the group, acquired nothing from The Real except Existence (الوجود). No one knows the meaning of their saying, \"They acquired nothing except Existence,\" except for those whose inner sight (بصيرته) Allah has unveiled. The proponents of this absolute statement (الإطلاق) do not know its meaning as the matter truly stands in itself. For there is no existent (موجود) except Allah the Exalted, and the contingent things are in a state of non-existence (العدم). This Acquired Existence (الوجود المستفاد), therefore, must either be an existent thing that is neither Allah nor the Fixed Entities (أعيان الممكنات), or it must be an expression for the Existence of The Real (وجود الحق). If it is an added matter (أمرا زائدا) that is neither The Real nor the essence of the contingent things, then it must necessarily be that this existence is an existent thing, and thus it would be described by itself. That is The Real, because proof has been established that there is no existence eternally except the Existence of The Real. He is Necessary Existence (واجب الوجود) by Himself. Thus, it is confirmed that there is no existent by itself other than Allah. The Fixed Entities accepted the Existence of The Real through their realities (حقائقها), because there is no existence except Him. This is His saying: <<وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ>> (And We did not create the heavens and the earth and what is between them except with The Real). This is Pure Existence (الوجود الصرف). What the realities of the Fixed Entities bestow was applied to it, so limits (الحدود) occurred, measures (المقادير) appeared, the ruling (الحكم) and the decree (القضاء) were executed, and the high, the low, the middle, the differing things, the opposites, and the categories of existing things—their genera, species, individuals, states, and rulings—appeared in a single essence (عين واحدة). The forms (الأشكال) were distinguished within it, and the Names of The Real (أسماء الحق) appeared. They had an effect on what manifested in Existence, out of jealousy (غيرة) that those effects should be ascribed to the Fixed Entities in the Manifest One. If the effects belong to the Divine Names (الأسماء الإلهية), and the Name is the Named, then there is nothing in Existence except Allah. He is the Ruler (الحاكم) and He is the Acceptor (القابل), for He accepts repentance (قابل التوب), thus describing Himself with acceptance. Nevertheless, the clarification of this issue is extremely difficult, for expression (العبارة) falls short of it, and conception (التصور) cannot grasp it due to the speed of its elusiveness and the contradiction of its rulings. It is like His saying: <<وَمَا رَمَيْتَ>> (And you did not throw)—a negation—<<إِذْ رَمَيْتَ>> (when you threw)—an affirmation—<<وَلَكِنَّ اللَّهَ رَمَى>> (but Allah threw). He negated the being of Muhammad (PBUH) and affirmed Himself as the very essence (عين) of Muhammad, giving him the Name of Allah. This is the ruling of this issue; rather, it is the very essence of it for the one who realizes it. This is the meaning of abandoning servitude (ترك العبودية) specifically among the Gnostics of Allah (العلماء بالله).\n\n### [The Servitude of Disposal (عبودية التصريف) and the Servitude of Contingency (عبودية الإمكان)]\n\nAs for those among them who descend from this rank (الطبقة), they say that abandoning servitude inwardly (باطنا) is invalid due to the existence of need (الافتقار), which the created being (المحدث) cannot deny in himself. He must necessarily be humbled by it, and that humility is the very essence of servitude (عين العبودية). This is unless the human being is taken away from his gnosis (معرفته) of himself. As for abandoning it from the perspective of Gnosis, it is that when you regard the servant from the perspective of his disposal (تصرفه), not from the perspective of his contingency (إمكانه), and you apply the name of servitude to him from that perspective, then it is possible in Gnosis to abandon it from the perspective of disposal, but not from the perspective of contingency. This is because the reality of servitude (حقيقة العبودية) is standing by the commands of the Master. And here, no one is commanded except the one from whom the action commanded is validly performed. But the actions (الأفعال) are the creation of Allah; He is the Commander and the Commanded. Where then is the true disposal (التصرف الحقيقي) by which the servant is called a servant standing by the commands of his Master, or one who disputes with Him and is thus described as a runaway slave? The one called a servant remains upon the manifestation of Divine Power (الاقتدار الإلهي), with the action flowing upon his outward and inward being, either in agreement with the command or in opposition to it. If this is as we have mentioned, then there is no servitude of disposal. Thus, the servant exists without ruling (بلا حكم). This station (مقام) is confirmed by all the scholars of spiritual taste (علماء الذوق) among the People of Allah (أهل الله), except for a group among our companions and others who are not of us, who hold the opposite view. They believe that the contingent being has an action (فعل) and that Allah has delegated (فوض) to His servants the ability to perform some contingent actions. He commanded them to perform these actions, saying: <<أَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ وَجَاهِدُوا فِي اللَّهِ>> (Establish the prayer, give the Zakat, complete the Hajj and the Umrah for Allah, and strive in the way of Allah), and similar commands. If they affirm that the servant has an action, then the abandonment of the servitude of disposal is invalid. As for the servitude of contingency (عبودية الإمكان), they are unanimous that it exists and that its abandonment is inconceivable, for that is intrinsic (ذاتي) to the contingent being. Some of our companions observe the abandonment of servitude in the state where The Real strengthens the servant and his limbs, for he is absent from his servitude in that state. Thus, it is an abandonment of state (ترك حال), not an abandonment of reality (ترك حقيقة).",
    "ur": "(باب ایک سو اکتیس: ترکِ عبودیت (بندگی چھوڑنے) کے مقام کے بیان میں)\n\nاگر تم کسی معلول (جس کا کوئی سبب ہو) کی طرف منسوب ہو تو تم اسی کے ہو،\nحالانکہ تم اللہ کے ہو نہ کہ مخلوق کے، پس باز آ جاؤ۔\n\nہم مظاہر (مظاہر) ہیں اور معبود ان کا ظاہر ہے،\nاور کائنات کا مظہر (ظاہر ہونے کی جگہ) عین کائنات ہے، پس غور کرو۔\n\nمجھے بے کار پیدا نہیں کیا گیا، بلکہ اس لیے کہ ہم اس کی سچے دل سے عبادت کریں،\nیہی شریعت اور نظر (باطنی مشاہدے) کا حکم ہے۔\n\nاور میں اس کی عبادت نہیں کرتا مگر اس کی صورت میں،\nپس وہی وہ الٰہ ہے جس کے اندر انسان لپٹا ہوا ہے۔\n\nپس اگر تم نے ہماری صورت کو پہچان لیا تو قضا کیا ہے؟\nاور تصرف، احکام اور قدر (تقدیر) کیا ہیں؟\n\nیہ سب عبرتیں ہیں اگر تم صاحبِ نظر ہو،\nاور وہ شخص ناکام نہیں ہوتا جس میں عبرتیں سرایت کر جائیں۔\n\n### [اعیان ممکنات (حقیقتیں) اپنی اصل پر باقی ہیں اور وہ الحق (ذات حق) کے لیے مظاہر ہیں جو ان میں ظاہر ہوتا ہے]\n\nعبودیت (العبودية) کا ترک صرف اسی شخص کے نزدیک درست ہے جو یہ دیکھتا ہے کہ اعیان ممکنات (أعيان الممكنات) اپنی اصل یعنی عدم پر باقی ہیں، اور یہ الحق (ذات حق) کے لیے مظاہر (مظاہر) ہیں جو ان میں ظاہر ہوتا ہے۔ پس اللہ کے سوا کوئی الوجود (ہستی) نہیں اور ان (ممکنات) کے سوا کوئی اثر نہیں۔ کیونکہ یہ (ممکنات) اپنی ذات کے ذریعے ظاہر ہونے والے (الظاہر) کے الوجود (ہستی) کو وہ چیز عطا کرتی ہیں جس سے ہر ظاہر ہونے والی چیز کی حقیقت میں حدود واقع ہوتی ہیں۔ یہ عدد (العدد) سے سب سے زیادہ مشابہ ہیں، کیونکہ یہ ایک معقول (تصور) ہے جس کا کوئی الوجود (ہستی) نہیں، لیکن اس کا حکم معدودات (گنی جانے والی چیزوں) میں جاری اور ثابت ہے۔ اور معدودات موجودات کی صورتوں کے سوا کچھ نہیں، خواہ وہ کچھ بھی ہوں۔ اور موجودات کی کثرت کا سبب اعیان ممکنات (أعيان الممكنات) ہیں، اور یہی موجودات کی صورتوں کے اختلاف کا سبب بھی ہیں۔ پس عدد (العدد) کا حکم ہر حاکم کے حکم پر مقدم ہے۔\n\n### [عدد (گنتی) میں طاق (وتر) اور جفت (شفع) کے اعداد میں کم از کم جمع]\n\nجب میں اس باب کے شروع میں عدد (العدد) اور معدودات (گنی جانے والی چیزوں) کے ذکر پر پہنچا تو میں سو گیا اور میں نے خواب میں رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کو دیکھا، میں آپ کے سامنے تھا اور ایک سائل نے مجھ سے سوال کیا، اور آپ صَلَّى اللهُ عَليهِ وسَلَّم سن رہے تھے، کہ عدد (گنتی) میں کم از کم جمع کیا ہے؟ میں اسے کہہ رہا تھا کہ فقہاء کے نزدیک دو ہے اور نحویوں کے نزدیک تین ہے۔ تو آپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"ان سب نے غلطی کی ہے۔\" میں نے عرض کیا: \"یا رسول اللہ! تو میں کیا کہوں؟\" آپ نے فرمایا: \"عدد (العدد) شفع (جفت) اور وتر (طاق) ہوتا ہے۔ اللہ تعالیٰ فرماتا ہے: وَالشَّفْعِ وَالْوَتْرِ (قسم ہے جفت کی اور طاق کی)۔ اور سب عدد (گنتی) ہی ہیں۔ پس تمیز کرو۔\" پھر آپ نے اپنے مبارک ہاتھ سے پانچ درہم نکالے اور اس چٹائی پر پھینک دیے جس پر ہم بیٹھے تھے، آپ نے دو درہم ایک طرف پھینکے اور تین درہم دوسری طرف پھینکے، اور فرمایا: \"جس سے یہ مسئلہ پوچھا جائے اسے چاہیے کہ سائل سے پوچھے کہ تم کس عدد کے بارے میں پوچھ رہے ہو؟ اس عدد کے بارے میں جسے شفع (جفت) کہا جاتا ہے یا اس عدد کے بارے میں جسے وتر (طاق) کہا جاتا ہے؟\" پھر آپ نے اپنا ہاتھ دو درہموں پر رکھا اور فرمایا: \"یہ عدد شفع (جفت) میں کم از کم جمع ہے۔\" پھر آپ نے اپنا ہاتھ تین درہموں پر رکھا اور فرمایا: \"یہ عدد وتر (طاق) میں کم از کم جمع ہے۔\" جو شخص بھی اس مسئلے کے بارے میں پوچھا جائے اسے اسی طرح جواب دینا چاہیے، ہمارے نزدیک یہی ہے۔ میں بیدار ہوا تو میں نے اسے اسی باب میں درج کر لیا جیسا کہ میں نے بیدار ہوتے ہی دیکھا تھا۔ اور بہت سے مسائل جو میرے اور آپ صَلَّى اللهُ عَليهِ وسَلَّم کے درمیان ہوئے تھے اور جو اس باب سے متعلق نہیں تھے، میرے ذہن سے نکل گئے۔ میں آپ صَلَّى اللهُ عَليهِ وسَلَّم کے دیدار پر انتہائی مسرت اور خوشی کی حالت میں تھا۔ بیدار ہونے پر میرے دل میں \"بتیرۃ\" (ادھورے کلام) سے منع کرنے کی صحت کا احساس ہوا، کیونکہ آپ نے اپنے طریقے سے کلام فرمایا۔ میں نے آپ سے بہتر کوئی معلم نہیں دیکھا۔ اور میں نے اس کتاب کو درج کرنا شروع کر دیا، پس ہم واپس آتے ہیں اور کہتے ہیں:\n\n### [عدد (گنتی) کا حکم ہر حاکم کے حکم پر مقدم ہے، اگرچہ اس کا کوئی عینی الوجود (ہستی) قائم نہ ہو]\n\nپس عدد (العدد) کا حکم ہر حاکم کے حکم پر مقدم ہے۔ اس نے ممکنات (الممكنات) پر کثرت کا حکم لگایا، یعنی ممکنات کی کثرت اور ان کے استعدادات کا اختلاف، اس الحق (ذات حق) پر جو اپنی احدیت کے باوجود ان میں ظاہر ہوتا ہے۔ پس اس کی کثرت ممکنات کی کثرت ہے۔ اور جب معاملہ ایسا ہے تو عبودیت (العبودية) کا کوئی عین (حقیقت) ہونا ممکن نہیں، اسی لیے اس مقام کو ترکِ عبودیت (بندگی چھوڑنے) کا مقام کہا جاتا ہے۔ اور عدد (العدد) کے حکم اور اس کے نفوذ کی قوت کی دلیل، اگرچہ اس کا کوئی الوجود (ہستی) نہیں، اللہ تعالیٰ کا یہ قول ہے: مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَى مِنْ ذَلِكَ (جب تین سرگوشی کرتے ہیں تو وہ چوتھا ہوتا ہے، اور نہ پانچ مگر وہ چھٹا ہوتا ہے، اور نہ اس سے کم) یعنی دو، اور یہ ہماری سابقہ رؤیا کی تائید کرتا ہے، وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا (اور نہ اس سے زیادہ مگر وہ ان کے ساتھ ہوتا ہے جہاں کہیں بھی وہ ہوں) ان مراتب میں جن کا تقاضا عدد (العدد) کرتا ہے، پس ان پر عدد کا حکم لاگو ہوتا ہے۔ اور آپ صَلَّى اللهُ عَليهِ وسَلَّم کا یہ فرمان: \"اللہ کے ننانوے نام ہیں، سو میں سے ایک کم۔\" یہ عدد (العدد) کے حکم میں سے ہے۔\n\n### [جیسے الحق (ذات حق) ہر کثرت کے لیے واحد ہے اور اس کی جنس سے نہیں، اسی طرح وہ مظاہر (ظہور کی جگہوں) کے لیے ظاہر ہونے والا الوجود (ہستی) ہے اور ان کی جنس سے نہیں]\n\nاور اللہ تعالیٰ نے فرمایا: لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ (یقیناً کافر ہو گئے وہ لوگ جنہوں نے کہا کہ اللہ تین میں سے تیسرا ہے)۔ اور اس شخص نے کفر نہیں کیا جس نے کہا کہ وہ سبحانہ و تعالیٰ تین کا چوتھا ہے۔ اس کی وجہ یہ ہے کہ اگر وہ تین میں سے تیسرا ہوتا یا چار میں سے چوتھا ہوتا، جیسا کہ اس زبان (عربی) کے بولنے والوں نے طے کیا ہے، تو وہ ممکنات (الممكنات) کی جنس سے ہوتا۔ حالانکہ وہ سبحانہ و تعالیٰ ممکنات کی جنس سے نہیں ہے۔ لہٰذا اس کے بارے میں یہ نہیں کہا جا سکتا کہ وہ ان میں سے ایک ہے۔ وہ ہمیشہ ہر کثرت اور جماعت کے لیے واحد ہے، اور ان کے ساتھ جنس میں داخل نہیں ہوتا۔ پس وہ تین کا چوتھا ہے، یعنی وہ واحد ہے، اور چار کا پانچواں ہے، یعنی وہ واحد ہے، خواہ وہ کتنی ہی تعداد تک پہنچ جائے۔ پس یہی اللہ کا مسمیٰ ہے۔ اگرچہ وہ ان صورتوں کے ذریعے ظاہر ہونے والا الوجود (ہستی) ہے جو مظاہر (المظاهر) ہیں، لیکن وہ ان کی جنس سے نہیں ہے۔ کیونکہ وہ اپنی ذات کے لیے واجب الوجود (ہستی) ہے، جبکہ وہ (ممکنات) ازل سے اپنی ذات کے لیے واجب العدم ہیں۔ پس ان کا حکم اس پر جاری ہوتا ہے جو ان سے متصف ہو، جیسا کہ زینت کا حکم اس پر جاری ہوتا ہے جو اس سے مزین ہو۔ پس ممکنات (الممكنات) کی نسبت ظاہر ہونے والے (الظاہر) سے وہی ہے جو علم اور قدرت کی نسبت عالم (جاننے والے) اور قادر (طاقت رکھنے والے) سے ہے۔ اور وہاں کوئی عینی موجود (ہستی) نہیں جو اس موصوف پر حکم لگائے کہ وہ عالم ہے اور قادر ہے۔ اسی لیے ہم کہتے ہیں کہ وہ اپنی ذات کے لیے عالم ہے اور اپنی ذات کے لیے قادر ہے۔ اور حقائق (الحقائق) بھی اسی طرح ہیں۔\n\n### [الوجود المستفاد (حاصل شدہ ہستی) اور اس کی نسبت الحق (ذات حق) اور ممکنات (الممكنات) کی طرف]\n\nپس عدد (العدد) معدودات (گنی جانے والی چیزوں) میں اپنی ذات کے لیے حاکم ہے، حالانکہ اس کا کوئی الوجود (ہستی) نہیں ہے۔ اور مظاہر (المظاهر) واحد کی حقیقت میں ظاہر ہونے والے (الظاہر) کی صورتوں اور ان کی کثرت میں حاکم ہیں، حالانکہ ان کا کوئی الوجود (ہستی) نہیں ہے۔ اور ہمارے نزدیک علم الٰہی میں اس مسئلے سے زیادہ کوئی گہرا مسئلہ نہیں ہے۔ کیونکہ ممکنات (الممكنات)، جماعت کے مذہب کے مطابق، الحق (ذات حق) سے صرف الوجود (ہستی) ہی حاصل کرتی ہیں۔ اور کوئی نہیں جانتا کہ ان کے اس قول کا کیا مطلب ہے کہ \"انہوں نے صرف الوجود (ہستی) حاصل کیا\" مگر وہ جس کی بصیرت سے اللہ نے پردہ ہٹا دیا ہو۔ اور اس اطلاق کے حامل لوگ اس کے معنی کو نہیں جانتے جیسا کہ وہ حقیقت میں ہے۔ کیونکہ اللہ تعالیٰ کے سوا کوئی موجود نہیں ہے، اور ممکنات عدم کی حالت میں ہیں۔ پس یہ الوجود المستفاد (حاصل شدہ ہستی) یا تو کوئی موجود ہے جو نہ اللہ ہے اور نہ اعیان ممکنات (أعيان الممكنات)، یا پھر یہ الحق (ذات حق) کے الوجود (ہستی) کا ایک اظہار ہے۔ اگر یہ کوئی زائد امر ہے جو نہ الحق (ذات حق) ہے اور نہ عین ممکنات (أعيان الممكنات)، تو یہ الوجود (ہستی) موجود ہونے سے خالی نہیں ہو گا، اور اس طرح وہ خود سے موصوف ہو گا، اور یہی الحق (ذات حق) ہے، کیونکہ دلیل قائم ہو چکی ہے کہ ازل سے الحق (ذات حق) کے الوجود (ہستی) کے سوا کوئی الوجود (ہستی) نہیں ہے۔ پس وہ اپنی ذات کے لیے واجب الوجود (ہستی) ہے۔ لہٰذا یہ ثابت ہوا کہ اللہ کے سوا کوئی موجود لنفسہ (اپنی ذات کے لیے موجود) نہیں ہے۔ پس اعیان ممکنات (أعيان الممكنات) نے اپنی حقائق کے ساتھ الحق (ذات حق) کے الوجود (ہستی) کو قبول کیا، کیونکہ اس کے سوا کوئی الوجود (ہستی) نہیں ہے۔ اور یہی اس کا قول ہے: وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ (اور ہم نے آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے، حق کے سوا پیدا نہیں کیا)۔ اور وہ الحق (ذات حق) الوجود الصرف (خالص ہستی) ہے۔ پس اس پر وہ چیزیں لاگو ہوئیں جو اعیان (حقیقتوں) کی حقائق عطا کرتی ہیں، تو حدود پیدا ہوئیں، اور مقادیر ظاہر ہوئیں، اور حکم اور قضا (قضاء) نافذ ہوئے، اور بلندی، پستی، درمیانی حالت، مختلف چیزیں، اور متقابل چیزیں، اور موجودات کی اقسام، ان کی اجناس، انواع، اشخاص، احوال اور احکام ایک ہی حقیقت میں ظاہر ہوئے، پس ان میں شکلیں ممتاز ہوئیں اور الحق (ذات حق) کے اسماء ظاہر ہوئے، اور ان کا اثر اس چیز میں ہوا جو الوجود (ہستی) میں ظاہر ہوا، اس غیرت کی وجہ سے کہ وہ آثار ظاہری طور پر اعیان ممکنات (أعيان الممكنات) کی طرف منسوب ہوں جو ان میں ظاہر ہوتی ہیں۔ اور جب آثار اسماء الٰہیہ کے لیے ہیں اور اسم ہی مسمیٰ ہے، تو الوجود (ہستی) میں اللہ کے سوا کوئی نہیں ہے۔ پس وہی حاکم ہے اور وہی قبول کرنے والا ہے، کیونکہ وہ توبہ قبول کرنے والا ہے، پس اس نے خود کو قبولیت سے متصف کیا۔ اس کے باوجود، اس مسئلے کی وضاحت کرنا بہت مشکل ہے، کیونکہ عبارت اس سے قاصر ہے اور تصور اسے ضبط نہیں کر سکتا، اس کے تیزی سے نکل جانے اور اس کے احکام کے تضاد کی وجہ سے۔ کیونکہ یہ اس کے قول کی طرح ہے: وَمَا رَمَيْتَ (اور جب تم نے پھینکا تو تم نے نہیں پھینکا) پس اس نے نفی کی، إِذْ رَمَيْتَ (جب تم نے پھینکا) پس اس نے اثبات کیا، وَلَكِنَّ اللَّهَ رَمَى (لیکن اللہ نے پھینکا) پس اس نے محمد (صلی اللہ علیہ وسلم) کے ہونے کی نفی کی اور اپنی ذات کو عین محمد (صلی اللہ علیہ وسلم) ثابت کیا اور ان کے لیے اللہ کا نام قرار دیا۔ پس یہ اس مسئلے کا حکم ہے، بلکہ یہ اس کی عین حقیقت ہے اس شخص کے لیے جو تحقیق کرے۔ پس یہ اللہ کے علماء کے خاص لوگوں میں ترکِ عبودیت (بندگی چھوڑنے) کا معنی ہے۔\n\n### [عبودیت التصریف (تصرف کی بندگی) اور عبودیت الإمکان (امکان کی بندگی)]\n\nاور جو لوگ اس طبقے سے نیچے ہیں، وہ کہتے ہیں کہ باطنی طور پر اس (عبودیت) کا ترک درست نہیں ہے، کیونکہ افتقار (محتاجی) موجود ہے جسے کوئی بھی نیا پیدا ہونے والا شخص اپنی ذات سے انکار نہیں کر سکتا۔ لہٰذا ضروری ہے کہ وہ اسے ذلیل کرے، اور یہ ذلت ہی عین عبودیت (العبودية) ہے۔ مگر یہ کہ انسان کو اپنی ذات کی معرفت (المعرفۃ) سے لے لیا جائے۔ اور معرفت (المعرفۃ) کے باب سے اس کا ترک یہ ہے کہ جب تم بندے کو اس کے تصرف کے لحاظ سے دیکھو، نہ کہ اس لحاظ سے کہ وہ ممکن (ممکن) ہے، اور اس باب سے اس پر عبودیت (العبودة) کا نام لاگو کرو، تو معرفت (المعرفۃ) میں تصرف کے باب سے اس کا ترک ممکن ہے، نہ کہ امکان (الإمكان) کے باب سے۔ اس کی وجہ یہ ہے کہ عبودیت (العبودية) کی حقیقت آقا کے احکام پر رک جانا ہے۔ اور یہاں کوئی مامور (حکم دیا گیا) نہیں ہے مگر وہ جس سے حکم کردہ فعل کا صادر ہونا درست ہو۔ اور افعال اللہ کی تخلیق ہیں، پس وہی آمر (حکم دینے والا) ہے اور وہی مامور (جسے حکم دیا گیا) ہے۔ پس وہ حقیقی تصرف کہاں ہے جس کی وجہ سے بندے کو اپنے آقا کے احکام پر قائم رہنے والا بندہ کہا جائے، یا اس سے جھگڑنے والا کہا جائے جس سے وہ بھاگ جانے (اباق) سے متصف ہو؟ پس بندہ کا مسمیٰ الٰہی اقتدار کے ظہور پر باقی رہا، فعل کے اس کے ظاہر اور باطن پر جاری ہونے کے ذریعے، خواہ وہ حکم کی موافقت سے ہو یا اس کی مخالفت سے۔ اور جب معاملہ ایسا ہے جیسا کہ ہم نے ذکر کیا، تو عبودیت تصریف (تصرف کی بندگی) نہیں ہے۔ یعنی بندہ بغیر کسی حکم کے موجود ہے۔ اور یہ مقام اہل اللہ میں سے ذوق (چکھنے) کے تمام علماء کے نزدیک تحقیقی ہے، سوائے ہمارے اصحاب اور دوسروں کے ایک گروہ کے جو ہم میں سے نہیں ہیں، جو اس کے خلاف رائے رکھتے ہیں۔ وہ دیکھتے ہیں کہ ممکن (الممكن) کے لیے فعل ہے اور اللہ نے اپنے بندوں کو بعض ممکن افعال کرنے کا اختیار دیا ہے، پس اس نے انہیں ان افعال کے کرنے کا مکلف بنایا، چنانچہ فرمایا: أَقِيمُوا الصَّلَاةَ (نماز قائم کرو)، وَآتُوا الزَّكَاةَ (اور زکوٰۃ ادا کرو)، وَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ (اور اللہ کے لیے حج اور عمرہ پورا کرو)، وَجَاهِدُوا فِي اللَّهِ (اور اللہ کی راہ میں جہاد کرو) اور اس طرح کی مثالیں۔ پس جب انہوں نے یہ ثابت کر دیا کہ بندے کے لیے فعل ہے، تو عبودیت التصریف (تصرف کی بندگی) کا ترک درست نہیں ہوا۔ البتہ عبودیت الإمکان (امکان کی بندگی) پر سب کا اجماع ہے کہ وہ موجود ہے اور اس کا ترک تصور بھی نہیں کیا جا سکتا، کیونکہ یہ ممکن (الممكن) کے لیے ذاتی ہے۔ اور ہمارے بعض اصحاب ترکِ عبودیت (بندگی چھوڑنے) میں اس بات کو ملحوظ رکھتے ہیں کہ الحق (ذات حق) نے بندے کو اور اس کے اعضاء کو قوت دی ہے، پس وہ اس حالت میں اپنی عبودیت (بندگی) سے غائب ہو جاتا ہے۔ پس یہ حال کا ترک ہے، حقیقت کا ترک نہیں۔ (ایک سوواں حصہ مکمل ہوا)",
    "fa": "باب صد و سی و یکم در مقام ترک عبودیت (ترك العبودية)\n\nاگر خود را به معلولی نسبت دهی، تو از آنِ اویی؛\nحال آنکه تو از آنِ خدایی نه از آنِ خلق، پس بازایستید.\n\nما مظاهر هستیم و معبود، ظاهرِ ماست؛\nو مظهرِ هستی (الکون)، عینِ هستی (الکون) است، پس عبرت گیرید.\n\nمن بیهوده نیامده‌ام، بلکه آمده‌ام تا او را به حق عبادت کنم؛\nحکم تشریع و نظر (عرفانی) بر این است.\n\nو او را عبادت نمی‌کنم مگر به صورتش؛\nپس او همان خدایی است که بشر در باطن اوست.\n\nپس اگر صورت ما را محقق سازی، قضا چیست؟\nو تصرف و احکام و قدر چیست؟\n\nهمه اینها عبرت‌ها هستند اگر صاحب نظر باشی؛\nو کسی که عبرت‌ها او را به حرکت درآورند، ناامید نمی‌شود.\n\n### [اعیان ممکنات بر اصل خود باقی هستند و آنها مظاهر (تجلیات) حق (الحق) ظاهر در آنها می‌باشند]\n\nترک عبودیت (ترك العبودية) تنها نزد کسی صحیح است که عین ممکنات را بر اصل خود یعنی عدم باقی می‌بیند و آنها را مظاهر (مظاهر) حق (الحق) می‌داند که در آنها ظاهر شده است. پس وجودی جز برای خدا نیست و اثری جز برای آنها (اعیان) نیست. زیرا آنها به ذات خود، وجودِ ظاهر را کسب می‌کنند، به گونه‌ای که حدود در عین هر ظاهری واقع می‌شود. این اعیان شبیه‌ترین چیز به عدد هستند؛ زیرا عدد مفهومی معقول است که وجود عینی ندارد، اما حکم آن جاری و ثابت در معدودات است. و معدودات چیزی جز صور موجودات نیستند، هر چه که باشند. و سبب کثرت موجودات، اعیان ممکنات هستند، و آنها همچنین سبب اختلاف صور موجودات می‌باشند. پس حکم عدد بر حکم هر حاکمی مقدم است.\n\n### [کمترین جمع در اعداد فرد (وتر) و زوج (شفع)]\n\nهنگامی که در ابتدای این باب از این نسخه به عدد و معدودات رسیدم، خوابیدم و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را در خواب دیدم. من در مقابل ایشان بودم و سائلی از من می‌پرسید و ایشان می‌شنیدند: کمترین جمع در عدد چیست؟ من به او می‌گفتم: نزد فقها دو است و نزد نحویان سه. پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمودند: اینها و آنها خطا کرده‌اند. عرض کردم: ای رسول خدا، پس چگونه بگویم؟ ایشان به من فرمودند: عدد زوج (شفع) و فرد (وتر) است. خداوند متعال می‌فرماید: **«وَالشَّفْعِ وَالْوَتْرِ»** (و قسم به زوج و فرد). و همه عدد هستند، پس تمایز قائل شو. سپس پنج درهم را با دست مبارک خود بیرون آوردند و آنها را بر حصیری که بر آن بودیم انداختند. دو درهم را جدا و سه درهم را جدا انداختند و به من فرمودند: شایسته است کسی که در این مسئله از او سؤال می‌شود، به سائل بگوید: از کدام عدد می‌پرسی؟ از عددی که زوج (شفع) نامیده می‌شود یا از عددی که فرد (وتر) نامیده می‌شود؟ سپس دست خود را بر روی آن دو درهم گذاشتند و فرمودند: این کمترین جمع در عدد زوج (شفع) است. سپس دست خود را بر روی سه درهم گذاشتند و فرمودند: این کمترین جمع در عدد فرد (وتر) است. کسی که در این مسئله از او سؤال می‌شود باید این‌گونه پاسخ دهد. نزد ما این‌گونه است. بیدار شدم و آن را در این باب همان‌گونه که دیدم، ثبت کردم. بسیاری از مسائل که بین من و ایشان (صَلَّى اللهُ عَليهِ وسَلَّم) در ارتباط با غیر این باب بود، از یادم رفت. من در نهایت سرور و شادی از دیدن ایشان (صَلَّى اللهُ عَليهِ وسَلَّم) بودم. هنگام بیدار شدن، صحت نهی از «بتیراء» (سخن ناقص) را در خاطر یافتم، زیرا ایشان در روش خود کامل سخن گفتند و من معلمی بهتر از او ندیدم. سپس شروع به ثبت این کتاب کردم. پس باز می‌گردیم و می‌گوییم:\n\n### [حکم عدد بر حکم هر حاکمی مقدم است، اگرچه وجود عینی قائمی نداشته باشد]\n\nپس حکم عدد بر حکم هر حاکمی مقدم است. عدد بر ممکنات حکم به کثرت داده است؛ کثرت ممکنات و اختلافات استعدادهای آنها بر حق (الحق) که در آنها ظاهر شده، با وجود احدیت او. پس کثرت او همان کثرت ممکنات است. و چون امر چنین است، ممکن نیست که عبودیت (العبودية) عین داشته باشد. به همین دلیل در این مقام، سخن از ترک عبودیت (ترك العبودية) به میان می‌آید. و از حکم عدد و قدرت جریان آن، با وجود اینکه وجودی ندارد، این سخن خداوند متعال است: **«مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَى مِنْ ذَلِكَ»** (هیچ رازگویی سه نفری نیست مگر اینکه او چهارمی آنهاست، و نه پنج نفری مگر اینکه او ششمی آنهاست، و نه کمتر از آن) یعنی دو نفر. و این رؤیای پیشین ما را تأیید می‌کند. **«وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا»** (و نه بیشتر از آن مگر اینکه او با آنهاست هر کجا که باشند) از مراتبی که عدد طلب می‌کند و حکم عدد بر آنها جاری می‌شود. و همچنین سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): «همانا خداوند نود و نه اسم دارد، صد منهای یک». این از حکم عدد است.\n\n### [همان‌گونه که حق (الحق) برای هر کثرتی واحد است و از جنس آن نیست، وجود ظاهر برای مظاهر نیز چنین است و از جنس آنها نیست]\n\nو خداوند فرمود: **«لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ»** (به تحقیق کافر شدند کسانی که گفتند خداوند سومینِ سه تاست). اما کسی که بگوید او سبحانه چهارمینِ سه تاست، کافر نشده است. زیرا اگر او سومینِ سه تا یا چهارمینِ چهار تا بود، بر اساس آنچه اهل این زبان بر آن توافق دارند، از جنس ممکنات می‌شد. در حالی که او سبحانه و تعالی از جنس ممکنات نیست. پس گفته نمی‌شود که او یکی از آنهاست. او همواره برای هر کثرت و جماعتی واحد است و در جنس با آنها وارد نمی‌شود. پس او چهارمینِ سه تاست، یعنی واحد است؛ و پنجمینِ چهار تاست، یعنی واحد است، هر چقدر هم که بالا رود. این همان مسمای الله است. پس او اگرچه وجود ظاهر (الوجود الظاهر) به صورت‌هایی است که مظاهر بر آن هستند، اما از جنس آنها نیست. زیرا او واجب الوجود لذاته است، در حالی که آنها ازلاً واجب العدم لذات خود هستند. پس حکم برای آنهاست در کسی که به آنها متلبس شود، همان‌گونه که حکم زینت در کسی است که به آن زینت یابد. نسبت ممکنات به ظاهر، نسبت علم و قدرت به عالم و قادر است. و در آنجا عین موجودی نیست که بر این موصوف حکم کند که او عالم و قادر است. به همین دلیل می‌گوییم او عالم لذاته و قادر لذاته است. حقایق (الحقائق) نیز این‌گونه هستند.\n\n### [وجود مستفاد (الوجود المستفاد) و نسبت آن به حق (الحق) و ممکنات]\n\nپس عدد به ذات خود در معدودات حاکم است و وجودی ندارد. و مظاهر در صور ظاهر و کثرت آنها در عین واحد حاکم هستند و وجودی ندارند. در علم الهی، مسئله‌ای مبهم‌تر از این مسئله نزد ما نیست. زیرا ممکنات، بنا بر مذهب جماعت، از حق (الحق) جز وجود (الوجود) را کسب نکرده‌اند. و هیچ‌کس نمی‌داند معنای سخن آنها که «جز وجود را کسب نکرده‌اند» چیست، مگر کسی که خداوند بصیرتش را گشوده باشد. و صاحبان این اطلاق، معنای آن را بر آنچه در نفس امر است، نمی‌دانند. زیرا موجودی جز خداوند متعال نیست و ممکنات در حال عدم هستند. پس این وجود مستفاد (الوجود المستفاد) یا باید موجودی باشد که نه خداست و نه اعیان ممکنات، و یا باید عبارتی از وجود حق (الحق) باشد. اگر امری زائد باشد که نه حق (الحق) است و نه عین ممکنات، پس خالی از این نیست که این وجود، موجود باشد، در این صورت به ذات خود موصوف است و آن همان حق (الحق) است. زیرا دلیل قائم شده است که ازلاً وجودی جز وجود حق (الحق) نیست. پس او واجب الوجود لنفسه است. بنابراین ثابت شد که موجودی لنفسه غیر از خدا نیست. پس اعیان ممکنات با حقایق (حقائق) خود، وجود حق (الحق) را پذیرفتند، زیرا وجودی جز او نیست. و این همان سخن اوست: **«وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ»** (و ما آسمان‌ها و زمین و آنچه میان آنهاست را جز به حق (الحق) نیافریدیم). و حق (الحق) همان وجود صرف است. پس آنچه حقایق اعیان اقتضا می‌کنند، بر آن جاری شد. در نتیجه حدود پدید آمد، مقادیر ظاهر شد، حکم و قضا نافذ گشت، و علو و سفل و وسط و مختلفات و متقابلات و اصناف موجودات، اعم از اجناس و انواع و اشخاص و احوال و احکام آنها، در عین واحده ظاهر شدند. پس اشکال در آنها متمایز گشت و اسماء حق (الحق) ظاهر شد و این اسماء در آنچه در وجود (الوجود) ظاهر شد، اثر گذاشتند، از روی غیرت (الهی) که مبادا آن آثار به اعیان ممکنات که حق (الحق) در آنها ظاهر شده است، نسبت داده شود. و چون آثار از آنِ اسماء الهی است و اسم همان مسمی است، پس در وجود (الوجود) جز خدا نیست. او حاکم است و او پذیرنده است، زیرا او توبه‌پذیر است و خود را به قبول وصف کرده است. با این حال، تحریر این مسئله بسیار دشوار است، زیرا عبارت از بیان آن قاصر است و تصور آن را ضبط نمی‌کند، به دلیل سرعت گریز آن و تناقض احکامش. این مسئله مانند سخن اوست: **«وَمَا رَمَيْتَ»** (و تو پرتاب نکردی) که نفی کرد، **«إِذْ رَمَيْتَ»** (هنگامی که پرتاب کردی) که اثبات کرد، **«وَلَكِنَّ اللَّهَ رَمَى»** (بلکه خدا پرتاب کرد). پس نفیِ بودنِ محمد را کرد و عین محمد را اثبات کرد و نام خدا را بر او نهاد. این حکم این مسئله است، بلکه عین آن است برای کسی که به تحقیق رسیده باشد. این معنای ترک عبودیت (ترك العبودية) در خصوص علمای بالله است.\n\n### [عبودیت تصرف و عبودیت امکان]\n\nاما کسانی از ایشان که از این طبقه پایین‌تر هستند، می‌گویند: ترک عبودیت (العبودية) در باطن صحیح نیست، به دلیل وجود افتقاری که مُحدَث (مخلوق) از خود انکار نمی‌کند. پس ناگزیر است که او را خوار سازد، و آن خواری عین عبودیت (العبودية) است، مگر اینکه انسان از معرفت (المعرفة) خود به نفسش گرفته شود. اما ترک عبودیت (العبودية) از باب معرفت (المعرفة) این است که بنده را از حیث تصرفش بنگری، نه از حیث اینکه ممکن است، و از آن باب نام عبودیت (العبودية) را بر او اطلاق کنی. در این صورت، ترک عبودیت (العبودية) از باب تصرف، نه از باب امکان، در معرفت (المعرفة) ممکن است. زیرا حقیقت عبودیت (العبودية)، ایستادن در برابر اوامر مولاست. و در اینجا مأموری نیست مگر کسی که انجام دادن آنچه به آن امر شده، از او صحیح باشد. و افعال، خلق خدا هستند. پس او هم امرکننده است و هم مأمور. پس تصرف حقیقی کجاست که به واسطه آن، بنده، بنده‌ای نامیده شود که به اوامر مولای خود عمل می‌کند یا با او نزاع می‌کند و به صفت فرار (آباق) متصف می‌شود؟ پس بنده نامیده شده، بر ظهور اقتدار الهی باقی می‌ماند، به واسطه جاری شدن فعل بر ظاهر و باطن او، خواه با موافقت امر باشد یا با مخالفت آن. و اگر این امر همان‌گونه باشد که ذکر کردیم، پس عبودیت تصرفی (عبودية التصريف) وجود ندارد. یعنی بنده موجود است اما بدون حکم. و این مقام تحقیق نزد همه علمای ذوق از اهل الله است، مگر گروهی از اصحاب ما و دیگرانی که از ما نیستند و خلاف آن را می‌بینند و معتقدند که ممکن، فعلی دارد و خداوند به بندگان خود تفویض کرده است که برخی از افعال ممکن را انجام دهند. پس آنها را به انجام آن مکلف کرده و فرموده است: **«أَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ وَجَاهِدُوا فِي اللَّهِ»** (نماز را برپا دارید و زکات را بپردازید و حج و عمره را برای خدا به پایان رسانید و در راه خدا جهاد کنید) و امثال اینها. پس اگر برای بنده فعلی اثبات کنند، ترک عبودیت تصرف (عبودية التصريف) صحیح نیست. اما در مورد عبودیت امکان (عبودية الإمكان)، همگی بر وجود آن اجماع دارند و اینکه تصور ترک آن نمی‌رود، زیرا آن برای ممکن ذاتی است. و برخی از اصحاب ما در ترک عبودیت (العبودية) به این نکته توجه می‌کنند که حق (الحق)، بنده و جوارح او را تقویت کرده است. در این حال، بنده از عبودیت خود غایب می‌شود. پس این ترکِ حال است نه ترکِ حقیقت. پایان جزء صدم."
  },
  "page_count": 2
}