{
  "id": 343,
  "title": {
    "ar": "الباب الثالث والأربعون وثلاثمائة في معرفة منزل سرين في تفصيل الوحي من حضرة حمد الملك كله",
    "en": "Chapter 343: Concerning the Gnosis of the Station of Sirrīn [منزل سرين] in the Detailed Elaboration of Revelation [تفصيل الوحي] from the Divine Presence of the Total Praise of the King [حضرة حمد الملك كله].",
    "ur": "باب تین سو تینتالیس: دو رازوں (سرین) کی منزل کی معرفت میں، کُل ملکیت کی حمد کی حضرت سے وحی کی تفصیل کے بیان میں۔",
    "fa": "باب سیصد و چهل و سوم در معرفت منزل سرّین (سرّین) در تفصیل وحی از حضرت حمد که ملک کل است"
  },
  "content": {
    "ar": "## «الباب الثالث والأربعون وثلاثمائة في معرفة منزل سرين في تفصيل الوحي من حضرة حمد الملك كله»\n\n\n> لقد فصل الله آياته *** لكل لبيب بعيد المدى‏\n\n\n> وأحكمها لقلوب زكت *** ولم تتبع غير سبل الهدى‏\n\n\n> ونطق من لم يزل ناطقا *** لأسماعنا ناشدا منشدا\n\n\n> فحير ألبابنا نطقه *** وجاء بنور الهدى فاهتدى‏\n\n\n> بصير بأنواره ظاهر *** له المنتهى وله المبتدي‏\n\n\n### [إن المدبر والمفصل من الأسماء الإلهية]\n\n\nاعلم أيدك الله أن الاسمين الإلهيين المدبر والمفصل هما رأسا هذا المنزل اللذان يهبان للداخل فيه جميع ما يحمله وما يتضمنه من العلوم الإلهية مما يطلب الأكوان ومما يتعلق بالله وحكم المدبر في الأمور أحكامها في حضرة الجمع والشهود وإعطاؤها ما تستحقه وهذا كله قبل وجودها في أعيانها وهي موجودة له فإذا أحكمها كما ذكرناه أخذها المفصل وهذا الاسم مخصوص بالمراتب فأنزل كل كون وأمر في مرتبته ومنزلته كأمير المجلس عند السلطان ثم إن المدبر لما خلق الله رحمتين وهما أول خلق خلقه الله الرحمة الواحدة بسيطة وخلق الرحمة الأخرى مركبة فرحم بالبسيطة جميع ما خلق الله من البسائط ورحم بالمركبة جميع ما خلق الله من المركبات وجعل للرحمة المركبة ثلاثة منازل لأن المركب ذو طرفين وواسطة والواسطة عين البرزخ الذي بين الطرفين حتى يتميزا فيرحم كل مرحوم من المركب بالرحمة المركبة من هذه المنازل فبالرحمة الأولى المركبة ضم أجزاء الأجسام بعضها إلى بعض حتى ظهرت أعيانها صورا قائمة وبالرحمة الثانية المركبة من المنزل الثاني ركب المعاني والصفات والأخلاق والعلوم في النفس الناطقة والنفس الحيوانية الحاملة للقوى الحسية وبالرحمة الثالثة المركبة ضم النفوس الناطقة إلى تدبير الأجسام فهو تركيب روح وجسم وهذا النوع من التركيب هو الذي يتصف بالموت فأبرز المدبر هذه النفوس من أبدانها بتوجه النفخ الإلهي عليها من الروح المضاف إليه تعالى فركبها المدبر مع الجسم الذي تولدت عنه وهو تركيب اختيار ولو كان تركيب استحقاق ما فارقه بالموت وجعله مدبرا لجسد آخر برزخي والحق هذا بالتراب ثم ينشئ له‏\n\n\nنشأة أخرى يركبه فيها في الآخرة فلما اختلفت المراكب علمنا أن هذا الجسم المعين الذي هو أم لهذه النفس الناطقة المتولدة عنه ما هي مدبرة له بحكم الاستحقاق لانتقال تدبيرها إلى غيره وإنما الجسم الذي تولدت عنه على هذه النفس له من الحق إنها ما دامت مدبرة له لا تحرك جوارحه إلا في طاعة الله تعالى وفي الأماكن والأحوال التي عينها الله على لسان الشارع لها هذا ما يستحقه عليها هذا الجسم لما له عليها من حق الولادة فمن النفوس من هو ابن بار فيسمع لأبويه ويطيع وفي رضاهما رضي الله قال عز وجل أَنِ اشْكُرْ لِي من الوجه الخاص ولِوالِدَيْكَ من الوجه السببي ومن النفوس ما هو ابن عاق فلا يسمع ولا يطيع فالجسم لا يأمر النفس إلا بخير ولهذا يشهد على ابنه يوم القيامة جلود الجسم وجميع جوارحه فإن هذا الابن قهرها وصرفها حيث يهوى وقسم الله هذه الرحمة المركبة على أجزاء معلومة أعطى منها جبريل ستمائة جزء بها يرحم الله أهل الجنة وجعل بيده تسعة عشر جزءا يرحم بهذه الأجزاء أهل النار الذين هم أهلها يدفع بها ملائكة العذاب الذي هم تسعة عشر كما قال تعالى عَلَيْها تِسْعَةَ عَشَرَ وأما المائة رحمة التي خلقها الله فجعل منها في الدنيا رحمة واحدة بها رزق عباده كافرهم ومؤمنهم وعاصيهم ومطيعهم وبها يعطف جميع الحيوان على أولاده وبها يرحم الناس بعضهم بعضا ويتعاطفون كما قال الله ان المؤمنون بَعْضُهُمْ أَوْلِياءُ بَعْضٍ والظَّالِمِينَ بَعْضُهُمْ أَوْلِياءُ بَعْضٍ والمنافقين بعضهم أولياء بعض كل هذا ثمرة هذه الرحمة فإذا كان في الآخرة يوم القيامة ضم هذه الرحمة إلى التسعة والتسعين رحمة المدخرة عنده فرحم بها عباده على التدريج والترتيب الزماني ليظهر بهذا التأخير مراتب الشفعاء وعناية الله بهم وتميزهم على غيرهم فإذا لم يبق في النار إلا أهلها القاطنون بها الذين لا خروج لهم منها وأرادت ملائكة العذاب التسعة عشر عذاب أهل النار تجسد من الرحمة المركبة تسعة عشر ملكا فحالوا بين ملائكة العذاب وأهل النار ووقفوا دونهم وعضدتهم الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فإن ملائكة العذاب قد وسعتهم الرحمة كسائر الأشياء فيمنعهم ما وسعهم منها عن مقاومة هذه‏\nالرحمة المركبة وكان الذي يعضدهم أولا غضب الله الذي ظهر من إغضاب المخالفين فلما انقضى مجلس المحاكمة وكان الحق قد أمر بمن أمر به إلى السجن وهو جهنم كما قال وجَعَلْنا جَهَنَّمَ لِلْكافِرِينَ حَصِيراً أي سجنا لأن المحصور مسجون ممنوع من التصرف بخلاف أهل الجنة فإن لهم التبوأ منها حيث يشاءون وليس كذلك أهل النار وهذا من الرفق الإلهي الخفي بعباده فلو أعطاهم التبوؤ من النار حيث يشاءون لكانوا لا يستقر بهم قرار طلبا للفرار من العذاب إذا أحسوا به رجاء أن يكون لهم في مكان آخر منها راحة وفي وقت العذاب ما فيها راحة فكان لا يبقى في جهنم نوع من العذاب إلا ذاقوه والعذاب المستصحب أهون من العذاب المجدد وكذا النعيم ولهذا يبدل الله جلودهم في النار إذا نضجت لِيَذُوقُوا الْعَذابَ فيمشي عليهم زمان يذوقون فيه العذاب مستصحبا إلى أن تنضج الجلود وحينئذ يتجدد عليهم بالتبديل عذاب جديد فلو كان لهم التبوؤ من جهنم حيث يشاءون لما استقروا حتى تنضج جلودهم بل كانوا يذوقون في كل موضع ينتقلون إليه عذابا جديدا إلى حصول الإنضاج فيكون ذلك الانتقال أشد في عذابهم فرحمهم الله من حيث لا يشعرون كما مكر بهم من حيث لا يشعرون فهذه سبعمائة رحمة وتسع عشرة رحمة مائة منها بيد الله لم يتصرف فيها أحد من خلق الله اختص بها لنفسه بها يرحم الله عباده بارتفاع الوسائط بل منه للمرحوم خاصة وهي على عدد الأسماء الإلهية أسماء الإحصاء التسعة والتسعين اسما رحمة واحدة لكل اسم من هذه المائة التي بيد الله لا علم لمخلوق بها وتمام المائة الرحمة المضافة إليه التي وسعت كل شي‏ء فبهذه المائة رحمة ينظر إلى درج الجنة وهي مائة درجة وبها بعد انقضاء زمان استحقاق العذاب ينظر إلى دركات النار وهي مائة درك كل درك يقابل درجة من الجنة فتتأيد بهذه الرحمة الواسعة التسع عشرة رحمة التي تقاوم ملائكة العذاب في النار وتلك الملائكة قد وسعتهم فيجدون في نفوسهم رحمة بأهل النار لأنهم يرون الله قد تجلى في غير صورة الغضب الذي كان قد حرضهم على الانتقام لله من الأعداء فيشفعون عند الله في حق أهل النار الذين لا يخرجون منها فيكونون لهم بعد ما كانوا عليهم فيقبل الله شفاعتهم فيهم وقد حقت الكلمة الإلهية أنهم عمار تلك الدار فيجعل الحكم فيهم للرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ ولهذه التسعة عشرة رحمة التي هي الرحمة المركبة فأعطاهم في جهنم نعيم المقرور والمحرور لأن نعيم المقرور بوجود النار ونعيم المحرور بوجود الزمهرير فتبقى جهنم على صورتها ذات حرور وزمهرير ويبقى أهلها متنعمين فيها بحرورها وزمهريرها ولهذا أهل جهنم لا يتزاورون إلا أهل كل طبقة في طبقتهم فيتزاور المحرورون بعضهم في بعض ويتزاور المقرورون بعضهم في بعض لا يزور مقرور محرورا ولا محرور مقرورا وأهل الجنة يتزاورون كلهم لأنهم على صفة واحدة في قبول النعيم لأنهم كانوا هنا أعني في دار التكليف أهل توحيد لم يشركوا توحيد علم أو توحيد إيمان وأهل النار لم يكن لهم صفة التوحد وكانوا أهل شرك فلهذا لم يكن لهم صفة أحدية تعمهم في النعيم مطلقا من غير تقييد فهم في جهنم فريقان وأهل الجنة فريق واحد فينفرد كل شريك بطائفة وهؤلاء هم الثنوية ما ثم غيرهم وهم أهل النار الذين هم أهلها وأما أهل التثليث فيرجى لهم التخلص لما في التثليث من الفردية لأن الفرد من نعوت الواحد فهم موحدون توحيد تركيب فيرجى أن تعمهم الرحمة المركبة ولهذا سموا كفارا لأنهم ستروا الثاني بالثالث فصار الثاني بين الواحد والثالث كالبرزخ فربما لحق أهل التثليث بالموحدين في حضرة الفردانية لا في حضرة الوحدانية وهكذا رأيناهم في الكشف المعنوي لم نقدر أن نميز ما بين الموحدين وأهل التثليث إلا بحضرة الفردانية فإني ما رأيت لهم ظلا في الوحدانية ورأيت أعيانهم في الفردية ورأيت أعيان الموحدين في الوحدانية والفردانية فعلمت الفرق بين الطائفتين وأما ما زاد على أهل التثليث فالكل ناجون بحمد الله من جهنم ونعيمهم في الجنة يتبوءون منها حيث يشاءون كما كانوا في الدنيا ينزلون من حضرات الأسماء الإلهية حيث يشاءون بوجه حق مشروع لهم كما كانوا إذا توضئوا يدخلون من أي باب شاءوا من أبواب الجنة الثمانية وإذا علمت هذا\n\n\n### [أن الرحمة الله تعم جميع الموجودات‏]\n\n\nفاعلم أن هذه الرحمة المركبة تعم جميع الموجودات وأنها مركبة من رحمة عامة وهي التي وسعت كل شي‏ء ومن رحمة خاصة وهي الرحمة التي تميز بها من اصطفاه الله واصطنعه لنفسه من رسول ونبي وولي وبهذه الرحمة المركبة جمع الله الكتب وأنزل كل كتاب سورا وآيات فمن آياته ما بقي كالقرآن وكل آية ظهرت بطريق الإعجاز ومن آياته ما لم يبق فبقي‏\nاقتصار حكمها على من جاء بها فدلت على غيره كما دلت عليه فإن الله جعلها علامة على صدق ما ادعاه كل واحد واحد ممن ادعى القرب من الله إما بالحال وإن لم ينطق بالدعوى لما يرى عليه من آثار طاعة ربه وإما بالدعوى من حيث نطقه بذلك ولا يقع ذلك إلا عن غفلة فإنهم مأمورون بستر هذه الآيات أعني الأولياء فهي منسوخة في الأولياء محكمة في الأنبياء والرسل فقال ما نَنْسَخْ من آيَةٍ يقول من علامة أَوْ نُنْسِها يقول أو نتركها يعني نتركها آية للأولياء كما كانت آية للأنبياء نَأْتِ بِخَيْرٍ مِنْها من باب المفاضلة أي بأزيد منها في الدلالة وهي آيات الإعجاز فلا تكون إلا لأصحابها أو لمن قام فيها بالنيابة على صدق أصحابها فلا يكون لولي قط هذه العلامة من حيث صحة مرتبته وأما قوله أَوْ مِثْلِها الضمير يرجع إلى الآية المنسوخة فلم يكن لها صفة الإعجاز بل هي مثل الأولى ولا يصح حمل هذه الآية على أنها آي القرآن التي نزلت في الأحكام فنسخ بآية ما كان أثبت حكمه في آية قبلها فإن الله ما قال في آخر هذه الآية لم تعلم أن الله عليم خبير ولا حكيم ومثل هذه الأسماء هي التي تليق بنظم القرآن الوارد بآيات الأحكام وإنما قال الله تعالى أَ لَمْ تَعْلَمْ أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ فأراد الآيات التي ظهرت على أيدي الأنبياء عليه السلام لصدق دعواهم في أنهم رسل الله فمنها ما تركها آية إلى يوم القيامة كالقرآن ومنها ما رفعها ولم تظهر إلى يوم القيامة فلما جمع الله بهذه الرحمة المركبة القرآن في الكتب لا في الصدور فإنه في الصدور قرآن وفي اللسان كلام وفي المصاحف كتاب وضع ذلك الاسم المفصل عن أمر المدبر فإنه متقدم عليه بالرتبة فلهذا له الحكم في التفصيل بالقوة وللمفصل بالفعل ومنزل الرحمة رحب واسع المجال فيه وكيف لا يتسع وقد وَسِعَتْ كُلَّ شَيْ‏ءٍ وهذا القدر كاف فيما يقع به المنفعة للسامعين من الناس فذكرنا حكمها في الدارين وما يعود منها علينا وهو الغرض المقصود وفي هذا المنزل معرفة منازل الرحمة المركبة وإلى كم تنتهي منازلها والمنزل الذي أكدت فيه والمنزل الذي لم تؤكد فيه وعلى كم من درج وقع التوكيد فيها وفيه علم ما لا يعلم إلا من طريق الخبر الإلهي وعلم الإبانة عن مقام الجمع كالصلاة الجامعة بين الله والعبد في قراءة فاتحة الكتاب ومن هنا يؤخذ الدليل بفرضيتها على المصلي في الصلاة فمن لم يقرأها في الصلاة فما صلى الصلاة التي قسمها الله بينه وبين عبده فإنه ما قال قسمت الفاتحة وإنما قال قسمت الصلاة بالألف واللام اللتين للعهد والتعريف فلما فسر الصلاة المعهودة بالتقسيم جعل محل القسمة قراءة الفاتحة وهذا أقوى دليل يوجد في فرض قراءة الحمد في الصلاة وفيه علم تأثير الرحمة المركبة في العالم المحمدي خاصة وفيه علم تنزيل المعاني منزلة الأشخاص وفيه علم التراجم وفيه علم الطائفة التي سمعت وقيل فيها إنها لم تسمع مع وجود الفهم فيما سمعت فما الذي نفى عنها وما الذي أبقى لها وفيه علم الحجب الكونية المظلمة والظلمانية ومن هو أهل كل حجاب وعمن حجب من حجب هل حجب عن سعادته أو عن مشاهدة ربه أو عن مشاهدة مقام رسوله وفيه علم اجتراء الكون على الله وفيه علم اللطف الإلهي بالمعاندين الرادين لأوامره المنازعين لناصريه وفيه علم ما شيب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم الذي ذكره في سورة هود وأخواتها وفيه علم طلب السر الإلهي وفيه علم الإحاطة بما لا يتناهى وفيه علم الجزاء الذي هو على غير الوفاق الزماني فإن مدد الأعمال التي تطلب الأجور متناهية والأجر عليها غير متناه فما هو الجزاء الوفاق من غير الوفاق وفيه علم الإنكار والإقرار والتقرير والتوبيخ وما صفته وأين محله وفيه علم الخلق الجسمي والجسماني ومراتب الخلق وكم له من المقدار الزماني وفيه علم المراتب المضاف إليها الرب وفيه علم القصد الإلهي وفيه علم موضع الأجوبة التي تكون بحكم المطابقة عند سؤال السائل وفيه علم مرتبة العاقل وشرفه على العالم إذا كان عالما فإن العاقل إذا رأى ما لا بد له منه بادر إليه وغير العاقل لا يفعل ذلك وفيه علم من خلق لأمر واحد ومن‏\n\n\nخلق لأمرين فصاعدا ومن وفى بما خلق له ومن لم يوف بما خلق له وفيه علم سعادة من استكبر بحق ممن استكبر بنفسه كإبليس ومن شاء الله وفيه علم تقرير المناسبة بينه وبين خلقه وأين هذا التقرير من لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ومثل ما\n\n\nجاء في الخبر لله أشد فرحا بتوبة عبده من رجل في أرض فلاة الحديث‏\n\n\nوقوله تعالى أَ ولَمْ يَرَوْا أَنَّ الله الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وفيه علم المفاضلة وأصنافها ومحلها وفيه علم الاختيار الكوني وأنه مجبور في اختياره وهل له مستند إلهي في جبره في اختياره أم لا وقوله فيسبق عليه الكتاب وقوله تعالى ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وقوله لا تَبْدِيلَ لِخَلْقِ الله هل معناه إنما التبديل لله‏\nليس للخلق تبديل أو لا تبديل لخلق الله من كونه أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ وفيه علم حكمة الأخذ الإلهي جزاء هل يعم أو يؤلم ابتداء من غير جزاء كإيلام البري‏ء والصغير فهل هو كما قاله القائل أو ليس الأمر كذلك وإنما هو بري‏ء في ظاهر الأمر مما نسب إليه وما هو بري‏ء عند الله من أمر آخر وقع منه في حق حيوان أو ما لا يعلمه إلا الله والمبتلى أن تذكره فلا يكون على هذا الأخذ أبدا بل له جزء ابتداء وإنما قاله من قاله بنسبة خاصة رأى الأخذ عندها مع براءة المأخوذ مما نسب إليه من تلك النسبة الخاصة ولم يكن عند الله الأخذ إلا من أمر عمله استحق به هذه العقوبة فانتظر انقضاء زمان المهملة فانقضى عند دعوى عليه غير صادقة هو منها بري‏ء فأخذ عندها وإنما كان الأخذ بما تقدم فقيل هذا الأخذ وهو بري‏ء مما نسب إليه فصدقوا أنه بري‏ء ولم يصدقوا في أنه أخذ من أجل تلك الدعوى عليه وهو من علم المكاشفة والاعتبار والمكاشفة في تحصيل هذا العلم أتم لأنه يعين لك الكشف العلة على خصوصها والاعتبار يجملها لك من غير تعيين أو يخرج لها عللا محتملة لا يدري ما أوجب ذلك الأخذ منها فهذا الفرق بين أهل الاعتبار والكشف وفيه علم إلحاق الله بصفة المتقين حتى كان وليهم فإنه ولي المؤمنين لأنه مؤمن وهو ولي المتقين فمن أين يوصف الحق بأنه متق وفيه علم من أين أعطى من أعطى العلم بنطق العالم من غير جهة الخبر فإن الخبر تقليد وفيه علم تأثير الأحوال في أصحابها عند الله وفيه علم ترك الأدب لما يرجى في ذلك من نيل الغرض المقصود وسواء كان محمودا أو مذموما لأنه ما كل غرض محمود ولا كل عرض مذموم وفيه علم تغير الأحوال لتغير الوارد وفيه علم المؤاخاة بين الملائكة والناس الصلحاء منهم وفيه علم أين ينزل أهل الله يوم القيامة وفي الجنان وأي اسم يصحبهم من الأسماء الإلهية وفيه علم توقف الأسماء الإلهية بعضها على بعض وأنها تعطي بالمجموع أمرا لا يكون يعطيه فرد فرد من ذلك المجموع وفيه علم ما تنتجه السياسة الحكمية التي تقضي بها العقول وأنها في ذلك على بصيرة من حيث لا تشعر أعطتها ذلك تجربتها النفوس وما صفة من يقول بهذا العلم وفيه علم الميل لم يميل ولم يمال وفيه علم النظر في الأولى فالأولى وفيه علم الأعواض وهو إذا اعتاص عليك أمر تعوضت عنه بأمر يقوم مقامه فيما تريد إما موازنة سواء وإما أزيد بقليل أو أنقص منه بقليل بحيث إنه لا يؤثر في المطلوب أثرا يخرجه عن نيل غرضه بالكلية وهل في الوجود من لا عوض له إذا فقد أم لا وفيه علم تمييز الرجال بالأحوال وفيه علم تقاسيم الأوامر الإلهية التي تقسمها قرائن الأحوال وما حكم الأمر إذا تعرى عن قرائن الأحوال هل حكمه الوجوب أم لا أو التوقف وهل تعريه عن قرائن الأحوال قرينة حال عدمية تعطيه الوجوب وهل عندنا قرينة حال تعطي الوجوب للأمر وفيه علم وصف العدم بأوصاف الوجود من الانتقال من حال إلى حال مع كونه عدما لا يزول عن هذا الوصف وفيه علم من أين قدم الله في نعته نفسه في كلامه بالرحمة على الأخذ ولم يفعل ذلك في صفة الكون فإنه قد قدم في صفة الكون صفة أهل المقت على صفة أهل السعادة كما وقع في سورة الغاشية وأمثالها وهل جاء مثل هذا ليفرق بين الخلق والحق أم لا وفيه علم الوجهين في الأشياء فما من شي‏ء إلا وفيه نفع بوجه وضرر بوجه أي شي‏ء كان إذا اعتبرته ووزنته وجدت الأمر كما قلنا فليس لشي‏ء في الوجود وجه واحد أبدا أعظمها وأرفعها نور الله به ظهرت الأشياء من خلف الحجب ولو شال الحجب لأحرقت ما أوجدته فهي الموجدة المعدمة وكذا نزول القرآن له وجه نفع في المؤمن فإنه يزيد به إيمانا وفيه وجه ضرر للكافر لأنه يزيد رجسا إلى رجسه قال تعالى يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً ثم من رحمته بخلقه أن قال وما يُضِلُّ به إِلَّا الْفاسِقِينَ فأعطانا العلامة فمن وجد في نفسه تلك العلامة علم أنه من أهل الضلال وفيه علم البعد الإلهي والقرب الإلهي من السعداء والأشقياء والقرب الكوني والبعد الكوني هل هو على موازنة القرب والبعد الإلهي أو لهذا حكم ولهذا حكم وكذلك هو وفيه علم من علمه علم أنه ليس لله من أعمال العبد شي‏ء وفيه علم ما هو العلم وفيه علم ما يوجب السامة والملل ومن يتصف بهما من العالم ممن لا يتصف بهما مع كون الحق قد وصف نفسه بالملل إذ أمل عبده من الخير الذي يكون عليه أو الشر سواء وفيه علم ما لا ينفع من الظنون بالخير عند الله وما ينفع منها وفيه علم أسباب رجعة الكون إلى الله في الدنيا وفيه علم إن الحق هو عين الأشياء بما هو عين الأشياء هل بنفسه أو بشهوده أو بإحاطته وفيه علم ما هو الحق وحكم هذا الاسم حيث ورد هل تختلف أحكامه أو هو عين واحدة في‏\nكل موضع ورد فإن الناس تفرقوا في ذلك فرقا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ ويَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ‏\n\n",
    "en": "Chapter Three Hundred and Forty-Three: Concerning the Knowledge of the Station of Two Secrets in the Detailed Articulation of Revelation from the Presence of the King, to Whom All Praise Belongs.\n\nIndeed, Allah has articulated His signs in detail,\nFor every discerning person of far reach.\n\nAnd He perfected them for hearts that are purified,\nAnd followed none but the paths of guidance.\n\nAnd He who has ever been speaking spoke\nTo our ears, seeking and reciting.\n\nHis speech bewildered our intellects,\nAnd He came with the light of guidance, so we were guided.\n\nSeeing by His lights, Manifest (ظاهر),\nTo Him belongs the End and to Him belongs the Beginning.\n\n### [Indeed, The Director (المدبر) and The Articulator (المفصل) are among the Divine Names (الأسماء الإلهية)]\n\nKnow, may Allah support you, that the two Divine Names (الأسماء الإلهية), The Director (المدبر) and The Articulator (المفصل), are the heads of this station (منزل). They bestow upon the one who enters it all the Divine Sciences (العلوم الإلهية) it carries and contains, concerning what the universes (الأكوان) require and what relates to Allah.\n\nThe ruling of The Director (المدبر) concerning matters is the establishment of their rulings in the Presence of Gathering and Witnessing (حضرة الجمع والشهود) and granting them what they deserve. All of this occurs before their existence in their fixed entities (أعيانها), though they are existent for Him. When He has perfected them, as we mentioned, The Articulator (المفصل) takes them. This Name is specific to the Levels (المراتب), for He places every existent thing (كون) and every command in its proper level and station, like the chamberlain before the Sultan.\n\nFurthermore, The Director (المدبر) acted when Allah created two Mercies (رحمتين), which are the first creation Allah created: one Mercy is simple (بسيطة), and the other Mercy He created is composite (مركبة). He showed mercy through the simple Mercy to all simple things (البسائط) Allah created, and He showed mercy through the composite Mercy to all composite things (المركبات) Allah created. He assigned three stations (منازل) to the composite Mercy, because the composite has two extremes and a mean, and the mean is the very Isthmus (البرزخ) between the two extremes, so that they may be distinguished. Thus, every recipient of mercy among the composite things receives mercy through the composite Mercy derived from these stations.\n\nBy the first composite Mercy, He joined the parts of bodies (الأجسام) one to another until their fixed entities appeared as standing forms. By the second composite Mercy, derived from the second station, He composed the meanings (المعاني), attributes (الصفات), characters (الأخلاق), and sciences (العلوم) within the rational soul (النفس الناطقة) and the animal soul (النفس الحيوانية) which carries the sensory faculties. By the third composite Mercy, He joined the rational souls to the governance (تدبير) of the bodies; this is the composition of spirit and body. This type of composition is that which is characterized by death.\n\nThe Director (المدبر) then brings forth these souls from their bodies by the turning of the Divine Breath (النفخ الإلهي) upon them, originating from the Spirit (الروح) attributed to Him, the Exalted. The Director then composed it with the body from which it originated, and this is a composition of choice (اختيار). If it were a composition of inherent right (استحقاق), it would not have departed from it through death. He made it the governor of another body, a barzakhi (Isthmus) body, and returned the first body to dust. Then He will originate for it another creation (نشأة أخرى) in which He will compose it in the Hereafter (الآخرة).\n\nSince the compositions differed, we know that this specific body, which is the mother of this rational soul born from it, is not governed by the soul by right of inherent deserving, due to the transfer of its governance to another. Rather, the body from which the soul originated has a right over this soul: that as long as the soul governs it, it must not move its limbs except in obedience to Allah, the Exalted, and in the places and states that Allah has specified for it through the tongue of the Lawgiver (الشارع). This is what this body deserves from the soul, due to its right of origination (حق الولادة) over it.\n\nAmong the souls, there is the dutiful child (ابن بار) who listens to and obeys its parents, and in their contentment is the contentment of Allah. The Mighty and Majestic said: <<أَنِ اشْكُرْ لِي>> (Be thankful to Me) from the specific aspect, and <<وَلِوالِدَيْكَ>> (and to your parents) from the causal aspect. And among the souls, there is the undutiful child (ابن عاق) who neither listens nor obeys. The body only commands the soul to good, and this is why the skins of the body and all its limbs will bear witness against its child on the Day of Resurrection, for this child overpowered them and directed them wherever it desired.\n\nAllah divided this composite Mercy into known parts. He gave six hundred parts of it to Gabriel, by which Allah shows mercy to the people of Paradise. And He placed nineteen parts in His Hand, by which He shows mercy to the people of the Fire who belong there. With these parts, He repels the angels of punishment, who are nineteen, as the Exalted said: <<عَلَيْها تِسْعَةَ عَشَرَ>> (Over it are nineteen).\n\nAs for the hundred Mercies (رحمة) that Allah created, He placed one of them in the world, by which He provides for His servants—their disbelievers and their believers, their disobedient and their obedient. By it, all animals show affection to their young, and by it, people show mercy to one another and feel affection, as Allah said: <<إِنَّ الْمُؤْمِنُونَ بَعْضُهُمْ أَوْلِياءُ بَعْضٍ>> (Indeed, the believers are allies of one another), and <<وَالظَّالِمِينَ بَعْضُهُمْ أَوْلِياءُ بَعْضٍ>> (and the wrongdoers are allies of one another), and the hypocrites are allies of one another. All of this is the fruit of this Mercy.\n\nWhen the Hereafter arrives on the Day of Resurrection, He will join this Mercy to the ninety-nine Mercies stored with Him, and by them, He will show mercy to His servants gradually and in temporal sequence, so that through this delay, the ranks of the intercessors (الشفعاء), Allah’s care for them, and their distinction over others may become manifest.\n\nWhen none remain in the Fire except its permanent inhabitants (أهلها القاطنون) who will never leave it, and the nineteen angels of punishment intend to torment the people of the Fire, nineteen angels will be embodied from the composite Mercy, and they will intervene between the angels of punishment and the people of the Fire, standing before them. They will be supported by the Mercy that <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompasses all things). For the angels of punishment are also encompassed by Mercy, like all other things, and what encompasses them prevents them from resisting this composite Mercy. What supported the angels of punishment initially was the Wrath of Allah, which manifested from the angering of the transgressors.\n\nWhen the session of judgment concluded, and The Real (الحق) commanded those He commanded to the prison, which is Hell (جهنم), as He said: <<وَجَعَلْنا جَهَنَّمَ لِلْكافِرِينَ حَصِيراً>> (And We have made Hell a confinement for the disbelievers)—meaning a prison, because the confined person is imprisoned and prevented from acting freely. This is unlike the people of Paradise, who have the right to settle therein wherever they wish. The people of the Fire do not have this right.\n\nThis is part of the hidden Divine Kindness (الرفق الإلهي) toward His servants. If He had granted them the right to settle in the Fire wherever they wished, they would never find rest, constantly seeking escape from the torment when they felt it, hoping that there might be ease for them in another place within it. But during the time of torment, there is no ease in it. Thus, no type of torment in Hell would remain untasted by them. The continuous torment is easier than the renewed torment. The same applies to bliss. This is why Allah replaces their skins in the Fire when they are cooked, <<لِيَذُوقُوا الْعَذابَ>> (so that they may taste the torment). A period passes over them during which they taste the continuous torment until the skins are cooked, and then, by the replacement, a new torment is renewed upon them. If they had the right to settle in Hell wherever they wished, they would not remain still until their skins were cooked. Rather, in every place they moved to, they would taste a new torment until the cooking occurred, and that movement would intensify their suffering. Thus, Allah showed them mercy from where they did not perceive, just as He planned against them from where they did not perceive.\n\nThese are seven hundred and nineteen Mercies. One hundred of them are in the Hand of Allah, and none of Allah’s creation has disposal over them; He has reserved them for Himself. By them, Allah shows mercy to His servants without intermediaries (الوسائط), but directly from Him to the recipient of mercy specifically. They correspond to the number of the Divine Names (الأسماء الإلهية)—the ninety-nine Names of Enumeration—with one Mercy for each Name, plus one more, making the hundred that are in Allah’s Hand, of which no creature has knowledge. The completion of the hundred is the Mercy attributed to Him that encompasses all things.\n\nBy these hundred Mercies, He looks upon the degrees of Paradise, which are one hundred degrees. And by them, after the period of deserving punishment has ended, He looks upon the levels (دركات) of the Fire, which are one hundred levels, each level corresponding to a degree of Paradise. By this encompassing Mercy, the nineteen Mercies that resist the angels of punishment in the Fire are strengthened. And since that Mercy has encompassed those angels, they find mercy in their souls toward the people of the Fire, because they see Allah has manifested (تجلى) in a form other than the Wrath that had incited them to take vengeance for Allah upon the enemies. So they intercede with Allah on behalf of the people of the Fire who will not leave it, becoming advocates for them after having been against them. Allah accepts their intercession concerning them, for the Divine Word (الكلمة الإلهية) has been established that they are the permanent inhabitants (عمار) of that abode. Thus, the ruling concerning them is assigned to the Mercy that <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompasses all things) and to these nineteen Mercies, which constitute the composite Mercy.\n\nSo He grants them in Hell the bliss of the chilled (المقرور) and the scorched (المحرور), because the bliss of the chilled is due to the existence of the Fire, and the bliss of the scorched is due to the existence of the extreme cold (الزمهرير). Hell thus remains in its form, possessing heat and extreme cold, and its inhabitants remain enjoying bliss within it through its heat and its extreme cold. For this reason, the people of Hell do not visit one another, except the people of each layer within their own layer. The scorched visit one another, and the chilled visit one another. A chilled person does not visit a scorched person, nor vice versa.\n\nThe people of Paradise, however, all visit one another because they share a single characteristic in accepting bliss, for they were here—meaning in the Abode of Responsibility (دار التكليف)—people of Unity (توحيد), who did not associate partners, whether it was the Unity of Knowledge or the Unity of Faith. The people of the Fire did not possess the characteristic of unification (التوحد); they were people of association (شرك). Therefore, they do not possess a characteristic of Oneness (أحدية) that encompasses them in bliss absolutely without restriction. Thus, they are two groups in Hell. These are the Dualists (الثنوية), and there are none other than them who are the permanent inhabitants of the Fire.\n\nAs for the people of the Trinity (أهل التثليث), there is hope for their deliverance, because the Trinity contains the quality of Singularity (الفردية), and the Singular (الفرد) is one of the attributes of the One (الواحد). Thus, they are unitarians (موحدون) through a composite unity (توحيد تركيب), and it is hoped that the composite Mercy (الرحمة المركبة) will encompass them. This is why they were named disbelievers (كفارا), because they veiled the Second by the Third, so the Second became like the Isthmus (البرزخ) between the One and the Third. Perhaps the people of the Trinity will join the Unitarians (الموحدين) in the Presence of Singularity (حضرة الفردانية), but not in the Presence of Unity (حضرة الوحدانية). This is how we saw them in the spiritual Unveiling (الكشف المعنوي): we could not distinguish between the Unitarians and the people of the Trinity except in the Presence of Singularity. For I did not see a shadow for them in Unity, but I saw their fixed entities (أعيانهم) in Singularity. I saw the fixed entities of the Unitarians in both Unity and Singularity. Thus, I knew the difference between the two groups. As for those who exceed the people of the Trinity, all of them, praise be to Allah, are saved from Hell. Their bliss in Paradise allows them to settle wherever they wish, just as they used to descend in the world from the Presences of the Divine Names (حضرات الأسماء الإلهية) wherever they wished, by a lawful right granted to them, just as, when they performed ablution, they could enter through any of the eight gates of Paradise they wished. If you have understood this, then:\n\n### [That Allah’s Mercy Encompasses All Existents]\n\nKnow that this composite Mercy (الرحمة المركبة) encompasses all existents (الموجودات), and that it is composed of a general Mercy—which is that which encompasses all things—and a specific Mercy—which is the Mercy by which Allah distinguishes those He chooses and fashions for Himself, such as a Messenger, a Prophet, or a Saint (ولي).\n\nBy this composite Mercy, Allah gathered the Scriptures and sent down every Book in chapters (سورا) and verses (آيات). Some of His signs remain, like the Quran, and every sign that appeared through the path of miraculousness (الإعجاز). And some of His signs did not remain, so the restriction of their ruling remained only upon the one who brought them, thus indicating others just as they indicated him. For Allah made them a sign of the truthfulness of the claim made by every single person who claimed proximity to Allah, either through their spiritual state (بالحال), even if they did not utter the claim, due to the traces of obedience to their Lord seen upon them, or through the claim itself, by their verbal declaration of it. This latter case only occurs out of heedlessness, for they (meaning the Saints/الأولياء) are commanded to conceal these signs. Thus, they are abrogated (منسوخة) in the Saints but established (محكمة) in the Prophets and Messengers.\n\nSo He said: <<مَا نَنْسَخْ مِنْ آيَةٍ>> (Whatever verse/sign We abrogate)—meaning, whatever sign—<<أَوْ نُنْسِها>> (or cause to be forgotten)—meaning, or We leave it (i.e., We leave it as a sign for the Saints, just as it was a sign for the Prophets)—<<نَأْتِ بِخَيْرٍ مِنْها>> (We bring forth something better than it), by way of preference (المفاضلة), meaning something greater than it in indication, which are the signs of miraculousness (آيات الإعجاز). These belong only to their possessors or to those who stand in deputyship (النيابة) concerning them, testifying to the truthfulness of their possessors. Therefore, a Saint never possesses this sign by virtue of the soundness of his station (مرتبته). As for His saying: <<أَوْ مِثْلِها>> (or the like of it), the pronoun refers back to the abrogated sign, which did not possess the quality of miraculousness; rather, it is like the first one.\n\nIt is not correct to interpret this verse as referring to the verses of the Quran that were revealed concerning legal rulings (الأحكام), where a ruling established in a previous verse was abrogated by a later verse. For Allah did not say at the end of this verse, \"Did you not know that Allah is All-Knowing, All-Aware,\" or \"All-Wise,\" as such Names are appropriate for the structure of the Quran dealing with verses of legal rulings. Rather, Allah, the Exalted, said: <<أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (Do you not know that Allah is over all things powerful?). Thus, He intended the signs that appeared at the hands of the Prophets (عليه السلام) to confirm the truthfulness of their claim that they were Messengers of Allah. Some of these He left as a sign until the Day of Resurrection, like the Quran, and some He removed, and they will not appear until the Day of Resurrection.\n\nWhen Allah gathered the Quran by means of this composite Mercy in the Books—not in the breasts, for in the breasts it is Quran, on the tongue it is speech, and in the written copies (المصاحف) it is a book—the Name The Articulator (المفصل) placed that [gathering] by the command of The Director (المدبر), for The Director precedes it in rank. Therefore, The Director holds the ruling concerning detailed articulation potentially (بالقوة), and The Articulator holds it actually (بالفعل). The station of Mercy (منزل الرحمة) is spacious and wide in its scope. How could it not be wide when it has <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompassed all things)?\n\nThis much is sufficient for what benefits the listeners among mankind. We have mentioned its ruling in the two abodes (الدارين) and what returns to us from it, which is the intended purpose.\n\nAnd in this station is the knowledge of the stations of the composite Mercy, and to what extent its stations terminate, and the station in which it was confirmed, and the station in which it was not confirmed, and upon how many degrees the confirmation occurred therein. And in it is the knowledge of what is known only through Divine Report (الخبر الإلهي), and the knowledge of clarification concerning the station of Gathering (مقام الجمع), such as the prayer that gathers Allah and the servant in the recitation of the Opening Chapter of the Book (Fatihat al-Kitab). From this is derived the proof of its obligation upon the worshipper in prayer. Whoever does not recite it in prayer has not performed the prayer that Allah divided between Himself and His servant. For He did not say, \"I divided the Fatiha,\" but rather He said, \"I divided the Prayer,\" using the definite article for covenant and definition. When He explained the covenanted Prayer by division, He made the locus of the division the recitation of the Fatiha. This is the strongest proof found for the obligation of reciting the Praise (al-Hamd) in prayer.\n\nAnd in it is the knowledge of the effect of the composite Mercy (الرحمة المركبة) specifically in the Muhammadan World (العالم المحمدي). And in it is the knowledge of placing meanings (المعاني) in the rank of persons (الأشخاص). And in it is the knowledge of translations/biographies (التراجم). And in it is the knowledge of the group that heard, yet it was said of them that they did not hear, despite the presence of understanding in what they heard. What was negated from them, and what remained for them? And in it is the knowledge of the dark and shadowy cosmic veils (الحجب الكونية المظلمة والظلمانية), who belongs to each veil, and from whom the veiled person is veiled: whether he is veiled from his happiness, or from witnessing his Lord (مشاهدة ربه), or from witnessing the station of His Messenger. And in it is the knowledge of the universe's audacity toward Allah. And in it is the knowledge of the Divine Subtlety (اللطف الإلهي) toward the obstinate, those who reject His commands and contend with His supporters. And in it is the knowledge of what caused the Messenger of Allah (PBUH) to turn gray, which he mentioned concerning Surah Hud and its sisters. And in it is the knowledge of seeking the Divine Secret (السر الإلهي). And in it is the knowledge of encompassing what is endless.\n\nAnd in it is the knowledge of the recompense (الجزاء) that is not in temporal agreement (الوفاق الزماني). For the duration of deeds that seek rewards is finite, but the reward for them is infinite. So, what is the commensurate recompense (الجزاء الوفاق) that is not commensurate? And in it is the knowledge of denial (الإنكار), affirmation (الإقرار), confirmation (التقرير), and reprimand (التوبيخ): what is their description and where is their locus? And in it is the knowledge of corporeal (الجسمي) and bodily (الجسماني) creation, the levels of creation, and how much temporal measure (المقدار الزماني) it possesses. And in it is the knowledge of the Levels (المراتب) to which the Lord is attributed. And in it is the knowledge of the Divine Intention (القصد الإلهي). And in it is the knowledge of the locus of answers that occur by the rule of correspondence (المطابقة) when the questioner asks. And in it is the knowledge of the rank of the rational person (العاقل) and his nobility over the knower (العالم), provided the knower is truly knowledgeable. For the rational person, when he sees what is indispensable for him, rushes toward it, while the non-rational person does not do so.\n\nAnd in it is the knowledge of who was created for one matter, and who was created for two matters or more, and who fulfilled what he was created for, and who did not fulfill what he was created for. And in it is the knowledge of the happiness of one who was arrogant by right, compared to one who was arrogant by himself, like Iblis and whomever Allah wills. And in it is the knowledge of establishing the suitability (المناسبة) between Him and His creation, and where this establishment stands in relation to <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). And like what came in the report: \"Allah rejoices more over the repentance of His servant than a man in a desolate land...\" (the Hadith). And His saying, the Exalted: <<أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً>> (Do they not see that Allah, who created them, is mightier than them in strength?).\n\nAnd in it is the knowledge of preference (المفاضلة), its types, and its locus. And in it is the knowledge of cosmic choice (الاختيار الكوني), and that one is compelled (مجبور) in his choice, and whether he has a Divine basis for his compulsion in his choice or not. And His saying: \"So the Book precedes him,\" and His saying, the Exalted: <<مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The word is not changed with Me), and His saying: <<لَا تَبْدِيلَ لِخَلْقِ اللَّهِ>> (There is no changing the creation of Allah). Does this mean that change belongs only to Allah, and creation has no change? Or does it mean there is no changing the creation of Allah in the sense that He <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (gave everything its creation)?\n\nAnd in it is the knowledge of the wisdom of Divine Seizure (الأخذ الإلهي) as recompense: Does it generalize, or does it inflict pain initially without recompense, such as the pain inflicted upon the innocent and the young? Is it as the speaker said, or is the matter otherwise? Rather, he is innocent in appearance of what is attributed to him, but he is not innocent before Allah concerning another matter that occurred from him regarding an animal or something known only to Allah. The afflicted person, if you mention him, is never subject to this seizure; rather, he has an initial portion. The one who said this only said it based on a specific attribution, seeing the seizure occur then, despite the innocence of the seized person regarding that specific attribution. But before Allah, the seizure was only due to an action he performed by which he deserved this punishment. He awaited the end of the period of respite, and it ended at the time of a false claim against him, of which he was innocent. So he was seized then. The seizure was only due to what preceded, so it was said, \"This seizure occurred while he is innocent of what was attributed to him.\" They were truthful that he was innocent, but they were not truthful that he was seized because of that claim against him. This is from the science of Unveiling (المكاشفة) and Consideration (الاعتبار). Unveiling is more complete in acquiring this knowledge because the Unveiling specifies the cause for you in its particularity, while Consideration generalizes it for you without specification, or produces probable causes, and one does not know which of them necessitated that seizure. This is the difference between the people of Consideration and the people of Unveiling.\n\nAnd in it is the knowledge of Allah’s attachment to the attribute of the God-fearing (المتقين) such that He is their Protector (ولي). For He is the Protector of the believers because He is a believer, and He is the Protector of the God-fearing. So, from where is The Real (الحق) described as being God-fearing? And in it is the knowledge of where the one who was given knowledge was given it—through the speech of the knower, not through the channel of report (الخبر), for report is imitation (تقليد). And in it is the knowledge of the effect of spiritual states (الأحوال) upon their possessors before Allah. And in it is the knowledge of abandoning proper conduct (الأدب) for the sake of attaining the intended purpose hoped for therein, whether that purpose is praiseworthy or blameworthy, for not every purpose is praiseworthy, nor is every purpose blameworthy. And in it is the knowledge of the change of spiritual states due to the change of the incoming Divine influx (الوارد). And in it is the knowledge of the brotherhood (المؤاخاة) between the angels and the righteous among mankind. And in it is the knowledge of where the people of Allah (أهل الله) will alight on the Day of Resurrection and in the Gardens, and which of the Divine Names will accompany them. And in it is the knowledge of the dependence of the Divine Names upon one another, and that collectively they grant a matter that no single individual Name from that collection grants.\n\nAnd in it is the knowledge of what is produced by the wise governance (السياسة الحكمية) decreed by the intellects, and that in this, they possess insight without realizing it, granted to them by their experience of souls. And what is the description of the one who speaks with this knowledge? And in it is the knowledge of inclination (الميل): who inclined, and who was inclined toward. And in it is the knowledge of looking at the first, then the first. And in it is the knowledge of substitutions (الأعواض): when a matter becomes difficult for you, you substitute it with another matter that takes its place in what you desire, either in equal balance, or slightly more, or slightly less, such that it does not affect the desired object in a way that entirely prevents the attainment of its purpose. And is there anyone in Existence (الوجود) for whom there is no substitute if he is lost, or not? And in it is the knowledge of distinguishing men by their spiritual states.\n\nAnd in it is the knowledge of the divisions of the Divine Commands (الأوامر الإلهية) that are divided by the contextual indicators (قرائن الأحوال). What is the ruling of a command when it is stripped of contextual indicators? Is its ruling obligation (الوجوب) or not, or suspension? And is its being stripped of contextual indicators a non-existent contextual indicator that grants it obligation? And do we possess a contextual indicator that grants obligation to a command? And in it is the knowledge of describing non-existence (العدم) with the descriptions of Existence (الوجود), such as transitioning from one state to another, despite its being non-existence that does not depart from this description.\n\nAnd in it is the knowledge of why Allah, in describing Himself in His speech, prioritized Mercy over Seizure (الأخذ), yet He did not do so in the description of the universe (الكون), for in the description of the universe, He prioritized the description of the people of wrath (أهل المقت) over the description of the people of happiness (أهل السعادة), as occurred in Surah Al-Ghashiyah and its likes. Did this come to differentiate between Creation (الخلق) and The Real (الحق), or not?\n\nAnd in it is the knowledge of the two aspects in things. There is nothing that does not contain benefit in one aspect and harm in another aspect. Whatever thing you consider and weigh, you will find the matter as we have stated. Nothing in Existence ever has only one aspect. The greatest and highest of these is the Light of Allah, by which things appeared from behind the veils (الحجب). If He were to lift the veils, it would burn what it brought into existence. Thus, it is the Bringer-into-Existence and the Annihilator. Likewise, the descent of the Quran has an aspect of benefit for the believer, for it increases him in faith, and it has an aspect of harm for the disbeliever, for it adds defilement to his defilement. The Exalted said: <<يُضِلُّ بِهِ كَثِيراً وَيَهْدِي بِهِ كَثِيراً>> (He misleads many thereby and guides many thereby). Then, out of His Mercy toward His creation, He said: <<وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ>> (And He misleads thereby only the defiantly disobedient). Thus, He gave us the sign. Whoever finds that sign within himself knows that he is among the people of misguidance.\n\nAnd in it is the knowledge of Divine Distance and Divine Proximity (القرب الإلهي) from the happy (السعداء) and the wretched (الأشقياء), and cosmic proximity and cosmic distance. Is this based on the balance of Divine Proximity and Distance, or does this have one ruling and that have another ruling? And indeed, it is so. And in it is the knowledge of the one whose knowledge knows that Allah has nothing from the servant's deeds. And in it is the knowledge of what Knowledge (العلم) is. And in it is the knowledge of what necessitates weariness (السامة) and boredom (الملل), and who among the cosmos is characterized by them and who is not, despite The Real (الحق) having described Himself with boredom when His servant becomes bored of the good or the evil that is upon him, equally. And in it is the knowledge of which good assumptions (الظنون بالخير) are useless before Allah and which are beneficial. And in it is the knowledge of the reasons for the return of the universe (الكون) to Allah in the world.\n\nAnd in it is the knowledge that The Real (الحق) is the very essence (عين) of things by virtue of being the essence of things: is this by His Essence (بنفسه), or by His Witnessing (بشهوده), or by His Encompassing (بإحاطته)? And in it is the knowledge of what The Real is, and the ruling of this Name wherever it occurs: Do its rulings differ, or is it a single essence (عين واحدة) in every place it occurs? For people have divided into factions concerning this. And Allah <<يَقُولُ الْحَقَّ>> (speaks the Truth) and <<وَهُوَ يَهْدِي السَّبِيلَ>> (He guides to the way) and <<وَيَهْدِي مَن يَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيمٍ>> (He guides whom He wills to a straight path).",
    "ur": "باب تین سو تینتالیس: منزل سرین (سرين) کی معرفت میں، جو تمام بادشاہت کی حمد (حمد) کی حضور سے وحی کی تفصیل سے متعلق ہے\n\nذات حق (الحق) نے اپنی آیات کو تفصیل سے بیان کیا، ہر دور رس عقل والے کے لیے۔\nاور ان کو ان دلوں کے لیے محکم کیا جو پاکیزہ ہوئے، اور جنہوں نے ہدایت کے راستوں کے سوا کسی کی پیروی نہ کی۔\nاور وہ ذات جو ہمیشہ سے بولنے والی ہے، اس نے ہمارے کانوں کے لیے بولا، پکارنے والا اور گانے والا بن کر۔\nپس اس کے کلام نے ہماری عقلوں کو حیران کر دیا، اور وہ ہدایت کے نور کے ساتھ آیا، پس اس نے ہدایت پائی۔\nوہ اپنے انوار کے ساتھ بصیر (دیکھنے والا) اور ظاہر ہے، اسی کے لیے انتہا ہے اور اسی کے لیے ابتدا ہے۔\n\n### [بے شک المدبر (مدبر) اور المفصل (مفصل) اسمائے الٰہیہ میں سے ہیں]\n\nجان لو، اللہ تمہاری مدد کرے، کہ دو اسمائے الٰہیہ، المدبر (المدبر) اور المفصل (المفصل)، اس منزل کے دو سر ہیں جو اس میں داخل ہونے والے کو وہ تمام علوم الٰہیہ عطا کرتے ہیں جو یہ منزل اپنے اندر رکھتی ہے اور جن پر مشتمل ہے، ان علوم میں سے جو اکوان (الأكوان) کا تقاضا کرتے ہیں اور جو ذات حق (الحق) سے متعلق ہیں۔ اور مدبر (المدبر) کا حکم امور میں یہ ہے کہ وہ حضور جمع و شہود (حضرة الجمع والشهود) میں ان کے احکام کو نافذ کرتا ہے اور انہیں وہ عطا کرتا ہے جس کے وہ مستحق ہیں، اور یہ سب ان کے اعیان (أعيان) میں وجود سے پہلے ہوتا ہے، جبکہ وہ اس کے لیے موجود ہیں۔ جب وہ ان کو محکم کر دیتا ہے جیسا کہ ہم نے ذکر کیا، تو مفصل (المفصل) ان کو لے لیتا ہے۔ اور یہ اسم مراتب کے ساتھ مخصوص ہے، پس وہ ہر کون (كون) اور امر کو اس کے مرتبے اور منزل میں نازل کرتا ہے، جیسے سلطان کے دربار میں امیر مجلس۔ پھر جب مدبر (المدبر) نے دو رحمتیں پیدا کیں، اور یہ پہلی مخلوق ہیں جسے اللہ نے پیدا کیا: ایک بسیط رحمت (الرحمة الواحدة بسيطة) اور دوسری مرکب رحمت (الرحمة الأخرى مركبة)۔ پس اس نے بسیط رحمت (الرحمة البسيطة) کے ذریعے ان تمام بسیط چیزوں پر رحم کیا جنہیں اللہ نے پیدا کیا، اور مرکب رحمت (الرحمة المركبة) کے ذریعے ان تمام مرکب چیزوں پر رحم کیا جنہیں اللہ نے پیدا کیا۔ اور اس نے مرکب رحمت (الرحمة المركبة) کے لیے تین منازل مقرر کیں، کیونکہ مرکب کے دو سرے اور ایک واسطہ ہوتا ہے، اور واسطہ عین برزخ (البرزخ) ہے جو دونوں سروں کے درمیان ہوتا ہے تاکہ وہ ممتاز ہو جائیں۔ پس وہ مرکب میں سے ہر مرحوم پر ان منازل سے مرکب رحمت (الرحمة المركبة) کے ذریعے رحم کرتا ہے۔ پہلی مرکب رحمت (الرحمة الأولى المركبة) کے ذریعے اس نے اجسام کے اجزاء کو ایک دوسرے سے ملایا یہاں تک کہ ان کے اعیان (أعيان) قائم صورتوں میں ظاہر ہوئے۔ اور دوسری مرکب رحمت (الرحمة الثانية المركبة) کے ذریعے، جو دوسری منزل سے ہے، اس نے معانی، صفات، اخلاق اور علوم کو نفس ناطقہ (النفس الناطقة) اور حسی قوتوں کو اٹھانے والے نفس حیوانیہ (النفس الحيوانية) میں مرکب کیا۔ اور تیسری مرکب رحمت (الرحمة الثالثة المركبة) کے ذریعے اس نے نفوس ناطقہ (النفوس الناطقة) کو اجسام کی تدبیر کے ساتھ ملایا، پس یہ روح اور جسم کا ترکیب ہے۔ اور ترکیب کی یہ قسم ہی موت سے متصف ہوتی ہے۔ پس مدبر (المدبر) نے ان نفوس کو ان کے ابدان سے اس پر الٰہی نفخ (النفخ الإلهي) کے توجہ کے ذریعے ظاہر کیا جو اس کی طرف منسوب روح سے ہے۔ پس مدبر (المدبر) نے انہیں اس جسم کے ساتھ مرکب کیا جس سے وہ پیدا ہوئے تھے، اور یہ اختیاری ترکیب ہے، اگر یہ استحقاق کی ترکیب ہوتی تو موت کے ذریعے اس سے جدا نہ ہوتی۔ اور اس نے اسے ایک دوسرے برزخی جسم کے لیے مدبر (مدبر) بنا دیا، اور حق (الحق) نے اسے مٹی سے ملحق کر دیا۔ پھر وہ اس کے لیے ایک دوسری نشأت (نشأة أخرى) پیدا کرے گا جس میں وہ اسے آخرت میں مرکب کرے گا۔ پس جب مرکبات مختلف ہوئے تو ہم نے جانا کہ یہ معین جسم، جو اس نفس ناطقہ (النفس الناطقة) کی ماں ہے جو اس سے پیدا ہوا ہے، وہ استحقاق کے حکم سے اس کی مدبر (مدبرة) نہیں ہے، کیونکہ اس کی تدبیر دوسرے کی طرف منتقل ہو جاتی ہے۔ بلکہ جس جسم سے وہ پیدا ہوا ہے، اس نفس پر اس کا حق (الحق) یہ ہے کہ جب تک وہ اس کی مدبر (مدبرة) ہے، وہ اس کے اعضاء کو صرف اللہ تعالیٰ کی اطاعت میں اور ان جگہوں اور حالات میں حرکت دے جنہیں اللہ نے شارع کی زبان سے اس کے لیے مقرر کیا ہے۔ یہ وہ ہے جس کا یہ جسم اس نفس سے مستحق ہے، اس حق ولادت کی بنا پر جو اسے اس پر حاصل ہے۔ پس نفوس میں سے کچھ نیک بیٹے ہوتے ہیں جو اپنے والدین کی سنتے اور اطاعت کرتے ہیں، اور ان کی رضا میں اللہ کی رضا ہے۔ اللہ عزوجل نے فرمایا: **أَنِ اشْكُرْ لِي** (میرا شکر ادا کرو) خاص پہلو سے، اور **وَلِوالِدَيْكَ** (اور اپنے والدین کا) سببی پہلو سے۔ اور نفوس میں سے کچھ نافرمان بیٹے ہوتے ہیں جو نہ سنتے ہیں اور نہ اطاعت کرتے ہیں۔ پس جسم نفس کو صرف بھلائی کا حکم دیتا ہے، اور اسی لیے قیامت کے دن جسم کی کھالیں اور اس کے تمام اعضاء اپنے بیٹے کے خلاف گواہی دیں گے، کیونکہ اس بیٹے نے ان پر جبر کیا اور انہیں وہاں صرف کیا جہاں وہ چاہتا تھا۔ اور اللہ نے اس مرکب رحمت (الرحمة المركبة) کو معلوم اجزاء پر تقسیم کیا، جس میں سے اس نے جبرائیل کو چھ سو حصے عطا کیے، جن کے ذریعے اللہ اہل جنت پر رحم کرے گا۔ اور اس نے اپنے ہاتھ میں انیس حصے رکھے، جن کے ذریعے وہ اہل نار پر رحم کرے گا جو اس کے اہل ہیں، وہ ان کے ذریعے عذاب کے فرشتوں کو دفع کرے گا جو انیس ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا: **عَلَيْها تِسْعَةَ عَشَرَ** (اس پر انیس [فرشتے] ہیں)۔ اور جہاں تک سو رحمتوں کا تعلق ہے جنہیں اللہ نے پیدا کیا، تو اس نے ان میں سے ایک رحمت دنیا میں رکھی، جس کے ذریعے وہ اپنے بندوں کو رزق دیتا ہے، خواہ وہ کافر ہوں یا مومن، نافرمان ہوں یا مطیع۔ اور اسی کے ذریعے تمام حیوانات اپنی اولاد پر شفقت کرتے ہیں، اور اسی کے ذریعے لوگ ایک دوسرے پر رحم کرتے ہیں اور ایک دوسرے سے محبت کرتے ہیں، جیسا کہ اللہ نے فرمایا: **إِنَّ الْمُؤْمِنُونَ بَعْضُهُمْ أَوْلِياءُ بَعْضٍ** (بے شک مومن ایک دوسرے کے دوست ہیں) اور **وَالظَّالِمِينَ بَعْضُهُمْ أَوْلِياءُ بَعْضٍ** (اور ظالم ایک دوسرے کے دوست ہیں) اور منافقین بعضهم أولياء بعض (منافقین ایک دوسرے کے دوست ہیں)۔ یہ سب اس رحمت کا ثمرہ ہے۔ پس جب آخرت میں قیامت کا دن ہوگا، تو وہ اس رحمت کو ان ننانوے رحمتوں کے ساتھ ملا دے گا جو اس کے پاس محفوظ ہیں، پس وہ ان کے ذریعے اپنے بندوں پر تدریج اور زمانی ترتیب کے ساتھ رحم کرے گا، تاکہ اس تاخیر کے ذریعے شفاعت کرنے والوں کے مراتب اور اللہ کی ان پر عنایت اور دوسروں پر ان کی تمیز ظاہر ہو۔ پس جب جہنم میں صرف اس کے اہل باقی رہ جائیں گے جو اس میں ہمیشہ رہنے والے ہیں اور جن کے لیے اس سے کوئی خروج نہیں ہے، اور عذاب کے انیس فرشتے اہل نار کو عذاب دینا چاہیں گے، تو مرکب رحمت (الرحمة المركبة) سے انیس فرشتے مجسم ہو جائیں گے، اور وہ عذاب کے فرشتوں اور اہل نار کے درمیان حائل ہو جائیں گے اور ان کے سامنے کھڑے ہو جائیں گے، اور ان کی مدد اس رحمت سے کی جائے گی جو **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (ہر چیز پر محیط ہے)۔ کیونکہ عذاب کے فرشتوں کو بھی یہ رحمت تمام اشیاء کی طرح محیط ہے، پس جو چیز انہیں محیط ہے وہ انہیں اس مرکب رحمت (الرحمة المركبة) کی مزاحمت سے روکے گی۔ اور جو چیز پہلے ان کی مدد کرتی تھی وہ اللہ کا غضب تھا جو مخالفین کے غضب دلانے سے ظاہر ہوا تھا۔ پس جب محاکمہ کی مجلس ختم ہو جائے گی اور حق (الحق) نے جسے حکم دیا ہوگا کہ وہ قید خانے میں جائے، اور وہ جہنم ہے، جیسا کہ فرمایا: **وَجَعَلْنا جَهَنَّمَ لِلْكافِرِينَ حَصِيراً** (اور ہم نے جہنم کو کافروں کے لیے حصیر [قید خانہ] بنا دیا) یعنی قید خانہ، کیونکہ محصور (گھیرا ہوا) قیدی ہوتا ہے اور تصرف سے ممنوع ہوتا ہے، بخلاف اہل جنت کے، کہ انہیں جہاں چاہیں وہاں ٹھہرنے کی اجازت ہوگی۔ اور اہل نار کا معاملہ ایسا نہیں ہے۔ اور یہ اللہ کی اپنے بندوں پر پوشیدہ مہربانی (الرفق الإلهي الخفي) میں سے ہے۔ اگر وہ انہیں جہنم میں جہاں چاہیں ٹھہرنے کی اجازت دیتا، تو وہ عذاب محسوس کرتے ہی فرار کی تلاش میں قرار نہ پکڑتے، اس امید پر کہ شاید انہیں اس کے کسی دوسرے مقام پر راحت مل جائے، حالانکہ عذاب کے وقت اس میں کوئی راحت نہیں ہے۔ پس جہنم میں عذاب کی کوئی قسم ایسی نہ رہتی جو وہ نہ چکھتے۔ اور مسلسل عذاب نئے عذاب سے زیادہ آسان ہوتا ہے، اور اسی طرح نعمت بھی۔ اور اسی لیے اللہ ان کی کھالوں کو جہنم میں بدل دے گا جب وہ پک جائیں گی، تاکہ **لِيَذُوقُوا الْعَذابَ** (وہ عذاب چکھیں)۔ پس ان پر ایک زمانہ گزرے گا جس میں وہ مسلسل عذاب چکھیں گے یہاں تک کہ کھالیں پک جائیں، اور اس وقت تبدیلی کے ذریعے ان پر نیا عذاب تازہ ہو جائے گا۔ اگر انہیں جہنم میں جہاں چاہیں ٹھہرنے کی اجازت ہوتی، تو وہ اپنی کھالیں پکنے تک قرار نہ پکڑتے، بلکہ وہ ہر اس جگہ جہاں منتقل ہوتے، نیا عذاب چکھتے یہاں تک کہ پکنا حاصل ہو جاتا، پس وہ انتقال ان کے عذاب میں مزید شدت کا باعث بنتا۔ پس اللہ نے ان پر رحم کیا جہاں سے وہ شعور نہیں رکھتے، جیسا کہ اس نے ان کے ساتھ مکر کیا جہاں سے وہ شعور نہیں رکھتے۔ پس یہ سات سو انیس رحمتیں ہیں، جن میں سے سو اللہ کے ہاتھ میں ہیں، جن میں اللہ کی مخلوق میں سے کسی نے تصرف نہیں کیا، اس نے انہیں اپنے لیے خاص کر لیا ہے۔ ان کے ذریعے اللہ اپنے بندوں پر واسطوں کے اٹھ جانے کے ساتھ رحم کرتا ہے، بلکہ یہ خاص طور پر مرحوم کے لیے اس کی طرف سے ہوتی ہے۔ اور یہ اسمائے الٰہیہ کی تعداد کے مطابق ہیں، یعنی احصاء کے ننانوے اسماء، ہر ایک اسم کے لیے ایک رحمت ان سو رحمتوں میں سے جو اللہ کے ہاتھ میں ہیں، جن کا علم کسی مخلوق کو نہیں ہے۔ اور سو کی تکمیل وہ رحمت ہے جو اس کی طرف منسوب ہے جو ہر چیز پر محیط ہے۔ پس ان سو رحمتوں کے ذریعے وہ جنت کے درجات کو دیکھتا ہے، اور وہ سو درجے ہیں۔ اور ان کے ذریعے، عذاب کے استحقاق کا زمانہ ختم ہونے کے بعد، وہ جہنم کے درکات (درجے) کو دیکھتا ہے، اور وہ سو درکات ہیں، ہر درک جنت کے ایک درجے کے مقابل ہے۔ پس اس وسیع رحمت (الرحمة الواسعة) کے ذریعے وہ انیس رحمتوں کی تائید کی جاتی ہے جو جہنم میں عذاب کے فرشتوں کا مقابلہ کرتی ہیں۔ اور وہ فرشتے بھی اس رحمت کے محیط میں ہیں، پس وہ اہل نار کے لیے اپنے نفوس میں رحمت پاتے ہیں، کیونکہ وہ اللہ کو غضب کی اس صورت کے علاوہ کسی اور صورت میں تجلی کرتے ہوئے دیکھتے ہیں جس نے انہیں دشمنوں سے اللہ کے لیے انتقام لینے پر اکسایا تھا۔ پس وہ اللہ کے پاس اہل نار کے حق میں شفاعت کرتے ہیں جو اس سے نہیں نکلیں گے، پس وہ ان کے لیے ہو جائیں گے بعد اس کے کہ وہ ان کے خلاف تھے۔ اور اللہ ان کے حق میں ان کی شفاعت قبول فرماتا ہے، حالانکہ الٰہی کلمہ حق ہو چکا ہے کہ وہ اس گھر کے آباد کرنے والے ہیں۔ پس ان میں حکم اس رحمت کے لیے کر دیا جاتا ہے جو **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (ہر چیز پر محیط ہے) اور ان انیس رحمتوں کے لیے جو مرکب رحمت (الرحمة المركبة) ہیں۔ پس اس نے انہیں جہنم میں ٹھنڈک پانے والے (المقرور) اور گرمی پانے والے (المحرور) کی نعمت عطا کی، کیونکہ ٹھنڈک پانے والے کی نعمت آگ کے وجود سے ہے اور گرمی پانے والے کی نعمت زمہریر (شدید ٹھنڈک) کے وجود سے ہے۔ پس جہنم اپنی صورت پر باقی رہے گی، جس میں گرمی اور زمہریر ہوگا، اور اس کے اہل اس میں اس کی گرمی اور زمہریر کے ساتھ نعمت پاتے رہیں گے۔ اور اسی لیے اہل جہنم ایک دوسرے سے ملاقات نہیں کریں گے، سوائے ہر طبقے کے اہل کے اپنے طبقے میں۔ پس گرمی پانے والے ایک دوسرے سے ملاقات کریں گے اور ٹھنڈک پانے والے ایک دوسرے سے ملاقات کریں گے، کوئی ٹھنڈک پانے والا گرمی پانے والے سے ملاقات نہیں کرے گا اور نہ کوئی گرمی پانے والا ٹھنڈک پانے والے سے۔ اور اہل جنت سب ایک دوسرے سے ملاقات کریں گے، کیونکہ وہ نعمت کے قبول کرنے میں ایک ہی صفت پر ہیں، کیونکہ وہ یہاں، یعنی دار تکلیف میں، اہل توحید تھے، انہوں نے شرک نہیں کیا، خواہ وہ توحید علم ہو یا توحید ایمان۔ اور اہل نار میں توحد (توحید کی صفت) کی صفت نہیں تھی، اور وہ اہل شرک تھے، اسی لیے ان میں کوئی احدیت (أحدية) کی صفت نہیں تھی جو انہیں مطلقاً نعمت میں شامل کرے بغیر کسی قید کے۔ پس وہ جہنم میں دو فریق ہیں، اور اہل جنت ایک فریق ہیں۔ پس ہر شریک ایک گروہ کے ساتھ منفرد ہو جائے گا۔ اور یہ وہی ثنویہ (دو خداؤں کو ماننے والے) ہیں، ان کے سوا وہاں کوئی نہیں، اور وہ اہل نار ہیں جو اس کے اہل ہیں۔ اور جہاں تک اہل تثلیث (تین خداؤں کو ماننے والے) کا تعلق ہے، تو ان کے لیے نجات کی امید ہے، کیونکہ تثلیث میں فردیت (فردية) موجود ہے، کیونکہ فرد (الفرد) واحد (الواحد) کی صفات میں سے ہے۔ پس وہ توحید ترکیب (توحيد تركيب) والے ہیں، اس لیے امید ہے کہ مرکب رحمت (الرحمة المركبة) انہیں شامل کر لے گی۔ اور اسی لیے انہیں کفار (کافر) کہا گیا، کیونکہ انہوں نے دوسرے کو تیسرے سے چھپا دیا، پس دوسرا واحد (الواحد) اور تیسرے کے درمیان برزخ (البرزخ) کی طرح ہو گیا، پس شاید اہل تثلیث فردانیت (الفردانية) کی حضور میں موحدین (الموحدين) سے ملحق ہو جائیں، وحدانیت (الوحدانية) کی حضور میں نہیں۔ اور اسی طرح ہم نے انہیں کشف معنوی (الکشف المعنوی) میں دیکھا، ہم موحدین اور اہل تثلیث کے درمیان فرق نہیں کر سکے سوائے فردانیت (الفردانية) کی حضور کے۔ کیونکہ میں نے ان کا کوئی سایہ وحدانیت (الوحدانية) میں نہیں دیکھا، اور میں نے ان کے اعیان (أعيان) کو فردیت (الفردية) میں دیکھا، اور میں نے موحدین (الموحدين) کے اعیان کو وحدانیت (الوحدانية) اور فردانیت (الفردانية) میں دیکھا۔ پس میں نے دونوں گروہوں کے درمیان فرق جان لیا۔ اور جہاں تک اہل تثلیث سے زیادہ کا تعلق ہے، تو وہ سب اللہ کی حمد سے جہنم سے نجات پانے والے ہیں، اور ان کی نعمت جنت میں ہے، وہ جہاں چاہیں وہاں ٹھہریں گے، جیسا کہ وہ دنیا میں اسمائے الٰہیہ کی حضور سے جہاں چاہتے تھے، ایک مشروع حق کے ساتھ نازل ہوتے تھے، جیسا کہ وہ وضو کرنے کے بعد جنت کے آٹھ دروازوں میں سے جس دروازے سے چاہتے تھے داخل ہوتے تھے۔ اور جب تم یہ جان چکے ہو،\n\n### [کہ اللہ کی رحمت تمام موجودات کو شامل ہے]\n\nتو جان لو کہ یہ مرکب رحمت (الرحمة المركبة) تمام موجودات کو شامل ہے، اور یہ ایک عام رحمت (رحمة عامة) سے مرکب ہے، اور وہ وہی ہے جو ہر چیز پر محیط ہے، اور ایک خاص رحمت (رحمة خاصة) سے، اور وہ وہ رحمت ہے جس کے ذریعے اللہ نے جسے چنا اور اپنے لیے خاص کیا، جیسے رسول، نبی اور ولی، وہ ممتاز ہوئے۔ اور اس مرکب رحمت (الرحمة المركبة) کے ذریعے اللہ نے کتابوں کو جمع کیا اور ہر کتاب کو سورتوں اور آیات میں نازل کیا۔ پس اس کی آیات میں سے کچھ باقی رہیں جیسے قرآن، اور ہر آیت جو اعجاز (الإعجاز) کے طریقے پر ظاہر ہوئی۔ اور اس کی آیات میں سے کچھ باقی نہیں رہیں، پس ان کا حکم صرف اس پر باقی رہا جو انہیں لایا، پس اس نے دوسرے پر دلالت کی جیسا کہ اس نے خود پر دلالت کی۔ کیونکہ اللہ نے انہیں اس دعوے کی سچائی پر علامت بنایا جو ہر اس شخص نے کیا جس نے اللہ سے قرب کا دعویٰ کیا، خواہ حال کے ذریعے، اگرچہ اس نے دعویٰ نہ کیا ہو، کیونکہ اس پر اپنے رب کی اطاعت کے آثار نظر آتے ہیں، یا دعویٰ کے ذریعے، اس کے اس بات کو زبان سے کہنے کی وجہ سے۔ اور یہ صرف غفلت کی وجہ سے ہوتا ہے، کیونکہ انہیں ان آیات کو چھپانے کا حکم دیا گیا ہے، یعنی اولیاء (الأولياء) کو۔ پس یہ اولیاء (الأولياء) میں منسوخ ہیں اور انبیاء (الأنبياء) اور رسولوں میں محکم ہیں۔ پس اس نے فرمایا: **ما نَنْسَخْ مِنْ آيَةٍ** (ہم کسی آیت کو منسوخ نہیں کرتے) یعنی کسی علامت کو، **أَوْ نُنْسِها** (یا اسے بھلا دیتے ہیں) یعنی ہم اسے چھوڑ دیتے ہیں، یعنی ہم اسے اولیاء (الأولياء) کے لیے آیت کے طور پر چھوڑ دیتے ہیں جیسا کہ وہ انبیاء (الأنبياء) کے لیے آیت تھی، **نَأْتِ بِخَيْرٍ مِنْها** (تو ہم اس سے بہتر لاتے ہیں) مفاضلہ کے باب سے، یعنی دلالت میں اس سے زیادہ، اور وہ اعجاز (الإعجاز) کی آیات ہیں، پس وہ صرف ان کے اصحاب کے لیے ہوتی ہیں یا اس کے لیے جو ان کے اصحاب کی سچائی پر نیابت میں کھڑا ہو۔ پس کسی ولی (ولی) کے لیے قطعی طور پر یہ علامت نہیں ہوتی، اس کے مرتبے کی صحت کے لحاظ سے۔ اور جہاں تک اس کے قول **أَوْ مِثْلِها** (یا اس جیسی) کا تعلق ہے، تو ضمیر منسوخ آیت کی طرف لوٹتا ہے، پس اس میں اعجاز (الإعجاز) کی صفت نہیں تھی، بلکہ وہ پہلی جیسی ہے۔ اور اس آیت کو قرآنی آیات پر محمول کرنا درست نہیں ہے جو احکام میں نازل ہوئیں، پس ایک آیت نے اس حکم کو منسوخ کر دیا جو اس سے پہلے کی آیت میں ثابت کیا گیا تھا، کیونکہ اللہ نے اس آیت کے آخر میں یہ نہیں فرمایا: کیا تم نہیں جانتے کہ اللہ علیم خبیر (عليم خبير) یا حکیم (حكيم) ہے؟ اور ایسے اسماء ہی قرآنی نظم کے لائق ہیں جو احکام کی آیات کے ساتھ وارد ہوا ہے۔ بلکہ اللہ تعالیٰ نے فرمایا: **أَ لَمْ تَعْلَمْ أَنَّ الله عَلَى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ** (کیا تم نہیں جانتے کہ اللہ ہر چیز پر قادر ہے؟) پس اس نے ان آیات کا ارادہ کیا جو انبیاء علیہم السلام کے ہاتھوں پر ان کے رسول ہونے کے دعوے کی سچائی کے لیے ظاہر ہوئیں۔ پس ان میں سے کچھ کو اس نے قیامت تک کے لیے آیت کے طور پر چھوڑ دیا جیسے قرآن، اور کچھ کو اٹھا لیا اور وہ قیامت تک ظاہر نہیں ہوں گی۔ فلما جمع اللہ بهذه الرحمة المركبة القرآن في الكتب لا في الصدور فإنه في الصدور قرآن وفي اللسان كلام وفي المصاحف كتاب وضع ذلك الاسم المفصل عن أمر المدبر فإنه متقدم عليه بالرتبة فلهذا له الحكم في التفصيل بالقوة وللمفصل بالفعل ومنزل الرحمة رحب واسع المجال فيه وكيف لا يتسع وقد وَسِعَتْ كُلَّ شَيْ‏ءٍ وهذا القدر كاف فيما يقع به المنفعة للسامعين من الناس فذكرنا حكمها في الدارين وما يعود منها علينا وهو الغرض المقصود وفي هذا المنزل معرفة منازل الرحمة المركبة وإلى كم تنتهي منازلها والمنزل الذي أكدت فيه والمنزل الذي لم تؤكد فيه وعلى كم من درج وقع التوكيد فيها وفيه علم ما لا يعلم إلا من طريق الخبر الإلهي وعلم الإبانة عن مقام الجمع كالصلاة الجامعة بين الله والعبد في قراءة فاتحة الكتاب ومن هنا يؤخذ الدليل بفرضيتها على المصلي في الصلاة فمن لم يقرأها في الصلاة فما صلى الصلاة التي قسمها الله بينه وبين عبده فإنه ما قال قسمت الفاتحة وإنما قال قسمت الصلاة بالألف واللام اللتين للعهد والتعريف فلما فسر الصلاة المعهودة بالتقسيم جعل محل القسمة قراءة الفاتحة وهذا أقوى دليل يوجد في فرض قراءة الحمد في الصلاة وفيه علم تأثير الرحمة المركبة في العالم المحمدي خاصة وفيه علم تنزيل المعاني منزلة الأشخاص وفيه علم التراجم وفيه علم الطائفة التي سمعت وقيل فيها إنها لم تسمع مع وجود الفهم فيما سمعت فما الذي نفى عنها وما الذي أبقى لها وفيه علم الحجب الكونية المظلمة والظلمانية ومن هو أهل كل حجاب وعمن حجب من حجب هل حجب عن سعادته أو عن مشاهدة ربه أو عن مشاهدة مقام رسوله وفيه علم اجتراء الكون على الله وفيه علم اللطف الإلهي بالمعاندين الرادين لأوامره المنازعين لناصريه وفيه علم ما شيب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم الذي ذكره في سورة هود وأخواتها وفيه علم طلب السر الإلهي وفيه علم الإحاطة بما لا يتناهى وفيه علم الجزاء الذي هو على غير الوفاق الزماني فإن مدد الأعمال التي تطلب الأجور متناهية والأجر عليها غير متناه فما هو الجزاء الوفاق من غير الوفاق وفيه علم الإنكار والإقرار والتقرير والتوبيخ وما صفته وأين محله وفيه علم الخلق الجسمي والجسماني ومراتب الخلق وكم له من المقدار الزماني وفيه علم المراتب المضاف إليها الرب وفيه علم القصد الإلهي وفيه علم موضع الأجوبة التي تكون بحكم المطابقة عند سؤال السائل وفيه علم مرتبة العاقل وشرفه على العالم إذا كان عالما فإن العاقل إذا رأى ما لا بد له منه بادر إليه وغير العاقل لا يفعل ذلك وفيه علم من خلق لأمر واحد ومن خلق لأمرين فصاعدا ومن وفى بما خلق له ومن لم يوف بما خلق له وفيه علم سعادة من استكبر بحق ممن استكبر بنفسه كإبليس ومن شاء الله وفيه علم تقرير المناسبة بينه وبين خلقه وأين هذا التقرير من لَيْسَ كَمِثْلِهِ شَيْءٌ ومثل ما جاء في الخبر لله أشد فرحا بتوبة عبده من رجل في أرض فلاة الحديث وقوله تعالى أَ وَلَمْ يَرَوْا أَنَّ الله الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وفيه علم المفاضلة وأصنافها ومحلها وفيه علم الاختيار الكوني وأنه مجبور في اختياره وهل له مستند إلهي في جبره في اختياره أم لا وقوله فيسبق عليه الكتاب وقوله تعالى ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وقوله لا تَبْدِيلَ لِخَلْقِ الله هل معناه إنما التبديل لله ليس للخلق تبديل أو لا تبديل لخلق الله من كونه أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ وفيه علم حكمة الأخذ الإلهي جزاء هل يعم أو يؤلم ابتداء من غير جزاء كإيلام البري‏ء والصغير فهل هو كما قاله القائل أو ليس الأمر كذلك وإنما هو بري‏ء في ظاهر الأمر مما نسب إليه وما هو بري‏ء عند الله من أمر آخر وقع منه في حق حيوان أو ما لا يعلمه إلا الله والمبتلى أن تذكره فلا يكون على هذا الأخذ أبدا بل له جزء ابتداء وإنما قاله من قاله بنسبة خاصة رأى الأخذ عندها مع براءة المأخوذ مما نسب إليه من تلك النسبة الخاصة ولم يكن عند الله الأخذ إلا من أمر عمله استحق به هذه العقوبة فانتظر انقضاء زمان المهملة فانقضى عند دعوى عليه غير صادقة هو منها بري‏ء فأخذ عندها وإنما كان الأخذ بما تقدم فقيل هذا الأخذ وهو بري‏ء مما نسب إليه فصدقوا أنه بري‏ء ولم يصدقوا في أنه أخذ من أجل تلك الدعوى عليه وهو من علم المكاشفة والاعتبار والمكاشفة في تحصيل هذا العلم أتم لأنه يعين لك الكشف العلة على خصوصها والاعتبار يجملها لك من غير تعيين أو يخرج لها عللا محتملة لا يدري ما أوجب ذلك الأخذ منها فهذا الفرق بين أهل الاعتبار والكشف وفيه علم إلحاق الله بصفة المتقين حتى كان وليهم فإنه ولي المؤمنين لأنه مؤمن وهو ولي المتقين فمن أين يوصف الحق بأنه متق وفيه علم من أين أعطى من أعطى العلم بنطق العالم من غير جهة الخبر فإن الخبر تقليد وفيه علم تأثير الأحوال في أصحابها عند الله وفيه علم ترك الأدب لما يرجى في ذلك من نيل الغرض المقصود وسواء كان محمودا أو مذموما لأنه ما كل غرض محمود ولا كل عرض مذموم وفيه علم تغير الأحوال لتغير الوارد وفيه علم المؤاخاة بين الملائكة والناس الصلحاء منهم وفيه علم أين ينزل أهل الله يوم القيامة وفي الجنان وأي اسم يصحبهم من الأسماء الإلهية وفيه علم توقف الأسماء الإلهية بعضها على بعض وأنها تعطي بالمجموع أمرا لا يكون يعطيه فرد فرد من ذلك المجموع وفيه علم ما تنتجه السياسة الحكمية التي تقضي بها العقول وأنها في ذلك على بصيرة من حيث لا تشعر أعطتها ذلك تجربتها النفوس وما صفة من يقول بهذا العلم وفيه علم الميل لم يميل ولم يمال وفيه علم النظر في الأولى فالأولى وفيه علم الأعواض وهو إذا اعتاص عليك أمر تعوضت عنه بأمر يقوم مقامه فيما تريد إما موازنة سواء وإما أزيد بقليل أو أنقص منه بقليل بحيث إنه لا يؤثر في المطلوب أثرا يخرجه عن نيل غرضه بالكلية وهل في الوجود من لا عوض له إذا فقد أم لا وفيه علم تمييز الرجال بالأحوال وفيه علم تقاسيم الأوامر الإلهية التي تقسمها قرائن الأحوال وما حكم الأمر إذا تعرى عن قرائن الأحوال هل حكمه الوجوب أم لا أو التوقف وهل تعريه عن قرائن الأحوال قرينة حال عدمية تعطيه الوجوب وهل عندنا قرينة حال تعطي الوجوب للأمر وفيه علم وصف العدم بأوصاف الوجود من الانتقال من حال إلى حال مع كونه عدما لا يزول عن هذا الوصف وفيه علم من أين قدم الله في نعته نفسه في كلامه بالرحمة على الأخذ ولم يفعل ذلك في صفة الكون فإنه قد قدم في صفة الكون صفة أهل المقت على صفة أهل السعادة كما وقع في سورة الغاشية وأمثالها وهل جاء مثل هذا ليفرق بين الخلق والحق أم لا وفيه علم الوجهين في الأشياء فما من شي‏ء إلا وفيه نفع بوجه وضرر بوجه أي شي‏ء كان إذا اعتبرته ووزنته وجدت الأمر كما قلنا فليس لشي‏ء في الوجود وجه واحد أبدا أعظمها وأرفعها نور الله به ظهرت الأشياء من خلف الحجب ولو شال الحجب لأحرقت ما أوجدته فهي الموجدة المعدمة وكذا نزول القرآن له وجه نفع في المؤمن فإنه يزيد به إيمانا وفيه وجه ضرر للكافر لأنه يزيد رجسا إلى رجسه قال تعالى **يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً** (وہ اس کے ذریعے بہت سے لوگوں کو گمراہ کرتا ہے اور بہت سے لوگوں کو ہدایت دیتا ہے) ثم من رحمته بخلقه أن قال **وما يُضِلُّ به إِلَّا الْفاسِقِينَ** (اور وہ اس کے ذریعے صرف فاسقوں کو گمراہ کرتا ہے) فأعطانا العلامة فمن وجد في نفسه تلك العلامة علم أنه من أهل الضلال وفيه علم البعد الإلهي والقرب الإلهي من السعداء والأشقياء والقرب الكوني والبعد الكوني هل هو على موازنة القرب والبعد الإلهي أو لهذا حكم ولهذا حكم وكذلك هو وفيه علم من علمه علم أنه ليس لله من أعمال العبد شي‏ء وفيه علم ما هو العلم وفيه علم ما يوجب السامة والملل ومن يتصف بهما من العالم ممن لا يتصف بهما مع كون الحق قد وصف نفسه بالملل إذ أمل عبده من الخير الذي يكون عليه أو الشر سواء وفيه علم ما لا ينفع من الظنون بالخير عند الله وما ينفع منها وفيه علم أسباب رجعة الكون إلى الله في الدنيا وفيه علم إن الحق هو عين الأشياء بما هو عين الأشياء هل بنفسه أو بشهوده أو بإحاطته وفيه علم ما هو الحق وحكم هذا الاسم حيث ورد هل تختلف أحكامه أو هو عين واحدة في كل موضع ورد فإن الناس تفرقوا في ذلك فرقا والله **يَقُولُ الْحَقَّ** (حق کہتا ہے) وهُوَ **يَهْدِي السَّبِيلَ** (اور وہ راستہ دکھاتا ہے) **وَيَهْدِي مَنْ يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ** (اور جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے)۔",
    "fa": "باب سیصد و چهل و سوم در معرفت منزل دو راز (سرین) در تفصیل وحی از حضرت ستایش (حمد) پادشاهی که همه از آن اوست.\n\nخداوند آیات خود را تفصیل داد / برای هر خردمندی که دوراندیش است.\nو آن‌ها را برای دل‌هایی که پاک شدند محکم ساخت / و جز راه‌های هدایت را دنبال نکردند.\nو آن که همواره ناطق بوده، سخن گفت / برای گوش‌های ما، در حال طلب و انشاد.\nپس نطق او عقل‌های ما را حیران ساخت / و با نور هدایت آمد، پس هدایت شد.\nبینا به انوار خود، آشکار است / نهایت و آغاز از آن اوست.\n\n### [همانا مدبّر و مفصّل از اسماء الهی هستند]\n\nبدان، خداوند تو را تأیید کند، که دو اسم الهی مدبّر (Al-Mudabbir) و مفصّل (Al-Mufassil) دو سر این منزل هستند که به واردشونده در آن، تمام آنچه را که در بر دارد و شامل می‌شود از علوم الهی، اعم از آنچه اکوان (جهان‌ها) می‌طلبند و آنچه به حق (الحق) تعالی مربوط است، می‌بخشند. و حکم مدبّر در امور، احکام آن‌ها در حضرت جمع و شهود (الشهود) و اعطای آنچه سزاوار آن هستند، می‌باشد. و این همه پیش از هستی (الوجود) آن‌ها در اعیانشان است، در حالی که برای او موجودند. پس هنگامی که مدبّر آن‌ها را محکم ساخت، چنان که ذکر کردیم، مفصّل آن‌ها را در دست می‌گیرد. و این اسم مخصوص مراتب است، پس هر کَوْن و امری را در مرتبه و منزلت خود فرود می‌آورد، مانند امیر مجلس نزد سلطان.\n\nسپس، مدبّر هنگامی که خداوند دو رحمت را آفرید، که آن‌ها اولین خلقی هستند که خداوند آفرید، یکی از آن دو رحمت بسیط (ساده) است و دیگری رحمت مرکب (پیچیده). پس با رحمت بسیط، بر تمام آنچه خداوند از بسائط آفرید، رحم کرد و با رحمت مرکب، بر تمام آنچه خداوند از مرکبات آفرید، رحم کرد. و برای رحمت مرکب سه منزل قرار داد، زیرا مرکب دارای دو طرف و یک واسطه است، و واسطه عین برزخی است که میان دو طرف قرار دارد تا از هم متمایز شوند. پس بر هر مرحوم (مورد رحمت واقع شده) از مرکبات، با رحمت مرکب از این منازل، رحم می‌کند. پس با رحمت مرکب اول، اجزای اجسام را به یکدیگر ضمیمه کرد تا اعیان آن‌ها به صورت‌های قائم آشکار شدند. و با رحمت مرکب دوم از منزل دوم، معانی، صفات، اخلاق و علوم را در نفس ناطقه و نفس حیوانی حامل قوای حسی ترکیب کرد. و با رحمت مرکب سوم، نفوس ناطقه را به تدبیر اجسام ضمیمه کرد، که این ترکیب روح و جسم است. و این نوع از ترکیب است که به مرگ متصف می‌شود.\n\nپس مدبّر این نفوس را از ابدانشان با توجه نفخ الهی بر آن‌ها از روح منسوب به حق تعالی، آشکار ساخت. سپس مدبّر آن‌ها را با جسمی که از آن متولد شده‌اند ترکیب کرد، و این ترکیب، ترکیب اختیار است. اگر ترکیب استحقاق بود، با مرگ از آن جدا نمی‌شد. و آن را مدبّر جسد برزخی دیگری قرار داد و این را به خاک ملحق ساخت. سپس برای او نشأه (آفرینش) دیگری ایجاد می‌کند که در آخرت او را در آن ترکیب می‌نماید. پس چون مرکب‌ها متفاوت شدند، دانستیم که این جسم معینی که مادر این نفس ناطقه متولد شده از آن است، به حکم استحقاق مدبّر آن نیست، زیرا تدبیرش به دیگری منتقل می‌شود. بلکه حقی که جسم متولد شده از آن بر این نفس دارد این است که تا زمانی که مدبّر آن است، جوارحش را جز در طاعت حق تعالی و در مکان‌ها و احوالی که خداوند بر زبان شارع برای آن معین کرده است، حرکت ندهد. این چیزی است که این جسم به دلیل حق ولادتی که بر نفس دارد، از آن مستحق است. پس برخی از نفوس، فرزند نیکوکارند که به والدین خود گوش می‌دهند و اطاعت می‌کنند، و در رضای آن‌ها رضای خداست. خداوند عز و جل فرمود: أَنِ اشْكُرْ لِي (که از وجه خاص است) وَلِوالِدَيْكَ (که از وجه سببی است). و برخی از نفوس، فرزند عاق هستند که نه می‌شنوند و نه اطاعت می‌کنند. پس جسم، نفس را جز به خیر امر نمی‌کند، و به همین دلیل پوست‌های جسم و تمام جوارحش در روز قیامت بر فرزندش شهادت می‌دهند، زیرا این فرزند آن‌ها را مقهور ساخت و به هر جا که میل داشت، صرف کرد.\n\nو خداوند این رحمت مرکب را بر اجزای معلومی تقسیم کرد. ششصد جزء از آن را به جبرئیل داد که خداوند با آن بر اهل بهشت رحم می‌کند، و نوزده جزء را در دست خود قرار داد که با این اجزاء بر اهل آتش که اهل آن هستند، رحم می‌کند. با این اجزاء، فرشتگان عذاب را که نوزده نفرند، دفع می‌کند، چنان که حق تعالی فرمود: عَلَيْها تِسْعَةَ عَشَرَ (بر آن نوزده [نگهبان] است). و اما صد رحمتی که خداوند آفرید، یک رحمت از آن را در دنیا قرار داد که با آن بندگانش را روزی می‌دهد، اعم از کافر و مؤمن، عاصی و مطیع. و با آن تمام حیوانات بر فرزندانشان مهربانی می‌کنند، و با آن مردم بر یکدیگر رحم می‌کنند و با هم عطوفت می‌ورزند، چنان که خداوند فرمود: إِنَّ الْمُؤْمِنُونَ بَعْضُهُمْ أَوْلِياءُ بَعْضٍ (همانا مؤمنان برخی دوستدار برخی دیگرند) و الظَّالِمِينَ بَعْضُهُمْ أَوْلِياءُ بَعْضٍ (و ستمکاران برخی دوستدار برخی دیگرند) و منافقین برخی دوستدار برخی دیگرند. همه این‌ها ثمره این رحمت است. پس چون در آخرت، روز قیامت فرا رسد، این رحمت را به نود و نه رحمت ذخیره شده نزد خود ضمیمه می‌کند، و با آن بر بندگانش به تدریج و ترتیب زمانی رحم می‌نماید تا با این تأخیر، مراتب شفاعت‌کنندگان و عنایت خداوند به آن‌ها و تمایزشان بر دیگران آشکار شود.\n\nپس هنگامی که در آتش جز اهل آن که در آن مقیم‌اند و خروجی برایشان نیست، باقی نماندند، و فرشتگان عذاب نوزده‌گانه خواستند اهل آتش را عذاب کنند، نوزده فرشته از رحمت مرکب تجسد می‌یابند و میان فرشتگان عذاب و اهل آتش حائل می‌شوند و در مقابل آن‌ها می‌ایستند. و رحمت وَسِعَتْ كُلَّ شَيْءٍ (که همه چیز را فرا گرفته است) آن‌ها را یاری می‌دهد. زیرا فرشتگان عذاب نیز مانند سایر اشیاء، رحمت آن‌ها را فرا گرفته است. پس آنچه آن‌ها را فرا گرفته، مانع می‌شود که در برابر این رحمت مرکب مقاومت کنند. و آنچه در ابتدا آن‌ها را یاری می‌داد، غضب خداوند بود که از به خشم آوردن مخالفان ظاهر شد. پس هنگامی که مجلس محاکمه پایان یافت و حق (الحق) به کسانی که امر شده بود، دستور داد به زندان بروند، که همان جهنم است، چنان که فرمود: وَجَعَلْنا جَهَنَّمَ لِلْكافِرِينَ حَصِيراً (و جهنم را برای کافران زندانی قرار دادیم)، یعنی زندان، زیرا محصور (در حصار قرار گرفته) زندانی است و از تصرف منع شده است. برخلاف اهل بهشت که می‌توانند در آن هر جا که بخواهند منزل گزینند، اما اهل آتش چنین نیستند. و این از لطف پنهان الهی نسبت به بندگانش است. اگر به آن‌ها اجازه می‌داد که در آتش هر جا که بخواهند منزل گزینند، قرار و آرام نمی‌گرفتند و در طلب فرار از عذاب، هرگاه آن را احساس می‌کردند، به امید اینکه در مکان دیگری از آن آسایشی یابند، می‌کوشیدند. در حالی که در وقت عذاب، آسایشی در آن نیست. پس هیچ نوعی از عذاب در جهنم باقی نمی‌ماند مگر اینکه آن را می‌چشیدند. و عذاب مستمر (همراه) آسان‌تر از عذاب تجدیدشونده است، و نعمت نیز چنین است. به همین دلیل خداوند پوست‌های آن‌ها را در آتش هنگامی که پخته شد، عوض می‌کند تا لِيَذُوقُوا الْعَذابَ (عذاب را بچشند). پس زمانی بر آن‌ها می‌گذرد که در آن عذاب را به صورت مستمر می‌چشند تا پوست‌ها پخته شوند، و در آن هنگام با تبدیل، عذاب جدیدی بر آن‌ها تجدید می‌شود. پس اگر می‌توانستند در جهنم هر جا که بخواهند منزل گزینند، تا پخته شدن پوست‌هایشان قرار نمی‌گرفتند، بلکه در هر مکانی که منتقل می‌شدند، عذاب جدیدی را می‌چشیدند تا پخته شدن حاصل شود. پس آن انتقال در عذابشان شدیدتر می‌شد. بنابراین خداوند بر آن‌ها رحم کرد از جایی که نمی‌دانند، همان‌گونه که با آن‌ها مکر کرد از جایی که نمی‌دانند.\n\nپس این‌ها هفتصد و نوزده رحمت هستند. صد رحمت از آن‌ها در دست خداست که هیچ یک از خلق خدا در آن تصرف نکرده است و آن را مخصوص خود گردانیده است. خداوند با آن بر بندگانش رحم می‌کند، با برداشته شدن واسطه‌ها، بلکه مستقیماً از او به مرحوم (مورد رحمت) می‌رسد. و این صد رحمت به تعداد اسماء الهی، یعنی نود و نه اسم احصاء، می‌باشد، یک رحمت برای هر اسم از این صد رحمت که در دست خداست و هیچ مخلوقی از آن آگاهی ندارد. و تمام‌کننده صد، رحمتی است که به او منسوب است و همه چیز را فرا گرفته است. پس با این صد رحمت به درجات بهشت که صد درجه است، نظر می‌شود. و با آن، پس از انقضای زمان استحقاق عذاب، به درکات آتش که صد درک است و هر درکی مقابل یک درجه از بهشت است، نظر می‌شود. پس با این رحمت واسعه، آن نوزده رحمت که در آتش با فرشتگان عذاب مقاومت می‌کنند، تأیید می‌شوند. و آن فرشتگان (عذاب) را نیز رحمت فرا گرفته است، پس در نفوس خود نسبت به اهل آتش رحمتی می‌یابند، زیرا می‌بینند که خداوند در غیر صورت غضبی که آن‌ها را به انتقام گرفتن برای خدا از دشمنان تحریک کرده بود، تجلی (التجلی) کرده است. پس نزد خداوند در حق اهل آتشی که از آن خارج نمی‌شوند، شفاعت می‌کنند. پس بعد از آنکه علیه آن‌ها بودند، به نفع آن‌ها می‌شوند. پس خداوند شفاعت آن‌ها را در مورد ایشان می‌پذیرد، در حالی که کلمه الهی محقق شده است که آن‌ها آبادکنندگان آن سرا هستند. پس حکم در مورد آن‌ها را به رحمتی که وَسِعَتْ كُلَّ شَيْءٍ (همه چیز را فرا گرفته است) و به این نوزده رحمت که همان رحمت مرکب است، واگذار می‌کند. پس در جهنم به آن‌ها نعمت مقْرور (سرمایی) و مَحْرور (گرمایی) می‌دهد، زیرا نعمت مقْرور به وجود آتش و نعمت مَحْرور به وجود زمهریر (سرمای شدید) است. پس جهنم بر صورت خود باقی می‌ماند، دارای گرما و زمهریر، و اهل آن در آن با گرما و زمهریرش متنعم می‌مانند. و به همین دلیل اهل جهنم جز اهل هر طبقه در طبقه خود، با یکدیگر دیدار نمی‌کنند. پس محرورون (اهل گرما) با یکدیگر و مقرورون (اهل سرما) با یکدیگر دیدار می‌کنند. مقرور به دیدار محرور نمی‌رود و محرور به دیدار مقرور نمی‌رود. و اهل بهشت همگی با یکدیگر دیدار می‌کنند، زیرا در پذیرش نعمت بر یک صفت واحد هستند، چون در اینجا، یعنی در دار تکلیف، اهل توحید بودند و شرک نورزیدند، چه توحید علم و چه توحید ایمان. اما اهل آتش صفت توحد نداشتند و اهل شرک بودند. به همین دلیل صفت احدیتی که آن‌ها را به طور مطلق و بدون قید در نعمت فرا گیرد، برایشان وجود نداشت. پس آن‌ها در جهنم دو گروه هستند. و اهل بهشت یک گروه واحدند. پس هر شریکی با طایفه‌ای منفرد می‌شود. و این‌ها همان ثنویه (دوگانه‌پرستان) هستند و جز آن‌ها کسی نیست، و آن‌ها اهل آتشی هستند که اهل آنند. و اما اهل تثلیث (سه‌گانه‌پرستان)، امید رهایی برایشان هست، زیرا در تثلیث، فردیت وجود دارد، چون فرد از نعت‌های واحد است. پس آن‌ها موحدان توحید ترکیب هستند، و امید است که رحمت مرکب آن‌ها را فرا گیرد. و به همین دلیل کافر نامیده شدند، زیرا دوم را با سوم پوشاندند، پس دوم میان واحد و سوم مانند برزخ شد. پس شاید اهل تثلیث در حضرت فردانیت به موحدان ملحق شوند، نه در حضرت وحدانیت. و ما آن‌ها را در کشف (الکشف) معنوی این‌گونه دیدیم که نتوانستیم میان موحدان و اهل تثلیث تمایزی قائل شویم مگر در حضرت فردانیت. زیرا من برای آن‌ها در وحدانیت سایه‌ای ندیدم، اما اعیانشان را در فردیت دیدم، و اعیان موحدان را در وحدانیت و فردانیت دیدم. پس تفاوت میان دو طایفه را دانستم. و اما کسانی که بر اهل تثلیث افزون باشند، همگی به حمدالله از جهنم نجات می‌یابند و نعمتشان در بهشت است، و در آن هر جا که بخواهند منزل می‌گزینند، همان‌گونه که در دنیا از حضرات اسماء الهی هر جا که می‌خواستند، به وجه حق مشروع برایشان، فرود می‌آمدند، چنان که وقتی وضو می‌گرفتند، از هر دری از درهای هشت‌گانه بهشت که می‌خواستند، وارد می‌شدند. و چون این را دانستی،\n\n### [همانا رحمت خداوند همه موجودات را فرا می‌گیرد]\n\nپس بدان که این رحمت مرکب، همه موجودات را فرا می‌گیرد و آن مرکب از رحمت عامه است که همه چیز را فرا گرفته است، و از رحمت خاصه است که با آن کسانی که خداوند آن‌ها را برگزیده و برای خود ساخته است، از رسول و نبی و ولی، متمایز می‌شوند. و با این رحمت مرکب، خداوند کتاب‌ها را جمع کرد و هر کتابی را سوره‌ها و آیاتی نازل کرد. برخی از آیاتش باقی ماندند، مانند قرآن، و هر آیه‌ای که از طریق اعجاز ظاهر شد. و برخی از آیاتش باقی نماندند، و حکم آن‌ها محدود به کسی ماند که آن را آورد، پس بر غیر خود دلالت کرد، همان‌گونه که بر خود دلالت کرد. زیرا خداوند آن را نشانه‌ای بر صدق ادعای هر یک از کسانی قرار داد که ادعای قرب به خدا کردند، یا به حال (اگرچه به زبان ادعا نکرد) به دلیل آثاری از طاعت پروردگارش که بر او دیده می‌شود، و یا به ادعا از حیث نطق به آن. و این (نطق به ادعا) جز از روی غفلت واقع نمی‌شود، زیرا آن‌ها (اولیاء) مأمور به پوشاندن این آیات هستند.\n\nپس این آیات در اولیاء منسوخ شده و در انبیاء و رسولان محکم است. پس فرمود: ما نَنْسَخْ مِنْ آيَةٍ (هر نشانه‌ای را که نسخ کنیم)، یعنی از علامتی، أَوْ نُنْسِها (یا آن را به فراموشی بسپاریم)، یعنی یا آن را ترک کنیم، یعنی آن را به عنوان آیه برای اولیاء ترک کنیم، همان‌گونه که آیه برای انبیاء بود، نَأْتِ بِخَيْرٍ مِنْها (بهتر از آن را می‌آوریم)، از باب مفاضله، یعنی چیزی که در دلالت بیشتر از آن است، و آن آیات اعجاز است که جز برای صاحبانش یا کسی که به نیابت از صدق صاحبانش در آن قیام کند، نخواهد بود. پس هرگز این علامت برای ولی از حیث صحت مرتبه‌اش نخواهد بود. و اما قول او: أَوْ مِثْلِها (یا مانند آن)، ضمیر به آیه منسوخ برمی‌گردد که صفت اعجاز نداشت، بلکه مانند اولی است. و صحیح نیست که این آیه را بر آیات قرآن که در احکام نازل شده‌اند حمل کنیم، به طوری که حکمی که در آیه قبلی ثابت شده بود، با آیه‌ای نسخ شود. زیرا خداوند در آخر این آیه نفرموده است: «آیا نمی‌دانستی که خداوند دانا و آگاه یا حکیم است؟» و چنین اسم‌هایی شایسته نظم قرآن وارد شده در آیات احکام است. بلکه خداوند تعالی فرمود: أَ لَمْ تَعْلَمْ أَنَّ اللهَ عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ (آیا نمی‌دانستی که خداوند بر هر چیزی تواناست؟). پس منظور او آیاتی بود که بر دست انبیاء علیهم السلام برای صدق ادعایشان مبنی بر اینکه رسولان خدا هستند، ظاهر شد. برخی از آن‌ها را به عنوان آیه تا روز قیامت باقی گذاشت، مانند قرآن، و برخی را برداشت و تا روز قیامت ظاهر نشد.\n\nپس هنگامی که خداوند با این رحمت مرکب، قرآن را در کتاب‌ها جمع کرد، نه در سینه‌ها (زیرا در سینه‌ها قرآن است، در زبان کلام است و در مصحف‌ها کتاب است)، آن اسم مفصّل (Al-Mufassil) را به امر مدبّر (Al-Mudabbir) قرار داد، زیرا مدبّر از نظر رتبه بر او مقدم است. به همین دلیل، حکم در تفضیل بالقوه از آن مدبّر است و بالفعل از آن مفصّل. و منزل رحمت، گشاده و وسیع‌المجال است. و چگونه وسیع نباشد در حالی که وَسِعَتْ كُلَّ شَيْءٍ (همه چیز را فرا گرفته است). و این مقدار برای آنچه که برای شنوندگان از مردم منفعت دارد، کافی است. پس حکم آن را در دو سرا (دنیا و آخرت) و آنچه از آن به ما باز می‌گردد، که همان غرض مقصود است، ذکر کردیم. و در این منزل، معرفت منازل رحمت مرکب و اینکه منازل آن به کجا ختم می‌شود، و منزلی که در آن تأکید شده و منزلی که در آن تأکید نشده، و بر چند درجه تأکید در آن واقع شده است، وجود دارد.\n\nو در آن، علم آنچه جز از طریق خبر الهی دانسته نمی‌شود، و علم آشکارسازی مقام جمع، مانند نماز جامع میان خدا و بنده در قرائت فاتحة الکتاب، وجود دارد. و از اینجا دلیل بر فرضیت آن بر نمازگزار در نماز گرفته می‌شود. پس کسی که آن را در نماز نخواند، نمازی را که خداوند میان خود و بنده‌اش تقسیم کرده، به جا نیاورده است. زیرا او نفرموده است: «فاتحه را تقسیم کردم»، بلکه فرمود: «نماز را تقسیم کردم»، با الف و لامی که برای عهد و تعریف است. پس هنگامی که نماز معهود را به تقسیم تفسیر کرد، محل تقسیم را قرائت فاتحه قرار داد. و این قوی‌ترین دلیلی است که در فرض بودن قرائت حمد در نماز یافت می‌شود. و در آن، علم تأثیر رحمت مرکب به ویژه در عالم محمدی، و علم تنزیل معانی به منزله اشخاص، و علم تراجم (ترجمه‌ها)، و علم طایفه‌ای که شنیدند و درباره‌شان گفته شد که نشنیدند، با وجود فهم در آنچه شنیدند، وجود دارد. پس چه چیزی از آن‌ها نفی شد و چه چیزی برایشان باقی ماند؟ و در آن، علم حجاب‌های کونی تاریک و ظلمانی، و اینکه چه کسی اهل هر حجابی است، و کسی که محجوب شده، از چه چیزی محجوب شده است؟ آیا از سعادتش، یا از مشاهده پروردگارش، یا از مشاهده مقام رسولش؟ و در آن، علم جسارت کَوْن بر خدا، و علم لطف الهی نسبت به معاندان و ردکنندگان اوامر او و ستیزه‌جویان با یاری‌دهندگان او، وجود دارد. و در آن، علم آنچه رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) را پیر کرد، که در سوره هود و خواهرانش ذکر شده است، و علم طلب راز الهی، و علم احاطه به آنچه پایان نمی‌پذیرد، و علم جزایی که بر غیر وفاق زمانی است، وجود دارد. زیرا مدت‌های اعمالی که پاداش می‌طلبند، متناهی است، اما پاداش بر آن‌ها نامتناهی است. پس جزای وفاق (متناسب) از غیر وفاق چیست؟ و در آن، علم انکار و اقرار و تقریر و توبیخ، و اینکه صفت آن چیست و محل آن کجاست، و علم خلق جسمی و جسمانی و مراتب خلق و مقدار زمانی آن چقدر است، و علم مراتبی که رب (پروردگار) به آن‌ها اضافه می‌شود، و علم قصد الهی، و علم جایگاه پاسخ‌هایی که به حکم مطابقت هنگام سؤال سائل داده می‌شود، و علم مرتبه عاقل و شرافت او بر عالم (دانشمند) اگرچه عالم باشد، وجود دارد. زیرا عاقل هنگامی که آنچه را که برایش ضروری است ببیند، به سوی آن می‌شتابد، و غیر عاقل چنین نمی‌کند.\n\nو در آن، علم کسی که برای یک امر آفریده شده و کسی که برای دو امر یا بیشتر آفریده شده، و کسی که به آنچه برایش آفریده شده وفا کرده و کسی که وفا نکرده، وجود دارد. و در آن، علم سعادت کسی که به حق تکبر ورزیده، در مقابل کسی که به نفس خود تکبر ورزیده، مانند ابلیس و کسی که خدا بخواهد، وجود دارد. و در آن، علم تقریر مناسبت میان او و خلقش، و جایگاه این تقریر نسبت به لَيْسَ كَمِثْلِهِ شَيْءٌ (چیزی مانند او نیست)، و مانند آنچه در خبر آمده است: «لله أشد فرحا بتوبة عبده من رجل في أرض فلاة» (خداوند به توبه بنده‌اش شادمان‌تر است از مردی که در بیابانی [گمشده‌اش را بیابد])، و قول حق تعالی: أَ وَ لَمْ يَرَوْا أَنَّ اللهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً (آیا ندیده‌اند که خدایی که آن‌ها را آفریده، او از آن‌ها نیرومندتر است؟)، وجود دارد. و در آن، علم مفاضله (برتری دادن) و انواع و محل آن، و علم اختیار کونی و اینکه او در اختیار خود مجبور است، و آیا در جبر خود در اختیارش، مستند الهی دارد یا خیر، و قول او: «فَيَسْبِقُ عَلَيْهِ الْكِتابُ» (پس کتاب بر او سبقت می‌گیرد)، و قول حق تعالی: ما يُبَدَّلُ الْقَوْلُ لَدَيَّ (سخن نزد من دگرگون نمی‌شود)، و قول او: لا تَبْدِيلَ لِخَلْقِ الله (هیچ دگرگونی در آفرینش خدا نیست)، آیا معنایش این است که دگرگونی فقط برای خداست و برای خلق دگرگونی نیست، یا دگرگونی برای خلق خدا نیست از این جهت که أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ (به هر چیزی آفرینش آن را داده است)، وجود دارد. و در آن، علم حکمت مؤاخذه الهی به عنوان جزا، آیا عمومی است یا اینکه ابتدا بدون جزا درد و رنج می‌دهد، مانند رنج دادن بی‌گناه و کودک؟ آیا آن‌گونه است که گوینده گفته، یا امر چنین نیست؟ بلکه او در ظاهر امر از آنچه به او نسبت داده شده، بری است، اما نزد خدا از امر دیگری که از او در حق حیوانی یا آنچه جز خدا نمی‌داند، سر زده، بری نیست. و مبتلا (آزمایش شده) را که ذکر کنی، هرگز بر این مؤاخذه نخواهد بود، بلکه برای او جزایی ابتدایی است. و کسی که آن را گفته، به نسبت خاصی گفته است که در آن مؤاخذه را دیده، با وجود برائت مؤاخذه شده از آنچه از آن نسبت خاص به او منسوب شده است. و نزد خدا مؤاخذه‌ای نبوده مگر به خاطر کاری که انجام داده و مستحق این عقوبت شده است. پس منتظر انقضای زمان مهلت بوده، و آن زمان هنگام ادعایی غیر صادقانه علیه او که از آن بری است، به پایان رسیده و در آن هنگام مؤاخذه شده است. و مؤاخذه به خاطر امر پیشین بوده، پس گفته شد که این مؤاخذه در حالی است که او از آنچه به او نسبت داده شده، بری است. پس تصدیق کردند که او بری است، اما تصدیق نکردند که مؤاخذه به خاطر آن ادعا علیه او بوده است. و این از علم مکاشفه (الکشف) و اعتبار است. و مکاشفه در تحصیل این علم کامل‌تر است، زیرا کشف (الکشف) علت را به خصوص برای تو معین می‌کند، در حالی که اعتبار آن را به طور کلی و بدون تعیین برای تو بیان می‌کند، یا برای آن علت‌های محتملی را استخراج می‌کند که دانسته نمی‌شود کدام یک از آن‌ها موجب آن مؤاخذه شده است. پس این تفاوت میان اهل اعتبار و کشف (الکشف) است. و در آن، علم ملحق شدن خداوند به صفت متقین تا جایی که ولی آن‌ها شد، زیرا او ولی مؤمنان است چون مؤمن است، و او ولی متقین است. پس حق (الحق) از کجا به متقی بودن وصف می‌شود؟ و در آن، علم اینکه از کجا به کسی که علم داده شده، علم به نطق عالم داده شده است، بدون جهت خبر، زیرا خبر تقلید است، وجود دارد. و در آن، علم تأثیر احوال در صاحبانشان نزد خدا، و علم ترک ادب به دلیل آنچه در آن از رسیدن به غرض مقصود امید می‌رود، وجود دارد، خواه آن غرض ستوده باشد یا نکوهیده، زیرا هر غرضی ستوده نیست و هر غرضی نکوهیده نیست. و در آن، علم تغییر احوال به دلیل تغییر وارد (الهی)، و علم برادری میان فرشتگان و انسان‌های صالح از میان آن‌ها، و علم اینکه اهل الله در روز قیامت و در بهشت‌ها کجا منزل می‌گزینند و کدام اسم از اسماء الهی با آن‌ها همراه است، و علم توقف اسماء الهی بر یکدیگر و اینکه آن‌ها به صورت مجموع امری را می‌دهند که فرد فرد آن مجموعه نمی‌دهد، وجود دارد. و در آن، علم آنچه سیاست حکمیه که عقول به آن حکم می‌کنند، نتیجه می‌دهد، و اینکه عقول در این امر بر بصیرتی هستند از جایی که نمی‌دانند، و تجربه نفوس آن را به آن‌ها داده است، و صفت کسی که به این علم سخن می‌گوید، وجود دارد. و در آن، علم میل، که نه مایل شده و نه مایل گردانیده شده، و علم نظر در اولی فالأولی (اولویت‌ها)، و علم اعواض (جایگزین‌ها) وجود دارد. و آن این است که اگر امری بر تو دشوار شد، آن را با امری که در آنچه می‌خواهی جایگزین آن شود، عوض می‌کنی، یا به موازنه مساوی، یا کمی بیشتر، یا کمی کمتر، به طوری که در مطلوب تأثیری نگذارد که آن را به کلی از رسیدن به غرضش خارج سازد. و آیا در هستی (الوجود) کسی هست که اگر از دست برود، جایگزینی نداشته باشد یا خیر؟ و در آن، علم تمییز مردان به احوال، و علم تقسیمات اوامر الهی که قرائن احوال آن‌ها را تقسیم می‌کند، و حکم امر هنگامی که از قرائن احوال عاری باشد، آیا حکم آن وجوب است یا خیر، یا توقف؟ و آیا عاری بودن آن از قرائن احوال، قرینه حال عدمی است که به آن وجوب می‌دهد؟ و آیا نزد ما قرینه حالی وجود دارد که به امر وجوب دهد؟ و در آن، علم وصف عدم به اوصاف هستی (الوجود) از انتقال از حالی به حال دیگر، با وجود اینکه عدم است و از این وصف زایل نمی‌شود، وجود دارد. و در آن، علم اینکه خداوند در وصف خود در کلامش، رحمت را بر مؤاخذه مقدم داشته است، اما در صفت کَوْن چنین نکرده است، زیرا در صفت کَوْن، صفت اهل مقت (خشم) را بر صفت اهل سعادت مقدم داشته است، چنان که در سوره غاشیه و امثال آن واقع شده است. و آیا چنین چیزی آمده است تا میان خلق و حق (الحق) تفاوت بگذارد یا خیر؟ و در آن، علم دو وجهی بودن اشیاء وجود دارد. پس هیچ چیزی نیست مگر اینکه از یک وجه در آن نفع و از وجهی دیگر ضرر است. هر چیزی که باشد، اگر آن را در نظر بگیری و بسنجی، امر را همان‌گونه که گفتیم خواهی یافت. پس هیچ چیزی در هستی (الوجود) هرگز یک وجه ندارد. بزرگترین و والاترین آن‌ها نور خداست که اشیاء به واسطه آن از پشت حجاب‌ها ظاهر شدند. و اگر حجاب‌ها را برمی‌داشت، آنچه را که ایجاد کرده بود، می‌سوزاند. پس اوست ایجادکننده و معدوم‌کننده. و همچنین نزول قرآن، برای مؤمن وجه نفع دارد، زیرا ایمان او را با آن افزایش می‌دهد، و برای کافر وجه ضرر دارد، زیرا پلیدی بر پلیدی او می‌افزاید. حق تعالی فرمود: يُضِلُّ بِهِ كَثِيراً وَيَهْدِي بِهِ كَثِيراً (بسیاری را با آن گمراه می‌کند و بسیاری را با آن هدایت می‌نماید). سپس از رحمت او بر خلقش این است که فرمود: وَما يُضِلُّ بِهِ إِلَّا الْفاسِقِينَ (و جز فاسقان را با آن گمراه نمی‌کند). پس علامت را به ما داد. پس هر کس آن علامت را در خود بیابد، می‌داند که از اهل ضلالت است. و در آن، علم بُعد الهی و قرب الهی از سعادتمندان و شقاوتمندان، و قرب کونی و بُعد کونی وجود دارد. آیا این‌ها بر موازنه قرب و بُعد الهی هستند یا این یکی حکمی دارد و آن دیگری حکمی؟ و امر چنین است. و در آن، علم کسی که آن را بداند، می‌داند که برای خدا از اعمال بنده چیزی نیست. و در آن، علم اینکه علم چیست، و علم آنچه موجب خستگی و ملال می‌شود، و اینکه چه کسی از عالَم به آن‌ها متصف می‌شود و چه کسی متصف نمی‌شود، با وجود اینکه حق (الحق) خود را به ملال وصف کرده است، هنگامی که بنده خود را از خیری که بر اوست یا شری که بر اوست، خسته کند، وجود دارد. و در آن، علم ظنونی که به خیر نزد خدا نفع نمی‌رساند و ظنونی که نفع می‌رساند، و علم اسباب بازگشت کَوْن به سوی خدا در دنیا، و علم اینکه آیا حق (الحق) عین اشیاء است به واسطه اینکه عین اشیاء است، آیا به ذات خود یا به شهود (الشهود) خود یا به احاطه خود؟ و در آن، علم اینکه حق (الحق) چیست و حکم این اسم هر جا که وارد شده، آیا احکامش متفاوت است یا در هر موضعی که وارد شده، یک عین واحد است؟ زیرا مردم در این باره به فرقه‌هایی تقسیم شده‌اند. و خداوند يَقُولُ الْحَقَّ (حق را می‌گوید) وَهُوَ يَهْدِي السَّبِيلَ (و او راه را هدایت می‌کند) وَيَهْدِي مَنْ يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ (و هر که را بخواهد به راه راست هدایت می‌نماید)."
  },
  "page_count": 5
}