{
  "id": 235,
  "title": {
    "ar": "الباب الخامس والثلاثون ومائتان في التواجد وهو استدعاء الوجد",
    "en": "Chapter Two Hundred and Thirty-Five: Concerning Induced Ecstasy (التواجد), which is the summoning forth of Ecstasy (الوجد).",
    "ur": "پینتیسواں اور دو سوواں باب: تواجد (وجد کو طلب کرنا) کے بیان میں، اور یہ وجد کو بلانے کا نام ہے۔",
    "fa": "باب دویست و سی و پنجم در باب تواجد (التواجد) و آن عبارت است از طلب کردن وجد (الوجد)."
  },
  "content": {
    "ar": "## «الباب الخامس والثلاثون ومائتان في التواجد وهو استدعاء الوجد»\n\n\n> إن التواجد لا حال فتحمده *** ولا مقام له حكم وسلطان‏\n\n\n> يزري بصاحبه في كل طائفة *** وما له في طريق القوم ميزان‏\n\n\n> بل ذمه القوم لما كان منقصة *** والنقص ما فيه في التحقيق رجحان‏\n\n\n> وكل ما هو فيه من يقوم به *** فإنه كله زور وبهتان‏\n\n\n### [أن التواجد استدعاء الوجد]\n\n\nاعلم أن التواجد استدعاء الوجد لأنه تعمل في تحصيل الوجد فإن ظهر على صاحبه بصورة الوجد فهو كاذب مراء منافق لا حظ له في الطريق ولهذا لم تسلمه الطائفة إلا لمن أعلم الجماعة التي يكون فيها إنه متواجد لا صاحب وجد ولا يسلم له ذلك إلا إذا اتفق أن يعطي الحال بقرينته أن يوافق أهل الوجد في حركاتهم عن إشارة من شيخ يكون له حكم في الجماعة أو حرمة عندهم فإن خرج عن هذه الشروط فلا يجوز له أن يقوم متواجدا ولا أن يظهر عليه من ذلك أثر وكل وجد يكون عن تواجد فليس بوجد فإن من حقيقة الوجد أن يأتي على القلب بغتة يفجأه وهو الهجوم على الحقيقة فالوجد كسب فهو له والتواجد تكسب واكتساب الوجد عن التواجد اكتساب لا كسب وهذه بشرى من الله حيث جعل المخالفة اكتسابا والطاعة كسبا فقال لَها يعني للنفس ما كَسَبَتْ فأوجبه لها وقال في الاكتساب وعَلَيْها ما اكْتَسَبَتْ فما أوجب لها إلا الأخذ بما اكتسبته فالاكتساب ما هو حق لها فتستحقه فتستحق الكسب ولا تستحق الاكتساب والحق لا يعامل إلا بالاستحقاق فالعفو من الله يحكم على الأخذ بالجريمة فالتواجد الذي عند أهل الله إظهار صورة وجد من غير وجد على طريق الموافقة لأهل الوجد مع تعريفه لمن حضر أنه ليس بصاحب وجد لا بد\nمن هذا ومع هذا الصدق فتركه أولى لأن مراعاة حق الله أولى من مراعاة الخلق إذ مراعاة الخلق إن لم تكن عن مراعاة مر الحق بها وإلا فهي مداهنة والمداهنة نعت مذموم لا ينبغي لأهل الله أن تتصف بشي‏ء لا يكون للحق فيه أمر بوجوب إن كان فعلا أو يكون لذلك الفعل نعت إلهي في النعوت فتستند إليه فيه ولو كان مذموما في الخلق فإنه محمود في جانب الحق لظهور الحق به لأمر يقتضيه الحكم فمستنده الإلهي قول نوح لقومه فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ وقول الله إِنَّا نَسِيناكُمْ ... كَما نَسِيتُمْ لِقاءَ يَوْمِكُمْ هذا فوصف نفسه بالنسيان ويظهر حكم مثل هذا المقصود من ألحق به هَلْ ثُوِّبَ الْكُفَّارُ ما كانُوا يَفْعَلُونَ فموضع الاستشهاد من هذا الموافقة في الصورة فانسحب الاسم عليه في الجناب الإلهي كما انسحب عليه في الجناب الكوني ولم يكن الغرض كون ذلك الأمر محمودا أو مذموما وإنما المراد ظهور الموافقة الإلهية فلما رأى أهل الله ظهور الموافقة الإلهية سامحوا في التواجد واشترطوا التعريف لما يعطيه مقام الصدق الذي عليه اعتماد القوم فإن قلت فهذه الموافقة الإلهية والنبوية إنما وقعت في دارين ومجلسين مختلفين والتواجد في مجلس واحد قلنا صدقت فيما ذكرته في عين ما استشهدنا به فنحن ما قصدنا إلا الموافقة فإن أردت حصول الأمر من الجانبين في وقت واحد فذلك موجود في مكر الله بالماكرين من حَيْثُ لا يَشْعُرُونَ فلا يكون ذلك إلا في الدنيا فإنهم في الآخرة يعرفون أن الله مكر بهم في الدنيا بما بسط لهم فيها مما كان فيه هلاكهم فهنا وقع المكر بهم حيث وقع المكر منهم بل في بعض الوقائع أو أكثرها بل كلها إن عين مكرهم هو مكر الله بهم وهُمْ لا يَشْعُرُونَ ولما دخل عمر بن الخطاب على رسول الله صلى الله عليه وسلم فوجده وأبا بكر يبكيان في قضية أسارى بدر فقال لهما عمر بن الخطاب اذكر إلى ما أبكاكما فإن وجدت بكاء بكيت وإن لم أجده تباكيت‏\n\n\nأي أوافقكما في إرسال الدموع والتباكي كالتواجد إظهار صورة من غير حقيقة فهي صورة بلا روح غير أن لها أصلا معتبرا ترجع إليه وهو ما ذكرناه فإن قلت فكيف تعطي الحقائق إظهار حكم معنى في الظاهر من غير وجود ذلك المعنى فيمن ظهر عليه حكمه قلنا هذا موجود في الإلهيات في قوله ولا يَرْضى‏ لِعِبادِهِ الْكُفْرَ وإِنْ تَشْكُرُوا يَرْضَهُ لَكُمْ والرضي إرادة وقد نفى أن يكون مرضيا عنده فقد نفى أن يكون مرادا له فقد ظهر حكم معنى نفاه الحق عن نفسه فكذلك حكم الوجد في التواجد مع نفي الوجد عنه ولمسألة الرضي معنى دقيق ذكرناه في كتاب المعرفة وهو جزء لطيف فلينظر هناك وإنما جئنا به هنا صورة لم نذهب به مذهب التحقيق الذي لنا في الأشياء وإنما أخرجناه مخرج البرهان الجدلي الموضوع لدفع حجة الخصم لا لإقامة البرهان على الحق فالوجد الظاهر في التواجد هو حكم وجد متخيل في نفس المتواجد فهو حكم محقق في حضرة خيالية وقد بينا أن الخيال حضرة وجودية وأن المتخيلات موصوفة بالوجود فما ظهر المتواجد بصورة حكم الوجد إلا لهذا الوجد المتخيل في نفسه فما ظهر إلا عن وجود فله وجه إلى الصدق ولهذا يجب على المتواجد التعريف بتواجده ليعلم السامع من أهل المجلس أن ذلك عن الوجد المتخيل لا عن الوجد القائم بالنفس في غير حضرة الخيال له في والخيال حكم صحيح في الحس كصاحب الصفراء إذا كان في موضع يتخيل السقوط منه فيسقط فهذا سقوط عن تخيل ظهر حكمه في الحس وكذلك المتواجد قد يحكم عليه الوجد المتخيل بحيث أن يفنيه عن الإحساس كما يفنى صاحب الوجد الصحيح ولكن بينهما فرقان في النتيجة قد ذكرناه في شرح ما لا يعول عليه في الطريق فإن نتيجة الوجد الصحيح مجهولة ونتيجة الوجد الخيالي إذا حكم مقيدة معلومة يعلمها صاحبها إن كان من أهل هذا الشأن فإنه ما ينتج له إلا ما يناسب خياله في الوجد وهو معلوم والوجد الصحيح مصادفة من حيث لا يشعر صاحبه فلا يدري بما يأتيه به وقد ذكرنا في التواجد ما فيه غنية والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "## Chapter Two Hundred and Thirty-Five: Concerning Induced Ecstasy (*al-Tawājud*), which is the Summoning of Ecstasy (*al-Wajd*)\n\n> Indeed, Induced Ecstasy (*al-Tawājud*) is not a spiritual state (*ḥāl*) that you should praise,\n> Nor is it a spiritual station (*maqām*) that possesses authority or dominion.\n> It disgraces its practitioner among every group,\n> And it holds no weight in the path of the People [the Sufis].\n> Rather, the People condemned it because it was a deficiency,\n> And deficiency, in verification (*al-taḥqīq*), holds no superiority.\n> And everything that is in it, from the one who performs it,\n> Is entirely falsehood (*zūr*) and deceit (*buhtān*).\n\n### That Induced Ecstasy (*al-Tawājud*) is the Summoning of Ecstasy (*al-Wajd*)\n\nKnow that Induced Ecstasy (*al-Tawājud*) is the summoning of Ecstasy (*al-Wajd*), because it is an effort to achieve *al-Wajd*. If it appears upon its practitioner in the form of *al-Wajd*, then he is a liar, a show-off (*murā'i*), a dissembler (*munāfiq*), having no share in the Path. For this reason, the Sufi community (*al-ṭā'ifa*) only accepts it from one who informs the group he is with that he is merely inducing ecstasy (*mutawājid*), not a possessor of Ecstasy (*ṣāḥib wajd*).\n\nThis is only accepted from him if the spiritual state (*al-ḥāl*) happens to grant him, by its association, the ability to conform to the movements of the People of Ecstasy, based on a signal from a Shaykh who holds authority (*ḥukm*) or respect (*ḥurma*) within the group. If he deviates from these conditions, it is not permissible for him to stand up as one inducing ecstasy nor to show any trace of it.\n\nEvery Ecstasy that results from Induced Ecstasy is not true Ecstasy. For the reality (*ḥaqīqa*) of *al-Wajd* is that it comes upon the heart suddenly, surprising it; it is the assault upon the Reality (*al-Ḥaqīqa*). *Al-Wajd* is acquisition (*kasb*), so it belongs to him [the seeker]. *Al-Tawājud* is seeking acquisition (*takassub*). The acquisition (*iktisāb*) of *Wajd* through *Tawājud* is *iktisāb*, not *kasb*.\n\nAnd this is good news from Allah, where He made transgression (*al-mukhālafa*) *iktisāb* (self-acquired action) and obedience (*al-ṭā'a*) *kasb* (earned action). He said concerning the soul: <<لَها ما كَسَبَتْ>> (It shall have what it has earned) [2:286], thereby making it obligatory *for* the soul. And He said concerning *iktisāb*: <<وعَلَيْها ما اكْتَسَبَتْ>> (And against it is what it has acquired) [2:286], thereby making obligatory upon it only the taking of what it has acquired. *Iktisāb* is not what is inherently due to the soul, so it deserves *kasb* but does not deserve *iktisāb*. The Real (*al-Ḥaqq*) only deals based on desert (*istiḥqāq*). Thus, forgiveness (*al-'afw*) from Allah governs the taking of the crime.\n\nTherefore, *al-Tawājud* among the People of Allah is the manifestation of the form of *Wajd* without the reality of *Wajd*, done in the manner of conforming to the People of *Wajd*, along with informing those present that he is not a possessor of *Wajd*. This is necessary. Yet, despite this sincerity (*ṣidq*), abandoning it is preferable, because observing the right of Allah is preferable to observing the rights of creation (*al-khalq*). For observing the rights of creation, if it is not done through observing what The Real commanded concerning it, then it is flattery (*mudāhana*).\n\nFlattery is a blameworthy characteristic. It is not fitting for the People of Allah to be characterized by anything for which The Real has not issued a command of obligation (if it is an act), or for which that act does not possess a Divine characteristic among the characteristics, so that they may rely upon it—even if it is blameworthy among creation, for it is praiseworthy in the side of The Real, due to the manifestation of The Real through it, for a matter necessitated by the Divine ruling (*al-ḥukm*).\n\nIts Divine basis is the saying of Noah to his people: <<فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ>> (Then indeed, we ridicule you just as you ridicule us) [11:38], and the saying of Allah: <<إِنَّا نَسِيناكُمْ ... كَما نَسِيتُمْ لِقاءَ يَوْمِكُمْ هذا>> (Indeed, We have forgotten you... just as you forgot the meeting of this Day of yours) [45:34]. Thus, He described Himself with forgetfulness (*nisyān*). The ruling of such an intended meaning is manifested by what He attached to it: <<هَلْ ثُوِّبَ الْكُفَّارُ ما كانُوا يَفْعَلُونَ>> (Have the disbelievers been rewarded for what they used to do?) [83:36].\n\nThe point of evidence here is the conformity in form. Thus, the Name was applied to Him in the Divine Presence (*al-Janāb al-Ilāhī*) just as it was applied in the Cosmic Presence (*al-Janāb al-Kawnī*). The purpose was not whether that matter was praiseworthy or blameworthy, but rather the manifestation of Divine conformity. When the People of Allah saw the manifestation of Divine conformity, they permitted *al-Tawājud*, provided they stipulated the declaration [of its nature], due to what the station of Sincerity (*maqām al-Ṣidq*), upon which the People rely, demands.\n\nIf you say: \"This Divine and Prophetic conformity only occurred in two different abodes and two different assemblies, while *al-Tawājud* occurs in a single assembly,\" We reply: \"You are correct in what you mentioned regarding the very thing we used as evidence, for we only intended conformity.\" If you desire the occurrence of the matter from both sides simultaneously, that is found in Allah's plotting (*makr*) against the plotters: <<مِنْ حَيْثُ لا يَشْعُرُونَ>> (from where they perceive not) [7:182]. This only occurs in the world (*al-dunyā*). For in the Hereafter, they will know that Allah plotted against them in the world by expanding for them things that led to their destruction. Thus, the plotting against them occurred where the plotting originated from them. Indeed, in some, or most, or even all instances, their very plotting is Allah's plotting against them, <<وَهُمْ لَا يَشْعُرُونَ>> (while they perceive not) [2:9].\n\nWhen Umar ibn al-Khaṭṭāb entered upon the Messenger of Allah (peace and blessings be upon him) and found him and Abu Bakr weeping concerning the matter of the prisoners of Badr, Umar ibn al-Khaṭṭāb said to them: \"Tell me what makes you weep. If I find cause for weeping, I shall weep, and if I do not find it, I shall induce weeping (*tabākaytu*).\" Meaning: I shall conform to you in shedding tears. And inducing weeping (*al-tabākī*) is like *al-Tawājud*: the manifestation of a form without the reality. It is a form without a spirit, except that it has a recognized origin to which it returns, which is what we have mentioned.\n\nIf you say: \"How can the Realities (*al-Ḥaqā'iq*) grant the manifestation of the ruling (*ḥukm*) of a meaning outwardly, without the existence of that meaning in the one upon whom its ruling appears?\" We reply: \"This exists in the Divine Matters (*al-Ilāhiyyāt*) in His saying: <<وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ>> (And He does not approve of disbelief for His servants) [39:7], and <<وَإِنْ تَشْكُرُوا يَرْضَهُ لَكُمْ>> (But if you are grateful, He approves it for you) [39:7].\" And approval (*al-riḍā*) is Will (*Irāda*). He negated that [disbelief] is approved by Him, thus He negated that it is willed by Him. Therefore, the ruling of a meaning that The Real negated from Himself has appeared. Likewise is the ruling of *al-Wajd* in *al-Tawājud*, despite the negation of *al-Wajd* from it.\n\nThe issue of approval has a subtle meaning that we mentioned in the Book of Gnosis (*Kitāb al-Ma'rifa*), which is a delicate section, so let it be examined there. We only brought it here as a form, not pursuing the path of verification (*taḥqīq*) that we hold regarding things. Rather, we presented it as a dialectical proof (*burhān jadali*) intended to refute the opponent's argument, not to establish proof for The Real.\n\nThus, the *Wajd* that appears in *al-Tawājud* is the ruling of an imagined *Wajd* (*wajd mutakhayyal*) in the soul of the one inducing ecstasy. It is therefore a verified ruling in the Imaginative Presence (*Ḥaḍra Khayāliyya*). We have already explained that Imagination (*al-Khayāl*) is a Presence of Existence (*Ḥaḍra Wujūdiyya*) and that imagined things (*al-mutakhayyalāt*) are described by Existence (*al-Wujūd*).\n\nThe one inducing ecstasy only appears in the form of the ruling of *Wajd* because of this imagined *Wajd* within himself. Thus, he only appears from an existence, and therefore has a face toward sincerity. For this reason, the one inducing ecstasy must declare his *Tawājud*, so that the listener in the assembly knows that it stems from the imagined *Wajd*, not from the *Wajd* subsisting in the soul outside the Imaginative Presence. Imagination has a valid ruling in the senses, like the person suffering from jaundice who, when in a place, imagines falling from it and then falls. This is a fall resulting from an imagination whose ruling appeared in the senses.\n\nLikewise, the imagined *Wajd* may rule over the one inducing ecstasy to the extent that it annihilates him from sensation (*al-iḥsās*), just as the possessor of true *Wajd* is annihilated. However, there are two differences between them regarding the result, which we mentioned in the commentary on what is not relied upon in the Path. For the result of true *Wajd* is unknown, while the result of the imaginative *Wajd*, when it rules, is limited and known, understood by its practitioner if he is among the People of this concern. For it only produces for him what is appropriate to his imagination concerning *Wajd*, and that is known. True *Wajd* is a sudden encounter (*muṣādafa*) from where its possessor perceives not, so he does not know what it brings to him.\n\nWe have mentioned concerning *al-Tawājud* what is sufficient. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way) [33:4].",
    "ur": "باب نمبر دو سو پینتیس: تواجد (التواجد) کے بیان میں، اور یہ وجد (الوجد) کو طلب کرنا ہے\n\nتواجد (التواجد) نہ کوئی حال (الحال) ہے کہ تو اس کی تعریف کرے،\nاور نہ ہی کوئی مقام (المقام) ہے جس کا کوئی حکم یا سلطنت ہو۔\n\nیہ ہر گروہ میں اپنے صاحب کو رسوا کرتا ہے،\nاور اہل طریق (القوم) کے راستے میں اس کا کوئی وزن نہیں۔\n\nبلکہ اہل طریق (القوم) نے اس کی مذمت کی کیونکہ یہ ایک نقص ہے،\nاور تحقیق (التحقيق) میں نقص کو کوئی ترجیح نہیں۔\n\nاور جو کچھ بھی اس میں ہے جو اس کا کرنے والا کرتا ہے،\nوہ سب کا سب جھوٹ اور بہتان ہے۔\n\n***\n\n### [تواجد (التواجد) وجد (الوجد) کو طلب کرنا ہے]\n\nجان لو کہ تواجد (التواجد) وجد (الوجد) کو طلب کرنا ہے، کیونکہ یہ وجد کے حصول میں تکلف کرنا ہے۔ پس اگر یہ اپنے صاحب پر وجد کی صورت میں ظاہر ہو تو وہ جھوٹا، ریاکار، منافق ہے، اور اس کا طریق (راہ) میں کوئی حصہ نہیں۔ اسی لیے اہل طریق (الطائفة) نے اسے صرف اس شخص کے لیے جائز قرار دیا ہے جو اس جماعت کو جس میں وہ موجود ہو، یہ بتا دے کہ وہ متواجد ہے، نہ کہ صاحب وجد۔ اور یہ بھی اسے تب ہی جائز ہوتا ہے جب اتفاق سے حال (الحال) اس کی علامت کے ساتھ دیا جائے کہ وہ اہل وجد کی حرکات میں موافقت کرے، کسی ایسے شیخ کے اشارے پر جو جماعت میں حکم رکھتا ہو یا ان کے نزدیک حرمت والا ہو۔ اگر وہ ان شرائط سے باہر نکل جائے تو اس کے لیے متواجد بن کر کھڑا ہونا یا اس کا کوئی اثر ظاہر کرنا جائز نہیں۔\n\nاور ہر وہ وجد جو تواجد (التواجد) سے ہو، وہ وجد نہیں ہے۔ کیونکہ وجد کی حقیقت یہ ہے کہ وہ قلب (القلب) پر اچانک وارد ہو، اسے حیران کر دے، اور یہ حقیقت (الحقیقة) پر حملہ آور ہونا ہے۔ پس وجد (الوجد) کسب (کسب) ہے، لہٰذا وہ اسی کے لیے ہے۔ اور تواجد (التواجد) تکسب (تکسب) ہے۔ اور تواجد کے ذریعے وجد کا اکتساب (اکتساب) کرنا کسب نہیں ہے۔ اور یہ اللہ کی طرف سے بشارت ہے کہ اس نے مخالفت کو اکتساب اور اطاعت کو کسب قرار دیا۔ چنانچہ اس نے فرمایا: لَها (یعنی نفس کے لیے) ما كَسَبَتْ (جو اس نے کمایا)۔ پس اس نے اسے اس کے لیے واجب کر دیا۔ اور اکتساب کے بارے میں فرمایا: وعَلَيْها ما اكْتَسَبَتْ (اور اس پر ہے جو اس نے حاصل کیا)۔ پس اس نے اس پر صرف وہی لازم کیا جو اس نے اکتساب کیا تھا۔ پس اکتساب وہ نہیں جو اس کا حق ہو کہ وہ اسے مستحق ہو، پس وہ کسب کا مستحق ہے اور اکتساب کا مستحق نہیں۔ اور حق (الحق) صرف استحقاق کے ساتھ معاملہ کرتا ہے۔ پس اللہ کی طرف سے عفو، جرم کے بدلے میں پکڑنے پر غالب آ جاتا ہے۔\n\nپس اہل اللہ کے نزدیک تواجد (التواجد) یہ ہے کہ وجد (الوجد) کی صورت کو وجد کے بغیر، اہل وجد کی موافقت کے طریقے پر ظاہر کیا جائے، اس کے ساتھ حاضرین کو یہ بھی بتا دیا جائے کہ وہ صاحب وجد نہیں ہے۔ یہ ضروری ہے۔ اس صدق (الصدق) کے باوجود، اسے ترک کرنا زیادہ بہتر ہے، کیونکہ اللہ کے حق کی رعایت کرنا مخلوق کی رعایت سے زیادہ اولیٰ ہے۔ اس لیے کہ مخلوق کی رعایت اگر حق کے حکم کی رعایت کے بغیر ہو تو وہ مداہنت ہے، اور مداہنت ایک مذموم صفت ہے جو اہل اللہ کے لیے مناسب نہیں کہ وہ کسی ایسی چیز سے متصف ہوں جس میں حق کا کوئی وجوبی حکم نہ ہو، اگر وہ فعل ہو، یا اس فعل کی صفات میں کوئی الٰہی صفت نہ ہو جس سے وہ اس میں سند حاصل کرے، اگرچہ وہ مخلوق میں مذموم ہو، کیونکہ وہ حق کے پہلو میں محمود ہے، اس لیے کہ حق اس کے ذریعے کسی ایسے حکم کو ظاہر کرتا ہے جس کا تقاضا حکم کرتا ہے۔\n\nپس اس کی الٰہی سند نوح علیہ السلام کا اپنی قوم سے یہ قول ہے: فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ (تو ہم بھی تم سے اسی طرح مذاق کرتے ہیں جس طرح تم مذاق کرتے ہو)۔ اور اللہ تعالیٰ کا یہ قول: إِنَّا نَسِيناكُمْ ... كَما نَسِيتُمْ لِقاءَ يَوْمِكُمْ هذا (ہم نے تمہیں بھلا دیا... جیسا کہ تم نے اپنے اس دن کی ملاقات کو بھلا دیا تھا)۔ پس اس نے اپنی ذات کو نسیان (بھول) سے متصف کیا۔ اور اس طرح کے مقصود کا حکم اس سے ظاہر ہوتا ہے جسے اس کے ساتھ ملایا گیا ہے: هَلْ ثُوِّبَ الْكُفَّارُ ما كانُوا يَفْعَلُونَ (کیا کافروں کو ان کے کیے کا بدلہ دیا گیا؟)۔ اس میں استشہاد کی جگہ صورت میں موافقت ہے۔ پس یہ نام جنابِ الٰہی میں بھی اسی طرح کھینچ لیا گیا جس طرح جنابِ کونی میں کھینچا گیا، اور غرض یہ نہیں تھی کہ وہ امر محمود ہے یا مذموم، بلکہ مراد الٰہی موافقت کا ظہور ہے۔ پس جب اہل اللہ نے الٰہی موافقت کا ظہور دیکھا تو انہوں نے تواجد (التواجد) میں نرمی برتی اور تعریف کی شرط لگائی، اس لیے کہ یہ صدق (الصدق) کے مقام کا تقاضا ہے جس پر اہل طریق کا اعتماد ہے۔\n\nاگر تم کہو کہ یہ الٰہی اور نبوی موافقت تو دو مختلف گھروں اور مجلسوں میں واقع ہوئی، جبکہ تواجد (التواجد) ایک ہی مجلس میں ہوتا ہے؟ ہم کہیں گے: تم نے اس چیز میں سچ کہا جس سے ہم نے استشہاد کیا ہے، لیکن ہمارا مقصد صرف موافقت ہے۔ اگر تم دونوں جانب سے ایک ہی وقت میں امر کے حصول کا ارادہ رکھتے ہو، تو وہ اللہ کے مکر میں مکر کرنے والوں کے ساتھ موجود ہے، مِنْ حَيْثُ لا يَشْعُرُونَ (جہاں سے وہ شعور نہیں رکھتے)۔ اور یہ صرف دنیا میں ہی ہو سکتا ہے، کیونکہ آخرت میں وہ جان لیں گے کہ اللہ نے دنیا میں ان کے ساتھ مکر کیا تھا، اس چیز کے ذریعے جو اس نے ان کے لیے پھیلا دی تھی جس میں ان کی ہلاکت تھی۔ پس یہاں ان کے ساتھ مکر واقع ہوا جہاں ان کی طرف سے مکر واقع ہوا، بلکہ بعض واقعات میں یا اکثر میں، بلکہ سب میں، ان کا مکر ہی اللہ کا ان کے ساتھ مکر ہے، وهُمْ لا يَشْعُرُونَ (اور وہ شعور نہیں رکھتے)۔\n\nاور جب عمر بن خطاب رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس داخل ہوئے اور آپ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کو اسیرانِ بدر کے معاملے پر روتے ہوئے پایا، تو عمر بن خطاب نے ان دونوں سے کہا: مجھے بتاؤ کہ تمہیں کس چیز نے رلایا ہے؟ اگر مجھے رونے کی کوئی وجہ ملی تو میں روؤں گا، اور اگر نہ ملی تو میں تَبَاکِیت (تباکی) کروں گا۔ یعنی میں آنسو بہانے میں آپ دونوں کی موافقت کروں گا۔ اور تباکی (تباکی) تواجد (التواجد) کی طرح ہے، جو حقیقت کے بغیر صورت کا اظہار ہے۔ پس یہ روح کے بغیر ایک صورت ہے، مگر اس کی ایک معتبر اصل ہے جس کی طرف وہ لوٹتی ہے، اور وہ وہی ہے جو ہم نے ذکر کیا۔\n\nاگر تم کہو کہ حقائق (الحقائق) کس طرح کسی معنی کے حکم کو ظاہر میں ظاہر کرتی ہیں، جبکہ وہ معنی اس شخص میں موجود نہ ہو جس پر اس کا حکم ظاہر ہوا ہے؟ ہم کہیں گے: یہ الٰہیات میں موجود ہے، اللہ کے اس قول میں: ولا يَرْضى‏ لِعِبادِهِ الْكُفْرَ (اور وہ اپنے بندوں کے لیے کفر کو پسند نہیں کرتا) اور إِنْ تَشْكُرُوا يَرْضَهُ لَكُمْ (اور اگر تم شکر کرو تو وہ اسے تمہارے لیے پسند کرتا ہے)۔ اور رضا (الرضی) ارادہ ہے۔ اور اس نے کفر کے اپنے نزدیک مرضی ہونے کی نفی کی ہے، پس اس نے اس کے مراد ہونے کی نفی کر دی ہے۔ پس ایک ایسے معنی کا حکم ظاہر ہوا جس کی حق (الحق) نے اپنی ذات سے نفی کی ہے۔ اسی طرح تواجد (التواجد) میں وجد (الوجد) کا حکم ہے، جبکہ اس سے وجد کی نفی کی گئی ہے۔\n\nاور مسئلۂ رضا (الرضی) کا ایک دقیق معنی ہے جسے ہم نے کتاب المعرفۃ (کتاب المعرفة) میں ذکر کیا ہے، جو ایک لطیف جزو ہے، پس اسے وہاں دیکھ لیا جائے۔ ہم اسے یہاں صرف ایک صورت کے طور پر لائے ہیں، ہم اسے اس تحقیق (التحقيق) کے طریقے پر نہیں لے گئے جو ہمیں اشیاء میں حاصل ہے۔ بلکہ ہم نے اسے جدلی برہان کے طور پر پیش کیا ہے، جو فریق مخالف کی دلیل کو رد کرنے کے لیے وضع کیا گیا ہے، نہ کہ حق پر برہان قائم کرنے کے لیے۔\n\nتواجد (التواجد) میں ظاہر ہونے والا وجد (الوجد) متواجد (المتواجد) کے نفس میں ایک متخیل وجد کا حکم ہے۔ پس یہ ایک خیالی حضور (حضرة خيالية) میں ایک محقق حکم ہے۔ اور ہم بیان کر چکے ہیں کہ خیال (الخيال) ایک وجودی حضور (حضرة وجودية) ہے، اور متخیلات وجود کے ساتھ موصوف ہیں۔ پس متواجد (المتواجد) وجد کے حکم کی صورت میں صرف اسی متخیل وجد کی وجہ سے ظاہر ہوا جو اس کے نفس میں ہے۔ پس وہ وجود سے ہی ظاہر ہوا ہے۔ لہٰذا اس کا ایک رخ صدق (الصدق) کی طرف ہے۔\n\nاسی لیے متواجد (المتواجد) پر اپنے تواجد (التواجد) کی تعریف کرنا واجب ہے، تاکہ مجلس کے اہل سننے والے کو معلوم ہو جائے کہ یہ متخیل وجد (الوجد المتخيل) کی وجہ سے ہے، نہ کہ اس وجد کی وجہ سے جو نفس میں خیال کے حضور کے بغیر قائم ہے۔ اور خیال (الخيال) حس میں ایک صحیح حکم رکھتا ہے، جیسے صفراوی شخص جب کسی ایسی جگہ پر ہو جہاں سے وہ گرنے کا خیال کرے تو گر جاتا ہے۔ پس یہ ایک تخیل کی وجہ سے گرنا ہے جس کا حکم حس میں ظاہر ہوا۔ اسی طرح متواجد (المتواجد) پر متخیل وجد اس طرح حکم کر سکتا ہے کہ اسے احساس سے فنا کر دے، جیسا کہ صحیح وجد کا صاحب فنا (الفناء) ہوتا ہے۔ لیکن نتیجے کے اعتبار سے ان دونوں میں فرق ہے، جسے ہم نے شرح ما لا یعول علیہ فی الطریق (شرح ما لا یعول عليه في الطريق) میں ذکر کیا ہے۔ کیونکہ صحیح وجد کا نتیجہ نامعلوم ہوتا ہے، اور خیالی وجد کا نتیجہ، جب وہ حکم کرے، تو مقید اور معلوم ہوتا ہے، جسے اس کا صاحب جانتا ہے اگر وہ اس شان کا اہل ہو۔ کیونکہ اس کے لیے وہی نتیجہ نکلتا ہے جو وجد میں اس کے خیال کے مناسب ہو، اور وہ معلوم ہے۔ جبکہ صحیح وجد (الوجد الصحيح) ایک مصادفت ہے جہاں سے اس کا صاحب شعور نہیں رکھتا، پس وہ نہیں جانتا کہ اس پر کیا وارد ہو رہا ہے۔ اور ہم نے تواجد (التواجد) کے بارے میں وہ کچھ ذکر کر دیا ہے جس میں کفایت ہے۔ واللہ یَقُولُ الْحَقَّ وهُوَ یَهْدِی السَّبِیل (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و سی و پنجم در باب تواجُد (التواجد) و آن طلبیدن وجد است\n\nهمانا تواجُد (التواجد) نه حالی است که آن را بپسندی، *** و نه مقامی است که حکم و سلطانی داشته باشد.\nدر هر طایفه‌ای صاحبش را خوار می‌سازد، *** و در طریق اهل طریقت (القوم) هیچ میزانی ندارد.\nبلکه اهل طریقت آن را نکوهیده‌اند، زیرا که نقص است، *** و نقص در حقیقت (التحقیق) هیچ برتری ندارد.\nو هر آنچه در آن است و کسی که به آن قیام کند، *** همانا تمام آن دروغ و بهتان است.\n\n### [اینکه تواجُد (التواجد) طلبیدن وجد است]\n\nبدان که تواجُد (التواجد) طلبیدن وجد (الوجد) است، زیرا تلاشی است برای تحصیل وجد. اگر به صورت وجد بر صاحبش ظاهر شود، او دروغگو، ریاکار و منافق است و هیچ بهره‌ای در این طریق ندارد. به همین دلیل، اهل طریقت (الطائفة) آن را نپذیرفته‌اند، مگر برای کسی که به جمعی که در آن است اعلام کند که او متواجِد (متظاهر به وجد) است، نه صاحب وجد. و این نیز برای او پذیرفته نمی‌شود، مگر آنکه حال (الحال) به قرینه‌ای موافقت کند که او با اشاره شیخی که در آن جمع حکم یا حرمتی دارد، در حرکاتش با اهل وجد موافق باشد. اگر از این شروط خارج شود، جایز نیست که به صورت متواجِد (المتواجد) قیام کند و نه اینکه اثری از آن بر او ظاهر شود. و هر وجدی که از تواجُد (التواجد) باشد، وجد نیست. زیرا از حقیقت وجد (الوجد) این است که ناگهان بر قلب وارد شود و او را غافلگیر سازد، و آن هجوم بر حقیقت (الحقيقة) است. پس وجد (الوجد) کسب است و از آنِ اوست، اما تواجُد (التواجد) تکلف و اکتساب است. و اکتساب وجد از طریق تواجُد، اکتساب است نه کسب. و این بشارتی از جانب حق (الله) است که مخالفت را اکتساب و طاعت را کسب قرار داده است. پس درباره نفس (لَها) فرمود: «آنچه را کسب کرده است از آنِ اوست» (لَها ما كَسَبَتْ) [قرآن ۲:۲۸۶] و آن را برای نفس واجب ساخت. و درباره اکتساب فرمود: «و آنچه را اکتساب کرده است بر عهده اوست» (وَعَلَيْها مَا اكْتَسَبَتْ) [قرآن ۲:۲۸۶]. پس جز گرفتن آنچه اکتساب کرده است، بر او واجب نساخت. بنابراین، اکتساب حقی برای نفس نیست که مستحق آن باشد، بلکه مستحق کسب است و مستحق اکتساب نیست. و حق (الحق) جز بر اساس استحقاق معامله نمی‌کند. پس عفو از جانب حق (الله) بر گرفتنِ جریمه حکم می‌راند.\n\nپس تواجُد (التواجد) نزد اهل حق (أهل الله) عبارت است از اظهار صورت وجد بدون وجد، از طریق موافقت با اهل وجد، به شرط آنکه به حاضران اعلام کند که صاحب وجد نیست؛ این امر ضروری است. با وجود این صدق، ترک آن اولی‌تر است، زیرا رعایت حق حق (الله) اولی‌تر از رعایت خلق است. چرا که رعایت خلق اگر از روی رعایت امری نباشد که حق (الحق) به آن امر کرده است، مداهنه (مداهنة) است. و مداهنه صفتی نکوهیده است که شایسته نیست اهل حق (أهل الله) به چیزی متصف شوند که حق (الحق) در آن امری به وجوب نداشته باشد، اگر فعلی باشد، یا آن فعل صفتی الهی در صفات داشته باشد که بتوان به آن استناد کرد. حتی اگر در نظر خلق نکوهیده باشد، در جانب حق (الحق) ستوده است، زیرا حق (الحق) به واسطه آن برای امری که حکم (الحکم) اقتضا می‌کند، ظاهر می‌شود.\n\nمستند الهی (المستند الإلهي) آن، سخن نوح به قومش است: «پس ما نیز شما را مسخره می‌کنیم، همان‌گونه که شما مسخره می‌کنید» (فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ) [قرآن ۱۱:۳۸]. و سخن حق (الله): «ما شما را فراموش کردیم... همان‌گونه که شما دیدار این روزتان را فراموش کردید» (إِنَّا نَسِيناكُمْ ... كَما نَسِيتُمْ لِقاءَ يَوْمِكُمْ هذا) [قرآن ۳۲:۱۴]. پس حق (الحق) خود را به نسیان (فراموشی) وصف کرده است. و حکم چنین مقصودی از طریق آنچه به آن ملحق شده است، ظاهر می‌شود: «آیا کافران به سزای آنچه می‌کردند رسیدند؟» (هَلْ ثُوِّبَ الْكُفَّارُ ما كانُوا يَفْعَلُونَ) [قرآن ۸۳:۳۶]. محل استشهاد از این موارد، موافقت در صورت است. پس این نام در ساحت الهی (الجناب الإلهي) بر او کشیده شد، همان‌گونه که در ساحت کونی (الجناب الكوني) بر او کشیده شد. و غرض، ستوده یا نکوهیده بودن آن امر نبود، بلکه مراد، ظهور موافقت الهی بود. پس چون اهل حق (أهل الله) ظهور موافقت الهی را دیدند، تواجُد (التواجد) را مجاز شمردند و شرط اعلام را گذاشتند، به دلیل آنچه مقام صدق (الصدق) که اعتماد قوم بر آن است، اقتضا می‌کند.\n\nاگر بگویی: این موافقت الهی و نبوی تنها در دو سرا و دو مجلس مختلف واقع شده است، در حالی که تواجُد (التواجد) در یک مجلس است. می‌گوییم: در آنچه ذکر کردی و در عین آنچه به آن استشهاد کردیم، راست گفتی. ما جز موافقت را قصد نکردیم. اگر حصول امر از دو جانب در یک زمان را می‌خواهی، این در مکر حق (الله) با مکرکنندگان وجود دارد، «از جایی که نمی‌دانند» (مِنْ حَيْثُ لا يَشْعُرُونَ). و این تنها در دنیا رخ می‌دهد، زیرا آنان در آخرت می‌دانند که حق (الله) در دنیا با آنان مکر کرده است، به واسطه آنچه برایشان گسترانید و موجب هلاکتشان شد. پس مکر در اینجا بر آنان واقع شد، همان‌گونه که مکر از جانب آنان واقع شد. بلکه در برخی وقایع یا بیشتر آنها، بلکه در همه آنها، عین مکر آنان، مکر حق (الله) با ایشان است، «در حالی که نمی‌دانند» (وَهُمْ لا يَشْعُرُونَ).\n\nو هنگامی که عمر بن خطاب بر رسول حق (صلی الله علیه و سلم) وارد شد و او و ابوبکر را در قضیه اسیران بدر گریان یافت، عمر بن خطاب به آن دو گفت: آنچه شما را به گریه انداخته است، برایم بازگو کنید. اگر گریه‌ای یافتم، گریه می‌کنم، و اگر نیافتم، تباکی (تباكيت) می‌کنم.\nیعنی در جاری شدن اشک‌ها با شما موافقت می‌کنم. و تباکی (التباكي) مانند تواجُد (التواجد) است؛ اظهار صورت بدون حقیقت است. صورتی است بدون روح، جز اینکه اصلی معتبر دارد که به آن باز می‌گردد، و آن همان است که ذکر کردیم.\n\nاگر بگویی: چگونه حقایق (الحقائق) اجازه می‌دهند که حکم معنایی در ظاهر اظهار شود، در حالی که آن معنا در کسی که حکم بر او ظاهر شده، وجود ندارد؟ می‌گوییم: این در الهیات (الإلهيات) موجود است، در سخن حق (الله): «و کفر را برای بندگانش نمی‌پسندد» (وَلا يَرْضى‏ لِعِبادِهِ الْكُفْرَ) [قرآن ۳۹:۷] و «اگر شکر کنید، آن را برای شما می‌پسندد» (وَإِنْ تَشْكُرُوا يَرْضَهُ لَكُمْ) [قرآن ۳۹:۷]. و رضایت (الرضي) همان اراده است. حق (الحق) نفی کرده است که کفر مورد رضایت او باشد، پس نفی کرده است که مراد او باشد. پس حکم معنایی ظاهر شده است که حق (الحق) آن را از خود نفی کرده است. همچنین است حکم وجد (الوجد) در تواجُد (التواجد)، با نفی وجد از آن. و مسئله رضایت (الرضي) معنای دقیقی دارد که آن را در کتاب *المعرفة* (المعرفة) ذکر کرده‌ایم، که جزئی لطیف است و باید در آنجا نگریسته شود. ما آن را در اینجا تنها به صورت آورده‌ایم و آن را به روش تحقیق (التحقيق) که در اشیا داریم، نبرده‌ایم، بلکه آن را به شیوه برهان جدلی (البرهان الجدلي) که برای دفع حجت خصم وضع شده است، خارج کرده‌ایم، نه برای اقامه برهان بر حق (الحق).\n\nوجد (الوجد) ظاهری در تواجُد (التواجد)، حکم وجدی است که در نفس متواجِد (المتواجد) تخیل شده است. پس آن حکمی محقق در حضور خیالی (حضرة خيالية) است. و ما بیان کرده‌ایم که خیال (الخيال) یک حضور وجودی (حضرة وجودية) است و متخیلات موصوف به وجود هستند. پس متواجِد (المتواجد) به صورت حکم وجد ظاهر نشده است، مگر به خاطر همین وجد تخیلی در نفس او. پس او جز از وجودی ظاهر نشده است، بنابراین وجهی به سوی صدق دارد. به همین دلیل، بر متواجِد (المتواجد) واجب است که تواجُد (التواجد) خود را اعلام کند تا شنونده از اهل مجلس بداند که این از وجد تخیلی (الوجد المتخيل) است، نه از وجد (الوجد) قائم به نفس در غیر حضور خیال. و خیال (الخيال) در حس (الحس) حکم صحیحی دارد، مانند کسی که صفرا دارد و در مکانی قرار می‌گیرد که سقوط از آن را تخیل می‌کند و سپس سقوط می‌کند. این سقوطی است که حکم تخیلش در حس ظاهر شده است. همچنین متواجِد (المتواجد) ممکن است تحت حکم وجد تخیلی قرار گیرد، به طوری که او را از احساس فانی کند، همان‌گونه که صاحب وجد صحیح فانی می‌شود. اما میان آن دو در نتیجه، تفاوت‌هایی وجود دارد که ما در شرح *ما لا یُعوّل علیه فی الطریق* (آنچه در طریق بر آن اعتماد نمی‌شود) ذکر کرده‌ایم. زیرا نتیجه وجد صحیح (الوجد الصحيح) مجهول است، اما نتیجه وجد خیالی (الوجد الخيالي)، اگر حکم کند، مقید و معلوم است و صاحبش اگر از اهل این شأن باشد، آن را می‌داند. زیرا برای او جز آنچه مناسب خیالش در وجد است، نتیجه نمی‌دهد و آن معلوم است. در حالی که وجد صحیح (الوجد الصحيح) مصادفه‌ای است که صاحبش از آن آگاه نیست و نمی‌داند چه چیزی برایش می‌آورد. و ما در باب تواجُد (التواجد) آنچه کفایت می‌کند، ذکر کردیم. و حق (الله) حق را می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) [قرآن ۳۳:۴]."
  },
  "page_count": 2
}