{
  "id": 328,
  "title": {
    "ar": "الباب الثامن والعشرون وثلاثمائة في معرفة منزل ذهاب المركبات عند السبك إلى البسائط وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Twenty-Eight: Concerning the Gnosis of the Station of the Dissolution of Composite Things (المركبات) into Simple Elements (البسائط) during the Process of Refining (السبك), and this Station is from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب نمبر تین سو اٹھائیس: مرکبات کے سبك (تصفیہ) کے وقت بسائط میں تحلیل ہو جانے کے مقام کی معرفت، اور یہ (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و بیست و هشتم در معرفت منزل زوال مرکبات هنگام ذوب شدن به بسیط‌ها، و این منزل از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الثامن والعشرون وثلاثمائة في معرفة منزل ذهاب المركبات عند السبك إلى البسائط وهو من الحضرة المحمدية»\n\n\nهذا المنزل يعصم الدخول فيه من الموت ما دمت فيه وهو منزل عجيب‏\n\n\n> إن المقرب ذو روح وريحان *** في جنة الخلد من نعمى وإحسان‏\n\n\n> منعم بعذاب النار تبصره *** يسبح الله من علم وإيمان‏\n\n\n> بنشأة ما لها حد فتبلغه *** منزه الحكم عن نقص ورجحان‏\n\n\nمن هذا المنزل تكون الوقائع للفقراء وهي المبشرات والرؤيا الصادقة ما هي بأضغاث أحلام وهي جزء من أجزاء النبوة ومن هذا المنزل يحصل للمكاشف كشف الميزان الذي بيد الحق الذي يخفض به ويرفع‏\n\n\n### [المبشرات والرؤيا الصادقة]\n\n\nاعلم أن التحليل إذا ورد على المركبات أذهب عين الصورة ولم يذهب عين الجوهر وجعله الله مثالا للعارفين بالله فيما يظهر من تركيب أعيان الممكنات بعين الحق فيظهر في عين الحق ما يظهر من الصور فإذا رفعت التناسب بين الحق والخلق ذهبت أعيان تلك الصور وبقيت أعيان الممكنات وعين الحق من حيث ما هو موصوف بالغنى عن العالمين فلم تذهب الأعيان لذهاب الصور الظاهرة للحس واعلم أن الصور الظاهرة من الحق على ثلاث مراتب فإن للحق في العالم ثلاثة أوجه إذ وصف نفسه بأن له يدين قبض بهما على العالم وأظهر النبي صَلَّى اللهُ عَليهِ وسَلَّم ذلك في الكتابين اللذين خرج بهما على أصحابه في الواحد أسماء أهل الجنة وأسماء آبائهم وقبائلهم وعشائرهم وفي الآخر أسماء أهل النار وأسماء آبائهم وقبائلهم وعشائرهم ولم يخرج لأهل الله وخاصته كتابا ثالثا فإن كتابهم القرآن قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أهل القرآن هم أهل الله وخاصته‏\n\n\nومنزله ما بين اليدين فلهم القلب والصدر الذي هو محله وحضرته وذلك هو مقام أهل القربة الذين هم خصوص في‏\nالسعداء أورثهم ذلك المسابقة إلى الخيرات على طريق الاقتصاد من إعطاء كل ذي حق حقه فانقسم العالم لانقسام الوجوه على ثلاثة أقسام لكل يد قسم صنف خاص ولما بينهما صنف خاص ولأصناف الأيدي مرتبة العظمة والهيبة فأما اليد الواحدة فالصنف المنسوب إليها عظيم الشأن في نفسه عظمة ذاتية له والصنف الآخر عظيم المرتبة ليست عظمته ذاتية فيعظم لرتبته لا لنفسه كأصحاب المناصب في الدنيا إذ لم يكونوا أهل فضل في نفوسهم فيعظمون لمنصبهم فإذا عزلوا زال عنهم ذلك التعظيم الذي كان في قلوب الناس لهم فهذا الفرق بين الطائفتين فصنف من أهل الله يظهرون في العالم بالله وصنف آخر يظهرون في العالم لله والصنف الذي بين اليدين يظهر بالمجموع وزيادة فأما الزيادة فظهورهم بالذات التي جمعت اليدين وهم أصحاب الهرولة الإلهية في أحوالهم التي سارعوا بها في موطن التكليف وأصحاب اليدين أصحاب الذراع والباع الإلهي لما ظهروا في موطن التكليف عند تعين الخطاب بالشبر والذراع فوقعت المفاضلة ليقع التمييز في المرتبة فيقول صنف ما بين اليدين‏\n\n\n> أنا من أهوى *** ومن أهوى أنا\n\n\nفي مشاهدة دائمة لا تنقطع مراتبها وإن اختلفت أذواقها فإن الله له عرش لا يتجلى في هذه الصورة الدائمة إلا لأصحاب هذا العرش وهم أهل العرش وهم أهل الوجه ينظر بعضهم إلى بعض في هذا التجلي فيكسو بعضهم بعضا من الأنوار التي هم عليها مع كونهم في حال التجلي والنظر وما ثم موطن يجمع بين تجلى الحق ورؤية الخلق في غير حضرة الخيال والمثال إلا موطن أصحاب الوجه أعطاهم ذلك قوة المحل الذي أحلهم فيه الحق وهو محل المقامة وهو الذي ظهر لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم في بعض إسراءاته فعبر عنه في حال تدليه إليه برفرف الدر والياقوت فانتقل في إسرائه من براق إلى رفرف فمن حصل في هذا المقام دامت مشاهدته ولم تغيبه عن نفسه ولا عن ملكه ويرى الكثرة في الواحد والتفرقة في الجمع وتقوم لهذا الصنف من الوجه صور حاملة لعلوم محمولة مما بينهم وبينها علاقة ومناسبة عملية ومما لا علاقة بينهم وبينها بل هي زيادة من فضل الله لهم يرزقونها من عين المنة لا ينالون هذه العلوم إلا من تلك الصور المنبعثة من الوجه فلا يحجبهم الوجه عن رؤية الصور وما تحمله ولا تحجبهم الصور وما تحمله ولأذوق تلك العلوم عن الوجه وهذه الرتبة أعلى رتبة للسعداء ثم يفيضون على أصحاب الأيدي مما حصل لهم من تلك العلوم التي نالوها من تلك الصور فلا يأخذوها أصحاب الأيدي إلا بوساطة أصحاب الوجه كما إن أصحاب الوجه ما نالوها إلا من تلك الصور لم ينالوها من الوجه وسبب ذلك أن تلك العلوم مختلفة الأذواق والوجه ما فيه اختلاف فلا بد أن يظهر تميز تلك المراتب بوجود هذه الصور ليعلم تنوع المشارب فما كان عن علاقة التنوع فلتنوع أحوالهم بالشبر والذراع والسعي فتنوع المشروب بالذراع بالباع والهرولة وما تنوع من المشارب مما لا علاقة بينها وبينهم فليعلم إن ذلك من الاستعدادات التي هي عليها نشأتهم الذي هو غير الاستعداد العملي الذي كني عنه بالمقدار من شبر وذراع فالهبات الإلهية إنما اختلفت لهذا ولا يذهب شي‏ء من هذا كله بعقولهم ولا ينقصهم من مراتب حظوظ حقائقهم شيئا فينعمون بكل جارحة وكل حقيقة هم عليها في زمان واحد لا يحجبهم نعيم شي‏ء عن نعيمهم بشي‏ء آخر ومن علم هذا علم صورة النشأة الآخرة وأنها على غير مثال كما كانت نشأة الدنيا على غير مثال وليس في هذا المقام لهذا الصنف أعجب من كونه إذا تجلت لهم صور الوجه يفنون العلوم في المشروبات وهم على حقائق يطلب كل شي‏ء جاءوا به أن يختاروا به منها مع كونها لهم ولا بد لهم من نيلها وأعرفك بسبب ذلك أنهم لا يقع لهم الاختيار إلا في العلوم التي بينهم وبينها علاقة من تلك المشارب لا في علوم الوهب وذلك لأنهم في حال سلوكهم وإنشائهم للأعمال اختاروا بعض الأعمال على بعض فقدموها لما اقتضاه الزمان أو المكان أو الحال فإذا ظهر في هذا التجلي نتائج تلك الأعمال وقع الاختيار منهم في تقدم بعضها على بعض للتناول على صورة ما جرى في حال أعمالهم أ لا ترى حكمة قوله في الآخرة إن لأهل السعادة ما تشتهي نفوسهم ولم يقل ما تريد نفوسهم والشهوة إرادة لكن لما لم يكن‏\n\n\nكل مراد يشتهي لم يكن كل إرادة شهوة فإن الإرادة تتعلق بما يلتذ به وبما لا يلتذ به ولا تتعلق الشهوة إلا بالملذوذ خاصة فأخذوا الأعمال بالإرادة والقصد وأخذوا النتائج بالشهوة فمن رزق الشهوة في حال العمل فالتذ بالعمل التذاذه بنتيجته فقد عجل له نعيمه ومن رزق الإرادة في حال العمل من غير شهوة فهو صاحب مجاهدة نال النتيجة بشهوة وهي مرتبة دون الأولى ثم إن لهذا الصنف من الحق في هذه الحال صورة القهر والظفر\nبما من شأنه أن يمتنع فلا يمتنع لما يعلمه مما هو عليه من صفة الاقتدار على إنزاله أنتج له ذلك الأخذ بالشدائد وترك الرخص فهذا بعض أحوال أهل الوجه وأما الصنفان الآخران فللواحد منهم التكوين وللآخر التسليم فأما أهل التكوين من هذين الصنفين فتميزهم في أحوالهم ومكانهم من العالم العلوي إذا فارقوا هياكلهم بالموت وفتحت لهم أبواب السماء وعرج بأرواحهم إلى حيث أسكنوا عند السدرة المنتهى لا يبرحون بها إلى يوم النشور لأنهم في حال أعمالهم بلغوا المنتهى في بذل وسعهم فيما كلفوا من الأعمال وماتوا نوابل بذلوا المجهود الذي لم يبق لهم مساغا كل على قدر طاقته فلا فرق بين من يتصدق بمائة ألف دينار إذا لم يكن له غيرها وبين من يتصدق بفلس إذا لم يكن له غيره فاجتمع الاثنان في بذل الوسع ومن هناك جوزوا وجمعهم مكان واحد وهو سدرة المنتهى التي غشاها من نور الله ما غشى فلا يستطيع أحد أن ينعتها وقد تبين مثل هذا في قول الشارع سبق درهم ألفا لأن صاحب الدرهم لم يكن له سواه فبذله لله ورجع إلى الله لأنه لم يكن له مستند يرجع إليه سواه وصاحب الألف أعطى بعض ما عنده وترك ما يرجع إليه فلم يرجع إلى الله فسبقه صاحب الدرهم إلى الله وهذا معقول فلو بذل صاحب الألف جميع ما عنده مثل صاحب الدرهم لساواه في المقام فما اعتبر الشارع قدر العطاء وإنما اعتبر ما يرجع إليه المعطي بعد العطاء فهو لما رجع إليه فالراجعون إلى الله هم المفلسون من كل ما سوى الله وإن كان صاحب الجدة ممن يرى الحق في كل صورة فما يدرك رتبة من يراه في لا شي‏ء فإنه يراه في ارتفاع النسب والإطلاق وعدم التقييد ولا شك أن الحق إذا تقيد للمتجلي له في صورة فإن الصورة تقيد الرائي وهو تعالى عند كل راء في صورة لا يدركها الآخر فلا يدرك مطلق الوجود إلا المفلس الذي ذهبت الصور عن شهوده كما قال في الظمآن حتى إذا جاءه لم يجده شيئا فنفى شيئية المقصود ووجد الله عنده يعني عند لا شي‏ء فإنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهو غَنِيٌّ عَنِ الْعالَمِينَ فلا يدركه إلا من أفلسه الله من العالمين والمفلس من العالمين في غاية الغني عن العالمين لما تقطعت به الأسباب رده الحق إليه فعلم لمن رجع وبما ذا رجع فرجع بالإفلاس لمن له الغني عنه فعرف الحق حقا فاتبعه فحق عينه عدم وشهود وحق ربه وجود وشهود قال صَلَّى اللهُ عَليهِ وسَلَّم صاحب الكشف الأتم إن أصحاب الجد محبوسون والمحبوس مقيد والمفلس ما له جد يقيده ولا يحبسه فهو مطلق عن هذا التقييد الذي لأصحاب الجد فهو أقرب إلى الصورة بالإطلاق من أصحاب الجد لتقيدهم فأصحاب الجد في رتبة من يرى الحق في الأشياء فيقيده بها ضرورة لأن المقام يحكم عليه والمفلس محمدي لا مقام له فإنه قيل له ليس لك من الأمر شي‏ء فأفلسه وليس الجد إلا لمن له الأمر فكل من له الأمر فهو صاحب جد لأن الأمر للتكوين فما أراده كان فليس بمفلس ومن خرج عن حقيقته فقد زل عن طريقه فما للخلق وللتكوين إن قال أو أمر بحق فالتكوين للحق لا له كما قال فيمن له التكوين فيكون طائرا بإذني وفي آية أخرى فيكون طائرا بإذن الله فأعطاه وجرده فالبقاء على الأصل أولى وهو قوله لأكرم الناس عليه وأتمهم في الشهود وأعلاهم في الوجود ليس لك من الأمر شي‏ء فأفلسه يا أَهْلَ يَثْرِبَ لا مُقامَ لَكُمْ فَارْجِعُوا فإن الله ينشئكم في ما لا تَعْلَمُونَ ولَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولى‏ إنها كانت فيما لا يعلم فَلَوْ لا تَذَكَّرُونَ فأهل الله لا يبرحون في موطن الإفلاس فهم في كل نفس على بينة لا على لبس من علم جديد لم يكن عنده فإنه ينشئه دائما فيما لا يعلم فليس بصاحب نظر وتدبير ولا روية إذ لا يكون النظر إلا في مواد وجودية وهي الحدود التي حبستهم عن العلم بالله فهم في لَبْسٍ من خَلْقٍ جَدِيدٍ وهم فيه وهُمْ لا يَشْعُرُونَ فإذا دخلوا الجنة يوم القيامة فلا ينزلون منها إلا فيما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر وإذا لم يخطر على القلب وله مقام التقليب في الوجوه فما ظنك بالعقل الذي لا تقليب عنده جعلنا الله من هؤلاء المفلسين وحال بيننا\n\n\nوبين مقام أهل الجد المحبوسين ثم إن أصحاب التكوين الذين لهم القوة الإلهية في إيجاد الأعيان إذا شاهدوا نضد العالم وترتيبه وإنه ما بقي فيه خلاء يعمره تكوينهم علموا عند ذلك أن الله قد حال بينهم وبين إيجاد المعدوم وليس التكوين الحقيقي إلا ذلك فما حصل بأيديهم من التكوين إلا تغير الأحوال وهو الموجود في العامة فيكون قائما فيقعد أو قاعدا فيقوم أو ساكنا فيتحرك أو متحركا فيسكن ليس في قدرته غير ذلك فإن التكوين الذي هو إيجاد المعدوم ما بقي له مكان في العالم يظهر فيه فزالت الأمكنة بما عمرته من صور العالم وأعيانه من حيث جوهره وما زالت‏\nالمحال التي يظهر فيها تغير الأحوال فليس لأصحاب التكوين إلا مراتب العوام إلا أن الفرق بينهم وبين العوام أن العامة لها التكوين في معتاد ولهؤلاء التكوين في غير معتاد ولكن هو معتاد لهم فهم بمنزلة العامة في عاداتهم وصاحب الوجود والشهود لا يبرح في ليس لك من الأمر شي‏ء فإذا عاينوا أهل التكوين ما ذكرناه من عمارة الأمكنة ونضد العالم وإنه ما يقبل الزيادة ولا النقصان وإنه قد خلق في أكمل صورة وما بقي لهم تصريف إلا في المحال وإيجاد إلهيات كالتجلي الإلهي في الصور انكسرت قلوبهم وعلموا عجزهم وأنهم قاصرون مقيدون في التكوين فيطلبون الراحة من تعب التكوين فيأتيهم الخطاب الإلهي في أسرارهم بقوله أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ لوجود الراحة فاستراحوا عند هذا الخطاب في ظله الممدود وظل الشي‏ء يخرج على صورة الشي‏ء فجعل الله راحتهم بالعالم لا به والمفلس ما له راحة إلا به فإنه قد أفلسه من العالم فليس له راحة في الظل‏\n\n\nفلا حكم للعالم عليه ولا مزية فهو لله بالله فإذا أراد الله راحة هذا المفلس قبض الظل إليه قبضا يسيرا فانكشف عن موضع استراحة هذا المفلس لأنه إذا قبض الظل إليه عمر النور المكان المقبوض منه هذا الظل وهو موضع راحة هذا المفلس فإنه لحاجته كالمقرور يطلب الشمس لوجود الراحة له في النور فإذا استراح أهل التكوين في علم قوله أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ استراح المفلس من هذه الآية إلى قوله أَ لَمْ تَرَ إِلى‏ رَبِّكَ في بدء أمره وفي نهايته إلى قوله ثُمَّ قَبَضْناهُ إِلَيْنا قَبْضاً يَسِيراً فما رأى في البداية والنهاية إلا ربه فهو الأول في شهوده والآخر في انتهاء وجوده وبقي أهل التكوين في علم مد الظل لا في كيفيته والمفلسون ما نظروا في الظل إلا من حيث خاطبهم الحق وهو قوله كَيْفَ مَدَّ الظِّلَّ فوقفوا مع الكيفية وهي إلهية فما وقفوا إلا مع الله لا مع الظل لأن الكيفية شهود الممد له لا شهود الممدود فجعلهم الحق لهذه المنزلة يفيضون على أهل التكوين من علوم الحياة ما تحيا به قلوبهم فإذا رأوا الإمداد يأتيهم نظروا من أي جهة أتاهم ذلك فرأوه من جهة هؤلاء الكمل من رجال الله فعرفوا إن لله رجالا فوقهم لهم القربة الإلهية بما سبق لهم عند الله فكانوا لهذه السابقة من السابقين المسارعين إلى الخيرات على طريق الاقتصاد وأعطوا كل ذي حق حقه كما أعطى الله كل شي‏ء خلقه فلهؤلاء العرش ولأهل التكوين الفرش فلهم الاستواء ولأهل التكوين الاتكاء ولهم النزول ولأهل التكوين الارتفاع والصعود ولهم حقائق أسماء التنزيه ولأهل التكوين حقائق أسماء التشبيه إذ بها يغيرون الأحوال في المحال فهذا بعض ما هم عليه أهل يد التكوين وأصحاب الوجه الذين لهم ما بين اليدين وأما أهل التسليم فهم في جهد ومشقة في نار مجاهدة ورياضة لا يعرفون برد اليقين ولا حرارة الاشتياق إلى التعيين لأن الشوق لا يتعلق إلا بمعروف ولا يكون إلا لأصحاب الحروف الذين يعبدون الله على حرف لمعناه فَإِنْ أَصابَهُ خَيْرٌ اطْمَأَنَّ به أي بالحرف لأجل الخير الذي أصابه منه وهو خير مقيد معين عنده الذي لأجله لزم هذا الحرف دون غيره إذ الحروف كثيرة فهو كمن أَسَّسَ بُنْيانَهُ عَلى‏ شَفا جُرُفٍ هارٍ فَانْهارَ به فهو على شفا لا على شفاء ولكن مع هذا فرحمة الله شاملة ونعمته سابغة ولكل موجود في العالم وجهان باطن فِيهِ الرَّحْمَةُ وظاهر من قِبَلِهِ الْعَذابُ كالسور بين الجنة والنار والعبد حاله بحسب الوجه الذي ينظر إليه من كل موجود لأن الحق وصف نفسه بالغضب والرضاء والعالم على صورته فلا بد مما ذكرناه أن يكون العالم عليه فلا بد من القبضتين ولا بد من اليدين ولا بد من الدارين ولا بد من البرزخ بين كل اثنين ومن كُلِّ شَيْ‏ءٍ خَلَقْنا زَوْجَيْنِ لأنه مخلوق عن صفتين إرادة وقول وهما اللذان يشهدهما كل مخلوق من الحق فإن العالم نتيجة والنتيجة لا تكون إلا عن مقدمتين وهذا هو التناسل الإلهي ولهذا أوجده على الصورة كوجود الابن على صورة الأب في كل جنس من المخلوقات فالعالم من حيث أجزائه وتفاصيله كالأعضاء للاسم الظاهر ومن حيث معانيه وتفاصيل مراتبه كالقوى الروحانية الباطنة التي لا تعلم إلا بآثارها للاسم الباطن فقامت نشأة العالم على الظاهر والباطن وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ فهذا قد بينا في هذا المنزل ما تقتضيه الثلاثة الأوجه الإلهية والمراتب الثلاثة التي ظهر فيها التفاضل بين العالم فلنذكر ما يتضمنه هذا المنزل من العلوم فأول ذلك علم المبشرات وعلم الميزان الإلهي الذي بيده للخفض والرفع الوارد حديثه في الخبر النبوي الذي أشهده الحق وفيه علم الحركات الطبيعية خاصة وفيه علم تحليل‏\nالمركبات وفيه علم ما يبدو للمكاشف إذا شاهد الهباء الذي تسميه الحكماء الهيولى من صور العالم قبل ظهور أعيانها في الجسم الكل وفيه علم الفردية الأولى التي وقع فيها الإنتاج والتناسل الإلهي والروحاني والطبيعي والعنصري وهو علم عزيز وفيه علم الاقتدار الإلهي وفيمن ينفذ وفيمن لا ينفذ ولما ذا لا ينفذ في بعض الممكنات وما المانع لذلك هل أحاله الجمع بين الضدين والأصل جامع بين الضدين بل هو عين الضدين وفيه علم التحسين والتقبيح وفيه علم النشأتين وفيه علم الحياة السارية في جميع الموجودات حتى نطقت مسبحة لله بحمده وفيه علم المواد الطبيعية والمواد العنصرية وفيه علم المبدأ والمعاد وفيه علم الأصل الذي ترجع إليه هذه المواد وفيه علم الأسطقسات وفيه علم مراتب العلوم وفيه علم الكلمات الإلهية من حيث ما هي مؤلفة وفيه علم الكتاب المسطور في الرق المنشور وفيه علم تنزيه الصحف ومنزلتها من الكتب وما السفرة التي تحمله وفيه علم الفروق بالحدود في أي الأعيان يظهر وما في الوجود إلا واحد فبما ذا يتميز وعن أي شي‏ء يتميز وما هو ثم وفيه علم التغذي بالعدم وفيه علم الفرق بين نسبة الحق في القرب في الأحياء وبين نسبة قربه في الأموات وفيه علم الرجعة وفيه علم الثواب في كل صنف صنف أعني في تعيين ثوابهم والفرق بين أصحاب النور وأصحاب الأجور وكيف يكون العبد أجيرا لمن هو عبد له من غير أن يكون مكاتبا ولا مدبرا وفيه علم تنزيه العظمة الإلهية أن تقوم بالأكوان وفيه علم السبب الذي لو علمه من علمه لم يمت ما دام ذلك العلم مشهودا له فهذه أمهات العلوم التي يحوي عليها هذا المنزل وفيها تفاصيل لا تتناهى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 328: Concerning the Knowledge of the Station of the Dissolution of Compounds into Simples during Refinement, which is from the Muhammadan Presence (الحضرة المحمدية).\n\nThis station (منزل) protects one who enters it from death, as long as he remains within it, and it is a wondrous station.\n\n> Indeed, the one brought near (المقرب) possesses comfort and sweet basil,\n> In the Garden of Eternity, through grace and beneficence.\n\n> Blessed by the torment of the Fire, you see him\n> Glorifying Allah out of knowledge and faith.\n\n> In an existence (نشأة) that has no limit for him to reach,\n> The Divine Decree (الحكم) is exalted above deficiency or preponderance.\n\nFrom this station arise the spiritual events (الوقائع) for the spiritual poor (الفقراء), which are the glad tidings (المبشرات) and the true vision (الرؤيا الصادقة)—not confused dreams (أضغاث أحلام)—and they are a part of the parts of prophecy (النبوة). From this station, the one who receives unveiling (المكاشف) attains the unveiling (كشف) of the Balance (الميزان) held by the Real (الحق), by which He lowers and raises.\n\n### The Glad Tidings and the True Vision (المبشرات والرؤيا الصادقة)\n\nKnow that when analysis (التحليل) is applied to compounds (المركبات), it removes the essence of the form (عين الصورة) but does not remove the essence of the substance (عين الجوهر). Allah made this an example for those who have Gnosis (العارفين بالله) regarding what appears from the composition of the immutable essences (أعيان الممكنات) through the Essence of the Real (عين الحق). Thus, what appears of forms manifests within the Essence of the Real. If the proportionality (التناسب) between the Real and Creation (الخلق) is removed, the essences of those forms vanish, but the immutable essences (أعيان الممكنات) and the Essence of the Real (عين الحق) remain, inasmuch as He is described as being Independent of the worlds (الغنى عن العالمين). Thus, the essences did not vanish due to the disappearance of the forms perceptible to the senses.\n\nKnow that the forms manifested by the Real are upon three levels (مراتب), for the Real has three faces (أوجه) in the Cosmos (العالم), since He described Himself as having two Hands (يدين) with which He grasped the Cosmos. The Prophet (peace and blessings be upon him) demonstrated this with the two books he brought out to his Companions: in one were the names of the people of Paradise, and the names of their fathers, tribes, and clans; and in the other, the names of the people of the Fire, and the names of their fathers, tribes, and clans. He did not bring out a third book for the People of Allah (أهل الله) and His elect, for their book is the Quran. The Messenger of Allah (peace and blessings be upon him) said: \"The People of the Quran are the People of Allah and His elect.\"\n\nAnd their station is between the two Hands. For them are the heart (القلب) and the breast (الصدر), which is their locus and their Presence (حضرة). That is the station (مقام) of the People of Nearness (أهل القربة), who are the elect among the fortunate (السعداء). This inheritance grants them precedence in racing toward good deeds (الخيرات) upon the path of moderation (الاقتصاد), by giving every possessor of a right his due.\n\nThe Cosmos is thus divided into three sections corresponding to the division of the faces: each Hand has a specific class (صنف خاص), and what is between them has a specific class. The classes associated with the Hands possess the rank of majesty (العظمة) and awe (الهيبة). As for one Hand, the class attributed to it is great in intrinsic worth, possessing essential majesty (عظمة ذاتية). The other class is great in rank, but its majesty is not essential; thus, they are revered for their rank, not for themselves—like those holding positions of authority in the world who are not inherently people of merit, so they are revered for their office. If they are dismissed, the reverence they held in people's hearts vanishes. This is the difference between the two groups.\n\nOne class of the People of Allah manifests in the Cosmos *by* Allah (بالله), and another class manifests in the Cosmos *for* Allah (لله). The class between the two Hands manifests by the totality, plus an addition. As for the addition, it is their manifestation through the Essence (الذات) that unites the two Hands. They are the People of the Divine Hurrying (الهرولة الإلهية) in their states, by which they hastened in the realm of obligation (التكليف). The People of the two Hands are the People of the Divine Forearm (الذراع) and Span (الباع), as they manifested in the realm of obligation when the address was specified by the span (الشبر) and the forearm. Thus, differentiation occurred to establish distinction in rank.\n\nThe class between the two Hands says:\n\n> I am the one I love, and the one I love is I.\n\nThis is in perpetual witnessing (مشاهدة), whose levels are uninterrupted, even if their tastes (أذواق) differ. For Allah has a Throne (عرش), and He does not disclose Himself (يتجلى) in this perpetual form except to the People of this Throne, who are the People of the Throne and the People of the Face (أهل الوجه). They look upon one another in this Theophany (التجلي), and they clothe one another with the Lights (الأنوار) upon which they subsist, even while they are in the state of Theophany and contemplation.\n\nThere is no locus that combines the Theophany of the Real and the vision of Creation, outside of the Presence of Imagination (حضرة الخيال) and Similitude (المثال), except the locus of the People of the Face. This was granted to them by the strength of the place (المحل) where the Real settled them, which is the locus of the Standing (المقامة). This is what appeared to the Messenger of Allah (peace and blessings be upon him) during some of his nocturnal journeys (إسراء), which he described, in the state of his descent toward it, as a cushion (رفرف) of pearls and rubies. Thus, in his journey, he moved from the Buraq to the Rafraf.\n\nWhoever attains this station, his witnessing is perpetual, and it does not veil him from himself or from his dominion. He sees Multiplicity (الكثرة) in Unity (الواحد) and separation (التفرقة) in gathering (الجمع). For this class of the Face, forms arise carrying knowledge (علوم محمولة). Some of this knowledge has a practical connection and suitability between them and the forms, and some has no connection, but is an addition from the bounty of Allah, granted to them from the very source of grace (عين المنة). They attain this knowledge only from those forms emanating from the Face. The Face does not veil them from seeing the forms and what they carry, nor do the forms and what they carry, or the tastes of that knowledge, veil them from the Face.\n\nThis rank is the highest rank for the fortunate. Then they pour forth (يفيضون) upon the People of the Hands (أصحاب الأيدي) from the knowledge they attained from those forms. The People of the Hands do not receive it except through the mediation (وساطة) of the People of the Face, just as the People of the Face attained it only from those forms, not directly from the Face.\n\nThe reason for this is that those branches of knowledge have differing tastes (أذواق), while the Face contains no difference. It is necessary for the distinction of those levels to appear through the existence of these forms, so that the variety of drinking places (المشارب) may be known. What arises from the connection of variety is due to the variety of their states—by the span, the forearm, and the striving (السعي)—so the drink varies by the forearm, the span, and the hurrying. And what varies among the drinking places that has no connection between them and the People of the Face, let it be known that this arises from the predispositions (الاستعدادات) upon which their existence (نشأتهم) is founded, which is distinct from the practical predisposition symbolized by the measure of the span and the forearm.\n\nThe Divine Gifts (الهبات الإلهية) differ only for this reason. None of this diminishes their intellects or detracts from the levels of their share in their realities (حقائق). They are blessed by every limb and every reality upon which they subsist simultaneously; the bliss of one thing does not veil them from the bliss of another. Whoever knows this understands the form of the Next Existence (النشأة الآخرة), and that it is without precedent, just as the existence of this world was without precedent.\n\nIn this station, nothing is more wondrous for this class than that when the forms of the Face disclose themselves to them, they annihilate the branches of knowledge within the drinks (المشروبات), while they remain upon realities. Everything they brought seeks that they choose from it, even though it belongs to them and they must attain it.\n\nI will inform you of the reason for this: they only exercise choice regarding the knowledge that has a connection with them from those drinking places, not in the knowledge of pure gift (علوم الوهب). This is because, during their spiritual journey (سلوك) and the creation of their deeds, they chose some deeds over others, prioritizing them according to the demands of time, place, or state. When the results of those deeds appear in this Theophany, they exercise choice in prioritizing some over others for consumption, mirroring what occurred during their deeds.\n\nDo you not see the wisdom in His saying concerning the Hereafter: \"Indeed, for the People of Felicity (أهل السعادة) is what their souls *desire* (تشتهي),\" and He did not say \"what their souls *will* (تريد)\"? Desire (الشهوة) is a form of will (إرادة), but since not everything willed is desired, not every will is desire. Will relates to what is pleasurable and what is not pleasurable, whereas desire relates specifically only to what is pleasurable. Thus, they undertook deeds through will and intention, and they received the results through desire. Whoever is granted desire during the deed, and finds pleasure in the deed as he finds pleasure in its result, his bliss has been hastened for him. And whoever is granted will during the deed without desire, he is the person of striving (مجاهدة) who attains the result through desire, and this is a rank below the first.\n\nFurthermore, this class possesses, from the Real in this state, the form of overwhelming power (القهر) and triumph over that which naturally resists, so it does not resist, due to their knowledge of their attribute of power (الاقتدار) to bring it down. This results in their adherence to strictness (الشدائد) and abandonment of dispensations (الرخص). This is part of the states of the People of the Face.\n\nAs for the other two classes, one of them possesses Creation (التكوين) and the other Submission (التسليم). As for the People of Creation (أهل التكوين) among these two classes, their distinction lies in their states and their place in the Upper World (العالم العلوي) when they depart their physical bodies through death. The gates of heaven are opened for them, and their spirits ascend to where they are settled near the Lote Tree of the Utmost Boundary (سدرة المنتهى). They do not leave it until the Day of Resurrection (النشور).\n\nThis is because, during their deeds, they reached the utmost limit (المنتهى) in exerting their capacity regarding the obligations laid upon them. They died as nobles who exerted effort, leaving no room for further action, each according to his ability. There is no difference between one who gives a hundred thousand dinars in charity when he possesses nothing else, and one who gives a single coin (فلس) when he possesses nothing else. Both met in the exertion of capacity. From there, they were rewarded and gathered in one place, which is the Lote Tree of the Utmost Boundary, which was covered by the Light of Allah with what covered it, such that no one can describe it.\n\nAn example of this is clarified in the saying of the Lawgiver: \"A single dirham preceded a thousand,\" because the owner of the dirham had nothing else, so he gave it for Allah and returned to Allah, for he had no support to return to other than Him. The owner of the thousand gave some of what he possessed and kept what he could return to, so he did not return to Allah. Thus, the owner of the dirham preceded him to Allah. This is intelligible. Had the owner of the thousand given all that he possessed, like the owner of the dirham, he would have equaled him in station. The Lawgiver did not consider the amount of the gift, but rather what the giver returned to after the gift. He returned to Him.\n\nThose who return to Allah are the bankrupt (المفلسون) of everything besides Allah. Even if the person of wealth (صاحب الجدة) is one who sees the Real in every form, he does not grasp the rank of one who sees Him in nothingness (لا شيئ), for the latter sees Him in the transcendence of relations, in absolute freedom (الإطلاق), and in the absence of restriction (التقييد). There is no doubt that if the Real is restricted for the one to whom He discloses Himself in a form, that form restricts the viewer. He (Exalted is He) is present to every viewer in a form that others do not perceive. Thus, Absolute Existence (مطلق الوجود) is not perceived except by the bankrupt from whose witnessing the forms have vanished, as He said concerning the thirsty one: \"Until, when he came to it, he found it nothing\" (Q 24:39). He negated the 'thingness' of the object sought and \"found Allah with him,\" meaning, with nothingness, for <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing whatever like unto Him) and He <<غَنِيٌّ عَنِ الْعالَمِينَ>> (is Independent of the worlds). Therefore, none perceives Him except the one whom Allah has made bankrupt of the worlds.\n\nThe bankrupt of the worlds is at the extreme limit of independence from the worlds. When the means (الأسباب) were cut off from him, the Real returned him to Himself. He knew to Whom he returned and by what he returned. He returned by bankruptcy to the One who is Independent of him. Thus, he knew the Real truly and followed Him. The reality of his essence is non-existence and witnessing, and the reality of his Lord is Existence and witnessing.\n\nThe Prophet (peace and blessings be upon him), the possessor of the most perfect Unveiling (الكشف الأتم), said: \"The people of wealth (أصحاب الجد) are imprisoned.\" The imprisoned is restricted. The bankrupt has no wealth to restrict or imprison him; thus, he is absolutely free (مطلق) from the restriction that binds the people of wealth. He is closer to the form of absolute freedom than the people of wealth are, due to their restriction. The people of wealth are at the rank of one who sees the Real in things, and is necessarily restricted by them because the station dictates it. The bankrupt is Muhammadan; he has no station (مقام), for it was said to him: \"You have no share in the command\" (Q 3:128), thus making him bankrupt. Wealth (الجد) belongs only to the one who possesses the command (الأمر). Everyone who possesses the command is a person of wealth, because the command is for Creation (التكوين); whatever he wills comes into being. Thus, he is not bankrupt.\n\nWhoever departs from his reality has strayed from his path. What concern have creatures with Creation? If he speaks or commands by the Real, then Creation belongs to the Real, not to him, as He said concerning the one who possesses Creation: \"and you create of the bird by My leave\" (Q 5:110), and in another verse: \"and you create of the bird by the leave of Allah.\" He granted him and stripped him. Remaining upon the origin is more fitting, which is His saying to the noblest of people to Him, the most perfect in witnessing, and the highest in Existence: \"You have no share in the command,\" thus making him bankrupt. <<يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا>> (O people of Yathrib, there is no standing for you, so return) (Q 33:13). For Allah will bring you into existence in what you do not know. <<وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى>> (And you have certainly known the first creation) (Q 56:62), that it was in what is unknown. <<فَلَوْلَا تَذَكَّرُونَ>> (Then why do you not remember?) (Q 56:62).\n\nThus, the People of Allah never leave the locus of bankruptcy (الإفلاس). In every breath, they are upon clear evidence, not confusion, regarding new knowledge that was not previously with them, for He constantly brings them into existence in what they do not know. They are not people of speculation (نظر), planning (تدبير), or deliberation (روية), since speculation only occurs regarding existent materials, which are the limits that imprisoned others from the Knowledge of Allah. They are in <<لَبْسٍ مِنْ خَلْقٍ جَدِيدٍ>> (confusion regarding a new creation) (Q 50:15), and they are within it, <<وَهُمْ لَا يَشْعُرُونَ>> (while they perceive not). When they enter Paradise on the Day of Resurrection, they will only descend into what \"no eye has seen, nor ear heard, nor has it occurred to the heart of man.\" If it does not occur to the heart, which has the station of turning over (التقليب) faces, then what do you think of the intellect, which has no turning over? May Allah make us among these bankrupt ones and interpose between us and the station of the imprisoned people of wealth.\n\nFurthermore, the People of Creation (أصحاب التكوين), who possess the Divine Power to bring the essences into existence, when they witness the arrangement and order of the Cosmos, and that no void remains for their creation to fill, they realize that Allah has interposed between them and the creation of the non-existent (إيجاد المعدوم). True Creation is nothing other than that. What remains in their hands of creation is merely the changing of states, which is also found among the common people: one who is standing sits, or one who is sitting stands, or one who is still moves, or one who is moving becomes still. They have no power beyond this. For the Creation that is the bringing into existence of the non-existent has no remaining place in the Cosmos in which to manifest. The places have vanished due to what has filled them of the forms and essences of the Cosmos, in terms of its substance (جوهر). However, the loci (المحال) where the changing of states manifests have not vanished. Thus, the People of Creation possess only the ranks of the common people, except that the difference between them and the common people is that the common people have creation in the customary way, while these possess creation in the non-customary way, yet it is customary for them. Thus, they are in the position of the common people in their habits. The person of Existence and Witnessing (صاحب الوجود والشهود) never leaves the state of \"You have no share in the command.\"\n\nWhen the People of Creation observe what We mentioned—the filling of places, the order of the Cosmos, that it accepts neither increase nor decrease, and that it has been created in the most perfect form—and that they have no disposal except in the loci and the creation of Divine matters, such as the Divine Theophany in forms, their hearts are broken. They realize their incapacity, that they are deficient and restricted in Creation. They seek rest from the toil of Creation. The Divine Address comes to them in their secrets with His saying: <<أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ>> (Have you not considered your Lord, how He extends the shadow?) (Q 25:45), seeking rest. They find rest upon hearing this Address in His extended shadow. The shadow of a thing appears in the form of that thing. Thus, Allah made their rest through the Cosmos, not through Him. The bankrupt has no rest except through Him, for He has made him bankrupt of the Cosmos, so he finds no rest in the shadow.\n\nThe Cosmos has no ruling power over him, nor any distinction; he is for Allah, by Allah. If Allah wills rest for this bankrupt one, He draws the shadow toward Himself with a gentle drawing. The place of rest for this bankrupt one is then unveiled, because when He draws the shadow toward Himself, Light fills the place from which the shadow was drawn, and that is the place of rest for this bankrupt one. Due to his need, he is like one shivering from cold who seeks the sun to find rest in the Light. While the People of Creation find rest in the knowledge of His saying: \"Have you not considered your Lord, how He extends the shadow?\", the bankrupt finds rest by moving from this verse to His saying: \"Have you not considered your Lord,\" at the beginning of the command, and at its end to His saying: <<ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا>> (Then We draw it toward Us with a gentle drawing) (Q 25:46). Thus, he sees nothing in the beginning or the end but his Lord. He is the First in his witnessing and the Last at the conclusion of his existence.\n\nThe People of Creation remain in the knowledge of the extension of the shadow, not in its modality (كيفيته). The bankrupt ones only looked at the shadow from the perspective of how the Real addressed them, which is His saying: \"how He extends the shadow.\" Thus, they stood with the modality, which is Divine. They stood only with Allah, not with the shadow, because the modality is the witnessing of the One who extends it, not the witnessing of the extended thing. The Real made them, due to this station, pour forth upon the People of Creation from the sciences of life (علوم الحياة) by which their hearts are revived. When the People of Creation see the spiritual aid (الإمداد) coming to them, they look to see from which direction it came, and they see it coming from the direction of these Perfect Men (الكمل) of Allah. They realize that Allah has men above them who possess Divine Nearness (القربة الإلهية) due to what preceded for them with Allah. Because of this precedence, they are among the foremost (السابقين), hastening toward good deeds upon the path of moderation, giving every possessor of a right his due, just as Allah gave everything its creation. For these are the Throne (العرش), and for the People of Creation is the Couch (الفرش). For them is the Settling (الاستواء), and for the People of Creation is the Reclining (الاتكاء). For them is the Descent (النزول), and for the People of Creation is the Ascent and Elevation (الارتفاع والصعود). For them are the realities of the Names of Transcendence (التنزيه), and for the People of Creation are the realities of the Names of Similitude (التشبيه), for by them they change states in the loci. This is part of the state of the People of the Hand of Creation and the People of the Face who possess what is between the two Hands.\n\nAs for the People of Submission (أهل التسليم), they are in struggle and hardship, in the fire of striving (مجاهدة) and spiritual discipline (رياضة). They know neither the coolness of certainty (اليقين) nor the heat of longing (الاشتياق) for specification (التعيين). This is because longing relates only to what is known, and it belongs only to the People of the Letter (أصحاب الحروف) who worship Allah upon a letter (حرف) for its meaning. <<فَإِنْ أَصَابَهُ خَيْرٌ اطْمَأَنَّ بِهِ>> (If good befalls him, he is content with it) (Q 22:11)—that is, with the letter—because of the specific, restricted good that reached him through it, for the sake of which he adhered to this letter rather than others, since the letters are many. He is like one who <<أَسَّسَ بُنْيَانَهُ عَلَى شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ>> (established his building on the edge of a crumbling bank, and it collapsed with him) (Q 9:109). He is on the edge (شفا), not on healing (شفاء). Yet, despite this, the Mercy of Allah is comprehensive, and His favor is abundant.\n\nEvery existent in the Cosmos has two faces: an inner one <<فِيهِ الرَّحْمَةُ>> (wherein is mercy) (Q 57:13), and an outer one <<مِنْ قِبَلِهِ الْعَذَابُ>> (from its direction is torment) (Q 57:13), like the wall between Paradise and the Fire. The state of the servant depends on the face of every existent that he contemplates, because the Real described Himself with Wrath and Pleasure, and the Cosmos is upon His form. Therefore, the Cosmos must necessarily be upon what We mentioned: there must be the two Grasps (القبضتين), the two Hands (اليدين), the two Abodes (الدارين), and the Isthmus (البرزخ) between every two things. <<وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ>> (And of everything We created pairs) (Q 51:49), because it is created from two Attributes: Will (إرادة) and Saying (قول). These are the two that every creature witnesses from the Real, for the Cosmos is a result, and a result only comes from two premises. This is the Divine Procreation (التناسل الإلهي). For this reason, He brought it into existence upon the form, like the existence of the son upon the form of the father in every genus of creatures.\n\nThe Cosmos, in terms of its parts and details, is like the limbs for the Manifest Name (الاسم الظاهر), and in terms of its meanings and the details of its levels, it is like the inner spiritual powers that are known only by their effects, for the Hidden Name (الاسم الباطن). Thus, the existence of the Cosmos is established upon the Manifest and the Hidden. <<وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (And He is Knower of all things. There is no god but He, the All-Mighty, the All-Wise) (Q 41:12). We have thus explained in this station what is necessitated by the three Divine Faces and the three levels in which the differentiation among the Cosmos appeared.\n\nLet us mention the branches of knowledge contained within this station. First among them is the science of the glad tidings (المبشرات), and the science of the Divine Balance (الميزان) held by Him for lowering and raising, whose account is mentioned in the Prophetic tradition witnessed by the Real. In it is the science of natural movements specifically. In it is the science of the analysis of compounds (تحليل المركبات). In it is the science of what appears to the one who receives unveiling (المكاشف) when he witnesses the Dust (الهباء)—which the philosophers call Prime Matter (الهيولى)—of the forms of the Cosmos before their essences appear in the Universal Body (الجسم الكل). In it is the science of the First Singularity (الفردية الأولى) in which the Divine, spiritual, natural, and elemental procreation and generation occurred, which is a precious science. In it is the science of Divine Power (الاقتدار الإلهي), concerning whom it is effective and whom it is not effective in, and why it is not effective in some contingent beings (الممكنات), and what prevents that—does the combination of opposites render it impossible, while the Origin (الأصل) combines opposites, indeed, is the very essence of the opposites? In it is the science of beautification and uglification (التحسين والتقبيح). In it is the science of the two existences (النشأتين). In it is the science of the life (الحياة) flowing through all existents, until they speak, glorifying Allah with His praise. In it is the science of natural materials and elemental materials. In it is the science of the Beginning and the Return (المبدأ والمعاد). In it is the science of the Origin to which these materials return. In it is the science of the Elements (الأسطقسات). In it is the science of the levels of knowledge. In it is the science of the Divine Words (الكلمات الإلهية) in terms of their composition. In it is the science of the Inscribed Book (الكتاب المسطور) upon the Unrolled Parchment (الرق المنشور). In it is the science of the transcendence (تنزيه) of the Scrolls (الصحف) and their rank among the Books, and what the Scribes (السفرة) who carry them are. In it is the science of distinctions by limits, in which essences it appears, and since there is only one in Existence, by what is it distinguished, and from what is it distinguished, and what is there then? In it is the science of nourishment by non-existence (التغذي بالعدم). In it is the science of the difference between the relation of the Real in nearness among the living and the relation of His nearness among the dead. In it is the science of the Return (الرجعة). In it is the science of the reward (الثواب) for every single class—meaning, the specification of their reward—and the difference between the People of Light (أصحاب النور) and the People of Wages (أصحاب الأجور), and how a servant can be a hired worker for the one who is a servant to him, without being a *mukātab* or *mudabbar* (types of contractual slaves). In it is the science of the transcendence of Divine Majesty (العظمة الإلهية) from subsisting in the created things (الأكوان). In it is the science of the reason that, if known by the one who knows it, he would not die as long as that knowledge is witnessed by him. These are the fundamental sciences contained within this station, and they hold endless details. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way) (Q 33:4).",
    "ur": "باب نمبر تین سو اٹھائیس: مرکبات کا پگھلنے (سبک) پر بسیط (سادہ) چیزوں کی طرف لوٹ جانے کی منزل کی معرفت میں، اور یہ حضرت محمدیہ (الحضرة المحمدیۃ) سے ہے۔\n\nاس منزل میں داخلہ موت سے بچاتا ہے جب تک تم اس میں رہو، اور یہ ایک عجیب منزل ہے۔\n\n> بے شک مقرب (بندہ) روح اور ریحان کا مالک ہے\n> جنت خلد میں نعمت اور احسان سے۔\n>\n> وہ عذابِ نار سے منعم ہے، تم اسے دیکھو گے\n> کہ وہ علم اور ایمان سے اللہ کی تسبیح کر رہا ہے۔\n>\n> ایک ایسی نشأت (پیدائش) کے ساتھ جس کی کوئی حد نہیں کہ تم اس تک پہنچ سکو\n> (اس کا) حکم نقص اور زیادتی سے پاک ہے۔\n\nاسی منزل سے فقراء کے لیے واقعات (وقائع) ہوتے ہیں، اور یہی مبشرات (خوشخبریاں) اور سچے خواب (الرؤیا الصادقۃ) ہیں، جو پریشان خواب (أضغاث أحلام) نہیں ہوتے، اور یہ نبوت کے اجزاء میں سے ایک جز ہے۔ اور اسی منزل سے مکاشف (جس پر کشف ہوا ہو) کو اس میزان (ترازو) کا کشف (الکشف) حاصل ہوتا ہے جو ذات حق (الحق) کے ہاتھ میں ہے، جس سے وہ پست کرتا ہے اور بلند کرتا ہے۔\n\n### مبشرات (خوشخبریاں) اور سچے خواب (الرؤیا الصادقۃ)\n\nجان لو کہ جب تحلیل (decomposition) مرکبات پر وارد ہوتی ہے تو وہ صورت (شکل) کی عینیت کو ختم کر دیتی ہے لیکن جوہر کی عینیت کو ختم نہیں کرتی۔ اور اللہ نے اسے عارفین باللہ کے لیے ایک مثال بنایا ہے اس چیز میں جو ممکنات کی اعیان (حقیقتوں) کی ذات حق (الحق) کے ساتھ ترکیب سے ظاہر ہوتی ہے، پس ذات حق (الحق) کی عینیت میں وہ صورتیں ظاہر ہوتی ہیں جو ظاہر ہوتی ہیں۔ پس جب ذات حق (الحق) اور خلق کے درمیان تناسب اٹھا لیا جاتا ہے تو ان صورتوں کی اعیان ختم ہو جاتی ہیں، اور ممکنات کی اعیان اور ذات حق (الحق) کی عینیت باقی رہتی ہے، اس حیثیت سے کہ وہ عالمین سے بے نیازی (الغنی عن العالمین) کے ساتھ موصوف ہے۔ لہٰذا حواس کے لیے ظاہر ہونے والی صورتوں کے ختم ہونے سے اعیان ختم نہیں ہوئیں۔\n\nاور جان لو کہ ذات حق (الحق) سے ظاہر ہونے والی صورتیں تین مراتب پر ہیں، کیونکہ ذات حق (الحق) کے عالم میں تین رُخ (اوجه) ہیں، اس لیے کہ اس نے خود کو دو ہاتھوں سے موصوف کیا جن سے اس نے عالم کو قبض کیا، اور نبی صلی اللہ علیہ وسلم نے یہ بات ان دو کتابوں میں ظاہر فرمائی جو آپ نے اپنے صحابہ کے سامنے نکالیں: ایک میں اہل جنت کے نام، ان کے آباؤ اجداد، قبیلوں اور خاندانوں کے نام تھے، اور دوسری میں اہل نار کے نام، ان کے آباؤ اجداد، قبیلوں اور خاندانوں کے نام تھے۔ اور اہل اللہ اور اس کے خاص بندوں کے لیے کوئی تیسری کتاب نہیں نکالی، کیونکہ ان کی کتاب قرآن ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اہل قرآن ہی اہل اللہ اور اس کے خاص بندے ہیں۔\"\n\nاور ان کی منزل ان دو ہاتھوں کے درمیان ہے، پس ان کے لیے قلب اور سینہ ہے جو اس کا محل اور اس کی حضرہ (حضور) ہے۔ اور یہی اہل قربت (أهل القربۃ) کا مقام ہے جو خوش نصیبوں (السعداء) میں خاص ہیں، اس نے انہیں ہر حقدار کو اس کا حق دینے کے اعتدال (الاقتصاد) کے طریقے پر نیکیوں میں سبقت لے جانے کا وارث بنایا۔ پس رُخوں کی تقسیم کی وجہ سے عالم تین حصوں میں تقسیم ہو گیا: ہر ہاتھ کے لیے ایک خاص صنف ہے، اور جو ان دونوں کے درمیان ہے اس کے لیے ایک خاص صنف ہے۔ اور ہاتھوں کی اصناف کے لیے عظمت اور ہیبت کا مرتبہ ہے۔ جہاں تک ایک ہاتھ کا تعلق ہے، اس سے منسوب صنف اپنی ذات میں عظیم الشان ہے، اس کے لیے ذاتی عظمت ہے۔ اور دوسری صنف مرتبے میں عظیم ہے، لیکن اس کی عظمت ذاتی نہیں ہے، لہٰذا اسے اس کے مرتبے کی وجہ سے تعظیم دی جاتی ہے نہ کہ اس کی اپنی ذات کی وجہ سے، جیسے دنیا میں عہدوں والے (أصحاب المناصب)، کیونکہ وہ اپنی ذات میں فضیلت والے نہیں ہوتے، لہٰذا انہیں ان کے منصب کی وجہ سے تعظیم دی جاتی ہے، اور جب انہیں معزول کر دیا جاتا ہے تو وہ تعظیم جو لوگوں کے دلوں میں ان کے لیے تھی، ختم ہو جاتی ہے۔ پس یہ دونوں گروہوں کے درمیان فرق ہے۔ پس اہل اللہ کا ایک گروہ عالم میں باللہ (اللہ کے ذریعے) ظاہر ہوتا ہے، اور دوسرا گروہ عالم میں للہ (اللہ کے لیے) ظاہر ہوتا ہے۔ اور وہ صنف جو دونوں ہاتھوں کے درمیان ہے، وہ مجموعی طور پر اور زیادتی کے ساتھ ظاہر ہوتی ہے۔ جہاں تک زیادتی کا تعلق ہے، تو وہ اس ذات کے ذریعے ان کا ظہور ہے جس نے دونوں ہاتھوں کو جمع کیا، اور وہ اپنے احوال میں الٰہی دوڑ (الھرولۃ الإلٰہیۃ) والے ہیں، جس کے ذریعے انہوں نے موطن تکلیف (جہاں احکام دیے گئے) میں تیزی کی۔ اور دونوں ہاتھوں والے الٰہی بازو (الذراع) اور قد (الباع) والے ہیں، جب وہ موطن تکلیف میں ظاہر ہوئے تو خطاب کے شبر (بالشت) اور ذراع (ہاتھ) کے ساتھ متعین ہونے پر فضیلت واقع ہوئی تاکہ مرتبے میں تمیز ہو سکے۔ پس وہ صنف جو دونوں ہاتھوں کے درمیان ہے، کہتی ہے:\n\n> میں وہ ہوں جسے میں چاہتا ہوں\n> اور جسے میں چاہتا ہوں وہ میں ہوں۔\n\nیہ ایک دائمی مشاہدہ (مشاھدۃ) ہے جس کے مراتب منقطع نہیں ہوتے، اگرچہ ان کے ذوق مختلف ہوں۔ بے شک اللہ کا ایک عرش ہے، اور وہ اس دائمی صورت میں صرف اس عرش کے مالکوں پر ہی ظہور الٰہی (التجلی) فرماتا ہے، اور وہ اہل عرش ہیں، اور وہ اہل وجہ (رُخ والے) ہیں۔ وہ اس ظہور الٰہی (التجلی) میں ایک دوسرے کو دیکھتے ہیں، اور ایک دوسرے کو ان انوار سے ڈھانپتے ہیں جن پر وہ ہیں، اس کے باوجود کہ وہ ظہور الٰہی (التجلی) اور نظر کی حالت میں ہیں۔ اور خیال اور مثال کی حضرہ (حضور) کے علاوہ کوئی ایسا مقام نہیں جو ذات حق (الحق) کے ظہور الٰہی (التجلی) اور خلق کے دیدار کو جمع کرتا ہو، سوائے اہل وجہ (أصحاب الوجہ) کے مقام کے۔ ذات حق (الحق) نے انہیں اس محل کی قوت عطا کی جس میں اس نے انہیں ٹھہرایا، اور وہ مقامِ اقامت ہے، اور یہی وہ ہے جو رسول اللہ صلی اللہ علیہ وسلم کو آپ کے بعض معراجوں میں ظاہر ہوا، پس آپ نے اس کے قریب ہونے کی حالت میں اسے موتیوں اور یاقوت کے رفرف (بچھونے) سے تعبیر فرمایا۔ پس آپ اپنے معراج میں براق سے رفرف کی طرف منتقل ہوئے۔ پس جو اس مقام کو حاصل کر لیتا ہے، اس کا مشاہدہ (مشاھدۃ) دائمی ہو جاتا ہے، اور وہ اسے نہ اپنی ذات سے غائب کرتا ہے اور نہ اپنی ملکیت سے۔ اور وہ کثرت کو واحد میں اور تفرقہ کو جمع میں دیکھتا ہے۔ اور اس صنف کے لیے وجہ (رُخ) سے ایسی صورتیں ظاہر ہوتی ہیں جو ایسے علوم کو اٹھائے ہوئے ہوتی ہیں جن کا ان کے اور ان صورتوں کے درمیان عملی تعلق اور مناسبت ہوتی ہے، اور ایسے علوم بھی جن کا ان کے درمیان کوئی تعلق نہیں ہوتا، بلکہ وہ ان کے لیے اللہ کے فضل کی زیادتی ہوتی ہے جو انہیں عینِ احسان (عین المنۃ) سے رزق کے طور پر دیے جاتے ہیں۔ وہ یہ علوم صرف ان صورتوں سے حاصل کرتے ہیں جو وجہ (رُخ) سے پھوٹتی ہیں۔ پس وجہ (رُخ) انہیں صورتوں اور ان کے اٹھائے ہوئے علوم کے دیدار سے نہیں روکتا، اور نہ ہی صورتیں اور ان کے اٹھائے ہوئے علوم ان علوم کے ذوق کو وجہ (رُخ) سے روکتے ہیں۔ اور یہ مرتبہ خوش نصیبوں (السعداء) کے لیے سب سے اعلیٰ مرتبہ ہے۔ پھر وہ ان علوم سے جو انہیں ان صورتوں سے حاصل ہوئے، اہل ید (ہاتھوں والوں) پر فیضان کرتے ہیں۔ پس اہل ید (أصحاب الأیدی) انہیں صرف اہل وجہ (أصحاب الوجہ) کی وساطت سے ہی حاصل کرتے ہیں، جیسا کہ اہل وجہ (أصحاب الوجہ) نے بھی انہیں صرف ان صورتوں سے حاصل کیا، وجہ (رُخ) سے حاصل نہیں کیا۔ اور اس کی وجہ یہ ہے کہ وہ علوم مختلف ذوقوں والے ہیں، اور وجہ (رُخ) میں کوئی اختلاف نہیں ہے۔ لہٰذا ان مراتب کی تمیز کا ان صورتوں کے وجود سے ظاہر ہونا ضروری ہے تاکہ مشارب (طریقوں) کا تنوع معلوم ہو سکے۔ پس جو تنوع کے تعلق سے تھا، وہ ان کے احوال کے شبر (بالشت)، ذراع (ہاتھ) اور سعی (کوشش) کے تنوع کی وجہ سے تھا، پس مشروب (پینے کی چیز) ذراع، باع (قد) اور ہرولہ (دوڑ) کے ساتھ متنوع ہوا۔ اور جو مشارب (طریقے) متنوع ہوئے جن کا ان کے اور ان کے درمیان کوئی تعلق نہیں تھا، تو جان لو کہ یہ ان استعدادات میں سے ہے جن پر ان کی نشأت (پیدائش) قائم ہے، جو اس عملی استعداد سے مختلف ہے جسے شبر اور ذراع کی مقدار سے کنایہ کیا گیا ہے۔ پس الٰہی عطیات (الھبات الإلٰہیۃ) اسی وجہ سے مختلف ہوئے، اور یہ سب کچھ ان کی عقلوں کو زائل نہیں کرتا اور نہ ہی ان کی حقائق کے مراتبِ حصوں میں کوئی کمی کرتا ہے۔ پس وہ ایک ہی وقت میں ہر عضو اور ہر حقیقت سے لطف اندوز ہوتے ہیں جس پر وہ ہیں، ایک چیز کی نعمت انہیں دوسری چیز کی نعمت سے نہیں روکتی۔ اور جو یہ جانتا ہے، وہ آخرت کی نشأت (پیدائش) کی صورت کو جانتا ہے، اور یہ کہ وہ کسی مثال پر نہیں ہے، جیسا کہ دنیا کی نشأت بھی کسی مثال پر نہیں تھی۔ اور اس صنف کے لیے اس مقام میں اس سے زیادہ حیرت انگیز کوئی چیز نہیں کہ جب ان پر وجہ (رُخ) کی صورتیں ظہور الٰہی (التجلی) کرتی ہیں، تو وہ علوم کو مشروبات (پینے کی چیزوں) میں فنا کر دیتے ہیں، اور وہ ایسی حقائق پر ہوتے ہیں کہ ہر وہ چیز جو وہ لائے ہیں، وہ چاہتے ہیں کہ اس میں سے انتخاب کریں، باوجود اس کے کہ وہ ان کے لیے ہیں اور انہیں ان کا حاصل ہونا ضروری ہے۔ اور میں تمہیں اس کی وجہ بتاتا ہوں کہ ان کا انتخاب صرف ان علوم میں ہوتا ہے جن کا ان مشارب (طریقوں) سے ان کے درمیان تعلق ہوتا ہے، نہ کہ وہبی علوم (علوم الوھب) میں۔ اور یہ اس لیے ہے کہ وہ اپنے سلوک اور اعمال کی تخلیق کے دوران بعض اعمال کو بعض پر ترجیح دیتے تھے، اور انہیں اس چیز کی وجہ سے مقدم کرتے تھے جس کا تقاضا زمان، مکان یا حال کرتا تھا۔ پس جب اس ظہور الٰہی (التجلی) میں ان اعمال کے نتائج ظاہر ہوتے ہیں، تو ان کی طرف سے بعض کو بعض پر تناول (حاصل کرنے) کے لیے مقدم کرنے کا انتخاب واقع ہوتا ہے، اسی صورت پر جو ان کے اعمال کی حالت میں جاری ہوا تھا۔ کیا تم آخرت میں اس کے قول کی حکمت نہیں دیکھتے: \"بے شک اہل سعادت کے لیے وہ ہے جو ان کے نفوس چاہتے ہیں\" (إِنَّ لِأَهْلِ السَّعَادَةِ مَا تَشْتَهِي نُفُوسُهُمْ) اور یہ نہیں فرمایا کہ \"جو ان کے نفوس ارادہ کرتے ہیں\"۔ اور شہوت ارادہ ہی ہے، لیکن چونکہ ہر مراد (جس کا ارادہ کیا جائے) شہوت انگیز نہیں ہوتا، اس لیے ہر ارادہ شہوت نہیں ہوتا۔ کیونکہ ارادہ اس چیز سے متعلق ہوتا ہے جس سے لذت حاصل ہو اور اس سے بھی جس سے لذت حاصل نہ ہو، جبکہ شہوت صرف خاص طور پر لذت بخش چیز سے متعلق ہوتی ہے۔ پس انہوں نے اعمال کو ارادے اور قصد سے لیا، اور نتائج کو شہوت سے لیا۔ پس جسے عمل کی حالت میں شہوت عطا ہوئی اور اس نے عمل سے اسی طرح لذت حاصل کی جیسے اس کے نتیجے سے، تو اس کے لیے اس کی نعمت جلدی کر دی گئی۔ اور جسے عمل کی حالت میں بغیر شہوت کے ارادہ عطا ہوا، تو وہ مجاہدہ (کوشش) والا ہے، اس نے نتیجہ شہوت کے ساتھ حاصل کیا، اور یہ پہلے مرتبے سے کم ہے۔ پھر اس صنف کے لیے ذات حق (الحق) کی طرف سے اس حال میں قہر (غلبہ) اور ظفر (کامیابی) کی صورت ہوتی ہے، اس چیز پر جو رکنے کی صلاحیت رکھتی ہے، لیکن وہ نہیں رکتی، اس علم کی وجہ سے جو اسے اپنی صفتِ اقتدار (قدرت) کے بارے میں ہوتا ہے کہ وہ اسے نازل کر سکتا ہے۔ اس نے اس کے لیے سختیوں کو اختیار کرنے اور رخصتوں کو چھوڑنے کا نتیجہ پیدا کیا۔ پس یہ اہل وجہ (أصحاب الوجہ) کے بعض احوال ہیں۔\n\nاور جہاں تک باقی دو اصناف کا تعلق ہے، تو ان میں سے ایک کے لیے تکوین (پیدا کرنا) ہے اور دوسرے کے لیے تسلیم (سپردگی) ہے۔ جہاں تک ان دو اصناف میں سے اہل تکوین (أهل التکوین) کا تعلق ہے، تو ان کی تمیز ان کے احوال اور عالم علوی میں ان کے مقام میں ہے، جب وہ موت کے ذریعے اپنے جسموں کو چھوڑتے ہیں اور ان کے لیے آسمان کے دروازے کھول دیے جاتے ہیں، اور ان کی روحوں کو وہاں چڑھایا جاتا ہے جہاں انہیں سدرۃ المنتہیٰ کے پاس ٹھہرایا جاتا ہے، وہ قیامت کے دن تک وہاں سے نہیں ہٹیں گے۔ کیونکہ وہ اپنے اعمال کی حالت میں ان کاموں میں اپنی وسعت خرچ کرنے کی انتہا کو پہنچ گئے جن کے وہ مکلف تھے، اور وہ ایسے تیر اندازوں کی طرح مرے جنہوں نے ایسی کوشش کی کہ ان کے لیے کوئی گنجائش باقی نہ رہی، ہر ایک اپنی طاقت کے مطابق۔ پس اس شخص میں کوئی فرق نہیں جو ایک لاکھ دینار صدقہ کرتا ہے اگر اس کے پاس اس کے سوا کچھ نہ ہو، اور اس شخص میں جو ایک فلس (سکہ) صدقہ کرتا ہے اگر اس کے پاس اس کے سوا کچھ نہ ہو۔ پس دونوں وسعت خرچ کرنے میں جمع ہو گئے، اور اسی وجہ سے انہیں جزا دی گئی اور انہیں ایک ہی جگہ جمع کیا گیا، اور وہ سدرۃ المنتہیٰ ہے جسے اللہ کے نور نے ڈھانپ لیا جو ڈھانپ لیا، پس کوئی اس کی صفت بیان نہیں کر سکتا۔ اور اس کی مثال شارع (نبی صلی اللہ علیہ وسلم) کے اس قول میں واضح ہو چکی ہے کہ \"ایک درہم ہزار پر سبقت لے گیا\"، کیونکہ درہم والے کے پاس اس کے سوا کچھ نہیں تھا، پس اس نے اسے اللہ کے لیے خرچ کر دیا اور اللہ کی طرف لوٹ گیا، کیونکہ اس کے پاس اس کے سوا کوئی سہارا نہیں تھا جس کی طرف وہ لوٹتا۔ اور ہزار والے نے اپنے پاس موجود چیزوں میں سے کچھ دیا اور وہ چیز چھوڑ دی جس کی طرف وہ لوٹتا، پس وہ اللہ کی طرف نہیں لوٹا، لہٰذا درہم والا اس سے اللہ کی طرف سبقت لے گیا۔ اور یہ بات معقول ہے۔ پس اگر ہزار والا بھی درہم والے کی طرح اپنا سب کچھ خرچ کر دیتا تو وہ مقام میں اس کے برابر ہو جاتا۔ پس شارع نے عطیہ کی مقدار کو نہیں دیکھا، بلکہ اس چیز کو دیکھا جس کی طرف دینے والا عطیہ کے بعد لوٹتا ہے۔ پس وہ اس چیز کی طرف لوٹا جس کی طرف وہ لوٹتا تھا۔ پس اللہ کی طرف لوٹنے والے وہ ہیں جو اللہ کے سوا ہر چیز سے مفلس (خالی) ہیں۔ اور اگرچہ صاحبِ جد (طاقتور/مالدار) ان لوگوں میں سے ہے جو ذات حق (الحق) کو ہر صورت میں دیکھتے ہیں، لیکن وہ اس شخص کے مرتبے کو نہیں پا سکتا جو اسے \"لا شیء\" (کچھ نہیں) میں دیکھتا ہے۔ کیونکہ وہ اسے نسبتوں کے اٹھ جانے، اطلاق (آزادی) اور عدمِ تقیید (غیر مقید ہونے) میں دیکھتا ہے۔ اور اس میں کوئی شک نہیں کہ جب ذات حق (الحق) کسی صورت میں ظہور الٰہی (التجلی) کرنے والے کے لیے مقید ہو جاتا ہے، تو وہ صورت دیکھنے والے کو مقید کر دیتی ہے، اور وہ (اللہ) ہر دیکھنے والے کے نزدیک ایک ایسی صورت میں ہوتا ہے جسے دوسرا نہیں پا سکتا۔ پس مطلق ہستی (الوجود) کو صرف وہی مفلس (خالی) شخص پا سکتا ہے جس کے شہود (الشہود) سے صورتیں ختم ہو چکی ہوں، جیسا کہ اس نے پیاسے کے بارے میں فرمایا: \"یہاں تک کہ جب وہ اس کے پاس آیا تو اسے کچھ نہ پایا۔\" (حَتَّى إِذَا جَاءَهُ لَمْ يَجِدْهُ شَيْئًا) پس اس نے مقصود کی شیئیت (کچھ ہونے) کی نفی کر دی، اور اللہ کو اپنے پاس پایا، یعنی \"لا شیء\" (کچھ نہیں) کے پاس۔ کیونکہ لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثل کوئی چیز نہیں) اور وہ غَنِيٌّ عَنِ الْعَالَمِينَ (عالمین سے بے نیاز) ہے۔ پس اسے صرف وہی پا سکتا ہے جسے اللہ نے عالمین سے مفلس کر دیا ہو۔ اور عالمین سے مفلس شخص عالمین سے بے نیازی (الغنی عن العالمین) کی انتہا پر ہوتا ہے، جب اس سے اسباب کٹ جاتے ہیں تو ذات حق (الحق) اسے اپنی طرف لوٹا دیتا ہے، پس وہ جانتا ہے کہ وہ کس کی طرف لوٹا اور کس چیز کے ساتھ لوٹا۔ پس وہ اس ذات کی طرف افلاس (خالی پن) کے ساتھ لوٹا جس کے لیے اس سے بے نیازی ہے، پس اس نے ذات حق (الحق) کو حق جانا اور اس کی پیروی کی۔ پس اس کی اپنی عینیت کا حق عدم اور شہود (الشہود) ہے، اور اس کے رب کا حق وجود (الوجود) اور شہود (الشہود) ہے۔ صاحب کشف اتم (الکشف الأتم) نے فرمایا: \"بے شک اصحاب جد (طاقتور/مالدار) محبوس ہیں، اور محبوس مقید ہوتا ہے۔ اور مفلس کے پاس کوئی جد نہیں جو اسے مقید کرے اور نہ ہی محبوس کرے، پس وہ اس تقیید سے مطلق (آزاد) ہے جو اصحاب جد کے لیے ہے۔\" پس وہ اطلاق (آزادی) کے ساتھ صورت کے زیادہ قریب ہے بہ نسبت اصحاب جد کے، ان کے مقید ہونے کی وجہ سے۔ پس اصحاب جد اس مرتبے میں ہیں جو ذات حق (الحق) کو چیزوں میں دیکھتے ہیں، پس وہ اسے ان چیزوں کے ساتھ مقید کر دیتے ہیں، کیونکہ مقام ان پر حکم کرتا ہے۔ اور مفلس محمدی (الحقیقۃ المحمدیۃ) ہے، اس کا کوئی مقام نہیں، کیونکہ اسے کہا گیا: \"آپ کے لیے امر (حکم) میں سے کچھ نہیں ہے\" (لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ)، پس اسے مفلس کر دیا گیا۔ اور جد (طاقت) صرف اس کے لیے ہے جس کے لیے امر (حکم) ہے۔ پس ہر وہ شخص جس کے لیے امر ہے، وہ صاحب جد ہے، کیونکہ امر تکوین (پیدا کرنے) کے لیے ہے، پس جو وہ ارادہ کرتا ہے وہ ہو جاتا ہے، پس وہ مفلس نہیں ہے۔ اور جو اپنی حقیقت سے باہر نکلا، وہ اپنے راستے سے بھٹک گیا۔ پس خلق کا تکوین سے کیا تعلق؟ اگر وہ حق کے ساتھ کہے یا حکم دے، تو تکوین ذات حق (الحق) کے لیے ہے نہ کہ اس کے لیے، جیسا کہ اس نے اس شخص کے بارے میں فرمایا جس کے لیے تکوین ہے: \"تو وہ میرے اذن سے پرندہ ہو جاتا ہے\" (فَيَكُونُ طَائِرًا بِإِذْنِي) اور دوسری آیت میں: \"تو وہ اللہ کے اذن سے پرندہ ہو جاتا ہے\" (فَيَكُونُ طَائِرًا بِإِذْنِ اللَّهِ)۔ پس اسے عطا کیا اور پھر اسے چھین لیا۔ پس اصل پر باقی رہنا زیادہ بہتر ہے، اور وہ اس کا قول ہے جو اس کے نزدیک سب سے زیادہ مکرم، شہود (الشہود) میں سب سے زیادہ کامل اور ہستی (الوجود) میں سب سے زیادہ بلند ہے: \"آپ کے لیے امر میں سے کچھ نہیں ہے\" (لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ)، پس اسے مفلس کر دیا۔ \"اے اہل یثرب! تمہارے لیے کوئی ٹھکانہ نہیں، پس لوٹ جاؤ، بے شک اللہ تمہیں اس چیز میں پیدا کرے گا جسے تم نہیں جانتے۔\" (يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا فَإِنَّ اللَّهَ يُنْشِئُكُمْ فِي مَا لَا تَعْلَمُونَ) \"اور تم پہلی پیدائش کو جان چکے ہو، بے شک وہ اس چیز میں تھی جسے نہیں جانا جاتا تھا، پس تم کیوں نہیں نصیحت حاصل کرتے؟\" (وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى إِنَّهَا كَانَتْ فِيمَا لَا يُعْلَمُ فَلَوْلَا تَذَكَّرُونَ) پس اہل اللہ افلاس (خالی پن) کے مقام سے نہیں ہٹتے، پس وہ ہر سانس میں ایک نئے علم کی واضح دلیل پر ہوتے ہیں جو ان کے پاس نہیں تھا، کیونکہ وہ اسے ہمیشہ اس چیز میں پیدا کرتا ہے جسے وہ نہیں جانتے۔ پس وہ نہ تو نظر و تدبیر والے ہیں اور نہ ہی غور و فکر والے، کیونکہ نظر صرف وجودی مواد میں ہوتی ہے، اور وہ حدود ہیں جنہوں نے انہیں اللہ کے علم سے روکا ہوا ہے۔ پس وہ ایک نئی تخلیق (خلق جدید) کے التباس میں ہیں، اور وہ اس میں ہیں اور انہیں شعور نہیں ہے۔ پس جب وہ قیامت کے دن جنت میں داخل ہوں گے، تو وہ اس سے صرف اسی چیز میں اتریں گے جسے نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی بشر کے دل پر اس کا خیال گزرا۔ اور جب وہ دل پر بھی نہیں گزرتا، حالانکہ دل کے لیے رُخوں میں پلٹنے کا مقام ہے، تو تمہارا عقل کے بارے میں کیا خیال ہے جس کے پاس پلٹنے کی صلاحیت نہیں ہے؟ اللہ ہمیں ان مفلسین میں سے بنائے اور ہمارے اور محبوس اصحاب جد کے مقام کے درمیان رکاوٹ ڈالے۔\n\nپھر اہل تکوین (أصحاب التکوین) جن کے لیے اعیان (حقیقتوں) کو وجود میں لانے کی الٰہی قوت ہے، جب وہ عالم کی ترتیب اور تنظیم کا مشاہدہ کرتے ہیں، اور یہ کہ اس میں کوئی خلا باقی نہیں رہا جسے ان کی تکوین آباد کر سکے، تو وہ اس وقت جان لیتے ہیں کہ اللہ نے ان کے اور معدوم (جو موجود نہیں) کو وجود میں لانے کے درمیان رکاوٹ ڈال دی ہے۔ اور حقیقی تکوین صرف یہی ہے (معدوم کو وجود میں لانا)۔ پس جو تکوین ان کے ہاتھوں میں حاصل ہوئی وہ صرف احوال کی تبدیلی ہے، اور یہی عام لوگوں میں بھی موجود ہے: وہ کھڑا ہوتا ہے تو بیٹھ جاتا ہے، یا بیٹھا ہوتا ہے تو کھڑا ہو جاتا ہے، یا ساکن ہوتا ہے تو حرکت کرتا ہے، یا متحرک ہوتا ہے تو ساکن ہو جاتا ہے۔ ان کی قدرت میں اس کے سوا کچھ نہیں۔ کیونکہ وہ تکوین جو معدوم کو وجود میں لانا ہے، اس کے لیے عالم میں کوئی جگہ باقی نہیں رہی جہاں وہ ظاہر ہو سکے، پس جگہیں ان صورتوں اور اعیان سے آباد ہو کر ختم ہو گئیں جو عالم کے جوہر سے تھیں۔ اور وہ محل (جگہیں) ختم نہیں ہوئیں جہاں احوال کی تبدیلی ظاہر ہوتی ہے۔ پس اہل تکوین (أصحاب التکوین) کے لیے عوام کے مراتب کے سوا کچھ نہیں، سوائے اس فرق کے کہ عوام کے لیے تکوین معمول کے مطابق ہوتی ہے، اور ان کے لیے تکوین غیر معمول کے مطابق ہوتی ہے، لیکن وہ ان کے لیے معمول بن جاتی ہے۔ پس وہ اپنی عادات میں عوام کے درجے پر ہیں۔ اور صاحب ہستی (الوجود) اور شہود (الشہود) \"آپ کے لیے امر میں سے کچھ نہیں ہے\" کے مقام سے نہیں ہٹتا۔ پس جب اہل تکوین (أهل التکوین) اس چیز کا مشاہدہ کرتے ہیں جو ہم نے جگہوں کی آبادی اور عالم کی تنظیم کے بارے میں ذکر کیا، اور یہ کہ وہ زیادتی یا کمی کو قبول نہیں کرتا، اور یہ کہ وہ کامل ترین صورت میں پیدا کیا گیا ہے، اور ان کے لیے صرف محلوں میں تصرف باقی ہے اور الٰہی چیزوں کو وجود میں لانا جیسے صورتوں میں ظہور الٰہی (التجلی الإلٰہی)، تو ان کے دل ٹوٹ جاتے ہیں اور وہ اپنی عاجزی کو جان لیتے ہیں، اور یہ کہ وہ تکوین میں قاصر اور مقید ہیں۔ پس وہ تکوین کی تھکاوٹ سے راحت طلب کرتے ہیں، تو ان کے اسرار میں الٰہی خطاب آتا ہے اس قول کے ساتھ: \"کیا تم نے اپنے رب کو نہیں دیکھا کہ اس نے سائے کو کیسے پھیلایا؟\" (أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ) تاکہ راحت حاصل ہو۔ پس وہ اس خطاب پر اس کے پھیلے ہوئے سائے میں راحت پاتے ہیں، اور چیز کا سایہ چیز کی صورت پر ظاہر ہوتا ہے۔ پس اللہ نے ان کی راحت عالم کے ذریعے بنائی، نہ کہ اپنے ذریعے۔ اور مفلس کے لیے اس (اللہ) کے سوا کوئی راحت نہیں، کیونکہ اس نے اسے عالم سے مفلس کر دیا ہے، پس اس کے لیے سائے میں کوئی راحت نہیں۔ پس عالم کا اس پر کوئی حکم نہیں اور نہ کوئی فضیلت، پس وہ اللہ کے لیے اللہ کے ذریعے ہے۔ پس جب اللہ اس مفلس کی راحت چاہتا ہے، تو وہ سائے کو اپنی طرف ہلکا سا قبض کر لیتا ہے، پس اس مفلس کے آرام کی جگہ سے پردہ ہٹ جاتا ہے۔ کیونکہ جب وہ سائے کو اپنی طرف قبض کرتا ہے، تو نور اس جگہ کو آباد کر دیتا ہے جہاں سے یہ سایہ قبض کیا گیا تھا، اور یہی اس مفلس کے آرام کی جگہ ہے۔ کیونکہ وہ اپنی ضرورت کی وجہ سے سردی زدہ شخص کی طرح ہے جو سورج کو طلب کرتا ہے تاکہ اسے نور میں راحت ملے۔ پس جب اہل تکوین (أهل التکوین) اس کے قول \"کیا تم نے اپنے رب کو نہیں دیکھا کہ اس نے سائے کو کیسے پھیلایا؟\" کے علم میں راحت پاتے ہیں، تو مفلس اس آیت سے اس کے قول \"کیا تم نے اپنے رب کو نہیں دیکھا؟\" کی طرف راحت پاتا ہے، اس کے امر کی ابتدا میں اور اس کے اختتام میں اس کے قول \"پھر ہم نے اسے اپنی طرف ہلکا سا قبض کر لیا\" (ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا) کی طرف۔ پس اس نے ابتدا اور انتہا میں اپنے رب کے سوا کچھ نہیں دیکھا، پس وہ اس کے شہود (الشہود) میں اول ہے اور اس کے وجود (الوجود) کے اختتام میں آخر ہے۔ اور اہل تکوین (أهل التکوین) سائے کے پھیلنے کے علم میں رہے، نہ کہ اس کی کیفیت میں۔ اور مفلسین نے سائے میں صرف اس حیثیت سے دیکھا جس سے ذات حق (الحق) نے انہیں مخاطب کیا، اور وہ اس کا قول ہے: \"اس نے سائے کو کیسے پھیلایا؟\" (كَيْفَ مَدَّ الظِّلَّ) پس وہ کیفیت کے ساتھ ٹھہرے، اور وہ الٰہی ہے۔ پس وہ صرف اللہ کے ساتھ ٹھہرے، نہ کہ سائے کے ساتھ۔ کیونکہ کیفیت اس ذات کا شہود (الشہود) ہے جس کے لیے پھیلایا گیا، نہ کہ پھیلی ہوئی چیز کا شہود۔ پس ذات حق (الحق) نے انہیں اس منزل کے لیے بنایا کہ وہ اہل تکوین (أهل التکوین) پر حیات کے علوم سے فیضان کریں جس سے ان کے دل زندہ ہو جائیں۔ پس جب وہ دیکھتے ہیں کہ انہیں امداد آ رہی ہے، تو وہ دیکھتے ہیں کہ وہ کس طرف سے آئی ہے، تو وہ اسے اللہ کے ان کامل مردوں کی طرف سے دیکھتے ہیں۔ پس وہ جان لیتے ہیں کہ اللہ کے کچھ مرد ان سے اوپر ہیں جن کے لیے اللہ کے ہاں سبقت کی وجہ سے الٰہی قربت (القربۃ الإلٰہیۃ) حاصل ہے۔ پس وہ اس سبقت کی وجہ سے اعتدال (الاقتصاد) کے طریقے پر نیکیوں میں سبقت لے جانے والے سابقین میں سے تھے، اور انہوں نے ہر حقدار کو اس کا حق دیا، جیسا کہ اللہ نے ہر چیز کو اس کی تخلیق عطا کی۔ پس ان (اہل وجہ) کے لیے عرش ہے اور اہل تکوین (أهل التکوین) کے لیے فرش ہے۔ پس ان کے لیے استواء (برابر ہونا) ہے اور اہل تکوین کے لیے ٹیک لگانا (الاتکاء) ہے۔ اور ان کے لیے نزول ہے اور اہل تکوین کے لیے بلندی اور صعود (چڑھنا) ہے۔ اور ان کے لیے اسماء تنزیہ (اللہ کو پاک قرار دینے والے نام) کی حقائق ہیں، اور اہل تکوین کے لیے اسماء تشبیہ (اللہ کو مخلوق سے مشابہ قرار دینے والے نام) کی حقائق ہیں، کیونکہ ان کے ذریعے وہ محلوں میں احوال کو بدلتے ہیں۔ پس یہ اہل ید تکوین (تکوین والے ہاتھ کے لوگ) اور اہل وجہ (أصحاب الوجہ) کے بعض احوال ہیں جن کے لیے دونوں ہاتھوں کے درمیان کا مقام ہے۔\n\nاور جہاں تک اہل تسلیم (أهل التسلیم) کا تعلق ہے، تو وہ مجاہدہ (کوشش) اور ریاضت کی آگ میں مشقت اور سختی میں ہیں، وہ نہ تو یقین کی ٹھنڈک کو جانتے ہیں اور نہ ہی تعین (خاص ہونے) کے اشتیاق کی حرارت کو۔ کیونکہ شوق صرف معروف (جانی پہچانی چیز) سے متعلق ہوتا ہے، اور یہ صرف اصحاب حروف (حرف والوں) کے لیے ہوتا ہے جو اللہ کی عبادت ایک حرف پر کرتے ہیں اس کے معنی کی وجہ سے۔ \"پس اگر اسے کوئی بھلائی پہنچے تو وہ اس پر مطمئن ہو جاتا ہے\" (فَإِنْ أَصَابَهُ خَيْرٌ اطْمَأَنَّ بِهِ) یعنی اس حرف پر، اس بھلائی کی وجہ سے جو اسے اس سے پہنچی، اور وہ اس کے نزدیک ایک مقید اور متعین بھلائی ہے جس کی خاطر اس نے دوسرے حروف کے بجائے اس حرف کو لازم پکڑا، کیونکہ حروف بہت ہیں۔ پس وہ اس شخص کی طرح ہے جس نے اپنی عمارت کو گرنے والی کھائی کے کنارے پر قائم کیا، پس وہ اس کے ساتھ گر گئی۔ پس وہ کنارے پر ہے، شفا (تندرستی) پر نہیں۔ لیکن اس کے باوجود اللہ کی رحمت شامل ہے اور اس کی نعمت وسیع ہے۔ اور عالم میں ہر موجود کے دو رُخ ہیں: ایک باطن جس میں رحمت ہے، اور ایک ظاہر جس کی طرف سے عذاب ہے، جیسے جنت اور جہنم کے درمیان دیوار۔ اور بندے کا حال اس رُخ کے مطابق ہوتا ہے جسے وہ ہر موجود سے دیکھتا ہے، کیونکہ ذات حق (الحق) نے خود کو غضب اور رضا سے موصوف کیا ہے، اور عالم اس کی صورت پر ہے۔ لہٰذا جو ہم نے ذکر کیا ہے، عالم کا اس پر ہونا ضروری ہے۔ پس دونوں قبضوں کا ہونا ضروری ہے، اور دونوں ہاتھوں کا ہونا ضروری ہے، اور دونوں گھروں (دنیا و آخرت) کا ہونا ضروری ہے، اور ہر دو کے درمیان برزخ کا ہونا ضروری ہے۔ \"اور ہم نے ہر چیز کے جوڑے بنائے\" (وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ)، کیونکہ وہ دو صفات: ارادہ اور قول سے مخلوق ہوا ہے، اور یہ دونوں وہ ہیں جن کا ہر مخلوق ذات حق (الحق) سے شہود (الشہود) کرتی ہے۔ کیونکہ عالم ایک نتیجہ ہے، اور نتیجہ صرف دو مقدمات سے ہوتا ہے۔ اور یہی الٰہی تناسل ہے۔ اور اسی لیے اس نے اسے صورت پر وجود بخشا، جیسے مخلوقات کی ہر جنس میں بیٹے کا باپ کی صورت پر ہونا۔ پس عالم اپنے اجزاء اور تفصیلات کے لحاظ سے اسم الظاہر کے لیے اعضاء کی طرح ہے، اور اپنے معانی اور مراتب کی تفصیلات کے لحاظ سے باطنی روحانی قوتوں کی طرح ہے جو صرف اپنے آثار سے معلوم ہوتی ہیں، اسم الباطن کے لیے۔ پس عالم کی نشأت ظاہر اور باطن پر قائم ہوئی، اور \"وہ ہر چیز کا جاننے والا ہے، اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے\" (وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ)۔ پس ہم نے اس منزل میں وہ بیان کر دیا جو تین الٰہی رُخوں اور تین مراتب کا تقاضا ہے جن میں عالم کے درمیان فضیلت ظاہر ہوئی۔\n\nپس اب ہم ان علوم کا ذکر کرتے ہیں جو یہ منزل اپنے اندر رکھتی ہے۔ ان میں سب سے پہلے علم المبشرات (خوشخبریوں کا علم) اور علم المیزان الإلٰہی (الٰہی ترازو کا علم) ہے جو اس کے ہاتھ میں ہے پست کرنے اور بلند کرنے کے لیے، جس کی حدیث نبوی خبر میں وارد ہوئی جسے ذات حق (الحق) نے مشاہدہ کرایا۔ اور اس میں خاص طور پر طبیعی حرکات کا علم ہے۔ اور اس میں مرکبات کی تحلیل کا علم ہے، اور اس میں اس چیز کا علم ہے جو مکاشف (جس پر کشف ہوا ہو) کو ظاہر ہوتی ہے جب وہ ہباء (غبار) کا مشاہدہ کرتا ہے جسے حکماء ہیولیٰ (مادہ اولیٰ) کہتے ہیں، عالم کی صورتوں میں سے، اس سے پہلے کہ ان کی اعیان جسم کل میں ظاہر ہوں۔ اور اس میں فردیت اولیٰ (پہلی انفرادیت) کا علم ہے جس میں الٰہی، روحانی، طبیعی اور عنصری پیداوار اور تناسل واقع ہوا، اور یہ ایک نایاب علم ہے۔ اور اس میں الٰہی اقتدار (قدرت) کا علم ہے، اور یہ کہ وہ کس میں نافذ ہوتا ہے اور کس میں نافذ نہیں ہوتا، اور کیوں وہ بعض ممکنات میں نافذ نہیں ہوتا، اور اس کی رکاوٹ کیا ہے؟ کیا دو متضاد چیزوں کا جمع ہونا اسے ناممکن بناتا ہے؟ حالانکہ اصل (ذات حق) دو متضاد چیزوں کو جمع کرنے والا ہے، بلکہ وہ عین دو متضاد چیزیں ہے۔ اور اس میں تحسین (اچھا قرار دینے) اور تقبیح (برا قرار دینے) کا علم ہے، اور اس میں دونوں نشأتوں (پیدائشوں) کا علم ہے، اور اس میں تمام موجودات میں جاری و ساری حیات کا علم ہے، یہاں تک کہ وہ اللہ کی حمد کے ساتھ تسبیح کرتے ہوئے بول اٹھے۔ اور اس میں طبیعی مواد اور عنصری مواد کا علم ہے، اور اس میں مبدأ (ابتدا) اور معاد (انجام) کا علم ہے، اور اس میں اس اصل کا علم ہے جس کی طرف یہ مواد لوٹتے ہیں۔ اور اس میں اسطقسات (عناصر اربعہ) کا علم ہے، اور اس میں علوم کے مراتب کا علم ہے، اور اس میں الٰہی کلمات کا علم ہے اس حیثیت سے کہ وہ مرکب ہیں۔ اور اس میں پھیلے ہوئے چمڑے پر لکھی ہوئی کتاب (الکتاب المسطور فی الرق المنشور) کا علم ہے، اور اس میں صحیفوں کی تنزیہ (پاکیزگی) اور کتابوں میں ان کے مرتبے کا علم ہے، اور وہ سفراء (فرشتے) کون ہیں جو اسے اٹھاتے ہیں۔ اور اس میں حدود کے ذریعے فرق کا علم ہے کہ وہ کن اعیان (حقیقتوں) میں ظاہر ہوتا ہے، حالانکہ ہستی (الوجود) میں ایک کے سوا کچھ نہیں، تو وہ کس چیز سے ممتاز ہوتا ہے، اور کس چیز سے ممتاز ہوتا ہے، اور وہ وہاں کیا ہے۔ اور اس میں عدم (نہ ہونے) سے غذا حاصل کرنے کا علم ہے، اور اس میں زندہ لوگوں میں قرب (قربت) میں ذات حق (الحق) کی نسبت اور مردہ لوگوں میں اس کے قرب کی نسبت کے درمیان فرق کا علم ہے۔ اور اس میں رجعت (واپسی) کا علم ہے، اور اس میں ہر صنف کے ثواب کا علم ہے، یعنی ان کے ثواب کے تعین میں، اور اصحاب نور (نور والوں) اور اصحاب اجور (اجرت والوں) کے درمیان فرق کا علم ہے۔ اور بندہ اس کا مزدور کیسے ہو سکتا ہے جس کا وہ خود بندہ ہے، بغیر اس کے کہ وہ مکاتب (آزادی کا معاہدہ کرنے والا غلام) ہو یا مدبر (آقا کی موت کے بعد آزاد ہونے والا غلام)۔ اور اس میں الٰہی عظمت (العظمۃ الإلٰہیۃ) کی تنزیہ (پاکیزگی) کا علم ہے کہ وہ اکوان (کائناتوں) کے ساتھ قائم ہو۔ اور اس میں اس سبب کا علم ہے کہ اگر کوئی اسے جان لے تو وہ نہیں مرے گا جب تک وہ علم اس کے لیے مشہود (الشہود) ہو۔ پس یہ ان علوم کی بنیادیں ہیں جو یہ منزل اپنے اندر رکھتی ہے، اور ان میں ایسی تفصیلات ہیں جو ختم نہیں ہوتیں۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب سیصد و بیست و هشتم در معرفت منزل زوال مرکبات هنگام گداختن (ذوب شدن) به سوی بسیط‌ها، و این منزل از حضرت محمدیه (الحضرة المحمدية) است.\n\nورود به این منزل، تا زمانی که در آن هستی، از مرگ مصون می‌دارد و آن منزلی شگفت‌انگیز است.\n\n> همانا مقرب (المقرب) صاحب روح و ریحان است *** در بهشت جاودان از نعمت و احسان.\n> او را می‌بینی که از عذاب آتش در نعمت است *** خدا را از روی علم و ایمان تسبیح می‌گوید.\n> در نشأتی که حدی ندارد تا به آن برسی *** حکم او از نقص و برتری منزه است.\n\nاز این منزل است که وقایع (وقائع) برای فقرا (سالکان) رخ می‌دهد، که همان مژده‌ها (المبشرات) و رؤیای صادقه است، نه خواب‌های پریشان (أضغاث أحلام)، و این خود جزئی از اجزای نبوت است. و از این منزل است که برای مکاشف (صاحب کشف) پرده از میزان (ترازو) برداشته می‌شود، میزانی که در دست حق (الحق) است و با آن فرود می‌آورد و بالا می‌برد.\n\n### [مژده‌ها و رؤیای صادقه]\n\nبدان که هرگاه تحلیل (التحليل) بر مرکبات وارد شود، عین صورت را از بین می‌برد اما عین جوهر را از بین نمی‌برد. و خداوند آن را مثالی برای عارفان به حق (العارفين بالله) قرار داده است در آنچه از ترکیب اعیان ممکنات (أعيان الممكنات) با عین حق (عين الحق) ظاهر می‌شود. پس در عین حق، آنچه از صور ظاهر می‌شود، پدیدار می‌گردد. و هرگاه تناسب میان حق و خلق برداشته شود، اعیان آن صور از بین می‌رود و اعیان ممکنات و عین حق باقی می‌ماند، از آن جهت که حق به بی‌نیازی از عالمیان (الغنى عن العالمين) وصف شده است. پس اعیان به دلیل زوال صور ظاهر برای حس، از بین نمی‌روند.\n\nو بدان که صور ظاهر شده از حق بر سه مرتبه است، زیرا حق در عالم سه وجه دارد، چرا که خود را وصف کرده است که دو دست دارد که با آن دو، عالم را قبض کرده است. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) این را در دو کتابی که برای اصحابش بیرون آورد، آشکار ساخت: در یکی نام‌های اهل بهشت و نام پدران و قبایل و عشایرشان بود، و در دیگری نام‌های اهل آتش و نام پدران و قبایل و عشایرشان. و برای اهل الله و خاصان او کتاب سومی بیرون نیاورد، زیرا کتاب ایشان قرآن است. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «اهل قرآن، اهل خدا و خاصان او هستند.»\n\nو منزل این گروه (اهل الله) میان دو دست است؛ پس قلب و سینه که جایگاه و حضرت (حضور) ایشان است، از آنِ ایشان است. و این مقام اهل قربت (أهل القربة) است که خاصان در میان سعادتمندان هستند. این مقام، ایشان را به سبقت گرفتن در خیرات بر طریق اعتدال (الاقتصاد) واداشته است، یعنی دادن حق هر صاحب حقی به او. پس عالم به دلیل تقسیم وجوه، به سه بخش تقسیم شد: برای هر دست، صنفی خاص، و برای آنچه میان آن دو است، صنفی خاص. و برای اصناف دو دست، مرتبه عظمت و هیبت است. اما صنف منسوب به یک دست، در ذات خود دارای شأن عظیمی است که عظمتی ذاتی برای اوست. و صنف دیگر دارای مرتبه‌ای عظیم است، اما عظمتش ذاتی نیست، بلکه به خاطر مرتبه‌اش بزرگ داشته می‌شود نه به خاطر خودش، مانند صاحبان مناصب در دنیا که اگر در ذات خود اهل فضلی نباشند، به خاطر منصبشان بزرگ داشته می‌شوند و هرگاه عزل شوند، آن تعظیمی که در دل مردم برایشان بود، از بین می‌رود. این است تفاوت میان این دو طایفه.\n\nپس صنفی از اهل الله (أهل الله) در عالم به واسطه خدا (بالله) ظاهر می‌شوند و صنف دیگر در عالم برای خدا (لله) ظاهر می‌شوند. و صنفی که میان دو دست است، با مجموع و افزون بر آن ظاهر می‌شوند. اما آن افزونی، ظهور ایشان به واسطه ذاتی است که دو دست را جمع کرده است، و ایشان صاحبان هروله (شتاب) الهی در احوالشان هستند که با آن در موطن تکلیف شتافتند. و صاحبان دو دست، صاحبان ذراع (ساعد) و باع (گام) الهی هستند، زیرا در موطن تکلیف هنگام تعیین خطاب به شبر (وجب) و ذراع ظاهر شدند. پس برتری‌جویی رخ داد تا تمایز در مرتبه حاصل شود. پس صنف میان دو دست می‌گوید:\n\n> من آن کسی هستم که دوست می‌دارم *** و آن کسی که دوست می‌دارم، من هستم.\n\nدر شهود (مشاهدة) دائمی که مراتب آن قطع نمی‌شود، اگرچه ذوق‌های آن متفاوت باشد. زیرا خداوند عرشی دارد که در این صورت دائمی جز برای صاحبان این عرش تجلی (التجلی) نمی‌کند. و ایشان اهل عرش و اهل وجه (وجه الله) هستند. در این تجلی، برخی به برخی دیگر می‌نگرند و یکدیگر را از انواری که بر آن هستند می‌پوشانند، در حالی که در حال تجلی و نظر هستند. و هیچ موطنی نیست که تجلی حق (تجلى الحق) و رؤیت خلق را جز در حضرت خیال و مثال جمع کند، مگر موطن اصحاب وجه. حق به ایشان این قدرت را به واسطه محلی که در آن جایشان داده، عطا کرده است، و آن محل مقام است. و این همان چیزی است که برای رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در برخی از معراج‌هایش ظاهر شد و در حال نزدیک شدن به آن، از آن به «رفرفی از درّ و یاقوت» تعبیر کرد. پس در معراج خود از براق به رفرف منتقل شد. کسی که به این مقام دست یابد، شهودش دائمی می‌شود و او را از خود و از مُلک خود غایب نمی‌کند، و کثرت را در واحد و تفرقه را در جمع می‌بیند.\n\nو برای این صنف از وجه، صوری برپا می‌شود که حامل علومی هستند که یا میان ایشان و آن علوم رابطه‌ای عملی و مناسبتی وجود دارد، و یا هیچ رابطه‌ای میانشان نیست، بلکه این علوم افزایشی از فضل خدا برای ایشان است که از سرِ منّت روزی داده می‌شوند. این علوم را جز از آن صور منبعث از وجه به دست نمی‌آورند. پس نه وجه ایشان را از دیدن صور و آنچه حمل می‌کنند محجوب می‌سازد، و نه صور و آنچه حمل می‌کنند و ذوق‌های آن علوم، ایشان را از وجه محجوب می‌سازد. و این رتبه، بالاترین رتبه برای سعادتمندان است. سپس بر صاحبان دست‌ها (أصحاب الأيدي) از آن علومی که از آن صور به دست آورده‌اند، فیض می‌بخشند. پس صاحبان دست‌ها آن علوم را جز به واسطه اصحاب وجه نمی‌گیرند، همان‌طور که اصحاب وجه نیز آن علوم را جز از آن صور به دست نیاورده‌اند و از خود وجه نگرفته‌اند. و سبب آن این است که آن علوم دارای ذوق‌های مختلفی هستند، در حالی که وجه اختلافی ندارد. پس ناگزیر است که تمایز آن مراتب با وجود این صور آشکار شود تا تنوع مشرب‌ها (مشارب) دانسته شود. آنچه از رابطه تنوع حاصل شده، به دلیل تنوع احوال ایشان به شبر و ذراع و سعی است، پس نوشیدنی (المشروب) به ذراع و باع و هروله متنوع شده است. و آنچه از مشرب‌ها متنوع شده و رابطه‌ای میان ایشان و آن نیست، باید دانست که از استعداداتی است که نشأت ایشان بر آن است، که غیر از استعداد عملی است که با مقدار شبر و ذراع از آن کنایه شده است. پس هبات الهی تنها به این دلیل متفاوت شده است. و هیچ یک از این‌ها عقل ایشان را زایل نمی‌کند و چیزی از مراتب بهره‌های حقایقشان نمی‌کاهد. پس در یک زمان از هر عضوی و هر حقیقتی که بر آن هستند، متنعم می‌شوند و نعمت چیزی ایشان را از نعمت چیز دیگر محجوب نمی‌سازد. و هر کس این را بداند، صورت نشأت آخرت را می‌داند که بر غیر مثال است، همان‌طور که نشأت دنیا بر غیر مثال بود.\n\nو در این مقام برای این صنف، شگفت‌انگیزتر از این نیست که وقتی صور وجه بر ایشان تجلی می‌کند، علوم را در نوشیدنی‌ها فانی می‌سازند، در حالی که بر حقایقی هستند که هر آنچه آورده‌اند، می‌طلبد که از میان آن‌ها چیزی را انتخاب کنند، با وجود اینکه آن حقایق از آنِ ایشان است و ناگزیر باید به آن دست یابند. و من سبب آن را به تو می‌شناسانم: ایشان تنها در علومی که میانشان و آن مشرب‌ها رابطه‌ای وجود دارد، حق انتخاب (الاختيار) دارند، نه در علوم وهبی. و این بدان سبب است که ایشان در حال سلوک و انجام اعمالشان، برخی اعمال را بر برخی دیگر ترجیح دادند و به دلیل اقتضای زمان یا مکان یا حال، آن‌ها را مقدم داشتند. پس هنگامی که نتایج آن اعمال در این تجلی ظاهر می‌شود، انتخاب ایشان در تقدم برخی بر برخی دیگر برای تناول، به همان صورتی است که در حال اعمالشان جاری شده بود. آیا حکمت این سخن را در آخرت نمی‌بینی که: «برای اهل سعادت هر آنچه نفسشان شهوت (اشتها) کند، هست» و نگفت: «هر آنچه نفسشان اراده کند»؟ شهوت نوعی اراده است، اما چون هر مرادی مورد اشتها نیست، پس هر اراده‌ای شهوت نیست. زیرا اراده به آنچه لذت‌بخش است و آنچه لذت‌بخش نیست تعلق می‌گیرد، در حالی که شهوت تنها به لذت‌بخش تعلق می‌گیرد. پس اعمال را با اراده و قصد گرفتند و نتایج را با شهوت. پس کسی که در حال عمل، شهوت روزی‌اش شد و از عمل به اندازه لذت از نتیجه آن لذت برد، نعمتش برای او تعجیل شده است. و کسی که در حال عمل، اراده بدون شهوت روزی‌اش شد، او صاحب مجاهده است که نتیجه را با شهوت به دست می‌آورد، و این مرتبه‌ای پایین‌تر از مرتبه اول است.\n\nسپس برای این صنف از حق در این حال، صورت قهر (القهر) و پیروزی بر چیزی است که شأنش امتناع است، اما امتناع نمی‌کند، به دلیل آنچه او از صفت اقتدار بر فرود آوردن آن می‌داند. این امر برای او منجر به گرفتن سختی‌ها (الشدائد) و ترک رخصت‌ها شد. این‌ها برخی از احوال اهل وجه هستند.\n\nو اما دو صنف دیگر، برای یکی از آن‌ها تکوین (التكوين) است و برای دیگری تسلیم (التسليم). اما اهل تکوین از این دو صنف، تمایزشان در احوال و جایگاهشان در عالم علوی است، هنگامی که با مرگ از کالبدهایشان جدا می‌شوند و درهای آسمان برایشان گشوده می‌شود و ارواحشان به جایی که در نزد سدرة المنتهى ساکن شده‌اند، عروج داده می‌شود. تا روز رستاخیز از آنجا جدا نمی‌شوند، زیرا در حال اعمالشان در بذل نهایت توان خود در آنچه مکلف به آن بودند، به منتهی رسیدند و در حالی که تمام تلاش خود را کرده بودند و دیگر راهی برایشان نمانده بود، درگذشتند؛ هر کس به اندازه توان خود. پس تفاوتی نیست میان کسی که صد هزار دینار صدقه می‌دهد، اگر جز آن نداشته باشد، و کسی که یک فلس صدقه می‌دهد، اگر جز آن نداشته باشد. پس هر دو در بذل نهایت توان مشترک شدند و از آنجا پاداش داده شدند و جایگاهشان یکی است، و آن سدرة المنتهى است که از نور خدا آن را پوشانده است، به گونه‌ای که هیچ کس نمی‌تواند آن را وصف کند.\n\nو مانند این در سخن شارع (پیامبر) روشن شده است که «یک درهم بر هزار درهم پیشی گرفت»، زیرا صاحب درهم جز آن نداشت، پس آن را در راه خدا بخشید و به سوی خدا بازگشت، چون جز او پشتوانه‌ای نداشت که به آن بازگردد. و صاحب هزار، بخشی از آنچه داشت را داد و آنچه را که می‌توانست به آن بازگردد، باقی گذاشت، پس به سوی خدا بازنگشت. بنابراین صاحب درهم بر او به سوی خدا پیشی گرفت. و این معقول است. اگر صاحب هزار تمام آنچه را داشت مانند صاحب درهم می‌بخشید، در مقام با او برابر می‌شد. پس شارع مقدار بخشش را در نظر نگرفت، بلکه آنچه را که بخشنده پس از بخشش به آن بازمی‌گردد، در نظر گرفت. پس بازگشت‌کنندگان به سوی خدا، کسانی هستند که از هر آنچه غیر خداست، مفلس (تهی‌دست) هستند. و اگرچه صاحب جدّ (ثروت معنوی/دارایی) از کسانی باشد که حق (الحق) را در هر صورتی می‌بیند، اما مرتبه کسی را که او را در «هیچ چیز» می‌بیند، درک نمی‌کند. زیرا او حق را در ارتفاع نسبت‌ها، اطلاق (الإطلاق) و عدم تقیید می‌بیند. و شکی نیست که اگر حق برای متجلی‌شونده در صورتی مقید شود، آن صورت، بیننده را مقید می‌کند. و او تعالی نزد هر بیننده‌ای در صورتی است که دیگری آن را درک نمی‌کند. پس مطلق الوجود (مطلق الوجود) را جز مفلسی که صور از شهودش (شهود) رخت بربسته، درک نمی‌کند، چنانکه درباره تشنه (الظمآن) فرمود: «حَتَّى إِذَا جَاءَهُ لَمْ يَجِدْهُ شَيْئًا» (تا آنگاه که به آن رسید، آن را چیزی نیافت). پس شیئیت مقصود را نفی کرد و خدا را نزد آن یافت، یعنی نزد «هیچ چیز». زیرا «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست) و او «غَنِيٌّ عَنِ الْعَالَمِينَ» (از عالمیان بی‌نیاز است). پس او را درک نمی‌کند مگر کسی که خدا او را از عالمیان مفلس کرده باشد.\n\nو مفلس از عالمیان، در نهایت بی‌نیازی از عالمیان است، زیرا وقتی اسباب از او قطع شد، حق او را به سوی خود بازگرداند. پس دانست که به سوی چه کسی بازگشته و با چه چیزی بازگشته است. پس با افلاس (تهی‌دستی) به سوی کسی بازگشت که بی‌نیازی از آنِ اوست. پس حق را به حق شناخت و از او پیروی کرد. پس حق عین او، عدم و شهود است و حق پروردگارش، وجود و شهود. صاحب کشف اتم (الکشف الأتم) (پیامبر) فرمود: «اصحاب جدّ (دارایی) محبوس هستند.» و محبوس مقید است. و مفلس دارایی‌ای ندارد که او را مقید یا محبوس کند، پس او از این تقیید که برای اصحاب جدّ است، مطلق است. پس او به دلیل اطلاقش، به صورت (حق) نزدیک‌تر است تا اصحاب جدّ به دلیل تقییدشان. پس اصحاب جدّ در مرتبه کسی هستند که حق را در اشیا می‌بیند و ناگزیر به واسطه آن اشیا مقید می‌شود، زیرا مقام بر او حکم می‌کند. و مفلس، محمدی است و مقامی ندارد، زیرا به او گفته شد: «لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ» (هیچ چیز از امر (فرمان) در اختیار تو نیست)، پس او را مفلس کرد. و جدّ (دارایی) جز برای کسی که امر از آنِ اوست، نیست. پس هر کس که امر از آنِ اوست، صاحب جدّ است، زیرا امر برای تکوین است، پس هر چه اراده کند، می‌شود، پس او مفلس نیست. و هر کس از حقیقت خود خارج شود، از راه خود لغزیده است. خلق را چه به تکوین؟ اگر سخنی بگوید یا به حقی امر کند، تکوین از آنِ حق است نه از آنِ او، چنانکه درباره کسی که تکوین دارد فرمود: «فَيَكُونُ طَائِرًا بِإِذْنِي» (پس به اذن من پرنده‌ای می‌شود) و در آیه‌ای دیگر: «فَيَكُونُ طَائِرًا بِإِذْنِ اللَّهِ» (پس به اذن خدا پرنده‌ای می‌شود). پس به او عطا کرد و سپس او را مجرد ساخت. پس بقا بر اصل اولی‌تر است، و آن سخن اوست به گرامی‌ترین مردم نزد او و کامل‌ترینشان در شهود و والاترینشان در وجود: «لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ» (هیچ چیز از امر در اختیار تو نیست)، پس او را مفلس کرد. «يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا» (ای اهل یثرب، شما را جایگاهی نیست، پس بازگردید)، زیرا خداوند شما را در آنچه نمی‌دانید، ایجاد می‌کند. «وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَىٰ» (و قطعاً نشأت اول را دانستید) که در آنچه نمی‌دانستید بود، «فَلَوْلَا تَذَكَّرُونَ» (پس چرا متذکر نمی‌شوید؟). پس اهل الله در موطن افلاس باقی می‌مانند و در هر نفسی بر بینه‌ای هستند، نه بر پوششی از علم جدیدی که نزدشان نبوده است، زیرا خداوند دائماً او را در آنچه نمی‌داند، ایجاد می‌کند. پس او صاحب نظر و تدبیر و اندیشه نیست، زیرا نظر جز در مواد وجودی نیست، و آن حدود (محدودیت‌هایی) است که ایشان را از علم به خدا بازداشته است. پس ایشان در «لَبْسٍ مِنْ خَلْقٍ جَدِيدٍ» (پوششی از خلقت جدید) هستند، در حالی که در آن هستند و «وَهُمْ لَا يَشْعُرُونَ» (و خود نمی‌دانند). و هنگامی که روز قیامت وارد بهشت می‌شوند، جز در آنچه چشمی ندیده و گوشی نشنیده و بر قلب بشری خطور نکرده است، در آن فرود نمی‌آیند. و هنگامی که بر قلب خطور نکند، در حالی که قلب مقام دگرگونی در وجوه را دارد، پس گمانت درباره عقل که دگرگونی نزدش نیست، چیست؟ خداوند ما را از این مفلسان قرار دهد و میان ما و مقام اهل جدّ محبوس حائل شود.\n\nسپس، اصحاب تکوین (التكوين) که قدرت الهی در ایجاد اعیان را دارند، هنگامی که نظم و ترتیب عالم را مشاهده می‌کنند و می‌بینند که هیچ خلأیی باقی نمانده که تکوین ایشان آن را آباد کند، در آن هنگام می‌دانند که خداوند میان ایشان و ایجاد معدوم (آنچه وجود ندارد) حائل شده است، در حالی که تکوین حقیقی جز آن نیست. پس آنچه از تکوین به دست ایشان رسیده، جز تغییر احوال نیست، که در عموم مردم نیز وجود دارد؛ مانند کسی که ایستاده است و می‌نشیند، یا نشسته است و برمی‌خیزد، یا ساکن است و حرکت می‌کند، یا متحرک است و ساکن می‌شود. در قدرت ایشان جز این نیست. زیرا تکوینی که همان ایجاد معدوم است، دیگر جایی در عالم برای ظهور ندارد. پس مکان‌ها به واسطه صور عالم و اعیان آن از حیث جوهر، که آن را آباد کرده‌اند، از بین رفته‌اند. اما محل‌هایی که تغییر احوال در آن‌ها ظاهر می‌شود، از بین نرفته‌اند. پس برای اصحاب تکوین جز مراتب عوام نیست، مگر اینکه تفاوت میان ایشان و عوام این است که عوام تکوین را در امور معتاد دارند، و این گروه تکوین را در امور غیر معتاد دارند، اما برای خودشان معتاد است. پس ایشان در عاداتشان به منزله عوام هستند. و صاحب وجود و شهود (الوجود والشهود) همواره در «لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ» باقی می‌ماند. پس هنگامی که اهل تکوین آنچه را که ذکر کردیم، یعنی آبادانی مکان‌ها و نظم عالم و اینکه نه افزایش می‌پذیرد و نه نقصان، و اینکه در کامل‌ترین صورت خلق شده است، مشاهده می‌کنند و می‌بینند که دیگر تصرفی برایشان نمانده جز در محل‌ها و ایجاد الهیاتی مانند تجلی الهی در صور، دل‌هایشان می‌شکند و به عجز خود پی می‌برند و می‌دانند که در تکوین، قاصر و مقید هستند. پس آسایش را از رنج تکوین می‌طلبند.\n\nپس خطاب الهی در اسرارشان به ایشان می‌رسد با این سخن: «أَلَمْ تَرَ إِلَىٰ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ» (آیا به پروردگارت ننگریستی که چگونه سایه را گسترانید؟) برای یافتن آسایش. پس در نزد این خطاب در سایه گسترده او آسایش یافتند. و سایه هر چیز بر صورت آن چیز خارج می‌شود. پس خداوند آسایش ایشان را به واسطه عالم قرار داد نه به واسطه خودش. اما مفلس جز به واسطه او آسایشی ندارد، زیرا او را از عالم مفلس کرده است. پس او در سایه آسایشی ندارد.\n\nپس عالم بر او حکمی ندارد و مزیتی برای او نیست، او برای خدا و به واسطه خداست. پس هرگاه خداوند آسایش این مفلس را اراده کند، سایه را به سوی خود قبض می‌کند، قبض کردنی آرام (يَسِيرًا). پس از جایگاه آسایش این مفلس پرده برداشته می‌شود، زیرا هنگامی که سایه را به سوی خود قبض کند، نور، مکانی را که این سایه از آن قبض شده است، آباد می‌کند، و آن جایگاه آسایش این مفلس است. زیرا او به دلیل نیازش، مانند کسی است که از سرما رنج می‌برد و خورشید را می‌طلبد تا در نور آسایش یابد. پس هنگامی که اهل تکوین در علم این سخن او که «أَلَمْ تَرَ إِلَىٰ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ» آسایش یافتند، مفلس از این آیه تا سخن او که «أَلَمْ تَرَ إِلَىٰ رَبِّكَ» در آغاز امرش و در نهایت آن تا سخن او که «ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا» (سپس آن را به سوی خود قبض کردیم، قبض کردنی آرام) آسایش یافت. پس او در آغاز و پایان جز پروردگارش را ندید. پس او در شهودش اول است و در انتهای وجودش آخر.\n\nو اهل تکوین در علم گسترش سایه باقی ماندند، نه در کیفیت (کیفیة) آن. و مفلسان در سایه نظر نکردند مگر از آن جهت که حق ایشان را مخاطب قرار داد، و آن سخن اوست: «كَيْفَ مَدَّ الظِّلَّ» (چگونه سایه را گسترانید). پس با کیفیت توقف کردند، و کیفیت الهی است. پس جز با خدا توقف نکردند، نه با سایه، زیرا کیفیت، شهود کسی است که گستراننده است، نه شهود آنچه گسترانیده شده است. پس حق ایشان را به این منزلت قرار داد که از علوم حیات بر اهل تکوین فیض می‌بخشند، به گونه‌ای که دل‌هایشان با آن زنده می‌شود. پس هنگامی که دیدند امداد به ایشان می‌رسد، نگریستند که از کدام جهت به ایشان رسیده است. پس آن را از جهت این کاملان از مردان خدا دیدند. پس دانستند که خداوند مردانی بالاتر از ایشان دارد که به دلیل سبقتشان نزد خدا، قربت الهی (القربة الإلهية) دارند. پس به خاطر این سبقت، از سابقین و شتاب‌کنندگان به سوی خیرات بر طریق اعتدال (الاقتصاد) بودند و حق هر صاحب حقی را به او دادند، همان‌طور که خداوند به هر چیزی خلقتش را عطا کرد. پس عرش از آنِ این گروه است و فرش از آنِ اهل تکوین. پس استواء (برقرار بودن) از آنِ ایشان است و تکیه دادن از آنِ اهل تکوین. و نزول از آنِ ایشان است و ارتفاع و صعود از آنِ اهل تکوین. و حقایق اسماء تنزیه (التنزيه) از آنِ ایشان است و حقایق اسماء تشبیه (التشبيه) از آنِ اهل تکوین، زیرا با آن احوال را در محل‌ها تغییر می‌دهند. این‌ها برخی از احوال اهل دست تکوین و اصحاب وجه هستند که آنچه میان دو دست است، از آنِ ایشان است.\n\nو اما اهل تسلیم (التسليم)، ایشان در تلاش و مشقت، در آتش مجاهده و ریاضت هستند. نه خنکای یقین را می‌شناسند و نه حرارت اشتیاق به تعیین (تعیّن)، زیرا شوق جز به معروف (شناخته شده) تعلق نمی‌گیرد و جز برای اصحاب حروف نیست، کسانی که خدا را «بر یک حرف» (عَلَىٰ حَرْفٍ) می‌پرستند به معنای آن. «فَإِنْ أَصَابَهُ خَيْرٌ اطْمَأَنَّ بِهِ» (پس اگر خیری به او رسد، به آن آرام گیرد)، یعنی به آن حرف، به خاطر خیری که از آن به او رسیده است، و آن خیری مقید و معین نزد اوست که به خاطر آن، این حرف را رها نکرده است، زیرا حروف بسیارند. پس او مانند کسی است که «أَسَّسَ بُنْيَانَهُ عَلَىٰ شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ» (بنیان خود را بر لبه پرتگاهی سست نهاده و با آن فرو ریخته است). پس او بر لبه (شفا) است نه بر شفا (درمان). اما با این حال، رحمت خدا فراگیر است و نعمتش کامل. و هر موجودی در عالم دو وجه دارد: باطنی که «فِيهِ الرَّحْمَةُ» (در آن رحمت است) و ظاهری که «مِنْ قِبَلِهِ الْعَذَابُ» (از سوی آن عذاب است)، مانند دیواری میان بهشت و جهنم. و حال بنده بر حسب وجهی است که از هر موجودی به آن می‌نگرد، زیرا حق خود را به غضب و رضا وصف کرده است و عالم بر صورت اوست. پس ناگزیر است که عالم بر آنچه ذکر کردیم باشد. پس ناگزیر از دو قبضه است و ناگزیر از دو دست است و ناگزیر از دو سرا (دنیا و آخرت) است و ناگزیر از برزخ میان هر دو چیز است. و «وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ» (و از هر چیزی دو جفت آفریدیم)، زیرا مخلوق از دو صفت اراده و قول است، و این دو همان‌هایی هستند که هر مخلوقی از حق شهود می‌کند. زیرا عالم نتیجه است و نتیجه جز از دو مقدمه حاصل نمی‌شود. و این همان تناسل الهی است. و به همین دلیل آن را بر صورت (حق) ایجاد کرد، مانند وجود فرزند بر صورت پدر در هر جنس از مخلوقات. پس عالم از حیث اجزا و تفاصیلش مانند اعضا برای اسم ظاهر است، و از حیث معانی و تفاصیل مراتبش مانند قوای روحانی باطنی است که جز با آثارشان شناخته نمی‌شوند، برای اسم باطن. پس نشأت عالم بر ظاهر و باطن است. «وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ» (و او به هر چیزی داناست، هیچ معبودی جز او نیست، عزیز و حکیم است).\n\nپس ما در این منزل آنچه را که سه وجه الهی و سه مرتبه‌ای که تفاضل میان عالم در آن‌ها ظاهر شده است، اقتضا می‌کند، بیان کردیم. اکنون علومی را که این منزل در بر دارد، ذکر می‌کنیم. نخستین آن‌ها، علم مژده‌ها (المبشرات) و علم میزان الهی است که به دست اوست برای فرود آوردن و بالا بردن، که حدیث آن در خبر نبوی آمده و حق آن را به شهود او رسانده است. و در آن علم حرکات طبیعی به طور خاص وجود دارد. و در آن علم تحلیل مرکبات است. و در آن علم آنچه برای مکاشف (المكاشف) آشکار می‌شود، هنگامی که هباء (ماده اولیه) را که حکما آن را هیولی (الهيولى) می‌نامند، از صور عالم پیش از ظهور اعیانشان در جسم کل مشاهده می‌کند، وجود دارد. و در آن علم فردیت اولی است که در آن تولید و تناسل الهی، روحانی، طبیعی و عنصری رخ داده است، و آن علمی عزیز است. و در آن علم اقتدار الهی است و اینکه در چه کسی نفوذ می‌کند و در چه کسی نفوذ نمی‌کند، و چرا در برخی ممکنات نفوذ نمی‌کند، و مانع آن چیست؟ آیا جمع میان دو ضد آن را محال کرده است، در حالی که اصل (حق) جامع میان دو ضد است، بلکه عین دو ضد است. و در آن علم تحسین و تقبیح است. و در آن علم دو نشأت (دنیا و آخرت) است. و در آن علم حیات جاری در تمامی موجودات است، تا جایی که به تسبیح خدا به حمد او به سخن آمده‌اند. و در آن علم مواد طبیعی و مواد عنصری است. و در آن علم مبدأ و معاد است. و در آن علم اصلی است که این مواد به آن بازمی‌گردند. و در آن علم اسطقسات (عناصر اربعه) است. و در آن علم مراتب علوم است. و در آن علم کلمات الهی است از آن جهت که تألیف شده‌اند. و در آن علم کتاب مسطور (نوشته شده) در رق منشور (پوست گشوده) است. و در آن علم تنزیه صحف و منزلت آن‌ها از کتب است، و اینکه سفره (کاتبانی) که آن را حمل می‌کنند، چه کسانی هستند. و در آن علم تفاوت‌ها به واسطه حدود است که در کدام اعیان ظاهر می‌شود، در حالی که در وجود جز یکی نیست. پس به واسطه چه چیزی متمایز می‌شود و از چه چیزی متمایز می‌شود و آن چیست؟ و در آن علم تغذیه به عدم است. و در آن علم تفاوت میان نسبت حق در قرب در زندگان و نسبت قرب او در مردگان است. و در آن علم رجعت است. و در آن علم ثواب در هر صنف صنف است، یعنی در تعیین ثواب ایشان و تفاوت میان اصحاب نور و اصحاب مزد (أصحاب الأجور)، و اینکه چگونه بنده می‌تواند اجیر کسی باشد که خود بنده اوست، بدون اینکه مکاتب (آزاد شده با قرارداد) یا مدبّر (آزاد شده پس از مرگ مولا) باشد. و در آن علم تنزیه عظمت الهی از اینکه به اکوان (موجودات) قائم شود، وجود دارد. و در آن علم سببی است که اگر کسی آن را بداند، تا زمانی که آن علم برایش مشهود باشد، نمی‌میرد. این‌ها امهات علومی هستند که این منزل در بر دارد و در آن‌ها تفاصیلی است که پایان نمی‌پذیرد. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}