{
  "id": 510,
  "title": {
    "ar": "الباب العاشر وخمسمائة في معرفة حال قطب كان منزله سَأَصْرِفُ عَنْ آياتِيَ الَّذِينَ يَتَكَبَّرُونَ في الْأَرْضِ بِغَيْرِ الْحَقِّ",
    "en": "Chapter Five Hundred and Ten: Concerning the knowledge of the spiritual state of a Pole (قطب) whose station was [the Divine saying]: <<I shall turn away from My signs those who are arrogant upon the earth without right.>>",
    "ur": "باب پانچ سو دس: اس قطب (قطب) کے حال کی معرفت کے بارے میں جس کا روحانی منزل یہ آیت تھی: سَأَصْرِفُ عَنْ آياتِيَ الَّذِينَ يَتَكَبَّرُونَ في الْأَرْضِ بِغَيْرِ الْحَقِّ (میں اپنی آیات سے ان لوگوں کو پھیر دوں گا جو زمین میں ناحق تکبر کرتے ہیں)۔",
    "fa": "باب پانصد و دهم در معرفت حال قطبی که منزل او «به زودی کسانی را که در زمین به ناحق تکبر می‌ورزند، از آیات خود منصرف خواهم ساخت» (سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ) بود."
  },
  "content": {
    "ar": "## «الباب العاشر وخمسمائة في معرفة حال قطب كان منزله سَأَصْرِفُ عَنْ آياتِيَ الَّذِينَ يَتَكَبَّرُونَ في الْأَرْضِ بِغَيْرِ الْحَقِّ»\n\n\n> سأصرف عن براهين الوجود *** قلوبا لم تنل رتب السجود\n\n\n> فلما أن زهت فخرا وعجبا *** على أهل المشاهد والشهود\n\n\n> حرمناها العلوم فلم تنلها *** كما قد نالها أهل القصود\n\n\n### [الكبرياء رداء الله‏]\n\n\nفاعلم أيدنا الله وإياك أن الكبرياء ليس إلا لله فمن تكبر من الخلق بغير الحق فما هو كبير في نفس الأمر وإنما هي دعوى حال لا وجود له في عين المدعي فإن كان له وجود وتكون الدعوى صحيحة فليس المدعي عند ذلك إلا الحق والحق له الكبرياء وما سمي المحل متكبرا إلا لكون الدعوى ما ظهرت إلا في محل ما له الكبرياء وادعاؤه بحق فكان لسان المدعي عين الحق كما جاء كان الله سمعه وبصره‏\n\n\n### [أن لله على عباده حق‏]\n\n\nواعلم أن الله ما صرف أحدا عن الآيات إلا وقد صرفه عن العلم بالأمر على ما هو عليه الأمر والشأن والآيات التي صرف هذا العبد عنها هي عين الآيات التي أراها لمن أراها في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ الذي يتكبر به من تكبر فمن تكبر في الأرض دون السماء بغير الحق فهو أجهل الجاهلين لأنه وضع الكبرياء في غير موضعه إذ من شرطه أمران الواحد الحق الذي يقبله المخلوق والثاني العلو فمن تكبر في الأرض بالحق فالحق له العلو بالذات والسمو لم يصرف الله عنه الآيات فيريه إياها تشريفا لهذا المحل فإذا رآها تبين له عين الحق فإنه ما رآها إلا بالحق وبِالْحَقِّ أَنْزَلْناهُ وبِالْحَقِّ نَزَلَ وما خَلَقْناهُما إِلَّا بِالْحَقِّ وأمرنا أن نعطي كل ذي حق حقه وما ثم إلا ذو حق وحقه إنما هو الحافظ له وهنا نكتة خفية فإن الله له على عباده حق يطلبه منهم وقد ورد في الصحيح أن حق الله أحق بالقضاء من حق المخلوق‏\n\n\nلأن نسبة الحق إلى الله أتم وأصح من نسبة الحق إلى المخلوق لأن نسبة الحق بالحق ذاتية ما هي بالجعل ونسبة الحق إلى المخلوق بالجعل ولكنه جعل لا يصح انفكاكه عنه فالسعيد من عرف الحقوق وأهلها فأداها والشقي من لم يعرف الحقوق ولا عرف أهلها والذي بين السعيد والشقي من عرف الحقوق وأهلها وظلمهم وظلمها فهذه الطائفة هم في ظُلُماتٍ لا يُبْصِرُونَ والطرف الآخر هم الصم البكم العمي الذين لا يَرْجِعُونَ عند ما يبصرون ولا يَعْقِلُونَ عند ما يسمعون ولا يصيبون عند ما يتكلمون فأولئك الذين ما ظَلَمَهُمُ الله ولكِنْ كانُوا هُمُ الظَّالِمِينَ فإنهم ظلموا الحقوق وأهلها فإن لهم قلوبا يعقلون ويفقهون بها وإن لهم أعينا يبصرون بها وإن لهم آذانا يسمعون بها فأنزلوا نفوسهم منزلة الأنعام بل أضل سبيلا لأن الأنعام ما جعل الله لهم هذه القوي التي توجب لصاحب البصر أن يعتبر ولصاحب الأذن أن يعي ما يسمع ولصاحب القلب أن يعقل فهم الذين يَتَفَكَّرُونَ في خَلْقِ السَّماواتِ والْأَرْضِ فيعطيهم التفكر مما سمعوا وأبصروا وتقليب الأحوال عليهم أن يقولوا رَبَّنا ما خَلَقْتَ هذا باطِلًا سُبْحانَكَ فسبحوه إن جعلوه منزها عن إيجاب العلة عليه في خلقه لأنه إذن خلقها لحكمة فكان تلك الحكمة أوجبت الخلق عليه وما ثم موجب عليه إلا ما يوجبه‏\nبنفسه على نفسه لخلقه امتنانا منه لصدق وعده لا غير وتمم التعريف بقوله فَقِنا عَذابَ النَّارِ وليست إلا الطبيعة في هذه الدار فإنها محل الانفعال فيها لأنها للحق بمنزلة الأنثى للذكر ففيها يظهر التكوين أعني تكوين كل ما سوى الله وهي أمر معقول فلما رأى من رأى قوة سلطانها وما علم إن قوة سلطانها إنما هو في قبولها لما يكونه الحق فيها فنسبوا التكوين لها وأضافوه إليها ونسوا الحق بها فَأَنْساهُمْ أَنْفُسَهُمْ إذ صرفهم عن آيات نفوسهم وهو قوله سَأَصْرِفُ عَنْ آياتِيَ الَّذِينَ ووصفهم الحق‏\n\n\n### [انقسم الخلق إلى قسمين‏]\n\n\nفانقسم الخلق إلى قسمين قسم إلى الحق الصرف وقسم إلى الطبيعة الصرف وظهر بينهما برزخ ظهر فيه عالم ما هو ولا واحد من هذين القسمين فرأى ما يستحقه الحق فأعطاه حقه ولو لم يعطه فهو له ورأى ما تستحقه الطبيعة فأعطاها حقها ولو لم يعطها فهو لها فإن الطبيعة ليست بمجعولة بل هي لذاتها في العقل لا في العين كما هو الحق لذاته في العقل والعين فإن اجتمع الحق والطبيعة في العقل فقد افترق الحق من العقل وتميز في العين فإن الحق له الوجود العيني والعقلي والطبيعة لها الوجود العقلي ما لها وجود عيني وذلك ليكون الحكم في الخلق بين الوجود والعدم فيقبل العدم من حيث الطبيعة ويقبل الوجود من جانب الحق فلهذا يتصف كل ما سوى الله بقبول العدم والوجود فكان الحكم فيه للعدم كما كان فيه الحكم للوجود ولو لم يكن الأمر على ما ذكرناه لاستحال على المخلوق قبول العدم في وجوده أو قبول الوجود في عدمه فهكذا ينبغي أن تعرف الحقائق ولا سبيل إليها إلا بعدم الصرف عن الآيات والنظر إلى ما حرم الله من تكبر في الْأَرْضِ بِغَيْرِ الْحَقِّ وهذا من العلم الذي انتجه هذا الذكر لصاحبه وأمثاله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ فللطبيعة القبول وللحق الوهب والتأثير فهي الأم العالية الكبرى للعالم الذي لا يرى العالم إلا آثارها لا عينها كما أنه لا يرى أيضا من الحق إلا آثاره لا عينه فإن الأبصار لا تدركه والرؤية ليست إلا بها فهو المجهول الذي لا يعلم سواه وهو المعلوم للذي لا يمكن لأحد الجهل به وإن لم يعلم ما هو\n\n\n> فبين حق وبين طبع *** لاح لنا في الوجود خلق‏\n\n\n> ليس بحق ولا بطبع *** والطبع طبع والحق حق‏\n\n\n> والخلق كالوفق إن نظرنا *** فكل خلق تراه وفق‏\n\n",
    "en": "## Chapter Five Hundred and Ten: In Knowing the State of a Pole Whose Station Was: <<سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ>> (I shall turn away from My signs those who are arrogant upon the earth without right)\n\nI shall turn away from the proofs of Existence (براهين الوجود)\nHearts that have not attained the ranks of prostration (رتب السجود).\n\nFor when they boasted with pride and vanity\nOver the People of the Stations of Vision (أهل المشاهد) and Witnessing (الشهود),\n\nWe deprived them of the Sciences (العلوم), so they did not attain them\nAs the People of Intention (أهل القصود) attained them.\n\n### [Majesty is the Mantle of Allah (الكبرياء رداء الله)]\n\nKnow—may Allah support us and you—that Majesty (الكبرياء) belongs only to Allah. Thus, whoever among creation is arrogant without right (بغير الحق) is not truly great in reality (في نفس الأمر). Rather, it is merely a claim of a state (دعوى حال) that has no existence in the essence (عين) of the claimant. If it does have existence, and the claim is true, then the claimant in that instance is none other than the Real (الحق), and the Real possesses Majesty.\n\nThe locus (المحل) is only called arrogant (متكبرا) because the claim did not manifest except in a locus that possesses Majesty and whose claim is rightful. Thus, the tongue of the claimant was the very essence of the Real, as it came in the tradition: \"Allah was his hearing and his sight.\"\n\n### [That Allah has a Right over His Servants (أن لله على عباده حق)]\n\nKnow that Allah does not turn anyone away (صرف) from the Signs (الآيات) except that He has turned him away from the Knowledge (العلم) of the matter as the matter and affair truly are. The Signs from which this servant was turned away are the very Signs that He shows to those whom He shows them: <<فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ>> (in the horizons and within themselves until it becomes clear to them that He is the Real)—by whom whoever is arrogant, is arrogant.\n\nThus, whoever is arrogant upon the earth, short of the heaven, without right, is the most ignorant of the ignorant. This is because he placed Majesty (الكبرياء) in the wrong place, since its condition requires two things: First, the Real (الحق) which the creature accepts; and second, Transcendence (العلو).\n\nWhoever is arrogant upon the earth *by* the Real—for the Real possesses essential Transcendence (العلو بالذات) and Sublimity (السمو)—Allah does not turn the Signs away from him, but shows them to him, honoring this locus. When he sees them, the very Essence of the Real (عين الحق) becomes clear to him, for he only saw them through the Real. <<وَبِالْحَقِّ أَنْزَلْنَاهُ وَبِالْحَقِّ نَزَلَ>> (And with the Truth [the Real] We sent it down, and with the Truth it descended), and <<وَمَا خَلَقْنَاهُمَا إِلَّا بِالْحَقِّ>> (And We did not create them both except with the Truth).\n\nWe were commanded to give every possessor of a right (ذي حق) his due right (حقه). And there is nothing there except a possessor of a right, and his right is only that which preserves him.\n\nHere is a subtle point (نكتة خفية): Allah has a right over His servants which He demands from them. It has been reported in the *Sahih* collection that the right of Allah is more deserving of fulfillment than the right of the creature. This is because the attribution of the right to Allah is more perfect and sound than the attribution of the right to the creature, for the attribution of the right *by* the Real is essential (ذاتية), not by imposition (بالجعل), whereas the attribution of the right to the creature is by imposition, yet it is an imposition that cannot be separated from him.\n\nThe fortunate one (السعيد) is he who knows the rights and their possessors and fulfills them. The wretched one (الشقي) is he who neither knows the rights nor knows their possessors. And those between the fortunate and the wretched are those who knew the rights and their possessors but wronged them and wronged the rights themselves. This group is in <<ظُلُمَاتٍ لَا يُبْصِرُونَ>> (darknesses, they do not see). The other extreme are the deaf, the dumb, the blind, who <<لَا يَرْجِعُونَ>> (do not return) when they see, nor <<يَعْقِلُونَ>> (do they reason) when they hear, nor do they speak correctly when they talk.\n\nThose are the ones whom <<مَا ظَلَمَهُمُ اللَّهُ وَلَكِنْ كَانُوا هُمُ الظَّالِمِينَ>> (Allah did not wrong, but they were the wrongdoers), for they wronged the rights and their possessors. Indeed, they have hearts with which they reason and understand, and they have eyes with which they see, and they have ears with which they hear. Yet they lowered their souls to the level of cattle, nay, they are more astray in path. This is because Allah did not grant cattle these faculties which necessitate that the possessor of sight should reflect, the possessor of hearing should comprehend what he hears, and the possessor of the heart should reason.\n\nThey are those who <<يَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ>> (reflect upon the creation of the heavens and the earth). This reflection, based on what they heard and saw, and the changing of states upon them, leads them to say: <<رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ>> (Our Lord, You did not create this in vain. Glory be to You). They glorified Him by declaring Him transcendent (منزها) above the necessity of a cause (العلة) for His creation. For if He created it due to a wisdom (حكمة), then that wisdom would have necessitated the creation upon Him. And there is no necessity upon Him except what He necessitates upon Himself, by Himself, for His creation, as a favor from Him, due to the truthfulness of His promise, and nothing else.\n\nThey completed the definition by saying: <<فَقِنَا عَذَابَ النَّارِ>> (So protect us from the punishment of the Fire). The Fire is none other than Nature (الطبيعة) in this abode, for it is the locus of passivity (محل الانفعال) within it, being to the Real (الحق) as the female is to the male. In it appears the formation (التكوين)—meaning the formation of everything other than Allah—and it is an intelligible matter (أمر معقول). When those who saw perceived the strength of its dominion, and did not know that the strength of its dominion lies only in its acceptance of what the Real forms within it, they attributed the formation to it and ascribed it to it, forgetting the Real through it. Thus, <<فَأَنْسَاهُمْ أَنْفُسَهُمْ>> (He made them forget themselves), since He turned them away from the signs of their own souls, which is His saying: <<سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ>> (I shall turn away from My signs those who...), and the Real described them.\n\n### [Creation is Divided into Two Sections (انقسم الخلق إلى قسمين)]\n\nCreation (الخلق) is thus divided into two sections: a section belonging to the Pure Real (الحق الصرف) and a section belonging to Pure Nature (الطبيعة الصرف). And between them appeared an Isthmus (برزخ), in which appeared a world (عالم) that is neither one of these two sections.\n\nThis world saw what the Real deserves and gave Him His right, and even if it did not give it, it belongs to Him. And it saw what Nature deserves and gave it its right, and even if it did not give it, it belongs to it. For Nature is not something imposed (مجعولة); rather, it exists by its Essence (لذاتها) in the Intellect (العقل), not in concrete existence (العين), just as the Real exists by His Essence in the Intellect and in concrete existence.\n\nIf the Real and Nature meet in the Intellect, then the Real has separated from the Intellect and become distinct in concrete existence. For the Real possesses concrete existence (الوجود العيني) and intellectual existence (الوجود العقلي), while Nature possesses intellectual existence but does not possess concrete existence. This is so that the ruling (الحكم) in creation may be between Existence (الوجود) and Non-existence (العدم). Thus, it accepts Non-existence from the perspective of Nature and accepts Existence from the side of the Real.\n\nFor this reason, everything other than Allah is characterized by the acceptance of Non-existence and Existence. Thus, the ruling of Non-existence applies to it, just as the ruling of Existence applies to it. If the matter were not as we have mentioned, it would be impossible for the creature to accept Non-existence in its existence or to accept Existence in its non-existence.\n\nThis is how the Realities (الحقائق) ought to be known. There is no path to them except by not being turned away from the Signs and by observing what Allah has forbidden: arrogance <<فِي الْأَرْضِ بِغَيْرِ الْحَقِّ>> (upon the earth without right). This is part of the Knowledge (العلم) that this mention (الذكر) produced for its possessor and those like him. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).\n\nThus, acceptance (القبول) belongs to Nature, and bestowal (الوهب) and influence (التأثير) belong to the Real. Nature is the Exalted Great Mother (الأم العالية الكبرى) of the World, whose effects (آثارها) alone are seen in the World, not its essence (عينها). Similarly, only the effects of the Real are seen, not His essence, for sights do not comprehend Him, and vision (الرؤية) is only through Him. He is the Unknown (المجهول) beside whom nothing is known, and He is the Known (المعلوم) whom no one can possibly be ignorant of, even if they do not know what He is.\n\nSo between the Real and Nature,\nA creation appeared to us in Existence.\n\nIt is neither the Real nor Nature,\nAnd Nature is Nature, and the Real is the Real.\n\nAnd creation is like the harmony (الوفق) if we look,\nFor every creation you see is harmony.",
    "ur": "پانچ سو دسواں باب اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"میں اپنی نشانیوں سے ان لوگوں کو پھیر دوں گا جو زمین میں ناحق تکبر کرتے ہیں\" (سَأَصْرِفُ عَنْ آياتِيَ الَّذِينَ يَتَكَبَّرُونَ في الْأَرْضِ بِغَيْرِ الْحَقِّ)\n\nمیں ہستی (الوجود) کی دلیلوں سے ان دلوں کو پھیر دوں گا\nجنہوں نے سجدے کے مراتب حاصل نہیں کیے\n\nجب وہ اہل مشاہدہ (المشاہد) اور اہل شہود (الشہود) پر\nفخر اور خود پسندی کے ساتھ اکڑ گئے\n\nتو ہم نے انہیں علوم سے محروم کر دیا، پس وہ انہیں حاصل نہ کر سکے\nجیسا کہ اہل قصود (سچے ارادے والے) نے انہیں حاصل کیا\n\n### [کبریا اللہ کی چادر ہے]\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ کبریا (الكبرياء) صرف اللہ کے لیے ہے۔ پس مخلوق میں سے جو کوئی ناحق تکبر کرے، وہ حقیقت میں بڑا نہیں ہے۔ یہ محض ایک دعویٰ ہے جس کی مدعی کی ذات میں کوئی ہستی (الوجود) نہیں ہے۔ اگر اس کا وجود ہو اور دعویٰ صحیح ہو، تو مدعی اس وقت ذات حق (الحق) کے سوا کوئی نہیں ہو سکتا، اور ذات حق (الحق) ہی کے لیے کبریا (الكبرياء) ہے۔ محل (جگہ) کو متکبر صرف اس لیے کہا گیا کہ دعویٰ صرف اسی محل میں ظاہر ہوا جس کے لیے کبریا (الكبرياء) نہیں ہے، اور اس کا دعویٰ حق کے ساتھ تھا۔ پس مدعی کی زبان عین ذات حق (الحق) تھی، جیسا کہ حدیث میں آیا ہے: \"اللہ اس کا کان اور اس کی آنکھ بن جاتا ہے۔\"\n\n### [کہ اللہ کا اپنے بندوں پر حق ہے]\n\nاور جان لو کہ اللہ نے کسی کو نشانیوں (الآیات) سے نہیں پھیرا مگر اسے اس امر کے علم (العلم) سے پھیر دیا جو حقیقت میں ہے۔ اور جن نشانیوں (الآیات) سے اس بندے کو پھیرا گیا، وہ بعینہٖ وہی نشانیاں ہیں جو اس نے ان لوگوں کو دکھائیں جنہیں \"آفاق میں اور ان کے نفوس میں، یہاں تک کہ ان پر ظاہر ہو جائے کہ وہ (اللہ) ہی حق (الحق) ہے\" (فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ)۔ یہی وہ حق (الحق) ہے جس کے ذریعے متکبر شخص تکبر کرتا ہے۔ پس جو زمین میں آسمان کے بغیر ناحق تکبر کرتا ہے، وہ جاہلوں میں سب سے بڑا جاہل ہے، کیونکہ اس نے کبریا (الكبرياء) کو اس کی جگہ پر نہیں رکھا۔ کبریا کی شرطیں دو ہیں: پہلی، وہ حق (الحق) جسے مخلوق قبول کرے، اور دوسری، بلندی (العلو)۔ پس جو زمین میں حق کے ساتھ تکبر کرتا ہے، تو حق (الحق) اپنی ذات کے اعتبار سے بلندی (العلو) اور رفعت رکھتا ہے۔ اللہ اسے نشانیوں (الآیات) سے نہیں پھیرتا، بلکہ اس محل کی تشریف کے لیے اسے وہ نشانیاں دکھاتا ہے۔ جب وہ انہیں دیکھتا ہے، تو اس پر عین ذات حق (الحق) ظاہر ہو جاتی ہے، کیونکہ اس نے انہیں حق (الحق) ہی کے ذریعے دیکھا ہے۔ اور \"ہم نے اسے حق کے ساتھ نازل کیا اور وہ حق کے ساتھ نازل ہوا\" (وَبِالْحَقِّ أَنْزَلْنَاهُ وَبِالْحَقِّ نَزَلَ)۔ اور \"ہم نے ان دونوں کو حق کے سوا پیدا نہیں کیا\" (وَمَا خَلَقْنَاهُمَا إِلَّا بِالْحَقِّ)۔ ہمیں حکم دیا گیا ہے کہ ہم ہر حقدار کو اس کا حق دیں۔ اور وہاں حقدار کے سوا کچھ نہیں ہے، اور اس کا حق ہی اس کا محافظ ہے۔ یہاں ایک لطیف نکتہ ہے: اللہ کا اپنے بندوں پر ایک حق ہے جسے وہ ان سے طلب کرتا ہے۔ اور صحیح حدیث میں آیا ہے کہ اللہ کا حق مخلوق کے حق سے زیادہ ادائیگی کا مستحق ہے۔\n\nکیونکہ حق کی نسبت اللہ کی طرف مخلوق کی طرف حق کی نسبت سے زیادہ کامل اور صحیح ہے۔ حق (الحق) کی نسبت حق (الحق) کے ساتھ ذاتی ہے، یہ کسی جعل (بناوٹ) سے نہیں ہے۔ اور حق کی نسبت مخلوق کی طرف جعل سے ہے، لیکن یہ ایسا جعل ہے جس سے اس کا جدا ہونا ممکن نہیں۔ پس خوش نصیب وہ ہے جس نے حقوق اور ان کے اہل کو پہچانا اور انہیں ادا کیا، اور بدبخت وہ ہے جس نے نہ حقوق کو پہچانا اور نہ ان کے اہل کو۔ اور سعید اور شقی کے درمیان وہ لوگ ہیں جنہوں نے حقوق اور ان کے اہل کو پہچانا، لیکن ان پر اور ان حقوق پر ظلم کیا۔ یہ گروہ \"اندھیروں میں ہیں، وہ نہیں دیکھتے\" (فِي ظُلُمَاتٍ لَا يُبْصِرُونَ)۔ اور دوسرا فریق وہ بہرے، گونگے، اندھے ہیں جو جب دیکھتے ہیں تو \"رجوع نہیں کرتے\" (لَا يَرْجِعُونَ)، اور جب سنتے ہیں تو \"عقل نہیں کرتے\" (لَا يَعْقِلُونَ)، اور جب بولتے ہیں تو درست بات نہیں کرتے۔ یہی وہ لوگ ہیں \"جن پر اللہ نے ظلم نہیں کیا، بلکہ وہ خود ہی ظالم تھے\" (مَا ظَلَمَهُمُ اللَّهُ وَلَكِنْ كَانُوا هُمُ الظَّالِمِينَ)۔ کیونکہ انہوں نے حقوق اور ان کے اہل پر ظلم کیا۔ حالانکہ ان کے پاس دل ہیں جن سے وہ عقل کرتے اور سمجھتے ہیں، اور ان کے پاس آنکھیں ہیں جن سے وہ دیکھتے ہیں، اور ان کے پاس کان ہیں جن سے وہ سنتے ہیں۔ پس انہوں نے اپنے نفوس کو چوپایوں کے مقام پر گرا دیا، بلکہ وہ ان سے بھی زیادہ گمراہ ہیں۔ کیونکہ اللہ نے چوپایوں کو وہ قوتیں نہیں دیں جو صاحبِ بصارت پر غور و فکر کو واجب کرتی ہیں، اور صاحبِ کان پر سنے ہوئے کو یاد رکھنے کو، اور صاحبِ قلب پر عقل کرنے کو۔ یہی وہ لوگ ہیں جو \"آسمانوں اور زمین کی تخلیق میں غور و فکر کرتے ہیں\" (يَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ)۔ پس یہ غور و فکر انہیں اس بات پر مجبور کرتا ہے کہ وہ اپنے سنے ہوئے، دیکھے ہوئے اور اپنے اوپر پلٹنے والے حالات کی بنا پر کہیں: \"اے ہمارے رب! تو نے یہ سب باطل پیدا نہیں کیا، تو پاک ہے\" (رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ)۔ پس انہوں نے اللہ کی تسبیح کی، جب انہوں نے اسے اپنی تخلیق میں علت کے وجوب سے منزہ قرار دیا، کیونکہ اگر ایسا ہوتا تو وہ حکمت اس پر تخلیق کو واجب کر دیتی۔ حالانکہ اس پر کوئی چیز واجب نہیں کرتی سوائے اس کے جو وہ خود اپنے اوپر اپنی مخلوق کے لیے احسان کے طور پر، اپنے وعدے کی سچائی کے لیے واجب کرتا ہے، اور بس۔ اور انہوں نے اس تعریف کو اپنے اس قول سے مکمل کیا: \"پس ہمیں آگ کے عذاب سے بچا\" (فَقِنَا عَذَابَ النَّارِ)۔ اور یہ (آگ کا عذاب) اس دنیا میں صرف طبیعت (الطبیعۃ) ہی ہے، کیونکہ یہ اس میں انفعال (رد عمل) کا محل ہے۔ یہ حق (الحق) کے لیے ایسے ہے جیسے مؤنث مذکر کے لیے ہوتی ہے۔ پس اسی میں تکوین (تخلیق) ظاہر ہوتی ہے، یعنی اللہ کے سوا ہر چیز کی تکوین۔ اور یہ ایک معقول امر ہے۔ پس جب دیکھنے والے نے اس کے سلطان کی قوت کو دیکھا، اور یہ نہ جانا کہ اس کے سلطان کی قوت صرف اس کے قبول کرنے میں ہے جو حق (الحق) اس میں تخلیق کرتا ہے، تو انہوں نے تکوین کی نسبت اسی (طبیعت) کی طرف کر دی اور اسے اس سے منسوب کر دیا، اور اس کے ذریعے حق (الحق) کو بھول گئے۔ پس \"اس نے انہیں ان کے نفوس بھلا دیے\" (فَأَنْسَاهُمْ أَنْفُسَهُمْ)، کیونکہ اس نے انہیں ان کے نفوس کی نشانیوں (الآیات) سے پھیر دیا، اور یہی اس کا قول ہے: \"میں اپنی نشانیوں سے ان لوگوں کو پھیر دوں گا جو...\" (سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ)۔ اور حق (الحق) نے ان کی صفت بیان کی۔\n\n### [مخلوق دو حصوں میں تقسیم ہو گئی]\n\nپس مخلوق دو حصوں میں تقسیم ہو گئی: ایک حصہ خالص حق (الحق الصرف) کی طرف، اور دوسرا حصہ خالص طبیعت (الطبیعۃ الصرف) کی طرف۔ اور ان دونوں کے درمیان ایک برزخ (البرزخ) ظاہر ہوا، جس میں ایک ایسا عالم ظاہر ہوا جو ان دونوں حصوں میں سے کوئی بھی نہیں ہے۔ اس نے دیکھا کہ حق (الحق) کس چیز کا مستحق ہے، پس اسے اس کا حق دیا، اگرچہ وہ اسے نہ بھی دیتا تو وہ حق اسی کا تھا۔ اور اس نے دیکھا کہ طبیعت (الطبیعۃ) کس چیز کی مستحق ہے، پس اسے اس کا حق دیا، اگرچہ وہ اسے نہ بھی دیتا تو وہ حق اسی کا تھا۔ کیونکہ طبیعت (الطبیعۃ) مجعول (بنائی ہوئی) نہیں ہے، بلکہ وہ عقل میں اپنی ذات کے لیے ہے نہ کہ عین (خارجی وجود) میں، جیسا کہ حق (الحق) عقل اور عین میں اپنی ذات کے لیے ہے۔ اگر حق (الحق) اور طبیعت (الطبیعۃ) عقل میں جمع ہو جائیں، تو حق (الحق) عقل سے جدا ہو جاتا ہے اور عین (خارجی وجود) میں ممتاز ہو جاتا ہے۔ کیونکہ حق (الحق) کے لیے عینی وجود (الوجود العيني) اور عقلی وجود (الوجود العقلي) دونوں ہیں، جبکہ طبیعت (الطبیعۃ) کے لیے صرف عقلی وجود (الوجود العقلي) ہے، اس کے لیے عینی وجود (الوجود العيني) نہیں ہے۔ یہ اس لیے ہے تاکہ مخلوق میں وجود (الوجود) اور عدم (العدم) کے درمیان حکم ہو، پس وہ طبیعت (الطبیعۃ) کی طرف سے عدم (العدم) کو قبول کرے، اور حق (الحق) کی طرف سے وجود (الوجود) کو قبول کرے۔ اسی لیے اللہ کے سوا ہر چیز عدم (العدم) اور وجود (الوجود) دونوں کو قبول کرنے کی صفت سے متصف ہے۔ پس اس میں عدم (العدم) کا حکم بھی ہے، جیسا کہ اس میں وجود (الوجود) کا حکم ہے۔ اگر معاملہ ایسا نہ ہوتا جیسا کہ ہم نے ذکر کیا، تو مخلوق کے لیے اپنے وجود میں عدم (العدم) کو قبول کرنا، یا اپنے عدم میں وجود (الوجود) کو قبول کرنا محال ہو جاتا۔ حقائق (الحقائق) کو اسی طرح جاننا چاہیے، اور ان تک رسائی صرف نشانیوں (الآیات) سے نہ پھیرے جانے اور اس شخص کو دیکھنے سے ہے جسے اللہ نے زمین میں ناحق تکبر کرنے کی وجہ سے محروم کر دیا۔ یہ اس علم میں سے ہے جو اس ذکر نے اپنے صاحب اور اس جیسے لوگوں کے لیے پیدا کیا ہے۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔ پس قبول کرنا طبیعت (الطبیعۃ) کے لیے ہے، اور عطا کرنا اور تاثیر حق (الحق) کے لیے ہے۔ پس وہ (طبیعت) اس عالم کی اعلیٰ اور کبریٰ ماں ہے جو عالم کو صرف اس کے آثار کے طور پر دیکھتا ہے نہ کہ اس کی عین (ذات) کے طور پر، جیسا کہ وہ حق (الحق) کو بھی صرف اس کے آثار کے طور پر دیکھتا ہے نہ کہ اس کی عین (ذات) کے طور پر۔ کیونکہ نگاہیں اسے پا نہیں سکتیں، اور رؤیت صرف اسی کے ذریعے ہے۔ پس وہ وہ مجہول ہے جس کے سوا کوئی نہیں جانتا، اور وہ اس کے لیے معلوم ہے جس کے لیے اس سے جہالت ممکن نہیں، اگرچہ وہ یہ نہ جانتا ہو کہ وہ کیا ہے۔\n\nپس حق (الحق) اور طبیعت (الطبع) کے درمیان\nہستی (الوجود) میں ہمارے لیے ایک خلق (مخلوق) ظاہر ہوئی\n\nجو نہ حق (الحق) ہے اور نہ طبیعت (الطبع)\nاور طبیعت (الطبع) طبیعت ہے اور حق (الحق) حق ہے\n\nاور اگر ہم دیکھیں تو خلق (مخلوق) وفاق (مطابقت) کی مانند ہے\nپس ہر خلق جسے تم دیکھتے ہو وہ وفاق ہے۔",
    "fa": "باب پانصد و دهم در معرفت حال قطبی که منزل او این آیه بود: «به زودی کسانی را که در زمین به ناحق تکبر می‌ورزند، از آیات خود منصرف خواهم ساخت.» (سَأَصْرِفُ عَنْ آياتِيَ الَّذِينَ يَتَكَبَّرُونَ في الْأَرْضِ بِغَيْرِ الْحَقِّ)\n\nبه زودی دل‌هایی را که به مرتبه سجود نرسیده‌اند، از براهین هستی (الوجود) منصرف خواهم ساخت.\nزیرا هنگامی که با فخر و عجب بر اهل مشاهدات و شهود (الشهود) برتری جستند،\nآنان را از علوم محروم کردیم، پس بدان دست نیافتند، چنان که اهل قصد و نیت بدان دست یافتند.\n\n### [کبریایی ردای خداوند است]\n\nبدان، خداوند ما و تو را تأیید کند، که کبریایی (الکبرياء) تنها از آنِ خداوند است. پس هر کس از مخلوقات به ناحق تکبر ورزد، در واقع امر بزرگ نیست، بلکه این صرفاً ادعای حالی است که در عین مدعی وجود ندارد. اگر وجودی داشته باشد و ادعا صحیح باشد، در آن صورت مدعی جز حق (الحق) نیست و حق (الحق) است که کبریایی از آن اوست. محل (مخلوق) متکبر نامیده نشد مگر به این دلیل که ادعا جز در محلی که کبریایی از آن او نیست، ظاهر نشده است، و ادعای او به حق است، پس زبان مدعی عین حق (الحق) بود، چنان که آمده است: «خداوند گوش و چشم او بود.»\n\n### [خداوند بر بندگانش حقی دارد]\n\nو بدان که خداوند هیچ کس را از آیات (الآيات) منصرف نساخت مگر آنکه او را از علم به امر، آن‌گونه که امر و شأن بر آن است، منصرف کرده است. و آیاتی که این بنده از آن‌ها منصرف شده، عین همان آیاتی است که به کسانی که در «آفاق و در نفوسشان» (فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ) به آن‌ها نظر کردند، نشان داد تا برایشان آشکار شود که او حق (الحق) است؛ همان حقی که متکبر به واسطه آن تکبر می‌ورزد. پس هر کس در زمین، نه در آسمان، به ناحق تکبر ورزد، جاهل‌ترین جاهلان است، زیرا کبریایی (الکبرياء) را در غیر جایگاهش قرار داده است. چرا که شرط کبریایی دو چیز است: اول، حق (الحق) که مخلوق آن را می‌پذیرد؛ و دوم، علو (برتری). پس هر کس در زمین به حق (الحق) تکبر ورزد، حق (الحق) به ذات خود علو و برتری دارد. خداوند او را از آیات (الآيات) منصرف نمی‌سازد، بلکه آن‌ها را به جهت تشریف این محل به او نشان می‌دهد. پس چون آن‌ها را ببیند، عین حق (الحق) برایش آشکار می‌شود، زیرا او آن‌ها را جز به حق (الحق) ندیده است. «و ما آن را به حق (بِالْحَقِّ) نازل کردیم و به حق (بِالْحَقِّ) نازل شد.» (وَبِالْحَقِّ أَنْزَلْناهُ وَبِالْحَقِّ نَزَلَ) و «ما آسمان و زمین را جز به حق (بِالْحَقِّ) نیافریدیم.» (وَمَا خَلَقْناهُما إِلَّا بِالْحَقِّ) و به ما امر شده است که حق هر صاحب حقی را به او بدهیم، و در آنجا جز صاحب حق و حق او نیست، و حق او همان حافظ اوست. و در اینجا نکته‌ای پنهان وجود دارد: خداوند بر بندگانش حقی دارد که آن را از ایشان می‌طلبد. و در حدیث صحیح آمده است که حق خداوند برای ادا شدن سزاوارتر از حق مخلوق است.\n\nزیرا نسبت حق (الحق) به خداوند کامل‌تر و صحیح‌تر از نسبت حق به مخلوق است، چرا که نسبت حق (الحق) به حق (الحق) ذاتی است و با جعل (قرار دادن) نیست، در حالی که نسبت حق به مخلوق با جعل است. اما این جعلی است که انفکاک از آن صحیح نیست. پس سعادتمند کسی است که حقوق و اهل آن‌ها را بشناسد و آن‌ها را ادا کند، و شقی کسی است که نه حقوق را بشناسد و نه اهل آن‌ها را. و گروهی که بین سعادتمند و شقی قرار دارند، کسانی هستند که حقوق و اهل آن‌ها را می‌شناسند، اما به آن‌ها و حقوقشان ظلم می‌کنند. این طایفه در «تاریکی‌هایی هستند که نمی‌بینند.» (فِي ظُلُماتٍ لا يُبْصِرُونَ) و گروه دیگر، کران، لالان و کورانی هستند که هنگام دیدن باز نمی‌گردند (لا يَرْجِعُونَ)، و هنگام شنیدن تعقل نمی‌کنند (لا يَعْقِلُونَ)، و هنگام سخن گفتن به صواب نمی‌رسند. پس «اینان کسانی هستند که خداوند به آنان ظلم نکرده، بلکه خودشان ستمکار بوده‌اند.» (ما ظَلَمَهُمُ اللَّهُ وَلكِنْ كانُوا هُمُ الظَّالِمِينَ) زیرا به حقوق و اهل آن‌ها ظلم کردند. در حالی که دل‌هایی دارند که با آن‌ها تعقل و تفقه می‌کنند، و چشم‌هایی دارند که با آن‌ها می‌بینند، و گوش‌هایی دارند که با آن‌ها می‌شنوند. پس خود را به منزله چهارپایان قرار دادند، بلکه گمراه‌ترند، زیرا خداوند این قوای (نیروها) را برای چهارپایان قرار نداده است؛ قوایی که بر صاحب بینایی واجب می‌کند که عبرت گیرد، و بر صاحب گوش واجب می‌کند که آنچه را می‌شنود دریابد، و بر صاحب قلب واجب می‌کند که تعقل کند. اینان کسانی هستند که «در آفرینش آسمان‌ها و زمین می‌اندیشند.» (يَتَفَكَّرُونَ فِي خَلْقِ السَّماواتِ وَالْأَرْضِ) و این اندیشیدن، از آنچه شنیده‌اند و دیده‌اند و از دگرگونی احوال بر آن‌ها، به ایشان می‌دهد که بگویند: «پروردگارا، این را باطل نیافریده‌ای، منزهی تو.» (رَبَّنا ما خَلَقْتَ هذا باطِلًا سُبْحانَكَ) پس او را تسبیح کردند، زیرا او را از اینکه علتی بر او در آفرینشش واجب کند، منزه دانستند. چرا که اگر چنین بود، آن حکمت، آفرینش را بر او واجب می‌کرد، در حالی که هیچ واجبی بر او نیست مگر آنچه خود بر خود واجب می‌کند، برای خلقش، از روی منت و برای صدق وعده‌اش، و نه چیز دیگر. و تعریف را با این قول کامل کردند: «پس ما را از عذاب آتش حفظ کن.» (فَقِنا عَذابَ النَّارِ) و آن آتش چیزی جز طبیعت (الطبيعة) در این دنیا نیست، زیرا طبیعت محل انفعال در آن است، چرا که طبیعت برای حق (الحق) به منزله مؤنث برای مذکر است. پس تکوین (آفرینش) در آن ظاهر می‌شود، منظورم تکوین هر آنچه سوای خداست. و طبیعت امری معقول است. پس هنگامی که بیننده، قدرت سلطه آن را دید و ندانست که قدرت سلطه آن تنها در پذیرش چیزی است که حق (الحق) در آن تکوین می‌بخشد، تکوین را به طبیعت نسبت دادند و آن را به طبیعت اضافه کردند و حق (الحق) را به واسطه آن فراموش کردند. «پس خداوند خودشان را از یادشان برد.» (فَأَنْساهُمْ أَنْفُسَهُمْ) زیرا آنان را از آیات نفوسشان منصرف ساخت، و این همان قول اوست: «به زودی کسانی را که... از آیات خود منصرف خواهم ساخت.» (سَأَصْرِفُ عَنْ آياتِيَ الَّذِينَ) و حق (الحق) آنان را وصف کرد.\n\n### [خلق به دو بخش تقسیم شد]\n\nپس خلق به دو بخش تقسیم شد: بخشی به سوی حق (الحق) محض و بخشی به سوی طبیعت (الطبيعة) محض. و میان این دو، برزخی ظاهر شد که در آن عالمی پدید آمد که نه این است و نه آن. پس آنچه را که حق (الحق) سزاوار آن است دید و حقش را به او داد، و اگر هم نمی‌داد، آن حق از آنِ او بود. و آنچه را که طبیعت (الطبيعة) سزاوار آن است دید و حقش را به او داد، و اگر هم نمی‌داد، آن حق از آنِ او بود. زیرا طبیعت (الطبيعة) مجعول (قرار داده شده) نیست، بلکه به ذات خود در عقل وجود دارد، نه در عین (خارج)، همان‌گونه که حق (الحق) به ذات خود در عقل و عین وجود دارد. اگر حق (الحق) و طبیعت (الطبيعة) در عقل جمع شوند، حق (الحق) از عقل جدا می‌شود و در عین (خارج) متمایز می‌گردد. زیرا حق (الحق) وجود عینی و عقلی دارد، اما طبیعت (الطبيعة) وجود عقلی دارد و وجود عینی ندارد. و این بدان جهت است که حکم در خلق میان هستی (الوجود) و نیستی (العدم) باشد، پس نیستی را از جهت طبیعت (الطبيعة) می‌پذیرد و هستی را از جانب حق (الحق) می‌پذیرد. به همین دلیل، هر آنچه غیر خداست، به پذیرش نیستی و هستی متصف می‌شود. پس حکم در آن برای نیستی بود، همان‌گونه که حکم در آن برای هستی بود. و اگر امر بر این منوال که ذکر کردیم نبود، پذیرش نیستی در هستی مخلوق یا پذیرش هستی در نیستی او محال می‌شد. پس حقایق (الحقائق) را این‌گونه باید شناخت، و راهی به سوی آن‌ها نیست مگر با منصرف نشدن از آیات (الآيات) و نظر کردن به آنچه خداوند بر کسی که در زمین به ناحق تکبر ورزیده، حرام کرده است. و این از علمی است که این ذکر برای صاحبش و امثال او به بار آورده است. و «خداوند حق (الْحَقَّ) را می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) پس پذیرش از آنِ طبیعت (الطبيعة) است و بخشش و تأثیر از آنِ حق (الحق) است. پس طبیعت، مادر عالی و بزرگ عالم است، عالمی که جز آثار طبیعت را نمی‌بیند، نه عین آن را؛ همان‌گونه که از حق (الحق) نیز جز آثارش را نمی‌بیند، نه عین او را. زیرا دیده‌ها او را درک نمی‌کنند و رؤیت جز به واسطه او نیست. پس او مجهولی است که جز او دانسته نمی‌شود، و او معلومی است که جهل به او برای هیچ کس ممکن نیست، حتی اگر نداند که او چیست.\n\nپس میان حق (حق) و میان طبیعت (طبع)، خلقی در هستی (الوجود) برای ما آشکار شد،\nکه نه حق (حق) است و نه طبیعت (طبع)، و طبیعت (طبع) طبیعت است و حق (حق) حق است.\nو اگر بنگریم، خلق مانند وفاق (سازگاری) است، پس هر خلقی که می‌بینی، وفاق است."
  },
  "page_count": 2
}