{
  "id": 199,
  "title": {
    "ar": "الباب التاسع والتسعون ومائة في السر",
    "en": "Chapter 199: Concerning the Secret (السر)",
    "ur": "خاموشی سے سوچیں:\n۱.  **اصل متن کی شناخت:** الباب التاسع والتسعون ومائة في السر\n۲.  **اجزاء کی تحلیل:**\n    *   الباب: باب (Chapter)\n    *   التاسع والتسعون ومائة: ایک سو ننانوے (۱۹۹)\n    *   في السر: راز کے بارے میں/راز میں\n۳.  **ترجمہ کی تشکیل:** باب ایک سو ننانوے، راز کے بارے میں۔\n۴.  **حتمی اردو ترجمہ (صرف ترجمہ):** باب ایک سو ننانوے، راز کے بیان میں۔",
    "fa": "باب صد و نود و نهم در سِرّ (سرّ)"
  },
  "content": {
    "ar": "## «الباب التاسع والتسعون ومائة في السر»\n\n\n> السر تثبيت المراتب فافتكر *** فهو الدليل على ثبوت الواحد\n\n\n> بالفرد صح وجودنا في عيننا *** في غائب إن كان أو في شاهد\n\n\n> إن الإشارة بالحقيقة تيمت *** وهي الدليل على انتفاء الواجد\n\n\n> والحال يطلبه المراد بكونه *** فيه بحكم لا يكون بزائد\n\n\n> والعالم النحرير إن قامت به *** صفة العلوم فحكمه كالفاقد\n\n\n### [إن للسر ثلاث مراتب‏]\n\n\nاعلم أن السر عند الطائفة على ثلاث مراتب سر العلم وسر الحال وسر الحقيقة\n\n\nفأما سر العلم وسر الحال‏\n\n\nفهو حقيقة العلماء بالله لا بغيره‏\nمن الأسماء فإن سر العلم بالله هو جمع الأضداد بالحكم في العين الواحدة من حيث ما هو منسوب إليه كذا مما له ضد من ذلك بعينه ينسب إليه ضده وهذا سر لا يعلمه إلا من وجده في نفسه فاتصف به فحكم على عينه بحكم حكم عليه أيضا بضده من حيث حكم ضده لا من نسبة أخرى ولا من إضافة ولهذا جعله الله سر العلم لأن العلم كل علم حصل عن دلالة لأنه مشتق من العلامة ولذلك أضيف العلم إلى الله بالأشياء لأنه علم نفسه فعلم العالم فهو دليل وعلامة على العالم كما كان العالم علامة عليه في علمنا به وهوقوله صلى الله عليه وسلم من عرف نفسه عرف ربه‏\n\n\nفجعلك لك دليلا عليه فعلمته كما كانت ذاته دليلا عليك له فعلمك فأوجدك فهذا من خفي سر العلم الذي لا يعلمه إلا العلماء بالله فإذا كان الحق سمع العبد وبصره وعلمه علمته به وجعلته دليلا وعلامة على نفسه وهذا هو سر الحال ومنه نفخ عيسى في الصورة التي أنشأها من الطين فكانت طيرا وبسر العلم دعاء إبراهيم عليه السلام الأطيار فاتته سعيا فإن كان قوله بِإِذْنِي العامل فيه تنفخ فهو سر الحال وإن كان العامل فيه فيكون فهو سر العلم وهذا لا يعلمه إلا صاحبه وهو عيسى عليه السلام وسر العلم أتم من سر الحال لأن سر العلم هو لله وهو الذي ظهر به إبراهيم الخليل عليه السلام فإنه ما زاد على إن دعاهن ولم يذكر نفخا فكان كقوله إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ وسر الحال لا يكون إلا من نعوت الخلق ليس من نعوت الحق فسر العلم أتم وحكمه أعم فالحال من جملة معلومات العلم وممن هو تحت إحاطته ولو كان الحال أتم من العلم لكان الحق قد أمر نبيه بطلب الأنقص ويكون الحق قد ترك وصفه بالأتم وهذا محال فليس الشرف إلا لسر العلم‏\n\n\nوأما سر الحقيقة\n\n\nفهو إن تعلم أن العلم ليس بأمر زائد على ذات العالم وأنه يعلم الأشياء بذاته لا بما هو مغاير لذاته أو زائد على ذاته فسر الحقيقة يعطي أن العين والحكم مختلف وسر الحال يلبس فيقول القائل بسر الحال أنا الله وسبحاني وأنا من أهوى ومن أهوى أنا\n\n\nوسر العلم يفرق بين العلم والعالم فبسر العالم تعلم أن الحق سمعك وبصرك ويدك ورجلك مع نفوذ كل واحد من ذلك وقصوره وأنك لست هو عينه وبسر الحال ينفذ سمعك في كل مسموع في الكون إذا كان الحق سمعك حالا وكذلك سائر قواك وبسر الحقيقة تعلم أن الكائنات لا تكون إلا لله وإن الحال لا أثر له فإن الحقيقة تأباه فإن السبب وإن كان ثابت العين وهو الحال فما هو ثابت الأثر فللحقيقة عين تشهد بها ما لا يشهد بعين الحال وتشهده عين الحال وعين العلم وللعلم عين يشهد بها ما لا يشهده بعين الحال وتشهد ما يشهده عين الحال فعين الحال أبدا تنقص عن درجة عين العلم وعين الحقيقة ولهذا لا تتصف الأحوال بالثبوت فإن العلم يزيلها والحقيقة تأباها ولذلك الأحوال لا تتصف بالوجود ولا بالعدم فهي صفات لموجود لا تتصف بالعدم ولا بالوجود فبالحال يقع التلبيس في العالم وبالعلم يرتفع التلبيس وكذلك بالحقيقة فهذا سر العلم وسر الحال وسر الحقيقة قد علمت الفرقان بينهم في الحكم هذا معنى السر عند الطائفة\n\n\nفإذا ثبت أمر في العالم كان ما كان وظهر حكمه فسره معناه إذا ظهر لمن ظهر له بطل عنده ذلك الثبوت الذي كان يحكم به قبل هذا على ذلك الأمر في كل أمر يكون له ثبوت في العالم وبهذه المثابة ثبوت الأسباب كلها في العالم فسر الربوبية إما المربوب وإما النسب أو الصفات التي من شأن من نسبت إليه أو قامت به عند من يرى أنها صفات أن يكون ربا فليس هو رب بالذات على هذا النحو هذا معنى قول سهل بن عبد الله للربوبية سر لو ظهر لبطلت الربوبية وكذاك قوله أيضا إن للربوبية سرا لو ظهر لبطل العلم وإن للعلم سرا لو ظهر لبطلت النبوة وإن للنبوة سرا لو ظهر لبطلت الأحكام فسر الحق لو ظهر لبطل الاختصاص والنبوة اختصاص فتبطل النبوة ببطلان الاختصاص ويبطل حكم العلم من حيث إنه صفة للذات حتى أعطاه حكم العالم وهو الحال فيبطل العلم لا يبطل العالم وسر النبوة إزالة رفيع الدرجات لأنه ما ثم على من والمعارج للأنبياء إنما هي في هذه الدرجات فسر النبوة الإخبار بما هو الأمر عليه وما هو الأمر عليه لا يقبل التبديل وإذا لم يقبل التبديل بطل الحكم فإن الحكم يثبت التخيير والتخيير يناقض التبديل فإذا بطل التخيير بطل الحكم فبطل معنى النبوة فهذا سرها فمن ظهر له أسرار هذه الأمور وعلمها علم الحق فيها ولم يبطل عنده شي‏ء فهو أقوى الأقوياء في التمكن الإلهي فهو عبد في مقام سيد وسيد في صورة عبد\n«بسم الله الرحمن الرحيم»\n\n",
    "en": "Chapter One Hundred and Ninety-Nine: Concerning The Secret (السر)\n\nThe Secret (السر) is the confirmation of the Levels (المراتب), so reflect,\nFor it is the proof of the permanence of The One (الواحد).\nThrough the Unique One (الفرد), our existence is validated in our essence (عيننا),\nWhether in the unseen (غائب) or in the witnessed (شاهد).\nIndeed, the indication by the Reality (الحقيقة) is veiled,\nAnd it is the proof of the non-existence of the Finder (الواجد).\nAnd the State (الحال) is sought by the desired one through his being\nWithin it, by a ruling that is not superfluous.\nAnd the brilliant scholar, if the attribute of knowledges (العلوم) resides in him,\nHis ruling is like that of the one who lacks.\n\n### [Indeed, The Secret has Three Levels]\n\nKnow that The Secret (السر) according to the Sufi community (الطائفة) is divided into three Levels (المراتب): the Secret of Knowledge (سر العلم), the Secret of the State (سر الحال), and the Secret of the Reality (سر الحقيقة).\n\nAs for the Secret of Knowledge and the Secret of the State, they constitute the reality (حقيقة) of those who possess Knowledge (العلماء) of Allah, not of any other Names (الأسماء).\n\nFor the Secret of Knowledge of Allah is the unification of opposites by ruling in the single essence (العين الواحدة), in that what is attributed to Him—such as that which has an opposite—is attributed to Him by that very opposite. This is a Secret known only by the one who finds it within himself and is characterized by it, so that he rules upon his own essence (عينه) with a ruling, and is also ruled upon by its opposite, based on the ruling of that opposite, not from another attribution or relation. For this reason, Allah made it the Secret of Knowledge, because all knowledge (العلم) is obtained through indication (دلالة), as it is derived from the sign (العلامة). Therefore, Knowledge of things is attributed to Allah because He knew Himself, and thus knew the cosmos (العالم). He is a proof and a sign (علامة) for the cosmos, just as the cosmos was a sign for Him in our knowledge of Him. And this is His saying, peace and blessings be upon him: \"Whoever knows himself knows his Lord.\"\n\nThus, He made you a proof for yourself regarding Him, so you knew Him, just as His Essence (ذاته) was a proof for Him regarding you, so He knew you and brought you into existence. This is part of the hidden Secret of Knowledge which is known only by those who possess Knowledge of Allah (العلماء بالله). If The Real (الحق) is the servant’s hearing, sight, and knowledge, you know Him through it, and you make Him a proof and a sign for Himself.\n\nThis is the Secret of the State (سر الحال). From this Secret was the breathing of Jesus (عليه السلام) into the form he created from clay, so that it became a bird. And by the Secret of Knowledge was the calling of the birds by Abraham (عليه السلام), so they came to him running. If the operative factor in His saying <<بِإِذْنِي>> (by My permission) is the act of breathing, then it is the Secret of the State. But if the operative factor is the command \"Be!\" (فيكون), then it is the Secret of Knowledge. This is known only by its possessor, who is Jesus (عليه السلام).\n\nThe Secret of Knowledge is more perfect (أتم) than the Secret of the State, because the Secret of Knowledge belongs to Allah, and it is that by which Abraham the Intimate Friend (الخليل) manifested. For he did no more than call them, and did not mention breathing, so it was like His saying: <<إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Indeed, Our word to a thing, when We intend it, is only that We say to it, \"Be,\" and it is). The Secret of the State is only from the characteristics of Creation (الخلق), not from the characteristics of The Real (الحق). Thus, the Secret of Knowledge is more perfect and its ruling is more comprehensive. The State is among the objects of knowledge and is under its encompassment. If the State were more perfect than Knowledge, The Real would have commanded His Prophet to seek the less perfect, and The Real would have abandoned describing Himself with the more perfect, which is impossible. Therefore, the honor belongs only to the Secret of Knowledge.\n\nAs for the Secret of the Reality (سر الحقيقة), it is that you know that Knowledge is not an attribute added to the Essence (ذات) of the Knower, and that He knows things by His Essence, not by something that is different from His Essence or added to His Essence. The Secret of the Reality dictates that the essence (العين) and the ruling (الحكم) are distinct. The Secret of the State causes confusion (يلبس), leading the speaker, by the Secret of the State, to say: \"I am Allah,\" and \"Glory be to me,\" and \"I am the one I love, and the one I love is I.\"\n\nThe Secret of Knowledge distinguishes between the Knowledge and the Knower. By the Secret of the Knower, you know that The Real is your hearing, your sight, your hand, and your foot, while acknowledging the efficacy and limitation of each of these, and that you are not His very essence. By the Secret of the State, your hearing penetrates every audible thing in the cosmos (الكون), since The Real is your hearing as a state (حالا), and likewise for all your other faculties. By the Secret of the Reality, you know that created things (الكائنات) exist only for Allah, and that the State has no effect, for the Reality rejects it. For even if the cause—which is the State—is fixed in essence (ثابت العين), it is not fixed in effect (ثابت الأثر).\n\nThe Reality has an essence by which it witnesses what the essence of the State does not witness, yet the essence of the State and the essence of Knowledge witness it. And Knowledge has an essence by which it witnesses what the essence of the State does not witness, and it witnesses what the essence of the State witnesses. Thus, the essence of the State is always deficient compared to the degree of the essence of Knowledge and the essence of the Reality. For this reason, the States are not characterized by permanence (الثبوت), for Knowledge removes them and the Reality rejects them. Therefore, the States are not characterized by existence (الوجود) nor by non-existence (العدم); they are attributes of an existent being, not characterized by non-existence nor by existence. Through the State, confusion occurs in the world; and through Knowledge, confusion is removed, and likewise through the Reality.\n\nThis is the Secret of Knowledge, the Secret of the State, and the Secret of the Reality. You have now learned the distinction (الفرقان) between them in terms of ruling. This is the meaning of The Secret according to the Sufi community.\n\nWhen a matter is established in the world, whatever it may be, and its ruling appears, its Secret means that when it is unveiled to the one to whom it is unveiled, the permanence that he previously ruled upon that matter is nullified for him, in every matter that has permanence in the world. The permanence of all causes (الأسباب) in the world is of this nature.\n\nThe Secret of Lordship (سر الربوبية) is either the object of Lordship (المربوب), or the relations, or the Attributes (الصفات) which, according to those who see them as attributes, are necessary for the one to whom they are attributed or in whom they subsist, in order for him to be a Lord. Thus, He is not a Lord by Essence (بالذات) in this manner. This is the meaning of the saying of Sahl ibn Abdullah: \"Lordship has a Secret; if it were revealed, Lordship would be nullified.\" Likewise, his saying: \"Lordship has a Secret; if it were revealed, Knowledge would be nullified. And Knowledge has a Secret; if it were revealed, Prophethood (النبوة) would be nullified. And Prophethood has a Secret; if it were revealed, the Rulings (الأحكام) would be nullified.\"\n\nIf the Secret of The Real (سر الحق) were revealed, distinction (الاختصاص) would be nullified, and Prophethood is a distinction, so Prophethood would be nullified by the nullification of distinction. And the ruling of Knowledge would be nullified, in that it is an Attribute of the Essence, until it grants it the ruling of the knower, which is the State, so Knowledge is nullified, but the Knower is not. The Secret of Prophethood is the removal of the high Degrees (الدرجات), because there is nothing above the one who ascends, and the ascensions for the Prophets are only within these Degrees. The Secret of Prophethood is the reporting of what the matter truly is, and what the matter truly is does not accept change (التبديل). If it does not accept change, the ruling is nullified, for the ruling establishes choice (التخيير), and choice contradicts change. So, if choice is nullified, the ruling is nullified, and thus the meaning of Prophethood is nullified. This is its Secret.\n\nWhoever has the secrets of these matters unveiled to him and knows them, knows The Real within them, and nothing is nullified for him. He is the strongest of the strong in Divine establishment (التمكن الإلهي). He is a servant in the station of a master, and a master in the form of a servant.\n\nIn the Name of God, the Most Compassionate, the Most Merciful.",
    "ur": "باب ایک سو ننانوے: راز (السر) کے بیان میں\n\nراز (السر) مراتب (المراتب) کو ثابت کرنا ہے، پس غور کر،\nیہی واحد (الواحد) کے ثبوت پر دلیل ہے۔\nفرد (الفرد) کے ذریعے ہی ہماری ہستی (الوجود) ہماری عین (العين) میں درست ہوئی،\nخواہ وہ غائب میں ہو یا شاہد میں۔\nبے شک حقیقت (الحقيقة) کے ساتھ اشارہ یتیم ہو گیا،\nاور یہی واجد (پانے والے) کے معدوم ہونے پر دلیل ہے۔\nاور حال (الحال) کو مراد طلب کرتا ہے، اس کے اس میں ہونے کے سبب،\nایسے حکم (الحکم) کے ساتھ جو زائد نہ ہو۔\nاور اگر ماہر عالم (العالم النحرير) کے ساتھ\nعلوم کی صفت قائم ہو جائے، تو اس کا حکم (الحکم) فاقد (معدوم) کی مانند ہے۔\n\n[بے شک راز (السر) کے تین مراتب ہیں]\n\nجان لو کہ طائفہ (الطائفة) کے نزدیک راز (السر) کے تین مراتب ہیں: سرِ علم، سرِ حال (الحال)، اور سرِ حقیقت (الحقيقة)۔\n\nجہاں تک سرِ علم اور سرِ حال (الحال) کا تعلق ہے،\nتو یہ اللہ کے ساتھ علماء کی حقیقت (الحقيقة) ہے، نہ کہ کسی اور اسماء (الأسماء) کے ساتھ۔ کیونکہ اللہ کے ساتھ سرِ علم یہ ہے کہ ایک ہی عین (العين) میں حکم (الحکم) کے ذریعے اضداد کو جمع کیا جائے، اس لحاظ سے کہ وہ اس کی طرف منسوب ہے، اسی طرح اس کا ضد بھی بعینہٖ اس کی طرف منسوب ہو۔ یہ ایسا راز ہے جسے صرف وہی جانتا ہے جس نے اسے اپنے نفس میں پایا اور اس سے متصف ہوا، پھر اس نے اپنی عین (العين) پر ایک ایسا حکم لگایا جس پر اس کے ضد کا حکم بھی لگایا گیا، مگر کسی دوسری نسبت یا اضافے سے نہیں، بلکہ اس کے ضد کے حکم کے لحاظ سے۔ اسی لیے اللہ نے اسے سرِ علم بنایا، کیونکہ ہر علم جو کسی دلالت سے حاصل ہوتا ہے، وہ علم ہے، کیونکہ یہ علامت (العلامة) سے مشتق ہے۔ اسی لیے علم کو اشیاء کے ساتھ اللہ کی طرف منسوب کیا گیا، کیونکہ اس نے اپنے آپ کو جانا، پس اس نے عالم (العالم) کو جانا۔ پس وہ عالم پر دلیل اور علامت ہے، جیسا کہ عالم ہمارے علم میں اس (اللہ) پر علامت تھا۔ اور یہی آپ صلی اللہ علیہ وسلم کا قول ہے:\n\"من عرف نفسه عرف ربه\" (جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا)۔\nپس اس نے تجھے اس پر دلیل بنایا، تو تُو نے اسے جانا، جیسا کہ اس کی ذات تیرے لیے اس پر دلیل تھی، تو اس نے تجھے جانا اور تجھے موجود کیا۔ یہ سرِ علم (سر العلم) کے پوشیدہ ترین پہلوؤں میں سے ہے جسے صرف اللہ والے علماء ہی جانتے ہیں۔ پس جب حق (الحق) بندے کی سماعت، بصارت اور علم ہو جاتا ہے، تو تُو اسے اس کے ذریعے جانتا ہے اور اسے اپنے نفس پر دلیل اور علامت بناتا ہے۔ اور یہی سرِ حال (سر الحال) ہے۔ اسی سے عیسیٰ علیہ السلام نے اس صورت میں پھونکا جسے انہوں نے مٹی سے بنایا تھا، تو وہ پرندہ بن گئی۔ اور سرِ علم (سر العلم) کے ذریعے ابراہیم علیہ السلام نے پرندوں کو بلایا تو وہ دوڑتے ہوئے ان کے پاس آئے۔ پس اگر قول *بِإِذْنِي* (میرے حکم سے) میں عامل (فعل کرنے والا) 'تنفخ' (تو پھونکتا ہے) ہے، تو یہ سرِ حال (سر الحال) ہے، اور اگر عامل 'فیکون' (تو ہو جاتا ہے) ہے، تو یہ سرِ علم (سر العلم) ہے۔ اور یہ بات اس کے صاحب یعنی عیسیٰ علیہ السلام کے سوا کوئی نہیں جانتا۔ اور سرِ علم (سر العلم) سرِ حال (سر الحال) سے زیادہ کامل ہے، کیونکہ سرِ علم اللہ کے لیے ہے، اور یہی وہ ہے جس کے ذریعے ابراہیم خلیل علیہ السلام ظاہر ہوئے۔ کیونکہ انہوں نے صرف انہیں بلایا اور پھونکنے کا ذکر نہیں کیا، تو یہ اس کے قول کی مانند تھا:\nإِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ (ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے کہ ہم اسے کہیں 'ہو جا'، تو وہ ہو جاتی ہے)۔\nاور سرِ حال (سر الحال) صرف مخلوق کی صفات میں سے ہوتا ہے، نہ کہ ذات حق (الحق) کی صفات میں سے۔ پس سرِ علم (سر العلم) زیادہ کامل ہے اور اس کا حکم (الحکم) زیادہ عام ہے۔ پس حال (الحال) علم کی معلومات کے مجموعے میں سے ہے اور اس کے احاطے کے تحت ہے۔ اور اگر حال علم سے زیادہ کامل ہوتا، تو حق (الحق) نے اپنے نبی کو ناقص چیز طلب کرنے کا حکم دیا ہوتا، اور حق نے اپنی ذات کو کامل صفت سے موصوف کرنا چھوڑ دیا ہوتا، اور یہ محال ہے۔ پس شرف صرف سرِ علم (سر العلم) کے لیے ہے۔\n\nاور جہاں تک سرِ حقیقت (سر الحقيقة) کا تعلق ہے،\n\nتو وہ یہ ہے کہ تُو یہ جان لے کہ علم عالم (جاننے والے) کی ذات پر کوئی زائد امر نہیں ہے، اور وہ اشیاء کو اپنی ذات کے ذریعے جانتا ہے، نہ کہ کسی ایسی چیز کے ذریعے جو اس کی ذات سے مغائر ہو یا اس کی ذات پر زائد ہو۔ پس سرِ حقیقت (سر الحقيقة) یہ بتاتا ہے کہ عین (العين) اور حکم (الحکم) مختلف ہیں۔ اور سرِ حال (سر الحال) التباس پیدا کرتا ہے، چنانچہ سرِ حال والا کہنے لگتا ہے: \"میں اللہ ہوں\"، اور \"سبحانی\" (میں پاک ہوں)، اور \"میں وہ ہوں جسے میں چاہتا ہوں اور جسے میں چاہتا ہوں وہ میں ہوں\"۔\n\nاور سرِ علم (سر العلم) علم اور عالم میں فرق کرتا ہے۔ پس سرِ علم کے ذریعے تُو جانتا ہے کہ حق (الحق) تیری سماعت، تیری بصارت، تیرا ہاتھ اور تیرا پاؤں ہے، اس کے باوجود کہ ان میں سے ہر ایک کی نفوذیت اور قصور اپنی جگہ پر ہے، اور یہ کہ تُو بعینہٖ وہ نہیں ہے۔ اور سرِ حال (سر الحال) کے ذریعے تیری سماعت کائنات میں ہر مسموع میں نفوذ کر جاتی ہے، جب حق تیری سماعت حال (حالاً) ہو جائے۔ اور اسی طرح تیری باقی تمام قوتیں بھی۔ اور سرِ حقیقت (سر الحقيقة) کے ذریعے تُو جانتا ہے کہ کائنات صرف اللہ کے لیے ہیں اور حال (الحال) کا کوئی اثر نہیں ہے، کیونکہ حقیقت (الحقيقة) اسے رد کرتی ہے۔ اگرچہ سبب (جو کہ حال ہے) ثابت العین ہے، لیکن وہ ثابت الاثر نہیں ہے۔ پس حقیقت (الحقيقة) کی ایک عین (العين) ہے جس کے ذریعے وہ اس چیز کا مشاہدہ کرتی ہے جس کا مشاہدہ عینِ حال (عين الحال) نہیں کرتی، اور عینِ حال اور عینِ علم (عين العلم) اس کا مشاہدہ کرتی ہیں۔ اور علم کی ایک عین ہے جس کے ذریعے وہ اس چیز کا مشاہدہ کرتا ہے جس کا مشاہدہ عینِ حال نہیں کرتی، اور وہ اس کا مشاہدہ کرتی ہے جس کا مشاہدہ عینِ حال کرتی ہے۔ پس عینِ حال ہمیشہ عینِ علم اور عینِ حقیقت کے درجے سے کم رہتی ہے۔ اسی لیے احوال (الأحوال) ثبوت (ثابت ہونے) کی صفت سے متصف نہیں ہوتے، کیونکہ علم انہیں زائل کر دیتا ہے اور حقیقت انہیں رد کرتی ہے۔ اسی لیے احوال نہ تو وجود (الوجود) کی صفت سے متصف ہوتے ہیں اور نہ ہی عدم (العدم) کی صفت سے۔ وہ موجود کی صفات ہیں جو نہ عدم سے متصف ہوتی ہیں اور نہ وجود سے۔ پس حال (الحال) کے ذریعے عالم میں التباس واقع ہوتا ہے، اور علم کے ذریعے التباس دور ہوتا ہے، اور اسی طرح حقیقت کے ذریعے۔ پس یہ سرِ علم، سرِ حال، اور سرِ حقیقت ہیں، اور تُو نے حکم (الحکم) میں ان کے درمیان فرق کو جان لیا۔ طائفہ (الطائفة) کے نزدیک راز (السر) کا یہی مفہوم ہے۔\n\nپس جب عالم میں کوئی امر ثابت ہو جاتا ہے، جو کچھ بھی وہ ہو، اور اس کا حکم (الحکم) ظاہر ہو جاتا ہے، تو اس کا راز (السر) یہ ہے کہ جب وہ راز اس شخص پر ظاہر ہو جاتا ہے جس پر وہ ظاہر ہوا، تو اس کے نزدیک وہ ثبوت باطل ہو جاتا ہے جس کا حکم وہ اس سے پہلے اس امر پر لگایا کرتا تھا۔ یہ ہر اس امر میں ہوتا ہے جسے عالم میں ثبوت حاصل ہو۔ اور اسی مقام پر عالم میں تمام اسباب کا ثبوت ہے۔ پس ربوبیت (الربوبية) کا راز یا تو مربوب (جس پر ربوبیت کی جائے) ہے، یا وہ نسبتیں یا صفات ہیں جن کا تقاضا ہے کہ جس کی طرف وہ منسوب ہوں یا جس کے ساتھ وہ قائم ہوں (اس شخص کے نزدیک جو انہیں صفات سمجھتا ہے) وہ رب ہو۔ پس وہ اس انداز پر ذات (الذات) کے اعتبار سے رب نہیں ہے۔ یہ سہل بن عبداللہ کے اس قول کا مفہوم ہے کہ \"ربوبیت (الربوبية) کا ایک راز ہے، اگر وہ ظاہر ہو جائے تو ربوبیت باطل ہو جائے گی۔\" اور اسی طرح ان کا یہ قول بھی ہے کہ \"بے شک ربوبیت کا ایک راز ہے، اگر وہ ظاہر ہو جائے تو علم (العلم) باطل ہو جائے گا۔ اور بے شک علم کا ایک راز ہے، اگر وہ ظاہر ہو جائے تو نبوت (النبوة) باطل ہو جائے گی۔ اور بے شک نبوت کا ایک راز ہے، اگر وہ ظاہر ہو جائے تو احکام (الأحكام) باطل ہو جائیں گے۔\" پس اگر حق (الحق) کا راز ظاہر ہو جائے تو اختصاص (الاحتصاص) باطل ہو جائے گا، اور نبوت اختصاص ہے، پس اختصاص کے باطل ہونے سے نبوت باطل ہو جائے گی۔ اور علم کا حکم (الحکم) اس لحاظ سے باطل ہو جائے گا کہ وہ ذات (الذات) کی صفت ہے، یہاں تک کہ اس نے اسے عالم (العالم) کا حکم دیا، جو کہ حال (الحال) ہے، تو علم باطل ہو جائے گا، عالم باطل نہیں ہو گا۔ اور نبوت (النبوة) کا راز بلند درجات کو زائل کرنا ہے، کیونکہ وہاں کوئی 'اس سے اوپر' نہیں ہے، اور انبیاء کے معارج (بلندیاں) صرف انہی درجات میں ہیں۔ پس نبوت کا راز اس امر کی خبر دینا ہے جس پر وہ امر قائم ہے، اور جس پر امر قائم ہے وہ تبدیلی قبول نہیں کرتا۔ اور جب وہ تبدیلی قبول نہیں کرتا تو حکم (الحکم) باطل ہو جاتا ہے، کیونکہ حکم اختیار (التخییر) کو ثابت کرتا ہے، اور اختیار تبدیلی کے منافی ہے۔ پس جب اختیار باطل ہو گیا تو حکم باطل ہو گیا، تو نبوت کا مفہوم باطل ہو گیا۔ پس یہ اس کا راز ہے۔ پس جس پر ان امور کے اسرار ظاہر ہو گئے اور اس نے انہیں جان لیا، اس نے ان میں حق (الحق) کو جان لیا اور اس کے نزدیک کوئی چیز باطل نہیں ہوئی، تو وہ تمکنِ الٰہی میں سب سے زیادہ قوی ہے۔ پس وہ ایک آقا کے مقام میں بندہ ہے اور ایک بندے کی صورت میں آقا ہے۔\n\nشروع اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے۔",
    "fa": "باب صد و نود و نهم در سر (راز)\n\nسر، تثبیت مراتب است، پس بیندیش؛ *** زیرا آن دلیل بر ثبوت واحد است.\nبه واسطه فرد (یگانه)، هستی (الوجود) ما در ذات ما صحیح گشت؛ *** چه در غایب باشد و چه در شاهد (حاضر).\nهمانا اشاره به حقیقت (الحقیقة)، یتیم گشت؛ *** و آن دلیل بر انتفای واجد (یابنده) است.\nو حال (الحال) را مراد (مقصود) به واسطه بودن خود در آن می‌طلبد، *** به حکمی که زائد نباشد.\nو عالم ماهر (نحریر)، اگر صفت علوم در او قائم شود، *** حکمش مانند کسی است که فاقد آن است.\n\n### [همانا سر (راز) سه مرتبه دارد]\n\nبدان که سر (راز) نزد طایفه (صوفیه) بر سه مرتبه است: سر العلم (سر دانش)، سر الحال (سر حال) و سر الحقیقة (سر حقیقت).\n\nاما سر العلم (سر دانش) و سر الحال (سر حال)، حقیقت عالمان به حق (الحق) است، نه به غیر او از اسماء. زیرا سر العلم (سر دانش) به حق (الحق)، جمع اضداد (ضدها) به واسطه حکم در عین (ذات) واحد است؛ از آن جهت که چیزی به او منسوب است، و همچنین ضد آن چیز نیز به همان عین (ذات) منسوب می‌شود. این سری است که جز کسی که آن را در نفس خود یافته و بدان متصف شده، نمی‌داند؛ پس بر عین خود به حکمی حکم می‌کند که به ضد آن نیز حکم شده است، از حیث حکم ضدش، نه از نسبت یا اضافه‌ای دیگر. و به همین دلیل، خداوند آن را سر العلم (سر دانش) قرار داد؛ زیرا هر علمی از دلالت حاصل می‌شود، چون از «علامت» مشتق شده است. و از این رو، علم به اشیاء به حق (الحق) اضافه شد، زیرا او نفس خود را دانست و عالم را دانست. پس او دلیل و علامتی بر عالم است، همان‌گونه که عالم در علم ما به او، علامتی بر او بود. و این همان قول پیامبر (صلی الله علیه و سلم) است: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت).\n\nپس تو را دلیلی برای خود بر او قرار داد، و تو او را شناختی؛ همان‌گونه که ذات او دلیلی بر تو برای او بود، پس تو را شناخت و هستی بخشید. این از رازهای پنهان سر العلم (سر دانش) است که جز عالمان به حق (الحق) آن را نمی‌دانند. پس هنگامی که حق (الحق) شنوایی بنده و بینایی و علم او باشد، تو او را به واسطه آن شناختی و او را دلیل و علامتی بر نفس خود قرار دادی. و این همان سر الحال (سر حال) است. و از همین سر بود که عیسی (علیه السلام) در صورتی که از گِل ساخته بود دمید و آن پرنده شد. و به واسطه سر العلم (سر دانش) بود که ابراهیم (علیه السلام) پرندگان را فراخواند و آن‌ها شتابان نزد او آمدند. پس اگر در قول او [خداوند به عیسی] «بِإِذْنِي» (به اذن من)، عامل (فعل مؤثر) «تنفخ» (می‌دمی) باشد، آن سر الحال (سر حال) است؛ و اگر عامل «فیکون» (پس می‌شود) باشد، آن سر العلم (سر دانش) است. و این را جز صاحبش، یعنی عیسی (علیه السلام)، نمی‌داند. و سر العلم (سر دانش) کامل‌تر از سر الحال (سر حال) است؛ زیرا سر العلم (سر دانش) از آنِ حق (الحق) است و همان است که ابراهیم خلیل (علیه السلام) به واسطه آن ظاهر شد؛ زیرا او جز فراخواندن پرندگان کاری نکرد و دَمیدنی ذکر نشد. پس مانند قول حق (الحق) بود: «إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ» (همانا سخن ما برای چیزی، هنگامی که اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود). و سر الحال (سر حال) جز از نُعوت (صفات) خلق نیست، نه از نُعوت حق (الحق). پس سر العلم (سر دانش) کامل‌تر و حکمش فراگیرتر است. حال (الحال) از جمله معلومات علم است و تحت احاطه آن قرار دارد. اگر حال (الحال) کامل‌تر از علم بود، حق (الحق) پیامبرش را به طلب ناقص‌تر امر می‌کرد و حق (الحق) وصف خود را به کامل‌تر ترک می‌نمود، و این محال است. پس شرف جز برای سر العلم (سر دانش) نیست.\n\nو اما سر الحقیقة (سر حقیقت)، آن است که بدانی علم امری زائد بر ذات عالم نیست، و او اشیاء را به ذات خود می‌داند، نه به چیزی که مغایر ذات او یا زائد بر ذات او باشد. پس سر الحقیقة (سر حقیقت) این را می‌رساند که عین (ذات) و حکم متفاوت است. و سر الحال (سر حال) موجب التباس می‌شود، پس گوینده به سر الحال (سر حال) می‌گوید: «أنا الله» (من خدا هستم) و «سبحانی» (پاک و منزه هستم) و «أنا من أهوى ومن أهوى أنا» (من کسی هستم که دوست می‌دارم و کسی که دوست می‌دارم من هستم).\n\nو سر العلم (سر دانش) میان علم و عالم فرق می‌گذارد. پس به واسطه سر عالم می‌دانی که حق (الحق) شنوایی تو، بینایی تو، دست تو و پای تو است، با وجود نفوذ و قصور هر یک از این‌ها، و اینکه تو عین او نیستی. و به واسطه سر الحال (سر حال)، شنوایی تو در هر شنیدنی در هستی (الکون) نفوذ می‌کند، هنگامی که حق (الحق) حالاً شنوایی تو باشد؛ و همچنین سایر قوای تو. و به واسطه سر الحقیقة (سر حقیقت) می‌دانی که کائنات جز برای حق (الحق) نیستند و حال (الحال) اثری ندارد، زیرا حقیقت آن را نمی‌پذیرد. اگرچه سبب، که همان حال (الحال) است، ثابت العین باشد، اما ثابت الأثر نیست. پس حقیقت، چشمی (عینی) دارد که با آن چیزی را شهود می‌کند که با چشم حال (الحال) شهود نمی‌شود، در حالی که چشم حال (الحال) و چشم علم آن را شهود می‌کنند. و علم، چشمی (عینی) دارد که با آن چیزی را شهود می‌کند که با چشم حال (الحال) شهود نمی‌شود، و آنچه را که چشم حال (الحال) شهود می‌کند، شهود می‌نماید. پس چشم حال (الحال) همیشه از درجه چشم علم و چشم حقیقت پایین‌تر است. و به همین دلیل، احوال (الأحوال) به ثبوت متصف نمی‌شوند، زیرا علم آن‌ها را زایل می‌کند و حقیقت آن‌ها را نمی‌پذیرد. از این رو، احوال (الأحوال) نه به هستی (الوجود) متصف می‌شوند و نه به نیستی (العدم)؛ بلکه آن‌ها صفاتی برای موجودی هستند که نه به نیستی و نه به هستی متصف می‌شوند. پس به واسطه حال (الحال) در عالم التباس (اشتباه) رخ می‌دهد، و به واسطه علم و همچنین به واسطه حقیقت، التباس برطرف می‌شود. این سر العلم (سر دانش)، سر الحال (سر حال) و سر الحقیقة (سر حقیقت) است؛ اکنون تفاوت حکم میان آن‌ها را دانستی. این معنای سر (راز) نزد طایفه (صوفیه) است.\n\nپس هنگامی که امری در عالم ثابت شود، آنچه که بود، واقع می‌شود و حکمش ظاهر می‌گردد. معنای سر (راز) آن این است که اگر برای کسی که بر او ظاهر شده، آشکار گردد، آن ثبوتی که پیش از این بر آن امر حکم می‌کرد، نزد او باطل می‌شود؛ و این در مورد هر امری است که در عالم ثبوت دارد. و ثبوت همه اسباب در عالم نیز به همین منزله است. پس سر الربوبیة (راز پروردگاری) یا مربوط به مربوب (پرورده) است، یا مربوط به نسبت‌ها، یا صفاتی که شأن کسی است که صفات به او نسبت داده شده یا در او قائم گشته‌اند، نزد کسی که آن‌ها را صفات می‌بیند، تا پروردگار باشد. پس او به ذات خود بر این نحو پروردگار نیست. این معنای قول سهل بن عبدالله است که: «برای ربوبیت (پروردگاری) سری است که اگر ظاهر شود، ربوبیت باطل می‌گردد.» و همچنین قول او: «همانا برای ربوبیت سری است که اگر ظاهر شود، علم باطل می‌گردد. و همانا برای علم سری است که اگر ظاهر شود، نبوت باطل می‌گردد. و همانا برای نبوت سری است که اگر ظاهر شود، احکام باطل می‌گردند.» پس اگر سر الحق (راز حق) ظاهر شود، اختصاص باطل می‌گردد، و نبوت اختصاص است. پس نبوت با بطلان اختصاص باطل می‌شود. و حکم علم از آن جهت که صفتی برای ذات است، باطل می‌گردد، تا جایی که حکم عالم، که همان حال (الحال) است، به آن داده شود؛ پس علم باطل می‌شود، نه عالم. و سر النبوة (راز نبوت)، از بین بردن درجات رفیع است، زیرا در آنجا [در مقام نبوت] برتری بر کسی نیست. و معراج‌های انبیاء تنها در این درجات است. پس سر النبوة (راز نبوت)، خبر دادن از آنچه امر بر آن است، می‌باشد. و آنچه امر بر آن است، تبدّل (تغییر) نمی‌پذیرد. و چون تبدّل نپذیرد، حکم باطل می‌شود؛ زیرا حکم، اختیار (تخییر) را ثابت می‌کند و اختیار با تبدّل در تناقض است. پس اگر اختیار باطل شود، حکم باطل می‌شود و معنای نبوت باطل می‌گردد. این راز آن است. پس کسی که اسرار این امور بر او ظاهر شود و آن‌ها را بداند، حق (الحق) را در آن‌ها می‌داند و چیزی نزد او باطل نمی‌شود. او قوی‌ترینِ قوی‌ها در تمکن الهی است؛ پس او بنده‌ای است در مقام سَرور و سَروری است در صورت بنده."
  },
  "page_count": 3
}