{
  "id": 469,
  "title": {
    "ar": "الباب التاسع والستون وأربعمائة في حال قطب كان منزله وأُفَوِّضُ أَمْرِي إِلَى الله",
    "en": "Chapter Four Hundred and Sixty-Nine: Concerning the State of a Pole (Qutb) Whose Station Was [the Realization of] \"And I entrust my affair to Allah\" (وأُفَوِّضُ أَمْرِي إِلَى الله)",
    "ur": "باب چار سو انہتر: اس قطب کے حال کے بیان میں جس کی منزل یہ ہے: \"اور میں اپنا معاملہ اللہ کے سپرد کرتا ہوں\" (وَأُفَوِّضُ أَمْرِي إِلَى الله)۔",
    "fa": "باب چهارصد و شصت و نهم در بیان حال قطبی که منزل او «و أُفَوِّضُ أَمْرِي إِلَى الله» (و کار خود را به خدا واگذار می‌کنم) بود."
  },
  "content": {
    "ar": "## «الباب التاسع والستون وأربعمائة في حال قطب كان منزله وأُفَوِّضُ أَمْرِي إِلَى الله»\n\n\n> إن الوجود منطق ومنطق *** ومصدق ومصدق فتفكروا\n\n\n> فالشي‏ء يكذب نفسه فمكذب *** ومكذب والعين لا تتكثر\n\n\n> فلأي شي‏ء يرجع الأمر الذي *** قد قلته في أمرنا فتبصروا\n\n\n> حتى تروه بالعيان ففوضوا *** أمر الوجود إليه لا تتحيروا\n\n\n### [ليس في وسع المخلوق أن يحمله يحمله الله‏]\n\n\nقال الله عز وجل لنبيه صَلَّى اللهُ عَليهِ وسَلَّم أن يقول لقومه حين ردوا دعوته فَسَتَذْكُرُونَ ما أَقُولُ لَكُمْ وأُفَوِّضُ أَمْرِي إِلَى الله وهو من فاض ولا يفيض حتى يمتلئ فالفيض زيادة على ما يحمله المحل وذلك أن المحل لا يحمل إلا ما في وسعه أن يحمله وهو القدر والوجه الذي يحمله المخلوق وما فاض من ذلك وهو الوجه الذي ليس في وسع المخلوق أن يحمله يحمله الله فما من أمر إلا وفيه للخلق نصيب ولله نصيب فنصيب الله أظهره التفويض فينزل الأمر جملة واحدة وعينا واحدة إلى الخلق فيقبل كل خلق منه بقدر وسعه وما زاد على ذلك وفاض انقسم الخلق فيه على قسمين فمنهم من جعل الفائض من ذلك إلى الله تعالى فقال وأُفَوِّضُ أَمْرِي إِلَى الله وينسب ذلك الأمر إلى نفسه لأنه لما جاءه ما تخيل أنه يفضل عنه وتخيل أنه يقبله كله فلما لم يسعه بذاته رده إلى ربه ومنهم من لم يعرف ذلك فرجع الفائض إلى الله من غير علم من هذا الذي حصل منه ما حصل فهو إلى الله على كل وجه وما بقي الفضل إلا فيمن يعلم ذلك فيفوض أمره إلى الله فيكون له بذلك عند الله يد ومنهم من لا يعلم ذلك فليس له عند الله بذلك منزلة ولا حق بتوجه قال تعالى قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ‏\n\n\n### [فإن العبد محل لظهور أثر كل اسم إلهي الذي قابل أن تحمله‏]\n\n\nواعلم أن العبد القابل أمر الله لا يقبله إلا باسم خاص إلهي وأن ذلك الاسم لا يتعدى حقيقته فهذا العبد ما قبل الأمر إلا بالله من حيث ذلك الاسم فما عجز العبد ولا ضاق عن حمله فإنه محل لظهور أثر كل اسم إلهي فعن الاسم الإلهي فاض لا عن العبد فلما فوضه بقوله وأُفَوِّضُ أَمْرِي إِلَى الله‏\nما عين اسما بعينه وإنما فوضه إلى الاسم الجامع فيتلقاه منه ما يناسب ذلك الأمر من الأسماء في خلق آخر فإنه ما لا يحمله زيد وضاق عنه لكون الاسم الإلهي الذي قبله به ما أعطت حقيقته إلا ما قبل منه وقد يحمله عمر ولأنه أوسع من زيد بل لا أنه أوسع من زيد ولكن عمرو في حكم اسم أيضا إلهي قد يكون أوسع إحاطة من الاسم الإلهي الذي كان عند زيد فإن الأسماء الإلهية تتفاضل في العموم والإحاطات فيحيط العالم ويحيط العليم فيكون إحاطة العليم أكثر من إحاطة العالم وإحاطة الخبير أكثر من إحاطة غيره وكذلك الاسم المريد مع العالم والاسم القادر مع المريد ومع العالم تقل إحاطته عنهما والعبد لا بد أن يكون تحت حكم اسم إلهي فهو بحسب ذلك الاسم وما تعطيه حقيقته من القبول فيرد ما فضل عنه إليه تعالى وذلك التفويض لمن عقل عن الله قوله فإن اللسان الذي خاطبنا به الحق اقتضى ذلك فنحن معه بقوله لأنه ليس في وسع المخلوق أن يحكم على الخالق إلا من يكون شهوده ما هي الممكنات عليه في حال عدمها فيرى أنها أعطت العلم للعالم بنفسها فقد يشم من ذلك رائحة من الحكم لكن افتقارها من حيث إمكانها يغلب عليها ولهذا ترى النافين للإمكان بالدلالة العقلية يغفلون في أكثر الحالات عما أعطاهم الدليل من نفي الإمكان في نفس الأمر فيقولون بالإمكان حتى يراجعوا وينبهوا فيتذكروا ذلك فلا بد من أمر يكون له سلطنة في هذا العبد حتى يتصف بالغفلة والذهول عما اقتضاه دليله وليس إلا الأمر الطبيعي والمزاج أ لا تراه إذا انتقل بالموت الأكبر أو بالموت الأصغر إلى البرزخ كيف يرى في الموت الأصغر أمورا كان يحيلها عقلا في حال اليقظة وهي له في البرزخ محسوسة كما هي له في حال اليقظة ما يتعلق به حسه فلا ينكره فيما كان يدل عليه عقله من إحالة وجود أمر ما يراه موجودا في البرزخ ولا شك أنه أمر وجودي تعلق الحس به في البرزخ فاختلف الموطن على الحس فاختلف الحكم فلو كان ذلك محالا لنفسه في قبول الوجود لما اتصف بالوجود في البرزخ ولما كان مدركا بالحس في البرزخ بل قد يتحقق بذلك أهل الله حتى يدركوا ذلك في حال يقظتهم ولكن في البرزخ فهم في حال يقظتهم كحال النائم والميت في حال نومه وموته فإن تفطنت فقد رميت بك على طريق العلم بقصور النظر العقلي وإنه ما أحاط بمراتب الموجودات ولا علم الوجود كيف هو إذ لو كان كما حكم به العقل ما ظهر له وجود في مرتبة من المراتب وقد ظهر فليس لعاقل ثقة بما دله عليه عقله في كل شي‏ء فإذا كان صحيح الدلالة سرى ذلك في كل صورة فيعلم في كل صورة يراها في البرزخ وتحصل في نفسه أنه الله فهو الله فما يختلف كونه وإن اختلفت صور تجليه وكذلك عند العارفين به هنا ما يختل عليهم شي‏ء من ذلك ولا في البرزخ ولا في القيامة الكبرى فيشهدون ربهم في كل صورة من أدنى وأعلى وكما هم اليوم كذلك يكونون غدا وأما أبو يزيد فخرج عن مقام التفويض فعلمنا أنه كان تحت حكم الاسم الواسع فما فاض عنه شي‏ء وذلك أنه تحقق‏\n\n\nبقوله ووسعني قلب عبدي‏\n\n\nفلما وسع قلبه الحق والأمور منه تخرج التي يقع فيها التفويض ممن وقع فهو كالبحر وسائر القلوب كالجداول وقال في هذا المقام لو أن العرش يريد به ما سوى الله وما حواه مائة ألف ألف مرة يريد الكثرة بل يريد ما لا يتناهى في زاوية من زوايا قلب العارف ما أحس به يعني لاتساعه حيث وسع الحق ومن هنا قلنا إن قلب العارف أوسع من رحمة الله لأن رحمة الله لا تنال الله ولا تسعه وقلب العبد قد وسعه إلا إن في الأمر نكتة أومئ إليها ولا أنص عليها وذلك أن الله قد وصف نفسه بالغضب والبطش الشديد بالمغضوب عليه والبطش رحمة لما فيه من التنفيس وإزالة الغضب وهذا القدر من الإيماء كاف فيما نريد بيانه من ذلك فإن الرسل تقول ولن يغضب بعده مثله فالانتقام رحمة وشفاء ولو لا كونه رحمة ما وقع في الوجود وقد وقع ولكن ينبغي لك أن تعلم بمن هو وقوع الانتقام رحمة فبان لك من هنا رتبة أبي يزيد من غيره من العارفين لأنه وأمثاله لا يتكلمون إلا عن أحوالهم وذوقهم فيها ومن أسمائه تعالى الواسع كما ورد فباتساعه قبل الغضب فلو ضاق عنه ما ظهر للغضب حكم في الوجود لأنه لم يكن له حقيقة إلهية يستند إليها في وجوده وقد وجد فلا بد أن ينسب الغضب إلى الله كما يليق بجلاله وقد وسع القلب الحق ومن صفاته الغضب فقد وسع الغضب فلا ينكر على العارف مع كونه ما يرى إلا الله أن يغضب ويرضى ويتصف بأنه يؤذي وإن لم يتأذ فما أذى من لا يتأذى غير أنه لا يقال ذلك في الجناب الإلهي إلا أنه تسمى بالصبور وأعلمنا بالصبر ما هو وعلى ما ذا يكون ولا نقول هو في حق الحق حلم فإن الحليم‏\nكما ورد كذلك ورد الصبور ولكل وارد معنى ما هو عين الآخر فتتغير الأحوال على العارفين تغير الصور على الحق ولو لا ذلك ما تغيرت الأحكام في العالم لأنها من الله تظهر في العالم وهو موجدها وخالقها فلا بد من قيام الصفة به وحينئذ يصح وجودها منه كان الموجد اسم فاعل ما كان وكان الموجد اسم مفعول ما كان فإن لم تعلم التفويض كما ذكرته لك وإلا وقعت في إشكال لا ننحل منه أعني في العلم بالتفويض ما هو فهذا نسبته إلى المخلوق وأما التفويض الإلهي وهو أن يكون هو المفوض أمره إلى عباده فيه فإنه كلفهم وأمرهم ونهاهم فهذا تفويض أمره إلى عباده فإنه فاض عما يجب للحق لأن التكليف لا يصح في حق الحق فلما فاض عنه لم يكن إفاضته إلا على الخلق وأراد منهم أن يقوموا به حين رده إليهم كما يقوم الحق به إذا فوض العبد أمره إلى الله فمنهم من تخلق بأخلاق الله فقبل أمره ونهيه وهو المعصوم والمحفوظ ومنهم من رده ومنهم من قبله في وقت وفي حال ورده في وقت وفي حال وكذلك فوض إليهم أمره في القول فيه فاختلفت مقالاتهم في الله ثم أبان لهم على ألسنة رسله ما هو عليه في نفسه لتقوم له الحجة على من خالف قوله فقال في الله ما يقابل ما قاله عن نفسه فلما اختلفت المقالات تجلى لأهل كل مقالة بحسب أو بصورة مقالته وسبب ذلك تفويضه أمره إليهم وإعطاؤه إياهم عقولا وأفكارا يتفكرون بها وأعطى لكل موف حقه في الاجتهاد بنظره نصيبا من الأجر أخطأ في اجتهاده أو أصاب فإنه ما أخطأ إلا المقالة الواردة في الله بلسان الشرع خاصة فحاد عنها بتأويل فيها أداه إليه نظره وورد شرع أيضا يؤيده في ذلك فما ترك المقالة من حيث عليها وإنما استند فيما ذهب إليه لأمر مشروع ودليل عقل وكونه أصاب أو أخطأ ذلك أمر آخر زائد على كونه اجتهد فإنه ما يطلب باجتهاده إلا الدليل الذي يغلب على ظنه أنه يوصله إلى الحق والإصابة لا غير\n\n\n> فتكليفه عين تفويضه *** فنحن وإياه فيه سوا\n\n\n> فتسبيحنا عين تسبيحه *** وتسبيحه بلسان السوي‏\n\n\n> وكل امرئ إنما حظه *** من الذكر لله ما قد نوى‏\n\n\nفتفويضه في قوله وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ وتفويضنا إذ أمرنا أن نتخذه وكيلا فيما استخلفنا فيه فَرَدَدْناهُ إِلى‏ أُمِّهِ كَيْ تَقَرَّ عَيْنُها ولما كان العالم تحت حكم الأسماء الإلهية وهي أسماؤه فما تلقى تفويضه إلا هو لا نحن فإنه بأسمائه تلقيناه فهو الباطن من حيث تفويضه وهو الظاهر من حيث قبوله فكان الأمر بيننا كما تنزل الأمر بين السماء وهو العلى وبين الأرض وهي الذلول‏\n\n\n> فهكذا الأمر فلا تخفه *** فإنه أوضحه كونه‏\n\n\n> وشاهد الحق به ناطق *** فإنه في كونه عينه‏\n\n\nوهو ما ذكرناه من أنه ما تلقى تفويض الحق إلا اسمه فهو المكلف والمكلف لأنه قال وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فهو عين الموجودات إذ هو الوجود والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ والكلام في هذا الباب يطول ويتداخل وينعطف بعضه على بعض فيظهر ويخفى فإنه الله الذي لا إله إلا هو لِلَّهِ الْأَسْماءُ الْحُسْنى‏ سبحانه وتعالى عما يقول الظالمون علوا كبيرا\n\n",
    "en": "## Chapter Four Hundred and Sixty-Nine concerning the state of a Pole (قطب) whose station was: \"And I entrust my affair unto Allah (وأُفَوِّضُ أَمْرِي إِلَى الله)\"\n\nIndeed, Existence (الوجود) is both spoken and speaking,\nBoth confirmed and confirming, so reflect upon this.\n\nFor the thing denies itself, being both denying and denied,\nYet the Essence (العين) does not multiply.\n\nTo what, then, does the matter I have stated\nConcerning our affair return? So gain insight,\n\nUntil you see it through direct witnessing (العيان), then entrust\nThe affair of Existence unto Him; do not be bewildered.\n\n### [What is not within the capacity of the creature to bear, Allah bears it]\n\nAllah, the Mighty and Majestic, commanded His Prophet (PBUH) to say to his people when they rejected his call: \"Soon you will remember what I say to you, and I entrust my affair unto Allah (وأُفَوِّضُ أَمْرِي إِلَى الله).\" This [entrustment] comes from *fayd* (overflow/superabundance), and nothing overflows until it is full. The *fayd* (الفيض) is an excess beyond what the receptacle (المحل) can bear.\n\nThis is because the receptacle only bears what is within its capacity to bear, which is the measure and aspect that the creature (المخلوق) can bear. But what overflows from that—which is the aspect that is not within the capacity of the creature to bear—Allah bears it.\n\nThere is no affair except that it contains a portion for Creation (الخلق) and a portion for Allah. The portion belonging to Allah is manifested by the entrustment (التفويض). The affair descends as a single totality and a single essence upon Creation, and every creature accepts from it according to its capacity. As for what exceeds that and overflows, Creation divides into two types concerning it. One type is those who assign that overflow to Allah the Exalted, saying: \"And I entrust my affair unto Allah (وأُفَوِّضُ أَمْرِي إِلَى الله).\" He attributes that affair to himself because when that which he imagined would overflow from him came to him, he imagined he could accept it all. But when his essence could not contain it, he returned it to his Lord.\n\nThe other type is those who do not recognize this, so the overflow returns to Allah without the knowledge of the one from whom it originated. Thus, it belongs to Allah in every aspect. The merit remains only with the one who knows this and entrusts his affair unto Allah, thereby gaining a standing with Allah. As for those who do not know this, they have neither a station (منزلة) nor a right with Allah through this orientation. The Exalted said: <<قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ>> (Say: Are those who know equal to those who do not know? Only those of understanding will remember).\n\n### [For the servant is the locus for the manifestation of the effect of every Divine Name that he is capable of bearing]\n\nKnow that the servant (العبد) who accepts the command of Allah only accepts it through a specific Divine Name (اسم إلهي), and that Name does not exceed its own Reality (حقيقته). Thus, this servant only accepted the command through Allah, by virtue of that Name. The servant did not fail or become too constrained to bear it, for he is the locus for the manifestation of the effect of every Divine Name. Rather, the overflow originated from the Divine Name, not from the servant.\n\nWhen he entrusted it by saying, \"And I entrust my affair unto Allah (وأُفَوِّضُ أَمْرِي إِلَى الله),\" he did not specify a particular Name, but rather entrusted it to the Comprehensive Name (الاسم الجامع). From this Comprehensive Name, the Names appropriate to that affair are received by another creature. For what Zayd cannot bear and is constrained by—because the Reality of the Divine Name through which he accepted it only granted what he accepted from it—'Amr may bear it. This is not because 'Amr is inherently wider than Zayd, but rather because 'Amr is under the ruling of another Divine Name which may be wider in its encompassing (إحاطة) than the Divine Name that Zayd possessed.\n\nIndeed, the Divine Names (الأسماء الإلهية) differ in their generality and encompassment. The Knower (*al-ʿĀlim*) encompasses, and the All-Knowing (*al-ʿAlīm*) encompasses, but the encompassment of *al-ʿAlīm* is greater than the encompassment of *al-ʿĀlim*. And the encompassment of the All-Aware (*al-Khabīr*) is greater than the encompassment of others. Likewise, the Name the Willer (*al-Murīd*) compared to *al-ʿĀlim*, and the Name the Powerful (*al-Qādir*) compared to *al-Murīd* and *al-ʿĀlim*—its encompassment is less than theirs.\n\nThe servant must necessarily be under the ruling of a Divine Name. Thus, according to that Name and the acceptance granted by its Reality, he returns what overflows from him to the Exalted. That entrustment (التفويض) is for the one who understands Allah’s saying. For the language with which the Real (الحق) addressed us necessitated this. We are with Him in His saying, because it is not within the capacity of the creature to judge the Creator, except for the one whose witnessing (شهود) reveals what the possibilities (الممكنات) are upon Him in their state of non-existence, seeing that they themselves granted knowledge to the Knower (*al-ʿĀlim*). He may thus perceive a scent of judgment from this, but their neediness by virtue of their possibility (إمكانها) overcomes them. This is why you see those who negate possibility through rational proof often neglect, in most situations, what the proof granted them concerning the negation of possibility in reality, and they affirm possibility until they are reminded and alerted, whereupon they recall it.\n\nThere must necessarily be an affair that holds sway over this servant, causing him to be characterized by heedlessness (الغفلة) and forgetfulness (الذهول) regarding what his proof necessitated. This is none other than the natural disposition and the temperament (المزاج). Do you not see him, when he transitions by the Greater Death (الموت الأكبر) or the Lesser Death (الموت الأصغر) into the Isthmus (البرزخ), how in the Lesser Death he sees things that his intellect deemed impossible during wakefulness? Yet, these things are perceptible to him in the Isthmus, just as things related to his senses are perceptible to him during wakefulness. He does not deny what his intellect previously indicated was impossible concerning the existence of an affair that he now sees existing in the Isthmus. Undoubtedly, it is an existential affair (أمر وجودي) to which the sense faculty attaches itself in the Isthmus. Thus, the locus (الموطن) differs for the sense faculty, and the ruling differs.\n\nIf that were inherently impossible for itself in accepting Existence (الوجود), it would not be characterized by Existence in the Isthmus, nor would it be perceived by the sense faculty in the Isthmus. Rather, the People of Allah (أهل الله) may realize this to the extent that they perceive it during their state of wakefulness, but within the Isthmus. Thus, in their state of wakefulness, they are like the sleeper or the dead person in their state of sleep or death. If you have understood this, I have cast you upon the path of Knowledge (العلم) concerning the deficiency of rational speculation, and that it has not encompassed the Levels of Existents (مراتب الموجودات) nor known what Existence truly is. For if Existence were as the intellect judged it to be, it would not have manifested existence in any of the Levels. Since it has manifested, no rational person should trust what his intellect guides him to in every matter.\n\nIf the indication is sound, it permeates every form. Thus, he knows concerning every form he sees in the Isthmus, and it is established within his soul, that it is Allah. He is Allah. His Being (كونه) does not change, even if the forms of His Self-disclosure (تجلي) change. Likewise, for the Gnostics (العارفين) here, nothing of this is confused for them, neither in the Isthmus nor in the Greater Resurrection (القيامة الكبرى). They witness their Lord in every form, from the lowest to the highest. As they are today, so shall they be tomorrow.\n\nAs for Abu Yazid [al-Bistami], he departed from the station of Entrustment (مقام التفويض). We know that he was under the ruling of the Name the All-Encompassing (*al-Wāsiʿ*), so nothing overflowed from him. This is because he realized the saying: \"My servant's heart encompassed Me.\" Since his heart encompassed the Real (الحق), and the affairs from which entrustment occurs originate from Him, he is like the sea, and all other hearts are like streams. He said concerning this station: \"If the Throne (العرش)—meaning everything other than Allah—and what it contains were placed a hundred thousand thousand times—meaning multiplicity, or rather, meaning what is infinite—in a corner of the Gnostic’s heart, he would not feel it.\" This means due to its vastness, since it encompassed the Real.\n\nFrom this, we say that the heart of the Gnostic is wider than the Mercy of Allah, because the Mercy of Allah does not reach Allah and does not encompass Him, whereas the servant’s heart has encompassed Him. However, there is a subtle point (نكتة) in this matter that I will allude to but not explicitly state: Allah has described Himself with Wrath (الغضب) and severe Vengeance (البطش الشديد) against those upon whom is wrath. Vengeance is Mercy (رحمة) because it contains relief and the removal of wrath. This degree of allusion is sufficient for what we wish to explain concerning this, for the Messengers say: \"And He will never be angry after it like it.\" Thus, retribution is Mercy and healing. If it were not Mercy, it would not have occurred in Existence (الوجود), yet it has occurred. However, you must know for whom the occurrence of retribution is Mercy. From this, the rank (رتبة) of Abu Yazid becomes clear compared to other Gnostics, because he and those like him speak only from their spiritual states (أحوالهم) and their direct experience (ذوقهم) within them.\n\nOne of His Names, the Exalted, is the All-Encompassing (*al-Wāsiʿ*), as has been transmitted. By His encompassment, He accepted Wrath. If He had been constrained by it, Wrath would not have manifested a ruling in Existence, because it would not have had a Divine Reality (حقيقة إلهية) upon which to rely for its existence. Since it exists, Wrath must necessarily be attributed to Allah in a manner befitting His Majesty. The heart has encompassed the Real, and Wrath is one of His Attributes (صفاته), so the heart has encompassed Wrath. Therefore, it is not denied that the Gnostic, despite seeing nothing but Allah, may become angry and pleased, and be characterized by causing harm, even if he is not harmed. Causing harm to one who is not harmed is not harm. However, this is not said concerning the Divine Presence (الجناب الإلهي), except that He named Himself the Patient (*al-Ṣabūr*) and informed us what patience is and upon what it rests. We do not say that patience is forbearance (*ḥilm*) concerning the Real, for *al-Ḥalīm* (the Forbearing) has been transmitted, just as *al-Ṣabūr* (the Patient) has been transmitted, and every transmitted Name has a meaning that is not identical to the other. Thus, the spiritual states change for the Gnostics just as the forms change for the Real.\n\nWere it not for this, the rulings (الأحكام) in the World (العالم) would not change, because they originate from Allah and manifest in the World. He is their Originator (*Mūjid*) and Creator (*Khāliq*). Therefore, the Attribute (الصفة) must necessarily subsist in Him, and only then is its existence from Him valid, whether the Originator is the active subject or the passive object of existence.\n\nIf you do not know the Entrustment (التفويض) as I have mentioned it to you, you will fall into a difficulty from which we cannot be released—I mean, in the Knowledge (العلم) of what Entrustment is. This is its relation to the creature (المخلوق).\n\nAs for the Divine Entrustment (التفويض الإلهي), which is that He is the One who entrusts His affair to His servants concerning it: He imposed duties upon them (كلفهم), commanded them, and forbade them. This is the entrustment of His affair to His servants, for it overflowed (فاض) from what is necessary for the Real (الحق), because the imposition of duties (التكليف) is not valid concerning the Real. When it overflowed from Him, His overflowing was only upon Creation. He desired them to uphold it when He returned it to them, just as the Real upholds the affair when the servant entrusts his affair unto Allah. Among them are those who have been characterized by the ethics of Allah (أخلاق الله), accepting His command and prohibition—these are the protected (*maʿṣūm*) and the preserved (*maḥfūẓ*). Among them are those who reject it. And among them are those who accept it at one time and in one state, and reject it at another time and in another state.\n\nLikewise, He entrusted His affair to them concerning speaking about Him, so their statements concerning Allah differed. Then, through the tongues of His Messengers, He clarified to them what He is in Himself, so that the proof might be established against those who contradicted His saying by speaking about Allah in a way contrary to what He said about Himself. When the statements differed, He disclosed Himself (تجلى) to the adherents of each statement according to, or in the form of, their statement. The reason for this is His entrustment of His affair to them and His granting them intellects and thoughts with which to reflect. He granted every fulfiller of his duty a portion of reward for his exertion (*ijtihād*) through his speculation (نظره), whether he erred in his exertion or was correct. For he only erred concerning the statement about Allah transmitted specifically through the language of the Law (الشرع), deviating from it through an interpretation (تأويل) to which his speculation led him. Furthermore, a Law also came down supporting him in this, so he did not abandon the statement from the perspective of its obligation. Rather, he relied in his conclusion upon a sanctioned matter and a rational proof. Whether he was correct or erred is another matter, supplementary to the fact that he exerted himself, for by his exertion, he seeks nothing but the proof that he believes will lead him to the Real (الحق) and correctness.\n\nHis imposition of duty is the very essence of His entrustment,\nSo we and He are equal in it.\n\nOur glorification is the very essence of His glorification,\nAnd His glorification is by the tongue of the other (السوي).\n\nAnd the portion of every person from the remembrance (الذكر) of Allah\nIs only what he intended.\n\nHis entrustment is in His saying: <<وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ>> (And spend out of that in which He has made you successors/vicegerents). And our entrustment is when He commanded us to take Him as a Trustee (وكيل) concerning what He made us vicegerents over: <<فَرَدَدْناهُ إِلى‏ أُمِّهِ كَيْ تَقَرَّ عَيْنُها>> (So We restored him to his mother that her eye might be comforted).\n\nSince the World (العالم) is under the ruling of the Divine Names (الأسماء الإلهية), and they are His Names, only He received His entrustment, not us. For we received it through His Names. Thus, He is the Inner (الباطن) from the perspective of His entrustment, and He is the Outer (الظاهر) from the perspective of His acceptance. The affair between us was therefore like the descent of the command between the Heaven, which is the Exalted (العلى), and the Earth, which is the Submissive (الذلول).\n\nSo the affair is thus, do not fear it,\nFor His Being (كونه) has clarified it.\n\nAnd the witness of the Real (الحق) speaks through it,\nFor He is its very Essence (عينه) in its Being.\n\nThis is what we mentioned: that nothing received the entrustment of the Real except His Name. Thus, He is both the one imposing the duty (المكلف) and the one upon whom the duty is imposed (المكلف), because He said: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him all affairs are returned). He is the very Essence of the Existents (الموجودات), since He is Existence (الوجود). And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way). The discussion in this chapter is lengthy, intertwined, and folds back upon itself, sometimes manifesting and sometimes hidden. For He is Allah, there is no god but Him. <<لِلَّهِ الْأَسْمَاءُ الْحُسْنَى>> (To Allah belong the Most Beautiful Names). Glory be to Him and highly exalted is He above what the wrongdoers say.",
    "ur": "باب نمبر چار سو انہتر: اس قطب کا حال جس کا مقام یہ تھا: \"اور میں اپنا معاملہ اللہ کے سپرد کرتا ہوں (وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ)\"۔\n\nبے شک ہستی (الوجود) منطق ہے اور منطق ہے،\nاور تصدیق کرنے والی ہے اور تصدیق کی گئی ہے، پس غور کرو۔\n\nپس شے خود اپنی تکذیب کرتی ہے، لہٰذا وہ جھٹلانے والی ہے اور جھٹلائی گئی ہے،\nحالانکہ عین (حقیقت) میں کثرت نہیں ہے۔\n\nتو وہ معاملہ جو میں نے اپنے امر کے بارے میں کہا ہے، وہ کس شے کی طرف لوٹتا ہے؟ پس بصیرت حاصل کرو۔\n\nیہاں تک کہ تم اسے عیاں دیکھ لو، پس ہستی (الوجود) کے معاملے کو اسی کے سپرد کر دو، حیران نہ ہو۔\n\n### [جو مخلوق کی وسعت میں نہیں ہے، اسے اللہ اٹھاتا ہے]\n\nاللہ عز و جل نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا کہ وہ اپنی قوم سے کہیں جب انہوں نے آپ کی دعوت کو رد کیا: \"پس تم عنقریب یاد کرو گے جو میں تم سے کہہ رہا ہوں، اور میں اپنا معاملہ اللہ کے سپرد کرتا ہوں (وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ)\"۔ اور یہ (تفویض) *فاض* (بڑھ جانے) سے ہے، اور کوئی شے تب تک نہیں بڑھتی جب تک وہ بھر نہ جائے۔ پس فیض (الفيض) اس چیز پر اضافہ ہے جسے محل (ظرف) اٹھا سکتا ہے۔ اور یہ اس لیے ہے کہ محل صرف وہی اٹھاتا ہے جو اس کی وسعت میں ہو، اور یہ وہ مقدار اور وہ پہلو ہے جسے مخلوق اٹھاتی ہے۔ اور جو اس سے بڑھ جاتا ہے (فاض)، یعنی وہ پہلو جو مخلوق کی وسعت میں نہیں ہے، اسے اللہ اٹھاتا ہے۔ پس کوئی بھی امر ایسا نہیں جس میں مخلوق کا حصہ نہ ہو اور اللہ کا حصہ نہ ہو۔ اللہ کا حصہ تفویض (التفویض) کے ذریعے ظاہر ہوتا ہے۔ پس امر ایک ہی جملے اور ایک ہی عین (حقیقت) کے طور پر مخلوق پر نازل ہوتا ہے، تو ہر مخلوق اسے اپنی وسعت کے مطابق قبول کرتی ہے۔ اور جو اس سے بڑھ جاتا ہے اور فیض (فاض) کی صورت اختیار کرتا ہے، اس میں مخلوق دو حصوں میں تقسیم ہو جاتی ہے۔ ان میں سے کچھ وہ ہیں جنہوں نے اس زائد حصے کو اللہ تعالیٰ کی طرف لوٹا دیا، پس انہوں نے کہا: \"اور میں اپنا معاملہ اللہ کے سپرد کرتا ہوں (وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ)\"۔ اور وہ اس امر کو اپنی طرف منسوب کرتا ہے کیونکہ جب اس کے پاس وہ چیز آئی جو اس نے گمان کیا کہ اس سے بڑھ جائے گی، اور اس نے گمان کیا کہ وہ اسے مکمل طور پر قبول کر لے گا، لیکن جب وہ اس کی ذات میں سما نہ سکا تو اس نے اسے اپنے رب کی طرف لوٹا دیا۔ اور ان میں سے کچھ وہ ہیں جنہوں نے یہ نہیں جانا، پس زائد حصہ اللہ کی طرف لوٹ گیا اس شخص کے علم کے بغیر جس سے وہ امر صادر ہوا۔ پس وہ ہر پہلو سے اللہ کی طرف لوٹتا ہے۔ اور فضیلت صرف اسی میں باقی رہتی ہے جو یہ جانتا ہے، پس وہ اپنا معاملہ اللہ کے سپرد کرتا ہے، اور اس طرح اللہ کے ہاں اس کا ایک حق (ید) بن جاتا ہے۔ اور جو یہ نہیں جانتا، تو اس کے لیے اللہ کے ہاں اس توجہ کے سبب کوئی مقام یا حق نہیں ہے۔ اللہ تعالیٰ فرماتا ہے: \"کہہ دیجیے: کیا وہ لوگ جو علم رکھتے ہیں اور وہ لوگ جو علم نہیں رکھتے برابر ہو سکتے ہیں؟ نصیحت تو صرف عقل والے ہی حاصل کرتے ہیں (قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ)\"۔\n\n### [کیونکہ بندہ ہر اس اسم الٰہی کے اثر کے ظہور کا محل ہے جسے وہ اٹھانے کے قابل ہے]\n\nاور جان لو کہ اللہ کے امر کو قبول کرنے والا بندہ اسے صرف ایک خاص اسم الٰہی (اسم إلهي) کے ذریعے ہی قبول کرتا ہے، اور وہ اسم اپنی حقیقت (حقیقۃ) سے تجاوز نہیں کرتا۔ پس اس بندے نے امر کو صرف اللہ کے ذریعے، اس اسم کے پہلو سے قبول کیا۔ اور بندہ اس کے اٹھانے سے عاجز نہیں ہوا اور نہ ہی اس کے لیے تنگ پڑا، کیونکہ وہ ہر اسم الٰہی (اسم إلهي) کے اثر کے ظہور کا محل ہے۔ پس وہ (اضافہ) اسم الٰہی کی طرف سے فیض ہوا ہے، نہ کہ بندے کی طرف سے۔ جب اس نے اپنے قول \"اور میں اپنا معاملہ اللہ کے سپرد کرتا ہوں (وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ)\" کے ذریعے تفویض (التفویض) کیا، تو اس نے کسی خاص اسم کو متعین نہیں کیا، بلکہ اس نے اسے اسم جامع کی طرف تفویض کیا، تاکہ دوسرے مخلوق میں سے جو اس امر کے مناسب ہو، وہ اسے اس سے حاصل کرے۔ کیونکہ جو چیز زید نہیں اٹھا سکتا اور اس کے لیے تنگ پڑ جاتی ہے، اس کی وجہ یہ ہے کہ جس اسم الٰہی کے ذریعے اس نے اسے قبول کیا، اس کی حقیقت نے صرف وہی دیا جو اس نے قبول کیا۔ اور ہو سکتا ہے کہ اسے عمر اٹھا لے، اس لیے نہیں کہ وہ زید سے زیادہ وسیع ہے، بلکہ اس لیے کہ عمرو بھی ایک اسم الٰہی (اسم إلهي) کے حکم میں ہے جو اس اسم الٰہی سے زیادہ احاطہ (إحاطۃ) کرنے والا ہو سکتا ہے جو زید کے پاس تھا۔ کیونکہ اسماء الٰہیہ عموم اور احاطوں میں ایک دوسرے سے افضل ہوتے ہیں۔ پس *العالم* (جاننے والا) احاطہ کرتا ہے اور *العلیم* (بہت جاننے والا) بھی احاطہ کرتا ہے، تو *العلیم* کا احاطہ *العالم* کے احاطے سے زیادہ ہوتا ہے۔ اور *الخبیر* (خبر رکھنے والا) کا احاطہ دوسروں کے احاطے سے زیادہ ہوتا ہے۔ اسی طرح اسم *المرید* (ارادہ کرنے والا) کا *العالم* کے ساتھ، اور اسم *القادر* (قدرت والا) کا *المرید* اور *العالم* کے ساتھ، اس کا احاطہ ان دونوں سے کم ہوتا ہے۔ اور بندے کا کسی اسم الٰہی کے حکم کے تحت ہونا ضروری ہے۔ پس وہ اس اسم کے مطابق ہوتا ہے اور اس کی حقیقت قبولیت میں جو کچھ دیتی ہے، تو وہ اس سے زائد چیز کو اللہ تعالیٰ کی طرف لوٹا دیتا ہے۔ اور یہ تفویض (التفویض) اس شخص کے لیے ہے جو اللہ کے قول کو سمجھتا ہے، کیونکہ جس زبان سے حق نے ہم سے خطاب کیا، اس کا تقاضا یہی تھا۔ پس ہم اس کے قول کے ساتھ ہیں، کیونکہ مخلوق کی وسعت میں نہیں ہے کہ وہ خالق پر حکم لگائے، سوائے اس کے جس کا شہود (الشہود) یہ ہو کہ ممکنات عدم کی حالت میں اس پر کیا ہیں۔ پس وہ دیکھتا ہے کہ انہوں نے خود ہی *العالم* (جاننے والے) کو علم عطا کیا۔ پس وہ اس سے حکم کی کچھ بو سونگھ سکتا ہے، لیکن ان کا ممکن ہونے کے پہلو سے ان کا افتقار ان پر غالب رہتا ہے۔ اور اسی وجہ سے آپ دیکھتے ہیں کہ عقلی دلیل سے امکان کی نفی کرنے والے اکثر حالات میں اس چیز سے غافل ہو جاتے ہیں جو دلیل نے انہیں نفس الامر میں امکان کی نفی سے عطا کی تھی، پس وہ امکان کا قول کرتے ہیں یہاں تک کہ انہیں رجوع کرایا جائے اور متنبہ کیا جائے، تو وہ اسے یاد کرتے ہیں۔ پس کوئی امر ایسا ہونا ضروری ہے جس کی اس بندے پر سلطنت ہو، یہاں تک کہ وہ اس چیز سے غفلت اور بھول چوک کا شکار ہو جائے جس کا اس کی دلیل نے تقاضا کیا تھا، اور وہ صرف امرِ طبعی اور مزاج ہے۔ کیا آپ نہیں دیکھتے کہ جب وہ موت اکبر یا موت اصغر کے ذریعے برزخ کی طرف منتقل ہوتا ہے، تو موت اصغر میں وہ ایسے امور کو کیسے دیکھتا ہے جنہیں وہ بیداری کی حالت میں عقلی طور پر محال سمجھتا تھا، اور وہ برزخ میں اس کے لیے محسوس ہوتے ہیں، جیسے بیداری کی حالت میں اس کا حس ان سے متعلق ہوتا ہے؟ پس وہ اس چیز کا انکار نہیں کرتا جس پر اس کا عقل کسی امر کے وجود کے محال ہونے کی دلیل دیتا تھا جسے وہ برزخ میں موجود دیکھتا ہے۔ اور بلاشبہ یہ ایک وجودی امر ہے جس سے برزخ میں حس متعلق ہوا، پس حس کے لیے مقام بدل گیا، تو حکم بدل گیا۔ اگر وہ بذات خود وجود کو قبول کرنے میں محال ہوتا، تو وہ برزخ میں وجود سے متصف نہ ہوتا اور نہ ہی برزخ میں حس کے ذریعے مدرک ہوتا۔ بلکہ اہل اللہ اس کا ادراک اپنی بیداری کی حالت میں بھی کر لیتے ہیں، لیکن برزخ میں۔ پس وہ اپنی بیداری کی حالت میں سونے والے اور مرنے والے کی طرح ہوتے ہیں، اس کی نیند اور موت کی حالت میں۔ اگر آپ نے غور کیا، تو میں نے آپ کو عقلی نظر کی کوتاہی کے علم کے راستے پر ڈال دیا ہے، اور یہ کہ اس نے موجودات کے مراتب کا احاطہ نہیں کیا اور نہ ہی یہ جانا کہ ہستی (الوجود) کیسی ہے۔ کیونکہ اگر وہ ویسی ہوتی جیسا کہ عقل نے حکم دیا، تو وہ کسی بھی مرتبے میں ظاہر نہ ہوتی، حالانکہ وہ ظاہر ہوئی ہے۔ پس کسی بھی عقل مند کے لیے ہر چیز میں اس چیز پر بھروسہ کرنا درست نہیں جو اس کے عقل نے اسے بتائی ہے۔ پس جب اس کی دلیل صحیح ہو، تو وہ ہر صورت میں سرایت کر جاتی ہے، پس وہ ہر صورت میں جو وہ برزخ میں دیکھتا ہے اور اس کے نفس میں حاصل ہوتی ہے، جانتا ہے کہ وہ اللہ ہے، پس وہ اللہ ہے۔ اس کی حقیقت (کون) مختلف نہیں ہوتی، اگرچہ اس کے ظہور (التجلی) کی صورتیں مختلف ہوں۔ اور اسی طرح یہاں کے عارفین کے نزدیک بھی ان میں سے کوئی چیز ان پر خلط نہیں ہوتی، نہ برزخ میں اور نہ قیامت کبریٰ میں۔ پس وہ اپنے رب کا شہود (الشہود) ہر صورت میں کرتے ہیں، ادنیٰ سے اعلیٰ تک۔ اور جیسے وہ آج ہیں، ویسے ہی کل ہوں گے۔ جہاں تک ابو یزید کا تعلق ہے، تو وہ مقام تفویض (التفویض) سے نکل گئے، پس ہم نے جانا کہ وہ اسم *الواسع* (وسعت والا) کے حکم کے تحت تھے، پس ان سے کوئی چیز فیض (فاض) نہیں ہوئی۔ اور یہ اس لیے کہ انہوں نے اس قول سے تحقق حاصل کیا: \"میرے بندے کے دل نے مجھے سما لیا (وَسِعَنِي قَلْبُ عَبْدِي)\"۔ پس جب ان کے دل نے ذات حق (الحق) کو سما لیا، اور امور ان سے نکلتے ہیں جن میں تفویض واقع ہوتا ہے اس شخص کی طرف سے جس سے وہ واقع ہوا، تو وہ سمندر کی طرح ہیں اور باقی دل نہروں کی طرح ہیں۔ اور انہوں نے اس مقام پر کہا: اگر عرش – اور اس سے مراد اللہ کے سوا جو کچھ ہے – اور جو کچھ اس میں سما گیا، ایک لاکھ لاکھ بار، یعنی کثرت، بلکہ جو لامتناہی ہے، عارف کے دل کے کسی کونے میں ہو، تو اسے محسوس نہیں ہوگا، یعنی اس کی وسعت کی وجہ سے جہاں اس نے ذات حق (الحق) کو سما لیا۔ اور اسی وجہ سے ہم نے کہا کہ عارف کا دل اللہ کی رحمت سے زیادہ وسیع ہے، کیونکہ اللہ کی رحمت اللہ کو نہیں پاتی اور نہ ہی اسے سما سکتی ہے، جبکہ بندے کے دل نے اسے سما لیا ہے۔ مگر اس امر میں ایک نکتہ ہے جس کی طرف میں اشارہ کرتا ہوں اور اس پر نص نہیں کرتا۔ اور وہ یہ ہے کہ اللہ نے خود کو غضب اور مغضوب علیہ پر شدید پکڑ (البطش الشدید) سے متصف کیا ہے، اور پکڑ (البطش) رحمت ہے کیونکہ اس میں تنفیس اور غضب کو زائل کرنا ہے۔ اور اشارے کی یہ مقدار اس چیز کے لیے کافی ہے جسے ہم بیان کرنا چاہتے ہیں۔ کیونکہ رسول کہتے ہیں: \"اور اس کے بعد وہ ایسا غضب نہیں کرے گا\"۔ پس انتقام رحمت اور شفا ہے، اور اگر وہ رحمت نہ ہوتا تو وجود میں واقع نہ ہوتا، حالانکہ وہ واقع ہوا ہے۔ لیکن آپ کو یہ جاننا چاہیے کہ انتقام کا وقوع کس پر رحمت ہے۔ پس یہاں سے آپ کے لیے ابو یزید کا مرتبہ دوسرے عارفین سے ظاہر ہو گیا، کیونکہ وہ اور ان جیسے لوگ صرف اپنے احوال اور ان میں اپنے ذوق کے بارے میں بات کرتے ہیں۔ اور اللہ تعالیٰ کے اسماء میں سے *الواسع* (الواسع) بھی ہے جیسا کہ وارد ہوا ہے۔ پس اپنی وسعت کے سبب اس نے غضب کو قبول کیا۔ اگر وہ اس کے لیے تنگ پڑ جاتا، تو غضب کا حکم وجود میں ظاہر نہ ہوتا، کیونکہ اس کے لیے کوئی الٰہی حقیقت نہ ہوتی جس پر وہ اپنے وجود میں بھروسہ کرتا۔ حالانکہ وہ موجود ہوا ہے۔ پس غضب کو اللہ کی طرف منسوب کرنا ضروری ہے جیسا کہ اس کی جلالت کے لائق ہے۔ اور دل نے ذات حق (الحق) کو سما لیا، اور غضب اس کی صفات میں سے ہے، پس اس نے غضب کو بھی سما لیا۔ پس عارف پر انکار نہیں کیا جائے گا، باوجود اس کے کہ وہ صرف اللہ کو دیکھتا ہے، کہ وہ غضب کرے اور راضی ہو، اور اس صفت سے متصف ہو کہ وہ تکلیف دیتا ہے، اگرچہ وہ خود تکلیف نہیں پاتا۔ پس جو تکلیف نہیں پاتا اسے تکلیف دینا غیر ہے۔ مگر یہ بات جناب الٰہی میں نہیں کہی جاتی، سوائے اس کے کہ اس نے خود کو *الصبور* (صبر کرنے والا) سے موسوم کیا اور ہمیں صبر کے بارے میں بتایا کہ وہ کیا ہے اور کس چیز پر ہوتا ہے۔ اور ہم حق کے حق میں اسے *حلم* (بردباری) نہیں کہتے، کیونکہ *الحلیم* (بردبار) جیسا کہ وارد ہوا ہے، اسی طرح *الصبور* بھی وارد ہوا ہے، اور ہر وارد ہونے والے کا ایک معنی ہے جو دوسرے کا عین نہیں ہے۔ پس عارفین پر احوال بدلتے ہیں جیسے حق پر صورتیں بدلتی ہیں۔ اور اگر ایسا نہ ہوتا تو عالم میں احکام نہ بدلتے، کیونکہ وہ اللہ کی طرف سے عالم میں ظاہر ہوتے ہیں، اور وہ ان کا موجد اور خالق ہے۔ پس صفت کا اس کے ساتھ قائم ہونا ضروری ہے، اور تب ہی اس کا وجود اس کی طرف سے صحیح ہوتا ہے، خواہ *الموجد* (ایجاد کرنے والا) اسم فاعل ہو یا *الموجد* (ایجاد کیا گیا) اسم مفعول ہو۔ اگر آپ تفویض (التفویض) کو اس طرح نہیں جانتے جیسا کہ میں نے آپ کو بیان کیا ہے، تو آپ ایک ایسی مشکل میں پڑ جائیں گے جو حل نہیں ہوگی، یعنی تفویض کے علم میں کہ وہ کیا ہے۔\n\nیہ (پچھلی بحث) مخلوق کی طرف اس کی نسبت ہے۔ اور جہاں تک تفویض الٰہی (التفویض الإلهي) کا تعلق ہے، جو یہ ہے کہ وہ خود اپنے امر کو اپنے بندوں کے سپرد کر دے، تو اس نے انہیں مکلف بنایا، انہیں حکم دیا اور انہیں منع کیا۔ پس یہ اپنے امر کو اپنے بندوں کے سپرد کرنا ہے۔ کیونکہ یہ حق کے لیے واجب سے فیض (فاض) ہوا ہے، کیونکہ تکلیف حق کے حق میں صحیح نہیں ہے۔ پس جب یہ اس سے فیض ہوا، تو اس کا فیض صرف مخلوق پر ہی ہو سکتا تھا۔ اور اس نے ان سے چاہا کہ جب اس نے اسے ان کی طرف لوٹا دیا، تو وہ اس کے ساتھ ویسے ہی قائم ہوں جیسے بندہ جب اپنا معاملہ اللہ کے سپرد کرتا ہے تو حق اس کے ساتھ قائم ہوتا ہے۔ پس ان میں سے کچھ وہ ہیں جنہوں نے اللہ کے اخلاق کو اپنایا، پس انہوں نے اس کے حکم اور نہی کو قبول کیا، اور وہ معصوم اور محفوظ ہیں۔ اور ان میں سے کچھ وہ ہیں جنہوں نے اسے رد کر دیا، اور ان میں سے کچھ وہ ہیں جنہوں نے اسے ایک وقت اور ایک حال میں قبول کیا اور دوسرے وقت اور حال میں رد کر دیا۔ اسی طرح اس نے ان کے سپرد کیا کہ وہ اس کے بارے میں بات کریں۔ پس اللہ کے بارے میں ان کے اقوال مختلف ہو گئے۔ پھر اس نے اپنے رسولوں کی زبانوں پر ان کے لیے بیان کیا کہ وہ خود کیا ہے، تاکہ اس شخص پر حجت قائم ہو جائے جس نے اس کے قول کی مخالفت کی اور اللہ کے بارے میں وہ کہا جو اس نے خود اپنے بارے میں کہا تھا۔ پس جب اقوال مختلف ہوئے، تو اس نے ہر قول والوں پر ان کے قول کے مطابق یا اس کی صورت میں ظہور (تجلی) فرمایا۔ اور اس کا سبب یہ ہے کہ اس نے اپنا امر ان کے سپرد کیا اور انہیں عقلیں اور افکار عطا کیے جن سے وہ غور و فکر کرتے ہیں۔ اور اس نے ہر تفویض کرنے والے کو اس کے اجتہاد میں اس کی نظر کے حق کا ایک حصہ اجر میں دیا، خواہ اس نے اپنے اجتہاد میں غلطی کی ہو یا صحیح۔ کیونکہ اس نے صرف اس قول میں غلطی کی جو خاص طور پر شرع کی زبان سے اللہ کے بارے میں وارد ہوا تھا، پس اس نے اس میں تاویل کے ذریعے انحراف کیا جس کی طرف اس کی نظر نے اسے پہنچایا۔ اور ایک شرع بھی وارد ہوئی جو اس کی تائید کرتی ہے۔ پس اس نے قول کو اس حیثیت سے نہیں چھوڑا جس پر وہ تھا، بلکہ اس نے جس طرف رجوع کیا، اس میں ایک مشروع امر اور عقلی دلیل کا سہارا لیا۔ اور اس کا صحیح ہونا یا غلط ہونا ایک دوسرا امر ہے جو اس کے اجتہاد کرنے سے زائد ہے۔ کیونکہ وہ اپنے اجتہاد سے صرف اس دلیل کو طلب کرتا ہے جو اس کے غالب گمان میں اسے حق اور درستگی تک پہنچائے، اور بس۔\n\nپس اس کا مکلف بنانا عین اس کا تفویض (سپردگی) ہے،\nلہٰذا ہم اور وہ اس میں برابر ہیں۔\n\nپس ہماری تسبیح عین اس کی تسبیح ہے،\nاور اس کی تسبیح غیر (سویٰ) کی زبان سے ہے۔\n\nاور ہر شخص کا اللہ کے ذکر سے حصہ وہی ہے\nجو اس نے نیت کی۔\n\nپس اس کا تفویض (التفویض) اس کے قول میں ہے: \"اور اس میں سے خرچ کرو جس میں اس نے تمہیں جانشین بنایا ہے (وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ)\"۔ اور ہمارا تفویض یہ ہے کہ جب ہمیں حکم دیا گیا کہ ہم اسے اس چیز میں وکیل بنائیں جس میں اس نے ہمیں جانشین بنایا، \"تاکہ اس کی آنکھ ٹھنڈی ہو جائے، تو ہم نے اسے اس کی ماں کی طرف لوٹا دیا (فَرَدَدْنَاهُ إِلَى أُمِّهِ كَيْ تَقَرَّ عَيْنُهَا)\"۔ اور چونکہ عالم اسماء الٰہیہ (الأسماء الإلهية) کے حکم کے تحت ہے، اور وہ اس کے اسماء ہیں، تو اس کے تفویض کو صرف اسی نے قبول کیا، نہ کہ ہم نے۔ کیونکہ ہم نے اسے اس کے اسماء کے ذریعے حاصل کیا۔ پس وہ اپنے تفویض کے پہلو سے باطن ہے، اور اپنے قبول کے پہلو سے ظاہر ہے۔ پس معاملہ ہمارے درمیان ویسا ہی ہوا جیسا کہ امر آسمان (جو بلند ہے) اور زمین (جو فرمانبردار ہے) کے درمیان نازل ہوتا ہے۔\n\nپس معاملہ ایسا ہی ہے، اس سے نہ ڈرو،\nکیونکہ اس کی ہستی (کون) نے اسے واضح کر دیا ہے۔\n\nاور ذات حق (الحق) کا شاہد اس کے ساتھ بول رہا ہے،\nکیونکہ وہ اپنی ہستی (کون) میں اس کا عین ہے۔\n\nاور یہ وہی ہے جو ہم نے ذکر کیا کہ حق کے تفویض کو صرف اس کے اسم نے قبول کیا، پس وہی مکلف ہے اور مکلف بنایا گیا ہے، کیونکہ اس نے فرمایا: \"اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)\"۔ پس وہ موجودات کا عین ہے، کیونکہ وہ ہستی (الوجود) ہے۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)\"۔ اور اس باب میں کلام طویل ہو جاتا ہے اور آپس میں مل جاتا ہے اور ایک دوسرے پر پلٹتا ہے، پس ظاہر ہوتا ہے اور چھپ جاتا ہے۔ کیونکہ وہ اللہ ہے جس کے سوا کوئی معبود نہیں، \"اللہ ہی کے لیے بہترین نام ہیں (لِلَّهِ الْأَسْمَاءُ الْحُسْنَى)\"۔ وہ پاک ہے اور بہت بلند ہے اس سے جو ظالم کہتے ہیں، بہت بڑی بلندی۔",
    "fa": "باب چهارصد و شصت و نهم در حال قطبی که منزل او «و کار خود را به خدا واگذار می‌کنم» (وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ) بود.\n\nهمانا هستی (الوجود) منطق است و منطق، و تصدیق‌کننده است و تصدیق‌شده، پس بیندیشید.\nپس شیء خود را تکذیب می‌کند، پس تکذیب‌کننده است و تکذیب‌شده، و عین (حقیقت) تکثر نمی‌پذیرد.\nپس امری که در کار ما گفتم به چه چیزی باز می‌گردد؟ پس بینا شوید.\nتا آن را به شهود (العیان) ببینید، پس امر هستی (الوجود) را به او واگذارید و سرگردان نشوید.\n\n[آنچه در توان مخلوق نیست که حمل کند، خدا آن را حمل می‌کند]\n\nخداوند عز و جل به پیامبرش (صلی الله علیه و سلم) فرمود که به قومش بگوید، هنگامی که دعوت او را رد کردند: «به زودی آنچه را به شما می‌گویم به یاد خواهید آورد، و کار خود را به خدا واگذار می‌کنم» (فَسَتَذْكُرُونَ مَا أَقُولُ لَكُمْ وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ). و این [تفویض] از *فاض* (فیض) است و فیض جاری نمی‌شود مگر آنکه [محل] پر شود. فیض (الفیض) افزون بر آن چیزی است که محل (محل ظهور) آن را حمل می‌کند. و این بدان سبب است که محل جز آنچه در توانش است حمل نمی‌کند، و آن همان قدر و وجهی است که مخلوق آن را حمل می‌کند. و آنچه از آن افزون آید و فیض کند، آن وجهی است که در توان مخلوق نیست که حمل کند، و خدا آن را حمل می‌کند. پس هیچ امری نیست مگر آنکه در آن نصیبی برای خلق و نصیبی برای خداست. نصیب خدا را تفویض (التفویض) آشکار می‌سازد. پس امر به صورت یکجا و یک عین (حقیقت) بر خلق نازل می‌شود، و هر مخلوقی به اندازه وسع خود از آن می‌پذیرد. و آنچه از آن افزون آید و فیض کند، خلق در آن به دو دسته تقسیم می‌شوند: دسته‌ای از ایشان فیضِ افزون را به خدای تعالی بازگرداندند و گفتند: «و کار خود را به خدا واگذار می‌کنم» (وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ). و آن امر را به خود نسبت می‌دهد، زیرا هنگامی که چیزی به او رسید، گمان کرد که از او فزونی می‌یابد و گمان کرد که می‌تواند همه آن را بپذیرد. پس چون ذاتاً گنجایش آن را نداشت، آن را به پروردگارش بازگرداند. و دسته‌ای دیگر آن را نشناختند، پس فیضِ افزون بدون آگاهی این شخص که آنچه رخ داده از او صادر شده است، به خدا بازگشت. پس آن [امر] به هر روی به سوی خداست. و فضل (برتری) باقی نمی‌ماند مگر در کسی که این را می‌داند و کار خود را به خدا واگذار می‌کند، پس به واسطه این کار نزد خدا دستی (منزلتی) دارد. و کسی که این را نمی‌داند، به واسطه این توجه نزد خدا منزلتی و حقی ندارد. خدای تعالی می‌فرماید: «بگو: آیا کسانی که می‌دانند و کسانی که نمی‌دانند برابرند؟ تنها خردمندان پند می‌گیرند» (قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ).\n\n[زیرا بنده محل ظهور اثر هر اسم الهی است که قابلیت حمل آن را دارد]\n\nو بدان که بنده پذیرنده امر خدا، آن را نمی‌پذیرد مگر به واسطه اسم خاص الهی، و آن اسم از حقیقت خود تجاوز نمی‌کند. پس این بنده امر را نپذیرفت مگر به واسطه خدا از حیث آن اسم. پس بنده از حمل آن عاجز نشد و تنگ نیامد، زیرا او محل ظهور اثر هر اسم الهی است. پس [آنچه فاضل آمد] از اسم الهی فیض کرد، نه از بنده. پس هنگامی که آن را با قول خود «و کار خود را به خدا واگذار می‌کنم» (وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ) تفویض کرد، اسم خاصی را تعیین نکرد، بلکه آن را به اسم جامع تفویض نمود. پس آنچه از اسماء مناسب آن امر باشد، در خلق دیگری آن را از او دریافت می‌کند. زیرا آنچه زید آن را حمل نمی‌کند و به دلیل اینکه اسم الهی که زید به واسطه آن پذیرفته، حقیقتش جز آنچه را که پذیرفته است عطا نکرده، بر او تنگ آمده است؛ ممکن است عمرو آن را حمل کند، نه به این دلیل که عمرو از زید وسیع‌تر است، بلکه به این دلیل که عمرو نیز تحت حکم اسم الهی دیگری است که ممکن است احاطه‌اش از اسم الهی که نزد زید بود، وسیع‌تر باشد. زیرا اسماء الهی در عموم و احاطه‌ها با یکدیگر تفاوت دارند. پس *العالم* (داننده) احاطه می‌کند و *العلیم* (بسیار دانا) احاطه می‌کند، و احاطه *العلیم* بیشتر از احاطه *العالم* است، و احاطه *الخبیر* (آگاه) بیشتر از احاطه غیر اوست. و همچنین اسم *المرید* (اراده‌کننده) با *العالم*، و اسم *القادر* (توانا) با *المرید* و *العالم*، احاطه‌اش از آن دو کمتر است. و بنده ناگزیر است که تحت حکم اسم الهی باشد. پس او بر حسب آن اسم و آنچه حقیقتش از پذیرش عطا می‌کند، آنچه را که از او فزونی یافته است به سوی خدای تعالی باز می‌گرداند. و این تفویض (التفویض) برای کسی است که کلام خدا را از او تعقل کند، زیرا زبانی که حق (الحق) با آن ما را مخاطب قرار داده، مقتضی این امر بوده است. پس ما با قول او همراه هستیم، زیرا در وسع مخلوق نیست که بر خالق حکم کند، مگر کسی که شهودش (الشهود) بر ممکنات در حال عدمشان باشد، پس ببیند که آنها خودشان علم را به *العالم* (داننده) عطا کرده‌اند. در این صورت ممکن است بویی از حکم را استشمام کند، اما نیازمندی آنها از حیث امکانشان بر آنها غلبه می‌کند. و به همین دلیل است که منکران امکان (الممکنات) با استدلال عقلی، در بیشتر حالات از آنچه دلیل، از نفی امکان در نفس‌الامر به آنها داده است، غافل می‌شوند و به امکان قائل می‌شوند تا اینکه به آنها رجوع شود و تذکر داده شوند و آن را به یاد آورند. پس ناگزیر امری باید باشد که در این بنده سلطنت داشته باشد تا به غفلت و بی‌خبری از آنچه دلیلش اقتضا کرده است، متصف شود. و آن جز امر طبیعی و مزاج نیست. آیا نمی‌بینی که وقتی با مرگ بزرگ‌تر یا مرگ کوچک‌تر به برزخ (البرزخ) منتقل می‌شود، چگونه در مرگ کوچک‌تر اموری را می‌بیند که در حال بیداری عقلاً محال می‌دانست، در حالی که آن امور در برزخ برای او محسوس است، همان‌گونه که در حال بیداری آنچه حسش به آن تعلق می‌گیرد برای او محسوس است؟ پس آنچه عقلش بر محال بودن وجود آن دلالت می‌کرد، در برزخ انکار نمی‌کند، در حالی که آن را موجود می‌بیند. و شکی نیست که آن امری وجودی است که حس در برزخ به آن تعلق گرفته است. پس موطن بر حس متفاوت شده و حکم متفاوت گشته است. و اگر آن [امر] ذاتاً برای پذیرش وجود محال بود، در برزخ به وجود متصف نمی‌شد و در برزخ با حس درک نمی‌شد. بلکه اهل الله (عارفان) به آن یقین پیدا می‌کنند تا آن را در حال بیداری خود درک کنند، اما در برزخ. پس آنها در حال بیداری خود مانند حال شخص خوابیده و مرده در حال خواب و مرگش هستند. اگر به این نکته پی بردی، تو را بر طریق علم به کوتاهی نظر عقلی انداخته‌ام، و اینکه عقل به مراتب موجودات احاطه نکرده و ندانسته است که هستی (الوجود) چگونه است. زیرا اگر آن‌گونه بود که عقل حکم کرده است، وجودی برای آن در هیچ مرتبه‌ای از مراتب ظاهر نمی‌شد، در حالی که ظاهر شده است. پس هیچ عاقلی نباید به آنچه عقلش در هر چیزی به او دلالت می‌کند، اعتماد کند. فإذا كان صحيح الدلالة سرى ذلك في كل صورة فيعلم في كل صورة يراها في البرزخ وتحصل في نفسه أنه الله فهو الله فما يختلف كونه وإن اختلفت صور تجليه وكذلك عند العارفين به هنا ما يختل عليهم شي‏ء من ذلك ولا في البرزخ ولا في القيامة الكبرى فيشهدون ربهم في كل صورة من أدنى وأعلى وكما هم اليوم كذلك يكونون غدا. پس اگر دلالت [عقل] صحیح باشد، در هر صورتی جاری می‌شود. پس در هر صورتی که در برزخ می‌بیند و در نفسش حاصل می‌شود، می‌داند که آن خداست، پس او خداست. پس ماهیت او تغییر نمی‌کند، اگرچه صورت‌های تجلی‌اش (التجلی) متفاوت باشد. و همچنین نزد عارفان به او در اینجا، هیچ چیز از این امور بر آنها مشتبه نمی‌شود، نه در برزخ و نه در قیامت کبری. پس پروردگار خود را در هر صورتی، از پایین‌ترین و بالاترین، شهود (الشهود) می‌کنند. و همان‌گونه که امروز هستند، فردا نیز خواهند بود.\n\nاما ابویزید [بسطامی] از مقام تفویض (التفویض) خارج شد، پس دانستیم که او تحت حکم اسم *الواسع* (گسترده) بود، و چیزی از او فزونی نیافت. و این بدان سبب است که او به قول [حدیث قدسی] یقین یافت: «و قلب بنده‌ام مرا گنجایش داشت» (وَوَسِعَنِي قَلْبُ عَبْدِي). پس چون قلبش حق (الحق) را گنجایش داشت، و امور از او خارج می‌شوند که تفویض در آنها رخ می‌دهد، از کسی که تفویض از او واقع شده، او مانند دریاست و سایر قلب‌ها مانند جویبارها. و در این مقام گفت: اگر عرش – و منظور او از عرش، آنچه غیر خداست – و آنچه آن را در بر گرفته است، صد هزار هزار بار، و منظور او کثرت است، بلکه منظور او چیزی است که متناهی نیست، در زاویه‌ای از زوایای قلب عارف قرار گیرد، آن را احساس نمی‌کند. یعنی به دلیل وسعتش که حق (الحق) را گنجایش داده است. و از اینجاست که گفتیم قلب عارف از رحمت خدا وسیع‌تر است، زیرا رحمت خدا به خدا نمی‌رسد و او را در بر نمی‌گیرد، در حالی که قلب بنده او را گنجایش داده است. مگر اینکه در این امر نکته‌ای است که به آن اشاره می‌کنم و بر آن تصریح نمی‌کنم. و آن این است که خداوند خود را به غضب و انتقام شدید بر کسی که مورد غضب قرار گرفته، وصف کرده است. و انتقام (البطش) رحمت است، زیرا در آن تنفیس و از بین بردن غضب است. و این مقدار اشاره برای آنچه می‌خواهیم بیان کنیم کافی است. زیرا رسولان می‌گویند: «و بعد از آن، مانند آن غضب نخواهد کرد». پس انتقام رحمت و شفاست. و اگر رحمت نبود، در هستی (الوجود) واقع نمی‌شد، در حالی که واقع شده است. اما باید بدانی که وقوع انتقام برای چه کسی رحمت است. پس از اینجا مرتبه ابویزید نسبت به دیگر عارفان برای تو آشکار شد، زیرا او و امثال او جز از احوال و ذوق خود در آن احوال سخن نمی‌گویند. و از اسماء خدای تعالی *الواسع* (گسترده) است، چنانکه وارد شده است. پس به واسطه وسعتش، غضب را پذیرفت. و اگر بر او تنگ می‌آمد، حکم غضب در هستی (الوجود) ظاهر نمی‌شد، زیرا حقیقتی الهی نداشت که در وجودش به آن تکیه کند. در حالی که [غضب] موجود شده است. پس ناگزیر باید غضب به خدا نسبت داده شود، آن‌گونه که شایسته جلال اوست. و قلب حق (الحق) را گنجایش داده است، و غضب از صفات اوست، پس غضب را گنجایش داده است. پس بر عارف ایرادی نیست که با وجود اینکه جز خدا را نمی‌بیند، غضب کند و راضی شود و به اینکه آزار می‌رساند متصف شود، اگرچه خود آزرده نمی‌شود. پس آزار رساندن به کسی که آزرده نمی‌شود، آزار نیست. جز اینکه این سخن در مورد جناب الهی گفته نمی‌شود، اما او به *الصبور* (بسیار شکیبا) نامیده شده است و ما را از صبر و اینکه بر چه چیزی است، آگاه ساخته است. و ما در حق حق (الحق) نمی‌گوییم که او *حلم* (بردباری) است، زیرا *الحلیم* (بردبار) چنانکه وارد شده، *الصبور* (شکیبا) نیز وارد شده است. و برای هر واردی معنایی است که عین دیگری نیست. پس احوال بر عارفان تغییر می‌کند، همان‌گونه که صورت‌ها بر حق (الحق) تغییر می‌کند. و اگر چنین نبود، احکام در عالم تغییر نمی‌کرد، زیرا آنها از خدا در عالم ظاهر می‌شوند و او موجد و خالق آنهاست. پس ناگزیر صفت باید به او قائم باشد. و در این صورت وجود آن از او صحیح است، خواه *مُوجِد* (ایجادکننده) اسم فاعل باشد یا *مُوجَد* (ایجادشده) اسم مفعول. اگر تفویض (التفویض) را آن‌گونه که برایت ذکر کردم ندانی، در اشکالی می‌افتی که از آن رهایی نمی‌یابی، یعنی در علم به اینکه تفویض چیست. این نسبت تفویض به مخلوق است.\n\nو اما تفویض (التفویض) الهی، و آن این است که او امر خود را در آن به بندگانش واگذار کند. زیرا او آنها را مکلف ساخت و امر و نهی کرد. این تفویض امر او به بندگانش است، زیرا [تکلیف] از آنچه بر حق (الحق) واجب است، فیض کرده است، چون تکلیف در حق حق (الحق) صحیح نیست. پس چون از او فیض کرد، افاضه‌اش جز بر خلق نبود. و از آنها خواست که هنگامی که آن را به ایشان بازگرداند، به آن قیام کنند، همان‌گونه که حق (الحق) به آن قیام می‌کند، هنگامی که بنده امر خود را به خدا واگذار می‌کند. پس برخی از آنها به اخلاق خدا متخلق شدند و امر و نهی او را پذیرفتند، و او همان معصوم و محفوظ است. و برخی آن را رد کردند. و برخی آن را در زمانی و حالی پذیرفتند و در زمانی و حالی رد کردند. و همچنین امر خود را در سخن گفتن درباره او به ایشان واگذار کرد. پس گفتارهای آنها درباره خدا مختلف شد. سپس بر زبان رسولانش آنچه را که او در ذات خود بر آن است، برای آنها آشکار ساخت تا حجت بر کسی که با قول او مخالفت کرده و درباره خدا چیزی گفته که در مقابل آنچه او درباره خود گفته است، اقامه شود. پس چون گفتارها مختلف شد، بر اهل هر گفتاری بر حسب یا به صورت گفتارشان تجلی (التجلی) کرد. و سبب آن، تفویض (التفویض) امرش به ایشان و عطا کردن عقل‌ها و فکرهایی به آنها بود که با آنها بیندیشند. و به هر واگذارنده‌ای حقش را در اجتهاد به واسطه نظرش، نصیبی از پاداش عطا کرد، چه در اجتهادش خطا کرده باشد و چه صواب. زیرا او خطا نکرده است مگر در گفتاری که به زبان شرع خاص درباره خدا وارد شده است. پس با تأویلی که نظرش او را به آن رسانده، از آن منحرف شده است. و شرعی نیز وارد شده که او را در آن تأیید می‌کند. پس او گفتار را از حیثی که بر آن است ترک نکرده، بلکه در آنچه بدان رفته است، به امری مشروع و دلیل عقلی استناد کرده است. و اینکه او صواب گفته یا خطا، امری دیگر است که افزون بر اجتهاد اوست. زیرا او با اجتهادش جز دلیلی را نمی‌جوید که بر گمانش غالب شود که او را به حق (الحق) و صواب می‌رساند و نه چیز دیگر.\n\nپس تکلیف او عین تفویض (التفویض) اوست، و ما و او در آن برابر هستیم.\nپس تسبیح ما عین تسبیح اوست، و تسبیح او به زبان غیر است.\nو بهره هر کس از ذکر خدا، تنها همان چیزی است که نیت کرده است.\n\nپس تفویض (التفویض) او در قولش است: «و از آنچه شما را در آن جانشین (مُسْتَخْلَفِينَ) قرار داده، انفاق کنید» (وَأَنفِقُوا مِمَّا جَعَلَكُم مُّسْتَخْلَفِينَ فِيهِ). و تفویض ما آنجاست که به ما امر شده است که او را در آنچه ما را در آن جانشین کرده، وکیل بگیریم: «پس او را به مادرش بازگرداندیم تا چشمش روشن شود» (فَرَدَدْنَاهُ إِلَى أُمِّهِ كَيْ تَقَرَّ عَيْنُهَا). و چون عالم تحت حکم اسماء الهی است و آنها اسماء او هستند، پس تفویض او را جز او دریافت نمی‌کند، نه ما. زیرا ما آن را به واسطه اسماء او دریافت کردیم. پس او از حیث تفویضش باطن است و از حیث پذیرش آن ظاهر است. پس امر میان ما مانند نزول امر میان آسمان که بلند است و زمین که رام است، بود.\n\nپس امر چنین است، از آن نترس، زیرا هستی‌اش آن را آشکار ساخته است.\nو شاهد حق (الحق) به آن گویاست، زیرا او در هستی‌اش عین آن است.\n\nو این همان است که ذکر کردیم که تفویض (التفویض) حق (الحق) را جز اسم او دریافت نکرد. پس او هم مکلف است و هم مکلف‌شده، زیرا فرمود: «و بازگشت همه امور به سوی اوست» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ). پس او عین موجودات است، زیرا او هستی (الوجود) است. و «خدا حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ). و سخن در این باب طولانی می‌شود و در هم می‌آمیزد و برخی بر برخی دیگر عطف می‌شود، پس آشکار و پنهان می‌گردد. زیرا او خدایی است که جز او معبودی نیست. «برای خداست نام‌های نیکو (الْأَسْمَاءُ الْحُسْنَى)» (لِلَّهِ الْأَسْمَاءُ الْحُسْنَى). منزه و متعالی است از آنچه ستمکاران می‌گویند، تعالی بزرگی."
  },
  "page_count": 3
}