{
  "id": 449,
  "title": {
    "ar": "الباب التاسع والأربعون وأربعمائة في معرفة منازلة قول من قال عن الله ليس عبدي من تعبد عبدي",
    "en": "Chapter Four Hundred and Forty-Nine: Concerning the Knowledge of the Spiritual Station of the Saying Attributed to Allah: \"He who enslaves My servant is not My servant.\"",
    "ur": "باب چار سو انچاس: اس قول کی منزلت کی معرفت میں جو اللہ کی طرف سے کہا گیا: \"میرا بندہ وہ نہیں جو میرے بندے کی عبادت کرے\"",
    "fa": "باب چهارصد و چهل و نهم (۴۴۹) در معرفت جایگاه (منازلة) سخن کسی که از جانب حق (الحق) گفت: «بنده من نیست کسی که بنده مرا پرستید.»"
  },
  "content": {
    "ar": "## «الباب التاسع والأربعون وأربعمائة في معرفة منازلة قول من قال عن الله ليس عبدي من تعبد عبدي»\n\n\n> العبد من لا عبد له *** سبحانه ما أكمله‏\n\n\n> قد جمع الله له *** كل وجود أمله‏\n\n\n> مشتبها ومحكما *** مجملة مفصله‏\n\n\n> سواه إذ عدله *** وبعد هذا فصله‏\n\n\n> بكل عين أشهده *** بكل علم فضله‏\n\n\n> فإنما أنابه *** في كل أحوالي وله‏\n\n\n> حزنا الكمال كله *** أنا وهو والكل له‏\n\n\n### [أحوال العبد على قسمين ذاتية وعرضية]\n\n\nقال عز وجل لمحمد قُلْ إِنَّ الْأَمْرَ كُلَّهُ لِلَّهِ فقلنا الأمر كله لله أَلا لَهُ الْخَلْقُ والْأَمْرُ فهو الخلق والأمر اعلم أنه لا يملك المملوك‏\nإلا سيده ولهذا يسمى الترمذي الحكيم الحق سبحانه ملك الملك غير سيده ما يملك عبد فإن العبد في كل حال يقصد سيده فلا يزال يصرف سيده بأحواله في جميع أموره ولا معنى للملك إلا التصريف بالقهر والشدة ومهما لم يقم السيد بما يطلبه به العبد فقد زالت سيادته من ذلك الوجه وأحوال العبد على قسمين ذاتية وعرضية وهو بكل حال منها يتصرف في سيده والكل عبيد الله فمن كان دني‏ء الهمة قليل العلم كثيف الحجاب غليظ القفا ترك الحق وتعبد عبيد الحق فنازع الحق في ربوبيته فخرج من عبوديته فهو وإن كان عبدا في نفس الأمر فليس هو بعبد مصطنع ولا مختص فإذا لم يتعبد أحدا من عباد الله كان عبدا خالصا لله فتصرف في سيده بجميع أحواله فلا يزال الحق في شأن هذا العبد خلاقا على الدوام بحسب انتقالاته في الأحوال‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم خادم القوم سيدهم‏\n\n\nلأنه القائم بأمورهم لأنهم عاجزون عن القيام بما تقتضيه أحوالهم فمن عرف صورة التصريف عرف مرتبة السيد من مرتبة العبد فيتصف العبد بامتثال أمر سيده والسيد بالقيام بضرورات عبده فلا يتفرغ العبد مع ما قررناه من حاله مع حال سيده إن يقتنى عبدا يتصرف فيه لأنه يشهد عيانا إن ذلك العبد الآخر يتصرف في سيده تصرفه فيعلم أنه مثله عبد لله وإذا كان عبدا لله لم يصح أن يتعبده هذا العبد فما ملك عبد إلا بحجاب لقيت سليمان الدنبلي فأخبرني في مباسطة كانت بيني وبينه في العلم الإلهي فقلت له أريد أن أسمع منك بعض ما كان بينك وبين الحق من المباسطة فقال نعم باسطني يوما في سري في الملك فقال لي إن ملكي عظيم فقلت له ملكي أعظم من ملكك فقال لي كيف تقول فقلت له مثلك في ملكي وليس مثلك في ملكك فمن أعظم ملكا فقال صدقت أشار إلى التصريف بالحال والأمر وهو ما قررناه فإذا علمت هذا علمت قدرك ومرتبتك ومعنى ربوبيتك وعلى من تكون ربا في عين عبد وهو بالعلم قريب وبالحال أقرب وألذ في الشهود والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Forty-Nine concerning the knowledge of the station of the saying attributed to God: \"My servant is not he who serves My servant.\"\n\nThe servant (العبد) is he who has no servant of his own;\nGlory be to Him (سبحانه), how perfect He is!\n\nGod has gathered for him\nEvery existence (وجود) that he hoped for:\n\nThat which is ambiguous (مشتبها) and that which is decisive (محكما),\nThat which is summarized and that which is detailed.\n\nHe made him equal when He fashioned him,\nAnd after this, He distinguished him.\n\nBy every eye (عين), He made him witness (أشهده),\nBy every knowledge (علم), He favored him.\n\nFor He only deputized him\nIn all my states and His.\n\nWe have attained all perfection (الكمال كله):\nI am He, and He is I, and the All (الكل) belongs to Him.\n\n### [The States of the Servant are of Two Kinds: Essential (ذاتية) and Accidental (عرضية)]\n\nThe Mighty and Majestic said to Muhammad: \"Say: <<إِنَّ الْأَمْرَ كُلَّهُ لِلَّهِ>> (Indeed, the command belongs entirely to Allah).\" So we say: The command belongs entirely to Allah. <<أَلا لَهُ الْخَلْقُ والْأَمْرُ>> (Unquestionably, to Him belongs the creation and the command). Thus, He is the Creation (الخلق) and the Command (الأمر).\n\nKnow that the possessed (المملوك) is owned only by his master. For this reason, Al-Tirmidhi the Sage (الحكيم) calls The Real (الحق), glorified be He, the King of Kings (ملك الملك). A servant does not own anything other than his master. For the servant, in every state, intends his master, and thus he constantly directs (يصرف) his master through his states (أحواله) in all his affairs. The meaning of ownership (الملك) is nothing but direction (التصريف) through compulsion and intensity. Whenever the master fails to fulfill what the servant demands of him, his mastery (سيادته) has vanished from that perspective.\n\nThe states of the servant are of two kinds: essential (ذاتية) and accidental (عرضية), and in every one of these states, he directs his master. All are servants of Allah. Whoever is base in aspiration (دنيء الهمة), meager in knowledge (قليل العلم), thick in veiling (كثيف الحجاب), and stiff-necked, abandons The Real and serves the servants of The Real. He thus contends with The Real concerning His Lordship (ربوبيته) and departs from his servitude (عبوديته). Although he is a servant in reality (في نفس الأمر), he is neither a specially chosen servant (مصطنع) nor a distinguished one (مختص). But if he does not serve any of the servants of God, he is a servant purely (خالصا) for God. He then directs his Master through all his states, and The Real remains perpetually a Creator (خلاقا) concerning this servant, according to the servant's transitions between states.\n\nThe Prophet, peace and blessings be upon him, said: \"The servant (خادم) of the people is their master (سيدهم).\" This is because he is the one who manages their affairs, as they are incapable of managing what their states require. Whoever knows the form of direction (التصريف) knows the level (مرتبة) of the Master from the level of the servant. The servant is characterized by obeying the command of his Master, and the Master by fulfilling the necessities of His servant.\n\nGiven what we have established regarding the servant's state in relation to his Master's state, the servant is not free to acquire a servant whom he directs, because he witnesses directly (عيانا) that the other servant directs his master just as he directs his own Master. Thus, he knows that the other is a servant of God just like himself. And if he is a servant of God, it is not valid for this servant (the first one) to take him as a servant. A servant only owns (ملك) another through a veil (حجاب).\n\nI met Sulayman al-Dunbuli, and he informed me, during a friendly discussion (مباسطة) between us concerning Divine Knowledge (العلم الإلهي). I said to him, \"I wish to hear from you some of the friendly discussions that took place between you and The Real (الحق).\" He said, \"Yes, one day He engaged me in a friendly discussion in my secret heart (سري) concerning dominion (الملك). He said to me, 'My dominion is vast.'\" I said to Him, \"My dominion is vaster than Yours.\" He said to me, \"How can you say that?\" I replied, \"Your likeness is in my dominion, but my likeness is not in Your dominion. So, whose dominion is vaster?\" He said, \"You have spoken the truth.\" He was referring to the direction through state (الحال) and command (الأمر), which is what we have established.\n\nIf you know this, you will know your worth, your station (مرتبتك), the meaning of your lordship (ربوبيتك), and over whom you are a lord while simultaneously being a servant (عبد). This is near through Knowledge (العلم), and nearer and sweeter in Witnessing (الشهود) through state. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو انچاس (449): اس شخص کے قول کے مقام کی معرفت میں جس نے اللہ کی طرف سے کہا: \"میرا بندہ وہ نہیں جو میرے بندے کی بندگی کرے\"\n\nبندہ وہ ہے جس کا کوئی بندہ نہ ہو *** پاک ہے وہ (ذات حق - الحق)، وہ کتنا کامل ہے!\nاللہ نے اس کے لیے جمع کر دیا *** ہر وہ ہستی (الوجود) جس کی اس نے آرزو کی\nمشتبہ اور محکم (آیات)، *** مجمل اور مفصل (معانی)\nاسے برابر کیا جب اس نے اسے معتدل کیا *** اور اس کے بعد اسے جدا جدا بیان کیا\nہر آنکھ سے اسے (شہود - الشہود) کرایا *** ہر علم سے اسے فضیلت دی\nپس اس نے اسے اپنا نائب بنایا *** میرے تمام احوال میں اور اس کے لیے\nاس نے تمام کمال کو حاصل کیا *** میں، وہ، اور سب کچھ اسی (ذات حق - الحق) کے لیے ہے۔\n\n### [بندے کے احوال دو قسموں پر ہیں: ذاتی اور عرضی]\n\nاللہ عز وجل نے محمد (صلی اللہ علیہ وسلم) سے فرمایا: قُلْ إِنَّ الْأَمْرَ كُلَّهُ لِلَّهِ (کہہ دیجیے کہ سب اختیار اللہ ہی کا ہے)۔ پس ہم نے کہا کہ سب اختیار اللہ ہی کا ہے۔ أَلا لَهُ الْخَلْقُ والْأَمْرُ (خبردار! اسی کے لیے ہے خلق اور امر)۔ پس وہ (الحق) ہی خلق اور امر ہے۔ جان لو کہ مملوک (غلام) صرف اپنے آقا کا مالک ہوتا ہے۔ اسی لیے حکیم ترمذی نے ذات حق (الحق) سبحانہ کو \"ملک الملک\" (بادشاہ کا بادشاہ) کہا ہے۔ اپنے آقا کے علاوہ کوئی بندہ کسی چیز کا مالک نہیں ہوتا۔ کیونکہ بندہ ہر حال میں اپنے آقا کا قصد کرتا ہے۔ پس وہ ہمیشہ اپنے احوال کے ذریعے اپنے آقا کو اپنے تمام معاملات میں تصرف (تصرف) کرواتا رہتا ہے۔ اور ملکیت کا کوئی معنی نہیں سوائے قہر اور شدت کے ساتھ تصرف (تصرف) کرنے کے۔ اور جب بھی آقا وہ کام نہ کرے جو بندہ اس سے طلب کرتا ہے، تو اس پہلو سے اس کی سیادت (آقائی) ختم ہو جاتی ہے۔\n\nاور بندے کے احوال دو قسموں پر ہیں: ذاتی اور عرضی۔ اور وہ ان میں سے ہر حال کے ذریعے اپنے آقا میں تصرف (تصرف) کرتا ہے۔ اور سب اللہ کے بندے ہیں۔ پس جو شخص پست ہمت، کم علم، کثیف حجاب (حجاب) والا، اور سخت گردن والا ہو، وہ ذات حق (الحق) کو چھوڑ دیتا ہے اور حق کے بندوں کی بندگی کرتا ہے۔ پس وہ ذات حق (الحق) کی ربوبیت میں جھگڑا کرتا ہے اور اپنی عبودیت سے نکل جاتا ہے۔ پس اگرچہ وہ نفسِ امر میں بندہ ہے، لیکن وہ نہ تو چنا ہوا بندہ ہے اور نہ ہی خاص بندہ ہے۔ پس جب وہ اللہ کے بندوں میں سے کسی کی بندگی نہیں کرتا، تو وہ اللہ کا خالص بندہ ہوتا ہے۔ پس وہ اپنے تمام احوال کے ذریعے اپنے آقا میں تصرف (تصرف) کرتا ہے۔ پس ذات حق (الحق) ہمیشہ اس بندے کے معاملے میں، اس کے احوال میں تبدیلیوں کے مطابق، مسلسل خالق (خلاق) رہتا ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: خادم القوم سيدهم (قوم کا خادم ان کا سردار ہوتا ہے)۔ کیونکہ وہ ان کے معاملات کا ذمہ دار ہوتا ہے، اس لیے کہ وہ ان چیزوں کو انجام دینے سے عاجز ہوتے ہیں جن کا ان کے احوال تقاضا کرتے ہیں۔ پس جس نے تصرف (تصرف) کی صورت کو پہچان لیا، اس نے آقا کے مرتبے کو بندے کے مرتبے سے پہچان لیا۔ پس بندہ اپنے آقا کے حکم کی تعمیل سے متصف ہوتا ہے، اور آقا اپنے بندے کی ضروریات کو پورا کرنے سے متصف ہوتا ہے۔\n\nپس بندہ، اپنے اور اپنے آقا کے حال کے بارے میں جو کچھ ہم نے بیان کیا ہے، اس کے باوجود، اس بات کے لیے فارغ نہیں ہوتا کہ وہ کوئی ایسا بندہ رکھے جس میں وہ تصرف (تصرف) کرے۔ کیونکہ وہ کھلی آنکھوں سے (شہود - الشہود) کرتا ہے کہ وہ دوسرا بندہ بھی اپنے آقا میں اسی طرح تصرف (تصرف) کر رہا ہے۔ پس وہ جانتا ہے کہ وہ بھی اسی کی طرح اللہ کا بندہ ہے۔ اور جب وہ اللہ کا بندہ ہے، تو اس بندے کے لیے یہ درست نہیں کہ وہ اس کی بندگی کرے۔ پس کسی بندے نے ملکیت حاصل نہیں کی مگر حجاب (حجاب) کے ذریعے۔\n\nمیں سلیمان الدنبلی سے ملا، تو انہوں نے مجھے اس بے تکلف گفتگو کے بارے میں بتایا جو میرے اور ان کے درمیان علم الٰہی میں ہوئی تھی۔ میں نے ان سے کہا کہ میں آپ سے وہ کچھ سننا چاہتا ہوں جو آپ کے اور ذات حق (الحق) کے درمیان بے تکلف گفتگو ہوئی تھی۔ انہوں نے کہا: ہاں، ایک دن میرے باطن میں ذات حق (الحق) نے ملکیت کے بارے میں مجھ سے بے تکلف گفتگو کی۔ اس نے مجھ سے کہا: \"بے شک میری بادشاہت عظیم ہے۔\" تو میں نے اس سے کہا: \"میری بادشاہت تیری بادشاہت سے زیادہ عظیم ہے۔\" اس نے مجھ سے کہا: \"تم یہ کیسے کہتے ہو؟\" تو میں نے اس سے کہا: \"تیری مثال میری بادشاہت میں ہے، لیکن تیری مثال تیری بادشاہت میں نہیں ہے۔ پس کس کی بادشاہت زیادہ عظیم ہے؟\" اس نے کہا: \"تم نے سچ کہا۔\"\n\nاس نے حال اور امر کے ذریعے تصرف (تصرف) کی طرف اشارہ کیا، اور یہی وہ بات ہے جسے ہم نے ثابت کیا ہے۔ پس جب تم یہ جان لو گے، تو تم اپنی قدر، اپنا مرتبہ، اور اپنی ربوبیت کا معنی جان لو گے۔ اور یہ بھی جان لو گے کہ تم بندہ ہونے کے باوجود کس پر رب ہو۔ اور یہ (معرفت - المعرفۃ) علم کے لحاظ سے قریب ہے، اور حال کے لحاظ سے (شہود - الشہود) میں زیادہ قریب اور لذیذ ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و چهل و نهم در معرفت جایگاه (منازلة) سخن کسی که از جانب خداوند گفت: «بنده من نیست کسی که بنده مرا بندگی کند.»\n\nبنده کسی است که بنده (مملوک) ندارد،\nپاک و منزه است او، چه کامل است!\nخداوند برای او گرد آورده است،\nهر هستی (الوجود) که آرزویش را داشت.\nهم متشابه و هم محکم،\nهم اجمالی و هم تفصیلی.\nاو را تسویه کرد آنگاه که معتدلش ساخت،\nو پس از آن، او را تفصیل داد.\nبا هر چشمی او را به شهود (الشهود) رساند،\nبا هر دانشی او را برتری بخشید.\nپس او را در تمامی احوال و حالاتش،\nبه نیابت از خود قرار داد.\nما تمامی کمال را به دست آوردیم،\nمن و او، و همه چیز از آنِ اوست.\n\n[احوال بنده بر دو قسم است: ذاتی و عرضی]\n\nخداوند عز و جل به محمد (ص) فرمود: «بگو: همانا همه کارها از آنِ خداست.» (قُلْ إِنَّ الْأَمْرَ كُلَّهُ لِلَّهِ) پس ما گفتیم: همه کارها از آنِ خداست. «آگاه باشید که آفرینش و امر از آنِ اوست.» (أَلا لَهُ الْخَلْقُ والْأَمْرُ) پس او هم آفرینش (خلق) است و هم امر. بدان که مملوک (بنده) جز مالک خود را مالک نیست. و به همین دلیل، ترمذی حکیم، حق سبحانه (الحق) را «مالکِ ملک» نامید؛ بنده جز مالک خود را مالک نیست. زیرا بنده در هر حالی قصد مالک خود را دارد، پس پیوسته مالک خود را با احوالش در تمامی امورش به تصرف وامی‌دارد. و معنای مالکیت جز تصرف با قهر و شدت نیست. و هرگاه مالک به آنچه بنده از او می‌طلبد قیام نکند، سیادت (سروری) او از آن جهت زائل شده است. و احوال بنده بر دو قسم است: ذاتی و عرضی، و او در هر حالی از این احوال، در مالک خود تصرف می‌کند. و همه بندگان خدا هستند. پس هر کس که همت پست، دانش اندک، حجاب غلیظ و گردن ستبر داشته باشد، حق (الحق) را ترک کرده و بندگان حق را بندگی می‌کند. پس با حق (الحق) در ربوبیتش به نزاع برخاسته و از عبودیت (بندگی) خود خارج شده است. او اگرچه در نفسِ امر بنده است، اما بنده برگزیده و خاص نیست. پس اگر هیچ یک از بندگان خدا را بندگی نکند، بنده خالص برای خدا خواهد بود و با تمامی احوالش در مالک خود تصرف می‌کند. پس حق (الحق) پیوسته در شأن این بنده، بر اساس انتقال او در احوال، به طور دائم خالق (خلاق) است.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «خادم قوم، سید (سرور) آنهاست.»\n\nزیرا اوست که به امور آنان قیام می‌کند، چون آنان از انجام آنچه احوالشان اقتضا می‌کند، عاجزند. پس هر کس صورت تصرف را بشناسد، مرتبه مالک را از مرتبه بنده باز می‌شناسد. پس بنده به امتثال امر مالک خود متصف می‌شود و مالک به قیام به ضروریات بنده خود. بنابراین، بنده با توجه به آنچه از حال او با حال مالکش مقرر کردیم، فرصت نمی‌یابد که بنده دیگری را به ملکیت درآورد تا در او تصرف کند. زیرا او به عیان (شهود) می‌بیند که آن بنده دیگر نیز همانند او در مالک خود تصرف می‌کند. پس می‌داند که او نیز مانند خودش بنده خداست، و چون بنده خداست، صحیح نیست که این بنده او را بندگی کند. پس بنده، جز به واسطه حجاب، مالک نمی‌شود. سلیمان دنبلی را ملاقات کردم، و او در مباسطه‌ای (گفتگوی صمیمانه) که میان من و او در علم الهی بود، به من خبر داد. به او گفتم: می‌خواهم برخی از مباسطه‌هایی که میان تو و حق (الحق) بوده است را بشنوم. گفت: آری، روزی در سرّ من در مورد ملک (مالکیت) با من مباسطه کرد و به من گفت: «ملک من عظیم است.» من به او گفتم: «ملک من از ملک تو عظیم‌تر است.» او به من گفت: «چگونه چنین می‌گویی؟» گفتم: «مانند تو در ملک من است، ولی مانند من در ملک تو نیست. پس ملک کدام یک عظیم‌تر است؟» گفت: «راست گفتی.» او به تصرف با حال و امر اشاره کرد، و این همان چیزی است که ما مقرر کردیم. پس چون این را دانستی، قدر و مرتبه خود و معنای ربوبیتت را دانستی، و اینکه بر چه کسی در عین بندگی، رب خواهی بود. و این (معرفت) به واسطه علم نزدیک است، و به واسطه حال، نزدیک‌تر و در شهود (الشهود) لذت‌بخش‌تر است. و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}