{
  "id": 387,
  "title": {
    "ar": "الباب السابع والثمانون وثلاثمائة في معرفة منازل التواضع الكبريائي",
    "en": "Chapter Three Hundred and Eighty-Seven: Concerning the Gnosis of the Stations of Majestic Humility (التواضع الكبريائي)",
    "ur": "باب تین سو ستاسی (۳۸۷): کبریائی تواضع (التواضع الكبريائي) کی منازل (منازل) کی معرفت (المعرفۃ) کے بیان میں",
    "fa": "باب سیصد و هشتاد و هفتم در معرفت منازل تواضع کبریایی"
  },
  "content": {
    "ar": "## «الباب السابع والثمانون وثلاثمائة في معرفة منازل التواضع الكبريائي»\n\n\n> من هاله ما هو من جنسه *** فهو جهول ضل عن نفسه‏\n\n\n> لو أنه يعرف أوصافه *** ما هاله ما هو من جنسه‏\n\n\n> وكل ما في الجود فيه فمن *** دجى الليالي وسنا شمسه‏\n\n\n> وكل ما في الكون فيه فمن *** نزوله الأدنى ومن قدسه‏\n\n\n> وانظر فأنت الأمر فأثبت على *** علم ولا تنظر إلى حدسه‏\n\n\n### [إن الله نزل نفسه منزلة عباده‏]\n\n\nقال تبارك وتعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وقال وما قَدَرُوا الله حَقَّ قَدْرِهِ وقال تعالى سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وقال ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ وهُوَ الْعَزِيزُ الْحَكِيمُ وقال فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ ومع هذا كله‏\n\n\nفهو القائل في الصحيح من الأخبار عنه مرضت فلم تعدني وجعت فلم تطعمني وظمأت فلم تسقني‏\n\n\nيقول مثل هذا القول لعبده فأنزل نفسه هنا منزلة عباده وأين ذلك الكبرياء من هذا النزول وثبت في الصحيح أن الله يعجب من الشاب ليست له صبوة\n\n\nوثبت أن الله أفرح بتوبة عبده من فرح صاحب الناقة التي عليها طعامه وشرابه إذا وجدها بعد ما ضلت وهو في فلاة من الأرض منقطعة وأيقن بالموت ففرح بها فالله أفرح بتوبة عبده من هذا بناقته‏\n\n\nوثبت عنه أنه تعالى يتبشبش للذي يأتي المسجد كما يتبشبش أهل الغائب بغائبهم إذا ورد عليهم‏\n\n\nوأين هذا كله من قوله تعالى سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وسَلامٌ عَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ وما قَدَرُوا الله حَقَّ قَدْرِهِ فأين هذا النزول من هذه الرفعة فهذا هو التواضع الكبريائي وكل حق وقول صدق وحكم صحيح لمن كشف الله عن بصيرته من علماء عباده فأراه الحق حقا وأراه الباطل باطلا وهنا تعلقت الرؤية بالمعدوم فإن الباطل عدم وإذا كان العبد يتصف برؤية المعدوم فالحق أولى بهذه الصفة أنه يرانا في حال عدمنا رؤية عين وبصر لا رؤية علم وأما قوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فهو على الصحيح من الفهم معنى‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إن الله خلق آدم على صورته‏\n\n\nفي بعض وجوه محتملات هذا الخبر وقوله تعالى لَقَدْ خَلَقْنَا الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ فما ذاك إلا لخلقه على صورة الحق وإنما رده إلى أسفل سافلين ليجمع له كمال الصورة بالأوصاف كما ذكر عن نفسه أنه عليه فإن اتصافه بنفي المثل عن نفسه من اتصافه بالحد والمقدار\nمن استواء ونزول واستعطاف وتلطف في خطاب وغضب ورضاء وكلها نعوت المخلوق فلو لم يصف نفسه بنعوتنا ما عرفناه ولو لم ينزه نفسه عن نعوتنا ما عرفناه فهو المعروف في الحالين والموصوف بالصفتين ولهذا خلق من كل شي‏ء زوجين ليكون لأحد الزوجين العلو وهو الذكر ولأحد الزوجين السفل وهو الأنثى ليظهر من بينهما إذا اجتمعا بقاء أعيان ذلك النوع وجعل ذلك في كل نوع نوع ليعلمنا أن الأمر في وجودنا على هذا النحو فنحن بينه وبين معقولية الطبيعة التي أنشأ منها الأجسام الطبيعية وأنشأ من نسبة توجهه عليها الأرواح المدبرة وكل ما سوى الله لا بد أن يكون مركبا من راكب ومركوب ليصح افتقار الراكب إلى المركوب وافتقار المركوب إلى الراكب لينفرد سبحانه بالغنى كما وصف نفسه فهو غني لنفسه ونحن أغنياء به في عين افتقارنا إليه فما لا نستغني عنه فكل ما سوى الله مدبر ومدبر لهذا المدبر فالمدبر اسم فاعل بما هو مدبر يجد ذلك قوة في ذاته يفتقر إلى مدبر يظهر فيه تدبيره ولا مدبر اسم مفعول بما هو مدبر يجد ذلك حالة في ذاته يفتقر بها إلى من يدبر ذاته لصلاح عينه وبقائه ففقر كل واحد إلى الآخر فقر ذاتي وإنما يتصف بالغنى عنه لكونه لا يفتقر إلا إلى مدبر لا إلى هذا المدبر بعينه كما إن المدبر يتصف بالغنى لكونه لا يفتقر إلا إلى مدبر لا إلى هذا المدبر بعينه فكل واحد منهما غني عن الآخر عينه لا عن التدبير منه وفيه فغني كل واحد ليس على الإطلاق وغناء الحق مطلق بالنظر إلى ذاته والخلق مفتقر على الإطلاق بالنظر أيضا إلى ذاته فتميز الحق من الخلق ولهذا كفر من قال إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ فهذا التمييز لا يرتفع أبدا لأنه تميز ذاتي في الموصوف به من حق وخلق فما ثم إلا شيئيتان شيئية حق وشيئية خلق فليس كمثل الخلق في افتقاره شي‏ء لأنه ما ثم إلا الحق والحق لا يوصف بالافتقار فما هو مثل الخلق فليس مثل الخلق شي‏ء وليس كمثل الحق في غناه شي‏ء لأنه ما ثم إلا الخلق والخلق لا يتصف بالغنى لذاته فما هو مثل الحق فليس مثل الحق شي‏ء لأنه كما قلنا ما ثم شي‏ء إلا الخلق والحق فالخلق من حيث عينه ذات واحدة في كثير والحق من حيث ذاته وعينه ذات واحدة لها أسماء كثيرة ونسب فمن لم يعلم قوله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ على ما قررناه فلا علم له بهذه الآية فإنه جاء بالكاف ثم نفى المثلية عن نفسه بزيادة الكاف للتأكيد في النفي ثم نفى المثلية عن العالم بجعل الكاف صفة فعلق النفي بالمماثل في النفي أي انتفت عن الخلق المثلية لأنه ما ثم إلا حق لا يماثل وانتفت عن الحق المثلية لأنه ما ثم إلا خلق لا يماثل‏\n\n\n> فهكذا تفهم المعاني *** إذا جاءنا النور بالبيان‏\n\n\n> فليس في أكون غير فرد *** حق وإن شئتم اثنتان‏\n\n\n> وكل عين لها انفراد *** بذاتها لا ترى بثاني‏\n\n\n> وقد أتى في الصلاة حكم *** منه بتقسيمه المثاني‏\n\n\n> فميز الخلق عنه فيها *** لأجل ذا لاحت اثنتان‏\n\n\n> فقال بيني وبين عبدي *** فمن رآه فقد رآني‏\n\n\n> فلست غير إله ولا هو *** لوحدتي في الوجود ثاني‏\n\n\n> ترجم عنه لسان خلق *** بما ذكرنا من البيان‏\n\n\nوأما قوله وما قَدَرُوا الله حَقَّ قَدْرِهِ وهو الذي أنطقهم بما نطقوا به فيه فإنه يقول عن المشهود عليهم إنهم قالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا قالُوا أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ فما من شي‏ء ينطق إلا والله أنطقه واختلف المنطوق به فثم نطق أي منطوق به يتعلق به مديح وثم منطوق به يتعلق به دم وثم منطوق به يتعلق به تجوز لتواطئ جعله الله في العالم وثم منطوق به على ما هو المدلول عليه في نفسه فهو إخبار عن حقيقة وما ثم إلا ما ذكرناه فنطق المدح شهادة أولي العلم بتوحيد الله ونطق الذم قول القائل إِنَّ الله فَقِيرٌ ويَدُ الله مَغْلُولَةٌ يريد البخل ونطق بالحقيقة والله خَلَقَكُمْ ونطق بالتجوز للتواطئ وما تَعْمَلُونَ والآية واحدة فأما قوله وما قَدَرُوا الله حَقَّ قَدْرِهِ لكونهم ليسوا مثله فما عرفوه ومن جهل أمره لا يقدر قدره فهم ليسوا له بمثل ولا هو مثل لهم فوصفوه بنفوسهم وبما هم عليه ولا يتمكن‏\n\n\nلهم إلا ذلك لأنهم‏\nيريدون الوصف الثبوتي ولا يكون إلا بالتشبيه ومن جعل مثل لمن لا يقبل المثل فما قدره حق قدره أي ما أنزله المنزلة التي يستحقها فذمهم بالجهل حيث تعرضوا لما ليس لهم به علم من نفوسهم فلو قالوا فيه بما أنزله إليهم لم يتعلق بهم ذم من قبل الحق في ذلك لأن الحاكي لا ينسب إليه ما حكاه فلا يتعلق به ذم في ذلك ولا مدح فعلم الخلق بالله لا يدرك بقياس وإنما يدرك بالبقاء السمع لخطاب الحق إما بنفسه وإما بلسان المترجم عنه وهو الرسول مع الشهود الذي لا يسعه معه غير ما سمعه من الخطاب كما قال إِنَّ في ذلِكَ إشارة لما تقدم لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ فأحال على النظر الفكري بتقلب الأحوال عليه أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ وما عدا هذين الصنفين فلا طريق لهم إلى العلم بما يستحقه الحق أن يضاف إليه وما يستحقه الخلق أن يضاف إليهم فمن عرف نفسه فإنه لا يماثله الحق ومن عرف ربه فإنه لا يماثله الخلق إذ معرفتكم بجزء واحد من العالم من كونه دليلا عين معرفتك بالعالم كله فلهذا أنزلنا العالم منزلة الواحد فنفينا عنه المثلية إذ ما ثم في الوجود إلا الحق والحق ما هو مثل للعالم وإن كان العالم يماثل بعضه بعضا كما تحكم في الأسماء الإلهية في الغافر والغفور والغفار وأمثال هذا بأنها أمثال وإن تميزت بمراتب كالعالم فإن فيه أمثالا وإن تميزت بالأعيان والمراتب ولهذا ما نزلت هذه الآيات إلا في مقابلة قول كان منهم ورد ذلك في الخبر النبوي وأما في القرآن فقوله وما قَدَرُوا الله حَقَّ قَدْرِهِ إِذْ قالُوا ما أَنْزَلَ الله عَلى‏ بَشَرٍ من شَيْ‏ءٍ مع إقرارهم أن التوراة نزلت على موسى عليه السلام من عند الله فكذبوا على الله فاسودت وجوههم أي ذواتهم فلا نور لهم يكشفون به الأشياء بل هم عمي فهم لا يبصرون وأما قوله سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا\n\n\nيَصِفُونَ وسَلامٌ عَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ فهذه آية ما نزل عند العارفين أشكل منها لما فيها من التداخل فدخل تحت قوله تَعالى‏ في تنزيه نفسه عَمَّا يَصِفُونَ ما يصفه به عباده مما تعطيهم أدلتهم في زعمهم بالنظر الفكري كل على حياله وكل واحد يدعي التنزيه لخالقه في ذلك فأما الفيلسوف فنفى عنه العلم بمفردات العالم الواقعة في الحس منهم فلا يعلم عندهم أن زيد بن عمرو حرك أصبعه عند الزوال مثلا ولا إن عليه في هذا الوقت ثوبا معينا لكن يعلم أن في العالم من هو بهذه الصفة مطلقا من غير تعيين لأن حصول هذا العلم على التعيين إنما هو للحس والله منزه عن الحواس فقد اندرج عندهم هذا العلم بهذا الجزء في العلم الكل الذي هو أن في العالم من هو بهذه المثابة وقد حصل المقصود عندهم وفاتهم بذلك علم كبير فإن صاحب هذه الحركة المعينة من الشخص المعين يجوز أن تقوم بغيره فبأي شي‏ء تقوم الحجة لله على تعيين هذا العبد حتى قرره عليها في الآخرة أو حرمه ما ينبغي له في الدنيا أو لم يتحرك بتلك الحركة وإن كان من أصل صاحب هذا النظر إنكار الآخرة المحسوسة وإنكار الوهب في الدنيا والجزاء الصاحب هذه الحركة على التعيين وإن من مذهبه أن تلك الحركة هي المانعة لذاتها أن يحصل لهذا المتحرك بها ما تمنعها حقيقة تلك الحركة فهو بان على أصل فاسد وهو أن الله ما صدر عنه إلا ذلك الواحد الأول لأحديته ثم انفعل العالم بعضه عن بعض عن غير تعلق علم من الله تفصيلي بذلك بل بالعلم الكل الذي هو عليه وأما المتكلم مثل الأشعري فانتقل في تنزيهه عن التشبيه بالمحدث إلى التشبيه بالمحدث فقال مثلا في استواءه على العرش إنه يستحيل عليه أن يكون استواءه استواء الأجسام لأنه ليس بجسم لما في ذلك من الحد والمقدار وطلب المخصص المرجح للمقادير فيثبت له الافتقار بل استواءه كاستواء الملك على ملكه وأنشدوا في ذلك استشهادا على ما ذهبوا إليه من الاستواء\n\n\n> قد استوى بشر على العراق *** من غير سيف ودم مهراق‏\n\n\nفشبهوا استواء الحق على العرش باستواء بشر على العراق واستواء بشر محدث فشبهوه بالمحدث والقديم لا يشبه المحدث فإن الله يقول لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ والنظر الصحيح يعطي خلاف ما قالوه فقال تعالى في حق كل ناظر سُبْحانَ رَبِّكَ لمحمد صَلَّى اللهُ عَليهِ وسَلَّم ضمير هذا الكاف أي ربك الذي أرسلك إليهم لتعرفهم بما أرسلك له‏\n\n\nإليهم وأنزله بوساطتك عليهم رَبِّ الْعِزَّةِ أي هو الممتنع لنفسه أن يقبل ما وصفوه به في نظرهم وحكموا عليه بعقولهم وأن الحق لا يحكم عليه خلق والعقل والعاقل خلق وإنما يعرف الحق من الحق بما أنزله إلينا أو أطلعنا عليه كشفا وشهودا بوحي إلهي أو برسالة رسول ثبت صدقه وعصمته فيما يبلغه عن الله إلينا عَمَّا يَصِفُونَ من حيث نظروا بفكرهم واستدلوا\nبعقولهم إذ العلم بالله لا يقبل التحول إلى الجهل ولا الدخول عليه بالشبه وما من دليل عقلي إلا ويقبل الدخول والشبهة ولهذا اختلف العقلاء فكل واحد من المخالفين عنده دليل مخالفه شبهة لمخالفه لكونه خالف دليل هذا الآخر فعين أدلتهم كلهم هي عين شبهاتهم فأين الحق وأين الثقة وأصل الفساد إنما وقع من حيث حكموا الخلق على الحق الذي أوجدهم ثم قال وسَلامٌ عَلَى الْمُرْسَلِينَ وما جاءت الرسل عليه السلام إلا بما أحالته هذه الأدلة النظرية وبما أثبتته فصدقهم في نظرهم وأكذبهم في نظرهم فوقعت الحيرة عند هؤلاء فإذا سلموا له ما قاله عن نفسه على ألسنة رسله وانقادوا إليهم فإن انقيادهم إليهم ينزلهم منزلتهم فإنهم ما انقاد وإليهم من حيث أعيانهم فإنهم أمثالهم وإنما انقادوا إلى الذي جاءوا من عنده ونقلوا عنه ما أخبر به عن نفسه على ما يعلم نفسه لا على تأويل من وصل إليه ذلك فلا يعلم مراد الله فيه إلا بإعلام الله فيقف الناظر موقف التسليم لما ورد مع فهمه فيه أنه على موضوع ما هو في ذلك اللسان الذي جاء به هذا الرسول لا بد من ذلك لأنه ما جاء به بهذا اللسان إلا لنعرف أنه على حقيقة ما وضع له ذلك اللفظ في ذلك اللسان ولكن تجهل النسبة فتسلم إليه علم النسبة مع عقلنا الدلالة بالوضع الاصطلاحي في ذلك اللحن الخاص فتنقاد إليه كما انقاد المرسلون ولهذا قال على المرسلين أي هو واجب عليهم الانقياد بقوله وسَلامٌ فنكون أمثالهم ثم قال والْحَمْدُ لِلَّهِ أي عواقب الثناء إذ كل ما جاءوا به إنما قصدوا به الثناء على الله فعواقب الثناء على الله بما نزه نفسه عنه إن الثناء على الله في ذلك كونه تعالى أنطقهم به وأوجد ذلك في نفوسهم لأن الذي قالوه يكون حقا ولا بد ولهذا قال والْحَمْدُ فإن الحمد العاقب فعواقب الثناء ترجع إلى الله وعاقب الأمر آخره ولا آخر لما قالوه إلا كونه موجودا عنه تعالى فيهم فإنه رب العالمين من حيث ثبوته في ربوبيته بما يستحقه الرب من النعوت المقدسة وهو سيد العالم ومربيهم ومغذيهم ومصلحهم لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ وأما قوله ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ‏\n\n\n### [العالم محصور في علو وسفل‏]\n\n\nاعلم أن العالم محصور في علو وسفل والعلو والسفل له أمر إضافي نسبي فالعالي منه يسمى سماء والأسفل منه يسمى أرضا ولا يكون له هاتان النسبتان إلا بأمر وسط يكون بينهما ويكون ذلك الأمر في نفسه ذا جهات فما أظله فهو سماء وما أقله فهو أرض له وإن شئت قلت في الملإ الأعلى والملإ الأسفل أنه كل ما تكون من الطبيعة فهو الملأ الأسفل وكل ما تولد من النور فهو الملأ الأعلى وأكمل العالم من جمع بينهما وهو البرزخ الذي بجهاته ميزهما أو بجمعيته ميزهما بالعلو والسفل من حيث المؤثر والمؤثر فيه اسم فاعل واسم مفعول والحق تعالى بالنظر إلى نفسه لا يتصف بشي‏ء مما يتصف به وجود العالم فالعظمة والكبرياء المنسوبان إليه في ألسنة الفهوانية أن الله لما نسب الكبرياء الذي له ما جعل محله إلا السموات والأرض فقال ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ ما قال في نفسه فالمحل هو الموصوف بالكبرياء الذي لله فالعالم إذا نظر إلى نفسه صغيرا ورأى موجدة منزها عما يليق به سمي ربه كبيرا وذا كبرياء لما كبر عنده بما له فيه من التأثير والقهر فلو لم يكن العالم مؤثرا فيه لله تعالى ما علم أنه صغير ولا أن ربه كبير وكذلك رأى لما قامت الحاجة به والفقر إلى غيره احتاج أن يعتقد ويعلم أن الذي استند إليه في فقره له الغني فهو الغني سبحانه في نفس عبده وهو بالنظر إلى ذاته معرى عن النظر إلى العالم لا يتصف بالغنى لأنه ما ثم عن من وكذلك إذا نظر إلى ذله علم أنه لا يذل لنفسه وإنما يذل تحت سلطان غيره عليه فسماه عزيزا فإنه عز الحق في نفس هذا العبد لذله فالعبد هو محل الكبرياء والغني والعظمة والعزة التي لله فوصف العبد ربه بما قام به فأوجب المعنى حكمه لغير من قام به ومن هنا برقت بارقة لمن قال من أهل النظر إن الباري مريد بإرادة حادثة لم تقم به لأنه ليس محلا للحوادث فخلق إرادة لا في محل فأراد بها فأوجبت الإرادة حكمها لمن لم تقم به هذا القدر وهو الذي لاح عندهم من روح هذا الأمر الذي ذكرناه في الكبرياء وما تم لهم تحقيق النظر إلى آخره بل عبروا عن ذلك بعبارات سيئة مختلطة فإن أكثر العقلاء يرون أن المعاني لا توجب أحكامها إلا لمن قامت به وهذا غلط طرأ عليهم لكونهم أثبتوا الصفات أعيانا متعددة وجودية لا تقوم بنفسها بل تستدعي موصوفا بها تقوم به فيوصف بها فلو علموا أن ذلك كله نسب وإضافات في عين واحدة تكون تلك العين بالنسبة إلى كذا عالمة وإلى كذا قادرة وإلى كذا مريدة وإلى كذا كبيرة وإلى كذا غنية وإلى كذا عزيزة إلى سائر الصفات والأسماء لأصابوا\nأ لا تراهم يقولون في الكبرياء والعظمة والغني والعزة إنها صفات تنزيه أي هو منزه عندهم عن نقيضها وليس الأمر عند المحققين كما قالوه وإنما هو منزه عن قيام الكبرياء به بحيث أن يكون محلا له بل الكبرياء محله الذي عينه الحق له وهو السموات والأرض فقال ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ وهو أي هوية الحق العزيز أي المنيع لذاته أن تكون محلا لما هي السموات والأرض له محل وليس إلا الكبرياء فما كبر إلا في نفس العالم وهو أجل من أن يقوم به أمر ليس هو بل هو الواحد من جميع الوجوه وهو الحكيم بما رتبه في الخلق ومن جملة ما رتبه بعلمه وحكمته إنه جعل السموات والأرض محلا لكبريائه فكأنه يقول ولَهُ الْكِبْرِياءُ الذي خلقه في نفس السَّماواتِ والْأَرْضِ حتى يكبروا إلههم به وكذلك وقع فكبروه في نفوسهم فقالوا إنه ذو الجلال أي صاحب الجلال الذي نجده في نفوسنا له والإكرام بنا فإن نظرت بعين الحقيقة ففتح الله منك عين الفهم علمت من سميت ومن وصفت ومن نعت ولمن هي هذه النعوت وبمن قامت وإلى أي عين نسبت وأما قوله فيما وصف به نفسه مما هو عند النظار صفة للخلق حقيقة وأخذوه في الله تجوزا من جوع وظمأ ومرض وغضب ورضي وسخط وتعجب وفرح وتبشبش إلى قدم ويد وعين وذراع وأمثال ذلك مما وردت به الأخبار عن الله على السنة الرسل وما ورد من ذلك في الكلام المنسوب إلى الله المعبر عنه بصحيفة وقرآن وفرقان وتوراة وإنجيل وزبور فالأمر عند المحققين أن هذه كلها صفات حق لا صفات خلق وأن الخلق اتصف بها مزاحمة للحق كما اتصف العالم أيضا بجميع الأسماء الإلهية الحسنى وأجمع النظار عليها والكل أسماؤه من غير تخصيص هذا مذهب المحققين فيه فإنه صادق ولهذا نحن في ذلك على التوقيف فلا نصفه إلا بما وصف به نفسه ولا نسميه إلا بما سمي به نفسه لا نخترع له اسما ولا نحدث له حكما ولا نقيم به صفة فإنه قد قدمنا لك أنه لا يماثلنا ولا نماثله ف لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ منا وليس كمثلنا شي‏ء منه فهو لنفسه بنفسه ونحن لنا به لأنا لا نستقل بوجودنا كما استقل هو إلا أنه خلق العالم على صورته ولذلك قبل التسمي بأسمائه فانطلق على العالم ما انطلق على الحق من حيث ما أطلقه الحق على نفسه فعلمنا أنه في أسمائه الأصل لا نحن فما أخذ شيئا هو لنا ولا نستحقه بل كل ذلك له ومن جملة ما خلق الله الخيال وظهر لنا فيه بهذه الأسماء والصفات ففصلنا وقسمنا ورفعنا وخططنا ولم يترك شيئا من صفات العالم عندنا إلا وصفنا بها خالقنا فكشف لنا فإذا ذلك كله صفاته لا صفاتنا فصفات العالم على الحقيقة هوية الحق والاختلاف في التجليات الإلهية لحقائق الممكنات في عين الحق فإنه عين الصورة التي أدركناها إذ لا نشك فيما رأينا إنا رأينا الحق بالعلامة التي بيننا وبينه وهو من هويته بصرنا وسمعنا فما رأيناه إلا به لا ببصرنا ولا سمعنا كلامه إلا به لا بسمعنا فلا بد من عين هو مسمى العالم ولا بد من عين هو مسمى الحق ليس كمثل واحد شي‏ء من الآخر فهذا بعض ما يحوي عليه التواضع الكبريائي والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "## Chapter Three Hundred and Eighty-Seven: Concerning the Knowledge of the Stations of Majestic Humility (التواضع الكبريائي)\n\nHe who is terrified by that which is of his own kind,\nIs ignorant, having strayed from his own self.\n\nIf only he knew his own descriptions,\nHe would not be terrified by that which is of his own kind.\n\nAnd all that is in Generosity (الجود) is in him, derived\nFrom the darkness of the nights and the light of its sun.\n\nAnd all that is in the Cosmos (الكون) is in him, derived\nFrom His lowest descent (نزوله الأدنى) and from His Holiness (قدسه).\n\nLook, for you are the Command (الأمر); so stand firm upon\nKnowledge (علم) and do not look toward conjecture (حدسه).\n\n### [Indeed, Allah has lowered Himself to the station of His servants]\n\nThe Blessed and Exalted said: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), and He said: <<وما قَدَرُوا الله حَقَّ قَدْرِهِ>> (And they did not estimate Allah with the estimation due to Him), and He, the Exalted, said: <<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Exalted is your Lord, the Lord of Might, above what they describe), and He said: <<ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ وهُوَ الْعَزِيزُ الْحَكِيمُ>> (And to Him belongs Majesty (الكبرياء) in the heavens and the earth, and He is the Almighty, the Wise), and He said: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is free from need of the worlds). Yet, despite all this,\n\nHe is the One who says in the sound reports (الصحيح من الأخبار) concerning Him: \"I was sick, but you did not visit Me; I was hungry, but you did not feed Me; and I was thirsty, but you did not give Me drink.\"\n\nHe speaks such a saying to His servant, thus lowering Himself here to the station of His servants. Where is that Majesty (الكبرياء) compared to this descent (النزول)? It is established in the sound tradition that Allah wonders (يعجب) at the youth who has no youthful folly (صبوة).\n\nIt is established that Allah is more joyful (أفرح) over the repentance of His servant than the joy of the owner of the she-camel—upon which is his food and drink—when he finds it after it was lost while he was in a desolate land, cut off, and had become certain of death. He rejoiced in finding it, and Allah is more joyful over the repentance of His servant than this man is over his she-camel.\n\nIt is established concerning Him that He greets with affection (يتبشبش) the one who comes to the mosque, just as the family of a traveler greets their absent one with affection when he returns to them.\n\nWhere is all this compared to His saying: <<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Exalted is your Lord, the Lord of Might, above what they describe), <<وسَلامٌ عَلَى الْمُرْسَلِينَ>> (And peace upon the Messengers), and <<والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (And praise belongs to Allah, Lord of the worlds), and <<وما قَدَرُوا الله حَقَّ قَدْرِهِ>> (And they did not estimate Allah with the estimation due to Him)? Where is this descent (النزول) compared to this elevation (الرفعة)? This is the Majestic Humility (التواضع الكبريائي).\n\nEvery truth (حق), truthful saying (قول صدق), and sound judgment (حكم صحيح) belongs to the one whose insight (بصيرته) Allah unveils among His knowing servants, showing him the Real (الحق) as Real and the false (الباطل) as false. Here, the vision (الرؤية) became attached to the non-existent (المعدوم), for falsehood is non-existence (عدم). If the servant is characterized by the vision of the non-existent, then the Real is more deserving of this attribute: that He sees us in our state of non-existence with the vision of the eye and sight (رؤية عين وبصر), not the vision of mere knowledge (رؤية علم).\n\nAs for His saying: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), this is, according to the sound understanding (الصحيح من الفهم), the meaning of the Prophet’s saying, peace and blessings be upon him: \"Indeed, Allah created Adam upon His Form (صورته),\" in some of the possible interpretations of this report. And His saying, the Exalted: <<لَقَدْ خَلَقْنَا الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ>> (We have certainly created man in the best of stature). That is only because He created him upon the Form of the Real (صورة الحق). He only returned him to the lowest of the low (أسفل سافلين) so that He might gather for him the perfection of the Form (كمال الصورة) through the attributes (الأوصاف), just as He mentioned concerning Himself that He is upon it. For His characterization by the negation of likeness (نفي المثل) from Himself is part of His characterization by limit and measure (الحد والمقدار)—such as settling (استواء), descending (نزول), seeking affection (استعطاف), being gentle in address (تلطف في خطاب), anger (غضب), and pleasure (رضاء). All of these are attributes (نعوت) of the created (المخلوق). Had He not described Himself with our attributes, we would not have known Him. And had He not purified (نزه) Himself from our attributes, we would not have known Him. Thus, He is the Known in both states and the Described by both descriptions.\n\nFor this reason, He created everything in pairs (زوجين), so that one of the pair would have elevation (العلو)—which is the male (الذكر)—and one of the pair would have lowness (السفل)—which is the female (الأنثى). When they unite, the subsistence (بقاء) of the essences (أعيان) of that species appears. He made this in every type of species to teach us that the matter of our existence (وجودنا) is upon this pattern. We are between Him and the intelligibility of Nature (معقولية الطبيعة) from which He originated the natural bodies (الأجسام الطبيعية), and from the ratio of His direction (نسبة توجهه) upon it, He originated the governing spirits (الأرواح المدبرة). Everything other than Allah (ما سوى الله) must be composed (مركبا) of a rider (راكب) and a ridden (مركوب), so that the need (افتقار) of the rider for the ridden and the need of the ridden for the rider may be valid, allowing Him, the Exalted, to be unique in Self-Sufficiency (الغنى) as He described Himself.\n\nHe is Self-Sufficient (غني) for Himself, and we are Self-Sufficient through Him (أغنياء به) even while we are in need (افتقارنا) of Him. Everything other than Allah is a governor (مدبر) and governed (مدبر لهذا المدبر). The governor, by virtue of being a governor, finds strength in his essence but needs a governed entity in which his governance appears. The governed, by virtue of being governed, finds a state in his essence by which he needs someone to govern his essence for the sake of his well-being and subsistence. The poverty (فقر) of each one toward the other is essential poverty (فقر ذاتي). Each one is characterized by Self-Sufficiency from the other because he only needs a governor, not this specific governed entity. Likewise, the governor is characterized by Self-Sufficiency because he only needs a governed entity, not this specific governor. Thus, each one is Self-Sufficient from the essence of the other, but not from the governance coming from it and residing in it. The Self-Sufficiency of each one is not absolute. The Self-Sufficiency of the Real (الحق) is absolute (مطلق) when viewed in relation to His Essence (ذاته), and creation (الخلق) is absolutely needy (مفتقر على الإطلاق) when viewed in relation to its essence. Thus, the Real is distinguished from creation. For this reason, whoever said <<إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ>> (Indeed, Allah is poor, and we are rich) committed disbelief.\n\nThis distinction (التمييز) never ceases because it is an essential distinction (تميز ذاتي) in the one described by it, whether Real or creation. There are only two things (شيئيتان): the thingness of the Real (شيئية حق) and the thingness of creation (شيئية خلق). Nothing is like creation in its need (افتقاره), because there is only the Real, and the Real is not described by need. Thus, He is not like creation. So, nothing is like creation. Nothing is like the Real in His Self-Sufficiency (غناه), because there is only creation, and creation is not characterized by Self-Sufficiency in its essence. Thus, it is not like the Real. So, nothing is like the Real. This is because, as we said, there is nothing but creation and the Real. Creation, from the perspective of its essence (عينه), is a single essence (ذات واحدة) in multiplicity (كثير). The Real, from the perspective of His Essence and His Eye (ذاته وعينه), is a single essence that has many Names (أسماء كثيرة) and relations (نسب). Whoever does not understand His saying <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him) according to what we have established has no knowledge of this verse. For He brought the *kāf* (of likeness) and then negated likeness (المثلية) from Himself with the addition of the *kāf* for emphasis in the negation. Then He negated likeness from the world by making the *kāf* an attribute, thus attaching the negation to the similar (المماثل) in the negation. That is, likeness was negated from creation because there is only the Real, who is not similar, and likeness was negated from the Real because there is only creation, which is not similar.\n\nThus are the meanings understood\nWhen the Light comes to us with the clarification.\n\nThere is not in existence (أكون) but a single Real (حق),\nThough if you wish, say two.\n\nAnd every essence (عين) has singularity\nIn its self, not seen by a second.\n\nAnd a ruling came in the Prayer from Him,\nBy His division of the paired verses (المثاني).\n\nSo He distinguished creation from Himself therein;\nFor this reason, two appeared.\n\nHe said: \"Between Me and My servant...\"\nSo whoever sees Him has seen Me.\n\nI am not other than God, nor is He a second\nTo My Unity (وحدتي) in Existence (الوجود).\n\nThe tongue of creation translated concerning Him\nWith the clarification we mentioned.\n\nAs for His saying: <<وما قَدَرُوا الله حَقَّ قَدْرِهِ>> (And they did not estimate Allah with the estimation due to Him)—He is the One who made them speak what they spoke concerning Him. For He says concerning those who are witnessed against that <<قالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا قالُوا أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ>> (They said to their skins: \"Why did you testify against us?\" They said: \"Allah, who made all things speak, has made us speak.\"). There is nothing that speaks except that Allah made it speak. The spoken word (المنطوق به) differs: there is speech related to praise (مديح), speech related to blame (ذم), speech related to metaphor (تجوز) due to a convention Allah established in the World, and speech related to what is indicated in itself, which is a report about reality (حقيقة). There is nothing but what we have mentioned. The speech of praise is the testimony of the people of Knowledge (أولي العلم) to the Unity of Allah. The speech of blame is the saying of the one who says: <<إِنَّ الله فَقِيرٌ>> (Indeed, Allah is poor) and <<ويَدُ الله مَغْلُولَةٌ>> (And the Hand of Allah is chained), meaning stinginess. The speech of reality is <<والله خَلَقَكُمْ>> (And Allah created you). The speech of metaphor, due to convention, is <<وما تَعْمَلُونَ>> (and what you do). The verse is one.\n\nAs for His saying: <<وما قَدَرُوا الله حَقَّ قَدْرِهِ>> (And they did not estimate Allah with the estimation due to Him), it is because they are not like Him, so they did not know Him. Whoever is ignorant of His affair does not estimate His worth (قدره). They are not a likeness to Him, nor is He a likeness to them. So they described Him by their own selves and by what they are upon. They are only capable of this because they desire the affirmative description (الوصف الثبوتي), and that can only be through similitude (التشبيه). Whoever makes a likeness for the One who does not accept likeness has not estimated His worth as is due to Him—meaning, he did not place Him in the station (المنزلة) that He deserves. Thus, He blamed them for ignorance, as they exposed themselves to that of which they had no knowledge from their own selves. If they had spoken concerning Him based on what He revealed to them, no blame would have attached to them from the Real in that, because the narrator is not attributed with what he narrates, so neither blame nor praise attaches to him in that.\n\nThe knowledge (علم) of creation concerning Allah is not attained by analogy (قياس); rather, it is attained by the subsistence (البقاء) of hearing (السمع) the address (خطاب) of the Real—either by Himself or through the tongue of the translator (المترجم عنه), who is the Messenger—along with the Witnessing (الشهود) that allows him no scope other than what he heard from the address, as He said: <<إِنَّ في ذلِكَ>> (Indeed in that)—an indication of what preceded—<<لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ>> (is a reminder for whoever has a heart)—referring to intellectual contemplation through the changing of states—<<أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ>> (or lends an ear while he is a witness). Apart from these two categories, there is no path for them to the knowledge of what the Real deserves to be attributed with, and what creation deserves to be attributed with. Whoever knows his self (نفسه), the Real does not resemble him. And whoever knows his Lord, creation does not resemble Him. For your knowledge of a single part of the world, by virtue of its being a sign (دليلا), is the very knowledge of the entire world. For this reason, we lowered the world to the station of the One, and we negated likeness (المثلية) from it, since there is nothing in Existence (الوجود) except the Real, and the Real is not a likeness to the world, even though the world resembles parts of itself, just as the Divine Names are judged—such as the Forgiving (الغافر), the Oft-Forgiving (الغفور), and the All-Forgiving (الغفار), and their likes—as being similar, even though they are distinguished by levels (مراتب), just like the world, which contains similarities even though they are distinguished by essences (الأعيان) and levels. For this reason, these verses were only revealed in response to a saying that originated from them, which was mentioned in the Prophetic report. As for the Quran, His saying is: <<وما قَدَرُوا الله حَقَّ قَدْرِهِ إِذْ قالُوا ما أَنْزَلَ الله عَلى‏ بَشَرٍ من شَيْ‏ءٍ>> (And they did not estimate Allah with the estimation due to Him, when they said: \"Allah has not sent down anything upon a human being\"), despite their acknowledgment that the Torah was sent down upon Moses, peace be upon him, from Allah. Thus, they lied against Allah, so their faces (وجوههم)—meaning their essences (ذواتهم)—were blackened. They have no light by which they unveil things; rather, they are blind, so they do not see.\n\nAs for His saying: <<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وسَلامٌ عَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (Exalted is your Lord, the Lord of Might, above what they describe, and peace upon the Messengers, and praise belongs to Allah, Lord of the worlds)—this is a verse that, among the Gnostics (العارفين), nothing has been more problematic (أشكل) than it, due to the interpenetration (التداخل) it contains. For under His saying, in purifying Himself, <<عَمَّا يَصِفُونَ>> (above what they describe), is included what His servants describe Him with, based on what their proofs give them, in their claim, through intellectual contemplation (النظر الفكري), each one independently, and each one claiming purification (التنزيه) for his Creator in that.\n\nAs for the philosopher (الفيلسوف), he negated from Him the knowledge (العلم) of the particulars (مفردات العالم) that occur in the senses. Thus, according to them, He does not know that Zayd ibn Amr moved his finger at noon, for example, or that he is wearing a specific garment at this time; rather, He knows that there is someone in the world with this description, absolutely, without specification, because the attainment of this knowledge by specification belongs only to the senses, and Allah is purified from the senses. This knowledge of this part is thus included, according to them, in the total knowledge (العلم الكل) that He possesses, which is that there is someone in the world of this status. They achieved their objective by this, but they missed a great knowledge. For the person performing this specific movement, from this specific individual, may be replaced by another. By what, then, will the proof (الحجة) of Allah be established against the specification of this servant, so that He holds him accountable for it in the Hereafter, or deprives him of what is appropriate for him in this world, or if he did not perform that movement? Even if the basis of this view is the denial of the sensible Hereafter and the denial of the gift in this world and the reward for the one performing this movement specifically. And even if it is part of his doctrine that that movement inherently prevents the one performing it from attaining what the reality of that movement prevents. Thus, he is built upon a corrupt foundation, which is that nothing proceeded from Allah except that First One (الواحد الأول) due to His Oneness, and then the world acted upon itself, one part from another, without the detailed knowledge (علم تفصيلي) of Allah being attached to it, but only by the total knowledge that He possesses.\n\nAs for the theologian (المتكلم), such as the Ash'ari, he moved in his purification (تنزيهه) from the similitude of the created (التشبيه بالمحدث) to the affirmation of the similitude of the created. For example, concerning His settling (استواء) upon the Throne, he said that it is impossible for His settling to be the settling of bodies, because He is not a body, due to the limit and measure (الحد والمقدار) involved, and the need for a specifier (المخصص) that gives preference to measures, which would establish His need (الافتقار). Rather, His settling is like the settling of a king upon his kingdom. They cited as evidence for their view of settling:\n\nBishr has settled upon Iraq\nWithout a sword or blood being spilled.\n\nThus, they likened the settling of the Real upon the Throne to the settling of a human (بشر) upon Iraq. The settling of a human is created (محدث), so they likened Him to the created, and the Eternal (القديم) does not resemble the created, for Allah says: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him). Sound contemplation yields the opposite of what they said.\n\nSo He, the Exalted, said concerning every contemplator: <<سُبْحانَ رَبِّكَ>> (Exalted is your Lord)—the pronoun *kāf* (your) refers to Muhammad, peace and blessings be upon him—meaning, your Lord who sent you to them to make them know what He sent you for and revealed to them through your mediation—<<رَبِّ الْعِزَّةِ>> (the Lord of Might)—meaning, He is inherently immune (الممتنع لنفسه) from accepting what they described Him with in their contemplation and judged Him with by their intellects. The Real is not judged by creation (خلق), and the intellect and the rational being are creation. The Real is only known from the Real by what He revealed to us or disclosed to us through unveiling (كشفا) and witnessing (شهودا), by Divine inspiration (وحي إلهي) or by the message of a Messenger whose truthfulness and infallibility in conveying from Allah to us is established—<<عَمَّا يَصِفُونَ>> (above what they describe)—from the perspective of their intellectual contemplation and rational deduction. For knowledge of Allah does not accept transformation into ignorance, nor the entry of ambiguity (الشبه). There is no rational proof (دليل عقلي) that does not accept the entry of ambiguity. For this reason, the rational people differed, and every opponent considers the proof of his adversary to be an ambiguity for him, because it contradicts the proof of the other. Thus, the very essence of all their proofs is the very essence of their ambiguities. Where is the truth, and where is the certainty? The root of corruption (أصل الفساد) occurred because they judged the Real (الحق) who brought them into existence by means of creation (الخلق).\n\nThen He said: <<وسَلامٌ عَلَى الْمُرْسَلِينَ>> (And peace upon the Messengers). The Messengers, peace be upon them, only came with things that these theoretical proofs both invalidated and affirmed. Thus, He affirmed their truthfulness in their contemplation and denied their truthfulness in their contemplation, leading to confusion among these people. If they submit to what He said about Himself through the tongues of His Messengers and yield to them, their yielding places them in the Messengers' station. For they yielded to them not based on their individual essences (أعيانهم), for they are like them, but to the One from whom they came and from whom they transmitted what He reported about Himself—according to how He knows Himself, not according to the interpretation of the one to whom it reached. The intent of Allah is only known through the information provided by Allah. The contemplator must stand in the position of submission (التسليم) to what has been transmitted, while understanding that it is based on the established usage (موضوع) of that language in which this Messenger brought it. This is necessary, because He only brought it in that language so that we might know that it is upon the reality for which that word was established in that language. However, the relation (النسبة) is unknown, so we submit to Him the knowledge of the relation while our intellect grasps the indication through the conventional usage in that specific dialect. Thus, we yield to Him just as the Messengers yielded. For this reason, He said \"upon the Messengers,\" meaning that submission is obligatory upon them by His saying \"peace,\" so that we may be like them.\n\nThen He said: <<والْحَمْدُ لِلَّهِ>> (And praise belongs to Allah)—meaning the consequences (عواقب) of the praise. For everything they brought was intended as praise for Allah. The consequences of praising Allah for what He purified Himself from is that the praise of Allah in that matter is due to the fact that He, the Exalted, made them speak it and brought that into existence in their souls, because what they said must necessarily be true. For this reason, He said \"And praise belongs to Allah,\" for praise is the consequence. The consequences of praise return to Allah, and the consequence of the matter is its end. There is no end to what they said except that it exists from Him, the Exalted, within them, for He is the Lord of the worlds (رب العالمين) from the perspective of His establishment in His Lordship (ربوبيته) with the sanctified attributes (النعوت المقدسة) that the Lord deserves. He is the Master of the world, their nurturer, their provider, and their reformer. <<لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the Almighty, the Wise).\n\nAs for His saying: <<ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ>> (And to Him belongs Majesty (الكبرياء) in the heavens and the earth).\n\n### [The World is Confined to High and Low]\n\nKnow that the World (العالم) is confined to high (علو) and low (سفل). High and low are relative, relational matters (أمر إضافي نسبي). The higher part is called heaven (سماء), and the lower part is called earth (أرض). These two relations only exist through a middle thing (أمر وسط) between them, and that thing itself possesses directions. What overshadows it is heaven, and what supports it is earth for it. Or, if you wish, you may say concerning the Higher Assembly (الملإ الأعلى) and the Lower Assembly (الملأ الأسفل) that everything formed from Nature (الطبيعة) is the Lower Assembly, and everything generated from Light (النور) is the Higher Assembly. The most perfect part of the World is that which combines both, which is the Isthmus (البرزخ), which distinguishes them by its directions, or distinguishes them by its combination, through high and low, from the perspective of the Influencer (المؤثر) and the Influenced (المؤثر فيه)—the active participle and the passive participle.\n\nThe Real (الحق), when viewed in relation to Himself, is not characterized by anything that characterizes the existence of the World. The Grandeur (العظمة) and Majesty (الكبرياء) attributed to Him in the tongues of the perceivers (ألسنة الفهوانية) are because Allah did not make the locus (محله) of the Majesty that belongs to Him anything but the heavens and the earth. He said: <<ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ>> (And to Him belongs Majesty in the heavens and the earth). He did not say \"in Himself.\" Thus, the locus is described by the Majesty that belongs to Allah. When the World looks at itself as small and sees its Originator (موجده) as purified (منزها) from what is appropriate for it, it names its Lord Great (كبيرا) and Possessor of Majesty (ذا كبرياء), because He is magnified in its view due to His influence (التأثير) and subjugation (القهر) within it. Similarly, when the servant saw that need (الحاجة) and poverty (الفقر) arose in him toward another, he needed to believe and know that the One upon whom he relies in his poverty possesses Self-Sufficiency (الغني). Thus, He is the Self-Sufficient, the Exalted, in the very self of His servant. Likewise, when he saw his humiliation (ذله), he knew that he is not humiliated by himself, but is humiliated under the authority of another over him, so he named Him Almighty (عزيزا). For the Might (عز) of the Real subsists in the very self of this servant due to his humiliation.\n\nThe servant is the locus (محل) of the Majesty (الكبرياء), Self-Sufficiency, Grandeur, and Might (العزة) that belong to Allah. The servant described his Lord by what subsisted in himself, thus necessitating that the meaning’s ruling belongs to someone other than the one in whom it subsisted. From here flashed a light for those among the theorists who said that the Creator wills by a created will (إرادة حادثة) that does not subsist in Him, because He is not a locus for created events (الحوادث). So they created a will not in a locus, and by it He willed, and the will necessitated its ruling for one in whom it did not subsist. This is the extent of the spirit of this matter concerning Majesty that appeared to them. However, they did not fully realize the contemplation to its end; rather, they expressed it with poor, mixed expressions. For most rational people believe that meanings only necessitate their rulings for the one in whom they subsist. This is a mistake that occurred to them because they established the Attributes (الصفات) as multiple, existent essences (أعيانا متعددة وجودية) that do not subsist by themselves but require a subject (موصوفا) in which they subsist, so that He is described by them. If they knew that all of that is merely relations and additions (نسب وإضافات) in a single essence (عين واحدة)—that essence being knowing (عالمة) in relation to this, powerful (قادرة) in relation to that, willing (مريدة) in relation to that, great (كبيرة) in relation to that, Self-Sufficient (غنية) in relation to that, mighty (عزيزة) in relation to that, and so on for all the Attributes and Names—they would have been correct.\n\nDo you not see them say concerning Majesty, Grandeur, Self-Sufficiency, and Might that they are attributes of purification (صفات تنزيه)? Meaning, He is purified in their view from their opposites. But the matter, according to the Verifiers (المحققين), is not as they said. Rather, He is purified from the subsistence of Majesty in Him, such that He would be a locus for it. Majesty is only in the locus that the Real designated for it, which is the heavens and the earth. He said: <<ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ>> (And to Him belongs Majesty in the heavens and the earth). And He is (وهو)—meaning the Identity (هوية) of the Real—the Almighty (العزيز)—meaning immune in His Essence from being a locus for what the heavens and the earth are a locus for, which is only Majesty. He is too sublime (أجل) for an affair that is not Him to subsist in Him; rather, He is the One (الواحد) from all perspectives. And He is the Wise (الحكيم) by what He ordered in creation. And part of what He ordered by His Knowledge and Wisdom is that He made the heavens and the earth the locus for His Majesty. It is as if He says: \"And to Him belongs the Majesty which He created in the very self of the heavens and the earth, so that they might magnify their God by it.\" This is exactly what happened: they magnified Him in their souls and said that He is the Possessor of Glory (ذو الجلال)—meaning the owner of the Glory that we find in our souls for Him—and Honor (الإكرام) through us. If you look with the eye of Reality, and Allah opens the eye of understanding for you, you will know whom you named, whom you described, whom you characterized, to whom these attributes belong, in whom they subsisted, and to which essence they were related.\n\nAs for His saying concerning Himself what is, in the view of the theorists, truly an attribute of creation—and which they took metaphorically (تجوزا) for God—such as hunger, thirst, sickness, anger, pleasure, wrath, wonder, joy, greeting with affection (تبشبش), foot, hand, eye, forearm, and similar things reported in the traditions (الأخبار) through the tongues of the Messengers, or in the speech attributed to Allah (Quran, Torah, etc.). The matter, according to the Verifiers (المحققين), is that all these are attributes of the Real (صفات حق), not attributes of creation. Creation (الخلق) was characterized by them in rivalry (مزاحمة) with the Real, just as the World was also characterized by all the Beautiful Divine Names (الأسماء الإلهية الحسنى), upon which the theorists agreed. All of them are His Names, without specification. This is the doctrine of the Verifiers concerning it, for He is truthful. For this reason, we are upon cessation (التوقيف) in this matter: we only describe Him by what He described Himself with, and we only name Him by what He named Himself with. We do not invent a name for Him, nor introduce a ruling for Him, nor establish an attribute for Him. For we have already established for you that He does not resemble us, nor do we resemble Him. Thus, <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him) from us, and nothing is like us from Him. He is for Himself, by Himself. And we are for us, by Him, because we do not subsist independently in our existence as He subsists. However, He created the World upon His Form (صورته), and for that reason, it accepted being named by His Names. Thus, what applies to the Real applies to the World, based on what the Real applied to Himself. We knew that He is the Origin (الأصل) in His Names, not us. He did not take anything that belongs to us or that we deserve; rather, all of that belongs to Him.\n\nAmong what Allah created is the Imagination (الخيال), and He appeared to us in it with these Names and Attributes. So we detailed, divided, elevated, and planned, and we did not leave any attribute of the World that we possess without describing our Creator with it. Then He unveiled to us, and behold, all of that is His Attributes, not ours. The attributes of the World are, in reality, the Identity (هوية) of the Real, and the difference lies in the Divine Theophanies (التجليات الإلهية) to the realities of the possibilities (حقائق الممكنات) in the Eye (عين) of the Real. For He is the very essence of the Form that we perceived, since we do not doubt what we saw: that we saw the Real by the sign (العلامة) between us and Him, which is our sight and hearing derived from His Identity. We did not see Him except by Him, nor hear His speech except by Him. There must be an essence (عين) named the World, and there must be an essence named the Real. Nothing of one is like the other. This is part of what the Majestic Humility (التواضع الكبريائي) encompasses. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب تین سو ستاسی: تواضع کبریائی (التواضع الكبريائي) کے مقامات کی معرفت میں۔\n\nجسے اپنی ہی جنس کی چیز خوفزدہ کرے،\nوہ جاہل ہے جو اپنی ذات سے بھٹک گیا۔\nاگر وہ اپنی صفات کو جانتا،\nتو اپنی ہی جنس کی چیز سے خوفزدہ نہ ہوتا۔\nاور جو کچھ بھی سخاوت (الجود) میں ہے، وہ اس میں ہے،\nراتوں کی تاریکی اور اس کے سورج کی روشنی سے۔\nاور جو کچھ بھی کون (الكون) میں ہے، وہ اس میں ہے،\nاس کے ادنیٰ نزول (نزول الأدنى) اور اس کی قدسیت سے۔\nاور دیکھو، تم ہی امر ہو، پس علم پر ثابت قدم رہو،\nاور اپنے گمان (حدس) کی طرف مت دیکھو۔\n\n[بے شک اللہ نے اپنی ذات کو اپنے بندوں کے مقام پر اتارا]\n\nاللہ تبارک و تعالیٰ نے فرمایا: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس کی مثال کوئی چیز نہیں ہے)۔ اور فرمایا: وما قَدَرُوا الله حَقَّ قَدْرِهِ (اور انہوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق ہے)۔ اور اللہ تعالیٰ نے فرمایا: سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ (پاک ہے تیرا رب، عزت کا مالک، ان چیزوں سے جو وہ بیان کرتے ہیں)۔ اور فرمایا: ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ وهُوَ الْعَزِيزُ الْحَكِيمُ (اور آسمانوں اور زمین میں اسی کے لیے کبریائی (الكبرياء) ہے، اور وہ غالب، حکمت والا ہے)۔ اور فرمایا: فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ (پس بے شک اللہ تمام جہانوں سے بے نیاز ہے)۔ اور ان سب کے باوجود،\n\nوہ ہی ہے جو صحیح احادیث میں اپنے بارے میں فرماتا ہے: \"میں بیمار ہوا تو تم نے میری عیادت نہ کی، میں بھوکا ہوا تو تم نے مجھے کھانا نہ کھلایا، اور میں پیاسا ہوا تو تم نے مجھے پانی نہ پلایا۔\"\n\nوہ اپنے بندے سے اس طرح کی بات فرماتا ہے، پس اس نے یہاں اپنی ذات کو اپنے بندوں کے مقام پر اتارا۔ اور وہ کبریائی (الكبرياء) اس نزول (النزول) کے مقابلے میں کہاں؟ اور صحیح حدیث میں ثابت ہے کہ اللہ اس نوجوان پر تعجب فرماتا ہے جسے کوئی لغزش نہ ہو۔ اور یہ بھی ثابت ہے کہ اللہ اپنے بندے کی توبہ سے اس شخص کی خوشی سے زیادہ خوش ہوتا ہے جس کی اونٹنی جس پر اس کا کھانا اور پانی تھا، گم ہو گئی ہو اور وہ زمین کے ایک ویران ٹکڑے میں ہو اور موت کا یقین کر چکا ہو، پھر اسے وہ اونٹنی مل جائے، تو اللہ اپنے بندے کی توبہ سے اس شخص کی اپنی اونٹنی سے زیادہ خوش ہوتا ہے۔\n\nاور یہ بھی ثابت ہے کہ وہ تعالیٰ مسجد میں آنے والے سے اس طرح خوش ہوتا ہے جیسے غائب شخص کے گھر والے اس کے آنے پر خوش ہوتے ہیں۔\n\nاور یہ سب اللہ تعالیٰ کے اس فرمان کے مقابلے میں کہاں: سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ (پاک ہے تیرا رب، عزت کا مالک، ان چیزوں سے جو وہ بیان کرتے ہیں) وسَلامٌ عَلَى الْمُرْسَلِينَ (اور رسولوں پر سلام ہو) والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (اور تمام جہانوں کے رب کے لیے حمد ہے)۔ اور وما قَدَرُوا الله حَقَّ قَدْرِهِ (اور انہوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق ہے)۔ پس یہ نزول (النزول) اس رفعت کے مقابلے میں کہاں؟ یہی تواضع کبریائی (التواضع الكبريائي) ہے۔\n\nاور یہ سب حق ہے، سچا قول ہے، اور صحیح حکم ہے اس کے لیے جس کی بصیرت سے اللہ نے پردہ ہٹا دیا ہو، اس کے بندوں میں سے جو علماء ہیں، پس اسے حق کو حق دکھایا اور باطل کو باطل دکھایا۔ اور یہاں رؤیت (الرؤية) کا تعلق معدوم سے ہوا، کیونکہ باطل عدم ہے۔ اور جب بندہ معدوم کو دیکھنے کی صفت سے متصف ہو سکتا ہے، تو الحق (ذات حق) اس صفت کا زیادہ حقدار ہے کہ وہ ہمیں ہمارے عدم کی حالت میں بھی آنکھ اور بصارت کی رؤیت سے دیکھتا ہے، نہ کہ صرف علم کی رؤیت سے۔ اور جہاں تک اس کے فرمان لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں ہے) کا تعلق ہے، تو صحیح فہم کے مطابق یہ نبی اکرم صلی اللہ علیہ وسلم کے اس فرمان کے معنی میں ہے کہ: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا،\" اس حدیث کے بعض ممکنہ پہلوؤں میں۔ اور اللہ تعالیٰ کا فرمان: لَقَدْ خَلَقْنَا الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ (بے شک ہم نے انسان کو بہترین ساخت پر پیدا کیا)۔ یہ صرف اس لیے ہے کہ اسے الحق (ذات حق) کی صورت پر پیدا کیا گیا۔ اور اسے اسفل سافلین (سب سے نچلے درجے) کی طرف لوٹایا تاکہ اس کے لیے اوصاف کے ساتھ صورت کا کمال جمع کر دے، جیسا کہ اس نے اپنی ذات کے بارے میں ذکر کیا کہ وہ ان پر ہے۔ پس اس کا اپنی ذات سے مثل کی نفی کرنا، اس کا حد اور مقدار کے ساتھ متصف ہونے میں شامل ہے، جیسے استواء، نزول، رحم طلب کرنا، خطاب میں نرمی، غضب اور رضا۔ اور یہ سب مخلوق کی صفات ہیں۔ اگر وہ خود کو ہماری صفات سے متصف نہ کرتا تو ہم اسے نہ پہچانتے، اور اگر وہ خود کو ہماری صفات سے پاک نہ کرتا تو بھی ہم اسے نہ پہچانتے۔ پس وہ دونوں حالتوں میں معروف ہے اور دونوں صفات سے موصوف ہے۔\n\nاور اسی لیے اس نے ہر چیز کے دو جوڑے (زوجین) پیدا کیے، تاکہ ایک جوڑے کے لیے علو ہو، جو کہ مذکر ہے، اور دوسرے جوڑے کے لیے سفل ہو، جو کہ مؤنث ہے۔ تاکہ جب وہ دونوں جمع ہوں تو اس نوع کی حقیقتوں (أعیان) کا بقا ظاہر ہو۔ اور اس نے ہر نوع میں یہ نوعیت رکھی تاکہ ہمیں یہ سکھائے کہ ہمارے وجود (الوجود) میں معاملہ اسی نہج پر ہے۔ پس ہم اس (الحق) اور اس طبیعت کی معقولیت کے درمیان ہیں جس سے اس نے طبعی اجسام کو پیدا کیا، اور اس پر اپنے توجہ کی نسبت سے مدبر ارواح کو پیدا کیا۔ اور اللہ کے سوا ہر چیز کا مرکب ہونا ضروری ہے، راکب (سوار) اور مرکوب (سواری) سے، تاکہ راکب کا مرکوب کی طرف اور مرکوب کا راکب کی طرف افتقار (احتیاج) صحیح ہو، تاکہ وہ سبحانہ غنی (بے نیازی) میں منفرد ہو جائے جیسا کہ اس نے اپنی صفت بیان کی ہے۔ پس وہ اپنی ذات کے لیے غنی ہے، اور ہم اس کے ذریعے غنی ہیں، باوجود اس کے کہ ہم اس کے محتاج ہیں۔ پس وہ ایسا ہے جس سے ہم بے نیاز نہیں ہو سکتے۔\n\nپس اللہ کے سوا ہر چیز مدبر (اسم مفعول: جس کا انتظام کیا جائے) ہے اور اس مدبر کا مدبر (اسم فاعل: انتظام کرنے والا) ہے۔ پس مدبر (اسم فاعل) ہونے کے ناطے، جو انتظام کرتا ہے، وہ اپنی ذات میں ایک قوت پاتا ہے جو اسے ایک ایسے مدبر کی محتاج کرتی ہے جس میں اس کا تدبیر ظاہر ہو۔ اور مدبر (اسم مفعول) ہونے کے ناطے، جو انتظام کیا جاتا ہے، وہ اپنی ذات میں ایک حالت پاتا ہے جس کے ذریعے وہ اس کا محتاج ہوتا ہے جو اس کی ذات کا انتظام کرے تاکہ اس کی حقیقت کی اصلاح اور بقا ہو۔ پس ہر ایک کا دوسرے کی طرف فقر (احتیاج) ذاتی ہے۔ اور وہ اس سے غنی (بے نیاز) ہونے کی صفت سے اس لیے متصف ہوتا ہے کہ وہ صرف ایک مدبر کا محتاج ہے نہ کہ بعینہٖ اسی مدبر کا۔ جیسا کہ مدبر (اسم فاعل) بھی غنی ہونے کی صفت سے متصف ہوتا ہے کیونکہ وہ صرف ایک مدبر کا محتاج ہے نہ کہ بعینہٖ اسی مدبر کا۔ پس ان میں سے ہر ایک دوسرے کی حقیقت سے غنی ہے، نہ کہ اس کی طرف سے اور اس میں تدبیر سے۔ پس ہر ایک کی غنی (بے نیازی) مطلق نہیں ہے۔ اور الحق (ذات حق) کی غنی اپنی ذات کے لحاظ سے مطلق ہے، اور خلق (مخلوق) اپنی ذات کے لحاظ سے مطلق طور پر محتاج ہے۔ پس الحق (ذات حق) خلق سے ممتاز ہے۔ اور اسی لیے جس نے کہا: إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ (بے شک اللہ فقیر ہے اور ہم غنی ہیں)، اس نے کفر کیا۔\n\nپس یہ امتیاز کبھی ختم نہیں ہو گا، کیونکہ یہ موصوف میں ذاتی امتیاز ہے، حق اور خلق کے درمیان۔ پس وہاں دو ہی شیئیتیں (حقیقتیں) ہیں: شیئیت حق اور شیئیت خلق۔ پس خلق (مخلوق) کی طرح اس کے افتقار (احتیاج) میں کوئی چیز نہیں ہے، کیونکہ وہاں صرف الحق (ذات حق) ہے، اور الحق (ذات حق) افتقار سے موصوف نہیں ہوتا۔ پس وہ خلق کی طرح نہیں ہے۔ لہٰذا، خلق کی مثال کوئی چیز نہیں ہے۔ اور الحق (ذات حق) کی طرح اس کی غنی (بے نیازی) میں کوئی چیز نہیں ہے، کیونکہ وہاں صرف خلق ہے، اور خلق اپنی ذات کے لیے غنی سے متصف نہیں ہوتا۔ پس وہ الحق (ذات حق) کی طرح نہیں ہے۔ لہٰذا، الحق (ذات حق) کی مثال کوئی چیز نہیں ہے، کیونکہ جیسا کہ ہم نے کہا، وہاں خلق اور الحق کے سوا کوئی چیز نہیں ہے۔ پس جس نے اللہ تعالیٰ کے فرمان لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں ہے) کو اس طرح نہ جانا جیسا کہ ہم نے بیان کیا ہے، تو اسے اس آیت کا علم نہیں ہے۔ کیونکہ اس میں حرف \"کاف\" لایا گیا، پھر نفی میں تاکید کے لیے \"کاف\" کے اضافے کے ساتھ اپنی ذات سے مماثلت کی نفی کی، پھر \"کاف\" کو صفت بنا کر عالم سے مماثلت کی نفی کی۔ پس نفی کو مماثل کے ساتھ معلق کیا گیا، یعنی خلق سے مماثلت کی نفی ہو گئی کیونکہ وہاں صرف حق ہے جو مماثل نہیں ہو سکتا، اور حق سے مماثلت کی نفی ہو گئی کیونکہ وہاں صرف خلق ہے جو مماثل نہیں ہو سکتا۔\n\nپس معانی کو اسی طرح سمجھو،\nجب نور بیان کے ساتھ ہمارے پاس آئے۔\nپس میرے وجود (أكون) میں فرد حق کے سوا کوئی نہیں،\nاور اگر تم چاہو تو دو ہیں۔\nاور ہر حقیقت (عین) اپنی ذات میں منفرد ہے،\nوہ کسی دوسرے کے ساتھ نہیں دیکھی جاتی۔\nاور نماز میں اس کی طرف سے حکم آیا ہے،\nاس کے مثانی (دو حصوں) میں تقسیم کرنے کا۔\nپس اس میں خلق کو اس سے ممتاز کیا،\nاسی وجہ سے دو ظاہر ہوئے۔\nپس اس نے فرمایا: \"میرے اور میرے بندے کے درمیان،\"\nپس جس نے اسے دیکھا، اس نے مجھے دیکھا۔\nپس میں معبود کے سوا نہیں ہوں، اور نہ وہ ہے،\nکیونکہ میرے وجود (الوجود) میں وحدت کے لیے کوئی دوسرا نہیں ہے۔\nخلق کی زبان نے اس کی ترجمانی کی،\nاس بیان کے ساتھ جو ہم نے ذکر کیا۔\n\nاور جہاں تک اس کے فرمان وما قَدَرُوا الله حَقَّ قَدْرِهِ (اور انہوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق ہے) کا تعلق ہے، تو وہ وہی ہے جس نے انہیں اس بات سے گویا کیا جو انہوں نے اس کے بارے میں کہی۔ کیونکہ وہ ان لوگوں کے بارے میں فرماتا ہے جن پر گواہی دی جائے گی کہ: قالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا قالُوا أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْءٍ (انہوں نے اپنی کھالوں سے کہا: تم نے ہمارے خلاف کیوں گواہی دی؟ انہوں نے کہا: ہمیں اللہ نے گویا کیا جس نے ہر چیز کو گویا کیا)۔ پس کوئی چیز نہیں جو بولتی ہو مگر اللہ نے اسے گویا کیا ہے۔ اور جو کچھ بولا گیا وہ مختلف ہے۔ پس ایک نطق (منطوق بہ) ہے جس کا تعلق تعریف سے ہے، اور ایک نطق ہے جس کا تعلق مذمت سے ہے، اور ایک نطق ہے جس کا تعلق مجاز سے ہے جو اللہ نے عالم میں باہمی رضامندی کے لیے رکھا ہے، اور ایک نطق ہے جو اس پر دلالت کرتا ہے جو وہ اپنی ذات میں ہے، پس یہ حقیقت کی خبر ہے۔ اور وہاں وہی ہے جو ہم نے ذکر کیا۔ پس تعریف کا نطق، اہل علم کا اللہ کی توحید کی گواہی دینا ہے۔ اور مذمت کا نطق، کہنے والے کا یہ قول ہے: إِنَّ الله فَقِيرٌ (بے شک اللہ فقیر ہے) اور يَدُ الله مَغْلُولَةٌ (اللہ کا ہاتھ بندھا ہوا ہے)، جس سے وہ بخل مراد لیتے ہیں۔ اور حقیقت کا نطق: والله خَلَقَكُمْ (اور اللہ نے تمہیں پیدا کیا)۔ اور باہمی رضامندی کے لیے مجاز کا نطق: وما تَعْمَلُونَ (اور جو تم عمل کرتے ہو)۔ اور آیت ایک ہی ہے۔ جہاں تک اس کے فرمان وما قَدَرُوا الله حَقَّ قَدْرِهِ (اور انہوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق ہے) کا تعلق ہے، تو یہ اس لیے ہے کہ وہ اس کی مثال نہیں ہیں، پس انہوں نے اسے نہیں پہچانا۔ اور جو اس کے امر سے جاہل ہو وہ اس کی قدر نہیں کر سکتا۔ پس وہ اس کے لیے مثل نہیں ہیں اور نہ وہ ان کے لیے مثل ہے۔ پس انہوں نے اسے اپنی ذاتوں اور اپنی حالتوں کے مطابق بیان کیا، اور ان کے لیے اس کے سوا ممکن نہیں تھا، کیونکہ وہ اثباتی وصف چاہتے ہیں اور وہ تشبیہ کے بغیر نہیں ہو سکتا۔\n\nاور جس نے اس کے لیے مثل قائم کی جو مثل کو قبول نہیں کرتا، تو اس نے اس کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق ہے، یعنی اس نے اسے اس مقام پر نہ اتارا جس کا وہ مستحق ہے۔ پس اس نے انہیں جہالت کی وجہ سے مذمت کی، کیونکہ انہوں نے اپنی ذاتوں سے ایسی چیز میں دخل اندازی کی جس کا انہیں علم نہیں تھا۔ اگر وہ اس کے بارے میں وہی کہتے جو اس نے ان پر نازل کیا، تو اس پر الحق (ذات حق) کی طرف سے کوئی مذمت نہ ہوتی، کیونکہ حکایت کرنے والے کی طرف وہ چیز منسوب نہیں ہوتی جس کی وہ حکایت کرتا ہے، لہٰذا اس پر نہ مذمت ہوتی ہے اور نہ تعریف۔ پس اللہ کے بارے میں خلق کا علم قیاس سے حاصل نہیں ہوتا، بلکہ یہ الحق (ذات حق) کے خطاب کو سننے کے ذریعے حاصل ہوتا ہے، یا تو خود اس سے، یا اس کی طرف سے ترجمانی کرنے والے کی زبان سے، جو کہ رسول ہے، اس شہود (الشہود) کے ساتھ کہ اس کے لیے اس خطاب کے سوا کچھ اور ممکن نہ ہو جو اس نے سنا۔ جیسا کہ اس نے فرمایا: إِنَّ في ذلِكَ (بے شک اس میں) — یہ اشارہ ہے اس کی طرف جو گزر چکا — لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ (ضرور نصیحت ہے اس کے لیے جس کے پاس دل ہو)۔ پس اس نے احوال کے پلٹنے کے ذریعے فکری نظر کی طرف اشارہ کیا، أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ (یا جس نے کان لگائے اور وہ حاضر ہو)۔ اور ان دونوں گروہوں کے علاوہ کسی کے لیے علم کا کوئی راستہ نہیں ہے کہ وہ جان سکیں کہ الحق (ذات حق) کے ساتھ کیا منسوب ہونا چاہیے اور خلق کے ساتھ کیا منسوب ہونا چاہیے۔ پس جس نے اپنی ذات کو پہچانا، تو الحق (ذات حق) اس کی مماثلت نہیں کرتا، اور جس نے اپنے رب کو پہچانا، تو خلق اس کی مماثلت نہیں کرتی۔ کیونکہ عالم کے ایک جزو کی معرفت، اس دلیل کی وجہ سے کہ وہ عالم ہے، تمہاری پورے عالم کی معرفت کے عین مطابق ہے۔ اسی لیے ہم نے عالم کو واحد کے مقام پر اتارا اور اس سے مماثلت کی نفی کی، کیونکہ الوجود (ہستی) میں الحق (ذات حق) کے سوا کچھ نہیں ہے، اور الحق (ذات حق) عالم کی مثال نہیں ہے۔ اگرچہ عالم ایک دوسرے کی مماثلت کرتا ہے، جیسا کہ تم الٰہی اسماء میں حکم لگاتے ہو، جیسے الغافر، الغفور، اور الغفار، اور ان کی مثالیں کہ وہ امثال ہیں، اگرچہ وہ مراتب میں ممتاز ہیں، جیسے عالم کہ اس میں امثال ہیں اگرچہ وہ حقائق (أعیان) اور مراتب میں ممتاز ہیں۔ اور اسی لیے یہ آیات صرف ان کے ایک قول کے مقابلے میں نازل ہوئیں جو ان کی طرف سے تھا، اور یہ نبوی خبر میں وارد ہوا ہے۔ اور قرآن میں اس کا فرمان ہے: وما قَدَرُوا الله حَقَّ قَدْرِهِ إِذْ قالُوا ما أَنْزَلَ الله عَلى‏ بَشَرٍ من شَيْءٍ (اور انہوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق ہے، جب انہوں نے کہا کہ اللہ نے کسی بشر پر کوئی چیز نازل نہیں کی)۔ باوجود اس کے کہ وہ اقرار کرتے تھے کہ تورات موسیٰ علیہ السلام پر اللہ کی طرف سے نازل ہوئی تھی۔ پس انہوں نے اللہ پر جھوٹ بولا، تو ان کے چہرے سیاہ ہو گئے، یعنی ان کی ذاتیں، پس ان کے پاس کوئی نور نہیں جس سے وہ چیزوں کو کشف (الکشف) کر سکیں، بلکہ وہ اندھے ہیں، پس وہ نہیں دیکھتے۔\n\nاور جہاں تک اس کے فرمان سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ (پاک ہے تیرا رب، عزت کا مالک، ان چیزوں سے جو وہ بیان کرتے ہیں) وسَلامٌ عَلَى الْمُرْسَلِينَ (اور رسولوں پر سلام ہو) والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (اور تمام جہانوں کے رب کے لیے حمد ہے) کا تعلق ہے، تو یہ وہ آیت ہے جو عارفین (العارفين) کے نزدیک سب سے زیادہ مشکل ہے، کیونکہ اس میں تداخل (باہمی شمولیت) ہے۔ پس اس کے فرمان عَمَّا يَصِفُونَ (ان چیزوں سے جو وہ بیان کرتے ہیں) میں، جو وہ اپنی ذات کو پاک قرار دیتا ہے، وہ سب شامل ہو گیا جو اس کے بندے اس کی صفت بیان کرتے ہیں، جو ان کے گمان میں ان کے فکری نظر کے دلائل انہیں دیتے ہیں۔ ہر ایک اپنی جگہ پر ہے، اور ہر ایک اس میں اپنے خالق کے لیے تنزیہ کا دعویٰ کرتا ہے۔ جہاں تک فلسفی (الفيلسوف) کا تعلق ہے، تو انہوں نے اس سے عالم کی ان انفرادی چیزوں کے علم کی نفی کی جو حس میں واقع ہوتی ہیں۔ پس ان کے نزدیک وہ یہ نہیں جانتا کہ مثلاً زید بن عمرو نے زوال کے وقت اپنی انگلی ہلائی، اور نہ یہ کہ اس وقت اس نے کوئی مخصوص لباس پہنا ہوا ہے، بلکہ وہ صرف یہ جانتا ہے کہ عالم میں کوئی ہے جو مطلقاً اس صفت پر ہے، بغیر کسی تعین کے، کیونکہ اس علم کا تعین کے ساتھ حاصل ہونا صرف حس کے لیے ہے، اور اللہ حواس سے پاک ہے۔ پس ان کے نزدیک یہ علم اس جزو میں کل علم میں شامل ہو گیا کہ عالم میں کوئی ہے جو اس مقام پر ہے، اور ان کے نزدیک مقصود حاصل ہو گیا، اور اس سے وہ ایک بڑے علم سے محروم ہو گئے۔ کیونکہ اس مخصوص شخص کی یہ مخصوص حرکت کسی دوسرے سے بھی ہو سکتی ہے۔ پس اللہ اس مخصوص بندے پر کس چیز سے حجت قائم کرے گا یہاں تک کہ آخرت میں اسے اس پر برقرار رکھے، یا دنیا میں اسے اس چیز سے محروم کرے جو اس کے لیے مناسب ہے، یا اس نے وہ حرکت کی ہی نہ ہو؟ اگرچہ اس نظر کے مالک کی اصل یہ ہے کہ وہ محسوس آخرت کا انکار کرتا ہے اور دنیا میں عطا اور اس مخصوص حرکت کے مالک کے لیے جزا کا انکار کرتا ہے، اور اس کا مذہب یہ ہے کہ وہ حرکت اپنی ذات میں مانع ہے کہ اس حرکت کرنے والے کو وہ چیز حاصل ہو جس سے اس حرکت کی حقیقت اسے روکتی ہے۔ پس وہ ایک فاسد اصل پر مبنی ہے۔ اور وہ یہ ہے کہ اللہ سے صرف وہ واحد اول ہی صادر ہوا ہے، اس کی احدیت کی وجہ سے، پھر عالم ایک دوسرے سے متاثر ہوا، اس میں اللہ کے تفصیلی علم کے تعلق کے بغیر، بلکہ کل علم کے ذریعے جو اس پر ہے۔ اور جہاں تک متکلم (المتكلم) کا تعلق ہے، جیسے اشعری، تو وہ اپنے تنزیہ میں محدث (پیدا شدہ) سے تشبیہ دینے سے محدث سے تشبیہ دینے کی طرف منتقل ہو گئے۔ مثال کے طور پر، انہوں نے عرش پر اس کے استواء کے بارے میں کہا کہ اس کا استواء اجسام کے استواء کی طرح ہونا محال ہے، کیونکہ وہ جسم نہیں ہے، اس لیے کہ اس میں حد اور مقدار شامل ہے اور مقداروں کو ترجیح دینے والے مخصص کا مطالبہ ہے، جس سے اس کے لیے افتقار (احتیاج) ثابت ہوتا ہے۔ بلکہ اس کا استواء بادشاہ کے اپنی بادشاہت پر استواء کی طرح ہے۔ اور انہوں نے اس استواء پر اپنے مسلک کے ثبوت میں یہ شعر پڑھا:\n\nقد استوى بشر على العراق *** من غير سيف ودم مهراق\n(بشر نے عراق پر قبضہ کر لیا، بغیر تلوار اور بہائے گئے خون کے)\n\nپس انہوں نے الحق (ذات حق) کے عرش پر استواء کو بشر کے عراق پر استواء سے تشبیہ دی، اور بشر کا استواء محدث ہے، پس انہوں نے اسے محدث سے تشبیہ دی۔ اور قدیم محدث سے مشابہت نہیں رکھتا، کیونکہ اللہ فرماتا ہے: لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں ہے)۔ اور صحیح نظر اس کے خلاف دیتی ہے جو انہوں نے کہا۔ پس اللہ تعالیٰ نے ہر دیکھنے والے کے حق میں فرمایا: سُبْحانَ رَبِّكَ (پاک ہے تیرا رب) — اس کاف کی ضمیر محمد صلی اللہ علیہ وسلم کے لیے ہے — یعنی تیرا رب جس نے تجھے ان کی طرف بھیجا تاکہ تو انہیں اس چیز سے آگاہ کرے جس کے لیے تجھے ان کی طرف بھیجا اور جسے تیری وساطت سے ان پر نازل کیا، رَبِّ الْعِزَّةِ (عزت کا رب)، یعنی وہ اپنی ذات کے لیے اس بات سے باز رہنے والا ہے کہ وہ اسے قبول کرے جو انہوں نے اپنی نظر میں اس کی صفت بیان کی اور اپنی عقلوں سے اس پر حکم لگایا۔ اور الحق (ذات حق) پر مخلوق حکم نہیں لگاتی، اور عقل اور عاقل مخلوق ہیں۔ اور الحق (ذات حق) کو صرف الحق (ذات حق) سے ہی پہچانا جاتا ہے، اس چیز کے ذریعے جو اس نے ہم پر نازل کی، یا کشف (الکشف) اور شہود (الشہود) کے ذریعے ہمیں اس پر مطلع کیا، الٰہی وحی سے یا رسول کے پیغام سے جس کی سچائی اور عصمت اس چیز میں ثابت ہو جو وہ اللہ کی طرف سے ہم تک پہنچاتا ہے۔ عَمَّا يَصِفُونَ (ان چیزوں سے جو وہ بیان کرتے ہیں)، اس لحاظ سے کہ انہوں نے اپنی فکر سے غور کیا اور اپنی عقلوں سے دلیل پکڑی، کیونکہ اللہ کا علم جہالت میں تبدیل ہونا قبول نہیں کرتا اور نہ ہی اس پر شبہات کا داخل ہونا۔ اور کوئی عقلی دلیل ایسی نہیں جو داخل ہونے اور شبہات کو قبول نہ کرتی ہو۔ اور اسی لیے عقلمندوں میں اختلاف ہوا، پس ہر مخالف کے نزدیک اس کے مخالف کی دلیل اس کے مخالف کے لیے شبہہ ہے، کیونکہ اس نے دوسرے کی دلیل کی مخالفت کی۔ پس ان سب کے دلائل کی حقیقت ہی ان کے شبہات کی حقیقت ہے۔ پس حق کہاں ہے اور بھروسہ کہاں ہے؟ اور فساد کی اصل صرف اس وجہ سے واقع ہوئی کہ انہوں نے خلق کو اس الحق (ذات حق) پر حاکم بنا دیا جس نے انہیں وجود بخشا۔ پھر فرمایا: وسَلامٌ عَلَى الْمُرْسَلِينَ (اور رسولوں پر سلام ہو)۔ اور رسول علیہم السلام صرف وہی لے کر آئے جو ان نظری دلائل نے محال قرار دیا اور جو انہوں نے ثابت کیا۔ پس اس نے ان کے نظر میں ان کی تصدیق کی اور ان کے نظر میں ان کی تکذیب کی، تو ان لوگوں میں حیرت واقع ہوئی۔ پس جب وہ اس بات کو تسلیم کر لیں جو اس نے اپنے رسولوں کی زبانوں سے اپنی ذات کے بارے میں کہی، اور ان کی اطاعت کریں، تو ان کی اطاعت انہیں ان کے مقام پر اتارے گی۔ کیونکہ انہوں نے ان کی اطاعت ان کی حقیقتوں (أعیان) کی وجہ سے نہیں کی، کیونکہ وہ ان کی مثال ہیں، بلکہ انہوں نے اس کی اطاعت کی جس کی طرف سے وہ آئے اور جس کی خبر انہوں نے اس سے نقل کی جو اس نے اپنی ذات کے بارے میں دی، جیسا کہ وہ خود کو جانتا ہے، نہ کہ اس کی تاویل پر جو اس تک پہنچی۔ پس اس میں اللہ کی مراد صرف اللہ کے بتانے سے ہی معلوم ہو سکتی ہے۔ پس دیکھنے والا اس چیز کو تسلیم کرنے کے مقام پر کھڑا ہو جائے جو وارد ہوئی ہے، اس فہم کے ساتھ کہ وہ اس زبان کے موضوع پر ہے جسے یہ رسول لے کر آیا ہے۔ یہ ضروری ہے، کیونکہ وہ اسے اس زبان میں صرف اس لیے لایا تاکہ ہم جانیں کہ وہ اس حقیقت پر ہے جس کے لیے وہ لفظ اس زبان میں وضع کیا گیا ہے، لیکن نسبت سے ناواقفیت ہوتی ہے، پس ہم نسبت کا علم اس کے سپرد کر دیتے ہیں، اس خاص لہجے میں اصطلاحی وضع کے ذریعے دلالت کو سمجھتے ہوئے، پس ہم اس کی اطاعت کرتے ہیں جیسا کہ رسولوں نے اطاعت کی۔ اور اسی لیے اس نے فرمایا: عَلَى الْمُرْسَلِينَ (رسولوں پر)، یعنی ان پر اس کے قول کی اطاعت واجب ہے، وسَلامٌ (سلام ہو)، پس ہم ان کی مثال بن جائیں۔ پھر فرمایا: والْحَمْدُ لِلَّهِ (اور تمام تعریف اللہ کے لیے ہے)، یعنی ثناء کے نتائج۔ کیونکہ جو کچھ بھی وہ لائے، اس کا مقصد صرف اللہ کی ثناء کرنا تھا۔ پس اللہ کی ثناء کے نتائج، اس چیز میں جس سے اس نے خود کو پاک قرار دیا، یہ ہیں کہ اس میں اللہ کی ثناء یہ ہے کہ اللہ تعالیٰ نے انہیں اس سے گویا کیا اور اسے ان کی ذاتوں میں موجود کیا۔ کیونکہ جو کچھ انہوں نے کہا وہ حق ہونا ضروری ہے۔ اور اسی لیے اس نے فرمایا: والْحَمْدُ (اور حمد)، کیونکہ حمد نتیجہ ہے۔ پس ثناء کے نتائج اللہ کی طرف لوٹتے ہیں۔ اور امر کا نتیجہ اس کا آخر ہوتا ہے، اور جو کچھ انہوں نے کہا اس کا کوئی آخر نہیں سوائے اس کے کہ وہ اللہ تعالیٰ کی طرف سے ان میں موجود ہے۔ کیونکہ وہ رب العالمین ہے، اس لحاظ سے کہ وہ اپنی ربوبیت میں ان مقدس صفات کے ساتھ ثابت ہے جن کا رب مستحق ہے، اور وہ عالم کا آقا، ان کا پالنے والا، ان کا رزق دینے والا اور ان کی اصلاح کرنے والا ہے: لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ (اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے)۔\n\nاور جہاں تک اس کے فرمان ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ (اور آسمانوں اور زمین میں اسی کے لیے کبریائی ہے) کا تعلق ہے۔\n\n[عالم علو اور سفل میں محصور ہے]\n\nجان لو کہ عالم علو (بلندی) اور سفل (پستی) میں محصور ہے۔ اور علو اور سفل ایک اضافی، نسبتی امر ہے۔ اس کا بلند حصہ سماء (آسمان) کہلاتا ہے اور اس کا نچلا حصہ اس کے لیے ارض (زمین) کہلاتا ہے۔ اور یہ دونوں نسبتیں اس کے لیے ایک درمیانی امر کے بغیر نہیں ہو سکتیں جو ان دونوں کے درمیان ہو۔ اور الحق (ذات حق) تعالیٰ اپنی ذات کے لحاظ سے ان چیزوں میں سے کسی سے بھی متصف نہیں ہوتا جن سے عالم کا وجود متصف ہوتا ہے۔ پس عظمت اور کبریائی (الكبرياء) جو فہم رکھنے والوں کی زبانوں پر اس کی طرف منسوب کی جاتی ہے، وہ یہ ہے کہ جب اللہ نے اپنی کبریائی (الكبرياء) کو منسوب کیا تو اس کا محل صرف آسمانوں اور زمین کو بنایا، پس فرمایا: ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ (اور آسمانوں اور زمین میں اسی کے لیے کبریائی ہے)، اس نے اپنی ذات میں نہیں کہا۔ پس محل ہی اس کبریائی سے موصوف ہے جو اللہ کے لیے ہے۔ پس جب عالم خود کو چھوٹا دیکھتا ہے اور اپنے موجد کو ان چیزوں سے پاک دیکھتا ہے جو اس کے لائق ہیں، تو وہ اپنے رب کو کبیر اور کبریائی والا کہتا ہے، اس لیے کہ وہ اس کے نزدیک بڑا ہوا، اس تاثیر اور قہر کی وجہ سے جو اس میں ہے۔ اسی طرح جب اس کی حاجت اور غیر کی طرف فقر (احتیاج) قائم ہوا، تو اسے یہ اعتقاد رکھنا اور جاننا ضروری ہوا کہ جس پر اس نے اپنے فقر میں بھروسہ کیا ہے، وہ غنی (الغني) ہے۔ پس وہ سبحانہ اپنے بندے کی ذات میں غنی ہے۔ اور وہ اپنی ذات کے لحاظ سے عالم کی طرف نظر سے پاک ہے، وہ غنی سے متصف نہیں ہوتا کیونکہ وہاں کوئی دوسرا نہیں ہے۔ اسی طرح جب اس نے اپنی ذلت کو دیکھا تو جان لیا کہ وہ اپنی ذات کے لیے ذلیل نہیں ہوتا، بلکہ اپنے اوپر کسی دوسرے کے تسلط کے تحت ذلیل ہوتا ہے، پس اس نے اسے عزیز (العزیز) کہا۔ کیونکہ الحق (ذات حق) اس بندے کی ذات میں اس کی ذلت کی وجہ سے عزیز ہوا۔ پس بندہ ہی وہ محل ہے جو اللہ کی کبریائی (الكبرياء)، غنی (الغني)، عظمت اور عزت کا محل ہے۔ پس بندے نے اپنے رب کی صفت اس چیز سے بیان کی جو اس میں قائم ہوئی، تو معنی نے اپنا حکم اس کے لیے واجب کر دیا جس میں وہ قائم نہیں ہوا۔ اور یہیں سے اہل نظر میں سے ان لوگوں کے لیے ایک چمک پیدا ہوئی جنہوں نے کہا کہ باری تعالیٰ ایک حادث ارادے سے ارادہ کرنے والا ہے جو اس میں قائم نہیں ہوا، کیونکہ وہ حوادث کا محل نہیں ہے۔ پس اس نے ایک ارادہ پیدا کیا جو کسی محل میں نہیں تھا، اور اس کے ذریعے ارادہ کیا، تو ارادے نے اپنا حکم اس کے لیے واجب کر دیا جس میں وہ قائم نہیں ہوا۔ یہ وہ قدر ہے جو ان کے نزدیک اس امر کی روح سے ظاہر ہوئی جو ہم نے کبریائی (الكبرياء) کے بارے میں ذکر کیا۔ لیکن وہ اپنی نظر کو آخر تک مکمل نہ کر سکے، بلکہ انہوں نے اس کا اظہار بری اور ملی جلی عبارات سے کیا۔ کیونکہ اکثر عقلمند یہ سمجھتے ہیں کہ معانی اپنے احکام کو صرف اسی کے لیے واجب کرتے ہیں جس میں وہ قائم ہوں۔ اور یہ ان پر ایک غلطی وارد ہوئی، کیونکہ انہوں نے صفات کو متعدد وجودی حقائق (أعیان) ثابت کیا جو خود قائم نہیں ہوتیں، بلکہ ایک موصوف کا تقاضا کرتی ہیں جس میں وہ قائم ہوں، تاکہ وہ اس سے موصوف ہوں۔ اگر وہ یہ جان لیتے کہ یہ سب ایک ہی حقیقت (عین) میں نسبتیں اور اضافات ہیں، تو وہ حقیقت اس نسبت سے عالمہ (جاننے والی) ہوتی، اور اس نسبت سے قادره (قدرت والی)، اور اس نسبت سے مریدہ (ارادہ کرنے والی)، اور اس نسبت سے کبیرہ (بڑی)، اور اس نسبت سے غنیہ (بے نیاز)، اور اس نسبت سے عزیزہ (غالب)، اور اسی طرح باقی صفات اور اسماء تک، تو وہ درست بات پر پہنچ جاتے۔\n\nکیا تم نہیں دیکھتے کہ وہ کبریائی (الكبرياء)، عظمت، غنی (الغني) اور عزت کے بارے میں کہتے ہیں کہ یہ تنزیہ کی صفات ہیں، یعنی وہ ان کے نزدیک ان کے متضاد سے پاک ہے۔ لیکن محققین (المحققين) کے نزدیک معاملہ ایسا نہیں ہے جیسا کہ انہوں نے کہا۔ بلکہ وہ اس بات سے پاک ہے کہ کبریائی اس میں قائم ہو، اس طرح کہ وہ اس کا محل بنے۔ بلکہ کبریائی کا محل وہ ہے جو الحق (ذات حق) نے اس کے لیے مقرر کیا ہے، اور وہ آسمان اور زمین ہیں۔ پس فرمایا: ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ (اور آسمانوں اور زمین میں اسی کے لیے کبریائی ہے)۔ اور وہ، یعنی الحق (ذات حق) کی ہویت، العزیز (غالب) ہے، یعنی اپنی ذات کے لیے اس بات سے محفوظ ہے کہ وہ اس چیز کا محل بنے جس کا محل آسمان اور زمین ہیں، اور وہ صرف کبریائی ہے۔ پس وہ صرف عالم کی ذات میں ہی بڑا ہوا، اور وہ اس سے کہیں زیادہ جلیل ہے کہ کوئی ایسا امر اس میں قائم ہو جو وہ خود نہیں ہے۔ بلکہ وہ تمام وجوہ سے واحد ہے، اور وہ اس چیز میں الحکیم (حکمت والا) ہے جو اس نے خلق میں ترتیب دی۔ اور جو کچھ اس نے اپنے علم اور حکمت سے ترتیب دیا، اس میں سے یہ ہے کہ اس نے آسمانوں اور زمین کو اپنی کبریائی کا محل بنایا۔ پس گویا وہ فرما رہا ہے: ولَهُ الْكِبْرِياءُ (اور اسی کے لیے کبریائی ہے) جو اس نے آسمانوں اور زمین کی ذات میں پیدا کی، تاکہ وہ اس کے ذریعے اپنے معبود کی بڑائی بیان کریں۔ اور ایسا ہی ہوا، پس انہوں نے اپنی ذاتوں میں اس کی بڑائی بیان کی اور کہا کہ وہ ذوالجلال ہے، یعنی اس جلال کا مالک جسے ہم اپنی ذاتوں میں اس کے لیے پاتے ہیں، اور ہمارے ذریعے اکرام والا ہے۔ پس اگر تم حقیقت کی آنکھ سے دیکھو، اور اللہ تمہاری فہم کی آنکھ کھول دے، تو تم جان لو گے کہ تم نے کس کا نام لیا، کس کی صفت بیان کی، کس کی نعت بیان کی، اور یہ صفات کس کے لیے ہیں، اور کس میں قائم ہوئیں، اور کس حقیقت کی طرف منسوب ہوئیں۔ اور جہاں تک اس کے اس فرمان کا تعلق ہے جس میں اس نے اپنی ذات کو ان چیزوں سے موصوف کیا جو اہل نظر کے نزدیک حقیقت میں خلق کی صفات ہیں اور انہوں نے انہیں اللہ کے حق میں مجازاً لیا، جیسے بھوک، پیاس، بیماری، غضب، رضا، ناراضگی، تعجب، خوشی، خوش اخلاقی، قدم، ہاتھ، آنکھ اور بازو، اور اس طرح کی مثالیں جو رسولوں کی زبانوں پر اللہ کی طرف سے خبروں میں وارد ہوئیں، اور جو کلام اللہ کی طرف منسوب ہے جسے صحیفہ، قرآن، فرقان، تورات، انجیل اور زبور سے تعبیر کیا جاتا ہے، تو محققین (المحققين) کے نزدیک معاملہ یہ ہے کہ یہ سب الحق (ذات حق) کی صفات ہیں، نہ کہ خلق کی صفات، اور خلق نے ان سے الحق (ذات حق) کے ساتھ مزاحمت کرتے ہوئے اتصاف کیا، جیسا کہ عالم بھی تمام اسماء الٰہیہ حسنیٰ سے متصف ہوا، اور اہل نظر نے ان پر اجماع کیا، اور وہ سب اس کے اسماء ہیں بغیر کسی تخصیص کے۔ محققین کا اس میں یہی مسلک ہے، کیونکہ وہ سچا ہے۔ اور اسی لیے ہم اس معاملے میں توقیف (نصوص پر ٹھہرنے) پر ہیں، پس ہم اس کی صفت صرف اسی سے بیان کرتے ہیں جس سے اس نے خود کو موصوف کیا، اور اسے صرف اسی نام سے پکارتے ہیں جس سے اس نے خود کو پکارا۔ ہم نہ اس کے لیے کوئی نام ایجاد کرتے ہیں، نہ اس کے لیے کوئی حکم نیا بناتے ہیں، اور نہ اس پر کوئی صفت قائم کرتے ہیں۔ کیونکہ ہم تمہیں پہلے بتا چکے ہیں کہ وہ ہماری مماثلت نہیں کرتا اور نہ ہم اس کی مماثلت کرتے ہیں۔ پس لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں ہے) ہم میں سے، اور ہماری مثال کوئی چیز نہیں ہے اس میں سے۔ پس وہ اپنی ذات کے لیے اپنی ذات سے ہے، اور ہم اس کے ذریعے ہمارے لیے ہیں، کیونکہ ہم اپنے وجود (الوجود) میں خود مختار نہیں ہیں جیسا کہ وہ خود مختار ہے۔ مگر اس نے عالم کو اپنی صورت پر پیدا کیا، اور اسی لیے اس نے اپنے اسماء سے موسوم ہونا قبول کیا۔ پس عالم پر وہی اطلاق ہوا جو الحق (ذات حق) پر اطلاق ہوا، اس لحاظ سے کہ الحق (ذات حق) نے اسے اپنی ذات پر مطلق کیا۔ پس ہم نے جانا کہ وہ اپنے اسماء میں اصل ہے، نہ کہ ہم۔ پس اس نے کوئی ایسی چیز نہیں لی جو ہماری ہو یا جس کے ہم مستحق ہوں، بلکہ یہ سب کچھ اسی کا ہے۔ اور اللہ نے جو کچھ پیدا کیا، ان میں سے ایک خیال (الخیال) ہے، اور وہ ان اسماء اور صفات کے ساتھ اس میں ہمارے لیے ظاہر ہوا، پس ہم نے تفصیل کی، تقسیم کی، بلند کیا، اور منصوبہ بندی کی، اور ہمارے نزدیک عالم کی کوئی صفت نہیں چھوڑی مگر ہم نے اس سے اپنے خالق کی صفت بیان کی۔ پس اس نے ہمارے لیے کشف (الکشف) کیا، تو معلوم ہوا کہ یہ سب اس کی صفات ہیں نہ کہ ہماری صفات۔ پس عالم کی صفات حقیقت میں الحق (ذات حق) کی ہویت ہیں، اور اختلاف ممکنات کی حقیقتوں کے لیے الحق (ذات حق) کی حقیقت میں الٰہی تجلیات (التجلیات) میں ہے۔ کیونکہ وہ عین وہی صورت ہے جسے ہم نے ادراک کیا، کیونکہ ہمیں اس میں کوئی شک نہیں کہ ہم نے الحق (ذات حق) کو اس علامت کے ذریعے دیکھا جو ہمارے اور اس کے درمیان ہے، اور وہ اس کی ہویت سے ہماری بصارت اور سماعت ہے۔ پس ہم نے اسے صرف اسی کے ذریعے دیکھا، نہ کہ اپنی بصارت سے، اور نہ ہم نے اس کا کلام سنا مگر اسی کے ذریعے، نہ کہ اپنی سماعت سے۔ پس ایک حقیقت (عین) کا ہونا ضروری ہے جو عالم کا مسمیٰ ہے، اور ایک حقیقت کا ہونا ضروری ہے جو الحق (ذات حق) کا مسمیٰ ہے۔ ان میں سے کسی ایک کی مثال دوسرا نہیں ہے۔ یہ ان چیزوں میں سے کچھ ہے جو تواضع کبریائی (التواضع الكبريائي) پر مشتمل ہیں۔ اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و هشتاد و هفتم در معرفت منازل تواضع کبریا (التواضع الكبريائي)\n\n> هر که از آنچه هم‌جنس اوست هراسان شود، *** نادانی است که از خویشتن گمراه گشته است.\n> اگر اوصاف خود را می‌دانست، *** از آنچه هم‌جنس اوست هراسی نداشت.\n> و هر آنچه در هستی (الجود) است، در اوست، *** از تاریکی شب‌ها و فروغ خورشیدش.\n> و هر آنچه در کائنات است، در اوست، *** از نزول پایین‌ترش و از قدسش.\n> بنگر که تو خود امر هستی، پس بر علم ثابت بمان *** و به گمان خود منگر.\n\n### [همانا خداوند خود را در منزلت بندگانش قرار داد]\n\nخداوند تبارک و تعالی فرمود: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی همانند او نیست) و فرمود: «وما قَدَرُوا الله حَقَّ قَدْرِهِ» (و خدا را آن‌گونه که شایسته اوست نشناختند) و فرمود: «سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ» (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند) و فرمود: «ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ وهُوَ الْعَزِيزُ الْحَكِيمُ» (و کبریا (عظمت) در آسمان‌ها و زمین از آن اوست و اوست عزیز حکیم) و فرمود: «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (همانا خداوند از جهانیان بی‌نیاز است). با وجود همه اینها،\n\nاوست که در اخبار صحیح از خود می‌فرماید: «بیمار شدم و عیادتم نکردی، گرسنه شدم و طعامم ندادی، تشنه شدم و سیرابم ننمودی.»\n\nچنین سخنی را به بنده‌اش می‌گوید، پس در اینجا خود را در منزلت بندگانش قرار داده است. آن کبریا کجا و این نزول کجا؟ و در حدیث صحیح ثابت شده است که خداوند از جوانی که میل به گناه ندارد، در شگفت می‌شود.\n\nو ثابت شده است که شادی خداوند به توبه بنده‌اش بیشتر از شادی صاحب شتری است که طعام و آبش بر آن است و پس از گم شدن در بیابانی دورافتاده و یقین به مرگ، آن را می‌یابد؛ پس خداوند به توبه بنده‌اش شادتر از این شخص به شترش است.\n\nو ثابت شده است که خداوند متعال برای کسی که به مسجد می‌آید، بشاش می‌شود، همان‌گونه که خانواده غایب، هنگام بازگشت او، بشاش می‌شوند.\n\nو این همه کجا در برابر این سخن خداوند متعال قرار می‌گیرد: «سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وسَلامٌ عَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند، و سلام بر فرستادگان، و سپاس از آنِ خداوند، پروردگار جهانیان است) و «وما قَدَرُوا الله حَقَّ قَدْرِهِ» (و خدا را آن‌گونه که شایسته اوست نشناختند)؟ پس این نزول کجا و آن رفعت کجا؟ این همان تواضع کبریا (التواضع الكبريائي) است و همه آن حق و سخن راست و حکم صحیحی است برای کسی که خداوند پرده از بصیرت او برداشته باشد از میان بندگان عالمش، پس حق را حق و باطل را باطل به او نشان دهد. و در اینجا رؤیت به معدوم تعلق گرفته است، زیرا باطل، عدم است. و اگر بنده به صفت رؤیت معدوم متصف شود، حق (الحق) به این صفت سزاوارتر است که ما را در حال عدممان با رؤیت عین و بصر می‌بیند، نه با رؤیت علم. و اما سخن او که «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی همانند او نیست)، بر فهم صحیح، معنای سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است که: «همانا خداوند آدم را بر صورت خود آفرید» در برخی از وجوه محتمل این خبر. و سخن خداوند متعال: «لَقَدْ خَلَقْنَا الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ» (به راستی انسان را در نیکوترین ساختار آفریدیم). این نیست مگر به دلیل آفرینش او بر صورت حق (الحق). و او را به «أَسْفَلِ سافِلِينَ» (پایین‌ترینِ پایین‌ها) بازگرداند تا کمال صورت را با اوصاف برای او جمع کند، همان‌گونه که خود درباره خویش ذکر کرده است که بر آن است. زیرا اتصاف او به نفی مثل از خود، از اتصاف او به حد و مقدار است، از استواء و نزول و استعطاف و تلطف در خطاب و غضب و رضایت، که همه اینها صفات مخلوق است. اگر خود را به صفات ما وصف نمی‌کرد، او را نمی‌شناختیم، و اگر خود را از صفات ما منزه نمی‌داشت، باز هم او را نمی‌شناختیم. پس او در هر دو حال شناخته شده و به هر دو صفت موصوف است. به همین دلیل از هر چیزی دو زوج آفرید تا برای یکی از زوجین علو باشد که همان مذکر است، و برای دیگری سفل باشد که همان مؤنث است، تا با اجتماع آن دو، بقای اعیان آن نوع آشکار شود. و این را در هر نوعی قرار داد تا به ما بیاموزد که امر در هستی (الوجود) ما بر این منوال است. پس ما بین او و معقولیت طبیعت هستیم که اجسام طبیعی را از آن پدید آورد، و ارواح مدبره را از نسبت توجه خود بر آن پدید آورد. و هر آنچه غیر خداست، ناگزیر باید مرکب از راکب و مرکوب باشد تا افتقار راکب به مرکوب و افتقار مرکوب به راکب صحیح باشد، تا سبحانه به غنا (بی‌نیازی) منفرد گردد، همان‌گونه که خود را وصف کرده است. پس او برای ذات خود غنی است و ما به واسطه او غنی هستیم، در عین افتقارمان به او، زیرا چیزی نیست که از آن بی‌نیاز باشیم. پس هر آنچه غیر خداست، مدبَّر و مدبِّر برای این مدبَّر است. مدبِّر (اسم فاعل) به واسطه مدبِّر بودن، در ذات خود قدرتی می‌یابد که به مدبَّری نیازمند است تا تدبیرش در آن آشکار شود. و مدبَّر (اسم مفعول) به واسطه مدبَّر بودن، در ذات خود حالتی می‌یابد که به واسطه آن به کسی نیازمند است که ذاتش را برای صلاح عین و بقایش تدبیر کند. پس فقر هر یک به دیگری، فقری ذاتی است. و تنها به این دلیل به غنا (بی‌نیازی) از آن متصف می‌شود که فقط به مدبِّر نیازمند است، نه به این مدبَّر خاص. همان‌گونه که مدبِّر به غنا متصف می‌شود، زیرا فقط به مدبَّر نیازمند است، نه به این مدبَّر خاص. پس هر یک از آن دو، از عین دیگری غنی است، نه از تدبیر از جانب او و در او. بنابراین، غنای هر یک مطلق نیست، در حالی که غنای حق (الحق) با نظر به ذاتش مطلق است، و خلق با نظر به ذاتش مطلقاً نیازمند است. پس حق از خلق متمایز شد. به همین دلیل، کسی که گفت: «إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ» (همانا خداوند فقیر است و ما بی‌نیازیم) کافر شد. این تمایز هرگز برداشته نمی‌شود، زیرا تمایزی ذاتی در موصوف به آن، یعنی حق و خلق است. پس جز دو شیئیت (شیئیت حق و شیئیت خلق) وجود ندارد. هیچ چیزی در افتقار مانند خلق نیست، زیرا جز حق (الحق) وجود ندارد و حق به افتقار وصف نمی‌شود، پس او مثل خلق نیست. و هیچ چیزی در غنا مانند حق نیست، زیرا جز خلق وجود ندارد و خلق به ذات خود متصف به غنا نیست، پس او مثل حق نیست. همان‌گونه که گفتیم، جز خلق و حق چیزی نیست. خلق از حیث عین، یک ذات واحد در کثرت است، و حق از حیث ذات و عین، یک ذات واحد است که اسامی و نسبت‌های بسیاری دارد. پس کسی که سخن خداوند متعال «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی همانند او نیست) را بر اساس آنچه مقرر کردیم نداند، علمی به این آیه ندارد. زیرا او با «کاف» آمد، سپس با افزودن «کاف» برای تأکید در نفی، مثل بودن را از خود نفی کرد، سپس با قرار دادن «کاف» به عنوان صفت، مثل بودن را از عالم نفی کرد. پس نفی را به مماثل در نفی معلق ساخت؛ یعنی مثل بودن از خلق منتفی شد، زیرا جز حقی که مماثل ندارد، وجود ندارد، و مثل بودن از حق منتفی شد، زیرا جز خلقی که مماثل ندارد، وجود ندارد.\n\n> پس معانی را این‌گونه بفهم، *** هنگامی که نور با بیان به ما می‌رسد.\n> در هستی (الوجود) جز یک فرد نیست، *** حق (الحق)، و اگر بخواهید، دو تاست.\n> و هر عین (ذات) برای خود انفرادی دارد، *** که با دومی دیده نمی‌شود.\n> و حکمی از او در نماز آمده است، *** به تقسیم مثانی (دوگانه‌ها).\n> پس خلق را در آن از خود متمایز ساخت، *** به همین دلیل دوگانگی آشکار شد.\n> پس فرمود: «میان من و بنده‌ام»، *** پس هر که او را ببیند، مرا دیده است.\n> من جز خدا نیستم و او نیز نیست، *** به دلیل وحدت من در هستی (الوجود)، دومی وجود ندارد.\n> زبان خلق از او ترجمه کرد، *** به آنچه از بیان ذکر کردیم.\n\nو اما سخن او که «وما قَدَرُوا الله حَقَّ قَدْرِهِ» (و خدا را آن‌گونه که شایسته اوست نشناختند)، اوست که آنان را به آنچه درباره‌اش گفتند، به سخن آورد. زیرا او درباره کسانی که علیهشان شهادت داده می‌شود، می‌فرماید: «قالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا قالُوا أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ» (به پوست‌های خود گفتند: چرا بر ضد ما شهادت دادید؟ گفتند: خداوندی که هر چیزی را به سخن درآورد، ما را به سخن درآورد). پس هیچ چیز به سخن نمی‌آید مگر آنکه خداوند آن را به سخن آورده باشد. و آنچه به آن نطق شده، متفاوت است: نطق (منطوق به) که به مدح تعلق دارد، و نطق که به ذم تعلق دارد، و نطق که به مجاز تعلق دارد به دلیل توافقی که خداوند در عالم قرار داده است، و نطق که بر اساس مدلول خود در نفس امر است و خبری از حقیقت است. و جز آنچه ذکر کردیم، نیست. پس نطق مدح، شهادت صاحبان علم به توحید خداوند است، و نطق ذم، سخن گوینده‌ای است که می‌گوید: «إِنَّ الله فَقِيرٌ» (همانا خداوند فقیر است) و «يَدُ الله مَغْلُولَةٌ» (دست خدا بسته است) که منظور بخل است. و نطق به حقیقت: «والله خَلَقَكُمْ» (و خداوند شما را آفرید). و نطق به مجاز برای توافق: «وما تَعْمَلُونَ» (و آنچه عمل می‌کنید). و آیه یکی است. اما سخن او که «وما قَدَرُوا الله حَقَّ قَدْرِهِ» (و خدا را آن‌گونه که شایسته اوست نشناختند) به این دلیل است که آنان مثل او نیستند، پس او را نشناختند. و کسی که امر او را نداند، قدر او را نمی‌شناسد. پس آنان مثل او نیستند و او نیز مثل آنان نیست. بنابراین، او را با نفوس خود و آنچه بر آن هستند وصف کردند، و جز این برایشان ممکن نیست، زیرا آنان وصف ثبوتی می‌خواهند و این جز با تشبیه ممکن نیست. و هر کس برای کسی که مثل نمی‌پذیرد، مثلی قرار دهد، او را آن‌گونه که شایسته است نشناخته است؛ یعنی او را در منزلتی که سزاوار آن است قرار نداده است. پس خداوند آنان را به دلیل جهلشان مذمت کرد، زیرا به چیزی پرداختند که از نفوس خود به آن علم نداشتند. اگر درباره او به آنچه بر آنان نازل کرده بود، سخن می‌گفتند، مذمتی از جانب حق (الحق) متوجه آنان نمی‌شد، زیرا حکایت‌کننده، آنچه را حکایت کرده است، به خود نسبت نمی‌دهد، پس نه مذمتی متوجه او می‌شود و نه مدحی. پس علم خلق به خداوند با قیاس درک نمی‌شود، بلکه با بقای گوش برای خطاب حق (الحق) درک می‌شود، یا به ذات خود یا به زبان مترجم از او که همان رسول است، همراه با شهود (الشهود) که با آن جز آنچه از خطاب شنیده است، برایش میسر نیست. همان‌گونه که فرمود: «إِنَّ في ذلِكَ» (همانا در این) که اشاره به آنچه گذشت دارد، «لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ» (یادآوری است برای کسی که قلب دارد)، پس به نظر فکری با دگرگونی احوال بر آن ارجاع داد، «أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ» (یا گوش فرا دهد در حالی که شاهد است). و جز این دو صنف، راهی برای علم به آنچه حق (الحق) سزاوار است به او نسبت داده شود و آنچه خلق سزاوار است به آنان نسبت داده شود، ندارند. پس هر کس خود را شناخت، حق (الحق) با او مماثلت ندارد، و هر کس پروردگارش را شناخت، خلق با او مماثلت ندارد. زیرا معرفت (المعرفة) شما به یک جزء از عالم، از آن جهت که دلیلی است، عین معرفت شما به تمام عالم است. به همین دلیل، ما عالم را در منزلت واحد قرار دادیم و مماثلت را از آن نفی کردیم، زیرا در هستی (الوجود) جز حق (الحق) نیست، و حق مثل عالم نیست، اگرچه عالم برخی از اجزایش با برخی دیگر مماثلت دارد، همان‌گونه که در اسماء الهی مانند غافر و غفور و غفار و امثال آن حکم می‌شود که آنها امثال هستند، اگرچه به مراتبی متمایز می‌شوند، مانند عالم که در آن امثالی وجود دارد، اگرچه به اعیان و مراتب متمایز می‌شوند. به همین دلیل، این آیات نازل نشد مگر در مقابل سخنی که از آنان صادر شده بود و در خبر نبوی آمده است. و اما در قرآن، سخن او: «وما قَدَرُوا الله حَقَّ قَدْرِهِ إِذْ قالُوا ما أَنْزَلَ الله عَلى‏ بَشَرٍ من شَيْءٍ» (و خدا را آن‌گونه که شایسته اوست نشناختند، آنگاه که گفتند: خداوند بر هیچ بشری چیزی نازل نکرده است)، با وجود اقرارشان به اینکه تورات بر موسی (علیه السلام) از جانب خداوند نازل شده است. پس بر خداوند دروغ بستند و «اسْوَدَّتْ وُجُوهُهُمْ» (چهره‌هایشان سیاه شد)، یعنی ذواتشان، پس نوری ندارند که با آن اشیاء را کشف کنند، بلکه کورند و نمی‌بینند. و اما سخن او: «سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وسَلامٌ عَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند، و سلام بر فرستادگان، و سپاس از آنِ خداوند، پروردگار جهانیان است)، این آیه نزد عارفان از جهت تداخلی که در آن است، از هر آیه دیگری دشوارتر است. زیرا تحت سخن خداوند متعال در تنزیه خود «عَمَّا يَصِفُونَ» (از آنچه وصف می‌کنند)، آنچه بندگانش او را بدان وصف می‌کنند، وارد شده است؛ از آنچه ادله آنان در گمانشان از طریق نظر فکری به هر یک از آنان می‌دهد، و هر یک ادعای تنزیه خالق خود را در آن دارد. اما فیلسوف، علم به مفردات عالم را که در حس واقع می‌شوند، از او نفی کرد. پس نزد آنان معلوم نیست که مثلاً زید بن عمرو در هنگام زوال انگشت خود را حرکت داده است، یا در این وقت لباس خاصی بر تن دارد، بلکه می‌داند که در عالم کسی هست که مطلقاً و بدون تعیین دارای این صفت است، زیرا حصول این علم به صورت تعیین، تنها برای حس است و خداوند از حواس منزه است. پس این علم به این جزء نزد آنان در علم کلی که همان وجود کسی در عالم با این منزلت است، مندرج شده است. و مقصود نزد آنان حاصل شده است، اما علم بزرگی از آنان فوت شده است، زیرا ممکن است صاحب این حرکت معین از شخص معین، توسط دیگری انجام شود. پس حجت خداوند بر تعیین این بنده به چه چیزی اقامه می‌شود تا او را در آخرت بر آن مؤاخذه کند یا او را از آنچه در دنیا سزاوار است محروم سازد، یا آن حرکت را انجام نداده باشد؟ اگرچه از اصل نظر این شخص، انکار آخرت محسوس و انکار بخشش در دنیا و جزای صاحب این حرکت به صورت تعیین است، و از مذهب او این است که آن حرکت به ذات خود مانع از آن است که برای انجام‌دهنده آن، آنچه حقیقت آن حرکت مانع آن است، حاصل شود. پس او بر اصلی فاسد بنا نهاده است و آن اینکه از خداوند جز آن واحد اول به دلیل احدیتش صادر نشده است، سپس عالم برخی از برخی دیگر منفعل شده است، بدون تعلق علم تفصیلی از جانب خداوند به آن، بلکه با علم کلی که بر آن است. و اما متکلم، مانند اشعری، در تنزیه خود از تشبیه به محدث، به تشبیه به محدث منتقل شد. مثلاً در استواء (استقرار) او بر عرش گفت: محال است که استواء او استواء اجسام باشد، زیرا او جسم نیست، به دلیل آنچه در آن از حد و مقدار است و نیاز به مخصص مرجح برای مقادیر، که در نتیجه افتقار برای او ثابت می‌شود. بلکه استواء او مانند استواء پادشاه بر مُلک خود است. و در این باره برای استشهاد بر آنچه از استواء بدان رفته‌اند، شعر خواندند:\n\n> قد استوى بشر على العراق *** من غير سيف ودم مهراق‏\n> (بشر بر عراق مستولی شد *** بدون شمشیر و خون ریخته شده)\n\nپس استواء حق (الحق) بر عرش را به استواء بشر بر عراق تشبیه کردند، در حالی که استواء بشر محدث است، پس او را به محدث تشبیه کردند، و قدیم شبیه محدث نیست، زیرا خداوند می‌فرماید: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی همانند او نیست). و نظر صحیح خلاف آنچه آنان گفتند، می‌دهد. پس خداوند متعال در حق هر ناظری فرمود: «سُبْحانَ رَبِّكَ» (منزه است پروردگار تو) که ضمیر این کاف به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) برمی‌گردد، یعنی پروردگار تو که تو را به سوی آنان فرستاد تا آنان را به آنچه برای آن فرستاده‌ای و به واسطه تو بر آنان نازل کرده است، بشناسانی. «رَبِّ الْعِزَّةِ» (پروردگار عزت)، یعنی او به ذات خود ممتنع است از پذیرش آنچه آنان در نظر خود او را بدان وصف کردند و با عقول خود بر او حکم راندند، و خلق بر حق (الحق) حکم نمی‌راند، و عقل و عاقل مخلوقند. و حق (الحق) تنها از طریق حق شناخته می‌شود، به آنچه بر ما نازل کرده یا با کشف (الکشف) و شهود (الشهود) از طریق وحی الهی یا رسالت رسولی که صدق و عصمت او در ابلاغ از جانب خداوند به ما ثابت شده است، ما را بر آن مطلع ساخته است. «عَمَّا يَصِفُونَ» (از آنچه وصف می‌کنند) از آن جهت که با فکر خود نظر کردند و با عقول خود استدلال نمودند، زیرا علم به خداوند تحول به جهل و ورود شبهه را نمی‌پذیرد. و هیچ دلیل عقلی نیست مگر آنکه ورود و شبهه را می‌پذیرد. به همین دلیل، عقلا اختلاف کردند، پس هر یک از مخالفان، دلیل مخالف خود را شبهه‌ای برای او می‌داند، زیرا با دلیل دیگری مخالفت کرده است. پس عین ادله همه آنان، عین شبهاتشان است. پس حق (الحق) کجاست و اعتماد کجاست؟ و اصل فساد از آنجا رخ داد که خلق را بر حقی که آنان را ایجاد کرده است، حاکم ساختند. سپس فرمود: «وسَلامٌ عَلَى الْمُرْسَلِينَ» (و سلام بر فرستادگان). و رسولان (علیهم السلام) نیامدند مگر با آنچه این ادله نظری آن را محال دانستند و با آنچه آن را اثبات کردند. پس آنان را در نظرشان تصدیق کرد و در نظرشان تکذیب نمود، و در نتیجه حیرت نزد اینان واقع شد. پس اگر آنچه را که او از خود بر زبان رسولانش گفته است، تسلیم کنند و از آنان پیروی نمایند، پیروی آنان از ایشان، آنان را در منزلتشان قرار می‌دهد، زیرا آنان از حیث اعیانشان از رسولان پیروی نکردند، چون آنان نیز مانند خودشان هستند، بلکه از کسی پیروی کردند که رسولان از نزد او آمده‌اند و آنچه را که او از خود خبر داده است، نقل کرده‌اند، بر اساس آنچه خود را می‌شناسد، نه بر اساس تأویل کسی که آن به او رسیده است. پس مراد خداوند در آن دانسته نمی‌شود مگر با اعلام خداوند. پس ناظر در موضع تسلیم نسبت به آنچه وارد شده است، می‌ایستد، همراه با فهم این نکته که آن بر موضوعی است که در آن زبانی است که این رسول با آن آمده است. این امر ضروری است، زیرا او آن را با این زبان نیاورده است مگر برای اینکه بدانیم آن بر حقیقت وضع شده برای آن لفظ در آن زبان است، اما نسبت مجهول است. پس علم نسبت را به او تسلیم می‌کنی، همراه با درک دلالت با وضع اصطلاحی در آن لحن خاص. پس از او پیروی می‌کنی، همان‌گونه که رسولان پیروی کردند. به همین دلیل فرمود: «عَلَى الْمُرْسَلِينَ» (بر فرستادگان)، یعنی انقیاد به سخن او بر آنان واجب است، «وسَلامٌ» (و سلام)، پس ما نیز مانند آنان می‌شویم. سپس فرمود: «والْحَمْدُ لِلَّهِ» (و سپاس از آنِ خداوند است)، یعنی عواقب ثنا. زیرا هر آنچه رسولان آوردند، تنها قصدشان ثنا بر خداوند بود. پس عواقب ثنا بر خداوند در آنچه خود را از آن منزه داشته است، این است که ثنا بر خداوند در آن، به دلیل این است که خداوند متعال آنان را به آن به سخن آورده و آن را در نفوسشان ایجاد کرده است، زیرا آنچه گفتند، ناگزیر حق است. به همین دلیل فرمود: «والْحَمْدُ» (و سپاس)، زیرا حمد، عاقبت است. پس عواقب ثنا به خداوند بازمی‌گردد. و عاقبت امر، آخر آن است، و آخر آنچه گفتند، جز موجود بودن آن از جانب خداوند متعال در آنان نیست. زیرا او پروردگار جهانیان است، از حیث ثبوتش در ربوبیتش با آنچه رب از نعوت مقدسه سزاوار آن است، و او سرور عالم و مربی و روزی‌دهنده و اصلاح‌کننده آنان است. «لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ» (هیچ معبودی جز او نیست، عزیز حکیم).\n\n### [عالم محصور در علو و سفل است]\n\nو اما سخن او که «ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ» (و کبریا (عظمت) در آسمان‌ها و زمین از آن اوست). بدان که عالم محصور در علو و سفل است، و علو و سفل امری اضافی و نسبی برای آن است. بخش بالایی آن سماء (آسمان) نامیده می‌شود و بخش پایینی آن ارض (زمین) نامیده می‌شود. و این دو نسبت برای آن حاصل نمی‌شود مگر به واسطه امری میانی که بین آن دو باشد، و آن امر در ذات خود دارای جهاتی است. پس آنچه بر آن سایه افکنده، سماء است و آنچه آن را حمل کرده، ارض برای آن است. و اگر بخواهی، در مورد ملأ اعلی و ملأ اسفل بگویی، هر آنچه از طبیعت تشکیل شده، ملأ اسفل است، و هر آنچه از نور متولد شده، ملأ اعلی است. و کامل‌ترین عالم کسی است که بین این دو جمع کند، و او برزخ است که با جهات خود آن دو را متمایز ساخته، یا با جامعیت خود آن دو را به علو و سفل متمایز کرده است، از حیث مؤثر (اسم فاعل) و مؤثر فیه (اسم مفعول). و حق (الحق) تعالی با نظر به ذات خود، به هیچ یک از آنچه وجود عالم بدان متصف است، متصف نمی‌شود. عظمت و کبریا (العظمة والكبرياء) که در زبان‌های اهل فهم به او نسبت داده شده، این است که خداوند چون کبریا (الکبرياء) را که از آن اوست، نسبت داد، محل آن را جز آسمان‌ها و زمین قرار نداد، پس فرمود: «ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ» (و کبریا در آسمان‌ها و زمین از آن اوست)، و نفرمود در ذات خود. پس محل، همان موصوف به کبریا است که از آنِ خداست. پس عالم هنگامی که خود را کوچک می‌بیند و خالق خود را منزه از آنچه شایسته اوست می‌بیند، پروردگارش را کبیر و صاحب کبریا می‌نامد، زیرا به واسطه تأثیر و قهری که در او دارد، نزد او بزرگ شده است. اگر عالم برای خداوند متعال مؤثر فیه نبود، نمی‌دانست که خود کوچک است و پروردگارش بزرگ. همچنین هنگامی که نیاز و فقر به غیر در او پدید آمد، لازم دید که اعتقاد و علم پیدا کند که کسی که در فقر خود به او تکیه کرده است، غنا (بی‌نیازی) از آن اوست. پس او سبحانه در نفس بنده خود غنی است، در حالی که با نظر به ذات خود، از نظر به عالم عاری است و به غنا متصف نمی‌شود، زیرا در آنجا غنی‌ای نیست. و همچنین هنگامی که به ذلت خود نظر می‌کند، می‌داند که برای خود ذلیل نمی‌شود، بلکه تحت سلطه غیر بر خود ذلیل می‌شود، پس او را عزیز نامید. زیرا عزت حق (الحق) در نفس این بنده به دلیل ذلت اوست. پس بنده محل کبریا و غنا و عظمت و عزتی است که از آنِ خداست. پس بنده پروردگارش را به آنچه در او قائم شده است، وصف کرد، و معنا، حکم خود را برای غیر کسی که در او قائم شده است، واجب ساخت. و از اینجا جرقه‌ای برای کسانی درخشید که از اهل نظر گفتند: باری (خالق) با اراده‌ای حادث اراده می‌کند که در او قائم نشده است، زیرا او محل حوادث نیست. پس اراده‌ای را در لامحل خلق کرد و با آن اراده کرد، و اراده حکم خود را برای کسی که در او قائم نشده است، واجب ساخت. این مقدار همان چیزی است که از روح این امری که در کبریا ذکر کردیم، نزد آنان آشکار شد، اما تحقیق نظر تا آخر برایشان کامل نشد، بلکه آن را با عبارات بد و آشفته بیان کردند. زیرا بیشتر عقلا بر این باورند که معانی احکام خود را واجب نمی‌سازند مگر برای کسی که در او قائم شده باشند. و این اشتباهی است که بر آنان عارض شده است، زیرا صفات را اعیان متعدد وجودی دانستند که به خودی خود قائم نیستند، بلکه نیازمند موصوفی هستند که در او قائم شوند و او بدان وصف شود. اگر می‌دانستند که همه اینها نسبت‌ها و اضافات در یک عین واحد است، که آن عین نسبت به فلان چیز عالم، و نسبت به فلان چیز قادر، و نسبت به فلان چیز مرید، و نسبت به فلان چیز کبیر، و نسبت به فلان چیز غنی، و نسبت به فلان چیز عزیز است، تا سایر صفات و اسماء، به حقیقت می‌رسیدند.\n\nآیا نمی‌بینی که آنان درباره کبریا (الکبرياء)، عظمت، غنا و عزت می‌گویند که اینها صفات تنزیه هستند، یعنی نزد آنان از نقیض خود منزه است؟ در حالی که امر نزد محققان آن‌گونه نیست که آنان گفتند، بلکه او منزه است از اینکه کبریا در او قائم شود به نحوی که محل آن باشد، بلکه کبریا محلی دارد که حق (الحق) آن را برایش تعیین کرده است و آن آسمان‌ها و زمین است. پس فرمود: «ولَهُ الْكِبْرِياءُ في السَّماواتِ والْأَرْضِ» (و کبریا در آسمان‌ها و زمین از آن اوست). و او، یعنی هویت حق (الحق)، عزیز است، یعنی به ذات خود منیع است از اینکه محل چیزی باشد که آسمان‌ها و زمین محل آن هستند، و آن چیزی جز کبریا نیست. پس کبریا جز در نفس عالم بزرگ نشد، و او اجلّ از آن است که امری که او نیست، در او قائم شود، بلکه او واحد است از جمیع وجوه. و او حکیم است به آنچه در خلق ترتیب داده است. و از جمله آنچه با علم و حکمت خود ترتیب داده، این است که آسمان‌ها و زمین را محل کبرای خود قرار داد. پس گویی می‌گوید: «ولَهُ الْكِبْرِياءُ» (و کبریا از آن اوست) که آن را در نفس آسمان‌ها و زمین خلق کرد تا خدای خود را به واسطه آن بزرگ بدارند. و همین‌گونه نیز واقع شد، پس او را در نفوس خود بزرگ داشتند و گفتند: او ذوالجلال است، یعنی صاحب جلالی که ما در نفوس خود برای او می‌یابیم، و اکرام به واسطه ماست. اگر با چشم حقیقت بنگری و خداوند چشم فهم را در تو بگشاید، خواهی دانست که چه کسی را نام بردی و چه کسی را وصف کردی و چه کسی را نعت دادی و لمن هي هذه النعوت و به چه کسی قائم شده و به کدام عین نسبت داده شده است. و اما سخن او فيما وصف به نفسه مما هو عند النظار صفة للخلق حقيقة وأخذوه في الله تجوزا (در آنچه خود را بدان وصف کرده است و نزد اهل نظر حقیقتاً صفت خلق است و آنان آن را به مجاز در مورد خداوند به کار برده‌اند)، مانند گرسنگی و تشنگی و بیماری و غضب و رضایت و خشم و تعجب و شادی و بشاش شدن، تا قدم و دست و چشم و بازو و امثال آن، که در اخبار از خداوند بر زبان رسولان وارد شده است، و آنچه از آن در کلام منسوب به خداوند که با صحیفه و قرآن و فرقان و تورات و انجیل و زبور تعبیر شده، وارد گشته است؛ امر نزد محققان این است که همه اینها صفات حق (الحق) هستند نه صفات خلق، و خلق به مزاحمت با حق به آنها متصف شده است، همان‌گونه که عالم نیز به تمام اسماء حسنای الهی متصف شده است و اهل نظر بر آن اجماع دارند، و همه آنها اسماء اوست بدون تخصیص. این مذهب محققان در این باره است، زیرا او صادق است. به همین دلیل، ما در این باره بر توقیف هستیم، پس او را جز به آنچه خود را بدان وصف کرده، وصف نمی‌کنیم و او را جز به آنچه خود را بدان نامیده، نمی‌نامیم. نه اسمی برای او اختراع می‌کنیم، نه حکمی برای او ایجاد می‌کنیم و نه صفتی را به او نسبت می‌دهیم. زیرا پیشتر برای تو بیان کردیم که او با ما مماثلت ندارد و ما نیز با او مماثلت نداریم. پس «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی همانند او نیست) از جانب ما، و چیزی مانند ما از جانب او نیست. پس او برای خود به ذات خود است، و ما برای ما به واسطه او هستیم، زیرا ما به وجود خود مستقل نیستیم، همان‌گونه که او مستقل است. جز اینکه او عالم را بر صورت خود آفرید و به همین دلیل تسمیه به اسماء او را پذیرفت. پس آنچه بر حق (الحق) اطلاق شد، بر عالم نیز اطلاق شد، از آن جهت که حق آن را بر خود اطلاق کرده است. پس دانستیم که او در اسماء خود اصل است نه ما. پس چیزی را که از آنِ ما باشد و ما سزاوار آن باشیم، نگرفته است، بلکه همه آن از آنِ اوست. و از جمله آنچه خداوند خلق کرد، خیال است، و او در آن با این اسماء و صفات برای ما ظاهر شد. پس ما تفصیل دادیم و تقسیم کردیم و بالا بردیم و طرح ریختیم و هیچ صفتی از صفات عالم را نزد خود رها نکردیم مگر آنکه خالق خود را بدان وصف کردیم. پس برای ما کشف شد که همه آن صفات اوست نه صفات ما. پس صفات عالم در حقیقت، هویت حق (الحق) است، و اختلاف در تجلیات الهی (التجلی) برای حقایق ممکنات در عین حق (الحق) است. زیرا او عین صورتی است که ما درک کردیم، چرا که در آنچه دیدیم شک نداریم که حق (الحق) را با علامتی که میان ما و اوست دیدیم، و آن از هویت اوست که بصر و سمع ماست. پس او را جز به واسطه او ندیدیم، نه به بصر خود، و کلام او را جز به واسطه او نشنیدیم، نه به سمع خود. پس ناگزیر باید عینی باشد که مسمای عالم است و ناگزیر باید عینی باشد که مسمای حق (الحق) است، و هیچ یک از آن دو شبیه دیگری نیست. این بخشی از محتوای تواضع کبریا (التواضع الكبريائي) است. و «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل» (و خداوند حق می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}