{
  "id": 84,
  "title": {
    "ar": "الباب الرابع والثمانون في تقوى الله",
    "en": "Chapter Eighty-Four: Concerning Piety towards God",
    "ur": "چوراسیواں باب: اللہ کا تقویٰ (تقوى الله)",
    "fa": "باب هشتاد و چهارم در تقوای الهی"
  },
  "content": {
    "ar": "## (الباب الرابع والثمانون في تقوى الله)\n\n\n> ما يتقي الله سوى جامع *** لكل ما في الكون من حكمته‏\n\n\n> فيتقي النقمة في نعمته *** ويتقى النعمة في نقمته‏\n\n\n> فكل ما في الكون من ظاهر *** وباطن فيه فمن نعمته‏\n\n\n> وهي التي أسبغها منة *** منه على المختار من أمته‏\n\n\n> فكل ما يجريه سبحانه *** من كل ما يقضي فمن همته‏\n\n\n### [التقوى هي اتخاذ الله وقاية من كل ما يحذر منه‏]\n\n\nاعلموا يا إخواننا أنار الله بصائركم وأصلح سرائركم وخلص من الشبه أدلتكم إنه لما امتن الله علينا بالاسم الرحمن فأخرجنا من الشر الذي هو العدم إلى الخير الذي هو الوجود ولهذا امتن الله تعالى علينا بنعمة الوجود فقال أَ ولا يَذْكُرُ الْإِنْسانُ أَنَّا خَلَقْناهُ من قَبْلُ ولَمْ يَكُ شَيْئاً فما تولانا منه سبحانه ابتداء إلا الرحمة ولهذا قال إن رحمة الله سبقت غضبه فلما نظرنا في قوله تعالى اتَّقُوا الله أي اتخذوه وقاية من كل ما تحذرون ورأينا مسمى الله يتضمن كل اسم إلا هي فينبغي أن يتقى منه ويتخذ وقاية\n\n\n### [ما من اسم إلهى للكون به تعلق إلا ويمكن أن يتقى منه وبه‏]\n\n\nفإنه ما من اسم من الأسماء الإلهية للكون به تعلق إلا ويمكن أن يتقى منه وبه إما خوفا من فراقه إن كان من أسماء اللطف أو خوفا من نزوله إن كان من أسماء القهر فما يتقى إلا حكم أسمائه وما تتقي أسماؤه إلا بأسمائه الاسم الذي يجمعها هو الله‏\n\n\n### [الله مجموع الأسماء الإلهية المتقابلة]\n\n\nفإذا كان الله مجموع الأسماء المتقابلة وقد علمنا إن المتقابلين إذا كانا على ميزان واحد سقط حكمهما لأن المحل لا يقبل حكم تقابلهما فيسقطان فإذا رجح ميزان أحدهما كان الحكم للراجح وقد رجح اسم اللطيف بوجودنا لأن الاسم الرحمن يحفظنا فترجحت الرحمة فنفذ حكمها فهي الأصل بالإيجاد والانتقام حكم عارض والعوارض لا ثبات لها فإن الوجود يصحبنا فما لنا إلى الرحمة وحكمها فلهذا أمرنا بتقوى الله أي نتخذه وقاية ونتقيه لما فيه من التقابل وهو مثل قوله في الاستعاذة منه به‏\n\n\nفقال وأعوذ بك منك‏\n\n\n### [مقام التقوى من المقامات المستصحبة دنيا وآخرة]\n\n\nوهو من المقامات المستصحبة في الدنيا والآخرة فإنه إذا اتقيت أحكام الأسماء ولا سيما في الجنة التي حكم الإنسان فيها للصورة الإلهية التي فطر عليها فيقول للشي‏ء كن فيكون ذلك الشي‏ء فربما يحجبه هذا المقام عن الذي هو أعلى في حقه فيذهل عن الكثيب الذي هو خير له مما هو فيه فيأتي الاسم المذكر الإلهي فيذكره بشرف رتبة الكثيب وما يحصل له فيه وما يرجع به إلى أهله فيتقي هذا الاسم الذي مسكه في الجنة عن التشوق إلى ما هو أفضل في حقه مما يحصل له في الكثيب فلهذا قلنا باستصحاب مقام التقوى في الدنيا والآخرة فإذا علمت هذا علمت إن مقام التقوى تقوى الله مكتسب للعبد ولهذا أمر به وهكذا كل مأمور به فهو مقام يكتسب ولهذا قالت الطائفة إن المقامات مكاسب والأحوال مواهب‏\n\n\n### [التقوى الإلهية على قسمين في الحكم فينا]\n\n\nوالتقوى الإلهية على قسمين في الحكم فينا أي انقسم فيها الأمر قسمين قسما أمرنا الله أن نتقيه حق تقاته من كوننا مؤمنين وقسما أمرنا فيه أن نتقيه على قدر الاستطاعة وما عين في هذا التكليف صفة تخص بها طائفة من الطوائف مثل ما عينها في حق تقاته وإن كان المؤمنون قد تقدم ذكرهم فأعاد الضمير عليهم ولكن مثل هذا لا يسمى تصريحا ولا تعيينا فينزل عن درجة التعيين فيحدث لذلك حكم آخر\n\n\n### [المضمرات والمعينات والصفات‏]\n\n\nفقال فَاتَّقُوا الله ما اسْتَطَعْتُمْ ابتدأ آية بفاء عطف وضمير جمع لمذكور متقدم قريب أو بعيد فإن المضمرات‏\nتلحق بعالم الغيب والمعينات تلحق بعالم الشهادة لأن المضمر صالح لكل معين لا يختص به واحد دون آخر فهو مطلق والمعين مقيد فإنك إذا قلت زيد فما هو غيره من الأسماء لأنه موضوع لشخص بعينه وإذا قلت أنت أو هو أو إنك فهو ضمير يصلح لكل مخاطب قديم وحديث فلهذا فرقنا بين المضمر والمعين بالاسم أو الصفة والصفة برزخية بين الأسماء وبين الضمائر فإنك إذا قلت المؤمن أو الكاتب فقد ميزته من غير المؤمن فأشبه زيدا من وجه ما عينته الصفة وأشبه الضمائر من وجه إطلاقه على كل من هذه صفته غير إن الضمير الخطابي مثلا يعم كل مخاطب كائنا من كان من مؤمن وغير مؤمن وإنسان وغير إنسان‏\n\n\n### [تقوى الله حق تقاته وتقوى الله على الاستطاعة]\n\n\nفتقوى الله حق تقاته هو رؤية المتقي التقوى منه وهو عنها بمعزل ما عدى نسبة التكليف به فإنه لا ينعزل عنها لما يقتضيه من سوء الأدب مع الله فحال المتقي لله حق تقاته كحال من شكر الله حق الشكر وقد تقدم معنى ذلك وهذه الآية من أصعب آية مرت على الصحابة وتخيلوا أن الله خفف عن عباده بآية الاستطاعة في التقوى وما علموا أنهم انتقلوا إلى الأشد وكنا نقول بما قالوه ولكن الله لما فسر مراده بالحقية في أمثال هذا هان علينا الأمر في ذلك وعلمنا إن تقوى الله بالاستطاعة أعظم في التكليف فإنه عزيز أن يبذل الإنسان في عمله جهد استطاعته لا بد من فضلة يبقيها وفي حق تقاته ليس كذلك وعلمنا إن الله أثبت العبد في الاستطاعة فلا ينبغي أن ننفيه عن الموضع الذي أثبته الحق فيه فإن ذلك منازعة لله وفي حق تقاته أثبت له النظر إليه في تقواه وهو أهون عليه فما كان شديدا عندهم كان في نفس الأمر أهون وعند من فهم عن الله وما كان هينا عندهم كان في نفس الأمر شديدا وعند من فهم عن الله جعلنا الله ممن فهم عنه خطابه فأتاه رحمة من عنده وهو ما أعطاه من الفهم وعلمه من لدنه علما فلم يكله إلى عنديته ولا إلى نفسه بل تولى تعليمه ليريحه لما هو عليه من الضعف‏\n\n\n### [حال التبري وحال الدعوى‏]\n\n\nولو لا إن العبد ادعى الاستطاعة في الأفعال والاستقلال بها ما أنزل الله تكليفا قط ولا شريعة ولهذا جعل حظ المؤمن من هذه الدعوى أن يقول وإِيَّاكَ نَسْتَعِينُ وقال في حقنا وحق أمثالنا ممن تبرأ من الأفعال الظاهر وجودها منه قولوا لا حول ولا قوة إلا بالله العلي العظيم عن أن يشارك فيها فهي له خالصة فكم بين الحالين بين التبري والدعوى فالمدعي مطالب بالبرهان على دعواه والمتبرئ غير مطالب بذلك ولا تقل إن التبري دعوى فإن التبري لا يبقي شيئا وعلى ذلك ينطلق اسم المتبرئ ونحن نتكلم في الأمر المحقق فإن كتابنا هذا بل كلامنا كله مبناه في الكلام على الأمور بما هي عليه في أنفسها والتبري صفة إلهية سلبية والعبد حقيقته سلب والدعوى صفة إلهية ثبوتية لا تنبغي إلا لله عز وجل والعبد إذا اتصف بها لم يزاحم الله فيها ويقول لا حول ولا قوة إلا بالله ومهما قال وإِيَّاكَ نَسْتَعِينُ فإنما يقولها تاليا لا حقيقة فله ما نوى وهو بحيث علم ولو لا ما ظهر العبد بالدعوى ما قيل له فَاتَّقُوا الله ما اسْتَطَعْتُمْ بالقوة التي جعلتها لكم فيكم بين الضعفين فمن تنبه على إن قوته مجعولة وأنها لمن جعلها لم يدع فيها بل هي أمانة عنده لا يملكها والإنسان لا يكون غنيا إلا بما يملكه والأمانة عارية لا تملك مأمور من هي عنده بردها إلى أهلها وهو قوله لا حول ولا قوة إلا بالله أي القوة قائمة بالله لا بنا فالمدعون في القوة يجعلون ما من قوله ما اسْتَطَعْتُمْ مصدرية وأهل التبري يجعلونها للنفي في الآية فنفى عندهم الاستطاعة في التقوى وأثبتها عند من جعلها مصدرية\n\n\n### [رد جميع الأمور إلى الله والتعويل عليه في كل شئون الحياة]\n\n\nولما كان المعنى في التقوى أن تتخذ وقاية مما ينسب إلى المتقي فإذا جاءت النسبة حالت الوقاية بينها وبين المتقي أن تصل إليه فتؤذيه فتلقتها الوقاية فلا أحد أصبر على أذى من الله فإن السهم والطعن والحجر والضرب بالسيف وما أشبه ذلك عند المثاقف إنما تتلقاها الوقاية وهي المجن الذي بيده وهو من ورائها ماسك عليها لكنه يحتاج إلى ميزان قوي لأمور عوارض عرضت للنسبة تسمى مذمومة فيقبلها العبد ولا يجعل الله وقاية أدبا وإن كان لا يتلقاها إلا الله في نفس الأمر ولكن الأدب مشروع للعبد في ذلك ولا تضره هذه الدعوى لأنها صورة لا حقيقة وإذا علم الله ذلك منك جازاك جزاء من رد الأمور إليه وعول في كل حال عليه وسكن تحت مجاري الأقدار وتفرج فيما يحدث الله في أولاد الليل والنهار فهذا تقوى الله قد أومأنا إلى تحقيقه إيماء فإن للكلام في معناه مجالا رحبا يطول فاكتفينا بهذا وانتقلنا إلى تقوى الحجاب والستر والكل من تقوى الله فإنه الأصل انتهى الجزء الثالث والتسعون‏\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "## Chapter Eighty-Four: Concerning Piety towards God (Taqwa)\n\nNone practices Piety towards God save the one who comprehends\nAll that is in the cosmos of His wisdom.\n\nThus, he guards against the affliction (نقمة) within His blessing (نعمة),\nAnd he guards against the blessing within His affliction.\n\nFor all that is in the cosmos, both manifest\nAnd hidden within it, is from His blessing.\n\nAnd it is that which He poured forth as a favor\nFrom Him upon the Chosen One of His community.\n\nFor all that He, the Glorified, brings forth,\nOf all that He decrees, is from His spiritual resolve (همته).\n\n### [Piety (Taqwa) is taking God as a protection from all that one fears]\n\nKnow, O our brothers—may Allah illuminate your insights, rectify your inner secrets, and purify your proofs from ambiguities—that when God favored us with the Name *al-Rahman* (The All-Merciful), He brought us out of evil, which is non-existence (العدم), into good, which is Existence (الوجود). For this reason, God Almighty favored us with the blessing of Existence, saying: <<أَ ولا يَذْكُرُ الْإِنْسانُ أَنَّا خَلَقْناهُ من قَبْلُ ولَمْ يَكُ شَيْئاً>> (Does man not recall that We created him before, when he was nothing?). What He, the Glorified, initially undertook concerning us was nothing but Mercy. Therefore, He said, \"Indeed, the Mercy of God preceded His Wrath.\" When we considered His saying, *Ittaqū Allāh* (Fear God), meaning, take Him as a protection (وقاية) from everything you fear, and we saw that the designation *Allah* encompasses every Name, it is therefore necessary that He be guarded against and taken as a protection.\n\n### [There is no Divine Name related to the cosmos except that one can guard against it and by it]\n\nFor there is no Name among the Divine Names (الأسماء الإلهية) related to the cosmos (الكون) except that one can guard against it and by it. This is either out of fear of separation from it, if it is one of the Names of Gentleness (أسماء اللطف), or out of fear of its descent, if it is one of the Names of Compulsion (أسماء القهر). Thus, nothing is guarded against except the ruling (حكم) of His Names, and His Names are only guarded against by His Names. The Name that gathers them all is *Allah*.\n\n### [Allah is the totality of the opposing Divine Names]\n\nSince *Allah* is the totality of the opposing Names (الأسماء المتقابلة), and we know that when two opposing things are on the same scale, their ruling is nullified because the locus (المحل) does not accept the ruling of their opposition, so they cancel each other out. If the scale of one of them outweighs the other, the ruling belongs to the dominant one. The Name *al-Latīf* (The Gentle) has outweighed the others through our Existence, because the Name *al-Rahman* (The All-Merciful) preserves us. Thus, Mercy prevailed, and its ruling was executed. It is the origin (الأصل) of creation (الإيجاد), while retribution (الانتقام) is an accidental ruling (حكم عارض). Accidental things have no permanence, for Existence (الوجود) accompanies us. Therefore, we belong to Mercy and its ruling. For this reason, we were commanded to practice Piety towards God (تقوى الله), meaning we should take Him as a protection and guard against Him because of the opposition (التقابل) inherent in Him. This is similar to the saying in seeking refuge:\n\nHe said: \"And I seek refuge in You from You.\"\n\n### [The station of Piety is among the stations maintained in this world and the Hereafter]\n\nThis station (مقام التقوى) is among the stations maintained (المستصحبة) in this world and the Hereafter. For if you guard against the rulings of the Names, especially in Paradise, where the human being's ruling is according to the Divine Form (الصورة الإلهية) upon which he was created—he says to a thing, \"Be,\" and it is—this station might veil him from what is higher in his right. He might become heedless of the Sand Dune (الكثيب), which is better for him than what he is in. Then the Divine Name that reminds (الاسم المذكر الإلهي) comes and reminds him of the honor of the rank of the Sand Dune and what he attains there, and what he returns with to his family. Thus, he guards against this Name (the one that reminds him) which held him back in Paradise from yearning for what is better for him than what he attains at the Sand Dune. For this reason, we stated that the station of Piety is maintained in this world and the Hereafter. If you know this, you know that the station of Piety towards God (تقوى الله) is acquired (مكتسب) by the servant, which is why it was commanded. Likewise, every commanded thing is an acquired station. Therefore, the Sufi group (الطائفة) said that the stations (المقامات) are acquisitions (مكاسب) and the states (الأحوال) are gifts (مواهب).\n\n### [Divine Piety is of two types in its ruling upon us]\n\nDivine Piety (التقوى الإلهية) is of two types in its ruling upon us; that is, the command concerning it is divided into two parts: a part where God commanded us to fear Him as is His due (حق تقاته), based on our being believers, and a part where He commanded us to fear Him according to our capacity (على قدر الاستطاعة). In this latter obligation, He did not specify a characteristic that singles out a particular group, unlike what He specified in the case of fearing Him as is His due. Although the believers were mentioned previously, the pronoun refers back to them, but such a reference is not called an explicit statement (تصريح) or a specification (تعيين). Thus, it falls below the degree of specification, and another ruling arises from that.\n\n### [Pronouns, Specific Referents, and Attributes]\n\nHe said: <<فَاتَّقُوا الله ما اسْتَطَعْتُمْ>> (So fear God as much as you are able). He began the verse with a *fā'* of conjunction and a plural pronoun referring to a preceding subject, whether near or far. Pronouns (المضمرات) belong to the world of the Unseen (عالم الغيب), and specific referents (المعينات) belong to the world of Witnessing (عالم الشهادة). This is because the pronoun is valid for every specific referent; it is not restricted to one person over another, so it is absolute (مطلق). The specific referent is restricted (مقيد). If you say \"Zayd,\" it is no one else among the names, because it is designated for a specific person. But if you say \"you\" or \"he\" or \"indeed you,\" it is a pronoun valid for every addressee, ancient or modern. For this reason, we differentiate between the pronoun and the specific referent by name or attribute (الصفة). The attribute is an Isthmus (برزخية) between the Names and the pronouns. If you say \"the believer\" or \"the writer,\" you have distinguished him from the non-believer, thus resembling Zayd in the aspect that the attribute specified him. Yet, it resembles the pronouns in the aspect of its being applicable to everyone who possesses that attribute. However, the pronoun of address, for example, encompasses every addressee, whoever they may be, believer or non-believer, human or non-human.\n\n### [Fearing God as is His due and fearing God according to capacity]\n\nFearing God as is His due (حق تقاته) is the realization by the one practicing Piety that the Piety itself is from God, and that he is far removed from it, except for the attribution of the obligation (التكليف) to him. For he is not removed from that obligation, as its denial implies bad manners (سوء الأدب) towards God. The state of the one who fears God as is His due is like the state of one who thanks God as is His due, the meaning of which has preceded. This verse was one of the most difficult verses encountered by the Companions (الصحابة). They imagined that God had alleviated the burden on His servants with the verse concerning capacity (آية الاستطاعة) in Piety, but they did not realize that they had moved to the more difficult command. We used to hold the same view as they did, but when God explained His intent regarding the \"due right\" (الحقية) in such matters, the issue became easier for us. We realized that fearing God according to capacity (بالاستطاعة) is a greater obligation, for it is difficult for a person to exert the full effort of his capacity (جهد استطاعته); there must be a surplus (فضلة) that he retains. This is not the case with fearing Him as is His due. We learned that God affirmed the servant in the capacity (الاستطاعة), and we should not negate him from the position where the Real (الحق) affirmed him, for that is contention with God. In the case of fearing Him as is His due, He affirmed for the servant the contemplation of Him in his Piety, which is easier for him. Thus, what was difficult for them was, in reality, easier, according to those who understood God. And what was easy for them was, in reality, more difficult, according to those who understood God. May God make us among those who understand His address, so that mercy comes to him from Him, which is the understanding He grants him and the knowledge He teaches him from His Presence (من لدنه علما). He did not entrust him to his own resources or to himself, but took charge of teaching him, to relieve him of the weakness he possesses.\n\n### [The state of Disavowal and the state of Claim]\n\nWere it not that the servant claimed capacity (الاستطاعة) in actions and independence (الاستقلال) in them, God would never have revealed any obligation (تكليف) or law (شريعة). For this reason, the believer's share of this claim is to say: <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help). And concerning us and those like us who disavow (تبرأ) the actions whose existence appears from them, He said: Say, \"There is no power and no strength save in God, the High, the Tremendous,\" meaning that He is too exalted to be partnered in them; they belong purely to Him. How vast is the difference between the two states: between disavowal (التبري) and claim (الدعوى)! The claimant (المدعي) is required to provide proof for his claim, while the one who disavows is not required to do so. And do not say that disavowal is a claim, for disavowal leaves nothing remaining, and upon that the name of the disavower is applied. We speak here of the verified matter (الأمر المحقق), for the foundation of this book—indeed, all our discourse—is built upon speaking about things as they are in themselves. Disavowal (التبري) is a negative Divine Attribute (صفة إلهية سلبية), and the servant's reality (حقيقته) is negation (سلب). Claim (الدعوى) is an affirmative Divine Attribute (صفة إلهية ثبوتية) that belongs only to God, the Mighty and Majestic. When the servant is characterized by it, he does not contend with God in it, and he says, \"There is no power and no strength save in God.\" Whenever he says <<وَإِيَّاكَ نَسْتَعِينُ>>, he says it merely as a reciter, not as a reality (حقيقة). He receives what he intended, and he is where he knows himself to be. Were it not for the servant manifesting the claim, he would not have been told: <<فَاتَّقُوا الله ما اسْتَطَعْتُمْ>> (So fear God as much as you are able) with the power that I placed in you, between the two weaknesses. Whoever realizes that his power is *made* (مجعولة) and belongs to the One who made it, does not claim it. Rather, it is a trust (أمانة) with him; he does not own it. A human being is only wealthy by what he owns, and a trust is a loan (عارية) that is not owned, and the one who holds it is commanded to return it to its owner. This is the meaning of \"There is no power and no strength save in God,\" meaning that power subsists in God, not in us. Those who claim power interpret *mā* (ما) in the phrase *mā istaṭa'tum* (ما اسْتَطَعْتُمْ) as a verbal noun (مصدرية), while the people of disavowal interpret it as negation (للنفي) in the verse. Thus, they negate capacity (الاستطاعة) in Piety, while those who interpret it as a verbal noun affirm it.\n\n### [Referring all matters back to God and relying on Him in all affairs of life]\n\nSince the meaning of Piety (التقوى) is to take a protection (وقاية) against what is attributed to the one practicing Piety, when the attribution comes, the protection intervenes between it and the one practicing Piety, preventing it from reaching and harming him. The protection receives it. No one is more patient in enduring harm than God. For the arrow, the stab, the stone, the sword strike, and similar things in combat are received by the protection—the shield (المجن) in his hand—and he holds onto it from behind. However, he needs a strong balance (ميزان قوي) for accidental matters (أمور عوارض) that occur to the attribution, which are called blameworthy (مذمومة). The servant accepts these and does not make God a protection, out of courtesy (أدبا), even though in reality, only God receives them. But courtesy is legislated for the servant in this matter, and this claim does not harm him because it is a form (صورة) without reality (حقيقة). If God knows this from you, He will reward you with the reward of one who refers all matters back to Him, relies on Him in every state, rests under the flow of the decrees (مجاري الأقدار), and finds relief in what God brings forth during the hours of night and day. This is the Piety towards God (تقوى الله). We have alluded to its verification with a mere hint, for discourse on its meaning has a vast scope that would be lengthy. We have sufficed with this and moved on to the Piety of the Veil and Concealment (تقوى الحجاب والستر), all of which stem from the Piety towards God, for it is the Origin (الأصل). End of Part Ninety-Three.\n\nIn the Name of God, the All-Merciful, the Compassionate.",
    "ur": "## (باب چوراسی: اللہ کے تقویٰ کے بیان میں)\n\nاللہ کا تقویٰ صرف وہی شخص اختیار کرتا ہے جو کائنات میں موجود اس کی تمام حکمتوں کا جامع ہو۔\nپس وہ اس کی نعمت میں موجود عذاب (نقمہ) سے ڈرتا ہے، اور اس کے عذاب (نقمہ) میں موجود نعمت سے ڈرتا ہے۔\nکیونکہ کائنات میں جو کچھ بھی ظاہر اور باطن ہے، وہ سب اس کی نعمت میں سے ہے۔\nاور یہ وہی نعمت ہے جسے اس نے اپنی امت کے منتخب افراد پر احسان کے طور پر مکمل کیا۔\nپس جو کچھ بھی وہ سبحانہ جاری کرتا ہے، جو کچھ بھی وہ فیصلہ کرتا ہے، وہ سب اس کی ہمت (عزم) سے ہے۔\n\n### [تقویٰ یہ ہے کہ اللہ کو ہر اس چیز سے ڈھال بنا لیا جائے جس سے ڈرنا ہو]\n\nجان لو اے ہمارے بھائیو! اللہ تمہاری بصیرتوں کو منور کرے، تمہارے باطن کو درست کرے، اور تمہاری دلیلوں کو شبہات سے پاک کرے۔ جب اللہ نے ہم پر اسم الرحمن کے ذریعے احسان کیا، تو ہمیں اس شر سے جو کہ عدم (العدم) ہے، اس خیر کی طرف نکالا جو کہ الوجود (ہستی) ہے۔ اسی لیے اللہ تعالیٰ نے ہم پر نعمتِ الوجود (ہستی) کے ذریعے احسان کیا اور فرمایا:\n\"کیا انسان یاد نہیں کرتا کہ ہم نے اسے اس سے پہلے پیدا کیا تھا جبکہ وہ کچھ بھی نہ تھا؟\" (مریم: ۶۷)۔\nپس ابتدا میں اس سبحانہ نے ہماری سرپرستی صرف رحمت کے ذریعے کی۔ اسی لیے فرمایا گیا کہ \"اللہ کی رحمت اس کے غضب پر سبقت لے گئی ہے۔\" جب ہم نے اللہ تعالیٰ کے اس قول پر غور کیا: \"اتَّقُوا الله\" (اللہ کا تقویٰ اختیار کرو)، یعنی اسے ہر اس چیز سے ڈھال بنا لو جس سے تم ڈرتے ہو، اور ہم نے دیکھا کہ مسمیٰ اللہ (اللہ کا نام) ہر اسم کو شامل ہے، تو ضروری ہے کہ اس سے تقویٰ اختیار کیا جائے اور اسے ڈھال بنایا جائے۔\n\n### [کوئی بھی اسم الٰہی ایسا نہیں جس کا تعلق کائنات سے ہو مگر یہ کہ اس سے اور اس کے ذریعے تقویٰ اختیار کیا جا سکتا ہو]\n\nکیونکہ اسماء الٰہیہ (الأسماء الإلهية) میں سے کوئی بھی اسم ایسا نہیں جس کا تعلق کائنات سے ہو مگر یہ کہ اس سے اور اس کے ذریعے تقویٰ اختیار کیا جا سکتا ہو۔ یا تو اس کے فراق کے خوف سے، اگر وہ اسماء اللطف (لطف کے اسماء) میں سے ہو، یا اس کے نزول کے خوف سے، اگر وہ اسماء القہر (قہر کے اسماء) میں سے ہو۔ پس تقویٰ صرف اس کے اسماء کے حکم سے اختیار کیا جاتا ہے، اور اس کے اسماء کا تقویٰ صرف اس کے اسماء کے ذریعے اختیار کیا جاتا ہے۔ وہ اسم جو ان سب کو جمع کرتا ہے، وہ اللہ ہے۔\n\n### [اللہ متقابل اسماء الٰہیہ کا مجموعہ ہے]\n\nجب اللہ متقابل اسماء (الأسماء المتقابلة) کا مجموعہ ہے، اور ہم جانتے ہیں کہ جب دو متقابل چیزیں ایک ہی میزان پر ہوں تو ان کا حکم ساقط ہو جاتا ہے، کیونکہ محل ان کے تقابل کے حکم کو قبول نہیں کرتا، لہٰذا وہ دونوں ساقط ہو جاتے ہیں۔ لیکن جب ان میں سے کسی ایک کا پلڑا بھاری ہو جائے تو حکم اسی کا ہوتا ہے جس کا پلڑا بھاری ہو۔ اور ہمارے الوجود (ہستی) کی وجہ سے اسم اللطیف (لطف کا اسم) کا پلڑا بھاری ہو گیا، کیونکہ اسم الرحمن ہماری حفاظت کرتا ہے۔ پس رحمت کا پلڑا بھاری ہوا اور اس کا حکم نافذ ہوا، لہٰذا وہ ایجاد (پیدا کرنے) میں اصل ہے، جبکہ انتقام ایک عارضی حکم ہے، اور عوارض کو ثبات حاصل نہیں ہوتا۔ کیونکہ الوجود (ہستی) ہمارے ساتھ ہے، لہٰذا ہم رحمت اور اس کے حکم کی طرف مائل ہیں۔ اسی لیے ہمیں تقویٰ اللہ (اللہ کا تقویٰ) کا حکم دیا گیا، یعنی ہم اسے ڈھال بنائیں اور اس سے تقویٰ اختیار کریں اس تقابل کی وجہ سے جو اس میں موجود ہے۔ اور یہ اس کے اس قول کی طرح ہے جو اس سے پناہ مانگنے کے بارے میں ہے:\n\"اور میں تیری پناہ چاہتا ہوں تجھ سے ہی\" (وأعوذ بك منك)۔\n\n### [مقام تقویٰ ان مقامات میں سے ہے جو دنیا اور آخرت میں ساتھ رہتے ہیں]\n\nیہ ان مقامات میں سے ہے جو دنیا اور آخرت میں ساتھ رہتے ہیں۔ کیونکہ جب تم اسماء کے احکام سے تقویٰ اختیار کرتے ہو، خاص طور پر جنت میں، جہاں انسان کا حکم اس الٰہی صورت کے لیے ہوتا ہے جس پر وہ پیدا کیا گیا ہے، تو وہ کسی چیز کو \"کن\" (ہو جا) کہتا ہے اور وہ چیز ہو جاتی ہے۔ تو بسا اوقات یہ مقام اسے اس چیز سے حجاب میں ڈال دیتا ہے جو اس کے حق میں اعلیٰ ہے، اور وہ اس ٹیلے (الکثیب) سے غافل ہو جاتا ہے جو اس کے لیے اس سے بہتر ہے جس میں وہ ہے۔ تب اسم المذکر الٰہی (یاد دلانے والا الٰہی اسم) آتا ہے اور اسے ٹیلے کے شرفِ رتبہ، اس میں حاصل ہونے والی چیزوں، اور جو کچھ وہ اپنے اہل کی طرف لے کر لوٹے گا، اس کی یاد دلاتا ہے۔ پس وہ اس اسم سے تقویٰ اختیار کرتا ہے جس نے اسے جنت میں روکے رکھا تھا، اس چیز کے شوق سے جو اس کے حق میں اس سے افضل ہے جو اسے ٹیلے پر حاصل ہو گا۔ اسی لیے ہم نے دنیا اور آخرت میں مقام تقویٰ (مقام التقوى) کے ساتھ رہنے کی بات کہی ہے۔ جب تم یہ جان لو گے تو تم جان لو گے کہ تقویٰ اللہ (تقوى الله) کا مقام بندے کے لیے اکتسابی ہے، اور اسی لیے اس کا حکم دیا گیا ہے۔ اور اسی طرح ہر وہ چیز جس کا حکم دیا گیا ہے، وہ ایک اکتسابی مقام ہے۔ اسی لیے صوفیاء کی جماعت نے کہا ہے کہ مقامات (المقامات) اکتسابی ہوتے ہیں اور احوال (الأحوال) عطیہ (مواہب) ہوتے ہیں۔\n\n### [الٰہی تقویٰ ہمارے بارے میں حکم کے لحاظ سے دو قسموں پر ہے]\n\nاور الٰہی تقویٰ (التقوى الإلهية) ہمارے بارے میں حکم کے لحاظ سے دو قسموں پر ہے، یعنی اس میں معاملہ دو حصوں میں تقسیم ہو گیا: ایک حصہ وہ ہے جس میں اللہ نے ہمیں حکم دیا کہ ہم اس کا تقویٰ اختیار کریں جیسا کہ اس کے تقویٰ کا حق ہے (حق تقاته)، اس حیثیت سے کہ ہم مومن ہیں۔ اور دوسرا حصہ وہ ہے جس میں ہمیں حکم دیا کہ ہم اس کا تقویٰ اپنی استطاعت (الاستطاعة) کے مطابق اختیار کریں۔ اور اس تکلیف میں کوئی ایسی صفت متعین نہیں کی گئی جو کسی خاص گروہ کے لیے مخصوص ہو، جیسا کہ حق تقاته میں متعین کی گئی تھی، اگرچہ مومنوں کا ذکر پہلے ہو چکا ہے اور ضمیر ان کی طرف لوٹا ہے، لیکن ایسی چیز کو صریح بیان یا تعین نہیں کہا جاتا، لہٰذا یہ تعین کے درجے سے نیچے آ جاتا ہے، اور اس کے لیے ایک دوسرا حکم پیدا ہوتا ہے۔\n\n### [مضمرات، معینات اور صفات]\n\nپس فرمایا: \"فَاتَّقُوا الله ما اسْتَطَعْتُمْ\" (پس اللہ کا تقویٰ اختیار کرو جتنی تم استطاعت رکھتے ہو) (التغابن: ۱۶)۔ یہ آیت فائے عطف اور جمع کے ضمیر کے ساتھ شروع ہوئی ہے جو کسی قریب یا بعید مذکور کی طرف لوٹتا ہے۔ کیونکہ مضمرات (ضمیریں) عالم الغیب (غیب کی دنیا) سے تعلق رکھتی ہیں، اور معینات (متعین چیزیں) عالم الشہادۃ (ظاہر کی دنیا) سے تعلق رکھتی ہیں، کیونکہ ضمیر ہر متعین چیز کے لیے موزوں ہے، وہ کسی ایک کے ساتھ خاص نہیں ہوتا، لہٰذا وہ مطلق ہے۔ اور متعین مقید ہوتا ہے۔ کیونکہ جب تم \"زید\" کہتے ہو تو وہ دوسرے اسماء نہیں ہوتے، کیونکہ وہ ایک خاص شخص کے لیے وضع کیا گیا ہے۔ اور جب تم \"أنت\" (تم) یا \"هو\" (وہ) یا \"إنك\" (بیشک تم) کہتے ہو، تو یہ ایک ضمیر ہے جو ہر مخاطب کے لیے موزوں ہے، خواہ وہ قدیم ہو یا جدید۔ اسی لیے ہم نے اسم یا صفت کے ذریعے مضمر اور معین کے درمیان فرق کیا ہے۔ اور صفت اسماء اور ضمائر کے درمیان برزخی (برزخية) ہے۔ کیونکہ جب تم \"المؤمن\" (مومن) یا \"الکاتب\" (لکھنے والا) کہتے ہو، تو تم نے اسے غیر مومن سے ممتاز کر دیا، پس وہ اس لحاظ سے زید سے مشابہ ہو گیا کہ صفت نے اسے متعین کر دیا، اور اس لحاظ سے ضمائر سے مشابہ ہو گیا کہ وہ ہر اس شخص پر مطلقاً لاگو ہوتا ہے جس کی یہ صفت ہو۔ البتہ، خطابی ضمیر (مثلاً \"تم\") ہر مخاطب کو عام ہوتا ہے، خواہ وہ کوئی بھی ہو، مومن ہو یا غیر مومن، انسان ہو یا غیر انسان۔\n\n### [اللہ کا تقویٰ جیسا کہ اس کے تقویٰ کا حق ہے اور اللہ کا تقویٰ استطاعت کے مطابق]\n\nپس تقویٰ اللہ حق تقاته (اللہ کا تقویٰ جیسا کہ اس کے تقویٰ کا حق ہے) یہ ہے کہ تقویٰ اختیار کرنے والا تقویٰ کو اللہ کی طرف سے دیکھے، اور وہ خود اس سے الگ تھلگ ہو، سوائے اس کے کہ اس کے ساتھ تکلیف کی نسبت ہو، کیونکہ وہ اس سے الگ نہیں ہو سکتا، کیونکہ یہ اللہ کے ساتھ سوءِ ادب کا تقاضا کرتا ہے۔ پس اللہ کا تقویٰ حق تقاته اختیار کرنے والے کا حال اس شخص جیسا ہے جس نے اللہ کا شکر ادا کیا جیسا کہ شکر کا حق ہے۔ اور اس کا معنی پہلے بیان ہو چکا ہے۔ یہ آیت صحابہ پر گزرنے والی سب سے مشکل آیات میں سے تھی، اور انہوں نے خیال کیا کہ اللہ نے تقویٰ میں استطاعت (الاستطاعة) والی آیت کے ذریعے اپنے بندوں پر تخفیف کر دی ہے، حالانکہ انہیں معلوم نہ تھا کہ وہ اس سے بھی زیادہ سخت حکم کی طرف منتقل ہو گئے ہیں۔ ہم بھی وہی کہتے تھے جو انہوں نے کہا، لیکن جب اللہ نے اس طرح کے معاملات میں \"حقیت\" کے ذریعے اپنی مراد کی تفسیر کی، تو یہ معاملہ ہم پر آسان ہو گیا، اور ہم نے جان لیا کہ استطاعت (الاستطاعة) کے ساتھ اللہ کا تقویٰ اختیار کرنا تکلیف میں زیادہ عظیم ہے۔ کیونکہ یہ مشکل ہے کہ انسان اپنے عمل میں اپنی استطاعت کی پوری کوشش صرف کر دے، لازماً وہ کچھ نہ کچھ بچا لیتا ہے۔ جبکہ حق تقاته میں ایسا نہیں ہے۔ اور ہم نے جان لیا کہ اللہ نے بندے کو استطاعت (الاستطاعة) میں ثابت کیا ہے، لہٰذا ہمیں اسے اس مقام سے نفی نہیں کرنا چاہیے جہاں الحق (ذات حق) نے اسے ثابت کیا ہے، کیونکہ یہ اللہ سے جھگڑنا ہے۔ اور حق تقاته میں، اس نے بندے کے لیے یہ ثابت کیا کہ وہ اپنے تقویٰ میں اسی کی طرف نظر کرے، اور یہ اس کے لیے زیادہ آسان ہے۔ پس جو چیز ان کے نزدیک سخت تھی، وہ درحقیقت آسان تھی ان کے نزدیک جو اللہ کی مراد کو سمجھتے تھے، اور جو چیز ان کے نزدیک آسان تھی، وہ درحقیقت سخت تھی ان کے نزدیک جو اللہ کی مراد کو سمجھتے تھے۔ اللہ ہمیں ان لوگوں میں شامل کرے جو اس کے خطاب کو سمجھتے ہیں، پس اس کی طرف سے رحمت ان کے پاس آئی، اور وہ یہ ہے کہ اس نے انہیں فہم عطا کیا اور انہیں اپنے پاس سے علم سکھایا، اور انہیں ان کی اپنی رائے یا ان کے نفس کے سپرد نہیں کیا، بلکہ خود ان کی تعلیم کی ذمہ داری لی تاکہ انہیں اس کمزوری سے راحت دے جس پر وہ ہیں۔\n\n### [تبریٰ کا حال اور دعویٰ کا حال]\n\nاگر بندہ افعال میں استطاعت (الاستطاعة) اور ان میں خود مختاری کا دعویٰ نہ کرتا تو اللہ کبھی کوئی تکلیف یا شریعت نازل نہ کرتا۔ اسی لیے مومن کا اس دعویٰ میں حصہ یہ ہے کہ وہ کہے: \"وإِيَّاكَ نَسْتَعِينُ\" (اور ہم تجھ ہی سے مدد مانگتے ہیں) (الفاتحہ: ۵)۔ اور ہمارے اور ہمارے جیسے لوگوں کے حق میں، جو ان افعال سے تبریٰ (بیزاری) کرتے ہیں جن کا وجود ان سے ظاہر ہوتا ہے، فرمایا: \"کہو لا حول ولا قوة إلا بالله العلی العظیم\" (نہیں ہے کوئی طاقت اور نہ کوئی قوت مگر اللہ بلند و برتر کی طرف سے)، اس سے کہ کوئی اس میں شریک ہو، پس یہ صرف اسی کے لیے خالص ہے۔ پس ان دو حالتوں، تبریٰ (التبري) اور دعویٰ (الدعوى) کے درمیان کتنا فرق ہے! دعویٰ کرنے والا اپنے دعویٰ پر برہان (دلیل) کا مطالبہ کیا جاتا ہے، اور تبریٰ کرنے والے سے اس کا مطالبہ نہیں کیا جاتا۔ اور یہ نہ کہو کہ تبریٰ بھی ایک دعویٰ ہے، کیونکہ تبریٰ کسی چیز کو باقی نہیں چھوڑتا، اور اسی پر متبرئ (تبریٰ کرنے والے) کا نام لاگو ہوتا ہے۔ اور ہم محقق امر کے بارے میں بات کر رہے ہیں، کیونکہ ہماری یہ کتاب، بلکہ ہمارا سارا کلام، چیزوں کے بارے میں اس طرح بات کرنے پر مبنی ہے جیسے وہ اپنی ذات میں ہیں۔ اور تبریٰ (التبري) ایک سلبی صفت الٰہیہ ہے، اور بندے کی حقیقت سلب ہے۔ اور دعویٰ (الدعوى) ایک ثبوتی صفت الٰہیہ ہے جو صرف اللہ عزوجل کے لیے ہی مناسب ہے۔ اور بندہ جب اس سے متصف ہوتا ہے تو وہ اللہ کے ساتھ اس میں مزاحمت نہیں کرتا، اور کہتا ہے: \"لا حول ولا قوة إلا بالله\"۔ اور جب بھی وہ \"وإِيَّاكَ نَسْتَعِينُ\" کہتا ہے، تو وہ اسے صرف تلاوت کے طور پر کہتا ہے نہ کہ حقیقت کے طور پر۔ پس اسے وہی ملے گا جس کی اس نے نیت کی، اور وہ اس مقام پر ہے جسے وہ جانتا ہے۔ اور اگر بندہ دعویٰ کے ساتھ ظاہر نہ ہوتا تو اسے یہ نہ کہا جاتا: \"فَاتَّقُوا الله ما اسْتَطَعْتُمْ\" (اللہ کا تقویٰ اختیار کرو جتنی تم استطاعت رکھتے ہو)، اس قوت کے ساتھ جو میں نے تمہارے اندر دو کمزوریوں کے درمیان رکھی ہے۔ پس جو شخص اس بات پر متنبہ ہو گیا کہ اس کی قوت بنائی گئی ہے اور وہ اس کی ہے جس نے اسے بنایا ہے، تو وہ اس میں دعویٰ نہیں کرے گا، بلکہ وہ اس کے پاس ایک امانت ہے جس کا وہ مالک نہیں ہے۔ اور انسان صرف اسی چیز سے غنی ہوتا ہے جس کا وہ مالک ہو۔ اور امانت ایک عاریت ہے جس کی ملکیت نہیں ہوتی، اور جس کے پاس وہ ہے اسے حکم ہے کہ وہ اسے اس کے اہل کی طرف لوٹا دے، اور یہی اس کا قول ہے: \"لا حول ولا قوة إلا بالله\" (نہیں ہے کوئی طاقت اور نہ کوئی قوت مگر اللہ کی طرف سے)، یعنی قوت اللہ کے ساتھ قائم ہے نہ کہ ہم سے۔ پس قوت میں دعویٰ کرنے والے \"ما اسْتَطَعْتُمْ\" میں \"ما\" کو مصدریہ (جو مدت یا مقدار بتائے) بناتے ہیں، اور اہل تبریٰ (بیزاری والے) اسے آیت میں نفی کے لیے بناتے ہیں۔ پس ان کے نزدیک تقویٰ میں استطاعت کی نفی ہو گئی، اور اس کے نزدیک ثابت ہوئی جس نے اسے مصدریہ بنایا۔\n\n### [تمام امور کو اللہ کی طرف لوٹانا اور زندگی کے ہر معاملے میں اسی پر بھروسہ کرنا]\n\nاور چونکہ تقویٰ (التقوى) کا معنی یہ ہے کہ اس چیز سے ڈھال بنائی جائے جو متقی کی طرف منسوب ہوتی ہے، پس جب نسبت آتی ہے تو ڈھال اس کے اور متقی کے درمیان حائل ہو جاتی ہے تاکہ وہ اس تک پہنچ کر اسے تکلیف نہ دے، پس ڈھال اسے وصول کر لیتی ہے۔ اور اللہ سے زیادہ کوئی بھی تکلیف پر صبر کرنے والا نہیں ہے۔ کیونکہ تیر، نیزہ، پتھر، اور تلوار کی ضرب، اور اس جیسی چیزیں، مقابلہ کرنے والے کے نزدیک، صرف ڈھال ہی وصول کرتی ہے، اور وہ ڈھال (المجن) ہے جو اس کے ہاتھ میں ہے، اور وہ اس کے پیچھے سے اسے تھامے ہوئے ہے۔ لیکن اسے ایک مضبوط میزان کی ضرورت ہوتی ہے ان عارضی امور کے لیے جو نسبت کو لاحق ہوتے ہیں اور مذموم کہلاتے ہیں، تو بندہ انہیں قبول کر لیتا ہے اور ادب کی وجہ سے اللہ کو ڈھال نہیں بناتا، اگرچہ حقیقت میں اسے اللہ ہی وصول کرتا ہے۔ لیکن اس معاملے میں بندے کے لیے ادب مشروع ہے، اور یہ دعویٰ اسے نقصان نہیں پہنچاتا کیونکہ یہ ایک صورت ہے نہ کہ حقیقت۔ اور جب اللہ تم سے یہ جان لیتا ہے تو وہ تمہیں اس شخص کا بدلہ دیتا ہے جس نے تمام امور کو اسی کی طرف لوٹا دیا، اور ہر حال میں اسی پر بھروسہ کیا، اور تقدیر کے دھاروں کے نیچے سکون اختیار کیا، اور رات اور دن کی اولاد (مخلوقات) میں اللہ جو کچھ پیدا کرتا ہے اس میں کشادگی پائی۔ یہ ہے تقویٰ اللہ (تقوى الله)، جس کی تحقیق کی طرف ہم نے اشارہ کیا ہے، کیونکہ اس کے معنی پر کلام کرنے کے لیے ایک وسیع میدان ہے جو طویل ہو جائے گا، لہٰذا ہم نے اسی پر اکتفا کیا اور تقویٰ الحجاب والستر (حجاب اور پردے کے تقویٰ) کی طرف منتقل ہو گئے، اور یہ سب تقویٰ اللہ (تقوى الله) میں سے ہے، کیونکہ وہی اصل ہے۔\n\n(تینانوےواں حصہ مکمل ہوا)\n\n(شروع اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے)",
    "fa": "باب هشتاد و چهارم در تقوای الهی\n\nتقوای الهی را کسی جز جامع (جامع) ندارد،\nکه در اوست هر آنچه از حکمت (حکمة) در کون (جهان) است.\n\nپس از نقمت (عذاب) در نعمتش پرهیز می‌کند،\nو از نعمت در نقمتش پرهیز می‌کند.\n\nزیرا هر آنچه در کون (جهان) است، از ظاهر\nو باطن، همه از نعمت اوست.\n\nو این نعمتی است که او به عنوان منّت\nبر برگزیده از امتش (امت محمدی) کامل گردانید.\n\nپس هر آنچه او سبحانه (پاک و منزه) جاری می‌سازد،\nاز هر آنچه حکم می‌کند، از همّت اوست.\n\n### [تقوا عبارت است از قرار دادن خداوند به عنوان سپر در برابر هر آنچه از آن پرهیز می‌شود]\n\nای برادران ما، بدانید – خداوند بصیرت‌های شما را نورانی گرداند و سرائر (باطن‌ها)ی شما را اصلاح کند و دلایل شما را از شبهات رهایی بخشد – که چون خداوند با اسم الرحمن بر ما منت نهاد و ما را از شرّی که همان عدم (العدم) است، به خیری که همان هستی (الوجود) است، خارج ساخت. و به همین دلیل خداوند متعال بر ما به نعمت هستی (الوجود) منت نهاد و فرمود: **أَوَلا يَذْكُرُ الْإِنْسانُ أَنَّا خَلَقْناهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْئاً** (آیا انسان به یاد نمی‌آورد که ما او را پیش از این آفریدیم در حالی که چیزی نبود؟) (مریم: ۶۷). پس آنچه او سبحانه (پاک و منزه) در ابتدا متولی ما شد، جز رحمت نبود. و به همین دلیل فرمود: «همانا رحمت خداوند بر غضبش پیشی گرفته است». پس چون در قول خداوند متعال نگریستیم که می‌فرماید: **اتَّقُوا اللَّهَ** (از خدا پروا کنید)، یعنی او را سپری (وقایة) قرار دهید در برابر هر آنچه از آن می‌ترسید، و دیدیم که مسمّای «الله» شامل هر اسمی است، پس شایسته است که از او پرهیز شود و او سپر قرار داده شود.\n\n### [هیچ اسم الهی نیست که به کون (جهان) تعلق داشته باشد مگر آنکه می‌توان از آن و به واسطه آن پرهیز کرد]\n\nزیرا هیچ اسمی از اسماء الهی (الأسماء الإلهية) نیست که به کون (جهان) تعلق داشته باشد، مگر آنکه می‌توان از آن و به واسطه آن پرهیز کرد؛ یا از ترس فراق آن اسم، اگر از اسماء لطف (اللطف) باشد، یا از ترس نزول آن، اگر از اسماء قهر (القهر) باشد. پس پرهیز نمی‌شود مگر از حکم اسماء او، و اسماء او پرهیز نمی‌شوند مگر به واسطه اسماء او. اسمی که همه آن‌ها را جمع می‌کند، «الله» است.\n\n### [الله مجموع اسماء الهی متقابل است]\n\nپس اگر «الله» مجموع اسماء متقابل (الأسماء المتقابلة) باشد، و ما می‌دانیم که اگر دو متقابل بر یک میزان باشند، حکمشان ساقط می‌شود، زیرا محل، حکم تقابل آن‌ها را نمی‌پذیرد و هر دو ساقط می‌شوند. اما اگر میزان یکی از آن‌ها سنگین‌تر شود، حکم از آنِ راجح (سنگین‌تر) خواهد بود. و اسم لطیف (اللطيف) به واسطه هستی (الوجود) ما سنگین‌تر شده است، زیرا اسم رحمن ما را حفظ می‌کند، پس رحمت سنگین‌تر شد و حکم آن جاری گشت. بنابراین، رحمت اصل در ایجاد است و انتقام حکمی عارضی است، و عوارض ثباتی ندارند. زیرا هستی (الوجود) همراه ماست، پس ما به سوی رحمت و حکم آن می‌رویم. به همین دلیل به تقوای الهی امر شدیم، یعنی او را سپر قرار دهیم و از او پرهیز کنیم به دلیل تقابلی که در اوست. و این مانند قول او در استعاذه (پناه بردن) از او به اوست.\n\nپس فرمود: «و به تو از تو پناه می‌برم».\n\n### [مقام تقوا از مقاماتی است که در دنیا و آخرت همراه انسان است]\n\nو این (تقوا) از مقامات (المقامات) همراه در دنیا و آخرت است. زیرا اگر از احکام اسماء پرهیز کنی، به ویژه در بهشت که حکم انسان در آنجا برای صورت الهی است که بر آن سرشته شده، پس به شیء می‌گوید: «باش»، و آن شیء موجود می‌شود. چه بسا این مقام او را از آنچه در حق او بالاتر است محجوب سازد، و از «کثیب» (تپه نورانی) که برای او بهتر از آن چیزی است که در آن است، غافل شود. پس اسم الهیِ تذکردهنده می‌آید و او را به شرف رتبه کثیب و آنچه در آن به دست می‌آورد و آنچه با آن به سوی اهلش باز می‌گردد، متذکر می‌سازد. پس او از این اسمی که او را در بهشت نگه داشته، پرهیز می‌کند تا به آنچه در حق او افضل است و در کثیب به دست می‌آورد، مشتاق شود. به همین دلیل ما به همراهی مقام تقوا در دنیا و آخرت قائل شدیم. پس اگر این را دانستی، دانستی که مقام تقوای الهی برای بنده اکتسابی است و به همین دلیل به آن امر شده است. و همچنین هر آنچه به آن امر شده، مقامی است که کسب می‌شود. و به همین دلیل طایفه‌ای (صوفیه) گفته‌اند که مقامات (المقامات) مکاسب (کسب‌کردنی‌ها) هستند و احوال (الأحوال) مواهب (بخشیده‌شده‌ها).\n\n### [تقوای الهی در حکم بر ما بر دو قسم است]\n\nو تقوای الهی (التقوى الإلهية) در حکم بر ما بر دو قسم است، یعنی امر در آن به دو بخش تقسیم شده است: بخشی که خداوند ما را امر کرده است که آن‌گونه که شایسته تقوای اوست (حق تقاته) از او پروا کنیم، به دلیل مؤمن بودنمان؛ و بخشی که ما را امر کرده است که به اندازه استطاعت (الاستطاعة) از او پروا کنیم. و در این تکلیف، صفتی که گروه خاصی را مشخص کند، تعیین نشده است، برخلاف آنچه در حق تقوای او تعیین شده بود. اگرچه مؤمنان پیشتر ذکر شده‌اند و ضمیر به آن‌ها بازگشته است، اما چنین چیزی تصریح و تعیین نامیده نمی‌شود، پس از درجه تعیین پایین‌تر می‌آید و حکم دیگری برای آن پدید می‌آید.\n\n### [ضمایر، معینات و صفات]\n\nپس فرمود: **فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ** (پس تا می‌توانید از خدا پروا کنید) (تغابن: ۱۶). این آیه با فاء عطف و ضمیر جمع برای مذکوری که پیشتر ذکر شده، چه نزدیک و چه دور، آغاز شده است. زیرا ضمایر (المضمرات) به عالم غیب (عالم الغيب) ملحق می‌شوند و معینات (المعينات) به عالم شهادت (عالم الشهادة) ملحق می‌شوند. چون ضمیر برای هر معینی صلاحیت دارد و به یک فرد خاص اختصاص نمی‌یابد، پس مطلق است؛ اما معین مقید است. زیرا وقتی می‌گویی «زید»، او غیر از سایر اسماء است، چون برای شخص خاصی وضع شده است. و وقتی می‌گویی «تو» یا «او» یا «همانا تو»، این ضمیری است که برای هر مخاطبی، چه قدیمی و چه جدید، صلاحیت دارد. به همین دلیل ما بین ضمیر و معین (با اسم یا صفت) فرق گذاشتیم. و صفت (الصفة) برزخی است بین اسماء و ضمایر. زیرا وقتی می‌گویی «مؤمن» یا «نویسنده»، او را از غیر مؤمن متمایز کرده‌ای، پس از جهتی شبیه «زید» است، زیرا صفت او را معین کرده است، و از جهتی شبیه ضمایر است، زیرا بر هر کسی که این صفت را دارد اطلاق می‌شود. با این تفاوت که ضمیر خطابی، مثلاً، هر مخاطبی را در بر می‌گیرد، هر که باشد، از مؤمن و غیر مؤمن و انسان و غیر انسان.\n\n### [تقوای الهی آن‌گونه که شایسته تقوای اوست و تقوای الهی بر اساس استطاعت]\n\nپس تقوای الهی آن‌گونه که شایسته تقوای اوست (حق تقاته)، این است که پرهیزکار، تقوا را از جانب او ببیند، در حالی که خود از آن دور است، مگر در نسبت تکلیف به آن، زیرا در این صورت به دلیل سوء ادبی که با خداوند دارد، از آن دور نمی‌شود. پس حال کسی که حق تقوای الهی را به جا می‌آورد، مانند حال کسی است که حق شکر خداوند را به جا آورده است، و معنای آن پیشتر گذشت. و این آیه (حق تقاته) از سخت‌ترین آیاتی بود که بر صحابه گذشت، و گمان کردند که خداوند با آیه استطاعت (الاستطاعة) در تقوا، بر بندگانش تخفیف داده است، در حالی که نمی‌دانستند به سوی سخت‌تر منتقل شده‌اند. ما نیز همانند آنان می‌گفتیم، اما هنگامی که خداوند مراد خود را از «حقیت» در امثال این موارد تفسیر کرد، امر بر ما آسان شد و دانستیم که تقوای الهی بر اساس استطاعت (الاستطاعة) در تکلیف عظیم‌تر است. زیرا برای انسان دشوار است که در عمل خود نهایت تلاش و استطاعت (الاستطاعة) خود را به کار گیرد؛ ناگزیر باید مقداری اضافه باقی بگذارد، در حالی که در حق تقاته چنین نیست. و دانستیم که خداوند بنده را در استطاعت (الاستطاعة) ثابت کرده است، پس شایسته نیست که او را از موضعی که حق (الحق) او را در آن ثابت کرده است، نفی کنیم، زیرا این منازعه با خداوند است. و در حق تقاته، برای او نظر به سوی حق (الحق) در تقوای خود را ثابت کرده است، و این بر او آسان‌تر است. پس آنچه نزد آنان سخت بود، در واقعیت امر آسان‌تر بود، نزد کسی که از خداوند فهمید؛ و آنچه نزد آنان آسان بود، در واقعیت امر سخت بود، نزد کسی که از خداوند فهمید. خداوند ما را از کسانی قرار دهد که خطاب او را فهمیدند، پس رحمتی از جانب خود به او رسید، و آن همان فهمی است که به او عطا کرد و علمی که از نزد خود به او آموخت، و او را به «نزد خود» یا به نفس خود واگذار نکرد، بلکه خود متولی تعلیم او شد تا او را از ضعفی که بر آن است، آسوده سازد.\n\n### [حال تبرّی و حال ادعا]\n\nو اگر نبود که بنده استطاعت (الاستطاعة) در افعال و استقلال به آن‌ها را ادعا می‌کرد، خداوند هرگز تکلیفی و شریعتی نازل نمی‌کرد. و به همین دلیل بهره مؤمن از این ادعا این است که بگوید: **وَإِيَّاكَ نَسْتَعِينُ** (و تنها از تو یاری می‌جوییم) (فاتحه: ۵). و در حق ما و امثال ما، کسانی که از افعالی که وجودشان از آن‌ها ظاهر می‌شود تبرّی (بی‌زاری) جسته‌اند، فرمود: بگویید: «لا حول ولا قوة إلا بالله العلی العظیم» (هیچ جنبش و نیرویی نیست مگر به واسطه خداوند بلندمرتبه بزرگ)، از اینکه کسی در آن شریک باشد، پس آن خالص برای اوست. پس چقدر فاصله است بین دو حال: بین تبرّی (تبرّی) و ادعا (الدعوى). مدعی موظف به آوردن برهان بر ادعای خود است، و متبرّی موظف به آن نیست. و مگو که تبرّی خود ادعاست، زیرا تبرّی چیزی باقی نمی‌گذارد و اسم متبرّی بر این اساس اطلاق می‌شود. و ما در مورد امر محقق سخن می‌گوییم، زیرا اساس این کتاب ما، بلکه تمام کلام ما، بر سخن گفتن درباره امور آن‌گونه که در نفس خود هستند، بنا شده است. و تبرّی صفتی الهی و سلبی است، و حقیقت بنده سلب است. و ادعا صفتی الهی و ثبوتی است که جز برای خداوند عز و جل شایسته نیست. و بنده اگر به آن متصف شود، با خداوند در آن مزاحمت نمی‌کند و می‌گوید: «لا حول ولا قوة إلا بالله». و هرگاه بگوید: **وَإِيَّاكَ نَسْتَعِينُ**، آن را تنها به عنوان تلاوت می‌گوید نه به حقیقت، پس آنچه نیت کرده برای اوست، و او در جایی است که می‌داند. و اگر نبود که بنده با ادعا ظاهر می‌شد، به او گفته نمی‌شد: **فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ** (پس تا می‌توانید از خدا پروا کنید)، با آن نیرویی که آن را در میان دو ضعف برای شما قرار دادم. پس هر کس متوجه شود که نیروی او جعل شده است و متعلق به کسی است که آن را جعل کرده، در آن ادعایی نمی‌کند، بلکه آن نزد او امانتی است که مالک آن نیست. و انسان تنها با آنچه مالک است، غنی می‌شود. و امانت عاریه‌ای است که مالکیت ندارد، و کسی که امانت نزد اوست، مأمور به بازگرداندن آن به اهلش است. و این همان قول اوست: «لا حول ولا قوة إلا بالله»، یعنی قدرت قائم به خداست نه به ما. پس مدعیان در قدرت، «ما» در قول **مَا اسْتَطَعْتُمْ** را مصدریه می‌دانند (یعنی به اندازه توانایی)، و اهل تبرّی آن را برای نفی در آیه می‌دانند. پس نزد آنان استطاعت (الاستطاعة) در تقوا نفی شده است، و نزد کسی که آن را مصدریه دانسته، اثبات شده است.\n\n### [بازگرداندن همه امور به خداوند و توکل بر او در تمام شئون زندگی]\n\nو چون معنای تقوا این است که سپری (وقایة) در برابر آنچه به پرهیزکار نسبت داده می‌شود، قرار دهی، پس هنگامی که آن نسبت می‌آید، سپر حائل می‌شود بین آن و پرهیزکار تا به او نرسد و آزارش دهد، و سپر آن را دریافت می‌کند. و هیچ کس بر آزار صبورتر از خداوند نیست. زیرا تیر و نیزه و سنگ و ضربه شمشیر و مانند آن، نزد مبارز، تنها توسط سپر (وقایة) دریافت می‌شود، و آن همان سپری است که در دست دارد و خود از پشت آن، آن را نگه داشته است. اما (بنده) به میزانی قوی نیاز دارد برای امور عارضی که برای آن نسبت پیش آمده و مذموم نامیده می‌شود، پس بنده آن را می‌پذیرد و از روی ادب، خداوند را سپر قرار نمی‌دهد، اگرچه در واقع امر جز خداوند آن را دریافت نمی‌کند. اما ادب برای بنده در این مورد مشروع است، و این ادعا به او ضرر نمی‌رساند، زیرا آن صورتی است نه حقیقت. و اگر خداوند این را از تو بداند، پاداش کسی را به تو می‌دهد که امور را به او بازگردانده و در هر حالی بر او توکل کرده و زیر جریان مقدرات آرام گرفته و در آنچه خداوند در فرزندان شب و روز (حوادث زمان) پدید می‌آورد، گشایش یافته است. این است تقوای الهی که ما به تحقق آن اشاره‌ای کردیم، زیرا سخن گفتن در معنای آن مجالی وسیع دارد که به درازا می‌کشد. پس به همین اکتفا کردیم و به تقوای حجاب و ستر (پوشش) منتقل شدیم، و همه این‌ها از تقوای الهی است، زیرا او اصل است.\n\nجزء نود و سوم به پایان رسید.\n\n(به نام خداوند بخشنده مهربان)"
  },
  "page_count": 3
}