{
  "id": 93,
  "title": {
    "ar": "الباب الثالث والتسعون في الزهد",
    "en": "Chapter Ninety-Three, On Asceticism.",
    "ur": "تہترواں باب زہد کے بیان میں",
    "fa": "باب نود و سوم در زهد"
  },
  "content": {
    "ar": "## (الباب الثالث والتسعون في الزهد)\n\n\n> الزهد ترك محلل ومحلل *** ومحلل فازهد فزهدك ازهد\n\n\n> والترك شي‏ء لا وجود لعينه *** وله لسان في الشريعة يحمد\n\n\n> في الزهد تعظيم الأمور وما له *** عند المحقق قيمة لا تجحد\n\n\n### [ترك طلب الدنيا له أثر إلهى في القلب‏]\n\n\nالزهد لا يكون إلا في الحاصل في الملك والطلب حاصل في الملك فالزهد في الطلب زهد لأن أصحابنا اختلفوا في الفقير الذي لا ملك له هل يصح له اسم الزاهد أو لا قدم له في هذا المقام فمذهبنا أن الفقير متمكن من الرغبة في الدنيا والتعمل في تحصيلها ولو لم يحصل فتركه لذلك التعمل والطلب والرغبة عنه يسمى زهدا بلا شك وذلك الطلب في ملكه حاصل فلهذا حددناه بما ذكرنا ولقد فاوضت في هذه المسألة جماعة من أهل الله فأكثرهم قال بقولنا وسبب ذلك أن‏\nصاحب الذوق لا بد أن يرى لتركه طلب الدنيا والرغبة فيها أثرا إلهيا في قلبه فلو لم يكن للأمر وجود عند الله واعتبار ما صح أن يكون له أثر في التجلي الإلهي لصاحب هذا الحال وهو الصحيح‏\n\n\n### [مقام الزهد وحاله ومستوياته‏]\n\n\nفلنقل إن للزهد الذي ذكرناه مقاما وحالا فمقامه الإلهي مطلق وهو زهده في كل اسم إلهي يحول بينه وبين عبوديته والرباني مقيد بصفة التنزيه عن حكم هذا الاسم عليه والرحماني هو صرفه على ما يستحقه أعني هذا المزهود فيه فأما في الملك من كونه مسلما فالزهد في الأكوان وهو الحجاب الأبعد الأقصى وأما في الجبروت من كونه مؤمنا فالزهد في نفسه وهو الحجاب الأدنى الأقرب وأما في الملكوت من كونه محسنا فالزهد في كل ما سوى الله وهنا يرتفع الحجاب عند الطائفة\n\n\n### [مقولة أبي يزيد الأكبر في الزهد]\n\n\nقال أبو يزيد الأكبر ليس الزهد عندي بمقام إني كنت زاهدا ثلاثة أيام أول يوم زهدت في الدنيا واليوم الثاني زهدت في الآخرة واليوم الثالث زهدت في كل ما سوى الله فناداني الحق ما ذا تريد فقلت أريد أن لا أريد لأني أنا المراد وأنت المريد وقد انتقد عليه هذا القول بعض أهل الطريق وجهل مقام أبي يزيد في ذلك وقد تكلمنا على قصده بهذا القول وبينا فساد هذا القول أعني قول المعترض عليه في غير هذا الموضع‏\n\n\n### [متى ينبغي للعبد أن يزهد ومتى ينبغي له أن لا يزهد]\n\n\nوهو من المقامات المستصحبة للعبد ما لم ينكشف له فإذا كشف الغطاء عن عين قلبه لم يزهد ولا ينبغي له أن يزهد فإن العبد لا يزهد فيما خلق له ولا يكون زاهدا إلا من يزهد فيما خلق من أجله وهذا لا يصح كونه فالزهد من القائل به جهل في عين الحقيقة لأنه ما ليس لي لا اتصف بالزهد فيه وما هو لي لا يمكنني الانفكاك عنه فأين الزهد فلنقل صاحب هذا الحكم هذا هو الزهد الذي يستحق هذا الاسم ولنا في هذا المقام الزهدي نظم‏\n\n\n> العيب منك وأنت لا تدري *** فالزهد مثل صلاتي الوتر\n\n\n> وسراج نفسك نوره متعلق *** بجميع ما في الكون من أمر\n\n\n> فأطف السراج يزول كل تعلق *** فالزهد فيك كليلة القدر\n\n\n> شهي من غروب الشمس حتى تنتهي *** بالحكم فيك كمطلع الفجر\n\n\nيقول لو رأيت الحق لم تزهد فإن الله ما زهد في الخلق وما ثم تخلق إلا بالله فبمن تتخلق في الزهد انظر إلى هذا المعنى فإنه دقيق جدا\n\n",
    "en": "Chapter Ninety-Three: Concerning Renunciation (al-Zuhd)\n\nRenunciation is the abandonment of the permissible and the permissible, *** and the permissible; so renounce, for your renunciation is the most profound renunciation.\nAnd abandonment (al-Tark) is a thing whose essence has no existence, *** yet it possesses a language within the Sacred Law (al-Shari'a) that is lauded.\nIn Renunciation is the magnification of affairs, yet it holds *** no undeniable value for the realized one (al-Muhaqqiq).\n\n### [The Abandonment of Seeking the World Has a Divine Effect upon the Heart]\n\nRenunciation (al-Zuhd) only occurs regarding what is possessed within Dominion (al-Mulk), and seeking (al-Talab) is possessed within Dominion. Therefore, renunciation of seeking is renunciation, because our companions have differed concerning the poor person who possesses nothing: Is the name of the Renouncer valid for him, or does he have no standing in this Station (al-Maqam)?\n\nOur doctrine is that the poor person is capable of desiring the world and striving to acquire it, even if he does not succeed. His abandonment of that striving, seeking, and desire is undoubtedly called renunciation, because that seeking is present in his possession (milk). This is why we defined it as we have mentioned.\n\nI have discussed this issue with a group of the People of Allah (Ahl Allah), and most of them agreed with our view. The reason for this is that the person of spiritual taste (Sahib al-Dhawq) must perceive a Divine effect (athar ilahi) in his heart due to his abandonment of seeking the world and desiring it. If the matter had no existence or consideration with Allah, it would not be valid for it to have an effect in the Divine Theophany (al-Tajalli al-Ilahi) for the person experiencing this state (al-Hal)—and this is the correct view.\n\n### [The Station of Renunciation, its State, and its Levels]\n\nLet us say that the renunciation we have mentioned has a Station (Maqam) and a State (Hal). Its Divine Station (Maqam al-Ilahi) is absolute, which is his renunciation of every Divine Name (Ism Ilahi) that intervenes between him and his servitude ('ubudiyya). The Lordly (Rabbani) Station is restricted by the attribute of transcendence (tanzih) from the ruling of that Name over him. The Merciful (Rahmani) Station is his directing it [the Name] toward what it deserves—meaning, that which is renounced.\n\nAs for the Dominion (al-Mulk), from the perspective of being a Muslim, renunciation is in the created things (al-Akwan), and this is the furthest, most distant Veil (al-Hijab al-Aqsa). As for the Realm of Power (al-Jabarut), from the perspective of being a Believer (Mu'min), renunciation is in the self (nafs), and this is the nearest, closest Veil (al-Hijab al-Adna). As for the Realm of Sovereignty (al-Malakut), from the perspective of being an Excellent Doer (Muhsin), renunciation is in everything other than Allah. And here, the Veil (al-Hijab) is lifted according to the Sufi community (al-Ta'ifa).\n\n### [The Saying of Abu Yazid al-Akbar concerning Renunciation]\n\nAbu Yazid al-Akbar said: \"Renunciation is not a Station (Maqam) for me. I was a renouncer for three days. On the first day, I renounced the world (al-Dunya). On the second day, I renounced the Hereafter (al-Akhira). On the third day, I renounced everything other than Allah.\" Then the Real (al-Haqq) called out to me, 'What do you desire?' I replied, 'I desire not to desire, because I am the Desired (al-Murad) and You are the Desirer (al-Murid).'\n\nSome of the People of the Path (Ahl al-Tariq) criticized this saying, being ignorant of Abu Yazid’s Station (Maqam) in that regard. We have already discussed his intention behind this saying and clarified the invalidity of the criticism—meaning, the statement of the objector—in another place.\n\n### [When the Servant Should Renounce and When He Should Not Renounce]\n\n[Renunciation] is one of the Stations (al-Maqamat) that accompanies the servant until Unveiling (al-Kashf) occurs for him. When the covering is lifted from the eye of his heart, he does not renounce, nor should he renounce. For the servant does not renounce that for which he was created, and only he who renounces that for the sake of which he was created can be a renouncer. This latter condition is not valid.\n\nTherefore, renunciation, for the one who asserts it, is ignorance regarding the very Essence of Reality (ayn al-Haqiqa). This is because I cannot be described as renouncing what is not mine, and I cannot detach myself from what is mine. So, where is the renunciation?\n\nLet us say that the possessor of this judgment [i.e., the one who sees the truth] holds that this is the renunciation that deserves the name. We have a poem concerning this Station of Renunciation (al-Maqam al-Zuhdi):\n\nThe fault is from you, though you do not know, *** so Renunciation is like my Witr prayer.\nAnd the lamp of your soul, its light is attached *** to every affair that is in the cosmos.\nSo extinguish the lamp, and every attachment will vanish, *** for Renunciation in you is like the Night of Power (Laylat al-Qadr).\nIt is desired from the setting of the sun until it ends *** with the judgment upon you, like the rising of the dawn.\n\nHe says: If you saw the Real (al-Haqq), you would not renounce, for Allah did not renounce Creation (al-Khalq), and there is no creation (takhalluq) except through Allah. So, by whom do you take on the character (takhalluq) of renunciation? Reflect upon this meaning, for it is extremely subtle.",
    "ur": "باب ترانوے (۹۳) زہد کے بیان میں\n\nزہد حلال اور حلال اور حلال کو ترک کرنا ہے، پس زہد اختیار کر، کیونکہ تیرا زہد ہی سب سے بڑا زہد ہے۔\nاور ترک ایک ایسی شے ہے جس کی اپنی کوئی ہستی (الوجود) نہیں، مگر شریعت میں اس کی زبان قابل تعریف ہے۔\nزہد میں امور کی تعظیم ہے، حالانکہ محقق (المحقق) کے نزدیک اس کی ایسی قدر و قیمت ہے جس کا انکار نہیں کیا جا سکتا۔\n\n### دنیا کی طلب کو ترک کرنے کا قلب پر ایک الٰہی اثر ہوتا ہے\n\nزہد صرف اس چیز میں ہوتا ہے جو ملکیت (الملک) میں حاصل ہو، اور طلب ملکیت (الملک) میں حاصل ہوتی ہے۔ پس طلب میں زہد اختیار کرنا ہی زہد ہے۔ کیونکہ ہمارے اصحاب میں اس فقیر کے بارے میں اختلاف ہے جس کی کوئی ملکیت نہ ہو، کہ کیا اس کے لیے زاہد کا نام صحیح ہے یا اس مقام (المقام) میں اس کا کوئی حصہ نہیں؟ ہمارا مسلک یہ ہے کہ فقیر دنیا کی رغبت اور اس کے حصول کی کوشش کرنے پر قادر ہوتا ہے، اگرچہ وہ اسے حاصل نہ کرے۔ پس اس کا اس کوشش، طلب اور رغبت کو ترک کرنا بلاشبہ زہد کہلاتا ہے۔ اور وہ طلب اس کی ملکیت (الملک) میں حاصل ہے۔ اسی لیے ہم نے اس کی حد بندی اسی طرح کی ہے جو ہم نے بیان کی۔ میں نے اس مسئلے میں اہل اللہ کی ایک جماعت سے گفتگو کی تو ان میں سے اکثر نے ہمارے قول کی تائید کی۔ اس کی وجہ یہ ہے کہ:\nصاحب ذوق (الذوق) کے لیے یہ ضروری ہے کہ وہ دنیا کی طلب اور اس کی رغبت کو ترک کرنے کا ایک الٰہی اثر اپنے قلب میں دیکھے۔ اگر اس امر کی اللہ کے نزدیک کوئی ہستی (الوجود) اور اعتبار نہ ہوتا تو صاحبِ حال کے لیے ظہور الٰہی (التجلی الإلهي) میں اس کا کوئی اثر صحیح نہ ہوتا، اور یہی صحیح بات ہے۔\n\n### زہد کا مقام (المقام)، اس کا حال (الحال) اور اس کے درجات\n\nتو ہم کہتے ہیں کہ جس زہد کا ہم نے ذکر کیا ہے اس کا ایک مقام (المقام) اور ایک حال (الحال) ہے۔ اس کا الٰہی مقام (المقام الإلهي) مطلق ہے، اور وہ ہر اس الٰہی نام سے زہد اختیار کرنا ہے جو اسے اس کی عبودیت سے روکتا ہے۔ اور ربانی زہد اس صفتِ تنزیہ کے ساتھ مقید ہے کہ اس نام کا حکم اس پر نہ ہو۔ اور رحمانی زہد یہ ہے کہ اسے (یعنی جس چیز سے زہد کیا گیا ہے) اس کے مستحق پر صرف کیا جائے۔ جہاں تک ملکیت (الملک) میں زہد کا تعلق ہے، اس اعتبار سے کہ وہ مسلم ہے، تو وہ اکوان (کائنات) سے زہد ہے، اور یہ سب سے دور اور آخری حجاب ہے۔ اور جہاں تک جبروت میں زہد کا تعلق ہے، اس اعتبار سے کہ وہ مومن ہے، تو وہ اپنی ذات سے زہد ہے، اور یہ سب سے قریب اور ادنیٰ حجاب ہے۔ اور جہاں تک ملکوت میں زہد کا تعلق ہے، اس اعتبار سے کہ وہ محسن ہے، تو وہ اللہ کے سوا ہر چیز سے زہد ہے، اور یہاں اس گروہ کے نزدیک حجاب اٹھ جاتا ہے۔\n\n### ابو یزید اکبر کا زہد کے بارے میں قول\n\nابو یزید اکبر نے فرمایا: میرے نزدیک زہد کوئی مقام (المقام) نہیں ہے۔ میں تین دن تک زاہد رہا۔ پہلے دن میں نے دنیا سے زہد کیا، دوسرے دن میں نے آخرت سے زہد کیا، اور تیسرے دن میں نے اللہ کے سوا ہر چیز سے زہد کیا۔ پس حق تعالیٰ (الحق) نے مجھے ندا دی: تو کیا چاہتا ہے؟ میں نے کہا: میں چاہتا ہوں کہ میں کچھ نہ چاہوں، کیونکہ میں مراد ہوں اور تو مرید ہے۔ اہل طریق میں سے بعض نے اس قول پر اعتراض کیا اور اس معاملے میں ابو یزید کے مقام (المقام) سے ناواقف رہے۔ ہم نے اس قول سے ان کے مقصد پر بات کی ہے اور معترض کے قول کے فساد کو اس جگہ کے علاوہ کہیں اور بیان کیا ہے۔\n\n### کب بندے کو زہد اختیار کرنا چاہیے اور کب اسے زہد اختیار نہیں کرنا چاہیے\n\nیہ ان مقامات (المقامات) میں سے ہے جو بندے کے ساتھ رہتے ہیں جب تک کہ اس پر کشف (الکشف) نہ ہو جائے۔ پس جب اس کے قلب کی آنکھ سے پردہ ہٹ جائے تو وہ زہد نہیں کرتا اور نہ ہی اسے زہد کرنا چاہیے۔ کیونکہ بندہ اس چیز سے زہد نہیں کرتا جس کے لیے اسے پیدا کیا گیا ہے، اور زاہد وہی ہوتا ہے جو اس چیز سے زہد کرے جس کے لیے اسے پیدا کیا گیا ہے۔ اور یہ صحیح نہیں ہو سکتا۔ پس جو شخص زہد کا قائل ہے، وہ عین حقیقت کے معاملے میں جہالت میں ہے، کیونکہ جو چیز میری نہیں ہے، میں اس میں زہد کی صفت سے متصف نہیں ہو سکتا، اور جو چیز میری ہے، میں اس سے الگ نہیں ہو سکتا۔ تو زہد کہاں رہا؟ پس ہم کہتے ہیں کہ اس حکم کا حامل (صاحب) یہی وہ زہد ہے جو اس نام کا مستحق ہے۔ اور اس زہدی مقام (المقام) میں ہمارا ایک نظم ہے:\n\nعیب تجھ میں ہے اور تو نہیں جانتا، پس زہد میری نمازِ وتر کی مانند ہے۔\nاور تیری نفس کا چراغ کائنات میں ہر امر سے متعلق ہے۔\nپس چراغ بجھا دے تو ہر تعلق زائل ہو جائے گا، پس تجھ میں زہد شب قدر کی مانند ہے۔\nیہ غروب آفتاب سے شروع ہو کر، تجھ میں حکم کے ساتھ طلوع فجر تک جاری رہتا ہے۔\n\nوہ فرماتے ہیں: اگر تو ذات حق (الحق) کو دیکھ لے تو زہد نہیں کرے گا، کیونکہ اللہ نے مخلوق سے زہد نہیں کیا، اور وہاں اللہ کے بغیر کوئی تخلیق نہیں ہے۔ تو پھر تو کس کے ساتھ زہد میں تخلیق کرے گا؟ اس معنی پر غور کر، کیونکہ یہ بہت دقیق ہے۔",
    "fa": "(باب نود و سوم در زهد)\n\nزهد ترک حلال و حلال و حلال است *** پس زهد بورز که زهد تو زاهدتر است\nو ترک (الترك) چیزی است که عینیت و وجودی ندارد *** اما در شریعت زبانی دارد که ستوده می‌شود\nدر زهد، بزرگداشت امور است، و آنچه نزد محقق (المحقق) ارزشی دارد که انکار نمی‌شود.\n\n### [ترک طلب دنیا اثری الهی در قلب دارد]\n\nزهد (الزهد) تنها در آنچه در قلمرو (ملک) حاصل است، محقق می‌شود. و طلب (الطلب) در قلمرو حاصل است، پس زهد در طلب، زهد است. زیرا اصحاب ما در مورد فقیری که مالکیتی ندارد اختلاف کرده‌اند که آیا نام زاهد بر او صحیح است یا خیر، یا اینکه آیا او در این مقام قدمی دارد. مذهب ما این است که فقیر می‌تواند به دنیا رغبت داشته باشد و برای به دست آوردن آن تلاش کند، حتی اگر به دست نیاورد. پس ترک آن تلاش، طلب و رغبت، بدون شک زهد نامیده می‌شود. و آن طلب در قلمرو او حاصل است، به همین دلیل آن را به آنچه ذکر کردیم محدود کردیم. من در این مسئله با گروهی از اهل الله (أهل الله) گفتگو کردم و بیشتر آنها با نظر ما موافق بودند. دلیل این امر آن است که صاحب ذوق (صاحب الذوق) ناگزیر است که برای ترک طلب دنیا و رغبت به آن، اثری الهی در قلب خود ببیند. اگر این امر نزد حق (الحق) وجود و اعتباری نداشت، صحیح نبود که برای صاحب این حال، اثری در تجلی الهی (التجلی الإلهی) داشته باشد، و این قول صحیح است.\n\n### [مقام زهد، حال آن و سطوح آن]\n\nپس بگوییم که زهد (الزهد) مذکور، دارای مقام و حال است. مقام الهی (الإلهی) آن مطلق است و آن زهد ورزیدن بنده در هر اسم الهی است که میان او و عبودیتش حائل می‌شود. و مقام ربانی (الربانی) مقید به صفت تنزیه از حکم آن اسم بر اوست. و مقام رحمانی (الرحمانی) آن است که آن را بر آنچه سزاوار است صرف کند، یعنی همین چیزی که مورد زهد واقع شده است. اما در عالم مُلک (الملک) از حیث مسلمان بودن، زهد در اکوان (الأکوان) است و آن دورترین و دورترین حجاب است. و اما در عالم جبروت (الجبروت) از حیث مؤمن بودن، زهد در نفس خود است و آن نزدیک‌ترین و نزدیک‌ترین حجاب است. و اما در عالم ملکوت (الملکوت) از حیث محسن بودن، زهد در هر چیزی است که غیر خداست، و در اینجا حجاب نزد این طایفه برداشته می‌شود.\n\n### [سخن ابویزید اکبر در باب زهد]\n\nابویزید اکبر (أبو يزيد الأكبر) گفت: زهد نزد من مقام نیست. من سه روز زاهد بودم؛ روز اول در دنیا زهد ورزیدم، روز دوم در آخرت زهد ورزیدم، و روز سوم در هر آنچه غیر خداست زهد ورزیدم. پس حق (الحق) مرا ندا داد که چه می‌خواهی؟ گفتم: می‌خواهم که نخواهم، زیرا من مراد هستم و تو مرید. برخی از اهل طریق (أهل الطريق) این سخن را بر او نقد کرده و مقام ابویزید را در این باره نشناخته‌اند. ما در موضعی دیگر درباره قصد او از این سخن صحبت کرده‌ایم و فساد این قول، یعنی قول معترض بر او را بیان نموده‌ایم.\n\n### [چه زمانی بنده باید زهد بورزد و چه زمانی نباید زهد بورزد]\n\nزهد از مقاماتی است که بنده تا زمانی که کشف (الکشف) برایش حاصل نشده، آن را همراه دارد. اما هنگامی که پرده از چشم قلبش برداشته شود، زهد نمی‌ورزد و شایسته نیست که زهد بورزد. زیرا بنده در آنچه برای او خلق شده است زهد نمی‌ورزد، و زاهد نیست مگر کسی که در آنچه از برای او خلق شده است زهد بورزد، و این صحیح نیست که چنین باشد. پس زهد از جانب گوینده آن، جهل در عین حقیقت (عين الحقيقة) است؛ زیرا آنچه از آنِ من نیست، به زهد ورزیدن در آن متصف نمی‌شوم، و آنچه از آنِ من است، نمی‌توانم از آن جدا شوم. پس زهد کجاست؟ پس بگوییم که صاحب این حکم، این همان زهدی است که شایسته این نام است. و ما در این مقام زهدی، شعری داریم:\n\nعیب از توست و تو نمی‌دانی *** پس زهد مانند نماز وتر من است\nو نور چراغ نفس تو وابسته است *** به هر آنچه در هستی (الکون) از امر وجود دارد\nپس چراغ را خاموش کن تا هر تعلقی از بین برود *** زهد در تو مانند شب قدر است\n(زهد) از غروب خورشید آغاز می‌شود تا زمانی که پایان یابد *** با حکم در تو، مانند طلوع فجر\n\nمی‌گوید: اگر حق (الحق) را می‌دیدی، زهد نمی‌ورزیدی. زیرا خداوند در خلق زهد نورزیده است، و هیچ تخلق (تخلق) و صفتی جز به واسطه خدا نیست. پس در زهد به چه کسی تخلق می‌جویی؟ به این معنا بنگر که بسیار دقیق است."
  },
  "page_count": 2
}