{
  "id": 273,
  "title": {
    "ar": "الباب الثالث والسبعون ومائتان في معرفة منزل الهلاك للهوى والنفس من المقام الموسوي",
    "en": "Chapter Two Hundred and Seventy-Three: Concerning the Gnosis of the Station of Annihilation (هلاك) of Caprice (هوى) and the Soul (نفس) within the Mosaic Station (المقام الموسوي).",
    "ur": "باب دو سو تہتر (۲۷۳): مقام موسوی (المقام الموسوي) سے ہویٰ (الهوى) اور نفس (النفس) کی ہلاکت (هلاك) کی منزل کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب دویست و هفتاد و سوم در معرفت منزل هلاکت برای هویٰ و نفس از مقام موسوی"
  },
  "content": {
    "ar": "## (الباب الثالث والسبعون ومائتان في معرفة منزل الهلاك للهوى والنفس من المقام الموسوي)\n\n\n> هلاك الخلق في الريح *** إذا ما هب في اللوح‏\n\n\n> ولاذ بغير مولاه *** إله الجسم والروح‏\n\n\n> ووعر مسلكا سهلا *** بما قد جاء في نوح‏\n\n\n> وفي لوط فيا نفسي *** على ما قلته نوحي‏\n\n\n> ولو لا العشق آداه *** بريق من سنا يوحي‏\n\n\n### [أن للأفلاك منازل تجرى إلى أجل مسمى‏]\n\n\nاعلم أن الله تعالى لما خلق الأفلاك وعمرها بالأملاك وقدر للكواكب السبعة السيارة فيها منازل تجري فيها إلى أجل مسمى تعين الزمان بجريانها وسباحتها وخلق المكانة قبل الأمكنة ومد منها رقائق إلى أمكنة مخصوصة في السموات السبعة والأرض ثم أوجد المتمكنات في أمكنتها على قدر مكانتها فكان من تقدير الله العزيز العليم إن خلق عقلا من العقول أعلاما بما أودعه فيه من صفة القدرة لا من صفة غيرها خصه بذلك على أبناء جنسه وذلك من الاسم الظاهر الذي يختص بهذا العقل فالقى إليه ذلك بضرب من القهر سار فيه مودة لها ثلج وبرد وسرور فتفجرت فيه خمسة أنهار من العلم من الاسم الأول والآخر الذي يختص به هذا العقل ثم جرت هذه الأنهار في الاسم الباطن الذي له فتقدست أوليته على سائر الأوليات وآخريته على سائر الآخريات وكذلك ظاهره وباطنه وصدر عن أم الكتاب الذي عنده حضرة تسمى أم الجمع أدخلني الحق إياها فرأيتها ورأيت ظاهرها وباطنها وعاينت مكان هذا العقل منها نكتة سوداء مستورة نقية ما بين حمرة وصفرة وعاينت الرقيقة التي بين المكانة وهذا المكان المعين ورأيت موسى وهارون ويوسف عليهم السلام ناظرين إلى هذا العقل وفرع سبحانه من هذه الحضرة الجامعة التي اختصها لنفسه حضرات لا يعلم عددها إلا الله في السماء والأرض وما بينهما وما تحت الثرى إلى حد الاستواء كل هذه الحضرات للحق إليها نظر\nخاص رفعها بذلك على غيرها فلها عند من يعرفها ممن عرفه الحق بها حرمة وبروا كرام تسمى هذه الحضرات مقامات التنزيه إذا دخلتها الروحانيات العلى اكتسبت من أحوال التنزيه الإلهي ما لا يعلم قدره إلا الله وحصل لهم من الخضوع والخشوع والذلة والافتقار ما لم يكن لهم قبل دخولهم ومن هذه الحضرات وفي هذه المقامات يحصل لهم رؤية وجه الحق في كل شي‏ء على التمام والكمال لكن من الرجال من يشاهدها ومن الرجال من يعطيهم هذه الحال ولا يعرفها ولا يدري في أي رتبة حصلت له على قدر ما سبق به علم الله فيه فمنهم ومنهم فلنرجع إلى ذلك العقل الذي ذكرناه الذي له أثر انفعال بمكانته في هذا المنزل ونذكر ما كان له وما كان عنه وبسببه مما يختص بهذا المنزل عند كل من شاهده وشخص سبحانه مقام الصدق والصفاء وعين فيه اثنتين وسبعين مرقاة كل مرقاة منها تعطي علوما لمن يرقى فيها للصفاء الذي استلزمته هذه الصورة فهي علوم كشف إلى أن ينتهي إلى ذروتها فتقابله حضرة الأم بذاتها فتعطيه من التنزيه الإلهي والثناء بالوحدانية والصدق والقهر والنصر والإخلاص والذلة ولما أدخلني الله هذه المراقي رأيته سبحانه قد حجبها عن الأعين بظلمة الطبيعة حجابا لا يرفع فليس اليوم لراق فيها قدم موضوعة لكنه يكاشف بها من خلف ظلمة الطبع ولا يحصل له فيها قدم كذا رأيته ورأيت معي من حقائق العارفين جملة كثيرة على مراتب مختلفة من عال وأعلى وهم فيها بهذه المثابة فأمر لهذا العقل المخصوص بهذا المنزل أن يرقى فيما شخصه مما ذكرناه واجتمعت العقول إليه وأنا أنظر ما يصنع وما يقول لأستفيد منه ثم رأيته شخص ولم يتكلم ولا أدري بأمر إلهي أشخص فرأيت عليه حين رجع أثر كآبة وقهر وانزعاج فعلمت أنه في مقام انذار من الإنذارات الحق للأرواح روى في خبر أن جبريل وميكائيل عليهما السلام قعدا يبكيان فأوحى الله إليهما ما هذا البكاء فقالا إنا لا نأمن من مكرك فأوحى الله إليهما كذلك فلتكونا فلما ألقى إلينا ما ألقى إليه بخشوع وذلة واتفق إني اطلعت على اليسار فرأيت الهوى والشهوة وهما يتناجيان وقد أعطى الله من القوة النافذة لهذا الهوى ما يظهر بها على أكثر العقول إلا أن يعصم الله تعالى فوقف الهوى في ذلك الموقف وقال أنا الإله المعبود عند كل موجود وأعرض عن العقل وما جاء به من النقل فأتبعته الشياطين والشهوة بين يديه حتى توسط بحبوحة النار ففرش له فراش من القطران واعتمد على أمر تخيل أنه ينجيه من عذاب الله فحال الله بينه وبين من اعتمد عليه واستند إليه فهلك ومن تبعه بنعيم السعداء وكان مشهدا كريما هائلا مفزعا ما صدقنا التخلص منه أنا وكل عارف حضره معنا في ذلك اليوم ثم إني أردت أن أحيط بما في هذا المنزل من المراتب والحقائق والأسرار والعلوم فأخذ بيدي ذلك العقل صاحب هذا المنزل وبسببه ظهر هذا المنزل وقال لي هذا منزل الهلاك ومصرع الهلاك فرأيت فيه خمسة أبيات في البيت الأول أربع خزائن على الخزانة الأولى ثلاثة أقفال وعلى الثانية مثل ذلك وعلى الثالثة ستة أقفال وعلى الرابعة ثلاثة أقفال فأردت فتحها فقال لي سر حتى ترى ما في كل بيت من الخزائن وبعد ذلك تفتح أقفالها وتعرف ما فيها ثم أخذ بيدي وقمنا فخرجنا إلى البيت الثاني فدخلته فرأيت فيه أربع خزائن على الخزانة الأولى ستة أقفال وعلى الخزانة الثانية ثلاثة أقفال وعلى الخزانة الثالثة أربعة أقفال وعلى الخزانة الرابعة ستة أقفال ثم أخذ بيدي فخرجنا من ذلك البيت فدخلت البيت الثالث فرأيت فيه ثلاث خزائن على الخزانة الأولى خمسة أقفال وعلى الخزانة الثانية أربعة أقفال وعلى الخزانة الثالثة ستة أقفال ثم أخذ بيدي فخرجنا من ذلك البيت وكل ذلك أدخل من باب وأخرج من باب آخر فدخلت البيت الرابع وإذا فيه ثلاث خزائن على الخزانة الأولى سبعة أقفال وعلى الخزانة الثانية خمسة أقفال وعلى الثالثة خمسة أقفال ثم أخذ بيدي فخرجنا منها فدخلت البيت الخامس فرأيت فيه ثلاث خزائن على الخزانة الأولى سبعة أقفال وعلى الخزانة الثانية ثلاثة أقفال وعلى الخزانة الثالثة خمسة أقفال ثم أخذ بيدي وخرجنا نطلب‏\n\n\nالبيت الأول لنفتح تلك الأقفال فنبصر ما تحوي عليه تلك الخزائن من الودائع فدخلت البيت الأول إلى الخزانة الأولى فرأيت معلقا على كل قفل مفتاحه وبعض الأقفال عليه مفتاحان وثلاثة فرأيت على القفل الأول ثلاثة مفاتيح تحوي تلك المفاتيح على أربعمائة حركة فمددت يدي وفتحت ذلك القفل ثم رأيت على القفل الثالث كذلك ثلاثة مفاتيح تحوي على أربعمائة حركة ففتحت الثالث ورجعت إلى الثاني وعليه مفتاحان وهو قفل مطبق فهما قفلان في قفل واحد يحوي على أربع‏\nحركات في حركتين فلما فتحت الأقفال وأطلعت في الخزائن بدا لي من صور العلوم على قدر حركات مفاتيح تلك الخزانة لا تزيد ولا تنقص فرأيت علوما مهلكة ما اشتغل بها أحد إلا هلك من علوم العقل المخصوصة بأرباب الأفكار من الحكماء والمتكلمين فرأيت منها ما يؤدي صاحبها إلى الهلاك الدائم ورأيت منها ما يؤدي صاحبه إلى هلاك ثم ينجو غير أنه ليس لنور الشرع فيها أثر البتة قد حرمت صاحبها السعادة فيها من علوم البراهمة كثير ومن علوم السحر وغير ذلك فحصلت جميع ما فيها من العلوم لنجتنبها وهي أسرار لا يمكن إظهارها وتسمى علوم السر وكان ممن اختص بها من الصحابة رضي الله عنهم حذيفة بن اليمان خصه بها رسول الله صلى الله عليه وسلم فلذلك كان بين الصحابة يقال له صاحب علم السر وبه كان يعرف أهل النفاق حتى إن عمر بن الخطاب رضي الله عنه استحلفه يوما بالله هل في من ذلك شي‏ء قال لا ولا أقوله لأحد بعدك وكان عمر بن الخطاب لا يصلي على جنازة بحضور حذيفة حتى يرى حذيفة يقول بالصلاة عليها فإن صلى حذيفة صلى عمر وإلا فلا فمن علمها ليحذرها فقد سعد ومن علمها يعتقدها ويعمل عليها فقد شقي فلما حصلتها وأحطت بها علما ونزهت نفسي بما عصمني الله به من العناية الإلهية عن العمل بها والاتصاف بأثرها شكرت الله على ذلك وفي هذه المقامات هلك كثير من سالكي هذه الطريقة لأنهم يرون علوما تتعشق بها النفوس ويكونون بها أربابا ويكونون بها أشياخا والنفوس تطلب الشفوف والرئاسة على أبناء جنسها فيخرجون بها فيستعملونها في عالم الملك فيضلون ويضلون ف أَضَلُّوا كَثِيراً وضَلُّوا عَنْ سَواءِ السَّبِيلِ ثم إني انتقلت إلى الخزانة الثانية فرأيت على قفلين منها مفاتيح والقفل الثالث لا مفتاح عليه فرأيت على القفل الأول ثلاثة مفاتيح تحوي على عشر حركات ففتحته ثم جئت القفل الثاني فوجدت عليه مفتاحا واحدا يحوي على أربع حركات فأخذته وفتحت به القفل ثم جئت إلى القفل الثالث فلم أر عليه مفتاحا فحرت ولم أدر كيف أصنع فقيل لي اقرأ على كل قفل لا مفتاح له إن ربك هُوَ الْفَتَّاحُ الْعَلِيمُ ثم قيل لي هذا القفل مفتاحه من مفاتيح الغيب لا يعلمه إلا هو فقلت ذلك فانفتح القفل وانفتحت الخزانة فرأيت صور العلوم على عدد حركات المفاتيح ورأيت صورة علم زائد على ما رأيت من الصور التي ظهرت على عدد حركات المفاتيح فقلت ما هذا العلم فقال العلم الساري في المعلومات والعلوم فجميع العلوم معلومات بهذا العلم لا بأنفسها فعلمت إن أبا المعالي الجويني لما قال إذ بالعلم يعلم العلم كما يعلم به سائر المعلومات وأراد أن العلم الذي به يعلم معلوم ما به يعلم نفس العلم وليس الأمر كما زعم بل يعلم العلم بهذا العلم الساري فتكون العلوم به معلومة وهو لا بعلم فاعلم ذلك فهذا هو الذي أعطاه الكشف كشف المعاني لا كشف الصور وهذه العلوم التي رأيت في هذه الخزانة الثانية علوم القدرة والاقتدار والعلوم التي تتكون عنها الأشياء وتظهر بها الأعيان المضافة إلى الأكوان وهي أعيان أفعال منسوبة إلى العباد فهذا المنزل يحكم عليها بالهلاك بسبب العلم الساري الذي صحبها وهو هلاك إضافة ونسبة لا هلاك عين فالذي هلك إنما هو نسبة هذه الأفعال إلى العباد فيعطيه هذا المنزل أن هذه النسبة ليست بصحيحة وهو عين هلاكها وأطلعه العلم الساري إنها أفعال الله فأعيان أفعال العباد بريئة من الهلاك فحصلت من هذه الحركة علوم التكوين وسر قوله كُنْ الساري في كل متكون ثم إني انتقلت إلى الخزانة الثالثة التي عليها ستة أقفال ومفاتيحها على أقفالها فعلى القفل الأول مفتاح واحد يحوي على حركة واحدة وعلى الثاني مفتاحان يحويان على حركتين وعلى الثالث مفتاحان يحويان على عشر حركات وعلى الرابع مفتاح واحد يحوي على ثلاثين حركة وعلى الخامس مفتاح واحد يحوي على خمس حركات وعلى السادس مفتاحان يحويان على حركتين فأخذت المفاتيح وفتحت الأقفال فلما انفتحت الخزانة رأيت جهنم تحطم بعضها بعضا وفي وسطها روضة خضراء ورأيت رجلا قد أخرج من النار ووقف به في تلك الروضة ساعة ثم رد إلى النار فيعذب بستة أنواع من العذاب ثم يعاد إلى الروضة ساعة ثم يخرج منها إلى النار فيعذب بستة أنواع من العذاب فحصلت من علم ما يتقى به ذلك‏\n\n\nالعذاب المؤلم والنار المحرقة من ماء شربته من تلك الروضة كانت في تلك الشربة عصمتي ثم انتقلت إلى الخزانة الرابعة فرأيت على القفل الأول منها مفتاحا واحدا له ست حركات هندسية وعلى القفل الثاني ثلاثة مفاتيح تحوي الثلاثة المفاتيح على أربعمائة حركة بصنعة معلومة وعلى القفل الثالث وهو قفلان في قفل يعرف بالقفل المطبق مفتاحان‏\nيحويان على حركتين في أربع حركات ففتحت الأقفال فرأيت بقية علوم الخزانة الأولى من هذا البيت غير أن تلك العلوم التي في الخزانة الأولى من هذا البيت يتعلق إهلاكها بأعيان الصفات وهذه العلوم التي في الخزانة الرابعة يتعلق إهلاكها بأعيان الذوات الموصوفين بتلك الصفات الهالكة فحصلت علومها أيضا لأتقيها وأجتنب الأفعال التي تطلبها بالخاصية وصور العلوم فيها أيضا على قدر ما تحويه المفاتيح من الحركات وهكذا هي علوم هذا المنزل كلها عددها على عدد حركات مفاتيحها ولها تفاصيل وأحوال أضربنا عن ذكرها مخافة التطويل ثم انتقلنا إلى البيت الثاني لاطلع أيضا على ما في خزائنه وهي أربع خزائن فجئت الخزانة الأولى فإذا عليها ستة أقفال على القفل الأول مفتاح واحد يحوي على أربعين حركة ولم أر للقفل الثاني مفتاحا ففتحته بالاسم ورأيت على القفل الثالث مفتاحا واحدا يحوي على حركة واحدة وفتحت القفل الرابع بمفتاحين وجدتهما عليه يحويان على تسعمائة حركة كل حركة لا تشبه الأخرى وفتحت القفل الخامس بمفتاحين وجدتهما عليه يحويان على خمسين حركة هندسية وجئت القفل السادس فلم أر عليه مفتاحا ففتحته بالاسم وقد يظهر لبعض المكاشفين الداخلين هذا المنزل هذا القفل السادس وعليه مفتاحان يحويان على عشر حركات وعدم المفتاح أصح من وجوده لهذا القفل في حضرة الخطاب الفهواني والذي يرى له المفتاح فإنما يراه من اللوح المحفوظ فلما فتحت هذه الخزانة رأيت صور العلوم المخزونة فيها على عدد حركات المفاتيح سواء لا ينقص ولا يزيد وهي علوم الفناء عن الأمر الذي يستند إليه من لا معرفة له بربه سبحانه وتعالى فحصلت جميع ما فيها من العلوم من علوم الفناء وكأنها تدل على حصر الأمور التي يستند إليها ثم خرجت من هذه الخزانة وجئت الخزانة الثانية فرأيت عليها ثلاثة أقفال على القفل الأول مفتاح وعلى الثاني مفتاحان وعلى الثالث مفتاح تحوي هذه المفاتيح على مائة وخمس وعشرين حركة ففتحت الخزانة فإذا علوم من صور علوم لا تؤخذ إلا عنه فهي مآخذ عزيزة المثال فحصلتها كلها في لحظة واحدة ثم جئت الخزانة الثالثة فإذا عليها أربعة أقفال على القفل الأول والثالث والرابع مفتاح مفتاح تحوي هذه المفاتيح على إحدى وسبعين حركة والقفل الثاني لا مفتاح له ففتحت تلك الأقفال بالمفاتيح والاسم فإذا صور العلوم التي أضل بها السامري قَوْمَهُ وما هَدى‏ فحصلتها لأتقي شرها وأخذت بها مصرفا مرضيا عند الله لا تبعة فيه ثم جئت الخزانة الرابعة وعليها ستة أقفال على القفل الأول والثاني والرابع والخامس مفتاح مفتاح والثالث لا مفتاح له والسادس عليه مفتاحان يحوي جميع المفاتيح على ثلاثمائة وتسع وستين حركة ففتحت الأقفال بالاسم الإلهي والمفاتيح فرأيت صور العلوم التي تحويه وهي العلوم التي تنال بالكسب لا بطريق الوهب وهي العلوم المدركة بالفكر فحصلتها بطريق العمل حتى لا تبرح مكتسبة ثم إني خرجت إلى البيت الثالث فدخلته فرأيت فيه ثلاث خزائن فقصدت الخزانة الأولى فإذا عليها خمسة أقفال على القفل الثاني ثلاثة مفاتيح والقفل الخامس لا مفتاح له وبقية الأقفال عليها مفتاح مفتاح ففتحتها بالاسم والمفاتيح فرأيت فيها صور علوم الاصطلام وهي من علوم الأحوال فحصلتها من طريقها وخرجت عنها وقصدت الخزانة الثانية فرأيت عليها أربعة أقفال القفل الثاني والرابع لا مفتاح عليه والقفل الأول عليه مفتاحان يحويان على خمسين حركة والقفل الثالث عليه مفتاح يحوي على مائتي حركة ففتحتها بالاسم والمفاتيح فإذا هي تحوي على علوم الخوف والمجاهدة وأحوال الشوق والاشتياق وعلم السعير من جهنم لا علم الزمهرير وعلم ما يكون عنه نضج الجلود في جهنم إذ لا يكون عن النار ولا عن الزمهرير بل عذاب متولد بينهما من مجاورة كل واحد منهما لصاحبه فيتولد من امتزاجهما حالة ثالثة ليس هي عين واحد منهما تلك الحالة الحادثة هي العذاب الذي به ينضج الجلود في جهنم وعلم تبديلها من أي حضرة تبدل وهو مشهد عظيم فإن التبديل قد ورد النص به في الجلود والسموات والأرض ونفاه عن الخلق فقال لا تَبْدِيلَ لِخَلْقِ الله ونفاه عن القول الإلهي فقال ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وقال لا تَبْدِيلَ لِكَلِماتِ الله كل هذا تتضمنه هذه الخزانة ثم جئت الخزانة الثالثة فرأيت عليها ستة أقفال فيها شبه بأقفال الخزانة التي خرجت منها إلى هذه فالقفل الثاني لا مفتاح له والقفل الأول له مفتاحان‏\n\n\nوالقفل الثالث عليه ثلاثة مفاتيح والقفل الرابع والخامس لكل واحد منهما مفتاح والقفل السادس عليه مفتاحان تحوي هذه المفاتيح على ألف ومائة\nوسبع وثلاثين حركة ففتحتها بالاسم والمفاتيح فإذا فيها صور علوم الارتقاءات والمعارج ومعرفة اليوم الذي مِقْدارُهُ خَمْسِينَ أَلْفَ سَنَةٍ ولكن إذا كانت الارتقاءات والمعارج من المريدين لا من المرادين فتكون عن شوق ومجاهدة ورياضة ومكابدة ثم جئت إلى البيت الرابع فدخلته فإذا فيه ثلاث خزائن الخزانة الأولى عليها سبعة أقفال القفل الثاني منها لا مفتاح عليه والقفل الأول له مفتاح فيه ست حركات والقفل الثالث يحوي مفتاحه على أربعين حركة وبقية الأقفال تحوي على ستمائة حركة وست حركات فجميع حركات مفاتيحها ستمائة واثنان وأ حركة ففتحتها فإذا فيها علم النكاح وكيف يصحب الإنسان زوجته إذا كانت لا تعينه على طاعة ربه ويقف على قوله ولا تَعاوَنُوا عَلَى الْإِثْمِ والْعُدْوانِ وهل يستعين الإنسان في عبادة ربه في وضوئه بغيره من صب الماء عليه إذا توضأ فإن بعض العلماء كره ذلك وقد رأى النفيس ابن وهبان السلمي في واقعته كراهة ذلك من النبي صلى الله عليه وسلم وأخبرني به فمن هذه الخزانة يعرف ذلك ثم جئت الخزانة الثانية فرأيت عليها خمسة أقفال القفل الثاني منها مطبق والقفل الثالث لا مفتاح له والأول له مفتاح وكذلك الثاني والخامس وأما الرابع فله ثلاثة مفاتيح تحوي هذه المفاتيح على أربعمائة وثمان وسبعين حركة ففتحتها فإذا هي تناسب التي قبلها وتزيد عليها بأمور ليست فيها ثم جئت الخزانة الثالثة فإذا عليها خمسة أقفال القفل الأول لا مفتاح له والثاني والثالث والرابع ذو مفتاح مفتاح والخامس مفتاحان تحوي هذه المفاتيح على ست وأربعين حركة ففتحتها فإذا هي معرفة الحجارة التي توقد بها النار في الآخرة وكيف تكون الحجارة تقبل الوقود وهي يابسة واليابس لا يقبل الوقود في علم الطبائع وهل يجوز ما طبعه أمر ما أن يزال عنه طبعه مع بقاء عينه وذاته فإن في هذا العلم زل كثير وجهل ممن أثبت ذلك ونفاه وكلتا الطريقتين غير محمودتين ولا صحيحتين وكل واحد منهما أثبته من غير وجهه ونفاه من غير وجهه قال تعالى يا نارُ كُونِي بَرْداً وشبه هذا ثم جئت البيت الخامس فرأيت فيه ثلاث خزائن الخزانة الأولى عليها سبعة أقفال القفل الأول والثاني والثالث والرابع لكل واحد منها مفتاحان والخامس والسادس لكل واحد مفتاح والسابع لا مفتاح له تحوي هذه المفاتيح على مائة وثلاث عشرة حركة ففتحتها فإذا فيها علوم الحس والمحسوس والخيال والمتخيل والفكر وما يفكر فيه والحافظ والمحفوظ والعقل والمعقول وجميع القوي التي تدرك بها العلوم ومعرفة الجماعات والأنوار والاستشرافات ومجاري الأرواح في طرق السموات ومجاري الطبيعة في الحيوانات والنبات والجماد وما يختص به عالم الأنفاس من العلوم ويقف على نفس الرحمن الذي أتى من قبل اليمن إلى رسول الله صلى الله عليه وسلم ثم جئت الخزانة الثانية فرأيت عليها ثلاثة أقفال على الأول والثالث مفتاح مفتاح وعلى الثاني مفتاحان تحوي هذه المفاتيح على أربعين حركة ففتحتها فإذا فيها علم الأسباب العامة في الوجود والخاصة بأهل الله وأسباب النزول المضافة إلى الله التي يعتمد عليها ويوصل إلى الله من يعتمد عليها وطرد من يتركها من باب الله ومن سعادته وهي علوم شريفة زهد فيها أكثر الناس فشقي واستعملها بعض الناس فسعد وتحوي على علم الشرائع المنزلة لا علم الشريعة الحكمية ثم جئت الخزانة الثالثة فرأيت عليها خمسة أقفال القفل الأول عليه مفتاح وكذلك بقية الأقفال وتحوي أقفالها على أربعمائة وأربع وثلاثين حركة ففتحتها فإذا فيها صور علوم الالتفاف التفاف الأرواح بالأجساد والتفاف أرواح المحبين والمحبوبين والتفاف الساقين والتفاف اللام بالألف ومعنى قوله والْتَفَّتِ السَّاقُ بِالسَّاقِ والتفاف المتضايفين وهذه كلها علوم الارتباطات رب ومربوب وإله ومألوه وقادر ومقدور وعالم ومعلوم فهذه الخزانة تتضمن جميع العلوم فهذا قد ذكرنا جميع ما يحويه هذا المنزل من خزائن العلوم قال تعالى وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ غير أني تركت عند الدخول إلى هذا المنزل بيتا واحدا في دهليز هذا المنزل لا يفتح لكل أحد وقد فتح لي ودخلته وعرفت ما فيه‏\n\n\nوهو يتضمن ويخزن فيه جميع مفاتيح الخزائن كلها التي تتضمنها هذه المنازل التي في هذا الكتاب وهو يحوي على أمور جليلة وللعارف به تحقق في إيجاد الكائنات عنه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وقد نبهنا على بعض ما في هذا المنزل من العلوم‏\n\n",
    "en": "## Chapter Two Hundred and Seventy-Three: Concerning the Knowledge of the Station of the Destruction of Caprice and the Soul from the Musawi Station\n\nThe destruction of creation is in the wind,\nWhen it blows upon the Tablet (اللوح).\nAnd he seeks refuge in other than his Master,\nThe God of the body and the spirit.\nAnd he made a smooth path rugged,\nBy what came concerning Noah (نوح).\nAnd concerning Lot (لوط), O my soul,\nWail over what I have said!\nAnd were it not for love, it would have led him,\nWith a flash of light that inspires.\n\n### [That the Celestial Spheres have Stations that Run Until a Specified Term]\n\nKnow that when God Almighty created the celestial spheres (الأفلاك) and populated them with angels (الأملاك), and decreed for the seven wandering stars (الكواكب السبعة السيارة) within them stations (منازل) in which they run until a specified term (أجل مسمى), time was determined by their running and swimming. He created the state of being established (المكانة) before the places (الأمكنة), and extended from it subtle realities (رقائق) to specific places in the seven heavens and the earth. Then He brought into existence the established beings (المتمكنات) in their places according to their state of being established.\n\nIt was part of the decree of God, the All-Mighty, the All-Knowing, that He created a specific Intellect (عقلا) among the Intellects, making it a sign by virtue of the Attribute of Power (صفة القدرة) He deposited within it, and not by any other attribute. He distinguished it thus above its peers. This stems from the Name, the Manifest (الظاهر), which is specific to this Intellect. He cast this knowledge upon it through a form of overwhelming force (القهر) that instilled in it affection, coolness, tranquility, and joy. Thereupon, five rivers of Knowledge (العلم) burst forth within it, originating from the Name, the First (الأول) and the Last (الآخر), which is also specific to this Intellect.\n\nThese rivers then flowed into the Name, the Inner (الباطن), which belongs to it. Thus, its priority was sanctified above all other priorities, and its posteriority above all other posteriorities, as were its Manifestation and its Inner Reality. From the Mother of the Book (أم الكتاب) that is with Him, there issued forth a Divine Presence (حضرة) called the Mother of Gathering (أم الجمع). The Real (الحق) admitted me into it, and I saw it, observing its manifest and inner aspects. I witnessed the place of this Intellect within it: a hidden, pure black spot (نكتة سوداء), situated between redness and yellowness. I also witnessed the subtle reality (الرقيقة) between the state of being established and this specific place. I saw Moses, Aaron, and Joseph (peace be upon them) looking toward this Intellect.\n\nFrom this comprehensive Presence (الحضرة الجامعة) which He singled out for Himself, God branched off Presences (حضرات) whose number none knows save God, in the heavens and the earth, and what is between them, and beneath the moist earth (الثرى) up to the limit of equilibrium (الاستواء). All these Presences are regarded by the Real with a special gaze, thereby elevating them above others. Therefore, they possess sanctity (حرمة) and are seen as noble by those whom the Real has granted knowledge of them. These Presences are called the Stations of Transcendence (مقامات التنزيه). When the higher spiritual beings (الروحانيات العلى) enter them, they acquire states of Divine Transcendence (التنزيه الإلهي) whose measure none knows save God. They attain a degree of submission (الخضوع), reverence (الخشوع), humility (الذلة), and destitution (الافتقار) that they did not possess before entering. It is from these Presences and in these Stations that they achieve the vision of the Face of the Real (وجه الحق) in everything, completely and perfectly.\n\nHowever, among men, there are those who witness them, and among men, there are those who are granted this state (الحال) but do not recognize it, nor do they know in which degree (رتبة) it was attained, according to what God's prior knowledge determined for them. They are of various kinds. Let us return to that Intellect we mentioned, which has an effect of receptivity (أثر انفعال) due to its established state in this Station (المنزل). We shall mention what belonged to it, what issued from it, and what resulted from it, specific to this Station, according to everyone who witnessed it. God singled out the Station of Truthfulness and Purity (مقام الصدق والصفاء) and designated within it seventy-two steps (مرقاة).\n\nEach step grants sciences (علوما) to whoever ascends it, due to the purity (الصفاء) necessitated by this form. These are sciences of Unveiling (علوم كشف) until one reaches its summit, where the Mother Presence (حضرة الأم) meets him in its Essence (بذاتها), granting him Divine Transcendence, praise of Unity (الوحدانية), Truthfulness, Overwhelming Force (القهر), Victory (النصر), Sincerity (الإخلاص), and Humility. When God admitted me to these steps, I saw that He had veiled them from sight by the darkness of Nature (ظلمة الطبيعة)—an unliftable veil. Thus, today, no one ascending them has a firm footing. Rather, one is unveiled to them from behind the darkness of Nature, but does not attain a footing within them. This is how I saw it, and I saw with me a large group of the realities of the Gnostics (حقائق العارفين) at different levels, high and higher, and they were in this same condition.\n\nThis Intellect, specific to this Station, was commanded to ascend what He had singled out, as we mentioned. The Intellects gathered around it, and I watched what it would do and say, so that I might benefit from it. Then I saw it ascend, but it did not speak. I do not know if it ascended by a Divine command. When it returned, I saw upon it traces of sadness, overwhelming force, and agitation. I knew that it was in a station of warning (مقام انذار) from the warnings of the Real (الحق) to the spirits. It is related in a tradition that Gabriel and Michael (peace be upon them) sat weeping. God revealed to them, \"What is this weeping?\" They replied, \"We do not feel safe from Your cunning.\" God revealed to them, \"So be it.\" When it cast upon us what it cast upon the Intellect, with reverence and humility, it happened that I looked to the left and saw Caprice (الهوى) and Desire (الشهوة) whispering to each other. God had granted this Caprice a penetrating power (القوة النافذة) by which it prevails over most Intellects, unless God Almighty grants protection.\n\nCaprice stood in that position and declared, \"I am the worshipped god (الإله المعبود) among every existent thing.\" It turned away from the Intellect and the transmitted knowledge (النقل) it brought. The devils and Desire followed it until it reached the center of the Fire (بحبوحة النار). A bed of tar was spread for it, and it relied upon something it imagined would save it from God's punishment. But God intervened between it and that upon which it relied and leaned, so it perished, while those who followed it perished with the bliss of the fortunate. It was a noble, terrifying, and frightening vision, from which neither I nor any Gnostic (عارف) present with us that day truly believed we had escaped.\n\nThen I desired to encompass the levels (المراتب), realities (الحقائق), secrets (الأسرار), and sciences (العلوم) contained within this Station. That Intellect, the master of this Station and through whom this Station became manifest, took my hand and said to me, \"This is the Station of Destruction (منزل الهلاك) and the place of destruction.\"\n\nI saw within it five houses (بيوت). In the first house, there were four treasuries (خزائن). The first treasury had three locks, the second likewise, the third six locks, and the fourth three locks. I wanted to open them, but he said to me, \"Proceed until you see what is in every house of treasuries, and after that, you may open their locks and know what they contain.\" Then he took my hand, and we went out to the second house. I entered it and saw four treasuries within it. The first treasury had six locks, the second three locks, the third four locks, and the fourth six locks. Then he took my hand, and we left that house and entered the third house. I saw three treasuries within it. The first treasury had five locks, the second four locks, and the third six locks. Then he took my hand, and we left that house—all of this entering through one door and exiting through another. I entered the fourth house, and behold, it contained three treasuries. The first treasury had seven locks, the second five locks, and the third five locks. Then he took my hand, and we left it and entered the fifth house. I saw three treasuries within it. The first treasury had seven locks, the second three locks, and the third five locks. Then he took my hand, and we went out, seeking the first house so that we might open those locks and see the deposits (الودائع) those treasuries contained.\n\nI entered the first house to the first treasury. I saw its key hanging on every lock, and some locks had two or three keys. I saw on the first lock three keys, and these keys contained four hundred movements (حركة). I reached out my hand and opened that lock. Then I saw on the third lock likewise three keys, containing four hundred movements, so I opened the third. I returned to the second, which had two keys. It was a double lock (قفل مطبق), meaning two locks in one, containing four movements in two actions. When I opened the locks and looked into the treasuries, the forms of the sciences (صور العلوم) appeared to me, corresponding exactly to the movements of the keys of that treasury—neither increasing nor decreasing.\n\nI saw destructive sciences (علوما مهلكة); no one engaged in them without perishing. These were sciences of the Intellect specific to the masters of speculation (أرباب الأفكار) among the philosophers (الحكماء) and theologians (المتكلمين). I saw some that lead their possessor to eternal destruction, and some that lead their possessor to destruction, after which he is saved, yet the light of the Law (الشرع) has absolutely no effect in them, having deprived their possessor of felicity therein. Much of this consisted of the sciences of the Brahmins (البراهمة), the sciences of magic (السحر), and other such things. I acquired all the sciences within it so that we might avoid them. They are secrets that cannot be revealed and are called the Sciences of the Secret (علوم السر). Among the Companions (رضي الله عنهم) who were specialized in them was Hudhayfa ibn al-Yaman, whom the Messenger of God (peace and blessings be upon him) singled out for them. For this reason, he was known among the Companions as the Master of the Science of the Secret, and by it, he recognized the people of hypocrisy (أهل النفاق). Even Umar ibn al-Khattab (رضي الله عنه) once swore him by God, asking if there was anything of that in him. He replied, \"No, and I will not tell anyone after you.\" Umar ibn al-Khattab would not pray over a funeral in the presence of Hudhayfa until he saw Hudhayfa approve of the prayer; if Hudhayfa prayed, Umar prayed, otherwise not. Whoever knows these sciences in order to beware of them is fortunate, and whoever knows them, believes in them, and acts upon them is wretched.\n\nWhen I acquired them and encompassed them with knowledge, and purified myself—by the Divine Providence (العناية الإلهية) with which God protected me—from acting upon them and being characterized by their effect, I thanked God for that. In these stations, many travelers (سالكين) of this Path perished because they see sciences that the souls (النفوس) fall in love with, and by which they become lords and spiritual masters (أشياخا). Since souls seek superiority and leadership (الرئاسة) over their peers, they bring these sciences forth and use them in the world of dominion (عالم الملك), thereby going astray and leading others astray: <<أَضَلُّوا كَثِيراً وَضَلُّوا عَنْ سَواءِ السَّبِيلِ>> (They led many astray and strayed from the level path).\n\nThen I moved to the second treasury. I saw keys on two of its locks, but the third lock had no key. I saw on the first lock three keys containing ten movements, so I opened it. Then I came to the second lock and found one key on it containing four movements, so I took it and opened the lock with it. Then I came to the third lock and saw no key on it. I was perplexed and did not know what to do. It was said to me, \"Recite over every lock that has no key: <<إِنَّ رَبَّكَ هُوَ الْفَتَّاحُ الْعَلِيمُ>> (Indeed, your Lord is the Opener, the All-Knowing).\" Then it was said to me, \"The key to this lock is from the keys of the Unseen (مفاتيح الغيب); none knows them save Him.\" I said that, and the lock opened, and the treasury opened.\n\nI saw the forms of the sciences corresponding to the number of the keys' movements, and I saw the form of an additional science (علم زائد) beyond the forms that appeared according to the number of the keys' movements. I asked, \"What is this science?\" He replied, \"The Science that Pervades (العلم الساري) the known things (المعلومات) and the sciences. All sciences are known by this Science, not by themselves.\" I understood that when Abu al-Ma'ali al-Juwayni said that knowledge knows knowledge just as it knows other known things, he meant that the knowledge by which knowledge itself is known is a known thing. But the matter is not as he claimed. Rather, knowledge is known by this Pervading Science, so the sciences are known by it, while it is not known. Know this! This is what Unveiling (الكشف) granted him: the unveiling of meanings (كشف المعاني), not the unveiling of forms (كشف الصور).\n\nThe sciences I saw in this second treasury are the sciences of Power (القدرة) and Capability (الاقتدار), and the sciences by which things come into being and by which the entities (الأعيان) attributed to the existents (الأكوان) appear. These are the entities of acts (أعيان أفعال) attributed to the servants. This Station judges them to destruction (هلاك) because of the Pervading Science that accompanied them. This destruction is one of attribution and relation (إضافة ونسبة), not destruction of the entity (هلاك عين). What is destroyed is only the attribution of these acts to the servants. This Station grants the understanding that this attribution is not correct, and this is the very essence of its destruction. The Pervading Science informed him that these are the Acts of God. Thus, the entities of the servants' acts are innocent of destruction. From this movement, I acquired the sciences of Formation (علوم التكوين) and the secret of His saying, \"Be!\" (كُنْ), which pervades every formed thing.\n\nThen I moved to the third treasury, which had six locks, with their keys on the locks. On the first lock was one key containing one movement. On the second, two keys containing two movements. On the third, two keys containing ten movements. On the fourth, one key containing thirty movements. On the fifth, one key containing five movements. On the sixth, two keys containing two movements. I took the keys and opened the locks. When the treasury opened, I saw Hell (جهنم) crushing itself against itself, and in its center, a green garden (روضة خضراء). I saw a man who had been taken out of the Fire and stood in that garden for an hour, then returned to the Fire to be tormented by six types of punishment. Then he was returned to the garden for an hour, then taken out of it back to the Fire to be tormented by six types of punishment. I acquired the knowledge of what protects one from that painful torment and the burning Fire from water I drank from that garden; in that drink was my protection (عصمتي).\n\nThen I moved to the fourth treasury. I saw on its first lock one key with six geometrical movements (حركات هندسية). On the second lock, three keys, and these three keys contained four hundred movements by a known craft. On the third lock, which was two locks in one, known as the double lock (القفل المطبق), there were two keys containing two movements in four actions. I opened the locks and saw the remainder of the sciences of the first treasury of this house. However, the destruction of the sciences in the first treasury of this house relates to the entities of the Attributes (أعيان الصفات), while the destruction of these sciences in the fourth treasury relates to the entities of the Essences (أعيان الذوات) described by those destructive Attributes. I acquired their sciences also, so that I might guard against them and avoid the acts that they specifically demand. The forms of the sciences therein also corresponded to the movements contained in the keys. Thus are all the sciences of this Station: their number corresponds to the number of the movements of their keys. They have details and states that we have omitted mentioning for fear of prolixity.\n\nThen we moved to the second house, also to examine what was in its four treasuries. I came to the first treasury, and behold, it had six locks. On the first lock was one key containing forty movements. I did not see a key for the second lock, so I opened it with the Name (الاسم). I saw on the third lock one key containing one movement. I opened the fourth lock with two keys I found on it, containing nine hundred movements, each movement unlike the others. I opened the fifth lock with two keys I found on it, containing fifty geometrical movements. I came to the sixth lock and saw no key on it, so I opened it with the Name. It may appear to some of the unveiled ones (المكاشفين) entering this Station that this sixth lock has two keys containing ten movements, but the absence of the key is more correct than its presence for this lock in the Presence of the Intuitive Discourse (حضرة الخطاب الفهواني). As for the one who sees the key for it, he only sees it from the Preserved Tablet (اللوح المحفوظ).\n\nWhen I opened this treasury, I saw the forms of the sciences stored within it, exactly corresponding to the number of the keys' movements, neither decreasing nor increasing. These are the sciences of Annihilation (علوم الفناء) from the matter upon which one who lacks gnosis (معرفة) of his Lord relies. I acquired all the sciences within it, which are the sciences of Annihilation, and they seemed to indicate the enumeration of the matters relied upon. Then I left this treasury and came to the second treasury. I saw three locks on it: one key on the first lock, two keys on the second, and one key on the third. These keys contained one hundred and twenty-five movements. I opened the treasury, and behold, there were sciences in the form of sciences that can only be taken from Him. They are sources (مآخذ) rare in example. I acquired all of them in a single moment.\n\nThen I came to the third treasury, and behold, it had four locks. The first, third, and fourth locks each had one key. These keys contained seventy-one movements. The second lock had no key. I opened those locks with the keys and the Name. Behold, there were the forms of the sciences by which the Samiri led his people astray, and he did not guide them. I acquired them to guard against their evil and took them as a means of expenditure (مصرفا) pleasing to God, free from consequence. Then I came to the fourth treasury, which had six locks. The first, second, fourth, and fifth locks each had one key. The third had no key, and the sixth had two keys. All the keys contained three hundred and sixty-nine movements. I opened the locks with the Divine Name (الاسم الإلهي) and the keys. I saw the forms of the sciences it contained, which are the sciences attained through acquisition (الكسب), not through the path of gift (الوهب). These are the sciences grasped by reflection (الفكر). I acquired them through the path of action, so that they would remain acquired.\n\nThen I went out to the third house and entered it. I saw three treasuries within it. I proceeded to the first treasury, and behold, it had five locks. The second lock had three keys, and the fifth lock had no key. The rest of the locks each had one key. I opened them with the Name and the keys. I saw within it the forms of the sciences of Rapture (علوم الاصطلام), which are among the sciences of the spiritual states (الأحوال). I acquired them through their proper path and left it. I proceeded to the second treasury and saw four locks on it. The second and fourth locks had no key. The first lock had two keys containing fifty movements, and the third lock had one key containing two hundred movements. I opened them with the Name and the keys. Behold, it contained the sciences of Fear (الخوف) and Spiritual Struggle (المجاهدة), the states of longing (الشوق) and yearning (الاشتياق), and the science of the blazing fire (السعير) of Hell, not the science of the extreme cold (الزمهرير). It also contained the science of what causes the scorching of skins (نضج الجلود) in Hell, for it does not result from the Fire nor from the extreme cold, but rather a torment generated between them from the proximity of each to the other. From their mixture, a third state is generated, which is not the essence of either of them. That generated state is the torment by which the skins are scorched in Hell. It also contained the science of their replacement (تبديلها), and from which Presence (حضرة) they are replaced. This is a tremendous witnessing, for replacement has been explicitly mentioned concerning skins, the heavens, and the earth, yet He negated it concerning creation, saying: <<لَا تَبْدِيلَ لِخَلْقِ اللَّهِ>> (There is no change in the creation of Allah), and He negated it concerning the Divine Word, saying: <<مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The word is not changed with Me), and He said: <<لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ>> (There is no change in the words of Allah). All of this is contained within this treasury.\n\nThen I came to the third treasury and saw six locks on it, resembling the locks of the treasury I had left to come here. The second lock had no key. The first lock had two keys. The third lock had three keys. The fourth and fifth locks each had one key. The sixth lock had two keys. These keys contained one thousand, one hundred, and thirty-seven movements. I opened them with the Name and the keys. Behold, within it were the forms of the sciences of Ascensions (الارتقاءات) and Heavenly Ladders (المعارج), and the knowledge of the Day whose measure is fifty thousand years (مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ). However, if the ascensions and heavenly ladders are for the seekers (المريدين) and not the sought ones (المرادين), they result from longing, spiritual struggle, discipline (رياضة), and endurance (مكابدة).\n\nThen I came to the fourth house and entered it. Behold, it contained three treasuries. The first treasury had seven locks. The second lock had no key. The first lock had a key containing six movements. The third lock's key contained forty movements. The remaining locks contained six hundred and six movements. Thus, the total movements of its keys were six hundred and forty-two movements. I opened it, and behold, within it was the science of marriage (علم النكاح) and how a person should accompany his wife if she does not assist him in obeying his Lord, and how to stand by His saying: <<وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ>> (And do not cooperate in sin and aggression). It also contained the question of whether a person may seek help from others in his worship of his Lord during his ablution (وضوء), such as having water poured upon him when performing ablution, for some scholars disliked this. Al-Nafis ibn Wahban al-Sulami saw the Prophet (peace and blessings be upon him) disliking this in his spiritual vision (واقعته) and informed me of it. This knowledge is known from this treasury.\n\nThen I came to the second treasury and saw five locks on it. The second lock was a double lock, and the third lock had no key. The first, second, and fifth locks each had one key. As for the fourth, it had three keys. These keys contained four hundred and seventy-eight movements. I opened it, and behold, it corresponded to the one before it but added matters that were not in it. Then I came to the third treasury, and behold, it had five locks. The first lock had no key. The second, third, and fourth locks each had one key, and the fifth had two keys. These keys contained forty-six movements. I opened it, and behold, it contained the knowledge of the stones (الحجارة) with which the Fire is kindled in the Hereafter, and how stones can accept kindling while being dry, given that dry matter does not accept kindling according to the science of natures (علم الطبائع). It also contained the question of whether it is permissible for something whose nature is fixed to have its nature removed while its entity (عينه) and essence (ذاته) remain. In this science, many have stumbled and erred, both those who affirmed this and those who negated it. Neither approach is praiseworthy or correct, for each affirmed it from an incorrect perspective or negated it from an incorrect perspective. God Almighty said: <<يَا نَارُ كُونِي بَرْدًا>> (O Fire, be coolness), and similar matters.\n\nThen I came to the fifth house and saw three treasuries within it. The first treasury had seven locks. The first, second, third, and fourth locks each had two keys. The fifth and sixth locks each had one key. The seventh had no key. These keys contained one hundred and thirteen movements. I opened it, and behold, within it were the sciences of Sensation (الحس) and the Sensible (المحسوس), Imagination (الخيال) and the Imagined (المتخيل), Intellection (الفكر) and the Object of Intellection, the Preserver (الحافظ) and the Preserved (المحفوظ), the Intellect (العقل) and the Intelligible (المعقول), and all the faculties (القوي) by which sciences are perceived. It also contained the knowledge of gatherings (الجماعات), lights (الأنوار), spiritual outlooks (الاستشرافات), the courses of the spirits (الأرواح) in the paths of the heavens, the courses of Nature (الطبيعة) in animals, plants, and minerals, and the sciences specific to the world of Breaths (عالم الأنفاس). It establishes the Breath of the All-Merciful (نفس الرحمن) that came from the direction of Yemen to the Messenger of God (peace and blessings be upon him).\n\nThen I came to the second treasury and saw three locks on it. The first and third locks each had one key, and the second had two keys. These keys contained forty movements. I opened it, and behold, within it was the science of the general causes (الأسباب العامة) in Existence (الوجود) and those specific to the People of God (أهل الله), and the causes of descent (أسباب النزول) attributed to God, upon which one relies and which lead to God whoever relies upon them, and which expel from the door of God and from felicity whoever abandons them. These are noble sciences that most people disregarded, thus becoming wretched, while some people utilized them, thus becoming fortunate. It contains the science of the Revealed Laws (الشرائع المنزلة), not the science of the Judicial Law (الشريعة الحكمية).\n\nThen I came to the third treasury and saw five locks on it. The first lock had a key, and likewise the rest of the locks. Its locks contained four hundred and thirty-four movements. I opened it, and behold, within it were the forms of the sciences of Envelopment (علوم الالتفاف): the envelopment of spirits (الأرواح) with bodies, the envelopment of the spirits of lovers and beloveds, the envelopment of the two shins, the envelopment of the *Lam* with the *Alif*, and the meaning of His saying: <<وَالْتَفَّتِ السَّاقُ بِالسَّاقِ>> (And the shin is wrapped around the shin), and the envelopment of correlatives (المتضايفين). All of these are the sciences of connections (الارتباطات): Lord and lorded, God and worshipped, Powerful and empowered, Knower and known. This treasury encompasses all the sciences.\n\nThus, we have mentioned all that this Station contains of the treasuries of sciences. God Almighty said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ>> (And there is not a thing but that with Us are its treasuries, and We do not send it down except in a known measure). However, upon entering this Station, I bypassed one house in the vestibule (دهليز) of this Station that is not opened for everyone. It was opened for me, and I entered it and knew what was in it. It contains and stores all the keys to all the treasuries encompassed by these Stations mentioned in this book. It contains momentous matters, and the Gnostic (العارف) who knows it achieves realization in bringing existents into being through it. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way). We have hereby drawn attention to some of the sciences in this Station.",
    "ur": "باب نمبر دو سو تہتر: مقام موسوی سے ہویٰ (خواہش نفسانی) اور نفس کی ہلاکت کی منزل کی معرفت میں\n\nمخلوق کی ہلاکت ہوا میں ہے،\nجب وہ لوح (لوح محفوظ) میں چلتی ہے۔\nاور وہ اپنے مولیٰ کے علاوہ کسی اور کی پناہ لے،\nجو جسم اور روح کا معبود ہے۔\nاور اس نے ایک آسان راستے کو دشوار بنا دیا،\nاس کے سبب جو نوح (علیہ السلام) کے بارے میں آیا۔\nاور لوط (علیہ السلام) کے بارے میں، اے میرے نفس!\nجو میں نے کہا ہے اس پر نوحہ کر۔\nاور اگر عشق نہ ہوتا تو اسے ہدایت ملتی،\nوحی کے نور کی چمک سے۔\n\n### [کہ افلاک (آسمانی کرّوں) کے لیے منازل ہیں جو ایک مقررہ مدت تک چلتی ہیں]\n\nجان لو کہ جب اللہ تعالیٰ نے افلاک (آفلاک) کو پیدا کیا اور انہیں فرشتوں (املاک) سے آباد کیا، اور ان میں سات سیاروں کے لیے منازل مقرر کیں جو ایک مقررہ مدت (أجل مسمى) تک چلتی ہیں، تو ان کے چلنے اور تیرنے سے وقت (زمان) متعین ہوا۔ اور اس نے مکانات (جگہوں) سے پہلے مکانت (مرتبہ) کو پیدا کیا اور اس سے ساتوں آسمانوں اور زمین میں مخصوص جگہوں تک لطیف پردے (رقائق) پھیلائے۔ پھر اس نے متمکنات (موجودات) کو ان کی جگہوں میں ان کی مکانت (مرتبے) کے مطابق وجود بخشا۔ اور یہ اللہ عزیز و علیم کی تقدیر میں سے تھا کہ اس نے عقول میں سے ایک عقل کو پیدا کیا، جو ان صفات کی علامت ہے جو اس میں صفت قدرت (صفة القدرة) کے طور پر ودیعت کی گئی ہیں، نہ کہ کسی اور صفت کے طور پر۔ اس نے اسے اس کے ہم جنسوں پر اس خصوصیت سے نوازا، اور یہ اس اسم ظاہر (الاسم الظاهر) کی وجہ سے ہے جو اس عقل کے ساتھ خاص ہے۔ پس اس نے ایک قسم کے قہر (غلبہ) کے ذریعے یہ علم اس پر القا کیا، جس میں محبت، ٹھنڈک، سکون اور خوشی سرایت کر گئی، تو اس میں علم کے پانچ دریا پھوٹ پڑے، جو اسم اول و آخر (الاسم الأول والآخر) سے ہیں جو اس عقل کے ساتھ خاص ہیں۔ پھر یہ دریا اس اسم باطن (الاسم الباطن) میں بہہ نکلے جو اس کے لیے ہے، پس اس کی اولیت تمام اولیات پر اور اس کی آخریت تمام آخریتوں پر پاکیزہ ہو گئی، اور اسی طرح اس کا ظاہر اور باطن بھی۔ اور یہ (علم) ام الکتاب (أم الكتاب) سے صادر ہوا جو اس کے پاس ہے، ایک حضور (حضرة) جسے ام الجمع (أم الجمع) کہا جاتا ہے۔ ذات حق (الحق) نے مجھے اس میں داخل کیا، تو میں نے اسے دیکھا اور اس کے ظاہر اور باطن کو دیکھا، اور میں نے اس عقل کی جگہ کو اس میں ایک سیاہ نقطہ (نكتة سوداء) کے طور پر دیکھا جو پوشیدہ، پاکیزہ، سرخی اور زردی کے درمیان تھا۔ اور میں نے اس لطیف پردے (رقیقہ) کا مشاہدہ کیا جو مکانت (مرتبے) اور اس معین جگہ کے درمیان ہے۔ اور میں نے موسیٰ، ہارون، اور یوسف علیہم السلام کو اس عقل کی طرف دیکھتے ہوئے دیکھا۔ اور اللہ سبحانہ نے اس جامع حضور (حضرة) سے، جسے اس نے اپنے لیے خاص کیا ہے، ایسے حضور (حضرات) کو شاخ در شاخ کیا جن کی تعداد آسمان اور زمین میں اور ان کے درمیان اور زمین کی تہہ کے نیچے حد استواء تک صرف اللہ ہی جانتا ہے۔ ان تمام حضرات پر ذات حق (الحق) کی خاص نظر ہے، جس کے ذریعے اس نے انہیں دوسروں پر بلند کیا ہے۔ پس جو شخص انہیں جانتا ہے، ان کے نزدیک ان کا احترام ہے، اور وہ انہیں مقامات تنزیہ (مقامات التنزيه) کہتے ہیں۔ جب اعلیٰ روحانیات (الروحانيات العلى) ان میں داخل ہوتی ہیں، تو وہ الٰہی تنزیہ (التنزيه الإلهي) کے ایسے احوال حاصل کرتی ہیں جن کی قدر صرف اللہ ہی جانتا ہے، اور انہیں ایسی عاجزی، خشوع، ذلت اور فقر حاصل ہوتا ہے جو انہیں داخل ہونے سے پہلے حاصل نہیں تھا۔ اور انہی حضرات میں اور انہی مقامات میں انہیں ہر چیز میں ذات حق (الحق) کے چہرے کا کامل اور مکمل دیدار حاصل ہوتا ہے۔ لیکن بعض مردانِ حق ایسے ہیں جو ان کا مشاہدہ کرتے ہیں، اور بعض ایسے ہیں جنہیں یہ حال عطا کیا جاتا ہے لیکن وہ اسے نہیں پہچانتے اور نہ ہی جانتے ہیں کہ یہ انہیں کس مرتبے میں حاصل ہوا ہے، اس علم الٰہی کے مطابق جو ان کے بارے میں پہلے سے موجود تھا۔ پس ان میں سے بعض ایسے ہیں اور بعض ویسے ہیں۔ اب ہم اس عقل کی طرف لوٹتے ہیں جس کا ذکر ہم نے کیا، جس کا اس منزل میں اپنی مکانت (مرتبے) کے سبب اثر انفعال ہے، اور ہم اس کا ذکر کرتے ہیں جو اس کے لیے تھا اور جو اس سے اور اس کے سبب سے ہوا، جو اس منزل کے ساتھ خاص ہے ہر اس شخص کے نزدیک جس نے اس کا مشاہدہ کیا۔ اور اللہ سبحانہ نے مقام صدق اور صفاء کو مشخص کیا اور اس میں بہتر (۷۲) سیڑھیاں (مرقاة) مقرر کیں، ان میں سے ہر سیڑھی اس شخص کو علوم عطا کرتی ہے جو اس صفاء کے لیے اس پر چڑھتا ہے جو اس صورت کا لازمی نتیجہ ہے۔ یہ علوم کشف (علوم کشف) ہیں یہاں تک کہ وہ اس کی چوٹی تک پہنچ جاتا ہے، تو ام (اصل) کا حضور (حضرة الأم) بذات خود اس کے سامنے آتا ہے، اور اسے الٰہی تنزیہ (التنزيه الإلهي)، وحدانیت کی تعریف، سچائی، قہر، نصرت، اخلاص اور ذلت عطا کرتا ہے۔ اور جب اللہ نے مجھے ان سیڑھیوں میں داخل کیا، تو میں نے دیکھا کہ اللہ سبحانہ نے انہیں طبیعت کی تاریکی سے ایک ایسے پردے میں چھپا دیا ہے جو اٹھایا نہیں جا سکتا۔ لہٰذا آج کسی چڑھنے والے کا قدم اس پر نہیں رکھا جا سکتا، لیکن اسے طبع کی تاریکی کے پیچھے سے کشف (مکاشفہ) کیا جاتا ہے، اور اسے اس میں قدم حاصل نہیں ہوتا۔ میں نے اسے اسی طرح دیکھا، اور میں نے اپنے ساتھ عارفین کی حقیقتوں (حقائق العارفين) کا ایک بڑا گروہ دیکھا جو مختلف مراتب پر تھے، کچھ بلند اور کچھ بلند تر، اور وہ اس مقام پر اسی طرح تھے۔ پھر اس عقل کو جو اس منزل کے ساتھ مخصوص ہے، حکم دیا گیا کہ وہ اس میں چڑھے جسے ہم نے مشخص کیا ہے۔ اور عقول اس کے پاس جمع ہو گئیں، اور میں دیکھ رہا تھا کہ وہ کیا کرتا ہے اور کیا کہتا ہے تاکہ میں اس سے فائدہ اٹھاؤں۔ پھر میں نے اسے دیکھا کہ وہ مشخص ہوا لیکن اس نے بات نہیں کی، اور میں نہیں جانتا کہ کیا وہ الٰہی حکم سے مشخص ہوا تھا۔ جب وہ واپس آیا تو میں نے اس پر غم، قہر اور پریشانی کا اثر دیکھا۔ تو میں نے جان لیا کہ وہ ان الٰہی انذارات (تنبیہات) کے مقام انذار میں ہے جو ارواح کے لیے ہیں۔ ایک روایت میں آیا ہے کہ جبرائیل اور میکائیل علیہما السلام بیٹھ کر رو رہے تھے، تو اللہ نے ان کی طرف وحی کی کہ یہ رونا کیسا ہے؟ انہوں نے کہا: ہم آپ کے مکر سے بے خوف نہیں ہیں۔ تو اللہ نے ان کی طرف وحی کی: تمہیں ایسا ہی ہونا چاہیے۔ پس جب اس نے ہم پر وہ القا کیا جو اس پر خشوع اور ذلت کے ساتھ القا کیا گیا تھا، تو اتفاق سے میں نے بائیں طرف جھانکا، تو میں نے ہویٰ (الہویٰ - خواہش نفسانی) اور شہوت (الشهوة) کو دیکھا، وہ دونوں سرگوشیاں کر رہے تھے۔ اور اللہ نے اس ہویٰ کو ایسی نافذ قوت عطا کی ہے کہ وہ اکثر عقول پر غالب آ جاتا ہے، مگر یہ کہ اللہ تعالیٰ خود ہی بچا لے۔ پس ہویٰ اس مقام پر کھڑا ہوا اور کہا: میں ہر موجود کے نزدیک معبود ہوں۔ اور اس نے عقل اور اس کے لائے ہوئے نقل (وحی) سے منہ موڑ لیا۔ تو شیاطین اور شہوت اس کے پیچھے ہو لیے یہاں تک کہ وہ آگ کے بیچوں بیچ پہنچ گیا، تو اس کے لیے تارکول کا بستر بچھایا گیا، اور اس نے ایک ایسی چیز پر بھروسہ کیا جس کے بارے میں اس نے گمان کیا کہ وہ اسے اللہ کے عذاب سے بچا لے گی، تو اللہ نے اس کے اور جس پر اس نے بھروسہ کیا تھا اس کے درمیان رکاوٹ ڈال دی، پس وہ ہلاک ہو گیا اور جو اس کے پیچھے چلے وہ نیک بختوں کی نعمت میں ہلاک ہوئے۔ یہ ایک عظیم، خوفناک اور ڈرا دینے والا مشاہدہ تھا، ہم نے اور ہر اس عارف نے جو اس دن ہمارے ساتھ حاضر تھا، اس سے نجات پانے کی تصدیق نہیں کی۔ پھر میں نے ارادہ کیا کہ میں اس منزل میں موجود مراتب، حقائق، اسرار اور علوم کا احاطہ کروں، تو اس منزل کے مالک، اس عقل نے میرا ہاتھ پکڑا، اور اسی کے سبب یہ منزل ظاہر ہوئی، اور اس نے مجھ سے کہا: یہ ہلاکت کی منزل اور ہلاکت کا مقام ہے۔ میں نے اس میں پانچ گھر (بیوت) دیکھے۔ پہلے گھر میں چار خزانے تھے، پہلے خزانے پر تین تالے تھے، دوسرے پر بھی اتنے ہی، تیسرے پر چھ تالے، اور چوتھے پر تین تالے۔ میں نے انہیں کھولنا چاہا، تو اس نے مجھ سے کہا: چلتے رہو یہاں تک کہ تم ہر گھر میں موجود خزانوں کو دیکھ لو، اور اس کے بعد تم ان کے تالے کھولو گے اور جانو گے کہ ان میں کیا ہے۔ پھر اس نے میرا ہاتھ پکڑا اور ہم اٹھے اور دوسرے گھر کی طرف نکلے، تو میں اس میں داخل ہوا اور اس میں چار خزانے دیکھے۔ پہلے خزانے پر چھ تالے، دوسرے خزانے پر تین تالے، تیسرے خزانے پر چار تالے، اور چوتھے خزانے پر چھ تالے۔ پھر اس نے میرا ہاتھ پکڑا اور ہم اس گھر سے نکلے، تو میں تیسرے گھر میں داخل ہوا، اور اس میں تین خزانے دیکھے۔ پہلے خزانے پر پانچ تالے، دوسرے خزانے پر چار تالے، اور تیسرے خزانے پر چھ تالے۔ پھر اس نے میرا ہاتھ پکڑا اور ہم اس گھر سے نکلے، اور یہ سب کچھ ایک دروازے سے داخل ہونا اور دوسرے دروازے سے نکلنا تھا۔ تو میں چوتھے گھر میں داخل ہوا، اور اس میں تین خزانے تھے، پہلے خزانے پر سات تالے، دوسرے خزانے پر پانچ تالے، اور تیسرے پر پانچ تالے۔ پھر اس نے میرا ہاتھ پکڑا اور ہم وہاں سے نکلے، تو میں پانچویں گھر میں داخل ہوا، اور اس میں تین خزانے دیکھے۔ پہلے خزانے پر سات تالے، دوسرے خزانے پر تین تالے، اور تیسرے خزانے پر پانچ تالے۔ پھر اس نے میرا ہاتھ پکڑا اور ہم نکلے، اور ہم پہلے گھر کی تلاش میں نکلے تاکہ ان تالوں کو کھولیں اور دیکھیں کہ ان خزانوں میں کیا امانتیں ہیں۔\n\nمیں پہلے گھر میں داخل ہوا، پہلے خزانے کی طرف، تو میں نے دیکھا کہ ہر تالے پر اس کی چابی لٹکی ہوئی ہے، اور بعض تالوں پر دو یا تین چابیاں تھیں۔ میں نے پہلے تالے پر تین چابیاں دیکھیں جن میں چار سو (۴۰۰) حرکات تھیں۔ میں نے ہاتھ بڑھایا اور وہ تالا کھول دیا۔ پھر میں نے تیسرے تالے پر بھی اسی طرح تین چابیاں دیکھیں جن میں چار سو (۴۰۰) حرکات تھیں۔ میں نے تیسرا کھولا اور دوسرے کی طرف لوٹا، اور اس پر دو چابیاں تھیں، اور وہ ایک بند تالا (قفل مطبق) تھا، یعنی ایک تالے میں دو تالے، جن میں دو حرکات میں چار حرکات تھیں۔ جب میں نے تالے کھولے اور خزانوں میں جھانکا، تو مجھے علوم کی صورتیں اس خزانے کی چابیوں کی حرکات کی تعداد کے مطابق نظر آئیں، نہ کم نہ زیادہ۔ میں نے ہلاک کرنے والے علوم دیکھے، جن میں کسی نے مشغولیت اختیار نہیں کی مگر ہلاک ہو گیا۔ یہ وہ علوم عقلیہ ہیں جو حکماء اور متکلمین میں اہل فکر کے ساتھ خاص ہیں۔ میں نے ان میں سے وہ علوم دیکھے جو اپنے حامل کو دائمی ہلاکت کی طرف لے جاتے ہیں، اور وہ بھی دیکھے جو اپنے حامل کو ہلاکت کی طرف لے جاتے پھر وہ نجات پا جاتا ہے، لیکن ان میں شریعت کے نور کا کوئی اثر بالکل نہیں ہوتا۔ ان علوم نے اپنے حامل کو سعادت سے محروم کر دیا ہے۔ ان میں براہمنوں (البراهمة) کے بہت سے علوم اور جادو (السحر) وغیرہ کے علوم شامل تھے۔ پس میں نے ان میں موجود تمام علوم کو حاصل کر لیا تاکہ ان سے بچ سکوں۔ یہ ایسے اسرار ہیں جن کا اظہار ممکن نہیں، اور انہیں علوم السر (علم سر) کہا جاتا ہے۔ صحابہ کرام رضی اللہ عنہم میں سے حذیفہ بن الیمان رضی اللہ عنہ اس علم کے ساتھ خاص تھے، رسول اللہ صلی اللہ علیہ وسلم نے انہیں اس کے ساتھ خاص کیا تھا۔ اسی لیے صحابہ کے درمیان انہیں صاحب علم السر (صاحب علم السر) کہا جاتا تھا۔ اور اسی سے وہ منافقین (اہل النفاق) کو پہچانتے تھے۔ یہاں تک کہ ایک دن عمر بن الخطاب رضی اللہ عنہ نے انہیں اللہ کی قسم دے کر پوچھا کہ کیا مجھ میں اس میں سے کچھ ہے؟ انہوں نے کہا: نہیں، اور میں آپ کے بعد کسی کو نہیں بتاؤں گا۔ اور عمر بن الخطاب رضی اللہ عنہ حذیفہ کی موجودگی میں کسی جنازے کی نماز نہیں پڑھتے تھے جب تک کہ حذیفہ کو اس پر نماز پڑھتے ہوئے نہ دیکھ لیتے۔ اگر حذیفہ نماز پڑھتے تو عمر بھی پڑھتے، ورنہ نہیں۔ پس جس نے اسے جان لیا تاکہ اس سے بچے، وہ کامیاب ہو گیا، اور جس نے اسے اعتقاد کے ساتھ جان لیا اور اس پر عمل کیا، وہ بدبخت ہو گیا۔ جب میں نے اسے حاصل کر لیا اور علم کے ذریعے اس کا احاطہ کر لیا، اور اللہ کی طرف سے عطا کردہ عنایت الٰہیہ (العناية الإلهية) کے ذریعے خود کو اس پر عمل کرنے اور اس کے اثر سے متصف ہونے سے پاک رکھا، تو میں نے اس پر اللہ کا شکر ادا کیا۔ ان مقامات میں اس طریقے کے بہت سے سالک ہلاک ہو گئے، کیونکہ وہ ایسے علوم دیکھتے ہیں جن سے نفوس کو عشق ہو جاتا ہے، اور وہ ان کے ذریعے رب بن جاتے ہیں اور ان کے ذریعے شیخ بن جاتے ہیں۔ اور نفوس اپنے ہم جنسوں پر برتری (الشفوف) اور سرداری (الرئاسة) کی طلبگار ہوتی ہیں، تو وہ ان علوم کو لے کر نکلتے ہیں اور انہیں عالم ملک (عالم الملك) میں استعمال کرتے ہیں، تو وہ خود بھی گمراہ ہوتے ہیں اور دوسروں کو بھی گمراہ کرتے ہیں، پس **أَضَلُّوا كَثِيراً وضَلُّوا عَنْ سَواءِ السَّبِيلِ** (انہوں نے بہتوں کو گمراہ کیا اور سیدھے راستے سے بھٹک گئے)۔\n\nپھر میں دوسرے خزانے کی طرف منتقل ہوا، تو میں نے اس کے دو تالوں پر چابیاں دیکھیں، اور تیسرے تالے پر کوئی چابی نہیں تھی۔ میں نے پہلے تالے پر تین چابیاں دیکھیں جن میں دس (۱۰) حرکات تھیں۔ میں نے اسے کھولا۔ پھر میں دوسرے تالے کے پاس آیا تو اس پر ایک چابی پائی جس میں چار (۴) حرکات تھیں۔ میں نے اسے لیا اور اس سے تالا کھولا۔ پھر میں تیسرے تالے کے پاس آیا تو اس پر کوئی چابی نہیں دیکھی، تو میں حیران ہوا اور سمجھ نہیں پایا کہ کیا کروں۔ تو مجھ سے کہا گیا: ہر اس تالے پر جس کی کوئی چابی نہ ہو، یہ پڑھو: **إِنَّ رَبَّكَ هُوَ الْفَتَّاحُ الْعَلِيمُ** (بے شک تیرا رب ہی بڑا کھولنے والا، سب کچھ جاننے والا ہے)۔ پھر مجھ سے کہا گیا: اس تالے کی چابی غیب کی چابیوں (مفاتيح الغيب) میں سے ہے، جسے اس کے سوا کوئی نہیں جانتا۔ میں نے یہ کہا تو تالا کھل گیا اور خزانہ کھل گیا۔ میں نے علوم کی صورتیں چابیوں کی حرکات کی تعداد کے مطابق دیکھیں، اور میں نے ایک زائد علم کی صورت دیکھی جو ان صورتوں سے زیادہ تھی جو چابیوں کی حرکات کی تعداد پر ظاہر ہوئی تھیں۔ میں نے پوچھا: یہ کون سا علم ہے؟ تو کہا گیا: یہ وہ علم ہے جو معلومات اور علوم میں ساری (جاری و نافذ) ہے۔ پس تمام علوم اس علم کے ذریعے معلوم ہوتے ہیں، نہ کہ خود اپنے ذریعے سے۔ تو میں نے جان لیا کہ ابو المعالی الجوینی نے جب کہا تھا کہ علم کے ذریعے علم معلوم ہوتا ہے، جیسا کہ اس کے ذریعے دیگر معلومات معلوم ہوتی ہیں، اور اس کا ارادہ یہ تھا کہ جس علم کے ذریعے علم معلوم ہوتا ہے وہ خود علم کو معلوم کرنے کا ذریعہ ہے، تو معاملہ ایسا نہیں جیسا کہ اس نے گمان کیا، بلکہ علم اس ساری ہونے والے علم (العلم الساري) کے ذریعے معلوم ہوتا ہے، پس علوم اس کے ذریعے معلوم ہوتے ہیں اور وہ خود معلوم نہیں ہوتا۔ پس یہ جان لو۔ یہی وہ چیز ہے جو کشف (الکشف) نے اسے عطا کی، یعنی معانی کا کشف، نہ کہ صورتوں کا کشف۔ اور یہ علوم جو میں نے اس دوسرے خزانے میں دیکھے، وہ قدرت اور اقتدار کے علوم (علوم القدرة والاقتدار) ہیں، اور وہ علوم ہیں جن سے اشیاء وجود میں آتی ہیں اور جن سے اکوان (کائنات) سے منسوب اعیان (حقیقتیں) ظاہر ہوتی ہیں۔ اور یہ افعال کے اعیان ہیں جو بندوں کی طرف منسوب ہیں۔ پس یہ منزل ان پر ہلاکت کا حکم لگاتی ہے، اس ساری ہونے والے علم کے سبب جو ان کے ساتھ ہے، اور یہ ہلاکت اضافت اور نسبت کی ہلاکت ہے، نہ کہ عین (حقیقت) کی ہلاکت۔ پس جو ہلاک ہوا وہ ان افعال کی بندوں کی طرف نسبت ہے، تو یہ منزل اسے یہ عطا کرتی ہے کہ یہ نسبت صحیح نہیں ہے، اور یہی اس کی عین ہلاکت ہے۔ اور ساری ہونے والے علم نے اسے مطلع کیا کہ یہ اللہ کے افعال ہیں۔ پس بندوں کے افعال کے اعیان ہلاکت سے بری ہیں۔ پس میں نے اس حرکت سے تکوین کے علوم (علوم التكوين) اور اس کے قول **كُنْ** (ہو جا) کا راز حاصل کیا جو ہر متکون (وجود میں آنے والی چیز) میں ساری ہے۔\n\nپھر میں تیسرے خزانے کی طرف منتقل ہوا، جس پر چھ تالے تھے اور ان کی چابیاں ان کے تالوں پر تھیں۔ پہلے تالے پر ایک چابی تھی جس میں ایک حرکت تھی۔ دوسرے پر دو چابیاں تھیں جن میں دو حرکات تھیں۔ تیسرے پر دو چابیاں تھیں جن میں دس حرکات تھیں۔ چوتھے پر ایک چابی تھی جس میں تیس حرکات تھیں۔ پانچویں پر ایک چابی تھی جس میں پانچ حرکات تھیں۔ اور چھٹے پر دو چابیاں تھیں جن میں دو حرکات تھیں۔ میں نے چابیاں لیں اور تالے کھولے۔ جب خزانہ کھلا تو میں نے جہنم کو دیکھا کہ وہ ایک دوسرے کو توڑ رہی ہے، اور اس کے بیچ میں ایک سبز باغ (روضة خضراء) تھا۔ اور میں نے ایک شخص کو دیکھا جسے آگ سے نکالا گیا اور اس باغ میں ایک گھڑی کے لیے کھڑا کیا گیا، پھر اسے آگ میں واپس کر دیا گیا، تو اسے چھ قسم کے عذاب دیے گئے، پھر اسے ایک گھڑی کے لیے باغ میں لوٹایا گیا، پھر وہاں سے آگ میں نکالا گیا، تو اسے چھ قسم کے عذاب دیے گئے۔ پس میں نے اس دردناک عذاب (العذاب المؤلم) اور جلانے والی آگ (النار المحرقة) سے بچنے کا علم حاصل کیا، اس پانی سے جو میں نے اس باغ سے پیا، وہ گھونٹ میری عصمت (بچاؤ) تھا۔ پھر میں چوتھے خزانے کی طرف منتقل ہوا، تو میں نے اس کے پہلے تالے پر ایک چابی دیکھی جس میں چھ ہندسی حرکات (حركات هندسية) تھیں۔ اور دوسرے تالے پر تین چابیاں تھیں، ان تینوں چابیوں میں ایک معلوم صنعت کے ساتھ چار سو (۴۰۰) حرکات تھیں۔ اور تیسرے تالے پر، جو ایک تالے میں دو تالے تھے اور قفل مطبق کہلاتا ہے، دو چابیاں تھیں جن میں چار حرکات میں دو حرکات تھیں۔ میں نے تالے کھولے، تو میں نے اس گھر کے پہلے خزانے کے علوم کا بقیہ حصہ دیکھا، مگر فرق یہ تھا کہ اس گھر کے پہلے خزانے کے علوم کی ہلاکت کا تعلق صفات کے اعیان (أعيان الصفات) سے تھا، اور اس چوتھے خزانے کے علوم کی ہلاکت کا تعلق ان ذوات کے اعیان (أعيان الذوات) سے تھا جو ان ہلاک ہونے والی صفات سے متصف تھے۔ پس میں نے ان کے علوم بھی حاصل کر لیے تاکہ ان سے بچ سکوں اور ان افعال سے اجتناب کروں جو خاصیت کے طور پر ان کا تقاضا کرتے ہیں۔ اور اس میں علوم کی صورتیں بھی اتنی ہی تھیں جتنی چابیوں میں حرکات تھیں۔ اور اسی طرح اس منزل کے تمام علوم ہیں، ان کی تعداد ان کی چابیوں کی حرکات کی تعداد کے مطابق ہے، اور ان کی تفصیلات اور احوال ہیں جنہیں ہم نے طوالت کے خوف سے چھوڑ دیا۔\n\nپھر ہم دوسرے گھر کی طرف منتقل ہوئے تاکہ میں اس کے خزانوں کو بھی دیکھوں، اور وہ چار خزانے ہیں۔ میں پہلے خزانے کے پاس آیا تو اس پر چھ تالے تھے۔ پہلے تالے پر ایک چابی تھی جس میں چالیس (۴۰) حرکات تھیں۔ اور میں نے دوسرے تالے پر کوئی چابی نہیں دیکھی، تو میں نے اسے اسم (الٰہی) سے کھولا۔ اور میں نے تیسرے تالے پر ایک چابی دیکھی جس میں ایک حرکت تھی۔ اور میں نے چوتھے تالے کو دو چابیوں سے کھولا جو میں نے اس پر پائیں، جن میں نو سو (۹۰۰) حرکات تھیں، ہر حرکت دوسری سے مختلف تھی۔ اور میں نے پانچویں تالے کو دو چابیوں سے کھولا جو میں نے اس پر پائیں، جن میں پچاس ہندسی حرکات تھیں۔ اور میں چھٹے تالے کے پاس آیا تو اس پر کوئی چابی نہیں دیکھی، تو میں نے اسے اسم (الٰہی) سے کھولا۔ اور بعض مکاشفین جو اس منزل میں داخل ہوتے ہیں، انہیں یہ چھٹا تالا نظر آتا ہے اور اس پر دو چابیاں ہوتی ہیں جن میں دس حرکات ہوتی ہیں۔ اور خطاب فہوانی (حضرة الخطاب الفهواني) کے حضور میں اس تالے کے لیے چابی کا نہ ہونا زیادہ صحیح ہے، اور جو اسے چابی کے ساتھ دیکھتا ہے تو وہ اسے لوح محفوظ (اللوح المحفوظ) سے دیکھتا ہے۔ جب میں نے یہ خزانہ کھولا تو اس میں ذخیرہ شدہ علوم کی صورتیں چابیوں کی حرکات کی تعداد کے عین مطابق تھیں، نہ کم نہ زیادہ۔ اور یہ فنا کے علوم (علوم الفناء) ہیں، اس امر سے فنا ہو جانا جس پر وہ شخص بھروسہ کرتا ہے جسے اپنے رب سبحانہ و تعالیٰ کی معرفت نہیں ہے۔ پس میں نے اس میں موجود تمام علوم کو حاصل کر لیا، جو فنا کے علوم ہیں، اور گویا وہ ان امور کا احاطہ کرتے ہیں جن پر بھروسہ کیا جاتا ہے۔ پھر میں اس خزانے سے نکلا اور دوسرے خزانے کے پاس آیا، تو میں نے اس پر تین تالے دیکھے۔ پہلے تالے پر ایک چابی، دوسرے پر دو چابیاں، اور تیسرے پر ایک چابی۔ ان چابیوں میں ایک سو پچیس (۱۲۵) حرکات تھیں۔ میں نے خزانہ کھولا تو اس میں علوم کی صورتیں تھیں جو صرف اسی سے حاصل کی جا سکتی ہیں، پس وہ عزیز المثال ماخذ (مآخذ عزيزة المثال) ہیں۔ میں نے ان سب کو ایک لمحے میں حاصل کر لیا۔ پھر میں تیسرے خزانے کے پاس آیا، تو اس پر چار تالے تھے۔ پہلے، تیسرے اور چوتھے تالے پر ایک ایک چابی تھی، ان چابیوں میں اکہتر (۷۱) حرکات تھیں۔ اور دوسرے تالے پر کوئی چابی نہیں تھی۔ پس میں نے ان تالوں کو چابیوں اور اسم (الٰہی) سے کھولا، تو اس میں ان علوم کی صورتیں تھیں جن کے ذریعے سامری (السامري) نے اپنی **قَوْمَهُ** کو **أَضَلَّ** کیا **وَمَا هَدَى** (گمراہ کیا اور ہدایت نہ دی)۔ پس میں نے انہیں حاصل کر لیا تاکہ ان کے شر سے بچ سکوں اور ان کے ذریعے اللہ کے نزدیک ایک پسندیدہ مصرف اختیار کروں جس میں کوئی ذمہ داری نہ ہو۔ پھر میں چوتھے خزانے کے پاس آیا، اور اس پر چھ تالے تھے۔ پہلے، دوسرے، چوتھے اور پانچویں تالے پر ایک ایک چابی تھی، اور تیسرے پر کوئی چابی نہیں تھی، اور چھٹے پر دو چابیاں تھیں۔ تمام چابیوں میں تین سو انہتر (۳۶۹) حرکات تھیں۔ میں نے الٰہی اسم (الاسم الإلهي) اور چابیوں سے تالے کھولے، تو میں نے ان علوم کی صورتیں دیکھیں جو اس میں موجود تھیں، اور وہ وہ علوم ہیں جو کسب (محنت) سے حاصل ہوتے ہیں نہ کہ وہب (عطا) کے طریقے سے۔ یہ وہ علوم ہیں جو فکر سے ادراک ہوتے ہیں۔ پس میں نے انہیں عمل کے طریقے سے حاصل کیا تاکہ وہ ہمیشہ کسب شدہ رہیں۔\n\nپھر میں تیسرے گھر کی طرف نکلا اور اس میں داخل ہوا، تو میں نے اس میں تین خزانے دیکھے۔ میں نے پہلے خزانے کا قصد کیا، تو اس پر پانچ تالے تھے۔ دوسرے تالے پر تین چابیاں تھیں، اور پانچویں تالے پر کوئی چابی نہیں تھی، اور باقی تالوں پر ایک ایک چابی تھی۔ میں نے انہیں اسم (الٰہی) اور چابیوں سے کھولا، تو میں نے اس میں اصطلام (غرق ہو جانے) کے علوم (علوم الاصطلام) کی صورتیں دیکھیں، اور یہ احوال کے علوم (علوم الأحوال) میں سے ہیں۔ پس میں نے انہیں ان کے طریقے سے حاصل کیا اور وہاں سے نکل کر دوسرے خزانے کا قصد کیا، تو میں نے اس پر چار تالے دیکھے۔ دوسرے اور چوتھے تالے پر کوئی چابی نہیں تھی، اور پہلے تالے پر دو چابیاں تھیں جن میں پچاس (۵۰) حرکات تھیں، اور تیسرے تالے پر ایک چابی تھی جس میں دو سو (۲۰۰) حرکات تھیں۔ میں نے انہیں اسم (الٰہی) اور چابیوں سے کھولا، تو وہ خوف اور مجاہدہ کے علوم (علوم الخوف والمجاهدة)، شوق اور اشتیاق کے احوال (أحوال الشوق والاشتياق)، اور جہنم کی سعیر (جلن) کا علم (علم السعير) پر مشتمل تھے، نہ کہ زمہریر (شدید ٹھنڈک) کا علم۔ اور اس علم پر بھی مشتمل تھے کہ جہنم میں کھالوں کا پکنا (نضج الجلود) کس چیز سے ہوتا ہے، کیونکہ یہ نہ تو آگ سے ہوتا ہے اور نہ ہی زمہریر سے، بلکہ یہ ان دونوں کے درمیان پیدا ہونے والا عذاب ہے، جو ان میں سے ہر ایک کے دوسرے کے پڑوس میں ہونے سے پیدا ہوتا ہے، تو ان کے امتزاج سے ایک تیسری حالت پیدا ہوتی ہے جو ان دونوں میں سے کسی کی عین نہیں ہوتی۔ یہ حادث ہونے والی حالت ہی وہ عذاب ہے جس سے جہنم میں کھالیں پکتی ہیں۔ اور اس علم پر بھی مشتمل تھے کہ ان کا بدلنا کس حضور (حضرة) سے ہوتا ہے۔ اور یہ ایک عظیم مشاہدہ ہے، کیونکہ کھالوں، آسمانوں اور زمین کے بدلنے کے بارے میں نص وارد ہوئی ہے، لیکن اس نے مخلوق کے بارے میں اس کی نفی کی، پس فرمایا: **لَا تَبْدِيلَ لِخَلْقِ اللَّهِ** (اللہ کی تخلیق میں کوئی تبدیلی نہیں)، اور اس نے الٰہی قول کے بارے میں بھی اس کی نفی کی، پس فرمایا: **مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ** (میرے ہاں بات بدلی نہیں جاتی)، اور فرمایا: **لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ** (اللہ کے کلمات میں کوئی تبدیلی نہیں)۔ یہ سب کچھ اس خزانے میں شامل ہے۔ پھر میں تیسرے خزانے کے پاس آیا، تو میں نے اس پر چھ تالے دیکھے، جن میں اس خزانے کے تالوں سے مشابہت تھی جس سے میں اس میں آیا تھا۔ دوسرا تالا بغیر چابی کے تھا، اور پہلے تالے پر دو چابیاں تھیں، اور تیسرے تالے پر تین چابیاں تھیں، اور چوتھے اور پانچویں تالے پر ایک ایک چابی تھی، اور چھٹے تالے پر دو چابیاں تھیں۔ ان چابیوں میں ایک ہزار ایک سو سینتیس (۱۱۳۷) حرکات تھیں۔ میں نے انہیں اسم (الٰہی) اور چابیوں سے کھولا، تو اس میں ارتقاءات اور معارج (عروج) کے علوم کی صورتیں تھیں، اور اس دن کی معرفت جس کی **مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ** (مقدار پچاس ہزار سال ہے)، لیکن جب ارتقاءات اور معارج مریدین (ارادہ کرنے والوں) کی طرف سے ہوں، نہ کہ مرادین (جن کا ارادہ کیا گیا ہو) کی طرف سے، تو وہ شوق، مجاہدہ، ریاضت اور مشقت کے ذریعے ہوتے ہیں۔\n\nپھر میں چوتھے گھر کی طرف آیا اور اس میں داخل ہوا، تو اس میں تین خزانے تھے۔ پہلے خزانے پر سات تالے تھے۔ ان میں سے دوسرا تالا بغیر چابی کے تھا، اور پہلے تالے پر ایک چابی تھی جس میں چھ حرکات تھیں، اور تیسرے تالے کی چابی میں چالیس حرکات تھیں، اور باقی تالوں میں چھ سو چھ (۶۰۶) حرکات تھیں۔ پس اس کی چابیوں کی کل حرکات چھ سو بتیس (۶۳۲) تھیں۔ میں نے انہیں کھولا، تو اس میں نکاح کا علم (علم النكاح) تھا، اور یہ کہ انسان اپنی بیوی کے ساتھ کیسا سلوک کرے جب وہ اس کے رب کی اطاعت میں اس کی مدد نہ کرے، اور وہ اس قول پر ٹھہرتا ہے: **وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ** (اور گناہ اور زیادتی پر ایک دوسرے کی مدد نہ کرو)۔ اور کیا انسان اپنے رب کی عبادت میں اپنے وضو میں کسی دوسرے سے پانی ڈالنے میں مدد لے سکتا ہے؟ کیونکہ بعض علماء نے اسے مکروہ قرار دیا ہے۔ اور نفیس ابن وہبان السلمی نے اپنے واقعہ میں نبی صلی اللہ علیہ وسلم سے اس کی کراہت دیکھی اور مجھے اس کی خبر دی۔ پس اس خزانے سے یہ معلوم ہوتا ہے۔ پھر میں دوسرے خزانے کے پاس آیا، تو اس پر پانچ تالے تھے۔ ان میں سے دوسرا تالا بند (مطبق) تھا، اور تیسرا تالا بغیر چابی کے تھا، اور پہلا، دوسرا اور پانچواں تالا چابی والا تھا، اور چوتھے تالے پر تین چابیاں تھیں۔ ان چابیوں میں چار سو اٹھتر (۴۷۸) حرکات تھیں۔ میں نے انہیں کھولا، تو وہ اس سے پہلے والے خزانے سے مناسبت رکھتے تھے اور ان امور میں اس سے زیادہ تھے جو اس میں نہیں تھے۔ پھر میں تیسرے خزانے کے پاس آیا، تو اس پر پانچ تالے تھے۔ پہلا تالا بغیر چابی کے تھا، اور دوسرے، تیسرے اور چوتھے تالے پر ایک ایک چابی تھی، اور پانچویں پر دو چابیاں تھیں۔ ان چابیوں میں چھیالیس (۴۶) حرکات تھیں۔ میں نے انہیں کھولا، تو اس میں ان پتھروں کی معرفت تھی جن سے آخرت میں آگ جلائی جائے گی، اور یہ کہ پتھر کیسے جلنے کو قبول کریں گے جبکہ وہ خشک ہیں، اور طبائع کے علم میں خشک چیز جلنے کو قبول نہیں کرتی۔ اور کیا یہ جائز ہے کہ جس چیز کی طبیعت کسی امر پر ہو، اس کی عین اور ذات باقی رہتے ہوئے اس کی طبیعت کو اس سے زائل کر دیا جائے؟ کیونکہ اس علم میں بہت سے لوگ پھسلے اور جاہل رہے جنہوں نے اسے ثابت کیا اور جنہوں نے اس کی نفی کی، اور دونوں طریقے قابل تعریف اور صحیح نہیں ہیں۔ اور ان میں سے ہر ایک نے اسے اس کے غیر صحیح پہلو سے ثابت کیا اور اس کے غیر صحیح پہلو سے نفی کی۔ اللہ تعالیٰ نے فرمایا: **يَا نَارُ كُونِي بَرْداً** (اے آگ! ٹھنڈی ہو جا) اور اس سے ملتی جلتی چیزیں۔\n\nپھر میں پانچویں گھر کے پاس آیا، تو میں نے اس میں تین خزانے دیکھے۔ پہلے خزانے پر سات تالے تھے۔ پہلے، دوسرے، تیسرے اور چوتھے تالے پر دو دو چابیاں تھیں، اور پانچویں اور چھٹے پر ایک ایک چابی تھی، اور ساتواں تالا بغیر چابی کے تھا۔ ان چابیوں میں ایک سو تیرہ (۱۱۳) حرکات تھیں۔ میں نے انہیں کھولا، تو اس میں حس اور محسوس (علوم الحس والمحسوس)، خیال اور متخیل (الخيال والمتخيل)، فکر اور جس میں فکر کی جائے، حافظ اور محفوظ، عقل اور معقول (العقل والمعقول)، اور تمام وہ قوتیں جن سے علوم کا ادراک ہوتا ہے، اور جماعتوں، انوار اور استشرافات کی معرفت، اور آسمانوں کے راستوں میں ارواح کی گزرگاہیں، اور حیوانات، نباتات اور جمادات میں طبیعت کی گزرگاہیں، اور وہ علوم جو عالم انفاس (سانسوں کے عالم) کے ساتھ خاص ہیں، اور اس نفس رحمن (نفس الرحمن) پر ٹھہرنا جو یمن کی طرف سے رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تھا۔ پھر میں دوسرے خزانے کے پاس آیا، تو میں نے اس پر تین تالے دیکھے۔ پہلے اور تیسرے پر ایک ایک چابی، اور دوسرے پر دو چابیاں تھیں۔ ان چابیوں میں چالیس (۴۰) حرکات تھیں۔ میں نے انہیں کھولا، تو اس میں ہستی (الوجود) میں عام اسباب کا علم، اور اہل اللہ کے ساتھ خاص اسباب کا علم، اور اللہ کی طرف منسوب نزول کے اسباب کا علم تھا جن پر بھروسہ کیا جاتا ہے اور جو شخص ان پر بھروسہ کرتا ہے اسے اللہ تک پہنچایا جاتا ہے، اور جو انہیں چھوڑ دیتا ہے اسے اللہ کے دروازے اور اس کی سعادت سے دور کر دیا جاتا ہے۔ یہ شریف علوم ہیں جن سے اکثر لوگوں نے بے رغبتی برتی تو بدبخت ہوئے، اور بعض لوگوں نے انہیں استعمال کیا تو نیک بخت ہوئے۔ اور یہ نازل شدہ شرائع کا علم ہے، نہ کہ حکمی شریعت کا علم۔ پھر میں تیسرے خزانے کے پاس آیا، تو میں نے اس پر پانچ تالے دیکھے۔ پہلے تالے پر ایک چابی تھی، اور اسی طرح باقی تالوں پر بھی۔ اور ان کے تالوں میں چار سو چونتیس (۴۳۴) حرکات تھیں۔ میں نے انہیں کھولا، تو اس میں التفاف (لپٹنے) کے علوم کی صورتیں تھیں: ارواح کا اجساد سے لپٹنا، محبین اور محبوبین کی ارواح کا لپٹنا، دونوں پنڈلیوں کا لپٹنا، اور لام کا الف سے لپٹنا، اور اس کے قول **وَالْتَفَّتِ السَّاقُ بِالسَّاقِ** (اور پنڈلی پنڈلی سے لپٹ جائے گی) کا معنی، اور متضائفین (اضافت رکھنے والوں) کا لپٹنا۔ اور یہ سب ارتباطات (تعلقات) کے علوم ہیں: رب اور مربوب (پروردگار اور پروردہ)، الٰہ اور مألوہ (معبود اور جس کی عبادت کی جائے)، قادر اور مقدور (قدرت والا اور جس پر قدرت ہو)، عالم اور معلوم (جاننے والا اور معلوم کیا گیا)۔ پس یہ خزانہ تمام علوم کو شامل ہے۔ یہ ہم نے وہ سب کچھ بیان کر دیا جو یہ منزل علوم کے خزانوں میں رکھتی ہے۔ اللہ تعالیٰ فرماتا ہے: **وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ** (کوئی چیز ایسی نہیں جس کے خزانے ہمارے پاس نہ ہوں، اور ہم اسے ایک معلوم مقدار کے مطابق ہی نازل کرتے ہیں)۔ اس کے علاوہ، جب میں اس منزل میں داخل ہوا تو میں نے اس منزل کی دہلیز (برآمدے) میں ایک گھر چھوڑ دیا تھا جو ہر کسی کے لیے نہیں کھلتا، اور وہ میرے لیے کھولا گیا اور میں اس میں داخل ہوا اور جو کچھ اس میں تھا اسے جان لیا۔ اور وہ ان تمام خزانوں کی چابیوں کو شامل اور محفوظ رکھتا ہے جو اس کتاب میں موجود ان منازل میں شامل ہیں۔ اور وہ عظیم امور پر مشتمل ہے، اور جو شخص اسے جانتا ہے اسے کائنات کے وجود میں اس سے تحقق حاصل ہوتا ہے۔ اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ اور ہم نے اس منزل میں موجود بعض علوم پر تنبیہ کر دی ہے۔",
    "fa": "باب دویست و هفتاد و سوم در شناخت منزل هلاکت هوای نفس و نفس از مقام موسوی\n\n> هلاك الخلق في الريح *** إذا ما هب في اللوح‏\n> هلاکت خلق در باد است *** آنگاه که در لوح بوزد\n> ولاذ بغير مولاه *** إله الجسم والروح‏\n> و به غیر مولای خود پناه برد *** ای خدای جسم و روح\n> ووعر مسلكا سهلا *** بما قد جاء في نوح‏\n> و راهی آسان را دشوار ساخت *** به آنچه در [داستان] نوح آمده است\n> وفي لوط فيا نفسي *** على ما قلته نوحي‏\n> و در [داستان] لوط؛ پس ای نفس من *** بر آنچه گفتم نوحه کن\n> ولو لا العشق آداه *** بريق من سنا يوحي‏\n> و اگر عشق نبود، او را هدایت نمی‌کرد *** پرتوی از نوری که وحی می‌کند\n\n### [اینکه افلاک را منازلی است که تا اجلی معین در جریانند]\n\nبدان که چون خدای تعالی افلاک را آفرید و آنها را با فرشتگان (الأملاك) آباد ساخت و برای هفت کوکب سیار در آنها منازلی مقدر نمود که تا اجلی معین (أجل مسمى) در آن جاری باشند، زمان با جریان و شناوری آنها تعیین شد. و مکانت (المكانة) را پیش از مکان‌ها آفرید و از آن رقیقه‌هایی به سوی مکان‌های مخصوص در آسمان‌های هفت‌گانه و زمین امتداد داد. سپس متمکنات (المتمكنات) را در مکان‌هایشان به اندازه مکانتشان ایجاد نمود.\n\nو از تقدیر خدای عزیز علیم این بود که عقلی از عقول را آفرید که به آنچه از صفت قدرت (صفة القدرة) در آن به ودیعه نهاده بود، نه از صفت غیر آن، آگاه باشد. او را به این امر بر ابناء جنسش اختصاص داد و این از اسم ظاهر (الاسم الظاهر) است که مختص به این عقل است. پس آن را با نوعی از قهر (القهر) به سوی او افکند که در آن محبتی جاری شد که دارای آرامش، خنکی و سرور بود. در نتیجه، پنج نهر از علم از اسم اول و آخر (الاسم الأول والآخر) که مختص به این عقل است، در آن جوشید. سپس این نهرها در اسم باطن (الاسم الباطن) که از آنِ اوست، جاری شدند. پس اولیتش بر سایر اولیت‌ها و آخریت او بر سایر آخریت‌ها تقدیس یافت، و همچنین ظاهر و باطن او.\n\nو از ام الکتاب (أم الكتاب) که نزد اوست، حضرتی صادر شد که ام الجمع (أم الجمع) نامیده می‌شود. حق مرا به آن وارد کرد و من آن را دیدم و ظاهر و باطن آن را مشاهده کردم و مکان این عقل را در آن، نقطه‌ای سیاه، پوشیده و پاکیزه، مابین سرخی و زردی، دیدم. و رقیقه (الرقيقة)ای را که بین مکانت و این مکان معین بود، مشاهده کردم. و موسی و هارون و یوسف علیهم السلام را دیدم که به این عقل می‌نگریستند.\n\nو خداوند سبحان از این حضرت جامع که آن را به خود اختصاص داده، حضورهایی (حضرات) را منشعب ساخت که تعداد آنها را جز خدا نمی‌داند؛ در آسمان و زمین و آنچه میان آنهاست و زیر خاک تا حد استواء. همه این حضورها مورد نظر خاص حق (الحق) هستند و به واسطه آن، بر غیر خود برتری یافته‌اند. پس نزد کسی که آنها را می‌شناسد، از کسانی که حق او را به آنها شناسانده است، حرمتی دارند و به آنها کرامت می‌بخشند. این حضورها، مقامات تنزیه (مقامات التنزيه) نامیده می‌شوند. هنگامی که روحانیات عالی (الروحانيات العلى) وارد آنها می‌شوند، از احوال تنزیه الهی (التنزيه الإلهي) بهره می‌برند که قدر آن را جز خدا نمی‌داند، و برای آنها خضوع و خشوع و خواری و فقر (الذلة والافتقار) حاصل می‌شود که پیش از ورودشان نداشتند. و از این حضورها و در این مقامات است که رؤیت وجه حق (رؤية وجه الحق) در هر چیزی به صورت تمام و کمال برای آنها حاصل می‌شود.\n\nاما برخی از مردان آن را مشاهده می‌کنند و برخی دیگر این حال را به آنها می‌دهند، ولی آن را نمی‌شناسند و نمی‌دانند در کدام مرتبه برایشان حاصل شده است، به اندازه‌ای که علم خدا در مورد او سبقت گرفته است. پس برخی از آنها چنین و برخی چنانند.\n\nپس به آن عقل که ذکر کردیم و اثر انفعال به مکانتش در این منزل دارد، بازگردیم و آنچه را که برای او بود و آنچه که از او و به سبب او حاصل شد و مختص به این منزل است، نزد هر کس که آن را مشاهده کرده، ذکر کنیم. و خداوند سبحان مقام صدق و صفا (مقام الصدق والصفاء) را مشخص نمود و در آن هفتاد و دو پله (مرقاة) تعیین کرد. هر پله‌ای از آنها علومی را به کسی که در آن بالا می‌رود، به خاطر صفایی که این صورت اقتضا کرده است، می‌دهد. اینها علوم کشف (علوم كشف) هستند تا اینکه به اوج آن برسد، پس حضرت ام (الأم) با ذات خود با او روبرو می‌شود و از تنزیه الهی و ثنا به وحدانیت و صدق و قهر و نصرت و اخلاص و خواری به او می‌بخشد.\n\nو هنگامی که خداوند مرا به این پله‌ها وارد کرد، او را دیدم که آنها را از دیدگان با ظلمت طبیعت (ظلمة الطبيعة) پوشانده است، حجابی که برداشته نمی‌شود. پس امروز برای کسی که در آن بالا می‌رود، قدمی نهاده شده نیست، بلکه از پشت ظلمت طبع به واسطه آن مکاشفه می‌کند و در آن قدمی برایش حاصل نمی‌شود. این‌گونه آن را دیدم و دیدم که گروه بسیاری از حقایق عارفان (حقائق العارفين) با من هستند، در مراتب مختلف از عالی و بالاتر، و آنها در این مقام هستند.\n\nپس به این عقل مخصوص به این منزل امر شد که در آنچه مشخص شده و ذکر کردیم، بالا رود. و عقول نزد او جمع شدند و من می‌نگریستم که چه می‌کند و چه می‌گوید تا از او بهره ببرم. سپس دیدم که بالا رفت و سخن نگفت. و نمی‌دانم آیا به امر الهی بالا رفت؟ پس هنگامی که بازگشت، اثر اندوه و قهر و پریشانی بر او دیدم. پس دانستم که او در مقام انذار (مقام انذار) از انذارهای حق برای ارواح است. در خبری روایت شده است که جبرئیل و میکائیل علیهما السلام نشستند و گریه می‌کردند. پس خداوند به آنها وحی کرد: این چه گریه‌ای است؟ گفتند: ما از مکر تو در امان نیستیم. خداوند به آنها وحی کرد: باید چنین باشید. پس چون آنچه به او القا شد، با خشوع و خواری به ما القا کرد.\n\nو اتفاقاً من به سمت چپ نگاه کردم، پس هوی (الهوى) و شهوت (الشهوة) را دیدم که با هم نجوا می‌کردند. و خداوند به این هوی (الهوى) چنان قوت نافذی (القوة النافذة) داده است که بر بیشتر عقول غلبه می‌کند، مگر اینکه خداوند او را حفظ کند. پس هوی در آن موقف ایستاد و گفت: من خدای پرستیده شده (الإله المعبود) نزد هر موجودی هستم. و از عقل و آنچه از نقل آورده بود، روی گرداند. پس شیاطین و شهوت از او پیروی کردند تا اینکه به میان آتش (بحبوحة النار) رسید. پس فرشی از قطران (القطران) برای او پهن شد و بر امری تکیه کرد که گمان می‌کرد او را از عذاب خدا نجات می‌دهد. پس خداوند میان او و کسی که بر او تکیه کرده و به او استناد جسته بود، حائل شد. پس او و کسانی که از او پیروی کردند، با نعمت سعادتمندان هلاک شدند. این صحنه‌ای کریم، هولناک و وحشت‌آور بود که ما و هر عارفی که در آن روز با ما حاضر بود، به سختی از آن رهایی یافتیم.\n\nسپس خواستم تا به آنچه در این منزل از مراتب و حقایق و اسرار و علوم است، احاطه یابم. پس آن عقل، صاحب این منزل، دست مرا گرفت و به سبب او این منزل ظاهر شد و به من گفت: این منزل هلاکت (منزل الهلاك) و محل هلاکت (مصرع الهلاك) است. پس در آن پنج خانه دیدم. در خانه اول چهار خزینه بود. بر خزینه اول سه قفل، و بر دومی نیز همین‌طور، و بر سومی شش قفل، و بر چهارمی سه قفل بود. خواستم آنها را باز کنم، پس به من گفت: برو تا آنچه در هر خانه از خزینه‌هاست ببینی و پس از آن قفل‌های آنها را باز کنی و آنچه در آنهاست بشناسی. سپس دست مرا گرفت و برخاستیم و به خانه دوم رفتیم. وارد آن شدم و در آن چهار خزینه دیدم. بر خزینه اول شش قفل، و بر خزینه دوم سه قفل، و بر خزینه سوم چهار قفل، و بر خزینه چهارم شش قفل بود. سپس دست مرا گرفت و از آن خانه خارج شدیم و وارد خانه سوم شدم. در آن سه خزینه دیدم. بر خزینه اول پنج قفل، و بر خزینه دوم چهار قفل، و بر خزینه سوم شش قفل بود. سپس دست مرا گرفت و از آن خانه خارج شدیم. و همه اینها از یک در وارد می‌شدم و از در دیگر خارج می‌شدم. وارد خانه چهارم شدم و ناگهان در آن سه خزینه بود. بر خزینه اول هفت قفل، و بر خزینه دوم پنج قفل، و بر سومی پنج قفل بود. سپس دست مرا گرفت و از آن خارج شدیم و وارد خانه پنجم شدم. در آن سه خزینه دیدم. بر خزینه اول هفت قفل، و بر خزینه دوم سه قفل، و بر خزینه سوم پنج قفل بود.\n\nسپس دست مرا گرفت و خارج شدیم تا خانه اول را بیابیم و آن قفل‌ها را باز کنیم و ببینیم آن خزینه‌ها چه ودیعه‌هایی (ودائع) را در خود جای داده‌اند. پس وارد خانه اول شدم و به خزینه اول رفتم. دیدم که کلید آن بر هر قفلی آویزان است و بر برخی قفل‌ها دو یا سه کلید بود. بر قفل اول سه کلید دیدم که این کلیدها شامل چهارصد حرکت بودند. دست دراز کردم و آن قفل را باز کردم. سپس بر قفل سوم نیز سه کلید دیدم که شامل چهارصد حرکت بودند، پس سومی را باز کردم. و به دومی بازگشتم که بر آن دو کلید بود و آن قفلی دو لایه (قفل مطبق) بود. پس دو قفل در یک قفل بودند که شامل چهار حرکت در دو حرکت بود.\n\nهنگامی که قفل‌ها را باز کردم و به خزینه‌ها نگریستم، صور علوم به اندازه حرکات کلیدهای آن خزینه برایم آشکار شد، نه بیشتر و نه کمتر. پس علوم مهلکی (علوم مهلكة) دیدم که هیچ کس به آنها مشغول نشد مگر اینکه هلاک شد؛ از علوم عقلی مخصوص به صاحبان افکار (أرباب الأفكار) از حکما و متکلمین (الحكماء والمتكلمين). از آنها دیدم آنچه صاحبش را به هلاکت دائم (هلاك الدائم) می‌رساند، و دیدم آنچه صاحبش را به هلاکت می‌رساند و سپس نجات می‌یابد، جز اینکه نور شریعت به هیچ وجه در آن اثری ندارد. این علوم صاحبش را از سعادت محروم کرده است، مانند بسیاری از علوم برهمنان (علوم البراهمة) و علوم سحر و غیر آن. پس تمام آنچه در آن بود از علوم را به دست آوردم تا از آنها دوری جویم. و آنها اسراری هستند که آشکار کردنشان ممکن نیست و علوم سر (علوم السر) نامیده می‌شوند.\n\nاز صحابه‌ای که به این علوم اختصاص یافتند، حذیفة بن الیمان رضی الله عنه بود که رسول خدا صلی الله علیه و سلم او را به آن مخصوص گردانید. به همین دلیل در میان صحابه به او صاحب علم سر می‌گفتند و به واسطه آن منافقان را می‌شناخت. تا جایی که روزی عمر بن خطاب رضی الله عنه او را به خدا سوگند داد که آیا چیزی از آن در مورد من هست؟ گفت: نه، و پس از تو به هیچ کس نخواهم گفت. و عمر بن خطاب در حضور حذیفه بر هیچ جنازه‌ای نماز نمی‌خواند تا اینکه ببیند حذیفه به نماز بر آن می‌گوید. اگر حذیفه نماز می‌خواند، عمر نیز می‌خواند وگرنه نه. پس کسی که آن را بداند تا از آن بپرهیزد، سعادتمند شده است، و کسی که آن را بداند تا به آن معتقد شود و بر اساس آن عمل کند، شقی شده است.\n\nهنگامی که من آن را به دست آوردم و به آن احاطه علمی یافتم و نفس خود را با آنچه خداوند به واسطه عنایت الهی (العناية الإلهية) مرا از عمل به آن و متصف شدن به اثر آن حفظ کرد، تنزیه نمودم، خدا را بر آن شکر کردم. در این مقامات بسیاری از سالکان این طریقت (سالكي هذه الطريقة) هلاک شدند، زیرا علومی را می‌بینند که نفوس به آنها عاشق می‌شوند و به واسطه آنها ارباب و شیوخ می‌شوند. و نفوس طالب برتری و ریاست (الشفوف والرئاسة) بر ابناء جنس خود هستند، پس با آن علوم خارج می‌شوند و آنها را در عالم مُلک (عالم الملك) به کار می‌برند و گمراه می‌شوند و گمراه می‌کنند. پس: **أَضَلُّوا كَثِيراً وضَلُّوا عَنْ سَواءِ السَّبِيلِ** (بسیاری را گمراه کردند و خود از راه راست گمراه شدند).\n\nسپس به خزینه دوم رفتم. دیدم که بر دو قفل آن کلیدهایی هست و قفل سوم کلیدی ندارد. بر قفل اول سه کلید دیدم که شامل ده حرکت بودند، پس آن را باز کردم. سپس به قفل دوم آمدم و دیدم که بر آن یک کلید است که شامل چهار حرکت بود، پس آن را برداشتم و قفل را با آن باز کردم. سپس به قفل سوم آمدم و کلیدی بر آن ندیدم، پس متحیر شدم و ندانستم چه کنم. به من گفته شد: بر هر قفلی که کلید ندارد، بخوان: **إِنَّ رَبَّكَ هُوَ الْفَتَّاحُ الْعَلِيمُ** (همانا پروردگار تو گشاینده داناست). سپس به من گفته شد: کلید این قفل از کلیدهای غیب (مفاتيح الغيب) است که جز او کسی آن را نمی‌داند. پس من آن را گفتم و قفل باز شد و خزینه گشوده شد.\n\nصور علوم را به تعداد حرکات کلیدها دیدم و صورت علم زائدی بر آنچه از صور به تعداد حرکات کلیدها ظاهر شده بود، دیدم. گفتم: این علم چیست؟ گفت: علم ساری (العلم الساري) در معلومات و علوم. پس همه علوم به واسطه این علم معلوم می‌شوند، نه به واسطه خودشان. پس دانستم که ابوالمعالی جوینی هنگامی که گفت: «علم به واسطه علم دانسته می‌شود، همان‌طور که سایر معلومات به واسطه آن دانسته می‌شوند»، منظورش این بود که علمی که به واسطه آن، علمِ خودِ علم دانسته می‌شود، معلوم است. در حالی که امر آن‌گونه که او پنداشته نیست، بلکه علم به واسطه این علم ساری دانسته می‌شود، پس علوم به واسطه آن معلوم می‌شوند و خود او دانسته نمی‌شود. پس این را بدان. این همان چیزی است که کشف معانی (كشف المعاني) به او داده است، نه کشف صور. و این علومی که در این خزینه دوم دیدم، علوم قدرت و اقتدار (علوم القدرة والاقتدار) و علومی هستند که اشیاء از آنها تکوّن می‌یابند و اعیان منسوب به اکوان به واسطه آنها ظاهر می‌شوند. و آنها اعیان افعالی هستند که به بندگان نسبت داده می‌شوند. پس این منزل بر آنها به سبب علم ساری که همراه آنهاست، حکم به هلاکت می‌کند. و این هلاکت، هلاکت اضافه و نسبت (هلاك إضافة ونسبة) است، نه هلاکت عین. پس آنچه هلاک شده، همان نسبت این افعال به بندگان است. و این منزل به او می‌دهد که این نسبت صحیح نیست و این عین هلاکت آن است. و علم ساری به او آگاه ساخت که آنها افعال خدا هستند. پس اعیان افعال بندگان از هلاکت مبرا هستند. پس از این حرکت، علوم تکوین و راز قول **كُنْ** (باش) که در هر متکونی جاری است، حاصل شد.\n\nسپس به خزینه سوم رفتم که بر آن شش قفل و کلیدهایش بر قفل‌هایش بود. بر قفل اول یک کلید بود که شامل یک حرکت بود. و بر دومی دو کلید که شامل دو حرکت بودند. و بر سومی دو کلید که شامل ده حرکت بودند. و بر چهارمی یک کلید که شامل سی حرکت بود. و بر پنجمی یک کلید که شامل پنج حرکت بود. و بر ششمی دو کلید که شامل دو حرکت بودند. پس کلیدها را برداشتم و قفل‌ها را باز کردم. هنگامی که خزینه باز شد، جهنم را دیدم که برخی از آن برخی دیگر را در هم می‌کوبید، و در وسط آن باغی سبز بود. و مردی را دیدم که از آتش خارج شده و ساعتی در آن باغ نگه داشته شد، سپس به آتش بازگردانده شد و به شش نوع عذاب، عذاب داده می‌شد. سپس ساعتی به باغ بازگردانده می‌شد و از آنجا به آتش خارج می‌شد و به شش نوع عذاب، عذاب داده می‌شد. پس علم آنچه که به واسطه آن از آن عذاب دردناک و آتش سوزان پرهیز می‌شود، از آبی که از آن باغ نوشیدم، حاصل شد. در آن نوشیدن، عصمت من بود.\n\nسپس به خزینه چهارم رفتم. بر قفل اول آن یک کلید دیدم که شش حرکت هندسی (حركات هندسية) داشت. و بر قفل دوم سه کلید که آن سه کلید شامل چهارصد حرکت با ساختاری معلوم بودند. و بر قفل سوم که دو قفل در یک قفل بود و به قفل مطبق (المطبق) معروف است، دو کلید بود که شامل دو حرکت در چهار حرکت بودند. پس قفل‌ها را باز کردم. بقایای علوم خزینه اول این خانه را دیدم، جز اینکه هلاکت آن علوم در خزینه اول این خانه به اعیان صفات (أعيان الصفات) مربوط می‌شد، و هلاکت این علوم در خزینه چهارم به اعیان ذوات (أعيان الذوات) که به آن صفات هلاک‌شونده متصف شده‌اند، مربوط می‌شود. پس علوم آن را نیز به دست آوردم تا از آنها پرهیز کنم و از افعالی که به خاصیت، آنها را می‌طلبند، دوری جویم. و صور علوم در آن نیز به اندازه حرکاتی است که کلیدها در بر دارند. و علوم این منزل همگی چنین هستند؛ تعداد آنها به تعداد حرکات کلیدهایشان است و دارای تفصیلات و احوالی هستند که به دلیل ترس از طولانی شدن، از ذکر آنها صرف نظر کردیم.\n\nسپس به خانه دوم رفتیم تا بر آنچه در خزینه‌های آن است، آگاه شوم. و آن چهار خزینه است. به خزینه اول آمدم و دیدم که بر آن شش قفل است. بر قفل اول یک کلید بود که شامل چهل حرکت بود. و برای قفل دوم کلیدی ندیدم، پس آن را با اسم باز کردم. و بر قفل سوم یک کلید دیدم که شامل یک حرکت بود. و قفل چهارم را با دو کلیدی که بر آن یافتم و شامل نهصد حرکت بودند که هیچ حرکتی شبیه دیگری نبود، باز کردم. و قفل پنجم را با دو کلیدی که بر آن یافتم و شامل پنجاه حرکت هندسی بودند، باز کردم. و به قفل ششم آمدم و کلیدی بر آن ندیدم، پس آن را با اسم باز کردم. و ممکن است برای برخی از مکاشفینی که وارد این منزل می‌شوند، این قفل ششم ظاهر شود و بر آن دو کلید باشد که شامل ده حرکت هستند. و نبودن کلید برای این قفل در حضور خطاب فهوانی (حضرة الخطاب الفهواني) صحیح‌تر از وجود آن است. و کسی که کلید را برای آن می‌بیند، آن را از لوح محفوظ (اللوح المحفوظ) می‌بیند. هنگامی که این خزینه را باز کردم، صور علوم ذخیره شده در آن را به تعداد حرکات کلیدها دیدم، نه کم و نه زیاد. و آنها علوم فنا (الفناء) از امری هستند که کسی که معرفت (المعرفة) به پروردگار سبحان خود ندارد، به آن استناد می‌کند. پس تمام آنچه در آن بود از علوم فنا را به دست آوردم و گویی آنها دلالت بر حصر اموری دارند که به آنها استناد می‌شود.\n\nسپس از این خزینه خارج شدم و به خزینه دوم آمدم. دیدم که بر آن سه قفل است. بر قفل اول یک کلید، و بر دومی دو کلید، و بر سومی یک کلید بود. این کلیدها شامل صد و بیست و پنج حرکت بودند. پس خزینه را باز کردم و ناگهان علومی از صور علوم را دیدم که جز از او گرفته نمی‌شوند. پس آنها مآخذی عزیز المثال هستند. همه آنها را در یک لحظه به دست آوردم. سپس به خزینه سوم آمدم و دیدم که بر آن چهار قفل است. بر قفل اول و سوم و چهارم، یک کلید بود. این کلیدها شامل هفتاد و یک حرکت بودند. و قفل دوم کلیدی نداشت. پس آن قفل‌ها را با کلیدها و اسم باز کردم. ناگهان صور علومی را دیدم که سامری قوم خود را با آنها گمراه کرد و هدایت نکرد. پس آنها را به دست آوردم تا از شر آنها پرهیز کنم و با آنها مصرفی را که نزد خدا پسندیده است و در آن تبعیتی نیست، در پیش گرفتم.\n\nسپس به خزینه چهارم آمدم و بر آن شش قفل بود. بر قفل اول و دوم و چهارم و پنجم، یک کلید بود. و سومی کلیدی نداشت. و ششمی دو کلید داشت. مجموع کلیدها شامل سیصد و شصت و نه حرکت بود. پس قفل‌ها را با اسم الهی و کلیدها باز کردم. صور علومی را دیدم که در بر داشتند. و آنها علومی هستند که با کسب به دست می‌آیند، نه از طریق موهبت. و آنها علومی هستند که با فکر درک می‌شوند. پس آنها را از طریق عمل به دست آوردم تا همواره اکتسابی باقی بمانند.\n\nسپس به خانه سوم خارج شدم و وارد آن شدم. در آن سه خزینه دیدم. قصد خزینه اول کردم و دیدم که بر آن پنج قفل است. بر قفل دوم سه کلید بود و قفل پنجم کلیدی نداشت. و بقیه قفل‌ها هر کدام یک کلید داشتند. پس آنها را با اسم و کلیدها باز کردم. در آن صور علوم اصطلام (علوم الاصطلام) را دیدم که از علوم احوال هستند. پس آنها را از طریق خود به دست آوردم و از آن خارج شدم.\n\nو قصد خزینه دوم کردم. دیدم که بر آن چهار قفل است. قفل دوم و چهارم کلیدی نداشتند. و قفل اول دو کلید داشت که شامل پنجاه حرکت بودند. و قفل سوم یک کلید داشت که شامل دویست حرکت بود. پس آنها را با اسم و کلیدها باز کردم. ناگهان دیدم که شامل علوم خوف و مجاهده (علوم الخوف والمجاهدة) و احوال شوق و اشتیاق (أحوال الشوق والاشتياق) و علم آتش سوزان (علم السعير) از جهنم است، نه علم سرمای کشنده (علم الزمهرير). و علم آنچه که پخته شدن پوست‌ها (نضج الجلود) در جهنم از آن حاصل می‌شود، زیرا نه از آتش است و نه از سرمای کشنده، بلکه عذابی است که بین آن دو از مجاورت هر یک با دیگری متولد می‌شود. پس از آمیزش آن دو، حالت سومی متولد می‌شود که عین هیچ یک از آن دو نیست. آن حالت حادث، همان عذابی است که پوست‌ها در جهنم به واسطه آن پخته می‌شوند. و علم تبدیل آنها از کدام حضور تبدیل می‌شود. و این مشهدی عظیم است، زیرا نص بر تبدیل در مورد پوست‌ها و آسمان‌ها و زمین وارد شده است، اما آن را از خلق نفی کرده و فرموده است: **لَا تَبْدِيلَ لِخَلْقِ اللَّهِ** (در آفرینش خدا تبدیلی نیست). و آن را از قول الهی نفی کرده و فرموده است: **مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ** (سخن نزد من تبدیل نمی‌شود) و فرموده است: **لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ** (در کلمات خدا تبدیلی نیست). همه اینها را این خزینه در بر دارد.\n\nسپس به خزینه سوم آمدم. دیدم که بر آن شش قفل است که شباهتی به قفل‌های خزینه‌ای داشت که از آن به اینجا خارج شدم. قفل دوم کلیدی نداشت. و قفل اول دو کلید داشت. و قفل سوم سه کلید داشت. و قفل چهارم و پنجم هر کدام یک کلید داشتند. و قفل ششم دو کلید داشت. این کلیدها شامل هزار و صد و سی و هفت حرکت بودند. پس آنها را با اسم و کلیدها باز کردم. ناگهان در آن صور علوم ارتقاءها و معراج‌ها و معرفت روزی را دیدم که **مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ** (اندازه آن پنجاه هزار سال است)، اما اگر ارتقاءها و معراج‌ها از مریدان باشد نه از مرادان، پس از شوق و مجاهده و ریاضت و مکابده خواهد بود.\n\nسپس به خانه چهارم آمدم و وارد آن شدم. ناگهان در آن سه خزینه بود. خزینه اول بر آن هفت قفل بود. قفل دوم آن کلیدی نداشت. و قفل اول یک کلید داشت که شش حرکت داشت. و کلید قفل سوم شامل چهل حرکت بود. و بقیه قفل‌ها شامل ششصد و شش حرکت بودند. پس مجموع حرکات کلیدهای آن ششصد و دو حرکت بود. پس آن را باز کردم. ناگهان در آن علم نکاح و چگونگی همراهی انسان با همسرش را دیدم، اگر او را در طاعت پروردگارش یاری نکند. و بر قول او توقف می‌کند که: **وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ** (و بر گناه و تجاوز همکاری نکنید). و اینکه آیا انسان در عبادت پروردگارش در وضو گرفتن، از دیگری برای ریختن آب بر او هنگام وضو گرفتن کمک بگیرد؟ زیرا برخی از علما آن را مکروه دانسته‌اند. و نفیس ابن وهبان سلمی در واقعه خود کراهت آن را از پیامبر صلی الله علیه و سلم دیده و به من خبر داده است. پس از این خزینه است که این امر دانسته می‌شود.\n\nسپس به خزینه دوم آمدم. دیدم که بر آن پنج قفل است. قفل دوم آن دو لایه (مطبق) بود. و قفل سوم کلیدی نداشت. و اولی یک کلید داشت، و همچنین دومی و پنجمی. اما چهارمی سه کلید داشت. این کلیدها شامل چهارصد و هفتاد و هشت حرکت بودند. پس آن را باز کردم. ناگهان دیدم که با خزینه قبلی تناسب دارد و بر آن اموری افزوده است که در آن نبود. سپس به خزینه سوم آمدم. دیدم که بر آن پنج قفل است. قفل اول کلیدی نداشت. و دوم و سوم و چهارم هر کدام یک کلید داشتند. و پنجمی دو کلید داشت. این کلیدها شامل چهل و شش حرکت بودند. پس آن را باز کردم. ناگهان معرفت سنگ‌هایی را دیدم که آتش در آخرت با آنها افروخته می‌شود، و اینکه چگونه سنگ‌ها سوختن را می‌پذیرند در حالی که خشک هستند، و خشک در علم طبایع (علم الطبائع) سوختن را نمی‌پذیرد. و آیا جایز است که آنچه طبعی به آن امر شده، با باقی ماندن عین و ذاتش، طبعش از آن زائل شود؟ زیرا در این علم بسیاری از کسانی که آن را اثبات کردند یا نفی نمودند، لغزیدند و جاهل شدند. و هر دو روش ناپسند و ناصحیح هستند. و هر یک از آنها آن را از غیر وجه صحیح اثبات کرد و از غیر وجه صحیح نفی نمود. خدای تعالی فرمود: **يَا نَارُ كُونِي بَرْداً** (ای آتش، سرد باش) و مانند این.\n\nسپس به خانه پنجم آمدم. در آن سه خزینه دیدم. خزینه اول بر آن هفت قفل بود. قفل اول و دوم و سوم و چهارم هر کدام دو کلید داشتند. و پنجم و ششم هر کدام یک کلید داشتند. و هفتمی کلیدی نداشت. این کلیدها شامل صد و سیزده حرکت بودند. پس آن را باز کردم. ناگهان در آن علوم حس و محسوس (علوم الحس والمحسوس)، و خیال و متخیَّل (الخيال والمتخيل)، و فکر و آنچه در آن فکر می‌شود، و حافظ و محفوظ، و عقل و معقول، و تمام قوایی که علوم با آنها درک می‌شوند، و معرفت جماعت‌ها و انوار و استشرافات، و مجاری ارواح در راه‌های آسمان‌ها، و مجاری طبیعت در حیوانات و نباتات و جمادات، و آنچه عالم انفاس به آن اختصاص دارد از علوم، را دیدم. و بر نفس رحمان (نفس الرحمن) که از سمت یمن به رسول خدا صلی الله علیه و سلم آمد، توقف می‌کند.\n\nسپس به خزینه دوم آمدم. دیدم که بر آن سه قفل است. بر اول و سوم هر کدام یک کلید، و بر دومی دو کلید بود. این کلیدها شامل چهل حرکت بودند. پس آن را باز کردم. ناگهان در آن علم اسباب عامه (علم الأسباب العامة) در هستی (الوجود) و اسباب خاص اهل خدا، و اسباب نزول منسوب به خدا که بر آنها اعتماد می‌شود و کسی که بر آنها اعتماد کند به خدا می‌رسد، و طرد کسی که آنها را ترک کند از درگاه خدا و از سعادتش، را دیدم. و آنها علوم شریفی هستند که بیشتر مردم نسبت به آنها زهد ورزیدند و شقی شدند، و برخی مردم آنها را به کار بردند و سعادتمند شدند. و شامل علم شرایع نازل شده (علم الشرائع المنزلة) است، نه علم شریعت حکمی (الشريعة الحكمية).\n\nسپس به خزینه سوم آمدم. دیدم که بر آن پنج قفل است. قفل اول یک کلید داشت، و همچنین بقیه قفل‌ها. و قفل‌های آن شامل چهارصد و سی و چهار حرکت بودند. پس آن را باز کردم. ناگهان در آن صور علوم درهم تنیدگی (علوم الالتفاف) را دیدم: درهم تنیدگی ارواح با اجساد، و درهم تنیدگی ارواح محبین و محبوبین، و درهم تنیدگی دو ساق، و درهم تنیدگی لام با الف، و معنای قول او: **وَالْتَفَّتِ السَّاقُ بِالسَّاقِ** (و ساق به ساق در پیچید)، و درهم تنیدگی متضایفین. و اینها همگی علوم ارتباطات هستند: رب و مربوب (رب ومربوب)، اله و مألوه (إله ومألوه)، قادر و مقدور، عالم و معلوم. پس این خزینه شامل همه علوم است.\n\nاین بود آنچه ذکر کردیم از تمام آنچه این منزل از خزینه‌های علوم در بر دارد. خدای تعالی می‌فرماید: **وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ** (و هیچ چیزی نیست مگر آنکه خزانه‌های آن نزد ماست و ما آن را جز به اندازه معلوم نازل نمی‌کنیم). جز اینکه من هنگام ورود به این منزل، یک خانه را در دهلیز (دهليز) این منزل ترک کردم که برای هر کسی باز نمی‌شود. و برای من باز شد و وارد آن شدم و آنچه در آن بود را شناختم. و آن شامل و ذخیره‌کننده تمام کلیدهای همه خزینه‌هایی است که این منازل در این کتاب در بر دارند. و شامل امور جلیلی است و برای عارف به آن، تحققی در ایجاد کائنات از آن حاصل می‌شود. و خداوند حق را می‌گوید و او راه را هدایت می‌کند. و ما بر برخی از آنچه در این منزل از علوم است، آگاه ساختیم."
  },
  "page_count": 5
}