{
  "id": 89,
  "title": {
    "ar": "الباب التاسع والثمانون في معرفة النوافل على الإطلاق",
    "en": "Chapter Eighty-Nine: Concerning the Knowledge of Supererogatory Acts (النوافل) in their Absolute Sense.",
    "ur": "انعامات (نوافل) کی مطلق معرفت میں نواسیواں باب",
    "fa": "باب هشتاد و نهم در معرفت نوافل به طور مطلق"
  },
  "content": {
    "ar": "## (الباب التاسع والثمانون في معرفة النوافل على الإطلاق)\n\n\n> إن النوافل ما يكون لعينها *** أصل يشاهد في الفرائض كلها\n\n\n> فالفرض كالأجرام إن قابلتها *** بالنور والنفل المزاد كظلها\n\n\n> بيد وبصورتها وليس فريضة *** فيعود فرضا في الحساب كمثلها\n\n\n> جاء الحديث به فبين فضلها *** شرعا وميز أصلها من أصلها\n\n\n> فإذا أتيت بهن فاعلم أنه *** ذخر الإله لكم نتيجة فعلها\n> فيكون عين قواك ربك فاغترف *** من طلها حتى تفوز بوبلها\n\n\n### [النوافل لها حكم في الحضرة الإلهية ينوب صاحبها فيه مناب الحق‏]\n\n\nاعلم أيدك الله بروح القدس أن للنوافل حكما في الحضرة الإلهية جامعا ينوب صاحبها فيه مناب الحق من ذاقه عرف قدره وعجز عما يستحقه واهبه من الشكر عليه ثم إن النوافل تتفاضل وتعلو بعلو فرائضها إذ كانت النوافل كل عمل له أصل في الفرائض عن ذلك الأصل يتولد وبصورته يظهر كما ظهرنا نحن بصورة الحق فنحن له نافلة وهو أصلنا ولهذا نقول فيه إنه واجب الوجود لنفسه ونحن واجبون به لا بأنفسنا فبهذه الدرجة يتميز عنا ونتميز عنه وما عدا النوافل فيسمى عبادة مستقلة وسننا مبتدءات نذكرها بعد هذا الباب إن شاء الله‏\n\n\n### [الصيام أعلى نوافل التنزيه في الخيرات‏]\n\n\nوإذا كانت النوافل تعلو بعلو فرائضها التي هي أصولها فأعلى نوافل التنزيه في الخيرات الصيام لأن فرضه صوم رمضان ورمضان اسم الله والصوم عبادة لا مثل لها وهو لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ففضل نوافل سائر العبادات فإنه يمنع من النكاح فله أثر فيه أي في منعه وكل من له قوة المنع فإن الممنوع متصف بالضعف بالنسبة إلى تلك القوة فإن كان لهذا الممنوع من القوة بحيث يؤثر في محل هذه العبادة حتى يزيل حكمها كان أقوى بلا شك فنافلة النكاح أقوى لما له من التأثير في إبطال الصوم والصلاة وغيرها\n\n\n### [النكاح أفضل نوافل الخيرات‏]\n\n\nوالنكاح أفضل نوافل الخيرات وله أصل وهو النكاح المفروض فما زاد عليه كان نافلة وهو على نوعين أعني وقوعه فقد يقع على نسبة المحبة مطلقة وقد يقع على نسبة محبة التوالد والتناسل فإذا وقع عن محبة التوالد والتناسل التحق بالحب الإلهي ولا عالم فأحب أن يعرف فتوجه بالإرادة لهذه المحبة على الأشياء في حال عدمها القائمة في استعداد إمكانها مقام الأصل فقال لها كن فكانت ليعرف بجميع وجوه المعارف وهي المعرفة المحدثة التي لم يكن تعلق لها به إذ لم يكن العارف بها متصفا بالوجود وذلك محبة طلب كمال المعرفة وكمال الوجود فما كمل الوجود ولا المعرفة إلا بالعالم ولا ظهر العالم إلا عن هذا التوجه الإلهي على شيئية أعيان الممكنات بطريق المحبة للكمال الوجودي في الأعيان والمعارف وهي حال تشبه النكاح للتوالد فكان النكاح المفروض أفضل الفرائض ونافلته أفضل نوافل الخيرات ولاشتراك غيره من العبادات في اسم النوافل نال من استعملها على اختلاف أنواعها منا لها والأصل نوافل النكاح لأن العمل إذا أنتج ما لم يكن له عين قبل ذلك فذلك من حكم النكاح وما من عمل إلا وهو منتج بحسب حقيقته وطريقته فكان النكاح أصل في الأشياء كلها فله الإحاطة والفضل والتقدم وقال أبو حنيفة في النكاح إنه أفضل نوافل الخيرات ولقد قال حقا أو صادف حقا\n\n\nكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حبب إليه النساء وكان أكثر الأنبياء نكاحا\n\n\nلما فيه من التحقق بالصورة التي خلق عليها ولكن لا يعلم ذلك إلا قليل من الناس من طريق الكشف بل من العارفين من أهل الله وقدم علينا بإشبيلية سنة ست وثمانين وخمسمائة أبو الحجاج يوسف الغليري من أهل غليرة وكان من أهل الأحوال فبينما هو قاعد معي إذ كشف له عن هذا المقام ممثلا فذكره لي في غلبة حاله بصورة ما رآه مما لا يمكنني ذكره فكوشف على العالم وفي أي صورة هو أبوه تعريفا من الحق فما زلت أسكنه وهو هائج حتى سكن‏\n\n\n### [وجود الحق هو الفرض ووجود العبد نافلة]\n\n\nفوجود الحق هو الفرض في نفس الأمر ووجود العبد نافلة عن ذلك الفرض ولذلك خرج على صورته‏\n\n\n### [نافلة الصلاة تنتج وجود العبد في حظه منها]\n\n\nفنافلة النكاح قد ذكرنا ما نتج منها ونافلة الصلاة تنتج وجود العبد في حظه من القسمة منه قوله قسمت الصلاة بيني وبين عبدي فيعرف من نوافل هذه الصلاة حظه من القسمة لا حظ ربه كما يعرف من فرضها حق ربه وقسمه منها ولكل حال شرب معلوم فإن الذي يعطي الفرض في عامله من الحكم خلاف الذي يعطي النفل لأنه في الفرض عبد مضطر وفي النفل عبد مخير مختار موصوف بصفة إلهية وهي المشيئة فإن شاء فعل وإن شاء لم يفعل‏\n\n\n### [نتائج نوافل الصيام والزكاة والحج والعمرة والذكر]\n\n\nونافلة الصيام ما يحصل للعبد من التنزيه في نفي المماثلة من قوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ أي ليس مثل مثله شي‏ء وما مثله إلا من خلق على صورته فنفى سبحانه أن يماثل هذا المثل فهو أحق أن لا يماثل وما له من الصورة إلا الاسم خاصة فإن العالم كما أعطاه الله اسم الوجود الذي هو له تعالى حقيقة أعطاه العالم باستعداده وكونه مظهرا لِلَّهِ الْأَسْماءُ الْحُسْنى‏ ما علمنا منها وما لم نعلم فهذا كونه على صورته ونافلة الزكاة أعطت في الإنسان البركة وهي الزيادة التي حصلت له على ما أعطته الفريضة لا غير ونافلة الحج أعطت له القصد بظهور الكون في الأطوار المختلفة مع أحدية التوجه ونافلة العمرة أعطته الدخول عليه تعالى في كل عبادة بين طرفي تحليل وتحريم وفيها ذوق وشرب وهما تجليان معروفان عند أهل‏\nالله ونافلة الذكر الذي فرضه لا إله إلا الله وتكبيرة الإحرام والسلام من الصلاة وشهادة التعيين وكل فرض يتعلق بالقول فإنه يعطيك نافلته والمواظبة عليه أن تقول لما تريده في الكون كُنْ فَيَكُونُ كما يعطيك الفرض أن تقول للحق تعالى افعل فيفعل‏\n\n\n### [المحبة هي ثمرة عطاء النوافل‏]\n\n\nوالباب الجامع لما يعطى جميع النوافل أن يكون الحق يحبه فأنتجت النوافل محبة الله لعبده ولكن ما كل محبة بل المحبة التي بها يكون الحق سمعك الذي تسمع به وبصرك الذي تبصر به ويديك التي تبطش بها ورجلك الذي تسعى به وهذا منعنا أن نقول في المفاضلة في الأشياء لأن العرف يعطي أن البصر أفضل من الرجل عند الجماعة وهنا قد أنزل الحق نفسه أنه بصرك الذي تبصر به ورجلك التي تسعى بها وأعطى لكل حق حقيقة منه وهو لا يفضل نفسه فإنه هو الظاهر في كل ما ذكر أنه هو كما يليق بجلاله فليس البصر بأعلى ولا أفضل من الرجل ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ فهذا قد ذكرنا ما تعطيه نوافل الخيرات على الإطلاق وعلى التقييد نافلة نافلة\n\n",
    "en": "## (Chapter Eighty-Nine: Concerning the Knowledge of Supererogatory Acts in General)\n\n> Indeed, the supererogatory acts are those whose very essence\n> Has an origin witnessed in all the obligatory acts.\n>\n> The obligatory act is like the bodies when you compare them\n> To the light, and the added supererogatory act is like their shadow.\n>\n> Yet it is in its form, though it is not an obligatory act,\n> So it returns as an obligatory act in the reckoning, like its counterpart.\n>\n> The Hadith came concerning it, clarifying its merit legally,\n> And distinguishing its origin from its origin.\n>\n> So when you perform them, know that it is\n> The treasure of the God for you, the result of your action.\n>\n> Your Lord becomes the very essence of your powers, so scoop up\n> From its dew until you attain its downpour.\n\n### [Supererogatory Acts Possess a Ruling in the Divine Presence Wherein Their Practitioner Acts as the Deputy of The Real]\n\nKnow, may Allah support you with the Holy Spirit, that supererogatory acts (*Nawafil*) possess a comprehensive ruling in the Divine Presence (الحضرة الإلهية) wherein their practitioner acts as the deputy of The Real (الحق). Whoever tastes this knows its worth, yet is incapable of offering the gratitude due to its Giver. Furthermore, supererogatory acts vary in merit and ascend according to the elevation of their obligatory counterparts (*Fara'id*), since the supererogatory act is every deed that has an origin in the obligatory acts, from which origin it is generated and in whose form it appears.\n\nJust as we appeared in the form of The Real (الحق), we are a supererogatory act for Him, and He is our origin. For this reason, we say concerning Him that He is Necessary Existence (واجب الوجود) by Himself, while we are necessary by Him, not by ourselves. By this degree, He is distinguished from us, and we are distinguished from Him. What is other than the supererogatory acts is called independent worship and newly initiated practices, which we shall mention after this chapter, God willing.\n\n### [Fasting is the Highest of the Supererogatory Acts of Transcendence among Good Deeds]\n\nSince supererogatory acts ascend according to the elevation of their obligatory counterparts, which are their origins, the highest of the supererogatory acts of Transcendence (التنزيه) among good deeds is fasting (الصيام). This is because its obligatory counterpart is the fast of Ramadan, and Ramadan is a Name of Allah. Fasting is a form of worship that has no likeness, and He is <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him). Thus, it surpasses the supererogatory acts of all other forms of worship.\n\nFasting prevents marriage (النكاح), so it has an effect in that—meaning, in preventing it. And whoever possesses the power of prevention, the prevented thing is characterized by weakness relative to that power. If, however, this prevented thing possesses such strength that it affects the locus of this worship, even removing its ruling, then it is undoubtedly stronger. Therefore, the supererogatory act of marriage (نافلة النكاح) is stronger due to its effect in nullifying fasting, prayer, and other acts.\n\n### [Marriage is the Best of the Supererogatory Good Deeds]\n\nMarriage (النكاح) is the best of the supererogatory good deeds. It has an origin, which is the obligatory marriage, and whatever exceeds that is supererogatory. This occurrence is of two types: it may occur based on the proportion of absolute love, or it may occur based on the proportion of love for procreation and propagation (التوالد والتناسل).\n\nWhen it occurs out of love for procreation and propagation, it joins the Divine Love: \"I was not known, so I loved to be known.\" Thus, He directed the Will (الإرادة) of this Love toward things in their state of non-existence, which stood in the station of the Origin within the readiness of their potentiality. He said to them, \"Be!\" and they were, so that He might be known through all aspects of gnosis (المعارف). This is the originated gnosis (المعرفة المحدثة) that had no relation to Him previously, since the one who knows Him was not characterized by existence (الوجود). That is the love seeking the perfection of gnosis and the perfection of Existence.\n\nNeither Existence nor gnosis was perfected except through the world (العالم), and the world did not appear except through this Divine direction toward the thingness of the Fixed Entities (الأعيان الثابتة) of the possibles, by way of love for existential perfection in the essences and in gnosis. This state resembles marriage for procreation. Thus, obligatory marriage was the best of the obligatory acts, and its supererogatory counterpart is the best of the supererogatory good deeds. Because other forms of worship share the name of supererogatory acts, those who practice them, despite their different types, attain a portion of what marriage attains.\n\nThe origin, however, is the supererogatory acts of marriage, because when an action produces something whose essence (عين) did not exist before, that falls under the ruling of marriage. There is no action except that it is productive according to its reality and method. Thus, marriage is an origin in all things; it possesses comprehensiveness, merit, and precedence. Abu Hanifa said concerning marriage that it is the best of the supererogatory good deeds, and he spoke truly or encountered the truth.\n\nThe Messenger of Allah, may Allah bless him and grant him peace, loved women and was the most married of the Prophets, due to the realization of the Form (الصورة) upon which he was created. However, only a few people know this through Unveiling (الكشف), specifically among the Gnostics (العارفين) from the People of Allah (أهل الله). In Seville, in the year 586 AH, Abu al-Hajjaj Yusuf al-Ghaliri, from the people of Ghalira, who was one of the People of Spiritual States (أهل الأحوال), came to us. While he was sitting with me, this station was unveiled to him in a represented form. He mentioned it to me during the overwhelming nature of his state, describing the image of what he saw, which I cannot mention. He was granted an unveiling concerning the world and in what form his father is, as a definition from The Real (الحق). I continued to calm him while he was agitated until he settled down.\n\n### [The Existence of The Real is the Obligatory Act, and the Existence of the Servant is a Supererogatory Act]\n\nThe Existence (الوجود) of The Real (الحق) is the obligatory act (*Fard*) in the matter itself, and the existence of the servant is a supererogatory act (*Nafila*) derived from that obligatory act. For this reason, the servant came forth upon His Form (صورته).\n\n### [The Supererogatory Act of Prayer Produces the Servant's Existence in His Portion of the Division from It]\n\nWe have already mentioned what the supererogatory act of marriage produces. The supererogatory act of prayer (الصلاة) produces the existence of the servant in his portion of the division from it, referring to the saying: \"I have divided the prayer between Myself and My servant.\" Through the supererogatory acts of this prayer, he knows his portion of the division, not the portion of his Lord, just as through its obligatory counterpart he knows the right of his Lord and his portion from it. Every state has a known spiritual drink (*Shurb*). For the ruling that the obligatory act grants to its practitioner is different from the ruling that the supererogatory act grants, because in the obligatory act, he is a compelled servant, whereas in the supererogatory act, he is a servant given choice, described by a Divine Attribute (صفة إلهية), which is the Will (المشيئة). If he wills, he acts, and if he wills, he does not act.\n\n### [The Results of the Supererogatory Acts of Fasting, Alms, Pilgrimage, Minor Pilgrimage, and Remembrance]\n\nThe supererogatory act of fasting (الصيام) results in the Transcendence (التنزيه) attained by the servant in negating likeness, derived from the saying <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him)—meaning, there is nothing like His likeness. And His likeness is none other than the one created upon His Form (صورته). Thus, the Glorified One negated that this likeness should be likened to Him, so He is more deserving of not being likened. And the servant possesses nothing of the Form (الصورة) except the Name specifically. For just as Allah granted the world (العالم) the Name of Existence (الوجود), which truly belongs to Him, He granted the world, through its readiness and its being a manifestation (مظهرا) of <<لِلَّهِ الْأَسْماءُ الْحُسْنى>> (To Allah belong the Most Beautiful Names)—those we know and those we do not know. This is its being upon His Form.\n\nThe supererogatory act of alms (الزكاة) grants the human being Blessing (البركة), which is the increase he obtains beyond what the obligatory act granted, and nothing else.\n\nThe supererogatory act of Pilgrimage (الحج) grants him Intention (القصد) through the manifestation of the Cosmos (الكون) in different stages (الأطوار المختلفة) along with the Oneness of Direction (أحدية التوجه).\n\nThe supererogatory act of the Minor Pilgrimage (العمرة) grants him entry upon Him, the Exalted, in every act of worship between the two limits of permissibility (تحليل) and prohibition (تحريم). In it is Tasting (ذوق) and Drinking (شرب), which are two Theophanies (تجليان) known to the People of Allah (أهل الله).\n\nThe supererogatory act of Remembrance (الذكر), whose obligatory counterpart is *La ilaha illa Allah* (There is no god but Allah), the opening *Takbir* (تكبيرة الإحرام) and the closing *Salam* of the prayer, and the testimony of designation (شهادة التعيين)—and every obligatory act related to speech—its supererogatory counterpart and persistence in it grants you the power to say to what you desire in the Cosmos, \"Be!\" (كُنْ) and it is (فَيَكُونُ), just as the obligatory act grants you the power to say to The Real (الحق), the Exalted, \"Act!\" and He acts.\n\n### [Love is the Fruit of the Granting of Supererogatory Acts]\n\nThe comprehensive gateway for what all supererogatory acts grant is that The Real (الحق) loves him. Thus, the supererogatory acts produce Allah’s love for His servant, but not just any love, rather the love by which The Real becomes your hearing with which you hear, your sight with which you see, your hands with which you strike, and your leg with which you walk.\n\nThis prevents us from speaking about the relative merit (المفاضلة) of things, because common understanding dictates that sight is superior to the leg among people. Yet here, The Real (الحق) has revealed Himself as your sight with which you see and your leg with which you walk, and He has given every right a reality from Himself. He does not prefer Himself over Himself, for He is the Manifest (الظاهر) in everything mentioned as being Him, as befits His Majesty. Thus, sight is neither higher nor superior to the leg, <<وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ>> (but most people do not know). We have thus mentioned what the supererogatory good deeds grant, both generally and specifically, act by act.",
    "ur": "## (باب نواسیواں: نوافل کی مطلق معرفت کے بیان میں)\n\n> بے شک نوافل وہ ہیں جن کی اصل (حقیقت)\n> تمام فرائض میں مشاہدہ کی جاتی ہے۔\n\n> پس فرض اجسام کی مانند ہے جب تم ان کا مقابلہ\n> نور سے کرو، اور زائد نفل ان کے سائے کی طرح ہے۔\n\n> لیکن اپنی صورت میں (وہ فرض نہیں)، اور نہ ہی وہ فریضہ ہے\n> مگر حساب میں وہ اسی کی مانند فرض بن جاتا ہے۔\n\n> حدیث اس کے ساتھ آئی، پس اس نے شرعاً اس کی فضیلت بیان کی\n> اور اس کی اصل کو اس کی اصل سے ممتاز کیا۔\n\n> پس جب تم انہیں بجا لاؤ تو جان لو کہ\n> یہ تمہارے لیے اللہ کا ذخیرہ ہے، تمہارے عمل کا نتیجہ ہے۔\n\n> پس تمہارا رب تمہاری قوتوں کی عین (حقیقت) بن جاتا ہے، پس اس کی شبنم سے چلو بھر لو\n> تاکہ تم اس کی موسلادھار بارش سے کامیاب ہو جاؤ۔\n\n### [نوافل کا حضرتِ الٰہیہ میں ایک ایسا حکم ہے جس میں اس کا حامل الحق (ذات حق) کا نائب بن جاتا ہے]\n\nجان لو، اللہ تمہیں روح القدس سے تائید بخشے، کہ نوافل کا حضرتِ الٰہیہ (الحضرة الإلهية) میں ایک جامع حکم ہے جس میں اس کا حامل الحق (ذات حق) کا نائب بن جاتا ہے۔ جس نے اس کا ذائقہ چکھا، اس نے اس کی قدر پہچانی اور اس پر اپنے عطا کرنے والے کے شکر کا حق ادا کرنے سے عاجز رہا۔\n\nپھر یہ کہ نوافل اپنی فرائض کی بلندی کے ساتھ بلند ہوتے ہیں، کیونکہ نوافل ہر وہ عمل ہے جس کی اصل فرائض میں موجود ہو، اور وہ اسی اصل سے پیدا ہوتا ہے اور اسی کی صورت میں ظاہر ہوتا ہے، جیسا کہ ہم الحق (ذات حق) کی صورت میں ظاہر ہوئے ہیں۔ پس ہم اس کے لیے نافلہ ہیں اور وہ ہماری اصل ہے۔ اسی لیے ہم اس کے بارے میں کہتے ہیں کہ وہ واجب الوجود (الوجود) لذاتہ ہے، اور ہم اس کے ذریعے واجب ہیں نہ کہ اپنی ذات سے۔ پس اس درجے کے ذریعے وہ ہم سے ممتاز ہوتا ہے اور ہم اس سے ممتاز ہوتے ہیں۔ اور جو نوافل کے علاوہ ہیں، وہ مستقل عبادت یا ابتدائی سنتیں کہلاتی ہیں، جن کا ذکر ہم ان شاء اللہ اس باب کے بعد کریں گے۔\n\n### [روزہ خیرات میں تنزیہ کے نوافل میں سب سے اعلیٰ ہے]\n\nاور جب نوافل اپنی فرائض کی بلندی کے ساتھ بلند ہوتے ہیں جو ان کی اصول ہیں، تو خیرات میں تنزیہ (التنزيه) کے نوافل میں سب سے اعلیٰ روزہ (صوم) ہے، کیونکہ اس کا فرض رمضان کا روزہ ہے، اور رمضان اللہ کا نام ہے۔ اور روزہ ایک ایسی عبادت ہے جس کی کوئی مثال نہیں، اور وہ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس کی مانند کوئی چیز نہیں ہے)۔ پس یہ دیگر عبادات کے نوافل سے افضل ہے۔\n\nکیونکہ یہ نکاح سے روکتا ہے، پس اس میں یعنی نکاح کو روکنے میں اس کا اثر ہے۔ اور جس میں بھی روکنے کی قوت ہو، تو ممنوع اس قوت کے مقابلے میں ضعف سے متصف ہوتا ہے۔ لیکن اگر اس ممنوع میں اتنی قوت ہو کہ وہ اس عبادت کے محل پر اثر انداز ہو کر اس کے حکم کو زائل کر دے، تو وہ بلاشبہ زیادہ قوی ہوگا۔ پس نکاح کا نافلہ زیادہ قوی ہے، کیونکہ اس میں روزہ اور نماز وغیرہ کو باطل کرنے کا اثر ہے۔\n\n### [نکاح افضل نوافل خیرات ہے]\n\nاور نکاح خیرات کے نوافل میں سب سے افضل ہے، اور اس کی ایک اصل ہے جو فرض نکاح ہے، پس جو اس پر زائد ہو وہ نافلہ ہے۔ اور یہ (یعنی اس کا وقوع) دو قسموں پر ہے: یا تو یہ مطلق محبت کی نسبت سے واقع ہوتا ہے، یا پھر توالد اور تناسل (نسل بڑھانے) کی محبت کی نسبت سے واقع ہوتا ہے۔\n\nپس جب یہ توالد اور تناسل کی محبت سے واقع ہوتا، تو یہ حبِ الٰہی سے ملحق ہو جاتا ہے: \"اور کوئی عالم نہ تھا، پس اس نے چاہا کہ وہ پہچانا جائے\"۔ پس اس نے اس محبت کے لیے ارادے کے ساتھ اشیاء کی طرف توجہ کی، جبکہ وہ عدم کی حالت میں تھیں اور اپنے امکانی استعداد میں اصل کے مقام پر قائم تھیں۔ پس اس نے ان سے کہا: \"کُنْ\" (ہو جا)، تو وہ ہو گئیں، تاکہ وہ تمام وجوہ المعارف (المعرفۃ) کے ذریعے پہچانا جائے، اور یہ وہ محدث معرفت ہے جس کا اس سے کوئی تعلق نہ تھا، کیونکہ اس کا عارف الوجود (ہستی) سے متصف نہ تھا۔ اور یہ کمالِ المعرفۃ (معرفت) اور کمالِ الوجود (ہستی) کے طلب کی محبت ہے۔ پس نہ الوجود (ہستی) کامل ہوا اور نہ المعرفۃ (معرفت) کامل ہوئی مگر عالم کے ذریعے، اور عالم ظاہر نہ ہوا مگر ممکنات کے اعیان کی شیئیت پر اس الٰہی توجہ کے ذریعے، جو اعیان اور معارف میں کمالِ وجودی کی محبت کے طریقے پر تھی۔ اور یہ حالت توالد کے لیے نکاح سے مشابہت رکھتی ہے۔\n\nپس فرض نکاح افضل الفرائض ہوا، اور اس کا نافلہ افضل نوافلِ خیرات ہوا۔ اور چونکہ دیگر عبادات بھی نوافل کے نام میں شریک ہیں، اس لیے جس نے بھی انہیں مختلف انواع کے ساتھ استعمال کیا، اس نے ان میں سے حصہ پایا۔ اور اصل نکاح کے نوافل ہیں، کیونکہ جب کوئی عمل ایسی چیز پیدا کرے جس کا وجود اس سے پہلے نہ ہو، تو یہ نکاح کے حکم میں سے ہے۔ اور کوئی عمل ایسا نہیں جو اپنی حقیقت اور طریقے کے مطابق نتیجہ خیز نہ ہو، پس نکاح تمام اشیاء میں اصل ہے، لہٰذا اسے احاطہ، فضیلت اور تقدم حاصل ہے۔ اور امام ابو حنیفہ نے نکاح کے بارے میں کہا کہ یہ افضل نوافلِ خیرات ہے، اور انہوں نے یقیناً حق کہا یا حق کو پا لیا۔\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کو عورتیں محبوب بنائی گئیں اور آپ صلی اللہ علیہ وسلم تمام انبیاء میں سب سے زیادہ نکاح کرنے والے تھے۔\n\nیہ اس صورت کے ساتھ متحقق ہونے کی وجہ سے ہے جس پر وہ (انسان) پیدا کیا گیا ہے، لیکن یہ بات الکشف (کشف) کے ذریعے بہت کم لوگ جانتے ہیں، بلکہ اہل اللہ میں سے صرف عارفین جانتے ہیں۔ اور ۵۸۶ھ میں ابو الحجاج یوسف الغلیری، جو غلیرہ کے رہنے والے اور اہل احوال میں سے تھے، اشبیلیہ میں ہمارے پاس آئے۔ جب وہ میرے ساتھ بیٹھے تھے، تو ان کے لیے اس مقام کا تمثیلی الکشف (کشف) ہوا، پس انہوں نے مجھے اپنے حال کے غلبے میں اس صورت میں ذکر کیا جو انہوں نے دیکھا، اور جسے میں بیان نہیں کر سکتا۔ انہیں عالم کے بارے میں الکشف (کشف) ہوا کہ وہ کس صورت میں ہے، اور وہ صورت ان کے والد کی تھی، جو الحق (ذات حق) کی طرف سے ایک تعریف تھی۔ میں انہیں پرسکون کرتا رہا جبکہ وہ ہیجان میں تھے، یہاں تک کہ وہ پرسکون ہو گئے۔\n\n### [الحق (ذات حق) کا الوجود (ہستی) فرض ہے اور بندے کا الوجود (ہستی) نافلہ ہے]\n\nپس نفسِ امر میں الحق (ذات حق) کا الوجود (ہستی) فرض ہے، اور بندے کا الوجود (ہستی) اس فرض سے نافلہ ہے، اور اسی لیے وہ اس کی صورت پر ظاہر ہوا۔\n\n### [نماز کا نافلہ بندے کے وجود کو اس کے حصے میں پیدا کرتا ہے]\n\nپس نکاح کے نافلے سے جو نتیجہ نکلتا ہے وہ ہم بیان کر چکے ہیں۔ اور نماز کا نافلہ بندے کے الوجود (ہستی) کو اس کے حصے میں پیدا کرتا ہے، جیسا کہ اس کے قول میں ہے: \"میں نے نماز کو اپنے اور اپنے بندے کے درمیان تقسیم کر دیا\"۔ پس وہ اس نماز کے نوافل سے اپنے حصے کو جانتا ہے، نہ کہ اپنے رب کے حصے کو، جیسا کہ وہ اس کے فرض سے اپنے رب کا حق اور اس میں سے اپنا حصہ جانتا ہے۔ اور ہر حال کے لیے ایک معلوم شرب (حصہ) ہے۔ کیونکہ جو حکم فرض اپنے عامل کو دیتا ہے، وہ اس حکم سے مختلف ہے جو نفل دیتا ہے، اس لیے کہ فرض میں بندہ مضطر (مجبور) ہوتا ہے، اور نفل میں بندہ مخیر (اختیار والا) ہوتا ہے، جو ایک الٰہی صفت یعنی مشیئت (ارادہ) سے متصف ہوتا ہے، اگر چاہے تو کرے اور اگر چاہے تو نہ کرے۔\n\n### [روزہ، زکوٰۃ، حج، عمرہ اور ذکر کے نوافل کے نتائج]\n\nاور روزے کا نافلہ وہ ہے جو بندے کو مماثلت کی نفی میں تنزیہ (التنزيه) سے حاصل ہوتا ہے، اس کے قول سے: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس کی مانند کوئی چیز نہیں ہے)، یعنی اس کے مثل کے مثل کوئی چیز نہیں ہے۔ اور اس کا مثل صرف وہی ہے جو اس کی صورت پر پیدا کیا گیا ہے۔ پس اللہ سبحانہ نے اس مثل کے مماثل ہونے کی نفی کی، لہٰذا وہ خود زیادہ حقدار ہے کہ اس کی مماثلت نہ کی جائے۔ اور اس صورت میں اس کے لیے صرف نام ہی ہے، کیونکہ عالم کو جس طرح اللہ نے الوجود (ہستی) کا نام دیا جو حقیقت میں صرف اسی کا ہے، اسی طرح عالم کو اس کے استعداد اور اس کے لِلَّهِ الْأَسْماءُ الْحُسْنى‏ (اللہ ہی کے لیے اچھے نام ہیں) کا مظہر ہونے کی وجہ سے وہ نام دیے جو ہم جانتے ہیں اور جو نہیں جانتے۔ پس یہی اس کا اس کی صورت پر ہونا ہے۔\n\nاور زکوٰۃ کے نافلے نے انسان میں برکت عطا کی، اور وہ وہ زیادتی ہے جو اسے فرض کے عطا کردہ حصے کے علاوہ حاصل ہوئی۔\n\nاور حج کے نافلے نے اسے مختلف اطوار میں کائنات کے ظہور کے ساتھ، توجہ کی احدیت (یکسوئی) عطا کی۔\n\nاور عمرے کے نافلے نے اسے ہر عبادت میں تحلیل (حلال کرنا) اور تحریم (حرام کرنا) کے دو کناروں کے درمیان اللہ تعالیٰ پر داخلہ عطا کیا، اور اس میں ذوق اور شرب (پینا) ہے، اور یہ دونوں اہل اللہ کے ہاں معروف دو التجلی (ظہور الٰہی) ہیں۔\n\nاور ذکر کا نافلہ، جس کا فرض لَا إِلٰهَ إِلَّا اللّٰهُ ہے، اور نماز کی تکبیرِ تحریمہ، اور سلام، اور تعیین کی شہادت، اور ہر وہ فرض جو قول سے متعلق ہے، اس کا نافلہ اور اس پر مواظبت تمہیں یہ عطا کرتی ہے کہ تم کائنات میں جس چیز کا ارادہ کرو اسے \"کُنْ\" (ہو جا) کہو تو وہ فَيَكُونُ (ہو جاتی ہے)، جیسا کہ فرض تمہیں یہ عطا کرتا ہے کہ تم الحق (ذات حق) سے کہو \"افعل\" (کر دے) تو وہ کر دیتا ہے۔\n\n### [محبت نوافل کے عطاء کا ثمر ہے]\n\nاور وہ جامع باب جو تمام نوافل عطا کرتے ہیں، وہ یہ ہے کہ الحق (ذات حق) اس سے محبت کرے۔ پس نوافل نے اللہ کی اپنے بندے سے محبت کو پیدا کیا، لیکن ہر محبت نہیں، بلکہ وہ محبت جس کے ذریعے الحق (ذات حق) تمہارا کان بن جاتا ہے جس سے تم سنتے ہو، اور تمہاری آنکھ بن جاتا ہے جس سے تم دیکھتے ہو، اور تمہارے ہاتھ بن جاتا ہے جس سے تم پکڑتے ہو، اور تمہارا پاؤں بن جاتا ہے جس سے تم چلتے ہو۔\n\nاور یہ چیز ہمیں اشیاء میں فضیلت بیان کرنے سے روکتی ہے، کیونکہ عرف عام لوگوں کے نزدیک یہ بتاتا ہے کہ آنکھ پاؤں سے افضل ہے، جبکہ یہاں الحق (ذات حق) نے خود کو تمہاری آنکھ قرار دیا جس سے تم دیکھتے ہو، اور تمہارا پاؤں قرار دیا جس سے تم چلتے ہو۔ اور اس نے ہر حق کو اپنی طرف سے ایک حقیقت عطا کی، اور وہ خود کو افضل قرار نہیں دیتا، کیونکہ وہ ان تمام مذکورہ چیزوں میں ظاہر ہے کہ وہ وہی ہے جیسا کہ اس کی جلالت کے لائق ہے۔ پس نہ آنکھ پاؤں سے اعلیٰ ہے اور نہ افضل، وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (لیکن اکثر لوگ نہیں جانتے)۔ پس یہ ہم نے بیان کر دیا جو نوافلِ خیرات مطلقاً اور مقیداً، ایک ایک نافلے کے اعتبار سے عطا کرتے ہیں۔",
    "fa": "## (باب هشتاد و نهم در معرفت نوافل به طور مطلق)\n\nنوافل (نوافل) آن است که عین آن را *** اصلی است که در همه فرایض (فرائض) دیده می‌شود\n\nفرض همچون اجرام است اگر آن را *** با نور بسنجی، و نفل (نوافل) افزوده چون سایه آن است\n\nاما به عین صورت آن است و فریضه نیست *** پس در حساب، مانند آن، فرض می‌شود\n\nحدیث (الحدیث) در مورد آن آمده و فضیلت آن را *** از نظر شرع بیان کرده و اصل آن را از اصلش متمایز ساخته است\n\nپس اگر به آنها عمل کردی، بدان که *** ذخیره الهی برای شما نتیجه عمل آن است\n\nپس پروردگارت عین قوای تو خواهد بود، پس از شبنم آن *** برگیر تا به باران سیل‌آسای آن دست یابی.\n\n### [نوافل در حضرت الهی حکمی دارد که صاحبش در آن جانشین حق می‌شود]\n\nبدان، خداوند تو را به روح القدس تأیید کند، که نوافل (نوافل) در حضرت الهی (الحضرة الإلهية) حکمی جامع دارد که صاحب آن در آن مقام، جانشین حق (الحق) می‌شود. هر کس آن را بچشد، قدرش را می‌شناسد و از شکر آنچه واهب آن (خداوند) سزاوار است، عاجز می‌ماند. سپس، نوافل (نوافل) به واسطه علو فرایض (فرائض) خود، که اصول آنها هستند، برتری می‌یابند و بالا می‌روند. زیرا نوافل (نوافل) هر عملی است که اصلی در فرایض (فرائض) دارد و از آن اصل متولد می‌شود و به صورت آن ظاهر می‌گردد. همان‌گونه که ما به صورت حق (الحق) ظاهر شدیم، پس ما برای او نافله‌ایم و او اصل ماست. به همین دلیل، درباره او می‌گوییم که واجب الوجود (واجب الوجود) بالذات است و ما به واسطه او واجبیم، نه به واسطه خودمان. پس به این درجه، او از ما متمایز می‌شود و ما از او متمایز می‌شویم. و آنچه غیر از نوافل (نوافل) باشد، عبادت مستقل و سنت‌های آغازین نامیده می‌شود که ان‌شاءالله پس از این باب ذکر خواهیم کرد.\n\n### [روزه بالاترین نوافل تنزیه در خیرات است]\n\nو چون نوافل (نوافل) به واسطه علو فرایض (فرائض) خود که اصول آنها هستند، بالا می‌روند، پس بالاترین نوافل (نوافل) تنزیه (التنزيه) در خیرات، روزه (الصيام) است. زیرا فرض آن، روزه رمضان است و رمضان اسم خداست. و روزه عبادتی است که نظیر ندارد و او «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست). پس بر نوافل (نوافل) سایر عبادات برتری دارد. زیرا از ازدواج (النکاح) منع می‌کند، پس در منع آن اثری دارد. و هر کس که قدرت منع داشته باشد، ممنوع نسبت به آن قدرت، متصف به ضعف است. اگر این ممنوع از چنان قدرتی برخوردار باشد که در محل این عبادت تأثیر کند تا حکم آن را از بین ببرد، بدون شک قوی‌تر است. پس نافله (نافلة) نکاح (النکاح) قوی‌تر است، به دلیل تأثیری که در باطل کردن روزه و نماز و غیره دارد.\n\n### [نکاح بهترین نوافل خیرات است]\n\nو نکاح (النکاح) بهترین نوافل (نوافل) خیرات است و اصلی دارد که همان نکاح (النکاح) مفروض است. پس آنچه بر آن افزوده شود، نافله (نافلة) است. و آن بر دو نوع است، یعنی وقوع آن: گاهی بر نسبت محبت مطلق واقع می‌شود و گاهی بر نسبت محبت توالد و تناسل. پس اگر از روی محبت توالد و تناسل واقع شود، به حب الهی (الحب الإلهي) ملحق می‌شود. و عالمی نبود، پس دوست داشت که شناخته شود. پس با اراده، به این محبت بر اشیاء در حال عدمشان که در استعداد امکانشان مقام اصل را دارند، توجه کرد و به آنها گفت: «باش»، پس بودند. تا به همه وجوه معارف (المعارف) شناخته شود. و آن، معرفت (المعرفة) حادثی است که پیش از آن تعلقی به او نداشت، زیرا عارف به آن متصف به هستی (الوجود) نبود. و آن، محبت طلب کمال معرفت (المعرفة) و کمال هستی (الوجود) است. پس هستی (الوجود) و معرفت (المعرفة) جز به واسطه عالم کامل نشد و عالم جز از این توجه الهی بر شیئیت اعیان ممکنات، از طریق محبت برای کمال وجودی (الوجودي) در اعیان و معارف (المعارف)، ظاهر نشد. و این حالی است که شبیه نکاح (النکاح) برای توالد است. پس نکاح (النکاح) مفروض، بهترین فرایض (الفرائض) بود و نافله (نافلة) آن، بهترین نوافل (نوافل) خیرات است. و به دلیل اشتراک سایر عبادات در نام نوافل (النوافل)، کسی که آنها را با انواع مختلف به کار می‌برد، بهره‌ای از آن می‌برد. و اصل، نوافل (نوافل) نکاح (النکاح) است. زیرا اگر عملی چیزی را تولید کند که پیش از آن عینی نداشته است، این از حکم نکاح (النکاح) است. و هیچ عملی نیست مگر اینکه بر حسب حقیقت و طریقه خود، تولیدکننده است. پس نکاح (النکاح) در همه چیز اصل بود، از این رو احاطه، فضیلت و تقدم از آن اوست. و ابوحنیفه درباره نکاح (النکاح) گفت که بهترین نوافل (نوافل) خیرات است. و او حق گفت یا به حق رسید.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) زنان را دوست می‌داشت و بیشترین ازدواج را در میان انبیا داشت.\n\nبه دلیل تحقق یافتن به صورتی که بر آن خلق شده است. اما این را جز اندکی از مردم، از طریق کشف (الکشف)، بلکه از عارفان (العارفين) اهل الله، نمی‌دانند. و در سال پانصد و هشتاد و شش (۵۸۶ق)، ابوالحجاج یوسف الغلیری از اهل غلیره که از اهل احوال بود، به اشبیلیه نزد ما آمد. در حالی که نزد من نشسته بود، این مقام برای او به صورت تمثیلی کشف (کشف) شد. او در غلبه حالش، آن را به صورتی که دیده بود برای من ذکر کرد که ذکر آن برای من ممکن نیست. پس بر عالم و اینکه در چه صورتی است، کشف (کشف) شد، که حق (الحق) او را به پدرش معرفی کرد. من پیوسته او را آرام می‌کردم در حالی که در هیجان بود، تا اینکه آرام گرفت.\n\n### [هستی حق فرض است و هستی بنده نافله]\n\nپس هستی (الوجود) حق (الحق) در نفس الامر، فرض است و هستی (الوجود) بنده، نافله (نافلة) از آن فرض است. به همین دلیل بر صورت او خارج شد.\n\n### [نافله نماز هستی بنده را در بهره‌اش از آن تولید می‌کند]\n\nنافله (نافلة) نکاح (النکاح) را ذکر کردیم که چه چیزی از آن حاصل می‌شود. و نافله (نافلة) نماز، هستی (الوجود) بنده را در بهره‌اش از قسمت آن تولید می‌کند. [اشاره به] قول او (خداوند): «نماز را میان خود و بنده‌ام تقسیم کردم». پس از نوافل (نوافل) این نماز، بهره خود را از قسمت می‌شناسد، نه بهره پروردگارش را. همان‌گونه که از فرض آن، حق پروردگارش و سهم او را از آن می‌شناسد. و برای هر حال، شرب (نوشیدنی) معلومی است. زیرا آنچه فرض در عامل خود از حکم می‌دهد، خلاف چیزی است که نفل (النفل) می‌دهد. چون در فرض، بنده مضطر است و در نفل (النفل)، بنده مخیر و مختار است که به صفتی الهی (إلهية) متصف است و آن مشیئت است؛ اگر بخواهد انجام می‌دهد و اگر نخواهد انجام نمی‌دهد.\n\n### [نتایج نوافل روزه، زکات، حج، عمره و ذکر]\n\nو نافله (نافلة) روزه (الصيام)، تنزیهی است که برای بنده در نفی مماثلت حاصل می‌شود، از قول او: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست). یعنی: چیزی مانند مثل او نیست. و مثل او نیست مگر کسی که بر صورت او خلق شده است. پس او (سبحانه) مماثلت این مثل را نفی کرد. پس او سزاوارتر است که مماثل نداشته باشد. و از آن صورت، جز نام خاصی برای او نیست. زیرا همان‌گونه که خداوند اسم هستی (الوجود) را که حقیقتاً از آن اوست، به او (عالم) عطا کرد، عالم نیز به واسطه استعداد خود و به دلیل اینکه مظهر «لِلَّهِ الْأَسْماءُ الْحُسْنى‏» (برای خداست نام‌های نیکو) است، آنچه را که ما از آن می‌دانیم و آنچه را که نمی‌دانیم، به او عطا کرد. این است بودن او بر صورت حق (الحق). و نافله (نافلة) زکات، برکت را در انسان بخشید، که همان افزایشی است که علاوه بر آنچه فریضه (الفريضة) به او داده است، برایش حاصل می‌شود و نه غیر آن. و نافله (نافلة) حج، قصد را به او بخشید، با ظهور کون (الکون) در اطوار مختلف همراه با احدیت توجه. و نافله (نافلة) عمره، ورود بر او تعالی را در هر عبادتی میان دو طرف تحلیل و تحریم به او بخشید. و در آن ذوق و شرب است، و آن دو، دو تجلی (تجلیان) شناخته شده نزد اهل الله هستند. و نافله (نافلة) ذکر (الذکر) که فرض آن «لا إله إلا الله» و تکبیرة الاحرام و سلام از نماز و شهادت تعیین است، و هر فرضی که به قول تعلق دارد، نافله (نافلة) آن و مداومت بر آن را به تو می‌دهد که به آنچه در کون (الکون) اراده می‌کنی، بگویی: «كُنْ فَيَكُونُ» (باش، پس می‌شود). همان‌گونه که فرض به تو می‌دهد که به حق (الحق) تعالی بگویی: «انجام بده»، پس انجام می‌دهد.\n\n### [محبت ثمره عطای نوافل است]\n\nو باب جامعی که همه نوافل (النوافل) می‌بخشند، این است که حق (الحق) او را دوست بدارد. پس نوافل (النوافل)، محبت خدا به بنده‌اش را تولید کردند. اما نه هر محبتی، بلکه محبتی که به واسطه آن، حق (الحق) گوش تو باشد که با آن می‌شنوی، و چشم تو باشد که با آن می‌بینی، و دستانت باشد که با آن می‌گیری، و پایت باشد که با آن راه می‌روی. و این ما را از اینکه در مورد برتری دادن (المفاضلة) در اشیاء سخن بگوییم، باز داشت. زیرا عرف نزد عموم، این را می‌رساند که چشم از پا برتر است. و در اینجا، حق (الحق) خود را نازل کرده است که چشم توست که با آن می‌بینی و پای توست که با آن راه می‌روی. و به هر حقی، حقیقتی از خود عطا کرده است و او خود را برتری نمی‌دهد. زیرا اوست که در هر آنچه ذکر شد، آن‌گونه که شایسته جلال اوست، ظاهر است. پس چشم برتر و افضل از پا نیست، «وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ» (اما بیشتر مردم نمی‌دانند). پس این بود آنچه ذکر کردیم که نوافل (نوافل) خیرات به طور مطلق و به طور مقید، نافله (نافلة) به نافله (نافلة)، می‌بخشند."
  },
  "page_count": 3
}