{
  "id": 429,
  "title": {
    "ar": "الباب التاسع والعشرون وأربعمائة في معرفة منازلة من تصاغر لجلالى نزلت إليه ومن تعاظم علي تعاظمت عليه",
    "en": "Chapter Four Hundred and Twenty-Nine: Concerning the knowledge of the manner of dealing with him who humbles himself before My Majesty, to whom I descend; and him who acts arrogantly against Me, against whom I act in Majesty.",
    "ur": "باب چار سو انتیس: ان منازل کی معرفت میں جو اس شخص کے لیے ہیں جس نے میرے جلال کے سامنے عاجزی اختیار کی تو میں اس کی طرف نازل ہوا، اور جس نے مجھ پر تکبر کیا تو میں نے اس پر اپنی عظمت ظاہر کی۔",
    "fa": "باب چهارصد و بیست و نهم در معرفت مقام کسی که برای جلال من (جلال الهی) فروتنی کرد، پس من به سوی او فرود آمدم، و کسی که بر من تکبر ورزید، بر او بزرگی نمودم."
  },
  "content": {
    "ar": "## «الباب التاسع والعشرون وأربعمائة في معرفة منازلة من تصاغر لجلالى نزلت إليه ومن تعاظم علي تعاظمت عليه»\n\n\n> يعامل الحق بما يعامل *** فاحذر فما أنت له مقابل‏\n\n\n> وكن له عينا ولا تكن به *** فإنه ليس له مماثل‏\n\n\n> من حارب الله يرى صرعته *** بعينه فالبطل المنازل‏\n\n\n> هو الذي يرمي السلاح والذي *** له من الله به المنازل‏\n\n\n> قد قال طيفور بأن بطشه *** أشد والقول بذاك نازل‏\n\n\n> فكونه فينا وجود ثابت *** وكوننا فيه وجود حاصل‏\n\n\n### [العبد إذا كان مسلوب الأوصاف‏]\n\n\nقال الله تعالى وما كانَ الله لِيُعَذِّبَهُمْ وأَنْتَ فِيهِمْ لأنه قال وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ وما خص مؤمنا من غير مؤمن فإذا كان العبد على مقامه الذي هو عينه مسلوب الأوصاف ولم يظهر منه تلبس بصفة محمودة ولا مذمومة فهو على أصله وأصله الصغار ويريد الحق ظهور الصفات فيه فلا بد أن ينزل إليه من هويته التي تقتضي له الغني عن العالم فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ والنبي صَلَّى اللهُ عَليهِ وسَلَّم يقول يوم بدر لربه تعالى إن تهلك هذه العصابة فلن تعبد بعد اليوم‏\n\n\nفلو قال مثل هذه المقالة غير رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لقال المنكر ما شاء مما يليق به من حيث إنكاره لجهله ومثل هذه النفحات تهب على قلوب العارفين من أهل الله فإن نطقوا بها كفرهم المؤمن وجهلهم صاحب الدليل‏\n\n\n> فالحمد لله الذي قد وهب *** والحمد لله الذي قد عصم‏\n\n\n> فلم يقل ما شأنه قوله *** وهو الذي قال به من عصم‏\n\n\n> فيحجب الله به من حرم *** ويشهد الله به من رحم‏\n\n\nورد في الخبر أنه من تواضع لله رفعه الله‏\n\n\nوهو عين نزول الحق إليه‏\n\n\nومن تكبر على الله وضعه الله‏\n\n\nوما وضعه إلا بشهود عظمته فإنه تعالى العلي العظيم ولما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم إنما هي أعمالكم ترد عليكم‏\n\n\nعلمنا إنا ما نرى من الحق إلا ما نحن عليه‏\n\n\nفمن شاء فليعمل ومن شاء لا يعمل‏\n\n\nوهذه كلمة نبوية حق كلها فإن العمل ما يعود إلا على عامله وقد أضاف الأعمال إلينا فمن علم منا من هو العامل منا علم من يعود إليه العمل في الرد وهذا القدر من الإشارة في هذا الحديث كاف ولما كان الله هو الكبير المتكبر علمنا نسبة الكبر إليه وتحير من تحير في نسبة التكبر إليه فلو علم نزول الحق لعباده إذ ليس في قوة الممكن نيل ما يستحقه الحق من الغني عن العالم وفي قوة الحق مع غناه من باب الفضل والكرم النزول لعباده ما هو لعين عباده وإنما ذلك لظهور أحكام أسمائه الحسنى في أعيان الممكنات فما علم أنه لنفسه نزل لا لخلقه كما قال تعالى وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فما خلقهما إلا من أجله والخلق نزول من مقام ما يستحقه من الغناء عن العالمين فالمتخيل من العباد خلاف هذا وأنه تعالى ما نزل إلا لما هو المخلوق عليه من علو القدر والمنزلة فهذا أجهل الجاهلين فأعطى الحق هذا النزول أو ما توهمه الجاهل أن يتسمى الحق بالمتكبر عن هذا النزول ولكن بعد هذا النزول لا قبله وجودا وتقديرا لا بد من ذلك فالكبير ليس كذلك وسيرد تحقيق هذا الفصل في آخر الكتاب في الباب الثامن والخمسين وخمسمائة إن شاء الله تعالى فهذه المنازلة تعطيك أن الحق مرآة العالم فلا يرون فيها غير ما هي صورهم عليه وهم في صورهم على درجات فهذا حصر لباب هذه المنازلة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 429: Concerning the Knowledge of the Reciprocal Engagement (منازلة) with him who Humbles Himself before My Majesty, to whom I Descend, and him who is Arrogant toward Me, against whom I Magnify Myself.\n\nThe Real (الحق) deals with [you] according to how [you] deal [with Him],\nSo beware, for you are not His counterpart.\nBe an eye for Him, and do not seek to be Him,\nFor He has no equal.\nWhoever wages war against Allah sees his overthrow\nWith his own eye, for the hero is the one who contends.\nHe is the one who casts the weapon, and the one for whom\nFrom Allah, through it, are the stations (منازل).\nTayfur (Bayazid) has said that His grip (بطش)\nIs stronger, and the saying concerning that is descending.\nSo His Being (وجود) in us is a fixed existence (ثابت),\nAnd our being in Him is a realized existence (حاصل).\n\n### [When the Servant is Stripped of Attributes]\n\nAllah the Exalted said: <<وَمَا كَانَ اللهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ>> (And Allah would not punish them while you are among them), because He also said: <<وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ>> (And We have not sent you except as a mercy to the worlds). He did not specify a believer apart from a non-believer.\n\nThus, when the servant is upon his station (مقامه), which is his very essence (عينه), stripped of attributes (مسلوب الأوصاف), and no adherence to a praiseworthy or blameworthy attribute appears from him, he is upon his origin (أصله). And his origin is humility (الصغار). The Real (الحق) desires the manifestation of the Attributes (الصفات) within him. Therefore, He must descend to him from His Ipseity (هويته) which necessitates His independence from the world: <<فَإِنَّ اللهَ غَنِيٌّ عَنِ الْعَالَمِينَ>> (Indeed, Allah is free from need of the worlds). The Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said to his Lord the Exalted on the Day of Badr: \"If this small band perishes, You will not be worshipped after today.\"\n\nIf anyone other than the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) had uttered such a statement, the denier would have said whatever he wished that was appropriate to his denial, due to his ignorance. And similar Divine breaths (نفحات) blow upon the hearts of the Gnostics (العارفين) among the People of Allah. If they speak them, the believer declares them an infidel, and the man of rational proof (صاحب الدليل) declares them ignorant.\n\nSo praise belongs to Allah who has granted,\nAnd praise belongs to Allah who has protected.\nSo he did not say what his affair is, his saying,\nAnd He is the one through whom the protected one spoke.\nThus Allah veils by him the one who is deprived,\nAnd Allah witnesses by him the one who is shown mercy.\n\nIt is reported in the tradition (الخبر) that whoever humbles himself before Allah, Allah raises him. And this is the very descent of the Real (الحق) to him. And whoever is arrogant toward Allah, Allah lowers him. And He only lowers him through the witnessing (شهود) of His Greatness, for He, the Exalted, is the High, the Magnificent (العلي العظيم). And when the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said: \"They are only your deeds that are returned to you,\" we knew that we only see from the Real (الحق) that which we ourselves are upon. So whoever wills, let him work, and whoever wills, let him not work.\n\nThis prophetic statement is entirely true, for the deed returns only to its doer. He has attributed the deeds to us. Thus, whoever among us knows who the doer (العامل) among us is, knows to whom the deed returns in the response (الرد). This much of an allusion (إشارة) in this hadith is sufficient. Since Allah is the Great (الكبير) and the Possessor of Majesty (المتكبر), we know the attribution of Greatness (الكبر) to Him, and whoever is perplexed regarding the attribution of Majesty (التكبر) to Him is bewildered.\n\nIf he knew the descent of the Real (الحق) to His servants—since it is not within the capacity of the contingent being (الممكن) to attain what the Real deserves of independence (الغني) from the world—and it is within the capacity of the Real, despite His independence, out of grace (الفضل) and generosity (الكرم), to descend to His servants. This descent is not for the sake of the servants themselves, but rather for the manifestation of the rulings of His Beautiful Names (الأسماء الحسنى) in the Fixed Entities (الأعيان الثابتة) of the contingent beings. Thus, he knew that He descended for His own sake, not for His creation, as the Exalted said: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me). So He created them only for His sake. And creation (الخلق) is a descent from the station (مقام) of independence (الغناء) from the worlds that He deserves.\n\nBut the one who imagines (المتخيل) among the servants believes the opposite: that the Exalted only descended because of the high rank and station (علو القدر والمنزلة) upon which the created being stands. This person is the most ignorant of the ignorant. So, this descent—or what the ignorant one imagines—grants the Real (الحق) the right to be named the Possessor of Majesty (المتكبر) concerning this descent, but only *after* this descent, not before it, both actually (وجودا) and potentially (تقديرا). This is necessary. The Great (الكبير) is not like that. The verification of this section will be returned to at the end of the book, in Chapter 558, if Allah the Exalted wills. This reciprocal engagement (منازلة) grants you the understanding that the Real (الحق) is the mirror of the World (العالم). Thus, they see nothing in it except the forms upon which they themselves are, and they are in their forms upon various degrees (درجات). This is the summary of the chapter on this reciprocal engagement. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو انتیس: اس شخص کے ساتھ منازلت (منازلة) کی معرفت میں جو میری جلالت کے سامنے عاجزی اختیار کرتا ہے تو میں اس کی طرف نزول کرتا ہوں، اور جو مجھ پر تکبر کرتا ہے تو میں اس پر عظمت ظاہر کرتا ہوں۔\n\nذات حق (الحق) سے اسی طرح معاملہ کیا جاتا ہے جیسا کہ وہ معاملہ کرتا ہے\nپس ہوشیار رہو، تم اس کے مقابل (مقابل) نہیں ہو۔\n\nاس کے لیے آنکھ بن جاؤ، مگر وہ نہ بنو\nکیونکہ اس کا کوئی مماثل (مماثل) نہیں ہے۔\n\nجو اللہ سے لڑتا ہے وہ اپنی شکست اپنی آنکھوں سے دیکھتا ہے\nپس بہادر ہی منازلت (منازل) کرنے والا ہے۔\n\nوہی ہے جو ہتھیار پھینکتا ہے، اور وہی ہے\nجس کے لیے اللہ کی طرف سے اس کے ذریعے منازل (المنازل) ہیں۔\n\nطیفور (بایزید بسطامی) نے کہا کہ اس کی گرفت (بطش) زیادہ سخت ہے\nاور یہ قول اسی طرح نازل (نازل) ہے۔\n\nپس ہمارا اس میں ہونا ایک ثابت وجود (وجود ثابت) ہے\nاور ہمارا اس میں ہونا ایک حاصل وجود (وجود حاصل) ہے۔\n\n### [بندہ جب اوصاف سے محروم ہو]\n\nاللہ تعالیٰ نے فرمایا: \"اور اللہ ایسا نہیں کہ انہیں عذاب دے جبکہ آپ ان میں موجود ہوں\" (القرآن، 8:33)۔ کیونکہ اس نے فرمایا: \"اور ہم نے آپ کو تمام جہانوں کے لیے رحمت بنا کر ہی بھیجا ہے\" (القرآن، 21:107)۔ اور اس نے مومن کو غیر مومن سے خاص نہیں کیا۔ پس جب بندہ اپنے اس مقام پر ہو جو اس کی عین ذات ہے، اوصاف سے محروم (مسلوب الأوصاف)، اور اس سے کسی محمود یا مذموم صفت کا تلبس (تلبس) ظاہر نہ ہو، تو وہ اپنی اصل پر ہے، اور اس کی اصل عاجزی (الصغار) ہے۔ اور ذات حق (الحق) اس میں صفات کا ظہور چاہتا ہے، لہٰذا ضروری ہے کہ وہ اپنی اس ہویت (ہویۃ) سے اس کی طرف نزول کرے جو اس کے لیے عالم سے بے نیازی کا تقاضا کرتی ہے: \"بیشک اللہ تمام جہانوں سے بے نیاز ہے\" (القرآن، 29:6)۔ اور نبی صلی اللہ علیہ وسلم نے یوم بدر کو اپنے رب تعالیٰ سے فرمایا: \"اگر یہ جماعت ہلاک ہو گئی تو آج کے بعد تیری عبادت نہیں کی جائے گی۔\"\n\nپس اگر رسول اللہ صلی اللہ علیہ وسلم کے علاوہ کسی اور نے ایسی بات کہی ہوتی تو منکر اپنی جہالت کی بنا پر انکار کرتے ہوئے جو کچھ اس کے لائق ہوتا وہ کہہ دیتا۔ اور ایسی ہی نفحات (نفحات) اہلِ اللہ میں سے عارفین (العارفين) کے دلوں پر چلتی ہیں، اگر وہ انہیں زبان پر لائیں تو مومن انہیں کافر قرار دیتا ہے اور صاحب دلیل (صاحب الدليل) انہیں جاہل ٹھہراتا ہے۔\n\nپس تمام تعریفیں اللہ کے لیے ہیں جس نے عطا کیا\nاور تمام تعریفیں اللہ کے لیے ہیں جس نے بچایا۔\n\nپس اس نے وہ بات نہیں کہی جو اس کے شایانِ شان تھی\nحالانکہ وہ وہی ہے جس کے ذریعے محفوظ (عصم) شخص نے بات کی۔\n\nپس اللہ اس کے ذریعے اسے حجاب (حجب) میں رکھتا ہے جو محروم کیا گیا\nاور اللہ اس کے ذریعے اسے شہود (شہود) عطا کرتا ہے جس پر رحم کیا گیا۔\n\nخبر (الخبر) میں آیا ہے کہ جو اللہ کے لیے تواضع اختیار کرتا ہے، اللہ اسے بلند کرتا ہے۔ اور یہ عین ذات حق (الحق) کا اس کی طرف نزول ہے۔ اور جو اللہ پر تکبر کرتا ہے، اللہ اسے پست کرتا ہے۔ اور اسے پست نہیں کیا مگر اپنی عظمت کے شہود (شہود) کے ذریعے، کیونکہ وہ بلند و بالا، عظیم ہے۔ اور جب نبی صلی اللہ علیہ وسلم نے فرمایا: \"یہ تمہارے ہی اعمال ہیں جو تم پر لوٹائے جاتے ہیں۔\" تو ہم نے جان لیا کہ ہم ذات حق (الحق) سے وہی دیکھتے ہیں جس پر ہم خود ہیں۔ \"پس جو چاہے عمل کرے اور جو چاہے عمل نہ کرے۔\" اور یہ ایک نبوی کلمہ ہے جو پوری طرح حق ہے، کیونکہ عمل صرف اپنے عامل پر ہی لوٹتا ہے۔ اور اس نے اعمال کو ہماری طرف منسوب کیا ہے، پس ہم میں سے جو یہ جان لے کہ ہم میں سے عامل کون ہے، وہ جان لے گا کہ لوٹائے جانے میں عمل کس کی طرف واپس آتا ہے۔ اس حدیث میں اشارے کی یہ مقدار کافی ہے۔\n\nاور جب اللہ ہی الکبیر (الکبیر) اور المتکبر (المتکبر) ہے، تو ہم نے اس کی طرف کبر (الكبر) کی نسبت کو جان لیا، اور جو المتکبر (التكبر) کی نسبت میں متحیر ہوا وہ حیران رہا۔ اگر وہ ذات حق (الحق) کے اپنے بندوں کی طرف نزول کو جان لیتا، کیونکہ ممکن (الممكن) کی طاقت میں یہ نہیں ہے کہ وہ اس بے نیازی (غنی) کو حاصل کر سکے جس کا حق عالم سے بے نیاز ہونے کی وجہ سے مستحق ہے۔ اور ذات حق (الحق) کی طاقت میں، اپنی بے نیازی کے باوجود، فضل اور کرم کے باب سے اپنے بندوں کی طرف نزول کرنا ہے—یہ نزول ان کے بندوں کی عین ذات کے لیے نہیں ہے، بلکہ یہ تو ممکنات (الممكنات) کی اعیان میں اس کے اسماء حسنیٰ (الأسماء الحسنى) کے احکام کے ظہور کے لیے ہے۔ پس جس نے یہ جان لیا کہ اس نے اپنے لیے نزول کیا ہے نہ کہ اپنی مخلوق کے لیے، جیسا کہ اللہ تعالیٰ نے فرمایا: \"اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا ہے\" (القرآن، 51:56)۔ پس اس نے ان دونوں کو صرف اپنے لیے پیدا کیا۔ اور خلق (الخلق) اس مقام سے نزول ہے جس کی وہ عالمین سے بے نیازی کے سبب مستحق ہے۔ لیکن بندوں میں سے وہ شخص جو خلاف تصور کرتا ہے، وہ یہ کہتا ہے کہ اللہ تعالیٰ نے صرف اس بلند قدر و منزلت کی وجہ سے نزول کیا جس پر مخلوق قائم ہے۔ یہ شخص جاہلوں میں سب سے زیادہ جاہل ہے۔ پس ذات حق (الحق) نے یہ نزول عطا کیا—یا وہ جو جاہل گمان کرتا ہے—کہ ذات حق (الحق) کو اس نزول سے المتکبر (المتکبر) کہا جائے، لیکن یہ اس نزول کے بعد ہوتا ہے، اس سے پہلے نہیں، وجوداً (وجودا) اور تقدیراً (تقدیرا) دونوں طرح سے یہ ضروری ہے۔ پس الکبیر (الکبیر) ایسا نہیں ہے۔ اور اس فصل کی تحقیق ان شاء اللہ کتاب کے آخر میں باب نمبر پانچ سو اٹھاون میں آئے گی۔ پس یہ منازلت (المنازلة) تمہیں یہ سمجھ عطا کرتی ہے کہ ذات حق (الحق) عالم کا آئینہ ہے، لہٰذا وہ اس میں اس کے سوا کچھ نہیں دیکھتے جس پر ان کی صورتیں ہیں، اور وہ اپنی صورتوں میں درجات پر ہیں۔ یہ اس منازلت کے باب کا خلاصہ ہے۔ \"اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف ہدایت دیتا ہے\" (القرآن، 33:4)۔",
    "fa": "باب چهارصد و بیست و نهم در شناخت مقام کسی که برای جلال من فروتنی کرد و من به سوی او نزول کردم، و کسی که بر من تکبر ورزید، من نیز بر او تکبر ورزیدم.\n\nحق (الحق) با تو چنان رفتار می‌کند که تو با او رفتار می‌کنی\nپس برحذر باش، زیرا تو همتای او نیستی.\n\nو برای او چشم باش، نه اینکه خود او باشی\nزیرا او را هیچ مانندی نیست.\n\nهر کس با خدا بجنگد، زمین خوردن خود را می‌بیند\nبا چشم خود، پس او قهرمان مبارز است.\n\nاوست که سلاح را پرتاب می‌کند و اوست که\nاز جانب حق (الله) به واسطه آن به مقام‌ها می‌رسد.\n\nطيفور (بایزید بسطامی) گفت که قهر و انتقام او\nشدیدتر است، و این سخن (از عالم بالا) نازل شده است.\n\nپس هستی او (حق) در ما، وجودی ثابت است\nو هستی ما در او، وجودی حاصل شده است.\n\n### [بنده هنگامی که اوصاف از او سلب شده باشد]\n\nخداوند متعال فرمود: «و تا زمانی که تو در میان آن‌ها هستی، خداوند آن‌ها را عذاب نخواهد کرد» (وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ). زیرا فرمود: «و ما تو را جز رحمتی برای جهانیان نفرستادیم» (وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ). و مؤمن را از غیر مؤمن جدا نساخت. پس هنگامی که بنده در مقام خود که عین اوست، اوصاف از او سلب شده باشد و هیچ آراستگی به صفت ستوده یا نکوهیده از او ظاهر نشود، او بر اصل خود است و اصل او کوچکی و فروتنی (الصغار) است. و حق (الحق) می‌خواهد که صفات در او ظاهر شوند. پس ناگزیر است که از هویت خود که مقتضی بی‌نیازی او از عالَم است، به سوی او (بنده) نزول کند، «همانا خداوند از جهانیان بی‌نیاز است» (فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ). و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در روز بدر به پروردگار متعال خود می‌فرماید: «اگر این گروه (اندک) را هلاک کنی، پس از امروز دیگر پرستیده نخواهی شد.»\n\nاگر غیر از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) چنین سخنی می‌گفت، منکر هر آنچه شایسته انکار او بود، به دلیل جهلش می‌گفت. و مانند این نفحات (الهامات) بر قلب‌های عارفان از اهل الله می‌وزد. اگر به آن سخن بگویند، مؤمن آن‌ها را کافر می‌شمارد و صاحب دلیل (عقل) آن‌ها را جاهل می‌داند.\n\nپس سپاس خدایی را که بخشید\nو سپاس خدایی را که حفظ کرد (عصمت داد).\n\nپس آنچه شأن او (پیامبر) بود، نگفت\nو او (پیامبر) کسی است که به واسطه عصمت، آن را گفت.\n\nپس خداوند به واسطه آن، کسی را که محروم است، محجوب می‌سازد\nو خداوند به واسطه آن، کسی را که مورد رحمت قرار داده، شاهد (شهود) می‌سازد.\n\nدر خبر (حدیث) آمده است که: «هر کس برای خدا فروتنی کند، خداوند او را بالا می‌برد.» و این عین نزول حق (الحق) به سوی اوست. و هر کس بر خدا تکبر ورزد، خداوند او را پست می‌کند. و او را پست نکرد مگر به واسطه شهود عظمت خود (حق). زیرا او تعالی، بلندمرتبه و بزرگ است. و هنگامی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا این‌ها اعمال شماست که به شما بازگردانده می‌شود» (إِنَّمَا هِيَ أَعْمَالُكُمْ تُرَدُّ عَلَيْكُمْ)، دانستیم که ما از حق (الحق) نمی‌بینیم مگر آنچه خود بر آن هستیم. «پس هر کس می‌خواهد عمل کند و هر کس می‌خواهد عمل نکند.»\n\nو این سخنی نبوی است که تماماً حق است. زیرا عمل جز به عامل خود باز نمی‌گردد. و او (حق) اعمال را به ما نسبت داده است. پس هر کس از ما بداند که عامل واقعی کیست، می‌داند که عمل در بازگشت به چه کسی باز می‌گردد. و این مقدار اشاره در این حدیث کافی است. و چون خداوند همان کبیر (الکبیر) و متکبر (المتکبر) است، نسبت کبر (بزرگی) را به او دانستیم. و هر کس که در نسبت تکبر به او متحیر شد، (تحیرش به جا بود). اگر نزول حق (الحق) به سوی بندگانش را می‌دانست، زیرا در توان ممکن (مخلوق) نیست که به آنچه حق (الحق) از بی‌نیازی از عالَم سزاوار آن است، دست یابد. و در توان حق (الحق) است که با وجود بی‌نیازی‌اش، از باب فضل و کرم، به سوی بندگانش نزول کند. این نزول برای عین بندگانش نیست، بلکه آن نزول برای ظهور احکام اسماء حسنای او در اعیان ممکنات است. پس دانسته شد که او برای خود نزول کرد، نه برای خلقش. چنانکه خداوند متعال فرمود: «و جن و انس را نیافریدم مگر برای اینکه مرا بپرستند» (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ). پس آن دو را نیافرید مگر به خاطر خودش. و خلق، نزولی است از مقامی که او سزاوار آن است (مقام بی‌نیازی از عالمیان). و آنچه بندگان تصور می‌کنند، خلاف این است، و اینکه او تعالی نزول نکرد مگر به خاطر آنچه مخلوق بر آن است از علو قدر و منزلت. پس این شخص، جاهل‌ترین جاهلان است. پس حق (الحق) این نزول را عطا کرد، یا آنچه جاهل توهم می‌کند که حق (الحق) به واسطه این نزول، به نام متکبر خوانده شود. اما این (تسمیه به متکبر) بعد از این نزول است نه قبل از آن، و از نظر وجودی و تقدیری چاره‌ای از آن نیست. پس کبیر (الکبیر) اینگونه نیست. و تحقیق این فصل در آخر کتاب، در باب پانصد و پنجاه و هشتم، ان شاء الله تعالی خواهد آمد. پس این مقام (منازله) به تو می‌آموزد که حق (الحق) آینه عالَم است. پس در آن (آینه) نمی‌بینند مگر آنچه صورت‌هایشان بر آن است. و آن‌ها در صورت‌هایشان بر درجات مختلفی هستند. پس این، خلاصه‌ای برای باب این مقام (منازله) است. «و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 1
}