{
  "id": 240,
  "title": {
    "ar": "الباب الأربعون ومائتان في الأنس",
    "en": "Chapter Two Hundred and Forty: Concerning Spiritual Intimacy (الأنس)",
    "ur": "باب دو سو چالیس: انس کے بیان میں",
    "fa": "باب دویست و چهلم در انس (الأنس)"
  },
  "content": {
    "ar": "## «الباب الأربعون ومائتان في الأنس»\n\n\n> الأنس بالأنس لا بالصور يجمعنا *** فاحذر فإنك ممكور ومخدوع‏\n\n\n> لا تقف ما لست تدريه وتجهله *** فإن ودك مفروق ومجموع‏\n\n\n> أنت الإمام ولكن فيك حكمته *** تعطي بأنك مخلوق ومصنوع‏\n\n\n> فكيف يأنس من تفني شواهده *** أكوانه وهو في الأسماع مسموع‏\n\n\n### [أن الأنس عند القوم ما تقع به المباسطة من الحق للعبد]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الأنس عند القوم ما تقع به المباسطة من الحق للعبد وقد تكون هذه المباسطة على الحجاب وعلى الكشف والأنس حال القلب من تجلى الجمال وهو عند أكثر القوم من تجلى الجمال وهو غلط من جملة ما غلطوا فيه لأن لهم أغاليط في العبارة لعدم التمييز بين الحقائق فما كل أهل الله رزقوا التمييز والفرقان مع الشهود الصحيح ولكن الشأن في معرفة ما هو هذا الذي وقع عليه الشهود وقد رأينا جماعة ممن شهد حقا ولكن ما عرف‏\nما شهد وحمله على خلاف طريقه فلا بد مع التجلي من تعريف إلهي إما بصفاء الإلهام وإما بما شاءه الحق من أنواع التعريف وللانس بالله علامة عند صاحبه فإنه موضع يغلط فيه كثير من أهل الطريق فيجدون أنسا في حال ما يكون عليه فيتخيل إن ذلك آنس بالله فإذا فقد ذلك الحال فقد الأنس بالله فعندنا وعند الجماعة أن أنسه كان بذلك الحال لا بالله لأن الأنس بالله إذا وقع لم يزل موجودا عنده في كل حال ولذلك يقول القوم من أنس بالله في الخلوة وفقد ذلك الأنس في الملإ فأنسه كان بالخلوة لا بالله‏\n\n\n### [إن الأنس باسم إلهي خاص معين‏]\n\n\nواعلم أنه لا يصح الأنس بالله عند المحققين وإنما يكون الأنس باسم إلهي خاص معين لا بالاسم الله وهكذا جميع ما يكون من الله لعباده لا يصح أن يكون من حكم الاسم الله لأنه الاسم الجامع لحقائق الأسماء الإلهية فلا يقع أمر لشخص معين في الكون إلا من اسم معين بل ولا يظهر في الكون كله أعني في كل ما سوى الله شي‏ء يعمه إلا من اسم خاص معين لا يصح أن يكون الاسم الله فإنه من أحكامه أيضا الغني عن العالمين كما أنه من أحكامه ظهور العالم وحبه سبحانه لذلك الظهور والغني عن العالم لا يفرح بالعالم والله يفرح بتوبة عبده فالاسم الله تعلم مرتبته ولا يتمكن ظهور حكمه في العالم لما فيه من التقابل وهذه مسألة عظيمة جليلة القدر صعبة التصور في الإلهيات فإن الشي‏ء إذا اقتضى أمرا لذاته فمن المحال أن تتصف الذات بالغنى عن ذلك الأمر كما لا تتصف بالافتقار إليه وقد ورد الغني عن العالمين فإن جعلناه غنيا عن الدلالة كأنه يقول ما أوجدت العالم ليدل علي ولا أظهرته علامة على وجودي وإنما أظهرته ليظهر حكم حقائق أسمائي وليست لي علامة على سوائي فإذا تجليت عرفت بنفس التجلي والعالم علامة على حقائق الأسماء لا علي وعلامة أيضا على أني مستنده لا غير فالعالم كله ذو أنس بالله ولكن بعضه لا يشعر أن الأنس الذي هو عليه هو بالله لأنه لا بد أن يجد أنسا بأمر ما بطريق الدوام أو بطريق الانتقال بأنس يجده بأمر آخر وليس لغير الله في الأكوان حكم فأنسه لم يكن إلا بالله وإن كان لا يعلم والذي ينظر فيه أنه آنس به فذلك صورة من صور تجليه ولكن قد يعرف وقد ينكر فيستوحش العبد من عين ما أنس به وهو لا يشعر لاختلاف الصور فما فقد أحد الأنس بالله ولا استوحش أحد إلا من الله والأنس مباسطة والاستيحاش انقباض وأنس العلماء بالله إنما هو أنسهم بنفوسهم لا بالله إذ قد علموا أنهم ما يرون من الله سوى صورة ما هم عليه ولا يقع أنس عندهم إلا بما يرون وغير العارفين لا يرون الأنس إلا بالغير فتدركهم الوحشة عند انفرادهم بنفوسهم وكذلك الاستيحاش إنما يستوحشون من نفوسهم لأن الحق مجلاهم فهم بحسب ما يرونه فيهم بل فيه من أحوالهم فيقع الحكم فيهم بالأنس أو بالوحشة وحقيقة الأنس إنما تكون بالمناسب فمن يقول بالمناسبة يقول بالأنس بالله ومن يقول بارتفاع المناسبة يقول لا أنس بالله ولا وحشة منه وكل واحد بحسب ذوقه فإنه الحاكم عليه ومن له الإشراف من أمثالنا على المقامات والمراتب ميز وعرف كل شخص من أين تكلم ومن نطقه وأنه مصيب في مرتبته غير مخطئ بل لا خطأ مطلقا في العالم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 240: Concerning Intimacy (الأنس)\n\n> Intimacy is gathered by Intimacy, not by forms (الصور) that unite us,\n> So beware, for you are deceived and beguiled.\n\n> Do not pursue what you do not perceive and are ignorant of,\n> For your love is separated and gathered.\n\n> You are the Imam, but in you is His wisdom,\n> Which grants that you are created and fashioned.\n\n> So how can he find intimacy whose witnesses perish—\n> His existences—while he is heard in the hearings?\n\n### That Intimacy, according to the People, is the Familiarity that occurs from the Real to the Servant\n\nKnow—may Allah support us and you with a spirit from Him—that Intimacy (الأنس) according to the People [Sufis] is the familiarity/frankness (المباسطة) that occurs from the Real (الحق) to the servant. This familiarity may occur through the veil (الحجاب) or through the Unveiling (الكشف). Intimacy is a state (حال) of the heart resulting from the Theophany (التجلي) of Beauty (الجمال).\n\nIt is considered by most of the People to stem from the Theophany of Beauty, and this is an error among the totality of errors they commit. This is because they have errors in expression due to the lack of distinction (التمييز) between the Realities (الحقائق). Not all of the People of Allah (أهل الله) have been granted the distinction and the Criterion (الفرقان) alongside correct Witnessing (الشهود الصحيح). However, the crucial matter lies in knowing what this thing is upon which the Witnessing has fallen. We have seen a group who truly witnessed, but they did not know what they witnessed and interpreted it contrary to its proper way. Therefore, alongside the Theophany, there must be a Divine definition/instruction (تعريف إلهي), either through the purity of inspiration (الإلهام) or through whatever types of definition the Real wills.\n\nIntimacy with Allah has a sign for its possessor, for this is a place where many of the People of the Path (أهل الطريق) err. They find intimacy in a state they are experiencing, and they imagine that this is intimacy with Allah. Then, when they lose that state, they lose the intimacy with Allah. Thus, according to us and according to the community [of the realized], their intimacy was with that state, not with Allah. This is because Intimacy with Allah, once it occurs, remains present with the servant in every state. For this reason, the People say: whoever finds intimacy with Allah in solitude (الخلوة) but loses that intimacy in company (الملإ), his intimacy was with the solitude, not with Allah.\n\n### That Intimacy is with a Specific, Designated Divine Name\n\nKnow that Intimacy with Allah (الاسم الله) is not valid according to the Verifiers (المحققين); rather, Intimacy occurs with a specific, designated Divine Name (اسم إلهي), not with the Name Allah. Similarly, everything that proceeds from Allah to His servants cannot correctly proceed from the ruling (حكم) of the Name Allah, because it is the Name that comprehends the Realities (حقائق) of all the Divine Names. Thus, no matter occurs to a specific person in the Cosmos (الكون) except from a specific Name. Indeed, nothing that is comprehensive appears in the entire Cosmos—meaning, in everything other than Allah—except from a specific, designated Name, and it cannot correctly be the Name Allah.\n\nFor among its rulings (أحكامه) is also the Independence (الغني) from the worlds, just as among its rulings is the manifestation of the World (العالم) and His love, exalted is He, for that manifestation. And the Independent from the World does not rejoice in the World, yet Allah rejoices at the repentance of His servant. Therefore, you must know the Level (مرتبة) of the Name Allah, and the manifestation of its ruling cannot be established in the World due to the opposition (التقابل) inherent within it.\n\nThis is a great and momentous issue, difficult to conceive in Divine matters (الإلهيات). For if a thing necessitates a matter by virtue of its Essence (الذات), then it is impossible for the Essence to be described as Independent of that matter, just as it is not described as needing it. And the Independence from the worlds has been transmitted. If we take Him as Independent of indication, it is as if He says: 'I did not bring the World into existence to indicate Me, nor did I manifest it as a sign of My existence. Rather, I manifested it so that the ruling of the Realities of My Names might appear, and I have no sign that points to Me alone. Thus, when I disclose Myself (تجليت), I am known by the Theophany itself. The World is a sign of the Realities of the Names, not of Me [the Essence]. And it is also a sign that I am its support, nothing else.'\n\nTherefore, the entire World possesses intimacy with Allah, but some of it does not perceive that the intimacy it possesses is with Allah. This is because it must find intimacy with something, either perpetually or by transitioning to an intimacy it finds with another thing. And nothing other than Allah has a ruling in the existents (الأكوان), so its intimacy was only with Allah, even if it does not know. And that thing through which the servant perceives intimacy is merely a form among the forms of His Theophany. But sometimes it is recognized, and sometimes it is denied, so the servant feels alienation (استيحاش) from the very thing with which he found intimacy, without realizing it, due to the difference in forms. Thus, no one has ever lost intimacy with Allah, nor has anyone ever felt alienation except from Allah.\n\nIntimacy (الأنس) is familiarity/frankness (مباسطة), while alienation (الاستيحاش) is contraction (انقباض). And the intimacy of the scholars (العلماء) with Allah is merely their intimacy with their own souls (نفوسهم), not with Allah, since they know that what they see of Allah is nothing but the form of what they themselves are. And intimacy does not occur for them except through what they see. As for those who are not Gnostics (العارفين), they only see intimacy through the other, so alienation overtakes them when they are alone with their souls. Likewise, alienation is only alienation from their own souls, because the Real is their mirror (مجلاهم). Thus, according to what they see in themselves—or rather, in Him—of their states, the ruling of intimacy or alienation falls upon them.\n\nAnd the Reality (حقيقة) of Intimacy is only achieved through correspondence (المناسب). So, whoever affirms correspondence affirms intimacy with Allah, and whoever affirms the removal of correspondence affirms neither intimacy with Allah nor alienation from Him. And everyone acts according to his taste (ذوقه), for it is the judge over him. And whoever among us has oversight (الإشراف) over the Stations (المقامات) and Levels (المراتب) distinguishes and knows from where each person speaks and what his utterance is, and that he is correct in his Level, not mistaken. Indeed, there is absolutely no error in the World. And Allah says the Truth, and He guides to the Way. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah says the Truth, and He guides to the Way).",
    "ur": "باب دو سو چالیس: انس (الأنس) کے بیان میں\n\nانس (الأنس) کے ساتھ انس ہی ہمیں جمع کرتا ہے، نہ کہ صورتوں کے ساتھ\nپس خبردار رہو، کیونکہ تم فریب خوردہ اور دھوکے میں مبتلا ہو سکتے ہو۔\n\nاس چیز کی پیروی نہ کرو جسے تم نہیں جانتے اور جس سے تم ناواقف ہو\nکیونکہ تمہاری محبت (ود) تقسیم شدہ بھی ہے اور جمع شدہ بھی۔\n\nتم امام ہو، لیکن تم میں اس کی حکمت ہے\nجو یہ ظاہر کرتی ہے کہ تم مخلوق اور بنائے گئے ہو۔\n\nپس وہ شخص کیسے انس (الأنس) حاصل کر سکتا ہے جس کے مشاہدات اور اس کی کائناتیں فنا ہونے والی ہیں\nجبکہ وہ کانوں میں سنا جانے والا ہے؟\n\n[قوم کے نزدیک انس (الأنس) وہ ہے جس کے ذریعے ذات حق (الحق) کی طرف سے بندے کے لیے بے تکلفی (المباسطة) واقع ہوتی ہے]\n\nجان لو، اللہ تعالیٰ اپنی روح سے ہماری اور تمہاری تائید فرمائے، کہ قوم (صوفیاء) کے نزدیک انس (الأنس) وہ ہے جس کے ذریعے ذات حق (الحق) کی طرف سے بندے کے لیے بے تکلفی (المباسطة) واقع ہوتی ہے۔ یہ بے تکلفی پردے (الحجاب) کی حالت میں بھی ہو سکتی ہے اور کشف (الکشف) کی حالت میں بھی۔ انس (الأنس) جمال (الجمال) کے تجلی (التجلی) سے قلب کی ایک کیفیت ہے۔ اکثر صوفیاء کے نزدیک یہ جمال (الجمال) کے تجلی (التجلی) سے ہوتا ہے، اور یہ ان غلطیوں میں سے ایک ہے جو انہوں نے کی ہیں، کیونکہ حقائق کے درمیان تمیز نہ ہونے کی وجہ سے ان کی عبارات میں غلطیاں پائی جاتی ہیں۔ یہ ضروری نہیں کہ اللہ کے ہر اہل کو صحیح شہود (الشہود) کے ساتھ تمیز اور فرقان (حق و باطل میں تمیز) عطا ہوا ہو۔ لیکن اصل معاملہ اس چیز کی معرفت (المعرفۃ) میں ہے جس پر شہود (الشہود) واقع ہوا ہے۔ ہم نے ایک جماعت کو دیکھا ہے جنہوں نے حق کا شہود کیا، لیکن وہ یہ نہ جان سکے کہ انہوں نے کس چیز کا شہود کیا اور اسے اس کے اصل راستے کے خلاف محمول کیا۔ لہٰذا، تجلی (التجلی) کے ساتھ ایک الٰہی تعریف کا ہونا ضروری ہے، خواہ وہ الہام کی صفائی کے ذریعے ہو یا ذات حق (الحق) کی طرف سے چاہا گیا کسی بھی قسم کا تعارف ہو۔ اللہ کے ساتھ انس (الأنس) کی اس کے حامل کے نزدیک ایک علامت ہوتی ہے، کیونکہ یہ وہ مقام ہے جہاں بہت سے اہل طریق غلطی کرتے ہیں۔ وہ کسی خاص حال میں انس پاتے ہیں اور یہ گمان کرتے ہیں کہ یہ اللہ کے ساتھ انس ہے۔ جب وہ حال ختم ہو جاتا ہے تو وہ اللہ کے ساتھ انس کو بھی کھو دیتے ہیں۔ لہٰذا، ہمارے اور جماعت (محققین) کے نزدیک، اس کا انس اس حال کے ساتھ تھا نہ کہ اللہ کے ساتھ۔ کیونکہ جب اللہ کے ساتھ انس (الأنس) واقع ہو جاتا ہے تو وہ ہر حال میں اس کے پاس موجود رہتا ہے۔ اسی لیے صوفیاء کہتے ہیں کہ جس نے خلوت میں اللہ کے ساتھ انس پایا اور مجمع میں اس انس کو کھو دیا، تو اس کا انس خلوت کے ساتھ تھا نہ کہ اللہ کے ساتھ۔\n\n[انس (الأنس) ایک خاص معین الٰہی نام کے ساتھ ہوتا ہے]\n\nاور جان لو کہ محققین کے نزدیک اللہ (الاسم اللہ) کے ساتھ انس (الأنس) صحیح نہیں ہے، بلکہ انس ایک خاص معین الٰہی نام کے ساتھ ہوتا ہے، نہ کہ اسم \"اللہ\" کے ساتھ۔ اسی طرح، اللہ کی طرف سے اس کے بندوں کے لیے جو کچھ بھی ہوتا ہے، وہ اسم \"اللہ\" کے حکم سے نہیں ہو سکتا، کیونکہ یہ (اللہ) وہ اسم ہے جو تمام الٰہی اسماء کے حقائق کو جامع ہے۔ لہٰذا، کائنات میں کسی معین شخص کے لیے کوئی بھی امر واقع نہیں ہوتا مگر ایک معین اسم سے۔ بلکہ، پوری کائنات میں—یعنی اللہ کے سوا ہر چیز میں—کوئی بھی ایسی چیز ظاہر نہیں ہوتی جو سب کو شامل ہو، مگر ایک خاص معین اسم سے، اور یہ اسم \"اللہ\" نہیں ہو سکتا۔ کیونکہ اس (اسم اللہ) کے احکام میں سے یہ بھی ہے کہ وہ عالمین سے بے نیاز (الغنی عن العالمین) ہے، جیسا کہ اس کے احکام میں سے عالم کا ظہور اور اس ظہور سے اس (اللہ) کی محبت بھی ہے۔ اور عالم سے بے نیاز (الغنی عن العالم) عالم سے خوش نہیں ہوتا، جبکہ اللہ اپنے بندے کی توبہ پر خوش ہوتا ہے۔ پس تم اسم \"اللہ\" کا مرتبہ جانو، اور اس کا حکم عالم میں ظاہر نہیں ہو سکتا کیونکہ اس میں تقابل (تضاد) پایا جاتا ہے۔ یہ الٰہیات میں ایک عظیم، جلیل القدر اور مشکل تصور والی بحث ہے۔ کیونکہ اگر کوئی چیز اپنی ذات کے لیے کسی امر کا تقاضا کرے، تو یہ محال ہے کہ وہ ذات اس امر سے بے نیازی (الغنی) کے ساتھ متصف ہو، جیسا کہ وہ اس کی محتاجی کے ساتھ متصف نہیں ہوتی۔ اور بے نیاز عن العالمین (الغنی عن العالمین) کا ذکر آیا ہے۔ اگر ہم اسے دلالت سے بے نیاز قرار دیں، تو گویا وہ یہ کہہ رہا ہے کہ میں نے عالم کو اس لیے پیدا نہیں کیا کہ وہ مجھ پر دلالت کرے، اور نہ ہی اسے اپنے وجود کی علامت کے طور پر ظاہر کیا ہے۔ بلکہ میں نے اسے اس لیے ظاہر کیا تاکہ میرے اسماء کے حقائق کا حکم ظاہر ہو، اور میرے سوا کسی اور پر میری کوئی علامت نہیں ہے۔ پس جب میں تجلی (التجلی) کرتا ہوں تو میں خود تجلی کے ذریعے پہچانا جاتا ہوں، اور عالم اسماء کے حقائق کی علامت ہے، نہ کہ میری علامت۔ اور یہ اس بات کی بھی علامت ہے کہ میں ہی اس کا مستند (بنیاد) ہوں، اور کوئی نہیں۔ پس پوری کائنات اللہ کے ساتھ انس (الأنس) رکھتی ہے، لیکن بعض کو یہ شعور نہیں ہوتا کہ جس انس پر وہ قائم ہیں وہ اللہ کے ساتھ ہے۔ کیونکہ اسے کسی نہ کسی چیز کے ساتھ انس ضرور ملتا ہے، خواہ وہ دائمی طریقے سے ہو یا کسی دوسری چیز کے ساتھ انس پانے کے ذریعے منتقل ہونے کے طریقے سے۔ اور کائنات میں اللہ کے سوا کسی اور کا حکم نہیں ہے، لہٰذا اس کا انس اللہ کے سوا کسی اور کے ساتھ نہیں ہو سکتا، اگرچہ وہ نہ جانتا ہو۔ اور جس چیز میں وہ دیکھتا ہے کہ اس نے اس کے ساتھ انس پایا، وہ اس کے تجلی (التجلی) کی صورتوں میں سے ایک صورت ہے۔ لیکن کبھی وہ اسے پہچانتا ہے اور کبھی انکار کرتا ہے، تو بندہ اسی چیز سے وحشت محسوس کرتا ہے جس سے اس نے انس پایا تھا، اور وہ صورتوں کے اختلاف کی وجہ سے شعور نہیں رکھتا۔ پس کسی نے بھی اللہ کے ساتھ انس (الأنس) کو نہیں کھویا، اور نہ ہی کسی نے اللہ کے سوا کسی اور سے وحشت پائی۔ انس (الأنس) بے تکلفی (المباسطة) ہے اور استیحاش (الوحشة) انقباض (تنگی) ہے۔ علماء کا اللہ کے ساتھ انس درحقیقت ان کی اپنی جانوں کے ساتھ انس ہے نہ کہ اللہ کے ساتھ، کیونکہ وہ جان چکے ہیں کہ وہ اللہ کی طرف سے صرف اسی چیز کی صورت دیکھتے ہیں جس پر وہ خود ہیں۔ اور ان کے نزدیک انس صرف اسی چیز سے واقع ہوتا ہے جسے وہ دیکھتے ہیں۔ اور غیر عارفین انس کو صرف غیر کے ساتھ دیکھتے ہیں، لہٰذا جب وہ اپنی جانوں کے ساتھ تنہا ہوتے ہیں تو انہیں وحشت گھیر لیتی ہے۔ اسی طرح استیحاش (وحشت) بھی درحقیقت وہ اپنی جانوں سے ہی محسوس کرتے ہیں، کیونکہ ذات حق (الحق) ان کا مجلیٰ (ظہور کی جگہ) ہے۔ پس وہ ان احوال کے مطابق جو وہ اپنے اندر، بلکہ اس (ذات حق) میں دیکھتے ہیں، ان پر انس یا وحشت کا حکم واقع ہوتا ہے۔ اور انس (الأنس) کی حقیقت مناسبت (المناسبة) کے ساتھ ہی ہوتی ہے۔ پس جو مناسبت کا قائل ہے وہ اللہ کے ساتھ انس کا قائل ہے، اور جو مناسبت کے ختم ہونے کا قائل ہے وہ کہتا ہے کہ نہ اللہ کے ساتھ انس ہے اور نہ اس سے وحشت۔ اور ہر ایک اپنے ذوق کے مطابق ہے، کیونکہ وہی اس پر حاکم ہے۔ اور ہم جیسے لوگوں کو جو مقامات اور مراتب پر اشراف (نگرانی) رکھتے ہیں، وہ تمیز کرتے ہیں اور ہر شخص کو پہچانتے ہیں کہ وہ کہاں سے بات کر رہا ہے اور اس کا کلام کہاں سے ہے، اور یہ کہ وہ اپنے مرتبے میں درست ہے، غلطی کرنے والا نہیں ہے۔ بلکہ عالم میں مطلقاً کوئی غلطی نہیں ہے۔ اور اللہ یَقُولُ الْحَقَّ وهُوَ یَهْدِی السَّبِیلَ (اور اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے۔) [قرآن، سورۃ الاحزاب: ۴]",
    "fa": "«باب دویست و چهلم در انس (الأنس)»\n\nانس با انس است، نه با صورت‌ها، که ما را گرد می‌آورد؛\nپس برحذر باش، زیرا تو فریب‌خورده و مکر شده‌ای.\nاز آنچه نمی‌دانی و نسبت به آن جاهلی پیروی مکن،\nزیرا دوستی تو هم پراکنده است و هم جمع.\nتو امام هستی، اما حکمت در توست،\nکه نشان می‌دهد تو مخلوق و ساخته شده‌ای.\nپس چگونه انس گیرد کسی که شواهدش فانی می‌شوند،\nو هستی‌هایش، در حالی که او در گوش‌ها شنیده می‌شود؟\n\n[اینکه انس نزد این طایفه، گشاده‌رویی‌ای است که از جانب حق برای بنده حاصل می‌شود]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که انس (الأنس) نزد این طایفه، گشاده‌رویی‌ای (المباسطة) است که از جانب حق (الحق) برای بنده حاصل می‌شود. این گشاده‌رویی گاهی در حجاب و گاهی بر کشف (الکشف) واقع می‌شود. انس، حالتی است که برای قلب از تجلی (التجلی) جمال حاصل می‌گردد. نزد بیشتر این طایفه، انس از تجلی جمال است، و این اشتباهی است از جمله اشتباهاتی که مرتکب شده‌اند؛ زیرا آنان به دلیل عدم تمییز میان حقایق، در عبارت‌پردازی دچار خطا می‌شوند. چنین نیست که همه اهل الله، تمییز و فرقان (الفرقان) را همراه با شهود (الشهود) صحیح روزی داده شده باشند. بلکه مهم، شناخت این است که آنچه شهود بر آن واقع شده، چیست. ما گروهی را دیده‌ایم که حقیقتی را شهود کردند، اما آنچه را شهود کرده بودند نشناختند و آن را بر خلاف مسیرش حمل کردند. بنابراین، همراه با تجلی، ناگزیر باید تعریفی الهی وجود داشته باشد، یا از طریق صفای الهام، یا از طریق آنچه حق (الحق) از انواع تعریف اراده کرده است. انس با خدا نزد صاحبش علامتی دارد، زیرا این موضعی است که بسیاری از اهل طریق در آن دچار اشتباه می‌شوند؛ آنان در حالی که بر آن هستند، انسی می‌یابند و گمان می‌کنند که آن انس با خداست. پس اگر آن حال را از دست بدهند، انس با خدا را نیز از دست می‌دهند. از نظر ما و نزد این جماعت، انس او با آن حال بوده است نه با خدا؛ زیرا انس با خدا اگر واقع شود، در هر حالی نزد او موجود خواهد بود. به همین دلیل است که این طایفه می‌گویند: کسی که در خلوت (الخلوة) با خدا انس گرفت و آن انس را در جمع (الملأ) از دست داد، انس او با خلوت بوده است نه با خدا.\n\n[اینکه انس به واسطه اسم الهی خاص و معینی است]\n\nو بدان که انس با «الله» نزد محققان صحیح نیست، بلکه انس تنها به واسطه اسم الهی خاص و معینی است، نه به واسطه اسم الله (الاسم الله). همچنین، هر آنچه از جانب خدا برای بندگانش رخ می‌دهد، صحیح نیست که از حکم اسم الله باشد، زیرا اسم الله، اسم جامع حقایق اسماء الهی است. بنابراین، هیچ امری برای شخص معینی در هستی (الکون) واقع نمی‌شود مگر از اسم معینی؛ بلکه هیچ چیزی در کل هستی، یعنی در هر آنچه غیر از خداست، که عمومیت داشته باشد، ظاهر نمی‌شود مگر از اسم خاص معینی که صحیح نیست اسم الله باشد. زیرا از احکام اسم الله، غنی بودن از عالمیان (الغني عن العالمين) است، همان‌طور که از احکام آن، ظهور عالم و محبت او سبحانه به آن ظهور است. و غنی از عالم به عالم شاد نمی‌شود، در حالی که خداوند به توبه بنده‌اش شاد می‌شود. پس مرتبه اسم الله را بشناس، و حکم آن به دلیل تقابلی که در آن است، نمی‌تواند در عالم ظاهر شود. این مسئله‌ای عظیم، گرانقدر و دشوار در تصور الهیات است؛ زیرا اگر چیزی امری را به ذات خود اقتضا کند، محال است که ذات به بی‌نیازی از آن امر متصف شود، همان‌طور که به نیازمندی به آن متصف نمی‌شود. و «غنی از عالمیان» وارد شده است. اگر آن را غنی از دلالت قرار دهیم، گویی می‌گوید: من عالم را نیافریدم تا بر من دلالت کند و آن را نشانه‌ای بر وجودم ظاهر نکردم، بلکه آن را ظاهر کردم تا حکم حقایق اسماء من آشکار شود، و من نشانه‌ای بر غیر خود ندارم. پس هنگامی که تجلی (التجلی) کنم، به واسطه خود تجلی شناخته می‌شوم. و عالم نشانه‌ای بر حقایق اسماء است، نه بر من، و همچنین نشانه‌ای است بر اینکه من مستند آن هستم و نه غیر. پس تمام عالم دارای انس با خداست، اما برخی از آن آگاه نیستند که انسی که بر آن هستند، به واسطه خداست؛ زیرا ناگزیر باید به امری انس یابد، یا به طریق دوام یا به طریق انتقال به انسی که با امر دیگری می‌یابد. و برای غیر خدا در هستی‌ها (الأکوان) حکمی نیست، پس انس او جز به خدا نبوده است، هرچند که نداند. و آنچه او در آن می‌نگرد که با آن انس گرفته است، صورتی از صور تجلی (التجلی) اوست، اما گاهی شناخته می‌شود و گاهی انکار می‌گردد. پس بنده از عین همان چیزی که با آن انس گرفته است، وحشت می‌کند، در حالی که به دلیل اختلاف صور، متوجه نمی‌شود. پس هیچ کس انس با خدا را از دست نداده است و هیچ کس جز از خدا وحشت نکرده است. و انس، گشاده‌رویی (مباسطة) است و وحشت (الاستيحاش)، انقباض (انقباض). و انس عالمان به خدا، در واقع انس آنان به نفوس خودشان است نه به خدا، زیرا آنان دانسته‌اند که از خدا جز صورت آنچه بر آن هستند نمی‌بینند، و انس نزد آنان جز با آنچه می‌بینند واقع نمی‌شود. و غیر عارفان انس را جز با غیر نمی‌بینند، پس هنگام انفراد با نفوس خود، وحشت (الوحشة) آنان را درمی‌یابد. و همچنین وحشت، تنها از نفوس خودشان است، زیرا حق (الحق) محل تجلی آنان است. پس آنان بر حسب آنچه در خود، بلکه در او، از احوالشان می‌بینند، حکم انس یا وحشت بر آنان واقع می‌شود. و حقیقت انس تنها با مناسبت (المناسب) حاصل می‌شود. پس کسی که قائل به مناسبت است، قائل به انس با خداست، و کسی که قائل به رفع مناسبت است، می‌گوید نه انسی با خدا هست و نه وحشتی از او. و هر یک بر حسب ذوق خود حکم می‌کند، زیرا ذوق حاکم بر اوست. و کسی که مانند ما بر مقامات و مراتب اشراف دارد، تمییز می‌دهد و می‌شناسد که هر شخص از کجا سخن می‌گوید و نطق او از کجاست، و اینکه او در مرتبه خود بر صواب است و خطا نمی‌کند، بلکه مطلقاً خطایی در عالم نیست. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}