{
  "id": 349,
  "title": {
    "ar": "الباب التاسع والأربعون وثلاثمائة في معرفة منزل فتح الأبواب وغلقها وخلق كل أمة من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Forty-Nine: Concerning the Gnosis (معرفة) of the Station (منزل) of the Opening and Closing of the Doors, and the Creation of Every Community from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو انچاس (۳۴۹): دروازوں کے کھلنے اور بند ہونے کے مقام (منزل) کی معرفت اور ہر امت کی تخلیق (الحضرة المحمدية) سے۔",
    "fa": "باب سیصد و چهل و نهم در معرفت منزل گشودن و بستن درها و آفرینش هر امت از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب التاسع والأربعون وثلاثمائة في معرفة منزل فتح الأبواب وغلقها وخلق كل أمة من الحضرة المحمدية»\n\n\n> لا ترم شيئا من الأكوان أن لها *** نعتا من الحق والأكوان أعلام‏\n\n\n> من غيرة الحق كان الحق أعينها *** أتى بذلك قرآن وإلهام‏\n\n\n> لو لا افتقاري وذلي ما اجتمعت به *** ولا تحقق لي قرب وإلمام‏\n\n\n> في حقه كل موجود سعى ومشى *** قضى به في كتاب الله إعلام‏\n\n\n> فكل شي‏ء من الأعيان سبحه *** لذاك أوجده والله علام‏\n\n\n> وكل كون من الأكوان مفتقر *** في كل حال فلذات وآلام‏\n\n\n> أين الغني وكلام الله أبطله *** فما ترى غير فقر فيه إعدام‏\n\n\nقال الله تعالى فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ وقال تعالى الشَّيْطانُ يَعِدُكُمُ الْفَقْرَ ويَأْمُرُكُمْ بِالْفَحْشاءِ والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ لما أمركم به من الفحشاء وفضلا لما وعدكم به من الفقر والله غَنِيٌّ حَمِيدٌ وقال تعالى يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ وقال لأبي يزيد البسطامي يا أبا يزيد تقرب إلي بما ليس لي الذلة والافتقار\n\n\n### [أن لله أبوابا فتحها للخير وأبوابا أعدها لم يصل أوان وقت فتحها للخير]\n\n\nواعلم أن لله أبوابا فتحها للخير وأبوابا أعدها لم يصل أوان وقت فتحها للخير أيضا وأبوابا فتحها للآلام المعبر عنها بالعذاب لما يؤول إليه أمر أصحابه فيستعذبه في آخر الحال ولذلك سماه عذابا وإنما يستعذبه في آخر الأمر لكونه ذكره بربه فإن الإنسان إذا أصابه الضر وانقطعت به الأسباب وهو أشد العذاب ذكر ربه فرجع إليه مضطرا لا مختارا فيستعذب عند ذلك الأمر الذي رده إلى الله وذكره به وأخرجه عن حكم غفلته ونسيانه فسماه عذابا فهو اسم مبشر لمن حل به بالرحمة إنها تدركه فما ألطف توصيل الحق بشارته لعباده في حال الشدة والرخاء ولو لا ذلك ما حقت الكلمة في قوله أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ فأتى بلفظة العذاب أ لا ترى إبراهيم الخليل عليه السلام يقول يا أَبَتِ إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ والرحمن لا يعطي ألما موجعا إلا أن يكون في طيه رحمة يستعذبها من قام به ذلك الألم كشرب الدواء الذي يتضمن العافية استعماله أ لا تراه كيف قال لأبيه إِنَّ الشَّيْطانَ كانَ لِلرَّحْمنِ عَصِيًّا فلو علم إن في الرحمة ما يوجب النقمة لما عصاه فما عصى إلا الرحمن لأن كل اسم يَعْمَلُ عَلى‏ شاكِلَتِهِ فما أعلم الأنبياء بربهم وأشد الآلام عدم نيل الغرض وقد روينا أن الله يقول للملك لا تقضي حاجة فلان في هذا الوقت فإني أحب أن أسمع صوته وإن كان يتألم ذلك الشخص من فقد ما يسأل فيه ربه فهذا منع مؤلم عن رحمة إلهية ثم إن السور باطنه فيه الرحمة الخالصة وظاهره من قبله العذاب ولم يقل آلام العذاب لعلمه بما يؤول إليه الأمر فأبان تعالى أن باطن هذا الموجود فيه الرحمة والظاهر منه لا يتصرف إلا بحكم الباطن فلا يكون أمر مؤلم في الظاهر إلا عن رحمة في الباطن فإن الحكم للباطن في الظاهر هل تتصرف الجوارح وهي الظاهرة إلا عن قصد الباطن المصرف لها والقصد باطن بلا شك فما كان العذاب في ظاهر السور إلا عن قصد الرحمة به التي في باطن السور فليس الألم بشي‏ء سوى عدم اللذة ونيل الغرض فما عند الله باب يفتح إلا أبواب الرحمة غير أنه ثم رحمة ظاهرة لا ألم فيها وثم رحمة باطنة يكون فيها ألم في الوقت لا غير ثم يظهر حكمها في المال فالآلام عوارض واللذات ثوابت فالعالم مرحوم بالذات متالم بما يعرض له والله عَزِيزٌ حَكِيمٌ يضع الأمور مواضعها وينزلها منازلها الإنسان يضرب ابنه أدبا ويؤلمه بذلك الضرب عقوبة لذنبه وهو يرحمه بباطنه فإذا وفي الأمر حقه أظهر له ما في قلبه وباطنه من الرحمة به وشفقة الوالد على ولده ولهذا\n\n\nورد في الخبر عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في قصة طويلة يقول فيها وإن الله أشفق على عبده من هذه على ولدها وأشار إلى امرأة\n\n\nوهذا كله من علوم الأذواق جعلنا الله والسامعين من أهل الرحمة الخالصة التي لا ألم لها بمنه‏\n\n\n### [أن الوجود هو الخير المحض الذي لا شر فيه‏]\n\n\nواعلم أن الله ما أظهر الممكنات في أعيانها موجودة إلا ليخرجها من شر العدم إذ علم أن الوجود هو الخير المحض الذي لا شر فيه إلا بحكم العرض وهو من كونه ممكنا للعدم نظر إليه وهو الآن موصوف بالوجود فهو في الخير المحض فالذي يناله من حيث هو ممكن من نظر العدم إليه في حال وجوده ذلك القدر يكون الشر الذي يجده العالم حيث وجده فإذا نظر الممكن إلى وجوده وأبده سر لاستصحابه الوجود له وإذا نظر إلى‏\nالحالة التي كان موصوفا بها ولا وجود له تألم بمشاهدته لأن الحال له الحكم فيمن قام به وحال هذا الممكن الآن مشاهدة العدم فيتعذب عذابا وهميا\n\n\nكان النبي صَلَّى اللهُ عَليهِ وسَلَّم يقول في الضراء الحمد لله على كل حال‏\n\n\nومن الأحوال الموجبة للحمد أحوال السراء التي حمدها الحمد لله المنعم المتفضل فلو لا إن الحمد على كل حال يتضمن حمد السراء فهو إعلام بأن في الضراء سراء لعموم حمدها والحمد ثناء على المحمود وصاحب الضراء لو لم يكن في طي تلك الضراء سراء لم يكن ذلك الحمد ثناء من الحامد في حال الضراء والحمد ثناء بلا شك في نفس الأمر فما في العالم ضر لا يكون مشوبا برحمة كما إن المؤمن لا تخلص له معصية غير مشوبة بطاعة أصلا وهي طاعة الايمان فهو في مخالفته طائع عاص كالمعذب المرحوم‏\n\n\n### [إن الممكنات مفتقرة بالذات فلا يزال الفقر يصحبها دائما]\n\n\nثم لتعلم إن الممكنات مفتقرة بالذات فلا يزال الفقر يصحبها دائما لأن ذاتها دائمة فوضع لها الأسباب التي يحصل لها عندها ما افتقرت فيه فافتقرت إلى الأسباب فجعل الله عين الأسباب أسماء له فأسماء الأسباب من أسمائه تعالى حتى لا يفتقر إلا إليه لأنه العلم الصحيح فلا فرق عند أهل الكشف بين الأسماء التي يقال في العرف والشرع إنها أسماء الله وبين أسماء الأسباب أنها أسماء الله فإنه قال أَنْتُمُ الْفُقَراءُ إِلَى الله ونحن نرى الواقع الافتقار إلى الأسباب فلا بد أن تكون أسماء الأسباب أسماء الله تعالى فندعوه بها دعاء الحال لا دعاء الألفاظ فإذا مسنا الجوع سارعنا إلى الغذاء المزيل ألم الجوع فافتقرنا إليه وهو مستغن عنا ولا نفتقر إلا إلى الله فهذا اسم من أسمائه أعني صورة ذلك الغذاء النازل منزلة صورة لفظ الاسم الإلهي أو صورة رقمه ولذلك أمر بشكر الأسباب لأنه أمر بشكره فهو الثناء عليه بها\n\n\n### [أن من رحمة الله بخلقه أن جعل على قدم كل نبي وليا وارثا له‏]\n\n\nواعلم أن من رحمة الله بخلقه أن جعل على قدم كل نبي وليا وارثا له فما زاد فلا بد أن يكون في كل عصر مائة ألف ولي وأربعة وعشرون ألف ولي على عدد الأنبياء ويزيدون ولا ينقصون فإن زادوا قسم الله علم ذلك النبي على من ورثه فإن العلوم المنزلة على قلوب الأنبياء لا ترتفع من الدنيا وليس لها إلا قلوب الرجال فتقسم عليهم بحسب عددهم فلا بد من أن يكون في الأمة من الأولياء على عدد الأنبياء وأكثر من ذلك‏\n\n\nروينا عن الخضر أنه قال ما من يوم حدثت فيه نفسي إنه ما بقي ولي لله في الأرض إلا قد رأيته واجتمعت به فلا بد لي أن اجتمع في ذلك اليوم مع ولي لله لم أكن عرفته قبل ذلك‏\n\n\nوروينا عنه أنه قال اجتمعت بشخص يوما لم أعرفه فقال لي يا خضر سلام عليك فقلت له من أين عرفتني فقال لي إن الله عرفني بك‏\n\n\nفعلمت إن لله عبادا يعرفون الخضر ولا يعرفهم الخضر\n\n\n### [أن لله عبادا أخفياء أبرياء أصفياء أولياء]\n\n\nواعلم أن لله عبادا أخفياء أبرياء أصفياء أولياء بينهم وبين الناس حجب العوائد غامضين في الناس لا يظهر عليهم ما يميزهم عن الناس وبهم يحفظ الله العالم وينصر عباده معروفون في السماء مجهولون في الأرض عند أبناء الجنس لهم المهنأة في الدنيا والآخرة ليسوا بأنبياء ولا شهداء يغبطهم النبيون والشهداء لا في الدنيا يعرفون ولا في الآخرة يشفعون انفردوا بالحق في سرائرهم وما كنت عرفت أن الله قد جعل في الوجود وليا له على كل قدم نبي فإن الله تعالى لما جمع بيني وبين أنبيائه كلهم حتى ما بقي منهم نبي إلا رأيته في مجلس واحد لم أر معهم أحدا ممن هو على قدمهم ثم بعد ذلك رأيت جميع المؤمنين وفيهم الذين هم على أقدام الأنبياء وغيرهم من الأولياء فلما لم يجمعهم مجلس واحد لذلك لم أعرفهم ثم عرفتهم بعد ذلك ونفعني الله برؤيتهم وكان شيخنا أبو العباس العريبي على قدم عيسى عليه السلام وكنا نقول قبل هذا أن ثم أولياء على قلوب الأنبياء فقيل لنا لا بل قل هم على أقدام الأنبياء لا تقل على قلوبهم فعلمت ما أراد بذلك لما أطلعني الله على ذلك رأيتهم على آثارهم يقفون ورأيت لهم معراجين المعراج الواحد يكونون فيه على قلوب الأنبياء ولكن من حيث هم الأنبياء أولياء النبوة التي لا شرع فيها والمعراج الثاني يكونون فيه على أقدام الأنبياء أصحاب الشرائع لا على قلوبهم إذ لو كانوا على قلوبهم لنالوا ما نالته الأنبياء من الأحكام المشروعة وليس ذلك لهم وإن وقع لهم التعريف الإلهي بذلك ويأخذون الشرع من حيث أخذته الأنبياء ولكن من مشكاة أنوار الأنبياء يقترن معه حكم الاتباع فما يخلص لهم ذلك من الله ولا من الروح القدسي وما عدا هذا الفن من العلم فإنه مخلص للأولياء من الله سبحانه ومن الأرواح القدسية وهذا كله لتتميز المراتب عند الله لنعرف ذلك فنعطي كل ذي حق حقه كما أعطى الله كل شي‏ء خلقه وهذا كله من رحمة الله التي أفاضها على خلقه‏\n\n\n### [إن الله جعل للملائكة ثلاث مراتب في القوة الإلهية]\n\n\nثم لتعلم إن الله جعل للملائكة ثلاث مراتب في القوة الإلهية فمنهم من أعطاه قوتين ومنهم من أعطاه ثلاث قوى‏\nومنهم من أعطاه أربع قوى وهي الغاية فإن الوجود على التربيع قام من غير مزيد إلا أنه كل قوة تضمن قوى لا يعلم عددها إلا الله وذلك من حيث إن الملائكة أجسام نورية فلهم هذه القوي من حيث أجسامهم فإنهم مركبون كالأجسام الطبيعية فالملك صاحب القوتين على تركيب النبات وصاحب الثلاث على تركيب الحيوان وصاحب الأربع على تركيب الإنسان وانتهت المولدات فانتهت قوى الملائكة والجسم يجمع الكل فله الإحاطة فقبلت الملائكة الأجسام النورية من العماء الذي ظهر فيه الجسم النوري الكل وقبل الشكل والصور وفيه نظهر الأرواح الملكية والعماء لهذا الجسم الكل وما يحمله من الصور والأشكال الإلهية والروحانية بمنزلة الهيولى في الأجسام الطبيعية سواء والتفصيل في ذلك يطول ومن هذا النور الذي فوق الطبيعة تنفخ الأرواح في الأجسام الطبيعية فما تحت الطبيعة إلى العناصر أنوار في ظلال وما تحت العناصر من الأجسام العنصرية أنوار في ظلمة وما فوق الطبيعة من الأجسام النورية أنوار في أنوار وإن شئت أنوار في أنفاس رحمانية وإن شئت أنوار في عماء كيفما شئت عبر إذا عرفت الأمر على ما هو عليه‏\n\n\n### [أن كل روح مما هو تحت العقل الأول صاحب الكلمة فهو ملك‏]\n\n\nواعلم أن كل روح مما هو تحت العقل الأول صاحب الكلمة فهو ملك وما فوقه فهو روح لا ملك فأما الملائكة فهم ما بين مسخر ومدبر وكلهم رسل الله عن أمر الله حفظة وهم على مراتب ولهم معارج ونزول وصعود دنيا وآخرة فمنهم المسخرون في الدعاء والاستغفار للمؤمنين وآخرون في الاستغفار لِمَنْ في الْأَرْضِ ومنهم المسخرون في مصالح العالم المتعلقة بالدنيا ومنهم المسخرون في مصالح العالم المتعلقة بالآخرة وهذا القدر من العمل الذي هم عليه هو عبادتهم وصلاتهم وأما تسبيحهم فذكر الله في هذه الصلوات التي لهم كالقراءة والذكر لنا في صلاتنا ولا يزال الأمر كذلك إلى الوقت الذي يشاء الله أن تعم الرحمة جميع خلقه التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فإذا عمتهم الرحمة لم يبق لبعض الملائكة الذين كان لهم الاستغفار من عبادتهم إلا التسبيح خاصة وبقيت الملائكة الذين لهم تعلق بأحوالنا في الجنان وحيث كان من كان من الدارين فذلك منهم لا ينقطع وزال عن أولئك اسم الملائكة وبقوا أرواحا لا شغل لهم إلا التسبيح والتمجيد لله تعالى كسائر الأرواح المهيمة والْمَلائِكَةُ يَدْخُلُونَ عَلَيْهِمْ من كُلِّ بابٍ سَلامٌ عَلَيْكُمْ بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ فهذا الصنف المذكور هنا هم الصابرون أهل البلاء من البشر وأما الملائكة التي تدخل على أصحاب النعيم الشاكرين فلم يجر لهم ذكر مع أنه لا بد من دخول الملائكة عليهم من كل باب لأن أبواب النعيم كثيرة كما هي أبواب البلاء ومن رأى أن النعم التي أنعم الله بها على عباده في الدنيا ليست بخالصة من البلاء لما وجه عليهم فيها من التكليف بالشكر عليها وهو أعظم البلاء إذ كانت النعم أشد في الحجاب عن الله من الرزايا فدخل أهل النعيم على هذا في قول الملائكة بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ أي حصلتم في دار نعيمها غير مشوب بتكليف ولا طلب حق فلذلك لم يجر ذكر لأحوال الملائكة مع الشاكرين واقتصر على ما جاء به الحق من التعريف وهو الصحيح فإن الدار الدنيا تعطي هذا وهو الذي يقتضيه الكشف الذي لا تلبيس فيه إن جميع من في الدار الدنيا من مبتلى ومنعم عليه له حال الصبر فالصبر أعم من الشكر والبلاء أعم من النعم في هذه الدار وإذا عمت الرحمة وارتفعت الآثار التي تناقض الرحمة ارتفعت نسب الأسماء التي عينتها الآثار لأنها راجعة إلى عين واحدة كما بين تعالى في قوله ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ وقال قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ والأسماء وضعية وضعتها حقائق الممكنات بما تطلبه فعلى قدر ما تكون عليه من الاستعداد تطلب ما يناسب ذلك من الفيض الإلهي فإذا أعطيته وضعت لكل عين من ذلك أسماء فإذا لم يبق لها استعداد تقبل به الألم والعذاب لم يوجد للألم ولا للعذاب عين لعدم القابل فترتفع نسب الأسماء المختصة بهذه الأحكام لارتفاع القوابل وما كان له من الأسماء حكمان في القابل فإنه يبقى كالغافر وهو الساتر فلم يبق ذنب يطلب الغافر وللغافر حكم الحجاب من كونه حجابا مطلقا فيبقى الغافر وإن زال المذنب فإن الغفر لا بد منه ولو لا ذلك لم يكن مزيد ولا خلق جديد والمزيد على الدوام فرفع الستور على الدوام وليس سوى الاسم الغفور بخلاف المنتقم فإن القابل ارتفع فزال هذا الوضع الخاص فاعلم ذلك وفي هذا المنزل من العلوم علم ثناء السماء والأرض والملائكة دون سائر الخلق وما يثنون به على ربهم فإنه لكل عالم ثناء خاص لا يكون لغيره قال تعالى تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ والْأَرْضُ ثم‏\nقال ومن فِيهِنَّ وجمع السموات والأرض جمع من يعقل وفيه علم التشبيه والكنايات وما في العالم الروحاني من القوي وفيه علم الرسائل المبثوثة في العالم وأنه كل من يمشي في العالم فإنه لا يمشي إلا رسولا برسالة وهو علم شريف حتى الدودة في حركاتها هي في رسالة تسعى بها لمن عقل ذلك وفيه علم آثار القدرة وتمييزها عن سائر النسب وفيه علم الأنواء وما يحمد منها وقول أبي هريرة رضي الله عنه مطرنا بنوء الفتح وفيه علم الأبواب ومراتبها وفيه علم أن المنع الإلهي عطاء وفيه علم التحديد الإلهي وفيه علم تنزيل الخطاب الإلهي على قدر التواطؤ وفيه علم الإنباه الإلهي في طلب الشكر من عباده وفيه علم رد الخلق إليه تعالى وفيه علم المواعيد على الإطلاق وفيه علم المميز بين الأعداء الظاهرين بصورة الولاء وبين الأولياء وفيه علم مجازاة العدو بالعداوة والولي بالولاية فيما بين العالم وأنه من اتخذ العدو وليا أو الولي عدوا فهو مخلط لا حقيقة عنده وفيه علم كل داع إنما يدعو لنفسه وإن دعا إلى الله تعالى أو لغير نفسه فإنما يدعو من حيث نفسه فإنه يطلب بذلك الدعاء الأنس بالأشكال في المرتبة وفيه علم ترتيب الثواب على الأعمال وفيه تمييز الأجور فإن منها العظيم والكريم والكبير وهي مراتب في الأجور لا بد أن يعرف أصحابها وأعمالها التي توجبها وعلم الأجر المطلق الذي لا يتقيد هل هو مقيد في نفس الأمر أم لا فإن الأجور أربعة كما إن نشأة الإنسان على أربع كما إن نشأة جسده على أربع لكل واحد أجر يخصه على صفة مخصوصة فينسب كل أجر إلى ما يناسبه وفيه علم ما وراء الستور وفيه علم القبيح الذي تحسنه المشاهدة وهو سر عجيب وفيه علم العزل وفيه علم الحث على اشتغال الإنسان بنفسه وفيه علم الظهور من الخفاء وفيه علم الحاملات العلوية والسفلية وفيه علم تفاضل الصفات في الموصوفين بشديد وأشد وفيه علم الحضرة الجامعة للمنافع الإنسانية وهي حضرة النعم للراحل والقاطن والمتحرك والساكن وفيه علم التسخير والمسخرات وهل كل مسخر له أجل ينتهي إليه بتسخيره أم لا أو بعضه له أجل وبعضه لا أجل له وفيه علم عند جهينة الخبر اليقين وقولهم على الخبير سقطت ولم يقولوا على العليم سقطت ولم يقولوا عند جهينة العلم اليقين وفيه\n\n\nعلم ظهور الحق وسريانه في كل شي‏ء وتقسيمات الحق في قوله لكل حق حقيقة فأدخل عليه كل وفيه علم انفراد كل مكلف بنفسه والفرق بينه وبين من لا ينفرد من المكلفين بنفسه أعني من الثقلين وفيما ينفرد وفيما لا ينفرد وفيه علم القوابل وفيمن يؤثر الداعي وفيه علم ما يكون لأصحاب القبور في قبورهم وما هي القبور وفيه علم الأخذ من كل أحد وصفة المأخوذ والمأخوذ منه وفيه علم الأعراض هل هي نسب عدمية أو أمور وجودية لها أعيان وفيه علم ما يحصل لأهل العناية من العزة والحجاب وفيه علم مراتب اتباع الأنبياء وفيه علم المزيد وفيه علم التمني وفيه علم سريان الحكمة في مراتب الموجودات على ما هي عليه وفيه علم السبق الإلهي للعالم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Forty-Nine: Concerning the Station of Knowing the Opening and Closing of the Doors, and the Creation of Every Community from the Muhammadan Presence (الحضرة المحمدية)\n\nDo not assume that anything in the cosmos (الأكوان) possesses an attribute (نعت) belonging to the Real (الحق), for the cosmos consists only of signs (أعلام).\nOut of the Real’s jealousy (غيرة الحق), the Real became their very essences (أعينها). The Qur’an and divine inspiration (إلهام) have brought this truth.\nWere it not for my utter need (افتقاري) and lowliness (ذلي), I would not have been united with Him, nor would proximity (قرب) and attainment (إلمام) have been realized for me.\nIn relation to the Real, every existent thing strives and moves; a declaration (إعلام) decreed this in the Book of Allah.\nThus, everything among the Fixed Entities (الأعيان) glorifies Him; for this reason, He brought it into existence, and Allah is All-Knowing (علام).\nAnd every being (كون) in the cosmos (الأكوان) is utterly needy (مفتقر) in every state, whether in pleasures (لذات) or in pains (آلام).\nWhere is the self-sufficient one, when the Word of Allah invalidates him? Thus, you see nothing but poverty (فقر) that entails annihilation (إعدام).\n\nAllah the Exalted said: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed Allah is Self-Sufficient beyond the worlds). And He the Exalted said: <<الشَّيْطانُ يَعِدُكُمُ الْفَقْرَ ويَأْمُرُكُمْ بِالْفَحْشاءِ والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ>> (Satan promises you poverty and enjoins upon you immorality, while Allah promises you forgiveness from Him) for what He commanded you regarding immorality, <<وفضلا>> (and bounty) for what He promised you regarding poverty, <<والله غَنِيٌّ حَمِيدٌ>> (And Allah is Self-Sufficient and Praiseworthy). And He the Exalted said: <<يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ>> (O mankind, you are the needy ones toward Allah, and Allah is the Self-Sufficient, the Praiseworthy). And He said to Abu Yazid al-Bistami: \"O Abu Yazid, draw near to Me through that which I do not possess: lowliness (الذلة) and utter need (الافتقار).\"\n\n### [That Allah has doors He has opened for good, and doors He has prepared whose time for opening for good has not yet arrived]\n\nKnow that Allah has doors He has opened for good, and doors He has prepared whose time for opening for good has not yet arrived. He also has doors He has opened for pains, which are expressed as torment (العذاب) because of the ultimate outcome for those who experience it, whereby they find it sweet (يستعذبه) in the final state. For this reason, He named it torment. The only reason they find it sweet in the end is that it reminds them of their Lord. When a human being is afflicted by harm and all means are cut off—which is the most intense torment—he remembers his Lord and returns to Him, compelled, not by choice. He then finds sweetness in the very thing that returned him to Allah, reminded him of Him, and removed him from the rule of his heedlessness and forgetfulness. Thus, He named it torment ('Adhab), which is a name that brings glad tidings of mercy (رحمة) to the one afflicted, indicating that mercy will reach him. How subtle is the Real’s (الحق) conveyance of His glad tidings to His servants in times of hardship and ease! Were it not for this, the Word would not have been established in His saying: <<أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ>> (Then is one upon whom the word of torment has come true...). He used the word 'torment.' Do you not see that Abraham the Intimate Friend, peace be upon him, said: <<يا أَبَتِ إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ>> (O my father, indeed I fear that there will touch you a torment from the Most Merciful (الرحمن))? The Most Merciful does not inflict painful suffering unless it contains within it a mercy that is found sweet by the one experiencing that pain, like drinking medicine that contains healing in its use. Do you not see how he said to his father: <<إِنَّ الشَّيْطانَ كانَ لِلرَّحْمنِ عَصِيًّا>> (Indeed Satan has been disobedient to the Most Merciful)? If Satan had known that mercy contained something necessitating vengeance, he would not have disobeyed Him. He only disobeyed the Most Merciful because every Name acts according to its own nature (شاكلته). How knowledgeable the Prophets are concerning their Lord!\n\nThe most intense pain is the failure to attain one's goal. We have related that Allah says to the Angel: \"Do not fulfill the need of so-and-so at this time, for I love to hear his voice,\" even though that person is suffering from the loss of what he asks his Lord for. This painful withholding is thus a divine mercy.\n\nFurthermore, the inner aspect of the wall (السور) contains pure mercy, while its outer aspect is the torment that comes from its direction. He did not say 'pains of torment' because He knew the ultimate outcome of the matter. Thus, the Exalted made clear that the inner aspect of this existent thing contains mercy, and its outer aspect acts only according to the rule of the inner. Therefore, no painful matter occurs in the outer aspect except through mercy in the inner aspect, for the rule belongs to the inner over the outer. Do the limbs, which are the outer aspect, act except by the intention of the inner aspect that directs them? And intention is undoubtedly inner. Thus, the torment in the outer aspect of the wall is only due to the intention of the mercy contained in the inner aspect of the wall.\n\nPain is nothing other than the absence of pleasure and the failure to attain the goal. Therefore, there is no door opened by Allah except the doors of Mercy. However, there is an apparent mercy in which there is no pain, and there is an inner mercy in which there is pain only temporarily, and then its rule becomes manifest in the end. Pains are accidents (عوارض), while pleasures are constants (ثوابت). The cosmos is essentially (بالذات) treated with mercy, but suffers due to what is accidental to it. And Allah is Almighty and Wise (عَزِيزٌ حَكِيمٌ), placing things in their proper places and assigning them to their stations. A human being strikes his son for discipline and causes him pain by that striking as punishment for his sin, yet he is merciful to him in his inner being. When the matter is fulfilled, he reveals to him the mercy and parental compassion that was in his heart and inner being. For this reason,\n\nIt was related in the tradition (الخبر) from the Messenger of Allah, peace and blessings be upon him, in a long story where he says: \"And Allah is more compassionate toward His servant than this woman is toward her child,\" pointing to a woman.\n\nAll of this is from the sciences of direct experience (علوم الأذواق). May Allah make us and the listeners among the people of pure mercy (الرحمة الخالصة) that contains no pain, by His grace.\n\n### [That Existence (الوجود) is Pure Goodness, in which there is no evil]\n\nKnow that Allah did not manifest the contingent beings (الممكنات) in their essences (أعيانها) as existent except to bring them out of the evil of non-existence (العدم). He knew that Existence (الوجود) is Pure Goodness (الخير المحض), in which there is no evil except by way of accident (حكم العرض). This accident arises from the contingent being's possibility of non-existence, which it contemplates even while it is now described by Existence. Thus, it is in Pure Goodness. The measure of evil that the cosmos finds, where it finds it, is that portion which reaches the contingent being from the contemplation of non-existence during its state of existence.\n\nWhen the contingent being contemplates its Existence and its eternity, it rejoices in the continuation of Existence for itself. But when it contemplates the state by which it was previously described—non-existence—it suffers pain from that witnessing, because the state governs the one who is established by it. The current state of this contingent being is the witnessing of non-existence, so it suffers a phantom torment (عذابا وهميا).\n\nThe Prophet, peace and blessings be upon him, used to say in adversity (الضراء): \"Praise be to Allah in every state.\"\n\nAmong the states that necessitate praise are the states of ease (السراء), for which the praise is: \"Praise be to Allah, the Benefactor, the Gracious.\" If the praise \"in every state\" did not include the praise of ease, it would be an indication that there is ease within adversity, due to the universality of the praise. Praise is commendation (ثناء) upon the Praised One. If there were no ease hidden within that adversity for the one experiencing adversity, that praise would not be commendation from the praiser in the state of adversity. And praise is undoubtedly commendation in reality. Thus, there is no harm (ضر) in the world that is not mixed with mercy, just as a believer’s disobedience is never entirely unmixed with an act of obedience—namely, the obedience of faith. Therefore, in his transgression, he is both obedient and disobedient, like the tormented one who is shown mercy.\n\n### [That contingent beings (الممكنات) are essentially needy (مفتقرة بالذات), and poverty (الفقر) accompanies them perpetually]\n\nYou must know that contingent beings are essentially needy (مفتقرة بالذات), and poverty (الفقر) accompanies them perpetually because their essence is perpetual. Therefore, He established for them the means (الأسباب) through which they obtain what they are needy of. Thus, they became needy of the means. Allah made the very essence of the means to be Names belonging to Him, so the names of the means are among His Names, the Exalted, so that one is needy of none but Him, for this is the sound Knowledge (العلم الصحيح).\n\nFor the People of Unveiling (أهل الكشف), there is no difference between the Names that are conventionally and legally called Names of Allah and the names of the means—they are all Names of Allah. For He said: <<أَنْتُمُ الْفُقَراءُ إِلَى الله>> (You are the needy ones toward Allah). And we observe the reality of neediness toward the means. Therefore, the names of the means must be Names of Allah the Exalted, and we call upon Him through them by the prayer of state (دعاء الحال), not the prayer of words. When hunger touches us, we hasten to the food that removes the pain of hunger. We are needy of it, yet it is self-sufficient of us, and we are needy of none but Allah. Thus, this is one of His Names—meaning the form of that food, which occupies the rank of the form of the word of the Divine Name or the form of its numerical value. For this reason, He commanded us to thank the means, because this is a command to thank Him; it is commendation upon Him through them.\n\n### [That it is part of Allah’s mercy upon His creation that He placed a saint (ولي) as an heir upon the foot (قدم) of every prophet (نبي)]\n\nKnow that it is part of Allah’s mercy upon His creation that He placed a saint (ولي) as an heir upon the foot (قدم) of every prophet (نبي). There must be in every era one hundred and twenty-four thousand saints, corresponding to the number of the prophets, and they may increase but not decrease. If they increase, Allah divides the knowledge of that prophet among those who inherit from him. The sciences revealed upon the hearts of the prophets do not depart from the world, and they have no receptacle except the hearts of men, so they are divided among them according to their number. Thus, there must be in the Community (الأمة) a number of saints equal to or greater than the number of the prophets.\n\nWe have related from Al-Khidr (الخضر) that he said: \"There is no day in which I say to myself that there remains no saint of Allah on earth whom I have not seen and met, but I must meet on that very day a saint of Allah whom I had not known before.\"\n\nWe have related from him that he said: \"I met a person one day whom I did not know, and he said to me, 'O Khidr, peace be upon you.' I said to him, 'How did you know me?' He replied, 'Allah made me know you.'\"\n\nI thus knew that Allah has servants who know Al-Khidr, but whom Al-Khidr does not know.\n\n### [That Allah has hidden, innocent, pure saints (أولياء)]\n\nKnow that Allah has hidden (أخفياء), innocent (أبرياء), pure (أصفياء) saints (أولياء). Between them and the people are the veils of custom (حجب العوائد). They are obscure among the people; nothing appears on them that distinguishes them from others. Through them, Allah preserves the world and grants victory to His servants. They are known in the heavens but unknown on earth among their own kind. They have bliss (المهنأة) in this world and the Hereafter. They are neither prophets nor martyrs, yet the prophets and martyrs envy them. They are not known in this world, nor do they intercede in the Hereafter. They are singled out by the Real (الحق) in their innermost beings (سرائرهم).\n\nI had not known that Allah had placed a saint for Him in existence upon the foot of every prophet. For when Allah the Exalted gathered me with all His prophets—so that not a single prophet remained whom I did not see in one assembly—I did not see anyone with them who was upon their foot. Then, after that, I saw all the believers, and among them were those who were upon the feet of the prophets and other saints. Since they were not gathered in one assembly for that purpose, I did not recognize them. Then I recognized them afterwards, and Allah benefited me through seeing them.\n\nOur Shaykh, Abu al-Abbas al-Uraybi, was upon the foot of Jesus, peace be upon him. Before this, we used to say that there were saints upon the *hearts* of the prophets. Then it was said to us: \"No, rather say they are upon the *feet* of the prophets, do not say upon their hearts.\" I understood what was intended by this when Allah informed me of it. I saw them standing in their footsteps. I saw that they have two ascensions (معراجين). In the first ascension, they are upon the hearts of the prophets, but only insofar as the prophets are saints of the prophethood (الولاية) that contains no law (شرع). The second ascension is where they are upon the feet of the prophets who possess Divine Law (أصحاب الشرائع), but not upon their hearts. For if they were upon their hearts, they would attain the legislative rulings (الأحكام المشروعة) that the prophets attained, and this is not for them, even if divine knowledge (التعريف الإلهي) occurs for them regarding it. They take the Law from the same source the prophets took it, but from the niche of the prophets' lights (مشكاة أنوار الأنبياء), coupled with the rule of adherence (حكم الاتباع). Thus, that knowledge is not purified for them directly from Allah or from the Holy Spirit (الروح القدسي).\n\nAny science other than this type is purified for the saints directly from Allah, the Glorified, and from the Holy Spirits. All of this is so that the Levels (المراتب) may be distinguished before Allah, so that we may know this and give every possessor of a right his due, just as Allah gave everything its creation. All of this is from the Mercy of Allah that He poured out upon His creation.\n\n### [That Allah established three levels (مراتب) of Divine Power (القوة الإلهية) for the angels (الملائكة)]\n\nFurthermore, know that Allah established three levels (مراتب) of Divine Power (القوة الإلهية) for the angels. Some of them were given two powers, some were given three powers, and some were given four powers, which is the limit (الغاية). For Existence (الوجود) is established upon the Quadrature (التربيع) without increase, except that each power contains powers whose number none knows but Allah. This is because the angels are luminous bodies (أجسام نورية), and they possess these powers by virtue of their bodies, for they are compounded like natural bodies.\n\nThe angel with two powers is based on the composition of the plant. The one with three is based on the composition of the animal. The one with four is based on the composition of the human. The generated things (المولدات) end here, and thus the powers of the angels end here. The body encompasses the whole, so it has comprehensiveness (الإحاطة). The angels accepted the luminous bodies from the Cloud (العماء) in which the Universal Luminous Body (الجسم النوري الكل) appeared and accepted form and shapes. In it appear the angelic spirits. The Cloud is to this Universal Body and the divine and spiritual forms and shapes it carries, exactly what *hyle* (الهيولى - prime matter) is to natural bodies. The detailed explanation of this is lengthy.\n\nFrom this Light that is above nature, the spirits are breathed into the natural bodies. What is below nature, down to the elements, are lights in shadows. What is below the elements, among the elemental bodies, are lights in darkness. What is above nature, among the luminous bodies, are lights in lights, or if you wish, lights in the Breaths of the Merciful (أنفاس رحمانية), or if you wish, lights in the Cloud. You may express it however you wish, once you know the matter as it truly is.\n\n### [That every spirit (روح) below the First Intellect (العقل الأول), the possessor of the Word (الكلمة), is an angel (ملك)]\n\nKnow that every spirit below the First Intellect (العقل الأول), the possessor of the Word (الكلمة), is an angel (ملك). What is above it is a spirit, not an angel. As for the angels, they are between the subjugated (مسخر) and the director (مدبر). All of them are messengers of Allah by His command, and they are guardians (حفظة). They are of various ranks, and they have ascensions, descents, and risings in this world and the Hereafter.\n\nAmong them are those subjugated to supplicate and seek forgiveness for the believers, and others who seek forgiveness <<لِمَنْ في الْأَرْضِ>> (for those on the earth). Some are subjugated to the affairs of the world related to this life, and some are subjugated to the affairs of the world related to the Hereafter. This measure of work they perform is their worship and their prayer. As for their glorification (تسبيحهم), it is the remembrance of Allah within these prayers of theirs, just as recitation and remembrance are for us in our prayer.\n\nThe matter remains thus until the time Allah wills that Mercy (الرحمة) which <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompasses all things) becomes universal for all His creation. When Mercy encompasses them, some angels whose worship consisted of seeking forgiveness will have only glorification (التسبيح) remaining. The angels who are connected to our states in the Gardens (Jinan) and wherever anyone may be in the two abodes (Darayn)—their function will not cease. But the name 'angel' will be removed from the former group, and they will remain spirits (أرواحا) whose only occupation is the glorification and magnification of Allah the Exalted, like the Cherubic Spirits (الأرواح المهيمة).\n\n<<والْمَلائِكَةُ يَدْخُلُونَ عَلَيْهِمْ من كُلِّ بابٍ سَلامٌ عَلَيْكُمْ بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ>> (And the angels will enter upon them from every gate, [saying], \"Peace be upon you for what you patiently endured. And excellent is the final home.\") This group mentioned here are the patient ones, the people of affliction (أهل البلاء) among mankind. As for the angels who enter upon the people of bliss (أصحاب النعيم) who are grateful (الشاكرين), they are not mentioned, even though the angels must enter upon them from every gate, because the doors of bliss are numerous, just as the doors of affliction are.\n\nWhoever holds that the blessings (النعم) Allah bestowed upon His servants in this world are not pure of affliction, due to the burden of being obligated to show gratitude (التكليف بالشكر) for them—which is the greatest affliction, since blessings are a stronger veil (حجاب) from Allah than calamities (الرزايا)—then the people of bliss are included in the angels' saying: <<بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ>> (for what you patiently endured. And excellent is the final home), meaning: you have reached an abode whose bliss is unmixed with obligation or the demand of a right. For this reason, there was no mention of the states of the angels with the grateful ones, and He confined the definition to what the Real brought, which is the correct view. For the worldly abode grants this, and this is what the Unveiling (الكشف) requires, without confusion: that everyone in the worldly abode, whether afflicted or blessed, is in a state of patience (الصبر). Thus, patience is more general than gratitude, and affliction is more general than blessings in this abode.\n\nWhen Mercy becomes universal and the effects that contradict Mercy are lifted, the relations of the Names that were defined by those effects are lifted, because they return to a single Essence, as the Exalted made clear in His saying: <<ولِلَّهِ الْأَسْماءُ الْحُسْنى‏>> (And to Allah belong the Most Beautiful Names). And He said: <<قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏>> (Say, \"Call upon Allah or call upon the Most Merciful. Whichever you call—to Him belong the Most Beautiful Names\").\n\nThe Names are established by the realities of the contingent beings (حقائق الممكنات) according to what they demand. According to the readiness (الاستعداد) they possess, they seek what corresponds to that from the Divine Effusion (الفيض الإلهي). When He grants it to them, He establishes Names for every essence of that Effusion. If they no longer possess the readiness to accept pain and torment, there will be no essence for pain or torment due to the absence of the recipient (القابل). Thus, the relations of the Names specific to these rulings are lifted due to the lifting of the recipients.\n\nAs for the Names that have two rulings in the recipient, they remain, such as the Forgiver (الغافر), who is the Veiler (الساتر). Even if there remains no sin to demand the Forgiver, the Forgiver retains the ruling of the veil, by virtue of being an absolute veil. Thus, the Forgiver remains even if the sinner vanishes, for forgiveness is necessary. Were it not for this, there would be no increase (مزيد) and no new creation. And the increase is perpetual, so the lifting of the veils is perpetual. This is only the Name the Forgiving (الغفور), unlike the Avenger (المنتقم), for the recipient has been lifted, so this specific establishment is removed. Know this.\n\nIn this Station (منزل) of the sciences is the knowledge of the glorification (ثناء) of the heavens, the earth, and the angels, distinct from the rest of creation, and what they use to praise their Lord. For every realm has a specific glorification that belongs to no other. The Exalted said: <<تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ والْأَرْضُ>> (The seven heavens and the earth exalt Him), then He said: <<ومَنْ فِيهِنَّ>> (and whoever is in them), gathering the heavens and the earth as if they were rational beings.\n\nIn it is the science of resemblance (التشبيه) and allusions (الكنايات), and the spiritual powers in the spiritual world. In it is the science of the messages (الرسائل) scattered throughout the cosmos, and that everyone who walks in the world walks only as a messenger with a message. This is a noble science, such that even the worm in its movements is in a message it strives to deliver to the one who understands it. In it is the science of the effects of Power (القدرة) and their distinction from other relations. In it is the science of the stellar mansions (الأنواء) and what is praised among them, and the saying of Abu Hurayrah, may Allah be pleased with him: \"We were rained upon by the stellar mansion of the Opening (نوء الفتح).\" In it is the science of the Doors and their ranks. In it is the science that Divine withholding (المنع الإلهي) is a gift (عطاء). In it is the science of Divine limitation (التحديد الإلهي). In it is the science of the descent of the Divine Address (الخطاب الإلهي) according to the measure of agreement. In it is the science of Divine warning in seeking gratitude from His servants. In it is the science of the return of creation to Him the Exalted. In it is the science of promises absolutely. In it is the science of distinguishing between apparent enemies in the guise of friendship and the saints (الأولياء). In it is the science of recompensing the enemy with enmity and the saint with friendship in the cosmos, and that whoever takes an enemy as a friend or a saint as an enemy is confused and lacks reality. In it is the science that every caller calls only for himself, even if he calls to Allah the Exalted or for someone other than himself, he calls only from the perspective of his own self, for he seeks through that call intimacy with his likes in rank. In it is the science of arranging reward upon deeds. In it is the distinction of wages (الأجور), for among them are the Mighty, the Generous, and the Great, which are ranks in wages whose recipients and the deeds that necessitate them must be known. And the science of the absolute wage that is unrestricted—is it restricted in reality or not? For the wages are four, just as the human constitution is based on four, just as the constitution of his body is based on four. Each one has a specific wage according to a specific description, and every wage is attributed to what suits it. In it is the science of what is behind the veils (وراء الستور). In it is the science of the ugly (القبيح) that is made beautiful by witnessing, which is a strange secret. In it is the science of isolation (العزل). In it is the science of urging man to occupy himself with his own self. In it is the science of manifestation from concealment. In it is the science of the celestial and terrestrial Carriers (الحاملات العلوية والسفلية). In it is the science of the superiority of Attributes in those described by them, with 'intense' and 'most intense.' In it is the science of the Universal Presence (الحضرة الجامعة) of human benefits, which is the Presence of Blessings for the traveler and the resident, the moving and the still. In it is the science of subjugation (التسخير) and the subjugated things, and whether every subjugated thing has a term that its subjugation ends at, or if some have a term and some do not. In it is the science of \"At Juheina is the certain news\" (عند جهينة الخبر اليقين) and their saying, \"You have fallen upon the expert\" (على الخبير سقطت), and why they did not say, \"You have fallen upon the All-Knowing\" or \"At Juheina is the certain knowledge.\" In it is the science of the manifestation of the Real (الحق) and His permeation (سريانه) in everything, and the divisions of the Real in His saying: \"For every truth (حق) there is a reality (حقيقة),\" upon which He introduced the word 'every.' In it is the science of the solitude of every responsible individual (مكلف) with his own self, and the difference between him and those responsible individuals who are not solitary with their own selves—meaning from the two weighty ones (mankind and jinn)—and in what they are solitary and in what they are not. In it is the science of the recipients (القوابل) and in whom the caller affects. In it is the science of what happens to the inhabitants of the graves in their graves, and what the graves are. In it is the science of taking from everyone, and the description of what is taken and from whom it is taken. In it is the science of whether accidents (الأعراض) are non-existent relations or existent matters that have essences. In it is the science of the honor and veiling that the people of Divine Care (العناية) attain. In it is the science of the ranks of the followers of the prophets. In it is the science of increase (المزيد). In it is the science of wishing (التمني). In it is the science of the permeation of Wisdom (الحكمة) in the ranks of existent things as they truly are. In it is the science of the Divine Precedence (السبق الإلهي) for the cosmos. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "## باب تین سو انچاس: دروازوں کے کھلنے اور بند ہونے کے مقام کی معرفت میں، اور ہر امت کی تخلیق (الحضرة المحمدیۃ) سے\n\n> کائنات میں کسی شے کو یہ گمان نہ کر کہ اس کے لیے *** ذات حق (الحق) کی کوئی صفت ہے، حالانکہ کائنات تو محض نشانیاں ہیں۔\n> غیرت حق (الحق) سے ہی حق (الحق) ان کی آنکھیں بنا *** یہ بات قرآن اور الہام سے آئی ہے۔\n> اگر میرا فقر اور میری ذلت نہ ہوتی تو میں اس سے جمع نہ ہوتا *** اور نہ ہی میرے لیے قرب اور رسائی متحقق ہوتی۔\n> اس کے حق میں ہر موجود نے کوشش کی اور چلا *** اللہ کی کتاب میں اس کا اعلان کیا گیا ہے۔\n> پس ہر شے اپنے اعیان میں اس کی تسبیح کرتی ہے *** اسی لیے اس نے اسے وجود بخشا، اور اللہ خوب جاننے والا ہے۔\n> اور کائنات میں ہر وجود ہر حال میں محتاج ہے *** خواہ لذتوں میں ہو یا دکھوں میں۔\n> غنی کہاں ہے؟ جبکہ کلام اللہ نے اسے باطل کر دیا *** پس تو فقر کے سوا کچھ نہیں دیکھتا جس میں نیستی ہے۔\n\nاللہ تعالیٰ نے فرمایا: \"پس بے شک اللہ تمام جہانوں سے بے نیاز ہے\" (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ)۔ اور فرمایا: \"شیطان تمہیں فقر کا وعدہ دیتا ہے اور بے حیائی کا حکم دیتا ہے، اور اللہ تمہیں اپنی طرف سے مغفرت کا وعدہ دیتا ہے\" (جب اس نے تمہیں بے حیائی کا حکم دیا) \"اور فضل کا\" (جب اس نے تمہیں فقر کا وعدہ دیا) \"اور اللہ غنی (بے نیاز) اور حمید (قابل تعریف) ہے\" (الشَّيْطانُ يَعِدُكُمُ الْفَقْرَ ويَأْمُرُكُمْ بِالْفَحْشاءِ والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ وفَضْلاً والله غَنِيٌّ حَمِيدٌ)۔ اور فرمایا: \"اے لوگو! تم اللہ کے محتاج ہو، اور اللہ ہی غنی (بے نیاز) اور حمید (قابل تعریف) ہے\" (يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ)۔ اور اللہ نے ابو یزید بسطامی سے فرمایا: \"اے ابو یزید! مجھ سے اس چیز کے ذریعے قرب حاصل کر جو میرے پاس نہیں ہے، یعنی ذلت اور افتقار (محتاجی)۔\"\n\n### [بے شک اللہ کے کچھ دروازے ہیں جو اس نے خیر کے لیے کھولے ہیں اور کچھ دروازے تیار کیے ہیں جن کے کھلنے کا وقت ابھی خیر کے لیے نہیں آیا]\n\nجان لو کہ اللہ کے کچھ دروازے ہیں جو اس نے خیر کے لیے کھولے ہیں، اور کچھ دروازے تیار کیے ہیں جن کے کھلنے کا وقت ابھی خیر کے لیے بھی نہیں آیا، اور کچھ دروازے ہیں جو دکھوں (الآلام) کے لیے کھولے ہیں جنہیں عذاب (العذاب) سے تعبیر کیا جاتا ہے، کیونکہ ان کے اصحاب کا معاملہ آخر کار اسی کی طرف لوٹتا ہے، پس وہ اسے آخری حال میں شیریں (مستعذب) پاتے ہیں۔ اسی لیے اس نے اسے عذاب (العذاب) کہا۔ اور وہ اسے آخری حال میں اس لیے شیریں پاتے ہیں کہ یہ انہیں ان کے رب کی یاد دلاتا ہے۔ بے شک انسان جب کسی مصیبت میں مبتلا ہوتا ہے اور اسباب منقطع ہو جاتے ہیں، اور یہ شدید ترین عذاب ہوتا ہے، تو وہ اپنے رب کو یاد کرتا ہے اور مجبوراً اس کی طرف رجوع کرتا ہے، نہ کہ بااختیار۔ پس وہ اس وقت اس امر کو شیریں پاتا ہے جس نے اسے اللہ کی طرف لوٹا دیا اور اس کی یاد دلائی اور اسے اس کی غفلت اور نسیان کے حکم سے نکال دیا۔ پس اس نے اسے عذاب (العذاب) کہا۔ لہٰذا یہ نام اس شخص کے لیے بشارت ہے جس پر یہ نازل ہو کہ رحمت اسے پا لے گی۔ پس حق (الحق) کا اپنے بندوں تک شدت اور آسانی کی حالت میں اپنی بشارت پہنچانے کا طریقہ کتنا لطیف ہے! اگر ایسا نہ ہوتا تو اس قول میں کلمہ حق نہ ہوتا: \"کیا وہ شخص جس پر عذاب کا کلمہ حق ہو چکا ہے؟\" (أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ)۔ پس اس نے لفظ عذاب (العذاب) استعمال کیا۔ کیا تم نہیں دیکھتے کہ خلیل اللہ ابراہیم علیہ السلام فرماتے ہیں: \"اے میرے والد! میں ڈرتا ہوں کہ آپ کو رحمن کی طرف سے کوئی عذاب (عَذابٌ) نہ چھو لے\" (يا أَبَتِ إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ)۔ اور رحمن کوئی تکلیف دہ درد نہیں دیتا مگر یہ کہ اس کے اندر ایسی رحمت پوشیدہ ہو جسے وہ شخص شیریں پائے جس پر وہ درد وارد ہوا ہو، جیسے دوا پینا جس میں شفا مضمر ہوتی ہے۔ کیا تم نہیں دیکھتے کہ انہوں نے اپنے والد سے کیسے کہا: \"بے شک شیطان رحمن کا نافرمان تھا\" (إِنَّ الشَّيْطانَ كانَ لِلرَّحْمنِ عَصِيًّا)۔ اگر وہ جانتا کہ رحمت میں انتقام کا موجب ہے تو وہ اس کی نافرمانی نہ کرتا۔ پس اس نے صرف رحمن کی نافرمانی کی، کیونکہ ہر اسم اپنی ساخت کے مطابق عمل کرتا ہے (يَعْمَلُ عَلى‏ شاكِلَتِهِ)۔ انبیاء اپنے رب کو کتنا زیادہ جانتے ہیں! اور شدید ترین دکھ مقصد کا حاصل نہ ہونا ہے۔ اور ہم سے روایت کیا گیا ہے کہ اللہ تعالیٰ فرشتے سے فرماتا ہے: \"اس وقت فلاں کی حاجت پوری نہ کر، کیونکہ میں اس کی آواز سننا پسند کرتا ہوں، اگرچہ وہ شخص اپنے رب سے مانگی ہوئی چیز کے نہ ملنے پر تکلیف محسوس کرتا ہے۔\" پس یہ تکلیف دہ ممانعت ایک الٰہی رحمت کی وجہ سے ہے۔ پھر یہ کہ دیوار (سور) کا باطن خالص رحمت ہے اور اس کا ظاہر عذاب (العذاب) کی طرف سے ہے۔ اور اس نے عذاب کے دکھ (آلام العذاب) نہیں کہا، کیونکہ وہ انجام کو جانتا ہے۔ پس اللہ تعالیٰ نے واضح کیا کہ اس موجود کا باطن رحمت پر مشتمل ہے اور اس کا ظاہر صرف باطن کے حکم سے تصرف کرتا ہے۔ لہٰذا ظاہر میں کوئی تکلیف دہ امر نہیں ہوتا مگر باطن میں موجود رحمت کی وجہ سے، کیونکہ ظاہر میں حکم باطن کا ہوتا ہے۔ کیا ظاہری اعضاء تصرف کرتے ہیں مگر باطن کے ارادے سے جو انہیں متصرف کرتا ہے؟ اور ارادہ بلاشبہ باطن ہے۔ پس دیوار (سور) کے ظاہر میں عذاب (العذاب) صرف اس رحمت کے ارادے سے تھا جو دیوار کے باطن میں ہے۔ پس دکھ (الألم) لذت کے نہ ہونے اور مقصد کے حاصل نہ ہونے کے سوا کچھ نہیں۔ پس اللہ کے پاس کوئی دروازہ نہیں کھلتا مگر رحمت کے دروازے۔ فرق صرف یہ ہے کہ ایک رحمت ظاہری ہے جس میں کوئی دکھ نہیں، اور ایک رحمت باطنی ہے جس میں صرف وقتی دکھ ہوتا ہے، پھر انجام میں اس کا حکم ظاہر ہوتا ہے۔ پس دکھ (الآلام) عارضی ہیں اور لذتیں مستقل ہیں۔ پس عالم بالذات مرحوم ہے، اور اس پر جو عوارض آتے ہیں ان سے وہ متألم ہوتا ہے۔ اور اللہ عزیز (غالب) اور حکیم (حکمت والا) ہے، جو معاملات کو ان کے مقامات پر رکھتا ہے اور انہیں ان کی منزلوں پر نازل کرتا ہے۔ انسان اپنے بیٹے کو ادب سکھانے کے لیے مارتا ہے اور اس کے گناہ کی سزا کے طور پر اسے اس مار سے تکلیف پہنچاتا ہے، حالانکہ وہ باطن میں اس پر رحم کر رہا ہوتا ہے۔ پس جب وہ معاملے کا حق پورا کر دیتا ہے تو اس پر وہ رحمت اور شفقت ظاہر کر دیتا ہے جو اس کے دل اور باطن میں اپنے بیٹے کے لیے ہوتی ہے۔ اسی لیے:\n\nروایت میں رسول اللہ صلی اللہ علیہ وسلم سے ایک طویل قصے میں آیا ہے جس میں آپ فرماتے ہیں: \"اور بے شک اللہ اپنے بندے پر اس عورت سے زیادہ شفیق ہے\" اور آپ نے ایک عورت کی طرف اشارہ کیا \"جو اپنے بچے پر شفیق ہے۔\"\n\nاور یہ سب ذوق (الأذواق) کے علوم میں سے ہے۔ اللہ ہمیں اور سننے والوں کو خالص رحمت والوں میں سے بنائے جس میں کوئی دکھ نہ ہو، اپنے فضل سے۔\n\n### [بے شک وجود (الوجود) وہ خالص خیر ہے جس میں کوئی شر نہیں]\n\nجان لو کہ اللہ نے ممکنات کو ان کے اعیان میں موجود (موجودة) صرف اس لیے ظاہر نہیں کیا کہ وہ انہیں عدم (العدم) کے شر سے نکالے، کیونکہ وہ جانتا تھا کہ وجود (الوجود) وہ خالص خیر (الخير المحض) ہے جس میں کوئی شر نہیں، مگر عارضی حکم کی وجہ سے۔ اور یہ عارضی حکم اس کے ممکن ہونے کی وجہ سے ہے کہ عدم (العدم) اس پر نظر ڈالتا ہے، حالانکہ وہ اب وجود (الوجود) سے موصوف ہے۔ پس وہ خالص خیر (الخير المحض) میں ہے۔ لہٰذا جو کچھ اسے ممکن ہونے کی حیثیت سے، عدم (العدم) کی نظر سے اس کے وجود کی حالت میں پہنچتا ہے، وہ اسی قدر شر ہوتا ہے جسے عالم محسوس کرتا ہے جہاں وہ اسے پاتا ہے۔ پس جب ممکن اپنے وجود (الوجود) کو دیکھتا ہے اور اسے دائمی پاتا ہے تو وہ اس وجود (الوجود) کے استصحاب پر خوش ہوتا ہے، اور جب وہ اس حالت کو دیکھتا ہے جس سے وہ موصوف تھا اور اس کا کوئی وجود نہیں تھا، تو وہ اس کے مشاہدے سے متألم ہوتا ہے، کیونکہ حال کا حکم اس پر ہوتا ہے جو اس سے قائم ہو۔ اور اس ممکن کا حال اب عدم (العدم) کا مشاہدہ کرنا ہے، پس وہ ایک وہمی عذاب (عذابا وهمیا) میں مبتلا ہوتا ہے۔\n\nنبی صلی اللہ علیہ وسلم تنگی (الضراء) میں فرمایا کرتے تھے: \"ہر حال میں اللہ کے لیے حمد ہے\" (الحمد لله على كل حال)۔\n\nاور حمد کو واجب کرنے والے احوال میں سے آسانی (السراء) کے احوال ہیں، جس کی حمد \"الحمد للہ المنعم المتفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام کرنے والا اور فضل کرنے والا ہے) سے کی جاتی ہے۔ اگر \"ہر حال میں اللہ کے لیے حمد ہے\" میں آسانی کی حمد شامل نہ ہوتی، تو یہ اس بات کا اعلان ہے کہ تنگی (الضراء) میں بھی آسانی (السراء) ہے، اس کی حمد کے عموم کی وجہ سے۔ اور حمد، محمود کی تعریف ہے۔ اور تنگی والے شخص کے لیے اگر اس تنگی کے اندر آسانی پوشیدہ نہ ہوتی، تو تنگی کی حالت میں حامد کی طرف سے وہ حمد تعریف نہ ہوتی۔ اور حمد بلاشبہ نفس الامر میں تعریف ہے۔ پس عالم میں کوئی ضرر نہیں جو رحمت سے آمیختہ نہ ہو، جیسا کہ مومن کی کوئی نافرمانی خالص نہیں ہوتی جو کسی بھی طرح اطاعت سے آمیختہ نہ ہو، اور وہ اطاعت ایمان کی اطاعت ہے۔ پس وہ اپنی مخالفت میں اطاعت گزار بھی ہے اور نافرمان بھی، جیسے عذاب دیا گیا مگر مرحوم۔\n\n### [بے شک ممکنات بالذات محتاج ہیں، پس فقر ہمیشہ ان کے ساتھ رہتا ہے]\n\nپھر تمہیں جان لینا چاہیے کہ ممکنات بالذات محتاج (مفتقرة بالذات) ہیں، پس فقر ہمیشہ ان کے ساتھ رہتا ہے، کیونکہ ان کی ذات دائمی ہے۔ پس ان کے لیے وہ اسباب مقرر کیے گئے جن کے ذریعے انہیں وہ چیز حاصل ہوتی ہے جس کے وہ محتاج تھے۔ پس وہ اسباب کے محتاج ہوئے۔ پس اللہ نے اسباب کے عین کو اپنے اسماء بنا دیا۔ پس اسباب کے اسماء بھی اللہ تعالیٰ کے اسماء میں سے ہیں، تاکہ وہ صرف اسی کا محتاج ہو، کیونکہ یہی صحیح علم ہے۔ پس اہل کشف (الکشف) کے نزدیک ان اسماء میں کوئی فرق نہیں جنہیں عرف اور شریعت میں اللہ کے اسماء کہا جاتا ہے، اور اسباب کے اسماء میں کہ وہ اللہ کے اسماء ہیں۔ کیونکہ اس نے فرمایا: \"تم اللہ کے محتاج ہو\" (أَنْتُمُ الْفُقَراءُ إِلَى الله)۔ اور ہم واقع میں اسباب کی محتاجی دیکھتے ہیں۔ پس ضروری ہے کہ اسباب کے اسماء اللہ تعالیٰ کے اسماء ہوں، پس ہم انہیں دعائے حال (دعاء الحال) سے پکارتے ہیں نہ کہ دعائے الفاظ سے۔ پس جب ہمیں بھوک لگتی ہے تو ہم اس غذا کی طرف تیزی سے بڑھتے ہیں جو بھوک کے درد کو دور کرتی ہے۔ پس ہم اس کے محتاج ہوئے، حالانکہ وہ ہم سے بے نیاز ہے۔ اور ہم صرف اللہ کے محتاج ہیں۔ پس یہ اس کے اسماء میں سے ایک اسم ہے، یعنی اس غذا کی صورت جو اسم الٰہی کے لفظ کی صورت یا اس کے عدد کی صورت کے مقام پر نازل ہوئی ہے۔ اور اسی لیے اسباب کا شکر ادا کرنے کا حکم دیا گیا، کیونکہ یہ اس کے شکر کا حکم ہے، پس یہ ان کے ذریعے اس کی تعریف ہے۔\n\n### [بے شک اللہ کی اپنے مخلوق پر رحمت میں سے یہ ہے کہ اس نے ہر نبی کے قدم پر ایک ولی کو اس کا وارث بنایا]\n\nجان لو کہ اللہ کی اپنے مخلوق پر رحمت میں سے یہ ہے کہ اس نے ہر نبی کے قدم پر ایک ولی (ولی) کو اس کا وارث بنایا۔ پس جو زیادہ ہوں، تو ضروری ہے کہ ہر زمانے میں ایک لاکھ چوبیس ہزار ولی (ولی) ہوں، انبیاء کی تعداد کے مطابق، اور وہ بڑھتے ہیں کم نہیں ہوتے۔ اگر وہ بڑھ جائیں تو اللہ اس نبی کا علم ان لوگوں پر تقسیم کر دیتا ہے جو اس کے وارث بنے ہیں۔ کیونکہ انبیاء کے دلوں پر نازل ہونے والے علوم دنیا سے اٹھائے نہیں جاتے، اور ان کے لیے مردوں کے دلوں کے سوا کوئی جگہ نہیں ہے۔ پس وہ ان کی تعداد کے مطابق ان پر تقسیم کیے جاتے ہیں۔ لہٰذا امت میں انبیاء کی تعداد کے برابر یا اس سے زیادہ اولیاء (الأولياء) کا ہونا ضروری ہے۔\n\nہم نے خضر (علیہ السلام) سے روایت کیا ہے کہ انہوں نے فرمایا: \"کوئی دن ایسا نہیں گزرا جب میرے نفس نے یہ خیال کیا ہو کہ زمین میں اللہ کا کوئی ولی باقی نہیں جسے میں نے نہ دیکھا ہو اور نہ ملا ہو، مگر یہ کہ اس دن میرا ملنا اللہ کے ایک ایسے ولی سے ضروری ہو گیا جسے میں اس سے پہلے نہیں جانتا تھا۔\"\n\nاور ہم نے ان سے روایت کیا ہے کہ انہوں نے فرمایا: \"ایک دن میری ملاقات ایک شخص سے ہوئی جسے میں نہیں جانتا تھا، تو اس نے مجھ سے کہا: 'اے خضر! تم پر سلامتی ہو!' تو میں نے اس سے پوچھا: 'تم نے مجھے کیسے پہچانا؟' تو اس نے کہا: 'اللہ نے مجھے تمہاری معرفت کرائی۔'\"\n\nپس میں نے جان لیا کہ اللہ کے کچھ بندے ایسے ہیں جو خضر کو جانتے ہیں اور خضر انہیں نہیں جانتے۔\n\n### [بے شک اللہ کے کچھ بندے اخفیاء (پوشیدہ)، ابریاء (معصوم)، اصفیاء (چنے ہوئے)، اولیاء (دوست) ہیں]\n\nجان لو کہ اللہ کے کچھ بندے اخفیاء (پوشیدہ)، ابریاء (معصوم)، اصفیاء (چنے ہوئے)، اولیاء (اولیاء) ہیں، جن کے اور لوگوں کے درمیان عادات کے پردے (حجب العوائد) حائل ہیں۔ وہ لوگوں میں پوشیدہ رہتے ہیں، ان پر کوئی ایسی چیز ظاہر نہیں ہوتی جو انہیں عام لوگوں سے ممتاز کرے۔ اور انہی کے ذریعے اللہ عالم کی حفاظت کرتا ہے اور اپنے بندوں کی مدد کرتا ہے۔ وہ آسمان میں معروف ہیں، زمین پر اپنے ہم جنسوں کے درمیان مجہول ہیں۔ ان کے لیے دنیا اور آخرت میں خوشی ہے۔ وہ نہ نبی ہیں اور نہ شہید، مگر انبیاء اور شہداء ان پر رشک کرتے ہیں۔ وہ نہ دنیا میں پہچانے جاتے ہیں اور نہ آخرت میں شفاعت کرتے ہیں۔ انہوں نے اپنے باطن میں حق (الحق) کے ساتھ انفرادیت حاصل کر لی ہے۔ اور میں نہیں جانتا تھا کہ اللہ نے وجود (الوجود) میں ہر نبی کے قدم پر ایک ولی (ولی) مقرر کیا ہے۔ کیونکہ جب اللہ تعالیٰ نے مجھے اپنے تمام انبیاء سے جمع کیا، یہاں تک کہ کوئی نبی باقی نہ رہا مگر میں نے اسے ایک ہی مجلس میں دیکھا، تو میں نے ان کے ساتھ کسی ایسے شخص کو نہیں دیکھا جو ان کے قدم پر ہو۔ پھر اس کے بعد میں نے تمام مومنین کو دیکھا، اور ان میں وہ بھی تھے جو انبیاء کے قدموں پر تھے اور دیگر اولیاء (الأولياء) بھی۔ چونکہ انہیں ایک مجلس میں جمع نہیں کیا گیا تھا، اس لیے میں انہیں نہیں پہچان سکا۔ پھر میں نے انہیں اس کے بعد پہچانا اور اللہ نے مجھے ان کے دیدار سے فائدہ پہنچایا۔ اور ہمارے شیخ ابو العباس العریبی عیسیٰ علیہ السلام کے قدم پر تھے۔ اور ہم اس سے پہلے کہا کرتے تھے کہ کچھ اولیاء (الأولياء) انبیاء کے دلوں پر ہوتے ہیں۔ تو ہم سے کہا گیا: \"نہیں، بلکہ کہو کہ وہ انبیاء کے قدموں پر ہوتے ہیں، ان کے دلوں پر نہ کہو۔\" پس میں نے جان لیا کہ اس سے کیا مراد تھی، جب اللہ نے مجھے اس پر مطلع کیا۔ میں نے انہیں ان کے آثار پر کھڑے دیکھا، اور میں نے ان کے لیے دو معراجیں دیکھیں۔ ایک معراج وہ ہے جس میں وہ انبیاء کے دلوں پر ہوتے ہیں، لیکن اس حیثیت سے کہ انبیاء نبوت کے اولیاء (اولیاء) ہیں جس میں کوئی شریعت نہیں ہے۔ اور دوسری معراج وہ ہے جس میں وہ شریعت والے انبیاء کے قدموں پر ہوتے ہیں، ان کے دلوں پر نہیں۔ کیونکہ اگر وہ ان کے دلوں پر ہوتے تو وہ ان احکام مشروعہ کو حاصل کر لیتے جو انبیاء نے حاصل کیے، اور یہ ان کے لیے نہیں ہے، اگرچہ انہیں اس کا الٰہی تعارف حاصل ہو جائے۔ اور وہ شریعت کو وہیں سے لیتے ہیں جہاں سے انبیاء نے لیا، لیکن انبیاء کے انوار کی مشکوٰۃ سے، جس کے ساتھ اتباع کا حکم بھی شامل ہوتا ہے۔ پس یہ علم انہیں اللہ کی طرف سے یا روح القدس کی طرف سے خالص نہیں ملتا۔ اور اس فن کے علاوہ جو علم ہے، وہ اولیاء (الأولياء) کے لیے اللہ سبحانہ اور ارواح قدسیہ کی طرف سے خالص ہوتا ہے۔ اور یہ سب اس لیے ہے تاکہ مراتب اللہ کے نزدیک ممتاز ہو جائیں، تاکہ ہم اسے جانیں اور ہر حقدار کو اس کا حق دیں، جیسا کہ اللہ نے ہر چیز کو اس کی تخلیق دی۔ اور یہ سب اللہ کی رحمت میں سے ہے جو اس نے اپنی مخلوق پر نازل فرمائی۔\n\n### [بے شک اللہ نے فرشتوں کے لیے قوت الٰہیہ میں تین مراتب مقرر کیے ہیں]\n\nپھر تمہیں جان لینا چاہیے کہ اللہ نے فرشتوں (الملائکۃ) کے لیے قوت الٰہیہ (القوة الإلهیۃ) میں تین مراتب مقرر کیے ہیں۔ پس ان میں سے کچھ کو دو قوتیں دی گئیں، کچھ کو تین قوتیں دی گئیں، اور کچھ کو چار قوتیں دی گئیں، اور یہی انتہا ہے۔ کیونکہ وجود (الوجود) چہارگانہ (تربیع) پر قائم ہوا ہے، بغیر کسی اضافے کے۔ مگر یہ کہ ہر قوت اپنے اندر ایسی قوتیں رکھتی ہے جن کی تعداد اللہ کے سوا کوئی نہیں جانتا۔ اور یہ اس حیثیت سے ہے کہ فرشتے نوری اجسام ہیں، پس انہیں یہ قوتیں ان کے اجسام کی حیثیت سے حاصل ہیں، کیونکہ وہ طبعی اجسام کی طرح مرکب ہیں۔ پس دو قوتوں والا فرشتہ نباتات کی ترکیب پر ہے، تین قوتوں والا حیوان کی ترکیب پر ہے، اور چار قوتوں والا انسان کی ترکیب پر ہے۔ اور مولدات (پیدا ہونے والی چیزیں) ختم ہو گئیں، تو فرشتوں کی قوتیں بھی ختم ہو گئیں۔ اور جسم سب کو جمع کرتا ہے، پس اس کے لیے احاطہ ہے۔ پس فرشتوں نے نوری اجسام کو اس عماء (العماء) سے قبول کیا جس میں کل نوری جسم ظاہر ہوا اور شکل اور صورتوں کو قبول کیا۔ اور اس میں ملکی ارواح ظاہر ہوتی ہیں۔ اور عماء (العماء) اس کل جسم کے لیے اور جو کچھ وہ الٰہی اور روحانی صورتوں اور شکلوں کو اٹھاتا ہے، طبعی اجسام میں ہیولیٰ (الهيولى) کے مقام پر ہے، بالکل یکساں۔ اور اس کی تفصیل طویل ہے۔ اور اس نور سے جو طبیعت سے اوپر ہے، ارواح طبعی اجسام میں پھونکی جاتی ہیں۔ پس جو کچھ طبیعت سے نیچے عناصر تک ہے، وہ سائے میں نور ہیں، اور جو کچھ عناصر سے نیچے عنصری اجسام ہیں، وہ تاریکی میں نور ہیں۔ اور جو کچھ طبیعت سے اوپر نوری اجسام ہیں، وہ نور میں نور ہیں۔ اور اگر تم چاہو تو رحمانی سانسوں (أنفاس رحمانية) میں نور کہہ لو۔ اور اگر تم چاہو تو عماء (العماء) میں نور کہہ لو۔ جس طرح چاہو تعبیر کرو، جب تم معاملے کو اس کی اصل حالت پر جان لو۔\n\n### [بے شک ہر روح جو عقل اول (العقل الأول) کے نیچے ہے اور صاحب کلمہ ہے، وہ فرشتہ ہے]\n\nجان لو کہ ہر روح جو عقل اول (العقل الأول) کے نیچے ہے اور صاحب کلمہ ہے، وہ فرشتہ (ملک) ہے۔ اور جو اس سے اوپر ہے وہ روح ہے، فرشتہ نہیں۔ بہرحال فرشتے (الملائکۃ) مسخر (مسخر) اور مدبر (مدبر) کے درمیان ہیں۔ اور وہ سب اللہ کے حکم سے اللہ کے رسول اور محافظ ہیں۔ اور وہ مراتب پر ہیں، اور ان کے لیے معراجیں، نزول اور صعود ہیں، دنیا اور آخرت۔ پس ان میں سے کچھ مومنین کے لیے دعا اور استغفار میں مسخر ہیں، اور دوسرے زمین والوں کے لیے استغفار میں مسخر ہیں (لِمَنْ في الْأَرْضِ)۔ اور ان میں سے کچھ دنیا سے متعلق عالم کے مصالح میں مسخر ہیں، اور کچھ آخرت سے متعلق عالم کے مصالح میں مسخر ہیں۔ اور یہ عمل جس پر وہ قائم ہیں، یہی ان کی عبادت اور ان کی نماز ہے۔ اور ان کی تسبیح ان نمازوں میں اللہ کا ذکر ہے، جیسے ہماری نماز میں قرأت اور ذکر ہوتا ہے۔ اور یہ معاملہ اسی طرح رہے گا یہاں تک کہ وہ وقت آ جائے جب اللہ چاہے گا کہ اس کی رحمت تمام مخلوق کو عام ہو جائے، جو \"ہر چیز پر محیط ہے\" (وَسِعَتْ كُلَّ شَيْ‏ءٍ)۔ پس جب رحمت انہیں عام ہو جائے گی، تو ان فرشتوں میں سے کچھ کے لیے جن کا کام استغفار تھا، ان کی عبادت میں صرف تسبیح باقی رہ جائے گی۔ اور وہ فرشتے باقی رہیں گے جن کا تعلق جنتوں میں اور دونوں جہانوں میں جہاں بھی کوئی ہو، ہمارے احوال سے ہے۔ پس ان کا یہ عمل منقطع نہیں ہو گا۔ اور ان پہلے فرشتوں سے فرشتوں کا نام زائل ہو جائے گا اور وہ ایسی ارواح باقی رہیں گی جن کا کام صرف اللہ تعالیٰ کی تسبیح اور تمجید ہو گا، جیسے دیگر ارواح ہائمہ (مہیمہ)۔ اور \"فرشتے ان پر ہر دروازے سے داخل ہوں گے، سلامتی ہو تم پر، تمہارے صبر کے بدلے، پس کیا ہی اچھا ہے آخرت کا ٹھکانہ\" (وَالْمَلائِكَةُ يَدْخُلُونَ عَلَيْهِمْ مِنْ كُلِّ بابٍ سَلامٌ عَلَيْكُمْ بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ)۔ پس یہاں مذکور یہ صنف صبر کرنے والے، یعنی انسانوں میں سے اہل بلاء ہیں۔ اور وہ فرشتے جو شکر گزار اہل نعمت پر داخل ہوں گے، ان کا ذکر نہیں کیا گیا، حالانکہ فرشتوں کا ان پر بھی ہر دروازے سے داخل ہونا ضروری ہے، کیونکہ نعمت کے دروازے بہت ہیں، جیسے بلاء کے دروازے ہیں۔ اور جس نے یہ دیکھا کہ وہ نعمتیں جو اللہ نے اپنے بندوں پر دنیا میں انعام کیں، وہ بلاء سے خالص نہیں ہیں، کیونکہ ان پر ان نعمتوں کے شکر کا مکلف ہونا سب سے بڑی بلاء ہے، چونکہ نعمتیں اللہ سے حجاب میں مصیبتوں سے زیادہ شدید ہوتی ہیں۔ پس اس لحاظ سے اہل نعمت بھی فرشتوں کے اس قول میں شامل ہو گئے: \"تمہارے صبر کے بدلے، پس کیا ہی اچھا ہے آخرت کا ٹھکانہ\" (بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ)۔ یعنی تم ایسے نعمت والے گھر میں پہنچ گئے ہو جس کی نعمتیں کسی تکلیف یا حق کے مطالبے سے آمیختہ نہیں ہیں۔ اسی لیے شکر گزاروں کے ساتھ فرشتوں کے احوال کا ذکر نہیں کیا گیا اور صرف اسی پر اکتفا کیا گیا جو حق (الحق) نے تعارف کرایا، اور یہی صحیح ہے۔ کیونکہ دار دنیا یہ حالت دیتی ہے، اور یہی وہ کشف (الکشف) ہے جس میں کوئی التباس نہیں، جو اس بات کا تقاضا کرتا ہے کہ دار دنیا میں مبتلا اور منعم علیہ سب کے لیے صبر کی حالت ہے۔ پس صبر شکر سے زیادہ عام ہے اور بلاء اس دنیا میں نعمتوں سے زیادہ عام ہے۔ اور جب رحمت عام ہو جائے گی اور وہ آثار اٹھ جائیں گے جو رحمت کے متضاد ہیں، تو ان اسماء کی نسبتیں بھی اٹھ جائیں گی جنہیں آثار نے متعین کیا تھا، کیونکہ وہ ایک ہی عین کی طرف لوٹتے ہیں، جیسا کہ اللہ تعالیٰ نے اپنے قول میں بیان فرمایا: \"اور اللہ ہی کے لیے اچھے نام ہیں\" (وَلِلَّهِ الْأَسْماءُ الْحُسْنى‏)۔ اور فرمایا: \"کہو: اللہ کو پکارو یا رحمن کو پکارو، جس نام سے بھی تم پکارو، تو اسی کے لیے اچھے نام ہیں\" (قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏)۔ اور اسماء وضعی ہیں، جنہیں ممکنات کی حقائق نے اپنے مطالبے کے مطابق وضع کیا ہے۔ پس وہ جس استعداد پر ہوتے ہیں، اسی کے مطابق الٰہی فیض میں سے مناسب چیز کا مطالبہ کرتے ہیں۔ پس جب انہیں وہ دے دیا جاتا ہے، تو ہر عین کے لیے اسماء وضع کیے جاتے ہیں۔ پس جب ان میں کوئی ایسی استعداد باقی نہیں رہتی جس سے وہ دکھ یا عذاب (العذاب) قبول کر سکیں، تو قبول کرنے والے کے نہ ہونے کی وجہ سے دکھ یا عذاب کا کوئی عین موجود نہیں ہو گا۔ پس ان احکام سے مخصوص اسماء کی نسبتیں قبول کرنے والوں کے اٹھ جانے کی وجہ سے اٹھ جائیں گی۔ اور جس اسم کے لیے قبول کرنے والے میں دو حکم تھے، وہ باقی رہے گا، جیسے الغافر (بخشنے والا) جو کہ پردہ ڈالنے والا ہے۔ پس کوئی گناہ باقی نہیں رہے گا جو غافر کا مطالبہ کرے، اور غافر کے لیے مطلق پردہ ہونے کا حکم باقی رہے گا۔ پس غافر باقی رہے گا، اگرچہ گناہ گار زائل ہو جائے، کیونکہ غفر (پردہ پوشی) ضروری ہے، اور اگر ایسا نہ ہوتا تو مزید (اضافہ) اور نئی تخلیق نہ ہوتی۔ اور مزید ہمیشہ جاری ہے۔ پس پردوں کا اٹھانا ہمیشہ جاری ہے۔ اور یہ صرف اسم الغفور (بخشنے والا) ہے، بخلاف المنتقم (انتقام لینے والا)، کیونکہ قبول کرنے والا اٹھ گیا، تو یہ خاص وضع زائل ہو گئی۔ پس یہ جان لو۔ اور اس مقام کے علوم میں آسمان، زمین اور فرشتوں کی ثناء کا علم ہے، دیگر مخلوقات کے بغیر، اور وہ کیا ثناء کرتے ہیں اپنے رب کی، کیونکہ ہر عالم کے لیے ایک خاص ثناء ہے جو دوسرے کے لیے نہیں ہے۔ اللہ تعالیٰ نے فرمایا: \"ساتوں آسمان اور زمین اس کی تسبیح کرتے ہیں\" (تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ وَالْأَرْضُ)۔ پھر فرمایا: \"اور جو کچھ ان میں ہے\" (وَمَنْ فِيهِنَّ)۔ اور اس نے آسمانوں اور زمین کو عقل والوں کی جمع سے جمع کیا، اور اس میں تشبیہ اور کنایات کا علم ہے، اور روحانی عالم میں موجود قوتوں کا علم ہے۔ اور اس میں عالم میں پھیلے ہوئے پیغامات (الرسائل المبثوثة) کا علم ہے، اور یہ کہ جو بھی عالم میں چلتا ہے، وہ صرف ایک پیغام کے ساتھ رسول بن کر چلتا ہے۔ اور یہ ایک شریف علم ہے، یہاں تک کہ کیڑا بھی اپنی حرکتوں میں ایک پیغام کے ساتھ کوشش کر رہا ہوتا ہے، اس شخص کے لیے جو اسے سمجھے۔ اور اس میں قدرت کے آثار کا علم ہے اور انہیں دیگر نسبتوں سے ممتاز کرنے کا علم ہے۔ اور اس میں انواء (موسمی تبدیلیوں) کا علم ہے اور ان میں سے جو قابل تعریف ہیں، اور ابو ہریرہ رضی اللہ عنہ کا قول: \"ہم پر فتح کے نوء سے بارش ہوئی\"۔ اور اس میں دروازوں اور ان کے مراتب کا علم ہے۔ اور اس میں یہ علم ہے کہ الٰہی ممانعت بھی عطاء ہے۔ اور اس میں الٰہی تحدید (حد بندی) کا علم ہے۔ اور اس میں الٰہی خطاب کو تواطؤ (باہمی موافقت) کے مطابق نازل کرنے کا علم ہے۔ اور اس میں اپنے بندوں سے شکر کے مطالبے میں الٰہی تنبیہ کا علم ہے۔ اور اس میں مخلوق کو اس کی طرف لوٹانے کا علم ہے۔ اور اس میں مطلق وعدوں کا علم ہے۔ اور اس میں ان دشمنوں کے درمیان تمیز کا علم ہے جو دوستی کی صورت میں ظاہر ہوتے ہیں اور اولیاء (الأولياء) کے درمیان۔ اور اس میں عالم کے درمیان دشمن کو دشمنی کی اور ولی کو ولایت کی جزا دینے کا علم ہے، اور یہ کہ جس نے دشمن کو ولی بنایا یا ولی کو دشمن بنایا، وہ خلط ملط کرنے والا ہے، اس کے پاس کوئی حقیقت نہیں۔ اور اس میں ہر داعی کا علم ہے کہ وہ صرف اپنے لیے دعا کرتا ہے، اگرچہ وہ اللہ کی طرف یا کسی اور کے لیے دعا کرے، تو وہ اپنی ذات کی حیثیت سے دعا کرتا ہے، کیونکہ وہ اس دعا کے ذریعے مرتبے میں اشکال کے ساتھ انسیت چاہتا ہے۔ اور اس میں اعمال پر ثواب کی ترتیب کا علم ہے۔ اور اس میں اجرتوں کی تمیز کا علم ہے، کیونکہ ان میں عظیم، کریم اور کبیر ہیں، اور یہ اجرتوں میں مراتب ہیں جن کے اصحاب اور ان کے موجب اعمال کو جاننا ضروری ہے۔ اور مطلق اجرت کا علم جو مقید نہیں ہے، کیا وہ نفس الامر میں مقید ہے یا نہیں؟ کیونکہ اجرتیں چار ہیں، جیسا کہ انسان کی نشأة چار پر ہے، جیسا کہ اس کے جسم کی نشأة چار پر ہے۔ ہر ایک کے لیے ایک خاص اجرت ہے ایک مخصوص صفت پر، پس ہر اجرت کو اس کے مناسب سے منسوب کیا جاتا ہے۔ اور اس میں پردوں کے پیچھے کا علم ہے۔ اور اس میں اس قبیح کا علم ہے جسے مشاہدہ حسین بنا دیتا ہے، اور یہ ایک عجیب راز ہے۔ اور اس میں معزولی کا علم ہے۔ اور اس میں انسان کو اپنے نفس کے ساتھ مشغول ہونے کی ترغیب کا علم ہے۔ اور اس میں خفاء سے ظہور کا علم ہے۔ اور اس میں علوی اور سفلی حاملات کا علم ہے۔ اور اس میں موصوفین میں صفات کی فضیلت کا علم ہے، شدید اور اشد کے ساتھ۔ اور اس میں انسانی منافع کو جمع کرنے والی حضرہ کا علم ہے، اور وہ مسافر، مقیم، متحرک اور ساکن کے لیے نعمتوں کی حضرہ ہے۔ اور اس میں تسخیر اور مسخرات کا علم ہے، اور کیا ہر مسخر کے لیے کوئی مدت ہے جو اس کی تسخیر کے ساتھ ختم ہو جاتی ہے یا نہیں؟ یا کچھ کے لیے مدت ہے اور کچھ کے لیے مدت نہیں؟ اور اس میں \"جہینہ کے پاس یقینی خبر ہے\" کا علم ہے، اور ان کا قول: \"تم ایک باخبر پر گرے ہو\" (على الخبير سقطت)، اور انہوں نے یہ نہیں کہا کہ \"تم ایک علیم پر گرے ہو\" (على العليم سقطت)، اور نہ ہی انہوں نے کہا کہ \"جہینہ کے پاس یقینی علم ہے\" (عند جهينة العلم اليقين)۔ اور اس میں:\n\nحق (الحق) کے ظہور اور ہر شے میں اس کے سرایت کرنے کا علم ہے، اور حق (الحق) کی تقسیمات کا علم ہے اس کے قول میں: \"ہر حق کے لیے ایک حقیقت ہے\" (لِكُلِّ حَقٍّ حَقِيقَةٌ)، پس اس پر \"کل\" داخل کیا۔ اور اس میں ہر مکلف کے اپنے نفس کے ساتھ انفرادیت کا علم ہے، اور اس کے اور ان مکلفین کے درمیان فرق کا علم ہے جو اپنے نفس کے ساتھ منفرد نہیں ہوتے، یعنی دونوں جہانوں (ثقلین) میں سے۔ اور اس میں یہ علم ہے کہ وہ کس چیز میں منفرد ہوتا ہے اور کس چیز میں منفرد نہیں ہوتا۔ اور اس میں قوابل (قبول کرنے والوں) کا علم ہے، اور اس میں یہ علم ہے کہ داعی کس پر اثر کرتا ہے۔ اور اس میں اہل قبور کے لیے ان کی قبروں میں کیا ہوتا ہے اور قبریں کیا ہیں، اس کا علم ہے۔ اور اس میں ہر ایک سے لینے کا علم ہے، اور لی گئی چیز اور جس سے لی گئی اس کی صفت کا علم ہے۔ اور اس میں اعراض (عارضی صفات) کا علم ہے، کیا وہ عدمی نسبتیں ہیں یا وجودی امور جن کے اعیان ہیں؟ اور اس میں اہل عنایت کو حاصل ہونے والی عزت اور حجاب کا علم ہے۔ اور اس میں انبیاء کے پیروکاروں کے مراتب کا علم ہے۔ اور اس میں مزید (اضافہ) کا علم ہے۔ اور اس میں تمنا کا علم ہے۔ اور اس میں موجودات کے مراتب میں حکمت کے سرایت کرنے کا علم ہے، جیسا کہ وہ ہیں۔ اور اس میں عالم کے لیے الٰہی سبقت کا علم ہے۔ اور \"اللہ حق (الحق) فرماتا ہے اور وہی راہ دکھاتا ہے\" (وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب سیصد و چهل و نهم در معرفت منزل گشودن و بستن درها و آفرینش هر امت از حضرت محمدیه (الحضرة المحمدية).\n\nچیزی از کائنات را گمان مبر که برای آن *** وصفی از حق (الحق) باشد، حال آنکه کائنات تنها نشانه‌ها هستند.\n\nاز غیرت حق (الحق) بود که حق (الحق) دیدگان آنها شد *** قرآن و الهام به این امر آمده است.\n\nاگر فقر و خواری من نبود، به او نمی‌رسیدم *** و قرب و نزدیکی برایم محقق نمی‌شد.\n\nدر حق او، هر موجودی تلاش کرد و راه رفت *** این امر در کتاب خدا اعلام شده است.\n\nپس هر چیزی از اعیان (ذوات) او را تسبیح می‌کند *** به همین دلیل او را آفرید و خداوند بسیار داناست.\n\nو هر کونی از کائنات در هر حالی نیازمند است *** چه در لذت‌ها و چه در دردها.\n\nغنی کجاست؟ کلام خدا آن را باطل کرده است *** پس جز فقری که در آن نیستی است، نمی‌بینی.\n\nخداوند متعال فرمود: «همانا خداوند از جهانیان بی‌نیاز است» (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ). و فرمود: «شیطان شما را به فقر وعده می‌دهد و به فحشا امر می‌کند، و خداوند شما را به آمرزشی از جانب خود (در برابر فحشایی که به آن امر شدید) و فضلی (در برابر فقری که به آن وعده داده شدید) وعده می‌دهد، و خداوند بی‌نیاز و ستوده است» (الشَّيْطانُ يَعِدُكُمُ الْفَقْرَ ويَأْمُرُكُمْ بِالْفَحْشاءِ والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ... والله غَنِيٌّ حَمِيدٌ). و فرمود: «ای مردم، شما نیازمندان به سوی خدا هستید و خداوند همان بی‌نیاز ستوده است» (يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ). و به ابویزید بسطامی فرمود: «ای ابویزید، با چیزی به من نزدیک شو که من ندارم: خواری و نیازمندی (الذلة والافتقار)».\n\n### [اینکه خداوند درهایی را برای خیر گشوده و درهایی را آماده کرده که هنوز زمان گشودن آنها برای خیر نرسیده است]\n\nبدان که خداوند درهایی را برای خیر گشوده است و درهایی را آماده کرده که هنوز زمان گشودن آنها برای خیر نرسیده است، و درهایی را برای دردها گشوده که از آن به عذاب تعبیر می‌شود، زیرا سرانجام کار صاحبان آن به جایی می‌رسد که در پایان حال آن را شیرین می‌یابند. به همین دلیل آن را عذاب نامیده است. و این شیرینی یافتن در پایان کار به این دلیل است که او را به یاد پروردگارش می‌اندازد. زیرا انسان هنگامی که دچار سختی می‌شود و اسباب از او قطع می‌گردد، که این سخت‌ترین عذاب است، پروردگارش را به یاد می‌آورد و از روی اضطرار نه اختیار به سوی او باز می‌گردد. در این هنگام، آن امری را که او را به سوی خدا بازگردانده و به یاد او انداخته و از حکم غفلت و فراموشی‌اش خارج کرده، شیرین می‌یابد. پس آن را عذاب نامیده است، و این نام برای کسی که به آن دچار شود، مژده‌ای به رحمت است که به او خواهد رسید. چقدر لطیف است رساندن بشارت حق (الحق) به بندگانش در حال سختی و آسایش. اگر چنین نبود، کلام در این فرموده محقق نمی‌شد: «آیا کسی که کلمه عذاب بر او محقق شده است...» (أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ). پس لفظ عذاب را به کار برد. آیا نمی‌بینی که ابراهیم خلیل (علیه السلام) می‌گوید: «ای پدر، من می‌ترسم که عذابی از جانب رحمان به تو برسد» (يا أَبَتِ إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ). و رحمان دردی آزاردهنده نمی‌دهد مگر آنکه در لای آن رحمتی باشد که کسی که آن درد به او رسیده، آن را شیرین یابد، مانند نوشیدن دارویی که استعمال آن متضمن عافیت است. آیا نمی‌بینی که چگونه به پدرش گفت: «همانا شیطان نسبت به رحمان نافرمان بود» (إِنَّ الشَّيْطانَ كانَ لِلرَّحْمنِ عَصِيًّا). اگر می‌دانست که در رحمت چیزی است که موجب انتقام می‌شود، از او نافرمانی نمی‌کرد. پس او نافرمانی نکرد مگر رحمان را، زیرا هر اسمی «بر اساس ساختار خود عمل می‌کند» (يَعْمَلُ عَلى‏ شاكِلَتِهِ). پیامبران چقدر به پروردگارشان آگاهند! و شدیدترین دردها، نرسیدن به مقصود است. و روایت کرده‌ایم که خداوند به فرشته می‌گوید: «حاجت فلان را در این وقت برآورده مکن، زیرا دوست دارم صدای او را بشنوم»، هرچند آن شخص از فقدان آنچه از پروردگارش می‌خواهد، دردمند می‌شود. پس این منع دردناک، از یک رحمت الهی است. سپس، باطن دیوار (سور) رحمت خالص است و ظاهر آن از جانب عذاب است. و نگفت «دردهای عذاب»، زیرا می‌دانست که سرانجام کار به کجا می‌انجامد. پس خداوند متعال بیان کرد که باطن این موجود رحمت دارد و ظاهر آن جز به حکم باطن عمل نمی‌کند. بنابراین، هیچ امر دردناکی در ظاهر نیست مگر از رحمتی در باطن. زیرا حکم در ظاهر از آنِ باطن است. آیا جوارح که ظاهر هستند، جز از قصد باطن که آنها را به کار می‌اندازد، عمل می‌کنند؟ و قصد بی‌شک باطن است. پس عذاب در ظاهر دیوار (سور) نبود مگر از قصد رحمت به آن که در باطن دیوار است. و درد چیزی نیست جز فقدان لذت و نرسیدن به مقصود. پس نزد خدا دری گشوده نمی‌شود مگر درهای رحمت. با این تفاوت که رحمتی آشکار است که در آن دردی نیست، و رحمتی باطن است که در آن دردی در همان وقت هست و بس، سپس حکم آن در نهایت آشکار می‌شود. پس دردها عوارض هستند و لذت‌ها ثابت. عالم ذاتاً مورد رحمت است و به واسطه آنچه بر او عارض می‌شود، دردمند می‌گردد. و خداوند عزیز و حکیم است (عَزِيزٌ حَكِيمٌ) که امور را در جایگاه خود قرار می‌دهد و آنها را در منازلشان فرود می‌آورد. انسان فرزندش را برای ادب می‌زند و با آن ضربه او را به خاطر گناهش مجازات می‌کند، در حالی که در باطن به او رحم می‌کند. پس هنگامی که حق امر ادا شد، آنچه در قلب و باطنش از رحمت و شفقت پدر بر فرزند است، برای او آشکار می‌سازد. به همین دلیل:\n\nدر خبر از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در داستانی طولانی آمده است که در آن می‌فرماید: «و همانا شفقت خداوند بر بنده‌اش از شفقت این زن بر فرزندش بیشتر است» و به زنی اشاره کرد.\n\nو این همه از علوم اذواق (مکاشفات) است. خداوند ما و شنوندگان را به فضل خود از اهل رحمت خالصه‌ای قرار دهد که دردی در آن نیست.\n\n### [اینکه هستی (الوجود) خیر محض است که شری در آن نیست]\n\nو بدان که خداوند ممکنات را در اعیانشان موجود نساخت مگر برای آنکه آنها را از شرّ عدم خارج سازد، زیرا می‌دانست که هستی (الوجود) خیر محض است که شری در آن نیست، مگر به حکم عارض که از جهت امکان آن برای عدم است. اکنون که به آن نگریسته می‌شود، موصوف به هستی (الوجود) است، پس در خیر محض قرار دارد. پس آنچه از جهت امکانش از نظر عدم در حال وجودش به او می‌رسد، همان مقدار شرّی است که عالم آن را می‌یابد. پس هنگامی که ممکن به هستی (الوجود) خود نگاه می‌کند و آن را ابدی می‌بیند، از همراهی هستی (الوجود) با خود شاد می‌شود، و هنگامی که به حالتی که بدان موصوف بود و هستی (الوجود) نداشت نگاه می‌کند، با مشاهده آن متألم می‌گردد، زیرا حال بر کسی که به آن قائم است حکم می‌کند. و حال این ممکن اکنون مشاهده عدم است، پس به عذابی وهمی معذب می‌شود.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در هنگام سختی می‌فرمود: «الحمد لله على كل حال» (ستایش مخصوص خداست در هر حال).\n\nو از احوال موجب حمد، احوال آسایش است که حمد آن «الحمد لله المنعم المتفضل» (ستایش مخصوص خدای نعمت‌دهنده و فضل‌کننده است) می‌باشد. اگر حمد بر هر حال متضمن حمد آسایش نبود، این اعلامی بود بر اینکه در سختی، آسایشی نهفته است به دلیل عمومیت حمد آن. و حمد، ثنا بر محمود است. اگر در لای آن سختی، آسایشی نبود، آن حمد در حال سختی، ثنایی از سوی حامد نبود. و حمد بی‌شک در نفس الامر ثنا است. پس در عالم هیچ ضرری نیست که آمیخته به رحمت نباشد، همان‌طور که هیچ معصیتی از مؤمن خالص نیست که آمیخته به طاعتی نباشد، و آن طاعت ایمان است. پس او در مخالفت خود هم مطیع است و هم عاصی، مانند کسی که معذب و در عین حال مورد رحمت است.\n\n### [اینکه ممکنات ذاتاً نیازمند هستند، پس فقر همواره آنها را همراهی می‌کند]\n\nسپس باید بدانی که ممکنات ذاتاً نیازمند هستند، پس فقر همواره آنها را همراهی می‌کند، زیرا ذات آنها دائمی است. پس خداوند اسبابی را برای آنها قرار داد که آنچه بدان نیازمندند، نزد آن اسباب برایشان حاصل شود. پس به اسباب نیازمند شدند. پس خداوند عین اسباب را نام‌های خود قرار داد. پس نام‌های اسباب از نام‌های خداوند متعال است تا جز به او نیازمند نباشند، زیرا این علم صحیح است. پس نزد اهل کشف (الکشف) تفاوتی بین نام‌هایی که در عرف و شرع گفته می‌شود نام‌های خدا هستند و نام‌های اسباب وجود ندارد که آنها نیز نام‌های خدا باشند. زیرا او فرمود: «شما نیازمندان به سوی خدا هستید» (أَنْتُمُ الْفُقَراءُ إِلَى الله). و ما در واقع می‌بینیم که افتقار به اسباب است. پس ناگزیر نام‌های اسباب باید نام‌های خداوند متعال باشند. پس ما او را با آنها به دعای حال می‌خوانیم نه به دعای الفاظ. پس هنگامی که گرسنگی به ما می‌رسد، به سرعت به سوی غذایی می‌رویم که درد گرسنگی را برطرف می‌کند. پس ما به آن نیازمندیم و آن از ما بی‌نیاز است، در حالی که ما جز به خدا نیازمند نیستیم. پس این نامی از نام‌های اوست، یعنی صورت آن غذا که به منزله صورت لفظ اسم الهی یا صورت رقم آن است. و به همین دلیل به شکرگزاری از اسباب امر شده است، زیرا این امر به شکرگزاری از اوست، و این ثنا بر او به واسطه آنهاست.\n\n### [اینکه از رحمت خداوند بر خلقش این است که بر قدم هر پیامبری، ولیّی وارث برای او قرار داده است]\n\nو بدان که از رحمت خداوند بر خلقش این است که بر قدم هر پیامبری، ولیّی وارث برای او قرار داده است. پس ناگزیر باید در هر عصری صد هزار و بیست و چهار هزار ولیّ به تعداد انبیا وجود داشته باشد و بر این تعداد افزوده می‌شود و کاسته نمی‌شود. اگر افزوده شوند، خداوند علم آن پیامبر را بر کسانی که از او ارث برده‌اند تقسیم می‌کند. زیرا علوم نازل شده بر قلب‌های انبیا از دنیا برداشته نمی‌شود و جز قلب‌های مردان (اولیا) جایگاهی ندارد. پس بر اساس تعدادشان بر آنها تقسیم می‌شود. پس ناگزیر باید در امت، اولیایی به تعداد انبیا و بیشتر از آن وجود داشته باشند.\n\nاز خضر (علیه السلام) روایت کرده‌ایم که گفت: «هیچ روزی نیست که با خود بگویم ولیّی از اولیای خدا در زمین نمانده مگر آنکه او را دیده‌ام و با او ملاقات کرده‌ام، مگر آنکه ناگزیرم در آن روز با ولیّی از اولیای خدا ملاقات کنم که پیش از آن او را نمی‌شناختم.»\n\nو از او روایت کرده‌ایم که گفت: «روزی با شخصی ملاقات کردم که او را نمی‌شناختم. او به من گفت: ای خضر، سلام بر تو. به او گفتم: از کجا مرا شناختی؟ گفت: خداوند مرا به تو شناساند.»\n\nپس دانستم که خداوند بندگانی دارد که خضر را می‌شناسند، اما خضر آنها را نمی‌شناسد.\n\n### [اینکه خداوند بندگانی پنهان، نیکوکار، برگزیده و ولیّ دارد]\n\nو بدان که خداوند بندگانی پنهان (أخفياء)، نیکوکار (أبرياء)، برگزیده (أصفياء)، و ولیّ (أولياء) دارد که بین آنها و مردم حجاب‌های عادات قرار دارد. آنها در میان مردم پنهان هستند و چیزی که آنها را از مردم متمایز کند، بر آنها ظاهر نمی‌شود. و خداوند به واسطه آنها عالم را حفظ می‌کند و بندگانش را یاری می‌دهد. آنها در آسمان شناخته شده و در زمین نزد هم‌نوعان خود ناشناخته‌اند. برای آنها در دنیا و آخرت خوشی و آسایش است. آنها نه پیامبرند و نه شهید، اما پیامبران و شهدا به حال آنها غبطه می‌خورند. نه در دنیا شناخته می‌شوند و نه در آخرت شفاعت می‌کنند. آنها در سرّ خود با حق (الحق) منفرد شده‌اند. و من نمی‌دانستم که خداوند در هستی (الوجود) بر قدم هر پیامبری، ولیّی برای خود قرار داده است، زیرا هنگامی که خداوند متعال مرا با همه پیامبرانش جمع کرد، به طوری که هیچ پیامبری نماند مگر آنکه او را در یک مجلس دیدم، هیچ کس از کسانی که بر قدم آنها بودند را همراهشان ندیدم. سپس پس از آن، همه مؤمنان را دیدم که در میان آنها کسانی بودند که بر قدم‌های انبیا بودند و دیگر اولیا. چون آنها را یک مجلس جمع نکرد، به همین دلیل آنها را نشناختم. سپس پس از آن آنها را شناختم و خداوند مرا از دیدن آنها بهره‌مند ساخت. و شیخ ما ابوالعباس عریبی بر قدم عیسی (علیه السلام) بود. و ما پیش از این می‌گفتیم که اولیایی بر قلب‌های انبیا هستند. به ما گفته شد: «نه، بلکه بگو بر قدم‌های انبیا هستند، نگو بر قلب‌هایشان.» پس دانستم که منظور از این چیست، هنگامی که خداوند مرا بر آن مطلع ساخت. آنها را دیدم که بر آثار آنها می‌ایستند. و برای آنها دو معراج دیدم: یک معراج که در آن بر قلب‌های انبیا هستند، اما از آن جهت که انبیا، اولیای نبوت غیر تشریعی هستند. و معراج دوم که در آن بر قدم‌های انبیا صاحبان شرایع هستند، نه بر قلب‌هایشان. زیرا اگر بر قلب‌هایشان بودند، به آنچه انبیا از احکام تشریعی رسیدند، می‌رسیدند، در حالی که این برای آنها نیست، هرچند تعریف الهی (التعريف الإلهي) برایشان حاصل شود. و آنها شریعت را از همان جایی که انبیا گرفتند، می‌گیرند، اما از مشکات انوار انبیا، و حکم تبعیت با آن همراه می‌شود. پس این امر از جانب خدا و از روح القدس برای آنها خالص نمی‌شود. و غیر از این فن از علم، برای اولیا از جانب خداوند سبحان و از ارواح قدسیه خالص است. و این همه برای آن است که مراتب نزد خدا متمایز شوند تا ما آن را بشناسیم و حق هر صاحب حقی را بدهیم، همان‌طور که خداوند به هر چیزی خلقتش را عطا کرد. و این همه از رحمت خداست که بر خلقش افاضه کرده است.\n\n### [اینکه خداوند برای فرشتگان سه مرتبه در نیروی الهی قرار داده است]\n\nسپس باید بدانی که خداوند برای فرشتگان سه مرتبه در نیروی الهی قرار داده است. پس برخی از آنها کسانی هستند که دو نیرو به آنها داده شده، و برخی سه نیرو، و برخی چهار نیرو که این نهایت است. زیرا هستی (الوجود) بر اساس تربیع (چهارگانه) بنا شده است بدون هیچ افزایشی. جز اینکه هر نیرویی متضمن نیروهایی است که تعداد آنها را جز خدا نمی‌داند. و این از آن جهت است که فرشتگان اجسام نوری هستند، پس این نیروها را از جهت اجسامشان دارند، زیرا آنها مانند اجسام طبیعی مرکب هستند. پس فرشته صاحب دو نیرو بر ترکیب نبات است، و صاحب سه نیرو بر ترکیب حیوان، و صاحب چهار نیرو بر ترکیب انسان. و موالید (مخلوقات) به پایان رسیدند، پس نیروهای فرشتگان نیز به پایان رسیدند. و جسم همه را جمع می‌کند، پس احاطه دارد. پس فرشتگان اجسام نوری را از عماء (فضای ابهام) پذیرفتند که در آن جسم نوری کل ظاهر شد و شکل و صورت‌ها را پذیرفت. و ارواح ملکی در آن ظاهر می‌شوند. و عماء برای این جسم کل و آنچه از صورت‌ها و شکل‌های الهی و روحانی حمل می‌کند، به منزله هیولای (ماده اولیه) در اجسام طبیعی است، کاملاً یکسان. و تفصیل در این باره طولانی است. و از این نور که فوق طبیعت است، ارواح در اجسام طبیعی دمیده می‌شوند. پس آنچه زیر طبیعت تا عناصر است، انوار در سایه‌ها هستند. و آنچه زیر عناصر از اجسام عنصری است، انوار در ظلمت هستند. و آنچه فوق طبیعت از اجسام نوری است، انوار در انوار هستند. و اگر بخواهی، انوار در انفاس رحمانیه هستند. و اگر بخواهی، انوار در عماء. هر طور که می‌خواهی تعبیر کن، اگر امر را آن‌گونه که هست بشناسی.\n\n### [اینکه هر روحی که زیر عقل اول (العقل الأول) صاحب کلمه است، فرشته است]\n\nو بدان که هر روحی که زیر عقل اول (العقل الأول) صاحب کلمه است، فرشته است، و آنچه بالاتر از آن است، روح است نه فرشته. اما فرشتگان، آنها بین مسخّر و مدبّر هستند و همگی فرستادگان خدا به امر خدا و حافظان هستند. و آنها بر مراتب هستند و برای آنها معراج و نزول و صعود دنیوی و اخروی است. پس برخی از آنها مسخّر در دعا و استغفار برای مؤمنان هستند، و برخی دیگر در استغفار برای «کسانی که در زمین هستند» (لِمَنْ في الْأَرْضِ). و برخی مسخّر در مصالح عالم مربوط به دنیا هستند، و برخی مسخّر در مصالح عالم مربوط به آخرت. و این مقدار از عملی که بر آن هستند، عبادت و نماز آنهاست. و اما تسبیح آنها، ذکر خدا در این نمازهایی است که برای آنهاست، مانند قرائت و ذکر برای ما در نمازمان. و این امر همواره چنین خواهد بود تا زمانی که خداوند بخواهد رحمت، همه خلقش را فرا گیرد، رحمتی که «همه چیز را فرا گرفته است» (وَسِعَتْ كُلَّ شَيْ‏ءٍ). پس هنگامی که رحمت آنها را فرا گیرد، برای برخی از فرشتگان که عبادتشان استغفار بود، جز تسبیح باقی نمی‌ماند. و فرشتگانی که به احوال ما در بهشت‌ها و هر کجا که کسی در دو سرا باشد، تعلق دارند، کارشان قطع نمی‌شود. و نام فرشتگی از آن گروه اول برداشته می‌شود و آنها ارواحی باقی می‌مانند که شغلی جز تسبیح و تمجید خداوند متعال ندارند، مانند سایر ارواح حیران (المهيمة). و «فرشتگان از هر دری بر آنان وارد می‌شوند، سلام بر شما به خاطر صبری که کردید، پس چه نیکو است سرانجام این سرا» (الْمَلائِكَةُ يَدْخُلُونَ عَلَيْهِمْ من كُلِّ بابٍ سَلامٌ عَلَيْكُمْ بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ). این گروهی که در اینجا ذکر شده‌اند، صابران و اهل بلا از بشر هستند. اما فرشتگانی که بر اهل نعمت شاکر وارد می‌شوند، ذکری از آنها به میان نیامده است، در حالی که ناگزیر باید فرشتگان از هر دری بر آنها وارد شوند، زیرا درهای نعمت مانند درهای بلا بسیار است. و کسی که ببیند نعمت‌هایی که خداوند بر بندگانش در دنیا ارزانی داشته، از بلا خالص نیست، به دلیل تکلیف به شکرگزاری که بر آنها واجب شده، و این بزرگترین بلاست، زیرا نعمت‌ها در حجاب بودن از خدا شدیدتر از مصیبت‌ها هستند. پس اهل نعمت بر این اساس در این سخن فرشتگان داخل می‌شوند: «به خاطر صبری که کردید، پس چه نیکو است سرانجام این سرا» (بِما صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ)، یعنی به سرایی رسیدید که نعمت آن آمیخته به تکلیف و طلب حق نیست. به همین دلیل ذکری از احوال فرشتگان با شاکران به میان نیامده و به آنچه حق (الحق) از تعریف آورده، اکتفا شده است، و این صحیح است. زیرا سرای دنیا این را می‌دهد، و این همان چیزی است که کشف (الکشف) بدون ابهام اقتضا می‌کند: اینکه همه کسانی که در سرای دنیا هستند، چه مبتلا و چه متنعم، حال صبر را دارند. پس صبر اعم از شکر است و بلا اعم از نعمت در این سرا. و هنگامی که رحمت فراگیر شود و آثاری که با رحمت در تناقض هستند، برداشته شوند، نسبت‌های نام‌هایی که آن آثار تعیین کرده‌اند، برداشته می‌شوند، زیرا آنها به یک عین واحد باز می‌گردند، همان‌طور که خداوند متعال در این فرموده بیان کرد: «و برای خدا نام‌های نیکو است» (ولِلَّهِ الْأَسْماءُ الْحُسْنى‏). و فرمود: «بگو خدا را بخوانید یا رحمان را بخوانید، هر کدام را بخوانید، پس نام‌های نیکو برای اوست» (قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏). و نام‌ها وضعی هستند که حقایق ممکنات بر اساس آنچه طلب می‌کنند، آنها را وضع کرده‌اند. پس به اندازه‌ای که بر استعداد باشند، آنچه مناسب آن است از فیض الهی را طلب می‌کنند. پس هنگامی که به آنها عطا شد، برای هر عین از آن نام‌هایی وضع کردند. پس هنگامی که دیگر استعدادی برای پذیرش درد و عذاب نداشته باشند، عین درد و عذاب به دلیل نبود پذیرنده، یافت نمی‌شود. پس نسبت‌های نام‌های مختص به این احکام به دلیل برداشته شدن پذیرنده‌ها، برداشته می‌شوند. و نامی که دو حکم در پذیرنده داشت، باقی می‌ماند، مانند غافر (پوشاننده). پس دیگر گناهی نیست که غافر را طلب کند، اما غافر حکم حجاب مطلق را دارد، پس غافر باقی می‌ماند، هرچند گناهکار از بین برود. زیرا غفران (پوشاندن) ضروری است، و اگر چنین نبود، افزایشی (مزید) و خلق جدیدی نبود. و افزایش (المزید) همیشگی است، پس برداشتن پرده‌ها همیشگی است. و جز اسم غفور (الغفور) نیست. بر خلاف منتقم، زیرا پذیرنده برداشته شده، پس این وضع خاص از بین رفته است. پس این را بدان. و در این منزل از علوم، علم ثنای آسمان و زمین و فرشتگان، بدون سایر مخلوقات، و آنچه با آن پروردگارشان را ثنا می‌گویند، وجود دارد. زیرا برای هر عالمی ثنای خاصی است که برای دیگری نیست. خداوند متعال فرمود: «آسمان‌های هفت‌گانه و زمین او را تسبیح می‌کنند» (تُسَبِّحُ لَهُ السَّماواتُ السَّبْعُ والْأَرْضُ). سپس فرمود: «و هر که در آنهاست» (ومن فِيهِنَّ). و آسمان‌ها و زمین را جمعی از عاقلان جمع بست. و در آن علم تشبیه و کنایات و آنچه در عالم روحانی از نیروهاست، وجود دارد. و در آن علم رسالت‌های پراکنده در عالم است، و اینکه هر کس در عالم راه می‌رود، جز به عنوان رسولی با رسالتی راه نمی‌رود. و این علم شریفی است، حتی کرم در حرکاتش در رسالتی است که برای کسی که آن را تعقل کند، تلاش می‌کند. و در آن علم آثار قدرت و تمییز آن از سایر نسبت‌ها وجود دارد. و در آن علم انواء (ستارگان باران‌زا) و آنچه از آنها ستوده می‌شود و سخن ابوهریره (رضی الله عنه) که گفت: «به نوء الفتح (ستاره گشایش) بر ما باران بارید» وجود دارد. و در آن علم درها و مراتب آنها وجود دارد. و در آن علم این است که منع الهی، عطاست. و در آن علم تحدید الهی (محدود کردن الهی) وجود دارد. و در آن علم تنزیل خطاب الهی بر اساس تواطؤ (همخوانی) وجود دارد. و در آن علم آگاه‌سازی الهی در طلب شکر از بندگانش وجود دارد. و در آن علم بازگشت خلق به سوی او تعالی وجود دارد. و در آن علم وعده‌ها به طور مطلق وجود دارد. و در آن علم تمییز بین دشمنانی که در صورت دوستی ظاهر می‌شوند و بین اولیا وجود دارد. و در آن علم مجازات دشمن با دشمنی و ولیّ با ولایت در میان عالم وجود دارد، و اینکه هر کس دشمن را ولیّ یا ولیّ را دشمن بگیرد، آشفته‌ای است که حقیقتی نزد او نیست. و در آن علم این است که هر دعوت‌کننده‌ای جز برای خودش دعوت نمی‌کند، حتی اگر به سوی خداوند متعال یا برای غیر خودش دعوت کند، جز از جهت نفس خود دعوت نمی‌کند، زیرا با آن دعا، انس با اشکال در مرتبه را می‌طلبد. و در آن علم ترتیب ثواب بر اعمال وجود دارد. و در آن تمییز پاداش‌ها (الأجور) وجود دارد، زیرا برخی از آنها عظیم، کریم و کبیر هستند، و اینها مراتبی در پاداش‌ها هستند که باید صاحبان آنها و اعمالی که موجب آنها می‌شوند، شناخته شوند. و علم پاداش مطلق که مقید نیست، آیا در نفس الامر مقید است یا خیر؟ زیرا پاداش‌ها چهار نوع هستند، همان‌طور که نشأت انسان بر چهار است، همان‌طور که نشأت جسدش بر چهار است. برای هر یک پاداشی مخصوص به خود بر صفتی مخصوص است، پس هر پاداشی به آنچه مناسب آن است، نسبت داده می‌شود. و در آن علم آنچه ورای پرده‌هاست وجود دارد. و در آن علم قبیحی وجود دارد که مشاهده آن را نیکو می‌سازد، و این سرّی عجیب است. و در آن علم عزل (برکناری) وجود دارد. و در آن علم تشویق انسان به مشغول شدن به نفس خود وجود دارد. و در آن علم ظهور از خفا وجود دارد. و در آن علم حاملان علوی و سفلی وجود دارد. و در آن علم برتری صفات در موصوفین به شدید و شدیدتر وجود دارد. و در آن علم حضرت جامع منافع انسانی وجود دارد، و آن حضرت نعمت‌ها برای مسافر و مقیم و متحرک و ساکن است. و در آن علم تسخیر و مسخّرشدگان وجود دارد، و اینکه آیا هر مسخّرشده‌ای اجلی دارد که تسخیرش به آن پایان می‌یابد یا خیر؟ یا برخی از آنها اجل دارند و برخی ندارند. و در آن علم «خبر یقین نزد جهینه است» و سخن آنها که می‌گویند: «بر خبیر (آگاه) افتادی» و نگفتند «بر علیم (دانا) افتادی» و نگفتند «علم یقین نزد جهینه است» وجود دارد.\n\nو در آن علم ظهور حق (الحق) و سریان آن در هر چیزی و تقسیمات حق (الحق) در این فرموده که «برای هر حقی، حقیقتی است» که کلمه «کل» (هر) را بر آن وارد کرد، وجود دارد. و در آن علم انفراد هر مکلفی به نفس خود و فرق بین او و کسی که از مکلفین به نفس خود منفرد نمی‌شود، یعنی از جن و انس، و در چه چیزی منفرد می‌شود و در چه چیزی منفرد نمی‌شود، وجود دارد. و در آن علم قوابل (پذیرنده‌ها) و اینکه داعی (دعوت‌کننده) در چه کسی تأثیر می‌گذارد، وجود دارد. و در آن علم آنچه برای اصحاب قبور در قبورشان حاصل می‌شود و اینکه قبور چیستند، وجود دارد. و در آن علم گرفتن از هر کسی و صفت مأخوذ (گرفته شده) و مأخوذ منه (کسی که از او گرفته شده) وجود دارد. و در آن علم این است که آیا اعراض نسبت‌های عدمی هستند یا امور وجودی که دارای اعیان هستند، وجود دارد. و در آن علم آنچه برای اهل عنایت از عزت و حجاب حاصل می‌شود، وجود دارد. و در آن علم مراتب اتباع انبیا وجود دارد. و در آن علم مزید (افزایش) وجود دارد. و در آن علم تمنی (آرزو) وجود دارد. و در آن علم سریان حکمت در مراتب موجودات بر اساس آنچه هستند، وجود دارد. و در آن علم سبقت الهی برای عالم وجود دارد. و «خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}