{
  "id": 254,
  "title": {
    "ar": "الباب الرابع والخمسون ومائتان في معرفة الستر وهو ما سترك عما يفنيك",
    "en": "The Two Hundred and Fifty-Fourth Chapter: Concerning the Gnosis of the Veil (الستر), which is that which screens you from that which brings about your annihilation (الفناء).",
    "ur": "باب دو سو چونتیس: ستر (الستر) کی معرفت میں، اور وہ (ستر) وہ ہے جو تمہیں اس چیز سے ڈھانپتا ہے جو تمہیں فنا (الفناء) کر دے۔",
    "fa": "باب دویست و پنجاه و چهارم در معرفت ستر (پوشش) و آن چیزی است که تو را از آنچه فانی‌ات می‌سازد، می‌پوشاند."
  },
  "content": {
    "ar": "## «الباب الرابع والخمسون ومائتان في معرفة الستر وهو ما سترك عما يفنيك»\n\n\n> والله ما تسدل الأستار والكلل *** إلا من أجل الذي تحظى به المقل‏\n\n\n> وقد يكون حذارا من تأملها *** أو للذي يقتضيه الطبع والملل‏\n\n\n> إذا نظرت الذي يحويه من عبر *** أساسا لها قامت الأغراض والملل‏\n\n\n> لو لا الستور التي تخفى ضنائنها *** لم يدر ما كان لي أ فيها ولا أمل‏\n\n\n> والله ما ترسل الأستار والكلل *** إلا لأمر عظيم خطبه جلل‏\n\n\n### [الستر غطاء الكون والوقوف مع العادات ونتائج الأعمال‏]\n\n\nالستر غطاء الكون والوقوف مع العادات ونتائج الأعمال وقد أعلمناك أن الأسباب حجب إلهية لا يصح رفعها إلا بها فعين رفعها سد لها وحقيقة محوها إثباتها والستر رحمة عامة إلهية في حق العامة لما قدر عليهم من المخالفة لأوامره فلا بد لهم من إيقاعها ومع الكشف والتجلي فلا تقع أبدا فلا بد من الستر ولهذا أهل التجلي العلمي رفع عنهم الحجر فلم يبق في حقهم تحجير بل أبيح لهم ما شاءوه في تصرفهم فإنه‏\n\n\nورد في صحيح الخبر أن الله يقول لمن أذنب فعلم أن له ربا يغفر الذنب ويأخذ بالذنب اعمل ما شئت فقد غفرت لك‏\n\n\nفأباح لمن هذه صفته ما حجره على غيره ومن المحال أن‏\nيأمره بإتيان ما حجر عليه الإتيان به ف إِنَّ الله لا يَأْمُرُ بِالْفَحْشاءِ فأسدل الستور دون أهل الحجر هذا حكمه في العامة وأما في الخاصة فقول القائل‏\n\n\n> فأنت حجاب القلب عن سر غيبه *** ولولاك لم يطبع عليه ختامه‏\n\n\nفجعلك عين ستره عليك ولو لا هذا الستر ما طلبت الزيادة من العلم به فأنت المتكلم والمخاطب من خلف ستر الصورة التي كلمك منها فانظر في بشريتك تجدها عين سترك الذي كلمك من ورائه فإنه يقول وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ وقد يكلمك منك فأنت حجاب نفسك عنك وستره عليك ومن المحال أن تزول عن كونك بشرا فإنك بشر لذاتك ولو غبت عنك أو فنيت بحال يطرأ عليك فبشريتك قائمة العين فالستر مسدل فلا تقع العين إلا على ستر لأنها لا تقع إلا على صورة وهذا لما تقتضيه الألوهية من الغيرة والرحمة فأما الغيرة فإنه يغار أن يدركه غير فيكون محاطا لمن أدركه وهو بِكُلِّ شَيْ‏ءٍ مُحِيطٌ والمحاط فلا يكون محيطا لمن أحاط به وأما الرحمة فإنه علم أن المحدثات لا تبقي لسبحات وجهه بل تحترق بها فسترهم رحمة بهم لا بقاء عينهم ثم إن الله أيضا أسدل للعالمين ستور نتائج أعمالهم بقوله إن عمل كذا ينتج لعامله كذا فيقف العامل مع النتيجة لا رغبة فيها إذا كان من أهل الخصوص وإنما يرغب من يرغب فيها ليصحح بها وبشهودها عمله الذي كلفه به سيده وأما العامة فلرغبتها فيها وتعشقها بها فلما جعل الله علامات تدل على صحة الأعمال في العاملين رغبت الخاصة في مشاهدة نتائج الأعمال ليكونوا على بصيرة في أمورهم إذ كان مطلوبهم وهمهم القيام بما أشهدهم عليه من الحقوق وليست الحقوق سوى الأعمال التي كلفهم وقد يسدل الستر خوفا من نفوذ العين وإصابته ويدخل في هذا سدل الحجب من أجل السبحات الوجهية المحرقة أعيان الممكنات وأما في حق بعض الناس ممن ليست له تلك القدم في العلم بالله فلا يعلم أن لله تجليا في كل نفس ما هو على صورة التجلي الأول فلما غاب عنه هذا الإدراك ربما استصحب تجليا ودام عليه شهوده والطبع يطلبه بحقيقته فيدركه الملل والملل في هذا المقام عدم احترام بالجناب الإلهي فإنهم في لَبْسٍ من خَلْقٍ جَدِيدٍ مع الأنفاس وهم يتخيلون أن الأمر ما تغير فسدل الستر من أجل الملل الذي يؤدي إلى عدم الاحترام لما حرمهم الله العلم بهم وبالله فهم يتخيلون أنهم هم في كل نفس وهم هم من حيث جوهريتهم لا من حيث ما يتصفون به ولا تقل إن الأمر ليس كذلك هذا من الأسرار الإلهية التي قد حجب الله عن إدراكها خلقا كثيرا من أهل الله أرباب فتوح المكاشفة فكيف حال غيرهم فيها فالستر لا بد منه إذ لا بد منك فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 254: Concerning the Knowledge of the Veil (الستر), which is that which veils you from that which annihilates you\n\nBy God, the veils and coverings are not drawn down,\nExcept for the sake of that which the eyes attain.\n\nAnd sometimes it is a caution against contemplating them,\nOr due to what nature and weariness necessitate.\n\nIf you look at what it contains of lessons,\nUpon which the purposes and the creeds are established as a foundation.\n\nWere it not for the veils that conceal its secrets,\nOne would not know what was destined for them, neither in it nor in hope.\n\nBy God, the veils and coverings are not sent down,\nExcept for a great matter whose import is momentous.\n\n### [The Veil (الستر) is the Covering of the Cosmos, Adherence to Customs, and the Results of Actions]\n\nThe Veil (*al-Sitr*) is the covering of the Cosmos (*al-'Alam*), and the adherence to customs (*al-'Adat*) and the results of actions. We have already informed you that causes (*al-Asbab*) are Divine Veils (*Hujub Ilahiyya*) which cannot properly be lifted except by means of themselves; thus, the very removal of them is their establishment, and the reality of their effacement is their affirmation.\n\nThe Veil is a general Divine Mercy (*Rahma 'Amma Ilahiyya*) concerning the common people (*al-'Amma*), due to the transgression of His commands that has been decreed upon them, which they must necessarily commit. Yet, with Unveiling (*al-Kashf*) and Theophany (*al-Tajalli*), these transgressions would never occur; therefore, the Veil is necessary. For this reason, the restriction was lifted from the People of the Gnostic Theophany, so no prohibition remains concerning them; rather, what they wish in their conduct is permitted to them. For it is reported in the authentic tradition that Allah says to the one who sins, yet knows that he has a Lord who forgives sin and holds accountable for sin: \"Do what you wish, for I have forgiven you.\"\n\nThus, He permitted to the one possessing this description what He restricted for others. It is impossible that He would command him to commit what He restricted him from committing, for <<إِنَّ اللهَ لا يَأْمُرُ بِالْفَحْشاءِ>> (Indeed, Allah does not command immorality). Thus, He drew the veils before the people of restriction. This is His ruling concerning the common people.\n\nAs for the elite (*al-Khassa*), it is the saying of the poet:\n\n> You are the veil of the heart from the secret of His Unseen,\n> And were it not for you, its seal would not be impressed upon it.\n\nThus, He made you the very essence of His veil upon you, and were it not for this Veil, you would not seek increase in the Knowledge (*al-'Ilm*) of Him. For you are the Speaker and the Addressee from behind the veil of the form (*al-Sura*) from which He addressed you. Look into your humanity (*Bashariyya*) and you will find it is the very essence of your veil, from behind which He addressed you. For He says: <<وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللهُ إِلَّا وَحْياً أَوْ مِنْ وَرَاءِ حِجَابٍ>> (It is not for any human being that Allah should speak to him except by inspiration or from behind a veil). And He may address you from yourself, so you are the veil of your self from yourself, and His veil upon you.\n\nIt is impossible that you should cease to be human, for you are human by your Essence (*al-Dhat*). Even if you are absent from yourself or annihilated (*Fana'*) by a state that overtakes you, your humanity remains established in its essence. Thus, the Veil is drawn down, and the eye falls only upon a veil, because it falls only upon a form.\n\nThis is due to what the Divinity (*al-Uluhiyya*) necessitates of Jealousy (*al-Ghira*) and Mercy (*al-Rahma*). As for the Jealousy, He is jealous that another should comprehend Him, thereby becoming encompassed by the one who comprehends Him, while He is <<بِكُلِّ شَيْءٍ مُحِيطٌ>> (the Encompasser of all things). And the encompassed cannot be the encompasser of the one who encompasses him. As for the Mercy, He knew that contingent beings (*al-Muhdathat*) cannot remain before the splendors (*Subuhat*) of His Face, but would rather be burned up by them. So He veiled them out of mercy for them, for the subsistence (*Baqa'*) of their essence.\n\nFurthermore, Allah also drew down for the worlds the veils of the results of their actions by His saying that such-and-such an action produces such-and-such a result for its doer. The doer adheres to the result, not out of desire for it, if he is among the People of Distinction (*Ahl al-Khusus*). Rather, the one who desires it only desires it so that by means of it and by witnessing it (*Shuhud*), he may validate his action with which his Lord charged him. As for the common people, it is due to their desire for it and their passionate attachment to it. Since Allah established signs indicating the soundness of actions in the doers, the elite desired the witnessing of the results of actions so that they might be upon clear insight (*Basira*) in their affairs, given that their goal and concern was the fulfillment of the rights (*al-Huquq*) upon which He made them witness. And these rights are nothing other than the actions with which He charged them.\n\nThe Veil may also be drawn down for fear of the penetration and affliction of the eye. This includes the drawing down of the veils because of the splendors of the Face which burn up the Fixed Entities (*al-A'yan al-Mumkinat*).\n\nAs for some people who do not possess that firm footing in the Knowledge of Allah (*al-'Ilm bi-Allah*), they do not know that Allah has a Theophany (*al-Tajalli*) in every breath that is not in the form of the first Theophany. When this realization is absent from them, they might accompany one Theophany and their witnessing of it persists, while nature seeks its reality, and weariness overtakes them. Weariness in this station is a lack of reverence for the Divine Presence, for they are in confusion regarding <<خَلْقٍ جَدِيدٍ>> (a new creation) with every breath, yet they imagine that the matter has not changed. Thus, the Veil was drawn down because of the weariness that leads to a lack of reverence, since Allah deprived them of the knowledge of themselves and of Allah. They imagine that they are themselves in every breath, and they are themselves in terms of their essential nature, not in terms of what they are qualified by.\n\nDo not say that the matter is otherwise. This is one of the Divine Secrets (*al-Asrar al-Ilahiyya*) whose realization Allah has veiled from many of the People of Allah, the masters of the Openings of Unveiling (*Futuh al-Mukashafa*); so what is the state of others concerning it? The Veil is necessary, since you are necessary. Understand this. And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو چون (۲۵۴) پردہ (الستر) کی معرفت میں، اور یہ وہ ہے جو تمہیں اس چیز سے ڈھانپتا ہے جو تمہیں فنا کر دے۔\n\nخدا کی قسم! پردے اور غلاف نہیں لٹکائے جاتے،\nمگر صرف اس چیز کی خاطر جسے آنکھیں حاصل کرتی ہیں۔\n\nاور یہ (پردہ) کبھی ان (چیزوں) کے غور و فکر سے بچاؤ کے لیے ہوتا ہے،\nیا اس چیز کے لیے جسے طبیعت اور اکتاہٹ (الملل) تقاضا کرتی ہے۔\n\nجب تم دیکھو کہ اس (پردے) میں کیا عبرتیں پوشیدہ ہیں،\nتو ان کے لیے مقاصد اور ملتیں (طریقے) قائم ہو گئیں۔\n\nاگر وہ پردے نہ ہوتے جو اپنے خزانوں کو چھپاتے ہیں،\nتو یہ معلوم نہ ہوتا کہ میرے لیے اس میں کیا ہے، نہ کوئی امید۔\n\nخدا کی قسم! پردے اور غلاف نہیں بھیجے جاتے،\nمگر کسی ایسے عظیم معاملے کے لیے جس کی اہمیت بہت بڑی ہو۔\n\n### [پردہ (الستر) کائنات کا غلاف، عادات اور اعمال کے نتائج پر ٹھہرنا]\n\nپردہ (الستر) کائنات کا غلاف ہے اور عادات اور اعمال کے نتائج پر ٹھہرنا ہے۔ اور ہم تمہیں بتا چکے ہیں کہ اسباب (الأسباب) الٰہی حجابات ہیں جن کا اٹھانا ان کے ذریعے ہی درست ہوتا ہے۔ پس ان کا اٹھانا ہی درحقیقت ان کا سدِ باب ہے، اور ان کا مٹانا ہی حقیقت میں ان کا اثبات ہے۔\n\nاور پردہ (الستر) عام لوگوں کے حق میں ایک عام الٰہی رحمت ہے، کیونکہ ان پر اس کے احکام کی خلاف ورزی مقدر کی گئی ہے۔ لہٰذا ان کے لیے اس کا ارتکاب ناگزیر ہے۔ اور کشف (الکشف) اور ظہور الٰہی (التجلی) کے ساتھ یہ کبھی واقع نہیں ہو سکتی، اس لیے پردہ ضروری ہے۔ اسی وجہ سے اہل تجلی علمی (التجلی) سے پابندی اٹھا لی گئی، چنانچہ ان کے حق میں کوئی ممانعت باقی نہیں رہی، بلکہ انہیں اپنے تصرفات میں جو چاہیں مباح کر دیا گیا۔\n\nصحیح حدیث میں آیا ہے کہ اللہ تعالیٰ اس شخص سے فرماتا ہے جس نے گناہ کیا اور جان لیا کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور گناہ پر پکڑتا ہے: \"جو چاہے کر، میں نے تجھے بخش دیا۔\"\n\nپس جس کی یہ صفت ہے، اس کے لیے وہ چیز مباح کر دی گئی جو دوسروں پر ممنوع تھی۔ اور یہ محال ہے کہ وہ اسے کسی ایسی چیز کے ارتکاب کا حکم دے جس کا ارتکاب اس پر ممنوع کیا گیا ہو، کیونکہ:\n**إِنَّ الله لا يَأْمُرُ بِالْفَحْشاءِ** (بیشک اللہ بے حیائی کا حکم نہیں دیتا)۔\nپس اس نے پابندی والے لوگوں کے سامنے پردے لٹکا دیے۔ یہ عام لوگوں کے بارے میں اس کا حکم ہے۔\n\nاور جہاں تک خاص لوگوں کا تعلق ہے، تو کہنے والے کا قول ہے:\n\nپس تو ہی قلب کا اس کے غیب کے راز سے پردہ ہے،\nاور اگر تو نہ ہوتا تو اس پر اس کی مہر نہ لگتی۔\n\nپس اس نے تمہیں تمہارے اوپر اپنے پردے (الستر) کی عین حقیقت بنا دیا، اور اگر یہ پردہ نہ ہوتا تو تم اس کے علم میں اضافے کے طالب نہ ہوتے۔ پس تم ہی وہ متکلم اور مخاطب ہو جو اس صورت کے پردے کے پیچھے سے بات کر رہا ہے جس سے اس نے تم سے کلام کیا۔ پس اپنی بشریت میں غور کرو، تم اسے اپنے پردے کی عین حقیقت پاؤ گے جس کے پیچھے سے اس نے تم سے کلام کیا، کیونکہ وہ فرماتا ہے:\n**وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ مِنْ وَرَاءِ حِجَابٍ** (اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے یا پردے کے پیچھے سے)۔\n\nاور کبھی وہ تم سے تمہارے اندر سے کلام کرتا ہے، پس تم اپنی ذات سے اپنے لیے حجاب (حجاب) ہو اور وہ تمہارے اوپر اس کا پردہ (الستر) ہے۔ اور یہ محال ہے کہ تم بشر ہونے کی حالت سے زائل ہو جاؤ، کیونکہ تم اپنی ذات کے اعتبار سے بشر ہو، خواہ تم اپنے آپ سے غائب ہو جاؤ یا کسی عارضی حالت کے ذریعے فنا (الفناء) ہو جاؤ، تمہاری بشریت قائم بالذات ہے۔ پس پردہ (الستر) لٹکا ہوا ہے، لہٰذا آنکھ صرف پردے پر ہی پڑتی ہے، کیونکہ وہ صرف صورت پر ہی پڑتی ہے۔\n\nاور یہ اس لیے ہے جو الوہیت غیرت (الغيرة) اور رحمت (الرحمۃ) کا تقاضا کرتی ہے۔ جہاں تک غیرت (الغيرة) کا تعلق ہے، تو وہ غیرت کرتا ہے کہ کوئی دوسرا اسے پا لے، اور وہ اس کے احاطے میں آ جائے جس نے اسے پایا، حالانکہ وہ:\n**بِكُلِّ شَيْ‏ءٍ مُحِيطٌ** (ہر چیز کا احاطہ کرنے والا ہے)۔\nاور جس کا احاطہ کیا جائے وہ اس کا احاطہ کرنے والے کا احاطہ نہیں کر سکتا۔\nاور جہاں تک رحمت (الرحمۃ) کا تعلق ہے، تو اس نے جان لیا کہ مخلوقات اس کے چہرے کی تابناکیوں (سبحات الوجهية) کے سامنے باقی نہیں رہ سکتیں، بلکہ وہ ان سے جل جائیں گی۔ پس اس نے ان پر پردہ (الستر) ڈالا، یہ ان پر رحمت ہے تاکہ ان کی ذاتیں باقی رہیں۔\n\nپھر اللہ تعالیٰ نے جہانوں کے لیے ان کے اعمال کے نتائج کے پردے بھی لٹکا دیے، اپنے اس قول کے ذریعے کہ اگر کوئی شخص فلاں عمل کرے گا تو اس کے عامل کے لیے فلاں نتیجہ نکلے گا۔ پس عامل اس نتیجے پر ٹھہر جاتا ہے، اگر وہ اہل خصوص (الخاصۃ) میں سے ہو تو اس میں رغبت نہیں رکھتا۔ اور جو اس میں رغبت رکھتا ہے، وہ صرف اس لیے رغبت رکھتا ہے تاکہ اس کے ذریعے اور اس کے شہود (الشہود) کے ذریعے اپنے اس عمل کو درست کر لے جس کا اس کے آقا نے اسے مکلف بنایا ہے۔ لیکن عام لوگ تو اس (نتیجے) میں رغبت رکھتے ہیں اور اس سے عشق کرتے ہیں۔ جب اللہ نے ایسی نشانیاں مقرر کر دیں جو عاملین میں اعمال کی صحت پر دلالت کرتی ہیں، تو خاص لوگوں نے اعمال کے نتائج کے مشاہدے میں رغبت کی تاکہ وہ اپنے معاملات میں بصیرت پر ہوں، کیونکہ ان کا مطلوب اور ان کی فکر ان حقوق کو ادا کرنا تھا جن پر اللہ نے انہیں گواہ بنایا تھا، اور حقوق ان اعمال کے سوا کچھ نہیں جن کا انہیں مکلف بنایا گیا۔\n\nاور کبھی پردہ (الستر) آنکھ کے نفوذ اور اس کے لگ جانے کے خوف سے بھی لٹکایا جاتا ہے۔ اور اس میں وہ حجابات لٹکانا بھی شامل ہے جو ممکنات کی ذاتوں کو جلانے والی سبحاتِ وجہ (السبحات الوجهية) کی وجہ سے ہوتے ہیں۔ اور بعض لوگوں کے حق میں جنہیں اللہ کے علم میں وہ مقام حاصل نہیں، وہ یہ نہیں جانتے کہ اللہ کے لیے ہر سانس میں ایک ایسا ظہور الٰہی (التجلی) ہوتا ہے جو پہلے ظہور الٰہی (التجلی) کی صورت پر نہیں ہوتا۔\n\nجب ان سے یہ ادراک غائب ہو جاتا ہے، تو بسا اوقات وہ ایک ہی ظہور الٰہی (التجلی) کو لازم پکڑ لیتے ہیں اور ان کا شہود (الشہود) اس پر قائم رہتا ہے، اور طبیعت اپنی حقیقت کے ساتھ اس کا تقاضا کرتی ہے، تو انہیں اکتاہٹ (الملل) آ لیتی ہے۔ اور اس مقام پر اکتاہٹ (الملل) جنابِ الٰہی کے ساتھ عدم احترام ہے۔ کیونکہ وہ ہر سانس کے ساتھ:\n**فِي لَبْسٍ مِنْ خَلْقٍ جَدِيدٍ** (نئی تخلیق کے التباس میں)\nہوتے ہیں، اور وہ یہ خیال کرتے ہیں کہ معاملہ تبدیل نہیں ہوا۔\n\nپس پردہ (الستر) اس اکتاہٹ (الملل) کی وجہ سے لٹکایا گیا جو عدم احترام کی طرف لے جاتی ہے، کیونکہ اللہ نے انہیں اپنے اور اللہ کے علم سے محروم رکھا ہے۔ پس وہ یہ خیال کرتے ہیں کہ وہ ہر سانس میں وہی ہیں، اور وہ اپنی جوہریت کے لحاظ سے وہی ہیں نہ کہ ان صفات کے لحاظ سے جن سے وہ متصف ہوتے ہیں۔ اور یہ مت کہو کہ معاملہ ایسا نہیں ہے، یہ ان الٰہی رازوں میں سے ہے جن کے ادراک سے اللہ نے اہل اللہ میں سے کشف (الکشف) کی فتوحات کے مالک بہت سے لوگوں کو بھی پردے میں رکھا ہے، تو دوسروں کا اس میں کیا حال ہو گا! پس پردہ (الستر) ناگزیر ہے، کیونکہ تمہارا ہونا ناگزیر ہے۔ پس سمجھو۔ اور اللہ:\n**يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و پنجاه و چهارم در معرفت ستر (پوشش/حجاب)، و آن چیزی است که تو را از آنچه فانی‌ات می‌سازد، می‌پوشاند.\n\nبه خدا سوگند، پرده‌ها و پوشش‌ها آویخته نمی‌شوند،\nمگر به خاطر آنچه که دیدگان به آن دست می‌یابند.\n\nو گاهی این پوشش از بیم نگریستن به آن است،\nیا به خاطر آنچه طبع و ملالت (خستگی) اقتضا می‌کند.\n\nاگر بنگری به آنچه از عبرت در خود دارد،\nاغراض و ملالت‌ها بر اساس آن بنا شده‌اند.\n\nاگر پرده‌هایی که گنجینه‌های پنهانش را مخفی می‌کنند، نبودند،\nدانسته نمی‌شد که آیا برای من در آن چیزی هست یا امیدی.\n\nبه خدا سوگند، پرده‌ها و پوشش‌ها فرستاده نمی‌شوند،\nمگر برای امری بزرگ که اهمیتش عظیم است.\n\n### [ستر (پوشش)، پوشش هستی (الکون)، و توقف در کنار عادات و نتایج اعمال]\n\nستر (پوشش)، پوشش هستی (الکون) و توقف در کنار عادات و نتایج اعمال است. و ما به تو آگاهانده‌ایم که اسباب، حجاب‌های الهی هستند که برطرف کردنشان جز به واسطه خودشان صحیح نیست؛ پس عین برطرف کردنشان، سد کردن آنهاست، و حقیقت محو کردنشان، اثبات آنهاست. و ستر، رحمتی عام و الهی در حق عموم مردم است، به دلیل مخالفت با اوامر او که بر آنان مقدر شده است؛ پس ناگزیر باید آن را انجام دهند. و با وجود کشف (الکشف) و تجلی (التجلی)، هرگز آن مخالفت رخ نمی‌دهد؛ پس ستر ضروری است. به همین دلیل، از اهل تجلی (التجلی) علمی، منع و حجر برداشته شده است، و در حق آنان منعی باقی نمانده، بلکه آنچه در تصرفاتشان بخواهند، برایشان مباح شده است.\n\nدر خبر صحیح آمده است که خداوند به کسی که گناه کرده و دانسته است که پروردگاری دارد که گناه را می‌آمرزد و به گناه مؤاخذه می‌کند، می‌فرماید: «هر چه می‌خواهی انجام بده، که تو را آمرزیدم.»\n\nپس برای کسی که این صفت اوست، آنچه را که بر دیگران منع کرده بود، مباح ساخت. و محال است که او را به انجام کاری امر کند که انجامش را منع کرده است، زیرا: **إِنَّ الله لا يَأْمُرُ بِالْفَحْشاءِ** (همانا خداوند به کار زشت فرمان نمی‌دهد). پس پرده‌ها را در برابر اهل منع آویخت. این حکم او در مورد عموم است. و اما در مورد خواص، سخن گوینده این است:\n\nتویی حجاب قلب از راز غیب او،\nو اگر تو نبودی، مهرش بر آن زده نمی‌شد.\n\nپس تو را عین ستر (پوشش) خود بر تو قرار داد، و اگر این ستر نبود، تو طلب فزونی علم به او نمی‌کردی. پس تویی که از پشت پرده صورتی که خداوند از آن با تو سخن گفت، متکلم و مخاطب هستی. پس در بشریت خود بنگر، آن را عین ستر خود می‌یابی که خداوند از ورای آن با تو سخن گفت. زیرا او می‌فرماید: **وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ** (و هیچ بشری را نسزد که خدا با او سخن گوید، مگر به وحی یا از پس پرده‌ای). و گاهی از خودت با تو سخن می‌گوید؛ پس تو حجاب نفس خود از خودت و ستر او بر خودت هستی. و محال است که از بشر بودن خود زایل شوی، زیرا تو ذاتاً بشر هستی، و حتی اگر از خود غایب شوی یا به حالتی که بر تو عارض می‌شود، فانی (الفناء) گردی، بشریت تو به عین خود پابرجاست. پس ستر آویخته است و چشم جز بر ستر نمی‌افتد، زیرا جز بر صورت نمی‌افتد. و این به دلیل غیرت و رحمتی است که الوهیت اقتضا می‌کند. اما غیرت: او غیرت می‌ورزد که دیگری او را درک کند و در نتیجه، او محاطِ کسی شود که او را درک کرده است، در حالی که او **بِكُلِّ شَيْ‏ءٍ مُحِيطٌ** (بر هر چیزی احاطه دارد) و محاط نمی‌تواند محیط بر کسی باشد که او را احاطه کرده است. و اما رحمت: او می‌دانست که ممکنات (محدثات) در برابر سبحات (انوار جلال) وجه او باقی نمی‌مانند، بلکه در اثر آن می‌سوزند؛ پس آنان را از روی رحمت پوشاند تا عینشان باقی بماند. سپس خداوند همچنین برای جهانیان، پرده‌های نتایج اعمالشان را آویخت، با این سخن که اگر فلان عمل انجام شود، نتیجه‌اش برای عامل چنین خواهد بود. پس عامل در کنار نتیجه می‌ایستد، نه از روی رغبت به آن، اگر از اهل خصوص باشد. بلکه کسی که به آن رغبت می‌ورزد، برای آن است که عمل خود را که مولایش او را بدان مکلف کرده است، به واسطه آن نتیجه و شهود (الشهود) آن تصحیح کند. اما عموم مردم، به دلیل رغبت و عشقشان به آن نتایج است. پس چون خداوند نشانه‌هایی قرار داد که بر صحت اعمال در عاملان دلالت می‌کند، خواص به مشاهده نتایج اعمال رغبت یافتند تا در امور خود بر بصیرت باشند، زیرا مطلوب و همّ آنان، انجام حقوقی بود که خداوند آنان را بر آن شاهد گردانیده بود، و حقوق چیزی جز اعمالی نیستند که به آن مکلف شده‌اند. و گاهی ستر از ترس نفوذ چشم و آسیب رساندن آن آویخته می‌شود، و در این مورد، آویختن حجاب‌ها به خاطر سبحات وجهی (انوار جلال) که اعیان ممکنات را می‌سوزاند، داخل می‌شود.\n\nو اما در حق برخی از مردم که آن قدم راسخ را در علم به خداوند ندارند، نمی‌دانند که خداوند در هر نفسی تجلی (التجلی) دارد که بر صورت تجلی اول نیست. پس چون این ادراک از آنان غایب شد، چه بسا تجلی‌ای را همراه خود بدارند و شهود (الشهود) بر آن ادامه یابد، و طبع، آن را به حقیقتش طلب کند، و در نتیجه ملالت (خستگی) به او دست دهد. و ملالت در این مقام، به معنای عدم احترام به ساحت الهی است، زیرا آنان در **لَبْسٍ من خَلْقٍ جَدِيدٍ** (در پوششی از آفرینشی نو) با هر نفس هستند، در حالی که گمان می‌کنند که امر تغییر نکرده است. پس ستر به خاطر ملالتی آویخته شد که به عدم احترام می‌انجامد، زیرا خداوند آنان را از علم به خودشان و به خداوند محروم کرده است. پس آنان گمان می‌کنند که در هر نفس، خودشان هستند و از حیث جوهریتشان همان هستند، نه از حیث آنچه بدان متصف می‌شوند. و مگو که امر چنین نیست؛ این از اسرار الهی است که خداوند بسیاری از اهل الله، یعنی صاحبان فتوحات مکاشفه (الکشف)، را از درک آن محجوب داشته است، پس حال دیگران در این باره چگونه خواهد بود؟ پس ستر ضروری است، زیرا وجود تو ضروری است. پس بفهم. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}