{
  "id": 204,
  "title": {
    "ar": "الباب الرابع ومائتان في التحلي بالحاء المهملة",
    "en": "Chapter Two Hundred and Four, Concerning the Spiritual Adornment (التحلي) through the Undotted Letter Ḥā' (ح).",
    "ur": "باب نمبر دو سو چار: حاء مہملہ (ح) کے ساتھ آراستہ ہونے کے بیان میں۔",
    "fa": "باب دویست و چهارم در آراسته شدن به حرف حاء (ح) مهمله."
  },
  "content": {
    "ar": "## «الباب الرابع ومائتان في التحلي بالحاء المهملة»\n\n\n> لو لا التحلي لما كنا بحضرته *** مستخلفين على نور بأنبائه‏\n\n\n> إن التخلق بالأسماء حلية من *** صافي المسمى فصافاه بأسمائه‏\n\n\n> كمثل طيفور إذ صحت خلافته *** والأمر جاء بها في عين إنبائه‏\n\n\n> نفاه مملوكه سبعا لمصلحة *** عادت عليه وهذا من أشيائه‏\n\n\n> فإنه سأل الرحمن ما وقعت *** به الأمور على ترتيب نعمائه‏\n\n\n> فالله يرزقني صدقا ويفتح لي *** بابا ويمنحني شكر آلائه‏\n\n\n### [التحلي التشبه بأحوال الصادقين في أقوالهم وأفعالهم‏]\n\n\nاعلم أن التحلي بالحاء المهملة في اصطلاح الطائفة التشبه بأحوال الصادقين في أقوالهم وأفعالهم وهذا في الطريق عندنا مدخول ومن أسماء الله الصادق وأن الصادقين من أحوالهم التحلي بالحاء المهملة فلا بد من معرفة ما يتحلى به فهل تحلوا بما هو لغيرهم فتزينوا بما ليس لهم فهم لابسو أثواب زور أو تحلوا بما هو لهم فهم صادقون والتحلي عندنا هو التزين بالأسماء الإلهية على الحد المشروع بحيث أن يعسر التمييز وهم الذين إذا رؤوا ذكر الله كعرش بلقيس لما قامت لها شبهة بعد المسافة فقالت كَأَنَّهُ هُوَ ولو شاهدت الاقتدار الإلهي لعلمت أنه هو كما كان هو من غير زيادة وإذا حصل الإنسان في هذا المقام بهذا التحلي ولم يحجبه هذا التحلي في حال تزينه به وأنه له حقيقة ما استعاره بل ذلك ملكه وما له ولا منعه عن شهود عبوديته لربه وإن نسبة ما ظهر به مما هو نعت لخالقه ما كان تشبها وإنما كان تزينا فذلك التحلي ويقول الحكماء في هذه الحالة إنه التشبه بالإله جهد الطاقة وهذا القول إذا حققته جهل من قائله لأن التشبه في نفس الأمر لا يصح فمن قامت به صفة فهي له وهو مستعد لقيامها به فباستعداد ذاته اقتضاها فما تشبه أحد بأحد بل الصفة في كل واحد كما هي في الآخر وإنما حجب الناس التقدم والتأخر وكون الصورة واحدة فلما رأوها في المتقدم ثم رأوها في المتأخر قالوا إن المتأخر تشبه بالمتقدم في هذه الصورة وما علموا أن حقيقتها في المتأخر حقيقتها في المتقدم ولو كان الأمر كما قالوه لزاحمت العبودية الربوبية ولبطلت الحقائق فما تحلى العبد إلا بما هو له ولا ظهر الحق إلا بما هو له لا من صفات التنزيه ولا من صفات التشبيه كل ذلك له ولو لم يكن الأمر كذلك لكان ما وصف نفسه به من ذلك كذبا وتعالى الله بل هو كما وصف نفسه من العزة والكبرياء والجبروت والعظمة ونفي المماثلة كما وصف نفسه بالنسيان والمكر والخداع والكيد\nوالفرح والمعية وغير ذلك فالكل صفة كمال لله تعالى فهو موصوف بها كما تقتضيه ذاته وأنت موصوف بها كما تقتضيها\n\n\n> ذاتك والعين واحدة والحكم مختلف *** والعبد يعبد والرحمن معبود\n\n\nفليس التحلي في الحقيقة تشبه فإنه محال في نفس الأمر وما قال به إلا من لا معرفة له بالحقائق وكذلك كنا لَوْ لا أَنْ من الله عَلَيْنا فتعين علينا أن نبين للخلق ما بينه الحق لنا هكذا أخذ العهد علينا فيما يجوز لنا الإبانة عنه والإفصاح به وأما ما أخذ الله علينا العهد على كتمانه فنشاهده من الخلق ولا نخبرهم بما هو فهم بحكم ما يتخيلون ونحن بحكم ما نعلم ولو عرفناهم بذلك ما قبلوا لأن استعدادهم لا يعطي القبول كما قال ولَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وهُمْ مُعْرِضُونَ فما حجبناه عنهم إلا رحمة بهم فإن الله سبحانه لم يترك منفعة لعباده إلا وقد أبانها لهم واختلف استعدادهم في القبول وما أبان الله عن نفسه بما أبان مما وصف به نفسه مما تنزهه عنه العقول بأدلتها إلا ليعلم أنه ما ثم شي‏ء من الموجودات ولا عين خارج عنه بل كل صفة تظهر في العالم لها عين في جناب الحق والكل مرتبط به وكيف لا يرتبط به وهو ربه وموجدة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n( «بسم الله الرحمن الرحيم»)\n\n",
    "en": "Chapter Two Hundred and Four: Concerning Adornment (al-Tahallī) with the Unmarked Hā'\n\nWere it not for the Adornment (al-Tahallī), we would not be in His Presence,\nMade vicegerents over the light of His revelations.\n\nIndeed, assuming the character of the Names (al-Takhalluq bi al-Asmā') is an embellishment\nFrom the Pure Named One, who purified him through His Names.\n\nLike Tayfur, when his vicegerency was confirmed,\nAnd the command came concerning it in the very essence of his revelation.\n\nHis own subjects exiled him seven times for a benefit\nThat returned to him, and this is among his affairs.\n\nFor he asked the All-Merciful concerning the arrangement\nOf His blessings by which these matters occurred.\n\nMay Allah grant me sincerity, open a door for me,\nAnd bestow upon me gratitude for His bounties.\n\n### [Al-Tahallī (Adornment) is the imitation of the states of the truthful ones in their sayings and actions.]\n\nKnow that *al-tahallī* (Adornment) with the unmarked Hā' (ح) in the terminology of the Sufi community (الطائفة) is the imitation of the states of the truthful ones (الصادقين) in their sayings and actions. This, in our Path, is flawed. Among the Names of Allah is The Truthful (al-Ṣādiq), and among the states of the truthful ones is *al-tahallī* with the unmarked Hā'. Thus, it is necessary to know what one is adorned with. Did they adorn themselves with what belongs to others, thus embellishing themselves with what is not theirs, making them wearers of false garments? Or did they adorn themselves with what is truly theirs, making them truthful?\n\n*Al-Tahallī* (Adornment), according to us, is the embellishment with the Divine Names (الأسماء الإلهية) according to the prescribed limit, such that distinction becomes difficult. These are the ones who, when seen, remind one of Allah, like the throne of Bilqis, when the distance caused her doubt, and she said, <<كَأَنَّهُ هُوَ>> (It seems to be it). Had she witnessed the Divine Power (الاقتدار الإلهي), she would have known that it was indeed it, just as it was, without addition.\n\nWhen a person attains this station through this Adornment (al-tahallī), and this Adornment does not veil him while he is embellished by it—knowing that it is truly his and not borrowed, but rather his possession and property—and it does not prevent him from witnessing his servitude (عبوديته) to his Lord, and knowing that the attribution of what appears through him, which is an attribute of his Creator, is not imitation (تشبها) but rather embellishment (تزينا)—that is the true Adornment.\n\nThe philosophers (الحكماء) say concerning this state that it is \"imitation of the Divine to the utmost capacity.\" If you examine this statement, you will find ignorance on the part of its speaker, because imitation (التشبه) in reality (في نفس الأمر) is not valid. For whoever possesses an attribute, that attribute belongs to him, and he is prepared for its subsistence within him. By the preparedness of his Essence (ذاته), he necessitated it. No one imitates anyone else; rather, the attribute in each individual is as it is in the other.\n\nWhat veils people is the notion of precedence and subsequence, and the fact that the form is one. When they see it in the predecessor and then see it in the successor, they say that the successor imitated the predecessor in this form. They do not know that the reality of that attribute in the successor is the same as its reality in the predecessor. If the matter were as they claimed, servitude (العبودية) would compete with Lordship (الربوبية), and the Realities (الحقائق) would be invalidated.\n\nTherefore, the servant is only adorned with what belongs to him, and The Real (الحق) only manifests through what belongs to Him, neither from the attributes of Transcendence (التنزيه) nor from the attributes of Analogy (التشبيه); all of that belongs to Him. If the matter were not so, then what He described Himself with would be a lie—and exalted is Allah far above that! Rather, He is as He described Himself: possessing Might (العزة), Grandeur (الكبرياء), Omnipotence (الجبروت), and Magnificence (العظمة), and negating similitude; just as He described Himself with forgetfulness, cunning, deception, plotting, joy, companionship (المعية), and other such qualities. All of this is an attribute of perfection for Allah the Exalted, and He is described by it as His Essence necessitates, and you are described by it as your essence necessitates.\n\nYour essence and the Reality (العين) are one, but the ruling (الحكم) is different;\nThe servant worships, and the All-Merciful is worshipped.\n\nThus, *al-tahallī* is not truly imitation, for imitation is impossible in reality, and only those who lack Gnosis (المعرفة) of the Realities (الحقائق) assert it. And thus we were, <<لَوْ لا أَنْ مَنَّ اللهُ عَلَيْنَا>> (Had Allah not conferred favor upon us), so it became incumbent upon us to clarify for creation what The Real clarified for us. This is the covenant taken upon us regarding what we are permitted to disclose and express.\n\nAs for that which Allah took a covenant upon us to conceal, we witness it in creation but do not inform them of what it truly is. They operate according to what they imagine, and we operate according to what we know. If we were to inform them of that, they would not accept it, because their preparedness (استعدادهم) does not grant acceptance, as He said: <<وَلَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وَهُمْ مُعْرِضُونَ>> (And if He had made them hear, they would surely have turned away, while they were refusing).\n\nWe only conceal it from them out of mercy for them, for Allah, the Glorious, has not left any benefit for His servants without having clarified it for them, though their preparedness for acceptance differs. Allah only disclosed concerning Himself what He disclosed—describing Himself with attributes that intellects (العقول) declare transcendent based on their proofs—so that it may be known that there is nothing among the existents (الموجودات) or any entity (عين) outside of Him. Rather, every attribute that appears in the world (العالم) has an entity in the Divine Presence (جناب الحق), and all are connected to Him. How could they not be connected to Him when He is their Lord and Originator? <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)",
    "ur": "باب نمبر دو سو چار: حائے مہملہ کے ساتھ تحلی (التحلی) کے بیان میں\n\nاگر تحلی (التحلی) نہ ہوتا تو ہم اس کی بارگاہ میں نہ ہوتے،\nاس کے انوار کے ذریعے خلیفہ بنائے گئے ہوتے۔\n\nبے شک اسماء کے ساتھ متخلق ہونا (اخلاق اپنانا) مسمیٰ کی پاکیزگی سے ایک زیور ہے،\nپس اس نے اسے اپنے اسماء کے ذریعے پاکیزہ کیا۔\n\nجیسے طیفور (ابو یزید بسطامی) جب اس کی خلافت صحیح ثابت ہوئی،\nاور حکم اس کے انوار کے عین میں آیا۔\n\nاس کے غلام نے اسے سات بار مصلحت کی خاطر نکال دیا،\nجو مصلحت اس پر لوٹ آئی، اور یہ اس کے معاملات میں سے ہے۔\n\nکیونکہ اس نے رحمن سے وہ چیز مانگی جس کے ذریعے\nمعاملات اس کی نعمتوں کی ترتیب پر واقع ہوئے۔\n\nپس اللہ مجھے سچائی عطا کرے، اور میرے لیے ایک دروازہ کھولے،\nاور مجھے اپنی نعمتوں کا شکر عطا کرے۔\n\n[تحلی (التحلی) صادقین (الصادقین) کے اقوال و افعال میں ان کے احوال (احوال) سے مشابہت اختیار کرنا ہے]\n\nجان لو کہ طائفہ (صوفیاء) کی اصطلاح میں حائے مہملہ کے ساتھ تحلی (التحلی) صادقین (الصادقین) کے اقوال اور افعال میں ان کے احوال (احوال) سے مشابہت اختیار کرنا ہے۔ اور ہمارے نزدیک یہ طریقہ ناقص ہے۔ اور اللہ کے اسماء میں سے ایک الصادق (سچا) ہے۔ اور صادقین (الصادقین) کے احوال (احوال) میں سے حائے مہملہ کے ساتھ تحلی (التحلی) ہے۔ لہٰذا یہ جاننا ضروری ہے کہ وہ کس چیز سے تحلی (التحلی) کرتے ہیں؟ کیا انہوں نے اس چیز سے تحلی (التحلی) کی جو دوسروں کی تھی، پس انہوں نے اس چیز سے زینت اختیار کی جو ان کی نہیں تھی؟ تو وہ جھوٹے لباس پہننے والے ہیں، یا انہوں نے اس چیز سے تحلی (التحلی) کی جو ان کی اپنی تھی؟ تو وہ صادق (سچے) ہیں۔\n\nاور ہمارے نزدیک تحلی (التحلی) اسماء الٰہیہ (الأسماء الإلهية) کے ساتھ مشروع حد پر زینت اختیار کرنا ہے، اس طرح کہ تمییز (التمییز) کرنا مشکل ہو جائے۔ اور یہ وہ لوگ ہیں جنہیں جب دیکھا جائے تو اللہ یاد آ جائے۔ جیسے بلقیس کا تخت، جب اسے دوری کی وجہ سے شبہ ہوا تو اس نے کہا: **\"گویا کہ یہ وہی ہے\"** (النمل: ۴۲)۔ اور اگر وہ اقتدار الٰہی کا شہود (الشہود) کرتی تو جان لیتی کہ یہ وہی ہے، جیسا کہ وہ تھا، بغیر کسی اضافے کے۔ اور جب انسان اس تحلی (التحلی) کے ساتھ اس مقام پر فائز ہو جائے، اور یہ تحلی (التحلی) اسے اس کے زینت اختیار کرنے کی حالت میں حجاب میں نہ ڈالے، اور یہ کہ یہ حقیقت میں اس کا اپنا ہے، مستعار نہیں، بلکہ یہ اس کی ملکیت ہے اور اس کا حق ہے، اور یہ اسے اپنے رب کی عبودیت (العبودیۃ) کے شہود (الشہود) سے نہ روکے، اور یہ کہ جو کچھ اس میں ظاہر ہوا ہے، جو اس کے خالق کی صفت ہے، اس کی نسبت تشبہ (التشبه) نہیں ہے، بلکہ صرف زینت ہے، تو یہی تحلی (التحلی) ہے۔\n\nاور حکماء اس حالت میں کہتے ہیں کہ یہ طاقت بھر الٰہ سے تشبہ (التشبه) اختیار کرنا ہے۔ اور جب تم اس قول کی تحقیق کرو گے تو یہ کہنے والے کی طرف سے جہالت ہے۔ کیونکہ نفسِ امر میں تشبہ (التشبه) صحیح نہیں ہے۔ پس جس میں کوئی صفت قائم ہو جائے تو وہ اسی کی ہے، اور وہ اس کے قائم ہونے کے لیے مستعد (تیار) ہے۔ پس اس نے اپنی ذات (الذات) کے استعداد (الاستعداد) سے اسے طلب کیا۔ لہٰذا کسی نے کسی سے تشبہ (التشبه) اختیار نہیں کیا، بلکہ صفت ہر ایک میں ویسی ہی ہے جیسی دوسرے میں ہے۔ اور لوگوں کو صرف تقدم اور تاخر نے حجاب میں ڈالا، اور یہ کہ صورت ایک ہے۔ پس جب انہوں نے اسے متقدم (پہلے والے) میں دیکھا، پھر متاخر (بعد والے) میں دیکھا، تو کہا کہ متاخر نے اس صورت میں متقدم سے تشبہ (التشبه) اختیار کیا۔ حالانکہ وہ نہیں جانتے کہ متاخر میں اس کی حقیقت وہی ہے جو متقدم میں اس کی حقیقت ہے۔ اور اگر معاملہ ایسا ہوتا جیسا کہ انہوں نے کہا، تو عبودیت (العبودیۃ) ربوبیت (الربوبیۃ) سے ٹکرا جاتی، اور حقائق (الحقائق) باطل ہو جاتے۔ پس بندے نے تحلی (التحلی) نہیں کی مگر اسی چیز سے جو اس کی اپنی ہے، اور حق (الحق) ظاہر نہیں ہوا مگر اسی چیز سے جو اس کی اپنی ہے، نہ صفات تنزیہ میں سے اور نہ صفات تشبیہ میں سے۔ یہ سب کچھ اسی کا ہے۔ اور اگر معاملہ ایسا نہ ہوتا تو جو کچھ اس نے اپنے بارے میں بیان کیا وہ جھوٹ ہوتا، اور اللہ اس سے پاک ہے۔ بلکہ وہ ویسا ہی ہے جیسا کہ اس نے خود کو عزت، کبریائی، جبروت، عظمت اور نفی مماثلت سے موصوف کیا، جیسا کہ اس نے خود کو نسیان (بھول)، مکر، دھوکہ، کید (چال)، فرحت اور معیت (ساتھ ہونا) وغیرہ سے موصوف کیا۔ پس یہ سب اللہ تعالیٰ کے لیے صفت کمال ہیں، پس وہ ان سے موصوف ہے جیسا کہ اس کی ذات (الذات) کا تقاضا ہے۔ اور تم ان سے موصوف ہو جیسا کہ تمہاری ذات (الذات) کا تقاضا ہے۔\n\nتمہاری ذات (الذات) اور عین ایک ہے، لیکن حکم مختلف ہے،\nاور بندہ عبادت کرتا ہے اور رحمن معبود ہے۔\n\nپس حقیقت میں تحلی (التحلی) تشبہ (التشبه) نہیں ہے، کیونکہ یہ نفسِ امر میں محال ہے۔ اور یہ بات صرف اسی نے کہی جسے حقائق (الحقائق) کی معرفت (المعرفۃ) نہیں ہے۔ اور ہم بھی ایسے ہی ہوتے اگر اللہ ہم پر احسان نہ کرتا۔ پس ہم پر لازم ہے کہ ہم مخلوق کے لیے وہ بیان کریں جو حق (الحق) نے ہمارے لیے بیان کیا۔ ہم سے اسی طرح عہد لیا گیا ہے کہ ہم ان چیزوں کو ظاہر کریں اور کھول کر بیان کریں جن کی ہمیں اجازت ہے۔ اور رہا وہ جس کے چھپانے کا اللہ نے ہم سے عہد لیا ہے، تو ہم اسے مخلوق میں دیکھتے ہیں لیکن انہیں نہیں بتاتے کہ وہ کیا ہے۔ پس وہ اس حکم کے تحت ہیں جس کا وہ گمان کرتے ہیں، اور ہم اس حکم کے تحت ہیں جسے ہم جانتے ہیں۔ اور اگر ہم انہیں اس سے آگاہ کرتے تو وہ قبول نہ کرتے، کیونکہ ان کا استعداد (الاستعداد) قبولیت نہیں دیتا، جیسا کہ فرمایا: **\"اور اگر وہ انہیں سناتا تو وہ منہ پھیر کر بھاگ جاتے\"** (الکہف: ۵۷)۔ پس ہم نے اسے ان سے صرف ان پر رحم کرتے ہوئے چھپایا ہے۔ کیونکہ اللہ سبحانہ نے اپنے بندوں کے لیے کوئی فائدہ نہیں چھوڑا مگر اسے ان کے لیے بیان کر دیا، البتہ قبول کرنے میں ان کا استعداد (الاستعداد) مختلف ہے۔ اور اللہ نے اپنے بارے میں جو کچھ بیان کیا، ان صفات کے ذریعے جن سے عقلیں اپنے دلائل کی بنا پر اسے پاک قرار دیتی ہیں، وہ صرف اس لیے ہے تاکہ یہ معلوم ہو جائے کہ موجودات میں کوئی چیز یا کوئی عین اس سے باہر نہیں ہے، بلکہ عالم میں ظاہر ہونے والی ہر صفت کی جنابِ حق (الحق) میں ایک عین ہے۔ اور سب اس سے مربوط ہیں۔ اور وہ اس سے کیوں نہ مربوط ہو جبکہ وہ اس کا رب اور اسے وجود دینے والا ہے؟ **\"اور اللہ حق (الحق) فرماتا ہے اور وہی راہ دکھاتا ہے\"** (الاحزاب: ۴)۔\n\n(شروع اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے)",
    "fa": "باب دویست و چهارم در تحلی (التحلي) با حاء بی‌نقطه\n\nاگر تحلی (التحلي) نبود، ما در محضر او *** جانشینان بر نور اخبار او نبودیم.\nهمانا تخلق به اسماء، زیوری است از *** مسمای پاک، پس او را با اسماء خود پاک گردانید.\nمانند طیفور (بایزید بسطامی) هنگامی که خلافتش صحیح شد *** و امر در عین خبر دادن از آن آمد.\nمملوکش او را هفت بار به خاطر مصلحتی تبعید کرد *** که به خودش بازگشت، و این از امور اوست.\nزیرا او از رحمان خواست که امور *** بر ترتیب نعمت‌هایش واقع نشود.\nپس خداوند به من صدق روزی دهد و دری برایم بگشاید *** و شکر نعمت‌هایش را به من عطا کند.\n\n[تحلی (التحلي) شبیه شدن به احوال صادقان در گفتار و کردارشان است]\n\nبدان که تحلی (التحلي) با حاء بی‌نقطه در اصطلاح این طایفه، شبیه شدن به احوال صادقان (الصادقين) در گفتار و کردارشان است. و این در طریقت ما دارای اشکال است. و از اسماء خداوند، الصادق (راستگو) است، و از احوال صادقان (الصادقين) تحلی (التحلي) با حاء بی‌نقطه است. پس ناگزیر باید دانست که به چه چیزی تحلی (التحلي) حاصل می‌شود؟ آیا به آنچه متعلق به غیر آنهاست تحلی یافته‌اند و به آنچه از آنِ ایشان نیست زینت گرفته‌اند، پس جامه‌های دروغ پوشیده‌اند؟ یا به آنچه متعلق به خودشان است تحلی یافته‌اند، پس صادق (الصادقون) هستند؟\n\nو تحلی (التحلي) نزد ما، زینت یافتن به اسماء الهی (الأسماء الإلهية) است بر حد مشروع، به گونه‌ای که تمییز دشوار شود. و ایشان کسانی هستند که چون دیده شوند، خداوند یاد می‌شود؛ مانند تخت بلقیس که چون مسافت دور بود، برای او شبهه‌ای پدید آمد و گفت: «كَأَنَّهُ هُوَ» (گویی همان است). و اگر اقتدار الهی را مشاهده می‌کرد، می‌دانست که همان است، همان‌گونه که بود، بدون هیچ افزایشی.\n\nو هنگامی که انسان در این مقام، با این تحلی (التحلي) قرار گیرد و این تحلی در حال زینت یافتن، او را محجوب نسازد و بداند که این حقیقت از آنِ اوست و عاریه نگرفته، بلکه ملک و دارایی اوست، و او را از شهود عبودیتش (العبودية) نسبت به پروردگارش باز ندارد، و اینکه نسبت آنچه از او ظاهر شده و وصف خالق اوست، تشبه (التشبه) نبوده بلکه زینت یافتن (التزين) بوده است؛ این همان تحلی (التحلي) است. و حکما در این حالت می‌گویند که آن، تشبه (التشبه) به الهی است به قدر توان. و این سخن، اگر در آن تحقیق کنی، جهل گوینده آن است؛ زیرا تشبه (التشبه) در نفس امر صحیح نیست.\n\nپس هر کس صفتی در او قائم شود، آن صفت از آنِ اوست و او استعداد قیام آن صفت را دارد. پس به واسطه استعداد ذاتش آن را اقتضا کرده است. بنابراین، هیچ کس به دیگری تشبه (التشبه) نکرده است، بلکه صفت در هر یک همان‌گونه است که در دیگری است. و تنها چیزی که مردم را محجوب کرده، تقدم و تأخر و یکی بودن صورت است. پس چون آن را در متقدم دیدند و سپس در متأخر مشاهده کردند، گفتند که متأخر در این صورت به متقدم تشبه (التشبه) کرده است. و ندانستند که حقیقت آن صفت در متأخر، همان حقیقت آن در متقدم است. و اگر امر چنان بود که می‌گویند، عبودیت (العبودية) با ربوبیت (الربوبية) در تزاحم می‌افتاد و حقایق (الحقائق) باطل می‌شد.\n\nپس بنده تحلی (التحلي) نیافته مگر به آنچه از آنِ اوست، و حق (الحق) ظاهر نشده مگر به آنچه از آنِ اوست؛ نه از صفات تنزیه و نه از صفات تشبیه. همه اینها از آنِ اوست. و اگر امر چنین نبود، آنچه خود را بدان وصف کرده بود، دروغ می‌بود، و خداوند برتر است. بلکه او همان‌گونه است که خود را وصف کرده است؛ از عزت و کبریا و جبروت و عظمت و نفی مماثلت، همان‌گونه که خود را به نسیان و مکر و فریب و کید و شادی و معیت و غیره وصف کرده است. پس همه اینها صفت کمال برای خداوند متعال است، و او بدان‌ها موصوف است چنانکه ذاتش اقتضا می‌کند، و تو بدان‌ها موصوف هستی چنانکه اقتضا می‌کند...\n\nذات تو، و عین یکی است و حکم متفاوت *** و بنده عبادت می‌کند و رحمان معبود است.\n\nپس تحلی (التحلي) در حقیقت تشبه (التشبه) نیست، زیرا در نفس امر محال است، و کسی جز آنکه معرفت (المعرفة) به حقایق (الحقائق) ندارد، بدان قائل نشده است. و ما نیز چنین بودیم، «لَوْ لا أَنْ مَنَّ اللَّهُ عَلَيْنَا» (اگر خداوند بر ما منت نمی‌نهاد). پس بر ما واجب شد که آنچه را حق (الحق) برای ما بیان کرده، برای خلق بیان کنیم. این‌گونه بر ما عهد گرفته شده است در آنچه مجاز به آشکار ساختن و افصاح آن هستیم. اما آنچه خداوند بر کتمانش از ما عهد گرفته، آن را در خلق مشاهده می‌کنیم و ایشان را از آنچه هست خبر نمی‌دهیم. پس ایشان به حکم آنچه تخیل می‌کنند هستند و ما به حکم آنچه می‌دانیم. و اگر ایشان را بدان آگاه می‌ساختیم، نمی‌پذیرفتند، زیرا استعدادشان پذیرش را نمی‌دهد، چنانکه فرمود: «وَلَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وَهُمْ مُعْرِضُونَ» (و اگر به آنان می‌شنواند، پشت می‌کردند در حالی که رویگردان بودند). پس ما آن را از ایشان پنهان نکردیم مگر از روی رحمت به ایشان. زیرا خداوند سبحان هیچ منفعتی را برای بندگانش فرو نگذاشته مگر آنکه آن را برایشان آشکار ساخته است، اما استعداد ایشان در پذیرش متفاوت است. و خداوند از خود آشکار نساخت آنچه را که خود را بدان وصف کرده و عقول با دلایل خود آن را تنزیه می‌کنند، مگر برای آنکه دانسته شود که هیچ شیئی از موجودات و هیچ عین خارج از او نیست، بلکه هر صفتی که در عالم ظاهر می‌شود، عینی در ساحت حق (الحق) دارد و همه به او مرتبط هستند. و چگونه به او مرتبط نباشد در حالی که او پروردگار و ایجادکننده آن است؟ «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را می‌نمایاند).\n\n(به نام خداوند بخشنده مهربان)"
  },
  "page_count": 2
}