{
  "id": 159,
  "title": {
    "ar": "الباب التاسع والخمسون ومائة في مقام الرسالة البشرية",
    "en": "Chapter One Hundred and Fifty-Nine: Concerning the Station (مقام) of Human Apostleship.",
    "ur": "ایک سو انسٹھواں باب: رسالت بشری کا مقام",
    "fa": "باب صد و پنجاه و نهم در مقام رسالت بشریه"
  },
  "content": {
    "ar": "## (الباب التاسع والخمسون ومائة في مقام الرسالة البشرية)\n\n\n> إن الرسول لسان الحق للبشر *** بالأمر والنهي والإعلام والعبر\n\n\n> هم أذكياء ولكن لا يصرفهم *** ذاك الذكاء لما فيه من الغرر\n\n\n> أ لا تراهم لتابير النخيل وما *** قد كان فيه على ما جاء من ضرر\n\n\n> هم سالمون من الأفكار إن شرعوا *** حكما بحل وتحريم على البشر\n> إن الرسالة في الدنيا قد انقطعت *** في وقتنا للذي قد جاء في الخبر\n\n\n> وقد مضى حكمها دنيا وآخرة *** وما لها في وجود العين من أثر\n\n\n> لو لا التكاليف لم يختص صاحبها *** عن غيره لوجود الوحي والنظر\n\n\n> النحل يوحى إليه دائما أبدا *** إلى القيامة في السكنى وفي الثمر\n\n\n### [الرسالة نعت كوني يقبلها الرسول بوساطة روح قدسي‏]\n\n\nالرسالة نعت كوني متوسط بين مرسل ومرسل إليه والمرسل به قد يعبر عنه بالرسالة وقد تكون الرسالة حال الرسول وهي بالجملة ليست بمقام وإنما هي نسبة حال وتنقطع بانقطاع التبليغ بالفعل ويزول حكمها بانقضاء التبليغ قال تعالى ما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ وأوجب عليه ذلك فقال يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ وإِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ فالرسالة هنا هي التي أرسل بها وبلغها وهكذا وردت في القرآن حيثما وردت ولا يقبلها الرسول إلا بوساطة روح قدسي أمين ينزل بالرسالة على قلبه وأحيانا يتمثل له الملك رجلا وكل وحي لا يكون بهذه الصفة لا يسمى رسالة بشرية وإنما يسمى وحيا أو إلهاما أو نفثا أو إلقاء أو وجودا ولا تكون الرسالة إلا كما ذكرنا ولا يكون هذا الوصف إلا للرسول البشري وما عدا هذا من ضروب الوحي فإنه يكون لغير النبي والرسول‏\n\n\n### [الفرق بين النبي والرسول‏]\n\n\nوالفرق بين النبي والرسول أن النبي إذا ألقى إليه الروح ما ذكرناه اقتصر بذلك الحكم على نفسه خاصة ويحرم عليه أن يتبع غيره فهذا هو النبي فإذا قيل له بلغ ما أنزل إليك إما لطائفة مخصوصة كسائر الأنبياء وإما عامة للناس ولم يكن ذلك إلا لمحمد صَلَّى اللهُ عَليهِ وسَلَّم لم يكن لغيره قبله فسمى بهذا الوجه رسولا والذي جاء به رسالة وما اختص به من الحكم في نفسه وحرم على غيره من ذلك الحكم هو نبي مع كونه رسولا وإن لم يخص في نفسه بحكم لا يكون لمن بعث إليهم فهو رسول لا نبي وأعني نبوة الشرائع التي ليست للأولياء فكل رسول لم يخص بشي‏ء من الحكم في حق نفسه فهو رسول لا نبي وإن خص مع التبليغ\n\n\nفهو رسول ونبي فما كل رسول نبي على ما قلناه ولا كل نبى رسول بلا خلاف‏\n\n\n### [الورثة هم الأتباع الذين أمروا بالتبليغ عن الرسول‏]\n\n\nثم إن الورثة وهم الأتباع الذين أمروا بالتبليغ كمعاذ وعلي ودحية رسل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ولا يزال كل متأخر مأمورا بالتبليغ ممن أمر بالتبليغ متصل الطريق مأمورا عن مأمور إلى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يسمى رسولا ولكن ما هي الرسالة التي انقطعت والرسالة التي انقطعت هي تنزل الحكم الإلهي على قلب البشر بوساطة الروح كما قررناه فذلك الباب هو الذي سد والرسالة والنبوة التي انقطعت وأما الإلقاء بغير التشريع فليس بمحجور ولا التعريفات الإلهية بصحة الحكم المقرر أو فساده فلم تنقطع وكذلك تنزل القرآن على قلوب الأولياء ما انقطع مع كونه محفوظا لهم ولكن لهم ذوق الإنزال وهذا لبعضهم (و لهذا) ذكر عن أبي يزيد أنه ما مات حتى استظهر القرآن أي أخذه عن إنزال وهو الذي نبه النبي صَلَّى اللهُ عَليهِ وسَلَّم فيمن حفظ القرآن يعني على هذا الوجه أن النبوة قد أدرجت بين جنبيه ولم يقل في صدره وهذا معنى استظهار القرآن أي أخذه عن ظهر فله مثل هذا التنزل مستمر فيمن شاء الله من عباده لكن على هذا النعت والصفة وهو قوله تعالى يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ‏\n\n\n### [الرسل مبشرون ومنذرون والورثة منذرون لا مبشرون‏]\n\n\nفالرسل مبشرون ومنذرون والورثة منذرون خاصة لا مبشرون لكنهم مبشرون اسم مفعول فإذا بشر الولي أحدا بسعادة فما هو من هذا الباب بل البشارة في ذلك بتعيين السعيد وبشارة الأنبياء متعلقة بالعمل المشروع وهو أنه من عمل كذا كان له كذا في الجنة أو نجاه الله من النار بعمل كذا هذا لا يكون إلا للرسل ليس للولي فيه دخول وله أن يعطي تعيين السعيد لا من حيث العمل فيقول في الكافر وهو في حال كفره إنه سعيد وفي المؤمن في حال إيمانه إنه شقي فيختم لكل واحد بالسبب الموجب لسعادته أو شقاوته تصديقا لقول الولي هذا القدر بقي للأولياء من نبوة الإخبار لا من نبوة التشريع‏\n\n\n### [الخصائص الروحانية للرسالة البشرية]\n\n\nولها من الحروف ياء العلة وله الدعوى والآيات وصاحبها مسئول وله الكشف في أوقات وهو قوله لا تُحَرِّكْ به لِسانَكَ لِتَعْجَلَ به وهي وإن نزلت من الكرسي فإذا رجعت فلا تتعدى سدرة المنتهى والرسالة تنزل معاني وتعود إلى السدرة صورا ينشئها العبد إنشاء وهذا له من الاسم الخلاق الذي أعطى ومعراجها براقي ورفرفى ولكن من السموات ورئيس أرواحها النازلين بها جبريل وهو أستاذ الرسل وهو الموكل بهذا المقام وما يتصور لهذا المقام نسخ وإنما الأشخاص تختلف وكل شخص يجري فيه إلى أجل مسمى ولهذا جاء والْمُرْسَلاتِ عُرْفاً وقال رُسُلَنا تَتْرا\nولا يقع فيها تفاضل وإنما التفاضل بين المرسلين لا من كونهم مرسلين بل من مقام آخر\n\n\n### [الإيمان بالرسالة النابع من القلب والمتولد عن دليل‏]\n\n\nولا يشترط على الرسول فيها إقامة الدليل للمرسل إليه بل لها الجبر ولهذا مع وجود الدليل ما نجد وقوع الايمان في محل المرسل إليه من كل أحد بل من بعضهم فلو كان لنفس الدليل لعم ونراه يوجد ممن لم ير دليلا فدل أن الايمان نور يقذفه الله في قلب من يشاء من عباده لا لعين الدليل فلهذا لم نشترط فيه الدليل فالإيمان علم ضروري يجده المؤمن في قلبه لا يقدر على دفعه وكل من آمن عن دليل فلا يوثق بإيمانه فإنه معرض للشبه القادحة فيه لأنه نظري لا ضروري وقد نبهتك في هذا على سر غامض لا يعرفه كل أحد\n\n\n### [عصمة الرسول في التبليغ وفي غيره‏]\n\n\nولا تشترط أيضا في حقه العصمة إلا فيما يبلغه عن الله خاصة ويلزمه تبيين ما جاء به حتى يفهم عنه لإقامة الحجة على المبلغ إليه فإن عصم من غير هذا فمن مقام آخر وهو أن يخاطب العباد المرسل إليهم بالتأسي به فيكون التأسي به أصلا فإن انفرد بأمر لزمه أن يبينه لا بد من ذلك كما قال في نكاح الهبة خالِصَةً لَكَ من دُونِ الْمُؤْمِنِينَ ومن شرط صاحب هذا المقام طهارة القلب من الفكر فله الراحة فإنه لا يشرع إلا ما يوحى به إليه‏\n\n\n### [مشورة النبي لأصحابه هي من مقام خلافته لا من مقام نبوته‏]\n\n\nوأما مشورته لأصحابه ففي غير ما شرع له وليس للرسول من حيث رسالته المشاورة فإذا انضاف إلى رسالته أن تكون جامعة فلمقام الخلافة المشورة ولما كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من الخلفاء قيل له وشاوِرْهُمْ في الْأَمْرِ فينبغي لك أن تعرف الفرق بين الخلافة والرسالة\n\n",
    "en": "## Chapter One Hundred and Fifty-Nine: Concerning the Station of Human Messengership\n\nThe Messenger is the tongue of the Real (الحق) for humanity,\nThrough command, prohibition, information, and lessons.\nThey are intelligent, but that intelligence does not turn them away,\nFrom what contains deception (غرر).\nDo you not see them regarding the pollination of the date palms, and what\nHarm resulted from what came [from their own judgment]?\nThey are safe from [erroneous] thoughts if they legislate\nA ruling of permission or prohibition upon humanity.\nIndeed, Messengership (الرسالة) in this world has been cut off\nIn our time, due to what has come in the report (الخبر).\nIts ruling has passed, both in this world and the Hereafter,\nAnd it has no effect in the existence of the concrete entity (العين).\nWere it not for the religious obligations (التكاليف), its possessor would not be distinguished\nFrom others, despite the existence of revelation (الوحي) and contemplation (النظر).\nThe bee is constantly and eternally inspired (يوحى إليه)\nUntil the Resurrection, regarding its dwelling and its fruit.\n\n### [Messengership is a Cosmic Attribute Accepted by the Messenger through the Mediation of a Sacred Spirit]\n\nMessengership (الرسالة) is a cosmic attribute (نعت كوني) mediating between the Sender (مرسل) and the recipient (مرسل إليه), and the thing sent (مرسل به) may be expressed as the Message (الرسالة). Sometimes Messengership is the state (حال) of the Messenger. Generally speaking, it is not a station (مقام); rather, it is a relative state (نسبة حال) that ceases with the cessation of the conveyance (التبليغ) in action, and its ruling vanishes with the completion of the conveyance. Allah the Exalted said: <<مَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ>> (There is nothing upon the Messenger except the conveyance). And He made this obligatory upon him, saying: <<يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ وَإِنْ لَمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ>> (O Messenger, convey what has been sent down to you from your Lord; and if you do not, then you have not conveyed His Messengership). The Messengership (الرسالة) here is that with which he was sent and which he conveyed. This is how it is mentioned in the Quran wherever it occurs. The Messenger does not accept it except through the mediation of a trustworthy Sacred Spirit (روح قدسي أمين) who descends with the Message upon his heart. Sometimes the Angel (الملك) appears to him in the form of a man. Any revelation (وحي) that does not possess this characteristic is not called human Messengership (رسالة بشرية); rather, it is called revelation (وحيا), inspiration (إلهاما), insufflation (نفثا), casting (إلقاء), or existence (وجودا). Messengership is only as we have mentioned, and this description belongs only to the human Messenger (الرسول البشري). All other types of revelation are for those who are neither Prophets (نبي) nor Messengers (رسول).\n\n### [The Difference Between the Prophet and the Messenger]\n\nThe difference between the Prophet (النبي) and the Messenger (الرسول) is that when the Spirit casts what we have mentioned to the Prophet, he restricts that ruling (الحكم) to himself specifically, and it is forbidden for him to be followed by others. This is the Prophet. If he is told, \"Convey what has been sent down to you,\" either to a specific group, like the rest of the Prophets, or generally to all people—and this was only for Muhammad (peace and blessings be upon him), not for anyone before him—then by this aspect he is called a Messenger (رسول), and what he brought is the Message (رسالة). That which he was specifically assigned regarding the ruling for himself, and which was forbidden to others, makes him a Prophet (نبي) while also being a Messenger (رسول). If he is not specifically assigned a ruling for himself that is not for those to whom he was sent, then he is a Messenger, not a Prophet. I mean the prophethood of the Divine Laws (الشرائع) which is not for the Friends of God (الأولياء). Thus, every Messenger who is not specifically assigned something of the ruling for himself is a Messenger, not a Prophet. But if he is specifically assigned [a ruling] along with the conveyance, he is both a Messenger and a Prophet. Therefore, not every Messenger is a Prophet, according to what we have stated, nor is every Prophet a Messenger, without dispute.\n\n### [The Inheritors are the Followers Who are Commanded to Convey on Behalf of the Messenger]\n\nFurthermore, the Inheritors (الورثة)—who are the followers commanded to convey [the Message], such as Mu'adh, Ali, and Dihya—are the messengers (رسل) of the Messenger of Allah (peace and blessings be upon him). Every successor who is commanded to convey, receiving the command from one who was commanded, remains connected along the path, commanded by one commanded, all the way back to the Messenger of Allah (peace and blessings be upon him), and is called a messenger (رسول). But what is the Messengership (الرسالة) that has been cut off? The Messengership that has been cut off is the descent of the Divine Ruling (الحكم الإلهي) upon the heart of a human being through the mediation of the Spirit, as we have established. That door is the one that has been sealed, and that is the Messengership and Prophethood that has ceased. As for the casting (الإلقاء) without legislation (التشريع), it is not forbidden, nor are the Divine definitions (التعريفات الإلهية) regarding the soundness or corruption of an established ruling. These have not ceased. Likewise, the descent of the Quran upon the hearts of the Friends of God (الأولياء) has not ceased, even though it is preserved for them. Rather, they possess the taste (ذوق) of the sending down (الإنزال). This is for some of them. For this reason, it was mentioned concerning Abu Yazid that he did not die until he had memorized the Quran (استظهر القرآن)—meaning, he received it through descent (إنزال). This is what the Prophet (peace and blessings be upon him) alluded to regarding the one who memorizes the Quran—meaning, in this manner—that prophethood has been folded between his sides (بين جنبيه), and he did not say \"in his chest.\" This is the meaning of memorizing the Quran (استظهار القرآن): taking it from the back (عن ظهر). Such a descent (تنزل) continues for whomever Allah wills among His servants, but according to this description and characteristic, which is His saying, the Exalted: <<يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ>> (He casts the Spirit by His command upon whomever He wills of His servants).\n\n### [Messengers are Bearers of Glad Tidings and Warners, while Inheritors are Warners, not Bearers of Glad Tidings]\n\nThe Messengers (الرسل) are bearers of glad tidings (مبشرون) and warners (منذرون), while the Inheritors (الورثة) are specifically warners, not bearers of glad tidings. However, they are *recipients* of glad tidings (مبشرون - passive participle). If the Friend of God (الولي) gives glad tidings to someone of happiness (سعادة), it is not from this category. Rather, the glad tidings in that case relate to the designation of the happy one (تعيين السعيد). The glad tidings of the Prophets are related to the prescribed action (العمل المشروع), meaning that whoever performs such-and-such an action will have such-and-such in Paradise, or Allah will save him from the Fire by such-and-such an action. This belongs only to the Messengers; the Friend of God has no involvement in it. However, the Friend of God may grant the designation of the happy one, not based on the action. Thus, he may say of the disbeliever, while he is in the state of disbelief, that he is happy (سعيد), and of the believer, while he is in the state of faith, that he is wretched (شقي). He then seals the fate of each one with the cause necessitating his happiness or wretchedness, confirming the saying of the Friend of God. This capacity remains for the Friends of God from the prophethood of informing (نبوة الإخبار), not from the prophethood of legislation (نبوة التشريع).\n\n### [The Spiritual Characteristics of Human Messengership]\n\nMessengership has the letter *Yā’* (ياء العلة) among the letters of the alphabet. It possesses the claim (الدعوى) and the signs (الآيات). Its possessor is responsible (مسئول). He has Unveiling (الكشف) at certain times, which is [alluded to in] His saying: <<لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ>> (Do not move your tongue with it to hasten it). Although it descends from the Throne (الكرسي), when it returns, it does not pass beyond the Lote Tree of the Utmost Boundary (سدرة المنتهى). The Message (الرسالة) descends as meanings (معاني) and returns to the Lote Tree as forms (صورا) which the servant creates (ينشئها) by his own creation. This [station] receives from the Name *Al-Khallāq* (The Creator) which was granted to it. Its ascension (معراجها) is by the *Burāq* and the *Rafraf*, but only from the heavens. The chief of the spirits descending with it is Gabriel (جبريل), who is the master of the Messengers (أستاذ الرسل) and is entrusted with this station (مقام). Abrogation (نسخ) is not conceivable for this station; rather, the individuals (الأشخاص) differ, and each individual operates within it until an appointed term. For this reason, it came [in the Quran]: <<وَالْمُرْسَلَاتِ عُرْفًا>> (By the winds sent forth in succession) and <<رُسُلَنَا تَتْرَا>> (Our Messengers following one another). There is no gradation (تفاضل) within Messengership itself; rather, the gradation is among the Messengers (المرسلين), not by virtue of their being Messengers, but from another station.\n\n### [Faith in Messengership Originating from the Heart and Generated by Proof]\n\nThe Messenger is not required to establish proof (الدليل) for the recipient of the Message (المرسل إليه); rather, Messengership possesses compulsion (الجبر). For this reason, even with the existence of proof, we do not find faith (الإيمان) occurring in the heart of every recipient, but only in some of them. If faith were due to the proof itself, it would be universal. We also see faith existing in those who have not seen proof. This indicates that faith is a light (نور) that Allah casts into the heart of whomever He wills among His servants, not due to the proof itself. Therefore, we do not stipulate proof for it. Faith is necessary knowledge (علم ضروري) that the believer finds in his heart and cannot repel. Anyone who believes based on proof, his faith is not trustworthy, for it is susceptible to doubts that may undermine it, because it is theoretical (نظري), not necessary (ضروري). I have alerted you here to a subtle secret (سر غامض) that not everyone knows.\n\n### [The Infallibility of the Messenger in Conveyance and Otherwise]\n\nInfallibility (العصمة) is also not stipulated for him except specifically in what he conveys from Allah. He is obligated to clarify what he has brought so that it may be understood from him, in order to establish the argument (الحجة) against the recipient. If he is infallible in matters other than this, it is due to another station, which is that he addresses the servants to whom he is sent with the command to emulate him (التأسي به). Thus, emulation of him becomes a principle (أصلا). If he is singled out for a matter, he is necessarily obligated to clarify it, as He said regarding the marriage of donation (نكاح الهبة): <<خَالِصَةً لَكَ مِنْ دُونِ الْمُؤْمِنِينَ>> (Exclusively for you, excluding the believers). Among the conditions of the possessor of this station is the purity of the heart from [personal] thought (الفكر), so he has rest, for he legislates only what is revealed to him.\n\n### [The Prophet's Consultation with His Companions is from His Station of Vicegerency, Not His Station of Prophethood]\n\nAs for his consultation (مشورته) with his companions, it concerns matters other than what was legislated for him. The Messenger, by virtue of his Messengership (رسالته), does not engage in consultation. If his Messengership is combined with the quality of being comprehensive, then consultation belongs to the station of Vicegerency (الخلافة). Since the Messenger of Allah (peace and blessings be upon him) was one of the Vicegerents (الخلفاء), he was told: <<وَشَاوِرْهُمْ فِي الْأَمْرِ>> (And consult them in the matter). You should therefore know the difference between Vicegerency and Messengership.",
    "ur": "(باب ایک سو انسٹھ: بشری رسالت کے مقام کے بیان میں)\n\nبے شک رسول (الرسول) ذات حق (الحق) کی زبان ہیں انسانوں کے لیے،\nامر (حکم)، نہی (ممانعت)، اطلاع اور عبرتوں کے ذریعے۔\n\nوہ ذہین ہیں، لیکن یہ ذہانت انہیں اس چیز کی طرف نہیں پھیرتی\nجس میں فریب (غرر) ہے۔\n\nکیا تم انہیں کھجوروں کی پیوند کاری کے معاملے میں نہیں دیکھتے،\nاور جو نقصان اس میں ہوا، اس کے باوجود جو (حکم) آیا۔\n\nوہ افکار سے محفوظ ہیں اگر وہ انسانوں پر\nحلال و حرام کا کوئی حکم (حکماً) جاری کریں۔\n\nبے شک رسالت (الرسالة) دنیا میں ہمارے وقت میں منقطع ہو چکی ہے،\nاس خبر کی وجہ سے جو آئی ہے۔\n\nاور اس کا حکم دنیا اور آخرت میں جاری ہو چکا ہے،\nاور وجودِ عین (وجود العين) میں اس کا کوئی اثر باقی نہیں ہے۔\n\nاگر شرعی ذمہ داریاں (التكاليف) نہ ہوتیں تو اس کا حامل (رسول) دوسروں سے ممتاز نہ ہوتا،\nوحی (الوحي) اور نظر (غور و فکر) کے وجود کی وجہ سے۔\n\nشہد کی مکھی کو ہمیشہ، قیامت تک،\nرہائش اور پھل (شہد) کے بارے میں وحی کی جاتی ہے۔\n\n### [رسالت ایک کونی صفت ہے جسے رسول روح قدسی کے واسطے سے قبول کرتا ہے]\n\nرسالت (الرسالة) ایک کونی صفت (نعت كوني) ہے جو مرسل (بھیجنے والے) اور مرسل الیہ (جس کی طرف بھیجا گیا) کے درمیان واسطہ ہے۔ اور جس چیز کے ساتھ بھیجا جاتا ہے، اسے کبھی رسالت سے تعبیر کیا جاتا ہے، اور کبھی رسالت رسول کا حال ہوتی ہے۔ مجموعی طور پر، یہ کوئی مقام نہیں ہے، بلکہ یہ ایک نسبتِ حال (نسبة حال) ہے۔ اور یہ بالفعل تبلیغ (التبليغ) کے منقطع ہونے سے منقطع ہو جاتی ہے، اور تبلیغ کے ختم ہونے سے اس کا حکم زائل ہو جاتا ہے۔ اللہ تعالیٰ نے فرمایا:\n\n> **مَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ** (رسول پر صرف پہنچا دینا ہے) [المائدہ: ۹۹]\n\nاور اس نے اس پر یہ واجب کیا، پس فرمایا:\n\n> **يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ وَإِنْ لَمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ** (اے رسول! جو کچھ آپ کے رب کی طرف سے آپ پر نازل کیا گیا ہے، اسے پہنچا دیجیے، اور اگر آپ نے ایسا نہ کیا تو آپ نے اس کی رسالت (رسالتہ) نہیں پہنچائی) [المائدہ: ۶۷]\n\nپس یہاں رسالت (الرسالة) وہی ہے جس کے ساتھ انہیں بھیجا گیا اور جسے انہوں نے پہنچایا۔ اور قرآن میں جہاں بھی یہ لفظ آیا ہے، اسی طرح وارد ہوا ہے۔ رسول اسے صرف ایک امین روح قدسی (روح قدسي) کے واسطے سے ہی قبول کرتا ہے جو رسالت لے کر اس کے دل پر نازل ہوتا ہے۔ اور کبھی فرشتہ اس کے لیے ایک آدمی کی صورت میں متمثل ہو جاتا ہے۔ اور ہر وہ وحی جو اس صفت پر نہ ہو، بشری رسالت (رسالة بشرية) نہیں کہلاتی، بلکہ اسے وحی، یا الہام، یا نفث (دل میں پھونکنا)، یا القاء (ڈالنا)، یا وجود (پانا) کہا جاتا ہے۔ اور رسالت صرف وہی ہوتی ہے جو ہم نے ذکر کی، اور یہ وصف صرف بشری رسول (الرسول البشري) کے لیے ہوتا ہے۔ اور وحی کی جو اقسام اس کے علاوہ ہیں، وہ نبی اور رسول کے علاوہ دوسروں کے لیے ہوتی ہیں۔\n\n### [نبی اور رسول کے درمیان فرق]\n\nنبی (النبي) اور رسول (الرسول) میں فرق یہ ہے کہ جب روح (الروح) نبی پر وہ چیز القاء کرتی ہے جو ہم نے ذکر کی، تو وہ اس حکم کو صرف اپنی ذات تک محدود رکھتا ہے، اور اس کے لیے جائز نہیں ہوتا کہ وہ کسی دوسرے کی پیروی کرے۔ یہ نبی ہے۔ پھر اگر اسے کہا جائے کہ جو کچھ تم پر نازل کیا گیا ہے، اسے پہنچاؤ، خواہ وہ کسی مخصوص گروہ کے لیے ہو، جیسے دیگر انبیاء، یا عام طور پر تمام لوگوں کے لیے ہو، اور یہ آخری صورت صرف محمد صلی اللہ علیہ وسلم کے لیے تھی، ان سے پہلے کسی اور کے لیے نہیں تھی، تو اس لحاظ سے وہ رسول کہلاتا ہے۔ اور جو کچھ وہ لایا وہ رسالت (رسالة) ہے۔ اور جو حکم اس کے لیے خاص کیا گیا اور اس حکم سے دوسروں کو منع کیا گیا، وہ رسول ہونے کے ساتھ ساتھ نبی بھی ہے۔ اور اگر وہ اپنی ذات میں کسی ایسے حکم کے ساتھ خاص نہ ہو جو ان لوگوں کے لیے نہ ہو جن کی طرف اسے بھیجا گیا ہے، تو وہ رسول ہے، نبی نہیں۔ اور میرا مطلب شریعتوں کی نبوت (نبوة الشرائع) سے ہے جو اولیاء کے لیے نہیں ہوتی۔ پس ہر وہ رسول جو اپنے حق میں کسی حکم کے ساتھ خاص نہ ہو، وہ رسول ہے، نبی نہیں۔ اور اگر وہ تبلیغ کے ساتھ خاص ہو، تو وہ رسول اور نبی دونوں ہے۔ پس ہمارے قول کے مطابق ہر رسول نبی نہیں ہوتا، اور ہر نبی رسول نہیں ہوتا، اس میں کوئی اختلاف نہیں۔\n\n### [ورثاء وہ پیروکار ہیں جنہیں رسول کی طرف سے تبلیغ کا حکم دیا گیا]\n\nپھر ورثاء (الورثة)، یعنی وہ پیروکار جنہیں تبلیغ (التبليغ) کا حکم دیا گیا، جیسے معاذ، علی، اور دحیہ، یہ رسول اللہ صلی اللہ علیہ وسلم کے رسول ہیں۔ اور ہر بعد میں آنے والا شخص جسے تبلیغ کا حکم دیا گیا ہے، وہ اس شخص کی طرف سے مامور ہے جسے تبلیغ کا حکم دیا گیا تھا، یہ سلسلہ رسول اللہ صلی اللہ علیہ وسلم تک متصل ہے، اور اسے رسول کہا جاتا ہے۔ لیکن وہ کون سی رسالت ہے جو منقطع ہو چکی ہے؟ وہ رسالت جو منقطع ہوئی ہے، وہ الٰہی حکم (الحكم الإلهي) کا روح کے واسطے سے بشر کے دل پر نازل ہونا ہے، جیسا کہ ہم نے بیان کیا۔ پس وہ دروازہ بند ہو چکا ہے۔ اور وہ رسالت اور نبوت (النبوة) منقطع ہو چکی ہے۔ لیکن بغیر تشریع کے القاء (ڈالنا) ممنوع نہیں ہے، اور نہ ہی مقرر شدہ حکم کی صحت یا فساد کے بارے میں الٰہی تعریفات (التعريفات الإلهية) منقطع ہوئی ہیں۔ اسی طرح اولیاء کے دلوں پر قرآن کا نزول منقطع نہیں ہوا، باوجود اس کے کہ وہ ان کے لیے محفوظ ہے۔ لیکن انہیں انزال (نزول) کا ذوق حاصل ہوتا ہے۔ اور یہ ان میں سے بعض کے لیے ہے۔ اسی لیے ابو یزید (بسطامی) کے بارے میں ذکر کیا گیا ہے کہ وہ اس وقت تک فوت نہیں ہوئے جب تک انہوں نے قرآن کو استظہار (استظہار) نہ کر لیا، یعنی اسے نزول کے ذریعے حاصل کیا۔ اور یہی وہ چیز ہے جس کی طرف نبی صلی اللہ علیہ وسلم نے اشارہ کیا جب انہوں نے فرمایا کہ جس نے قرآن کو حفظ کیا (یعنی اس طریقے سے)، تو نبوت (النبوة) اس کے پہلوؤں کے درمیان لپیٹ دی گئی ہے، اور یہ نہیں فرمایا کہ اس کے سینے میں۔ اور یہی قرآن کے استظہار کا معنی ہے، یعنی اسے پشت سے حاصل کرنا۔ پس یہ نزول (التنزل) اللہ کے بندوں میں سے جس کے لیے وہ چاہتا ہے، جاری رہتا ہے، لیکن اسی صفت اور نعت پر، اور وہ اللہ تعالیٰ کا یہ قول ہے:\n\n> **يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ** (وہ اپنے حکم سے روح کو اپنے بندوں میں سے جس پر چاہتا ہے نازل کرتا ہے) [غافر: ۱۵]\n\n### [رسول مبشر اور منذر ہوتے ہیں، اور ورثاء صرف منذر ہوتے ہیں، مبشر نہیں]\n\nپس رسول (الرسل) مبشر (خوشخبری دینے والے) اور منذر (ڈرانے والے) ہوتے ہیں، جبکہ ورثاء (الورثة) خاص طور پر منذر ہوتے ہیں، مبشر نہیں۔ لیکن وہ مبشر (اسم مفعول) ہوتے ہیں۔ پس اگر ولی کسی کو سعادت کی بشارت دے، تو یہ اس باب سے نہیں ہے۔ بلکہ اس میں بشارت سعید (خوش بخت) کے تعین سے متعلق ہوتی ہے۔ اور انبیاء کی بشارت مشروع عمل سے متعلق ہوتی ہے، یعنی یہ کہ جس نے ایسا عمل کیا، اس کے لیے جنت میں یہ ہوگا، یا اللہ اسے فلاں عمل کے ذریعے آگ سے نجات دے گا۔ یہ صرف رسولوں کے لیے ہوتا ہے، ولی کا اس میں کوئی دخل نہیں۔ البتہ ولی کو یہ حق ہے کہ وہ سعید کا تعین کرے، عمل کے لحاظ سے نہیں، چنانچہ وہ کافر کے بارے میں، اس کے کفر کی حالت میں، کہہ سکتا ہے کہ وہ سعید ہے، اور مومن کے بارے میں، اس کے ایمان کی حالت میں، کہہ سکتا ہے کہ وہ شقی (بد بخت) ہے۔ پس ہر ایک کا خاتمہ اس سبب پر ہوتا ہے جو اس کی سعادت یا شقاوت کا موجب ہے، جو ولی کے اس قول کی تصدیق کرتا ہے۔ یہ حصہ اولیاء کے لیے نبوتِ اخبار (خبر دینے والی نبوت) سے باقی ہے، نہ کہ نبوتِ تشریع (قانون سازی کی نبوت) سے۔\n\n### [بشری رسالت کی روحانی خصوصیات]\n\nاور اس (رسالت) کے لیے حروف میں سے یاء العلہ (یاء علت) ہے، اور اس کے لیے دعویٰ اور آیات (معجزات) ہیں۔ اور اس کا حامل (صاحبها) مسئول (جواب دہ) ہے۔ اور اس کے لیے اوقات میں کشف (الکشف) ہوتا ہے، اور یہ اللہ تعالیٰ کا قول ہے:\n\n> **لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ** (آپ اس (وحی) کو جلدی سے حاصل کرنے کے لیے اپنی زبان کو حرکت نہ دیں) [القیامہ: ۱۶]\n\nاور اگرچہ یہ کرسی (الکرسي) سے نازل ہوتی ہے، لیکن جب یہ واپس جاتی ہے تو سدرۃ المنتہیٰ (سدرة المنتهى) سے تجاوز نہیں کرتی۔ اور رسالت معانی کی صورت میں نازل ہوتی ہے اور سدرہ کی طرف ایسی صورتوں میں لوٹتی ہے جنہیں بندہ خود ایجاد کرتا ہے۔ اور اس کے لیے اسم \"الخلاق\" (بڑی تخلیق کرنے والا) ہے جو اسے عطا کیا گیا ہے۔ اور اس کا معراج براق (براق) اور رفرف (رفرف) کے ذریعے ہوتا ہے، لیکن آسمانوں سے۔ اور اس کے نازل ہونے والی ارواح کا سردار جبرائیل ہے، جو رسولوں کا استاد ہے، اور اسی مقام کا موکل ہے۔ اور اس مقام کے لیے نسخ (منسوخ ہونا) کا تصور نہیں کیا جاتا، بلکہ اشخاص مختلف ہوتے ہیں، اور ہر شخص ایک مقررہ مدت تک اس میں جاری رہتا ہے۔ اسی لیے یہ آیا:\n\n> **وَالْمُرْسَلَاتِ عُرْفًا** (قسم ہے ان ہواؤں کی جو پے در پے بھیجی جاتی ہیں) [المرسلات: ۱]\n\nاور فرمایا:\n\n> **رُسُلَنَا تَتْرَا** (ہمارے رسول پے در پے) [المؤمنون: ۴۴]\n\nاور اس میں کوئی تفاضل (فضیلت میں فرق) واقع نہیں ہوتا، بلکہ تفاضل مرسلین (رسولوں) کے درمیان ہوتا ہے، نہ اس وجہ سے کہ وہ مرسل ہیں، بلکہ کسی دوسرے مقام کی وجہ سے۔\n\n### [رسالت پر ایمان جو دل سے نکلتا ہے اور جو دلیل سے پیدا ہوتا ہے]\n\nاور رسول پر اس میں مرسل الیہ کے لیے دلیل قائم کرنا شرط نہیں ہے، بلکہ اس کے لیے جبر (طاقت) ہے۔ اسی لیے دلیل کے موجود ہونے کے باوجود ہم نہیں دیکھتے کہ مرسل الیہ کے مقام میں ہر ایک کو ایمان نصیب ہو، بلکہ ان میں سے بعض کو ہوتا ہے۔ اگر یہ صرف دلیل کی وجہ سے ہوتا تو یہ عام ہو جاتا۔ اور ہم دیکھتے ہیں کہ یہ ان لوگوں میں بھی پایا جاتا ہے جنہوں نے کوئی دلیل نہیں دیکھی۔ پس یہ اس بات کی دلیل ہے کہ ایمان (الإيمان) ایک نور ہے جسے اللہ اپنے بندوں میں سے جس کے دل میں چاہتا ہے ڈال دیتا ہے، نہ کہ صرف دلیل کی وجہ سے۔ اسی لیے ہم نے اس میں دلیل کو شرط نہیں ٹھہرایا۔ ایمان ایک علمِ ضروری (علم ضروري) ہے جسے مومن اپنے دل میں پاتا ہے اور اسے دفع کرنے پر قادر نہیں ہوتا۔ اور جو شخص دلیل کی بنیاد پر ایمان لاتا ہے، اس کے ایمان پر بھروسہ نہیں کیا جا سکتا، کیونکہ وہ اس میں قدح کرنے والے شبہات کا شکار ہو سکتا ہے، کیونکہ وہ نظری (نظري) ہے، ضروری نہیں۔ اور میں نے تمہیں اس میں ایک ایسے گہرے راز سے آگاہ کیا ہے جسے ہر کوئی نہیں جانتا۔\n\n### [تبلیغ میں اور اس کے علاوہ رسول کی عصمت]\n\nاور اس کے حق میں عصمت (العصمة) بھی شرط نہیں ہے، سوائے اس کے جو وہ خاص طور پر اللہ کی طرف سے پہنچاتا ہے۔ اور اس پر لازم ہے کہ وہ جو کچھ لایا ہے اسے واضح کرے تاکہ مبلغ الیہ پر حجت قائم کرنے کے لیے اسے سمجھا جا سکے۔ اگر وہ اس کے علاوہ کسی اور چیز سے معصوم ہو، تو وہ کسی دوسرے مقام کی وجہ سے ہے۔ اور وہ یہ ہے کہ وہ مرسل الیہ بندوں کو اس کی پیروی کرنے کا حکم دے، تاکہ اس کی پیروی ایک اصل بن جائے۔ اگر وہ کسی حکم میں منفرد ہو، تو اس پر لازم ہے کہ وہ اسے واضح کرے، یہ ضروری ہے۔ جیسا کہ نکاحِ ہبہ (بغیر مہر کے نکاح) کے بارے میں فرمایا:\n\n> **خَالِصَةً لَكَ مِنْ دُونِ الْمُؤْمِنِينَ** (یہ صرف آپ کے لیے خاص ہے، مومنوں کے علاوہ) [الاحزاب: ۵۰]\n\nاور اس مقام کے حامل کی شرط یہ ہے کہ اس کا دل فکر (غور و فکر) سے پاک ہو، پس اسے راحت حاصل ہوتی ہے، کیونکہ وہ صرف وہی شریعت بناتا ہے جو اس پر وحی کی جاتی ہے۔\n\n### [نبی کا اپنے صحابہ سے مشورہ ان کے مقامِ خلافت سے ہے، نہ کہ مقامِ نبوت سے]\n\nاور جہاں تک ان کا اپنے صحابہ سے مشورہ کرنے کا تعلق ہے، تو وہ ان چیزوں کے بارے میں ہے جو ان کے لیے مشروع نہیں کی گئیں۔ اور رسول کو اپنی رسالت (رسالتہ) کے لحاظ سے مشورہ کرنے کا حق نہیں ہے۔ پس اگر اس کی رسالت کے ساتھ جامع ہونا بھی شامل ہو، تو مشورہ مقامِ خلافت (مقام الخلافة) کے لیے ہے۔ اور چونکہ رسول اللہ صلی اللہ علیہ وسلم خلفاء میں سے تھے، اس لیے انہیں کہا گیا:\n\n> **وَشَاوِرْهُمْ فِي الْأَمْرِ** (اور معاملات میں ان سے مشورہ کیجیے) [آل عمران: ۱۵۹]\n\nلہٰذا آپ کے لیے ضروری ہے کہ آپ خلافت (الخلافة) اور رسالت (الرسالة) کے درمیان فرق کو جانیں۔",
    "fa": "(باب صد و پنجاه و نهم در مقام رسالت بشری)\n\nهمانا رسول، زبان حق (الحق) برای بشر است، *** به امر و نهی و آگاهی دادن و عبرت‌ها.\nآنان باهوشند، اما آن هوش ایشان را *** از آنچه در آن (رسالت) از فریب‌هاست، باز نمی‌دارد.\nآیا آنان را نمی‌بینی که برای تلقیح نخل‌ها و آنچه *** در آن بود، بر آنچه از ضرر آمد، (عمل کردند)؟\nآنان از افکار (بشری) سالم‌اند، اگر حکمی *** به حلال و حرام بر بشر تشریع کنند.\nهمانا رسالت (الرسالة) در دنیا منقطع شده است *** در زمان ما، به سبب آنچه در خبر (حدیث) آمده است.\nو حکم آن در دنیا و آخرت گذشته است، *** و در وجود عینی (وجود العين) اثری ندارد.\nاگر تکالیف نبود، صاحب آن (رسالت) *** به سبب وجود وحی و نظر (الهی)، از غیر خود متمایز نمی‌شد.\nبه زنبور عسل همیشه و پیوسته وحی می‌شود، *** تا قیامت، در مسکن و در ثمر (عسل).\n\n[رسالت (الرسالة) صفتی کونی است که رسول آن را به واسطه روح قدسی می‌پذیرد]\n\nرسالت (الرسالة) صفتی کونی (نعت کونی) است که واسطه میان فرستنده (مرسل) و فرستاده‌شده (مرسل إليه) است. آنچه فرستاده می‌شود (المرسل به) گاهی با عنوان رسالت از آن تعبیر می‌شود و گاهی رسالت حال رسول است. در مجموع، رسالت مقام (مقام) نیست، بلکه نسبت حال است و با قطع شدن ابلاغ بالفعل، منقطع می‌شود و حکم آن با پایان یافتن ابلاغ زایل می‌گردد. خداوند متعال می‌فرماید: «ما عَلَى الرَّسُولِ إِلَّا الْبَلاغُ» (بر پیامبر جز ابلاغ نیست). و آن را بر او واجب ساخت و فرمود: «يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ وإِنْ لَمْ تَفْعَلْ فَما بَلَّغْتَ رِسالَتَهُ» (ای پیامبر، آنچه از پروردگارت بر تو نازل شده ابلاغ کن، و اگر نکنی، رسالت او را ابلاغ نکرده‌ای). پس رسالت (الرسالة) در اینجا همان چیزی است که با آن فرستاده شده و آن را ابلاغ کرده است، و در قرآن نیز هر جا آمده به همین صورت است. رسول آن را نمی‌پذیرد مگر به واسطه روح قدسی امینی که رسالت را بر قلب او نازل می‌کند، و گاهی فرشته به صورت مردی برای او متمثل می‌شود. هر وحی‌ای که این صفت را نداشته باشد، رسالت بشری نامیده نمی‌شود، بلکه وحی یا الهام یا نفث یا القاء یا وجود (وجود) نامیده می‌شود. رسالت جز آن‌گونه که ذکر کردیم نیست، و این وصف جز برای رسول بشری نیست. و آنچه غیر از این از انواع وحی است، برای غیر نبی و رسول خواهد بود.\n\n[تفاوت میان نبی و رسول]\n\nتفاوت میان نبی و رسول این است که نبی (النبي) هنگامی که روح آنچه را ذکر کردیم بر او القا کند، آن حکم را تنها به خود اختصاص می‌دهد و بر او حرام است که از غیر خود پیروی کند؛ این همان نبی است. اما اگر به او گفته شود: «آنچه بر تو نازل شده ابلاغ کن»، یا برای گروهی خاص مانند سایر انبیا، یا به طور عام برای مردم – که این حالت جز برای محمد (صلی الله علیه و سلم) نبوده و برای هیچ‌کس پیش از او نبوده است – در این صورت رسول (الرسول) نامیده می‌شود. آنچه آورده رسالت (رسالة) است، و آنچه از حکم که به خود اختصاص داده و بر غیر خود حرام کرده، او نبی است با وجود اینکه رسول است. و اگر در حق خود به حکمی که برای مبعوث‌شدگان نباشد، اختصاص نیابد، او رسول است نه نبی. و منظور من نبوت شرایعی است که برای اولیا نیست. پس هر رسولی که به چیزی از حکم در حق خود اختصاص نیافته باشد، رسول است نه نبی، و اگر با ابلاغ اختصاص یابد، رسول و نبی است. بنابراین، طبق آنچه گفتیم، هر رسولی نبی نیست، و بدون اختلاف، هر نبی‌ای رسول نیست.\n\n[وارثان همان پیروانی هستند که به ابلاغ از جانب رسول مأمور شده‌اند]\n\nسپس وارثان، که همان پیروانی هستند که به ابلاغ مأمور شده‌اند، مانند معاذ و علی و دحیه، فرستادگان (رسل) رسول خدا (صلی الله علیه و سلم) هستند. و پیوسته هر متأخری که به ابلاغ مأمور شده، از کسی که به ابلاغ مأمور شده، راهش متصل است، مأمور از مأمور تا رسول خدا (صلی الله علیه و سلم)، رسول نامیده می‌شود. اما رسالتی که منقطع شده کدام است؟ رسالتی که منقطع شده، نزول حکم الهی بر قلب بشر به واسطه روح است، همان‌گونه که مقرر کردیم. پس آن باب است که بسته شده، و آن رسالت (الرسالة) و نبوت (النبوة) است که منقطع گشته است. اما القاء بدون تشریع، ممنوع نیست، و همچنین تعریفات الهی (التعریفات الإلهية) در مورد صحت یا فساد حکم مقرر، منقطع نشده است. و همچنین نزول قرآن بر قلوب اولیا منقطع نشده است، با وجود اینکه برای آنان محفوظ است، اما آنان ذوق انزال (ذوق الإنزال) را دارند. و این برای برخی از ایشان است. به همین دلیل، از ابویزید نقل شده که نمرد تا اینکه قرآن را استظهار کرد، یعنی آن را از طریق انزال (نزول) دریافت کرد. و این همان چیزی است که پیامبر (صلی الله علیه و سلم) در مورد کسی که قرآن را حفظ کند، یعنی به این شیوه، هشدار داد که نبوت (النبوة) در میان دو پهلوی او گنجانده شده است و نفرمود در سینه‌اش. و این معنای استظهار قرآن است، یعنی گرفتن آن از پشت (از غیب). پس چنین تنزلی برای هر کس از بندگانش که خدا بخواهد، مستمر است، اما بر این صفت و نعت، که همان قول خداوند متعال است: «يُلْقِي الرُّوحَ من أَمْرِهِ عَلى‏ من يَشاءُ من عِبادِهِ» (روح را به فرمان خود بر هر کس از بندگانش که بخواهد القا می‌کند).\n\n[رسولان بشارت‌دهنده و بیم‌دهنده هستند، و وارثان فقط بیم‌دهنده هستند نه بشارت‌دهنده]\n\nپس رسولان (الرسل) بشارت‌دهنده (مبشرون) و بیم‌دهنده (منذرون) هستند، اما وارثان فقط بیم‌دهنده هستند نه بشارت‌دهنده. لکن آنان «مبشَّرون» (اسم مفعول) هستند. اگر ولی کسی را به سعادتی بشارت دهد، این از این باب نیست، بلکه بشارت در این مورد به تعیین شخص سعید است. اما بشارت انبیا مربوط به عمل مشروع است، به این صورت که هر کس فلان عمل را انجام دهد، فلان پاداش را در بهشت دارد، یا خداوند او را با فلان عمل از آتش نجات می‌دهد. این فقط برای رسولان است و ولی در آن دخالتی ندارد. ولی می‌تواند تعیین شخص سعید را بدهد، نه از حیث عمل. پس ممکن است در مورد کافر در حال کفرش بگوید که او سعید است، و در مورد مؤمن در حال ایمانش بگوید که او شقی است، و برای هر یک با سببی که موجب سعادت یا شقاوت اوست، خاتمه داده می‌شود، در تأیید قول ولی. این مقدار از نبوت اخبار (نبوة الإخبار)، نه نبوت تشریع (نبوة التشريع)، برای اولیا باقی مانده است.\n\n[ویژگی‌های روحانی رسالت بشری]\n\nو از حروف، حرف «یاء عله» برای آن است. و برای آن (رسالت) ادعا و آیات است، و صاحب آن مسئول است. و برای او کشف (الکشف) در اوقاتی حاصل می‌شود، که همان قول خداوند است: «لا تُحَرِّكْ به لِسانَكَ لِتَعْجَلَ به» (زبانت را به آن حرکت مده تا در آن شتاب کنی). و رسالت اگرچه از کرسی نازل می‌شود، اما وقتی باز می‌گردد، از سدرة المنتهی فراتر نمی‌رود. رسالت به صورت معانی نازل می‌شود و به سدره به صورت صوری باز می‌گردد که بنده آن‌ها را ایجاد می‌کند. و این (ایجاد صور) برای او از اسم «الخلاق» است که به او عطا شده است. و معراج آن (رسالت) براقی و رفرفی است، اما از آسمان‌ها. و رئیس ارواح نازل‌شونده با آن، جبرئیل است، که استاد رسولان و موکل این مقام (مقام) است. و نسخ برای این مقام تصور نمی‌شود، بلکه اشخاص متفاوت‌اند و هر شخص تا اجل معینی در آن جاری می‌شود. به همین دلیل آمده است: «وَالْمُرْسَلَاتِ عُرْفًا» (سوگند به فرستادگان پی در پی) و فرمود: «رُسُلَنَا تَتْرَا» (پیامبرانمان را پی در پی فرستادیم). و در خود رسالت تفاضلی رخ نمی‌دهد، بلکه تفاضل میان فرستادگان است، نه از جهت رسول بودنشان، بلکه از مقام (مقام) دیگری است.\n\n[ایمان به رسالت که از قلب سرچشمه می‌گیرد و از دلیل متولد می‌شود]\n\nو بر رسول شرط نیست که در آن (رسالت) برای فرستاده‌شده (مرسل إليه) اقامه دلیل کند، بلکه برای آن جبر (الزام) است. به همین دلیل، با وجود دلیل، نمی‌بینیم که ایمان در محل فرستاده‌شده از سوی همه واقع شود، بلکه از سوی برخی واقع می‌شود. اگر ایمان به دلیل وابسته بود، فراگیر می‌شد. و می‌بینیم که ایمان در کسی که دلیلی ندیده نیز یافت می‌شود. پس این دلالت دارد که ایمان نوری است که خداوند در قلب هر کس از بندگانش که بخواهد می‌اندازد، نه به خاطر خود دلیل. به همین دلیل، ما در آن دلیل را شرط نکردیم. پس ایمان علم ضروری است که مؤمن آن را در قلب خود می‌یابد و نمی‌تواند آن را دفع کند. و هر کس که از طریق دلیل ایمان آورد، به ایمانش اعتمادی نیست، زیرا در معرض شبهات قادحه (شبهات ویرانگر) قرار دارد، چون نظری است نه ضروری. و من تو را در این باره به رازی پنهان آگاه ساختم که هر کسی آن را نمی‌داند.\n\n[عصمت رسول در ابلاغ و در غیر آن]\n\nو همچنین عصمت (العصمة) در حق او شرط نیست، مگر در آنچه به طور خاص از جانب خداوند ابلاغ می‌کند. و بر او لازم است که آنچه را آورده تبیین کند تا از او فهمیده شود، برای اقامه حجت بر کسی که ابلاغ به او شده است. اگر از غیر این (ابلاغ) نیز معصوم باشد، از مقام (مقام) دیگری است، و آن این است که بندگان فرستاده‌شده به سوی آنان را به تأسی (پیروی) از خود خطاب کند، پس تأسی به او اصل قرار می‌گیرد. اگر به امری منفرد شد، لازم است که آن را تبیین کند، و این ضروری است، چنانکه در مورد نکاح هبه فرمود: «خالِصَةً لَكَ من دُونِ الْمُؤْمِنِينَ» (ویژه توست نه مؤمنان). و از شروط صاحب این مقام، طهارت قلب از فکر (بشری) است، پس برای او آسودگی است، زیرا او جز آنچه به او وحی می‌شود، تشریع نمی‌کند.\n\n[مشورت پیامبر با اصحابش از مقام خلافت اوست نه از مقام نبوتش]\n\nاما مشورت او با اصحابش، در غیر از آن چیزی است که برای او تشریع شده است. و رسول از حیث رسالتش (رسالته) حق مشورت ندارد. پس اگر به رسالت او جامع بودن اضافه شود، مشورت برای مقام خلافت (مقام الخلافة) است. و چون رسول خدا (صلی الله علیه و سلم) از خلفا بود، به او گفته شد: «وَشَاوِرْهُمْ فِي الْأَمْرِ» (و در کار با آنان مشورت کن). پس شایسته است که تفاوت میان خلافت و رسالت (الرسالة) را بدانی."
  },
  "page_count": 3
}