{
  "id": 42,
  "title": {
    "ar": "الباب الثاني والأربعون في معرفة الفتوة والفتيان ومنازلهم وطبقاتهم وأسرار أقطابهم",
    "en": "Chapter Forty-Two: Concerning the understanding of Spiritual Chivalry (الفتوة), the Practitioners of Spiritual Chivalry (الفتيان), their spiritual stations (منازل), their degrees (طبقات), and the secrets of their Poles (أقطاب).",
    "ur": "باب بیالیس: فتوت (الفتوة) اور فتیان (الفتيان) کی معرفت، اور ان کے منازل، ان کے طبقات، اور ان کے اقطاب (أقطاب) کے اسرار کے بیان میں",
    "fa": "باب چهل و دوم در معرفت جوانمردی (الفتوة) و جوانمردان (الفتيان) و منازل و طبقات و اسرار اقطاب ایشان"
  },
  "content": {
    "ar": "### (الباب الثاني والأربعون في معرفة الفتوة والفتيان ومنازلهم وطبقاتهم وأسرار أقطابهم)\n\n\n> وفتيان صدق لا ملالة عندهم *** لهم قدم في كل فضل ومكرمة\n\n\n> مقسمة أحوالهم في جليسهم *** فهم بين توقير لقوم ومرحمه‏\n\n\n> وإن جاء كفؤ آثروه ببرهم *** ولا تلحق الفتيان في ذاك مندمة\n\n\n> لهم من خفايا العلم كل شعيرة *** وما هو موسوم لديهم بسمسمه‏\n\n\n> كنجل قسي والذي كان قبله *** ومن كان منهم ممن الله أعلمه‏\n\n\n> بذلك حاز والسبق في كل حلبة *** فليس يجيبون السفيه بلفظ مه‏\n\n\n> بميمنة خصوا تعالى مقامها *** وليس لها ضد يسمى بمشأمة\n\n\n> فكلتا يدي ربي يمين كريمة *** وإن كريم القوم من كان أكرمه‏\n\n\n> إذا خلع الولي على أهله ترى *** ملابسهم بين الملابس معلمه‏\n\n\n### [الفتوة مقام القوة]\n\n\nاعلم أن للفتوة مقام القوة وما خلق الله من الطبيعة أقوى من الهواء وخلق الإنسان أقوى من الهواء إذا كان مؤمنا كذا\n\n\nورد في الخبر النبوي عن الله تعالى مع الملائكة لما خلق الأرض وجعلت تميد الحديث بكماله وفي آخره يا رب فهل خلقت شيئا أشد من الريح قال نعم المؤمن يتصدق بيمينه ما تعرف بذلك شماله‏\n\n\nوقال تعالى إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ فنعت الرزاق بالقوة لوجود الكفران بالمنعم من المرزوقين فهو يرزقهم مع كفرهم به ولا يمنع عنهم الرزق والإنعام والإحسان بكفرهم مع أن الكفر بالنعم سبب مانع يمنع النعمة فلا يرزق الكافر مع وجود الكفر منه لما رزقه إلا من له القوة فلهذا نعته بذي القوة المتين فإن المتانة في القوة تضاعفها فما اكتفى سبحانه بالقوة حتى وصف نفسه بأنه المتين فيها إذ كانت لقوة لها طبقات في التمكن من القوي فوصف نفسه بالمتانة وهذه صفة أهل الفتوة فإن الفتوة ليس فيها شي‏ء من الضعف إذ هي حالة بين الطفولة والكهولة وهو عمر الإنسان من زمان بلوغه إلى تمام الأربعين من ولادته يقول الله تعالى في هذا المقام الله الَّذِي خَلَقَكُمْ من ضَعْفٍ ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً وذلك حال الفتوة وفيها يسمى فتى وما قرن معها شيئا من الضعف ثم قال سبحانه وتعالى ثُمَّ جَعَلَ من بَعْدِ قُوَّةٍ ضَعْفاً وشَيْبَةً يعني ضعف الكهولة إلى آخر العمر وشيبة يعني وقارا أي سكونا لضعفه عن الحركة فإن الوقار من الوقر وهو الثقل فقرن مع هذا الضعف الثاني الشيبة التي هي الوقار فإن الطفل وإن كان ضعيفا فإنه متحرك جدا واختلف في حركته هل هي من الطبيعة أو من الروح‏\n\n\nروى أن إبراهيم عليه السلام لما رأى الشيب قال يا رب ما هذا قال الوقار قال اللهم زدني وقارا\n\n\nفهذا حال الفتوة ومقامها وأصحابها يسمون الفتيان وهم الذين حازوا مكارم الأخلاق أجمعها ولا يتمكن لأحد أن يكون حاله مكارم الأخلاق ما لم يعلم المحال التي يصرفها فيها ويظهر بها فالفتيان أهل علم وافر وقد أفردنا لها بابا في داخل هذا الكتاب حين تكلمنا على المقامات والأحوال فمن ادعى الفتوة وليس عنده علم بما ذكرناه فدعواه كاذبة وهو سريع الفضيحة فلا ينبغي يسمى فتى إلا من علم مقادير الأكوان ومقدار الحضرة الإلهية فيعامل كل موجود على قدره من المعاملة ويقدم من ينبغي أن يقدم ويؤخر ما ينبغي أن يؤخر\n\n\n### [الأصل الذي ينبغي أن يعول عليه في الفتوة]\n\n\nوتفاصيل هذا المقام وحكم الطائفة فيه استوفيناه في رسالة الأخلاق التي كتبنا بها للفخر محمد بن عمر بن خطيب الري رحمه الله فلنذكر منها في هذا الباب الأصل الذي ينبغي أن يعول عليه وذلك أنه ليس في وسع الإنسان أن يسع العالم بمكارم أخلاقه إذ كان العالم كله واقفا مع غرضه أو إرادته لا مع ما ينبغي فلما اختلفت الأغراض والإرادات وطلب كل صاحب غرض أو إرادة من الفتى أن يعامله بحسب غرضه وإرادته والأغراض متضادة فيكون غرض زيد في عمر وأن يعادي خالدا ويكون غرض خالد في زيد أن يعادي عمرا أو غرضه أن يواليه ويحبه‏\nويوده فإن تفتي مع عمر وعادى خالد أو ذمه خالد وأثنى عليه زيد بالفتوة وكريم الخلق وإن لم يعاد خالدا ووالاه وأحبه أثنى عليه خالد وذمه زيد فلما رأينا أن الأمر على هذا الحد وأنه لا يعم ولم يتمكن عقلا ولا عادة أن يقوم الإنسان في هذه الدنيا أو حيث كان في مقام يرضى المتضادين انبغي للفتى أن يترك هوى نفسه ويرجع إلى خالقه الذي هو مولاه وسيده ويقول أنا عبد وينبغي للعبد أن يكون بحكم سيده لا بحكم نفسه ولا بحكم غير سيده يتبع مراضيه ويقف عند حدوده ومراسمه ولا يكن ممن جعل مع سيده شريكا في عموديته فيكون مع سيده بحسب ما يحد له ويتصرف فيما يرسم له ولا يبالي وافق أغراض العالم أو خالفهم فإن وافق ما وافق منها فذلك راجع إلى سيده فخرج له توقيع من ديوان سيده على يدي رسول قام الدليل له والعلم بأنه خرج إليه من عند سيده وأن ذلك التوقيع توقيع سيده فقام له إجلالا وأخذ توقيع سيده ومع التوقيع مشافهة فشافه العبيد بما أمره السيد أن يشافههم به وذلك هو الشرع المقرر والتوقيع هو الكتاب المنزل المسمى قرآنا والرسول هو جبريل عليه السلام وحاجب الباب الذي يصل إليه الرسول الملكي من عند الله بالتوقيع والمشافهة هو النبي المبشر محمد صلى الله عليه وسلم أو أي نبي كان من الأنبياء في زمان بعثتهم فلزم العبيد مراسم سيدهم التي ضمنها توقيعه والتي جاءت بها المشافهة فلم يكن لهم في نفوسهم ملك ولا تدبير\n\n\n### [الفتى هو الواقف عند مراسم سيده‏]\n\n\nفمن وقف عند حدود سيده وامتثل مراسيمه ولم يخالفه في شي‏ء مما جاءه به على حد ما رسم له من غير زيادة بقياس أو رأى ولا نقصان بتأويل فعامل جنسه من الناس بما أمر أن يعاملهم به من مؤمن وكافر وعاص ومنافق وما ثم إلا هؤلاء الأصناف الأربعة وكل صنف من هؤلاء على طبقات فالمؤمن منه طائع وعاص وولي ونبي ورسول وملك وحيوان ونبات ومعدن والكافر منه مشرك وغير مشرك والمنافق منه ينقص في الظاهر عن درك الكافر فإن المنافق له الدرك الأسفل من النار والكافر له الأعلى والأسفل وأما العاصي فينقص في الظاهر عن درجة المؤمن المطيع بقدر معصيته فهذا الواقف عند مراسم سيده هو الفتى فكل إنسان لا بد أن يكون جليسا لأكبر منه أو أصغر منه أو مكافئا له إما في السن وإما في الرتبة أو فيهما فالفتى من وقر الكبير في العلم أو في السن والفتى من رحم الصغير في العلم أو في السن والفتى من آثر المكافئ في السن أو في العلم ولست أعني بقولي في العلم إلا المرتبة خاصة فأتينا بالعلم لشرفه فإن الملك قد يكون صغيرا في السن صغيرا في العلم ويكون شخص من رعيته كبيرا في السن كبيرا في العلم فإن عرف الملك قدر ما رسم له الحق في شرعه من توقير الكبير وشرف العلم عامله الملك بذلك وإن لم يفعل فيكون الملك سيئ الملكة فينبغي للفتى أن يعرف شرف المرتبة التي هي السلطنة وأنه نائب الله في عباده وخليفته في بلاده فيعامل من أقامه الله فيها وإن لم يجر الحق على يده بما ينبغي للمرتبة من السمع والطاعة في المنشط والمكره على حد ما رسم له سيده وما هو عليه مما أقام الله ذلك السلطان فيه من الأخلاق المحمودة أو المذمومة في الجور والعدل فينبغي للفتى أن يوفي السلطان حقه الذي أوجبه الله له عليه ولا يطلب منه حقه الذي جعله الله له قبل السلطان مما له أن يسامحه فيه إن منعه منه فتوة عليه ورحمة به وتعظيما لمنزلته إذ كان له أن يطلبه به يوم القيامة فالفتى من لا خصم له لأنه فيما عليه يؤديه وفيما له يتركه فليس له خصم فالفتى من لا تصدر منه حركة عبثا جملة واحدة ومعنى هذا أن الله سمعه يقول وما خَلَقْنَا السَّماءَ والْأَرْضَ وما بَيْنَهُما باطِلًا وهذه الحركة الصادرة من الفتى مما بينهما وكذلك حركة كل متحرك خلقه الله بين السماء والأرض فما هي عبث فإن الخالق حكيم فالفتى من يتحرك أو يسكن لحكمة في نفسه ومن كان هذا حاله في حركاته فلا تكون حركته عبثا لا في يده ولا في رجله ولا شمه ولا أكله ولا لمسه ولا سمعه ولا بصره ولا باطنه فيعلم كل نفس فيه وما ينبغي له وما حكم سيده فيه ومثل هذا لا يكون عبثا وإذا كانت الحركة من غيره فلا ينظرها عبثا فإن الله خلقها أي قدرها وإذا قدرها فما تكون عبثا ولا باطلا فيكون حاضرا مع هذا عند وقوعها في العالم فإن فتح له بالعلم في الحكمة فيها فبخ على بخ وهو صاحب عناية وإن لم يفتح له في العلم بالحكمة فيها فيكفيه حضوره في نفسه إنها حركة مقدرة منسوبة إلى الله وأن الله فيها سرا يعلمه الله فيؤديه هذا القدر من العلم إلى الأدب الإلهي‏\n\n\n### [الفتيان والملامتية]\n\n\nوهذا لا يكون إلا للفتيان أصحاب القوة الحاكمين على طبائع النفوس والعادات ولا يكون في هذا المقام من هذه الطائفة إلا الملامية فإن الله قد ولاهم على نفوسهم وأيدهم بروح منه عليها فلهم التصريف التام والكلمة الماضية والحكم الغالب‏\nفهم السلاطين في صور العبيد يعرفهم الملأ الأعلى فليس أحد مما سوى الإنس والجان إلا ويقول بفضله إلا بعض الثقلين فإن الحسد يمنعهم من ذلك‏\n\n\n### [طبقات الفتيان ومنزلتهم‏]\n\n\nفطبقات الفتيان هو ما ذكرناه من يعلم منهم علم الله في الحركات ومن لا يعلم علم الله في ذلك على التعيين وإن علم إن ثم أمرا لم يطلعه الله عليه وأما منزلتهم فهو الذي قلنا في أول الباب في قوله ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً وينظر إلى هذا الإيجاد من الحقائق الإلهية الآية لأخرى وهي قوله إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ فهم يعاملون الخلق بالإحسان إليهم مع إساءتهم لهم كإعطاء الله الرزق للمرزوقين الكافرين بالله ونعمه فلهم القوة العظمى على نفوسهم حيث لم يغلبهم هواهم ولا ما جبلت النفس عليه من حب الثناء والشكر والاعتراف‏\n\n\n### [فتوة إبراهيم ع‏]\n\n\nقال تعالى حاكيا سَمِعْنا فَتًى يَذْكُرُهُمْ يُقالُ لَهُ إِبْراهِيمُ فأطلق الله على ألسنتهم فتوة إبراهيم بلسانهم لما كانت الفتوة بهذه المثابة لأنه قام في الله حق القيام ولما أحالهم على الكبير من الأصنام على نية طلب السلامة منهم فإنه قال لهم فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ يريد توبيخهم ولهذا رجعوا إلى أنفسهم وهو قوله تعالى وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ في كل حال وإنما سمي ذلك كذبا لإضافة الفعل في عالم الألفاظ إلى كبيرهم والكبير الله على الحقيقة والله هو الفاعل المكسر للأصنام بيد إبراهيم فإنه يده التي يبطش بها كذا أخبر عن نفسه فكسر هذه الأصنام التي زعموا أنها آلهة لهم أ لا ترى المشركين يقولون فيهم ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فاعترفوا إن ثم إلها كبيرا أكبر من هؤلاء كما هو أحسن الخالقين وأرحم الراحمين فهذا الذي قاله إبراهيم عليه السلام صحيح في عقد إبراهيم عليه السلام وإنما أخطأ المشركون حيث لم يفهموا عن إبراهيم ما أراد بقوله بَلْ فَعَلَهُ كَبِيرُهُمْ فكان قصد إبراهيم بكبيرهم الله تعالى وإقامة الحجة عليهم وهو موجود في الاعتقادين وكونهم آلهة ذلك على زعمهم والوقف عليه حسن عندنا تام وابتدأ إبراهيم بقوله هذا قولي فالخبر محذوف يدل عليه مساق القصة فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ فهم يخبرونكم ولو نطقت الأصنام في ذلك الوقت لنسبت الفعل إلى الله لا إلى إبراهيم فإنه مقرر عند أهل الكشف من أهل طريقنا إن الجماد والنبات والحيوان قد فطرهم الله على معرفته وتسبيحه بحمده فلا يرون فاعلا إلا الله ومن كان هذا في فطرته كيف ينسب الفعل لغير الله فكان إبراهيم على بينة من ربه في الأصنام أنهم لو نطقوا لأضافوا الفعل إلى الله لأنه ما قال لهم سلوهم إلا في معرض الدلالة سواء نطقوا أو سكتوا فإن لم ينطقوا يقول لهم لم تعبدون ما لا يسمع ولا يبصر ولا يغني عنكم من الله شيئا ولا عن نفسه ولو نطقوا لقالوا إن الله قطعنا قطعا لا يتمكن في الدلالة أن تقول الأصنام غير هذا فإنها لو قالت الصنم الكبير فعل ذلك بنا لكذبت ويكون تقريرا من الله بكفرهم وردا على إبراهيم عليه السلام فإن الكبير ما قطعهم جذاذا ولو قالوا في إبراهيم إنه قطعنا لصدقوا في الإضافة إلى إبراهيم ولم تلزم الدلالة بنطقهم على وحدانية الله ببقاء الكبير فيبطل كون إبراهيم قصد الدلالة فلم تقع ولم يصدق وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ فكانت له الدلالة في نطقهم لو نطقوا كما قررنا وفي عدم نطقهم لو لم ينطقوا ومثل هذا ينبغي أن يكون قصد الأنبياء عليهم السلام فهم العلماء صلوات الله عليهم ولهذا رجعوا إلى أنفسهم فقالوا إِنَّكُمْ أَنْتُمُ الظَّالِمُونَ ثُمَّ نُكِسُوا عَلى‏ رُؤُسِهِمْ لَقَدْ عَلِمْتَ ما هؤُلاءِ يَنْطِقُونَ فقال الله لمثل هؤلاء أَ تَعْبُدُونَ ما تَنْحِتُونَ فكان من فتوته إن باع نفسه في حق أحدية خالقه لا في حق خالقه لأن الشريك ما ينفي وجود الخالق وإنما يتوجه على نفي الأحدية فلا يقوم في هذا المقام إلا من له القطبية في الفتوة بحيث يدور عليه مقامها\n\n\n### [فتوة فتى موسى ع‏]\n\n\nومن الفتوة قوله تعالى وإذ قال موسى لفتاه فأطلق عليه باللسان العبراني معنى يعبر عنه في اللسان العربي بالفتى وكان في خدمة موسى عليه السلام وكان موسى في ذلك الوقت حاجب الباب فإنه الشارع في تلك الأمة ورسولها ولكل أمة باب خاص إلهي شارعهم هو حاجب ذلك الباب الذي يدخلون منه على الله تعالى ومحمد صلى الله عليه وسلم هو حاجب الحجاب لعموم رسالته دون سائر الأنبياء عليهم السلام فهم حجبته صلى الله عليه وسلم من آدم عليه السلام إلى آخر نبي ورسول‏\n\n\n### [الأنبياء حجبة النبي محمد صَلَّى اللهُ عَليهِ وسَلَّم قبل زمان بعثته‏]\n\n\nوإنما قلنا إنهم حجبته‏\n\n\nلقوله صلى الله عليه وسلم آدم فمن دونه تحت لوائي‏\n\n\nفهم نوابه في عالم الخلق وهو روح مجرد عارف بذلك قبل نشأة جسمه‏\n\n\nقيل له متى كنت نبيا فقال كنت نبيا وآدم بين الماء والطين‏\n\n\nأي لم يوجد آدم بعد إلى أن وصل زمان ظهور جسده المطهر صلى الله عليه وسلم فلم يبق حكم لنائب من نوابه من سائر الحجاب الإلهيين وهم الرسل‏\nوالأنبياء عليهم السلام إلا عنت وجوههم لقيومية مقامه إذ كان حاجب الحجاب فقرر من شرعهم ما شاءه بإذن سيده ومرسله ورفع من شرعهم وأمر يرفعه ونسخه فربما قال من لا علم له بهذا الأمر إن موسى عليه السلام كان مستقلا مثل محمد بشرعه‏\n\n\nفقال رسول الله صلى الله عليه وسلم لو كان موسى حيا ما وسعه إلا أن يتبعني‏\n\n\nوصدق صلى الله عليه وسلم‏\n\n\n### [الفتى هو في منزل التسخير أبدا]\n\n\nفالفتى أبدا في منزل التسخير كما\n\n\nقال عليه السلام خادم القوم سيدهم‏\n\n\nفمن كانت خدمته سيادته كان عبدا محضا خالصا وتفضل الفتيان بعضهم على بعض بحسب المفتى عليه من المنزلة عند الله بوجه ومن الضعف بوجه فأعلاهم من تفتي على الأضعف من ذلك الوجه وأعلاهم أيضا من تفتي على الأعلى عند الله من ذلك الوجه الآخر فالمتفتي على الأضعف كصاحب السفرة وهو الشخص الذي أمره شيخه أن يقرب السفرة إلى الأضياف فأبطأ عليهم من أجل النمل الذي كان فيها فلم ير من الفتوة أن ينفض النمل من السفرة فإن من الفتوة أن يصرفها في الحيوان فوقف إلى أن خرجت النمل من السفرة من ذاتها من غير أن يكون لهذا الشخص في إخراج النمل تعمل قهري فإن الفتيان لهم الفتوة وليس لهم القهر إلا على نفوسهم خاصة ومن لا قوة له لا فتوة له كما أنه من لا قدرة له لا حلم له فقال له الشيخ لقد دققت فهذه مراعاة الأضعف لكنه ما تفتي مع الأضياف حيث أبطأ عن المبادرة إلى كرامتهم فلهذا ربطنا في أول الباب أنه لا يتمكن لأحد إرسال المكارم في العموم لاختلاف لأغراض فينظر الفتى في حق الشخصين المختلفي الأغراض اللذين إذا أرضى الواحد منهما أسخط الآخر وصورة نظره في حق الشخصين أيهما أقرب إلى حكم الوقت والحال في الشرع فالذي هو أقرب إلى حكم الوقت والحال في الشرع صرف الفتوة معه فإن اتسع الوقت إلى أن يتفتى مع الآخر بوجه يرضى الله فعل أيضا وإن لم يتسع فقد وفي المقام حقه وكان من الفتيان بلا شك وإن كان في رتبة الفعل بالهمة والفعل بالحس فعل الفتوة مع الواحد حسا ومع الآخر بالهمة\n\n\n### [الفتى، أبدا، يقابل الخلق على وجه الحق‏]\n\n\nدخل رجل على شيخنا أبي العباس العريبي وأنا عنده فتفاوضا في إيصال معروف فقال الرجل يا سيدنا الأقربون أولى بالمعروف فقال الشيخ من غير توقف إلى الله وأخبرني أبو عبد الله محمد بن القاسم ابن عبد الكريم التميمي الفاسى قال مخبرا عن أبي عبد الله الدقاق كان بمدينة فاس وتذاكروا الفعل بالهمة فقال أبو عبد الله الدقاق فزت بواحدة مالي فيها شريك ما اغتبت أحدا قط ولا اغتبت أحد بحضرتي قط فهذا من الفعل بالهمة حيث تفتي على من عادته أن يغتاب فيكتسب الأوزار أن لا يقدر على الغيبة في مجلسه بحضوره من غير أن يكون من الشيخ نهي له عن ذلك وتفتي أيضا على الذي يذكر بما يكره بحضوره بأنه لا يذكر في فيه بما يكره وكان سيد وقته في هذا الباب خرج مناقبه شيخنا أبو عبد الله بن عبد الكريم المذكور آنفا في كتاب المستفاد في ذكر الصالحين والعباد بمدينة فاس وما يليها من البلاد فقد علمت على الحقيقة أن الفتى من بذلك وسعه واستطاعته في معاملة الخلق على الوجه الذي يرضي الحق والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "### (Chapter Forty-Two: Concerning the Knowledge of Spiritual Chivalry [al-Futuwwa], the Chivalrous Ones [al-Fityān], their Stations, their Ranks, and the Secrets of their Poles [Aqṭāb])\n\nAnd Chivalrous Ones (*Fityān*) of truth, who know no weariness,\nThey have a firm footing in every virtue and noble deed.\n\nTheir spiritual states (*aḥwāl*) are distributed among their companions,\nSo they are between reverence for some people and mercy for others.\n\nAnd if an equal comes, they prefer him with their kindness,\nAnd no regret attaches to the Chivalrous Ones (*Fityān*) in that.\n\nThey possess every subtle principle (*shaʿīra*) from the hidden sciences (*khfāyā al-ʿilm*),\nAnd nothing is marked with insignificance (*sismsima*) in their view.\n\nLike the son of Qusayy and he who was before him,\nAnd whoever among them whom Allah has granted knowledge.\n\nBy this, he attained precedence and victory in every arena,\nFor they do not answer the fool with the word 'Hush.'\n\nThey are singled out by the Right Hand (*Maymana*), exalted is its station,\nAnd it has no opposite called the Left Hand (*Mash'ama*).\n\nFor both hands of my Lord are a noble Right Hand (*Yamīn Karīma*),\nAnd the noble one among people is he who is the most generous.\n\nWhen the Friend of God (*al-Walī*) bestows robes upon his people, you see\nTheir garments distinguished among all other garments.\n\n### [Spiritual Chivalry is the Station of Strength]\n\nKnow that Spiritual Chivalry (*al-Futuwwa*) is the station of Strength (*al-Qūwa*). Nothing created by God from nature is stronger than air, and the human being is created stronger than air if he is a believer. This is mentioned in the Prophetic narration concerning Allah the Exalted and the angels when He created the earth and it began to shake—the complete narration—at the end of which [Allah says]: \"O Lord, have You created anything stronger than the wind?\" He said, \"Yes, the believer who gives charity with his right hand such that his left hand does not know of it.\"\n\nAnd the Exalted said: <<إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ>> (Indeed, Allah is the Provider, the Possessor of Strength, the Firm). He described the Provider (*al-Razzāq*) with Strength (*al-Qūwa*) due to the existence of ingratitude toward the Benefactor from those who are provided for. He provides for them despite their disbelief in Him, and He does not withhold sustenance, bounty, or kindness from them because of their disbelief, even though ingratitude for blessings is a preventative cause that should withhold the blessing. Thus, no one provides for the disbeliever, despite his disbelief, except the One who possesses Strength (*al-Qūwa*). For this reason, He described Himself as the Possessor of Strength, the Firm (*Dhū al-Qūwa al-Matīn*). Firmness (*al-Matāna*) in strength multiplies it, so the Glorified was not satisfied with mere Strength until He described Himself as Firm in it, since strength has degrees in the ability of the Strong One. Thus, He described Himself with Firmness.\n\nThis is the attribute of the people of Spiritual Chivalry (*al-Futuwwa*), for *Futuwwa* contains nothing of weakness, as it is the state between childhood (*al-Ṭufūla*) and maturity (*al-Kuhūla*). It is the age of a person from the time of his puberty until the completion of forty years from his birth. Allah the Exalted speaks of this station: <<الله الَّذِي خَلَقَكُمْ من ضَعْفٍ ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً>> (Allah is the One who created you from weakness, then made after weakness strength). That is the state of *Futuwwa*, and in it, he is called a *Fatā* (Chivalrous One), and no weakness is coupled with it. Then the Glorified and Exalted said: <<ثُمَّ جَعَلَ من بَعْدِ قُوَّةٍ ضَعْفاً وشَيْبَةً>> (Then made after strength weakness and gray hair). Meaning the weakness of maturity until the end of life, and gray hair (*shayba*) means dignity (*waqār*), that is, stillness due to his weakness in movement. For dignity (*waqār*) comes from *waqr*, which is heaviness. He coupled this second weakness with gray hair, which is dignity, for the child, though weak, is extremely active. Scholars have differed as to whether his movement is from nature or from the spirit.\n\nIt is narrated that when Abraham (peace be upon him) saw gray hair, he said, \"O Lord, what is this?\" He said, \"Dignity.\" Abraham said, \"O Allah, increase me in dignity.\"\n\nThis is the state and station of Spiritual Chivalry, and its adherents are called the Chivalrous Ones (*al-Fityān*). They are those who have attained all noble character (*makārim al-akhlāq*). No one can maintain the state of noble character unless he knows the contexts in which he should apply and manifest them. Thus, the Chivalrous Ones are people of abundant knowledge (*ʿilm wāfir*). We have dedicated a chapter to this within this book when we discussed the stations (*maqāmāt*) and states (*aḥwāl*). Whoever claims Spiritual Chivalry but lacks knowledge of what we have mentioned, his claim is false, and he is quickly exposed. Therefore, no one should be called a *Fatā* except one who knows the measures of the cosmos (*maqādīr al-akwān*) and the measure of the Divine Presence (*al-Ḥaḍra al-Ilāhiyya*), so that he treats every existent thing according to its due measure of interaction, advancing what should be advanced and delaying what should be delayed.\n\n### [The Fundamental Principle upon which Spiritual Chivalry Must Rely]\n\nThe details of this station and the rulings of this group concerning it were fully covered in the Treatise on Ethics (*Risālat al-Akhlāq*) which we wrote for Fakhr Muḥammad ibn ʿUmar ibn Khaṭīb al-Rayy, may Allah have mercy on him. We shall mention here only the fundamental principle upon which reliance must be placed.\n\nIt is not within the capacity of a human being to encompass the entire world with his noble character, because the whole world stands upon its own aims (*gharaḍ*) or intentions (*irāda*), not upon what is proper. Since aims and intentions differ, and every person with an aim or intention demands that the *Fatā* treat him according to his aim and intention, and these aims are contradictory—for example, Zayd’s aim regarding ʿAmr is that the *Fatā* should oppose Khālid, and Khālid’s aim regarding Zayd is that the *Fatā* should oppose ʿAmr, or his aim is that the *Fatā* should support and love him. If the *Fatā* shows chivalry toward ʿAmr and opposes Khālid, Khālid will condemn him, while Zayd will praise him for his *Futuwwa* and noble character. If he does not oppose Khālid but supports and loves him, Khālid will praise him, and Zayd will condemn him.\n\nSince we have seen that the matter is of this nature, and that it cannot be universally applied, and it is neither logically nor customarily possible for a person in this world, or wherever he may be, to stand in a station that satisfies two opposing parties, the *Fatā* must abandon his own ego's desire (*hawā nafsih*) and return to his Creator (*Khāliq*), who is his Master (*Mawlā*) and Lord (*Sayyid*). He says, \"I am a servant (*ʿabd*),\" and a servant must be governed by the rule of his Lord, not by his own rule nor by the rule of anyone other than his Lord. He follows His pleasures and stands at His limits and rituals (*marāsim*). He is not one who sets up a partner with his Lord in His servitude. Thus, he is with his Lord according to what He defines for him, and he acts according to what He prescribes for him, without caring whether he agrees with the aims of the world or opposes them.\n\nIf he agrees with any of those aims, that agreement is referred back to his Lord. A decree (*tawqīʿ*) has been issued to him from the chancery of his Lord, delivered by a Messenger for whom the proof and knowledge established that it came to him from his Lord, and that the decree is the decree of his Lord. So he stands in reverence for it and takes the decree of his Lord. Along with the decree is a direct address (*mushāfaha*), so he addresses the servants with what the Lord commanded him to address them with. That is the established Law (*al-Sharʿ al-Muqarrar*). The decree is the revealed Book called the Qur'an, and the Messenger is Gabriel (peace be upon him). The Gatekeeper (*Ḥājib al-Bāb*) through whom the angelic Messenger reaches [humanity] from God with the decree and the direct address is the Prophet Muhammad (peace and blessings of Allah be upon him), or any prophet among the prophets during the time of their mission.\n\nThe servants are therefore bound by the rituals of their Lord, which are contained in His decree and brought by the direct address. They possess no ownership or management over their own souls.\n\n### [The Chivalrous One is He Who Stands at the Rituals of His Lord]\n\nWhoever stands at the limits of his Lord and fulfills His rituals, and does not oppose Him in anything that came to him, exactly as prescribed—without addition by analogy or opinion, and without subtraction by interpretation—and deals with his fellow human beings as he was commanded to deal with them, whether they are believers, disbelievers, sinners, or hypocrites (for there are only these four categories, and each category has ranks: the believer includes the obedient, the sinner, the saint, the prophet, the messenger, the angel, the animal, the plant, and the mineral; the disbeliever includes the polytheist and the non-polytheist; the hypocrite is outwardly lower than the rank of the disbeliever, for the hypocrite is in the lowest pit of the Fire, while the disbeliever has the highest and the lowest; and the sinner is outwardly lower than the degree of the obedient believer by the measure of his sin)—this one, who stands at the rituals of his Lord, is the *Fatā*.\n\nEvery person must have a companion who is either older than him, younger than him, or his equal, either in age or in rank, or both. The *Fatā* is he who reveres the elder in knowledge or in age. The *Fatā* is he who shows mercy to the younger in knowledge or in age. The *Fatā* is he who prefers the equal in age or in knowledge. By \"in knowledge,\" I mean rank specifically, and we mention knowledge due to its nobility. For the king may be young in age and young in knowledge, while a person among his subjects may be old in age and great in knowledge. If the king knows the measure of what the Real (*al-Ḥaqq*) has prescribed for him in His Law concerning the reverence of the elder and the nobility of knowledge, the king will treat him accordingly. If he does not, the king is a poor ruler.\n\nThe *Fatā* must know the nobility of the rank of sovereignty, and that the sovereign is God's deputy among His servants and His vicegerent in His lands. He treats the one whom God has established in that position with the obedience and hearing due to that rank, in ease and hardship, according to what his Lord prescribed for him, regardless of the praiseworthy or blameworthy character traits of that sovereign, whether in tyranny or justice. The *Fatā* must fulfill the sovereign's right that God has made obligatory upon him, and he does not demand his own right that God established for him against the sovereign, which he has the option to forgive. He forgives it out of Spiritual Chivalry toward the sovereign, mercy for him, and reverence for his station, knowing that he has the right to demand it on the Day of Resurrection.\n\nThe *Fatā* is one who has no adversary (*khaṣm*), because he performs his duties and relinquishes his rights. Thus, he has no adversary.\n\nThe *Fatā* is one from whom no movement issues in vain (*ʿabathan*) whatsoever. The meaning of this is that God heard him say: <<وما خَلَقْنَا السَّماءَ والْأَرْضَ وما بَيْنَهُما باطِلًا>> (And We did not create the heaven and the earth and what is between them in vain). This movement issuing from the *Fatā* is among what is between them, as is the movement of every moving thing God created between heaven and earth. It is not in vain, for the Creator is Wise. The *Fatā* is he who moves or rests for a wisdom within himself. One whose state is this in his movements will not have his movement be in vain—neither in his hand, nor his foot, nor his smelling, nor his eating, nor his touching, nor his hearing, nor his sight, nor his inner being. He knows every breath within himself, what is proper for it, and the ruling of his Lord concerning it. Such a thing cannot be in vain.\n\nAnd if the movement is from someone else, he does not view it as vain, for God created it—that is, He decreed it. If He decreed it, it cannot be vain or false. Thus, he is present with this awareness when the action occurs in the world. If he is granted knowledge (*ʿilm*) of the wisdom (*ḥikma*) in it, then bravo! He is a person of Divine Care (*ʿināya*). If he is not granted knowledge of the wisdom in it, it suffices him to be inwardly present with the fact that it is a decreed movement attributed to God, and that God has a secret in it which He knows. This measure of knowledge leads him to Divine Adab (proper conduct).\n\n### [The Chivalrous Ones and the Malamatiyya]\n\nThis state belongs only to the Chivalrous Ones (*al-Fityān*), the possessors of Strength (*al-Qūwa*) who rule over the natures of the souls and habits. No one is in this station among this group except the Malamatiyya (Those of Blame), for God has appointed them over their own souls and supported them with a spirit from Him over it. They possess complete disposal (*taṣrīf*), the decisive word, and the dominant judgment.\n\nThey are the Sultans in the guise of servants. The Highest Assembly (*al-Mala' al-Aʿlā*) recognizes them, and there is no being other than humans and jinn that does not speak of their virtue, except for some of the two weighty kinds [humans and jinn], for envy prevents them from doing so.\n\n### [The Ranks and Station of the Chivalrous Ones]\n\nThe ranks of the Chivalrous Ones are what we mentioned: those who know God's knowledge concerning movements, and those who do not know God's knowledge concerning that specifically, though they know that there is a command that God has not disclosed to them.\n\nAs for their station (*manzila*), it is what we mentioned at the beginning of the chapter in His saying: <<ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً>> (Then made after weakness strength). This creation from the Divine Realities is viewed alongside another verse, which is His saying: <<إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ>> (Indeed, Allah is the Provider, the Possessor of Strength, the Firm). They treat creation with kindness (*iḥsān*) despite the creation's ill-treatment of them, just as God gives sustenance to the recipients who disbelieve in God and His blessings. They possess the greatest strength over their own souls, such that their desires (*hawāhum*) do not overcome them, nor does what the soul is naturally disposed to, such as the love of praise, gratitude, and recognition.\n\n### [The Spiritual Chivalry of Abraham (peace be upon him)]\n\nThe Exalted said, relating their words: <<سَمِعْنا فَتًى يَذْكُرُهُمْ يُقالُ لَهُ إِبْراهِيمُ>> (We heard a youth [fatā] mentioning them, called Abraham). God allowed them to utter the Spiritual Chivalry (*Futuwwa*) of Abraham with their own tongues, because *Futuwwa* is of this caliber, for he stood up for God with true standing.\n\nWhen he referred them to the chief of the idols, it was with the intention of seeking safety from them, for he said to them: <<فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ>> (So ask them, if they can speak). He intended to rebuke them, which is why they returned to their own souls. This is His saying, the Exalted: <<وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ>> (And that was Our argument which We gave Abraham against his people) in every situation.\n\nThat statement was only called a lie because the attribution of the act in the world of words was made to their chief, while the Chief (*al-Kabīr*) is Allah in reality, and Allah is the Agent who broke the idols by the hand of Abraham, for He informed us that [Abraham's hand] was His hand by which He strikes. Thus, He broke these idols which they claimed were their deities. Do you not see the polytheists saying about them: <<ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏>> (We only worship them that they may bring us nearer to Allah in proximity)? They admitted that there is a great God, greater than these, just as He is the Best of Creators and the Most Merciful of the Merciful.\n\nTherefore, what Abraham (peace be upon him) said was correct according to Abraham's conviction. The polytheists only erred because they did not understand what Abraham intended by his saying: <<بَلْ فَعَلَهُ كَبِيرُهُمْ>> (Rather, their chief did it). Abraham's intention by \"their chief\" was Allah the Exalted, and to establish the proof (*ḥujja*) against them. This proof exists in both beliefs: their belief that they were deities (according to their claim), and the fact that the pause [in the recitation of the verse] is complete and good according to us. Abraham began by implying, \"This is my saying,\" the predicate being omitted, indicated by the context of the story: <<فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ>> (So ask them, if they can speak). They will inform you.\n\nHad the idols spoken at that time, they would have attributed the action to God, not to Abraham. It is established among the People of Unveiling (*Ahl al-Kashf*) from our path that inanimate objects, plants, and animals are naturally disposed by God to know Him and glorify Him with His praise. They see no agent but Allah. How could one whose nature is this attribute the action to other than God?\n\nAbraham was certain from his Lord concerning the idols that if they spoke, they would attribute the action to God, because he only told them to ask them in the context of establishing the proof, whether they spoke or remained silent. If they did not speak, he would say to them, \"Why do you worship what neither hears nor sees nor avails you anything against God, nor avails itself?\" If they had spoken, they would have said, \"God cut us into pieces.\" It is not possible for the idols to say anything other than this in establishing the proof. For if they had said, \"The great idol did this to us,\" they would have lied, and it would have been a confirmation from God of their disbelief and a refutation of Abraham (peace be upon him), for the great idol did not cut them into pieces. And if they had said that Abraham cut them, they would have been truthful in attributing the action to Abraham, but the proof of God's Oneness would not have been established by their speaking while the great idol remained, thus invalidating Abraham's intention to establish the proof, and it would not have been fulfilled or truthful. <<وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ>> (And that was Our argument which We gave Abraham against his people). Thus, the proof was his, whether they spoke, as we established, or whether they did not speak. The intention of the Prophets (peace be upon them) must be of this nature, for they are the knowledgeable ones, peace and blessings of Allah be upon them.\n\nFor this reason, they returned to their own souls and said: <<إِنَّكُمْ أَنْتُمُ الظَّالِمُونَ ثُمَّ نُكِسُوا عَلى‏ رُؤُسِهِمْ لَقَدْ عَلِمْتَ ما هؤُلاءِ يَنْطِقُونَ>> (Indeed, you are the wrongdoers. Then they were turned back on their heads [saying], \"You certainly know that these do not speak\"). Then God said to people like them: <<أَ تَعْبُدُونَ ما تَنْحِتُونَ>> (Do you worship what you carve?).\n\nIt was part of his Spiritual Chivalry (*Futuwwa*) that he sold his soul for the sake of the Oneness (*Aḥadiyya*) of his Creator, not merely for the existence of his Creator, because partnership (*shirk*) does not negate the existence of the Creator, but rather targets the negation of Oneness. Therefore, no one stands in this station except one who possesses the Pole (*Quṭbiyya*) of *Futuwwa*, such that its station revolves around him.\n\n### [The Spiritual Chivalry of Moses' Youth]\n\nAlso from Spiritual Chivalry is His saying, the Exalted: <<وإذ قال موسى لفتاه>> (And when Moses said to his youth [fatā]). He applied to him, in the Hebrew tongue, a meaning that is expressed in the Arabic tongue as *al-Fatā*. He was in the service of Moses (peace be upon him). Moses at that time was the Gatekeeper (*Ḥājib al-Bāb*), for he was the Lawgiver (*al-Shāriʿ*) for that nation and their Messenger. Every nation has a specific Divine Gate, and their Lawgiver is the Gatekeeper of that Gate through which they enter upon Allah the Exalted.\n\nMuhammad (peace and blessings of Allah be upon him) is the Gatekeeper of the Veil (*Ḥājib al-Ḥijāb*) due to the universality of his message, unlike the rest of the Prophets (peace be upon them). They are his gatekeepers, from Adam (peace be upon him) to the last prophet and messenger.\n\n### [The Prophets are the Gatekeepers of the Prophet Muhammad (PBUH) before the Time of His Mission]\n\nWe only said that they are his gatekeepers because of his saying (peace and blessings of Allah be upon him): \"Adam and all those below him are under my banner.\" They are his deputies (*nuwwāb*) in the world of creation, and he is a pure spirit who knew this before the formation of his body.\n\nHe was asked, \"When were you a Prophet?\" He replied, \"I was a Prophet while Adam was between water and clay.\"\n\nThat is, Adam had not yet come into existence until the time of the manifestation of his purified body (peace and blessings of Allah be upon him). The ruling of any of his deputies among the other Divine Gatekeepers—who are the Messengers and Prophets (peace be upon them)—remained only until their faces bowed before the Self-Subsistence (*Qayyūmiyya*) of his station, since he was the Gatekeeper of the Veil. He confirmed whatever he wished of their Law (*Sharʿ*) by the permission of his Lord and Sender, and he abrogated and commanded the abrogation of whatever he wished of their Law.\n\nPerhaps one who lacks knowledge of this matter might say that Moses (peace be upon him) was independent with his Law, just like Muhammad.\n\nBut the Messenger of Allah (peace and blessings of Allah be upon him) said: \"Had Moses been alive, he would have had no choice but to follow me.\" And he spoke the truth (peace and blessings of Allah be upon him).\n\n### [The Chivalrous One is Always in the Station of Subservience]\n\nThe *Fatā* is always in the station of subservience (*tasḫīr*), as the Prophet (peace be upon him) said: \"The servant of the people is their master.\"\n\nWhoever finds his service to be his mastery is a pure, sincere servant (*ʿabd maḥḍ khāliṣ*). The Chivalrous Ones excel one another according to the one toward whom the *Futuwwa* is directed: by the measure of his station with God in one respect, and by the measure of his weakness in another respect. The highest among them is he who directs his *Futuwwa* toward the weakest in that respect, and the highest among them is also he who directs his *Futuwwa* toward the highest in God's sight in that other respect.\n\nThe one who directs his *Futuwwa* toward the weakest is like the man with the dining tray (*ṣāḥib al-sufra*), who was ordered by his Shaykh to bring the tray to the guests. He delayed because of the ants that were on it. He did not see it as *Futuwwa* to shake the ants off the tray, for it is part of *Futuwwa* to direct it toward the animal. So he waited until the ants left the tray on their own, without this person using any coercive action to remove them. For the Chivalrous Ones possess *Futuwwa*, but they possess coercion (*qahr*) only over their own souls specifically. And whoever lacks strength (*qūwa*) lacks *Futuwwa*. The Shaykh said to him, \"You have been subtle (*daqqaqta*).\" This is consideration for the weakest.\n\nHowever, he failed to show *Futuwwa* toward the guests by delaying the promptness of their hospitality. For this reason, we established at the beginning of the chapter that no one can universally apply noble character due to the difference in aims.\n\nThe *Fatā* must look at the case of the two persons with conflicting aims—if he pleases one, he displeases the other—and determine which of the two is closer to the ruling of the time and the state in the Sacred Law (*Sharʿ*). The one who is closer to the ruling of the time and the state in the Law is the one toward whom he directs his *Futuwwa*. If time allows him to show *Futuwwa* toward the other in a way that pleases God, he does that too. If time does not allow, he has fulfilled the right of the station and is undoubtedly one of the Chivalrous Ones. Even if the action is performed by spiritual resolve (*himma*) rather than physical action (*ḥiss*), he performs the *Futuwwa* physically with one and by spiritual resolve with the other.\n\n### [The Chivalrous One Always Confronts Creation According to the Face of the Real]\n\nA man entered upon our Shaykh, Abū al-ʿAbbās al-ʿUraybī, while I was with him, and they were discussing the delivery of kindness (*maʿrūf*). The man said, \"O our master, the nearest are more deserving of kindness (*al-aqrabūn awlā bi-l-maʿrūf*).\" The Shaykh replied without hesitation, \"To Allah.\"\n\nAbū ʿAbd Allāh Muḥammad ibn al-Qāsim ibn ʿAbd al-Karīm al-Tamīmī al-Fāsī informed me, relating from Abū ʿAbd Allāh al-Daqqāq, who was in the city of Fez. They were discussing action by spiritual resolve (*al-fiʿl bi-l-himma*). Abū ʿAbd Allāh al-Daqqāq said, \"I have won one thing in which I have no partner: I have never backbitten anyone, nor has anyone ever backbitten in my presence.\" This is action by spiritual resolve, where he directs his *Futuwwa* toward the one whose habit is backbiting, so that he is unable to commit sins by backbiting in his presence, without the Shaykh having explicitly forbidden him from it. He also showed *Futuwwa* toward the one who is mentioned with what he dislikes in his presence, by ensuring that he is not mentioned with what he dislikes. He was the master of his time in this chapter. His virtues were compiled by our Shaykh, Abū ʿAbd Allāh ibn ʿAbd al-Karīm, mentioned above, in the book *Al-Mustafād fī Dhikr al-Ṣāliḥīn wa-l-ʿAbbād* (The Benefited in Mentioning the Righteous and the Worshippers) in the city of Fez and the surrounding lands.\n\nYou have truly learned that the *Fatā* is he who expends his capacity and ability in dealing with creation in the manner that pleases the Real (*al-Ḥaqq*). <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "(بیالیسواں باب: فتوّت (جوانمردی)، جوانمردوں، ان کے مقامات، طبقات اور ان کے اقطاب کے اسرار کی معرفت میں)\n\nاور سچے جوانمرد، جن میں کوئی اکتاہٹ نہیں ہوتی،\nان کا قدم ہر فضیلت اور کرم میں ثابت ہے۔\n\nان کے احوال ان کے ہم نشینوں میں تقسیم ہوتے ہیں،\nپس وہ کچھ لوگوں کی تعظیم اور کچھ پر رحم کے درمیان ہوتے ہیں۔\n\nاور اگر کوئی ہم پلہ آ جائے تو وہ اسے اپنی نیکی میں ترجیح دیتے ہیں،\nاور اس میں جوانمردوں کو کوئی ندامت نہیں ہوتی۔\n\nان کے لیے علم کے پوشیدہ رازوں میں سے ہر شعیرہ (چھوٹا حصہ) ہے،\nاور کوئی چیز ان کے نزدیک سمسمہ (چھوٹے دانے) کی طرح بھی موسوم نہیں ہے۔\n\nجیسے قسی کا بیٹا (یوسف علیہ السلام) اور جو اس سے پہلے تھے (ابراہیم علیہ السلام)،\nاور ان میں سے وہ جنہیں اللہ نے علم عطا کیا۔\n\nاسی سے انہوں نے ہر میدان میں سبقت اور برتری حاصل کی،\nپس وہ کسی بیوقوف کو \"مہ\" (خاموشی کا لفظ) سے جواب نہیں دیتے۔\n\nانہیں میمنہ (دائیں طرف) سے خاص کیا گیا ہے، ان کا مقام بلند ہے،\nاور اس کی کوئی ضد نہیں جسے مشأمہ (بائیں طرف) کہا جائے۔\n\nپس میرے رب کے دونوں ہاتھ کریم دائیں ہاتھ ہیں،\nاور قوم کا کریم وہ ہے جو سب سے زیادہ کریم ہو۔\n\nجب ولی اپنے اہل پر خلعت (عطا) کرتا ہے، تو تم ان کے لباس کو دوسرے لباسوں کے درمیان نمایاں دیکھتے ہو۔\n\n### [فتوّت قوت کا مقام ہے]\n\nجان لو کہ فتوّت (Al-Futuwwah) قوت (Al-Qūwah) کا مقام ہے۔ اور اللہ نے طبیعت میں ہوا سے زیادہ قوی کوئی چیز پیدا نہیں کی، اور انسان کو ہوا سے زیادہ قوی پیدا کیا ہے اگر وہ مؤمن ہو۔ اسی طرح خبر نبوی میں اللہ تعالیٰ کی طرف سے فرشتوں کے ساتھ وارد ہوا ہے جب زمین کو پیدا کیا گیا اور وہ لرزنے لگی، حدیث اپنے کمال کے ساتھ ہے، اور اس کے آخر میں ہے: \"اے رب! کیا تو نے ہوا سے بھی زیادہ سخت کوئی چیز پیدا کی ہے؟ فرمایا: ہاں، مؤمن جو اپنے دائیں ہاتھ سے صدقہ کرتا ہے اور اس کے بائیں ہاتھ کو اس کا علم نہیں ہوتا۔\"\n\nاور اللہ تعالیٰ نے فرمایا: إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ (بیشک اللہ ہی رزق دینے والا، قوت والا، مضبوط ہے)۔ اللہ نے رزاق (Al-Razzāq) کی صفت کو قوت (Al-Qūwah) کے ساتھ اس لیے بیان کیا کہ رزق پانے والوں کی طرف سے منعم (نعمت دینے والے) کا کفران (ناشکری) موجود ہے۔ پس وہ ان کو ان کے کفر کے باوجود رزق دیتا ہے، اور ان کے کفر کے سبب ان سے رزق، انعام اور احسان کو نہیں روکتا، حالانکہ نعمتوں کا کفر ایک مانع سبب ہے جو نعمت کو روکتا ہے۔ پس کافر کو اس کے کفر کے باوجود کوئی رزق نہیں دیتا مگر وہ جو قوت (Al-Qūwah) کا مالک ہو۔ اسی لیے اللہ نے اپنی صفت ذُو الْقُوَّةِ الْمَتِينُ (قوت والا، مضبوط) سے بیان کی۔ کیونکہ قوت میں متانت (مضبوطی) اسے دوگنا کر دیتی ہے۔ پس اللہ سبحانہ و تعالیٰ نے صرف قوت پر اکتفا نہیں کیا بلکہ اپنے آپ کو اس میں متین (مضبوط) سے بھی متصف کیا، کیونکہ قوت کے لیے قوی ہونے میں مختلف طبقات ہوتے ہیں۔ پس اللہ نے اپنے آپ کو متانت سے متصف کیا، اور یہ فتوّت (Al-Futuwwah) والوں کی صفت ہے۔\n\nفتوّت میں کمزوری (Al-Ḍa‘f) کا کوئی شائبہ نہیں ہوتا، کیونکہ یہ بچپن اور ادھیڑ عمری (Al-Kuhūlah) کے درمیان کی حالت ہے، اور یہ انسان کی بلوغت کے وقت سے لے کر چالیس سال کی عمر تک کا زمانہ ہے۔ اللہ تعالیٰ اس مقام میں فرماتا ہے: الله الَّذِي خَلَقَكُمْ من ضَعْفٍ ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً (اللہ ہی ہے جس نے تمہیں کمزوری سے پیدا کیا، پھر کمزوری کے بعد قوت بخشی)۔ اور یہ فتوّت کی حالت ہے، اور اسی میں اسے فتیٰ (جوانمرد) کہا جاتا ہے، اور اس کے ساتھ کمزوری کی کوئی چیز نہیں جوڑی گئی۔ پھر اللہ سبحانہ و تعالیٰ نے فرمایا: ثُمَّ جَعَلَ من بَعْدِ قُوَّةٍ ضَعْفاً وشَيْبَةً (پھر قوت کے بعد کمزوری اور بڑھاپا کر دیا)۔ یعنی ادھیڑ عمری کی کمزوری عمر کے آخر تک، اور شَيْبَةً (بڑھاپا) یعنی وقار (Al-Wiqār)، یعنی حرکت سے اس کی کمزوری کی وجہ سے سکون۔ کیونکہ وقار، وقر (بوجھ) سے ہے، یعنی بھاری پن۔ پس اس دوسری کمزوری کے ساتھ شَیبہ (بڑھاپا) کو جوڑا گیا جو کہ وقار ہے۔ اگرچہ بچہ کمزور ہوتا ہے، لیکن وہ بہت زیادہ متحرک ہوتا ہے، اور اس کی حرکت میں اختلاف ہے کہ آیا وہ طبیعت سے ہے یا روح سے۔\n\nروایت ہے کہ ابراہیم علیہ السلام نے جب بڑھاپا دیکھا تو عرض کیا: یا رب! یہ کیا ہے؟ فرمایا: وقار (Al-Wiqār)۔ عرض کیا: اے اللہ! مجھے وقار میں اضافہ عطا فرما۔\n\nپس یہ فتوّت کی حالت اور اس کا مقام ہے، اور اس کے ساتھیوں کو جوانمرد (Al-Fityān) کہا جاتا ہے۔ یہ وہ لوگ ہیں جنہوں نے تمام مکارم اخلاق (Makārim al-Akhlāq) کو حاصل کر لیا ہے۔ اور کسی کے لیے ممکن نہیں کہ اس کی حالت مکارم اخلاق ہو جب تک کہ وہ ان مقامات کو نہ جان لے جن میں وہ ان اخلاق کو صرف کرتا ہے اور ان کے ذریعے ظاہر ہوتا ہے۔ پس جوانمرد وافر علم (Al-’Ilm) والے ہوتے ہیں۔ ہم نے اس کتاب کے اندر ایک باب اس کے لیے مختص کیا ہے جب ہم نے مقامات اور احوال پر گفتگو کی تھی۔ پس جو شخص فتوّت کا دعویٰ کرے اور اس کے پاس اس علم کا ادراک نہ ہو جس کا ہم نے ذکر کیا ہے، تو اس کا دعویٰ جھوٹا ہے اور وہ جلد رسوا ہو جائے گا۔ پس کسی کو فتیٰ (جوانمرد) نہیں کہا جانا چاہیے مگر وہ جو اکوان (مخلوقات) کے مقادیر اور حضرت الٰہیہ (Al-Ḥaḍrah al-Ilāhiyyah) کے مقدار کو جانتا ہو، تاکہ وہ ہر موجود سے اس کے مرتبے کے مطابق معاملہ کرے، اور جسے آگے بڑھانا چاہیے اسے آگے بڑھائے اور جسے پیچھے کرنا چاہیے اسے پیچھے کرے۔\n\n### [فتوّت میں وہ اصل جس پر بھروسہ کرنا چاہیے]\n\nاس مقام کی تفصیلات اور اس گروہ کے احکام کو ہم نے رسالہ الاخلاق میں مکمل طور پر بیان کیا ہے جو ہم نے فخر محمد بن عمر بن خطیب الری (رحمہ اللہ) کے لیے لکھا تھا۔ پس ہم اس باب میں صرف وہ اصل بیان کرتے ہیں جس پر بھروسہ کرنا چاہیے۔ اور وہ یہ ہے کہ انسان کے بس میں نہیں ہے کہ وہ اپنے مکارم اخلاق کے ذریعے تمام عالم کو اپنے اندر سمو لے، کیونکہ سارا عالم اپنے غرض یا ارادے پر قائم ہے، نہ کہ اس پر جو ہونا چاہیے۔ جب اغراض اور ارادے مختلف ہو گئے، اور ہر صاحب غرض یا ارادہ جوانمرد سے یہ مطالبہ کرتا ہے کہ وہ اس کے غرض اور ارادے کے مطابق اس سے معاملہ کرے، اور اغراض متضاد ہوتے ہیں، تو زید کا غرض عمر میں یہ ہو سکتا ہے کہ وہ خالد سے دشمنی کرے، اور خالد کا غرض زید میں یہ ہو سکتا ہے کہ وہ عمر سے دشمنی کرے یا اس سے دوستی اور محبت کرے۔\n\nاگر وہ عمر کے ساتھ جوانمردی کرے اور خالد سے دشمنی کرے، تو خالد اس کی مذمت کرے گا اور زید فتوّت اور کریم خلق کی وجہ سے اس کی تعریف کرے گا۔ اور اگر وہ خالد سے دشمنی نہ کرے اور اس سے دوستی اور محبت کرے، تو خالد اس کی تعریف کرے گا اور زید اس کی مذمت کرے گا۔ پس جب ہم نے دیکھا کہ معاملہ اس حد پر ہے اور یہ عام نہیں ہو سکتا، اور عقلی طور پر یا عادتاً یہ ممکن نہیں کہ انسان اس دنیا میں یا جہاں بھی ہو، ایسے مقام پر کھڑا ہو جو متضاد لوگوں کو راضی کر دے، تو جوانمرد کے لیے ضروری ہے کہ وہ اپنی نفسانی خواہش کو ترک کر دے اور اپنے خالق کی طرف رجوع کرے جو اس کا مولا (Mawlā) اور آقا ہے۔ اور کہے کہ میں عبد (Servant) ہوں، اور عبد کے لیے ضروری ہے کہ وہ اپنے آقا کے حکم پر ہو، نہ کہ اپنے نفس کے حکم پر اور نہ ہی اپنے آقا کے علاوہ کسی اور کے حکم پر۔ وہ اس کی رضاؤں کی پیروی کرے اور اس کی حدود اور احکام پر قائم رہے، اور ان لوگوں میں سے نہ ہو جنہوں نے اپنے آقا کے ساتھ اس کی بندگی میں شریک بنا لیا ہو۔ پس وہ اپنے آقا کے ساتھ اس کے مقرر کردہ حد کے مطابق ہو، اور جو کچھ اسے حکم دیا گیا ہے اس میں تصرف کرے، اور اس کی پرواہ نہ کرے کہ وہ عالم کے اغراض کے موافق ہے یا مخالف۔ اگر وہ ان میں سے کسی کے موافق ہو جائے تو یہ اس کے آقا کی طرف سے رجوع ہے۔ پس اس کے لیے اس کے آقا کے دیوان سے ایک توقیع (Decree) جاری ہوا جو ایک رسول کے ہاتھوں آیا، جس کے لیے دلیل اور علم قائم ہوا کہ یہ اس کے آقا کی طرف سے آیا ہے، اور وہ توقیع اس کے آقا کا توقیع ہے۔ پس اس نے اس کی تعظیم کی اور اپنے آقا کا توقیع لے لیا، اور توقیع کے ساتھ مشافہت (زبانی حکم) بھی تھی۔ پس اس نے بندوں کو وہ بات زبانی بتائی جس کا آقا نے انہیں بتانے کا حکم دیا تھا، اور یہی مقرر کردہ شریعت ہے، اور توقیع وہ نازل شدہ کتاب ہے جسے قرآن کہا جاتا ہے، اور رسول جبريل عليه السلام ہیں، اور دروازے کا حاجب (دربان) جو اس ملکي رسول کو اللہ کی طرف سے توقیع اور مشافہت کے ساتھ پہنچاتا ہے، وہ نبی مبشر محمد صلى الله عليه وسلم ہیں، یا کوئی بھی نبی جو انبیاء میں سے ان کی بعثت کے زمانے میں ہو۔ پس بندوں پر اپنے آقا کے احکام کی پابندی لازم ہے جو اس کے توقیع میں شامل ہیں اور جو مشافہت کے ذریعے آئے ہیں۔ پس ان کے لیے اپنے نفوس میں کوئی ملکیت اور تدبیر نہیں ہے۔\n\n### [جوانمرد وہ ہے جو اپنے آقا کے احکام پر قائم رہے]\n\nپس جو شخص اپنے آقا کی حدود پر قائم رہا اور اس کے احکام کی تعمیل کی اور کسی بھی چیز میں اس کی مخالفت نہیں کی جو اس کے پاس آئی، اس حد تک جو اس کے لیے مقرر کی گئی، بغیر کسی قیاس یا رائے کے اضافے کے، اور نہ ہی کسی تاویل کے ذریعے کمی کے، پس اس نے اپنے ہم جنس لوگوں سے اس طرح معاملہ کیا جس کا اسے حکم دیا گیا تھا، خواہ وہ مؤمن ہو یا کافر، گنہگار ہو یا منافق۔ اور بس یہی چار قسمیں ہیں۔ اور ان میں سے ہر قسم طبقات پر ہے: مؤمن میں سے فرمانبردار، گنہگار، ولی، نبی، رسول، فرشتہ، حیوان، نباتات اور معدن ہیں۔ اور کافر میں سے مشرک اور غیر مشرک ہیں۔ اور منافق ظاہری طور پر کافر کے درجے سے کم ہوتا ہے، کیونکہ منافق کے لیے جہنم کا سب سے نچلا درجہ ہے اور کافر کے لیے اعلیٰ اور نچلا دونوں ہیں۔ اور جہاں تک گنہگار کا تعلق ہے، وہ ظاہری طور پر مؤمن مطیع کے درجے سے اپنی معصیت کے بقدر کم ہوتا ہے۔ پس یہ شخص جو اپنے آقا کے احکام پر قائم ہے، وہی جوانمرد (Al-Fatā) ہے۔\n\nہر انسان کو لازماً کسی بڑے، چھوٹے یا ہم پلہ کا ہم نشین ہونا پڑتا ہے، خواہ عمر میں یا مرتبے میں یا دونوں میں۔ پس جوانمرد وہ ہے جو علم میں یا عمر میں بڑے کی تعظیم کرے، اور جوانمرد وہ ہے جو علم میں یا عمر میں چھوٹے پر رحم کرے، اور جوانمرد وہ ہے جو عمر میں یا علم میں ہم پلہ کو ترجیح دے۔ اور میں اپنے قول \"علم میں\" سے صرف مرتبے کو مراد لیتا ہوں، اور ہم نے علم کو اس کی شرافت کی وجہ سے لایا ہے۔ کیونکہ بادشاہ عمر میں چھوٹا ہو سکتا ہے اور علم میں بھی چھوٹا ہو سکتا ہے، اور اس کی رعایا میں سے کوئی شخص عمر میں بڑا اور علم میں بڑا ہو سکتا ہے۔ اگر بادشاہ اس قدر کو جانتا ہو جو ذات حق (Al-Ḥaqq) نے اس کے لیے اپنی شریعت میں بڑے کی تعظیم اور علم کی شرافت کے بارے میں مقرر کیا ہے، تو بادشاہ اس کے ساتھ اسی طرح معاملہ کرے گا۔ اور اگر وہ ایسا نہ کرے تو بادشاہ بدسلوکی کرنے والا ہو گا۔ پس جوانمرد کے لیے ضروری ہے کہ وہ اس مرتبے کی شرافت کو پہچانے جو سلطنت ہے، اور یہ کہ وہ اللہ کا نائب ہے اس کے بندوں میں اور اس کا خلیفہ ہے اس کے ملکوں میں۔ پس وہ اس شخص سے معاملہ کرے جسے اللہ نے اس میں قائم کیا ہے، اگرچہ اس کے ہاتھ پر حق اس طرح جاری نہ ہو جیسا کہ ہونا چاہیے، اس مرتبے کے لیے جو اطاعت اور فرمانبرداری لازم ہے، خوشی اور ناخوشی میں، اس حد تک جو اس کے آقا نے اس کے لیے مقرر کیا ہے، اور اس کے ساتھ جو کچھ اللہ نے اس سلطان میں محمود یا مذموم اخلاق میں سے قائم کیا ہے، خواہ وہ ظلم ہو یا عدل۔ پس جوانمرد کے لیے ضروری ہے کہ وہ سلطان کا وہ حق پورا کرے جو اللہ نے اس پر واجب کیا ہے، اور اس سے اپنا وہ حق نہ مانگے جو اللہ نے سلطان سے پہلے اس کے لیے مقرر کیا ہے، جسے وہ معاف کر سکتا ہے اگر سلطان اسے روک دے، یہ اس پر فتوّت (جوانمردی) ہے، اور اس پر رحم ہے، اور اس کے مرتبے کی تعظیم ہے، کیونکہ اسے قیامت کے دن اس کا مطالبہ کرنے کا حق ہے۔\n\nپس جوانمرد وہ ہے جس کا کوئی خصم (مخالف) نہ ہو، کیونکہ جو اس پر واجب ہے وہ اسے ادا کرتا ہے، اور جو اس کا حق ہے وہ اسے چھوڑ دیتا ہے۔ پس اس کا کوئی خصم نہیں ہوتا۔ جوانمرد وہ ہے جس سے کوئی حرکت بالکل بھی عبث (بے مقصد) صادر نہ ہو۔ اور اس کا مطلب یہ ہے کہ اللہ نے اسے یہ کہتے ہوئے سنا: وما خَلَقْنَا السَّماءَ والْأَرْضَ وما بَيْنَهُما باطِلًا (اور ہم نے آسمان اور زمین اور جو کچھ ان کے درمیان ہے، باطل (بے مقصد) پیدا نہیں کیا)۔ اور جوانمرد سے صادر ہونے والی یہ حرکت ان دونوں کے درمیان کی چیز ہے۔ اسی طرح ہر متحرک کی حرکت جسے اللہ نے آسمان اور زمین کے درمیان پیدا کیا ہے، وہ عبث نہیں ہے۔ کیونکہ خالق حکیم ہے۔ پس جوانمرد وہ ہے جو اپنے نفس میں حکمت کے لیے حرکت کرتا ہے یا ساکن ہوتا ہے۔ اور جس کی حالت اس کی حرکات میں یہ ہو، تو اس کی حرکت عبث نہیں ہو گی، نہ اس کے ہاتھ میں، نہ اس کے پاؤں میں، نہ اس کے سونگھنے میں، نہ اس کے کھانے میں، نہ اس کے چھونے میں، نہ اس کے سننے میں، نہ اس کے دیکھنے میں، اور نہ ہی اس کے باطن میں۔ پس وہ اپنے اندر ہر نفس کو جانتا ہے اور جو اس کے لیے ضروری ہے اور اس کے آقا کا حکم اس میں کیا ہے۔ اور ایسا شخص عبث نہیں ہو گا۔ اور جب حرکت کسی اور سے ہو، تو وہ اسے عبث نہیں دیکھتا، کیونکہ اللہ نے اسے پیدا کیا ہے، یعنی اس کی تقدیر مقرر کی ہے، اور جب اس نے اس کی تقدیر مقرر کی ہے تو وہ عبث یا باطل نہیں ہو گی۔ پس وہ اس کے وقوع کے وقت عالم میں اس کے ساتھ حاضر ہوتا ہے۔ اگر اسے اس میں حکمت کا علم (Al-’Ilm) عطا کیا جائے تو کیا ہی خوب، اور وہ صاحب عنایت ہے۔ اور اگر اسے اس میں حکمت کا علم عطا نہ کیا جائے، تو اس کے لیے اپنے نفس میں یہ حاضری کافی ہے کہ یہ ایک مقدر حرکت ہے جو اللہ کی طرف منسوب ہے، اور اس میں ایک راز ہے جسے اللہ جانتا ہے۔ اور علم کا یہ قدر اسے ادب الٰہی (Al-Adab al-Ilāhī) کی طرف لے جاتا ہے۔\n\n### [جوانمرد اور ملامتیہ]\n\nاور یہ صرف جوانمردوں (Al-Fityān) کے لیے ہوتا ہے جو قوت (Al-Qūwah) کے مالک ہوتے ہیں اور نفوس کی طبائع اور عادات پر حاکم ہوتے ہیں۔ اور اس گروہ میں اس مقام پر صرف ملامتیہ (Al-Malāmatiyyah) ہی ہوتے ہیں، کیونکہ اللہ نے انہیں ان کے نفوس پر والی بنایا ہے اور ان کی روح کی تائید اپنی طرف سے کی ہے۔ پس ان کے لیے مکمل تصرف، نافذ ہونے والا کلمہ اور غالب حکم ہوتا ہے۔\n\nپس وہ بندوں کی صورت میں سلاطین ہوتے ہیں، جنہیں ملأ اعلیٰ (فرشتوں کی جماعت) پہچانتے ہیں۔ پس انسان اور جن کے علاوہ ہر کوئی ان کی فضیلت کا قائل ہوتا ہے، سوائے بعض ثقلین (انسان اور جن) کے، کیونکہ حسد انہیں اس سے روکتا ہے۔\n\n### [جوانمردوں کے طبقات اور ان کا مقام]\n\nپس جوانمردوں کے طبقات وہی ہیں جن کا ہم نے ذکر کیا: وہ جو حرکات میں اللہ کا علم جانتے ہیں، اور وہ جو اللہ کا علم اس میں تعین کے ساتھ نہیں جانتے، اگرچہ وہ جانتے ہیں کہ وہاں کوئی امر ہے جس پر اللہ نے انہیں مطلع نہیں کیا۔ اور جہاں تک ان کے مقام کا تعلق ہے، تو وہ وہی ہے جو ہم نے باب کے شروع میں کہا تھا، اللہ کے اس قول میں: ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً (پھر کمزوری کے بعد قوت بخشی)۔ اور وہ اس ایجادی حقیقت کو الٰہی حقائق کی دوسری آیت سے دیکھتے ہیں، اور وہ اللہ کا یہ قول ہے: إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ (بیشک اللہ ہی رزق دینے والا، قوت والا، مضبوط ہے)۔ پس وہ مخلوق سے ان کی برائی کے باوجود ان پر احسان کے ساتھ معاملہ کرتے ہیں، جیسے اللہ کا کافروں کو رزق دینا جو اللہ اور اس کی نعمتوں کا کفر کرتے ہیں۔ پس انہیں اپنے نفوس پر عظیم قوت (Al-Qūwah) حاصل ہوتی ہے، جہاں ان کی خواہش اور وہ چیز جس پر نفس جبلت کیا گیا ہے، یعنی تعریف، شکر اور اعتراف کی محبت، ان پر غالب نہیں آتی۔\n\n### [ابراہیم علیہ السلام کی فتوّت]\n\nاللہ تعالیٰ حکایت کرتے ہوئے فرماتا ہے: سَمِعْنا فَتًى يَذْكُرُهُمْ يُقالُ لَهُ إِبْراهِيمُ (ہم نے ایک جوانمرد کو سنا ہے جو ان کا ذکر کرتا ہے، جسے ابراہیم کہا جاتا ہے)۔ پس اللہ نے ان کی زبانوں پر ابراہیم کی فتوّت (Al-Futuwwah) کو جاری کیا، جب فتوّت اس مرتبے کی تھی، کیونکہ انہوں نے اللہ کے حق میں حق قیام کیا۔ اور جب انہوں نے انہیں بڑے بت کی طرف منتقل کیا، اس نیت سے کہ ان سے سلامتی طلب کریں، کیونکہ انہوں نے ان سے کہا: فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ (پس ان سے پوچھ لو اگر وہ بول سکتے ہوں)۔ وہ انہیں توبیخ کرنا چاہتے تھے۔ اسی لیے وہ اپنے نفوس کی طرف پلٹے، اور یہ اللہ کا قول ہے: وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ (اور یہ ہماری دلیل تھی جو ہم نے ابراہیم کو اس کی قوم کے مقابلے میں عطا کی)۔ یہ ہر حال میں تھا۔ اور اسے جھوٹ صرف اس لیے کہا گیا کہ الفاظ کی دنیا میں فعل کی نسبت ان کے بڑے بت کی طرف کی گئی، حالانانکہ بڑا اللہ ہے حقیقت میں، اور اللہ ہی فاعل ہے جس نے ابراہیم کے ہاتھ سے بتوں کو توڑا، کیونکہ اس نے اپنے بارے میں خبر دی کہ وہ اس کا ہاتھ ہے جس سے وہ پکڑتا ہے۔ پس اس نے ان بتوں کو توڑا جنہیں وہ اپنا معبود سمجھتے تھے۔ کیا تم مشرکین کو نہیں دیکھتے کہ وہ ان کے بارے میں کہتے ہیں: ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ (ہم ان کی عبادت صرف اس لیے کرتے ہیں تاکہ وہ ہمیں اللہ کے قریب کر دیں)۔ پس انہوں نے اعتراف کیا کہ وہاں ایک بڑا معبود ہے جو ان سب سے بڑا ہے، جیسا کہ وہ أَحْسَنُ الْخَالِقِينَ (سب سے بہترین خالق) اور أَرْحَمُ الرَّاحِمِينَ (سب سے زیادہ رحم کرنے والا) ہے۔\n\nپس جو کچھ ابراہیم علیہ السلام نے کہا وہ ابراہیم علیہ السلام کے عقیدے میں صحیح تھا، اور مشرکین نے غلطی کی جہاں وہ ابراہیم سے وہ بات نہ سمجھ سکے جو انہوں نے اپنے قول بَلْ فَعَلَهُ كَبِيرُهُمْ (بلکہ یہ ان کے بڑے نے کیا ہے) سے مراد لی تھی۔ پس ابراہیم کا مقصد اپنے بڑے سے اللہ تعالیٰ تھا، اور ان پر حجت قائم کرنا تھا، اور یہ دونوں عقیدوں میں موجود ہے۔ اور ان کا معبود ہونا ان کے زعم کے مطابق تھا۔ اور ہمارے نزدیک اس پر وقف کرنا مکمل طور پر اچھا ہے۔ اور ابراہیم نے اپنے قول سے ابتدا کی: یہ میرا قول ہے۔ پس خبر محذوف ہے جس پر قصے کا سیاق دلالت کرتا ہے: فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ (پس ان سے پوچھ لو اگر وہ بول سکتے ہوں)۔ پس وہ تمہیں خبر دیں گے۔ اور اگر بت اس وقت بولتے تو وہ فعل کی نسبت اللہ کی طرف کرتے نہ کہ ابراہیم کی طرف۔ کیونکہ ہمارے طریق کے اہل کشف (Al-Kashf) کے نزدیک یہ مقرر ہے کہ جمادات، نباتات اور حیوانات کو اللہ نے اپنی معرفت اور اپنی حمد کے ساتھ تسبیح پر فطرت کیا ہے۔ پس وہ اللہ کے سوا کسی کو فاعل نہیں دیکھتے۔ اور جس کی فطرت میں یہ ہو، وہ فعل کی نسبت اللہ کے علاوہ کسی اور کی طرف کیسے کر سکتا ہے؟ پس ابراہیم اپنے رب کی طرف سے بتوں کے بارے میں یقین پر تھے کہ اگر وہ بولتے تو فعل کی نسبت اللہ کی طرف کرتے، کیونکہ انہوں نے ان سے پوچھنے کے لیے نہیں کہا مگر دلالت کے طور پر، خواہ وہ بولیں یا خاموش رہیں۔ اگر وہ نہ بولتے تو وہ ان سے کہتے کہ تم ان کی عبادت کیوں کرتے ہو جو نہ سنتے ہیں، نہ دیکھتے ہیں اور نہ اللہ کی طرف سے تمہارے لیے کوئی فائدہ پہنچا سکتے ہیں اور نہ اپنے لیے۔ اور اگر وہ بولتے تو کہتے کہ اللہ نے ہمیں ٹکڑے ٹکڑے کر دیا ہے۔ دلالت میں یہ ممکن نہیں کہ بت اس کے علاوہ کچھ کہیں، کیونکہ اگر وہ کہتے کہ بڑے بت نے ہمارے ساتھ ایسا کیا، تو وہ جھوٹ بولتے، اور یہ اللہ کی طرف سے ان کے کفر کی تصدیق ہوتی اور ابراہیم علیہ السلام پر رد ہوتا، کیونکہ بڑے بت نے انہیں ٹکڑے ٹکڑے نہیں کیا تھا۔ اور اگر وہ کہتے کہ ابراہیم نے ہمیں توڑا، تو وہ ابراہیم کی طرف نسبت کرنے میں سچے ہوتے، لیکن ان کے بولنے سے اللہ کی وحدانیت پر دلالت لازم نہ آتی بڑے بت کے باقی رہنے کی وجہ سے۔ پس ابراہیم کا مقصد دلالت کا باطل ہو جاتا اور وہ واقع نہ ہوتی اور سچی نہ ہوتی۔ وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ (اور یہ ہماری دلیل تھی جو ہم نے ابراہیم کو اس کی قوم کے مقابلے میں عطا کی)۔ پس ان کے بولنے میں بھی ان کے لیے دلالت تھی جیسا کہ ہم نے مقرر کیا، اور ان کے نہ بولنے میں بھی اگر وہ نہ بولتے۔ اور انبیاء علیہم السلام کا مقصد ایسا ہی ہونا چاہیے، پس وہ علماء ہیں، صلوات اللہ علیہم۔ اسی لیے وہ اپنے نفوس کی طرف پلٹے اور کہا: إِنَّكُمْ أَنْتُمُ الظَّالِمُونَ (بیشک تم ہی ظالم ہو)۔ ثُمَّ نُكِسُوا عَلى‏ رُؤُسِهِمْ لَقَدْ عَلِمْتَ ما هؤُلاءِ يَنْطِقُونَ (پھر وہ اپنے سروں کے بل اوندھے ہو گئے (اور کہنے لگے) تم تو جانتے ہو کہ یہ بولتے نہیں)۔ پس اللہ نے ایسے لوگوں کے لیے فرمایا: أَ تَعْبُدُونَ ما تَنْحِتُونَ (کیا تم ان چیزوں کی عبادت کرتے ہو جنہیں تم خود تراشتے ہو؟) پس یہ ان کی فتوّت میں سے تھا کہ انہوں نے اپنے آپ کو اپنے خالق کی احدیت (Aḥadiyyah) کے حق میں بیچ دیا، نہ کہ صرف اپنے خالق کے حق میں، کیونکہ شریک خالق کے وجود کی نفی نہیں کرتا، بلکہ احدیت کی نفی پر توجہ دیتا ہے۔ پس اس مقام پر وہی کھڑا ہو سکتا ہے جسے فتوّت میں قطبیت (Al-Quṭbiyyah) حاصل ہو، جس کے گرد اس کا مقام گھومتا ہے۔\n\n### [موسیٰ علیہ السلام کے جوانمرد کی فتوّت]\n\nاور فتوّت میں سے اللہ کا یہ قول ہے: وإذ قال موسى لفتاه (اور جب موسیٰ نے اپنے جوانمرد سے کہا)۔ پس عبرانی زبان میں اس پر ایک معنی کا اطلاق کیا گیا جسے عربی زبان میں فتیٰ (جوانمرد) سے تعبیر کیا جاتا ہے۔ اور وہ موسیٰ علیہ السلام کی خدمت میں تھا، اور موسیٰ اس وقت دروازے کے حاجب (دربان) تھے، کیونکہ وہ اس امت کے لیے شریعت لانے والے اور اس کے رسول تھے۔ اور ہر امت کے لیے ایک خاص الٰہی دروازہ ہوتا ہے، اور ان کا شارع اس دروازے کا حاجب ہوتا ہے جس سے وہ اللہ تعالیٰ پر داخل ہوتے ہیں۔ اور محمد صلى الله عليه وسلم حجاب کے حاجب ہیں، ان کی رسالت کے عموم کی وجہ سے، دیگر انبیاء علیہم السلام کے برعکس۔ پس وہ آدم علیہ السلام سے لے کر آخری نبی اور رسول تک، آپ صلى الله عليه وسلم کے دربان ہیں۔\n\n### [انبیاء، نبی محمد صلی اللہ علیہ وسلم کی بعثت کے زمانے سے پہلے ان کے دربان تھے]\n\nاور ہم نے انہیں آپ صلى الله عليه وسلم کے دربان اس لیے کہا:\nآپ صلى الله عليه وسلم کے اس قول کی وجہ سے: آدم فمن دونه تحت لوائي (آدم اور جو ان سے نیچے ہیں، میرے جھنڈے تلے ہیں)۔\nپس وہ عالم خلق میں آپ صلى الله عليه وسلم کے نائب ہیں، اور آپ صلى الله عليه وسلم ایک مجرد روح ہیں جو اپنے جسم کی نشوونما سے پہلے اس بات کو جانتے تھے۔\nآپ صلى الله عليه وسلم سے پوچھا گیا: آپ کب نبی تھے؟ تو آپ نے فرمایا: كنت نبيا وآدم بين الماء والطين (میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے)۔\nیعنی آدم ابھی پیدا نہیں ہوئے تھے، یہاں تک کہ آپ صلى الله عليه وسلم کے مطہر جسم کے ظہور کا وقت آ گیا۔ پس دیگر الٰہی دربانوں یعنی رسولوں اور انبیاء علیہم السلام میں سے کسی بھی نائب کے لیے کوئی حکم باقی نہیں رہا، سوائے اس کے کہ ان کے چہرے آپ صلى الله عليه وسلم کے مقام کی قیومیت کے سامنے جھک گئے، کیونکہ آپ حجاب کے حاجب تھے۔ پس آپ نے ان کی شریعت میں سے جو چاہا اپنے آقا اور بھیجنے والے کی اجازت سے مقرر کیا، اور ان کی شریعت میں سے جو چاہا اٹھا دیا اور اسے منسوخ کرنے کا حکم دیا۔ پس شاید وہ شخص جسے اس امر کا علم نہیں ہے، یہ کہے کہ موسیٰ علیہ السلام اپنی شریعت کے ساتھ محمد صلى الله عليه وسلم کی طرح مستقل تھے۔\nتو رسول اللہ صلى الله عليه وسلم نے فرمایا: لو كان موسى حيا ما وسعه إلا أن يتبعني (اگر موسیٰ زندہ ہوتے تو ان کے لیے میری پیروی کے سوا کوئی چارہ نہ ہوتا)۔\nاور آپ صلى الله عليه وسلم نے سچ فرمایا۔\n\n### [جوانمرد ہمیشہ تسخیر کے مقام میں ہوتا ہے]\n\nپس جوانمرد (Al-Fatā) ہمیشہ تسخیر (Al-Taskhīr) کے مقام میں ہوتا ہے، جیسا کہ\nآپ علیہ السلام نے فرمایا: خادم القوم سيدهم (قوم کا خادم ان کا سردار ہوتا ہے)۔\nپس جس کی خدمت اس کی سیادت ہو، وہ خالص عبد ہوتا ہے۔ اور جوانمرد ایک دوسرے پر فضیلت رکھتے ہیں، ایک لحاظ سے اللہ کے نزدیک اس شخص کے مرتبے کے لحاظ سے جس پر فتوّت کی گئی، اور دوسرے لحاظ سے کمزوری کے لحاظ سے۔ پس ان میں سب سے اعلیٰ وہ ہے جو اس کمزور پر فتوّت کرے، اور ان میں سب سے اعلیٰ وہ بھی ہے جو اس دوسرے لحاظ سے اللہ کے نزدیک اعلیٰ پر فتوّت کرے۔\n\nکمزور پر فتوّت کرنے والے کی مثال دسترخوان والے شخص کی طرح ہے، جسے اس کے شیخ نے حکم دیا کہ وہ دسترخوان مہمانوں کے قریب کرے، تو اس نے تاخیر کی کیونکہ اس میں چیونٹیاں تھیں۔ پس اس نے فتوّت میں سے یہ نہیں سمجھا کہ وہ چیونٹیوں کو دسترخوان سے جھاڑ دے، کیونکہ فتوّت میں سے یہ ہے کہ وہ اسے حیوان پر صرف کرے۔ پس وہ اس وقت تک کھڑا رہا جب تک کہ چیونٹیاں خود بخود دسترخوان سے باہر نہ نکل گئیں۔ اس شخص کی طرف سے چیونٹیوں کو نکالنے کے لیے کوئی جبری عمل نہیں ہوا۔ کیونکہ جوانمردوں کے لیے فتوّت ہوتی ہے اور ان کے لیے قہر نہیں ہوتا، سوائے ان کے اپنے نفوس پر۔ اور جس میں قوت نہ ہو، اس میں فتوّت نہیں ہوتی، جیسا کہ جس میں قدرت نہ ہو، اس میں حلم نہیں ہوتا۔ پس شیخ نے اس سے کہا: تم نے بہت باریک بینی سے کام لیا۔ یہ کمزور کی رعایت ہے۔ لیکن اس نے مہمانوں کے ساتھ فتوّت نہیں کی جہاں اس نے ان کی عزت کرنے میں پہل کرنے میں تاخیر کی۔ اسی لیے ہم نے باب کے شروع میں یہ بات جوڑی کہ اغراض کے اختلاف کی وجہ سے کسی کے لیے بھی مکارم کو عام طور پر جاری کرنا ممکن نہیں ہے۔ پس جوانمرد دو مختلف اغراض والے اشخاص کے حق میں غور کرتا ہے، جن میں سے اگر ایک کو راضی کرے تو دوسرا ناراض ہو جاتا ہے۔ اور ان دو اشخاص کے حق میں اس کے غور کی صورت یہ ہے کہ ان میں سے کون شرع میں وقت اور حال کے حکم کے زیادہ قریب ہے۔ پس جو شرع میں وقت اور حال کے حکم کے زیادہ قریب ہو، وہ فتوّت اس کے ساتھ صرف کرتا ہے۔ اگر وقت اتنا وسیع ہو کہ وہ دوسرے کے ساتھ بھی ایسے طریقے سے فتوّت کر سکے جو اللہ کو راضی کرے، تو وہ بھی کرتا ہے۔ اور اگر وقت وسیع نہ ہو، تو اس نے مقام کا حق ادا کر دیا، اور وہ بلا شبہ جوانمردوں میں سے ہو گا۔ اگرچہ وہ ہمت کے فعل اور حس کے فعل کے مرتبے میں ہو، تو وہ ایک کے ساتھ حس کے ذریعے فتوّت کرے گا اور دوسرے کے ساتھ ہمت (Al-Himmah) کے ذریعے۔\n\n### [جوانمرد، ہمیشہ، مخلوق سے ذات حق کے طریقے پر پیش آتا ہے]\n\nایک شخص ہمارے شیخ ابو العباس العریبی کے پاس آیا، اور میں ان کے پاس موجود تھا۔ پس انہوں نے نیکی پہنچانے کے بارے میں گفتگو کی۔ تو اس شخص نے کہا: اے ہمارے سردار! اقرباء نیکی کے زیادہ حقدار ہیں۔ تو شیخ نے بغیر توقف کے کہا: اللہ کی طرف۔ اور مجھے ابو عبد اللہ محمد بن القاسم ابن عبد الکریم التمیمی الفاسی نے خبر دی، انہوں نے ابو عبد اللہ الدقاق کے بارے میں خبر دی کہ وہ فاس شہر میں تھے اور انہوں نے ہمت (Al-Himmah) کے فعل پر بات کی۔ تو ابو عبد اللہ الدقاق نے کہا: میں نے ایک چیز میں کامیابی حاصل کی ہے جس میں میرا کوئی شریک نہیں، میں نے کبھی کسی کی غیبت نہیں کی اور نہ ہی میری موجودگی میں کبھی کسی نے غیبت کی ہے۔ پس یہ ہمت کے فعل میں سے ہے، جہاں اس نے اس شخص پر فتوّت کی جس کی عادت غیبت کرنا تھی، کہ وہ گناہوں کا ارتکاب نہ کر سکے، کہ وہ اس کی مجلس میں اس کی موجودگی میں غیبت نہ کر سکے، بغیر اس کے کہ شیخ نے اسے اس سے منع کیا ہو۔ اور اس نے اس شخص پر بھی فتوّت کی جسے اس کی موجودگی میں ناپسندیدہ بات سے یاد کیا جاتا تھا کہ وہ اس کے منہ میں ناپسندیدہ بات سے یاد نہ کیا جائے۔ اور وہ اس باب میں اپنے وقت کے سردار تھے۔ ان کے مناقب ہمارے شیخ ابو عبد اللہ بن عبد الکریم المذکور نے کتاب \"المستفاد فی ذکر الصالحین والعباد بمدینۃ فاس وما یلیھا من البلاد\" میں بیان کیے ہیں۔ پس تم نے حقیقت میں جان لیا کہ جوانمرد وہ ہے جو مخلوق سے اس طریقے پر معاملہ کرنے میں اپنی وسعت اور استطاعت صرف کر دے جو ذات حق (Al-Ḥaqq) کو راضی کرے۔ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے)۔",
    "fa": "باب چهل و دوم در معرفت فتوت (الفتوة) و جوانمردان (الفتيان) و منازل و طبقات و اسرار اقطاب ایشان\n\nو جوانمردان راستینی که ملالی در ایشان نیست، *** در هر فضیلت و کرامتی قدمی راسخ دارند.\n\nاحوالشان در همنشینی با دیگران تقسیم شده است، *** پس میان بزرگداشت گروهی و رحمت بر گروهی دیگر هستند.\n\nو اگر همتایی بیاید، او را بر خود ترجیح می‌دهند، *** و در این کار، جوانمردان را پشیمانی (مندمة) نمی‌رسد.\n\nاز اسرار علم، هر شعیره‌ای (حقیقت کوچکی) برای ایشان است، *** و آنچه نزدشان به دانه کنجد (سمسمه) موسوم است (یعنی کوچک‌ترین چیزها).\n\nمانند فرزند قُسَی و آنکه پیش از او بود، *** و هر کس از ایشان که خداوند او را آگاه ساخت.\n\nبدین وسیله در هر میدانی به مقام و سبقت دست یافت، *** پس سفیه را با لفظ «مه» (بس کن) پاسخ نمی‌دهند.\n\nبه میمنت (یمین) اختصاص داده شده‌اند، مقامشان والاست، *** و ضدی برای آن نیست که به شومی (مشأمة) نامیده شود.\n\nزیرا هر دو دست پروردگارم، یمین (دست راست) کریم است، *** و کریم‌ترین مردم کسی است که کریم‌تر باشد.\n\nهنگامی که ولی (خدا) بر اهل خود خلعت می‌پوشاند، می‌بینی *** که لباس‌هایشان در میان لباس‌ها نشان‌دار است.\n\n***\n\n### [فتوت مقام قوت است]\n\nبدان که فتوت (الفتوة) مقام قوت (القوة) است. و خداوند از طبیعت، چیزی قوی‌تر از هوا نیافرید، و انسان را قوی‌تر از هوا آفرید، اگر مؤمن باشد. چنانکه در خبر نبوی از خداوند متعال با فرشتگان وارد شده است، هنگامی که زمین را آفرید و زمین شروع به لرزیدن کرد... تا آخر حدیث. و در پایان آن آمده است: «ای پروردگار، آیا چیزی سخت‌تر از باد آفریدی؟» فرمود: «آری، مؤمنی که با دست راست خود صدقه می‌دهد و دست چپش از آن آگاه نمی‌شود.»\n\nو خداوند متعال می‌فرماید: **إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ** (همانا خداوند است که روزی‌دهنده و صاحب قوت و استوار است). صفت رزاق را به قوت (القوة) توصیف کرد، به دلیل وجود کفران (کفران) نعمت از سوی روزی‌خواران. پس او با وجود کفرشان به ایشان روزی می‌دهد و روزی و انعام و احسان را به سبب کفرشان از آنان باز نمی‌دارد. با اینکه کفر به نعمت، خود سبب بازدارنده‌ای است که نعمت را منع می‌کند، اما کافر با وجود کفرش روزی داده نمی‌شود، مگر از سوی کسی که قوت (القوة) دارد. به همین دلیل، خداوند خود را به «ذی القوة المتین» (صاحب قوت استوار) توصیف کرده است. زیرا استواری (المتانة) در قوت، آن را مضاعف می‌سازد. پس خداوند سبحان تنها به قوت اکتفا نکرد، بلکه خود را به استواری در آن وصف نمود، زیرا قوت دارای طبقاتی در تمکن از قوی است. پس خود را به متانت (المتانة) وصف کرد. و این صفت اهل فتوت (الفتوة) است. زیرا در فتوت هیچ ضعفی نیست، چرا که حالتی است میان کودکی (الطفولة) و کهنسالی (الكهولة)، و آن عمر انسان از زمان بلوغ تا چهل سالگی است. خداوند متعال در این مقام می‌فرماید: **الله الَّذِي خَلَقَكُمْ من ضَعْفٍ ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً** (خداوند کسی است که شما را از ناتوانی آفرید، سپس بعد از ناتوانی، قوت قرار داد). و این حال فتوت است و در این حال، شخص فتی (جوانمرد) نامیده می‌شود و هیچ ضعفی با آن قرین نشده است. سپس خداوند سبحان می‌فرماید: **ثُمَّ جَعَلَ من بَعْدِ قُوَّةٍ ضَعْفاً وشَيْبَةً** (سپس بعد از قوت، ناتوانی و پیری قرار داد). یعنی ضعف کهنسالی تا پایان عمر، و «شیبه» (پیری) یعنی وقار (وقار)، یعنی سکون به دلیل ضعف از حرکت. زیرا وقار از «وقر» به معنای سنگینی است. پس با این ضعف دوم، پیری (الشيبة) که همان وقار است، قرین شد. در حالی که کودک با وجود ضعف، بسیار پرتحرک است. و در مورد حرکت او اختلاف شده است که آیا از طبیعت است یا از روح.\n\nروایت شده است که ابراهیم علیه السلام وقتی موی سفید (الشیب) را دید، گفت: «پروردگارا، این چیست؟» فرمود: «وقار است.» گفت: «خداوندا، وقار مرا زیاد کن.»\n\nپس این حال و مقام فتوت است و یاران آن، جوانمردان (الفتيان) نامیده می‌شوند. و آنان کسانی هستند که همه مکارم اخلاق را به دست آورده‌اند. و برای هیچ کس ممکن نیست که حالش مکارم اخلاق باشد، مگر اینکه محل‌هایی را که باید آن اخلاق را در آن به کار برد و آشکار سازد، بداند. پس جوانمردان اهل علم وافر هستند. و ما بابی را در داخل همین کتاب، هنگام سخن گفتن از مقامات و احوال (المقامات والأحوال)، به آن اختصاص داده‌ایم. پس هر کس ادعای فتوت کند و علمی به آنچه ذکر کردیم نداشته باشد، ادعایش دروغ است و به سرعت رسوا می‌شود. بنابراین، شایسته نیست کسی فتی (جوانمرد) نامیده شود، مگر کسی که مقادیر اکوان (موجودات) و مقدار حضرت الهی را بداند، تا با هر موجودی به اندازه شأنش رفتار کند و آنچه را که باید مقدم بدارد، مقدم بدارد و آنچه را که باید مؤخر بدارد، مؤخر بدارد.\n\n***\n\n### [اصلی که در فتوت باید بر آن تکیه کرد]\n\nجزئیات این مقام و احکام این طایفه را در رساله اخلاق که برای فخر محمد بن عمر بن خطیب ری (رحمه الله) نوشتیم، به طور کامل بیان کرده‌ایم. پس در این باب، اصلی را که باید بر آن تکیه کرد، ذکر می‌کنیم. و آن این است که در توان انسان نیست که همه عالم را با مکارم اخلاق خود در بر گیرد، زیرا تمام عالم بر اساس غرض یا اراده خود ایستاده است، نه بر اساس آنچه شایسته است. و چون اغراض و ارادات مختلف است و هر صاحب غرض یا اراده‌ای از جوانمرد می‌خواهد که با او بر اساس غرض و اراده‌اش رفتار کند، و اغراض متضاد هستند؛ مثلاً غرض زید در مورد عمرو این است که با خالد دشمنی کند، و غرض خالد در مورد زید این است که با عمرو دشمنی کند یا غرضش این است که با او دوستی و محبت ورزد. اگر جوانمرد با عمرو فتوت ورزد و با خالد دشمنی کند، خالد او را مذمت می‌کند و زید او را به فتوت و خلق کریم می‌ستاید. و اگر با خالد دشمنی نکند و با او دوستی و محبت ورزد، خالد او را می‌ستاید و زید او را مذمت می‌کند. پس چون دیدیم که امر بر این حد است و عمومیت ندارد و عقلاً و عادتاً ممکن نیست که انسان در این دنیا یا هر جا که باشد، در مقامی قرار گیرد که متضادین را راضی کند، شایسته است که جوانمرد هوای نفس خود را ترک کند و به خالق خود که مولا و سید اوست، بازگردد و بگوید: «من بنده هستم.» و شایسته است که بنده تابع حکم سید خود باشد، نه تابع حکم نفس خود و نه تابع حکم غیر سید خود. او باید از رضایت‌های مولای خود پیروی کند و در حدود و مراسم او توقف نماید. و نباید از کسانی باشد که در بندگی خود، شریکی برای سیدش قرار داده است. پس باید با سید خود بر اساس آنچه برایش تعیین می‌کند، باشد و در آنچه برایش ترسیم می‌کند، تصرف کند و باکی نداشته باشد که با اغراض عالم موافق باشد یا مخالف. اگر با آنچه موافق است، موافقت کند، این امر به سیدش بازمی‌گردد. پس توقیعی (فرمانی) از دیوان سیدش بر دست رسولی که دلیل و علم بر خروج آن از نزد سیدش و اینکه آن توقیع، توقیع سیدش است، برای او اقامه شده، خارج شده است. پس جوانمرد به احترام آن برخاست و توقیع سیدش را گرفت. و همراه توقیع، مشافهه (سخن شفاهی) نیز بود. پس بندگان را به آنچه سید امر کرده بود که با آنان مشافهه کند، مشافهه کرد. و آن همان شریعت (الشرع) مقرر است و توقیع همان کتاب نازل شده‌ای است که قرآن نامیده می‌شود و رسول همان جبرئیل علیه السلام است. و حاجب الباب (دربان) که رسول ملکی از نزد خدا با توقیع و مشافهه به او می‌رسد، پیامبر بشارت‌دهنده، محمد صلی الله علیه و سلم، یا هر پیامبری از انبیاء در زمان بعثتشان است. پس بندگان ملزم به مراسم سید خود شدند که در توقیع و مشافهه آمده است. پس در نفس خود مالکیت و تدبیری نداشتند.\n\n***\n\n### [جوانمرد کسی است که بر حدود و مراسم مولای خود ایستاده است]\n\nپس هر کس بر حدود سید خود ایستاد و مراسم او را امتثال کرد و در هیچ چیز از آنچه برایش آمده، بر اساس آنچه برایش ترسیم شده، مخالفت نکرد؛ نه با افزودن از طریق قیاس یا رأی و نه با کاستن از طریق تأویل؛ و با جنس خود از مردم، اعم از مؤمن و کافر و عاصی و منافق، آن‌گونه که امر شده بود، رفتار کرد (و جز این چهار صنف نیستند و هر صنفی از اینها نیز طبقاتی دارند: مؤمن شامل مطیع و عاصی و ولی و نبی و رسول و مَلَک و حیوان و نبات و معدن است؛ و کافر شامل مشرک و غیر مشرک است؛ و منافق در ظاهر از درک کافر پایین‌تر است، زیرا منافق در پست‌ترین درک دوزخ است و کافر در درک بالاتر و پایین‌تر است؛ و عاصی در ظاهر به اندازه معصیتش از درجه مؤمن مطیع پایین‌تر است)؛ این کسی که بر مراسم سید خود ایستاده، همان جوانمرد (الفتى) است.\n\nهر انسانی ناگزیر است که همنشین بزرگ‌تر از خود یا کوچک‌تر از خود یا همتای خود باشد، یا در سن و یا در رتبه یا در هر دو. پس جوانمرد کسی است که بزرگ‌تر را در علم یا در سن بزرگ بدارد. و جوانمرد کسی است که بر کوچک‌تر در علم یا در سن رحم کند. و جوانمرد کسی است که همتای خود را در سن یا در علم بر خود ترجیح دهد. و منظورم از «در علم» تنها رتبه است، و علم را به دلیل شرافتش آوردم. زیرا ممکن است پادشاهی در سن و علم کوچک باشد و شخصی از رعیت او در سن و علم بزرگ باشد. اگر پادشاه قدر آنچه را که حق در شریعتش برای بزرگداشت بزرگ‌تر و شرافت علم ترسیم کرده، بداند، پادشاه با او بر اساس آن رفتار می‌کند. و اگر چنین نکند، پادشاهی او بد است. پس شایسته است که جوانمرد شرافت رتبه سلطنت را بشناسد و بداند که او نایب خدا در میان بندگان و خلیفه او در سرزمین‌های اوست. پس با کسی که خداوند او را در آن مقام قرار داده، رفتار کند، حتی اگر حق بر دست او جاری نشود، به آنچه برای آن رتبه لازم است، از شنیدن و اطاعت در خوشی و ناخوشی، بر اساس آنچه سیدش برای او ترسیم کرده است. و آنچه سلطان بر آن است، از اخلاق ستوده یا نکوهیده در ستم و عدل، باید جوانمرد حق سلطان را که خداوند بر او واجب کرده، ادا کند و حق خود را که خداوند برای او در برابر سلطان قرار داده و می‌تواند در روز قیامت آن را مطالبه کند، از او نخواهد، بلکه آن را به عنوان فتوت و رحمت بر او و تعظیم منزلتش، رها کند.\n\nپس جوانمرد کسی است که خصمی ندارد، زیرا آنچه بر عهده اوست، ادا می‌کند و آنچه حق اوست، ترک می‌کند. پس خصمی ندارد.\n\nجوانمرد کسی است که هیچ حرکتی از او به طور کلی عبث (عبثا) صادر نمی‌شود. و معنای این سخن آن است که خداوند شنیده است که می‌گوید: **وما خَلَقْنَا السَّماءَ والْأَرْضَ وما بَيْنَهُما باطِلًا** (و ما آسمان و زمین و آنچه میان آن دو است را باطل نیافریدیم). و این حرکت صادر شده از جوانمرد، از جمله آنچه میان آن دو است، می‌باشد. و همچنین حرکت هر متحرکی که خداوند میان آسمان و زمین آفریده، عبث نیست، زیرا خالق حکیم است. پس جوانمرد کسی است که برای حکمتی در نفس خود حرکت یا سکون می‌کند. و کسی که حالش در حرکاتش چنین باشد، حرکتش عبث نخواهد بود؛ نه در دستش، نه در پایش، نه در بوییدنش، نه در خوردنش، نه در لمس کردنش، نه در شنیدنش، نه در دیدنش و نه در باطنش. پس هر نفسی را در خود می‌داند و آنچه برای آن شایسته است و حکم سیدش در آن چیست. و چنین چیزی عبث نخواهد بود. و اگر حرکت از غیر او صادر شود، آن را عبث نمی‌بیند، زیرا خداوند آن را خلق کرده، یعنی مقدر نموده است. و چون مقدر شده، عبث و باطل نخواهد بود. پس جوانمرد هنگام وقوع آن در عالم، با آن حاضر است. اگر علم حکمت آن برایش گشوده شود، «بَخٍ بَخٍ» (آفرین بر آفرین) می‌گوید و او صاحب عنایت است. و اگر علم حکمت آن برایش گشوده نشود، همین حضور در نفسش کافی است که آن حرکتی مقدر و منسوب به خداست و در آن رازی است که خدا می‌داند. و این مقدار از علم، او را به ادب الهی می‌رساند.\n\n***\n\n### [جوانمردان و ملامتیه]\n\nو این حال تنها برای جوانمردان (الفتيان)، صاحبان قوت (القوة) که بر طبایع نفوس و عادات حاکم هستند، حاصل می‌شود. و در این مقام از این طایفه، تنها ملامتیه (الملامتية) قرار دارند. زیرا خداوند آنان را بر نفوسشان ولایت داده و با روحی از جانب خود بر آن تأییدشان کرده است. پس آنان تصرف کامل و کلمه نافذ و حکم غالب دارند.\n\nآنان سلاطین در صورت بندگان هستند که ملأ اعلی (فرشتگان مقرب) آنان را می‌شناسند. پس هیچ کس از غیر انس و جن نیست، مگر اینکه به فضل آنان اعتراف می‌کند، جز برخی از ثقلین (انس و جن) که حسد مانع آنان می‌شود.\n\n***\n\n### [طبقات جوانمردان و منزلت ایشان]\n\nطبقات جوانمردان همان است که ذکر کردیم: کسی که علم خدا را در حرکات می‌داند و کسی که علم خدا را در آن به طور معین نمی‌داند، اگرچه می‌داند که امری در کار است که خداوند او را بر آن مطلع نکرده است. و اما منزلت ایشان، همان است که در ابتدای باب گفتیم، در قول خداوند: **ثُمَّ جَعَلَ من بَعْدِ ضَعْفٍ قُوَّةً** (سپس بعد از ناتوانی، قوت قرار داد). و این ایجاد از حقایق الهی به آیه دیگری نیز نظر دارد و آن قول خداوند است: **إِنَّ الله هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ** (همانا خداوند است که روزی‌دهنده و صاحب قوت و استوار است). پس آنان با خلق به احسان رفتار می‌کنند، با وجود بدرفتاری خلق با ایشان، مانند روزی دادن خداوند به روزی‌خواران کافر به خدا و نعمت‌های او. پس آنان بر نفوس خود قوت عظمی دارند، به طوری که هوای نفسشان و آنچه نفس بر آن سرشته شده، از حب ثنا و شکر و اعتراف، بر آنان غلبه نمی‌کند.\n\n***\n\n### [فتوت ابراهیم علیه السلام]\n\nخداوند متعال حکایت می‌کند: **سَمِعْنا فَتًى يَذْكُرُهُمْ يُقالُ لَهُ إِبْراهِيمُ** (شنیدیم جوانی از آنان یاد می‌کند که به او ابراهیم گفته می‌شود). پس خداوند فتوت ابراهیم را بر زبان آنان جاری ساخت، زیرا فتوت در این مرتبه بود که او حق قیام در راه خدا را به جا آورد. و هنگامی که آنان را به بت بزرگ ارجاع داد، به نیت طلب سلامت از ایشان بود، زیرا به آنان گفت: **فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ** (پس اگر سخن می‌گویند، از خودشان بپرسید). منظورش توبیخ آنان بود. و به همین دلیل به خود بازگشتند و این همان قول خداوند متعال است: **وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ** (و این حجت ما بود که آن را به ابراهیم در برابر قومش دادیم). در هر حال، این سخن (بَلْ فَعَلَهُ كَبِيرُهُمْ) تنها به دلیل نسبت دادن فعل در عالم الفاظ به بت بزرگشان، دروغ نامیده شد. در حالی که بزرگ، در حقیقت، خداست و خداست که فاعل شکستن بت‌ها به دست ابراهیم است، زیرا او دست ابراهیم است که با آن می‌کوبد، چنانکه خود از خویش خبر داده است. پس این بت‌ها را که گمان می‌کردند خدایانشان هستند، شکست. آیا نمی‌بینی که مشرکان در مورد بت‌هایشان می‌گویند: **ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏** (ما آنان را نمی‌پرستیم، مگر برای اینکه ما را به خدا نزدیک گردانند)؟ پس اعتراف کردند که خدای بزرگی هست که بزرگ‌تر از اینهاست، همان‌گونه که او بهترین آفرینندگان و مهربان‌ترین مهربانان است. پس آنچه ابراهیم علیه السلام گفت، در اعتقاد ابراهیم صحیح بود. و تنها مشرکان خطا کردند، زیرا منظور ابراهیم را از قولش: **بَلْ فَعَلَهُ كَبِيرُهُمْ** (بلکه بزرگشان این کار را کرده است) نفهمیدند. قصد ابراهیم از «بزرگشان»، خداوند متعال بود و اقامه حجت بر آنان. و این در هر دو اعتقاد (اعتقاد ابراهیم و اعتقاد مشرکان به وجود خدای بزرگ) موجود است. و اینکه آنان خدایان هستند، بر گمان آنان است. و وقف بر این جمله (بَلْ فَعَلَهُ كَبِيرُهُمْ) نزد ما نیکو و کامل است. و ابراهیم با این قول خود آغاز کرد که: «این سخن من است.» پس خبر محذوف است و سیاق داستان بر آن دلالت می‌کند: **فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ** (پس اگر سخن می‌گویند، از خودشان بپرسید). پس اگر بت‌ها در آن زمان سخن می‌گفتند، فعل را به خدا نسبت می‌دادند، نه به ابراهیم. زیرا نزد اهل کشف (الکشف) از اهل طریقت ما مقرر است که جماد و نبات و حیوان را خداوند بر معرفت و تسبیح او به حمدش سرشته است. پس فاعلی جز خدا نمی‌بینند. و کسی که این در فطرت اوست، چگونه فعل را به غیر خدا نسبت می‌دهد؟ پس ابراهیم از جانب پروردگارش در مورد بت‌ها بر یقین بود که اگر سخن بگویند، فعل را به خدا نسبت خواهند داد. زیرا او به آنان نگفت: «از آنها بپرسید»، مگر در مقام دلالت، چه سخن بگویند و چه سکوت کنند. اگر سخن نمی‌گفتند، به آنان می‌گفت: «چرا چیزی را می‌پرستید که نمی‌شنود و نمی‌بیند و هیچ سودی برای شما از جانب خدا و برای خودش ندارد؟» و اگر سخن می‌گفتند، می‌گفتند: «خداوند ما را قطعه قطعه کرد.» در مقام دلالت ممکن نیست که بت‌ها غیر از این بگویند. زیرا اگر می‌گفتند بت بزرگ این کار را با ما کرد، دروغ می‌گفتند و این تأییدی از جانب خدا بر کفر آنان و ردی بر ابراهیم علیه السلام می‌بود. زیرا بت بزرگ آنان را قطعه قطعه نکرده بود. و اگر می‌گفتند ابراهیم ما را قطعه قطعه کرد، در نسبت دادن به ابراهیم راست می‌گفتند، اما دلالت بر وحدانیت خدا با باقی ماندن بت بزرگ لازم نمی‌آمد. پس قصد ابراهیم برای دلالت باطل می‌شد و واقع نمی‌گشت و راست نمی‌آمد. **وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ** (و این حجت ما بود که آن را به ابراهیم در برابر قومش دادیم). پس دلالت برای او در سخن گفتنشان (اگر سخن می‌گفتند) و در سخن نگفتنشان (اگر سخن نمی‌گفتند) وجود داشت، همان‌گونه که مقرر کردیم. و شایسته است که قصد انبیاء علیهم السلام چنین باشد. پس آنان دانایان هستند، صلوات الله علیهم. و به همین دلیل به خود بازگشتند و گفتند: **إِنَّكُمْ أَنْتُمُ الظَّالِمُونَ** (همانا شما خود ستمکارید). سپس بر سر خود واژگون شدند و گفتند: **لَقَدْ عَلِمْتَ ما هؤُلاءِ يَنْطِقُونَ** (به یقین می‌دانی که اینها سخن نمی‌گویند). پس خداوند به مانند اینان فرمود: **أَ تَعْبُدُونَ ما تَنْحِتُونَ** (آیا چیزی را می‌پرستید که خود می‌تراشید؟). پس از فتوت ابراهیم این بود که خود را در راه حق احدیت خالقش فروخت، نه در راه خالقش، زیرا شریک وجود خالق را نفی نمی‌کند، بلکه بر نفی احدیت (الأحدية) متوجه می‌شود. پس در این مقام قرار نمی‌گیرد، مگر کسی که قطبیت (القطبية) در فتوت را داشته باشد، به طوری که مقام فتوت بر محور او بچرخد.\n\n***\n\n### [فتوت جوانمرد موسی علیه السلام]\n\nو از فتوت است قول خداوند متعال: **وإذ قال موسى لفتاه** (و هنگامی که موسی به جوانمرد خود گفت). پس خداوند بر زبان عبری، معنایی را بر او اطلاق کرد که در زبان عربی به «فتی» (جوانمرد) تعبیر می‌شود. و او در خدمت موسی علیه السلام بود. و موسی در آن زمان حاجب الباب (دربان) بود، زیرا او شارع (قانون‌گذار) در آن امت و رسول آنان بود. و هر امتی باب خاص الهی دارد که شارع آنان، حاجب آن بابی است که از آن بر خداوند متعال وارد می‌شوند. و محمد صلی الله علیه و سلم حاجب الحجاب (دربان پرده) است، به دلیل عمومیت رسالتش، نه سایر انبیاء علیهم السلام. پس آنان حاجبان او هستند، از آدم علیه السلام تا آخرین نبی و رسول.\n\n***\n\n### [انبیاء، حاجبان پیامبر محمد صلی الله علیه و سلم پیش از زمان بعثت او]\n\nو اینکه گفتیم آنان حاجبان او هستند، به دلیل قول پیامبر صلی الله علیه و سلم است: **آدم فمن دونه تحت لوائي** (آدم و هر که پایین‌تر از اوست، زیر پرچم من است).\n\nپس آنان نائبان او در عالم خلق هستند و او روحی مجرد است که پیش از نشأت جسمش به این امر عارف بود.\n\nاز او پرسیده شد: «چه زمانی پیامبر بودی؟» فرمود: **كنت نبيا وآدم بين الماء والطين** (من پیامبر بودم در حالی که آدم میان آب و گِل بود).\n\nیعنی آدم هنوز وجود نداشت. تا زمانی که زمان ظهور جسم مطهر او صلی الله علیه و سلم فرا رسید. پس حکم هیچ نایبی از نائبان او از سایر حاجبان الهی که همان رسولان و انبیاء علیهم السلام هستند، باقی نماند، مگر اینکه چهره‌هایشان در برابر قیومیت مقام او خضوع کرد، زیرا او حاجب الحجاب بود. پس از شریعت آنان آنچه را که خواست، به اذن سید و فرستنده خود، مقرر کرد و آنچه را که امر به رفع و نسخ آن داشت، از شریعت آنان برداشت. پس شاید کسی که به این امر علم ندارد، بگوید که موسی علیه السلام مانند محمد در شریعت خود مستقل بود.\n\nاما رسول خدا صلی الله علیه و سلم فرمود: **لو كان موسى حيا ما وسعه إلا أن يتبعني** (اگر موسی زنده بود، چاره‌ای جز پیروی از من نداشت).\n\nو پیامبر صلی الله علیه و سلم راست فرمود.\n\n***\n\n### [جوانمرد همیشه در منزل تسخیر است]\n\nپس جوانمرد (الفتى) همیشه در منزل تسخیر است، چنانکه پیامبر علیه السلام فرمود: **خادم القوم سيدهم** (خادم قوم، سید ایشان است).\n\nپس کسی که خدمتش سیادت او باشد، بنده محض و خالص است. و جوانمردان بر یکدیگر بر اساس کسی که فتوت بر او اعمال می‌شود، برتری دارند؛ از یک جهت به واسطه منزلت نزد خدا و از جهت دیگر به واسطه ضعف. پس بالاترین آنان کسی است که بر ضعیف‌ترین از آن جهت فتوت ورزد. و بالاترین آنان نیز کسی است که بر بالاترین نزد خدا از آن جهت دیگر فتوت ورزد.\n\nکسی که بر ضعیف‌تر فتوت می‌ورزد، مانند صاحب سفره است. و او شخصی بود که شیخ او را امر کرد که سفره را نزد مهمانان (الأضياف) ببرد. اما او به خاطر مورچه‌هایی (النمل) که در آن بودند، تأخیر کرد. زیرا از فتوت ندید که مورچه‌ها را از سفره بتکاند، چرا که از فتوت این است که آن را در مورد حیوان به کار برد. پس ایستاد تا مورچه‌ها خودشان از سفره خارج شدند، بدون اینکه این شخص در بیرون راندن مورچه‌ها، عملی قهرآمیز داشته باشد. زیرا جوانمردان فتوت دارند و قهر ندارند، مگر بر نفوس خودشان. و کسی که قوت (القوة) ندارد، فتوت ندارد، همان‌گونه که کسی که قدرت ندارد، حلم ندارد. پس شیخ به او گفت: «به راستی که دقیق عمل کردی.» این مراعات ضعیف‌تر است. اما او با مهمانان فتوت نورزید، زیرا در مبادرت به اکرام آنان تأخیر کرد. به همین دلیل در ابتدای باب بیان کردیم که به دلیل اختلاف اغراض، برای هیچ کس ممکن نیست که مکارم را به طور عمومی به کار برد.\n\nپس جوانمرد در مورد دو شخصی که اغراض متفاوتی دارند و اگر یکی را راضی کند، دیگری را ناخشنود می‌سازد، نظر می‌کند که کدام یک به حکم وقت و حال در شریعت نزدیک‌تر است. پس با آنکه به حکم وقت و حال در شریعت نزدیک‌تر است، فتوت را به کار می‌برد. اگر وقت اجازه داد که با دیگری نیز به وجهی که خدا را راضی کند، فتوت ورزد، آن را نیز انجام می‌دهد. و اگر وقت اجازه نداد، حق مقام را ادا کرده و بدون شک از جوانمردان بوده است. و اگر در مرتبه فعل با همت (بالهمة) و فعل با حس باشد، فتوت را با یکی به حس و با دیگری به همت انجام می‌دهد.\n\n***\n\n### [جوانمرد، همیشه، با خلق بر وجه حق مواجه می‌شود]\n\nمردی بر شیخ ما ابوالعباس عریبی وارد شد و من نزد او بودم. پس در مورد رساندن نیکی (معروف) با هم گفتگو کردند. مرد گفت: «ای سید ما، نزدیکان (الأقربون) به نیکی سزاوارترند.» شیخ بدون توقف گفت: «إلى الله (به سوی خدا).»\n\nو ابوعبدالله محمد بن قاسم بن عبدالکریم تمیمی فاسی به من خبر داد و از ابوعبدالله دقاق حکایت کرد که در شهر فاس بود و در مورد عمل با همت (الفعل بالهمة) گفتگو می‌کردند. ابوعبدالله دقاق گفت: «به یک فضیلت دست یافتم که در آن شریکی ندارم: هرگز کسی را غیبت نکردم و هرگز کسی در حضور من غیبت نشد.» این از عمل با همت است، زیرا بر کسی که عادت به غیبت دارد، فتوت ورزید که نتواند در مجلس او و در حضور او غیبت کند، بدون اینکه شیخ او را از آن نهی کرده باشد. و همچنین بر کسی که با آنچه ناخوشایند است، یاد می‌شود، فتوت ورزید که در حضور او با آنچه ناخوشایند است، یاد نشود. و او سید زمان خود در این باب بود. مناقب او را شیخ ما ابوعبدالله بن عبدالکریم که پیشتر ذکر شد، در کتاب *المستفاد فی ذکر الصالحین والعباد بمدینة فاس وما یلیها من البلاد* آورده است.\n\nپس به حقیقت دانستی که جوانمرد کسی است که نهایت توان و استطاعت خود را در رفتار با خلق، بر وجهی که حق (الحق) را راضی کند، بذل نماید. و **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 4
}