{
  "id": 83,
  "title": {
    "ar": "الباب الثالث والثمانون في ترك الفرار",
    "en": "Chapter Eighty-Three: On Abandoning Flight",
    "ur": "تراسیواں باب: فرار کو ترک کرنے کے بیان میں",
    "fa": "باب هشتاد و سوم در ترک گریز (فرار)"
  },
  "content": {
    "ar": "## (الباب الثالث والثمانون في ترك الفرار)\n\n\n> أين الفرار وما في الكون إلا هو *** وهل يجوز عليه هل هو أو ما هو\n\n\n> إن قلت هل فشهود العين ينكره *** أو قلت ما هو فما هو ليس إلا هو\n\n\n> فلا تفر ولا تركن إلى طلب *** فكل شي‏ء تراه ذلك الله‏\n\n\n### [الكامل هو الذي يشهد الله في كل عين‏]\n\n\nاعلم أيدك الله أن قوله تعالى فَتَرَبَّصُوا عقيب ما تعدد من الأعيان إذن وأمر بالتربص إن كان الله مشهودا لكم في كل ما ذكرناه فإن ذلك الشهود هو المطلوب بهذا الفرار لأن الله أمرنا بالفرار إلى الله وقوله أَحَبَّ إِلَيْكُمْ من الله أي من أجل الله أي شهودكم الله في هذه الأعيان أحب إليكم من شهودكم إياه في أعيان غيرها للمناسبة القريبة التي بينكم وبين هذه الأشياء المذكورة وإن كان الكامل منا يشهده في كل عين ولكن بعض الأعيان قد يكون لبعض الأشخاص أحب من أعيان أخر وقوله ورَسُولِهِ مثل قوله من الله أي ومن أجل رسوله حيث أمركم ببر هؤلاء وجعل لهم حقوقا عليكم فحقوق الآباء والأبناء والإخوان والأزواج والعشائر معلومة منصوص عليها لا تخفى على من وقف على العلم المشروع وكذلك حقوق الأموال نعم المال الصالح للرجل الصالح وحقوق التجارة معلومة فإن صدق التجارة\nلا يكون لغيرها والتاجر الصدوق يحشر يوم القيامة مع النبيين والشهداء كذا قال صلى الله عليه وسلم‏\n\n\nوقوله تَخْشَوْنَ كَسادَها يقول تخافون أن تتركوها لأجل الكساد طلبا للأرباح وأي ربح أعظم من ربح صدق التاجر وقوله وجِهادٍ في سَبِيلِهِ أي ومن أجل أيضا شهودكم إياه تعالى في الجهاد في سبيله لأنه أمركم بهذا وعلمتم أنه مشهودكم في كل ما ذكرناه ولما ذكرناه منزلة شريفة عندكم فَتَرَبَّصُوا أي لا تفروا فإنه ما أمرنا بالفرار إلا لكوننا ليست لنا هذه المشاهدة وقوله حَتَّى يَأْتِيَ الله بِأَمْرِهِ وهو قيام الساعة أو الموت الذي يخرجكم عن مشاهدة هؤلاء وقوله والله لا يَهْدِي الْقَوْمَ الْفاسِقِينَ يقول الخارجين عن حكم هذه المشاهدة التي أنتم فيها والتي دعيتم إليها فما هي في حق أصحاب هذا النظر آية وعيد وإنما هي آية وعد وبشرى وتقرير حال وسكون أي تربصوا إذا كان هذا مشهدكم فقد حصل المطلوب فإن انتقلتم بعد هذا فهو انتقال من خير إلى خير أو من خير أدنى إلى خير أعلى فتفهم وتدبر ما ذكرنا تسعد إن شاء الله تعالى‏\n\n",
    "en": "## Chapter Eighty-Three: On Abandoning Flight\n\nWhere is the flight, when there is nothing in the cosmos but He?\nAnd can one apply to Him the question: Is He 'He' or 'not He'?\n\nIf you say 'Is He?', then the witnessing (شهود) of the eye denies it.\nOr if you say 'What He is not?', then 'What He is not' is nothing but He.\n\nSo do not flee, and do not rely upon seeking,\nFor everything you see, that is Allah.\n\n### [The Perfect Human is the one who witnesses Allah in every entity]\n\nKnow, may Allah strengthen you, that His saying, the Exalted, <<فَتَرَبَّصُوا>> (Then wait), following the enumeration of various entities (الأعيان), is a permission and a command to wait, provided that Allah is witnessed by you in everything We have mentioned. For that witnessing (الشهود) is the goal sought by this flight (الفرار), because Allah commanded us to flee unto Allah.\n\nAnd His saying, <<أَحَبَّ إِلَيْكُمْ>> (more beloved to you) than Allah, means: for the sake of Allah. That is, your witnessing of Allah in these entities is more beloved to you than your witnessing Him in other entities, due to the close affinity (المناسبة) that exists between you and these mentioned things. Although the Perfect Human (الإنسان الكامل) among us witnesses Him in every entity, yet some entities may be more beloved to certain individuals than others.\n\nAnd His saying, <<وَرَسُولِهِ>> (and His Messenger), is like His saying \"than Allah,\" meaning: and for the sake of His Messenger, since he commanded you to be dutiful to these people and established rights for them upon you. The rights of fathers, sons, brothers, spouses, and kin (العشائر) are known and explicitly stated; they are not hidden from one who is acquainted with the revealed Law (العلم المشروع). Likewise are the rights concerning wealth—indeed, good wealth belongs to the righteous man. And the rights of trade are known, for the truthfulness of trade is not for anything other than itself. The truthful merchant will be resurrected on the Day of Resurrection with the Prophets and the martyrs, as the Prophet, peace and blessings be upon him, said.\n\nAnd His saying, <<تَخْشَوْنَ كَسادَها>> (you fear its stagnation/loss), means you fear abandoning them (the trade goods) due to stagnation, seeking profits. And what profit is greater than the profit of the merchant's truthfulness?\n\nAnd His saying, <<وَجِهَادٍ فِي سَبِيلِهِ>> (and striving in His way), means: and also for the sake of your witnessing Him, the Exalted, in the striving in His way, because He commanded you with this, and you know that He is witnessed by you in everything We have mentioned. And what We have mentioned holds a noble station (منزلة شريفة) with you.\n\n<<فَتَرَبَّصُوا>> (Then wait) means: do not flee, for He only commanded us to flee because we do not possess this witnessing (المشاهدة). And His saying, <<حَتَّى يَأْتِيَ اللهُ بِأَمْرِهِ>> (until Allah brings His command), refers to the establishment of the Hour or the death that removes you from the witnessing of these entities.\n\nAnd His saying, <<وَاللهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ>> (And Allah does not guide the defiantly disobedient people), refers to those who depart from the ruling (حكم) of this witnessing in which you are, and to which you have been called. Thus, concerning the people of this contemplation (النظر), this verse is not a sign of threat (وعيد), but rather a sign of promise, good tidings (بشرى), confirmation of a state, and tranquility.\n\nThat is: Wait, for if this is your witnessed state (مشهدكم), then the desired goal has been achieved. If you move beyond this, it is a transition from good to good, or from a lower good to a higher good. So understand and reflect upon what We have mentioned, and you shall be blessed, if Allah, the Exalted, wills.",
    "ur": "(تراسیواں باب: فرار کو ترک کرنے کے بیان میں)\n\nفرار کہاں؟ جبکہ کائنات میں اس (الحق) کے سوا کچھ نہیں ہے\nاور کیا اس پر \"کیا وہ ہے\" یا \"کیا وہ نہیں ہے\" کا اطلاق جائز ہے؟\n\nاگر تم کہو \"کیا وہ ہے\" تو عین کا شہود (الشہود) اس کا انکار کرتا ہے\nاور اگر تم کہو \"کیا وہ نہیں ہے\" تو جو \"وہ نہیں ہے\" وہ بھی اس (الحق) کے سوا کچھ نہیں ہے۔\n\nپس نہ فرار اختیار کرو اور نہ ہی کسی طلب پر بھروسہ کرو،\nکیونکہ ہر وہ شے جسے تم دیکھتے ہو، وہ اللہ ہے۔\n\n[کامل وہ ہے جو ہر عین میں اللہ کا شہود کرتا ہے]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ اللہ تعالیٰ کا یہ فرمان: فَتَرَبَّصُوا (پس انتظار کرو/ٹھہرو)، ان اعیان (الأعیان) کے تعدد کے بعد آیا ہے جن کا ذکر کیا گیا ہے۔ یہ ٹھہرنے کا حکم اس صورت میں ہے جب اللہ ان تمام چیزوں میں آپ کے لیے مشہود ہو جن کا ہم نے ذکر کیا ہے۔ کیونکہ یہی شہود (الشہود) اس فرار (الفرار) کا مطلوب ہے، اس لیے کہ اللہ نے ہمیں اللہ کی طرف فرار کا حکم دیا ہے۔\n\nاور اس کا فرمان أَحَبَّ إِلَيْكُمْ (تمہیں زیادہ محبوب ہیں) \"مِنَ اللَّهِ\" (اللہ سے) یعنی اللہ کی خاطر۔ مراد یہ ہے کہ ان اعیان میں اللہ کا آپ کا شہود، دیگر اعیان میں اس کے شہود سے آپ کو زیادہ محبوب ہے، اس قریبی مناسبت کی وجہ سے جو آپ کے اور ان مذکورہ اشیاء کے درمیان ہے۔ اگرچہ ہم میں سے (الإنسان الکامل) ہر عین میں اس کا شہود کرتا ہے، لیکن بعض اعیان بعض اشخاص کے لیے دیگر اعیان سے زیادہ محبوب ہو سکتے ہیں۔\n\nاور اس کا فرمان ورَسُولِهِ (اور اس کے رسول سے) بھی \"مِنَ اللَّهِ\" (اللہ سے) کی طرح ہے، یعنی اس کے رسول کی خاطر، جہاں اس نے آپ کو ان لوگوں کے ساتھ نیکی کرنے کا حکم دیا اور ان کے حقوق آپ پر مقرر کیے۔ پس والدین، بیٹوں، بھائیوں، بیویوں اور قبیلوں کے حقوق معلوم اور منصوص ہیں، جو اس شخص پر پوشیدہ نہیں ہیں جسے شریعت کا علم حاصل ہے۔ اسی طرح اموال کے حقوق بھی ہیں۔ ہاں، نیک آدمی کے لیے نیک مال (بہت اچھا ہے)، اور تجارت کے حقوق معلوم ہیں۔ کیونکہ تجارت کی سچائی کسی اور چیز کے لیے نہیں ہوتی، اور سچا تاجر قیامت کے دن نبیوں اور شہیدوں کے ساتھ اٹھایا جائے گا، جیسا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا۔\n\nاور اس کا فرمان تَخْشَوْنَ كَسادَها (تمہیں ان کے کساد بازاری کا خوف ہے)۔ وہ فرماتے ہیں کہ تم ڈرتے ہو کہ کہیں تم انہیں کساد بازاری کی وجہ سے چھوڑ نہ دو، منافع کی تلاش میں۔ حالانکہ تاجر کی سچائی کے منافع سے بڑھ کر کون سا منافع ہو سکتا ہے؟\n\nاور اس کا فرمان وجِهادٍ في سَبِيلِهِ (اور اس کی راہ میں جہاد) یعنی اس کی راہ میں جہاد میں بھی اللہ تعالیٰ کے آپ کے شہود کی خاطر، کیونکہ اس نے آپ کو اس کا حکم دیا ہے اور آپ جانتے ہیں کہ وہ ان تمام چیزوں میں آپ کا مشہود ہے جن کا ہم نے ذکر کیا ہے۔ اور جو کچھ ہم نے ذکر کیا ہے، وہ آپ کے نزدیک ایک شرف والی منزلت رکھتا ہے۔\n\nفَتَرَبَّصُوا (پس انتظار کرو/ٹھہرو) یعنی فرار نہ کرو، کیونکہ ہمیں فرار کا حکم صرف اس لیے دیا گیا ہے کہ ہمیں یہ مشاہدہ (المشاھدۃ) حاصل نہیں ہے۔ اور اس کا فرمان حَتَّى يَأْتِيَ الله بِأَمْرِهِ (یہاں تک کہ اللہ اپنا حکم لے آئے) سے مراد قیامت کا قائم ہونا یا وہ موت ہے جو آپ کو ان (اعیان) کے مشاہدے سے نکال دے گی۔\n\nاور اس کا فرمان وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ (اور اللہ فاسق قوم کو ہدایت نہیں دیتا)۔ وہ فرماتے ہیں کہ اس سے مراد وہ لوگ ہیں جو اس مشاہدے کے حکم سے باہر نکل جاتے ہیں جس میں آپ ہیں اور جس کی طرف آپ کو بلایا گیا ہے۔ پس یہ آیت اس نظر (النظَر) کے حاملین کے حق میں وعید کی آیت نہیں ہے، بلکہ یہ وعدہ، بشارت، اور حال کے استحکام اور سکون کی آیت ہے۔ یعنی ٹھہرے رہو، اگر یہ آپ کا مشہد (مشاہدے کی جگہ) ہے تو مطلوب حاصل ہو چکا ہے۔ اگر آپ اس کے بعد منتقل ہوتے ہیں تو یہ ایک خیر سے دوسرے خیر کی طرف یا ادنیٰ خیر سے اعلیٰ خیر کی طرف انتقال ہو گا۔ پس جو کچھ ہم نے ذکر کیا ہے اسے سمجھو اور تدبر کرو، ان شاء اللہ تم کامیاب ہو جاؤ گے۔",
    "fa": "## (باب هشتاد و سوم در ترک گریز)\n\nکجا است گریز، در حالی که در هستی (الوجود) جز او نیست؟\nو آیا بر او رواست که بگویی «آیا او هست» یا «او چیست»؟\nاگر گویی «آیا هست»، شهود عین (مشاهده مستقیم) آن را انکار می‌کند.\nو اگر گویی «او چیست»، پس «او چیست» جز او نیست.\nپس مگریز و به طلب تکیه مکن،\nزیرا هر چیزی که می‌بینی، همان حق (الله) است.\n\n### [انسان کامل (الإنسان الکامل) کسی است که حق (الله) را در هر عین (موجود) مشاهده می‌کند]\n\nبدان، خداوند یاری‌ات کند، که قول خداوند متعال: «فَتَرَبَّصُوا» (پس منتظر بمانید) به دنبال ذکر اعیان متعدد، اذن و امری است به انتظار، اگر حق (الله) در هر آنچه ذکر کردیم برای شما مشهود باشد. زیرا آن شهود (الشهود) همان مطلوب این گریز (فرار) است، چرا که خداوند ما را به «فرار به سوی الله» امر کرده است. و قول او: «أَحَبَّ إِلَيْكُمْ مِنَ اللَّهِ» (نزد شما محبوب‌تر از خداست) یعنی: به خاطر حق (الله). یعنی شهود شما حق (الله) را در این اعیان، نزد شما محبوب‌تر است از شهود او در اعیان دیگر، به دلیل تناسب نزدیکی که میان شما و این اشیاء مذکور وجود دارد. اگرچه انسان کامل (الإنسان الکامل) از میان ما او را در هر عین (موجود) مشاهده می‌کند، اما ممکن است برخی اعیان برای بعضی اشخاص محبوب‌تر از اعیان دیگر باشند.\n\nو قول او: «وَرَسُولِهِ» (و پیامبرش) مانند قول او: «مِنَ اللَّهِ» (از خدا) است، یعنی: و به خاطر رسولش، آنجا که شما را به نیکی کردن به اینان امر کرده و برایشان حقوقی بر عهده شما قرار داده است. حقوق پدران و پسران و برادران و همسران و خویشاوندان معلوم و منصوص است و بر کسی که بر علم شریعت (العلم المشروع) آگاه باشد، پوشیده نیست. همچنین حقوق اموال معلوم است؛ آری، مال صالح برای مرد صالح است. و حقوق تجارت معلوم است، زیرا راستی در تجارت جز برای آن نیست. و تاجر راستگو در روز قیامت با پیامبران و شهیدان محشور می‌شود، چنانکه پیامبر (صلی الله علیه و سلم) فرمود.\n\nو قول او: «تَخْشَوْنَ كَسادَها» (می‌ترسید که کساد شود)، یعنی می‌ترسید که آنها را به خاطر کسادی رها کنید، در طلب سودها. و کدام سود بزرگتر از سود راستی تاجر است؟ و قول او: «وَجِهادٍ فِي سَبِيلِهِ» (و جهاد در راه او)، یعنی و همچنین به خاطر شهود شما حق تعالی را در جهاد در راه او، زیرا او شما را به این امر کرده است و دانسته‌اید که او در هر آنچه ذکر کردیم مشهود شماست، و آنچه ذکر کردیم نزد شما منزلتی شریف دارد.\n\n«فَتَرَبَّصُوا» (پس منتظر بمانید)، یعنی مگریزید، زیرا ما به گریز (فرار) امر نشدیم مگر به این دلیل که این مشاهده (المشاهدة) را نداریم. و قول او: «حَتَّى يَأْتِيَ اللَّهُ بِأَمْرِهِ» (تا زمانی که خداوند امر خود را بیاورد)، و آن برپایی قیامت یا مرگی است که شما را از مشاهده اینان خارج می‌سازد. و قول او: «وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ» (و خداوند قوم فاسق را هدایت نمی‌کند)، یعنی کسانی که از حکم این مشاهده‌ای که در آن هستید و به آن فراخوانده شده‌اید، خارج می‌شوند. پس این آیه در حق اصحاب این نظر، آیه تهدید (وعید) نیست، بلکه آیه وعده و بشارت و تثبیت حال و آرامش است. یعنی منتظر بمانید؛ اگر این مشهد شماست، پس مطلوب حاصل شده است. و اگر پس از این منتقل شوید، آن انتقال از خیری به خیر دیگر است، یا از خیر پایین‌تر به خیر بالاتر. پس آنچه را ذکر کردیم بفهم و تدبر کن تا ان‌شاءالله سعادتمند شوی."
  },
  "page_count": 2
}