{
  "id": 242,
  "title": {
    "ar": "الباب الثاني والأربعون ومائتان في الجمال",
    "en": "Chapter 242: On Beauty",
    "ur": "۲۴۲ واں باب جمال کے بیان میں",
    "fa": "باب دویست و چهل و دوم دربارۀ جمال"
  },
  "content": {
    "ar": "## «الباب الثاني والأربعون ومائتان في الجمال»\n\n\n> جميل ولا يهوى جلي ولا يرى *** وتشهده الألباب من حيث لا تدري‏\n\n\n> ولا تدرك الأبصار منه سوى الذي *** تنزهه عنه عقول ذوي الأمر\n\n\n> فإن قلت محجوب فلست بكاذب *** وإن قلت مشهود فذاك الذي أدري‏\n\n\n> فما ثم محبوب سواه وإنما *** سليمي وليلى والزيانب للستر\n\n\n> فهن ستور مسدلات وقد أتى *** بذلك نظم العاشقين مع النثر\n\n\n> كمجنون ليلى والذي كان قبله *** كبشر وهند ضاق من ذكرهم صدري‏\n\n\n### [أن الجمال الإلهي في جميع الأشياء]\n\n\nاعلم أن الجمال الإلهي الذي تسمى الله به جميلا ووصف نفسه سبحانه بلسان رسوله إنه يحب الجمال‏\n\n\nفي جميع الأشياء وما ثم إلا جمال فإن الله ما خلق العالم إلا على صورته وهو جميل فالعالم كله جميل وهو سبحانه يحب الجمال ومن أحب الجمال أحب الجميل والمحب لا يعذب محبوبه إلا على إيصال الراحة أو على التأديب لأمر وقع منه على طريق الجهالة كما يؤدب الرجل ولده مع حبه فيه ومع هذا يضربه وينتهره لأمور تقع منه مع استصحاب الحب له في نفسه فمآلنا إن شاء الله إلى الراحة والنعيم حيث ما كنا فإن اللطف الإلهي هو الذي يدرج الراحة من حيث لا يعرف من لطف به فالجمال له من العالم وفيه الرجاء والبسط واللطف والرحمة والحنان والرأفة والجود والإحسان والنقم التي في طيها نعم فله التأديب فهو الطبيب الجميل فهذا أثره في القلوب وأثره في الصور ما يقع به العشق والحب والهيمان والشوق ويورث الفناء عند المشاهدة ومن هذه الحضرة تنتقل صورة تجليه فيها إلى المشاهد فينصبغ بها انتقال فيض كظهور نور الشمس في الأماكن ويسمى ذلك النور شمسا وإن لم يكن مستديرا ولا في فلك ثم يفيض الإنسان من تلك الصورة التي ظهر فيها عن الفيض الإلهي على جميع ملكه في رده إلى قصره فينصبغ ملكه كله بصورة جمال لم يكن فلا يفقد الإنسان في ملكه صورة ما شاهدها من ربه في رؤيته فهو عند العلماء بالله تجل دائم دنيا وآخرة لا ينقطع وعند العامة في الجنة خاصة لكونهم لا يعرفون الله معرفة العارفين وليس لتجلى الجلال في الجنة حكم أصلا وإنما محله الدنيا والبرزخ والقيامة وبه تبقي النار والشقاء في الأشقياء مدة بقائهم فيه إلى أن يرتفع الشقاء وتغلب الرحمة فلا يبقى لتجلى الجلال في التعلق حكم وتنفرد به الملائكة بطريق الهيبة والعظمة والخوف والخشوع والخضوع والله أعلم‏\n\n",
    "en": "Chapter Two Hundred and Forty-Two: On Beauty\n\nHe is Beautiful, yet He does not love; Manifest, yet He is not seen.\nThe intellects (الألباب) witness Him from where they do not know.\n\nThe eyes do not perceive of Him except that which\nThe minds of those entrusted with the matter (ذوي الأمر) declare Him transcendent above.\n\nIf you say He is veiled (محجوب), you are not a liar,\nAnd if you say He is witnessed (مشهود), that is what I know.\n\nThere is no beloved there other than Him; rather,\nSulayma, Layla, and the Zaynab(s) are merely for the sake of veiling (للستر).\n\nThey are drawn curtains (ستور مسدلات), and the poetry\nAnd prose of the lovers (العاشقين) have come bearing witness to this,\n\nLike Majnun Layla, and those who came before him,\nSuch as Bishr and Hind—my breast is constrained by mentioning them.\n\n### [That the Divine Beauty is in All Things]\n\nKnow that the Divine Beauty (الجمال الإلهي) by which Allah named Himself Beautiful, and by which He described Himself, exalted is He, upon the tongue of His Messenger, is that He loves Beauty in all things. And there is nothing there except Beauty, for Allah did not create the World (العالم) except upon His own Form (صورته), and He is Beautiful, so the entire World is beautiful. He, exalted is He, loves Beauty, and whoever loves Beauty loves the Beautiful One.\n\nThe Lover does not punish His beloved except for the purpose of conveying comfort (الراحة) or for the sake of discipline (التأديب) regarding a matter that occurred from the beloved out of ignorance (الجهالة). Just as a man disciplines his child despite the love he holds for him, and yet he strikes him and scolds him for things that occur from him, while maintaining love for him in his soul. Thus, our ultimate destination, God willing, is comfort and bliss (النعيم), wherever we may be. For the Divine Subtlety (اللطف الإلهي) is what gradually introduces comfort from where the one upon whom subtlety is bestowed does not know.\n\nBeauty belongs to Him from the World, and in it are hope (الرجاء), expansion (البسط), subtlety (اللطف), mercy (الرحمة), tenderness (الحنان), compassion (الرأفة), generosity (الجود), and beneficence (الإحسان). And the retributions (النقم) which contain blessings (نعم) within their folds—for Him is the discipline. Thus, He is the Beautiful Physician (الطبيب الجميل).\n\nThis is His effect in the hearts. And His effect in the forms (الصور) is that by which passionate love (العشق), affection (الحب), bewilderment (الهيمان), and yearning (الشوق) occur, and which bequeaths Annihilation (الفناء) upon witnessing (المشاهدة). From this Presence (الحضرة), the form of His Self-disclosure (تجلي) within it transfers to the witness (المشاهد), who is then dyed by it, a transfer of emanation (فيض), like the appearance of sunlight in places. And that light is called sun, even if it is not circular or in a celestial sphere (فلك).\n\nThen the human being (الإنسان) emanates from that form in which he appeared, resulting from the Divine Emanation (الفيض الإلهي), upon all his dominion (ملكه) when returning him to his palace. So his entire dominion is dyed with a form of beauty that did not previously exist. Thus, the human being does not lose in his dominion the form that he witnessed of his Lord in his vision (رؤيته).\n\nTherefore, according to the Gnostics of Allah (العلماء بالله), this is a continuous Self-disclosure (تجل دائم) in this world and the Hereafter, which is never interrupted. But according to the common people (العامة), it is specifically in Paradise, because they do not know Allah with the Gnosis (معرفة) of the Gnostics (العارفين).\n\nThe Self-disclosure of Majesty (تجلى الجلال) has no jurisdiction (حكم) whatsoever in Paradise. Rather, its locus is the World (الدنيا), the Isthmus (البرزخ), and the Resurrection (القيامة). And by it, the Fire and wretchedness (الشقاء) remain for the wretched (الأشقياء) for the duration of their subsistence therein, until wretchedness is lifted and Mercy (الرحمة) prevails. Then the Self-disclosure of Majesty retains no jurisdiction in relation to attachment (التعلق). The angels (الملائكة) are singled out for it by way of awe (الهيبة), magnificence (العظمة), fear (الخوف), reverence (الخشوع), and submission (الخضوع). And Allah knows best.",
    "ur": "## باب نمبر دو سو بیالیس: جمال کے بیان میں\n\nوہ جمیل ہے، مگر اس کی چاہت نہیں کی جاتی، وہ ظاہر ہے مگر دیکھا نہیں جاتا۔\nاور عقلیں اس کا شہود (الشہود) کرتی ہیں، اس طرح کہ انہیں خبر بھی نہیں ہوتی۔\n\nاور آنکھیں اس میں سے صرف وہی پاتی ہیں جس سے صاحبانِ امر کی عقلیں اسے منزہ (پاک) قرار دیتی ہیں۔\n\nاگر تم کہو کہ وہ محجوب ہے تو تم جھوٹے نہیں، اور اگر تم کہو کہ وہ مشہود ہے تو یہی وہ بات ہے جو میں جانتا ہوں۔\n\nپس اس کے سوا کوئی محبوب نہیں، اور سلیمی، لیلیٰ، اور زینبیں تو صرف پردے کے لیے ہیں۔\n\nپس وہ لٹکے ہوئے پردے ہیں، اور عاشقوں کے نظم و نثر میں یہی بات آئی ہے۔\n\nجیسے مجنون لیلیٰ اور وہ جو اس سے پہلے تھے، جیسے بشر اور ہند، جن کے ذکر سے میرا سینہ تنگ ہوتا ہے۔\n\n### [کہ جمالِ الٰہی تمام اشیاء میں ہے]\n\nجان لو کہ جمالِ الٰہی، جس کے ذریعے اللہ تعالیٰ نے خود کو جمیل (خوبصورت) نام دیا اور اپنے رسول کی زبان سے اپنی ذات کو یہ وصف دیا کہ وہ تمام اشیاء میں جمال کو پسند کرتا ہے، اور وہاں جمال کے سوا کچھ نہیں ہے۔ کیونکہ اللہ نے عالم کو اپنی صورت پر ہی خلق کیا ہے، اور وہ جمیل ہے۔ پس سارا عالم جمیل ہے۔ اور وہ سبحانہ جمال کو پسند کرتا ہے۔ اور جو جمال کو پسند کرتا ہے وہ جمیل کو پسند کرتا ہے۔ محب اپنے محبوب کو عذاب نہیں دیتا مگر یا تو راحت پہنچانے کے لیے، یا پھر کسی ایسے امر پر تادیب کے لیے جو اس سے جہالت کے سبب سرزد ہوا ہو، جیسا کہ ایک شخص اپنے بیٹے کو محبت کے باوجود تادیب کرتا ہے، اور اس کے باوجود اسے مارتا اور ڈانٹتا ہے ان امور پر جو اس سے سرزد ہوتے ہیں، جبکہ اس کے دل میں اس کے لیے محبت برقرار رہتی ہے۔ پس ہمارا انجام، ان شاء اللہ، راحت اور نعمت کی طرف ہے، ہم جہاں بھی ہوں۔ کیونکہ لطفِ الٰہی ہی وہ ہے جو راحت کو اس طرح داخل کرتا ہے کہ جس پر لطف کیا گیا ہو وہ بھی نہیں جانتا۔\n\nپس جمال عالم سے اس کے لیے ہے، اور اس میں امید، کشادگی، لطف، رحمت، شفقت، مہربانی، سخاوت، احسان، اور وہ سزائیں (نقم) ہیں جن کے اندر نعمتیں پوشیدہ ہیں۔ پس تادیب اسی کی طرف سے ہے، وہ جمیل (خوبصورت) طبیب ہے۔ یہ اس کا اثر دلوں میں ہے، اور اس کا اثر صورتوں میں وہ ہے جس سے عشق، محبت، دیوانگی، اور شوق پیدا ہوتا ہے، اور شہود (الشہود) کے وقت فنا (الفناء) کا وارث بناتا ہے۔ اور اسی حضرت سے اس کے تجلی (التجلی) کی صورت مشاہدہ کرنے والے کی طرف منتقل ہوتی ہے، پس وہ اس سے رنگین ہو جاتا ہے، یہ فیض کا ایسا انتقال ہے جیسے مقامات میں سورج کے نور کا ظاہر ہونا، اور اس نور کو سورج کہا جاتا ہے اگرچہ وہ گول نہ ہو اور نہ ہی کسی فلک میں ہو۔ پھر انسان اس صورت سے جو اس میں فیضِ الٰہی کے ذریعے ظاہر ہوئی ہے، اپنی تمام ملکیت پر فیضان کرتا ہے جب وہ اسے اس کے قصر کی طرف لوٹاتا ہے، پس اس کی ساری ملکیت ایک ایسے جمال کی صورت سے رنگین ہو جاتی ہے جو پہلے نہ تھا۔ پس انسان اپنی ملکیت میں اس صورت کو نہیں کھوتا جس کا اس نے اپنے رب سے اپنے رؤیت میں مشاہدہ کیا تھا۔ پس اللہ کے عالموں (عارفین) کے نزدیک یہ دنیا اور آخرت میں ایک دائمی تجلی (التجلی) ہے جو منقطع نہیں ہوتی، جبکہ عام لوگوں کے نزدیک یہ خاص طور پر جنت میں ہے، کیونکہ وہ اللہ کو عارفین کی معرفت (المعرفۃ) کے ساتھ نہیں جانتے۔ اور تجلیِ جلال کا جنت میں کوئی حکم (اثر) نہیں ہے، بلکہ اس کا مقام دنیا، برزخ، اور قیامت ہے۔ اور اسی کے ذریعے دوزخ اور شقاوت شقی لوگوں میں ان کے وہاں رہنے کی مدت تک باقی رہتی ہے، یہاں تک کہ شقاوت اٹھا لی جائے اور رحمت غالب آ جائے، پس تعلق میں تجلیِ جلال کا کوئی حکم باقی نہیں رہتا۔ اور فرشتے ہیبت، عظمت، خوف، خشوع، اور خضوع کے ذریعے اس (تجلیِ جلال) کے ساتھ منفرد رہتے ہیں۔ اور اللہ ہی بہتر جانتا ہے۔",
    "fa": "باب دویست و چهل و دوم در باب جمال\n\nزیباست و عشق نمی‌ورزد، آشکار است و دیده نمی‌شود؛ و خردمندان او را شهود می‌کنند از آنجا که نمی‌دانند.\nو دیده‌ها از او درک نمی‌کنند مگر آنچه را که عقل‌های صاحبان امر (اولی‌الامر) او را از آن منزه می‌دانند.\nاگر بگویی محجوب است، دروغ نگفته‌ای؛ و اگر بگویی مشهود است، این همان چیزی است که می‌دانم.\nپس در آنجا محبوبی جز او نیست، و سلیمی و لیلی و زینب‌ها تنها برای پرده‌پوشی هستند.\nپس آنان پرده‌هایی آویخته‌اند، و نظم و نثر عاشقان نیز با همین معنا آمده است.\nهمچون مجنون لیلی و آنکه پیش از او بود، مانند بشر و هند، که سینه‌ام از ذکرشان تنگ شد.\n\n### [اینکه جمال الهی در همه چیز است]\n\nبدان که جمال الهی که خداوند به آن «جمیل» نامیده شده و خود را سبحانه به زبان رسولش وصف کرده که او زیبایی (الجمال) را دوست دارد، در همه چیز است، و در آنجا جز جمالی نیست. زیرا خداوند عالم را نیافرید مگر بر صورت خود، و او جمیل است، پس عالم تماماً جمیل است و او سبحانه جمال را دوست دارد. و هر کس جمال را دوست بدارد، جمیل را دوست داشته است. و محب، محبوب خود را عذاب نمی‌کند مگر برای رساندن آسایش یا برای تأدیب به خاطر امری که از روی نادانی از او سر زده است، چنانکه مرد فرزند خود را با وجود محبتش به او تأدیب می‌کند و با این حال او را می‌زند و سرزنش می‌کند به خاطر اموری که از او سر می‌زند، در حالی که محبت او را در دل خود همراه دارد. پس سرانجام ما، ان‌شاءالله، به آسایش و نعمت خواهد بود، هر کجا که باشیم. زیرا لطف الهی است که آسایش را به تدریج وارد می‌کند از جایی که کسی که مورد لطف قرار گرفته، نمی‌داند.\n\nپس جمال از آنِ اوست از عالم، و در آن امید، گشایش (البسط)، لطف، رحمت، حنان، رأفت، جود و احسان است، و نیز نقمت‌هایی که در لفاف خود نعمت‌ها دارند. پس تأدیب از آنِ اوست، او طبیب جمیل است. این اثر او در قلب‌هاست. و اثر او در صورت‌ها چیزی است که به واسطه آن عشق، محبت، شیفتگی (الهيمان) و شوق رخ می‌دهد و در هنگام مشاهده، فنا (الفناء) را به ارث می‌گذارد. و از این حضرت، صورت تجلی (التجلی) او در آن به سوی مشاهده‌کننده منتقل می‌شود و او با آن رنگ می‌پذیرد؛ انتقالی از نوع فیض، مانند ظهور نور خورشید در مکان‌ها که آن نور را خورشید می‌نامند، هرچند که گرد نباشد و در فلک قرار نداشته باشد. سپس انسان از آن صورتی که در آن از فیض الهی ظاهر شده است، بر تمام مُلک خود فیضان می‌کند، در بازگشتش به قصر خود، و تمام مُلک او با صورت جمالی رنگ می‌پذیرد که پیش از آن نبوده است. پس انسان در مُلک خود، صورتی را که از پروردگارش در رؤیت خود مشاهده کرده است، از دست نمی‌دهد. بنابراین، نزد علمای بالله، این تجلی (التجلی) دائمی است که در دنیا و آخرت قطع نمی‌شود. و نزد عوام، این تجلی مخصوصاً در بهشت است، زیرا آنان خداوند را به معرفت (المعرفة) عارفان نمی‌شناسند. و تجلی جلال (التجلی الجلال) اصلاً در بهشت حکمی ندارد، بلکه جایگاه آن دنیا، برزخ و قیامت است. و به واسطه آن، آتش و شقاوت در شقاوتمندان باقی می‌ماند، تا زمانی که شقاوت برطرف شود و رحمت غلبه یابد. پس دیگر برای تجلی جلال (التجلی الجلال) در تعلق، حکمی باقی نمی‌ماند. و فرشتگان به واسطه هیبت، عظمت، ترس، خشوع و خضوع به آن منفرد می‌شوند. و خداوند داناتر است."
  },
  "page_count": 1
}