{
  "id": 259,
  "title": {
    "ar": "الباب التاسع والخمسون ومائتان في معرفة الهجوم والبوادة",
    "en": "Chapter Two Hundred and Fifty-Nine: Concerning the Knowledge of the Sudden Influx (الهجوم) and the Immediate Intuition (البوادة)",
    "ur": "باب دو سو انسٹھ (۲۵۹): ہجوم (الهجوم) اور بوادہ (الْبَوَادَة) کی معرفت میں",
    "fa": "باب دویست و پنجاه و نهم در معرفت هجوم و بواده (البوادة)"
  },
  "content": {
    "ar": "## «الباب التاسع والخمسون ومائتان في معرفة الهجوم والبوادة»\n\n\nفالهجوم ما يرد على قلب بفوت الوقت من غير تصنع منك والبوادة ما يفجأ القلب من الغيب على سبيل الوهلة وهو إما موجب فرح أو ترح‏\n\n\n> نور البوادة فجآت الغيوب على *** قلب تقلب في ظلمائه زمنا\n\n\n> وواردات هجوم الكشف تورثها *** حالا فتلحقه بحالة الزمنا\n\n\n> لو أنها وردت لروح نشأتنا *** ما دبرت روحنا نفسا ولا بدنا\n\n\n### [أن البوادة والهجوم إنما هي واردات القلب‏]\n\n\nاعلم أيدنا الله وإياك بروح منه أن البوادة والهجوم والصحو والسكر والذوق والشرب وأمثالها إنما هي واردات الغيب ترد على القلوب فتؤثر فيها أحوالا مختلفة فيمن قامت به ويسمون ذلك الحال بالوارد وليس للعبد تعمل في تحصيل هذه‏\nالواردات مع أنها ما ترد إلا على قلب مستعد لقبولها فإذا ورد الوارد على القلب فجأة من غير تصنع فيعطيه ذلك الوارد حسرة فوت الوقت فإنه منبه لمن غفل عن حكم وقته فيه فلم يتأدب مع وارد وقته أراد الحق أن ينبهه عناية منه به فبعث إليه هذا الوارد رسولا من الله يكشف له عن فوت وقته وإنه ممن أساء الأدب مع الله فيندمه على ما كان منه من فوت الوقت فيجبر له هذا الندم فضيلة ما فاته من وقته حتى يكون كأنه ما فاته شي‏ء وهذا غلط عظيم فيتزين وقته بزينة ندمه كما كان يتزين بزينة أدبه معه لو حضر معه ولم يفته فهذه فائدة الهجوم يجبر الوقت الذي فإنه ولنا في ذلك‏\n\n\n> بادر لجبر الذي قد فات من عمرك *** ولتتخذ زادك الرحمن في سفرك‏\n\n\nوأما البوادة فهي أيضا فجأة إلهية تفجأ القلوب من حضرة الغيب بحكم الوقت ولا تأتي في اصطلاحهم هذه البوادة إلا أن تعطي فرحا في القلب أو حزنا فتضحك وتبكي وهو قول أبي يزيد ضحكت زمانا وبكيت زمانا يريد أنه كان في حكم البوادة ثم قال وأنا اليوم لا أضحك ولا أبكي يعرف بانتقاله من تأثر حال البوادة فيه إلى حال العظمة ولا تكون البوادة إلا فيمن يتصف ومن لا وصف له لا بديهة له غير أنه لما كانت البوادة من حضرة الهو لم يعرف متى تأتي فإذا وردت إنما ترد فجأة وبغتة فتعطي ما وردت به وتنصرف وأما البديهة التي تعرفها الناس فليست تتقيد بفرح ولا ترح فما هي التي اصطلح عليها القوم وهي عينها إلا أن القوم ما سموا بديهة إلا ما أوجب فرحا أو ترحا وأما إذا لم يوجب ذلك فأحوالهم فيها أحوال الناس غير أن أهل الطريق يعلمون أن البوادة إذا وردت لا يخطئ حكمها البتة ولها الإصابة في كل ما ترد به ولهذا إذا سأل الشيوخ تلاميذهم عن مسألة على تعليم الأخذ عن الله لا يتركونه يفكر في الجواب فيكون جوابهم نتيجة فكر وإنما يقولون لا تجب إلا بما يخطر لك فيما سألت عنه عند السؤال فتنظر إلى قلبك ما ألقى فيه عند ورود السؤال فاذكره ببادئ الرأي فإن لم يفعل فلا يقبل منه الجواب وإن أصاب عن فكر ونظر فإن الله لا يغفل في كل نفس عن قلب أحد من عباده بل هو الرقيب عليه فيهبه في كل نفس بحسب ما يريده سبحانه فأصحاب القلوب المراقبين قلوبهم من أجل آثار ربهم فيها يجيبون بورود الوارد في كل نفس فيعملون بمقتضاه إن وافق الميزان الشرعي الذي قد شرع لسعادتهم وإن لم يوافق طريق السعادة فإن لهم لهذا الوارد أخذا مخصوصا فيأخذونه تنبيها من الحق وتعريفا لا مؤثرا في ظاهرهم ولا باطنهم فهذا قد بينا معنى البوادة والهجوم عند القوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 259: Concerning the Knowledge of the Incursion (*al-Hujūm*) and the Sudden Intuition (*al-Buwādah*)\n\nThe Incursion (*al-Hujūm*) is that which descends upon the heart concerning the missing of the moment (*fawt al-waqt*), without any effort or contrivance on your part. The Sudden Intuition (*al-Buwādah*) is that which surprises the heart from the Unseen (*al-Ghayb*) immediately, and it either necessitates joy or sorrow.\n\n> The light of the Sudden Intuition (*al-Buwādah*) is the sudden arrival of the Unseen,\n> upon a heart that turned over in its darkness for a time.\n> And the incoming states of the Incursion of Unveiling (*Kashf*) bequeath it\n> a spiritual state (*ḥāl*) that joins it to the state of the moment.\n> If they had arrived for the spirit of our creation,\n> our spirit would not have managed a soul nor a body.\n\n### [That the Sudden Intuition (*al-Buwādah*) and the Incursion (*al-Hujūm*) are only Incoming States of the Heart]\n\nKnow—may Allah support us and you with a spirit from Him—that the Sudden Intuition (*al-Buwādah*), the Incursion (*al-Hujūm*), Sobriety (*al-Ṣaḥw*), Intoxication (*al-Sukr*), Tasting (*al-Dhawq*), Drinking (*al-Shurb*), and their likes, are only incoming states (*wāridāt*) of the Unseen (*al-Ghayb*) that descend upon the hearts, affecting them with different spiritual states (*aḥwāl*) in the one who experiences them. They call that state the Incoming State (*al-Wārid*). The servant has no effort in achieving these incoming states, although they only descend upon a heart prepared to receive them.\n\nWhen the Incoming State descends upon the heart suddenly, without contrivance, that Incoming State gives him the regret (*ḥasrah*) of missing the moment (*fawt al-waqt*). For it is an alarm for one who was heedless of the ruling of his moment therein, and thus did not maintain proper spiritual conduct (*adab*) with the incoming state of his moment. The Real (*al-Ḥaqq*) desired to alert him out of care (*‘ināyah*) for him, so He sent this Incoming State to him as a messenger from Allah, revealing to him the missing of his moment, and that he is among those who behaved poorly with Allah. Thus, it causes him to regret what occurred from him regarding the missing of the moment. This regret then compensates for the virtue of what he missed of his moment, until it is as if nothing was missed by him. This is a great error [to equate the two], yet his moment is adorned by the adornment of his regret, just as it would have been adorned by the adornment of his proper conduct had he been present with it and not missed it. This, then, is the benefit of the Incursion (*al-Hujūm*): it compensates for the moment that was missed. And concerning that, we say:\n\n> Hasten to compensate for what has passed of your life,\n> And take the All-Merciful (*al-Raḥmān*) as your provision in your journey.\n\nAs for the Sudden Intuition (*al-Buwādah*), it is also a Divine suddenness that surprises the hearts from the Presence of the Unseen (*Ḥaḍrat al-Ghayb*) according to the ruling of the moment (*ḥukm al-waqt*). In their terminology, this Sudden Intuition only comes if it imparts joy or sorrow to the heart, causing one to laugh or weep. This is the meaning of the saying of Abū Yazīd: \"I laughed for a time and I wept for a time,\" meaning he was under the ruling of the Sudden Intuition. Then he said, \"And today I neither laugh nor weep,\" which indicates his transition from being affected by the state of the Sudden Intuition to the state of Majesty (*al-ʿAẓamah*).\n\nThe Sudden Intuition only occurs in one who possesses attributes (*yaṣṭaf*), and one who has no attribute has no intuition (*badīhah*). However, since the Sudden Intuition (*al-Buwādah*) comes from the Presence of He (*Ḥaḍrat al-Huwa*), it is not known when it will arrive. When it descends, it only descends suddenly and unexpectedly, imparts what it came with, and then departs.\n\nAs for the intuition (*al-badīhah*) known by people, it is not restricted by joy or sorrow. It is not what the People [Sufis] have defined, although it is essentially the same thing, except that the People only named as intuition (*badīhah*) that which necessitates joy or sorrow. But if it does not necessitate that, then their states concerning it are like the states of ordinary people. However, the People of the Path (*Ahl al-Ṭarīq*) know that when the Sudden Intuition (*al-Buwādah*) descends, its ruling is never mistaken; it possesses infallibility (*al-iṣābah*) in everything it brings.\n\nFor this reason, when the Shaykhs ask their disciples a question, based on the teaching of receiving directly from Allah (*al-akhdh ‘an Allāh*), they do not allow them to think about the answer, lest their response be the result of reflection. Rather, they say: \"Answer only with what occurs to you concerning the question at the moment of the asking.\" So you look into your heart for what was cast into it upon the arrival of the question, and mention it as the first thought (*bādi’ al-ra’y*). If he does not do this, his answer is not accepted, even if he answers correctly through reflection and consideration.\n\nFor Allah is not heedless of the heart of any of His servants in any breath; rather, He is the Watcher (*al-Raqīb*) over it, granting it in every breath according to what He—Glory be to Him—desires. Thus, the possessors of hearts who watch over their hearts because of the traces of their Lord within them, respond with the arrival of the Incoming State in every breath, and they act according to its requirement if it conforms to the Legal Balance (*al-Mīzān al-Shar‘ī*) that has been legislated for their felicity. But if it does not conform to the path of felicity, then they have a specific way of receiving this Incoming State: they take it as an alert (*tanbīh*) and an instruction (*ta‘rīf*) from the Real (*al-Ḥaqq*), but not as something that affects their outward or inward state.\n\nThus, we have explained the meaning of the Sudden Intuition (*al-Buwādah*) and the Incursion (*al-Hujūm*) according to the People [Sufis]. And Allah says the Truth, and He guides to the Way. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah says the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو انسٹھ: ہجوم (الهجوم) اور بوادہ (البوادة) کی معرفت میں\n\nہجوم (الهجوم) وہ واردات ہے جو تمہاری کسی کوشش کے بغیر وقت کے فوت ہونے پر قلب پر نازل ہو، اور بوادہ (البوادة) وہ ہے جو غیب (الغيب) سے اچانک (الوهلة) قلب پر وارد ہو، اور یہ یا تو فرحت (فرح) کا موجب ہوتا ہے یا غم (ترح) کا۔\n\n> بوادہ (البوادة) کا نور غیوب سے اچانک اس قلب پر نازل ہوا،\n> جو ایک زمانے تک اپنی تاریکیوں میں پلٹتا رہا۔\n\n> اور کشف (الکشف) کے ہجوم (الهجوم) کی واردات ایک حال پیدا کرتی ہیں،\n> جو اسے زمانے کے حال سے جوڑ دیتی ہیں۔\n\n> اگر یہ (واردات) ہماری نشو و نما کی روح پر وارد ہوتیں،\n> تو ہماری روح نہ نفس کی تدبیر کرتی اور نہ بدن کی۔\n\n[بوادہ (البوادة) اور ہجوم (الهجوم) درحقیقت قلب کی واردات ہیں]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح سے تائید بخشے، کہ بوادہ (البوادة) اور ہجوم (الهجوم)، اور صحو (الصحو) اور سکر (السکر)، اور ذوق (الذوق) اور شرب (الشرب) اور ان جیسی چیزیں درحقیقت غیب (الغيب) کی واردات (الواردات) ہیں جو قلوب پر نازل ہوتی ہیں اور ان میں مختلف احوال پیدا کرتی ہیں جس میں وہ قائم ہوتی ہیں۔ وہ اس حال کو وارد (الوارد) کہتے ہیں۔ بندے (العبد) کے لیے ان واردات کے حصول میں کوئی کوشش نہیں ہے، حالانکہ یہ صرف اسی قلب پر نازل ہوتی ہیں جو انہیں قبول کرنے کے لیے تیار ہو۔\n\nجب وارد (الوارد) قلب پر اچانک بغیر کسی کوشش کے نازل ہوتا ہے، تو وہ وارد اسے وقت کے فوت ہونے کی حسرت دیتا ہے۔ کیونکہ یہ اس شخص کو بیدار کرنے والا ہے جو اپنے وقت کے حکم سے غافل رہا اور اپنے وقت کی واردات کے ساتھ ادب نہ برتا۔ ذات حق (الحق) نے اپنی عنایت سے اسے متنبہ کرنا چاہا، چنانچہ اس وارد کو اللہ کی طرف سے ایک قاصد بنا کر بھیجا جو اس پر اس کے وقت کے فوت ہونے کو ظاہر کرتا ہے، اور یہ کہ وہ ان لوگوں میں سے ہے جنہوں نے اللہ کے ساتھ سوءِ ادب کیا۔ پس یہ وارد اسے وقت کے فوت ہونے پر نادم کرتا ہے، اور یہ ندامت اس کے فوت شدہ وقت کی فضیلت کو پورا کر دیتی ہے، یہاں تک کہ گویا اس کا کچھ بھی فوت نہیں ہوا۔ اور یہ ایک عظیم غلطی ہے۔\n\nپس اس کا وقت اس کی ندامت کی زینت سے آراستہ ہو جاتا ہے، جیسا کہ اگر وہ حاضر ہوتا اور وقت فوت نہ کرتا تو اس کے ادب کی زینت سے آراستہ ہوتا۔ یہ ہجوم (الهجوم) کا فائدہ ہے کہ یہ فوت شدہ وقت کی تلافی کرتا ہے۔ اور اس بارے میں ہمارا قول یہ ہے:\n\n> اپنی عمر میں جو کچھ فوت ہو چکا ہے، اس کی تلافی کے لیے جلدی کر،\n> اور اپنے سفر میں رحمن کو اپنا زادِ راہ بنا لے۔\n\nاور جہاں تک بوادہ (البوادة) کا تعلق ہے، یہ بھی ایک الٰہی اچانک واردات ہے جو وقت کے حکم کے مطابق غیب (الغيب) کی بارگاہ سے قلوب پر حملہ آور ہوتی ہے۔ ان کی اصطلاح میں یہ بوادہ (البوادة) صرف اسی صورت میں آتی ہے جب وہ قلب میں خوشی یا غم پیدا کرے، پس تو ہنستا ہے اور روتا ہے۔ اور یہی ابو یزید کا قول ہے: \"میں ایک زمانے تک ہنسا اور ایک زمانے تک رویا۔\" اس کا مطلب یہ ہے کہ وہ بوادہ (البوادة) کے حکم میں تھا۔ پھر انہوں نے کہا: \"اور آج میں نہ ہنستا ہوں اور نہ روتا ہوں۔\" یہ اس بات کی علامت ہے کہ وہ بوادہ (البوادة) کے حال کے اثر سے عظمت کے حال کی طرف منتقل ہو چکے ہیں۔\n\nاور بوادہ (البوادة) صرف اسی شخص میں ہوتی ہے جو کسی صفت سے متصف ہو، اور جس کی کوئی صفت نہ ہو اس کے لیے کوئی بدیہہ (بديهة) نہیں ہے۔ تاہم، چونکہ بوادہ (البوادة) \"ھو\" (الہو) کی بارگاہ سے ہے، اس لیے یہ معلوم نہیں ہوتا کہ یہ کب آئے گی۔ جب یہ نازل ہوتی ہے تو اچانک اور غیر متوقع طور پر نازل ہوتی ہے، اور جو کچھ لے کر آتی ہے وہ دے کر چلی جاتی ہے۔ اور جہاں تک اس بدیہہ (بديهة) کا تعلق ہے جسے لوگ جانتے ہیں، وہ خوشی یا غم سے مقید نہیں ہوتی۔ پس وہ وہ نہیں ہے جس پر اہل طریق نے اصطلاح قائم کی ہے، حالانکہ وہ عین وہی ہے۔ مگر اہل طریق نے بدیہہ (بديهة) صرف اسی کو کہا ہے جو خوشی یا غم کا موجب ہو۔\n\nاور اگر وہ (بدیہہ) خوشی یا غم کا موجب نہ ہو، تو اس میں ان کے احوال عام لوگوں کے احوال جیسے ہوتے ہیں۔ لیکن اہل طریق جانتے ہیں کہ جب بوادہ (البوادة) وارد ہوتی ہے تو اس کا حکم کبھی خطا نہیں کرتا، اور جو کچھ بھی وہ لے کر آتی ہے اس میں درستگی ہوتی ہے۔ اسی لیے جب شیوخ اپنے مریدوں سے \"اللہ سے اخذ\" کی تعلیم پر کوئی مسئلہ پوچھتے ہیں، تو وہ انہیں جواب میں سوچنے کی اجازت نہیں دیتے تاکہ ان کا جواب فکر کا نتیجہ نہ ہو۔ بلکہ وہ کہتے ہیں کہ تم صرف اسی چیز کا جواب دو جو سوال کے وقت تمہارے دل میں آئے، پس تم اپنے قلب کی طرف دیکھو کہ سوال کے وارد ہونے پر اس میں کیا القا ہوا ہے، اور اسے پہلی رائے (بادئ الرأي) کے طور پر بیان کرو۔ اگر وہ ایسا نہیں کرتا تو اس کا جواب قبول نہیں کیا جاتا، خواہ وہ فکر اور نظر سے درست ہی کیوں نہ ہو۔\n\nکیونکہ اللہ ہر سانس میں اپنے بندوں میں سے کسی کے قلب سے غافل نہیں ہوتا، بلکہ وہ اس پر نگران (الرقیب) ہے۔ پس وہ ہر سانس میں اسے وہ عطا کرتا ہے جو وہ سبحانہ چاہتا ہے۔ لہٰذا، وہ قلوب والے جو اپنے رب کے آثار کی وجہ سے اپنے قلوب کی نگرانی کرتے ہیں، وہ ہر سانس میں وارد (الوارد) کے نزول کے ساتھ جواب دیتے ہیں اور اس کے تقاضے پر عمل کرتے ہیں اگر وہ اس شرعی میزان کے مطابق ہو جو ان کی سعادت کے لیے مقرر کیا گیا ہے۔ اور اگر وہ سعادت کے راستے کے مطابق نہ ہو، تو وہ اس وارد (الوارد) کو ایک مخصوص انداز میں لیتے ہیں؛ وہ اسے ذات حق (الحق) کی طرف سے ایک تنبیہ اور تعریف کے طور پر لیتے ہیں، نہ کہ ان کے ظاہر یا باطن میں مؤثر کے طور پر۔ پس ہم نے اہل طریق کے نزدیک بوادہ (البوادة) اور ہجوم (الهجوم) کا معنی بیان کر دیا ہے۔ اور اللہ یَقُولُ الْحَقَّ وهُوَ یَهْدِی السَّبِیلَ (حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "«باب دویست و پنجاه و نهم در معرفت هجوم و بواده»\n\nهجوم (الهجوم) آن چیزی است که بدون تکلف از جانب تو، به سبب از دست رفتن وقت (فوت الوقت) بر قلب وارد می‌شود؛ و بواده (البوادة) آن چیزی است که ناگهان از غیب بر قلب وارد می‌گردد، بر سبیل وهله (غافلگیری)، و آن یا موجب شادی است یا اندوه.\n\n> نور بواده، غیب‌ها را ناگهان بر *** قلبی که زمانی در تاریکی‌هایش می‌گشت، آشکار ساخت\n> و واردات هجوم (الهجوم) کشف، حالی را به ارث می‌گذارند *** که آن را به حال زمانه پیوند می‌دهد\n> اگر این واردات بر روح نشأت ما وارد می‌شد *** روح ما نه نفسی را تدبیر می‌کرد و نه بدنی را\n\n### [اینکه بواده و هجوم تنها واردات قلب هستند]\n\nبدان – خداوند ما و تو را با روحی از جانب خود تأیید کند – که بواده (البوادة) و هجوم (الهجوم) و صحو (الصحو) و سکر (السکر) و ذوق (الذوق) و شرب (الشرب) و امثال آنها، همگی واردات غیب هستند که بر قلب‌ها وارد می‌شوند و در کسی که این واردات بر او قائم شده، احوال مختلفی را ایجاد می‌کنند و آن حال را «وارد» می‌نامند. بنده در تحصیل این واردات هیچ تلاشی ندارد، با وجود اینکه این واردات جز بر قلب مستعد پذیرش وارد نمی‌شوند.\n\nپس هنگامی که وارد (الوارد) ناگهان و بدون تصنع (التصنع) بر قلب وارد شود، آن وارد به او حسرت از دست رفتن وقت را می‌دهد؛ زیرا این وارد، هشداردهنده‌ای است برای کسی که از حکم وقت خود غافل شده و با وارد وقت خود ادب (تأدب) نکرده است. حق (الحق) می‌خواهد او را از روی عنایت به او بیدار کند، پس این وارد را به عنوان رسولی از جانب خداوند برای او می‌فرستد تا فوت وقت او را آشکار سازد و نشان دهد که او از کسانی است که در برابر خداوند سوء ادب کرده است. پس او را بر آنچه از فوت وقت از او سر زده، پشیمان می‌سازد. این ندامت، فضیلت آنچه از وقتش فوت شده را جبران می‌کند تا جایی که گویی چیزی از دست نداده است. و این یک غلط عظیم است. پس وقت او با زینت ندامت او آراسته می‌شود، همان‌گونه که اگر با حق حاضر بود و وقت را از دست نمی‌داد، با زینت ادب در برابر او آراسته می‌شد. این فایده هجوم (الهجوم) است که وقت از دست رفته را جبران می‌کند. و ما در این باره می‌گوییم:\n\n> بشتاب تا آنچه از عمرت فوت شده را جبران کنی *** و در سفرت، رحمان را توشه خود قرار دهی\n\nو اما بواده (البوادة)، آن نیز یک غافلگیری الهی است که قلب‌ها را از حضرت غیب (الغیب) به حکم وقت غافلگیر می‌کند. این بواده در اصطلاح ایشان نمی‌آید مگر اینکه در قلب شادی یا اندوهی ایجاد کند، پس می‌خندی و می‌گریی. و این همان سخن ابویزید است که گفت: «زمانی خندیدم و زمانی گریستم.» منظورش این است که در حکم بواده بود. سپس گفت: «و من امروز نه می‌خندم و نه می‌گریم.» این نشان‌دهنده انتقال او از تأثر حال بواده به حال عظمت است. بواده جز در کسی که متصف به صفتی است، رخ نمی‌دهد؛ و کسی که وصفی ندارد، بواده‌ای ندارد. با این حال، چون بواده از حضرت «هو» است، معلوم نیست چه زمانی می‌آید. پس هنگامی که وارد می‌شود، تنها به صورت ناگهانی و بغتة (غافلگیرانه) وارد می‌شود، آنچه را که با خود آورده می‌دهد و سپس منصرف می‌شود.\n\nو اما بدیهه‌ای که مردم می‌شناسند، مقید به شادی و اندوه نیست. پس آن بدیهه‌ای که قوم (صوفیان) بر آن اصطلاح کرده‌اند، همان بدیهه‌ی عمومی است، جز اینکه قوم، بدیهه را تنها به آنچه موجب شادی یا اندوه شود، نامیده‌اند. اما اگر موجب آن نشود، احوال ایشان در آن مانند احوال مردم عادی است. با این حال، اهل طریقت می‌دانند که بواده (البوادة) هرگاه وارد شود، حکم آن هرگز خطا نمی‌کند و در هر آنچه با آن وارد می‌شود، اصابت دارد. به همین دلیل، هنگامی که شیوخ از شاگردان خود درباره مسئله‌ای بر اساس تعلیم «اخذ از خداوند» سؤال می‌کنند، اجازه نمی‌دهند که در پاسخ فکر کند تا جوابش نتیجه فکر باشد، بلکه می‌گویند: «پاسخ نده مگر با آنچه در هنگام سؤال، در مورد آنچه از تو پرسیده شده، به قلبت خطور می‌کند.» پس به قلبت نگاه می‌کنی که هنگام ورود سؤال چه چیزی در آن القا شده است، و آن را در بدو رأی (اولین نظر) بیان می‌کنی. اگر چنین نکند، جواب او پذیرفته نمی‌شود، حتی اگر از روی فکر و نظر به درستی رسیده باشد.\n\nزیرا خداوند در هر نفسی از قلب هیچ یک از بندگانش غافل نیست، بلکه او مراقب قلب است و در هر نفس، بر اساس آنچه سبحانه می‌خواهد، به او می‌بخشد. پس صاحبان قلب‌هایی که قلب‌های خود را به خاطر آثار پروردگارشان در آن مراقبت می‌کنند، با ورود وارد (الوارد) در هر نفس پاسخ می‌دهند و به مقتضای آن عمل می‌کنند، اگر با میزان شرعی که برای سعادتشان تشریع شده، موافق باشد. و اگر با طریق سعادت موافق نباشد، برای این وارد، اخذ مخصوصی دارند و آن را به عنوان تنبیهی از حق (الحق) و تعریفی می‌گیرند که نه در ظاهر و نه در باطنشان تأثیری ندارد. پس ما در اینجا معنای بواده (البوادة) و هجوم (الهجوم) را نزد قوم (صوفیان) بیان کردیم. و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) [سوره احزاب، آیه ۴]."
  },
  "page_count": 2
}