{
  "id": 236,
  "title": {
    "ar": "الباب السادس والثلاثون ومائتان في الوجد",
    "en": "Chapter Two Hundred and Thirty-Six, Concerning Ecstasy (الوجد)",
    "ur": "۲۳۶ واں باب وجد (الوجد) کے بیان میں",
    "fa": "باب دویست و سی و ششم در وجد"
  },
  "content": {
    "ar": "## «الباب السادس والثلاثون ومائتان في الوجد»\n\n\n> إذا أفناك عنك ورود أمر *** فذاك الوجد ليس به خفاء\n\n\n> له حكم وليس عليه حكم *** نعم وله التلذذ والفناء\n\n\n> وذا من أعجب الأشياء فيه *** فإن مزاجه عسل وماء\n### [أن الوجد عبارة عما يصادف القلب من الأحوال المفنية له عن شهوده‏]\n\n\nاعلم أن الوجد عند الطائفة عبارة عما يصادف القلب من الأحوال المفنية له عن شهوده وشهود الحاضرين وقد يكون الوجد عندهم عبارة عن ثمرة الحزن في القلب قال الأستاذ وبالجملة فهو حسن الوجد حال والأحوال مواهب لا مكاسب ولهذا كان وجد المتواجد إذا أورثه التواجد الوجد لانفعال نفسه لما يجتلبه مكتسبا والحال لا يكتسب عند القوم فلذلك لا يعول على وجد المتواجد فنظير الوجد في الأحوال عند القوم كمجي‏ء الوحي إلى الأنبياء يفجئوهم ابتداء كما\n\n\nورد في الحديث أن النبي صلى الله عليه وسلم لم يزل يتحنث في غار حرا حتى فجأه الوحي‏\n\n\nولم يكن ذلك مقصودا له فكذلك أهل الوجد إنما هم في سماع من الحق في كل ناطق في الوجود وما في الكون إلا ناطق فهم متفرغون للفهم عن الله في نطق الكون وسواء كان ذلك في نغم أو غير نغم وبصوت أو غير صوت فيفجؤهم أمر إلهي وهم بهذه المثابة فيفنيهم عن شهودهم أنفسهم وعن شهودهم أنهم أهل وجد وعن شهود كل محسوس فإذا حصل لهم ذلك فذلك هو الوجد عند القوم ولا بد لصاحبه من فائدة يأتي بها فإن جاء بغير فائدة ولا مزيد علم فذلك نوم القلب من حيث لا يشعر فإن الذي يأتيه في تلك الفجاة إنما يأتيه من الله ليفيده علما بما ليس عنده مما تشرف به نفسه وتكمل وتربى على غيرها من النفوس فإنه لا يرد الأعلى نفس طاهرة زكية هذا حكمه في هذا الطريق وأما الوجد العام فهو ما ذكرناه في حده في أول الباب فلا يشترط فيه طهارة ولا غيرها إلا في هذا الطريق ولما كان يظهر في العموم مع عدم الطهارة لهذا لا يكون الوجد شاهد صدق إلا على نفسه إنه وجد خاصة لا أنه وجد في الله ولهذا يلتبس على الأجانب فلا يفرقون بين أهل الله فيه وبين المتصورين بصورة أهل الله وإن كانوا ليسوا منهم فالحال الحال ولهذا أهل الله في السماع المقيد بالنغم من شرطهم أن يكونوا على قلب واحد وأن لا يكون فيهم من ليس من جنسهم فلا يحضرون إلا مع الأمثال أو مع المؤمنين بأحوالهم المعتقدين فيهم ومستنده الإلهي كون الحق نعت نفسه بأن قاتل نفسه بادره بنفسه وإن كان ما بادره إلا به ولكن هكذا ورد في النعوت الإلهية فنقره ولا بد فإنه أراد الله بذلك المحل أمرا ما فيما كلفه به فجاء ذلك الأمر الإلهي الشرعي لمجي‏ء زمانه ووقته فصادف المحل على غير ما تعطيه حقيقة ذلك الوارد بالوارد الذي فجأه الحاكم على المحل مع علمنا أنه ما نفذ فيه إلا علم الله فيه ولكن تعمير المراتب أدى إلى اختلاف المذاهب فصار الحق هنا صاحب وجد وموجدة على من قتل نفسه مبادرا كما جاء عنه في غضبه على من غضب عليه ففني المقام الإلهي هنا عن شهود نفسه بأنه غني عن العالمين إذ المقامات تتجاور ولا تتداخل فكل مقام له حكم وقد بين الله لعباده في أخباره الصادقة في كتبه وعلى ألسنة رسله ما هو عليه بما ينسب إليه فمن الآداب أن تنسب إليه ما نسبه إلى نفسه وإن ردته الأدلة العقلية فإن بالدليل العقلي أيضا قد علمنا إن بعض الكون لا يعرفه على حد ما يعرف نفسه فهو المجهول المعروف لا إِلهَ إِلَّا هُوَ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ فإن قلت فالمصادفة تقضي بعدم العلم بما صادف فأين مستنده الإلهي فنقول في قوله ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ مع علمه بما يكون منهم فبتلك النسبة تجري هنا وقد وردت والوجد يفنى كما يفنى الفناء والغيبة ولا بد لصاحب هذه الأحوال ممن يحضرون معه ويتصفون بالبقاء معه والشهود له وإن لم يكونوا بهذه المثابة فما هو المطلوب بهذه الألفاظ واختلفوا في الوجد هل يملك أم لا يملك فذكر القشيري عن بعضهم أنه كان يملك وجده وكان إذا ورد عليه وعنده من يحتشمه ويلزم الأدب معه أمسك وجده فإذا خلا بنفسه أرسل وجده وجعل ذلك كرامة له أنتجها احترام من يجب احترامه وعندنا إن الوجد لا يملك وذلك الذي أرسله ما هو عين ما ورد عليه مع حضور من احترمه فإن المعدوم ما له عين يملكها المحدث فلما خلا ذلك الرجل ظهر حكم الوجد فيه في ذلك الوقت فتخيل أنه مالك لوجده كما يملك القاعد قيامه أي بما هو مستعد للقيام لا إن القيام وجد فيه فلم يقم فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Thirty-Six: Concerning Spiritual Rapture (الوجد)\n\nIf the descent of a matter annihilates you from yourself,\nThat is the Ecstasy (الوجد), in which there is no concealment.\nIt possesses authority, and no authority is possessed over it;\nYes, and for it is delight and Annihilation (الفناء).\nAnd this is among the most wondrous things concerning it,\nFor its temperament is honey and water.\n\n### [That Ecstasy (الوجد) is an expression for the states (الأحوال) that encounter the Heart (القلب), annihilating it from its Witnessing (الشهود)]\n\nKnow that Ecstasy (الوجد), according to the Sufi community (الطائفة), is an expression for the spiritual states (الأحوال) that encounter the Heart (القلب), annihilating it from its own Witnessing (الشهود) and the witnessing of those present. Ecstasy may also be, according to them, an expression for the fruit of sorrow in the Heart. The Master (الأستاذ) said: In summary, Ecstasy is a good spiritual state (حال), and spiritual states are gifts (مواهب), not acquisitions (مكاسب). For this reason, the ecstasy of the one who induces ecstasy (المتواجد)—if that induction (التواجد) brings about Ecstasy—is due to the agitation of his soul by something he acquires, whereas the spiritual state (الحال) is not acquired according to the People (القوم). Therefore, the ecstasy of the one who induces it is not relied upon.\n\nThe parallel for Ecstasy among the spiritual states, according to the People, is like the coming of Revelation (الوحي) to the Prophets, which surprises them suddenly, as is mentioned in the Hadith: that the Prophet, may Allah bless him and grant him peace, continued to devote himself to worship in the Cave of Hira until the Revelation suddenly came upon him, and this was not something he intended. Similarly, the People of Ecstasy (أهل الوجد) are only in a state of hearing from The Real (الحق) in every speaker in Existence (الوجود), and there is nothing in the Cosmos (الكون) except a speaker. Thus, they are devoted to understanding from Allah through the speech of the Cosmos, whether that is in melody or not in melody, with sound or without sound.\n\nThen a Divine matter suddenly surprises them while they are in this station, annihilating them from witnessing themselves, from witnessing that they are People of Ecstasy, and from witnessing every sensible thing. When this occurs to them, that is Ecstasy (الوجد) according to the People. The one who experiences it must bring forth a benefit. If he comes forth without benefit or increased knowledge (علم), then that is the slumber of the Heart (نوم القلب) without him realizing it. For that which comes to him in that sudden surprise comes only from Allah to grant him knowledge (علماً) of what he does not possess, by which his soul is honored, perfected, and elevated above other souls. Indeed, it only descends upon a pure, sanctified soul. This is its ruling in this Path (الطريق).\n\nAs for general Ecstasy (الوجد العام), it is what we mentioned in its definition at the beginning of the chapter; purity (طهارة) or anything else is not stipulated for it, except in this specific Path. Since it appears generally even without purity, Ecstasy is not a truthful witness except upon itself—that it is merely an ecstasy (وجد خاصة), not that it is an ecstasy *in* Allah. For this reason, it is confusing to outsiders (الأجانب), who cannot distinguish between the People of Allah (أهل الله) in this matter and those who merely assume the appearance of the People of Allah, even if they are not truly among them.\n\nThe spiritual state (الحال) is the spiritual state. Therefore, among the conditions for the People of Allah in the audition (السماع) restricted by melody is that they must be of one Heart (قلب واحد) and that there should be none among them who is not of their kind. They only attend with their peers or with those who believe in their spiritual states and hold firm conviction in them.\n\nIts Divine basis (مستنده الإلهي) is that The Real (الحق) described Himself by saying that the one who kills himself is met by Him with Himself—even though he was only met by Him through Him—but this is how it is mentioned in the Divine descriptions, so we must affirm it. For Allah intended a certain matter for that locus (المحل) in what He obligated upon him. That Divine, legal command came when its time and moment arrived, and it encountered the locus (المحل) in a state contrary to what the reality of that incoming matter (الوارد) would grant, by means of the incoming matter that suddenly surprised the ruler over the locus. We know that nothing was executed within it except Allah’s Knowledge (علم الله) concerning it. However, the establishment of the Levels (المراتب) led to the divergence of doctrines (المذاهب). Thus, The Real here became the possessor of Ecstasy (وجد) and finding (موجدة) concerning the one who killed himself preemptively, just as it is reported concerning His wrath upon the one He was angry with. The Divine Station (المقام الإلهي) here was annihilated from witnessing itself as being independent of the worlds, since the stations are adjacent but do not interpenetrate; thus, every station has its own ruling.\n\nAllah has clarified to His servants, in His truthful reports in His Books and upon the tongues of His Messengers, what He is like through what is attributed to Him. It is therefore among the proper manners (الآداب) that you attribute to Him what He attributed to Himself, even if rational proofs (الأدلة العقلية) reject it. For by rational proof, we have also learned that some of the Cosmos (الكون) does not know Him to the extent that He knows Himself. Thus, He is the Unknown Known: <<لَا إِلَٰهَ إِلَّا هُوَ لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ>> (There is no god but He; nothing is like Him, and He is the All-Hearing, the All-Seeing).\n\nIf you say: \"Encountering (المصادفة) necessitates a lack of prior knowledge of what was encountered, so where is its Divine basis?\" We reply: In His saying, <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know), despite His knowledge of what will come from them. By that analogy, the concept of encountering applies here, and it has been reported.\n\nEcstasy (الوجد) is annihilated, just as Annihilation (الفناء) and absence (الغيبة) are annihilated. The possessor of these spiritual states (الأحوال) must have companions present with him who are characterized by Subsistence (البقاء) with him and Witnessing (الشهود) for him. If they are not of this station, then what is sought by these terms?\n\nThey differed concerning whether Ecstasy (الوجد) can be controlled or not. Al-Qushayri mentioned concerning some of them that he was able to control his ecstasy. When it descended upon him while he was in the presence of someone he respected and with whom he maintained proper manners (الأدب), he would restrain his ecstasy. When he was alone, he would release his ecstasy, and this was considered a miracle (كرامة) for him, produced by respecting those who must be respected.\n\nIn our view, Ecstasy cannot be controlled. That which he released when alone was not the exact same thing that descended upon him in the presence of the one he respected. For that which is non-existent does not possess an essence (عين) that a created being (المحدث) can control. When that man was alone, the ruling of Ecstasy manifested in him at that time, and he imagined that he was the controller of his ecstasy, just as one who is sitting controls his standing—meaning, by being prepared to stand, not that standing was found within him and he failed to stand. Know this. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو چھتیس: وجد (الوجد) کے بیان میں\n\nجب کسی امر کا ورود تجھے تجھ سے فنا (الفناء) کر دے،\nتو یہی وجد (الوجد) ہے، جس میں کوئی پوشیدگی نہیں۔\nاس کا حکم چلتا ہے، اور اس پر کوئی حکم نہیں چلتا،\nہاں، اور اس کے لیے لذت اور فنا (الفناء) ہے۔\nاور یہ اس میں سب سے عجیب چیزوں میں سے ہے،\nکیونکہ اس کا مزاج شہد اور پانی ہے۔\n\n### [یہ کہ وجد (الوجد) ان احوال (الأحوال) کا نام ہے جو قلب پر وارد ہوتے ہیں اور اسے اس کے شہود (الشهود) سے فنا کر دیتے ہیں]\n\nجان لو کہ اس طائفہ (صوفیاء) کے نزدیک وجد (الوجد) ان احوال (الأحوال) کا نام ہے جو قلب پر وارد ہوتے ہیں اور اسے اس کے شہود (الشهود) اور حاضرین کے شہود (الشهود) سے فنا (الفناء) کر دیتے ہیں۔ اور کبھی وجد (الوجد) ان کے نزدیک قلب میں حزن (غم) کا ثمرہ بھی ہوتا ہے۔ استاد نے فرمایا: خلاصہ یہ ہے کہ وجد (الوجد) ایک اچھا حال (حال) ہے، اور احوال (الأحوال) مواہب (مواهب) ہوتے ہیں، مکاسب (مکاسب) نہیں۔ اسی لیے متواجد (تواجد کرنے والے) کا وجد (الوجد)، اگر تواجد (التواجد) اسے وجد (الوجد) کی طرف لے جائے، تو وہ اس کی نفسانی انفعالیت کی وجہ سے ہوتا ہے جو وہ کسب کر کے لاتا ہے۔ اور قوم (صوفیاء) کے نزدیک حال (حال) کسب نہیں کیا جاتا، اس لیے متواجد (التواجد) کے وجد (الوجد) پر بھروسہ نہیں کیا جاتا۔\n\nقوم کے نزدیک احوال (الأحوال) میں وجد (الوجد) کی مثال ایسی ہے جیسے انبیاء پر وحی کا آنا، جو انہیں اچانک آ لیتی ہے۔ جیسا کہ حدیث میں آیا ہے:\n\"نبی اکرم صلی اللہ علیہ وسلم غار حرا میں مسلسل عبادت کرتے رہے یہاں تک کہ وحی نے انہیں اچانک آ لیا۔\"\nاور یہ آپ کا مقصود نہیں تھا۔ اسی طرح اہل وجد (الوجد) بھی وجود (الوجود) میں ہر ناطق (بولنے والے) میں الحق (ذات حق) کی طرف سے سماع میں ہوتے ہیں۔ اور کائنات میں کوئی چیز ناطق ہونے کے سوا نہیں ہے۔ پس وہ کائنات کے نطق میں اللہ سے سمجھنے کے لیے فارغ ہوتے ہیں۔ خواہ وہ نغمے میں ہو یا بغیر نغمے کے، آواز کے ساتھ ہو یا بغیر آواز کے۔ پس ان پر ایک امرِ الٰہی اچانک وارد ہوتا ہے، اور وہ اسی حالت میں ہوتے ہیں، تو وہ انہیں اپنے نفسوں کے شہود (الشهود) سے، اور اس شہود (الشهود) سے کہ وہ اہل وجد (الوجد) ہیں، اور ہر محسوس چیز کے شہود (الشهود) سے فنا (الفناء) کر دیتا ہے۔ جب انہیں یہ حاصل ہو جائے تو قوم کے نزدیک یہی وجد (الوجد) ہے۔\n\nاور اس کے صاحب کے لیے ضروری ہے کہ وہ کوئی فائدہ لے کر آئے، اگر وہ بغیر کسی فائدے یا مزید علم کے آئے، تو یہ قلب کی نیند ہے جہاں سے اسے شعور نہیں ہوتا۔ کیونکہ جو چیز اس اچانک وارد ہونے میں اس کے پاس آتی ہے، وہ اللہ کی طرف سے آتی ہے تاکہ اسے ایسے علم سے فائدہ پہنچائے جو اس کے پاس نہیں ہے، جس سے اس کا نفس شرف یاب ہو، کامل ہو، اور دوسرے نفوس پر تربیت پائے۔ کیونکہ یہ صرف پاکیزہ اور ستھرے نفس پر ہی وارد ہوتا ہے۔ یہ اس طریق (راہ) میں اس کا حکم ہے۔\n\nاور جہاں تک وجدِ عام کا تعلق ہے، تو وہ وہی ہے جو ہم نے باب کے شروع میں اس کی حد میں ذکر کیا ہے۔ اس میں طہارت یا کسی اور چیز کی شرط نہیں ہے، سوائے اس طریق (راہ) کے۔ اور چونکہ یہ عموم میں عدمِ طہارت کے ساتھ ظاہر ہوتا ہے، اس لیے وجد (الوجد) صرف اپنے نفس پر ہی صدق کی گواہی دیتا ہے کہ یہ خاص وجد (الوجد) ہے، نہ کہ یہ اللہ میں وجد (الوجد) ہے۔ اسی لیے یہ اجنبیوں پر مشتبہ ہو جاتا ہے، اور وہ اس میں اہل اللہ اور اہل اللہ کی صورت اختیار کرنے والوں کے درمیان فرق نہیں کر پاتے، اگرچہ وہ ان میں سے نہیں ہوتے۔ پس حال (حال) تو حال (حال) ہی ہے۔\n\nاسی لیے اہل اللہ کے لیے نغمے کے ساتھ مقید سماع میں یہ شرط ہے کہ وہ ایک ہی قلب پر ہوں، اور ان میں کوئی ایسا شخص نہ ہو جو ان کی جنس سے نہ ہو۔ پس وہ صرف ہم مثلوں کے ساتھ یا ان مومنین کے ساتھ حاضر ہوتے ہیں جو ان کے احوال (الأحوال) پر یقین رکھتے ہیں اور ان پر اعتقاد رکھتے ہیں۔\n\nاور اس کا الٰہی مستند یہ ہے کہ الحق (ذات حق) نے اپنے آپ کو اس طرح بیان کیا ہے کہ جس نے اپنے نفس کو قتل کیا، اس نے خود اس کی طرف پہل کی۔ اگرچہ اس نے اس کی طرف پہل نہیں کی مگر اسی کے ذریعے، لیکن الٰہی صفات میں اسی طرح وارد ہوا ہے، لہٰذا ہم اسے ضرور تسلیم کرتے ہیں۔ کیونکہ اللہ نے اس محل (محل) سے کوئی ایسا امر مراد لیا جو اس پر فرض کیا گیا تھا۔ پس وہ امرِ الٰہی شرعی اپنے وقت اور زمانے کے آنے پر آیا، اور اس نے محل کو اس کے خلاف پایا جو اس وارد (وارد) کی حقیقت تقاضا کرتی تھی جو اس پر اچانک حاکم ہو گیا۔ حالانکہ ہم جانتے ہیں کہ اس میں صرف اللہ کا علم ہی نافذ ہوا، لیکن مراتب کی تعمیر نے مذاہب کے اختلاف کو جنم دیا۔\n\nپس الحق (ذات حق) یہاں وجد (الوجد) اور موجدہ (وجد کی حالت) کا مالک بن گیا اس شخص پر جس نے اپنے نفس کو پہل کرتے ہوئے قتل کیا۔ جیسا کہ اس کے غضب کے بارے میں آیا ہے اس شخص پر جس پر اس نے غضب کیا۔ پس یہاں مقامِ الٰہی اپنے نفس کے شہود (الشهود) سے فنا (الفناء) ہو گیا کہ وہ غنی عن العالمین (تمام جہانوں سے بے نیاز) ہے، کیونکہ مقامات ایک دوسرے کے ساتھ ہوتے ہیں، لیکن آپس میں داخل نہیں ہوتے۔ پس ہر مقام کا اپنا حکم ہے۔\n\nاور اللہ نے اپنے بندوں کے لیے اپنی سچی خبروں میں، اپنی کتابوں میں اور اپنے رسولوں کی زبانوں پر بیان کر دیا ہے کہ وہ کیا ہے جو اس کی طرف منسوب کیا جاتا ہے۔ پس آداب میں سے یہ ہے کہ تم اس کی طرف وہی منسوب کرو جو اس نے خود اپنی طرف منسوب کیا ہے، اگرچہ عقلی دلائل اسے رد کر دیں۔ کیونکہ عقلی دلیل سے بھی ہم نے جان لیا ہے کہ کائنات کا کچھ حصہ اسے اس طرح نہیں جانتا جس طرح وہ خود کو جانتا ہے۔ پس وہ مجہول (نامعلوم) بھی ہے اور معروف (معلوم) بھی ہے۔\nلَا إِلَهَ إِلَّا هُوَ لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ\n\"اس کے سوا کوئی معبود نہیں، کوئی چیز اس کے مثل نہیں، اور وہ سننے والا، دیکھنے والا ہے۔\" (سورۃ الشوریٰ: ۱۱)\n\nاگر تم کہو کہ مصادفت (اچانک وارد ہونا) اس بات کا تقاضا کرتی ہے کہ جس چیز سے مصادفت ہوئی اس کا علم نہ ہو، تو اس کا الٰہی مستند کہاں ہے؟ تو ہم جواب دیں گے کہ اللہ کے اس قول میں:\nوَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ\n\"اور ہم تمہیں ضرور آزمائیں گے تاکہ ہم جان لیں\" (سورۃ محمد: ۳۱)\nحالانکہ وہ جانتا ہے کہ ان کا کیا حال ہو گا۔ پس اسی نسبت سے یہاں بھی معاملہ جاری ہوتا ہے، اور یہ وارد ہو چکا ہے۔\n\nاور وجد (الوجد) فنا (الفناء) ہو جاتا ہے، جیسے فنا (الفناء) اور غیبت فنا (الفناء) ہو جاتی ہے۔ اور ان احوال (الأحوال) کے صاحب کے لیے ضروری ہے کہ اس کے ساتھ ایسے لوگ حاضر ہوں جو اس کے ساتھ بقا (البقاء) اور اس کے لیے شہود (الشهود) کی صفت سے متصف ہوں۔ اگر وہ اس مرتبے پر نہ ہوں تو ان الفاظ سے کیا مطلوب ہے؟\n\nاور صوفیاء نے اس بارے میں اختلاف کیا ہے کہ کیا وجد (الوجد) پر ملکیت حاصل ہوتی ہے یا نہیں؟ قشیری نے بعض صوفیاء سے ذکر کیا ہے کہ وہ اپنے وجد (الوجد) پر ملکیت رکھتے تھے، اور جب ان پر وجد (الوجد) وارد ہوتا اور ان کے پاس کوئی ایسا شخص ہوتا جس کا وہ احترام کرتے اور جس کے ساتھ ادب لازم ہوتا، تو وہ اپنے وجد (الوجد) کو روک لیتے تھے۔ اور جب وہ تنہا ہوتے تو اپنے وجد (الوجد) کو چھوڑ دیتے تھے۔ اور انہوں نے اسے ایک کرامت قرار دیا جو واجب الاحترام شخص کے احترام کا نتیجہ تھی۔\n\nاور ہمارے نزدیک وجد (الوجد) پر ملکیت حاصل نہیں ہوتی۔ اور جو چیز اس شخص نے تنہا ہونے پر ظاہر کی، وہ بعینہٖ وہ نہیں تھی جو اس پر اس شخص کی موجودگی میں وارد ہوئی تھی جس کا وہ احترام کرتا تھا۔ کیونکہ معدوم (جو چیز موجود نہ ہو) کی کوئی عین (حقیقت) نہیں ہوتی جس پر محدث (مخلوق) ملکیت حاصل کر سکے۔ پس جب وہ شخص تنہا ہوا تو اس وقت وجد (الوجد) کا حکم اس میں ظاہر ہوا، تو اس نے یہ گمان کیا کہ وہ اپنے وجد (الوجد) کا مالک ہے، جیسے بیٹھنے والا اپنے قیام کا مالک ہوتا ہے، یعنی اس چیز کا جو قیام کے لیے مستعد ہے، نہ کہ قیام اس میں موجود تھا اور اس نے قیام نہیں کیا۔ پس یہ جان لو۔\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\n\"اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے۔\" (سورۃ الاحزاب: ۴)",
    "fa": "باب دویست و سی و ششم در وجد (الوجد)\n\n> چون ورود امری تو را از خودت فانی سازد، *** پس آن همان وجد است که در آن پوشیدگی نیست.\n\n> برای آن (وجد) حکمی است و بر آن حکمی نیست، *** آری، و برای آن تلذذ و فنا (الفناء) است.\n\n> و این از شگفت‌انگیزترین چیزها در آن است، *** زیرا مزاج آن عسل و آب است.\n\n### [اینکه وجد عبارت است از آنچه از احوال که قلب را از شهودش فانی می‌سازد]\n\nبدان که وجد (الوجد) نزد اهل طریقت عبارت است از آنچه از احوال (الأحوال) که قلب را از شهود (الشهود) خود و شهود حاضران فانی می‌سازد. و گاهی وجد نزد آنان عبارت است از ثمره حزن در قلب. استاد (الأستاذ) فرمود: و در مجموع، وجد حال نیکویی است، و احوال (الأحوال) موهبتی هستند نه کسبی. به همین دلیل، وجدِ متواجد (المتواجد) اگر تواجد (التواجد) او را به وجد برساند، به دلیل انفعال نفس اوست که آن را به صورت کسبی جلب می‌کند، در حالی که حال (الحال) نزد این قوم کسب نمی‌شود. از این رو، بر وجد متواجد اعتمادی نیست. پس نظیر وجد در احوال نزد این قوم، مانند آمدن وحی بر انبیاست که ناگهان و بدون مقدمه بر آنان وارد می‌شود، چنانکه\n\nدر حدیث آمده است که پیامبر (صلی الله علیه و سلم) پیوسته در غار حرا به عبادت مشغول بود تا اینکه وحی ناگهان بر او وارد شد.\n\nو این امر مقصود او نبود. اهل وجد نیز چنین‌اند؛ آنان در هر ناطقی در هستی (الوجود) و در هر آنچه در کائنات است، از حق (الحق) می‌شنوند، و در کون جز ناطق نیست. پس آنان برای فهمیدن از جانب خدا در نطق کائنات فارغ‌اند، خواه آن نطق در نغمه باشد یا غیر نغمه، با صدا باشد یا بی‌صدا. پس امری الهی ناگهان بر آنان وارد می‌شود در حالی که در این مقام هستند، و این امر آنان را از شهود (الشهود) خودشان، و از شهود اینکه اهل وجد هستند، و از شهود هر محسوس فانی می‌سازد (الفناء). پس چون این حالت برایشان حاصل شود، آن همان وجد نزد این قوم است. و صاحب آن ناگزیر باید فایده‌ای به همراه آورد؛ اگر بدون فایده و بدون علم افزوده (مزيد علم) بیاید، آن خواب قلب است از آنجا که خود نمی‌داند. زیرا آنچه در آن ناگهانی بر او می‌آید، تنها از جانب خدا می‌آید تا او را به علمی که نزدش نیست، فایده بخشد؛ علمی که نفس او بدان شرافت یافته و کامل می‌شود و بر نفوس دیگر برتری می‌یابد. زیرا این (وجد خاص) جز بر نفس طاهر و تزکیه‌شده وارد نمی‌شود. این حکم آن در این طریق است.\n\nاما وجد عام (الوجد العام) همان است که در تعریف آن در ابتدای باب ذکر کردیم، و در آن طهارت و غیر آن شرط نیست، مگر در این طریق (طریق خاص). و چون در عموم با عدم طهارت نیز ظاهر می‌شود، به همین دلیل وجد شاهد صدق نیست، مگر بر نفس خود که وجدی خاص یافته است، نه اینکه وجد در خدا یافته باشد. به همین دلیل بر بیگانگان مشتبه می‌شود و آنان میان اهل الله (أهل الله) در این حالت و کسانی که خود را به صورت اهل الله درآورده‌اند، اگرچه از آنان نیستند، تفاوتی نمی‌گذارند. پس حال، همان حال است. به همین دلیل، اهل الله در سماع مقید به نغمه (السماع المقيد بالنغم) شرط می‌کنند که بر یک قلب باشند و کسی که از جنس آنان نیست در میانشان نباشد. پس جز با هم‌جنسان (الأمثال) یا با مؤمنان به احوالشان و معتقدان به آنان، حاضر نمی‌شوند.\n\nو مستند الهی (مستنده الإلهي) آن این است که حق (الحق) خود را چنین وصف کرده که قاتل نفس خود را با نفس خود مبادرت ورزیده است، اگرچه او را جز به واسطه خودش مبادرت نورزیده است، اما این‌گونه در اوصاف الهی وارد شده است. پس ما آن را می‌پذیریم، زیرا خداوند با آن محل، امری را در آنچه او را بدان مکلف کرده، اراده نموده است. پس آن امر الهی شرعی به دلیل فرا رسیدن زمان و وقتش آمد، و با محلی برخورد کرد که حقیقت آن وارد (وارد الهی) اقتضا نمی‌کرد، با آن وارد ناگهانی که بر محل حاکم شد. با علم ما به اینکه جز علم خدا در آن نفوذ نکرده است، اما آبادانی مراتب (تعمير المراتب) به اختلاف مذاهب انجامید. پس حق (الحق) در اینجا صاحب وجد و هیجان بر کسی شد که نفس خود را مبادرت‌کننده کشت، چنانکه در غضب او بر کسی که بر او غضب کرده، آمده است. پس مقام الهی در اینجا از شهود (الشهود) خود فانی شد به اینکه او بی‌نیاز از جهانیان (غني عن العالمين) است، زیرا مقامات (المقامات) در کنار هم قرار می‌گیرند و در هم تداخل نمی‌کنند. پس هر مقامی حکمی دارد. و خداوند در اخبار صادق خود در کتاب‌هایش و بر زبان رسولانش، آنچه را که او بر آن است و به او نسبت داده می‌شود، برای بندگانش بیان کرده است. پس از آداب است که آنچه را او به خود نسبت داده، به او نسبت دهی، اگرچه ادله عقلی آن را رد کند. زیرا با دلیل عقلی نیز دانسته‌ایم که برخی از کائنات او را آن‌گونه که خود را می‌شناسد، نمی‌شناسند. پس او مجهولِ معروف است: لَا إِلَهَ إِلَّا هُوَ لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ (هیچ معبودی جز او نیست؛ چیزی مانند او نیست و او شنوای بیناست).\n\nاگر بگویی: پس برخورد ناگهانی (المصادفة) مقتضی عدم علم به آنچه با آن برخورد شده است، می‌باشد؛ پس مستند الهی آن کجاست؟ می‌گوییم: در قول او: وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ (و قطعاً شما را می‌آزماییم تا بدانیم)، با وجود علم او به آنچه از آنان سر می‌زند. پس آن نسبت در اینجا نیز جاری می‌شود و وارد شده است. و وجد فانی می‌شود، همان‌گونه که فنا (الفناء) و غیبت فانی می‌شوند. و صاحب این احوال ناگزیر به کسانی نیاز دارد که با او حاضر باشند و به بقا (البقاء) و شهود (الشهود) او متصف باشند، حتی اگر خودشان در این مقام نباشند. پس مطلوب از این الفاظ همین است.\n\nو در مورد اینکه آیا وجد (الوجد) قابل اختیار است یا خیر، اختلاف کرده‌اند. قشیری (القشيري) از برخی نقل کرده است که او مالک وجد خود بود و هرگاه وجد بر او وارد می‌شد و کسانی نزد او بودند که از آنان حیا می‌کرد و رعایت ادب لازم بود، وجد خود را نگه می‌داشت. و چون تنها می‌شد، وجد خود را رها می‌کرد. و این را کرامتی (كرامة) برای او قرار داد که نتیجه احترام به کسی بود که احترامش واجب است. نزد ما، وجد قابل اختیار نیست. و آنچه او رها می‌کرد، عین همان چیزی نبود که با حضور کسی که احترامش می‌کرد، بر او وارد شده بود. زیرا معدوم (المعدوم) عین و هویتی ندارد که محدث (المحدث) مالک آن باشد. پس چون آن مرد تنها شد، حکم وجد در آن زمان در او ظاهر شد. پس او خیال کرد که مالک وجد خود است، همان‌گونه که شخص نشسته مالک ایستادن خود است؛ یعنی به واسطه استعدادی که برای ایستادن دارد، نه اینکه ایستادن در او موجود بوده و او نایستاده باشد. پس این را بدان. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}