{
  "id": 353,
  "title": {
    "ar": "الباب الثالث والخمسون وثلاثمائة في معرفة منزل ثلاثة أسرار طلسمية حكمية تشير إلى معرفة منزل السبب وأداء حقه وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Fifty-Third: Concerning the knowledge of the station of three talismanic, wisdom-based secrets which point to the knowledge of the station of the Cause and the fulfillment of its due. And it is from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو ترپن (۳۵۳): تین طلسمی (طلسمية) حکمی (حكمية) اسرار کے منزل کی معرفت کے بیان میں جو منزلِ سبب (السبب) کی معرفت اور اس کا حق ادا کرنے کی طرف اشارہ کرتے ہیں، اور یہ (منزل) الحضرة المحمدية (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و پنجاه و سوم در معرفت منزل سه راز طلسمی حکمی که به معرفت منزل سبب و ادای حق آن اشاره دارد و آن از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الثالث والخمسون وثلاثمائة في معرفة منزل ثلاثة أسرار طلسمية حكمية تشير إلى معرفة منزل السبب وأداء حقه وهو من الحضرة المحمدية»\n\n\n> قل للإمام أبي إن كنت تأنس بي *** فإن أنسي بربي لا بأشكالي‏\n\n\n> أنسي بربي لا بالوالدين ولا *** بالأهل إن وجود المثل أمثالي‏\n\n\n> مني هربت ومني استوحشت خلقي *** فكيف أنسي بالماضي وبالحال‏\n\n\n> وكيف يؤنسني من لا يناسبني *** ولا يناسبه شي‏ء من أحوالي‏\n\n\n> والمثل ضد فكيف الأنس يا سكنى *** والعقل يمنعه فالحال كالحال‏\n\n\n> لما جهلت الذي لا شي‏ء يشبهه *** سواى أخطرته جهلا على بالي‏\n\n\n> ما لي أقول بأن الحق يطلبني *** ولست أعرفه مالي به مالي‏\n\n\n> الأنس يطلبنا بأن يقوم بنا *** وليس يأنس دون الدون بالعالي‏\n\n\n> قد حرت فيه وإيحاشي يلازمني *** ولست أطرده إلا بآمالي‏\n\n\n> لا ذاق أنسا حكيم ما بدت مثل *** لعينه من علوم أو من أعمالي‏\n### [أن الله سلط على النفس الناطقة بهذه النشأة الدنيوية ثلاثة أشياء]\n\n\nاعلم أيدك الله بروح منه أن الله لما خلق النفس الناطقة المدبرة لهذا الهيكل المسمى إنسانا سلط عليه في هذا المزاج الخاص بهذه النشأة الدنيوية ثلاثة أشياء جعلها من لوازم نشأته النفس النباتية والنفس الشهوانية والنفس الغضبية فأما النفس النباتية والغضبية فيزولان في نشأة أهل السعادة في الجنان ولا يبقى في تلك النشأة إلا النفس الشهوانية فهي لازمة للنشأتين وبها تكون اللذة لأهل النعيم وأما النفس النباتية فهي التي تطلب الغذاء لتجبر به ما نقص منه فينمي به الجسم فلا ينفك يتغذى دائما فأما من خارج يجلب إليها وهو المعبر عنه بالأكل وإما من حيث شاء الله من غير تعيين ولها أربعة وزعة الجاذب والماسك والهاضم والدافع فأما الجاذب فحكمه أن ينقل الغذاء من مكان إلى مكان فينقله من الفم إلى المعدة ومن المعدة إلى الكبد ومن الكبد إلى القلب وإلى سائر العروق وأجزاء البدن فإنه المقسم على أجزاء البدن ما يحتاج إليه مما يكون به قواها ويساعده الدافع فإنه يدفع به عن مكانه إذا رآه قد استوفى حقه من ذلك المكان وما بقي له فيه شغل ودفع به حتى لا يزاحم غيره إذا ورد فهو يساعد الجاذب وأما الماسك فهو الذي يمسكه في كل مكان حتى بأخذ التدبير فيه حقه فإذا رأى أنه وفى حقه ترك يده عنه فتولاه الدافع والجاذب وأما الهاضم فهو الذي يغير صورة الغذاء ويكسوه صورة أخرى حتى يكون على غير الصورة التي كان عليها فإنه كان على صورة حسنة وذا رائحة طيبة فلما حصل بيده وغير صورة شكله وكساه صورة متغيرة لريح مبددة النظم ولهذا سمي هاضما من الاهتضام ولكن وجود الحكمة في هذا الاهتضام فإنه لو لا الهضم ما وجد المقصود الذي قصده الغاذي بالغذاء فظاهر الأمر فساد وباطنه صلاح ولا يزال هذا الهاضم بنقله من صورة إلى صورة والماسك يمسك عليه بقاءه حتى يدبر فيه ما يعطيه علمه وما وكل به فإذا استوفياه بحسب ذلك الموطن تركاه وأخذه الجاذب والدافع فإذا أنزلاه ونقلاه إلى المكان الآخر رداه إلى الماسك وإلى الهاضم فيفعلان فيه مثل ما فعلاه في المكان الذي قبله ويفتح فيه صورا مختلفة فيأخذه الجاذب والدافع فيسلكان بتلك الصور طرقا معينة لا يتعديانها ما دام يريد الله إبقاء هذه النشأة الطبيعية ولو لا هؤلاء الوزعة ما تمكنت النفس النباتية من مطلوبها فإذا أراد الله هلاك هذه النشأة الطبيعية طلبت النفس النباتية مساعدة الشهوة لها حتى تنبعث النفس المدبرة لجلب ما تشتهي فلم تفعل وأضعفها الله باستيلاء سلطان الحرارة على محلها فضعفت كما يضعف السراج في نور الشمس فيبقى لا حكم له فتبقى النفس النباتية بحقيقتها تقول لوزعتها لا بد لي من شي‏ء أتغذى به فتتغذى بأخلاط البدن وما بقي فيه من الفضول ووزعتها قد ضعفوا أيضا مثلها فلا تزال النشأة في نقص متزايد والدافع يقوى والجاذب يضعف وكذلك الماسك إلى أن يموت الإنسان ولو لا هذا التدبير بهذه الآلات لهذه النشأة ما سمعت أذن ولا نظر بصر ولا كان حكم لشي‏ء من هذه القوي الحسية والمعنوية وأما النفس الشهوانية فسلطانها في هذا الهيكل طلب ما يحسن عندها ولا تعرف هل يضرها ذلك أو ينفعها وهذا ليس إلا في نشأة الإنسان وأما سائر الحيوان فلا يتناول الغذاء إلا بالإرادة لا بالشهوة ليدفع عن نفسه ألم الجوع والحاجة فلا يقصد إلا لما له فيه المنفعة ويبقى حكم الشهوة في الحيوان في الاستكثار من الغذاء فمنه يدخل عليه الخلل والإنسان يدخل عليه الخلل كذلك من الاستكثار مما ينفع القليل منه ومن تناوله ما لا ينفعه أصلا مما يطلبه الشهوة ويتضرر به المزاج فهذا الفارق بين الإنسان والحيوان في تناول الغذاء فالنفس الشهوانية للنفس النباتية كما قيل في ذلك‏\n\n\n> إذا امتحن الدنيا لبيب تكشفت *** له عن عدو في ثياب صديق‏\n\n\nفلها الصداقة مع النفس النباتية لأنها المساعدة لها على الغذاء وتناوله وهي العدوة حيث تدخل عليها من الأغذية ما يضرها ولا ينفعها فمساعدتها للنفس النباتية إنما هو بالعرض لا بالذات فهي العدو اللازم الذي لا يمكن مفارقته ولا يؤمن شره وأما النفس الغضبية وهي السبعية فهي التي تطلب القهر لما رأت من تفوقها على سائر الحيوان بما أعطيت من القوي والتمكن من التصرف وأبصرت العالم مسخرا لنشأتها ولمدبرها ورأت أن في الوجود عوارض تعرض اتفاقية أو لأسباب تظهر يمنعها ذلك كله من وصولها إلى أغراضها فتغضب لعدم حصول الغرض فإن كان لها سلطان قوي مساعد من همة فعالة أو آمرة من خارج لها بها إمضاء غضبها في المغضوب عليه أهلكته وأظهرت‏\nالانتقام منه ولا تعرف ميزان الظلم والعدل في ذلك الانتقام والقهر لأن ذلك ما هو لها وإنما ذلك للعقل وناموس الوقت ولذا أخطأ الشاعر الذي قال‏\n\n\n> الظلم من شيم النفوس فإن تجد *** ذا عفة فلعلة لا يظلم‏\n\n\nفلو قال القهر بدلا من الظلم لقال الصحيح فإن الظلم لا يأتي به إلا الشرعي فمنه يعرف فليس للنفس إلا القهر حمية جاهلية فإن صادفت الحق كانت حمية دينية ولهذا يحمد الغضب لله وفي الله ويذم الغضب لغير الله وفي غير الله وهذا من تدبير الحكيم الحق الذي رتب الأمور مراتبها وأعطى كل شي‏ء خلقه ليكون آية له لأولي الألباب ولسائر أهل الآيات من العالم إذ كانوا مختلفي المأخذ في ذلك كما عددهم الله في كتابه العزيز الذي لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ تَنْزِيلٌ من حَكِيمٍ حَمِيدٍ وضم هذه الآيات كلها في كتاب الوجود الذي ما فيه سوى البيان والرحمة لا غير فكل ما ظهر في العالم من جانب الحق أو من معاملة بعضه بعضا يناقض الرحمة فأمر عرضي في الكتاب أبان عنه البيان حيث هو ذلك العارض ما هو في نفس هذا الكتاب فالكتاب رحمة كله من حيث ذاته وبيان فما جعله الله عذابا فالله أكرم أن يعذب خلقه عذابا لا ينتهي الأمر فيه إلى أجل ضمه وعينه بيان الكتاب ثم يرجع الحكم للرحمة هذا ما لا بد منه والله غَفُورٌ رَحِيمٌ‏\n\n\n### [اطلاع ابن العربي عن حكم غريب إلهي يتعلق بالعالم الإنساني‏]\n\n\nثم لتعلم إن الله أطلعني على حكم غريب يتعلق بالعالم الإنساني ولا أدري هل له تعلق بما عدا الإنسان من العالم أم لا ما أطلعني الله على ذلك ولا ينبغي لي أن أقول عن الله ما لا أعلم الله يعصمني وإياكم من ذلك وهذا الحكم يظهر في العالم الإنساني عند انقضاء كل ثلاثة آلاف عام من أعوام الدنيا وهو عند الله يوم واحد لا أدري لأي اسم إلهي يرجع هذا اليوم لأني ما عرفت به غير إن الحق تعالى قسمه لي ثلاثة أثلاث كل ثلث ألف سنة والألف سنة يوم واحد من أيام الرب هذا الذي أخبرني به ربي وهذه المدة التي هي ثلاثة آلاف سنة حكمها في الإنسان حكم بدء وعود وحياة وموت كيف يشاء الله وحيث يشاء الله غير إن الله لما رقم لي هذا الأمر في درجي كلمات وقفت عليها مشاهدة جعل كلمة بفضة وكلمة بذهب على هذه الصورة رقمها فعلمت أنها أحوال وأحكام تظهر في الإنسان في الجنة بمرور هذه المدة المعينة وما أثروا لله عندي خبر إلهي ورد على ما أثر هذا من الجزع والخوف المقلق فما سكن روعي إلا كون الكلمات من ذهب وفضة الكلمة الذهبية إلى جانبها الكلمة الفضية ولما فرغ هذا الإلقاء الإلهي والتعريف الرباني وسكن عني ما كنت أجده من ألم هذا التجلي في هذه الصورة وسرى عني نظمت نظم إلهام لا نظم روية ما أذكره‏\n\n\n> لنا حبيب نزيه لا أسميه *** وهو الحبيب الذي حار الورى فيه‏\n\n\n> إن قلت هذا فإن الحد يحصره *** أو قلت هو فكلام لست أدريه‏\n\n\n> كيف السبيل إلى غيب وأعيننا *** في كل حين تراه من تجليه‏\n\n\n> أو قلت عندي جاء الظرف يطلبه *** والظرف حق ولكن ليس يحويه‏\n\n\n> ما إن رأيت وجودا لست أدريه *** إلا الذي أنا معنى من معانيه‏\n\n\n> قد حرت فيه وحار الكون في وكم *** أذناي قد سمعت من قولة فيه‏\n\n\n> هذا الذي وجلال الحق أمرضه *** فهل له عوض منه فيشفيه‏\n\n\n> هو الشفاء هو الداء فأين أنا *** العين واحدة وكلنا فيه‏\n\n\nضمير أمرضه يعود على الكون‏\n\n\n### [أن لنا من الله الإلهام لا الوحي‏]\n\n\nواعلم أن لنا من الله الإلهام لا الوحي فإن سبيل الوحي قد انقطع بموت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وقد كان الوحي قبله ولم يجي‏ء خبر إلهي أن بعده وحيا كما قال ولَقَدْ أُوحِيَ إِلَيْكَ وإِلَى الَّذِينَ من قَبْلِكَ ولم يذكر وحيا بعده وإن لم يلزم هذا وقد جاء الخبر النبوي الصادق في عيسى عليه السلام وقد كان ممن أوحي إليه قبل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه عليه السلام لا يؤمنا إلا منا\n\n\nأي بسنتنا فله الكشف إذا نزل والإلهام كما لهذه الأمة ولا يتخيل في الإلهام أنه ليس بخبر إلهي ما هو الأمر كذلك بل هو خبر إلهي وإخبار من الله للعبد على يد ملك مغيب عن هذا الملهم وقد يلهم من الوجه الخاص فالرسول والنبي يشهد الملك ويراه رؤية بصر عند\nما يوحى إليه وغير الرسول يحس بأثره ولا يراه رؤية بصر فيلهمه الله به ما شاء أن يلهمه أو يعطيه من الوجه الخاص بارتفاع الوسائط وهو أجل الإلقاء وأشرفه وهو الذي يجتمع فيه الرسول والولي أيضا فأصابع الرحمن للوجه الخاص ولمة الملك للوجه المشترك والإلهام إلهي أكثره لا واسطة فيه فمن عرفه عرف كيف يأخذه ومحله النفس قال تعالى فَأَلْهَمَها فالفاعل هويته فهو الملهم لا غيره فُجُورَها ليعلمه لا ليعمل به وتَقْواها ليعلمه ويعمل به فهو إلهام إعلام لا كما يظنه من لا علم له ولذلك قال وقَدْ خابَ من دَسَّاها والدس إلحاق خفي بازدحام فالحق العمل بالفجور بالعمل بالتقوى وما فرق في موضع التفريق فجمع بينهما في العلم والعمل والأمر ليس كذلك وسبب جهله بذلك أنه رمى ميزان الشرع من يده فلو لم يضع الميزان من يده لرأى أنه مأمور بالتقوى منهي عن الفجور مبين له الأمران معا ولما أضاف الله الفجور لها والتقوى علمنا أنه لا بد من وقوعهما في الوجود من هذه النفس الملهمة وكان الفجور لها ما انفجر لها عن تأويل تأولته فما أقدمت على المخالفة انتهاكا للحرمة الإلهية ولا يتمكن لها ذلك وكان هذا من رحمة الله بالأنفس ولما كان الفجر فجرين فجر كاذب وفجر صادق وهو الفجر المستطيل الكاذب ألهمها تقواها أي تتقي في فجورها الفجر المستطيل لأنه يستطيل عليها بالأولية لتاخر المستطير الذي يطير حكمه عنها فألهمها في فجورها الفجر المستطيل فتبين لها بهذا الانفجار ما هو المشكوك فيه من غير المشكوك وتقواها وما تتقي به ما يضرها حكمه فيها فلو لا ما مكنها مما تتقي به وهو المعنى الذي ألهمها لتتنبه النفس على استعماله فتفرق ما بين الشبهة والدليل ما تمكنت من الفرق بينهما فإن الله سبحانه كما لم يأمر بالفحشاء لم يلهم العبد العمل بالفحشاء كما يراه بعضهم ولو ألهمه العمل بالفحشاء لما قامت الحجة لله على العبد بل هذه الآية مثل قوله وهَدَيْناهُ النَّجْدَيْنِ أي الطريقين بيناهما له فقال إِنَّا هَدَيْناهُ السَّبِيلَ أي بينا له إِمَّا شاكِراً فيعمل في السبيل بمقتضاه إن كان نهيا انتهى وإن كان أمرا فعل وإِمَّا كَفُوراً يقول يستر على نفسه فيخادعون أنفسهم فإنه ما ضل أحد إلا على علم فإن بيان الحق ليس بعده بيان ولا فائدة للبيان إلا حصول العلم ثم يستره العالم به عن نفسه لغرض يقوم له فتقوم الحجة لله عليه فالإلهام إعلام إلهي فمن زكى نفسه بالتقوى فاتقى من الفجور ما ينبغي أن يتقى منه وأخذ منه ما ينبغي أن يؤخذ منه ومن دس نفسه في موضع قيل له لا تدخل منه فقد خاب فمن أراد طريق العلم والسعادة فلا يضع ميزان الشرع من يده نفسا واحدا فإن الله بيده الميزان لا يضعه يخفض القسط ويرفعه وهو ما هو الوجود عليه من الأحوال فلو وضع الحق الميزان من يده لفنى العالم دفعة واحدة عند هذا الوضع وكذلك ينبغي للمكلف بل للإنسان أن لا يضع الميزان المشروع من يده ما دام مكلفا لأنه إن وضعه من يده نفسا واحدا فنى الشرع كله كما فنى العالم لو وضع الحق الميزان من يده فإن كل حركة في المكلف ومن المكلف وسكون لميزان الشرع فيه حكم فلا يصح وضعه مع بقاء الشرع فهذا الميزان له من كونه مكلفا وأما الميزان الآخر الذي لا ينبغي أن يضعه الإنسان لا من كونه مكلفا بل هو بيده دنيا وآخرة فذلك هو ميزان العلم الذي ميزان الشرع حكم من أحكامه وهو مثل الميزان الذي بيد الحق فبه يشهد وزن الحق فنسبته إلى ميزان الحق نسبة شخص بيده ميزان وشخص آخر بيده مرآة فرأى في مرآته التي في يده صورة ذلك الميزان والوزان والوزن فعلم صورة الأمر من شهوده في وجوده وكان هذا الأمر من ورائه غيبا له لو لا المرآة ما شهده فأضاف ما رآه في مرآته إليه لكون مرآته ليس غيره فالغيب الذي يزن والوزن والميزان حضرة الحق والمرآة حضرة الإنسان فالوزن لله تعالى والشهود لمن كانت نفسه مرآة فهو السعيد الصادق وإنما كشف الله هذا السر لمن كشفه ليري في مرآته صورة الخلق الإلهي وكيف صدور الأشياء وظهورها في الوجود من عنده وهو قول أبي بكر الصديق رضي الله عنه ما رأيت شيئا إلا رأيت الله قبله فيرى من‏\n\n\nأين صدر ذلك الشي‏ء فيكون صاحب هذا الكشف خلاقا وهو الذي أراده الحق منه بهذا الكشف بل يعلم أنه خلاق من هذا الكشف ولم يزل كذلك وهو لا يشعر فأفاده هذا الكشف العلم بما هو الأمر عليه لا أنه بالكشف صار خلاقا فأمره الله عند ذلك أن يعطي كل شي‏ء حقه من صورته كما أعطاه الله خلقه في صورته فلا تتوجه عليه مطالبة لمخلوق كما لا يتوجه على الحق تعالى مطالبة لمخلوق هذا ما أعطاه ذلك الكشف من الفائدة فإذا أقامه الحق تعالى في فعل من أفعاله المأمور بها أو المحجور عليه فيها نظر إلى‏\nما لها من الحق قبله فوفى ذلك الفعل حقه فإن كان من الأمور المأمور بفعلها أعطاها حقها في نشأتها حتى تقوم سوية الخلق معدلة النش‏ء فلم يتوجه لذلك الفعل حق على فاعله فلله الخلق وللعبد الحق فالحق أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ والخلق أعطى كل شي‏ء حقه فدخل الحق في الخلق ودخل الخلق في الحق في هذه المسألة وإن كان من الأمور المنهي عنها فحقها على هذا العبد أنه لا يوجدها ولا يظهر لها عينا أصلا فإن لم يفعل فما وفاها حقها وتوجهت عليه المطالبة لها فلم يعط كل شي‏ء حقه فلم يقم في الحق مقام الحق في الخلق فكان محجوجا فهكذا ينبغي أن تعرف الأمور والأوامر الإلهية وصورة التروك في الجناب الإلهي هو الذي لم يوجد من أحد الممكنين لوجود الآخر المرجح وجوده فهو من حيث إنه لم يوجد ترك له وهذه مسألة نبهناك عليها لعلمنا أنك ما تجدها في غير هذا الكتاب لأنها عزيزة التصور قريبة المتناول لمن اعتنى الله به تعطي الأدب مع الله وحفظ الشريعة على عباد الله وهي من الأسرار المخزونة عند الله التي لا تظهر إلا على العارفين بالله ولا ينبغي كتمها عن أحد من خلق الله فإن كتمها العالم بها فقد غش عباد الله ومن غشنا فليس منا أي ليس من سنتنا الغش ولما وقفنا على هذه المسألة في كتاب الرحمة الإلهية الذي هو سرح عيون قلوب العارفين شكرنا الله تعالى حيث رفع الغطاء وأجزل العطاء فله الحمد والمنة وإذا قام العبد صورة ما ذكرناه من كونه خلاقا تعين عليه من تمام الصورة الإلهية التي هو عليها أن يحفظ على ما أوجده صورته ليكون له البقاء أعني لذلك الموجود عنه فيدفعه لمن يحفظ البقاء عليه وهو الله فَاتَّخِذْهُ وَكِيلًا في ذلك الأمر وأمثاله عن أمر ربه فلا ينسب إلى سوء الأدب في ذلك فالعبد في كل نفس مشغول بخلق ما أمر بخلقه والحق بتوكيل هذا العبد له قائم بحفظ ما خلقه بإذن ربه في الخلق والتوكيل وهذا علم دقيق إلهي وهو رد الحفظ إلى الله بحكم الوكالة عن أمر الله وإيجاد الأشياء عن العبد بأمر الله فلم يزل هذا العبد في كل حال تحت أمر الله ومن لم يزل تحت أمر الله في جميع أحواله لم يزل عند الله في شهوده أبدا دائما دنيا وآخرة فإنه له النش‏ء حيث كان في الأولى والآخرة عن أمر الله قال تعالى في حق عيسى وإِذْ تَخْلُقُ من الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنْفُخُ فِيها فَتَكُونُ طَيْراً بِإِذْنِي وكذلك أمر المكلف بالعمل فما عمل إلا بإذن الله وموطن هذا العبد واستقراره إنما هو عند ربه من حيث هو خير وأبقى وهو الآخرة التي هي خَيْرٌ وأَبْقى‏ ولَلْآخِرَةُ خَيْرٌ لَكَ من الْأُولى‏ ولَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضى‏ وهو عطاء كُنْ في ظاهر العين كما هو له في الباطن فإن الإنسان له في باطنه قوة كن وما له منها في ظاهره إلا الانفعال وفي الآخرة يكون حكم كن منه في الظاهر وقد يعطي لبعض الناس في الدنيا وليس لها ذلك العموم فمن رجال الله من أخذ بها ومن رجال الله من تأدب مع الله فيها لعلمه أن هذا ليس بموطن لها ولا سيما وقد رأى الأكابر الذين لا خلاف في تقدمهم عليه وعلينا قد قيل له إِنَّكَ لا تَهْدِي من أَحْبَبْتَ وقيل له أَ فَأَنْتَ تُنْقِذُ من في النَّارِ لأنه إذا أسلم فليس من أهل النار فلما رآها رجال الله غير عامة الحكم في هذه الدار جعلوا حكم ما لا تعم إلى حكم ما تعمه فترك الكل إلى موطنه وهذه حالة الأدباء العلماء بالله الحاضرين معه على الدوام فالأديب خلاق في هذه الدار بالعمل لا بكن بل ببسم الله الرحمن الرحيم ليسلم في عمله من مشاركة الشيطان حيث أمره الله بالمشاركة في الأموال والأولاد فهو ممتثل هذا الأمر الإلهي حريص عليه ونحن مأمورون باتقائه في هذه المشاركة فطلبنا ما نتقيه به لكونه غيبا عنا لا نراه فأعطانا الله اسمه فلما سمينا الله على أعمالنا عند الشروع فيها توحدنا بها وعصمنا من مشاركة الشيطان فإن الاسم الإلهي هو الذي يباشره ويحول بيننا وبينه وإن بعض أهل الكشف ليشهدون هذه المدافعة التي بين الاسم الإلهي من العبد في حال الشروع وبين الشيطان وإذا كان العبد بهذه الصفة كان على‏\n\n\nبينة من ربه وفاز ونجا من هذه المشاركة وكان له البقاء في الحفظ والعصمة في جميع أعماله وأحواله وهذا المنزل يحوي على علوم منها علم الفرق بين الدليل والآية وأن صاحب الآية هو الأولى بنسبة الحكمة إليه وبالاسم الحكيم من صاحب الدليل فإن الآية لا تقبل الشبهة ولا تكون إلا لأهل الكشف والوجود وليس الدليل كذلك وفيه علم الاختراع الدائم ولا يكون في الأمثال إلا فيما تتميز به بعضها عن بعض ذلك القدر هو حكم الاختراع فيها وما وقع فيه الاشتراك فليس بمخترع فافهم وفيه علم الخواص وفيه علم السبب الذي لأجله لا يرفع العالم بما علمه رأسا مع تحققه أن ذلك الوضع له يضره وفيه علم الفرق بين قول الإنسان في الشي‏ء نعم بفتح العين وبين كسرها وأين يقول‏\nذلك وأين يقول لا وبلى وفيه علم تميز الجنات بعضها من بعض هل هو تميز حالات في جنة واحدة أو تميز مساحات فإن كل اسم جاءنا للجنات تستحقه كل جنة إن كان التمييز بالمساحات فكل جنة لا نشك أنها جنة مأوى وجنة عدن وجنة خلد وجنة نعيم وجنة فردوس وهي واحدة العين وهذه الأحكام لها ولو تميزت بالمساحات فلا بد من حكم هذه الأسماء لها وفيه علم الفرق بين الخلود والتأبيد والتسرمد وعدم الخروج وفيه علم الفرق بين الوعد والوعيد بالمشيئة في أحدهما دون الآخر ولما ذا قبل الوعيد المشيئة دون الوعد وكلاهما إخبار إلهي وأين وجود الحكمة في ذلك وفيه علم السماء هل هي شبه الأكرة أو شبه الخيمة أو هل هي أكرة في خيمة أو خيمة في أكرة فتدور الأرض لدورانها وهل السماء ساكنة أو متحركة فإن الشهود يعطي جميع ما ذكرناه وما بقي إلا علم ما هو الأمر في نفسه من غير نظر إلى شهود هل هو كما يقضي به شهود كل شاهد أم ليس كذلك وفيه علم وجود الزوجين وبما ذا تكرم كل واحد من الزوجين على صاحبه هل هو بما هو محتاج إليه كل واحد منهما أم قد يكون بما لا حاجة فيه فلا يفرق بين العنين وبين أهله وفيه علم من يدعي الألوهة هل له خلق أم لا فإن المدعي الألوهة لا خلق له البتة في حال دعواه فإذا فارق الدعوى كان حكمه حكم سائر الموجودات التي ليست لها هذه الدعوى وفيه علم حكم من اتخذ إلها من غير دعوى منه بل هو في نفسه عبد غير راض بما نسب إليه وعاجز عن إزالة ما ادعى فيه وأنه مظلوم حيث سلب عنه هذا المدعي ما يستحقه وهو كونه عبدا فظلمه فينتصر الله له لا لنفسه فاتخاذ الشريك من مظالم العباد وفيه علم الحكمة ما هي وفيه علم إلحاق ما ليس بنبي مشرع بالأنبياء في الرتبة العلمية بالله تعالى وفيه علم الوصايا والآداب الإلهية النبوية الموحى بها والملهمة إليها وفيه علم الأخذ بالأولى والمبادرة إليه وفيه علم ما يدخل تحت القدرة الحادثة مما لا يدخل وفيه علم ما لا بد منه وفيه علم الفرق بين الصوت والحرف والكلام والأنعام وفيه علم النعم الجلية والخفية والعامة والمقصورة وفيه علم نجاة استناد الناظر ولو كان شبهة وفيه علم من ينبغي أن يلحق به المذام من العالم وفيه علم الفرق بين من رجع إلى الله عن كشف وبين من رجع إليه عن غير كشف وفيه علم المتقدم والعاقب وهو واحد وفيه علم ما ينبغي أن لا يؤبه بالجهل به وفيه علم ما لا يمكن الجهل به وفيه علم الوقت الذي يتعين فيه الثناء الجميل وعلى ما ذا يتعين والأحوال كلها تطلبه والأزمان وفيه علم ما يقع به الاكتفاء من الثناء فلا يقبل المزيد وفيه علم حكم الكثير حكم الواحد عند الواحد واستناد الكثير إلى الكثير واستناد الكثير إلى الواحد وفيه علم التناكح للتناسل ولغير التناسل وما هو الأعلى منهما وفيه علم ما يشترك فيه الحق والباطل وليس ذلك إلا في الخيال وفيه علم ما هو علم وليس بعلم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 353: Concerning the Knowledge of the Station of Three Talismanic, Wisdom-Based Secrets, Which Point to the Knowledge of the Station of the Cause and the Fulfillment of Its Due Right, and This is from the Muhammadan Presence (الحضرة المحمدية).\n\nSay to the Imam, my father, if you find intimacy with me,\nMy intimacy is with my Lord, not with my peers.\n\nMy intimacy is with my Lord, neither with parents\nNor with family, for the existence of my like is my peers.\n\nMy creation fled from me and found me desolate;\nSo how can I find intimacy with the past or the present state?\n\nAnd how can he who is not suited to me give me intimacy,\nWhen nothing of my states is suited to him?\n\nThe like is an opposite; so how can there be intimacy, O my dwelling?\nThe intellect forbids it, so the state is as the state.\n\nWhen I was ignorant of Him Whom nothing resembles\nExcept myself, I ignorantly brought Him to mind.\n\nWhy do I say that The Real (الحق) seeks me,\nWhen I do not know Him? What is mine concerning Him? What is mine?\n\nIntimacy seeks us by subsisting through us,\nAnd the low does not find intimacy with the High without the lowest.\n\nI am perplexed concerning Him, and my desolation clings to me,\nAnd I do not drive it away except through my hopes.\n\nNo sage has tasted intimacy unless a likeness\nAppeared to his eye, whether of knowledge or of my acts.\n\n### That Allah has given dominion over the rational soul in this worldly existence to three things\n\nKnow, may Allah support you with a spirit from Him, that when Allah created the rational soul (النفس الناطقة) which governs this structure called the human being, He gave dominion over it, within this specific temperament belonging to this worldly existence (النشأة الدنيوية), to three things which He made necessary concomitants of its existence: the Vegetative Soul (النفس النباتية), the Appetitive Soul (النفس الشهوانية), and the Irascible Soul (النفس الغضبية).\n\nAs for the Vegetative Soul and the Irascible Soul, they vanish in the existence of the people of felicity in the Gardens (Jannāt). Only the Appetitive Soul remains in that existence, and it is necessary for both planes of existence. Through it, the people of bliss experience pleasure.\n\nAs for the Vegetative Soul, it is that which seeks nourishment to repair what has been diminished from the body, thereby causing the body to grow. It constantly seeks nourishment, either from an external source which is brought to it—which is expressed as eating—or from wherever Allah wills, without specific designation.\n\nIt has four ministers (وزعة): the Attracting (الجاذب), the Retaining (الماسك), the Digesting (الهاضم), and the Expelling (الدافع).\n\nAs for the Attracting minister, its function is to transport nourishment from one place to another, moving it from the mouth to the stomach, from the stomach to the liver, and from the liver to the heart and to all the veins and parts of the body. It is the distributor to the parts of the body of what they need to maintain their strengths. The Expelling minister assists it, for it pushes the food away from its location when it sees that it has fulfilled its due right in that place and has no further business there. It pushes it away so that it does not crowd others when they arrive, thus assisting the Attracting minister.\n\nAs for the Retaining minister, it is that which holds the food in every location until the governing process takes its due right in it. When it sees that its right has been fulfilled, it releases its hold, and the Expelling and Attracting ministers take over.\n\nAs for the Digesting minister, it is that which changes the form of the nourishment and clothes it in another form, so that it is not in the form it was previously. It was in a pleasant form and had a good scent, but when it came into the hand of the Digesting minister, it changed its shape and clothed it in a transformed image with a scattered, foul odor. This is why it is called the Digesting minister (Hāḍim), from the word for degradation (Ihtiḍām). However, the wisdom (حكمة) lies in this degradation, for were it not for digestion, the purpose intended by the nourisher through the nourishment would not be achieved. Thus, the apparent matter is corruption, but its inner reality is rectification.\n\nThis Digesting minister continues to transfer it from one form to another, and the Retaining minister holds onto its subsistence until it governs it with what its knowledge dictates and what it has been entrusted with. When they have fulfilled their roles according to that station, they leave it, and the Attracting and Expelling ministers take it. When they bring it down and transfer it to the next location, they return it to the Retaining and Digesting ministers, who do to it what they did in the previous location, opening up different forms within it. Then the Attracting and Expelling ministers take it and guide those forms along specific paths which they do not transgress, as long as Allah wills the preservation of this natural existence.\n\nWere it not for these ministers, the Vegetative Soul would not be able to achieve its objective.\n\nWhen Allah wills the destruction of this natural existence, the Vegetative Soul seeks the assistance of the Appetite so that the governing soul may be roused to bring what it desires, but it fails to do so. Allah weakens it by the dominance of the heat (الحرارة) over its location, so it weakens, just as a lamp weakens in the light of the sun and loses its effect. The Vegetative Soul remains in its reality, saying to its ministers, \"I must have something to nourish myself with.\" So it nourishes itself with the humors of the body and the remaining superfluities within it. Its ministers have also weakened like it. The existence continues in increasing deficiency, while the Expelling minister strengthens and the Attracting minister weakens, as does the Retaining minister, until the human dies.\n\nWere it not for this governance through these instruments for this existence, no ear would hear, no eye would see, and none of these sensory or spiritual faculties would have any effect.\n\nAs for the Appetitive Soul (النفس الشهوانية), its dominion in this structure is the seeking of what is pleasing to it, without knowing whether that will harm or benefit it. This occurs only in the human existence. As for other animals, they only consume food by will (الإرادة), not by appetite, in order to ward off the pain of hunger and need. They only seek what is beneficial to them. The rule of appetite remains in the animal in the excessive consumption of food, and from this excess, corruption enters upon it. Corruption enters upon the human in the same way, from the excessive consumption of what is beneficial in small amounts, and from consuming what is not beneficial at all, which the appetite seeks and which harms the temperament. This is the difference between the human and the animal in the consumption of food.\n\nThe Appetitive Soul is to the Vegetative Soul as was said in the verse:\n\nIf a wise man tests the world, it reveals itself\nTo him as an enemy in the clothes of a friend.\n\nIt has friendship with the Vegetative Soul because it assists it in obtaining and consuming nourishment. Yet it is an enemy because it introduces foods that harm it and do not benefit it. Its assistance to the Vegetative Soul is therefore accidental, not essential. Thus, it is the necessary enemy that cannot be separated from, and whose evil is never safe.\n\nAs for the Irascible Soul (النفس الغضبية), which is the bestial (سبعية) soul, it is that which seeks dominance (القهر) because it sees its superiority over other animals through the strengths it has been given and its ability to act. It perceives the cosmos (العالم) as subservient to its existence and its governor. It sees that there are accidental occurrences in existence, or causes that appear, which prevent it from reaching its goals. So it becomes angry due to the failure to achieve the goal. If it has a strong assisting authority, whether from an active resolve (همة فعالة) or an external commander through which it can execute its anger upon the object of its wrath, it destroys it and manifests vengeance upon it. It does not know the measure of injustice (الظلم) and justice in that vengeance and dominance, because that is not its domain; rather, that belongs to the intellect (العقل) and the norm of the time (ناموس الوقت).\n\nFor this reason, the poet who said:\n\nInjustice is among the characteristics of souls, so if you find\nA chaste one, it is due to a cause that he does not commit injustice.\n\nIf he had said \"dominance\" (القهر) instead of \"injustice\" (الظلم), he would have spoken correctly, for injustice is only brought about by the Law (الشرعي), and through the Law is it known. The soul only possesses dominance (Qahr), which is ignorant zeal (حمية جاهلية). If it coincides with The Real (الحق), it is religious zeal (حمية دينية). For this reason, anger for Allah and in Allah is praised, and anger for other than Allah and in other than Allah is condemned.\n\nThis is part of the governance of the Wise Real (الحكيم الحق) Who arranged matters according to their levels (مراتب) and gave everything its creation (خلقه) so that it might be a sign (آية) for those of understanding (أولي الألباب) and for all other people of signs in the cosmos, since they differ in their approaches to this, as Allah enumerated them in His Glorious Book, <<الَّذِي لَا يَأْتِيهِ الْبَاطِلُ مِن بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ تَنزِيلٌ مِّنْ حَكِيمٍ حَمِيدٍ>> (Which falsehood cannot approach from before it or from behind it; [it is] a revelation from One Wise and Praiseworthy).\n\nHe gathered all these signs in the Book of Existence (كتاب الوجود), which contains nothing but clarification (البيان) and Mercy (الرحمة), nothing else. Everything that appears in the cosmos, whether from the side of The Real or from the interaction of creation with itself, that contradicts Mercy, is an accidental matter in the Book, which the Clarification made manifest, since that accidental matter is not in the essence of this Book itself. The Book is entirely Mercy in terms of its Essence (ذاته) and Clarification. As for what Allah made a punishment, Allah is too Generous to punish His creation with a punishment whose end does not terminate at a fixed term defined and specified by the Clarification of the Book. Then the ruling returns to Mercy. This is inevitable, and <<وَاللَّهُ غَفُورٌ رَّحِيمٌ>> (And Allah is Forgiving, Merciful).\n\n### Ibn Arabi’s knowledge of a strange divine ruling related to the human world\n\nThen you must know that Allah informed me of a strange ruling (حكم غريب) related to the human world (العالم الإنساني). I do not know whether it relates to the rest of the cosmos besides the human or not, as Allah did not inform me of that. It is not proper for me to say about Allah what I do not know. May Allah protect me and you from that.\n\nThis ruling appears in the human world at the end of every three thousand years of the years of the world. This period is one day with Allah. I do not know to which Divine Name (اسم إلهي) this day belongs, because I only knew concerning it that The Real (الحق) divided it for me into three thirds, each third being one thousand years. The thousand years is one day of the days of the Lord—this is what my Lord informed me.\n\nThe ruling of this period of three thousand years in the human being is the ruling of beginning and return, and life and death, however Allah wills and wherever Allah wills. However, when Allah inscribed this matter for me in my tablets, I witnessed words inscribed in silver and a word inscribed in gold, in this form. I knew that these were states and rulings that appear in the human being in Paradise (Jannah) upon the passing of this specified period.\n\nNo divine news that has reached me has ever affected me with such anxiety and disturbing fear as this matter. My heart was only calmed by the fact that the words were of gold and silver, with the golden word next to the silver word.\n\nWhen this Divine Imparting (الإلقاء الإلهي) and Lordly Definition (التعريف الرباني) was finished, and the pain of this Theophany (التجلي) in this form subsided from me and was lifted, I composed a poem of inspiration (إلهام), not of reflection. I recall it:\n\nWe have a transcendent Beloved Whom I do not name,\nAnd He is the Beloved concerning Whom creation is perplexed.\n\nIf I say 'This,' the limit confines Him;\nIf I say 'He,' it is a speech I do not grasp.\n\nHow is there a path to the Unseen, when our eyes\nSee Him at every moment through His Theophany (تجلي)?\n\nIf I say 'With me,' the container comes seeking Him,\nAnd the container is real, but it does not encompass Him.\n\nI have never seen an existence that I do not grasp,\nExcept for Him, Whose meaning I am one of His meanings.\n\nI am perplexed concerning Him, and the cosmos is perplexed concerning me; and how often\nHave my ears heard a saying concerning Him!\n\nThis is He Whom the Majesty of The Real (الحق) makes sick;\nSo is there a substitute for Him to cure Him?\n\nHe is the cure, He is the disease; so where am I?\nThe Essence (العين) is one, and we are all within Him.\n\n[The author clarifies that the pronoun \"makes sick\" (أمرضه) refers to the Cosmos (الكون).]\n\n### That we receive inspiration (الإلهام) from Allah, not revelation (الوحي)\n\nKnow that we receive Inspiration (الإلهام) from Allah, not Revelation (الوحي), for the path of Revelation was cut off by the death of the Messenger of Allah (may Allah bless him and grant him peace). Revelation existed before him, and no divine news came that there would be Revelation after him, as He said: <<وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِن قَبْلِكَ>> (And it was already revealed to you and to those before you), and He did not mention Revelation after him, even if this does not necessarily preclude it.\n\nHowever, the truthful Prophetic report came concerning Jesus (peace be upon him), who was among those to whom Revelation was sent before the Messenger of Allah (may Allah bless him and grant him peace), that he will only lead us in prayer from among us—meaning, according to our Sunnah. Thus, when he descends, he will have Unveiling (الكشف) and Inspiration (الإلهام), just like this Community (Ummah).\n\nOne should not imagine that Inspiration is not divine news. The matter is not so; rather, it is divine news and information from Allah to the servant, conveyed by an angel hidden from the inspired person. Sometimes, inspiration comes from the Special Face (الوجه الخاص). The Messenger and the Prophet witness the angel and see him with the sight of the eye when Revelation comes to him. The non-Messenger perceives its effect but does not see it with the sight of the eye. Allah inspires him with whatever He wills through the angel, or He grants it from the Special Face (الوجه الخاص) by the removal of intermediaries, and this is the most glorious and honorable form of imparting, in which the Messenger and the saint (ولي) also meet. The \"Fingers of the All-Merciful\" (أصابع الرحمن) refer to the Special Face, and the \"touch of the Angel\" (لمة الملك) refers to the shared face. Most Inspiration (الإلهام) is divine and without intermediary. Whoever knows it knows how to receive it, and its location is the soul (النفس).\n\nAllah the Exalted said: <<فَأَلْهَمَهَا>> (Then He inspired it). The doer is His Identity (هويته), so He is the Inspirer, none other. <<فُجُورَهَا>> (with its wickedness)—to know it, not to act upon it—<<وَتَقْوَاهَا>> (and its righteousness)—to know it and to act upon it. Thus, it is the Inspiration of Information (إلهام إعلام), not as imagined by those who lack knowledge.\n\nTherefore, He said: <<وَقَدْ خَابَ مَن دَسَّاهَا>> (And he has failed who covers it [the soul]). *Al-Dass* (covering/concealing) is a subtle attachment due to crowding. The one who covers the soul is the one who attaches the act of wickedness to the act of righteousness, and does not differentiate where differentiation is required, thus combining them in knowledge and action. The matter is not so.\n\nThe reason for his ignorance of this is that he cast the Balance of the Law (ميزان الشرع) from his hand. If he had not put the Balance down, he would have seen that he is commanded to righteousness and forbidden from wickedness, with both matters clarified to him simultaneously. Since Allah attributed wickedness (الفجور) and righteousness (التقوى) to the soul, we know that both must occur in existence from this inspired soul.\n\nWickedness occurred for the soul because it burst forth (انفجر) from an interpretation it made. It did not commit the transgression out of violation of the Divine sanctity, nor is it possible for it to do so. This was from Allah’s Mercy upon the souls.\n\nSince there are two dawns (fajr)—a false dawn (fajr kādhib) and a true dawn (fajr ṣādiq)—the false dawn being the elongated one, He inspired it with its righteousness (تقواها), meaning that in its wickedness, it guards against the elongated dawn (الفجر المستطيل) because it dominates it with priority, due to the delay of the scattered dawn (المستطير) whose ruling flies away from it. So He inspired it, in its wickedness, with the elongated dawn. Through this bursting forth (انفجار), what is doubtful becomes clear to it from what is not doubtful, and its righteousness (تقواها) is what it guards itself with against the ruling that harms it.\n\nWere it not for what He enabled it to guard itself with—which is the meaning He inspired it with, so that the soul might be alerted to its use and distinguish between ambiguity (الشبهة) and proof (الدليل)—it would not be able to differentiate between them. For Allah, the Glorious, just as He did not command immorality (الفحشاء), He did not inspire the servant to act upon immorality, as some imagine. If He had inspired the action of immorality, the argument (الحجة) of Allah against the servant would not stand.\n\nRather, this verse is like His saying: <<وَهَدَيْنَاهُ النَّجْدَيْنِ>> (And We guided him to the two highways)—meaning, We clarified the two paths for him. Then He said: <<إِنَّا هَدَيْنَاهُ السَّبِيلَ>> (Indeed, We guided him to the way), meaning We clarified it for him, <<إِمَّا شَاكِرًا>> (whether grateful)—so he acts in the way according to its requirement: if it is a prohibition, he refrains; if it is a command, he acts—<<وَإِمَّا كَفُورًا>> (or ungrateful). The ungrateful one covers himself, deceiving his own soul, for no one goes astray except with knowledge. The clarification of The Real is followed by no further clarification, and the benefit of clarification is only the attainment of knowledge. Then the one who knows it conceals it from himself for a purpose that arises for him, and thus the argument stands against him before Allah.\n\nInspiration is divine information. Whoever purifies his soul with righteousness (تقوى) and guards against the wickedness that should be guarded against, and takes from it what should be taken from it, [succeeds]. But whoever covers his soul (دس نفسه) in a place where he was told not to enter has failed.\n\nWhoever desires the path of knowledge and felicity must not put down the Balance of the Law (ميزان الشرع) for a single breath. For Allah holds the Balance in His Hand; He does not put it down. He lowers the measure and raises it, and this is the state upon which Existence (الوجود) rests. If The Real were to put the Balance down, the cosmos would perish instantly upon that setting down.\n\nLikewise, the legally responsible person (المكلف), indeed the human being, must not put down the prescribed Balance from his hand as long as he is legally responsible. For if he puts it down for a single breath, the entire Law perishes, just as the cosmos would perish if The Real put the Balance down. Every movement in and from the legally responsible person, and every stillness, has a ruling in the Balance of the Law, so it is not correct to put it down while the Law remains. This Balance belongs to him by virtue of his being legally responsible.\n\nAs for the other Balance, which the human should not put down—not by virtue of being legally responsible, but because it is in his hand in this world and the Hereafter—that is the Balance of Knowledge (ميزان العلم), of which the Balance of the Law is one of its rulings. It is like the Balance in the Hand of The Real. Through it, he witnesses the weighing of The Real. His relation to the Balance of The Real is like the relation of a person holding a balance to another person holding a mirror, who sees in his mirror the image of that balance, the weigher, and the weight. He knows the image of the matter from his witnessing it in his existence, and this matter was unseen (غيب) behind him; were it not for the mirror, he would not have witnessed it. He attributes what he saw in his mirror to himself because his mirror is none other than himself.\n\nThe Unseen (الغيب) that weighs, the weight, and the Balance are the Presence of The Real (حضرة الحق). The mirror is the Presence of the Human (حضرة الإنسان). The weighing belongs to Allah the Exalted, and the witnessing belongs to the one whose soul is a mirror; he is the felicitous and truthful one.\n\nAllah only unveiled this secret to the one to whom He unveiled it so that he might see in his mirror the image of the Divine Creation (الخلق الإلهي) and how things issue forth and appear in Existence from Him. This is the meaning of the saying of Abu Bakr al-Siddiq (may Allah be pleased with him): \"I did not see a thing except that I saw Allah before it.\"\n\nHe sees from where that thing issued forth, and thus the possessor of this Unveiling (الكشف) becomes a creator (خلاق). This is what The Real intended for him through this Unveiling. Rather, he knows that he is a creator (خلاق) through this Unveiling, and he has always been so without realizing it. This Unveiling benefits him with the knowledge of how the matter truly is, not that he became a creator through the Unveiling.\n\nAllah then commanded him to give everything its due right (حقه) in its form, just as Allah gave it its creation (خلقه) in its form. Thus, no demand is directed against him by any creature, just as no demand is directed against Allah the Exalted by any creature. This is the benefit that Unveiling grants him.\n\nIf The Real establishes him in an act that he is commanded to perform or forbidden from, he looks at the right (الحق) that act has upon him, and he fulfills the due right of that act. If it is among the matters commanded to be done, he gives it its due right in its existence so that it stands upright in creation (سوية الخلق) and balanced in its formation (معدلة النشء). Thus, no right is directed against the doer by that act. Creation (الخلق) belongs to Allah, and the due right (الحق) belongs to the servant. The Real <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (gave everything its creation), and the creation gives everything its due right. Thus, The Real entered into the creation, and the creation entered into The Real in this matter.\n\nIf it is among the matters forbidden, its due right upon this servant is that he does not bring it into existence or manifest any essence (عيناً) for it at all. If he fails to do so, he has not fulfilled its due right, and the demand is directed against him by it. Thus, he has not given everything its due right, and he has not stood in the place of The Real in creation, so he is refuted.\n\nThis is how one should know the Divine matters and commands. The image of abstention (التروك) in the Divine Presence is that which was not brought into existence by one of the possibilities for the existence of the other, whose existence was preferred. Thus, from the perspective that it was not brought into existence, it is an abstention for Him.\n\nThis is a matter we have alerted you to, knowing that you will not find it in any book other than this one, because it is rare to conceive of, yet easy to grasp for the one whom Allah cares for. It imparts proper conduct (الأدب) with Allah and the preservation of the Law (الشريعة) for the servants of Allah. It is one of the secrets stored with Allah that are only revealed to the Gnostics (العارفين بالله), and it should not be concealed from any of Allah's creation. If the one who knows it conceals it, he has cheated the servants of Allah, and \"Whoever cheats us is not of us\"—meaning, not of our Sunnah is cheating.\n\nWhen we came upon this matter in the Book of Divine Mercy, which is the pasture of the eyes of the hearts of the Gnostics, we thanked Allah the Exalted for lifting the veil and multiplying the gift. To Him belongs all praise and favor.\n\nWhen the servant stands in the image we mentioned—of being a creator (خلاق)—it becomes incumbent upon him, as a completion of the Divine Image upon which he exists, to preserve the form of what he has brought into existence so that it may have subsistence (البقاء). I mean, that which originated from him. He must entrust it to the One Who preserves its subsistence, Who is Allah: <<فَاتَّخِذْهُ وَكِيلًا>> (So take Him as a Trustee) in that matter and its likes, by the command of his Lord. Thus, he is not attributed with bad conduct in this.\n\nThe servant is occupied in every breath with creating what he is commanded to create, and The Real, by the servant’s entrusting of the matter to Him, is engaged in preserving what He created, by the permission of his Lord, in creation and in entrusting. This is a subtle Divine knowledge: the returning of preservation to Allah by the ruling of trusteeship (وكالة) by Allah’s command, and the bringing of things into existence by the servant by Allah’s command.\n\nThis servant is constantly under the command of Allah in every state. And whoever is constantly under the command of Allah in all his states is constantly with Allah in his witnessing (شهوده), eternally, in this world and the Hereafter. For his existence (النشء) is for Him wherever he is, in the first and the last, by the command of Allah.\n\nAllah the Exalted said concerning Jesus: <<وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنفُخُ فِيهَا فَتَكُونُ طَيْرًا بِإِذْنِي>> (And when you create from clay the shape of a bird by My permission, and you breathe into it, and it becomes a bird by My permission). Likewise, the legally responsible person is commanded to act, and he only acts by Allah’s permission.\n\nThe station and stability of this servant is only with his Lord, from the perspective that He is better and more lasting. That is the Hereafter, which is <<خَيْرٌ وَأَبْقَى>> (better and more lasting), and <<وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَى * وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَى>> (And the Hereafter is better for you than the first [life], and your Lord is going to give you, and you will be satisfied).\n\nThis is the gift of \"Be!\" (كُنْ) in the apparent eye, just as it is for him in the inner reality. For the human has the power of \"Be!\" (كُنْ) in his inner reality, but he only has passivity (الانفعال) from it in his outward reality. In the Hereafter, the ruling of \"Be!\" will be from him in the outward reality.\n\nIt may be granted to some people in this world, but it does not have that universality. Some men of Allah have taken hold of it, and some men of Allah have maintained proper conduct (تأدب) with Allah concerning it, knowing that this is not its proper station, especially since they saw the great ones, whose precedence over him and us is undisputed, being told: <<إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ>> (Indeed, you do not guide whom you love), and being told: <<أَفَأَنتَ تُنقِذُ مَن فِي النَّارِ>> (Then will you save him who is in the Fire?). Because if he submits, he is not among the people of the Fire.\n\nWhen the men of Allah saw that its ruling was not universal in this abode, they deferred the ruling of what is not universal to the ruling of what is universal, and they left everything to its proper station. This is the state of the well-mannered scholars of Allah, who are constantly present with Him.\n\nThe well-mannered one is a creator (خلاق) in this abode through action, not through \"Be!\" (كُنْ), but through *Bismillah al-Rahman al-Rahim* (In the Name of Allah, the Most Compassionate, the Most Merciful), so that he may be safe in his action from the partnership of Satan, since Allah commanded Satan to share in wealth and children. Satan is obedient to this Divine command and keen on it. We are commanded to guard against him in this partnership. We sought what we could guard ourselves with, since he is unseen (غيب) to us and we do not see him. So Allah gave us His Name. When we pronounce the Name of Allah over our actions at the beginning, we become unified with them, and we are protected from the partnership of Satan, for the Divine Name is what directly confronts him and intervenes between us and him. Indeed, some people of Unveiling (الكشف) witness this defense that occurs between the Divine Name from the servant at the time of commencement and Satan.\n\nIf the servant is of this description, he is upon clear evidence from his Lord, and he succeeds and is saved from this partnership. He has subsistence (البقاء) in preservation and infallibility (العصمة) in all his actions and states.\n\nThis station contains sciences, including:\n\n1.  The science of the difference between Proof (الدليل) and Sign (الآية), and that the possessor of the Sign is more worthy of having wisdom attributed to him and of the Name The Wise (الحكيم) than the possessor of the Proof. For the Sign does not accept ambiguity and belongs only to the people of Unveiling (الكشف) and Witnessing (الوجود), which is not the case with the Proof.\n2.  The science of perpetual invention (الاختراع الدائم), which occurs in likenesses only in the degree by which some are distinguished from others. That degree is the ruling of invention in them, but what is shared is not invented. Understand this.\n3.  The science of properties (الخواص).\n4.  The science of the reason why the scholar, despite knowing his knowledge, does not raise his head, even though he realizes that this posture harms him.\n5.  The science of the difference between a person saying \"Na‘am\" (نعم) with a *fatha* [yes] and with a *kasra* [blessing], and where he should say that, and where he should say \"Lā\" [no] and \"Balā\" [yes, indeed].\n6.  The science of distinguishing the Gardens (Jannāt) from one another: whether it is a distinction of states within a single Garden, or a distinction of areas. For every name that has come to us for the Gardens is deserved by every Garden if the distinction is by areas. Every Garden, we do not doubt, is the Garden of Refuge (Jannat Ma’wā), the Garden of Eden (Jannat ‘Adn), the Garden of Eternity (Jannat Khuld), the Garden of Delight (Jannat Na‘īm), and the Garden of Paradise (Jannat Firdaws), and they are one Essence (العين). These rulings belong to them even if they are distinguished by areas, for the ruling of these Names must apply to them.\n7.  The science of the difference between Eternity (الخلود), Perpetuity (التأبيد), Everlastingness (التسرمد), and non-exit.\n8.  The science of the difference between the Promise (الوعد) and the Threat (الوعيد) regarding the inclusion of the Divine Will (المشيئة) in one but not the other, and why the Threat accepts the Will while the Promise does not, even though both are Divine information, and where the wisdom lies in that.\n9.  The science of the heaven: whether it is like a sphere (الأكرة) or like a tent (الخيمة), or whether it is a sphere within a tent or a tent within a sphere, so that the earth rotates due to its rotation, and whether the heaven is stationary or moving. For witnessing (الشهود) grants all that we have mentioned. What remains is only the knowledge of what the matter is in itself, without regard to witnessing: whether it is as the witnessing of every witness dictates, or not so.\n10. The science of the existence of the two spouses (الزوجين) and by what each spouse honors the other: whether it is by what each of them needs, or whether it may be by what is not needed, so that there is no difference between the impotent man and his family.\n11. The science of whether the one who claims divinity has creation (خلق) or not. The claimant of divinity has absolutely no creation during the state of his claim. If he abandons the claim, his ruling is the ruling of all other existents who do not have this claim.\n12. The science of the ruling concerning one who takes a god without that god making a claim, but who is in himself a servant, displeased with what is attributed to him and incapable of removing what is claimed about him. He is oppressed, as this claimant has stripped him of what he deserves, which is his being a servant. Thus, he has wronged him, and Allah will grant him victory, not for Himself. Taking a partner is among the injustices of the servants.\n13. The science of what Wisdom (الحكمة) is.\n14. The science of attaching the non-legislating prophet to the prophets in the rank of knowledge concerning Allah the Exalted.\n15. The science of Divine and Prophetic counsels and manners (الوصايا والآداب), whether revealed (موحى بها) or inspired (ملهمة إليها).\n16. The science of taking the preferable course and hastening to it.\n17. The science of what falls under contingent power (القدرة الحادثة) and what does not.\n18. The science of what is inevitable.\n19. The science of the difference between sound (الصوت), letter (الحرف), speech (الكلام), and cattle (الأنعام).\n20. The science of manifest and hidden blessings, and general and restricted blessings.\n21. The science of the salvation of the reliance of the observer, even if it is based on ambiguity.\n22. The science of who among creation should be attributed with blame.\n23. The science of the difference between one who returns to Allah through Unveiling (كشف) and one who returns to Him without Unveiling.\n24. The science of the Preceder (المتقدم) and the Successor (العاقب), and that they are one.\n25. The science of what should not be cared about due to ignorance of it.\n26. The science of what cannot be ignored.\n27. The science of the time when beautiful praise is specified, and upon what it is specified, while all states and times seek it.\n28. The science of what constitutes sufficient praise, after which no increase is accepted.\n29. The science of the ruling of the many being the ruling of the one in relation to the One, and the reliance of the many upon the many, and the reliance of the many upon the One.\n30. The science of marriage for procreation and for non-procreation, and which of the two is higher.\n31. The science of what The Real (الحق) and falsehood (الباطل) share, and that this is only in the Imagination (الخيال).\n32. The science of what is knowledge and what is not knowledge.\n\n<<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو ترپن: تین طلسمی (طلسمية) حکمی (حكمية) اسرار کے مقام کی معرفت کے بیان میں، جو سبب کے مقام کی معرفت اور اس کا حق ادا کرنے کی طرف اشارہ کرتے ہیں، اور یہ مقام حضرت محمدیہ (الحضرة المحمدية) سے ہے۔\n\n> میرے امام سے کہہ دو اگر تم مجھ سے انس رکھتے ہو،\n> تو میرا انس میرے رب سے ہے، نہ کہ میری شکلوں سے۔\n\n> میرا انس میرے رب سے ہے، نہ والدین سے اور نہ ہی اہل و عیال سے،\n> کیونکہ میرے جیسوں کا وجود میری ہی مثال ہے۔\n\n> میری مخلوق مجھ سے بھاگی اور مجھ سے وحشت کھائی،\n> تو میں ماضی اور حال سے کیسے انس رکھ سکتا ہوں؟\n\n> اور وہ مجھے کیسے انس دے سکتا ہے جو مجھ سے مناسبت نہیں رکھتا،\n> اور نہ ہی میری کوئی حالت اس سے مناسبت رکھتی ہے۔\n\n> اور مثال تو ضد ہے، تو اے میرے ٹھکانے! انس کیسا؟\n> اور عقل اس سے منع کرتی ہے، پس حال وہی حال ہے۔\n\n> جب میں نے اس ذات کو نہ جانا جس کی کوئی شے مشابہ نہیں سوائے میرے،\n> تو میں نے جہالت میں اسے اپنے خیال پر گزار دیا۔\n\n> میں کیوں کہوں کہ ذات حق (الحق) مجھے طلب کرتی ہے،\n> حالانکہ میں اسے نہیں جانتا؟ مجھے اس سے کیا غرض، مجھے اس سے کیا غرض؟\n\n> انس ہمیں طلب کرتا ہے کہ وہ ہم میں قائم ہو،\n> اور وہ ادنیٰ کے بغیر اعلیٰ سے انس نہیں رکھتا۔\n\n> میں اس میں حیران ہو گیا ہوں اور میری وحشت مجھ سے چمٹی ہوئی ہے،\n> اور میں اسے اپنی امیدوں کے سوا کسی چیز سے دور نہیں کرتا۔\n\n> کسی حکیم نے انس کا ذائقہ نہیں چکھا جب تک کہ اس کی آنکھ کے سامنے\n> میرے علوم یا میرے اعمال میں سے کوئی مثال ظاہر نہ ہو۔\n\n### [بیشک اللہ نے اس نشأۃ دنیویہ (النشأة الدنيوية) میں نفس ناطقہ (النفس الناطقة) پر تین چیزوں کو مسلط کیا ہے]\n\nجان لو، اللہ تمہیں اپنی روح سے تائید بخشے، کہ جب اللہ نے اس ڈھانچے (ہیکل) کی تدبیر کرنے والے نفس ناطقہ (النفس الناطقة) کو پیدا کیا جسے انسان کہا جاتا ہے، تو اس نے اس خاص مزاج پر، جو اس نشأۃ دنیویہ (النشأة الدنيوية) سے مخصوص ہے، تین چیزوں کو مسلط کر دیا جنہیں اس نے اس کی نشوونما کے لوازمات میں شامل کیا: نفس نباتیہ (النفس النباتية)، نفس شہوانیہ (النفس الشهوانية)، اور نفس غضبیہ (النفس الغضبية)۔ نفس نباتیہ اور غضبیہ تو جنت میں اہل سعادت کی نشوونما میں زائل ہو جائیں گے، اور اس نشوونما میں صرف نفس شہوانیہ باقی رہے گا، جو دونوں نشوونماؤں کے لیے لازم ہے، اور اسی کے ذریعے اہل نعمت کو لذت حاصل ہو گی۔\n\nجہاں تک نفس نباتیہ کا تعلق ہے، تو یہ وہ ہے جو غذا طلب کرتا ہے تاکہ اس کے ذریعے اس کمی کو پورا کرے جو اس میں واقع ہوئی ہے، اور اس سے جسم کی نشوونما ہوتی ہے۔ یہ ہمیشہ غذا حاصل کرتا رہتا ہے، یا تو باہر سے جو لائی جاتی ہے اور جسے کھانا کہا جاتا ہے، یا جہاں سے اللہ چاہے بغیر کسی تعین کے۔ اس کے چار منتظمین (وزعہ) ہیں: جاذب (کھینچنے والا)، ماسک (روکنے والا)، ہاضم (ہضم کرنے والا)، اور دافع (دھکیلنے والا)۔\n\nجاذب (الجاذب) کا حکم یہ ہے کہ وہ غذا کو ایک جگہ سے دوسری جگہ منتقل کرے، چنانچہ وہ اسے منہ سے معدے تک، معدے سے جگر تک، اور جگر سے دل اور بدن کی تمام رگوں اور اجزاء تک منتقل کرتا ہے۔ یہ بدن کے ان اجزاء پر تقسیم کرنے والا ہے جنہیں اپنی قوتوں کے لیے ضرورت ہوتی ہے، اور دافع (الدافع) اس کی مدد کرتا ہے۔ دافع اسے اس کی جگہ سے دھکیل دیتا ہے جب وہ دیکھتا ہے کہ اس نے اس جگہ سے اپنا حق پورا کر لیا ہے اور اب اس کا وہاں کوئی کام باقی نہیں رہا، اور اسے دھکیل دیتا ہے تاکہ جب کوئی دوسری چیز آئے تو اس کے ساتھ مزاحمت نہ کرے۔ پس یہ جاذب کی مدد کرتا ہے۔\n\nماسک (الماسك) وہ ہے جو اسے ہر جگہ روکے رکھتا ہے تاکہ تدبیر اس میں اپنا حق لے سکے، اور جب وہ دیکھتا ہے کہ اس نے اپنا حق پورا کر لیا ہے تو اپنا ہاتھ اس سے ہٹا لیتا ہے، اور پھر دافع اور جاذب اس کی ذمہ داری سنبھال لیتے ہیں۔ ہاضم (الهاضم) وہ ہے جو غذا کی صورت کو بدل دیتا ہے اور اسے ایک دوسری صورت عطا کرتا ہے، یہاں تک کہ وہ اس صورت پر نہیں رہتی جس پر وہ پہلے تھی، کیونکہ وہ ایک اچھی صورت اور خوشبو والی تھی، لیکن جب وہ اس کے ہاتھ میں آئی تو اس نے اس کی شکل بدل دی اور اسے ایک متغیر صورت عطا کر دی جس کی بو نظام کو بگاڑنے والی ہوتی ہے۔ اسی لیے اسے ہاضم (ہضم کرنے والا) کہا گیا، اہتضام (دباؤ ڈالنے) سے۔ لیکن اس اہتضام میں حکمت کا وجود ہے، کیونکہ اگر ہضم نہ ہوتا تو وہ مقصود حاصل نہ ہوتا جو غذا دینے والے نے غذا سے چاہا تھا۔ پس ظاہر میں یہ فساد ہے اور باطن میں اصلاح ہے۔\n\nیہ ہاضم اسے ایک صورت سے دوسری صورت میں منتقل کرتا رہتا ہے، اور ماسک اس کے بقا کو روکے رکھتا ہے تاکہ وہ اس میں وہ تدبیر کر سکے جو اس کا علم اسے دیتا ہے اور جس کا وہ ذمہ دار بنایا گیا ہے۔ جب وہ دونوں اس مقام کے مطابق اپنا حق پورا کر لیتے ہیں تو اسے چھوڑ دیتے ہیں، اور جاذب اور دافع اسے لے لیتے ہیں۔ جب وہ اسے اتار کر دوسری جگہ منتقل کرتے ہیں تو اسے دوبارہ ماسک اور ہاضم کے سپرد کر دیتے ہیں، اور وہ اس میں وہی کرتے ہیں جو انہوں نے پہلی جگہ میں کیا تھا، اور اس میں مختلف صورتیں کھولتے ہیں۔ پھر جاذب اور دافع ان صورتوں کو مخصوص راستوں پر چلاتے ہیں، جن سے وہ تجاوز نہیں کرتے جب تک اللہ اس طبعی نشوونما کو باقی رکھنا چاہتا ہے۔ اگر یہ منتظمین نہ ہوتے تو نفس نباتیہ اپنے مطلوب کو حاصل نہ کر پاتا۔\n\nجب اللہ اس طبعی نشوونما کی ہلاکت کا ارادہ کرتا ہے، تو نفس نباتیہ شہوت سے مدد طلب کرتا ہے تاکہ مدبر نفس اس چیز کو لانے کے لیے ابھرے جس کی وہ خواہش کرتا ہے، لیکن وہ ایسا نہیں کرتا۔ اللہ اس کو کمزور کر دیتا ہے اس کے مقام پر حرارت کے غلبے کے ذریعے، چنانچہ وہ کمزور ہو جاتا ہے، جیسے سورج کی روشنی میں چراغ کی روشنی کمزور ہو جاتی ہے اور اس کا کوئی حکم باقی نہیں رہتا۔ نفس نباتیہ اپنی حقیقت کے ساتھ باقی رہتا ہے اور اپنے منتظمین سے کہتا ہے کہ مجھے کسی چیز کی ضرورت ہے جس سے میں غذا حاصل کروں، چنانچہ وہ بدن کے اخلاط اور اس میں باقی ماندہ فضول چیزوں سے غذا حاصل کرتا ہے۔ اس کے منتظمین بھی اس کی طرح کمزور ہو چکے ہوتے ہیں، چنانچہ نشوونما مسلسل بڑھتی ہوئی کمی کا شکار ہوتی رہتی ہے، اور دافع قوی ہوتا جاتا ہے اور جاذب کمزور ہوتا جاتا ہے، اور اسی طرح ماسک بھی، یہاں تک کہ انسان مر جاتا ہے۔ اگر ان آلات کے ذریعے اس نشوونما کی یہ تدبیر نہ ہوتی، تو نہ کان سنتے، نہ آنکھ دیکھتی، اور نہ ہی ان حسی اور معنوی قوتوں میں سے کسی کا کوئی حکم ہوتا۔\n\nجہاں تک نفس شہوانیہ (النفس الشهوانية) کا تعلق ہے، تو اس ڈھانچے میں اس کا غلبہ اس چیز کو طلب کرنا ہے جو اس کے نزدیک اچھی ہو، اور وہ یہ نہیں جانتا کہ آیا یہ اسے نقصان دے گی یا فائدہ۔ یہ صرف انسان کی نشوونما میں ہوتا ہے۔ جہاں تک باقی حیوانات کا تعلق ہے، تو وہ غذا صرف ارادے (الإرادة) سے لیتے ہیں، نہ کہ شہوت سے، تاکہ بھوک اور ضرورت کے درد کو خود سے دور کر سکیں، چنانچہ وہ صرف اسی چیز کا ارادہ کرتے ہیں جس میں ان کے لیے فائدہ ہو۔ حیوان میں شہوت کا حکم غذا کی کثرت میں باقی رہتا ہے، اور اسی سے اس میں خلل پیدا ہوتا ہے۔ انسان میں بھی اسی طرح خلل پیدا ہوتا ہے، اس چیز کی کثرت سے جس کا تھوڑا حصہ فائدہ مند ہو، اور اس چیز کے استعمال سے جو بالکل بھی فائدہ مند نہ ہو، جسے شہوت طلب کرتی ہے اور جس سے مزاج کو نقصان پہنچتا ہے۔ پس غذا کے استعمال میں انسان اور حیوان کے درمیان یہی فرق ہے۔\n\nنفس شہوانیہ، نفس نباتیہ کے لیے ایسا ہی ہے جیسا کہ اس بارے میں کہا گیا ہے:\n\n> إذا امتحن الدنيا لبيب تكشفت *** له عن عدو في ثياب صديق‏\n> *ترجمہ:* جب کوئی عقلمند دنیا کا امتحان لیتا ہے، تو وہ اس کے لیے دوست کے لباس میں ایک دشمن کے طور پر ظاہر ہوتی ہے۔\n\nپس اس کی نفس نباتیہ کے ساتھ دوستی ہے کیونکہ وہ غذا اور اس کے استعمال میں اس کی مددگار ہے، اور وہ دشمن بھی ہے کیونکہ وہ اس میں ایسی غذائیں داخل کرتی ہے جو اسے نقصان پہنچاتی ہیں اور فائدہ نہیں دیتیں۔ پس نفس نباتیہ کے لیے اس کی مدد بالعرَض (ضمنی طور پر) ہے نہ کہ بالذات (بنیادی طور پر)۔ لہٰذا، یہ وہ لازم دشمن ہے جس سے جدا ہونا ممکن نہیں اور جس کے شر سے امان نہیں ہے۔\n\nجہاں تک نفس غضبیہ (النفس الغضبية) کا تعلق ہے، جو کہ سبعیہ (درندگی) ہے، تو یہ وہ ہے جو قہر (غلبہ) طلب کرتی ہے، کیونکہ اس نے ان قوتوں کی وجہ سے جو اسے دی گئی ہیں اور تصرف کی قدرت کی وجہ سے، اپنے آپ کو باقی حیوانات پر فوقیت میں دیکھا، اور اس نے دیکھا کہ عالم اس کی نشوونما اور اس کے مدبر کے لیے مسخر ہے۔ اور اس نے دیکھا کہ وجود میں اتفاقی یا ظاہری اسباب کی وجہ سے ایسے عوارض پیش آتے ہیں جو اسے اپنے مقاصد تک پہنچنے سے روکتے ہیں۔ چنانچہ وہ مقصد حاصل نہ ہونے پر غضبناک ہوتی ہے۔ اگر اس کے پاس قوی مددگار غلبہ ہو، جو فعال ہمت یا باہر سے حکم دینے والا ہو جس کے ذریعے وہ مغضوب علیہ پر اپنا غضب نافذ کر سکے، تو وہ اسے ہلاک کر دیتی ہے اور اس سے انتقام ظاہر کرتی ہے۔ اور وہ اس انتقام اور قہر میں ظلم اور عدل کا میزان نہیں جانتی، کیونکہ یہ اس کا کام نہیں ہے، بلکہ یہ عقل اور وقت کے ناموس (قانون) کا کام ہے۔\n\nاسی لیے اس شاعر نے غلطی کی جس نے کہا:\n\n> الظلم من شيم النفوس فإن تجد *** ذا عفة فلعلة لا يظلم‏\n> *ترجمہ:* ظلم نفوس کی خصلتوں میں سے ہے، پس اگر تم کسی پرہیزگار کو پاؤ تو وہ کسی علت کی وجہ سے ظلم نہیں کرتا۔\n\nاگر وہ ظلم کی جگہ قہر (القهر) کہتا تو صحیح کہتا، کیونکہ ظلم صرف شرعی (الشرعي) حکم سے ہی آتا ہے، اور اسی سے اسے پہچانا جاتا ہے۔ نفس کے لیے صرف قہر ہے، جو جاہلی حمیت ہے۔ اگر وہ حق کے موافق ہو جائے تو وہ دینی حمیت بن جاتی ہے۔ اسی لیے اللہ کے لیے اور اللہ میں غضب کی تعریف کی جاتی ہے، اور غیر اللہ کے لیے اور غیر اللہ میں غضب کی مذمت کی جاتی ہے۔ یہ حق حکیم (الحكيم الحق) کی تدبیر میں سے ہے، جس نے امور کو ان کے مراتب پر ترتیب دیا اور ہر چیز کو اس کی خلقت عطا کی تاکہ وہ اہل عقل (أولي الألباب) اور عالم کے باقی اہل آیات کے لیے ایک نشانی ہو، کیونکہ وہ اس معاملے میں مختلف ماخذ رکھتے ہیں، جیسا کہ اللہ نے اپنی عزیز کتاب میں ان کی تعداد بیان کی ہے، جس میں باطل نہ اس کے آگے سے آ سکتا ہے اور نہ اس کے پیچھے سے، یہ حکمت والے، قابل تعریف (حَمِيدٍ) کی طرف سے نازل کردہ ہے۔\n\nاور اس نے ان تمام آیات کو کتاب الوجود (كتاب الوجود) میں جمع کر دیا، جس میں بیان اور رحمت کے سوا کچھ نہیں ہے۔ پس عالم میں جو کچھ بھی ذات حق (الحق) کی طرف سے یا بعض کے بعض کے ساتھ معاملات میں ظاہر ہوتا ہے جو رحمت کے منافی ہو، تو وہ ایک عرضی امر ہے جس کا بیان کتاب میں کیا گیا ہے، جہاں وہ عارضہ خود اس کتاب کے نفس میں نہیں ہے۔ پس کتاب اپنی ذات کے اعتبار سے پوری کی پوری رحمت اور بیان ہے۔ اور جس چیز کو اللہ نے عذاب بنایا ہے، تو اللہ اس سے کہیں زیادہ کریم ہے کہ وہ اپنی مخلوق کو ایسا عذاب دے جس کا انجام ایک مقررہ مدت تک نہ پہنچے جسے کتاب کے بیان نے شامل اور متعین کر دیا ہو۔ پھر حکم رحمت کی طرف لوٹ جائے گا۔ یہ ضروری ہے، اور اللہ غفور رحیم (غَفُورٌ رَحِيمٌ) ہے۔\n\n### [ابن عربی کا عالم انسانی سے متعلق ایک عجیب الٰہی حکم سے مطلع ہونا]\n\nپھر تمہیں معلوم ہونا چاہیے کہ اللہ نے مجھے ایک عجیب حکم سے مطلع کیا ہے جو عالم انسانی سے متعلق ہے، اور میں نہیں جانتا کہ آیا اس کا تعلق انسان کے علاوہ باقی عالم سے بھی ہے یا نہیں، اللہ نے مجھے اس پر مطلع نہیں کیا۔ اور میرے لیے یہ مناسب نہیں کہ میں اللہ کے بارے میں وہ بات کہوں جو میں نہیں جانتا۔ اللہ مجھے اور تمہیں اس سے محفوظ رکھے۔ یہ حکم عالم انسانی میں دنیا کے ہر تین ہزار سال گزرنے پر ظاہر ہوتا ہے، اور یہ اللہ کے نزدیک ایک دن ہے۔ میں نہیں جانتا کہ یہ دن کس الٰہی اسم کی طرف لوٹتا ہے، کیونکہ مجھے اس کے بارے میں صرف اتنا معلوم ہوا ہے کہ ذات حق (الحق) تعالیٰ نے اسے میرے لیے تین حصوں میں تقسیم کیا ہے، ہر حصہ ایک ہزار سال کا ہے، اور ایک ہزار سال رب کے دنوں میں سے ایک دن ہے۔ یہ وہ ہے جو میرے رب نے مجھے بتایا ہے۔ اور یہ مدت جو تین ہزار سال کی ہے، اس کا حکم انسان میں آغاز اور عود، اور زندگی اور موت کا حکم ہے، جیسے اللہ چاہے اور جہاں اللہ چاہے۔\n\nتاہم، جب اللہ نے اس امر کو میرے لیے میرے درجات میں کلمات کی صورت میں رقم کیا، جنہیں میں نے مشاہدہ کیا، تو اس نے ایک کلمہ چاندی سے اور ایک کلمہ سونے سے اس صورت میں رقم کیا۔ پس میں نے جان لیا کہ یہ وہ احوال اور احکام ہیں جو جنت میں انسان پر اس مقررہ مدت کے گزرنے پر ظاہر ہوں گے۔ اور میرے پاس کوئی الٰہی خبر نہیں آئی جس نے اس امر کو اس طرح متاثر کیا ہو جس طرح اس نے بے چینی اور خوف کو متاثر کیا، اور میرے دل کو سکون صرف اس بات سے ملا کہ کلمات سونے اور چاندی کے تھے، سنہری کلمہ اس کے ساتھ چاندی کے کلمے کے پہلو میں تھا۔\n\nجب یہ الٰہی القاء اور ربانی تعریف مکمل ہوئی اور اس صورت میں اس تجلی (التجلی) کے درد سے جو میں محسوس کر رہا تھا، مجھے سکون ملا اور مجھ سے وہ کیفیت دور ہوئی، تو میں نے الہام کا نظم کیا، نہ کہ غور و فکر کا نظم، جسے میں یاد کرتا ہوں:\n\n> ہمارا ایک پاکیزہ محبوب ہے، میں اس کا نام نہیں لیتا،\n> اور وہ وہی محبوب ہے جس میں مخلوق حیران ہے۔\n\n> اگر میں کہوں کہ یہ ہے، تو حد اسے گھیر لیتی ہے،\n> یا اگر میں کہوں کہ وہ ہے، تو یہ ایسی بات ہے جسے میں نہیں جانتا۔\n\n> غیب تک کیسے پہنچا جائے، حالانکہ ہماری آنکھیں\n> ہر وقت اسے اس کے ظہور الٰہی (التجلی) سے دیکھتی ہیں۔\n\n> یا اگر میں کہوں کہ وہ میرے پاس ہے، تو ظرف اسے طلب کرتا ہے،\n> اور ظرف حق ہے لیکن وہ اسے گھیر نہیں سکتا۔\n\n> میں نے کوئی ایسی ہستی (الوجود) نہیں دیکھی جسے میں نہ جانتا ہوں،\n> سوائے اس کے جس کے معانی میں سے میں ایک معنی ہوں۔\n\n> میں اس میں حیران ہوں اور کائنات بھی اس میں حیران ہے،\n> اور میرے کانوں نے اس کے بارے میں کتنی باتیں سنی ہیں۔\n\n> یہ وہ ہے جسے ذات حق (الحق) کے جلال نے بیمار کر دیا ہے،\n> تو کیا اس کے پاس اس کا کوئی بدل ہے جو اسے شفا دے؟\n\n> وہ شفا ہے، وہ درد ہے، تو میں کہاں ہوں؟\n> آنکھ ایک ہے اور ہم سب اس میں ہیں۔\n\n(ضمیر 'أمرضه' (اسے بیمار کر دیا) کائنات کی طرف لوٹتا ہے۔)\n\n### [بیشک ہمیں اللہ کی طرف سے الہام (الإلهام) حاصل ہوتا ہے نہ کہ وحی (الوحي)]\n\nجان لو کہ ہمیں اللہ کی طرف سے الہام (الإلهام) حاصل ہوتا ہے نہ کہ وحی (الوحي)، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کی وفات کے ساتھ وحی کا راستہ منقطع ہو چکا ہے۔ وحی آپ سے پہلے بھی تھی، اور کوئی الٰہی خبر نہیں آئی کہ آپ کے بعد وحی ہو گی، جیسا کہ فرمایا: \"وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ\" (اور بیشک تمہاری طرف اور تم سے پہلے والوں کی طرف وحی کی گئی)۔ اور اس کے بعد وحی کا ذکر نہیں کیا، اگرچہ یہ لازم نہیں ہے۔\n\nاور حضرت عیسیٰ علیہ السلام کے بارے میں سچی نبوی خبر آئی ہے، جو رسول اللہ صلی اللہ علیہ وسلم سے پہلے وحی پانے والوں میں سے تھے، کہ جب وہ نازل ہوں گے تو وہ ہماری ہی سنت پر ہمیں نماز پڑھائیں گے۔ پس جب وہ نازل ہوں گے تو ان کے لیے کشف (الکشف) اور الہام (الإلهام) ہو گا، جیسا کہ اس امت کے لیے ہے۔ اور الہام کے بارے میں یہ گمان نہیں کرنا چاہیے کہ یہ الٰہی خبر نہیں ہے، معاملہ ایسا نہیں ہے۔ بلکہ یہ الٰہی خبر ہے اور اللہ کی طرف سے بندے کو ایک ایسے فرشتے کے ذریعے خبر دینا ہے جو اس ملہم (الہام پانے والے) سے غائب ہوتا ہے۔ اور کبھی خاص وجہ (الوجه الخاص) سے بھی الہام ہوتا ہے۔ رسول اور نبی وحی کے وقت فرشتے کا مشاہدہ کرتے ہیں اور اسے آنکھوں سے دیکھتے ہیں، جبکہ غیر رسول اس کے اثر کو محسوس کرتا ہے لیکن اسے آنکھوں سے نہیں دیکھتا۔ پس اللہ اس کے ذریعے اسے وہ الہام کرتا ہے جو وہ چاہتا ہے، یا اسے خاص وجہ سے واسطوں کے اٹھ جانے کے ساتھ عطا کرتا ہے، اور یہ القاء سب سے اعلیٰ اور اشرف ہے۔ اور یہ وہ ہے جس میں رسول اور ولی دونوں شریک ہوتے ہیں۔ پس رحمن کی انگلیاں خاص وجہ کے لیے ہیں، اور فرشتے کا لمس مشترک وجہ کے لیے ہے۔ اور الہام اکثر الٰہی ہوتا ہے جس میں کوئی واسطہ نہیں ہوتا۔\n\nجس نے اسے پہچانا، اس نے جان لیا کہ اسے کیسے حاصل کیا جاتا ہے، اور اس کا مقام نفس ہے۔ اللہ تعالیٰ نے فرمایا: \"فَأَلْهَمَهَا\" (پس اس نے اسے الہام کیا)۔ پس فاعل اس کی ہویت (ذات) ہے، وہی الہام کرنے والا ہے، کوئی اور نہیں۔ \"فُجُورَهَا\" (اس کی فجور - نافرمانی) تاکہ وہ اسے جان لے، نہ کہ اس پر عمل کرے، اور \"وَتَقْوَاهَا\" (اور اس کی تقویٰ - پرہیزگاری) تاکہ وہ اسے جان لے اور اس پر عمل کرے۔ پس یہ الہام، اعلام (خبر دینے) کا الہام ہے، نہ کہ جیسا کہ بے علم لوگ گمان کرتے ہیں۔ اسی لیے فرمایا: \"وَقَدْ خَابَ مَنْ دَسَّاهَا\" (اور بیشک وہ ناکام ہوا جس نے اسے دبا دیا)۔\n\nدس (دسّ) کا مطلب ہے ازدحام کے ساتھ خفیہ طور پر شامل کرنا۔ پس حق یہ ہے کہ فجور پر عمل کو تقویٰ پر عمل کے ساتھ شامل کر دیا جائے، اور جہاں تفریق کی جگہ تھی وہاں تفریق نہ کی جائے، چنانچہ علم اور عمل میں دونوں کو جمع کر دیا جائے۔ اور معاملہ ایسا نہیں ہے۔ اس کی جہالت کا سبب یہ ہے کہ اس نے میزان شرع (ميزان الشرع) کو اپنے ہاتھ سے پھینک دیا۔ اگر وہ میزان کو اپنے ہاتھ سے نہ چھوڑتا تو دیکھتا کہ اسے تقویٰ کا حکم دیا گیا ہے اور فجور سے منع کیا گیا ہے، اور دونوں امر اس کے لیے واضح کر دیے گئے ہیں۔\n\nاور جب اللہ نے فجور کو بھی نفس کی طرف منسوب کیا اور تقویٰ کو بھی، تو ہم نے جان لیا کہ اس ملہم (الہام پانے والے) نفس سے وجود میں دونوں کا واقع ہونا ضروری ہے۔ اور فجور اس کے لیے وہ تھا جو اس کے لیے کسی تاویل (تأويل) کی وجہ سے ظاہر ہوا جس کی اس نے تاویل کی، چنانچہ اس نے الٰہی حرمت کو پامال کرتے ہوئے مخالفت پر اقدام نہیں کیا، اور اس کے لیے یہ ممکن نہیں تھا۔ اور یہ نفوس پر اللہ کی رحمت میں سے تھا۔ اور چونکہ فجر دو طرح کی ہے: فجر کاذب (جھوٹی فجر) اور فجر صادق (سچی فجر)، اور فجر کاذب مستطیل (لمبی) ہوتی ہے، اس لیے اللہ نے اسے اس کی تقویٰ کا الہام کیا، یعنی وہ اپنے فجور میں فجر مستطیل سے بچے، کیونکہ وہ اولیت کے ساتھ اس پر لمبی ہوتی ہے، اس فجر مستطیر (پھیلنے والی) کے مقابلے میں جس کا حکم اس سے مؤخر ہوتا ہے۔ پس اس نے اسے اس کے فجور میں فجر مستطیل کا الہام کیا، چنانچہ اس انفجار کے ذریعے اس کے لیے وہ چیز واضح ہو گئی جس میں شک ہے اور جس میں شک نہیں ہے، اور اس کی تقویٰ (پرہیزگاری) اور وہ چیز جس سے وہ بچتا ہے، جس کا حکم اس میں نقصان دہ ہے۔ اگر اللہ اسے اس چیز کی قدرت نہ دیتا جس سے وہ بچتا ہے، جو کہ وہ معنی ہے جس کا اسے الہام کیا گیا تاکہ نفس اس کے استعمال پر متنبہ ہو، اور وہ شبہ اور دلیل کے درمیان فرق کر سکے، تو وہ ان دونوں میں فرق کرنے کی قدرت نہ پاتا۔\n\nکیونکہ اللہ سبحانہ و تعالیٰ نے جس طرح فحشاء (بے حیائی) کا حکم نہیں دیا، اسی طرح اس نے بندے کو فحشاء پر عمل کا الہام بھی نہیں کیا، جیسا کہ بعض لوگ سمجھتے ہیں۔ اور اگر وہ اسے فحشاء پر عمل کا الہام کرتا، تو بندے پر اللہ کی حجت قائم نہ ہوتی۔ بلکہ یہ آیت اس کے قول کی طرح ہے: \"وَهَدَيْنَاهُ النَّجْدَيْنِ\" (اور ہم نے اسے دونوں راستے دکھا دیے)، یعنی ہم نے دونوں راستے اس کے لیے واضح کر دیے۔ پس فرمایا: \"إِنَّا هَدَيْنَاهُ السَّبِيلَ\" (بیشک ہم نے اسے راستہ دکھا دیا) یعنی ہم نے اس کے لیے واضح کر دیا، \"إِمَّا شَاكِرًا\" (یا تو شکر گزار ہو کر) تو وہ راستے میں اس کے تقاضے کے مطابق عمل کرے، اگر وہ نہی ہو تو رک جائے اور اگر امر ہو تو عمل کرے، \"وَإِمَّا كَفُورًا\" (اور یا ناشکرا ہو کر) جو اپنے آپ پر پردہ ڈالتا ہے، چنانچہ وہ اپنے آپ کو دھوکہ دیتے ہیں۔ کیونکہ کوئی بھی شخص علم کے باوجود گمراہ نہیں ہوتا۔ حق کے بیان کے بعد کوئی بیان نہیں ہوتا، اور بیان کا فائدہ صرف علم کا حصول ہے۔ پھر جاننے والا اسے اپنے کسی مقصد کے لیے خود سے چھپا لیتا ہے، چنانچہ اس پر اللہ کی حجت قائم ہو جاتی ہے۔ پس الہام ایک الٰہی اعلام (خبر) ہے۔ جس نے اپنے نفس کو تقویٰ (التقوى) سے پاک کیا، اور فجور سے اس چیز سے پرہیز کیا جس سے پرہیز کرنا چاہیے، اور اس سے وہ لیا جو لینا چاہیے، اور جس نے اپنے نفس کو اس جگہ میں دبا دیا جہاں اسے کہا گیا تھا کہ داخل نہ ہو، تو وہ ناکام ہوا۔\n\nپس جو شخص علم اور سعادت کا راستہ چاہتا ہے، وہ ایک لمحے کے لیے بھی میزان شرع (ميزان الشرع) کو اپنے ہاتھ سے نہ چھوڑے۔ کیونکہ میزان اللہ کے ہاتھ میں ہے، وہ اسے نہیں چھوڑتا۔ وہ قسط کو کم کرتا ہے اور اسے بلند کرتا ہے، اور یہ وہی ہے جس پر ہستی (الوجود) کے احوال قائم ہیں۔ اگر ذات حق (الحق) میزان کو اپنے ہاتھ سے چھوڑ دے، تو عالم ایک ہی دفعہ میں فنا (الفناء) ہو جائے۔ اور اسی طرح مکلف، بلکہ انسان کو بھی چاہیے کہ وہ میزان مشروع کو اپنے ہاتھ سے نہ چھوڑے جب تک وہ مکلف ہے۔ کیونکہ اگر وہ اسے ایک لمحے کے لیے بھی اپنے ہاتھ سے چھوڑ دے، تو پوری شریعت فنا ہو جائے گی، جیسے عالم فنا ہو جاتا اگر ذات حق میزان کو اپنے ہاتھ سے چھوڑ دیتا۔ کیونکہ مکلف کی ہر حرکت اور سکون میں میزان شرع کا حکم ہوتا ہے، لہٰذا شریعت کے باقی رہتے ہوئے اسے چھوڑنا صحیح نہیں ہے۔\n\nپس یہ میزان اس کے لیے اس کے مکلف ہونے کی حیثیت سے ہے۔ اور دوسری میزان، جسے انسان کو نہیں چھوڑنا چاہیے، نہ صرف مکلف ہونے کی حیثیت سے بلکہ دنیا اور آخرت میں اس کے ہاتھ میں ہے، وہ میزان علم ہے، جس کا میزان شرع ایک حکم ہے۔ اور یہ اس میزان کی طرح ہے جو ذات حق (الحق) کے ہاتھ میں ہے۔ اسی کے ذریعے وہ حق کے وزن کا مشاہدہ کرتا ہے۔ اس کا نسبت میزان حق سے ایسی ہے جیسے ایک شخص کے ہاتھ میں میزان ہو اور دوسرے شخص کے ہاتھ میں آئینہ ہو، اور اس نے اپنے ہاتھ میں موجود آئینے میں اس میزان، وزن کرنے والے اور وزن کی صورت دیکھی، چنانچہ اس نے اپنے وجود میں اس کے مشاہدے سے امر کی صورت کو جان لیا۔ اور یہ امر اس کے پیچھے اس کے لیے غیب تھا، اگر آئینہ نہ ہوتا تو وہ اس کا مشاہدہ نہ کر پاتا۔ پس اس نے جو کچھ اپنے آئینے میں دیکھا اسے اپنی طرف منسوب کیا، کیونکہ اس کا آئینہ اس کے سوا کچھ نہیں ہے۔\n\nپس وہ غیب جو وزن کرتا ہے، اور وزن، اور میزان، یہ ذات حق (الحق) کی حضوری ہے، اور آئینہ انسان کی حضوری ہے۔ پس وزن اللہ کے لیے ہے، اور شہود (الشهود) اس کے لیے ہے جس کا نفس آئینہ ہو۔ پس وہ سعید اور صادق ہے۔ اور اللہ نے یہ راز صرف اس پر کھولا جس پر کھولا، تاکہ وہ اپنے آئینے میں الٰہی تخلیق کی صورت دیکھے، اور چیزوں کا صدور اور وجود میں ان کا ظہور اس کی طرف سے کیسے ہوتا ہے۔ اور یہ حضرت ابوبکر صدیق رضی اللہ عنہ کا قول ہے: \"میں نے کوئی چیز نہیں دیکھی مگر یہ کہ میں نے اللہ کو اس سے پہلے دیکھا۔\" پس وہ دیکھتا ہے کہ وہ چیز کہاں سے صادر ہوئی، چنانچہ یہ کشف (الکشف) کا حامل خلاق (تخلیق کرنے والا) ہوتا ہے۔ اور یہی وہ ہے جو ذات حق (الحق) نے اس کشف کے ذریعے اس سے چاہا، بلکہ وہ جانتا ہے کہ وہ اس کشف سے خلاق ہے، اور وہ ہمیشہ سے ایسا ہی تھا اور اسے شعور نہیں تھا۔ پس اس کشف نے اسے اس امر کا علم دیا جس پر معاملہ ہے، نہ کہ وہ کشف کے ذریعے خلاق بن گیا۔\n\nپس اللہ نے اسے حکم دیا کہ وہ ہر چیز کو اس کی صورت کا حق دے، جیسا کہ اللہ نے اسے اس کی صورت میں اس کی خلقت عطا کی۔ چنانچہ کسی مخلوق کی طرف سے اس پر کوئی مطالبہ عائد نہیں ہوتا، جیسا کہ ذات حق (الحق) تعالیٰ پر کسی مخلوق کی طرف سے کوئی مطالبہ عائد نہیں ہوتا۔ یہ وہ فائدہ ہے جو اس کشف نے اسے دیا۔ پس جب ذات حق اسے اس کے کسی مامور بہ فعل یا ممنوعہ فعل میں قائم کرتا ہے، تو وہ اس حق کو دیکھتا ہے جو اس فعل کا اس کے ذمہ ہے، چنانچہ وہ اس فعل کا حق پورا کرتا ہے۔ اگر وہ مامور بہ امور میں سے ہو، تو وہ اسے اس کی نشوونما میں اس کا حق دیتا ہے، یہاں تک کہ وہ خلقت میں سیدھا اور نشوونما میں معتدل ہو کر قائم ہو، چنانچہ اس فعل کا اس کے فاعل پر کوئی حق عائد نہیں ہوتا۔ پس خلقت اللہ کے لیے ہے اور حق بندے کے لیے ہے۔ ذات حق (الحق) نے \"أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ\" (ہر چیز کو اس کی خلقت عطا کی) اور مخلوق نے ہر چیز کو اس کا حق دیا۔ پس اس مسئلے میں حق خلقت میں داخل ہوا اور خلقت حق میں داخل ہوئی۔ اور اگر وہ ممنوعہ امور میں سے ہو، تو اس کا حق اس بندے پر یہ ہے کہ وہ اسے وجود نہ دے اور نہ ہی اس کے لیے کوئی عین (حقیقت) ظاہر کرے۔ اگر وہ ایسا نہیں کرتا، تو اس نے اس کا حق پورا نہیں کیا، اور اس پر اس کا مطالبہ عائد ہو گیا، چنانچہ اس نے ہر چیز کو اس کا حق نہیں دیا، اور وہ خلقت میں حق کے مقام پر قائم نہ ہو سکا، چنانچہ وہ مغلوب ہو گیا۔ پس الٰہی امور اور اوامر کو اسی طرح جاننا چاہیے۔\n\nاور جناب الٰہی میں تروک (ترک کی گئی چیزوں) کی صورت وہ ہے جو کسی ممکن الوجود کی طرف سے دوسرے ممکن الوجود کے لیے وجود میں نہیں آئی، جس کے وجود کو ترجیح دی گئی تھی۔ پس اس حیثیت سے کہ وہ وجود میں نہیں آئی، وہ اس کے لیے ترک ہے۔ یہ ایک ایسا مسئلہ ہے جس پر ہم نے تمہیں متنبہ کیا ہے، کیونکہ ہم جانتے ہیں کہ تم اسے اس کتاب کے علاوہ کہیں نہیں پاؤ گے، کیونکہ یہ تصور میں نایاب ہے، لیکن اس کے لیے قریب الوصول ہے جس پر اللہ نے توجہ فرمائی ہو۔ یہ اللہ کے ساتھ ادب اور اللہ کے بندوں پر شریعت کی حفاظت سکھاتا ہے۔ اور یہ اللہ کے پاس محفوظ اسرار میں سے ہے جو صرف عارفین باللہ (العارفين بالله) پر ظاہر ہوتے ہیں، اور اسے اللہ کی کسی مخلوق سے چھپانا نہیں چاہیے۔ کیونکہ اگر جاننے والا اسے چھپائے گا، تو اس نے اللہ کے بندوں کو دھوکہ دیا، اور \"مَنْ غَشَّنَا فَلَيْسَ مِنَّا\" (جس نے ہمیں دھوکہ دیا وہ ہم میں سے نہیں)، یعنی وہ ہماری سنت میں سے نہیں ہے۔ اور جب ہم الٰہی رحمت کی کتاب میں اس مسئلے پر مطلع ہوئے، جو عارفین کے دلوں کی آنکھوں کی چراگاہ ہے، تو ہم نے اللہ کا شکر ادا کیا کہ اس نے پردہ اٹھا دیا اور بڑا عطیہ دیا۔ پس اسی کے لیے حمد اور احسان ہے۔\n\nاور جب بندہ اس صورت میں قائم ہو جاتا ہے جس کا ہم نے ذکر کیا کہ وہ خلاق ہے، تو اس پر لازم ہو جاتا ہے کہ وہ اس الٰہی صورت کی تکمیل کے لیے جس پر وہ قائم ہے، اس چیز کی صورت کو محفوظ رکھے جسے اس نے وجود دیا ہے، تاکہ اس کے لیے بقا (البقاء) ہو، یعنی اس چیز کے لیے جو اس سے وجود میں آئی ہے۔ چنانچہ وہ اسے اس کے سپرد کر دیتا ہے جو اس پر بقا کو محفوظ رکھتا ہے، اور وہ اللہ ہے۔ \"فَاتَّخِذْهُ وَكِيلًا\" (پس اسے وکیل بنا لو) اس امر اور اس جیسے امور میں اپنے رب کے حکم سے۔ پس اس میں اسے سوء ادب کی طرف منسوب نہیں کیا جائے گا۔ پس بندہ ہر لمحے اس چیز کی تخلیق میں مشغول ہے جس کی تخلیق کا اسے حکم دیا گیا ہے، اور ذات حق (الحق) اس بندے کے توکل کی وجہ سے، اپنے رب کے حکم سے، اس چیز کی حفاظت پر قائم ہے جسے اس نے خلق کیا ہے۔ اور یہ ایک دقیق الٰہی علم ہے، اور وہ یہ ہے کہ حفاظت کو اللہ کی طرف لوٹانا وکالت کے حکم سے اللہ کے حکم پر، اور بندے کی طرف سے چیزوں کا وجود اللہ کے حکم سے۔ پس یہ بندہ ہر حال میں اللہ کے حکم کے تحت رہتا ہے۔ اور جو شخص اپنے تمام احوال میں اللہ کے حکم کے تحت رہتا ہے، وہ دنیا اور آخرت میں ہمیشہ اللہ کے شہود (الشهود) میں رہتا ہے۔ کیونکہ اس کے لیے نشوونما وہیں ہے جہاں وہ اولیٰ اور آخرت میں اللہ کے حکم سے تھا۔ اللہ تعالیٰ نے حضرت عیسیٰ علیہ السلام کے حق میں فرمایا: \"وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنْفُخُ فِيهَا فَتَكُونُ طَيْرًا بِإِذْنِي\" (اور جب تم میرے حکم سے مٹی سے پرندے کی شکل بناتے تھے، پھر اس میں پھونک مارتے تھے تو وہ میرے حکم سے پرندہ بن جاتا تھا)۔ اور اسی طرح مکلف کو عمل کا حکم دیا گیا ہے، چنانچہ اس نے جو بھی عمل کیا وہ اللہ کے حکم سے ہی کیا۔\n\nاور اس بندے کا ٹھکانہ اور قرار گاہ اس کے رب کے پاس ہی ہے، اس حیثیت سے کہ وہ بہتر اور باقی رہنے والی ہے، اور وہ آخرت ہے جو \"خَيْرٌ وَأَبْقَى\" (بہتر اور زیادہ باقی رہنے والی) ہے، اور \"وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَى\" (اور بیشک آخرت تمہارے لیے دنیا سے بہتر ہے)، اور \"وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَى\" (اور عنقریب تمہارا رب تمہیں اتنا دے گا کہ تم راضی ہو جاؤ گے)۔ اور یہ \"کُن\" (ہو جا) کا عطیہ ہے ظاہر آنکھ میں، جیسا کہ باطن میں اس کے لیے ہے۔ کیونکہ انسان کے باطن میں \"کُن\" کی قوت ہے، اور ظاہر میں اس کے لیے صرف انفعال (رد عمل) ہے۔ اور آخرت میں \"کُن\" کا حکم اس کی طرف سے ظاہر میں ہو گا۔ اور بعض لوگوں کو دنیا میں بھی یہ عطا کیا جاتا ہے، لیکن اس میں وہ عمومیت نہیں ہوتی۔ پس اللہ کے بعض رجال نے اسے حاصل کیا، اور اللہ کے بعض رجال نے اس میں اللہ کے ساتھ ادب اختیار کیا، کیونکہ وہ جانتے تھے کہ یہ اس کا مقام نہیں ہے، خاص طور پر جب انہوں نے دیکھا کہ وہ اکابر جن کی تقدم میں کوئی اختلاف نہیں، ان سے اور ہم سے پہلے، ان سے کہا گیا: \"إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ\" (بیشک تم جسے چاہو ہدایت نہیں دے سکتے) اور ان سے کہا گیا: \"أَفَأَنْتَ تُنْقِذُ مَنْ فِي النَّارِ\" (تو کیا تم اسے بچا سکتے ہو جو آگ میں ہے؟) کیونکہ جب وہ اسلام لے آتا ہے تو وہ اہل نار میں سے نہیں رہتا۔ پس جب اللہ کے رجال نے دیکھا کہ اس گھر میں اس حکم میں عمومیت نہیں ہے، تو انہوں نے اس حکم کو جو عام نہیں ہے، اس حکم کی طرف لوٹا دیا جو عام ہے، اور سب کو اس کے مقام کی طرف چھوڑ دیا۔ اور یہ اللہ کے ساتھ ادب رکھنے والے، عالموں کی حالت ہے جو ہمیشہ اس کے ساتھ حاضر رہتے ہیں۔\n\nپس ادیب اس دنیا میں عمل کے ذریعے خلاق ہے، \"کُن\" سے نہیں، بلکہ \"بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ\" (اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے) سے، تاکہ وہ اپنے عمل میں شیطان کی شرکت سے محفوظ رہے، کیونکہ اللہ نے اسے اموال اور اولاد میں شرکت کا حکم دیا ہے۔ پس وہ اس الٰہی حکم کی تعمیل کرنے والا اور اس پر حریص ہے۔ اور ہمیں اس شرکت میں اس سے بچنے کا حکم دیا گیا ہے۔ چنانچہ ہم نے وہ چیز طلب کی جس سے ہم اس سے بچ سکیں، کیونکہ وہ ہم سے غیب ہے اور ہم اسے نہیں دیکھتے۔ پس اللہ نے ہمیں اپنا نام عطا کیا۔ جب ہم نے اپنے اعمال پر شروع کرتے وقت اللہ کا نام لیا، تو ہم اس کے ساتھ یکتا ہو گئے اور شیطان کی شرکت سے محفوظ ہو گئے، کیونکہ الٰہی نام ہی ہے جو اس سے براہ راست مقابلہ کرتا ہے اور ہمارے اور اس کے درمیان حائل ہوتا ہے۔ اور بعض اہل کشف (أهل الكشف) اس مدافعت کا مشاہدہ کرتے ہیں جو شروع کرنے کی حالت میں بندے کی طرف سے الٰہی نام اور شیطان کے درمیان ہوتی ہے۔ اور جب بندہ اس صفت پر ہو گا، تو وہ اپنے رب کی طرف سے بینہ (واضح دلیل) پر ہو گا، اور کامیاب ہو گا اور اس شرکت سے نجات پائے گا، اور اس کے تمام اعمال اور احوال میں حفاظت اور عصمت میں اس کے لیے بقا (البقاء) ہو گی۔\n\nاور یہ مقام ایسے علوم پر مشتمل ہے جن میں سے ایک علم دلیل اور آیت کے درمیان فرق کا ہے، اور یہ کہ صاحب آیت حکمت کی نسبت اور اسم حکیم (الحكيم) کے ساتھ صاحب دلیل سے زیادہ اولیٰ ہے۔ کیونکہ آیت شبہ کو قبول نہیں کرتی اور صرف اہل کشف (الکشف) اور ہستی (الوجود) کے لیے ہوتی ہے، جبکہ دلیل کا معاملہ ایسا نہیں ہے۔ اور اس میں دوام اختراع (الاختراع الدائم) کا علم ہے، اور یہ مثالوں میں صرف اس حد تک ہوتا ہے جس سے وہ ایک دوسرے سے ممتاز ہوتی ہیں۔ وہ مقدار ہی ان میں اختراع کا حکم ہے۔ اور جس میں اشتراک واقع ہو، وہ مخترع (ایجاد کردہ) نہیں ہے۔ پس سمجھو۔ اور اس میں خواص کا علم ہے۔ اور اس میں سبب کا علم ہے جس کی وجہ سے عالم اپنی جانی ہوئی چیز کے باوجود سر نہیں اٹھاتا، حالانکہ اسے یقین ہے کہ یہ حالت اس کے لیے نقصان دہ ہے۔ اور اس میں انسان کے کسی چیز کے بارے میں \"نَعَم\" (عین پر زبر کے ساتھ) اور \"نِعْم\" (عین پر زیر کے ساتھ) کہنے کے درمیان فرق کا علم ہے، اور وہ کہاں \"نعم\" کہتا ہے اور کہاں \"لا\" اور \"بلیٰ\" کہتا ہے۔ اور اس میں جنتوں کے ایک دوسرے سے امتیاز کا علم ہے، آیا یہ ایک ہی جنت میں حالات کا امتیاز ہے یا مساحات (رقبوں) کا امتیاز ہے۔ کیونکہ جنتوں کے لیے جو بھی نام ہمارے پاس آیا ہے، ہر جنت اس کی مستحق ہے اگر امتیاز مساحات سے ہو۔ پس ہر جنت، ہمیں شک نہیں کہ وہ جنۃ الماویٰ، جنۃ عدن، جنۃ خلد، جنۃ نعیم، اور جنۃ فردوس ہے، اور وہ ایک ہی عین (حقیقت) ہے۔ اور یہ احکام اس کے لیے ہیں، اگرچہ وہ مساحات سے ممتاز ہوں۔ پس ان اسماء کا حکم اس کے لیے ضروری ہے۔ اور اس میں خلود (ہمیشگی)، تأبید (ابدی ہونا)، تسرمد (لازوال ہونا)، اور عدم خروج (نہ نکلنا) کے درمیان فرق کا علم ہے۔ اور اس میں وعدہ اور وعید کے درمیان فرق کا علم ہے، کہ ان میں سے ایک میں مشیئت (اللہ کی مرضی) ہوتی ہے اور دوسرے میں نہیں۔ اور وعید نے وعدے کے مقابلے میں مشیئت کو کیوں قبول کیا، حالانکہ دونوں الٰہی خبریں ہیں، اور اس میں حکمت کا وجود کہاں ہے۔ اور اس میں آسمان کے علم کا علم ہے، آیا وہ کرہ (گول) کی طرح ہے یا خیمے کی طرح، یا وہ خیمے میں کرہ ہے یا کرہ میں خیمہ، چنانچہ زمین اس کے گھومنے سے گھومتی ہے۔ اور کیا آسمان ساکن ہے یا متحرک؟ کیونکہ شہود (الشهود) ان تمام چیزوں کو عطا کرتا ہے جن کا ہم نے ذکر کیا، اور باقی صرف اس چیز کا علم ہے کہ امر بذات خود کیا ہے، بغیر کسی شاہد کے مشاہدے پر غور کیے، آیا وہ ویسا ہی ہے جیسا ہر شاہد کا مشاہدہ تقاضا کرتا ہے یا نہیں؟ اور اس میں زوجین (جوڑوں) کے وجود کا علم ہے، اور ان میں سے ہر ایک اپنے ساتھی پر کس چیز سے کرم کرتا ہے؟ آیا وہ اس چیز سے ہے جس کی ان میں سے ہر ایک کو ضرورت ہے، یا کبھی وہ اس چیز سے بھی ہو سکتا ہے جس کی ضرورت نہ ہو، چنانچہ وہ عنین (نامرد) اور اس کے اہل کے درمیان فرق نہیں کرتا۔ اور اس میں اس شخص کے حکم کا علم ہے جو الوہیت کا دعویٰ کرتا ہے، آیا اس کے لیے کوئی خلقت ہے یا نہیں؟ کیونکہ الوہیت کا دعویٰ کرنے والے کے لیے اس کے دعوے کی حالت میں قطعاً کوئی خلقت نہیں ہوتی۔ پس جب وہ دعویٰ چھوڑ دیتا ہے، تو اس کا حکم باقی موجودات کا حکم ہوتا ہے جن کے لیے یہ دعویٰ نہیں ہے۔ اور اس میں اس شخص کے حکم کا علم ہے جس نے کسی کو معبود بنا لیا، بغیر اس کے کہ وہ خود دعویٰ کرے، بلکہ وہ اپنی ذات میں ایک بندہ ہے جو اس چیز پر راضی نہیں جو اس کی طرف منسوب کی گئی ہے، اور وہ اس چیز کو دور کرنے سے عاجز ہے جس کا اس پر دعویٰ کیا گیا ہے۔ اور یہ کہ وہ مظلوم ہے کیونکہ اس دعویٰ کرنے والے نے اس سے وہ چیز چھین لی جس کا وہ مستحق تھا، یعنی اس کا بندہ ہونا۔ پس اس نے اس پر ظلم کیا، چنانچہ اللہ اس کی مدد کرتا ہے، نہ کہ اپنے نفس کے لیے۔ پس شریک بنانا بندوں کے مظالم میں سے ہے۔ اور اس میں حکمت کیا ہے، اس کا علم ہے۔ اور اس میں اس شخص کو جو نبی مشرع (شریعت لانے والا نبی) نہیں ہے، اللہ تعالیٰ کے علمی رتبے میں انبیاء کے ساتھ شامل کرنے کا علم ہے۔ اور اس میں وصایا (نصیحتوں) اور الٰہی نبوی آداب کا علم ہے، جو وحی کیے گئے اور جن کا الہام کیا گیا۔ اور اس میں اولیٰ (بہتر) کو اختیار کرنے اور اس کی طرف سبقت کرنے کا علم ہے۔ اور اس میں اس چیز کا علم ہے جو حادث قدرت کے تحت آتی ہے اور جو نہیں آتی۔ اور اس میں اس چیز کا علم ہے جو ضروری ہے۔ اور اس میں صوت (آواز)، حرف، کلام، اور انعام (چوپائے) کے درمیان فرق کا علم ہے۔ اور اس میں ظاہری اور پوشیدہ، اور عام اور مخصوص نعمتوں کا علم ہے۔ اور اس میں ناظر (دیکھنے والے) کے استناد کی نجات کا علم ہے، اگرچہ وہ شبہ ہو۔ اور اس میں اس کا علم ہے کہ عالم میں سے کس پر مذمتیں عائد ہونی چاہئیں۔ اور اس میں اس شخص کے درمیان فرق کا علم ہے جو کشف (الکشف) کے ذریعے اللہ کی طرف لوٹا، اور جو بغیر کشف کے اس کی طرف لوٹا۔ اور اس میں متقدم (آگے بڑھنے والا) اور عاقب (پیچھے آنے والا) کا علم ہے، اور وہ ایک ہی ہے۔ اور اس میں اس چیز کا علم ہے جس کی جہالت پر توجہ نہیں دینی چاہیے۔ اور اس میں اس چیز کا علم ہے جس کی جہالت ممکن نہیں ہے۔ اور اس میں اس وقت کا علم ہے جس میں خوبصورت تعریف متعین ہوتی ہے، اور کس چیز پر متعین ہوتی ہے، حالانکہ تمام احوال اور زمانے اسے طلب کرتے ہیں۔ اور اس میں اس چیز کا علم ہے جس سے تعریف میں اکتفا ہو جاتا ہے، چنانچہ مزید قبول نہیں ہوتی۔ اور اس میں کثیر (زیادہ) کا حکم واحد (ایک) کے نزدیک واحد کا حکم ہے، اور کثیر کا کثیر پر استناد، اور کثیر کا واحد پر استناد کا علم ہے۔ اور اس میں تناسل (نسل بڑھانے) کے لیے اور غیر تناسل کے لیے نکاح کا علم ہے، اور ان دونوں میں سے اعلیٰ کیا ہے۔ اور اس میں اس چیز کا علم ہے جس میں حق اور باطل شریک ہوتے ہیں، اور یہ صرف خیال (الخیال) میں ہوتا ہے۔ اور اس میں اس چیز کا علم ہے جو علم ہے اور علم نہیں ہے۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و پنجاه و سوم: در معرفت منزل سه سرّ طلسمی حکمی که به معرفت منزل سبب و ادای حق آن اشاره دارد، و این منزل از حضرت محمدیه (الحضرة المحمدية) است.\n\nبگو به امام من، اگر با من اُنس می‌گیری، *** همانا اُنس من با پروردگارم است، نه با امثال و اشباه من.\nاُنس من با پروردگارم است، نه با پدر و مادر، *** و نه با خانواده؛ زیرا وجود مِثل، امثال من است.\nاز خودم گریختم و خلقم از من وحشت گرفت، *** پس چگونه با گذشته و حال اُنس گیرم؟\nو چگونه کسی با من اُنس گیرد که با من مناسبتی ندارد، *** و هیچ چیز از احوال من با او سازگار نیست؟\nو مِثل، ضد است؛ پس چگونه اُنس ممکن است ای آرامش من؟ *** و عقل آن را منع می‌کند، پس حال همان حال است.\nوقتی آن [حق] را که هیچ چیز جز من شبیه او نیست، نشناختم، *** از روی جهل او را به خاطرم آوردم.\nچرا می‌گویم که حق (الحق) مرا می‌طلبد، *** در حالی که او را نمی‌شناسم؟ مرا با او چه کار؟\nاُنس ما را می‌طلبد که به واسطه ما قیام کند، *** و پایین‌تر از پایین با بالا اُنس نمی‌گیرد.\nدر او حیران مانده‌ام و وحشت من ملازم من است، *** و آن را جز با آرزوهایم دور نمی‌کنم.\nهیچ حکیمی اُنس را نچشید، تا زمانی که مِثلی *** از علوم یا اعمال من برای چشم او آشکار نشد.\n\n### [اینکه خداوند سه چیز را بر نفس ناطقه در این نشأت دنیوی مسلط کرده است]\n\nبدان، خداوند تو را با روحی از جانب خود تأیید کند، که چون خداوند نفس ناطقه (النفس الناطقة) را که مدبر این هیکل موسوم به انسان است، آفرید، در این مزاج خاصِ نشأت دنیوی، سه چیز را بر آن مسلط ساخت که آن‌ها را از لوازم نشأت آن قرار داد: نفس نباتیه (النفس النباتية)، نفس شهوانیه (النفس الشهوانية) و نفس غضبیه (النفس الغضبية).\n\nاما نفس نباتیه و غضبیه در نشأت اهل سعادت در بهشت‌ها زائل می‌شوند و در آن نشأت جز نفس شهوانیه باقی نمی‌ماند. این نفس برای هر دو نشأت لازم است و لذت اهل نعیم به واسطه آن حاصل می‌شود.\n\nاما نفس نباتیه، همان است که غذا را می‌طلبد تا نقص حاصل شده را جبران کند و جسم را رشد دهد. پس پیوسته در حال تغذیه است؛ یا از خارج که به آن اکل (خوردن) گفته می‌شود، یا از جایی که خداوند بخواهد بدون تعیین. این نفس چهار وزیر دارد: جاذب (جذب کننده)، ماسک (نگهدارنده)، هاضم (هضم کننده) و دافع (دفع کننده).\n\nاما جاذب، وظیفه‌اش این است که غذا را از مکانی به مکان دیگر منتقل کند؛ از دهان به معده، از معده به کبد، و از کبد به قلب و سایر رگ‌ها و اجزای بدن. زیرا اوست که آنچه را بدن بدان نیاز دارد و قوای آن را تأمین می‌کند، بر اجزای بدن تقسیم می‌کند. دافع نیز به او کمک می‌کند، زیرا هرگاه ببیند غذا حق خود را از آن مکان گرفته و دیگر کاری در آنجا ندارد، آن را از جای خود دفع می‌کند تا مزاحم دیگری که وارد می‌شود، نشود. پس دافع، جاذب را یاری می‌کند.\n\nاما ماسک، آن است که غذا را در هر مکان نگه می‌دارد تا تدبیر حق خود را در آن بگیرد. وقتی دید که حقش ادا شد، دست از آن برمی‌دارد و دافع و جاذب آن را تحویل می‌گیرند.\n\nو اما هاضم، آن است که صورت غذا را تغییر می‌دهد و صورت دیگری بر آن می‌پوشاند تا بر خلاف صورتی باشد که پیش از آن داشت. زیرا غذا در ابتدا صورتی نیکو و بویی خوش داشت، اما وقتی به دست هاضم رسید، شکل آن را تغییر داد و صورتی دگرگون با بویی متلاشی کننده نظام بر آن پوشاند. به همین دلیل، از اهتضام (شکستن و خرد کردن) هاضم نامیده شده است. اما حکمت در این اهتضام وجود دارد، زیرا اگر هضم نبود، مقصودی که تغذیه‌کننده از غذا قصد کرده بود، حاصل نمی‌شد. پس ظاهر امر فساد است و باطن آن صلاح.\n\nاین هاضم پیوسته آن را از صورتی به صورتی دیگر منتقل می‌کند و ماسک بقای آن را نگه می‌دارد تا آنچه علمش و وظیفه‌اش اقتضا می‌کند، در آن تدبیر شود. وقتی حق خود را در آن موطن استیفا کردند، آن را رها می‌کنند و جاذب و دافع آن را می‌گیرند. وقتی آن را پایین آورده و به مکان دیگر منتقل کردند، دوباره آن را به ماسک و هاضم می‌سپارند و آن‌ها همان کاری را که در مکان قبلی انجام دادند، در آنجا نیز انجام می‌دهند و صورت‌های مختلفی در آن می‌گشایند. سپس جاذب و دافع آن را می‌گیرند و با آن صورت‌ها از مسیرهای معینی عبور می‌کنند که تا زمانی که خداوند بقای این نشأت طبیعی را بخواهد، از آن‌ها تجاوز نمی‌کنند. اگر این وزرا نبودند، نفس نباتیه به مطلوب خود دست نمی‌یافت.\n\nو چون خداوند هلاکت این نشأت طبیعی را اراده کند، نفس نباتیه از شهوت کمک می‌طلبد تا نفس مدبر برای جلب آنچه شهوت می‌خواهد، برانگیخته شود، اما شهوت این کار را نمی‌کند. خداوند نفس را با استیلای سلطان حرارت بر محل آن ضعیف می‌کند، پس ضعیف می‌شود، همان‌گونه که چراغ در نور خورشید ضعیف می‌شود و دیگر حکمی ندارد. نفس نباتیه با حقیقت خود باقی می‌ماند و به وزرای خود می‌گوید: چاره‌ای نیست جز اینکه چیزی برای تغذیه داشته باشم. پس از اخلاط بدن و فضول باقی‌مانده در آن تغذیه می‌کند، در حالی که وزرای آن نیز مانند خودش ضعیف شده‌اند. نشأت پیوسته در نقص فزاینده است و دافع قوی می‌شود و جاذب ضعیف، و همچنین ماسک، تا زمانی که انسان بمیرد. اگر این تدبیر با این ابزارها برای این نشأت نبود، گوشی نمی‌شنید و چشمی نمی‌دید و هیچ یک از این قوای حسی و معنوی حکمی نداشت.\n\nاما نفس شهوانیه (النفس الشهوانية)، سلطنت آن در این هیکل، طلب چیزی است که نزد او نیکو می‌نماید، و نمی‌داند که آیا آن چیز به او ضرر می‌رساند یا نفع. این حالت فقط در نشأت انسان وجود دارد. اما سایر حیوانات، غذا را جز با اراده و نه با شهوت، برای دفع درد گرسنگی و نیاز، مصرف نمی‌کنند. پس جز آنچه برایشان منفعت دارد، قصد نمی‌کنند. حکم شهوت در حیوان در زیاده‌روی در غذا باقی می‌ماند و از همین راه خلل بر او وارد می‌شود. و بر انسان نیز خلل از زیاده‌روی در چیزی که اندک آن نافع است، و از مصرف چیزی که اصلاً نفعی ندارد و شهوت آن را می‌طلبد و مزاج از آن متضرر می‌شود، وارد می‌گردد. این تفاوت بین انسان و حیوان در مصرف غذاست.\n\nپس نفس شهوانیه برای نفس نباتیه همانند چیزی است که در این باره گفته شده است:\n\nاگر خردمندی دنیا را بیازماید، *** برای او از دشمنی در لباس دوست آشکار می‌شود.\n\nپس نفس شهوانیه با نفس نباتیه دوستی دارد، زیرا در غذا و مصرف آن به او کمک می‌کند، و دشمن است از آن جهت که غذاهایی را وارد می‌کند که به او ضرر می‌رساند و نفعی ندارد. بنابراین، کمک او به نفس نباتیه بالعرض است نه بالذات. پس او دشمن لازمی است که جدایی از او ممکن نیست و از شر او ایمنی وجود ندارد.\n\nو اما نفس غضبیه (النفس الغضبية) که سبعیه (درنده‌خو) است، آن است که طلب قهر می‌کند، زیرا برتری خود را بر سایر حیوانات به واسطه قوایی که به او داده شده و توانایی تصرفی که دارد، دیده است. و مشاهده کرده که عالم برای نشأت او و مدبرش مسخر شده است. و دیده که در هستی (الوجود) عوارضی اتفاقی یا به سبب‌هایی ظاهر می‌شوند که او را از رسیدن به مقاصدش باز می‌دارند. پس به دلیل عدم حصول غرض، خشمگین می‌شود.\n\nاگر سلطانی قوی و یاری‌دهنده از همتی فعال یا امری از خارج داشته باشد که بتواند خشم خود را بر مغضوب‌علیه اجرا کند، او را هلاک می‌کند و انتقام خود را از او آشکار می‌سازد. و در این انتقام و قهر، میزان ظلم و عدل را نمی‌شناسد، زیرا این کار وظیفه او نیست، بلکه وظیفه عقل و ناموس وقت است.\n\nبه همین دلیل، شاعری که گفت، خطا کرده است:\n\nظلم از خصلت‌های نفوس است، پس اگر *** فردی با عفت بیابی، به علتی ظلم نمی‌کند.\n\nاگر به جای ظلم، قهر می‌گفت، سخن صحیحی گفته بود، زیرا ظلم را جز شرعی (قانون الهی) نمی‌آورد و از آن شناخته می‌شود. پس برای نفس جز قهر (حمیت جاهلی) نیست. اگر با حق مصادف شود، حمیت دینی است. به همین دلیل، خشم برای خدا و در راه خدا ستوده می‌شود و خشم برای غیر خدا و در غیر راه خدا نکوهیده می‌شود. این از تدبیر حکیم حق (الحق) است که امور را در مراتب خود مرتب ساخت و به هر چیز خلقتش را داد تا برای صاحبان خرد (أولي الألباب) و سایر اهل آیات عالم، نشانه‌ای باشد، زیرا آن‌ها در دریافت این امر اختلاف دارند، همان‌گونه که خداوند تعداد آن‌ها را در کتاب عزیز خود ذکر کرده است: **لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ** (که باطل از پیش رو و از پشت سر به آن راه نیابد؛ فرو فرستاده‌ای از جانب حکیم ستوده).\n\nو خداوند همه این آیات را در کتاب هستی (الوجود) جمع کرده است که در آن جز بیان و رحمت نیست و بس. پس هر آنچه در عالم از جانب حق (الحق) یا از تعامل برخی با برخی دیگر ظاهر شود و با رحمت منافات داشته باشد، امری عرضی است که بیان در کتاب از آن خبر داده است، زیرا آن عارض در نفس این کتاب نیست. پس کتاب از حیث ذات خود، تماماً رحمت و بیان است. و آنچه را خداوند عذاب قرار داده است، خداوند کریم‌تر از آن است که خلق خود را به عذابی دچار کند که پایان آن به اجلی که بیان کتاب آن را در بر گرفته و تعیین کرده است، منتهی نشود. سپس حکم به رحمت باز می‌گردد. این امری است که چاره‌ای از آن نیست و خداوند **غَفُورٌ رَحِيمٌ** (آمرزنده مهربان) است.\n\n### [آگاهی ابن عربی از حکم غریب الهی که به عالم انسانی مربوط می‌شود]\n\nسپس بدان که خداوند مرا بر حکم غریبی آگاه ساخت که به عالم انسانی مربوط می‌شود و نمی‌دانم آیا به غیر انسان از عالم نیز تعلق دارد یا خیر؛ زیرا خداوند مرا بر آن آگاه نساخته است و شایسته نیست که درباره خداوند چیزی بگویم که نمی‌دانم. خداوند من و شما را از این کار حفظ کند.\n\nاین حکم در عالم انسانی در پایان هر سه هزار سال از سال‌های دنیا ظاهر می‌شود، و آن نزد خداوند یک روز است. نمی‌دانم این روز به کدام اسم الهی باز می‌گردد، زیرا جز این ندانستم که حق تعالی (الحق تعالی) آن را برای من به سه ثلث تقسیم کرد که هر ثلثی هزار سال است، و هزار سال یک روز از ایام رب است. این چیزی است که پروردگارم مرا از آن خبر داد.\n\nحکم این مدت که سه هزار سال است، در انسان حکم آغاز و بازگشت، و حیات و موت است، هرگونه که خداوند بخواهد و هر جا که خداوند بخواهد.\n\nجز اینکه خداوند وقتی این امر را برای من در دفترم به صورت کلماتی رقم زد که آن‌ها را به شهود (الشهود) دریافتم، کلمه‌ای را با نقره و کلمه‌ای را با طلا به این صورت رقم زد. پس دانستم که آن‌ها احوال و احکامی هستند که در انسان در بهشت با گذشت این مدت معین ظاهر می‌شوند. و هیچ خبر الهی دیگری که بر من وارد شده باشد، به اندازه این خبر، اثر جزع و ترس آزاردهنده بر من نگذاشت. و قلبم آرام نگرفت مگر به این دلیل که کلمات از طلا و نقره بودند؛ کلمه طلایی در کنار کلمه نقره‌ای.\n\nو هنگامی که این القای الهی و تعریف ربانی به پایان رسید و دردی که از این تجلی (التجلی) در این صورت می‌یافتم از من برطرف شد و از من زائل گشت، شعری را به نظم الهام (نظم إلهام) سرودم، نه نظم اندیشه، که آن را ذکر می‌کنم:\n\nما را محبوبی منزه است که نامش نمی‌برم، *** و او محبوبی است که خلایق در او حیرانند.\nاگر بگویم «این»، حد او را در بر می‌گیرد، *** و اگر بگویم «او»، سخنی است که نمی‌دانم.\nچگونه راهی به سوی غیب است، در حالی که چشمان ما *** در هر لحظه او را از تجلی‌اش می‌بیند؟\nاگر بگویم «نزد من است»، ظرف (مکان) او را می‌طلبد، *** و ظرف حق است، اما او را در بر نمی‌گیرد.\nهیچ هستی (وجود) را ندیدم که آن را نشناسم، *** مگر آنکه من معنایی از معانی او هستم.\nدر او حیران مانده‌ام و کائنات در من حیران است، و چه بسیار *** گوش‌هایم سخنانی درباره او شنیده است.\nاین همان است که جلال حق (الحق) او را بیمار کرد، *** آیا برای او عوضی هست که او را شفا دهد؟\nاو شفاست، او درد است، پس من کجا هستم؟ *** عین (حقیقت) یکی است و همه ما در او هستیم.\n\nضمیر «او را بیمار کرد» به کائنات باز می‌گردد.\n\n### [اینکه ما از جانب خداوند الهام داریم نه وحی]\n\nو بدان که ما از جانب خداوند الهام (الإلهام) داریم نه وحی (الوحي)، زیرا راه وحی با وفات رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) قطع شده است. وحی پیش از او وجود داشت و خبر الهی نیامده است که پس از او وحی باشد، چنانکه فرمود: **وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ** (و به راستی به تو و به کسانی که پیش از تو بودند وحی شد) و وحی پس از او را ذکر نکرد. اگرچه این امر الزامی نیست، اما خبر نبوی صادق درباره عیسی علیه السلام آمده است که او از کسانی بود که پیش از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به او وحی شده بود، و اینکه او علیه السلام جز به روش ما (یعنی به سنت ما) بر ما امامت نمی‌کند. پس او هنگام نزول، کشف (الکشف) و الهام خواهد داشت، همانند این امت.\n\nو نباید تصور شود که الهام خبر الهی نیست؛ چنین نیست، بلکه الهام خبر الهی و اخباری از جانب خداوند به بنده است که به دست فرشته‌ای که از این مُلهَم (الهام گیرنده) پنهان است، می‌رسد. و گاهی نیز از وجه خاص الهام می‌شود. پس رسول و نبی، فرشته را مشاهده می‌کند و با چشم می‌بیند، هنگامی که به او وحی می‌شود. اما غیر رسول اثر آن را حس می‌کند و با چشم نمی‌بیند. پس خداوند به واسطه آن فرشته، آنچه را بخواهد به او الهام می‌کند، یا از وجه خاص و با برداشته شدن واسطه‌ها به او عطا می‌کند، که این شریف‌ترین و والاترین القا است. و این همان وجهی است که رسول و ولی نیز در آن مشترک هستند. پس «أصابع الرحمن» (انگشتان رحمان) برای وجه خاص است و «لَمَّة المَلَک» (تماس فرشته) برای وجه مشترک. و بیشتر الهام، الهی است و واسطه‌ای در آن نیست.\n\nپس هر کس آن را بشناسد، می‌داند چگونه آن را دریافت کند و محل آن نفس است. خداوند متعال می‌فرماید: **فَأَلْهَمَهَا** (پس به او الهام کرد). پس فاعل، هویت اوست و اوست که الهام‌کننده است نه دیگری. **فُجُورَهَا** (فجور و بدکاری‌اش را) تا آن را بداند، نه اینکه به آن عمل کند، و **وَتَقْوَاهَا** (و پرهیزکاری‌اش را) تا آن را بداند و به آن عمل کند.\n\nپس این الهام، الهامِ آگاهی دادن است، نه آن‌گونه که جاهلان گمان می‌کنند. به همین دلیل فرمود: **وَقَدْ خَابَ مَنْ دَسَّاهَا** (و هر که آن را فرو پوشاند، زیان کرد). دس (فرو پوشاندن) عبارت است از پیوند دادن پنهانی در ازدحام. پس حق این است که عمل به فجور را با عمل به تقوا یکی بداند، و در جایی که باید تفاوت قائل می‌شد، تفاوت نگذاشت و بین آن دو در علم و عمل جمع کرد، در حالی که امر چنین نیست. و سبب جهل او به این امر آن است که میزان شرع را از دست خود انداخته است. اگر میزان را از دست خود نمی‌انداخت، می‌دید که به تقوا امر شده و از فجور نهی شده است، در حالی که هر دو امر برای او بیان شده است. و چون خداوند فجور و تقوا را به نفس نسبت داد، دانستیم که وقوع هر دوی آن‌ها در هستی (الوجود) از این نفس مُلهَم (الهام شده) ناگزیر است.\n\nو فجور برای او چیزی بود که از تأویلی که کرده بود، منفجر شد. پس او به قصد هتک حرمت الهی بر مخالفت اقدام نکرد و این کار برای او ممکن نیست، و این از رحمت خداوند بر نفوس است. و چون فجر دو نوع است: فجر کاذب و فجر صادق، و فجر کاذب همان فجر مستطیل است، خداوند تقوای او را به او الهام کرد، یعنی در فجور خود از فجر مستطیل پرهیز کند، زیرا فجر مستطیل به دلیل تأخر فجر مستطیر (پراکنده شونده) که حکمش از او دور می‌شود، بر او به اولویت استیلا می‌یابد. پس در فجور خود، فجر مستطیل را به او الهام کرد. با این انفجار، آنچه مشکوک است از غیر مشکوک برای او آشکار می‌شود، و تقوای او، و آنچه با آن از حکمی که به او ضرر می‌رساند، پرهیز می‌کند. اگر خداوند او را به آنچه با آن پرهیز می‌کند (که همان معنایی است که به او الهام شده) مجهز نمی‌ساخت تا نفس به استفاده از آن آگاه شود و بین شبهه و دلیل تفاوت بگذارد، نمی‌توانست بین آن دو فرق بگذارد.\n\nزیرا خداوند سبحان، همان‌گونه که به فحشاء امر نکرده است، عمل به فحشاء را نیز به بنده الهام نکرده است، آن‌گونه که برخی گمان می‌کنند. و اگر عمل به فحشاء را به او الهام می‌کرد، حجتی برای خداوند بر بنده باقی نمی‌ماند. بلکه این آیه مانند قول اوست: **وَهَدَيْنَاهُ النَّجْدَيْنِ** (و او را به دو راه هدایت کردیم)، یعنی دو راه را برای او بیان کردیم. پس فرمود: **إِنَّا هَدَيْنَاهُ السَّبِيلَ** (ما راه را به او نشان دادیم)، یعنی برای او بیان کردیم، **إِمَّا شَاكِرًا** (یا شکرگزار) که در آن راه به مقتضای آن عمل می‌کند؛ اگر نهی بود، باز می‌ایستد و اگر امر بود، انجام می‌دهد؛ **وَإِمَّا كَفُورًا** (و یا ناسپاس) که بر خود پرده می‌پوشاند و خود را فریب می‌دهد. زیرا هیچ کس گمراه نشد مگر با علم. بیان حق (الحق) پس از خود بیانی ندارد و فایده بیان جز حصول علم نیست. سپس عالم به آن، آن را به خاطر غرضی که برایش پیش می‌آید، از خود پنهان می‌کند، پس حجت خداوند بر او تمام می‌شود.\n\nپس الهام، آگاهی‌بخشی الهی است. هر کس نفس خود را با تقوا تزکیه کند، از فجور آنچه را که باید پرهیز کند، پرهیز می‌کند و از آن، آنچه را که باید بگیرد، می‌گیرد. و هر کس نفس خود را در جایی که به او گفته شده وارد نشو، فرو پوشاند، زیان کرده است. پس هر کس راه علم و سعادت را می‌خواهد، میزان شرع را حتی برای یک نفس از دست خود نگذارد، زیرا خداوند میزان را در دست دارد و آن را رها نمی‌کند؛ قسط را پایین می‌آورد و بالا می‌برد، و این همان احوالی است که هستی (الوجود) بر آن است. اگر حق (الحق) میزان را از دست خود می‌گذاشت، عالم در یک لحظه نابود می‌شد. همچنین شایسته است که مکلف، بلکه انسان، تا زمانی که مکلف است، میزان مشروع را از دست خود نگذارد. زیرا اگر آن را حتی برای یک نفس از دست بگذارد، تمام شرع نابود می‌شود، همان‌گونه که اگر حق (الحق) میزان را از دست می‌گذاشت، عالم نابود می‌شد. زیرا هر حرکت و سکونی در مکلف و از مکلف، حکمی در میزان شرع دارد، پس رها کردن آن با بقای شرع صحیح نیست.\n\nپس این میزان برای او از جهت مکلف بودن است. اما میزان دیگری که شایسته نیست انسان آن را رها کند، نه از جهت مکلف بودن، بلکه آن میزان در دست اوست در دنیا و آخرت، آن میزان علم است که میزان شرع حکمی از احکام آن است. و آن مانند میزانی است که در دست حق (الحق) است. با آن، وزن حق را مشاهده می‌کند. نسبت آن به میزان حق، نسبت شخصی است که میزانی در دست دارد و شخص دیگری که آینه‌ای در دست دارد و در آینه خود صورت آن میزان، وزن‌کننده و وزن را می‌بیند. پس صورت امر را از شهود (الشهود) خود در هستی (الوجود) دانست، در حالی که این امر برای او از پشت سر غیب بود و اگر آینه نبود، آن را مشاهده نمی‌کرد. پس آنچه را در آینه خود دید، به خود نسبت داد، زیرا آینه او چیزی جز خودش نیست.\n\nپس غیبی که وزن می‌کند، و وزن و میزان، حضرت حق (الحق) است، و آینه، حضرت انسان است. وزن برای خداوند متعال است و شهود (الشهود) برای کسی است که نفسش آینه باشد، پس او سعادتمند صادق است. و خداوند این سر را تنها برای کسی آشکار ساخت که آن را کشف (الکشف) کرد، تا در آینه خود صورت خلق الهی و چگونگی صدور اشیاء و ظهور آن‌ها در هستی (الوجود) از نزد او را ببیند. و این همان قول ابوبکر صدیق رضی الله عنه است که فرمود: «چیزی را ندیدم مگر اینکه خداوند را پیش از آن دیدم.» پس می‌بیند که آن چیز از کجا صادر شده است و صاحب این کشف (الکشف) «خَلّاق» (آفریننده) می‌شود.\n\nو این همان چیزی است که حق (الحق) از او با این کشف اراده کرده است. بلکه او از طریق این کشف می‌داند که خلاق است و پیوسته چنین بوده است در حالی که خود نمی‌دانسته. پس این کشف به او علم به آنچه امر بر آن است، فایده رساند، نه اینکه با کشف، خلاق شده باشد. پس خداوند در آن هنگام به او امر کرد که حق هر چیز را از صورتش ادا کند، همان‌گونه که خداوند خلقت آن را در صورتش به او عطا کرد. پس هیچ مطالبه‌ای از مخلوقی بر او متوجه نمی‌شود، همان‌گونه که هیچ مطالبه‌ای از مخلوقی بر حق تعالی (الحق تعالی) متوجه نمی‌شود. این فایده‌ای است که آن کشف (الکشف) به او عطا کرد. پس هرگاه حق تعالی (الحق تعالی) او را در انجام فعلی از افعال مأمور به یا ممنوع شده قرار دهد، به حقی که آن فعل نزد او دارد، می‌نگرد و حق آن فعل را ادا می‌کند.\n\nاگر از اموری باشد که به انجام آن امر شده است، حق آن را در نشأت آن ادا می‌کند تا خلقتش راست و نشأت آن معتدل باشد. پس حقی از آن فعل بر فاعلش متوجه نمی‌شود. پس خلق از آن خداست و حق از آن بنده. حق (الحق) **أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ** (به هر چیز خلقتش را عطا کرد) و خلق حق هر چیز را ادا کرد. پس در این مسئله، حق در خلق داخل شد و خلق در حق داخل شد. و اگر از اموری باشد که از آن نهی شده است، حق آن بر این بنده آن است که آن را ایجاد نکند و اصلاً عینی برای آن ظاهر نسازد. اگر چنین نکند، حق آن را ادا نکرده و مطالبه آن بر او متوجه می‌شود. پس حق هر چیز را ادا نکرده و در حق (الحق)، مقام حق را در خلق به دست نیاورده است، پس محکوم شده است. امور و اوامر الهی را این‌گونه باید شناخت.\n\nو صورت تروک (ترک شده‌ها) در ساحت الهی، آن چیزی است که از یکی از ممکنات به خاطر وجود دیگری که وجودش ترجیح داده شده، ایجاد نشده است. پس از آن جهت که ایجاد نشده، ترک برای اوست. این مسئله‌ای است که تو را بر آن آگاه ساختیم، زیرا می‌دانیم که آن را در غیر این کتاب نخواهی یافت، چرا که تصورش دشوار است، اما برای کسی که خداوند به او عنایت کرده، دسترسی به آن آسان است. این مسئله ادب با خداوند و حفظ شریعت بر بندگان خدا را به ارمغان می‌آورد و از اسرار مخزون نزد خداوند است که جز بر عارفان بالله (العارفين بالله) آشکار نمی‌شود و نباید از هیچ یک از خلق خدا کتمان شود. زیرا اگر عالم به آن، آن را کتمان کند، به بندگان خدا خیانت کرده است، و «مَنْ غَشَّنَا فَلَيْسَ مِنَّا» (هر کس به ما خیانت کند، از ما نیست)، یعنی خیانت از سنت ما نیست. و هنگامی که بر این مسئله در کتاب رحمت الهی که چراگاه چشمان قلوب عارفان است، آگاه شدیم، خداوند متعال را شکر کردیم که پرده را برداشت و عطا را فراوان کرد. پس حمد و منت از آن اوست.\n\nو هنگامی که بنده به صورتی که ذکر کردیم، یعنی خلاق بودن، قیام کند، از تمامیت صورت الهی که بر آن است، بر او واجب می‌شود که صورت آنچه را ایجاد کرده، حفظ کند تا بقا (البقاء) برای آن حاصل شود. منظورم برای آن موجودی است که از او صادر شده است. پس آن را به کسی می‌سپارد که بقا را بر آن حفظ می‌کند، و او خداوند است: **فَاتَّخِذْهُ وَكِيلًا** (پس او را وکیل بگیر) در آن امر و امثال آن، به فرمان پروردگارش. پس در این کار به سوء ادب نسبت داده نمی‌شود. پس بنده در هر نفس مشغول خلق چیزی است که به خلق آن امر شده است، و حق (الحق) با وکالت این بنده برای او، به حفظ آنچه خلق کرده است، به اذن پروردگارش در خلق و توکیل، قیام می‌کند. و این علم دقیق الهی است، و آن بازگرداندن حفظ به خداوند به حکم وکالت از امر خدا، و ایجاد اشیاء از جانب بنده به امر خداست. پس این بنده پیوسته در هر حال تحت امر خداوند است. و هر کس پیوسته در تمام احوال خود تحت امر خداوند باشد، پیوسته نزد خداوند در شهود (الشهود) دائمی در دنیا و آخرت خواهد بود، زیرا نشأت او در اولی و آخرت به امر خداوند است.\n\nخداوند متعال در حق عیسی فرمود: **وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنْفُخُ فِيهَا فَتَكُونُ طَيْرًا بِإِذْنِي** (و هنگامی که از گِل، چیزی به شکل پرنده به اذن من می‌آفریدی، پس در آن می‌دمیدی و به اذن من پرنده‌ای می‌شد). همچنین مکلف به عمل امر شده است و جز به اذن خداوند عمل نمی‌کند. و موطن و قرارگاه این بنده تنها نزد پروردگارش است، از آن جهت که بهتر و پایدارتر است، و آن آخرتی است که **خَيْرٌ وَأَبْقَى** (بهتر و پایدارتر) است، و **وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَى** (و قطعاً آخرت برای تو بهتر از دنیاست)، و **وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَى** (و به زودی پروردگارت به تو عطا خواهد کرد تا خشنود شوی).\n\nو این عطای «کُن» (باش) در ظاهر عین است، همان‌گونه که در باطن برای اوست. زیرا انسان در باطن خود نیروی «کُن» را دارد، اما در ظاهر از آن جز انفعال (تأثیرپذیری) ندارد. و در آخرت، حکم «کُن» از او در ظاهر خواهد بود. و گاهی به برخی از مردم در دنیا عطا می‌شود، اما عمومیت ندارد. پس برخی از رجال الله (مردان خدا) آن را گرفتند و برخی دیگر در آن با خداوند ادب ورزیدند، زیرا می‌دانستند که اینجا موطن آن نیست. به ویژه که بزرگان را دیدند که در تقدم آن‌ها بر او و بر ما اختلافی نیست، و به او گفته شد: **إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ** (تو کسی را که دوست داری هدایت نمی‌کنی) و به او گفته شد: **أَفَأَنْتَ تُنْقِذُ مَنْ فِي النَّارِ** (آیا تو کسی را که در آتش است نجات می‌دهی؟) زیرا اگر اسلام آورد، از اهل آتش نیست. پس چون رجال الله دیدند که حکم آن در این دنیا عمومی نیست، حکم آنچه را که عمومیت ندارد، به حکم آنچه عمومیت دارد، برگرداندند و همه را به موطن خود واگذار کردند. و این حالت ادیبان دانای به خدا (العلماء بالله) است که پیوسته با او حاضرند.\n\nپس ادیب در این دنیا با عمل، خلاق است، نه با «کُن»، بلکه با «بسم الله الرحمن الرحیم»، تا در عمل خود از مشارکت شیطان در امان بماند، زیرا خداوند به شیطان امر کرده است که در اموال و اولاد مشارکت کند. شیطان این امر الهی را امتثال می‌کند و بر آن حریص است، و ما مأموریم که در این مشارکت از او پرهیز کنیم. پس چیزی را طلب کردیم که با آن از او پرهیز کنیم، زیرا او از ما غایب است و او را نمی‌بینیم. پس خداوند نام خود را به ما عطا کرد. پس هنگامی که در شروع اعمالمان نام خدا را بردیم، با آن یگانه شدیم و از مشارکت شیطان در امان ماندیم، زیرا اسم الهی است که با او مقابله می‌کند و بین ما و او حائل می‌شود. و برخی از اهل کشف (الکشف) این مقابله‌ای را که بین اسم الهی از جانب بنده در حال شروع و شیطان رخ می‌دهد، مشاهده می‌کنند. و هرگاه بنده دارای این صفت باشد، بر بینه‌ای از پروردگارش است و رستگار می‌شود و از این مشارکت نجات می‌یابد و بقا (البقاء) در حفظ و عصمت در تمام اعمال و احوالش برای او خواهد بود.\n\nو این منزل حاوی علومی است، از جمله: علم تفاوت بین دلیل و آیه، و اینکه صاحب آیه به نسبت دادن حکمت و اسم حکیم به خود، سزاوارتر از صاحب دلیل است. زیرا آیه شبهه نمی‌پذیرد و جز برای اهل کشف (الکشف) و هستی (الوجود) نیست، در حالی که دلیل چنین نیست. و در آن علم اختراع دائم است، و این اختراع در امثال (مِثل‌ها) جز در آن مقداری که برخی از آن‌ها از برخی دیگر متمایز می‌شوند، وجود ندارد. آن مقدار، حکم اختراع در آن‌هاست، و آنچه در آن اشتراک واقع شده، مخترع نیست، پس بفهم. و در آن علم خواص است. و در آن علم سببی است که به خاطر آن، عالم به آنچه می‌داند، سر برنمی‌دارد، با وجود اینکه تحقق یافته است که آن وضعیت به او ضرر می‌رساند. و در آن علم تفاوت بین گفتن «نَعَم» (بله) با فتح عین و «نِعْمَ» (چه خوب) با کسر عین، و اینکه کجا باید آن را بگوید و کجا «لا» (نه) و «بَلی» (آری) بگوید، وجود دارد.\n\nو در آن علم تمایز بهشت‌ها از یکدیگر است؛ آیا این تمایز احوال در یک بهشت است یا تمایز مساحت‌ها؟ زیرا هر اسمی که برای بهشت‌ها به ما رسیده است، اگر تمایز به مساحت‌ها باشد، هر بهشتی مستحق آن است. پس در اینکه هر بهشتی، جنة المأوی، جنة عدن، جنة الخلد، جنة النعیم و جنة الفردوس است، شک نداریم، و این‌ها یک حقیقت (عین) هستند و این احکام برای آن‌هاست. و حتی اگر به مساحت‌ها متمایز شوند، حکم این اسامی برای آن‌ها ضروری است. و در آن علم تفاوت بین خلود (جاودانگی)، تأبید (ابدی شدن)، تسرمد (سرمدی شدن) و عدم خروج است. و در آن علم تفاوت بین وعد و وعید با مشیئت (خواست الهی) در یکی و نه در دیگری است، و اینکه چرا وعید مشیئت را پذیرفت اما وعد نپذیرفت، در حالی که هر دو اخبار الهی هستند، و حکمت در این امر کجاست. و در آن علم آسمان است که آیا شبیه کره است یا شبیه خیمه، یا آیا کره در خیمه است یا خیمه در کره، و آیا زمین به دلیل چرخش آن می‌چرخد، و آیا آسمان ساکن است یا متحرک؟ زیرا شهود (الشهود) تمام آنچه را ذکر کردیم، عطا می‌کند. و تنها علم به آنچه امر در نفس خود بر آن است، باقی می‌ماند، بدون توجه به شهود؛ آیا آن‌گونه است که شهود هر شاهد حکم می‌کند یا نه.\n\nو در آن علم وجود زوجین است و اینکه هر یک از زوجین با چه چیزی بر دیگری کرامت می‌بخشد؛ آیا با چیزی است که هر یک از آن‌ها به آن نیاز دارد، یا ممکن است با چیزی باشد که نیازی به آن نیست؟ پس بین عنین (ناتوان جنسی) و خانواده‌اش تفاوتی نمی‌گذارد. و در آن علم کسی است که ادعای الوهیت می‌کند؛ آیا او خلق دارد یا خیر؟ زیرا مدعی الوهیت در حال ادعای خود اصلاً خلقی ندارد. پس اگر از ادعا جدا شود، حکمش حکم سایر موجوداتی است که این ادعا را ندارند. و در آن علم حکم کسی است که بدون ادعای خود، معبودی قرار داده شده است، بلکه او در نفس خود بنده‌ای است که از آنچه به او نسبت داده شده، راضی نیست و از برطرف کردن آنچه در مورد او ادعا شده، عاجز است. و او مظلوم است، زیرا این مدعی، آنچه را که حق اوست (یعنی بنده بودن) از او سلب کرده و به او ظلم نموده است. پس خداوند برای او یاری می‌رساند، نه برای خودش. پس شریک گرفتن از مظالم بندگان است. و در آن علم این است که حکمت چیست. و در آن علم ملحق کردن کسی که نبیِ صاحب شریعت نیست، به انبیاء در رتبه علمی به خداوند متعال است. و در آن علم وصایا و آداب الهی نبوی است که به آن‌ها وحی شده و الهام گشته است.\n\nو در آن علم اخذ به اولی و شتاب به سوی آن است. و در آن علم آنچه تحت قدرت حادث (مخلوق) داخل می‌شود و آنچه داخل نمی‌شود، وجود دارد. و در آن علم آنچه ضروری است، هست. و در آن علم تفاوت بین صوت، حرف، کلام و انعام (چهارپایان) است. و در آن علم نعمت‌های آشکار و پنهان، عمومی و محدود است. و در آن علم نجات استناد ناظر است، حتی اگر شبهه باشد. و در آن علم کسی است که باید مذمت‌های عالم به او ملحق شود. و در آن علم تفاوت بین کسی است که از روی کشف (الکشف) به سوی خدا بازگشته و کسی که بدون کشف بازگشته است. و در آن علم متقدم و عاقب است که یکی است. و در آن علم آنچه شایسته است که به جهل به آن توجه نشود، وجود دارد. و در آن علم آنچه جهل به آن ممکن نیست، هست. و در آن علم زمانی است که ثنای نیکو در آن واجب می‌شود و بر چه چیزی واجب می‌شود، در حالی که تمام احوال و زمان‌ها آن را می‌طلبند. و در آن علم آنچه با آن از ثنا اکتفا می‌شود و دیگر افزونی نمی‌پذیرد، وجود دارد. و در آن علم حکم کثیر، حکم واحد است نزد واحد، و استناد کثیر به کثیر، و استناد کثیر به واحد است. و در آن علم ازدواج برای تناسل و برای غیر تناسل است و اینکه کدام یک از آن‌ها والاتر است. و در آن علم آنچه حق (الحق) و باطل در آن مشترک هستند، وجود دارد، و این اشتراک جز در خیال نیست. و در آن علم آنچه علم است و علم نیست، وجود دارد. و خداوند **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 6
}