{
  "id": 205,
  "title": {
    "ar": "الباب الخامس ومائتان في التخلي بالخاء المعجمة",
    "en": "Chapter Two Hundred and Five, Concerning Detachment (التخلي) with the dotted *khā* (خ).",
    "ur": "خاء معجمہ کے ساتھ تخلی (التخلي) کے بیان میں دو سو پانچواں باب",
    "fa": "باب دویست و پنجم در باب تخلی (تخلی) با خاء نقطه‌دار"
  },
  "content": {
    "ar": "## «الباب الخامس ومائتان في التخلي بالخاء المعجمة»\n\n\n> لو لا المراتب في المشروع ما ظهرت *** حقائق الحق والأعيان تشهده‏\n\n\n> كيف التخلي وما في الكون من أحد *** سواه وهو الذي في الكون نعبده‏\n\n\n> وذاك يمنعنا من أن نقيده *** فنحن نعدمه وقتا ونوجده‏\n\n\n> فكل ما في وجود الكون من عرض *** على اعتقاداتنا فالله موجدة\n\n\n> فأشهده إن كنت ذا عين ومعرفة *** في كل شي‏ء وإن الشي‏ء يفقده‏\n\n\n### [التخلي اختيار الخلوة والإعراض عن كل ما يشغل عن الحق‏]\n\n\nاعلم أن التخلي بالخاء المعجمة عند القوم اختيار الخلوة والإعراض عن كل ما يشغل عن الحق وعندنا التخلي عن الوجود المستفاد لأنه في الاعتقاد هكذا وقع وفي نفس الأمر ليس إلا وجود الحق والموصوف باستفادة الوجود هو على أصله ما انتقل من إمكانه فحكمه باق وعينه ثابتة والحق شاهد ومشهود فإنه تعالى لا يصح أن يقسم بما ليس هو لأن المقسوم به هو الذي ينبغي له العظمة فما أقسم بشي‏ء ليس هو وقد ذكرنا ذلك في باب النفس بفتح الفاء فمما أقسم به وشاهِدٍ ومَشْهُودٍ فهو الشاهد والمشهود وهو ما استفاد الوجود بل هو الموجود فإن قلت فمن هذا الذي جهل هذا الأمر حتى تعلمه ولا يقبل الإعلام إلا موجود قلنا الجواب عليك من نفس اعتقادك فإنك المؤمن بأنه تعالى قال للشي‏ء كُنْ فما خاطب ولا أمر إلا من يسمع ولا وجود له عندك في حال الخطاب فقد أسمع من لا وجود له فهو الذي يعلمه ما ليس عنده فيعلمه وهو في حال عدمه يقبل التعليم كما سمع الخطاب عندك فقبل التكوين وما هو عندنا قبوله للتكوين كما هو عندك وإنما قبوله للتكوين أن يكون مظهرا للحق فهذا معنى قوله فَيَكُونُ لا أنه استفاد وجودا إنما استفاد حكم المظهرية فيقبل التعليم كما قبل السماع لا فرق ولقد نبهتك على أمر عظيم إن تنبهت له وعقلته فهو عين كل شي‏ء في الظهور ما هو عين الأشياء في ذواتها سبحانه وتعالى بل هو هو والأشياء أشياء فبعض المظاهر لما رأت حكمها في الظاهر تخيلت أن أعيانها اتصفت بالوجود المستفاد فلما علمنا أن ثم في الأعيان الممكنات من هو بهذه المثابة من الجهل بالأمر تعين علينا مع كوننا على حالنا في العدم مع ثبوتنا أن نعلم من لا يعلم من أمثالنا ما هو الأمر عليه ولا سيما وقد اتصفنا بأنا مظهر فتمكنا بهذه النسبة من الإعلام لمن لا يعلم فأفدناه ما لم يكن عنده فقبله فمما أعلمناه أنه ما استفاد وجودا بكونه مظهرا فتخلى عن هذا الاعتقاد لا عن الوجود المستفاد لأنه ليس ثم فلهذا عدلنا في التخلي أنه التخلي عن الوجود المستفاد وأما أهل السلوك الذين لا علم لهم بذلك ولا بمن هو الظاهر المشهود ولا بمن هو العالم فآثروا الخلوة لينفردوا بالحق لما حجتهم الكثرة المشهودة في الوجود عن الله جنحوا إلى التخلي وهذا مما يدلك على أنهم ما تركوا الأشياء\nمن حيث صورها فإنه لا يتمكن لهم ذلك فإنهم في خلوتهم لا بد أن يشاهدوا صور ما تخلوا فيه من جدار وباب وسقف وآلات قام بيت الخلوة منها ووطاء وغطاء ومأكول ومشروب فالصور لا يتمكن له التخلي عنها فلم يبق الهرب إلا مما يطرأ من هذه الصور من الكلام المفهوم لا من الأفعال لأن صاحب الخلوة لو كانت معه الحيوانات لم يزل في خلوة ولا يشغله عن مطلوبه إلا أن يخاف من ضررها كذلك أيضا لو كان في الجدار ميل لخاف من تهدمه وسقوطه عليه فإذا ما اختار التخلي إلا لأجل الكلام الذي تتكلم الناس به فلو فهم ما يتكلم الناس به على الوجه الذي وضعه الحق فيهم لزاد علما بما لم يكن عنده ولو صلى صلاة واحدة أعني ركعة واحدة لما طلب التخلي فإنه إذا سمع قول العبد سمع الله لمن حمده وإن ذلك القول لله لسرت الحقيقة في جميع ما يسمع فكلام الناس كله يفيد العارفين علما بالله ولهذا من كرامات الصالحين أن يسمعهم الله نطق الأشياء فلو لم يفدهم ذلك علما لم يكن ذلك إكراما من الله بهم فمن رزق الفهم عن الله استوت عنده الخلوة والجلوة بل ربما تكون الجلوة أتم في حقه وأعظم فائدة فإنه في كل لحظة يزيد علوما بالله لم تكن عنده‏\n\n\n( «بسم الله الرحمن الرحيم»)\n\n",
    "en": "Chapter Two Hundred and Five: Concerning *Takhalli* (Evacuation) with the Dotted *Khā'*\n\nIf not for the Levels (المراتب) in the Divinely Legislated Path,\nThe Realities of the Real (حقائق الحق) would not have appeared, even though the Fixed Entities (الأعيان) witness Him.\n\nHow can there be Evacuation (التخلي) when there is no one in the cosmos\nExcept Him, and He is the One Whom we worship in the cosmos?\n\nAnd that prevents us from restricting Him,\nSo we negate Him at one time and affirm Him at another.\n\nFor everything that exists in the existence of the cosmos, of accidental qualities (عرض),\nBased on our beliefs, Allah is the One Who brings it into existence.\n\nSo witness Him if you possess insight (عين) and Gnosis (معرفة),\nIn everything, even if the thing itself lacks Him.\n\n[Takhalli (Evacuation) is the choice of seclusion (Khilwa) and turning away from everything that distracts from the Real (الحق)]\n\nKnow that *Takhalli* (التخلي) with the dotted *Khā'* among the People [Sufis] is the choice of seclusion (*Khilwa*) and turning away from everything that distracts one from the Real (الحق). But for us, *Takhalli* is the evacuation from the acquired existence (الوجود المستفاد), because this is how it appears in belief (الاعتقاد). Yet, in reality (في نفس الأمر), there is nothing but the Existence of the Real (وجود الحق). That which is described as having acquired existence remains upon its origin; it has not departed from its possibility (إمكانه). Thus, its ruling remains, and its essence (عينه) is fixed.\n\nAnd the Real (الحق) is the Witness (شاهد) and the Witnessed (مشهود), for it is not valid for Him, the Exalted, to swear by that which is not Him, because that by which the oath is taken is that which deserves Majesty (العظمة), so He has not sworn by anything that is not Him. We have mentioned this in the Chapter on the Soul (*Nafs*). Among what He swore by is: <<وَشَاهِدٍ وَمَشْهُودٍ>> (By the witness and the witnessed). He is the Witness and the Witnessed. And He is not that which acquired existence; rather, He is the Existent (الموجود).\n\nIf you ask: \"Who is this person who is ignorant of this matter that you must teach him, given that only an existent being accepts instruction (الإعلام)?\" We reply: The answer comes from your own belief. For you are the one who believes that He, the Exalted, said to the thing, \"Be!\" (كُنْ). He only addressed and commanded that which hears, yet that thing had no existence according to you at the moment of the address. Thus, He made that which had no existence hear. He is the One Who teaches it what it does not possess, and it learns it. While in its state of non-existence (*'adam*), it accepts instruction, just as it heard the address according to you and accepted creation (التكوين).\n\nHowever, its acceptance of creation is not for it to acquire existence as you understand it. Rather, its acceptance of creation is for it to be a manifestation (مظهراً) of the Real (الحق). This is the meaning of His saying, <<فَيَكُونُ>> (and it is), not that it acquired existence. It only acquired the ruling of manifestation (حكم المظهرية). Thus, it accepts instruction just as it accepted hearing; there is no difference.\n\nI have alerted you to a tremendous matter: if you pay attention to it and comprehend it, He is the very essence (عين) of everything in manifestation (الظهور), but He is not the essence of things in their own realities (ذواتها). Glory be to Him, the Exalted! Rather, He is He, and things are things. When some of the manifestations (المظاهر) observed their ruling in the apparent realm, they imagined that their essences (أعيانها) were characterized by acquired existence (الوجود المستفاد).\n\nWhen we knew that among the possible entities (الأعيان الممكنات) there were those who reached this level of ignorance concerning the matter, it became incumbent upon us—despite our remaining in our state of non-existence (*'adam*) alongside our fixity (ثبوتنا)—to teach those among our likes who do not know what the matter truly is. Especially since we have been characterized as a manifestation (مظهر). By virtue of this relationship, we were enabled to instruct those who do not know, so we benefited them with what they did not possess, and they accepted it. Among what we instructed them was that they did not acquire existence merely by being a manifestation. Therefore, they must evacuate (تخلى) this belief, not the acquired existence, because the latter is not there. For this reason, we defined *Takhalli* as the evacuation from the acquired existence (الوجود المستفاد).\n\nAs for the People of the Path (أهل السلوك) who lack knowledge of this, and who lack knowledge of Who is the Apparent Witnessed (الظاهر المشهود) and Who is the Knower (العالم), they preferred seclusion (*Khilwa*) in order to be alone with the Real (الحق). Since the witnessed multiplicity (الكثرة المشهودة) in existence veiled them from Allah, they inclined toward *Takhalli* (evacuation).\n\nThis indicates to you that they did not abandon things in terms of their forms (صورها), for that is impossible for them. Indeed, in their seclusion, they must necessarily witness the forms of the things they evacuated: the wall, the door, the ceiling, the tools from which the house of seclusion is built, the bedding, the covering, the food, and the drink. Thus, it is impossible for them to evacuate the forms. The only remaining escape is from the understood speech (الكلام المفهوم) that arises from these forms, not from the actions (الأفعال).\n\nBecause if the person in seclusion had animals with him, he would still be in seclusion, and they would not distract him from his goal unless he feared harm from them. Likewise, if there were a tilt in the wall, he would fear its collapse and falling upon him. Therefore, he only chooses *Takhalli* because of the speech that people utter. If he understood what people speak, according to the manner in which the Real (الحق) placed it within them, his knowledge would increase with what he did not previously possess.\n\nIf he prayed a single prayer—meaning a single *rak'ah* (unit of prayer)—he would not seek *Takhalli*. For when the servant hears the saying, \"Allah hears the one who praises Him,\" and that saying belongs to Allah, the Reality (الحقيقة) would flow through everything he hears. Thus, all human speech benefits the Gnostics (*'Arifin*) with knowledge of Allah. This is why one of the miracles (*karāmāt*) of the righteous is that Allah makes them hear the speech of things. If that did not benefit them with knowledge, it would not be an honor (*ikrām*) bestowed upon them by Allah.\n\nTherefore, for the one who is granted understanding from Allah, seclusion (*Khilwa*) and public presence (*Jalwa*) are equal. Indeed, public presence may sometimes be more complete for him and of greater benefit, for in every moment he increases in knowledge of Allah that he did not previously possess.\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)",
    "ur": "باب نمبر دو سو پانچ: تخلی (خاء معجمہ کے ساتھ) کے بیان میں\n\nاگر شریعت میں مراتب (درجات) نہ ہوتے، تو\nحقائق الحق (حقيقة الحقائق) ظاہر نہ ہوتے، حالانکہ اعیان (اشیاء کی حقیقتیں) اس کا شہود (الشہود) کرتی ہیں۔\n\nتخلی کیسی؟ جبکہ کائنات میں اس (ذات حق) کے سوا کوئی نہیں،\nاور وہی ہے جس کی ہم کائنات میں عبادت کرتے ہیں۔\n\nاور یہی بات ہمیں اس (ذات حق) کو مقید کرنے سے روکتی ہے،\nپس ہم کبھی اسے معدوم کرتے ہیں اور کبھی اسے موجود کرتے ہیں۔\n\nپس کائنات کی ہستی (الوجود) میں جو کچھ بھی عرض (عارضی صفت) ہے،\nہمارے اعتقادات کی بنا پر، تو اللہ ہی اسے وجود دینے والا ہے۔\n\nپس اگر تم صاحبِ بصیرت اور معرفت (المعرفۃ) والے ہو تو\nہر شے میں اس کا شہود (الشہود) کرو، اگرچہ وہ شے اسے (ظاہری طور پر) کھو دیتی ہے۔\n\n[تخلی: خلوت اختیار کرنا اور ہر اس چیز سے اعراض کرنا جو ذات حق سے مشغول کرے]\n\nجان لو کہ اہل سلوک کے نزدیک خاء معجمہ کے ساتھ تخلی (التخلي) خلوت اختیار کرنا اور ہر اس چیز سے اعراض کرنا ہے جو ذات حق (الحق) سے مشغول کرے۔ اور ہمارے نزدیک تخلی، مستفاد ہستی (الوجود المستفاد) سے دستبردار ہونا ہے، کیونکہ یہ (مستفاد ہستی) اعتقاد میں اسی طرح واقع ہوئی ہے، جبکہ نفسِ امر میں ذات حق کی ہستی (الوجود) کے سوا کچھ نہیں۔ اور جو ہستی کے استفادہ سے موصوف ہے، وہ اپنی اصل پر قائم ہے، وہ اپنے امکان سے منتقل نہیں ہوا، لہٰذا اس کا حکم باقی ہے اور اس کا عین (حقیقت) ثابت ہے۔ اور ذات حق (الحق) ہی شاہد بھی ہے اور مشہود بھی۔\n\nکیونکہ اللہ تعالیٰ کے لیے یہ درست نہیں کہ وہ کسی ایسی چیز کی قسم کھائے جو وہ خود نہیں ہے، اس لیے کہ جس کی قسم کھائی جاتی ہے، عظمت اسی کے لیے مناسب ہے۔ پس اس نے کسی ایسی چیز کی قسم نہیں کھائی جو وہ خود نہیں ہے۔ ہم اس کا ذکر بابِ نفس (نفس) میں کر چکے ہیں۔ پس جن چیزوں کی اس نے قسم کھائی ہے، ان میں سے ایک ہے: وَشَاهِدٍ وَمَشْهُودٍ (اور شاہد کی اور مشہود کی)۔ پس وہی (ذات حق) شاہد بھی ہے اور مشہود بھی، اور اس نے ہستی (الوجود) کا استفادہ نہیں کیا، بلکہ وہی موجود ہے۔\n\nاگر تم کہو کہ یہ کون ہے جو اس امر سے جاہل رہا یہاں تک کہ اسے تعلیم دی گئی، اور تعلیم کو تو صرف موجود ہی قبول کرتا ہے؟ ہم کہیں گے کہ جواب تمہارے اپنے اعتقاد سے تم پر لازم آتا ہے، کیونکہ تم اس بات پر ایمان رکھتے ہو کہ اللہ تعالیٰ نے کسی شے سے فرمایا: كُنْ (ہو جا)۔ اور اس نے خطاب یا حکم صرف اسی کو دیا جو سنتا ہے، حالانکہ خطاب کے وقت تمہارے نزدیک اس کا کوئی وجود نہیں تھا۔ پس اس نے اسے سنایا جس کا وجود نہیں تھا، لہٰذا وہی ہے جو اسے وہ چیز سکھاتا ہے جو اس کے پاس نہیں تھی، پس وہ اسے سکھاتا ہے، اور وہ اپنے عدم کی حالت میں تعلیم قبول کرتا ہے، جیسا کہ تمہارے نزدیک اس نے خطاب سنا اور تکوین (ہو جانے) کو قبول کیا۔\n\nاور ہمارے نزدیک اس کا تکوین کو قبول کرنا ویسا نہیں ہے جیسا تمہارے نزدیک ہے، بلکہ اس کا تکوین کو قبول کرنا یہ ہے کہ وہ ذات حق (الحق) کا مظہر بن جائے۔ پس یہی اس کے قول فَيَكُونُ (پس وہ ہو جاتا ہے) کا معنی ہے، نہ یہ کہ اس نے ہستی (الوجود) کا استفادہ کیا ہو۔ اس نے صرف مظہریت کا حکم استفادہ کیا، پس وہ تعلیم کو اسی طرح قبول کرتا ہے جس طرح اس نے سماع کو قبول کیا، کوئی فرق نہیں۔\n\nاور میں نے تمہیں ایک عظیم امر پر متنبہ کیا ہے، اگر تم اس پر متنبہ ہو جاؤ اور اسے سمجھ لو: وہ (ذات حق) ظہور میں ہر شے کا عین ہے، لیکن وہ اپنی ذاتوں میں اشیاء کا عین نہیں ہے، وہ پاک اور بلند ہے، بلکہ وہ وہی ہے اور اشیاء اشیاء ہیں۔ پس بعض مظاہر نے جب ظاہر میں اپنا حکم دیکھا تو یہ گمان کیا کہ ان کے اعیان (حقیقتیں) مستفاد ہستی (الوجود المستفاد) سے متصف ہو گئے ہیں۔ جب ہمیں معلوم ہوا کہ ممکنات کے اعیان میں ایسے لوگ موجود ہیں جو اس امر سے اس قدر جاہل ہیں، تو ہم پر لازم ہوا، باوجود اس کے کہ ہم اپنے ثبوت کے ساتھ عدم کی حالت پر ہیں، کہ ہم اپنے جیسے ان لوگوں کو تعلیم دیں جو نہیں جانتے کہ امر کی حقیقت کیا ہے۔ اور خاص طور پر جب ہم مظہر ہونے کی صفت سے متصف ہوئے، تو اس نسبت سے ہم ان لوگوں کو تعلیم دینے کے قابل ہوئے جو نہیں جانتے، پس ہم نے انہیں وہ فائدہ پہنچایا جو ان کے پاس نہیں تھا اور انہوں نے اسے قبول کیا۔ جن باتوں کی ہم نے انہیں تعلیم دی، ان میں سے ایک یہ ہے کہ مظہر ہونے کی وجہ سے اس نے ہستی (الوجود) کا استفادہ نہیں کیا، پس وہ اس اعتقاد سے تخلی (التخلي) کرے، نہ کہ مستفاد ہستی (الوجود المستفاد) سے، کیونکہ وہ تو وہاں ہے ہی نہیں۔ اسی لیے ہم نے تخلی (التخلي) کی تعریف میں تبدیلی کی کہ یہ مستفاد ہستی سے تخلی ہے۔\n\nاور جہاں تک اہل سلوک (اہل السلوک) کا تعلق ہے، جنہیں اس (حقیقت) کا علم نہیں ہے، نہ اس کا جو ظاہر اور مشہود ہے، اور نہ اس کا جو عالم ہے، تو انہوں نے خلوت کو ترجیح دی تاکہ ذات حق کے ساتھ منفرد ہو جائیں۔ چونکہ وجود میں مشہود کثرت نے انہیں اللہ سے حجاب میں رکھا، اس لیے وہ تخلی کی طرف مائل ہوئے۔ اور یہ بات تمہیں بتاتی ہے کہ انہوں نے اشیاء کو ان کی صورتوں کے لحاظ سے ترک نہیں کیا، کیونکہ ان کے لیے یہ ممکن ہی نہیں ہے۔ کیونکہ وہ اپنی خلوت میں لازماً ان چیزوں کی صورتوں کا مشاہدہ کریں گے جن سے انہوں نے تخلی کی ہے، جیسے دیوار، دروازہ، چھت، اور وہ آلات جن سے خلوت کا گھر بنا ہے، بستر، لحاف، کھانے کی چیزیں اور پینے کی چیزیں۔ پس صورتوں سے تخلی کرنا ان کے لیے ممکن نہیں ہے۔ لہٰذا فرار صرف ان چیزوں سے باقی رہا جو ان صورتوں سے عارض ہوتی ہیں، یعنی قابل فہم کلام سے، نہ کہ افعال سے۔\n\nکیونکہ خلوت اختیار کرنے والا اگر اس کے ساتھ حیوانات بھی ہوں تو وہ خلوت میں ہی رہتا ہے، اور وہ اسے اس کے مطلوب سے مشغول نہیں کرتے، سوائے اس کے کہ وہ ان کے نقصان سے ڈرے۔ اسی طرح اگر دیوار میں جھکاؤ ہو تو وہ اس کے گرنے اور اس پر آ پڑنے سے ڈرے گا۔ پس اس نے تخلی کا انتخاب صرف اس کلام کی وجہ سے کیا جو لوگ کرتے ہیں۔ اگر وہ اس کلام کو اس طریقے پر سمجھ لیتا جو ذات حق (الحق) نے ان میں رکھا ہے، تو اس کے علم میں وہ اضافہ ہوتا جو اس کے پاس نہیں تھا۔ اور اگر وہ ایک نماز، یعنی ایک رکعت بھی پڑھ لیتا، تو وہ تخلی کا طلبگار نہ ہوتا۔\n\nکیونکہ جب بندہ یہ قول سنتا ہے: سَمِعَ اللهُ لِمَنْ حَمِدَهُ (اللہ نے سن لیا جس نے اس کی حمد کی)، اور یہ قول اللہ کے لیے ہے، تو حقیقت ان تمام چیزوں میں سرایت کر جاتی ہے جو وہ سنتا ہے۔ پس لوگوں کا سارا کلام عارفین (العارفین) کو اللہ کے بارے میں علم دیتا ہے۔ اسی لیے صالحین کی کرامات میں سے یہ ہے کہ اللہ انہیں اشیاء کا نطق (بولنا) سناتا ہے۔ اگر یہ انہیں علم نہ دیتا تو یہ اللہ کی طرف سے ان کے لیے اکرام نہ ہوتا۔ پس جسے اللہ کی طرف سے فہم عطا ہوا، اس کے نزدیک خلوت (الخلوۃ) اور جلوہ (الجلوۃ) برابر ہو جاتے ہیں، بلکہ بسا اوقات جلوہ اس کے حق میں زیادہ کامل اور زیادہ فائدہ مند ہوتا ہے، کیونکہ وہ ہر لمحہ اللہ کے بارے میں ایسے علوم میں اضافہ کرتا ہے جو اس کے پاس نہیں تھے۔\n\nبِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْمِ (اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے)",
    "fa": "باب دویست و پنجم درباره تخلی (التخلي) با خاء نقطه‌دار\n\nاگر مراتب در طرح الهی نبود، حقائق الحق (حقيقة الحقائق) ظاهر نمی‌شدند، در حالی که اعیان (الأعيان) او را شهود می‌کنند.\nچگونه تخلی (التخلي) ممکن است، در حالی که در هستی (الکون) جز او احدی نیست، و اوست که ما در هستی (الکون) او را می‌پرستیم.\nو این امر ما را از اینکه او را مقید سازیم باز می‌دارد؛ پس ما گاهی او را معدوم می‌سازیم و گاهی موجودش می‌کنیم.\nپس هر آنچه در وجود هستی (الکون) از عَرَض (عارضه) است، بر اساس اعتقادات ما، خداوند ایجادکننده‌ی آن است.\nپس او را شهود کن، اگر صاحب چشم (بصیرت) و معرفت (المعرفة) هستی، در هر چیزی، اگرچه آن چیز او را فاقد باشد.\n\n[تخلی (التخلي): برگزیدن خلوت و روی گرداندن از هر آنچه که از حق (الحق) باز می‌دارد]\n\nبدان که تخلی (التخلي) با خاء نقطه‌دار نزد این طایفه (صوفیان) عبارت است از برگزیدن خلوت و روی گرداندن از هر آنچه که از حق (الحق) باز می‌دارد. و نزد ما، تخلی (التخلي) عبارت است از تخلی از وجود مستفاد (وجود عاریتی)، زیرا در اعتقاد چنین واقع شده است، در حالی که در نفس‌الامر جز وجود حق (الحق) نیست. و آنچه به استفادۀ وجود توصیف شده، بر اصل خود باقی است و از امکان (امکان ذاتی) خود منتقل نشده است؛ پس حکم آن باقی و عین (ذات) آن ثابت است. و حق (الحق) هم شاهد است و هم مشهود. زیرا برای او تعالی صحیح نیست که به چیزی که خودش نیست قسم یاد کند، چرا که آنچه به آن قسم خورده می‌شود، شایسته‌ی عظمت است؛ پس او به چیزی که خودش نیست قسم نخورده است. و ما این را در باب «النفس» (با فتح فاء) ذکر کردیم. از جمله چیزهایی که به آن قسم خورده است: **«و شاهد و مشهود»** (وَشَاهِدٍ وَمَشْهُودٍ). پس او (حق) شاهد و مشهود است، و او چیزی نیست که وجود را کسب کرده باشد، بلکه او خود موجود است.\n\nاگر بگویی: پس کیست که این امر را ندانسته تا به او تعلیم داده شود؟ و جز موجود، کسی تعلیم را نمی‌پذیرد. می‌گوییم: پاسخ بر تو از نفس اعتقاد خودت است. زیرا تو خود مؤمن هستی به اینکه او تعالی به شیء گفت: **«باش»** (كُنْ). و او جز کسی که می‌شنود، مخاطب قرار نداده و امر نکرده است، در حالی که نزد تو در هنگام خطاب، وجودی نداشته است. پس او به کسی که وجود ندارد، شنوا ساخت. پس اوست که به آنچه نزدش نیست، تعلیم می‌دهد و آن را می‌آموزد، و آن شیء در حال عدم خود، تعلیم را می‌پذیرد، همان‌گونه که نزد تو خطاب را شنید و تکوین (ایجاد شدن) را پذیرفت.\n\nو پذیرش تکوین نزد ما آن‌گونه نیست که نزد توست. بلکه پذیرش تکوین برای آن است که مظهر حق (الحق) باشد. پس این معنای قول اوست: **«پس می‌شود»** (فَيَكُونُ)، نه اینکه وجودی کسب کرده باشد، بلکه حکم مظهر بودن (مظهرية) را کسب کرده است. پس تعلیم را می‌پذیرد، همان‌گونه که شنیدن را پذیرفت، تفاوتی نیست. و اگر به این امر عظیم تنبه یابی و آن را تعقل کنی، تو را آگاه ساخته‌ام.\n\nپس او در ظهور، عین هر چیزی است، اما در ذوات (ذات) اشیاء، عین آنها نیست. منزه و متعالی است؛ بلکه او، اوست و اشیاء، اشیاء هستند. پس برخی از مظاهر، هنگامی که حکم خود را در ظاهر دیدند، خیال کردند که اعیان (ذوات ثابت) آن‌ها به وجود مستفاد (وجود عاریتی) متصف شده‌اند. پس هنگامی که دانستیم در اعیان ممکنات (الأعيان الممكنات) کسانی هستند که در این مرتبه از جهل به امر قرار دارند، بر ما واجب شد که با وجود اینکه ما نیز در حال عدم خود با ثبوت (ثبوت ذاتی) هستیم، به کسانی از امثال خودمان که نمی‌دانند، حقیقت امر را تعلیم دهیم. به ویژه اینکه ما به مظهر بودن متصف شده‌ایم، و با این نسبت توانستیم به کسی که نمی‌داند، آگاهی دهیم و آنچه را که نزدش نبود، به او افاده کردیم و او پذیرفت. از جمله آنچه به او تعلیم دادیم این است که او با مظهر بودن، وجودی کسب نکرده است. پس باید از این اعتقاد تخلی (التخلي) کند، نه از وجود مستفاد، زیرا وجود مستفادی در کار نیست. به همین دلیل، ما در تعریف تخلی (التخلي) به این سمت متمایل شدیم که تخلی (التخلي) عبارت است از تخلی از وجود مستفاد.\n\nاما اهل سلوک (أهل السلوك) که به این امر و به کسی که ظاهر مشهود است و به کسی که عالم است، علم ندارند، خلوت را برگزیدند تا با حق (الحق) منفرد شوند. چون کثرت مشهود در هستی (الوجود) آن‌ها را از خدا محجوب ساخت، به تخلی (التخلي) روی آوردند. و این امر تو را راهنمایی می‌کند که آن‌ها اشیاء را از حیث صورشان ترک نکرده‌اند، زیرا این کار برایشان ممکن نیست. زیرا آن‌ها در خلوت خود ناگزیرند که صور آنچه را که در آن تخلی کرده‌اند، مشاهده کنند: از دیوار و در و سقف و ابزارهایی که خانه‌ی خلوت از آن‌ها برپا شده است، و زیرانداز و روانداز و خوردنی و نوشیدنی. پس تخلی (التخلي) از صور برایشان ممکن نیست.\n\nپس گریز باقی نمی‌ماند مگر از آنچه که از این صور عارض می‌شود، یعنی کلام مفهوم، نه از افعال. زیرا اگر حیواناتی همراه صاحب خلوت باشند، او همچنان در خلوت است و چیزی او را از مطلوبش باز نمی‌دارد، مگر اینکه از ضرر آن‌ها بترسد. همچنین اگر در دیوار کجی باشد، از فروریختن و سقوط آن بر خود می‌ترسد. بنابراین، او تخلی (التخلي) را انتخاب نکرده است مگر به خاطر کلامی که مردم با آن سخن می‌گویند.\n\nپس اگر آنچه را که مردم با آن سخن می‌گویند، بر وجهی که حق (الحق) در آن‌ها قرار داده است، بفهمد، بر علم او افزوده می‌شود به آنچه نزدش نبوده است. و اگر یک نماز، یعنی یک رکعت، می‌خواند، هرگز طلب تخلی (التخلي) نمی‌کرد. زیرا هنگامی که قول بنده را می‌شنود که می‌گوید: «خداوند شنید کسی را که او را ستایش کرد»، و آن قول برای خداست، حقیقت در تمام آنچه می‌شنود، جاری می‌شود. پس تمام کلام مردم برای عارفان (العارفين) علم به خدا را به ارمغان می‌آورد. و به همین دلیل، از کرامات صالحان این است که خداوند نطق اشیاء را به آن‌ها می‌شنواند. پس اگر این امر برای آن‌ها علم‌آور نبود، اکرامی از جانب خدا به آن‌ها محسوب نمی‌شد. کسی که فهم از جانب خدا روزی‌اش شود، خلوت و جلوت (حضور در جمع) نزد او یکسان است، بلکه چه بسا جلوت در حق او کامل‌تر و فایده‌اش عظیم‌تر باشد، زیرا او در هر لحظه بر علومی درباره خدا می‌افزاید که نزدش نبوده است.\n\n(به نام خداوند بخشنده مهربان)"
  },
  "page_count": 2
}