{
  "id": 101,
  "title": {
    "ar": "الباب الأحد ومائة في مقام ترك الخوف",
    "en": "Chapter One Hundred and One, Concerning the Station (مقام) of Renouncing Fear",
    "ur": "باب ایک سو ایک: مقام ترک الخوف (ترک الخوف) کے بیان میں",
    "fa": "باب صد و یکم در مقام ترک خوف"
  },
  "content": {
    "ar": "## (الباب الأحد ومائة في مقام ترك الخوف)\n\n\n> لما تعلق علم الخوف بالعدم *** لم أخش منه فحزنا رتبة القدم‏\n\n\n> أنا الوجود فلا خوف يصاحبني *** لأن ضدي منسوب إلى العدم‏\n\n\n> إن الذي خفت منه لا وجود له *** فاترك مخافته لحما على وضم‏\n\n\n### [النور لا يحترق بالنور ولكن يندرج فيه‏]\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم واجعلني نورا\n\n\nفي دعائه وقال تعالى الله نُورُ السَّماواتِ والْأَرْضِ والسبحات أنوار والنور لا يحترق بالنور ولكن يندرج فيه أي يلتئم معه للمجانسة وهذا هو الالتحام والاتحاد وهنا سر عظيم وهو ما يزيد في نور المتجلي من نور المتجلي له إذا انضاف إليه واندرج فيه ولما وقف صَلَّى اللهُ عَليهِ وسَلَّم على مقام الخوف الذي ذكرناه أداه إلى أن طلب أن يكون نورا فكأنه يقول اجعلني أنت حتى أراك بك فلا تذهب عيني برؤيتك لكن اندرج فيك كما قال النابغة\n\n\n> بأنك شمس والملوك كواكب *** إذا طلعت لم يبد منهن كوكب‏\nوما ذهب لها عين وما ظهر لها عين فهي ترى ولا ترى لأنها خلف حجاب النور الأعظم الذي له الحكم في ظاهر الأمر\n\n\n### [أنوار الكواكب لها حكم في باطن الأمر]\n\n\nولأنوار الكواكب حكم في باطن الأمر مندرج في النور الأعظم يعلم ذلك أرباب علم التعاليم فهم أسعد الناس بهذا المقام وهو مقام جليل نبوي وما حجره الحق على المؤمنين إلا رحمة بهم لأن الغالب في العالم الجهل بحقائق الأمور والعلماء أفراد فرحمهم الله بما حجر عليهم من ذلك وأما العلماء بالله فلا حرج عليهم فيه فإنهم عالمون كيف ينسبون وكيف لا يعلمون والله يقول وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها وهو ما يعطيه من الآثار في العالم كما تعطي كل آلة للصانع بها ما عملت له والصنعة مضافة للصانع لا للآلة فاعلم ذلك وكن بحسب ما تعطيه قوتك والسلام‏\n\n\n### [صاحب مقام ترك الخوف هل يأمن مكر الله أم لا]\n\n\nواختلف أصحابنا في صاحب هذا المقام هل يأمن من المكر الإلهي أم لا أما مع البشرى فيأمن ولا بد وأعني إذا جاءت البشرى بالأمن من مكر الله ولا أقدر أبسط في هذا المقام شيئا أكثر مما ذكرناه في هذا الوقت لأسباب ولا أصرح بمذهبنا فيه إلا بقدر ما ذكرنا منه في البشرى فإنه أمر محقق تدل عليه العقول والشرع وذلك أن صاحب هذا المقام إن كانت عجلت له الجنة بوجه لا يمكن استبداله فالأمن حاصل ويصح له هذا المقام وإن لم تكن له هذه الحالة فالله أعلم‏\n\n",
    "en": "## Chapter One Hundred and One: Concerning the Station of Abandoning Fear (مقام ترك الخوف)\n\nWhen the knowledge of fear became attached to non-existence (العدم),\nI did not fear it, so we attained the rank of Eternity (القدم).\n\nI am Existence (الوجود), so no fear accompanies me,\nBecause my opposite is attributed to non-existence.\n\nIndeed, that which you feared has no existence (وجود);\nSo abandon the fear of it, like meat upon a chopping block.\n\n### Light is not consumed by light, but rather is integrated within it\n\nThe Prophet, peace and blessings be upon him, said in his supplication: \"And make me Light.\" And Allah, the Exalted, said: <<الله نُورُ السَّماواتِ والْأَرْضِ>> (Allah is the Light of the heavens and the earth). And the Veils of Glory (السبحات) are Lights. Light is not consumed by light, but rather is integrated within it (يندرج فيه), meaning it harmonizes with it due to homogeneity (المجانسة). This is the fusion (الالتحام) and the union (الاتحاد).\n\nAnd here is a great secret: it is what increases the light of the Manifesting One (المتجلي) from the light of the one to whom He manifests (المتجلي له) when it is added to it and integrated within it. When the Prophet, peace and blessings be upon him, stood in the Station of Fear (مقام الخوف) that we mentioned, it led him to ask to be Light. It is as if he was saying: \"Make me You, so that I may see You by You, and my eye is not destroyed by seeing You, but rather integrated within You,\" as Al-Nabigha said:\n\nThat you are the sun, and the kings are stars,\nWhen you rise, no star among them is visible.\n\nAnd no eye is destroyed for it, nor does an eye appear for it. Thus, it sees and does not see, because it is behind the veil of the Greatest Light (النور الأعظم), which holds the ruling (الحكم) in the manifest realm (ظاهر الأمر).\n\n### The Lights of the Stars have a ruling in the inner realm\n\nAnd the lights of the stars have a ruling in the inner realm (باطن الأمر), integrated within the Greatest Light (النور الأعظم). The masters of the science of instruction (علم التعاليم) know this. They are the happiest of people with this Station (مقام), which is a noble Prophetic station. The Real (الحق) only veiled it from the believers out of mercy for them, because ignorance of the realities of things (حقائق الأمور) is prevalent in the cosmos (العالم). And the scholars are few individuals. So Allah had mercy on them by veiling that from them.\n\nAs for the Gnostics of Allah (العلماء بالله), there is no restriction upon them concerning it, for they know how to attribute and how not to know. And Allah says: <<وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها>> (And He revealed in every heaven its command). This is what He grants of effects (الآثار) in the cosmos, just as every tool gives the artisan, through it, what was made for it. And the craft (الصنعة) is attributed to the Artisan (الصانع), not to the tool (الآلة). Know this, and be according to what your strength grants you. And peace.\n\n### Does the possessor of the Station of Abandoning Fear feel safe from the Divine Devising or not?\n\nOur companions differed regarding the possessor of this Station (مقام): Does he feel safe from the Divine Devising (المكر الإلهي) or not? As for when there is glad tidings (البشرى), he must feel safe. I mean, when the glad tidings come with security (الأمن) from the Divine Devising.\n\nI am unable to elaborate on this Station further than what we have mentioned at this time, due to certain reasons. Nor will I explicitly state our doctrine (مذهبنا) concerning it, except to the extent we mentioned regarding the glad tidings, for it is a verified matter (أمر محقق) supported by both intellect and Sacred Law (الشرع).\n\nThis is because if the possessor of this Station has Paradise hastened for him in a manner that cannot be replaced, then security is attained, and this Station is valid for him. But if he does not possess this state, then Allah knows best.",
    "ur": "(باب ایک سو ایک خوف کو ترک کرنے کے مقام کے بیان میں)\n\nجب علمِ خوف کا تعلق عدم (Adam) سے ہوا\nتو میں نے اس سے خوف نہ کھایا، پس ہم نے قدم (Qidam) کا مرتبہ حاصل کر لیا۔\nمیں الوجود (Al-Wujūd) ہوں، لہٰذا کوئی خوف میرا ساتھی نہیں\nکیونکہ میرا ضد عدم (Adam) کی طرف منسوب ہے۔\nجس چیز سے تم ڈرتے ہو، اس کا کوئی وجود (Wujūd) نہیں\nپس اس کے خوف کو قربانی کے پتھر پر رکھے گوشت کی طرح چھوڑ دو۔\n\n### [نور، نور سے جلتا نہیں بلکہ اس میں شامل ہو جاتا ہے]\n\nآپ صَلَّى اللهُ عَليهِ وسَلَّم نے اپنی دعا میں فرمایا: \"اور مجھے نور (Nūr) بنا دے۔\"\nاور اللہ تعالیٰ نے فرمایا:\n**اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ** (اللہ آسمانوں اور زمین کا نور ہے۔)\nاور سبحات (سبحات) بھی انوار (Anwār) ہیں۔ اور نور، نور سے جلتا نہیں بلکہ اس میں شامل ہو جاتا ہے، یعنی ہم جنسی (Mujānasah) کی وجہ سے اس کے ساتھ پیوست ہو جاتا ہے۔ یہی پیوستگی (Iltiḥām) اور اتحاد (Ittiḥād) ہے۔ اور یہاں ایک عظیم راز ہے، اور وہ یہ ہے کہ جب متجلی (Al-Mutajallī) کا نور، متجلی لہ (جس پر تجلی ہو رہی ہے) کے نور میں شامل ہو کر اس میں مندرج ہو جاتا ہے، تو اس میں اضافہ ہو جاتا ہے۔\n\nاور جب آپ صَلَّى اللهُ عَليهِ وسَلَّم اس مقامِ خوف پر فائز ہوئے جس کا ہم نے ذکر کیا، تو اس نے آپ کو اس بات کی طرف رہنمائی کی کہ آپ نور (Nūr) ہونے کی درخواست کریں۔ گویا آپ فرما رہے تھے: \"مجھے تو ہی بنا دے تاکہ میں تجھے تیرے ذریعے دیکھوں، اور میری آنکھ تیری رؤیت سے زائل نہ ہو، بلکہ تجھ میں شامل ہو جائے،\" جیسا کہ نابغہ نے کہا ہے:\n\nکہ تو سورج ہے اور بادشاہ ستارے ہیں\nجب تو طلوع ہوتا ہے تو ان میں سے کوئی ستارہ دکھائی نہیں دیتا۔\n\nاور نہ اس کی آنکھ زائل ہوئی اور نہ اس کی آنکھ ظاہر ہوئی، پس وہ دیکھتی بھی ہے اور نہیں بھی دیکھتی، کیونکہ وہ نورِ اعظم کے حجاب کے پیچھے ہے، جس کا حکم ظاہر امر میں نافذ ہے۔\n\n### [ستاروں کے انوار کا حکم باطنِ امر میں ہوتا ہے]\n\nاور ستاروں کے انوار کا حکم باطنِ امر میں ہوتا ہے جو نورِ اعظم میں شامل ہوتا ہے۔ اس بات کو علمِ تعالیم (علمِ فلکیات) کے ماہرین جانتے ہیں، پس وہ اس مقام سے سب سے زیادہ سعادت مند ہیں۔ اور یہ ایک جلیل نبوی مقام ہے۔ ذات حق (Al-Ḥaqq) نے اسے مومنین پر صرف اس لیے محدود کیا ہے تاکہ ان پر رحم کرے، کیونکہ دنیا میں غالب طور پر امور کی حقیقتوں (Ḥaqā'iq al-Umūr) سے جہالت پائی جاتی ہے، اور علماء بہت کم ہیں۔ پس اللہ نے ان پر رحم کیا کہ اس علم کو ان سے محدود رکھا۔\n\nلیکن جو علماء باللہ (اللہ کے عارف) ہیں، ان پر اس میں کوئی حرج نہیں، کیونکہ وہ جانتے ہیں کہ کس طرح نسبت دی جائے اور کس طرح نہ دی جائے۔ اور اللہ فرماتا ہے:\n**وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا** (اور اس نے ہر آسمان میں اس کا حکم وحی کر دیا۔)\nاور یہ وہ اثرات ہیں جو وہ دنیا میں عطا کرتا ہے، جیسا کہ ہر آلہ صانع کو وہ چیز دیتا ہے جو اس کے ذریعے بنائی گئی ہو، اور صنعت کی نسبت صانع کی طرف ہوتی ہے نہ کہ آلے کی طرف۔ پس یہ جان لو اور اپنی قوت کے مطابق رہو۔ والسلام۔\n\n### [خوف کو ترک کرنے کے مقام کا حامل شخص کیا مکرِ الٰہی سے محفوظ ہے یا نہیں]\n\nاور ہمارے اصحاب نے اس مقام کے حامل شخص کے بارے میں اختلاف کیا ہے کہ آیا وہ مکرِ الٰہی (Al-Makr al-Ilāhī) سے محفوظ ہے یا نہیں؟\nجہاں تک بشارت (Al-Bushrā) کا تعلق ہے، تو وہ یقیناً محفوظ ہے، اور میرا مطلب یہ ہے کہ جب مکرِ الٰہی سے امن کی بشارت آ جائے۔ میں اس وقت اس مقام کے بارے میں اس سے زیادہ تفصیل بیان نہیں کر سکتا جو ہم نے اس وقت ذکر کی ہے، کچھ وجوہات کی بنا پر۔ اور میں اس میں اپنے مسلک کی صراحت نہیں کروں گا سوائے اس قدر کے جو ہم نے بشارت (Al-Bushrā) کے ضمن میں ذکر کیا ہے، کیونکہ یہ ایک محقق امر ہے جس پر عقلیں اور شریعت دلالت کرتی ہیں۔\nاور وہ یہ ہے کہ اگر اس مقام کے حامل شخص کے لیے جنت کو ایسے طریقے سے جلدی کر دیا گیا ہو کہ اسے تبدیل نہ کیا جا سکے، تو امن حاصل ہے اور اس کے لیے یہ مقام درست ہے۔ اور اگر اس کی یہ حالت نہ ہو تو اللہ ہی بہتر جانتا ہے۔",
    "fa": "باب صد و یکم در مقام ترک خوف (ترک هراس)\n\nچون علم خوف (ترس) به عدم (نیستی) تعلق گرفت،\nاز آن نترسیدم و مرتبه قدم (ازلیت) را به دست آوردیم.\n\nمن هستی (الوجود) هستم، پس ترسی با من همراه نیست،\nزیرا ضد من به عدم (نیستی) منسوب است.\n\nآنچه از آن ترسیدی، وجود (هستی) ندارد؛\nپس ترس از آن را همچون گوشتی بر تخته قصابی رها کن.\n\n### [نور با نور نمی‌سوزد، بلکه در آن مندرج می‌شود]\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در دعای خود فرمود: «و مرا نور قرار ده.» و خداوند متعال فرمود: «اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ (خداوند نور آسمان‌ها و زمین است).» و سبحات (انوار جلال الهی) نورها هستند، و نور با نور نمی‌سوزد، بلکه در آن مندرج می‌شود؛ یعنی به دلیل هم‌جنسی (مجانست) با آن سازگار می‌گردد. و این همان پیوستگی و اتحاد است. و در اینجا رازی عظیم نهفته است، و آن این است که نور متجلی (تجلی‌کننده) از نور متجلی‌له (کسی که تجلی بر او واقع شده) افزایش می‌یابد، هنگامی که به آن اضافه شده و در آن مندرج شود. و هنگامی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بر مقام خوفی که ذکر کردیم وقوف یافت، او را به جایی رساند که درخواست کرد نور باشد. گویی می‌فرماید: «مرا تو قرار ده تا تو را به واسطه تو ببینم، و چشمم با دیدن تو از بین نرود، بلکه در تو مندرج شوم.» چنانکه نابغه (شاعر) گفته است:\n\nتو خورشیدی و پادشاهان ستارگانند؛\nهنگامی که طلوع کنی، هیچ ستاره‌ای از آن‌ها دیده نمی‌شود.\n\nو چشمی برای آن (ستاره) از بین نرفت و چشمی برای آن ظاهر نشد؛ پس آن (ستاره) می‌بیند و دیده نمی‌شود، زیرا پشت حجاب نور اعظم (بزرگ‌تر) است که حکم در ظاهر امر از آن اوست.\n\n### [انوار ستارگان در باطن امر حکم دارند]\n\nو انوار ستارگان در باطن امر حکمی دارند که در نور اعظم (بزرگ‌تر) مندرج است. این را صاحبان علم تعالیم (علم نجوم و هیئت) می‌دانند. پس آنان سعادتمندترین مردم به این مقام هستند، و این مقامی شریف و نبوی است. و حق (الحق) این مقام را از مؤمنان منع نکرده، مگر از روی رحمت به آنان؛ زیرا غالب مردم در جهان نسبت به حقایق امور جاهل‌اند. و عالمان (به حقایق) اندک‌اند. پس خداوند به آنچه از این امور بر آنان منع کرده، بر ایشان رحمت آورده است. اما عالمان بالله (شناسندگان خداوند) در این امر حرجی بر آنان نیست، زیرا آنان می‌دانند چگونه نسبت دهند و چگونه ندانند. و خداوند می‌فرماید: «وَأَوْحى فِي كُلِّ سَماءٍ أَمْرَها (و در هر آسمانی امر آن را وحی کرد).» و این همان آثاری است که خداوند در جهان می‌بخشد، همان‌گونه که هر ابزاری برای صنعتگر، آنچه را که برای آن ساخته شده، به واسطه آن ابزار می‌دهد. و صنعت به صنعتگر اضافه می‌شود، نه به ابزار. پس این را بدان و بر اساس آنچه نیروی تو می‌بخشد، باش. و السلام.\n\n### [آیا صاحب مقام ترک خوف از مکر الهی در امان است یا خیر]\n\nاصحاب ما در مورد صاحب این مقام اختلاف نظر دارند که آیا از مکر الهی در امان است یا خیر. اما در صورت وجود بشارت، قطعاً در امان است. و منظورم این است که اگر بشارت به ایمنی از مکر خداوند برسد. و به دلایلی نمی‌توانم در این زمان چیزی بیش از آنچه ذکر کردیم، در مورد این مقام بسط دهم. و مذهب خود را در این باره صریحاً بیان نمی‌کنم، مگر به همان اندازه‌ای که در مورد بشارت ذکر کردیم؛ زیرا این امری محقق است که عقول و شرع بر آن دلالت دارند. و آن این است که اگر به صاحب این مقام، به گونه‌ای که قابل جایگزینی نباشد، بهشت تعجیل شده باشد، پس ایمنی حاصل است و این مقام برای او صحیح است. و اگر این حالت برای او حاصل نشده باشد، پس خداوند داناتر است."
  },
  "page_count": 2
}