{
  "id": 493,
  "title": {
    "ar": "الباب الثالث والتسعون وأربعمائة في معرفة حال قطب كان منزله قُلْ كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً لأنهم لم يجدوه إذ كان عندهم",
    "en": "Chapter Four Hundred and Ninety-Three: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station (منزل) was [the verse]: Say: \"All is from Allah.\" <<قُلْ كُلٌّ من عِنْدِ الله>> \"So what is wrong with these people that they hardly understand any statement?\" <<فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً>> Because they did not find Him, even though He was with them.",
    "ur": "باب نمبر چار سو ترانوے: ایک قطب (قطب) کے حال کی معرفت کے بارے میں جس کا مقام (منزل) یہ تھا: \"قُلْ كُلٌّ من عِنْدِ الله\" (کہہ دیجیے کہ سب کچھ اللہ ہی کی طرف سے ہے) \"فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً\" (تو ان لوگوں کو کیا ہوا ہے کہ وہ کوئی بات سمجھنے کے قریب بھی نہیں آتے)، کیونکہ انہوں نے اسے نہیں پایا حالانکہ وہ ان کے پاس ہی تھا۔",
    "fa": "باب چهارصد و نود و سوم در معرفت حال قطبی (Qutb) که مقام او این است: «بگو: همه از جانب خداست» (قُلْ كُلٌّ من عِنْدِ الله) «پس این قوم را چه شده که نزدیک نیست سخنی را بفهمند؟» (فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً) زیرا آنان آن را نیافتند، در حالی که نزدشان بود."
  },
  "content": {
    "ar": "## «الباب الثالث والتسعون وأربعمائة في معرفة حال قطب كان منزله قُلْ كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً لأنهم لم يجدوه إذ كان عندهم»\n\n\n> كل ما في الكون من خالقه *** فلهذا ليس في الكون حدوث‏\n\n\n> ما تراه قد نفى العلم به *** حين لا يفقه في الكون حديث‏\n\n\n> إنهم لم يجدوه حادثا *** فلهذا السير في ذاك حثيث‏\n\n\n> ما نفى بالعلم فيه أحد *** غير معتوه جهول أو خبيث‏\n\n\n> إنما يعلم منه كونه *** واحد العين وإن طال النثيث‏\n\n\n> كرم الله رسولا بالذي *** بثه فينا من الذكر الحديث‏\n\n\n### [القرآن هو كلام الله وهو صفته‏]\n\n\nقال الله تعالى ما يَأْتِيهِمْ من ذِكْرٍ من الرَّحْمنِ مُحْدَثٍ إِلَّا كانُوا عَنْهُ مُعْرِضِينَ وقال ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ إِلَّا اسْتَمَعُوهُ وهُمْ يَلْعَبُونَ لاهِيَةً قُلُوبُهُمْ فجاء الذكر من الرب والرحمن فأخبر أنهم استمعوا وأصغوا لذكر الرب في حال لهو وذكر إعراضهم عن ذكر الرحمن مع العلم منهم بأنه القرآن وهو كلام الله والكلام صفته فله القدم وإن حدث الإتيان اعلم أن الحديث قد يكون حديثا في نفس الأمر وقد يكون حديثا بالنسبة إلى وجوده عندك في الحال وهو أقدم من ذلك الحدوث وذلك إذا أردت بالقدم نفي الأولية فليس إلا كلام الله وليس إلا عين القابل صور التجلي وإذا أردت به غير نفي الأولية فقد يكون حادثا في نفسه ذلك الشي‏ء قبل حدوثه عندك وقد يكون حادثا بحدوثه عندك أي ذلك زمان حدوثه وهو ما يقوم بك أو بمن يخاطبك أو يجالسك من الأغراض في الحال وأما عندية الله فهي على قسمين أعني ما هو عنده القسم الواحد ما هو عليه من الأمر الذي يعقل زائدا على هويته وإن لم نقل فيه إنه غيره ولا عينه أيضا كالصفات المنسوبة إليه لا هي هو ولا هي غيره وقد يكون عنده ما يحدثه فينا ولنا وهو مثل قوله وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ وهذا الذي عندنا على نوعين نوع يحدث صورته لا جوهره كالمطر فإنا نعلم ما هو من حيث جوهره وما هو من حيث صورته وكل العالم على هذا أو هو النوع الآخر ما يحدث جوهره وليس إلا جوهر الصورة ووجود جوهر العين القائمة به تلك الصورة فإنه لا وجود لعين جوهرها الذي قامت به إلا عند قيامها به فهو قبل ذلك معقول لا موجود العين فموضع الصورة أو محل الصورة من المادة يحدث له الوجود بحدوث الصورة في حال ما لا في كل حال‏\nوينعدم من الوجود بعدمها ما لم تكن صورة أخرى تقوم به والكل عند الله فإن الله عين شيئيته فما ثم معقول ولا موجود يحدث عنده بل الكل مشهود العين له بين ثبوت ووجود فالثبوت خزائنه والوجود ما يحدثه عندنا من تلك الخزائن فصورة الماء في الجليد معقولة ينطلق عليها اسم جليد والماء في الجليد بالقوة فإذا طرأ على الجليد ما يحلله فإنه يصير ماء فظهرت وحدثت صورة الماء فيه ومنه وزال عنه اسم الجليد وصورته وحده وحقيقته وكان عندنا قبل تحلله أنه خزانة من خزائن الغيث فظهر أنه عين المخزون فكان خزانة بصورة ومخزونا بصورة غيرها وهكذا حكم ما يستحيل هو عين ما استحال وعين ما يستحيل إليه وإنما جئنا بهذا المثال المحقق لما نعاينه من صور التجلي في الوجود الحق لنلحق بذلك صور العالم كله في وجود الحق فنطلق عليه خلقا كما يطلق على الماء الذي تحلل من الجليد ماء ويطلق عليه ذلك إطلاقا حقيقيا لأنه ليس غير ما تحلل مما كان اسم الجليد له فهو حق بوجه خلق بوجه هذا ينتجه وأمثاله هذا الذكر من العلم الإلهي ومن هنا تعلم جميع المحدثات ما هي ومتى ينطلق عليها اسم الحدوث ومتى تقبل اسم القدم وهو علم نفيس يخص الله به من شاء من عباده وذلك هو الفضل المبين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 493: Concerning the Knowledge of the State of a Pole (قطب) whose Station (منزله) was [the verse]: <<Say: All is from Allah. What is wrong with these people that they hardly understand any discourse?>> (Q 4:78), because they did not find it, though it was with them.\n\nAll that is in the cosmos is from its Creator,\nThus there is no origination (حدوث) in the cosmos.\n\nWhat you see has denied the Knowledge of it,\nWhen no discourse (حديث) is understood in the cosmos.\n\nIndeed, they did not find it originated (حادثاً),\nThus the journey (السير) in that is swift.\n\nNo one denies it through Knowledge (العلم)\nExcept an imbecile, an ignorant fool, or a malicious one.\n\nWhat is known of it is only its being\nOne in Essence (عين), even if the scattering (النثيث) is prolonged.\n\nAllah honored a Messenger with that\nWhich He spread among us of the recent Remembrance (الذكر الحديث).\n\n### [The Quran is the Speech of Allah and it is His Attribute (صفته)]\n\nAllah the Exalted said: <<No fresh Remembrance (ذكر) comes to them from the All-Merciful (الرحمن) but they turn away from it.>> (Q 26:5) And He said: <<No fresh Remembrance (ذكر) comes to them from their Lord (ربهم) but they listen to it while they play, their hearts distracted.>> (Q 21:2-3) Thus, the Remembrance (الذكر) came from the Lord (الرب) and the All-Merciful (الرحمن). He informed that they listened and paid attention to the Remembrance of the Lord while in a state of distraction, and He mentioned their turning away from the Remembrance of the All-Merciful, despite their knowledge that it is the Quran, which is the Speech (كلام) of Allah. Speech is His Attribute (صفته), so it possesses Pre-eternity (القدم), even if the coming (الإتيان) is originated (حدث).\n\nKnow that the discourse (الحديث) may be originated (حديثاً) in itself (في نفس الأمر), or it may be originated relative to its existence with you (عندك) in the present moment, yet it is more ancient (أقدم) than that origination (الحدوث). This is the case if by Pre-eternity (القدم) you intend the negation of temporality (نفي الأولية). In that case, there is nothing but the Speech of Allah (كلام الله), and nothing but the very Essence (عين) that accepts the forms of Theophany (صور التجلي). If, however, you intend by it something other than the negation of temporality, then that thing may be originated in itself (حادثاً في نفسه) before its origination with you, or it may be originated by its origination with you—meaning that is the time of its origination—which is what subsists in you, or in the one who addresses you or sits with you, of immediate purposes (الأغراض في الحال).\n\nAs for the Presence with Allah (عندية الله), it is of two divisions—meaning what is \"with Him.\" The first division is that state of the matter which is intelligible as an addition to His Identity (هويته), even if we do not say that it is other than Him, nor is it His very Essence (عينه) either, such as the Attributes (الصفات) ascribed to Him: they are neither Him nor other than Him. The second division is what He originates (يحدثه) in us and for us, which is like His saying: <<And there is not a thing but that its treasuries (خزائنه) are with Us.>> (Q 15:21)\n\nThis [origination] which is with us is of two types. One type is that whose form (صورته) is originated, but not its substance (جوهره), such as rain. For we know what it is in terms of its substance and what it is in terms of its form. The entire cosmos (العالم) is based on this. Or, it is the other type: that whose substance is originated, and this substance is nothing but the substance of the form and the existence of the substance of the Entity (العين) by which that form subsists. For the Entity of its substance, by which it subsists, has no existence except when it subsists by it. Prior to that, it is intelligible (معقول) but not existent in its Entity (موجود العين). Thus, the locus of the form, or the place of the form in matter, acquires existence through the origination of the form in a specific state, not in every state.\n\nAnd it ceases from existence (الوجود) upon the cessation of that form, unless another form subsists by it. All is with Allah, for Allah is the very Essence (عين) of its thingness (شيئيته). Therefore, there is nothing intelligible (معقول) or existent (موجود) that originates *with Him* (عنده). Rather, all is witnessed in its Entity (مشهود العين) by Him, oscillating between immutability (ثبوت) and existence (وجود). The immutability (الثبوت) constitutes His treasuries (خزائنه), and existence (الوجود) is what He originates with us from those treasuries.\n\nThus, the form of water in ice is intelligible (معقولة), and the name 'ice' is applied to it. The water in the ice is potential (بالقوة). When something occurs to the ice that dissolves it, it becomes water. The form of water thus appeared and originated in it and from it, and the name 'ice,' its form, its singularity, and its reality vanished from it. Before its dissolution, it was, in our view, a treasury (خزانة) from the treasuries of rain. Then it became manifest that it is the very Essence (عين) of the stored thing (المخزون). So it was a treasury in one form, and a stored thing in another form. The ruling is similar for whatever transforms: it is the very Essence of what transformed and the very Essence of what it transformed into. We only brought this verified example of the forms of Theophany (صور التجلي) that we witness in the Real Existence (الوجود الحق) so that we may attach to it the forms of the entire cosmos (العالم) in the existence of the Real (وجود الحق). We then apply the term 'creation' (خلقاً) to it, just as the term 'water' is applied to the water that dissolved from the ice. This application is truly real, because it is not other than what dissolved from that which bore the name 'ice.' Thus, it is the Real (حق) in one respect, and creation (خلق) in another. This Remembrance (الذكر) from the Divine Knowledge (العلم الإلهي) produces this and similar insights. From this, you learn what all originated things (المحدثات) are, when the name 'origination' (الحدوث) is applied to them, and when they accept the name 'Pre-eternity' (القدم). This is a precious Knowledge (علم نفيس) with which Allah singles out whichever of His servants He wills, and that is the manifest Grace (الفضل المبين). And <<Allah speaks the Truth, and He guides to the Way.>> (Q 33:4)",
    "ur": "باب نمبر چار سو ترانوے قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"کہہ دیجیے کہ سب کچھ اللہ ہی کی طرف سے ہے، تو ان لوگوں کو کیا ہوا ہے کہ وہ کوئی بات سمجھنے کے قریب بھی نہیں آتے؟\" (کیونکہ انہوں نے اسے نہیں پایا حالانکہ وہ ان کے پاس ہی تھا)۔\n\nکائنات میں جو کچھ بھی ہے وہ اس کے خالق کی طرف سے ہے،\nاسی لیے کائنات میں کوئی حدوث (حادث ہونا) نہیں ہے۔\n\nجو کچھ تم دیکھتے ہو، علم نے اس کی نفی کر دی ہے،\nجب کائنات میں کوئی بات (حدیث) سمجھی نہیں جاتی۔\n\nبے شک انہوں نے اسے حادث (عارضی) نہیں پایا،\nاسی لیے اس میں سفر تیز ہے۔\n\nعلم کے ذریعے اس میں کسی نے نفی نہیں کی،\nسوائے کسی دیوانے، جاہل یا خبیث کے۔\n\nاس سے صرف اس کا وجود (کونہ) ہی معلوم ہوتا ہے،\nجو عین (ذات) کے اعتبار سے واحد ہے، اگرچہ اس کا پھیلاؤ (نثیث) طویل ہو۔\n\nاللہ نے رسول کو اس چیز سے عزت بخشی\nجو اس نے ہم میں ذکرِ حدیث (نئی وحی) کے ذریعے پھیلائی۔\n\n### [قرآن اللہ کا کلام ہے اور وہ اس کی صفت ہے]\n\nاللہ تعالیٰ نے فرمایا: \"ان کے پاس رحمن کی طرف سے کوئی نئی نصیحت (ذکر) نہیں آتی مگر وہ اس سے منہ موڑنے والے ہوتے ہیں\" (سورۃ الشعراء: ۵)۔ اور فرمایا: \"ان کے پاس ان کے رب کی طرف سے کوئی نئی نصیحت (ذکر) نہیں آتی مگر وہ اسے سنتے ہیں اور ان کے دل غفلت میں پڑے ہوتے ہیں اور وہ کھیل رہے ہوتے ہیں\" (سورۃ الانبیاء: ۲-۳)۔ پس ذکر رب اور رحمن کی طرف سے آیا۔ اللہ نے خبر دی کہ انہوں نے رب کے ذکر کو لہو کی حالت میں سنا اور توجہ دی، اور رحمن کے ذکر سے ان کے اعراض کا ذکر کیا، حالانکہ وہ جانتے تھے کہ یہ قرآن ہے اور وہ اللہ کا کلام ہے، اور کلام اس کی صفت ہے، لہٰذا اسے قدم (ازلیت) حاصل ہے، اگرچہ اس کا آنا (ایتیان) حادث (عارضی) ہے۔\n\nجان لیجیے کہ حدیث (بات) نفسِ امر میں بھی حدیث ہو سکتی ہے، اور یہ آپ کے پاس فی الحال اس کے وجود کے اعتبار سے بھی حدیث ہو سکتی ہے، حالانکہ وہ اس حدوث سے قدیم (ازلی) ہے۔ یہ اس وقت ہوتا ہے جب آپ قدم (ازلیت) سے اولیت کی نفی مراد لیتے ہیں، تو پھر صرف اللہ کا کلام ہی ہے اور صرف صور التجلی (ظہور الٰہی کی صورتوں) کو قبول کرنے والی عین (ذات) ہی ہے۔ اور اگر آپ قدم سے اولیت کی نفی کے علاوہ کوئی اور معنی مراد لیتے ہیں، تو وہ شے آپ کے پاس حادث ہونے سے پہلے خود اپنے نفس میں حادث ہو سکتی ہے، اور آپ کے پاس اس کے حادث ہونے سے بھی حادث ہو سکتی ہے، یعنی وہ اس کے حادث ہونے کا وقت ہے، اور وہ وہ اغراض ہیں جو فی الحال آپ میں یا آپ سے مخاطب ہونے والے یا آپ کے ساتھ بیٹھنے والے میں قائم ہوتی ہیں۔\n\nاور جہاں تک عندیۃ اللہ (اللہ کی نزدیکی) کا تعلق ہے، تو وہ دو قسموں پر ہے، یعنی جو کچھ اس کے پاس ہے۔ پہلی قسم وہ امر ہے جو اس کی ہویت (ذات) سے زائد سمجھا جاتا ہے، اگرچہ ہم یہ نہیں کہتے کہ وہ اس کا غیر ہے اور نہ ہی اس کی عین (ذات) ہے، جیسے اس سے منسوب صفات، جو نہ وہ (ذات) ہیں اور نہ ہی اس کا غیر ہیں۔ اور کبھی اس کے پاس وہ ہوتا ہے جسے وہ ہم میں اور ہمارے لیے حادث کرتا ہے، اور یہ اس کے اس قول کی طرح ہے: \"اور کوئی چیز ایسی نہیں جس کے خزانے ہمارے پاس نہ ہوں\" (سورۃ الحجر: ۲۱)۔\n\nاور یہ جو ہمارے پاس ہے، یہ دو قسموں پر ہے۔ ایک قسم وہ ہے جو اپنی صورت کو حادث کرتی ہے نہ کہ اپنے جوہر کو، جیسے بارش۔ کیونکہ ہم جانتے ہیں کہ وہ اپنے جوہر کے لحاظ سے کیا ہے اور اپنی صورت کے لحاظ سے کیا ہے۔ اور پوری کائنات اسی پر ہے۔ یا دوسری قسم وہ ہے جو اپنے جوہر کو حادث کرتی ہے، اور وہ صرف صورت کا جوہر ہے اور اس عین (ذات) کے جوہر کا وجود ہے جس کے ساتھ وہ صورت قائم ہے۔ کیونکہ اس جوہر کی عین (ذات) کا وجود جس کے ساتھ وہ قائم ہوئی ہے، صرف اس کے ساتھ قیام کے وقت ہی ہوتا ہے۔ پس وہ اس سے پہلے معقول (قابل فہم) ہوتا ہے، نہ کہ موجود العین (ذاتاً موجود)۔ لہٰذا، مادے میں صورت کے مقام یا صورت کے محل کو وجود صرف صورت کے حادث ہونے کی حالت میں حاصل ہوتا ہے، نہ کہ ہر حال میں۔\n\nاور اس کے معدوم ہونے سے وہ وجود سے معدوم ہو جاتا ہے، جب تک کہ کوئی دوسری صورت اس کے ساتھ قائم نہ ہو جائے۔ اور سب کچھ اللہ کے پاس ہے، کیونکہ اللہ ہی ہر شے کی شیئیت (شے ہونا) کی عین (ذات) ہے۔ پس وہاں کوئی معقول (قابل فہم) یا موجود (موجودہ شے) نہیں ہے جو اس کے پاس حادث ہو، بلکہ سب کچھ اس کے لیے ثبوت (ثابت ہونا) اور وجود (ہستی) کے درمیان مشہود العین (ذاتاً مشاہدہ شدہ) ہے۔ پس ثبوت (ثابت ہونا) اس کے خزانے ہیں، اور وجود (ہستی) وہ ہے جسے وہ ان خزانوں سے ہمارے پاس حادث کرتا ہے۔ پس برف میں پانی کی صورت معقول (قابل فہم) ہے، اور اس پر برف کا نام بولا جاتا ہے، اور پانی برف میں بالقوۃ (امکانی طور پر) موجود ہے۔ پس جب برف پر کوئی ایسی چیز طاری ہوتی ہے جو اسے پگھلا دیتی ہے، تو وہ پانی بن جاتا ہے۔ پس اس میں اور اس سے پانی کی صورت ظاہر ہوئی اور حادث ہوئی، اور اس سے برف کا نام، اس کی صورت اور اس کی حقیقت زائل ہو گئی۔ اور ہمارے نزدیک اس کے پگھلنے سے پہلے یہ غیث (بارش) کے خزانوں میں سے ایک خزانہ تھا۔ پس یہ ظاہر ہوا کہ یہ عین مخزون (ذخیرہ شدہ چیز کی ذات) ہے۔ پس وہ ایک صورت کے ساتھ خزانہ تھا اور دوسری صورت کے ساتھ مخزون (ذخیرہ شدہ) تھا۔ اور اسی طرح ہر اس چیز کا حکم ہے جو تبدیل ہوتی ہے، وہ عین وہی ہے جو تبدیل ہوئی اور عین وہی ہے جس کی طرف وہ تبدیل ہوئی۔ اور ہم یہ محقق مثال صرف اس لیے لائے ہیں تاکہ ہم الوجود الحق (حقیقی ہستی) میں التجلی (ظہور الٰہی) کی جن صورتوں کا مشاہدہ کرتے ہیں، ان کو اس کے ساتھ منسلک کر سکیں، تاکہ ہم اس پر خلق (مخلوق) کا اطلاق کر سکیں، جیسا کہ اس پانی پر جو برف سے پگھلتا ہے، پانی کا اطلاق کیا جاتا ہے، اور یہ اطلاق حقیقی اطلاق ہوتا ہے، کیونکہ یہ اس چیز کا غیر نہیں ہے جو پگھل کر نکلی، جس کا نام برف تھا۔ پس وہ ایک لحاظ سے حق (ذات حق) ہے اور ایک لحاظ سے خلق (مخلوق) ہے۔ یہ اور اس کی مثالیں علم الٰہی سے حاصل ہونے والے اس ذکر (نصیحت) کا نتیجہ ہیں۔ اور یہاں سے آپ تمام محدثات (حادث ہونے والی چیزوں) کو جان سکتے ہیں کہ وہ کیا ہیں، اور کب ان پر حدوث (عارضی ہونا) کا نام بولا جاتا ہے اور کب وہ قدم (ازلیت) کا نام قبول کرتی ہیں۔ اور یہ ایک نفیس علم ہے جسے اللہ اپنے بندوں میں سے جسے چاہتا ہے عطا کرتا ہے، اور یہی فضل مبین (واضح فضل) ہے۔ اور اللہ حق (سچ) فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے۔",
    "fa": "باب چهارصد و نود و سوم در شناخت حال قطبی که منزل او این آیه بود: «بگو: همه از نزد خداست. پس این قوم را چه شده که نزدیک نیست سخنی را بفهمند؟» (قُلْ كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً) زیرا آنان آن را نیافتند، در حالی که نزدشان بود.\n\nهر آنچه در هستی است از خالق آن است\nاز این رو در هستی حدوثی (نوپدیدی) نیست\n\nآنچه می‌بینی، علم به آن را نفی کرده است\nهنگامی که سخنی در هستی فهمیده نمی‌شود\n\nآنان آن را حادث (نوپدید) نیافتند\nاز این رو سیر در آن شتابان است\n\nهیچ کس با علم، آن را نفی نکرد\nجز دیوانه‌ای نادان یا پلیدی\n\nتنها از آن دانسته می‌شود که او\nیگانه عین (ذات) است، هرچند پراکندگی طولانی شود\n\nخداوند رسولی را گرامی داشت به آنچه\nاز ذکر (یاد) نوپدید در میان ما پراکند\n\n### [قرآن کلام خدا و صفت اوست]\n\nخداوند متعال فرمود: «هیچ یادآوری نوپدیدی (مُحْدَثٍ) از سوی [خدای] رحمان برایشان نمی‌آید مگر اینکه از آن رویگردان می‌شوند.» (ما يَأْتِيهِمْ من ذِكْرٍ من الرَّحْمنِ مُحْدَثٍ إِلَّا كانُوا عَنْهُ مُعْرِضِينَ) و فرمود: «هیچ یادآوری نوپدیدی (مُحْدَثٍ) از سوی پروردگارشان برایشان نمی‌آید مگر اینکه آن را می‌شنوند در حالی که بازی می‌کنند و دل‌هایشان غافل است.» (ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ إِلَّا اسْتَمَعُوهُ وهُمْ يَلْعَبُونَ لاهِيَةً قُلُوبُهُمْ) پس ذکر (یاد) از سوی رب (پروردگار) و رحمان آمد. و خبر داد که آنان ذکر رب را در حال لهو (بازی) شنیدند و گوش فرا دادند، و رویگردانی‌شان از ذکر رحمان را ذکر کرد، با وجود آنکه می‌دانستند آن قرآن است و کلام خداست، و کلام صفت اوست، پس برای آن قدم (ازلیت) است، هرچند آمدن (الإتيان) آن حادث باشد.\n\nبدان که حدیث (سخن/نوپدید) گاهی در نفسِ امر، حادث است و گاهی نسبت به وجود آن نزد تو در حال حاضر حادث است، در حالی که آن از آن حدوث (نوپدیدی) قدیمی‌تر است. و این زمانی است که از قدم (ازلیت) نفیِ اولیت (آغازین بودن) را اراده کنی، پس جز کلام خدا نیست و جز عین (ذات) پذیرنده صورتهای تجلی (صور التجلی) نیست. و اگر از آن غیر از نفی اولیت را اراده کنی، آن شیء ممکن است در ذات خود قبل از حدوثش نزد تو حادث باشد، و ممکن است با حدوثش نزد تو حادث باشد؛ یعنی آن زمان حدوث آن است، و آن چیزی است که از اغراض (اهداف) در حال حاضر در تو یا در کسی که با تو سخن می‌گوید یا همنشینی می‌کند، پدید می‌آید.\n\nو اما عندیت (نزد خدا بودن) خداوند بر دو بخش است؛ یعنی آنچه نزد اوست. بخش اول، امری است که بر هویت (هویته) او افزوده شده و تعقل می‌شود، هرچند نگوییم که آن غیر اوست و نه عین او، مانند صفات منسوب به او که نه خود او هستند و نه غیر او. و گاهی نزد او چیزی است که آن را در ما و برای ما حادث می‌کند، و این مانند قول اوست: «و هیچ چیزی نیست مگر اینکه خزانه‌های آن نزد ماست.» (وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ) و این چیزی که نزد ماست بر دو نوع است: نوعی که صورت (شکل) آن حادث می‌شود نه جوهرش، مانند باران؛ زیرا ما می‌دانیم که آن از حیث جوهرش چیست و از حیث صورتش چیست، و تمام عالم بر این منوال است. یا نوع دیگر، چیزی است که جوهرش حادث می‌شود، و آن جز جوهر صورت و وجود جوهر عین (ذات) که آن صورت به آن قائم است، نیست. زیرا عین جوهری که صورت به آن قائم شده، وجودی ندارد مگر هنگام قیام صورت به آن. پس آن قبل از آن، معقول (قابل درک) است نه موجودِ عین (ذات موجود). بنابراین، موضع صورت یا محل صورت از ماده، وجود برایش حادث می‌شود به حدوث صورت در یک حال خاص، نه در هر حالی.\n\nو با عدم آن صورت، از وجود معدوم می‌شود، مگر اینکه صورت دیگری به آن قائم شود. و همه نزد خداست، زیرا خداوند عین شیئیت (شيئيته) آن است. پس نه معقولی هست و نه موجودی که نزد او حادث شود، بلکه همه برای او مشهودِ عین (مشهود العين) است، میان ثبوت (ثابت بودن) و وجود. پس ثبوت، خزانه‌های اوست و وجود، چیزی است که آن را از آن خزانه‌ها نزد ما حادث می‌کند. پس صورت آب در یخ، معقول است و نام یخ بر آن اطلاق می‌شود، و آب در یخ بالقوه است. پس اگر چیزی بر یخ عارض شود که آن را تحلیل کند، آب می‌شود. پس صورت آب در آن و از آن ظاهر و حادث شد و نام یخ و صورت و حقیقت آن به تنهایی از آن زائل گشت. و قبل از تحلیل آن، نزد ما این بود که آن خزانه‌ای از خزانه‌های باران است، پس آشکار شد که آن عین مخزون است. پس با صورتی، خزانه بود و با صورتی دیگر، مخزون. و حکم آنچه استحاله می‌یابد نیز چنین است؛ آن عین چیزی است که استحاله یافته و عین چیزی است که به آن استحاله می‌یابد. و ما این مثال محقق را برای صورتهای تجلی (صور التجلی) که در وجود حق (الوجود الحق) مشاهده می‌کنیم، آوردیم تا صورتهای تمام عالم را در وجود حق به آن ملحق سازیم، و بر آن «خلق» (آفرینش) اطلاق کنیم، همان‌گونه که بر آبی که از یخ تحلیل رفته، «آب» اطلاق می‌شود، و این اطلاق، اطلاقی حقیقی است، زیرا آن غیر از چیزی نیست که از آنچه نام یخ بر آن بود، تحلیل رفته است. پس آن از یک وجه حق (الحق) است و از وجهی دیگر خلق (آفرینش). این ذکر (یاد) از علم الهی، این و امثال آن را نتیجه می‌دهد. و از اینجا تمام محدثات (نوپدیدها) را می‌دانی که چه هستند و چه زمانی نام حدوث (نوپدیدی) بر آنها اطلاق می‌شود و چه زمانی نام قدم (ازلیت) را می‌پذیرند، و این علمی نفیس است که خداوند آن را به هر کس از بندگانش که بخواهد اختصاص می‌دهد، و آن فضل مبین (آشکار) است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}