{
  "id": 517,
  "title": {
    "ar": "الباب السابع عشر وخمسمائة في معرفة حال قطب كان منزله حَتَّى إِذا ضاقَتْ عَلَيْهِمُ الْأَرْضُ بِما رَحُبَتْ وضاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وظَنُّوا أَنْ لا مَلْجَأَ من الله إِلَّا إِلَيْهِ وهذا ذكر الاضطرار والفرج بعد الشدة",
    "en": "Chapter Five Hundred and Seventeen: Concerning the knowledge of the state of a Pole (قطب) whose station is defined by the verse: <<حَتَّى إِذا ضاقَتْ عَلَيْهِمُ الْأَرْضُ بِما رَحُبَتْ وضاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وظَنُّوا أَنْ لا مَلْجَأَ من الله إِلَّا إِلَيْهِ>> (Until when the earth, vast as it is, was straitened for them, and their own souls were straitened for them, and they knew that there was no refuge from Allah except in Him). And this is the mention of the state of Compulsion (الاضطرار) and Relief (الفرج) after Hardship (الشدة).",
    "ur": "باب نمبر ۵۱۷: ایک قطب کے حال کی معرفت کے بارے میں جس کا مقام یہ تھا: \"حَتَّى إِذا ضاقَتْ عَلَيْهِمُ الْأَرْضُ بِما رَحُبَتْ وضاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وظَنُّوا أَنْ لا مَلْجَأَ من الله إِلَّا إِلَيْهِ\" (یہاں تک کہ جب زمین اپنی وسعت کے باوجود ان پر تنگ ہو گئی اور ان کی جانیں بھی ان پر تنگ ہو گئیں، اور انہوں نے گمان کیا کہ اللہ سے کوئی پناہ نہیں مگر اسی کی طرف)۔ اور یہ اضطرار اور شدت کے بعد فرج کا ذکر ہے۔",
    "fa": "باب پانصد و هفدهم در شناخت حال قطب (قطب) که منزل او این آیه است: «حَتَّى إِذا ضاقَتْ عَلَيْهِمُ الْأَرْضُ بِما رَحُبَتْ وضاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وظَنُّوا أَنْ لا مَلْجَأَ من الله إِلَّا إِلَيْهِ» (تا آنگاه که زمین با همه وسعتش بر آنان تنگ آمد و جان‌هایشان بر آنان تنگ شد و دانستند که پناهگاهی از خدا جز به سوی او نیست). و این بیان اضطرار (الاضطرار) و فرج (الفرج) پس از شدت (الشدة) است."
  },
  "content": {
    "ar": "## «الباب السابع عشر وخمسمائة في معرفة حال قطب كان منزله حَتَّى إِذا ضاقَتْ عَلَيْهِمُ الْأَرْضُ بِما رَحُبَتْ وضاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وظَنُّوا أَنْ لا مَلْجَأَ من الله إِلَّا إِلَيْهِ وهذا ذكر الاضطرار والفرج بعد الشدة»\n\n\n> إن أرض الله واسعة *** فشقي من تضيق عليه‏\n\n\n> سبب الضيق الخلاف فكن *** معه إن الرجوع إليه‏\n\n\n> من يقف ولا يخالفه *** يقف التحقيق بين يديه‏\n\n\n> ثم يعطيه لتوبته *** كل ما في علمه ولديه‏\n\n\n> فإذا أفنى حقيقته *** جاءه المطلوب في علميه‏\n\n\n> عند جمع حين جاء لها *** ليكون الحكم من حكميه‏\n\n\n> كل ما في الكون من ولد *** ما لنا منهم سوى ولديه‏\n> فأخ بالشرع فثبته *** لأخ بالكشف من أبويه‏\n\n\n### [إنما الضيق بالشريك لهذا لا يغفر الله أن يشرك به‏]\n\n\nقال الله تعالى وعَلَى الثَّلاثَةِ الَّذِينَ خُلِّفُوا فلو كان واحد ما ضاقت عليه الأرض لأن الضيق إنما يقع بالشريك ولهذا لا يغفر الله أَنْ يُشْرَكَ به فإنه يخرج عنه ما هو له ولذلك أغضب المشرك الحق غضبا أورثه ذلك الغضب مكانا ضيقا لما في الغضب من الضيق فحصل له مع أمثاله من المشركين كونهم مُقَرَّنِينَ في الْأَصْفادِ فليس اتساع الأرض إلا لمن انفرد بها فلما انقسمت بين ثلاثة قسمة مشاعة ضاق الفضاء الرحب ولو لا وجود الفردية في الثلاثة لهلكوا فما نجاهم إلا ما في الثلاثة من الأحدية الواردة على الاثنين وأما لو كانوا أربعة أو اثنين ما نجوا ولا تاب الله عليهم فإن الله وتر يحب الوتر والثلاثة وتر فأبقى عليهم من المحبة ما تاب بها عليهم وإذا رحم الله الشفع إنما يرحمه بآحاده فيخلو به واحدا واحدا على انفراده حتى لا ينال رحمته إلا الواحد فما يرحم الله عباده شفعا وإنما يرحمهم إما في الفردية أو في الأحدية غير ذلك لا يكون وبعد ذلك يفعل ما يريد وإنما وقع الكلام على الواقع فما تكثر الأعداد ولا تظهر إلا بآحادها فلو زالت الآحاد منها لما كان في العالم شفع ولا عدد ولهذا لم يتكرر تجل قط على شخص ولا في شخصين فلو لا ما قال ثلاثة ما صح لهم ذوق الضيق في الاتساع لما في الثلاثة من الشفعية ولما صح لهم ذوق الاتساع بالرحمة بالتوبة لما في الثلاثة من الأحدية التي بها كانت فردا وهي أول الأفراد فلها الأولية فهي أقرب إلى الأحدية فأسرعت الرحمة إليهم فلو كانوا خمسة لكانوا أبعد من الأحدية وأكثر ضيقا لتضاعف الشفعية وهكذا الأمر طلعت الأفراد ما طلعت وهو الذي ينفي كثرة المدة في النار في العذاب لأهلها حتى يقطعوا كل شفع يكون في فرديتهم انتهوا إلى ما انتهوا إليه فغاية إقامتهم في العذاب ثمانية وتسعون دهرا ثم يتولاهم الاسم الرحمن بعد ذلك وهم نازلون في الشقاء من ثمانية وتسعين إلى اثنين بعدد كل شفع بينها وفي كل فردية رحمة تكون لمن له حظ فيها في هذه الدار فيفتر عنه بقدر ذلك وأما أهل الشفع فلا يفتر عنهم العذاب وهم فيه مبلسون إلى الغاية التي ذكر الله من شفعية وهي الثمانية والتسعون فالوتر الذي يكون بعد الشفع هو الذي يأخذ بثار الوتر الذي قبله إذ شفعه من ظهر بين الوترين كالثالث بين الاثنين والرابع فيأخذ بثار الواحد الذي شفعته الاثنان وكالخامس بين الأربعة والستة يأخذ بثار الثالث الذي شفعته الأربعة لينتقم له فإن الوتر في اللسان الذي جاءت به هذه الشريعة المحمدية هو طلب الثأر وهكذا حكم كل فرد حتى تنتهي إلى تسعة وتسعين فإذا وقف الأمر هناك وانحصر في الاسم الرحمن تولاه الله بالاسم الأعظم لأن به تمام المائة فعم درجات الجنة ودركات النار ولم يتوله الاسم الأعظم المتمم إلا من الاسم الرحمن فهو حاجب الحجاب فليس له منازع بين يدي الاسم الأعظم فيئول الأمر إلى شمول الرحمة في الدارين لساكنيهما وما قال من المشركين ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ إلا من كان في مقام الفردية منهم فإذا قالها صاحب الشفعية فإنما ذلك لحصره بين الواحد الذي شفعه بوجود معبوده والواحد الذي يفرد هذا الشفع في استقباله فمن أي وجهة رد إليها وجهه هذا الشفع لم ير إلا واحدا فنظر إلى نفسه فلم ير إلا أحديته فقال عند ذلك ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فصدرت هذه الكلمة من كل مشرك شفعا كان أو وترا للشريك الذي نصبه وأما من قال إِنَّ الله هُوَ الْمَسِيحُ أو قال ما عَلِمْتُ لَكُمْ من إِلهٍ غَيْرِي فليس في الظاهر بمشرك وإنما دخل عليه الشرك بالاسم ولذلك قال الله لنبيه عليه السلام قُلْ سَمُّوهُمْ فإنهم إذا سموهم عرفوا بالاسم من هو المسمى فقال هؤلاء إِنَّ الله هُوَ الْمَسِيحُ وليس المسيح من أسمائه إذ كان له هذا الاسم قبل أن يدعي فيه أنه الله فأشركوا من حيث الاسم وأشرك فرعون من حيث خالف عقده قوله فبهذا كانوا مشركين ثم ينتج له هذا الذكر أمرا عجيبا على الأوج مخبوءا في الدرج مرقوما في طي الدرج إذ سماهم الله مخلفين فإن كل مفارق أهله فالله خليفته في ذلك الأهل سواء استخلفه أم لم يستخلفه فكل من يقوم في أهله بعده فإنما ذلك نائب الله لا نائبه فهؤلاء الثلاثة الذين خلفوا ما خلفهم الاسم الظاهر فإن‏\n\n\nالشرع دعاهم إلى الخروج ولكن الله ثبطهم فمنهم من كَرِهَ الله انْبِعاثَهُمْ فَثَبَّطَهُمْ ومنهم من ثبطه لا عن كره فقاموا في أهليهم مقام حق فجعلهم الله خلفا في أهليهم عنه من الاسم الباطن على كره منهم فكان من أمرهم ما كان ف تابَ الله عَلَيْهِمْ فتفاضلت توبتهم فكان منهم الكاذب في عذره فقبله منهم الكرم الإلهي وكان منهم الصادق وهو في‏\nالدار الدنيا فاذاقه الله مرارة الصدق هنا ليعلم من يَتَّبِعُ الرَّسُولَ مِمَّنْ يَنْقَلِبُ عَلى‏ عَقِبَيْهِ فإن الدنيا دار بلاء ورحم الله الجميع ورجع عليهم بالرحمة ولكن على التفاضل فيها وما فعل ذلك وأخبرنا به إلا لنكون بتلك الصفة الإلهية مع عباده في معاملتهم إيانا فمن صدقنا رأينا له منزلة صدقه ومن كذب لنا لم نفضحه وتغاضينا عن كذبه وأظهرنا له قبول قوله لأن قوله وجود فقبلناه ومدلوله عدم فلم نجد من يقبل فبقينا على البراءة الأصلية فإن المعدوم ليس بمنازع فمن كان هذا ذكره ولم يكن له هذا الخلق فما ذكره هذا الذكر قط والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 517: On the Gnosis of the State of a Pole whose Station was defined by [the verse]: <<حَتَّى إِذا ضاقَتْ عَلَيْهِمُ الْأَرْضُ بِما رَحُبَتْ وضاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وظَنُّوا أَنْ لا مَلْجَأَ من الله إِلَّا إِلَيْهِ>> (until, when the earth, vast as it is, was straitened for them, and their own souls were straitened for them, and they perceived that there is no refuge from Allah except in Him). This is the mention of Distress (الاضطرار) and Relief after Hardship.\n\nIndeed, the Earth of Allah is vast,\nSo wretched is he for whom it becomes narrow.\n\nThe cause of narrowness is opposition; so be\nWith Him, for the return is to Him.\n\nWhoever stands and does not oppose Him,\nThe Realization (التحقيق) stands before him.\n\nThen He grants him, due to his repentance,\nAll that is in His Knowledge and with Him.\n\nAnd when he annihilates his reality (حقيقته),\nThe Sought comes to him in His two Knowledges.\n\nAt the gathering (جمع) when he came to it,\nSo that the ruling might be from His two Rulings.\n\nAll that is born in the cosmos (الكون)—\nWe have none of them save His two children.\n\nSo, take a brother by the Law (الشرع) and confirm him,\nFor a brother by Unveiling (الكشف) is from his two parents.\n\n### [Narrowness is only due to the partner (الشريك); this is why Allah does not forgive that a partner be associated with Him.]\n\nAllah the Exalted said: <<وَعَلَى الثَّلاثَةِ الَّذِينَ خُلِّفُوا>> (And upon the three who were left behind). If there had been only one, the earth would not have been straitened for him, because narrowness (الضيق) only occurs due to the partner (الشريك). This is why Allah does not forgive <<أَنْ يُشْرَكَ بِهِ>> (that a partner be associated with Him), for this association removes from Him what belongs to Him. For this reason, the polytheist (المشرك) angered the Real (الحق) with a wrath that bequeathed upon him a narrow place, corresponding to the narrowness inherent in wrath. Thus, he found himself, along with others like him among the polytheists, <<مُقَرَّنِينَ فِي الْأَصْفادِ>> (bound together in fetters).\n\nThe spaciousness of the Earth is only for the one who is singular (انفرد بها). When it was divided among three in a shared partition (قسمة مشاعة), the wide expanse became narrow. Were it not for the existence of singularity (الفردية) within the three, they would have perished. What saved them was only the Oneness (الأحدية) present in the three, which descended upon the two. However, had they been four or two, they would not have been saved, nor would Allah have turned to them in forgiveness.\n\nIndeed, Allah is Odd (وتر) and loves the Odd, and three is Odd. So, He preserved for them a portion of the Love (المحبة) by which He turned to them in forgiveness. When Allah shows mercy to the Even (الشفع), He only shows mercy through its Odd units (آحاده). He isolates Himself with them, one by one, individually (على انفراده), so that only the single unit (الواحد) attains His mercy. Allah does not show mercy to His servants in pairs (شفعا); rather, He shows mercy either in singularity (الفردية) or in Oneness (الأحدية). Anything other than this does not occur. After that, He does what He wills.\n\nThis discussion is based on what actually occurs. Numbers (الأعداد) do not multiply or appear except through their single units (آحادها). If the single units were removed from them, there would be no even number (شفع) or number at all in the cosmos (العالم). For this reason, a theophany (تجلي) has never been repeated upon a single person, nor has it occurred in two persons simultaneously. Were it not for the fact that they were called \"three,\" they would not have correctly tasted the narrowness (الضيق) within the spaciousness, due to the evenness (الشفعية) inherent in the number three. Nor would they have correctly tasted the spaciousness through mercy (الرحمة) by means of repentance (التوبة), due to the Oneness (الأحدية) inherent in the three, by which it was an individual (فردا). It is the first of the individuals (الأفراد), thus possessing priority (الأولية), making it closer to Oneness. Therefore, mercy hastened to them. Had they been five, they would have been further from Oneness and experienced greater narrowness due to the multiplication of evenness.\n\nThis is the nature of the matter, however the individuals appear. This principle is what negates the long duration of punishment (العذاب) in the Fire for its inhabitants, until they cut off every evenness that exists in their singularity. They reach the limit they are destined for. The maximum duration of their stay in the punishment is ninety-eight ages (دهرا). Then, the Name *al-Rahman* (The All-Merciful) takes charge of them afterward. They descend in wretchedness (الشقاء) from ninety-eight to two, corresponding to the number of every even unit between them. In every singularity (فردية) there is a mercy that belongs to whoever has a share in it in this world (الدار الدنيا), and this mercy provides relief (يفتر عنه) for him to that extent. As for the people of the Even (أهل الشفع), the punishment is not relieved from them, and they are utterly despairing (مبلسون) within it, up to the limit of evenness (شفعية) mentioned by Allah, which is ninety-eight.\n\nThe Odd (الوتر) that comes after the Even is what takes vengeance (يأخذ بثار) for the Odd that preceded it, since the Even that appeared is between the two Odd numbers—like the three between the two and the four. It takes vengeance for the one whose evenness was formed by the two. And like the five between the four and the six, it takes vengeance for the three whose evenness was formed by the four, in order to avenge it. Indeed, the Odd in the language brought by this Muhammadan Law (الشريعة المحمدية) is the seeking of vengeance (طلب الثأر). This rule applies to every individual until it reaches ninety-nine. When the matter stops there and is confined to the Name *al-Rahman*, Allah takes charge of it through the Greatest Name (الاسم الأعظم), because by it the hundred is completed. It encompasses the degrees of Paradise and the levels of the Fire. The Greatest Name, which completes the number, only takes charge after the Name *al-Rahman*. Thus, *al-Rahman* is the Veil of the Veil (حاجب الحجاب). It has no contender before the Greatest Name. Therefore, the matter culminates in the inclusion of mercy (شمول الرحمة) in both Abodes (الدارين) for their inhabitants.\n\nNone of the polytheists said: <<مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى الله زُلْفَى>> (We only worship them that they may bring us nearer to Allah in proximity) except those among them who were in the station of singularity (مقام الفردية). If the one in the station of evenness (صاحب الشفعية) says this, it is only because he is confined between the One (الواحد) whom he made even by the existence of his worshipped object, and the One who isolates this evenness in its reception. From whatever direction this evenness turns its face, it sees nothing but One. Then he looks at himself and sees nothing but his own Oneness (أحديته). It is then that he says: \"We only worship them that they may bring us nearer to Allah in proximity.\" This statement originated from every polytheist, whether he was even or odd, concerning the partner (الشريك) he established.\n\nAs for those who said: <<إِنَّ اللهَ هُوَ الْمَسِيحُ>> (Indeed, Allah is the Messiah) or said: <<مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي>> (I know of no god for you other than me), they are not outwardly polytheists. Rather, polytheism entered upon them through the Name (بالاسم). That is why Allah said to His Prophet (peace be upon him): <<قُلْ سَمُّوهُمْ>> (Say: Name them). For when they name them, they will know by the Name who the Named One is. These people said: \"Indeed, Allah is the Messiah,\" and the Messiah is not one of His Names, since he had this name before it was claimed that he was Allah. Thus, they associated partners from the perspective of the Name. And Pharaoh associated partners from the perspective of contradicting his own conviction (عقده قوله). In this way, they were polytheists.\n\nThen this remembrance (الذكر) yields a wondrous matter, placed on the summit (الأوج), hidden in the steps (الدرج), inscribed in the folds of the steps, since Allah named them \"those left behind\" (مخلفين). Every person who separates from his family (أهله)—Allah is his successor (خليفته) in that family, whether he appointed Him as successor or not. Everyone who stands in his family after him is only Allah's deputy (نائب الله), not his own deputy.\n\nThese three who were left behind were not left behind by the Manifest Name (الاسم الظاهر), for the Law (الشرع) called them to go out, but Allah held them back (ثبطهم). Among them were those whose going forth Allah disliked, <<فَثَبَّطَهُمْ>> (so He held them back), and among them were those He held back not out of dislike. They stood in their families in a rightful position, and Allah made them successors (خلفا) in their families on His behalf, derived from the Inward Name (الاسم الباطن), despite their reluctance (على كره منهم). Thus, what happened to them happened, and <<تَابَ اللهُ عَلَيْهِمْ>> (Allah turned to them in forgiveness). Their repentance (توبتهم) varied in degree. Among them was the one who lied in his excuse, yet Divine Generosity (الكرم الإلهي) accepted it from him. And among them was the truthful one, who was in the worldly abode (الدار الدنيا). Allah made him taste the bitterness of truthfulness here, so that He might know <<مَنْ يَتَّبِعُ الرَّسُولَ مِمَّنْ يَنْقَلِبُ عَلَى عَقِبَيْهِ>> (who follows the Messenger from him who turns back on his heels). For the world is the abode of trial (دار بلاء). Allah had mercy on all of them and returned to them with mercy, but with variation in degree. He did not do this and inform us of it except so that we might possess that Divine Attribute (الصفة الإلهية) in our dealings with His servants. Whoever is truthful with us, we recognize the station of his truthfulness. And whoever lies to us, we do not expose him, but overlook his lie and show him acceptance of his statement, because his statement is existence (وجود), so we accept it, but its implication is non-existence (عدم), and we found no one to accept non-existence. Thus, we remain upon the original innocence (البراءة الأصلية), for the non-existent is not a contender. Whoever has this remembrance (الذكر) and does not possess this character (الخلق), this remembrance has never truly been his. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر ۵۱۷: اس قطب (Pole) کے حال کی معرفت میں جس کا مقام یہ تھا: \"یہاں تک کہ جب زمین اپنی وسعت کے باوجود ان پر تنگ ہو گئی اور ان کی جانیں بھی ان پر تنگ ہو گئیں اور انہوں نے جان لیا کہ اللہ سے بچنے کے لیے کوئی پناہ گاہ نہیں مگر اسی کی طرف۔\" (التوبہ: ۱۱۸) اور یہ اضطرار (الاضطرار) اور شدت کے بعد فرج (الفرج) کا بیان ہے۔\n\nیقیناً اللہ کی زمین وسیع ہے\nپس وہ بدبخت ہے جس پر وہ تنگ ہو جائے\n\nتنگی کا سبب اختلاف ہے، پس تو اس کے ساتھ ہو جا\nیقیناً رجوع اسی کی طرف ہے\n\nجو ٹھہر جائے اور اس کی مخالفت نہ کرے\nتحقیق (التحقیق) اس کے سامنے آ کھڑی ہوتی ہے\n\nپھر وہ اسے اس کی توبہ کے بدلے عطا کرتا ہے\nوہ سب کچھ جو اس کے علم اور اس کے پاس ہے\n\nپس جب وہ اپنی حقیقت کو فنا (الفناء) کر دیتا ہے\nمطلوب اس کے دونوں علوم میں اس کے پاس آ جاتا ہے\n\nجمع (جمع) کے وقت جب وہ اس کے لیے آیا\nتاکہ حکم اس کے دو احکام میں سے ہو\n\nکائنات میں جتنی بھی اولاد ہے\nہمیں ان میں سے اس کی دو اولادوں کے سوا کچھ نہیں ملا\n\nپس ایک بھائی کو شریعت کے ذریعے لے، اور اسے ثابت کر\nدوسرے بھائی کے لیے جو کشف (الکشف) کے ذریعے اس کے والدین میں سے ہے\n\n***\n\nتنگی صرف شریک کی وجہ سے ہوتی ہے، اسی لیے اللہ یہ معاف نہیں کرتا کہ اس کے ساتھ شرک کیا جائے۔\n\nاللہ تعالیٰ نے فرمایا: \"اور ان تینوں پر جنہیں پیچھے چھوڑ دیا گیا تھا۔\" (التوبہ: ۱۱۸) اگر وہ ایک ہوتا تو زمین اس پر تنگ نہ ہوتی، کیونکہ تنگی صرف شریک کی وجہ سے واقع ہوتی ہے۔ اسی لیے اللہ یہ معاف نہیں کرتا کہ اس کے ساتھ شرک (الشرک) کیا جائے، کیونکہ شرک اس چیز کو اس سے خارج کر دیتا ہے جو اسی کے لیے ہے۔ اسی وجہ سے مشرک نے ذات حق (الحق) کو ایسا غضب دلایا جس نے اس غضب کے نتیجے میں اسے ایک تنگ جگہ عطا کی، کیونکہ غضب میں تنگی ہوتی ہے۔ چنانچہ اسے اپنے جیسے مشرکوں کے ساتھ یہ حالت ملی کہ وہ \"زنجیروں میں جکڑے ہوئے\" ہوں گے۔ زمین کی وسعت صرف اسی کے لیے ہے جو اس میں منفرد ہو۔ پس جب وہ (زمین) تین کے درمیان مشترکہ طور پر تقسیم ہوئی تو وسیع فضا تنگ ہو گئی۔ اگر ان تینوں میں فردیت (الفردیۃ) کا وجود نہ ہوتا تو وہ ہلاک ہو جاتے، پس انہیں صرف اس احدیت (الأحدیۃ) نے نجات دی جو ان تینوں میں موجود تھی اور جو دو پر وارد ہوئی تھی۔\n\nلیکن اگر وہ چار یا دو ہوتے تو وہ نجات نہ پاتے اور نہ ہی اللہ ان کی توبہ قبول کرتا، کیونکہ اللہ وتر (الوتر - طاق) ہے اور وتر کو پسند کرتا ہے، اور تین وتر ہے۔ پس اللہ نے ان پر محبت کا وہ حصہ باقی رکھا جس کے ذریعے اس نے ان کی توبہ قبول کی۔ اور جب اللہ شفع (الشفع - جفت) پر رحم کرتا ہے تو وہ صرف اس کے آحاد (اکائیوں) کے ذریعے رحم کرتا ہے، پس وہ ایک ایک کر کے انفرادی طور پر ان سے خلوت کرتا ہے، یہاں تک کہ اس کی رحمت صرف واحد کو ہی حاصل ہوتی ہے۔ پس اللہ اپنے بندوں پر شفع کی صورت میں رحم نہیں کرتا، بلکہ ان پر یا تو فردیت (الفردیۃ) میں یا احدیت (الأحدیۃ) میں رحم کرتا ہے، اس کے علاوہ نہیں ہوتا۔ اور اس کے بعد وہ جو چاہتا ہے کرتا ہے۔ یہ کلام صرف واقع ہونے والی چیز پر ہوا ہے۔ اعداد نہ تو کثیر ہوتے ہیں اور نہ ہی ظاہر ہوتے ہیں مگر اپنی اکائیوں کے ذریعے۔ اگر ان میں سے اکائیاں زائل ہو جائیں تو دنیا میں نہ کوئی شفع (جفت) رہے گا اور نہ کوئی عدد۔\n\nاسی وجہ سے کسی ایک شخص پر یا دو اشخاص میں کبھی بھی تجلی (التجلی) مکرر نہیں ہوئی۔ اگر وہ تین نہ کہتے تو ان کے لیے وسعت میں تنگی کا ذوق صحیح نہ ہوتا، کیونکہ تین میں شفعیت (جفت ہونے) کا پہلو موجود ہے۔ اور نہ ہی ان کے لیے توبہ کی رحمت کے ذریعے وسعت کا ذوق صحیح ہوتا، کیونکہ تین میں احدیت (الأحدیۃ) کا وہ پہلو موجود ہے جس کے ذریعے وہ فرد (طاق) بنا، اور وہ افراد میں پہلا ہے۔ پس اسے اولیت حاصل ہے، لہٰذا وہ احدیت کے زیادہ قریب ہے، چنانچہ رحمت ان کی طرف تیزی سے پہنچی۔ اگر وہ پانچ ہوتے تو احدیت سے زیادہ دور ہوتے اور شفعیت کے دوگنا ہونے کی وجہ سے زیادہ تنگی میں ہوتے۔ اور معاملہ اسی طرح ہے۔ افراد ظاہر ہوئے تو ظاہر ہوئے، اور یہی وہ چیز ہے جو اہل نار کے لیے عذاب میں مدت کی کثرت کی نفی کرتی ہے، یہاں تک کہ وہ اپنی فردیت میں موجود ہر شفع کو کاٹ ڈالیں۔ وہ جس انجام کو پہنچے، پہنچ گئے۔ پس عذاب میں ان کے قیام کی انتہا اٹھانوے دہر (زمانے) ہے، پھر اس کے بعد اسم الرحمن (الاسم الرحمن) ان کی سرپرستی کرتا ہے، اور وہ بدبختی میں اٹھانوے سے دو تک اترتے ہیں، ان کے درمیان موجود ہر شفع کی تعداد کے مطابق۔\n\nاور ہر فردیت (الفردیۃ) میں ایک رحمت ہوتی ہے جو اس شخص کے لیے ہوتی ہے جس کا اس دنیا میں اس میں حصہ ہو، پس عذاب اس سے اسی قدر کم ہو جاتا ہے۔ لیکن اہل شفع (جفت والے) سے عذاب کم نہیں ہوتا، اور وہ اس میں اس انتہا تک مایوس رہتے ہیں جس کا اللہ نے شفعیت (جفت ہونے) کے لحاظ سے ذکر کیا ہے، اور وہ اٹھانوے ہے۔ پس وہ وتر (طاق) جو شفع کے بعد ہوتا ہے، وہی اس وتر کا بدلہ لیتا ہے جو اس سے پہلے تھا، کیونکہ اسے شفع بنانے والا وہ ہے جو دو وتروں کے درمیان ظاہر ہوا، جیسے دو اور چار کے درمیان تیسرا، جو اس ایک کا بدلہ لیتا ہے جسے دو نے شفع بنا دیا تھا۔ اور جیسے چار اور چھ کے درمیان پانچواں، جو اس تیسرے کا بدلہ لیتا ہے جسے چار نے شفع بنا دیا تھا، تاکہ اس کا انتقام لے۔ کیونکہ اس محمدی شریعت (الشریعۃ المحمدیۃ) کی زبان میں وتر (طاق) انتقام کا مطالبہ ہے۔\n\nاور ہر فرد کا یہی حکم ہے یہاں تک کہ وہ ننانوے تک پہنچ جائے۔ پس جب معاملہ وہاں رک جاتا ہے اور اسم الرحمن (الاسم الرحمن) میں محدود ہو جاتا ہے، تو اللہ اسم اعظم (الاسم الأعظم) کے ذریعے اس کی سرپرستی کرتا ہے، کیونکہ اسی سے سو کی تکمیل ہوتی ہے۔ پس وہ جنت کے درجات اور جہنم کے درکات کو عام کر دیتا ہے۔ اور اسم اعظم (الاسم الأعظم) جو تکمیل کرنے والا ہے، اس کی سرپرستی صرف اسم الرحمن (الاسم الرحمن) کی طرف سے ہوتی ہے، پس وہ حجاب کا حاجب ہے۔ اسم اعظم کے سامنے اس کا کوئی مقابلہ کرنے والا نہیں، چنانچہ معاملہ دونوں جہانوں کے مکینوں کے لیے رحمت کے شمول پر منتج ہوتا ہے۔\n\nاور مشرکوں میں سے کسی نے بھی یہ نہیں کہا: \"ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں\" (الزمر: ۳) مگر وہ جو ان میں سے مقام فردیت (مقام الفردیۃ) میں تھا۔ اور اگر اسے شفعیت (الشفعیۃ) کا حامل کہتا ہے، تو یہ صرف اس لیے ہے کہ وہ اس واحد کے درمیان محصور ہے جس نے اسے اپنے معبود کے وجود سے شفع بنا دیا، اور اس واحد کے درمیان جو اس شفع کو اپنے استقبال میں فرد بنا دیتا ہے۔ پس یہ شفع جس بھی سمت اپنا رخ موڑتا ہے، اسے صرف ایک ہی نظر آتا ہے۔ پھر وہ اپنی ذات کو دیکھتا ہے تو اسے صرف اپنی احدیت (أحدیۃ) نظر آتی ہے، چنانچہ وہ اس وقت کہتا ہے: \"ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں\" (الزمر: ۳)۔ پس یہ کلمہ ہر مشرک سے صادر ہوا، خواہ وہ شفع ہو یا وتر، اس شریک کے لیے جسے اس نے قائم کیا۔\n\nلیکن جس نے کہا: \"یقیناً اللہ ہی مسیح ہے\" (المائدہ: ۱۷) یا جس نے کہا: \"میں تمہارے لیے اپنے سوا کسی معبود کو نہیں جانتا\" (القصص: ۳۸)، تو وہ ظاہری طور پر مشرک نہیں ہے، بلکہ اس پر شرک اسم (نام) کے ذریعے داخل ہوا۔ اسی لیے اللہ نے اپنے نبی علیہ السلام سے فرمایا: \"کہو، انہیں نام دو۔\" کیونکہ جب وہ انہیں نام دیں گے تو وہ نام کے ذریعے جان لیں گے کہ مسمیٰ کون ہے۔ پس ان لوگوں نے کہا: \"یقیناً اللہ ہی مسیح ہے\" (المائدہ: ۱۷)، حالانکہ مسیح اس کے ناموں میں سے نہیں ہے، کیونکہ اسے یہ نام اس سے پہلے حاصل تھا کہ اس میں اللہ ہونے کا دعویٰ کیا جائے۔ پس انہوں نے اسم کے لحاظ سے شرک کیا، اور فرعون نے اس لحاظ سے شرک کیا کہ اس کے عقیدے نے اس کے قول کی مخالفت کی۔ پس اس طرح وہ مشرک ہوئے۔\n\nپھر یہ ذکر اس کے لیے ایک عجیب امر پیدا کرتا ہے جو بلندی پر ہے، درجوں میں پوشیدہ ہے، اور درجوں کی تہہ میں لکھا ہوا ہے، کیونکہ اللہ نے انہیں \"پیچھے چھوڑے گئے\" (مخلفین) کہا ہے۔ یقیناً ہر وہ شخص جو اپنے اہل کو چھوڑتا ہے، تو اللہ اس اہل میں اس کا خلیفہ ہوتا ہے، خواہ اس نے اسے خلیفہ بنایا ہو یا نہ بنایا ہو۔ پس ہر وہ شخص جو اس کے بعد اس کے اہل میں کھڑا ہوتا ہے، تو وہ اللہ کا نائب ہوتا ہے نہ کہ اس (چھوڑنے والے) کا نائب۔ پس یہ تینوں جنہیں پیچھے چھوڑا گیا، انہیں اسم الظاہر (الاسم الظاہر) نے پیچھے نہیں چھوڑا، کیونکہ شریعت نے انہیں نکلنے کی دعوت دی تھی، لیکن اللہ نے انہیں روک دیا۔ پس ان میں سے کچھ ایسے تھے جن کا \"اللہ نے اٹھنا ناپسند کیا، تو انہیں روک دیا\" (التوبہ: ۴۶)، اور ان میں سے کچھ ایسے تھے جنہیں ناپسندیدگی کے بغیر روکا گیا۔ پس وہ اپنے اہل میں حق کے مقام پر کھڑے ہوئے، تو اللہ نے انہیں اپنی طرف سے اسم الباطن (الاسم الباطن) کے ذریعے ان کے اہل میں خلیفہ بنا دیا، حالانکہ وہ اسے ناپسند کرتے تھے۔ پس ان کا معاملہ وہی ہوا جو ہوا، تو \"اللہ نے ان کی توبہ قبول کی\" (التوبہ: ۱۱۸)۔ پس ان کی توبہ میں تفاضل (فرق) تھا۔ ان میں سے وہ بھی تھا جو اپنے عذر میں جھوٹا تھا، تو کرم الٰہی (الکرم الإلٰہی) نے اسے قبول کر لیا۔ اور ان میں سے وہ بھی تھا جو سچا تھا، اور وہ دنیا کے گھر میں تھا، تو اللہ نے اسے یہاں سچائی کی تلخی چکھائی، تاکہ وہ جان لے کہ \"کون رسول کی پیروی کرتا ہے اور کون اپنی ایڑیوں پر پلٹ جاتا ہے\" (آل عمران: ۱۴۴)، کیونکہ دنیا آزمائش کا گھر ہے۔ اور اللہ نے سب پر رحم کیا اور رحمت کے ساتھ ان کی طرف رجوع کیا، لیکن اس میں تفاضل کے ساتھ۔ اور اللہ نے یہ سب نہیں کیا اور نہ ہی ہمیں اس کی خبر دی مگر اس لیے کہ ہم اپنے بندوں کے ساتھ اپنے معاملات میں اس صفت الٰہیہ (الصفۃ الإلٰہیۃ) کے حامل ہوں۔ پس جس نے ہم سے سچ کہا، ہم نے اس کے لیے اس کی سچائی کا مقام دیکھا، اور جس نے ہم سے جھوٹ بولا، ہم نے اسے رسوا نہیں کیا اور اس کے جھوٹ سے چشم پوشی کی، اور اس کے قول کو قبول کرنے کا اظہار کیا، کیونکہ اس کا قول وجود (وجود) ہے، تو ہم نے اسے قبول کیا، اور اس کا مدلول عدم (عدم) ہے، تو ہمیں کوئی قبول کرنے والا نہیں ملا۔ پس ہم براءت اصلیہ (البراءۃ الأصلیۃ) پر قائم رہے، کیونکہ معدوم (جو موجود نہیں) کوئی جھگڑا کرنے والا نہیں ہوتا۔ پس جس کا یہ ذکر ہو اور اس میں یہ خلق (خلق) نہ ہو، تو اس نے کبھی یہ ذکر نہیں کیا۔ اور \"اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے\" (الأحزاب: ۴).",
    "fa": "باب پانصد و هفدهم در معرفت حال قطبی که منزل او این آیه بود: «حَتَّى إِذا ضاقَتْ عَلَيْهِمُ الْأَرْضُ بِما رَحُبَتْ وَضاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وَظَنُّوا أَنْ لا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ» (تا آنگاه که زمین با همه فراخی‌اش بر آنان تنگ شد و جان‌هایشان نیز بر آنان تنگ آمد و دانستند که پناهی از خدا جز به سوی او نیست). و این ذکر اضطرار (اضطرار) و گشایش پس از سختی است.\n\nهمانا زمین خداوند وسیع است\nپس بدبخت است آنکه بر او تنگ آید\n\nسبب تنگی، مخالفت است، پس با او باش\nزیرا بازگشت به سوی اوست\n\nهر که بایستد و با او مخالفت نکند\nتحقیق (تحقیق) در برابر او می‌ایستد\n\nسپس به خاطر توبه‌اش به او می‌بخشد\nهر آنچه در علم و نزد اوست\n\nپس چون حقیقت (حقیقة) خود را فانی سازد\nمطلوب در دو علمش به او می‌آید\n\nدر مقام جمع، هنگامی که برای آن آمد\nتا حکم از دو حکم او باشد\n\nهر آنچه در هستی (کون) از فرزند است\nما از آنان جز دو فرزند او نداریم\n\nپس برادری را به شریعت بگیر و او را ثابت کن\nبرای برادری که به کشف (کشف) از پدر و مادر اوست\n\n***\n\n[همانا تنگی به سبب شریک است، از این رو خداوند نمی‌آمرزد که به او شرک ورزیده شود.]\n\nخداوند متعال فرمود: «وَعَلَى الثَّلاثَةِ الَّذِينَ خُلِّفُوا» (و بر آن سه تن که بازماندند). اگر یک نفر بود، زمین بر او تنگ نمی‌شد، زیرا تنگی تنها به سبب شریک (شریک) رخ می‌دهد. از این رو خداوند نمی‌آمرزد که «أَنْ يُشْرَكَ بِهِ» (به او شرک ورزیده شود)، زیرا شرک آنچه را که از آنِ اوست، از او خارج می‌سازد. به همین دلیل، مشرک، حق (الحق) را چنان به خشم آورد که آن خشم برای او مکانی تنگ به ارث گذاشت، به سبب تنگی‌ای که در خشم وجود دارد. پس برای او و امثال او از مشرکان، این حالت حاصل شد که «مُقَرَّنِينَ فِي الْأَصْفادِ» (در غل و زنجیرها به هم پیوسته‌اند). پس وسعت زمین تنها برای کسی است که در آن منفرد باشد. هنگامی که زمین به صورت مشاع میان سه نفر تقسیم شد، فضای وسیع تنگ گردید. و اگر فردیت (فردية) در آن سه نفر وجود نداشت، هلاک می‌شدند. پس آنان را نجات نداد مگر احدیتی (الأحدية) که در آن سه نفر بود و بر آن دو نفر وارد شد. اما اگر چهار نفر یا دو نفر بودند، نجات نمی‌یافتند و خداوند توبه آنان را نمی‌پذیرفت، زیرا خداوند وتر (فرد) است و وتر را دوست دارد، و سه نیز وتر است. پس از محبّت خود بر آنان باقی گذاشت آنچه را که به واسطه آن توبه آنان را پذیرفت. و اگر خداوند شفع (زوج) را رحمت کند، تنها به واسطه آحاد (یکتایی‌ها) آن را رحمت می‌کند. پس با او یک به یک در خلوت می‌نشیند تا رحمت او را جز واحد (یکتا) درنیابد. پس خداوند بندگانش را به صورت شفع رحمت نمی‌کند، بلکه آنان را یا در فردیت (فردية) یا در احدیت (الأحدية) رحمت می‌کند؛ غیر از این نمی‌شود. و پس از آن هر چه بخواهد انجام می‌دهد. سخن تنها بر واقعیت جاری شده است. اعداد زیاد نمی‌شوند و ظاهر نمی‌گردند مگر به واسطه آحادشان. اگر آحاد از اعداد زائل می‌شدند، در عالم نه شفعی بود و نه عددی. به همین دلیل، تجلی (التجلي) هرگز بر یک شخص یا در دو شخص تکرار نشده است. اگر آن سه نفر نبودند، چشیدن تنگی در وسعت برایشان صحیح نبود، به سبب شفعیتی که در عدد سه وجود دارد. و چشیدن وسعت به واسطه رحمت و توبه نیز برایشان صحیح نبود، به سبب احدیتی که در عدد سه وجود دارد و به واسطه آن فرد بود و اولین فردهاست. پس اولویت از آن اوست و به احدیت نزدیک‌تر است، از این رو رحمت به سرعت به سوی آنان شتافت. اگر پنج نفر بودند، از احدیت دورتر و به دلیل تضاعف شفعیت، تنگی‌شان بیشتر بود. و امر چنین است، افراد ظاهر شدند، هر طور که ظاهر شدند. و این همان چیزی است که کثرت مدت عذاب در آتش را برای اهل آن نفی می‌کند، تا زمانی که هر شفعی را که در فردیتشان وجود دارد، قطع کنند و به آنچه که به آن رسیده‌اند، برسند. پس نهایت اقامت آنان در عذاب، نود و هشت دهر است. سپس اسم الرحمن (الرحمن) پس از آن متولی امر آنان می‌شود، در حالی که آنان در شقاوت از نود و هشت به سوی دو نزول می‌کنند، به تعداد هر شفعی که میان آنهاست. و در هر فردیتی رحمتی است برای کسی که در این دنیا بهره‌ای از آن دارد، پس عذاب به همان اندازه از او سست می‌شود. اما اهل شفع، عذاب از آنان سست نمی‌شود و در آن ناامید (مبلس) هستند تا آن غایتی که خداوند از شفعیت ذکر کرده است، یعنی نود و هشت.\n\nپس وتری که بعد از شفع می‌آید، همان است که انتقام وتر قبل از خود را می‌گیرد، زیرا شفع آن، کسی است که میان دو وتر ظاهر شده است؛ مانند عدد سه که میان دو و چهار است، پس انتقام عدد یک را می‌گیرد که دو آن را شفع کرده است. و مانند عدد پنج که میان چهار و شش است، انتقام عدد سه را می‌گیرد که چهار آن را شفع کرده است تا برای او انتقام بگیرد. زیرا وتر در زبانی که این شریعت محمدیه (الشريعة المحمدية) با آن آمده است، طلب انتقام است. و حکم هر فردی چنین است تا به نود و نه برسد. پس هنگامی که امر در آنجا متوقف شود و در اسم الرحمن (الرحمن) محصور گردد، خداوند با اسم اعظم (الاسم الأعظم) متولی آن می‌شود، زیرا با آن عدد صد کامل می‌شود. پس درجات بهشت و درکات دوزخ را فرا می‌گیرد. و اسم اعظمِ کامل‌کننده، متولی امر نمی‌شود مگر از طریق اسم الرحمن (الرحمن). پس او حاجبِ حجاب است و در برابر اسم اعظم (الاسم الأعظم) منازعی ندارد. در نتیجه، امر به شمول رحمت در هر دو سرا برای ساکنانشان می‌انجامد. و هیچ یک از مشرکان نگفتند: «مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى» (ما آنان را نمی‌پرستیم مگر برای اینکه ما را به خداوند نزدیک گردانند) مگر کسی که از آنان در مقام فردیت (فردية) بود. اما اگر صاحب شفعیه (شفعية) این را بگوید، تنها به دلیل محصور شدن او میان واحدی است که معبودش او را شفع کرده است، و واحدی که این شفع را در استقبالش منفرد می‌سازد. پس این شفع از هر جهتی که روی خود را به آن برگرداند، جز واحدی نمی‌بیند. پس به خود نگریست و جز احدیت (أحدية) خود را ندید. در آن هنگام گفت: «مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى». پس این کلمه از هر مشرکی، چه شفع باشد و چه وتر، به خاطر شریکی که نصب کرده بود، صادر شد. اما کسی که گفت: «إِنَّ اللَّهَ هُوَ الْمَسِيحُ» (همانا خداوند همان مسیح است) یا گفت: «مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي» (من برای شما خدایی جز خودم نمی‌شناسم)، در ظاهر مشرک نیست، بلکه شرک از جهت اسم بر او وارد شده است. به همین دلیل خداوند به پیامبرش (علیه السلام) فرمود: «قُلْ سَمُّوهُمْ» (بگو آنان را نام ببرید). زیرا هنگامی که آنان را نام ببرند، به واسطه اسم خواهند شناخت که مسمّا کیست. پس این گروه گفتند: «إِنَّ اللَّهَ هُوَ الْمَسِيحُ»، در حالی که مسیح از نام‌های خداوند نیست، زیرا او این نام را پیش از آنکه ادعا شود که او خداست، داشت. پس از جهت اسم شرک ورزیدند. و فرعون از آن جهت شرک ورزید که عقد (اعتقاد) او با قولش مخالفت داشت. پس به این سبب مشرک بودند.\n\nسپس این ذکر (ذکر) امری شگفت‌انگیز را برای او به بار می‌آورد که در اوج است، در صندوقچه پنهان و در لایه‌های صندوقچه نقش بسته است، زیرا خداوند آنان را «بازماندگان» (مخلفین) نامید. هر کس که از اهل خود جدا شود، خداوند خلیفه او در آن اهل است، چه او را خلیفه قرار داده باشد و چه قرار نداده باشد. پس هر کس که پس از او در میان اهلش قیام کند، او نایب خداوند است نه نایب آن شخص. پس این سه نفری که بازماندند، اسم ظاهر (الاسم الظاهر) آنان را باز نگرداند، زیرا شریعت آنان را به خروج فراخواند، اما خداوند آنان را بازداشت. پس برخی از آنان کسانی بودند که «كَرِهَ اللَّهُ انْبِعاثَهُمْ فَثَبَّطَهُمْ» (خداوند کراهت داشت که برانگیخته شوند، پس آنان را بازداشت). و برخی دیگر کسانی بودند که خداوند آنان را بازداشت، اما نه از روی کراهت. پس آنان در میان اهل خود به مقام حق (حق) قیام کردند. پس خداوند آنان را به کراهت خودشان، از اسم باطن (الاسم الباطن) خلیفه خود در میان اهلشان قرار داد. پس آنچه که از امرشان بود، رخ داد و «تَابَ اللَّهُ عَلَيْهِمْ» (خداوند توبه آنان را پذیرفت). پس توبه آنان متفاوت بود. از میان آنان کسی بود که در عذر خود دروغگو بود، اما کرم الهی آن را از او پذیرفت. و از آنان کسی بود که راستگو بود و او در دار دنیا بود. پس خداوند در اینجا تلخی صدق را به او چشاند تا معلوم شود چه کسی «يَتَّبِعُ الرَّسُولَ مِمَّنْ يَنْقَلِبُ عَلَى عَقِبَيْهِ» (از رسول پیروی می‌کند و چه کسی به عقب باز می‌گردد). زیرا دنیا سرای بلاست. و خداوند بر همگان رحمت آورد و با رحمت به سوی آنان بازگشت، اما با تفاوت درجات. و خداوند این کار را انجام نداد و ما را از آن آگاه نساخت، مگر برای اینکه ما نیز با بندگانش در تعامل با آنان، دارای آن صفت الهی باشیم. پس هر کس ما را تصدیق کرد، منزلت صدق او را دیدیم. و هر کس به ما دروغ گفت، او را رسوا نکردیم و از دروغش چشم‌پوشی نمودیم و پذیرش سخنش را به او نشان دادیم، زیرا سخن او وجود (وجود) است، پس آن را پذیرفتیم، اما مدلول آن عدم است، پس کسی را نیافتیم که آن را بپذیرد. پس بر برائت اصلیه (البراءة الأصلية) باقی ماندیم، زیرا معدوم منازعی ندارد. پس هر کس این ذکر (ذکر) او باشد و این خُلق را نداشته باشد، هرگز این ذکر را نگفته است. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 3
}