{
  "id": 209,
  "title": {
    "ar": "الباب التاسع ومائتان في المشاهدة",
    "en": "Chapter Two Hundred and Nine: Concerning Witnessing (المشاهدة)",
    "ur": "۲۰۹ واں باب مشاہدہ (المشاھدۃ) کے بیان میں",
    "fa": "باب دویست و نهم در باب مشاهده"
  },
  "content": {
    "ar": "## «الباب التاسع ومائتان في المشاهدة»\n\n\n> إذا أشهدت فأثبت يا غلام *** يصح لك المكانة والمقام‏\n\n\n> فتشهده بعقلك في حجاب *** ومشهده قوي لا يرام‏\n> وتشهده به في كل شي‏ء *** وليس له الوراء ولا الأمام‏\n\n\n> تؤم به وتقصده وما هو *** بمقصود لنا وهو الإمام‏\n\n\n> وتسكن عند رؤيته سكونا *** يكون به التحقق والسلام‏\n\n\n### [المشاهدة رؤية الأشياء بدلائل التوحيد]\n\n\nالمشاهدة عند الطائفة رؤية الأشياء بدلائل التوحيد ورؤيته في الأشياء وحقيقتها اليقين من غير شك قالت بلقيس كَأَنَّهُ هُوَ وهو كان لم يكن غيره فطلبنا عين السبب الموجب لجهلها به حتى قالت كَأَنَّهُ هُوَ فعلمنا إن ذلك حصل لها من وقوفها مع الحركة المعهودة في قطع المسافة البعيدة وهذا القول الذي صدر منها يدل عندي أنها لم تكن كما قيل متولدة بين الإنس والجان إذ لو كانت كذلك لما بعد عليها مثل هذا من حيث علمها بأبيها وما تجده في نفسها من القوة على ذلك حيث كان أبوها من الجان على ما قيل فهذا شهود حاصل وعين مشهودة وعلم ما حصل لأن متعلق العلم المطلوب هنا إنما هو نسبة هذا العرش المشهود إليها كما هو في نفس الأمر ولم تعلم ذلك كما إن أصحاب النبي صلى الله عليه وسلم لما رأت جبريل في صورة دحية ما قالت كأنه هو وإنما قالت هو دحية ولم يكن في نفس الأمر دحية وهذا على النقيض من قصة بلقيس واشتركا في الشهود وعدم العلم بالمشهود من حيث نسبته لا من حيث ما شوهد والسبب في هذا الجهل أنهم ما علموا من دحية إلا الصورة الجسدية لا غير فما علموا دحية على الحقيقة وإنما علموا صورة الجسم التي انطلق عليها اسم دحية وعلى الحقيقة ما انطلق الاسم إلا على الجملة فتخيلوا لما شاهدوا الصورة أن الكل تابع لهذه الصورة وليس الأمر كذلك فإن البصر يقصر عن إدراك الفارق بين القوتين في الشبه إذا حضر أحدهما دون الآخر فلو حضرا معا عنده لفرق بينهما بالمكان والمسألة في نفسها شديدة الغموض ولا سيما في العلم الإلهي لأن النفس الناطقة التي هي روح الإنسان المسماة زيد إلا يستحيل عليها إن تدبر صورتين جسميتين فصاعدا إلى آلاف من الصور الجسمية وكل صورة هي زيد عينها ليست غير زيد ولو اختلفت الصور أو تشابهت لكان المرئي المشهود عين زيد كما تقول في جسم زيد الواحد مع اختلاف أعضائه في الصورة من رأس وجبين وحاجب وعين ووجنة وخد وأنف وفم وعنق ويد ورجل وغير ذلك من جميع أعضائه أي شي‏ء شاهدت منه تقول فيه رأيت زيدا وتصدق كذلك تلك الصور إذا وقعت ويدبرها روح واحد إلا إن الخلل وقع هنا عند الرؤية لعدم اتصال الصور كاتصال الأعضاء في الجسم الواحد فلو شاهد الاتصال الذي بين الصور لقال في كل صورة شهدها هذا زيد كما يفعل المكاشف إذا شاهد نفسه في كل طبقة من طباق الأفلاك لأن له في كل فلك صورة تدبر تلك الصور روح واحدة وهي روح زيد مثلا وهذا شهود حق في خلق قالت الطائفة في المشاهدة إنها تطلق بإزاء ثلاثة معان منها مشاهدة الخلق في الحق وهي رؤية الأشياء بدلائل التوحيد كما قدمناه ومنها مشاهدة الحق في الخلق وهي رؤية الحق في الأشياء ومنها مشاهدة الحق بلا الخلق وهي حقيقة اليقين بلا شك فأما قولهم رؤية الأشياء بدلائل التوحيد فإنهم يريدون أحدية كل موجود ذلك عين الدليل على أحدية الحق فهذا دليل على أحديته لا على عينه وأما إشارتهم إلى رؤية الحق في الأشياء فهو الوجه الذي له سبحانه في كل شي‏ء وهو قوله إِذا أَرَدْناهُ فذلك التوجه هو الوجه الذي له في الأشياء فنفى الأثر فيه عن السبب إن كان أوجده عند سبب مخلوق وأما قولهم حقيقة اليقين بلا شك ولا ارتياب إذا لم تكن المشاهدة في حضرة التمثل كالتجلي الإلهي في الدار الآخرة الذي ينكرونه فإذا تحول لهم في علامة يعرفونه بها أقروا به وعرفوه وهو عين الأول المنكور وهو هذا الآخر المعروف فما أقروا إلا بالعلامة لا به فما عرفوا إلا محصورا فما عرفوا الحق‏\n\n\n### [الفرق بين الرؤية والمشاهدة]\n\n\nولهذا فرقنا بين الرؤية والمشاهدة وقلنا في المشاهدة إنها شهود الشاهد الذي في القلب من الحق وهو الذي قيد بالعلامة والرؤية ليست كذلك ولهذا قال موسى رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ وما قال أشهدني فإنه مشهود له ما غاب عنه وكيف يغيب عن الأنبياء وليس يغيب عن الأولياء العارفين به فقال له لَنْ تَرانِي ولم يكن الجبل بأكرم على الله تعالى من موسى وإنما أحاله على الجبل لما قد ذكر سبحانه في قوله لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ والجبل من الأرض وموسى من الناس فخلق الجبل أكبر من خلق موسى من طريق المعنى أي نسبة الأرض والسماء إلى جانب الحق أكبر من خلق الناس من حيث ما فيهم من‏\nسماء وأرض فإنها في السماء والأرض معنى وصورة وهما في الناس معنى لا صورة والجامع بين المعنى والصورة أكبر في الدلالة ممن انفرد بأحدهما ولهذا قال ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ فالحمد لله الذي جعلنا من القليل الذي يعلم ذلك فجمع الجبل بين الصورة والمعنى فهو أكبر من جبل موسى المعنوي إذ هو نسخة من العالم كما هو كل إنسان فإذا كان الجامع بين الأمرين وهو الأقوى والأحق باسم الجبل صار دكا عند التجلي فكيف يكون موسى حيث جبليته التي هي فيه معنى لا صورة ولما كانت الرؤية لا تصح إلا لمن يثبت لها إذا وقعت والجبل موصوف بالثبوت في نفسه وبالإثبات لغيره إذ كان الجبل هو الذي يسكن ميد الأرض ويقال فلان جبل من الجبال إذا كان يثبت عند الشدائد والأمور العظام فلهذا أحاله على الجبل الذي من صفاته الثبوت فإن ثبت الجبل إذا تجليت إليه فإنك ستراني من حيث ما فيك من ثبوت الجبل‏\n\n\n> فرؤية الله لا تطاق *** فإنها كلها محاق‏\n\n\n> فلو أطاق الشهود خلق *** أطاقه الأرض والطباق‏\n\n\n> فلم تكن رؤيتى شهودا *** وإنما ذلك انفهاق‏\n\n\nقيل لرسول الله صلى الله عليه وسلم أ رأيت ربك قال نوراني أراه‏\n\n\nوذلك أن الكون ظلمة والنور هو الحق المبين والنور والظلمة لا يجتمعان كما لا يجتمع الليل والنهار بل كل واحد منهما يغطي صاحبه ويظهر نفسه فمن رأى النهار لم ير الليل ومن رأى الليل لم ير النهار فالأمر ظاهر وباطن وهو الظاهر والباطن فحق وخلق فإن شهدت خلقا لم تر حقا وإن شهدت حقا لم تر خلقا فلا تشهد خلقا وحقا أبدا لكن يشهد هذا في هذا وهذا في هذا شهود علم لأنه غشاء ومغشي‏\n\n\n«بسم الله الرحمن الرحيم»\n\n",
    "en": "## Chapter Two Hundred and Nine: Concerning Witnessing (المشاهدة)\n\nIf you are witnessed, then be firm, O youth,\nYour station (المكانة) and rank (المقام) will be sound for you.\n\nYou witness Him with your intellect, yet veiled,\nAnd His witnessed presence is strong, not to be sought.\nYou witness Him by Him in everything,\nAnd He has neither a behind nor a front.\n\nYou aim for Him and seek Him, yet He is not\nThe object sought by us, but He is the Leader (الإمام).\n\nAnd you settle into stillness upon seeing Him,\nThrough which realization (التحقق) and peace (السلام) are attained.\n\n### [Witnessing is the Vision of Things through the Proofs of Unity]\n\nWitnessing (المشاهدة), according to the group [Sufis], is the vision of things through the proofs of Unity (التوحيد), and the vision of Him in things. Its reality is Certainty (اليقين) without doubt. Bilqis said: <<It seems like it is he>> [Q 27:42], yet it was He, and there was none other than Him.\n\nWe sought the exact cause necessitating her ignorance of Him, leading her to say: <<It seems like it is he>>. We realized that this occurred because she paused due to the customary movement involved in traversing the long distance. This statement that issued from her indicates, in my view, that she was not, as has been claimed, born of both humans and Jinn. Had she been so, such a matter would not have been obscure to her, given her knowledge of her father and the inherent power she possessed, since her father was said to be of the Jinn.\n\nThis, then, is an attained witnessing, a witnessed essence, and knowledge of what occurred. For the object of knowledge sought here is only the relation of this witnessed throne to her, as it is in reality, and she did not know that. Similarly, when the Companions of the Prophet (peace and blessings be upon him) saw Gabriel in the form of Dihya, they did not say, \"It seems like it is he.\" Rather, they said, \"It is Dihya,\" though in reality, it was not Dihya. This is the opposite of the story of Bilqis, yet they shared in the act of witnessing and the lack of knowledge concerning the witnessed object, specifically regarding its relation, not regarding what was witnessed itself.\n\nThe reason for this ignorance is that they knew nothing of Dihya except the physical form, nothing else. Thus, they did not know Dihya in reality; they only knew the form of the body to which the name Dihya was applied. In reality, the name is applied only to the totality. So, when they witnessed the form, they imagined that the whole was subordinate to this form, but the matter is not so. Indeed, sight falls short of perceiving the difference between two similar powers when only one of them is present, excluding the other. If both were present simultaneously, he would distinguish between them by location.\n\nThe issue itself is extremely obscure, especially in Divine Knowledge (العلم الإلهي). This is because the rational soul (النفس الناطقة), which is the spirit of the human named Zayd, is not incapable of governing two physical forms or more, up to thousands of physical forms. Every form is Zayd himself; it is not other than Zayd, even if the forms differ or resemble one another. The seen and witnessed object would be Zayd himself, just as you say concerning the single body of Zayd, despite the difference in the form of his limbs—head, forehead, eyebrow, eye, cheekbone, cheek, nose, mouth, neck, hand, foot, and all his other limbs. Whatever part of him you witness, you say, \"I saw Zayd,\" and you are truthful. Likewise, those forms, when they occur and are governed by a single spirit, are Zayd. However, the defect here occurred during the vision due to the lack of connection between the forms, like the connection of limbs in a single body. If he were to witness the connection between the forms, he would say of every form he witnessed, \"This is Zayd,\" just as the one granted Unveiling (المكاشف) does when he witnesses himself in every layer of the celestial spheres (الأفلاك), because he has a form in every sphere, and those forms are governed by a single spirit, which is, for example, the spirit of Zayd.\n\nThis is a true witnessing in creation (خلق). The group [Sufis] said that Witnessing (المشاهدة) is applied to three meanings: 1) Witnessing Creation (الخلق) in The Real (الحق), which is the vision of things through the proofs of Unity (التوحيد), as we previously stated. 2) Witnessing The Real (الحق) in Creation (الخلق), which is the vision of The Real in things. 3) Witnessing The Real (الحق) without Creation (الخلق), which is the reality of Certainty (اليقين) without doubt.\n\nAs for their statement, \"the vision of things through the proofs of Unity,\" they mean the Oneness (أحدية) of every existent thing, which is the very proof of the Oneness of The Real. Thus, this is a proof of His Oneness, not of His Essence (عين). As for their reference to the vision of The Real in things, it is the Face (الوجه) that belongs to Him, glory be to Him, in everything, and it is His saying [in the Quran, referring to creation]: <<when We intend it>> [Q 36:82]. That orientation (التوجه) is the Face that belongs to Him in things, thereby negating the effect in it from the cause, even if He brought it into existence alongside a created cause.\n\nAs for their statement, \"the reality of Certainty without doubt or suspicion,\" this applies when the Witnessing (المشاهدة) is not in the Presence of Representation (حضرة التمثل), such as the Divine Theophany (التجلي الإلهي) in the Hereafter, which they deny. Then, when He transforms for them into a sign (علامة) by which they recognize Him, they acknowledge Him and know Him. Yet, He is the very first One they denied, and He is this latter One they recognized. Thus, they acknowledged only the sign, not Him. They knew only what was limited, so they did not know The Real (الحق).\n\n### [The Difference between Vision and Witnessing]\n\nFor this reason, we distinguished between Vision (الرؤية) and Witnessing (المشاهدة). We said concerning Witnessing that it is the witnessing of the Witness (الشاهد) of The Real (الحق) that is in the heart, and it is that which is restricted by the sign. Vision (الرؤية) is not like that.\n\nThis is why Moses said: <<My Lord, show me, that I may look upon You>> [Q 7:143], and he did not say, \"Make me witness,\" for He is witnessed by him and is not absent from him. How could He be absent from the Prophets, when He is not absent from the Saints (الأولياء) who possess Gnosis (العارفين)?\n\nSo He said to him: <<You shall not see Me>> [Q 7:143]. The mountain was not more honored by Allah, the Exalted, than Moses. Rather, He referred him to the mountain because of what He, glory be to Him, mentioned in His saying: <<The creation of the heavens and the earth is greater than the creation of mankind, but most of mankind do not know>> [Q 40:57].\n\nThe mountain is from the earth, and Moses is from mankind. Thus, the creation of the mountain is greater than the creation of Moses in terms of meaning. That is, the relation of the earth and the heavens to the side of The Real is greater than the creation of mankind, in terms of the heaven and earth that are within them. For in the heavens and the earth, they exist as meaning (معنى) and form (صورة), whereas in mankind, they exist as meaning but not as form. That which combines both meaning and form is greater in indication than that which is singular in one of them. For this reason, He said: <<but most of mankind do not know>>. Praise be to Allah, who made us among the few who know this.\n\nThe mountain combines both form and meaning, so it is greater than the metaphorical mountain of Moses, since it is a copy of the Cosmos (العالم), just as every human is. If that which combines both matters—which is the stronger and more deserving of the name 'mountain'—was leveled (دكا) upon the Theophany (التجلي), then how could Moses fare, given that his 'mountain-ness' (جبليته) is in him as meaning, not as form?\n\nSince Vision (الرؤية) is only valid for one who remains firm when it occurs, and the mountain is characterized by firmness (الثبوت) in itself and by establishing firmness for others—for the mountain is what settles the shaking of the earth, and it is said, \"So-and-so is a mountain among mountains,\" when he remains firm during hardships and great affairs—for this reason, He referred him to the mountain, whose characteristic is firmness. \"If the mountain remains firm when I disclose Myself to it, then you will see Me, by virtue of the firmness of the mountain that is within you.\"\n\nFor the vision of Allah cannot be endured,\nSince it is entirely annihilation (محاق).\n\nIf creation could endure the witnessing,\nThe earth and the heavens (الطباق) would endure it.\n\nSo my vision was not witnessing,\nBut rather that was a tearing open (انفهاق).\n\nThe Messenger of Allah (peace and blessings be upon him) was asked, \"Did you see your Lord?\" He replied, \"He is Light (نوراني); how could I see Him?\"\n\nThis is because the cosmos (الكون) is darkness, and the Light (النور) is The Manifest Real (الحق المبين). Light and darkness do not combine, just as night and day do not combine. Rather, each covers its companion and reveals itself. So, whoever sees the day does not see the night, and whoever sees the night does not see the day. The matter is the Manifest (الظاهر) and the Hidden (الباطن), and He is The Manifest and The Hidden. Thus, He is The Real (الحق) and creation (خلق). If you witness creation, you do not see The Real. If you witness The Real, you do not see creation. Therefore, you never witness creation and The Real simultaneously. Rather, one witnesses this in that, and that in this, a witnessing of Knowledge (علم), because one is a veil (غشاء) and the other is veiled (مغشي).\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "«باب نمبر دو سو نو مشاہدہ (المشاهدة) کے بیان میں»\n\nجب تجھے شہود حاصل ہو تو اے جوان! ثابت قدم رہ *** تاکہ تیرا مقام اور مرتبہ درست ہو جائے۔\n\nتو اسے اپنی عقل سے پردے میں دیکھتا ہے *** اور اس کا مشاہدہ (مشهده) قوی ہے، جس کا ارادہ نہیں کیا جا سکتا۔\nاور تو اسے اس (ذات حق) کے ذریعے ہر شے میں دیکھتا ہے *** اور اس کے لیے نہ کوئی پیچھے ہے اور نہ کوئی آگے ہے۔\n\nتو اس کے ذریعے قصد کرتا ہے اور اس کی طرف متوجہ ہوتا ہے، حالانکہ وہ ہمارے لیے مقصود نہیں ہے *** اور وہی امام ہے۔\n\nاور تو اس کی رؤیت (رؤيته) کے وقت ایسا سکون اختیار کرتا ہے *** جس سے تحقق اور سلامتی حاصل ہوتی ہے۔\n\n### [مشاہدہ (المشاهدة) اشیاء کو دلائل توحید کے ساتھ دیکھنا ہے]\n\nمشاہدہ (المشاهدة) اہلِ طریقت کے نزدیک اشیاء کو دلائل توحید (التوحيد) کے ساتھ دیکھنا ہے، اور اشیاء میں ذات حق (الحق) کی رؤیت کرنا ہے، اور اس کی حقیقت شک کے بغیر یقین ہے۔ بلقیس نے کہا: كَأَنَّهُ هُوَ (گویا کہ وہ وہی ہے)۔ حالانکہ وہ وہی تھا، اس کے سوا کوئی اور نہیں تھا۔ ہم نے اس سبب کی اصل تلاش کی جو اس کی جہالت کا باعث بنا کہ اس نے کہا: كَأَنَّهُ هُوَ (گویا کہ وہ وہی ہے)۔ پس ہمیں معلوم ہوا کہ یہ اسے اس لیے حاصل ہوا کہ وہ دور دراز مسافت طے کرنے میں معمول کی حرکت پر ٹھہر گئی تھی۔\n\nیہ قول جو اس سے صادر ہوا، میرے نزدیک اس بات کی دلیل ہے کہ وہ ایسی نہیں تھی جیسا کہ کہا جاتا ہے کہ وہ انسان اور جن کے ملاپ سے پیدا ہوئی تھی، کیونکہ اگر وہ ایسی ہوتی تو اس کے لیے یہ بات مشکل نہ ہوتی، اس علم کی بنا پر جو اسے اپنے والد کے بارے میں تھا اور اس قوت کی بنا پر جو وہ اپنے اندر پاتی تھی، کیونکہ اس کا والد جنوں میں سے تھا جیسا کہ کہا جاتا ہے۔\n\nپس یہ ایک حاصل شدہ شہود (شهود) ہے، اور ایک مشہود (مشهودة) عین ہے، اور اس علم کا حصول ہے جو مطلوب ہے۔ کیونکہ یہاں مطلوب علم کا تعلق اس مشہود تخت (عرش) کی نسبت سے ہے جیسا کہ وہ حقیقت میں ہے، اور اسے اس کا علم نہیں ہوا۔\n\nجیسا کہ نبی اکرم صلی اللہ علیہ وسلم کے صحابہ نے جب جبریل کو دحیہ کلبی کی صورت میں دیکھا تو انہوں نے یہ نہیں کہا کہ گویا وہ دحیہ ہیں، بلکہ انہوں نے کہا کہ یہ دحیہ ہیں۔ حالانکہ حقیقت میں وہ دحیہ نہیں تھے۔ یہ واقعہ بلقیس کے قصے کے بالکل برعکس ہے، لیکن دونوں شہود (الشهود) اور مشہود کے علم سے محرومی میں شریک ہیں، اس کی نسبت کے اعتبار سے نہ کہ اس کے اعتبار سے جو دیکھا گیا۔\n\nاس جہالت کا سبب یہ ہے کہ انہوں نے دحیہ کے بارے میں صرف جسمانی صورت کو جانا، اور کچھ نہیں۔ پس انہوں نے دحیہ کو حقیقت میں نہیں جانا، بلکہ انہوں نے صرف جسم کی اس صورت کو جانا جس پر دحیہ کا نام بولا جاتا ہے۔ حالانکہ حقیقت میں نام صرف مجموعے پر بولا جاتا ہے۔ پس جب انہوں نے صورت کا مشاہدہ کیا تو انہوں نے یہ گمان کیا کہ سب کچھ اسی صورت کے تابع ہے، حالانکہ ایسا نہیں ہے۔ کیونکہ بصارت دو قوتوں کے درمیان فرق کو سمجھنے سے قاصر رہتی ہے جب مشابہت ہو اور ان میں سے ایک موجود ہو اور دوسرا نہ ہو۔ اگر دونوں ایک ساتھ موجود ہوتے تو وہ مقام کے ذریعے ان میں فرق کر لیتے۔\n\nیہ مسئلہ بذات خود انتہائی مبہم ہے، خاص طور پر علم الٰہی (العلم الإلهي) میں۔ کیونکہ نفس ناطقہ، جو انسان کی روح ہے اور جسے زید کا نام دیا جاتا ہے، اس کے لیے یہ ناممکن نہیں ہے کہ وہ دو یا اس سے زیادہ جسمانی صورتوں کی تدبیر کرے، یہاں تک کہ ہزاروں جسمانی صورتوں کی۔ اور ہر صورت بعینہٖ زید ہی ہے، زید کے علاوہ کوئی اور نہیں، خواہ صورتیں مختلف ہوں یا مشابہ ہوں۔ پس جو کچھ دیکھا گیا اور مشاہدہ کیا گیا وہ بعینہٖ زید ہی ہوگا، جیسا کہ تم زید کے ایک جسم کے بارے میں کہتے ہو، باوجود اس کے کہ اس کے اعضاء کی صورتیں مختلف ہیں، جیسے سر، پیشانی، بھنویں، آنکھ، رخسار، گال، ناک، منہ، گردن، ہاتھ، پاؤں اور دیگر تمام اعضاء۔ تم اس کا جو بھی حصہ دیکھتے ہو، اس کے بارے میں کہتے ہو کہ میں نے زید کو دیکھا، اور یہ سچ ہے۔ اسی طرح وہ صورتیں بھی سچی ہیں جب وہ واقع ہوں اور ان کی تدبیر ایک ہی روح کر رہی ہو۔\n\nمگر یہاں رؤیت کے وقت خلل واقع ہوا، کیونکہ صورتوں کا اتصال اس طرح نہیں تھا جیسے ایک جسم کے اعضاء کا اتصال ہوتا ہے۔ اگر وہ صورتوں کے درمیان اتصال کا مشاہدہ کرتا تو وہ ہر اس صورت کے بارے میں جو اس نے دیکھی، کہتا کہ یہ زید ہے، جیسا کہ مکاشف (الکاشف) کرتا ہے جب وہ اپنے آپ کو افلاک کے ہر طبقے میں دیکھتا ہے، کیونکہ اس کے لیے ہر فلک میں ایک صورت ہے، اور ان تمام صورتوں کی تدبیر ایک ہی روح کرتی ہے، مثلاً زید کی روح۔ اور یہ خلق میں حق کا شہود (شهود حق في خلق) ہے۔\n\nاہلِ طریقت نے مشاہدہ (المشاهدة) کے بارے میں کہا ہے کہ یہ تین معانی کے لیے استعمال ہوتا ہے:\n۱۔ خلق میں حق کا مشاہدہ (مشاهدة الخلق في الحق): اور یہ اشیاء کو دلائل توحید (التوحيد) کے ساتھ دیکھنا ہے، جیسا کہ ہم نے پہلے بیان کیا۔\n۲۔ حق میں خلق کا مشاہدہ (مشاهدة الحق في الخلق): اور یہ اشیاء میں ذات حق (الحق) کی رؤیت ہے۔\n۳۔ خلق کے بغیر حق کا مشاہدہ (مشاهدة الحق بلا الخلق): اور یہ شک کے بغیر یقین کی حقیقت ہے۔\n\nجہاں تک ان کے قول \"اشیاء کو دلائل توحید کے ساتھ دیکھنا\" کا تعلق ہے، تو ان کی مراد ہر موجود کی احدیت ہے، جو کہ ذات حق (الحق) کی احدیت پر بعینہٖ دلیل ہے۔ پس یہ اس کی احدیت پر دلیل ہے، نہ کہ اس کی عین ذات پر۔\n\nاور جہاں تک ان کے اشارے \"اشیاء میں ذات حق کی رؤیت\" کا تعلق ہے، تو یہ وہ وجہ ہے جو ہر شے میں اس (ذات حق) کے لیے ہے۔ اور یہ اس کا قول ہے: إِذا أَرَدْناهُ (جب ہم اس کا ارادہ کرتے ہیں)۔ پس یہ توجہ ہی وہ وجہ ہے جو اشیاء میں اس کے لیے ہے۔ پس اس نے اس میں اثر کو سبب سے نفی کر دیا، اگرچہ اس نے اسے کسی مخلوق سبب کے ذریعے پیدا کیا ہو۔\n\nاور جہاں تک ان کے قول \"شک اور تردد کے بغیر یقین کی حقیقت\" کا تعلق ہے، تو یہ تب ہے جب مشاہدہ (المشاهدة) تمثل کی حضوری میں نہ ہو، جیسے آخرت میں ظہور الٰہی (التجلي الإلهي) ہوگا، جس کا وہ انکار کرتے ہیں۔ پھر جب وہ کسی علامت میں ان کے لیے تبدیل ہوگا تو وہ اسے پہچان لیں گے اور اس کا اقرار کریں گے۔ اور وہ بعینہٖ وہی پہلا منکر ہے، اور یہی وہ دوسرا معروف ہے۔ پس انہوں نے صرف علامت کا اقرار کیا، نہ کہ اس کا۔ پس انہوں نے صرف محدود کو جانا، ذات حق (الحق) کو نہیں جانا۔\n\n### [رؤیت (الرؤية) اور مشاہدہ (المشاهدة) میں فرق]\n\nاسی لیے ہم نے رؤیت (الرؤية) اور مشاہدہ (المشاهدة) میں فرق کیا، اور ہم نے مشاہدہ (المشاهدة) کے بارے میں کہا کہ یہ اس شاہد کا شہود (شهود) ہے جو دل میں ذات حق (الحق) کی طرف سے ہے، اور یہی وہ ہے جو علامت کے ساتھ مقید کیا گیا ہے۔ جبکہ رؤیت (الرؤية) ایسی نہیں ہے۔\n\nاسی لیے موسیٰ علیہ السلام نے کہا: رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ (اے میرے رب! مجھے دکھا تاکہ میں تجھے دیکھوں)۔ اور انہوں نے یہ نہیں کہا کہ مجھے مشاہدہ (أشهدني) کرا، کیونکہ وہ ان کے لیے مشہود تھا، وہ ان سے غائب نہیں تھا۔ اور وہ انبیاء سے کیسے غائب ہو سکتا ہے، حالانکہ وہ اس کے عارف اولیاء سے بھی غائب نہیں ہوتا؟\n\nپس اللہ تعالیٰ نے ان سے فرمایا: لَنْ تَرانِي (تم مجھے ہرگز نہیں دیکھ سکو گے)۔ اور پہاڑ اللہ تعالیٰ کے نزدیک موسیٰ علیہ السلام سے زیادہ مکرم نہیں تھا۔ بلکہ اللہ تعالیٰ نے انہیں پہاڑ کی طرف اس لیے متوجہ کیا جو اس نے اپنے اس قول میں ذکر فرمایا ہے: لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (بیشک آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے، لیکن اکثر لوگ نہیں جانتے)۔ اور پہاڑ زمین میں سے ہے اور موسیٰ لوگوں میں سے ہیں۔ پس پہاڑ کی تخلیق موسیٰ کی تخلیق سے بڑی ہے، معنی کے اعتبار سے۔ یعنی زمین اور آسمان کی نسبت ذات حق (الحق) کی جانب لوگوں کی تخلیق سے بڑی ہے، اس اعتبار سے کہ لوگوں میں جو آسمان اور زمین ہے، وہ آسمان اور زمین میں معنی اور صورت دونوں کے اعتبار سے ہے، جبکہ لوگوں میں وہ صرف معنی کے اعتبار سے ہے، صورت کے اعتبار سے نہیں۔ اور جو معنی اور صورت دونوں کو جمع کرنے والا ہو، وہ اس سے بڑا ہوتا ہے جو ان میں سے صرف ایک کے ساتھ منفرد ہو۔ اسی لیے اللہ تعالیٰ نے فرمایا: وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (لیکن اکثر لوگ نہیں جانتے)۔\n\nپس تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں ان قلیل لوگوں میں شامل کیا جو یہ جانتے ہیں۔ پس پہاڑ نے صورت اور معنی دونوں کو جمع کیا، لہٰذا وہ موسیٰ کی معنوی جبلیت سے بڑا ہے۔ کیونکہ وہ (موسیٰ) عالم کی ایک نقل ہیں، جیسا کہ ہر انسان ہے۔ پس جب دو چیزوں کو جمع کرنے والا، جو کہ زیادہ قوی اور پہاڑ کے نام کا زیادہ حقدار ہے، ظہور الٰہی (التجلی) کے وقت ریزہ ریزہ ہو گیا، تو موسیٰ کا کیا حال ہوگا، جبکہ ان کی جبلیت ان میں صرف معنی کے اعتبار سے ہے نہ کہ صورت کے اعتبار سے؟\n\nاور چونکہ رؤیت (الرؤية) صرف اسی کے لیے درست ہوتی ہے جو اس کے واقع ہونے پر اس کے لیے ثابت قدم رہے، اور پہاڑ اپنی ذات میں ثبات کے ساتھ موصوف ہے اور دوسروں کے لیے بھی ثبات کا باعث ہے، کیونکہ پہاڑ ہی زمین کے ڈولنے کو روکتا ہے۔ اور کہا جاتا ہے کہ فلاں شخص پہاڑوں میں سے ایک پہاڑ ہے، جب وہ سختیوں اور بڑے معاملات میں ثابت قدم رہتا ہے۔ اسی لیے اللہ تعالیٰ نے انہیں پہاڑ کی طرف متوجہ کیا جس کی صفات میں ثبات ہے۔ پس اگر پہاڑ ثابت رہا جب میں اس پر ظہور الٰہی (تجلی) کروں گا، تو تم مجھے دیکھ سکو گے، اس ثبات کی وجہ سے جو تم میں پہاڑ کی طرف سے ہے۔\n\nپس اللہ کی رؤیت (رؤية الله) کی طاقت نہیں ہے *** کیونکہ وہ سب کی سب مٹ جانے والی ہے۔\n\nاگر کوئی مخلوق شہود (الشهود) کی طاقت رکھتی *** تو زمین اور طبقات (آسمان) اس کی طاقت رکھتے۔\n\nپس میری رؤیت (رؤيتى) شہود نہیں تھی *** بلکہ وہ تو ایک پھٹ جانا (انفہاق) تھا۔\n\nرسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا: أ رأيت ربك (کیا آپ نے اپنے رب کو دیکھا)؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نوراني أراه (میں اسے نور کی صورت میں دیکھتا ہوں)۔\n\nاور یہ اس لیے کہ کائنات ظلمت ہے اور نور ہی ذات حق (الحق) مبین ہے۔ اور نور اور ظلمت جمع نہیں ہو سکتے، جیسے رات اور دن جمع نہیں ہو سکتے، بلکہ ان میں سے ہر ایک اپنے ساتھی کو ڈھانپ لیتا ہے اور خود کو ظاہر کرتا ہے۔ پس جس نے دن کو دیکھا اس نے رات کو نہیں دیکھا، اور جس نے رات کو دیکھا اس نے دن کو نہیں دیکھا۔\n\nپس امر ظاہر بھی ہے اور باطن بھی، اور وہی الظاہر اور الباطن ہے۔ پس حق (حق) اور خلق (خلق) ہیں۔ اگر تم خلق کا شہود (شہدت خلقا) کرو گے تو حق کو نہیں دیکھو گے، اور اگر تم حق کا شہود (شہدت حقا) کرو گے تو خلق کو نہیں دیکھو گے۔ پس تم کبھی بھی خلق اور حق کا ایک ساتھ شہود نہیں کر سکتے۔ بلکہ اس (حق) کا شہود اس (خلق) میں ہوتا ہے، اور اس (خلق) کا شہود اس (حق) میں ہوتا ہے، یہ علم کا شہود ہے، کیونکہ وہ غشاء (پردہ) ہے اور مغشی (پردے میں چھپا ہوا) ہے۔\n\n«شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے»",
    "fa": "باب دویست و نهم در مشاهده (المشاهدة)\n\nای جوان، چون به شهود رسیدی، ثابت‌قدم باش *** تا مقام و منزلت برایت صحیح گردد.\n\nپس او را با عقلت در حجاب مشاهده می‌کنی *** و مشهود او نیرومند است و دست‌نیافتنی.\nو او را به واسطه خودش در هر چیزی مشاهده می‌کنی *** و برای او نه پشت است و نه پیش.\n\nبه واسطه او قصد می‌کنی و به سوی او می‌روی، در حالی که او *** مقصود ما نیست، و او امام (پیشوا) است.\n\nو هنگام رؤیت او به آرامشی می‌رسی *** که با آن، تحقق (التحقق) و سلامتی حاصل می‌شود.\n\n### [مشاهده، رؤیت اشیاء به دلایل توحید است]\n\nمشاهده (المشاهدة) نزد این طایفه (صوفیه)، دیدن اشیاء به واسطه دلایل توحید (التوحید) و دیدن حق (الحق) در اشیاء است، و حقیقت آن، یقین بدون شک است. بلقیس گفت: «كَأَنَّهُ هُوَ» (گویی خود اوست) [النمل: ۴۲]، در حالی که او همان بود و غیر او نبود. ما به دنبال علت اصلی جهل او گشتیم که باعث شد بگوید: «كَأَنَّهُ هُوَ». دانستیم که این امر به دلیل توقف او بر حرکت معمول در پیمودن مسافت دور حاصل شده است. این سخنی که از او صادر شد، نزد من دلالت بر آن دارد که او آن‌گونه که گفته شده، متولد شده از انسان و جن نبوده است؛ زیرا اگر چنین بود، این امر بر او دشوار نمی‌آمد، از آن جهت که پدرش را می‌شناخت و نیرویی را که در خود می‌یافت (چون پدرش بنا بر آنچه گفته شده، از جن بود). پس این شهودی است حاصل، و عین مشهودی است، و علمی است که به دست آمده است؛ زیرا متعلق علم مطلوب در اینجا، تنها نسبت این عرش مشهود به اوست، همان‌گونه که در نفس‌الامر است، و او این را ندانست.\n\nهمان‌طور که اصحاب پیامبر (صلی الله علیه و سلم) وقتی جبرئیل را در صورت دحیه دیدند، نگفتند گویی اوست، بلکه گفتند او دحیه است، در حالی که در نفس‌الامر دحیه نبود. این بر خلاف داستان بلقیس است، اما هر دو در شهود و عدم علم به مشهود از حیث نسبت آن (نه از حیث آنچه مشاهده شد) مشترک بودند. علت این جهل آن است که آنان از دحیه جز صورت جسمانی را ندانستند و بس. پس دحیه را بر حقیقت نشناختند، بلکه صورت جسمی را شناختند که نام دحیه بر آن اطلاق شده بود، در حالی که در حقیقت، نام جز بر کل اطلاق نمی‌شود. پس وقتی صورت را مشاهده کردند، گمان بردند که کل تابع این صورت است، در حالی که امر چنین نیست. زیرا چشم از درک تفاوت میان دو نیرو در شباهت، هنگامی که یکی از آن‌ها بدون دیگری حاضر باشد، قاصر است. اما اگر هر دو نزد او حاضر می‌شدند، به واسطه مکان میان آن‌ها تفاوت می‌گذاشت. این مسئله ذاتاً بسیار مبهم است، به ویژه در علم الهی؛ زیرا نفس ناطقه که روح انسان نامیده شده به زید است، محال نیست که دو صورت جسمانی و بیشتر، تا هزاران صورت جسمانی را تدبیر کند، و هر صورتی عین زید است و غیر زید نیست. اگرچه صورت‌ها متفاوت یا شبیه باشند، مرئیِ مشهود عین زید خواهد بود، همان‌طور که درباره جسم واحد زید می‌گویی، با وجود اختلاف اعضای آن در صورت (از سر و پیشانی و ابرو و چشم و گونه و لپ و بینی و دهان و گردن و دست و پا و سایر اعضا)، هر جزئی را که از او ببینی، می‌گویی: «زید را دیدم» و این صادق است. همچنین آن صورت‌ها نیز صادق‌اند، هنگامی که واقع شوند و یک روح آن‌ها را تدبیر کند. جز اینکه خلل در اینجا هنگام رؤیت، به دلیل عدم اتصال صورت‌ها، مانند اتصال اعضا در یک جسم واحد، رخ داده است. اگر اتصال میان صورت‌ها را مشاهده می‌کرد، در مورد هر صورتی که می‌دید، می‌گفت: «این زید است»، همان‌طور که مکاشف عمل می‌کند، وقتی خود را در هر طبقه‌ای از طبقات افلاک مشاهده می‌کند؛ زیرا او در هر فلکی صورتی دارد که یک روح واحد آن صورت‌ها را تدبیر می‌کند، و آن روح، مثلاً روح زید است. این شهود حق (الحق) در خلق است.\n\nطایفه (صوفیه) درباره مشاهده (المشاهدة) گفته‌اند که آن به سه معنا اطلاق می‌شود:\n۱. مشاهده خلق در حق (الحق): که همان رؤیت اشیاء به دلایل توحید (التوحید) است، چنانکه پیش‌تر بیان کردیم.\n۲. مشاهده حق در خلق: که همان رؤیت حق (الحق) در اشیاء است.\n۳. مشاهده حق بدون خلق: که همان حقیقت یقین بدون شک است.\n\nاما قول آن‌ها مبنی بر «رؤیت اشیاء به دلایل توحید»، منظورشان احدیت هر موجودی است که عین دلیل بر احدیت حق (الحق) است. پس این دلیل بر احدیت اوست، نه بر عین او. و اما اشاره آن‌ها به «رؤیت حق در اشیاء»، همان وجهی است که برای او سبحانه در هر چیزی وجود دارد، و این همان قول اوست: «إِذا أَرَدْناهُ» (چون آن را اراده کنیم). پس آن توجه، همان وجهی است که او در اشیاء دارد، و اثر را از سبب نفی می‌کند، اگرچه آن را نزد سبب مخلوقی ایجاد کرده باشد. و اما قول آن‌ها مبنی بر «حقیقت یقین بدون شک و تردید»، هنگامی است که مشاهده در حضرت تمثل نباشد، مانند تجلی (التجلی) الهی در سرای آخرت که آن را انکار می‌کنند. پس چون برایشان در نشانه‌ای متحول شود که آن را با آن می‌شناسند، به آن اقرار می‌کنند و آن را می‌شناسند، در حالی که آن عین همان اولِ انکار شده است و همین آخرِ شناخته شده است. پس آن‌ها جز به نشانه اقرار نکردند، نه به خود او. پس جز محصور را نشناختند، و حق (الحق) را نشناختند.\n\n### [تفاوت میان رؤیت و مشاهده]\n\nبه همین دلیل، ما بین رؤیت و مشاهده (المشاهدة) فرق گذاشتیم و درباره مشاهده گفتیم که آن شهودِ شاهدی است که از حق (الحق) در قلب است، و این همان است که به نشانه مقید شده است، در حالی که رؤیت چنین نیست. و به همین دلیل موسی گفت: «رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ» (پروردگارا، خود را به من بنما تا تو را ببینم) [الأعراف: ۱۴۳] و نگفت مرا به شهود برسان؛ زیرا او مشهود موسی بود و از او غایب نبود. چگونه از انبیاء غایب باشد، در حالی که از اولیای عارف به او نیز غایب نیست؟ پس به او فرمود: «لَنْ تَرانِي» (هرگز مرا نخواهی دید) [الأعراف: ۱۴۳]. کوه نزد خداوند متعال گرامی‌تر از موسی نبود، بلکه او را به کوه ارجاع داد به دلیل آنچه خداوند سبحان در این آیه ذکر کرده است: «لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ» (آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است، ولی بیشتر مردم نمی‌دانند) [غافر: ۵۷].\n\nو کوه از زمین است و موسی از مردم. پس آفرینش کوه از نظر معنایی بزرگ‌تر از آفرینش موسی است؛ یعنی نسبت زمین و آسمان به جانب حق (الحق) بزرگ‌تر از آفرینش مردم است، از آن جهت که در مردم نیز آسمان و زمین وجود دارد. زیرا آسمان و زمین در خودشان هم معنا و هم صورت هستند، در حالی که در انسان‌ها تنها معنا هستند نه صورت. و جامع میان معنا و صورت در دلالت، بزرگ‌تر از کسی است که تنها به یکی از آن دو منفرد باشد. به همین دلیل فرمود: «ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ» (ولی بیشتر مردم نمی‌دانند). پس سپاس خدایی را که ما را از اندکی قرار داد که این را می‌دانند. پس کوه، معنا و صورت را با هم جمع کرده است، و از کوهیت معنوی موسی بزرگ‌تر است، زیرا او (موسی) نسخه‌ای از عالم است، همان‌طور که هر انسانی چنین است. پس اگر جامع میان دو امر که قوی‌تر و سزاوارتر به نام کوه است، هنگام تجلی (التجلی) متلاشی (دک) شد، حال موسی چگونه خواهد بود، در حالی که کوهیت او (جبلیته) در او تنها معناست نه صورت؟ و چون رؤیت تنها برای کسی صحیح است که هنگام وقوع آن، ثبات داشته باشد، و کوه به ثبات در ذات خود و به ثبات بخشیدن به غیر خود موصوف است (زیرا کوه همان است که لرزش زمین را آرام می‌کند و گفته می‌شود فلان شخص کوهی از کوه‌هاست، اگر در برابر سختی‌ها و امور عظیم ثابت‌قدم باشد)، به همین دلیل او را به کوه ارجاع داد که صفتش ثبوت است: «اگر کوه هنگام تجلی من بر آن، ثابت ماند، تو نیز مرا خواهی دید، از آن جهت که در تو ثبات کوه وجود دارد.»\n\nپس رؤیت خداوند طاقت‌فرساست *** زیرا تمام آن نابودی (محاق) است.\n\nاگر خلقی توان شهود داشت *** زمین و طبقات آسمان توان آن را داشتند.\n\nپس رؤیت من شهود نبود *** بلکه آن گشایش و شکافته شدن بود.\n\nاز رسول خدا (صلی الله علیه و سلم) پرسیده شد: آیا پروردگارت را دیدی؟ فرمود: «نورانی است که او را می‌بینم.»\n\nو این بدان سبب است که کائنات ظلمت است و نور، حق (الحق) آشکار است. نور و ظلمت با هم جمع نمی‌شوند، همان‌طور که شب و روز جمع نمی‌شوند، بلکه هر یک دیگری را می‌پوشاند و خود را آشکار می‌سازد. پس هر کس روز را ببیند، شب را نمی‌بیند، و هر کس شب را ببیند، روز را نمی‌بیند. پس امر، ظاهر و باطن است، و او (حق) الظاهر و الباطن است. پس حق (الحق) و خلق (الخلق) است. اگر خلق را شهود کنی، حق را نمی‌بینی، و اگر حق را شهود کنی، خلق را نمی‌بینی. پس هرگز خلق و حق را با هم شهود نمی‌کنی، بلکه این را در آن و آن را در این شهود می‌کنی، شهودِ علم، زیرا یکی پوشش (غشاء) و دیگری پوشیده (مغشی) است."
  },
  "page_count": 3
}