{
  "id": 422,
  "title": {
    "ar": "الباب الثاني والعشرون وأربعمائة في معرفة منازلة من رد إلي فعلى فقد أعطاني حقي وأنصفني من مالي عليه",
    "en": "Chapter Four Hundred and Twenty-Two: Concerning the Gnosis of the Station of him who returns My Act (فعلي) to Me, for he has given Me My Right and done Me Justice regarding My Claim against him.",
    "ur": "باب چار سو بائیس، اس شخص کے مقام کی معرفت میں جو میرے فعل کو میری طرف لوٹاتا ہے، تو اس نے مجھے میرا حق دیا اور اس نے مجھے اس چیز میں انصاف دیا جو اس پر میرا واجب ہے۔",
    "fa": "باب چهارصد و بیست و دوم در معرفت منازل کسی که به فعل من بازگردانده شد، پس حق مرا به من داد و در مورد آنچه بر عهده او بود، با من به انصاف رفتار کرد."
  },
  "content": {
    "ar": "## «الباب الثاني والعشرون وأربعمائة في معرفة منازلة من رد إلي فعلى فقد أعطاني حقي وأنصفني من مالي عليه»\n\n\n> إني رأيت وجود الست أدريه *** وهو الوجود الذي أعياننا فيه‏\n\n\n> الفعل بيني وبين الحق مشترك *** فيما يظن وفيه بعض ما فيه‏\n\n\n> إني سمعت كلاما غير منقطع *** فينا وفي عالم الأكوان من فيه‏\n\n\n> بسمعه لا بسمعي إنني عدم *** وقد توجه حق ما نوفيه‏\n\n\n> له وكيل علي من لا وجود له *** يبليه وقتا وفي وقت يعافيه‏\n\n\n> ولا يزال به ما دام متصفا *** بالكون في عينه حتى يوافيه‏\n\n\n> على نقيض مقام ليس يعرفه *** وليس في نفسه أمر ينافيه‏\n\n\n> أنا وإياه موجودان في قرن *** ولا يزال عدوي أو نصافيه‏\n\n\n> فالأمر مفترق والأمر مجتمع *** والجود لا يبدو إلا من مكافيه‏\n\n\n> إني رمزت أمورا ليس يعرفها *** إلا الذي قيل فيه إنه فيه‏\n\n\n> وليس يعلم ما أبدية من عجب *** إلا الوجود الذي حار الورى فيه‏\n\n\n> فالحمد لله لا أبغي به بدلا *** وليس يدريه إلا من يكافيه‏\n\n\n### [أن الفعل الذي يشهد به الحس أنه للعبد هو لله تعالى لا للعبد]\n\n\nقال الله تعالى وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ وقال فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ وقال لنبيه صَلَّى اللهُ عَليهِ وسَلَّم في رميه التراب في أعين المشركين وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ وقال بَلْ لِلَّهِ الْأَمْرُ جَمِيعاً فعهد تعالى إلى أن الفعل الذي يشهد به الحس أنه للعبد هو لله تعالى لا للعبد فإن أضفته لنفسي فإنما أضيفه إلى نفسي بإضافة الله لا بإضافتي فأنا أحكي وأترجم عن الله به وهو قوله والله خَلَقَكُمْ وما تَعْمَلُونَ فرد الفعل الذي أضافه إلي إلى نفسه وهو حقه الذي له قبلي بهذه الإضافة ولكن لا بد من ميزان إلهي نرده به إليه فإن الله تعالى لما رفع السماء وضع الميزان‏\nفي سباحة الكواكب في أفلاكها التي هي طرق في السموات لتجري بالمقادير الكائنة في العالم على قدر معلوم لا تتعداه فهي تعطي وتمنع بذلك الميزان الذي وضع الحق لها لأنها تشاهد الميزان الذي بيد الحق حين يخفض به ويرفع فإذا نظرت إلى من رفعه الحق بميزانه أعطته ما يستحقه مقام الرفع وإذا رأت الحق يضع بميزانه من شاء أعطته ما يستحقه مقام الوضع وذلك هو التسخير الذي ورد في القرآن في النجوم أنها مُسَخَّراتٍ بِأَمْرِهِ‏\n\n\n### [أن المكلفين هم المقصودون بالخطاب والتكليف الإلهي‏]\n\n\nفتعلم أن المكلفين هم المقصودون بالخطاب والتكليف فإنهم محل العقاب والثواب بخلاف سائر المخلوقين وذلك للحجاب الذي ضرب الله بينهم وبين مشاهدة الأمور منهم ومن سائر المخلوقات إنها لله لا لهم فلما أدعوها أضافها الحق إليهم بحسب دعواهم وكلفهم ابتلاء منه لدعواهم فمن كشف الله عن بصيرته ورأى الأفعال كلها لله لم ير الا حسنا منه ومن سائر المخلوقات وأن الله هو الصادق فقال إن الله لا يضيع أَجْرَ من أَحْسَنَ عَمَلًا فطلبنا على الإحسان ما هو فورد\n\n\nفي الخبر الصحيح أن الإحسان هو أن نعبد الله كأنا نراه‏\n\n\nفنشرع في العمل على الحجاب فإذا رأينا المعمول له رأينا العمل صادرا منه فينا ما نحن العاملين فلما رأينا هذا خفنا من مزلة القدم فيما سماه من أفعاله حسنا وسيئا وعلمنا أنه ما أضاف العمل إلينا إلا لدعوانا في الأفعال إنها لنا فإذا حصلنا في هذا المقام من الشهود فما كان من حسن أضفناه إليه تعالى خلقا فينا وأضفناه إلينا من كوننا محلا لظهوره وإن كان سيئا ذلك العمل أضفناه إلينا بإضافة الله فنكون حاكين قول الله فيرينا الله حسن ما في ذلك المسمى سوء فبدل الله سيئاتنا حسنات وما هو إلا تبديل الحكم لا تبديل العين ثم إنه جميع ما طرأ منا في هذا كله من نظر ورد واحد فهو بهذه المثابة فإن ذلك كله فعل ظهر فينا ونحن أهل شهود فليس لنا إلا الاستعداد الذي نحن عليه لقبول ما يخلق فيه من الأفعال المنسوبة في الشهود كما هي في سائر المخلوقات عند المخلوقات الذين يقولون مطرنا بفضل الله ورحمته بالوزن الذي جعله في سباحة كوكب من الكواكب وما قدره الله له من المنازل التي ينزل فيها والمحجوب عن هذا لمقام يقول مطرنا بنوء كذا وكذا فيذكر الكوكب المجبور في ذلك ويضيف ما ظهر من المطر الصائب إليه كما يضيف أفعاله خلقا إلى نفسه فسمي عند ذلك بأنه كافر بالله مؤمن بمن رأى الفعل منه ويسمى الأول مؤمنا بالله كافرا بمن رأى الحس الفعل صادرا منه من حيث ما هو محل ومن المكلفين من ليس له هذا الشهود ولا تركه الايمان يقف مع الحجاب الذي على عينه فيقول مثل ما يقول صاحب الشهود مطرنا بفضل الله ورحمته تقليدا لا علما حتى يتميز المؤمن من العالم فإن المؤمن يقول ذلك لورود الخبر الصادق به ويقوله صاحب النظر لما يعطيه دليل عقله مثل المؤمن سواء إلا أن له درجة زائدة وهذان الصنفان لا يبلغان مبلغ صاحب الشهود في الدرجة فإنه يزيد عليهما بالعين وكذلك يشاهد أفعال الحق في نفسه كما يعلمها صاحب النظر كما يؤمن بها المقلد للخبر وكل له مقام معلوم ولكن لا يستوي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ فإن الحق لو رجع في التعريف عن إضافة هذه الأفعال إليه تعالى وكفر من أضافها إليه تعالى لرجع المؤمن لرجوع الحق عقدا وقولا ورجع العالم صاحب الشهود قولا لا عقدا فإنه لا يتمكن لصاحب الدليل إذا استحكم الرجوع عنه ولا لصاحب الشهود وإذا كان هذا هكذا فلا بد من التمييز بين المؤمن العالم والمؤمن فقد بينا لك صورة الميزان والوزن وأن الوزن نعت إلهي لا ينبغي لعبد من عباد الله أن يغفل عنه في كل فعل ظاهر في الكون من موجود ما من الموجودات فلا يزال مر إقباله في غيره فيحكم عليه بالميزان الموضوع عنده وليس إلا الشرع وأما مراقبته في نفسه فبخلاف ما يرقبه في غيره فإنه لا يشهده من غيره إلا بعد ظهوره ووقوعه في الوجود من هذا الشخص وأما في نفسه فيرقب خاطره فإنه أول ما يوجده الله في خاطره وقلبه وقد عفا عنه تعالى فيما يجده من ذلك إلا بمكة فإذا راقبه ورأى أن الله قد جعل فيه قصد إظهار أمر ما فإن كان من الأفعال المقربة إلى سعادته الأخروية المحبوبة إلى الله المثنى عليه هيأ محله لقبول ما يفعل الله به من ذلك فيظهر الفعل وله الأجر من حيث ما هيأ نفسه واستعد والكل من عند الله وإن كان مما ذمه الله شرعا فلا يهي‏ء نفسه لظهور ذلك الفعل جهد الطاقة فإذا كان ذلك الفعل من المقدر عند الله وقوعه في هذا المحل سلب الله عن هذا العبد عقله ولم يعطه الاختيار وأعماه حتى يظهر ذلك الفعل في محله فإذا ظهر بحكم هذا الجبر الباطن رد الله إليه عقله فاعتبر فَاسْتَغْفَرَ رَبَّهُ وخَرَّ راكِعاً وأَنابَ وهذا معنى‏\nقوله عليه السلام إن الله إذا أراد إنفاذ قضائه وقدره سلب ذوي العقول عقولهم حتى إذا أمضى قدره فيهم ردها عليهم ليعتبروا\n\n\nوأما الغافل الجاهل فحكمه ما هو المقرر في العموم وأما قولنا لا بمكة فإن الشرع قد ورد أن الله يؤاخذ بالإرادة للظلم فيها وهذا كان سبب سكنى عبد الله بن العباس بالطائف احتياطا لنفسه فإن الإنسان في قوته إن يمنع عن قلبه الخواطر فمن لم يخطر الحق له خاطر سوء فذلك هو المعصوم ومن له بذلك ولقد رأيت من هذه صفته وهو سليمان الدنبلي رحمه الله كان على قدم أبي يزيد البسطامي أخبرني عن نفسه على جهة إظهار نعمة الله عليه شكرا وامتثالا لأمر الله حيث قال وأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ فقال لي إن له خمسين سنة ما أخطر الله له في قلبه خاطر سوء فهذا من أكبر العنايات الإلهية بالعبد قال تعالى ومن يُرِدْ فِيهِ بِإِلْحادٍ بِظُلْمٍ نُذِقْهُ من عَذابٍ أَلِيمٍ فنكر الظلم فخاف مثل ابن عباس وغيره والإلحاد الميل عن الحق هنا وأما الميزان الموضوع الذي يظهر لكل عين يوم القيامة يظهر على صورة ما كان في الدنيا بين العامة من الاعتدال وترجيح إحدى الكفتين فيعامل الحق صاحب ذلك الميزان بحسب ما يحكم به من الخفة والثقل فجعل السعادة في الثقل والإنس والجن ما سميا بالثقلين إلا لما في نشأتهما من حكم الطبيعة فهي التي تعطي الثقل ولما كان الحشر يوم القيامة والنشور في الأجسام الطبيعية ظهر الميزان بصورة نشأتهم من الثقل فإذا ثقلت موازينهم وهم الذين أسعدهم الله فأرادوا حسنا وفعلوا في ظاهر أبدانهم حسنا فثقلت موازينهم فإن الحسنة بعشر أمثالها إلى مائة ألف مما دون ذلك وما فوقه وأما القبيح السيئ فواحدة بواحدة فيخف ميزانه أعني ميزان الشقي بالنسبة إلى ثقل السعيد\n\n\n### [أن الحق تعالى ما اعتبر في الوزن إلا كفة الخير لا كفة الشر]\n\n\nواعلم أن الحق تعالى ما اعتبر في الوزن إلا كفة الخير لا كفة الشر فهي الثقيلة في حق السعيد الخفيفة في حق الشقي مع كون السيئة غير مضاعفة ومع هذا فقد خفت كفة خيره فانظر ما أشقاه فالكفة الثقيلة للسعيد هي بعينها الخفيفة للشقي لقلة ما فيها من الخير أو لعدمه بالجملة مثل الذي يخرجه سبحانه من النار وما عمل خيرا قط فميزان مثل هذا ما في كفة اليمين منه شي‏ء أصلا وليس عنده إلا ما في قلبه من العلم الضروري بتوحيد الله وليس له في ذلك تعمل مثل سائر الضروريات فلو اعتبر الحق بالثقل والخفة الكفتين كفة الخير والشر لكان يزيد بيانا في ذلك فإن إحدى الكفتين إذا ثقلت خفت الأخرى بلا شك خيرا كان أو شر أو أما إذا وقع الوزن به فيكون هو في إحدى الكفتين وعمله في الأخرى فذلك وزن آخر فمن ثقل ميزانه نزل عمله إلى أسفل فإن الأعمال في الدنيا من مشاق النفوس والمشاق محلها النار فتنزل كفة عمله تطلب النار وترتفع الكفة التي هو فيها لخفتها فيدخل الجنة لأن لها العلو والشقي تثقل كفة الميزان التي هو فيها وتخف كفة عمله فيهوي في النار وهو قوله فَأُمُّهُ هاوِيَةٌ فكفة ميزان العمل هي المعتبرة في هذا النوع من الوزن الموصوفة بالثقل في السعيد لرفعة صاحبها والموصوفة بالخفة في حق الشقي لثقل صاحبها وهو قوله تعالى يَحْمِلُونَ أَوْزارَهُمْ عَلى‏ ظُهُورِهِمْ وليس إلا ما يعطيهم من الثقل الذي يهوون به في نار جهنم فهما وزنان وزن الأعمال بعضها ببعض يعتبر في ذلك كفة الحسنات ووزن الأعمال بعاملها يعتبر فيها كفة العمل فمن أراد أن يفوز بلذة لوجود فليعط لحق من نفسه لمستحقه والله عز وجل يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "**Chapter 422: Concerning the Knowledge of the Station of One Who Returns My Action to Me, for He Has Given Me My Right and Rendered Justice Concerning What Is Owed to Me by Him.**\n\nI have seen the Existence (وجود) which I do not grasp,\nAnd it is the Existence in which our Fixed Entities (الأعيان الثابتة) reside.\n\nThe Act (الفعل) is shared between me and the Real (الحق),\nIn what is supposed, and in it is some of what is in it.\n\nI heard a discourse that is never cut off,\nConcerning us and concerning the world of existents (عالم الأكوان) and those within it.\n\nBy His hearing, not by my hearing, for I am naught (عدم),\nAnd a right has been directed which we cannot fulfill.\n\nHe has an agent over me who has no existence (وجود),\nHe afflicts him at one time, and at another time He grants him well-being.\n\nAnd he remains with him as long as he is characterized\nBy being (الكون) in his essence (عين), until he meets Him.\n\nContrary to a station (مقام) which he does not know,\nAnd there is nothing in his self that contradicts it.\n\nHe and I are existent (موجودان) together in a pair,\nAnd he remains my enemy or my just partner.\n\nThus the matter is separated, and the matter is gathered,\nAnd Generosity (الجود) does not appear except from the one who rewards it.\n\nI have alluded to matters that no one knows,\nExcept the one concerning whom it is said: 'He is in it.'\n\nAnd no one knows the eternity (أبدية) of wonder that I have manifested,\nExcept the Existence (الوجود) in which creation (الورى) is bewildered.\n\nSo praise belongs to Allah, I seek no substitute for Him,\nAnd no one grasps Him except the one who rewards Him.\n\n***\n\n### [That the Act (الفعل) which the Senses Witness as Belonging to the Servant, Belongs to Allah, the Exalted, Not to the Servant]\n\nAllah, the Exalted, said: <<وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ>> (And fulfill My covenant, I will fulfill your covenant). And He said: <<فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللهَ قَتَلَهُمْ>> (So you did not kill them, but Allah killed them). And He said to His Prophet, may Allah bless him and grant him peace, concerning his throwing of dust into the eyes of the polytheists: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللهَ رَمَى>> (And you did not throw when you threw, but Allah threw). And He said: <<بَلْ لِلَّهِ الْأَمْرُ جَمِيعاً>> (Nay, but the command belongs entirely to Allah).\n\nThus, the Real (الحق), the Exalted, covenanted that the Act (الفعل) which the senses witness as belonging to the servant is actually for Allah, the Exalted, not for the servant. If I attribute it to myself, I only attribute it to myself by Allah’s attribution, not by my own attribution. Thus, I am narrating and translating (أحكي وأترجم) from Allah concerning it, which is His saying: <<وَاللهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do). He returned the Act which He attributed to me back to Himself, and this is His right (حقه) which is owed to Him by me through this attribution.\n\nHowever, there must be a Divine Balance (ميزان إلهي) by which we return it to Him. For when Allah, the Exalted, raised the heaven, He established the Balance (الميزان) in the swimming of the stars in their orbits, which are paths in the heavens, so that they might run according to the measures (المقادير) occurring in the world, according to a known measure which they do not transgress. Thus, they give and withhold by means of that Balance which the Real established for them, because they witness the Balance in the hand of the Real when He lowers and raises with it.\n\nSo, when they look upon one whom the Real has raised by His Balance, they grant him what the station of raising deserves. And when they see the Real lowering whom He wills by His Balance, they grant him what the station of lowering deserves. That is the subjugation (التسخير) mentioned in the Quran concerning the stars, that they are <<مُسَخَّرَاتٍ بِأَمْرِهِ>> (subjugated by His command).\n\n***\n\n### [That the Accountable Ones (المكلفين) are the Intended Recipients of the Divine Address and Obligation (التكليف)]\n\nKnow that the accountable ones (المكلفين) are the intended recipients of the Address and the Obligation (التكليف), for they are the locus of punishment and reward, unlike the rest of creation. This is due to the veil (الحجاب) that Allah has placed between them and the witnessing that the actions originating from them and from the rest of creation belong to Allah, not to them.\n\nWhen they claimed these actions, the Real attributed them to them according to their claim, and obligated them as a test (ابتلاء) of their claim.\n\nAs for the one whose insight (بصيرة) Allah unveils, and who sees all actions belonging to Allah, he sees only goodness (حسنا) from Him and from the rest of creation, and that Allah is the Truthful One, who said: <<إِنَّ اللهَ لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا>> (Indeed, Allah does not allow to be lost the reward of those who do good deeds). We sought to know what *Ihsan* (doing good) is, and it was reported in the authentic tradition:\n\n> That *Ihsan* is that we worship Allah as if we see Him.\n\nWe begin the action while under the veil. But when we see the One for whom the action is done, we see the action originating from Him in us, and that we are not the doers. When we witness this, we fear the slipping of the foot concerning what He named good and bad among His actions. We know that He only attributed the action to us because of our claim that the actions belong to us.\n\nWhen we attain this station of Witnessing (الشهود), whatever is good, we attribute it to Him, the Exalted, as a creation (خلقا) in us, and we attribute it to ourselves by virtue of our being the locus of its manifestation. If that action is bad, we attribute it to ourselves by Allah’s attribution. Thus, we become narrators of Allah’s saying, and Allah shows us the goodness inherent in that which is called bad. Thus, Allah replaces our bad deeds with good deeds (بدل الله سيئاتنا حسنات), and this is merely a change in the ruling (تبديل الحكم), not a change in the essence (تبديل العين).\n\nFurthermore, everything that occurs to us in all of this, whether it is a single glance or a single response, is of this nature. For all of that is an Act that manifests in us, and we are people of Witnessing (أهل شهود). We possess nothing but the preparedness (الاستعداد) upon which we stand, for the acceptance of what is created within us of the Acts attributed in the Witnessing, just as it is in the rest of creation.\n\nAmong creatures, there are those who say: \"We were given rain by the grace and mercy of Allah,\" according to the weight (الوزن) that He placed in the swimming of a star and the stations (المنازل) that Allah decreed for it to descend into.\n\nBut the one veiled from this station says: \"We were given rain by the rising of such-and-such a star,\" mentioning the star that is compelled in that matter, and attributing the manifested rain to it, just as he attributes his own actions, as creation, to himself. He is then called a disbeliever in Allah and a believer in the one from whom he saw the Act. The former is called a believer in Allah and a disbeliever in the one from whom the senses saw the Act originating, in terms of being a locus.\n\nAmong the accountable ones, there are those who do not possess this Witnessing, yet their faith (الإيمان) does not allow them to remain with the veil over their eyes. They say what the person of Witnessing says: \"We were given rain by the grace and mercy of Allah,\" but this is imitation (تقليدا), not knowledge (علما), until the believer is distinguished from the knower.\n\nThe believer says this because of the arrival of the truthful report. The person of rational consideration (صاحب النظر) says it because of what his rational proof dictates, just like the believer, except that he has an added degree. These two types do not reach the level of the person of Witnessing (صاحب الشهود) in degree, for he surpasses them by direct vision (بالعين). He witnesses the Acts of the Real in himself just as the person of rational consideration knows them, and just as the imitator believes them based on the report. Each has a known station, but <<هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ>> (Are those who know equal to those who do not know)?\n\nIf the Real were to retract the definition concerning the attribution of these Acts to Him, the Exalted, and declare as disbelievers those who attribute them to Him, the Exalted, the believer would retract his belief and statement due to the retraction of the Real. However, the knower, the person of Witnessing, would retract his statement but not his belief, for it is impossible for the person of proof, once it is established, to retract it, nor for the person of Witnessing.\n\nSince this is the case, there must be a distinction between the knowing believer and the mere believer. We have explained to you the form of the Balance (الميزان) and the Weighing (الوزن), and that Weighing is a Divine Attribute (نعت إلهي) that none of Allah’s servants should neglect in every Act that manifests in the cosmos from any existent being.\n\nHe should constantly observe its effect in others, judging it by the Balance established with him, which is nothing but the Law (الشرع). As for his observation of himself, it is different from his observation of others. He only witnesses the Act from others after its manifestation and occurrence in existence from that person.\n\nBut concerning himself, he observes his inner thought (خاطره), for that is the first thing Allah brings into existence in his thought and heart. Allah, the Exalted, has pardoned him concerning what he finds of that, except in Mecca.\n\nIf he observes it and sees that Allah has placed in him the intention to manifest a certain matter: if it is among the Acts that bring him closer to his ultimate happiness and are beloved to Allah and praised by Him, he prepares his locus (محله) to accept what Allah will do through him of that Act. The Act then manifests, and he receives the reward by virtue of his having prepared and readied himself, though everything is from Allah.\n\nIf it is among the things that Allah has legally condemned, he must strive with all his power not to prepare himself for the manifestation of that Act. If that Act is decreed by Allah to occur in this locus, Allah strips this servant of his intellect (عقله), does not grant him choice (الاختيار), and blinds him until that Act manifests in its locus. When it manifests by the ruling of this inner compulsion (جبر باطن), Allah returns his intellect to him, so he reflects: <<فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ>> (So he sought forgiveness from his Lord and fell down bowing and repented).\n\nThis is the meaning of his saying, peace be upon him:\n\n> Indeed, when Allah intends to execute His decree and destiny (قضائه وقدره), He strips those with intellect of their intellects, until He executes His destiny upon them. Then He returns it to them so they may reflect.\n\nAs for the heedless and ignorant person, his ruling is what is established for the general populace.\n\nAs for our saying, \"not in Mecca,\" the Law has stipulated that Allah holds one accountable for the mere intention (الإرادة) of wrongdoing there. This was the reason for Abdullah ibn Abbas residing in Ta’if, as a precaution for himself. For a human being has the power to prevent thoughts (الخواطر) from entering his heart. The one to whom the Real does not bring a bad thought—that is the protected one (المعصوم).\n\nI have indeed seen one who possessed this characteristic, Sulayman al-Danbali, may Allah have mercy on him, who was upon the footstep of Abu Yazid al-Bistami. He informed me about himself, by way of manifesting Allah’s favor upon him, in gratitude and obedience to Allah’s command where He said: <<وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ>> (But as for the favor of your Lord, report it). He told me that for fifty years, Allah had not brought a bad thought (خاطر سوء) into his heart. This is one of the greatest Divine Providences (العنايات الإلهية) toward the servant.\n\nAllah, the Exalted, said: <<وَمَنْ يُرِدْ فِيهِ بِإِلْحَادٍ بِظُلْمٍ نُذِقْهُ مِنْ عَذَابٍ أَلِيمٍ>> (And whoever intends [to commit] therein deviation [from the right] by wrongdoing, We will make him taste of a painful punishment). He left the wrongdoing (الظلم) indefinite, so Ibn Abbas and others feared it. Deviation (الإلحاد) here means inclining away from the Real.\n\nAs for the established Balance (الميزان) that will appear to every eye on the Day of Resurrection, it will appear in the form of what was known in the world among the common people: equilibrium or the tipping of one pan. The Real will deal with the owner of that Balance according to what the lightness or heaviness dictates.\n\nHe made happiness (السعادة) reside in the heaviness (الثقل). Humans and Jinn were only named the \"Two Heavy Things\" (الثقلين) because of the rule of nature (الطبيعة) in their constitution (نشأتهما), which gives them weight (الثقل). Since the gathering (الحشر) and resurrection (النشور) on the Day of Resurrection will be in natural bodies, the Balance will appear in the form of their constitution, which is heaviness.\n\nIf their scales are heavy (ثقلت موازينهم), they are the ones whom Allah has blessed, who intended good and acted well in the manifestation of their bodies. Their scales are heavy because a good deed is multiplied tenfold, up to a hundred thousand, and less or more than that. As for the ugly, bad deed, it is one for one, so the scale of the wretched (الشقي) is light compared to the heaviness of the blessed.\n\n***\n\n### [That the Real (الحق), the Exalted, Only Considered the Pan of Goodness in the Weighing, Not the Pan of Evil]\n\nKnow that the Real, the Exalted, only considered the pan of goodness (كفة الخير) in the Weighing, not the pan of evil (كفة الشر). It is the heavy pan for the blessed and the light pan for the wretched, even though the bad deed is not multiplied. Despite this, the pan of his goodness is light. Look then at how wretched he is!\n\nThe heavy pan for the blessed is the very same pan that is light for the wretched, due to the scarcity of good in it, or its total absence, such as the one whom the Glorified brings out of the Fire who never did any good deed at all. The Balance of such a person has nothing whatsoever in the right pan. He possesses only the necessary knowledge (العلم الضروري) of the Oneness of Allah in his heart, and he has no effort involved in that, like all other necessary matters.\n\nIf the Real had considered both pans—the pan of good and the pan of evil—in terms of heaviness and lightness, it would have provided greater clarity in the matter. For if one pan becomes heavy, the other undoubtedly becomes light, whether it is good or evil.\n\nHowever, when the Weighing occurs by means of the person himself, such that he is in one pan and his deed is in the other, that is another type of weighing.\n\nFor the one whose scale is heavy, his deed descends to the bottom, because deeds in this world are hardships upon the souls, and the locus of hardships is the Fire. Thus, the pan of his deed descends, seeking the Fire, and the pan in which he resides ascends due to its lightness, so he enters Paradise, for it is high.\n\nThe wretched one (الشقي) has the pan in which he resides become heavy, and the pan of his deed becomes light, so he falls into the Fire. This is the meaning of His saying: <<فَأُمُّهُ هَاوِيَةٌ>> (So his mother is Hawiya [the Abyss]).\n\nThus, the pan of the deed (كفة ميزان العمل) is the one considered in this type of weighing. It is described as heavy for the blessed, due to the elevation of its owner, and described as light for the wretched, due to the heaviness of its owner. This is His saying, the Exalted: <<يَحْمِلُونَ أَوْزَارَهُمْ عَلَى ظُهُورِهِمْ>> (They will carry their burdens on their backs). This is nothing but the heaviness that causes them to fall into the Fire of Hell.\n\nTherefore, there are two weighings: the weighing of deeds against each other, in which the pan of good deeds is considered; and the weighing of deeds against their doer, in which the pan of the deed is considered.\n\nWhoever wishes to attain the pleasure of Existence (لذة لوجود) must give the Real (الحق) His due from himself. And Allah, the Mighty and Majestic, <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (He speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر ۴۲۲: اس شخص کے مقام کی معرفت میں جس نے میرا فعل میری طرف لوٹا دیا، تو اس نے مجھے میرا حق دے دیا اور اس نے مجھے اس چیز سے انصاف دیا جو اس پر میرا حق تھا۔\n\nمیں نے ایک ایسی ہستی (الوجود) کو دیکھا جسے میں نہیں جانتا\nاور وہ وہی ہستی (الوجود) ہے جس میں ہماری اعیان (ثابتات) موجود ہیں۔\n\nفعل میرے اور ذات حق (الحق) کے درمیان مشترک ہے\nاس میں جو گمان کیا جاتا ہے اور اس میں بھی جو اس میں موجود ہے۔\n\nمیں نے ایک ایسا کلام سنا جو منقطع نہیں ہوتا\nہم میں اور عالمِ اکوان (کائنات) میں جو بھی اس میں ہے۔\n\nاس کے سننے سے، نہ کہ میرے سننے سے، کیونکہ میں تو عدم ہوں\nاور ایک حق متوجہ ہوا ہے جسے ہم پورا نہیں کر سکتے۔\n\nاس کا ایک وکیل مجھ پر ہے جس کا کوئی وجود نہیں\nوہ اسے ایک وقت میں آزماتا ہے اور ایک وقت میں اسے عافیت دیتا ہے۔\n\nاور وہ اس کے ساتھ رہے گا جب تک وہ اپنی عین (حقیقت) میں کون (وجود) کے ساتھ متصف ہے\nیہاں تک کہ وہ اس سے ملاقات کرے۔\n\nایک ایسے مقام کے برعکس جسے وہ نہیں جانتا\nاور اس کی ذات میں کوئی ایسی چیز نہیں جو اس کی نفی کرے۔\n\nمیں اور وہ ایک ساتھ موجود ہیں\nاور وہ ہمیشہ میرا دشمن رہے گا یا ہم انصاف کریں گے۔\n\nپس امر (معاملہ) جدا ہے اور امر (معاملہ) جمع ہے\nاور جود (سخاوت) ظاہر نہیں ہوتی مگر اس سے جو اس کا بدلہ دے۔\n\nمیں نے ایسے امور کی طرف اشارہ کیا ہے جنہیں کوئی نہیں جانتا\nسوائے اس کے جس کے بارے میں کہا گیا کہ وہ اس میں ہے۔\n\nاور کوئی نہیں جانتا کہ ابدیت کیا ہے\nسوائے اس ہستی (الوجود) کے جس میں مخلوق حیران ہے۔\n\nپس تمام تعریف اللہ کے لیے ہے، میں اس کا کوئی بدل نہیں چاہتا\nاور اسے کوئی نہیں جانتا مگر وہ جو اس کا بدلہ دے۔\n\n[کہ وہ فعل جس کی گواہی حواس دیتے ہیں کہ وہ بندے کا ہے، درحقیقت وہ اللہ تعالیٰ کا ہے نہ کہ بندے کا]\n\nاللہ تعالیٰ نے فرمایا: \"اور میرے عہد کو پورا کرو، میں تمہارے عہد کو پورا کروں گا\" (وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ)۔ اور فرمایا: \"پس تم نے انہیں قتل نہیں کیا، بلکہ اللہ نے انہیں قتل کیا\" (فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ)۔ اور اپنے نبی صلی اللہ علیہ وسلم سے مشرکین کی آنکھوں میں مٹی پھینکنے کے بارے میں فرمایا: \"اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا\" (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ)۔ اور فرمایا: \"بلکہ تمام امر (معاملہ) اللہ ہی کے لیے ہے\" (بَلْ لِلَّهِ الْأَمْرُ جَمِيعًا)۔\n\nپس اللہ تعالیٰ نے یہ عہد لیا کہ وہ فعل جس کی گواہی حواس دیتے ہیں کہ وہ بندے کا ہے، درحقیقت وہ اللہ تعالیٰ کا ہے نہ کہ بندے کا۔ اگر میں اسے اپنی طرف منسوب کرتا ہوں، تو میں اسے اللہ کی نسبت سے اپنی طرف منسوب کرتا ہوں نہ کہ اپنی نسبت سے۔ پس میں اس کے ذریعے اللہ کی حکایت اور ترجمانی کرتا ہوں، اور وہ اس کا یہ قول ہے: \"حالانکہ اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا\" (وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ)۔ پس اس نے وہ فعل جو میری طرف منسوب کیا تھا، اس نسبت کے ذریعے اپنی طرف لوٹا دیا، اور یہی وہ حق ہے جو اس کا مجھ پر ہے۔ لیکن ایک الٰہی میزان (توازن) کا ہونا ضروری ہے جس کے ذریعے ہم اسے اس کی طرف لوٹائیں۔\n\nکیونکہ اللہ تعالیٰ نے جب آسمان کو بلند کیا تو میزان (توازن) قائم کیا، ستاروں کے ان کے افلاک میں تیرنے میں جو آسمانوں میں راستے ہیں، تاکہ وہ عالم میں موجود مقادیر (اندازوں) کے مطابق ایک معلوم حد پر چلیں جس سے وہ تجاوز نہ کریں۔ پس وہ اسی میزان کے ذریعے دیتی اور روکتی ہیں جو ذات حق (الحق) نے ان کے لیے مقرر کیا ہے، کیونکہ وہ اس میزان کا مشاہدہ کرتی ہیں جو ذات حق (الحق) کے ہاتھ میں ہے جب وہ اس سے پست کرتا ہے اور بلند کرتا ہے۔ پس جب وہ اس شخص کو دیکھتی ہیں جسے ذات حق (الحق) نے اپنے میزان سے بلند کیا ہے، تو وہ اسے وہ کچھ دیتی ہیں جس کا وہ مقامِ رفع (بلندی) میں مستحق ہے۔ اور جب وہ ذات حق (الحق) کو دیکھتی ہیں کہ وہ اپنے میزان سے جسے چاہتا ہے پست کرتا ہے، تو وہ اسے وہ کچھ دیتی ہیں جس کا وہ مقامِ وضع (پستی) میں مستحق ہے۔ اور یہی وہ تسخیر (تابع کرنا) ہے جو قرآن میں ستاروں کے بارے میں آیا ہے کہ وہ \"اس کے حکم کے تابع ہیں\" (مُسَخَّرَاتٍ بِأَمْرِهِ)۔\n\n[کہ مکلفین (جن پر شرعی ذمہ داری ہے) ہی خطاب اور الٰہی تکلیف کے مقصود ہیں]\n\nپس جان لو کہ مکلفین (جن پر شرعی ذمہ داری ہے) ہی خطاب اور تکلیف (شرعی ذمہ داری) کے مقصود ہیں، کیونکہ وہ سزا اور جزا کا محل ہیں، برخلاف دیگر مخلوقات کے۔ اور یہ اس حجاب (پردے) کی وجہ سے ہے جو اللہ نے ان کے اور اس مشاہدے کے درمیان ڈال دیا ہے کہ ان سے اور دیگر مخلوقات سے صادر ہونے والے امور اللہ کے لیے ہیں نہ کہ ان کے لیے۔ پس جب انہوں نے ان (افعال) کا دعویٰ کیا، تو ذات حق (الحق) نے ان کے دعوے کے مطابق انہیں ان کی طرف منسوب کر دیا، اور ان کے دعوے کی وجہ سے بطور آزمائش انہیں مکلف (ذمہ دار) ٹھہرایا۔\n\nپس جس کی بصیرت سے اللہ نے پردہ ہٹا دیا اور اس نے تمام افعال کو اللہ کے لیے دیکھا، تو اس نے اپنے آپ سے اور دیگر مخلوقات سے صرف حسن (اچھائی) ہی دیکھا، اور یہ کہ اللہ ہی سچا ہے، چنانچہ اس نے فرمایا: \"بے شک اللہ نیک عمل کرنے والوں کا اجر ضائع نہیں کرتا\" (إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا)۔ پس ہم نے احسان (نیکوکاری) کے بارے میں پوچھا کہ وہ کیا ہے، تو صحیح حدیث میں آیا ہے کہ احسان یہ ہے کہ \"ہم اللہ کی عبادت اس طرح کریں گویا ہم اسے دیکھ رہے ہیں\" (أَنْ نَعْبُدَ اللَّهَ كَأَنَّا نَرَاهُ)۔\n\nپس ہم حجاب (پردے) کی حالت میں عمل شروع کرتے ہیں، لیکن جب ہم اس ذات کو دیکھتے ہیں جس کے لیے عمل کیا گیا، تو ہم دیکھتے ہیں کہ عمل ہم میں اسی کی طرف سے صادر ہو رہا ہے، ہم عمل کرنے والے نہیں ہیں۔ جب ہم نے یہ دیکھا، تو ہم اس لغزشِ قدم سے ڈر گئے جسے اس نے اپنے افعال میں حسن (اچھا) اور سیئ (برا) قرار دیا ہے، اور ہم نے جان لیا کہ اس نے عمل کو ہماری طرف منسوب نہیں کیا مگر اس لیے کہ ہم افعال کا دعویٰ کرتے ہیں کہ وہ ہمارے ہیں۔\n\nپس جب ہم شہود (مشاہدہ) کے اس مقام پر پہنچ جاتے ہیں، تو جو کچھ حسن (اچھائی) ہوتا ہے، ہم اسے اللہ تعالیٰ کی طرف منسوب کرتے ہیں کہ اس نے اسے ہم میں پیدا کیا، اور اسے اپنی طرف بھی منسوب کرتے ہیں کہ ہم اس کے ظہور کا محل ہیں۔ اور اگر وہ عمل سیئ (برائی) ہو، تو ہم اسے اللہ کی نسبت سے اپنی طرف منسوب کرتے ہیں، پس ہم اللہ کے قول کی حکایت کرنے والے ہوتے ہیں۔ پھر اللہ ہمیں اس چیز کا حسن دکھاتا ہے جسے برائی کہا گیا ہے، پس اللہ ہماری برائیوں کو نیکیوں سے بدل دیتا ہے، اور یہ صرف حکم کی تبدیلی ہے نہ کہ عین (حقیقت) کی تبدیلی۔\n\nپھر یہ کہ جو کچھ بھی ہم سے اس سب میں ایک ہی نظر یا رد کے طور پر ظاہر ہوا، وہ اسی حیثیت میں ہے، کیونکہ یہ سب ایک فعل ہے جو ہم میں ظاہر ہوا ہے، اور ہم اہل شہود (مشاہدہ کرنے والے) ہیں۔ پس ہمارے لیے صرف وہی استعداد ہے جس پر ہم ہیں، تاکہ ہم ان افعال کو قبول کریں جو ہم میں پیدا کیے جاتے ہیں اور جو شہود میں منسوب ہوتے ہیں، جیسا کہ دیگر مخلوقات کے ہاں ہوتا ہے، جو کہتے ہیں کہ \"ہم پر اللہ کے فضل اور رحمت سے بارش ہوئی\"، اس وزن کے ساتھ جو اللہ نے کسی ستارے کے تیرنے میں رکھا ہے اور ان منازل کے ساتھ جو اللہ نے اس کے لیے مقرر کی ہیں جن میں وہ اترتا ہے۔ اور جو اس مقام سے محجوب (پردے میں) ہے، وہ کہتا ہے کہ \"ہم پر فلاں نوء (ستارے کی منزل) کی وجہ سے بارش ہوئی\"، پس وہ اس ستارے کا ذکر کرتا ہے جو اس میں مجبور ہے، اور جو بارش ظاہر ہوئی اسے اس کی طرف منسوب کرتا ہے، جیسا کہ وہ اپنے افعال کو خلق کے طور پر اپنی طرف منسوب کرتا ہے۔ پس اس وقت اسے اللہ کا کافر اور اس کا مومن کہا جاتا ہے جس سے اس نے فعل کو صادر ہوتے دیکھا۔ اور پہلے شخص کو اللہ کا مومن اور اس کا کافر کہا جاتا ہے جس سے حواس نے فعل کو صادر ہوتے دیکھا، اس حیثیت سے کہ وہ صرف محل (جگہ) ہے۔\n\nاور مکلفین میں سے کچھ ایسے ہیں جنہیں یہ شہود (مشاہدہ) حاصل نہیں، اور نہ ہی ایمان انہیں چھوڑتا ہے، وہ اپنی آنکھ پر پڑے حجاب کے ساتھ کھڑے رہتے ہیں، پس وہ وہی کہتے ہیں جو صاحبِ شہود کہتا ہے: \"ہم پر اللہ کے فضل اور رحمت سے بارش ہوئی\"، لیکن یہ تقلیداً ہوتا ہے نہ کہ علم کے طور پر، تاکہ مومن اور عالم (جاننے والا) میں فرق کیا جا سکے۔ کیونکہ مومن یہ بات سچی خبر آنے کی وجہ سے کہتا ہے، اور صاحبِ نظر (عقلی دلیل والا) اسے اس لیے کہتا ہے جو اس کی عقلی دلیل اسے دیتی ہے، وہ مومن کی طرح ہی ہے، مگر اس کا ایک زائد درجہ ہے۔ اور یہ دونوں قسمیں درجے میں صاحبِ شہود کے مقام تک نہیں پہنچتیں، کیونکہ وہ ان دونوں سے عین (مشاہدہ) کے ذریعے بڑھ جاتا ہے۔ اور اسی طرح وہ ذات حق (الحق) کے افعال کا اپنی ذات میں مشاہدہ کرتا ہے، جیسا کہ صاحبِ نظر انہیں جانتا ہے، اور جیسا کہ خبر کی تقلید کرنے والا ان پر ایمان لاتا ہے۔ اور ہر ایک کا ایک معلوم مقام ہے، لیکن \"وہ لوگ جو جانتے ہیں اور وہ لوگ جو نہیں جانتے برابر نہیں ہو سکتے\" (هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ)۔\n\nکیونکہ اگر ذات حق (الحق) تعریف میں ان افعال کو اپنی طرف منسوب کرنے سے باز آ جائے اور جو انہیں اپنی طرف منسوب کرے اسے کافر قرار دے، تو مومن ذات حق (الحق) کے رجوع کی وجہ سے عقیدہ اور قول دونوں میں رجوع کر لے گا۔ اور عالم صاحبِ شہود (مشاہدہ والا) قول میں رجوع کرے گا نہ کہ عقیدہ میں، کیونکہ جب صاحبِ دلیل کا عقیدہ پختہ ہو جائے تو اس کے لیے رجوع ممکن نہیں، اور نہ ہی صاحبِ شہود کے لیے۔ اور جب یہ معاملہ ایسا ہے، تو مومنِ عالم اور مومن کے درمیان فرق کرنا ضروری ہے۔ ہم نے آپ کے لیے میزان (توازن) اور وزن کی صورت بیان کر دی ہے، اور یہ کہ وزن ایک الٰہی صفت ہے، اور اللہ کے کسی بھی بندے کے لیے مناسب نہیں کہ وہ کائنات میں موجود کسی بھی موجود سے ظاہر ہونے والے ہر فعل میں اس سے غافل رہے۔\n\nپس اس کا رجوع ہمیشہ دوسروں کی طرف ہوتا ہے، اور وہ اس پر اس میزان کے ذریعے حکم لگاتا ہے جو اس کے پاس رکھا گیا ہے، اور وہ صرف شریعت ہے۔ لیکن اپنی ذات میں اس کی نگرانی اس سے مختلف ہے جو وہ دوسروں میں دیکھتا ہے، کیونکہ وہ دوسروں سے اسے اس شخص سے وجود میں ظاہر ہونے اور واقع ہونے کے بعد ہی دیکھتا ہے۔ لیکن اپنی ذات میں وہ اپنے خاطر (دل میں آنے والے خیال) کی نگرانی کرتا ہے، کیونکہ اللہ سب سے پہلے اسے اس کے خاطر اور دل میں پیدا کرتا ہے، اور اللہ تعالیٰ نے اس میں جو کچھ وہ پاتا ہے اس سے درگزر کیا ہے، سوائے مکہ کے۔\n\nپس جب وہ اس کی نگرانی کرتا ہے اور دیکھتا ہے کہ اللہ نے اس میں کسی امر کو ظاہر کرنے کا ارادہ پیدا کیا ہے، تو اگر وہ ان افعال میں سے ہو جو اس کی اخروی سعادت کے قریب کرنے والے، اللہ کو محبوب اور قابل تعریف ہیں، تو وہ اپنے محل کو اس چیز کے قبول کرنے کے لیے تیار کرتا ہے جو اللہ اس کے ذریعے کرتا ہے، پس وہ فعل ظاہر ہوتا ہے، اور اسے اجر ملتا ہے اس حیثیت سے کہ اس نے خود کو تیار کیا اور مستعد ہوا، اور سب کچھ اللہ کی طرف سے ہے۔ اور اگر وہ ان افعال میں سے ہو جن کی اللہ نے شرعاً مذمت کی ہے، تو وہ اپنی پوری طاقت سے اپنے آپ کو اس فعل کے ظہور کے لیے تیار نہ کرے۔ پس اگر وہ فعل اللہ کے ہاں مقدر ہو کہ وہ اس محل میں واقع ہو، تو اللہ اس بندے سے اس کی عقل چھین لیتا ہے اور اسے اختیار نہیں دیتا اور اسے اندھا کر دیتا ہے، یہاں تک کہ وہ فعل اپنے محل میں ظاہر ہو جائے۔ پس جب وہ اس باطنی جبر کے حکم سے ظاہر ہو جاتا ہے، تو اللہ اس کی عقل اسے لوٹا دیتا ہے، پس وہ عبرت حاصل کرتا ہے، \"پس اس نے اپنے رب سے مغفرت طلب کی اور جھک کر سجدے میں گر پڑا اور رجوع کیا\" (فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ)۔ اور یہ اس فرمان کا مفہوم ہے: \"بے شک اللہ جب اپنے قضا و قدر کو نافذ کرنا چاہتا ہے تو عقل والوں کی عقلیں سلب کر لیتا ہے، یہاں تک کہ جب وہ ان میں اپنی تقدیر نافذ کر دیتا ہے تو انہیں ان کی عقلیں لوٹا دیتا ہے تاکہ وہ عبرت حاصل کریں\"۔\n\nاور غافل جاہل کا حکم وہی ہے جو عموم میں مقرر ہے۔ اور جہاں تک ہمارے قول \"سوائے مکہ کے\" کا تعلق ہے، تو شریعت میں آیا ہے کہ اللہ وہاں ظلم کے ارادے پر بھی مؤاخذہ کرتا ہے۔ اور یہی وجہ تھی کہ عبداللہ بن عباس رضی اللہ عنہما نے اپنے نفس کی احتیاط کے لیے طائف میں رہائش اختیار کی۔ کیونکہ انسان اپنی طاقت میں ہے کہ وہ اپنے دل سے خواطر (خیالات) کو روک سکتا ہے۔ پس جس کے دل میں ذات حق (الحق) نے کوئی برا خیال نہ ڈالا، وہی معصوم ہے۔ اور جس کے لیے یہ ممکن ہو، میں نے ایک شخص کو دیکھا جس کی یہ صفت تھی، اور وہ سلیمان الدنبلی رحمہ اللہ تھے، جو ابو یزید بسطامی کے قدم پر تھے، انہوں نے مجھے اپنے بارے میں اللہ کی نعمت کا اظہار شکر اور اللہ کے حکم کی تعمیل کے طور پر بتایا، جہاں اس نے فرمایا: \"اور اپنے رب کی نعمت کا خوب چرچا کرو\" (وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ)۔ انہوں نے مجھے بتایا کہ پچاس سال سے اللہ نے ان کے دل میں کوئی برا خیال نہیں ڈالا۔ پس یہ بندے پر سب سے بڑی الٰہی عنایات میں سے ہے۔ اللہ تعالیٰ نے فرمایا: \"اور جو کوئی اس میں ظلم کے ساتھ کج روی کا ارادہ کرے گا، ہم اسے دردناک عذاب چکھائیں گے\" (وَمَن يُرِدْ فِيهِ بِإِلْحَادٍ بِظُلْمٍ نُذِقْهُ مِنْ عَذَابٍ أَلِيمٍ)۔ پس اس نے ظلم کو نکرہ (عام) رکھا، اس لیے ابن عباس اور دیگر نے خوف کھایا۔ اور یہاں الحاد سے مراد حق سے ہٹ جانا ہے۔\n\n[کہ ذات حق (الحق) نے وزن میں صرف خیر (بھلائی) کے پلڑے کو معتبر جانا ہے نہ کہ شر (برائی) کے پلڑے کو]\n\nاور جہاں تک اس میزان (توازن) کا تعلق ہے جو قیامت کے دن ہر آنکھ کے سامنے ظاہر ہو گا، وہ اسی صورت میں ظاہر ہو گا جو دنیا میں عام لوگوں کے درمیان تھی، یعنی اعتدال اور ایک پلڑے کا جھک جانا۔ پس ذات حق (الحق) اس میزان والے کے ساتھ اس کے ہلکے یا بھاری ہونے کے حکم کے مطابق معاملہ کرے گا۔ پس اس نے سعادت کو بھاری پن میں رکھا، اور انسان اور جن کو ثقلین (دو بھاری چیزیں) صرف اس لیے کہا گیا کہ ان کی نشوونما میں طبیعت کا حکم شامل ہے، اور یہی وہ ہے جو بھاری پن دیتی ہے۔ اور چونکہ قیامت کے دن حشر اور دوبارہ اٹھنا طبعی اجسام میں ہو گا، اس لیے میزان ان کی طبعی نشوونما کے بھاری پن کی صورت میں ظاہر ہو گا۔\n\nپس جب ان کے میزان بھاری ہوں گے، اور وہ وہی لوگ ہیں جنہیں اللہ نے سعادت دی، پس انہوں نے اچھائی کا ارادہ کیا اور اپنے ظاہری جسموں میں اچھائی کی، تو ان کے میزان بھاری ہو گئے، کیونکہ نیکی دس گنا سے لے کر ایک لاکھ گنا تک ہوتی ہے، اس سے کم بھی اور اس سے زیادہ بھی۔ اور جہاں تک قبیح (بُرے) اور سیئ (خراب) عمل کا تعلق ہے، تو وہ ایک کے بدلے ایک ہے، پس اس کا میزان ہلکا ہو گا، یعنی شقی (بدبخت) کا میزان سعید (خوش بخت) کے بھاری پن کے مقابلے میں ہلکا ہو گا۔\n\nاور جان لو کہ ذات حق (الحق) نے وزن میں صرف خیر (بھلائی) کے پلڑے کو معتبر جانا ہے نہ کہ شر (برائی) کے پلڑے کو۔ پس یہی وہ پلڑا ہے جو سعید (خوش بخت) کے حق میں بھاری ہے اور شقی (بدبخت) کے حق میں ہلکا ہے، حالانکہ برائی کو دگنا نہیں کیا جاتا۔ اس کے باوجود اس کے خیر کا پلڑا ہلکا ہو گیا، پس دیکھو وہ کتنا بدبخت ہے۔ پس سعید کے لیے جو پلڑا بھاری ہے، وہی بعینہ شقی کے لیے ہلکا ہے، اس میں خیر کی کمی کی وجہ سے یا بالکل نہ ہونے کی وجہ سے، جیسے وہ شخص جسے اللہ سبحانہ و تعالیٰ دوزخ سے نکالے گا حالانکہ اس نے کبھی کوئی نیکی نہیں کی۔ پس ایسے شخص کے میزان کے دائیں پلڑے میں بالکل کچھ نہیں ہو گا، اور اس کے پاس صرف وہ علمِ ضروری ہو گا جو اس کے دل میں اللہ کی توحید (توحید) کے بارے میں ہے، اور اس میں اس کا کوئی عمل دخل نہیں ہو گا، جیسے دیگر ضروریات میں ہوتا ہے۔\n\nاگر ذات حق (الحق) بھاری پن اور ہلکے پن میں دونوں پلڑوں، یعنی خیر اور شر کے پلڑوں کو معتبر جانتا، تو اس میں مزید وضاحت ہوتی۔ کیونکہ جب ایک پلڑا بھاری ہوتا ہے تو دوسرا پلڑا بلاشبہ ہلکا ہو جاتا ہے، خواہ وہ خیر ہو یا شر۔ لیکن جب وزن اس (شخص) کے ساتھ واقع ہو، تو وہ ایک پلڑے میں ہو گا اور اس کا عمل دوسرے میں، تو یہ ایک دوسرا وزن ہے۔ پس جس کا میزان بھاری ہو گا، اس کا عمل نیچے کی طرف جائے گا، کیونکہ دنیا میں اعمال نفوس کی مشقتوں میں سے ہیں، اور مشقتوں کا محل آگ (نار) ہے، پس اس کے عمل کا پلڑا آگ کی تلاش میں نیچے جائے گا، اور وہ پلڑا جس میں وہ خود ہے، اپنے ہلکے پن کی وجہ سے اوپر اٹھے گا، پس وہ جنت میں داخل ہو گا کیونکہ جنت بلندی پر ہے۔ اور شقی (بدبخت) کے میزان کا وہ پلڑا جس میں وہ خود ہے، بھاری ہو جائے گا، اور اس کے عمل کا پلڑا ہلکا ہو جائے گا، پس وہ آگ میں گرے گا، اور یہی اس کا قول ہے: \"پس اس کا ٹھکانہ ہاویہ (جہنم) ہے\" (فَأُمُّهُ هَاوِيَةٌ)۔\n\nپس عمل کے میزان کا پلڑا ہی اس قسم کے وزن میں معتبر ہے، جو سعید کے حق میں بھاری پن سے موصوف ہے اس کے صاحب کی بلندی کی وجہ سے، اور شقی کے حق میں ہلکے پن سے موصوف ہے اس کے صاحب کے بھاری پن کی وجہ سے۔ اور یہی اللہ تعالیٰ کا قول ہے: \"وہ اپنے بوجھ اپنی پیٹھوں پر اٹھائیں گے\" (يَحْمِلُونَ أَوْزَارَهُمْ عَلَىٰ ظُهُورِهِمْ)، اور یہ کچھ نہیں مگر وہ بھاری پن ہے جو انہیں دیا جائے گا جس کے ذریعے وہ جہنم کی آگ میں گریں گے۔ پس یہ دو وزن ہیں: ایک اعمال کا آپس میں وزن، جس میں حسنات (نیکیوں) کا پلڑا معتبر ہوتا ہے، اور دوسرا اعمال کا ان کے عامل کے ساتھ وزن، جس میں عمل کا پلڑا معتبر ہوتا ہے۔ پس جو شخص ہستی (الوجود) کی لذت سے کامیاب ہونا چاہتا ہے، اسے چاہیے کہ وہ اپنے نفس سے حق کو اس کے مستحق کو دے دے۔ اور اللہ عزوجل \"حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و بیست و دوم در معرفت منزلت کسی که فعل مرا به من بازگرداند، پس حق مرا داده و انصاف مرا از آنچه بر عهده من است، رعایت کرده است.\n\nمن هستی‌ای را دیدم که آن را درک نمی‌کنم\nو آن همان هستی (الوجود) است که اعیان ما در آن است.\n\nفعل میان من و حق (الحق) مشترک است\nدر آنچه گمان می‌رود و در آن برخی از آنچه در آن است.\n\nمن کلامی شنیدم که قطع نمی‌شود\nدر ما و در عالم هستی‌ها (الأکوان) و هر که در آن است.\n\nبه شنوایی او، نه به شنوایی من، زیرا من عدم هستم\nو حقی متوجه شده که ما آن را ادا نمی‌کنیم.\n\nاو وکیلی بر من دارد که وجودی (وجود) ندارد\nزمانی او را مبتلا می‌کند و زمانی او را عافیت می‌بخشد.\n\nو پیوسته با اوست تا زمانی که متصف باشد\nبه هستی (الکون) در عین او، تا زمانی که او را ملاقات کند.\n\nبر خلاف مقامی که آن را نمی‌شناسد\nو در نفس او امری نیست که با آن منافات داشته باشد.\n\nمن و او در یک قرن موجودیم\nو پیوسته دشمن من است یا انصاف مرا می‌دهد.\n\nپس امر پراکنده است و امر جمع است\nو جود آشکار نمی‌شود مگر از کسی که پاداش آن را می‌دهد.\n\nمن به اموری اشاره کردم که کسی آن‌ها را نمی‌شناسد\nمگر کسی که درباره‌اش گفته شده که او در آن است.\n\nو کسی نمی‌داند که ابدیت از شگفتی چیست\nمگر هستی (الوجود) که خلایق در آن حیرانند.\n\nپس حمد از آن خداست، من جایگزینی برای او نمی‌خواهم\nو کسی او را درک نمی‌کند مگر کسی که پاداش او را می‌دهد.\n\n***\n\n### [اینکه فعلی که حس گواهی می‌دهد که از آن بنده است، در واقع از آن خداوند متعال است نه از آن بنده]\n\nخداوند متعال فرمود: «و به عهد من وفا کنید تا به عهد شما وفا کنم» (وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ). و فرمود: «شما آنان را نکشتید، بلکه خدا آنان را کشت» (فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ). و به پیامبرش (صلی الله علیه و سلم) در مورد پرتاب خاک به چشمان مشرکان فرمود: «و هنگامی که پرتاب کردی، تو پرتاب نکردی، بلکه خدا پرتاب کرد» (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ). و فرمود: «بلکه همه امور از آن خداست» (بَلْ لِلَّهِ الْأَمْرُ جَمِيعًا).\n\nپس خداوند متعال عهد کرد که فعلی که حس گواهی می‌دهد از آن بنده است، در واقع از آن خداوند متعال است نه از آن بنده. اگر آن را به خود نسبت دهم، تنها با نسبت دادن خداوند است نه با نسبت دادن خودم. پس من از جانب خداوند حکایت و ترجمه می‌کنم، و آن قول اوست: «و خداوند شما و آنچه را عمل می‌کنید آفریده است» (وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ). پس فعلی را که به من نسبت داده بود، به خود بازگرداند، و این حق اوست که به واسطه این نسبت دادن، بر عهده من است. اما ناگزیر باید میزان (الميزان) الهی وجود داشته باشد تا ما آن را به واسطه آن به سوی او بازگردانیم، زیرا خداوند متعال هنگامی که آسمان را برافراشت، میزان (الميزان) را قرار داد.\n\nدر شناوری ستارگان در افلاکشان که راه‌هایی در آسمان‌ها هستند تا مقادیر موجود در عالم را بر اساس اندازه‌ای معلوم که از آن تجاوز نمی‌کنند، به جریان اندازند. پس آن‌ها با آن میزان (الميزان) که حق (الحق) برایشان قرار داده، عطا می‌کنند و منع می‌نمایند، زیرا آن‌ها میزان (الميزان) را که در دست حق (الحق) است، مشاهده می‌کنند، هنگامی که با آن پایین می‌آورد و بالا می‌برد. پس هرگاه به کسی بنگرند که حق (الحق) او را با میزانش بالا برده است، آنچه را که شایسته مقام رفعت است به او می‌دهند، و هرگاه ببینند که حق (الحق) با میزانش هر که را بخواهد پایین می‌آورد، آنچه را که شایسته مقام پستی است به او می‌دهند. و این همان تسخیری است که در قرآن درباره ستارگان آمده است که «به فرمان او مسخر شده‌اند» (مُسَخَّرَاتٍ بِأَمْرِهِ).\n\n***\n\n### [اینکه مکلفین همان مقصودان خطاب و تکلیف الهی هستند]\n\nپس بدان که مکلفین همان مقصودان خطاب و تکلیف هستند، زیرا آنان محل عقاب و ثواب می‌باشند، بر خلاف سایر مخلوقات. و این به دلیل حجابی است که خداوند میان آنان و مشاهده این امر زده است که امور، چه از جانب خودشان و چه از جانب سایر مخلوقات، از آن خداست نه از آن ایشان. پس هنگامی که آن‌ها ادعای مالکیت کردند، حق (الحق) آن را بر اساس ادعایشان به آن‌ها نسبت داد و برای آزمودن ادعایشان، آن‌ها را مکلف ساخت.\n\nپس کسی که خداوند از بصیرتش کشف (الکشف) کند و ببیند که همه افعال از آن خداست، جز نیکی از او و از سایر مخلوقات نمی‌بیند، و می‌بیند که خداوند صادق است که فرمود: «خداوند پاداش کسی را که عمل نیکو انجام دهد، ضایع نمی‌کند» (إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا). پس ما در مورد احسان (نیکوکاری) پرسیدیم که چیست، و در خبر آمد:\n\nدر خبر صحیح آمده است که احسان (الإحسان) آن است که «خدا را چنان بپرستی که گویی او را می‌بینی» (حدیث).\n\nپس ما بر اساس حجاب شروع به عمل می‌کنیم، اما هنگامی که کسی را که عمل برای او انجام می‌شود، ببینیم، می‌بینیم که عمل از او در ما صادر شده است و ما عامل نیستیم. هنگامی که این را دیدیم، از لغزش قدم در آنچه خداوند از افعالش نیکو و بد نامیده است، ترسیدیم و دانستیم که او عمل را به ما نسبت نداده است مگر به دلیل ادعای ما در مورد افعال که آن‌ها از آن ما هستند.\n\nپس هنگامی که در این مقام از شهود (الشهود) قرار گرفتیم، آنچه نیکو بود، از جهت خلق شدن در ما، به خداوند متعال نسبت می‌دهیم و از جهت اینکه محل ظهور آن هستیم، به خود نسبت می‌دهیم. و اگر آن عمل بد بود، آن را با نسبت دادن خداوند به خود نسبت می‌دهیم، پس ما حکایت‌کننده قول خداوند خواهیم بود. در نتیجه خداوند نیکی موجود در آن امر نامیده شده به بدی را به ما نشان می‌دهد، پس خداوند بدی‌های ما را به نیکی‌ها تبدیل می‌کند، و این چیزی نیست جز تبدیل حکم، نه تبدیل عین (ماهیت).\n\nسپس، هر آنچه از ما در این مورد رخ داده است، از نظر و بازگشت واحد، در همین مرتبه است. زیرا همه آن فعل (الفعل) است که در ما ظاهر شده و ما اهل شهود (الشهود) هستیم. پس ما جز استعدادی که بر آن هستیم برای پذیرش افعالی که در ما خلق می‌شود، نداریم؛ افعالی که در شهود (الشهود) به ما نسبت داده می‌شوند، همان‌گونه که در سایر مخلوقات نزد مخلوقاتی که می‌گویند: «به فضل و رحمت خدا باران بر ما بارید»، نسبت داده می‌شوند؛ با وزنی که خداوند در شناوری ستاره‌ای از ستارگان و منازلی که خداوند برای آن مقدر کرده تا در آن فرود آید، قرار داده است.\n\nو کسی که از این مقام محجوب است، می‌گوید: «به نوء (ستاره) فلان و فلان باران بر ما بارید»، و ستاره مجبور در آن را ذکر می‌کند و آنچه از باران نازل شده ظاهر گشته را به آن نسبت می‌دهد، همان‌گونه که افعال خود را از جهت خلق شدن به نفس خویش نسبت می‌دهد. در این هنگام، او کافر به خدا و مؤمن به کسی نامیده می‌شود که فعل را از او دیده است. و اولی (صاحب شهود) مؤمن به خدا و کافر به کسی نامیده می‌شود که حس، فعل را از او صادر شده دیده است، از آن جهت که او محل ظهور است.\n\nو از مکلفین کسانی هستند که این شهود (الشهود) را ندارند، اما ایمانشان آن‌ها را رها نمی‌کند. آن‌ها با حجابی که بر چشمشان است می‌ایستند و مانند صاحب شهود (الشهود) می‌گویند: «به فضل و رحمت خدا باران بر ما بارید»، اما از روی تقلید نه علم، تا مؤمن از عالم متمایز شود. زیرا مؤمن این را به دلیل آمدن خبر صادق می‌گوید، و صاحب نظر (عالم) نیز آن را به دلیل آنچه دلیل عقلش به او می‌دهد، می‌گوید، درست مانند مؤمن، جز اینکه او درجه‌ای افزون دارد. و این دو صنف به مرتبه صاحب شهود (الشهود) نمی‌رسند، زیرا او به واسطه عین (مشاهده) بر آن‌ها برتری دارد.\n\nو همچنین افعال حق (الحق) را در نفس خود مشاهده می‌کند، همان‌گونه که صاحب نظر آن‌ها را می‌داند و همان‌گونه که مقلد خبر به آن‌ها ایمان می‌آورد. و هر یک مقامی معلوم دارد، اما «کسانی که می‌دانند و کسانی که نمی‌دانند برابر نیستند» (هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ). زیرا اگر حق (الحق) در تعریف از نسبت دادن این افعال به خود بازگردد و کسی را که آن‌ها را به خداوند متعال نسبت دهد کافر بداند، مؤمن به دلیل بازگشت حق (الحق)، در اعتقاد و گفتار باز می‌گردد؛ اما عالم صاحب شهود (الشهود) تنها در گفتار باز می‌گردد نه در اعتقاد، زیرا برای صاحب دلیل هنگامی که دلیلش محکم شد، بازگشت از آن ممکن نیست، و همچنین برای صاحب شهود (الشهود).\n\nو چون چنین است، ناگزیر باید میان مؤمن عالم و مؤمن (مقلد) تمایز قائل شد. ما صورت میزان (الميزان) و وزن را برای تو بیان کردیم و اینکه وزن صفتی الهی است که شایسته نیست هیچ بنده‌ای از بندگان خدا در مورد آن در هر فعل ظاهری در هستی (الکون) از هر موجودی از موجودات غفلت ورزد.\n\nپس پیوسته باید روی آوردن او در غیر خودش باشد و بر آن با میزان (الميزان) موجود نزد خود حکم کند، و آن چیزی جز شرع نیست. اما مراقبه او در نفس خود، بر خلاف مراقبه او در غیر خود است. زیرا او فعل را از غیر خود مشاهده نمی‌کند مگر پس از ظهور و وقوع آن در هستی (الوجود) از جانب آن شخص. اما در نفس خود، مراقب خاطر خویش است، زیرا خداوند اولین چیزی که در خاطر و قلب او ایجاد می‌کند، همان است. و خداوند متعال از آنچه در این مورد می‌یابد، درگذشته است، مگر در مکه.\n\nپس اگر آن را مراقبه کند و ببیند که خداوند قصد اظهار امری را در او قرار داده است، اگر آن امر از افعالی باشد که او را به سعادت اخروی نزدیک می‌کند، و نزد خدا محبوب و ستوده است، محل خود را برای پذیرش آنچه خداوند با او انجام می‌دهد، آماده می‌سازد. پس فعل ظاهر می‌شود و او از آن جهت که نفس خود را آماده و مستعد ساخته، پاداش دارد، و همه از جانب خداست. و اگر از اموری باشد که خداوند شرعاً آن را مذمت کرده است، با تمام توان نفس خود را برای ظهور آن فعل آماده نمی‌سازد. پس اگر آن فعل از اموری باشد که وقوعش نزد خداوند در این محل مقدر شده است، خداوند عقل را از این بنده سلب می‌کند و اختیار به او نمی‌دهد و او را کور می‌سازد تا آن فعل در محل خود ظاهر شود. پس هنگامی که به حکم این جبر باطنی ظاهر شد، خداوند عقلش را به او باز می‌گرداند، پس عبرت می‌گیرد و «از پروردگارش آمرزش خواست و به رکوع افتاد و توبه کرد» (فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ). و این معنای قول پیامبر (علیه السلام) است که: «هرگاه خداوند بخواهد قضا و قدر خود را اجرا کند، عقل صاحبان عقل را از آنان سلب می‌کند، تا زمانی که قدر خود را در مورد آنان امضا کرد، آن را به ایشان باز می‌گرداند تا عبرت گیرند» (حدیث).\n\nاما حکم غافل جاهل همان است که در عموم مقرر شده است. و اما قول ما که «نه در مکه»، به این دلیل است که شرع وارد شده است که خداوند در مکه به صرف اراده ظلم مؤاخذه می‌کند. و این سبب اقامت عبدالله بن عباس در طائف بود، برای احتیاط نسبت به نفس خود. زیرا انسان در توان خود دارد که خواطر (خطورات ذهنی) را از قلبش باز دارد. پس کسی که حق (الحق) خاطر بدی را به قلبش خطور ندهد، او معصوم است. و چه کسی چنین توانی دارد؟ من کسی را دیدم که این صفت را داشت و او سلیمان دنبلی (رحمه الله) بود که بر قدم ابویزید بسطامی بود. او از باب اظهار نعمت خداوند بر خود، شکر و امتثال امر الهی که فرمود: «و اما نعمت پروردگارت را بازگو کن» (وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ)، به من خبر داد. او به من گفت که پنجاه سال است که خداوند خاطر بدی را به قلبش خطور نداده است. پس این از بزرگترین عنایات الهی به بنده است. خداوند متعال فرمود: «و هر کس در آنجا (مکه) قصد کج‌روی و ستم کند، از عذابی دردناک به او می‌چشانیم» (وَمَن يُرِدْ فِيهِ بِإِلْحَادٍ بِظُلْمٍ نُذِقْهُ مِنْ عَذَابٍ أَلِيمٍ). پس ظلم را نکره آورد، و به همین دلیل کسانی مانند ابن عباس و دیگران ترسیدند. و الحاد (الإلحاد) در اینجا به معنای میل از حق (الحق) است.\n\nو اما میزان (الميزان) قرار داده شده که در روز قیامت برای هر چشمی ظاهر می‌شود، به صورتی ظاهر می‌شود که در دنیا میان عموم از اعتدال و سنگینی یکی از دو کفه وجود داشت. پس حق (الحق) با صاحب آن میزان (الميزان) بر اساس آنچه از سبکی و سنگینی حکم می‌کند، رفتار می‌نماید. پس سعادت را در سنگینی قرار داد. و انس و جن را ثقلین (دو سنگین) نامیدند، مگر به دلیل حکم طبیعت در نشأت آن‌ها، که همان است که سنگینی می‌بخشد. و چون حشر در روز قیامت و برانگیختن در اجسام طبیعی است، میزان (الميزان) به صورت نشأت آن‌ها از سنگینی ظاهر می‌شود. پس هرگاه میزان‌هایشان سنگین شود، آنان کسانی هستند که خداوند آن‌ها را سعادتمند کرده است، پس نیکی خواستند و در ظاهر بدن‌هایشان نیکی انجام دادند، در نتیجه میزان‌هایشان سنگین شد. زیرا حسنه ده برابر است تا صد هزار برابر، و کمتر و بیشتر از آن. اما کار زشت و بد، یکی در مقابل یکی است. پس میزان (الميزان) او، یعنی میزان شقی، نسبت به سنگینی سعید، سبک می‌شود.\n\n***\n\n### [اینکه خداوند متعال در وزن کردن جز کفه خیر را در نظر نگرفته است نه کفه شر را]\n\nو بدان که خداوند متعال در وزن کردن جز کفه خیر را در نظر نگرفته است نه کفه شر را. پس آن (کفه خیر) در حق سعید سنگین و در حق شقی سبک است، با وجود اینکه بدی (سیئه) مضاعف نمی‌شود، و با این حال کفه خیر او سبک شده است؛ پس بنگر که چقدر بدبخت است!\n\nپس کفه سنگین برای سعید، عیناً همان کفه سبک برای شقی است، به دلیل کمی خیری که در آن است یا به دلیل نبودن خیر به طور کلی؛ مانند کسی که خداوند سبحان او را از آتش خارج می‌کند در حالی که هرگز کار خیری انجام نداده است. میزان (الميزان) چنین کسی در کفه راستش اصلاً چیزی ندارد و نزد او جز علم ضروری به توحید خداوند که در قلبش است، نیست، و در آن هیچ تکلفی ندارد، مانند سایر امور ضروری.\n\nپس اگر حق (الحق) با سنگینی و سبکی، هر دو کفه، یعنی کفه خیر و شر را در نظر می‌گرفت، در این مورد وضوح بیشتری می‌یافت. زیرا اگر یکی از دو کفه سنگین شود، دیگری بدون شک سبک می‌شود، چه خیر باشد و چه شر. اما اگر وزن با خود شخص انجام شود، به این صورت که او در یک کفه و عملش در کفه دیگر باشد، آن وزن دیگری است.\n\nپس کسی که میزان (الميزان) او سنگین شود، عملش به پایین می‌رود. زیرا اعمال در دنیا از مشقت‌های نفوس هستند و محل مشقت‌ها آتش است. پس کفه عملش پایین می‌رود و آتش را می‌طلبد، و کفه‌ای که او در آن است به دلیل سبکی‌اش بالا می‌رود، پس وارد بهشت می‌شود، زیرا بهشت جایگاه بلندی است. و شقی، کفه میزان (الميزان) که او در آن است سنگین می‌شود و کفه عملش سبک می‌شود، پس در آتش سقوط می‌کند، و این همان قول خداوند است: «پس مادرش هاویه است» (فَأُمُّهُ هَاوِيَةٌ).\n\nپس کفه میزان (الميزان) عمل در این نوع وزن، همان است که مورد اعتبار است؛ که در مورد سعید به سنگینی توصیف شده است به دلیل رفعت صاحبش، و در حق شقی به سبکی توصیف شده است به دلیل سنگینی صاحبش. و این همان قول خداوند متعال است: «بارهای سنگین خود را بر پشت‌هایشان حمل می‌کنند» (يَحْمِلُونَ أَوْزَارَهُمْ عَلَىٰ ظُهُورِهِمْ)، و این چیزی نیست جز سنگینی‌ای که به آن‌ها داده می‌شود و با آن در آتش جهنم سقوط می‌کنند.\n\nپس دو نوع وزن وجود دارد: وزن اعمال با یکدیگر که در آن کفه حسنات مورد اعتبار است، و وزن اعمال با عامل آن که در آن کفه عمل مورد اعتبار است. پس هر کس می‌خواهد به لذت هستی (الوجود) دست یابد، باید حق (الحق) را از نفس خود به مستحق آن بدهد. و خداوند عز و جل «حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}