{
  "id": 345,
  "title": {
    "ar": "الباب الخامس والأربعون وثلاثمائة في معرفة منزل سر الإخلاص في الدين وما هو الدين ولما ذا سمي الشرع دينا وقول النبي صَلَّى اللهُ عَليهِ وسَلَّم الخير عادة",
    "en": "Chapter Three Hundred and Forty-Five: Concerning the Knowledge of the Station (منزل) of the Secret (سر) of Sincerity (الإخلاص) in the Religion (الدين), and what the Religion is, and why the Divine Law (الشرع) was named Religion, and the saying of the Prophet (peace be upon him): \"Goodness is a habit.\" (الخير عادة)",
    "ur": "باب تین سو پینتالیس: دین (الدين) میں اخلاص (الإخلاص) کے راز کے مقام (منزل) کی معرفت (المعرفۃ) کے بیان میں، اور یہ کہ دین (الدين) کیا ہے، اور شریعت (الشرع) کو دین (الدين) کیوں کہا گیا، اور نبی اکرم صلی اللہ علیہ وسلم کا یہ فرمان کہ \"بھلائی عادت ہے\" (الخير عادة)۔",
    "fa": "باب سیصد و چهل و پنجم در معرفت منزل سر اخلاص در دین، و اینکه دین چیست و چرا شریعت، دین نامیده شده است، و سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) که فرمود: «الخیر عادة» (خیر، عادت است)."
  },
  "content": {
    "ar": "## «الباب الخامس والأربعون وثلاثمائة في معرفة منزل سر الإخلاص في الدين وما هو الدين ولما ذا سمي الشرع دينا وقول النبي صَلَّى اللهُ عَليهِ وسَلَّم الخير عادة»\n\n\n> لكل شخص من القرآن سورته *** وسورتي من كتاب الله تنزيل‏\n\n\n> أتى بها الملأ العلوي يقدمه *** عند التنزل ميكال وجبريل‏\n\n\n> أتى بها تنثني لينا معاطفها *** وفي جوانبها هدى وتضليل‏\n\n\n> إذا نظرت ترى في آيها عجبا *** نار ونور وتنزيه وتمثيل‏\n\n\n> بكر النواظر في أجفانها دعج *** لم يقترع طرفها بكحله الميل‏\n\n\n### [الإخلاص في الدين‏]\n\n\nتجلت لنا هذه السورة بمدينة حلب وقيل لي لما رأيتها هذه سورة لم يطمثها إنس ولا جان فرأيت لها ومنها ميلا عظيما إلى جانبي وقد مثلت لي في شبه هذا المنزل الذي كنت دخلته قبل ذلك ثم قيل لي هي خالِصَةً لَكَ من دُونِ الْمُؤْمِنِينَ فلما قيل لي ذلك فهمت الأشاعرة وعلمت أنها ذاتي وعين صورتي لا غيري فإنه ما لموجود شي‏ء مخلص له ليس لغيره قديمه وحديثه إلا ذاته خاصة فقلت ها أنا ذا فعلمت عند ذلك معنى التخليص وعلمت ما تلي علي فيما أنزل علي من القرآن عند التلاوة وذلك أنه لما نزل الإلهام بتلاوة سورة الإخلاص رزقت عين الفهم في تسميتها بهذا الاسم دون غيرها من السور فإنها كلها نسب الله وصفته وهي عين مجموع العالم ففهمت الإشارة بها في إن العالم مع كونه هو الحق المبين من حيث مجموعه لا من حيث جزء جزء منه فتخلص النسب لله من حيث ذاته فهذا المجموع هو في الحق عين واحدة وهو في العالم عين الحق المبين قالت طائفة من الأمة اليهودية أنسب لنا ربك فنسبه لمجموع العالم بما نزل عليه من الله تعالى في ذلك فقيل له قُلْ هُوَ الله أَحَدٌ فنعته بالأحدية ولكل جزء من العالم أحدية تخصه لا يشارك فيها بها يتميز ويتعين عن كل ما سواه مع ما له من صفات الاشتراك ثم قيل له الله الصَّمَدُ وهو الذي يصمد إليه في الأمور أي يلجأ والأسباب الموضوعة كلها في العالم يلجأ إليها ولهذا سميت أسبابا لتواصل مسبباتها إلى الصمد الأول الذي إليه تلجأ الأسباب لَمْ يَلِدْ وهو العقيم الذي لا يولد له وبهذه الصفة نعت الريح بالعقيم لأنه من الرياح ما هي لواقح ومنها ما هي عقيم ولَمْ يُولَدْ آدم عليه السلام فإن الولادة معلومة عند السائلين فخوطبوا بما هو معلوم عندهم ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ أراد بالكفو هنا الصاحبة لأجل‏\nمقال من قال إن المسيح ابن الله وعزير ابن الله والكفاءة المثل والمرأة لا تماثل الرجل أبدا فإن الله يقول ولِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ فليست له بكفو فإن المنفعل ما هو كفو لفاعله والعالم منفعل عن الله فما هو كفو لله وحواء منفعلة عن آدم فله عليها درجة الفاعلية فليست له بكفو من هذا الوجه ولما قال إنه للرجال عليهن درجة لم يجعل عيسى عليه السلام منفعلا عن مريم حتى لا يكون الرجل منفعلا عن المرأة كما كانت حواء عن آدم فَتَمَثَّلَ لَها جبريل أو الملك بَشَراً سَوِيًّا وقال لها أَنَا رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلاماً زَكِيًّا فوهبها عيسى عليه السلام فكان انفعال عيسى عن الملك الممثل في صورة الرجل ولذلك خرج على صورة أبيه ذكرا بشرا روحا فجمع بين الصورتين التين كان عليهما أبوه الذي هو الملك فإنه روح من حيث عينه بشر من حيث تمثله في صورة البشر فسمى هذه السورة سورة الإخلاص أي خلص الحق للعالم من التنزيه الذي يبرهن عليه العقل وخلصه من العالم بمجموع هذه الصفات في عين واحدة وهي أعني هذه الصفات مفرقة في العالم لا يجمعها عين واحد فإن آدم عليه السلام أكمل صورة ظهرت في العالم ومع هذا نقصه لَمْ يَلِدْ فإنه أحد صمد لَمْ يُولَدْ ولم تكن له حواء كفوا فخلصت هذه السورة الحق من التشبيه كما خلصته من التنزيه فإذا فهمت ما أشرنا إليه‏\n\n\n### [إن سر الإخلاص هو سر القدر الذي أخفى الله علمه عن العالم‏]\n\n\nفاعلم إن سر الإخلاص هو سر القدر الذي أخفى الله علمه عن العالم لا بل عن أكثر العالم فميز الأشياء بحدودها فهذا معنى سر القدر فإنه التوقيف عينه وبه تميزت الأشياء وبه تميز الخالق من المخلوق والمحدث من القديم فتميز المحدث بنعت ثابت يعلم ويشهد وما تميز القديم من المحدث بنعت ثبوتي يعلم بل تميز بسلب ما تميز به المحدث عنه لا غير فهو المعلوم سبحانه المجهول فلا يعلم إلا هو ولا يجهل إلا هو فسبحان من كان العلم به عين الجهل به وكان الجهل به عين العلم به وأعظم من هذا التمييز لا يكون ولا أوضح منه لمن عقل واستبصر وأما الإخلاص في الدين فهو الجزاء الوفاق فما ثم الأجزاء وفاق لا ينقص ولا يزيد فإن الله جعله جَزاءً وِفاقاً إنباء عن حقيقة لأن المجازي لا يمكن أن يقبل ما لا يعطيه استعداده وباستعداده قبل ما ظهر عليه من الدين الذي يطلب الجزاء فيه بعينه أعني الاستعداد قبل الجزاء فكان الجزاء وفاقا والجزاء ما هو إلا للعمل ولا يأخذه العامل إلا من عمله ولهذا قيل إن في الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر وهو الصحيح فإنه يصدر من العاملين عمل من غير قصد ما رأته عينه ولا سمعته أذنه ولا خطر على قلبه إلا عند ما ظهر منه رأته عينه عند ذلك وخطر له كما يرى ما في الجنة مما لم يره في الدنيا ولا سمع به ولا خطر على قلبه فذلك هو الجزاء الوفاق لهذا النوع من العمل وهذا العمل هو من قوله تعالى ونُنْشِئَكُمْ في ما لا تَعْلَمُونَ فأظهره في منزل لا يعلمه من جهة فكره ولا رأته عينه ولا سمعته أذنه إنه يقام فيه فيكون جزاؤه ما ذكره في الجنة مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر فخلص الجزاء لهذا العمل بصفة الوفاق وهذا من سر القدر ولما كان الدين هو عمل الخير والدين العادة\n\n\nذكر عليه السلام إن الخير عادة\n\n\nوهذا الذكر بشارة من عالم بالأمور وهو الرسول صَلَّى اللهُ عَليهِ وسَلَّم بأن النفس خيرة بالذات وما تقبل الشر إلا لجاجة من القرين بما يلج عليها به فلم يجعل الشر من ذاتها\n\n\nفقال صَلَّى اللهُ عَليهِ وسَلَّم الخير عادة والشر لجاجة\n\n\nولما ألح القرين على النفس ولج بالشر الذي هو عين مخالفة أمر الله ونهيه وضاقت منافسها من هذا الإلحاح واللجاج أوحى الله إليها بل كلمها من الوجه الخاص الذي لا يعرفه الملك بأن تقبل منه ما ألح عليها به من الشر فرأى الحق فيها استيحاشا وخوفا من المكر الإلهي فأشهدها حضرة التبديل وأشهدها مال المكلفين إلى الرحمة وتلا عليها يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ وتلا عليها في المسرفين لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً فأزال وحشتها وقبلت من القرين الشر الذي جاء به إليها فسر بما وقع منها من القبول لجهله بعموم الرحمة وعموم العفو والمغفرة وإن الله ما جعل العفو إلا لهذا الصنف الذي يتلقى من الشيطان القرين ما جاء به من الشر وما علم إن الله قد جعل النفس في قبولها شر القرين باللجاج والإلحاح منزلة المكره والمكره غير مؤاخذ فسمى الشر لجاجة بشارة إلهية لا يشعر بها كل أحد وجعل الخير عادة فإن النفس بالذات خيرة لأن أباها الروح القدسي الطاهر فطبعها الخير لا غيره وأمها هذه الصورة المسواة من هذه الأخلاط فأول قبول ظهر فيها قبول السواء والعدل وهو قوله فَسَوَّاكَ فَعَدَلَكَ وقبول العدل عين الخير وقبلت بالأصالة هذه النشأة مجاورة الأضداد وهي الأخلاط ومن عادة الضد المنافرة عن ضده ولم يوجد هنا\nتنافر فدل على خيرية الأصل ثم قبولها بعد التعديل والتسوية لنفخ الروح القدسي فكان أول قبول قبلته على ما زاد على نشأتها نفخ هذا الروح الخير الطاهر المطهر فلهذا كان الخير لها عادة بالطبع الذي طبعت عليه ولهذا ترجع في المال إلى أصلها فإن الأصل منها ما ذكرناه من قبول الخير فتلحقها الرحمة في المال كما كان وجودها عين الرحمة فختم الأمر بما به بدأ والخاتمة عين السابقة ومما يؤيد ما ذكرناه أن أول نشأة إنسانية التي كانت أصل النشآت الإنسانية كانت في غاية التقديس وأوج الشرف بكونها مخلوقة على الصورة الإلهية فلم يظهر عنها إلا المناسب فكما كان المناسب لها مع وجود المخالفة التي تعطيها حقائق الأسماء الإلهية المقابلة أن لا يتطرق إليها لمخالفة بعضها بعضا لسان ذم كذلك ما ظهر من المخالفة في هذه النشأة الإنسانية لا يتطرق إليها في المال تسرمد عذاب فإن الأصل يحميها من ذلك وهو الصورة فكانت مجبورة في مخالفتها فلا بد من المخالفة لأنه لا بد من تقابل الأسماء في الذي خلقت على صورته فالنافع ما هو الضار ولا المعطي هو المانع ولا بد من ظهور هذه الحقائق في هذه النشأة حتى يصح كمال الصورة فالطائع يقابل العاصي والمشرك يقابل الموحد والمعطل يقابل المثبت والموافق يقابل المخالف من إمداد الأسماء الإلهية وهو قوله كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ يعني الطائع والعاصي وأهل الخير والشر وما كانَ عَطاءُ رَبِّكَ مَحْظُوراً أي ممنوعا لأنه يعطي لذاته والمحال القوابل تقبل باستعدادها واستعدادها أثر الأسماء الإلهية فيها ومن الأسماء الإلهية الموافق والمخالف مثل الموافق الرحيم والغفور وأشباهه ومثل المخالف المعز والمذل فلا بد أن يكون استعداد هذا المحل في حكم اسم من هذه الأسماء\n\n\nفيكون قبوله للحكم الإلهي بحسب ذلك فأما مخالف وإما موافق ومن كان هذا حاله كيف يتعلق به ذم ذاتي والأعراض لا ثبات لها فالخير في الإنسان ذاتي وهو الذي يبقى لها حكمه والشر عرضي فيزول ولو بعد حين قال تعالى ولَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ وهذا مثل قوله يا عِبادِيَ فأضافهم إلى نفسه كما أضاف إلى نفسه نفوسهم في خلقها فقال ونَفَخْتُ فِيهِ من رُوحِي وكُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ ثم قال الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ والإسراف كرم عام خارج عن الحد والمقدار وكذا قال في الإنفاق لَمْ يُسْرِفُوا ولَمْ يَقْتُرُوا أي لم يوسعوا ما يخرج عن الحاجة ولَمْ يَقْتُرُوا لم ينقصوا مما تمس إليه الحاجة لا تَقْنَطُوا من رَحْمَةِ الله فإنها وَسِعَتْ كُلَّ شَيْ‏ءٍ وأنتم من الأشياء وقد عرفتكم كيف أنشأتكم ومن أي شي‏ء أنشأتكم من روح مطهرة وطبيعة موافقة قابلة طائعة غير عاصية ولا مخالفة إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً فما أبقى منها شيئا فبأي شي‏ء يسرمد عليهم العذاب ولا يكون إلا جَزاءً وِفاقاً وقد غفر وما غفر له فلا حكم له فإن الذي غفر له هُوَ الْغَفُورُ الرَّحِيمُ والغفور الرحيم لذاته فلا يبرح من حين له يغفر مغفورا له لا يعود إليه حكم الذنب لأن الحافظ هو الغفور الرحيم فلو أزاله وغفره غير هذا الاسم وأمثاله أمكن أن لا يثبت لعدم الحافظ له فتنبه لما أعلمناك به فإنه من لباب المعرفة\n\n\n### [أن الكمل من رجال الله الخلفاء في العالم‏]\n\n\nواعلم أن الكمل من رجال الله الخلفاء في العالم الذين عبدوا على المشاهدة لا على الغيب هم الذين تكون لهم الرؤية الإلهية جزاء لا زيادة ومن نزل عن هذا الكمال هو الذي تكون له زيادة على الجزاء في قوله لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ وهوقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا وزنت فارجح لما قضى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما كان عليه فلما وزنه قال للذي بيده الميزان أرجح‏\n\n\nليزيد له على ما يستحق لما رأى أن الحق قد ذكر الزيادة على المعاوضة وقال في هذا المقام أحسنكم أحسنكم قضاء\n\n\nفهذا هو الإخلاص في الدين الذي هو الجزاء وهنا يظهر معنى‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم وأعوذ بك منك‏\n\n\nلأنه لما نطق صَلَّى اللهُ عَليهِ وسَلَّم بالاستعاذة به بضمير الخطاب من غير تعيين اسم لم يجد له مقابلا لأنه ما عين اسما فلم يجد من يستعيذ منه فرأى نفسه على صورته فقال منك فاستعاذ بالله من نفسه لأن النفس الذي هو المثل وردت في القرآن مثل قوله فَلا تُزَكُّوا أَنْفُسَكُمْ أي أمثالكم وقال صَلَّى اللهُ عَليهِ وسَلَّم لا أزكي على الله أحدا\n\n\nوقال كَخِيفَتِكُمْ أَنْفُسَكُمْ أي أمثالكم فيتوجه‏\n\n\nقوله وأعوذ بك منك‏\n\n\nأن الكافين واحدة ويتوجه أن الكاف في منك تعود على المثل وهو نفس المستعيذ فإنه خليفة محصل للصورة على أتم الوجوه فاستعاذ بالله من نفسه لما يعلمه من المكر الخفي الإلهي فإنه ما أظهر الصورة المثلية في هذه النشأة على التشريف فقط بل هي شرف وابتلاء فمن ظهر بحكم الصورة على الكمال فقد حاز الشرف بكلتي يديه فإن الصورة الإلهية لا يلحقها ذم بكل وجه ومن نقص عن هذا الكمال كان في حقه مكرا إلهيا من حيث لا يشعر كما إن الخلافة في العالم ابتلاء لا تشريف ولهذا\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم إنها في الآخرة مندمة\n\n\nلما يتعين على‏\nصاحبها من الحقوق التي يطالب بها يوم القيامة حتى يتمنى أنه لم يل أمرا من أمور العالم وقد جعلنا رعاة\n\n\nفقال كلكم راع وكلكم مسئول عن رعيته‏\n\n\nفلكل شخص حكم من الصورة الإلهية فمن جمعت له الصورة بكمالها لم يسأل فإن الله لا يُسْئَلُ عَمَّا يَفْعَلُ وهُمْ يُسْئَلُونَ ومن لا ينطق عن الهوى لا يسأل عما يقول سؤال مناقشة وحساب ولكن قد يسأل سؤال استفهام لإظهار علم يستفيده السامعون كسؤال الحق رسله وهم لا ينطقون عن الهوى يوم يجمعهم فَيَقُولُ ما ذا أُجِبْتُمْ فيقولون لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ فيعلم أهل الموقف أصحاب الكشف أن الرسل هم أتم العالم كشفا ومع هذا فما أطلعهم الله على إجابة القلوب من أممهم ولا إجابة من وصلت إليهم دعوتهم ولم يكونوا حاضرين ولا من كان حاضرا وأجابه بلسانه هل أجابه بقلبه كما أجابه بلسانه فإن قلت فقد سمع إجابة من أجابه بلسانه وما أجابه به قلنا لقرائن الأحوال حكم لا يعرفه إلا من شاهدها وقد عرفنا من عين جواب الرسل عليه السلام أنهم فهموا عن الله عند هذا السؤال أنه أراد إجابة القلوب فإنهم قالوا لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ فلو فهموا من سؤاله تعالى إجابة الألسنة لفصلوا بين من سمعوا إجابته بإقراره بلسانه وبين من لم يسمعوا ذلك منه فلما ذكروا في الجواب الغيوب علمنا إن السؤال كان عن جواب القلوب واستفدنا من هذا أن الذي يكشف له ما يلزم أن يعم كشفه كل شي‏ء لكن عنده استعداد الكشف لا غير فما جلى له الحق من أسرار العالم في مرآة قلبه إن كان معنى أو في مرآة بصره إن كان صورة كشفه ورآه لا غير فإن قلت فمن كان الحق بصره قد سمعتك تقول فيمن هذا حاله إنه يدرك كل مبصر في الكون ولا يغيب عن بصره شي‏ء لأنه ناظر بحق قلنا صدقت ولكن فرق ما بين المقام والحال والأحوال لا بقاء لها وهذا حال فعند حصوله صح له هذا الكشف في ذلك الزمان ولما رفع عنه رجع ينظر بعين خلق بإمداد حق لا بحق فيكون حكمه حكم خواص الخلق له الكشف الجزئي لا الكلي إذ لا يكشف إلا المعتاد الذي للعموم فإذا كشف كل مبصر في العالم كشفه على ما هو عليه في وقته فلما رفع عنه لم يعرف ما آل إليه أمر تلك المبصرات في زمان رفع هذا الكشف هل بقوا على ما كانوا عليه أو هل انتقلوا عن ذلك وطلب الله منهم العلم بذلك لقولهم لا عِلْمَ لَنا والجواب بالظنون لا يليق ثم تمموا فقالوا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ فقيدوه بالغيوب فإنه في يوم تبلى فيه السرائر والسرائر غيوب العالم بعضهم عن بعض فعلمنا الحق بهذه الآية التأدب مع أصحاب الكشف وأن نعلم مراتب الكشف لئلا ننزل صاحب الكشف فوق منزلته ونطلب منه ما لا يستحقه حاله فنتعبه ولا نعذره ونصفه بالجهل في ذلك ولا علم لنا بأنا جهلنا فتكون جهالتان وكما إن للملائكة مقامات معلومة كذلك للبشر مقامات معلومة منها يكون المزيد لهم لا يتعدونها وإن زادوا علما فمن ذلك المقام وهو المقام الذي يكون فيه عند آخر نفس يكون منه ويفارق الروح تركيب هيكله المسمى موتا فمن ذلك المقام يكون له المزيد ولهذا يقع التفاضل بين الناس في الدار الآخرة ويزيد الله الذين أوتوا العلم وهم مؤمنون على المؤمنين الذين لم يؤتوا العلم درجات وبالمقامات فضل الله كل صنف بعضه على بعض وفي هذا المنزل من العلوم علم العرش هل العرش الذي استوى عليه الاسم الرحمن هو العرش الذي يأتي عليه الله الحكم العدل يوم القيامة للفصل والقضاء الذي تحمله الثمانية أو هو عرش آخر وهل إن كان عرشا آخر غير الذي استوى عليه فما معنى‏\n\n\nقول الرسول صَلَّى اللهُ عَليهِ وسَلَّم لما نزلت هذه الآية ويَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ يعني يوم الآخرة قال وهم اليوم أربعة\n\n\nوما هؤلاء الثمانية المنكرة هل كلهم أملاك أو ليسوا بأملاك أو بعضهم أملاك وبعضهم غير أملاك وهل العرش سريرا وهو ملك معين من الملك ما هو الملك كله لأنه فيه أتى للفصل والقضاء بين عباده وعباده من الملك فلا بد أن يكون ملكا معينا وهل هذا العرش الذي يأتي عليه يوم القيامة هو ظلل الغمام التي يأتي فيها الله يوم القيامة أم لا والملائكة هي التي تأتي في ظُلَلٍ من الْغَمامِ ويكون إتيان الله مطلقا من هذا التقييد وفيه علم نهاية سطح العرش هل له فوقية أم لا وما معنى له حول وما معنى الاستواء عليه إذا لم يتصف بأن له فوقا فإنه نهاية الجسم فلا خلاء ولا ملأ بعده وهذا كله إذا كان العرش سريرا أو ملكا خاصا من العالم فإن كان العرش عبارة عن العالم كله لا عالم الأجسام كان له حكم آخر ليس هذا حكمه هذا كله يتضمنه هذا المنزل ويحتاج إلى العلم به ليعلم الأمر على ما هو عليه وفيه علم اختلاف الاستواء باختلاف الأدوات الداخلة وبعدم الأدوات وفيه علم اختلاف الجماعات ولم لم يكن الكل جماعة\nواحدة وبما ذا تميزت جماعة من أخرى وما الصفة التي عدمتها كل جماعة حتى تفرقت الجماعات ولم تفترق إلى آحاد وفيه علم أول قوة يكون لها الحكم عند البعث من قوى الحس وهل يتقدمها حكم قوة أخرى من قوى الحس قبل البعث أم لا وفيه علم انتشار الروح الإلهي على الأجسام كلها وفيه علم أحوال حكم الله يوم القيامة في الخلق وبأي اسم يتجلى في ذلك اليوم وفيه علم القوة الإلهية والنشر والطي في أي أوان يكون وهل يتقدم بعث العالم أو يتأخر فإن تأخر فأين يكون العالم عند ذلك وهل تجتمع الملائكة والبشر في صعيد واحد في ذلك اليوم أم لا وفيه علم منزلة من وصف الحق بأوصاف الخلق من الذم ومبلغه من العلم في ذلك وفيه علم تأديب الصغير والكبير وهو قوله إياك أعني فاسمعي يا جارة وفيه علم الأدوات في ترتيب الخطاب وما تفيد كل أداة منها واشتراك الأدوات في الصورة واختلافها في الحكم كلفظة لا فصورتها واحدة وهي من جملة الأدوات وأحكامها مختلفة بحسب الحضرة التي تتجلى فيها فيكون حكمه النفي ويكون النهي ويكون العطف وهكذا سائر الأدوات وهذا من علم البيان الذي علمه الإنسان وفيه علم الايمان المذموم في الشرع وهل حكم الايمان في نفسه حكم الشرع فيه أم لا وهل يعدل به عن حقيقته فيظهر له تجل في غير حقيقته صورته فيسمى به الصورة التي انتقل إليها وفيه علم مراتب الكذب ومحموده من مذمومه وأين يجب استعماله وأين يحرم استعماله ومراتب المكذبين وفيه علم مرتبة الخنثى وهو الذي تنسب إليه الذكورة فيقبلها وتنسب إليه الأنوثة فيقبلها فهل هو ذكر أو أنثى أو لا ذكر ولا أنثى فإن الله قال خَلَقَ الذَّكَرَ والْأُنْثى‏ فهل يتضمن هذا الخطاب الخنثى فإنه مخلوق ينسب إليه الأمران فيدخل تحت هذا الخطاب أو هو خارج عن هذا الخطاب ويدخل تحت قوله الله خالِقُ كُلِّ شَيْ‏ءٍ فإن الخنثى برزخ متوسط فإن اسم الحيوان ينطلق عليه ولا بد فإنه ليس من خصائص الإنسان كما أن الذكورة والأنوثة ليست من خصائص النوع الإنساني وفيه علم التهيؤ لانتظار الفجئات لأنه لا يدري بما يأتي وهذا مقام لم أر أحدا أتم مني فيه لله الحمد على ذلك وفيه علم التعمل في اكتساب الأهم فالأهم وهو من الحزم وأين موطنه من موطن التراخي وفيما ذا يكون التراخي أولى من الحزم وما يحمد من الحزم مع كونه سواء الظن ويبتني على هذا أمور كثيرة فهو علم شريف وفيه علم ما آل العالم المكلف من الإنس والجان والذين هم الملائكة وهل يرتفع عنهم الخوف أم لا يزال يستصحبهم أبد الآبدين وفيه علم التجلي في غير صورة العلم وفيه علم حجاب النعم ومتى هو الإنسان أتم حضورا مع الله هل في حال الشدة أو في حال الرخاء ولأي حال هو الحمد العام والحمد الخاص وفيه علم اختلاف المحامد لاختلاف الأحوال وفيه علم الأنس بمن يقع الأنس هل بالمناسب أو بغير المناسب أو بهما وفيه علم الاعتماد على الأسباب هل كله مذموم أو محمود أو منه ما هو مذموم ومنه ما هو محمود وما هو سبب بوضع الحق وما هو سبب بوضع الخلق وفيه علم مراتب العلم بالموت وفيه علم نفي الوكالة من الخلق وفيه علم الكفاية وبمن يكتفى وهل يصح الاكتفاء بمخلوق في أمر أم لا وفيه علم ما هو الإحسان ومن هو المحسن وعلم الإساءة ومن هو المسي‏ء وفيه علم المثلين إذا تماثلا من جميع الوجوه المعنوية هل يصطحبان أم لا فإن الفائدة قد ارتفعت ما بينهما وهذه مسألة لا يتنبه إليها إلا منور البصيرة من لا يزال مع الأنفاس يستفيد ومن ليست له هذه الحالة فليس بإنسان كامل الإنسانية لأنه ما أعطى النظر إلا ليستفيد وفيه علم الفرق بين معاملة الله ومعاملة الخلق وهل تتساوى عند\n\n\nالعامل المراقبة في المعاملتين أم لا ولا سيما عند من يرى أن الله قد جعل للعالم حقوقا بعضه على بعضه فيتعين على العامل مراقبة الخلق لأداء الحقوق التي أوجبها الله عليه لهم فهل ذلك من مراقبته فيكون ما راقب إلا الحق أو هل ذلك من مراقبة الخلق‏\n\n\nفيرجع ذلك إلى استحقاق هذه الحقوق وهل استحقها العالم على هذا الشخص لذاتهم أعني لذات المستحقين أو هل يستحقها بجعل الله فيعلم من هذا المنزل صورة الأمر على حقيقته من جمع أو تفصيل وفيه علم تفاضل طبقات العذاب والنعيم وفيه علم ضرب الأمثال ومن ينبغي أن يضرب له مثل ومن ينبغي أن لا يضرب له مثل لقوله فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ وهو قد ضرب الأمثال فقال إِنَّ الله يَعْلَمُ كيف يضربها وأَنْتُمْ لا تَعْلَمُونَ فناط بهم الجهل بالمواطن فالعالم يقطع عمره في نظر ما ضرب الله له من الأمثال ولا يستنبط مثلا من نفسه ولا سيما لله وما أظن يفي عمر الإنسان بتحصيل علم ما ضرب الله له من الأمثال وفيه علم من يبين عن الله هل يسمى هاديا أم لا فإنه مهدي بلا شك وفيه علم حال‏\nالقرآن في التالين عن الله العارفين بتنزله على قلوبهم وما يورثهم ذلك من القبض والبسط وأي الصفتين يتقدم حكمها في التالين بالحال أو في القبض أو البسط وفيه علم فضل العقل في العقلاء وما لب العقل هل حكمه حكم العقل أم لا فإن الله فرق الآيات فجعل آيات لِأُولِي الْأَلْبابِ وآيات لِقَوْمٍ يَعْقِلُونَ فقيدهم من العقال وهو التقييد وفيه علم المقرب هل له حد عند الله في نفوذ عنايته أو تنفذ عنايته مطلقا وفيه علم شرف اتباع ما شرع الله اتباعه من مكارم الأخلاق وفيه علم الربح والخسران لما ذا يرجعان وفيه علم الحذر العقلي والحذر المشروع هل هو الحذر العقلي الذي بعينه العقل أم لا تعيين في ذلك إلا للشرع أو فيه ما جعل الله تعيينه للعقل فاكتفى به عن تعيينه في الشرع ومنه ما جعل الله تعيينه للشرع وفيه علم ما يكره وما لا يكره وفيه علم نش‏ء الذرية لإنشاء الإنسان بما هو إنسان وفيه علم التداخل في الأشياء إذا كانت أحوالا وأعراضا كتداخل الرائحة واللون والسكون والعلم والجهل في الذات الواحدة في الزمن الواحد وفيه علم تعيين أنصبة الشركاء في الشي‏ء وأنها إذا تعينت فليسوا بشركاء ولا بد أن يكون النصيب في نفس الأمر معينا وإن وقعت الإشاعة فلجهل الشركاء في ذلك فإنه لا بد أن يتعين إذا وقعت القسمة إما في عين الشي‏ء أو في قيمته فإذا لا تصح الشركة أصلا لأن الأمور معينة عند الله في هذا الشي‏ء المسمى مشتركا فيه وقد ثبت اسم الشركاء عرفا وشرعا فلما ذا يرجع أ لا ترى إلى الذين اتخذوا مع الله شركاء في الألوهة هل لهم منها نصيب فإذا علمت أنه ليس لهم نصيب في الألوهة فما هم شركاء وقد سموا شركاء فيعلم أنه لا تصح الشركة في العالم أصلا للاتساع الإلهي فلا يشترك اثنان فصاعدا في أمر قط فالذي عند هذا مثل لما عند هذا ما هو عين ما عند هذا وإن انطلق على ذلك اسم الاشتراك فنقول ما وقع به الاشتراك غير ما وقع به الامتياز وما ثم إلا الامتياز خاصة ما ثم اشتراك إذا ليس هذا الذي عند هذا هو عين الآخر عند الآخر فيعلم من هذا الكشف معنى إطلاق الشركة في العرف وأن الشرع تبع العرف في ذلك ليفهم عنه لأنه جاء بلسان قومه وهو ما تواطئوا عليه ولهذا اختلف الناس في الرسول هل له وضع لغة في ذلك اللسان أو ليس له ذلك وفيه علم اختلاف تنزل الشرائع من الله باختلاف الأحوال والأزمان والأماكن والأشخاص والنوازل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Forty-Five: Concerning the knowledge of the station of the secret of Sincerity (الإخلاص) in Religion (الدين), the nature of Religion, why the Law (الشرع) was named Religion, and the saying of the Prophet (peace and blessings be upon him), \"Goodness is a habit.\"\n\nFor every person, there is a Sura from the Quran,\nAnd my Sura from the Book of Allah is a Revelation (تنزيل).\n\nThe High Assembly (الملأ العلوي) brought it, led\nBy Michael and Gabriel during the descent (التنزل).\n\nThey brought it, its folds bending softly,\nAnd within its sides are guidance (هدى) and misguidance (تضليل).\n\nIf you look, you see wonder in its verses:\nFire and Light, Transcendence (تنزيه) and Analogy (تمثيل).\n\nA virgin of glances, with dark eyes (دعج) in her lids,\nWhose gaze was not drawn by the kohl stick.\n\n### [Sincerity in Religion]\n\nThis Sura was manifested to us in the city of Aleppo, and when I saw it, it was said to me: \"This is a Sura untouched by man or jinn.\" I felt a great inclination toward it and from it. It was represented to me in the likeness of this station (منزل) which I had entered before. Then it was said to me: \"It is purely (خالِصَةً) for you, exclusive of the believers.\"\n\nWhen this was said to me, I understood the Ash'aris (theologians) and knew that it was my Essence (ذاتي) and the very substance of my form (عين صورتي), and not other than me. For there is nothing belonging to any existent being that is purely (مخلص) for him, not shared by others, whether ancient or recent, except his own specific Essence (ذاته خاصة). I said, \"Here I am.\" I then understood the meaning of purification/exclusivity (التخليص) and understood what was recited to me concerning what was revealed to me of the Quran during the recitation.\n\nThis is because when the inspiration (الإلهام) descended to recite the Sura of Sincerity (الإخلاص), I was granted the very essence of understanding (عين الفهم) regarding its naming by this name, unlike other Suras. For all of them are the lineage and description (صفة) of Allah, and they are the very substance of the totality of the World (عين مجموع العالم). I understood the indication therein: that the World (العالم), despite being the Manifest Reality (الحق المبين) in its totality, is not so in terms of each individual part. Thus, the lineage is purified/exclusive (تخلص) for Allah in terms of His Essence (ذاته). This totality (المجموع) is, in Reality (الحق), a single entity (عين واحدة), and in the World, it is the very substance of the Manifest Reality (عين الحق المبين).\n\nA group of the Jewish community said: \"Attribute your Lord to us.\" So, He attributed Him to the totality of the World (مجموع العالم) through what was revealed to him by Allah the Exalted concerning this. He was told: <<قُلْ هُوَ الله أَحَدٌ>> (Say: He is Allah, One). He described Him with Oneness (الأحدية). Every part of the World has a specific oneness (أحدية) belonging to it, in which it is not shared, and by which it is distinguished and specified from everything else, despite having shared attributes.\n\nThen He was told: <<الله الصَّمَدُ>> (Allah, the Eternal Refuge/The Self-Sufficient). He is the One sought in all matters (يصمد إليه), meaning, the One resorted to. All established causes (الأسباب الموضوعة) in the World are resorted to, and this is why they are called 'causes,' for their effects (مسبباتها) are connected to the First Self-Sufficient (الصمد الأول), to Whom the causes resort.\n\n<<لَمْ يَلِدْ>> (He begets not). He is the barren (العقيم) One who does not give birth. By this attribute, the wind (الريح) is described as barren, because some winds are fertilizing (لواقح) and some are barren.\n\n<<وَلَمْ يُولَدْ>> (Nor was He begotten). Adam (peace be upon him) was not begotten. Since birth is known to the questioners, they were addressed with what is known to them.\n\n<<وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ>> (And there is none comparable to Him). By *kufu* (كفو) here, He meant a spouse (الصاحبة), because of the statement of those who said that Christ is the son of God and Uzayr is the son of God. *Kafa'a* (الكفاءة) means likeness or equal. A woman is never equal (تماثل) to a man, for Allah says: <<وَلِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ>> (But men have a degree over them). Thus, she is not an equal (كفو) to Him. The passive recipient (المنفعل) is not an equal to its active agent (فاعله). The World is passive relative to Allah, so it is not an equal (كفو) to Allah. Eve (حواء) was passive relative to Adam, so he has the degree of agency (فاعلية) over her, and she is not his equal in this respect.\n\nWhen He said that men have a degree over women, He did not make Jesus (peace be upon him) passive relative to Mary, so that the man would not be passive relative to the woman, as Eve was relative to Adam. <<فَتَمَثَّلَ لَها>> (Then [Gabriel] appeared to her) or the Angel <<بَشَراً سَوِيًّا>> (as a man in all respects). And he said to her: <<أَنَا رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلاماً زَكِيًّا>> (I am the messenger of your Lord to give you a pure boy). So, he bestowed Jesus (peace be upon him) upon her. Thus, the passivity of Jesus was relative to the Angel represented in the form of a man. Therefore, he emerged in the form of his father: male, human, spirit (روحا). He combined the two forms that his father, the Angel, possessed, for the Angel is a spirit in terms of his essence (عينه) and a human in terms of his representation in the human form.\n\nHe named this Sura the Sura of Sincerity (الإخلاص), meaning that the Real (الحق) is purified/exclusive (خلص) for the World from the Transcendence (التنزيه) that the intellect demonstrates, and He purified it from the World by the totality of these Attributes (الصفات) in a single entity (عين واحدة). These Attributes, I mean, are dispersed throughout the World and are not gathered in a single entity. For Adam (peace be upon him) was the most complete form that appeared in the World, yet he lacked the attribute <<لَمْ يَلِدْ>> (He begets not). He is One (أحد), Self-Sufficient (صمد), <<لَمْ يُولَدْ>> (Nor was He begotten), and Eve was not an equal (كفوا) to him. Thus, this Sura purified the Real from Anthropomorphism (التشبيه), just as it purified Him from Transcendence (التنزيه). If you understand what we have indicated...\n\n### [The Secret of Sincerity is the Secret of Destiny which Allah concealed its knowledge from the World]\n\n...know that the secret of Sincerity (سر الإخلاص) is the secret of Destiny (سر القدر), the knowledge of which Allah concealed from the World—indeed, from most of the World. He distinguished things by their limits (حدودها). This is the meaning of the secret of Destiny, for it is the very act of definition (التوقيف عينه). By it, things were distinguished, and by it, the Creator was distinguished from the created, and the originated (المحدث) from the Eternal (القديم).\n\nThe originated is distinguished by a fixed, knowable, and witnessed attribute (نعت ثابت). But the Eternal is not distinguished from the originated by a fixed, knowable attribute; rather, He is distinguished only by the negation of what distinguishes the originated from Him. He, the Glorified, is the Known (المعلوم) and the Unknown (المجهول). None is known except Him, and none is unknown except Him. Glory be to Him, for Whom knowledge of Him is the very substance of ignorance of Him, and ignorance of Him is the very substance of knowledge of Him. There is no greater or clearer distinction than this for one who understands and perceives.\n\nAs for Sincerity (الإخلاص) in Religion (الدين), it is the fitting recompense (الجزاء الوفاق). There is no recompense that is not fitting (وفاق), neither decreasing nor increasing, for Allah made it <<جَزاءً وِفاقاً>> (a fitting recompense), informing us of a reality. This is because the recipient of the recompense cannot accept what his preparedness (استعداده) does not grant him. By his preparedness, he accepted the Religion that appeared upon him, in which he seeks the recompense—meaning, the preparedness precedes the recompense. Thus, the recompense was fitting (وفاقا).\n\nRecompense is only for the deed (العمل), and the doer receives it only from his own deed. This is why it is said that in Paradise there is what no eye has seen, no ear has heard, and what has not occurred to the heart of man—and this is correct. This is because a deed issues from the doers without the intention of what their eye saw, their ear heard, or what occurred to their heart, except when it appeared from him, his eye saw it then, and it occurred to him. Similarly, he sees in Paradise what he did not see in the world, nor hear of, nor occur to his heart. That is the fitting recompense (الجزاء الوفاق) for this type of deed. This deed stems from His saying, the Exalted: <<وَنُنْشِئَكُمْ فِي مَا لَا تَعْلَمُونَ>> (And We will create you in that which you do not know). He manifested it in a station (منزل) that the person does not know through his thought, nor did his eye see it, nor his ear hear that he would be established therein. Thus, his recompense is what He mentioned in Paradise: what no eye has seen, no ear has heard, and what has not occurred to the heart of man. The recompense for this deed is purified (خلص) by the attribute of fittingness (الوفاق). This is part of the secret of Destiny (سر القدر).\n\nSince Religion (الدين) is the doing of good (عمل الخير), and Religion is habit (العادة), the Prophet (peace and blessings be upon him) mentioned that Goodness is a habit (الخير عادة).\n\nThis mention is a divine assurance (بشارة إلهية) from one who knows matters—the Messenger (peace and blessings be upon him)—that the soul (النفس) is inherently good (خيرة بالذات). It only accepts evil (الشر) due to the insistence (لجاجة) of the companion (القرين) through what he presses upon it. Thus, he did not attribute evil to its essence (ذاتها).\n\nSo he said (peace and blessings be upon him): \"Goodness is a habit (عادة), and evil is insistence (لجاجة).\"\n\nWhen the companion (القرين) insisted upon the soul and pressed it with evil—which is the very substance of opposing Allah's command and prohibition—and its outlets (منافسها) became constricted by this insistence and pressure, Allah revealed to it—or rather, spoke to it from the special aspect (الوجه الخاص) that the Angel does not know—to accept from the companion what he insisted upon of evil. The Real (الحق) saw in the soul a sense of alienation (استيحاشا) and fear of the Divine Deception (المكر الإلهي). So, He made it witness the Presence of Substitution (حضرة التبديل) and made it witness the ultimate destination of the responsible ones (المكلفين) toward Mercy. He recited to it: <<يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ>> (Allah substitutes their evil deeds with good deeds). And He recited to it concerning the extravagant ones (المسرفين): <<لَا تَقْنَطُوا مِنْ رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً>> (Do not despair of the Mercy of Allah. Indeed, Allah forgives all sins).\n\nHe removed its alienation, and it accepted the evil that the companion brought to it. The companion rejoiced at its acceptance, due to his ignorance of the universality of Mercy and the universality of Pardon and Forgiveness. He did not know that Allah had placed the soul, in its acceptance of the companion's evil through insistence and pressure, in the position of one compelled (المكره), and the compelled is not held accountable. He named evil 'insistence' (لجاجة) as a divine assurance (بشارة إلهية) that not everyone perceives, and He made goodness a 'habit' (عادة).\n\nThis is because the soul is inherently good (خيرة بالذات), for its father is the pure Holy Spirit (الروح القدسي الطاهر), and its nature (طبعها) is goodness, nothing else. Its mother is this formed image (الصورة المسواة) made of these mixtures (الأخلاط). The first acceptance that appeared in it was the acceptance of balance and justice (السواء والعدل), which is His saying: <<فَسَوَّاكَ فَعَدَلَكَ>> (Then He fashioned you and balanced you). The acceptance of justice is the very substance of goodness.\n\nThis creation (النشأة) accepted, by its origin (بالأصالة), the juxtaposition of opposites (مجاورة الأضداد), which are the mixtures. It is the habit of an opposite to repel its opposite, yet no repulsion was found here. This indicates the goodness of the origin (خيرية الأصل). Then, its acceptance, after the balancing and fashioning (التعديل والتسوية), was the breathing of the Holy Spirit (نفخ الروح القدسي). The first acceptance it received, beyond its initial creation, was the breathing of this pure, purifying, good Spirit. For this reason, goodness is a habit (عادة) for it by the nature (الطبع) upon which it was created.\n\nTherefore, in the end (في المال), it returns to its origin, for its origin, as we mentioned, is the acceptance of goodness. Thus, Mercy overtakes it in the end, just as its existence was the very substance of Mercy. The matter is concluded with that with which it began, and the conclusion is the very substance of the precedence (السابقة).\n\nWhat supports what we have mentioned is that the first human creation (أول نشأة إنسانية), which was the origin of all human creations, was in the utmost sanctity (غاية التقديس) and the peak of honor, being created upon the Divine Image (الصورة الإلهية). Nothing appeared from it except what was appropriate. Just as what was appropriate for it—despite the existence of opposition (المخالفة) required by the realities of the opposing Divine Names (الأسماء الإلهية المقابلة)—was that no word of blame should touch it for the opposition of some parts to others, similarly, the opposition that appeared in this human creation will not lead, in the end, to eternal torment (تسرمد عذاب).\n\nThe origin protects it from that, which is the Image (الصورة). Thus, it was compelled (مجبورة) in its opposition. Opposition is necessary because the Names must oppose each other in the one created upon His Image. The Benefactor (النافع) is not the Harmful (الضار), nor is the Giver (المعطي) the Withholder (المانع). The manifestation of these realities is necessary in this creation so that the completeness of the Image (كمال الصورة) may be valid. The obedient (الطائع) opposes the disobedient (العاصي), the polytheist (المشرك) opposes the monotheist (الموحد), the negator (المعطل) opposes the affirmer (المثبت), and the conformer (الموافق) opposes the opposer (المخالف)—all through the sustenance (إمداد) of the Divine Names. This is His saying: <<كُلًّا نُمِدُّ هَؤُلَاءِ وَهَؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ>> (We extend to all—to these and to those—from the gift of your Lord), meaning the obedient and the disobedient, the people of good and the people of evil. <<وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا>> (And the gift of your Lord is not restricted/forbidden), because He gives for His own Essence (لذاته). The receptive loci (المحال القوابل) accept according to their preparedness (استعدادها), and their preparedness is the effect of the Divine Names upon them. Among the Divine Names are the conforming ones, like the Merciful (الرحيم) and the Forgiving (الغفور) and their likes, and the opposing ones, like the Exalter (المعز) and the Humiliator (المذل). The preparedness of this locus must be under the ruling of one of these Names.\n\nThus, its acceptance of the Divine ruling is according to that, whether opposing or conforming. When this is its state, how can intrinsic blame (ذم ذاتي) attach to it? Accidents (الأعراض) have no permanence. Goodness in man is intrinsic (ذاتي), and its ruling remains for him, while evil is accidental (عرضي) and will vanish, even if after a time. The Exalted said: <<وَلَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ>> (And you will surely know its news after a time). This is like His saying: <<يَا عِبَادِيَ>> (O My servants), where He attributed them to Himself, just as He attributed their souls to Himself in their creation when He said: <<وَنَفَخْتُ فِيهِ مِنْ رُوحِي>> (And I breathed into him of My Spirit). And <<كُلًّا نُمِدُّ هَؤُلَاءِ وَهَؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ>> (We extend to all—to these and to those—from the gift of your Lord). Then He said: <<الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ>> (Those who were extravagant against themselves). Extravagance (الإسراف) is a general generosity (كرم عام) that exceeds the limit and measure. Similarly, He said regarding spending: <<لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا>> (They were neither extravagant nor stingy), meaning they did not expand beyond necessity, nor did they restrict what necessity required. <<لَا تَقْنَطُوا مِنْ رَحْمَةِ الله>> (Do not despair of the Mercy of Allah), for it <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompasses everything), and you are among the things. I have informed you how I created you and from what I created you: from a purified spirit and a conforming nature (طبيعة موافقة) that is receptive, obedient, neither disobedient nor opposing. <<إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً>> (Indeed, Allah forgives all sins). Since He left nothing unforgiven, by what means would eternal torment be imposed upon them? It can only be <<جَزَاءً وِفَاقاً>> (a fitting recompense). He has forgiven, and what is forgiven has no ruling (حكم) remaining. For the One who forgave him is <<هُوَ الْغَفُورُ الرَّحِيمُ>> (He is the Forgiving, the Merciful). The Forgiving, the Merciful acts by His Essence (لذاته). Therefore, from the moment He forgives him, he remains forgiven, and the ruling of the sin does not return to him, because the Preserver (الحافظ) is the Forgiving, the Merciful. If this forgiveness were removed and granted by a Name other than this Name and its likes, it would be possible for it not to remain, due to the absence of its Preserver. Pay attention to what we have informed you, for it is from the core of Gnosis (لباب المعرفة).\n\n### [The Perfected Men of Allah are the Caliphs in the World]\n\nKnow that the perfected ones (الكمل) among the men of Allah, the Caliphs (الخلفاء) in the World, who worshiped through Witnessing (المشاهدة) and not through the Unseen (الغيب), are those for whom the Divine Vision (الرؤية الإلهية) is the recompense (جزاء) itself, without addition (زيادة). He who falls short of this perfection is the one for whom there is an addition to the recompense, as in His saying: <<لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ>> (For those who have done good is the best [reward] and increase). This relates to the saying of the Messenger of Allah (peace and blessings be upon him): \"When you weigh, make the scale heavier (ارجح).\" This was when the Messenger of Allah (peace and blessings be upon him) settled a debt he owed. When he weighed it, he said to the one holding the scale, \"Make it heavier,\" so that he might add to what was due, seeing that the Real (الحق) mentioned the increase (الزيادة) over the equivalent exchange (المعاوضة). In this context, he said: \"The best among you is the one who is best in repayment (أحسنكم قضاء).\"\n\nThis is the Sincerity (الإخلاص) in Religion (الدين), which is the recompense. Here, the meaning of his saying (peace and blessings be upon him) becomes apparent: \"And I seek refuge in You from You (وأعوذ بك منك).\"\n\nWhen he (peace and blessings be upon him) uttered the seeking of refuge in Him (ضمير الخطاب) without specifying a Name, he found no opposite for Him, because he did not specify a Name from which to seek refuge. He saw himself upon His Image (صورته) and said, \"from You (منك).\" He sought refuge in Allah from his own self (نفسه), because the self (النفس), which is the likeness (المثل), occurred in the Quran, such as His saying: <<فَلَا تُزَكُّوا أَنْفُسَكُمْ>> (So do not purify yourselves), meaning your likenesses (أمثالكم). And the Prophet (peace and blessings be upon him) said: \"I do not purify anyone before Allah.\" And He said: <<كَخِيفَتِكُمْ أَنْفُسَكُمْ>> (As you fear yourselves), meaning your likenesses. His saying, \"And I seek refuge in You from You,\" can be interpreted such that the two *kafs* (You) are one. It can also be interpreted such that the *kaf* in \"from You\" (منك) refers back to the likeness (المثل), which is the self of the seeker of refuge, for he is a Caliph (خليفة) who has realized the Image (الصورة) in the most complete way. He sought refuge in Allah from his self because of what he knew of the subtle Divine Deception (المكر الخفي الإلهي). For He did not manifest the likeness-Image (الصورة المثلية) in this creation merely for honor (تشريف), but it is both honor and trial (ابتلاء). Whoever manifests the ruling of the Image completely has seized honor with both hands, for the Divine Image is not subject to blame in any respect. Whoever falls short of this perfection is subject to Divine Deception (مكرا إلهيا) in his regard, without him perceiving it. Just as vicegerency (الخلافة) in the World is a trial, not an honor.\n\nFor this reason, he (peace and blessings be upon him) said: \"It will be a cause of regret (مندمة) in the Hereafter,\" due to the rights (الحقوق) incumbent upon its holder, for which he will be held accountable on the Day of Resurrection, until he wishes he had never governed any matter of the World. Yet, we have been made shepherds. He said: \"All of you are shepherds, and all of you are responsible for your flock.\"\n\nEvery person has a ruling from the Divine Image. He for whom the Image is gathered in its completeness is not questioned, for Allah <<لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ>> (is not questioned concerning what He does, but they will be questioned). And he who does not speak from caprice (لا ينطق عن الهوى) is not questioned about what he says in terms of scrutiny and reckoning. However, he may be questioned for the purpose of inquiry (سؤال استفهام) to manifest knowledge that the listeners may benefit from. This is like the questioning of the Real (الحق) to His Messengers, who do not speak from caprice, on the Day He gathers them: <<فَيَقُولُ مَاذَا أُجِبْتُمْ>> (Then He will say: \"What was the response you received?\"). They will say: <<لَا عِلْمَ لَنَا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ>> (We have no knowledge; indeed, You are the Knower of the unseen [الغُيُوب]).\n\nThe people of the station (أهل الموقف)—the people of Unveiling (أصحاب الكشف)—will know that the Messengers are the most complete in Unveiling in the World. Yet, Allah did not inform them of the response of the hearts of their nations, nor the response of those whom their call reached but were not present, nor whether those who were present and responded with their tongues also responded with their hearts. If you say: \"But he heard the response of those who responded with their tongues and what they responded with,\" we say: \"The circumstantial evidence (قرائن الأحوال) has a ruling that is known only to those who witness it.\" We know from the very answer of the Messengers (peace be upon them) that they understood from Allah, upon this question, that He intended the response of the hearts. For they said: <<لَا عِلْمَ لَنَا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ>> (We have no knowledge; indeed, You are the Knower of the unseen). Had they understood His question to mean the response of the tongues, they would have distinguished between those whose response they heard by their verbal affirmation and those from whom they did not hear it. When they mentioned the unseen (الغيوب) in their answer, we knew that the question was about the response of the hearts.\n\nWe benefit from this that the one to whom Unveiling (كشف) is granted is not necessarily required to have his unveiling encompass everything. Rather, he has the preparedness for Unveiling, nothing more. What the Real (الحق) manifests to him of the secrets of the World—in the mirror of his heart if it is a meaning, or in the mirror of his sight if it is a form—he unveils and sees, nothing else. If you say: \"As for the one whose sight is the Real (الحق بصره), I have heard you say that he perceives everything visible in the cosmos, and nothing is hidden from his sight, because he looks by the Real,\" we say: \"You speak truly, but there is a difference between the Station (المقام) and the State (الحال).\" States (الأحوال) have no permanence, and this is a state (حال). When it occurs, this Unveiling is valid for him during that time. When it is lifted from him, he returns to looking with a created eye (عين خلق) sustained by the Real (بإمداد حق), not by the Real (بحق). Thus, his ruling is the ruling of the elite of creation: partial Unveiling (الكشف الجزئي), not total, since only the customary (المعتاد) that is common to all is unveiled. If he unveils every visible thing in the World, he unveils it as it is at that moment. When the state is lifted, he does not know what became of those visible things in the time the Unveiling was lifted—whether they remained as they were or whether they changed. Allah sought knowledge of this from them, hence their saying: <<لَا عِلْمَ لَنَا>> (We have no knowledge). Answering based on conjecture (الظنون) is inappropriate. Then they completed their answer by saying: <<إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ>> (Indeed, You are the Knower of the unseen), restricting it to the unseen (الغيوب), for it is the Day when secrets (السرائر) are tested, and secrets are the unseen of the World, hidden from one another. Through this verse, the Real taught us the proper conduct (التأدب) with the people of Unveiling (أصحاب الكشف) and to know the degrees of Unveiling (مراتب الكشف), lest we place the person of Unveiling above his station and demand from him what his state does not warrant, thereby burdening him and failing to excuse him, and describing him as ignorant in that matter, while we are ignorant of our own ignorance—resulting in two ignorances.\n\nJust as the Angels have known stations (مقامات معلومة), so too do humans have known stations, from which their increase (المزيد) comes, and which they do not exceed. Even if they increase in knowledge, it is from that station—the station they are in at the last breath, when the spirit leaves the structure of the body, which is called death. From that station comes their increase. For this reason, there is differentiation among people in the Hereafter. Allah raises those who were given Knowledge (العلم) and are believers over the believers who were not given knowledge by degrees (درجات), and by stations (المقامات). Allah favored some categories over others.\n\nThis station contains the knowledge of the Throne (العرش): Is the Throne upon which the Name The Merciful (الرحمن) established Himself the same Throne upon which Allah, the Just Judge (الحكم العدل), will come on the Day of Resurrection for separation and judgment, which is borne by the eight? Or is it another Throne? If it is another Throne, what is the meaning of the saying of the Messenger (peace and blessings be upon him) when this verse was revealed: <<وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ>> (And eight will bear the Throne of your Lord above them on that Day)—meaning the Day of the Hereafter—he said: \"And today they are four\"? Who are these eight unknown ones? Are they all Angels, or not Angels, or some Angels and some not Angels? Is the Throne a couch (سريرا), and is it a specific kingdom (ملك معين) from the totality of the kingdom (الملك كله)? Because He comes upon it for separation and judgment among His servants, and His servants are part of the kingdom, it must be a specific kingdom. Is this Throne upon which He comes on the Day of Resurrection the shadows of the clouds (ظلل الغمام) in which Allah comes on the Day of Resurrection, or not? And are the Angels the ones who come <<فِي ظُلَلٍ مِنَ الْغَمَامِ>> (in shadows of clouds), and Allah's coming is absolute, free from this restriction? It contains the knowledge of the end of the surface of the Throne: Does it have an above (فوقية) or not? What is the meaning of its circumference (له حول)? What is the meaning of establishing Himself upon it (الاستواء عليه) if it is not described as having an above, since it is the limit of the body (نهاية الجسم), with no void or plenum beyond it? This is all if the Throne is a couch or a specific kingdom of the World. If the Throne is an expression for the entire World (العالم كله), excluding the world of bodies (عالم الأجسام), it has another ruling, not this one. All of this is contained within this station and requires knowledge to understand the matter as it truly is.\n\nIt contains the knowledge of the variation of establishment (الاستواء) based on the variation of the instruments (الأدوات) involved and the absence of instruments. It contains the knowledge of the variation of groups (الجماعات): Why were they not all one group? By what were some groups distinguished from others? What is the attribute that every group lacked, causing the groups to separate, yet not separating into individuals (آحاد)? It contains the knowledge of the first faculty (قوة) that will have ruling at the Resurrection (البعث) among the sensory faculties (قوى الحس). Does the ruling of another sensory faculty precede it before the Resurrection or not? It contains the knowledge of the diffusion of the Divine Spirit (الروح الإلهي) over all bodies. It contains the knowledge of the states of Allah's judgment over creation on the Day of Resurrection, and by which Name He will manifest Himself on that Day. It contains the knowledge of the Divine Power (القوة الإلهية), the Spreading (النشر), and the Folding (الطي): When will they occur? Does the Resurrection of the World precede or follow them? If it follows, where will the World be then? Will the Angels and humans gather on one plain (صعيد واحد) on that Day or not? It contains the knowledge of the station of one who describes the Real with the attributes of creation, the blame attached to him, and the extent of his knowledge in that matter. It contains the knowledge of disciplining the young and the old, which is His saying: \"I mean you, so listen, O neighbor.\" It contains the knowledge of the instruments (الأدوات) in the arrangement of discourse (الخطاب) and what benefit each instrument provides, and the sharing of instruments in form but their variation in ruling. For example, the word *lā* (لا): its form is one, and it is among the instruments, but its rulings vary according to the Presence (الحضرة) in which it manifests. Its ruling may be negation (النفي), or prohibition (النهي), or conjunction (العطف). This applies to all other instruments. This is part of the science of Elucidation (علم البيان) taught to man.\n\nIt contains the knowledge of the oaths (الايمان) blameworthy in the Law (الشرع). Is the ruling of the oath in itself the same as the ruling of the Law concerning it or not? Is it diverted from its reality, so that a manifestation (تجلي) appears to it in a form other than its reality, and that form to which it transferred is named by it? It contains the knowledge of the degrees of lying, its praiseworthy aspects from its blameworthy ones, where its use is obligatory, and where its use is forbidden, and the degrees of those who deny the truth (المكذبين). It contains the knowledge of the station of the hermaphrodite (الخنثى), to whom masculinity is attributed and he accepts it, and femininity is attributed and he accepts it. Is he male or female, or neither male nor female? For Allah said: <<خَلَقَ الذَّكَرَ وَالْأُنْثَى>> (He created the male and the female). Does this address include the hermaphrodite, since he is a created being to whom both matters are attributed, thus falling under this address? Or is he outside this address and falls under His saying: <<الله خَالِقُ كُلِّ شَيْءٍ>> (Allah is the Creator of all things)? The hermaphrodite is a mediating Isthmus (برزخ متوسط). The name 'animal' (الحيوان) must apply to him, for it is not exclusive to man, just as masculinity and femininity are not exclusive to the human species.\n\nIt contains the knowledge of preparedness for awaiting sudden events (الفجئات), because one does not know what will come. This is a station in which I have not seen anyone more complete than myself, praise be to Allah for that. It contains the knowledge of striving to acquire the most important things first, which is part of prudence (الحزم). Where is its place relative to the place of laxity (التراخي)? In what matters is laxity preferable to prudence? And what prudence is praiseworthy, despite being based on mere conjecture (سواء الظن)? Many matters are built upon this, so it is a noble science. It contains the knowledge of the ultimate destination (ما آل) of the responsible world (العالم المكلف) of humans, jinn, and those who are Angels. Will fear be lifted from them, or will it accompany them forever? It contains the knowledge of the Theophany (التجلي) in a form other than the form of knowledge. It contains the knowledge of the veil of blessings (حجاب النعم): When is man most fully present with Allah—in times of hardship or in times of ease? And to which state belongs the general praise (الحمد العام) and the specific praise (الحمد الخاص)? It contains the knowledge of the variation of praises due to the variation of states. It contains the knowledge of intimacy (الأنس): Does intimacy occur with the suitable (المناسب) or the unsuitable, or both? It contains the knowledge of reliance on causes: Is it all blameworthy, or praiseworthy, or is some of it blameworthy and some praiseworthy? What is a cause established by the Real (وضع الحق), and what is a cause established by creation (وضع الخلق)? It contains the knowledge of the degrees of knowledge concerning death. It contains the knowledge of the negation of agency (الوكالة) from creation. It contains the knowledge of sufficiency and in whom sufficiency is found. Is it valid to find sufficiency in a created being regarding a matter or not? It contains the knowledge of what Excellence (الإحسان) is and who the Excellent Doer (المحسن) is, and the knowledge of Evil (الإساءة) and who the Evil Doer (المسيء) is.\n\nIt contains the knowledge of two likes (المثلين) when they are alike in all conceptual aspects (الوجوه المعنوية): Do they accompany each other or not? For the benefit (الفائدة) between them has been removed. This is a question that only one with an illuminated insight (منور البصيرة) who benefits with every breath will perceive. He who does not possess this state is not a Perfect Human (إنسان كامل الإنسانية), because he was only given sight to gain benefit. It contains the knowledge of the difference between dealing with Allah and dealing with creation. Is the vigilance (المراقبة) the same for the doer in both dealings or not? Especially for one who sees that Allah has established rights (حقوقا) for creation upon one another, making it incumbent upon the doer to be vigilant toward creation in order to fulfill the rights Allah has obligated him to render to them. Is that vigilance toward the Real (الحق), so that he is vigilant only toward the Real? Or is that vigilance toward creation? Does that return to the deservingness of these rights? Did creation deserve them by their own essence (لذاتهم)—meaning the essence of those deserving—or did they deserve them by Allah's decree (بجعل الله)? From this station, the form of the matter is known in its reality, whether in synthesis or detail.\n\nIt contains the knowledge of the differentiation of the layers of torment and bliss. It contains the knowledge of striking parables: For whom should a parable be struck, and for whom should it not be struck, due to His saying: <<فَلَا تَضْرِبُوا لِلَّهِ الْأَمْثَالَ>> (So do not strike parables for Allah)? Yet He Himself struck parables, saying: <<إِنَّ الله يَعْلَمُ كَيْفَ يَضْرِبُهَا وَأَنْتُمْ لَا تَعْلَمُونَ>> (Indeed, Allah knows how He strikes them, and you do not know). He attributed ignorance of the contexts (المواطن) to them. The scholar spends his life contemplating the parables Allah has struck, and he does not derive a parable from himself, especially not for Allah. I do not think a human lifespan is sufficient to acquire the knowledge of all the parables Allah has struck. It contains the knowledge of whether one who explains on behalf of Allah is called a guide (هاديا) or not, for he is undoubtedly guided (مهدي). It contains the knowledge of the state of the Quran for those who recite on behalf of Allah, who know its descent upon their hearts, and what that inheritance brings them of Contraction (القبض) and Expansion (البسط). Which of the two attributes precedes the ruling in the reciters by state: Contraction or Expansion?\n\nIt contains the knowledge of the virtue of the intellect (العقل) in the intelligent ones, and what the core intellect (لب العقل) is. Is its ruling the same as the ruling of the intellect or not? For Allah differentiated the verses, making some verses <<لِأُولِي الْأَلْبَابِ>> (for those of core intellects) and other verses <<لِقَوْمٍ يَعْقِلُونَ>> (for a people who reason), restricting them by the root *‘aqala* (to tie/restrict). It contains the knowledge of the Near One (المقرب): Does his penetration of Divine Providence (عنايته) have a limit with Allah, or does his providence penetrate absolutely? It contains the knowledge of the honor of following what Allah has legislated to be followed of noble character (مكارم الأخلاق). It contains the knowledge of why profit and loss return to what they do. It contains the knowledge of intellectual caution (الحذر العقلي) and legislated caution (الحذر المشروع): Is the legislated caution the same as the intellectual caution defined by the intellect, or is there no definition in that except for the Law? Or is there something whose definition Allah assigned to the intellect, thus making it sufficient without defining it in the Law? And something whose definition Allah assigned to the Law? It contains the knowledge of what is disliked and what is not disliked. It contains the knowledge of the creation of progeny (نشء الذرية) for the creation of man as man. It contains the knowledge of the interpenetration (التداخل) in things when they are states and accidents, such as the interpenetration of scent, color, stillness, knowledge, and ignorance in a single essence (الذات الواحدة) at the same time.\n\nIt contains the knowledge of defining the shares of partners (الشركاء) in a thing. If they are defined, then they are not partners. The share must be defined in reality (في نفس الأمر), and if common ownership (الإشاعة) occurs, it is due to the ignorance of the partners in that matter. It must be defined when division occurs, either in the substance of the thing or in its value. Therefore, partnership (الشركة) is fundamentally invalid, because matters are defined with Allah in this thing called 'shared.' Yet the name 'partners' (الشركاء) is established conventionally and legally. Why does this return? Do you not see those who took partners with Allah in Divinity (الألوهة)? Do they have a share of it? If you know that they have no share in Divinity, then they are not partners, yet they are called partners. It is known that true partnership is fundamentally invalid in the World due to the Divine Vastness (الاتساع الإلهي). No two or more entities ever share in a matter absolutely. What one possesses is not the very substance of what the other possesses, even if the name 'partnership' is applied to it. There is only distinction (الامتياز) specifically; there is no partnership. Since what one possesses is not the very substance of what the other possesses, we know from this Unveiling the meaning of applying the term 'partnership' in common usage, and that the Law followed common usage in this matter so that it could be understood, because it came in the language of its people, which is what they agreed upon. For this reason, people differed over whether the Messenger had the authority to establish language (وضع لغة) in that tongue or not. It contains the knowledge of the variation in the descent of Divine Laws (الشرائع) from Allah due to the variation of states, times, places, persons, and events. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر تین سو پینتالیس: دین میں اخلاص کے راز کے مقام کی معرفت میں، اور یہ کہ دین کیا ہے، اور شریعت کو دین کیوں کہا گیا، اور نبی اکرم صلی اللہ علیہ وسلم کا یہ فرمان کہ \"بھلائی عادت ہے\"۔\n\n> لكل شخص من القرآن سورته *** وسورتي من كتاب الله تنزيل‏\n> أتى بها الملأ العلوي يقدمه *** عند التنزل ميكال وجبريل‏\n> أتى بها تنثني لينا معاطفها *** وفي جوانبها هدى وتضليل‏\n> إذا نظرت ترى في آيها عجبا *** نار ونور وتنزيه وتمثيل‏\n> بكر النواظر في أجفانها دعج *** لم يقترع طرفها بكحله الميل‏\n\nقرآن میں ہر شخص کے لیے اس کی سورت ہے،\nاور میرے لیے کتاب اللہ سے ایک خاص تنزیل ہے۔\nاسے ملأ اعلیٰ لے کر آئے، جب وہ نازل ہوئی،\nتو میکائیل اور جبریل اس کی رہنمائی کر رہے تھے۔\nوہ ایسی حالت میں آئی کہ اس کے پہلو نرمی سے جھک رہے تھے،\nاور اس کے اطراف میں ہدایت اور گمراہی دونوں تھیں۔\nجب تم اس کی آیات میں دیکھو گے تو تمہیں عجیب چیزیں نظر آئیں گی،\nآگ اور نور، تنزیہ (پاکیزگی) اور تمثیل (تشبیہ)۔\nوہ کنواری نگاہیں جن کی پلکوں میں سیاہی ہے،\nجن کی آنکھوں کو سرمے کی سلائی نے نہیں چھوا۔\n\n### [دین میں اخلاص]\n\nیہ سورت ہم پر حلب شہر میں ظہور الٰہی (التجلی) کے ذریعے منکشف ہوئی۔ جب میں نے اسے دیکھا تو مجھ سے کہا گیا کہ یہ وہ سورت ہے جسے کسی انسان یا جن نے نہیں چھوا۔ میں نے اس کے لیے اور اس کی طرف اپنے پہلو میں ایک عظیم میلان دیکھا۔ پھر اسے میرے لیے اس منزل کی شکل میں پیش کیا گیا جس میں میں پہلے داخل ہو چکا تھا۔ پھر مجھ سے کہا گیا کہ یہ تمہارے لیے دوسرے مومنوں کے مقابلے میں **خالِصَةً لَكَ** (خالص) ہے۔ جب مجھ سے یہ کہا گیا تو میں نے اشاعرہ (الأشاعرة) کو سمجھا اور جان لیا کہ یہ میری ذات (ذاتی) اور میری صورت کی عین ہے، کوئی اور نہیں۔ کیونکہ کسی بھی موجود کے لیے کوئی ایسی چیز مخلص (خاص) نہیں ہوتی جو قدیم ہو یا جدید، سوائے اس کی اپنی ذات کے۔ پس میں نے کہا: \"میں یہ ہوں\"۔ تب میں نے تخیص (خالص کرنے) کا معنی جانا اور سمجھا کہ تلاوت کے وقت قرآن میں جو کچھ مجھ پر نازل ہوا، اس میں مجھ پر کیا پڑھا گیا۔\n\nیہ اس طرح ہے کہ جب سورت اخلاص کی تلاوت کا الہام نازل ہوا، تو مجھے اس سورت کو دوسرے ناموں کے بجائے اسی نام سے موسوم کرنے کی عین سمجھ (عین الفہم) عطا کی گئی۔ کیونکہ یہ سب اللہ کی نسبتیں اور صفات ہیں، اور یہ مجموعی عالم کی عین ہیں۔ پس میں نے اس میں اس اشارے کو سمجھا کہ عالم باوجود اس کے کہ وہ مجموعی طور پر حق مبین ہے، نہ کہ جزو جزو کے اعتبار سے، تو نسبت ذات حق (الحق) کے لیے اس کی ذات کے اعتبار سے خالص ہو جاتی ہے۔ پس یہ مجموعہ درحقیقت ایک ہی عین ہے، اور عالم میں یہ عین حق مبین ہے۔\n\nیہودی امت کے ایک گروہ نے کہا: \"ہمارے لیے اپنے رب کی نسبت بیان کرو۔\" تو آپ صلی اللہ علیہ وسلم نے مجموعی عالم کے لیے اس کی نسبت بیان کی، اس وحی کے مطابق جو اللہ تعالیٰ کی طرف سے آپ پر نازل ہوئی: **قُلْ هُوَ الله أَحَدٌ** (کہو، وہ اللہ ایک ہے)۔ پس آپ نے اس کی صفت احدیت (الأحدية) سے بیان کی۔ اور عالم کے ہر جزو کے لیے ایک خاص احدیت ہے جس میں کوئی دوسرا شریک نہیں ہوتا، اور اسی سے وہ ہر دوسری چیز سے ممتاز اور متعین ہوتا ہے، باوجود اس کے کہ اس میں اشتراک کی صفات بھی موجود ہیں۔\n\nپھر کہا گیا: **الله الصَّمَدُ** (اللہ بے نیاز ہے)۔ اور وہ وہ ہے جس کی طرف معاملات میں صمد (رجوع) کیا جاتا ہے، یعنی پناہ لی جاتی ہے۔ اور عالم میں جتنے بھی اسباب رکھے گئے ہیں، ان سب کی طرف رجوع کیا جاتا ہے، اور اسی لیے انہیں اسباب کہا جاتا ہے تاکہ ان کے مسببات اس صمد اول تک پہنچیں جس کی طرف اسباب پناہ لیتے ہیں۔\n\n**لَمْ يَلِدْ** (نہ اس نے کسی کو جنا)۔ اور وہ عقیم ہے جس کے ہاں اولاد نہیں ہوتی۔ اور اسی صفت سے ہوا (الریح) کو عقیم کہا گیا، کیونکہ بعض ہوائیں بار آور ہوتی ہیں اور بعض عقیم ہوتی ہیں۔\n\n**وَلَمْ يُولَدْ** (اور نہ وہ جنا گیا)۔ آدم علیہ السلام بھی نہیں، کیونکہ ولادت سوال کرنے والوں کے نزدیک معلوم ہے۔ پس ان سے اس چیز کے بارے میں بات کی گئی جو ان کے نزدیک معلوم ہے۔\n\n**وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ** (اور نہ کوئی اس کا ہمسر ہے)۔ یہاں کفو (الکفو) سے مراد صاحبہ (بیوی) ہے، اس قول کی وجہ سے جس نے کہا کہ مسیح اللہ کا بیٹا ہے اور عزیر اللہ کا بیٹا ہے۔ اور کفاءت (الکفاءة) کا مطلب ہے مماثلت (برابری)، اور عورت کبھی بھی مرد کے برابر نہیں ہو سکتی، کیونکہ اللہ فرماتا ہے: **وَلِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ** (اور مردوں کو ان پر ایک درجہ فضیلت حاصل ہے)۔ پس وہ اس کے لیے کفو نہیں ہے۔ کیونکہ منفعل (جس پر فعل کیا جائے) اپنے فاعل (فعل کرنے والے) کا کفو نہیں ہوتا، اور عالم اللہ سے منفعل ہے، لہٰذا وہ اللہ کا کفو نہیں ہے۔ اور حوا آدم سے منفعل تھیں، لہٰذا آدم کو ان پر فاعلیت کا درجہ حاصل ہے، پس وہ اس لحاظ سے ان کی کفو نہیں تھیں۔\n\nاور جب اللہ نے فرمایا کہ مردوں کو عورتوں پر ایک درجہ حاصل ہے، تو اس نے عیسیٰ علیہ السلام کو مریم سے منفعل نہیں بنایا، تاکہ مرد عورت سے منفعل نہ ہو جیسا کہ حوا آدم سے منفعل ہوئی تھیں۔ پس جبریل یا فرشتہ **فَتَمَثَّلَ لَها بَشَراً سَوِيًّا** (اس کے سامنے ایک مکمل انسان کی صورت میں ظاہر ہوا) اور اس سے کہا: **أَنَا رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلاماً زَكِيًّا** (میں تمہارے رب کا فرستادہ ہوں تاکہ تمہیں ایک پاکیزہ لڑکا عطا کروں)۔ پس اس نے مریم کو عیسیٰ علیہ السلام عطا کیے۔ پس عیسیٰ کا انفعال اس فرشتے سے ہوا جو مرد کی صورت میں متمثل ہوا تھا۔ اور اسی لیے وہ اپنے باپ کی صورت پر ظاہر ہوئے: مذکر، بشر، روح۔ پس انہوں نے ان دونوں صورتوں کو جمع کیا جن پر ان کا باپ (جو کہ فرشتہ تھا) قائم تھا۔ کیونکہ وہ اپنی عین کے لحاظ سے روح ہے اور بشر کی صورت میں تمثل کے لحاظ سے بشر ہے۔\n\nپس اس سورت کو سورت اخلاص (سورة الإخلاص) کہا گیا، یعنی اس نے ذات حق (الحق) کو عالم کے لیے اس تنزیہ (پاکیزگی) سے خالص کر دیا جس پر عقل دلیل قائم کرتی ہے، اور اسے عالم سے ان تمام صفات کے مجموعے کے ذریعے ایک ہی عین میں خالص کر دیا۔ اور یہ صفات عالم میں بکھری ہوئی ہیں، انہیں کوئی ایک عین جمع نہیں کرتا۔ کیونکہ آدم علیہ السلام عالم میں ظاہر ہونے والی سب سے کامل صورت تھے، اس کے باوجود ان میں **لَمْ يَلِدْ** (نہ اس نے کسی کو جنا) کی کمی تھی، کیونکہ وہ احد (أحد) صمد (صمد) تھے، **وَلَمْ يُولَدْ** (اور نہ وہ جنا گیا)، اور حوا ان کے لیے کفو نہیں تھیں۔ پس اس سورت نے حق کو تشبیہ سے خالص کر دیا، جیسا کہ اس نے اسے تنزیہ سے خالص کیا تھا۔ پس جب تم اس بات کو سمجھ لو جس کی طرف ہم نے اشارہ کیا ہے۔\n\n### [بے شک اخلاص کا راز وہی تقدیر کا راز ہے جس کا علم اللہ نے عالم سے پوشیدہ رکھا]\n\nتو جان لو کہ اخلاص کا راز (سر الإخلاص) وہی تقدیر کا راز (سر القدر) ہے جس کا علم اللہ نے عالم سے، بلکہ اکثر عالم سے، پوشیدہ رکھا ہے۔ پس اس نے اشیاء کو ان کی حدود کے ساتھ ممتاز کیا۔ یہی تقدیر کے راز کا معنی ہے، کیونکہ یہ عین توقیف (روک دینا) ہے، اور اسی سے اشیاء ممتاز ہوئیں، اور اسی سے خالق مخلوق سے اور محدث (پیدا کیا گیا) قدیم (ازلی) سے ممتاز ہوا۔\n\nمحدث ایک ثابت صفت کے ساتھ ممتاز ہوا جسے جانا اور دیکھا جاتا ہے، لیکن قدیم محدث سے کسی ثبوتی صفت کے ساتھ ممتاز نہیں ہوا جسے جانا جائے، بلکہ وہ صرف اس چیز کے سلب (نفی) سے ممتاز ہوا جس سے محدث ممتاز ہوا تھا۔ پس وہ سبحانہ و تعالیٰ معلوم بھی ہے اور مجہول بھی۔ پس اسے صرف وہی جانتا ہے اور صرف وہی مجہول ہے۔ پاک ہے وہ ذات جس کا علم عین جہل ہو اور جس کا جہل عین علم ہو۔ اور اس تمیز سے بڑھ کر کوئی تمیز نہیں ہو سکتی، اور نہ ہی اس سے زیادہ واضح ہو سکتی ہے اس شخص کے لیے جو عقل رکھتا ہو اور بصیرت حاصل کرے۔\n\nجہاں تک دین میں اخلاص (الإخلاص في الدين) کا تعلق ہے، تو وہ جزا وِفاق (الجزاء الوفاق) ہے۔ پس وہاں جزا وِفاق کے مطابق ہے، نہ کم نہ زیادہ۔ کیونکہ اللہ نے اسے **جَزاءً وِفاقاً** (مطابق جزا) قرار دیا ہے، جو ایک حقیقت کی خبر دے رہا ہے۔ کیونکہ جزا دینے والا یہ قبول نہیں کر سکتا جو اس کا استعداد اسے نہیں دیتا۔ اور اپنے استعداد کے ذریعے ہی اس نے وہ دین قبول کیا جو اس پر ظاہر ہوا، جس میں وہ جزا کا طالب ہے، یعنی استعداد نے جزا سے پہلے قبول کیا۔ پس جزا وِفاق کے مطابق ہوئی۔\n\nاور جزا صرف عمل کے لیے ہے، اور عمل کرنے والا اسے اپنے عمل سے ہی حاصل کرتا ہے۔ اسی لیے کہا گیا ہے کہ جنت میں وہ کچھ ہے جو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی بشر کے دل پر اس کا خیال گزرا۔ اور یہ صحیح ہے، کیونکہ یہ عمل کرنے والوں سے ایسے عمل کے طور پر صادر ہوتا ہے جس کا قصد نہ اس کی آنکھ نے دیکھا، نہ اس کے کان نے سنا، اور نہ اس کے دل میں اس کا خیال آیا، مگر جب وہ ظاہر ہوا تو اس کی آنکھ نے اسے دیکھا اور اس کے دل میں اس کا خیال آیا۔ جیسا کہ وہ جنت میں وہ چیزیں دیکھے گا جو اس نے دنیا میں نہ دیکھی تھیں، نہ سنی تھیں، اور نہ اس کے دل میں ان کا خیال آیا تھا۔ پس یہی اس قسم کے عمل کے لیے جزا وِفاق ہے۔\n\nاور یہ عمل اللہ تعالیٰ کے اس قول سے ہے: **وَنُنْشِئَكُمْ فِي مَا لَا تَعْلَمُونَ** (اور ہم تمہیں اس چیز میں پیدا کریں گے جسے تم نہیں جانتے)۔ پس اللہ نے اسے ایک ایسے مقام میں ظاہر کیا جسے وہ اپنی فکر کے لحاظ سے نہیں جانتا، نہ اس کی آنکھ نے دیکھا، نہ اس کے کان نے سنا کہ اسے وہاں کھڑا کیا جائے گا۔ پس اس کی جزا وہی ہو گی جو جنت میں مذکور ہے، جو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی بشر کے دل پر اس کا خیال گزرا۔ پس اس عمل کے لیے جزا صفت وِفاق کے ساتھ خالص ہو گئی، اور یہ تقدیر کے راز (سر القدر) میں سے ہے۔\n\nاور چونکہ دین خیر کا عمل ہے، اور دین عادت ہے،\n\nنبی علیہ السلام نے فرمایا: **إن الخير عادة** (بے شک بھلائی عادت ہے)۔\n\nاور یہ فرمان امور کے عالم (رسول صلی اللہ علیہ وسلم) کی طرف سے ایک بشارت ہے کہ نفس اپنی ذات میں خیر ہے، اور وہ شر کو قبول نہیں کرتا مگر قرین (ساتھی شیطان) کی ہٹ دھرمی (لجاجة) کی وجہ سے جو اس پر زور ڈالتا ہے۔ پس آپ نے شر کو نفس کی ذات سے نہیں بنایا۔\n\nپس آپ صلی اللہ علیہ وسلم نے فرمایا: **الخير عادة والشر لجاجة** (بھلائی عادت ہے اور برائی ہٹ دھرمی ہے)۔\n\nاور جب قرین نے نفس پر زور ڈالا اور شر کے ساتھ ہٹ دھرمی کی، جو کہ عین مخالفت ہے اللہ کے امر اور نہی کی، اور اس اصرار اور ہٹ دھرمی سے اس کے راستے تنگ ہو گئے، تو اللہ نے اس کی طرف وحی کی، بلکہ اس سے خاص طریقے سے کلام کیا جسے فرشتہ بھی نہیں جانتا، کہ وہ اس شر کو قبول کر لے جس پر قرین نے اس پر زور ڈالا تھا۔\n\nذات حق (الحق) نے اس میں الٰہی مکر (المكر الإلهي) سے وحشت اور خوف دیکھا، پس اسے تبدیل (التبديل) کی حضوری کا مشاہدہ کرایا، اور اسے مکلفین کا رحمت کی طرف انجام دکھایا، اور اس پر یہ آیت تلاوت کی: **يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ** (اللہ ان کی برائیوں کو نیکیوں سے بدل دیتا ہے)۔ اور مسرفین (حد سے تجاوز کرنے والوں) کے بارے میں یہ تلاوت کی: **لَا تَقْنَطُوا مِنْ رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً** (اللہ کی رحمت سے مایوس نہ ہو، بے شک اللہ تمام گناہوں کو بخش دیتا ہے)۔\n\nپس اس نے اس کی وحشت کو دور کیا، اور اس نے قرین سے وہ شر قبول کر لیا جو وہ اس کے پاس لایا تھا۔ قرین اس قبولیت پر خوش ہوا، کیونکہ وہ رحمت کی عمومیت اور عفو و مغفرت کی عمومیت سے جاہل تھا۔ اور اس نے یہ نہیں جانا کہ اللہ نے نفس کو قرین کے شر کو ہٹ دھرمی اور اصرار کے ساتھ قبول کرنے میں مجبور کی منزل میں رکھا ہے، اور مجبور سے مواخذہ نہیں ہوتا۔\n\nپس اللہ نے شر کو لجاجة (ہٹ دھرمی) کہا، جو ایک الٰہی بشارت ہے جسے ہر کوئی نہیں جانتا، اور خیر کو عادت بنایا۔ کیونکہ نفس اپنی ذات میں خیر ہے، کیونکہ اس کا باپ روح قدسی طاہر ہے، پس اس کی فطرت میں خیر ہی ہے، اور اس کی ماں ان اخلاط سے بنی ہوئی یہ مساوی صورت ہے۔ پس اس میں ظاہر ہونے والی پہلی قبولیت مساوات اور عدل کی قبولیت تھی، اور یہ اللہ کا قول ہے: **فَسَوَّاكَ فَعَدَلَكَ** (پس اس نے تجھے درست کیا اور تجھے معتدل بنایا)۔ اور عدل کی قبولیت عین خیر ہے۔\n\nاور اس نے اصالتاً اس نشأت میں اضداد (اخلاط) کی مجاورت کو قبول کیا، اور ضد کی عادت ہے کہ وہ اپنی ضد سے نفرت کرے، لیکن یہاں نفرت نہیں پائی گئی، پس یہ اصل کی خیریت پر دلالت کرتا ہے۔ پھر تعدیل اور تسویہ کے بعد روح قدسی کے نفخ کو قبول کرنا۔ پس پہلی قبولیت جو اس نے اپنی نشأت پر زائد طور پر قبول کی، وہ اس روح خیر، طاہر، مطہر کا نفخ تھا۔ اسی لیے خیر اس کے لیے عادت ہے اس طبع کے مطابق جس پر اسے پیدا کیا گیا۔ اور اسی لیے وہ انجام کار اپنی اصل کی طرف لوٹ جائے گی، کیونکہ اس کی اصل خیر کی قبولیت ہے جیسا کہ ہم نے ذکر کیا۔ پس انجام کار رحمت اسے لاحق ہو گی، جیسا کہ اس کا وجود عین رحمت تھا۔ پس معاملہ اسی پر ختم ہوا جس سے شروع ہوا تھا، اور خاتمہ عین سابقہ ہے۔\n\nاور جو کچھ ہم نے ذکر کیا ہے اس کی تائید اس بات سے ہوتی ہے کہ پہلی انسانی نشأت، جو انسانی نشأتوں کی اصل تھی، تقدیس کی انتہا اور شرف کی بلندی پر تھی، کیونکہ اسے صورت الٰہیہ پر پیدا کیا گیا تھا۔ پس اس سے صرف وہی ظاہر ہوا جو مناسب تھا۔ پس جس طرح اس کے لیے مناسب تھا کہ متقابل الٰہی اسماء کی حقیقتوں کے تقاضے سے پیدا ہونے والی مخالفت کے باوجود، ان میں سے بعض کی مخالفت کی وجہ سے ملامت کی زبان اس تک نہ پہنچے، اسی طرح اس انسانی نشأت میں جو مخالفت ظاہر ہوئی ہے، انجام کار اس پر دائمی عذاب کی بات نہیں پہنچے گی۔ کیونکہ اصل (الصورة) اس کی حفاظت کرے گی۔\n\nپس وہ اپنی مخالفت میں مجبور تھی، کیونکہ مخالفت ضروری ہے، کیونکہ جس صورت پر اسے پیدا کیا گیا ہے اس میں اسماء کا تقابل ضروری ہے۔ پس نفع دینے والا نقصان دینے والا نہیں ہے، اور عطا کرنے والا روکنے والا نہیں ہے، اور ان حقیقتوں کا اس نشأت میں ظاہر ہونا ضروری ہے تاکہ صورت کا کمال صحیح ہو۔ پس اطاعت کرنے والا نافرمان کے مقابل ہے، اور مشرک موحد کے مقابل ہے، اور معطل (نفی کرنے والا) مثبت (ثابت کرنے والا) کے مقابل ہے، اور موافق مخالف کے مقابل ہے، جو الٰہی اسماء کی امداد سے ہے۔ اور یہ اللہ کا قول ہے: **كُلًّا نُمِدُّ هَؤُلَاءِ وَهَؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ** (ہم ان سب کو اور ان سب کو تیرے رب کی عطا سے مدد دیتے ہیں)، یعنی اطاعت کرنے والے اور نافرمان کو، اور اہل خیر اور اہل شر کو۔ **وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا** (اور تیرے رب کی عطا روکی ہوئی نہیں ہے)، یعنی ممنوع نہیں۔ کیونکہ وہ اپنی ذات کے لیے عطا کرتا ہے، اور محل (القوابل) اپنے استعداد کے مطابق قبول کرتے ہیں، اور ان کا استعداد ان میں الٰہی اسماء کا اثر ہے۔ اور الٰہی اسماء میں موافق اور مخالف دونوں شامل ہیں، جیسے موافق: رحیم اور غفور، اور ان جیسے دوسرے اسماء، اور جیسے مخالف: معز (عزت دینے والا) اور مذل (ذلت دینے والا)۔ پس اس محل کا استعداد ان اسماء میں سے کسی ایک اسم کے حکم میں ہونا ضروری ہے۔\n\nپس اس کا الٰہی حکم کو قبول کرنا اسی کے مطابق ہو گا، یا تو مخالف یا موافق۔ اور جس کا یہ حال ہو، اس سے ذاتی ملامت کیسے متعلق ہو سکتی ہے؟ اور اعراض (عارضی صفات) کو ثبات نہیں ہوتا۔ پس انسان میں خیر ذاتی ہے، اور اسی کا حکم باقی رہے گا، اور شر عرضی ہے، پس وہ زائل ہو جائے گا، اگرچہ کچھ دیر بعد۔ اللہ تعالیٰ فرماتا ہے: **وَلَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ** (اور تم اس کی خبر کو کچھ وقت بعد ضرور جان لو گے)۔\n\nاور یہ اس کے قول کی طرح ہے: **يَا عِبَادِيَ** (اے میرے بندو)، پس اس نے انہیں اپنی طرف منسوب کیا، جیسا کہ اس نے ان کی تخلیق میں ان کے نفوس کو اپنی طرف منسوب کیا، پس فرمایا: **وَنَفَخْتُ فِيهِ مِنْ رُوحِي** (اور میں نے اس میں اپنی روح پھونکی)۔ اور **كُلًّا نُمِدُّ هَؤُلَاءِ وَهَؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ** (ہم ان سب کو اور ان سب کو تیرے رب کی عطا سے مدد دیتے ہیں)۔\n\nپھر فرمایا: **الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ** (جنہوں نے اپنی جانوں پر زیادتی کی)۔ اور اسراف (الإسراف) ایک عام کرم ہے جو حد اور مقدار سے باہر ہے۔ اور اسی طرح اس نے خرچ کرنے کے بارے میں فرمایا: **لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا** (نہ انہوں نے اسراف کیا اور نہ تنگی کی)، یعنی انہوں نے ضرورت سے زیادہ وسعت نہیں دی، اور **وَلَمْ يَقْتُرُوا** (اور نہ تنگی کی)، یعنی انہوں نے اس چیز میں کمی نہیں کی جس کی ضرورت تھی۔\n\n**لَا تَقْنَطُوا مِنْ رَحْمَةِ الله** (اللہ کی رحمت سے مایوس نہ ہو)، کیونکہ وہ **وَسِعَتْ كُلَّ شَيْءٍ** (ہر چیز پر محیط ہے)، اور تم چیزوں میں سے ہو۔ اور میں نے تمہیں بتا دیا ہے کہ میں نے تمہیں کیسے پیدا کیا اور کس چیز سے پیدا کیا: ایک پاکیزہ روح سے اور ایک موافق طبیعت سے جو قبول کرنے والی، اطاعت گزار ہے، نہ نافرمان ہے اور نہ مخالف۔ **إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً** (بے شک اللہ تمام گناہوں کو بخش دیتا ہے)۔ پس اس نے ان میں سے کچھ بھی باقی نہیں چھوڑا۔ تو پھر کس چیز کی وجہ سے ان پر عذاب دائمی ہو گا؟ اور یہ صرف **جَزَاءً وِفَاقًا** (مطابق جزا) ہو گا۔ اور اس نے بخش دیا، اور جسے بخش دیا گیا اس پر کوئی حکم نہیں ہے۔ کیونکہ جس نے بخشا وہ **هُوَ الْغَفُورُ الرَّحِيمُ** (وہ بخشنے والا، نہایت رحم کرنے والا ہے)۔ اور غفور رحیم اپنی ذات کے لیے ہے، پس جب سے اس نے بخشا ہے، وہ ہمیشہ بخشا ہوا رہے گا، اور گناہ کا حکم اس کی طرف واپس نہیں آئے گا، کیونکہ محافظ غفور رحیم ہے۔ اگر اس اسم اور اس جیسے دوسرے اسماء کے علاوہ کسی اور نے اسے زائل کیا اور بخشا ہوتا، تو ممکن تھا کہ وہ ثابت نہ رہتا کیونکہ اس کا کوئی محافظ نہیں ہوتا۔ پس اس بات پر غور کرو جو ہم نے تمہیں بتائی ہے، کیونکہ یہ معرفت (المعرفۃ) کا مغز ہے۔\n\n### [بے شک اللہ کے کامل مرد عالم میں خلفاء ہیں]\n\nاور جان لو کہ اللہ کے کامل مرد (الكمل من رجال الله) جو عالم میں خلفاء (الخلفاء) ہیں، جنہوں نے غیب پر نہیں بلکہ مشاہدہ (المشاهدة) پر عبادت کی، وہی ہیں جن کے لیے رؤیت الٰہیہ جزا ہوتی ہے، اضافہ نہیں۔ اور جو اس کمال سے نیچے ہے، وہی ہے جس کے لیے جزا پر اضافہ ہوتا ہے، جیسا کہ اللہ کا قول ہے: **لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ** (جنہوں نے نیکی کی ان کے لیے بھلائی ہے اور مزید اضافہ بھی ہے)۔ اور یہ رسول اللہ صلی اللہ علیہ وسلم کا قول ہے: **إذا وزنت فارجح** (جب وزن کیا جائے تو زیادہ کر دو)۔\n\nجب رسول اللہ صلی اللہ علیہ وسلم نے اپنا قرض ادا کیا، اور جب اسے وزن کیا گیا، تو آپ نے میزان والے سے کہا: \"زیادہ کر دو\"۔\n\nتاکہ وہ اس کے استحقاق سے زیادہ دے، کیونکہ آپ نے دیکھا کہ ذات حق (الحق) نے معاوضے پر اضافے کا ذکر کیا ہے۔ اور آپ نے اس مقام پر فرمایا: **أحسنكم أحسنكم قضاء** (تم میں سے بہترین وہ ہے جو ادائیگی میں بہترین ہو)۔\n\nپس یہی دین میں اخلاص ہے جو کہ جزا ہے۔ اور یہاں آپ صلی اللہ علیہ وسلم کے اس قول کا معنی ظاہر ہوتا ہے: **وأعوذ بك منك** (اور میں تیری پناہ مانگتا ہوں تجھ سے)۔\n\nکیونکہ جب آپ صلی اللہ علیہ وسلم نے ضمیر خطاب کے ساتھ استعاذہ کیا، بغیر کسی اسم کو متعین کیے، تو آپ کو اس کا کوئی مقابل نہیں ملا، کیونکہ آپ نے کوئی اسم متعین نہیں کیا تھا۔ پس آپ نے اپنے آپ کو اس کی صورت پر دیکھا، تو فرمایا: \"تجھ سے (منك)\"۔ پس آپ نے اللہ سے اپنے نفس کی پناہ مانگی، کیونکہ نفس جو کہ مثل (مثال) ہے، قرآن میں آیا ہے، جیسے اللہ کا قول: **فَلَا تُزَكُّوا أَنْفُسَكُمْ** (پس تم اپنے نفوس کو پاک نہ ٹھہراؤ)، یعنی اپنے امثال کو۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا: **لا أزكي على الله أحدا** (میں اللہ کے مقابلے میں کسی کو پاک نہیں ٹھہراتا)۔\n\nاور فرمایا: **كَخِيفَتِكُمْ أَنْفُسَكُمْ** (جیسے تم اپنے نفوس سے ڈرتے ہو)، یعنی اپنے امثال سے۔ پس آپ کے قول **وأعوذ بك منك** (اور میں تیری پناہ مانگتا ہوں تجھ سے) کا مطلب یہ ہو سکتا ہے کہ دونوں کاف ایک ہی ہیں، اور یہ بھی ہو سکتا ہے کہ \"منك\" میں کاف مثل (المثل) کی طرف لوٹتی ہو، جو کہ پناہ مانگنے والے کا نفس ہے، کیونکہ وہ خلیفہ ہے جو صورت کو کامل ترین طریقوں پر حاصل کرتا ہے۔\n\nپس اس نے اللہ سے اپنے نفس کی پناہ مانگی، کیونکہ وہ پوشیدہ الٰہی مکر (المكر الخفي الإلهي) کو جانتا ہے۔ کیونکہ اس نے مثالی صورت کو اس نشأت میں صرف تشریف کے لیے ظاہر نہیں کیا، بلکہ یہ شرف اور آزمائش (ابتلاء) دونوں ہے۔ پس جو شخص صورت کے حکم کے ساتھ کمال پر ظاہر ہوا، اس نے دونوں ہاتھوں سے شرف حاصل کر لیا، کیونکہ صورت الٰہیہ کو کسی بھی لحاظ سے ملامت لاحق نہیں ہوتی۔ اور جو اس کمال سے کم رہا، اس کے حق میں یہ ایک الٰہی مکر تھا، جہاں سے اسے شعور بھی نہیں ہوا۔\n\nجیسا کہ عالم میں خلافت (الخلافة) ایک آزمائش ہے، نہ کہ شرف۔ اور اسی لیے نبی صلی اللہ علیہ وسلم نے فرمایا: **إنها في الآخرة مندمة** (بے شک یہ آخرت میں ندامت کا باعث ہے)۔\n\nاس وجہ سے کہ اس کے مالک پر وہ حقوق متعین ہو جاتے ہیں جن کا مطالبہ قیامت کے دن اس سے کیا جائے گا، یہاں تک کہ وہ تمنا کرے گا کہ اس نے دنیا کے کسی بھی معاملے کی ذمہ داری نہ لی ہوتی۔ اور ہمیں چرواہے بنایا گیا ہے،\n\nپس آپ نے فرمایا: **كلكم راع وكلكم مسئول عن رعيته** (تم میں سے ہر ایک نگہبان ہے اور تم میں سے ہر ایک سے اس کی رعیت کے بارے میں پوچھا جائے گا)۔\n\nپس ہر شخص کے لیے صورت الٰہیہ کا ایک حکم ہے۔ پس جس کے لیے صورت اپنے کمال کے ساتھ جمع ہو گئی، اس سے سوال نہیں کیا جائے گا، کیونکہ اللہ سے **لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ** (جو وہ کرتا ہے اس کے بارے میں سوال نہیں کیا جاتا، اور ان سے سوال کیا جائے گا)۔ اور جو خواہش سے کلام نہیں کرتا، اس سے بحث و حساب کا سوال نہیں کیا جائے گا، لیکن اس سے استفہام (معلوم کرنے) کا سوال کیا جا سکتا ہے تاکہ ایک ایسا علم ظاہر ہو جس سے سننے والے فائدہ اٹھائیں۔\n\nجیسا کہ ذات حق (الحق) اپنے رسولوں سے سوال کرے گا، حالانکہ وہ خواہش سے کلام نہیں کرتے، جس دن وہ انہیں جمع کرے گا، **فَيَقُولُ مَاذَا أُجِبْتُمْ** (تو وہ پوچھے گا کہ تمہیں کیا جواب دیا گیا؟) تو وہ کہیں گے: **لَا عِلْمَ لَنَا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ** (ہمیں کوئی علم نہیں، بے شک تو ہی غیبوں کا جاننے والا ہے)۔\n\nپس موقف والے (اہل کشف) جان لیں گے کہ رسول کشف (الکشف) کے لحاظ سے عالم میں سب سے کامل ہیں، اس کے باوجود اللہ نے انہیں ان کی امتوں کے دلوں کے جوابات پر مطلع نہیں کیا، اور نہ ہی ان لوگوں کے جوابات پر جن تک ان کی دعوت پہنچی تھی اور وہ حاضر نہیں تھے، اور نہ ہی اس شخص کے بارے میں جو حاضر تھا اور اس نے زبان سے جواب دیا تھا کہ کیا اس نے دل سے بھی جواب دیا تھا جیسا کہ اس نے زبان سے دیا تھا۔\n\nاگر تم کہو کہ اس نے تو ان لوگوں کا جواب سنا جنہوں نے زبان سے جواب دیا اور جو کچھ انہوں نے جواب دیا، تو ہم کہیں گے کہ احوال کے قرائن کا ایک حکم ہوتا ہے جسے صرف وہی جانتا ہے جو ان کا مشاہدہ کرتا ہے۔ اور ہم نے رسولوں کے جواب کی عین سے یہ جانا کہ انہوں نے اللہ سے اس سوال کے وقت یہ سمجھا کہ اس نے دلوں کے جواب کا ارادہ کیا ہے۔ کیونکہ انہوں نے کہا: **لَا عِلْمَ لَنَا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ** (ہمیں کوئی علم نہیں، بے شک تو ہی غیبوں کا جاننے والا ہے)۔ اگر وہ اس کے سوال سے زبانوں کے جواب کو سمجھتے، تو وہ ان لوگوں کے درمیان فرق کرتے جن کا جواب انہوں نے زبان سے اقرار کے ساتھ سنا تھا اور جن کا نہیں سنا تھا۔ پس جب انہوں نے جواب میں غیوب (پوشیدہ چیزوں) کا ذکر کیا، تو ہم نے جانا کہ سوال دلوں کے جواب کے بارے میں تھا۔\n\nاور ہم نے اس سے یہ فائدہ اٹھایا کہ جس شخص کے لیے کشف ہوتا ہے، یہ ضروری نہیں کہ اس کا کشف ہر چیز پر محیط ہو، بلکہ اس کے پاس صرف کشف کا استعداد ہوتا ہے۔ پس ذات حق (الحق) نے عالم کے جن اسرار کو اس کے دل کے آئینے میں منکشف کیا، اگر وہ معنی تھے، یا اس کی آنکھ کے آئینے میں، اگر وہ صورت تھے، تو اس نے انہیں دیکھا، بس۔\n\nاگر تم کہو کہ جس کی آنکھ ذات حق (الحق) ہو، میں نے تمہیں یہ کہتے ہوئے سنا ہے کہ اس حال والے شخص کو کائنات میں ہر مبصر چیز کا ادراک ہوتا ہے اور کوئی چیز اس کی نظر سے غائب نہیں ہوتی، کیونکہ وہ حق کے ساتھ دیکھ رہا ہوتا ہے۔ ہم کہیں گے: تم نے سچ کہا، لیکن مقام اور حال میں فرق ہے۔ اور احوال کو بقا نہیں ہوتی۔ اور یہ ایک حال ہے، پس جب یہ حاصل ہوا تو اس وقت اس کے لیے یہ کشف صحیح ہوا، اور جب یہ اس سے اٹھا لیا گیا، تو وہ خلق کی آنکھ سے دیکھنا شروع کر دیا، حق کی امداد سے، نہ کہ حق کے ساتھ۔ پس اس کا حکم خواص خلق کا حکم ہو گا، یعنی جزوی کشف، نہ کہ کلی۔ کیونکہ صرف وہی چیز منکشف ہوتی ہے جو عام طور پر معمول ہو۔\n\nپس جب اس نے عالم میں ہر مبصر چیز کا کشف کیا، تو اس نے اسے اس وقت کی حالت پر دیکھا۔ اور جب یہ اس سے اٹھا لیا گیا، تو اسے یہ معلوم نہیں ہوا کہ ان مبصرات کا انجام کیا ہوا، کیا وہ اسی حالت پر باقی رہے یا اس سے منتقل ہو گئے؟ اور اللہ نے ان سے اس کا علم طلب کیا، ان کے قول **لَا عِلْمَ لَنَا** کی وجہ سے۔ اور گمانوں سے جواب دینا مناسب نہیں ہے۔ پھر انہوں نے بات مکمل کی اور کہا: **إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ** (بے شک تو ہی غیبوں کا جاننے والا ہے)۔ پس انہوں نے اسے غیوب کے ساتھ مقید کر دیا، کیونکہ یہ وہ دن ہے جب پوشیدہ راز ظاہر کیے جائیں گے، اور راز عالم کے بعض لوگوں کے لیے بعض سے غیب ہیں۔\n\nپس اللہ نے ہمیں اس آیت کے ذریعے اہل کشف کے ساتھ ادب سکھایا، اور یہ کہ ہم کشف کے مراتب کو جانیں، تاکہ ہم صاحب کشف کو اس کے مقام سے اوپر نہ لے جائیں اور اس سے وہ چیز نہ طلب کریں جس کا وہ اپنے حال کے مطابق مستحق نہیں ہے، پس ہم اسے تھکا دیں اور اسے معذور نہ سمجھیں، اور اس پر جہالت کا الزام لگائیں، حالانکہ ہمیں یہ علم نہیں کہ ہم نے جہالت کی ہے۔ پس یہ دو جہالتیں ہوں گی۔\n\nاور جس طرح فرشتوں کے لیے معلوم مقامات ہیں، اسی طرح انسانوں کے لیے بھی معلوم مقامات ہیں، جن سے انہیں مزید اضافہ ہوتا ہے، وہ ان سے تجاوز نہیں کرتے۔ اور اگر وہ علم میں اضافہ بھی کریں، تو وہ اسی مقام سے ہوتا ہے، اور وہ وہ مقام ہے جس پر وہ آخری سانس کے وقت ہوتا ہے، جب روح اس کے ڈھانچے کو چھوڑتی ہے جسے موت کہا جاتا ہے۔ پس اسی مقام سے اسے مزید اضافہ ہوتا ہے۔\n\nاور اسی لیے آخرت میں لوگوں کے درمیان فضیلت پائی جاتی ہے، اور اللہ ان لوگوں کو جنہوں نے علم حاصل کیا اور وہ مومن ہیں، ان مومنوں پر درجات میں بڑھا دیتا ہے جنہوں نے علم حاصل نہیں کیا۔ اور مقامات کے ذریعے اللہ نے ہر صنف کو بعض پر فضیلت دی ہے۔\n\nاور اس منزل میں جو علوم ہیں، ان میں یہ علم بھی شامل ہے کہ کیا وہ عرش جس پر اسم رحمن نے استواء کیا، وہی عرش ہے جس پر اللہ حکم عدل قیامت کے دن فیصلہ اور قضا کے لیے آئے گا، جسے آٹھ فرشتے اٹھائیں گے؟ یا وہ کوئی دوسرا عرش ہے؟ اور اگر وہ دوسرا عرش ہے، تو رسول صلی اللہ علیہ وسلم کے اس قول کا کیا مطلب ہے جب یہ آیت نازل ہوئی: **وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ** (اور اس دن تیرے رب کے عرش کو ان کے اوپر آٹھ فرشتے اٹھائیں گے)، یعنی آخرت کے دن، تو آپ نے فرمایا: **وهم اليوم أربعة** (اور آج وہ چار ہیں)۔\n\nاور یہ آٹھ نامعلوم (المنكرة) کون ہیں؟ کیا وہ سب فرشتے ہیں یا فرشتے نہیں ہیں؟ یا ان میں سے کچھ فرشتے ہیں اور کچھ غیر فرشتے ہیں؟ اور کیا عرش ایک تخت ہے، اور وہ ملک (فرشتہ) میں سے ایک معین ملک ہے، نہ کہ پورا ملک؟ کیونکہ وہ اس پر فیصلہ اور قضا کے لیے آئے گا اپنے بندوں کے درمیان، اور اس کے بندے ملک میں سے ہیں، لہٰذا ضروری ہے کہ وہ ایک معین ملک ہو۔\n\nاور کیا یہ عرش جس پر وہ قیامت کے دن آئے گا، وہی بادلوں کے سائے (ظلل الغمام) ہیں جن میں اللہ قیامت کے دن آئے گا یا نہیں؟ اور فرشتے ہی ہیں جو **فِي ظُلَلٍ مِنَ الْغَمَامِ** (بادلوں کے سائے میں) آئیں گے، اور اللہ کا آنا اس قید سے مطلق ہو گا؟\n\nاور اس میں عرش کی سطح کی انتہا کا علم ہے، کیا اس کی کوئی فوقیت ہے یا نہیں؟ اور اس کے لیے حول (اطراف) کا کیا معنی ہے؟ اور اس پر استواء کا کیا معنی ہے اگر وہ اس صفت سے متصف نہ ہو کہ اس کے لیے فوق (اوپر) ہے؟ کیونکہ وہ جسم کی انتہا ہے، اس کے بعد نہ خلا ہے اور نہ ملا۔ اور یہ سب تب ہے جب عرش ایک تخت ہو یا عالم میں سے کوئی خاص ملک ہو۔ لیکن اگر عرش سے مراد پورا عالم ہو، نہ کہ صرف اجسام کا عالم، تو اس کا حکم دوسرا ہو گا، یہ حکم نہیں ہو گا۔ یہ سب کچھ اس منزل میں شامل ہے اور اس کے علم کی ضرورت ہے تاکہ معاملہ اپنی حقیقت پر معلوم ہو جائے۔\n\nاور اس میں ادوات (آلات) کے اختلاف سے استواء کے اختلاف کا علم ہے، اور ادوات کے نہ ہونے سے بھی۔ اور اس میں جماعتوں کے اختلاف کا علم ہے، اور یہ کہ سب ایک جماعت کیوں نہیں ہوئے؟ اور کس چیز سے ایک جماعت دوسری سے ممتاز ہوئی؟ اور وہ کون سی صفت ہے جو ہر جماعت میں مفقود تھی کہ جماعتیں تقسیم ہو گئیں اور افراد میں تقسیم نہیں ہوئیں؟\n\nاور اس میں حس کی قوتوں میں سے پہلی قوت کا علم ہے جس کا حکم بعث (دوبارہ اٹھائے جانے) کے وقت ہو گا، اور کیا بعث سے پہلے حس کی کسی دوسری قوت کا حکم اس سے پہلے ہو گا یا نہیں؟\n\nاور اس میں تمام اجسام پر روح الٰہی کے پھیلاؤ کا علم ہے۔\n\nاور اس میں قیامت کے دن مخلوق میں اللہ کے حکم کے احوال کا علم ہے، اور وہ کس اسم کے ساتھ اس دن ظہور الٰہی (التجلی) کرے گا؟\n\nاور اس میں الٰہی قوت، نشر (پھیلانا) اور طی (لپیٹنا) کا علم ہے کہ یہ کس وقت ہو گا؟ اور کیا یہ عالم کے بعث سے پہلے ہو گا یا بعد میں؟ اگر بعد میں ہو گا تو اس وقت عالم کہاں ہو گا؟ اور کیا اس دن فرشتے اور بشر ایک ہی میدان میں جمع ہوں گے یا نہیں؟\n\nاور اس میں اس شخص کے مقام کا علم ہے جس نے ذات حق (الحق) کو مخلوق کی صفات سے متصف کیا، اس کی ملامت اور اس علم میں اس کی رسائی کا علم ہے۔\n\nاور اس میں چھوٹے اور بڑے کو ادب سکھانے کا علم ہے، اور یہ اللہ کا قول ہے: **إياك أعني فاسمعي يا جارة** (میں تمہیں مخاطب کرتا ہوں، اے پڑوسن، تم سنو)۔\n\nاور اس میں خطاب کی ترتیب میں ادوات (آلات) کا علم ہے، اور ہر آلہ کیا فائدہ دیتا ہے، اور صورت میں ادوات کا اشتراک اور حکم میں ان کا اختلاف، جیسے لفظ \"لا\" (نہیں)۔ اس کی صورت ایک ہے اور یہ ادوات میں سے ہے، لیکن اس کے احکام مختلف ہیں اس حضوری کے لحاظ سے جس میں وہ ظہور الٰہی (التجلی) کرتی ہے۔ پس اس کا حکم نفی بھی ہو سکتا ہے، اور نہی بھی، اور عطف بھی۔ اور اسی طرح باقی ادوات۔ اور یہ علم بیان میں سے ہے جو انسان کو سکھایا گیا ہے۔\n\nاور اس میں شریعت میں مذموم قسم (الايمان المذموم) کا علم ہے، اور کیا قسم کا حکم اپنی ذات میں وہی ہے جو شریعت میں ہے یا نہیں؟ اور کیا اس سے اس کی حقیقت سے عدول کیا جاتا ہے، پس وہ اپنی حقیقت کے علاوہ کسی اور صورت میں ظہور الٰہی (التجلی) کرتا ہے، اور اس صورت کو اس نام سے موسوم کیا جاتا ہے جس کی طرف وہ منتقل ہوا؟\n\nاور اس میں جھوٹ (الکذب) کے مراتب کا علم ہے، اور اس میں سے محمود اور مذموم کون سا ہے؟ اور اسے کہاں استعمال کرنا واجب ہے اور کہاں حرام؟ اور جھٹلانے والوں کے مراتب کا علم ہے۔\n\nاور اس میں خنثیٰ (ہیجڑا) کے مرتبے کا علم ہے، اور وہ وہ ہے جس کی طرف ذکورت (مردانگی) منسوب کی جاتی ہے تو وہ اسے قبول کرتا ہے، اور انوثت (عورت پن) منسوب کی جاتی ہے تو وہ اسے قبول کرتا ہے۔ پس کیا وہ مرد ہے یا عورت؟ یا نہ مرد ہے اور نہ عورت؟ کیونکہ اللہ نے فرمایا: **خَلَقَ الذَّكَرَ وَالْأُنْثَى** (اس نے نر اور مادہ کو پیدا کیا)۔ تو کیا یہ خطاب خنثیٰ کو شامل ہے؟ کیونکہ وہ ایک مخلوق ہے جس کی طرف دونوں چیزیں منسوب کی جاتی ہیں، پس وہ اس خطاب کے تحت داخل ہو گا، یا وہ اس خطاب سے خارج ہے اور اللہ کے قول **الله خَالِقُ كُلِّ شَيْءٍ** (اللہ ہر چیز کا خالق ہے) کے تحت داخل ہو گا؟ کیونکہ خنثیٰ ایک درمیانی برزخ ہے۔ پس حیوان کا نام اس پر ضرور بولا جائے گا، کیونکہ یہ انسان کی خصوصیات میں سے نہیں ہے، جیسا کہ ذکورت اور انوثت نوع انسانی کی خصوصیات میں سے نہیں ہے۔\n\nاور اس میں اچانک آنے والی چیزوں کے انتظار کے لیے تیاری کا علم ہے، کیونکہ وہ نہیں جانتا کہ کیا آئے گا۔ اور یہ ایک ایسا مقام ہے جس میں میں نے اپنے آپ کو کسی سے زیادہ کامل نہیں پایا، اس پر اللہ کا شکر ہے۔\n\nاور اس میں اہم سے اہم چیز کو حاصل کرنے میں کوشش (التعمل) کا علم ہے، اور یہ احتیاط (الحزم) میں سے ہے، اور اس کا مقام سستی (التراخي) کے مقام سے کہاں ہے؟ اور کس چیز میں سستی احتیاط سے زیادہ بہتر ہے؟ اور احتیاط میں سے کون سی چیز قابل تعریف ہے، باوجود اس کے کہ وہ گمان کے برابر ہے؟ اور اس پر بہت سے امور کی بنیاد ہے، پس یہ ایک شریف علم ہے۔\n\nاور اس میں اس انجام کا علم ہے جو مکلف عالم (انسان اور جن) اور فرشتے کو پیش آئے گا، اور کیا ان سے خوف اٹھ جائے گا یا وہ ہمیشہ ہمیشہ ان کے ساتھ رہے گا؟\n\nاور اس میں علم کی صورت کے علاوہ میں ظہور الٰہی (التجلی) کا علم ہے۔\n\nاور اس میں نعمتوں کے حجاب کا علم ہے، اور انسان اللہ کے ساتھ کب زیادہ حاضر ہوتا ہے؟ کیا سختی کی حالت میں یا آسانی کی حالت میں؟ اور کس حال کے لیے عام حمد ہے اور کس حال کے لیے خاص حمد؟\n\nاور اس میں احوال کے اختلاف سے حمد کے اختلاف کا علم ہے۔\n\nاور اس میں اس شخص سے انس کا علم ہے جس سے انس ہوتا ہے، کیا وہ مناسب ہے یا غیر مناسب؟ یا دونوں سے؟\n\nاور اس میں اسباب پر اعتماد کا علم ہے، کیا وہ سب مذموم ہے یا محمود؟ یا اس میں سے کچھ مذموم ہے اور کچھ محمود؟ اور وہ کیا ہے جو حق کے وضع سے سبب ہے اور وہ کیا ہے جو خلق کے وضع سے سبب ہے؟\n\nاور اس میں موت کے علم کے مراتب کا علم ہے۔\n\nاور اس میں مخلوق سے وکالت کی نفی کا علم ہے۔\n\nاور اس میں کفایت (کافی ہونا) کا علم ہے، اور کس سے کفایت کی جاتی ہے؟ اور کیا کسی معاملے میں مخلوق سے کفایت کرنا صحیح ہے یا نہیں؟\n\nاور اس میں احسان کیا ہے اور محسن کون ہے، اس کا علم ہے، اور اساءت (برائی) اور مسیء (برائی کرنے والا) کون ہے، اس کا علم ہے۔\n\nاور اس میں دو مثالوں کا علم ہے، جب وہ تمام معنوی پہلوؤں سے مماثل ہوں، تو کیا وہ ساتھ رہیں گی یا نہیں؟ کیونکہ ان کے درمیان فائدہ ختم ہو گیا ہے۔ اور یہ ایک ایسا مسئلہ ہے جس پر صرف وہی شخص متنبہ ہوتا ہے جس کی بصیرت منور ہو، جو ہر سانس کے ساتھ فائدہ حاصل کرتا رہتا ہے۔ اور جس کی یہ حالت نہیں ہے، وہ انسانیت کے لحاظ سے انسان کامل (الإنسان الکامل) نہیں ہے، کیونکہ اسے نظر صرف فائدہ حاصل کرنے کے لیے دی گئی ہے۔\n\nاور اس میں اللہ کے ساتھ معاملہ کرنے اور مخلوق کے ساتھ معاملہ کرنے کے درمیان فرق کا علم ہے، اور کیا عامل کے نزدیک دونوں معاملات میں نگرانی (مراقبة) برابر ہے یا نہیں؟ خاص طور پر اس شخص کے نزدیک جو یہ دیکھتا ہے کہ اللہ نے عالم کے لیے ایک دوسرے پر حقوق مقرر کیے ہیں، پس عامل پر مخلوق کی نگرانی کرنا ضروری ہو جاتا ہے تاکہ وہ ان حقوق کو ادا کرے جو اللہ نے ان کے لیے اس پر واجب کیے ہیں۔ تو کیا یہ اس کی حق کی نگرانی میں سے ہے، پس اس نے صرف حق کی نگرانی کی؟ یا کیا یہ مخلوق کی نگرانی میں سے ہے؟\n\nپس یہ ان حقوق کے استحقاق کی طرف لوٹتا ہے۔ اور کیا عالم نے یہ حقوق اس شخص پر اپنی ذات کی وجہ سے مستحق کیے ہیں، یعنی مستحقین کی ذات کی وجہ سے، یا کیا وہ انہیں اللہ کے مقرر کرنے کی وجہ سے مستحق کرتے ہیں؟ پس اس منزل سے امر کی صورت اپنی حقیقت پر معلوم ہو جاتی ہے، خواہ وہ مجموعی ہو یا تفصیلی۔\n\nاور اس میں عذاب اور نعمت کے طبقات کی فضیلت کا علم ہے۔\n\nاور اس میں مثالیں بیان کرنے کا علم ہے، اور کس کے لیے مثال بیان کرنا مناسب ہے اور کس کے لیے مثال بیان کرنا مناسب نہیں؟ اللہ کے اس قول کی وجہ سے: **فَلَا تَضْرِبُوا لِلَّهِ الْأَمْثَالَ** (پس اللہ کے لیے مثالیں نہ بیان کرو)۔ حالانکہ اس نے خود مثالیں بیان کیں، پس فرمایا: **إِنَّ الله يَعْلَمُ كَيْفَ يَضْرِبُهَا وَأَنْتُمْ لَا تَعْلَمُونَ** (بے شک اللہ جانتا ہے کہ وہ انہیں کیسے بیان کرتا ہے اور تم نہیں جانتے)۔ پس اس نے ان پر مقامات کی جہالت کو لازم کیا۔ پس عالم اپنی عمر ان مثالوں کو دیکھنے میں گزارتا ہے جو اللہ نے بیان کی ہیں، اور وہ اپنے نفس سے کوئی مثال اخذ نہیں کرتا، خاص طور پر اللہ کے لیے۔ اور میرا نہیں خیال کہ انسان کی عمر ان مثالوں کے علم کو حاصل کرنے کے لیے کافی ہو گی جو اللہ نے بیان کی ہیں۔\n\nاور اس میں اس شخص کا علم ہے جو اللہ کی طرف سے بیان کرتا ہے، کیا اسے ہادی (ہدایت دینے والا) کہا جائے گا یا نہیں؟ کیونکہ وہ بلاشبہ مہدی (ہدایت یافتہ) ہے۔\n\nاور اس میں قرآن کا حال ان تلاوت کرنے والوں میں ہے جو اللہ کی طرف سے عارف ہیں، جو اس کے اپنے دلوں پر نازل ہونے کو جانتے ہیں، اور اس سے انہیں جو قبض (تنگی) اور بسط (کشادہ دلی) حاصل ہوتا ہے، اور ان دونوں صفات میں سے کون سی صفت حال کے ساتھ تلاوت کرنے والوں میں، یا قبض یا بسط میں، پہلے حکم کرتی ہے؟\n\nاور اس میں عقلمندوں میں عقل کی فضیلت کا علم ہے، اور عقل کا مغز (لب) کیا ہے؟ کیا اس کا حکم عقل کے حکم جیسا ہے یا نہیں؟ کیونکہ اللہ نے آیات کو تقسیم کیا، پس کچھ آیات **لِأُولِي الْأَلْبَابِ** (عقل والوں کے لیے) بنائیں اور کچھ آیات **لِقَوْمٍ يَعْقِلُونَ** (ان لوگوں کے لیے جو عقل رکھتے ہیں)۔ پس اس نے انہیں عقال (باندھنے) سے مقید کیا، اور وہ تقیید ہے۔\n\nاور اس میں مقرب (قربت یافتہ) کا علم ہے، کیا اس کی عنایت کے نفاذ میں اللہ کے نزدیک کوئی حد ہے یا اس کی عنایت مطلقاً نافذ ہوتی ہے؟\n\nاور اس میں ان اخلاق حسنہ کی پیروی کی فضیلت کا علم ہے جن کی پیروی کا اللہ نے حکم دیا ہے۔\n\nاور اس میں نفع اور نقصان کا علم ہے کہ وہ کس چیز کی طرف لوٹتے ہیں؟\n\nاور اس میں عقلی احتیاط (الحذر العقلي) اور شرعی احتیاط (الحذر المشروع) کا علم ہے، کیا وہ وہی عقلی احتیاط ہے جسے عقل نے متعین کیا ہے یا اس میں کوئی تعین نہیں ہے سوائے شریعت کے؟ یا اس میں وہ ہے جس کا تعین اللہ نے عقل کے لیے کیا ہے، پس شریعت میں اس کے تعین سے کفایت کی گئی؟ اور اس میں وہ ہے جس کا تعین اللہ نے شریعت کے لیے کیا ہے۔\n\nاور اس میں مکروہ اور غیر مکروہ کا علم ہے۔\n\nاور اس میں انسان کو انسان بنانے کے لیے ذریت (نسل) کی نشأت کا علم ہے۔\n\nاور اس میں اشیاء میں تداخل (گھل مل جانا) کا علم ہے، جب وہ احوال اور اعراض ہوں، جیسے ایک ہی ذات میں ایک ہی وقت میں خوشبو اور رنگ، سکون، علم اور جہل کا تداخل۔\n\nاور اس میں کسی چیز میں شرکاء کے حصوں کے تعین کا علم ہے، اور یہ کہ جب وہ متعین ہو جائیں تو وہ شرکاء نہیں رہتے۔ اور حقیقت میں حصہ متعین ہونا ضروری ہے، اگرچہ اشتراک واقع ہو، تو یہ شرکاء کی جہالت کی وجہ سے ہے۔ کیونکہ جب تقسیم واقع ہو گی، تو یا تو عین چیز میں یا اس کی قیمت میں تعین ضروری ہے۔ پس اصل میں شرکت صحیح نہیں ہے، کیونکہ امور اللہ کے نزدیک اس مشترک کہلانے والی چیز میں متعین ہیں۔\n\nاور شرکاء کا نام عرفاً اور شرعاً ثابت ہو چکا ہے، تو یہ کس چیز کی طرف لوٹتا ہے؟ کیا تم ان لوگوں کو نہیں دیکھتے جنہوں نے اللہ کے ساتھ الوہیت میں شریک بنائے، کیا ان کا اس میں کوئی حصہ ہے؟ پس جب تم جان لو کہ ان کا الوہیت میں کوئی حصہ نہیں ہے، تو وہ شریک نہیں ہیں، حالانکہ انہیں شریک کہا گیا ہے۔\n\nپس یہ معلوم ہوتا ہے کہ الٰہی وسعت کی وجہ سے عالم میں شرکت اصلاً صحیح نہیں ہے۔ پس دو یا زیادہ لوگ کسی بھی معاملے میں شریک نہیں ہوتے۔ پس جو اس کے پاس ہے وہ اس کے پاس موجود چیز کی عین نہیں ہے، اگرچہ اس پر اشتراک کا نام بولا جائے۔ پس ہم کہتے ہیں کہ جس چیز سے اشتراک واقع ہوا وہ اس چیز سے مختلف ہے جس سے امتیاز واقع ہوا۔ اور وہاں صرف امتیاز ہی ہے، شرکت نہیں ہے۔ کیونکہ جو اس کے پاس ہے وہ دوسرے کے پاس موجود چیز کی عین نہیں ہے۔\n\nپس اس کشف (الکشف) سے عرف میں شرکت کے اطلاق کا معنی معلوم ہوتا ہے، اور یہ کہ شریعت نے اس میں عرف کی پیروی کی تاکہ اس سے سمجھا جائے، کیونکہ وہ اپنی قوم کی زبان میں آیا، اور وہ وہی ہے جس پر وہ متفق تھے۔ اور اسی لیے لوگوں میں اختلاف ہوا کہ کیا رسول کے لیے اس زبان میں کوئی لغوی وضع ہے یا نہیں؟\n\nاور اس میں احوال، زمانوں، جگہوں، اشخاص اور واقعات کے اختلاف سے اللہ کی طرف سے شرائع کے نزول کے اختلاف کا علم ہے۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و چهل و پنجم: در معرفت منزل سر اخلاص در دین، و اینکه دین چیست، و چرا شریعت، دین نامیده شده است، و سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) که فرمود: «خیر عادت است».\n\n> هر کس را از قرآن سوره‌ای است *** و سوره من از کتاب خدا، تنزیل (نزول) است\n> آن را فرشتگان علوی آوردند *** در هنگام نزول، میکائیل و جبرئیل پیشاپیش آن بودند\n> آن را آوردند در حالی که جوانبش به نرمی خم می‌شد *** و در اطرافش هدایت و گمراهی بود\n> اگر بنگری، در آیاتش شگفتی بینی *** آتش و نور و تنزیه و تمثیل\n> دوشیزه‌ای است که چشمانش سیاهی دارد *** و مژگانش با سرمه‌دان، سرمه نکشیده است\n\n### [اخلاص در دین]\n\nاین سوره در شهر حلب بر ما تجلی کرد و هنگامی که آن را دیدم به من گفته شد: این سوره‌ای است که نه انسان و نه جن آن را لمس نکرده‌اند. پس برای آن و از آن، میلی عظیم به سوی خود دیدم. و آن سوره برای من به شکل همین منزلی که پیش از آن وارد شده بودم، تمثل یافت. سپس به من گفته شد: «این خالص برای توست، نه برای دیگر مؤمنان (خالِصَةً لَكَ من دُونِ الْمُؤْمِنِينَ)». چون این به من گفته شد، اشاعره را فهمیدم و دانستم که آن ذات من و عین صورت من است، نه دیگری؛ زیرا هیچ موجودی چیزی خالص برای خود ندارد که قدیم و جدیدش تنها ذات او باشد، نه برای دیگری. پس گفتم: «ها أنا ذا (این منم)». در آن هنگام معنای تخليص (خالص‌سازی) را دانستم و آنچه هنگام تلاوت بر من نازل شده بود را فهمیدم. و آن این است که چون الهام تلاوت سوره اخلاص نازل شد، عین فهم در نامگذاری آن به این نام، و نه نام‌های دیگر سوره‌ها، به من روزی شد؛ زیرا همه سوره‌ها نسبت و صفت خداوند هستند و عین مجموع عالم‌اند. پس اشاره آن را چنین فهمیدم که عالم، با وجود اینکه از حیث مجموع، حق مبین است، نه از حیث جزء جزء آن، نسبت برای خداوند از حیث ذاتش خالص می‌شود. پس این مجموع در حقیقت، عین واحدی است و در عالم، عین حق مبین است. گروهی از امت یهود گفتند: پروردگارت را برای ما وصف کن. پس خداوند او را به مجموع عالم، با آنچه از جانب حق تعالی بر او نازل شد، نسبت داد. به او گفته شد: «بگو اوست خدا، یکتا (قُلْ هُوَ الله أَحَدٌ)». پس او را به احدیت (یکتایی) وصف کرد. و هر جزئی از عالم، احدیتی مخصوص به خود دارد که در آن شریک ندارد و با آن از هر آنچه غیر اوست متمایز و معین می‌شود، علاوه بر صفات اشتراکی که دارد. سپس به او گفته شد: «الله الصَّمَدُ (الله صمد است)». و صمد کسی است که در امور به او روی آورده می‌شود، یعنی پناه برده می‌شود. و تمام اسباب وضع شده در عالم، به آن‌ها پناه برده می‌شود و به همین دلیل اسباب نامیده شده‌اند تا مسبباتشان به صمد اولی که اسباب به او پناه می‌برند، متصل شوند. «لَمْ يَلِدْ (نزاده است)» و او عقیمی است که برایش فرزندی متولد نمی‌شود. و با همین صفت، باد به عقیم بودن وصف شده است، زیرا برخی از بادها بارورکننده و برخی عقیم هستند. «وَلَمْ يُولَدْ (و زاده نشده است)» مانند آدم (علیه السلام)، زیرا ولادت نزد سؤال‌کنندگان معلوم است، پس با آنچه نزدشان معلوم است، مورد خطاب قرار گرفتند. «وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ (و هیچ کس همتای او نبوده است)». منظور از کفو (همتا) در اینجا، همسر است، به دلیل سخن کسانی که گفتند: مسیح پسر خداست و عزیر پسر خداست. و کفاءت به معنای مثل بودن است. و زن هرگز همتای مرد نیست، زیرا خداوند می‌فرماید: «وَلِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ (و مردان را بر زنان مرتبه‌ای است)». پس زن کفو او نیست، زیرا منفعل (پذیرنده) کفو فاعل (کننده) خود نیست. و عالم منفعل از خداست، پس کفو خدا نیست. و حوا منفعل از آدم است، پس آدم بر او درجه فاعلیت دارد و از این جهت کفو او نیست. و چون خداوند فرمود که مردان بر زنان مرتبه‌ای دارند، عیسی (علیه السلام) را منفعل از مریم قرار نداد تا مرد منفعل از زن نباشد، چنانکه حوا از آدم بود. پس جبرئیل یا فرشته «به صورت بشری کامل بر او متمثل شد (فَتَمَثَّلَ لَها بَشَراً سَوِيًّا)» و به او گفت: «من فرستاده پروردگار تو هستم تا پسری پاکیزه به تو ببخشم (أَنَا رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلاماً زَكِيًّا)». پس عیسی (علیه السلام) را به او بخشید. بنابراین، انفعال عیسی از فرشته‌ای بود که در صورت مرد تمثل یافته بود و به همین دلیل به صورت پدرش، مذکر، بشر و روح خارج شد. پس دو صورتی را که پدرش (که همان فرشته بود) بر آن بود، جمع کرد؛ زیرا فرشته از حیث عین خود، روح است و از حیث تمثل در صورت بشر، بشر است. پس این سوره را سوره اخلاص نامید؛ یعنی حق را برای عالم از تنزیهی که عقل بر آن برهان می‌آورد، خالص کرد و آن را از عالم به مجموع این صفات در عین واحد خالص ساخت. و این صفات در عالم پراکنده‌اند و یک عین واحد آن‌ها را جمع نمی‌کند. زیرا آدم (علیه السلام) کامل‌ترین صورتی بود که در عالم ظاهر شد، با این حال نقص «لَمْ يَلِدْ (نزاده است)» را داشت، در حالی که او أحد و صمد بود و «لَمْ يُولَدْ (زاده نشده بود)» و حوا کفو او نبود. پس این سوره، حق را از تشبیه خالص کرد، همان‌گونه که آن را از تنزیه خالص ساخت. اگر آنچه را اشاره کردیم، فهمیدی...\n\n### [سر اخلاص، سر قدر است که خداوند علم آن را از عالم پنهان داشت]\n\nپس بدان که سر اخلاص، سر قدر (سرنوشت) است که خداوند علم آن را از عالم، بلکه از بیشتر عالم، پنهان داشت. پس اشیاء را با حدودشان متمایز ساخت. این معنای سر قدر است، زیرا قدر، عین توقیف (توقف و تعیین) است. و با آن اشیاء متمایز شدند و خالق از مخلوق و حادث از قدیم متمایز شد. حادث با وصف ثابتی که دانسته و مشاهده می‌شود، متمایز شد، اما قدیم با وصف ثبوتی که دانسته شود، از حادث متمایز نشد، بلکه تنها با سلب آنچه حادث با آن متمایز شده، از او متمایز شد. پس او سبحانه، معلومِ مجهول است. جز او دانسته نمی‌شود و جز او مجهول نیست. پاک است کسی که علم به او عین جهل به او بود و جهل به او عین علم به او بود. و بزرگتر از این تمایز و واضح‌تر از آن برای کسی که تعقل کند و بینا شود، وجود ندارد.\n\nاما اخلاص در دین، همان جزای وفاق (پاداش متناسب) است. پس در آنجا جزای وفاق است که نه کم می‌شود و نه زیاد. زیرا خداوند آن را «جزای وفاق (جَزاءً وِفاقاً)» قرار داد، که خبری از یک حقیقت است؛ زیرا مجازات‌شونده نمی‌تواند چیزی را بپذیرد که استعدادش آن را نمی‌دهد. و با استعدادش، آنچه را که از دین بر او ظاهر شده و در آن پاداش می‌طلبد، پذیرفته است. یعنی استعداد، پاداش را پذیرفته است. پس پاداش، وفاق (متناسب) بود. و پاداش جز برای عمل نیست و عامل آن را جز از عمل خود نمی‌گیرد. و به همین دلیل گفته شده است که در بهشت چیزی است که «نه چشمی دیده، نه گوشی شنیده و نه بر قلب بشری خطور کرده است». و این صحیح است، زیرا از عاملان، عملی صادر می‌شود بدون قصد آنچه چشمش دیده یا گوشش شنیده یا بر قلبش خطور کرده است، مگر هنگامی که از او ظاهر شد، در آن هنگام چشمش آن را دید و برایش خطور کرد. همان‌گونه که آنچه را در بهشت می‌بیند، در دنیا ندیده و نشنیده و بر قلبش خطور نکرده است. پس آن، جزای وفاق برای این نوع از عمل است. و این عمل از قول خداوند متعال است: «و شما را در آنچه نمی‌دانید، ایجاد می‌کنیم (وَنُنْشِئَكُمْ في ما لا تَعْلَمُونَ)». پس آن را در منزلی ظاهر کرد که از جهت فکرش آن را نمی‌داند و چشمش آن را ندیده و گوشش نشنیده که در آنجا اقامت خواهد کرد. پس پاداش او همان چیزی است که در بهشت ذکر شده و «نه چشمی دیده، نه گوشی شنیده و نه بر قلب بشری خطور کرده است». پس پاداش برای این عمل با صفت وفاق خالص شد. و این از سر قدر است.\n\nو چون دین، عمل خیر است و دین، عادت است،\n\nپیامبر (علیه السلام) فرمود: «خیر، عادت است».\n\nو این ذکر، بشارتی است از عالمی به امور، یعنی رسول (صَلَّى اللهُ عَليهِ وسَلَّم)، مبنی بر اینکه نفس ذاتاً خیر است و شر را نمی‌پذیرد مگر به دلیل اصرار (لجاجة) قرین (همراه) که بر او اصرار می‌ورزد. پس شر را از ذات نفس قرار نداد.\n\nپس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «خیر، عادت است و شر، اصرار (لجاجة) است».\n\nو چون قرین بر نفس اصرار ورزید و به شر که عین مخالفت امر و نهی خداست، پافشاری کرد و منافذ نفس از این اصرار و پافشاری تنگ شد، خداوند به او وحی کرد، بلکه از وجه خاصی که فرشته آن را نمی‌شناسد، با او سخن گفت که آنچه را قرین بر او اصرار ورزیده، بپذیرد. پس حق در نفس، وحشت و ترس از مکر الهی دید. پس مقام تبدیل را به او نشان داد و سرانجام مکلفین را به رحمت به او شهود داد و این آیه را بر او تلاوت کرد: «خداوند بدی‌هایشان را به نیکی‌ها تبدیل می‌کند (يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ)». و در مورد اسراف‌کنندگان این آیه را تلاوت کرد: «از رحمت خدا ناامید نشوید، همانا خداوند همه گناهان را می‌آمرزد (لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً)». پس وحشت او را زدود و نفس، شری را که قرین برایش آورده بود، پذیرفت. قرین از این پذیرش نفس شاد شد، زیرا از عموم رحمت و عموم عفو و مغفرت جاهل بود. و ندانست که خداوند نفس را در پذیرش شر قرین با اصرار و پافشاری، در منزلت شخص مجبور قرار داده است و شخص مجبور مؤاخذه نمی‌شود. پس شر را «لجاجة (اصرار)» نامید که بشارتی الهی است و هر کسی آن را درک نمی‌کند. و خیر را «عادت» قرار داد، زیرا نفس ذاتاً خیر است، چون پدرش روح قدسی طاهر است و طبیعتش جز خیر نیست. و مادرش این صورت تسویه‌شده از این اخلاط است. پس اولین پذیرشی که در او ظاهر شد، پذیرش اعتدال و عدل بود و این همان قول خداوند است: «پس تو را تسویه کرد و معتدل ساخت (فَسَوَّاكَ فَعَدَلَكَ)». و پذیرش عدل، عین خیر است. و این نشأت، در اصل، مجاورت اضداد (اخلاط) را پذیرفت. و عادت ضد، نفرت از ضد خود است، اما در اینجا تنافری یافت نشد. پس این دلالت بر خیریت اصل دارد. سپس پذیرش او پس از تعدیل و تسویه، برای نفخ روح قدسی بود. پس اولین پذیرشی که بر آنچه بر نشأت او افزوده شد، پذیرش نفخ این روح خیر، طاهر و مطهر بود. به همین دلیل، خیر برای او عادتی است به طبعی که بر آن سرشته شده است. و به همین دلیل، در نهایت به اصل خود باز می‌گردد، زیرا اصل او همان پذیرش خیری است که ذکر کردیم. پس رحمت در نهایت به او می‌رسد، همان‌گونه که وجودش عین رحمت بود. پس امر با آنچه آغاز شد، ختم گردید و خاتمه عین سابقه است.\n\nو آنچه گفته ما را تأیید می‌کند این است که اولین نشأت انسانی که اصل نشآت انسانی بود، در نهایت تقدیس و اوج شرافت بود، به دلیل اینکه بر صورت الهی خلق شده بود. پس جز آنچه مناسب بود، از او ظاهر نشد. همان‌گونه که مناسب بود با وجود مخالفتی که حقایق اسماء الهی متقابل اقتضا می‌کنند، زبان مذمت به مخالفت برخی از آن‌ها با برخی دیگر راه نیابد، همچنین مخالفتی که در این نشأت انسانی ظاهر می‌شود، در نهایت به عذاب جاودانه نمی‌انجامد، زیرا اصل (صورت الهی) او را از آن حفظ می‌کند. پس او در مخالفتش مجبور بود. و مخالفت ضروری است، زیرا تقابل اسماء در کسی که بر صورت او خلق شده، ضروری است. پس نافع، ضار نیست و معطی، مانع نیست. و ظهور این حقایق در این نشأت ضروری است تا کمال صورت محقق شود. پس مطیع در مقابل عاصی قرار می‌گیرد و مشرک در مقابل موحد و معطل در مقابل مثبت و موافق در مقابل مخالف، که این از امداد اسماء الهی است. و این همان قول خداوند است: «ما به هر دو گروه، اینان و آنان، از عطای پروردگارت مدد می‌رسانیم (كُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ)» یعنی مطیع و عاصی و اهل خیر و شر. و «عطای پروردگارت ممنوع نبوده است (ما كانَ عَطاءُ رَبِّكَ مَحْظُوراً)»، زیرا او به ذات خود عطا می‌کند و محل‌های ممکن، با استعداد خود می‌پذیرند و استعداد آن‌ها اثر اسماء الهی در آن‌هاست. و از اسماء الهی، موافق و مخالف وجود دارد، مانند موافقِ رحیم و غفور و امثال آن، و مانند مخالفِ معز (عزت‌دهنده) و مذل (خوارکننده). پس ضروری است که استعداد این محل، تحت حکم یکی از این اسماء باشد.\n\nپس پذیرش حکم الهی توسط او بر اساس آن خواهد بود، یا مخالف و یا موافق. و کسی که حالش چنین است، چگونه مذمت ذاتی به او تعلق می‌گیرد؟ و اعراض ثباتی ندارند. پس خیر در انسان ذاتی است و حکم آن برای او باقی می‌ماند و شر عرضی است و زائل می‌شود، هرچند پس از مدتی باشد. خداوند متعال می‌فرماید: «و خبر آن را پس از مدتی خواهید دانست (وَلَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ)». و این مانند قول اوست: «ای بندگان من (يا عِبادِيَ)» که آن‌ها را به خود اضافه کرد، همان‌گونه که نفوسشان را در خلقت به خود اضافه کرد و فرمود: «و از روح خود در او دمیدم (وَنَفَخْتُ فِيهِ من رُوحِي)». و «ما به هر دو گروه، اینان و آنان، از عطای پروردگارت مدد می‌رسانیم (وكُلًّا نُمِدُّ هؤُلاءِ وهَؤُلاءِ من عَطاءِ رَبِّكَ)». سپس فرمود: «آنان که بر خود اسراف کردند (الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ)». و اسراف، کرم عامی است که از حد و اندازه خارج است. و همچنین در مورد انفاق فرمود: «اسراف نکردند و بخل نورزیدند (لَمْ يُسْرِفُوا ولَمْ يَقْتُرُوا)»، یعنی بیش از نیاز توسعه ندادند و کمتر از نیاز کم نگذاشتند. «از رحمت خدا ناامید نشوید (لا تَقْنَطُوا من رَحْمَةِ الله)»، زیرا رحمت او «همه چیز را فرا گرفته است (وَسِعَتْ كُلَّ شَيْ‏ءٍ)». و شما از اشیاء هستید. و من به شما شناساندم که چگونه شما را ایجاد کردم و از چه چیزی شما را ایجاد کردم: از روحی مطهر و طبیعتی موافق، پذیرنده و مطیع، نه عاصی و نه مخالف. «همانا خداوند همه گناهان را می‌آمرزد (إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً)». پس چیزی از آن باقی نگذاشت. پس به چه چیزی عذاب را بر آن‌ها جاودانه می‌کند؟ و عذاب جز «جزای وفاق (جَزاءً وِفاقاً)» نخواهد بود. و او آمرزیده است. و کسی که آمرزیده شود، حکمی بر او نیست. زیرا کسی که او را آمرزیده، «اوست آمرزنده مهربان (هُوَ الْغَفُورُ الرَّحِيمُ)». و غفور رحیم به ذات خود است. پس کسی که از جانب او آمرزیده شود، از همان لحظه آمرزیده باقی می‌ماند و حکم گناه به او باز نمی‌گردد، زیرا حافظ او غفور رحیم است. اگر نامی غیر از این نام و امثال آن او را می‌آمرزید و زائل می‌کرد، ممکن بود که به دلیل نبود حافظ، ثابت نماند. پس به آنچه تو را آگاه ساختیم، توجه کن، زیرا آن از مغز معرفت است.\n\n### [کاملان از مردان خدا، خلفای عالم هستند]\n\nو بدان که کاملان از مردان خدا، خلفای عالم، کسانی که بر مشاهده (الشهود) عبادت کردند نه بر غیب، همان کسانی هستند که رؤیت الهی برایشان پاداش است نه افزونی. و کسی که از این کمال پایین‌تر باشد، همان کسی است که افزونی بر پاداش دارد، در قول خداوند: «برای کسانی که نیکی کردند، نیکی و افزونی است (لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ)». و این همان قول رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است که فرمود: «چون وزن کردی، سنگین‌تر کن». هنگامی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آنچه را بر عهده داشت، ادا کرد، چون آن را وزن کرد، به کسی که ترازو در دست داشت، فرمود: «سنگین‌تر کن».\n\nتا بر آنچه استحقاق دارد، بیفزاید، زیرا دید که حق، افزونی بر معاوضه را ذکر کرده است. و در این مقام فرمود: «بهترین شما در پرداخت، بهترین شماست».\n\nپس این همان اخلاص در دین است که جزای وفاق است. و در اینجا معنای\n\nقول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) ظاهر می‌شود: «و به تو از تو پناه می‌برم (وأعوذ بك منك)».\n\nزیرا هنگامی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) با ضمیر خطاب و بدون تعیین اسم، به او استعاذه کرد، مقابلی برای او نیافت، زیرا اسمی را تعیین نکرده بود. پس خود را بر صورت او دید و گفت: «منک (از تو)». پس به خدا از نفس خود پناه برد، زیرا نفس که همان مثل است، در قرآن آمده است، مانند قول خداوند: «پس خودتان را تزکیه نکنید (فَلا تُزَكُّوا أَنْفُسَكُمْ)»، یعنی امثال خود را. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «کسی را بر خدا تزکیه نمی‌کنم».\n\nو فرمود: «مانند ترس شما از خودتان (كَخِيفَتِكُمْ أَنْفُسَكُمْ)»، یعنی امثال شما. پس این قول\n\n«و به تو از تو پناه می‌برم (وأعوذ بك منك)»\n\nمی‌تواند به این معنا باشد که هر دو کاف یکی است، و می‌تواند به این معنا باشد که کاف در «منک» به مثل باز می‌گردد که همان نفس استعاذه‌کننده است، زیرا او خلیفه‌ای است که صورت را به کامل‌ترین وجه محقق کرده است. پس به خدا از نفس خود پناه برد، به دلیل آنچه از مکر خفی الهی می‌داند. زیرا خداوند صورت مثالی را در این نشأت تنها برای تشریف ظاهر نکرده است، بلکه هم شرف است و هم ابتلا (آزمایش). پس کسی که به حکم صورت بر کمال ظاهر شود، شرف را با هر دو دست خود به دست آورده است، زیرا صورت الهی از هیچ وجهی مذمت نمی‌پذیرد. و کسی که از این کمال نقص داشته باشد، در حق او مکر الهی است از جایی که نمی‌داند. همان‌گونه که خلافت در عالم، ابتلا است نه تشریف. و به همین دلیل\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا خلافت در آخرت پشیمانی است (مَندَمة)».\n\nبه دلیل حقوقی که بر عهده صاحب آن است و در روز قیامت از او مطالبه می‌شود، تا جایی که آرزو می‌کند هیچ امری از امور عالم را بر عهده نگرفته بود. و ما را شبان قرار داد.\n\nپس فرمود: «همه شما شبانید و همه شما مسئول از رعیّت خود هستید».\n\nپس برای هر شخصی حکمی از صورت الهی است. و کسی که صورت به کمال برایش جمع شده باشد، سؤال نمی‌شود، زیرا خداوند «از آنچه انجام می‌دهد، سؤال نمی‌شود و آنان سؤال می‌شوند (لا يُسْئَلُ عَمَّا يَفْعَلُ وهُمْ يُسْئَلُونَ)». و کسی که از روی هوی سخن نمی‌گوید، سؤال مناقشه و حساب از او نمی‌شود، اما ممکن است سؤال استفهام از او شود تا علمی ظاهر شود که شنوندگان از آن بهره ببرند، مانند سؤال حق از رسولانش در روزی که آن‌ها را جمع می‌کند و «می‌گوید: چه پاسخی شنیدید؟ (فَيَقُولُ ما ذا أُجِبْتُمْ)». پس می‌گویند: «ما علمی نداریم، همانا تو خود دانای غیب‌هایی (لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ)». پس اهل موقف (محل توقف) که صاحبان کشف هستند، می‌دانند که رسولان کامل‌ترین مردم در کشف هستند، با این حال خداوند آن‌ها را بر پاسخ قلب‌های امت‌هایشان و پاسخ کسانی که دعوتشان به آن‌ها رسیده و حاضر نبودند، و یا کسانی که حاضر بودند و با زبان پاسخ دادند، آگاه نساخته است که آیا با قلبشان نیز پاسخ دادند یا خیر. اگر بگویی: او پاسخ کسی را که با زبان پاسخ داد، شنیده است و آنچه را که پاسخ داده است، می‌داند. می‌گوییم: قرائن احوال حکمی دارند که جز کسی که آن‌ها را مشاهده کرده، نمی‌داند. و ما از عین پاسخ رسولان (علیهم السلام) دانستیم که آن‌ها از این سؤال خداوند فهمیدند که منظور او پاسخ قلب‌ها بوده است، زیرا گفتند: «ما علمی نداریم، همانا تو خود دانای غیب‌هایی (لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ)». اگر از سؤال خداوند متعال، پاسخ زبان‌ها را می‌فهمیدند، بین کسی که پاسخ او را با اقرار زبانش شنیدند و کسی که آن را نشنیدند، فرق می‌گذاشتند. پس چون در پاسخ، غیوب را ذکر کردند، دانستیم که سؤال درباره پاسخ قلب‌ها بوده است. و از این استفاده کردیم که کسی که برایش کشف می‌شود، لازم نیست که کشف او همه چیز را در بر گیرد، بلکه او تنها استعداد کشف را دارد. پس آنچه حق از اسرار عالم در آینه قلبش (اگر معنا باشد) یا در آینه دیده‌اش (اگر صورت باشد) برایش جلا داده، آن را کشف کرده و دیده است، نه غیر آن. اگر بگویی: کسی که حق، دیده‌اش باشد، شنیدم که می‌گویی کسی که حالش چنین است، هر مبصری را در هستی درک می‌کند و چیزی از دیده‌اش غایب نمی‌شود، زیرا او با حق می‌نگرد. می‌گوییم: راست گفتی، اما بین مقام و حال فرق است. و احوال بقایی ندارند. و این یک حال است. پس هنگام حصول آن، این کشف در آن زمان برای او صحیح بود. و چون از او برداشته شد، بازگشت تا با چشم خلق و با امداد حق بنگرد، نه با حق. پس حکم او حکم خواص خلق است که کشف جزئی دارند نه کلی، زیرا جز آنچه عادت عموم است، کشف نمی‌شود. پس اگر هر مبصری را در عالم کشف کند، آن را بر همان صورتی که در وقت خود دارد، کشف می‌کند. و چون از او برداشته شد، نمی‌داند که سرانجام آن مبصرات در زمان رفع این کشف به کجا انجامیده است، آیا بر همان حال باقی مانده‌اند یا از آن منتقل شده‌اند. و خداوند از آن‌ها علم به آن را طلب کرد، به دلیل قولشان: «ما علمی نداریم (لا عِلْمَ لَنا)». و پاسخ با گمان‌ها شایسته نیست. سپس کامل کردند و گفتند: «همانا تو خود دانای غیب‌هایی (إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ)». پس آن را به غیوب مقید کردند، زیرا آن روزی است که اسرار در آن آشکار می‌شود و اسرار، غیوب عالم نسبت به یکدیگرند. پس حق با این آیه، ادب با صاحبان کشف را به ما آموخت و اینکه مراتب کشف را بدانیم تا صاحب کشف را بالاتر از منزلتش قرار ندهیم و از او چیزی را نخواهیم که حالش استحقاق آن را ندارد. پس او را به زحمت می‌اندازیم و عذرش را نمی‌پذیریم و او را به جهل در آن وصف می‌کنیم، در حالی که ما نمی‌دانیم که جاهل بوده‌ایم. پس دو جهالت خواهد بود. و همان‌گونه که ملائکه مقامات معلومی دارند، بشر نیز مقامات معلومی دارد که افزونی برای آن‌ها از آنجا خواهد بود و از آن تجاوز نمی‌کنند. و اگر علمشان زیاد شود، از همان مقام است. و آن مقامی است که در آخرین نفسی که از او صادر می‌شود و روح از ترکیب پیکرش که مرگ نامیده می‌شود، جدا می‌شود، در آن مقام است. پس افزونی برای او از آن مقام خواهد بود. و به همین دلیل، در سرای آخرت بین مردم تفاوت درجات رخ می‌دهد و خداوند کسانی را که علم به آن‌ها داده شده و مؤمن هستند، بر مؤمنانی که علم به آن‌ها داده نشده، درجات و با مقامات برتری می‌دهد. و خداوند با مقامات، هر صنفی را بر صنف دیگر برتری داده است.\n\nو در این منزل از علوم، علم عرش است: آیا عرشی که اسم رحمان بر آن استوا (استقرار) یافته، همان عرشی است که خداوند (حکم عدل) در روز قیامت برای فصل و قضاوت بر آن می‌آید و هشت فرشته آن را حمل می‌کنند، یا عرش دیگری است؟ و اگر عرش دیگری غیر از آن باشد که بر آن استوا یافته، معنای\n\nقول رسول (صَلَّى اللهُ عَليهِ وسَلَّم) چیست، هنگامی که این آیه نازل شد: «و در آن روز هشت فرشته عرش پروردگارت را بر فراز آن‌ها حمل می‌کنند (وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمانِيَةٌ)» یعنی روز آخرت، فرمود: «و امروز چهار فرشته هستند».\n\nو این هشت فرشته ناشناخته چه کسانی هستند؟ آیا همه آن‌ها فرشته‌اند یا نه؟ یا برخی فرشته‌اند و برخی غیر فرشته؟ و آیا عرش، تختی است و آن یک ملک معین از ملک است، نه همه ملک؟ زیرا خداوند برای فصل و قضاوت بین بندگانش بر آن می‌آید و بندگانش از ملک هستند، پس باید ملک معینی باشد. و آیا این عرشی که خداوند در روز قیامت بر آن می‌آید، همان سایبان‌های ابر (ظلل الغمام) است که خداوند در روز قیامت در آن‌ها می‌آید یا خیر؟ و فرشتگان همان کسانی هستند که در «سایبان‌هایی از ابر (ظُلَلٍ من الْغَمامِ)» می‌آیند و آمدن خداوند مطلق از این تقیید است؟ و در آن علم نهایت سطح عرش است که آیا فوقیتی دارد یا خیر؟ و معنای «حول» برای آن چیست؟ و معنای استوا بر آن چیست، اگر به فوقیت وصف نشود؟ زیرا آن نهایت جسم است و پس از آن نه خلأ است و نه پر. و این همه در صورتی است که عرش، تختی یا ملکی خاص از عالم باشد. اما اگر عرش، عبارت از همه عالم باشد، نه عالم اجسام، حکم دیگری دارد که این حکم آن نیست. این همه در این منزل گنجانده شده است و نیاز به علم به آن است تا امر بر همان صورتی که هست، دانسته شود.\n\nو در آن علم اختلاف استوا با اختلاف ابزارهای دخیل و با نبود ابزارهاست. و در آن علم اختلاف جماعت‌هاست و اینکه چرا همه یک جماعت نبودند؟ و جماعت از جماعت دیگر به چه چیزی متمایز شد؟ و صفتی که هر جماعت فاقد آن بود تا جماعت‌ها متفرق شدند و به آحاد متفرق نشدند، چیست؟ و در آن علم اولین قوه‌ای است که در هنگام بعث (برانگیختن) از قوای حس، حکم خواهد داشت. و آیا حکم قوه دیگری از قوای حس قبل از بعث بر آن مقدم می‌شود یا خیر؟ و در آن علم انتشار روح الهی بر همه اجسام است. و در آن علم احوال حکم خداوند در روز قیامت در خلق است و با کدام اسم در آن روز تجلی می‌کند؟ و در آن علم قوه الهی و نشر و طی (گستراندن و درهم پیچیدن) است که در چه زمانی خواهد بود؟ و آیا بر بعث عالم مقدم می‌شود یا تأخیر می‌یابد؟ و اگر تأخیر یابد، عالم در آن هنگام کجا خواهد بود؟ و آیا ملائکه و بشر در آن روز در یک سطح جمع می‌شوند یا خیر؟ و در آن علم منزلت کسی است که حق را به اوصاف خلق وصف کرده است، از جهت مذمت و میزان علم او در آن. و در آن علم تأدیب کوچک و بزرگ است و آن همان قول است: «ای همسایه، تو را می‌گویم، پس بشنو». و در آن علم ابزارها در ترتیب خطاب است و اینکه هر ابزاری چه فایده‌ای دارد؟ و اشتراک ابزارها در صورت و اختلاف آن‌ها در حکم، مانند لفظ «لا» که صورتش یکی است و از جمله ابزارهاست، اما احکامش بر حسب حضرتی که در آن تجلی می‌کند، متفاوت است. پس حکم آن نفی است و گاهی نهی است و گاهی عطف. و همچنین سایر ابزارها. و این از علم بیان است که به انسان آموخته شده است.\n\nو در آن علم ایمان مذموم در شرع است و آیا حکم ایمان در نفس خود، حکم شرع در آن است یا خیر؟ و آیا از حقیقت خود عدول می‌کند و تجلی‌ای در غیر حقیقت صورتش برای او ظاهر می‌شود و به آن صورتی که به آن منتقل شده، نامیده می‌شود؟ و در آن علم مراتب دروغ و ستوده آن از مذمومش است و کجا استعمال آن واجب و کجا حرام است؟ و مراتب تکذیب‌کنندگان. و در آن علم مرتبه خنثی (دوجنسی) است و او کسی است که ذکورت به او نسبت داده می‌شود و می‌پذیرد و انوثت به او نسبت داده می‌شود و می‌پذیرد. پس آیا او مذکر است یا مؤنث؟ یا نه مذکر است و نه مؤنث؟ زیرا خداوند فرمود: «مذکر و مؤنث را آفرید (خَلَقَ الذَّكَرَ والْأُنْثى‏)». آیا این خطاب شامل خنثی می‌شود؟ زیرا او مخلوقی است که هر دو امر به او نسبت داده می‌شود، پس تحت این خطاب داخل می‌شود، یا از این خطاب خارج است و تحت قول خداوند: «الله خالق هر چیزی است (الله خالِقُ كُلِّ شَيْ‏ءٍ)» داخل می‌شود؟ زیرا خنثی برزخی متوسط است. و اسم حیوان بر او اطلاق می‌شود و این ضروری است، زیرا از خصائص انسان نیست، همان‌گونه که ذکورت و انوثت از خصائص نوع انسانی نیست.\n\nو در آن علم آمادگی برای انتظار ناگهانی‌هاست، زیرا نمی‌داند چه چیزی می‌آید. و این مقامی است که به حمد خدا کسی را کامل‌تر از خود در آن ندیده‌ام. و در آن علم تلاش در کسب مهم‌تر و مهم‌تر است و این از دوراندیشی (حزم) است. و جایگاه آن از جایگاه سستی کجاست؟ و در چه چیزی سستی اولی‌تر از دوراندیشی است؟ و چه چیزی از دوراندیشی ستوده است، با وجود اینکه عین گمان است و امور بسیاری بر آن بنا می‌شود؟ پس آن علمی شریف است.\n\nو در آن علم سرانجام عالم مکلف از انسان و جن و کسانی که ملائکه هستند، است. و آیا ترس از آن‌ها برداشته می‌شود یا برای همیشه همراهشان خواهد بود؟ و در آن علم تجلی در غیر صورت علم است. و در آن علم حجاب نعمت‌هاست و اینکه انسان در چه حالی حضور کامل‌تری با خدا دارد، آیا در حال سختی یا در حال آسایش؟ و حمد عام و حمد خاص برای کدام حال است؟ و در آن علم اختلاف ستایش‌ها به دلیل اختلاف احوال است. و در آن علم انس با کسی است که انس با او رخ می‌دهد، آیا با مناسب است یا با غیر مناسب یا با هر دو؟ و در آن علم اعتماد بر اسباب است، آیا همه آن مذموم است یا ستوده؟ یا برخی از آن مذموم و برخی ستوده است؟ و آنچه سبب به وضع حق است و آنچه سبب به وضع خلق است، چیست؟ و در آن علم مراتب علم به مرگ است. و در آن علم نفی وکالت از خلق است. و در آن علم کفایت است و اینکه به چه کسی اکتفا می‌شود؟ و آیا اکتفا به مخلوق در امری صحیح است یا خیر؟ و در آن علم احسان چیست و محسن کیست؟ و علم اسائه (بدی کردن) و مسیء (بدکار) کیست؟ و در آن علم دو مثلی است که از همه وجوه معنوی شبیه یکدیگر باشند، آیا با هم همراه می‌شوند یا خیر؟ زیرا فایده بین آن‌ها برداشته شده است. و این مسئله‌ای است که جز کسی که بصیرتش نورانی شده و پیوسته با هر نفس بهره می‌برد، به آن توجه نمی‌کند. و کسی که این حال را ندارد، انسان کامل انسانیت نیست، زیرا نظر (اندیشه) به او داده شده تا بهره ببرد.\n\nو در آن علم فرق بین معامله با خدا و معامله با خلق است. و آیا مراقبه در هر دو معامله نزد عامل یکسان است یا خیر؟ به ویژه نزد کسی که می‌بیند خداوند برای عالم حقوقی بر یکدیگر قرار داده است. پس بر عامل لازم است که خلق را مراقبه کند تا حقوقی را که خداوند بر او واجب کرده، ادا کند. آیا این از مراقبه اوست، به طوری که جز حق را مراقبه نکرده است؟ یا این از مراقبه خلق است؟\n\nپس این به استحقاق این حقوق باز می‌گردد. و آیا عالم این حقوق را بر این شخص به خاطر ذاتشان، یعنی ذات مستحقین، استحقاق یافته‌اند یا به خاطر جعل خداوند؟ پس از این منزل، صورت امر بر حقیقتش، از جمع یا تفصیل، دانسته می‌شود. و در آن علم تفاوت طبقات عذاب و نعیم است. و در آن علم مَثَل زدن است و اینکه برای چه کسی شایسته است مَثَل زده شود و برای چه کسی شایسته نیست، به دلیل قول خداوند: «پس برای خدا مَثَل نزنید (فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ)». در حالی که خود مَثَل زده و فرموده است: «همانا خداوند می‌داند چگونه مَثَل می‌زند و شما نمی‌دانید (إِنَّ الله يَعْلَمُ كيف يَضْرِبُها وأَنْتُمْ لا تَعْلَمُونَ)». پس جهل به مواطن را به آن‌ها نسبت داد. و عالم عمر خود را در نظر به آنچه خداوند برایش مَثَل زده، سپری می‌کند و مَثَلی از خود استنباط نمی‌کند، به ویژه برای خدا. و گمان نمی‌کنم عمر انسان برای تحصیل علم آنچه خداوند برایش مَثَل زده، کافی باشد.\n\nو در آن علم کسی است که از جانب خدا بیان می‌کند، آیا هادی نامیده می‌شود یا خیر؟ زیرا او بدون شک هدایت شده است. و در آن علم حال قرآن در تلاوت‌کنندگان از جانب خداست که به نزول آن بر قلب‌هایشان عارف هستند و اینکه این امر چه قبض و بسطی به آن‌ها می‌دهد؟ و حکم کدام یک از این دو صفت در تلاوت‌کنندگان به حال، یا در قبض یا بسط، مقدم است؟ و در آن علم فضیلت عقل در عاقلان است و لب عقل چیست؟ آیا حکم آن حکم عقل است یا خیر؟ زیرا خداوند آیات را تفکیک کرد و آیاتی را برای «صاحبان خرد (لِأُولِي الْأَلْبابِ)» و آیاتی را برای «گروهی که تعقل می‌کنند (لِقَوْمٍ يَعْقِلُونَ)» قرار داد. پس آن‌ها را از «عقال» که همان تقیید است، مقید کرد. و در آن علم مقرب است، آیا در نفوذ عنایتش نزد خدا حدی دارد یا عنایتش مطلقاً نفوذ می‌کند؟ و در آن علم شرف پیروی از آنچه خداوند پیروی از آن را از مکارم اخلاق تشریع کرده است، می‌باشد. و در آن علم سود و زیان است که چرا باز می‌گردند؟ و در آن علم حذر عقلی و حذر مشروع است، آیا حذر عقلی همان است که عقل آن را معین می‌کند یا در آن تعیینی جز برای شرع نیست؟ یا در آن چیزی است که خداوند تعیین آن را به عقل واگذار کرده و به آن از تعیین در شرع اکتفا کرده است؟ و از آن چیزی است که خداوند تعیین آن را به شرع واگذار کرده است. و در آن علم آنچه مکروه است و آنچه مکروه نیست، می‌باشد. و در آن علم نشأت ذریه برای ایجاد انسان به آنچه انسان است، می‌باشد. و در آن علم تداخل در اشیاء است، هنگامی که احوال و اعراض باشند، مانند تداخل بو و رنگ و سکون و علم و جهل در یک ذات واحد در یک زمان واحد. و در آن علم تعیین سهم شرکا در یک چیز است و اینکه اگر سهم‌ها تعیین شوند، دیگر شریک نیستند. و ضروری است که نصیب در نفس الامر معین باشد و اگر اشاعه (مشاع بودن) رخ داده، به دلیل جهل شرکا در آن است. زیرا ضروری است که هنگام تقسیم، یا در عین شیء یا در قیمت آن معین شود. پس در اصل، شرکت صحیح نیست، زیرا امور نزد خدا در این شیء که مشترک نامیده می‌شود، معین هستند. و اسم شرکا عرفاً و شرعاً ثابت شده است. پس چرا باز می‌گردد؟ آیا نمی‌بینی کسانی را که با خدا شریکانی در الوهیت گرفتند، آیا نصیبی از آن دارند؟ پس اگر دانستی که نصیبی در الوهیت ندارند، پس شریک نیستند، در حالی که شریک نامیده شده‌اند. پس دانسته می‌شود که شرکت در عالم اصلاً صحیح نیست، به دلیل وسعت الهی. پس دو نفر یا بیشتر هرگز در یک امر شریک نمی‌شوند. پس آنچه نزد این است، مثل آنچه نزد آن است، اما عین آنچه نزد آن است، نیست، هرچند اسم اشتراک بر آن اطلاق شود. پس می‌گوییم: آنچه اشتراک با آن رخ داده، غیر از چیزی است که امتیاز با آن رخ داده است. و در آنجا جز امتیاز خاص نیست. در آنجا اشتراکی نیست، زیرا آنچه نزد این است، عین دیگری نزد دیگری نیست. پس از این کشف، معنای اطلاق شرکت در عرف دانسته می‌شود و اینکه شرع در آن تابع عرف بوده است تا از او فهمیده شود، زیرا با زبان قوم خود آمده است و آن چیزی است که بر آن توافق کرده‌اند. و به همین دلیل مردم در مورد رسول اختلاف کرده‌اند که آیا او در آن زبان وضع لغوی دارد یا خیر؟ و در آن علم اختلاف نزول شرایع از جانب خدا با اختلاف احوال و زمان‌ها و مکان‌ها و اشخاص و حوادث است. و «خداوند حق می‌گوید و او راه را هدایت می‌کند (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)»."
  },
  "page_count": 6
}