{
  "id": 79,
  "title": {
    "ar": "الباب التاسع والسبعون في ترك الخلوة وهو المعبر عنه بالجلوة",
    "en": "Chapter Seventy-Nine: Concerning the Abandonment of Solitude (الخلوة), which is expressed by the term Public Presence (الجلوة)",
    "ur": "باب اُناسیواں: خلوت (الخلوة) کو ترک کرنے کا بیان، جسے جلوت (الجلوة) سے تعبیر کیا جاتا ہے۔",
    "fa": "باب هفتاد و نهم در ترک خلوت، و آن همان است که به جلوت تعبیر می‌شود."
  },
  "content": {
    "ar": "## (الباب التاسع والسبعون في ترك الخلوة وهو المعبر عنه بالجلوة)\n\n\n> إذا لم ير الإنسان غير إلهه *** لدى كل عين فالخلاء محال‏\n\n\n> فإن كنت هذا كنت صاحب خلوة *** ولله فيه فيصل ومقال‏\n\n\n### [الكشف يمنع الخلوة]\n\n\nاعلم أيدنا الله وإياكم أن الكشف يمنع من الخلوة وإن كان فيها فإن الحجاب لها فإذا كوشف علم أنه لم يكن في خلوة فاتخاذ الخلوة المعهودة دليل على جهل متخذها فإنه عند الكشف يعرف جهله فكل من جهل إنه جهل فهو صاحب جهلين ومن عرف أنه جهل فهو ذو جهل واحد\n\n\n### [الظاهر في أعيان العالم هو الحق وما ثم سواه‏]\n\n\nوالذين علموا إن الظاهر من كونه ظاهرا في أعيان العالم وما ثم سواه فهو في خلوة في نفسه إذا لم ينظر إلى من ظهر فيه فأورثه الملأ والجلوة فلا تصح له الخلوة من هذا الوجه فمن الناس من يرجح صاحب الخلوة ومن الناس من يرجح نقيضه وهو صاحب الجلوة\n\n\n### [الأسماء الإلهية التي تطلب الخلوة أو الجلوة]\n\n\nفالاسم الأول والباطن يطلبان الخلوة والاسم الآخر والظاهر يطلبان تركها وهي الجلوة وأنت لأي اسم غلب عليك ولا مفاضلة في الأسماء من وجه ومال الخلق إلى المقلوب من المال وهو الملأ فالخلوة دنيوية والجلوة أخروية والآخرة خير\n\n",
    "en": "If the human sees none other than his God,\nIn every locus of vision, then solitude is impossible.\nIf you are thus, you are the master of retreat,\nAnd for God therein is a decisive judgment and a word.\n\n### [Unveiling Prevents Retreat]\n\nKnow that Unveiling (الكشف) prevents retreat (الخلوة), even if one is physically in it, for the veil (الحجاب) is what necessitates the retreat. When one is unveiled, he knows that he was never in retreat. Therefore, adopting the customary retreat is proof of the ignorance (جهل) of the one who adopts it, for upon Unveiling (الكشف), he recognizes his ignorance. Whoever is ignorant that he is ignorant is the possessor of two ignorances, and whoever knows that he is ignorant is the possessor of one ignorance.\n\n### [The Manifest in the Entities of the World is The Real, and there is none other than Him]\n\nThose who know that the Manifest (الظاهر), by virtue of being manifest in the entities of the World (العالم), is The Real (الحق) and there is none other than Him—such a person is in retreat (خلوة) within himself if he does not look toward the one who manifests within him. [But looking toward the manifestation] bequeaths him the fullness (الملأ) and the public presence (الجلوة). Thus, retreat is not valid for him from this perspective. Among people are those who prefer the master of retreat, and among people are those who prefer his opposite, who is the master of public presence.\n\n### [The Divine Names that Seek Retreat or Public Presence]\n\nThe Name The First (الأول) and The Inner (الباطن) seek retreat (الخلوة). The Name The Last (الآخر) and The Outer (الظاهر) seek the abandonment of it, which is public presence (الجلوة). You belong to whichever Name dominates you, though there is no preference (مفاضلة) among the Names from one perspective. The inclination of Creation (الخلق) is toward the reversed state of affairs, which is fullness. Retreat is worldly (dunyawiyya), and public presence is related to the Hereafter (ukhrawiyya), and the Hereafter is better.",
    "ur": "(باب نمبر اناسی خلوت (الخلوۃ) کو ترک کرنے کے بیان میں، جسے جلوت (الجلوۃ) سے تعبیر کیا جاتا ہے)\n\n> اگر انسان ہر آنکھ میں اپنے معبود کے سوا کسی اور کو نہ دیکھے\n> تو خلوت (خلاء) محال ہے\n\n> پس اگر تم یہ ہو، تو تم خلوت (الخلوۃ) کے مالک ہو\n> اور اللہ کے لیے اس میں ایک فیصلہ کن بات اور قول ہے\n\n### [کشف (الکشف) خلوت (الخلوۃ) سے روکتا ہے]\n\nجان لو، اللہ ہماری اور تمہاری مدد فرمائے، کہ کشف (الکشف) خلوت (الخلوۃ) سے روکتا ہے، اگرچہ وہ اس میں موجود ہو۔ کیونکہ حجاب ہی خلوت کا سبب ہے۔ پس جب کسی پر کشف ہوتا ہے تو وہ جان لیتا ہے کہ وہ خلوت میں نہیں تھا۔ لہٰذا، معمول کی خلوت اختیار کرنا اسے اختیار کرنے والے کی جہالت کی دلیل ہے۔ کیونکہ کشف کے وقت وہ اپنی جہالت کو پہچان لیتا ہے۔ پس جو شخص یہ نہیں جانتا کہ وہ جاہل ہے، وہ دوہری جہالت کا مالک ہے، اور جو جانتا ہے کہ وہ جاہل ہے، وہ ایک جہالت والا ہے۔\n\n### [اعیان عالم (أعيان العالم) میں ظاہر ہونے والا الحق (الحق) ہے اور اس کے سوا کچھ نہیں]\n\nاور وہ لوگ جو یہ جانتے ہیں کہ اعیان عالم (أعيان العالم) میں ظاہر ہونے والا الظاہر (الظاہر) الحق (الحق) ہے اور اس کے سوا کچھ نہیں، وہ اپنے نفس میں خلوت (الخلوۃ) میں ہیں اگر وہ اس کی طرف نہ دیکھیں جس میں وہ ظاہر ہوا، کیونکہ یہ اسے ملأ (بھرپور اجتماع) اور جلوت (الجلوۃ) عطا کرتا ہے۔ لہٰذا، اس پہلو سے اس کے لیے خلوت صحیح نہیں رہتی۔ پس لوگوں میں سے کچھ ایسے ہیں جو خلوت والے کو ترجیح دیتے ہیں اور کچھ ایسے ہیں جو اس کے برعکس یعنی جلوت والے کو ترجیح دیتے ہیں۔\n\n### [وہ اسماء الٰہیہ جو خلوت (الخلوۃ) یا جلوت (الجلوۃ) کا تقاضا کرتے ہیں]\n\nپس اسم الاول (الأول) اور الباطن (الباطن) خلوت (الخلوۃ) کا تقاضا کرتے ہیں، اور اسم الآخر (الآخر) اور الظاہر (الظاہر) اسے ترک کرنے کا تقاضا کرتے ہیں، جو کہ جلوت (الجلوۃ) ہے۔ اور تم اس اسم کے تابع ہو جو تم پر غالب آئے۔ اگرچہ ایک لحاظ سے اسماء میں کوئی فضیلت نہیں ہے۔ اور مخلوق کا رجحان مال کے الٹے رخ کی طرف ہے، جو کہ ملأ (بھرپور اجتماع) ہے۔ پس خلوت (الخلوۃ) دنیوی ہے اور جلوت (الجلوۃ) اخروی ہے، اور آخرت بہتر ہے۔",
    "fa": "(باب هفتاد و نهم درباره ترک خلوت که از آن به جلوت تعبیر می‌شود)\n\nاگر انسان جز معبود خود را نبیند *** در هر چشمی، پس خلوت (خلاء) محال است.\nاگر چنین باشی، صاحب خلوتی *** و خداوند را در آن حکم و سخنی قاطع است.\n\n[کشف مانع خلوت است]\n\nبدانید، خداوند ما و شما را تأیید کند، که کشف (الکشف) مانع خلوت می‌شود، حتی اگر شخص در آن باشد؛ زیرا حجاب برای خلوت است. پس هنگامی که شخص مکاشفه (کشف) یابد، می‌داند که در خلوت نبوده است. بنابراین، اتخاذ خلوت مرسوم دلیلی بر جهل کسی است که آن را برمی‌گزیند، زیرا او هنگام کشف به جهل خود پی می‌برد. هر کس که نداند جاهل است، صاحب دو جهل است، و هر کس که بداند جاهل است، تنها یک جهل دارد.\n\n[آنچه در اعیان عالم ظاهر است، حق است و جز او چیزی نیست]\n\nو کسانی که دانسته‌اند آنچه ظاهر است، از آن جهت که در اعیان عالم ظاهر شده، حق (الحق) است و جز او چیزی نیست، اگر به کسی که در او ظاهر شده نگاه نکند، در نفس خود در خلوت است. (اما نگاه کردن به ظهور) برای او ملأ (جمع) و جلوت (الجلوة) را به ارث می‌آورد. پس خلوت از این جهت برای او صحیح نیست. برخی از مردم صاحب خلوت را ترجیح می‌دهند و برخی دیگر نقیض او، یعنی صاحب جلوت (الجلوة) را ترجیح می‌دهند.\n\n[اسماء الهی که طالب خلوت یا جلوت هستند]\n\nپس اسم «الأول» و «الباطن» طالب خلوت هستند، و اسم «الآخر» و «الظاهر» طالب ترک آن، که همان جلوت (الجلوة) است. و تو تابع هر اسمی هستی که بر تو غالب شود. از یک جهت، هیچ برتری‌ای در اسماء وجود ندارد. و میل خلق به سوی مالِ وارونه است که همان ملأ (جمع) است. پس خلوت دنيوی است و جلوت (الجلوة) اخروی، و آخرت بهتر است."
  },
  "page_count": 1
}