{
  "id": 519,
  "title": {
    "ar": "الباب التاسع عشر وخمسمائة في معرفة حال قطب كان منزله اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ لِما يُحْيِيكُمْ",
    "en": "Chapter Five Hundred and Nineteen: Concerning the knowledge of the spiritual state (حال) of a Pole (قطب) whose station (منزل) was: \"Respond to Allah and to the Messenger when He calls you to that which gives you life.\" (<<اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ لِما يُحْيِيكُمْ>>)",
    "ur": "باب پانچ سو انیس (۵۱۹) ایک قطب (قطب) کے حال کی معرفت (معرفۃ) کے بیان میں جس کا منزل (منزل) یہ تھا: \"اللہ اور رسول کی پکار پر لبیک کہو جب وہ تمہیں اس چیز کی طرف بلائیں جو تمہیں زندگی بخشتی ہے\" (اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ لِما يُحْيِيكُمْ)",
    "fa": "باب پانصد و نوزدهم در معرفت حال قطبی که منزلگاهش این آیه بود: «ای کسانی که ایمان آورده‌اید، دعوت خدا و پیامبر را اجابت کنید هنگامی که شما را به سوی چیزی می‌خواند که به شما حیات می‌بخشد» (اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ لِما يُحْيِيكُمْ)."
  },
  "content": {
    "ar": "## «الباب التاسع عشر وخمسمائة في معرفة حال قطب كان منزله اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ لِما يُحْيِيكُمْ»\n\n\n> إذا دعيت أجب فالله يدعوكا *** فإنه ما دعا إلا ويعطيكا\n\n\n> أنت الغني فجد مما أتاك به *** ما وافق الحق فالرحمن يتلوكا\n\n\n> وكل شي‏ء خلاف الحق فارم به *** في الاعتبار فإن الفكر ناديكا\n\n\n> ولا تقل ليس من ربي فتتركه *** إن العليم بوجه الأمر يأتيكا\n\n\n> فخذه وأسبره بالمسبار تعلمه *** فإنه كل ما في كونه فيكا\n\n\n> لا ترمين بشي‏ء أنت تجهله *** ولا بكل خطاب لا يؤاتيكا\n\n\n> إن الإله له مكر بطائفة *** من خلقه فتحقق في معانيكا\n\n\n> ولا تقولن هذا ليس يدخل في *** ميزان عقل فجاريه يجاريكا\n\n\n### [أن الإنسان الكامل مخلوق على الصورة]\n\n\nاعلم أيدنا الله وإياك بروح القدس أنه ما في القرآن دليل أدل على إن الإنسان الكامل مخلوق على الصورة من هذا الذكر لدخول اللام في قوله وللرسول وفي أمره تعالى لمن آية به من المؤمنين بالإجابة لدعوة الله تعالى ولدعوة الرسول فإن الله ورسوله ما يدعونا إلا لما يحيينا به فلتكن منا الإجابة على كل حال إذا دعانا فإنه ما نكون في حال إلا منه فلا بد أن نجيبه إذا دعانا فإنه الذي يقيمنا في أحوالنا وإنما فصل هنا بين دعوة الله ودعوة الرسول لنتحقق من ذلك صورة الحق التي رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عليها وهو الداعي في الحالتين إيانا فإذا دعانا بالقرآن كان مبلغا وترجمانا وكان الدعاء دعاء الله فلتكن إجابتنا لله والإسماع للرسول وإذا دعانا بغير القرآن كان الدعاء دعاء الرسول صَلَّى اللهُ عَليهِ وسَلَّم فلتكن إجابتنا للرسول صَلَّى اللهُ عَليهِ وسَلَّم ولا فرق بين الدعاءين في إجابتنا وأن تميز كل دعاء عن الآخر بتميز الداعي‏\n\n\nفإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول في الحديث لا ألفين أحدكم متكئا على أريكته يأتيه الخبر عني فيقول اتل علي به قرآنا إنه والله لمثل القرآن أو أكثر\n\n\nفقوله أو أكثر مثل ما قال أبو يزيد بطشي أشد فإن كلام الله سواء سمعناه من الله أو من الرسول هو كلام الله فإذا قال الله على لسان عبده ما يبلغه الرسول فإنه لا ينطق عن الهوى فإنه أكثر بلا شك لأنا ما سمعناه إلا من عين الكثرة وهو من الرسول أقرب مناسبة لاسماعنا للتشاكل كما هو من الله أقرب مناسبة لحقائقنا فإن الله أقرب إلينا من الرسول لا بل أقرب إلينا منا فإنه أقرب إلينا من حَبْلِ الْوَرِيدِ وغاية قرب الرسول في الظاهر المجاورة بحيث أن لا يكون بيننا مكان يكون فيه شخص ثالث فيتميز في الرسول بالمكان وبما بلغ بالمكانة ونتميز عن الله بالمكانة فإنه أقرب إلينا منا ولا أقرب إلى الشي‏ء من نفسه فهو قرب نؤمن به ولا نعرفه بل ولا نشهده إذ لو شهدناه عرفناه فإذا دعانا الله منا فلنجبه به لا بد من ذلك وإذا دعانا بالرسول منا فلنجبه بالله لا به فنحن في الدعاءين به وله وللرسول ولينظر المدعو فيما دعي به فإن وجد حياة علمية زائدة على ما عنده يحيا بها في نفس الدعاء وجبت الإجابة\nلمن دعاه الله أو دعاه الرسول فإنه ما أمر بالإجابة إلا إذا دعاه لما يحييه وما يدعوه الله ورسوله لشي‏ء إلا ما يحييه فلو لم يجد طعم الحياة الغريبة الزائدة لم يدر من دعاه وليس المطلوب لنا إلا حصول ما نحيي به ولهذا سمعنا وأطعنا فلا بد من الإحساس لهذا المدعو بهذا الأثر الذي تتعين الإجابة له به فإذا أجاب من هذه صفته حصلت له فيما يسمعه حياة أخرى يحيي بها قلب هذا السامع فإن اقتضى ما سمعه منه عملا وعمل به كانت له حياة ثالثة فانظر ما يحرم العبد إذا لم يسمع دعاء الله ولا دعاء الرسول والوجود كله كلمات الله والواردات كلها رسل من عند الله هكذا يجدها العارفون بالله فكل قائل عندهم فليس إلا الله وكل قول علم إلهي وما بقيت الصيغة إلا في صورة السماع من ذلك فإنه ثم قول امتثال شرعا وقول ابتلاء فما بقي إلا الفهم الذي به يقع التفاضل فاقتصر علماء الرسوم على كلام الله المعين المسمى فرقانا وقرآنا وعلى الرسول المعين المسمى محمدا صَلَّى اللهُ عَليهِ وسَلَّم والعارفون عمموا السمع في كل كلام فسمعوا القرآن قرآنا لا فرقانا وعمموا الرسالة فالألف واللام التي في قوله ولِلرَّسُولِ عندهم للجنس والشمول لا للعهد فكل داع في العالم فهو رسول من الله باطنا ويفترقون في الظاهر أ لا ترى إبليس وهو أبعد البعداء عن نسبة التقريب وكذلك الساحر بعده كيف شهد لهم بالرسالة وإن لم يقع التصريح فقال في السحرة وما هُمْ بِضارِّينَ به من أَحَدٍ إِلَّا بِإِذْنِ الله ولا معنى للرسالة إلا أن يكون حكمها هذا وهو إذن الله وقال في إبليس في إثبات رسالته اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزاؤُكُمْ جَزاءً مَوْفُوراً ثم عرفنا الله سبحانه ما أرسله به فقال واسْتَفْزِزْ من اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ ورَجِلِكَ وشارِكْهُمْ في الْأَمْوالِ والْأَوْلادِ وعِدْهُمْ وهذه الأحوال كلها عين ما جاءت به الكمل من الرسل عليه السلام الذين أعطوا السيف فسعد العارف بتلقي رسالة الشيطان ويعرف كيف يتلقاها ويشقى بها آخرون وهم القوم الذين ما لهم هذه المعرفة ويسعد المؤمنون كلهم والعارفون معهم بتلقي رسالة الرسل صلوات الله وسلامه عليهم ويكون العامل بما جاء في تلك الرسالة أسعد من المؤمن الذي يؤمن بها عقدا وقولا ويعصي فعلا وقولا فكل متحرك في العالم منتقل فهو رسول إلهي كان المتحرك ما كان فإنه لا تتحرك ذرة إلا بإذنه سبحانه فالعارف ينظر إلى ما جاءت به في تحركها فيستفيد بذلك علما لم يكن عنده ولكن يختلف الأخذ من العارفين من هؤلاء الرسل لاختلاف الرسل فليس أخذهم من الرسل أصحاب الدلالات سلام الله عليهم كأخذهم من الرسل الذين هم عن الأذن من حيث لا يشعرون ومن شعر منهم وعلم ما يدعو إليه كإبليس إذا قال لصاحبه اكْفُرْ فيتلقاه منه العارف تلقيا إليها فينظر إلى ما أمره الحق به من الستر فيستره ويكون هذا الرسول الشيطان المطرود عن الله منبها عن الله فيسعد هذا العارف بما يستره وهو غير مقصود الشيطان الذي أوحى إليه والذي هو غير العارف يكفر بالذي يقول له اكفر فإذا كفر يقول له الشيطان إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ فشهد الله للشيطان بالخوف من الله رب العالمين في دار التكليف وبالإيمان به فَكانَ عاقِبَتَهُما أَنَّهُما في النَّارِ خالِدَيْنِ فِيها لأنها موطنهما الواحد خلق منها وهو الشيطان والآخر خلق لها وإن كان فيه منها فسكناها بحكم الأهلية وعذبا فيها بحكم الجريمة ما شاء الله فالعالم كله عند العارف رسول من الله إليه وهو ورسالته أعني العالم في حق هذا العارف رحمة لأن الرسل ما بعثوا إلا رحمة ولو بعثوا بالبلاء لكان في طيه رحمة إلهية لأن الرحمة الإلهية وَسِعَتْ كُلَّ شَيْ‏ءٍ فما ثم شي‏ء لا يكون في هذه الرحمة إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ فلا تحجر واسعا فإنه لا يقبل التحجير\n\n\nقال بعض الأعراب يا رب ارحمني ومحمدا ولا ترحم معنا أحدا والنبي صَلَّى اللهُ عَليهِ وسَلَّم يسمعه فقال النبي صَلَّى اللهُ عَليهِ وسَلَّم يا هذا لقد حجرت واسعا\n\n\nيعني حجرته قولا وطلبة فإذا كان عند العارف مثل هذا كلام الله يأخذه في الرحمة الخاصة التي يناسب الله بها بين هذا القائل وبين محمد صَلَّى اللهُ عَليهِ وسَلَّم فشرك الرسول هذا الأعرابي في الرحمة التي يرحمه الله بها التي لا يرحم بها غيره فإن الغير ما له تلك المناسبة الخاصة فإن الرسول له مناسبة بكل واحد واحد من الأمة التي بعث إليها فآمنت به فهو مع كل مؤمن من أمته بمناسبة خاصة يعينها ذلك المؤمن فإن المتبوع في نفسه لكل تابع إياه منزلة يتميز بها عنده عن غيره وهذا القدر كاف في هذا الذكر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "Chapter Five Hundred and Nineteen: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<Respond to Allah and to the Messenger when He calls you to that which gives you life>>.\n\nIf you are called, respond, for Allah calls you,\nFor He never calls except that He gives to you.\n\nYou are the wealthy one, so be generous with what He has brought to you,\nThat which conforms to the Real (الحق), for the All-Merciful follows you.\n\nAnd everything contrary to the Real, cast it away\nIn consideration, for reflection calls you.\n\nAnd do not say, \"This is not from my Lord,\" and abandon it,\nFor the All-Knowing One comes to you with the face of the matter.\n\nSo take it and test it with the probe, and you will know it,\nFor everything in His cosmos is within you.\n\nDo not cast away anything of which you are ignorant,\nNor every discourse that does not immediately suit you.\n\nIndeed, the Godhead has a subtle plan (مكر) for a group\nOf His creation, so realize this in your meanings.\n\nAnd do not say, \"This does not enter into\nThe balance of the intellect,\" but rather, run with it, and it will run with you.\n\n### [That the Perfect Human (الإنسان الكامل) is created upon the Form]\n\nKnow, may Allah support us and you with the Holy Spirit (روح القدس), that there is no clearer proof in the Quran that the Perfect Human (الإنسان الكامل) is created upon the Form (الصورة) than this mention, due to the inclusion of the definite article *alif-lam* (اللام) in His saying, \"and to the Messenger\" (وللرسول), and in His command to those who believe in Him among the believers to respond to the call of Allah the Exalted and to the call of the Messenger. For Allah and His Messenger only call us to that by which He gives us life. Therefore, our response must be forthcoming in every state when He calls us, for we are not in any state except that it is from Him. Thus, we must respond to Him when He calls us, for He is the One who establishes us in our states.\n\nThe separation here between the call of Allah and the call of the Messenger is made so that we may realize the Form of the Real (صورة الحق) upon which the Messenger of Allah, peace and blessings be upon him, stands, and he is the Caller in both instances to us. If He calls us through the Quran, he is the conveyor and interpreter, and the call is the call of Allah; thus, our response should be to Allah, and the hearing should be for the Messenger. If he calls us with something other than the Quran, the call is the call of the Messenger, peace and blessings be upon him; thus, our response should be to the Messenger, peace and blessings be upon him. There is no difference between the two calls in terms of our response, though you distinguish each call from the other by distinguishing the Caller.\n\nFor the Messenger of Allah, peace and blessings be upon him, says in the Hadith: \"I should not find one of you reclining on his couch, when a report comes to him from me, saying: 'Recite the Quran to me with it.' By Allah, it is like the Quran, or more.\"\n\nHis saying \"or more\" is like what Abu Yazid said: \"Baths are more severe.\" For the speech of Allah, whether we hear it from Allah or from the Messenger, is the speech of Allah. If Allah speaks through the tongue of His servant what the Messenger conveys, then he does not speak out of caprice. It is undoubtedly \"more\" because we only hear it from the very source of Multiplicity (عين الكثرة), and hearing it from the Messenger is closer in suitability to our hearing due to similarity (التشاكل), just as hearing it from Allah is closer in suitability to our realities (حقائقنا). For Allah is closer to us than the Messenger—nay, He is closer to us than ourselves, for He is closer to us than the jugular vein (حَبْلِ الْوَرِيدِ). The utmost proximity of the Messenger in the manifest realm is adjacency, such that there is no space between us where a third person could be, so he is distinguished in the Messenger by place, and by what he conveys, by station (المكانة). We are distinguished from Allah by station, for He is closer to us than we are to ourselves. Nothing is closer to a thing than its own self. This is a proximity (قرب) in which we believe but which we do not know, nor do we witness (نشهد) it, for if we witnessed it, we would know it.\n\nSo, if Allah calls us from within us, we must respond to Him by Him—this is necessary. And if He calls us through the Messenger from within us, we must respond to Him by Allah, not by the Messenger. Thus, in both calls, we are responding by Him and for Him and for the Messenger.\n\nLet the one who is called look into that by which he is called. If he finds an added scientific life (حياة علمية زائدة) beyond what he already possesses, by which he is quickened in the very act of calling, then the response is obligatory for the one whom Allah calls or the Messenger calls. For He only commanded the response if He calls him to that which gives him life (يحييه). Allah and His Messenger only call him to that which gives him life. If he does not find the taste of that strange, added life, he does not know who called him. What is sought for us is nothing but the attainment of that by which we live. For this reason, we heard and obeyed. The one called must perceive this effect (الأثر) by which the response is determined for him. If one whose description is this responds, he attains another life in what he hears, by which the heart of this listener is quickened. If what he hears requires action, and he acts upon it, he gains a third life. See what the servant is deprived of if he does not hear the call of Allah nor the call of the Messenger.\n\nThe entire Existence (الوجود) is the Words of Allah, and all incoming inspirations (الواردات) are messengers (رسل) from Allah. This is how the Gnostics (العارفون بالله) find them. Every speaker, in their view, is none other than Allah, and every speech is Divine Knowledge (علم إلهي). The form (الصيغة) remains only in the image of hearing from that source. For there is speech that is compliance according to the Law (شرعا) and speech that is a trial (ابتلاء). What remains is only the understanding (الفهم) by which differentiation occurs. The scholars of external rites (علماء الرسوم) restrict themselves to the specific Speech of Allah called the Criterion (فرقانا) and the Quran, and to the specific Messenger called Muhammad, peace and blessings be upon him. But the Gnostics generalize the hearing to all speech. They hear the Quran as *Quran* (Recitation), not as *Furqan* (Criterion). They generalize the Messengership, so the *alif-lam* (ال) in His saying \"and to the Messenger\" (ولِلرَّسُولِ) is, for them, for genus and comprehensiveness (الشمول), not for specification (العهد).\n\nEvery caller in the world (العالم) is inwardly a messenger (رسول) from Allah, though they differ outwardly. Do you not see Iblis, who is the furthest of the far removed from the ratio of proximity, and likewise the sorcerer, how He testified to their messengership, even if it was not explicitly stated? Concerning the sorcerers, He said: <<But they do not harm anyone thereby except by Allah’s permission>> (وما هُمْ بِضارِّينَ به من أَحَدٍ إِلَّا بِإِذْنِ الله). And the meaning of Messengership (الرسالة) is nothing but that its ruling is this: the permission of Allah (إذن الله). And concerning Iblis, in establishing his messengership, He said: <<Go, and whoever follows you among them—indeed, Hell is your recompense, an ample recompense>> (اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزاؤُكُمْ جَزاءً مَوْفُوراً). Then Allah, the Glorified, informed us of what He sent him with, saying: <<And incite whoever you can among them with your voice and assault them with your cavalry and infantry and share with them in wealth and children and promise them>> (واسْتَفْزِزْ من اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ ورَجِلِكَ وشارِكْهُمْ في الْأَمْوالِ والْأَوْلادِ وعِدْهُمْ). All these states are precisely what the Perfect Messengers (الكمل من الرسل) came with, peace be upon them, those who were given the sword.\n\nThe Gnostic (العارف) is made happy by receiving the message of Satan and knows how to receive it, while others are made wretched by it—these are the people who lack this Gnosis (المعرفة). All believers, and the Gnostics along with them, are made happy by receiving the message of the Messengers, peace and blessings of Allah be upon them. The one who acts upon what came in that message is happier than the believer who merely believes in it by conviction and word, but disobeys by deed and word.\n\nEvery moving entity in the world (العالم) that transitions is a Divine Messenger (رسول إلهي), whatever that moving entity may be, for not a single atom moves except by His permission, the Glorified. The Gnostic looks at what it brings in its movement and thereby gains knowledge (علما) he did not possess. However, the reception by the Gnostics from these messengers differs due to the difference in the messengers. Their reception from the Messengers who possess clear proofs (أصحاب الدلالات), peace be upon them, is not the same as their reception from the messengers who act by permission (الأذن) without realizing it. And among those who realize it and know what they call to, like Iblis when he says to his companion, \"Disbelieve\" (اكْفُرْ). The Gnostic receives this as a Divine reception (تلقيا إلهيا) and looks at what the Real (الحق) commanded him to do regarding concealment (الستر), so he conceals it. This messenger, the Satan expelled from Allah, is thus an announcer from Allah, and this Gnostic is made happy by what he conceals, which was not the intention of the Satan who inspired him. The one who is not the Gnostic disbelieves when Satan tells him to disbelieve. When he disbelieves, Satan says to him: <<Indeed, I am disassociated from you; indeed, I fear Allah, Lord of the worlds>> (إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ). Allah thus testified that Satan fears Allah, Lord of the worlds, in the Abode of Responsibility (دار التكليف), and believes in Him. <<So the outcome for both of them is that they will be in the Fire, abiding eternally therein>> (فَكانَ عاقِبَتَهُما أَنَّهُما في النَّارِ خالِدَيْنِ فِيها), because it is their dwelling place: one was created from it (Satan), and the other was created for it (the disbeliever), even if he has something of it within him. They dwell there by the ruling of suitability (الأهلية) and are punished therein by the ruling of the crime, as long as Allah wills.\n\nThe entire world (العالم) is, in the view of the Gnostic, a messenger from Allah to him, and he—meaning the world—and his message are a mercy (رحمة) in relation to this Gnostic, because the Messengers were only sent as a mercy. Even if they were sent with affliction (البلاء), there would be Divine Mercy (رحمة إلهية) folded within it, because the Divine Mercy <<encompasses all things>> (وَسِعَتْ كُلَّ شَيْ‏ءٍ). Thus, there is nothing that is not within this Mercy. <<Indeed, your Lord is vast in forgiveness>> (إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ). So, do not restrict what is vast, for it does not accept restriction.\n\nOne of the Bedouins said: \"O Lord, have mercy on me and Muhammad, and do not have mercy on anyone else with us.\" The Prophet, peace and blessings be upon him, heard him, and the Prophet, peace and blessings be upon him, said: \"O man, you have restricted what is vast.\"\n\nMeaning, he restricted it in word and request. If the Gnostic possesses such a thing, he takes this speech of Allah concerning the specific mercy (الرحمة الخاصة) by which Allah establishes suitability (المناسبة) between this speaker and Muhammad, peace and blessings be upon him. The Messenger thus shared with this Bedouin the mercy with which Allah had mercy upon him, and with which He did not have mercy upon anyone else, because the other person did not possess that specific suitability. For the Followed One (المتبوع) has a station in himself for every follower that distinguishes him from others. This much suffices concerning this mention. And Allah speaks the Truth, and He guides to the Way (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ).",
    "ur": "## باب نمبر پانچ سو انیس: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ لِما يُحْيِيكُمْ\" (اللہ اور رسول کی پکار پر لبیک کہو جب وہ تمہیں اس چیز کی طرف بلائیں جو تمہیں زندگی بخشتی ہے)\n\nجب تمہیں بلایا جائے تو جواب دو، کیونکہ اللہ تمہیں پکارتا ہے،\nاور وہ جب بھی پکارتا ہے تو تمہیں عطا کرتا ہے۔\n\nتم غنی ہو، پس اس میں سے سخاوت کرو جو تمہیں عطا ہوا ہے،\nجو حق کے موافق ہو، کیونکہ رحمن تمہاری پیروی کرتا ہے۔\n\nاور ہر وہ شے جو حق کے خلاف ہو، اسے پھینک دو،\nغور و فکر میں، کیونکہ تمہاری فکر تمہیں پکار رہی ہے۔\n\nاور یہ نہ کہو کہ یہ میرے رب کی طرف سے نہیں ہے، پس تم اسے چھوڑ دو،\nیقیناً وہ علیم (جاننے والا) امر کے چہرے کے ساتھ تمہارے پاس آتا ہے۔\n\nپس اسے لو اور مسبار (آلہ پیمائش) سے اس کی گہرائی جانچو، تم اسے جان لو گے،\nکیونکہ اس کی کائنات میں جو کچھ بھی ہے، وہ سب تمہارے اندر ہے۔\n\nکسی ایسی شے کو مت پھینکو جسے تم نہیں جانتے،\nاور نہ ہی ہر اس خطاب کو جو تمہارے موافق نہ ہو۔\n\nیقیناً ذات حق (الحق) اپنی مخلوق کے ایک گروہ کے ساتھ مکر (تدبیر) کرتا ہے،\nپس تم اپنے معانی (باطنی حقائق) میں تحقیق کرو۔\n\nاور یہ مت کہو کہ یہ میرے عقل کے میزان میں داخل نہیں ہو سکتا،\nپس اس کے ساتھ چلو، وہ تمہارے ساتھ چلے گا۔\n\n### [انسان کامل کا صورت پر مخلوق ہونا]\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس (روح القدس) سے تائید بخشے، کہ قرآن میں اس ذکر سے زیادہ کوئی دلیل نہیں جو اس بات پر دلالت کرے کہ انسان کامل (الإنسان الکامل) صورت پر مخلوق ہے، کیونکہ اس میں \"وَلِلرَّسُولِ\" (اور رسول کے لیے) میں لام داخل ہے، اور اس میں اللہ تعالیٰ کا حکم ہے ان لوگوں کے لیے جو اس پر ایمان لائے ہیں کہ وہ اللہ تعالیٰ کی دعوت اور رسول کی دعوت پر لبیک کہیں، کیونکہ اللہ اور اس کا رسول ہمیں صرف اسی چیز کی طرف بلاتے ہیں جس سے وہ ہمیں زندگی بخشتے ہیں۔ پس ہماری طرف سے ہر حال میں اجابت (لبیک کہنا) ہونی چاہیے جب وہ ہمیں بلائیں، کیونکہ ہم جس حال میں بھی ہوتے ہیں وہ اسی کی طرف سے ہوتا ہے، لہٰذا جب وہ ہمیں بلائے تو ہمیں ضرور جواب دینا چاہیے، کیونکہ وہی ہے جو ہمیں ہمارے احوال میں قائم رکھتا ہے۔\n\nیہاں اللہ کی دعوت اور رسول کی دعوت کے درمیان تفریق اس لیے کی گئی ہے تاکہ ہم حق کی اس صورت کو پہچان لیں جس پر رسول اللہ صلی اللہ علیہ وسلم ہیں، اور وہ دونوں حالتوں میں ہمیں بلانے والے ہیں۔ پس جب وہ ہمیں قرآن کے ذریعے بلاتے ہیں تو وہ مبلغ اور ترجمان ہوتے ہیں، اور وہ دعوت اللہ کی دعوت ہوتی ہے، لہٰذا ہماری اجابت اللہ کے لیے ہونی چاہیے اور سننا رسول کے لیے۔ اور جب وہ ہمیں قرآن کے علاوہ کسی اور چیز کے ذریعے بلاتے ہیں تو وہ دعوت رسول اللہ صلی اللہ علیہ وسلم کی دعوت ہوتی ہے، لہٰذا ہماری اجابت رسول اللہ صلی اللہ علیہ وسلم کے لیے ہونی چاہیے۔ اور ہماری اجابت میں دونوں دعوتوں کے درمیان کوئی فرق نہیں ہے، سوائے اس کے کہ ہر دعوت کو داعی کے امتیاز سے ممتاز کیا جائے۔\n\nکیونکہ رسول اللہ صلی اللہ علیہ وسلم حدیث میں فرماتے ہیں: \"میں تم میں سے کسی کو اس حال میں نہ پاؤں کہ وہ اپنی مسند پر ٹیک لگائے بیٹھا ہو، اس کے پاس میری طرف سے کوئی خبر آئے تو وہ کہے کہ مجھ پر اس کے متعلق قرآن پڑھو۔ اللہ کی قسم! وہ (حدیث) قرآن کی مانند ہے یا اس سے زیادہ ہے۔\"\n\nآپ صلی اللہ علیہ وسلم کا قول \"یا اس سے زیادہ\" اسی طرح ہے جیسے ابو یزید بسطامی نے کہا: \"زیادہ شدید۔\" کیونکہ اللہ کا کلام، خواہ ہم اسے اللہ سے سنیں یا رسول سے، وہ اللہ کا کلام ہے۔ پس جب اللہ اپنے بندے کی زبان پر وہ بات کہتا ہے جو رسول پہنچاتے ہیں، تو وہ اپنی خواہش سے نہیں بولتے، تو یہ بلا شک و شبہ زیادہ ہے، کیونکہ ہم نے اسے کثرت (کثرۃ) کی عین سے سنا ہے، اور یہ رسول کی طرف سے ہمارے سننے کے لیے زیادہ مناسب ہے مماثلت کی وجہ سے، جیسا کہ یہ اللہ کی طرف سے ہماری حقیقتوں (حقائق) کے لیے زیادہ مناسب ہے۔ کیونکہ اللہ رسول سے زیادہ ہمارے قریب ہے، بلکہ وہ ہم سے بھی زیادہ ہمارے قریب ہے۔ کیونکہ وہ ہماری شَہ رَگ (حَبْلِ الْوَرِيدِ) سے بھی زیادہ قریب ہے۔ اور رسول کے قرب کی انتہا ظاہر میں مجاورت ہے، اس طرح کہ ہمارے درمیان کوئی ایسی جگہ نہ ہو جہاں کوئی تیسرا شخص ہو، پس رسول میں جگہ کے لحاظ سے اور جو کچھ انہوں نے پہنچایا اس کے لحاظ سے امتیاز ہوتا ہے، اور ہم اللہ سے مقام (مکَانَۃ) کے لحاظ سے ممتاز ہوتے ہیں، کیونکہ وہ ہم سے زیادہ قریب ہے، اور کوئی شے اپنی ذات سے زیادہ قریب نہیں ہوتی۔ پس یہ ایسا قرب ہے جس پر ہم ایمان لاتے ہیں، لیکن ہم اسے نہیں جانتے، بلکہ ہم اس کا شہود (الشہود) بھی نہیں کرتے، کیونکہ اگر ہم اس کا شہود کرتے تو اسے جان لیتے۔\n\nپس جب اللہ ہمیں ہم میں سے بلائے تو ہمیں اس کے ذریعے ہی جواب دینا چاہیے، یہ ضروری ہے۔ اور جب وہ ہمیں ہم میں سے رسول کے ذریعے بلائے تو ہمیں اللہ کے ذریعے جواب دینا چاہیے نہ کہ اس کے ذریعے۔ پس ہم دونوں دعوتوں میں اس کے ذریعے اور اس کے لیے اور رسول کے لیے ہیں۔ اور مدعو کو اس چیز پر غور کرنا چاہیے جس کے ذریعے اسے بلایا گیا ہے۔ پس اگر وہ اپنے پاس موجود علم سے زیادہ علمی زندگی (حیات علمیہ) پائے جس سے وہ خود دعوت میں زندہ ہو جائے، تو اس شخص کے لیے اجابت واجب ہو جاتی ہے جسے اللہ نے بلایا ہو یا رسول نے بلایا ہو، کیونکہ اجابت کا حکم صرف اسی صورت میں دیا گیا ہے جب وہ اسے اس چیز کی طرف بلائے جو اسے زندگی بخشتی ہے، اور اللہ اور اس کا رسول اسے کسی چیز کی طرف نہیں بلاتے مگر جو اسے زندگی بخشے۔ پس اگر اسے اس اضافی اور اجنبی زندگی کا ذائقہ نہ ملے تو وہ نہیں جانتا کہ اسے کس نے بلایا ہے۔ اور ہمارا مطلوب صرف اس چیز کا حصول ہے جس سے ہم زندہ ہوں، اور اسی لیے ہم نے سنا اور اطاعت کی۔ پس اس مدعو کے لیے ضروری ہے کہ وہ اس اثر کو محسوس کرے جس کے ذریعے اجابت متعین ہوتی ہے۔ پس جب اس صفت کا حامل شخص جواب دیتا ہے، تو اسے اس چیز میں جو وہ سنتا ہے ایک اور زندگی حاصل ہوتی ہے جس سے اس سننے والے کا دل زندہ ہو جاتا ہے۔ پھر اگر جو کچھ اس نے سنا وہ عمل کا تقاضا کرے اور اس نے اس پر عمل کیا تو اسے تیسری زندگی حاصل ہو گی۔\n\nپس دیکھو کہ بندہ کس چیز سے محروم ہوتا ہے جب وہ نہ اللہ کی دعوت سنتا ہے اور نہ رسول کی دعوت۔ اور پورا وجود (الوجود) اللہ کے کلمات ہیں، اور تمام واردات اللہ کی طرف سے رسول ہیں، عارفین باللہ (المعرفۃ) انہیں اسی طرح پاتے ہیں۔ پس ان کے نزدیک ہر کہنے والا صرف اللہ ہے، اور ہر قول علم الٰہی ہے۔ اور صیغہ صرف سننے کی صورت میں باقی رہا، کیونکہ وہاں شرعی طور پر امتثال (پیروی) کا قول ہے اور ابتلاء (آزمائش) کا قول ہے۔ پس صرف وہ فہم باقی رہا جس سے تفاضل (برتری) واقع ہوتی ہے۔ پس علماء رسوم (ظاہری علوم کے علماء) نے صرف مخصوص کلام اللہ پر اکتفا کیا جسے فرقان اور قرآن کہا جاتا ہے، اور مخصوص رسول پر جسے محمد صلی اللہ علیہ وسلم کہا جاتا ہے۔ اور عارفین (العارفون) نے ہر کلام میں سننے کو عام کر دیا، پس انہوں نے قرآن کو قرآن سنا نہ کہ فرقان۔ اور انہوں نے رسالت کو عام کر دیا، پس \"وَلِلرَّسُولِ\" میں جو الف لام ہے وہ ان کے نزدیک جنس اور شمول کے لیے ہے نہ کہ عہد کے لیے۔ پس دنیا میں ہر بلانے والا باطن میں اللہ کی طرف سے رسول ہے، اور وہ ظاہر میں مختلف ہوتے ہیں۔ کیا تم نہیں دیکھتے کہ ابلیس، جو تقریب کی نسبت سے سب سے زیادہ دور ہے، اور اسی طرح ساحر، اس کے بعد، اللہ نے ان کے لیے رسالت کی گواہی دی، اگرچہ صریح طور پر بیان نہیں کیا؟ پس ساحروں کے بارے میں فرمایا: \"وَمَا هُمْ بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّهِ\" (اور وہ اس کے ذریعے کسی کو نقصان پہنچانے والے نہیں ہیں مگر اللہ کے حکم سے)۔ اور رسالت کا کوئی معنی نہیں مگر یہ کہ اس کا حکم یہی ہو، یعنی اللہ کا اذن۔ اور ابلیس کے بارے میں اس کی رسالت کے اثبات میں فرمایا: \"اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزَاؤُكُمْ جَزَاءً مَوْفُورًا\" (جا، پس ان میں سے جو تیری پیروی کرے گا، تو یقیناً جہنم تمہارا بدلہ ہے، پورا پورا بدلہ)۔ پھر اللہ سبحانہ نے ہمیں بتایا کہ اس نے اسے کس چیز کے ساتھ بھیجا: \"وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِي الْأَمْوَالِ وَالْأَوْلَادِ وَعِدْهُمْ\" (اور ان میں سے جسے تو بہکا سکتا ہے، اپنی آواز سے بہکا، اور ان پر اپنے سواروں اور پیادوں کے ساتھ چڑھائی کر، اور ان کے مالوں اور اولاد میں شریک ہو جا، اور انہیں وعدے دے)۔ اور یہ تمام احوال عین وہی ہیں جو کامل رسول لے کر آئے جنہیں تلوار دی گئی تھی۔\n\nپس عارف شیطان کی رسالت کو قبول کر کے خوش ہوتا ہے، اور وہ جانتا ہے کہ اسے کیسے قبول کرنا ہے، اور دوسرے لوگ اس سے بدبخت ہوتے ہیں، اور وہ وہ لوگ ہیں جنہیں یہ معرفت (المعرفۃ) حاصل نہیں ہے۔ اور تمام مومن اور ان کے ساتھ عارفین رسولوں کی رسالت کو قبول کر کے خوش ہوتے ہیں، اللہ کا درود و سلام ہو ان پر۔ اور جو شخص اس رسالت میں آئی ہوئی باتوں پر عمل کرتا ہے وہ اس مومن سے زیادہ خوش ہوتا ہے جو صرف عقد اور قول سے اس پر ایمان لاتا ہے اور فعل اور قول سے نافرمانی کرتا ہے۔\n\nپس دنیا میں ہر متحرک اور منتقل ہونے والی شے اللہ کی طرف سے رسول ہے، خواہ وہ متحرک کوئی بھی ہو۔ کیونکہ کوئی ذرہ بھی اس کے اذن (اجازت) کے بغیر حرکت نہیں کرتا۔ پس عارف اس چیز کو دیکھتا ہے جو وہ اپنی حرکت میں لے کر آئی ہے، اور اس سے ایسا علم حاصل کرتا ہے جو اس کے پاس نہیں تھا۔ لیکن عارفین کا ان رسولوں سے اخذ (حاصل کرنا) رسولوں کے اختلاف کی وجہ سے مختلف ہوتا ہے۔ پس ان کا اخذ ان رسولوں سے جو دلالتوں والے ہیں، سلام ہو ان پر، ان رسولوں سے اخذ کرنے جیسا نہیں ہے جو اذن سے ہیں اس طرح کہ وہ شعور نہیں رکھتے۔ اور جس نے شعور حاصل کیا اور جان لیا کہ وہ کس چیز کی طرف بلا رہا ہے، جیسے ابلیس جب اپنے ساتھی سے کہتا ہے: \"اکْفُرْ\" (کفر کر)، تو عارف اسے الٰہی طور پر قبول کرتا ہے، پس وہ اس ستر (پوشیدگی) کو دیکھتا ہے جس کا حق نے اسے حکم دیا ہے، پس وہ اسے چھپا لیتا ہے۔ اور یہ رسول، یعنی اللہ سے دور کیا گیا شیطان، اللہ کی طرف سے متنبہ کرنے والا ہوتا ہے، پس یہ عارف اس چیز سے خوش ہوتا ہے جسے وہ چھپاتا ہے، اور یہ شیطان کا مقصود نہیں ہوتا جس نے اسے وحی کی، اور جو شخص عارف نہیں ہوتا وہ اس بات سے کفر کرتا ہے جو وہ کہتا ہے کہ کفر کر۔ پس جب وہ کفر کرتا ہے تو شیطان اس سے کہتا ہے: \"إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ\" (میں تجھ سے بری ہوں، میں اللہ سے ڈرتا ہوں جو تمام جہانوں کا رب ہے)۔ پس اللہ نے شیطان کے لیے دارِ تکلیف (دنیا) میں اللہ رب العالمین سے خوف اور اس پر ایمان کی گواہی دی۔ \"فَكَانَ عَاقِبَتَهُما أَنَّهُما فِي النَّارِ خَالِدَيْنِ فِيهَا\" (پس ان دونوں کا انجام یہ ہوا کہ وہ دونوں ہمیشہ کے لیے آگ میں رہیں گے)۔ کیونکہ وہ ان دونوں کا وطن ہے، ایک اس سے پیدا کیا گیا، اور وہ شیطان ہے، اور دوسرا اس کے لیے پیدا کیا گیا، اگرچہ اس میں سے کچھ اس میں بھی ہے۔ پس ان کا اس میں رہنا اہلیت کے حکم سے ہے، اور اس میں عذاب پانا جرم کے حکم سے ہے، جب تک اللہ چاہے۔\n\nپس عارف کے نزدیک پوری دنیا اللہ کی طرف سے اس کے لیے رسول ہے، اور وہ اور اس کی رسالت، یعنی دنیا، اس عارف کے حق میں رحمت ہے، کیونکہ رسول صرف رحمت کے طور پر بھیجے گئے ہیں، اور اگر وہ بلا (آزمائش) کے ساتھ بھیجے جاتے تو اس کی تہہ میں الٰہی رحمت ہوتی، کیونکہ الٰہی رحمت \"وَسِعَتْ كُلَّ شَيْءٍ\" (ہر چیز پر چھا گئی ہے)۔ پس کوئی ایسی شے نہیں جو اس رحمت میں نہ ہو۔ \"إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ\" (یقیناً تیرا رب وسیع مغفرت والا ہے)۔ پس تم وسیع کو محدود نہ کرو، کیونکہ وہ محدودیت کو قبول نہیں کرتا۔\n\nایک اعرابی نے کہا: \"یا رب! مجھ پر اور محمد پر رحم فرما، اور ہمارے ساتھ کسی اور پر رحم نہ فرما۔\" اور نبی صلی اللہ علیہ وسلم اسے سن رہے تھے۔ تو نبی صلی اللہ علیہ وسلم نے فرمایا: \"اے شخص! تو نے ایک وسیع چیز کو محدود کر دیا۔\"\n\nیعنی تو نے اسے قول اور طلب کے لحاظ سے محدود کر دیا۔ پس جب عارف کے پاس اللہ کا ایسا کلام ہو تو وہ اسے اس خاص رحمت میں لیتا ہے جس سے اللہ اس کہنے والے اور محمد صلی اللہ علیہ وسلم کے درمیان مناسبت پیدا کرتا ہے۔ پس رسول نے اس اعرابی کو اس رحمت میں شریک کیا جس سے اللہ اس پر رحم کرتا ہے، اور جس سے وہ کسی اور پر رحم نہیں کرتا، کیونکہ دوسرے کے لیے وہ خاص مناسبت نہیں ہے۔ کیونکہ رسول کو اس امت کے ہر ایک فرد کے ساتھ ایک مناسبت حاصل ہے جس کی طرف وہ بھیجے گئے اور جس نے ان پر ایمان لایا۔ پس وہ اپنی امت کے ہر مومن کے ساتھ ایک خاص مناسبت رکھتے ہیں جسے وہ مومن متعین کرتا ہے۔ کیونکہ متبوع (پیروی کیے جانے والے) کے دل میں ہر اس شخص کے لیے جو اس کی پیروی کرتا ہے ایک ایسا مقام ہوتا ہے جس سے وہ اس کے نزدیک دوسروں سے ممتاز ہوتا ہے۔ اور یہ مقدار اس ذکر کے لیے کافی ہے۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب پانصد و نوزدهم در معرفت حال قطبی که منزل او این آیه بود: «خدا و پیامبر را اجابت کنید هنگامی که شما را به سوی چیزی می‌خوانند که به شما حیات می‌بخشد.» (اسْتَجِيبُوا لِلَّهِ ولِلرَّسُولِ إِذا دَعاكُمْ لِما يُحْيِيكُمْ)\n\nاگر خوانده شدی، اجابت کن، زیرا خداوند تو را می‌خواند؛\nاو نخواند مگر آنکه به تو عطا کند.\n\nتو بی‌نیازی، پس از آنچه به تو رسیده است، بخشش کن؛\nآنچه موافق حق (الحق) است، زیرا رحمان تو را دنبال می‌کند.\n\nو هر چیزی که خلاف حق (الحق) است، آن را در نظر (اعتبار) دور انداز،\nزیرا اندیشه تو را فرا می‌خواند.\n\nو مگو که این از پروردگارم نیست تا آن را ترک کنی؛\nزیرا دانای به وجه امر (حقیقت امر) به سوی تو می‌آید.\n\nپس آن را بگیر و با مسبار (ابزار سنجش) بسنج تا آن را بشناسی؛\nزیرا هر آنچه در هستی (کون) اوست، در توست.\n\nچیزی را که نمی‌شناسی دور مینداز،\nو نه هر خطابی را که با تو سازگار نیست.\n\nهمانا خداوند برای گروهی از خلقش مکر (تدبیر) دارد؛\nپس در معانی خود تحقیق کن.\n\nو مگو که این در ترازوی عقل نمی‌گنجد؛\nپس با آن همراه شو تا با تو همراهی کند.\n\n### [اینکه انسان کامل بر صورت [الهی] آفریده شده است]\n\nبدان، خداوند ما و تو را به روح القدس تأیید کند، که در قرآن دلیلی روشن‌تر بر اینکه انسان کامل (الإنسان الکامل) بر صورت [الهی] آفریده شده است، از این ذکر (آیه) وجود ندارد؛ به دلیل ورود لام در قولش: «وَلِلرَّسُولِ» و در امر خداوند متعال به مؤمنانی که به او ایمان آورده‌اند، مبنی بر اجابت دعوت خداوند متعال و دعوت رسول. زیرا خداوند و رسولش ما را نمی‌خوانند مگر به سوی آنچه ما را بدان زنده می‌سازد. پس باید اجابت ما در هر حالی که ما را می‌خوانند، صورت پذیرد؛ زیرا ما در هیچ حالی نیستیم مگر آنکه از اوست. پس ناگزیر باید او را اجابت کنیم هنگامی که ما را می‌خواند، زیرا اوست که ما را در احوالمان برپا می‌دارد.\n\nو همانا در اینجا میان دعوت خدا و دعوت رسول جدایی افکنده شده است تا ما صورت حق (الحق) را که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بر آن است، محقق سازیم. او در هر دو حالت ما را دعوت می‌کند. پس اگر ما را به قرآن بخواند، او ابلاغ‌کننده و مترجم است و آن دعوت، دعوت خداست. پس باید اجابت ما برای خدا باشد و شنیدن (الإسماع) برای رسول. و اگر ما را به غیر قرآن بخواند، آن دعوت، دعوت رسول (صَلَّى اللهُ عَليهِ وسَلَّم) است. پس باید اجابت ما برای رسول (صَلَّى اللهُ عَليهِ وسَلَّم) باشد. و در اجابت ما فرقی میان این دو دعوت نیست، هرچند هر دعوتی به تمایز دعوت‌کننده از دیگری متمایز می‌شود.\n\nزیرا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در حدیث می‌فرماید: «مبادا یکی از شما را بیابم که بر تخت خود تکیه داده باشد و خبری از من به او برسد، پس بگوید: آن را به صورت قرآن بر من بخوان. به خدا سوگند، آن [حدیث] مانند قرآن یا بیشتر است.»\n\nپس قول او «یا بیشتر» مانند آن است که ابویزید گفته است: «بطشی شدیدتر است.» زیرا کلام خدا، چه آن را از خدا بشنویم و چه از رسول، کلام خداست. پس هنگامی که خداوند بر زبان بنده‌اش چیزی را می‌گوید که رسول ابلاغ می‌کند، او از روی هوی سخن نمی‌گوید. پس بی‌شک آن [کلام] بیشتر است، زیرا ما آن را نشنیده‌ایم مگر از عین کثرت. و آن [کلام] از جانب رسول به دلیل تشاکل (هم‌شکلی) مناسبت بیشتری برای شنیدن ما دارد، همان‌گونه که از جانب خدا مناسبت بیشتری برای حقایق ما دارد. زیرا خداوند به ما از رسول نزدیک‌تر است، بلکه از خود ما به ما نزدیک‌تر است، چرا که او از رگ گردن (حَبْلِ الْوَرِيدِ) به ما نزدیک‌تر است. و نهایت قرب رسول در ظاهر، همجواری است، به طوری که مکانی میان ما نباشد که شخص سومی در آن قرار گیرد. پس رسول به واسطه مکان و به واسطه آنچه ابلاغ کرده، به واسطه مکانت متمایز می‌شود، و ما از خدا به واسطه مکانت متمایز می‌شویم، زیرا او از خود ما به ما نزدیک‌تر است و هیچ چیز به شیء نزدیک‌تر از خود آن شیء نیست.\n\nپس این قربی است که به آن ایمان داریم و آن را نمی‌شناسیم، بلکه آن را شهود (الشهود) هم نمی‌کنیم، زیرا اگر آن را شهود می‌کردیم، می‌شناختیم. پس اگر خداوند ما را از خودمان بخواند، باید او را به واسطه خودش اجابت کنیم، این ضروری است. و اگر ما را به واسطه رسول از خودمان بخواند، باید او را به واسطه خدا اجابت کنیم نه به واسطه رسول. پس ما در هر دو دعوت، به واسطه او و برای او و برای رسول هستیم. و باید دعوت‌شده بنگرد که به چه چیزی دعوت شده است. اگر حیات علمی فزون‌تری بیابد که بر آنچه نزد اوست افزوده شود و به واسطه آن در نفس دعوت زنده گردد، اجابت بر کسی که خدا یا رسول او را خوانده، واجب است. زیرا امر به اجابت نشده است مگر هنگامی که او را به سوی آنچه زنده می‌سازد، بخواند. و خداوند و رسولش او را به چیزی نمی‌خوانند مگر آنچه او را زنده می‌سازد. پس اگر طعم حیات غریب و فزون‌تر را نیابد، نمی‌داند چه کسی او را خوانده است. و مطلوب ما جز به دست آوردن آنچه بدان زنده می‌شویم، نیست. و به همین دلیل شنیدیم و اطاعت کردیم. پس برای این دعوت‌شده، احساس این اثر که اجابت به واسطه آن تعیین می‌شود، ضروری است. پس اگر کسی که صفتش این است اجابت کند، در آنچه می‌شنود حیات دیگری برای او حاصل می‌شود که قلب این شنونده به واسطه آن زنده می‌گردد. و اگر آنچه شنیده مستلزم عملی باشد و به آن عمل کند، حیات سومی برای او خواهد بود. پس بنگر که بنده اگر دعوت خدا و دعوت رسول را نشنود، از چه چیزی محروم می‌شود.\n\nو هستی (الوجود) تماماً کلمات خداست، و واردات (الهامات) همگی رسولانی از جانب خدا هستند. عارفان بالله (المعرفة) این‌گونه آن را می‌یابند. پس هر گوینده‌ای نزد آنان جز خدا نیست، و هر قولی علم الهی است. و صورت (صيغة) باقی نمانده است مگر در قالب شنیدن از آن [علم]. زیرا در آنجا قول امتثال شرعی و قول ابتلا وجود دارد. پس باقی نمانده است مگر فهمی که به واسطه آن برتری (تفاضل) رخ می‌دهد. پس علمای رسوم (ظاهر) به کلام معین خدا که فرقان و قرآن نامیده می‌شود، و به رسول معین که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نامیده می‌شود، اکتفا کردند. و عارفان (العارفون) شنیدن را در هر کلامی تعمیم دادند، پس قرآن را به عنوان قرآن شنیدند نه فرقان. و رسالت را تعمیم دادند. پس الف و لامی که در قول او «وَلِلرَّسُولِ» آمده است، نزد آنان برای جنس و شمول است نه برای عهد (اشاره به فرد خاص). پس هر دعوت‌کننده‌ای در عالم، باطناً رسولی از جانب خداست، هرچند در ظاهر متفاوتند.\n\nآیا نمی‌بینی ابلیس را که دورترینِ دورشدگان از نسبت تقریب است، و همچنین ساحر را پس از او، چگونه برایشان به رسالت شهادت داده شده، هرچند تصریحی واقع نشده است؟ پس درباره ساحران فرمود: «و آنان با آن [سحر] به هیچ کس زیان نمی‌رسانند مگر به اذن خدا.» (وَمَا هُمْ بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّهِ) و معنای رسالت جز این حکم نیست که همان اذن خداست. و درباره ابلیس در اثبات رسالتش فرمود: «برو، پس هر کس از آنان که تو را پیروی کند، جزای شما جهنم است، جزایی کامل.» (اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزَاؤُكُمْ جَزَاءً مَوْفُورًا) سپس خداوند سبحان ما را به آنچه ابلیس را بدان فرستاده، آگاه ساخت و فرمود: «و هر کس از آنان را که توانستی، با صدای خود تحریک کن، و با سواره و پیاده‌ات بر آنان بتاز، و در اموال و اولادشان شریک شو، و به آنان وعده بده.» (وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِي الْأَمْوَالِ وَالْأَوْلَادِ وَعِدْهُمْ) و این احوال همگی عین همان چیزی است که رسولان کامل (الرسل الکمل) که شمشیر به آنان داده شد، آورده‌اند.\n\nپس عارف (العارف) با دریافت رسالت شیطان سعادتمند می‌شود و می‌داند چگونه آن را دریافت کند، و دیگران که این معرفت (المعرفة) را ندارند، به واسطه آن شقاوتمند می‌شوند. و همه مؤمنان و عارفان همراه آنان، با دریافت رسالت رسولان (صلوات الله و سلامه علیهم) سعادتمند می‌شوند. و کسی که به آنچه در آن رسالت آمده عمل می‌کند، سعادتمندتر از مؤمنی است که به آن با عقد و قول ایمان می‌آورد، اما با فعل و قول نافرمانی می‌کند. پس هر متحرک منتقل‌شونده‌ای در عالم، رسولی الهی است، هرچه که آن متحرک باشد؛ زیرا هیچ ذره‌ای حرکت نمی‌کند مگر به اذن او سبحانه. پس عارف به آنچه آن [ذره] در حرکتش آورده است می‌نگرد و از آن علمی را که نزدش نبوده، کسب می‌کند. اما دریافت عارفان از این رسولان به دلیل اختلاف رسولان، متفاوت است. پس دریافت آنان از رسولانی که صاحبان دلالات هستند (سلام الله علیهم)، مانند دریافتشان از رسولانی نیست که از روی اذن [الهی] هستند در حالی که خود نمی‌دانند. و کسی که از آنان آگاه شود و بداند به چه چیزی دعوت می‌کند، مانند ابلیس که به همراهش می‌گوید: «کافر شو» (اكْفُرْ)، عارف آن را به عنوان دریافتی الهی تلقی می‌کند و به آنچه حق (الحق) او را به پوشاندن آن امر کرده است می‌نگرد و آن را می‌پوشاند.\n\nو این رسول، یعنی شیطان رانده شده از خدا، آگاه‌کننده‌ای از جانب خداست. پس این عارف به واسطه آنچه می‌پوشاند سعادتمند می‌شود، در حالی که این مقصود شیطانی که به او وحی شده، نیست. و کسی که عارف نیست، به آنچه شیطان به او می‌گوید «کافر شو»، کفر می‌ورزد. و هنگامی که کافر شد، شیطان به او می‌گوید: «من از تو بیزارم، من از خدا، پروردگار جهانیان، می‌ترسم.» (إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ) پس خداوند برای شیطان به ترس از خدا، پروردگار جهانیان، در دار تکلیف و به ایمان به او شهادت داد. «پس سرانجام آن دو این شد که هر دو در آتش جاودانه‌اند.» (فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا) زیرا آن [آتش] موطن آن دو است؛ یکی از آن خلق شده و او شیطان است، و دیگری برای آن خلق شده، هرچند چیزی از آن در او هست. پس سکونتشان به حکم اهلیت و عذابشان به حکم جرم است، تا هر زمان که خدا بخواهد.\n\nپس تمام عالم نزد عارف (العارف) رسولی از جانب خدا به سوی اوست. و او و رسالتش، یعنی عالم، در حق این عارف، رحمت است؛ زیرا رسولان فرستاده نشدند مگر به عنوان رحمت. و اگر به بلا فرستاده می‌شدند، در لفافه آن رحمتی الهی بود، زیرا رحمت الهی «همه چیز را فرا گرفته است.» (وَسِعَتْ كُلَّ شَيْءٍ) پس چیزی نیست که در این رحمت نباشد. «همانا پروردگار تو گسترده آمرزش است.» (إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ) پس گسترده را محدود مکن، زیرا او محدود شدن را نمی‌پذیرد.\n\nبرخی از بادیه‌نشینان (اعراب) گفت: «پروردگارا، مرا و محمد را رحمت کن و با ما هیچ کس دیگری را رحمت مکن.» و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) این را می‌شنید. پس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «ای مرد، تو گسترده را محدود کردی.»\n\nیعنی آن را از نظر گفتار و درخواست محدود کردی. پس اگر نزد عارف (العارف) چنین کلامی از خدا باشد، آن را در رحمت خاصی می‌گیرد که خداوند به واسطه آن میان این گوینده و محمد (صَلَّى اللهُ عَليهِ وسَلَّم) مناسبت برقرار کرده است. پس رسول این بادیه‌نشین را در رحمتی که خداوند او را بدان رحمت می‌کند و دیگری را بدان رحمت نمی‌کند، شریک ساخت. زیرا دیگری آن مناسبت خاص را ندارد. همانا رسول با تک تک افرادی از امتی که به سوی آنان مبعوث شده و به او ایمان آورده‌اند، مناسبت دارد. پس او با هر مؤمنی از امتش به واسطه مناسبت خاصی است که آن مؤمن آن را تعیین می‌کند؛ زیرا متبوع در نفس خود برای هر پیرو خود منزلتی دارد که به واسطه آن نزد او از دیگری متمایز می‌شود. و این مقدار در این ذکر کافی است. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}