{
  "id": 424,
  "title": {
    "ar": "الباب الرابع والعشرون وأربعمائة في معرفة منازلة أحبك للبقاء معي وتحب الرجوع إلى أهلك فقف حتى أتشفي منك وحينئذ تمر عني قال الله تعالى يُحِبُّهُمْ ويُحِبُّونَهُ فهو المحب المحبوب",
    "en": "Chapter 424: Concerning the Gnosis (معرفة) of the Contest/Dialogue (منازلة): \"I love you for your Subsistence (البقاء) with Me, yet you love returning to your people, so halt until I am satisfied with you, and only then may you pass away from Me.\" Allah the Exalted said: <<He loves them and they love Him>>. Thus, He is the Lover (المحب) and the Beloved (المحبوب).",
    "ur": "باب چار سو چوبیس: اس منازلت (منازلة) کے علم میں کہ \"میں تجھے اس لیے چاہتا ہوں کہ تو میرے ساتھ باقی رہے، اور تو اپنے اہل کی طرف لوٹنے کو پسند کرتا ہے، پس ٹھہر جا یہاں تک کہ میں تجھ سے سیر ہو جاؤں، اور تب تو مجھ سے گزر جائے گا\"۔ اللہ تعالیٰ نے فرمایا: {يُحِبُّهُمْ ويُحِبُّونَهُ} (وہ ان سے محبت کرتا ہے اور وہ اس سے محبت کرتے ہیں)۔ پس وہی المحب (محبت کرنے والا) اور المحبوب (جس سے محبت کی جائے) ہے۔",
    "fa": "باب چهارصد و بیست و چهارم در معرفت منازله (منازلة) «تو را دوست دارم تا با من بمانی و تو دوست داری به سوی اهل خود بازگردی، پس بایست تا از تو کامیاب شوم و آنگاه از من بگذری». خداوند متعال می‌فرماید: «او آنان را دوست دارد و آنان نیز او را دوست دارند» (يُحِبُّهُمْ ويُحِبُّونَهُ). پس اوست دوست‌دارنده (المحب) و دوست‌داشته‌شده (المحبوب)."
  },
  "content": {
    "ar": "## «الباب الرابع والعشرون وأربعمائة في معرفة منازلة أحبك للبقاء معي وتحب الرجوع إلى أهلك فقف حتى أتشفي منك وحينئذ تمر عني قال الله تعالى يُحِبُّهُمْ ويُحِبُّونَهُ فهو المحب المحبوب»\n\n\n> من أحب الفناء أحب لقائي *** من أحب البقا أحب الرجوعا\n\n\n> ليس يبقى مع الشهود وجود *** فترى الكون في الشهود صريعا\n\n\n> كل حب يكون فيه اشتياق *** أودع الحق فيه معنى بديعا\n\n\n> فإذا الله قال إني محب *** فتراني أصغى إليه سميعا\n\n\n> ويقول الفؤاد في السر مني *** إن يكن ما يقول كان مطيعا\n\n\n> إن لله في الوجود علوما *** ليس تعطي لمن يكون مذيعا\n\n\n### [أن للحق حكمين‏]\n\n\nاعلم أيدنا الله وإياك أن للحق حكمين الحكم الواحد ما له من حيث هويته وليس إلا رفع المناسبة بينه وبين عباده والحكم الآخر هو الذي به صحت الربوبية الموجبة للمناسبة بينه وبين خلقه وبها أثر في العالم الوجود وبها تأثر مما يحدث في العالم من الأحوال فيتصف الحق عند ذلك بالرضا والسخط وغير ذلك وللعالم حكمان حكم به صحت المناسبة بينه وبين الحق‏\nوبها كان العالم خلقا لله ومنسوبا إليه إنه وجد عنه فارتبط به ارتباط منفعل عن فاعل ولهذا الحكم لم يزل العالم مرجحا في حال عدمه بالعدم وفي حال وجوده بالوجود فما اتصف بالعدم إلا من حيث مرجحه ولا بالوجود إلا من حيث مرجحه والحكم الآخر هو من حيث هويته وحقيقته لا نعت له من ذاته كما قلنا في الحق في حكم رفع المناسبة ليصح قوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ في جناب الحق من حيث هويته ومن جناب العالم من حيث هويته والمناسبات أحدثت النعوت من حيث النسب لا من حيث إنها أعيان وجودية\n\n\n> فما ثم إلا الحق والحق فاعل *** وما ثم إلا الخلق والخلق منفعل‏\n\n\n### [المناسبة بين الله والعالم هو التحبب‏]\n\n\nفلما وقعت المناسبة بين الله وبين العالم صح أن يقول يُحِبُّهُمْ ويُحِبُّونَهُ فالحق محب محبوب فمن حيث هو محب ينفعل لتأثير الكون ومن حيث هو محبوب يبتلي والعالم أيضا محب لله محبوب لله فمن حيث هو محب لله يبتلى لأجل الدعوى فيفتضح صاحب الدعوى الكاذبة ويظهر صاحب الدعوة الصادقة ومن حيث إنه محبوب يتحكم على محبه فيدعوه فيستجيب له ويرضيه فيرضى ويسخطه فيعفو ويصفح مع نفوذ قدرته وقوة سلطانه إلا إن سلطان الحب قوي كما قال الخليفة أمير المؤمنين هارون الرشيد\n\n\n> ملك الثلاث الآنسات عناني *** وحللنا من قلبي بكل مكان‏\n\n\n> مالي تطاوعني البرية كلها *** وأطيعهن وهن في عصياني‏\n\n\n> ما ذاك إلا إن سلطان الهوى *** وبه قوين أعز من سلطاني‏\n\n\nومع وجود المناسبة بين الإنسان وبين العالم وأهله من العالم فلم يحب الرجوع إلى أهله من أحبه منهم مع كونهم محبوبين لله إلا لكون الله قد عين لأهله حقا على هذا الشخص فيحب الرجوع إلى أهله ليؤدي إليهم حقوقهم التي أوجبها الله لهم عليه لا لغرض نفسي ولا لمناسبة كونية ولما علم الله أن مثل هؤلاء ما رجعوا إلا امتثالا لأوامره تعالى ووقوفا عند حدوده لئلا يتجاوزوها ويتعدوها قال لمن هذه صفته قف حتى أتشفي وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم لي وقت لا يسعني فيه غير ربي‏\n\n\nفهو لله في ذلك الموطن ليس لنفسه ولا لشي‏ء من خلقه وسامحة الحق في رجوعه إلى أهله من هذا المقام لكونه ما يرجعه إلا حق الله الذي افترضه عليه لمن رجع إليه من أهله لعلمه بأنه يخاف فوت الوقت فيشهد له هذا الطلب للرجوع بأنه صادق الدعوى في محبته ربه تعالى لهذا قال وحينئذ تمر عني وهو لا يمر عنه إلا من حيث هذا المقام فإنه بعينه حيث كان قال تعالى في مثل هذا المقام الذي يقتضي الصبر عن الله من حيث هذا المشهد الخاص واصْبِرْ لِحُكْمِ رَبِّكَ برجوعك لأداء هذه الحقوق فإنك بأعيننا لعلمه بأنه محب والمحب يتألم للفراق والاشتغال بشهود الغير ولما سمعت في هذه المنازلة قوله حتى أتشفي منك ثقل علي لقلة معرفتي بالحق في حال هذه المنازلة فلما علم أنه قد شق مثل هذا علي آنسني بغيري في هذا الحكم فوقفني على‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم عن الله إنه أشد شوقا إلى لقاء أحبابه منهم إليه‏\n\n\nفإنه تعالى أعلم بهم منهم به وعلى قدر العلم يكون الشوق مع علمي إن مثل هذه الأمور إنما هي ألسنة المقامات والأحوال وأحكامها وأحكام الأسماء وهذا معنى قوله يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً ولا يحشر إليه إلا من ليس عنده من حيث هذا الاسم الخاص وهو عنده من حيث حكم اسم آخر غير هذا الاسم فمن عرف الحق بمثل هذه المعرفة لم يكير عليه ما يسمعه عن الله من كل ما هو نعت المخلوق والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "The Four Hundred and Twenty-Fourth Chapter: Concerning the knowledge of the station of [the Divine saying]: \"I love your remaining with Me, but you love returning to your family, so wait until I am satisfied with you (أتشفي منك), and then you may pass from Me.\" Allah the Exalted said: <<يُحِبُّهُمْ ويُحِبُّونَهُ>> (He loves them and they love Him). Thus, He is the Lover (المحب) and the Beloved (المحبوب).\n\nWhoever loves Annihilation (الفناء) loves My meeting;\nWhoever loves Subsistence (البقا) loves the return.\n\nNo existence (وجود) remains alongside the Witnessing (الشهود);\nThus, you see the cosmos struck down in the Witnessing.\n\nEvery love in which there is longing (اشتياق)\nThe Real (الحق) has deposited within it a wondrous meaning.\n\nSo when Allah says, \"Indeed, I am a Lover,\"\nYou see me listening attentively to Him.\n\nAnd the heart (الفؤاد) says secretly within me,\n\"If what He says is true, then I am obedient.\"\n\nIndeed, Allah has Knowledges (علوما) in Existence (الوجود)\nThat are not granted to one who divulges secrets.\n\n### [That the Real has Two Rulings]\n\nKnow, may Allah support us and you, that the Real (الحق) has two Rulings (حكمين). The first Ruling is that which belongs to Him by virtue of His Ipseity (هويته), and this is nothing other than the lifting of the correspondence (رفع المناسبة) between Him and His servants. The second Ruling is that by which Lordship (الربوبية) is validated, necessitating the correspondence (المناسبة) between Him and His creation (خلقه). By this [second Ruling], He affects the existent World (العالم الوجود), and by it, He is affected by the states (الأحوال) that occur in the World. Thus, the Real is described in this instance by contentment (الرضا), wrath (السخط), and other such attributes.\n\nThe World (العالم) also has two rulings. A ruling by which the correspondence between it and the Real is validated, and by which the World is the creation (خلق) of Allah and is attributed to Him, having come into existence from Him. Thus, it is linked to Him by the linkage of the passive recipient (منفعل) to the active agent (فاعل). Because of this ruling, the World has always been preponderated (مرجحا) in its state of non-existence by non-existence, and in its state of existence by existence. It is only described by non-existence insofar as its preponderator dictates, and by existence insofar as its preponderator dictates.\n\nThe other Ruling is by virtue of its Ipseity (هويته) and its Reality (حقيقته), having no attribute derived from its Essence (ذاته), just as we said concerning the Real in the ruling of lifting the correspondence. This is to validate His saying: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him) regarding the side of the Real (الحق) from the perspective of His Ipseity, and regarding the side of the World (العالم) from the perspective of its Ipseity. The correspondences (المناسبات) brought forth the attributes (النعوت) from the perspective of relations (النسب), not from the perspective that they are existential entities (أعيان وجودية).\n\nThere is nothing there but the Real, and the Real is the Active Agent (فاعل);\nAnd there is nothing there but Creation, and Creation is the Passive Recipient (منفعل).\n\n### [The Correspondence between Allah and the World is Mutual Love]\n\nWhen the correspondence (المناسبة) occurred between Allah and the World (العالم), it became valid to say: <<يُحِبُّهُمْ ويُحِبُّونَهُ>> (He loves them and they love Him). Thus, the Real (الحق) is a Lover (محب) and a Beloved (محبوب). Insofar as He is a Lover, He is passively affected (ينفعل) by the influence of the cosmos (الكون). Insofar as He is the Beloved, He tests (يبتلي).\n\nThe World (العالم) is also a lover of Allah and beloved by Allah. Insofar as it is a lover of Allah, it is tested (يبتلى) because of the claim (الدعوى). The claimant of falsehood is exposed, and the claimant of truth is revealed. Insofar as it is beloved, it exercises authority (يتحكم) over its Lover: it calls upon Him, and He responds; it seeks His contentment, and He is content; it seeks His wrath, and He pardons and forgives, despite the penetration of His power (قدرته) and the strength of His dominion (سلطانه).\n\nHowever, the dominion of love (سلطان الحب) is strong, as the Caliph, the Commander of the Faithful, Harun al-Rashid, said:\n\nThree charming women have mastered my reins,\nAnd they have settled in every place within my heart.\n\nWhy does all creation obey me,\nYet I obey them while they are in disobedience to me?\n\nThat is only because the dominion of passion (الهوى),\nBy which they are strengthened, is mightier than my dominion.\n\nDespite the existence of correspondence between the human being (الإنسان) and the World (العالم) and its inhabitants, the one who loves Allah does not love returning to his family (أهله)—even though they are beloved by Allah—except because Allah has designated a right (حقا) upon this person for his family. He loves returning to his family to fulfill the rights (حقوقهم) that Allah has made obligatory upon him for them, not for any personal desire (غرض نفسي) nor for any cosmic correspondence (مناسبة كونية).\n\nWhen Allah knew that such people only returned in compliance with His commands (امتثالا لأوامره) and standing at the limits He set (وقوفا عند حدوده) so as not to transgress or exceed them, He said to the one possessing this quality: \"Wait until I am satisfied (أتشفي).\" This refers to his saying (peace and blessings be upon him): \"I have a time when none but my Lord can contain me.\"\n\nIn that station (الموطن), he belongs to Allah, not to himself nor to any of His creation. The Real (الحق) permits his return to his family from this station because his return is solely for the sake of Allah’s right (حق الله) which He imposed upon him for those of his family to whom he returns. Knowing that he fears missing the [appointed] time, this request for return testifies to his sincerity in his claim of love for his Lord, the Exalted. For this reason, He said: \"and then you may pass from Me.\" He only passes from Him insofar as this station is concerned, for he is with Him wherever he is.\n\nAllah the Exalted said, concerning a station like this, which necessitates patience away from Allah (from the perspective of this specific witnessing): <<وَاصْبِرْ لِحُكْمِ رَبِّكَ>> (And be patient for the ruling of your Lord) by returning to fulfill these rights, <<فَإِنَّكَ بِأَعْيُنِنَا>> (for indeed, you are in Our Eyes). This is because He knows that he is a lover, and the lover suffers pain from separation and from being occupied with the witnessing of others (شهود الغير).\n\nWhen I heard in this station (المنازلة) His saying, \"wait until I am satisfied with you (حتى أتشفي منك),\" it weighed heavily upon me due to my limited knowledge of the Real in the state of this station. When He knew that such a thing was difficult for me, He comforted me with another [saying] concerning this ruling, and informed me of:\n\nHis saying (peace and blessings be upon him) reporting from Allah: that He longs more intensely to meet His beloved ones than they long to meet Him.\n\nIndeed, He the Exalted knows them better than they know Him. Longing (الشوق) is commensurate with Knowledge (العلم), even though I know that such matters are merely the tongues of the Stations (المقامات) and States (الأحوال) and their rulings, and the rulings of the Names (الأسماء). This is the meaning of His saying: <<يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْداً>> (The Day We gather the righteous to the Most Merciful as a delegation). None are gathered to Him except those who are not with Him insofar as this specific Name is concerned, yet they are with Him insofar as the ruling of another Name is concerned.\n\nWhoever knows the Real (الحق) with such Gnosis (المعرفة) will not find difficulty in anything he hears attributed to Allah that is also an attribute of the created being. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو چوبیس: اس منازل کی معرفت میں کہ (اللہ تعالیٰ فرماتے ہیں) \"میں تجھے اپنے ساتھ بقا کے لیے محبوب رکھتا ہوں اور تو اپنے اہل کی طرف لوٹنا چاہتا ہے، پس ٹھہر جا یہاں تک کہ میں تجھ سے شفا حاصل کر لوں، اور تب تو میرے پاس سے گزر جانا۔\" اللہ تعالیٰ نے فرمایا: **يُحِبُّهُمْ ويُحِبُّونَهُ** (وہ ان سے محبت کرتا ہے اور وہ اس سے محبت کرتے ہیں)۔ پس وہی المحب (محبت کرنے والا) اور المحبوب (محبوب) ہے۔\n\nجس نے فنا (الفناء) کو چاہا، اس نے میرے دیدار کو چاہا\nجس نے بقا (البقاء) کو چاہا، اس نے لوٹنے کو چاہا۔\n\nشہود (الشہود) کے ساتھ کوئی وجود (الوجود) باقی نہیں رہتا\nپس تو کائنات کو شہود میں مغلوب دیکھے گا۔\n\nہر محبت جس میں اشتیاق ہو\nذات حق (الحق) نے اس میں ایک انوکھا معنی ودیعت کیا ہے۔\n\nپس جب اللہ کہتا ہے کہ میں محبت کرنے والا ہوں\nتو تو مجھے سنتے ہوئے اس کی طرف کان لگائے دیکھے گا۔\n\nاور دل میرے اندر راز میں کہتا ہے\nاگر وہ جو کہتا ہے، وہ مطیع (فرمانبردار) ہو۔\n\nبے شک وجود (الوجود) میں اللہ کے لیے ایسے علوم ہیں\nجو اس شخص کو نہیں دیے جاتے جو انہیں فاش کرنے والا ہو۔\n\n### [کہ ذات حق (الحق) کے لیے دو حکم ہیں]\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ ذات حق (الحق) کے لیے دو حکم ہیں۔ پہلا حکم وہ ہے جو اس کی ہویت (ذات) کے اعتبار سے ہے، اور وہ صرف اس کے اور اس کے بندوں کے درمیان مناسبت (رابطے) کو ختم کرنا ہے۔ دوسرا حکم وہ ہے جس کے ذریعے ربوبیت صحیح ٹھہرتی ہے، جو اس کے اور اس کی مخلوق کے درمیان مناسبت کو واجب کرتی ہے۔ اسی کے ذریعے وہ عالم الوجود (کائنات) میں اثر انداز ہوتا ہے، اور اسی کے ذریعے وہ ان احوال سے متاثر ہوتا ہے جو عالم میں رونما ہوتے ہیں۔ پس اس وقت ذات حق (الحق) رضا، غضب اور دیگر صفات سے متصف ہوتی ہے۔\n\nاور عالم (کائنات) کے لیے بھی دو حکم ہیں۔ ایک حکم وہ ہے جس کے ذریعے اس کے اور ذات حق (الحق) کے درمیان مناسبت صحیح ٹھہرتی ہے، اور اسی کے ذریعے عالم اللہ کی مخلوق بنا اور اس کی طرف منسوب ہوا کہ وہ اس سے وجود میں آیا، پس وہ فاعل (کرنے والے) سے منفعل (اثر قبول کرنے والے) کے تعلق سے منسلک ہوا۔ اور اسی حکم کی وجہ سے عالم اپنے عدم کی حالت میں عدم کے ساتھ اور اپنے وجود کی حالت میں وجود کے ساتھ ہمیشہ مرجح (ترجیح دیا گیا) رہا ہے۔ پس وہ عدم سے متصف نہیں ہوا مگر اس حیثیت سے جس سے اسے ترجیح دی گئی، اور نہ ہی وجود سے متصف ہوا مگر اس حیثیت سے جس سے اسے ترجیح دی گئی۔\n\nاور دوسرا حکم اس کی ہویت (ذات) اور حقیقت کے اعتبار سے ہے، اس کی اپنی ذات سے کوئی صفت نہیں، جیسا کہ ہم نے ذات حق (الحق) کے بارے میں مناسبت کو ختم کرنے والے حکم میں کہا، تاکہ اس کا یہ قول صحیح ٹھہرے: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (اس کی مانند کوئی شے نہیں ہے)۔ یہ ذات حق (الحق) کی ہویت کے لحاظ سے اور عالم کی ہویت کے لحاظ سے ہے۔ اور مناسبتوں نے صفات کو نسبتوں کے اعتبار سے پیدا کیا ہے، نہ کہ اس حیثیت سے کہ وہ وجودی اعیان (حقیقی وجود رکھنے والی چیزیں) ہیں۔\n\nپس وہاں ذات حق (الحق) کے سوا کچھ نہیں اور ذات حق (الحق) فاعل ہے\nاور وہاں خلق کے سوا کچھ نہیں اور خلق منفعل ہے۔\n\n### [اللہ اور عالم کے درمیان مناسبت تحبب (محبت کا اظہار) ہے]\n\nپس جب اللہ اور عالم کے درمیان مناسبت قائم ہوئی، تو یہ کہنا صحیح ٹھہرا: **يُحِبُّهُمْ ويُحِبُّونَهُ** (وہ ان سے محبت کرتا ہے اور وہ اس سے محبت کرتے ہیں)۔ پس ذات حق (الحق) محب (محبت کرنے والا) بھی ہے اور محبوب بھی۔ محب ہونے کی حیثیت سے وہ کائنات کے اثر سے منفعل ہوتا ہے، اور محبوب ہونے کی حیثیت سے وہ آزماتا ہے۔\n\nاور عالم بھی اللہ کا محب ہے اور اللہ کا محبوب ہے۔ اللہ کا محب ہونے کی حیثیت سے وہ دعوے کی وجہ سے آزمایا جاتا ہے، پس جھوٹے دعوے والا رسوا ہوتا ہے اور سچے دعوے والا ظاہر ہوتا ہے۔ اور محبوب ہونے کی حیثیت سے وہ اپنے محب پر حکم چلاتا ہے، پس وہ اسے پکارتا ہے تو وہ اسے جواب دیتا ہے، اور اسے راضی کرتا ہے تو وہ راضی ہو جاتا ہے، اور اسے ناراض کرتا ہے تو وہ معاف کر دیتا ہے اور درگزر کرتا ہے، باوجود اس کے کہ اس کی قدرت نافذ اور اس کا اقتدار قوی ہے۔ مگر یہ کہ محبت کا سلطان قوی ہوتا ہے، جیسا کہ خلیفہ امیر المؤمنین ہارون الرشید نے کہا:\n\nتین دل بہلانے والیوں نے میری لگام تھام لی\nاور میرے دل میں ہر جگہ بسیرا کر لیا۔\n\nکیا وجہ ہے کہ ساری مخلوق میری اطاعت کرتی ہے\nاور میں ان کی اطاعت کرتا ہوں حالانکہ وہ میری نافرمانی میں ہیں؟\n\nیہ صرف اس لیے ہے کہ عشق کا سلطان\nجس کے ذریعے وہ قوی ہوئیں، میرے سلطان سے زیادہ عزیز ہے۔\n\nاور انسان اور عالم اور عالم کے اہل کے درمیان مناسبت کے باوجود، جس شخص کو اللہ نے محبوب رکھا، اس نے اپنے اہل کی طرف لوٹنا پسند نہیں کیا، حالانکہ وہ بھی اللہ کے محبوب ہیں۔ مگر یہ کہ اللہ نے اس شخص پر اس کے اہل کا ایک حق مقرر کر دیا ہے، پس وہ اپنے اہل کی طرف لوٹنا پسند کرتا ہے تاکہ وہ ان کے حقوق ادا کرے جو اللہ نے اس پر ان کے لیے واجب کیے ہیں، نہ کسی نفسانی غرض کے لیے اور نہ کسی کونی مناسبت کے لیے۔\n\nاور جب اللہ نے جان لیا کہ ایسے لوگ صرف اس کے اوامر کی تعمیل میں اور اس کی حدود پر ٹھہرنے کے لیے لوٹے ہیں تاکہ وہ ان سے تجاوز نہ کریں اور حد سے نہ بڑھیں، تو اس نے اس شخص سے جس کی یہ صفت ہے، کہا: \"ٹھہر جا یہاں تک کہ میں شفا حاصل کر لوں۔\" اور یہ نبی اکرم صلی اللہ علیہ وسلم کا قول ہے: \"میرے لیے ایک ایسا وقت ہوتا ہے جس میں میرے رب کے سوا کوئی میری گنجائش نہیں رکھتا۔\"\n\nپس وہ اس مقام پر اللہ کے لیے ہوتا ہے، نہ اپنے نفس کے لیے اور نہ اپنی مخلوق میں سے کسی شے کے لیے۔ اور ذات حق (الحق) نے اس مقام سے اس کے اہل کی طرف لوٹنے کی اجازت دی، کیونکہ اسے صرف اللہ کا وہ حق واپس لے جاتا ہے جو اس نے اس پر اس کے اہل کے لیے فرض کیا ہے جن کی طرف وہ لوٹا ہے۔ یہ اس لیے کہ اللہ جانتا ہے کہ وہ وقت کے فوت ہونے سے ڈرتا ہے، پس لوٹنے کا یہ مطالبہ اس بات کی گواہی دیتا ہے کہ وہ اپنے رب تعالیٰ کی محبت میں دعوے کا سچا ہے۔ اسی لیے اللہ نے فرمایا: \"اور تب تو میرے پاس سے گزر جانا۔\" اور وہ اس سے صرف اسی مقام کی حیثیت سے گزرتا ہے، کیونکہ وہ اپنی ذات کے اعتبار سے وہیں ہے جہاں وہ تھا۔\n\nاللہ تعالیٰ نے ایسے ہی مقام میں، جو اس خاص مشاہدے کی حیثیت سے اللہ سے صبر کا تقاضا کرتا ہے، فرمایا: **وَاصْبِرْ لِحُكْمِ رَبِّكَ** (اور اپنے رب کے حکم پر صبر کر)۔ یعنی ان حقوق کی ادائیگی کے لیے تیرے لوٹنے پر، **فَإِنَّكَ بِأَعْيُنِنَا** (پس بے شک تو ہماری آنکھوں کے سامنے ہے)۔ یہ اس لیے کہ اللہ جانتا ہے کہ وہ محب ہے، اور محب جدائی اور غیر کے شہود (الشہود) میں مشغول ہونے پر تکلیف محسوس کرتا ہے۔\n\nاور جب میں نے اس منازل میں اس کا قول سنا: \"یہاں تک کہ میں تجھ سے شفا حاصل کر لوں،\" تو یہ مجھ پر گراں گزرا، کیونکہ اس منازل کے حال میں ذات حق (الحق) کی معرفت (المعرفۃ) کم تھی۔ پس جب اللہ نے جان لیا کہ یہ بات مجھ پر شاق گزری ہے، تو اس نے اس حکم میں مجھے کسی اور کے ذریعے تسلی دی اور مجھے اس پر مطلع کیا:\n\nنبی اکرم صلی اللہ علیہ وسلم کا اللہ کی طرف سے یہ قول کہ: \"بے شک وہ اپنے احباب سے ملاقات کا ان سے زیادہ مشتاق ہے جتنا وہ اس کے مشتاق ہیں۔\"\n\nکیونکہ وہ تعالیٰ ان کے بارے میں ان سے زیادہ جانتا ہے جتنا وہ اس کے بارے میں جانتے ہیں، اور شوق علم کے بقدر ہوتا ہے۔ اس کے ساتھ ہی مجھے یہ علم ہے کہ ایسی باتیں درحقیقت مقامات اور احوال کی زبانیں ہیں، اور ان کے احکام اور اسماء کے احکام ہیں۔ اور یہی اس کے قول کا معنی ہے: **يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْداً** (جس دن ہم پرہیزگاروں کو رحمن کی طرف مہمان بنا کر جمع کریں گے)۔ اور اس کی طرف صرف وہی جمع کیا جائے گا جو اس خاص اسم کی حیثیت سے اس کے پاس نہیں ہے، جبکہ وہ کسی دوسرے اسم کے حکم کی حیثیت سے اس کے پاس ہے۔ پس جس نے ذات حق (الحق) کو اس طرح کی معرفت (المعرفۃ) سے پہچانا، اس پر وہ سب کچھ گراں نہیں گزرتا جو وہ اللہ کے بارے میں سنتا ہے، جو مخلوق کی صفت ہے۔ اور اللہ حق (الحق) کہتا ہے اور وہی راہ دکھاتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب چهارصد و بیست و چهارم در معرفت منازله‌ای (مقام/گفتگویی) که [خداوند می‌گوید:] «تو را دوست دارم که با من بمانی، و تو دوست داری به سوی خانواده‌ات بازگردی؛ پس بایست تا از تو شفا یابم (کامیاب شوم)، و آنگاه از من گذر کنی.» خداوند متعال فرمود: «يُحِبُّهُمْ ويُحِبُّونَهُ» (آنان را دوست دارد و آنان نیز او را دوست دارند). پس او دوست‌دار (محب) و دوست‌داشته‌شده (محبوب) است.\n\n> هر که فنا (الفناء) را دوست داشت، دیدار مرا دوست داشت *** هر که بقا (البقاء) را دوست داشت، بازگشت را دوست داشت\n\n> با شهود (الشهود)، هستی‌ای باقی نمی‌ماند *** پس جهان را در شهود، بر زمین افتاده می‌بینی\n\n> هر عشقی که در آن اشتیاق باشد *** حق (الحق) در آن معنایی بدیع نهاده است\n\n> پس چون خداوند گوید که من دوست‌دارم *** مرا می‌بینی که با گوش شنوا به او گوش می‌سپارم\n\n> و دل در نهان از من می‌گوید *** اگر آنچه می‌گوید باشد، فرمانبردار است\n\n> همانا خداوند در هستی (الوجود) علومی دارد *** که به کسی که فاش‌کننده باشد، عطا نمی‌شود\n\n### [اینکه حق (الحق) دو حکم دارد]\n\nبدان، خداوند ما و تو را تأیید کند، که حق (الحق) دو حکم دارد. حکم اول آن است که از حیث هویتش داراست و آن چیزی نیست جز رفع مناسبت (المناسبة) میان او و بندگانش. و حکم دیگر آن است که به واسطه آن، ربوبیت (الربوبية) که موجب مناسبت میان او و خلقش است، صحیح می‌شود. و به واسطه آن در عالم هستی (الوجود) تأثیر می‌گذارد و به واسطه آن از احوالی که در عالم رخ می‌دهد، متأثر می‌شود؛ پس حق (الحق) در آن هنگام به رضا و سخط و غیر آن متصف می‌گردد.\n\nو عالم نیز دو حکم دارد: حکمی که به واسطه آن مناسبت میان او و حق (الحق) صحیح می‌شود و به واسطه آن عالم، خلق خدا و منسوب به اوست؛ زیرا از او موجود شده و با او ارتباطی برقرار کرده است، ارتباط منفعل از فاعل. و به واسطه این حکم، عالم پیوسته در حال عدمش به عدم و در حال وجودش به وجود ترجیح داده شده است. پس به عدم متصف نشد مگر از حیث مرجحش، و به وجود متصف نشد مگر از حیث مرجحش. و حکم دیگر از حیث هویت و حقیقت اوست که از ذات خود نعت (وصف) ندارد، همان‌طور که در مورد حق (الحق) در حکم رفع مناسبت گفتیم، تا سخن او صحیح باشد: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست)؛ این در مورد جناب حق (الحق) از حیث هویتش و جناب عالم از حیث هویتش صادق است. و مناسبت‌ها، اوصاف را از حیث نسبت‌ها ایجاد کردند، نه از حیث اینکه آنها اعیان وجودی باشند.\n\n> پس آنجا جز حق (الحق) نیست و حق فاعل است *** و آنجا جز خلق نیست و خلق منفعل است\n\n### [مناسبت میان خداوند و عالم، همان دوستی (التحبب) است]\n\nپس چون مناسبت میان خداوند و عالم برقرار شد، صحیح است که بگوید: «يُحِبُّهُمْ ويُحِبُّونَهُ» (آنان را دوست دارد و آنان نیز او را دوست دارند). پس حق (الحق) دوست‌دار (محب) و دوست‌داشته‌شده (محبوب) است. از آن حیث که دوست‌دار است، در برابر تأثیر هستی (الکون) منفعل می‌شود، و از آن حیث که دوست‌داشته‌شده است، مبتلا می‌کند. و عالم نیز دوست‌دار خدا و دوست‌داشته‌شده خداست. از آن حیث که دوست‌دار خداست، به خاطر ادعا مبتلا می‌شود؛ پس صاحب ادعای دروغین رسوا می‌گردد و صاحب دعوت صادق آشکار می‌شود. و از آن حیث که محبوب است، بر دوست‌دار خود حکم می‌راند؛ او را می‌خواند و حق (الحق) اجابتش می‌کند، او را راضی می‌کند و حق راضی می‌شود، و او را به خشم می‌آورد و حق با وجود نفوذ قدرتش و قوت سلطنتش، عفو و صفح می‌کند. مگر اینکه سلطان عشق قوی است، چنانکه خلیفه امیرالمؤمنین هارون الرشید گفت:\n\n> سه زن دلربا مهار مرا به دست گرفتند *** و در جای جای قلبم منزل گزیدند\n\n> مرا چه شده که تمام خلقت از من فرمان می‌برد *** و من از آنان اطاعت می‌کنم در حالی که آنان در نافرمانی من هستند؟\n\n> این نیست مگر اینکه سلطان هوس *** که به واسطه آن قوی شدند، عزیزتر از سلطنت من است\n\nو با وجود مناسبت میان انسان و عالم و اهلش از عالم، کسی که خداوند او را دوست دارد، بازگشت به سوی خانواده‌اش را دوست نمی‌دارد، با اینکه آنان نیز محبوب خدا هستند، مگر به این دلیل که خداوند حقی را برای خانواده‌اش بر عهده این شخص معین کرده است. پس او بازگشت به سوی خانواده‌اش را دوست می‌دارد تا حقوقی را که خداوند بر عهده او برای آنان واجب کرده است، ادا کند؛ نه به خاطر غرض نفسانی و نه به خاطر مناسبت کیهانی. و چون خداوند دانست که چنین کسانی بازنگشتند مگر برای امتثال اوامر او و ایستادن بر حدود او تا از آنها تجاوز نکنند، به کسی که این صفت اوست، فرمود: «بایست تا از تو شفا یابم (کامیاب شوم).» و این همان سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است که فرمود: «مرا وقتی است که در آن جز پروردگارم نمی‌گنجد.»\n\nپس او در آن موطن برای خداست، نه برای نفس خود و نه برای هیچ‌یک از خلقش. و حق (الحق) در بازگشت او به سوی خانواده‌اش از این مقام، به او اجازه داد؛ زیرا او بازنمی‌گردد مگر به خاطر حق خدا که بر او واجب کرده است برای کسانی از خانواده‌اش که به سوی آنان بازمی‌گردد. زیرا خداوند می‌داند که او از فوت وقت می‌ترسد. پس این طلب بازگشت، گواهی می‌دهد که او در ادعای محبت پروردگارش صادق است. به همین دلیل فرمود: «و آنگاه از من گذر کنی.» و او از حق نمی‌گذرد مگر از حیث این مقام. زیرا او به عین خود در هر کجا که باشد، هست. خداوند متعال در مثل این مقام که صبر از خدا را از حیث این مشهد خاص اقتضا می‌کند، فرمود: «وَاصْبِرْ لِحُكْمِ رَبِّكَ» (و برای حکم پروردگارت صبر کن) [با بازگشتت برای ادای این حقوق] «فَإِنَّكَ بِأَعْيُنِنَا» (زیرا تو در دیدگان ما هستی). زیرا خداوند می‌داند که او دوست‌دار است و دوست‌دار از فراق و مشغول شدن به شهود (الشهود) غیر، متألم می‌شود.\n\nو چون در این منازله (گفتگو) سخن او را شنیدم که «تا از تو شفا یابم (کامیاب شوم)»، به دلیل کمی معرفت (المعرفة) من به حق (الحق) در حال این منازله، بر من سنگین آمد. پس چون دانست که چنین چیزی بر من دشوار آمده است، مرا با غیر خودم در این حکم مأنوس ساخت و بر این سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) که از قول خداوند نقل می‌کند، آگاه ساخت: «همانا اشتیاق او به دیدار دوستانش، از اشتیاق آنان به او شدیدتر است.»\n\nزیرا او تعالی به آنان داناتر است تا آنان به او، و اشتیاق به اندازه علم است. با این علم من که چنین اموری تنها زبان‌های مقامات و احوال و احکام آنها و احکام اسماء هستند. و این معنای سخن اوست: «يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْداً» (روزی که پرهیزگاران را به سوی [خدای] رحمان، گروه گروه محشور می‌کنیم). و به سوی او محشور نمی‌شود مگر کسی که از حیث این اسم خاص، نزد او نیست، در حالی که از حیث حکم اسم دیگری غیر از این اسم، نزد اوست. پس کسی که حق (الحق) را با چنین معرفتی (المعرفة) بشناسد، آنچه را که از خداوند می‌شنود و نعت مخلوق است، بر او دشوار نمی‌آید. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}