{
  "id": 129,
  "title": {
    "ar": "الباب التاسع والعشرون ومائة في معرفة ترك الرضي",
    "en": "Chapter One Hundred and Twenty-Nine: Concerning the Gnosis of Relinquishing Contentment.",
    "ur": "باب ایک سو انتیس: ترکِ رضا کی معرفت میں",
    "fa": "باب صد و بیست و نهم در معرفت ترک رضایت (الرضي)"
  },
  "content": {
    "ar": "## (الباب التاسع والعشرون ومائة في معرفة ترك الرضي)\n\n\n> ترك الرضي عند أهل الرسم مثلبة *** وعند أهل وجود الله آيات‏\n\n\n> على تحققهم بعين موجدهم *** من حيث ما هم به محو وإثبات‏\n\n\n> يرضى الإله عن النفس التي ربطت *** بحكمه ولهم فيها علامات‏\n\n\n> والنفس راضية عنه وليس لها *** بالعين علم ولا بالوجد لذات‏\n\n\n> وما سوى النفس من عقل فليس له *** رضي وليست له فيها نهايات‏\n\n\n### [جناب الله أوسع من أن أرضى منه باليسير ولكن أرضى عنه‏]\n\n\nجناب الله أوسع من أن أرضى منه باليسير ولكن أرضى عنه لا منه لأن الرضي منه يقطع همم الرجال والله يقول آمرا نبيه صَلَّى اللهُ عَليهِ وسَلَّم وقُلْ رَبِّ زِدْنِي عِلْماً مع كونه قد حصل علم الأولين والآخرين وأوتي جوامع الكلم فإنه لا يعظم على الله شي‏ء طلب منه فإن المطلوب منه لا يتناهى فليس له طرف نقف عنده‏\n\n\n### [اتساع الممكنات لا يقبل التناهي‏]\n\n\nفوسع في طلب المزيد إن كنت من العلماء بالله وإذا كان اتساع الممكنات لا يقبل التناهي فما ظنك بالاتساع الإلهي فيما يجب له وما يعطيه من المعرفة كل ممكن على عدم التناهي فيه فكيف إذا انضاف إلى تلك المعرفة ما لا تعلق للممكن بها لا من سلب ولا من إثبات نسب فإذا ترك العبد الرضي فعلى هذا الحد يتركه فهو راض عنه لا راض منه لأن الرضي منه جهل به ونقص والعبد الكامل مخلوق على صورة الكمال‏\n\n\n### [لا ينبغي الرضا بكل مقضى ولكن بقضاء الله فيما اقامه‏]\n\n\nوأما قول بعضهم لي منذ ستين سنة أو كما وقت ما أقامني الله في أمر فكرهته قالت المشايخ أشار إلى دوام الرضي واحتجوا بهذا على ثبوت الأحوال فإن الرضي عندهم من الأحوال وهذا لا يصح من غير المعصوم والمحفوظ فربما كان هذا القائل من المحفوظين أو المعصومين فإن لم يكن فيريد الرضي بقضاء الله فيما أقامه لا بكل مقضي فإنه لا ينبغي الرضي بكل مقضي وإن رأيت وجه الحق فيه فإنك إذا كنت صحيح الرؤية فيه فإنك ترى وجه الحق فيه غير راض عنه فإن لم تره بذلك العين الإلهي وإلا فما رأيته إن رضيت به ولا يَرْضى‏ لِعِبادِهِ الْكُفْرَ فتحفظ من هذا الحال أو هذا المقام فإنه زهوق لا يثبت عليه الاقدام فإن فيه منازعة الحق‏\n\n",
    "en": "Chapter 129: Concerning the Gnosis of Abandoning Contentment\n\nAbandoning contentment is a fault according to the people of the Exoteric Law,\nBut according to the people of the Divine Existence (أهل وجود الله), it is a sign.\n\n[A sign] of their realization through the very Essence of their Originator,\nFrom the perspective where they are both effacement (محو) and establishment (إثبات).\n\nThe Deity is content with the soul that is bound\nBy His ruling, and for them, there are signs therein.\n\nAnd the soul is content with Him, yet it possesses\nNeither knowledge by direct vision (بالعين علم) nor pleasures by spiritual finding (بالوجد لذات).\n\nAnd what is other than the soul, such as the intellect, has no\nContentment, nor are there limits for it therein.\n\n### The Divine Presence is too vast for me to be content with the little from Him, but I am content with Him\n\nThe Divine Presence (جناب الله) is too vast for me to be content with the little *from* Him, but rather I am content *with* Him, not *from* Him. This is because contentment *from* Him cuts off the aspirations of men. Allah says, commanding His Prophet (PBUH): <<وَقُلْ رَبِّ زِدْنِي عِلْماً>> (And say: 'My Lord, increase me in knowledge'), despite the fact that he had already attained the knowledge of the first and the last, and was given the comprehensive words (جوامع الكلم). Nothing requested from Allah is too great for Him, for what is sought from Him is inexhaustible (لا يتناهى), and thus there is no limit (طرف) at which we can stop.\n\n### The vastness of the possibilities does not accept termination\n\nTherefore, expand your request for increase if you are among those who possess Gnosis of Allah (العلماء بالله). If the vastness of the possibilities (الممكنات) does not accept termination, then what do you suppose of the Divine Vastness (الاتساع الإلهي) concerning what is incumbent upon Him and the Gnosis (المعرفة) He grants to every possible thing (ممكن) in its inexhaustibility? How much more so when there is added to that Gnosis what has no relation to the possible thing, neither by negation (سلب) nor by affirmation of relation (إثبات نسب)? When the servant abandons contentment (الرضي), it is upon this boundary that he abandons it. He is content *with* Him, not content *from* Him, because contentment *from* Him is ignorance (جهل) of Him and a deficiency (نقص), and the Perfect Servant (العبد الكامل) is created upon the form of perfection.\n\n### Contentment is not appropriate with every decreed thing, but only with Allah's decree concerning what He established\n\nAs for the saying of some of them: \"For sixty years, or for the duration of time that Allah established me in a matter, I never disliked it,\" the Shaykhs (المشايخ) said this indicates the permanence of contentment (دوام الرضي) and they used this to argue for the permanence of spiritual states (الأحوال), since contentment is considered one of the states according to them. This is not sound except from the protected (المحفوظ) or the infallible (المعصوم). Perhaps this speaker was among the protected or the infallible. If he was not, then he means contentment with the decree (قضاء الله) concerning what He established him in, not with every decreed thing (كل مقضي). For contentment with every decreed thing is inappropriate, even if you see the face of the Real (وجه الحق) in it. If your vision is sound concerning it, you will see the face of the Real in it while not being content with it. If you do not see it with that Divine Eye (العين الإلهي), then you have not truly seen it if you are content with it. And [Allah] <<وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ>> (does not approve disbelief for His servants). Therefore, guard yourself against this state (حال) or this station (مقام), for it is fleeting (زهوق) and no footing can be established upon it, as it involves disputing the Real (منازعة الحق).",
    "ur": "(باب ایک سو انتیس: ترکِ رضامندی (ترک الرضی) کی معرفت میں)\n\nاہل ظاہر (أهل الرسم) کے نزدیک ترکِ رضا ایک عیب ہے،\nجبکہ اہل ہستی (أهل وجود الله) کے نزدیک یہ نشانیاں (آیات) ہیں۔\n\nیہ ان کے اپنے موجد کی عین ذات کے ساتھ ان کے تحقق پر مبنی ہے،\nاس لحاظ سے کہ وہ اس میں محو (مٹائے ہوئے) بھی ہیں اور ثابت (قائم) بھی ہیں۔\n\nذات حق (الحق) اس نفس سے راضی ہوتا ہے جو اس کے حکم سے جڑا ہوا ہو،\nاور ان کے لیے اس میں نشانیاں ہیں۔\n\nاور نفس اس سے راضی ہے، لیکن اسے عین ذات کے ذریعے نہ علم حاصل ہے\nاور نہ ہی وجد کے ذریعے لذتیں۔\n\nاور نفس کے علاوہ جو عقل ہے، اس کے لیے کوئی رضا نہیں ہے،\nاور نہ ہی اس میں اس کے لیے کوئی انتہا ہے۔\n\n### [ذات حق کی بارگاہ اس سے کہیں زیادہ وسیع ہے کہ میں اس کی طرف سے معمولی چیز پر راضی ہو جاؤں، بلکہ میں اس سے راضی ہوتا ہوں]\n\nذات حق (الحق) کی بارگاہ اس سے کہیں زیادہ وسیع ہے کہ میں اس کی طرف سے معمولی چیز پر راضی ہو جاؤں، بلکہ میں اس سے راضی ہوتا ہوں نہ کہ اس کی طرف سے۔ کیونکہ اس کی طرف سے رضامندی (الرضی) مردانِ حق کے حوصلوں کو کاٹ دیتی ہے۔ اور اللہ تعالیٰ اپنے نبی صلی اللہ علیہ وسلم کو حکم دیتے ہوئے فرماتا ہے:\n**وَقُلْ رَبِّ زِدْنِي عِلْماً** (اور کہو: اے میرے رب! میرے علم میں اضافہ فرما) [سورۃ طٰہٰ: ۱۱۴]\nحالانکہ آپ صلی اللہ علیہ وسلم کو اولین و آخرین کا علم حاصل تھا اور آپ کو جوامع الکلم (جامع کلمات) عطا کیے گئے تھے۔ کیونکہ اللہ پر کوئی بھی چیز جو اس سے طلب کی جائے، بڑی نہیں ہوتی۔ اس لیے کہ جو کچھ اس سے مطلوب ہے وہ لامتناہی ہے، پس اس کی کوئی انتہا نہیں جہاں ہم رک جائیں۔\n\n### [ممکنات کی وسعت انتہا کو قبول نہیں کرتی]\n\nپس اگر تم اللہ کی معرفت (المعرفۃ) رکھنے والے علماء میں سے ہو تو مزید طلب کرنے میں وسعت اختیار کرو۔ اور جب ممکنات (الممکنات) کی وسعت انتہا کو قبول نہیں کرتی، تو تمہارا کیا خیال ہے اس الٰہی وسعت کے بارے میں جو اس کے لیے واجب ہے اور جو وہ ہر ممکن کو معرفت (المعرفۃ) کی صورت میں عطا کرتا ہے، اس میں بھی عدمِ تناہیت (لامتناہیت) ہے۔ تو پھر کیا حال ہوگا جب اس معرفت (المعرفۃ) کے ساتھ وہ چیز بھی شامل ہو جائے جس کا ممکن (مخلوق) سے کوئی تعلق نہیں، نہ نفی کے لحاظ سے اور نہ ہی اثبات کے لحاظ سے؟ پس جب بندہ رضامندی (الرضی) کو ترک کرتا ہے تو وہ اسی حد پر اسے ترک کرتا ہے۔ لہٰذا وہ اس (ذات حق) سے راضی ہوتا ہے، نہ کہ اس کی طرف سے راضی ہوتا ہے۔ کیونکہ اس کی طرف سے رضامندی (الرضی) اس کے بارے میں جہالت اور نقص ہے، جبکہ کامل بندہ کمال (الکمال) کی صورت پر پیدا کیا گیا ہے۔\n\n### [ہر مقضی پر راضی ہونا مناسب نہیں، بلکہ اللہ کے اس قضا پر راضی ہونا چاہیے جس میں اس نے اسے قائم کیا]\n\nاور جہاں تک بعض لوگوں کا یہ قول ہے کہ \"ساٹھ سال سے یا جب سے اللہ نے مجھے کسی معاملے میں قائم کیا ہے، میں نے اسے ناپسند نہیں کیا\"، تو مشائخ نے کہا کہ اس سے مراد دوامِ رضا (ہمیشگی کی رضامندی) ہے، اور انہوں نے اس قول سے احوال کے ثبوت پر دلیل پکڑی ہے۔ کیونکہ ان کے نزدیک رضا (الرضی) احوال میں سے ہے۔ اور یہ (دوامِ رضا) معصوم اور محفوظ (اللہ کی حفاظت میں) کے علاوہ کسی اور کے لیے درست نہیں ہو سکتا۔ ہو سکتا ہے کہ یہ کہنے والا محفوظین یا معصومین میں سے ہو۔ اگر وہ ایسا نہیں ہے، تو اس کی مراد یہ ہے کہ وہ اللہ کے اس قضا پر راضی ہے جس میں اس نے اسے قائم کیا، نہ کہ ہر مقضی (فیصلہ شدہ امر) پر۔ کیونکہ ہر مقضی پر راضی ہونا مناسب نہیں، اگرچہ تم اس میں ذات حق (الحق) کا چہرہ دیکھو۔ کیونکہ اگر تمہاری رؤیت (دیکھنا) اس میں درست ہے، تو تم اس میں ذات حق (الحق) کا چہرہ دیکھو گے مگر اس سے راضی نہیں ہو گے۔ اگر تم اسے اس الٰہی آنکھ سے نہ دیکھو، تو اگر تم اس پر راضی ہو گئے تو تم نے اسے دیکھا ہی نہیں۔ اور **وَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ** (اور وہ اپنے بندوں کے لیے کفر کو پسند نہیں کرتا) [سورۃ الزمر: ۷]۔ پس اس حال یا اس مقام سے بچو، کیونکہ یہ زوال پذیر ہے اور اس پر قدم نہیں جمتے، اس لیے کہ اس میں ذات حق (الحق) سے جھگڑا ہے۔",
    "fa": "باب صد و بیست و نهم در معرفت ترک رضایت (ترک الرضی)\n\nترک رضایت نزد اهل ظاهر (الرسم) عیب است، *** و نزد اهل هستی حق (وجود الله) نشانه‌هاست.\n\nبر اساس تحققشان به عین هستی‌بخششان، *** از آن جهت که در او محو (محو) و اثبات هستند.\n\nخداوند از نفسی که به حکم او پیوسته است، راضی می‌شود، *** و برای آنان در آن نشانه‌هایی است.\n\nو نفس از او راضی است، در حالی که برای او *** نه به عین (العین) علمی است و نه به وجد (الوجد) لذتی.\n\nو آنچه غیر از نفس است، از عقل، برای او *** رضایتی نیست و برای او در آن پایانی نیست.\n\n[ساحت حق (الله) والاتر از آن است که به اندک از او راضی شوم، بلکه از او راضی می‌شوم.]\n\nساحت حق (الله) والاتر از آن است که به اندک از او راضی شوم، بلکه از او راضی می‌شوم نه از او؛ زیرا رضایت از او، همت مردان را قطع می‌کند. و خداوند به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) امر کرده و می‌فرماید: «وَقُلْ رَبِّ زِدْنِي عِلْماً» (و بگو: پروردگارا، بر علم من بیفزا) [طه: ۱۱۴]، با وجود اینکه او علم اولین و آخرین را کسب کرده و جوامع الکلم (جوامع الكلم) به او داده شده است. زیرا هیچ چیز درخواستی از خداوند بر او بزرگ نیست؛ چرا که مطلوب از او پایان نمی‌پذیرد و حدی ندارد که در آن متوقف شویم.\n\n[گستردگی ممکنات پایان‌پذیری را نمی‌پذیرد.]\n\nپس اگر از عالمان به حق (الله) هستی، در طلب فزونی (المزید) گشایش ایجاد کن. و اگر گستردگی ممکنات (الممكنات) پایان‌پذیری را نمی‌پذیرد، پس گمانت درباره گستردگی الهی در آنچه بر او واجب است و آنچه از معرفت (المعرفة) به هر ممکنی می‌دهد، چیست؟ این معرفت نیز در عدم تناهی است. پس چگونه خواهد بود اگر به آن معرفت، چیزی اضافه شود که ممکنات هیچ تعلقی به آن ندارند، نه از جهت سلب و نه از جهت اثبات نسبت‌ها؟ پس اگر بنده رضایت (الرضی) را ترک کند، بر این حد آن را ترک می‌کند. او از حق راضی است نه از حق؛ زیرا رضایت از او، جهل به او و نقص است، در حالی که بنده کامل (الإنسان الکامل) بر صورت کمال آفریده شده است.\n\n[شایسته نیست که به هر مقضی (حکم رانده شده) راضی باشیم، بلکه به قضای حق (قضاء الله) در آنچه ما را در آن قرار داده است.]\n\nو اما سخن برخی از آنان که می‌گویند: «از شصت سال پیش یا هر زمان دیگری که خداوند مرا در امری قرار داد، آن را ناخوش داشتم.» مشایخ گفته‌اند که او به دوام رضایت اشاره کرده است و با این سخن بر ثبوت احوال (الأحوال) استدلال کرده‌اند، زیرا رضایت نزد آنان از احوال است. این امر از غیر معصوم و محفوظ (المحفوظ) صحیح نیست. شاید این گوینده از محفوظین یا معصومین بوده است. اگر چنین نبوده، منظورش رضایت به قضای حق (قضاء الله) در امری است که او را در آن قرار داده، نه به هر مقضی (حکم رانده شده)؛ زیرا شایسته نیست که به هر مقضی راضی باشی، حتی اگر وجه حق را در آن ببینی. اگر دیدگاهت در آن صحیح باشد، وجه حق را در آن می‌بینی در حالی که از آن راضی نیستی. اگر آن را با آن عین الهی (العین الإلهی) نبینی، پس آن را ندیده‌ای، حتی اگر به آن راضی باشی. و «وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ» (و برای بندگانش کفر را نمی‌پسندد) [الزمر: ۷]. پس از این حال (الحال) یا این مقام (المقام) برحذر باش، زیرا آن ناپایدار است و قدم‌ها بر آن استوار نمی‌ماند، چرا که در آن منازعه با حق (الحق) وجود دارد."
  },
  "page_count": 1
}