{
  "id": 107,
  "title": {
    "ar": "الباب السابع ومائة في ترك الجوع",
    "en": "Chapter 107: Concerning the Abandonment of Hunger",
    "ur": "باب ایک سو سات بھوک چھوڑنے کے بیان میں",
    "fa": "باب صد و هفتم در ترک گرسنگی (جوع)"
  },
  "content": {
    "ar": "### (الباب السابع ومائة في ترك الجوع)\n\n\n> الجوع بئس ضجيع العبد جاء به *** لفظ النبي فلا ترفع به رأسا\n\n\n> قد أدرك القوم في تعيينه غلط *** ولم يقيموا له وزنا وقسطاسا\n\n\n> من قال ما الجوع لم يعرف حقيقته *** وقد أضل بما قد قاله الناسا\n\n\n> جوع العوائد محمود ولست أرى *** فيما أراه من استعماله بأسا\n\n\n> جوع الطبيعة مذموم وليس يرى *** فيه المحقق بالرحمن إيناسا\n\n\n### [إعطاء النفس حقها من الغذاء]\n\n\nترك الجوع عند القوم ليس الشبع وإنما هو إعطاء النفس حقها من الغذاء الذي جعل الله به صلاح مزاجها وقوام بنيتها فإذا أحس صاحب هذه الحالة بالجوع فذلك جوع العادة\n\n\n### [لا يذم حال يعطى الفوائد]\n\n\nخرج أبو بكر البزار في مسنده أن النبي صَلَّى اللهُ عَليهِ وسَلَّم كان يتعوذ من الجوع ويقول إنه بئس الضجيع‏\n\n\nولا يذم حال يعطي الفوائد فدل أنه لا فائدة في مثل هذا الجوع وأن الفوائد فيما أظهر الشرع ميزانه من ذلك فترك الجوع عبادة وطريق موصلة إلى الله وبهذا فضل سلمان على أبي الدرداء وشهد له بذلك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن لنفسك عليك حقا ولعينك عليك حقا ولزورك عليك حقا ولأهلك عليك حقا فقم ونم وصم وأفطر وأعط كل ذي حق حقه‏\n\n\nفإنك لا تدخل على الحق أبدا ولا حد عليك حق وأعظم الحقوق حق الله ثم حق نفسك انتهى الجزء السابع والتسعون بانتهاء السفر الثالث عشر والحمد لله‏\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "### Chapter 107: Concerning the Abandonment of Hunger\n\nHunger is a wretched companion of the servant, as stated by the Prophet's own words, so do not hold it in high esteem.\nThe people have grasped an error in defining it, and they have not established for it a proper measure or scale.\nWhoever praises hunger has not known its reality, and he has misled the people by what he has said.\nThe hunger of custom (جوع العوائد) is praiseworthy, and I see no harm in its practice.\nThe hunger of nature (جوع الطبيعة) is blameworthy, and the one realized in The All-Merciful (الرحمن) finds no intimacy in it.\n\n### [Giving the Soul its Rightful Share of Sustenance]\n\nThe abandonment of hunger (ترك الجوع), according to the people [of realization], is not satiety; rather, it is giving the soul (النفس) its rightful share of the sustenance by which Allah has established the soundness of its temperament and the stability of its structure. Thus, when the possessor of this state feels hunger, that is the hunger of custom.\n\n### [A State that Yields Benefits is Not Blameworthy]\n\nAbu Bakr al-Bazzar recorded in his *Musnad* that the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) used to seek refuge from hunger and say, \"Indeed, it is a wretched companion.\"\n\nA state that yields benefits is not blameworthy. This indicates that there is no benefit in this kind of hunger, and that the benefits lie in what the Law (الشرع) has made manifest as its measure concerning this matter. Thus, the abandonment of hunger is an act of worship and a path leading to Allah.\n\nBy this, Salman was favored over Abu al-Darda, and the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) testified to this for him: <<Indeed, your soul (النفس) has a right over you, your eye has a right over you, your visitor has a right over you, and your family has a right over you. So stand [in prayer] and sleep, fast and break your fast, and give every possessor of a right his due.>>\n\nFor you will never enter upon The Real (الحق) unless you have fulfilled every right upon you. And the greatest of rights is the right of Allah, then the right of your soul (النفس).\n\nThe ninety-seventh Part (الجزء) concludes with the end of the thirteenth Volume (السفر), and praise belongs to Allah.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "(باب ایک سو سات: بھوک کو ترک کرنے کے بیان میں)\n\n> الجوع بئس ضجيع العبد جاء به *** لفظ النبي فلا ترفع به رأسا\n> بھوک بندے کا بدترین ہم بستر ہے، یہ بات نبی کے قول سے آئی ہے، لہٰذا اس پر فخر نہ کر۔\n\n> قد أدرك القوم في تعيينه غلط *** ولم يقيموا له وزنا وقسطاسا\n> قوم نے اس کی تعیین میں غلطی کی ہے، اور اسے کوئی وزن یا پیمانہ نہیں دیا۔\n\n> من قال ما الجوع لم يعرف حقيقته *** وقد أضل بما قد قاله الناسا\n> جس نے کہا کہ بھوک کیا ہے، اس نے اس کی حقیقت نہیں جانی، اور اس نے اپنے قول سے لوگوں کو گمراہ کیا۔\n\n> جوع العوائد محمود ولست أرى *** فيما أراه من استعماله بأسا\n> عادات کی بھوک (جوع العوائد) قابل تعریف ہے، اور میں اس کے استعمال میں کوئی حرج نہیں دیکھتا۔\n\n> جوع الطبيعة مذموم وليس يرى *** فيه المحقق بالرحمن إيناسا\n> طبعی بھوک (جوع الطبيعة) مذموم ہے، اور حقائق کا ادراک کرنے والا (المحقق) اس میں رحمن کی طرف سے کوئی انس نہیں پاتا۔\n\n### [نفس کو اس کا غذائی حق دینا]\n\nقوم کے نزدیک بھوک کو ترک کرنا سیر ہو جانا نہیں ہے، بلکہ یہ نفس کو اس غذا کا حق دینا ہے جس کے ذریعے اللہ نے اس کے مزاج کی درستی اور اس کی ساخت کی مضبوطی رکھی ہے۔ پس جب اس حالت کا حامل شخص بھوک محسوس کرتا ہے تو وہ عادات کی بھوک (جوع العادة) ہوتی ہے۔\n\n### [وہ حال مذموم نہیں جو فوائد عطا کرے]\n\nابوبکر البزار نے اپنی مسند میں روایت کیا ہے کہ نبی اکرم صَلَّى اللهُ عَليهِ وسَلَّم بھوک سے پناہ مانگا کرتے تھے اور فرماتے تھے:\n> إنه بئس الضجيع\n> \"بے شک یہ بدترین ہم بستر ہے۔\"\n\nاور وہ حال مذموم نہیں ہوتا جو فوائد عطا کرے، لہٰذا یہ اس بات کی دلیل ہے کہ ایسی بھوک میں کوئی فائدہ نہیں ہے، اور یہ کہ فوائد اس میں ہیں جس کا میزان شریعت نے ظاہر کیا ہے۔ پس بھوک کو ترک کرنا ایک عبادت اور اللہ تک پہنچانے والا راستہ ہے۔\n\nاور اسی وجہ سے سلمان (رضی اللہ عنہ) کو ابو الدرداء (رضی اللہ عنہ) پر فضیلت حاصل ہوئی، اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے اس کی گواہی دیتے ہوئے فرمایا:\n> إن لنفسك عليك حقا ولعينك عليك حقا ولزورك عليك حقا ولأهلك عليك حقا فقم ونم وصم وأفطر وأعط كل ذي حق حقه‏\n> \"بے شک تمہارے نفس کا تم پر حق ہے، اور تمہاری آنکھ کا تم پر حق ہے، اور تمہارے ملاقاتی کا تم پر حق ہے، اور تمہاری بیوی کا تم پر حق ہے۔ پس قیام کرو اور سوؤ، روزہ رکھو اور افطار کرو، اور ہر حقدار کو اس کا حق دو۔\"\n\nکیونکہ تم کبھی بھی ذات حق (الحق) پر داخل نہیں ہو سکتے جب تک کہ تم پر کسی کا حق باقی ہو۔ اور حقوق میں سب سے بڑا حق اللہ کا حق ہے، پھر تمہارے نفس کا حق ہے۔ ستانوےواں جزء تیرہویں سفر کے اختتام پر مکمل ہوا، اور تمام تعریفیں اللہ کے لیے ہیں۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "باب صد و هفتم در ترک گرسنگی (جوع)\n\nگرسنگی بدترین هم‌خوابه بنده است، این سخن را *** کلام پیامبر آورده، پس به آن اعتنا مکن.\n\nگروهی در تعریف آن دچار اشتباه شده‌اند *** و برای آن وزن و معیاری قائل نشده‌اند.\n\nهر کس بگوید گرسنگی چیست، حقیقت آن را نشناخته است *** و با آنچه گفته، مردم را گمراه کرده است.\n\nگرسنگی عادات (جوع العوائد) ستوده است و من در آنچه می‌بینم *** در به کار بردن آن اشکالی نمی‌بینم.\n\nگرسنگی طبیعت (جوع الطبيعة) نکوهیده است و محقق (المحقق) به حق (الرحمن) *** در آن هیچ اُنس و آرامشی نمی‌بیند.\n\n[دادن حق نفس از غذا]\n\nترک گرسنگی (جوع) نزد این گروه (صوفیان) به معنای سیری نیست، بلکه عبارت است از دادن حق نفس از غذایی که خداوند صلاح مزاج و قوام ساختار بدنی آن را در آن قرار داده است. پس اگر صاحب این حال احساس گرسنگی کند، آن گرسنگی، گرسنگیِ عادت (جوع العادة) است.\n\n[حالی که فواید می‌دهد، نکوهیده نیست]\n\nابوبکر بزار در مسند خود روایت کرده است که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از گرسنگی پناه می‌برد و می‌فرمود: «همانا آن بدترین هم‌خوابه است.»\n\nو حالی که فواید می‌دهد، نکوهیده نیست. پس این دلالت دارد که در چنین گرسنگی‌ای فایده‌ای نیست و فواید در آن چیزی است که شریعت میزان آن را آشکار کرده است. بنابراین، ترک گرسنگی (جوع) یک عبادت و راهی است که به سوی حق (الحق) می‌رساند. به همین دلیل بود که سلمان بر ابودرداء برتری یافت و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با این سخن برای او شهادت داد: «همانا نفس تو بر تو حقی دارد، و چشمت بر تو حقی دارد، و مهمانت بر تو حقی دارد، و خانواده‌ات بر تو حقی دارد. پس برخیز و بخواب، روزه بگیر و افطار کن، و حق هر صاحب حقی را به او بده.»\n\nزیرا تو هرگز بر حق (الحق) وارد نمی‌شوی مگر آنکه حقی بر تو باشد. و بزرگترین حقوق، حق خداوند است و سپس حق نفس تو. جزء نود و هفتم با پایان یافتن سفر سیزدهم به اتمام رسید و حمد از آن خداوند است. (بسم الله الرحمن الرحیم)"
  },
  "page_count": 2
}