{
  "id": 67,
  "title": {
    "ar": "الباب السابع والستون في معرفة لا إله إلا الله محمد رسول الله وهو الايمان",
    "en": "Chapter Sixty-Seven: Concerning the Gnosis (معرفة) of \"There is no god but Allah, Muhammad is the Messenger of Allah,\" which is Faith (الإيمان).",
    "ur": "باب سڑسٹھواں: لا إله إلا الله محمد رسول الله کی معرفت (المعرفۃ) کے بیان میں، اور یہی ایمان (الإيمان) ہے۔",
    "fa": "باب شصت و هفتم در معرفتِ «لا إله إلا الله محمد رسول الله» و آن ایمان است"
  },
  "content": {
    "ar": "## (الباب السابع والستون في معرفة لا إله إلا الله محمد رسول الله وهو الايمان)\n\n\n> شهد الله لم يزل أزلا *** أنه لا إله إلا هو الله‏\n\n\n> ثم أملاكه بذا شهدت *** أنه لا إله إلا هو الله‏\n\n\n> وأولو العلم كلهم شهدوا *** أنه لا إله إلا هو الله‏\n\n\n> ثم قال الرسول قولوا معي *** إنه لا إله إلا هو الله‏\n\n\n> أفضل ما قلته وقال به *** من قبلنا لا إله إلا هو الله‏\n\n\n> ما عدا الإنس كلهم شهدوا *** أنه لا إله إلا هو الله‏\n\n\n### [التوحيد من طريق العلم والتوحيد من طريق الخير]\n\n\nقال الله جل ثناؤه في كتابه العزيز شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ قائِماً بِالْقِسْطِ لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ ثم قال إِنَّ الدِّينَ عِنْدَ الله الْإِسْلامُ وقال رسول الله صلى الله عليه وسلم الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله‏\n\n\nالحديث فقال سبحانه وأُولُوا الْعِلْمِ لم يقل وأولو الايمان فإن شهادته بالتوحيد لنفسه ما هي عن خبر فيكون إيمانا ولهذا الشاهد فيما يشهد به لا يكون إلا عن علم وإلا فلا تصح شهادته ثم إنه عز وجل عطف الملائكة وأولي العلم على نفسه بالواو وهو حرف يعطي الاشتراك ولا اشتراك هنا إلا في الشهادة قطعا ثم أضافهم إلى العلم لا إلى الايمان فعلمنا أنه أراد من حصل له التوحيد من طريق العلم النظري أو الضروري لا من طريق الخبر كأنه يقول‏\nوشهدت الملائكة بتوحيدي بالعلم الضروري من التجلي الذي أفادهم العلم وقام لهم مقام النظر الصحيح في الأدلة فشهدت لي بالتوحيد كما شهدت لنفسي وأولو العلم بالنظر العقلي الذي جعلته في عبادي ثم جاء بالإيمان بعد ذلك في الرتبة الثانية من العلماء وهو الذي يعول عليه في السعادة فإن الله به أمر وسميناه علما لكون المخبر هو الله فقال فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله وقال تعالى ولِيَعْلَمُوا أَنَّما هُوَ إِلهٌ واحِدٌ حين قسم المراتب في آخر سورة إبراهيم من القرآن العزيز وقال رسول الله صلى الله عليه وسلم في الصحيح من أمات وهو يعلم أنه لا إله إلا الله دخل الجنة\n\n\nولم يقل هنا يؤمن فإن الايمان موقوف على الخبر وقد قال وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا\n\n\n### [توحيد أهل الفترة]\n\n\nوقد علمنا أن لله عبادا كانوا في فترات وهم موحدون علما وما كانت دعوة الرسل قبل رسول الله صلى الله عليه وسلم عامة فيلزم أهل كل زمان الايمان فعم بهذا الكلام جميع العلماء بتوحيد الله المؤمن منهم من حيث ما هو عالم به من جهة الخبر الصدق الذي يفيد العلم لا من جهة الايمان وغير المؤمن فالإيمان لا يصح وجوده إلا بعد مجي‏ء الرسول والرسول لا يثبت حتى يعلم الناظر العاقل أن ثم إلها وأن ذاك الإله واحد لا بد من ذلك لأن الرسول من جنس من أرسل إليهم فلا يختص واحد من الجنس دون غيره إلا لعدم المعارض وهو الشريك فلا بد أن يكون عالما بتوحيد من أرسله وهو الله تعالى ولا بد أن يتقدمه العلم بأن هذا الإله هو على صفة يمكن أن يبعث رسولا بنسبة خاصة ما هي ذاته وحينئذ ينظر في صدق دعوى هذا الرسول أنه رسول من عند الله لامكان ذلك عنده‏\n\n\n### [مرتبة العالم بتوحيد الله من حيث الدليل‏]\n\n\nوهذه في العلم مراتب معقولة يتوقف العلم ببعضها على بعض وليس هذا كله حظ المؤمن فإن مرتبة الايمان وهو التصديق بأن هذا رسول من عند الله لا تكون إلا بعد حصول هذا العلم الذي ذكرناه فإذا جاءت الدلالات على صدقه بأنه رسول الله لا بتوحيد مرسله حينئذ نتأهب العقلاء أولو الألباب والأحلام والنهى لما يورده في رسالته هذا الرسول فأول شي‏ء قال في رسالته إن الله الذي أرسلني بقول لكم قولوا لا إله إلا الله فعلم أولو الألباب أن العالم بتوحيد الله لا يلزمه أن يتلفظ به فلما سمع من الرسول الأمر بالتلفظ به وأن ذلك ليس من مدلول دليل العلم بتوحيد الله تلفظ به هذا العالم الموحد إيمانا وتصديقا بهذا الرسول فإذا قال العالم لا إله إلا الله لقول رسول الله صلى الله عليه وسلم له قل لا إله إلا الله عن أمر الله سمي مؤمنا فإن الرسول أوجب عليه أن يقولها وقد كان في نفسه عالما بها ومخيرا في نفسه في التلفظ بها وعدم التلفظ بها فهذه مرتبة العالم بتوحيد الله من حيث الدليل فمن مات وهو يعلم أنه لا إله إلا الله دخل الجنة بلا شك ولا ريب وهو من السعداء فأما من كان في الفترات فيبعثه الله أمة وحده كقُسِّ بن ساعدة لا تابع لأنه ليس بمؤمن ولا هو متبوع لأنه ليس برسول من عند الله بل هو عالم بالله وبما علم من الكوائن الحادثة في العالم بأي وجه علمها وليس لمخلوق أن يشرع ما لم يأذن به الله ولا أن يوجب وقوع ممكن من عالم الغيب يجوز خلافه في دليله على جهة القربة إلى الله إلا بوحي من الله وأخبار\n\n\n### [بروج الفلك ومنازله وسباخة كواكبه أدلة على حكم ما يجريه الله في عالمى الطبيعة والعناصر]\n\n\nوهنا نكت لمن له قلب وفطنة لقوله تعالى وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها وقوله إنه أودع اللوح المحفوظ جميع ما يجريه في خلقه إلى يوم القيامة ومما أوحى الله في سماواته وأودعه في لوحه بعثة الرسل فتؤخذ من اللوح كشفا واطلاعا وتؤخذ من السماء نظرا واختبارا وعلمهم ببعثة الرسل علمهم بما يجيئون به من القربات إلى الله وبأزمانهم وأمكنتهم وحلاهم وما يكون من الناس بعد الموت وما يكون منهم في البعث والحشر ومآلهم إلى السعادة والشقاء من جنة ونار وأن الله جعل بروج الفلك ومنازله وسباحة كواكبه أدلة على حكم ما يجريه الله في العالم الطبيعي والعنصري من حر وبرد ويبس ورطوبة في حار وبارد ورطب ويابس فمنها ما يقتضي وجود الأجسام في حركات معلومة ومنها ما يقتضي وجود الأرواح ومنها ما يقتضي بقاء مدة السموات وهو العلم الذي أشار إليه أبو طالب المكي من أن الفلك يدور بأنفاس العالم ومع رؤيتهم لذلك كله هم فيه متفاضلون بعضهم على بعض فمنهم الكامل المحقق المدقق ومنهم من ينزل عن درجته بالتفاضل في النزول وقد رأينا جماعة من أصحاب خط الرمل والعلماء بتقادير حركات الأفلاك وتسيير كواكبها والاقترانات ومقاديرها ومنازل اقتراناتها وما يحدث الله عند ذلك من الحكم في خلقه كالأسباب المعتادة في العامة التي لا يجهلها أحد ولا يكفر القائل بها فهذه أيضا معتادة عند العلماء بها فإنها تعطي بحسب تأليف طباعها مما لا يعطيه حالها في غير اقترانها بغيرها فيخبرون بأمور جزئية تقع على حد ما أخبروا به وإن كان‏\nذلك الأمر واقعا بحكم الاتفاق بالنظر إليه وإن كان علما في نفس الأمر فإن الناظر فيه ما هو على يقين وإن قطع به في نفسه لغموض الأمر فما يصح أن يكون مع الإنصاف على يقين من نفسه أنه ما فاتته دقيقة في نظره ولا فات لمن مهد له السبيل قبله من غير نبي يخبر عن الله فإن المتأخر على حساب المتقدم يعتمد فلما رأينا ذلك علمنا أن لله أسرارا في خلقه ومن حصل في هذه المرتبة من العلم لم يكن أحد أقوى في الايمان منه بما جاءت به الرسل وما جاء به رسول الله صلى الله عليه وسلم من عند الله إلا من يدعو إِلَى الله عَلى‏ بَصِيرَةٍ كالرسول وأتباعه وإن كلامنا في المفاضلة إنما هو بين هؤلاء وبين المؤمنين أهل التقليد لا بين الرسل وأولياء الله وخاصته الذين تولى الله تعليمهم فأتاهم رحمة من عنده وعلمهم من لدنه علما فهم فيما علموه بحكم القطع لا بحكم الاتفاق‏\n\n\n### [علم الخط نبي بعث به قبل هو إدريس‏]\n\n\nيقول رسول الله صلى الله عليه وسلم في علم الخط إن نبيا من الأنبياء بعث به قيل هو إدريس عليه السلام فأوحى الله إليه في تلك الأشكال التي أقامها الله له مقام الملك لغيره‏\n\n\nوكما يجي‏ء الملك من غير قصد من النبي لمجيئه كذلك يجي‏ء شكل الخط من غير قصد الضارب صاحب الخط إليه وهذه هي الأمهات خاصة ثم شرع له أن يشرع وهي السنة التي يرى الرسول أن يضعها في العالم وأصلها الوحي كذلك ما يولد صاحب الخط عن الأمهات من الأولاد وأولاد الأولاد فتفصح له تلك الأشكال عن الأمر المطلوب على ما هو عليه والضمير فيه كالنية في العمل فلا يخطئ قال عليه السلام في العلماء العالمين بالخط فمن وافق خطه يعني خط ذلك النبي فذاك يقول فقد أصاب الحق فهذا مثل من يدعو إِلَى الله عَلى‏ بَصِيرَةٍ من اتباع الرسل فقوله فإن وافق فما جعله علما عنده لكونه لا يقطع به وإن كان علما في نفس الأمر فهذا الفرق بين هؤلاء وبين من يدعو إِلَى الله عَلى‏ بَصِيرَةٍ ومن هو عَلى‏ بَيِّنَةٍ من رَبِّهِ فاعلم العلماء بالله بعد ملائكة الله رسل الله وأولياؤه ثم العلماء بالأدلة ومن دونهم وإن وافق العلم في نفس الأمر فليس هو عند نفسه بعالم للتردد الإمكانى الذي يجده في نفسه المنصف فما هو مؤمن إلا بما جاء في كتاب الله على التعيين وما جاء عن رسوله على الجملة لا على التفصيل إلا ما حصل له من ذلك تواترا ولهذا قيل للمؤمنين آمِنُوا بِاللَّهِ ورَسُولِهِ فقد بانت لك مراتب الخلق في العلم بالله‏\n\n\n### [الرسول معلم في التوحيد للعالم بالله والجاهل به‏]\n\n\nفإذا جاء الرسول وبين يديه العلماء بالله وغير العلماء بالله وقال للجميع قولوا لا إله إلا الله‏\n\n\nعلمنا على القطع أنه صلى الله عليه وسلم في ذلك القول معلم لمن لا علم له بتوحيد الله من المشركين وعلمنا أنه في ذلك القول أيضا معلم للعلماء بالله وتوحيده إن التلفظ به واجب وأنه العاصم لهم من سفك دمائهم وأخذ أموالهم وسبي ذراريهم ولهذا\n\n\nقال رسول الله صلى الله عليه وسلم أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحق الإسلام وحسابهم على الله‏\n\n\nولم يقل حتى يعلموا فإن فيهم العلماء فالحكم هنا للقول لا للعلم والحكم يَوْمَ تُبْلَى السَّرائِرُ في هذا للعلم لا للقول فقالها هنا العالم والمؤمن والمنافق الذي ليس بعالم ولا مؤمن فإذا قالوا هذه الكلمة عصموا دماءهم وأموالهم إلا بحقها في الدنيا والآخرة وحسابهم على الله في الآخرة من أجل المنافق ومن ترتب عليه حق لأحد فلم يؤخذ منه وأما في الدنيا فمن أجل الحدود الموضوعة فإن قول لا إله إلا الله لا يسقطها في الدنيا ولا في الآخرة وأما حسابهم على الله في الآخرة يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ فيعلمون بقرينة الحال أنه سؤال واستفهام عن إجابتهم بالقلوب فيقولون لا عِلْمَ لَنا أي لم نطلع على القلوب إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ تأكيد وتأييد لما ذكرنا\n\n\n### [أركان الإسلام الخمس‏]\n\n\nثم قال صلى الله عليه وسلم من اسمه الملك بنى الإسلام على خمس فصيره ملكا شهادة أن لا إله إلا الله وهي القلب وأن محمدا رسول الله حاجب الباب وإقام الصلاة المجنبة اليمنى وإيتاء الزكاة المجنبة اليسرى وصيام رمضان التقدمة والحج الساقة وربما كانت الصلاة التقدمة لكونها نورا فهي تحجب الملك‏\n\n\nوقد ورد في الخبر أن حجابه النور وتكون الزكاة الميمنة\n\n\nلأنها إنفاق يحتاج إلى قوة لإخراج ما كان يملكه عن ملكه ويكون الحج الميسرة لما فيه من الإنفاق والقرابين حيث تجتمع بالزكاة في الصدقة والهدية وكلاهما من أعمال الأيدي ويكون الصوم في الساقة فإن الخلف نظير الأمام وهو ضياء فإن الصبر ضياء يريد الصوم والضياء من النور فهو أولى بالساقة للموازنة فإن الآخر يمشي على أثر الأول وهكذا يكون الايمان الإلهي يوم القيامة فيأتي الايمان يوم القيامة في صورة ملك على هذه الصفة فأهل لا إله إلا الله في القلب وأهل الصلاة في التقدمة وأهل الزكاة وهي الصدقة في الميمنة وأهل الحج في الميسرة وأهل الصيام في الساقة جعلنا الله ممن قام بناء بيته على هذه القواعد\nفكان بيته الايمان وحده من القبلة الصلاة ومن الشمال الصوم ومن الغرب صدقة السر ومن الشرق الحج فلقد سعد ساكنه‏\n\n\n### [أفضل كلمة قالتها الأنبياء]\n\n\nواعلم أن لا إله إلا الله كلمة نفي وإثبات وهي أفضل كلمة قالتها الأنبياء\n\n\nقال رسول الله صلى الله عليه وسلم أفضل الدعاء دعاء يوم عرفة فيه إشارة لدعاء العارفين بالله وأفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله‏\n\n\nوهو حديث صحيح رواية ومعنى فالنفي لا بد أن يرد على ثابت فينفيه فإنه إن ورد النفي على ما ليس بثابت وهو النفي أثبته لأن ورود النفي على النفي إثبات كما إن عدم العدم وجود فما نفى هذا النافي بقوله لا إله أخبرونا فقد استفهمناكم والمثبت أيضا هل حكمه حكم المنفي من أنه لا يثبت إلا المنفي أو حكمه حكم آخر يتميز به عن حكم النفي فأي شي‏ء نفى هذا النافي وأي شي‏ء أثبت هذا المثبت هذا كله لا بد من تحقيقه إن شاء الله فاعلم إن النفي ورد على أعيان من المخلوقات لما وصفت بالألوهية ونسبت إليها وقيل فيها آلهة ولهذا تعجب من تعجب من المشركين لما دعاهم رسول الله صلى الله عليه وسلم إلى الله الواحد فأخبرنا الله عنه أنه قال أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ فسموها آلهة وهي ليست بهذه الصفة فورد حكم النفي على هذه النسبة الثابتة عندهم إليها لا في نفس الأمر لا على نفي الألوهية لأنه لو نفى النفي لكان عين الإثبات لما زعمه المشرك فكأنه يقول للمشرك هذا القول الذي قلت لا يصح أي ما هو الأمر كما زعمت ولا بد من إله وقد انتفت الكثرة من الآلهة بحرف الإيجاب الذي هو قوله إلا وأوجبوا هذه النسبة إلى المذكور بعد حرف الإيجاب وهو مسمى الله فقالوا لا إله إلا الله فلم تثبت نسبة الألوهة لله بإثبات المثبت لأنه سبحانه إله لنفسه فأثبت المثبت بقوله إلا الله هذا الأمر في نفس من لم يكن يعتقد انفراده سبحانه بهذا الوصف فإن ثبت الثبت محال وليس نفي المنفي بمحال فعلى الحقيقة ما عبد المشرك إلا الله لأنه لو لم يعتقد الألوهة في الشريك ما عبده وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ ولذلك غار الحق لهذا الوصف فعاقبهم في الدنيا إذ لم يحترموه ورزقهم وسمع دعاءهم وأجابهم إذا سألوا إلههم في زعمهم لعلمه سبحانه أنهم ما لجئوا إلا لهذه المرتبة وإن أخطئوا في النسبة فشقوا في الآخرة شقاء الأبد حيث نبههم الرسول على توحيد من تجب له هذه النسبة فلم ينظروا ولا نصحوا نفوسهم ولهذا كانت دلالة كل رسول بحسب ما كان الغالب على أهل زمانه لتقوم عليهم الحجة فتكون لله الحجة البالغة\n\n\n### [أصناف القائلين بكلمة التوحيد ومراتبهم‏]\n\n\nفعمت هذه الكلمة مرتبة العدم والوجود فلم تبق مرتبة إلا وهي داخلة تحت النفي والإثبات فلها الشمول فمن قائل لا إله إلا الله بنفسه ومن قائل لا إله إلا الله بنعته ومن قائل لا إله إلا الله بربه ومن قائل لا إله إلا الله بنعت ربه ومن قائل لا إله إلا الله بحاله ومن قائل لا إله إلا الله بحكمه وهو المؤمن خاصة والخمسة الباقون ما لهم في الايمان مدخل أما من قال لا إله إلا الله بنفسه فهو الذي قالها من تجليه لنفسه فرأى استفادة وجوده من غيره فأعطته رؤية نفسه أن يقول لا إله إلا الله وهو التوحيد الذاتي الذي أشارت إليه طائفة من المحققين وأما القائل لا إله إلا الله بنعته فهو الذي وحده بعلمه فإن نعته العلم بتوحيد الله وأحديته فنطقه علمه والفرق بينه وبين الأول أن الأول عن شهود وهذا الثاني عن وجود والوجود قد يكون عن شهود وقد لا يكون وأما القائل لا إله إلا الله بربه فهو الذي رأى أن الحق عين الوجود لا أمر آخر وأن اتصاف الممكنات بالوجود هو ظهور الحق لنفسه بأعيانها وذلك أن استفادتها الوجود لها من الله إنما هو من حيث وجوده فإن الوجود المستفاد وهو الظاهر وهو عين الحكم به على هذه الأعيان فقال لا إله إلا الله بربه وأما القائل لا إله إلا الله بنعت ربه فإنه رأى أن الحق سبحانه من حيث أحديته وذاته ما هو مسمى الله والرب فإنه لا يقبل الإضافة ورأى أن مسمى الرب يقتضي المربوب ومسمى الله يطلب المألوه ورأى أنهم لما استفادوا منه الوجود ثبت له اسم الرب إذ كان المربوب يطلبه فالمربوب أصل في ثبوت الاسم الرب ووجود الحق أصل في وجود الممكنات ورأى أن لا إله إلا الله لا تطلبه عين الذات فقال لا إله إلا الله بنعت الرب الذي نعته به المربوب فالعلم بنا أصل في علمنا به‏\n\n\nيقول عليه السلام من عرف نفسه عرف ربه‏\n\n\nفوجودنا موقوف على وجوده والعلم به موقوف على العلم بنا فهو أصل في وجه ونحن أصل في وجه وأما القائل لا إله إلا الله بحاله فهو الذي يستند في أموره إلى غير الله فإذا لم يتفق له حصول ما طلب تحصيله ممن استند إليه وسدت الأبواب في وجهه من جميع الجهات رجع إلى الله اضطرارا فقال لا إله إلا الله بحاله وهؤلاء الأصناف كلهم لا يتصفون بالإيمان لأنه ما فيهم من قالها عن تقليد وأما من قال لا إله إلا الله بحكمه فهو الذي قالها لقول الشارع حيث‏\nأوجب عليه أن يقولها وحكم عليه أن يقولها ولو لا هذا الحكم ما قالها على جهة القربة إلى الله وربما لو قالها قالها معلما أو معلما\n\n\n### [الاسم الجامع المنعوت بجميع الأسماء]\n\n\nدخلت على شيخنا أبي العباس العريبي من أهل العليا وكان مستهترا بذكر الاسم الله لا يزيد عليه شيئا فقلت له يا سيدي لم لا تقول لا إله إلا الله فقال لي يا ولدي الأنفاس بيد الله ما هي بيدي فأخاف أن يقبض الله روحي عند ما قول لا له فأقبض في وحشة النفي وسألت شيخنا آخر عن ذلك فقال لي ما رأت عيني ولا سمعت أذني من يقول أنا الله غير الله فلم أجد من أنفى فأقول كما سمعته يقول الله الله وإنما تعبدنا بهذا الاسم في التوحيد لأنه الاسم الجامع المنعوت بجميع الأسماء الإلهية وما نقل إنه وقعت من أحد من المعبودين فيه مشاركة بخلاف غيره من الأسماء مثل إله وغيره وبهذا القدر من القول إذا قيل لقول الشارع يثبت الايمان وإنما قال الشارع حتى يقولوا لا إله إلا الله ولم يقل محمد رسول الله لتضمن هذه الشهادة بالتوحيد الشهادة بالرسالة فإن القائل لا إله إلا الله لا يكون مؤمنا إلا إذا قالها لقول رسول الله صلى الله عليه وسلم فإذا قالها لقوله فهو عين إثبات رسالته فلما تضمنت هذه الكلمة الخاصة الشهادة بالرسالة لهذا لم يقل قولوا محمد رسول الله وقال في غير القول وهو الايمان والايمان معنى من المعاني ما هو مما يدرك بالحس فقرن بالإيمان بالله الايمان به وبما جاء به يعني من عنده مما له أن يشرعه من غير نقل عن الله‏\n\n\nفقال في حديث ابن عمر لما ذكر الايمان بالله وبالصلاة والزكاة والحج والصوم وكل هذا جاء من عند الله قال في حديث ابن عمر أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ويؤمنوا بي وبما جئت به‏\n\n\nمن أجل المنافق المقلد فإنه يقولها من غير إيمان بقلبه ولا اعتقاد والجاحد المنافق يقولها لا لقوله مع علمه بأنه رسول الله من كتابه لا من دليله العقلي‏\n\n\n### [التوحيد العقلي والتوحيد الشرعي‏]\n\n\nواعلم أن التلفظ بشهادة الرسالة المقرونة بشهادة التوحيد فيه سر إلهي عرفنا به الحق سبحانه وهو أن الإله الواحد الذي جاء بوصفه ونعته الشارع ما هو التوحيد الإلهي الذي أدركه العقل فإن ذلك لا يقبل اقتران الشهادة بالرسالة مع الشهادة بالتوحيد فهذا التوحيد من حيث ما يعلمه الشارع ما هو التوحيد من حيث ما أثبته النظر العقلي وإذا كان الإله الذي دعانا الشرع إلى عبادته وتوحيده إنما هو في رتبة كونه إلها لا في ذاته صح أن تنعته بما نعته به من النزول والاستواء والمعية والتردد والتدبر وما أشبه ذلك من الصفات التي لا يقبلها توحيد العقل المحض المجرد عن الشرع فهذا المعبود ينبغي أن تقرن شهادة الرسول برسالته بشهادة توحيد مرسله ولهذا يضاف إليه فيقال أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله كل يوم ثلاثين مرة في أذان الخمس الصلوات وفي الإقامة والمتلفظون بهذه الشهادة الرسالية التفصيل فيهم كالتفصيل في شهادة التوحيد فلنمش بها على ذلك الأسلوب من المراتب‏\n\n\n### [السنة والبدعة]\n\n\nوفي الايمان بالله وبرسوله الايمان بكل ما جاء به من عند الله ومن عنده مما سنه وشرعه ويدخل فيما سنه الايمان بسنة من سن سنة حسنة فاستمر الشرع وحدوث العبادة المرغب فيها مما لا ينسخ حكما ثابتا إلى يوم القيامة وهذا الحكم خاص بهذه الأمة وأعني بالحكم تسميتها سنة تشريفا لهذه الأمة وكانت في حق غيرهم من الأمم السالفة تسمى رهبانية قال تعالى ورَهْبانِيَّةً ابْتَدَعُوها فمن قال بدعة في هذه الأمة مما سماها الشارع سنة فما أصاب السنة إلا أن يكون ما بلغه ذلك والاتباع أولى من الابتداع والفرق بين الاتباع والابتداع معقول ولهذا جنح الشارع إلى تسميتها سنة وما سماها بدعة لأن الابتداع إظهار أمر على غير مثال هذا أصله ولهذا قال الحق تعالى عن نفسه بَدِيعُ السَّماواتِ والْأَرْضِ أي موجدها على غير مثال سبق فلو شرع الإنسان اليوم أمرا لا أصل له في الشرع لكان ذلك إبداعا ولم يكن يسوغ لنا الأخذ به فعدل الشارع عن لفظ الابتداع إلى لفظ السنة إذ كانت السنة مشروعة وقد شرع الله لمحمد صلى الله عليه وسلم الاقتداء يهدي الأنبياء عليهم السلام والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الثلاثون‏\n\n",
    "en": "## Chapter Sixty-Seven: Concerning the Gnosis (معرفة) of *La ilaha illa Allah Muhammad Rasul Allah* (There is no god but Allah, Muhammad is the Messenger of Allah), which is Faith (الإيمان)\n\n> Allah bore witness eternally, without beginning,\n> That there is no god but He, Allah.\n>\n> Then His angels bore witness to this,\n> That there is no god but He, Allah.\n>\n> And all those possessed of Knowledge (أولو العلم) bore witness,\n> That there is no god but He, Allah.\n>\n> Then the Messenger said: \"Say with me,\n> Indeed, there is no god but He, Allah.\"\n>\n> The best thing I have said, and that was said by\n> Those before us, is: \"There is no god but He, Allah.\"\n>\n> All creatures, save mankind, bore witness,\n> That there is no god but He, Allah.\n\n### [Unity (التوحيد) through the Path of Knowledge (العلم) and Unity through the Path of Report (الخبر)]\n\nAllah, exalted is His praise, said in His Glorious Book: <<شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ قائِماً بِالْقِسْطِ لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (Allah bears witness that there is no god but He, and the angels, and those possessed of Knowledge, maintaining justice. There is no god but He, the All-Mighty, the All-Wise). Then He said: <<إِنَّ الدِّينَ عِنْدَ الله الْإِسْلامُ>> (Indeed, the religion with Allah is Islam). And the Messenger of Allah, peace and blessings be upon him, said: \"Islam is that you bear witness that there is no god but Allah and that Muhammad is the Messenger of Allah.\"\n\nThe Exalted said: \"and those possessed of Knowledge (وأُولُوا الْعِلْمِ),\" He did not say \"and those possessed of Faith (أولو الايمان).\" This is because His testimony to His own Unity (التوحيد) is not based on report (خبر), which would constitute faith (إيمان). For this reason, the witness (الشاهد) in what he testifies to must be based only on Knowledge (علم); otherwise, his testimony is invalid. Furthermore, He, the Exalted, coupled the angels and those possessed of Knowledge with Himself using the conjunction *waw* (و), which denotes partnership. There is no partnership here except in the testimony, definitively. Then He attributed them to Knowledge (العلم), not to Faith (الإيمان). Thus, we know that He intended those who attained Unity through the path of theoretical (النظري) or necessary (الضروري) Knowledge, not through the path of report. It is as if He is saying:\n\nThe angels bore witness to My Unity through necessary Knowledge derived from the Theophany (التجلي) that granted them Knowledge and stood for them in place of sound rational investigation (النظر الصحيح) into the proofs. So they bore witness to My Unity just as I bore witness to Myself. And those possessed of Knowledge bore witness through the rational investigation (النظر العقلي) that I placed in My servants.\n\nFaith (الإيمان) then came after that, in the second rank of the knowledgeable ones, and it is what is relied upon for felicity (السعادة), for Allah commanded it. We call it Knowledge (علماً) because the Informer is Allah, as He said: <<فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله>> (So know that there is no god but Allah). And He, the Exalted, said: <<وَلِيَعْلَمُوا أَنَّما هُوَ إِلهٌ واحِدٌ>> (And that they may know that He is but one God), when He divided the Levels (المراتب) at the end of the Glorious Quran’s Surah Ibrahim. The Messenger of Allah, peace and blessings be upon him, said in the *Sahih* collection: \"Whoever dies knowing (يعلم) that there is no god but Allah shall enter Paradise.\"\n\nHe did not say \"believing (يؤمن)\" here, for faith is dependent upon report. And He has said: <<وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا>> (And We would never punish until We have sent a Messenger).\n\n### [The Unity (توحيد) of the People of the Interval (أهل الفترة)]\n\nWe know that Allah has servants who lived during intervals (فترات) [between prophets] and who were Unitarians (موحدون) by way of Knowledge. The call of the Messengers before the Messenger of Allah, peace and blessings be upon him, was not universal, such that the people of every time period were obligated to have faith. Therefore, this statement encompasses all those who possess Knowledge of Allah’s Unity, whether they are believers (insofar as they know it through the truthful report that yields Knowledge, not merely through faith) or non-believers.\n\nFaith cannot properly exist except after the arrival of the Messenger. And the Messenger cannot be established until the rational investigator (الناظر العاقل) knows that there is a God, and that this God is One—this is necessary. This is because the Messenger is of the same genus as those to whom he is sent, and no one member of the genus is distinguished above another except by the absence of an opponent, which is the partner (الشريك). Therefore, he must be knowledgeable of the Unity of the One who sent him, which is Allah the Exalted. And the Knowledge must precede that this God possesses an attribute that makes it possible for Him to send a Messenger, by a specific relationship that is not His Essence (ذاته). At that point, he investigates the truthfulness of the Messenger’s claim that he is a Messenger from God, given the possibility of that claim in his view.\n\n### [The Rank of the One Knowledgeable of God’s Unity by Proof (الدليل)]\n\nThese are intelligible Levels (مراتب معقولة) in Knowledge, where the Knowledge of one depends on the Knowledge of another. All of this is not the portion of the believer. The rank of Faith—which is the affirmation (التصديق) that this is a Messenger from God—only occurs after the attainment of the Knowledge we have mentioned.\n\nWhen the proofs (الدلالات) arrive confirming his truthfulness as the Messenger of Allah (not confirming the Unity of the One who sent him), then the rational ones (العقلاء), those possessed of intellects (أولو الألباب) and understanding, prepare themselves for what this Messenger brings in his message. The first thing he said in his message was that the God who sent me commands you to say: *La ilaha illa Allah*.\n\nThose possessed of intellects knew that the one who possesses Knowledge of God’s Unity is not obligated to utter it. But when he heard the command from the Messenger to utter it, and that this utterance was not implied by the proof of the Knowledge of God’s Unity, this knowledgeable Unitarian (العالم الموحد) uttered it out of faith and affirmation of this Messenger. Thus, if the knowledgeable person says *La ilaha illa Allah* because the Messenger of Allah, peace and blessings be upon him, commanded him to say it, based on Allah’s command, he is called a believer (مؤمنا). For the Messenger obligated him to say it, even though he was already knowledgeable of it internally and had the choice internally whether or not to utter it.\n\nThis is the rank of the one who knows God’s Unity based on proof. Whoever dies knowing that there is no god but Allah shall enter Paradise without doubt or uncertainty, and he is among the felicitous (السعداء). As for those who were in the intervals, Allah will resurrect them as a nation unto themselves, like Quss ibn Sa'idah, not as a follower (تابع) because he is not a believer, nor as a leader (متبوع) because he is not a Messenger from God. Rather, he is knowledgeable of Allah and of the contingent events (الكوائن الحادثة) in the World (العالم), however he came to know them. It is not permissible for a creature to legislate (يشرع) what Allah has not permitted, nor to obligate the occurrence of a possible thing from the unseen world (عالم الغيب) whose opposite is permissible according to his proof, for the purpose of drawing near (القربة) to Allah, except through revelation (وحي) from Allah and reports (أخبار).\n\n### [The Zodiacal Signs, Lunar Mansions, and Orbiting of the Stars as Proofs of the Decree that Allah Executes in the Natural and Elemental Worlds]\n\nHere is a subtle point (نكت) for the one who possesses a heart and insight (فطنة), concerning His saying, the Exalted: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command). And His saying that He deposited in the Preserved Tablet (اللوح المحفوظ) everything He executes in His creation until the Day of Resurrection.\n\nAmong what Allah revealed in His heavens and deposited in His Tablet is the sending of Messengers (بعثة الرسل). This is taken from the Tablet through unveiling (كشفا) and observation (اطلاعاً), and it is taken from the heaven through investigation (نظراً) and testing (اختباراً). Their Knowledge of the sending of Messengers includes their Knowledge of the acts of drawing near (القربات) to Allah that the Messengers will bring, their times, their places, their characteristics, what will happen to people after death, what will happen to them in the Resurrection (البعث) and Gathering (الحشر), and their ultimate destination to felicity or wretchedness (السعادة والشقاء) in Paradise or the Fire.\n\nAnd Allah has made the zodiacal signs (بروج الفلك), its lunar mansions (منازله), and the orbiting (سباحة) of its stars proofs (أدلة) of the decree (حكم) that Allah executes in the natural (الطبيعي) and elemental (العنصري) world—of heat, cold, dryness, and moisture, in hot, cold, wet, and dry. Some of these decrees necessitate the existence of bodies in known movements, some necessitate the existence of spirits (الأرواح), and some necessitate the duration of the heavens. This is the Knowledge to which Abu Talib al-Makki alluded, that the celestial sphere revolves by the breaths of the World (العالم).\n\nDespite their observation of all this, they differ among themselves. Among them is the perfect, verified, and precise scholar (الكامل المحقق المدقق), and among them are those who fall short of his degree due to differences in descent. We have seen a group of practitioners of geomancy (أصحاب خط الرمل) and scholars of the measures of the celestial movements (تقادير حركات الأفلاك), the courses of their stars (تسيير كواكبها), the conjunctions (الاقترانات), their measures, and the mansions of their conjunctions, and the decrees that Allah brings forth at those times in His creation.\n\nThese are like the customary causes (الأسباب المعتادة) known to the general public, which no one is ignorant of, and the one who asserts them is not deemed an unbeliever. These are also customary among the scholars who practice them, for they yield results according to the composition of their natures, which they do not yield when not in conjunction with others. They report specific matters that occur exactly as they reported them. Even though that matter occurs by the rule of coincidence (حكم الاتفاق) when viewed externally, and even though it is Knowledge in reality (في نفس الأمر), the one investigating it is not on a certainty (يقين). Even if he is convinced of it internally, due to the obscurity of the matter, he cannot, if he is fair-minded, be certain that he has not missed a subtle point in his investigation, nor that the one who paved the way for him before him—who was not a prophet reporting from Allah—missed anything. For the later scholar relies on the calculation of the earlier one.\n\nWhen we saw this, we knew that Allah has secrets in His creation. And whoever attains this rank of Knowledge, no one is stronger in Faith than him regarding what the Messengers brought, and what the Messenger of Allah, peace and blessings be upon him, brought from God, except for those who call <<إِلَى الله عَلَى بَصِيرَةٍ>> (to Allah upon clear insight), like the Messenger and his followers. Our discussion of preference (المفاضلة) is only between these individuals and the believers who rely on imitation (أهل التقليد), not between the Messengers and the Friends of Allah (أولياء الله) and His elect, whom Allah took charge of teaching. For He brought them mercy from Himself and taught them Knowledge from His Presence (علماً من لدنه), so they possess what they know by way of certainty (القطع), not by way of coincidence.\n\n### [The Science of Geomancy (علم الخط): A Prophet, Idris, was sent with it previously]\n\nThe Messenger of Allah, peace and blessings be upon him, said concerning the science of geomancy that a prophet was sent with it—it is said to be Idris, peace be upon him. Allah revealed to him in those shapes (الأشكال) which Allah established for him in the place of the Angel (الملك) for others. Just as the Angel comes without the Prophet intending its arrival, so too does the shape of the geomantic figure (شكل الخط) appear without the intention of the geomancer (صاحب الخط) who strikes it. These are specifically the Mothers (الأمهات).\n\nThen He legislated for him to establish laws (يشرع), which is the *Sunnah* (Practice) that the Messenger sees fit to establish in the World, and its origin is revelation (الوحي). Similarly, what the geomancer generates from the Mothers—the children (الأولاد) and grandchildren (أولاد الأولاد)—those shapes clearly express the desired matter exactly as it is. The intention (الضمير) in it is like the intention (النية) in an action, so it does not err.\n\nThe Prophet, peace be upon him, said concerning the scholars knowledgeable in geomancy: \"Whoever's line (خطه) corresponds to the line of that Prophet, then that one has attained the Truth (أصاب الحق).\" This is an example of one who calls <<إِلَى الله عَلَى بَصِيرَةٍ>> (to Allah upon clear insight) from among the followers of the Messengers. His saying, \"If it corresponds,\" means he did not make it a certainty (علماً) in his view, because he does not possess definitive certainty (لا يقطع به), even though it is Knowledge in reality (في نفس الأمر). This is the difference between these individuals and those who call <<إِلَى الله عَلَى بَصِيرَةٍ>> and those who are <<عَلَى بَيِّنَةٍ مِنْ رَبِّهِ>> (upon clear proof from his Lord).\n\nKnow that the knowledgeable ones concerning Allah (العلماء بالله) are, after Allah’s angels, His Messengers and His Friends (أولياؤه), then the scholars of proofs (العلماء بالأدلة), and those below them. Even if the knowledge corresponds to reality, it is not considered Knowledge by the person himself, due to the possibility of doubt (التردد الإمكانى) that the fair-minded person finds within himself. Therefore, he is only a believer in what came specifically in the Book of Allah and what came generally from His Messenger, not in detail, except for what reached him through continuous transmission (تواتراً). For this reason, the believers were told: <<آمِنُوا بِاللَّهِ ورَسُولِهِ>> (Believe in Allah and His Messenger). Thus, the Levels of creation in the Knowledge of Allah have become clear to you.\n\n### [The Messenger is a Teacher of Unity (التوحيد) for the one who knows Allah and the one who is ignorant of Him]\n\nWhen the Messenger came, and before him were those knowledgeable of Allah and those not knowledgeable of Allah, and he said to all of them: \"Say *La ilaha illa Allah*,\" we knew definitively that he, peace and blessings be upon him, was, in that saying, a teacher to the polytheists who lacked Knowledge of God’s Unity. And we knew that in that saying, he was also a teacher to those knowledgeable of Allah and His Unity, [teaching them] that the utterance of it is obligatory, and that it is what protects them from the shedding of their blood, the taking of their wealth, and the captivity of their progeny.\n\nFor this reason, the Messenger of Allah, peace and blessings be upon him, said: \"I have been commanded to fight the people until they say *La ilaha illa Allah*. When they say it, they have protected their blood and their wealth from me, except by the right of Islam, and their reckoning is with Allah.\"\n\nHe did not say \"until they know (يعلموا),\" for among them are the knowledgeable ones. The ruling here is for the utterance (القول), not for the Knowledge (العلم). However, the ruling on the Day when <<يَوْمَ تُبْلَى السَّرَائِرُ>> (secrets are tested) is for the Knowledge, not for the utterance. The knowledgeable person, the believer, and the hypocrite (المنافق)—who is neither knowledgeable nor a believer—all utter it here. When they say this word, they protect their blood and wealth, except by its right, in this world. In the Hereafter, their reckoning is with Allah, because of the hypocrite and because of anyone upon whom a right is incumbent but was not taken from him. As for this world, it is because of the established legal punishments (الحدود الموضوعة), for the saying of *La ilaha illa Allah* does not nullify them in this world or the Hereafter.\n\nAs for their reckoning being with Allah in the Hereafter, <<يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ>> (The Day Allah gathers the Messengers and says: \"What was the response to you?\"), they will know by the context that it is a question and an inquiry about the response of the hearts. They will say: <<لا عِلْمَ لَنا>> (We have no knowledge), meaning, \"We did not look into the hearts.\" <<إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ>> (Indeed, You are the Knower of the unseen) is an affirmation and confirmation of what we have mentioned.\n\n### [The Five Pillars of Islam]\n\nThen he, peace and blessings be upon him, said: \"The one whose Name is the King (الملك) built Islam upon five [pillars].\" He made it a kingdom (ملكاً): the testimony that there is no god but Allah (لا إله إلا الله) is the Heart (القلب); and that Muhammad is the Messenger of Allah is the Gatekeeper (حاجب الباب); establishing the Prayer (إقام الصلاة) is the Right Flank (المجنبة اليمنى); giving the Zakat (إيتاء الزكاة) is the Left Flank (المجنبة اليسرى); Fasting Ramadan (صيام رمضان) is the Vanguard (التقدمة); and the Hajj (الحج) is the Rearguard (الساقة).\n\nPerhaps the Prayer is the Vanguard because it is Light (نور), and it shields the King. It is mentioned in the report that His veil (حجابه) is Light. And Zakat would be the Right Flank (الميمنة) because it is expenditure (إنفاق) that requires strength to remove what one possessed from one's ownership. And Hajj would be the Left Flank (الميسرة) due to the expenditure and sacrifices (القرابين) involved, where it joins Zakat in charity (الصدقة) and offering (الهدية), both of which are acts of the hands. And Fasting is in the Rearguard, for the rear is like the front, and it is radiance (ضياء), for patience is radiance (الصبر ضياء)—meaning fasting—and radiance is from Light, so it is more appropriate for the Rearguard for the sake of balance, as the last follows the trace of the first.\n\nThis is how Divine Faith (الإيمان الإلهي) will be on the Day of Resurrection. Faith will come on the Day of Resurrection in the form of a King with this description: the people of *La ilaha illa Allah* are in the Heart, the people of Prayer are in the Vanguard, the people of Zakat (which is charity) are on the Right Flank, the people of Hajj are on the Left Flank, and the people of Fasting are in the Rearguard. May Allah make us among those whose house was built upon these foundations. If his house was Faith alone, with Prayer as the Qibla, Fasting as the North, Secret Charity (صدقة السر) as the West, and Hajj as the East, then its inhabitant has indeed achieved felicity.\n\n### [The Best Word Uttered by the Prophets]\n\nKnow that *La ilaha illa Allah* is a word of negation (نفي) and affirmation (إثبات), and it is the best word uttered by the Prophets. The Messenger of Allah, peace and blessings be upon him, said: \"The best supplication is the supplication on the Day of Arafah\"—this is an allusion to the supplication of the Gnostics (العارفين بالله)—\"and the best thing I and the Prophets before me have said is *La ilaha illa Allah*.\" This is a sound hadith, both in narration and meaning.\n\nNegation must necessarily apply to something established (ثابت) in order to negate it. For if negation applies to something that is not established (which is negation itself), it affirms it, just as the absence of absence is existence. So, tell us, what did this negator negate when he said *La ilaha* (No god)? We have inquired of you. And does the affirmer (المثبت) have the same ruling as the negated (المنفي)—that only the negated is affirmed—or does he have another ruling by which he is distinguished from the ruling of negation? What did this negator negate, and what did this affirmer affirm? All of this must be verified, if Allah wills.\n\nKnow that the negation applied to specific entities (أعيان) among the creatures when they were described with divinity (الألوهية), attributed to it, and called gods (آلهة). For this reason, the polytheists who were astonished when the Messenger of Allah, peace and blessings be upon him, called them to the One God, were astonished. Allah informed us about them, that they said: <<أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ>> (Has he made the gods into one God? Indeed, this is a wondrous thing). So they called them gods, but they do not possess this attribute. Thus, the ruling of negation applied to this attribution (النسبة) that was established *in their view* (عندهم), not in reality (في نفس الأمر). It did not apply to the negation of Divinity, because if he had negated the negation, it would have been the very affirmation of what the polytheist claimed. It is as if He says to the polytheist: \"This statement you made is invalid,\" meaning, \"The matter is not as you claimed.\" And there must be a God. The multiplicity of gods was negated by the particle of affirmation (حرف الإيجاب), which is His saying *illa* (except). And they affirmed this attribution to the one mentioned after the particle of affirmation, which is the Name Allah. So they said: *La ilaha illa Allah*.\n\nThe attribution of Divinity to Allah was not established by the affirmation of the affirmer, because He, the Exalted, is God unto Himself. Rather, the affirmer, by his saying *illa Allah*, established this matter in the soul of the one who did not believe in His exclusive possession of this attribute. For the affirmation of the established is impossible, whereas the negation of the negated is not impossible. In reality (على الحقيقة), the polytheist worshipped none but Allah, because if he had not believed in the Divinity (الألوهة) of the partner, he would not have worshipped it. And <<وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ>> (And your Lord has decreed that you worship none but Him). For this reason, the Real (الحق) was jealous for this attribute, so He punished them in this world when they did not respect Him, yet He provided for them and heard their supplication and answered them when they asked their god, in their claim. This is due to His knowledge, the Exalted, that they only resorted to this Level [of Divinity], even if they erred in the attribution. They were wretched in the Hereafter with eternal wretchedness because the Messenger alerted them to the Unity of the One to whom this attribution is due, but they did not reflect nor advise their souls. For this reason, the proof (دلالة) of every Messenger was according to what was dominant among the people of his time, so that the argument (الحجة) might be established against them, and Allah might have the conclusive argument (الحجة البالغة).\n\n### [Categories and Ranks of Those Who Utter the Word of Unity]\n\nThis word encompassed the Level of non-existence (العدم) and Existence (الوجود), leaving no Level that is not included under negation and affirmation; thus, it possesses comprehensiveness (الشمول).\n\nThere is one who says *La ilaha illa Allah* by his self (بنفسه).\nAnd one who says *La ilaha illa Allah* by his attribute (بنعته).\nAnd one who says *La ilaha illa Allah* by his Lord (بربه).\nAnd one who says *La ilaha illa Allah* by the attribute of his Lord (بنعت ربه).\nAnd one who says *La ilaha illa Allah* by his state (بحاله).\nAnd one who says *La ilaha illa Allah* by His ruling (بحكمه)—this is specifically the believer (المؤمن).\n\nThe remaining five have no entry into Faith.\n\nAs for the one who says *La ilaha illa Allah* by his self: he is the one who said it from his Theophany (تجليه) to himself, seeing that his Existence (وجوده) is derived from another. His vision of himself led him to say *La ilaha illa Allah*. This is the Essential Unity (التوحيد الذاتي) to which a group of the Verifiers (المحققين) alluded.\n\nAs for the one who says *La ilaha illa Allah* by his attribute: he is the one who unified Him by his Knowledge (بعلمه), for his attribute is the Knowledge of Allah’s Unity and Oneness (أحديته). His utterance is his Knowledge. The difference between him and the first is that the first is based on Witnessing (شهود), while the second is based on Existence. And Existence may or may not be based on Witnessing.\n\nAs for the one who says *La ilaha illa Allah* by his Lord: he is the one who saw that the Real (الحق) is the very Essence of Existence (عين الوجود), not another matter, and that the description of contingent things (الممكنات) with Existence is the manifestation (ظهور) of the Real to Himself through their immutable essences (أعيانها). This is because their derived Existence (استفادتها الوجود) from Allah is only by virtue of His Existence. The derived Existence, which is the manifest, is the very ruling applied to these essences. So he said *La ilaha illa Allah* by his Lord.\n\nAs for the one who says *La ilaha illa Allah* by the attribute of his Lord: he saw that the Real, the Exalted, in terms of His Oneness (أحديته) and Essence (ذاته), is not named Allah or the Lord (الرب), for He does not accept addition (الإضافة). He saw that the name Lord necessitates the object of Lordship (المربوب), and the name Allah requires the object of worship (المألوه). He saw that when they derived Existence from Him, the Name Lord was established for Him, since the object of Lordship seeks Him. Thus, the object of Lordship is the origin (أصل) in the establishment of the Name Lord, and the Existence of the Real is the origin in the existence of contingent things. He saw that *La ilaha illa Allah* is not sought by the Essence. So he said *La ilaha illa Allah* by the attribute of the Lord, which the object of Lordship attributed to Him. Our Knowledge of ourselves is the origin of our Knowledge of Him.\n\nHe, peace be upon him, says: \"Whoever knows himself knows his Lord.\"\n\nOur existence is dependent upon His Existence, and the Knowledge of Him is dependent upon the Knowledge of us. So He is the origin in one respect, and we are the origin in another respect.\n\nAs for the one who says *La ilaha illa Allah* by his state (بحاله): he is the one who relies on other than Allah in his affairs. If he fails to obtain what he sought from the one he relied upon, and the doors are closed in his face from all directions, he returns to Allah out of necessity (اضطرارا) and says *La ilaha illa Allah* by his state.\n\nAll these categories are not described as having Faith because none of them said it based on imitation (تقليد).\n\nAs for the one who says *La ilaha illa Allah* by His ruling (بحكمه): he is the one who said it because of the command of the Lawgiver (الشارع), who obligated him to say it and ruled that he must say it. Were it not for this ruling, he would not have said it as an act of drawing near (قربة) to Allah. Perhaps if he had said it, he would have said it as a teacher or as one being taught.\n\n### [The Comprehensive Name (الاسم الجامع) Described by All Names]\n\nI entered upon our Shaykh Abu al-Abbas al-Uraybi, who was from the people of Al-Ulya, and he was devoted to the remembrance of the Name Allah, adding nothing to it. I said to him: \"My master, why do you not say *La ilaha illa Allah*?\" He replied: \"My son, the breaths (الأنفاس) are in the hand of Allah, not in my hand. I fear that Allah might seize my soul when I say *La ilaha* (No god), and I would be seized in the desolation of negation (وحشة النفي).\"\n\nI asked another of our Shaykhs about this, and he said to me: \"My eye has not seen, nor has my ear heard, anyone say 'I am Allah' other than Allah. Therefore, I found no one to negate, so I say as I heard Him say: Allah, Allah.\"\n\nWe were commanded to worship with this Name in Unity because it is the Comprehensive Name (الاسم الجامع) described by all the Divine Names (الأسماء الإلهية). It has not been reported that any of the worshipped entities shared in it, unlike other Names such as *Ilah* (God) and others.\n\nWith this much utterance, if it is said due to the command of the Lawgiver, Faith is established. The Lawgiver only said \"until they say *La ilaha illa Allah*\" and did not say \"Muhammad is the Messenger of Allah,\" because this testimony of Unity implies the testimony of the Message (الرسالة). The one who says *La ilaha illa Allah* is not a believer unless he says it because of the command of the Messenger of Allah, peace and blessings be upon him. If he says it because of his command, that is the very affirmation of his Message. Since this specific word implies the testimony of the Message, he did not say, \"Say Muhammad is the Messenger of Allah.\"\n\nHe spoke of Faith in a context other than the utterance. Faith is a meaning (معنى) among meanings, not something perceived by the senses. Therefore, belief in Allah was coupled with belief in him [Muhammad] and in what he brought from his own authority (مما له أن يشرعه من غير نقل عن الله) that he was permitted to legislate without direct transmission from Allah.\n\nHe said in the hadith of Ibn Umar, after mentioning belief in Allah, Prayer, Zakat, Hajj, and Fasting—all of which came from Allah: \"I have been commanded to fight the people until they bear witness that there is no god but Allah and believe in me and in what I have brought.\" This is due to the hypocrite (المنافق) who relies on imitation (المقلد), for he says it without faith in his heart or conviction. The denying hypocrite says it not because of the Messenger's command, despite his Knowledge that he is the Messenger of Allah from his Book, not from rational proof.\n\n### [Rational Unity (التوحيد العقلي) and Legal Unity (التوحيد الشرعي)]\n\nKnow that the utterance of the testimony of the Message (شهادة الرسالة) coupled with the testimony of Unity (شهادة التوحيد) contains a Divine secret (سر إلهي) by which the Real, the Exalted, made us know that the One God whose description and attribute the Lawgiver brought is not the Divine Unity grasped by the intellect (العقل). That [rational Unity] does not accept the coupling of the testimony of the Message with the testimony of Unity. Therefore, this Unity, insofar as the Lawgiver knows it, is not the Unity established by rational investigation (النظر العقلي).\n\nIf the God to whose worship and Unity the Law calls us is only in the rank of being a God (إلها), not in His Essence (ذاته), then it is valid to describe Him with the attributes He described Himself with: descent (النزول), establishment (الاستواء), concomitance (المعية), hesitation (التردد), and management (التدبر), and similar attributes that the pure intellect, stripped of the Law, does not accept. Therefore, the testimony of the Messenger regarding his Message must be coupled with the testimony of the Unity of the One who sent him. For this reason, it is added to it, and one says: \"I bear witness that there is no god but Allah; I bear witness that Muhammad is the Messenger of Allah,\" thirty times every day in the call to the five prayers (أذان) and the call to stand (الإقامة). The people who utter this testimonial of the Message (الشهادة الرسالية) are categorized just as the people of the testimony of Unity are categorized. So let us proceed with them according to that same style of Ranks (المراتب).\n\n### [The Practice (السنة) and the Innovation (البدعة)]\n\nBelief in Allah and His Messenger includes belief in everything he brought from Allah and everything he established and legislated from his own authority (من عنده مما سنه وشرعه). What he established includes belief in the *Sunnah* of anyone who established a good *Sunnah* (سنة حسنة), so the Law continued, and the occurrence of the encouraged act of worship (العبادة المرغب فيها) does not abrogate an established ruling until the Day of Resurrection.\n\nThis ruling is specific to this Community (الأمة). I mean by \"ruling\" its naming as *Sunnah* (Practice), as an honor for this Community. In the case of previous communities, it was called monasticism (رهبانية). The Exalted said: <<وَرَهْبَانِيَّةً ابْتَدَعُوهَا>> (And monasticism which they innovated). So, whoever calls something an innovation (*bid'ah*) in this Community that the Lawgiver named a *Sunnah* has not attained the *Sunnah*, unless that [knowledge] has not reached him.\n\nFollowing (الاتباع) is better than innovating (الابتداع). The difference between following and innovating is intelligible. For this reason, the Lawgiver inclined toward naming it *Sunnah* and did not call it *bid'ah*, because innovation (*ibtida'*) is the manifestation of a matter without a prior example—this is its origin. For this reason, the Real, the Exalted, said of Himself: <<بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ>> (Originator of the heavens and the earth), meaning, the One who brought them into Existence without a prior example. If a person were to legislate today a matter that has no origin in the Law, that would be innovation (*ibda'*) and it would not be permissible for us to adopt it. The Lawgiver shifted from the term innovation to the term *Sunnah* because the *Sunnah* was legislated. Allah had legislated for Muhammad, peace and blessings be upon him, to follow the guidance of the Prophets, peace be upon them. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## (باب سڑسٹھواں: لا إله إلا الله محمد رسول الله کی معرفت میں، اور یہی ایمان ہے)\n\nاللہ نے ہمیشہ سے، ازل سے گواہی دی ہے\nکہ اللہ کے سوا کوئی معبود نہیں ہے۔\n\nپھر اس کے فرشتوں نے اس کی گواہی دی\nکہ اللہ کے سوا کوئی معبود نہیں ہے۔\n\nاور تمام اہل علم نے گواہی دی\nکہ اللہ کے سوا کوئی معبود نہیں ہے۔\n\nپھر رسول نے فرمایا: میرے ساتھ کہو\nکہ اللہ کے سوا کوئی معبود نہیں ہے۔\n\nبہترین کلمہ جو میں نے کہا اور مجھ سے پہلے والوں نے کہا،\nوہ ہے: اللہ کے سوا کوئی معبود نہیں ہے۔\n\nانسانوں کے علاوہ سب نے گواہی دی\nکہ اللہ کے سوا کوئی معبود نہیں ہے۔\n\n### [توحید بذریعہ علم اور توحید بذریعہ خبر]\n\nاللہ جل شانہ نے اپنی عزیز کتاب میں فرمایا:\nشَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ قائِماً بِالْقِسْطِ لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ\n(اللہ نے گواہی دی کہ اس کے سوا کوئی معبود نہیں، اور فرشتوں نے اور اہل علم نے بھی، وہ انصاف پر قائم ہے۔ اس غالب حکمت والے کے سوا کوئی معبود نہیں)۔\nپھر فرمایا:\nإِنَّ الدِّينَ عِنْدَ الله الْإِسْلامُ\n(بے شک دین اللہ کے نزدیک اسلام ہی ہے)۔\nاور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اسلام یہ ہے کہ تم گواہی دو کہ اللہ کے سوا کوئی معبود نہیں اور محمد اللہ کے رسول ہیں\"۔\n\nاس حدیث میں اللہ سبحانہ نے \"وأُولُوا الْعِلْمِ\" (اور اہل علم) فرمایا، یہ نہیں فرمایا کہ \"اور اہل ایمان\"۔ کیونکہ اللہ کی اپنے لیے توحید کی گواہی کسی خبر پر مبنی نہیں ہے کہ وہ ایمان کہلائے۔ اسی لیے گواہی دینے والا جس چیز کی گواہی دیتا ہے وہ علم پر مبنی ہونی چاہیے، ورنہ اس کی گواہی درست نہیں ہوتی۔ پھر اللہ عزوجل نے فرشتوں اور اہل علم کو واؤ (و) کے ذریعے اپنی ذات پر عطف کیا ہے، اور یہ حرف اشتراک کا فائدہ دیتا ہے، اور یہاں اشتراک صرف گواہی میں ہے، یہ قطعی ہے۔ پھر اللہ نے انہیں علم کی طرف منسوب کیا ہے نہ کہ ایمان کی طرف۔ پس ہم نے جان لیا کہ اللہ نے اس شخص کو مراد لیا ہے جسے توحید علم نظری یا علم ضروری کے ذریعے حاصل ہوئی ہو، نہ کہ خبر کے ذریعے، گویا وہ فرما رہا ہے:\n\nاور فرشتوں نے میرے لیے توحید کی گواہی علم ضروری کے ذریعے دی، جو انہیں ظہور الٰہی (At-Tajallī) سے حاصل ہوا، اور یہ علم ان کے لیے دلائل میں صحیح غور و فکر (Naẓar) کے قائم مقام ہو گیا، پس انہوں نے میرے لیے توحید کی گواہی دی جیسا کہ میں نے اپنے لیے گواہی دی۔ اور اہل علم نے اس عقلی غور و فکر (Naẓar al-‘Aqlī) کے ذریعے گواہی دی جو میں نے اپنے بندوں میں رکھا ہے۔ اس کے بعد ایمان دوسرے درجے پر آیا، جو ان علماء کا درجہ ہے، اور یہی وہ چیز ہے جس پر سعادت کا انحصار ہے، کیونکہ اللہ نے اسی کا حکم دیا ہے، اور ہم نے اسے علم اس لیے کہا کہ خبر دینے والا خود اللہ ہے، چنانچہ فرمایا:\nفَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله\n(پس جان لو کہ اللہ کے سوا کوئی معبود نہیں)۔\nاور اللہ تعالیٰ نے فرمایا:\nوَلِيَعْلَمُوا أَنَّما هُوَ إِلهٌ واحِدٌ\n(اور تاکہ وہ جان لیں کہ وہ ایک ہی معبود ہے)۔\nجب اس نے قرآن عزیز کی سورۃ ابراہیم کے آخر میں مراتب کو تقسیم کیا۔ اور رسول اللہ صلی اللہ علیہ وسلم نے صحیح حدیث میں فرمایا: \"جو شخص اس حال میں مرے کہ وہ جانتا ہو کہ اللہ کے سوا کوئی معبود نہیں، وہ جنت میں داخل ہو گا\"۔\n\nیہاں یہ نہیں فرمایا کہ \"وہ ایمان رکھتا ہو\"، کیونکہ ایمان خبر پر موقوف ہے، اور اللہ نے فرمایا:\nوَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا\n(اور ہم عذاب دینے والے نہیں جب تک کہ رسول نہ بھیج دیں)۔\n\n### [توحید اہل فترت]\n\nاور ہم جانتے ہیں کہ اللہ کے کچھ بندے فترت (رسولوں کے وقفے) کے زمانے میں تھے، اور وہ علم کے ذریعے موحد تھے، اور رسول اللہ صلی اللہ علیہ وسلم سے پہلے رسولوں کی دعوت عام نہیں تھی کہ ہر زمانے کے لوگوں پر ایمان لانا لازم ہو۔ پس اس کلام نے توحید الٰہی کے تمام علماء کو شامل کر لیا، خواہ وہ مؤمن ہوں اس لحاظ سے کہ وہ سچی خبر کی وجہ سے اسے جانتے ہیں جو علم کا فائدہ دیتی ہے، نہ کہ ایمان کی وجہ سے، اور خواہ وہ غیر مؤمن ہوں۔ کیونکہ ایمان کا وجود رسول کی آمد کے بعد ہی صحیح ہوتا ہے، اور رسول کا ثبوت تب تک نہیں ہوتا جب تک عاقل غور و فکر کرنے والا یہ نہ جان لے کہ کوئی معبود ہے اور وہ معبود ایک ہے، یہ ضروری ہے۔ کیونکہ رسول اسی جنس سے ہوتا ہے جس کی طرف اسے بھیجا گیا ہے، اور کوئی ایک فرد دوسرے سے ممتاز نہیں ہوتا مگر معارض (شریک) کے نہ ہونے کی وجہ سے۔ لہٰذا رسول کے لیے ضروری ہے کہ وہ اپنے بھیجنے والے (اللہ تعالیٰ) کی توحید کا عالم ہو، اور یہ علم بھی مقدم ہونا چاہیے کہ یہ معبود ایسی صفت پر ہے کہ وہ ایک خاص نسبت کے ساتھ رسول بھیج سکتا ہے جو اس کی ذات نہیں ہے۔ تب وہ اس رسول کے دعوے کی سچائی پر غور کرتا ہے کہ وہ اللہ کی طرف سے رسول ہے، کیونکہ یہ اس کے نزدیک ممکن ہے۔\n\n### [توحید الٰہی کے عالم کا مرتبہ، دلیل کے اعتبار سے]\n\nیہ علم میں معقول مراتب ہیں جن میں سے بعض کا علم بعض پر موقوف ہے۔ اور یہ سب مؤمن کا حصہ نہیں ہے۔ کیونکہ ایمان کا مرتبہ، جو اس بات کی تصدیق ہے کہ یہ اللہ کی طرف سے رسول ہے، اس علم کے حصول کے بعد ہی ہوتا ہے جس کا ہم نے ذکر کیا۔ پس جب اس رسول کی سچائی پر دلائل آ گئے، نہ کہ اس کے بھیجنے والے کی توحید پر، تب عقل والے، اہل دانش اور اہل نہی اس چیز کے لیے تیار ہو جاتے ہیں جو یہ رسول اپنی رسالت میں پیش کرتا ہے۔ پس اس نے اپنی رسالت میں سب سے پہلی بات یہ کہی کہ جس اللہ نے مجھے بھیجا ہے وہ تم سے کہتا ہے کہ تم لا إله إلا الله کہو۔ پس اہل دانش نے جان لیا کہ اللہ کی توحید کے عالم پر اس کا تلفظ کرنا لازم نہیں ہے۔ جب اس عالم نے رسول سے اس کے تلفظ کا حکم سنا، اور یہ بھی جانا کہ یہ تلفظ توحید الٰہی کے علم کی دلیل کے مدلول میں شامل نہیں ہے، تو اس عالم موحد نے اس رسول کی تصدیق اور ایمان کی وجہ سے اس کا تلفظ کیا۔ پس جب عالم نے رسول اللہ صلی اللہ علیہ وسلم کے حکم پر لا إله إلا الله کہا، تو وہ مؤمن کہلایا۔ کیونکہ رسول نے اسے یہ کہنے کا واجب کیا، حالانکہ وہ اپنے نفس میں اس کا عالم تھا اور اپنے طور پر تلفظ کرنے یا نہ کرنے میں مختار تھا۔ پس یہ توحید الٰہی کے عالم کا مرتبہ ہے، دلیل کے اعتبار سے۔ پس جو شخص اس حال میں مرے کہ وہ جانتا ہو کہ اللہ کے سوا کوئی معبود نہیں، وہ بلا شک و شبہ جنت میں داخل ہو گا، اور وہ سعادت مندوں میں سے ہے۔\n\nرہا وہ شخص جو فترت کے زمانے میں تھا، تو اللہ اسے ایک امت واحدہ کے طور پر اٹھائے گا، جیسے قس بن ساعدہ، نہ وہ کسی کا تابع ہو گا کیونکہ وہ مؤمن نہیں ہے، اور نہ وہ متبوع ہو گا کیونکہ وہ اللہ کی طرف سے رسول نہیں ہے، بلکہ وہ اللہ کا عالم ہے اور ان حادث ہونے والی کائنات کا عالم ہے جنہیں اس نے کسی بھی طریقے سے جانا۔ اور کسی مخلوق کے لیے یہ جائز نہیں کہ وہ ایسی شریعت بنائے جس کی اللہ نے اجازت نہ دی ہو، اور نہ ہی یہ واجب کرے کہ عالم غیب سے کوئی ممکن چیز واقع ہو جس کے خلاف کا امکان اس کی دلیل میں موجود ہو، قربت الٰہی کی نیت سے، مگر اللہ کی وحی اور خبروں کے ذریعے۔\n\n### [فلک کے برج، اس کی منزلیں اور ستاروں کی گردش، ان احکام پر دلائل ہیں جو اللہ عالم طبیعت اور عالم عناصر میں جاری کرتا ہے]\n\nیہاں اس شخص کے لیے ایک نکتہ ہے جو دل اور فطانت رکھتا ہے، اللہ تعالیٰ کے اس فرمان کی وجہ سے:\nوَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا\n(اور ہر آسمان میں اس کا حکم وحی کر دیا)۔\nاور اس فرمان کی وجہ سے کہ اس نے لوح محفوظ میں وہ سب کچھ ودیعت کر دیا ہے جو وہ قیامت تک اپنی مخلوق میں جاری کرے گا۔ اور جو کچھ اللہ نے اپنے آسمانوں میں وحی کیا اور اپنی لوح میں ودیعت کیا، ان میں رسولوں کی بعثت بھی شامل ہے۔ پس یہ بعثت لوح سے کشف (Al-Kashf) اور اطلاع کے ذریعے حاصل کی جاتی ہے، اور آسمان سے غور و فکر (Naẓar) اور تجربے کے ذریعے حاصل کی جاتی ہے۔ اور رسولوں کی بعثت کا ان کا علم، ان قربتوں کا علم ہے جو وہ اللہ کی طرف سے لاتے ہیں، اور ان کے زمانوں، مکانوں، حلیوں کا علم ہے، اور موت کے بعد لوگوں کا کیا حال ہو گا، اور بعث و حشر میں ان کا کیا ہو گا، اور جنت و دوزخ کی صورت میں ان کا انجام سعادت یا شقاوت کی طرف کیا ہو گا، اور یہ کہ اللہ نے فلک کے برج، اس کی منزلیں اور ستاروں کی گردش کو ان احکام پر دلائل بنایا ہے جو اللہ عالم طبیعی اور عنصری میں جاری کرتا ہے، جیسے گرمی، سردی، خشکی اور تری، گرم، سرد، تر اور خشک میں۔ پس ان میں سے کچھ وہ ہیں جو معلوم حرکات میں اجسام کے وجود کا تقاضا کرتے ہیں، اور کچھ وہ ہیں جو ارواح کے وجود کا تقاضا کرتے ہیں، اور کچھ وہ ہیں جو آسمانوں کی مدت کے باقی رہنے کا تقاضا کرتے ہیں۔ اور یہی وہ علم ہے جس کی طرف ابو طالب مکی نے اشارہ کیا کہ فلک عالم کے سانسوں کے ساتھ گردش کرتا ہے۔ اور اس سب کو دیکھنے کے باوجود وہ اس میں ایک دوسرے سے افضل ہیں، ان میں سے کچھ کامل، محقق اور مدقق ہیں، اور کچھ ایسے ہیں جو فضیلت میں ان کے درجے سے نیچے ہیں۔\n\nہم نے علم رمل کے ماہرین اور افلاک کی حرکات، ستاروں کی گردش، اقترانات (ملاپ) اور ان کی مقداروں، اور ان کے اقترانات کی منزلوں کے علماء کی ایک جماعت کو دیکھا ہے، اور ان احکام کو بھی دیکھا ہے جو اللہ اس وقت اپنی مخلوق میں پیدا کرتا ہے، جیسے عام لوگوں میں معمول کی اسباب جو کسی سے پوشیدہ نہیں ہیں اور نہ ہی ان کا قائل کافر ہوتا ہے۔ پس یہ چیزیں بھی ان علماء کے نزدیک معمول ہیں، کیونکہ یہ ان کی طبائع کی تالیف کے مطابق وہ چیزیں دیتی ہیں جو ان کے غیر کے ساتھ اقتران کی حالت میں نہیں دیتیں۔ پس وہ جزوی امور کی خبر دیتے ہیں جو بالکل اسی طرح واقع ہوتے ہیں جس طرح انہوں نے خبر دی تھی، اگرچہ وہ امر اس کے اعتبار سے اتفاقی حکم سے واقع ہوتا ہے، اگرچہ وہ نفس الامر میں علم ہی کیوں نہ ہو۔ کیونکہ اس میں غور کرنے والا یقین پر نہیں ہوتا، اگرچہ وہ اپنے نفس میں اس کا قطعیت سے فیصلہ کر لے، کیونکہ معاملہ گہرا ہوتا ہے۔ پس انصاف کے ساتھ یہ صحیح نہیں کہ وہ اپنے نفس میں یقین پر ہو کہ اس کے غور و فکر میں کوئی باریک نکتہ چھوٹا نہیں، اور نہ ہی اس سے پہلے کسی ایسے شخص سے کوئی چیز چھوٹی ہے جس نے اس کے لیے راستہ ہموار کیا ہو، سوائے اس نبی کے جو اللہ کی طرف سے خبر دیتا ہے۔ کیونکہ بعد والا شخص پہلے والے کے حساب پر انحصار کرتا ہے۔ پس جب ہم نے یہ دیکھا تو جان لیا کہ اللہ کی اپنی مخلوق میں کچھ اسرار ہیں۔ اور جو شخص علم کے اس مرتبے پر فائز ہو گیا، وہ ان لوگوں سے زیادہ ایمان میں قوی نہیں ہو سکتا جو رسولوں کی لائی ہوئی چیزوں پر ایمان لائے، اور جو رسول اللہ صلی اللہ علیہ وسلم اللہ کی طرف سے لائے، سوائے اس شخص کے جو رسول اور اس کے پیروکاروں کی طرح بصیرت (Baṣīrah) پر اللہ کی طرف بلاتا ہے۔ اور ہمارا کلام فضیلت میں صرف ان لوگوں اور تقلید کرنے والے مؤمنوں کے درمیان ہے، نہ کہ رسولوں اور اللہ کے اولیاء اور خاص بندوں کے درمیان جن کی تعلیم کی ذمہ داری اللہ نے خود لی، پس انہیں اپنی طرف سے رحمت عطا کی اور انہیں اپنے پاس سے علم سکھایا، پس وہ جو کچھ جانتے ہیں وہ قطعیت کے حکم سے جانتے ہیں نہ کہ اتفاق کے حکم سے۔\n\n### [علم الخط (علم رمل) ایک نبی ہے جو پہلے مبعوث ہوا، وہ ادریس ہیں]\n\nرسول اللہ صلی اللہ علیہ وسلم نے علم الخط (علم رمل) کے بارے میں فرمایا کہ ایک نبی اس کے ساتھ مبعوث ہوئے تھے، کہا جاتا ہے کہ وہ ادریس علیہ السلام ہیں۔ پس اللہ نے ان اشکال میں وحی کی جو اللہ نے ان کے لیے دوسرے کے لیے فرشتہ کے مقام پر قائم کر دی تھیں۔\n\nاور جس طرح فرشتہ نبی کے قصد کے بغیر آتا ہے، اسی طرح علم الخط کا نقشہ بھی خط ڈالنے والے کے قصد کے بغیر آتا ہے۔ اور یہ خاص طور پر امہات (بنیادی اشکال) ہیں، پھر اس کے لیے شریعت سازی جائز ہوئی، اور یہ وہ سنت ہے جسے رسول عالم میں رکھنا مناسب سمجھتا ہے، اور اس کی اصل وحی ہے۔ اسی طرح جو کچھ خط ڈالنے والا امہات سے اولاد اور اولاد کی اولاد پیدا کرتا ہے، تو وہ اشکال اسے مطلوبہ امر کے بارے میں بالکل اسی طرح بتاتی ہیں جیسا کہ وہ ہے۔ اور اس میں ضمیر عمل میں نیت کی طرح ہے، پس وہ غلطی نہیں کرتا۔ آپ صلی اللہ علیہ وسلم نے علم الخط کے عالموں کے بارے میں فرمایا: \"پس جس کا خط اس نبی کے خط سے موافق ہو جائے، تو وہ حق کو پا گیا\"۔ پس یہ اس شخص کی مثال ہے جو رسولوں کی پیروی میں بصیرت (Baṣīrah) پر اللہ کی طرف بلاتا ہے۔ آپ کا یہ فرمان کہ \"اگر موافق ہو جائے\" تو آپ نے اسے اس کے نزدیک علم نہیں ٹھہرایا، کیونکہ وہ اس پر قطعیت کا حکم نہیں لگاتا، اگرچہ وہ نفس الامر میں علم ہی کیوں نہ ہو۔ پس یہ فرق ہے ان لوگوں کے درمیان اور اس شخص کے درمیان جو بصیرت (Baṣīrah) پر اللہ کی طرف بلاتا ہے اور جو اپنے رب کی طرف سے واضح دلیل (Bayyinah) پر ہے۔\n\nپس جان لو کہ اللہ کے علماء، اللہ کے فرشتوں کے بعد، اللہ کے رسول ہیں، پھر اس کے اولیاء، پھر دلائل کے ذریعے جاننے والے، اور ان سے نیچے والے، اگرچہ ان کا علم نفس الامر میں موافق ہو جائے، لیکن وہ اپنے نزدیک عالم نہیں ہوتا، اس امکانی تردد کی وجہ سے جو منصف شخص اپنے نفس میں پاتا ہے۔ پس وہ مؤمن نہیں ہے مگر اس چیز پر جو اللہ کی کتاب میں تعین کے ساتھ آئی ہے، اور جو اس کے رسول سے اجمالی طور پر آئی ہے، نہ کہ تفصیل کے ساتھ، سوائے اس کے جو اسے تواتر سے حاصل ہوا ہو۔ اسی لیے مؤمنوں سے کہا گیا:\nآمِنُوا بِاللَّهِ ورَسُولِهِ\n(اللہ اور اس کے رسول پر ایمان لاؤ)۔\nپس تمہارے لیے اللہ کے علم میں مخلوق کے مراتب واضح ہو گئے۔\n\n### [رسول، اللہ کے عالم اور اس سے جاہل دونوں کے لیے توحید میں معلم ہیں]\n\nپس جب رسول آئے اور ان کے سامنے اللہ کے عالم اور غیر عالم دونوں موجود تھے، اور آپ نے سب سے فرمایا: \"لا إله إلا الله کہو\"، تو ہم نے قطعیت سے جان لیا کہ آپ صلی اللہ علیہ وسلم اس قول میں مشرکین میں سے ان لوگوں کے لیے معلم ہیں جنہیں توحید الٰہی کا علم نہیں ہے، اور ہم نے یہ بھی جان لیا کہ آپ اس قول میں اللہ اور اس کی توحید کے علماء کے لیے بھی معلم ہیں کہ اس کا تلفظ واجب ہے، اور یہ ان کے خون بہانے، ان کے مال لینے اور ان کی اولاد کو قیدی بنانے سے بچاؤ کا ذریعہ ہے۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"مجھے حکم دیا گیا ہے کہ میں لوگوں سے جنگ کروں یہاں تک کہ وہ لا إله إلا الله کہہ دیں، جب وہ یہ کہہ دیں گے تو انہوں نے مجھ سے اپنے خون اور اپنے مال محفوظ کر لیے، سوائے حق اسلام کے، اور ان کا حساب اللہ پر ہے\"۔\n\nآپ نے یہ نہیں فرمایا کہ \"یہاں تک کہ وہ جان لیں\"، کیونکہ ان میں علماء بھی موجود ہیں۔ پس یہاں حکم قول کے لیے ہے نہ کہ علم کے لیے۔ اور قیامت کے دن،\nيَوْمَ تُبْلَى السَّرَائِرُ\n(جس دن بھیدوں کو جانچا جائے گا)،\nحساب میں حکم علم کے لیے ہو گا نہ کہ قول کے لیے۔ پس یہ کلمہ عالم، مؤمن اور منافق نے بھی کہا جو نہ عالم ہے اور نہ مؤمن۔ پس جب انہوں نے یہ کلمہ کہا تو انہوں نے دنیا میں اپنے خون اور مال محفوظ کر لیے، سوائے اس کے حق کے۔ اور آخرت میں ان کا حساب اللہ پر ہے، منافق کی وجہ سے، اور اس شخص کی وجہ سے جس پر کسی کا حق واجب ہوا اور اس سے نہیں لیا گیا۔ اور دنیا میں حدود کی وجہ سے، کیونکہ لا إله إلا الله کا قول دنیا اور آخرت میں حدود کو ساقط نہیں کرتا۔ اور آخرت میں ان کا حساب اللہ پر ہو گا،\nيَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ\n(جس دن اللہ رسولوں کو جمع کرے گا، پھر فرمائے گا کہ تمہیں کیا جواب دیا گیا؟)\nتو وہ حال کے قرینے سے جان لیں گے کہ یہ سوال اور استفسار ان کے دلوں کے جواب کے بارے میں ہے، پس وہ کہیں گے:\nلا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ\n(ہمیں کوئی علم نہیں، بے شک تو ہی غیبوں کا جاننے والا ہے)۔ یہ ہمارے ذکر کردہ امر کی تاکید اور تائید ہے۔\n\n### [اسلام کے پانچ ارکان]\n\nپھر آپ صلی اللہ علیہ وسلم نے فرمایا: \"جس کا نام الملک (بادشاہ) ہے، اس نے اسلام کو پانچ چیزوں پر قائم کیا\"۔ پس آپ نے اسے بادشاہ بنا دیا:\n۱. لا إله إلا الله کی گواہی: اور یہ دل ہے۔\n۲. محمد رسول الله: دروازے کا دربان ہے۔\n۳. نماز قائم کرنا: دایاں پہلو/بازو (Al-Mujannabah al-Yumnā) ہے۔\n۴. زکوٰۃ دینا: بایاں پہلو/بازو (Al-Mujannabah al-Yusrā) ہے۔\n۵. رمضان کے روزے: آگے کا حصہ/پیش قدمی (At-Taqaddumah) ہے۔\n۶. حج: پچھلا دستہ (As-Sāqah) ہے۔\n\nاور کبھی نماز آگے کا حصہ (At-Taqaddumah) ہوتی ہے کیونکہ وہ نور ہے، اور وہ بادشاہ کو پردہ میں رکھتی ہے۔ خبر میں آیا ہے کہ اس کا پردہ نور ہے۔ اور زکوٰۃ دایاں پہلو (Al-Maymanah) ہوتی ہے، کیونکہ یہ ایسا خرچ ہے جس کے لیے قوت کی ضرورت ہوتی ہے تاکہ وہ چیز نکالی جائے جس کا وہ مالک تھا، اس کی ملکیت سے۔ اور حج بایاں پہلو (Al-Maysarah) ہوتا ہے، کیونکہ اس میں خرچ اور قربانیاں شامل ہیں، جہاں وہ زکوٰۃ کے ساتھ صدقہ اور ہدیہ میں جمع ہو جاتا ہے، اور یہ دونوں ہاتھوں کے اعمال میں سے ہیں۔ اور روزہ پچھلے دستے (As-Sāqah) میں ہوتا ہے، کیونکہ پیچھے والا آگے والے کے مشابہ ہوتا ہے، اور وہ روشنی ہے، کیونکہ صبر روشنی ہے، اور اس سے مراد روزہ ہے، اور روشنی نور سے ہے، پس وہ موازنہ کے لیے پچھلے دستے کا زیادہ حقدار ہے، کیونکہ آخر والا پہلے والے کے نقش قدم پر چلتا ہے۔\n\nاور اسی طرح قیامت کے دن الٰہی ایمان ہو گا، پس ایمان قیامت کے دن اس صفت کے ساتھ ایک بادشاہ کی صورت میں آئے گا۔ پس لا إله إلا الله والے دل میں ہوں گے، اور نماز والے آگے کے حصے میں، اور زکوٰۃ (صدقہ) والے دائیں پہلو میں، اور حج والے بائیں پہلو میں، اور روزے والے پچھلے دستے میں۔ اللہ ہمیں ان لوگوں میں شامل کرے جن کے گھر کی بنیاد ان قواعد پر قائم ہوئی، پس ان کا گھر ایمان ہی تھا، قبلہ کی طرف نماز، شمال کی طرف روزہ، مغرب کی طرف خفیہ صدقہ، اور مشرق کی طرف حج۔ پس اس کا مکین یقیناً سعادت مند ہوا۔\n\n### [انبیاء کا کہا ہوا بہترین کلمہ]\n\nاور جان لو کہ لا إله إلا الله نفی اور اثبات کا کلمہ ہے، اور یہ بہترین کلمہ ہے جو انبیاء نے کہا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بہترین دعا عرفہ کے دن کی دعا ہے\"۔ اس میں اللہ کے عارفین کی دعا کی طرف اشارہ ہے۔ \"اور بہترین کلمہ جو میں نے کہا اور مجھ سے پہلے نبیوں نے کہا، وہ ہے: لا إله إلا الله\"۔\n\nیہ حدیث روایت اور معنی کے اعتبار سے صحیح ہے۔ نفی کا وارد ہونا ضروری ہے کسی ثابت چیز پر تاکہ وہ اس کی نفی کرے، کیونکہ اگر نفی ایسی چیز پر وارد ہو جو ثابت نہیں ہے، یعنی نفی پر، تو وہ اسے ثابت کر دے گی، جس طرح عدم پر نفی اثبات ہے، جیسے عدم کا عدم وجود ہے۔ پس اس نفی کرنے والے نے اپنے قول \"لا إله\" سے کس چیز کی نفی کی؟ ہمیں بتاؤ، ہم نے تم سے استفسار کیا ہے۔ اور کیا مثبت کا حکم بھی منفی کے حکم جیسا ہے کہ وہ صرف منفی کو ہی ثابت کرتا ہے، یا اس کا حکم کوئی دوسرا ہے جو نفی کے حکم سے ممتاز ہے؟ پس اس نفی کرنے والے نے کس چیز کی نفی کی اور اس مثبت نے کس چیز کا اثبات کیا؟ ان سب کی تحقیق ضروری ہے، ان شاء اللہ۔\n\nپس جان لو کہ نفی مخلوقات کے ان اعیان پر وارد ہوئی جنہیں الوہیت سے موصوف کیا گیا، اور ان کی طرف منسوب کیا گیا، اور ان کے بارے میں کہا گیا کہ وہ معبود (آلہہ) ہیں۔ اسی لیے مشرکین میں سے جس نے تعجب کیا، اس نے تعجب کیا جب رسول اللہ صلی اللہ علیہ وسلم نے انہیں اللہ واحد کی طرف بلایا، پس اللہ نے ہمیں اس کے بارے میں خبر دی کہ اس نے کہا:\nأَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ\n(کیا اس نے تمام معبودوں کو ایک ہی معبود بنا دیا ہے؟ بے شک یہ تو بڑی عجیب بات ہے) (ص: ۵)۔\nپس انہوں نے انہیں معبود (آلہہ) کہا، حالانکہ وہ اس صفت پر نہیں تھے۔ پس نفی کا حکم اس نسبت پر وارد ہوا جو ان کے نزدیک ان کی طرف ثابت تھی، نہ کہ نفس الامر میں، اور نہ ہی الوہیت کی نفی پر۔ کیونکہ اگر وہ نفی کی نفی کرتا تو وہ عین اثبات ہوتا اس چیز کا جو مشرک نے گمان کیا تھا۔ پس گویا وہ مشرک سے کہتا ہے کہ یہ قول جو تم نے کہا ہے وہ صحیح نہیں ہے، یعنی معاملہ ایسا نہیں ہے جیسا تم نے گمان کیا، اور معبود کا ہونا ضروری ہے، اور معبودوں کی کثرت حرف ایجاب (إلا) سے ختم ہو گئی، اور انہوں نے اس نسبت کو مذکورہ چیز کے لیے واجب کر دیا جو حرف ایجاب کے بعد ہے، اور وہ مسمیٰ اللہ ہے، پس انہوں نے کہا: لا إله إلا الله۔\n\nپس اللہ کے لیے الوہیت کی نسبت مثبت کے اثبات سے ثابت نہیں ہوئی، کیونکہ وہ سبحانہ اپنی ذات کے لیے معبود ہے۔ پس مثبت نے اپنے قول \"إلا الله\" سے اس امر کو اس شخص کے نفس میں ثابت کیا جو اس صفت میں اس کے اکیلے ہونے کا اعتقاد نہیں رکھتا تھا۔ کیونکہ ثابت کا اثبات محال ہے، اور منفی کی نفی محال نہیں ہے۔ پس حقیقت میں مشرک نے اللہ کے سوا کسی کی عبادت نہیں کی، کیونکہ اگر وہ شریک میں الوہیت کا اعتقاد نہ رکھتا تو اس کی عبادت نہ کرتا۔ اور\nوَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ\n(اور تمہارے رب نے فیصلہ کر دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو)۔\nاسی لیے ذات حق (Al-Ḥaqq) کو اس صفت پر غیرت آئی، پس اس نے انہیں دنیا میں سزا دی جب انہوں نے اس کا احترام نہیں کیا، اور انہیں رزق دیا، اور ان کی دعا سنی، اور جب انہوں نے اپنے گمان میں اپنے معبود سے سوال کیا تو انہیں جواب دیا، کیونکہ وہ سبحانہ جانتا تھا کہ انہوں نے صرف اسی مرتبے کی طرف رجوع کیا ہے، اگرچہ انہوں نے نسبت میں غلطی کی، پس وہ آخرت میں ہمیشہ کی شقاوت میں مبتلا ہوئے، کیونکہ رسول نے انہیں اس ذات کی توحید پر متنبہ کیا جس کے لیے یہ نسبت واجب ہے، مگر انہوں نے غور نہیں کیا اور نہ ہی اپنے نفسوں کی خیر خواہی کی۔ اسی لیے ہر رسول کی دلیل اس چیز کے مطابق تھی جو اس کے زمانے کے لوگوں پر غالب تھی، تاکہ ان پر حجت قائم ہو جائے، اور اللہ کے لیے حجت بالغہ ہو۔\n\n### [کلمہ توحید کہنے والوں کی اقسام اور ان کے مراتب]\n\nپس اس کلمے نے عدم اور وجود کے مرتبے کو عام کر دیا، پس کوئی مرتبہ باقی نہیں رہا مگر وہ نفی اور اثبات کے تحت داخل ہے۔ پس اس میں شمولیت ہے۔ پس کوئی لا إله إلا الله اپنے نفس سے کہتا ہے، اور کوئی لا إله إلا الله اپنی صفت سے کہتا ہے، اور کوئی لا إله إلا الله اپنے رب سے کہتا ہے، اور کوئی لا إله إلا الله اپنے رب کی صفت سے کہتا ہے، اور کوئی لا إله إلا الله اپنے حال سے کہتا ہے، اور کوئی لا إله إلا الله اپنے حکم سے کہتا ہے، اور یہ خاص طور پر مؤمن ہے۔ اور باقی پانچ کا ایمان میں کوئی دخل نہیں ہے۔\n\n۱. **اپنے نفس سے کہنے والا:** وہ ہے جس نے اسے اپنے ظہور الٰہی (At-Tajallī) سے اپنے لیے کہا، پس اس نے اپنے وجود کا فائدہ کسی اور سے حاصل ہوتے ہوئے دیکھا، پس اپنے نفس کے مشاہدے (Shuhūd) نے اسے یہ کہنے پر مجبور کیا: لا إله إلا الله۔ اور یہی توحید ذاتی (Tawḥīd Dhātī) ہے جس کی طرف محققین کی ایک جماعت نے اشارہ کیا ہے۔\n\n۲. **اپنی صفت سے کہنے والا:** وہ ہے جس نے اسے اپنے علم کے ذریعے موحد جانا، کیونکہ اس کی صفت اللہ کی توحید اور احدیت کا علم ہے۔ پس اس کا نطق اس کا علم ہے۔ اور اس کا پہلے والے سے فرق یہ ہے کہ پہلا مشاہدہ (Shuhūd) سے ہے اور یہ دوسرا وجود سے ہے، اور وجود کبھی مشاہدہ سے ہوتا ہے اور کبھی نہیں ہوتا۔\n\n۳. **اپنے رب سے کہنے والا:** وہ ہے جس نے دیکھا کہ ذات حق (Al-Ḥaqq) عین ہستی (Al-Wujūd) ہے، کوئی دوسری چیز نہیں، اور ممکنات کا ہستی (Al-Wujūd) سے متصف ہونا ذات حق کا اپنے اعیان کے ذریعے اپنے لیے ظاہر ہونا ہے۔ اور یہ اس لیے کہ ان کا اللہ سے ہستی کا فائدہ حاصل کرنا اس کی ہستی کے لحاظ سے ہے، کیونکہ مستفاد ہستی جو ظاہر ہے، وہ ان اعیان پر حکم لگانے کا عین ہے۔ پس اس نے اپنے رب سے لا إله إلا الله کہا۔\n\n۴. **اپنے رب کی صفت سے کہنے والا:** وہ ہے جس نے دیکھا کہ ذات حق سبحانہ اپنی احدیت اور ذات کے لحاظ سے مسمیٰ اللہ اور رب نہیں ہے، کیونکہ وہ اضافت کو قبول نہیں کرتا۔ اور اس نے دیکھا کہ مسمیٰ رب مربوب (جس کی ربوبیت کی جائے) کا تقاضا کرتا ہے، اور مسمیٰ اللہ مألوہ (جس کی عبادت کی جائے) کا تقاضا کرتا ہے۔ اور اس نے دیکھا کہ جب انہوں نے اس سے ہستی کا فائدہ حاصل کیا تو اس کے لیے رب کا نام ثابت ہوا، کیونکہ مربوب اس کا طالب تھا۔ پس مربوب اسم رب کے ثبوت میں اصل ہے، اور ذات حق کا وجود ممکنات کے وجود میں اصل ہے۔ اور اس نے دیکھا کہ لا إله إلا الله عین ذات کا تقاضا نہیں کرتا۔ پس اس نے لا إله إلا الله رب کی صفت سے کہا، جس صفت سے مربوب نے اسے موصوف کیا۔ پس ہمارا علم ہمارے علم بہ (اس کے علم) میں اصل ہے۔\n\nآپ علیہ السلام فرماتے ہیں: \"جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا\"۔\n\nپس ہمارا وجود اس کے وجود پر موقوف ہے، اور اس کا علم ہم پر علم پر موقوف ہے۔ پس وہ ایک لحاظ سے اصل ہے اور ہم ایک لحاظ سے اصل ہیں۔\n\n۵. **اپنے حال سے کہنے والا:** وہ ہے جو اپنے معاملات میں غیر اللہ پر بھروسہ کرتا ہے، پس جب اسے اس چیز کا حصول نہیں ہوتا جس کے حصول کی اس نے کوشش کی تھی جس پر اس نے بھروسہ کیا تھا، اور تمام جہتوں سے اس کے سامنے دروازے بند ہو جاتے ہیں، تو وہ اضطراراً اللہ کی طرف رجوع کرتا ہے، پس اس نے اپنے حال سے لا إله إلا الله کہا۔\n\nیہ تمام اقسام ایمان سے متصف نہیں ہیں، کیونکہ ان میں سے کسی نے بھی اسے تقلید کی بنا پر نہیں کہا۔\n\n۶. **اپنے حکم سے کہنے والا:** وہ ہے جس نے اسے شارع کے قول کی وجہ سے کہا، جہاں شارع نے اسے یہ کہنے کا واجب کیا اور اس پر یہ کہنے کا حکم لگایا۔ اگر یہ حکم نہ ہوتا تو وہ اسے قربت الٰہی کی نیت سے نہ کہتا، اور شاید اگر وہ کہتا بھی تو معلم یا متعلم کے طور پر کہتا۔\n\n### [وہ اسم جامع جو تمام اسماء سے موصوف ہے]\n\nمیں اپنے شیخ ابو العباس العریبی، جو اہل علیا میں سے تھے، کے پاس گیا، اور وہ اسم اللہ کے ذکر میں مستغرق رہتے تھے اور اس کے علاوہ کچھ نہیں کہتے تھے۔ میں نے ان سے کہا: \"اے میرے آقا! آپ لا إله إلا الله کیوں نہیں کہتے؟\" تو انہوں نے فرمایا: \"اے میرے بیٹے! سانسیں اللہ کے ہاتھ میں ہیں، میرے ہاتھ میں نہیں ہیں۔ پس مجھے ڈر ہے کہ جب میں 'لا إله' کہوں تو اللہ میری روح قبض کر لے، اور میں نفی کی وحشت میں قبض ہو جاؤں\"۔\n\nاور میں نے ایک دوسرے شیخ سے اس بارے میں پوچھا تو انہوں نے فرمایا: \"میری آنکھ نے نہیں دیکھا اور میرے کان نے نہیں سنا کہ اللہ کے سوا کوئی 'أنا الله' (میں اللہ ہوں) کہتا ہو، پس مجھے کوئی ایسا نہیں ملا جس کی میں نفی کروں، لہٰذا میں وہی کہتا ہوں جو میں نے اسے کہتے سنا ہے: اللہ، اللہ\"۔\n\nاور ہمیں توحید میں اسی اسم (اللہ) کے ساتھ عبادت کا حکم دیا گیا ہے کیونکہ یہ وہ اسم جامع ہے جو تمام الٰہی اسماء سے موصوف ہے، اور یہ منقول نہیں ہے کہ کسی بھی معبود نے اس میں شرکت کی ہو، بخلاف دوسرے اسماء جیسے \"إله\" وغیرہ۔\n\nاور اس قدر قول سے، جب وہ شارع کے قول کی وجہ سے کہا جائے، تو ایمان ثابت ہو جاتا ہے۔ اور شارع نے صرف \"حتی یقولوا لا إله إلا الله\" (یہاں تک کہ وہ لا إله إلا الله کہہ دیں) فرمایا، اور \"محمد رسول الله\" نہیں فرمایا، کیونکہ توحید کی یہ گواہی رسالت کی گواہی کو اپنے اندر شامل کرتی ہے۔ کیونکہ لا إله إلا الله کہنے والا تب تک مؤمن نہیں ہوتا جب تک وہ اسے رسول اللہ صلی اللہ علیہ وسلم کے قول کی وجہ سے نہ کہے۔ پس جب وہ اسے آپ کے قول کی وجہ سے کہتا ہے تو یہ عین آپ کی رسالت کا اثبات ہے۔ چونکہ یہ خاص کلمہ رسالت کی گواہی کو شامل ہے، اس لیے آپ نے \"قولوا محمد رسول الله\" نہیں فرمایا۔ اور آپ نے قول کے علاوہ، یعنی ایمان میں، ایمان کو اللہ پر ایمان کے ساتھ ملا دیا، اور یہ ایمان ایک معانی میں سے ہے جو حس سے ادراک نہیں ہوتا۔ پس آپ نے اللہ پر ایمان کے ساتھ آپ پر اور آپ کی لائی ہوئی چیزوں پر ایمان کو ملا دیا، یعنی وہ چیزیں جو آپ کو اللہ کی طرف سے شریعت بنانے کا حق ہے، بغیر اللہ سے نقل کیے ہوئے۔\n\nپس آپ نے ابن عمر کی حدیث میں، جب آپ نے اللہ پر ایمان، نماز، زکوٰۃ، حج اور روزے کا ذکر کیا، اور یہ سب اللہ کی طرف سے آئے ہیں، تو فرمایا: \"مجھے حکم دیا گیا ہے کہ میں لوگوں سے جنگ کروں یہاں تک کہ وہ گواہی دیں کہ اللہ کے سوا کوئی معبود نہیں اور مجھ پر اور جو کچھ میں لایا ہوں اس پر ایمان لائیں\"۔\n\nیہ مقلد منافق کی وجہ سے ہے، کیونکہ وہ اسے اپنے دل میں ایمان اور اعتقاد کے بغیر کہتا ہے۔ اور جاہل منافق اسے آپ کے قول کی وجہ سے نہیں کہتا، حالانکہ وہ اپنی کتاب سے جانتا ہے کہ آپ اللہ کے رسول ہیں، نہ کہ اپنی عقلی دلیل سے۔\n\n### [توحید عقلی اور توحید شرعی]\n\nاور جان لو کہ توحید کی گواہی کے ساتھ رسالت کی گواہی کا تلفظ کرنے میں ایک الٰہی راز ہے جو ذات حق (Al-Ḥaqq) سبحانہ نے ہمیں بتایا ہے، اور وہ یہ ہے کہ وہ معبود واحد جس کی صفت اور نعت شارع نے بیان کی ہے، وہ وہ الٰہی توحید نہیں ہے جسے عقل نے ادراک کیا ہے، کیونکہ وہ توحید رسالت کی گواہی کو توحید کی گواہی کے ساتھ ملانے کو قبول نہیں کرتی۔ پس یہ توحید، اس لحاظ سے کہ شارع اسے جانتا ہے، وہ توحید نہیں ہے جسے عقلی غور و فکر (Naẓar al-‘Aqlī) نے ثابت کیا ہے۔ اور جب وہ معبود جس کی عبادت اور توحید کی طرف شریعت نے ہمیں بلایا ہے، وہ صرف معبود ہونے کے مرتبے میں ہے نہ کہ اپنی ذات میں، تو یہ صحیح ہے کہ تم اسے ان صفات سے موصوف کرو جن سے شارع نے اسے موصوف کیا ہے، جیسے نزول، استواء، معیت، تردد اور تدبر، اور اس جیسی دیگر صفات جو خالص عقلی توحید، جو شریعت سے مجرد ہو، قبول نہیں کرتی۔ پس اس معبود کے لیے ضروری ہے کہ اس کی توحید کی گواہی کے ساتھ اس کے رسول کی رسالت کی گواہی کو ملایا جائے، اسی لیے اس کے ساتھ اضافہ کیا جاتا ہے اور کہا جاتا ہے: \"أشهد أن لا إله إلا الله، أشهد أن محمداً رسول الله\" (میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، میں گواہی دیتا ہوں کہ محمد اللہ کے رسول ہیں)، ہر روز پانچ نمازوں کی اذان اور اقامت میں تیس بار۔\n\nاور اس رسالتی گواہی کا تلفظ کرنے والوں میں بھی وہی تفصیل ہے جو توحید کی گواہی میں ہے، پس ہم اسی اسلوب پر مراتب کے ساتھ چلیں گے۔\n\n### [سنت اور بدعت]\n\nاور اللہ اور اس کے رسول پر ایمان میں ہر اس چیز پر ایمان لانا شامل ہے جو اللہ کی طرف سے آئی ہے اور جو آپ کی طرف سے آئی ہے، جسے آپ نے سنت بنایا اور شریعت قرار دیا۔ اور جو کچھ آپ نے سنت بنایا ہے اس میں اس شخص کی سنت پر ایمان لانا بھی شامل ہے جس نے کوئی اچھی سنت جاری کی، پس شریعت جاری رہی، اور اس عبادت کا وقوع جس کی ترغیب دی گئی ہے، جو کسی ثابت حکم کو قیامت تک منسوخ نہ کرے۔ اور یہ حکم خاص طور پر اسی امت کے لیے ہے، اور میں حکم سے مراد اس کا سنت نام رکھنا لیتا ہوں، جو اس امت کی تشریف ہے۔ اور یہ ان سے پہلی امتوں کے حق میں رہبانیت کہلاتی تھی، اللہ تعالیٰ نے فرمایا:\nوَرَهْبَانِيَّةً ابْتَدَعُوهَا\n(اور رہبانیت جو انہوں نے خود ایجاد کر لی) (الحديد: ۲۷)۔\nپس جس نے اس امت میں کسی ایسی چیز کو بدعت کہا جسے شارع نے سنت کہا ہے، تو اس نے سنت کو نہیں پایا، مگر یہ کہ وہ بات اس تک نہ پہنچی ہو۔ اور اتباع، ابتداع سے بہتر ہے۔ اور اتباع اور ابتداع کے درمیان فرق معقول ہے۔ اسی لیے شارع نے اسے سنت کا نام دینے کی طرف مائل کیا اور اسے بدعت نہیں کہا، کیونکہ ابتداع کسی چیز کو بغیر کسی سابقہ مثال کے ظاہر کرنا ہے۔ اسی لیے ذات حق (Al-Ḥaqq) تعالیٰ نے اپنے بارے میں فرمایا:\nبَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ\n(آسمانوں اور زمین کا موجد)۔\nیعنی انہیں بغیر کسی سابقہ مثال کے وجود میں لانے والا۔ پس اگر انسان آج کوئی ایسا امر جاری کرے جس کی شریعت میں کوئی اصل نہ ہو تو وہ ایجاد (إبداع) ہو گا، اور ہمارے لیے اسے اختیار کرنا جائز نہیں ہو گا۔ پس شارع نے ابتداع کے لفظ سے سنت کے لفظ کی طرف عدول کیا، کیونکہ سنت مشروع تھی، اور اللہ نے محمد صلی اللہ علیہ وسلم کے لیے انبیاء علیہم السلام کی ہدایت کی پیروی کو مشروع کیا ہے۔\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\n(اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\n\n(تیسواں حصہ ختم ہوا)",
    "fa": "باب شصت و هفتم در معرفت «لا إله إلا الله محمد رسول الله» و آن همان ایمان است.\n\nحق (الله) از ازل، پیوسته گواهی داد *** که جز او خدایی نیست، اوست الله.\nسپس فرشتگانش به این گواهی دادند *** که جز او خدایی نیست، اوست الله.\nو همه صاحبان علم گواهی دادند *** که جز او خدایی نیست، اوست الله.\nسپس پیامبر فرمود: با من بگویید *** که جز او خدایی نیست، اوست الله.\nبهترین چیزی که من گفتم و پیشینیان ما گفتند *** «لا إله إلا هو الله» است.\nهمه موجودات جز انسان گواهی دادند *** که جز او خدایی نیست، اوست الله.\n\n### [توحید از راه علم و توحید از راه خبر]\n\nخداوند جل ثناؤه در کتاب عزیزش فرمود: «شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ قائِماً بِالْقِسْطِ لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ» (خداوند گواهی داد که معبودی جز او نیست؛ و فرشتگان و صاحبان دانش نیز گواهی دادند، در حالی که او برپا دارنده عدالت است؛ معبودی جز او نیست، که عزیز و حکیم است). سپس فرمود: «إِنَّ الدِّينَ عِنْدَ الله الْإِسْلامُ» (همانا دین در نزد خدا اسلام است). و رسول خدا (صلی الله علیه و سلم) فرمود: «الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله» (اسلام این است که گواهی دهی که معبودی جز الله نیست و محمد رسول خداست).\n\nدر این آیه، خداوند سبحان فرمود: «و أُولُوا الْعِلْمِ» (و صاحبان دانش)، و نفرمود: «و صاحبان ایمان». زیرا گواهی او به توحید برای خودش از طریق خبر نیست که ایمان باشد. به همین دلیل، گواهی‌دهنده در آنچه گواهی می‌دهد، باید بر اساس علم باشد، وگرنه گواهی‌اش صحیح نیست. سپس او عز و جل، ملائکه و صاحبان علم را با حرف «واو» بر خود عطف کرد، و این حرف دلالت بر اشتراک دارد، و در اینجا قطعاً اشتراکی جز در شهادت نیست. سپس آن‌ها را به علم نسبت داد نه به ایمان. پس دانستیم که او کسانی را اراده کرده است که توحید را از راه علم نظری یا ضروری به دست آورده‌اند، نه از راه خبر. گویی می‌فرماید:\n\nو فرشتگان به توحید من با علم ضروری، ناشی از تجلی (التجلی) که علم را به آن‌ها افاضه کرد و جایگزین نظر صحیح در ادله برایشان شد، گواهی دادند. پس برای من به توحید گواهی دادند، همان‌گونه که من برای خودم گواهی دادم. و صاحبان علم با نظر عقلی که در بندگانم قرار دادم [گواهی دادند]. سپس ایمان پس از آن در مرتبه دوم از علما آمد، و این همان چیزی است که در سعادت بر آن تکیه می‌شود، زیرا خداوند به آن امر کرده است. و ما آن را علم نامیدیم، زیرا خبردهنده خود خداوند است، پس فرمود: «فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله» (پس بدان که معبودی جز الله نیست). و خدای تعالی فرمود: «ولِيَعْلَمُوا أَنَّما هُوَ إِلهٌ واحِدٌ» (و تا بدانند که او معبودی یگانه است)، هنگامی که مراتب را در آخر سوره ابراهیم از قرآن عزیز تقسیم کرد. و رسول خدا (صلی الله علیه و سلم) در حدیث صحیح فرمود: «من أمات وهو يعلم أنه لا إله إلا الله دخل الجنة» (هر کس بمیرد در حالی که می‌داند معبودی جز الله نیست، وارد بهشت می‌شود).\n\nو در اینجا نفرمود: «ایمان بیاورد»، زیرا ایمان متوقف بر خبر است، و خداوند فرموده است: «وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا» (و ما عذاب‌کننده نبودیم مگر آنکه رسولی بفرستیم).\n\n### [توحید اهل فترت]\n\nو ما دانستیم که خداوند بندگانی داشته که در دوران‌های فترت (فاصله میان پیامبران) بوده‌اند و آن‌ها از روی علم موحد بوده‌اند. و دعوت رسولان پیش از رسول خدا (صلی الله علیه و سلم) عمومی نبوده که ایمان بر اهل هر زمان لازم باشد. پس این کلام شامل همه دانایان به توحید خدا می‌شود، چه مؤمن باشند از آن جهت که از طریق خبر صادقی که علم‌آور است، عالم به آن هستند، نه از جهت ایمان، و چه غیر مؤمن. زیرا وجود ایمان صحیح نیست مگر پس از آمدن رسول. و رسالت رسول ثابت نمی‌شود مگر آنکه ناظر عاقل بداند که خدایی هست و آن خدا یگانه است. این امر ضروری است، زیرا رسول از جنس کسانی است که به سوی آن‌ها فرستاده شده است، و هیچ فردی از آن جنس بر دیگری اختصاص نمی‌یابد مگر به دلیل نبود معارض، که همان شریک است. پس لازم است که [رسول] عالم به توحید فرستنده خود، یعنی خدای تعالی، باشد. و لازم است که علم به این امر مقدم باشد که این خدا دارای صفتی است که می‌تواند رسولی را با نسبتی خاص بفرستد که عین ذات او نیست. و در این هنگام است که [عاقل] در صدق ادعای این رسول مبنی بر اینکه فرستاده‌ای از جانب خداست، نظر می‌کند، زیرا این امر نزد او ممکن است.\n\n### [مرتبه عالم به توحید خدا از حیث دلیل]\n\nو این‌ها در علم، مراتب معقولی هستند که علم به برخی از آن‌ها متوقف بر علم به دیگری است. و این همه بهره مؤمن نیست، زیرا مرتبه ایمان، که همان تصدیق به اینکه این شخص رسولی از جانب خداست، حاصل نمی‌شود مگر پس از به دست آوردن این علمی که ذکر کردیم. پس هنگامی که دلایل بر صدق او مبنی بر اینکه رسول خداست آمد، نه بر توحید فرستنده او، در آن هنگام خردمندان، صاحبان عقل و اندیشه و نهی، برای آنچه این رسول در رسالتش می‌آورد، آماده می‌شوند. اولین چیزی که در رسالتش گفت این بود که خدایی که مرا فرستاده به شما می‌گوید: «بگویید لا إله إلا الله». پس صاحبان خرد دانستند که عالم به توحید خدا ملزم به تلفظ آن نیست. پس هنگامی که از رسول، امر به تلفظ آن را شنیدند و دانستند که این امر از مدلول دلیل علم به توحید خدا نیست، این عالم موحد از روی ایمان و تصدیق به این رسول، آن را بر زبان آورد. پس اگر عالم، «لا إله إلا الله» را به خاطر قول رسول خدا (صلی الله علیه و سلم) که به امر خدا به او گفته است: «بگو لا إله إلا الله»، بر زبان آورد، مؤمن نامیده می‌شود. زیرا رسول بر او واجب کرده که آن را بگوید، در حالی که او در نفس خود عالم به آن بود و در تلفظ یا عدم تلفظ آن مختار بود. این مرتبه عالم به توحید خدا از حیث دلیل است. پس هر کس بمیرد در حالی که می‌داند معبودی جز الله نیست، بدون شک و تردید وارد بهشت می‌شود و او از سعادتمندان است. اما کسی که در دوران فترت بوده، خداوند او را به تنهایی به عنوان یک امت مبعوث می‌کند، مانند قُسّ بن ساعده؛ نه تابع است، زیرا مؤمن نیست، و نه متبوع است، زیرا رسولی از جانب خدا نیست، بلکه او عالم به خداست و به آنچه از حوادث عالم می‌داند، به هر وجهی که آن را دانسته باشد. و برای هیچ مخلوقی جایز نیست که شریعتی وضع کند که خدا به آن اذن نداده باشد، و نه اینکه وقوع ممکنی از عالم غیب را که خلافش در دلیلش جایز است، به قصد تقرب به خدا واجب سازد، مگر به وحی و اخبار از جانب خدا.\n\n### [بروج فلک و منازل آن و گردش ستارگانش، دلایلی بر حکم آنچه خداوند در دو عالم طبیعت و عناصر جاری می‌سازد]\n\nو در اینجا نکته‌ای است برای کسی که قلب و فطنت دارد، به دلیل قول خدای تعالی: «وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها» (و در هر آسمانی امر آن را وحی کرد) و قول او که همه آنچه را که تا روز قیامت در خلقش جاری می‌سازد، در لوح محفوظ به ودیعه نهاده است. و از جمله آنچه خداوند در آسمان‌هایش وحی کرده و در لوحش به ودیعه نهاده، بعثت رسولان است. پس [علم به آن] از لوح به صورت کشف (الکشف) و اطلاع گرفته می‌شود، و از آسمان به صورت نظر و آزمایش. و علم آن‌ها به بعثت رسولان، همان علم آن‌ها به قرباتی است که رسولان به سوی خدا می‌آورند، و به زمان‌ها و مکان‌ها و اوصاف آن‌ها، و آنچه پس از مرگ برای مردم رخ می‌دهد، و آنچه در بعث و حشر از آن‌ها خواهد بود، و سرانجامشان به سعادت و شقاوت، از بهشت و دوزخ. و اینکه خداوند بروج فلک و منازل آن و گردش ستارگانش را دلایلی بر حکم آنچه خداوند در عالم طبیعی و عنصری از گرما و سرما و خشکی و رطوبت در گرم و سرد و مرطوب و خشک جاری می‌سازد، قرار داده است. پس برخی از آن‌ها مقتضی وجود اجسام در حرکات معلوم هستند، و برخی مقتضی وجود ارواح، و برخی مقتضی بقای مدت آسمان‌ها. و این همان علمی است که ابوطالب مکی به آن اشاره کرده که فلک با انفاس عالم می‌گردد. و با وجود مشاهده همه این‌ها، آن‌ها در این امر با یکدیگر متفاوتند؛ برخی کامل، محقق و مدقق هستند، و برخی دیگر با تفاوت در نزول، از درجه او پایین‌ترند. ما جماعتی از اصحاب خط رمل و دانایان به اندازه‌گیری حرکات افلاک و سیر ستارگان و اقترانات و مقادیر آن‌ها و منازل اقتراناتشان را دیده‌ایم، و آنچه خداوند در آن هنگام از احکام در خلقش پدید می‌آورد، مانند اسباب معتاد در میان عموم که هیچ کس آن را نادان نمی‌شمارد و قائل به آن کافر نمی‌شود. این‌ها نیز نزد دانایان به آن‌ها معتاد است، زیرا بر حسب تألیف طبایعشان، چیزی را می‌دهند که در غیر اقتران با دیگری نمی‌دهند. پس از امور جزئی خبر می‌دهند که دقیقاً مطابق آنچه خبر داده‌اند واقع می‌شود، هرچند که آن امر به حکم اتفاق، با نظر به آن واقع شده باشد، هرچند که در نفس الامر علم باشد. زیرا ناظر در آن بر یقین نیست، حتی اگر در نفس خود به دلیل پیچیدگی امر، قطعیت یابد. پس برای شخص منصف صحیح نیست که بر یقین باشد که در نظرش هیچ نکته‌ای را از دست نداده است، و نه کسی که راه را برای او هموار کرده، از غیر پیامبری که از جانب خدا خبر می‌دهد، چیزی را از دست داده باشد، زیرا متأخر بر حساب متقدم اعتماد می‌کند. پس هنگامی که این را دیدیم، دانستیم که خداوند در خلقش اسراری دارد. و کسی که به این مرتبه از علم دست یافته باشد، هیچ کس در ایمان قوی‌تر از او به آنچه رسولان آورده‌اند و آنچه رسول خدا (صلی الله علیه و سلم) از جانب خدا آورده، نیست، مگر کسی که «يَدْعُو إِلَى الله عَلى‏ بَصِيرَةٍ» (به سوی خدا با بصیرت دعوت می‌کند)، مانند رسول و پیروانش. و سخن ما در برتری دادن، تنها میان این افراد و مؤمنان اهل تقلید است، نه میان رسولان و اولیای خدا و خاصان او که خداوند تعلیم آن‌ها را بر عهده گرفته و رحمتی از جانب خود به آن‌ها عطا کرده و از نزد خود به آن‌ها علم آموخته است. پس آن‌ها در آنچه دانسته‌اند، به حکم قطع عمل می‌کنند نه به حکم اتفاق.\n\n### [علم خط (رمل)، پیامبری که پیش از این به آن مبعوث شد، او ادریس است]\n\nرسول خدا (صلی الله علیه و سلم) درباره علم خط (رمل) می‌فرماید که پیامبری از پیامبران به آن مبعوث شد، گفته شده او ادریس (علیه السلام) است. پس خداوند در آن اشکالی که برای او به جای فرشته برای دیگران قرار داده بود، به او وحی کرد.\n\nو همان‌گونه که فرشته بدون قصد پیامبر برای آمدنش می‌آید، شکل خط نیز بدون قصد زننده خط (صاحب خط) به سوی آن می‌آید. و این‌ها به طور خاص «اُمهات» (مادران) هستند. سپس برای او تشریع شد که شریعت وضع کند، و آن همان سنتی است که رسول صلاح می‌بیند در عالم قرار دهد و اصل آن وحی است. همچنین آنچه صاحب خط از «اُمهات»، از «اولاد» و «اولاد الاولاد» تولید می‌کند، آن اشکال از امر مطلوب، آن‌گونه که هست، برای او سخن می‌گویند. و ضمیر در آن مانند نیت در عمل است، پس خطا نمی‌کند. پیامبر (علیه السلام) درباره دانایان به علم خط فرمود: «فمن وافق خطه» (پس هر کس خطش موافق باشد)، یعنی خط آن پیامبر، آن شخص می‌گوید: «فقد أصاب الحق» (حق را دریافته است). این مانند کسی است که «يَدْعُو إِلَى الله عَلى‏ بَصِيرَةٍ» (به سوی خدا با بصیرت دعوت می‌کند) از پیروان رسولان. پس قول او که «اگر موافق باشد»، آن را علم قطعی نزد خود قرار نداده است، هرچند که در نفس الامر علم باشد. این تفاوت میان این افراد و کسی است که «يَدْعُو إِلَى الله عَلى‏ بَصِيرَةٍ» و کسی که «عَلى‏ بَيِّنَةٍ من رَبِّهِ» (بر دلیل روشنی از پروردگارش است). پس بدان که دانایان به خدا پس از فرشتگان خدا، رسولان خدا و اولیای او هستند، سپس دانایان به ادله و کسانی که پایین‌تر از آن‌ها هستند. و اگرچه علم در نفس الامر موافق باشد، اما نزد خود عالم نیست، به دلیل تردید امکانی که شخص منصف در نفس خود می‌یابد. پس او مؤمن نیست مگر به آنچه در کتاب خدا به طور معین آمده و آنچه از رسول او به طور کلی آمده، نه به تفصیل، مگر آنچه از آن به صورت تواتر به او رسیده باشد. و به همین دلیل به مؤمنان گفته شده است: «آمِنُوا بِاللَّهِ ورَسُولِهِ» (به خدا و رسولش ایمان بیاورید). پس مراتب خلق در علم به خدا برای تو آشکار شد.\n\n### [رسول، معلم توحید برای عالم به خدا و جاهل به اوست]\n\nپس هنگامی که رسول آمد و در برابر او دانایان به خدا و غیر دانایان به خدا بودند و به همه گفت: «بگویید لا إله إلا الله»،\n\nقطعاً دانستیم که او (صلی الله علیه و سلم) در آن قول، معلم کسی است که به توحید خدا از مشرکان علم ندارد. و دانستیم که او در آن قول، همچنین معلم دانایان به خدا و توحید اوست که تلفظ به آن واجب است و آن، نگهدارنده آن‌ها از ریختن خونشان و گرفتن اموالشان و به اسارت بردن فرزندانشان است. و به همین دلیل\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحق الإسلام وحسابهم على الله» (امر شده‌ام که با مردم بجنگم تا بگویند لا إله إلا الله. پس هرگاه آن را گفتند، خون و اموالشان را از من حفظ کرده‌اند، مگر به حق اسلام، و حسابشان با خداست).\n\nو نفرمود: «تا بدانند»، زیرا در میان آن‌ها دانایان نیز هستند. پس حکم در اینجا برای گفتار است نه برای علم. و حکم در روز «يَوْمَ تُبْلَى السَّرائِرُ» (روزی که رازها آشکار می‌شود) در این مورد برای علم است نه برای گفتار. پس این کلمه را عالم و مؤمن و منافقی که نه عالم است و نه مؤمن، بر زبان آوردند. پس اگر این کلمه را گفتند، خون و اموالشان را حفظ کردند، مگر به حق آن در دنیا و آخرت. و حسابشان در آخرت با خداست، به خاطر منافق و کسی که حقی بر عهده‌اش بوده و از او گرفته نشده است. اما در دنیا، به خاطر حدود وضع شده است، زیرا گفتن «لا إله إلا الله» آن‌ها را در دنیا و آخرت ساقط نمی‌کند. و اما حسابشان با خدا در آخرت، «يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ» (روزی که خداوند رسولان را جمع می‌کند و می‌گوید: چه پاسخی شنیدید؟)، پس با قرینه حال می‌دانند که این سؤال و استفهام درباره پاسخ قلبی آن‌هاست. پس می‌گویند: «لا عِلْمَ لَنا» (ما علمی نداریم)، یعنی ما از قلب‌ها مطلع نشدیم، «إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ» (همانا تو خود دانای غیب‌هایی)، که این تأکید و تأییدی است بر آنچه ذکر کردیم.\n\n### [ارکان پنج‌گانه اسلام]\n\nسپس پیامبر (صلی الله علیه و سلم) فرمود: «من اسمه الملك بنى الإسلام على خمس» (کسی که نامش ملک است، اسلام را بر پنج چیز بنا نهاد)، پس آن را به صورت یک ملک (ساختمان) درآورد: گواهی «لا إله إلا الله» که قلب است، و «محمد رسول الله» که حاجب (دربان) است، و برپاداشتن نماز که جناح راست است، و دادن زکات که جناح چپ است، و روزه رمضان که پیش‌رو است، و حج که دنباله‌رو (ساقه) است. و شاید نماز پیش‌رو باشد، به دلیل اینکه نور است و ملک را می‌پوشاند.\n\nو در خبر آمده است که حجاب او نور است. و زکات، سمت راست (می‌مَنه) باشد، زیرا انفاقی است که برای خارج کردن آنچه در ملکیت خود داشته، به قوت نیاز دارد. و حج، سمت چپ (مَیسَره) باشد، به دلیل آنچه در آن از انفاق و قربانی‌ها هست، که با زکات در صدقه و هدیه جمع می‌شود، و هر دو از اعمال دست‌ها هستند. و روزه در دنباله (ساقه) باشد، زیرا پشت سر، نظیر جلو است و آن ضیاء (روشنایی) است، زیرا صبر ضیاء است، و منظور روزه است، و ضیاء از نور است. پس برای موازنه، ساقه بودن برای آن سزاوارتر است، زیرا آخری بر اثر اولی راه می‌رود. و ایمان الهی در روز قیامت این‌گونه خواهد بود. پس ایمان در روز قیامت به صورت یک ملک (ساختمان) با این اوصاف می‌آید: اهل «لا إله إلا الله» در قلب، و اهل نماز در پیش‌رو، و اهل زکات که همان صدقه است در سمت راست، و اهل حج در سمت چپ، و اهل روزه در دنباله. خداوند ما را از کسانی قرار دهد که بنای خانه‌اش بر این قواعد استوار شده است.\n\nپس خانه او ایمان باشد، به تنهایی. از سمت قبله نماز، و از شمال روزه، و از غرب صدقه پنهانی، و از شرق حج. پس ساکن آن قطعاً سعادتمند شده است.\n\n### [بهترین کلمه‌ای که پیامبران گفتند]\n\nو بدان که «لا إله إلا الله» کلمه نفی و اثبات است و بهترین کلمه‌ای است که پیامبران گفته‌اند.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «أفضل الدعاء دعاء يوم عرفة» (بهترین دعا، دعای روز عرفه است)، که در آن اشاره‌ای به دعای عارفان به خداست، «وأفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله» (و بهترین چیزی که من و پیامبران پیش از من گفتیم، لا إله إلا الله است).\n\nو این حدیث از نظر روایت و معنا صحیح است. نفی باید بر چیزی ثابت وارد شود تا آن را نفی کند، زیرا اگر نفی بر چیزی که ثابت نیست (که همان نفی است) وارد شود، آن را اثبات می‌کند، همان‌گونه که عدمِ عدم، هستی (الوجود) است. پس این نفی‌کننده با قول خود «لا إله» چه چیزی را نفی کرده است؟ به ما خبر دهید، ما از شما استفهام کردیم. و آیا حکم اثبات‌کننده نیز مانند حکم منفی است که جز منفی را اثبات نمی‌کند، یا حکم دیگری دارد که آن را از حکم نفی متمایز می‌سازد؟ این نفی‌کننده چه چیزی را نفی کرد و این اثبات‌کننده چه چیزی را اثبات کرد؟ تحقق همه این‌ها ان‌شاءالله ضروری است. پس بدان که نفی بر اعیانی از مخلوقات وارد شد، هنگامی که به الوهیت توصیف شدند و به آن‌ها نسبت داده شدند و درباره آن‌ها گفته شد که آلهه هستند. و به همین دلیل است که مشرکان تعجب کردند، هنگامی که رسول خدا (صلی الله علیه و سلم) آن‌ها را به سوی خدای واحد دعوت کرد. پس خداوند از قول آن‌ها به ما خبر داد که گفتند: «أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ» (آیا خدایان متعدد را یک خدا قرار داده است؟ این واقعاً چیز شگفت‌انگیزی است). پس آن‌ها را آلهه نامیدند، در حالی که آن‌ها دارای این صفت نبودند. پس حکم نفی بر این نسبتی که نزد آن‌ها برای آن اعیان ثابت بود، وارد شد، نه در نفس الامر. و نفی بر نفی الوهیت وارد نشد، زیرا اگر نفی، نفی را نفی می‌کرد، عین اثبات آن چیزی می‌شد که مشرک گمان می‌کرد. پس گویی به مشرک می‌گوید: این قولی که گفتی صحیح نیست، یعنی امر آن‌گونه که تو گمان کردی نیست، و ناگزیر باید خدایی باشد. و کثرت آلهه با حرف ایجاب که همان «إلا» است، منتفی شد. و این نسبت را به مذکور پس از حرف ایجاب، که همان مسمای الله است، واجب کردند. پس گفتند: «لا إله إلا الله». پس نسبت الوهیت برای خدا با اثباتِ اثبات‌کننده ثابت نشد، زیرا او سبحانه خود به خود اله است. بلکه اثبات‌کننده با قول خود «إلا الله»، این امر را در نفس کسی که انفراد او سبحانه به این وصف را اعتقاد نداشت، ثابت کرد. زیرا اثباتِ ثابت محال است، و نفیِ منفی محال نیست. پس در حقیقت، مشرک جز خدا را عبادت نکرد، زیرا اگر الوهیت را در شریک اعتقاد نداشت، او را عبادت نمی‌کرد. و «قَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ» (و پروردگارت حکم کرد که جز او را نپرستید). و به همین دلیل، حق (الحق) برای این وصف غیرت ورزید، پس آن‌ها را در دنیا مجازات کرد، زیرا احترام آن را نگه نداشتند، و به آن‌ها روزی داد و دعایشان را شنید و هنگامی که از خدایشان در گمان خود سؤال کردند، اجابتشان کرد، زیرا او سبحانه می‌دانست که آن‌ها جز به این مرتبه پناه نبرده‌اند، هرچند در نسبت خطا کردند. پس در آخرت به شقاوت ابدی دچار شدند، زیرا رسول آن‌ها را به توحید کسی که این نسبت برای او واجب است، آگاه ساخت، اما آن‌ها نظر نکردند و خود را نصیحت ننمودند. و به همین دلیل، دلالت هر رسولی بر حسب ما بود که بر اهل زمانش غالب بود، تا حجت بر آن‌ها تمام شود و حجت بالغه برای خدا باشد.\n\n### [دسته‌های گویندگان کلمه توحید و مراتب آن‌ها]\n\nپس این کلمه مرتبه عدم و هستی (الوجود) را فرا گرفت و هیچ مرتبه‌ای باقی نماند مگر اینکه تحت نفی و اثبات داخل باشد، پس شمول دارد. پس برخی گوینده «لا إله إلا الله» به نفس خود هستند، و برخی گوینده «لا إله إلا الله» به نعت خود، و برخی گوینده «لا إله إلا الله» به پروردگار خود، و برخی گوینده «لا إله إلا الله» به نعت پروردگار خود، و برخی گوینده «لا إله إلا الله» به حال خود، و برخی گوینده «لا إله إلا الله» به حکم او، که این آخری به طور خاص مؤمن است. و پنج دسته باقی‌مانده را در ایمان مدخلی نیست. اما کسی که «لا إله إلا الله» را به نفس خود گفت، او کسی است که آن را از تجلی (التجلی) خود بر نفسش گفت، پس دید که هستی (الوجود) خود را از غیر خود کسب کرده است. پس رؤیت نفسش به او این را داد که بگوید «لا إله إلا الله»، و این همان توحید ذاتی است که گروهی از محققین به آن اشاره کرده‌اند. و اما گوینده «لا إله إلا الله» به نعت خود، او کسی است که خدا را با علم خود یگانه دانست، زیرا نعت او، علم به توحید و احدیت خداست. پس نطق او، علم اوست. و فرق میان او و اولی این است که اولی از شهود (الشهود) است و این دومی از هستی (الوجود) است، و هستی ممکن است از شهود باشد و ممکن است نباشد. و اما گوینده «لا إله إلا الله» به پروردگار خود، او کسی است که دید حق (الحق) عین هستی (الوجود) است نه امری دیگر، و اینکه متصف شدن ممکنات به هستی، همان ظهور حق (الحق) برای خودش به اعیان آن‌هاست. و این بدان جهت است که کسب هستی برای آن‌ها از جانب خدا، تنها از حیث وجود اوست. پس هستی کسب شده که همان ظاهر است، عین حکم به آن بر این اعیان است. پس گفت: «لا إله إلا الله» به پروردگار خود. و اما گوینده «لا إله إلا الله» به نعت پروردگار خود، او کسی است که دید حق سبحانه از حیث احدیت و ذاتش، مسمای «الله» و «رب» نیست، زیرا اضافه را نمی‌پذیرد. و دید که مسمای «رب» مقتضی «مربوب» (پرورده شده) است و مسمای «الله» طالب «مألوه» (معبود) است. و دید که چون ممکنات از او هستی کسب کردند، اسم «رب» برای او ثابت شد، زیرا مربوب آن را می‌طلبد. پس مربوب، اصلی در ثبوت اسم «رب» است، و وجود حق، اصلی در وجود ممکنات است. و دید که «لا إله إلا الله» را عین ذات نمی‌طلبد. پس گفت: «لا إله إلا الله» به نعت رب که مربوب او را به آن توصیف کرده است. پس علم به ما، اصلی در علم ما به اوست.\n\nپیامبر (علیه السلام) می‌فرماید: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت).\n\nپس هستی ما متوقف بر هستی اوست، و علم به او متوقف بر علم به ماست. پس او از یک جهت اصل است و ما از یک جهت اصل هستیم. و اما گوینده «لا إله إلا الله» به حال خود، او کسی است که در امور خود به غیر خدا تکیه می‌کند. پس هنگامی که دستیابی به آنچه از کسی که به او تکیه کرده، برایش میسر نشد و درهای همه جهات به رویش بسته شد، از روی اضطرار به سوی خدا بازگشت و گفت: «لا إله إلا الله» به حال خود. و این دسته‌ها همگی متصف به ایمان نیستند، زیرا هیچ یک از آن‌ها آن را از روی تقلید نگفته است. و اما کسی که «لا إله إلا الله» را به حکم او گفت، او کسی است که آن را به دلیل قول شارع گفت، آنجا که بر او واجب کرد که آن را بگوید و حکم کرد که آن را بگوید. و اگر این حکم نبود، آن را به قصد تقرب به خدا نمی‌گفت. و شاید اگر آن را می‌گفت، به عنوان معلم یا متعلم می‌گفت.\n\n### [اسم جامع که به همه اسماء توصیف شده است]\n\nبر شیخ ما ابوالعباس العریبی از اهل عُلیا وارد شدم. او شیفته ذکر اسم «الله» بود و چیزی بر آن نمی‌افزود. به او گفتم: ای سرورم، چرا «لا إله إلا الله» نمی‌گویی؟ به من گفت: ای فرزندم، نفس‌ها در دست خداست، نه در دست من. می‌ترسم که خداوند روحم را هنگامی که می‌گویم «لا» (نیست) قبض کند، و در وحشت نفی قبض شوم. از شیخ دیگری درباره این موضوع پرسیدم، به من گفت: چشم من ندیده و گوش من نشنیده است کسی جز خدا بگوید «من الله هستم». پس کسی را نیافتم که نفی کنم، لذا می‌گویم همان‌گونه که شنیدم او می‌گوید: «الله، الله». و ما تنها به این اسم در توحید تعبد یافتیم، زیرا اسم جامع است که به همه اسماء الهی توصیف شده است، و نقل نشده که هیچ یک از معبودان در آن مشارکتی داشته باشند، برخلاف سایر اسماء مانند «إله» و غیره. و با همین مقدار از گفتار، اگر به دلیل قول شارع گفته شود، ایمان ثابت می‌شود. و شارع تنها فرمود: «تا بگویند لا إله إلا الله» و نفرمود «محمد رسول الله»، زیرا این شهادت توحید، متضمن شهادت به رسالت است. چرا که گوینده «لا إله إلا الله» مؤمن نخواهد بود مگر زمانی که آن را به دلیل قول رسول خدا (صلی الله علیه و سلم) بگوید. پس اگر آن را به دلیل قول او گفت، عین اثبات رسالت اوست. چون این کلمه خاص، شهادت به رسالت را در بر داشت، به همین دلیل نفرمود: «بگویید محمد رسول الله». و در غیر گفتار، که همان ایمان است، ایمان را قرین ایمان به خدا قرار داد. و ایمان معنایی از معانی است که با حس درک نمی‌شود. پس ایمان به خدا را قرین ایمان به او و آنچه آورده است، قرار داد؛ یعنی آنچه از نزد خود آورده و حق تشریع آن را داشته، بدون نقل از خدا.\n\nپس در حدیث ابن عمر، هنگامی که ایمان به خدا و نماز و زکات و حج و روزه را ذکر کرد، و همه این‌ها از جانب خدا آمده است، فرمود: در حدیث ابن عمر آمده است: «أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ويؤمنوا بي وبما جئت به» (امر شده‌ام که با مردم بجنگم تا گواهی دهند که معبودی جز الله نیست و به من و آنچه آورده‌ام ایمان بیاورند).\n\nاین [افزودن ایمان به رسول] به خاطر منافق مقلد است، زیرا او آن را بدون ایمان قلبی و اعتقاد می‌گوید. و منافق منکر، آن را نه به دلیل قول رسول، بلکه با علم به اینکه او رسول خداست (از کتاب خودشان نه از دلیل عقلی)، می‌گوید.\n\n### [توحید عقلی و توحید شرعی]\n\nو بدان که در تلفظ به شهادت رسالت که قرین شهادت توحید است، سری الهی وجود دارد که حق سبحانه ما را به آن آگاه ساخت. و آن این است که خدای واحدی که شارع وصف و نعت او را آورده، همان توحید الهی نیست که عقل آن را درک کرده است. زیرا آن [توحید عقلی]، قرین شدن شهادت به رسالت با شهادت به توحید را نمی‌پذیرد. پس این توحید، از حیث آنچه شارع می‌داند، همان توحیدی نیست که نظر عقلی آن را اثبات کرده است. و اگر خدایی که شرع ما را به عبادت و توحید او فراخوانده، تنها در مرتبه اله بودن او باشد نه در ذات او، صحیح است که او را به آنچه شارع توصیف کرده، از قبیل نزول، استواء، معیت، تردد و تدبر و مانند آن از صفاتی که توحید عقل محضِ مجرد از شرع آن‌ها را نمی‌پذیرد، توصیف کنی. پس شایسته است که شهادت رسول به رسالتش، قرین شهادت توحید فرستنده او باشد. و به همین دلیل به آن اضافه می‌شود و گفته می‌شود: «أشهد أن لا إله إلا الله، أشهد أن محمدا رسول الله» (گواهی می‌دهم که معبودی جز الله نیست، گواهی می‌دهم که محمد رسول خداست)، هر روز سی بار در اذان نمازهای پنج‌گانه و در اقامه. و کسانی که به این شهادت رسالی تلفظ می‌کنند، تفصیل در مورد آن‌ها مانند تفصیل در شهادت توحید است. پس باید بر همان شیوه مراتب پیش برویم.\n\n### [سنت و بدعت]\n\nو در ایمان به خدا و رسولش، ایمان به هر چیزی است که او از جانب خدا آورده و آنچه از نزد خود سنت و شریعت قرار داده است. و در آنچه سنت قرار داده، ایمان به سنت کسی که سنت حسنه‌ای را بنا نهاده، داخل می‌شود، به شرطی که شریعت مستمر باشد و پدید آمدن عبادت مورد رغبت، حکمی ثابت تا روز قیامت را نسخ نکند. و این حکم خاص این امت است، و منظورم از حکم، نامیدن آن به «سنت» است، برای تشریف این امت. در حالی که در حق امت‌های گذشته، «رهبانیت» نامیده می‌شد. خداوند تعالی فرمود: «ورَهْبانِيَّةً ابْتَدَعُوها» (و رهبانیتی که خودشان بدعت گذاشتند). پس هر کس در این امت، چیزی را که شارع آن را سنت نامیده، بدعت بنامد، سنت را درنیافته است، مگر اینکه آن [نامگذاری شارع] به او نرسیده باشد. و پیروی (اتباع) بهتر از بدعت‌گذاری (ابتداع) است. و فرق میان پیروی و بدعت‌گذاری معقول است. و به همین دلیل شارع به نامیدن آن «سنت» متمایل شد و آن را «بدعت» ننامید، زیرا بدعت‌گذاری، آشکار ساختن امری است که اصل آن بر غیر مثال است. و به همین دلیل حق تعالی درباره خود فرمود: «بَدِيعُ السَّماواتِ والْأَرْضِ» (پدیدآورنده آسمان‌ها و زمین)، یعنی ایجادکننده آن‌ها بدون مثال قبلی. پس اگر امروز انسانی امری را تشریع کند که در شرع اصلی ندارد، آن ابداع خواهد بود و برای ما جایز نیست که آن را بپذیریم. پس شارع از لفظ بدعت‌گذاری به لفظ سنت عدول کرد، زیرا سنت مشروع است. و خداوند برای محمد (صلی الله علیه و سلم) اقتدا به هدایت پیامبران (علیهم السلام) را تشریع کرد. و «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را نشان می‌دهد). جزء سی‌ام به پایان رسید."
  },
  "page_count": 5
}