{
  "id": 557,
  "title": {
    "ar": "الباب السابع والخمسون وخمسمائة في معرفة ختم الأولياء على الإطلاق",
    "en": "Chapter Five Hundred and Fifty-Seven, Concerning the Gnosis (معرفة) of the Seal of the Saints (ختم الأولياء) Absolutely.",
    "ur": "باب پانچ سو ستاون (۵۵۷): مطلقاً (على الإطلاق) اولیاء (الأولياء) کی مہر (ختم الأولياء) کی معرفت (معرفة) کا بیان۔",
    "fa": "باب پانصد و هفتاد و هفتم در معرفت ختم اولیاء (ختم الأولياء) به طور مطلق"
  },
  "content": {
    "ar": "## «الباب السابع والخمسون وخمسمائة في معرفة ختم الأولياء على الإطلاق»\n\n\n> ألا إن ختم الأولياء رسول *** وليس له في العالمين عديل‏\n\n\n> هو الروح وابن الروح والأم مريم *** وهذا مقام ما إليه سبيل‏\n\n\n> فينزل فينا مقسطا حكما بنا *** وما كان من حكم له فيزول‏\n\n\n> فيقتل خنزير أو يدمغ باطلا *** وليس له إلا الإله دليل‏\n\n\n> يؤيده في كل حال بآية *** يراها برأي العين فهو كفيل‏\n\n\n> يقيم بإعلام الهدى شرع أحمد *** يكون له منه لديه مقيل‏\n\n\n> يفيض عليه من وسيلة ملكه *** ولكنه في حالتيه نزيل‏\n\n\n### [إن لله وليا خاتم الأولياء في آخر الزمان يحكم بشرع محمد صَلَّى اللهُ عَليهِ وسَلَّم في أمته‏]\n\n\nاعلم وفقنا الله وإياك أن الله تعالى من كرامة محمد صَلَّى اللهُ عَليهِ وسَلَّم على ربه أن جعل من أمته رسلا ثم إنه اختص من الرسل من بعدت نسبته من البشر فكان نصفه بشرا ونصفه الآخر روحا مطهرة ملكا لأن جبريل وهبه لمريم بَشَراً سَوِيًّا رَفَعَهُ الله إِلَيْهِ ثم ينزله وليا خاتم الأولياء في آخر الزمان يحكم بشرع محمد صَلَّى اللهُ عَليهِ وسَلَّم في أمته وليس يختم إلا ولاية الرسل والأنبياء وختم الولاية المحمدي يختم ولاية الأولياء لتتميز المراتب بين ولاية الولي وولاية الرسل فإذا نزل وليا فإن خاتم الأولياء يكون ختما لولاية عيسى من حيث ما هو من هذه الأمة حاكما بشرع غيره كما إن محمدا خاتم النبيين وإن نزل بعده عيسى كذلك حكم عيسى في ولايته بتقدمه بالزمان خاتم ولاية الأولياء وعيسى منهم ورتبته قد ذكرناها في كتابنا المسمى عنقاء مغرب فيه ذكره وذكر المهدي الذي ذكره رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فأغنى عن ذكره في هذا الكتاب ومنزلته لا خفاء بها فإن عيسى كما قال رَسُولُ الله وكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ ورُوحٌ مِنْهُ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر الأحد والثلاثون‏\nبسم الله الرحمن الرحيم‏\n\n",
    "en": "Chapter Five Hundred and Fifty-Seven: Concerning the Knowledge of the Seal of the Saints (ختم الأولياء) Absolutely\n\n> Behold, the Seal of the Saints (ختم الأولياء) is a Messenger, / And he has no equal in the worlds.\n> He is the Spirit (الروح), the son of the Spirit, and the mother is Maryam, / And this is a station (مقام) to which there is no path.\n> He descends among us as a just judge (حكما), ruling over us, / And whatever judgment he makes shall not pass away.\n> He kills the swine or crushes falsehood, / And he has no guide (دليل) except the God (الإله).\n> He is supported in every state by a Sign (آية), / Which he sees with the eye of certainty, and thus he is the guarantor.\n> He establishes the Law (شرع) of Ahmad (Muhammad) through the proclamation of guidance, / And he finds rest (مقيل) with Him (Allah) from it.\n> He receives an outpouring from the means of His dominion, / Yet he is a sojourner (نزيل) in both his states.\n\n[Indeed, Allah has a Saint (ولي), the Seal of the Saints (خاتم الأولياء), who in the End of Time shall rule by the Law (شرع) of Muhammad (peace and blessings be upon him) among his Community.]\n\nKnow—may Allah grant success to us and to you—that among the honors Allah Almighty bestowed upon Muhammad (peace and blessings be upon him) before his Lord was that He made Messengers from his Community (الأمة). Then He singled out from these Messengers one whose lineage was distant from humanity, such that half of him was human and the other half was a purified Spirit (روح مطهرة), an angel (ملك). This is because Gabriel bestowed him upon Maryam as a perfect human (بَشَراً سَوِيّاً), whom Allah raised up to Himself. Then He shall send him down as a Saint (ولي), the Seal of the Saints (خاتم الأولياء), in the End of Time, ruling by the Law (شرع) of Muhammad (peace and blessings be upon him) among his Community.\n\nHe seals nothing but the sainthood (ولاية) of the Messengers and Prophets. The Muhammadan Seal of Sainthood (ختم الولاية المحمدي) seals the sainthood (ولاية) of the Saints (الأولياء) so that the Levels (المراتب) may be distinguished between the sainthood of the Saint and the sainthood of the Messengers. Thus, when he descends as a Saint, the Seal of the Saints (خاتم الأولياء) becomes the seal for the sainthood (ولاية) of Jesus ('Isa), insofar as he is from this Community (الأمة), ruling by the Law of another. Just as Muhammad is the Seal of the Prophets (خاتم النبيين), even though Jesus descends after him, likewise, the ruling of Jesus in his sainthood (ولاية), due to his precedence in time, is the Seal of the Sainthood of the Saints (ختم ولاية الأولياء), and Jesus is one of them.\n\nWe have already mentioned his rank (رتبته) in our book entitled *The Gryphon of the West* (*'Anqa' Mughrib*), which contains mention of him and mention of the Mahdi whom the Messenger of Allah (peace and blessings be upon him) mentioned. This suffices for mentioning him in this book, and his station (منزلته) is not hidden. For Jesus is, as the Messenger of Allah said, <<وَكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ وَرُوحٌ مِنْهُ>> (and His Word which He cast unto Maryam, and a Spirit from Him). And Allah speaks the Truth (الحق), and He guides the way.\n\nThe Thirty-First Journey (السفر) is concluded.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب پانچ سو ستاون: مطلق طور پر اولیاء کے خاتم کی معرفت میں\n\nخبردار! اولیاء کا خاتم ایک رسول ہے\nاور عالمین میں اس کا کوئی ہمسر نہیں\n\nوہ روح ہے اور روح کا بیٹا ہے، اور ماں مریم\nاور یہ ایسا مقام ہے جس تک کوئی راستہ نہیں\n\nپس وہ ہم میں انصاف کرنے والا، ہم پر حاکم بن کر نازل ہوگا\nاور جو بھی اس کا حکم نہ ہوگا وہ زائل ہو جائے گا\n\nوہ خنزیر کو قتل کرے گا یا باطل کو کچل دے گا\nاور اس کے لیے اللہ کے سوا کوئی دلیل نہیں\n\nوہ ہر حال میں ایک نشانی کے ذریعے اس کی تائید کرتا ہے\nجسے وہ آنکھوں سے دیکھتا ہے، پس وہ ضامن ہے\n\nوہ ہدایت کے اعلان کے ذریعے احمد (محمد ﷺ) کی شریعت کو قائم کرے گا\nاس کے لیے اس (شریعت) کی طرف سے اس کے پاس ٹھکانہ ہوگا\n\nاس کے ملک (بادشاہت) کے وسیلے سے اس پر فیضان ہوگا\nلیکن وہ اپنی دونوں حالتوں میں مہمان (نازل ہونے والا) ہے\n\n### [بے شک اللہ کا ایک ولی ہے جو آخر زمانے میں اولیاء کا خاتم ہوگا اور وہ امت محمدیہ میں شریعت محمدی (صَلَّى اللهُ عَليهِ وسَلَّم) کے مطابق حکم کرے گا]\n\nجان لو، اللہ ہمیں اور تمہیں توفیق دے، کہ اللہ تعالیٰ نے محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کی اپنے رب کے ہاں کرامت کی وجہ سے ان کی امت میں سے رسول بنائے، پھر اس نے ان رسولوں میں سے ایک کو خاص کیا جس کا نسب انسانوں سے دور تھا، پس اس کا نصف بشر تھا اور دوسرا نصف پاکیزہ روح (روح مطہرہ) فرشتہ (ملک) تھا۔ کیونکہ جبریل نے اسے مریم کو ایک \"بَشَراً سَوِيًّا\" (متناسب بشر) کے طور پر عطا کیا تھا، جسے اللہ نے اپنی طرف اٹھا لیا۔\n\nپھر وہ اسے آخر زمانے میں ولی (ولی) اور اولیاء کا خاتم (خاتم الأولياء) بنا کر نازل کرے گا، جو امت محمدیہ میں شریعت محمدی (صَلَّى اللهُ عَليهِ وسَلَّم) کے مطابق حکم کرے گا۔ اور وہ صرف رسولوں اور انبیاء کی ولایت (ولایۃ الرسل والأنبیاء) کو ہی ختم کرتا ہے۔ اور محمدی ولایت (الولایۃ المحمدیۃ) کا خاتم اولیاء کی ولایت کو ختم کرتا ہے تاکہ ولی کی ولایت اور رسولوں کی ولایت کے درمیان مراتب ممتاز ہو جائیں۔\n\nپس جب وہ ولی (ولی) بن کر نازل ہوگا، تو اولیاء کا خاتم (خاتم الأولياء) عیسیٰ (علیہ السلام) کی ولایت (ولایۃ عیسیٰ) کے لیے خاتم ہوگا، اس حیثیت سے کہ وہ اس امت میں سے ہے اور کسی دوسرے کی شریعت کے مطابق حکم کرنے والا ہے۔ جیسا کہ محمد (صَلَّى اللهُ عَليهِ وسَلَّم) خاتم النبیین ہیں، اگرچہ ان کے بعد عیسیٰ (علیہ السلام) نازل ہوں گے۔ اسی طرح عیسیٰ (علیہ السلام) کا اپنی ولایت (ولایت) میں حکم، زمانے میں ان کی تقدم کی وجہ سے، اولیاء کی ولایت (ولایۃ الأولیاء) کا خاتم ہے، اور عیسیٰ (علیہ السلام) ان میں سے ہیں۔\n\nاور ان کا مرتبہ ہم اپنی کتاب \"عنقاء مغرب\" میں بیان کر چکے ہیں، جس میں ان کا ذکر اور اس مہدی کا ذکر ہے جسے رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) نے بیان فرمایا، لہٰذا اس کتاب میں ان کے ذکر کی ضرورت نہیں۔ اور ان کے منصب میں کوئی پوشیدگی نہیں، کیونکہ عیسیٰ (علیہ السلام) جیسا کہ اللہ کے رسول نے فرمایا، \"وَكَلِمَتُهُ أَلْقَاهَا إِلَىٰ مَرْيَمَ وَرُوحٌ مِّنْهُ\" (اور اس کا کلمہ جسے اس نے مریم کی طرف ڈالا اور اس کی طرف سے ایک روح ہے)۔\n\nاور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے۔ اکتیسواں سفر (حصہ) مکمل ہوا۔\n\nشروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
    "fa": "باب پانصد و پنجاه و هفتم در معرفت خاتم اولیاء به طور مطلق\n\nآگاه باشید که خاتم اولیاء رسولی است (ألا إن ختم الأولياء رسول) *** و او را در عالَم‌ها همتایی نیست (وليس له في العالمين عديل).\nاو روح است و پسر روح و مادرش مریم (هو الروح وابن الروح والأم مريم) *** و این مقامی است که راهی به سوی آن نیست (وهذا مقام ما إليه سبيل).\nپس در میان ما فرود می‌آید، دادگر و حاکم بر ما (فينزل فينا مقسطا حكما بنا) *** و هر حکمی که از آنِ او نباشد، زائل می‌گردد (وما كان من حكم له فيزول).\nپس خوک را می‌کشد یا باطل را در هم می‌کوبد (فيقتل خنزير أو يدمغ باطلا) *** و او را جز خداوند دلیلی نیست (وليس له إلا الإله دليل).\nاو را در هر حالی با نشانه‌ای تأیید می‌کند (يؤيده في كل حال بآية) *** که آن را با چشم بصیرت می‌بیند، پس او کفیل است (يراها برأي العين فهو كفيل).\nبا اعلام هدایت، شریعت احمد (پیامبر) را برپا می‌دارد (يقيم بإعلام الهدى شرع أحمد) *** و از جانب او (خداوند) در نزدش جایگاهی برای استراحت خواهد بود (يكون له منه لديه مقيل).\nاز وسیله مُلک خویش بر او فیض می‌بخشد (يفيض عليه من وسيلة ملكه) *** اما او در هر دو حالتش (نزول و صعود) مهمان است (ولكنه في حالتيه نزيل).\n\n[همانا خداوند را ولیّی است که خاتم اولیاء در آخرالزمان است و به شریعت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در امت او حکم می‌کند]\n\nبدان، خداوند ما و تو را توفیق دهد، که همانا خداوند متعال از کرامت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) بر پروردگارش این است که از امت او رسولانی قرار داد. سپس از میان رسولان، کسی را برگزید که نسبتش از بشر دور بود؛ پس نیمی از او بشر بود و نیم دیگرش روحی مطهر و مَلَکی، زیرا جبرئیل او را به مریم بخشید، «بشری معتدل» (بَشَراً سَوِيًّا) که خداوند او را به سوی خود بالا برد. سپس او را به عنوان ولیّ و خاتم اولیاء در آخرالزمان نازل می‌کند تا به شریعت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در امت او حکم کند.\n\nو ختم نمی‌شود مگر ولایت (الولاية) رسولان و انبیاء. و خاتم ولایت محمدی، ولایت اولیاء را ختم می‌کند تا مراتب میان ولایت ولیّ و ولایت رسولان متمایز گردد. پس هنگامی که او (عیسی) به عنوان ولیّ نازل می‌شود، خاتم اولیاء، ختمی برای ولایت عیسی خواهد بود، از آن جهت که او از این امت است و به شریعت دیگری حکم می‌کند. همان‌طور که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) خاتم پیامبران است، اگرچه عیسی پس از او نازل می‌شود. همچنین حکم عیسی در ولایتش، به سبب تقدم زمانی‌اش، خاتم ولایت اولیاء است و عیسی از جمله آنان است.\n\nو مرتبه او را در کتابمان به نام «عنقاء مغرب» ذکر کرده‌ایم که در آن از او و از مهدی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) ذکر کرده، یاد شده است؛ لذا نیازی به ذکر او در این کتاب نیست. و منزلت او پوشیده نیست، زیرا عیسی همان‌گونه که خداوند فرمود: «رسول خدا و کلمه‌ای که آن را به مریم القا کرد و روحی از جانب او» (رَسُولُ الله وكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ ورُوحٌ مِنْهُ). و خداوند حق می‌گوید و او راه را هدایت می‌کند (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ). سفر سی و یکم به پایان رسید.\n\nبه نام خداوند بخشنده مهربان."
  },
  "page_count": 2
}