{
  "id": 190,
  "title": {
    "ar": "الباب التسعون ومائة في معرفة المسافر",
    "en": "Chapter One Hundred and Ninety: Concerning the Gnosis (المعرفة) of the Traveler (المسافر)",
    "ur": "باب ایک سو نوے مسافر کی معرفت میں",
    "fa": "باب صد و نودم در معرفت مسافر"
  },
  "content": {
    "ar": "### (الباب التسعون ومائة في معرفة المسافر\n\n\nوهو الذي أسفر له سلوكه عن أمور مقصودة له وغير مقصودة وهو مسافر بالفكر والعمل والاعتقاد)\n\n\n> إلى أين أو من أين أنت مسافر *** وذاك لعمر الله أمر ينافر\n\n\n> قضية معقول الدليل وشرعه *** فلا تك ممن للاله يسافر\n\n\n> ولا تخله من كل كون فإنه *** هو العين إلا أنه العبد حائر\n\n\n> ففيه فسافر لا إليه ولا تكن *** جهولا فكم عقل عليه يثابر\n\n\n### [أن المسافر في طريق الله رجلان‏]\n\n\nاعلم أيدك الله أن المسافر في طريق الله رجلان مسافر بفكره في المعقولات والاعتبارات ومسافر بالأعمال وهم أصحاب اليعملات فمن أسفر له طريقه عن شي‏ء فهو مسافر ويجب عليه قصر الصلاة على الله وهو مخير في الصوم ومن لم يسفر له طريقه عن شي‏ء فهو سالك متصرف في طرق مدينته وشوارعها غير مسافر فليصم وليتم صلاته فلنذكر حالة المسافر في الطريق والله المؤيد والموفق إن شاء الله المسافر من سافر بفكره في طلب الآيات والدلالات على وجود صانعه فلم يجد في سفره دليلا على ذلك سوى إمكانه ومعنى إمكانه هو أن ينسب إليه وإلى جميع العالم الوجود فيقبله أو العدم فيقبله فإذا تساوى في حقه الأمران لم تكن نسبة الوجود إليه من حيث ذاته بأولى من نسبة العدم فافتقر إلى وجود المرجح الذي رجح له أحد الوصفين على الآخر فلما وصل إلى هذا المنزل وقطع هذه المنهلة وأسفرت له عن وجود مرجحه أحدث سفرا آخر في علم ما ينبغي لهذا الصانع الذي أوجده فأسفر له الدليل على انفراده بصفات التنزيه تنزيه ما هو عليه هذا الممكن من الافتقار وأن هذا المرجح واجب الوجود لنفسه لا يجوز عليه ما جاز على هذا الممكن ثم انتقل مسافرا إلى منزلة أخرى فأسفر له عن أن هذا الواجب الوجود لنفسه يستحيل عليه العدم لثبوت قدمه وأنه من ثبت قدمه استحال عدمه لأنه لو كان عدمه لنفسه لما كان واجب الوجود لنفسه ولو انعدم ينعدم فلا بد أن يكون ذلك المعدم له وجودا أو عدما محال‏\nأن يكون عدما فبقي أن يكون وجودا وإذا كان وجودا فلا بد أن يكون المعدم شرطا أو ضدا وأن كل واحد من هذين إما أن يكون واجب الوجود أيضا لنفسه فمن المحال وجود هذا الذي دل الدليل على وجوب وجوده لنفسه ثم يساق الدليل على مساق الأدلة في المعقولات ثم يسافر في منزلة أخرى إلى أن ينفي عنه كل ما يدل على حدوثه فيحيل أن يكون هذا المرجح جوهرا متحيزا أو جسما أو عرضا أو في جهة ثم يسافر في علم توحيده بوجود العالم وبقائه وصلاحه إذ لو كان معه إله آخر لم يوجد العالم على تقدير الاتفاق والاختلاف كما يعطيه النظر ثم ينتقل مسافرا أيضا إلى منزلة تعطيه العلم بما يجب لهذا المرجح من العلم بما أوجده وخلقه والإرادة لذلك ونفوذها وعدم قصورها وعموم تعلق قدرته بإيجاد هذا الممكن وحياة هذا المرجح لأنها الشرط في ثبوت هذه النعوت له وإثبات صفات الكمال من الكلام والسمع والبصر بأنه لو لم يكن على ذلك لكان مئوفا لأن القابل لا حد الضدين إذا عرى عن أحدهما لم يعر عن الآخر فإذا عرف هذا سافر إلى منزلة أخرى يعلم منها وتسفر له عن إمكان بعثة الرسل ثم يسافر فيعلم أنه قد بعث رسلا وأقام لهم الدلالة على صدقهم فيما ادعوه من أنه بعثهم ولما تقرر هذا وكان هو ممن بعث إليه هذا الرسول فآمن به وصدقه واتبعه فيما رسم له حتى أحبه الله فكشف له عن قلبه وطالع عجائب الملكوت وانتقش في جوهر نفسه جميع ما في العالم وفر إلى الله مسافرا من كل ما يبعده منه ويحجبه عنه إلى أن رآه في كل شي‏ء فلما رآه في كل شي‏ء أراد أن يلقي عصا التسيار ويزيل عنه اسم المسافر فعرفه ربه أن الأمر لا نهاية له لا دنيا ولا آخرة وأنك لا تزال مسافرا كما أنت على ذلك لا يستقر بك قرار كما لم تزل تسافر من وجود إلى وجود في أطوار العالم إلى حضرة أَ لَسْتُ بِرَبِّكُمْ ثم لم تزل تنتقل من منزلة إلى منزلة إلى أن نزلت في هذا الجسم الغريب العنصري فسافرت به كل يوم وليلة تقطع منازل من عمرك إلى منزلة تسمى الموت ثم لا تزال مسافرا تقطع منازل البرازخ إلى أن تنتهي إلى منزلة تسمى البعث فتركب مركبا شريفا يحملك إلى دار سعادتك فلا تزال فيها تتردد مسافرا بينها وبين كثيب المسك الأبيض إلى ما لا نهاية له هذا سفرك بهيكلك وأما في المعارف فمثل ذلك وكذلك لا تزال مسافرا بالأعمال البدنية والأنفاس من عمل إلى عمل ما دام التكليف فإذا انتهت مدة التكليف فلا تزال مسافرا سفرا ذاتيا تعبده لذاته لا بأمره سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ لَيْلًا فسافر به من الْمَسْجِدِ الْحَرامِ إِلَى الْمَسْجِدِ الْأَقْصَى ليريه من آياته وقد ذكرنا هذا السفر في جزء لنا سميناه الأسفار عن نتائج الأسفار وقال تعالى في المسافرين أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ وقال أَ ولَمْ يَسِيرُوا في الْأَرْضِ فَيَنْظُرُوا ويَوْمَ يُرْجَعُونَ إِلَيْهِ فهذا معنى المسافر\n\n",
    "en": "Chapter One Hundred and Ninety: On the Knowledge of the Traveler (المسافر)\n\nHe is the one whose spiritual journey (سلوكه) has unveiled intended and unintended matters to him, and he is traveling by means of thought (الفكر), action (العمل), and belief (الاعتقاد).\n\n> To where, or from where, are you traveling?\n> By God, that is a contradictory matter.\n> It is a matter understood by reason and Divine Law;\n> So do not be among those who travel *to* the Deity.\n> And do not empty Him from every existent thing (كون), for He is the very Essence (العين),\n> Yet the servant remains bewildered.\n> So travel *in* Him, not *to* Him, and do not be ignorant,\n> For how many intellects strive upon this!\n\n### [That the Traveler on the Path of Allah is of Two Types]\n\nKnow, may Allah aid you, that the traveler on the path of Allah is of two types: a traveler by his thought (فكره) concerning intelligibles (المعقولات) and considerations (الاعتبارات), and a traveler by actions (الأعمال), who are the people of strenuous effort (أصحاب اليعملات).\n\nWhoever’s path unveils something to him is a traveler (مسافر), and he must shorten the prayer (قصر الصلاة) upon Allah, and he is given the choice regarding fasting (الصوم). But whoever’s path does not unveil anything to him is merely a wayfarer (سالك), moving about in the roads and streets of his city, not a traveler. So let him fast and complete his prayer.\n\nLet us now mention the state of the traveler on the path, and Allah is the Supporter and Granter of Success, if He wills.\n\nThe Traveler (المسافر) is he who travels by his thought in search of signs (الآيات) and proofs (الدلالات) for the existence of his Maker (صانعه), but finds no evidence in his journey for this except for the concept of his own possibility (إمكانه). The meaning of his possibility is that existence (الوجود) or non-existence (العدم) can equally be attributed to him and to the entire cosmos (العالم), and he accepts either. Since the two states are equal regarding him, the attribution of existence to him, based on his essence (ذاته), is no more appropriate than the attribution of non-existence. Thus, he is in need of the existence of the Preponderator (المرجح) who favors one of the two descriptions over the other.\n\nWhen he reaches this station (المنزل) and traverses this stage (المنهلة), and it is unveiled to him that his Preponderator exists, he initiates another journey into the knowledge of what is necessary for this Maker who brought him into existence. The proof unveils to him the Maker’s absolute transcendence (التنزيه) from the contingency (الافتقار) that characterizes this possible being. This Preponderator is the Necessary Existent by Himself (واجب الوجود لنفسه); what is permissible for the possible being is impossible for Him.\n\nThen he moves, traveling, to another station, which unveils to him that non-existence (العدم) is impossible for this Necessary Existent by Himself, due to the establishment of His eternity (قدمه). And whoever’s eternity is established, his non-existence is impossible. For if His non-existence were due to Himself, He would not be the Necessary Existent by Himself. If He were to cease to exist, He would require an annihilator (المعدم), which must be either existence or non-existence. It is impossible for it to be non-existence. It remains that it must be existence. If it is existence, then the annihilator must be either a condition or an opposite. And if each of these were also the Necessary Existent by Himself, then the existence of this Being, whose necessity of existence is proven by the evidence, would be impossible. The proof then proceeds along the lines of rational arguments.\n\nHe then travels to another station until he negates from Him everything that indicates His createdness (حدوثه), deeming it impossible for this Preponderator to be a localized substance (جوهر متحيز), a body (جسم), an accident (عرض), or in a direction (جهة).\n\nThen he travels in the knowledge of His Unity (توحيده) through the existence, subsistence, and order (صلاح) of the world. For if there were another deity with Him, the world would not exist, whether by agreement or disagreement, as rational consideration dictates.\n\nThen he moves, traveling again, to a station that grants him the knowledge of what is necessary for this Preponderator: Knowledge (العلم) of what He brought into existence and created, the Will (الإرادة) for that, the efficacy of that Will, its lack of deficiency, the comprehensive scope of His Power (القدرة) in bringing this possible being into existence, and the Life (الحياة) of this Preponderator, because Life is the condition for the establishment of these attributes for Him. He also establishes the attributes of perfection, such as Speech (الكلام), Hearing (السمع), and Sight (البصر), because if He were not characterized by these, He would be deficient, for the recipient of two opposites, if stripped of one, is not stripped of the other.\n\nWhen he knows this, he travels to another station from which he learns, and which unveils to him, the possibility of the sending of Messengers (بعثة الرسل). Then he travels and learns that He has indeed sent Messengers and established proofs for them regarding the truthfulness of their claim that He sent them.\n\nWhen this was established, and since he was one to whom this Messenger was sent, he believed in him, affirmed him, and followed what he prescribed, until Allah loved him. Allah then unveiled his heart, and he witnessed the wonders of the Kingdom (عجائب الملكوت), and everything in the world was inscribed upon the essence of his soul (جوهر نفسه).\n\nHe fled to Allah, traveling away from everything that distances him from Him and veils him from Him, until he saw Him in everything. When he saw Him in everything, he wished to cast down the staff of journeying (عصا التسيار) and remove the name of \"Traveler\" from himself.\n\nBut his Lord informed him that the matter has no end (لا نهاية له), neither in this world nor the Hereafter, and that you will not cease to be a traveler, just as you are, without settling down (لا يستقر بك قرار). You have never ceased traveling from existence to existence (من وجود إلى وجود) through the stages of the world, up to the Presence of <<أَلَسْتُ بِرَبِّكُمْ>> (Am I not your Lord?).\n\nThen you did not cease moving from station to station until you descended into this strange elemental body (الجسم الغريب العنصري). You travel with it every day and night, traversing the stations of your life until the station called Death (الموت). Then you do not cease traveling, traversing the stations of the Isthmus (البرازخ) until you reach the station called the Resurrection (البعث). Then you mount a noble vehicle that carries you to the Abode of your Felicity (دار سعادتك), and you will continuously move within it, traveling between it and the White Musk Dune (كثيب المسك الأبيض) endlessly.\n\nThis is your travel with your physical structure (هيكلك). As for the Gnosis (المعارف), it is the same. Likewise, you will not cease traveling through physical actions (الأعمال البدنية) and breaths (الأنفاس), moving from action to action, as long as religious obligation (التكليف) remains.\n\nWhen the period of obligation ends, you will not cease traveling a self-essential travel (سفرا ذاتيا), worshipping the Essence (الذات) for its own sake, not by His command.\n\n<<سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ لَيْلًا>> (Glory be to Him Who carried His servant by night). He traveled with him from <<الْمَسْجِدِ الْحَرامِ إِلَى الْمَسْجِدِ الْأَقْصَى>> (the Sacred Mosque to the Farthest Mosque) to show him some of His signs (آياته). We have mentioned this journey in a volume of ours which we named *The Journeys Concerning the Results of the Journeys* (الأسفار عن نتائج الأسفار).\n\nAnd Allah the Exalted said concerning the travelers: <<أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ>> (Have they not looked into the Kingdom of the heavens and the earth?) and He said: <<أَ ولَمْ يَسِيرُوا في الْأَرْضِ فَيَنْظُرُوا>> (Have they not traveled through the earth so they may observe?). And <<وَيَوْمَ يُرْجَعُونَ إِلَيْهِ>> (And the Day they are returned to Him). This is the meaning of the Traveler.",
    "ur": "باب ایک سو نوے مسافر کی معرفت میں\n\nوہ (مسافر) وہ ہے جس کے لیے اس کا سلوک (سلوک) مقصود اور غیر مقصود امور کو منکشف کر دے، اور وہ فکر (فکر)، عمل (عمل) اور اعتقاد (اعتقاد) کے ذریعے مسافر ہے۔\n\n> إلى أين أو من أين أنت مسافر *** وذاك لعمر الله أمر ينافر\n> تو کہاں جا رہا ہے یا کہاں سے مسافر ہے؟ *** خدا کی قسم، یہ ایک ایسا معاملہ ہے جو (ذات حق سے) دوری پیدا کرتا ہے۔\n\n> قضية معقول الدليل وشرعه *** فلا تك ممن للاله يسافر\n> یہ دلیل اور شریعت کا ایک معقول مسئلہ ہے *** پس تو ان میں سے نہ ہو جو اللہ کی طرف سفر کرتے ہیں۔\n\n> ولا تخله من كل كون فإنه *** هو العين إلا أنه العبد حائر\n> اور اسے ہر کائنات سے خالی نہ سمجھ، کیونکہ *** وہ (کائنات) عین ذات حق (الحق) ہے، مگر بندہ حیران ہے۔\n\n> ففيه فسافر لا إليه ولا تكن *** جهولا فكم عقل عليه يثابر\n> پس تو اس (کائنات) میں سفر کر، نہ کہ اس (ذات حق) کی طرف، اور جاہل نہ بن *** کیونکہ کتنی ہی عقلیں اس پر ثابت قدم رہتی ہیں۔\n\nاللہ کے راستے میں مسافر دو طرح کے لوگ ہیں۔\n\nجان لو، اللہ تمہاری تائید کرے، کہ اللہ کے راستے میں مسافر دو طرح کے ہیں: ایک وہ جو معقولات اور اعتبارات میں اپنی فکر (فکر) کے ذریعے مسافر ہے، اور دوسرے وہ جو اعمال کے ذریعے مسافر ہیں، اور یہ اصحابِ یعملات (تیز رفتار اونٹوں والے) ہیں۔ پس جس کے لیے اس کا راستہ کسی چیز کو منکشف کر دے، وہ مسافر ہے، اور اس پر اللہ کے لیے نماز قصر کرنا واجب ہے، اور وہ روزے میں بااختیار ہے۔ اور جس کے لیے اس کا راستہ کسی چیز کو منکشف نہ کرے، وہ سالک (سالک) ہے جو اپنے شہر کے راستوں اور گلیوں میں تصرف کر رہا ہے، وہ مسافر نہیں ہے۔ پس اسے روزہ رکھنا چاہیے اور اپنی نماز پوری پڑھنی چاہیے۔ پس ہم راستے میں مسافر کے حال کا ذکر کرتے ہیں، اور اللہ ہی مددگار اور توفیق دینے والا ہے، اگر وہ چاہے تو۔\n\nمسافر وہ ہے جس نے اپنے صانع کے وجود پر آیات اور دلائل کی تلاش میں اپنی فکر (فکر) کے ذریعے سفر کیا، لیکن اسے اپنے سفر میں اس پر امکان (امکان) کے سوا کوئی دلیل نہ ملی۔ اور اس کے امکان (امکان) کا مطلب یہ ہے کہ اس کی طرف اور تمام عالم کی طرف وجود (الوجود) کی نسبت کی جائے تو وہ اسے قبول کرے، یا عدم کی نسبت کی جائے تو وہ اسے قبول کرے۔ پس جب اس کے حق میں دونوں امر برابر ہو گئے تو اس کی ذات کے اعتبار سے وجود (الوجود) کی نسبت عدم کی نسبت سے زیادہ اولیٰ نہ ٹھہری۔ چنانچہ اسے مرجح (المرجح) کے وجود کی ضرورت پڑی جس نے اس کے لیے دونوں اوصاف میں سے ایک کو دوسرے پر ترجیح دی۔\n\nپس جب وہ اس منزل پر پہنچا اور اس پڑاؤ کو طے کیا اور اس کے لیے اس کے مرجح (المرجح) کا وجود منکشف ہو گیا، تو اس نے اس صانع کے لیے جو اس نے ایجاد کیا ہے، اس کے لیے جو کچھ ضروری ہے اس کے علم میں ایک اور سفر شروع کیا۔ پس دلیل نے اس کے لیے صفات تنزیہ (التنزيه) کے ساتھ اس کے انفراد کو منکشف کر دیا، یعنی اس ممکن (ممکن) کی محتاجی سے پاک ہونا جو اس پر ہے، اور یہ کہ یہ مرجح (المرجح) واجب الوجود (واجب الوجود) ہے اپنی ذات کے لیے، اور اس پر وہ چیزیں جائز نہیں جو اس ممکن پر جائز تھیں۔\n\nپھر وہ ایک اور منزل کی طرف مسافر بن کر منتقل ہوا، تو اس کے لیے یہ منکشف ہوا کہ اس واجب الوجود (واجب الوجود) لذاتہ پر عدم محال ہے کیونکہ اس کی قدامت ثابت ہے، اور جس کی قدامت ثابت ہو اس پر عدم محال ہے۔ کیونکہ اگر اس کا عدم اس کی ذات کے لیے ہوتا تو وہ واجب الوجود (واجب الوجود) لذاتہ نہ ہوتا، اور اگر وہ معدوم ہو جائے تو وہ معدوم ہو جائے گا۔ پس ضروری ہے کہ اسے معدوم کرنے والا وجود ہو یا عدم۔ محال ہے کہ وہ عدم ہو، پس باقی یہ رہا کہ وہ وجود ہے۔ اور جب وہ وجود ہے، تو ضروری ہے کہ معدوم کرنے والا یا تو شرط ہو یا ضد۔ اور ان دونوں میں سے ہر ایک یا تو خود بھی واجب الوجود (واجب الوجود) لذاتہ ہو گا، تو اس کا وجود محال ہے جس پر دلیل نے اس کے واجب الوجود لذاتہ ہونے پر دلالت کی ہے۔ پھر دلیل کو معقولات کے دلائل کے انداز پر چلایا جاتا ہے۔\n\nپھر وہ ایک اور منزل میں سفر کرتا ہے یہاں تک کہ وہ اس سے ہر اس چیز کی نفی کر دیتا ہے جو اس کے حادث ہونے پر دلالت کرتی ہے، پس وہ اس مرجح (المرجح) کے لیے جوہر متحیز، یا جسم، یا عرض، یا کسی جہت میں ہونا محال قرار دیتا ہے۔ پھر وہ عالم کے وجود، بقا اور صلاح کے ذریعے اپنے توحید کے علم میں سفر کرتا ہے، کیونکہ اگر اس کے ساتھ کوئی اور معبود ہوتا تو عالم موجود نہ ہوتا، خواہ اتفاق ہو یا اختلاف، جیسا کہ نظر (فکر) کا تقاضا ہے۔\n\nپھر وہ مسافر بن کر ایک اور منزل کی طرف منتقل ہوتا ہے جو اسے اس مرجح (المرجح) کے لیے واجب علم سے آگاہ کرتی ہے، اس علم سے جو اس نے ایجاد کیا اور خلق کیا، اور اس کے لیے ارادہ (ارادہ)، اور اس کا نفاذ اور اس کا عدمِ قصور، اور اس ممکن (ممکن) کو ایجاد کرنے میں اس کی قدرت کا عمومی تعلق، اور اس مرجح (المرجح) کی حیات، کیونکہ یہ صفات اس کے لیے ثابت ہونے کی شرط ہے۔ اور کلام، سمع اور بصر جیسی صفات کمال کا اثبات، کیونکہ اگر وہ اس طرح نہ ہوتا تو وہ عیب دار ہوتا، اس لیے کہ دو ضدوں میں سے ایک کو قبول کرنے والا جب ایک سے خالی ہوتا ہے تو دوسرے سے خالی نہیں ہوتا۔\n\nپس جب اس نے یہ جان لیا، تو وہ ایک اور منزل کی طرف سفر کرتا ہے جہاں سے وہ جانتا ہے اور اس کے لیے رسولوں کی بعثت کا امکان منکشف ہوتا ہے۔ پھر وہ سفر کرتا ہے اور جانتا ہے کہ اس نے رسولوں کو مبعوث کیا ہے اور ان کے دعوے میں ان کی سچائی پر دلیل قائم کی ہے کہ اس نے انہیں بھیجا ہے۔ اور جب یہ بات ثابت ہو گئی اور وہ ان لوگوں میں سے تھا جن کی طرف یہ رسول بھیجا گیا، تو اس نے اس پر ایمان لایا، اس کی تصدیق کی، اور اس کے بتائے ہوئے راستے پر چلا، یہاں تک کہ اللہ نے اسے اپنا محبوب بنا لیا۔ پس اللہ نے اس کے دل سے پردہ اٹھا دیا (الکشف)، اور اس نے ملکوت کے عجائبات کا مشاہدہ کیا (الشہود)، اور عالم کی ہر چیز اس کی ذات کے جوہر میں نقش ہو گئی۔ اور وہ ہر اس چیز سے بھاگ کر اللہ کی طرف مسافر ہوا جو اسے اس سے دور کرتی اور حجاب میں رکھتی تھی، یہاں تک کہ اس نے اسے ہر چیز میں دیکھ لیا۔\n\nپس جب اس نے اسے ہر چیز میں دیکھ لیا، تو اس نے چاہا کہ وہ سفر کی لاٹھی پھینک دے اور اپنے سے مسافر کا نام ہٹا دے۔ تو اس کے رب نے اسے بتایا کہ اس معاملے کی کوئی انتہا نہیں ہے، نہ دنیا میں اور نہ آخرت میں، اور تم اسی طرح ہمیشہ مسافر رہو گے، تمہارا کوئی ٹھکانہ نہیں ہو گا۔ جیسا کہ تم ہمیشہ عالم کے ادوار میں ایک وجود (الوجود) سے دوسرے وجود (الوجود) کی طرف سفر کرتے رہے ہو، یہاں تک کہ اس حضور میں پہنچے: أَ لَسْتُ بِرَبِّكُمْ (کیا میں تمہارا رب نہیں ہوں؟)\n\nپھر تم ہمیشہ ایک منزل سے دوسری منزل کی طرف منتقل ہوتے رہے، یہاں تک کہ تم اس عجیب عنصری جسم میں اترے، پس تم اس کے ساتھ ہر دن اور رات سفر کرتے ہو، اپنی عمر کی منزلیں طے کرتے ہوئے ایک منزل کی طرف جسے موت کہا جاتا ہے۔ پھر تم ہمیشہ مسافر رہو گے، برزخ کی منزلیں طے کرتے ہوئے، یہاں تک کہ تم ایک منزل پر پہنچو گے جسے بعث (دوبارہ اٹھایا جانا) کہا جاتا ہے۔ پس تم ایک شریف سواری پر سوار ہو گے جو تمہیں تمہاری سعادت کے گھر تک لے جائے گی، اور تم اس میں ہمیشہ مسافر بن کر اس کے اور سفید مشک کے ٹیلے کے درمیان لامتناہی طور پر چکر لگاتے رہو گے۔ یہ تمہارا اپنے جسم کے ساتھ سفر ہے۔ اور جہاں تک معارف (المعرفة) کا تعلق ہے، تو معاملہ اسی طرح ہے۔ اور اسی طرح تم ہمیشہ بدنی اعمال اور سانسوں کے ذریعے ایک عمل سے دوسرے عمل کی طرف مسافر رہو گے جب تک کہ تکلیف (شرعی ذمہ داری) باقی ہے۔ پس جب تکلیف کی مدت ختم ہو جائے گی، تو تم ہمیشہ ایک ذاتی سفر میں مسافر رہو گے، اس کی عبادت اس کی ذات کے لیے کرو گے نہ کہ اس کے حکم سے۔\n\nسُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ لَيْلًا (پاک ہے وہ ذات جو اپنے بندے کو رات کے وقت لے گئی)\n\nمِنَ الْمَسْجِدِ الْحَرامِ إِلَى الْمَسْجِدِ الْأَقْصَى ليريه من آياته (مسجد حرام سے مسجد اقصیٰ تک تاکہ اسے اپنی کچھ نشانیاں دکھائے)\n\nاور ہم نے اس سفر کا ذکر اپنی ایک کتاب میں کیا ہے جسے ہم نے \"الأسفار عن نتائج الأسفار\" (سفروں کے نتائج سے متعلق سفر) کا نام دیا ہے۔ اور اللہ تعالیٰ نے مسافروں کے بارے میں فرمایا:\n\nأَ وَلَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ (کیا انہوں نے آسمانوں اور زمین کے ملکوت (ملکوت) میں غور نہیں کیا؟)\n\nاور فرمایا:\n\nأَ وَلَمْ يَسِيرُوا في الْأَرْضِ فَيَنْظُرُوا (کیا انہوں نے زمین میں سفر نہیں کیا تاکہ وہ دیکھیں؟)\n\nاور:\n\nوَيَوْمَ يُرْجَعُونَ إِلَيْهِ (اور جس دن وہ اس کی طرف لوٹائے جائیں گے)\n\nپس یہ ہے مسافر کا معنی۔",
    "fa": "(باب صد و نودم در معرفت مسافر)\n\nمسافر کسی است که سلوک او اموری را که مقصود او بوده یا نبوده، برایش آشکار ساخته است؛ و او با فکر، عمل و اعتقاد در سفر است.\n\n> به کجا یا از کجا در سفری *** به جانم سوگند که این امری است ناهمگون (منافر)\n\n> این قضیه‌ای است که دلیل و شریعت آن را معقول می‌داند *** پس از کسانی مباش که به سوی خدا سفر می‌کنند\n\n> و او را از هر کونی خالی مپندار، زیرا *** او عین (حق) است، جز اینکه بنده سرگردان است\n\n> پس در او سفر کن، نه به سوی او، و نادان مباش *** که چه بسیار عقل‌ها بر این امر پافشاری می‌کنند.\n\n[مسافر در راه خدا دو دسته است]\n\nبدان، خداوند تو را تأیید کند، که مسافر در راه خدا دو دسته است: مسافری که با فکر خود در معقولات و اعتبارات سفر می‌کند، و مسافری که با اعمال سفر می‌کند و اینان اصحاب \"یعْمَلات\" (شتران تندرو) هستند. پس هر کس که راهش چیزی را برای او آشکار سازد، او مسافر است و بر او واجب است که نماز را برای خدا قصر کند و در روزه مختار است. و هر کس که راهش چیزی را برای او آشکار نسازد، او سالکی است که در راه‌ها و خیابان‌های شهر خود تصرف می‌کند و مسافر نیست؛ پس باید روزه بگیرد و نماز خود را کامل بخواند. حال مسافر در راه را ذکر می‌کنیم و خداوند یاور و موفق‌کننده است، ان‌شاءالله.\n\nمسافر کسی است که با فکر خود در طلب آیات و دلالت‌ها بر وجود صانع خود سفر کرده است، اما در سفرش دلیلی بر آن جز امکان (امکان وجودی) خود نیافته است. و معنای امکان او این است که اگر وجود به او و به تمام عالم نسبت داده شود، آن را می‌پذیرد، یا اگر عدم (نیستی) نسبت داده شود، آن را می‌پذیرد. پس هنگامی که دو امر (وجود و عدم) در حق او برابر شد، نسبت وجود به او از حیث ذاتش اولی‌تر از نسبت عدم نیست. پس نیازمند وجود مرجّحی شد که یکی از دو وصف را بر دیگری ترجیح دهد.\n\nهنگامی که به این منزل رسید و این مرحله را طی کرد و وجود مرجّحش برای او آشکار شد، سفر دیگری را در علم آنچه برای این صانعی که او را به وجود آورده، شایسته است، آغاز کرد. پس دلیل بر یگانگی او در صفات تنزیه (منزه بودن) برایش آشکار شد؛ تنزیه از آنچه این ممکن (مخلوق) از فقر و نیاز بر آن است. و اینکه این مرجّح، واجب الوجود لنفسه (واجب الوجود بالذات) است و آنچه بر این ممکن جایز است، بر او جایز نیست.\n\nسپس به منزل دیگری منتقل شد و سفر کرد، و برایش آشکار شد که محال است این واجب الوجود لنفسه، عدم بر او راه یابد، به دلیل ثبوت قدم (ازلی بودن) او. و کسی که قدمش ثابت شد، عدمش محال است؛ زیرا اگر عدمش برای خودش بود، واجب الوجود لنفسه نمی‌بود. و اگر معدوم شود، معدوم می‌شود. پس ناگزیر باید آن معدوم‌کننده او وجود باشد یا عدم؛ محال است که عدم باشد. پس باقی می‌ماند که وجود باشد. و اگر وجود باشد، ناگزیر باید آن معدوم‌کننده شرط یا ضد باشد. و هر یک از این دو یا باید واجب الوجود لنفسه باشند. پس وجود این (واجب الوجود) که دلیل بر وجوب وجودش لنفسه دلالت کرده، محال است. سپس دلیل بر مساق ادله در معقولات سوق داده می‌شود.\n\nسپس در منزل دیگری سفر می‌کند تا اینکه هر آنچه دلالت بر حدوث (نوپدید بودن) او دارد، از او نفی کند. پس محال می‌داند که این مرجّح جوهری متحیز (دارای مکان)، یا جسم، یا عرض، یا در جهتی باشد.\n\nسپس در علم توحید او سفر می‌کند، به واسطه وجود عالم، بقای آن و صلاح آن؛ زیرا اگر با او خدای دیگری بود، عالم بر فرض اتفاق و اختلاف، آن‌گونه که نظر (عقل) اقتضا می‌کند، به وجود نمی‌آمد.\n\nسپس دوباره به منزلی منتقل می‌شود و سفر می‌کند که علم به آنچه برای این مرجّح واجب است، به او می‌دهد؛ از جمله علم به آنچه به وجود آورده و خلق کرده، و اراده برای آن، و نفوذ آن و عدم قصور آن، و عموم تعلق قدرت او به ایجاد این ممکن، و حیات این مرجّح، زیرا حیات شرط ثبوت این صفات برای اوست. و اثبات صفات کمال از قبیل کلام، سمع و بصر؛ زیرا اگر بر این صفات نباشد، معیوب خواهد بود، چون پذیرنده یکی از دو ضد، اگر از یکی خالی باشد، از دیگری خالی نیست.\n\nهنگامی که این را شناخت، به منزل دیگری سفر می‌کند که از آن می‌آموزد و برایش آشکار می‌شود که بعثت رسولان ممکن است. سپس سفر می‌کند و می‌داند که او رسولانی را مبعوث کرده و برایشان دلالت‌هایی بر صدقشان در آنچه ادعا کرده‌اند که او آنان را فرستاده، اقامه کرده است.\n\nو چون این امر مقرر شد و او از کسانی بود که این رسول به سویش مبعوث شده بود، پس به او ایمان آورد و او را تصدیق کرد و در آنچه برایش ترسیم کرده بود، از او پیروی کرد تا اینکه خداوند او را دوست داشت. پس قلبش را برای او گشود و عجایب ملکوت را مشاهده کرد و تمام آنچه در عالم است، در جوهر نفس او نقش بست. و به سوی خدا فرار کرد، در حالی که از هر آنچه او را از خدا دور می‌کند و حجاب می‌شود، سفر می‌کرد، تا اینکه او را در هر چیزی دید.\n\nهنگامی که او را در هر چیزی دید، خواست که عصای سفر را بیندازد و نام مسافر را از خود دور کند. پس پروردگارش او را آگاه ساخت که این امر را پایانی نیست، نه در دنیا و نه در آخرت، و تو همچنان مسافر خواهی بود، همان‌گونه که هستی، و قرار و آرامشی نخواهی یافت، همان‌گونه که پیوسته از وجودی به وجود دیگر در اطوار عالم سفر می‌کردی تا به حضرت \"أَ لَسْتُ بِرَبِّكُمْ\" (آیا من پروردگار شما نیستم؟) رسیدی. سپس پیوسته از منزلی به منزل دیگر منتقل شدی تا اینکه در این جسم غریب عنصری فرود آمدی. پس هر شبانه‌روز با آن سفر می‌کنی و منازلی از عمرت را طی می‌کنی تا به منزلی به نام مرگ برسی. سپس پیوسته مسافر خواهی بود و منازل برزخ‌ها را طی می‌کنی تا به منزلی به نام بعث (رستاخیز) منتهی شوی. پس بر مرکبی شریف سوار می‌شوی که تو را به سرای سعادتت حمل می‌کند. پس پیوسته در آنجا متردد خواهی بود و بین آن و تپه مشک سفید (کثیب المسک الأبیض) تا بی‌نهایت سفر می‌کنی. این سفر تو با هیکلت است. و اما در معارف نیز چنین است. و همچنین پیوسته با اعمال بدنی و انفاس (نفس‌ها) از عملی به عمل دیگر سفر خواهی کرد، تا زمانی که تکلیف برقرار است.\n\nهنگامی که مدت تکلیف به پایان رسید، پیوسته سفری ذاتی خواهی داشت که او را برای ذاتش عبادت می‌کنی، نه به امر او. \"سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ لَيْلًا\" (پاک و منزه است آن کس که بنده‌اش را شبانه سیر داد) پس او را از \"الْمَسْجِدِ الْحَرامِ إِلَى الْمَسْجِدِ الْأَقْصَى\" (از مسجد الحرام به سوی مسجد الأقصی) سیر داد تا از آیات خود به او نشان دهد. ما این سفر را در جزوه‌ای از خود به نام \"الأسفار عن نتائج الأسفار\" (سفرها از نتایج سفرها) ذکر کرده‌ایم.\n\nو خداوند متعال درباره مسافران می‌فرماید: \"أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ\" (آیا در ملکوت آسمان‌ها و زمین نظر نکردند؟) و فرمود: \"أَ ولَمْ يَسِيرُوا في الْأَرْضِ فَيَنْظُرُوا\" (آیا در زمین سیر نکردند تا بنگرند؟) و \"يَوْمَ يُرْجَعُونَ إِلَيْهِ\" (و روزی که به سوی او بازگردانده می‌شوند). پس این معنای مسافر است."
  },
  "page_count": 2
}