{
  "id": 361,
  "title": {
    "ar": "الباب الأحد والستون وثلاثمائة في معرفة منزل الاشتراك مع الحق في التقدير وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Sixty-One: Concerning the knowledge of the station (منزل) of partnership (الاشتراك) with The Real (الحق) in Determination (التقدير), and it is from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو اکسٹھ: تقدیر میں ذات حق (الحق) کے ساتھ اشتراک کی منزل کی معرفت میں، اور یہ حضرت محمدیہ (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و شصت و یکم در معرفت منزل اشتراک با حق (الحق) در تقدیر، و آن از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الأحد والستون وثلاثمائة في معرفة منزل الاشتراك مع الحق في التقدير وهو من الحضرة المحمدية»\n\n\n> لو كان في الكون غير الله ما وجدوا *** ما كان من فاعل فيه ومنفعل‏\n\n\n> لكنه واحد في الكون منفرد *** بالاختراع وبالتبديل للدول‏\n\n\n> وليس يرجع تكوين إلى عدم *** ولا استقامته في العين عن ميل‏\n\n\n> فانظر إلى دول في طيها ملل *** وانظر إلى ملل تبين عن نحل‏\n\n\n> وأرقى بها فلكا من فوقه فلك *** من الهلال على قصد إلى زحل‏\n\n\n> أتى بها ملك من سدرة بلغت *** نهاية الأمر في ستر من الكلل‏\n\n\n> ولا تناد بما نادت به فرق *** يا مبدأ الأمر بل يا علة العلل‏\n\n\n> لأنه لقب أعطت معالمه *** فقرا يقوم به كسائر العلل‏\n\n\n### [الملائكة المهيمة في جلال الله‏]\n\n\nاعلم أيدك الله بروح منه أن الله عز وجل يقول لإبليس ما مَنَعَكَ أَنْ تَسْجُدَ لِما خَلَقْتُ بِيَدَيَّ على جهة التشريف والاختصاص لآدم عليه السلام أَسْتَكْبَرْتَ في نظرك وكذلك كان فإن الله أخبر عنه أنه استكبر وقال لنا عز وجل في كتابه العزيز إن إبليس قال أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ وخَلَقْتَهُ من طِينٍ وقال لما قيل له اسجد أَ أَسْجُدُ لِمَنْ خَلَقْتَ طِيناً فهذا معنى قولنا في نظرك أَمْ كُنْتَ من الْعالِينَ في نفس الأمر أي إنك في نفس الأمر خير منه فهنا ظهر جهل إبليس وقد يريد بالعالين الملائكة المهيمة في جلال الله الذين لم يدخلوا تحت الأمر بالسجود وهم أرواح ما هم ملائكة فإن الملائكة هي الرسل من هذه الأرواح كجبريل عليه السلام وأمثاله فإن الألوكة هي الرسالة في لسان العرب فالملائكة هم الرسل من هذه الأرواح خاصة فما بقي ملك إلا سجد لأنهم الذين قال الله لهم اسْجُدُوا لِآدَمَ ولم تدخل الأرواح المهيمة فيمن خوطب بالسجود فإن الله ما ذكر أنه خاطب إلا الملائكة ولهذا قال فَسَجَدَ الْمَلائِكَةُ كُلُّهُمْ أَجْمَعُونَ ونصب إبليس على الاستثناء المنقطع لا المتصل وهذه الأرواح المهيمة في جلال الله لا تعلم أن الله خلق آدم ولا شيئا لشغلهم بالله يقول الله لإبليس أَمْ كُنْتَ من الْعالِينَ أي من هؤلاء الذين ذكرناهم فلم تؤمر بالسجود والسجود التطأطؤ في اللسان لأن آدم خلق من تراب وهو أسفل الأركان لا أسفل منه ومن هنا يعرف شرف نقطة الدائرة على محيطها فإن النقطة أصل وجود المحيط فالعالون ما أمروا بالسجود لأنهم ما جرى لهم ذكر في تعريف الله إيانا ولو لا ما ذكر الله إبليس بالإباءة ما عرفنا أنه أمر بالسجود فما أضاف آدم إلى يديه إلا على جهة التشريف على غيره والتنويه لتعلم منزلته عند الله ثم زاد في تشريفه بخلقه باليدين قوله معرفا الأناسي الحيوانيين بكمال الأناسي المكملين أو لم يروا الضمير في يروا يعود على الأناسي الحيوانيين أنا خلقنا لهم أي من أجلهم فالضمير في لهم يعود على الناس الكمل المقصودين من العالم بالخطاب الإلهي مما عملت أيدينا فأضاف عمل الخلق إلى الأيدي الإلهية وعم الأسماء الإلهية بالنون من أيدينا وذلك لتمام التشريف الذي شرف به آدم عليه السلام في إضافة خلقه إلى يديه أنعاما وهي من إنعامه عليهم‏\nفهم لهم ما لكون فملكوها بتمليك الله بخلاف الإنسان الحيواني فإنه يملكها عند نفسه بنفسه غافلا عن إنعام الله عليه بذلك فيتصرف في المخلوقات الإنسان الحيوان بحكم التبعية ويتصرف الإنسان الكامل فيها بحكم التمليك الإلهي فتصرفه فيها بيد الله وبمال الله الذي آتاه كما قال تعالى آمرا في حق المماليك وآتُوهُمْ من مالِ الله الَّذِي آتاكُمْ فكل مخلوق في العالم فمضاف خلقه إلى يد إلهية لأنه قال مِمَّا عَمِلَتْ أَيْدِينا فجمع فكل يد خالقة في العالم فهي يده يد ملك وتصريف فالخلق كله لله أَلا لَهُ الْخَلْقُ والْأَمْرُ وقد ورد أن شجرة طوبى غرسها الله بيده وخلق جنة عدن بيده فوحد اليد وثناها وجمعها وما ثناها إلا في خلق آدم عليه السلام وهو الإنسان الكامل ولا شك أن التثنية برزخ بين الجمع والإفراد بل هي أول الجمع والتثنية تقابل الطرفين بذاتها فلها درجة الكمال لأن المفرد لا يصل إلى الجمع إلا بها والجمع لا ينظر إلى المفرد إلا بها فبالإنسان الكامل ظهر كمال الصورة فهو قلب لجسم العالم الذي هو عبارة عن كل ما سوى الله وهو البيت المعمور بالحق لما وسعه‏\n\n\nيقول تعالى في الحديث المروي ما وسعني أرض ولا سمائي ووسعني قلب عبدي المؤمن‏\n\n\nفكانت مرتبة الإنسان الكامل من حيث هو قلب بين الله والعالم وسماه بالقلب لتقليبه في كل صورة كُلَّ يَوْمٍ هُوَ في شَأْنٍ وتصريفه واتساعه في التقليب والتصريف ولذلك كانت له هذه السعة الإلهية لأنه وصف نفسه تعالى بأنه كل يوم في شأن واليوم هنا الزمن الفرد في كل شي‏ء فهو في شئون وليست التصريفات والتقليبات كلها في العالم سوى هذه الشئون التي الحق فيها ولم يرد نص عن الله ولا عن رسوله في مخلوق أنه أعطى كن سوى الإنسان خاصة\n\n\nفظهر ذلك في وقت في النبي صَلَّى اللهُ عَليهِ وسَلَّم في غزوة تبوك فقال كن أبا ذر فكان أبا ذر\n\n\nوورد الخبر في أهل الجنة أن الملك يأتي إليهم فيقول لهم بعد أن يستأذن في الدخول عليهم فإذا دخل ناولهم كتابا من عند الله بعد أن يسلم عليهم من الله فإذا في الكتاب لكل إنسان يخاطب به من الحي القيوم الذي لا يموت إلى الحي القيوم الذي لا يموت أما بعد فإني أقول للشي‏ء كُنْ فَيَكُونُ وقد جعلتك تقول للشي‏ء كن فيكون فقال صَلَّى اللهُ عَليهِ وسَلَّم فلا يقول أحد من أهل الجنة للشي‏ء كن إلا ويكون‏\n\n\nفجاء بشي‏ء وهو من أنكر النكرات فعم وغاية الطبيعة تكوين الأجسام وما تحمله مما لا تخلو عنه وتطلبه بالطبع ولا شك أن الأجسام بعض العالم فليس لها العموم وغاية النفس تكوين الأرواح الجزئية في النشآت الطبيعية والأرواح جزء من العالم فلم يعم فما أعطى العموم إلا الإنسان الكامل حامل السر الإلهي فكل ما سوى الله جزء من كل الإنسان فاعقل إن كنت تعقل وانظر في كل ما سوى الله وما وصفه الحق به وهو قوله وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ووصف الكل بالسجود وما جعل لواحد منهم أمرا في العالم ولا نهيا ولا خلافة ولا تكوينا عاما وجعل ذلك للإنسان الكامل فمن أراد أن يعرف كماله فلينظر في نفسه في أمره ونهيه وتكوينه بلا واسطة لسان ولا جارحة ولا مخلوق غيره فإن صح له المعنى في ذلك فهو عَلى‏ بَيِّنَةٍ من رَبِّهِ في كماله فإنه عنده شاهد منه أي من نفسه وهو ما ذكرناه فإن أمر أو نهى أو شرع في التكوين بوساطة جارحة من جوارحه فلم يقع شي‏ء من ذلك أو وقع في شي‏ء دون شي‏ء ولم يعم مع عموم ذلك بترك الواسطة فقد كمل ولا يقدح في كماله ما لم يقع في الوجود عن أمره بالواسطة فإن الصورة الإلهية بهذا ظهرت في الوجود فإنه أمر تعالى عباده على السنة رسله عليه السلام وفي كتبه فمنهم من أطاع ومنهم من عصى وبارتفاع الوسائط لا سبيل إلا الطاعة خاصة لا يصح ولا تمكن إباية\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم يد الله مع الجماعة\n\n\nوقدرته نافذة ولهذا إذا اجتمع الإنسان في نفسه حتى صار شيئا واحدا نفذت همته فيما يريد وهذا ذوق أجمع عليه أهل الله قاطبة فإن يد الله مع الجماعة فإنه بالمجموع ظهر العالم والأعيان ليست إلا هو أنظر في قوله تعالى ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ثم قال ولا أَدْنى‏ من ذلِكَ وهو ما دون الثلاثة ولا أَكْثَرَ وهو ما فوق الثلاثة إلى ما لا يتناهى من العدد إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا وجودا أو عدما حيثما فرضوا فهو سبحانه ثان للواحد فإن المعية لا تصح للواحد من نفسه لأنها تقتضي الصحبة وأقلها اثنان وهو ثالث للاثنين ورابع للثلاثة وخامس للأربعة بالغا ما بلغ وإذا أضيفت المعية للخلق دون الحق فمعية الثاني ثاني اثنين ومعية الثالث للاثنين ثالث ثلاثة ومعية الرابع للثلاثة رابع أربعة بالغا ما بلغ لأنه عين ما هو معه في المخلوقية فهو من جنسه والحق ليس كذلك ف لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فليس بثالث ثلاثة ولا خامس خمسة فافهم‏\nفقد تبين الحق من الخلق من وجه وقد ظهر بصورته أيضا من وجه‏\n\n\n### [أن الطبيعة ظل النفس الكلية المعبر عنها باللوح المحفوظ]\n\n\nواعلم أن الطبيعة ظل النفس الكلية الموصوفة بالقوتين المعبر عنها بلسان الشرع باللوح المحفوظ فما لم يمتد من ظل النفس وبقي فيها فهو الذي نزلت به عن العقل في درجة النورية والإضاءة وما امتد من ظل النفس سمي طبيعة وكان امتداد هذا الظل على ذات الهيولى الكل فظهر من جوهر الهيولى والطبيعة الجسم الكل مظلما ولهذا شبهوه بالسبجة السوداء لهذه الظلمة الطبيعية وسموا النفس الزمردة الخضراء لما نزلت به عن العقل في النور وفي الجسم الكل ظهرت صور عالم الأجسام وأشكاله فكان ذلك للجسم الكل كالأعضاء فلما استعد الجسم بما استعد به توجهت عليه النفس وأنارته فانتشرت الحياة في جميع أعضائه كلها فتلك أرواح عالم الأجسام العلوي والسفلي من فلك وعنصر ثم استحال بعضه إلى بعضه لتأثير حكم الحركة الزمانية التي عينها الاسم الدهر في الأفلاك فظهرت للعين صور المولدات الفلكية كالكواكب والجنات ومرتبتها وما فيها والعنصرية من معدن ونبات وحيوان وصور غريبة وأشكال عجيبة في عين وجودية فما خرج شي‏ء من العدم إلا الصور والأعراض من تركيب وتحليل والجوهر ثابت العين قابل لهذه الصور كلها دنيا وآخرة وإذا علمت هذا وتقرر فاعلم إن قوله تعالى يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ أن المعنى المراد من ذلك التقدير والإيجاد فالتدبير للتقدير والتفصيل للإيجاد من فصلت الشي‏ء عن الشي‏ء إذا قطعته منه وفصلت بينه وبينه حتى تميز فإن كان الفصل عن تقدير فهو على صورته وشكله وإن كان عن غير تقدير فقد لا يكون على صورته وإن أشبهه في أمر ما فإنه يفارقه في أمر آخر كالبياض والسواد يشتركان في اللونية وإن كانا ضدين وكاللون والحركة يشتركان في العرضية وإن كانا مختلفين قال الشاعر\n\n\n> ولأنت تفري ما خلقت و*** بعض الناس يخلق ثم لا يفري‏\n\n\nوكالإسكاف وأمثاله من صائغ وخياط وحداد وأمثال ذلك يريد أن يقطع من جلد نعلا فيأخذ نعلا فيقدره على الجلد فإذا أخذ قدرة من الجلد قطع من الجلد ذلك المقدار وفصله منه والظلالات أوجدها الله على مثال الأشخاص ولما أراد فصلها مدها فظهرت أعيانها على صورة من هي ظله حذوك النعل بالنعل فلما خلق الله العالم دون الإنسان أي دون مجموعه حذا صورته على صورة العالم كله فما في العالم جزء إلا وهو على صورة الإنسان وأريد بالعالم كل ما سوى الله ففصله عن العالم بعد ما دبره وهو عين الأمر المدبر ثم إنه تعالى حذاه حذوا معنويا على حضرة الأسماء الإلهية فظهرت فيه ظهور الصور في المرآة للرائي ثم فصله عن حضرة الأسماء الإلهية بعد ما حصلت فيه قواها فظهر بها في روحه وباطنه فظاهر الإنسان خلق وباطنه حق وهذا هو الإنسان الكامل المطلوب وما عدا هذا فهو الإنسان الحيواني ورتبة الإنسان الحيواني من الإنسان الكامل رتبة خلق النسناس من الإنسان الحيواني هذا جملة الأمر في خلق الإنسان الكامل من غير تفصيل وأما تفصيل خلقه فاعلم إن الله لما خلق الأركان الأربعة دون الفلك وأدارها على شكل الفلك والكل أشكال في الجسم الكل فأول حركة فلكية ظهر أثرها فيما يليها من الأركان وهو النار فأثر فيه اشتعالا بما في الهواء من الرطوبة فكان ذلك الاشتعال واللهب من النار والهواء وهو المارج أي المختلط ومنه سمي المرج مرجا لأنه يحوي على أخلاط من الأزهار والنبات ومنه وقع الناس في هرج أي قتل ومرج أي اختلاط ففتح الله في تلك الشعلة الجان ثم أفاضت الكواكب النيرة بأمر الله وإذنه فإنه أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها فطرحت شعاعها على الأركان والأركان مطارح الشعاعات فظهرت الأركان بالأنوار وأشرقت وأضاءت فأثرت وولدت فيها المعدن والنبات والحيوان وهي على الحقيقة التي أثرت في نفسها لأن الأفلاك أعني السموات إنما أوجدها الله عن الأركان ثم أثرت في الأركان بحركاتها وطرح شعاعات كواكبها ليتولد ما تولد فيها من المولدات فبضاعتها ردت إليها فما أثر فيها سواها وجعل ذلك من أشراط الساعة فإنه من أشراطها أن تلد المرأة بعلها فولدت الأركان الفلك ثم نكحها الفلك فولد فيها ما ولد فهو ابنها زوجها ولم يظهر في الأركان صورة للإنسان الذي هو المطلوب من وجود العالم فأخذ التراب اللزج وخلطه بالماء فصيره طينا بيديه تعالى كما يليق بجلاله إذ ليس‏\n\n\nكمثله شي‏ء وتركه مدة يختمر بما يمر عليه من الهواء الحار الذي يتخلل أجزاء طينته فتخمر وتغيرت رائحته فكان حمأ مسنونا متغير الريح ومن أراد أن يرى صدق ذلك إن كان في إيمانه‏\nخلل فليحك ذراعه بذراعه حكا قويا حتى يجد الحرارة من جلد ذراعه ثم يستنشقه فيجد فيه رائحة الحماة وهي أصله التي خلق الجسم منها قال الله تعالى خَلَقَ الْإِنْسانَ من صَلْصالٍ ومن حَمَإٍ مَسْنُونٍ فلما طهرت فخارة الإنسان بطبخ ركن النار إياها والتأمت أجزاؤه وقويت وصلبت قصرها بالماء الذي هو عنصر الحياة فأعطاها الماء من رطوبته وألان بذلك من صلابة الفخار ما ألان فسرت فيه الحياة وأمده الركن الهوائي بما فيه من الرطوبة والحرارة ليقابل بحرارته برد الماء فامتنعا فتوفرت الرطوبة عليه فأحال جوهرة طينته إلى لحم ودم وعضلات وعروق وأعصاب وعظام وهذه كلها أمزجة مختلفة لاختلاف آثار طبيعة العناصر واستعدادات أجزاء هذه النشأة فلذلك اختلفت أعيان هذه النشأة الحيوانية فاختلفت أسماؤها لتتميز كل عين من غيرها وجعل غذاء هذه النشأة مما خلقت منه والغذاء سبب في وجود النبات وبه ينمو فعبر عن نموه وظهور الزيادة فيه بقوله والله أَنْبَتَكُمْ من الْأَرْضِ نَباتاً ومعناه فنبتم نباتا فإن مصدر أنبت إنما هو إنبات فأضاف النبات إلى الشي‏ء الذي ينمو يقول جعل غذاءكم منها أي مما تنبته فتنبتون به أي تنمي أجسامكم وتزيد فلما أكمل النشأة الجسمية النباتية الحيوانية وظهر فيها جميع قوى الحيوان أعطاه الفكر من قوة النفس العملية وأعطاه ذلك من قوة النفس العلمية من الاسم الإلهي المدبر فإن الحيوان جميع ما يعمله من الصنائع وما يعلمه ليس عن تدبير ولا روية بل هو مفطور على العلم بما يصدر عنه لا يعرف من أين حصل له ذلك الإتقان والإحكام كالعناكب والنحل والزنابير بخلاف الإنسان فإنه يعلم أنه ما استنبط أمرا من الأمور إلا عن فكر وروية وتدبير فيعرف من أين صدر هذا الأمر وسائر الحيوان يعلم الأمر ولا يعلم من أين صدر وبهذا القدر سمي إنسانا لا غير وهي حالة يشترك فيها جميع الناس إلا الإنسان الكامل فإنه زاد على الإنسان الحيواني في الدنيا بتصريفه الأسماء الإلهية التي أخذ قواها لما حذاه الحق عليها حين حذاه على العالم فجعل الإنسان الكامل خليفة عن الإنسان الكل الكبير الذي هو ظل الله في خلقه من خلقه فعن ذلك هو خليفة ولذلك هم‏\n\n\nخلفاء عن مستخلف واحد فهم ظلاله للأنوار الإلهية التي تقابل الإنسان الأصلي وتلك أنوار التجلي تختلف عليه من كل جانب فيظهر له ظلالات متعددة على قدر أعداد التجلي فلكل تجل فيه نور يعطي ظلا من صورة الإنسان في الوجود العنصري فيكون ذلك الظل خليفة فيوجد عنه الخلفاء خاصة وأما الإنسان الحيواني فليس ذلك أصله جملة واحدة وإنما حكمه حكم سائر الحيواني إلا أنه يتميز عن غيره من الحيوان بالفصل المقوم له كما يتميز الحيواني بعضه عن بعض بالفصول المقومة لكل واحد من الحيوان فإن الفرس ما هو الحمار من حيث فصله المقوم له ولا البغل ولا الطائر ولا السبع ولا الدودة فالإنسان الحيواني من جملة الحشرات فإذا كمل فهو الخليفة فاجتمعنا لمعان وافترقا لمعان‏\n\n\n### [إن الله أعطاه حكم الخلافة واسم الخليفة]\n\n\nثم إن الله أعطاه حكم الخلافة واسم الخليفة وهما لفظان مؤنثان لظهور التكوين عنهما فإن الأنثى محل التكوين فهو في الاسم تنبيه ولم يقل فيه نائب وإن كان المعنى عينه ولكن قال إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً وما قال إنسانا ولا داعيا وإنما ذكره وسماه بما أوجده له وإنما فرقنا بين الإنسان الحيواني والإنسان الكامل الخليفة لقوله تعالى يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ فهذا كمال النشأة الإنسانية العنصرية الطبيعية ثم قال له بعد ذلك في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ إن شاء في صورة الكمال فيجعلك خليفة عنه في العالم أو في صورة الحيوان فتكون من جملة الحيوان بفصلك المقوم لذاتك الذي لا يكون إلا لمن ينطلق عليه اسم الإنسان ولم يذكر في غير نشأة الإنسان قط تسوية ولا تعديلا وإن كان قد جاء الَّذِي خَلَقَ فَسَوَّى فقد يعني به خلق الإنسان لأن التسوية والتعديل لا يكونان معا إلا للإنسان لأنه سواه على صورة العالم وعدله عليه ولم يكن ذلك لغيره من المخلوقين من العناصر ثم قال له بعد التسوية والتعديل كن وهو نفس إلهي فظهر الإنسان الكامل عن التسوية والتعديل ونفخ الروح وقول كن وهو قوله إِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ خَلَقَهُ من تُرابٍ ثُمَّ قالَ لَهُ كُنْ فشبه الكامل وهو عيسى عليه السلام بالكامل وهو آدم عليه السلام خليفة بخليفة وغير الخلفاء إنما سَوَّاهُ ونَفَخَ فِيهِ من رُوحِهِ وما قال فيه إنه قال له كن إلا في الآية الجامعة في قوله إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فاجعل بالك لما نبهتك عليه فنقص عن مرتبة الكمال التي أعطاها\nالله للخلفاء من الناس ولما قسم الله الفلك الأطلس الذي هو فلك البروج وهو قوله والسَّماءِ ذاتِ الْبُرُوجِ على اثني عشر قسما وأوحى الله تعالى في سماء البروج أمرها فلكل برج فيها أمر يتميز به عن غيره من البروج وجعل الله لهذه البروج أثرا من أمر الله الموحى به فيها فيما دون هذه السماء من عالم التركيب والإنسان من حيث جسمه وطبيعته من عالم التركيب وهو زبدة مخض الطبيعة التي ظهرت بتحريك الأفلاك فهو المخضة التي ليس في اللبن ألطف منها بل هي روح اللبن إذا خرج منه بقي العالم مثل النخالة فهو فيه لا فيه فإنه متميز عنه بالقوة وهو منه فإن الإنسان ما خرج من العالم وإن كان زبد مخضة العالم إذ لو انفصل عنه ما بقي العالم يساوي شيئا مثل اللبن إذا خرج عنه الزبد استحال وقل ثمنه وزال خيره الذي كان المطلوب منه ومن أجل تلك الزبدة كان يستعمل اللبن ويعظم قدره فلما قضى الله أن يكون لهذه البروج أثر في العالم الذي تحت حيطة سماء هذه البروج جعل الله في نشأة هذا الإنسان اثني عشر قابلا يقبل بها هذه الآثار فيظهر الإنسان الكامل بها وليس ذلك للإنسان الحيوان وإن كان أتم في قبول هذه الآثار من سائر الحيوان ولكنه ناقص بالنظر إلى قبول الإنسان الكامل فمن الاثني عشر لصوقها بالعالم حين حذيت عليه ولصوقها بحضرة الأسماء الإلهية وبه صح الكمال لهذه النفس وهذه المجاورة على ثلاث مراتب منها مرتبة الاختصاص وهي في الإنسان الحيوان بما هو محصل لحقائق العالم وهي في الكامل كذلك وبما اختص به من الأسماء الإلهية حين انطلقت عليه بحكم المطابقة للحذو الإلهي الاعتنائي ولكونه ظلا ولا شي‏ء ألصق من الظل بمن هو عنه والمرتبة الثانية من المجاورة مرتبة الشيئية الرابطة بين الأمرين وهي الأدوات التي بها يظهر عن الإنسان ما يتكون عنه فيشترك الإنسان الحيوان مع الكامل في الأدوات الصناعية التي بها يتوصل إلى مصنوع ما مما يفعل بالأيدي ويزيد الكامل عليه بالفعل بالهمة فادواته همته وهي له بمنزلة الإرادة الإلهية إذا توجهت على إيجاد شي‏ء فمن المحال أن لا يكون ذلك الشي‏ء المراد والمرتبة الثالثة الاتصال بالحق فيفني عن نفسه بهذا الاتصال فيظهر الحق حتى يكون سمعه وبصره وهذا المسمى علم الذوق فإنه لا يكون الحق شيئا من هذه الأدوات حتى تحترق بوجوده فيكون هو لا هي وقد ذقنا ذلك ووجدت الحرق حسا في ذكري لله بالله فكان هو ولم أكن أنا فأحسست بالحرق في لساني وتألمت لذلك الحرق تألما حسيا حيوانيا لحرق حسي قام بالعضو فكنت ذاكرا الله بالله في تلك الحالة ست ساعات أو نحوها ثم أنبت الله لي لساني فذكرته بالحضور معه لا به وهكذا جميع القوي لا يكون الحق شيئا منها حتى يحرق تلك القوة وجوده فيكون هو أي قوة كانت وهوقوله كنت سمعه وبصره ولسانه ويده‏\n\n\nومن لم يشاهد الحرق في قواه ويحسه وإلا فلا ذوق له وإنما ذلك توهم منه وهذا معنى قوله في الحجب الإلهية لو كشفها لأحرقت سبحات وجهه فأي قوة أراد الحق إحراقها من عبده حتى يحصل له العلم بالأمر من طريق الذوق برفع الحجاب الذي بين الإنسان من حيث تلك القوة وبين الحق فتحترق بنور الوجه فيسد بنفسه خلل تلك القوة فإن كان سمعه كان الحق سمعه في هذه الحالة وإن كان بصره فكذلك وإن كان لسانه فكذلك ولنا في هذا المعنى‏\n\n\n> ألا إن ذكر الله بالله يحرق *** وحكمي بهذا فيه حكم محقق‏\n\n\n> فإني ورب الواردات طعمته *** فحكمي عليه أنه الحق يصدق‏\n\n\nقال الحق في الحديث الصحيح كنت سمعه وبصره‏\n\n\nفجعل كينونته سمع عبد منعوت بوصف خاص وهذا أعظم اتصال يكون من الله بالعبد حيث يزيل قوة من قواه ويقوم بكينونته في العبد مقام ما أزال على ما يليق بجلاله من غير تشبيه ولا تكييف ولا حصر ولا إحاطة ولا حلول ولا بدلية والأمر على ما قلناه وما شَهِدْنا إِلَّا بِما عَلِمْنا وما كُنَّا لِلْغَيْبِ حافِظِينَ وسْئَلِ الْقَرْيَةَ يعني الجماعة الَّتِي كُنَّا فِيها يعني أهل الله المنعوتين بهذه الطريقة من عباد الله الذين قاموا بنوافل الخيرات وداوموا عليها وأقبلوا إلى الله بها والله يؤيدنا بالعصمة في الاعتقاد والقول والعمل إنه ولي الرحمة الأثر الثاني من الاثني عشر إن المثلين اللغويين لا يلزم من وصف كل واحد منهما بالمثلية لصاحبه المماثل له الاشتراك في صفات النفس لأن المثلية لغوية وعقلية فالعقلية هي التي يشترك بها في صفات النفس واللغوية بأدنى شبه بأمر ما يكون مثلا له في ذلك الأمر فيكون للمثل حكم مثله من حيث ما هو مثله فيه وقابل له وما ثم بين العبد الإنساني‏\nالكامل والحق في ليس كمثله شي‏ء إلا قبوله لجميع الأسماء الإلهية التي بأيدينا وبها صحت خلافته وفضل على الملائكة فالخليفة إن لم يظهر فيمن هو خليفة عليه بأحكام من استخلفه وصورته في التصرف فيه وإلا فما هو خليفة له كما أن الخليفة قد استخلف من استخلفه في ماله وجميع أحواله لما اتخذه وكيلا فهو فيما استخلفه الحق فيه من التصرف في المستخلف عليه لا يتصرف إلا بنظر وكيله فهو المستخلف بالمستخلف فاستخلاف العبد ربه لما اتخذه وكيلا خلافة مطلقة ووكالة مفوضة دورية واستخلاف الرب عبده خلافة مقيدة بحسب ما تعطيه ذاته ونشأته‏\n\n\nيقول النبي صَلَّى اللهُ عَليهِ وسَلَّم لربه عز وجل لما سافر أنت الصاحب في السفر والخليفة في الأهل‏\n\n\nفسماه خليفة والله تعالى قد أقسم بكل معلوم من موجود ومعدوم فقال فَلا أُقْسِمُ بِما تُبْصِرُونَ وما لا تُبْصِرُونَ فأقسم بنفسه وبجميع المعلومات فهل لنا أن نقسم بما أقسم الله تعالى به أو محجور علينا ذلك فلا نكون إذا خلفاء فيما هو محجور علينا والمقسم به قد يقسم بالأمر مضافا أو مفردا فالمفرد والله لأفعلن كذا والمضاف مثل قول عائشة رضي الله عنها في قسمها ورب محمد فدخل المضاف في المضاف إليه في الذكر بالقسم فعلى هذا الحد يقسم الإنسان الكامل يكل معلوم سواء ذكر الاسم أو لم يذكره وهو بعض تأويلات وجوه قسم الله بالأشياء في مثل قوله تعالى والشَّمْسِ والضُّحى‏ واللَّيْلِ والتِّينِ يريد ورب الشمس ورب الضحى ورب التين فما أقسم إلا بنفسه فلا قسم إلا بالله وما عدا ذلك من الأقسام فهو ساقط ما ينعقد به يمين في المقسوم عليه ولهذا قال تعالى لا يُؤاخِذُكُمُ الله بِاللَّغْوِ في أَيْمانِكُمْ واللغو الساقط فمعناه لا يؤاخذكم الله بالإيمان التي أسقط الكفارة فيها إذا حنثتم ولكِنْ يُؤاخِذُكُمْ بِما عَقَّدْتُمُ الْأَيْمانَ فلما سقط العقد بالقلب عند اليمين سقطت الكفارة إذا وقع الحنث ولا خلاف بين العلماء أن الكفارة في الايمان المذكورة في القرآن أنها في اليمين بالله لا بغيره وجاء بالإيمان معرفة بالإضافة والألف واللام وقد صح عن النبي صَلَّى اللهُ عَليهِ وسَلَّم النهي عن اليمين بغير الله‏\n\n\nفالخليفة ينبغي له أن يكون مع إرادة من استخلفه فيما استخلفه فيه فإن الله يقول والله غالِبٌ عَلى‏ أَمْرِهِ والصورة قد تكون في اللسان الأمر والشأن‏\n\n\nفقوله إن الله خلق آدم على صورته‏\n\n\nأي على أمره وشأنه فالله غالب على أمره أي على من أظهره بصورته أي بأمره فإن له حكم العزل فيه مع بقاء نشأته فيدلك ذلك على أنه ما أراد بالصورة النشأة وإنما أراد الأمر والحكم فالعالم لا يعدل عن سنن العلم ومراد الله في الأشياء وهذا الأمر وحده على الاختصاص من آثار الجوزاء خاصة وهي برج هوائي فطابق الأمر\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم إن الرب كان في عماء\n\n\nبالمد والهمزة وهو السحاب الرقيق ما فوقه هواء وما تحته هواء فنفى عن هذا العماء إحاطة الهواء به وما تعرض لنفي الهواء فالأمر لله فليست نسبة العماء إليه بأولى من نسبة الهواء فنفى الإحاطة الهوائية بهذا العماء لا بد فيه من نفي المجموع لا الجميع وقد بينا في‏\n\n\nالنفس الرحماني حديث العماء والجوزاء بين الماء والتراب لأنها بين الثور والسرطان كآدم بين الماء والطين ولهذا كان حكم الهواء أعم من سائر الأركان لأنه يتخلل كل شي‏ء وله في كل شي‏ء سلطان فيزلزل الأرض ويموج الماء ويجريه ويوقد النار وبه حياة كل نفس متنفس وله الإنتاج في الأشجار وهو الرياح اللواقح فهذا الأثر الثاني من الأقسام الاثني عشر وأما الأثر الثالث وهو ما يظهر في العالم مما يمكن أن يستغني عنه وإنما ظهر مع الاستغناء عنه لتظهر مرتبة قوة الاثنين لئلا يقال ما في الوجود إلا الله مع ظهور الممكنات والمخلوقين فيعلم فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ مع وجود العالمين والاستغناء عنه معقول فجاء في العالم هذا الأمر الذي يمكن أن يستغني عنه مع وجوده لبيان غنى الحق عن العالم فما جعله الله في العالم عبثا فأعطى وجوده مع الاستغناء عنه هذا العلم وهو علم نافع وله نظم خاص يشبه نظم ما لا يستغني عنه مثل وجود الولد عن النكاح وهو مستغني عنه دليلنا نكاح أهل الجنة في الجنة ونكاح العقيم وأما الأثر الرابع‏\n\n\nفكقوله صَلَّى اللهُ عَليهِ وسَلَّم لا تقوم الساعة وعلى وجه الأرض من يقول الله الله‏\n\n\nفأتى به مرتين ولم يكتف بواحدة وأثبت بذلك أنه ذكر على الانفراد ولم ينعته بشي‏ء وسكن الهاء من الاسم وهو تفسير لقوله تعالى اذْكُرُوا الله ذِكْراً كَثِيراً وهو تكرار هذا الاسم وقوله ولَذِكْرُ الله أَكْبَرُ ولم يذكر إلا الاسم الله خاصة وهو مأمور من الله أن يبين للناس ما نُزِّلَ إِلَيْهِمْ فلو لا إن قول الإنسان الله الله له حفظ العالم الذي يكون فيه هذا الذكر لم‏\nيقرن بزواله زوال الكون الذي زال منه وهو الدنيا وهذا الاسم كان ذكرنا وذكر شيخنا الذي دخلنا عليه وما في فوائد الأذكار أعظم من فائدته فلما قال الحق ولَذِكْرُ الله أَكْبَرُ ولم يذكر صورة ذكر آخر مع كثرة الأذكار بالأسماء الإلهية فاتخذه أهل الله ذكرا وحده فانتج لهم في قلوبهم أمرا عظيما لم ينتجه غيره من الأذكار فإن بعض العلماء بالرسوم لم ير هذا الذكر لارتفاع الفائدة عنده فيه إذ كل مبتدأ لا بد له من خبر فيقال له لا يلزم ذلك في اللفظ بل لا بد له من فائدة وقد ظهرت في الذاكر به حين ذكره بهذه الكلمة خاصة فنتج له في باطنه من نور الكشف ما لا ينتجه غيره بل له خبر ظاهر لا في اللفظ كإضافة إلى تنزيه أو ثناء بفعل ومعلوم أنه إذا ذكر أمر ما ثم ذكر أمر ما وكرر على طريق التأكيد له أنه يعطي من الفائدة ما لا يعطيه من ليس له هذا الحكم ولا قصد به فهو أسرع وأنجح في طلب الأمور فلا عبث في العالم جملة واحدة وأما الأثر الخامس وهو يشبه الرابع كما أشبه قسم الحمل من البروج قسم الأسد والقوس وغيره وإن كان هذا ما هو عين هذا وينفرد كل واحد منهما بأمر لا يكون لغيره من مماثلة مع كونه على مثله فلهذا وقع الشبه في الآثار كما وقع في الأصل وهو كل ما وقع في العالم ويعطي معنى صحيحا غير ظهوره ولو سقط من العالم لم يختل ذلك الأمر الذي أعطى فيه هذا المعنى ولكنه لا بد أن ينقص عن الأمر الذي يعطيه وجوده وهذه تسمى عوارض الأعطيات التي لا يخل سقوطها وعدم وقوعها بحقيقة ما عدمت منه وإن كان لها معنى كوجود لذة الجماع من غير جماع فحصلت الفائدة التي كان لها الجماع ولكن لحصولها بالجماع معنى لا يحصل إلا بالجماع لأن المقصود بالنكاح الالتذاذ ووجود اللذة وقد وجدت فما أخل سقوط الجماع باللذة ولهذا زوجنا الله بالحور العين وأما الأثر السادس فهو ما يتعلق بصاحب الهمة إذا أراد أن يتكون عنه ما لا يقع بالعادة إلا بآلة فيفعله بهمته لا بآلة وفي وقت بآلة فإن الله قادر أن يكون آدم ابتداء من غير تخمير ولا توجه يدين ولا تسوية ولا تعديل لنفخ روح بل يَقُولُ لَهُ كُنْ فَيَكُونُ ومع هذا فخمر طينته بيديه وسواه وعدله ثم نفخ فيه الروح وعلمه الأسماء وأوجد الأشياء على ترتيب كما أنه لو شاء جعلنا نكتفي بالعلم به عن أسمائه ولكن تسمى بكذا في كل لسان وضعه في العالم فيسمى بالله في العرب وبخداي في الفرس وبواق في الحبش وفي كل لسان له أسماء مع العلم بوجوده وأظهر فائدة ذلك مع الاستغناء عما ظهر والاكتفاء ومن هذا الباب ما يظهر عنا من الأفعال مع أنه يجوز أن يفعلها الله لا بأيدينا ولكن ما وصل إلى هذا الفعل في الشاهد إلا بأيدينا فأراد تحريك الجسم من مكان إلى مكان فجعل فينا إرادة طلب الانتقال فقمنا بحركة اختيارية نعقلها من نفوسنا وانتقلنا والانتقال خلق الله بالأصل ولكنه وجد عن إرادة حادثة اختيارية بخلاف حركة المرتعش فإنها اضطرارية فالإنسان المختار مجبور في اختياره عند السليم العقل ثم ما من حقيقة لا يظهر حكمها إلا بالمحل فلا تظهر إلا بالمحل فيفرق بين ما يجوز وبين ما لا يجوز فالتحرك محال وجوده إلا في متحرك ومن هذا الباب نزوله تعالى إلى السماء الدنيا في الثلث الباقي من الليل مع كونه معنا أينما كنا فهذا حكم نزول قد ظهر بفعل ما يمكن حصول ذلك المراد من غير هذا النزول لكن إذا أضفته إلى قوله تعالى فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ كان نزولا ولا بد عن مرتبة الغني لأنه لا يقبل هذا النزول إلا لنسبة إلهية تقتضيها ذاته فلم تكن إلا بنزول فافهم فإن الإضافات لها من الحكم الذاتي ما ليس لغير المضاف والحقائق لا تتبدل والشأن إنما هو ظهور حكم في محكوم فهو من وجه تطلبه ذاته ومن وجه لا تطلبه ذاته تعالى كالخالق يطلب الخلق والعالم يطلب المعلوم وأما الأثر السابع فوجود الظرفية في الكون هل هي أصل في الكون ثم حملناها على الحق حملا شرعيا أو هي في الحق بحسب ما يليق بجلاله وظهرت في العالم بالفعل‏\n\n\nكقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للسوداء أين الله فأشارت إلى السماء وكانت خرساء\n\n\nقال تعالى والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ وبنية فعيل ترد بمعنى الفاعل وبمعنى المفعول كقتيل وجريح فعليم بمعنى عالم وبمعنى معلوم وكلا الوجهين سائغ في هذه الآية إذا كانت الباء من قوله بكل بمعنى الفاء فهو في كل شي‏ء معلوم وبِكُلِّ شَيْ‏ءٍ مُحِيطٌ أي له في كل شي‏ء إحاطة بما هو ذلك المعلوم عليه وليس ذلك إلا لله أو لمن أعلمه الله وأما الأثر الثامن فقوله تعالى فَسْئَلْ به خَبِيراً أي إذا أردت أن تسأل عن حقيقة أمر فاسأل عنه من له فيه ذوق ومن لا ذوق له في الأشياء فلا تسأله فإنه لا يخبرك إلا باسم ما سألت عنه لا بحقيقته فلا يسأل العبد عن الله‏\nفإنه لا ذوق له في الألوهة ولا خبرة له بها فما عنده منها إلا الأسماء خاصة فاسأل الله عن الله واسئل العبد عن العبودة فنسبة العبودة للعبد نسبة الألوهة لله فإخبار الحق عن العبودة اخبارا له وإخبار العبد عن الألوهة إخبار عبد ولذلك‏\n\n\nورد من عرف نفسه عرف ربه‏\n\n\nفيعرف نفسه معرفة ذوق فلا يجد في نفسه للالوهة مدخلا فيعلم بالضرورة أن الله لو أشبهه أو كان مثلا له لعرفه في نفسه وعلم بافتقاره أن ثم من يفتقر إليه ولا يمكن أن يشبهه فعرف ربه أنه ليس مثله وإن كان الله قد أقامه خليفة وأوجده على الصورة فيخاف ويرجى ويطاع ويعصى فقد بينا معنى ذلك في هذه الآثار من هذا الباب وأما الأثر التاسع وهو قوله في خلق السموات والأرض إنه ما خلقهما إلا بالحق أي ما خلقهما إلا له تعالى جده وتبارك اسمه لأنه قال وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ فما خلق العالم إلا له تعالى ولذلك قال فيمن علم أنه جعل في نشأته عزة وهما الجن والإنس وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ أي ليتذللوا إلي لما ظهر فيهما من العزة ودعوى الألوهة والإعجاب بنفوسهم فمن لطف الله بهم أن ينبههم على ما أراد بهم في خلقه إياهم فمن تنبه كان من الكثير الذي يسجد لله ومن لم يتنبه كان من الكثير الذي حق عليه العذاب وأما قوله في هذه الآية وما خَلَقْتُ الْجِنَّ والْإِنْسَ قد يريد به الإنسان وحده من حيث ما له ظاهر وباطن فمن حيث ما له ظاهر هو أنس من آنست الشي‏ء إذا أبصرته قال تعالى في حق موسى إخبارا عنه إِنِّي آنَسْتُ ناراً أي أبصرت والجن باطن الإنسان فإنه مستور عنه فكأنه قال وما خلقت ما ظهر من الإنسان وما بطن إلا ليعبدون ظاهرا وباطنا فإن المنافق يعبده ظاهرا لا باطنا والمؤمن يعبده ظاهرا وباطنا والكافر المعطل لا يعبده لا في الظاهر ولا في الباطن وبعض العصاة يعبده باطنا لا ظاهرا وما ثم قسم خامس وما أخرجنا الجن الذين خلقهم الله من نار من هذه الآية وجعلناها في الإنسان وحده من جهة ما ظهر منه وما استتر إلا لقول الله لما ذكر السجود أنه ذكر جميع من يسجد له ممن في السموات ومن في الأرض وقال في الناس وكَثِيرٌ من النَّاسِ فما عمهم ودخل الشياطين في قوله من في الْأَرْضِ وذلك أن الشيطان وهو البعيد من الرحمة يقول للإنسان إذا أمره بالكفر فكفر إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ فأبان الله لنا عن معرفة الشيطان بربه وخوفه منه فلذلك كان صرف الجن في هذه الآية إلى ما استتر من الإنسان أولى من إطلاقه على الجان والله أعلم وأما الأثر العاشر فهو ما ظهر في العالم من إبانة الرسل المترجمين عن الله ما أنزل الله على عباده مع إنزال كتبه فما اكتفى بنزول الكتب الإلهية حتى جعل الرسل تبين ما فيها لما في العبارة من الإجمال وما تطلبه من التفصيل ولا تفصل العبارة إلا بالعبارة فنابت الرسل مناب الحق في التفصيل فيما لم يفصله وأجمله وهو قوله تعالى لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ بعد تبليغه ما أنزل إلينا وهذه حقيقة سارية في العالم ولولاها ما شرحت الكتب ولا ترجمت من لسان إلى لسان ولا من حال إلى حال قال تعالى فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله وهو ما أنزله خاصة وأما ما فصله الرسول وأبان عنه فهو تفصيل ما نزل لا عين ما نزل ويقع البيان بعبارة خاصة ويعقل بأي شي‏ء كان وأما الأثر الحادي عشر والثاني عشر فهما المرتبتان من المراتب الثلاثة التي ذكرناها في أول هذه لآثار وهما مرتبة الاتصال بالحق ومرتبة السبب الرابط بين الأمرين وقد تقدم فلنذكر ما في هذا المنزل من العلوم إن شاء الله فمن ذلك علم السبب الموجب لبقاء المؤمن في النعيم في دار النعيم وفيه علم أسباب الفوز والنجاة من الجهل الذي هو شر الشرور وفيه علم ما يستحقه الموطن من الأمور التي تكون بها السعادة للإنسان وقد تظهر في موطن آخر ولا تعطي سعادة وفيه علم كل ما ثبت عينه هل يسقط حكمه أو لا يسقط إلا حكم بعض ما ثبت عينه أو لا يسقط له حكم على الإطلاق بل يسقط عنه حكم خاص لا كل حكم فهل يشتغل بما سقط حكمه أو لا يشتغل به كلغو اليمين فإن الكفارة سقطت عنه في الحنث وفيه علم ما يظهر من الزيادة إذا أضيف الفعل إلى المخلوق بوجه شرعي يوجب ذلك أو كرم‏\n\n\nخلق عقلي وفيه علم الملإ والخلأ وفيه علم فعل ما ينبغي وترك ما لا ينبغي وفيه علم التعدي في حدود الأشياء وهل الحد داخل في المحدود فلا يكون تعديا وإذا دخل كيف صورة دخوله والفرق بين قوله وأَيْدِيَكُمْ إِلَى الْمَرافِقِ وقوله أَتِمُّوا الصِّيامَ إِلَى اللَّيْل‏\n\n\nوهذا حد بكلمة معينة تقتضي في الواحد خروج الحد من المحدود وفي الآخر دخول الحد في المحدود وينبغي هذا على معرفة الحد في نفسه ما هو فإن للحد حدا ولا يتسلسل وفيه علم العهود والأمانات وما هي الأمانات‏\nوما هي العهود والعقود التي أمرنا بها والعهد الإلهي هل له حكم عهد المخلوق أم لا وفيه علم الفضل بين المال الموروث والمكتسب وبأي المالين تقع اللذة أكثر لصاحبه وهو علم ذوق ويختلف باختلاف المزاج فإنه ثم من جبل على الكسل فمال الميراث عنده ألذ لأنه لا تعمل له فيه ومنهم أهل الفتوح ومن الناس من هو مجبول في نفسه على الرئاسة فيلتذ بالمال المكتسب ما لا يلتذ بالمال الموروث لما فيه من التعمل لإظهار قدرته فيه بجهة كسبه وفيه علم توقف المسببات على أسبابها هل هو توقف ذاتي أم اختياري من الله وفيه علم الاستحالات من حال إلى حال فهل تتبع الأعيان تلك الأحوال فتستحيل من عين إلى عين أم العين واحدة والاستحالات تقع في الأحوال والمذاهب في ذلك مختلفة فأين الحق منها وفيه علم حفظ الصانع لصنعته هل حفظه لصنعته أو لعين المصنوع فإن الصنعة للصانع قد تكون مستفادة له كصنعة الخياطة وغير ذلك مما لا يحصل إلا بالتعلم وقد تكون الصنعة بالفطرة لا بالتفكر كصنعة الحيوانات كالنحل والعناكب وكلها بالجعل وقد تكون ذاتية كإضافة الصنعة إلى الله وما معنى قوله مع هذا يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ فنسب التدبير إليه وفيه علم حكمة ما يثبت من الأمور في الكون وما لا يثبت وضرب مثل النبي صَلَّى اللهُ عَليهِ وسَلَّم بذلك فيما جاء به بالمطر والبقاع فيمن نفعه الله بما جاء به ومن لم ينفعه وفيه علم وجود الأعلى من الأدنى فأما في المعاني كوجود علمنا بالله عن وجود علمنا بأنفسنا وفيه علم ما للنيابة في الأمر من الحكم للنائب وفيه علم معرفة الشي‏ء بما يكون منه لا به وفي هذا الباب تسمية الشي‏ء باسم الشي‏ء إذا كان مجاورا له أو كان منه بسبب أو يتضمنه وفيه علم التوحيد المطلوب من العالم ما هو وفيه علم الفضائل حتى يقع الحسد فيها هل هي فضائل لأنفسها أو هي بحكم العرف والوضع وفيه علم ما يبقى به كل شي‏ء على التفصيل والاختلاف فما كل واق من شي‏ء يكون واقيا من شي‏ء آخر وما الأمر الجامع لكل وقاية وفيه علم فائدة وجود الأمثال مع الاكتفاء بالأول من الأمثال وفيه علم الحجب الحائلة بين الناس وبين العلم بالأشياء وفيه علم من اتخذ الجهل علما هل يجد في نفسه القطع به أو تكون نفسه تزلزله في ذلك حتى إذا حقق النظر في نفسه وجد الفرق بين ما يوافق العلم من ذلك وبين ما لا يوافقه وليس ذلك إلا في الجهل خاصة وأما في الظن والشك فليس حكمهما هذا الحكم فإن الظان يعلم بظنه والشاك يعلم بشكه وقد لا يعلم الجاهل بجهله فإنه من علم بجهله فله علم يمكن أن يوصف به وفيه علم حكمة التأييد هل هو عناية أو إقامة حجة أو في موضع عناية وفي موضع إقامة حجة بالنظر إلى حال شخصين وفيه علم ما ينسب إلى العالم بالشي‏ء مما لا يستحقه علمه به ومع ذلك ينسبه إلى نفسه كالترجي من العالم بوقوع ما يترجاه أو عدم وقوعه فما يتعلق الرجاء مع العلم وفيه علم حكمة من يأتي الأحسن وهو لا يقطع بثمرته هل ذلك راجع إلى علمه بجهل من أحسن إليه بمرتبة الإحسان أو راجع إلى نفسه لكونه لا يعلم أنه وفى حق الإحسان فيه وفيه علم حكمة استمرار العذاب والضر على المضرورين من أصحاب الآلام هل ذلك على جهة الرحمة بهم أم لا وفيه علم من استعمل الأمر في غير ما وضع له أو لم يستعمله إلا فيما وضع له إذا كان له وجوه كثيرة متضادة فما خرج عن حكم ما هو له كالمرض له وجه إلى الصبر وله وجه إلى الضجر وفيه علم تذكر الناسي هل ينفعه تذكره أم لا وفيه علم الصادق يسمى كاذبا وفيه علم الاستعاذة وما يستعاذ به ومنه وأين يحمد وفي أي موضع يذم وفيه علم ما ينفع من الاعتراف مما لا ينفع فإن للمواطن حكما في الاعتراف وللأحوال فيه حكما أيضا فإن من الناس من يعترف بالخطإ مع بقائه عليه ومن الناس من يزول عنه وفيه علم شرف الخطاب ووجود الالتذاذ به وفيه علم حكمة وجود الشك في العالم وفيه علم نجاة المجتهد أخطأ أم أصاب مع توفيته‏\n\n\nما آتاه الله من ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 361: On the Knowledge of the Station of Partnership with The Real (al-Haqq) in Determination (al-Taqdir), which belongs to the Muhammadan Presence (al-Hadra al-Muhammadiyya).\n\nIf there were in the Cosmos (al-Kawn) anything other than Allah, they would not have found\nAny agent (fa'il) or patient (munfa'il) within it.\n\nBut He is One in the Cosmos, singular\nIn creation ex nihilo (al-Ikhtira') and in the changing of epochs (al-Duwal).\n\nNor does creation (takwin) revert to non-existence,\nNor is its uprightness in the essence (al-'Ayn) due to inclination.\n\nLook then at epochs (duwal) within which are religions (milal),\nAnd look at religions that reveal sects (nihal).\n\nAnd ascend with them, sphere above sphere,\nFrom the crescent moon (al-Hilal) up to Saturn (Zuhal).\n\nAn angel (malak) brought them from the Lote-Tree (Sidra) that reached\nThe end of the matter, veiled from all weariness (al-Kalal).\n\nDo not call out with what the sects call out:\n\"O Originator of the Command!\" but rather, \"O Cause of Causes ('Illat al-'Ilal)!\"\n\nFor that title (Originator) gives its characteristics\nA need (faqr) that sustains it, like all other causes ('ilal).\n\n### The Spirits Lost in the Majesty of Allah (al-Malā'ika al-Muhayyima fī Jalāl Allāh)\n\nKnow—may Allah support you with a Spirit from Him—that Allah, the Mighty and Majestic, says to Iblis: <<مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ>> (What prevented you from prostrating to that which I created with My two Hands?) This was an expression of honor (tashrīf) and specialization for Adam, peace be upon him. <<أَسْتَكْبَرْتَ>> (Did you become arrogant?) in your own view? And so it was, for Allah informed us that Iblis became arrogant and said to us, the Mighty and Majestic, in His Glorious Book, that Iblis said: <<أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ وَخَلَقْتَهُ مِنْ طِينٍ>> (I am better than him. You created me from fire and created him from clay). And when he was told to prostrate, he said: <<أَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا>> (Shall I prostrate to one You created from clay?). This is the meaning of our statement: \"in your own view.\" <<أَمْ كُنْتَ مِنَ الْعَالِينَ>> (Or were you of the exalted ones?) in the reality of the matter, meaning that you are, in the reality of the matter, better than him. Here, the ignorance of Iblis became apparent.\n\nIt is possible that by \"the exalted ones\" (al-'Ālīn), He meant the Spirits lost in the Majesty of Allah (al-Arwāḥ al-Muhayyima fī Jalāl Allāh), who were not included in the command to prostrate. They are Spirits (arwāḥ), not Angels (malā'ika). For the Angels are the messengers (rusul) from these Spirits, such as Gabriel (Jibrīl), peace be upon him, and his like. Since *al-alūka* in the Arabic language means \"the message\" (al-risāla), the Angels are specifically the messengers from these Spirits. Thus, every Angel prostrated, because they were the ones to whom Allah said: <<اسْجُدُوا لِآدَمَ>> (Prostrate to Adam). The Spirits lost in Awe were not included among those addressed with the command to prostrate, for Allah only mentioned addressing the Angels. This is why He said: <<فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ>> (So the Angels prostrated, all of them together), and Iblis was placed in the category of the discontinuous exception (al-Istithnā' al-Munqaṭi'), not the continuous one.\n\nThese Spirits lost in the Majesty of Allah do not know that Allah created Adam or anything else, due to their preoccupation with Allah. Allah says to Iblis: <<أَمْ كُنْتَ مِنَ الْعَالِينَ>> (Or were you of the exalted ones?), meaning, of those whom We mentioned, so you were not commanded to prostrate. Prostration (al-Sujūd) means lowering oneself, because Adam was created from dust (turāb), which is the lowest of the elements (al-Arkān); there is nothing lower than it. From this, one understands the nobility of the point of the circle over its circumference, for the point is the origin of the circumference's existence. The exalted ones were not commanded to prostrate because they were not mentioned in Allah's definition of us. If Allah had not mentioned Iblis's refusal, we would not have known that he was commanded to prostrate.\n\nAllah attributed Adam to His two Hands only for the purpose of honoring him above others and exalting his status, so that his rank with Allah might be known. Then, He increased his honor, beyond creating him with the two Hands, by saying, when defining the animalistic humans (al-Anāsī al-Ḥayawāniyyīn) by the perfection of the perfected humans (al-Anāsī al-Mukammalīn): <<أَوَلَمْ يَرَوْا>> (Do they not see?)—the pronoun in *yaraw* refers to the animalistic humans—<<أَنَّا خَلَقْنَا لَهُمْ>> (that We created for them)—the pronoun *lahum* refers to the perfected humans, who are the intended recipients of the Divine address in the Cosmos (al-'Ālam)—<<مِمَّا عَمِلَتْ أَيْدِينَا>> (from what Our Hands have wrought). Thus, He attributed the act of creation (al-Khalq) to the Divine Hands (al-Aydī al-Ilāhiyya) and generalized the Divine Names by using the plural *nūn* in *aydīnā* (Our Hands). This was for the sake of the complete honor bestowed upon Adam, peace be upon him, by attributing his creation to His two Hands, as a form of grace (an'ām) which is part of His bestowal upon them.\n\nThus, the creatures (al-An'ām) belong to the perfected humans, and they own them through Allah's granting of ownership (tamlīk Allāh). This is unlike the animalistic human, who claims ownership for himself, oblivious to Allah's grace upon him in granting it. The animalistic human acts in the created world by way of dependency (al-taba'iyya), while the Perfect Human (al-Insān al-Kāmil) acts in it by way of Divine ownership (al-Tamlīk al-Ilāhī). His action in it is by the Hand of Allah and by the wealth of Allah that He gave him, as the Exalted said, commanding concerning slaves: <<وَآتُوهُمْ مِنْ مَالِ اللَّهِ الَّذِي آتَاكُمْ>> (And give them from the wealth of Allah which He has given you).\n\nThe creation of every creature in the Cosmos is attributed to a Divine Hand, because He said: <<مِمَّا عَمِلَتْ أَيْدِينَا>> (from what Our Hands have wrought), using the plural. Thus, every creating hand in the Cosmos is His Hand—a Hand of dominion and disposal. All creation belongs to Allah: <<أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ>> (Unquestionably, to Him belongs the creation and the command).\n\nIt is reported that the Tūbā Tree was planted by Allah with His Hand, and the Garden of Eden was created by His Hand. He used the singular Hand, the dual Hands, and the plural Hands. He only used the dual Hands (Yadayya) in the creation of Adam, peace be upon him, who is the Perfect Human. There is no doubt that duality (al-Tathniya) is an Isthmus (Barzakh) between plurality (al-Jam') and singularity (al-Ifrād); rather, it is the beginning of plurality. Duality confronts the two extremes with its very essence, so it possesses the degree of perfection, because the singular cannot reach the plural except through it, and the plural cannot look upon the singular except through it. Through the Perfect Human, the perfection of the Form (al-Ṣūra) became manifest. He is the Heart (Qalb) of the body of the Cosmos, which is everything other than Allah, and He is the House that is filled with The Real (al-Ḥaqq) because it contained Him.\n\nThe Exalted says in the reported Hadith: \"Neither My earth nor My heaven contained Me, but the heart of My believing servant contained Me.\"\n\nThus, the station (martaba) of the Perfect Human, insofar as he is the Heart, is between Allah and the Cosmos. He is called the Heart (al-Qalb) because of his constant turning (taqlīb) in every form: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is engaged in some affair), and because of his disposal (taṣrīf) and his vastness in turning and disposal. For this reason, he possesses this Divine vastness, because the Exalted described Himself as being engaged in an affair every day, and the \"day\" here is the singular time (al-Zaman al-Fard) in everything.\n\nThese disposals and turnings in the Cosmos are nothing but these affairs (shu'ūn) in which The Real is present. No text has been transmitted from Allah or His Messenger concerning any creature other than the human specifically that he was given the command *Kun* (Be!).\n\nThis manifested at one time in the Prophet, peace and blessings be upon him, during the Battle of Tabūk, when he said: \"Be Abū Dharr,\" and he was Abū Dharr.\n\nIt is also reported concerning the people of Paradise that an Angel comes to them, and after asking permission to enter upon them, he enters and hands them a book from Allah, after greeting them from Allah. In the book, it is written for every person addressed: \"From the Living, the Self-Subsisting (al-Ḥayy al-Qayyūm) Who does not die, to the Living, the Self-Subsisting Who does not die. To proceed: I say to a thing, 'Be!' and it is. I have made you say to a thing, 'Be!' and it is.\" The Prophet, peace and blessings be upon him, said: \"No one among the people of Paradise says to a thing, 'Be!' except that it is.\"\n\nThis came with universality ('umūm), which is the most absolute of universalities. The limit of Nature (al-Ṭabī'a) is the formation of bodies and what they bear, which they cannot be without and which they seek by nature. Bodies are undoubtedly a part of the Cosmos, so they do not possess universality. The limit of the Soul (al-Nafs) is the formation of partial spirits (al-Arwāḥ al-Juz'iyya) in the natural formations (al-Nash'āt al-Ṭabī'iyya), and spirits are a part of the Cosmos, so they do not possess universality. Thus, universality was granted only to the Perfect Human (al-Insān al-Kāmil), the bearer of the Divine Secret (al-Sirr al-Ilāhī). Everything other than Allah is a part of the totality of the human. Understand this if you are capable of understanding.\n\nLook at everything other than Allah and what The Real described it with, which is His saying: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is nothing except that it glorifies Him with praise). He described the totality with prostration, but He did not grant any of them command (amr), prohibition (nahy), vicegerency (khilāfa), or universal creation (takwīn 'āmm) in the Cosmos. He granted all of that to the Perfect Human.\n\nWhoever wishes to know his perfection should look into himself, into his command, his prohibition, and his creation without the mediation of a tongue, a limb, or any creature other than himself. If this meaning is confirmed for him, then he is <<عَلَى بَيِّنَةٍ مِنْ رَبِّهِ>> (upon clear evidence from his Lord) regarding his perfection, for he has a witness from Him—that is, from himself—which is what we have mentioned. If he commands, prohibits, or initiates creation through the mediation of one of his limbs, and nothing of that occurs, or it occurs in some things but not others, and it does not possess universality, then by abandoning mediation, he has become perfected. The fact that something does not come into existence through his command via mediation does not detract from his perfection, for the Divine Form (al-Ṣūra al-Ilāhiyya) appeared in existence in this manner. For the Exalted commanded His servants through the tongues of His Messengers, peace be upon them, and in His Books, and some obeyed while others disobeyed. But with the removal of intermediaries, there is no path except for pure obedience; refusal is neither valid nor possible.\n\nThe Prophet, peace and blessings be upon him, said: \"Allah's Hand is with the community (al-Jamā'a).\"\n\nHis power is effective. Therefore, when the human gathers himself (ijtama'a fī nafsihi) until he becomes one thing, his spiritual aspiration (himma) is effective in what he desires. This is a direct experience (dhawq) upon which all the People of Allah (Ahl Allāh) unanimously agree. Since Allah's Hand is with the community, the Cosmos appeared through the totality (al-Majmū'), and the Fixed Entities (al-A'yān) are none other than Him.\n\nLook at His saying, the Exalted: <<مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ>> (There is no private counsel of three but that He is the fourth of them). Then He said: <<وَلَا أَدْنَى مِنْ ذَلِكَ>> (nor of fewer than that)—meaning fewer than three—<<وَلَا أَكْثَرَ>> (nor of more than that)—up to an infinite number—<<إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا>> (but that He is with them wherever they are), whether in existence or non-existence, wherever they are hypothesized. He, the Glorified, is the second of the one, for concomitance (al-Ma'iyya) is not valid for the one from himself, as it requires companionship, and the minimum is two. He is the third of two, the fourth of three, and the fifth of four, however far the number reaches.\n\nIf concomitance is attributed to creation (al-Khalq) without The Real (al-Ḥaqq), then the concomitance of the second is the second of two, the concomitance of the third for two is the third of three, and the concomitance of the fourth for three is the fourth of four, however far the number reaches, because he is the very essence of what he is with in creaturehood; he is of its genus. The Real is not like that, for <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him). Thus, He is not the third of three nor the fifth of five. Understand this.\n\nThe Real has thus been distinguished from creation from one perspective, and He has also appeared in its form from another perspective.\n\n### That Nature is the Shadow of the Universal Soul, expressed as the Preserved Tablet (al-Lawḥ al-Maḥfūẓ)\n\nKnow that Nature (al-Ṭabī'a) is the shadow (ẓill) of the Universal Soul (al-Nafs al-Kulliyya), which is described by two powers and expressed in the language of the Law (al-Shar') as the Preserved Tablet (al-Lawḥ al-Maḥfūẓ). That part of the shadow which did not extend and remained within the Soul is what descended with it from the Intellect (al-'Aql) in the degree of luminosity and illumination. That part of the shadow which extended was named Nature.\n\nThe extension of this shadow occurred upon the Essence (dhāt) of the Universal Hylē (al-Hayūlā al-Kull), and from the substance (jawhar) of the Hylē and Nature, the Universal Body (al-Jism al-Kull) appeared dark. For this reason, they likened it to the Black Pearl (al-Sabja al-Sawdā') due to this natural darkness, and they named the Soul the Green Emerald (al-Zumurruda al-Khaḍrā') due to what descended with it from the Intellect in light.\n\nIn the Universal Body, the forms and shapes of the world of bodies appeared. This was like the limbs for the Universal Body. When the Body became prepared, the Soul turned toward it and illuminated it, and life (al-Ḥayāt) spread throughout all its limbs. These are the spirits (arwāḥ) of the world of bodies, both celestial (falak) and elemental ('unṣurī), upper and lower. Then, parts of it transformed into other parts due to the influence of temporal movement (al-Ḥaraka al-Zamāniyya), whose essence is the Divine Name *al-Dahr* (Time/Eternity) in the celestial spheres (al-Aflāk). Thus, the forms of the celestial generated things (al-Mawalladāt al-Falakiyya) appeared to the eye, such as the stars, the gardens, their ranks, and what is within them; and the elemental generated things, such as minerals, plants, animals, and strange forms and wondrous shapes in an essential existence ('ayn wujūdiyya). Nothing emerged from non-existence except the forms and accidents ('arāḍ) of composition and analysis. The substance (al-Jawhar) remains fixed in its essence, capable of receiving all these forms, both in this world (dunyā) and the Hereafter (ākhira).\n\nIf you know and confirm this, then know that the meaning intended by His saying, the Exalted: <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ>> (He directs the affair; He details the signs) is Determination (al-Taqdīr) and Bringing into Existence (al-Ījād). *Al-Tadbīr* (Directing) is for Determination, and *al-Tafṣīl* (Detailing) is for Bringing into Existence, derived from separating (faṣaltu) one thing from another when you cut it off from it and separated between them until it became distinct. If the separation is based on determination, it takes its form and shape. If it is without determination, it may not take its form, even if it resembles it in some respect, for it differs from it in another respect, just as white and black share in being colors, even though they are opposites, and just as color and movement share in being accidents, even though they are different. The poet said:\n\nYou cut out what you created, while\nSome people create but do not cut out.\n\nLike the shoemaker (al-Iskāf) and others, such as the goldsmith, tailor, and blacksmith, who intends to cut a sandal from leather. He takes a sandal and determines its measure upon the leather. When he takes that determined measure from the leather, he cuts that amount from the leather and separates it.\n\nThe shadows (al-Ẓilālāt) were brought into existence by Allah in the likeness of the persons (al-Ashkhāṣ). When He willed to separate them, He extended them, and their essences appeared in the form of the one whose shadow they are, exactly like a sandal following a sandal (ḥadhw al-na'l bi-l-na'l).\n\nWhen Allah created the Cosmos without the human—that is, without his totality—He measured his form against the form of the entire Cosmos. There is no part in the Cosmos except that it is in the form of the human. By the Cosmos, I mean everything other than Allah. Then He separated him from the Cosmos after He had directed him (dabbarahu), and this is the very essence of the directed affair (al-Amr al-Mudabbar).\n\nThen, the Exalted measured him with a spiritual measure (ḥadhw ma'nawī) against the Divine Names Presence (al-Ḥaḍra al-Asmā' al-Ilāhiyya), and the images appeared in him as images appear in a mirror to the viewer. Then He separated him from the Divine Names Presence after its powers had been established in him, and he appeared through them in his spirit (rūḥ) and his inner being (bāṭin). Thus, the exterior (ẓāhir) of the human is creation (khalq), and his interior (bāṭin) is The Real (ḥaqq). This is the desired Perfect Human (al-Insān al-Kāmil). Everything other than this is the animalistic human (al-Insān al-Ḥayawānī). The rank of the animalistic human relative to the Perfect Human is the rank of the creation of the *Nisnās* (a mythical creature) relative to the animalistic human.\n\nThis is the general statement regarding the creation of the Perfect Human, without detail. As for the detail of his creation, know that when Allah created the four elements (al-Arkān al-Arba'a) without the celestial sphere (al-Falak), and rotated them in the shape of the sphere—and all are shapes in the Universal Body—the first celestial movement appeared to affect the element closest to it, which is Fire (al-Nār). It affected it by igniting it with the moisture in the Air (al-Hawā'), and that ignition and flame came from Fire and Air, which is *al-Mārij* (the mixed), from which the Jinn (al-Jānn) were created. From this, a meadow (al-Marj) is named *marj* because it contains a mixture of flowers and plants, and from this, people fell into *harj* (killing) and *marj* (mixing/chaos).\n\nThen the luminous stars poured forth, by the command and permission of Allah, for He <<أَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (revealed in every heaven its command). They cast their rays upon the elements, and the elements are the receptacles of the rays. The elements appeared with lights, shone, and illuminated, and they influenced and generated within themselves minerals, plants, and animals. In reality, it was the elements that influenced themselves, because the celestial spheres (al-Aflāk)—meaning the heavens—were brought into existence by Allah from the elements. Then they influenced the elements through their movements and the casting of their stars' rays, so that the generated things (al-Mawalladāt) were born within them. Thus, their merchandise was returned to them; nothing influenced them but themselves. This was made one of the signs of the Hour, for among its signs is that \"the slave woman gives birth to her master.\" The elements gave birth to the celestial sphere, and then the sphere married them, and what was born within them was born. Thus, it is their son and their husband.\n\nNo form of the human, who is the purpose of the existence of the Cosmos, appeared in the elements. So, He took the sticky earth (al-Turāb al-Lazij) and mixed it with water, making it clay (ṭīn) with His two Hands, the Exalted, as befits His Majesty, since <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him). He left it for a period to ferment (yakhtamir) by the hot air passing through the parts of its clay, so it fermented and its smell changed, becoming black, foul-smelling mud (ḥama' masnūn). Whoever wishes to see the truth of this, if there is any flaw in his faith, let him rub his arm vigorously against his other arm until he feels the heat from the skin of his arm, then let him inhale it, and he will find the smell of the *ḥama'*, which is the origin from which the body was created. Allah, the Exalted, said: <<خَلَقَ الْإِنْسَانَ مِنْ صَلْصَالٍ وَمِنْ حَمَإٍ مَسْنُونٍ>> (He created man from sounding clay, from black, foul-smelling mud).\n\nWhen the pottery (fakhkhāra) of the human was purified by the cooking of the element of Fire, and its parts joined together, strengthened, and hardened, He shortened it with Water, which is the element of life. Water gave it of its moisture and softened the hardness of the pottery. Life flowed through it. The element of Air supplied it with its moisture and heat to counteract the coldness of the Water with its heat, so they resisted each other. The moisture prevailed upon it, transforming the substance of its clay into flesh, blood, muscles, veins, nerves, and bones. These are all different temperaments (amzija) due to the differing effects of the nature of the elements and the preparedness of the parts of this formation (nash'a). For this reason, the essences of this animalistic formation differed, and their names differed so that each essence might be distinguished from the others.\n\nThe sustenance of this formation was made from what it was created from. Sustenance is the cause of the existence of plants, and through it, growth occurs. He expressed its growth and the appearance of increase in it by His saying: <<وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا>> (And Allah caused you to grow from the earth as a plant). The meaning is: \"So you grew as a plant,\" for the verbal noun of *anbata* is *inbāt* (causing to grow). He attributed the plant (nabāt) to the thing that grows. He says: He made your sustenance from it—that is, from what it grows—so that you grow by it, meaning your bodies grow and increase.\n\nWhen He completed the physical, vegetative, animalistic formation, and all the powers of the animal appeared in it, He gave it Thought (al-Fikr) from the power of the practical soul (al-Nafs al-'Amaliyya), and He gave it that from the power of the theoretical soul (al-Nafs al-'Ilmiyya) from the Divine Name *al-Mudabbir* (The Director). For all the crafts and knowledge that the animal performs are not based on deliberation (tadbīr) or reflection (ru'ya); rather, it is naturally disposed (mafṭūr) to the knowledge of what issues from it, and it does not know where that precision and perfection came from, like spiders, bees, and wasps. This is unlike the human, who knows that he did not deduce any matter except through thought, reflection, and deliberation, and thus knows the source of that matter. The rest of the animals know the matter but do not know its source.\n\nBy this capacity alone, he is called human (insān), and this state is shared by all people, except the Perfect Human (al-Insān al-Kāmil). He surpasses the animalistic human in this world by disposing of the Divine Names whose powers he acquired when The Real measured him against them, just as He measured him against the Cosmos. Thus, the Perfect Human was made the vicegerent (khalīfa) of the Universal Great Human (al-Insān al-Kull al-Kabīr), who is the Shadow of Allah (Ẓill Allāh) over His creation from His creation. Therefore, he is a vicegerent of that.\n\nThus, they are vicegerents of a single one who appointed them. They are His shadows for the Divine Lights (al-Anwār al-Ilāhiyya) that confront the original Human. Those are the lights of Theophany (al-Tajallī) that differ upon him from every side, so multiple shadows appear to him according to the number of the Theophanies. For every Theophany in him, there is a light that gives a shadow of the human form in the elemental existence, and that shadow becomes a vicegerent, and from him, specifically, the vicegerents come into existence. As for the animalistic human, that is not his origin at all. His ruling is merely the ruling of the rest of the animals, except that he is distinguished from other animals by the constitutive differentia (al-Faṣl al-Muqawwim) for him, just as animals are distinguished from one another by the constitutive differentia for each animal. The horse is not the donkey, nor the mule, nor the bird, nor the predator, nor the worm, by virtue of its constitutive differentia. The animalistic human is one of the creeping things. If he is perfected, he is the Vicegerent. Thus, we agree in some meanings and differ in others.\n\n### Indeed, Allah gave him the Rule of Vicegerency and the Name of Vicegerent\n\nThen, Allah gave him the rule of Vicegerency (al-Khilāfa) and the name of Vicegerent (al-Khalīfa), both of which are grammatically feminine terms, indicating that creation (al-Takwīn) manifests through them, for the female is the locus of creation. This is a subtle indication in the Name. He did not call him a deputy (nā'ib), even though the meaning is the same, but rather said: <<إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً>> (Indeed, I am placing upon the earth a vicegerent). He did not say \"a human\" or \"a caller.\" He only mentioned him and named him with what He brought into existence for him.\n\nWe distinguish between the animalistic human and the Perfect Human, the Vicegerent, because of His saying, the Exalted: <<يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ * الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ>> (O mankind, what has deceived you concerning your Generous Lord, Who created you, fashioned you, and balanced you?). This is the perfection of the elemental, natural human formation. Then He said to him after that: <<فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ>> (In whatever form He willed, He composed you). If He wills, He composes you in the form of perfection, making you His vicegerent in the Cosmos, or in the form of the animal, making you one of the animals by your constitutive differentia, which belongs only to one upon whom the name \"human\" is applied.\n\nIn no other formation of creation was *taswiya* (fashioning) or *ta'dīl* (balancing) mentioned, although <<الَّذِي خَلَقَ فَسَوَّى>> (Who created and fashioned) has been mentioned. This may refer to the creation of the human, because fashioning and balancing occur together only for the human, for He fashioned him upon the form of the Cosmos and balanced him upon it. This was not granted to any other creature of the elements. Then, after the fashioning and balancing, He said to him, \"Be!\" (Kun), which is a Divine Breath (nafas ilāhī).\n\nThe Perfect Human appeared through the fashioning, the balancing, the breathing of the Spirit (Nafkh al-Rūḥ), and the command *Kun*. This is His saying: <<إِنَّ مَثَلَ عِيسَى عِنْدَ اللَّهِ كَمَثَلِ آدَمَ خَلَقَهُ مِنْ تُرَابٍ ثُمَّ قَالَ لَهُ كُنْ فَيَكُونُ>> (Indeed, the likeness of Jesus to Allah is as the likeness of Adam. He created him from dust, then said to him, \"Be!\" and he was). He likened the perfected one, Jesus, peace be upon him, to the perfected one, Adam, peace be upon him—a vicegerent to a vicegerent. Non-vicegerents were only fashioned and had the Spirit breathed into them (<<وَنَفَخَ فِيهِ مِنْ رُوحِهِ>>), and it was not said to them, \"Be!\" except in the general verse: <<إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Our word to a thing, when We intend it, is only that We say to it, \"Be!\" and it is). Pay attention to what I have alerted you to.\n\nThus, they fall short of the rank of perfection that Allah granted to the vicegerents among mankind.\n\nWhen Allah divided the Atlas Sphere (al-Falak al-Aṭlas), which is the Sphere of the Signs (Falak al-Burūj)—His saying: <<وَالسَّمَاءِ ذَاتِ الْبُرُوجِ>> (By the heaven containing the constellations)—into twelve divisions, Allah revealed in the heaven of the Signs its command (amr), so each sign has a command by which it is distinguished from the others. Allah made these Signs have an effect, derived from the command revealed in them, upon the world of composition (al-'Ālam al-Tarkīb) below this heaven.\n\nThe human, in terms of his body and nature, belongs to the world of composition. He is the churned cream (zubda makhḍ) of Nature that appeared through the movement of the celestial spheres. He is the cream (al-Makhḍa) than which there is nothing finer in the milk; rather, he is the spirit of the milk. If he were removed from it, the Cosmos would remain like chaff. He is in it, yet not in it, for he is essentially distinct from it, yet he is from it, for the human did not emerge from the Cosmos, even though he is the churned cream of the Cosmos. If he were separated from it, the Cosmos would cease to be worth anything, just as milk, when its cream is removed, changes, its price decreases, and the goodness sought from it vanishes. It was because of that cream that the milk was used and its value was magnified.\n\nWhen Allah decreed that these Signs should have an effect on the Cosmos beneath the enclosure of this heaven, Allah placed in the formation of this human twelve receptive faculties (qābil) by which he accepts these effects, and through which the Perfect Human appears. This is not the case for the animalistic human, even though he is more complete in accepting these effects than the rest of the animals, but he is deficient compared to the acceptance of the Perfect Human.\n\nThe twelve include his adherence to the Cosmos when he was measured against it, and his adherence to the Divine Names Presence (al-Ḥaḍra al-Asmā' al-Ilāhiyya). Through this, perfection was validated for this Soul. This contiguity (al-Mujāwara) is on three levels:\n\n1.  **The Level of Specialization (Martabat al-Ikhtiṣāṣ):** This exists in the animalistic human insofar as he possesses the realities of the Cosmos, and it exists in the Perfect Human in the same way, but also by virtue of what distinguishes him concerning the Divine Names, when they applied to him by the rule of correspondence to the Divine, attentive measurement (al-Ḥadhw al-Ilāhī al-I'tinā'ī), and by virtue of his being a shadow (ẓill), for nothing is more adherent than the shadow to that from which it originates.\n2.  **The Level of the Connecting Thingness (Martabat al-Shay'iyya al-Rābiṭa):** These are the tools (al-Adawāt) through which what is created by the human manifests. The animalistic human shares with the Perfect Human the industrial tools used to achieve a manufactured thing by hand. The Perfect Human surpasses him by acting through Spiritual Aspiration (al-Himma). His tool is his *Himma*, which is for him like the Divine Will (al-Irāda al-Ilāhiyya); when it is directed toward the existence of a thing, it is impossible for that desired thing not to be.\n3.  **The Level of Connection with The Real (Martabat al-Ittiṣāl bi-l-Ḥaqq):** In this connection, he is annihilated (faniy) from himself, and The Real appears, such that He becomes his hearing and his sight. This is called the science of Tasting (al-Dhawq). The Real does not become any of these tools until they are consumed by His Existence (Wujūd), so that He is, and they are not. We have tasted this, and I found the burning (al-Ḥarq) physically during my remembrance of Allah by Allah (dhikrī li-Llāh bi-Llāh). He was, and I was not. I felt the burning in my tongue and suffered pain from that burning—a physical, animalistic pain—due to a physical burning that occurred in the organ. I remained in that state, remembering Allah by Allah, for about six hours. Then Allah caused my tongue to grow back, and I remembered Him with presence (al-Ḥuḍūr) with Him, not by Him. Similarly, all faculties: The Real does not become any of them until His Existence consumes that faculty, so that He is, whatever the faculty may be. This is His saying: \"I was his hearing and his sight.\"\n\nWhoever does not witness and feel the burning in his faculties has no Tasting (dhawq); rather, it is merely an illusion on his part. This is the meaning of His saying concerning the Divine Veils (al-Ḥujub al-Ilāhiyya): \"If He were to remove them, the splendors of His Face would burn up...\" So, whichever faculty The Real wills to consume in His servant, so that the servant gains knowledge of the matter through the path of Tasting, the veil between the human (in terms of that faculty) and The Real is lifted, and the faculty is consumed by the Light of the Face. Then He Himself fills the deficiency of that faculty. If it was his hearing, The Real becomes his hearing in that state; likewise, if it was his sight, and likewise, if it was his tongue. Concerning this meaning, we have:\n\nIndeed, the remembrance of Allah by Allah burns,\nAnd my judgment concerning this is a confirmed ruling.\n\nFor I, by the Lord of the Influxes (al-Wāridāt), have tasted it,\nSo my judgment upon it is that The Real confirms it.\n\nThe Real said in the authentic Hadith: \"I was his hearing and his sight.\"\n\nHe made His Being (Kaynūnatihi) the hearing of a servant described by a specific attribute. This is the greatest connection that occurs from Allah to the servant, where He removes a power from his powers and takes the place of what He removed with His Being in the servant, in a manner befitting His Majesty, without likening (tashbīh), modality (takyīf), limitation (ḥaṣr), encompassing (iḥāṭa), indwelling (ḥulūl), or substitution (badaliyya). The matter is as we have stated: <<وَمَا شَهِدْنَا إِلَّا بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حَافِظِينَ>> (And we did not witness except what we knew, and we were not guardians of the unseen). <<وَاسْأَلِ الْقَرْيَةَ>> (And ask the town)—meaning the community (al-Jamā'a)—<<الَّتِي كُنَّا فِيهَا>> (where we were)—meaning the People of Allah (Ahl Allāh) described by this path among the servants of Allah who performed supererogatory good deeds and persisted in them, and turned to Allah through them. May Allah support us with infallibility in belief, word, and deed, for He is the Guardian of Mercy.\n\nThe second effect (al-Athar al-Thānī) of the twelve is that the two linguistic likenesses (al-Mithlayn al-Lughawiyyayn) do not necessitate that each one, by being described as a likeness of the other, shares in the attributes of the soul (al-Nafs). For likeness (al-Mithliyya) is linguistic and intellectual. The intellectual likeness is that by which they share in the attributes of the soul, while the linguistic likeness is based on the slightest resemblance in some matter, making it a likeness in that matter. The likeness then has the ruling of its counterpart insofar as it is like it and receptive to it.\n\nThere is nothing between the Perfect Human servant and The Real in <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him) except his acceptance of all the Divine Names (al-Asmā' al-Ilāhiyya) that are in our hands, and through which his vicegerency is validated and he is favored over the Angels. If the vicegerent does not manifest the rulings of the one who appointed him and his form in disposing of the appointed, then he is not his vicegerent. Just as the vicegerent is appointed by the one who appointed him over his wealth and all his affairs when he took him as an agent (wakīl), so too, in what The Real appointed him over concerning the disposal of the vicegerent, he acts only by the view of his Agent. Thus, he is the appointed by the appointer. The servant's appointment of his Lord, when he takes Him as an Agent, is an absolute vicegerency and a delegated, cyclical agency. The Lord's appointment of His servant is a restricted vicegerency, according to what his essence (dhāt) and formation (nash'a) grant.\n\nThe Prophet, peace and blessings be upon him, said to his Lord, the Mighty and Majestic, when traveling: \"You are the Companion in the journey and the Vicegerent (al-Khalīfa) over the family.\"\n\nThus, he named Him Vicegerent. Allah, the Exalted, swore by every known thing, whether existent or non-existent, saying: <<فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ * وَمَا لَا تُبْصِرُونَ>> (So I swear by what you see, and what you do not see). He swore by Himself and by all known things. Are we permitted to swear by what Allah swore by, or is that forbidden to us? If it is forbidden, then we are not vicegerents in what is forbidden to us.\n\nThe object of the oath may be sworn by, whether attributed or singular. The singular is: \"By Allah, I will do such-and-such.\" The attributed is like the saying of 'A'isha, may Allah be pleased with her, in her oath: \"By the Lord of Muhammad.\" The attributed enters into the attribute in the mention of the oath. According to this limit, the Perfect Human swears by every known thing, whether he mentions the Name or not. This is one of the interpretations of Allah's swearing by things, such as His saying, the Exalted: <<وَالشَّمْسِ وَضُحَاهَا * وَاللَّيْلِ * وَالتِّينِ>> (By the sun and its brightness, and by the night, and by the fig). He means: \"By the Lord of the sun, and the Lord of the brightness, and the Lord of the fig.\" Thus, He only swore by Himself. Any other oath is invalid; no oath is contracted by it concerning the object of the oath. For this reason, the Exalted said: <<لَا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ>> (Allah will not impose blame upon you for what is unintentional in your oaths). *Al-Laghw* (unintentional/vain) is the invalid. The meaning is: Allah will not impose blame upon you for the oaths for which He has dropped the expiation (kaffāra) if you break them. <<وَلَكِنْ يُؤَاخِذُكُمْ بِمَا عَقَّدْتُمُ الْأَيْمَانَ>> (But He will impose blame upon you for what you intended of oaths). Since the intention (al-'Aqd) in the heart is dropped when swearing, the expiation is dropped if the oath is broken. There is no disagreement among scholars that the expiation mentioned in the Quran for oaths is for swearing by Allah, not by anything else. The oaths are mentioned as definite by addition and by the definite article (alif and lām). It is authentically reported that the Prophet, peace and blessings be upon him, forbade swearing by anything other than Allah.\n\nThe Vicegerent should align with the Will (Irāda) of the one who appointed him in the matter for which he was appointed. Allah says: <<وَاللَّهُ غَالِبٌ عَلَى أَمْرِهِ>> (And Allah is predominant over His affair). The word *al-Ṣūra* (Image/Form) may mean *al-Amr* (Command) and *al-Sha'n* (Affair) in the language.\n\nThus, His saying: \"Allah created Adam upon His Image (Ṣūratihi)\" means upon His Command and His Affair. Allah is predominant over His Affair—that is, over the one He manifested in His Image (Amr/Sha'n)—for He retains the power to dismiss him (al-'Azl) while his formation remains. This indicates that by the Image, He did not mean the formation (al-Nash'a), but rather the Command and the Ruling (al-Ḥukm). The Cosmos does not deviate from the path of Knowledge (al-'Ilm) and Allah's Will in things. This Command alone, by specialization, is one of the effects of Gemini (al-Jawzā') specifically, which is an airy sign.\n\nThe Command corresponds to the saying of the Prophet, peace and blessings be upon him: \"The Lord was in a 'Amā'\" (a thin cloud, above which is air and below which is air). He negated the encompassing of the air around this *'Amā'* but did not negate the air itself. The Command belongs to Allah, so the attribution of the *'Amā'* to Him is no more appropriate than the attribution of the air. The negation of the aerial encompassing of this *'Amā'* necessarily involves the negation of the totality (al-Majmū'), not the collection (al-Jamī'). We have explained the Hadith of the *'Amā'* and Gemini (al-Jawzā') in the context of the Breath of the Merciful (al-Nafas al-Raḥmānī). Gemini is between Taurus (earth) and Cancer (water), just as Adam is between water and clay. For this reason, the ruling of Air (al-Hawā') is more universal than the other elements, because it penetrates everything and has dominion over everything. It shakes the earth, causes the water to surge and flow, ignites the fire, and is the life of every breathing soul. It is responsible for generation in trees, being the fertilizing winds (al-Riyāḥ al-Lawāqiḥ). This is the second effect of the twelve divisions.\n\nAs for the third effect (al-Athar al-Thālith), it is what appears in the Cosmos that could be dispensed with, but appeared despite being dispensable, so that the rank of the power of duality might appear, lest it be said that nothing exists but Allah, even with the manifestation of possibilities (al-Mumkināt) and creatures. Thus, it is known that <<فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ>> (Indeed, Allah is self-sufficient above the worlds), and His self-sufficiency from the worlds is intelligible. This matter, which could be dispensed with, came into the Cosmos despite its existence, to demonstrate the self-sufficiency of The Real from the Cosmos. He did not place it in the Cosmos in vain. Granting its existence despite His self-sufficiency provides this knowledge, which is beneficial knowledge. It has a specific order that resembles the order of what cannot be dispensed with, such as the existence of a child through marriage, even though marriage is dispensable. Our proof is the marriage of the people of Paradise in Paradise, and the marriage of the sterile.\n\nAs for the fourth effect (al-Athar al-Rābi'), it is His saying, peace and blessings be upon him: \"The Hour will not commence while there is anyone on the face of the earth who says: Allah, Allah.\"\n\nHe brought it twice and did not suffice with one, thereby confirming that it is a remembrance in isolation, without describing it with anything. The *hā'* of the Name is quiescent. This is an interpretation of His saying, the Exalted: <<اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا>> (Remember Allah with frequent remembrance), which is the repetition of this Name. His saying: <<وَلَذِكْرُ اللَّهِ أَكْبَرُ>> (And the remembrance of Allah is greater) refers specifically to the Name *Allah* alone. He is commanded by Allah to clarify to people what was revealed to them. If the human's saying \"Allah, Allah\" did not preserve the Cosmos in which this remembrance occurs, its cessation would not be linked to the cessation of the realm from which it ceased, which is the world (al-Dunyā). This Name was our remembrance and the remembrance of our Shaykh whom we entered upon. Among the benefits of remembrance, there is none greater than its benefit. Since The Real said: <<وَلَذِكْرُ اللَّهِ أَكْبَرُ>> (And the remembrance of Allah is greater), and did not mention the form of any other remembrance, despite the abundance of remembrances using the Divine Names, the People of Allah (Ahl Allāh) adopted it as their sole remembrance. It produced in their hearts a great matter that no other remembrance produced. Some scholars of external forms did not see the benefit of this remembrance because they considered its benefit to be lacking, since every subject (mubtada') must have a predicate (khabar). It is said to them: That is not necessary in the wording, but it must have a benefit, and that benefit has appeared in the one who remembers it, specifically when he remembers with this word. It produces in his inner being a light of Unveiling (Nūr al-Kashf) that no other remembrance produces. Rather, it has a manifest predicate, though not in the wording, such as an attribution to transcendence (tanzīh) or praise through an act. It is known that when a matter is mentioned, and then another matter is mentioned and repeated by way of emphasis, it yields a benefit that is not yielded by what does not have this ruling or is not intended by it. Thus, it is faster and more successful in seeking matters. There is no vanity (al-'Abath) in the Cosmos whatsoever.\n\nAs for the fifth effect (al-Athar al-Khāmis), it resembles the fourth, just as the sign of Aries (al-Ḥamal) resembles the signs of Leo (al-Asad) and Sagittarius (al-Qaws), even though this is not the essence of that, and each is distinguished by a matter that does not belong to the other, despite their resemblance. For this reason, the resemblance occurred in the effects, just as it occurred in the origin. This is everything that occurs in the Cosmos and yields a sound meaning other than its mere manifestation. If it were removed from the Cosmos, the matter in which it yielded this meaning would not be impaired, but it would necessarily be diminished from the matter that its existence grants. These are called the accidents of bestowals ('Awāriḍ al-A'ṭiyāt), whose removal or non-occurrence does not impair the reality from which they were removed, even though they have a meaning, such as the existence of the pleasure of intercourse (ladhdhat al-jimā') without intercourse. The benefit intended by intercourse was achieved, but its achievement through intercourse has a meaning that is only achieved through intercourse, because the purpose of marriage is pleasure (iltidhādh) and the existence of pleasure, and that has been found. Thus, the removal of intercourse did not impair the pleasure. For this reason, Allah married us to the wide-eyed maidens (al-Ḥūr al-'Īn).\n\nAs for the sixth effect (al-Athar al-Sādis), it relates to the person of Spiritual Aspiration (ṣāḥib al-Himma) when he wills to bring into existence something that does not ordinarily occur except by means (āla). He performs it by his *Himma* without means, and at times with means. Allah is capable of creating Adam initially without fermentation, without the direction of two Hands, without fashioning, and without balancing for the breathing of the Spirit; rather, He <<يَقُولُ لَهُ كُنْ فَيَكُونُ>> (says to him, \"Be!\" and he is). Yet, He fermented his clay with His two Hands, fashioned him, balanced him, then breathed the Spirit into him, taught him the Names, and brought things into existence in an ordered sequence. Similarly, if He had willed, He would have made us suffice with the knowledge of Him without His Names, but He named Himself thus in every language He placed in the Cosmos—He is called Allah in Arabic, Khudāy in Persian, Wāq in Abyssinian, and He has Names in every language, along with the knowledge of His existence. He manifested the benefit of this, despite the self-sufficiency from what was manifested and the sufficiency without it.\n\nFrom this category is what manifests from our actions, even though it is permissible for Allah to perform them without our hands, yet they only reached manifestation in the witnessed world through our hands. If He willed to move a body from one place to another, He placed in us the will to seek movement, so we arose with a voluntary movement that we understand from our souls, and we moved. Movement is fundamentally Allah's creation, but it occurred through a contingent, voluntary will, unlike the movement of a trembling person, which is involuntary. The chosen human is compelled in his choice, according to the sound intellect.\n\nFurthermore, no reality manifests its ruling except through a locus (maḥall). Thus, it only manifests through a locus, distinguishing between what is permissible and what is not. Movement is impossible to exist except in a moving thing. From this category is His descent to the lowest heaven during the last third of the night, despite His being with us wherever we are. This is the ruling of a descent that appeared through an act, even though the desired result could be achieved without this descent. However, when you attribute it to His saying, the Exalted: <<فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ>> (Indeed, Allah is self-sufficient above the worlds), it must be a descent from the rank of self-sufficiency, because He does not accept this descent except for a Divine relationship (nisba ilāhiyya) that His Essence necessitates. Thus, it only occurred through descent. Understand this, for attributions (al-Iḍāfāt) have an essential ruling that others do not have, and realities do not change. The affair is only the manifestation of a ruling in a subject. From one perspective, His Essence demands it, and from another, His Essence, the Exalted, does not demand it, just as the Creator demands creation, and the Knower demands the known.\n\nAs for the seventh effect (al-Athar al-Sābi'), it is the existence of spatial containment (al-Ẓarfiyya) in the Cosmos. Is it fundamental to the Cosmos, and we then attributed it to The Real by a legal attribution, or is it in The Real in a manner befitting His Majesty, and it manifested in the Cosmos through action?\n\nLike the saying of the Messenger of Allah, peace and blessings be upon him, to the black woman: \"Where is Allah?\" and she pointed to the sky, though she was mute.\n\nThe Exalted said: <<وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ>> (And Allah is All-Knowing of everything). The pattern *fa'īl* (e.g., *alīm*) can mean the agent (fā'il) or the patient (maf'ūl), like *qatīl* (slain) and *jarīḥ* (wounded). So *alīm* can mean *ālim* (Knower) or *ma'lūm* (Known). Both interpretations are valid in this verse. If the preposition *bi* in *bi-kulli shay'in* means *fī* (in), then He is Known in everything. <<وَبِكُلِّ شَيْءٍ مُحِيطٌ>> (And He is encompassing of everything), meaning He has an encompassing presence in everything, according to what that known thing is. This belongs only to Allah, or to one whom Allah informs.\n\nAs for the eighth effect (al-Athar al-Thāmin), it is His saying, the Exalted: <<فَاسْأَلْ بِهِ خَبِيرًا>> (So ask concerning Him one well-informed). That is, if you wish to ask about the reality of a matter, ask one who has Tasting (dhawq) in it. Do not ask one who has no Tasting in things, for he will only inform you of the name of what you asked about, not its reality.\n\nThe servant should not be asked about God (al-Ulūhiyya), for he has no Tasting of Divinity and no expertise in it; he only possesses the Names. Ask Allah about Allah, and ask the servant about servitude (al-'Ubūda). The relationship of servitude to the servant is the relationship of Divinity to Allah. The Real's informing about servitude is an informing for Him, and the servant's informing about Divinity is the informing of a servant. For this reason,\n\nIt is reported: \"He who knows himself knows his Lord.\"\n\nHe knows himself with a knowledge of Tasting (ma'rifat dhawq), so he finds no entry point for Divinity in himself. He knows by necessity that if Allah resembled him or was his likeness, he would have known Him in himself. He knows by his need (iftiqār) that there is One to Whom he is in need, and that He cannot resemble him. Thus, he knows his Lord that He is not like him, even though Allah has established him as a vicegerent and brought him into existence upon the Image, so that He is feared, hoped for, obeyed, and disobeyed. We have explained the meaning of this in these effects within this chapter.\n\nAs for the ninth effect (al-Athar al-Tāsi'), it is His saying concerning the creation of the heavens and the earth that He only created them *bi-l-Ḥaqq* (in truth/for The Real). That is, He only created them for Him, the Exalted is His Majesty and blessed is His Name, because He said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is nothing except that it glorifies Him with praise). He only created the Cosmos for Him, the Exalted. For this reason, He said concerning those whom He knew He placed pride ('izza) in their formation—the Jinn and mankind: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me). That is, that they should humble themselves (yatadhallalū) to Me, due to the pride and claim of Divinity and self-admiration that appeared in them. It is from Allah's kindness to them that He alerts them to what He intended for them in their creation. Whoever is alerted is among the many who prostrate to Allah, and whoever is not alerted is among the many upon whom the punishment is due.\n\nAs for His saying in this verse: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ>>, He may intend the human alone, insofar as he has an exterior (ẓāhir) and an interior (bāṭin). Insofar as he has an exterior, he is *ins* (mankind), from *ānastu al-shay'* (I perceived the thing), as the Exalted said concerning Moses, reporting from him: <<إِنِّي آنَسْتُ نَارًا>> (Indeed, I perceived a fire). The Jinn (al-Jinn) are the inner being (bāṭin) of the human, for it is concealed from him. It is as if He said: \"I did not create what is manifest of the human and what is concealed except that they should worship Me,\" outwardly and inwardly. For the hypocrite worships Him outwardly but not inwardly, and the believer worships Him outwardly and inwardly. The disbelieving nihilist (al-Kāfir al-Mu'aṭṭil) does not worship Him outwardly or inwardly. Some sinners worship Him inwardly but not outwardly. There is no fifth division.\n\nWe only restricted the Jinn in this verse to the concealed aspect of the human, and did not apply it generally to the Jinn created from fire, because Allah, when mentioning prostration, mentioned all those who prostrate to Him from the heavens and the earth, and He said concerning people: <<وَكَثِيرٌ مِنَ النَّاسِ>> (And many of mankind), so He did not generalize them. The devils (al-Shayāṭīn) are included in His saying: <<مَنْ فِي الْأَرْضِ>> (those on the earth). This is because Satan (al-Shayṭān), who is far from mercy, says to the human when he commands him to disbelieve and he disbelieves: <<إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ>> (Indeed, I am disassociated from you. Indeed, I fear Allah, Lord of the worlds). Thus, Allah revealed to us the devil's knowledge of his Lord and his fear of Him. Therefore, directing the Jinn in this verse to the concealed aspect of the human is more appropriate than applying it generally to the Jinn. And Allah knows best.\n\nAs for the tenth effect (al-Athar al-'Āshir), it is what appeared in the Cosmos through the clarification of the Messengers (al-Rusul), who translated for Allah what He revealed to His servants, along with the revelation of His Books. He did not suffice with the descent of the Divine Books, but made the Messengers clarify what was in them, due to the generality (al-Ijmāl) in the expression and the need for detail (al-Tafṣīl). Expression is only detailed by expression. Thus, the Messengers took the place of The Real in detailing what He did not detail and summarized. This is His saying, the Exalted: <<لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ>> (that you may make clear to the people what was sent down to them), after conveying what was sent down to us. This is a reality that flows throughout the Cosmos. Were it not for this, the Books would not have been explained, nor translated from one language to another, nor from one state to another. The Exalted said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ>> (So grant him protection until he hears the Word of Allah), which is specifically what He revealed. As for what the Messenger detailed and clarified, it is the detailing of what was revealed, not the revealed text itself. Clarification occurs through a specific expression and is understood by whatever means.\n\nAs for the eleventh and twelfth effects (al-Athar al-Ḥādī 'Ashar wa al-Thānī 'Ashar), they are the two ranks of the three ranks we mentioned at the beginning of these effects: the rank of connection with The Real (al-Ittiṣāl bi-l-Ḥaqq) and the rank of the connecting cause (al-Sabab al-Rābiṭ) between the two matters, which have already been discussed.\n\nLet us now mention the sciences contained in this station (manzil), if Allah wills. Among them is the knowledge of the cause necessitating the permanence of the believer in bliss in the Abode of Bliss. It includes the knowledge of the causes of success and salvation from ignorance, which is the worst of evils. It includes the knowledge of what the station (al-Mawṭin) deserves of matters that bring happiness to the human, which may appear in another station but do not grant happiness. It includes the knowledge of whether the ruling (ḥukm) of everything whose essence is fixed (thabata 'aynuhu) is dropped, or if only the ruling of some fixed essences is dropped, or if no ruling is dropped from it absolutely, but only a specific ruling is dropped, not every ruling. Should one be occupied with what has had its ruling dropped, or not, like the vain oath (laghw al-yamīn), for which the expiation is dropped if it is broken? It includes the knowledge of the increase that appears when the act is attributed to the creature in a legally required manner or by a noble, rational disposition. It includes the knowledge of the Full (al-Mala') and the Void (al-Khala'). It includes the knowledge of performing what is proper and avoiding what is improper. It includes the knowledge of transgression (al-Ta'addī) in the boundaries (ḥudūd) of things, and whether the boundary is included in the bounded thing, so that it is not a transgression, and if it is included, what is the form of its inclusion? And the difference between His saying: <<وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ>> (and your hands up to the elbows) and His saying: <<أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ>> (complete the fast until the night).\n\nThis is a definition (حد) by a specific word that necessitates, in one instance, the exclusion of the definition from the defined (المحدود), and in another, the inclusion of the definition within the defined. This depends upon the knowledge of what the definition is in itself, for the definition has a definition, and this does not lead to an infinite regress (لا يتسلسل). And therein is the knowledge (علم) of covenants (العهود) and trusts (الأمانات), and what the trusts are, and what the covenants and contracts (العقود) are that we have been commanded with, and whether the Divine Covenant (العهد الإلهي) holds the same ruling as the covenant of the creature (عهد المخلوق) or not.\n\nAnd therein is the knowledge of the distinction (الفضل) between inherited wealth (المال الموروث) and earned wealth (المكتسب), and by which of the two types of wealth the owner experiences greater pleasure. This is a knowledge of taste (علم ذوق) and varies according to the difference in temperament (المزاج). For there are those who are naturally inclined to laziness, and inherited wealth is sweeter to them because they exerted no effort for it. And among people are the People of Spiritual Openings (أهل الفتوح), and among people are those who are naturally inclined to leadership, who find pleasure in earned wealth that they do not find in inherited wealth, due to the effort involved in demonstrating their capacity through the means of acquisition.\n\nAnd therein is the knowledge of the dependence of effects (المسببات) upon their causes (أسبابها): is this dependence essential (ذاتي) or volitional (اختياري) from God? And therein is the knowledge of transformations (الاستحالات) from one state (حال) to another. Do the Fixed Entities (الأعيان) follow those states, transforming from one entity to another, or is the Entity one, and the transformations occur only in the states? The doctrines (المذاهب) regarding this are diverse, so where does the Truth (الحق) lie among them?\n\nAnd therein is the knowledge of the Maker’s (الصانع) preservation of His making (صنعته): is His preservation for the making itself or for the essence of the thing made (عين المصنوع)? For the making may be acquired by the Maker, such as the craft of tailoring and other things that are only achieved through learning. And the making may be innate (بالفطرة), not through reflection, such as the making of animals like bees and spiders, all of which are by Divine Ordainment (بالجعل). And the making may be essential (ذاتية), such as the attribution of making to God. And what is the meaning of His saying, despite this: <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ>> (He governs the affair, detailing the signs), where He attributes governance (التدبير) to Himself?\n\nAnd therein is the knowledge of the wisdom behind what is established (يثبت) among the affairs in the Cosmos (الكون) and what is not established. And the Prophet, peace and blessings be upon him, gave an example of this concerning what he brought, using the analogy of rain and lands, regarding those whom God benefited by what he brought and those whom He did not benefit.\n\nAnd therein is the knowledge of the existence of the higher (الأعلى) from the lower (الأدنى), such as in meanings: the existence of our knowledge of God derived from the existence of our knowledge of ourselves. And therein is the knowledge of the ruling (الحكم) that viceregency (النيابة) in an affair grants to the deputy (النائب). And therein is the knowledge of knowing a thing by what comes *from* it, not by what it *is*.\n\nAnd in this chapter is the naming of a thing by the name of another thing if it is adjacent to it, or if it originates from it by a cause, or if it contains it. And therein is the knowledge of what the Unity (التوحيد) required of the knower (العالم) is. And therein is the knowledge of virtues (الفضائل) to the extent that envy (الحسد) occurs concerning them: are they virtues in themselves, or are they so by customary ruling (حكم العرف) and convention (الوضع)?\n\nAnd therein is the knowledge of that by which everything subsists (يبقى), in detail and difference. For not everything that protects from one thing is a protection from another thing. And what is the comprehensive principle (الأمر الجامع) for all protection? And therein is the knowledge of the benefit of the existence of multiple examples (الأمثال), even when the first example suffices.\n\nAnd therein is the knowledge of the veils (الحجب) that intervene between people and the knowledge of things. And therein is the knowledge of him who takes ignorance (الجهل) as knowledge: does he find certainty (القطع) within himself regarding it, or does his soul shake him concerning that, such that when he verifies the contemplation within himself, he finds the difference between what conforms to knowledge and what does not conform to it? This applies only to ignorance specifically. As for conjecture (الظن) and doubt (الشك), their ruling is not this ruling, for the conjecturer knows by his conjecture, and the doubter knows by his doubt. But the ignorant person may not know his ignorance, for whoever knows his ignorance possesses a knowledge that can be described.\n\nAnd therein is the knowledge of the wisdom of Divine Support (التأييد): is it Providence (عناية) or the establishment of proof (إقامة حجة), or is it Providence in one instance and the establishment of proof in another, considering the state of two individuals? And therein is the knowledge of what is attributed to the knower (العالم) of a thing that his knowledge of it does not necessitate, yet he attributes it to himself, such as the hope (الترجي) of the knower regarding the occurrence or non-occurrence of what he hopes for. So, how does hope relate to knowledge?\n\nAnd therein is the knowledge of the wisdom of him who performs the best action (الأحسن) while not being certain of its fruit: does this relate to his knowledge of the ignorance of the one to whom he showed kindness (أحسن إليه) regarding the degree of that kindness, or does it relate to himself because he does not know whether he fulfilled the right of kindness therein?\n\nAnd therein is the knowledge of the wisdom of the continuation of torment (العذاب) and harm (الضر) upon those afflicted by pain: is this in the manner of mercy (الرحمة) toward them or not? And therein is the knowledge of him who uses a matter for something other than what it was designated for, or only uses it for what it was designated for, when it has many contradictory aspects. What is it that departs from the ruling of what it is intended for, such as illness, which has an aspect leading to patience (الصبر) and an aspect leading to distress (الضجر)?\n\nAnd therein is the knowledge of whether the remembrance of the forgetful person benefits him or not. And therein is the knowledge of the truthful person (الصادق) being called a liar (كاذبا). And therein is the knowledge of seeking refuge (الاستعاذة), what refuge is sought *by*, and what refuge is sought *from*, where it is praised, and in what place it is blamed.\n\nAnd therein is the knowledge of what confession (الاعتراف) is beneficial and what is not, for circumstances (المواطن) have a ruling regarding confession, and states (الأحوال) also have a ruling concerning it. For among people are those who confess to error while remaining upon it, and among people are those from whom the error departs.\n\nAnd therein is the knowledge of the nobility of the Divine Address (الخطاب) and the existence of pleasure (الالتذاذ) in it. And therein is the knowledge of the wisdom of the existence of doubt (الشك) in the knower (العالم). And therein is the knowledge of the salvation of the diligent seeker (المجتهد), whether he erred or was correct, along with the fulfillment of what God granted him of that. And God <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (says the Truth, and He guides to the Way).",
    "ur": "باب تین سو اکسٹھ: تقدیر میں ذات حق (الحق) کے ساتھ اشتراک کے مقام کی معرفت میں، اور یہ مقام حقیقت محمدیہ (الحقیقۃ المحمدیۃ) سے ہے۔\n\nاگر کائنات میں اللہ کے سوا کوئی اور ہوتا، تو وہ نہ پاتے\nنہ کوئی فاعل ہوتا اور نہ کوئی مفعول۔\n\nلیکن وہ کائنات میں یکتا اور منفرد ہے\nایجاد میں اور سلطنتوں کی تبدیلی میں۔\n\nاور نہ ہی کوئی تخلیق عدم کی طرف لوٹتی ہے\nاور نہ ہی اس کا وجود کجی سے سیدھا ہوتا ہے۔\n\nپس ان سلطنتوں کو دیکھو جن کے اندر قومیں ہیں\nاور ان قوموں کو دیکھو جو فرقوں سے ظاہر ہوتی ہیں۔\n\nاور میں ان کے ذریعے ایک فلک پر چڑھتا ہوں جس کے اوپر دوسرا فلک ہے\nہلال سے لے کر زحل تک کے ارادے پر۔\n\nاسے ایک فرشتہ سدرۃ المنتہیٰ سے لایا ہے\nجو پردوں میں امر کی انتہا کو پہنچ چکی ہے۔\n\nاور اس چیز سے مت پکارو جس سے فرقوں نے پکارا ہے\nاے امر کے مبداء، بلکہ اے علتوں کی علت!\n\nکیونکہ یہ ایک ایسا لقب ہے جس کی علامات نے\nایک فقر دیا ہے جو دیگر علتوں کی طرح اس کے ساتھ قائم ہے۔\n\n### [ذات حق (الحق) کے جلال میں مستغرق ملائکہ]\n\nجان لو، اللہ تمہیں اپنی روح سے تائید بخشے، کہ اللہ عزوجل ابلیس سے فرماتا ہے: \"تجھ کو کس چیز نے روکا کہ تو اسے سجدہ کرے جسے میں نے اپنے ہاتھوں سے بنایا؟\" (قَالَ مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ) یہ آدم علیہ السلام کے لیے تشریف اور اختصاص کی جہت سے تھا۔ \"کیا تو نے تکبر کیا؟\" (أَسْتَكْبَرْتَ) یہ تمہاری نظر میں تھا۔ اور ایسا ہی تھا، کیونکہ اللہ نے اس کے بارے میں خبر دی کہ اس نے تکبر کیا اور ہماری عزت والی کتاب میں ہمارے لیے فرمایا کہ ابلیس نے کہا: \"میں اس سے بہتر ہوں، تو نے مجھے آگ سے پیدا کیا اور اسے مٹی سے پیدا کیا\" (أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ وَخَلَقْتَهُ مِنْ طِينٍ)۔ اور جب اسے سجدہ کرنے کو کہا گیا تو اس نے کہا: \"کیا میں اسے سجدہ کروں جسے تو نے مٹی سے پیدا کیا؟\" (أَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا)۔ پس یہ ہمارے قول کا معنی ہے کہ \"تمہاری نظر میں\" (أَمْ كُنْتَ مِنَ الْعَالِينَ) یعنی نفس الامر میں تم اس سے بہتر ہو۔ یہاں ابلیس کی جہالت ظاہر ہوئی۔ اور عالین سے مراد وہ ملائکہ مہیمہ (الملائكة المهيمة) ہو سکتے ہیں جو ذات حق (الحق) کے جلال میں مستغرق ہیں اور جو سجدے کے حکم کے تحت نہیں آئے، اور وہ ارواح ہیں، فرشتے نہیں ہیں۔ کیونکہ فرشتے ان ارواح کے رسول ہیں، جیسے جبریل علیہ السلام اور ان جیسے دیگر۔ عربی زبان میں \"الالوکہ\" رسالت کو کہتے ہیں۔ پس ملائکہ خاص طور پر ان ارواح کے رسول ہیں۔ چنانچہ کوئی فرشتہ باقی نہ رہا مگر اس نے سجدہ کیا، کیونکہ وہی تھے جن سے اللہ نے فرمایا: \"آدم کو سجدہ کرو\" (اسْجُدُوا لِآدَمَ)۔ اور ارواح مہیمہ (الأرواح المهيمة) ان لوگوں میں شامل نہیں تھیں جنہیں سجدے کا خطاب کیا گیا، کیونکہ اللہ نے یہ ذکر نہیں کیا کہ اس نے فرشتوں کے سوا کسی کو خطاب کیا ہو۔ اسی لیے فرمایا: \"تو سب فرشتوں نے سجدہ کیا\" (فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ)۔ اور ابلیس کو استثناء منقطع (نہ کہ متصل) کے طور پر نصب کیا گیا۔ اور یہ ارواح مہیمہ (الأرواح المهيمة) جو ذات حق (الحق) کے جلال میں مستغرق ہیں، اللہ کے ساتھ مشغولیت کی وجہ سے نہیں جانتیں کہ اللہ نے آدم کو پیدا کیا یا کسی اور چیز کو۔ اللہ ابلیس سے فرماتا ہے: \"یا تم عالین میں سے تھے؟\" (أَمْ كُنْتَ مِنَ الْعَالِينَ) یعنی ان لوگوں میں سے جن کا ہم نے ذکر کیا، پس تمہیں سجدے کا حکم نہیں دیا گیا۔ اور سجدہ زبان میں جھکنے کو کہتے ہیں، کیونکہ آدم کو مٹی سے پیدا کیا گیا جو ارکان میں سب سے نیچے ہے، اس سے نیچے کچھ نہیں۔ اور یہیں سے دائرے کے نقطے کی اس کے محیط پر فضیلت معلوم ہوتی ہے، کیونکہ نقطہ محیط کے وجود کی اصل ہے۔ پس عالین کو سجدے کا حکم نہیں دیا گیا کیونکہ اللہ نے ہمیں ان کے بارے میں کوئی تعارف نہیں کرایا۔ اور اگر اللہ ابلیس کے انکار کا ذکر نہ کرتا تو ہم نہ جانتے کہ اسے سجدے کا حکم دیا گیا تھا۔ اللہ نے آدم کو اپنے ہاتھوں کی طرف صرف دوسروں پر تشریف اور تنویہ کی جہت سے منسوب کیا تاکہ تم اللہ کے نزدیک اس کے مرتبے کو جانو۔ پھر اس نے ہاتھوں سے پیدا کرنے کے ذریعے اس کی تشریف میں اضافہ کیا، اور یہ اس کا قول ہے جو حیوانی انسانوں کو کامل انسانوں (الأناسي المكملين) کے کمال سے متعارف کراتا ہے: \"کیا انہوں نے نہیں دیکھا؟\" (أَوَلَمْ يَرَوْا)۔ \"یروا\" میں ضمیر حیوانی انسانوں کی طرف لوٹتی ہے۔ \"کہ ہم نے ان کے لیے پیدا کیا\" (أَنَّا خَلَقْنَا لَهُمْ) یعنی ان کی خاطر۔ پس \"لہم\" میں ضمیر کامل لوگوں کی طرف لوٹتی ہے جو الٰہی خطاب کے ذریعے عالم سے مقصود ہیں۔ \"اس میں سے جو ہمارے ہاتھوں نے بنایا\" (مِمَّا عَمِلَتْ أَيْدِينَا)۔ پس اس نے خلق کے عمل کو الٰہی ہاتھوں کی طرف منسوب کیا اور \"أیدینا\" میں نون کے ذریعے الٰہی اسماء کو عام کیا، اور یہ اس تشریف کی تکمیل کے لیے ہے جو آدم علیہ السلام کو ان کے خلق کو اپنے ہاتھوں کی طرف منسوب کرنے سے حاصل ہوا، یعنی \"چوپائے\" (أَنْعَامًا) اور یہ ان پر اس کے انعام میں سے ہے۔\n\nپس وہ ان کے لیے ہیں جو کائنات کے لیے ہیں، تو انہوں نے انہیں اللہ کے تملیک سے ملکیت میں لیا۔ برخلاف حیوانی انسان کے، جو اپنے نزدیک خود ہی ان کا مالک بن جاتا ہے، اللہ کے اس انعام سے غافل ہو کر۔ پس حیوانی انسان مخلوقات میں تبعیت کے حکم سے تصرف کرتا ہے، اور انسان کامل (الإنسان الکامل) ان میں الٰہی تملیک کے حکم سے تصرف کرتا ہے۔ پس اس کا تصرف اللہ کے ہاتھ سے اور اللہ کے مال سے ہوتا ہے جو اس نے اسے دیا، جیسا کہ اللہ تعالیٰ نے غلاموں کے حق میں حکم دیتے ہوئے فرمایا: \"اور انہیں اللہ کے مال میں سے دو جو اس نے تمہیں دیا ہے\" (وَآتُوهُمْ مِنْ مَالِ اللَّهِ الَّذِي آتَاكُمْ)۔ پس عالم میں ہر مخلوق کی تخلیق ایک الٰہی ہاتھ کی طرف منسوب ہے، کیونکہ اس نے فرمایا: \"اس میں سے جو ہمارے ہاتھوں نے بنایا\" (مِمَّا عَمِلَتْ أَيْدِينَا)۔ پس اس نے جمع کا صیغہ استعمال کیا۔ پس عالم میں ہر خالق ہاتھ اس کا ہاتھ ہے، جو ملک اور تصرف کا ہاتھ ہے۔ پس ساری مخلوق اللہ کے لیے ہے: \"خبردار! اسی کے لیے ہے خلق اور امر\" (أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ)۔ اور یہ بھی وارد ہے کہ شجرہ طوبیٰ کو اللہ نے اپنے ہاتھ سے لگایا اور جنت عدن کو اپنے ہاتھ سے پیدا کیا۔ پس اس نے ہاتھ کو واحد بھی رکھا، تثنیہ بھی کیا اور جمع بھی کیا۔ اور اس نے اسے تثنیہ صرف آدم علیہ السلام کی تخلیق میں کیا، جو انسان کامل (الإنسان الکامل) ہیں۔ اور اس میں کوئی شک نہیں کہ تثنیہ جمع اور افراد کے درمیان برزخ ہے، بلکہ یہ جمع کا پہلا درجہ ہے۔ اور تثنیہ اپنی ذات سے دونوں اطراف کا مقابلہ کرتی ہے، پس اس کے لیے کمال کا درجہ ہے، کیونکہ مفرد اس کے بغیر جمع تک نہیں پہنچ سکتا، اور جمع اس کے بغیر مفرد کو نہیں دیکھ سکتا۔ پس انسان کامل (الإنسان الکامل) کے ذریعے صورت کا کمال ظاہر ہوا، پس وہ عالم کے جسم کا قلب ہے، جو اللہ کے سوا ہر چیز کا اظہار ہے، اور یہ ذات حق (الحق) سے معمور گھر ہے جب اس نے اسے سمو لیا۔\n\nاللہ تعالیٰ مروی حدیث میں فرماتا ہے: \"نہ میری زمین میں گنجائش ہوئی اور نہ میرے آسمان میں، لیکن میرے مومن بندے کے دل میں میری گنجائش ہو گئی\" (مَا وَسِعَنِي أَرْضٌ وَلَا سَمَائِي وَوَسِعَنِي قَلْبُ عَبْدِي الْمُؤْمِنُ)۔\n\nپس انسان کامل (الإنسان الکامل) کا مرتبہ، اس حیثیت سے کہ وہ قلب ہے، اللہ اور عالم کے درمیان ہے۔ اور اسے قلب اس لیے کہا گیا کہ وہ ہر صورت میں پلٹتا رہتا ہے: \"ہر دن وہ ایک نئی شان میں ہے\" (كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ)۔ اور اس کے تصرف اور تقلیب و تصریف میں وسعت کی وجہ سے۔ اور اسی لیے اسے یہ الٰہی وسعت حاصل ہوئی، کیونکہ اس نے اپنی ذات کو ہر دن ایک نئی شان میں ہونے سے موصوف کیا۔ اور یہاں \"یوم\" ہر چیز میں فردِ زمانہ ہے۔ پس وہ شانوں میں ہے، اور عالم میں تمام تصریفات اور تقلیبات ان شانوں کے سوا کچھ نہیں جن میں ذات حق (الحق) ہے۔ اور اللہ کی طرف سے یا اس کے رسول کی طرف سے کسی مخلوق کے بارے میں یہ نص وارد نہیں ہوئی کہ اسے \"کن\" (ہو جا) کا اختیار دیا گیا ہو، سوائے خاص انسان کے۔\n\nپس یہ ایک وقت نبی اکرم صلی اللہ علیہ وسلم میں غزوہ تبوک کے موقع پر ظاہر ہوا، جب آپ نے فرمایا: \"ابوذر ہو جاؤ\" تو وہ ابوذر ہو گئے۔\n\nاور اہل جنت کے بارے میں خبر وارد ہوئی ہے کہ فرشتہ ان کے پاس آتا ہے اور ان پر داخل ہونے کی اجازت لینے کے بعد ان سے کہتا ہے، پھر جب وہ داخل ہوتا ہے تو انہیں اللہ کی طرف سے ایک کتاب دیتا ہے، اللہ کی طرف سے ان پر سلام کرنے کے بعد۔ پس اس کتاب میں ہر انسان کے لیے خطاب ہوتا ہے: \"حی القیوم جو نہیں مرتا، کی طرف سے حی القیوم جو نہیں مرتا، کی طرف۔ اما بعد: میں جب کسی چیز کو کہتا ہوں 'ہو جا' (كُنْ) تو وہ ہو جاتی ہے (فَيَكُونُ)، اور میں نے تمہیں یہ اختیار دیا ہے کہ تم کسی چیز کو کہو 'ہو جا' تو وہ ہو جائے\" (كُنْ فَيَكُونُ)۔ پس نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"اہل جنت میں سے کوئی شخص کسی چیز کو 'ہو جا' نہیں کہے گا مگر وہ ہو جائے گی\"۔\n\nپس وہ ایک ایسی چیز لایا جو منکر ترین منکرات میں سے ہے، پس وہ عام ہو گیا۔ اور طبیعت کی انتہا اجسام کی تخلیق ہے اور وہ چیزیں جو وہ اٹھاتی ہے جن سے وہ خالی نہیں ہوتی اور جن کا وہ طبعاً تقاضا کرتی ہے۔ اور اس میں کوئی شک نہیں کہ اجسام عالم کا ایک حصہ ہیں، پس ان کے لیے عموم نہیں ہے۔ اور نفس کی انتہا طبعی نشوونما میں جزوی ارواح کی تخلیق ہے، اور ارواح عالم کا ایک حصہ ہیں، پس اس میں بھی عموم نہیں ہے۔ پس عموم صرف انسان کامل (الإنسان الکامل) کو دیا گیا جو سرِ الٰہی کا حامل ہے۔ پس اللہ کے سوا ہر چیز انسان کے کل کا ایک جزو ہے۔ پس اگر تم عقل رکھتے ہو تو عقل کرو، اور اللہ کے سوا ہر چیز میں غور کرو اور اس میں بھی جس سے ذات حق (الحق) نے اسے موصوف کیا ہے، اور وہ اس کا قول ہے: \"اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے\" (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)۔ اور اس نے سب کو سجدے سے موصوف کیا، لیکن ان میں سے کسی ایک کے لیے بھی عالم میں نہ کوئی امر (حکم) بنایا، نہ نہی (ممانعت)، نہ خلافت، اور نہ ہی عمومی تخلیق۔ اور یہ سب انسان کامل (الإنسان الکامل) کے لیے بنایا۔ پس جو شخص اپنا کمال جاننا چاہے، اسے اپنے نفس میں اپنے امر، نہی اور تخلیق میں بغیر زبان، کسی عضو یا کسی دوسری مخلوق کے واسطے کے دیکھنا چاہیے۔ پس اگر اس کے لیے اس میں معنی صحیح ہو جائے، تو وہ اپنے کمال میں \"اپنے رب کی طرف سے روشن دلیل پر ہے\" (عَلَى بَيِّنَةٍ مِنْ رَبِّهِ)۔ کیونکہ اس کے پاس اس کی طرف سے یعنی اس کے نفس کی طرف سے گواہ ہے، اور وہ وہی ہے جو ہم نے ذکر کیا۔ پس اگر وہ امر کرے یا نہی کرے یا اپنے کسی عضو کے واسطے سے تخلیق شروع کرے اور ان میں سے کوئی چیز واقع نہ ہو، یا کسی چیز میں واقع ہو اور کسی میں نہ ہو، اور واسطے کو ترک کرنے کے ساتھ اس کا عموم نہ ہو، تو وہ کامل ہو چکا ہے۔ اور اس کے کمال میں وہ چیز نقص پیدا نہیں کرتی جو اس کے امر سے واسطے کے ساتھ وجود میں نہ آئے۔ کیونکہ الٰہی صورت اسی طرح وجود میں ظاہر ہوئی ہے۔ پس اللہ تعالیٰ نے اپنے بندوں کو اپنے رسولوں کی زبانوں پر اور اپنی کتابوں میں حکم دیا، تو ان میں سے بعض نے اطاعت کی اور بعض نے نافرمانی کی۔ اور واسطوں کے اٹھ جانے سے صرف اطاعت کا راستہ باقی رہتا ہے، خاص طور پر انکار ممکن نہیں ہوتا اور نہ ہی صحیح ہوتا ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"اللہ کا ہاتھ جماعت کے ساتھ ہے\" (يَدُ اللَّهِ مَعَ الْجَمَاعَةِ)۔\n\nاور اس کی قدرت نافذ ہے۔ اور اسی لیے جب انسان اپنے نفس میں یکجا ہو جاتا ہے یہاں تک کہ وہ ایک چیز بن جاتا ہے، تو اس کی ہمت اس چیز میں نافذ ہو جاتی ہے جو وہ چاہتا ہے۔ اور یہ ایک ایسا ذوق ہے جس پر تمام اہل اللہ کا اجماع ہے۔ کیونکہ اللہ کا ہاتھ جماعت کے ساتھ ہے، پس مجموعے کے ذریعے ہی عالم ظاہر ہوا، اور اعیان (حقائق) اس کے سوا کچھ نہیں۔ اللہ تعالیٰ کے اس قول میں غور کرو: \"تین آدمیوں کی کوئی سرگوشی نہیں ہوتی مگر وہ ان کا چوتھا ہوتا ہے\" (مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ)۔ پھر فرمایا: \"اور نہ اس سے کم\" (وَلَا أَدْنَى مِنْ ذَلِكَ) جو تین سے کم ہیں، \"اور نہ اس سے زیادہ\" (وَلَا أَكْثَرَ) جو تین سے زیادہ ہیں، لامتناہی عدد تک، \"مگر وہ ان کے ساتھ ہوتا ہے جہاں کہیں بھی وہ ہوں\" (إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا)۔ وجود میں ہوں یا عدم میں، جہاں بھی انہیں فرض کیا جائے۔ پس وہ سبحانہ و تعالیٰ واحد کا ثانی ہے۔ کیونکہ معیت (ساتھ ہونا) ایک کے لیے خود سے صحیح نہیں ہوتی، کیونکہ یہ صحبت کا تقاضا کرتی ہے اور کم از کم دو ہوتے ہیں۔ اور وہ دو کا تیسرا، تین کا چوتھا، اور چار کا پانچواں ہے، جہاں تک بھی پہنچے۔ اور جب معیت کو خلق کی طرف منسوب کیا جائے نہ کہ ذات حق (الحق) کی طرف، تو دوسرے کی معیت دو کا دوسرا ہے، اور تیسرے کی معیت دو کا تیسرا ہے، اور چوتھے کی معیت تین کا چوتھا ہے، جہاں تک بھی پہنچے، کیونکہ وہ مخلوقیت میں اس چیز کا عین ہے جس کے ساتھ وہ ہے، پس وہ اس کی جنس سے ہے۔ اور ذات حق (الحق) ایسا نہیں ہے، پس \"اس جیسا کوئی نہیں\" (لَيْسَ كَمِثْلِهِ شَيْءٌ)۔ پس وہ نہ تین کا تیسرا ہے اور نہ پانچ کا پانچواں۔ پس سمجھو۔ پس ذات حق (الحق) ایک پہلو سے خلق سے ممتاز ہو گیا، اور ایک پہلو سے اپنی صورت میں بھی ظاہر ہوا۔\n\n### [طبیعت (الطبیعۃ) نفس کلیہ (النفس الکلیۃ) کا سایہ ہے جسے لوح محفوظ (اللوح المحفوظ) سے تعبیر کیا جاتا ہے]\n\nاور جان لو کہ طبیعت (الطبیعۃ) نفس کلیہ (النفس الکلیۃ) کا سایہ ہے جو دو قوتوں سے موصوف ہے اور جسے شرعی زبان میں لوح محفوظ (اللوح المحفوظ) سے تعبیر کیا جاتا ہے۔ پس جو چیز نفس کے سائے سے نہیں پھیلی اور اس میں باقی رہی، وہ وہی ہے جسے اس نے عقل سے نورانیت اور روشنی کے درجے میں اتارا۔ اور جو چیز نفس کے سائے سے پھیل گئی، اسے طبیعت (الطبیعۃ) کہا گیا۔ اور اس سائے کا پھیلاؤ ہیولیٰ کل (الہيولى الكل) کی ذات پر ہوا، پس ہیولیٰ اور طبیعت کے جوہر سے جسم کل (الجسم الكل) تاریک ظاہر ہوا۔ اور اسی لیے انہوں نے اسے اس طبعی تاریکی کی وجہ سے کالی سبجہ (سیاہ موتیوں کی مالا) سے تشبیہ دی، اور نفس کو سبز زمرد کہا جب وہ نور میں عقل سے اترا۔ اور جسم کل میں عالم اجسام کی صورتیں اور شکلیں ظاہر ہوئیں، پس یہ جسم کل کے لیے اعضاء کی مانند تھا۔ پھر جب جسم اس چیز کے لیے تیار ہو گیا جس کے لیے وہ تیار ہوا تھا، تو نفس اس کی طرف متوجہ ہوا اور اسے روشن کر دیا، پس زندگی اس کے تمام اعضاء میں پھیل گئی۔ پس وہ علوی اور سفلی عالم اجسام کی ارواح ہیں، فلک اور عنصر سے۔ پھر زمانی حرکت کے حکم کے اثر سے، جسے اسم الدھر نے افلاک میں متعین کیا، بعض نے بعض کی طرف تبدیلی اختیار کی۔ پس آنکھ کے لیے فلکی مولدات کی صورتیں ظاہر ہوئیں، جیسے ستارے، باغات (جنات)، ان کا مرتبہ اور جو کچھ ان میں ہے، اور عنصری مولدات، جیسے معدن، نباتات اور حیوانات، اور وجودی عین میں عجیب و غریب صورتیں اور حیرت انگیز شکلیں۔ پس عدم سے کوئی چیز نہیں نکلی مگر صورتیں اور اعراض، ترکیب اور تحلیل سے۔ اور جوہر (الجوہر) ثابت العین ہے، جو ان تمام صورتوں کو قبول کرنے والا ہے، دنیا اور آخرت میں۔ اور جب تم یہ جان لو اور یہ بات پختہ ہو جائے، تو جان لو کہ اللہ تعالیٰ کا قول: \"وہ امر کی تدبیر کرتا ہے، وہ آیات کو تفصیل سے بیان کرتا ہے\" (يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ)۔ اس سے مراد تقدیر اور ایجاد ہے۔ پس تدبیر تقدیر کے لیے ہے، اور تفصیل ایجاد کے لیے ہے، جیسے جب تم کسی چیز کو کسی چیز سے کاٹ کر اور اس کے درمیان فرق کر کے ممتاز کر دو تو تم نے اسے \"فصلت\" (تفصیل دی)۔ پس اگر فصل تقدیر کے مطابق ہو، تو وہ اپنی صورت اور شکل پر ہوتا ہے، اور اگر بغیر تقدیر کے ہو، تو ہو سکتا ہے کہ وہ اپنی صورت پر نہ ہو، اگرچہ وہ کسی معاملے میں اس سے مشابہت رکھتا ہو، لیکن وہ کسی دوسرے معاملے میں اس سے جدا ہو جاتا ہے، جیسے سفیدی اور سیاہی رنگت میں شریک ہیں، اگرچہ وہ متضاد ہیں، اور جیسے رنگ اور حرکت عرضیت میں شریک ہیں، اگرچہ وہ مختلف ہیں۔ شاعر نے کہا:\n\nاور تم ہی ہو جو تخلیق کرتے ہو اور پھر اسے کاٹتے ہو\nاور بعض لوگ تخلیق کرتے ہیں مگر پھر کاٹتے نہیں۔\n\nاور جیسے موچی اور اس جیسے سنار، درزی اور لوہار وغیرہ۔ وہ چمڑے سے جوتا کاٹنا چاہتا ہے، تو وہ ایک جوتا لیتا ہے اور اسے چمڑے پر ناپتا ہے۔ پھر جب وہ چمڑے سے اس کا اندازہ لے لیتا ہے، تو وہ اس مقدار کو چمڑے سے کاٹ کر الگ کر دیتا ہے۔ اور سائے اللہ نے اشخاص کی مثال پر پیدا کیے، اور جب اس نے انہیں الگ کرنا چاہا تو انہیں پھیلا دیا، پس ان کے اعیان اس کی صورت پر ظاہر ہوئے جس کا وہ سایہ ہے، بالکل جوتے کے جوتے پر آنے کی طرح۔ پس جب اللہ نے عالم کو انسان کے بغیر، یعنی اس کے مجموعے کے بغیر، پیدا کیا، تو اس نے اس کی صورت کو پورے عالم کی صورت پر ناپا۔ پس عالم میں کوئی جزو نہیں مگر وہ انسان کی صورت پر ہے۔ اور عالم سے مراد اللہ کے سوا ہر چیز ہے۔ پس اس نے اسے عالم سے الگ کیا جب اس نے اس کی تدبیر کر لی، اور وہ عین امر مدبر ہے۔ پھر اس نے اسے معنوی طور پر الٰہی اسماء کی حضرۃ (حضور) پر ناپا، پس اس میں ان کا ظہور دیکھنے والے کے لیے آئینے میں صورتوں کے ظہور کی طرح ہوا۔ پھر اس نے اسے الٰہی اسماء کی حضرۃ سے الگ کیا جب اس کی قوتیں اس میں حاصل ہو گئیں، پس وہ اس کے ذریعے اس کی روح اور باطن میں ظاہر ہوئیں۔ پس انسان کا ظاہر خلق ہے اور اس کا باطن ذات حق (الحق) ہے۔ اور یہی مطلوب انسان کامل (الإنسان الکامل) ہے۔ اور اس کے علاوہ جو ہے وہ حیوانی انسان ہے۔ اور انسان کامل (الإنسان الکامل) کے مقابلے میں حیوانی انسان کا مرتبہ وہی ہے جو حیوانی انسان سے نسناس (بندر نما مخلوق) کی تخلیق کا ہے۔ یہ انسان کامل (الإنسان الکامل) کی تخلیق کا خلاصہ ہے بغیر تفصیل کے۔ اور جہاں تک اس کی تخلیق کی تفصیل کا تعلق ہے، تو جان لو کہ جب اللہ نے چار ارکان کو فلک کے بغیر پیدا کیا اور انہیں فلک کی شکل پر گھمایا، اور یہ سب جسم کل (الجسم الكل) میں شکلیں ہیں، تو پہلی فلکی حرکت کا اثر اس کے بعد والے ارکان میں ظاہر ہوا، اور وہ آگ ہے۔ پس اس نے ہوا میں موجود رطوبت کے ساتھ اس میں شعلہ پیدا کیا۔ پس وہ شعلہ اور لپٹ آگ اور ہوا سے تھی، اور وہ \"مارج\" (مختلط) ہے، اور اسی سے مرج (چراگاہ) کو مرج کہا گیا کیونکہ اس میں پھولوں اور نباتات کے اخلاط ہوتے ہیں۔ اور اسی سے لوگوں میں \"ہرج\" (قتل) اور \"مرج\" (اختلاط) واقع ہوا۔ پس اللہ نے اس شعلے میں جن کو کھول دیا۔ پھر روشن ستاروں نے اللہ کے حکم اور اذن سے فیضان کیا، کیونکہ اس نے \"ہر آسمان میں اس کا امر وحی کیا\" (أَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا)۔ پس انہوں نے اپنی شعاعیں ارکان پر ڈالیں، اور ارکان شعاعوں کے گرنے کی جگہیں ہیں۔ پس ارکان انوار سے ظاہر ہوئے اور چمک اٹھے اور روشن ہو گئے، پس انہوں نے اثر کیا اور ان میں معدن، نباتات اور حیوانات کو جنم دیا۔ اور وہ حقیقت میں وہی ہیں جنہوں نے خود میں اثر کیا، کیونکہ افلاک، یعنی آسمانوں کو اللہ نے ارکان سے ہی وجود بخشا، پھر انہوں نے اپنی حرکات اور اپنے ستاروں کی شعاعیں ڈالنے سے ارکان میں اثر کیا تاکہ ان میں مولدات پیدا ہوں۔ پس ان کا مال انہیں واپس کر دیا گیا، پس ان میں ان کے سوا کسی نے اثر نہیں کیا۔ اور اس نے اسے قیامت کی نشانیوں میں سے قرار دیا، کیونکہ اس کی نشانیوں میں سے یہ ہے کہ عورت اپنے شوہر کو جنم دے۔ پس ارکان نے فلک کو جنم دیا، پھر فلک نے ان سے نکاح کیا، پس اس نے ان میں وہ چیزیں پیدا کیں جو پیدا ہوئیں، پس وہ اس کا بیٹا اور اس کا شوہر ہے۔ اور ارکان میں انسان کی صورت ظاہر نہیں ہوئی جو عالم کے وجود سے مطلوب ہے۔ پس اس نے لیس دار مٹی لی اور اسے پانی سے ملایا، پس اسے اپنے ہاتھوں سے گارا بنا دیا، جیسا کہ اس کے جلال کے لائق ہے، کیونکہ \"اس جیسا کوئی نہیں\" (لَيْسَ كَمِثْلِهِ شَيْءٌ)۔ اور اسے ایک مدت کے لیے چھوڑ دیا تاکہ وہ اس گرم ہوا سے خمیر ہو جائے جو اس کے گارے کے اجزاء میں سرایت کرتی ہے، پس وہ خمیر ہو گیا اور اس کی بو بدل گئی، پس وہ بدبودار سڑی ہوئی کیچڑ (حَمَإٍ مَسْنُونٍ) بن گیا۔ اور جو شخص اس کی سچائی دیکھنا چاہے، اگر اس کے ایمان میں کوئی خلل ہو، تو وہ اپنے بازو کو اپنے بازو سے زور سے رگڑے، یہاں تک کہ وہ اپنے بازو کی جلد سے حرارت محسوس کرے، پھر اسے سونگھے، تو اسے اس کیچڑ کی بو ملے گی جو اس کی اصل ہے جس سے جسم پیدا کیا گیا۔ اللہ تعالیٰ نے فرمایا: \"اس نے انسان کو بجنے والی مٹی سے پیدا کیا\" (خَلَقَ الْإِنْسَانَ مِنْ صَلْصَالٍ) اور \"سڑی ہوئی کیچڑ سے\" (وَمِنْ حَمَإٍ مَسْنُونٍ)۔ پس جب انسان کا ٹھیکرا آگ کے رکن کے پکانے سے پاک ہو گیا اور اس کے اجزاء مل گئے اور وہ مضبوط اور سخت ہو گیا، تو اس نے اسے پانی سے، جو حیات کا عنصر ہے، مختصر کر دیا، پس پانی نے اسے اپنی رطوبت دی اور اس سے فخار کی سختی کو نرم کر دیا، پس اس میں زندگی سرایت کر گئی، اور ہوائی رکن نے اسے اپنی رطوبت اور حرارت سے مدد دی تاکہ اس کی حرارت پانی کی ٹھنڈک کا مقابلہ کرے، پس دونوں رک گئے، تو رطوبت اس پر غالب آ گئی، پس اس نے اس کے گارے کے جوہر کو گوشت، خون، پٹھوں، رگوں، اعصاب اور ہڈیوں میں بدل دیا۔ اور یہ سب مختلف مزاج ہیں، عناصر کی طبیعت کے آثار اور اس نشوونما کے اجزاء کی تیاریوں کے اختلاف کی وجہ سے۔ اسی لیے اس حیوانی نشوونما کے اعیان مختلف ہو گئے، پس ان کے نام مختلف ہو گئے تاکہ ہر عین دوسرے سے ممتاز ہو جائے۔ اور اس نشوونما کی غذا اسی چیز سے بنائی گئی جس سے اسے پیدا کیا گیا، اور غذا نباتات کے وجود کا سبب ہے اور اسی سے وہ بڑھتا ہے۔ پس اس نے اس کے بڑھنے اور اس میں اضافے کے ظاہر ہونے کو اپنے اس قول سے تعبیر کیا: \"اور اللہ نے تمہیں زمین سے نباتات کی طرح اگایا\" (وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا)۔ اور اس کا معنی ہے: پس تم نباتات کی طرح اگے۔ کیونکہ \"أنبت\" کا مصدر \"إنبات\" ہے۔ پس اس نے نباتات کو اس چیز کی طرف منسوب کیا جو بڑھتی ہے۔ وہ کہتا ہے: تمہاری غذا اس میں سے بنائی، یعنی اس چیز میں سے جسے وہ اگاتا ہے، پس تم اس کے ذریعے اگتے ہو، یعنی تمہارے اجسام بڑھتے اور زیادہ ہوتے ہیں۔ پس جب اس نے جسمانی، نباتاتی، حیوانی نشوونما کو مکمل کر دیا اور اس میں حیوان کی تمام قوتیں ظاہر ہو گئیں، تو اس نے اسے نفس عملیہ کی قوت سے فکر عطا کی، اور اسے یہ چیز اسم الٰہی المدبر سے نفس علمیہ کی قوت سے عطا کی۔ کیونکہ حیوان جو کچھ بھی صنعتیں کرتا ہے اور جو کچھ جانتا ہے، وہ تدبیر یا غور و فکر سے نہیں ہوتا، بلکہ وہ اس علم پر فطرت میں پیدا کیا گیا ہے جو اس سے صادر ہوتا ہے، وہ نہیں جانتا کہ اسے وہ اتقان اور استحکام کہاں سے حاصل ہوا، جیسے مکڑیاں، شہد کی مکھیاں اور بھڑیں۔ برخلاف انسان کے، جو جانتا ہے کہ اس نے کوئی بھی امر فکر، غور و فکر اور تدبیر کے بغیر نہیں نکالا، پس وہ جانتا ہے کہ یہ امر کہاں سے صادر ہوا۔ اور اسی قدر کی وجہ سے اسے انسان کہا گیا، اور بس۔ اور یہ ایک ایسی حالت ہے جس میں تمام لوگ شریک ہیں، سوائے انسان کامل (الإنسان الکامل) کے۔ کیونکہ وہ دنیا میں حیوانی انسان سے اس الٰہی اسماء کے تصرف میں بڑھ گیا جن کی قوتیں اس نے اس وقت حاصل کیں جب ذات حق (الحق) نے اسے عالم پر ناپا۔ پس اس نے انسان کامل (الإنسان الکامل) کو انسان کل کبیر کا خلیفہ بنایا، جو اس کی مخلوق میں اللہ کا سایہ ہے۔ پس وہ اس کا خلیفہ ہے۔ اور اسی لیے وہ ایک ہی مستخلف (جس نے خلیفہ بنایا) کے خلفاء ہیں، پس وہ ان الٰہی انوار کے سائے ہیں جو انسان اصلی کے مقابل ہوتے ہیں۔ اور وہ ظہور الٰہی (التجلی) کے انوار ہیں جو ہر طرف سے اس پر مختلف ہوتے ہیں، پس اس کے لیے ظہور الٰہی (التجلی) کی تعداد کے مطابق متعدد سائے ظاہر ہوتے ہیں۔ پس ہر ظہور الٰہی (التجلی) میں ایک نور ہوتا ہے جو عنصری وجود میں انسان کی صورت کا ایک سایہ دیتا ہے، پس وہ سایہ خلیفہ ہوتا ہے، پس اس سے خاص طور پر خلفاء وجود میں آتے ہیں۔ اور جہاں تک حیوانی انسان کا تعلق ہے، تو وہ مجموعی طور پر اس کی اصل نہیں ہے، بلکہ اس کا حکم دوسرے حیوانات کا حکم ہے، سوائے اس کے کہ وہ اپنے مقوم فصل کے ذریعے دوسرے حیوانات سے ممتاز ہوتا ہے، جیسا کہ حیوانات کا بعض بعض سے اپنے مقوم فصول کے ذریعے ممتاز ہوتا ہے، کیونکہ گھوڑا اپنے مقوم فصل کے لحاظ سے گدھا نہیں ہے، اور نہ خچر، نہ پرندہ، نہ درندہ، اور نہ کیڑا۔ پس حیوانی انسان حشرات کے مجموعے میں سے ہے۔ پس جب وہ کامل ہو جاتا ہے، تو وہ خلیفہ ہوتا ہے۔ پس ہم بعض معانی میں جمع ہوئے اور بعض معانی میں جدا ہوئے۔\n\n### [بے شک اللہ نے اسے خلافت کا حکم اور خلیفہ کا نام عطا کیا]\n\nپھر اللہ نے اسے خلافت کا حکم اور خلیفہ کا نام عطا کیا، اور یہ دونوں مؤنث الفاظ ہیں کیونکہ ان سے تخلیق کا ظہور ہوتا ہے، اور مؤنث تخلیق کا محل ہے۔ پس یہ نام میں ایک تنبیہ ہے۔ اور اس نے اس کے لیے \"نائب\" کا لفظ استعمال نہیں کیا، اگرچہ معنی وہی ہے، بلکہ فرمایا: \"میں زمین میں ایک خلیفہ بنانے والا ہوں\" (إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً)۔ اور اس نے نہ \"انسان\" کہا اور نہ \"داعی\"، بلکہ اسے اس چیز سے یاد کیا اور نام دیا جو اس نے اس کے لیے وجود میں لائی۔ اور ہم نے حیوانی انسان اور انسان کامل (الإنسان الکامل) خلیفہ کے درمیان فرق اس لیے کیا کہ اللہ تعالیٰ کا قول ہے: \"اے انسان! تجھے تیرے رب کریم نے کس چیز سے دھوکے میں ڈالا؟ جس نے تجھے پیدا کیا، پھر تجھے درست کیا، پھر تجھے معتدل کیا\" (يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ)۔ پس یہ عنصری، طبعی انسانی نشوونما کا کمال ہے۔ پھر اس کے بعد اس سے فرمایا: \"جس صورت میں چاہا تجھے جوڑ دیا\" (فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ)۔ اگر چاہے تو کمال کی صورت میں، پس تجھے عالم میں اپنا خلیفہ بنا دے، یا حیوانی صورت میں، پس تو اپنے مقوم فصل کے ذریعے حیوانات کے مجموعے میں شامل ہو جائے، جو صرف اسی کے لیے ہوتا ہے جس پر انسان کا نام بولا جاتا ہے۔ اور انسان کی نشوونما کے علاوہ کسی اور میں کبھی بھی تسویہ (درست کرنا) اور تعدیل (معتدل کرنا) کا ذکر نہیں کیا گیا، اگرچہ یہ آیا ہے: \"جس نے پیدا کیا پھر درست کیا\" (الَّذِي خَلَقَ فَسَوَّى)۔ تو اس سے مراد انسان کی تخلیق ہو سکتی ہے، کیونکہ تسویہ اور تعدیل ایک ساتھ صرف انسان کے لیے ہوتے ہیں، کیونکہ اس نے اسے عالم کی صورت پر درست کیا اور اس پر معتدل کیا، اور یہ عناصر کی دوسری مخلوقات کے لیے نہیں تھا۔ پھر تسویہ اور تعدیل کے بعد اس سے فرمایا: \"ہو جا\" (كُنْ)، اور یہ ایک الٰہی نفس ہے۔ پس انسان کامل (الإنسان الکامل) تسویہ، تعدیل، روح پھونکنے اور \"کن\" کے قول سے ظاہر ہوا۔ اور یہ اس کا قول ہے: \"بے شک عیسیٰ کی مثال اللہ کے نزدیک آدم کی مثال جیسی ہے، اسے مٹی سے پیدا کیا، پھر اسے کہا 'ہو جا' (كُنْ)\" (إِنَّ مَثَلَ عِيسَى عِنْدَ اللَّهِ كَمَثَلِ آدَمَ خَلَقَهُ مِنْ تُرَابٍ ثُمَّ قَالَ لَهُ كُنْ)۔ پس اس نے کامل، یعنی عیسیٰ علیہ السلام کو کامل، یعنی آدم علیہ السلام سے تشبیہ دی، خلیفہ کو خلیفہ سے۔ اور خلفاء کے علاوہ کو صرف \"درست کیا\" (سَوَّاهُ) اور \"اس میں اپنی روح پھونکی\" (وَنَفَخَ فِيهِ مِنْ رُوحِهِ)۔ اور اس کے بارے میں یہ نہیں فرمایا کہ اس نے اسے \"کن\" کہا، سوائے اس جامع آیت کے: \"ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا قول صرف یہ ہوتا ہے کہ ہم اسے کہیں 'ہو جا' (كُنْ)\" (إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ)۔ پس جو کچھ میں نے تمہیں تنبیہ کی ہے اس پر دھیان دو۔ پس وہ اس کمال کے مرتبے سے کم ہو گیا جو اللہ نے لوگوں میں خلفاء کو عطا کیا۔ اور جب اللہ نے فلک اطلس، جو فلک البروج ہے، اور وہ اس کا قول ہے: \"آسمان کی قسم جس میں برج ہیں\" (وَالسَّمَاءِ ذَاتِ الْبُرُوجِ)، کو بارہ حصوں میں تقسیم کیا اور اللہ تعالیٰ نے آسمان البروج میں اس کا امر وحی کیا، پس ہر برج میں ایک امر ہے جو اسے دوسرے بروج سے ممتاز کرتا ہے۔ اور اللہ نے ان بروج کے لیے اس آسمان سے نیچے عالم ترکیب میں اللہ کے وحی کردہ امر کا ایک اثر بنایا۔ اور انسان اپنے جسم اور طبیعت کے لحاظ سے عالم ترکیب میں سے ہے، اور وہ طبیعت کے مکھن کا خلاصہ ہے جو افلاک کی حرکت سے ظاہر ہوا۔ پس وہ وہ مکھن ہے جس سے زیادہ لطیف دودھ میں کچھ نہیں ہوتا، بلکہ وہ دودھ کی روح ہے، جب وہ اس سے نکل جائے تو باقی عالم بھوسی کی طرح رہ جاتا ہے۔ پس وہ اس میں ہے، مگر اس میں نہیں ہے، کیونکہ وہ قوت کے لحاظ سے اس سے ممتاز ہے، اور وہ اس سے ہے۔ کیونکہ انسان عالم سے باہر نہیں نکلا، اگرچہ وہ عالم کے مکھن کا خلاصہ ہے، کیونکہ اگر وہ اس سے الگ ہو جاتا تو عالم کی کوئی قیمت نہ رہتی، جیسے دودھ جب اس سے مکھن نکل جاتا ہے تو وہ بدل جاتا ہے، اس کی قیمت کم ہو جاتی ہے، اور اس کی وہ خیر ختم ہو جاتی ہے جو اس سے مطلوب تھی۔ اور اسی مکھن کی وجہ سے دودھ استعمال کیا جاتا تھا اور اس کی قدر و منزلت بڑھ جاتی تھی۔ پس جب اللہ نے یہ فیصلہ کیا کہ ان بروج کا اس عالم میں اثر ہو جو اس آسمان کے احاطے کے نیچے ہے، تو اللہ نے اس انسان کی نشوونما میں بارہ قبول کرنے والے (قابلا) بنائے جن کے ذریعے وہ ان آثار کو قبول کرتا ہے، پس انسان کامل (الإنسان الکامل) ان کے ذریعے ظاہر ہوتا ہے۔ اور یہ حیوانی انسان کے لیے نہیں ہے، اگرچہ وہ دوسرے حیوانات کے مقابلے میں ان آثار کو قبول کرنے میں زیادہ مکمل ہے، لیکن انسان کامل (الإنسان الکامل) کے قبول کے مقابلے میں وہ ناقص ہے۔ پس ان بارہ میں سے ایک اس کا عالم کے ساتھ چمٹ جانا ہے جب اسے اس پر ناپا گیا، اور اس کا الٰہی اسماء کی حضرۃ کے ساتھ چمٹ جانا ہے۔ اور اسی سے اس نفس کے لیے کمال صحیح ہوا۔ اور یہ مجاورت تین مراتب پر ہے: ان میں سے ایک اختصاص کا مرتبہ ہے، اور وہ حیوانی انسان میں اس حیثیت سے ہے کہ وہ عالم کے حقائق کو حاصل کرنے والا ہے، اور کامل میں بھی ایسا ہی ہے، اور اس چیز کے ساتھ جو اسے الٰہی اسماء سے خاص ہوئی جب وہ اس پر الٰہی اعتناء کے ناپ کے مطابق ہونے کے حکم سے جاری ہوئے، اور اس کے سایہ ہونے کی وجہ سے، اور سایہ سے زیادہ کوئی چیز اس سے چمٹی ہوئی نہیں ہوتی جس کا وہ سایہ ہے۔ اور مجاورت کا دوسرا مرتبہ دونوں امور کے درمیان ربط قائم کرنے والی شیئیت کا مرتبہ ہے، اور وہ وہ آلات ہیں جن کے ذریعے انسان سے وہ چیز ظاہر ہوتی ہے جو اس سے تخلیق ہوتی ہے۔ پس حیوانی انسان کامل کے ساتھ ان صنعتی آلات میں شریک ہوتا ہے جن کے ذریعے وہ کسی مصنوع تک پہنچتا ہے جو ہاتھوں سے کیا جاتا ہے۔ اور کامل اس پر ہمت کے ذریعے فعل میں اضافہ کرتا ہے۔ پس اس کے آلات اس کی ہمت ہے، اور وہ اس کے لیے الٰہی ارادے کے مقام پر ہے، جب وہ کسی چیز کے وجود پر متوجہ ہوتا ہے تو اس مطلوبہ چیز کا نہ ہونا محال ہے۔ اور تیسرا مرتبہ ذات حق (الحق) کے ساتھ اتصال ہے، پس وہ اس اتصال سے اپنے نفس سے فنا (فناء) ہو جاتا ہے، پس ذات حق (الحق) ظاہر ہوتا ہے یہاں تک کہ وہ اس کا کان اور اس کی آنکھ بن جاتا ہے۔ اور اسے علم الذوق کہا جاتا ہے، کیونکہ ذات حق (الحق) ان آلات میں سے کوئی چیز نہیں بنتا یہاں تک کہ وہ اس کے وجود سے جل جائیں، پس وہ ہو، نہ کہ وہ آلات۔ اور ہم نے اس کا ذوق چکھا ہے اور میں نے اللہ کا ذکر اللہ کے ذریعے کرتے ہوئے جلنے کو حسی طور پر پایا، پس وہ تھا اور میں نہیں تھا۔ پس میں نے اپنی زبان میں جلن محسوس کی اور اس جلن سے حسی، حیوانی تکلیف محسوس کی، کیونکہ عضو میں حسی جلن واقع ہوئی۔ پس میں اس حالت میں چھ گھنٹے یا اس کے قریب اللہ کا ذکر اللہ کے ذریعے کر رہا تھا، پھر اللہ نے میری زبان کو دوبارہ اگایا، پس میں نے اس کا ذکر اس کے ساتھ حضور کے ساتھ کیا، نہ کہ اس کے ذریعے۔ اور اسی طرح تمام قوتیں، ذات حق (الحق) ان میں سے کوئی چیز نہیں بنتا یہاں تک کہ اس کا وجود اس قوت کو جلا دے، خواہ وہ کوئی بھی قوت ہو، اور یہ اس کا قول ہے: \"میں اس کا کان اور اس کی آنکھ بن جاتا ہوں\" (كُنْتُ سَمْعَهُ وَبَصَرَهُ)۔\n\nاور جس نے اپنی قوتوں میں جلن کا مشاہدہ نہ کیا اور اسے محسوس نہ کیا، تو اس کے لیے کوئی ذوق (ذوق) نہیں ہے، بلکہ یہ اس کا وہم ہے۔ اور یہ اس کے قول کا معنی ہے الٰہی پردوں کے بارے میں: \"اگر وہ انہیں کھول دے تو اس کے چہرے کی سبحات (نور کی شعاعیں) ہر چیز کو جلا دیں گی\"۔ پس ذات حق (الحق) اپنے بندے کی جس قوت کو جلانا چاہتا ہے تاکہ اسے ذوق (ذوق) کے ذریعے امر کا علم حاصل ہو، تو وہ اس قوت کے لحاظ سے انسان اور ذات حق (الحق) کے درمیان کے حجاب کو اٹھا دیتا ہے، پس وہ چہرے کے نور سے جل جاتی ہے، پس وہ خود اس قوت کے خلل کو دور کر دیتا ہے۔ پس اگر وہ اس کا کان تھا، تو اس حالت میں ذات حق (الحق) اس کا کان تھا، اور اگر اس کی آنکھ تھی تو اسی طرح، اور اگر اس کی زبان تھی تو اسی طرح۔ اور اس معنی میں ہمارا شعر ہے:\n\nخبردار! بے شک اللہ کا ذکر اللہ کے ذریعے جلن پیدا کرتا ہے\nاور اس میں میرا حکم ایک یقینی حکم ہے۔\n\nپس میں، واردات کے رب کی قسم، میں نے اسے چکھا ہے\nپس میرا حکم اس پر یہ ہے کہ وہ ذات حق (الحق) ہے جو سچ کہتا ہے۔\n\nذات حق (الحق) نے صحیح حدیث میں فرمایا: \"میں اس کا کان اور اس کی آنکھ بن جاتا ہوں\" (كُنْتُ سَمْعَهُ وَبَصَرَهُ)۔\n\nپس اس نے اپنی کینونت کو ایک خاص وصف سے موصوف بندے کا کان بنا دیا، اور یہ اللہ کی طرف سے بندے کے ساتھ سب سے بڑا اتصال ہے، جہاں وہ اس کی قوتوں میں سے ایک قوت کو زائل کر دیتا ہے اور اس کی جگہ اپنی کینونت کے ساتھ بندے میں قائم ہو جاتا ہے، اس طرح جو اس کے جلال کے لائق ہو، بغیر کسی تشبیہ، تکییف، حصر، احاطہ، حلول یا بدلیت کے۔ اور امر وہی ہے جو ہم نے کہا، \"اور ہم نے گواہی نہیں دی مگر اسی کی جو ہم نے جانا\" (وَمَا شَهِدْنَا إِلَّا بِمَا عَلِمْنَا)۔ \"اور ہم غیب کے نگہبان نہیں تھے\" (وَمَا كُنَّا لِلْغَيْبِ حَافِظِينَ)۔ \"اور بستی والوں سے پوچھو\" (وَاسْأَلِ الْقَرْيَةَ) یعنی اس جماعت سے \"جس میں ہم تھے\" (الَّتِي كُنَّا فِيهَا) یعنی اہل اللہ میں سے وہ بندگان خدا جو اس طریقے سے موصوف ہیں، جنہوں نے نفلی خیرات پر عمل کیا اور ان پر مداومت کی اور ان کے ذریعے اللہ کی طرف متوجہ ہوئے۔ اور اللہ ہمیں اعتقاد، قول اور عمل میں عصمت کے ساتھ تائید بخشے، بے شک وہ رحمت کا ولی ہے۔ بارہ آثار میں سے دوسرا اثر یہ ہے کہ دو لغوی مماثلتوں کے لیے یہ لازم نہیں کہ ان میں سے ہر ایک کو اپنے مماثل کے لیے مماثلت سے موصوف کرنے سے نفس کی صفات میں اشتراک ہو۔ کیونکہ مماثلت لغوی اور عقلی ہوتی ہے۔ پس عقلی وہ ہے جس میں نفس کی صفات میں اشتراک ہوتا ہے، اور لغوی وہ ہے جو کسی امر میں ادنیٰ شبہ سے ہوتی ہے، پس وہ اس امر میں اس کے لیے مثال ہوتا ہے، پس مثال کے لیے اس کے مثل کا حکم ہوتا ہے جس حیثیت سے وہ وہ اس میں اس کا مثل ہے اور اس کے لیے قابل ہے۔ اور انسان کامل (الإنسان الکامل) بندے اور ذات حق (الحق) کے درمیان \"اس جیسا کوئی نہیں\" (لَيْسَ كَمِثْلِهِ شَيْءٌ) میں صرف یہ ہے کہ وہ تمام الٰہی اسماء کو قبول کرتا ہے جو ہمارے ہاتھوں میں ہیں، اور اسی سے اس کی خلافت صحیح ہوئی اور وہ فرشتوں پر فضیلت لے گیا۔ پس خلیفہ اگر ان لوگوں میں ظاہر نہ ہو جن پر وہ خلیفہ ہے، اس کے احکام اور اس کی صورت کے ساتھ جس نے اسے خلیفہ بنایا ہے، تو وہ اس کا خلیفہ نہیں ہے۔ جیسا کہ خلیفہ نے جسے خلیفہ بنایا ہے، اسے اپنے مال اور تمام احوال میں اپنا وکیل بنا کر خلیفہ بنایا ہے۔ پس وہ اس چیز میں جس میں ذات حق (الحق) نے اسے خلیفہ بنایا ہے، مستخلف علیہ میں اپنے وکیل کی نظر کے بغیر تصرف نہیں کرتا۔ پس وہ مستخلف (خلیفہ بنانے والا) کے ذریعے مستخلف (خلیفہ) ہے۔ پس بندے کا اپنے رب کو وکیل بنانا مطلق خلافت اور تفویض شدہ، دوری وکالت ہے۔ اور رب کا اپنے بندے کو خلیفہ بنانا ایک مقید خلافت ہے، جو اس کی ذات اور نشوونما کے تقاضے کے مطابق ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم سفر کے دوران اپنے رب عزوجل سے فرماتے تھے: \"تو ہی سفر میں ساتھی ہے اور اہل میں خلیفہ ہے\" (أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الْأَهْلِ)۔\n\nپس اس نے اسے خلیفہ نام دیا۔ اور اللہ تعالیٰ نے ہر معلوم چیز کی قسم کھائی ہے، موجود ہو یا معدوم، پس فرمایا: \"پس میں قسم کھاتا ہوں ان چیزوں کی جنہیں تم دیکھتے ہو اور ان کی جنہیں تم نہیں دیکھتے\" (فَلَا أُقْسِمُ بِمَا تُبْصِرُونَ وَمَا لَا تُبْصِرُونَ)۔ پس اس نے اپنی ذات کی اور تمام معلومات کی قسم کھائی۔ تو کیا ہمارے لیے جائز ہے کہ ہم اس چیز کی قسم کھائیں جس کی اللہ تعالیٰ نے قسم کھائی ہے، یا یہ ہم پر ممنوع ہے؟ اگر یہ ہم پر ممنوع ہو، تو ہم ان چیزوں میں خلیفہ نہیں ہوں گے جو ہم پر ممنوع ہیں۔ اور جس چیز کی قسم کھائی جاتی ہے، اس کی قسم مضاف یا مفرد طور پر کھائی جا سکتی ہے۔ پس مفرد جیسے: \"واللہ میں ایسا کروں گا\"۔ اور مضاف جیسے عائشہ رضی اللہ عنہا کا اپنی قسم میں قول: \"ورب محمد\" (محمد کے رب کی قسم)۔ پس قسم کے ذکر میں مضاف، مضاف الیہ میں داخل ہو گیا۔ پس اس حد پر انسان کامل (الإنسان الکامل) ہر معلوم چیز کی قسم کھاتا ہے، خواہ وہ نام کا ذکر کرے یا نہ کرے۔ اور یہ اللہ کے اشیاء کی قسم کھانے کے بعض تاویلات میں سے ہے، جیسے اس کا قول: \"سورج کی قسم اور اس کی روشنی کی قسم، اور رات کی قسم، اور انجیر کی قسم\" (وَالشَّمْسِ وَالضُّحَى وَاللَّيْلِ وَالتِّينِ)۔ اس سے مراد ہے: اور سورج کے رب کی قسم، اور روشنی کے رب کی قسم، اور انجیر کے رب کی قسم۔ پس اس نے اپنی ذات کے سوا کسی کی قسم نہیں کھائی۔ پس اللہ کے سوا کوئی قسم نہیں، اور اس کے علاوہ تمام قسمیں ساقط ہیں، جن سے مقسوم علیہ پر کوئی قسم منعقد نہیں ہوتی۔ اور اسی لیے اللہ تعالیٰ نے فرمایا: \"اللہ تمہیں تمہاری لغو قسموں پر نہیں پکڑے گا\" (لَا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ)۔ اور لغو ساقط کو کہتے ہیں۔ پس اس کا معنی ہے: اللہ تمہیں ان قسموں پر نہیں پکڑے گا جن میں اس نے کفارہ ساقط کر دیا ہے اگر تم حانث ہو جاؤ۔ \"لیکن وہ تمہیں ان قسموں پر پکڑے گا جنہیں تم نے پختہ کیا\" (وَلَكِنْ يُؤَاخِذُكُمْ بِمَا عَقَّدْتُمُ الْأَيْمَانَ)۔ پس جب قسم کے وقت دل سے عقد ساقط ہو گیا، تو حنث واقع ہونے پر کفارہ ساقط ہو گیا۔ اور علماء کے درمیان کوئی اختلاف نہیں ہے کہ قرآن میں مذکور قسموں میں کفارہ صرف اللہ کی قسم میں ہے، نہ کہ کسی اور کی۔ اور اس نے قسموں کو اضافت اور الف لام کے ساتھ معرفہ لایا۔ اور نبی اکرم صلی اللہ علیہ وسلم سے اللہ کے سوا کسی اور کی قسم کھانے کی ممانعت صحیح ثابت ہے۔\n\nپس خلیفہ کے لیے ضروری ہے کہ وہ اس کی مرضی کے ساتھ ہو جس نے اسے خلیفہ بنایا ہے، اس چیز میں جس میں اسے خلیفہ بنایا گیا ہے۔ کیونکہ اللہ فرماتا ہے: \"اور اللہ اپنے امر پر غالب ہے\" (وَاللَّهُ غَالِبٌ عَلَى أَمْرِهِ)۔ اور \"صورت\" کبھی زبان میں \"امر\" اور \"شان\" کے معنی میں ہوتی ہے۔ پس اس کا قول: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا\" (إِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ)۔ یعنی اپنے امر اور اپنی شان پر۔ پس اللہ اپنے امر پر غالب ہے، یعنی اس پر جسے اس نے اپنی صورت، یعنی اپنے امر سے ظاہر کیا۔ پس اسے اس میں معزول کرنے کا حکم حاصل ہے، اس کی نشوونما کے باقی رہنے کے باوجود۔ پس یہ تمہیں اس بات پر دلالت کرتا ہے کہ اس نے صورت سے نشوونما مراد نہیں لی، بلکہ امر اور حکم مراد لیا ہے۔ پس عالم علم کے طریقوں اور اشیاء میں اللہ کے ارادے سے انحراف نہیں کرتا۔ اور یہ امر خاص طور پر جوزا (Gemini) کے آثار میں سے ہے، اور وہ ایک ہوائی برج ہے۔ پس یہ امر نبی اکرم صلی اللہ علیہ وسلم کے اس قول کے مطابق ہوا: \"بے شک رب عماء (گھنے بادل) میں تھا\" (إِنَّ الرَّبَّ كَانَ فِي عَمَاءٍ)۔ جو مد اور ہمزہ کے ساتھ ہے، اور وہ باریک بادل ہے، جس کے اوپر ہوا ہے اور اس کے نیچے ہوا ہے۔ پس اس نے اس عماء سے ہوا کے احاطے کی نفی کی، اور ہوا کی نفی کا ذکر نہیں کیا۔ پس امر اللہ کے لیے ہے، پس عماء کی نسبت اس کی طرف ہوا کی نسبت سے زیادہ اولیٰ نہیں ہے۔ پس اس عماء سے ہوائی احاطے کی نفی میں مجموعے کی نفی ضروری ہے، نہ کہ سب کی۔ اور ہم نے نفس رحمانی میں عماء اور جوزا کی حدیث کو پانی اور مٹی کے درمیان بیان کیا ہے، کیونکہ وہ ثور (Taurus) اور سرطان (Cancer) کے درمیان ہے، جیسے آدم پانی اور مٹی کے درمیان ہیں۔ اور اسی لیے ہوا کا حکم دوسرے ارکان سے زیادہ عام ہے، کیونکہ وہ ہر چیز میں سرایت کرتی ہے، اور ہر چیز میں اس کا تسلط ہے، پس وہ زمین کو ہلا دیتی ہے، پانی کو موج دیتی ہے اور اسے بہاتی ہے، اور آگ کو بھڑکاتی ہے، اور ہر سانس لینے والے نفس کی زندگی اسی سے ہے، اور درختوں میں پیداوار اسی سے ہے، اور وہ ہوائیں ہیں جو بار آور کرتی ہیں۔ پس یہ بارہ اقسام میں سے دوسرا اثر ہے۔ اور جہاں تک تیسرے اثر کا تعلق ہے، تو وہ وہ ہے جو عالم میں ظاہر ہوتا ہے جس سے استغناء ممکن ہے، اور وہ استغناء کے باوجود اس لیے ظاہر ہوا تاکہ دو کی قوت کا مرتبہ ظاہر ہو، تاکہ یہ نہ کہا جائے کہ وجود میں اللہ کے سوا کچھ نہیں ہے، ممکنات اور مخلوقات کے ظاہر ہونے کے باوجود۔ پس یہ معلوم ہو جائے کہ \"بے شک اللہ عالمین سے بے نیاز ہے\" (فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ)، عالمین کے وجود کے باوجود۔ اور اس سے استغناء معقول ہے۔ پس عالم میں یہ امر آیا جس سے اس کے وجود کے باوجود استغناء ممکن ہے، تاکہ ذات حق (الحق) کی عالم سے بے نیازی بیان ہو جائے۔ پس اللہ نے اسے عالم میں عبث نہیں بنایا۔ پس اس نے اپنے وجود کو استغناء کے باوجود یہ علم عطا کیا، اور یہ ایک نفع بخش علم ہے۔ اور اس کا ایک خاص نظام ہے جو اس چیز کے نظام سے مشابہت رکھتا ہے جس سے استغناء ممکن نہیں، جیسے نکاح سے اولاد کا وجود، حالانکہ اس سے استغناء ممکن ہے۔ ہماری دلیل جنت میں اہل جنت کا نکاح اور بانجھ کا نکاح ہے۔ اور جہاں تک چوتھے اثر کا تعلق ہے:\n\nتو وہ نبی اکرم صلی اللہ علیہ وسلم کا یہ قول ہے: \"قیامت قائم نہیں ہو گی اور زمین پر کوئی ایسا شخص ہو جو 'اللہ اللہ' کہتا ہو\" (لَا تَقُومُ السَّاعَةُ وَعَلَى وَجْهِ الْأَرْضِ مَنْ يَقُولُ اللَّهُ اللَّهُ)۔\n\nپس آپ نے اسے دو بار لایا اور ایک پر اکتفا نہیں کیا، اور اس سے یہ ثابت کیا کہ یہ ذکر تنہائی میں ہے اور اسے کسی چیز سے موصوف نہیں کیا گیا۔ اور اسم کی ہاء کو ساکن کیا گیا، اور یہ اللہ تعالیٰ کے اس قول کی تفسیر ہے: \"اللہ کا ذکر کثرت سے کرو\" (اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا)، اور یہ اسی اسم کا تکرار ہے۔ اور اس کا قول: \"اور اللہ کا ذکر سب سے بڑا ہے\" (وَلَذِكْرُ اللَّهِ أَكْبَرُ)۔ اور اس نے صرف اسم \"اللہ\" کا خاص طور پر ذکر کیا، حالانکہ اسے اللہ کی طرف سے حکم دیا گیا ہے کہ وہ لوگوں کے لیے اس چیز کو بیان کرے جو ان پر نازل کی گئی ہے۔ پس اگر انسان کا \"اللہ اللہ\" کہنا اس عالم کی حفاظت نہ کرتا جس میں یہ ذکر ہوتا ہے، تو اس کے زوال کے ساتھ اس کائنات کا زوال نہ ہوتا جس سے وہ زائل ہوا ہے، اور وہ دنیا ہے۔ اور یہ اسم ہمارا اور ہمارے شیخ کا ذکر تھا جن کے پاس ہم داخل ہوئے، اور اذکار کے فوائد میں اس کے فائدے سے بڑھ کر کوئی فائدہ نہیں۔ پس جب ذات حق (الحق) نے فرمایا: \"اور اللہ کا ذکر سب سے بڑا ہے\" (وَلَذِكْرُ اللَّهِ أَكْبَرُ)، اور الٰہی اسماء کے کثرت سے اذکار کے باوجود کسی دوسرے ذکر کی صورت کا ذکر نہیں کیا، تو اہل اللہ نے اسے اکیلا ذکر بنا لیا، پس اس نے ان کے دلوں میں ایک عظیم امر پیدا کیا جو دوسرے اذکار نے پیدا نہیں کیا۔ کیونکہ بعض رسمی علماء نے اس ذکر کو اس میں فائدہ کے فقدان کی وجہ سے نہیں دیکھا، کیونکہ ہر مبتدا کے لیے خبر ضروری ہے۔ تو انہیں کہا جائے گا کہ یہ لفظ میں ضروری نہیں، بلکہ اس کے لیے فائدہ ضروری ہے، اور وہ ذاکر میں ظاہر ہوا جب اس نے خاص طور پر اس کلمے سے ذکر کیا، پس اس کے باطن میں نورِ کشف (الکشف) سے وہ چیز پیدا ہوئی جو دوسرے اذکار پیدا نہیں کرتے۔ بلکہ اس کی ایک ظاہری خبر ہے، نہ کہ لفظ میں، جیسے تنزیہ کی طرف اضافت یا فعل کے ذریعے ثناء۔ اور یہ معلوم ہے کہ جب کسی امر کا ذکر کیا جائے، پھر کسی امر کا ذکر کیا جائے اور اسے تاکید کے طریقے پر دہرایا جائے، تو وہ ایسا فائدہ دیتا ہے جو وہ نہیں دیتا جس کے لیے یہ حکم نہیں ہے اور نہ ہی اس کا قصد کیا گیا ہے۔ پس وہ امور کے طلب میں زیادہ تیز اور کامیاب ہے۔ پس عالم میں مجموعی طور پر کوئی عبث نہیں۔ اور جہاں تک پانچویں اثر کا تعلق ہے، تو وہ چوتھے سے مشابہت رکھتا ہے، جیسا کہ بروج میں حمل کا حصہ اسد اور قوس وغیرہ کے حصے سے مشابہت رکھتا ہے، اگرچہ یہ اس کا عین نہیں ہے، اور ان میں سے ہر ایک ایک ایسے امر میں منفرد ہے جو مماثلت کے باوجود دوسرے کے لیے نہیں ہوتا، حالانکہ وہ اس کے مثل پر ہے۔ اسی لیے آثار میں مشابہت واقع ہوئی، جیسا کہ اصل میں واقع ہوئی، اور وہ ہر وہ چیز ہے جو عالم میں واقع ہوئی اور اپنے ظہور کے علاوہ ایک صحیح معنی دیتی ہے۔ اور اگر وہ عالم سے ساقط ہو جاتی، تو وہ امر جس میں یہ معنی دیا گیا تھا، اس میں خلل نہ آتا، لیکن اس امر سے ضرور کمی واقع ہوتی جو اس کا وجود دیتا ہے۔ اور اسے عطیات کے عوارض کہا جاتا ہے، جن کا ساقط ہونا اور واقع نہ ہونا اس حقیقت میں خلل نہیں ڈالتا جس سے وہ معدوم ہوئے ہیں، اگرچہ ان کا کوئی معنی ہو، جیسے جماع کے بغیر جماع کی لذت کا وجود۔ پس وہ فائدہ حاصل ہو گیا جس کے لیے جماع تھا، لیکن جماع کے ذریعے حاصل ہونے کا ایک معنی ہے جو صرف جماع سے ہی حاصل ہوتا ہے، کیونکہ نکاح کا مقصد لذت حاصل کرنا اور لذت کا وجود ہے، اور وہ حاصل ہو گئی، پس جماع کے ساقط ہونے سے لذت میں خلل نہیں آیا۔ اور اسی لیے اللہ نے ہمیں حور عین سے نکاح کرایا۔ اور جہاں تک چھٹے اثر کا تعلق ہے، تو وہ صاحب ہمت سے متعلق ہے، جب وہ چاہتا ہے کہ اس سے وہ چیز تخلیق ہو جو عادت کے مطابق آلے کے بغیر واقع نہیں ہوتی، تو وہ اسے اپنی ہمت سے کرتا ہے، نہ کہ آلے سے۔ اور ایک وقت میں آلے سے۔ کیونکہ اللہ قادر ہے کہ آدم کو ابتداء میں بغیر خمیر کرنے، دو ہاتھوں کے متوجہ ہونے، تسویہ یا تعدیل کے، روح پھونکنے کے بغیر پیدا کر دے، بلکہ وہ اسے کہتا ہے: \"ہو جا\" (كُنْ) تو وہ ہو جاتا ہے (فَيَكُونُ)۔ اس کے باوجود اس نے اس کے گارے کو اپنے ہاتھوں سے خمیر کیا، اسے درست کیا اور معتدل کیا، پھر اس میں روح پھونکی اور اسے اسماء سکھائے، اور اشیاء کو ایک ترتیب پر وجود بخشا۔ جیسا کہ اگر وہ چاہتا تو ہمیں اس کے اسماء کے علم سے ہی اکتفا کرنے دیتا، لیکن اس نے اسے عالم میں رکھی گئی ہر زبان میں فلاں نام سے موسوم کیا، پس اسے عربی میں اللہ، فارسی میں خدائے، حبشی میں واق، اور ہر زبان میں اس کے اسماء ہیں، اس کے وجود کے علم کے ساتھ۔ اور اس نے اس کا فائدہ ظاہر کیا، اس چیز سے بے نیاز ہونے کے باوجود جو ظاہر ہوئی اور اکتفا کرنے کے باوجود۔ اور اسی باب سے وہ افعال ہیں جو ہم سے ظاہر ہوتے ہیں، حالانکہ یہ جائز ہے کہ اللہ انہیں ہمارے ہاتھوں کے بغیر بھی کر دے، لیکن مشاہدے میں یہ فعل ہمارے ہاتھوں کے بغیر نہیں پہنچا۔ پس اس نے جسم کو ایک جگہ سے دوسری جگہ منتقل کرنے کا ارادہ کیا، تو اس نے ہم میں انتقال کی طلب کا ارادہ پیدا کیا، پس ہم نے ایک اختیاری حرکت کی جو ہم اپنے نفوس سے سمجھتے ہیں اور منتقل ہو گئے۔ اور انتقال اصل میں اللہ کی تخلیق ہے، لیکن وہ ایک حادث، اختیاری ارادے سے وجود میں آیا، برخلاف کانپنے والے کی حرکت کے، جو اضطراری ہوتی ہے۔ پس مختار انسان، سلیم العقل کے نزدیک، اپنے اختیار میں مجبور ہے۔ پھر کوئی حقیقت ایسی نہیں جس کا حکم محل کے بغیر ظاہر ہو، پس وہ محل کے بغیر ظاہر نہیں ہوتی۔ پس وہ اس چیز میں فرق کرتا ہے جو جائز ہے اور جو جائز نہیں ہے۔ پس حرکت کا وجود متحرک کے بغیر محال ہے۔ اور اسی باب سے اس کا رات کے آخری تہائی حصے میں آسمان دنیا پر نزول ہے، حالانکہ وہ ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں۔ پس یہ نزول کا ایک حکم ہے جو ایک ایسے فعل سے ظاہر ہوا جس کا حصول اس نزول کے بغیر بھی ممکن تھا، لیکن جب تم اسے اللہ تعالیٰ کے قول: \"بے شک اللہ عالمین سے بے نیاز ہے\" (فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ) کی طرف منسوب کرتے ہو، تو یہ غنی کے مرتبے سے ایک لازمی نزول تھا۔ کیونکہ وہ اس نزول کو صرف ایک الٰہی نسبت کے لیے قبول کرتا ہے جو اس کی ذات کا تقاضا کرتی ہے، پس وہ نزول کے بغیر نہیں ہوا۔ پس سمجھو۔ کیونکہ اضافات کے لیے وہ ذاتی حکم ہوتا ہے جو غیر مضاف کے لیے نہیں ہوتا۔ اور حقائق تبدیل نہیں ہوتے۔ اور شان تو صرف ایک محکوم میں حکم کا ظاہر ہونا ہے۔ پس وہ ایک پہلو سے اس کی ذات کا تقاضا ہے اور ایک پہلو سے اس کی ذات کا تقاضا نہیں ہے، جیسے خالق خلق کا تقاضا کرتا ہے اور عالم معلوم کا تقاضا کرتا ہے۔ اور جہاں تک ساتویں اثر کا تعلق ہے، تو وہ کائنات میں ظرفیت (ظرفیت) کا وجود ہے، کیا وہ کائنات میں اصل ہے، پھر ہم نے اسے شرعی طور پر ذات حق (الحق) پر محمول کیا، یا وہ ذات حق (الحق) میں اس کے جلال کے لائق ہے اور عالم میں بالفعل ظاہر ہوئی؟\n\nجیسے رسول اللہ صلی اللہ علیہ وسلم کا سیاہ فام عورت سے کہنا: \"اللہ کہاں ہے؟\" تو اس نے آسمان کی طرف اشارہ کیا، حالانکہ وہ گونگی تھی۔\n\nاللہ تعالیٰ فرماتا ہے: \"اور اللہ ہر چیز کو جاننے والا ہے\" (وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ)۔ اور \"فعیل\" کا صیغہ فاعل اور مفعول دونوں کے معنی میں آتا ہے، جیسے \"قتیل\" (مقتول) اور \"جریح\" (زخمی)۔ پس \"علیم\" کا معنی \"عالم\" (جاننے والا) بھی ہے اور \"معلوم\" (جانا گیا) بھی ہے۔ اور یہ دونوں پہلو اس آیت میں جائز ہیں اگر \"بکل\" میں باء فاء کے معنی میں ہو، تو وہ ہر چیز میں معلوم ہے۔ اور \"اور ہر چیز پر محیط ہے\" (وَبِكُلِّ شَيْءٍ مُحِيطٌ) یعنی اس کے لیے ہر چیز پر احاطہ ہے، اس چیز کے ساتھ جو وہ معلوم ہے۔ اور یہ صرف اللہ کے لیے ہے یا اس کے لیے جسے اللہ نے علم دیا۔ اور جہاں تک آٹھویں اثر کا تعلق ہے، تو وہ اللہ تعالیٰ کا قول ہے: \"پس اس کے بارے میں کسی باخبر سے پوچھو\" (فَاسْأَلْ بِهِ خَبِيرًا)۔ یعنی جب تم کسی امر کی حقیقت کے بارے میں پوچھنا چاہو تو اس سے پوچھو جسے اس میں ذوق (ذوق) حاصل ہو، اور جسے اشیاء میں ذوق (ذوق) نہ ہو تو اس سے مت پوچھو، کیونکہ وہ تمہیں صرف اس چیز کے نام کے بارے میں بتائے گا جس کے بارے میں تم نے پوچھا ہے، نہ کہ اس کی حقیقت کے بارے میں۔ پس بندے سے اللہ کے بارے میں نہ پوچھا جائے، کیونکہ اسے الوہیت میں کوئی ذوق (ذوق) نہیں ہے اور نہ ہی اس کی کوئی خبر ہے۔ پس اس کے پاس اس کے صرف اسماء ہیں۔ پس اللہ سے اللہ کے بارے میں پوچھو، اور بندے سے عبودیت کے بارے میں پوچھو۔ پس بندے کے لیے عبودیت کی نسبت وہی ہے جو اللہ کے لیے الوہیت کی نسبت ہے۔ پس ذات حق (الحق) کا عبودیت کے بارے میں خبر دینا اس کے لیے خبر دینا ہے، اور بندے کا الوہیت کے بارے میں خبر دینا بندے کی خبر ہے۔ اور اسی لیے یہ وارد ہوا: \"جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا\" (مَنْ عَرَفَ نَفْسَهُ عَرَفَ رَبَّهُ)۔ پس وہ اپنے نفس کو معرفت (المعرفۃ) ذوق سے پہچانتا ہے، پس وہ اپنے نفس میں الوہیت کے لیے کوئی مدخل نہیں پاتا، پس وہ بالضرورت جانتا ہے کہ اگر اللہ اس سے مشابہ ہوتا یا اس کی مثال ہوتا تو وہ اسے اپنے نفس میں پہچان لیتا، اور وہ اپنی محتاجی سے جانتا ہے کہ کوئی ہے جس کی طرف وہ محتاج ہے اور جو اس سے مشابہ نہیں ہو سکتا۔ پس اس نے اپنے رب کو پہچانا کہ وہ اس جیسا نہیں ہے، اگرچہ اللہ نے اسے خلیفہ بنایا ہے اور اسے صورت پر وجود بخشا ہے، پس اس سے ڈرا جاتا ہے اور امید رکھی جاتی ہے، اس کی اطاعت کی جاتی ہے اور نافرمانی کی جاتی ہے۔ پس ہم نے اس باب کے ان آثار میں اس کا معنی بیان کر دیا ہے۔ اور جہاں تک نویں اثر کا تعلق ہے، تو وہ آسمانوں اور زمین کی تخلیق کے بارے میں اس کا قول ہے کہ اس نے انہیں صرف حق کے ساتھ پیدا کیا، یعنی اس نے انہیں صرف اپنی ذات کے لیے پیدا کیا، اس کی شان بلند ہو اور اس کا نام بابرکت ہو۔ کیونکہ اس نے فرمایا: \"اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے\" (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)۔ پس اس نے عالم کو صرف اپنی ذات کے لیے پیدا کیا۔ اور اسی لیے اس نے ان کے بارے میں فرمایا جن کے بارے میں اسے علم تھا کہ اس نے ان کی نشوونما میں عزت رکھی ہے، اور وہ جن اور انسان ہیں: \"اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں\" (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ)۔ یعنی وہ میرے سامنے عاجزی کریں، اس عزت اور الوہیت کے دعوے اور اپنے نفوس پر فخر کی وجہ سے جو ان میں ظاہر ہوئی۔ پس یہ اللہ کی طرف سے ان پر لطف ہے کہ وہ انہیں اس چیز پر متنبہ کرے جو اس نے انہیں پیدا کرنے میں ان سے ارادہ کیا۔ پس جو متنبہ ہوا وہ ان کثیر لوگوں میں سے تھا جو اللہ کو سجدہ کرتے ہیں، اور جو متنبہ نہ ہوا وہ ان کثیر لوگوں میں سے تھا جن پر عذاب واجب ہوا۔ اور جہاں تک اس آیت میں اس کے قول: \"اور میں نے جنوں اور انسانوں کو پیدا نہیں کیا\" (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ) کا تعلق ہے، تو اس سے مراد صرف انسان ہو سکتا ہے، اس حیثیت سے کہ اس کا ظاہر اور باطن ہے۔ پس جس حیثیت سے اس کا ظاہر ہے، وہ \"انس\" ہے، \"آنست الشیء\" سے، جب تم کسی چیز کو دیکھتے ہو۔ اللہ تعالیٰ موسیٰ کے حق میں خبر دیتے ہوئے فرماتا ہے: \"بے شک میں نے آگ دیکھی\" (إِنِّي آنَسْتُ نَارًا) یعنی میں نے دیکھا۔ اور جن انسان کا باطن ہے، کیونکہ وہ اس سے پوشیدہ ہے۔ پس گویا اس نے فرمایا: اور میں نے انسان کے ظاہر اور باطن کو صرف اس لیے پیدا کیا کہ وہ ظاہراً اور باطناً میری عبادت کریں۔ کیونکہ منافق ظاہراً عبادت کرتا ہے، باطناً نہیں۔ اور مومن ظاہراً اور باطناً عبادت کرتا ہے۔ اور کافر معطل نہ ظاہراً عبادت کرتا ہے اور نہ باطناً۔ اور بعض گنہگار باطناً عبادت کرتے ہیں، ظاہراً نہیں۔ اور پانچواں حصہ کوئی نہیں ہے۔ اور ہم نے جنوں کو، جنہیں اللہ نے آگ سے پیدا کیا، اس آیت سے خارج نہیں کیا اور اسے صرف انسان میں اس جہت سے رکھا جو اس سے ظاہر ہوئی اور جو پوشیدہ رہی، مگر اللہ کے اس قول کی وجہ سے جب اس نے سجدے کا ذکر کیا کہ اس نے ان سب کا ذکر کیا جو آسمانوں میں اور زمین میں اسے سجدہ کرتے ہیں، اور لوگوں کے بارے میں فرمایا: \"اور لوگوں میں سے بہت سے\" (وَكَثِيرٌ مِنَ النَّاسِ)۔ پس اس نے انہیں عام نہیں کیا۔ اور شیاطین اس کے قول: \"جو زمین میں ہیں\" (مَنْ فِي الْأَرْضِ) میں داخل ہو گئے۔ اور یہ اس لیے کہ شیطان، جو رحمت سے دور ہے، انسان سے کہتا ہے جب وہ اسے کفر کا حکم دیتا ہے اور وہ کفر کرتا ہے: \"میں تجھ سے بری ہوں، میں اللہ رب العالمین سے ڈرتا ہوں\" (إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ)۔ پس اللہ نے ہمیں شیطان کی اپنے رب کی معرفت اور اس کے خوف سے آگاہ کیا۔ اسی لیے اس آیت میں جن کو انسان کے پوشیدہ حصے کی طرف پھیرنا، اسے جنات پر مطلق کرنے سے زیادہ اولیٰ ہے، اور اللہ بہتر جانتا ہے۔ اور جہاں تک دسویں اثر کا تعلق ہے، تو وہ وہ ہے جو عالم میں رسولوں کے بیان سے ظاہر ہوا جو اللہ کی طرف سے اس چیز کا ترجمہ کرتے ہیں جو اللہ نے اپنے بندوں پر نازل کی، اپنی کتابوں کے نازل کرنے کے باوجود۔ پس اس نے الٰہی کتابوں کے نزول پر اکتفا نہیں کیا، یہاں تک کہ رسولوں کو مقرر کیا کہ وہ ان میں موجود چیزوں کو بیان کریں، کیونکہ عبارت میں اجمال ہوتا ہے اور وہ تفصیل کا تقاضا کرتی ہے، اور عبارت کی تفصیل صرف عبارت سے ہی ہوتی ہے۔ پس رسولوں نے اس چیز کی تفصیل میں ذات حق (الحق) کا مقام سنبھالا جسے اس نے مفصل نہیں کیا اور مجمل رکھا، اور وہ اللہ تعالیٰ کا قول ہے: \"تاکہ تم لوگوں کے لیے بیان کر دو جو ان کی طرف نازل کیا گیا ہے\" (لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ)، اس چیز کو پہنچانے کے بعد جو ہم پر نازل کی گئی۔ اور یہ ایک حقیقت ہے جو عالم میں جاری ہے، اور اگر یہ نہ ہوتی تو کتابوں کی شرح نہ کی جاتی اور نہ ہی ایک زبان سے دوسری زبان میں اور نہ ایک حال سے دوسرے حال میں ترجمہ کیا جاتا۔ اللہ تعالیٰ نے فرمایا: \"پس اسے پناہ دو یہاں تک کہ وہ اللہ کا کلام سن لے\" (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ)، اور یہ وہ ہے جو اس نے خاص طور پر نازل کیا۔ اور جو کچھ رسول نے تفصیل سے بیان کیا اور واضح کیا، وہ نازل شدہ چیز کی تفصیل ہے، نہ کہ عین نازل شدہ چیز۔ اور بیان ایک خاص عبارت سے واقع ہوتا ہے اور کسی بھی چیز سے سمجھا جا سکتا ہے۔ اور جہاں تک گیارہویں اور بارہویں اثر کا تعلق ہے، تو وہ ان تین مراتب میں سے دو مرتبے ہیں جن کا ہم نے ان آثار کے شروع میں ذکر کیا، اور وہ ذات حق (الحق) کے ساتھ اتصال کا مرتبہ اور دونوں امور کے درمیان ربط قائم کرنے والے سبب کا مرتبہ ہے۔ اور یہ پہلے گزر چکا ہے۔ پس ہم ان شاء اللہ اس مقام کے علوم کا ذکر کرتے ہیں۔ ان میں سے ایک وہ سبب کا علم ہے جو مومن کے لیے دارالنعیم میں نعمت میں باقی رہنے کا موجب ہے۔ اور اس میں جہالت سے، جو شرور کا شر ہے، کامیابی اور نجات کے اسباب کا علم ہے۔ اور اس میں اس چیز کا علم ہے جس کا موطن مستحق ہے، ان امور میں جو انسان کے لیے سعادت کا باعث بنتے ہیں، اور وہ کسی دوسرے موطن میں ظاہر ہو سکتے ہیں اور سعادت نہیں دیتے۔ اور اس میں ہر اس چیز کا علم ہے جس کا عین ثابت ہو، کیا اس کا حکم ساقط ہو جاتا ہے یا صرف بعض کا حکم ساقط ہوتا ہے جس کا عین ثابت ہو، یا اس کا حکم مطلقاً ساقط نہیں ہوتا، بلکہ اس سے ایک خاص حکم ساقط ہوتا ہے، نہ کہ ہر حکم؟ پس کیا اس چیز میں مشغول ہونا چاہیے جس کا حکم ساقط ہو گیا ہو یا اس میں مشغول نہیں ہونا چاہیے، جیسے لغو قسم، کیونکہ حنث کی صورت میں اس سے کفارہ ساقط ہو گیا ہے۔ اور اس میں اس زیادتی کا علم ہے جو ظاہر ہوتی ہے جب فعل کو مخلوق کی طرف ایک شرعی طریقے سے منسوب کیا جائے جو اس کا موجب ہو یا عقلی خلق کی کرم کی وجہ سے۔ اور اس میں ملأ (بھرے ہوئے) اور خلاء (خالی) کا علم ہے۔ اور اس میں وہ فعل کرنے کا علم ہے جو مناسب ہے اور وہ ترک کرنے کا جو مناسب نہیں ہے۔ اور اس میں اشیاء کی حدود میں تجاوز کا علم ہے، اور کیا حد محدود میں داخل ہے، پس وہ تجاوز نہیں ہو گا؟ اور اگر وہ داخل ہو تو اس کے داخل ہونے کی صورت کیا ہے؟ اور اس کے قول: \"اور اپنے ہاتھوں کو کہنیوں تک\" (وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ) اور اس کے قول: \"روزہ رات تک پورا کرو\" (أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ) کے درمیان فرق کا علم ہے۔\n\nیہ ایک مخصوص کلمے کے ساتھ حد (حدود) کا تعین ہے جو ایک میں حد کو محدود (محدود چیز) سے خارج کرنے کا تقاضا کرتا ہے اور دوسرے میں حد کو محدود میں داخل کرنے کا۔ اور یہ اس بات پر منحصر ہے کہ حد بذات خود کیا ہے، کیونکہ حد کی بھی ایک حد ہوتی ہے اور یہ سلسلہ لامتناہی (تسلسل) نہیں ہوتا۔ اور اس میں عہدوں اور امانتوں کا علم ہے، اور امانتیں کیا ہیں؟\n\nاور وہ عہد و پیمان اور معاہدے کیا ہیں جن کا ہمیں حکم دیا گیا ہے؟ اور کیا عہدِ الٰہی کا حکم مخلوق کے عہد جیسا ہے یا نہیں؟ اور اس میں موروثی اور کمائے ہوئے مال کے درمیان فضیلت کا علم ہے، اور ان دونوں میں سے کس مال سے اس کے مالک کو زیادہ لذت حاصل ہوتی ہے؟ یہ ایک ذوقی علم ہے اور مزاج کے اختلاف سے مختلف ہوتا ہے۔ کیونکہ کچھ لوگ سستی پر جبلت کیے گئے ہیں، تو ان کے نزدیک وراثت کا مال زیادہ لذیذ ہوتا ہے کیونکہ اس میں انہیں کوئی عمل نہیں کرنا پڑتا۔ اور ان میں اہل فتوح (کشف و فتوح والے) بھی ہیں۔ اور لوگوں میں سے کچھ ایسے ہیں جو اپنی ذات میں سرداری پر جبلت کیے گئے ہیں، تو وہ کمائے ہوئے مال سے وہ لذت حاصل کرتے ہیں جو موروثی مال سے نہیں کرتے، کیونکہ اس میں ان کی کمائی کے ذریعے اپنی قدرت کے اظہار کا عمل شامل ہوتا ہے۔ اور اس میں مسببات (نتائج) کا اپنے اسباب پر موقوف ہونے کا علم ہے، کہ کیا یہ موقوفی ذاتی ہے یا اللہ کی طرف سے اختیاری؟ اور اس میں ایک حال سے دوسرے حال میں تبدیلیوں (استحالات) کا علم ہے، تو کیا اعیان (ذوات) ان احوال کی پیروی کرتے ہوئے ایک عین سے دوسری عین میں تبدیل ہو جاتے ہیں؟ یا عین ایک ہی رہتی ہے اور تبدیلیاں احوال میں واقع ہوتی ہیں؟ اور اس بارے میں مذاہب مختلف ہیں، تو ان میں حق کہاں ہے؟ اور اس میں صانع (کاریگر) کا اپنی صنعت کو محفوظ رکھنے کا علم ہے، کہ کیا وہ اپنی صنعت کو محفوظ رکھتا ہے یا عین مصنوع (بنی ہوئی چیز) کو؟ کیونکہ صانع کے لیے صنعت کبھی اکتسابی ہو سکتی ہے، جیسے سلائی کا کام اور دیگر چیزیں جو صرف سیکھنے سے حاصل ہوتی ہیں۔ اور کبھی صنعت فطری ہوتی ہے، نہ کہ غور و فکر سے، جیسے حیوانات کی صنعتیں، جیسے شہد کی مکھیوں اور مکڑیوں کی، اور یہ سب اللہ کے بنانے (جعل) سے ہیں۔ اور کبھی ذاتی ہوتی ہے، جیسے صنعت کی نسبت اللہ کی طرف کرنا۔ اور اس کے ساتھ اللہ تعالیٰ کے اس فرمان کا کیا مطلب ہے: \"يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ\" (وہ امر کی تدبیر کرتا ہے، وہ آیات کو کھول کر بیان کرتا ہے)؟ پس اس نے تدبیر کی نسبت اپنی طرف کی۔ اور اس میں اس حکمت کا علم ہے کہ کائنات میں کون سی چیزیں ثابت ہوتی ہیں اور کون سی نہیں؟ اور نبی صلی اللہ علیہ وسلم کا اس بارے میں مثال دینا جو آپ بارش اور زمین کے ٹکڑوں کے بارے میں لائے، کہ کس کو اللہ نے اس چیز سے فائدہ دیا جو آپ لائے اور کس کو فائدہ نہیں دیا۔ اور اس میں ادنیٰ (کم تر) سے اعلیٰ (برتر) کے وجود کا علم ہے، جیسے معانی میں ہمارے علم کا وجود اللہ کے بارے میں، ہمارے اپنے بارے میں علم کے وجود سے۔ اور اس میں نیابت (قائم مقامی) کے لیے نائب کے حکم کا علم ہے۔ اور اس میں کسی چیز کی معرفت کا علم ہے اس چیز سے جو اس سے بنتی ہے، نہ کہ اس چیز کے ذریعے۔ اور اس باب میں کسی چیز کو دوسری چیز کا نام دینا شامل ہے اگر وہ اس کے پڑوس میں ہو، یا کسی سبب سے اس سے ہو، یا اسے اپنے اندر شامل کرے۔ اور اس میں وہ توحید کیا ہے جو عالم سے مطلوب ہے؟ اور اس میں فضائل کا علم ہے، یہاں تک کہ ان میں حسد واقع ہوتا ہے، تو کیا وہ فضائل بذات خود فضائل ہیں یا عرف اور وضع کے حکم سے؟ اور اس میں اس چیز کا علم ہے جس سے ہر چیز تفصیل اور اختلاف کے ساتھ باقی رہتی ہے، تو ہر وہ چیز جو کسی ایک چیز سے بچاتی ہے، ضروری نہیں کہ وہ کسی دوسری چیز سے بھی بچائے۔ اور وہ جامع امر کیا ہے جو ہر وقایہ (بچاؤ) کے لیے ہے؟ اور اس میں امثال (مثالوں) کے وجود کا فائدہ ہے، جبکہ پہلی مثال سے ہی اکتفا کیا جا سکتا تھا۔ اور اس میں ان پردوں (حجب) کا علم ہے جو لوگوں اور اشیاء کے علم کے درمیان حائل ہیں۔ اور اس میں اس شخص کا علم ہے جس نے جہل کو علم بنا لیا، کیا وہ اپنے اندر اس پر یقین (قطع) پاتا ہے؟ یا اس کا نفس اسے اس بارے میں متزلزل کرتا ہے؟ یہاں تک کہ جب وہ اپنے نفس میں غور و فکر کو محقق کرتا ہے، تو وہ اس میں اور اس چیز میں فرق پاتا ہے جو علم کے موافق ہے اور جو موافق نہیں ہے۔ اور یہ صرف جہل (نادانی) میں خاص ہے، لیکن ظن (گمان) اور شک کا حکم یہ نہیں ہے۔ کیونکہ گمان کرنے والا اپنے گمان سے جانتا ہے، اور شک کرنے والا اپنے شک سے جانتا ہے۔ اور جاہل (نادان) اپنے جہل سے نہیں جانتا، کیونکہ جو اپنے جہل سے جانتا ہے، تو اس کے پاس ایک علم ہے جس سے اسے موصوف کیا جا سکتا ہے۔ اور اس میں تائید (مدد) کی حکمت کا علم ہے، کہ کیا یہ عنایت ہے یا اتمامِ حجت؟ یا ایک شخص کے حال کے اعتبار سے ایک جگہ عنایت ہے اور دوسری جگہ اتمامِ حجت؟ اور اس میں کسی چیز کے عالم کی طرف منسوب ہونے والی چیز کا علم ہے جو اس کے علم کا حق نہیں ہے، اس کے باوجود وہ اسے اپنی طرف منسوب کرتا ہے، جیسے عالم کا کسی چیز کے واقع ہونے یا نہ ہونے کی امید رکھنا جس کی وہ امید کر رہا ہے، تو علم کے ساتھ رجاء (امید) کا کیا تعلق ہے؟ اور اس میں اس شخص کی حکمت کا علم ہے جو احسان کرتا ہے جبکہ وہ اس کے ثمرے پر یقین نہیں رکھتا، کیا یہ اس کے احسان کی مرتبت کے بارے میں اس شخص کی جہالت کے علم کی طرف راجع ہے جس پر اس نے احسان کیا؟ یا یہ اس کے اپنے نفس کی طرف راجع ہے کیونکہ وہ نہیں جانتا کہ اس نے اس میں احسان کا حق پورا کیا ہے؟ اور اس میں مصیبت زدہ لوگوں پر عذاب اور تکلیف کے مسلسل جاری رہنے کی حکمت کا علم ہے، کیا یہ ان پر رحمت کی وجہ سے ہے یا نہیں؟ اور اس میں اس شخص کا علم ہے جس نے کسی امر کو اس کے غیر میں استعمال کیا جس کے لیے وہ وضع کیا گیا تھا، یا اسے صرف اسی میں استعمال کیا جس کے لیے وہ وضع کیا گیا تھا، جبکہ اس کے بہت سے متضاد پہلو ہوں، تو وہ اس حکم سے خارج ہو گیا جو اس کے لیے ہے، جیسے بیماری کا ایک پہلو صبر کی طرف ہے اور ایک پہلو بے چینی (ضجر) کی طرف ہے۔ اور اس میں بھولنے والے کے یاد کرنے کا علم ہے، کہ کیا اس کا یاد کرنا اسے فائدہ دیتا ہے یا نہیں؟ اور اس میں سچے شخص کا جھوٹا کہلانے کا علم ہے۔ اور اس میں استعاذہ (پناہ مانگنا) کا علم ہے، اور وہ کیا ہے جس کے ذریعے اور جس سے پناہ مانگی جاتی ہے، اور کہاں اس کی تعریف کی جاتی ہے اور کس جگہ اس کی مذمت کی جاتی ہے؟ اور اس میں اعتراف (اقرار) کا علم ہے کہ اس میں سے کیا فائدہ دیتا ہے اور کیا فائدہ نہیں دیتا، کیونکہ اعتراف کے لیے مقامات کا ایک حکم ہے اور احوال کا بھی اس میں ایک حکم ہے۔ کیونکہ لوگوں میں سے کچھ ایسے ہیں جو غلطی کا اعتراف کرتے ہیں جبکہ اس پر باقی رہتے ہیں، اور کچھ ایسے ہیں جو اس سے دور ہو جاتے ہیں۔ اور اس میں خطاب کی شرافت اور اس سے لذت کے وجود کا علم ہے۔ اور اس میں عالم میں شک کے وجود کی حکمت کا علم ہے۔ اور اس میں مجتہد کی نجات کا علم ہے، خواہ اس نے غلطی کی ہو یا صحیح بات تک پہنچا ہو، اس کے باوجود کہ اللہ نے اسے جو کچھ عطا کیا ہے وہ اسے پورا کرتا ہے۔\n\nاور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی ہدایت دیتا ہے۔",
    "fa": "باب سیصد و شصت و یکم در معرفت منزل اشتراک با حق (الحق) در تقدیر (التقدير)، و آن از حضرت محمدیه (الحضرة المحمدية) است.\n\nاگر در هستی (الكون) غیر از خدا بود، نمی‌یافتند\nنه فاعلی در آن و نه منفعل.\n\nلیکن او در هستی (الكون) یگانه و منفرد است\nدر آفرینش و در دگرگون کردن دولت‌ها.\n\nو آفرینش به نیستی باز نمی‌گردد\nو نه استقامتش در عین (العين) از کجی.\n\nپس بنگر به دولت‌هایی که در خود ملت‌ها دارند\nو بنگر به ملت‌هایی که از فرقه‌ها آشکار می‌شوند.\n\nو با آن، فلکی را بر فراز فلکی بالا ببر\nاز هلال تا قصد زحل.\n\nآن را فرشته‌ای از سدره آورد که رسید\nبه نهایت امر در پوششی از پرده‌ها.\n\nو به آنچه فرقه‌ها ندا دادند، ندا مده\nای مبدأ امر، بلکه ای علت العلل.\n\nزیرا این لقبی است که نشانه‌هایش داده\nفقری که با آن برپا می‌شود، مانند سایر علل.\n\n### [فرشتگان مهیمه (الملائكة المهيمة) در جلال حق (الحق)]\n\nبدان، خداوند تو را با روحی از جانب خود تأیید کند، که خدای عز و جل به ابلیس می‌گوید: «ما مَنَعَكَ أَنْ تَسْجُدَ لِما خَلَقْتُ بِيَدَيَّ» (چه چیز تو را بازداشت از اینکه سجده کنی برای آنچه با دو دست خود آفریدم؟) از جهت تشریف و اختصاص برای آدم (علیه السلام). «أَسْتَكْبَرْتَ» (آیا تکبر ورزیدی؟) در نظر خودت. و چنین نیز بود، زیرا خداوند از او خبر داد که تکبر ورزید و به ما عز و جل در کتاب عزیزش فرمود که ابلیس گفت: «أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ وخَلَقْتَهُ من طِينٍ» (من از او بهترم؛ مرا از آتش آفریدی و او را از گِل). و هنگامی که به او گفته شد سجده کن، گفت: «أَ أَسْجُدُ لِمَنْ خَلَقْتَ طِيناً» (آیا سجده کنم برای کسی که از گِل آفریدی؟). این همان معنای سخن ماست که «در نظر خودت» یا «أَمْ كُنْتَ من الْعالِينَ» (یا از بلندمرتبگان بودی؟) در نفس امر، یعنی تو در نفس امر از او بهتری. در اینجا جهل ابلیس آشکار شد.\n\nو شاید منظور از «العالين» (بلندمرتبگان)، فرشتگان مهیمه (الملائكة المهيمة) در جلال حق (الحق) باشند که تحت فرمان سجده قرار نگرفتند. و آنان ارواحی هستند که فرشته نیستند، زیرا فرشتگان، رسولان از جانب این ارواح هستند، مانند جبرئیل (علیه السلام) و امثال او. زیرا «الألوكة» در زبان عربی به معنای رسالت است. پس فرشتگان، رسولان خاص از این ارواح هستند. بنابراین هیچ فرشته‌ای باقی نماند مگر اینکه سجده کرد، زیرا آنان کسانی بودند که خداوند به ایشان فرمود: «اسْجُدُوا لِآدَمَ» (برای آدم سجده کنید). و ارواح مهیمه (المهيمة) در زمره مخاطبان به سجده وارد نشدند، زیرا خداوند ذکر نکرده است که جز فرشتگان را مورد خطاب قرار داده باشد. و به همین دلیل فرمود: «فَسَجَدَ الْمَلائِكَةُ كُلُّهُمْ أَجْمَعُونَ» (پس همه فرشتگان، همگی سجده کردند) و ابلیس را بر استثنای منقطع نه متصل نصب کرد.\n\nو این ارواح مهیمه (المهيمة) در جلال حق (الحق)، به دلیل اشتغالشان به خداوند، نمی‌دانند که خداوند آدم یا هیچ چیز دیگری را آفریده است. خداوند به ابلیس می‌گوید: «أَمْ كُنْتَ من الْعالِينَ» (یا از بلندمرتبگان بودی؟) یعنی از این کسانی که ذکر کردیم، پس به سجده امر نشدی. و سجده در زبان به معنای سر فرود آوردن است، زیرا آدم از خاک آفریده شد و خاک پایین‌ترین ارکان است و پایین‌تر از آن نیست. و از اینجا شرافت نقطه دایره بر محیط آن شناخته می‌شود، زیرا نقطه، اصل وجود محیط است. پس عالین (العالون) به سجده امر نشدند، زیرا در تعریف خداوند برای ما، ذکری از آنان به میان نیامده است. و اگر خداوند ابلیس را به دلیل سرپیچی‌اش ذکر نمی‌کرد، ما نمی‌دانستیم که او به سجده امر شده است.\n\nو خداوند آدم را به دو دست خود اضافه نکرد مگر از جهت تشریف بر غیر او و بلند آوازه کردن او تا منزلتش نزد خداوند دانسته شود. سپس در تشریف او با آفرینش با دو دست، این سخن را افزود، در حالی که انسان‌های حیوانی را به کمال انسان‌های کامل (الإنسان الكامل) معرفی می‌کند: «أَوَ لَمْ يَرَوْا» (آیا ندیدند؟) ضمیر در «یروا» به انسان‌های حیوانی بازمی‌گردد، «أَنَّا خَلَقْنا لَهُمْ» (که ما برای آنان آفریدیم) یعنی به خاطر آنان. پس ضمیر در «لهم» به انسان‌های کامل (الكامل) بازمی‌گردد که مقصود از عالم با خطاب الهی هستند، «مِمَّا عَمِلَتْ أَيْدِينا» (از آنچه دست‌های ما انجام داده است). پس عمل خلق را به دست‌های الهی اضافه کرد و اسماء الهی را با نون جمع در «أيدينا» عمومیت داد، و این برای تمامیت تشریفی است که آدم (علیه السلام) با اضافه آفرینش او به دو دستش، بدان مشرف شد، «أَنْعاماً» (چهارپایان) و این از انعام او بر آنان است.\n\nپس آنچه برای هستی (الكون) است، برای آنان است و به تملیک خداوند مالک آن شدند، برخلاف انسان حیوانی که آن را نزد خود و به نفس خود مالک می‌شود، در حالی که از انعام خداوند بر خود غافل است. پس انسان حیوانی در مخلوقات به حکم تبعیت تصرف می‌کند، و انسان کامل (الإنسان الكامل) در آن‌ها به حکم تملیک الهی تصرف می‌کند. پس تصرف او در آن‌ها به دست خدا و با مال خداوندی است که به او داده است، چنانکه خدای تعالی در حق بردگان امر فرمود: «وَآتُوهُمْ من مالِ الله الَّذِي آتاكُمْ» (و به آنان از مال خداوندی که به شما داده است، بدهید).\n\nپس آفرینش هر مخلوقی در عالم به دست الهی اضافه شده است، زیرا فرمود: «مِمَّا عَمِلَتْ أَيْدِينا» (از آنچه دست‌های ما انجام داده است) و جمع آورد. پس هر دست آفریننده‌ای در عالم، دست اوست؛ دست ملک و تصریف. پس خلق همه از آن خداست: «أَلا لَهُ الْخَلْقُ والْأَمْرُ» (آگاه باشید که آفرینش و امر از آن اوست). و روایت شده است که درخت طوبی را خداوند با دست خود غرس کرد و بهشت عدن را با دست خود آفرید. پس دست را مفرد آورد و مثنی و جمع آورد. و آن را مثنی نیاورد مگر در آفرینش آدم (علیه السلام) که همان انسان کامل (الإنسان الكامل) است. و شکی نیست که تثنیه، برزخی میان جمع و افراد است، بلکه آغاز جمع است. و تثنیه ذاتاً مقابل دو طرف قرار می‌گیرد، پس درجه کمال را دارد، زیرا مفرد جز با آن به جمع نمی‌رسد و جمع جز با آن به مفرد نمی‌نگرد. پس با انسان کامل (الإنسان الكامل)، کمال صورت ظاهر شد. او قلب جسم عالم است که عبارت است از هر آنچه غیر خداست، و او بیت المعمور است که با حق (الحق) آباد شده، زیرا او را در خود جای داد.\n\nخدای تعالی در حدیث مروی می‌فرماید: «ما وسعني أرض ولا سمائي ووسعني قلب عبدي المؤمن» (زمین و آسمانم مرا در خود جای نداد، اما قلب بنده مؤمنم مرا در خود جای داد).\n\nپس مرتبه انسان کامل (الإنسان الكامل) از آن جهت که قلب است، میان خدا و عالم قرار گرفت. و او را قلب نامید به دلیل تقلب (دگرگونی) او در هر صورت: «كُلَّ يَوْمٍ هُوَ في شَأْنٍ» (هر روز او در کاری است) و تصریف و وسعت او در تقلب و تصریف. و به همین دلیل این وسعت الهی را داشت، زیرا او تعالی خود را وصف کرده است که هر روز در شأنی است. و «یوم» در اینجا، زمان فرد در هر چیزی است. پس او در شئون است. و تمام تصریفات و تقلبات در عالم چیزی جز این شئون نیست که حق (الحق) در آن‌هاست.\n\nو هیچ نصّی از جانب خداوند و رسولش در مورد مخلوقی نیامده است که به او «کن» (باش) داده شده باشد، مگر انسان به طور خاص.\n\nاین امر در زمانی در مورد پیامبر (صلی الله علیه و سلم) در غزوه تبوک ظاهر شد که فرمود: «کن أبا ذر» (ابوذر باش)، پس ابوذر شد.\n\nو خبر رسیده است در مورد اهل بهشت که فرشته‌ای نزد آنان می‌آید و پس از اجازه ورود، نامه‌ای از جانب خداوند به آنان می‌دهد، پس از آنکه از جانب خداوند به آنان سلام می‌کند. در آن نامه برای هر انسانی که مورد خطاب قرار می‌گیرد، آمده است: «از حیّ قیومی که نمی‌میرد، به حیّ قیومی که نمی‌میرد. اما بعد، من به شیء می‌گویم «كُنْ فَيَكُونُ» (باش، پس می‌شود) و تو را نیز قرار دادم که به شیء بگویی «کن فیکون»». پس پیامبر (صلی الله علیه و سلم) فرمود: «هیچ یک از اهل بهشت به چیزی نمی‌گوید «کن» مگر اینکه می‌شود».\n\nپس با «شیء» آمد، و آن از ناشناخته‌ترین ناشناخته‌هاست، پس عمومیت یافت. و نهایت طبیعت، تکوین اجسام است و آنچه را که از آن خالی نیست و به طبع آن را می‌طلبد، حمل می‌کند. و شکی نیست که اجسام بخشی از عالم هستند، پس عمومیت ندارند. و نهایت نفس، تکوین ارواح جزئی در نشآت طبیعی است، و ارواح جزئی از عالم هستند، پس عمومیت نیافت. پس عمومیت داده نشد مگر به انسان کامل (الإنسان الكامل) که حامل سرّ الهی است. پس هر آنچه غیر خداست، جزئی از کل انسان است. اگر تعقل می‌کنی، تعقل کن. و در هر آنچه غیر خداست و حق (الحق) آن را وصف کرده است، بنگر، و آن سخن اوست: «وَإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ» (و هیچ چیزی نیست مگر اینکه با حمد او تسبیح می‌گوید). و همه را به سجده وصف کرد. و برای هیچ یک از آن‌ها در عالم، امر و نهی و خلافت و تکوین عام قرار نداد، و این‌ها را برای انسان کامل (الإنسان الكامل) قرار داد. پس هر کس می‌خواهد کمال خود را بشناسد، باید در نفس خود بنگرد، در امر و نهی و تکوین خود بدون واسطه زبان یا جارحه (عضو) یا مخلوق دیگری. اگر این معنا برای او صحیح شد، پس او «عَلى‏ بَيِّنَةٍ من رَبِّهِ» (بر دلیل روشنی از پروردگارش است) در کمال خود. زیرا او نزد خود شاهدی از او (یعنی از نفس خود) دارد، و آن همان است که ذکر کردیم.\n\nپس اگر امر یا نهی کرد یا شروع به تکوین نمود با واسطه عضوی از اعضای خود، و هیچ یک از آن واقع نشد، یا در چیزی واقع شد و در چیزی دیگر واقع نشد، و با ترک واسطه عمومیت نیافت، پس کامل شده است. و آنچه در هستی (الوجود) به امر او با واسطه واقع نشود، کمال او را خدشه‌دار نمی‌کند. زیرا صورت الهی به این طریق در هستی (الوجود) ظاهر شد. او تعالی بندگانش را بر زبان رسولانش (علیهم السلام) و در کتاب‌هایش امر فرمود، پس برخی اطاعت کردند و برخی عصیان. و با برداشته شدن واسطه‌ها، راهی جز اطاعت خاص نیست، و سرپیچی صحیح و ممکن نیست.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «يد الله مع الجماعة» (دست خدا با جماعت است).\n\nو قدرت او نافذ است. و به همین دلیل، هنگامی که انسان در نفس خود جمع شود تا یک چیز واحد گردد، همت او در آنچه می‌خواهد نافذ می‌شود. و این ذوقی است که اهل الله همگی بر آن اجماع دارند. زیرا دست خدا با جماعت است، چرا که عالم با مجموع ظاهر شد. و اعیان چیزی جز او نیستند. در سخن خدای تعالی بنگر: «ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ» (هیچ رازگویی سه نفری نیست مگر اینکه او چهارمین آن‌هاست). سپس فرمود: «ولا أَدْنى‏ من ذلِكَ» (و نه کمتر از آن) که کمتر از سه نفر است، «ولا أَكْثَرَ» (و نه بیشتر) که بالاتر از سه نفر تا بی‌نهایت عدد است، «إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا» (مگر اینکه او با آن‌هاست هر کجا که باشند)، چه وجود باشند و چه عدم. هر کجا که فرض شوند، او سبحانه دومینِ واحد است، زیرا معیت (همراهی) برای واحد از خودش صحیح نیست، چون مقتضی مصاحبت است و حداقل آن دو نفر است. و او سومینِ دو نفر و چهارمینِ سه نفر و پنجمینِ چهار نفر است، تا هر جا که برسد.\n\nو اگر معیت (همراهی) به خلق اضافه شود نه به حق (الحق)، معیت دومین برای یک نفر، دومینِ دو نفر است، و معیت سومین برای دو نفر، سومینِ سه نفر است، و معیت چهارمین برای سه نفر، چهارمینِ چهار نفر است، تا هر جا که برسد، زیرا او عین همان چیزی است که در مخلوقیت با اوست، پس از جنس اوست. و حق (الحق) چنین نیست، زیرا «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست). پس او سومینِ سه نفر و پنجمینِ پنج نفر نیست. پس بفهم.\n\nپس حق (الحق) از خلق از یک جهت آشکار شد و از جهت دیگر نیز به صورت خود ظاهر گشت.\n\n### [اینکه طبیعت، سایه نفس کلی است که به لوح محفوظ (اللوح المحفوظ) تعبیر می‌شود]\n\nو بدان که طبیعت، سایه نفس کلی است که به دو قوه وصف شده و در زبان شرع به لوح محفوظ (اللوح المحفوظ) تعبیر می‌شود. پس آنچه از سایه نفس امتداد نیافته و در آن باقی مانده است، همان است که با آن از عقل در درجه نوریّت و روشنایی فرود آمده است. و آنچه از سایه نفس امتداد یافته، طبیعت نامیده شده است. و امتداد این سایه بر ذات هیولای کل (الهيولى الكل) بود. پس جسم کل (الجسم الكل) از جوهر هیولا و طبیعت، تاریک ظاهر شد. و به همین دلیل آن را به دلیل این ظلمت طبیعی به شبجه سیاه تشبیه کردند. و نفس را به دلیل آنچه از عقل در نور فرود آمده بود، زمرّد سبز نامیدند. و در جسم کل (الجسم الكل)، صور عالم اجسام و اشکال آن ظاهر شد. پس این برای جسم کل (الجسم الكل) مانند اعضا بود.\n\nپس هنگامی که جسم با آنچه آماده شده بود، استعداد یافت، نفس بر آن توجه کرد و آن را روشن ساخت. پس حیات در تمام اعضای آن منتشر شد. این‌ها ارواح عالم اجسام علوی و سفلی هستند، از فلک و عنصر. سپس برخی از آن به برخی دیگر استحاله یافت به دلیل تأثیر حکم حرکت زمانی که اسم دهر (الدهر) آن را در افلاک تعیین کرد. پس صور مولدات فلکی مانند کواکب و جنات و مرتبه آن‌ها و آنچه در آن‌هاست، و مولدات عنصری مانند معدن و نبات و حیوان و صور غریب و اشکال عجیب در عین وجودی ظاهر شد.\n\nپس چیزی از عدم خارج نشد مگر صور و اعراض از ترکیب و تحلیل، و جوهر ثابت العین است و پذیرای این صور در دنیا و آخرت است. و چون این را دانستی و مقرر شد، بدان که سخن خدای تعالی: «يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ» (امر را تدبیر می‌کند و آیات را تفصیل می‌دهد)، معنای مراد از آن، تقدیر و ایجاد است. پس تدبیر برای تقدیر است و تفصیل برای ایجاد، از «فصلت الشیء عن الشیء» (چیزی را از چیزی جدا کردم) هنگامی که آن را از آن بریدی و میان آن و دیگری فاصله انداختی تا متمایز شود.\n\nپس اگر فصل از روی تقدیر باشد، بر صورت و شکل آن است، و اگر از غیر تقدیر باشد، ممکن است بر صورت آن نباشد، اگرچه در امری شبیه آن باشد، زیرا در امر دیگری از آن جدا می‌شود، مانند سفیدی و سیاهی که در رنگ بودن مشترکند، اگرچه ضد یکدیگرند، و مانند رنگ و حرکت که در عرض بودن مشترکند، اگرچه متفاوتند. شاعر می‌گوید:\n> ولأنت تفري ما خلقت و*** بعض الناس يخلق ثم لا يفري‏\n> (و تو آنچه را آفریدی، می‌بُری و *** برخی مردم می‌آفرینند، سپس نمی‌بُرند.)\n\nو مانند کفاش و امثال او از زرگر و خیاط و آهنگر و امثال آن. می‌خواهد از پوست، کفشی ببرد، پس کفشی را بر پوست اندازه می‌گیرد. هنگامی که اندازه آن را از پوست گرفت، آن مقدار را از پوست می‌بُرد و از آن جدا می‌کند.\n\nو سایه‌ها را خداوند بر مثال اشخاص ایجاد کرد. و هنگامی که اراده کرد آن‌ها را جدا کند، آن‌ها را امتداد داد. پس اعیان آن‌ها بر صورت کسی که سایه او هستند، ظاهر شد، مانند بریدن نعل به نعل. پس هنگامی که خداوند عالم را بدون انسان (یعنی بدون مجموع او) آفرید، صورت او را بر صورت تمام عالم اندازه گرفت. پس هیچ جزئی در عالم نیست مگر اینکه بر صورت انسان است. و منظور از عالم، هر آنچه غیر خداست. پس او را از عالم جدا کرد پس از آنکه او را تدبیر نمود، و او عین امر مدبَّر است.\n\nسپس او تعالی او را به صورت معنوی بر حضرت اسماء الهی اندازه گرفت. پس ظهور صور در آینه برای بیننده در او ظاهر شد. سپس او را از حضرت اسماء الهی جدا کرد، پس از آنکه قوای آن‌ها در او حاصل شد. پس با آن قوا در روح و باطن او ظاهر شد. پس ظاهر انسان، خلق است و باطن او، حق (الحق). و این همان انسان کامل (الإنسان الكامل) مطلوب است. و غیر از این، انسان حیوانی است. و مرتبه انسان حیوانی نسبت به انسان کامل (الإنسان الكامل)، مرتبه آفرینش نسناس از انسان حیوانی است.\n\nاین خلاصه امر در آفرینش انسان کامل (الإنسان الكامل) بدون تفصیل است. اما تفصیل آفرینش او: بدان که خداوند هنگامی که ارکان چهارگانه را بدون فلک آفرید و آن‌ها را به شکل فلک گرداند، و همه اشکالی در جسم کل (الجسم الكل) هستند، اولین حرکت فلکی اثر خود را در آنچه به آن نزدیک‌تر است از ارکان، یعنی آتش، ظاهر کرد. پس در آن با رطوبتی که در هوا بود، تأثیر کرد و شعله‌ور شد. پس آن شعله‌ور شدن و لهیب از آتش و هوا بود، و آن «مارج» (مخلوط) است. و به همین دلیل مرج (چمنزار) را مرج نامیدند، زیرا شامل مخلوطی از گل‌ها و گیاهان است. و از همین رو مردم در «هرج» (کشتار) و «مرج» (اختلاط) افتادند. پس خداوند در آن شعله، جن را گشود.\n\nسپس کواکب نورانی به امر و اذن خداوند افاضه کردند، زیرا او «أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها» (در هر آسمانی امر آن را وحی کرد). پس شعاع خود را بر ارکان افکندند، و ارکان محل افکندن شعاعات هستند. پس ارکان با انوار ظاهر شدند و درخشیدند و روشن شدند. پس در آن‌ها معدن و نبات و حیوان تأثیر کردند و متولد شدند. و آن‌ها در حقیقت همان‌هایی هستند که در نفس خود تأثیر کردند، زیرا افلاک (یعنی آسمان‌ها) را خداوند از ارکان ایجاد کرد، سپس با حرکات خود و افکندن شعاعات کواکب خود در ارکان تأثیر کردند تا آنچه از مولدات در آن‌ها متولد شد، به وجود آید. پس کالای آن‌ها به خودشان بازگردانده شد. پس چیزی جز خودشان در آن‌ها تأثیر نکرد.\n\nو این را از نشانه‌های قیامت قرار داد، زیرا از نشانه‌های آن این است که زن، شوهر خود را بزاید. پس ارکان، فلک را زاییدند، سپس فلک با آن‌ها نکاح کرد، پس آنچه در آن‌ها متولد شد، فرزند او و شوهر اوست.\n\nو در ارکان، صورتی برای انسان که مطلوب از وجود عالم است، ظاهر نشد. پس خاک لزج را گرفت و آن را با آب مخلوط کرد و با دو دست خود (تعالی) آن را گِل ساخت، چنانکه شایسته جلال اوست، زیرا «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست). و آن را مدتی رها کرد تا با هوای گرمی که در اجزای گِل آن نفوذ می‌کرد، تخمیر شود. پس تخمیر شد و بوی آن تغییر کرد، و «حَمَإٍ مَسْنُونٍ» (گِل بدبو و متغیر) شد.\n\nو هر کس می‌خواهد صدق این را ببیند، اگر در ایمانش خللی هست، بازوی خود را به بازوی خود محکم بمالد تا حرارت را از پوست بازویش بیابد، سپس آن را استشمام کند، بوی حماة (گِل بدبو) را در آن می‌یابد، که اصل آن است که جسم از آن آفریده شده است. خداوند تعالی فرمود: «خَلَقَ الْإِنْسانَ من صَلْصالٍ ومن حَمَإٍ مَسْنُونٍ» (انسان را از گِل خشکیده و از گِل بدبوی متغیر آفرید).\n\nپس هنگامی که سفال انسان با پختن رکن آتش پاک شد و اجزای آن به هم پیوست و قوی و سخت شد، آن را با آب که عنصر حیات است، کوتاه کرد. پس آب از رطوبت خود به آن داد و از سختی سفال به اندازه‌ای که نرم شد، نرم کرد. پس حیات در آن جاری شد. و رکن هوایی با رطوبت و حرارت خود به آن مدد رساند تا حرارتش با سردی آب مقابله کند. پس از هم بازماندند. پس رطوبت بر آن فراوان شد. پس جوهر گِل آن را به گوشت و خون و عضلات و رگ‌ها و اعصاب و استخوان‌ها تبدیل کرد. و این‌ها همه مزاج‌های مختلفی هستند به دلیل اختلاف آثار طبیعت عناصر و استعدادهای اجزای این نشأت. به همین دلیل اعیان این نشأت حیوانی مختلف شدند، پس نام‌های آن‌ها نیز مختلف شد تا هر عینی از دیگری متمایز شود.\n\nو غذای این نشأت را از آنچه از آن آفریده شده، قرار داد. و غذا سبب وجود نبات است و با آن رشد می‌کند. پس از رشد و ظهور افزایش در آن با این سخن تعبیر کرد: «والله أَنْبَتَكُمْ من الْأَرْضِ نَباتاً» (و خداوند شما را از زمین رویاند، رویاندنی). و معنای آن این است که: پس شما روییدید، رویاندنی. زیرا مصدر «أنبت» همان «إنبات» است. پس روییدن را به چیزی اضافه کرد که رشد می‌کند. می‌گوید: غذای شما را از آن قرار داد، یعنی از آنچه می‌رویاند. پس با آن می‌رویید، یعنی اجسام شما رشد می‌کند و زیاد می‌شود.\n\nپس هنگامی که نشأت جسمی، نباتی و حیوانی را کامل کرد و تمام قوای حیوان در آن ظاهر شد، فکر را از قوه نفس عملی به او داد و آن را از قوه نفس علمی از اسم الهی مدبّر به او داد. زیرا حیوان هر آنچه از صنایع انجام می‌دهد و هر آنچه می‌داند، از روی تدبیر و اندیشه نیست، بلکه بر علم به آنچه از او صادر می‌شود، مفطور است و نمی‌داند که آن اتقان و احکام از کجا برایش حاصل شده است، مانند عنکبوت‌ها و زنبورهای عسل و زنبورهای سرخ. برخلاف انسان که می‌داند هیچ امری را استنباط نکرده است مگر از روی فکر و اندیشه و تدبیر. پس می‌داند که این امر از کجا صادر شده است. و سایر حیوانات امر را می‌دانند، اما نمی‌دانند از کجا صادر شده است.\n\nو به همین اندازه، انسان نامیده شد و نه بیشتر. و این حالتی است که همه مردم در آن مشترکند، مگر انسان کامل (الإنسان الكامل). زیرا او بر انسان حیوانی در دنیا با تصریف اسماء الهی که قوای آن‌ها را هنگام اندازه‌گیری حق (الحق) بر آن‌ها، بر عالم گرفت، افزوده است. پس انسان کامل (الإنسان الكامل) را خلیفه از انسان کل کبیر قرار داد که سایه خدا در خلق او از خلق اوست. پس او از آن جهت خلیفه است. و به همین دلیل آن‌ها\n\nخلفای یک مستخلَف واحد هستند. پس آن‌ها سایه‌های او برای انوار الهی هستند که مقابل انسان اصلی قرار می‌گیرند. و آن انوار تجلی (التجلی) هستند که از هر طرف بر او مختلف می‌شوند. پس سایه‌های متعددی به اندازه تعداد تجلی (التجلی) برای او ظاهر می‌شود. پس برای هر تجلی (التجلی) در او نوری است که سایه‌ای از صورت انسان در هستی (الوجود) عنصری می‌دهد. پس آن سایه، خلیفه خاص است. اما انسان حیوانی، اصل او به طور کلی این نیست، بلکه حکم او حکم سایر حیوانات است، جز اینکه از غیر خود از حیوانات با فصل مقوّم خود متمایز می‌شود، همانطور که حیوانات برخی از برخی دیگر با فصول مقوّم هر یک از حیوانات متمایز می‌شوند. زیرا اسب، الاغ نیست از جهت فصل مقوّم آن، و نه قاطر، و نه پرنده، و نه درنده، و نه کرم. پس انسان حیوانی از جمله حشرات است. پس هنگامی که کامل شود، خلیفه است. پس ما در معانی‌ای جمع شدیم و در معانی‌ای جدا گشتیم.\n\n### [اینکه خداوند حکم خلافت و اسم خلیفه را به او داد]\n\nسپس خداوند حکم خلافت و اسم خلیفه را به او داد. و این دو لفظ مؤنث هستند به دلیل ظهور تکوین از آن‌ها، زیرا مؤنث محل تکوین است. پس در اسم، تنبیهی است. و در مورد او «نائب» نگفت، اگرچه معنای آن عیناً همان است، بلکه فرمود: «إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً» (من در زمین جانشینی قرار می‌دهم). و نگفت انسان یا داعی، بلکه او را به آنچه برایش ایجاد کرده بود، ذکر و نامید.\n\nو ما میان انسان حیوانی و انسان کامل (الإنسان الكامل) خلیفه تفاوت گذاشتیم به دلیل سخن خدای تعالی: «يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ» (ای انسان، چه چیز تو را به پروردگار کریمت مغرور ساخت؟ آنکه تو را آفرید، پس سامان داد و معتدل ساخت). این کمال نشأت انسانی عنصری طبیعی است. سپس پس از آن به او فرمود: «فِي أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ» (در هر صورتی که خواست، تو را ترکیب کرد). اگر خواست در صورت کمال، پس تو را خلیفه خود در عالم قرار می‌دهد، یا در صورت حیوان، پس از جمله حیوانات خواهی بود با فصل مقوّم ذاتت که جز برای کسی که نام انسان بر او اطلاق می‌شود، نیست.\n\nو در غیر نشأت انسان هرگز تسویه و تعدیل ذکر نشده است، اگرچه آمده است: «الَّذِي خَلَقَ فَسَوَّى» (آنکه آفرید و سامان داد)، اما شاید منظور از آن آفرینش انسان باشد، زیرا تسویه و تعدیل با هم جز برای انسان نیست، چون او را بر صورت عالم سامان داد و بر آن معتدل ساخت. و این برای غیر او از مخلوقات عناصر نبود. سپس پس از تسویه و تعدیل به او فرمود: «کن» (باش)، و آن نفس الهی است. پس انسان کامل (الإنسان الكامل) از تسویه و تعدیل و نفخ روح و قول «کن» ظاهر شد. و این همان سخن اوست: «إِنَّ مَثَلَ عِيسى‏ عِنْدَ الله كَمَثَلِ آدَمَ خَلَقَهُ من تُرابٍ ثُمَّ قالَ لَهُ كُنْ» (همانا مَثَل عیسی نزد خدا مانند مَثَل آدم است که او را از خاک آفرید، سپس به او گفت: باش). پس کامل (عیسی علیه السلام) را به کامل (آدم علیه السلام) تشبیه کرد؛ خلیفه به خلیفه. و غیر خلفا را فقط «سَوَّاهُ ونَفَخَ فِيهِ من رُوحِهِ» (او را سامان داد و از روح خود در او دمید) و در مورد او نگفت که به او «کن» گفت، مگر در آیه جامع که می‌فرماید: «إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ» (همانا سخن ما برای چیزی هنگامی که اراده‌اش کنیم، این است که به آن بگوییم: باش). پس به آنچه تو را بر آن آگاه ساختم، توجه کن.\n\nپس از مرتبه کمالی که خداوند به خلفا از مردم داده بود، کاستی گرفت. و هنگامی که خداوند فلک اطلس را که فلک بروج است، و آن سخن اوست: «وَالسَّماءِ ذاتِ الْبُرُوجِ» (سوگند به آسمان دارای برج‌ها)، به دوازده قسمت تقسیم کرد و خداوند تعالی در آسمان بروج امر آن را وحی کرد، پس برای هر برجی در آن امری است که با آن از سایر برج‌ها متمایز می‌شود. و خداوند برای این برج‌ها اثری از امر وحی شده الهی در آنچه پایین‌تر از این آسمان است از عالم ترکیب قرار داد. و انسان از جهت جسم و طبیعتش از عالم ترکیب است، و او زبده چکیده طبیعت است که با حرکت افلاک ظاهر شد. پس او چکیده‌ای است که لطیف‌تر از آن در شیر نیست، بلکه روح شیر است. اگر از آن خارج شود، عالم مانند سبوس باقی می‌ماند. پس او در آن است نه در آن، زیرا او به قوه از آن متمایز است و از آن است، زیرا انسان از عالم خارج نشده است، اگرچه زبده چکیده عالم است. زیرا اگر از آن جدا می‌شد، عالم ارزشی نداشت، مانند شیری که اگر زبده از آن خارج شود، استحاله می‌یابد و قیمتش کم می‌شود و خیر آن که مطلوب بود، از بین می‌رود. و به خاطر آن زبده بود که شیر به کار می‌رفت و قدرش بزرگ می‌شد.\n\nپس هنگامی که خداوند حکم کرد که این برج‌ها در عالمی که تحت احاطه آسمان این برج‌هاست، اثری داشته باشند، خداوند در نشأت این انسان دوازده پذیرنده (قابل) قرار داد که با آن‌ها این آثار را می‌پذیرد. پس انسان کامل (الإنسان الكامل) با آن‌ها ظاهر می‌شود. و این برای انسان حیوانی نیست، اگرچه او در پذیرش این آثار از سایر حیوانات کامل‌تر است، اما نسبت به پذیرش انسان کامل (الإنسان الكامل) ناقص است.\n\nاز آن دوازده مورد، چسبیدن آن به عالم است هنگامی که بر آن اندازه گرفته شد، و چسبیدن آن به حضرت اسماء الهی. و با این، کمال برای این نفس صحیح شد. و این مجاورت بر سه مرتبه است:\nیکی از آن‌ها مرتبه اختصاص است، و آن در انسان حیوانی است به دلیل آنچه از حقایق عالم به دست می‌آورد، و در کامل نیز چنین است، و به دلیل آنچه از اسماء الهی به آن اختصاص یافته است، هنگامی که به حکم مطابقت با اندازه‌گیری الهی عنایتی بر او اطلاق شد، و به دلیل اینکه او سایه است، و هیچ چیز چسبنده‌تر از سایه به کسی که از اوست، نیست.\nو مرتبه دوم از مجاورت، مرتبه شیئیت (چیز بودن) است که رابط میان دو امر است، و آن ابزارهایی است که با آن‌ها آنچه از انسان تکوین می‌یابد، ظاهر می‌شود. پس انسان حیوانی با انسان کامل (الكامل) در ابزارهای صنعتی که با آن‌ها به مصنوعاتی که با دست انجام می‌شود، می‌رسد، مشترک است. و کامل بر او با فعل به همت می‌افزاید. پس ابزارهای او، همت اوست. و این برای او به منزله اراده الهی است که اگر بر ایجاد چیزی توجه کند، محال است که آن شیء مراد واقع نشود.\nو مرتبه سوم، اتصال به حق (الحق) است. پس با این اتصال از خود فانی می‌شود. پس حق (الحق) ظاهر می‌شود تا شنوایی و بینایی او باشد. و این همان علم ذوق نامیده می‌شود. زیرا حق (الحق) چیزی از این ابزارها نمی‌شود مگر اینکه با وجود او بسوزند. پس او باشد نه آن‌ها.\n\nو ما این را چشیده‌ایم و سوختن را حساً در ذکر خود برای خدا به واسطه خدا یافتم. پس او بود و من نبودم. پس سوختن را در زبانم حس کردم و از آن سوختن، دردی حسی حیوانی کشیدم، به دلیل سوختن حسی که در عضو رخ داد. پس در آن حالت شش ساعت یا نزدیک به آن، ذاکر خدا به واسطه خدا بودم. سپس خداوند زبانم را دوباره رویاند. پس او را با حضور با او ذکر کردم نه به واسطه او. و همینطور تمام قوا. حق (الحق) چیزی از آن‌ها نمی‌شود مگر اینکه وجود او آن قوه را بسوزاند. پس او باشد، هر قوه‌ای که باشد. و این همان سخن اوست: «كنت سمعه وبصره ولسانه ويده» (من شنوایی و بینایی و زبان و دست او بودم).\n\nو هر کس سوختن را در قوای خود مشاهده نکند و حس نکند، پس ذوقی ندارد، و این فقط توهمی از جانب اوست. و این معنای سخن او در حجاب‌های الهی است: «لو كشفها لأحرقت سبحات وجهه» (اگر آن‌ها را برمی‌داشت، انوار وجهش می‌سوزاند). پس هر قوه‌ای را که حق (الحق) اراده کند از بنده خود بسوزاند تا علم به امر از طریق ذوق برای او حاصل شود، حجابی که میان انسان از جهت آن قوه و میان حق (الحق) است، برداشته می‌شود. پس با نور وجه می‌سوزد. پس خود او خلل آن قوه را پر می‌کند. اگر شنوایی او باشد، حق (الحق) در این حالت شنوایی اوست، و اگر بینایی او باشد، همینطور، و اگر زبان او باشد، همینطور. و ما در این معنا داریم:\n> ألا إن ذكر الله بالله يحرق *** وحكمي بهذا فيه حكم محقق‏\n> (آگاه باشید که ذکر خدا به واسطه خدا می‌سوزاند *** و حکم من در این، حکمی محقق است.)\n> فإني ورب الواردات طعمته *** فحكمي عليه أنه الحق يصدق‏\n> (پس من، سوگند به پروردگار واردات، آن را چشیدم *** پس حکم من بر آن این است که حق (الحق) راست می‌گوید.)\n\nحق (الحق) در حدیث صحیح فرمود: «كنت سمعه وبصره» (من شنوایی و بینایی او بودم).\n\nپس هستی خود را شنوایی بنده‌ای قرار داد که به وصف خاصی منسوب است. و این بزرگترین اتصالی است که از جانب خداوند به بنده رخ می‌دهد، آنجا که قوه‌ای از قوای او را زایل می‌کند و با هستی خود در بنده به جای آنچه زایل کرده است، قیام می‌کند، بر آنچه شایسته جلال اوست، بدون تشبیه و تکییف و حصر و احاطه و حلول و بدلیت. و امر بر همان است که گفتیم: «وَما شَهِدْنا إِلَّا بِما عَلِمْنا وَما كُنَّا لِلْغَيْبِ حافِظِينَ» (و ما شهادت ندادیم مگر به آنچه دانستیم، و ما نگهبان غیب نبودیم). و «وَسْئَلِ الْقَرْيَةَ» (و از قریه بپرس)، یعنی جماعت، «الَّتِي كُنَّا فِيها» (که در آن بودیم)، یعنی اهل الله که به این طریقه از بندگان خدا وصف شده‌اند، کسانی که به نوافل خیرات قیام کردند و بر آن‌ها مداومت ورزیدند و با آن‌ها به سوی خدا روی آوردند. و خداوند ما را با عصمت در اعتقاد و قول و عمل تأیید کند، همانا او ولی رحمت است.\n\nاثر دوم از دوازده اثر این است که دو مَثَل لغوی، لازم نیست که با وصف هر یک از آن‌ها به مثلیت برای صاحب مماثلش، در صفات نفس مشترک باشند. زیرا مثلیت، لغوی و عقلی است. مثلیت عقلی آن است که با آن در صفات نفس مشترک می‌شوند، و مثلیت لغوی با کمترین شباهت در امری، مَثَل آن در آن امر می‌شود. پس مَثَل، حکم مَثَل خود را دارد از آن جهت که در آن مَثَل اوست و پذیرای آن است.\n\nو میان بنده انسانی کامل (الإنساني الكامل) و حق (الحق) در «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست) چیزی نیست جز پذیرش او برای تمام اسماء الهی که در دست ماست و با آن‌ها خلافت او صحیح شد و بر ملائکه برتری یافت.\n\nپس خلیفه اگر در میان کسانی که بر آن‌ها خلیفه است، با احکام کسی که او را خلیفه کرده و صورت او در تصرف در آن، ظاهر نشود، خلیفه او نیست. همانطور که خلیفه، کسی را که خلیفه کرده است، در مال و تمام احوال خود وکیل گرفته است. پس او در آنچه حق (الحق) او را در آن خلیفه کرده است از تصرف در مستخلَف علیه، جز با نظر وکیل خود تصرف نمی‌کند. پس او مستخلَف به واسطه مستخلِف است. پس استخلاف بنده از پروردگارش هنگامی که او را وکیل گرفته است، خلافتی مطلق و وکالتی تفویض شده و دوره‌ای است. و استخلاف پروردگار از بنده خود، خلافتی مقید است بر حسب آنچه ذات و نشأت او اقتضا می‌کند.\n\nپیامبر (صلی الله علیه و سلم) به پروردگار عز و جل خود هنگامی که سفر می‌کرد، می‌فرمود: «أنت الصاحب في السفر والخليفة في الأهل» (تو همراه در سفر و خلیفه در خانواده هستی).\n\nپس او را خلیفه نامید. و خداوند تعالی به هر معلومی از موجود و معدوم سوگند خورده است، پس فرمود: «فَلا أُقْسِمُ بِما تُبْصِرُونَ وما لا تُبْصِرُونَ» (پس سوگند می‌خورم به آنچه می‌بینید و آنچه نمی‌بینید). پس به نفس خود و به تمام معلومات سوگند خورده است. آیا ما می‌توانیم به آنچه خداوند به آن سوگند خورده است، سوگند بخوریم، یا این بر ما ممنوع است؟ پس اگر ممنوع باشد، ما در آنچه بر ما ممنوع است، خلیفه نخواهیم بود.\n\nو به آنچه سوگند خورده می‌شود، ممکن است به صورت مضاف یا مفرد سوگند خورده شود. مفرد مانند: «والله لأفعلن کذا» (به خدا سوگند که چنین خواهم کرد). و مضاف مانند سخن عایشه (رضی الله عنها) در سوگندش: «ورب محمد» (سوگند به پروردگار محمد). پس مضاف در مضاف‌الیه در ذکر به سوگند وارد شد. بر این اساس، انسان کامل (الإنسان الكامل) به هر معلومی سوگند می‌خورد، چه اسم را ذکر کند و چه ذکر نکند. و این یکی از تأویلات وجوه سوگند خوردن خداوند به اشیاء است، مانند سخن خدای تعالی: «وَالشَّمْسِ وَالضُّحى‏» (سوگند به خورشید و چاشتگاه) و «وَالتِّينِ» (سوگند به انجیر). یعنی: و رب الشمس و رب الضحی و رب التین. پس او جز به نفس خود سوگند نخورده است. پس سوگندی جز به خدا نیست. و غیر از آن از سوگندها ساقط است و با آن در مورد سوگند خورده شده، یمینی منعقد نمی‌شود.\n\nو به همین دلیل خدای تعالی فرمود: «لا يُؤاخِذُكُمُ الله بِاللَّغْوِ في أَيْمانِكُمْ» (خداوند شما را به خاطر سوگندهای بیهوده مؤاخذه نمی‌کند). و لغو، ساقط است. پس معنای آن این است که خداوند شما را به خاطر سوگندهایی که کفاره در آن‌ها ساقط شده است، هنگامی که حنث کنید، مؤاخذه نمی‌کند، «وَلَكِنْ يُؤاخِذُكُمْ بِما عَقَّدْتُمُ الْأَيْمانَ» (بلکه شما را به خاطر سوگندهایی که محکم بسته‌اید، مؤاخذه می‌کند). پس هنگامی که عقد (بستن) با قلب هنگام سوگند ساقط شد، کفاره هنگام حنث ساقط می‌شود. و اختلافی میان علما نیست که کفاره در سوگندهای مذکور در قرآن، در سوگند به خداست نه به غیر او. و سوگندها را با اضافه و الف و لام معرفه آورده است. و از پیامبر (صلی الله علیه و سلم) نهی از سوگند به غیر خدا صحیح شده است.\n\nپس شایسته است که خلیفه با اراده کسی که او را خلیفه کرده است، در آنچه او را در آن خلیفه کرده است، باشد. زیرا خداوند می‌فرماید: «وَالله غالِبٌ عَلى‏ أَمْرِهِ» (و خداوند بر امر خود غالب است). و صورت ممکن است در زبان، امر و شأن باشد.\n\nپس سخن او که «إن الله خلق آدم على صورته» (خداوند آدم را بر صورت خود آفرید)، یعنی بر امر و شأن خود. پس خداوند بر امر خود غالب است، یعنی بر کسی که او را به صورت خود (یعنی به امر خود) ظاهر کرده است. زیرا او حکم عزل در او را دارد، با بقای نشأت او. پس این به تو نشان می‌دهد که منظور از صورت، نشأت نبوده است، بلکه منظور امر و حکم بوده است. پس عالم از سنت‌های علم و مراد خداوند در اشیاء عدول نمی‌کند.\n\nو این امر به تنهایی به طور خاص از آثار جوزاء (Gemini) است، و آن برجی هوایی است. پس امر با\n\nسخن پیامبر (صلی الله علیه و سلم) مطابقت کرد که فرمود: «إن الرب كان في عماء» (همانا پروردگار در عماء بود)، با مد و همزه، و آن ابر رقیقی است که بالای آن هوا و زیر آن هواست. پس احاطه هوا را از این عماء نفی کرد و متعرض نفی هوا نشد. پس امر از آن خداست. پس نسبت عماء به او اولی‌تر از نسبت هوا نیست. پس نفی احاطه هوایی به این عماء، ناگزیر شامل نفی مجموع است نه جمیع.\n\nو ما در نفس رحمانی (النفس الرحماني) حدیث عماء و جوزاء را بیان کردیم، که میان آب و خاک است، زیرا جوزاء میان ثور و سرطان است، مانند آدم که میان آب و گِل است. و به همین دلیل حکم هوا عام‌تر از سایر ارکان بود، زیرا در هر چیزی نفوذ می‌کند و در هر چیزی سلطه دارد. زمین را می‌لرزاند و آب را به موج درمی‌آورد و جاری می‌کند و آتش را شعله‌ور می‌سازد. و حیات هر نفس تنفس‌کننده‌ای به اوست. و تولید در درختان از اوست، و آن بادهای بارورکننده (الرياح اللواقح) است.\n\nاین اثر دوم از اقسام دوازده‌گانه است. اما اثر سوم، آن چیزی است که در عالم ظاهر می‌شود و می‌توان از آن بی‌نیاز بود، و تنها با وجود بی‌نیازی از آن ظاهر شد تا مرتبه قوه دوگانگی ظاهر شود، تا گفته نشود که در هستی (الوجود) جز خدا نیست، با وجود ظهور ممکنات و مخلوقات. پس دانسته می‌شود که «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (همانا خداوند از جهانیان بی‌نیاز است) با وجود جهانیان. و بی‌نیازی از آن معقول است. پس این امر در عالم آمد که می‌توان از آن بی‌نیاز بود، با وجود آن، تا غنای حق (الحق) از عالم بیان شود. پس خداوند آن را در عالم بیهوده قرار نداد. پس وجود آن را با بی‌نیازی از آن، این علم را داد، و آن علم نافع است. و نظم خاصی دارد که شبیه نظم آنچه از آن بی‌نیاز نیست، می‌باشد، مانند وجود فرزند از نکاح، در حالی که از آن بی‌نیاز است. دلیل ما نکاح اهل بهشت در بهشت و نکاح عقیم است.\n\nو اما اثر چهارم، مانند سخن پیامبر (صلی الله علیه و سلم) است که فرمود: «لا تقوم الساعة وعلى وجه الأرض من يقول الله الله» (قیامت برپا نمی‌شود در حالی که بر روی زمین کسی باشد که بگوید: الله، الله).\n\nپس آن را دو بار آورد و به یکی اکتفا نکرد. و با این، ثابت کرد که ذکر بر انفراد است و آن را به چیزی وصف نکرد. و هاء اسم را ساکن کرد. و این تفسیری است برای سخن خدای تعالی: «اذْكُرُوا الله ذِكْراً كَثِيراً» (خداوند را ذکر کنید، ذکری بسیار). و آن تکرار این اسم است. و سخن او: «وَلَذِكْرُ الله أَكْبَرُ» (و قطعاً ذکر خدا بزرگتر است). و جز اسم «الله» را به طور خاص ذکر نکرد. و او مأمور از جانب خداست که آنچه بر مردم نازل شده است را برای آنان بیان کند.\n\nو اگر نبود که گفتن انسان «الله، الله» حافظ عالمی است که این ذکر در آن است، زوال آن با زوال جهانی که از آن زایل شده است (یعنی دنیا) قرین نمی‌شد. و این اسم، ذکر ما و ذکر شیخ ما بود که نزد او وارد شدیم. و در فواید اذکار، چیزی بزرگتر از فایده آن نیست. پس هنگامی که حق (الحق) فرمود: «وَلَذِكْرُ الله أَكْبَرُ» (و قطعاً ذکر خدا بزرگتر است) و صورت ذکر دیگری را با وجود کثرت اذکار به اسماء الهی ذکر نکرد، اهل الله آن را به تنهایی ذکر خود قرار دادند. پس در قلب‌هایشان امری عظیم برایشان نتیجه داد که غیر آن از اذکار نتیجه نداد. زیرا برخی از علمای رسوم، این ذکر را به دلیل بالا بودن فایده آن نزد خود، ندیدند. زیرا هر مبتدایی ناگزیر از خبر است. به او گفته می‌شود: این در لفظ لازم نیست، بلکه ناگزیر از فایده است. و آن فایده در ذاکر به آن، هنگامی که آن را به این کلمه خاص ذکر کرد، ظاهر شد. پس در باطن او از نور کشف (الکشف) چیزی نتیجه داد که غیر آن نتیجه نمی‌دهد. بلکه برای آن خبری ظاهر است، نه در لفظ، مانند اضافه به تنزیه یا ثنا به فعل. و معلوم است که اگر امری ذکر شود، سپس امری ذکر شود و به طریق تأکید تکرار شود، فایده‌ای می‌دهد که کسی که این حکم را ندارد و قصد آن را نکرده است، نمی‌دهد. پس در طلب امور سریع‌تر و موفق‌تر است. پس در عالم به طور کلی بیهودگی نیست.\n\nو اما اثر پنجم، و آن شبیه چهارم است، همانطور که قسمت حمل از برج‌ها شبیه قسمت اسد و قوس و غیره است، اگرچه این عین آن نیست و هر یک از آن‌ها به امری منفرد است که برای دیگری نیست، با وجود مماثلت با آن، زیرا بر مَثَل آن است. به همین دلیل شباهت در آثار واقع شد، همانطور که در اصل واقع شد. و آن هر چیزی است که در عالم واقع می‌شود و معنای صحیحی غیر از ظهور خود می‌دهد. و اگر از عالم ساقط می‌شد، آن امری که این معنا را در آن داده بود، مختل نمی‌شد، اما ناگزیر از آن امری که وجودش می‌دهد، کاسته می‌شود. و این‌ها عوارض عطایا نامیده می‌شوند که سقوط و عدم وقوع آن‌ها به حقیقت آنچه از آن معدوم شده است، خللی وارد نمی‌کند، اگرچه معنایی دارند، مانند وجود لذت جماع بدون جماع. پس فایده‌ای که جماع برای آن بود، حاصل شد، اما برای حصول آن با جماع، معنایی است که جز با جماع حاصل نمی‌شود، زیرا مقصود از نکاح، التذاذ و وجود لذت است. و لذت یافت شده است. پس سقوط جماع به لذت خللی وارد نکرد. و به همین دلیل خداوند ما را با حورالعین تزویج کرد.\n\nو اما اثر ششم، آن چیزی است که به صاحب همت مربوط می‌شود، هنگامی که می‌خواهد چیزی از او تکوین یابد که به عادت جز با ابزار واقع نمی‌شود، پس آن را با همت خود انجام می‌دهد نه با ابزار، و در زمانی با ابزار. زیرا خداوند قادر است که آدم را ابتدا بدون تخمیر و بدون توجه دو دست و بدون تسویه و تعدیل برای نفخ روح، بیافریند، بلکه «يَقُولُ لَهُ كُنْ فَيَكُونُ» (به او می‌گوید: باش، پس می‌شود). با این حال، گِل او را با دو دست خود تخمیر کرد و او را سامان داد و معتدل ساخت، سپس روح را در او دمید و اسماء را به او آموخت. و اشیاء را بر ترتیبی ایجاد کرد. همانطور که اگر می‌خواست، ما را به علم به وجود خود از اسماء خود بی‌نیاز می‌ساخت، اما در هر زبانی که در عالم قرار داد، به نامی خوانده می‌شود. پس در عرب به «الله» و در فارس به «خدای» و در حبشه به «واق» و در هر زبانی برای او اسم‌هایی است، با وجود علم به وجود او. و فایده آن را با بی‌نیازی از آنچه ظاهر شد و اکتفا، ظاهر کرد.\n\nو از این باب است آنچه از افعال از ما ظاهر می‌شود، با اینکه جایز است که خداوند آن‌ها را نه با دست‌های ما انجام دهد، اما این فعل در شاهد جز با دست‌های ما به وقوع نپیوست. پس اراده کرد که جسم را از مکانی به مکان دیگر حرکت دهد، پس در ما اراده طلب انتقال قرار داد. پس با حرکتی اختیاری که آن را از نفس خود تعقل می‌کنیم، برخاستیم و منتقل شدیم. و انتقال در اصل، خلق خداست، اما از اراده حادث اختیاری به وجود آمد، برخلاف حرکت مرتعش که اضطراری است. پس انسان مختار، در اختیار خود نزد سلیم العقل مجبور است.\n\nسپس هیچ حقیقتی نیست که حکم آن جز با محل (Locus) ظاهر نشود. پس جز با محل ظاهر نمی‌شود. پس میان آنچه جایز است و آنچه جایز نیست، تفاوت می‌گذارد. پس حرکت محال است که وجود یابد مگر در متحرک.\n\nو از این باب است نزول او تعالی به آسمان دنیا در ثلث باقی مانده از شب، با اینکه او با ماست هر کجا که باشیم. پس این حکم نزولی است که با فعلی ظاهر شده است که حصول آن مراد بدون این نزول ممکن است. اما اگر آن را به سخن خدای تعالی اضافه کنی: «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (همانا خداوند از جهانیان بی‌نیاز است)، نزولی است که ناگزیر از مرتبه غنی است، زیرا این نزول را نمی‌پذیرد مگر برای نسبت الهی که ذات او اقتضا می‌کند. پس جز با نزول نبوده است. پس بفهم. زیرا اضافات از حکم ذاتی برخوردارند که غیر مضاف ندارد. و حقایق دگرگون نمی‌شوند. و شأن، تنها ظهور حکم در محکوم است. پس از یک جهت ذات او آن را می‌طلبد و از جهت دیگر ذات او تعالی آن را نمی‌طلبد، مانند خالق که خلق را می‌طلبد و عالم که معلوم را می‌طلبد.\n\nو اما اثر هفتم، وجود ظرفیت (ظرف بودن) در هستی (الكون) است. آیا آن در هستی (الكون) اصل است، سپس ما آن را بر حق (الحق) حملی شرعی کردیم، یا آن در حق (الحق) است بر حسب آنچه شایسته جلال اوست و در عالم به فعل ظاهر شده است؟\n\nمانند سخن رسول خدا (صلی الله علیه و سلم) به زن سیاهپوست که پرسید: «أين الله؟» (خدا کجاست؟) پس او به آسمان اشاره کرد، در حالی که لال بود.\n\nخدای تعالی فرمود: «وَالله بِكُلِّ شَيْءٍ عَلِيمٌ» (و خداوند به هر چیزی داناست). و صیغه «فعیل» به معنای فاعل و به معنای مفعول می‌آید، مانند «قتیل» و «جریح». پس «علیم» به معنای «عالم» (دانا) و به معنای «معلوم» (دانسته شده) است. و هر دو وجه در این آیه جایز است، اگر «باء» در «بکل» به معنای «فاء» باشد، پس او در هر چیزی معلوم است. و «وَبِكُلِّ شَيْءٍ مُحِيطٌ» (و به هر چیزی احاطه دارد)، یعنی برای او در هر چیزی احاطه‌ای است بر آنچه آن معلوم بر آن است. و این جز برای خدا یا کسی که خدا او را آگاه کرده است، نیست.\n\nو اما اثر هشتم، سخن خدای تعالی است: «فَسْئَلْ بِهِ خَبِيراً» (پس از او بپرس، که او آگاه است). یعنی اگر خواستی از حقیقت امری بپرسی، از کسی بپرس که در آن ذوق دارد. و از کسی که در اشیاء ذوق ندارد، نپرس، زیرا او جز به اسم آنچه از آن پرسیدی، تو را خبر نمی‌دهد، نه به حقیقت آن.\n\nپس بنده نباید از خدا پرسیده شود، زیرا او در الوهیت ذوقی ندارد و به آن خبره نیست. پس نزد او از آن جز اسماء خاص نیست. پس از خدا درباره خدا بپرس و از بنده درباره عبودیت بپرس. پس نسبت عبودیت به بنده، نسبت الوهیت به خداست. پس خبر دادن حق (الحق) از عبودیت، خبر دادن برای اوست، و خبر دادن بنده از الوهیت، خبر دادن بنده است.\n\nو به همین دلیل وارد شده است: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت).\n\nپس خود را با معرفت ذوق می‌شناسد. پس در نفس خود برای الوهیت مدخلی نمی‌یابد. پس به ضرورت می‌داند که اگر خداوند شبیه او بود یا مَثَل او بود، او را در نفس خود می‌شناخت. و با افتقار خود می‌داند که کسی هست که به او افتقار می‌شود و ممکن نیست که شبیه او باشد. پس پروردگارش را شناخت که مَثَل او نیست، اگرچه خداوند او را خلیفه قرار داده و بر صورت ایجاد کرده است. پس ترسانده می‌شود و امید داده می‌شود و اطاعت می‌شود و عصیان می‌شود. و ما معنای آن را در این آثار از این باب بیان کردیم.\n\nو اما اثر نهم، و آن سخن او در آفرینش آسمان‌ها و زمین است که: «إِنَّهُ ما خَلَقَهُما إِلَّا بِالْحَقِّ» (همانا آن‌ها را جز به حق (الحق) نیافرید)، یعنی آن‌ها را جز برای خود تعالی جلالش و تبارک اسمش نیافرید، زیرا فرمود: «وَإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ» (و هیچ چیزی نیست مگر اینکه با حمد او تسبیح می‌گوید). پس عالم را جز برای خود تعالی نیافرید. و به همین دلیل در مورد کسانی که می‌دانست در نشأت آن‌ها عزت قرار داده است، یعنی جن و انس، فرمود: «وَما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای اینکه مرا بپرستند)، یعنی تا در برابر من تذلل کنند، به دلیل عزتی که در آن‌ها ظاهر شد و ادعای الوهیت و خودپسندی. پس از لطف خداوند به آن‌ها این است که آن‌ها را بر آنچه در آفرینش آن‌ها اراده کرده است، آگاه سازد. پس هر کس آگاه شود، از کثیری است که برای خدا سجده می‌کند، و هر کس آگاه نشود، از کثیری است که عذاب بر او واجب شده است.\n\nو اما سخن او در این آیه: «وَما خَلَقْتُ الْجِنَّ والْإِنْسَ» (و جن و انس را نیافریدم)، ممکن است منظور او انسان به تنهایی باشد از آن جهت که ظاهر و باطنی دارد. پس از آن جهت که ظاهر دارد، «انس» است، از «آنست الشیء» (چیزی را دیدم). خدای تعالی در حق موسی (علیه السلام) خبر می‌دهد: «إِنِّي آنَسْتُ ناراً» (همانا آتشی دیدم). و جن، باطن انسان است، زیرا از او پوشیده است. پس گویا فرموده است: و آنچه از انسان ظاهر شد و آنچه پنهان ماند را نیافریدم مگر برای اینکه مرا بپرستند، ظاهراً و باطناً. زیرا منافق او را ظاهراً می‌پرستد نه باطناً، و مؤمن او را ظاهراً و باطناً می‌پرستد، و کافر معطّل او را نه در ظاهر و نه در باطن نمی‌پرستد. و برخی از عاصیان او را باطناً می‌پرستند نه ظاهراً. و قسم پنجمی نیست.\n\nو ما جن را که خداوند آن‌ها را از آتش آفرید، از این آیه خارج نکردیم و آن را تنها در انسان قرار ندادیم از جهت آنچه از او ظاهر شد و آنچه پنهان ماند، مگر به دلیل سخن خداوند هنگامی که سجده را ذکر کرد، که تمام کسانی را که برای او سجده می‌کنند، از کسانی که در آسمان‌ها و کسانی که در زمین هستند، ذکر کرد. و در مورد مردم فرمود: «وَكَثِيرٌ من النَّاسِ» (و بسیاری از مردم). پس آن‌ها را عمومیت نداد. و شیاطین در سخن او: «من في الْأَرْضِ» (کسانی که در زمین هستند) وارد شدند. و این به دلیل آن است که شیطان که از رحمت دور است، هنگامی که انسان را به کفر امر می‌کند و او کافر می‌شود، می‌گوید: «إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ» (من از تو بیزارم، من از خداوند، پروردگار جهانیان می‌ترسم). پس خداوند معرفت شیطان به پروردگارش و ترس او از او را برای ما بیان کرد. به همین دلیل، منصرف کردن جن در این آیه به آنچه از انسان پنهان است، اولی‌تر از اطلاق آن بر جن است. و خداوند داناتر است.\n\nو اما اثر دهم، آن چیزی است که در عالم از بیان رسولان که مترجم از جانب خدا هستند، ظاهر شد، آنچه را که خداوند بر بندگانش نازل کرد، با وجود نزول کتاب‌هایش. پس به نزول کتاب‌های الهی اکتفا نکرد تا اینکه رسولان آنچه در آن‌هاست را بیان کنند، به دلیل اجمالی که در عبارت است و نیازی که به تفصیل دارد. و عبارت جز با عبارت تفصیل داده نمی‌شود. پس رسولان به جای حق (الحق) در تفصیل آنچه او تفصیل نداده و اجمال کرده است، قرار گرفتند. و آن سخن خدای تعالی است: «لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ» (تا برای مردم آنچه بر آنان نازل شده است را بیان کنی)، پس از ابلاغ آنچه بر ما نازل شده است. و این حقیقتی است که در عالم جاری است. و اگر نبود، کتاب‌ها شرح داده نمی‌شدند و از زبانی به زبان دیگر و از حالی به حال دیگر ترجمه نمی‌شدند. خدای تعالی فرمود: «فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله» (پس او را پناه ده تا کلام خدا را بشنود)، و آن همان چیزی است که به طور خاص نازل شده است. اما آنچه رسول تفصیل داده و بیان کرده است، تفصیل آنچه نازل شده است، نه عین آنچه نازل شده است. و بیان با عبارت خاصی واقع می‌شود و با هر چیزی که باشد، تعقل می‌شود.\n\nو اما اثر یازدهم و دوازدهم، آن‌ها دو مرتبه از مراتب سه‌گانه‌ای هستند که در ابتدای این آثار ذکر کردیم، و آن دو مرتبه اتصال به حق (الحق) و مرتبه سبب رابط میان دو امر هستند. و این پیشتر آمد.\n\nپس اگر خداوند بخواهد، علومی را که در این منزل است، ذکر می‌کنیم. از جمله آن، علم سبب موجب بقای مؤمن در نعمت در سرای نعمت است. و در آن، علم اسباب رستگاری و نجات از جهل که بدترین بدی‌هاست، وجود دارد. و در آن، علم آنچه موطن سزاوار آن است از اموری که سعادت انسان با آن‌هاست، وجود دارد، و ممکن است در موطن دیگری ظاهر شود و سعادت ندهد. و در آن، علم هر آنچه عین آن ثابت شده است، آیا حکم آن ساقط می‌شود یا فقط حکم برخی از آنچه عین آن ثابت شده است، ساقط می‌شود، یا به طور مطلق حکمی برای آن ساقط نمی‌شود، بلکه حکم خاصی از آن ساقط می‌شود نه تمام حکم؟ پس آیا باید به آنچه حکم آن ساقط شده است، مشغول شد یا نباید به آن مشغول شد، مانند لغو سوگند که کفاره در حنث از آن ساقط شده است. و در آن، علم آنچه از افزایش ظاهر می‌شود، هنگامی که فعل به وجه شرعی که آن را واجب می‌کند یا کرم خلق عقلی، به مخلوق اضافه شود. و در آن، علم مَلَأ (پر) و خَلَأ (خالی) است. و در آن، علم انجام آنچه شایسته است و ترک آنچه شایسته نیست، وجود دارد. و در آن، علم تجاوز از حدود اشیاء است. و آیا حد داخل در محدود است، پس تجاوز نیست؟ و اگر داخل است، صورت دخول آن چگونه است؟ و فرق میان سخن او: «وَأَيْدِيَكُمْ إِلَى الْمَرافِقِ» (و دست‌هایتان را تا آرنج‌ها) و سخن او: «أَتِمُّوا الصِّيامَ إِلَى اللَّيْلِ» (روزه را تا شب کامل کنید).\n\nو این حدی است با کلمه‌ای معین که در یکی خروج حد از محدود و در دیگری دخول حد در محدود را اقتضا می‌کند. و این امر بر معرفت حد در ذات خود که چیست، مبتنی است؛ زیرا حد را حدی است و تسلسل نمی‌یابد. و در آن علم عهود و امانات است و اینکه امانات چیستند.\n\nو عهود و عقودی که به آنها امر شده‌ایم چیستند؟ و آیا عهد الهی حکم عهد مخلوق را دارد یا خیر؟ و در آن علم برتری میان مال موروثی و مال اکتسابی است و اینکه با کدام یک از این دو مال، لذت بیشتری برای صاحبش حاصل می‌شود. و این علم ذوق است و با اختلاف مزاج (مزاج) متفاوت می‌شود؛ زیرا برخی بر تنبلی سرشته شده‌اند و مال میراث نزد آنان لذیذتر است، چون در آن عملی انجام نداده‌اند. و از جمله مردم، اهل فتوح (اهل فتوح) هستند. و برخی از مردم در ذات خود بر ریاست سرشته شده‌اند، پس از مال اکتسابی لذتی می‌برند که از مال موروثی نمی‌برند، به دلیل تلاشی که در آن برای اظهار قدرت خود از طریق کسب انجام داده‌اند.\n\nو در آن علم توقف مسببات بر اسبابشان است؛ آیا این توقف ذاتی است یا اختیاری از جانب خداوند؟ و در آن علم استحالات (استحالات) از حالی به حال دیگر است؛ آیا اعیان (أعیان) از آن احوال تبعیت می‌کنند و از عینی به عین دیگر استحاله می‌یابند، یا عین (عین) یکی است و استحالات در احوال رخ می‌دهند؟ و مذاهب در این باره مختلف است، پس حق (الحق) در میان آنها کجاست؟\n\nو در آن علم حفظ صانع (صانع) برای صنعتش است؛ آیا حفظ او برای صنعتش است یا برای عین مصنوع؟ زیرا صنعت برای صانع گاهی اکتسابی است، مانند صنعت خیاطی و غیر آن از اموری که جز با یادگیری حاصل نمی‌شود. و گاهی صنعت فطری است نه با تفکر، مانند صنعت حیوانات همچون زنبور عسل و عنکبوت‌ها که همه با جعل (جعل) الهی است. و گاهی ذاتی است، مانند نسبت دادن صنعت به خداوند. و با این حال، معنای این سخن خداوند چیست: «يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ» (کار [جهان] را تدبیر می‌کند و آیات را تفصیل می‌دهد) که تدبیر را به خود نسبت داده است؟\n\nو در آن علم حکمت اموری است که در کون (کون) ثابت می‌مانند و اموری که ثابت نمی‌مانند. و مَثَلی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در این باره زدند، در مورد آنچه با خود آوردند، به باران و زمین‌هاست؛ در مورد کسی که خداوند او را به آنچه آورده نفع رسانده و کسی که نفع نرسانده است.\n\nو در آن علم وجود بالاتر از پایین‌تر است؛ اما در معانی، مانند وجود علم ما به خداوند از وجود علم ما به خودمان. و در آن علم حکمی است که نیابت (نیابة) در امر برای نایب دارد. و در آن علم معرفت شیء است به آنچه از آن حاصل می‌شود، نه به خود آن.\n\nو در این باب، نامیدن شیء به نام شیء دیگر است، اگر مجاور آن باشد یا به سببی از آن حاصل شده باشد یا آن را در بر بگیرد. و در آن علم توحید (التوحید) مطلوب از عالم (عالم) چیست. و در آن علم فضائلی است که حسد در آنها واقع می‌شود؛ آیا آنها فضائل برای خودشان هستند یا به حکم عرف و وضع؟\n\nو در آن علم چیزی است که هر شیئی به واسطه آن باقی می‌ماند، با تفصیل و اختلاف؛ زیرا هر محافظی (واقی) از چیزی، محافظ از چیز دیگر نیست. و امر جامع برای هر وقایه‌ای چیست؟ و در آن علم فایده وجود امثال (أمثال) است، با وجود کفایت مثال اول. و در آن علم حجاب‌های (الحجب) حائل میان مردم و علم به اشیاء است.\n\nو در آن علم کسی است که جهل (الجهل) را علم قرار داده است؛ آیا در نفس خود قطع به آن می‌یابد یا نفسش او را در آن متزلزل می‌سازد، تا آنکه اگر در نفس خود نظر را محقق سازد، تفاوت میان آنچه از آن موافق علم است و آنچه موافق نیست را می‌یابد؟ و این تنها در جهل خاصه است. اما در ظن (الظن) و شک (الشک)، حکم آنها این حکم نیست؛ زیرا گمان‌کننده به گمان خود علم دارد و شک‌کننده به شک خود علم دارد، در حالی که جاهل ممکن است به جهل خود علم نداشته باشد؛ زیرا کسی که به جهل خود علم داشته باشد، برای او علمی است که می‌توان آن را توصیف کرد.\n\nو در آن علم حکمت تأیید (التأیید) است؛ آیا آن عنایت (عنایة) است یا اقامه حجت (إقامة حجة)؟ یا در موردی عنایت و در موردی اقامه حجت است، با توجه به حال دو شخص؟ و در آن علم چیزی است که به عالم (عالم) به شیء نسبت داده می‌شود، در حالی که علم او به آن مستحق این نسبت نیست، و با این حال آن را به خود نسبت می‌دهد؛ مانند امیدواری (الترجی) از عالمی که به وقوع یا عدم وقوع آنچه امید دارد، علم دارد. پس رجاء (الرجاء) چگونه با علم (العلم) مرتبط می‌شود؟\n\nو در آن علم حکمت کسی است که کار نیکوتر را انجام می‌دهد، در حالی که به ثمره آن قطع ندارد؛ آیا این به علم او به جهل کسی که به او احسان شده، به مرتبه احسان بازمی‌گردد، یا به نفس خودش بازمی‌گردد، به دلیل اینکه نمی‌داند حق احسان را در آن ادا کرده است؟\n\nو در آن علم حکمت استمرار عذاب و ضرر بر زیان‌دیدگان از صاحبان دردهاست؛ آیا این از جهت رحمت (الرحمة) به آنهاست یا خیر؟\n\nو در آن علم کسی است که امر را در غیر آنچه برای آن وضع شده به کار برده، یا آن را جز در آنچه برای آن وضع شده به کار نبرده است، در حالی که آن امر وجوه متضاد بسیاری دارد. پس چه چیزی از حکم آنچه برای آن است خارج شده است؟ مانند بیماری که یک وجه آن به سوی صبر (الصبر) و وجه دیگرش به سوی بی‌قراری (الضجر) است.\n\nو در آن علم یادآوری فراموشکار (الناسی) است؛ آیا یادآوری‌اش به او نفع می‌رساند یا خیر؟ و در آن علم صادقی است که کاذب نامیده می‌شود. و در آن علم استعاذه (الاستعاذة) است و اینکه به چه چیزی و از چه چیزی پناه برده می‌شود و کجا ستوده می‌شود و در چه موضعی نکوهیده می‌گردد.\n\nو در آن علم چیزی است که از اعتراف (الاعتراف) نفع می‌رساند و چیزی که نفع نمی‌رساند؛ زیرا برای موقعیت‌ها در اعتراف حکمی است و برای احوال نیز در آن حکمی است. زیرا برخی از مردم با اعتراف به خطا، بر آن باقی می‌مانند و برخی دیگر از آن دست می‌کشند.\n\nو در آن علم شرافت خطاب (الخطاب) و وجود التذاذ به آن است. و در آن علم حکمت وجود شک (الشک) در عالم (العالم) است. و در آن علم نجات مجتهد (المجتهد) است، چه خطا کند و چه صواب، با وجود اینکه خداوند آنچه را از آن به او داده است، به او عطا می‌کند. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 9
}