{
  "id": 28,
  "title": {
    "ar": "الباب الثامن والعشرون في معرفة أقطاب أَ لَمْ تَرَ كَيْفَ",
    "en": "Chapter Twenty-Eight: Concerning the Gnosis (معرفة) of the Poles (أقطاب) of <<أَ لَمْ تَرَ كَيْفَ>> (Have you not seen how...).",
    "ur": "باب اٹھائیس (۲۸) اقطاب (أقطاب) کی معرفت (معرفۃ) کے بیان میں، (أَ لَمْ تَرَ كَيْفَ) کے ضمن میں۔",
    "fa": "باب بیست و هشتم در معرفت اقطابِ «أَ لَمْ تَرَ كَيْفَ» (آیا ندیدی چگونه)"
  },
  "content": {
    "ar": "## (الباب الثامن والعشرون في معرفة أقطاب أَ لَمْ تَرَ كَيْفَ)\n\n\n> العلم بالكيف مجهول ومعلوم *** لكنه بوجود الحق موسوم‏\n\n\n> فظاهر الكون تكييف وباطنه *** علم يشار إليه فهو مكتوم‏\n\n\n> من أعجب الأمر أن الجهل من صفتي *** بما لنا فهو في التحقيق معلوم‏\n\n\n> وكيف أدرك من بالعجز أدركه *** وكيف أجهله والجهل معدوم‏\n\n\n> قد حرت فيه وفي أمري ولست أنا *** سواه فالخلق ظلام ومظلوم‏\n\n\n> إن قلت إني يقول الإن منه أنا *** أو قلت إنك قال الإن مفهوم‏\n\n\n> فالحمد لله لا أبغي به بدلا *** وإنما الرزق بالتقدير مقسوم‏\n\n\n### [أمهات المطالب العلمية وحملها على الحق‏]\n\n\nاعلم أن أمهات المطالب أربعة وهي هل سؤال عن الوجود وما وهو سؤال عن الحقيقة التي يعبر عنها بالماهية وكيف وهو سؤال عن الحال ولم وهو سؤال عن العلة والسبب واختلف الناس فيما يصح منها أن يسأل بها عن الحق واتفقوا على كلمة هل فإنه يتصور أن يسأل بها عن الحق واختلفوا فيما بقي فمنهم من منع ومنهم من أجاز فالذي منع وهم الفلاسفة وجماعة من الطائفة منعوا ذلك عقلا ومنهم من منع ذلك شرعا\n\n\n### [من منع إطلاق «ما» و«كيف» و«لم» على الله عقلا]\n\n\nفأما صورة منعهم عقلا أنهم قالوا في مطلب ما إنه سؤال عن الماهية فهو سؤال عن الحد والحق سبحانه لا حد له إذ كان الحد مركبا من جنس وفصل‏\nوهذا ممنوع في حق الحق لأن ذاته غير مركبة من أمر يقع فيه الاشتراك فيكون به في الجنس وأمر يقع به الامتياز وما ثم إلا الله والخلق ولا مناسبة بين الله والعالم ولا الصانع والمصنوع فلا مشاركة فلا جنس فلا فصل والذي أجاز ذلك عقلا ومنعه شرعا قال لا أقول إن الحد مركب من جنس وفصل بل أقول إن السؤال بما يطلب به العلم بحقيقة المسئول عنه ولا بد لكل معلوم أو مذكور من حقيقة يكون في نفسه عليها سواء كان على حقيقة يقع له فيها الاشتراك أو يكون على حقيقة لا يقع له فيها الاشتراك فالسؤال بما يتصور ولكن ما ورد به الشرع فمنعنا من السؤال به عن الحق لقوله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وأما منعهم الكيفية وهو السؤال بكيف فانقسموا أيضا قسمين فمن قائل بأنه سبحانه ما له كيفية لأن الحال أمر معقول زائد على كونه ذاتا وإذا قام بذاته أمر وجودي زائد على ذاته أدى إلى وجود واجبي الوجود لذاتهما أزلا وقد قام الدليل على إحالة ذلك وإنه لا واجب إلا هو لذاته فاستحالت الكيفية عقلا ومن قائل إن له كيفية ولكن لا نعلم فهي ممنوعة شرعا لا عقلا لأنها خارجة عن الكيفيات المعقولة عندنا فلا تعلم وقد قال ليس كمثله شي‏ء يعني في كل ما ينسب إليه مما نسبه إلى نفسه يقول هو على ما تنسبه إلى الحق وإن وقع الاشتراك في اللفظ فالمعنى مختلف وأما السؤال بلم فممنوع أيضا لأن أفعال الله تعالى لا تعلل لأن العلة موجبة للفعل فيكون الحق داخلا تحت موجب أوجب عليه هذا الفعل زائد على ذاته وأبطل غيره إطلاق لم على فعله شرعا بأن قال لا ينسب إليه ما لم ينسب إلى نفسه فهذا معنى قولي شرعا لا أنه ورد النهي من الله عن كل ما ذكرنا منعه شرعا وهذا كله كلام مدخول لا يقع التخليص منه بالصحة والفساد إلا بعد طول عظيم‏\n\n\n### [من أجاز إطلاق «ما» و«كيف» و«لم» على الله شرعا]\n\n\nهذا قد ذكرنا طريقة من منع وأما من أجاز السؤال عنه بهذه المطالب من العلماء فهم أهل الشرع منهم وسبب إجازتهم لذلك إن قالوا ما حجر الشرع علينا حجرناه وما أوجب علينا أن نخوض فيه خضنا فيه طاعة أيضا وما لم يرد فيه تحجير ولا وجوب فهو عافية إن شئنا تكلمنا فيه وإن شئنا سكتنا عنه وهو سبحانه ما نهى فرعون على لسان موسى عليه السلام عن سؤاله بقوله وما رب العالمين بل أجاب بما يليق به الجواب عن ذاك الجناب العالي وإن كان وقع الجواب غير مطابق للسؤال فذلك راجع لاصطلاح من اصطلح على أنه لا يسأل بذلك إلا عن الماهية المركبة واصطلح على إن الجواب بالأثر لا يكون جوابا لمن سأل بما وهذا الاصطلاح لا يلزم الخصم فلم يمنع إطلاق هذا السؤال بهذه الصيغة عليه إذ كانت الألفاظ لا تطلب لأنفسها وإنما تطلب لما تدل عليه من المعاني التي وضعت لها فإنها بحكم الوضع وما كل طائفة وضعتها بإزاء ما وضعتها الأخرى فيكون الخلاف في عبارة لا في حقيقة ولا يعتبر الخلاف إلا في المعاني وأما إجازتهم الكيفية فمثل إجازتهم السؤال بما ويحتجون في ذلك بقوله تعالى سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وقوله إن لله عينا وأعينا ويدا وإن بيده الميزان يخفض ويرفع‏\n\n\nوهذه كلها كيفيات وإن كانت مجهولة لعدم الشبه في ذلك وأما إجازتهم السؤال بلم وهو سؤال عن العلة فلقوله تعالى وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فهذه لام العلة والسبب فإن ذلك في جواب من سأل لم خلق الله الجن والإنس فقال الله لهذا السائل لِيَعْبُدُونِ أي لعبادتي فمن ادعى التحجير في إطلاق هذه العبارات فعليه بالدليل فيقال للجميع من المتشرعين المجوزين والمانعين كلكم قال وما أصاب وما من شي‏ء قلتموه من منع وجواز إلا وعليكم فيه دخل والأولى التوقف عن الحكم بالمنع أو بالجواز هذا مع المتشرعين وأما غير المتشرعين من الحكماء فالخوض معهم في ذلك لا يجوز إلا إن أباح الشرع ذلك أو أوجبه وأما إن لم يرد في الخوض فيه معهم نطق من الشارع فلا سبيل إلى الخوض فيه معهم فعلا ويتوقف في الحكم في ذلك فلا يحكم على من خاض فيه أنه مصيب ولا مخطئ وكذلك فيمن ترك الخوض إذ لا حكم إلا للشرع فيما يجوز أن يتلفظ به أو لا يتلفظ به يكون ذلك طاعة أو غير طاعة فهذا يا ولي قد فصلنا لك مآخذ الناس في هذه المطالب‏\n\n\n### [التشبيه والتنزيه من طريق المعنى‏]\n\n\nوأما العلم النافع في ذلك أن نقول كما أنه سبحانه لا يشبه شيئا كذلك لا تشبهه الأشياء وقد قام الدليل العقلي والشرعي على نفي التشبيه وإثبات التنزيه من طريق المعنى وما بقي الأمر إلا في إطلاق اللفظ عليه سبحانه الذي أباح لنا إطلاقه عليه في القرآن أو على لسان رسوله فأما إطلاقه عليه فلا يخلو إما أن يكون العبد مأمورا بذلك الإطلاق فيكون إطلاقه طاعة فرضا ويكون المتلفظ به مأجورا مطيعا مثل قوله في تكبيرة الإحرام الله أكبر وهي لفظة وزنها يقتضي المفاضلة وهو سبحانه‏\nلا يفاضل وإما أن يكون مخيرا فيكون بحسب ما يقصده المتلفظ وبحسب حكم الله فيه وإذا أطلقناه فلا يخلو الإنسان إما أن يطلقه ويصحب نفسه في ذاك الإطلاق المعنى المفهوم منه في الوضع بذلك اللسان أو لا يطلقه إلا تعبدا شرعيا على مراد الله فيه من غير أن يتصور المعنى الذي وضع له في ذلك اللسان كالفارسي الذي لا يعلم اللسان العربي وهو يتلو القرآن ولا يعقل معناه وله أجر التلاوة كذلك العربي فيما تشابه من القرآن والسنة يتلوه أو يذكر به ربه تعبدا شرعيا على مراد الله فيه من غير ميل إلى جانب بعينه مخصص فإن التنزيه ونفي التشبيه يطلبه أن وقف بوهمه عند التلاوة لهذه الآيات فالأسلم والأولى في حق العبد أن يرد علم ذلك إلى الله في إرادته إطلاق تلك الألفاظ عليه إلا إن أطلعه الله على ذلك وما المراد بتلك الألفاظ من نبي أو ولي محدث ملهم عَلى‏ بَيِّنَةٍ من رَبِّهِ فيما يلهم فيه أو يحدث فذلك مباح له بل واجب عليه أن يعتقد المفهوم منه الذي أخبر به في الهامة أو في حديثه وليعلم أن الآيات المتشابهات إنما نزلت ابتلاء من الله لعباده ثم بالغ سبحانه في نصيحة عباده في ذلك ونهاهم أن يتبعوا المتشابه بالحكم أي لا يحكموا عليه بشي‏ء فإن تأويله لا يعلمه إلا الله وأما الرَّاسِخُونَ في الْعِلْمِ إن علموه فبإعلام الله لا بفكرهم واجتهادهم فإن الأمر أعظم أن تستقل العقول بإدراكه من غير إخبار إلهي فالتسليم أولى والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ‏\n\n\n### [العلم بالكيفيات‏]\n\n\nوأما قوله أَ لَمْ تَرَ كَيْفَ وأطلق النظر على الكيفيات فإن المراد بذلك بالضرورة المكيفات لا التكييف فإن التكييف راجع إلى حالة معقولة لها نسبة إلى المكيف وهو الله تعالى وما أحد شاهد تعلق القدرة الإلهية بالأشياء عند إيجادها قال تعالى ما أَشْهَدْتُهُمْ خَلْقَ السَّماواتِ والْأَرْضِ فالكيفيات المذكورة التي أمرنا بالنظر إليها لا فيها إنما ذلك لنتخذها عبرة ودلالة على إن لها من كيفها أي صيرها ذات كيفيات وهي الهيئات التي تكون عليها المخلوقات المكيفات فقال أَ فَلا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ ... وإِلَى الْجِبالِ كَيْفَ نُصِبَتْ وغير ذلك ولا يصح أن تنظر إلا حتى تكون موجودة فننظر إليها وكيف اختلفت هيئاتها ولو أراد بالكيف حالة الإيجاد لم يقل انظر إليها فإنها ليست بموجودة فعلمنا إن الكيف المطلوب منا في رؤية الأشياء ما هو ما يتوهم من لا علم له بذلك أ لا تراه سبحانه لما أراد النظر الذي هو الفكر قرنه بحرف في ولم يصحبه لفظ كيف فقال تعالى أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ المعنى أن يفكروا في ذلك فيعلموا أنها لم تقم بأنفسها وإنما أقامها غيرها وهذا النظر لا يلزم منه وجود الأعيان مثل النظر الذي تقدم وإنما الإنسان كلف أن ينظر بفكره في ذلك لا بعينه ومن الملكوت ما هو غيب وما هو شهادة فما أمرنا قط بحرف في إلا في المخلوقات لا في الله لنستدل بذلك عليه أنه لا يشبهها إذ لو أشبهها لجاز عليه ما يجوز عليها من حيث ما أشبهها وكان يؤدي ذلك إلى أحد محظورين إما أن يشبهها من جميع الوجوه وهو محال لما ذكرناه أو يشبهها من بعض الوجوه ولا يشبهها من بعض الوجوه فتكون ذاته مركبة من أمرين والتركيب في ذات الحق محال فالتشبيه محال والذي يليق بهذا الباب من الكلام يتعذر إيراده مجموعا في باب واحد لما يسبق إلى الأوهام الضعيفة من ذلك لما فيه من الغموض ولكن جعلناه مبددا في أبواب هذا الكتاب فاجعل بالك منه في أبواب الكتاب تعثر على مجموع هذا الباب ولا سيما حيثما وقع لك مسألة تجل إلهي فهناك قف وانظر تجد ما ذكرته لك مما يليق بهذا الباب والقرآن مشحون بالكيفية فإن الكيفيات أحوال والأحوال منها ذاتية للمكيف ومنها غير ذاتية والذاتية حكمها حكم المكيف سواء كان المكيف يستدعي مكيفا في كيفيته أو كان لا يستدعي مكيفا لتكييفه بل كيفيته عين ذاته وذاته لا تستدعي غيرها لأنها لنفسها هي فكيفيته كذلك لأنها عينه لا غيره ولا زائد عليه فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Twenty-Eight: Concerning the Gnosis of the Poles of \"Have you not seen how...\"\n\nKnowledge of the How (al-Kayf) is unknown and known,\nYet it is marked by the Existence (al-Wujūd) of the Real (al-Haqq).\n\nThe manifest aspect of the Cosmos (al-Kawn) is a determination of the How (Takyeef),\nAnd its inner aspect is a Knowledge (al-Ilm) that is pointed to, yet it is concealed (maktūm).\n\nIt is among the most wondrous matters that ignorance is one of my attributes\nRegarding what belongs to us, yet in reality (al-Tahqīq) it is known.\n\nHow can I grasp Him whom I grasp through incapacity (al-Ajz)?\nAnd how can I be ignorant of Him when ignorance is non-existent?\n\nI am perplexed concerning Him and concerning my affair, yet I am not\nOther than Him; thus, Creation (al-Khalq) is darkness and oppressed.\n\nIf I say \"I am,\" the \"I\" says, \"I am from Him.\"\nOr if I say \"You are,\" the \"I\" says, \"The 'I' is understood.\"\n\nSo praise belongs to Allah, I seek no substitute for Him,\nFor sustenance (al-Rizq) is distributed according to Divine Decree (al-Taqdīr).\n\n### The Fundamental Scientific Inquiries and their Application to the Real\n\nKnow that the fundamental inquiries (ummahāt al-maṭālib) are four: *Hal* (Is it?), which is a question about Existence (al-Wujūd); *Ma* (What is it?), which is a question about the Reality (al-Ḥaqīqa) expressed as Quiddity (al-Māhiyya); *Kayf* (How is it?), which is a question about the State (al-Ḥāl); and *Lim* (Why is it?), which is a question about the Cause (al-Illa) and Reason (al-Sabab).\n\nPeople differed regarding which of these is valid to ask concerning the Real (al-Haqq). They agreed upon the word *Hal*, for it is conceivable to ask the Real using it. They differed concerning the remainder. Some prohibited them, and some permitted them. Those who prohibited them—namely the philosophers and a group of the Sufi community—prohibited them rationally (aqlan). Others prohibited them legally (sharan).\n\n### Those who Rationally Prohibited Applying \"What,\" \"How,\" and \"Why\" to Allah\n\nAs for the form of their rational prohibition, they said concerning the inquiry *Ma* (What): it is a question about the Quiddity (al-Māhiyya), thus it is a question about the Definition (al-Ḥadd). The Real, Exalted is He, has no Definition, since a Definition is composed of a Genus (Jins) and a Differentia (Faṣl). This is prohibited concerning the Real because His Essence (Dhāt) is not compounded of something in which there is participation (which would place Him in a Genus) and something by which distinction occurs (the Differentia). There is nothing there except Allah and Creation (al-Khalq), and there is no suitability between Allah and the World (al-Ālam), nor between the Maker and the made. Thus, there is no participation, no Genus, and no Differentia.\n\nHe who permitted this rationally but prohibited it legally said: I do not say that the Definition is composed of Genus and Differentia. Rather, I say that the question *Ma* seeks knowledge of the reality (ḥaqīqa) of the inquired-about, and every known or mentioned thing must have a reality upon which it stands in itself, whether that reality involves participation or is a reality in which no participation occurs. Thus, the question *Ma* is conceivable. However, what has come down through the Sacred Law (al-Shar) prevents us from asking it concerning the Real, due to His saying, <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him).\n\nAs for their prohibition of the How (al-Kayfiyya), which is the question *Kayf* (How), they are also divided into two groups. One group says that He, Exalted is He, has no How, because the state (al-Ḥāl) is a conceivable matter added to His being an Essence (Dhāt). If an existent matter were to subsist in His Essence, added to His Essence, it would lead to the existence of two necessarily existent beings (wājibī al-wujūd) from eternity. Proof has been established that this is inadmissible, and that there is no Necessary Being except Him by His Essence. Thus, the How is rationally impossible. The other group says that He does have a How, but we do not know it, so it is prohibited legally, not rationally, because it is outside the Hows conceivable to us, and thus unknowable. He said, \"There is nothing like unto Him,\" meaning in everything attributed to Him that He attributed to Himself, He says it is upon the manner that you attribute it to the Real, even if the word is shared (in language), the meaning is different.\n\nAs for the question *Lim* (Why), it is also prohibited because the Acts (al-Afāl) of Allah, Exalted is He, are not caused (la tuallal), for the cause necessitates the act. This would mean the Real is subject to a necessity that obligated this act upon Him, which is external to His Essence. Others invalidated the application of *Lim* to His Act legally, saying that nothing should be attributed to Him that He did not attribute to Himself. This is the meaning of my statement \"legally,\" not that a prohibition came from Allah concerning everything we mentioned as being legally prohibited. All of this is flawed discourse (kalām madkhūl) from which sound conclusions cannot be drawn regarding validity or invalidity except after great length.\n\n### Those who Legally Permitted Applying \"What,\" \"How,\" and \"Why\" to Allah\n\nWe have mentioned the method of those who prohibited. As for those scholars who permitted asking these inquiries concerning Him, they are the people of the Sacred Law (Ahl al-Shar) among them. The reason for their permission is that they said: What the Law has restricted, we restrict; and what it has obligated us to delve into, we delve into, also in obedience. What has neither restriction nor obligation concerning it is a matter of ease (āfiya); if we wish, we speak about it, and if we wish, we remain silent.\n\nHe, Exalted is He, did not forbid Pharaoh, through the tongue of Moses (peace be upon him), from asking Him by saying, \"And what is the Lord of the Worlds?\" <<وَمَا رَبُّ الْعَالَمِينَ>> but rather He answered in a manner befitting the answer from that High Presence. Even if the answer did not correspond exactly to the question, that relates back to the convention (iṣṭilāḥ) of those who stipulated that *Ma* should only be asked concerning a compounded Quiddity (al-Māhiyya al-murakkaba), and who stipulated that an answer based on the effect (al-Athar) is not a valid answer for one who asked *Ma*. This convention is not binding upon the opponent. Thus, they did not prohibit applying this inquiry in this form to Him, since words do not seek themselves, but rather seek the meanings for which they were designated. They are subject to designation (ḥukm al-waḍ), and not every group designated them for the same thing as the other group. Thus, the disagreement is over expression (ibāra), not over Reality (ḥaqīqa), and disagreement is only considered in meanings.\n\nAs for their permission of the How (al-Kayfiyya), it is like their permission of the question *Ma*. They argue for this using His saying, Exalted is He, <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> (We shall attend to you, O you two heavy things [jinn and mankind]), and His saying, \"Indeed, Allah has an eye and eyes, and a hand, and the Balance is in His Hand, He lowers and raises.\" These are all Hows (kayfiyyāt), even if they are unknown due to the absence of similarity (shabah) in that regard.\n\nAs for their permission of the question *Lim* (Why), which is a question about the Cause (al-Illa), it is due to His saying, Exalted is He, <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me). This is the Lam of Causality (lām al-illa) and Reason (al-Sabab), for this is in answer to one who asked, \"Why did Allah create the jinn and mankind?\" And Allah said to this questioner, \"That they should worship Me,\" meaning, for My worship.\n\nWhoever claims restriction in applying these expressions must provide proof. It is said to all—the permitting and prohibiting adherents of the Law—\"All of you have spoken, and none has been entirely correct.\" There is a flaw in everything you have said, whether prohibition or permission. The most appropriate course is to suspend judgment regarding prohibition or permission. This is concerning the adherents of the Law. As for the non-adherents of the Law (al-Ḥukamā' / philosophers), delving into this with them is not permissible unless the Law permits or obligates it. If there is no explicit statement from the Lawgiver (al-Shāri) regarding delving into this with them, then there is no way to actively delve into it with them. Judgment must be suspended in this matter; one should not judge him who delves into it as correct or mistaken, nor him who refrains from delving, since judgment belongs only to the Law regarding what may or may not be uttered, and whether that constitutes obedience or disobedience. Thus, O my beloved (walī), we have detailed for you the approaches of people regarding these inquiries.\n\n### Affirmation of Similarity and Transcendence through the Path of Meaning\n\nAs for the beneficial Knowledge (al-Ilm al-Nāfi) in this matter, we say that just as He, Exalted is He, resembles nothing, so too do things not resemble Him. Rational and legal proof has been established for the negation of Similarity (al-Tashbīh) and the affirmation of Transcendence (al-Tanzīh) through the path of meaning. The only matter remaining is the application of the word to Him, Exalted is He, which He permitted us to apply to Him in the Quran or upon the tongue of His Messenger.\n\nThe application of terms to Him is either commanded, making it an obligatory act of obedience, and the one who utters it is rewarded and obedient—such as His saying in the opening declaration of prayer (takbīrat al-iḥrām), \"Allah is Greater (Allahu Akbar),\" which is a word whose structure implies comparison, yet He, Exalted is He, is not compared—or the person is given a choice, in which case the ruling depends on the intention of the speaker and Allah’s judgment concerning it.\n\nWhen we apply a term, the individual either applies it while associating with that application the meaning understood from it according to the usage of that language, or he applies it only as a legal act of worship (taabbudan sharan) according to Allah’s intent for it, without conceiving the meaning designated for it in that language—like the Persian who does not know the Arabic language but recites the Quran and does not understand its meaning, yet receives the reward for recitation. Likewise, the Arab concerning the ambiguous verses (al-mutashābihāt) of the Quran and the Sunnah: he recites it or mentions his Lord with it as a legal act of worship, according to Allah’s intent for it, without inclining toward a specific, designated aspect. For Transcendence (al-Tanzīh) and the negation of Similarity (nafy al-Tashbīh) demand this, should his imagination stop at the recitation of these verses.\n\nThe safest and most appropriate course for the servant is to refer the knowledge of that (the intent of those words) back to Allah, unless Allah informs him of it—whether through a Prophet or an inspired saint (walī muḥdath mulham) who is <<عَلَى بَيِّنَةٍ مِنْ رَبِّهِ>> (upon clear evidence from his Lord) regarding what he is inspired with or speaks. In that case, it is permissible for him—indeed, obligatory—to believe the meaning understood from what he was informed of in the inspiration (ilhām) or in his speech. He should know that the ambiguous verses (al-āyāt al-mutashābihāt) were revealed only as a trial (ibtilā) from Allah for His servants. Then, Exalted is He, went to great lengths in advising His servants concerning this, forbidding them from following the ambiguous by judgment—meaning, they should not pass judgment upon it with anything—for its interpretation (tawīl) is known only to Allah. As for <<الرَّاسِخُونَ فِي الْعِلْمِ>> (those firmly rooted in knowledge), if they know it, it is by Allah’s informing them, not by their own thought or exertion, for the matter is too immense for intellects to grasp independently without Divine revelation (ikhbār ilāhī). Submission (al-Taslīm) is therefore more appropriate. <<وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (And praise belongs to Allah, Lord of the Worlds).\n\n### Knowledge of the Hows\n\nAs for His saying, <<أَ لَمْ تَرَ كَيْفَ>> (Have you not seen how), and His applying sight (al-Naẓar) to the Hows (al-Kayfiyyāt), the necessary meaning is the things that have a How (al-Mukayyifāt), not the determination of the How (al-Takyeef). For the determination of the How relates to a conceivable state (ḥāla ma'qūla) that has a relationship to the Determiner of the How, who is Allah, Exalted is He. No one has witnessed the connection of Divine Power (al-Qudra al-Ilāhiyya) to things when bringing them into existence. He, Exalted is He, said, <<مَا أَشْهَدْتُهُمْ خَلْقَ السَّمَاوَاتِ وَالْأَرْضِ>> (I did not make them witness the creation of the heavens and the earth).\n\nThe mentioned Hows that we were commanded to look *at* (ilayhā), not *into* (fīhā), are only so that we may take them as a lesson and a sign that they have a Determiner of their How (man kayyafahā)—meaning, He who made them possess Hows, which are the forms (al-hay'āt) upon which the created things (al-mukayyifāt) exist. He said, <<أَفَلَا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ ... وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ>> (Do they not look at the camels, how they were created... and at the mountains, how they were erected), and other such examples. It is not valid to look at them unless they are existent, so that we may look at them and how their forms (hay'āt) differ. If He had intended by the How the state of bringing into existence (ḥāl al-ījād), He would not have said, \"Look at them,\" for that state is not existent (in the sense of being visible). Thus, we know that the How required of us in seeing things is not what those without knowledge imagine.\n\nDo you not see that when He, Exalted is He, intended the looking that is reflection (al-Fikr), He coupled it with the particle *fī* (in/into) and did not accompany it with the word *Kayf*? He, Exalted is He, said, <<أَوَلَمْ يَنْظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ>> (Have they not looked into the dominion [Malakūt] of the heavens and the earth?). The meaning is that they should reflect upon that, so they may know that these things did not establish themselves, but rather something else established them. This kind of looking does not necessitate the existence of the Fixed Entities (al-A'yān) like the looking mentioned previously. Rather, the human is tasked with looking with his thought (fikr) into that, not with his eye.\n\nPart of the Dominion (al-Malakūt) is unseen (ghayb) and part is witnessed (shahāda). We were never commanded to use the particle *fī* except concerning created things, not concerning Allah, so that we may infer from this that He does not resemble them. For if He resembled them, then what is permissible for them would be permissible for Him in the aspect in which He resembled them. This would lead to one of two impossibilities: either He resembles them in all aspects, which is impossible for the reasons we mentioned, or He resembles them in some aspects and not others, which would mean His Essence (Dhāt) is compounded of two matters, and composition in the Essence of the Real (Dhāt al-Haqq) is impossible. Thus, Similarity (al-Tashbīh) is impossible.\n\nThe discourse appropriate for this chapter is difficult to present collectively in one place due to the obscurity (ghumūḍ) it might cause for weak imaginations. Therefore, we have dispersed it throughout the chapters of this book. Pay attention to this throughout the chapters of the book, and you will find the totality of this chapter, especially wherever you encounter a Divine Theophany (tajallī ilāhī). Stop there and look, and you will find what I have mentioned to you that is appropriate for this chapter. The Quran is replete with the How (al-Kayfiyya), for the Hows are states (aḥwāl). States are either essential (dhātiyya) to the thing that has a How (al-mukayyif) or non-essential. The essential states have the same ruling as the Determiner of the How (al-mukayyif), whether the Determiner of the How requires a determiner for its How, or whether it requires no determiner for its determination, but rather its How is the very essence of its Essence (ayn dhātihi), and its Essence requires nothing other than itself, because it is for itself. Thus, its How is likewise, because it is its very essence, nothing else and nothing added to it. Understand this, and <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## (باب اٹھائیسواں: اقطاب کی معرفت میں، [آیت] \"کیا تم نے نہیں دیکھا کہ کیسے\")\n\n> کیفیت (الکيف) کا علم مجہول بھی ہے اور معلوم بھی،\n> لیکن یہ ذات حق (الحق) کی ہستی (الوجود) سے موسوم ہے۔\n\n> پس کائنات کا ظاہر کیفیت (تکییف) ہے اور اس کا باطن\n> ایسا علم ہے جس کی طرف اشارہ کیا جاتا ہے، سو وہ پوشیدہ ہے۔\n\n> یہ عجیب بات ہے کہ جہل میری صفت ہے،\n> اس چیز کے بارے میں جو ہمارے لیے ہے، حالانکہ وہ حقیقت میں معلوم ہے۔\n\n> اور میں اسے کیسے پا سکتا ہوں جسے عاجزی کے ذریعے پایا جاتا ہے؟\n> اور میں اسے کیسے نظرانداز کر سکتا ہوں جبکہ جہل معدوم ہے؟\n\n> میں اس میں اور اپنے معاملے میں حیران ہوں، اور میں اس کے سوا نہیں ہوں،\n> پس مخلوق تاریکی اور مظلوم ہے۔\n\n> اگر میں کہوں \"میں ہوں\"، تو وہ کہتا ہے کہ \"میں اس سے ہوں\"۔\n> یا اگر میں کہوں \"تو ہے\"، تو وہ کہتا ہے کہ \"یہ بات سمجھ میں آتی ہے\"۔\n\n> پس تمام تعریفیں اللہ کے لیے ہیں، میں اس کا کوئی بدل نہیں چاہتا،\n> اور رزق تو تقدیر کے ساتھ تقسیم شدہ ہے۔\n\n### [علمی مطالبات کی بنیادیں اور ان کا ذات حق (الحق) پر اطلاق]\n\nجان لو کہ علمی مطالبات کی بنیادیں چار ہیں:\n۱. \"ہل\" (کیا) جو ہستی (الوجود) کے بارے میں سوال ہے۔\n۲. \"ما\" (کیا ہے) جو اس حقیقت کے بارے میں سوال ہے جسے ماہیت (الماهية) سے تعبیر کیا جاتا ہے۔\n۳. \"کیف\" (کیسے) جو حال کے بارے میں سوال ہے۔\n۴. \"لم\" (کیوں) جو علت (العلة) اور سبب (السبب) کے بارے میں سوال ہے۔\nلوگوں نے اس بارے میں اختلاف کیا ہے کہ ان میں سے کون سے سوالات ذات حق (الحق) کے بارے میں پوچھے جا سکتے ہیں۔ وہ \"ہل\" (کیا) کے لفظ پر متفق ہیں، کیونکہ ذات حق کے بارے میں اس سے سوال کرنا متصور ہے۔ باقی ماندہ سوالات میں اختلاف کیا، چنانچہ بعض نے منع کیا اور بعض نے اجازت دی۔ جن لوگوں نے منع کیا، وہ فلاسفہ اور ایک گروہ ہیں جنہوں نے عقلی طور پر منع کیا، اور ان میں سے بعض نے شرعی طور پر منع کیا۔\n\n### [جنہوں نے عقلی طور پر اللہ پر \"ما\"، \"کیف\" اور \"لم\" کے اطلاق سے منع کیا]\n\nجہاں تک ان کے عقلی طور پر منع کرنے کی صورت ہے، تو انہوں نے \"ما\" (کیا ہے) کے مطالبے کے بارے میں کہا کہ یہ ماہیت (الماهية) کے بارے میں سوال ہے، لہٰذا یہ حد (الحد) کے بارے میں سوال ہے۔ اور ذات حق (الحق) سبحانہ کی کوئی حد (الحد) نہیں ہے، کیونکہ حد جنس (جنس) اور فصل (فصل) سے مرکب ہوتی ہے۔ اور یہ ذات حق کے حق میں ممنوع ہے، کیونکہ اس کی ذات کسی ایسی چیز سے مرکب نہیں ہے جس میں اشتراک واقع ہو، تاکہ وہ جنس میں ہو، اور نہ ہی کسی ایسی چیز سے جس سے امتیاز واقع ہو۔ اور وہاں اللہ اور مخلوق کے سوا کچھ نہیں ہے، اور اللہ اور عالم کے درمیان یا صانع اور مصنوع کے درمیان کوئی مناسبت نہیں ہے، لہٰذا کوئی شراکت نہیں، کوئی جنس نہیں، کوئی فصل نہیں۔\nاور جس نے عقلی طور پر اس کی اجازت دی اور شرعی طور پر منع کیا، اس نے کہا: میں یہ نہیں کہتا کہ حد (الحد) جنس اور فصل سے مرکب ہے، بلکہ میں یہ کہتا ہوں کہ \"ما\" کے ذریعے سوال اس چیز کے علم کو طلب کرتا ہے جو مسئول عنہ کی حقیقت ہے۔ اور ہر معلوم یا مذکور کے لیے ضروری ہے کہ اس کی اپنی ایک حقیقت ہو، خواہ وہ ایسی حقیقت پر ہو جس میں اس کے لیے اشتراک واقع ہو یا ایسی حقیقت پر ہو جس میں اس کے لیے اشتراک واقع نہ ہو۔ لہٰذا \"ما\" کے ذریعے سوال متصور ہے، لیکن جو شریعت میں وارد ہوا ہے، اس نے ہمیں ذات حق کے بارے میں اس سے سوال کرنے سے منع کیا ہے، کیونکہ اللہ تعالیٰ کا فرمان ہے:\nلَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\n(اس جیسی کوئی چیز نہیں ہے)۔\nاور جہاں تک ان کے کیفیت (الکيفية) سے منع کرنے کا تعلق ہے، جو کہ \"کیف\" (کیسے) کے ذریعے سوال ہے، تو وہ بھی دو حصوں میں تقسیم ہو گئے: ایک کہنے والا یہ ہے کہ وہ سبحانہ کوئی کیفیت (کیفیت) نہیں رکھتا، کیونکہ حال ایک معقول امر ہے جو ذات ہونے سے زائد ہے۔ اور اگر اس کی ذات کے ساتھ کوئی وجودی امر قائم ہو جو اس کی ذات سے زائد ہو، تو یہ ازل میں دو واجب الوجود کے وجود کا باعث بنے گا۔ اور اس کے محال ہونے پر دلیل قائم ہو چکی ہے، اور یہ کہ اس کی ذات کے سوا کوئی واجب نہیں ہے، لہٰذا کیفیت (الکيفية) عقلی طور پر محال ہے۔\nاور ایک کہنے والا یہ ہے کہ اس کی کیفیت (کیفیت) ہے، لیکن ہم اسے نہیں جانتے، لہٰذا یہ شرعی طور پر ممنوع ہے نہ کہ عقلی طور پر، کیونکہ یہ ہمارے نزدیک معقول کیفیات (الکیفیات) سے خارج ہے، لہٰذا اسے نہیں جانا جا سکتا۔ اور اس نے فرمایا:\nلَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\n(اس جیسی کوئی چیز نہیں ہے)۔\nیعنی ہر اس چیز میں جو اس کی طرف منسوب کی جاتی ہے جسے اس نے خود اپنی طرف منسوب کیا ہے، وہ کہتا ہے کہ وہ اس پر ہے جس پر تم اسے ذات حق (الحق) کی طرف منسوب کرتے ہو، اگرچہ لفظ میں اشتراک واقع ہو، لیکن معنی مختلف ہے۔\nاور جہاں تک \"لم\" (کیوں) کے ذریعے سوال کا تعلق ہے، تو یہ بھی ممنوع ہے، کیونکہ اللہ تعالیٰ کے افعال معلل نہیں ہوتے، کیونکہ علت (العلة) فعل کو واجب کرنے والی ہوتی ہے، تو ذات حق (الحق) ایک ایسے موجب کے تحت داخل ہو جائے گا جس نے اس فعل کو اس پر واجب کیا جو اس کی ذات سے زائد ہے۔ اور دوسرے نے شرعی طور پر اس کے فعل پر \"لم\" کے اطلاق کو باطل قرار دیا، یہ کہہ کر کہ اس کی طرف وہ چیز منسوب نہیں کی جائے گی جو اس نے خود اپنی طرف منسوب نہیں کی۔\nیہ میرے قول \"شرعی طور پر\" کا مطلب ہے، نہ کہ یہ کہ اللہ کی طرف سے ہر اس چیز کی ممانعت وارد ہوئی ہو جس کی ممانعت ہم نے شرعی طور پر ذکر کی ہے۔ اور یہ سب ایک کمزور کلام ہے جس سے صحت اور فساد کے ذریعے چھٹکارا حاصل نہیں ہو سکتا مگر ایک طویل غور و فکر کے بعد۔\n\n### [جنہوں نے شرعی طور پر اللہ پر \"ما\"، \"کیف\" اور \"لم\" کے اطلاق کی اجازت دی]\n\nیہ تو ہم نے ان لوگوں کا طریقہ ذکر کیا جنہوں نے منع کیا، اور جہاں تک ان علماء کا تعلق ہے جنہوں نے شرعی طور پر ان مطالبات کے ذریعے اس کے بارے میں سوال کرنے کی اجازت دی، تو وہ اہل شریعت میں سے ہیں۔ اور ان کی اجازت کا سبب یہ ہے کہ انہوں نے کہا: جس چیز سے شریعت نے ہمیں روکا، ہم نے اسے روکا، اور جس چیز میں شریعت نے ہمیں غور کرنے کا حکم دیا، ہم نے اس میں اطاعت کرتے ہوئے غور کیا۔ اور جس میں نہ کوئی ممانعت وارد ہوئی اور نہ کوئی وجوب، تو وہ عافیت ہے، اگر ہم چاہیں تو اس میں بات کریں اور اگر چاہیں تو خاموش رہیں۔\nاور اس سبحانہ نے فرعون کو موسیٰ علیہ السلام کی زبان سے اپنے بارے میں \"وَمَا رَبُّ الْعَالَمِينَ\" (اور رب العالمین کیا ہے؟) کے سوال سے منع نہیں کیا، بلکہ اس نے اس بلند جناب کے بارے میں جواب دیا جو اس کے لائق تھا۔ اگرچہ جواب سوال کے مطابق واقع نہیں ہوا، تو یہ اس اصطلاح کی طرف لوٹتا ہے جس پر لوگوں نے اتفاق کیا کہ اس سے صرف مرکب ماہیت (الماهية) کے بارے میں ہی سوال کیا جائے گا، اور اس پر اتفاق کیا کہ اثر (نتیجہ) کے ذریعے جواب دینا اس شخص کے لیے جواب نہیں ہو گا جس نے \"ما\" کے ذریعے سوال کیا۔ اور یہ اصطلاح فریق مخالف پر لازم نہیں آتی۔ لہٰذا اس نے اس صیغے کے ساتھ اس سوال کے اطلاق سے منع نہیں کیا، کیونکہ الفاظ اپنے لیے نہیں مانگے جاتے، بلکہ ان معانی کے لیے مانگے جاتے ہیں جن کے لیے وہ وضع کیے گئے ہیں۔ کیونکہ وہ وضع کے حکم میں ہیں، اور ہر گروہ نے انہیں اس چیز کے مقابلے میں نہیں رکھا جس کے مقابلے میں دوسرے گروہ نے رکھا، لہٰذا اختلاف عبارت میں ہو گا نہ کہ حقیقت میں۔ اور اختلاف کا اعتبار صرف معانی میں ہوتا ہے۔\nاور جہاں تک ان کی کیفیت (الکيفية) کی اجازت کا تعلق ہے، تو یہ ان کی \"ما\" کے ذریعے سوال کی اجازت کی طرح ہے۔ اور وہ اس میں اللہ تعالیٰ کے اس فرمان سے دلیل پکڑتے ہیں:\nسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ\n(عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھ والو!)\nاور اس فرمان سے کہ: \"بے شک اللہ کی ایک آنکھ ہے اور آنکھیں ہیں، اور ایک ہاتھ ہے، اور بے شک اس کے ہاتھ میں میزان ہے، وہ جھکاتا ہے اور بلند کرتا ہے۔\"\nاور یہ سب کیفیات (الکیفیات) ہیں، اگرچہ اس میں مشابہت نہ ہونے کی وجہ سے مجہول ہیں۔\nاور جہاں تک ان کی \"لم\" (کیوں) کے ذریعے سوال کی اجازت کا تعلق ہے، جو کہ علت (العلة) کے بارے میں سوال ہے، تو یہ اللہ تعالیٰ کے اس فرمان کی وجہ سے ہے:\nوَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ\n(اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں)۔\nیہ لام علت (العلة) اور سبب (السبب) کے لیے ہے۔ کیونکہ یہ اس شخص کے جواب میں ہے جس نے سوال کیا کہ اللہ نے جنوں اور انسانوں کو کیوں پیدا کیا؟ تو اللہ نے اس سائل سے کہا:\nلِيَعْبُدُونِ\n(تاکہ وہ میری عبادت کریں) یعنی میری عبادت کے لیے۔\nپس جس نے ان عبارات کے اطلاق میں ممانعت کا دعویٰ کیا، تو اس پر دلیل لانا لازم ہے۔ چنانچہ تمام متشرعین، خواہ وہ اجازت دینے والے ہوں یا منع کرنے والے، سب سے کہا جائے گا کہ تم سب نے کہا اور درست نہیں کہا۔ اور تم نے منع اور جواز کے بارے میں جو کچھ بھی کہا ہے، اس میں تم پر اعتراض ہے۔ اور بہتر یہ ہے کہ منع یا جواز کا حکم لگانے سے توقف کیا جائے۔ یہ تو متشرعین کے ساتھ معاملہ ہے۔\nاور جہاں تک حکماء میں سے غیر متشرعین کا تعلق ہے، تو ان کے ساتھ اس میں غور و خوض کرنا جائز نہیں، مگر یہ کہ شریعت اس کی اجازت دے یا اسے واجب کرے۔ اور اگر شارع کی طرف سے ان کے ساتھ اس میں غور و خوض کرنے کے بارے میں کوئی حکم وارد نہ ہو، تو ان کے ساتھ عملی طور پر اس میں غور و خوض کرنے کا کوئی راستہ نہیں ہے۔ اور اس میں حکم لگانے سے توقف کیا جائے گا، چنانچہ اس میں غور و خوض کرنے والے کو نہ تو درست کہا جائے گا اور نہ ہی غلط۔ اور اسی طرح اس شخص کے بارے میں جس نے غور و خوض ترک کر دیا، کیونکہ شریعت کے سوا کسی کا حکم نہیں ہے کہ کس چیز کا تلفظ کرنا جائز ہے اور کس کا نہیں، تاکہ وہ اطاعت ہو یا غیر اطاعت۔ پس اے میرے ولی! ہم نے تمہارے لیے ان مطالبات میں لوگوں کے ماخذ کو تفصیل سے بیان کر دیا ہے۔\n\n### [معنی کے لحاظ سے تشبیہ (التشبيه) اور تنزیہ (التنزيه)]\n\nاور جہاں تک اس میں نفع بخش علم کا تعلق ہے، تو ہم یہ کہیں گے کہ جس طرح وہ سبحانہ کسی چیز سے مشابہت نہیں رکھتا، اسی طرح چیزیں بھی اس سے مشابہت نہیں رکھتیں۔ اور عقلی اور شرعی دلیل معنی کے لحاظ سے تشبیہ (التشبيه) کی نفی اور تنزیہ (التنزيه) کے اثبات پر قائم ہو چکی ہے۔ اور معاملہ صرف اس لفظ کے اطلاق میں باقی ہے جسے اللہ نے ہمیں قرآن میں یا اپنے رسول کی زبان پر اس پر اطلاق کرنے کی اجازت دی ہے۔\nجہاں تک اس پر اس کے اطلاق کا تعلق ہے، تو یہ اس سے خالی نہیں ہو گا کہ یا تو بندے کو اس اطلاق کا حکم دیا گیا ہو، تو اس کا اطلاق فرض اطاعت ہو گا، اور تلفظ کرنے والا اجر پانے والا اور مطیع ہو گا، جیسے تکبیر تحریمہ میں اس کا قول: \"اللہ اکبر\" (اللہ سب سے بڑا ہے)، اور یہ ایک ایسا لفظ ہے جس کا وزن فضیلت کا تقاضا کرتا ہے، حالانکہ وہ سبحانہ کسی سے فضیلت نہیں رکھتا۔\nیا یہ کہ اسے اختیار دیا گیا ہو، تو یہ تلفظ کرنے والے کی نیت اور اس میں اللہ کے حکم کے مطابق ہو گا۔\nاور جب ہم اس کا اطلاق کرتے ہیں، تو انسان اس سے خالی نہیں ہو گا کہ یا تو وہ اس کا اطلاق کرے اور اس اطلاق میں اپنے ساتھ اس معنی کو رکھے جو اس زبان میں وضع کے لحاظ سے اس سے سمجھا جاتا ہے، یا وہ صرف شرعی تعبد کے طور پر اس کا اطلاق کرے، اس میں اللہ کی مراد کے مطابق، اس معنی کا تصور کیے بغیر جس کے لیے وہ اس زبان میں وضع کیا گیا ہے، جیسے فارسی شخص جو عربی زبان نہیں جانتا اور قرآن کی تلاوت کرتا ہے اور اس کا معنی نہیں سمجھتا، اور اسے تلاوت کا اجر ملتا ہے۔ اسی طرح عربی شخص متشابہات قرآن اور سنت میں اس کی تلاوت کرتا ہے یا اس کے ذریعے اپنے رب کا ذکر کرتا ہے، شرعی تعبد کے طور پر، اس میں اللہ کی مراد کے مطابق، کسی خاص پہلو کی طرف جھکاؤ کے بغیر۔ کیونکہ تنزیہ (التنزيه) اور تشبیہ (التشبيه) کی نفی کا تقاضا یہ ہے کہ اگر وہ ان آیات کی تلاوت پر اپنے وہم کو روک دے۔\nپس بندے کے حق میں زیادہ محفوظ اور بہتر یہ ہے کہ وہ اس علم کو اللہ کی طرف لوٹا دے، اس کے ارادے میں ان الفاظ کے اطلاق کے بارے میں، مگر یہ کہ اللہ اسے اس پر مطلع کر دے۔ اور ان الفاظ سے کیا مراد ہے، کسی نبی یا ولی محدث ملہم کی طرف سے، جو اپنے رب کی طرف سے واضح دلیل (عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِ) پر ہو، اس چیز میں جس میں اسے الہام کیا جاتا ہے یا وہ بات کرتا ہے، تو یہ اس کے لیے مباح ہے، بلکہ اس پر واجب ہے کہ وہ اس مفہوم پر اعتقاد رکھے جس کی اسے الہام میں یا اپنی بات میں خبر دی گئی ہے۔ اور اسے معلوم ہونا چاہیے کہ متشابہ آیات اللہ کی طرف سے اپنے بندوں کے لیے آزمائش کے طور پر نازل کی گئی ہیں۔ پھر اس سبحانہ نے اس میں اپنے بندوں کو نصیحت کرنے میں مبالغہ کیا اور انہیں متشابہ کی پیروی کرنے سے منع کیا، یعنی اس پر کوئی حکم نہ لگائیں، کیونکہ اس کی تاویل صرف اللہ ہی جانتا ہے۔ اور جہاں تک علم میں راسخ لوگوں (الرَّاسِخُونَ فِي الْعِلْمِ) کا تعلق ہے، اگر وہ اسے جانتے ہیں، تو اللہ کے بتانے سے، نہ کہ اپنی فکر اور اجتہاد سے۔ کیونکہ معاملہ اس سے کہیں زیادہ عظیم ہے کہ عقلیں الٰہی خبر کے بغیر اس کے ادراک میں خود کفیل ہو سکیں۔ پس تسلیم کرنا زیادہ بہتر ہے، اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے (وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)۔\n\n### [کیفیات (الکیفیات) کا علم]\n\nاور جہاں تک اس کے قول \"أَ لَمْ تَرَ كَيْفَ\" (کیا تم نے نہیں دیکھا کہ کیسے) کا تعلق ہے، اور اس نے کیفیتوں (الکیفیات) پر نظر کا اطلاق کیا، تو اس سے مراد بالضرورت مکّیفات (جنہیں کیفیت دی گئی) ہیں نہ کہ تکییف (کیفیت دینا)، کیونکہ تکییف ایک معقول حالت کی طرف لوٹتا ہے جس کا تعلق مکّیف (کیفیت دینے والے) یعنی اللہ تعالیٰ سے ہے۔ اور کسی نے بھی اشیاء کو وجود میں لاتے وقت قدرت الٰہیہ کے تعلق کا مشاہدہ نہیں کیا، اللہ تعالیٰ نے فرمایا:\nمَا أَشْهَدْتُهُمْ خَلْقَ السَّمَاوَاتِ وَالْأَرْضِ\n(میں نے انہیں آسمانوں اور زمین کی تخلیق کے وقت حاضر نہیں کیا تھا)۔\nپس مذکورہ کیفیات (الکیفیات) جن کی طرف ہمیں دیکھنے کا حکم دیا گیا ہے، نہ کہ ان میں، وہ صرف اس لیے ہے کہ ہم انہیں عبرت اور دلیل بنائیں کہ ان کا کوئی کیفیت دینے والا ہے، یعنی جس نے انہیں کیفیات (الکیفیات) والا بنایا، اور وہ ہیئتیں ہیں جن پر مخلوقات (مکّیفات) ہوتی ہیں۔ چنانچہ اس نے فرمایا:\nأَفَلَا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ * وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ\n(تو کیا وہ اونٹوں کو نہیں دیکھتے کہ وہ کیسے پیدا کیے گئے * اور پہاڑوں کو کہ وہ کیسے گاڑے گئے)\nاور اس کے علاوہ۔ اور ان کی طرف دیکھنا درست نہیں ہو سکتا جب تک کہ وہ موجود نہ ہوں، تاکہ ہم ان کی طرف دیکھیں اور دیکھیں کہ ان کی ہیئتیں کیسے مختلف ہوئیں۔ اور اگر اس سے مراد کیفیت (الکيف) سے حالتِ ایجاد ہوتی، تو وہ یہ نہ کہتا کہ ان کی طرف دیکھو، کیونکہ وہ موجود نہیں ہے۔\nپس ہمیں معلوم ہوا کہ اشیاء کو دیکھنے میں ہم سے مطلوب کیفیت (الکيف) وہ نہیں ہے جو وہ شخص وہم کرتا ہے جسے اس کا علم نہیں ہے۔ کیا تم نہیں دیکھتے کہ جب اس سبحانہ نے اس نظر کا ارادہ کیا جو فکر ہے، تو اسے حرف \"فی\" (میں) کے ساتھ جوڑا، اور اس کے ساتھ \"کیف\" (کیسے) کا لفظ نہیں لایا، چنانچہ اللہ تعالیٰ نے فرمایا:\nأَوَلَمْ يَنْظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ\n(اور کیا انہوں نے آسمانوں اور زمین کے ملکوت (ملکوت) میں غور نہیں کیا؟)\nاس کا مطلب یہ ہے کہ وہ اس میں فکر کریں تاکہ وہ جان لیں کہ وہ خود سے قائم نہیں ہوئے، بلکہ انہیں کسی اور نے قائم کیا ہے۔ اور یہ نظر وجودِ اعیان کو لازم نہیں کرتی، جیسا کہ پہلی نظر تھی۔ بلکہ انسان کو مکلف کیا گیا ہے کہ وہ اس میں اپنی فکر سے دیکھے نہ کہ اپنی آنکھ سے۔ اور ملکوت (ملکوت) میں سے کچھ غیب ہے اور کچھ شہادت۔\nاور ہمیں کبھی بھی حرف \"فی\" (میں) کے ساتھ حکم نہیں دیا گیا مگر مخلوقات میں، نہ کہ اللہ میں، تاکہ ہم اس سے یہ دلیل پکڑیں کہ وہ ان سے مشابہت نہیں رکھتا، کیونکہ اگر وہ ان سے مشابہت رکھتا، تو اس پر وہ چیزیں جائز ہو جاتیں جو ان پر جائز ہوتی ہیں، اس لحاظ سے جس لحاظ سے وہ ان سے مشابہت رکھتا۔ اور یہ دو محظورات میں سے کسی ایک کی طرف لے جاتا: یا تو وہ تمام پہلوؤں سے ان سے مشابہت رکھتا، جو کہ محال ہے جیسا کہ ہم نے ذکر کیا، یا وہ بعض پہلوؤں سے ان سے مشابہت رکھتا اور بعض پہلوؤں سے مشابہت نہ رکھتا، تو اس کی ذات دو امور سے مرکب ہو جاتی، اور ذات حق (الحق) میں ترکیب محال ہے۔ پس تشبیہ (التشبيه) محال ہے۔\nاور جو کلام اس باب کے لائق ہے، اسے ایک ہی باب میں مجموعی طور پر لانا مشکل ہے، کیونکہ اس میں جو گہرائی ہے اس کی وجہ سے کمزور وہموں کی طرف غلط فہمی کا امکان ہے۔ لیکن ہم نے اسے اس کتاب کے ابواب میں بکھیر دیا ہے۔ پس تم اس کتاب کے ابواب میں اس پر توجہ رکھو، تو تمہیں اس باب کا مجموعہ مل جائے گا۔ اور خاص طور پر جہاں بھی تمہیں ظہور الٰہی (تجلی إلهي) کا مسئلہ ملے، تو وہاں ٹھہر جاؤ اور دیکھو، تمہیں وہ سب کچھ مل جائے گا جو میں نے تمہیں اس باب کے لائق ذکر کیا ہے۔\nاور قرآن کیفیت (الکيفية) سے بھرا ہوا ہے، کیونکہ کیفیات (الکیفیات) احوال ہیں، اور احوال میں سے کچھ مکّیف (کیفیت دیے گئے) کے لیے ذاتی ہوتے ہیں اور کچھ غیر ذاتی۔ اور ذاتی کا حکم مکّیف کا حکم ہوتا ہے، خواہ مکّیف اپنی کیفیت (کیفیت) میں کسی کیفیت دینے والے کا محتاج ہو یا اپنی تکییف (کیفیت دینے) کے لیے کسی کیفیت دینے والے کا محتاج نہ ہو۔ بلکہ اس کی کیفیت (کیفیت) عین اس کی ذات ہے، اور اس کی ذات اپنے غیر کی محتاج نہیں ہے، کیونکہ وہ اپنے لیے ہی ہے۔ پس اس کی کیفیت بھی اسی طرح ہے، کیونکہ وہ عین اس کی ذات ہے، نہ کہ اس کا غیر اور نہ ہی اس پر کوئی زائد چیز۔ پس سمجھو، اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب بیست و هشتم در معرفت اقطاب «آیا ندیدی چگونه؟»\n\nعلم به چگونگی (الکیف) مجهول و معلوم است، اما به وجود حق (الحق) نشان‌دار شده است.\nپس ظاهر هستی (الکون) چگونگی‌بخشی (تکییف) است و باطن آن، علمی است که به آن اشاره می‌شود و پوشیده (مکتوم) است.\nاز شگفت‌ترین امور این است که نادانی (الجهل) صفت من است نسبت به آنچه از آنِ ماست، در حالی که در حقیقت (التحقیق) معلوم است.\nو چگونه درک کنم کسی را که با عجز (ناتوانی) او را درک می‌کنم؟ و چگونه او را نادانم، در حالی که جهل (نادانی) معدوم است؟\nدر او و در کار خود حیران مانده‌ام، و من جز او نیستم؛ پس خلق، تاریکی (ظلام) و ستم‌دیده (مظلوم) است.\nاگر بگویم «من»، او می‌گوید «من» از او هستم؛ و اگر بگویم «تو»، او می‌گوید «من» فهمیده شده است.\nپس ستایش از آنِ خداست، جایگزینی برای او نمی‌خواهم؛ و همانا روزی به تقدیر تقسیم شده است.\n\n### اصول مطالبات علمی و حمل آنها بر حق\n\nبدان که اصول مطالبات علمی چهار چیزند: «هل» که سؤال از هستی (الوجود) است؛ و «ما» که سؤال از حقیقتی است که با ماهیت (الماهية) از آن تعبیر می‌شود؛ و «کیف» که سؤال از حال است؛ و «لم» که سؤال از علت و سبب است. مردم در مورد اینکه کدام یک از اینها برای سؤال از حق (الحق) صحیح است، اختلاف کرده‌اند. اما بر کلمه «هل» اتفاق نظر دارند، زیرا تصور می‌شود که می‌توان با آن از حق سؤال کرد. در مورد بقیه اختلاف کردند؛ برخی منع کردند و برخی اجازه دادند. کسانی که منع کردند، فلاسفه و گروهی از طایفه [صوفیه] هستند که آن را عقلاً منع کردند، و برخی نیز شرعاً منع کردند.\n\n### کسانی که اطلاق «ما» و «کیف» و «لم» بر خداوند را عقلاً منع کردند\n\nاما صورت منع عقلی آنان این است که در مورد مطلب «ما» گفتند: این سؤال از ماهیت (الماهية) است، پس سؤال از حد است. و حق سبحانه حدی ندارد، زیرا حد مرکب از جنس و فصل است. و این در حق حق (الحق) ممنوع است، زیرا ذات او مرکب از امری نیست که در آن اشتراک واقع شود تا به واسطه آن در جنس قرار گیرد، و امری که به واسطه آن امتیاز حاصل شود. و در آنجا جز خدا و خلق نیست، و هیچ مناسبتی بین خدا و عالم، یا صانع و مصنوع نیست؛ پس مشارکتی نیست، جنسی نیست، فصلی نیست.\nو اما کسی که آن را عقلاً جایز دانست و شرعاً منع کرد، گفت: من نمی‌گویم که حد مرکب از جنس و فصل است، بلکه می‌گویم سؤال با «ما» برای طلب علم به حقیقت مسئول‌عنه است. و هر معلوم یا مذکور باید در نفس خود حقیقتی داشته باشد، چه بر حقیقتی باشد که در آن اشتراک واقع شود یا بر حقیقتی باشد که در آن اشتراک واقع نشود. پس سؤال با «ما» متصور است، اما آنچه شرع به آن وارد شده، ما را از سؤال با آن از حق منع کرده است، به دلیل قول خداوند متعال: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست).\nو اما منع آنان از چگونگی (الکیفیة) که سؤال با «کیف» است، نیز به دو دسته تقسیم شدند: برخی گفتند که او سبحانه چگونگی ندارد، زیرا حال امری معقول و زائد بر ذات بودن است. و اگر امری وجودی زائد بر ذاتش به ذات او قائم شود، منجر به وجود دو واجب‌الوجود بالذات ازلی می‌شود، در حالی که دلیل بر محال بودن آن اقامه شده است و اینکه جز او واجب بالذات نیست. پس چگونگی (الکیفیة) عقلاً محال است.\nو برخی گفتند که او چگونگی دارد، اما ما آن را نمی‌دانیم؛ پس شرعاً ممنوع است نه عقلاً، زیرا خارج از چگونگی‌های معقول نزد ماست و دانسته نمی‌شود. و [خداوند] فرموده است: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست)؛ یعنی در هر آنچه به او نسبت داده می‌شود، از آنچه خود به خویشتن نسبت داده است، می‌گوید: او بر آن است که تو به حق (الحق) نسبت می‌دهی، و اگرچه در لفظ اشتراک واقع شود، معنا متفاوت است.\nو اما سؤال با «لم» (چرا) نیز ممنوع است، زیرا افعال خداوند متعال تعلیل نمی‌شوند، چرا که علت، موجب فعل است. در این صورت، حق (الحق) تحت موجب وادارکننده‌ای قرار می‌گیرد که این فعل را بر او واجب کرده و زائد بر ذات اوست. و دیگری اطلاق «لم» بر فعل او را شرعاً باطل دانست و گفت: آنچه را که [خداوند] خود به خویشتن نسبت نداده است، نباید به او نسبت داد. پس این معنای قول من است که «شرعاً» [منع شده]، نه اینکه نهی از جانب خدا در مورد هر آنچه منع آن را شرعاً ذکر کردیم، وارد شده باشد. و این همه کلامی است که در آن خلل است و خلاصی از صحت و فساد آن جز پس از مدتی طولانی میسر نمی‌شود.\n\n### کسانی که اطلاق «ما» و «کیف» و «لم» بر خداوند را شرعاً جایز دانستند\n\nاین روش کسانی بود که منع کردند. اما کسانی که سؤال از حق را با این مطالبات جایز دانستند، از علمای اهل شرع هستند. دلیل جواز آنان این است که گفتند: آنچه را شرع بر ما منع کرده، ما نیز منع می‌کنیم، و آنچه را بر ما واجب کرده که در آن غور کنیم، ما نیز از روی اطاعت در آن غور می‌کنیم. و آنچه نه منع و نه وجوبی در آن وارد شده، عافیت است؛ اگر خواستیم در مورد آن سخن می‌گوییم و اگر خواستیم سکوت می‌کنیم.\nو او سبحانه فرعون را بر زبان موسی (علیه السلام) از سؤالش با این قول که: وَمَا رَبُّ الْعَالَمِينَ (و پروردگار جهانیان چیست؟) نهی نکرد، بلکه پاسخی داد که شایسته آن جناب عالی بود، هرچند پاسخ مطابق سؤال واقع نشد. این [عدم مطابقت] به اصطلاح کسانی بازمی‌گردد که اصطلاح کرده‌اند که با «ما» فقط از ماهیت مرکب سؤال می‌شود، و اصطلاح کرده‌اند که پاسخ با اثر، پاسخ کسی که با «ما» سؤال کرده، نیست.\nاین اصطلاح، خصم را ملزم نمی‌کند. پس اطلاق این سؤال با این صیغه بر او منع نشد، زیرا الفاظ برای خودشان طلب نمی‌شوند، بلکه برای معانی‌ای که برای آنها وضع شده‌اند، طلب می‌شوند. زیرا آنها تابع حکم وضع هستند، و نه هر طایفه‌ای آن را در مقابل همان چیزی قرار داده که طایفه دیگر قرار داده است. پس اختلاف در عبارت است نه در حقیقت، و اختلاف فقط در معانی معتبر است.\nو اما جواز چگونگی (الکیفیة) توسط آنان، مانند جواز سؤال با «ما» است. و در این مورد به قول خداوند متعال استدلال می‌کنند: سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (ای جن و انس، به زودی به حساب شما می‌پردازیم) و قول [پیامبر]: «همانا خداوند چشمی و چشم‌هایی و دستی دارد و همانا ترازو در دست اوست، پایین می‌آورد و بالا می‌برد».\nو اینها همه چگونگی‌ها (کیفیات) هستند، هرچند به دلیل نبودن شبیه در این مورد، مجهول باشند.\nو اما جواز سؤال با «لم» (چرا) که سؤال از علت است، به دلیل قول خداوند متعال است: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند). این لام، لام علت و سبب است، زیرا این در پاسخ کسی است که پرسید: چرا خداوند جن و انس را آفرید؟ پس خداوند به این سائل فرمود: لِيَعْبُدُونِ (تا مرا بپرستند)، یعنی برای عبادت من.\nپس هر کس ادعای منع در اطلاق این عبارات را دارد، باید دلیل بیاورد. و به همه متشرعین (مجوزین و مانعین) گفته می‌شود: همه شما گفتید و به صواب نرسیدید. و هیچ چیزی از آنچه گفتید، چه منع و چه جواز، نیست مگر اینکه در آن خللی بر شما وارد است. و اولی‌تر آن است که از حکم به منع یا جواز توقف شود.\nاین در مورد متشرعین است. اما در مورد غیر متشرعین از حکما، غور کردن با آنان در این مسائل جایز نیست، مگر اینکه شرع آن را مباح یا واجب کرده باشد. و اگر در مورد غور کردن با آنان، سخنی از شارع وارد نشده باشد، پس راهی برای غور کردن عملی با آنان نیست. و در حکم در این مورد توقف می‌شود؛ پس نه بر کسی که در آن غور کرده حکم می‌شود که بر صواب است و نه بر خطا، و همچنین در مورد کسی که غور را ترک کرده است. زیرا حکمی نیست مگر برای شرع در مورد آنچه جایز است به آن تلفظ شود یا نشود، تا آن عمل اطاعت باشد یا غیر اطاعت. پس ای ولیّ، ما مآخذ مردم را در این مطالبات برای تو تفصیل دادیم.\n\n### تشبیه و تنزیه از طریق معنا\n\nو اما علم سودمند در این باره این است که بگوییم: همان‌گونه که او سبحانه شبیه هیچ چیز نیست، اشیاء نیز شبیه او نیستند. و دلیل عقلی و شرعی بر نفی تشبیه و اثبات تنزیه (Transcendence) از طریق معنا اقامه شده است. و امر باقی نمانده است مگر در اطلاق لفظ بر او سبحانه، که [اطلاق] آن را در قرآن یا بر زبان رسولش بر ما مباح کرده است.\nاما اطلاق آن بر او، خالی از دو حالت نیست: یا بنده به آن اطلاق مأمور است، پس اطلاق او اطاعت و فرض است، و تلفظ‌کننده مأجور و مطیع است، مانند قول در تکبیرة الاحرام: «الله اکبر» (خداوند بزرگ‌تر است)، که وزن این لفظ مقتضی مفاضله (برتری دادن بر دیگری) است، در حالی که او سبحانه مفاضله نمی‌شود.\nو یا بنده در آن مخیر است، که در این صورت تابع قصد تلفظ‌کننده و حکم خداوند در آن است.\nو هنگامی که آن را اطلاق می‌کنیم، انسان خالی از دو حالت نیست: یا آن را اطلاق می‌کند و در آن اطلاق، معنای مفهوم از آن را در وضع آن زبان همراه خود می‌سازد، یا آن را فقط به عنوان تعبدی شرعی بر مراد خداوند در آن اطلاق می‌کند، بدون اینکه معنایی را که برای آن در آن زبان وضع شده است، تصور کند؛ مانند فارسی‌زبانی که زبان عربی نمی‌داند و قرآن تلاوت می‌کند و معنای آن را درک نمی‌کند، اما اجر تلاوت دارد. همچنین عربی در مورد متشابهات قرآن و سنت، آن را تلاوت می‌کند یا پروردگارش را با آن ذکر می‌کند، به عنوان تعبدی شرعی بر مراد خداوند در آن، بدون تمایل به جانب خاصی. زیرا تنزیه (Transcendence) و نفی تشبیه (Similitude) این را می‌طلبد که اگر وهم او هنگام تلاوت این آیات متوقف شود [و معنای ظاهری را نپذیرد].\nپس سالم‌تر و اولی‌تر در حق بنده این است که علم آن را به خداوند بازگرداند در اراده‌اش برای اطلاق آن الفاظ بر او، مگر اینکه خداوند او را بر آن مطلع سازد. و مراد از آن الفاظ از جانب پیامبر یا ولیّ محدَّث (ملهم) که عَلى‏ بَيِّنَةٍ مِنْ رَبِّهِ (دلیل روشنی از پروردگارش) است در آنچه به او الهام می‌شود یا حدیث می‌کند، پس این برای او مباح است، بلکه بر او واجب است که مفهوم آن را که در الهام یا حدیثش به او خبر داده شده، اعتقاد کند.\nو باید بداند که آیات متشابهات تنها برای ابتلا و آزمایش بندگان از جانب خداوند نازل شده‌اند. سپس سبحانه در نصیحت بندگانش در این باره مبالغه کرده و آنان را از پیروی متشابهات با حکم کردن نهی کرده است؛ یعنی بر آن چیزی حکم نکنند، زیرا تأویل آن را جز خداوند نمی‌داند. و اما الرَّاسِخُونَ فِي الْعِلْمِ (راسخان در علم)، اگر آن را بدانند، به آگاه ساختن خداوند است، نه به فکر و اجتهاد خودشان. زیرا امر عظیم‌تر از آن است که عقول بدون اخبار الهی به درک آن مستقل شوند. پس تسلیم اولی‌تر است. وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (و ستایش از آنِ خداوند، پروردگار جهانیان است).\n\n### علم به چگونگی‌ها\n\nو اما قول او [خداوند]: أَ لَمْ تَرَ كَيْفَ (آیا ندیدی چگونه؟) و نظر را بر چگونگی‌ها (کیفیات) اطلاق کرد، مراد از آن به ضرورت، مکَیَّفات (چگونگی داده شده‌ها) است نه تکییف (چگونگی‌بخشی). زیرا تکییف به حالتی معقول بازمی‌گردد که نسبتی به مُکَیِّف (چگونگی‌بخش) دارد که همان خداوند متعال است. و هیچ کس شاهد تعلق قدرت الهی به اشیاء هنگام ایجاد آنها نبوده است. خداوند متعال می‌فرماید: مَا أَشْهَدْتُهُمْ خَلْقَ السَّمَاوَاتِ وَالْأَرْضِ (من آنان را بر آفرینش آسمان‌ها و زمین گواه نگرفتم).\nپس چگونگی‌های (کیفیات) مذکور که به ما امر شده است که به آنها نظر کنیم، نه در آنها، تنها برای این است که آنها را عبرت و دلیلی قرار دهیم بر اینکه آنها کسی را دارند که به آنها چگونگی داده است؛ یعنی آنها را دارای چگونگی‌هایی کرده است، که همان هیئت‌هایی است که مخلوقات مکَیَّفات (چگونگی داده شده‌ها) بر آن هستند.\nپس فرمود: أَفَلَا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ (آیا به شتر نمی‌نگرند که چگونه آفریده شده است؟) ... وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ (و به کوه‌ها که چگونه برپا شده‌اند؟) و غیر از اینها. و صحیح نیست که به آنها نظر شود مگر اینکه موجود باشند تا ما به آنها نظر کنیم و ببینیم که هیئت‌هایشان چگونه متفاوت شده است.\nو اگر مراد از «کیف» حالت ایجاد بود، نمی‌فرمود: «به آن نظر کن»، زیرا آن [حالت ایجاد] موجود نیست. پس دانستیم که «کیف» مطلوب از ما در دیدن اشیاء، آن چیزی نیست که کسی که علم به آن ندارد، توهم می‌کند.\nآیا نمی‌بینی که او سبحانه هنگامی که نظر را که همان فکر است، اراده کرد، آن را با حرف «فی» (در) همراه ساخت و لفظ «کیف» را با آن نیاورد؟ پس خداوند متعال فرمود: أَوَلَمْ يَنْظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ (آیا در ملکوت آسمان‌ها و زمین نظر نکردند؟)\nمعنای آن این است که در آن تفکر کنند تا بدانند که آنها به خودی خود برپا نشده‌اند، بلکه دیگری آنها را برپا کرده است. و این نظر، وجود اعیان را لازم نمی‌آورد، برخلاف نظری که پیشتر آمد. بلکه انسان مکلف شده است که با فکر خود در آن نظر کند نه با چشم خود. و از ملکوت (جهان فرمانروایی) هم غیب است و هم شهادت.\nو ما هرگز با حرف «فی» (در) مأمور نشدیم مگر در مخلوقات، نه در خداوند، تا با این [تفکر] استدلال کنیم که او شبیه آنها نیست. زیرا اگر شبیه آنها بود، آنچه بر آنها جایز است، از آن جهت که شبیه آنهاست، بر او نیز جایز می‌شد. و این امر به یکی از دو محذور می‌انجامید: یا اینکه از همه وجوه شبیه آنها باشد که محال است (به دلیل آنچه ذکر کردیم)، یا اینکه از برخی وجوه شبیه آنها باشد و از برخی وجوه شبیه آنها نباشد، که در این صورت ذات او مرکب از دو امر می‌شد، و ترکیب در ذات حق (الحق) محال است. پس تشبیه محال است.\nو سخنی که شایسته این باب است، آوردن مجموع آن در یک باب دشوار است، به دلیل آنچه از آن به اوهام ضعیف سبقت می‌گیرد، به خاطر ابهام آن. اما ما آن را در ابواب این کتاب پراکنده ساختیم. پس توجه خود را در ابواب کتاب به آن معطوف دار تا مجموعه این باب را بیابی، به ویژه هر جا که مسئله تجلی الهی (التجلی الإلهی) برای تو پیش آمد. در آنجا توقف کن و بنگر، آنچه را که برای تو ذکر کردم و شایسته این باب است، خواهی یافت.\nو قرآن مملو از چگونگی (الکیفیة) است، زیرا چگونگی‌ها (کیفیات) احوال هستند. و احوال برخی ذاتی مُکَیِّف (چگونگی‌بخش) هستند و برخی غیر ذاتی. و حکم احوال ذاتی، حکم خود مُکَیِّف است، چه مُکَیِّف در چگونگی خود نیازمند مُکَیِّف دیگری باشد، یا نیازمند مُکَیِّف دیگری برای چگونگی‌بخشی خود نباشد، بلکه چگونگی او عین ذات او باشد. و ذات او نیازمند غیر خود نیست، زیرا او برای خودش «او» است. پس چگونگی او نیز چنین است، زیرا عین اوست، نه غیر او و نه زائد بر او. پس بفهم. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 3
}