{
  "id": 269,
  "title": {
    "ar": "الباب التاسع والستون ومائتان في معرفة علم اليقين",
    "en": "Chapter 269: Concerning the Gnosis of the Knowledge of Certainty (علم اليقين)",
    "ur": "باب نمبر دو سو انہتر علم الیقین (علم اليقين) کی معرفت میں",
    "fa": "باب دویست و شصت و نهم در معرفت علم الیقین (علم اليقين)"
  },
  "content": {
    "ar": "## «الباب التاسع والستون ومائتان في معرفة علم اليقين»\n\n\nوهو ما أعطاه الدليل الذي لا يقبل الدخل ولا الشبهة ومعرفة عين اليقين وهو ما أعطته المشاهدة والكشف ومعرفة حق اليقين وهو ما حصل في القلب من العلم بما أريد له ذلك الشهود»\n\n\n> علم اليقين بعينه وبحقه *** تبدو دلائله على الأكوان‏\n\n\n> لو لا وجود العين في ملكوته *** ما قام توحيد على برهان‏\n\n\n> فانظر إلى حق اليقين وعينه *** في عالم الأرواح والأبدان‏\n\n\n> تجد الذي عنه تكون سره *** في كل ما يبدو من الأعيان‏\n\n\nاعلم أيدنا الله وإياك بروح منه أنا قد علمنا علما يقينا لا تدخله شبهة إن في العالم بيتا يسمى الكعبة ببلده يسمى مكة لا يتمكن لأحد الجهل بهذا ولا أن يدخله شبهة ولا يقدح في دليله دخل فاستقر العلم بذلك فأضيف إلى اليقين الذي هو الاستقرار إن لله بيتا يسمى الكعبة بقرية تسمى مكة تحج الناس إليه في كل سنة ويطوفون به ثم شوهد هذا البيت عند الوصول إليه بالعين المحسوسة فاستقر عند النفس بطريق العين كيفيته وهيأته وحاله فكان ذلك عين اليقين الذي كان قبل الشهود علم يقين وحصل في النفس برؤيته ما لم يكن عندها قبل رؤيته ذوقا ثم فتح الله عين بصيرته في كون ذلك البيت مضافا إلى الله مطافا به مقصودا دون غيره من البيوت المضافة إلى الله فعلم علة ذلك وسببه بإعلام الله لا بنظره واجتهاده فكان علمه بذلك حقا يقينا مقررا عنده لا يتزلزل فما كل حق له قرار ولا كل علم ولا كل عين فلذلك صحت الإضافة فلو كان علم اليقين وعينه وحقه نفس اليقين ما صحت الإضافة لأن الشي‏ء الواحد لا يضاف إلى نفسه لأن الإضافة لا تكون إلا بين مضاف ومضاف إليه فتطلب الكثرة حتى يصح وجودها ومن لم يفرق بين اليقين والعلم ويقول إن العلم هو اليقين وقد ورد في كتاب الله مضافا احتاج إلى طلب وجه في ذلك تصح له به الإضافة ليؤمن بما جاء من عند الله فقال قد يكون المعنى واحدا ويدل عليه لفظان مختلفان فيضاف أحد اللفظين إلى الآخر فإنهما غير إن بلا شك في الصورة مع أحدية المعنى ولفظة العلم ما هي لفظة اليقين فأضيف العلم إلى اليقين لهذا التغاير فصحت الإضافة في الألفاظ لا في المعنى وإنما احتال من احتال هذه الحيلة لقصور فهمه عما تدل عليه الألفاظ في الموضوعات من المعاني فلو علم ذلك لعلم أن مدلول لفظة العلم غير مدلول لفظة اليقين وإذا تقرر هذا فقد علمت معنى علم اليقين وعينه وحقه ثم بعد هذا فاعلم إن اليقين في هذه المسألة هو المطلوب ولهذا أضيفت هذه الثلاثة إليه وكان مدارها عليه فمن ثبت له القرار عند الله في الله بالله مع الله فلا بد له من علامة على ذلك تضاف إلى اليقين لأنها مخصوصة به ولا تكون علامة إلا عليه فذلك هو علم اليقين ولا بد من شهود تلك العلامة وتعلقها باليقين واختصاصها به فذلك هو عين اليقين ولا بد من وجوب حكمة في هذه العين وفي هذا العلم فلا يتصرف العلم إلا فيما\nيجب له التصرف فيه ولا تنظر العين إلا فيما يجب لها النظر إليه وفيه فذلك هو حق اليقين الذي أوجبه على العلم والعين وأما اليقين فهو كل ما ثبت واستقر ولم يتزلزل من أي نوع كان من حق وخلق فله علم وعين وحق أي وجوب حكمه إلا الذات الإلهية فيقينها ما له سوى حق اليقين وصورة حقها أي الوجوب علينا منها السكوت عنها وترك الخوض فيها لأنها لا تعلم فما ثم علم يضاف إلى اليقين ولا يشهد فلا تضاف العين إلى اليقين ولها الحكم على العالم كله بترك الخوض فيها فلها الحق فأضيف إليها فلا يضاف إلى اليقين إلا ما يقبله فإن كان مما تدل عليه علامة أضيف إليه العلم وإن لم يكن فلا يضاف إليه وإن كان مما يشهد أضيفت إليه العين وإن لم يكن فلا تضاف إليه وإن كان ممن له في نفس الأمر حكم واجب على أحد من المخلوقين حتى على نفسه مثل قوله تعالى كتب ربكم على نفسه الرحمة أضيف إليه الحق فقيل حق اليقين لوجوبه وإن لم يكن شي‏ء مما ذكرناه فلا يضاف إلى شي‏ء مما تقدم فقد أعطيتك أمرا كليا في هذه المسألة في كل متيقن فلك النظر في حقيقة ذلك اليقين وهذا القدر كاف والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر الثامن عشر\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "Chapter 269: Concerning the Gnosis of the Knowledge of Certainty (*Ilm al-Yaqin*)\n\nThe Knowledge of Certainty (*Ilm al-Yaqin*) is that which is provided by the proof (الدليل) that accepts neither flaw nor doubt. The Gnosis of the Eye of Certainty (*Ayn al-Yaqin*) is that which is provided by witnessing (المشاهدة) and unveiling (الكشف). The Gnosis of the Reality of Certainty (*Haqq al-Yaqin*) is that knowledge which is attained in the heart concerning that for which the witnessing was intended.\n\nThe Knowledge of Certainty, by its Eye and its Reality,\nIts proofs appear upon the cosmos (الأكوان).\nWere it not for the existence of the Eye in His Dominion (ملكوت),\nNo affirmation of Unity (توحيد) would stand upon proof.\nLook then at the Reality of Certainty and its Eye,\nIn the world of spirits (الأرواح) and bodies (الأبدان).\nYou will find that from which its secret is formed,\nIn everything that appears from the Fixed Entities (الأعيان).\n\nKnow—may Allah support us and you with a Spirit from Him—that we have known with a certain knowledge (*Ilm Yaqin*) into which no doubt enters, that there is a House in the world called the Ka'ba, in a city called Mecca. It is impossible for anyone to be ignorant of this, or for doubt to enter it, or for any flaw to undermine its proof. Thus, the knowledge of this became settled (استقر), and it was attributed to Certainty (اليقين), which is this very settledness: that Allah has a House called the Ka'ba in a town called Mecca, which people pilgrimage to every year and circumambulate.\n\nThen this House is witnessed upon arrival by the sensible eye (العين المحسوسة). The soul (النفس) thus settles the knowledge of its quality, form, and state through the path of the eye. This was the Eye of Certainty (*Ayn al-Yaqin*), which, before the witnessing, had been the Knowledge of Certainty (*Ilm Yaqin*). By seeing it, the soul attained a taste (ذوقا) that it did not possess before the sight.\n\nThen Allah opened the eye of his inner sight (بصيرة) concerning the fact that this House is attributed to Allah, circumambulated, and intended exclusively, unlike other houses attributed to Allah. He thus knew the cause (علة) and reason (سبب) for this, through Allah’s instruction, not through his own speculation or effort. His knowledge of this was therefore a Reality of Certainty (*Haqq Yaqin*), settled with him and unshakable.\n\nNot every reality (حق) possesses settledness, nor every knowledge (علم), nor every eye (عين). For this reason, the attribution (الإضافة) is valid. If the Knowledge of Certainty, its Eye, and its Reality were the Certainty itself, the attribution would not be valid, because a single thing cannot be attributed to itself. Attribution only occurs between an attributed (مضاف) and that to which it is attributed (مضاف إليه), thus requiring multiplicity (كثرة) for its existence to be valid.\n\nWhoever does not distinguish between Certainty (اليقين) and Knowledge (العلم), and claims that Knowledge is Certainty, yet finds it attributed [to Certainty] in the Book of Allah, is compelled to seek a justification for this attribution so that he may believe in what has come from Allah. He might say that the meaning may be one, but indicated by two different words, so one word is attributed to the other. For they are undoubtedly different in form, despite the oneness of the meaning, and the word ‘Knowledge’ is not the word ‘Certainty.’ Thus, Knowledge is attributed to Certainty due to this difference [in wording]. The attribution is valid in the words, but not in the meaning.\n\nIndeed, whoever resorts to this device does so due to the deficiency of his understanding regarding the meanings indicated by words in their established contexts. If he knew that, he would know that the meaning indicated by the word ‘Knowledge’ is different from the meaning indicated by the word ‘Certainty.’ Now that this has been established, you have understood the meaning of the Knowledge of Certainty, its Eye, and its Reality.\n\nFurthermore, know after this that Certainty (اليقين) in this matter is the object sought, and for this reason, these three [degrees] are attributed to it, and their orbit revolves around it. Whoever achieves settledness (القرار) with Allah, in Allah, by Allah, and alongside Allah, must necessarily have a sign (علامة) of that, which is attributed to Certainty because it is specific to it and can only be a sign of it. That is the Knowledge of Certainty (*Ilm al-Yaqin*).\n\nAnd there must necessarily be a witnessing (شهود) of that sign, its connection to Certainty, and its specificity to it. That is the Eye of Certainty (*Ayn al-Yaqin*). And there must necessarily be the necessity of a judgment (وجوب حكمة) in this Eye and in this Knowledge. Thus, the Knowledge acts only in that wherein it is necessary for it to act, and the Eye looks only at that which it is necessary for it to look at and into. That is the Reality of Certainty (*Haqq al-Yaqin*), which makes the judgment necessary upon the Knowledge and the Eye.\n\nAs for Certainty (اليقين), it is everything that is established, settled, and unshakable, regardless of its type, whether it belongs to the Real (حق) or to Creation (خلق). It possesses Knowledge, Eye, and Reality—meaning the necessity of its judgment—except for the Divine Essence (الذات الإلهية). Its Certainty has nothing but the Reality of Certainty (*Haqq al-Yaqin*). The form of its Reality—meaning the necessity (الوجوب) incumbent upon us regarding it—is silence concerning it and refraining from delving into it, because it is not known. Therefore, there is no Knowledge (علم) to be attributed to Certainty, nor is it witnessed, so the Eye (عين) is not attributed to Certainty. Yet, it possesses the judgment (الحكم) over the entire cosmos (العالم) by commanding the abandonment of delving into it, so it possesses the Reality (الحق), and thus the Reality is attributed to it.\n\nNothing is attributed to Certainty except that which accepts it. If it is something indicated by a sign (علامة), Knowledge (*Ilm*) is attributed to it; if not, it is not attributed. If it is something witnessed (يشهد), the Eye (*Ayn*) is attributed to it; if not, it is not attributed. If it is something that possesses, in reality, a necessary judgment (حكم واجب) upon any of the creatures, even upon itself—such as His saying, the Exalted: <<كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ>> (Your Lord has prescribed mercy upon Himself)—then the Reality (*Haqq*) is attributed to it, and it is called the Reality of Certainty (*Haqq al-Yaqin*) due to its necessity. If none of the aforementioned conditions apply, it is not attributed to any of the preceding terms. I have thus given you a universal principle concerning this matter regarding everything that is certain. It is for you to contemplate the Reality of that Certainty. This much is sufficient. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (says the Truth and guides to the Way). The Eighteenth Journey (السفر الثامن عشر) is concluded.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب دو سو انسٹھ (۲۶۹) علم الیقین (علم اليقين) کی معرفت میں۔\n\nیہ وہ ہے جو اس دلیل سے حاصل ہوتا ہے جو کسی نقص یا شبہ کو قبول نہیں کرتی۔ اور عین الیقین (عين اليقين) کی معرفت وہ ہے جو مشاہدہ (المشاهدة) اور کشف (الکشف) سے حاصل ہوتی ہے۔ اور حق الیقین (حق اليقين) کی معرفت وہ ہے جو قلب میں اس علم سے حاصل ہوتی ہے جس کے لیے وہ شہود (الشهود) مطلوب تھا۔\n\n> علم الیقین (علم اليقين) اپنی عین اور اپنے حق کے ساتھ،\n>\n> اس کے دلائل کائنات پر ظاہر ہوتے ہیں۔\n>\n> اگر اس کی ملکوت میں عین (العين) کی ہستی (الوجود) نہ ہوتی،\n>\n> تو کوئی توحید دلیل پر قائم نہ ہوتی۔\n>\n> پس حق الیقین (حق اليقين) اور اس کی عین (العين) کو دیکھ،\n>\n> عالم ارواح اور اجسام میں۔\n>\n> تو تجھے وہ ملے گا جس سے اس کا راز ہے،\n>\n> ہر اس چیز میں جو اعیان (حقیقتوں) سے ظاہر ہوتی ہے۔\n\nجان لو، اللہ تعالیٰ اپنی روح سے ہماری اور تمہاری تائید فرمائے، کہ ہم نے یقینی علم (علم اليقين) سے جانا ہے جس میں کوئی شبہ داخل نہیں ہوتا کہ دنیا میں ایک گھر ہے جسے کعبہ کہا جاتا ہے، جو مکہ نامی شہر میں ہے۔ کسی کے لیے بھی اس سے ناواقف رہنا ممکن نہیں اور نہ ہی اس میں کوئی شبہ داخل ہو سکتا ہے، اور نہ ہی اس کی دلیل میں کوئی نقص پڑ سکتا ہے۔ پس یہ علم مستحکم ہو گیا، اور اسے یقین (اليقين) کی طرف منسوب کیا گیا جو کہ استقرار (ثبات) ہے۔ کہ اللہ تعالیٰ کا ایک گھر ہے جسے کعبہ کہا جاتا ہے، جو مکہ نامی بستی میں ہے، لوگ ہر سال اس کا حج کرتے ہیں اور اس کا طواف کرتے ہیں۔ پھر جب اس گھر تک پہنچا گیا تو اسے محسوس آنکھ سے دیکھا گیا، پس اس کی کیفیت، ہیئت اور حال نفس کے پاس آنکھ کے ذریعے مستحکم ہو گیا، تو یہ عین الیقین (عين اليقين) تھا جو مشاہدے سے پہلے علم الیقین (علم اليقين) تھا۔ اور اسے دیکھنے سے نفس میں وہ ذوق حاصل ہوا جو دیکھنے سے پہلے اس کے پاس نہیں تھا۔ پھر اللہ تعالیٰ نے اس کی بصیرت کی آنکھ کھول دی کہ وہ گھر اللہ کی طرف منسوب ہے، اس کا طواف کیا جاتا ہے اور اسے مقصود بنایا جاتا ہے، نہ کہ ان دوسرے گھروں کو جو اللہ کی طرف منسوب ہیں۔ پس اس نے اس کی علت اور سبب کو اللہ کے بتانے سے جانا، نہ کہ اپنی نظر اور اجتہاد سے۔ پس اس کا یہ علم حق الیقین (حق اليقين) تھا جو اس کے پاس مستحکم تھا اور متزلزل نہیں ہوتا تھا۔\n\nپس ہر حق کو قرار نہیں ہوتا، نہ ہر علم کو اور نہ ہر عین کو۔ اسی لیے یہ اضافت (نسبت) درست ہوئی۔ اگر علم الیقین (علم اليقين)، اس کی عین اور اس کا حق، خود یقین (اليقين) ہی ہوتا تو اضافت درست نہ ہوتی، کیونکہ ایک چیز کی اضافت خود اپنی طرف نہیں کی جاتی۔ اس لیے کہ اضافت صرف مضاف اور مضاف الیہ کے درمیان ہوتی ہے، لہٰذا اس کے وجود کی صحت کے لیے کثرت (تعدد) کا ہونا ضروری ہے۔ اور جو شخص یقین (اليقين) اور علم (العلم) میں فرق نہیں کرتا اور کہتا ہے کہ علم ہی یقین ہے، حالانکہ یہ کتاب اللہ میں مضاف ہو کر آیا ہے، تو اسے اس میں کوئی ایسی صورت تلاش کرنے کی ضرورت پیش آتی ہے جس سے اس کے لیے اضافت درست ہو جائے تاکہ وہ اللہ کی طرف سے آئی ہوئی چیز پر ایمان لائے۔ چنانچہ اس نے کہا کہ معنی ایک ہو سکتا ہے اور اس پر دو مختلف الفاظ دلالت کرتے ہیں، تو ایک لفظ کی اضافت دوسرے لفظ کی طرف کر دی جاتی ہے، کیونکہ معنی کی وحدت کے باوجود وہ صورت میں بلا شک مختلف ہیں۔ اور لفظ 'علم' لفظ 'یقین' نہیں ہے، لہٰذا اس تغایر کی وجہ سے علم کی اضافت یقین کی طرف کی گئی، پس اضافت الفاظ میں درست ہوئی نہ کہ معنی میں۔ اور جس نے یہ حیلہ کیا، اس نے صرف اس لیے کیا کہ اس کی فہم ان معانی سے قاصر تھی جن پر الفاظ اپنے موضوعات میں دلالت کرتے ہیں۔ اگر وہ یہ جانتا تو اسے معلوم ہوتا کہ لفظ 'علم' کا مدلول لفظ 'یقین' کے مدلول سے مختلف ہے۔\n\nاور جب یہ بات ثابت ہو گئی تو آپ علم الیقین (علم اليقين)، اس کی عین اور اس کے حق کا معنی جان چکے ہیں۔ پھر اس کے بعد جان لو کہ اس مسئلے میں یقین (اليقين) ہی مطلوب ہے، اور اسی وجہ سے یہ تینوں اس کی طرف منسوب کیے گئے اور ان کا مدار اسی پر تھا۔ پس جس کے لیے اللہ کے پاس، اللہ میں، اللہ کے ذریعے، اللہ کے ساتھ ثبات (قرار) ثابت ہو جائے، تو اس کے لیے اس کی کوئی علامت ہونا ضروری ہے جو یقین کی طرف منسوب ہو، کیونکہ وہ اسی کے ساتھ مخصوص ہے اور صرف اسی کی علامت ہو سکتی ہے۔ پس یہی علم الیقین (علم اليقين) ہے۔ اور اس علامت کا شہود (الشهود) اور اس کا یقین (اليقين) سے تعلق اور اس کے ساتھ اس کا اختصاص ضروری ہے۔ پس یہی عین الیقین (عين اليقين) ہے۔ اور اس عین اور اس علم میں حکمت کا واجب ہونا ضروری ہے۔ پس علم صرف اسی میں تصرف کرتا ہے جس میں اسے تصرف کرنا واجب ہو، اور عین صرف اسی چیز کو دیکھتی ہے جس کو دیکھنا اس پر واجب ہو اور جس میں دیکھنا واجب ہو۔ پس یہی حق الیقین (حق اليقين) ہے جسے اس نے علم اور عین پر واجب کیا۔\n\nاور جہاں تک یقین (اليقين) کا تعلق ہے، تو یہ ہر وہ چیز ہے جو ثابت ہو، مستحکم ہو اور متزلزل نہ ہو، خواہ وہ حق (الحق) ہو یا خلق (الخلق)، کسی بھی نوعیت کا ہو۔ پس اس کے لیے علم (علم)، عین (عين) اور حق (حق) یعنی اس کے حکم کا وجوب ہوتا ہے۔ سوائے ذات الٰہیہ (الذات الإلهية) کے، تو اس کا یقین (اليقين) حق الیقین (حق اليقين) کے سوا کچھ نہیں ہے۔ اور اس کے حق کی صورت، یعنی ہم پر اس کا وجوب، اس کے بارے میں خاموشی اختیار کرنا اور اس میں غور و خوض ترک کرنا ہے، کیونکہ وہ معلوم نہیں ہو سکتی۔ پس وہاں کوئی علم نہیں ہے جو یقین کی طرف منسوب ہو، اور نہ ہی اس کا شہود (الشهود) ہوتا ہے، لہٰذا عین (العين) کی اضافت یقین کی طرف نہیں کی جاتی۔ اور اس (ذات) کا حکم پوری دنیا پر یہ ہے کہ اس میں غور و خوض ترک کر دیا جائے، لہٰذا اس کے لیے حق (الحق) ہے، پس اس کی اضافت اس کی طرف کی گئی۔ پس یقین (اليقين) کی طرف صرف وہی چیز منسوب کی جاتی ہے جسے وہ قبول کرے۔ اگر وہ ایسی چیز ہو جس پر کوئی علامت دلالت کرتی ہو تو علم (العلم) کی اضافت اس کی طرف کی جاتی ہے، اور اگر نہ ہو تو اس کی اضافت نہیں کی جاتی۔ اور اگر وہ ایسی چیز ہو جس کا مشاہدہ (شہود) کیا جائے تو عین (العين) کی اضافت اس کی طرف کی جاتی ہے، اور اگر نہ ہو تو اس کی اضافت نہیں کی جاتی۔ اور اگر وہ ایسی چیز ہو جس کا نفس الامر میں مخلوقات میں سے کسی پر کوئی واجب حکم ہو، یہاں تک کہ خود اس پر بھی، جیسا کہ اللہ تعالیٰ کا فرمان ہے: \"تمہارے رب نے اپنے اوپر رحمت لکھ لی ہے\" (كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ) [الأنعام: ۵۴]، تو حق (الحق) کی اضافت اس کی طرف کی جاتی ہے اور اس کے وجوب کی وجہ سے اسے حق الیقین (حق اليقين) کہا جاتا ہے۔ اور اگر ان مذکورہ چیزوں میں سے کوئی بھی نہ ہو تو اس کی اضافت کسی بھی سابقہ چیز کی طرف نہیں کی جاتی۔ پس میں نے تمہیں اس مسئلے میں ہر متقین (یقینی چیز) کے بارے میں ایک کلی امر عطا کر دیا ہے۔ اب تم اس یقین کی حقیقت میں غور کر سکتے ہو۔ اور یہ مقدار کافی ہے۔ اور اللہ تعالیٰ حق (الْحَقَّ) فرماتا ہے اور وہی راستہ دکھاتا ہے (وهُوَ يَهْدِي السَّبِيلَ)۔ اٹھارہواں سفر ختم ہوا۔\n\n(بسم الله الرحمن الرحيم)",
    "fa": "«باب دویست و شصت و نهم در معرفت علم الیقین (علم اليقين)»\n\nو آن (علم الیقین) چیزی است که دلیلِ عاری از نقص و شبهه آن را افاده کند. و معرفت عین الیقین (عين اليقين) چیزی است که مشاهده و کشف (الکشف) آن را افاده کند. و معرفت حق الیقین (حق اليقين) چیزی است که از علم در قلب حاصل شود به واسطه آنچه آن شهود (الشهود) برایش اراده شده است.\n\n> علم الیقین (علم اليقين) با عین و حقش، دلایلش بر کائنات آشکار می‌شود.\n> اگر هستی (الوجود) عین در ملکوتش نبود، توحیدی بر برهان استوار نمی‌شد.\n> پس به حق الیقین (حق اليقين) و عینش در عالم ارواح و ابدان بنگر.\n> خواهی یافت آن سری را که از اوست، در هر آنچه از اعیان پدیدار می‌شود.\n\nبدان، خداوند ما و شما را به روحی از جانب خود تأیید کند، که ما به علم یقینی که شبهه‌ای در آن راه ندارد، دانسته‌ایم که در جهان خانه‌ای به نام کعبه در شهری به نام مکه وجود دارد. هیچ کس را امکان جهل به این امر نیست و شبهه‌ای در آن راه نمی‌یابد و نقصی در دلیل آن وارد نمی‌شود. پس علم به این امر استقرار یافت و به یقین (اليقين) که همان استقرار است، اضافه شد که خداوند خانه‌ای به نام کعبه در قریه‌ای به نام مکه دارد که مردم هر سال به حج آن می‌روند و طوافش می‌کنند. سپس این خانه هنگام رسیدن به آن با چشم محسوس مشاهده شد، و کیفیت، هیئت و حال آن از طریق چشم در نفس استقرار یافت. پس آن، عین الیقین (عين اليقين) بود که پیش از شهود (الشهود)، علم الیقین (علم اليقين) بود. و با دیدن آن، در نفس ذوقی حاصل شد که پیش از رؤیت وجود نداشت. سپس خداوند چشم بصیرت او را گشود در اینکه آن خانه منسوب به خداست و مطاف و مقصود است، نه دیگر خانه‌هایی که به خدا منسوب‌اند. پس علت و سبب آن را به آگاهی خداوند دانست، نه با نظر و اجتهاد خود. پس علم او به این امر، حق الیقین (حق اليقين) ثابت و استوار بود که متزلزل نمی‌شد.\n\nزیرا هر حقی استقرار ندارد، و نه هر علمی و نه هر عینی. از این رو اضافه (نسبت) صحیح است. اگر علم الیقین (علم اليقين) و عین الیقین (عين اليقين) و حق الیقین (حق اليقين) عین یقین (اليقين) بودند، اضافه صحیح نبود، زیرا شیء واحد به خودش اضافه نمی‌شود. اضافه تنها میان مضاف و مضاف‌الیه صورت می‌گیرد و نیازمند کثرت است تا وجودش صحیح باشد. و کسی که میان یقین و علم فرق نگذارد و بگوید علم همان یقین است، در حالی که در کتاب خدا به صورت مضاف آمده است، نیازمند یافتن وجهی برای صحت این اضافه می‌شود تا به آنچه از جانب خدا آمده ایمان آورد. پس می‌گوید: ممکن است معنا یکی باشد و دو لفظ مختلف بر آن دلالت کنند، و یکی از دو لفظ به دیگری اضافه شود. زیرا این دو لفظ در صورت، بدون شک، با وجود وحدت معنا، متفاوت‌اند. و لفظ علم، لفظ یقین نیست. پس علم به یقین اضافه شد به خاطر این تفاوت، و اضافه در الفاظ صحیح شد نه در معنا. و کسی که این حیله را به کار برد، تنها به دلیل کوتاهی فهمش از معانی‌ای بود که الفاظ در موضوعات بر آن‌ها دلالت می‌کنند. اگر این را می‌دانست، درمی‌یافت که مدلول لفظ علم غیر از مدلول لفظ یقین است. و چون این امر مقرر شد، معنای علم الیقین (علم اليقين) و عین الیقین (عين اليقين) و حق الیقین (حق اليقين) را دانستی.\n\nسپس پس از این، بدان که یقین (اليقين) در این مسئله مطلوب است و به همین دلیل این سه (علم، عین، حق) به آن اضافه شده‌اند و مدارشان بر آن است. پس هر کس که استقرار نزد خدا، در خدا، به واسطه خدا، و همراه خدا برایش ثابت شود، ناگزیر باید نشانه‌ای بر آن داشته باشد که به یقین اضافه شود، زیرا آن نشانه مخصوص یقین است و جز بر آن نشانه نمی‌شود. پس آن، علم الیقین (علم اليقين) است. و ناگزیر باید آن نشانه مشاهده شود و به یقین تعلق یابد و مخصوص آن باشد. پس آن، عین الیقین (عين اليقين) است. و ناگزیر باید حکمتی در این عین و در این علم واجب باشد. پس علم جز در آنچه تصرف در آن بر او واجب است، تصرف نمی‌کند، و چشم جز به آنچه نظر کردن به آن و در آن بر او واجب است، نمی‌نگرد. پس آن، حق الیقین (حق اليقين) است که بر علم و عین واجب شده است.\n\nو اما یقین (اليقين)، هر چیزی است که ثابت و مستقر شده و متزلزل نشده باشد، از هر نوعی که باشد، چه حق و چه خلق. پس برای آن علم و عین و حق (یعنی وجوب حکمش) وجود دارد، مگر ذات الهی. یقین ذات الهی چیزی جز حق الیقین (حق اليقين) ندارد. و صورت حق آن، یعنی وجوب ما در قبال آن، سکوت و ترک خوض در آن است، زیرا ذات الهی دانسته نمی‌شود. پس نه علمی هست که به یقین اضافه شود، و نه مشاهده می‌شود، پس عین به یقین اضافه نمی‌شود. و ذات الهی بر تمام عالم حکم دارد که از خوض در آن خودداری کنند، پس حق برای اوست و به او اضافه شد. پس به یقین اضافه نمی‌شود مگر آنچه آن را بپذیرد. اگر چیزی باشد که نشانه بر آن دلالت کند، علم به آن اضافه می‌شود، و اگر نباشد، اضافه نمی‌شود. و اگر چیزی باشد که مشاهده شود، عین به آن اضافه می‌شود، و اگر نباشد، اضافه نمی‌شود. و اگر چیزی باشد که در نفس‌الامر حکمی واجب بر یکی از مخلوقات داشته باشد، حتی بر خودش، مانند این فرموده خداوند متعال: **كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ** (پروردگارتان رحمت را بر خود واجب کرده است) [انعام: ۵۴]، حق به آن اضافه می‌شود و حق الیقین (حق اليقين) نامیده می‌شود به دلیل وجوبش. و اگر هیچ یک از آنچه ذکر کردیم نباشد، به هیچ یک از موارد پیشین اضافه نمی‌شود. پس من در این مسئله، امری کلی در مورد هر امر یقینی به تو دادم، و تو می‌توانی در حقیقت آن یقین نظر کنی. و این مقدار کافی است. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه می‌نماید) [احزاب: ۴]. سفر هجدهم به پایان رسید.\n\n(بسم الله الرحمن الرحيم)"
  },
  "page_count": 2
}