{
  "id": 471,
  "title": {
    "ar": "الباب الأحد والسبعون وأربعمائة في معرفة حال قطب كان منزله قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله ويَغْفِرْ لَكُمْ ذُنُوبَكُمْ والله غَفُورٌ رَحِيمٌ",
    "en": "Chapter Four Hundred and Seventy-One: Concerning the Knowledge of the State (حال) of a Pole (قطب) Whose Station (منزل) Was: <<قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله ويَغْفِرْ لَكُمْ ذُنُوبَكُمْ والله غَفُورٌ رَحِيمٌ>> (Say: If you love Allah, then follow me, [and] Allah will love you and forgive you your sins. And Allah is Forgiving, Merciful.)",
    "ur": "باب چار سو اکہتر (۴۷۱): ایک قطب (Quṭb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) یہ تھا:\n\"قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله ويَغْفِرْ لَكُمْ ذُنُوبَكُمْ والله غَفُورٌ رَحِيمٌ\"\n(کہہ دیجیے: اگر تم اللہ سے محبت رکھتے ہو تو میری پیروی کرو، اللہ تم سے محبت کرے گا اور تمہارے گناہ بخش دے گا، اور اللہ بہت بخشنے والا، نہایت رحم کرنے والا ہے۔)",
    "fa": "باب چهارصد و هفتاد و یکم در معرفت حال قطبی (قطب) که منزل او بود: قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله ويَغْفِرْ لَكُمْ ذُنُوبَكُمْ والله غَفُورٌ رَحِيمٌ (بگو: اگر خدا را دوست می‌دارید، از من پیروی کنید تا خدا شما را دوست بدارد و گناهانتان را بر شما ببخشاید؛ و خداوند آمرزنده و مهربان است.)"
  },
  "content": {
    "ar": "## «الباب الأحد والسبعون وأربعمائة في معرفة حال قطب كان منزله قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله ويَغْفِرْ لَكُمْ ذُنُوبَكُمْ والله غَفُورٌ رَحِيمٌ»\n\n\n> إذا أحببت ربك باتباع *** أحبك مثل ذلك ثم زاد\n\n\n> على الحب المضاعف سترضون *** أتتك به السيادة حين سادا\n\n\n> وإن أحببته بخلاف هذا *** أفدت ولم تكن ممن أفادا\n\n\n### [عبادة حقيقية جبرية وعبادة اختيارية]\n\n\nوقال صَلَّى اللهُ عَليهِ وسَلَّم عن الله إن الله تعالى يقول ما تقرب المتقربون بأحب إلي من أداء ما افترضته عليهم ولا يزال العبد يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت له سمعا وبصرا ويدا ومؤيدا\n\n\nوقد ورد أتم من هذا فهذا الهجير إذا التزمه العبد أو من التزمه وتحقق به فتح عليه في معرفة نفسه وربه وعلم إن عبادة الفرائض عبادة حقيقية جبرية وعبادة النوافل عبادة اختيارية فيها رائحة ربوبية لأنها تواضع والتواضع تعمل لا يقوم إلا ممن له سهم في الرفعة والعبد ليس له نصيب في السيادة ولهذا ورد العبد من لا عبد له فلهذا نقص عن درجة الفرض النفل لأن العبد نقصه من العلم بالأمر على قدر ما اعتقده من النفل بل من أول قدم في النفل اتصف بالنقص في العلم بما هو الأمر عليه وهذا علم شريف يورث سعادة لمن قام به لا تشبهها سعادة وذلك أن العبد هو عبد لذاته ولكن لا تعقل له عبودية ما لم يعقل له استناد إلى سيد والرب رب لذاته ولكن لا يعقل له ربوبية ما لم يعقل له مربوب هو مستنده فكل واحد سند للآخر فالمعلوم أعطى العلم للعالم فصيره عالما والعلم صير المعلوم معلوما ومن حيث ارتفاع هذا الذي قلناه فلا عالم ولا معلوم ولا رب ولا مربوب وليس الأمر إلا عالم ومعلوم ورب ومربوب وهو الذي عليه الوجود فليتكلم بما أعطاه الوجود والشهود وليترك وهميات الجائز العقلي فإن القول بذلك له موطن خاص في ذلك الموطن سلطانه فنقول‏\n\n\nقد أخبر الله تعالى أن لله عبادا يحبهم ويحبونه‏\n\n\nفجعل محبتهم وسطا بين محبتين منه لهم فأحبهم فوفقهم بهذه المحبة لاتباع رسوله فيما جاءهم به من الواجبات عليهم والترغيب في إن يوجبوا على أنفسهم صورة ما أوجبه عليهم يسمى نافلة ثم أعلمهم أنهم إذا اتبعوه فيما جاء به أحبهم فهذا الحب الإلهي الثاني ما هو عين الأول فالأول حب عناية والثاني حب جزاء وكرامة بوافد محبوب‏\nبالحب الأول فصار حب العبد ربه محفوظا بين حبين إلهيين كلما أراد أو هم أن يخرج عن هذا الوصف بالسلو وجد نفسه محصورا بين حبين إلهيين فلم يجد منفذا فبقي محفوظ العين بين حب عناية ما فيها من فطور وبين حب كرامة ما فيها استدراج والحصر بين أمرين يوجب اضطرارا فذلك حب الفرض وهو العبد المضطر في عبوديته المجبور بما فرض الله عليه لينبهه أنه في قبضة الحق محصور لا انفكاك له ولا نفوذ كما رسمناه في الهامش ولما رأى أن الحق كلفه علم أنه لو لم يعلم الحق في العبد اقتدارا على إتيان ما كلفه به من الأعمال ما كلفه به فكان التكليف له معرفا بأن له مدخلا في الاقتدار على وجود الفعل الذي كلفه الله إيجاده وقرر ذلك عنده بما شرع له من طلب المعونة من الله على ذلك فزاده هذا قوة في علمه بأن له اقتدارا ثم نظر فيما أوجب عليه فرأى ذلك قليلا مما هو عليه من الاتساع فعلم عند ذلك أن الاتساع الذي أبقى له إنما أبقاه لما له من الاقتدار فأراد أن يبتليه ليرى ما يخرج منه في ذلك الاقتدار الذي أعطاه وليس له فيما يخرج فيه ذلك الاقتدار إلا تلك السعة التي أبقى له كما قال إِنَّ لَكَ في النَّهارِ سَبْحاً طَوِيلًا فعمر ذلك الفراغ هذا العبد بالنوافل ولا يكون نافلة حتى يكمل الفرض فحصل بذلك من الله حبان آخر إن حب الفرائض أي الحب الذي حصل له من إتيانه بالفرائض والحب الذي حصل له أيضا من الله من إتيان النوافل وإن كان دون الحب الأول كما هو في الأصل حب الكرامة دون حب العناية فإنه حب جزاء فلا يخلص خلوص الحب الأول كما\n\n\nورد في الخبر أن الرجل إذا قال لأخيه أحبك فأحبه الآخر فإنه لا يلحقه في درجته في الحب أبدا\n\n\nلأن حب الأول ابتداء وحب الثاني جزاه فلن يكافئه أبدا فإن الحب الأول هو الذي أنتج الحب الثاني فهو منفعل عنه والمنفعل لا يقوي قوة الفاعل أبدا فلما عمر ذلك الفراغ الواسع بالنوافل وجعل الله فيها فرائض لتتأيد بها النوافل في اللحوق بالفرائض ولهذا تسد مسدها وتكمل بها الفرائض بما فيها من الفرائض كما\n\n\nورد في الخبر الصحيح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن الله يقول في موازنة الأعمال إذا لم يتم العبد فرضه أن يكمل له فريضته من تطوعه إن كان له تطوع‏\n\n\nوهو النفل فلذلك كان في النفل فروض لأن كل نفل فهو على صورة فرضه من صلاة وصدقة وصيام وحج واعتمار فله الخيار في الإتيان بالنفل ما لم يتلبس به فإذا تلبس به قيل له لا تُبْطِلُوا أَعْمالَكُمْ فبالأولية في ذلك كان مختارا وفي التلبس مضطرا عندنا وبخلافه عند علماء الرسوم ومن أَوْفى‏ بِما عاهَدَ عَلَيْهُ الله والشروع عهد عهده مع الله بلا شك فيما لم يجب عليه ولهذا قال هل على غيرها قال لا إلا أن تطوع فدخل الاحتمال في هذا الإجمال ولما لم يكن في أداء الفرض رائحة ربوبية توجب له إن شاء فعل وإن شاء لم يفعل كما هو في النفل كان في الفرض عبد اضطرار بلا شك مجبورا فأدركه الانكسار في نفسه لما كان عليه من العزة في كونه أعطى العلم لله به فجبر الله انكساره بقوله ما يُبَدَّلُ الْقَوْلُ لَدَيَّ فأزال عن نفسه بهذا الخطاب إن شاء وإن شاء وما أبقى له إلا عين ما شاء لا التخيير في ذلك فلما سمع العبد مثل هذا انجبر كسره وعلم إن الله لا يقول مجازا وأن الأمر لما كان في نفسه على هذا ما صح أن يقول مثل هذا القول فزال الانكسار الذي كان عنده وهوقوله تعالى في الخبر المترجم عنه أنا عند المنكسرة قلوبهم من أجلي‏\n\n\nأي أنا كسرت قلوبهم بما أوجبته عليهم وأدخلتهم فيه من الاضطرار وأنزلتهم من معقل عزتهم بذلك فلما انكسروا كان عندهم في هذا الكسر جابرا بما أوجبه على نفسه وما أخبر به أنه ما يبدل القول لديه وأن الكلمة منه حقت وأزال الاختيار بإزالة الإمكان من العالم فلم يبق إلا واجب بنفسه أو واجب بغيره وهما وصفان لموصوف واحد ولموصوفين وليس في الكون إلا الرب والمربوب ثم أعطاه بما خيره فيه في هذا الاتساع من المسمى نفلا حكم الاختبار الإلهي في قوله إن شاء وإن شاء فكساه حلته بل العبد أولى بصفة الاختيار من صفة الاضطرار لأن له التردد بالحقيقة لإمكانه وليس عند الحق ذلك فإذا ظهر مثل هذا من الحق فتعلم إن الحق ظهر\nفي صورة ممكن ولهذا نادبنا في قولنا إن الله لا ينبغي أن يقال إنه يجوز أن يفعل كذا ويجوز أن لا يفعله ونقول يجوز أن يكون هذا الممكن ويجوز أن لا يكون كما أنه إذا ظهر الاضطرار من العبد إنما يظهر ذلك منه بصورة حق لا بنفسه لأنه لا يكون عبدا إلا بقيامه بمراسم سيده وهو مسلوب الفعل بالأصالة فلا بد أن تظهر بصورة حق إذا ظهر بعبوديته التي هي العمل بما كلف فعله ولذلك لم يقل الحق إنه هوية الشي‏ء وإنما قال إنه هوية العبد فعلمنا إن حكم العبد ما هو حكم الشي‏ء فحكم النفل أحق بالعبد لو لا ما فيه من روائح الربوبية وحكم الفرض أحق بالرب لو لا ما فيه من روائح العبودية فليجعل حكم كل واحد في الموطن الذي جعله الله فيكون الله هو الجاعل لا نحن فنخلص ونسلم من الاعتراض علينا عند السؤال من الله إيانا\n\n\n### [إن الله تعالى جعل في محبة الجزاء غفر الذنوب‏]\n\n\nثم إن الله تعالى جعل في محبة الجزاء وهي محبة الكرامة غفر الذنوب وهو سترها وختم الآية بأنه لا يُحِبُّ الْكافِرِينَ والكافر الساتر وهو تعالى ساتر الذنوب فعلمنا أنه لا يحب من عباده من يستر نعمه كانت النعم ما كانت فإنه قال وأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ وما تحدث به لم يستر وقال التحدث بالنعم شكر وإذا أنعم الله على عبد نعمة أحب أن ترى عليه ونعمه التي أسبغها على عباده ظاهرة وباطنة ومن ستر نعمة الله فقد كفر بها ومن كفر بها أذاقه الله لِباسَ الْجُوعِ والْخَوْفِ بصنيعة ذلك ولهذا قيد الله ستره بالذنوب وهي البقايا التي أبقاها الله لعباده ليتعلموا الأدب مع الله فينسبون الطاعة والخير لله ويجعلونه بيد الله وينسبون الذنب والمعصية لنفوسهم فلهذا قلنا أبقاها الله فهذا نصيبهم مما هو لله فإنه كل من عند الله لكن هؤلاء المحجوبون لا يَكادُونَ يَفْقَهُونَ حَدِيثاً بل يقولون كل ذلك لله في غير الموطن الذي جعله الله لهذا القول وذلك لجهلهم بالمواطن وهذا القدر كاف فإن المجال فيه واسع لاتساع ميدانه لكون العالم ما أوجده الله إلا عن الحب والحب يستصحب جميع المقامات والأحوال فهو سار في الأمور كلها فلذلك يتفصل الأمر فيه إلى غير نهاية وأصل الحب النسب وهي الروابط ومع الروابط لا يثبت توحيد أصلا ولهذا قال بعضهم من وحد فقد أشرك كما يقول من قال بالجمع فقد فرق بلا شك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Seventy-One: Concerning the Knowledge of the State of a Pole whose Station was: <<Say: If you love Allah, then follow me, [and] Allah will love you and forgive you your sins. And Allah is Forgiving, Merciful.>> (Q 3:31)\n\nIf you love your Lord through following,\nHe will love you likewise, and then increase [His love].\n\nYou will be satisfied with the doubled love;\nSovereignty came to you through it when He reigned.\n\nBut if you love Him contrary to this,\nYou will benefit, but you will not be among those who benefit [others].\n\n### [True Compulsory Worship and Voluntary Worship]\n\nThe Prophet (PBUH) related from Allah that Allah the Exalted says: \"My servants do not draw near to Me with anything more beloved to Me than the performance of what I have made obligatory upon them. And My servant continues to draw near to Me through supererogatory acts (النوافل) until I love him. When I love him, I am his hearing with which he hears, his sight with which he sees, his hand with which he strikes, and his supporter (مؤيدا).\"\n\nSomething more complete than this has been transmitted. If the servant adheres to this path or whoever adheres to it and realizes it, a door will be opened for him in the gnosis (معرفة) of his self and his Lord. He will know that the worship of obligatory duties (الفرائض) is true compulsory worship (عبادة حقيقية جبرية), and the worship of supererogatory acts is voluntary worship (عبادة اختيارية) which contains a scent of Lordship (رائحة ربوبية). This is because it is humility (تواضع), and humility is an act that can only proceed from one who has a share in exaltation (الرفعة). The servant (العبد) has no portion in sovereignty (السيادة). For this reason, it was transmitted: \"The servant is he who has no servant.\" Therefore, the supererogatory act (النفل) falls short of the degree of the obligatory duty (الفرض). This is because the servant’s knowledge of the Command (الأمر) is deficient to the extent that he believes in the supererogatory act; rather, from the very first step into the supererogatory act, he is characterized by deficiency in the knowledge of what the Command truly is.\n\nThis is a noble knowledge (علم شريف) that bequeaths felicity (سعادة) to whoever establishes it, a felicity unlike any other. This is because the servant is a servant by his Essence (لذاته), but servitude (عبودية) cannot be conceived for him unless reliance upon a Master (سيد) is conceived for him. And the Lord (الرب) is a Lord by His Essence (لذاته), but Lordship (ربوبية) cannot be conceived for Him unless a creature (مربوب) who is His support (مستنده) is conceived for Him. Thus, each is a support (سند) for the other. The Known (المعلوم) gave knowledge (العلم) to the Knower (العالم) and made him a Knower, and Knowledge made the Known Known. From the perspective of the elevation of what we have stated, there is neither Knower nor Known, neither Lord nor creature. Yet, the matter is nothing but Knower and Known, and Lord and creature, and this is what Existence (الوجود) rests upon. So let [the speaker] speak according to what Existence and Witnessing (الشهود) have granted him, and let him abandon the illusions of rational possibility (الجائز العقلي), for the discourse concerning that has a specific station (موطن خاص) where its authority (سلطانه) resides. So we say:\n\nAllah the Exalted has informed us that He has servants whom He loves and who love Him.\n\nHe placed their love between two loves from Him for them. He loved them [first], and by this love, He granted them success (وفقهم) in following His Messenger concerning the obligations (الواجبات) that came to them, and in encouraging them to make obligatory upon themselves a form of what He made obligatory upon them, which is called the supererogatory act (نافلة). Then He informed them that if they followed him in what he brought, He would love them. This second Divine Love (الحب الإلهي الثاني) is not the same as the first. The first is the love of providence/care (حب عناية), and the second is the love of recompense and honor (حب جزاء وكرامة) for a beloved arrival through the first love.\n\nThus, the servant’s love for his Lord is preserved between two Divine Loves. Whenever he intends or imagines departing from this description through negligence (بالسلو), he finds himself confined (محصورا) between the two Divine Loves, finding no escape. He remains preserved in his essence (محفوظ العين) between the love of providence, which has no defect (فطور), and the love of honor, which has no gradual enticement (استدراج). Confinement between two matters necessitates compulsion (اضطرارا). That is the love of the obligatory duty (حب الفرض), and that is the servant who is compelled (المضطر) in his servitude, constrained (المجبور) by what Allah has made obligatory upon him, so that He may alert him that he is confined within the grasp of the Real (قبضة الحق), with no release or escape, as we have drawn in the margin.\n\nWhen he saw that the Real (الحق) had charged him (كلفه), he knew that if the Real had not known in the servant the capacity (اقتدارا) to perform the actions with which He charged him, He would not have charged him. Thus, the charging (التكليف) informed him that he had an entry point into the capacity for the existence of the act that Allah charged him to bring into existence. He confirmed this knowledge by what He legislated for him: the seeking of assistance (المعونة) from Allah for that, which increased his strength in his knowledge that he possessed capacity.\n\nThen he looked at what was made obligatory upon him and saw that it was little compared to the vastness (الاتساع) that remained for him. He then knew that the vastness that remained for him was only preserved for him because of the capacity he possessed. So [Allah] desired to test him (يبتليه) to see what would issue forth from him in that capacity He granted him. And he has nothing in which that capacity issues forth except that vastness which He preserved for him, as He said: <<Indeed, for you there is prolonged swimming (or occupation) during the day.>> (Q 73:7)\n\nThis servant filled that emptiness (الفراغ) with supererogatory acts (النوافل). An act is not supererogatory until the obligatory duty is completed. Through this, two other loves were obtained from Allah: the love of the obligatory duties—that is, the love resulting from performing the obligatory duties—and the love also obtained from Allah from performing the supererogatory acts. Although [the latter] is less than the first love, just as in the origin, the love of honor (حب الكرامة) is less than the love of providence (حب العناية), because it is a love of recompense (حب جزاء). It is not as pure as the first love, just as it was transmitted in the report:\n\nThat when a man says to his brother, \"I love you,\" and the other loves him back, the second will never reach the degree of the first in love.\n\nBecause the love of the first is an initiation (ابتداء), and the love of the second is a recompense (جزاه), he will never match it. The first love is what produced the second love; thus, the second is passive (منفعل) to it, and the passive can never equal the strength of the active (الفاعل).\n\nWhen he filled that wide emptiness with supererogatory acts, Allah placed obligatory duties within them so that the supererogatory acts might be supported in catching up with the obligatory duties. For this reason, they take their place and complete the obligatory duties through the obligatory duties contained within them, as was transmitted in the authentic report (الخبر الصحيح) from the Messenger of Allah (PBUH) that Allah says, when weighing deeds, if the servant has not completed his obligatory duty, that He should complete his obligatory duty for him from his voluntary acts (تطوعه), if he has voluntary acts.\n\nThis is the supererogatory act (النفل). Therefore, there are obligatory duties within the supererogatory act, because every supererogatory act is in the form of its corresponding obligatory duty: prayer, charity, fasting, Hajj, and Umrah. The servant has the choice (الخيار) in performing the supererogatory act until he engages in it. Once he engages in it, he is told: <<Do not invalidate your deeds.>> (Q 47:33) In the initial stage, he was choosing (مختارا), but in the engagement, he is compelled (مضطرا) according to us [Sufis], contrary to the scholars of external forms (علماء الرسوم). And <<whoever fulfills his covenant with Allah>> (Q 9:111). The commencement [of the act] is a covenant he made with Allah regarding something that was not obligatory upon him, without a doubt. For this reason, [the Prophet] said [to the man asking about prayer]: \"Is there anything else upon me?\" He said: \"No, unless you volunteer (تطوع).\" Thus, possibility (الاحتمال) entered into this generality.\n\nSince the performance of the obligatory duty (الفرض) contains no scent of Lordship (رائحة ربوبية) that would necessitate that if He wills, He acts, and if He wills, He does not act—as is the case in the supererogatory act—the servant in the obligatory duty is undoubtedly a servant of compulsion (عبد اضطرار), constrained (مجبورا). He was overcome by brokenness (الانكسار) in his soul due to the pride (العزة) he possessed in having granted knowledge to Allah concerning him. So Allah mended his brokenness by His saying: <<The Word shall not be changed with Me.>> (Q 50:29) By this address, He removed from Himself the possibility of \"if He wills and if He wills not,\" and left for Himself only the very thing He willed, without choice (التخيير) in the matter.\n\nWhen the servant heard something like this, his brokenness was mended, and he knew that Allah does not speak metaphorically, and that since the matter was inherently thus, it was not correct for Him to utter such a statement [implying choice]. Thus, the brokenness he felt vanished, which is what is referred to in the translated report: \"I am with those whose hearts are broken for My sake.\" That is, \"I broke their hearts by what I made obligatory upon them and by the compulsion (الاضطرار) I introduced them into, and I brought them down from the stronghold of their pride (معقل عزتهم) by that.\" When they were broken, they found in this brokenness a mender (جابرا) through what He made obligatory upon Himself and what He informed them: that the Word shall not be changed with Him, and that the word from Him is established (حقت).\n\nHe removed choice (الاختيار) by removing possibility (الإمكان) from the world (العالم). Nothing remained except the Necessary by itself (واجب بنفسه) or the Necessary by another (واجب بغيره), and these are two descriptions for a single described entity, or for two described entities. There is nothing in the cosmos (الكون) except the Lord and the creature (المربوب).\n\nThen, by what He gave him choice in—in this vastness called the supererogatory act (نفلا)—He bestowed upon him the ruling of Divine testing (حكم الاختبار الإلهي) in His saying: \"If He wills and if He wills not.\" Thus, He clothed him with His garment. Rather, the servant is more deserving of the attribute of choice (صفة الاختيار) than the attribute of compulsion (صفة الاضطرار), because he truly possesses vacillation (التردد) due to his possibility (لإمكانه), while the Real does not possess that. If such a thing appears from the Real, know that the Real has appeared in the form of the possible (صورة ممكن). For this reason, we argue against the statement that it is permissible to say that Allah *may* do such-and-such and *may not* do it. We say: It is permissible that this possible thing exists, and permissible that it does not exist.\n\nSimilarly, when compulsion appears from the servant, it only appears from him in the form of the Real (بصورة حق), not by himself, because he is only a servant by establishing the rites of his Master (مراسم سيده), and he is fundamentally stripped of action (مسلوب الفعل بالأصالة). Therefore, it must appear in the form of the Real when he manifests his servitude, which is the performance of what he was charged to do. For this reason, the Real did not say that He is the identity (هوية) of the thing, but rather He said that He is the identity of the servant. Thus, we know that the ruling of the servant is not the ruling of the thing. The ruling of the supererogatory act (النفل) would be more appropriate for the servant were it not for the scents of Lordship (روائح الربوبية) within it, and the ruling of the obligatory duty (الفرض) would be more appropriate for the Lord were it not for the scents of servitude (روائح العبودية) within it. So let the ruling of each be placed in the station (الموطن) where Allah placed it, so that Allah is the Placer, not us. Thus, we are saved and secure from objection when Allah questions us.\n\n### [Indeed, Allah the Exalted placed the forgiveness of sins in the love of recompense]\n\nFurthermore, Allah the Exalted placed the forgiveness of sins—which is their concealment (سترها)—in the love of recompense, which is the love of honor (محبة الكرامة). He concluded the verse by stating that He <<does not love the disbelievers (الكافرين)>> (Q 3:32). The disbeliever (الكافر) is the concealer (الساتر), and He, the Exalted, is the Concealer of sins (ساتر الذنوب).\n\nThus, we know that He does not love those of His servants who conceal His blessings (نعمه), whatever those blessings may be. For He said: <<But as for the favor of your Lord, report [it].>> (Q 93:11) And what is reported is not concealed. He also said that reporting blessings is gratitude (شكر), and when Allah bestows a blessing upon a servant, He loves to see its effect upon him. His blessings, both manifest and hidden (ظاهرة وباطنة), are poured upon His servants. Whoever conceals Allah’s blessing has disbelieved (كفر) in it, and whoever disbelieves in it, Allah makes him taste <<the garment of hunger and fear>> (Q 16:112) due to that action.\n\nFor this reason, Allah restricted His concealment to sins (الذنوب), which are the remnants (البقايا) that Allah preserved for His servants so that they might learn proper conduct (الأدب) with Allah: they attribute obedience and goodness to Allah and place it in Allah’s hand, and they attribute sin and disobedience to their own souls. This is why we said Allah preserved them. This is their portion of what belongs to Allah, for everything is from Allah (كل من عند الله). But these veiled ones (المحجوبون) <<scarcely understand a word>> (Q 4:87, adapted). Rather, they say, \"All of it is for Allah,\" but not in the station (الموطن) that Allah designated for this statement, due to their ignorance of the stations.\n\nThis much is sufficient, for the field of discussion is vast due to the breadth of its scope, given that Allah only brought the World (العالم) into existence out of Love (الحب). Love accompanies all stations (المقامات) and states (الأحوال); it permeates all matters. Therefore, the matter branches out infinitely. The origin of Love is relationship (النسب) and connection (الروابط). With connections, Unity (توحيد) cannot be established at all. For this reason, some have said, \"Whoever affirms Unity (وحد) has committed polytheism (أشرك),\" just as one who affirms the Gathering (الجمع) has undoubtedly affirmed separation (فرق). And <<Allah speaks the Truth, and He guides to the Way.>> (Q 33:4)",
    "ur": "باب نمبر چار سو اکہتر، اس قطب کے حال کی معرفت میں جس کا مقام یہ آیت تھی: \"کہہ دیجیے: اگر تم اللہ سے محبت رکھتے ہو تو میری پیروی کرو، اللہ تم سے محبت کرے گا اور تمہارے گناہ بخش دے گا، اور اللہ بہت بخشنے والا، نہایت رحم کرنے والا ہے۔\"\n\nجب تم اپنے رب سے پیروی کے ذریعے محبت کرو گے،\nتو وہ بھی تم سے اسی طرح محبت کرے گا، پھر اس میں اضافہ کرے گا۔\n\nاس دوہری محبت پر تم راضی ہو جاؤ گے،\nیہ سیادت (سرداری) تمہارے پاس اس وقت آئی جب وہ غالب ہوا۔\n\nاور اگر تم نے اس کے خلاف محبت کی،\nتو تم نے فائدہ اٹھایا لیکن تم ان میں سے نہ ہو گے جنہوں نے فائدہ پہنچایا۔\n\n### [حقیقی جبری عبادت اور اختیاری عبادت]\n\nاور نبی اکرم صلی اللہ علیہ وسلم نے اللہ تعالیٰ سے روایت کرتے ہوئے فرمایا کہ اللہ تعالیٰ فرماتا ہے: \"مجھ سے قربت حاصل کرنے والوں نے ان چیزوں سے زیادہ محبوب کسی چیز کے ذریعے قربت حاصل نہیں کی جو میں نے ان پر فرض کی ہیں، اور میرا بندہ نوافل کے ذریعے مجھ سے قربت حاصل کرتا رہتا ہے یہاں تک کہ میں اس سے محبت کرنے لگتا ہوں، اور جب میں اس سے محبت کرتا ہوں تو میں اس کا کان، اس کی آنکھ، اس کا ہاتھ اور اس کا مددگار بن جاتا ہوں۔\"\n\nاور اس سے بھی مکمل روایت وارد ہوئی ہے۔ پس یہ ہجیر (دوپہر کی شدید گرمی میں عبادت) جب بندہ یا جو بھی اسے لازم کرے اور اس میں متحقق ہو جائے، تو اس پر اس کے نفس اور اس کے رب کی معرفت (المعرفۃ) میں کشادگی ہوتی ہے، اور وہ جان لیتا ہے کہ فرائض کی عبادت حقیقی جبری عبادت ہے، اور نوافل کی عبادت اختیاری عبادت ہے جس میں ربوبیت (ربوبية) کی بو آتی ہے، کیونکہ یہ تواضع ہے، اور تواضع ایک ایسا عمل ہے جو صرف وہی شخص انجام دے سکتا ہے جس کا رفعت میں کوئی حصہ ہو۔ اور بندے کا سیادت (سرداری) میں کوئی حصہ نہیں ہوتا، اسی لیے یہ بات وارد ہوئی ہے کہ بندہ وہ ہے جس کا کوئی بندہ نہ ہو۔ اسی وجہ سے نفل فرض کے درجے سے کم ہے، کیونکہ بندے نے امر (حکم) کے علم میں اس قدر کمی کی جس قدر اس نے نفل کا اعتقاد رکھا، بلکہ نفل میں پہلے قدم سے ہی وہ اس علم میں نقص سے متصف ہو گیا کہ امر کس چیز پر ہے۔ اور یہ ایک شریف علم ہے جو اسے سعادت عطا کرتا ہے جو اس پر قائم ہو، ایسی سعادت جس کی کوئی مثال نہیں۔\n\nاور وہ اس طرح کہ بندہ اپنی ذات کے اعتبار سے بندہ ہے، لیکن اس کی عبودیت (عبودية) کا تصور نہیں کیا جا سکتا جب تک کہ اس کے لیے کسی آقا کی طرف استناد کا تصور نہ کیا جائے، اور رب اپنی ذات کے اعتبار سے رب ہے، لیکن اس کی ربوبیت (ربوبية) کا تصور نہیں کیا جا سکتا جب تک کہ اس کے لیے کسی مربوب (جس کی پرورش کی جائے) کا تصور نہ کیا جائے جو اس کا مستند ہو۔ پس ہر ایک دوسرے کا سند ہے۔ چنانچہ معلوم نے عالم کو علم دیا اور اسے عالم بنا دیا، اور علم نے معلوم کو معلوم بنا دیا۔ اور جس حیثیت سے ہم نے جو کچھ کہا ہے وہ بلند ہو جاتا ہے، تو نہ کوئی عالم ہے نہ معلوم، نہ کوئی رب ہے نہ مربوب۔ اور معاملہ صرف عالم اور معلوم، اور رب اور مربوب ہی ہے، اور یہی وہ ہے جس پر الوجود (الوجود) قائم ہے۔ پس اسے چاہیے کہ وہ اس چیز کے بارے میں بات کرے جو اسے الوجود (الوجود) اور الشہود (الشہود) نے عطا کیا ہے، اور عقلی جائز کے وہمیات کو چھوڑ دے، کیونکہ اس کے بارے میں بات کرنے کا ایک خاص مقام ہے اور اس مقام میں اس کی حکمرانی ہے۔ پس ہم کہتے ہیں:\n\nاللہ تعالیٰ نے خبر دی ہے کہ اللہ کے ایسے بندے ہیں جو اس سے محبت کرتے ہیں اور وہ ان سے محبت کرتا ہے۔\n\nپس اس نے ان کی محبت کو اپنی طرف سے ان کے لیے دو محبتوں کے درمیان رکھا۔ چنانچہ اس نے ان سے محبت کی اور اس محبت کے ذریعے انہیں رسول کی پیروی کی توفیق دی ان واجبات میں جو ان پر عائد کیے گئے تھے، اور اس بات کی ترغیب دی کہ وہ اپنے اوپر اس چیز کی صورت کو واجب کریں جو اس نے ان پر واجب کیا ہے، جسے نفل کہا جاتا ہے۔ پھر انہیں بتایا کہ جب وہ اس کی پیروی کریں گے جو وہ لائے ہیں تو وہ ان سے محبت کرے گا۔ پس یہ دوسری الٰہی محبت پہلی محبت کی عین نہیں ہے۔ پہلی محبت عنایت (توجہ) کی محبت ہے، اور دوسری محبت جزا اور کرامت کی محبت ہے جو پہلے حب سے محبوب بن کر آنے والے کے لیے ہے۔ پس بندے کی اپنے رب سے محبت دو الٰہی محبتوں کے درمیان محفوظ ہو گئی ہے۔ جب بھی وہ ارادہ کرتا ہے یا گمان کرتا ہے کہ وہ اس وصف سے غفلت کے ذریعے باہر نکل جائے گا، تو وہ خود کو دو الٰہی محبتوں کے درمیان گھرا ہوا پاتا ہے، اور اسے کوئی راستہ نہیں ملتا۔ پس وہ نگاہوں میں محفوظ رہتا ہے، ایک عنایت کی محبت کے درمیان جس میں کوئی فتور نہیں، اور ایک کرامت کی محبت کے درمیان جس میں کوئی استدراج (آہستہ آہستہ پکڑنا) نہیں۔ اور دو چیزوں کے درمیان محصور ہونا اضطرار (مجبوری) کو واجب کرتا ہے۔ پس یہی فرض کی محبت ہے، اور وہ بندہ اپنی عبودیت (عبودية) میں مضطر (مجبور) ہے، اس چیز کے ذریعے مجبور کیا گیا ہے جو اللہ نے اس پر فرض کی ہے تاکہ اسے متنبہ کرے کہ وہ الحق (الحق) کی گرفت میں محصور ہے، اس کے لیے کوئی چھٹکارا یا نفوذ نہیں، جیسا کہ ہم نے حاشیے میں بیان کیا ہے۔\n\nاور جب اس نے دیکھا کہ الحق (الحق) نے اسے مکلف کیا ہے، تو وہ جان گیا کہ اگر الحق (الحق) بندے میں ان اعمال کو بجا لانے کی قدرت نہ جانتا جن کا اسے مکلف کیا گیا ہے، تو وہ اسے مکلف نہ کرتا۔ پس یہ تکلیف اس کے لیے اس بات کی معرفت (المعرفۃ) کا ذریعہ بنی کہ اس کے لیے اس فعل کے وجود میں قدرت کا دخل ہے جسے اللہ نے اس پر واجب کیا ہے۔ اور اس نے اس بات کو اس کے پاس اس چیز کے ذریعے پختہ کیا جو اس نے اس کے لیے اللہ سے مدد طلب کرنے کے لیے مشروع کی، پس اس چیز نے اس کے علم میں اس کی قدرت کو مزید تقویت بخشی۔ پھر اس نے ان چیزوں پر غور کیا جو اس پر واجب کی گئیں، تو اس نے دیکھا کہ یہ اس وسعت کے مقابلے میں بہت کم ہیں جو اس کے پاس ہے۔ تب اسے معلوم ہوا کہ جو وسعت اس کے لیے باقی رکھی گئی ہے، وہ صرف اس لیے باقی رکھی گئی ہے کہ اس میں قدرت ہے۔ پس اس نے چاہا کہ اسے آزمائے تاکہ دیکھے کہ اس قدرت میں سے کیا ظاہر ہوتا ہے جو اسے دی گئی ہے، اور اس قدرت کے ظاہر ہونے میں اس کے پاس اس وسعت کے سوا کچھ نہیں جو اس کے لیے باقی رکھی گئی ہے، جیسا کہ فرمایا: \"بیشک تمہارے لیے دن میں لمبی فرصت ہے۔\" پس اس بندے نے اس فراغ کو نوافل سے آباد کیا، اور کوئی چیز نفل نہیں ہوتی جب تک کہ فرض مکمل نہ ہو جائے۔ پس اس طرح اللہ کی طرف سے دو اور محبتیں حاصل ہوئیں: ایک فرائض کی محبت، یعنی وہ محبت جو اسے فرائض ادا کرنے سے حاصل ہوئی، اور دوسری وہ محبت جو اسے نوافل ادا کرنے سے اللہ کی طرف سے حاصل ہوئی، اگرچہ یہ پہلی محبت سے کم ہے، جیسا کہ اصل میں کرامت کی محبت عنایت کی محبت سے کم ہوتی ہے، کیونکہ یہ جزا کی محبت ہے، لہٰذا یہ پہلی محبت کی طرح خالص نہیں ہوتی، جیسا کہ حدیث میں وارد ہے کہ جب کوئی شخص اپنے بھائی سے کہتا ہے کہ میں تم سے محبت کرتا ہوں، اور دوسرا بھی اس سے محبت کرتا ہے، تو وہ کبھی بھی محبت میں اس کے درجے کو نہیں پہنچ سکتا، کیونکہ پہلی محبت ابتداء ہے اور دوسری اس کی جزا ہے، لہٰذا وہ کبھی بھی اس کا بدلہ نہیں دے سکتا۔ کیونکہ پہلی محبت ہی ہے جس نے دوسری محبت کو پیدا کیا، پس وہ اس سے منفعل ہے، اور منفعل کبھی بھی فاعل کی قوت کو حاصل نہیں کر سکتا۔\n\nپس جب اس نے اس وسیع فراغ کو نوافل سے آباد کیا، اور اللہ نے ان میں فرائض رکھے تاکہ نوافل فرائض سے ملحق ہونے میں ان کے ذریعے مضبوط ہوں، اسی لیے وہ ان کی جگہ لیتے ہیں اور فرائض ان کے ذریعے مکمل ہوتے ہیں، ان فرائض کی وجہ سے جو ان میں شامل ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم سے صحیح حدیث میں وارد ہے کہ اللہ تعالیٰ اعمال کے وزن کے وقت فرماتا ہے کہ اگر بندے نے اپنا فرض مکمل نہ کیا ہو تو اس کے لیے اس کے نفل (تطوع) سے اس کا فرض مکمل کر دیا جائے، اگر اس کے پاس نفل ہو۔ اسی لیے نفل میں فرائض تھے، کیونکہ ہر نفل اپنے فرض کی صورت پر ہوتا ہے، خواہ وہ نماز ہو، صدقہ ہو، روزہ ہو، حج ہو یا عمرہ۔ پس اسے نفل ادا کرنے میں اختیار ہے جب تک کہ وہ اس میں مشغول نہ ہو جائے، اور جب وہ اس میں مشغول ہو جاتا ہے تو اسے کہا جاتا ہے: \"اور اپنے اعمال کو باطل نہ کرو۔\" پس اس کی اولیت میں وہ مختار تھا، اور مشغول ہونے میں ہمارے نزدیک مضطر (مجبور) ہے، جبکہ علماء الرسوم (ظاہری علماء) کے نزدیک اس کے برعکس ہے۔ اور \"جس نے اللہ سے کیے گئے عہد کو پورا کیا\" اور شروع کرنا ایک عہد ہے جو اس نے اللہ سے کیا ہے، بلاشبہ اس چیز میں جو اس پر واجب نہیں تھی۔ اسی لیے آپ صلی اللہ علیہ وسلم نے فرمایا: \"کیا ان کے علاوہ کچھ اور بھی ہے؟\" فرمایا: \"نہیں، مگر یہ کہ تم نفل ادا کرو۔\" پس اس اجمال میں احتمال داخل ہو گیا۔\n\nاور چونکہ فرض کی ادائیگی میں ربوبیت (ربوبية) کی کوئی بو نہیں تھی جو اس کے لیے یہ واجب کرے کہ اگر وہ چاہے تو کرے اور اگر چاہے تو نہ کرے، جیسا کہ نفل میں ہے، اس لیے فرض میں وہ بلاشبہ اضطرار (مجبوری) کا بندہ تھا، مجبور تھا۔ پس اسے اپنے نفس میں انکسار (ٹوٹ پھوٹ) محسوس ہوا، اس عزت کی وجہ سے جو اسے حاصل تھی کہ اس نے اللہ کو اپنے ذریعے علم دیا۔ پس اللہ نے اس کے انکسار کو اپنے اس قول سے جبر کیا: \"میرے پاس بات بدلی نہیں جاتی۔\" پس اس خطاب کے ذریعے اس نے اپنے آپ سے \"اگر چاہے اور اگر چاہے\" کو زائل کر دیا، اور اس کے لیے صرف عین وہ چیز باقی رکھی جو اس نے چاہی، اس میں کوئی اختیار نہیں۔ پس جب بندے نے یہ سنا تو اس کا ٹوٹا ہوا دل جڑ گیا اور وہ جان گیا کہ اللہ مجازی بات نہیں کہتا، اور جب معاملہ اپنی ذات میں ایسا تھا تو اس کے لیے یہ کہنا صحیح نہیں تھا (کہ وہ چاہے تو کرے یا نہ کرے)۔ پس وہ انکسار زائل ہو گیا جو اس کے پاس تھا، اور یہی اللہ تعالیٰ کا وہ قول ہے جس کی ترجمانی حدیث قدسی میں کی گئی ہے: \"میں ان کے پاس ہوں جن کے دل میری خاطر ٹوٹے ہوئے ہیں۔\"\n\nیعنی میں نے ان کے دلوں کو اس چیز کے ذریعے توڑا جو میں نے ان پر واجب کی اور انہیں اس اضطرار (مجبوری) میں داخل کیا، اور اس کے ذریعے انہیں ان کی عزت کے قلعے سے نیچے اتارا۔ پس جب وہ ٹوٹ گئے تو اس ٹوٹ پھوٹ میں ان کے پاس ایک جابر (جوڑنے والا) تھا، اس چیز کے ذریعے جو اس نے اپنے اوپر واجب کی اور جس کی خبر دی کہ اس کے پاس بات بدلی نہیں جاتی، اور یہ کہ اس کی طرف سے کلمہ حق ہو چکا ہے۔ اور اس نے عالم سے امکان کو زائل کر کے اختیار کو زائل کر دیا، پس صرف واجب بالذات یا واجب بالغیر باقی رہا، اور یہ دونوں ایک ہی موصوف کے لیے یا دو موصوفوں کے لیے دو صفات ہیں۔ اور کائنات میں رب اور مربوب کے سوا کچھ نہیں ہے۔ پھر اس نے اس وسعت میں جسے نفل کہا جاتا ہے، جس میں اسے اختیار دیا گیا، اسے اللہ کے اختیار کا حکم عطا کیا، اس کے اس قول میں کہ \"اگر چاہے اور اگر چاہے\"، پس اسے اس کا لباس پہنا دیا۔ بلکہ بندہ اضطرار کی صفت کے مقابلے میں اختیار کی صفت کا زیادہ حقدار ہے، کیونکہ اس کے لیے حقیقت میں تردد (ہچکچاہٹ) ہے اس کے ممکن ہونے کی وجہ سے، اور الحق (الحق) کے پاس یہ نہیں ہے۔ پس جب الحق (الحق) کی طرف سے ایسا ظاہر ہو تو جان لو کہ الحق (الحق) ممکن کی صورت میں ظاہر ہوا ہے۔ اور اسی لیے ہم نے اس بات میں بحث کی ہے کہ اللہ کے بارے میں یہ نہیں کہا جانا چاہیے کہ وہ یہ کام کر سکتا ہے اور یہ بھی ہو سکتا ہے کہ نہ کرے، بلکہ ہم کہتے ہیں کہ یہ ممکن ہو سکتا ہے اور یہ بھی ہو سکتا ہے کہ نہ ہو۔ اسی طرح جب بندے کی طرف سے اضطرار ظاہر ہوتا ہے تو وہ اس کی اپنی ذات سے نہیں بلکہ الحق (الحق) کی صورت میں ظاہر ہوتا ہے، کیونکہ وہ اپنے آقا کے آداب پر قائم ہوئے بغیر بندہ نہیں ہو سکتا، اور وہ اصالتاً فعل سے مسلوب ہے۔ لہٰذا جب وہ اپنی عبودیت (عبودية) کے ساتھ ظاہر ہو جو کہ اس عمل کو کرنا ہے جس کا اسے مکلف کیا گیا ہے، تو ضروری ہے کہ وہ الحق (الحق) کی صورت میں ظاہر ہو۔ اور اسی لیے الحق (الحق) نے یہ نہیں کہا کہ وہ شے کی ہویت (حقیقت) ہے، بلکہ یہ کہا کہ وہ بندے کی ہویت ہے۔ پس ہم نے جانا کہ بندے کا حکم شے کا حکم نہیں ہے۔ پس نفل کا حکم بندے کے لیے زیادہ حقدار ہے اگر اس میں ربوبیت (ربوبية) کی بو نہ ہوتی، اور فرض کا حکم رب کے لیے زیادہ حقدار ہے اگر اس میں عبودیت (عبودية) کی بو نہ ہوتی۔ پس ہر ایک کا حکم اس مقام پر رکھا جائے جہاں اللہ نے اسے رکھا ہے، تاکہ اللہ ہی جاعل (بنانے والا) ہو نہ کہ ہم، پس ہم نجات پائیں اور اللہ کے سوال کے وقت ہم پر اعتراض سے محفوظ رہیں۔\n\n### [بیشک اللہ تعالیٰ نے جزا کی محبت میں گناہوں کی مغفرت رکھی ہے]\n\nپھر بیشک اللہ تعالیٰ نے جزا کی محبت میں، جو کہ کرامت کی محبت ہے، گناہوں کی مغفرت رکھی ہے، اور وہ ان کا پردہ پوشی کرنا ہے۔ اور آیت کا اختتام اس بات پر کیا کہ وہ \"کافروں سے محبت نہیں کرتا\" اور کافر (الکافر) پردہ پوشی کرنے والا ہوتا ہے، جبکہ وہ (اللہ تعالیٰ) گناہوں کا پردہ پوشی کرنے والا ہے۔ پس ہم نے جانا کہ وہ اپنے بندوں میں سے اس سے محبت نہیں کرتا جو اس کی نعمتوں کو چھپائے، نعمتیں خواہ کچھ بھی ہوں۔ کیونکہ اس نے فرمایا: \"اور اپنے رب کی نعمت کا خوب چرچا کرو۔\" اور جس چیز کا چرچا کیا جائے وہ چھپائی نہیں جاتی۔ اور فرمایا کہ نعمتوں کا چرچا کرنا شکر ہے۔ اور جب اللہ کسی بندے پر کوئی نعمت نازل کرتا ہے تو وہ پسند کرتا ہے کہ وہ اس پر دیکھی جائے۔ اور اس کی وہ نعمتیں جو اس نے اپنے بندوں پر پوری کی ہیں، ظاہری اور باطنی ہیں۔ اور جس نے اللہ کی نعمت کو چھپایا، اس نے اس کا کفر کیا، اور جس نے اس کا کفر کیا، اللہ اسے اس عمل کے بدلے \"بھوک اور خوف کا لباس\" چکھائے گا۔ اور اسی لیے اللہ نے اپنی پردہ پوشی کو گناہوں کے ساتھ مقید کیا، اور وہ وہ باقیات ہیں جو اللہ نے اپنے بندوں کے لیے باقی رکھی ہیں تاکہ وہ اللہ کے ساتھ ادب سیکھیں، پس وہ اطاعت اور خیر کو اللہ کی طرف منسوب کریں اور اسے اللہ کے ہاتھ میں قرار دیں، اور گناہ اور معصیت کو اپنے نفوس کی طرف منسوب کریں۔ اسی لیے ہم نے کہا کہ اللہ نے انہیں باقی رکھا۔ پس یہ ان کا حصہ ہے اس چیز میں جو اللہ کے لیے ہے، کیونکہ سب کچھ اللہ ہی کی طرف سے ہے، لیکن یہ محجوب لوگ \"بات کو سمجھنے کے قریب بھی نہیں ہوتے\" بلکہ وہ کہتے ہیں کہ یہ سب اللہ کے لیے ہے، اس مقام کے علاوہ جہاں اللہ نے اس قول کو رکھا ہے، اور یہ ان کی مقامات سے جہالت کی وجہ سے ہے۔ اور یہ مقدار کافی ہے، کیونکہ اس میں میدان کی وسعت کی وجہ سے گنجائش بہت زیادہ ہے، اس لیے کہ اللہ نے عالم کو محبت کے سوا کسی چیز سے پیدا نہیں کیا، اور محبت تمام مقامات اور احوال کو اپنے ساتھ رکھتی ہے، پس وہ تمام امور میں جاری و ساری ہے۔ اسی لیے اس میں معاملہ لامتناہی طور پر تفصیل پاتا ہے۔ اور محبت کی اصل نسبتیں ہیں، اور وہ روابط ہیں، اور روابط کے ساتھ توحید (توحید) اصلاً ثابت نہیں ہوتی۔ اسی لیے بعض نے کہا ہے کہ جس نے توحید بیان کی اس نے شرک کیا، جیسا کہ وہ کہتا ہے جس نے جمع (وحدت) کا قول کیا اس نے بلاشبہ فرق (کثرت) کیا۔ اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔\"",
    "fa": "باب چهارصد و هفتاد و یکم در معرفت حال قطبی که منزلگاهش این آیه بود: «بگو: اگر خدا را دوست دارید، از من پیروی کنید تا خدا شما را دوست بدارد و گناهانتان را بر شما ببخشاید؛ و خدا آمرزنده و مهربان است.» (قُلْ إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله ويَغْفِرْ لَكُمْ ذُنُوبَكُمْ والله غَفُورٌ رَحِيمٌ)\n\nاگر پروردگارت را با پیروی دوست بداری،\nاو نیز تو را به همان اندازه دوست می‌دارد و سپس می‌افزاید.\nبر این محبت مضاعف خشنود خواهی شد،\nاین سیادت (سروری) هنگامی که او سرور شد، به تو رسید.\nو اگر او را به غیر این طریق دوست بداری،\nسود برده‌ای، اما از کسانی نخواهی بود که سود رسانده‌اند.\n\n### [عبادت حقیقی جبری و عبادت اختیاری]\n\nو پیامبر (صلی الله علیه و سلم) از قول خداوند فرمود: «خداوند متعال می‌فرماید: بندگان تقرب‌جو با چیزی محبوب‌تر نزد من از انجام آنچه بر آنان واجب کرده‌ام، به من تقرب نجسته‌اند. و بنده پیوسته با نوافل (اعمال مستحب) به من تقرب می‌جوید تا آنکه او را دوست بدارم. پس چون او را دوست بدارم، من گوش و چشم و دست و پشتیبان او خواهم بود.»\n\nو کامل‌تر از این نیز وارد شده است. پس این راه اگر بنده یا کسی که آن را ملتزم شود و به آن تحقق یابد، بر او در معرفت (المعرفة) نفس و پروردگارش گشوده می‌شود و می‌داند که عبادت فرائض (واجبات) عبادتی حقیقی و جبری است، و عبادت نوافل (مستحبات) عبادتی اختیاری است که در آن بویی از ربوبیت (الربوبية) وجود دارد؛ زیرا نافله تواضع است، و تواضع عملی است که جز از کسی که بهره‌ای از رفعت دارد، سر نمی‌زند. و بنده را نصیبی در سیادت (سروری) نیست، و به همین دلیل وارد شده است که «بنده کسی است که بنده ندارد.» به همین سبب، نافله از درجه فرض (واجب) پایین‌تر است، زیرا بنده به اندازه آنچه از نافله اعتقاد دارد، از علم به امر (الهی) کاسته است. بلکه از همان قدم اول در نافله، به نقص در علم به آنچه امر بر آن است، متصف شده است. و این علمی شریف است که سعادتی را برای عاملش به ارث می‌گذارد که هیچ سعادتی شبیه آن نیست.\n\nو این بدان سبب است که بنده به ذات خود بنده است، اما عبودیت (العبودية) او درک نمی‌شود مگر آنکه اتکای او به یک سید (سرور) درک شود. و رب (پروردگار) به ذات خود رب است، اما ربوبیت (الربوبية) او درک نمی‌شود مگر آنکه مربوبی (پرورش‌یافته‌ای) که مستند اوست، درک شود. پس هر یک سند دیگری است. معلوم، علم را به عالم داد و او را عالم ساخت، و علم، معلوم را معلوم ساخت. و از حیث ارتفاع این سخنی که گفتیم، نه عالمی هست و نه معلومی، نه ربی هست و نه مربوبی. و امر (حقیقت) جز عالم و معلوم و رب و مربوب نیست، و این همان چیزی است که هستی (الوجود) بر آن است. پس باید به آنچه هستی (الوجود) و شهود (الشهود) به او داده است سخن بگوید و وهمیات جایز عقلی را رها کند، زیرا سخن گفتن به آن موطن خاصی دارد که در آن موطن، سلطان (حکومت) از آن اوست. پس می‌گوییم:\n\nخداوند متعال خبر داده است که او بندگانی دارد که آنان را دوست می‌دارد و آنان نیز او را دوست می‌دارند.\n\nپس محبت آنان را میان دو محبت از جانب خود قرار داد. اول، آنان را دوست داشت و با این محبت، توفیقشان داد تا از رسولش در آنچه از واجبات بر آنان آورده و نیز در ترغیب به اینکه صورتی از آنچه بر آنان واجب کرده است را بر خود واجب سازند که نافله نامیده می‌شود، پیروی کنند. سپس به آنان اعلام کرد که اگر از او در آنچه آورده است پیروی کنند، آنان را دوست خواهد داشت. پس این محبت الهی دوم، عین محبت اول نیست؛ محبت اول، حب عنایت است و محبت دوم، حب جزا و کرامت است به واسطه وارد شونده‌ای که با حب اول محبوب شده است. پس حب بنده به پروردگارش میان دو حب الهی محفوظ ماند. هرگاه اراده کند یا گمان برد که با سستی از این وصف خارج شود، خود را محصور میان دو حب الهی می‌یابد و راه فراری نمی‌یابد. پس در اصل خود محفوظ می‌ماند، میان حب عنایتی که در آن سستی نیست و حب کرامتی که در آن استدراج (به تدریج به هلاکت کشاندن) نیست.\n\nو محصور بودن میان دو امر، اضطرار (ناچاری) را ایجاب می‌کند. پس آن، حب فرض (واجب) است، و آن بنده مضطر (ناچار) در عبودیت (العبودية) خویش است که به آنچه خداوند بر او واجب کرده مجبور شده است تا او را آگاه سازد که در قبضه حق (الحق) محصور است و رهایی و نفوذی برای او نیست، چنانکه در حاشیه ترسیم کرده‌ایم. و چون دید که حق (الحق) او را مکلف ساخته است، دانست که اگر حق (الحق) در بنده اقتداری بر انجام اعمالی که او را مکلف کرده است نمی‌دانست، او را مکلف نمی‌ساخت. پس تکلیف برای او شناساننده این بود که او در اقتدار بر وجود فعلی که خداوند او را به ایجادش مکلف کرده است، دخالتی دارد. و این امر را نزد او با تشریع طلب یاری از خداوند برای آن، تثبیت کرد. این امر، قوت علم او را به اینکه اقتداری دارد، افزود.\n\nسپس به آنچه بر او واجب شده بود نگریست و آن را در مقایسه با وسعتی که در او بود، اندک دید. پس در آن هنگام دانست که وسعتی که برای او باقی گذاشته شده، تنها به دلیل اقتداری است که دارد. پس حق (الحق) خواست او را بیازماید تا ببیند چه چیزی از آن اقتداری که به او داده است، خارج می‌شود. و او در آنچه آن اقتدار در آن خارج می‌شود، جز آن وسعتی که برایش باقی گذاشته، ندارد، چنانکه فرمود: «تو را در روز، شناوری طولانی است.» (إِنَّ لَكَ في النَّهارِ سَبْحاً طَوِيلًا) پس این بنده آن فراغ را با نوافل (مستحبات) آباد کرد. و نافله، نافله نمی‌شود مگر آنکه فرض (واجب) کامل شود. پس از این طریق، دو محبت دیگر از جانب خداوند حاصل شد: یکی حب فرائض (واجبات)، یعنی محبتی که از انجام فرائض برای او حاصل شد، و دیگری محبتی که از جانب خداوند به سبب انجام نوافل برای او حاصل شد. اگرچه این محبت دوم، پایین‌تر از حب اول است، چنانکه در اصل، حب کرامت پایین‌تر از حب عنایت است، زیرا حب جزا است و خلوص حب اول را ندارد، چنانکه:\n\nدر خبر وارد شده است که اگر مردی به برادرش بگوید: «دوستت دارم»، و دیگری نیز او را دوست بدارد، هرگز در درجه محبت به او نمی‌رسد.\n\nزیرا حب اول، آغاز است و حب دوم، جزای آن است، پس هرگز با آن برابری نمی‌کند. چرا که حب اول همان است که حب دوم را تولید کرده است، پس حب دوم منفعل از آن است و منفعل هرگز به قوت فاعل نمی‌رسد. پس چون آن فراغ وسیع را با نوافل آباد کرد، خداوند در آن نوافل، فرائضی قرار داد تا نوافل در پیوستن به فرائض تأیید شوند. و به همین دلیل است که نوافل جای فرائض را می‌گیرند و فرائض با آنچه از فرائض در نوافل است، کامل می‌شوند، چنانکه:\n\nدر خبر صحیح از رسول خدا (صلی الله علیه و سلم) وارد شده است که خداوند در سنجش اعمال می‌فرماید: «اگر بنده فرض خود را کامل نکرده باشد، فرض او از تطوعش (اعمال مستحب) برایش کامل می‌شود، اگر تطوعی داشته باشد.»\n\nو آن همان نافله است. به همین دلیل در نافله، فرائضی وجود دارد، زیرا هر نافله‌ای بر صورت فرض خود است، از نماز و صدقه و روزه و حج و عمره. پس بنده در انجام نافله تا زمانی که به آن مشغول نشده، اختیار دارد. اما هنگامی که به آن مشغول شد، به او گفته می‌شود: «اعمال خود را باطل نکنید.» (لا تُبْطِلُوا أَعْمالَكُمْ) پس در آغاز آن، مختار بود و در مشغول شدن به آن، نزد ما مضطر (ناچار) است، برخلاف نظر علمای رسوم (ظاهر). و «کسی که به عهد خود با خدا وفا کند» (وَمَنْ أَوْفَى بِمَا عَاهَدَ عَلَيْهُ اللَّهَ)، و شروع در عمل، عهدی است که بنده با خداوند بسته است، بی‌شک در آنچه بر او واجب نبوده است. و به همین دلیل (پیامبر) فرمود: «آیا غیر از اینها بر من واجب است؟» گفت: «نه، مگر آنکه تطوع کنی.» پس احتمال در این اجمال وارد شد. و چون در انجام فرض (واجب) بویی از ربوبیت (الربوبية) وجود نداشت که برای او ایجاب کند که اگر خواست انجام دهد و اگر نخواست انجام ندهد، چنانکه در نافله هست، در فرض، بنده اضطرار و مجبور بود، بی‌شک. پس به دلیل عزتی که در خود داشت، از اینکه علم به خود را به خداوند داده بود، دچار انکسار (شکستگی) در نفس شد. پس خداوند انکسار او را با این قول خود جبران کرد: «سخن نزد من دگرگون نمی‌شود.» (مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ)\n\nپس با این خطاب، «اگر خواست و اگر خواست» را از خود (بنده) زائل کرد و جز عین آنچه خواست، برای او باقی نگذاشت، نه تخییر در آن. پس چون بنده چنین چیزی را شنید، شکستگی او جبران شد و دانست که خداوند مجازی سخن نمی‌گوید و چون امر در نفس خود بر این منوال بود، صحیح نبود که چنین سخنی بگوید. پس انکساری که نزد او بود، زائل شد، و آن همان قول خداوند متعال در خبر ترجمه‌شده است: «من نزد کسانی هستم که دل‌هایشان به خاطر من شکسته است.»\n\nیعنی: من دل‌هایشان را با آنچه بر آنان واجب کردم و آنان را در آن از اضطرار (ناچاری) وارد ساختم، شکستم و آنان را از پناهگاه عزتشان به واسطه آن پایین آوردم. پس چون شکستند، در این شکست، جبران‌کننده‌ای نزد خود داشتند، به واسطه آنچه خداوند بر خود واجب کرده و خبر داده است که سخن نزد او دگرگون نمی‌شود (ما يُبَدَّلُ الْقَوْلُ لَدَيَّ) و کلمه از جانب او حق شده است. و اختیار را با از بین بردن امکان از عالم، زائل کرد. پس جز واجب بالذات یا واجب بالغیر باقی نماند، و این دو، دو وصف برای یک موصوف یا برای دو موصوف هستند. و در هستی (الکون) جز رب و مربوب نیست. سپس به او، در این وسعت که او را در آن مخیر ساخت و نافله نامیده شد، حکم اختیار الهی را در قول خود «اگر خواست و اگر خواست» عطا کرد و جامه آن را بر او پوشاند. بلکه بنده به صفت اختیار سزاوارتر است تا صفت اضطرار، زیرا او به حقیقت، به دلیل امکانش، تردد دارد، در حالی که حق (الحق) چنین نیست. پس اگر چنین چیزی از حق (الحق) ظاهر شد، بدان که حق (الحق) ظاهر شده است.\n\nدر صورت ممکن. و به همین دلیل ما در این قول خود که نباید گفته شود خداوند جایز است که فلان کار را انجام دهد و جایز است که انجام ندهد، با او هم‌صدا شدیم. و می‌گوییم: جایز است که این ممکن باشد و جایز است که نباشد. همان‌طور که اگر اضطرار از بنده ظاهر شود، تنها به صورت حق (الحق) از او ظاهر می‌شود نه به ذات خود، زیرا او بنده نمی‌شود مگر با قیام به آداب سرورش، و او در اصل، مسلوب الفعل است. پس ناگزیر است که به صورت حق (الحق) ظاهر شود، هنگامی که با عبودیتش که همان عمل به آنچه مکلف به انجام آن شده است، ظاهر می‌شود. و به همین دلیل حق (الحق) نگفت که او هویت شیء است، بلکه گفت که او هویت بنده است. پس دانستیم که حکم بنده، حکم شیء نیست. پس حکم نافله به بنده سزاوارتر است، اگر بوی ربوبیت (الربوبية) در آن نبود، و حکم فرض به رب (پروردگار) سزاوارتر است، اگر بوی عبودیت (العبودية) در آن نبود. پس باید حکم هر یک را در موطنی قرار دهد که خداوند قرار داده است، تا خداوند جاعل باشد نه ما. در این صورت، از اعتراض بر ما هنگام سؤال خداوند از ما، رهایی می‌یابیم و سالم می‌مانیم.\n\n### [خداوند متعال در محبت جزا، آمرزش گناهان را قرار داد]\n\nسپس خداوند متعال در محبت جزا که همان محبت کرامت است، آمرزش گناهان را قرار داد، و آن همان پوشاندن گناهان است. و آیه را با این ختم کرد که «کافران را دوست نمی‌دارد.» (لا يُحِبُّ الْكافِرِينَ) و کافر، پوشاننده است، در حالی که او تعالی پوشاننده گناهان است. پس دانستیم که خداوند از بندگانش کسی را که نعمت‌های او را بپوشاند، دوست نمی‌دارد، هر نعمتی که باشد. زیرا فرمود: «و اما نعمت پروردگارت را بازگو کن.» (وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ) و آنچه بازگو شود، پوشیده نمی‌ماند. و فرمود: بازگو کردن نعمت‌ها شکر است. و هنگامی که خداوند نعمتی بر بنده‌ای ارزانی دارد، دوست دارد که آن نعمت بر او دیده شود. و نعمت‌های او که بر بندگانش کامل کرده است، آشکار و پنهان است. و هر کس نعمت خدا را بپوشاند، به آن کفر ورزیده است، و هر کس به آن کفر ورزد، خداوند به سزای این کار، «لباس گرسنگی و ترس» (لِباسَ الْجُوعِ والْخَوْفِ) را به او می‌چشاند.\n\nو به همین دلیل خداوند پوشاندن خود را به گناهان مقید کرد، و گناهان همان بقایایی هستند که خداوند برای بندگانش باقی گذاشته است تا ادب در برابر خداوند را بیاموزند؛ پس طاعت و خیر را به خداوند نسبت دهند و آن را در دست خداوند قرار دهند، و گناه و معصیت را به نفس‌های خود نسبت دهند. به همین دلیل گفتیم خداوند آنها را باقی گذاشت. پس این نصیب آنان است از آنچه از آنِ خداست، زیرا همه چیز از نزد خداست. اما این محجوبان «نزدیک نیست که سخنی را بفهمند.» (لا يَكادُونَ يَفْقَهُونَ حَدِيثاً) بلکه می‌گویند همه اینها از آنِ خداست، اما در غیر موطنی که خداوند برای این سخن قرار داده است، و این به دلیل جهل آنان به موطن‌هاست. و این مقدار کافی است، زیرا میدان در این باره وسیع است، به دلیل وسعت عرصه‌اش، چرا که خداوند عالم را جز از روی حب (دوستی) ایجاد نکرده است، و حب (دوستی) همراه همه مقامات و احوال است، پس در همه امور جاری است. به همین دلیل، امر در آن تا بی‌نهایت تفصیل می‌یابد. و اصل حب، نسبت‌ها (روابط) است، و با وجود نسبت‌ها، توحید (التوحيد) اصلاً ثابت نمی‌شود. و به همین دلیل برخی گفته‌اند: «هر کس توحید ورزد، شرک ورزیده است»، همان‌طور که کسی که به جمع (وحدت) قائل شود، بی‌شک تفرقه انداخته است. و «خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 3
}