{
  "id": 196,
  "title": {
    "ar": "الباب السادس والتسعون ومائة في معرفة الطوالع",
    "en": "Chapter One Hundred and Ninety-Six: Concerning the Knowledge of the Risings (الطوالع)",
    "ur": "باب ایک سو چھیانوے: طوالع کی معرفت میں۔",
    "fa": "باب صد و نود و ششم در معرفت طوالع (الطوالع)"
  },
  "content": {
    "ar": "## (الباب السادس والتسعون ومائة في معرفة الطوالع)\n\n\n> لا تنظرن إلى طوالع نوره *** فطوالع التوحيد ما لا تبصر\n\n\n> لو أبصرتها كان شرك ثابتا *** فبه المحنك ذو الحجى يتحير\n\n\n> إن المجرب للأمور هو الذي *** بمجنه يلقى فلا يتأثر\n\n\n> ومجنه نصر الإله فعينه *** فبه يراه وعينه لا تبصر\n\n\n> الطمس رفع الحكم ليس ذهابه *** فهي الوجود وما سواها مظهر\n\n\n### [الطوالع هي تطلع على قلوب العارفين فتطمس سائر الأنوار]\n\n\nالطوالع عند الطائفة المصطلح عليها أنوار التوحيد تطلع على قلوب العارفين فتطمس سائر الأنوار وهذه أنوار الأدلة النظرية لا أنوار الأدلة الكشفية النبوية فالطوالع تطمس أنوار الكشف وذلك أن التوحيد المطلوب من الله الذي طلبه من عباده وأوجب النظر فيه إنما هو توحيد المرتبة وهو كونه إلها خاصة فلا إله غيره وعلى هذا يقوم الدليل الواضح‏\nوعند بعض العقول فضول من أجل القوي التي هي آلاته فتعطيه في بعض الأمزجة أمزجة تراكيها فضولا يؤديه ذلك الفضول إلى النظر في ذات الله وقد حجر الشرع التفكر في ذات الله فزل هذا العقل في النظر في ذلك وتعدى وظلم نفسه فأقام الأدلة على زعمه وهي أنوار الطوالع على إن ذات الإله لا ينبغي أن تكون كذا ولا أن تكون على كذا ونفت عنه جميع ما ينسب إلى المحدثات حتى يتميز عندها فجعلته محصورا غير مطلق بما دلت عليه أنوار أدلته ثم عدلت بعد ذلك إلى الكلام في ذوات صفاته فاختلف في ذلك أشعة أنوارهم أعني طرق بما دلتهم على ما ذكر في علم النظر ثم عدلوا إلى النظر في أفعاله فاختلفوا في ذلك بحسب اختلاف أشعة أنوارهم مما قد ذكر وسطر وليس هذا الكتاب بمحل لما تعطيه أدلة الأفكار فإنه موضوع لما يعطيه الكشف الإلهي فلهذا لم نسردها على ما قررها أهلها في كتبهم ثم عدلوا إلى النظر في السمعيات وهو علمنا الذي يعول عليه في الحكم الظاهر ونأخذ بالكشف الإلهي عند التعمل بالتقوى فيتولى الله تعليمنا بالتجلي فنشهد ما لا تدركه العقول بأفكارها مما ورد به السمع وأحاله العقل وتأوله عقل المؤمن وسلمه المؤمن الصرف فجاءت أنوار الكشف بأن هذه الذات التي حجر التفكر فيها فرأيناها على النقيض مما دلت عليه العقول بأفكارها فيشاهد صاحب الكشف يمين الحق ويده ويديه والعين والأعين المنسوبة إليه والقدم والوجه‏\n\n\n### [إن الله تعالى معبود للمؤمنين‏]\n\n\nثم من النعوت الفرح والتعجب والضحك والتحول من صورة إلى صورة هذا كله شاهدوه فالله الذي يعبده المؤمنون وأهل الشهود من أهل الله ما هو الذي يعبده أهل التفكر في ذات الله فحرموا العلم لكونهم عصوا الله ورسوله في أن فكروا في ذات الله وتعدوا مرتبة الكلام والنظر في كونه إلها واحدا إلى ما لا حاجة لهم به وقد فعل ذلك من ينتمي إلى الله كأبي حامد وغيره وهي مزلة قدم وإن كان جعل ذلك سترا له فإنه قد نبه في مواضع على خلاف ما أثبته وبالجملة أساء الأدب فمن حكم على نفسه فكره ونظره وأدخل عقله تحت سلطان نظره في ذلك وتخيل أنه على نور من ربه في نظره فطمس بأنوار أدلته أعين أنوار ما جاء به أهل الشهود والكشف فما جاء من ذلك عن رسول ونبي في كتاب أو سنة وكان صاحب هذه الأنوار النظرية مؤمنا صادقا في إيمانه تأول ذلك في حق الرسول حتى لا يرجع عن النظر بنور فكره لأن اعتماده عليه وهو الذي أنشأ في نفسه ربا يعبده كما ينبغي لنظره فعبد عقله ثم إنه نقل الأمر في التأويل لقصوره من التشبيه بالأجسام لحدوثها إلى التشبيه بالمعاني المحدثة أيضا فما انتقل من محدث إلا إلى محدث فكان فضيحة الدهر عند المؤمنين والذين شاهدوا الأمر على ما هو عليه وأصل ذلك كله أنه نتيجة عن معصية الله إذ قد\n\n\nنهاه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم الذي لا ينطق عن الهوى عن التفكر في ذات الله‏\n\n\nفلم يفعل جعلنا الله وإياكم من أهل الشهود والوجود فيا ليت هذا المؤمن إذا لم يكن من أهل الشهود أن يسلم الأمر إلى الله على علم الله فيه ولا يتعدى وأما إذا جاء بمثل هذه العلوم غير الرسول عند هذا الناظر كفره وزندقه وجهله وبهذا بعينه آمن به لما جاءه به الرسول فأي حجاب أعظم من هذا الحجاب فيقول له الأمر على كذا فيقول هذا كفر فإذا قلت له كذا ورد في الصحيح عن النبي عليه السلام ما هو قولي سكت وقال بعد أن جاء عن النبي صَلَّى اللهُ عَليهِ وسَلَّم فله تأويل ننظر فبه فلا يقبله ذلك القبول لو لا رائحة هذا النظر الذي يرجوه في تأويله فما أبعده عن الحق المبين وقد يريد أصحابنا بالطوالع طوالع أنوار الشهود فتطمس أنوار الأدلة النظرية فما كان ينفيه عقلا مجردا عاد يثبته كشفا ولم يبق لذلك النور الفكري في عقله عينا ولا أثرا ولا جعل له عليه سلطانا فهذا معنى الطوالع‏\n\n",
    "en": "## Chapter One Hundred and Ninety-Six: Concerning the Knowledge of the Dawns (الطوالع)\n\nDo not look upon the Dawns of His Light,\nFor the Dawns of Unity (التوحيد) are what you cannot perceive.\nIf you were to perceive them, polytheism would be established,\nFor by it, the experienced one, the possessor of intellect, becomes bewildered.\nIndeed, the one experienced in affairs is he\nWho meets them with his shield and is not affected.\nAnd his shield is the aid of God, which is his eye,\nBy which he sees Him, yet his eye does not perceive.\nEffacement (الطمس) is the lifting of the ruling, not its disappearance,\nFor it is Being (الوجود), and all else besides it is a manifestation.\n\n### [The Dawns (الطوالع) are lights that rise upon the hearts of the Gnostics (العارفين), effacing all other lights.]\n\nThe Dawns (الطوالع), according to the established terminology of the Sufi community, are the lights of Unity (أنوار التوحيد) that rise upon the hearts of the Gnostics (العارفين), effacing all other lights. These are the lights of the rational proofs (الأدلة النظرية), not the lights of the prophetic gnostic proofs (الأدلة الكشفية النبوية). The Dawns efface the lights of Unveiling (الكشف), because the Unity (التوحيد) sought by God, which He demanded from His servants and made obligatory to contemplate, is only the Unity of the Level (توحيد المرتبة), which is His being God specifically, so there is no god but Him. Upon this rests the clear proof.\n\nSome intellects possess an excess (فضول) due to the faculties that are their instruments. This excess, in certain temperaments, leads them to contemplate the Essence (ذات) of God. Yet, the Sacred Law (الشرع) has forbidden reflection upon the Essence of God. Thus, this intellect stumbles in contemplating that, transgressing and wronging itself. It establishes proofs—which are the lights of the Dawns (أنوار الطوالع), according to its claim—that the Essence of God should not be such-and-such, nor should it be upon such-and-such a state. It negates from Him everything attributed to created things (المحدثات) so that He may be distinguished in its view. It thereby makes Him restricted (محصورا) and not Absolute (مطلق) by what the lights of its proofs indicate. Then, after that, it turns to speaking about the essences of His Attributes (ذوات صفاته), and the rays of their lights—meaning their paths—differ in this, based on what they were guided to in the science of speculation (علم النظر). Then they turn to contemplating His Acts (أفعاله), and they differ in that according to the variation in the rays of their lights, as has been mentioned and recorded. This book is not the place for what the proofs of thoughts (أدلة الأفكار) yield, for it is dedicated to what Divine Unveiling (الكشف الإلهي) grants. For this reason, we have not listed them according to how their proponents established them in their books.\n\nThen they turn to contemplating the transmitted reports (السمعيات), which is our science relied upon for the apparent ruling (الحكم الظاهر). We, however, take hold of Divine Unveiling (الكشف الإلهي) when we act with piety (التقوى). God then takes charge of teaching us through Theophany (التجلي), so we witness what intellects cannot grasp through their thoughts concerning what the transmitted reports brought forth, which the intellect deemed impossible and which the intellect of the believer interpreted, and which the pure believer simply accepted. The lights of Unveiling (أنوار الكشف) came, showing that this Essence (الذات) upon which reflection was forbidden—we saw it to be the opposite of what intellects indicated through their thoughts. Thus, the possessor of Unveiling witnesses the Right Hand of the Real (يمين الحق), His Hand, His two Hands, the Eye, the Eyes attributed to Him, the Foot, and the Face.\n\n### [Indeed, God Almighty is the Object of Worship for the Believers]\n\nThen, among the descriptions are joy (الفرح), astonishment (التعجب), laughter (الضحك), and transformation from one form to another. All of this they witnessed. The God whom the believers and the People of Witnessing (أهل الشهود) among the People of God worship is not the one whom the people of speculation upon the Essence of God worship. They were deprived of Knowledge (العلم) because they disobeyed God and His Messenger by reflecting upon the Essence of God, transgressing the level of discourse and contemplation concerning His being one God, moving into what they had no need for.\n\nIndeed, some who affiliate themselves with God, such as Abu Hamid [al-Ghazali] and others, have done this, and it is a slippery slope (مزلة قدم), even if he made it a veil for himself. For he drew attention in certain places to the opposite of what he established. In general, he showed poor manners (أساء الأدب). Whoever judges himself by his thought and speculation, and places his intellect under the authority of his speculation in this matter, and imagines that he is upon a light from his Lord in his speculation, is effaced by the lights of his proofs (أنوار أدلته) from the eyes of the lights brought by the People of Witnessing and Unveiling (أهل الشهود والكشف). Whatever came from a Messenger or Prophet in a Book or Sunnah, if the possessor of these speculative lights (الأنوار النظرية) is a sincere believer in his faith, he interprets (تأول) that report concerning the Messenger so that he does not abandon the speculation based on the light of his thought, because his reliance is upon it. It is this thought that established within himself a Lord whom he worships as his speculation dictates. Thus, he worshiped his intellect.\n\nFurthermore, due to his deficiency, he transferred the matter in interpretation from anthropomorphism (التشبيه) with physical bodies—due to their created nature—to anthropomorphism with created meanings (المعاني المحدثة) as well. He did not move from one created thing (محدث) except to another created thing. This was the scandal of the age (فضيحة الدهر) among the believers and those who witnessed the matter as it truly is. The root of all this is that it is the result of disobedience to God, since His Messenger, peace and blessings be upon him, who does not speak from caprice, forbade him from reflecting upon the Essence of God.\n\nYet he did not comply. May God make us and you among the People of Witnessing (أهل الشهود) and Being (الوجود). Oh, if only this believer, if he is not among the People of Witnessing, would submit the matter to God based on God’s Knowledge concerning it, and not transgress! But when someone other than the Messenger brings forth such knowledge, this speculator deems him an infidel, a heretic, and ignorant. Yet, he believes in the exact same thing when the Messenger brings it to him. What veil is greater than this veil? You tell him the matter is such-and-such, and he says, \"This is disbelief.\" But when you tell him that such-and-such was reported in the authentic tradition (الصحيح) from the Prophet, peace be upon him, which is my statement, he falls silent and says, after it has come from the Prophet, peace and blessings be upon him, \"It has an interpretation (تأويل) that we must look into.\" He would not accept it with that acceptance were it not for the scent of this speculation that he hopes to find in his interpretation. How far removed he is from the Manifest Truth (الحق المبين)!\n\nOur companions (أصحابنا) may also intend by the Dawns (الطوالع) the Dawns of the lights of Witnessing (أنوار الشهود), which efface the lights of the rational proofs (الأدلة النظرية). Thus, what he used to negate based on pure intellect, he returns to affirm through Unveiling (كشفا). No trace or eye remains for that intellectual light in his mind, nor does it hold any authority over him. This is the meaning of the Dawns (الطوالع).",
    "ur": "(باب ایک سو چھیانوے: طوالع (ظہورات) کی معرفت میں)\n\nاس کے نور کے ظہورات کی طرف مت دیکھو، کیونکہ توحید کے ظہورات وہ ہیں جنہیں تم نہیں دیکھ سکتے۔\nاگر تم انہیں دیکھ لو تو شرک ثابت ہو جائے گا، اسی میں تجربہ کار اور عقل مند حیران ہو جاتا ہے۔\nبیشک امور کا تجربہ کار وہ ہے جو اپنی ڈھال کے ساتھ سامنا کرتا ہے اور متاثر نہیں ہوتا۔\nاور اس کی ڈھال اللہ کی مدد ہے، پس اس کی آنکھ (باطنی) ہے جس سے وہ دیکھتا ہے، اور اس کی (ظاہری) آنکھ نہیں دیکھتی۔\nمحو کرنا (الطمس) حکم کو اٹھا لینا ہے، نہ کہ اس کا زائل ہو جانا۔ پس وہ (محو شدہ چیز) ہستی (الوجود) ہے اور اس کے سوا جو کچھ ہے وہ مظہر ہے۔\n\n### [طوالع وہ ہیں جو عارفین کے دلوں پر طلوع ہوتے ہیں اور باقی تمام انوار کو مٹا دیتے ہیں]\n\nاس مخصوص گروہ (صوفیاء) کے نزدیک طوالع (الـطوالع) توحید (التوحید) کے وہ انوار ہیں جو عارفین (العارفين) کے دلوں پر طلوع ہوتے ہیں اور باقی تمام انوار کو مٹا دیتے ہیں۔ یہ نظری دلائل (الأدلة النظرية) کے انوار ہیں، نہ کہ کشفی نبوی دلائل (الأدلة الكشفية) کے انوار۔ پس طوالع کشف (الکشف) کے انوار کو مٹا دیتے ہیں۔ اس کی وجہ یہ ہے کہ اللہ کی طرف سے مطلوب توحید، جس کا اس نے اپنے بندوں سے مطالبہ کیا اور جس میں غور و فکر کو واجب قرار دیا، وہ صرف مرتبے کی توحید ہے، یعنی اس کا خاص طور پر معبود ہونا، کہ اس کے سوا کوئی معبود نہیں، اور اسی پر واضح دلیل قائم ہوتی ہے۔\n\nبعض عقلوں میں ان قوتوں کی وجہ سے فضول (اضافی) چیزیں ہوتی ہیں جو اس کے آلات ہیں۔ یہ قوتیں بعض مزاجوں میں ایسے مرکبات کے مزاج پیدا کرتی ہیں جو فضولیت کا باعث بنتے ہیں، اور یہ فضولیت انہیں ذات حق (الحق) میں غور و فکر کی طرف لے جاتی ہے۔ حالانکہ شریعت نے ذات حق (الحق) میں تفکر سے منع کیا ہے۔ پس یہ عقل اس میں غور و فکر کرنے میں پھسل گئی، حد سے تجاوز کیا اور اپنے آپ پر ظلم کیا۔ چنانچہ اس نے اپنے گمان کے مطابق دلائل قائم کیے—اور یہی طوالع (الـطوالع) کے انوار ہیں—کہ ذات الٰہی کو ایسا نہیں ہونا چاہیے اور نہ ہی ویسا ہونا چاہیے۔ اور اس نے ذات حق سے وہ تمام چیزیں خارج کر دیں جو مخلوقات (محدثات) سے منسوب ہیں تاکہ اس کے نزدیک وہ ممتاز ہو جائے، پس اس نے ذات حق کو اپنے دلائل کے انوار کی رہنمائی کے مطابق محدود کر دیا، غیر مطلق نہیں۔ پھر اس کے بعد انہوں نے اس کی صفات کی حقیقتوں (ذوات صفات) کے بارے میں کلام کی طرف رجوع کیا، تو اس میں ان کے انوار کی شعاعیں (یعنی طریقے) مختلف ہو گئے، جس کی رہنمائی انہیں علم نظر (عقل و استدلال) میں ملی تھی۔ پھر انہوں نے اس کے افعال میں غور و فکر کی طرف رجوع کیا، تو اس میں بھی ان کے انوار کی شعاعوں کے اختلاف کے مطابق اختلاف پیدا ہوا، جیسا کہ ذکر کیا اور لکھا جا چکا ہے۔\n\nاور یہ کتاب ان چیزوں کی جگہ نہیں ہے جو فکری دلائل فراہم کرتے ہیں، کیونکہ یہ ان چیزوں کے لیے وضع کی گئی ہے جو کشف الٰہی (الکشف) سے حاصل ہوتی ہیں۔ اسی لیے ہم نے انہیں اس طرح بیان نہیں کیا جس طرح ان کے ماہرین نے اپنی کتابوں میں انہیں مقرر کیا ہے۔ پھر انہوں نے سمعیات (منقولات) میں غور و فکر کی طرف رجوع کیا، اور یہی ہمارا وہ علم ہے جس پر ظاہری حکم میں بھروسہ کیا جاتا ہے۔ اور ہم تقویٰ پر عمل کرتے ہوئے کشف الٰہی (الکشف) کو اختیار کرتے ہیں، تو اللہ تعالیٰ تجلی (التجلی) کے ذریعے ہماری تعلیم کا ذمہ لیتا ہے، پس ہم اس چیز کا شہود (الشہود) کرتے ہیں جسے عقلیں اپنے افکار سے نہیں پا سکتیں، جو سمع (نقل) سے وارد ہوا اور عقل نے اسے محال قرار دیا، اور مومن کی عقل نے اس کی تاویل کی، جبکہ خالص مومن نے اسے تسلیم کر لیا۔ پس کشف (الکشف) کے انوار نے یہ بات ظاہر کی کہ یہ وہ ذات ہے جس میں تفکر سے منع کیا گیا تھا، اور ہم نے اسے اس کے برعکس پایا جس کی رہنمائی عقلوں نے اپنے افکار سے کی تھی۔ چنانچہ صاحب کشف ذات حق (الحق) کا دایاں ہاتھ، اس کا ہاتھ، اس کے دونوں ہاتھ، آنکھ، اس سے منسوب آنکھیں، قدم اور چہرہ کا شہود (الشہود) کرتا ہے۔\n\n### [بیشک اللہ تعالیٰ مومنین کا معبود ہے]\n\nپھر ان صفات میں خوشی، تعجب، ہنسنا، اور ایک صورت سے دوسری صورت میں بدلنا شامل ہیں—یہ سب انہوں نے شہود (الشہود) کیا ہے۔ پس وہ اللہ جس کی عبادت مومنین اور اہل اللہ میں سے اہل شہود (الشہود) کرتے ہیں، وہ وہ نہیں ہے جس کی عبادت ذات حق (الحق) میں غور و فکر کرنے والے کرتے ہیں۔ چنانچہ وہ علم سے محروم ہو گئے کیونکہ انہوں نے ذات حق (الحق) میں غور و فکر کر کے اللہ اور اس کے رسول کی نافرمانی کی اور اس مرتبے سے تجاوز کر گئے جہاں صرف اس کے واحد معبود ہونے کے بارے میں کلام اور نظر کی اجازت تھی، اور ایسی چیز میں پڑ گئے جس کی انہیں ضرورت نہیں تھی۔ اور یہ کام ان لوگوں نے بھی کیا جو اللہ سے نسبت رکھتے ہیں، جیسے ابو حامد (الغزالی) اور دیگر۔ اور یہ قدم پھسلنے کی جگہ ہے، اگرچہ انہوں نے اسے اپنے لیے پردہ بنا لیا، لیکن انہوں نے کئی مقامات پر اس کے خلاف تنبیہ کی ہے جو انہوں نے ثابت کیا تھا۔ خلاصہ یہ کہ انہوں نے بے ادبی کی۔\n\nپس جس نے اپنے فکر اور نظر کو اپنے اوپر حاکم بنایا اور اپنی عقل کو اس میں اپنے نظر کے تسلط کے تحت داخل کیا، اور یہ خیال کیا کہ وہ اپنے نظر میں اپنے رب کی طرف سے نور پر ہے، تو اس نے اپنے دلائل کے انوار سے اہل شہود (الشہود) اور کشف (الکشف) کی لائی ہوئی چیزوں کے انوار کی آنکھوں کو مٹا دیا۔ پس جو کچھ اس بارے میں رسول اور نبی کی طرف سے کتاب یا سنت میں آیا، اور اگر یہ نظری انوار کا حامل شخص اپنے ایمان میں سچا مومن تھا، تو اس نے رسول کے حق میں اس کی تاویل کی تاکہ وہ اپنے فکری نور کے نظر سے پیچھے نہ ہٹے، کیونکہ اس کا انحصار اسی پر ہے، اور اسی نے اپنے اندر ایک ایسے رب کو پیدا کیا جس کی وہ عبادت کرتا ہے جیسا کہ اس کے نظر کا تقاضا ہے۔ پس اس نے اپنی عقل کی عبادت کی۔ پھر اس نے اپنی کوتاہی کی وجہ سے تاویل میں معاملہ کو اجسام کے ساتھ تشبیہ دینے سے (جو کہ ان کے حادث ہونے کی وجہ سے ہے) حادث معانی کے ساتھ تشبیہ دینے کی طرف منتقل کر دیا، پس وہ ایک حادث سے دوسرے حادث کی طرف ہی منتقل ہوا، اور یہ مومنین اور ان لوگوں کے نزدیک جو حقیقت کا شہود (الشہود) کرتے ہیں، زمانے کی رسوائی ہے۔\n\nاور ان سب کی اصل اللہ کی نافرمانی کا نتیجہ ہے، کیونکہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم، جو خواہش سے کلام نہیں کرتے، نے اسے ذات حق (الحق) میں غور و فکر سے منع فرمایا تھا، مگر اس نے ایسا نہیں کیا۔ اللہ ہمیں اور آپ کو اہل شہود (الشہود) اور ہستی (الوجود) میں سے بنائے۔ کاش یہ مومن اگر اہل شہود (الشہود) میں سے نہیں ہے تو وہ اس معاملے کو اللہ کے سپرد کر دے، اس علم پر جو اللہ کو اس میں ہے، اور حد سے تجاوز نہ کرے۔ اور اگر رسول کے علاوہ کوئی دوسرا شخص اس ناظر کے پاس ایسے علوم لے کر آئے تو وہ اسے کافر، زندیق اور جاہل قرار دیتا ہے۔ حالانکہ اسی چیز پر وہ ایمان لایا جب رسول اسے لے کر آئے، تو اس حجاب سے بڑا اور کون سا حجاب ہو سکتا ہے؟ جب اسے کہا جاتا ہے کہ معاملہ ایسا ہے، تو وہ کہتا ہے کہ یہ کفر ہے۔ لیکن جب تم اسے بتاؤ کہ جو میں کہہ رہا ہوں وہ نبی علیہ السلام سے صحیح حدیث میں وارد ہوا ہے، تو وہ خاموش ہو جاتا ہے اور کہتا ہے کہ چونکہ یہ نبی صَلَّى اللهُ عَليهِ وسَلَّم سے آیا ہے، لہٰذا اس کی کوئی تاویل ہے جس میں ہم غور کریں گے۔ اگر اس تاویل میں اس نظر کی بو نہ ہوتی جس کی وہ امید رکھتا ہے، تو وہ اسے اس طرح قبول نہ کرتا۔ پس وہ حق مبین (واضح سچائی) سے کتنا دور ہے!\n\nاور ہمارے اصحاب (صوفیاء) طوالع (الـطوالع) سے شہود (الشہود) کے انوار کا طلوع مراد لیتے ہیں، جو نظری دلائل (الأدلة النظرية) کے انوار کو مٹا دیتے ہیں۔ پس جو کچھ وہ محض عقلی طور پر رد کرتا تھا، وہ کشف (الکشف) کے ذریعے دوبارہ ثابت کرنے لگتا ہے، اور اس فکری نور کا اس کی عقل میں نہ کوئی وجود باقی رہتا ہے اور نہ کوئی اثر، اور نہ ہی وہ اس پر کوئی تسلط رکھتا ہے۔ پس یہ ہے طوالع (الـطوالع) کا معنی۔",
    "fa": "(باب صد و نود و ششم در معرفت طلوع‌ها)\n\nبه طلوع‌های نور او منگر، *** زیرا طلوع‌های توحید (al-Tawḥīd) چیزی است که دیده نمی‌شود.\nاگر آن را ببینی، شرکی ثابت خواهد بود، *** و به واسطه آن، شخص آزموده و خردمند حیران می‌ماند.\nهمانا کسی که امور را تجربه می‌کند، اوست که *** با سپر خود مواجه می‌شود و متأثر نمی‌گردد.\nو سپر او یاری خداوند است، پس چشم اوست، *** که با آن می‌بیند، در حالی که چشمش نمی‌بیند.\nمحو شدن (al-Ṭams) به معنای رفع حکم است، نه زوال آن، *** پس آن (حقیقت) هستی (al-Wujūd) است و هرچه غیر آن، مظهر است.\n\n[طلوع‌ها بر قلب‌های عارفان طلوع می‌کنند و سایر انوار را محو می‌سازند]\n\nطلوع‌ها (al-Ṭawāliʿ) نزد این طایفه (صوفیه) که بر آن اصطلاح کرده‌اند، انوار توحید (al-Tawḥīd) هستند که بر قلب‌های عارفان (al-ʿĀrifīn) طلوع می‌کنند و سایر انوار را محو می‌سازند. این انوار، انوار دلایل نظری هستند، نه انوار دلایل کشفی (al-Kashf) نبوی. پس طلوع‌ها انوار کشف را محو می‌کنند. و این بدان سبب است که توحیدی که خداوند از بندگانش خواسته و نظر در آن را واجب کرده است، تنها توحید مرتبه است؛ یعنی اینکه او به طور خاص معبود است و هیچ معبودی جز او نیست، و دلیل واضح بر این امر استوار است.\n\nو برخی عقول به دلیل قوایی که ابزار آن‌ها هستند، دچار زیاده‌روی می‌شوند؛ در نتیجه در برخی حالات، ترکیب مزاجی آن‌ها زیاده‌روی‌هایی به بار می‌آورد که آن زیاده‌روی فرد را به نظر در ذات الله می‌کشاند. حال آنکه شریعت تفکر در ذات الله را منع کرده است. پس این عقل در نظر در آن لغزید، تجاوز کرد و به خود ستم نمود. سپس دلایلی را بر گمان خود اقامه کرد که همان انوار طلوع‌ها (al-Ṭawāliʿ) هستند، مبنی بر اینکه ذات الهی نباید چنین باشد و نباید بر آن وجه باشد. و هر آنچه را که به موجودات حادث نسبت داده می‌شود، از او نفی کرد تا نزد آن عقل متمایز گردد. پس او را محدود و غیرمطلق ساخت، بر اساس آنچه انوار دلایلش بر آن دلالت داشتند. سپس پس از آن به بحث در مورد ذوات صفات او روی آوردند، و در این باره پرتوهای انوارشان (یعنی روش‌هایشان) بر اساس آنچه در علم نظر به آن‌ها دلالت کرده بود، اختلاف یافتند. سپس به نظر در افعال او روی آوردند و در این باره نیز بر حسب اختلاف پرتوهای انوارشان، که ذکر و نگاشته شده است، اختلاف کردند. این کتاب جایگاه آنچه دلایل افکار به دست می‌دهند نیست، زیرا موضوع آن چیزی است که کشف الهی (al-Kashf) عطا می‌کند. به همین دلیل، ما آن‌ها را بر اساس آنچه اهلش در کتب خود مقرر کرده‌اند، نیاوردیم. سپس به نظر در سمعیات روی آوردند، که علم ماست و در حکم ظاهر بر آن تکیه می‌شود. ما در عمل به تقوا، کشف الهی (al-Kashf) را در پیش می‌گیریم، پس خداوند تعلیم ما را از طریق تجلی (al-Tajallī) بر عهده می‌گیرد. در نتیجه، ما چیزی را شهود (al-Shuhūd) می‌کنیم که عقول با افکار خود درک نمی‌کنند؛ از جمله آنچه سمع (نقل) آورده و عقل آن را محال دانسته، اما عقل مؤمن آن را تأویل کرده و مؤمن خالص آن را تسلیم شده است. پس انوار کشف (al-Kashf) آمدند و نشان دادند که این ذاتی که تفکر در آن منع شده بود، ما آن را بر خلاف آنچه عقول با افکار خود بر آن دلالت کرده بودند، دیدیم. پس صاحب کشف، دست راست حق (al-Ḥaqq)، دست او، دو دست او، چشم و چشم‌هایی که به او نسبت داده شده، قدم و وجه را مشاهده می‌کند.\n\n[همانا خداوند متعال معبود مؤمنان است]\n\nسپس از جمله نعت‌ها (اوصاف) شادی، تعجب، خنده و دگرگونی از صورتی به صورت دیگر است. این همه را اهل شهود (al-Shuhūd) مشاهده کرده‌اند. پس خدایی که مؤمنان و اهل شهود (al-Shuhūd) از اهل الله او را می‌پرستند، آن خدایی نیست که اهل تفکر در ذات الله او را می‌پرستند. زیرا آنان از علم محروم شدند، به این دلیل که در تفکر در ذات الله، خدا و رسولش را نافرمانی کردند و از مرتبه کلام و نظر در یگانگی او به عنوان معبود، به چیزی تجاوز کردند که نیازی به آن نداشتند. کسانی که خود را منتسب به خدا می‌دانند، مانند ابوحامد (غزالی) و دیگران، این کار را انجام داده‌اند، و این لغزشگاه است، هرچند او (غزالی) آن را پوششی برای خود قرار داده باشد. او در مواضعی بر خلاف آنچه اثبات کرده، هشدار داده است. در مجموع، او سوء ادب ورزیده است. پس کسی که فکر و نظر خود را بر خود حاکم ساخت و عقلش را تحت سلطه نظر خود در این باره درآورد و گمان کرد که در نظر خود بر نوری از جانب پروردگارش است، با انوار دلایلش، چشم‌های انوار آنچه را که اهل شهود (al-Shuhūd) و کشف (al-Kashf) آورده‌اند، محو ساخت. پس آنچه از رسول و پیامبر در کتاب یا سنت آمده بود، اگر صاحب این انوار نظری مؤمنی صادق در ایمانش بود، آن را در حق رسول تأویل کرد تا از نظر به نور فکرش بازنگردد، زیرا اعتمادش بر آن است و اوست که در نفس خود پروردگاری را ایجاد کرده که آن‌گونه که نظرش اقتضا می‌کند، او را می‌پرستد. پس عقل خود را پرستید. سپس او در تأویل، به دلیل قصورش، امر را از تشبیه به اجسام (به دلیل حادث بودنشان) به تشبیه به معانی حادث نیز منتقل کرد. پس از هیچ حادثی جز به حادثی دیگر منتقل نشد. این امر نزد مؤمنان و کسانی که حقیقت را آن‌گونه که هست مشاهده کرده‌اند، رسوایی روزگار بود. و ریشه همه این‌ها نتیجه نافرمانی خداست، زیرا رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) که از روی هوی سخن نمی‌گوید، او را از تفکر در ذات الله نهی کرده بود.\n\nاما او (آن نهی را) انجام نداد. خداوند ما و شما را از اهل شهود (al-Shuhūd) و هستی (al-Wujūd) قرار دهد. ای کاش این مؤمن، اگر از اهل شهود نیست، امر را بر اساس علم خداوند در آن، به خدا واگذار کند و تجاوز نکند. اما اگر علوم مشابه این از غیر رسول نزد این ناظر بیاید، او را تکفیر می‌کند، زندیق می‌شمارد و جاهل می‌داند؛ در حالی که به همین امر عیناً ایمان می‌آورد وقتی رسول آن را برایش می‌آورد. پس چه حجابی بزرگ‌تر از این حجاب است؟ به او گفته می‌شود که امر چنین است، می‌گوید: این کفر است. اما وقتی به او می‌گویی که این سخن من در حدیث صحیح از پیامبر (علیه السلام) آمده است، سکوت می‌کند و می‌گوید: حال که از پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) آمده، تأویلی دارد که در آن نظر می‌کنیم. پس اگر بوی این نظری که در تأویلش امید دارد، نبود، آن را نمی‌پذیرفت. چقدر او از حق مبین دور است! و گاهی اصحاب ما از طلوع‌ها (al-Ṭawāliʿ)، طلوع‌های انوار شهود (al-Shuhūd) را اراده می‌کنند که انوار دلایل نظری را محو می‌سازند. پس آنچه را که با عقل مجرد نفی می‌کرد، بازگشت و با کشف (al-Kashf) اثبات نمود، و برای آن نور فکری در عقلش هیچ عین و اثری باقی نماند و هیچ سلطه‌ای بر آن قرار نداد. این است معنای طلوع‌ها (al-Ṭawāliʿ)."
  },
  "page_count": 2
}