{
  "id": 323,
  "title": {
    "ar": "الباب الثالث والعشرون وثلاثمائة في معرفة منزل بشرى مبشر لمبشر به وهو من الحضرة المحمدية",
    "en": "Chapter 323: Concerning the Gnosis (معرفة) of the Station (منزل) of Glad Tidings (bushrā), which is the Announcer (mubashshir) to the Announced (mubashshar bihi), and which is from the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب تین سو تیئیس: بشارت دینے والے کی طرف سے بشارت پانے والے کے لیے بشارت کی منزل کی معرفت میں، اور یہ الحضرة المحمدية (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و بیست و سوم در معرفت منزل بشارت‌دهنده‌ای که به بشارت‌شونده بشارت می‌دهد، و آن منزل از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الثالث والعشرون وثلاثمائة في معرفة منزل بشرى مبشر لمبشر به وهو من الحضرة المحمدية»\n\n\n> جاء المبشر بالرسالة يبتغي *** أجر المجي‏ء من الكريم المرسل‏\n\n\n> فأتى به ختم الولاية مثل ما *** ختم النبوة بالنبي المرسل‏\n\n\n> ولنا من الختمين حظ وافر *** ورثا أتانا في الكتاب المنزل‏\n\n\nيريد قوله يَرِثُنِي ويَرِثُ من آلِ يَعْقُوبَ‏\n\n\n### [أن المشيئة الإلهية لها أثر في الفعل لهذا نفى تعلقها بما لا يقبل الانفعال من حيث مرجحه‏]\n\n\nاعلم أن المشيئة الإلهية لما كان لها أثر في الفعل لهذا نفى تعلقها بما لا يقبل الانفعال من حيث مرجحه لا من حيث نفسه بخلاف مشيئة العبد فإنها إذا وقعت وتعلقت بالمشاء قد يكون المشاء وقد لا يكون ولهذا شرع الله لنا إذا قلنا نفعل كذا إن نقول إن شاء الله حتى إذا وقع ذلك الفعل الذي علقناه على مشيئة الله كان عن مشيئة الله بحكم الأصل ولم يكن لمشيئتنا فيه أثر في كونه لكن لها فيه حكم وهو أنه ما شاء سبحانه تكوين ذلك الشي‏ء إلا بوجود مشيئتنا إذ كان وجودها عن مشيئة الله فلا بد من وجود عين مشيئتنا وتعلقها بذلك الفعل وهو قوله وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله يعني أن تشاءوا وفائدة إخبار الله تعالى بأنه لو شاء لفعل كذا مع كون كذا يستحيل وقوعه عقلا لكون المشيئة الإلهية لم تتعلق به إعلام لنا أن ذلك الأمر الذي نفى تعلق المشيئة الإلهية بكونه ليس يستحيل وقوعه بالنظر إلى نفسه لإمكانه فإنه يجب له أن يكون في نفسه قابلا لأحد الأمرين فيفتقر إلى المرجح بخلاف المحال لنفسه فإنه يستحيل نفي تعلق المشيئة بكونه فإنه لا يكون لنفسه فإن بعض الناس ذهب إلى أن الله تعالى لو أراد إيجاد ما هو محال الوجود لنفسه لأوجده وإنما لم يوجده لكونه ما أراد وجود المحال الوجود فصاحب هذا القول يقول إن الحق أعطى المحال محاله والواجب وجوبه والممكن إمكانه فهذا القائل لا يدري ما يقول فإنه سبحانه واجب الوجود لنفسه فيلزمه إن يكون هو الذي أعطى لنفسه الوجوب ولو شاء لم يجب وجوده فكان وجود الحق مرجحا لنفسه فهو كما قال القائل أراد أن يعربه فأعجمه فإنه أراد أن ينسب إليه تعالى نفوذ الاقتدار ولم يعلم متعلق الاقتدار ما هو فعلقه بما لا يقتضيه وصبر الحق في قبيل الممكنات من حيث لا يشعر فكانت فائدة إخبار الله تعالى بقوله لو شاء فيما لا يقع إعلام إنه بالنظر إلى ذاته ممكن الوقوع ليفرق لنا سبحانه بين ما هو في الإمكان وبين ما ليس بممكن فنفى تعلق المشيئة والإرادة به فإذا علقها بالمحال على جهة نفي تعلقها مثل قوله لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً ولَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا وهذا محال لنفسه فكيف أدخله تحت نفي تعلق الإرادة التي لا يدخل تحتها إلا الممكن وهو الذي أشار إليه هذا الذي جهلناه وخطأناه في قوله‏\n\n\n### [إن الله تعالى نفي تعلق الإرادة بالمحال الوقوع‏]\n\n\nفاعلم إن هذا من غاية الكرم الإلهي حيث إنه قد سبق في علمه إيجاد مثل هذا الشخص من فساد العقل الذي قد قضى به له في قسمه فلما قضى بهذا علم إن عقله لا بد أن يعتقد مثل هذا وهو غاية الجهل بالله فأخبر الله تعالى بنفي تعلق الإرادة بالمحال الوقوع لنفسه فيأخذ الكامل العقل من ذلك نفي تعلق الإرادة بما لا يصح أن تتعلق به ويأخذ منه هذا الضعيف العقل أنه سبحانه لو لا ما قال لو وإلا كان يفعل فيستريح إلى ذلك‏\nولا ينكسر قلبه حيث أراد نفوذ الاقتدار الإلهي وقصد خيرا وليعلم الكامل العقل ما فضله الله به عليه فيزيد شكرا حيث لم يجعل الله عقله مثل هذا الناقص العقل فيعلم إن الله قد فضله عليه بدرجة لم ينلها من قصر عقله هذا القصور وقد قال جماعة بأن الله يقدر على المحال والذي ينبغي أن يقال إِنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ كما قال الله والقدرة تطلب محلها الذي تتعلق به كما إن نسبة الإرادة تطلب محلها الذي تتعلق به كما إن العلم يطلب محله الذي يتعلق به نفيا كان أو إثباتا وجودا أو عدما وكذلك نسبة السمع والبصر وجميع ما نسب الحق لنفسه فالعالم الوافر العقل يعلم متعلق كل نسبة فيضيفها إليها ومن عرف الأمور بمثل هذه المعرفة عرف حكم مقت الله بمن يقول ما لا يعمل من غير إن يقرن به المشيئة الإلهية فإذا علق المشيئة الإلهية بقوله إن يعمل فلا يكون ذلك العمل لم يمقته الله فإنه غاب عن انفراد الحق في الأعمال كلها التي تظهر على أيدي المخلوقين بالتكوين وأنه لا أثر للمخلوق فيها من حيث تكوينها وإن كان للمخلوق فيها حكم لا أثر فالناس لا يفرقون بين الأثر والحكم فإن الله إذا أراد إيجاد حركة أو معنى من الأمور التي لا يصح وجودها إلا في مواد لأنها لا تقوم بأنفسها فلا بد من وجود محل يظهر فيه تكوين هذا الذي لا يقوم بنفسه فللمحل حكم في الإيجاد لهذا الممكن وما له أثر فيه فهذا الفرق بين الأثر والحكم إذا تحققته فلما ذا يقول العبد نعمل أو نفعل هكذا ولا أثر له في الفعل جملة واحدة فإن الله يمقته على ذلك ولما علم الحق أن هذا لا بد أن يقع من عباده وإنهم يقولون ذلك شرع لهم الاستثناء الإلهي ليرتفع المقت الإلهي عنهم ولهذا لا يحنث من استثنى إذا حلف على فعل مستقبل فإنه أضافه إلى الله لا إلى نفسه وهذا لا ينافي إضافة الأفعال إلى المخلوقين فإنهم محل ظهور الأفعال الإلهية وبهذا القدر تفاوتت درجات العقلاء أ لا ترى الحق تعالى كيف قال يا أَيُّهَا الَّذِينَ آمَنُوا ولم يقل يا أولي الألباب ولا يا أولي العلم لِمَ تَقُولُونَ ما لا تَفْعَلُونَ فإن العالم العاقل لا يقول ما لا يفعل إلا بالاستثناء لأنه يعلم أن الفعل لله لا له فميز الله بين طبقات العالم ليعلموا أن الله تعالى قد رفع بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجاتٍ فالعقلاء العلماء هم المقصودون للحق من العالم بعموم كل خطاب لعلمهم بمواقع الخطاب فيعلمون أي صنف أراد من العالم بذلك الخطاب ولهذا نوع الأصناف بتنوع الآيات للمتفكرين وللعالمين وللعقلاء ولأولي الألباب كما قال تعالى في القرآن العزيز إنه بَلاغٌ لِلنَّاسِ يريد طائفة مخصوصة لا يعقلون منه سوى إنه بلاغ ولِيُنْذَرُوا به في حق طائفة أخرى عينها بهذا الخطاب ولِيَعْلَمُوا أَنَّما هُوَ إِلهٌ واحِدٌ في حق طائفة أخرى عينها بهذا الخطاب ولِيَذَّكَّرَ أُولُوا الْأَلْبابِ في حق طائفة أخرى أيضا والقرآن واحد في نفسه تكون الآية منه تذكرة لذي اللب وتوحيد الطالب العلم بتوحيده وإنذارا للمترقب الحذر وبلاغا للسامع ليحصل له أجر السماع كالعجمي الذي لا يفهم اللسان فيسمع فيعظم كلام الله من حيث نسبته إلى الله ولا يعرف معنى ذلك اللفظ حتى يشرح له بلسانه ويترجم له عنه فمن جملة الخطابات الإلهية البشارات وهي على قسمين بشارة بما يسوء مثل قوله فَبَشِّرْهُمْ بِعَذابٍ أَلِيمٍ وبشارة بما يسوء مثل قوله تعالى فَبَشِّرْهُ بِمَغْفِرَةٍ وأَجْرٍ كَرِيمٍ فكل خير يؤثر وروده في بشرة الإنسان الظاهرة فهو خبر بشري وذلك لا يكون إلا في رجلين إما في شخص يكون في قوة نفسه أن لا تتغير بشرته بما يتحقق كونه وإما شخص غير مصدق بذلك الخبر من ذلك المخبر فلا يخلو هذا القوي النفس هل أثر ذلك الخبر في باطنه أو لم يؤثر فإن أثر خبر هذا المخبر في نفسه فهو أحد رجلين إما عالم محقق بوقوعه وإما مجوز وإن لم يؤثر في نفسه فهو غير عالم ولا مصدق معا فيكون ذلك الخبر في حق الأول بشرى متعلقها الصورة المتخيلة في نفسه التي تأثرت لهذا الخبر فلو لم تقم بخياله تلك الصورة المضاهية للصورة الحسية لما كانت بشرى في حقه ولا كانت تؤثر في باطنه سرورا ولا حزنا وإن لم يظهر ذلك في ظاهره فلو تجردت الأرواح عن المواد لما صحت البشائر\n\n\nفي حقها ولا حكم عليها سرور ولا حزن ولكان الأمر لها علما مجردا من غير أثر فإن الالتذاذ الروحاني إنما سببه إحساس الحس المشترك مما يتأثر له المزاج من الملاءمة وعدم الملاءمة وبالقياسات وأما الأرواح بمجردها فلا لذة ولا ألم وقد يحصل ذلك لبعض العارفين في هذا الطريق قال أبو يزيد ضحكت زمانا وبكيت زمانا وأنا اليوم لا أضحك ولا أبكي وهو عين ما قلناه فإنه وقف مع مجرد روحه من غير نظر إلى طبيعته فما شاهد إلا علما محضا كما يرتفع عن النظر في توحيد الحق‏\nمن حيث توحيد الألوهية إلى توحيد ذاته من حيث هو لنفسه لا من حيث المرتبة التي بها يتعلق الممكن فيشاهده في ذلك التوحيد واحدا لا واحدا معرى عن النسب والإضافات مجهولا للممكنات غير منسوب لنفسه بأنه عالم بنفسه لنفسه فهو في ذلك التوحيد عينه لا من حيث هو عينه ولا من حيث لا هو عينه وهذا أسنى المراتب في تجريد الكون عن التعلق به وهو كمال الأحدية لا كمال الوحدانية فإن كمال الوحدانية في سريان أحديته في العقائد فإن الوحداني هو الذي يطلب الموحدين والأحدية لا تطلب ذلك كالجسماني هو الذي يطلب الأجسام ليظهر بها حكمه فاعلم فإذا رأيت عارفا تأتي عليه أسباب الالتذاذ وأسباب التألم ولا يلتذ ولا يتألم لا بالمحسوس ولا بالمعقول في اقتناء العلوم الملذة فتعلم إن وقته التجرد التام عن طبيعته وهذا أقوى التشبه الذي يسعى إليه العلماء بالله وواجده قليل والقليل الذي يجده قليل الاستصحاب لهذا الوجدان وإنما الله يكرم به من شاء من عباده في خطرات ما ليعلمه بالتوحيد الذاتي الذي ذكرناه فإن طائفة من العقلاء نسبوا الالتذاذ والابتهاج إلى ذلك الجناب بالكمال الذي هو عليه تعالى الأحد في ذاته عن هذا الوصف لكن الوحدانية الإلهية هي التي ينظر إليها القائلون بهذا القول ولا يشعرون قال تعالى سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ وأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ فمن نظر الحق من حيث ذاته عرف ما قلناه ومن نظره من حيث ألوهيته عرف ما قلناه ألا تنظر إلى مبادي الوحي الإلهي النبوي إنما هي المبشرات وهي التي بقيت في الأمة بعد انقطاع النبوة فتخيل من لا علم له بالأمر بما هو عليه إن ذلك نقص في حق هذه الأمة ليس الأمر كما ظنه من لا علم له بتقسيم الوحي فإن وحي المبشرات هو الوحي الأعم الذي يكون من الحق إلى العبد بلا واسطة ويكون أيضا بواسطة والنبوة من شأنها الواسطة ولا بد فلا بد من الملك فيها والمبشرات ليست كذلك فالعبد العارف لا يبالي ما فاته من النبوة مع بقاء المبشرات عليه إلا أن الناس يتفاضلون فيها فمنهم من لا يبرح في بشراه عن الواسطة ومنهم من يرتفع عنها كالخضر والأفراد فلهم المبشرات بارتفاع الوسائط وما لهم النبوة ولهذا ننكر عليهم الأحكام فما كان من حكم في الكون من المبشرات فهو من البشرى بالواسطة وهو تعريف خاصة بما جاء به الرسول وما لم يكن لها حكم الكون إلا العلم المجرد في تكملة ذاته فمن البشرى بترك الواسطة فالرسل فضلت من سواها بتحصيل ضروب مراتب الوحي من المبشرات وغيرها من نزول الأملاك على قلوبهم وعلى حواسهم ولهم المبشرات فهم الأفراد الأقطاب ونحن الأفراد لا الأقطاب وأعني بالأقطاب الشخص الذي تدور عليه رحى السياسات الناموسية المبثوثة في مصالح العالم المؤيدة بالمعجزات والآيات فالله يجعلنا ممن بشره به فنام إلى الأبد ولم ينتبه سأل سهل بن عبد الله رجلا من أهل عبادان عن سجود القلب وكان قد رأى سهل بن عبد الله قلبه قد سجد فعرض ذلك على جماعة من الشيوخ من أهل زمانه فلم يعرفوا ما يقول لأنهم لم يذوقوا ذلك فرحل في طلب من يعرف ذلك فلما وصل إلى عبادان دخل على شيخ فقال له يا أستاذ أ يسجد القلب فقال الشيخ إلى الأبد يعني أنه لا يرفع رأسه من سجدته فعرف سهل بن عبد الله في\n\n\nسؤاله إن الله أطلعه على سجود قلبه فلازم تلك الصفة فلم يرفع رأسه من سجدته لا في الدنيا ولا يرفعه في الآخرة فما دعا الله بعد ذلك في رفع شي‏ء نزل ولا في إنزال شي‏ء رفع وهذا هو المقام المجهول الذي جهله العارفون وما ثبت فيه إلا المفردون ولو لا إن الأنبياء شرع لهم أن يشرعوا للخاص والعام حيث جعلهم الله أسوة لكانت حالتهم ما ذكرناه ولكن صلوات الله عليهم لازموا الحضور في سجود القلب عند التشريع وهذا غاية القوة حيث أعطوا حكم الحال المستصحب الذي لا يرتفع أبدا فغير النبي إذا علمه تكلف فيه وقد أعلمناك في غير ما موضع أن الأوائل في الأشياء هي المعتبرة في النسبة إلى الله وإنها الصدق الذي لا يدخله مين والقوة التي لا يشوبها ضعف في الخاطر الأول والنظرة الأولى والسماع الأول والكلمة الأولى والحركة الأولى كل أول لا يكون إلا مخلصا لله لا يقع فيه اشتراك ثم بعد الأول يدخل‏\n\n\nما يدخل فيصدق ولا يصدق فانظر أول ما بدي‏ء به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من الوحي المبشرات فحازت المبشرات الأولية فكان لا يرى رؤيا إلا خرجت مثل فلق الصبح لأن فلق الصبح انفلق عن الليل كما انفلق صاحب هذه المبشرة عن النوم فانظر ما أحسن هذا التشبيه الذي شبهته به أمنا عائشة رضي الله عنها فأبقى الله على رجال هذه الأمة أول الوحي‏\nالذي لا يخطئ أبدا فإن فهمت قدر ما ذكرته لك ونبهتك عليه علمت عناية الله بهذه الأمة فيما أبقى عليها من النبوة وهو زبدة محضتها ويكفي هذا القدر من هذا المنزل ويتضمن هذا المنزل من العلوم علم التنزيه وعلم التوحيد الإلهي وعلم تنزيه العالم العلوي والسفلي وعلم المشيئة والكلام وعلم الأعمال وتفاصيلها وعلم المحبة الإلهية من وجه خاص لا من جميع الوجوه وأعني بالوجه الخاص حبه للتوابين وحبه للمتطهرين وحبه للمؤمنين فلا تتساوى وجوه المحبة لعدم تساوى هذه الطبقات وإن لم يكن كذلك فآية فائدة للتفصيل فيها وعلم السبل الإلهية وعلم مجاهدة النفوس ورياضاتها وعلم الثبات عند الواردات وعلم التأييد بالمناسب الجنسي وعلم العتاب وعلم الجزاء في الدنيا وعلم العناية وعلم الخذلان وعلم معرفة مراتب الخلق والعلم الحق من العلم الخيالي وعلم التمام وعلم الأنوار وما يذم من الشرك وما يحمد وعلم الايمان وعلم المغفرة وعلم المحبة المتعلقة بالأكوان وشرف المحمود منها وعلم البشائر وعلم الوصايا الإلهية وعلم تأييد أهل الله إذا صدقوا مع الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ‏\n\n",
    "en": "Chapter Three Hundred and Twenty-Third: Concerning the Knowledge of the Station of Glad Tidings, the Bearer of Glad Tidings, and the Recipient of Glad Tidings, which is from the Muhammadan Presence (الحضرة المحمدية).\n\nThe bearer of the Message came seeking\nThe reward for coming from the Generous Sender.\n\nAnd the Seal of Sainthood (ختم الولاية) came with him, just as\nProphethood was sealed by the Messenger Prophet.\n\nAnd we have a plentiful share from the two Seals,\nA heritage that came to us in the Revealed Book.\n\nHe means His saying: <<يَرِثُنِي وَيَرِثُ مِنْ آلِ يَعْقُوبَ>> (He shall inherit me and inherit from the family of Jacob).\n\n### [That the Divine Will (المشيئة الإلهية) has an effect on the Act, which is why its connection was negated regarding that which does not accept being acted upon, in terms of its determinant]\n\nKnow that since the Divine Will (المشيئة الإلهية) has an effect on the Act (الفعل), its connection was therefore negated regarding that which does not accept being acted upon, in terms of its determinant, not in terms of its essence. This is contrary to the will of the servant, for when it occurs and connects to the willed object (المشاء), the willed object may or may not come into existence. For this reason, Allah legislated for us that when we say we will do such-and-such, we must say \"if Allah wills\" (إن شاء الله). Thus, if that act which we conditioned upon the Will of Allah occurs, it occurs by the Will of Allah according to the fundamental principle (الأصل). Our own will has no effect on its existence, but it does have a ruling (حكم) in it: namely, that the Glorified One did not will the formation (تكوين) of that thing except through the existence of our will, since the existence of our will is itself from the Will of Allah. Therefore, the existence of our specific will and its connection to that act is necessary. This is His saying: <<وَمَا تَشَاؤُونَ إِلَّا أَن يَشَاءَ اللَّهُ>> (And you do not will except that Allah wills), meaning that you should will.\n\nThe benefit of Allah Almighty informing us that if He had willed, He would have done such-and-such—even though the occurrence of such-and-such is rationally impossible (يستحيل وقوعه عقلا) because the Divine Will did not connect to it—is to inform us that the matter whose existence the Divine Will negated connection to is not impossible in view of its own essence, due to its possibility (إمكانه). For it must be inherently receptive to one of the two states (existence or non-existence) and thus requires a determinant (المرجح). This is contrary to that which is inherently impossible (المحال لنفسه), for it is impossible to negate the connection of the Will to its existence, since it cannot exist by its own nature.\n\nIndeed, some people have held that if Allah Almighty had willed the creation of that which is inherently impossible of existence (محال الوجود لنفسه), He would have created it, and He only did not create it because He did not will the existence of the inherently impossible. The proponent of this view claims that The Real (الحق) granted the impossible its impossibility, the necessary (الواجب) its necessity, and the possible (الممكن) its possibility. This speaker does not know what he is saying. For the Glorified One is Necessary of Existence (واجب الوجود) by His Essence, which would necessitate that He is the one who granted necessity to Himself, and if He had willed, His existence would not have been necessary. Thus, the existence of The Real would be determined by Himself. This is like the saying of the one who \"intended to Arabize it but made it foreign.\" He intended to attribute the penetration of power (نفوذ الاقتدار) to the Almighty but did not know what the object of power is, so he connected it to that which does not necessitate it, thereby placing The Real (الحق) unknowingly among the category of possibles (الممكنات).\n\nTherefore, the benefit of Allah Almighty informing us by saying \"if He had willed\" regarding what does not occur is to inform us that, in view of its essence, it is possible of occurrence. This is so the Glorified One may distinguish for us between what is within possibility (الإمكان) and what is not possible, thereby negating the connection of the Will (المشيئة) and Intention (الإرادة) to the latter. When He connects the Will to the inherently impossible (المحال) in the context of negating its connection, such as His saying: <<لَوْ أَرَادَ اللَّهُ أَن يَتَّخِذَ وَلَدًا>> (If Allah had intended to take a son) and <<وَلَوْ أَرَدْنَا أَن نَّتَّخِذَ لَهْوًا لَّاتَّخَذْنَاهُ مِن لَّدُنَّا>> (And if We had intended to take a diversion, We would have taken it from Our presence). This is inherently impossible (محال لنفسه). How then did He include it under the negation of the connection of Intention, which only includes the possible (الممكن)? This is what the person we deemed ignorant and mistaken in his statement alluded to.\n\n### [Indeed, Allah Almighty negated the connection of Intention (الإرادة) to that which is impossible of occurrence]\n\nKnow that this is due to the utmost Divine Generosity (الكرم الإلهي), for it was preceded in His Knowledge that such a person would be created with the corruption of intellect (فساد العقل) that He decreed for him in his portion. When He decreed this, He knew that this intellect must hold such a belief, which is the height of ignorance concerning Allah. Thus, Allah Almighty informed us by negating the connection of Intention to that which is inherently impossible of occurrence. The person of perfect intellect (الكامل العقل) derives from this the negation of the connection of Intention to that which is improper for it to connect to. Whereas the person of weak intellect (الضعيف العقل) derives from it that, were it not for the conditional \"if\" (لو), the Glorified One would have acted, and he finds comfort in that. His heart is not broken, as he intended the penetration of Divine Power (نفوذ الاقتدار الإلهي) and aimed for good. And let the person of perfect intellect know the favor Allah has bestowed upon him over the other, so that he may increase in gratitude, knowing that Allah did not make his intellect like that of this deficient intellect (الناقص العقل). He thus knows that Allah has favored him over the other by a degree that the other did not attain due to the deficiency of his intellect.\n\nA group has said that Allah is capable of the inherently impossible (المحال). What ought to be said is: <<إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (Indeed, Allah is over all things competent/Powerful), just as Allah said. Power (القدرة) seeks its locus (محلها) to which it connects, just as the relation of Intention (الإرادة) seeks its locus to which it connects, and just as Knowledge (العلم) seeks its locus to which it connects, whether in negation or affirmation, existence or non-existence. The same applies to the relation of Hearing, Sight, and everything The Real (الحق) attributes to Himself. The scholar of abundant intellect (الوافر العقل) knows the object of connection for every relation and attributes it accordingly. Whoever knows matters with this kind of gnosis (المعرفة) understands the ruling concerning Allah's wrath (مقت الله) upon those who say what they do not do without coupling it with the Divine Will (المشيئة الإلهية).\n\nIf he conditions the Divine Will by saying \"if he acts,\" and that act does not occur, Allah does not hold him in wrath. For he was absent from the singularity of The Real (انفراد الحق) in all acts that appear through the hands of creatures by way of formation (التكوين), and that the creature has no effect (أثر) in their formation, although the creature does have a ruling (حكم) in them, not an effect. People do not distinguish between effect and ruling. For when Allah wills the creation of a movement or a meaning among the matters whose existence is only valid within substances (مواد) because they cannot subsist by themselves, there must be a locus (محل) in which the formation of this non-self-subsisting thing appears. The locus has a ruling (حكم) in the creation of this possible thing, but it has no effect (أثر) in it. This is the difference between effect and ruling, if you verify it. Why, then, does the servant say, \"We will act\" or \"We will do such-and-such,\" when he has absolutely no effect on the act? Allah holds him in wrath for that. Since The Real (الحق) knew that this must occur from His servants and that they would say that, He legislated the Divine Exception (الاستثناء الإلهي) for them so that the Divine Wrath (المقت الإلهي) might be lifted from them. For this reason, one who makes an exception (استثنى) when swearing an oath regarding a future action does not break his oath, because he attributed it to Allah, not to himself. This does not contradict the attribution of acts to creatures, for they are the locus of the manifestation of Divine Acts (الأفعال الإلهية).\n\nBy this measure, the degrees of the intelligent ones (العقلاء) vary. Do you not see how The Real Almighty said: <<يَا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed), and did not say, \"O people of understanding\" or \"O people of knowledge,\" <<لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ>> (Why do you say what you do not do)? For the knowledgeable, intelligent person (العالم العاقل) does not say what he does not do except with the exception, because he knows that the Act belongs to Allah, not to him. Thus, Allah distinguished between the classes of the world so that they might know that Allah Almighty has raised <<بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ>> (some of them above others in degrees). The intelligent scholars (العقلاء العلماء) are the ones intended by The Real in the generality of every address, due to their knowledge of the contexts of the address. They know which class of people is intended by that address. For this reason, He diversified the classes by diversifying the verses (الآيات) for those who reflect, for those who know, for the intelligent, and for the people of understanding (أولي الألباب). Just as He Almighty said concerning the Noble Quran: <<إِنَّهُ بَلَاغٌ لِّلنَّاسِ>> (Indeed, it is a communication for mankind), meaning a specific group who understand nothing from it except that it is a communication; and <<وَلِيُنذَرُوا بِهِ>> (and that they may be warned thereby), regarding another group specified by this address; and <<وَلِيَعْلَمُوا أَنَّمَا هُوَ إِلَهٌ وَاحِدٌ>> (and that they may know that He is but one God), regarding yet another group specified by this address; and <<وَلِيَذَّكَّرَ أُولُو الْأَلْبَابِ>> (and that those of understanding may remember), regarding still another group. The Quran is one in itself, yet a verse from it can be a reminder for the person of understanding, a confirmation of Oneness (توحيد) for the seeker of knowledge, a warning for the cautious expectant, and a communication for the listener so that he may receive the reward of listening. This is like the non-Arab (العجمي) who does not understand the language; he listens and venerates the Word of Allah based on its attribution to Allah, but he does not know the meaning of that utterance until it is explained to him in his own tongue and translated for him.\n\nAmong the Divine addresses are the glad tidings (البشارات), which are of two types: tidings of what is bad, such as His saying: <<فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ>> (So give them tidings of a painful punishment); and tidings of what is good, such as His Almighty saying: <<فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ>> (So give him tidings of forgiveness and a noble reward). Every piece of news whose arrival affects the apparent countenance (بشرة) of the human is \"tidings.\" This only occurs in two types of people: either a person whose soul is strong enough that his countenance does not change despite the certainty of the news, or a person who does not believe the news from the informant. This strong-souled person must either have been affected by the news internally or not. If the news of the informant affected his soul, he is one of two men: either a scholar certain of its occurrence, or one who deems it possible. If it did not affect his soul, he is neither knowledgeable nor believing. Thus, that news, for the first type, is glad tidings (بشرى) whose object of connection is the imagined form (الصورة المتخيلة) in his soul that was affected by this news. If that image, which corresponds to the sensory image (الصورة الحسية), had not arisen in his imagination (خيال), it would not have been glad tidings for him, nor would it have affected his inner being with joy or sorrow, even if it did not appear outwardly.\n\nIf souls (الأرواح) were stripped of substances (المواد), glad tidings would not be valid for them, nor would joy or sorrow rule over them. The matter would be pure Knowledge (علما مجردا) without effect. For spiritual pleasure (الالتذاذ الروحاني) is only caused by the sensation of the common sense (الحس المشترك) due to the temperament (المزاج) being affected by compatibility or incompatibility, and by analogies. As for souls purely by themselves, there is neither pleasure nor pain.\n\nThis state may occur for some Gnostics (العارفين) on this path. Abu Yazid said: \"I laughed for a time, and I wept for a time, and today I neither laugh nor weep.\" This is exactly what we have stated, for he stood with his pure spirit (مجرد روحه), without regard for his nature (طبيعته). He witnessed nothing but pure Knowledge (علما محضا). Just as one rises above contemplating the Oneness (توحيد) of The Real (الحق) in terms of the Oneness of Divinity (توحيد الألوهية) to the Oneness of His Essence (توحيد ذاته) as He is for Himself, not in terms of the Level (المرتبة) to which the possible (الممكن) connects. In that Oneness, he witnesses Him as One, not a one, stripped of relations (النسب) and attributions (الإضافات), unknown to the possibles, not attributed to Himself as being Knower of Himself for Himself. In that Oneness, He is His Essence, not in the sense that He is His Essence, nor in the sense that He is not His Essence. This is the most sublime of Levels (المراتب) in stripping the cosmos (الكون) from connection to Him. It is the perfection of Absolute Oneness (الأحدية), not the perfection of Unity (الوحدانية). For the perfection of Unity lies in the permeation of His Absolute Oneness through beliefs. The Unitary One (الوحداني) is the one who seeks the unitarians (الموحدين), whereas Absolute Oneness does not seek that, just as the corporeal seeks bodies to manifest its ruling through them. Know this.\n\nTherefore, if you see a Gnostic (عارف) upon whom the causes of pleasure and the causes of pain descend, yet he feels neither pleasure nor pain, neither through the sensible nor through the intelligible in acquiring pleasurable knowledge, then know that his time is one of complete detachment (التجرد التام) from his nature (طبيعته). This is the strongest form of assimilation (التشبه) sought by the scholars of Allah. Those who find it are few, and those few who find it rarely maintain this finding (الوجدان). Allah only honors whomever He wills among His servants with this state during certain fleeting moments (خطرات) so that He may teach him the Essential Oneness (التوحيد الذاتي) we mentioned. A group of intelligent people attributed pleasure and delight to that Divine Presence (الجناب) due to the perfection He possesses—He who is Absolutely One (الأحد) in His Essence, far removed from this description. However, it is the Divine Unity (الوحدانية الإلهية) that the proponents of this view are looking at, though they do not realize it. He Almighty said: <<سَنَسْتَدْرِجُهُمْ مِّنْ حَيْثُ لَا يَعْلَمُونَ * وَأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ>> (We will progressively lead them [to destruction] from where they do not know * And I will grant them respite. Indeed, My plan is firm). Whoever views The Real (الحق) from the perspective of His Essence (ذاته) knows what we have said, and whoever views Him from the perspective of His Divinity (ألوهيته) knows what we have said.\n\nDo you not observe that the beginnings of the Divine Prophetic Revelation (الوحي الإلهي النبوي) are nothing but the glad tidings (المبشرات)? These are what remained in the Community (الأمة) after the cessation of Prophethood (النبوة). Thus, one who lacks knowledge of the matter as it truly is imagines that this is a deficiency for this Community. The matter is not as the one ignorant of the classification of Revelation (تقسيم الوحي) supposed. For the revelation of glad tidings (وحي المبشرات) is the more general revelation (الوحي الأعم) that comes from The Real (الحق) to the servant without an intermediary (واسطة), and it can also come with an intermediary. Prophethood necessarily involves an intermediary; thus, the Angel (الملك) is indispensable in it. Glad tidings are not like that. The Gnostic servant (العبد العارف) does not care what he missed of Prophethood, provided the glad tidings remain with him. However, people differ in this regard: some never leave the intermediary in their tidings, while others rise above it, such as Al-Khidr and the Individuals (الأفراد). They receive glad tidings with the removal of intermediaries, but they do not possess Prophethood. For this reason, we deny them the rulings (الأحكام). Whatever ruling (حكم) exists in the cosmos (الكون) derived from the glad tidings is from the tidings received through an intermediary, which is the specific definition of what the Messenger brought. And whatever has no cosmic ruling except pure Knowledge (العلم المجرد) for the perfection of one's essence is from the tidings received by abandoning the intermediary. The Messengers (الرسل) were favored over others by attaining various levels (مراتب) of Revelation, including glad tidings and others, such as the descent of Angels (الأملاك) upon their hearts and senses. They possess the glad tidings; they are the Individuals who are also the Poles (الأقطاب). We are the Individuals, but not the Poles. By Poles, I mean the person around whom the mill of nomological policies (السياسات الناموسية) revolves, which are disseminated for the welfare of the world and supported by miracles (المعجزات) and signs (الآيات).\n\nMay Allah make us among those to whom He gave glad tidings, so that he slept forever and never woke up. Sahl ibn Abdullah asked a man from Abbadan about the prostration of the heart (سجود القلب). Sahl ibn Abdullah had seen his own heart prostrate, and he presented this to a group of Shaykhs of his time, but they did not understand what he was saying because they had not tasted that state. So he traveled seeking someone who knew it. When he reached Abbadan, he entered upon a Shaykh and asked him, \"O Master, does the heart prostrate?\" The Shaykh replied, \"Forever,\" meaning that it never raises its head from its prostration. Sahl ibn Abdullah recognized from his question that Allah had revealed the prostration of his heart to him. So he adhered to that quality and never raised his head from his prostration, neither in this world nor will he raise it in the Hereafter. After that, he never supplicated Allah to lift anything that had descended, nor to bring down anything that had been raised.\n\nThis is the Unknown Station (المقام المجهول) that the Gnostics (العارفون) were ignorant of, and only the Solitaries (المفردون) remained firm in it. Were it not that the Prophets (الأنبياء) were legislated to legislate for the elite and the common folk, since Allah made them examples, their state would have been what we mentioned. However, blessings of Allah be upon them, they maintained the Presence (الحضور) in the prostration of the heart while legislating. This is the utmost strength, as they were given the ruling of the sustained state (الحال المستصحب) that never lifts. A non-Prophet, if he knows it, strives artificially to attain it.\n\nWe have informed you in more than one place that the first instances (الأوائل) in things are what are considered in relation to Allah. They are the sincerity (الصدق) that no falsehood enters, and the strength that no weakness contaminates: in the first thought, the first glance, the first hearing, the first word, and the first movement. Every first instance is purely devoted to Allah (مخلصا لله); no partnership occurs in it. Then, after the first, things enter that may or may not be sincere.\n\nLook at what the Messenger of Allah (peace and blessings be upon him) began with in Revelation (الوحي): the glad tidings (المبشرات). Thus, he attained the primordial glad tidings (المبشرات الأولية). He would not see a dream except that it came true like the break of dawn (فلق الصبح). For the break of dawn splits open from the night, just as the recipient of these glad tidings splits open from sleep. Look how beautiful this simile is, which our Mother Aisha (may Allah be pleased with her) used to describe it. So Allah preserved for the men of this Community (الأمة) the first instance of Revelation (أول الوحي), which never errs. If you understand the measure of what I have mentioned and alerted you to, you will know Allah's care for this Community in what He preserved for them of Prophethood, which is its pure essence (زبدة محضتها). This much suffices for this Station (منزل).\n\nThis Station encompasses the sciences of: Transcendent Purity (التنزيه), Divine Oneness (التوحيد الإلهي), the transcendent purity of the upper and lower worlds (العالم العلوي والسفلي), Will (المشيئة) and Speech (الكلام), Acts (الأعمال) and their details, and Divine Love (المحبة الإلهية) from a specific perspective, not from all perspectives. By the specific perspective, I mean His love for those who repent (التوابين), His love for those who purify themselves (المتطهرين), and His love for the believers (المؤمنين). The aspects of love are not equal due to the inequality of these classes; otherwise, what would be the benefit of detailing them? [It also encompasses the sciences of:] Divine Paths (السبل الإلهية), the struggle and spiritual discipline (رياضاتها) of the souls (النفوس), steadfastness during spiritual influxes (الواردات), support through generic suitability (التأييد بالمناسب الجنسي), reproach (العتاب), recompense in this world, Divine Care (العناية), abandonment (الخذلان), knowledge of the degrees of creation (مراتب الخلق), true Knowledge (العلم الحق) distinguished from imaginary Knowledge (العلم الخيالي), perfection (التمام), lights (الأنوار), what is blameworthy and praiseworthy concerning polytheism (الشرك), faith (الايمان), forgiveness (المغفرة), love related to the created realms (الأكوان) and the nobility of what is praised therein, glad tidings (البشائر), Divine injunctions (الوصايا الإلهية), and the support of the People of Allah when they are truthful with Allah. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way). <<وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ>> (And praise be to Allah, Lord of the Worlds).",
    "ur": "باب نمبر تین سو تئیس: بشارت دینے والے کی بشارت پانے والے کے لیے بشارت کے مقام کی معرفت میں، اور یہ مقام الحضرة المحمدیۃ (الحضرة المحمدیۃ) سے ہے۔\n\nبشارت دینے والا رسالت لے کر آیا،\nکریم مرسل (اللہ) سے آمد کا اجر طلب کرتا ہے۔\nپس وہ اسے ختم الولایۃ (ختم الولایۃ) کے ساتھ لایا، جیسا کہ\nختم نبوت نبی مرسل کے ساتھ ہوئی۔\nاور ہمیں دونوں ختموں سے وافر حصہ ملا ہے،\nجو وراثت میں ہمیں نازل شدہ کتاب (قرآن) میں ملا ہے۔\n\nاس سے مراد اللہ کا یہ قول ہے: \"وہ میرا وارث ہو اور آلِ یعقوب کا بھی وارث ہو۔\" (سورۃ مریم، ۱۹:۶)\n\n### [یہ کہ مشیئت الٰہیہ کا فعل میں اثر ہے، اسی لیے اس نے اس چیز سے اپنے تعلق کی نفی کی جو اپنے مرجح کے لحاظ سے انفعال قبول نہیں کرتی]\n\nجان لو کہ جب المشیئۃ الإلٰہیۃ (المشیئۃ الإلٰہیۃ) (مشیت الٰہیہ) کا فعل میں اثر ہوتا ہے، اسی لیے اس نے اس چیز سے اپنے تعلق کی نفی کی جو اپنے مرجح (ترجیح دینے والے سبب) کے لحاظ سے انفعال (اثر قبول کرنا) قبول نہیں کرتی، نہ کہ اپنی ذات کے لحاظ سے۔ اس کے برعکس، بندے کی مشیت جب واقع ہوتی ہے اور مشاء (جس کا ارادہ کیا گیا) سے متعلق ہوتی ہے تو مشاء ہو بھی سکتا ہے اور نہیں بھی۔ اسی لیے اللہ نے ہمارے لیے یہ مشروع کیا کہ جب ہم کہیں کہ ہم ایسا کریں گے تو ہم \"ان شاء اللہ\" (اگر اللہ نے چاہا) کہیں، تاکہ جب وہ فعل واقع ہو جسے ہم نے اللہ کی مشیت سے معلق کیا تھا، تو وہ اصل حکم کے مطابق اللہ کی مشیت سے ہو، اور اس کے وجود میں ہماری مشیت کا کوئی اثر نہ ہو۔ لیکن اس میں ہماری مشیت کا ایک حکم (حکم) ہے، اور وہ یہ ہے کہ اللہ سبحانہ نے اس شے کی تکوین (تخلیق) کا ارادہ نہیں کیا مگر ہماری مشیت کے وجود کے ساتھ، کیونکہ ہماری مشیت کا وجود بھی اللہ کی مشیت سے ہے۔ لہٰذا ہماری عین مشیت کا وجود اور اس فعل سے اس کا تعلق ضروری ہے، اور یہی اللہ کا قول ہے: \"اور تم نہیں چاہ سکتے مگر یہ کہ اللہ چاہے۔\" (سورۃ الإنسان، ۷۶:۳۰) یعنی تم چاہو۔ اور اللہ تعالیٰ کے اس خبر دینے کا فائدہ کہ اگر وہ چاہتا تو ایسا کر دیتا، حالانکہ عقل کے لحاظ سے اس کا وقوع محال ہے کیونکہ المشیئۃ الإلٰہیۃ (المشیئۃ الإلٰہیۃ) اس سے متعلق نہیں ہوئی، یہ ہمیں آگاہ کرنا ہے کہ وہ امر جس کے وجود سے المشیئۃ الإلٰہیۃ (المشیئۃ الإلٰہیۃ) کے تعلق کی نفی کی گئی ہے، وہ اپنی ذات کے لحاظ سے وقوع میں محال نہیں ہے، کیونکہ وہ ممکن ہے۔ پس اس کے لیے ضروری ہے کہ وہ اپنی ذات میں دو امور میں سے کسی ایک کو قبول کرنے والا ہو، لہٰذا وہ مرجح (ترجیح دینے والے) کا محتاج ہے۔ بخلاف اس کے جو اپنی ذات کے لیے محال ہو، کیونکہ اس کے وجود سے مشیت کے تعلق کی نفی محال ہے، کیونکہ وہ اپنی ذات کے لیے موجود نہیں ہو سکتا۔ بعض لوگ اس طرف گئے ہیں کہ اگر اللہ تعالیٰ اس چیز کو وجود دینا چاہتا جو اپنی ذات کے لیے محال الوجود ہے تو وہ اسے وجود دے دیتا، اور اس نے اسے صرف اس لیے وجود نہیں دیا کہ اس نے محال الوجود کے وجود کا ارادہ نہیں کیا۔ اس قول کا قائل کہتا ہے کہ الحق (ذات حق) نے محال کو اس کا محال ہونا، واجب کو اس کا وجوب، اور ممکن کو اس کا امکان عطا کیا۔ یہ قائل نہیں جانتا کہ وہ کیا کہہ رہا ہے، کیونکہ وہ سبحانہ اپنی ذات کے لیے واجب الوجود ہے، لہٰذا اس پر لازم آتا ہے کہ وہ خود ہی ہو جس نے اپنی ذات کو وجوب عطا کیا، اور اگر وہ چاہتا تو اس کا وجود واجب نہ ہوتا۔ پس الحق (ذات حق) کا وجود اپنی ذات کے لیے مرجح (ترجیح دینے والا) ہوا۔ یہ ایسا ہی ہے جیسا کہ کہنے والے نے کہا: \"اس نے اسے عربی بنانا چاہا تو اسے عجمی بنا دیا۔\" کیونکہ اس نے اللہ تعالیٰ کی طرف اقتدار کے نفاذ کو منسوب کرنا چاہا، لیکن اسے یہ معلوم نہ ہوا کہ اقتدار کا متعلق کیا ہے، پس اس نے اسے اس چیز سے متعلق کر دیا جو اس کا تقاضا نہیں کرتی، اور اس نے الحق (ذات حق) کو ممکنات کے قبیل میں شامل کر دیا جہاں سے وہ بے خبر تھا۔ پس اللہ تعالیٰ کے اس قول کا فائدہ، \"اگر وہ چاہتا\" ان امور میں جو واقع نہیں ہوتے، یہ آگاہ کرنا ہے کہ وہ اپنی ذات کے لحاظ سے ممکن الوقوع ہے، تاکہ وہ سبحانہ ہمارے لیے فرق کر دے کہ کیا چیز امکان میں ہے اور کیا ممکن نہیں ہے، پس اس نے مشیت اور ارادے کے تعلق کی نفی کر دی۔ اور جب اس نے محال سے اس کے تعلق کی نفی کے طور پر اسے معلق کیا، جیسا کہ اس کا قول ہے: \"اگر اللہ ارادہ کرتا کہ وہ کوئی بیٹا بنائے\" (سورۃ الکہف، ۱۸:۴) اور \"اگر ہم کوئی کھیل بنانا چاہتے تو ہم اسے اپنے پاس سے بنا لیتے\" (سورۃ الأنبیاء، ۲۱:۱۷)۔ اور یہ اپنی ذات کے لیے محال ہے، تو اس نے اسے نفی تعلق ارادہ کے تحت کیسے داخل کر دیا، جس کے تحت صرف ممکن ہی داخل ہوتا ہے؟ اور یہی وہ بات ہے جس کی طرف اس شخص نے اشارہ کیا جسے ہم نے جاہل قرار دیا اور اس کے قول میں اسے غلط ٹھہرایا۔\n\n### [یہ کہ اللہ تعالیٰ نے محال الوقوع سے ارادے کے تعلق کی نفی کی]\n\nجان لو کہ یہ انتہائی کرم الٰہی (کرم الإلٰہی) میں سے ہے، کیونکہ اس کے علم میں ایسے شخص کا وجود لانا پہلے سے موجود تھا جو عقل کے فساد کا حامل ہو، جس کا فیصلہ اس کے حصے میں کیا گیا تھا۔ جب اس نے اس کا فیصلہ کر دیا تو اسے معلوم تھا کہ اس کی عقل کو لازماً ایسا ہی اعتقاد رکھنا ہے، اور یہ اللہ کے بارے میں انتہائی جہالت ہے۔ پس اللہ تعالیٰ نے اپنی ذات کے لیے محال الوقوع سے ارادے کے تعلق کی نفی کی، تاکہ کامل العقل شخص اس سے یہ سمجھے کہ ارادے کا تعلق اس چیز سے نہیں ہوتا جس سے اس کا تعلق صحیح نہ ہو، اور یہ ضعیف العقل شخص اس سے یہ سمجھے کہ اگر اللہ \"لو\" (اگر) نہ کہتا تو وہ ایسا کر دیتا، پس وہ اس پر مطمئن ہو جائے اور اس کا دل نہ ٹوٹے، کیونکہ اس نے اقتدار الٰہی کے نفاذ کا ارادہ کیا اور خیر کا قصد کیا۔ اور کامل العقل کو معلوم ہو جائے کہ اللہ نے اسے اس پر کس طرح فضیلت دی ہے، پس وہ مزید شکر ادا کرے کہ اللہ نے اس کی عقل کو اس ناقص العقل جیسا نہیں بنایا، اور وہ جان لے کہ اللہ نے اسے ایک ایسے درجے پر فضیلت دی ہے جسے اس نے اپنی عقل کی اس کمی کی وجہ سے حاصل نہیں کیا۔ ایک جماعت نے کہا ہے کہ اللہ محال پر قادر ہے، لیکن جو بات کہنی چاہیے وہ یہ ہے کہ \"بے شک اللہ ہر چیز پر قادر ہے\" (سورۃ البقرۃ، ۲:۲۰) جیسا کہ اللہ نے فرمایا۔ اور قدرت اپنے محل کو طلب کرتی ہے جس سے وہ متعلق ہو، جیسا کہ ارادے کی نسبت اپنے محل کو طلب کرتی ہے جس سے وہ متعلق ہو، جیسا کہ علم اپنے محل کو طلب کرتا ہے جس سے وہ متعلق ہو، خواہ وہ نفی ہو یا اثبات، وجود ہو یا عدم۔ اور اسی طرح سمع (سننے) اور بصر (دیکھنے) کی نسبت اور ہر وہ چیز جسے الحق (ذات حق) نے اپنی ذات سے منسوب کیا ہے۔ پس وافر العقل (بڑی عقل والا) عالم ہر نسبت کے متعلق کو جانتا ہے اور اسے اس سے منسوب کرتا ہے۔ اور جو شخص امور کو اس طرح کی معرفت سے جانتا ہے، وہ اللہ کی اس ناراضگی (مقت) کے حکم کو جانتا ہے جو اس شخص پر ہوتی ہے جو وہ بات کہتا ہے جو وہ نہیں کرتا، بغیر اس کے کہ وہ اسے المشیئۃ الإلٰہیۃ (المشیئۃ الإلٰہیۃ) سے جوڑے۔ پس اگر وہ المشیئۃ الإلٰہیۃ (المشیئۃ الإلٰہیۃ) کو اپنے قول \"اگر وہ کرے\" سے معلق کرے اور وہ عمل واقع نہ ہو، تو اللہ اس پر ناراض نہیں ہوتا، کیونکہ وہ تمام اعمال میں الحق (ذات حق) کی انفرادیت سے غافل رہا جو مخلوق کے ہاتھوں پر تکوین (تخلیق) کے ذریعے ظاہر ہوتے ہیں، اور یہ کہ مخلوق کا ان میں تکوین کے لحاظ سے کوئی اثر (أثر) نہیں ہے، اگرچہ مخلوق کا ان میں حکم (حکم) ہے، نہ کہ اثر۔ لوگ اثر اور حکم میں فرق نہیں کرتے۔ جب اللہ کسی حرکت یا کسی معنی کو وجود میں لانا چاہتا ہے جو صرف مواد میں ہی صحیح طور پر موجود ہو سکتا ہے کیونکہ وہ خود قائم نہیں ہو سکتے، تو ضروری ہے کہ ایک ایسا محل (جگہ) موجود ہو جس میں اس چیز کی تکوین ظاہر ہو جو خود قائم نہیں ہے۔ پس اس ممکن کے وجود میں محل کا ایک حکم ہے، لیکن اس کا اس میں کوئی اثر نہیں ہے۔ یہ ہے اثر اور حکم کے درمیان فرق، اگر تم اسے سمجھ لو۔ تو بندہ کیوں کہتا ہے کہ ہم ایسا کریں گے یا ایسا فعل کریں گے، حالانکہ فعل میں اس کا سرے سے کوئی اثر نہیں ہوتا؟ پس اللہ اس پر ناراض ہوتا ہے۔ اور جب الحق (ذات حق) کو معلوم ہوا کہ یہ بات اس کے بندوں سے لازماً واقع ہو گی اور وہ ایسا کہیں گے، تو اس نے ان کے لیے استثناء الٰہی (ان شاء اللہ کہنا) مشروع کر دیا تاکہ ان سے مقت الٰہی (الٰہی ناراضگی) اٹھ جائے۔ اسی لیے جو شخص مستقبل کے فعل پر قسم کھا کر استثناء کرتا ہے تو وہ حانث نہیں ہوتا، کیونکہ اس نے اسے اپنی ذات کی بجائے اللہ سے منسوب کیا ہے۔ اور یہ افعال کو مخلوق سے منسوب کرنے کے منافی نہیں ہے، کیونکہ وہ افعال الٰہیہ کے ظہور کا محل ہیں۔ اور اسی قدر سے عقلمندوں کے درجات میں تفاوت ہے۔ کیا تم نہیں دیکھتے کہ الحق (ذات حق) نے کیسے فرمایا: \"اے ایمان والو!\" (سورۃ الصف، ۶۱:۲) اور یہ نہیں فرمایا: \"اے عقل والو!\" یا \"اے علم والو!\" \"تم وہ بات کیوں کہتے ہو جو تم نہیں کرتے؟\" (سورۃ الصف، ۶۱:۲) کیونکہ عاقل عالم استثناء کے بغیر وہ بات نہیں کہتا جو وہ نہیں کرتا، کیونکہ وہ جانتا ہے کہ فعل اللہ کے لیے ہے نہ کہ اس کے لیے۔ پس اللہ نے عالم کی طبقات میں فرق کیا تاکہ وہ جان لیں کہ اللہ تعالیٰ نے \"ان میں سے بعض کو بعض پر درجات میں بلند کیا ہے\" (سورۃ البقرۃ، ۲:۲۵۳)۔ پس عقلاء علماء ہی الحق (ذات حق) کے مقصود ہیں، ہر خطاب کے عموم کے ساتھ، کیونکہ وہ خطاب کے مواقع کو جانتے ہیں، پس وہ جانتے ہیں کہ اس خطاب سے عالم کی کس صنف کا ارادہ کیا گیا ہے۔ اسی لیے اس نے آیات کو مختلف اصناف کے لیے متنوع کیا: غور و فکر کرنے والوں کے لیے، عالموں کے لیے، عقلمندوں کے لیے، اور اولو الالباب (عقل والوں) کے لیے، جیسا کہ اللہ تعالیٰ نے قرآن عزیز میں فرمایا: \"یہ لوگوں کے لیے ایک بلاغ (پیغام) ہے\" (سورۃ إبراہیم، ۱۴:۵۲)۔ اس سے مراد ایک مخصوص گروہ ہے جو اس سے صرف بلاغ ہونا ہی سمجھتے ہیں۔ اور \"تاکہ وہ اس کے ذریعے ڈرائے جائیں\" (سورۃ إبراہیم، ۱۴:۵۲)۔ یہ ایک دوسرے گروہ کے حق میں ہے جسے اس خطاب سے متعین کیا گیا۔ اور \"تاکہ وہ جان لیں کہ وہ ایک ہی معبود ہے\" (سورۃ إبراہیم، ۱۴:۵۲)۔ یہ ایک اور گروہ کے حق میں ہے جسے اس خطاب سے متعین کیا گیا۔ اور \"تاکہ اولو الالباب (عقل والے) نصیحت حاصل کریں\" (سورۃ ص، ۳۸:۲۹)۔ یہ بھی ایک اور گروہ کے حق میں ہے۔ اور قرآن اپنی ذات میں ایک ہے، اس کی آیت صاحبِ عقل کے لیے تذکرہ بنتی ہے، اور طالب علم کے لیے اس کی توحید کے ذریعے توحید بنتی ہے، اور محتاط ڈرنے والے کے لیے انذار (ڈرانا) بنتی ہے، اور سننے والے کے لیے بلاغ بنتی ہے تاکہ اسے سننے کا اجر حاصل ہو، جیسے کوئی عجمی جو زبان نہیں سمجھتا، وہ سنتا ہے تو اللہ کے کلام کی تعظیم کرتا ہے اس نسبت سے کہ وہ اللہ کا کلام ہے، لیکن اس لفظ کا معنی نہیں جانتا جب تک کہ اسے اس کی زبان میں نہ سمجھایا جائے اور اس کا ترجمہ نہ کیا جائے۔ الٰہی خطابات میں سے بشارتیں بھی ہیں، اور وہ دو قسموں پر ہیں: ایسی بشارت جو ناگوار ہو، جیسے اس کا قول: \"پس انہیں دردناک عذاب کی بشارت دے دو\" (سورۃ آل عمران، ۳:۲۱)۔ اور ایسی بشارت جو خوشگوار ہو، جیسے اس کا قول: \"پس اسے مغفرت اور اجر کریم (عزت والے اجر) کی بشارت دے دو\" (سورۃ یٰس، ۳۶:۱۱)۔ ہر وہ خبر جس کا اثر انسان کی ظاہری جلد (بشرہ) پر ظاہر ہو، وہ بشری خبر ہے، اور یہ صرف دو طرح کے لوگوں میں ہو سکتا ہے: یا تو وہ شخص جس کی نفسانی قوت میں یہ ہو کہ اس کی جلد اس چیز سے نہ بدلے جس کا ہونا یقینی ہو چکا ہے، یا وہ شخص جو اس خبر دینے والے کی خبر کی تصدیق نہ کرے۔ اب یہ قوی النفس شخص اس سے خالی نہیں کہ آیا اس خبر کا اس کے باطن پر اثر ہوا یا نہیں؟ اگر اس خبر دینے والے کی خبر نے اس کے نفس پر اثر کیا ہے، تو وہ دو آدمیوں میں سے ایک ہے: یا تو وہ عالم ہے جو اس کے وقوع کا محقق ہے، یا وہ صرف جائز سمجھنے والا ہے۔ اور اگر اس کے نفس پر اثر نہیں ہوا، تو وہ نہ عالم ہے اور نہ ہی مصدق (تصدیق کرنے والا)۔ پس پہلے شخص کے حق میں وہ خبر بشریٰ (بشارت) ہو گی جس کا تعلق اس کی ذات میں متخیلہ صورت سے ہے جو اس خبر سے متاثر ہوئی ہے۔ اگر اس کے خیال میں وہ صورت نہ بنتی جو حسی صورت کے مشابہ ہے، تو وہ اس کے حق میں بشریٰ نہ ہوتی اور نہ ہی اس کے باطن میں خوشی یا غم کا اثر کرتی، اگرچہ وہ اس کے ظاہر پر ظاہر نہ ہو۔ اگر ارواح مواد سے مجرد ہو جائیں تو ان کے حق میں بشارتیں صحیح نہیں ہوں گی اور نہ ہی ان پر خوشی یا غم کا حکم لگے گا، بلکہ معاملہ ان کے لیے اثر کے بغیر محض علم (علم مجرد) ہو گا۔ کیونکہ روحانی لذت (الالتذاذ الروحانی) کا سبب صرف حس مشترک کا وہ احساس ہے جو مزاج کو موافقت یا عدم موافقت سے متاثر کرتا ہے، اور یہ قیاسات کے ذریعے ہوتا ہے۔ لیکن محض ارواح کے لیے نہ کوئی لذت ہے اور نہ کوئی درد۔ اور یہ کیفیت اس راہ کے بعض عارفین کو حاصل ہوتی ہے۔ ابو یزید (بسطامی) نے کہا: \"میں ایک زمانے تک ہنسا اور ایک زمانے تک رویا، اور آج میں نہ ہنستا ہوں اور نہ روتا ہوں۔\" اور یہ وہی بات ہے جو ہم نے کہی، کیونکہ وہ اپنی طبیعت پر نظر کیے بغیر اپنی محض روح کے ساتھ ٹھہر گیا، پس اس نے محض علم (علم محض) کے سوا کچھ نہیں دیکھا، جیسا کہ وہ الحق (ذات حق) کی توحید میں نظر کرنے سے بلند ہو جاتا ہے، توحید الألوہیۃ (توحید الألوہیۃ) سے اس کی ذات کی توحید کی طرف، اس حیثیت سے کہ وہ اپنی ذات کے لیے ہے، نہ کہ اس مرتبے کے لحاظ سے جس سے ممکن متعلق ہوتا ہے۔ پس وہ اس توحید میں اسے واحد (واحد) دیکھتا ہے، نہ کہ ایک (واحد) جو نسبتوں اور اضافات سے پاک ہے، ممکنات کے لیے مجہول ہے، اپنی ذات سے منسوب نہیں ہے کہ وہ اپنی ذات کے لیے اپنی ذات کو جاننے والا ہے۔ پس وہ اس توحید میں عین (عین) ہے، نہ اس حیثیت سے کہ وہ عین ہے، اور نہ اس حیثیت سے کہ وہ عین نہیں ہے۔ اور یہ کائنات کو اس سے تعلق سے مجرد کرنے میں اعلیٰ ترین مرتبہ ہے، اور یہ کمال الأحدیۃ (کمال الأحدیۃ) ہے، نہ کہ کمال الوحدانیۃ (کمال الوحدانیۃ)۔ کیونکہ کمال الوحدانیۃ (کمال الوحدانیۃ) عقائد میں اس کی أحدیۃ (أحدیۃ) کے سرایت کرنے میں ہے، کیونکہ الوحدانی (الوحدانی) وہ ہے جو موحدین کو طلب کرتا ہے، اور الأحدیۃ (الأحدیۃ) اسے طلب نہیں کرتی، جیسے جسمانی وہ ہے جو اجسام کو طلب کرتا ہے تاکہ اس کے ذریعے اس کا حکم ظاہر ہو۔ پس جان لو، جب تم کسی عارف کو دیکھو کہ اس پر لذت کے اسباب اور تکلیف کے اسباب آتے ہیں، اور وہ نہ لذت محسوس کرتا ہے اور نہ تکلیف، نہ محسوسات سے اور نہ ہی لذت بخش علوم کے حصول میں معقولات سے، تو جان لو کہ اس کا وقت اپنی طبیعت سے مکمل تجرد (التجرد التام) کا ہے۔ اور یہ سب سے قوی تشبہ ہے جس کے حصول کے لیے علماء باللہ کوشش کرتے ہیں، اور اسے پانے والا کم ہے، اور جو کم اسے پاتا ہے، وہ اس وجدان (وجدانی کیفیت) کو زیادہ دیر تک برقرار نہیں رکھ پاتا۔ اللہ اپنے بندوں میں سے جسے چاہتا ہے، اسے بعض خطرات (لمحات) میں اس سے عزت دیتا ہے تاکہ اسے اس التوحید الذاتی (التوحید الذاتی) سے آگاہ کرے جس کا ہم نے ذکر کیا۔ عقلمندوں کی ایک جماعت نے لذت اور خوشی کو اس جناب کی طرف منسوب کیا ہے، اس کمال کے ساتھ جو اس پر ہے، حالانکہ وہ اپنی ذات میں اس وصف سے الأحد (احد) ہے۔ لیکن الوحدانیۃ الإلٰہیۃ (الوحدانیۃ الإلٰہیۃ) ہی وہ ہے جس کی طرف یہ قول کہنے والے دیکھتے ہیں اور انہیں شعور نہیں ہوتا۔ اللہ تعالیٰ نے فرمایا: \"ہم انہیں آہستہ آہستہ پکڑیں گے جہاں سے وہ نہیں جانتے، اور میں انہیں مہلت دوں گا، بے شک میری تدبیر مضبوط ہے\" (سورۃ القلم، ۶۸:۴۴-۴۵)۔ پس جس نے الحق (ذات حق) کو اس کی ذات کے لحاظ سے دیکھا، اس نے ہماری بات کو پہچانا، اور جس نے اسے اس کی الوہیت کے لحاظ سے دیکھا، اس نے بھی ہماری بات کو پہچانا۔ کیا تم نہیں دیکھتے کہ وحی الٰہی نبوی کی ابتدا صرف مبشرات (خوشخبریوں) سے ہوئی؟ اور یہی وہ چیزیں ہیں جو نبوت کے منقطع ہونے کے بعد امت میں باقی رہیں۔ پس جسے اس امر کا علم نہیں ہے کہ یہ کس حال پر ہے، وہ یہ گمان کرتا ہے کہ یہ اس امت کے حق میں نقص ہے۔ معاملہ ایسا نہیں ہے جیسا کہ وحی کی تقسیم سے ناواقف شخص نے گمان کیا۔ کیونکہ وحی مبشرات وہ عام وحی ہے جو الحق (ذات حق) کی طرف سے بندے کو بلا واسطہ بھی ہوتی ہے اور واسطے کے ساتھ بھی ہوتی ہے۔ اور نبوت کا خاصہ واسطہ ہے اور یہ ضروری ہے، لہٰذا اس میں فرشتے کا ہونا ضروری ہے۔ اور مبشرات ایسی نہیں ہیں۔ پس عبد عارف کو اس بات کی پرواہ نہیں ہوتی کہ نبوت میں سے کیا فوت ہوا، جب کہ مبشرات اس پر باقی ہیں۔ البتہ لوگ ان میں ایک دوسرے سے افضل ہوتے ہیں۔ پس ان میں سے بعض وہ ہیں جو اپنی بشارت میں واسطے سے جدا نہیں ہوتے، اور بعض وہ ہیں جو اس سے بلند ہو جاتے ہیں، جیسے خضر اور افراد (الأفراد)۔ پس انہیں واسطوں کے اٹھ جانے کے ساتھ مبشرات حاصل ہوتی ہیں، لیکن انہیں نبوت حاصل نہیں ہوتی۔ اسی لیے ہم ان پر احکام (شرعی) کا انکار کرتے ہیں۔ پس جو حکم کائنات میں مبشرات سے ہو، وہ واسطے کے ساتھ بشریٰ میں سے ہے، اور یہ خاص لوگوں کو اس چیز کی تعریف ہے جو رسول لائے ہیں۔ اور جس کا کائنات میں کوئی حکم نہ ہو، مگر صرف اس کی ذات کی تکمیل میں محض علم (علم مجرد)، تو وہ واسطے کو ترک کرنے کے ساتھ بشریٰ میں سے ہے۔ پس رسولوں کو ان کے علاوہ دوسروں پر وحی کے مختلف مراتب، مبشرات اور دیگر چیزوں کے حصول سے فضیلت دی گئی ہے، جیسے فرشتوں کا ان کے دلوں اور ان کے حواس پر نازل ہونا۔ اور ان کے لیے مبشرات بھی ہیں۔ پس وہ افراد اقطاب (الأفراد الأقطاب) ہیں، اور ہم افراد (الأفراد) ہیں، اقطاب نہیں۔ اور اقطاب سے میری مراد وہ شخص ہے جس پر دنیا کے مصالح میں پھیلی ہوئی ناموسی سیاستوں کی چکی گھومتی ہے، جو معجزات اور آیات سے مؤید ہوتی ہیں۔ پس اللہ ہمیں ان لوگوں میں شامل کرے جنہیں اس نے بشارت دی، پس وہ ہمیشہ کے لیے سو گئے اور بیدار نہ ہوئے۔ سہل بن عبداللہ نے عبادان کے ایک شخص سے قلب کے سجدے کے بارے میں پوچھا، کیونکہ سہل بن عبداللہ نے اپنے قلب کو سجدہ کرتے ہوئے دیکھا تھا۔ انہوں نے یہ بات اپنے زمانے کے شیوخ کی ایک جماعت کے سامنے پیش کی، لیکن وہ نہیں جان پائے کہ وہ کیا کہہ رہے ہیں، کیونکہ انہوں نے اس کا ذوق نہیں چکھا تھا۔ پس وہ اس شخص کی تلاش میں سفر پر نکلے جو اسے جانتا ہو۔ جب وہ عبادان پہنچے تو ایک شیخ کے پاس گئے اور کہا: \"اے استاد! کیا قلب سجدہ کرتا ہے؟\" شیخ نے کہا: \"ہمیشہ کے لیے۔\" یعنی وہ اپنے سجدے سے سر نہیں اٹھاتا۔ پس سہل بن عبداللہ نے اپنے سوال میں جان لیا کہ اللہ نے انہیں ان کے قلب کے سجدے پر مطلع کیا ہے۔ پس انہوں نے اس صفت کو لازم کر لیا، پس انہوں نے اپنے سجدے سے سر نہیں اٹھایا، نہ دنیا میں اور نہ آخرت میں۔ اس کے بعد انہوں نے اللہ سے نہ کسی نازل شدہ چیز کو اٹھانے کی دعا کی اور نہ کسی اٹھائی ہوئی چیز کو نازل کرنے کی۔ اور یہ وہ المقام المجهول (المقام المجهول) ہے جسے عارفین نے نہیں جانا، اور اس پر صرف مفردون (المفردون) ہی ثابت قدم رہے۔ اگر انبیاء کے لیے یہ مشروع نہ ہوتا کہ وہ خاص و عام کے لیے شریعت وضع کریں، کیونکہ اللہ نے انہیں نمونہ بنایا ہے، تو ان کی حالت وہی ہوتی جو ہم نے بیان کی، لیکن ان پر صلوات اللہ ہو، انہوں نے تشریع (شریعت سازی) کے وقت قلب کے سجدے میں حاضری کو لازم رکھا۔ اور یہ انتہائی قوت ہے، کیونکہ انہیں حال مستصحب (دائمی حالت) کا حکم دیا گیا جو کبھی زائل نہیں ہوتا۔ غیر نبی جب اسے جانتا ہے تو اس میں تکلف کرتا ہے۔ ہم نے تمہیں کئی جگہوں پر آگاہ کیا ہے کہ اشیاء میں اوائل ہی اللہ کی طرف نسبت میں معتبر ہیں، اور وہ سچائی ہے جس میں جھوٹ شامل نہیں ہوتا، اور وہ قوت ہے جس میں ضعف کی آمیزش نہیں ہوتی۔ پہلے خیال میں، پہلی نظر میں، پہلے سننے میں، پہلے کلمے میں، اور پہلی حرکت میں۔ ہر اول صرف اللہ کے لیے مخلص ہوتا ہے، اس میں کوئی شراکت واقع نہیں ہوتی۔ پھر اول کے بعد جو کچھ داخل ہوتا ہے، وہ سچا بھی ہوتا ہے اور سچا نہیں بھی ہوتا۔ پس دیکھو کہ رسول اللہ صلی اللہ علیہ وسلم پر وحی کی ابتدا مبشرات سے ہوئی، پس انہوں نے اولی مبشرات کو حاصل کیا، اور وہ کوئی خواب نہیں دیکھتے تھے مگر وہ صبح کی روشنی کی طرح ظاہر ہو جاتا تھا، کیونکہ صبح کی روشنی رات سے پھٹ کر نکلی، جیسا کہ اس بشارت کا حامل نیند سے پھٹ کر نکلا۔ پس دیکھو کہ ہماری ماں عائشہ رضی اللہ عنہا نے کتنی خوبصورت تشبیہ دی ہے۔ پس اللہ نے اس امت کے مردوں پر وحی کا وہ اول حصہ باقی رکھا جو کبھی خطا نہیں کرتا۔ اگر تم اس قدر کو سمجھ گئے جو میں نے تمہیں بتایا اور جس پر تمہیں متنبہ کیا، تو تم نے اس امت کے بارے میں اللہ کی عنایت کو جان لیا جو اس نے نبوت میں سے اس پر باقی رکھی، اور یہ اس کا خالص جوہر ہے۔ اور اس منزل کے لیے یہ مقدار کافی ہے۔ اور یہ منزل مندرجہ ذیل علوم پر مشتمل ہے: علم التنزیہ (علم التنزیہ)، علم التوحید الإلٰہی (علم التوحید الإلٰہی)، علم تنزیہ العالم العلوی والسفلی (علم تنزیہ العالم العلوی والسفلی)، علم المشیتہ (علم المشیتہ) اور کلام، علم الأعمال (علم الأعمال) اور ان کی تفصیلات، علم المحبۃ الإلٰہیۃ (علم المحبۃ الإلٰہیۃ) ایک خاص پہلو سے، نہ کہ تمام پہلوؤں سے۔ اور خاص پہلو سے میری مراد توبہ کرنے والوں سے اس کی محبت، پاکیزگی اختیار کرنے والوں سے اس کی محبت، اور مومنوں سے اس کی محبت ہے۔ پس محبت کے پہلو ان طبقات کے غیر مساوی ہونے کی وجہ سے مساوی نہیں ہوتے، اور اگر ایسا نہ ہوتا تو ان کی تفصیل میں کیا فائدہ ہوتا؟ اور علم السبل الإلٰہیۃ (علم السبل الإلٰہیۃ)، علم مجاہدۃ النفوس (علم مجاہدۃ النفوس) اور ان کی ریاضتیں، علم الثبات عند الواردات (علم الثبات عند الواردات)، علم التأیید بالمناسب الجنسی (علم التأیید بالمناسب الجنسی)، علم العتاب (علم العتاب)، علم الجزاء فی الدنیا (علم الجزاء فی الدنیا)، علم العنایۃ (علم العنایۃ)، علم الخذلان (علم الخذلان)، علم معرفۃ مراتب الخلق (علم معرفۃ مراتب الخلق)، اور علم الحق (علم الحق) کو علم خیالی (علم خیالی) سے پہچاننا، علم التمام (علم التمام)، علم الأنوار (علم الأنوار)، اور شرک میں سے کیا مذموم ہے اور کیا محمود، علم الإیمان (علم الإیمان)، علم المغفرۃ (علم المغفرۃ)، علم المحبۃ المتعلقۃ بالأکوان (علم المحبۃ المتعلقۃ بالأکوان) اور اس میں سے محمود کا شرف، علم البشائر (علم البشائر)، علم الوصایا الإلٰہیۃ (علم الوصایا الإلٰہیۃ)، اور اہل اللہ کی تائید کا علم جب وہ اللہ کے ساتھ سچے ہوں۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے، اور تمام تعریفیں اللہ کے لیے ہیں جو رب العالمین ہے۔",
    "fa": "باب سیصد و بیست و سوم در معرفت منزل بشارت‌دهنده به بشارت‌شونده، و آن از حضرت محمدیه (الحضرة المحمدية) است.\n\nبشارت‌دهنده با رسالت آمد و *** پاداش آمدن را از کریم فرستنده می‌طلبید.\nپس ختم ولایت (ختم الولاية) آن را آورد، همان‌گونه که *** نبوت (النبوة) با پیامبر فرستاده شده ختم گردید.\nو ما از هر دو ختم بهره‌ای وافر داریم *** که میراثاً در کتاب نازل شده به ما رسید.\n\nمنظور [ابن عربی] این سخن [قرآن] است: «یَرِثُنِی ویَرِثُ من آلِ یَعْقُوبَ» (از من و از خاندان یعقوب ارث ببرد).\n\n### [اینکه مشیت الهی (المشيئة الإلهية) در فعل اثر دارد، از این رو تعلق آن را به آنچه از حیث مرجحش انفعال نمی‌پذیرد، نفی کرده است]\n\nبدان که چون مشیت الهی (المشيئة الإلهية) در فعل اثر دارد، از این رو تعلق آن را به آنچه از حیث مرجحش انفعال نمی‌پذیرد، نفی کرده است، نه از حیث خودش. برخلاف مشیت بنده؛ زیرا مشیت بنده هنگامی که واقع شود و به مشاء (آنچه مشیت به آن تعلق گرفته) تعلق یابد، ممکن است مشاء موجود شود و ممکن است موجود نشود. به همین دلیل، خداوند برای ما تشریع کرده است که هرگاه گفتیم فلان کار را انجام می‌دهیم، بگوییم «إن شاء الله» (اگر خدا بخواهد) تا اگر آن فعلی که به مشیت حق (الحق) معلق کرده‌ایم واقع شد، به حکم اصل، از مشیت حق باشد و مشیت ما در وجود آن اثری نداشته باشد. اما مشیت ما در آن حکمی دارد، و آن این است که حق سبحانه تکوین آن شیء را نخواسته است مگر با وجود مشیت ما؛ زیرا وجود مشیت ما از مشیت حق است. پس ناگزیر باید عین مشیت ما موجود باشد و به آن فعل تعلق یابد، و این همان سخن حق است: «وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله» (و شما نمی‌خواهید مگر اینکه خدا بخواهد). فایده خبر دادن خداوند متعال مبنی بر اینکه اگر می‌خواست فلان کار را انجام می‌داد، با وجود اینکه وقوع آن کار عقلاً محال است (زیرا مشیت الهی به آن تعلق نگرفته است)، این است که به ما اعلام کند آن امری که تعلق مشیت الهی به وجودش نفی شده است، به اعتبار خودش وقوعش محال نیست، بلکه ممکن است. زیرا لازم است که آن امر در ذات خود قابلیت پذیرش یکی از دو امر (وجود یا عدم) را داشته باشد و نیازمند مرجح باشد. برخلاف محال ذاتی؛ زیرا نفی تعلق مشیت به وجود آن محال است، چرا که آن شیء به خودی خود موجود نمی‌شود. برخی از مردم بر این باورند که اگر خداوند متعال اراده می‌کرد آنچه را که وجودش ذاتاً محال است، ایجاد کند، آن را ایجاد می‌کرد، و تنها به این دلیل ایجاد نکرده که وجود محال را اراده نکرده است. صاحب این قول می‌گوید: حق (الحق) به محال، محال بودنش را، به واجب، وجوبش را، و به ممکن، امکانش را عطا کرده است. این گوینده نمی‌داند چه می‌گوید؛ زیرا حق سبحانه واجب الوجود بالذات است، و لازم می‌آید که او خود به خود وجوب را عطا کرده باشد، و اگر می‌خواست، وجودش واجب نمی‌شد. پس وجود حق (الحق) مرجح خودش بوده است. این مانند سخن کسی است که می‌گوید: «خواست آن را معرب کند، اما آن را معجم ساخت.» زیرا او می‌خواست نفوذ اقتدار را به حق تعالی نسبت دهد، اما ندانست متعلق اقتدار چیست، پس آن را به چیزی که مقتضای آن نیست، معلق کرد و حق (الحق) را ناخواسته در زمره ممکنات قرار داد. بنابراین، فایده خبر دادن خداوند متعال با سخن «لو شاء» (اگر می‌خواست) در مورد آنچه واقع نمی‌شود، این است که اعلام کند آن امر به اعتبار ذاتش ممکن الوقوع است تا حق سبحانه میان آنچه در امکان است و آنچه ممکن نیست، برای ما فرق بگذارد. پس تعلق مشیت و اراده را به آن نفی کرده است. و هنگامی که آن را به محال، به جهت نفی تعلق، معلق می‌کند، مانند سخن او: «لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً» (اگر خدا می‌خواست فرزندی برگزیند) و «لَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا» (اگر می‌خواستیم سرگرمی برگزینیم، آن را از نزد خود برمی‌گزیدیم). این [اتخاذ ولد یا لهو] ذاتاً محال است، پس چگونه آن را تحت نفی تعلق اراده قرار داده است، در حالی که تحت نفی تعلق اراده جز ممکن داخل نمی‌شود؟ و این همان چیزی است که این شخص نادان به آن اشاره کرده و ما او را در سخنش به خطا دانستیم.\n\n### [اینکه خداوند متعال تعلق اراده را به محال الوقوع نفی کرده است]\n\nپس بدان که این [نفی تعلق اراده به محال] از نهایت کرم الهی است، زیرا در علم او سبقت گرفته است که چنین شخصی به دلیل فساد عقلی که در قسمت او مقدر شده، ایجاد شود. پس چون این را مقدر کرد، دانست که عقل او ناگزیر باید چنین چیزی را اعتقاد کند، و این نهایت جهل به حق (الحق) است. بنابراین، خداوند متعال به نفی تعلق اراده به محال الوقوع ذاتی خبر داد. پس کامل العقل از آن، نفی تعلق اراده به آنچه صحیح نیست به آن تعلق گیرد را می‌فهمد، و این ضعیف العقل از آن می‌فهمد که اگر حق سبحانه «لو» (اگر) نمی‌گفت، آن کار را انجام می‌داد، و به این [تفسیر] آسوده می‌شود.\nو قلبش نمی‌شکند، زیرا او نفوذ اقتدار الهی را اراده کرده و قصد خیری داشته است. و تا کامل العقل بداند که خداوند او را بر این [ضعیف العقل] به چه فضیلتی برتری داده است، و شکرش را افزون کند که خداوند عقل او را مانند این ناقص العقل قرار نداده است، و بداند که خداوند او را به درجه‌ای برتری داده که این [ناقص العقل] به دلیل کوتاهی عقلش به آن نرسیده است. گروهی گفته‌اند که خداوند بر محال نیز قادر است. اما آنچه شایسته است گفته شود این است که: «إِنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ» (همانا خداوند بر هر چیزی تواناست) همان‌گونه که خداوند فرموده است. و قدرت، محل تعلق خود را می‌طلبد، همان‌گونه که نسبت اراده، محل تعلق خود را می‌طلبد، و همان‌گونه که علم، محل تعلق خود را می‌طلبد، چه نفی باشد یا اثبات، وجود باشد یا عدم. و همچنین نسبت سمع و بصر و تمام آنچه حق (الحق) به خود نسبت داده است. پس عالمِ وافر العقل، متعلق هر نسبتی را می‌داند و آن را به آن نسبت می‌دهد. و کسی که امور را با چنین معرفتی (المعرفة) بشناسد، حکم مقت (خشم) خداوند را بر کسی که سخنی می‌گوید و عمل نمی‌کند، بدون اینکه مشیت الهی (المشيئة الإلهية) را به آن پیوند دهد، می‌داند. پس اگر مشیت الهی را به سخن خود معلق کند که عملی را انجام دهد و آن عمل واقع نشود، خداوند بر او خشم نمی‌گیرد. زیرا او از انفراد حق (الحق) در تمام اعمالی که به دست مخلوقات ظاهر می‌شود، از حیث تکوین، غافل شده است، و اینکه مخلوق در تکوین آن هیچ اثری ندارد، هرچند مخلوق در آن حکمی دارد نه اثر. مردم میان اثر و حکم فرق نمی‌گذارند. اگر خداوند اراده کند که حرکتی یا معنایی را از اموری که وجودشان جز در مواد صحیح نیست (زیرا به خودی خود قائم نیستند) ایجاد کند، ناگزیر باید محلی وجود داشته باشد که تکوین این امرِ قائم به غیر، در آن ظاهر شود. پس محل در ایجاد این ممکن، حکم دارد، اما اثری در آن ندارد. این است فرق میان اثر و حکم، اگر آن را دریابی. پس چرا بنده می‌گوید: «ما چنین می‌کنیم یا چنان انجام می‌دهیم» در حالی که او در فعل هیچ اثری ندارد؟ خداوند به همین دلیل بر او خشم می‌گیرد. و چون حق (الحق) دانست که این [سخن] ناگزیر از بندگانش واقع می‌شود و آنان چنین می‌گویند، استثنای الهی را برایشان تشریع کرد تا خشم الهی از آنان برداشته شود. به همین دلیل، کسی که استثنا کند، اگر بر فعل آینده‌ای سوگند یاد کند، حنث (شکستن سوگند) نمی‌کند، زیرا آن را به خداوند نسبت داده نه به خودش. و این با نسبت دادن افعال به مخلوقات منافات ندارد، زیرا آنان محل ظهور افعال الهی هستند. و به همین اندازه درجات عقلا متفاوت شده است. آیا نمی‌بینی حق تعالی چگونه فرمود: «يا أَيُّهَا الَّذِينَ آمَنُوا» (ای کسانی که ایمان آورده‌اید) و نفرمود: «یا أولی الألباب» (ای صاحبان خرد) و نه «یا أولی العلم» (ای صاحبان علم) «لِمَ تَقُولُونَ ما لا تَفْعَلُونَ» (چرا چیزی می‌گویید که انجام نمی‌دهید؟). زیرا عالمِ عاقل، چیزی را که انجام نمی‌دهد، نمی‌گوید مگر با استثناء، چون می‌داند که فعل از آنِ خداست نه از آنِ او. پس خداوند میان طبقات عالم فرق گذاشت تا بدانند که خداوند متعال «رَفَعَ بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجاتٍ» (برخی از آنان را بر برخی دیگر به درجاتی برتری داده است). پس عقلا و علما کسانی هستند که حق (الحق) در عموم هر خطاب، آنان را از میان عالَم قصد کرده است، زیرا به مواضع خطاب آگاهند و می‌دانند که حق با آن خطاب کدام صنف از عالَم را اراده کرده است. به همین دلیل، اصناف را با تنوع آیات برای متفکران، عالمان، عقلا و صاحبان خرد (أولي الألباب) متنوع ساخت. چنانکه در قرآن عزیز فرمود: «إِنَّهُ بَلاغٌ لِلنَّاسِ» (همانا این ابلاغی برای مردم است) که منظور او گروه خاصی است که از آن جز ابلاغ نمی‌فهمند، و «لِيُنْذَرُوا به» (تا به وسیله آن بیم داده شوند) در حق گروه دیگری که با این خطاب مشخص شده‌اند، و «لِيَعْلَمُوا أَنَّما هُوَ إِلهٌ واحِدٌ» (تا بدانند که او تنها یک معبود است) در حق گروه دیگری که با این خطاب مشخص شده‌اند، و «لِيَذَّكَّرَ أُولُوا الْأَلْبابِ» (و تا صاحبان خرد پند گیرند) در حق گروه دیگری نیز. و قرآن در ذات خود یکی است، اما آیه‌ای از آن برای صاحب خرد تذکره است، و برای طالب علم توحید، توحید است، و برای مترقبِ محتاط، انذار است، و برای شنونده، ابلاغ است تا پاداش شنیدن را کسب کند، مانند عجم (غیر عرب) که زبان را نمی‌فهمد، اما می‌شنود و کلام خدا را از حیث انتسابش به خدا بزرگ می‌شمارد، ولی معنای آن لفظ را نمی‌داند تا اینکه به زبان خودش برایش شرح داده شود و ترجمه گردد. از جمله خطاب‌های الهی، بشارت‌ها هستند که بر دو قسم‌اند: بشارت به آنچه ناگوار است، مانند سخن او: «فَبَشِّرْهُمْ بِعَذابٍ أَلِيمٍ» (پس آنان را به عذابی دردناک بشارت ده) و بشارت به آنچه خوشایند است، مانند سخن حق تعالی: «فَبَشِّرْهُ بِمَغْفِرَةٍ وأَجْرٍ كَرِيمٍ» (پس او را به مغفرت و پاداشی کریمانه بشارت ده). پس هر خبری که ورودش در ظاهر پوست (بشره) انسان اثر بگذارد، خبر بشری است. و این جز در دو نوع شخص رخ نمی‌دهد: یا در شخصی که نیروی نفسانی‌اش چنان است که پوستش با تحقق آن خبر تغییر نمی‌کند، یا شخصی که آن خبر را از آن خبردهنده تصدیق نمی‌کند. این شخص قوی النفس از این حالت خالی نیست که آیا آن خبر در باطن او اثر گذاشته یا نه؟ اگر خبر این خبردهنده در نفس او اثر گذاشته باشد، او یکی از دو نفر است: یا عالمی است که به وقوع آن یقین دارد، یا کسی است که آن را جایز می‌داند. و اگر در نفس او اثر نگذاشته باشد، او نه عالم است و نه تصدیق‌کننده. پس آن خبر در حق شخص اول، بشارتی است که متعلق آن، صورت متخیله در نفس اوست که از این خبر متأثر شده است. اگر آن صورتِ مشابه با صورت حسی در خیال او نقش نمی‌بست، در حق او بشارت نبود و در باطن او شادی یا اندوهی ایجاد نمی‌کرد، حتی اگر در ظاهرش آشکار نمی‌شد. پس اگر ارواح از مواد مجرد می‌شدند، بشارت‌ها در حق آن‌ها صحیح نبود.\n\nو شادی و اندوه بر آن‌ها حکم نمی‌راند، بلکه امر برای آن‌ها علم مجردی بدون اثر می‌بود. زیرا التذاذ روحانی تنها به سبب احساس حس مشترک است که مزاج از سازگاری و ناسازگاری و قیاسات متأثر می‌شود. اما ارواح به تنهایی نه لذتی دارند و نه المی. و این حالت برای برخی از عارفان (العارفين) در این طریق حاصل می‌شود. ابویزید گفت: «زمانی خندیدم و زمانی گریستم، و امروز نه می‌خندم و نه می‌گریم.» و این عین همان چیزی است که ما گفتیم؛ زیرا او با روح مجرد خود ایستاد، بدون توجه به طبیعتش، و جز علم محض مشاهده نکرد. همان‌گونه که [عارف] از نظر در توحید حق (الحق) از حیث توحید الوهیت، به توحید ذات او از حیث اینکه او برای خودش است، ارتقا می‌یابد، نه از حیث مرتبه‌ای که ممکن به آن تعلق می‌یابد. پس او را در آن توحید، واحدی می‌بیند که واحد نیست، عاری از نسبت‌ها و اضافات، مجهول برای ممکنات، و به خودش نسبت داده نمی‌شود که عالم به نفس خود برای نفس خود است. پس او در آن توحید، عین اوست، نه از حیث اینکه عین اوست و نه از حیث اینکه عین او نیست. و این والاترین مراتب در تجرید کَون از تعلق به اوست، و آن کمال احدیت (الأحدية) است نه کمال وحدانیت (الوحدانية). زیرا کمال وحدانیت در سریان احدیت او در عقاید است، چرا که وحدانی کسی است که موحدین را می‌طلبد، در حالی که احدیت چنین طلبی ندارد، مانند جسمانی که اجسام را می‌طلبد تا حکم خود را به وسیله آن‌ها ظاهر سازد. پس بدان، اگر عارفی را دیدی که اسباب التذاذ و اسباب تألم بر او وارد می‌شود، اما نه به محسوس لذت می‌برد و نه به معقول در کسب علوم لذت‌بخش متألم می‌شود، بدان که وقت او، تجرد تام از طبیعتش است. و این قوی‌ترین تشبهی است که عالمان به حق (الحق) در پی آن هستند، و یابنده آن کم است، و آن کمی که آن را می‌یابد، استصحاب این وجدان برایش کم است. و خداوند تنها به هر کس از بندگانش که بخواهد، در لحظاتی کرامت می‌کند تا او را به توحید ذاتی که ذکر کردیم، آگاه سازد. گروهی از عقلا، التذاذ و ابتهاج را به آن جناب [حق] نسبت داده‌اند، با کمالی که او بر آن است، در حالی که احد (الأحد) در ذات خود از این وصف منزه است. اما وحدانیت الهی (الوحدانية الإلهية) است که گویندگان این قول به آن می‌نگرند و خود نمی‌دانند. حق تعالی فرمود: «سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ وأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ» (به تدریج آنان را از جایی که نمی‌دانند به سوی عذاب می‌کشانیم و به آنان مهلت می‌دهم، همانا مکر من استوار است). پس هر کس حق (الحق) را از حیث ذاتش بنگرد، آنچه گفتیم را می‌شناسد، و هر کس او را از حیث الوهیتش بنگرد، آنچه گفتیم را می‌شناسد. آیا به مبادی وحی الهی نبوی نمی‌نگری که همانا مبشرات (المبشرات) هستند؟ و این‌ها همان‌هایی هستند که پس از انقطاع نبوت در امت باقی ماندند. پس کسی که به امر آن‌گونه که هست علم ندارد، گمان می‌کند که این نقصانی در حق این امت است. امر آن‌گونه نیست که کسی که به تقسیم وحی علم ندارد، گمان کرده است. زیرا وحی مبشرات، وحی عام‌تری است که از حق (الحق) به بنده بدون واسطه می‌رسد و همچنین با واسطه نیز می‌رسد. و نبوت شأنش واسطه است و ناگزیر باید ملک (فرشته) در آن باشد، اما مبشرات چنین نیستند. پس بنده عارف (العارف) با بقای مبشرات بر او، اهمیتی نمی‌دهد که نبوت از او فوت شده است، جز اینکه مردم در آن با هم تفاوت دارند. برخی از آنان در بشارت خود از واسطه جدا نمی‌شوند، و برخی از آن فراتر می‌روند، مانند خضر و افراد (الأفراد). پس آنان مبشرات را با رفع واسطه‌ها دارند، اما نبوت را ندارند. به همین دلیل، ما احکام را بر آنان انکار می‌کنیم. پس آنچه از حکم در کَون از مبشرات باشد، از بشارت با واسطه است، و آن تعریف خاصی است به آنچه رسول آورده است. و آنچه حکم کَون ندارد، جز علم مجرد در تکمیل ذاتش، از بشارت با ترک واسطه است. پس رسولان بر دیگران برتری داده شده‌اند به سبب تحصیل انواع مراتب وحی، از مبشرات و غیر آن، از نزول فرشتگان بر قلب‌ها و حواسشان. و آنان مبشرات را دارند، پس آنان افراد اقطاب (الأفراد الأقطاب) هستند، و ما افراد هستیم نه اقطاب. و منظورم از اقطاب، شخصی است که آسیاب سیاست‌های ناموسی که در مصالح عالم پراکنده شده و با معجزات و آیات تأیید گشته، بر محور او می‌چرخد. پس خداوند ما را از کسانی قرار دهد که به او بشارت داده شده و تا ابد خوابیده و بیدار نشده است. سهل بن عبدالله از مردی از اهالی عبادان درباره سجده قلب پرسید. سهل بن عبدالله قلب خود را دیده بود که سجده کرده است، پس آن را بر گروهی از شیوخ زمان خود عرضه کرد، اما آنان نمی‌دانستند او چه می‌گوید، زیرا آن را نچشیده بودند. پس برای یافتن کسی که آن را می‌شناسد، سفر کرد. هنگامی که به عبادان رسید، نزد شیخی رفت و به او گفت: «ای استاد، آیا قلب سجده می‌کند؟» شیخ گفت: «تا ابد.» یعنی سرش را از سجده‌اش برنمی‌دارد. پس سهل بن عبدالله از سؤالش دریافت که خداوند او را بر سجده قلبش مطلع ساخته است. پس ملازم آن صفت شد و سرش را از سجده‌اش برنداشت، نه در دنیا و نه در آخرت برمی‌دارد. پس از آن، دیگر برای رفع چیزی که نازل شده یا برای نزول چیزی که بالا رفته، دعا نکرد. و این همان مقام مجهولی است که عارفان (العارفون) از آن بی‌خبرند و جز مفردون (یگانگان) در آن ثابت نمانده‌اند. و اگر برای انبیا تشریع نشده بود که برای خاص و عام شریعت بیاورند، زیرا خداوند آنان را اسوه قرار داده است، حالتشان همان می‌بود که ذکر کردیم. اما صلوات خدا بر آنان باد، هنگام تشریع، حضور در سجده قلب را لازم داشتند. و این نهایت قوت است، زیرا حکم حال مستصحب (حالت همراه دائمی) را به آنان عطا کردند که هرگز برداشته نمی‌شود. اما غیر پیامبر اگر آن را بداند، در آن تکلف می‌کند. و ما در مواضع متعددی به تو اعلام کرده‌ایم که اوائل در اشیا، در نسبت به خداوند معتبرند، و آن‌ها صدقی هستند که دروغ در آن راه ندارد، و قوتی هستند که ضعف در آن آمیخته نیست؛ در خاطر اول، و نظر اول، و شنیدن اول، و کلمه اول، و حرکت اول. هر اولی جز مخلص برای خدا نیست و اشتراکی در آن واقع نمی‌شود. سپس بعد از اول، آنچه وارد می‌شود، وارد می‌شود، پس تصدیق می‌شود و تصدیق نمی‌شود. پس بنگر که آغاز وحی رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) با مبشرات (المبشرات) بود. پس مبشرات اولیه را حائز شد، و هیچ رؤیایی نمی‌دید مگر اینکه مانند فلق صبح آشکار می‌شد. زیرا فلق صبح از شب شکافته شد، همان‌گونه که صاحب این بشارت از خواب شکافته شد. پس بنگر که چه نیکوست این تشبیهی که مادر ما عایشه رضی الله عنها با آن تشبیه کرده است. پس خداوند بر مردان این امت، اولِ وحی را باقی گذاشت.\nکه هرگز خطا نمی‌کند. اگر قدر آنچه را برایت ذکر کردم و تو را بر آن آگاه ساختم، بفهمی، عنایت خداوند به این امت را در آنچه از نبوت بر آنان باقی گذاشته است، خواهی دانست، و آن زبده خالص نبوت است. و همین مقدار از این منزل کافی است. این منزل از علوم، شامل علم تنزیه، علم توحید الهی، علم تنزیه عالم علوی و سفلی، علم مشیت (المشيئة) و کلام، علم اعمال و جزئیات آن‌ها، علم محبت الهی از وجهی خاص نه از تمام وجوه (و منظورم از وجه خاص، محبت او به توبه‌کنندگان، محبت او به پاکیزگان، و محبت او به مؤمنان است. پس وجوه محبت برابر نیستند به دلیل نابرابری این طبقات، و اگر چنین نبود، تفصیل در آن‌ها چه فایده‌ای داشت؟)، و علم راه‌های الهی، علم مجاهده نفوس و ریاضت‌های آن‌ها، علم ثبات هنگام واردات، علم تأیید به مناسب جنسی، علم عتاب، علم جزا در دنیا، علم عنایت، علم خذلان، علم معرفت مراتب خلق، و علم حق (الحق) از علم خیالی، علم تمام، علم انوار، و آنچه از شرک مذموم است و آنچه ممدوح، علم ایمان، علم مغفرت، علم محبت متعلق به اکوان و شرافت ممدوح آن، علم بشارت‌ها، علم وصایای الهی، و علم تأیید اهل الله هنگامی که با خدا صادق باشند. و «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند، و ستایش مخصوص خداوند پروردگار جهانیان است)."
  },
  "page_count": 4
}