{
  "id": 119,
  "title": {
    "ar": "الباب التاسع عشر ومائة في ترك التوكل",
    "en": "Chapter 119: Concerning the Renunciation of Reliance (التوكل)",
    "ur": "باب ایک سو انیس: توکل کو ترک کرنے کے بیان میں",
    "fa": "باب صد و نوزدهم در ترک توکل"
  },
  "content": {
    "ar": "## (الباب التاسع عشر ومائة في ترك التوكل)\n\n\n> أنت الخليفة فيما أنت مالكه *** والحق ليس به نفع ولا ضرر\n\n\n> ترك التوكل حال ليس يعلمه *** غير الوكيل فلا روح ولا بشر\n\n\n> كيف التوكل والأعيان ليس سوى *** عين الموكل لا عين ولا أثر\n\n\n### [التوكل المشروع والتوكل الحقيقي‏]\n\n\nالتوكل مشروع فينال الحد المشروع منه والتوكل الحقيقي غير واقع من الكون في حال وجوده فما هو إلا للمعدوم في حال عدمه وما ثم مقام يتصف به المعدوم ولا يصح في الموجود من جهة الحقيقة إلا التوكل فلا يزال المعدوم موصوفا بالتوكل حتى يوجد فإذا وجد خرج عنه التوكل فذلك المعبر عنه بترك التوكل‏\n\n\n### [التوكل المعروف عند العامة من أهل الله لا يصح تركه إلا لرجلين‏]\n\n\nثم أقول لا يصح ترك التوكل المعروف عند العامة من أهل الله إلا لرجلين الواحد علم أنه لا يصح فترك الشروع فيه لأنه عنده لا يمكن تحصيله لما رأى نفسه إذا أخذه ألم الجوع وعنده ما يدفعه به تناوله ليزيل ألم الجوع فلا فرق بينه وبين من يسترقي ويتطبب ويلجأ إلى محل الأمن من الأمور المخوفة مع الصحو وتوفر العقل والعلم التام فالتوكل من حيث ما هو مقام هو حاصل ومن حيث حاله ليس بحاصل فالتوكل يصح لا يصح وأما الرجل الآخر قال إن الله أعلم بمصالح الخلق وقد أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ ففيم التوكل مع هذا الفراغ فترك التوكل فإنه ما بقي له ما يعتمد على الله فيه لأنه قال فرغ ربك ومع هذا فهو واقف مع الأمر والنهي عامل بما أمر به أو نهى عنه من الأعمال قائم بالحكم المشروع عليه‏\n\n\n### [من أسرار التوكل ترك التوكل‏]\n\n\nفمن أسرار التوكل ترك التوكل فإن ترك التوكل يبقي الأغيار والتوكل ينفي الأغيار وعند أكثر القوم أن الأعلى ما ينفي لا ما يبقى وعندنا وعند شيخنا أبي السعود بن الشبلي وأبي عبد الله الهواري بتنس من بلاد المغرب وأبي عبد الله الغزال بالمرية ببلاد الأندلس وأبي عمران موسى بن عمران الميرتلي بإشبيلية وغيرهم إن الأعلى ما يفنى ما ينبغي ويبقى ما ينبغي في الحال التي تنبغي والوقت الذي ينبغي وبه كان يقول عبد القادر الجيلي ببغداد فإن الله تعالى أفنى وأبقى يقول تعالى ما عِنْدَكُمْ يَنْفَدُ فلا تعتمد عليه وما عِنْدَ الله باقٍ فتعتمد على الله في بقائه فأفنى وأبقى والإفناء حال أبي مدين في وقت إمامته ولا أدري هل انتقل عنه بعد ذلك أم لا لأنه انتقل عن الإمامة قبل أن يموت بساعة أو ساعتين الشك مني لبعد الوقت‏\n\n\n### [صاحب ترك التوكل ما له دعوى لأنه أمر عدمى‏]\n\n\nوصاحب ترك التوكل ما له دعوى وهو غير مسئول لأنه أمر عدمي فجرى مجرى الأصل في قوله تعالى هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ من الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً يريد عدمه في عينه لأنه كان مذكورا لله تعالى والدهر اسم من أسماء الله ولهذا الاشتراك اللفظي نهي عن سب الدهر وقال إن الله هو الدهر\n\n\nوما ثم عين تسب لعينها وإنما تسب لما يصدر منها وما يصدر كون إلا من الله والدهر الزماني نسبة وقوله لَمْ يَكُنْ شَيْئاً مَذْكُوراً يعني الإنسان في ذلك الحين أي موجودا في عينه مع وجود الأعيان ولكن ما تعرفه حتى تذكره ولا هي ذات فكر حتى تجمعه في ذهنها تقديرا فتذكره فإن الفكر من القوي التي اختص بها الإنسان لا توجد في غيره‏\n\n\n### [تأخير نشأة الإنسان ووجود عينه‏]\n\n\nثم إن هذه الآية من أصعب ما نزل في القرآن في حق نقصان الإنسان وفيما يظهر من عدم الاعتناء الإلهي به وعندنا ما أخر الله نشأته ووجود عينه إلا اعتناء الله به لأنه لو أوجده الله أول الأشياء كان يمر عليه وقت لا يكون فيه خليفة فإنه ما ثم من قد هياه لمرتبة الخلافة والنيابة عنه فلا بد أن يتأخر وجود عينه عن وجود الأعيان حتى لا يزول عنه اسم الخلافة دنيا ولا آخرة فما وجد إلا ملكيا سيدا كما أنه مع غيره لله عبد مملوك ففضل العالم كله بالخلافة فلم تكن لغير الإنسان وهذه المرتبة أوجبت له أن يخلق على الصورة\n\n\n### [العالون عن العالم العنصري أعلى نشأة والإنسان أجمع نشأة]\n\n\nومن قال إن هذه الآية تدل على عدم الاعتناء الإلهي بالإنسان لأن الله متكلم أزلا عالم بما يكون أزلا ونفى أن يكون الإنسان شيئا مذكورا مع أنه شي‏ء ولا بد لقوله إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ فما يؤمر إلا من يسمع بسمع ثبوتي أو وجودي ونفى أن يكون الإنسان مذكورا في حين من الدهر والدهر هنا الزمان والحين جزء منه لم يكن فيه الإنسان مذكورا مع وجوده صورة إنسان وجهل من‏\nشاهد صورته مراد الله فيه وما علم له اسم رتبة يذكر به ولا ما له عند الله من العناية به التي ظهر أثرها عليه حين أقامه خليفة في أرضه وما غربه عن موطنه وهو التراب الذي خلق منه وموطن ذلته لشهود عبوديته فإن الأرض ذلول فما حجبته الخلافة عن عبودته وإن كانت أعلى المراتب فهو فيها بالذات والملائكة المقربون فيها بالعرض يقول تعالى لَنْ يَسْتَنْكِفَ الْمَسِيحُ لكونه يحيي الموتى ويخلق ويبرئ أَنْ يَكُونَ عَبْداً لِلَّهِ ثم عطف فقال ولا الْمَلائِكَةُ الْمُقَرَّبُونَ وهم العالون عن العالم العنصري المولد فهم أعلى نشأة والإنسان أجمع نشأة فإن فيه الملك وغيره فله فضيلة الجمع ولهذه جعله معلم الملائكة وأسجدهم له فمساق الآية يوزن بتقرير النعم عليه وإنما وقعت الصعوبة في هذا الذكر كونه نكرة والنكرة تعم في مساق النفي فالتنكير يوزن بتعميم نفي الذكر عنه من كل ذاكر وهو دليل على إن الله ما ذكره لمن أوجد قبله من الأعيان وإن كان مذكورا له في نفسه ثم ذكره لملائكته بمرتبته التي خلق لها لا باسمه العلم الذي هو آدم فاعلم‏\n\n",
    "en": "## Chapter 119: On Abandoning Reliance [Tark al-Tawakkul]\n\nYou are the Vicegerent [al-Khalifa] in that which you possess,\nAnd The Real [al-Haqq] has neither benefit nor harm in it.\n\nAbandoning Reliance [Tark al-Tawakkul] is a state known\nOnly by the Agent [al-Wakil], neither spirit nor human.\n\nHow can there be Reliance [Tawakkul] when the essences [al-A'yan] are nothing but\nThe very Essence [‘ayn] of the One Relied Upon, neither essence nor trace?\n\n### [The Prescribed Reliance and the Real Reliance]\n\nReliance [Tawakkul] is prescribed, so one attains the prescribed limit of it. Real Reliance does not occur from the Cosmos [al-Kawn] in its state of existence. It belongs only to the non-existent [al-ma'dum] in its state of non-existence. There is no station [maqam] by which the non-existent is described, and nothing is valid for the existent [al-mawjud] from the perspective of Reality except Reliance. The non-existent remains described by Reliance until it comes into existence. When it exists, Reliance departs from it. That is what is expressed as Abandoning Reliance [Tark al-Tawakkul].\n\n### [The Reliance Known Among the Common People of God is Only Validly Abandoned by Two Types of Men]\n\nThen I say that the abandonment of the Reliance known among the common people of God is only valid for two men. The first knew that it was not valid, so he abandoned starting it, because, in his view, it cannot be achieved. When he saw himself afflicted by the pain of hunger, and he had what he could use to repel it, he took it to remove the pain of hunger. There is no difference between him and one who seeks healing through incantation, or seeks medical treatment, or resorts to a place of safety from frightening matters, while being fully sober, possessing complete intellect and perfect knowledge. Thus, Reliance, insofar as it is a station, is attained, but insofar as it is a state [hal], it is not attained. So, Reliance is valid, yet invalid.\n\nAs for the other man, he said that Allah knows best the welfare of creation, and He has given everything its creation [khilqa] <<أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ>>. So, why Reliance, given this completion? Thus, he abandoned Reliance. For nothing remained for him upon which to rely on God, because he said, \"Your Lord has completed [the matter].\" Despite this, he stands firm with the Command and Prohibition, acting upon what he is commanded or forbidden to do, upholding the prescribed ruling upon him.\n\n### [Among the Secrets of Reliance is Abandoning Reliance]\n\nAmong the secrets of Reliance [Tawakkul] is Abandoning Reliance [Tark al-Tawakkul]. For Abandoning Reliance preserves the 'others' [al-aghyar], while Reliance negates the 'others.' Most of the folk hold that the higher state is that which negates, not that which preserves. But according to us, and according to our Shaykh Abu al-Su'ud ibn al-Shibli, and Abu Abd Allah al-Hawwari in Tanas in the lands of the Maghrib, and Abu Abd Allah al-Ghazzal in Almería in the lands of al-Andalus, and Abu Imran Musa ibn Imran al-Mirtili in Seville, and others, the higher state is that which annihilates [yufni] what ought to be annihilated and preserves [yubqi] what ought to be preserved, in the state that is appropriate and at the time that is appropriate. This was also the view of Abd al-Qadir al-Jili in Baghdad.\n\nFor Allah the Exalted annihilates [afna] and preserves [abqa]. He says, the Exalted: <<مَا عِنْدَكُمْ يَنْفَدُ>> (What is with you vanishes), so do not rely upon it, and <<وَمَا عِنْدَ الله بَاقٍ>> (and what is with Allah remains), so rely upon Allah in its subsistence. Thus, He annihilates and preserves. Annihilation [al-Ifna'] was the state of Abu Madyan during the time of his imamate. I do not know whether he moved beyond it afterward or not, because he stepped down from the imamate an hour or two before he died—the doubt is mine due to the passage of time.\n\n### [The Practitioner of Abandoning Reliance Has No Claim, Because It Is a Non-Existent Matter]\n\nThe practitioner of Abandoning Reliance [Tark al-Tawakkul] has no claim [da'wa] and is not held accountable, because it is a non-existent matter [amr 'adami]. Thus, it follows the course of the Origin, as in His saying, the Exalted: <<هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً>> (Has there not come upon man a period of time when he was not a thing mentioned?). He means his non-existence in his specific entity, because he was mentioned to Allah the Exalted. *Al-Dahr* (Time/Eternity) is one of the Names of Allah, and due to this linguistic overlap, the cursing of *Dahr* was forbidden, and He said, \"Indeed, Allah is *Dahr*.\"\n\nNo entity is cursed for its own sake; rather, it is cursed for what issues from it. And nothing of the Cosmos [kawn] issues forth except from Allah. The temporal *Dahr* is merely a relation. His saying <<لَمْ يَكُنْ شَيْئاً مَذْكُوراً>> (he was not a thing mentioned) means that man, at that time, was not existent in his specific entity, even though the [Fixed] Entities [al-A'yan] existed. However, they did not know him so as to mention him, nor did they possess thought [fikr] so as to gather him in their minds by estimation and thus mention him, for thought is among the faculties specific to man and is not found in others.\n\n### [The Delay in the Genesis of Man and the Existence of His Specific Entity]\n\nFurthermore, this verse is among the most difficult revealed in the Quran concerning the deficiency of man and the apparent lack of Divine solicitude toward him. But according to us, Allah did not delay his genesis [nash'a] and the existence of his specific entity except out of Divine solicitude for him. For had Allah brought him into existence as the first of all things, a time would have passed during which he would not have been the Vicegerent [Khalifa]. There was nothing else prepared for the rank of Vicegerency [al-Khilafa] and deputyship for Him. Therefore, the existence of his specific entity had to be delayed after the existence of the [Fixed] Entities [al-A'yan] so that the name of Vicegerency would never depart from him, neither in this world nor the Hereafter. Thus, he was only brought into existence as a sovereign king, just as, relative to others, he is a slave owned by Allah. He was favored above the entire Cosmos [al-'Alam] by the Vicegerency, which belonged to no one but man. This rank necessitated that he be created upon the Form [al-Sura].\n\n### [The Exalted Ones Above the Elemental World Possess a Higher Genesis, But Man Possesses a More Comprehensive Genesis]\n\nAs for those who say that this verse indicates a lack of Divine solicitude toward man, arguing that Allah speaks eternally and knows what will be eternally, and yet He negated man being a thing mentioned, even though he must be a thing, based on His saying: <<إِنَّما قَوْلُنا لِشَيْءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Indeed, Our word to a thing, when We intend it, is only that We say to it, \"Be,\" and it is)—for only that which hears is commanded, whether by an essential hearing or an existential hearing—He negated man being mentioned during a period of *Dahr*. *Dahr* here is Time, and the period [hin] is a part of it, during which man was not mentioned, despite his existence as a human form. Ignorant is he who witnessed his form but did not know Allah's intention concerning him, nor did he know the name of the rank by which he should be mentioned, nor the Divine solicitude he holds with Allah, the effect of which appeared upon him when He established him as Vicegerent upon His earth. And He did not estrange him from his origin, which is the dust from which he was created, the locus of his humility for the witnessing of his servitude [‘ubudiyya]. For the earth is submissive. Thus, the Vicegerency did not veil him from his servitude, even though it is the highest of ranks. He holds this rank essentially [bi’l-dhat], while the Archangels [al-Mala'ika al-Muqarrabun] hold it accidentally [bi’l-‘arad]. The Exalted says: <<لَنْ يَسْتَنْكِفَ الْمَسِيحُ>> (The Messiah will never disdain), despite his ability to revive the dead, create, and heal, <<أَنْ يَكُونَ عَبْداً لِلَّهِ>> (to be a servant of Allah). Then He coupled this, saying: <<وَلَا الْمَلائِكَةُ الْمُقَرَّبُونَ>> (nor the Archangels). They are the exalted ones, above the elemental world of generation, and thus they possess a higher genesis [nash'a]. But man possesses a more comprehensive genesis [ajma' nash'a], for he contains the angel and the non-angel. Therefore, he has the virtue of comprehensiveness [al-jam']. For this reason, He made him the teacher of the angels and commanded them to prostrate to him. The context of the verse is weighed by the confirmation of favors upon him. The difficulty in this mention arose only because it is indefinite [nakira], and the indefinite term implies generality in the context of negation. Thus, the indefiniteness is weighed by the generalization of the negation of mention concerning him from every mentioner. This is proof that Allah did not mention him to the [Fixed] Entities [al-A'yan] that He brought into existence before him, even though he was mentioned to Allah Himself. Then He mentioned him to His angels by the rank for which he was created, not by his proper name, which is Adam. Know this.",
    "ur": "(باب ایک سو انیسواں توکل کو ترک کرنے کے بارے میں)\n\nتو ہی خلیفہ ہے اس میں جس کا تو مالک ہے\nاور الحق (ذات حق) سے نہ کوئی نفع ہے نہ کوئی ضرر\n\nتوکل کو ترک کرنا ایک ایسا حال ہے جسے\nوکیل (اللہ) کے سوا کوئی نہیں جانتا، نہ کوئی روح نہ کوئی بشر\n\nتوکل کیسا؟ جبکہ الأعیان (اعیان ثابتہ) موکل کی عین ذات کے سوا کچھ نہیں\nنہ کوئی عین ہے نہ کوئی اثر\n\n### [التوکل المشروع (مشروع توکل) اور التوکل الحقیقی (حقیقی توکل)]\n\nالتوکل (توکل) مشروع ہے، لہٰذا اس کی مشروع حد تک ہی پہنچا جاتا ہے۔ اور التوکل الحقیقی (حقیقی توکل) کائنات سے اس کے وجود کی حالت میں واقع نہیں ہوتا۔ یہ تو صرف معدوم (غیر موجود) کے لیے اس کی عدم کی حالت میں ہوتا ہے۔ اور وہاں کوئی مقام نہیں ہے جس سے معدوم متصف ہو، اور موجود میں حقیقت کے لحاظ سے التوکل (توکل) کے سوا کچھ صحیح نہیں ہے۔ پس معدوم التوکل (توکل) کے ساتھ موصوف رہتا ہے یہاں تک کہ وہ موجود ہو جائے۔ جب وہ موجود ہو جاتا ہے تو التوکل (توکل) اس سے نکل جاتا ہے، اور اسی کو ترک التوکل (توکل کا ترک) سے تعبیر کیا جاتا ہے۔\n\n### [اہل اللہ کے عام لوگوں کے ہاں معروف التوکل (توکل) کا ترک کرنا صرف دو آدمیوں کے لیے صحیح ہے]\n\nپھر میں کہتا ہوں کہ اہل اللہ کے عام لوگوں کے ہاں معروف التوکل (توکل) کا ترک کرنا صرف دو آدمیوں کے لیے صحیح ہے۔ پہلا وہ جس نے جان لیا کہ یہ صحیح نہیں ہے، لہٰذا اس نے اس میں شروع کرنا ہی ترک کر دیا، کیونکہ اس کے نزدیک اس کا حصول ممکن نہیں ہے۔ جب اس نے دیکھا کہ اگر وہ اسے اختیار کرتا ہے تو بھوک کی تکلیف ہوتی ہے، اور اس کے پاس وہ چیز موجود ہے جس سے وہ اسے دور کر سکتا ہے، تو اس نے بھوک کی تکلیف کو دور کرنے کے لیے اسے کھا لیا۔ پس اس میں اور اس شخص میں کوئی فرق نہیں جو دم کرواتا ہے، علاج کرواتا ہے، اور خوفناک امور سے امن کی جگہ پناہ لیتا ہے، جبکہ وہ ہوش میں ہو، عقل کامل ہو اور علم تام ہو۔ پس التوکل (توکل) جہاں تک ایک مقام ہے، وہ حاصل ہے، اور جہاں تک اس کا حال ہے، وہ حاصل نہیں ہے۔ پس التوکل (توکل) صحیح بھی ہے اور صحیح نہیں بھی ہے۔ اور رہا دوسرا شخص، اس نے کہا کہ اللہ مخلوق کی مصلحتوں کو زیادہ جانتا ہے، اور اس نے ہر چیز کو اس کی تخلیق (خلق) عطا کر دی ہے۔ (سورة طه: ۵۰) تو اس فراغت کے ہوتے ہوئے التوکل (توکل) کس لیے؟ پس اس نے التوکل (توکل) ترک کر دیا۔ کیونکہ اس کے لیے کوئی ایسی چیز باقی نہیں رہی جس میں وہ اللہ پر بھروسہ کرے، اس لیے کہ اس نے کہا: \"تیرے رب نے فراغت کر دی ہے۔\" اس کے باوجود وہ امر و نہی پر قائم ہے، ان اعمال کو بجا لاتا ہے جن کا حکم دیا گیا ہے یا جن سے منع کیا گیا ہے، اور اس پر مشروع حکم پر قائم ہے۔\n\n### [التوکل (توکل) کے اسرار میں سے ترک التوکل (توکل کا ترک) ہے]\n\nپس التوکل (توکل) کے اسرار میں سے ترک التوکل (توکل کا ترک) ہے۔ کیونکہ ترک التوکل (توکل کا ترک) اغیار (غیر اللہ) کو باقی رکھتا ہے، اور التوکل (توکل) اغیار کو ختم کرتا ہے۔ اور اکثر قوم کے نزدیک اعلیٰ وہ ہے جو نفی کرے نہ کہ وہ جو باقی رکھے۔ اور ہمارے نزدیک، اور ہمارے شیخ ابو السعود بن الشبلی، اور مغرب کے شہر تنس کے ابو عبد اللہ الہواری، اور اندلس کے شہر المریہ کے ابو عبد اللہ الغزال، اور اشبیلیہ کے ابو عمران موسیٰ بن عمران المیرتلی اور دیگر کے نزدیک، اعلیٰ وہ ہے جو فنا کرے اس چیز کو جو فنا ہونے کے لائق ہے، اور باقی رکھے اس چیز کو جو باقی رہنے کے لائق ہے، اس حال میں جو لائق ہو اور اس وقت میں جو لائق ہو۔ اور اسی بات کے قائل بغداد کے عبد القادر الجیلی بھی تھے۔ کیونکہ اللہ تعالیٰ نے فنا بھی کیا اور باقی بھی رکھا۔ اللہ تعالیٰ فرماتا ہے: \"جو کچھ تمہارے پاس ہے وہ ختم ہو جائے گا\" (مَا عِنْدَكُمْ يَنْفَدُ) \"اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے\" (وَمَا عِنْدَ الله باقٍ) (سورة النحل: ۹۶) پس تم اس کے باقی رہنے میں اللہ پر بھروسہ کرو۔ پس اس نے فنا بھی کیا اور باقی بھی رکھا۔ اور الإفناء (فنا کرنا) ابو مدین کا حال تھا ان کی امامت کے وقت، اور میں نہیں جانتا کہ کیا وہ اس کے بعد اس سے منتقل ہوئے یا نہیں، کیونکہ وہ اپنی وفات سے ایک یا دو گھنٹے پہلے امامت سے منتقل ہو گئے تھے (یہ شک میری طرف سے ہے وقت کے زیادہ گزر جانے کی وجہ سے)۔\n\n### [صاحب ترک التوکل (توکل کا ترک کرنے والا) کوئی دعویٰ نہیں رکھتا کیونکہ یہ ایک امر عدمی (غیر موجود امر) ہے]\n\nاور صاحب ترک التوکل (توکل کا ترک کرنے والا) کوئی دعویٰ نہیں رکھتا اور نہ ہی وہ جواب دہ ہے، کیونکہ یہ ایک امر عدمی (غیر موجود امر) ہے۔ پس یہ اس اصل کے حکم میں آ گیا جو اللہ تعالیٰ کے اس فرمان میں ہے: \"کیا انسان پر زمانے میں ایک ایسا وقت نہیں آیا جب وہ کوئی قابل ذکر چیز نہ تھا؟\" (هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ من الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً) (سورة الإنسان: ۱) اس سے مراد اس کی عین (ذات) میں اس کا عدم ہے، کیونکہ وہ اللہ تعالیٰ کے لیے مذکور تھا۔ اور الدھر (دہر/زمانہ) اللہ کے اسماء میں سے ایک نام ہے۔ اور اسی لفظی اشتراک کی وجہ سے دہر کو برا بھلا کہنے سے منع کیا گیا اور فرمایا کہ اللہ ہی الدھر (دہر) ہے۔\n\nاور وہاں کوئی عین نہیں ہے جسے اس کی اپنی عین کی وجہ سے برا بھلا کہا جائے، بلکہ اسے اس چیز کی وجہ سے برا بھلا کہا جاتا ہے جو اس سے صادر ہوتی ہے۔ اور کائنات میں جو کچھ صادر ہوتا ہے وہ صرف اللہ کی طرف سے ہوتا ہے، اور زمانی دہر (الدهر الزماني) ایک نسبت ہے۔ اور اس کا فرمان \"وہ کوئی قابل ذکر چیز نہ تھا\" (لَمْ يَكُنْ شَيْئاً مَذْكُوراً) کا مطلب ہے کہ انسان اس وقت میں اپنی عین میں موجود تھا، دیگر الأعیان (اعیان) کے وجود کے ساتھ، لیکن وہ اسے نہیں جانتی تھیں کہ اسے یاد کریں، اور نہ ہی وہ فکر کی حامل تھیں کہ اسے اپنے ذہن میں تخمینہ لگا کر جمع کریں اور پھر اسے یاد کریں۔ کیونکہ فکر ان قوتوں میں سے ہے جو انسان کے ساتھ خاص ہیں اور کسی اور میں نہیں پائی جاتی ہیں۔\n\n### [انسان کی نشأت اور اس کی عین کے وجود کو مؤخر کرنا]\n\nپھر یہ کہ یہ آیت قرآن میں انسان کے نقصان کے حق میں اور اس میں جو بظاہر عدم اعتناء الٰہی (اللہ کی بے توجہی) ظاہر ہوتا ہے، سب سے مشکل آیات میں سے ہے۔ اور ہمارے نزدیک، اللہ نے اس کی نشأت اور اس کی عین (ذات) کے وجود کو صرف اس لیے مؤخر کیا کہ اللہ کو اس سے اعتناء (توجہ) تھی۔ کیونکہ اگر اللہ اسے سب سے پہلی چیزوں میں پیدا کر دیتا تو اس پر ایک ایسا وقت گزرتا جب وہ خلیفہ نہ ہوتا۔ کیونکہ وہاں کوئی ایسا نہیں تھا جسے اللہ نے الخلافۃ (خلافت) اور اپنی نیابت کے مرتبے کے لیے تیار کیا ہو۔ لہٰذا ضروری تھا کہ اس کی عین کا وجود دیگر الأعیان (اعیان) کے وجود سے مؤخر ہو، تاکہ دنیا اور آخرت میں اس سے الخلافۃ (خلافت) کا نام زائل نہ ہو۔ پس وہ صرف بادشاہ اور سردار کی حیثیت سے موجود ہوا، جیسا کہ وہ دوسروں کے ساتھ اللہ کا مملوک بندہ بھی ہے۔ پس اسے تمام عالم پر الخلافۃ (خلافت) کے ذریعے فضیلت دی گئی، اور یہ صرف انسان کے لیے تھی۔ اور اسی مرتبے نے اس کے لیے واجب کر دیا کہ وہ صورت (الصورۃ) پر خلق کیا جائے۔\n\n### [عالم عنصری (عالم العناصر) سے بلند لوگ نشأت میں اعلیٰ ہیں اور انسان نشأت میں زیادہ جامع ہے]\n\nاور جس نے کہا کہ یہ آیت انسان کے ساتھ عدم اعتناء الٰہی (اللہ کی بے توجہی) پر دلالت کرتی ہے، کیونکہ اللہ ازل سے متکلم ہے اور ازل سے جانتا ہے کہ کیا ہو گا، اور اس نے انسان کے قابل ذکر چیز ہونے کی نفی کی، حالانکہ وہ یقیناً ایک چیز ہے، اللہ کے اس فرمان کی وجہ سے: \"ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے کہ ہم اسے کہتے ہیں: ہو جا، تو وہ ہو جاتی ہے\" (إِنَّما قَوْلُنا لِشَيْءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ) (سورة النحل: ۴۰)۔ پس حکم صرف اسی کو دیا جاتا ہے جو سمع ثبوتی یا سمع وجودی کے ذریعے سنتا ہے۔ اور اس نے نفی کی کہ انسان دہر (زمانہ) کے ایک وقت میں مذکور تھا، اور دہر یہاں زمانہ ہے اور حین (وقت) اس کا ایک حصہ ہے، جس میں انسان اپنی انسانی صورت کے وجود کے باوجود مذکور نہیں تھا۔ اور وہ شخص جاہل رہا جس نے اس کی صورت کو دیکھا، اس میں اللہ کی مراد کو نہ جانا، اور نہ ہی اس مرتبے کا نام جانا جس سے اسے یاد کیا جاتا، اور نہ ہی وہ عنایت جانی جو اللہ کے ہاں اس کے لیے تھی، جس کا اثر اس پر اس وقت ظاہر ہوا جب اللہ نے اسے اپنی زمین میں خلیفہ بنایا۔ اور اللہ نے اسے اس کے وطن سے دور نہیں کیا، جو کہ وہ مٹی ہے جس سے وہ پیدا ہوا، اور جو اس کی عبودیت (بندگی) کے شہود (الشہود) کا مقام ذلت ہے۔ کیونکہ زمین ذلیل ہے، پس الخلافۃ (خلافت) نے اسے اس کی عبودیت سے نہیں روکا، اگرچہ یہ اعلیٰ ترین مراتب میں سے ہے۔ پس وہ اس میں بالذات ہے، اور مقرب فرشتے اس میں بالعرض ہیں۔ اللہ تعالیٰ فرماتا ہے: \"مسیح اس بات سے کبھی عار محسوس نہیں کریں گے\" (لَنْ يَسْتَنْكِفَ الْمَسِيحُ) \"کہ وہ اللہ کے بندے ہوں\" (أَنْ يَكُونَ عَبْداً لِلَّهِ)۔ پھر عطف کرتے ہوئے فرمایا: \"اور نہ ہی مقرب فرشتے\" (وَلَا الْمَلائِكَةُ الْمُقَرَّبُونَ) (سورة النساء: ۱۷۲)۔ اور وہ وہ ہیں جو عالم عنصری (عالم العناصر) سے بلند ہیں، پس وہ نشأت میں اعلیٰ ہیں، اور انسان نشأت میں زیادہ جامع ہے، کیونکہ اس میں فرشتہ اور غیر فرشتہ دونوں موجود ہیں۔ پس اسے جمع کی فضیلت حاصل ہے۔ اور اسی وجہ سے اللہ نے اسے فرشتوں کا معلم بنایا اور انہیں اس کے لیے سجدہ کروایا۔ پس آیت کا سیاق اس پر نعمتوں کے اقرار کے ساتھ تولا جاتا ہے۔ اور اس ذکر میں مشکل صرف اس کے نکرہ ہونے کی وجہ سے واقع ہوئی، اور نکرہ نفی کے سیاق میں عمومیت پیدا کرتا ہے۔ پس تنکیر (نکرہ لانا) اس کے ذکر کی نفی کو ہر ذکر کرنے والے سے عام کرنے کے ساتھ تولا جاتا ہے۔ اور یہ اس بات کی دلیل ہے کہ اللہ نے اسے ان الأعیان (اعیان) کے لیے مذکور نہیں کیا جنہیں اس نے اس سے پہلے وجود بخشا، اگرچہ وہ خود اللہ کے لیے مذکور تھا۔ پھر اللہ نے اسے اس مرتبے کے ساتھ اپنے فرشتوں کے لیے مذکور کیا جس کے لیے اسے خلق کیا گیا تھا، نہ کہ اس کے اسم علم (خاص نام) یعنی آدم کے ساتھ۔ پس جان لو۔",
    "fa": "باب صد و نوزدهم در ترک توکل (ترك التوكل)\n\nتو خلیفه‌ای در آنچه مالک آنی *** و حق (الحق) را نه سودی است و نه زیانی\n\nترک توکل (ترك التوكل) حالی است که جز وکیل (خداوند) آن را نمی‌داند *** نه روحی و نه بشری\n\nچگونه توکل (التوكل) باشد در حالی که اعیان (الأعيان) چیزی جز *** عین موکَّل (آنکه بر او توکل می‌شود) نیستند، نه عین و نه اثری؟\n\n### [توکل مشروع و توکل حقیقی‏]\n\nتوکل (التوكل) مشروع است، پس حد مشروع آن به دست می‌آید. اما توکل حقیقی (التوكل الحقيقي) در حال وجود از سوی کائنات واقع نمی‌شود؛ بلکه تنها برای معدوم (المعدوم) در حال عدمش است. و در آنجا مقامی نیست که معدوم (المعدوم) بدان متصف شود، و از جهت حقیقت (الحقيقة) نیز برای موجود (الموجود) چیزی جز توکل (التوكل) صحیح نیست. پس معدوم (المعدوم) پیوسته به توکل (التوكل) موصوف است تا زمانی که موجود شود. و چون موجود شد، توکل از او خارج می‌شود. این همان چیزی است که به ترک توکل (ترك التوكل) تعبیر می‌شود.\n\n### [توکل معروف نزد عامه اهل الله جز برای دو مرد صحیح نیست‏]\n\nسپس می‌گویم: ترک توکل (ترك التوكل) که نزد عامه اهل الله (أهل الله) معروف است، تنها برای دو مرد صحیح است. اولی کسی است که می‌داند توکل صحیح نیست، پس شروع به آن را ترک می‌کند، زیرا نزد او دستیابی به آن ممکن نیست؛ چرا که می‌بیند اگر آن را بپذیرد، درد گرسنگی او را آزار می‌دهد و او چیزی دارد که می‌تواند با آن درد را دفع کند، پس آن را می‌خورد تا درد گرسنگی را از بین ببرد. پس تفاوتی میان او و کسی که طلب رقیه (دعا برای شفا) می‌کند، به طبابت می‌پردازد و با هوشیاری (الصحو)، عقل کامل و علم تام، به محل امن از امور ترسناک پناه می‌برد، نیست. پس توکل (التوكل) از آن حیث که مقام است، حاصل است، اما از حیث حالش حاصل نیست. بنابراین، توکل صحیح است و صحیح نیست. و اما مرد دیگر گفت: خداوند به مصالح خلق داناتر است و «به هر چیزی آفرینش (خلق) آن را عطا کرده است» (أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ). پس با وجود این فراغت (تکمیل امر)، توکل برای چیست؟ پس او توکل (التوكل) را ترک کرد، زیرا دیگر چیزی برای اعتماد بر خدا در آن باقی نمانده بود، چرا که گفت: پروردگارت فارغ شده است. با این حال، او بر امر و نهی ایستاده است، به آنچه امر یا نهی شده عمل می‌کند و به حکم مشروعی که بر اوست قیام می‌نماید.\n\n### [از اسرار توکل، ترک توکل است‏]\n\nپس از اسرار توکل (التوكل)، ترک توکل (ترك التوكل) است. زیرا ترک توکل اغیار (الأغيار) را باقی می‌گذارد، در حالی که توکل اغیار را نفی می‌کند. و نزد بیشتر این قوم، بالاترین حالت آن است که نفی می‌کند، نه آنکه باقی می‌گذارد. اما نزد ما و نزد شیخ ما ابوالسعود بن شبلی و ابوعبدالله الهواری در تنس از بلاد مغرب، و ابوعبدالله الغزال در المریه از بلاد اندلس، و ابوعمران موسی بن عمران المیرتلی در اشبیلیه و دیگران، بالاترین حالت آن است که آنچه را شایسته است فانی کند و آنچه را شایسته است در حال شایسته و وقت شایسته باقی بگذارد. و عبدالقادر گیلانی در بغداد نیز به همین قائل بود. زیرا خداوند متعال فانی می‌کند و باقی می‌گذارد. خداوند متعال می‌فرماید: «آنچه نزد شماست تمام می‌شود» (ما عِنْدَكُمْ يَنْفَدُ) پس بر آن اعتماد نکنید، و «آنچه نزد خداست باقی است» (ما عِنْدَ الله باقٍ) پس برای بقای آن بر خدا اعتماد کنید. پس او فانی کرد و باقی گذاشت. فنا (الإفناء) حال ابومدین در زمان امامت او بود، و نمی‌دانم آیا پس از آن از این حال منتقل شد یا خیر، زیرا او یک یا دو ساعت پیش از مرگش از امامت کناره گرفت—این شک از جانب من است به دلیل دوری زمان.\n\n### [صاحب ترک توکل ادعایی ندارد زیرا امری عدمی است‏]\n\nصاحب ترک توکل (ترك التوكل) ادعایی (دعوى) ندارد و مورد سؤال قرار نمی‌گیرد، زیرا امری عدمی است. پس در حکم اصل قرار می‌گیرد، در قول خداوند متعال: «آیا بر انسان زمانی از دهر (الدَّهْرِ) نگذشت که او چیزی قابل ذکر (شَيْئاً مَذْكُوراً) نبود؟» (هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ من الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً). منظور عدم او در عین خودش است، زیرا او برای خداوند متعال مذکور بود. و دهر (الدهر) نامی از نام‌های خداوند است. و به دلیل همین اشتراک لفظی، از دشنام دادن به دهر نهی شده و فرمود: «همانا خداوند دهر است.» و در آنجا هیچ عینی نیست که به خاطر ذاتش دشنام داده شود، بلکه به خاطر آنچه از آن صادر می‌شود دشنام داده می‌شود. و هیچ کونی صادر نمی‌شود مگر از جانب خدا، و دهر زمانی (الدهر الزماني) یک نسبت است. و قول او: «چیزی قابل ذکر نبود» (لَمْ يَكُنْ شَيْئاً مَذْكُوراً) یعنی انسان در آن زمان—یعنی موجود در عین خود با وجود اعیان—اما تو او را نمی‌شناسی تا ذکرش کنی، و او صاحب فکری (ذات فكر) نیست تا او را به صورت تقدیری در ذهن خود جمع کنی و ذکرش نمایی. زیرا فکر (الفكر) از قوایی است که مختص انسان است و در غیر او یافت نمی‌شود.\n\n### [تأخیر نشأت انسان و وجود عین او]\n\nسپس، این آیه از دشوارترین آیاتی است که در قرآن در حق نقصان انسان و آنچه از عدم اعتناء الهی به او ظاهر می‌شود، نازل شده است. اما نزد ما، خداوند نشأت و وجود عین او را به تأخیر نینداخت مگر به دلیل اعتناء خداوند به او. زیرا اگر خداوند او را اولینِ اشیاء ایجاد می‌کرد، زمانی بر او می‌گذشت که در آن خلیفه (خليفة) نبود. زیرا هیچ کس نبود که برای مرتبه خلافت (الخلافة) و نیابت از او آماده شده باشد. پس ناگزیر بود که وجود عین او از وجود اعیان به تأخیر افتد تا نام خلافت (الخلافة) نه در دنیا و نه در آخرت از او زائل نشود. پس او جز به صورت پادشاهی سرور (ملكيا سيدا) موجود نشد، همان‌گونه که او همراه با دیگران، بنده‌ای مملوک برای خداست. پس او به واسطه خلافت (الخلافة) بر تمام عالم برتری یافت، که به غیر انسان داده نشد. و این مرتبه ایجاب کرد که او بر صورت (الصورة) خلق شود.\n\n### [برتران از عالم عنصری نشأتشان بالاتر و انسان نشأتش جامع‌تر است]\n\nو کسی که می‌گوید این آیه دلالت بر عدم اعتناء الهی به انسان دارد، زیرا خداوند ازلاً متکلم و ازلاً عالم به آنچه خواهد بود است، و نفی کرده که انسان چیزی قابل ذکر (شيئاً مذكوراً) باشد، در حالی که او ناگزیر شیء است، به دلیل قول او: «همانا سخن ما به چیزی چون اراده‌اش کنیم، تنها این است که به آن بگوییم: باش، پس می‌شود» (إِنَّما قَوْلُنا لِشَيْءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ). و امر نمی‌شود مگر کسی که می‌شنود، خواه با سمع ثبوتی یا سمع وجودی. و نفی کرد که انسان در زمانی از دهر (الدهر) مذکور باشد. و دهر در اینجا زمان است و حین (الحين) جزئی از آن است که انسان در آن مذکور نبوده، با وجود اینکه به صورت انسان موجود بوده است. و کسی که صورت او را مشاهده کرد، از مراد خداوند در او جاهل بود و نامی برای مرتبه‌ای که به آن ذکر شود، نمی‌دانست، و نه عنایتی که نزد خدا داشت و اثرش بر او ظاهر شد، هنگامی که او را خلیفه (خليفة) در زمین خود قرار داد. و او را از موطن خود که خاکی است که از آن خلق شده، و موطن ذلتش (ذلته) برای شهود عبودیتش (عبوديته) دور نساخت، زیرا زمین رام است. پس خلافت (الخلافة) او را از عبودیتش محجوب نساخت، اگرچه بالاترین مراتب است. او در آن بالذات است و ملائکه مقرب (الملائكة المقربون) در آن بالعرض هستند. خداوند متعال می‌فرماید: «مسیح هرگز ابا نخواهد کرد» (لَنْ يَسْتَنْكِفَ) از اینکه بنده خدا (عَبْداً لِلَّهِ) باشد، با وجود اینکه مردگان را زنده می‌کند و خلق می‌نماید و شفا می‌دهد. سپس عطف کرد و فرمود: «و نه فرشتگان مقرب» (ولا الْمَلائِكَةُ الْمُقَرَّبُونَ). و آنان کسانی هستند که از عالم عنصریِ زایش برترند، پس نشأتشان بالاتر است. اما انسان نشأتش جامع‌تر (أجمع نشأة) است، زیرا فرشته و غیر آن در اوست. و به همین دلیل، فضیلت جمع را دارد و به همین سبب او را معلم ملائکه قرار داد و آنان را به سجده بر او واداشت. سیاق آیه با تأیید نعمت‌ها بر او سنجیده می‌شود. و دشواری در این ذکر تنها به دلیل نکره بودن آن رخ داده است، و نکره در سیاق نفی، عمومیت را در بر می‌گیرد. پس تنکیر (نکره بودن) با تعمیم نفی ذکر (نفي الذكر) از او توسط هر ذاکری سنجیده می‌شود. و این دلیلی است بر اینکه خداوند او را برای اعیانی که پیش از او ایجاد کرده بود، ذکر نکرد، اگرچه او برای خود خداوند مذکور بود. سپس او را برای ملائکه خود به مرتبه‌ای که برای آن خلق شده بود ذکر کرد، نه به اسم عَلَمش که آدم است. پس بدان."
  },
  "page_count": 2
}