{
  "id": 442,
  "title": {
    "ar": "الباب الثاني والأربعون وأربعمائة في معرفة منازلة من رآني وعرف أنه رآني فما رآني",
    "en": "Chapter Four Hundred and Forty-Two: Concerning the Gnosis (المعرفة) of the spiritual station (منزلة) of him who saw Me and knew that he saw Me, yet did not see Me.",
    "ur": "باب چار سو بیالیس: اُس شخص کے روحانی مقام (منازلة) کی معرفت میں جس نے مجھے دیکھا اور جان لیا کہ اُس نے مجھے دیکھا، مگر پھر بھی اُس نے مجھے نہیں دیکھا۔",
    "fa": "باب چهارصد و چهل و دوم: در معرفت (معرفة) منزلت کسی که مرا دید و دانست که مرا دیده است، اما مرا ندید."
  },
  "content": {
    "ar": "## «الباب الثاني والأربعون وأربعمائة في معرفة منازلة من رآني وعرف أنه رآني فما رآني»\n\n\n> من رآني وقال يوما رآني *** ما يراني غير الذي ما يراني‏\n\n\n> إن لله نظرة في وجودي *** وبها ربنا العلي هداني‏\n\n\n> يذهب العلم إن نظرت إليه *** بجنان بفكره أو عيان‏\n\n\n> فدليلي ينفي الثبوت ويمضي *** في سلوب يعطيكها في بيان‏\n\n\n> وعيون تعلقت بمثال *** في كشوف يكون أو في جنان‏\n\n\n> هو لا مدرك بعين وعقل *** والذي تدرك الجفون كياني‏\n\n\n### [إن رؤية المرئي تعطى العلم به‏]\n\n\nقال الله تعالى إن موسى قال رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ قالَ له ربه لَنْ تَرانِي لأنه قال انظر بالهمزة فلو قال بالنون أو بالياء والتاء ربما لم يكن الجواب لَنْ تَرانِي والله أعلم والسؤال مجمل في قوله أَنْظُرْ والجواب مجمل في قوله لَنْ تَرانِي اعلم أن رؤية المرئي تعطي العلم به ويعلم الرائي أنه رأى أمرا ما وقد أحاط علما بما رآه ورأينا الذي يرى الحق لا تنضبط له رؤيته إياه وما لا ينضبط لا يقال فيه إن الذي رآه عرف أنه رآه إذ لو رآه لعلمه وقد علم بتنوع الصور عليه في ترداد رؤيته مع أحدية العين في نفس الأمر فما رآه حقيقة فلا يعلم الحق إلا من يعلم أنه ما رآه قالَ رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ بعيني فإن الرؤية بأداة إلى رؤية العين قالَ له لَنْ تَرانِي بعينك لأن المقصود من الرؤية حصول العلم بالمرئي ولا تزال ترى في كل رؤية خلاف ما تراه في الرؤية التي تقدمت فلا يحصل لك علم برؤية أصلا في المرئي فقال له لَنْ تَرانِي فإني لا أقبل من حيث أنا التنوع وأنت ما ترى إلا متنوعا وأنت ما تنوعت فما رأيتني ولا رأيت نفسك وقد رأيت فلا بد أن تقول رأيت الحق وأنت ما رأيتني فلم تصدق أو تقول رأيت نفسي وما رأيت نفسك فلم تصدق وما ثم إلا أنت والحق ولا واحد من هذين رأيت وأنت تعلم أنك رأيت فما هذا الذي رأيت فلن تراني بعينك فهل إذا كان الحق بصرك هل يمكن أن تصدق في أنك رأيته إذا رأيت أو الحال واحدة في بصره إذا كان في مادة عينك أو بصرك وهذا مشهد من مشاهد الحيرة في الله تعالى ولا تتعجب من طلب موسى عليه السلام رؤية ربه فإنه ثم مقام يقتضي طلب الرؤية والإنسان بحكم الوقت فإن الوقت حكمه مطلق حقا وخلقا وهذا القدر كاف في هذه المنازلة فإن مجالها لا يتسع لا كثر من هذه العبارة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 442: Concerning the Gnosis of the Station of Him Who Saw Me and Knew That He Saw Me, Yet Did Not See Me\n\n> He who saw me and claimed one day, \"He saw me,\"\n> Is not seen except by the one who does not see me.\n\n> Indeed, Allah has a gaze upon my existence (وجودي),\n> And by it, our Lord, the Exalted, guided me.\n\n> Knowledge vanishes if you look toward Him,\n> Whether with a heart (جنان), by thought, or by direct vision (عيان).\n\n> My proof (دليلي) negates affirmation (الثبوت) and proceeds\n> Through negations (سلوب) which He grants you in clarification (بيان).\n\n> And eyes cling to an image (مثال),\n> Whether it occurs in unveilings (كشوف) or in the heart.\n\n> He is not perceived by the eye or the intellect (عقل),\n> And that which the eyelids perceive is my essence (كياني).\n\n### [Indeed, the Vision of the Seen Grants Knowledge of It]\n\nAllah the Exalted said that Moses said, <<رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ>> (My Lord, show me [Yourself] that I may look upon You). His Lord said to him, <<لَنْ تَرانِي>> (You shall not see Me). [The prohibition was given] because he said *anzur* (أَنْظُرْ - I look) with the hamza (أ); had he said it with the *nūn* (ن) or the *yā’* (ي) or the *tā’* (ت) [referring to different conjugations], the answer might not have been, \"You shall not see Me.\" And Allah knows best. The question is general (مجمل) in His saying, \"that I may look upon You,\" and the answer is general in His saying, \"You shall not see Me.\"\n\nKnow that the vision (رؤية) of the seen object (المرئي) grants knowledge (العلم) of it, and the viewer knows that he has seen something and has encompassed knowledge of what he saw. But we see that the one who sees The Real (الحق) does not have his vision of Him fixed or defined. And that which is not fixed cannot be said of the one who saw it that he knew he saw it, for if he had truly seen Him, he would have known Him [definitively]. Yet he knows [The Real] through the multiplicity of forms (تنوع الصور) that appear to him in the repetition of his vision, despite the Oneness (أحدية) of the Essence (العين) in reality (في نفس الأمر). Thus, he has not seen Him truly (حقيقة). Therefore, no one knows The Real except he who knows that he has not seen Him.\n\n[Moses] said, \"My Lord, show me [Yourself] that I may look upon You\" with my eye, for vision is an instrument leading to the sight of the eye. [The Lord] said to him, \"You shall not see Me\" with your eye, because the purpose of vision is the attainment of knowledge of the seen object. And you will continue to see in every vision something contrary to what you saw in the preceding vision. Thus, you will not attain any knowledge whatsoever of the seen object through vision. So He said to him, \"You shall not see Me,\" for I do not accept multiplicity (التنوع) from the perspective of My Essence (من حيث أنا), and you see nothing but multiplicity. And if you have not experienced multiplicity, then you have not seen Me, nor have you seen yourself. Yet you have seen something. You must either say, \"I saw The Real,\" but you did not see Me, so you are not truthful; or you say, \"I saw myself,\" but you did not see yourself, so you are not truthful. And there is nothing there except you and The Real, and you have not seen either of these two. Yet you know that you have seen something. So what is this that you have seen? Therefore, you shall not see Me with your eye. But if The Real is your sight (بصرك), can you be truthful in saying that you saw Him when you saw, or is the situation the same regarding His sight, whether it is in the substance of your eye or your sight?\n\nThis is a station (مشهد) among the stations of Bewilderment (الحيرة) concerning Allah the Exalted. Do not be astonished by the request of Moses (peace be upon him) to see his Lord, for there is a spiritual station (مقام) that necessitates the request for vision. And the human being is subject to the ruling of the moment (الوقت), for the ruling of the moment is absolute, both in relation to The Real (حقا) and to Creation (خلقا). This much is sufficient for this station [of paradox] (المنازلة), for its scope does not permit more than this expression. And Allah says the truth, and He guides to the way (<<وَهُوَ يَهْدِي السَّبِيلَ>>).",
    "ur": "باب نمبر چار سو بیالیس: اس شخص کے مقام کی معرفت میں جس نے مجھے دیکھا اور جانا کہ اس نے مجھے دیکھا، مگر اس نے مجھے نہیں دیکھا۔\n\nجس نے مجھے دیکھا اور ایک دن کہا کہ اس نے مجھے دیکھا،\nوہ مجھے نہیں دیکھتا سوائے اس کے جو مجھے نہیں دیکھتا۔\n\nبے شک اللہ کی میرے الوجود (الوجود) پر ایک نظر ہے،\nاور اسی کے ذریعے ہمارے رب اعلیٰ نے میری رہنمائی کی۔\n\nاگر تم اس کی طرف دل (جنان) سے، فکر سے، یا عیان (مشاہدہ) سے دیکھو تو علم زائل ہو جاتا ہے۔\n\nپس میری دلیل ثبوت کی نفی کرتی ہے اور سلوب (نفیات) میں آگے بڑھتی ہے، جو وہ تمہیں وضاحت سے عطا کرتی ہے۔\n\nاور وہ آنکھیں جو ایک مثال سے وابستہ ہوئیں،\nخواہ وہ کشف (الکشف) میں ہو یا دل (جنان) میں۔\n\nوہ نہ آنکھ سے قابل ادراک ہے نہ عقل سے،\nاور جو کچھ پلکیں ادراک کرتی ہیں وہ میری حقیقت (کیانی) ہے۔\n\n### [بے شک مرئی (دیکھی جانے والی شے) کا دیکھنا اس کا علم عطا کرتا ہے]\n\nاللہ تعالیٰ نے فرمایا کہ موسیٰ علیہ السلام نے عرض کیا: رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ (اے میرے رب! مجھے دکھا کہ میں تیرا دیدار کروں)۔ ان کے رب نے فرمایا: لَنْ تَرانِي (تم مجھے ہرگز نہیں دیکھ سکو گے)۔ یہ اس لیے کہ انہوں نے \"انظر\" (میں دیکھوں) ہمزہ کے ساتھ کہا۔ اگر وہ نون، یا یا، یا تا کے ساتھ کہتے تو شاید جواب لَنْ تَرانِي نہ ہوتا، اور اللہ ہی بہتر جانتا ہے۔ سوال ان کے قول \"أَنْظُرْ\" میں مجمل (مبہم) ہے اور جواب ان کے قول \"لَنْ تَرانِي\" میں مجمل ہے۔\n\nجان لو کہ مرئی کا دیکھنا اس کا علم عطا کرتا ہے، اور دیکھنے والا جانتا ہے کہ اس نے کوئی چیز دیکھی ہے اور اس نے جو کچھ دیکھا ہے اس کا علم حاصل کر لیا ہے۔ لیکن ہماری رائے میں جو شخص الحق (الحق) کو دیکھتا ہے، اس کا دیدار اس کے لیے منضبط (مقرر) نہیں ہوتا۔ اور جو چیز منضبط نہ ہو، اس کے بارے میں یہ نہیں کہا جا سکتا کہ جس نے اسے دیکھا اس نے جان لیا کہ اس نے اسے دیکھا ہے، کیونکہ اگر وہ اسے دیکھتا تو اسے جان لیتا۔ حالانکہ وہ نفس الامر میں عین کی احدیت کے باوجود، اپنی بار بار کی رؤیت میں اس پر صور کے تنوع سے واقف ہو چکا ہے۔ پس اس نے حقیقت میں اسے نہیں دیکھا۔ لہٰذا الحق (الحق) کو صرف وہی جانتا ہے جو یہ جانتا ہے کہ اس نے اسے نہیں دیکھا۔\n\nموسیٰ علیہ السلام نے عرض کیا: رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ (اے میرے رب! مجھے دکھا کہ میں تیرا دیدار کروں) اپنی آنکھ سے، کیونکہ آلہ کے ذریعے رؤیت آنکھ کی رؤیت کی طرف لے جاتی ہے۔ اللہ نے ان سے فرمایا: لَنْ تَرانِي (تم مجھے ہرگز نہیں دیکھ سکو گے) اپنی آنکھ سے، کیونکہ رؤیت کا مقصد مرئی کا علم حاصل کرنا ہے۔ اور تم ہر رؤیت میں اس کے خلاف دیکھتے رہو گے جو تم نے پچھلی رؤیت میں دیکھا تھا، لہٰذا تمہیں مرئی کے بارے میں رؤیت سے کوئی علم حاصل نہیں ہو گا۔ پس اللہ نے ان سے فرمایا: لَنْ تَرانِي (تم مجھے ہرگز نہیں دیکھ سکو گے)، کیونکہ میں اپنی حیثیت سے تنوع کو قبول نہیں کرتا، اور تم صرف متنوع کو ہی دیکھتے ہو۔ اور جب تم نے تنوع نہیں دیکھا تو تم نے نہ مجھے دیکھا اور نہ اپنی ذات کو دیکھا۔ حالانکہ تم نے دیکھا ہے، تو تمہیں لازماً یہ کہنا پڑے گا کہ میں نے الحق (الحق) کو دیکھا، اور تم نے مجھے نہیں دیکھا، تو تم سچے نہیں ہوئے۔ یا تم کہو گے کہ میں نے اپنی ذات کو دیکھا، اور تم نے اپنی ذات کو نہیں دیکھا، تو تم سچے نہیں ہوئے۔ اور وہاں تمہارے اور الحق (الحق) کے سوا کچھ نہیں ہے، اور تم نے ان دونوں میں سے کسی کو نہیں دیکھا، حالانکہ تم جانتے ہو کہ تم نے دیکھا ہے۔ تو یہ کیا ہے جو تم نے دیکھا؟ پس تم مجھے اپنی آنکھ سے ہرگز نہیں دیکھ سکو گے۔\n\nتو کیا اگر الحق (الحق) تمہاری بصارت ہو، تو کیا تم اس بات میں سچے ہو سکتے ہو کہ جب تم نے دیکھا تو تم نے اسے دیکھا؟ یا جب وہ تمہاری آنکھ یا تمہاری بصارت کے مادے میں ہو تو اس کی بصارت میں بھی حالت یکساں رہتی ہے؟ اور یہ اللہ تعالیٰ میں حیرت (الحیرۃ) کے مشاہدات میں سے ایک مشاہدہ ہے۔ اور موسیٰ علیہ السلام کے اپنے رب کے دیدار کے مطالبے پر تعجب نہ کرو، کیونکہ وہاں ایک مقام ہے جو رؤیت کے مطالبے کا تقاضا کرتا ہے۔ اور انسان وقت کے حکم کے تحت ہے، کیونکہ وقت کا حکم الحق (الحق) اور خلق دونوں کے اعتبار سے مطلق ہے۔ اور یہ مقدار اس منازلہ (مقام) کے لیے کافی ہے، کیونکہ اس کا میدان اس عبارت سے زیادہ کی گنجائش نہیں رکھتا۔ اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے)۔",
    "fa": "باب چهارصد و چهل و دوم در معرفت مقام کسی که مرا دید و دانست که مرا دیده است، اما مرا ندید.\n\nآن کس که مرا دید و روزی گفت مرا دیده است\nمرا نمی‌بیند جز آن کس که مرا نمی‌بیند\n\nهمانا خداوند را در هستی (الوجود) من نظری است\nو پروردگار بلندمرتبه‌ام با آن مرا هدایت کرد\n\nاگر با دل، با فکر یا با مشاهده (عیان) به او بنگری، علم از میان می‌رود\n\nپس دلیل من ثبوت را نفی می‌کند و پیش می‌رود\nدر نفی‌هایی که در بیان به تو می‌دهد\n\nو چشم‌هایی که به مثالی آویخته‌اند\nخواه در کشف (الکشف) باشد یا در دل‌ها (جنان)\n\nاو با چشم و عقل درک نمی‌شود\nو آنچه پلک‌ها درک می‌کنند، کیان من است\n\n### [همانا دیدن شیء دیده‌شده، علم به آن را می‌بخشد]\n\nخداوند متعال فرمود که موسی گفت: «رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ» (پروردگارا، خود را به من بنما تا به تو بنگرم). پروردگارش به او فرمود: «لَنْ تَرانِي» (هرگز مرا نخواهی دید). زیرا او «انظر» را با همزه گفت؛ اگر با نون یا یاء و تاء می‌گفت، شاید پاسخ «لَنْ تَرانِي» نبود، و خدا داناتر است. پرسش در قول او «أَنْظُرْ» (بنگرم) مجمل است و پاسخ در قول او «لَنْ تَرانِي» (هرگز مرا نخواهی دید) مجمل است.\n\nبدان که دیدن شیء دیده‌شده، علم به آن را می‌بخشد و بیننده می‌داند که امری را دیده است و به آنچه دیده، احاطه علمی یافته است. اما ما می‌بینیم کسی که حق (الحق) را می‌بیند، رؤیتش نسبت به او منضبط نمی‌شود. و آنچه منضبط نیست، نمی‌توان گفت کسی که آن را دیده، دانسته که آن را دیده است؛ زیرا اگر آن را می‌دید، آن را می‌شناخت. در حالی که او به تنوع صور بر خود در تکرار رؤیتش، با وجود احدیت عین در نفس‌الامر، آگاه شده است. پس او حق (الحق) را به حقیقت ندیده است. حق (الحق) را نمی‌شناسد مگر کسی که بداند او را ندیده است.\n\nگفت: «رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ» (پروردگارا، خود را به من بنما تا به تو بنگرم) با چشمم؛ زیرا رؤیت با ابزار، به رؤیت چشم می‌انجامد. [خداوند] به او فرمود: «لَنْ تَرانِي» (هرگز مرا نخواهی دید) با چشمت؛ زیرا مقصود از رؤیت، حصول علم به شیء دیده‌شده است، و تو پیوسته در هر رؤیتی، خلاف آنچه را که در رؤیت پیشین دیده‌ای، می‌بینی. پس اصلاً علمی از طریق رؤیت در شیء دیده‌شده برای تو حاصل نمی‌شود. پس به او فرمود: «لَنْ تَرانِي» (هرگز مرا نخواهی دید)، زیرا من از حیث ذاتم تنوع را نمی‌پذیرم، و تو جز متنوع نمی‌بینی. و تو [اگر] متنوع نشدی، پس نه مرا دیده‌ای و نه خودت را. در حالی که دیده‌ای، پس ناگزیری بگویی حق (الحق) را دیدم، در حالی که مرا ندیده‌ای و راست نگفته‌ای؛ یا بگویی خود را دیدم، در حالی که خودت را ندیده‌ای و راست نگفته‌ای. و در آنجا جز تو و حق (الحق) نیست، و هیچ یک از این دو را ندیده‌ای، در حالی که می‌دانی دیده‌ای. پس این چیست که دیده‌ای؟ پس هرگز مرا با چشمت نخواهی دید.\n\nپس اگر حق (الحق) بینایی تو باشد، آیا ممکن است راست بگویی که وقتی دیدی، او را دیده‌ای؟ یا اینکه حال در بینایی او یکی است، چه در ماده چشم تو باشد یا در بینایی تو؟ و این مشهدی از مشاهد حيرت در خداوند متعال است. و از طلب رؤیت پروردگار توسط موسی (علیه السلام) تعجب مکن، زیرا در آنجا مقامی است که طلب رؤیت را اقتضا می‌کند، و انسان تابع حکم وقت است، چرا که حکم وقت مطلق است، هم در حق (الحق) و هم در خلق. و این مقدار در این منازله (مقام) کافی است، زیرا گستره آن بیش از این عبارت را برنمی‌تابد. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 1
}