{
  "id": 413,
  "title": {
    "ar": "الباب الثالث عشر وأربعمائة في معرفة منازلة من سألني فما خرج من قضائي ومن لم يسألني فما خرج من قضائي",
    "en": "Chapter Four Hundred and Thirteen: Concerning the understanding of the station [منازلة] of him who petitioned Me, yet did not depart from My Decree [قضائي], and him who did not petition Me, yet did not depart from My Decree.",
    "ur": "باب چار سو تیرہ: ان منازل (منازلة) کی معرفت (المعرفۃ) کے بیان میں جو اس شخص کے ہیں جس نے مجھ سے سوال کیا، تو وہ میرے قضا (القضاء) سے باہر نہ ہوا، اور اس شخص کے بھی جس نے مجھ سے سوال نہ کیا، تو وہ بھی میرے قضا (القضاء) سے باہر نہ ہوا۔",
    "fa": "باب چهارصد و سیزدهم در معرفت منزلتی که هر کس از من پرسید از قضای من خارج نشد و هر کس از من نپرسید نیز از قضای من خارج نشد."
  },
  "content": {
    "ar": "## «الباب الثالث عشر وأربعمائة في معرفة منازلة من سألني فما خرج من قضائي ومن لم يسألني فما خرج من قضائي»\n\n\n> كل شي‏ء بقضاء وقدر *** والذي ليس بشي‏ء بقضا\n\n\n> فالذي يفهم ما أسرده *** حاز علم السر فيه ومضى‏\n\n\n> واحدا في عصره منفردا *** قد أنار القلب منه فاضا\n\n\n> فإذا عاينت من نوره *** إنما عاينت برقا ومضا\n\n\n> ما رأينا لمقام ناله *** في وجود الكون منه عوضا\n\n\n> قلت لما قيل لي إن له *** في الذي يهواه منه غرضا\n\n\n> فالذي أخر عن تحصيله *** لم يكن إلا لأمر عرضا\n\n\n### [إذا كان صلاحية في القاضي موجودا صحت النسبة]\n\n\nاعلم أن الله تعالى عرف أن نسبة القضاء إلى القاضي لا تصح حتى يقضي صلاحية ووجودا ولا يصح له هذا الاسم حتى يقضي ولا يعين القضاء إلا حال المقضي عليه فالقضاء أمر معقول لا وجود له إلا بالمقضي به والمقضي به يعينه حال المقضي عليه وبهذه الجملة يثبت اسم القاضي فلو ارتفعت هذه الجملة من الذهن ارتفع اسم القاضي ولو ارتفعت من الوجود ارتفع أيضا حقيقة فإن أطلق أطلق مجاز أو حقيقة المجاز أو التجوز أن ينسب الوقوع إلى ما ليس بواقع المثال في ذلك ادعى شخص على شخص دينا وأنكر المدعي عليه فعينت الدعوى إقامة البينة وهو المقضي به على صاحب الدعوى وعين الإنكار المقضي به على المنكر وهو اليمين إذا لم تقم البينة وحدث اسم القاضي حقيقة للحاكم باليمين على المدعي عليه إذا أنكر وطلب إقامة البينة من المدعي فالقضاء مجمل والمقضي به تفصيل ذلك المجمل وهو القدر لأن القدر توقيت فمن سأل فحاله أوجب عليه السؤال والسؤال طلب وقوع الإجابة فإنه قال أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ والإجابة أثر في المجيب اقتضاه السؤال فمن سأل أثر ومن أجاب تأثر فالحق آمر اقتضى له ذلك حال المأمور والخلق داع اقتضاه حال المدعو لأن الداعي يرجو الإجابة لما تقرر عنده من حال المدعو والآمر يرجو الامتثال من المأمور لما علمه من حال المأمور فحال‏\nالمأمور جعل للآمر أن يكون منه الأمر وحال المدعو جعل للداعي أن يكون منه الدعاء وكل واحد فحاله اقتضى أن يكون آمر أو داعيا فالدعاء والأمر نتيجة بين مقدمتين هما حال الداعي والمدعو والآمر والمأمور فزالت الوحدة وبان الاشتراك فالتوحيد الحق إنما هو لمن أعطى العلم للعالم والحكم للحاكم والقضاء للقاضي وليس إلا عين الممكن وهو الخلق في حال عدمه ووجوده كما قررناه في الباب قبل هذا والأحوال نسب عدمية وهي الموجبة لوجود الأحكام من الحكام في المحكوم به وعليه فالممكن مرجح في حال عدمه ووجوده فالترجيح أثر المرجح فيه وحال الترجيح أوجب للممكن أن يسأل وأن لا يسأل بحسب ما تقتضيه حاله لأنا ما عينا حالا من حال فبالحال يسأل فيؤثر الإجابة في المرجح والمرجح أعطى الحال في ترجيحه الذي أوجب السؤال المؤثر في المرجح الإجابة فلا يجيب المرجح إلا عن سؤال ولا سؤال إلا عن حال ولا حال إلا عن ترجيح ولا ترجيح إلا من مرجح ولا مرجح إلا من قابل للترجيح وهو الممكن والممكن أصل ظهور هذه الأحكام كلها فهو المعطي جميع الأسماء والأحكام وقبول المحكوم عليه بذلك والمسمى فما ظهر أمر إلا نتيجة عن مقدمتين فللحق التوحيد في وجود العين وله الإيجاد بالاشتراك منه ومن القابل فله من عينه وجوب الوجود لنفسه فهو واحد وله الإيجاد من حيث نفسه وقبول الممكن فليس بواحد في الإيجاد ولو صح توحيد الإيجاد لوجد المحال كما وجد الممكن وإيجاد المحال محال فإذا قلت على ما قد تقرر من وجود حق وخلق فقل بوجود مؤثر ومؤثر فيه مؤثر فيمن أثر فيه وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ أي إلى هذا الحكم لا إلى العين‏\n\n\nثم لتعلم أن الله تعالى قد أمرنا بالرضا قبل القضاء مطلقا فعلمنا أنه يريد الإجمال فإنه إذا فصله حال المقضي عليه بالمقضي به انقسم إلى ما يجوز الرضاء به وإلى ما لا يجوز فلما أطلق الرضاء به علمنا أنه أراد الإجمال والقدر توقيت الحكم فكل شي‏ء بقضاء وقدر أي بحكم مؤقت فمن حيث التوقيت المطلق يجب الايمان بالقدر خيره وشره حلوه ومره ومن حيث التعيين يجب الايمان به لا الرضاء ببعضه وإنما قلنا يجب الايمان به أنه شر كما يجب الايمان بالخير أنه خير فنقول إنه يجب على الايمان بالشر إنه شر وإنه ليس إلى الله من كونه شرا لا من كونه عين وجود إن كان الشر أمرا وجوديا فمن حيث وجوده أي وجود عينه هو إلى الله ومن كونه شرا ليس إلى الله‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم في دعائه ربه والشر ليس إليك‏\n\n\nفالمؤمن ينفي عن الحق ما نفاه عنه فإن قلت فَأَلْهَمَها فُجُورَها وتَقْواها قلنا ألهمها فعلمت أن الفجور فجور وأن التقوى تقوى لكي تسلك طريق التقوى وتجانب طريق الفجور فإن قلت فقوله كُلٌّ من عِنْدِ الله قلنا ليس ذلك في السيئة المحكوم بها في الشرع وذلك هو الشر وإنما هو فيما يسوءك والذي يسوءك إنما هو مخالفة غرضك وهو قولهم إِنَّا تَطَيَّرْنا بِكُمْ فقال لهم الله قُلْ كُلٌّ من عِنْدِ الله ما يسوءكم وما يحسن عندكم وقد تقرر قبل هذا أن القابل له الأثر في التعيين ما هو للمعطي فهو تعالى معطي الخير والقابل يفصله إلى ما يحكم به عليه من خير وشر فخيريته إبقاؤه على الأصل فله حكم الأصل ولهذا قال والخير كله بيديك وما حكم به من الشر فمن القابل وهوقوله والشر ليس إليك‏\n\n\nفإن قلت فهذا المخلوق على قبول الشر هو ممكن فلأي شي‏ء لم يخلقه على قبول الخير فالكل منه قلنا قد قدمنا وبينا أن العلم تابع للمعلوم وما وجد الممكن إلا على الحال الذي كان عليه في حال عدمه من ثبوت وتغيير كان ما كان والحق ما علم إلا ما هو المعلوم عليه في حال عدمه الذي إذا ظهر في الوجود كان بتلك الحال فما طرأ على المعلوم شي‏ء لم يتصف به في حال عدمه فما للعلم فيه أثر وما قلنا بالقدر إنه توقيت إلا لأنه من المقدار وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ وكُلَّ شَيْ‏ءٍ خَلَقْناهُ بِقَدَرٍ فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Thirteen: Concerning the Knowledge of the Station of the one who asked Me, who did not depart from My Decree (قضائي), and the one who did not ask Me, who did not depart from My Decree (قضائي).\n\nEvery thing is by Divine Decree (قضاء) and Predetermination (قدر),\nAnd that which is not a thing is also by Decree.\n\nSo he who understands what I relate\nHas attained the knowledge of the Secret therein and proceeded.\n\nSingular in his age, unique,\nHis heart has been illuminated and overflowed.\n\nAnd if you witness anything of his light,\nYou have only witnessed a flash of lightning.\n\nWe have not seen for the station he attained\nIn the existence of the Cosmos (الكون) any substitute for him.\n\nI said when it was told to me that he\nHad a purpose in that which he loves:\n\nThat which delayed him from achieving it\nWas nothing but an incidental matter.\n\n### [If the capacity (صلاحية) exists in the Judge, the attribution is sound]\n\nKnow that Allah, the Exalted, has made known that the attribution of the Decree (القضاء) to the Judge (القاضي) is not sound unless He decrees aptitude (صلاحية) and existence (وجود). Nor is this Name [The Judge] sound for Him until He decrees. The Decree is only specified by the state of the subject of the Decree (المقضي عليه). The Decree (القضاء) is an intelligible matter (أمر معقول) that has no existence (وجود) except through the object of the Decree (المقضي به). The object of the Decree is specified by the state of the subject of the Decree. By this totality, the Name of the Judge is established. If this totality were removed from the mind, the Name of the Judge would be removed. If it were removed from Existence (الوجود), its reality would also be removed. If it is then applied, it is applied metaphorically (مجاز), or as the reality of the metaphor (حقيقة المجاز), or as a figurative expression (التجوز), which is the attribution of occurrence to that which is not occurring.\n\nThe example of this is when one person claims a debt against another, and the defendant denies it. The claim specifies the establishment of proof (إقامة البينة), which is the object of the Decree upon the claimant. The denial specifies the object of the Decree upon the denier, which is the oath (اليمين) if proof is not established. The Name of the Judge (القاضي) truly arises for the one who rules by the oath against the defendant when he denies, and who demands the establishment of proof from the claimant.\n\nThe Decree (القضاء) is general (مجمل), and the object of the Decree (المقضي به) is the detailed specification (تفصيل) of that generality, which is Predetermination (القدر), because Predetermination is timing (توقيت).\n\nWhoever asks, his state (حاله) necessitated the asking upon him. Asking is the request for the occurrence of the Answer, for [The Real] said: <<أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ>> (I answer the call of the caller when he calls upon Me). The Answer (الإجابة) is an effect (أثر) in the Answerer necessitated by the asking. Thus, the one who asks effects, and the one who answers is affected. The Real (الحق) is the Commander (آمر) whose state was necessitated by the state of the commanded (المأمور). Creation (الخلق) is the Caller (داع) whose state was necessitated by the state of the Called (المدعو). This is because the Caller hopes for the Answer due to what is established in his mind concerning the state of the Called, and the Commander hopes for compliance from the commanded due to what He knows concerning the state of the commanded.\n\nThe state of the commanded made it possible for the Commander to issue the command, and the state of the Called made it possible for the Caller to make the call. The state of each one necessitated that he be a Commander or a Caller. Thus, the Call and the Command are a result (نتيجة) between two premises: the state of the Caller and the Called, and the Commander and the Commanded. Thus, Unity (الوحدة) vanished, and partnership (الاشتراك) became manifest.\n\nTrue Unification (التوحيد الحق) belongs only to the one who grants Knowledge (العلم) to the Knower, Judgment (الحكم) to the Judge, and Decree (القضاء) to the Ordainer. This is nothing other than the essence of the possible entity (عين الممكن), which is Creation (الخلق) in its state of non-existence and its state of existence, as we established in the chapter preceding this one. The states (الأحوال) are non-existent relations (نسب عدمية), and they are what necessitate the existence of rulings (الأحكام) from the Rulers concerning that which is ruled upon and against.\n\nThe possible entity (الممكن) is determined (مرجح) in its state of non-existence and its state of existence. The determination (الترجيح) is the effect of the Determiner (المرجح) upon it. The state of determination necessitated that the possible entity should ask or not ask, according to what its state requires. For we have not specified a state from a state, so by the state, it asks, thereby effecting the Answer in the Determiner. The Determiner granted the state in His determination, which necessitated the asking that effects the Answer in the Determiner. Thus, the Determiner only answers a question, and there is no question except from a state, and no state except from a determination, and no determination except from a Determiner, and no Determiner except from a recipient of determination, which is the possible entity. The possible entity is the origin of the manifestation of all these rulings. It is the giver of all the Names (الأسماء) and Rulings (الأحكام), and the acceptance of the subject of the ruling (المحكوم عليه) of that and the named.\n\nNo matter has manifested except as a result of two premises. The Real (الحق) possesses Unification (التوحيد) in the existence of the essence (وجود العين), and He possesses bringing into existence (الإيجاد) through partnership (الاشتراك) between Him and the recipient. Thus, from His Essence (عينه) comes the necessity of Existence (وجوب الوجود) for Himself, so He is One. But He possesses bringing into existence from the perspective of His Self and the acceptance of the possible entity, so He is not One in bringing into existence. If the unification of bringing into existence were sound, the impossible (المحال) would exist just as the possible entity exists, and the bringing into existence of the impossible is impossible.\n\nTherefore, if you speak based on what has been established concerning the existence of the Real (حق) and Creation (خلق), then speak of the existence of an effector (مؤثر) and that which is affected (مؤثر فيه), an effector in the one it affects. <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him returns the whole affair) [Q 11:123]—meaning to this ruling (الحكم), not to the Essence (العين).\n\nFurthermore, you must know that Allah, the Exalted, commanded us to be content (الرضا) before the Decree (القضاء) absolutely. Thus, we knew that He desired generality (الإجمال). For when He details it by the object of the Decree (المقضي به) upon the subject of the Decree (المقضي عليه), it is divided into what is permissible to be content with and what is not permissible. Since He made contentment absolute, we knew that He intended generality. Predetermination (القدر) is the timing (توقيت) of the ruling. Thus, every thing is by Divine Decree (قضاء) and Predetermination (قدر)—meaning, by a timed ruling. From the perspective of absolute timing, belief in Predetermination (القدر), both its good and its evil, its sweet and its bitter, is obligatory. From the perspective of specification (التعيين), belief in it is obligatory, but contentment with only some of it is obligatory.\n\nWe said that belief in evil as evil is obligatory, just as belief in good as good is obligatory. So we say that belief in evil as evil is obligatory, and that evil, in its being evil, is not attributable to Allah, but its essence of existence (عين وجود) is attributable to Him if the evil is an existent matter. Thus, from the perspective of its existence—that is, the existence of its essence—it is attributable to Allah, but from the perspective of its being evil, it is not attributable to Allah.\n\nThe Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said in his supplication to his Lord: \"And evil is not from You.\"\n\nThe believer negates from The Real (الحق) what He negated from Himself. If you say, <<فَأَلْهَمَها فُجُورَها وَتَقْواها>> (Then inspired it [the soul] with its wickedness and its piety) [Q 91:8], we reply: He inspired it so that it knew that wickedness is wickedness and that piety is piety, in order that it might follow the path of piety and avoid the path of wickedness.\n\nIf you cite His saying, <<كُلٌّ مِنْ عِنْدِ اللهِ>> (All is from Allah) [Q 4:78], we say that this does not apply to the evil ruled upon in the Sacred Law (الشرع), which is the [moral] evil. Rather, it applies to that which displeases you (ما يسوءك). That which displeases you is merely the contradiction of your purpose. This is like their saying, <<إِنَّا تَطَيَّرْنا بِكُمْ>> (Indeed, we augur ill of you) [Q 36:18]. Allah said to them, <<قُلْ كُلٌّ مِنْ عِنْدِ اللهِ>> (Say: All is from Allah) [Q 4:78]—meaning, both what displeases you and what seems good to you.\n\nIt has been established before this that the recipient (القابل) has the effect in specifying what is given by the Giver. He, the Exalted, is the Giver of Good, and the recipient details it into what is ruled upon it, whether good or evil. His goodness is His preservation of it upon its origin, so it has the ruling of the origin. For this reason, He said: \"And all good is in Your hands.\" But that which is ruled as evil comes from the recipient, and this is His saying: \"And evil is not from You.\"\n\nIf you ask: This creature, having the acceptance of evil, is a possible entity (ممكن). Why did He not create it with the acceptance of good, since all comes from Him? We reply: We have previously stated and clarified that Knowledge (العلم) is dependent upon the Known (المعلوم). The possible entity only came into existence upon the state it possessed in its state of non-existence (عدمه) from immutability (ثبوت) and change—whatever it was, it was. The Real (الحق) only knew what the Known was upon in its state of non-existence, which, when it appeared in Existence (الوجود), was in that state. Nothing incidental occurred to the Known that it was not characterized by in its state of non-existence, so Knowledge has no effect upon it. We only said that Predetermination (القدر) is timing because it comes from measure (المقدار). <<وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ>> (And We do not send it down except by a known measure) [Q 15:21], and <<وَكُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ>> (And everything We have created by [a fixed] measure) [Q 54:49]. Know this, and Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth and He guides to the Way) [Q 33:4].",
    "ur": "باب نمبر چار سو تیرہ: اس شخص کے مقام کی معرفت میں جس نے مجھ سے سوال کیا تو وہ میرے قضا سے باہر نہ ہوا، اور جس نے مجھ سے سوال نہیں کیا تو وہ بھی میرے قضا سے باہر نہ ہوا۔\n\nہر شے قضا اور قدر کے ساتھ ہے،\nاور جو شے نہیں ہے، وہ بھی قضا کے ساتھ ہے۔\n\nپس جو شخص اس بات کو سمجھ لے جو میں بیان کرتا ہوں،\nاس نے اس میں علمِ سر حاصل کر لیا اور آگے بڑھ گیا۔\n\nوہ اپنے زمانے میں یکتا اور منفرد ہے،\nاس کا دل روشن ہو چکا ہے اور فیضان جاری ہے۔\n\nجب تم اس کے نور کا مشاہدہ کرو،\nتو تم نے صرف ایک چمکتی ہوئی بجلی کا مشاہدہ کیا۔\n\nہم نے اس مقام کا کوئی بدل نہیں دیکھا جو اس نے حاصل کیا،\nکائنات کی ہستی (الوجود) میں اس کا کوئی نعم البدل نہیں۔\n\nمیں نے کہا جب مجھ سے کہا گیا کہ اس کے لیے\nاس چیز میں غرض ہے جس سے وہ محبت کرتا ہے۔\n\nپس جو چیز اس کے حصول سے مؤخر ہوئی،\nوہ صرف ایک عارضی امر کی وجہ سے تھی۔\n\n[جب قاضی میں صلاحیت موجود ہو تو نسبت درست ہوتی ہے]\n\nجان لو کہ اللہ تعالیٰ نے یہ جانا کہ قاضی کی طرف قضا کی نسبت اس وقت تک درست نہیں ہوتی جب تک کہ وہ صلاحیت اور ہستی (الوجود) کے ساتھ فیصلہ نہ کرے۔ اور قاضی کے لیے یہ نام اس وقت تک درست نہیں ہوتا جب تک کہ وہ فیصلہ نہ کرے۔ اور قضا کا تعین صرف مقضی علیہ (وہ جس پر فیصلہ نافذ ہوا) کی حالت سے ہوتا ہے۔ پس قضا ایک معقول امر ہے جس کی ہستی (الوجود) مقضی بہ (وہ جس کا فیصلہ کیا گیا) کے بغیر نہیں ہوتی، اور مقضی بہ کا تعین مقضی علیہ کی حالت سے ہوتا ہے۔ اور اسی مجموعے سے قاضی کا نام ثابت ہوتا ہے۔ اگر یہ مجموعہ ذہن سے اٹھ جائے تو قاضی کا نام بھی اٹھ جائے گا، اور اگر یہ ہستی (الوجود) سے اٹھ جائے تو حقیقت میں بھی اٹھ جائے گا۔ اگر اسے مطلقاً استعمال کیا جائے تو یہ مجازاً استعمال ہوگا، یا مجاز کی حقیقت کے طور پر۔ یا تجوز یہ ہے کہ وقوع کو اس چیز کی طرف منسوب کیا جائے جو واقع نہیں ہے۔ اس کی مثال یہ ہے کہ ایک شخص دوسرے شخص پر قرض کا دعویٰ کرے اور مدعا علیہ انکار کر دے۔ تو دعویٰ نے بینہ (گواہی) کے قیام کا تعین کیا، اور یہی مدعی پر مقضی بہ ہے۔ اور انکار نے منکر پر مقضی بہ کا تعین کیا، اور وہ قسم ہے جب بینہ قائم نہ ہو۔ اور قاضی کا نام حقیقت میں اس حاکم کے لیے وجود میں آیا جو مدعا علیہ پر قسم کا حکم دیتا ہے جب وہ انکار کرے اور مدعی سے بینہ قائم کرنے کا مطالبہ کرے۔ پس قضا اجمالی ہے اور مقضی بہ اس اجمال کی تفصیل ہے، اور یہی قدر ہے، کیونکہ قدر توقیت (وقت کا تعین) ہے۔\n\nپس جس نے سوال کیا تو اس کی حالت نے اس پر سوال کو واجب کر دیا، اور سوال اجابت کے وقوع کا طلب کرنا ہے۔ کیونکہ ذات حق (الحق) نے فرمایا: \"أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ\" (میں دعا کرنے والے کی دعا قبول کرتا ہوں جب وہ مجھ سے دعا کرتا ہے)۔ اور اجابت مجیب میں ایک اثر ہے جسے سوال نے تقاضا کیا۔ پس جس نے سوال کیا اس نے اثر ڈالا، اور جس نے جواب دیا وہ متاثر ہوا۔ پس ذات حق (الحق) آمر ہے، اور یہ امر مأمور کی حالت نے اس کے لیے تقاضا کیا، اور خلق داعی ہے، اور یہ دعا مدعو کی حالت نے تقاضا کیا۔ کیونکہ داعی اجابت کی امید رکھتا ہے اس حالت کی بنا پر جو مدعو کے بارے میں اس کے ہاں مقرر ہو چکی ہے، اور آمر مأمور سے تعمیل کی امید رکھتا ہے اس حالت کی بنا پر جو اس نے مأمور کے بارے میں جان لی ہے۔ پس مأمور کی حالت نے آمر کے لیے امر کا ہونا ممکن بنایا، اور مدعو کی حالت نے داعی کے لیے دعا کا ہونا ممکن بنایا۔ اور ہر ایک کی حالت نے تقاضا کیا کہ وہ آمر ہو یا داعی ہو۔ پس دعا اور امر دو مقدمات کا نتیجہ ہیں، اور وہ ہیں داعی اور مدعو کی حالت، اور آمر اور مأمور کی حالت۔ پس وحدت زائل ہو گئی اور اشتراک ظاہر ہو گیا۔ پس حقیقی توحید (التوحید الحق) صرف اس کے لیے ہے جس نے عالم کو علم، حاکم کو حکم، اور قاضی کو قضا عطا کی۔ اور وہ ممکن (الممکن) کی عین ذات کے سوا کچھ نہیں، جو کہ خلق ہے اپنی عدم اور ہستی (الوجود) کی حالت میں، جیسا کہ ہم نے اس سے پچھلے باب میں مقرر کیا ہے۔ اور احوال نسب عدمیہ ہیں، اور یہی وہ ہیں جو حاکموں سے محکم بہ اور محکم علیہ میں احکام کے وجود کو واجب کرتے ہیں۔ پس ممکن (الممکن) اپنی عدم اور ہستی (الوجود) کی حالت میں مرجح (ترجیح دیا گیا) ہے۔ پس ترجیح (الترجیح) مرجح (ترجیح دینے والے) کا اس میں اثر ہے۔ اور ترجیح کی حالت نے ممکن کے لیے واجب کیا کہ وہ سوال کرے یا سوال نہ کرے، اس کے حال کے تقاضے کے مطابق۔ کیونکہ ہم نے کسی حال کو کسی حال سے متعین نہیں کیا۔ پس حال کے ذریعے سوال کیا جاتا ہے، اور یہ مرجح میں اجابت کا اثر ڈالتا ہے۔ اور مرجح نے اپنی ترجیح میں وہ حال عطا کیا جس نے سوال کو واجب کیا جو مرجح میں اجابت کا اثر ڈالتا ہے۔ پس مرجح صرف سوال کے جواب میں اجابت کرتا ہے، اور سوال صرف حال سے ہوتا ہے، اور حال صرف ترجیح (الترجیح) سے ہوتا ہے، اور ترجیح صرف مرجح (ترجیح دینے والے) سے ہوتی ہے، اور مرجح صرف ترجیح کو قبول کرنے والے سے ہوتا ہے، اور وہ ممکن (الممکن) ہے۔ اور ممکن ہی ان تمام احکام کے ظہور کی اصل ہے۔ پس وہ تمام اسماء اور احکام عطا کرنے والا ہے، اور محکم علیہ کا اس کو قبول کرنا اور مسمیٰ ہونا بھی اسی سے ہے۔ پس کوئی امر ظاہر نہیں ہوتا مگر دو مقدمات کے نتیجے کے طور پر۔ پس ذات حق (الحق) کے لیے عین کی ہستی (الوجود) میں توحید ہے، اور اس کے لیے ایجاد میں اس کی طرف سے اور قابل کی طرف سے اشتراک ہے۔ پس اس کی عین ذات سے اس کے لیے وجوب الوجود ہے، لہٰذا وہ واحد ہے۔ اور اس کے لیے اپنی ذات کے لحاظ سے اور ممکن کے قبول کے لحاظ سے ایجاد ہے، لہٰذا وہ ایجاد میں واحد نہیں ہے۔ اور اگر ایجاد کی توحید درست ہوتی تو محال بھی موجود ہو جاتا جیسا کہ ممکن موجود ہوا، اور محال کا ایجاد محال ہے۔ پس جب تم اس بات پر کہو جو حق اور خلق کی ہستی (الوجود) سے مقرر ہو چکا ہے، تو تم مؤثر اور مؤثر فیہ (جس پر اثر ڈالا گیا) کی ہستی کے ساتھ کہو، جو اس میں اثر ڈالتا ہے جس پر اس نے اثر ڈالا، اور \"وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ\" (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں)، یعنی اس حکم کی طرف، نہ کہ عین کی طرف۔\n\nپھر تمہیں جاننا چاہیے کہ اللہ تعالیٰ نے ہمیں قضا سے پہلے مطلقاً رضا کا حکم دیا ہے۔ پس ہم نے جان لیا کہ وہ اجمال چاہتا ہے۔ کیونکہ جب وہ اسے مقضی علیہ کی حالت کے ساتھ مقضی بہ کے ذریعے تفصیل دیتا ہے، تو وہ اس میں تقسیم ہو جاتا ہے جس پر رضا جائز ہے اور اس میں جس پر رضا جائز نہیں۔ پس جب اس نے رضا کو مطلق رکھا تو ہم نے جان لیا کہ اس نے اجمال کا ارادہ کیا۔ اور قدر حکم کی توقیت (وقت کا تعین) ہے۔ پس ہر شے قضا اور قدر کے ساتھ ہے، یعنی ایک مؤقت حکم کے ساتھ۔ پس مطلق توقیت کے لحاظ سے قدر پر ایمان لانا واجب ہے، اس کی خیر اور شر، اس کی مٹھاس اور کڑواہٹ پر۔ اور تعین کے لحاظ سے اس پر ایمان لانا واجب ہے، نہ کہ اس کے بعض پر راضی ہونا۔ اور ہم نے یہ اس لیے کہا کہ اس پر ایمان لانا واجب ہے کہ وہ شر ہے، جیسا کہ خیر پر ایمان لانا واجب ہے کہ وہ خیر ہے۔ پس ہم کہتے ہیں کہ شر پر ایمان لانا واجب ہے کہ وہ شر ہے، اور یہ کہ شر ہونے کے لحاظ سے وہ اللہ کی طرف منسوب نہیں، نہ کہ عین وجود ہونے کے لحاظ سے۔ اگر شر کوئی وجودی امر ہو، تو اس کی ہستی (الوجود) کے لحاظ سے، یعنی اس کی عین ہستی کے لحاظ سے، وہ اللہ کی طرف ہے، اور شر ہونے کے لحاظ سے وہ اللہ کی طرف نہیں۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے اپنے رب سے دعا میں فرمایا: \"والشر ليس إليك\" (اور شر تیری طرف منسوب نہیں)۔\n\nپس مؤمن ذات حق (الحق) سے اس چیز کی نفی کرتا ہے جس کی نفی ذات حق نے خود سے کی ہے۔ اگر تم کہو کہ \"فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا\" (پھر اسے اس کی بدکاری اور پرہیزگاری کا الہام کیا)، تو ہم کہیں گے کہ اسے الہام کیا گیا تو اس نے جان لیا کہ فجور فجور ہے اور تقویٰ تقویٰ ہے، تاکہ وہ تقویٰ کی راہ پر چلے اور فجور کی راہ سے اجتناب کرے۔ اگر تم کہو کہ اس کا قول \"كُلٌّ مِّنْ عِندِ اللَّهِ\" (سب کچھ اللہ کی طرف سے ہے)، تو ہم کہیں گے کہ یہ اس برائی کے بارے میں نہیں ہے جس کا شرع میں حکم دیا گیا ہے، اور وہی شر ہے۔ بلکہ یہ اس چیز کے بارے میں ہے جو تمہیں ناگوار گزرتی ہے، اور جو چیز تمہیں ناگوار گزرتی ہے وہ صرف تمہاری غرض کی مخالفت ہے۔ اور یہ ان کا قول ہے: \"إِنَّا تَطَيَّرْنَا بِكُمْ\" (ہم نے تمہیں منحوس سمجھا)، تو اللہ نے ان سے فرمایا: \"قُلْ كُلٌّ مِّنْ عِندِ اللَّهِ\" (کہہ دو کہ سب کچھ اللہ کی طرف سے ہے)، وہ جو تمہیں ناگوار گزرتا ہے اور وہ جو تمہارے نزدیک اچھا ہے۔ اور اس سے پہلے یہ بات مقرر ہو چکی ہے کہ قابل (قبول کرنے والے) کا تعین میں اثر ہوتا ہے، نہ کہ عطا کرنے والے کا۔ پس وہ (اللہ) خیر عطا کرنے والا ہے، اور قابل اسے خیر اور شر میں تقسیم کرتا ہے جس کا حکم اس پر لگایا جاتا ہے۔ پس اس کی خیریت یہ ہے کہ وہ اسے اصل پر باقی رکھتا ہے، لہٰذا اس کے لیے اصل کا حکم ہے۔ اور اسی لیے فرمایا: \"والخير كله بيديك\" (اور تمام خیر تیرے ہاتھوں میں ہے)۔ اور جو شر کا حکم لگایا گیا ہے وہ قابل کی طرف سے ہے، اور یہی اس کا قول ہے: \"والشر ليس إليك\" (اور شر تیری طرف منسوب نہیں)۔\n\nاگر تم کہو کہ یہ مخلوق جو شر کو قبول کرنے والی ہے، وہ ممکن (الممکن) ہے، تو اسے خیر کو قبول کرنے والا کیوں نہیں پیدا کیا گیا؟ جبکہ سب کچھ اسی کی طرف سے ہے۔ ہم کہیں گے کہ ہم پہلے بیان کر چکے ہیں کہ علم معلوم کے تابع ہے۔ اور ممکن (الممکن) صرف اسی حالت پر موجود ہوا جس پر وہ اپنی عدم کی حالت میں تھا، خواہ وہ ثبوت ہو یا تغیر، جو کچھ بھی تھا۔ اور ذات حق (الحق) نے صرف وہی جانا جو معلوم اپنی عدم کی حالت میں تھا، جو جب ہستی (الوجود) میں ظاہر ہوا تو اسی حالت کے ساتھ تھا۔ پس معلوم پر کوئی ایسی چیز طاری نہیں ہوئی جس سے وہ اپنی عدم کی حالت میں متصف نہ تھا۔ پس علم کا اس میں کوئی اثر نہیں۔ اور ہم نے قدر کو توقیت (وقت کا تعین) صرف اس لیے کہا کہ وہ مقدار سے ہے۔ اور \"وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَّعْلُومٍ\" (اور ہم اسے نہیں اتارتے مگر ایک معلوم اندازے کے ساتھ)، اور \"وَكُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ\" (اور ہم نے ہر چیز کو ایک اندازے کے ساتھ پیدا کیا ہے)۔ پس یہ جان لو، اور اللہ \"يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و سیزدهم در معرفت منازل کسی که از من درخواست کرد و از قضای (قضاء) من خارج نشد، و کسی که از من درخواست نکرد و از قضای من خارج نشد.\n\nهر چیزی به قضا (قضاء) و قدر (قدر) است *** و آنچه که هیچ نیست نیز به قضا است.\n\nپس کسی که آنچه را می‌سرایم بفهمد *** علم سرّ را در آن به دست آورده و پیش رفته است.\n\nیگانه‌ای در عصر خویش، تنها *** که قلبش روشن شده و لبریز گشته است.\n\nپس اگر از نور او مشاهده کنی *** جز برقی درخشان مشاهده نکرده‌ای.\n\nبرای مقامی که او بدان دست یافته *** در هستی (الوجود) کائنات، جایگزینی ندیده‌ایم.\n\nگفتم آنگاه که به من گفته شد که او را *** در آنچه دوست می‌دارد، از آن غرضی است.\n\nپس آنچه از دستیابی به آن به تأخیر افتاد *** جز به سبب امری عارض شده نبود.\n\n### [اگر صلاحیت در قاضی موجود باشد، نسبت صحیح است]\n\nبدان که خداوند تعالی دانسته است که نسبت قضا (قضاء) به قاضی صحیح نیست مگر آنکه قضا، صلاحیتی و وجودی را حکم کند. و این نام (قاضی) برای او صحیح نیست مگر آنکه حکم کند. و قضا (قضاء) جز در حال محکوم علیه (المقضي عليه) تعیین نمی‌شود. پس قضا (قضاء) امری معقول است که وجودی ندارد مگر به آنچه حکم شده (المقضي به). و آنچه حکم شده (المقضي به) حال محکوم علیه (المقضي عليه) را تعیین می‌کند. و به واسطه این مجموعه، نام قاضی (القاضي) ثابت می‌شود. اگر این مجموعه از ذهن برداشته شود، نام قاضی برداشته می‌شود. و اگر از هستی (الوجود) برداشته شود، حقیقت آن نیز برداشته می‌شود. اگر اطلاق شود، اطلاق مجازی است یا حقیقت مجاز یا تجوز. تجوز آن است که وقوع به چیزی نسبت داده شود که واقع نیست. مثال در این باره آن است که شخصی بر دیگری ادعای دِینی کند و مدعی علیه انکار نماید. پس برای صاحب دعوا، اقامه بینه (دلیل) که همان مقضی به (المقضي به) است، تعیین می‌شود. و برای منکر، مقضی به (المقضي به) که همان سوگند است در صورتی که بینه اقامه نشود، تعیین می‌گردد. و نام قاضی (القاضي) حقیقتاً برای حاکمی که بر مدعی علیه در صورت انکار، حکم به سوگند می‌کند و از مدعی اقامه بینه می‌طلبد، حادث می‌شود. پس قضا (القضاء) امری مجمل است و مقضی به (المقضي به) تفصیل آن مجمل است که همان قدر (القدر) است؛ زیرا قدر (القدر) توقیت (زمان‌بندی) است.\n\nپس کسی که سؤال می‌کند، حال او سؤال را بر او واجب کرده است. و سؤال، طلب وقوع اجابت است. زیرا [خداوند] فرمود: **أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ** (دعوت دعاکننده را هنگامی که مرا بخواند، اجابت می‌کنم). و اجابت، اثری در اجابت‌کننده است که سؤال آن را اقتضا کرده است. پس کسی که سؤال می‌کند، اثر می‌گذارد و کسی که اجابت می‌کند، متأثر می‌شود. پس حق (الحق) امرکننده‌ای است که حال مأمور (المأمور) آن را برای او اقتضا کرده است. و خلق (الخلق) دعاکننده‌ای است که حال مدعو (المدعو) آن را اقتضا کرده است. زیرا دعاکننده به اجابت امید دارد به سبب آنچه از حال مدعو نزد او مقرر شده است. و امرکننده به امتثال از مأمور امید دارد به سبب آنچه از حال مأمور دانسته است. پس حال مأمور، برای امرکننده این را قرار داد که امر از او باشد. و حال مدعو، برای دعاکننده این را قرار داد که دعا از او باشد. و حال هر یک از آن دو اقتضا کرد که امرکننده یا دعاکننده باشد. پس دعا و امر، نتیجه‌ای است میان دو مقدمه که عبارتند از حال داعی و مدعو، و آمر و مأمور. پس وحدت (الوحدة) زائل شد و اشتراک آشکار گشت. توحید (التوحيد) حقیقی تنها از آن کسی است که علم را به عالم، و حکم را به حاکم، و قضا (القضاء) را به قاضی عطا کرده است. و آن جز عین ممکن (العين الممكن) نیست که همان خلق (الخلق) است در حال عدم و وجودش، چنانکه در باب پیش از این مقرر کردیم. و احوال، نسبت‌های عدمی هستند که موجب وجود احکام از حاکمان در آنچه حکم شده و بر آن حکم شده، می‌گردند.\n\nپس ممکن (الممكن) در حال عدم و وجودش مرجَّح (ترجیح داده شده) است. پس ترجیح (الترجيح) اثر مرجِّح (المرجح) در آن است. و حال ترجیح، برای ممکن (الممكن) واجب کرد که سؤال کند یا سؤال نکند، بر حسب آنچه حالش اقتضا می‌کند. زیرا ما هیچ حالی را از حالی تعیین نکردیم. پس به واسطه حال، سؤال می‌کند و اجابت در مرجِّح (المرجح) اثر می‌گذارد. و مرجِّح (المرجح) در ترجیح خود، حالی را عطا کرد که موجب سؤال مؤثر در مرجِّح (المرجح) برای اجابت شد. پس مرجِّح (المرجح) جز از سؤالی اجابت نمی‌کند، و سؤالی نیست مگر از حالی، و حالی نیست مگر از ترجیحی، و ترجیحی نیست مگر از مرجِّحی، و مرجِّحی نیست مگر از قابلی برای ترجیح که همان ممکن (الممكن) است. و ممکن (الممكن) اصل ظهور همه این احکام است. پس اوست که همه اسماء و احکام و قبول محکوم علیه به آن و مسمّی را عطا می‌کند. پس هیچ امری ظاهر نشد مگر به عنوان نتیجه‌ای از دو مقدمه. پس توحید (التوحيد) در وجود عین (ذات) از آنِ حق (الحق) است، و ایجاد (الإيجاد) به اشتراک از او و از قابل است. پس وجوب هستی (وجوب الوجود) برای ذاتش از عین اوست، پس او واحد است. و ایجاد (الإيجاد) از حیث ذاتش و قبول ممکن (الممكن) است، پس او در ایجاد واحد نیست. و اگر توحید ایجاد صحیح بود، محال (المحال) نیز وجود می‌یافت، چنانکه ممکن (الممكن) وجود یافت. و ایجاد محال، محال است. پس اگر بر اساس آنچه از وجود حق (الحق) و خلق (الخلق) مقرر شده است، سخن می‌گویی، پس به وجود مؤثر و مؤثر فیه (تأثیرپذیر) قائل شو. مؤثر در کسی که در او اثر گذاشته است. و **وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (و همه امور به سوی او بازگردانده می‌شود)؛ یعنی به سوی این حکم، نه به سوی عین (ذات).\n\nسپس باید بدانی که خداوند تعالی ما را به رضا (الرضا) قبل از قضا (القضاء) به طور مطلق امر کرده است. پس دانستیم که او اجمال را می‌خواهد. زیرا هنگامی که آن را در حال محکوم علیه (المقضي عليه) به واسطه مقضی به (المقضي به) تفصیل دهد، به آنچه رضایت به آن جایز است و آنچه جایز نیست، تقسیم می‌شود. پس چون رضا (الرضا) را مطلق گذاشت، دانستیم که اجمال را اراده کرده است. و قدر (القدر) توقیت (زمان‌بندی) حکم است. پس هر چیزی به قضا (قضاء) و قدر (قدر) است؛ یعنی به حکم زمان‌بندی شده. پس از حیث توقیت مطلق، ایمان به قدر (القدر)، خیر و شر، شیرین و تلخش، واجب است. و از حیث تعیین، ایمان به آن واجب است نه رضایت به بعضی از آن. و ما گفتیم که ایمان به شر (الشر) بودن آن واجب است، چنانکه ایمان به خیر (الخير) بودن آن واجب است. پس می‌گوییم که ایمان به شر بودن شر بر ما واجب است، و اینکه شر بودن آن به خداوند باز نمی‌گردد، نه از حیث عین وجودش اگر شر امری وجودی باشد. پس از حیث وجودش، یعنی وجود عینش، به خداوند باز می‌گردد، و از حیث شر بودنش به خداوند باز نمی‌گردد.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در دعای خود به پروردگارش فرمود: **والشر ليس إليك** (و شر به سوی تو نیست).\n\nپس مؤمن آنچه را که حق (الحق) از خود نفی کرده است، از او نفی می‌کند. اگر بگویی: **فَأَلْهَمَها فُجُورَها وتَقْواها** (پس فجور و تقوای آن را به او الهام کرد)، می‌گوییم: به او الهام کرد تا بداند که فجور، فجور است و تقوا، تقواست، تا راه تقوا را بپیماید و از راه فجور دوری کند. اگر بگویی: پس سخن او که **كُلٌّ من عِنْدِ الله** (همه از نزد خداست) چیست؟ می‌گوییم: این در مورد بدی که در شرع حکم شده و همان شر (الشر) است، نیست. بلکه در مورد چیزی است که تو را ناخوش آید. و آنچه تو را ناخوش آید، همان مخالفت با غرض توست. و این همان سخن [قوم شعیب] است که گفتند: **إِنَّا تَطَيَّرْنا بِكُمْ** (ما به شما فال بد زدیم). پس خداوند به آنان فرمود: **قُلْ كُلٌّ من عِنْدِ الله** (بگو: همه از نزد خداست)؛ یعنی آنچه شما را ناخوش می‌آید و آنچه نزد شما نیکوست. و پیش از این مقرر شد که قابل (القابل) در تعیین اثر دارد، نه عطا کننده (المعطي). پس او تعالی عطا کننده خیر (الخير) است و قابل (القابل) آن را به آنچه از خیر و شر بر او حکم می‌شود، تفصیل می‌دهد. پس خیریت آن، ابقای آن بر اصل است، و حکم اصل از آنِ اوست. و به همین دلیل فرمود: **والخير كله بيديك** (و همه خیر به دست توست). و آنچه از شر (الشر) حکم شده، از جانب قابل (القابل) است، و این همان سخن اوست: **والشر ليس إليك** (و شر به سوی تو نیست).\n\nاگر بگویی: پس چرا این مخلوق را که قابلیت شر (الشر) دارد، بر قبول خیر (الخير) خلق نکرد، در حالی که همه از اوست؟ می‌گوییم: پیشتر بیان کردیم که علم تابع معلوم است. و ممکن (الممكن) جز بر حالی که در حال عدمش بر آن بود، از ثبوت و تغییر، وجود نیافت؛ هر چه که بود. و حق (الحق) جز آنچه معلوم در حال عدمش بر آن بود و اگر در هستی (الوجود) ظاهر شود، بر همان حال خواهد بود، ندانست. پس چیزی بر معلوم عارض نشد که در حال عدمش بدان متصف نبوده باشد. پس علم در آن اثری ندارد. و ما قدر (القدر) را توقیت (زمان‌بندی) ننامیدیم مگر به دلیل اینکه از مقدار (اندازه) است. و **وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ** (و ما آن را جز به اندازه‌ای معلوم نازل نمی‌کنیم) و **وَكُلَّ شَيْ‏ءٍ خَلَقْنَاهُ بِقَدَرٍ** (و هر چیزی را به اندازه‌ای آفریدیم). پس این را بدان، و خداوند **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}