{
  "id": 503,
  "title": {
    "ar": "الباب الثالث وخمسمائة في معرفة حال قطب كان منزله وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ حُنَفاءَ ويُقِيمُوا الصَّلاةَ ويُؤْتُوا الزَّكاةَ وذلِكَ دِينُ الْقَيِّمَةِ",
    "en": "Chapter Five Hundred and Three: Concerning the Gnosis of the State of a Pole (قطب) whose Station was: <<وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ حُنَفاءَ وَيُقِيمُوا الصَّلاةَ وَيُؤْتُوا الزَّكاةَ وَذَلِكَ دِينُ الْقَيِّمَةِ>> (And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion).",
    "ur": "باب پانچ سو تین: ایک قطب (Quṭb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) یہ تھا:\n\n\"حالانکہ انہیں صرف یہی حکم دیا گیا تھا کہ وہ اللہ کی عبادت کریں، دین کو اس کے لیے خالص کرتے ہوئے، یکسو (حُنَفاءَ) ہو کر، اور نماز قائم کریں اور زکوٰۃ ادا کریں، اور یہی سیدھا دین (دِينُ الْقَيِّمَةِ) ہے۔\" (سورۃ البینہ ۹۸: آیت ۵)",
    "fa": "باب پانصد و سوم در معرفت حال قطب، که منزل او این آیه است: «و فرمان نیافتند مگر برای آنکه خدا را بپرستند، در حالی که دین را برای او خالص گردانند و حق‌گرا باشند، و نماز را برپا دارند و زکات را بپردازند، و این است دین استوار.» (وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ حُنَفاءَ ويُقِيمُوا الصَّلاةَ ويُؤْتُوا الزَّكاةَ وذلِكَ دِينُ الْقَيِّمَةِ)"
  },
  "content": {
    "ar": "## «الباب الثالث وخمسمائة في معرفة حال قطب كان منزله وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ حُنَفاءَ ويُقِيمُوا الصَّلاةَ ويُؤْتُوا الزَّكاةَ وذلِكَ دِينُ الْقَيِّمَةِ»\n\n\n> الله يعلم أني لست أعلمه *** وكيف يعلم من بالعلم نجهله‏\n\n\n> إني علمت وجودا لا يقيده *** نعت بحق ولا خلق يفصله‏\n\n\n> علمي به حيرتي فيه فليس لنا *** دليل حق على علم نحصله‏\n\n\n> فليس إلا الذي جاء الرسول به *** في الحالتين وبالإيمان نقبله‏\n\n\n> فإن تفكرت في القرآن تبصره *** وقتا ينزهه وقتا يمثله‏\n\n\n### [سبب خلق الجن والإنس‏]\n\n\nقال الله تعالى أَلا لِلَّهِ الدِّينُ الْخالِصُ هذا الذكر على المشهد والمحتد فإن الله ما خلق الجن والإنس إلا ليعبدوه ما علل بغير هذا خالق العالم وما نعلم أحدا أخذ عبادة الخلق لنفسه أو لغير الله حتى يخلصها منه وقد علمنا صدق قوله في طلبه الإخلاص في العبادة فعلمنا أنه لا بد ثم من نسبة فيها إلى غير الله فلم نجد إلا نحن فنحن أصحاب الدعاوي فيما هو لله لأنه ما من شي‏ء إلا وهو ساجد لله والسجود عبادة إلا نحن ولذلك قال وكَثِيرٌ من النَّاسِ ولم يعم كما عم في كل من ذكر من الأنواع أ لا تراه تعالى ما أرسل رسولا إِلَّا بِلِسانِ قَوْمِهِ فالرسالة لله والأداء للرسول عليه السلام بلسان القوم‏\n\n\n> علم القرآن كيف ينزل *** في وجودي وعلى من ينزل‏\n\n\n> إنما ينزله الذكر به *** في قلوب كلهن منزل‏\n\n\n> ولكل منهم قسمته *** ليس في القرآن شي‏ء يفضل‏\n\n\n> فلنا منه المقام الأسهل *** ثم لله المقام الأجزل‏\n\n\n> هو قول الله واللفظ لنا *** وله الحكم العظيم الفيصل‏\n\n\nولكن الله قد أبان لنا أن هوية الحق سمع العبد وبصره وجميع قواه والعبد ما هو إلا بقواه فما هو إلا بالحق فظاهره صورة خلقية محدودة وباطنه هوية الحق غير محدودة للصورة فهو من حيث الصورة من جملة من يسبح بحمده وهو من حيث باطنه كما ذكرنا فالحق يسبح نفسه وأعطى المجموع معنى دقيقا غامضا لم يعطه كل واحد على الانفراد به وأضيف إلى الصورة ما أضيف من موافقة ومخالفة وطاعة ومعصية وبه قيل إنه مكلف وبه صحت القسمة في الصلاة بينه وبين الله فيقول العبد كذا فيقول الله كذا ولا يكون عبدا إلا بالمجموع فانظر ما حصل للحق من النعت لما وصف نفسه بأنه قوى العبد فما كان عبدا إلا به كما لم يكن الحق قواه إلا به لأن اسم العبد ما انطلق إلا على المجموع وقد أعلمنا الله من هو المجموع فيقول العبد الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ والحق لسانه والحق سمعه فمن قال الحمد لله ومن سمع قوله الحمد لله فيقول الله أثنى على عبدي ولكن بغير هذا اللسان القائل بل بهوية الحق مجردة عن الإضافة بهذا العبد في حال إضافتها إليه فلم يقل بالمجموع اثني على عبدي وما أثنى عليه إلا بكلامه فإن الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ كلام الله فبالمعنى المعلوم كانت العبارة عنه أثنيت على نفسي بصورة عبدي حكى عبدي عني من حيث صورته الظاهرة ما أثنيت به على نفسي كما ذكر لنا في غير هذا الموضع إن الله قال على لسان عبده سمع الله لمن حمده وقال لنبيه صَلَّى اللهُ عَليهِ وسَلَّم فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله‏\nوما سمع إلا صوت المؤدي وهو الرسول ونحن نعلم أن كلام العالم كله ليس إلا كلامه فإن العالم كله إنسان كبير كامل فحكمه حكم الإنسان وهوية الحق باطن الإنسان وقواه التي كان بها عبدا فهوية الحق قوى العالم التي كان بها إنسانا كبيرا عبدا مسبحا ربه تعالى‏\n\n\n> ألا كل قول في الوجود كلامه *** سواء علينا نثره ونظامه‏\n\n\n> يعم به إسماع كل مكون *** فمنه إليه بدؤه وختامه‏\n\n\n> ولا سامع غير الذي كان قائلا *** فمندرج في الجهر منه اكتتامه‏\n\n\n> فتستره ألفاظنا بحروفها *** فما فيه من ضوء فذاك ظلامه‏\n\n\n> فما ظنكم بالنور منه إذا بدا *** وقد ملأ الجو الفسيح غمامه‏\n\n\nلأنه القائل أَنْ يَأْتِيَهُمُ الله في ظُلَلٍ من الْغَمامِ ولما كان الأمر على ما ذكرناه في نفسه طلب منا أن نخلص العبادة له لأن بالعبادة نكون عبيدا وما نكون عبيدا إلا بهويته فنخلص العبودية وتخليصها أن نقول له أنت هو بأنانيتك وأنت هو في أنانيتي فما ثم إلا أنت فأنت المسمى ربا وعبدا إن لم يكن الأمر كذا فما أخلصنا له عبادة فما طلب الإخلاص فيها إلا من المجموع ولا يصح لها وجود ولا نسبة إلا بالمجموع لأنه بالانفراد غني عن العالمين وبالمجموع قال أَقْرِضُوا الله قَرْضاً حَسَناً فقيده بالإحسان وفسر لنا ما هو الإحسان وما فسره إلا بشهود المحدود المنصوب في القبلة فمعرفة الله بلسان الشارع المترجم عن الله غير معرفته بالنظر العقلي فللمعرفة بالله طريقان وأعني العلم بالله منا وإن شئت قلت ثلاث طرق الطريق الواحد علمنا به تعالى من حيث نظرنا الفكري وعلمنا به من حيث خطابه الشرعي وعلمنا به من حيث المجموع وأنا نعلم أنا لا نعلمه كما يعلم نفسه فهذا حصر المعرفة الحادثة بالله تعالى‏\n\n\n> فالحق عين العبد ليس سواه *** والحق غير العبد لست تراه‏\n\n\n> فانظر إليه به على مجموعه *** لا تفردنه فتستبيح حماه‏\n\n\n> هذا هو الحق الصريح فأخلصوا *** لله منك عبادة تلقاه‏\n\n\nأي تلقاه تلك العبادة وإن شئت قلت لله منه عبادة تلقاه فإنك ما أخذتها إلا به فمنه تخلصها له وأنت محل الظهور فالصورة لك والعين هويته كما قررنا في غير موضع أن الصور المعبر عنها بالعالم إحكام أعيان الممكنات في وجود الحق ولهذا يقال إن العالم ما استفاد الوجود إلا من الحق وهو الحدوث وهذا القدر كاف في تخليص العبادة لله فيكون الحق العابد من وجه المعبود من وجه بنسبتين مختلفتين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 503: Concerning the Knowledge of the State of a Pole (قطب) whose Station was [the verse]: <<And they were not commanded except to worship Allah, sincerely dedicating religion to Him, as *hunafa* (upright monotheists), and to establish prayer and give Zakat. That is the upright religion>> (Quran 98:5).\n\nAllah knows that I do not know Him,\nAnd how can one know Him whom we are ignorant of through knowledge?\n\nIndeed, I have known an Existence (وجود) that is not restricted\nby an Attribute (نعت) belonging to The Real (الحق) nor separated by Creation (خلق).\n\nMy knowledge of Him is my bewilderment concerning Him, for we have no\ntrue proof for the knowledge we attain.\n\nThus, there is nothing except that which the Messenger brought\nin both states, and we accept it through faith (الإيمان).\n\nIf you reflect upon the Quran, you will perceive Him\nsometimes transcending Him (تنزهه) and sometimes likening Him (تمثله).\n\n### [The Reason for the Creation of Jinn and Humans]\n\nAllah the Exalted said: <<Indeed, sincere devotion (الدِّينُ الْخالِصُ) belongs to Allah>> (Quran 39:3). This mention is based on the witnessing (المشهد) and the origin (المحتد). For Allah did not create the Jinn and Humans except that they might worship Him. The Creator of the World (خالق العالم) did not give any reason other than this. We do not know anyone who took the worship of creation for himself or for other than Allah, such that he would purify it from Him. We have known the truth of His saying in His demand for sincerity (الإخلاص) in worship. Thus, we know that there must be a relation (نسبة) in it to other than Allah. We found none but ourselves. Therefore, we are the claimants regarding what belongs to Allah, because there is nothing except that it prostrates to Allah, and prostration is worship—except for us. That is why He said: <<And many among mankind>> (Quran 22:18), and He did not generalize as He generalized concerning every type mentioned. Do you not see that He the Exalted did not send a Messenger <<except with the language of his people>> (Quran 14:4)? The Message (الرسالة) belongs to Allah, and the delivery (الأداء) belongs to the Messenger, peace be upon him, in the language of the people.\n\nKnowledge of the Quran, how it descends,\nis in my existence (وجودي) and upon whom it descends.\n\nThe Remembrance (الذكر) only causes it to descend through Him\ninto hearts, all of which are a place of descent.\n\nAnd for each of them is his portion;\nthere is nothing in the Quran that is superfluous.\n\nFor us, from it, is the easier station (المقام الأسهل),\nthen for Allah is the more magnificent station (المقام الأجزل).\n\nIt is the Word of Allah, but the utterance (اللفظ) is ours,\nand to Him belongs the great, decisive judgment (الحكم).\n\nHowever, Allah has made clear to us that the Identity of The Real (هوية الحق) is the servant’s hearing, his sight, and all his powers. The servant is nothing but his powers, so he is nothing but The Real (الحق). His exterior (ظاهره) is a limited created form (صورة خلقية محدودة), and his interior (باطنه) is the Identity of The Real, unlimited by the form. Thus, from the perspective of the form, he is among those who glorify Him with praise. And from the perspective of his interior, he is as we mentioned: The Real glorifies Himself. He granted the composite (المجموع) a subtle, obscure meaning that He did not grant to each individual separately.\n\nTo the form was attributed what was attributed of agreement and disagreement, obedience and disobedience. By this, it was said that he is obligated (مكلف). By this, the division in the Prayer (الصلاة) between him and Allah became valid, where the servant says such-and-such, and Allah says such-and-such. He is not a servant (عبد) except through the composite. Look at the Attribute (النعت) that The Real acquired when He described Himself as the servant’s powers. The servant was not a servant except through Him, just as The Real was not his powers except through him, because the name ‘servant’ is only applied to the composite. Allah has informed us who the composite is. The servant says: <<All praise belongs to Allah, Lord of the Worlds>> (Quran 1:2). The Real is his tongue, and The Real is his hearing. So, who said ‘All praise belongs to Allah,’ and who heard his saying ‘All praise belongs to Allah’? Allah says: \"My servant has praised Me,\" but not with this speaking tongue, rather with the Identity of The Real stripped of the attribution to this servant, even while it is attributed to him. Thus, He did not say, \"I praised My servant through the composite.\" He only praised him with His own speech, for <<All praise belongs to Allah, Lord of the Worlds>> is the Speech of Allah. Therefore, the expression concerning this, according to the known meaning, was: \"I praised Myself in the form of My servant. My servant, through his manifest form, related from Me that by which I praised Myself.\" This is as He mentioned to us elsewhere, that Allah said upon the tongue of His servant: \"Allah hears the one who praises Him.\" And He said to His Prophet, peace and blessings be upon him: <<Grant him protection until he hears the Word of Allah>> (Quran 9:6).\n\nYet, what was heard was only the voice of the deliverer, who is the Messenger. We know that the speech of the entire World (العالم) is nothing but His Speech, for the entire World is a great, Perfect Human (إنسان كبير كامل). Its ruling is the ruling of the human. The Identity of The Real is the interior (باطن) of the human and the powers by which he was a servant. Thus, the Identity of The Real is the powers of the World by which it was a great human, a servant glorifying his Lord, the Exalted.\n\nBehold, every utterance in Existence (الوجود) is His Speech,\nwhether it be prose or verse, it is the same to us.\n\nBy it, He encompasses the hearing of every existent thing (مكون),\nso from Him to Him is its beginning and its end.\n\nAnd there is no hearer other than the one who was the speaker,\nso His concealment is folded within His manifestation.\n\nOur words conceal Him with their letters,\nso whatever light is in it, that is His darkness.\n\nWhat then is your thought concerning the Light from Him when it appears,\nwhen His cloud has already filled the vast atmosphere?\n\nBecause He is the One who said: <<That Allah should come to them in the shadows of the clouds>> (Quran 2:210). Since the matter is as we have mentioned in itself, He demanded that we sincerely dedicate worship (العبادة) to Him, because through worship we become servants, and we are not servants except through His Identity (هويته). Thus, we sincerely dedicate servitude (العبودية). The purification of servitude is that we say to Him: \"You are He, by Your I-ness (أنانيتك), and You are He in my I-ness (أنانيتي). There is nothing there but You. So, You are the One named Lord and servant.\" If the matter were not so, we would not have sincerely dedicated worship to Him. He only demanded sincerity (الإخلاص) in it from the composite, and worship cannot have existence (وجود) or relation (نسبة) except through the composite. For by being singular (بالانفراد), He is independent of the worlds, and through the composite, He said: <<Lend Allah a goodly loan>> (Quran 73:20). He restricted it with *Ihsan* (Excellence/Goodness) and explained to us what *Ihsan* is. He only explained it through the witnessing (شهود) of the limited one (المحدود) established in the *Qibla*.\n\nThus, the gnosis of Allah (معرفة الله) through the tongue of the Lawgiver (الشارع) who translates from Allah is different from gnosis through rational speculation (النظر العقلي). There are two paths to the knowledge (العلم) of Allah originating from us—or if you wish, three paths: The first path is our knowledge of Him the Exalted from the perspective of our intellectual contemplation; the second is our knowledge of Him from the perspective of His legal discourse (خطابه الشرعي); and the third is our knowledge of Him from the perspective of the composite (المجموع). We know that we do not know Him as He knows Himself. This is the limitation of contingent gnosis (المعرفة الحادثة) concerning Allah the Exalted.\n\nThe Real (الحق) is the very essence (*ayn*) of the servant, He is none other than him,\nyet The Real is other than the servant, you do not see Him.\n\nSo look upon Him through Him, upon His composite (مجموعه),\ndo not isolate Him, lest you violate His sanctuary.\n\nThis is the manifest Truth (الحق الصريح), so sincerely dedicate\nto Allah, from yourself, a worship (عبادة) that will meet Him.\n\nThat is, that worship will meet Him. Or if you wish, say: \"To Allah, from Him, is a worship that will meet Him.\" For you did not take it except through Him, so from Him you purify it for Him. You are the locus of manifestation (محل الظهور), so the form is yours, but the essence (*ayn*) is His Identity (هويته), as we established elsewhere: the forms expressed as the World (العالم) are the confirmation of the Fixed Entities (الأعيان الثابتة) of the possibles within the Existence (وجود) of The Real. For this reason, it is said that the World did not gain Existence except from The Real, and that is contingency (الحدوث). This much is sufficient for the sincere dedication of worship to Allah, such that The Real is the worshipper from one perspective and the worshipped from another, through two different relations (نسبتين مختلفتين). And Allah <<speaks the Truth, and He guides to the way>> (Quran 33:4).",
    "ur": "باب نمبر پانچ سو تین: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور انہیں صرف یہی حکم دیا گیا تھا کہ وہ اللہ کی عبادت کریں، دین کو اس کے لیے خالص کرتے ہوئے، یکسو ہو کر، اور نماز قائم کریں اور زکوٰۃ ادا کریں، اور یہی سیدھا دین ہے\" (وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ وَذَلِكَ دِينُ الْقَيِّمَةِ)۔\n\nاللہ جانتا ہے کہ میں اسے نہیں جانتا،\nاور وہ کیسے جان سکتا ہے جسے ہم علم کے ذریعے بھی نہیں جان پاتے۔\n\nمیں نے ایک ایسی ہستی (الوجود) کو جانا ہے جسے\nنہ کوئی صفت حق (الحق) کی قید کر سکتی ہے اور نہ کوئی مخلوق اسے جدا کر سکتی ہے۔\n\nمیرا علم اس کے بارے میں میری حیرت ہے، پس ہمارے پاس\nکوئی حقیقی دلیل نہیں ہے اس علم پر جسے ہم حاصل کرتے ہیں۔\n\nپس وہی ہے جو رسول لے کر آئے ہیں،\nدونوں حالتوں میں، اور ہم اسے ایمان کے ساتھ قبول کرتے ہیں۔\n\nاگر تم قرآن میں غور کرو تو تم اسے دیکھو گے،\nایک وقت وہ اسے تنزیہہ (پاکیزگی) دیتا ہے اور ایک وقت وہ اس کی تمثیل (مثال) بیان کرتا ہے۔\n\n### [جنوں اور انسانوں کی تخلیق کا سبب]\n\nاللہ تعالیٰ نے فرمایا: \"خبردار! خالص دین اللہ ہی کے لیے ہے\" (أَلَا لِلَّهِ الدِّينُ الْخَالِصُ)۔ یہ ذکر مشاہدہ (المشہد) اور اصل پر مبنی ہے، کیونکہ اللہ نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا ہے۔ خالق عالم نے اس کے علاوہ کوئی اور وجہ بیان نہیں کی۔ اور ہم نہیں جانتے کہ کسی نے مخلوق کی عبادت اپنے لیے یا اللہ کے علاوہ کسی اور کے لیے لی ہو تاکہ وہ اسے اس سے خالص کرے۔ اور ہم نے عبادت میں اخلاص (الإخلاص) کے مطالبے میں اس کے قول کی سچائی کو جان لیا، لہٰذا ہم نے جان لیا کہ اس میں لازماً کوئی نسبت غیر اللہ کی طرف بھی ہے، اور ہم نے اپنے سوا کسی کو نہیں پایا۔ پس ہم ہی ان دعووں کے مالک ہیں جو اللہ کے لیے ہیں، کیونکہ ہر چیز اللہ کو سجدہ کرتی ہے، اور سجدہ عبادت ہے، سوائے ہمارے۔ اسی لیے اس نے فرمایا: \"اور لوگوں میں سے بہت سے\" (وَكَثِيرٌ مِّنَ النَّاسِ)، اور اس نے عمومیت اختیار نہیں کی جیسا کہ اس نے ہر اس نوع میں عمومیت اختیار کی جس کا ذکر کیا گیا۔ کیا تم نہیں دیکھتے کہ اللہ تعالیٰ نے کوئی رسول نہیں بھیجا \"مگر اس کی قوم کی زبان میں\" (إِلَّا بِلِسَانِ قَوْمِهِ)؟ پس رسالت اللہ کے لیے ہے اور ادائیگی رسول علیہ السلام کی طرف سے قوم کی زبان میں ہے۔\n\nقرآن نے جانا کہ وہ کیسے نازل ہوتا ہے،\nمیری ہستی (الوجود) میں اور کس پر نازل ہوتا ہے۔\n\nذکر (اللہ کا) ہی اسے نازل کرتا ہے،\nان دلوں میں جو سب کے سب اس کے لیے منزل ہیں۔\n\nاور ان میں سے ہر ایک کا اپنا حصہ ہے،\nقرآن میں کوئی چیز زائد نہیں ہے۔\n\nپس ہمارے لیے اس میں سے آسان مقام ہے،\nپھر اللہ کے لیے سب سے عظیم مقام ہے۔\n\nوہ اللہ کا قول ہے اور لفظ ہمارے ہیں،\nاور اسی کے لیے عظیم فیصلہ کن حکم ہے۔\n\nلیکن اللہ نے ہمارے لیے واضح کر دیا ہے کہ ذات حق (الحق) کی ہویت (الهویۃ) بندے کی سماعت، اس کی بصارت اور اس کی تمام قوتیں ہیں۔ اور بندہ اپنی قوتوں کے بغیر کچھ نہیں، لہٰذا وہ ذات حق (الحق) کے بغیر کچھ نہیں۔ پس اس کا ظاہر ایک محدود تخلیقی صورت ہے اور اس کا باطن ذات حق (الحق) کی ہویت (الهویۃ) ہے جو اس صورت کے لیے غیر محدود ہے۔ پس وہ صورت کے اعتبار سے ان میں شامل ہے جو اس کی حمد کے ساتھ تسبیح کرتے ہیں، اور باطن کے اعتبار سے وہ ویسا ہی ہے جیسا کہ ہم نے ذکر کیا۔ پس ذات حق (الحق) اپنی تسبیح خود کرتا ہے، اور اس نے مجموعہ (المجموع) کو ایک دقیق اور پوشیدہ معنی عطا کیا جو اس نے ہر ایک کو انفرادی طور پر عطا نہیں کیا۔ اور اس صورت کے ساتھ موافقت، مخالفت، اطاعت اور نافرمانی کا اضافہ کیا گیا، اور اسی کی وجہ سے کہا گیا کہ وہ مکلف ہے۔ اور اسی کی وجہ سے نماز میں اس کے اور اللہ کے درمیان تقسیم درست ہوئی، پس بندہ یہ کہتا ہے اور اللہ یہ کہتا ہے۔ اور وہ مجموعہ (المجموع) کے بغیر بندہ نہیں ہو سکتا۔ پس دیکھو کہ ذات حق (الحق) کو کیا صفت حاصل ہوئی جب اس نے اپنے آپ کو بندے کی قوتیں قرار دیا، پس وہ اس کے بغیر بندہ نہیں تھا، جیسا کہ ذات حق (الحق) اس کے بغیر اس کی قوتیں نہیں تھا۔ کیونکہ عبد (العبد) کا نام صرف مجموعہ (المجموع) پر ہی بولا جاتا ہے۔ اور اللہ نے ہمیں بتا دیا ہے کہ مجموعہ (المجموع) کون ہے، پس بندہ کہتا ہے: \"تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے\" (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)، اور ذات حق (الحق) اس کی زبان ہے اور ذات حق (الحق) اس کی سماعت ہے۔ پس کس نے کہا \"الحمد للہ\" اور کس نے اس کے قول \"الحمد للہ\" کو سنا؟ پس اللہ فرماتا ہے: میرے بندے نے میری ثنا کی۔ لیکن یہ اس کہنے والی زبان سے نہیں، بلکہ ذات حق (الحق) کی ہویت (الهویۃ) کے ذریعے جو اس بندے کے ساتھ اضافت کے باوجود اس اضافت سے مجرد ہے۔ پس اس نے مجموعہ (المجموع) کے ذریعے یہ نہیں کہا کہ میں نے اپنے بندے کی ثنا کی، اور اس نے اس کی ثنا صرف اپنے کلام کے ذریعے کی، کیونکہ \"تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے\" (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ) اللہ کا کلام ہے۔ پس معلوم معنی کے اعتبار سے اس کی تعبیر یہ ہوئی کہ میں نے اپنے بندے کی صورت میں اپنی ثنا کی، میرے بندے نے اپنی ظاہری صورت کے اعتبار سے میری طرف سے وہ بیان کیا جس سے میں نے اپنی ثنا کی، جیسا کہ اس نے ہمیں اس کے علاوہ کسی اور مقام پر بتایا کہ اللہ نے اپنے بندے کی زبان پر کہا: \"اللہ نے سن لیا جس نے اس کی حمد کی\" (سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ)، اور اپنے نبی صلی اللہ علیہ وسلم سے فرمایا: \"پس اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے\" (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ)۔\n\nاور اس نے صرف پہنچانے والے کی آواز سنی، اور وہ رسول ہیں۔ اور ہم جانتے ہیں کہ تمام عالم کا کلام اس کے کلام کے سوا کچھ نہیں، کیونکہ سارا عالم ایک بڑا انسان کامل (الإنسان الکامل) ہے، پس اس کا حکم انسان کا حکم ہے۔ اور ذات حق (الحق) کی ہویت (الهویۃ) انسان کا باطن اور اس کی قوتیں ہیں جن کے ذریعے وہ بندہ بنا۔ پس ذات حق (الحق) کی ہویت (الهویۃ) عالم کی قوتیں ہیں جن کے ذریعے وہ ایک بڑا انسان، ایک بندہ، اپنے رب کی تسبیح کرنے والا بنا۔\n\nخبردار! ہستی (الوجود) میں ہر قول اسی کا کلام ہے،\nخواہ وہ نثر ہو یا نظم، ہمارے لیے برابر ہے۔\n\nوہ اس کے ذریعے ہر مخلوق کی سماعت کو عام کرتا ہے،\nپس اسی سے اس کی ابتدا ہے اور اسی کی طرف اس کا اختتام ہے۔\n\nاور کہنے والے کے سوا کوئی سننے والا نہیں،\nپس اس کے جہر (اعلانیہ) میں اس کا چھپنا (اكتتامه) شامل ہے۔\n\nپس ہمارے الفاظ اسے اپنے حروف سے چھپا لیتے ہیں،\nتو جو روشنی اس میں ہے وہ اس کا اندھیرا ہے۔\n\nپس تم اس کے نور کے بارے میں کیا گمان کرتے ہو جب وہ ظاہر ہو،\nجبکہ اس کے بادل نے وسیع فضا کو بھر رکھا ہے۔\n\nکیونکہ وہ ہی فرمانے والا ہے: \"کہ اللہ ان کے پاس بادلوں کے سائے میں آئے\" (أَنْ يَأْتِيَهُمُ اللَّهُ فِي ظُلَلٍ مِّنَ الْغَمَامِ)۔ اور جب معاملہ اپنی ذات میں ویسا ہی ہے جیسا کہ ہم نے ذکر کیا، تو اس نے ہم سے مطالبہ کیا کہ ہم عبادت کو اس کے لیے خالص کریں، کیونکہ عبادت کے ذریعے ہی ہم بندے بنتے ہیں، اور ہم اس کی ہویت (الهویۃ) کے بغیر بندے نہیں بن سکتے۔ پس ہم عبودیت کو خالص کرتے ہیں، اور اس کا خالص کرنا یہ ہے کہ ہم اس سے کہیں: تو ہی وہ ہے اپنی انانیت (ذاتیت) کے ساتھ، اور تو ہی وہ ہے میری انانیت میں۔ پس وہاں تیرے سوا کوئی نہیں، پس تو ہی رب اور بندہ کہلاتا ہے۔ اگر معاملہ ایسا نہ ہو تو ہم نے اس کے لیے عبادت کو خالص نہیں کیا۔ پس اس نے اس میں اخلاص (الإخلاص) کا مطالبہ صرف مجموعہ (المجموع) سے کیا، اور اس کا وجود اور نسبت مجموعہ (المجموع) کے بغیر درست نہیں ہو سکتی، کیونکہ انفرادیت میں وہ تمام جہانوں سے بے نیاز ہے، اور مجموعہ (المجموع) کے ذریعے اس نے فرمایا: \"اللہ کو اچھا قرض دو\" (أَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا)، پس اس نے اسے احسان کے ساتھ مقید کیا، اور ہمارے لیے احسان کی تفسیر کی، اور اس نے اس کی تفسیر قبلہ میں نصب شدہ محدود کے شہود (الشہود) کے سوا کسی اور چیز سے نہیں کی۔ پس اللہ کی معرفت (المعرفۃ) شارع کی زبان سے جو اللہ کی طرف سے ترجمانی کرتا ہے، عقلی نظر سے حاصل ہونے والی معرفت سے مختلف ہے۔ پس اللہ کی معرفت (المعرفۃ) کے دو راستے ہیں، اور میرا مطلب ہے ہماری طرف سے اللہ کا علم۔ اور اگر تم چاہو تو کہہ سکتے ہو کہ تین راستے ہیں: پہلا راستہ ہمارا علم اس کے بارے میں ہماری فکری نظر کے اعتبار سے، اور ہمارا علم اس کے بارے میں اس کے شرعی خطاب کے اعتبار سے، اور ہمارا علم اس کے بارے میں مجموعہ (المجموع) کے اعتبار سے۔ اور ہم جانتے ہیں کہ ہم اسے ویسا نہیں جانتے جیسا وہ خود کو جانتا ہے۔ پس یہ حادث (مخلوق) معرفت (المعرفۃ) کا اللہ کے بارے میں احاطہ ہے۔\n\nپس ذات حق (الحق) بندے کی عین (حقیقت) ہے، اس کے سوا کوئی نہیں،\nاور ذات حق (الحق) بندے کے علاوہ ہے، تم اسے نہیں دیکھ سکتے۔\n\nپس اس کی طرف اس کے ذریعے اس کے مجموعہ (المجموع) پر نظر ڈالو،\nاسے اکیلا نہ کرو ورنہ تم اس کی حرمت کو پامال کر دو گے۔\n\nیہ صریح حق (الحق) ہے، پس اللہ کے لیے\nاپنی طرف سے ایسی عبادت کو خالص کرو کہ تم اسے پاؤ۔\n\nیعنی تم اس عبادت کو پاؤ گے، اور اگر تم چاہو تو کہہ سکتے ہو کہ اللہ کے لیے اس کی طرف سے ایسی عبادت جو تم اسے پاؤ۔ کیونکہ تم نے اسے اس کے بغیر حاصل نہیں کیا، پس اسی کی طرف سے تم اسے اس کے لیے خالص کرتے ہو، اور تم ظہور (التجلی) کا محل ہو۔ پس صورت تمہاری ہے اور عین (حقیقت) اس کی ہویت (الهویۃ) ہے، جیسا کہ ہم نے دوسرے مقام پر یہ طے کیا ہے کہ وہ صورتیں جنہیں عالم سے تعبیر کیا جاتا ہے، وہ ذات حق (الحق) کی ہستی (الوجود) میں ممکنات کے اعیان کا حکم ہیں۔ اور اسی لیے کہا جاتا ہے کہ عالم نے ہستی (الوجود) ذات حق (الحق) سے ہی حاصل کی ہے، اور یہی حدوث ہے۔ اور یہ مقدار اللہ کے لیے عبادت کو خالص کرنے کے لیے کافی ہے، پس ذات حق (الحق) ایک نسبت سے عابد ہوتا ہے اور دوسری نسبت سے معبود۔ اور \"اللہ حق (الحق) فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و سوم در معرفت حال قطبی که منزل او این آیه بود: «وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ وَذَلِكَ دِينُ الْقَيِّمَةِ» (و فرمان نیافتند مگر برای آنکه خدا را بپرستند، در حالی که دین را برای او خالص گردانند و حق‌گرا باشند، و نماز را برپا دارند و زکات را بپردازند؛ و این است دین استوار).\n\nخداوند می‌داند که من او را نمی‌شناسم،\nو چگونه بشناسد کسی که ما او را با علم، نادان می‌شماریم؟\nمن هستی‌ای (الوجود) را شناختم که هیچ وصفی از حق (الحق) آن را محدود نمی‌کند،\nو هیچ خلقی آن را جدا نمی‌سازد.\nعلم من به او، حیرت من در اوست؛ پس ما را\nدلیل حقی بر علمی که به دست آوریم، نیست.\nپس نیست مگر آنچه رسول آورده است،\nدر هر دو حالت، و ما آن را با ایمان می‌پذیریم.\nاگر در قرآن بیندیشی، او را می‌بینی\nکه گاهی او را تنزیه می‌کند و گاهی تمثیل می‌نماید.\n\n### [سبب آفرینش جن و انس]\n\nخداوند متعال فرمود: «أَلَا لِلَّهِ الدِّينُ الْخَالِصُ» (آگاه باشید که دین خالص از آن خداست). این ذکر بر اساس مشهد (المشهد) و اصل است؛ زیرا خداوند جن و انس را نیافرید مگر برای آنکه او را بپرستند. آفریننده عالم، آفرینش را به غیر از این تعلیل نکرده است. و ما کسی را نمی‌شناسیم که عبادت خلق را برای خود یا برای غیر خدا گرفته باشد تا آن را از او خالص گرداند. ما صدق قول او را در طلب اخلاص (الإخلاص) در عبادت دانستیم، پس دانستیم که ناگزیر در آن نسبتی به غیر خدا وجود دارد. و ما جز خودمان را نیافتیم. پس ما مدعیان اموری هستیم که از آنِ خداست؛ زیرا هیچ چیزی نیست مگر آنکه برای خدا سجده می‌کند و سجده عبادت است، جز ما. و به همین دلیل فرمود: «وَكَثِيرٌ مِنَ النَّاسِ» (و بسیاری از مردم)، و تعمیم نداد، چنانکه در مورد سایر انواع ذکر شده تعمیم داد. آیا نمی‌بینی که خداوند متعال هیچ رسولی را نفرستاد مگر «إِلَّا بِلِسَانِ قَوْمِهِ» (مگر به زبان قومش)؟ پس رسالت از آنِ خداست و ابلاغ آن از سوی رسول (علیه السلام) به زبان قوم است.\n\nقرآن می‌داند چگونه نازل می‌شود،\nدر هستی (الوجود) من و بر چه کسی نازل می‌شود.\nهمانا ذکر (الذکر) آن را به واسطه او نازل می‌کند،\nدر دل‌هایی که همگی منزلگاه هستند.\nو برای هر یک از آنان سهمی است،\nچیزی در قرآن برتری ندارد.\nپس مقام آسان‌تر از آنِ ماست،\nو سپس مقام عظیم‌تر از آنِ حق (الحق) است.\nآن کلام خداست و لفظ از آنِ ماست،\nو حکم بزرگ و جداکننده از آنِ اوست.\n\nاما خداوند برای ما آشکار ساخته است که هویت (الهوية) حق (الحق)، شنوایی بنده و بینایی او و تمامی قوای اوست. و بنده جز به قوای خود نیست، پس او جز به حق نیست. ظاهر او صورتی خلقی و محدود است و باطن او هویت (الهوية) حق است که برای صورت، نامحدود است. پس او از حیث صورت، از جمله کسانی است که به حمد او تسبیح می‌گویند، و از حیث باطن، چنان است که ذکر کردیم؛ پس حق، خود را تسبیح می‌گوید. و به این مجموعه، معنایی دقیق و پنهان عطا کرد که به هر یک از اجزا به تنهایی عطا نکرده است. و به این صورت، آنچه از موافقت و مخالفت و طاعت و معصیت اضافه شد، اضافه گشت. و به واسطه آن گفته شد که او مکلف است، و به واسطه آن تقسیم در نماز بین او و خداوند صحیح شد؛ که بنده چنین می‌گوید و خداوند چنین می‌فرماید. و بنده جز به این مجموعه نیست. پس بنگر که چه وصفی برای حق حاصل شد هنگامی که خود را به قوای بنده بودن وصف کرد. پس بنده جز به او نبود، چنانکه حق نیز قوای او نبود مگر به واسطه او؛ زیرا نام بنده جز بر این مجموعه اطلاق نمی‌شود. و خداوند ما را آگاه ساخت که این مجموعه کیست. پس بنده می‌گوید: «الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ» (ستایش از آنِ خدا، پروردگار جهانیان است)، در حالی که حق، زبان او و حق، شنوایی اوست. پس چه کسی گفت: «الحمد لله» و چه کسی شنید که او می‌گوید: «الحمد لله»؟ خداوند می‌فرماید: بنده من مرا ستود. اما نه با این زبان گوینده، بلکه با هویت (الهوية) حق که از اضافه به این بنده مجرد است، در عین حال که به او اضافه شده است. پس نگفت: با این مجموعه، بنده من مرا ستود. و او را ستایش نکرد مگر با کلام خود؛ زیرا «الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ» کلام خداست. پس با معنای معلوم، عبارت از آن چنین بود: خود را در صورت بنده خود ستودم. بنده من از حیث صورت ظاهری‌اش، آنچه را که من خود را با آن ستودم، از من حکایت کرد. چنانکه در غیر این موضع برای ما ذکر کرد که خداوند بر زبان بنده خود فرمود: «سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ» (خداوند شنید کسی را که او را ستود). و به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ» (پس او را پناه ده تا کلام خدا را بشنود).\n\nو او نشنید مگر صدای ابلاغ‌کننده که همان رسول است. و ما می‌دانیم که تمام کلام عالم جز کلام او نیست؛ زیرا تمام عالم، انسان بزرگ کامل (الإنسان الکامل) است. پس حکم آن، حکم انسان است. و هویت (الهوية) حق، باطن انسان و قوای اوست که به واسطه آن‌ها بنده بود. پس هویت (الهوية) حق، قوای عالم است که به واسطه آن‌ها انسان بزرگی بود که بنده و تسبیح‌گوی پروردگار متعال خود بود.\n\nآگاه باشید که هر قولی در هستی (الوجود)، کلام اوست،\nنثر و نظم آن برای ما یکسان است.\nبا آن، شنوایی هر موجودی را فرا می‌گیرد،\nپس آغاز و انجام آن از اوست و به سوی او.\nو شنونده‌ای جز آنکه گوینده بود، نیست،\nپس پنهان شدنش در آشکار شدنش نهفته است.\nالفاظ ما آن را با حروف خود می‌پوشانند،\nپس آنچه در آن از نور است، همان تاریکی اوست.\nپس گمان شما به نور او چیست هنگامی که آشکار شود،\nدر حالی که فضای گسترده را ابر او پر کرده است؟\n\nزیرا اوست که فرمود: «أَنْ يَأْتِيَهُمُ اللَّهُ فِي ظُلَلٍ مِنَ الْغَمَامِ» (که خداوند در سایه‌هایی از ابر بر آنان بیاید). و چون امر بر همان منوال بود که در ذات خود ذکر کردیم، از ما خواست که عبادت را برای او خالص گردانیم؛ زیرا با عبادت، بنده می‌شویم، و بنده نمی‌شویم مگر به هویت (الهوية) او. پس عبودیت را خالص می‌کنیم، و خالص کردن آن این است که به او بگوییم: تو اویی با انانیت (خودیت) خودت، و تو اویی در انانیت من. پس در آنجا جز تو نیست. پس تویی که رب و عبد نامیده می‌شوی. اگر امر چنین نباشد، ما عبادتی را برای او خالص نکرده‌ایم. پس اخلاص (الإخلاص) در آن را جز از مجموعه نخواست، و وجود و نسبتی برای آن صحیح نیست مگر به واسطه مجموعه؛ زیرا او به تنهایی از جهانیان بی‌نیاز است، و با مجموعه فرمود: «أَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا» (به خدا قرض نیکو دهید). پس آن را به احسان مقید کرد، و برای ما تفسیر کرد که احسان چیست. و آن را تفسیر نکرد مگر به شهود (الشهود) محدودِ نصب شده در قبله. پس معرفت (المعرفة) خداوند به زبان شارع که مترجم از جانب خداست، غیر از معرفت او با نظر عقلی است. پس برای معرفت (المعرفة) به خداوند دو راه است، و منظورم علم ما به خداست. و اگر بخواهی، بگو سه راه: راه اول، علم ما به او تعالی از حیث نظر فکری ما؛ و علم ما به او از حیث خطاب شرعی او؛ و علم ما به او از حیث مجموعه. و ما می‌دانیم که او را نمی‌شناسیم آن‌گونه که خود را می‌شناسد. پس این، حصر معرفت (المعرفة) حادث به خداوند متعال است.\n\nپس حق (الحق) عین بنده است و غیر او نیست،\nو حق غیر بنده است و تو او را نمی‌بینی.\nپس به او بنگر، به واسطه او، بر مجموعه او،\nاو را تنها مگذار که حریم او را مباح سازی.\nاین همان حق صریح است، پس خالص گردانید\nعبادتی را که از تو برای خداست تا او را ملاقات کنی.\n\nیعنی آن عبادت او را ملاقات می‌کند. و اگر بخواهی بگو: عبادتی که از او برای خداست، او را ملاقات می‌کنی. زیرا تو آن را جز به واسطه او نگرفتی، پس از اوست که آن را برای او خالص می‌گردانی. و تو محل ظهور هستی، پس صورت از آنِ توست و عین، هویت (الهوية) اوست. چنانکه در جای دیگر مقرر داشتیم که صورت‌هایی که به عالم تعبیر می‌شوند، تثبیت اعیان ممکنات در هستی (الوجود) حق (الحق) است. و به همین دلیل گفته می‌شود که عالم هستی (الوجود) را جز از حق (الحق) به دست نیاورده است، و آن همان حدوث است. و این مقدار برای خالص کردن عبادت برای خدا کافی است. پس حق (الحق) از یک جهت عابد است و از جهت دیگر معبود، با دو نسبت متفاوت. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}