{
  "id": 536,
  "title": {
    "ar": "الباب السادس والثلاثون وخمسمائة في معرفة حال قطب كان هجيره ومن كانَ يُرِيدُ حَرْثَ الدُّنْيا نُؤْتِهِ مِنْها وما لَهُ في الْآخِرَةِ من نَصِيبٍ",
    "en": "Chapter Five Hundred and Thirty-Six: Concerning the knowledge of the state (حال) of a Pole (قطب) whose constant preoccupation (هجيره) was [the meaning of the verse]: <<And whoever desires the cultivation of the world, We grant him thereof, and he shall have no share in the Hereafter.>>",
    "ur": "باب پانچ سو چھتیس: ایک قطب (Qutb) کے حال کی معرفت (Ma'rifa) کے بیان میں جس کا مستقل مشغلہ یہ تھا: \"اور جو کوئی دنیا کی کھیتی چاہتا ہے، ہم اسے اس میں سے دے دیتے ہیں، اور آخرت میں اس کا کوئی حصہ نہیں ہوگا۔\" (وَمَنْ كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي الْآخِرَةِ مِنْ نَصِيبٍ)",
    "fa": "باب پانصد و سی و ششم در معرفت حال قطبی (قطب) که مشغله او این بود: «وَمَنْ كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي الْآخِرَةِ مِنْ نَصِيبٍ» (و هر کس کشت دنیا را بخواهد، از آن به او می‌دهیم، و او را در آخرت بهره‌ای نیست)."
  },
  "content": {
    "ar": "## «الباب السادس والثلاثون وخمسمائة في معرفة حال قطب كان هجيره ومن كانَ يُرِيدُ حَرْثَ الدُّنْيا نُؤْتِهِ مِنْها وما لَهُ في الْآخِرَةِ من نَصِيبٍ»\n\n\n> الحرث حرثان محمود ومذموم *** وأنت حارثه والرزق مقسوم‏\n\n\n> لا تحرثن لدنيا أنت تتركها *** فإن حرثت لها فأنت مذموم‏\n\n\n> لا تحرثن لما يفنى فلست له *** واحرث لباقيه فالأمر مفهوم‏\n> واحذر من الركن لا تركن لفانية *** تزول عنك فمكر الله معلوم‏\n\n\n> من حيث علمك يأتيك إلا له به *** فلا تثق بوجود فهو معدوم‏\n\n\n> واحرث لآخرة إن كنت ذا نظر *** كمثل من هو بالخيرات موسوم‏\n\n\n### [الحسنة حرث الآخرة في الدنيا]\n\n\nقال الله تبارك وتعالى من جاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثالِها والحسنة حرث الآخرة في الدنيا ف من كانَ يُرِيدُ حَرْثَ الْآخِرَةِ نَزِدْ لَهُ في حَرْثِهِ فنوفقه للعمل الصالح فلا يزال ينتقل من خير إلى خير في خير فمن حسنة إلى حسنة فإذا كسب الآخرة نال ما اقتضاه العمل والزيادة\n\n\nما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\nوهو ذوق فهذه زيادة الحرث في الآخرة فينال في الآخرة جميع أغراضه كلها وزيادة ما لم يبلغه غرضه سألت بعض الشيوخ من أهل العلم ما الزيادة في قوله تعالى لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ فقال لي الزيادة ما لم يخطر بالبال فعلمت ما أراد فلم أزده وحرث الدنيا ليس كذلك فإنه منزل لا يمكن في وضع مزاجه أن ينال أحد فيه جميع أغراضه يقول الله تعالى إِنَّكَ لا تَهْدِي من أَحْبَبْتَ ولقد حرص بعمه أبي طالب أن يؤمن فلم يفعل ونفذت فيه سابقة علم الله وحكمه فهذا يقتضيه حال هذه الدار كما إن الآخرة يقتضي حالها نيل جميع الأغراض من غير توقف وأعني بالآخرة الجنة ومن دخلها لا أريد يوم الحشر لأن الله يقول في الأشقياء فَما تَنْفَعُهُمْ شَفاعَةُ الشَّافِعِينَ وإن القيامة أحكامها مقصورة عليها علمنا ذلك كشفا وإيمانا\n\n\n### [أن كل شي‏ء عند خزائن الله‏]\n\n\nوأعلم تعالى أن كل شي‏ء عنده خزائنه وما ينزله في الدنيا إِلَّا بِقَدَرٍ مَعْلُومٍ فإذا كان في الآخرة عاد الحكم فيما تحوي عليه هذه الخزائن التي عند الله إلى العبد العارف الذي كمل الله سعادته فيدخل فيها متحكما فيخرج منها ما يشاء بغير حساب ولا قدر معلوم بل يحكم ما يختاره في الوقت وهو أن المسعود في الآخرة يعطى التكوين ويكشف له عن نفسه أنه عين الخزانة التي عند الله فإنه عند الله فكل ما خطر له تكوينه كونه فلا يزال في الآخرة خلاقا دائما فارتفع التقدير فهو يتبوأ من الجنة حيث يشاء لا حيث يمشي به فإنه في الجنة ارتفع عنه الافتقار العرضي إلى الأشياء وما بقي عنده إلا الفقر إلى الله خاصة وإنما ارتفع عن المسعود الافتقار العرضي لما فيه من الذلة والانكسار والحاجة والجنة ليس بمحل لذلك فإن محل ذلك عموما في الدنيا ومحله في الآخرة النار وكذلك الذلة فإن الحق لا يتجلى لهم قط في الاسم المذل فلا يذلون أبدا وكذلك لا يتجلى لهم في الاسم العزيز من الوجه الذي لو تجلى لهم فيه لذلوا وإنما يكسوهم الله حلة العزة به على الأمور التي يكونونها لا على أهليهم ولا على من عندهم فلا سلطان لهم ولا عز إلا فيما يتكون عنهم ولا يتكون عنهم شي‏ء إلا منهم فيشهدون الأمر قبل تكوينه فيتعلق بهم إرادة تكوين ذلك الأمر فعين التعلق عين كينونته وما يتأخر عنه فأمره أسرع من لمح البصر فانظر في هذا المنزل ما أعطاك فيه هذا الذكر من الفوائد الجمة الإلهية واعلم أن للدنيا أبناء وللآخرة أبناء وللمجموع أبناء وما نبه غيرنا على أبناء المجموع فالسعيد من جمع بين البنوتين فهو الوارث المكمل وهو القريب البعيد والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 536: Concerning the Knowledge of the State of a Pole (قطب) Whose Concern Was the Verse: <<And whoever desires the cultivation of this world, We shall give him thereof, and he shall have no share in the Hereafter>>\n\nThe cultivation (الحرث) is two kinds: praiseworthy and blameworthy,\nAnd you are its cultivator, and the provision (الرزق) is apportioned.\nDo not cultivate for a world (دنيا) you will leave,\nFor if you cultivate for it, then you are blameworthy.\nDo not cultivate for what perishes (يفنى), for you are not for it,\nBut cultivate for what remains (لباقيه), for the matter is understood.\nAnd beware of reliance (الركن); do not rely on what is transient,\nWhich will pass away from you, for the cunning (مكر) of Allah is known.\nIt comes to you from the perspective of your knowledge (علمك), except that He has it,\nSo do not trust in an existence (وجود) that is non-existent (معدوم).\nAnd cultivate for the Hereafter (لآخرة) if you possess insight (ذا نظر),\nLike one who is marked by good deeds (بالخيرات).\n\n### [The Good Deed (الحسنة) is the Cultivation of the Hereafter in the World (الدنيا)]\n\nAllah, the Blessed and Exalted, said: <<Whoever comes with a good deed, he shall have ten like it>>. And the good deed is the cultivation of the Hereafter in the world. So, <<Whoever desires the cultivation of the Hereafter, We shall increase for him in his cultivation>>. Thus, We grant him success (توفيق) in righteous action, and he continuously moves from good to good within goodness, from one good deed to another. When he earns the Hereafter, he attains what the action necessitated, plus the increase (الزيادة): that which no eye has seen, nor ear heard, nor has occurred to the heart of man. This is direct experience (ذوق). This is the increase in cultivation in the Hereafter. Thus, in the Hereafter, he attains all his objectives entirely, plus an increase that his objective did not reach.\n\nI asked some of the Shaykhs (شيوخ) among the people of Knowledge (أهل العلم) about the increase in His saying, the Exalted: <<For those who have done good is the best reward (al-husna) and increase (wa ziyadah)>>. He told me: \"The increase is that which has not occurred to the mind.\" So I understood what he meant and did not ask him further.\n\nThe cultivation of the world (حرث الدنيا) is not like that, for it is a dwelling whose inherent nature (وضع مزاجه) makes it impossible for anyone to attain all their objectives within it. Allah the Exalted says: <<Indeed, you do not guide whom you love>>. He (the Prophet) was eager for his uncle Abu Talib to believe, but he did not, and the precedence of Allah's Knowledge (علم الله) and His Decree (حكمه) was executed upon him. This is necessitated by the state of this abode (the world), just as the state of the Hereafter necessitates the attainment of all objectives without hindrance. By the Hereafter, I mean Paradise (الجنة) and those who enter it, not the Day of Gathering (يوم الحشر), because Allah says concerning the wretched (الأشقياء): <<So the intercession of the intercessors will not benefit them>>. And the rulings of the Resurrection (القيامة) are restricted to it; we know this through Unveiling (كشف) and faith (إيمان).\n\n### [That Everything is in the Treasuries of Allah (خزائن الله)]\n\nAnd know that the Exalted One has the treasuries (خزائنه) of everything with Him, and He does not send it down into the world (الدنيا) <<except by a known measure>> (بِقَدَرٍ مَعْلُومٍ). When it is the Hereafter, the ruling concerning what these treasuries held by Allah contain reverts to the Gnostic servant (العبد العارف) whose felicity (سعادته) Allah has perfected. He enters them, exercising control, and brings forth from them whatever he wills, without reckoning or known measure. Rather, he decrees what he chooses at that moment.\n\nThis means that the felicitous one (المسعود) in the Hereafter is granted the power of bringing into existence (التكوين), and it is unveiled to him concerning his own self that he is the very essence (عين) of the Treasury that is with Allah, for he is with Allah. Thus, everything that occurs to him to bring into existence, he brings it into existence. He remains perpetually a creator (خلاقا دائما) in the Hereafter. Therefore, the limitation (التقدير) is lifted. He settles in Paradise (الجنة) wherever he wills, not where he is led by movement. For in Paradise, the contingent need (الافتقار العرضي) for things is lifted from him, and nothing remains with him except poverty (الفقر) toward Allah specifically.\n\nThe contingent need was lifted from the felicitous one because it involves humiliation (الذلة), brokenness (الانكسار), and want (الحاجة). And Paradise is not the place for that, for the place for that generally is the world (الدنيا), and its place in the Hereafter is the Fire (النار). Likewise, humiliation: The Real (الحق) never discloses Himself to them through the Name 'The Humiliator' (المذل), so they are never humiliated. Nor does He disclose Himself to them through the Name 'The Mighty' (العزيز) in the aspect that, were He to disclose Himself through it, they would be humiliated. Rather, Allah clothes them with the robe of Might (العزة) through Him, concerning the matters they bring into existence, not over their families or those who are with them. So they have no authority (سلطان) or might except in what comes into existence through them. And nothing comes into existence through them except from them. They witness the matter before its existence, and the will (إرادة) to bring that matter into existence attaches to them. The very essence of the attachment is the very essence of its existence, and what follows it—its affair is swifter than the blink of an eye.\n\nLook, therefore, in this station (منزل) at the abundant Divine benefits (الفوائد الجمة الإلهية) that this mention has granted you. And know that the world (الدنيا) has children, and the Hereafter (الآخرة) has children, and the totality (المجموع) has children. And no one other than us has drawn attention to the children of the totality. So the felicitous one (السعيد) is he who combines the two sonships; he is the perfected inheritor (الوارث المكمل), and he is the near-far one. And Allah <<says the Truth, and He guides to the Way>>.",
    "ur": "باب نمبر ۵۳۶: اس قطب کے حال کی معرفت میں جس کا وظیفہ یہ تھا: \"اور جو شخص دنیا کی کھیتی چاہتا ہے تو ہم اسے اس میں سے کچھ دے دیتے ہیں، اور آخرت میں اس کا کوئی حصہ نہیں\" (وَمَنْ كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي الْآخِرَةِ مِنْ نَصِيبٍ)۔\n\nکھیتی دو طرح کی ہے: محمود اور مذموم (قابل تعریف اور قابل مذمت)\nاور تو ہی اس کا کاشتکار ہے، جبکہ رزق تقسیم شدہ ہے۔\n\nاس دنیا کے لیے کھیتی نہ کر جسے تو چھوڑنے والا ہے،\nاگر تو نے اس کے لیے کھیتی کی تو تو مذموم ہے۔\n\nاس چیز کے لیے کھیتی نہ کر جو فنا ہونے والی ہے، کیونکہ تو اس کا نہیں ہے۔\nاور باقی رہنے والی چیز کے لیے کھیتی کر، کیونکہ معاملہ واضح ہے۔\n\nاور بھروسہ کرنے سے بچ، کسی فانی چیز پر بھروسہ نہ کر،\nجو تجھ سے زائل ہو جائے گی، کیونکہ اللہ کی تدبیر معلوم ہے۔\n\nجہاں سے تیرا علم آتا ہے، وہیں سے اس کا ظہور ہوتا ہے،\nپس کسی ہستی (الوجود) پر بھروسہ نہ کر، کیونکہ وہ معدوم ہے۔\n\nاور اگر تو صاحبِ نظر ہے تو آخرت کے لیے کھیتی کر،\nاس شخص کی طرح جو نیکیوں سے مزین ہے۔\n\n### [نیکی دنیا میں آخرت کی کھیتی ہے]\n\nاللہ تبارک و تعالیٰ نے فرمایا: \"جو شخص نیکی لائے گا تو اسے اس کے دس گنا ملے گا\" (مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا)۔ اور نیکی دنیا میں آخرت کی کھیتی ہے۔ پس \"جو شخص آخرت کی کھیتی چاہتا ہے تو ہم اس کی کھیتی میں اضافہ کر دیتے ہیں\" (مَنْ كَانَ يُرِيدُ حَرْثَ الْآخِرَةِ نَزِدْ لَهُ فِي حَرْثِهِ)۔ تو ہم اسے عمل صالح کی توفیق دیتے ہیں، اور وہ مسلسل ایک خیر سے دوسرے خیر کی طرف، خیر میں ہی منتقل ہوتا رہتا ہے، پس ایک نیکی سے دوسری نیکی کی طرف۔ جب وہ آخرت کما لیتا ہے تو اسے وہ سب کچھ ملتا ہے جو عمل کا تقاضا تھا اور اس پر اضافہ بھی:\n\nجو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی انسان کے دل پر اس کا خیال گزرا۔\n\nاور یہ ذوق (روحانی چکھنا) ہے۔ پس یہ آخرت میں کھیتی کا اضافہ ہے۔ چنانچہ وہ آخرت میں اپنے تمام مقاصد کو مکمل طور پر حاصل کر لیتا ہے، اور اس پر وہ اضافہ بھی جو اس کے مقصد تک نہیں پہنچا تھا۔ میں نے بعض اہل علم شیوخ سے پوچھا کہ اللہ تعالیٰ کے اس فرمان میں \"زیادہ\" سے کیا مراد ہے: \"جن لوگوں نے نیکی کی ان کے لیے بھلائی ہے اور زیادہ بھی\" (لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ)؟ تو انہوں نے مجھے بتایا کہ زیادتی وہ ہے جو دل میں بھی نہ گزری ہو۔ پس میں نے جان لیا کہ ان کا کیا ارادہ تھا، اور میں نے اس پر مزید اضافہ نہیں کیا۔ اور دنیا کی کھیتی ایسی نہیں ہے، کیونکہ یہ ایک ایسا ٹھکانہ ہے جس کی ساخت میں یہ ممکن نہیں کہ کوئی شخص اس میں اپنے تمام مقاصد حاصل کر سکے۔ اللہ تعالیٰ فرماتا ہے: \"بیشک آپ جسے چاہیں ہدایت نہیں دے سکتے\" (إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ)۔ اور آپ صلی اللہ علیہ وسلم نے اپنے چچا ابو طالب کے ایمان لانے کی شدید خواہش کی، مگر انہوں نے ایسا نہیں کیا، اور ان پر اللہ کے سابقہ علم اور حکم کا نفاذ ہوا۔ پس یہ اس دنیا کے حال کا تقاضا ہے، جیسا کہ آخرت کا حال تمام مقاصد کا بلا توقف حصول کا تقاضا کرتا ہے۔ اور آخرت سے میری مراد جنت ہے اور وہ جو اس میں داخل ہو، نہ کہ روزِ حشر، کیونکہ اللہ تعالیٰ بدبختوں کے بارے میں فرماتا ہے: \"تو انہیں شفاعت کرنے والوں کی شفاعت کوئی فائدہ نہ دے گی\" (فَمَا تَنْفَعُهُمْ شَفَاعَةُ الشَّافِعِينَ)۔ اور قیامت کے احکام صرف اسی پر محدود ہیں، ہم نے یہ بات کشف (الکشف) اور ایمان کے ذریعے جانی ہے۔\n\n### [بیشک ہر چیز اللہ کے خزانوں کے پاس ہے]\n\nاور اللہ تعالیٰ نے آگاہ فرمایا کہ ہر چیز اس کے خزانوں کے پاس ہے، اور وہ اسے دنیا میں \"مگر ایک معلوم اندازے کے ساتھ ہی نازل کرتا ہے\" (إِلَّا بِقَدَرٍ مَعْلُومٍ)۔ جب آخرت ہو گی تو ان خزانوں کا حکم جو اللہ کے پاس ہیں، اس عارف (العارف) بندے کی طرف لوٹ جائے گا جس کی سعادت اللہ نے مکمل کر دی ہے۔ پس وہ ان خزانوں میں حاکم بن کر داخل ہو گا، اور جو چاہے گا بغیر حساب اور بغیر معلوم اندازے کے ان سے نکالے گا۔ بلکہ وہ اس وقت جو چاہے گا حکم دے گا، اور وہ یہ ہے کہ آخرت میں سعادت مند کو تکوین (پیدا کرنے کی طاقت) عطا کی جائے گی، اور اس پر اس کی اپنی ذات کا کشف (الکشف) کیا جائے گا کہ وہ اللہ کے پاس موجود خزانوں کا عین ہے۔ کیونکہ وہ اللہ کے پاس ہے۔ پس جو چیز بھی اس کے دل میں پیدا کرنے کا خیال آئے گا، وہ اسے پیدا کر دے گا۔ چنانچہ وہ آخرت میں ہمیشہ خالق (خلاق) رہے گا۔ پس تقدیر (اندازہ) ختم ہو جائے گا۔ وہ جنت میں جہاں چاہے گا ٹھکانہ بنائے گا، نہ کہ جہاں اسے چلایا جائے گا۔ کیونکہ جنت میں اس سے اشیاء کی طرف عارضی محتاجی ختم ہو چکی ہے، اور اس کے پاس صرف اللہ کی طرف خاص فقر باقی ہے۔ اور سعادت مند سے عارضی محتاجی اس لیے ختم ہو گئی کہ اس میں ذلت، انکسار اور حاجت شامل ہوتی ہے، اور جنت اس کا محل نہیں ہے۔ کیونکہ اس کا محل عموماً دنیا ہے، اور آخرت میں اس کا محل دوزخ ہے۔ اسی طرح ذلت بھی، کیونکہ ذات حق (الحق) ان پر کبھی بھی اسم \"المذل\" (ذلیل کرنے والا) کے ذریعے ظہور الٰہی (التجلی) نہیں فرماتا، لہٰذا وہ کبھی ذلیل نہیں ہوں گے۔ اور نہ ہی ان پر اسم \"العزیز\" (غالب) کے ذریعے اس پہلو سے ظہور الٰہی (التجلی) فرماتا ہے کہ اگر اس پہلو سے ظہور ہو تو وہ ذلیل ہو جائیں۔ بلکہ اللہ انہیں ان امور پر اپنی عزت کی پوشاک پہناتا ہے جنہیں وہ خود پیدا کرتے ہیں، نہ کہ اپنے اہل و عیال پر اور نہ ہی ان لوگوں پر جو ان کے پاس ہیں۔ پس ان کے لیے کوئی سلطنت اور عزت نہیں مگر صرف ان چیزوں میں جو ان سے وجود میں آتی ہیں، اور ان سے کوئی چیز وجود میں نہیں آتی مگر ان ہی کی طرف سے۔ پس وہ کسی امر کے وجود میں آنے سے پہلے ہی اس کا شہود (الشہود) کرتے ہیں، تو اس امر کو وجود میں لانے کا ارادہ ان سے متعلق ہو جاتا ہے، اور یہ تعلق ہی اس کا عین وجود (کینونت) ہے۔ اور جو اس سے مؤخر ہوتا ہے، تو اس کا امر پلک جھپکنے سے بھی زیادہ تیز ہوتا ہے۔ پس اس ٹھکانے میں غور کر کہ اس ذکر نے تجھے کتنے عظیم الٰہی فوائد عطا کیے ہیں۔ اور جان لے کہ دنیا کے بیٹے ہیں، اور آخرت کے بیٹے ہیں، اور مجموع (دونوں کے درمیان) کے بھی بیٹے ہیں۔ اور ہمارے علاوہ کسی نے مجموع کے بیٹوں پر متنبہ نہیں کیا۔ پس سعادت مند وہ ہے جو دونوں بیٹوں کو جمع کر لے، وہی مکمل وارث ہے، اور وہی قریب بعید ہے۔ اور اللہ حق کہتا ہے اور وہی سیدھا راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و سی و ششم در معرفت حال قطبی که ذکرش (هجیرش) این بود: «و هر کس کشت دنیا را بخواهد، از آن به او می‌دهیم و او را در آخرت بهره‌ای نیست.» (وَمَنْ كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي الْآخِرَةِ مِنْ نَصِيبٍ)\n\nکشت دو نوع است: ستوده و نکوهیده؛\nو تو کشاورز آنی و روزی تقسیم شده است.\n\nبرای دنیایی که آن را ترک می‌کنی، کشت مکن؛\nاگر برای آن کشت کنی، تو نکوهیده‌ای.\n\nبرای آنچه فانی می‌شود کشت مکن، زیرا تو از آن نیستی؛\nو برای باقی (بقا) کشت کن، که این امر فهمیده شده است.\nو از تکیه کردن بپرهیز، به فانی‌ای که از تو زایل می‌شود تکیه مکن،\nزیرا مکر (تدبیر) خداوند معلوم است.\n\nاز آنجا که علم تو می‌آید، مگر آنکه او (حق) برای آن باشد؛\nپس به هستی‌ای (الوجود) که معدوم است، اعتماد مکن.\n\nو اگر صاحب بصیرت هستی، برای آخرت کشت کن؛\nمانند کسی که به نیکی‌ها نشان‌دار شده است.\n\n### [نیکی، کشت آخرت در دنیاست]\n\nخداوند تبارک و تعالی فرمود: «هر کس کار نیکی (حسنه) بیاورد، ده برابر آن پاداش دارد.» (مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا) و نیکی، کشت آخرت در دنیاست. پس «هر کس کشت آخرت را بخواهد، بر کشت او می‌افزاییم.» (فَمَنْ كَانَ يُرِيدُ حَرْثَ الْآخِرَةِ نَزِدْ لَهُ فِي حَرْثِهِ) پس او را برای عمل صالح موفق می‌گردانیم و پیوسته از خیری به خیر دیگر در خیر منتقل می‌شود، یعنی از نیکی‌ای به نیکی دیگر. پس هنگامی که آخرت را به دست آورد، به آنچه عملش اقتضا کرده و نیز به افزایشی که «هیچ چشمی ندیده و هیچ گوشی نشنیده و بر قلب هیچ بشری خطور نکرده است» نائل می‌شود.\n\nو این همان ذوق است. این افزایش کشت در آخرت است، پس در آخرت به تمام مقاصد خود و افزون بر آنچه مقصودش به آن نرسیده، نائل می‌شود. از برخی مشایخ اهل علم درباره «زیاده» در این فرموده خداوند متعال پرسیدم: «برای کسانی که نیکی کردند، نیکی (بهشت) و افزونی (زیادة) است.» (لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ) او به من گفت: زیاده، چیزی است که به ذهن خطور نکرده باشد. پس آنچه را اراده کرده بود دانستم و بر آن نیفزودم (قانع شدم).\n\nو کشت دنیا این‌گونه نیست، زیرا دنیا منزلی است که در ساختار مزاجی‌اش ممکن نیست کسی در آن به تمام مقاصد خود برسد. خداوند متعال می‌فرماید: «تو کسی را که دوست داری هدایت نمی‌کنی.» (إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ) و پیامبر (ص) بر ایمان آوردن عمویش ابوطالب حریص بود، اما او ایمان نیاورد و علم سابق و حکم خداوند در مورد او جاری شد. این مقتضای حال این سرا (دنیا) است، همان‌طور که حال آخرت اقتضای نیل به تمام مقاصد از غیر توقف را دارد. و منظورم از آخرت، بهشت و کسی است که وارد آن می‌شود، نه روز حشر؛ زیرا خداوند درباره بدبختان (اشقیاء) می‌فرماید: «پس شفاعت شفاعت‌کنندگان به حالشان سودی نمی‌دهد.» (فَمَا تَنْفَعُهُمْ شَفَاعَةُ الشَّافِعِينَ) و احکام قیامت منحصر به خود آن است. ما این را از طریق کشف (الکشف) و ایمان دانسته‌ایم.\n\n### [اینکه هر چیزی نزد خزانه‌های خداوند است]\n\nو خداوند متعال آگاه است که خزانه‌های هر چیزی نزد اوست و آن را در دنیا نازل نمی‌کند «مگر به اندازه‌ای معلوم.» (إِلَّا بِقَدَرٍ مَعْلُومٍ) اما هنگامی که در آخرت باشد، حکم آنچه این خزانه‌های نزد خداوند در بر دارند، به بنده عارف (المعرفة) که خداوند سعادتش را کامل کرده است، باز می‌گردد. پس او در آن خزانه‌ها با تسلط وارد می‌شود و آنچه را بخواهد بدون حساب و بدون اندازه‌ای معلوم از آن خارج می‌سازد، بلکه آنچه را در آن لحظه انتخاب می‌کند، حکم می‌کند.\n\nو آن این است که به سعادتمند در آخرت، قدرت تکوین (ایجاد) داده می‌شود و برای او کشف (الکشف) می‌شود که او عین همان خزانه‌ای است که نزد خداوند است، زیرا او نزد خداوند است. پس هر آنچه به ذهنش خطور کند که ایجاد شود، آن را ایجاد می‌کند و پیوسته در آخرت آفریننده‌ای دائمی است، پس تقدیر (اندازه‌گیری) برداشته شده است. پس او در بهشت هر جا که بخواهد منزل می‌گیرد، نه آنجا که او را به آنجا ببرند؛ زیرا در بهشت، نیاز عَرَضی به اشیاء از او برداشته شده است و نزد او جز فقر (نیاز) خاص به خداوند باقی نمانده است.\n\nو نیاز عَرَضی از سعادتمند برداشته شده است، زیرا در آن خواری، شکستگی و حاجت وجود دارد و بهشت جایگاه این امور نیست. زیرا جایگاه عمومی این امور در دنیاست و جایگاه آن در آخرت، آتش (جهنم) است. و همچنین خواری؛ زیرا حق (الحق) هرگز در اسم «مُذِلّ» (خوارکننده) بر آنان تجلی (التجلی) نمی‌کند، پس هرگز خوار نمی‌شوند. و همچنین در اسم «عزیز» (عزت‌بخش) از آن وجهی که اگر بر آنان تجلی می‌کرد، خوار می‌شدند، تجلی نمی‌کند.\n\nبلکه خداوند بر آنان جامه عزت را به واسطه اموری که خود ایجاد می‌کنند، می‌پوشاند، نه بر خانواده‌هایشان و نه بر کسانی که نزدشان هستند. پس آنان سلطنت و عزتی ندارند مگر در آنچه از ایشان ایجاد می‌شود، و چیزی از ایشان ایجاد نمی‌شود مگر از خودشان. پس امر را پیش از تکوین (ایجاد) آن شهود (الشهود) می‌کنند و اراده تکوین آن امر به ایشان تعلق می‌گیرد، و عین این تعلق، عین وجود یافتن آن است. و آنچه از آن تأخیر کند، امرش سریع‌تر از چشم بر هم زدن است. پس بنگر که این ذکر در این منزل چه فواید الهی فراوانی به تو بخشیده است.\n\nو بدان که دنیا فرزندانی دارد، و آخرت فرزندانی دارد، و مجموع (دنیا و آخرت) فرزندانی دارد، و جز ما کسی بر فرزندان مجموع آگاه نساخته است. پس سعادتمند کسی است که میان این دو فرزندی جمع کند، او وارث کامل‌کننده و همان نزدیکِ دور است. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}