{
  "id": 511,
  "title": {
    "ar": "الباب الأحد عشر وخمسمائة في معرفة حال قطب كان منزله إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً واتَّقُوا الله ويُعَلِّمُكُمُ الله",
    "en": "Chapter Five Hundred and Eleven: Concerning the knowledge of the state of a Pole (قطب) whose station was [the meaning of the verses]: <<إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً>> (If you fear Allah, He will grant you a Criterion) and <<واتَّقُوا الله ويُعَلِّمُكُمُ الله>> (And fear Allah; and Allah teaches you).",
    "ur": "باب پانچ سو گیارہ: ایک قطب (Quṭb) کے حال (Ḥāl) کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) یہ تھا: \"اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) پیدا کر دے گا\" (إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً) اور \"اور اللہ سے ڈرتے رہو، اور اللہ تمہیں سکھاتا ہے\" (واتَّقُوا الله ويُعَلِّمُكُمُ الله)",
    "fa": "باب پانصد و یازدهم در شناخت حال قطبی (قطب) که منزل او این بود: «إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً» (اگر از خدا پروا کنید، برای شما فرقان (تشخیص حق از باطل) قرار می‌دهد) و «واتَّقُوا الله ويُعَلِّمُكُمُ الله» (و از خدا پروا کنید و خدا به شما می‌آموزد)."
  },
  "content": {
    "ar": "## (الباب الأحد عشر وخمسمائة في معرفة حال قطب كان منزله إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً واتَّقُوا الله ويُعَلِّمُكُمُ الله)\n\n\n> ومن يتق الله يجعل له *** كما قال من أمره فارقا\n\n\n> فيعلم منه ضلال الهدى *** ونور الهدى هاديا سائقا\n\n\n> ويظهر في شرقه غاربا *** ويطلع في غربه شارقا\n\n\n> ويصبح في كل علم له *** على كل شخص به فائقا\n\n\n> فكان لفتق الهدى راتقا *** وكان لرتق الهدى فاتقا\n\n\n> لنقسمه بين أبنائه *** فيرقوا به جبلا حالقا\n\n\n> وتبصره في مناجاته *** إذا قام فيها به ناطقا\n\n\n> فينشئها مثله نشأة *** يكون بها في الورى خالقا\n\n\n> ويخزن أ أرضها قوتها *** فيعلمه خالقا رازقا\n\n\n### [الفرقان حصل للمتقين‏]\n\n\nاعلم أيدنا الله وإياك بروح القدس أن المتقي بمجرد تقواه قد حصل في الفرقان إذ لو لم يفرق ما اتقى‏\n\n\n> فالأمر ما بين محمود ومذموم *** فالأمر ما بين محبوب ومكروه‏\n\n\n> فكن وقايته في كل مكروه *** يكن وقايتكم في كل مألوه‏\n\n\n> واجعله في كل محبوب وقايتكم *** وكن به بين تنزيه وتشبيه‏\n\n\n> منزه الحق لا يدري بذاك ولا *** مشبه الحق لا يدري وأدريه‏\n> فمن ينزهه عنه يشبهه *** به فهذا الذي قد قلته فيه‏\n\n\nوذلك أن الإنسان لا يخلو أن يجعل معبوده مثلا أو ضدا أو خلافا وعلى كل وجه فقد فرق بين الله وبين العالم فهذا الفرقان الذي تعطيه التقوى لا بد أن يكون فرقانا خاصا وليس سوى الفرقان الذي يكون في عين القرآن فإن القرآن يتضمن الفرقان بذاته وإنما نسب الجعل إلى هذا الفرقان لأن التقوى أنتجه فأما أن يكون جعله ظهوره لمن اتقاه مع كونه لم يزل موجود العين قبل ظهوره أو يكون جعله خلقه فيه بعد أن لم يكن وما هو إلا الظهور دون الخلق فإنه أعقبه بقوله ويُكَفِّرُ عَنْكُمْ أي يستروا لستر ضد الظهور فلا يخلو العبد في تقواه ربه أن يجعل نفسه وقاية له عن كل مذموم ينسب إليه أو يجعل ربه وقاية له عن كل شدة لا يطيق حملها إلا به وهو لا حول ولا قوة إلا بالله وهو قوله وإِيَّاكَ نَسْتَعِينُ فيلتقي به شدائد الأمور التي هي محبوبة لله مكروهة طبعا كما تجعل نفسك وقاية له تنفي بها عنه كل مذموم شرعا محمود محبوب طبعا فينتج لك كونه وقاية لك علم كل شدة فتتجلى لك أسماؤها الإلهية كلها بتفاصيلها وأنواعها وهذا من الفرقان وينتج لك كونك وقاية له كل مذموم ومكروه فتتجلى لك أسماؤه الإلهية كلها بتفاصيلها وأنواعها وهذا من الفرقان فيحمدك الله في الحالتين‏\n\n\n### [إن الله اعطى العلم لمحبيه‏]\n\n\nفإن الله لا يعطي العلم إلا من يحب وقد يعطي الحال من يحب ومن لا يحب فإن العلم ثابت والحال زائلة ولو لا الفرقان الذي في عين التقوى ما أنتج التقوى فرقانا فإن الشي‏ء لا ينتج إلا مثله ولا يكون إلا ذلك ولهذا كان العالم على صورة الحق فمن غلب عليه طبعه كان شبهه بأمه أقوى من شبهه بأبيه ومن غلب عليه عقله كان شبهه بأبيه أقوى من شبهه بأمه لأن العالم بين الطبيعة والحق وبين الوجود والعدم فما هو وجود خالص ولا عدم خالص فالعالم كله سحر يخيل إليك أنه حق وليس بحق ويخيل إليك أنه خلق وليس بخلق إذ ليس بخلق من كل وجه وليس بحق من كل وجه فإنا لا نشك في المسحور فيما يراه أن ثم مرئيا ولا بد كما قال يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏ فالسعي مرئي بلا شك وبقي الشأن فيمن هو الساعي فإن الحبال على بابها ملقاة في الأرض والعصي فيعلم قطعا إن الخلق لو تجرد عن الحق ما كان ولو كان عين الحق ما خلق ولهذا يقبل الخلق الحكمين ويقبل الحق أيضا الحكمين فقبل صفات الحدوث شرعا وقبل صفات القدم شرعا وعقلا فهو المنزه المشبه وقبل الخلق الحكمين وهما أنه جمع بين نسبة الأثر له في الحق بما أعطاه من العلم به كما ذكرناه في غير موضع وبين نسبة الأثر فيه من الحق وهو أنه أوجده ولم يكن شيئا أي لم يكن موجودا فالفرقان لم يزل في نفس الأمر ولكن ما ظهر لكل أحد في كل حال من الأحوال‏\n\n\n> في كل حال من الأحوال فرقان *** أتى بذلك تشريع وبرهان‏\n\n\nوهذا الفرقان الذي أنتجه التقوى لا يكون إلا بتعليم الله ليس للنظر الفكري فيه طريق غيره فإن أعطاه الله الإصابة في النظر الفكري فما هو هذا العلم الخاص فإن الطريق تميز العلوم المشتبهة بالصورة المختلفة بالذوق وأُتُوا به مُتَشابِهاً فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 511: Concerning the Knowledge of the State of a Pole Whose Station Was <<If you fear Allah, He will grant you a Criterion>> and <<And fear Allah; and Allah teaches you>>\n\n> And whoever fears Allah (has Taqwa), He grants him,\n> As He said, a criterion (fariq) from His command.\n> Through it, he knows the error of guidance,\n> And the light of guidance, guiding and driving.\n> He appears setting in its East,\n> And rises shining in its West.\n> And he becomes, in every knowledge he possesses,\n> Superior through it over every person.\n> He was a mender (ratiq) for the tearing of guidance,\n> And a tearer (fatiq) for the mending of guidance.\n> So that we may divide it among his children,\n> And they may ascend by it a towering mountain.\n> And you see him in his intimate converse (مناجاته),\n> When he stands in it, speaking through Him.\n> So he originates it as an origination like Him,\n> By which he becomes a creator (خالق) among mankind.\n> And He stores the sustenance (qut) of its earth,\n> So He teaches him as Creator (Khaliq) and Provider (Raziq).\n\n### [The Criterion is attained by the Pious]\n\nKnow—may Allah support us and you with the Holy Spirit (روح القدس)—that the pious one (المتقي), merely by virtue of his piety (تقواه), has attained the Criterion (الفرقان), for had he not discerned (فرق), he would not have been pious (اتقى).\n\n> The matter is between praiseworthy and blameworthy,\n> The matter is between beloved and disliked.\n> Be His protection (wiqaya) in every disliked thing,\n> He will be your protection in every object of worship (ma’luh).\n> And make Him your protection in every beloved thing,\n> And be through Him between transcendence (تنزيه) and similitude (تشبيه).\n> The one who transcends The Real (الحق) does not know that,\n> Nor does the one who likens The Real know, but I know it.\n> For whoever transcends Him away from it, likens Him\n> to it; this is what I have said concerning Him.\n\nThis is because a human being inevitably makes his object of worship either a likeness (mithl), an opposite (didd), or a difference (khilaf). In every case, he has discerned (farraqa) between Allah and the World (العالم). This Criterion (الفرقان) granted by piety (التقوى) must be a specific Criterion, and it is none other than the Criterion that resides in the very essence (عين) of the Quran. For the Quran inherently contains the Criterion by its very Essence (بذاته).\n\nThe attribution of the ‘granting’ (جعل) to this Criterion is only because piety produced it. The granting could either be its manifestation (ظهوره) to the one who is pious, despite its essence having always existed before its manifestation, or the granting could be its creation (خلقه) within him after it was nonexistent. However, it is only the manifestation (الظهور), not the creation.\n\nFor He followed it with His saying: <<and He will remit your sins (يُكَفِّرُ عَنْكُمْ)>>—meaning, He covers them, which is the covering of the opposite of manifestation. The servant, in his piety toward his Lord, must either make himself a protection (وقاية) for Him against every blameworthy thing attributed to Him, or make his Lord a protection for himself against every hardship (shidda) he cannot bear except through Him. This is the meaning of \"There is no power nor strength except with Allah,\" and it is His saying: <<You alone we ask for help (وإِيَّاكَ نَسْتَعِينُ)>>.\n\nThus, through Him, he meets the severe matters (shada’id al-umur) which are beloved to Allah but naturally disliked, just as you make yourself a protection for Him, thereby negating from Him everything blameworthy according to the Law (shar’an) but naturally praiseworthy and beloved. This results in His being a protection for you, granting the knowledge of every hardship, so that all His Divine Names (أسماؤها الإلهية) are disclosed to you in their details and types—and this is part of the Criterion (الفرقان). And your being a protection for Him against everything blameworthy and disliked results in all His Divine Names being disclosed to you in their details and types—and this is part of the Criterion. Thus, Allah praises you in both states.\n\n### [Indeed, Allah grants Knowledge to those He loves]\n\nIndeed, Allah grants Knowledge (العلم) only to those He loves, although He may grant a spiritual state (الحال) to those He loves and those He does not love. For Knowledge is permanent (ثابت), while the spiritual state is transient (زائلة). Were it not for the Criterion (الفرقان) residing in the very essence (عين) of piety (التقوى), piety would not produce a criterion, for a thing only produces its like, and it can only be that way. This is why the World (العالم) is upon the form (sura) of The Real (الحق).\n\nSo, whoever is dominated by his nature (tab’) has a resemblance to his mother stronger than his resemblance to his father. And whoever is dominated by his intellect (‘aql) has a resemblance to his father stronger than his resemblance to his mother. This is because the World (العالم) is between Nature and The Real, and between Existence (الوجود) and Nonexistence (العدم). Thus, it is neither pure Existence nor pure Nonexistence.\n\nThe entire World (العالم) is magic (sihr); it is imagined for you that it is The Real (الحق), yet it is not The Real, and it is imagined for you that it is creation (خلق), yet it is not creation, for it is not creation in every respect, nor is it The Real in every respect. We do not doubt that the bewitched person, in what he sees, necessarily sees something visible, just as He said: <<it seemed to him, by their magic, that they were running (يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى)>>. The running is undoubtedly visible, but the question remains concerning who the runner is.\n\nFor the ropes are cast upon the ground at their door, and the staffs are there. It is known with certainty that if creation (الخلق) were stripped bare of The Real (الحق), it would not exist; and if it were the very Essence (عين) of The Real, it would not have been created. For this reason, creation accepts the two judgments, and The Real also accepts the two judgments. He accepted the attributes of origination (huduth) legally (shar’an), and He accepted the attributes of eternity (qidam) legally and intellectually. Thus, He is the Transcendent (المنزه) and the Similar (المشبه).\n\nAnd creation accepted the two judgments: namely, that it combines the attribution of the effect (athar) to itself in The Real—by virtue of the Knowledge (العلم) The Real granted it, as we mentioned elsewhere—and the attribution of the effect in it from The Real, which is that He brought it into existence when it was nothing, meaning, it was not existent.\n\nThe Criterion (الفرقان) has always been in the matter itself (fi nafs al-amr), but it has not manifested to everyone in every state (حال) of the states.\n\n> In every state of the states there is a Criterion,\n> The Law (tashri’) and the proof (burhan) came with that.\n\nThis Criterion (الفرقان) produced by piety (التقوى) is only attained through the teaching of Allah; there is no path for intellectual speculation (النظر الفكري) to it other than this. If Allah grants him correctness in intellectual speculation, that is not this specific Knowledge (العلم الخاص). For the path is the distinguishing of sciences that are similar in form but different in taste (ذوق), <<and they were given it in resemblance (مُتَشابِهاً)>>. Know this, and Allah <<speaks the Truth (الْحَقَّ) and He guides to the way (السَّبِيلَ)>>.",
    "ur": "باب پانچ سو گیارہ: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (امتیاز) پیدا کر دے گا\" (إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً) اور \"اللہ سے ڈرو اور اللہ تمہیں سکھائے گا\" (واتَّقُوا الله ويُعَلِّمُكُمُ الله)۔\n\nجو شخص اللہ سے تقویٰ اختیار کرتا ہے، اللہ اس کے لیے\nجیسا کہ اس نے فرمایا، اپنے امر میں فرق کرنے والا (فارقا) بنا دیتا ہے۔\n\nپس وہ اس (فرقان) کے ذریعے ہدایت کی گمراہی کو جانتا ہے\nاور ہدایت کے نور کو رہنمائی کرنے والا اور چلانے والا جانتا ہے۔\n\nاور وہ اس کے مشرق میں غروب ہوتا ہوا ظاہر ہوتا ہے\nاور اس کے مغرب میں طلوع ہوتا ہوا نکلتا ہے۔\n\nاور وہ ہر علم میں اس (فرقان) کے سبب\nہر شخص پر غالب آ جاتا ہے۔\n\nپس وہ ہدایت کے پھٹے ہوئے کو سینے والا (راتق) تھا\nاور ہدایت کے سلے ہوئے کو کھولنے والا (فاتق) تھا۔\n\nتاکہ ہم اسے اس کے بیٹوں میں تقسیم کر دیں\nاور وہ اس کے ذریعے بلند پہاڑ پر چڑھ جائیں۔\n\nاور تو اسے اس کی مناجات میں دیکھے گا\nجب وہ اس میں اس (فرقان) کے ذریعے بولنے والا بن کر کھڑا ہوتا ہے۔\n\nپس وہ اسے اسی کی مانند ایک نشأت (پیدائش) دیتا ہے\nجس کے ذریعے وہ مخلوق میں خالق (پیدا کرنے والا) بن جاتا ہے۔\n\nاور وہ زمین کی قوت کو ذخیرہ کرتا ہے\nپس وہ اسے خالق (پیدا کرنے والا) اور رازق (رزق دینے والا) سکھاتا ہے۔\n\n### [فرقان (الفرقان) متقیوں کو حاصل ہوا]\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس کے ذریعے تائید بخشے، کہ متقی (المتقي) محض اپنے تقویٰ (التقوى) کی وجہ سے فرقان (الفرقان) میں داخل ہو چکا ہے، کیونکہ اگر وہ فرق نہ کرتا تو تقویٰ اختیار نہ کرتا۔\n\nپس امر محمود (قابل تعریف) اور مذموم (قابل مذمت) کے درمیان ہے\nپس امر محبوب اور مکروہ (ناپسندیدہ) کے درمیان ہے۔\n\nپس تم ہر مکروہ میں اس (ذات حق) کے لیے ڈھال بن جاؤ\nوہ ہر معبود (مألوہ) میں تمہاری ڈھال بن جائے گا۔\n\nاور ہر محبوب میں اسے اپنی ڈھال بناؤ\nاور اس کے ذریعے تنزیہ (پاکیزگی) اور تشبیہ (مشابہت) کے درمیان رہو۔\n\nذات حق (الحق) کو تنزیہ دینے والا اس بات کو نہیں جانتا\nاور ذات حق کو تشبیہ دینے والا بھی نہیں جانتا، لیکن میں اسے جانتا ہوں۔\n\nپس جو شخص اسے اس (تشبیہ) سے پاک قرار دیتا ہے، وہ اسے\nاس (تنزیہ) کے ذریعے تشبیہ دیتا ہے، پس یہی وہ بات ہے جو میں نے اس کے بارے میں کہی ہے۔\n\nاور یہ اس لیے ہے کہ انسان اس سے خالی نہیں کہ وہ اپنے معبود کو مثال، ضد، یا خلاف بنائے، اور ہر صورت میں اس نے اللہ اور عالم (خلق) کے درمیان فرق کیا ہے۔ پس یہ وہ فرقان ہے جو تقویٰ (التقوى) عطا کرتا ہے، اور ضروری ہے کہ یہ ایک خاص فرقان ہو، اور یہ اس فرقان کے سوا کچھ نہیں جو عین قرآن میں موجود ہے۔ کیونکہ قرآن اپنی ذات میں فرقان کو شامل ہے۔ اور اس فرقان کی نسبت \"جعل\" (پیدا کرنے) کی طرف اس لیے کی گئی ہے کہ تقویٰ نے اسے پیدا کیا ہے۔ یا تو اس کا \"جعل\" (پیدا کرنا) اس کا ظہور ہے اس شخص کے لیے جس نے تقویٰ اختیار کیا، باوجود اس کے کہ وہ اپنے ظہور سے پہلے ہمیشہ سے موجود تھا، یا اس کا \"جعل\" اس کا خلق کرنا ہے اس میں بعد اس کے کہ وہ نہ تھا۔ اور یہ خلق کے بجائے صرف ظہور (التجلی) ہے، کیونکہ اس کے بعد اللہ تعالیٰ نے فرمایا: \"اور وہ تم سے تمہاری برائیاں دور کر دے گا\" (وَيُكَفِّرُ عَنْكُمْ)، یعنی وہ پردہ ڈال دے گا، جو ظہور کی ضد کو چھپانے کے لیے ہے۔ پس بندہ (العبد) اپنے رب کے تقویٰ میں اس سے خالی نہیں کہ وہ اپنے آپ کو اس (رب) کے لیے ہر اس مذموم (قابل مذمت چیز) سے ڈھال بنائے جو اس کی طرف منسوب کی جاتی ہے، یا اپنے رب کو ہر اس شدت سے ڈھال بنائے جسے وہ اس کے بغیر اٹھانے کی طاقت نہیں رکھتا، اور یہی \"لا حول ولا قوة إلا بالله\" (اللہ کے بغیر نہ کوئی طاقت ہے اور نہ کوئی قوت) ہے، اور یہی اس کا قول ہے: \"اور ہم تجھ ہی سے مدد مانگتے ہیں\" (وَإِيَّاكَ نَسْتَعِينُ)۔ پس وہ اس کے ذریعے امور کی ان سختیوں سے ملتا ہے جو اللہ کو محبوب ہیں لیکن طبعاً مکروہ (ناپسندیدہ) ہیں، جیسا کہ تم اپنے آپ کو اس کے لیے ڈھال بناتے ہو، جس کے ذریعے تم اس سے ہر اس مذموم چیز کی نفی کرتے ہو جو شرعاً مذموم اور طبعاً محمود و محبوب ہے۔ پس تمہارے لیے اس کا نتیجہ یہ نکلتا ہے کہ وہ تمہارے لیے ہر شدت کا علم بن کر ڈھال بن جاتا ہے، اور اس کی تمام الٰہی اسماء (صفات) اپنی تفصیلات اور انواع کے ساتھ تم پر متجلی (ظاہر) ہو جاتی ہیں، اور یہ فرقان میں سے ہے۔ اور تمہارے لیے اس کا نتیجہ یہ نکلتا ہے کہ تم ہر مذموم اور مکروہ چیز کے لیے اس کی ڈھال بن جاتے ہو، اور اس کی تمام الٰہی اسماء اپنی تفصیلات اور انواع کے ساتھ تم پر متجلی ہو جاتی ہیں، اور یہ بھی فرقان میں سے ہے۔ پس اللہ دونوں حالتوں میں تمہاری تعریف کرتا ہے۔\n\n### [بے شک اللہ نے علم اپنے محبوں کو عطا کیا]\n\nبے شک اللہ علم صرف اسے عطا کرتا ہے جس سے وہ محبت کرتا ہے، جبکہ حال (روحانی کیفیت) اسے بھی عطا کر سکتا ہے جس سے وہ محبت کرتا ہے اور اسے بھی جس سے وہ محبت نہیں کرتا۔ کیونکہ علم ثابت (مستحکم) ہے اور حال زائل ہونے والی ہے۔ اور اگر وہ فرقان نہ ہوتا جو عین تقویٰ میں ہے، تو تقویٰ فرقان کو پیدا نہ کرتا۔ کیونکہ کوئی چیز اپنے جیسی چیز ہی کو پیدا کرتی ہے، اور ایسا ہی ہونا چاہیے۔ اسی لیے عالم (خلق) ذات حق (الحق) کی صورت پر ہے۔ پس جس پر اس کی طبیعت غالب آ گئی، اس کی مشابہت اس کی ماں سے اس کے باپ کی مشابہت سے زیادہ قوی ہو گئی، اور جس پر اس کی عقل غالب آ گئی، اس کی مشابہت اس کے باپ سے اس کی ماں کی مشابہت سے زیادہ قوی ہو گئی، کیونکہ عالم طبیعت اور ذات حق (الحق) کے درمیان، اور وجود (الوجود) اور عدم کے درمیان ہے۔ پس نہ وہ خالص وجود ہے اور نہ خالص عدم۔ پورا عالم سحر (جادو) ہے جو تمہیں یہ خیال دلاتا ہے کہ وہ حق ہے، حالانکہ وہ حق نہیں ہے، اور تمہیں یہ خیال دلاتا ہے کہ وہ خلق (مخلوق) ہے، حالانکہ وہ خلق نہیں ہے۔ کیونکہ وہ ہر لحاظ سے خلق نہیں ہے اور ہر لحاظ سے حق نہیں ہے۔ ہم مسحور (جس پر جادو کیا گیا ہو) کے بارے میں شک نہیں کرتے کہ جو کچھ وہ دیکھتا ہے، وہاں کوئی مرئی چیز ضرور ہوتی ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: \"ان کے جادو کے زور سے اسے یوں لگتا تھا کہ وہ دوڑ رہی ہیں\" (يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعىٰ)۔ پس دوڑنا (سعی) بلا شک مرئی ہے، اور معاملہ اس شخص میں باقی ہے جو دوڑنے والا ہے۔ کیونکہ رسیاں اپنی جگہ زمین پر پڑی ہیں اور لاٹھیاں بھی۔ پس قطعی طور پر یہ معلوم ہوتا ہے کہ اگر خلق (مخلوق) ذات حق (الحق) سے مجرد ہو جاتی تو وہ نہ ہوتی، اور اگر وہ عین ذات حق ہوتی تو اسے خلق نہ کیا جاتا۔ اسی لیے خلق (مخلوق) دونوں حکموں کو قبول کرتی ہے اور ذات حق (الحق) بھی دونوں حکموں کو قبول کرتی ہے۔ پس ذات حق نے شرعاً صفات حدوث (پیدا ہونے کی صفات) کو قبول کیا اور شرعاً و عقلاً صفات قدم (ازلیت کی صفات) کو قبول کیا۔ پس وہ منزہ (پاک) بھی ہے اور مشبہ (مشابہت والا) بھی ہے۔ اور خلق نے دونوں حکموں کو قبول کیا، اور وہ یہ ہیں کہ اس نے ذات حق میں اپنے اثر کی نسبت کو جمع کیا، اس علم کے ساتھ جو اسے اس کے بارے میں عطا کیا گیا، جیسا کہ ہم نے کئی جگہ ذکر کیا ہے، اور اس میں ذات حق سے اثر کی نسبت کو جمع کیا، اور وہ یہ ہے کہ اس نے اسے موجود کیا حالانکہ وہ کوئی چیز نہیں تھا، یعنی موجود نہیں تھا۔ پس فرقان نفسِ امر میں ہمیشہ سے تھا، لیکن ہر حال میں ہر کسی کے لیے ظاہر نہیں ہوا۔\n\nاحوال میں سے ہر حال میں فرقان ہے\nتشریع (شریعت) اور برہان (دلیل) اسی کے ساتھ آئی ہے۔\n\nاور یہ فرقان جسے تقویٰ نے پیدا کیا، وہ صرف اللہ کی تعلیم سے حاصل ہوتا ہے، اس کے علاوہ فکری نظر (نظریاتی غور و فکر) کے لیے اس میں کوئی راستہ نہیں ہے۔ اگر اللہ اسے فکری نظر میں درستگی عطا کر دے، تو وہ یہ خاص علم نہیں ہے۔ کیونکہ راستہ ان علوم کو ممتاز کرنا ہے جو صورت میں مشتبہ ہوں لیکن ذوق میں مختلف ہوں، اور \"وہ انہیں ایک دوسرے سے ملتا جلتا دیا گیا\" (وَأُتُوا بِهِ مُتَشَابِهًا)۔ پس یہ جان لو، اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و یازدهم در معرفت حال قطبی که منزلگاه او این آیات بود: «إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً» (اگر از خدا پروا کنید، برای شما فرقانی قرار می‌دهد) و «واتَّقُوا الله ويُعَلِّمُكُمُ الله» (و از خدا پروا کنید و خداوند به شما می‌آموزد).\n\nو هر که تقوای خدا پیشه کند،\nچنان که فرمود، از امر خویش برای او فرقان قرار می‌دهد.\n\nپس از آن (فرقان)، گمراهیِ هدایت را می‌شناسد\nو نور هدایت را راهنما و سوق‌دهنده می‌یابد.\n\nدر شرقش، غروب‌کننده ظاهر می‌شود\nو در غربش، طلوع‌کننده برمی‌آید.\n\nو در هر علمی که دارد،\nبر هر شخصی به واسطه آن (علم) برتری می‌یابد.\n\nپس او برای گشودن هدایت، وصل‌کننده بود\nو برای وصل کردن هدایت، گشاینده بود.\n\nتا آن را میان فرزندانش تقسیم کند\nو به واسطه آن از کوهی بلند بالا روند.\n\nو او را در مناجاتش می‌بینی\nهنگامی که در آن به واسطه حق (الحق) سخن می‌گوید.\n\nپس آن (مناجات) را مانند خود، نشأتی می‌بخشد\nکه به واسطه آن در میان خلق، خالق باشد.\n\nو قوت زمینش را ذخیره می‌کند\nپس او را خالق و روزی‌دهنده می‌آموزد.\n\n### [فرقان (الفرقان) برای پرهیزکاران حاصل شد]\n\nبدان، خداوند ما و تو را به روح القدس تأیید کند، که شخص متقی (پرهیزکار) به صرف تقوای (التقوى) خود، در فرقان (معیار تمییز) قرار گرفته است؛ زیرا اگر تمییز نمی‌داد، تقوا پیشه نمی‌کرد.\n\nپس امر (کار) میان ستوده و نکوهیده است\nو امر میان محبوب و مکروه است.\n\nپس تو در هر مکروهی، وقایه (سپر) او باش\nتا او در هر معبودی (مألوه)، وقایه شما باشد.\n\nو او را در هر محبوبی، وقایه خود قرار ده\nو به واسطه او میان تنزیه و تشبیه باش.\n\nتنزیه‌کننده حق (الحق) از آن آگاه نیست\nو تشبیه‌کننده حق نیز آگاه نیست، اما من آگاه هستم.\n\nپس هر کس او را از چیزی تنزیه کند،\nاو را به آن چیز تشبیه کرده است؛ این همان است که من درباره‌اش گفتم.\n\nو این بدان سبب است که انسان ناگزیر است معبود خود را یا مَثَل (مانند)، یا ضد، یا خلاف قرار دهد؛ و در هر صورت، میان خدا و عالم فرق گذاشته است. این فرقانی که تقوا می‌بخشد، ناگزیر باید فرقانی خاص باشد و آن چیزی جز فرقانی که در عین قرآن است، نیست. زیرا قرآن ذاتاً متضمن فرقان است. و نسبت دادن «قرار دادن» (جعل) به این فرقان از آن روست که تقوا آن را به وجود آورده است. حال، یا «قرار دادن» به معنای ظهور آن برای کسی است که تقوا پیشه کرده، با وجود اینکه عین آن پیش از ظهورش همواره موجود بوده است؛ یا «قرار دادن» به معنای خلق آن در او پس از آن است که نبوده است. و این (فرقان) چیزی جز ظهور نیست، نه خلق؛ زیرا خداوند آن را با این سخن دنبال کرده است: «ويُكَفِّرُ عَنْكُمْ» (و بدی‌های شما را می‌پوشاند)، یعنی می‌پوشانند تا ضد ظهور پوشیده شود. پس بنده در تقوای پروردگارش، از این دو حالت خارج نیست: یا خود را سپری برای او قرار می‌دهد تا هر امر نکوهیده‌ای را که به او نسبت داده می‌شود، از او دور کند؛ یا پروردگارش را سپری برای خود قرار می‌دهد در برابر هر سختی‌ای که توان تحمل آن را جز به یاری او ندارد، و این همان «لا حول ولا قوة إلا بالله» (هیچ نیرو و توانی جز به یاری خدا نیست) است، و این همان سخن اوست: «وإِيَّاكَ نَسْتَعِينُ» (و تنها از تو یاری می‌جوییم). پس به واسطه او با سختی‌های اموری روبرو می‌شود که محبوب خدا و مکروه طبع هستند؛ همان‌گونه که خود را سپری برای او قرار می‌دهی و به واسطه آن، هر امر نکوهیده شرعی را که طبعاً ستوده و محبوب است، از او نفی می‌کنی. در نتیجه، اینکه او (حق) سپر تو باشد، علم به هر سختی را برایت به بار می‌آورد، و در این حالت، تمامی اسماء الهی او با جزئیات و انواعشان بر تو تجلی (التجلی) می‌کنند، و این از فرقان است. و اینکه تو سپر او باشی، هر امر نکوهیده و مکروهی را برایت به بار می‌آورد، و در این حالت، تمامی اسماء الهی او با جزئیات و انواعشان بر تو تجلی می‌کنند، و این نیز از فرقان است. پس خداوند در هر دو حالت تو را می‌ستاید.\n\n### [همانا خداوند علم را به دوستدارانش عطا کرد]\n\nزیرا خداوند علم را جز به کسی که دوست دارد، نمی‌دهد؛ اما حال (تجربه معنوی گذرا) را ممکن است به کسی که دوست دارد و کسی که دوست ندارد، بدهد. چرا که علم ثابت است و حال زوال‌پذیر. اگر فرقانی که در عین تقواست وجود نداشت، تقوا فرقانی به بار نمی‌آورد؛ زیرا شیء جز مانند خود را تولید نمی‌کند و جز این نمی‌تواند باشد. به همین دلیل، عالم بر صورت حق (الحق) است. پس کسی که طبعش بر او غلبه کند، شباهتش به مادرش قوی‌تر از شباهتش به پدرش است؛ و کسی که عقلش بر او غلبه کند، شباهتش به پدرش قوی‌تر از شباهتش به مادرش است. زیرا عالم میان طبیعت و حق، و میان هستی (الوجود) و نیستی (العدم) قرار دارد. پس نه هستی خالص است و نه نیستی خالص. عالم تماماً سحری است که به تو چنین وانمود می‌کند که حق است، در حالی که حق نیست؛ و چنین وانمود می‌کند که خلق است، در حالی که خلق نیست؛ زیرا نه از هر جهت خلق است و نه از هر جهت حق. ما در مورد شخص سحر شده شک نداریم که آنچه می‌بیند، حتماً مرئی است، چنان که فرمود: «يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏» (از سحرشان به نظرش می‌آمد که آنها حرکت می‌کنند). پس حرکت (سعی) بدون شک مرئی است، و بحث در این می‌ماند که آن حرکت‌کننده کیست؛ زیرا طناب‌ها و عصاها در جای خود بر زمین افتاده‌اند. پس به یقین دانسته می‌شود که اگر خلق از حق مجرد می‌شد، وجود نمی‌یافت؛ و اگر عین حق بود، خلق نمی‌شد. به همین دلیل، خلق دو حکم را می‌پذیرد و حق نیز دو حکم را می‌پذیرد. پس حق، صفات حدوث را شرعاً پذیرفت و صفات قِدَم را شرعاً و عقلاً پذیرفت؛ پس او هم منزّه است و هم مشبّه. و خلق نیز دو حکم را پذیرفت: یکی اینکه نسبت اثر را در حق به خود جمع کرد، به واسطه علمی که حق به او عطا کرد، چنان که در جای دیگر ذکر کردیم؛ و دیگری نسبت اثر را در خود از جانب حق، و آن اینکه حق او را ایجاد کرد در حالی که شیئی نبود، یعنی موجود نبود. پس فرقان همواره در نفس‌الامر بوده است، اما برای هر کس در هر حالی از احوال ظاهر نشده است.\n\nدر هر حالی از احوال، فرقانی هست\nکه تشریع و برهان به آن آمده است.\n\nو این فرقانی که تقوا آن را به بار آورده، جز با تعلیم خداوند حاصل نمی‌شود و نظر فکری را در آن راهی جز این نیست. اگر خداوند به او در نظر فکری توفیق دهد، آن علم خاص نیست؛ زیرا راه (این فرقان) تمییز علوم متشابه در صورت و متفاوت در ذوق است، و «أُتُوا به مُتَشابِهاً» (آن را به صورت متشابه به آنها دادند). پس این را بدان، و خداوند حق می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 2
}