{
  "id": 60,
  "title": {
    "ar": "الباب الستون في معرفة العناصر",
    "en": "Chapter Sixty: On the Knowledge of the Elements",
    "ur": "ساٹھواں باب: عناصر کی معرفت (المعرفۃ) کے بیان میں",
    "fa": "باب شصتم در معرفت عناصر"
  },
  "content": {
    "ar": "## (الباب الستون) في معرفة العناصر\n\n\nوسلطان العالم العلوي على العالم السفلي وفي أي دورة كان وجود هذا العالم الإنساني من دورات الفلك الأقصى وأية روحانية لنا (بسم الله الرحمن الرحيم)\n\n\n> أن لعناصر أمهات أربع *** وهي البنات لعالم الأفلاك‏\n\n\n> عنها تولدنا فكان وجودنا *** في عالم الأركان والأملاك‏\n\n\n> جعل الإله غذاءنا بسنابل *** من حكم سنبلة بلا إشراك‏\n\n\n> وكذاك ضاعف أجرنا بسنابل *** سبع بقول ليس من أفاك‏\n\n\n> وزماننا سبع من الآلاف جا *** بتكرر الأضواء والأحلاك‏\n> فانظر بعقلك سبعة في سبعة *** من سبعة ليسوا من الأملاك‏\n\n\n> وانظر بفكرك في تناسب حكمها *** واضرب بسيف صارم بتاك‏\n\n\n### [الحقائق إلهية الأربعة ومراتب العلوم الأربعة]\n\n\nأراد بالأملاك الأول من الملائكة جمع ملك وأراد بالأملاك الثاني من الملوك جمع ملك يقول هم مسخرون والمسخر لا يستحق اسم الملك والسبعة المذكورة هي السبعة الدراري في السبعة الأفلاك الموجودة من السبعة الأيام التي هي أيام الجمعة وهي للحركة التي فوق السموات وهي حركة اليوم للفلك الأقصى اعلم أن كل شي‏ء من الأكوان لا بد أن يكون استناده إلى حقائق إلهية فكل علم مدرج في العلم الإلهي ومنه تفرعت العلوم كلها وهي منحصرة في أربع مراتب وكل مرتبة تنقسم إلى أنواع معلومة محصورة عند العلماء وهو العلم المنطقي والعلم الرياضي والعلم الطبيعي والعلم الإلهي والعالم يطلب من الحقائق الإلهية أربع نسب الحياة والعلم والإرادة والندرة إذا ثبتت هذه الأربع النسب للواجب الوجود صح أنه الموجد للعالم بلا شك فالحياة والعلم أصلان في النسب والإرادة والقدرة دونهما والأصل الحياة فإنها الشرط في وجود العلم والعلم له عموم التعلق فإنه يتعلق بالواجب الوجود وبالممكن وبالمحال والإرادة دونه في التعلق فإنه لا تعلق لها إلا بالممكن في ترجيحه بإحدى الحالتين من الوجود والعدم فكان الإرادة تطلبها الحياة فهي كالمنفعلة عنها فإنها أعم تعلقا من القدرة والقدرة أخص تعلقا فإنها تتعلق بإيجاد الممكن لا بإعدامه فكأنها كالمنفعلة عن العلم لأنها من الإرادة بمنزلة العلم من الحياة\n\n\n### [الأصول الأربعة لظهور صور العالم‏]\n\n\nفلما تميزت المراتب في هذه النسب الإلهية تميز الفاعل عن المنفعل خرج العالم على هذه الصورة فاعلا ومنفعلا فالعالم بالنسبة إلى الله من حيث الجملة منفعل محدث وبالنظر إلى نفسه فمنه فاعل ومنفعل فأوجد الله سبحانه العقل الأول من نسبة الحياة وأوجد النفس من نسبة العلم فكان العقل شرطا في وجود النفس كالحياة شرط في وجود العلم وكان المنفعلان عن العقل والنفس الهباء والجسم الكل فهذه الأربعة أصل ظهور الصور في العالم‏\n\n\n### [مرتبة الطبيعة وحقائقها الأربعة]\n\n\nغير أن بين النفس والهباء مرتبة الطبيعة وهي على أربع حقائق منها اثنان فاعلان واثنان منفعلان وكلها في رتبة الانفعال بالنظر إلى من صدرت عنه فكانت الحرارة والبرودة والرطوبة واليبوسة فاليبوسة منفعلة عن الحرارة والرطوبة منفعلة عن البرودة فالحرارة من العقل والعقل عن الحياة ولذلك طبع الحياة في الأجسام العنصرية الحرارة والبرودة من النفس والنفس من العلم ولهذا يوصف العلم إذا استقر ببرد اليقين وبالثلج ومنه قوله صلى الله عليه وسلم حين وجد برد الأنامل بين ثدييه فعلم علم الأولين والآخرين ولما انفعلت اليبوسة والرطوبة عن الحرارة والبرودة طلبت الإرادة اليبوسة لأنها في مرتبتها وطلبت القدرة الرطوبة لأنها في مرتبتها ولما كانت القدرة ما لها تعلق إلا بالإيجاد خاصة كان الأحق بها طبع الحياة وهي الحرارة والرطوبة في الأجسام وظهرت الصور والأشكال في الهباء والجسم الكل فظهرت السماء والأرض مرتوقة غير متميزة\n\n\n### [مراتب العناصر وماهيتها ومصدرها]\n\n\nثم إن الله تعالى توجه إلى فتق هذا الرتق ليميز أعيانها وكان الأصل الماء في وجودها ولهذا قال وجَعَلْنا من الْماءِ كُلَّ شَيْ‏ءٍ حَيٍّ ولحياته وصف بالتسبيح فنظم الله أولا هذه الطبائع الأربع نظما مخصوصا فضم الحرارة إلى اليبوسة فكانت النار البسيطة المعقولة فظهر حكمها في جسم العرش الذي هو الفلك الأقصى والجسم الكل في ثلاثة أماكن منها المكان الواحد سماه حملا والمكان الثاني وهو الخامس من الأمكنة المقدرة فيه سماه أسدا والمكان الثالث وهو التاسع من الأمكنة المقدرة فيه سماه قوسا ثم ضم البرودة إلى اليبوسة وأظهر سلطانهما في ثلاثة أمكنة من هذا الفلك وهو التراب البسيط المعقول فسمى المكان الواحد ثورا والآخر سنبلة والثالث جديا ثم ضم الحرارة إلى الرطوبة فكان الهواء البسيط وأظهر حكمه في ثلاثة أمكنة من هذا الفلك الأقصى سمي المكان الواحد الجوزاء والآخر الميزان والثالث الدالي ثم ضم البرودة إلى الرطوبة فكان الماء البسيط وأظهر حكمه في ثلاثة أمكنة من الفلك الأقصى سمي المكان الواحد السرطان وسمي الآخر بالعقرب وسمي الثالث بالحوت فهذا تقسيم فلك البروج على اثني عشر قسما مفروضة تعينها الكواكب الثمانية والعشرون وذلك بتقدير العزيز العليم‏\n\n\n### [فتق دائرة الوجود بعد رتقه‏]\n\n\nفلما أحكم صنعتها وترتيبها وأدارها فظهر الوجود مرتوقا فأراد الحق فتقه ففصل بين السماء والأرض كما قال تعالى كانَتا رَتْقاً فَفَتَقْناهُما أي ميز بعضها عن بعض فأخذت السماء علوا دخانا فحدث فيما بين السماء والأرض ركنان من‏\nالمركبات الركن الواحد الماء المركب مما يلي الأرض لأنه بارد رطب فلم يكن له قوة الصعود فبقي على الأرض تمسكه بما فيها من اليبوسة عليها والآخر النار وهي أكرة الأثير مما يلي السماء لأنه حار يابس فلم يكن له طبع النزول إلى الأرض فبقي مما يلي السماء من أجل حرارته واليبوسة تمسكه هناك وحدث ما بين النار والماء ركن الهواء من حرارة النار ورطوبة الماء فلا يستطيع أن يلحق بالنار فإن ثقل الرطوبة يمنعه أن يكون بحيث النار وإن طلبت الرطوبة تنزله إلى أن يكون بحيث الماء تمنعه الحرارة من النزول فلما تمانعا لم يبق إلا أن يكون بين الماء والنار لأنهما يتجاذبانه على السواء فذلك المسمى هواء فقد بان لك مراتب العناصر وماهيتها ومن أين ظهرت وأصل الطبيعة\n\n\n### [ظهور الخليفة في دورة العذراء]\n\n\nولما دارت الأفلاك ومخضت الأركان بما حملته مما ألقت فيها في هذا النكاح المعنوي وظهرت المولدات من كل ركن بحسب ما يقتضيه حقيقة ذلك الركن فظهرت أمم العالم وظهرت الحركة المنكوسة والحركة الأفقية فلما انتهى الحكم إلى السنبلة ظهرت النشأة الإنسانية بتقدير العزيز العليم فأنشأ الله عز وجل الإنسان من حيث جسمه خلقا سويا وأعطاه الحركة المستقيمة وجعل الله لها من الولاية في العالم العنصري سبعة آلاف سنة\n\n\n### [زمان القيامة- دولة الفضل والعدل- في دورة الميزان‏]\n\n\nوينتقل الحكم إلى الميزان وهو زمان القيامة وفيه يضع الله الموازين القسط ليوم القيامة فلا تظلم نفس شيئا ولما لم يكن الحكم له بما أودع الله فيه من العدل في الدنيا شرع الموازين فلم يعمل بها إلا القليل من الناس وهم النبيون خاصة ومن كان محفوظا من الأولياء ولما كانت القيامة محل سلطان الميزان لم تظلم نفس شيئا قال الله تعالى ونَضَعُ الْمَوازِينَ الْقِسْطَ لِيَوْمِ الْقِيامَةِ فَلا تُظْلَمُ نَفْسٌ شَيْئاً وإِنْ كانَ مِثْقالَ حَبَّةٍ من خَرْدَلٍ يعني من العمل أَتَيْنا بِها وكَفى‏ بِنا حاسِبِينَ‏\n\n\n### [رمزية العدد 7 والعدد 12]\n\n\nولما كان للعذراء السبعة من الأعداد كانت لها السبعة والسبعون والسبعمائة من الأعداد في تضاعف الأجور وضرب الأمثال في الصدقات فقال تعالى مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوالَهُمْ في سَبِيلِ الله كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنابِلَ في كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ والله يُضاعِفُ لِمَنْ يَشاءُ إلى سبعة آلاف إلى سبعين ألفا إلى سبعمائة ألف إلى ما لا نهاية له ولكن من حساب السبعة وإنما كانت الفروض المقدرة في الفلك الأطلس اثني عشر فرضا لأن منتهى أسماء العدد إلى اثني عشر اسما وهو من الواحد إلى العشرة إلى المائة وهو الحادي عشر إلى الألف وهو الثاني عشر وليس وراءه مرتبة أخرى ويكون التركيب فيها بالتضعيف إلى ما لا نهاية له بهذه الأسماء خاصة\n\n\n### [دولة القرار والاستقرار بعد ذبح كبش الموت بين الجنة والنار]\n\n\nويدخل الناس الجنة والنار وذلك في أول الحادية إحدى عشرة درجة من الجوزاء وتستقر كل طائفة في دارها ولا يبقى في النار من يخرج بشفاعة ولا بعناية إلهية ويذبح الموت بين الجنة والنار ويرجع الحكم في أهل الجنة بحسب ما يعطيه الأمر الإلهي الذي أودع الله في حركات الفلك الأقصى وبه يقع التكوين في الجنة بحسب ما تعطيه نشأة الدار الآخرة فإن الحكم أبدا في القوابل فإن الحركة واحدة وآثارها تختلف بحسب القوابل وسبب ذلك حتى لا يستقل أحد من الخلق بفعل ولا بأمر دون مشاركة فيتميز بذلك فعل الله الذي يفعل لا بمشاركة من فعل المخلوق فالمخلوق أبدا في محل الافتقار والعجز والله الغني العزيز ويكون الحكم في أهل النار بحسب ما يعطيه الأمر الإلهي الذي أودعه الله تعالى في حركات الفلك الأقصى وفي الكواكب الثابتة وفي سباحة الدراري السبعة والمطموسة الأنوار فهي كواكب لكنها ليست بثواقب فالحكم في النار خلاف الحكم في الجنة فيقرب حكم النار من حكم الدنيا فليس بعذاب خالص ولا بنعيم خالص ولهذا قال تعالى لا يَمُوتُ فِيها ولا يَحْيى‏ فلم يخلصه إلى أحد الوجهين وكذلك‏\n\n\nقال صلى الله عليه وسلم أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون‏\n\n\nوقد قدمنا في الباب الذي قبل هذا صورة النعيم والعذاب وسبب ذلك أنه بقي ما أودع الله عليهم في الأفلاك وحركات الكواكب من الأمر الإلهي وتغير منه على قدر ما تغير من صور الأفلاك بالتبديل ومن الكواكب بالطمس والانتثار فاختلف حكمها بزيادة ونقص لأن التغيير وقع في الصور لا في الذوات‏\n\n\n### [الملائكة المهيمة الكروبيون: الحاجب الكاتب اللوح‏]\n\n\nواعلم أن الله تعالى لما تسمى بالملك رتب العالم ترتيب المملكة فجعل له خواص من عباده وهم الملائكة المهيمة جلساء الحق تعالى بالذكر لا يَسْتَكْبِرُونَ عَنْ عِبادَتِهِ ولا يَسْتَحْسِرُونَ يُسَبِّحُونَ اللَّيْلَ والنَّهارَ لا يَفْتُرُونَ ثم اتخذ حاجبا من الكروبيين واحدا أعطاه علمه في خلقه وهو علم مفصل في إجمال فعلمه سبحانه كان فيه مجلى له وسمي ذلك الملك نونا فلا يزال معتكفا في حضرة علمه عز وجل وهو رأس الديوان الإلهي والحق من كونه عليما لا يحتجب عنه ثم عين من‏\nملائكته ملكا آخر دونه في المرتبة سماه القلم وجعل منزلته دون النون واتخذه كاتبا فيعلمه الله سبحانه من علمه ما شاءه في خلقه بوساطة النون ولكن من العلم الإجمالي ومما يحوي عليه العلم الإجمالي علم التفصيل وهو من بعض علوم الإجمال لأن العلوم لها مراتب من جملتها علم التفصيل فما عند القلم الإلهي من مراتب العلوم المجملة إلا علم التفصيل مطلقا وبعض العلوم المفصلة لا غير واتخذ هذا الملك كاتب ديوانه وتجلى له من اسمه القادر فأمده من هذا التجلي الإلهي وجعل نظره إلى جهة عالم التدوين والتسطير فخلق له لوحا وأمره أن يكتب فيه جميع ما شاء سبحانه أن يجريه في خلقه إلى يوم القيامة خاصة وأنزله منه منزلة التلميذ من الأستاذ فتوجهت عليه هنا الإرادة الإلهية فخصصت له هذا القدر من العلوم المفصلة وله تجليان من الحق بلا واسطة وليس للنون سوى تجل واحد في مقام أشرف فإنه لا يدل تعدد التجليات ولا كثرتها على الأشرفية وإنما الأشرف من له المقام الأعم فأمر الله النون أن يمد القلم بثلاثمائة وستين علما من علوم الإجمال تحت كل علم تفاصيل ولكن معينة منحصرة لم يعطه غيرها يتضمن كل علم إجمالي من تلك العلوم ثلاثمائة وستين علما من علوم التفصيل فإذا ضربت ثلاثمائة وستين في مثلها فما خرج لك فهو مقدار علم الله تعالى في خلقه إلى يوم القيامة خاصة ليس عند اللوح من العلم الذي كتبه فيه هذا القلم أكثر من هذا لا يزيد ولا ينقص ولهذه الحقيقة الإلهية جعل الله الفلك الأقصى ثلاثمائة وستين درجة وكل درجة مجملة لما تحوي عليه من تفصيل الدقائق والثواني والثوالث إلى ما شاء الله سبحانه مما يظهره في خلقه إلى يوم القيامة وسمي هذا القلم الكاتب‏\n\n\n### [الملائكة المدبرة: الولاة الاثنا عشر لعالم الخلق‏]\n\n\nثم إن الله سبحانه وتعالى أمر أن يولي على عالم الخلق اثني عشر واليا يكون مقرهم في الفلك الأقصى منا في بروج فقسم الفلك الأقصى اثني عشر قسما جعل كل قسم منها برجا لسكنى هؤلاء الولاة مثل أبراج سور المدينة فأنزلهم الله إليها فنزلوا فيها كل وال على تخت في برجه ورفع الله الحجاب الذي بينهم وبين اللوح المحفوظ فرأوا فيه مسطرا أسماءهم ومراتبهم وما شاء الحق أن يجريه على أيديهم في عالم الخلق إلى يوم القيامة فارتقم ذلك كله في نفوسهم وعلموه علما محفوظا لا يتبدل ولا يتغير ثم جعل الله لكل واحد من هؤلاء الولاة حاجبين ينفذان أوامرهم إلى نوابهم وجعل بين كل حاجبين سفيرا يمشي بينهما بما يلقى إليه كل واحد منهما وعين الله لهؤلاء الذين جعلهم الله حجابا لهؤلاء الولاة في الفلك الثاني منازل يسكنونها وأنزلهم إليها وهي الثمانية والعشرون منزلة التي تسمى المنازل التي ذكرها الله في كتابه فقال والْقَمَرَ قَدَّرْناهُ مَنازِلَ يعني في سيره ينزل كل ليلة منزلة منها إلى أن ينتهي إلى آخرها ثم يدور دورة أخرى لِتَعْلَمُوا بسيره وسير الشمس فيها والخنس عَدَدَ السِّنِينَ والْحِسابَ وكُلَّ شَيْ‏ءٍ فصله الحق لنا تفصيلا فاسكن في هذه المنازل هذه الملائكة وهم حجاب أولئك الولاة الذين في الفلك الأقصى‏\n\n\n### [نقباء الولاة الاثنى عشر في السماوات السبع‏]\n\n\nثم إن الله تعالى أمر هؤلاء الولاة أن يجعلوا نوابا لهم ونقباء في السموات السبع في كل سماء نقيبا كالحاجب لهم ينظر في مصالح العالم العنصري بما يلقون إليهم هؤلاء الولاة ويأمرونهم به وهو قوله وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها فجعل الله أجسام هذه الكواكب النقباء أجساما نيرة مستديرة ونفخ فيها أرواحها وأنزلها في السموات السبع في كل سماء واحد منهم وقال لهم قد جعلتكم تستخرجون ما عند هؤلاء الاثني عشر واليا بوساطة الحجاب الذين هم ثمانية وعشرون كما يأخذ أولئك الولاة عن اللوح المحفوظ ثم جعل الله لكل نقيب من هؤلاء السبعة النقباء فلكا يسبح فيه هو له كالجواد للراكب وهكذا الحجاب لهم أفلاك يسبحون فيها إذ كان لهم التصرف في حوادث العالم والاستشراف عليه ولهم سدنة وأعوان يزيدون على الألف وأعطاهم الله مراكب سماها أفلاكا فهم أيضا يسبحون فيها وهي تدور بهم على المملكة في كل يوم مرة فلا يفوتهم من المملكة شي‏ء أصلا من ملك السموات والأرض فيدور الولاة وهؤلاء الحجاب والنقباء والسدنة كلهم في خدمة هؤلاء الولاة والكل مسخرون في حقنا إذ كنا المقصود من العالم قال تعالى وسَخَّرَ لَكُمْ ما في السَّماواتِ وما في الْأَرْضِ جَمِيعاً مِنْهُ وأنزل الله في التوراة يا ابن آدم خلقت الأشياء من أجلك وخلقتك من أجلي‏\n\n\n### [الملك والملك والمملكة]\n\n\nوهكذا ينبغي أن يكون الملك يستشرف كل يوم على أحوال أهل ملكه يقول تعالى كُلَّ يَوْمٍ هُوَ في شَأْنٍ لأنه يَسْئَلُهُ من في السَّماواتِ والْأَرْضِ بلسان حال ولسان مقال ولا يَؤُدُهُ حفظ العالم وهُوَ الْعَلِيُّ الْعَظِيمُ فما له شغل إلا بها يقول تعالى يُدَبِّرُ الْأَمْرَ من السَّماءِ إِلَى الْأَرْضِ يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ ولو لا وجود الملك ما سمي الملك‏\nملكا فحفظه لملكه حفظه لبقاء اسم الملك عليه وإن كان كما قال فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ فما جاء باسم الملك فإن أسماء الإضافة لا تكون إلا بالمضاف فكل سلطان لا ينظر في أحوال رعيته ولا يمشي بالعدل فيهم ولا يعاملهم بالإحسان الذي يليق بهم فقد عزل نفسه في نفس الأمر ويقول الفقهاء إن الحاكم إذا فسق أو جار فقد انعزل شرعا ولكن عندنا انعزل شرعا فيما فسق فيه خاصة لأنه ما حكم بما شرع له أن يحكم به فقد أثبتهم رسول الله صلى الله عليه وسلم ولاة مع جورهم فقال عليه السلام فينا وفيهم فإن عدلوا فلكم ولهم وإن جاروا فلكم وعليهم ونهى أن نخرج يدا من طاعة وما خص بذلك واليا من وال فلذلك زدنا في عزله شرعا إنما ذلك فيما فسق فيه فالملك مأمور أن يحفظ نفسه من الخروج مما حد له من الأحكام في رعاياه وفي نفسه فإنه وال على نفسه كلكم راع وكلكم مسئول عن رعيته فالإنسان راع على نفسه فما زاد ولذلك قال صلى الله عليه وسلم إن لنفسك عليك حقا ولعينك عليك حقا الحديث فمن لم يف لمن بايعه بما بايعه عليه فقد عزل نفسه وليس بملك وإن كان حاكما فما كل حاكم يكون سلطانا فإن السلطان من تكون له الحجة لا عليه ولهذا جعل الله الأفلاك تدور علينا كل يوم دورة لتنظر الولاة ما تدعو حاجة الخلق إليهم فيسدون الخلل وينفذون أحكام الله تعالى من كونه مريدا في خلقه لا من كونه آمرا فينفذون أحكامه التي أمرهم سبحانه أن ينفذوها فيهم وهو القضاء والقدر في أزمان مختلفة فكل شي‏ء بقضاء وقدر حتى العجز والكيس وكل صغير وكبير مستطر في اللوح المحفوظ فما فيه إلا ما يقع ولا ينفذ هؤلاء الولاة في العالم إلا ما فيه والله على كل شي‏ء رقيب ومع هذا كله فإن الله له مع كل واحد من المملكة أمر خاص في نفسه يعلمه الولاة والحجاب والنقباء فهم لا يفقدون مشاهدة ذلك الوجه ذلك ليعلموا أن الله قَدْ أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً وأنه رقيب على كل نفس بما كسبت وإِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيط\n\n\n### [الملائكة المسخرة تحت أيدى الملائكة الولاة]\n\n\nولما جعل الله زمام هذه الأمور بأيدي هؤلاء الجماعة من الملائكة وأقعد من أقعد منهم في برجه ومسكنه الذي فيه تخت ملكه وأنزل من أنزل من الحجاب والنقباء إلى منازلهم في سماواتهم وجعل في كل سماء ملائكة مسخرة تحت أيدي هؤلاء الولاة وجعل تسخيرهم على طبقات فمنهم أهل العروج بالليل والنهار من الحق إلينا ومنا إلى الحق في كل صباح ومساء وما يقولون إلا خيرا في حقنا ومنهم المستغفرون لمن في الأرض ومنهم المستغفرون للمؤمنين لغلبة الغيرة الإلهية عليهم كما غلبت الرحمة على المستغفرين لِمَنْ في الْأَرْضِ ومنهم الموكلون بإيصال الشرائع ومنهم أيضا الموكلون باللمات ومنهم الموكلون بالإلهام وهم الموصلون العلوم إلى القلوب ومنهم الموكلون بالأرحام ومنهم الموكلون بتصوير ما يكون الله في الأرحام ومنهم الموكلون بنفخ الأرواح ومنهم الموكلون بالأرزاق ومنهم الموكلون بالأمطار ولذلك قالوا وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ وما من حادث يحدث الله في العالم إلا وقد وكل الله بإجرائه ملائكة ولكن بأمر هؤلاء الولاة من الملائكة كما منهم أيضا الصافات والزاجرات والتاليات والمقسمات والمرسلات والناشرات والنازعات والناشطات والسابقات والسابحات والملقيات والمدبرات ومع هذا فما يزالون تحت سلطان هؤلاء الولاة إلا الأرواح المهيمة فهم خصائص الله ومن دونهم فإنهم ينفذون أوامر الله في خلقه ثم إن العامة ما تشاهد إلا منازلهم والخاصة يشهدونهم في منازلهم كما أيضا تشاهد العامة أجرام الكواكب ولا تشاهد أعيان الحجاب ولا النقباء\n\n\n### [الرقائق والمناسبات بين عالم العناصر والولاة في الأفلاك‏]\n\n\nوجعل الله في العالم العنصري خلقا من جنسهم فمنهم الرسل والخلفاء والسلاطين والملوك وولاة أمور العالم وجعل الله بين أرواح هؤلاء الذين جعلهم الله ولاة في الأرض من أهلها بينهم وبين هؤلاء الولاة في الأفلاك مناسبات ورقائق تمتد إليهم من هؤلاء الولاة بالعدل مطهرة من الشوائب مقدسة عن العيوب فتقبل أرواح هؤلاء الولاة الأرضيين منهم بحسب استعداد أنهم فمن كان استعداده قويا حسنا قبل ذلك الأمر على صورته طاهرا مطهرا فكان والي عدل وإمام فضل ومن كان استعداده رديئا قبل ذلك الأمر الظاهر ورده إلى شكله من الرداءة والقبح فكان والي جور ونائب ظلم وبخل فلا يلومن إلا نفسه فقد أبنت لك سلطنة العالم العلوي على العالم السفلي وكيف رتب الله ملكه هذا الترتيب العجيب وما ذكرنا من ذلك إلا الأمهات لا غير يقول الله تعالى وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها وقال يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ ويكفي هذا القدر من هذا الباب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وفي كتاب التنزلات الموصلية ذكرنا حديث هؤلاء الولاة والنواب والحجاب وما ولاهم الله عليه من التأثير في العالم العنصري‏\nالروحاني من ذلك ما تعرضنا لما تعطيه من الطبيعة والأمور البدنية وتكلمنا فيها على كل ما ذكرناه مفصلا في باب يوم الأحد وهو باب الإمام وبينا ما بيد كل نائب من السبعة النقباء في باب يوم الأحد وسائر الأيام إلى يوم السبت وبينا مقامات أرواح الأنبياء عليهم السلام في ذلك وجعلنا هذه الألقاب الروحانية لأرواح الأنبياء عليهم السلام وبينا مراتبهم في الرؤية والحجاب يوم القيامة وما يتكلمون به في أتباعهم من أهل السعادة والشقاء وذلك منه في باب يوم الإثنين بلسان آدم وترجمة القمر وجاء بديعا في شأنه والله المؤيد والموفق لا رب غيره‏\n\n",
    "en": "## Chapter Sixty: On the Knowledge of the Elements\n\nAnd the Dominion of the Celestial World over the Terrestrial World, and in which cycle of the Outermost Sphere (الفلك الأقصى) did the existence of this Human World occur, and what spirituality (روحانية) belongs to us.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.\n\n> Indeed, the elements have four mothers, and they are the daughters of the world of the spheres.\n> From them we were born, and our existence came to be in the world of the Pillars (أركان) and the Angels (أملاك).\n> The God made our sustenance from ears of grain (سنابل), by the ruling of Virgo (سنبلة), without association (إشراك).\n> And likewise, He multiplies our reward by seven ears of grain, a saying that is not false.\n> And our time came as seven thousands, through the repetition of lights and darknesses.\n> Look then with your intellect at seven in seven, from seven who are not kings (أملاك).\n> And look with your thought at the proportionality of their ruling, and strike with a sharp, decisive sword.\n\n### [The Four Divine Realities and the Four Levels of Knowledge]\n\nBy the first mention of *al-Amlak* (الأملاك), He meant the angels (ملائكة), the plural of *malak*. By the second mention of *al-Amlak* (الأملاك), He meant the kings (ملوك), the plural of *malik*. He says they are subservient (مسخرون), and the subservient does not deserve the name of King. The seven mentioned are the seven wandering stars (السبعة الدراري) in the seven spheres, which originate from the seven days—the days of the week—which belong to the movement above the heavens, namely the daily movement of the Outermost Sphere (الفلك الأقصى).\n\nKnow that every existent thing (شيء من الأكوان) must necessarily rely upon Divine Realities (حقائق إلهية). Thus, all knowledge is contained within the Divine Knowledge (العلم الإلهي), and from it all sciences branched out. These sciences are confined to four levels (مراتب), and each level is divided into known types, enumerated by scholars. These are Logical Science, Mathematical Science, Natural Science, and Divine Science (Metaphysics).\n\nThe World seeks four ratios from the Divine Realities: Life (الحياة), Knowledge (العلم), Will (الإرادة), and Power (القدرة). If these four ratios are established for the Necessary Being (الواجب الوجود), it is undoubtedly confirmed that He is the Originator of the World. Life and Knowledge are the two fundamental principles among these ratios, and Will and Power are subordinate to them.\n\nThe root principle is Life, for it is the condition for the existence of Knowledge. Knowledge has a general scope of relation (عموم التعلق), as it relates to the Necessary Being, the Possible, and the Impossible. Will is lesser than Knowledge in its scope of relation, for it relates only to the Possible, in preferring one of its two states—existence or non-existence. Thus, Will is sought by Life; it is like the passive result of Life. Will is more general in its relation than Power. Power has the most specific relation, for it relates only to the bringing into existence of the Possible, not to its non-existence. Thus, Power is like the passive result of Knowledge, because its relation to Will is analogous to the relation of Knowledge to Life.\n\n### [The Four Principles for the Manifestation of the Forms of the World]\n\nWhen the levels in these Divine ratios were distinguished, the Active (الفاعل) was distinguished from the Passive (المنفعل). The World emerged upon this form, being both active and passive. The World, relative to Allah in its totality, is passive and originated (منفعل محدث). But when viewed in relation to itself, it contains both active and passive elements.\n\nAllah, the Glorious, originated the First Intellect (العقل الأول) from the ratio of Life, and originated the Soul (النفس) from the ratio of Knowledge. Thus, the Intellect was a condition for the existence of the Soul, just as Life is a condition for the existence of Knowledge. The two passive entities resulting from the Intellect and the Soul were the Hyle/Vapor (الهباء) and the Universal Body (الجسم الكل). These four constitute the origin of the manifestation of forms in the World.\n\n### [The Level of Nature and its Four Realities]\n\nHowever, between the Soul and the Hyle lies the level of Nature (الطبيعة). It consists of four realities: two are active and two are passive. All of them are in the rank of passivity when viewed in relation to the source from which they emanated. These are Heat (الحرارة), Coldness (البرودة), Moisture (الرطوبة), and Dryness (اليبوسة). Dryness is passive to Heat, and Moisture is passive to Coldness.\n\nHeat originates from the Intellect, and the Intellect from Life. For this reason, the nature of Life in elemental bodies is Heat. Coldness originates from the Soul, and the Soul from Knowledge. For this reason, Knowledge, when settled, is described by the coldness of certainty (برد اليقين) and by snow. This is the source of the Prophet’s (peace and blessings be upon him) saying when he felt the coldness of the fingertips between his breasts, and thereby knew the knowledge of the ancients and the moderns.\n\nWhen Dryness and Moisture became passive results of Heat and Coldness, Will (الإرادة) sought Dryness, because it is in its rank, and Power (القدرة) sought Moisture, because it is in its rank. Since Power relates only to bringing into existence specifically, the nature most appropriate to it is the nature of Life, which is Heat and Moisture in bodies. Forms and shapes then manifested in the Hyle and the Universal Body. Thus, the Heaven and the Earth appeared unified (مرتوقة) and undifferentiated.\n\n### [The Levels of the Elements, their Essence, and their Source]\n\nThen, Allah the Exalted directed His attention to separating this unified state (فتق هذا الرتق) in order to distinguish their essences (أعيانها). The origin of their existence was Water. For this reason, He said: <<وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ>> (And We made from water every living thing). And because of its life, it is described as glorifying (God).\n\nFirst, Allah organized these four natures (طبائع) in a specific arrangement. He combined Heat with Dryness, resulting in the simple, intelligible Fire (النار البسيطة المعقولة). Its ruling appeared in the body of the Throne (العرش), which is the Outermost Sphere and the Universal Body, in three places. He named the first place Aries (Ram), the second place (the fifth of the estimated places therein) Leo (Lion), and the third place (the ninth of the estimated places therein) Sagittarius (Bow).\n\nThen He combined Coldness with Dryness, and manifested their dominion in three places of this sphere, resulting in the simple, intelligible Earth (التراب البسيط المعقول). He named the first place Taurus (Bull), the second Virgo (Ear of Grain), and the third Capricorn (Goat).\n\nThen He combined Heat with Moisture, resulting in the Simple Air (الهواء البسيط). He manifested its ruling in three places of this Outermost Sphere. He named the first place Gemini (Twins), the second Libra (Scales), and the third Aquarius (Water-Pourer).\n\nThen He combined Coldness with Moisture, resulting in the Simple Water (الماء البسيط). He manifested its ruling in three places of the Outermost Sphere. He named the first place Cancer (Crab), the second Scorpio (Scorpion), and the third Pisces (Fish).\n\nThis is the division of the sphere of the Zodiac (فلك البروج) into twelve prescribed divisions, which are determined by the twenty-eight stars, by the decree of the Almighty, the All-Knowing.\n\n### [The Separation of the Circle of Existence after its Unification]\n\nWhen He perfected its making and arrangement and set it in motion, existence appeared unified. Then The Real (الحق) willed its separation. He separated the Heaven and the Earth, as the Exalted said: <<كَانَتَا رَتْقًا فَفَتَقْنَاهُمَا>> (They were a unified mass, and We separated them)—meaning, He distinguished some parts from others.\n\nThe Heaven ascended as smoke. Between the Heaven and the Earth, two pillars (أركان) of the compounds emerged:\n\n1.  The first pillar is Compound Water (الماء المركب), near the Earth, because it is cold and moist, and thus lacked the power to ascend. It remained on Earth, held there by the dryness within it.\n2.  The other is Fire, which is the sphere of Aether (أكرة الأثير), near the Heaven, because it is hot and dry. It lacked the nature to descend to the Earth, and remained near the Heaven due to its heat, while the dryness held it there.\n\nBetween the Fire and the Water, the pillar of Air emerged, composed of the heat of Fire and the moisture of Water. It cannot reach the Fire, because the heaviness of the moisture prevents it from being where the Fire is. And if the moisture seeks to bring it down to where the Water is, the heat prevents it from descending. Since these two forces resisted each other, it had no choice but to remain between the Water and the Fire, as they pull it equally. That is what is called Air.\n\nThus, the levels of the elements, their essence, their source, and the origin of Nature have become clear to you.\n\n### [The Appearance of the Caliph in the Cycle of Virgo]\n\nWhen the spheres revolved and the pillars were churned by what was cast into them in this spiritual marriage, the generated things (المولدات) appeared from every pillar according to the reality required by that pillar. The nations of the world appeared, and the inverted movement and the horizontal movement appeared.\n\nWhen the ruling reached Virgo (السنبلة), the human creation (النشأة الإنسانية) appeared, by the decree of the Almighty, the All-Knowing. Allah, the Mighty and Majestic, created the human being in its physical form (جسمه) in a balanced creation, and granted it the straight movement. God granted it dominion (الولاية) in the elemental world for seven thousand years.\n\n### [The Time of Resurrection—The State of Grace and Justice—in the Cycle of Libra]\n\nThe ruling then transfers to Libra (الميزان), which is the time of the Resurrection (القيامة). In it, Allah establishes the Scales of Justice (الموازين القسط) for the Day of Resurrection, so no soul will be wronged in the slightest. Since the ruling of justice inherent in Libra was not fully implemented in the world, He legislated the Scales, but only a few people acted upon them—specifically the Prophets and those protected among the Saints (الأولياء). Since the Resurrection is the locus of Libra’s dominion, no soul is wronged in the slightest. Allah the Exalted said: <<وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْئًا * وَإِنْ كَانَ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ أَتَيْنَا بِهَا وَكَفَى بِنَا حَاسِبِينَ>> (And We will set up the Scales of Justice for the Day of Resurrection, so no soul will be wronged in the slightest. And if there is the weight of a mustard seed [of a deed], We will bring it forth. And sufficient are We as reckoners).\n\n### [The Symbolism of the Number 7 and the Number 12]\n\nSince Virgo (العذراء) is associated with the number seven, it is associated with seven, seventy, and seven hundred in the multiplication of rewards and the striking of parables concerning charity. The Exalted said: <<مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ>> (The example of those who spend their wealth in the way of Allah is like a seed [of grain] which grows seven ears, in each ear a hundred grains. And Allah multiplies for whom He wills). This multiplication extends to seven thousand, to seventy thousand, to seven hundred thousand, and to infinity, but always based on the calculation of seven.\n\nThe prescribed divisions in the Atlas Sphere (الفلك الأطلس) were twelve because the limit of the names of numbers is twelve names: from one to ten, then the hundred (which is the eleventh), and the thousand (which is the twelfth). There is no other rank beyond this, and composition occurs through multiplication to infinity using only these names.\n\n### [The State of Settlement and Stability after the Slaughter of the Ram of Death between Paradise and Hell]\n\nPeople enter Paradise and Hell. This occurs at the beginning of the eleventh degree of Gemini (الجوزاء). Each group settles in its abode, and no one remains in the Fire who is to be removed by intercession or Divine care. Death is slaughtered between Paradise and Hell.\n\nThe ruling (الحكم) over the inhabitants of Paradise reverts according to what the Divine Command (الأمر الإلهي) dictates—the command that Allah deposited in the movements of the Outermost Sphere. By this, formation (التكوين) occurs in Paradise according to what the nature of the Hereafter requires. The ruling is always dependent on the receptive capacities (القوابل), for the movement is one, but its effects differ according to the receptive capacities. The reason for this is so that no creature can claim independent action or command without partnership, thereby distinguishing the Act of Allah, who acts without the partnership of creaturely action. The creature is always in a state of need and incapacity, while Allah is the Rich, the Mighty.\n\nThe ruling over the inhabitants of the Fire is according to what the Divine Command dictates—the command that Allah deposited in the movements of the Outermost Sphere, in the fixed stars, and in the swimming of the seven wandering stars whose lights are extinguished (المطموسة الأنوار)—they are stars, but not piercing ones. The ruling in the Fire is contrary to the ruling in Paradise. The ruling of the Fire approaches the ruling of the world: it is neither pure torment nor pure bliss. For this reason, the Exalted said: <<لَا يَمُوتُ فِيهَا وَلَا يَحْيَا>> (He neither dies therein nor lives). He did not make it purely one of the two states. Likewise, the Prophet (peace and blessings be upon him) said: \"As for the inhabitants of the Fire who are its people, they will neither die therein nor live.\"\n\nWe have already presented in the preceding chapter the form of bliss and torment. The reason for this state is that what Allah deposited in the spheres and the movements of the stars of the Divine Command remains upon them, though it has changed to the extent that the forms of the spheres have changed through substitution, and the stars through extinction and scattering. Thus, their ruling differs by increase and decrease, because the change occurred in the forms, not in the essences (الذوات).\n\n### [The Veiled Angels, the Cherubim: The Chamberlain, the Scribe, the Tablet]\n\nKnow that when Allah named Himself *al-Malik* (The King), He arranged the World according to the arrangement of a kingdom (المملكة). He appointed special servants for Himself, who are the Veiled Angels (الملائكة المهيمة), the companions of The Real (الحق) through remembrance: <<لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَلَا يَسْتَحْسِرُونَ * يُسَبِّحُونَ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ>> (They do not disdain His worship, nor do they tire. They glorify [Him] night and day, without ceasing).\n\nThen He appointed a Chamberlain (حاجب) from the Cherubim (الكروبيون), one whom He granted His knowledge concerning His creation—a detailed knowledge contained within a summary (علم مفصل في إجمال). His knowledge was a locus of Theophany (مجلى) for the Glorious. This angel was named the Nun (نون). He remains constantly devoted in the Presence of His Knowledge, the Mighty and Majestic. He is the head of the Divine Registry (الديوان الإلهي), and The Real, by virtue of being the All-Knowing (العليم), is not veiled from him.\n\nThen He designated another angel from His angels, lower in rank than the Nun, and named him the Pen (القلم). He placed his station below the Nun and took him as a Scribe (كاتب). Allah the Glorious teaches him of His knowledge what He wills concerning His creation, through the mediation of the Nun, but this is summary knowledge (العلم الإجمالي). The science of detail (علم التفصيل) is contained within the summary knowledge, being a part of the summary sciences, because sciences have levels, and the science of detail is one of them. Thus, what the Divine Pen possesses of the levels of summary sciences is only the science of detail absolutely, and some detailed sciences, nothing else.\n\nHe took this angel as the scribe of His registry and disclosed Himself to him through His Name *al-Qadir* (The Powerful). He supplied him from this Divine Theophany and directed his gaze toward the world of recording and inscription. He created a Tablet (لوح) for him and commanded him to write upon it all that the Glorious willed to occur in His creation specifically until the Day of Resurrection. He placed him in the position of a student to a teacher. Here, the Divine Will (الإرادة الإلهية) was directed toward him, specializing him with this specific amount of detailed sciences. He has two Theophanies from The Real without mediation, while the Nun has only one Theophany, though in a nobler station. The multiplicity or abundance of Theophanies does not indicate nobility; rather, the nobler is he who holds the more general station.\n\nAllah commanded the Nun to supply the Pen with three hundred and sixty sciences of summary knowledge, under each of which are details, but specific and confined details. He gave him nothing else. Each of those summary sciences contains three hundred and sixty sciences of detail. If you multiply three hundred and sixty by itself, the result is the measure of Allah’s knowledge concerning His creation specifically until the Day of Resurrection. The Tablet contains no more knowledge than what this Pen wrote upon it—it neither increases nor decreases. Due to this Divine Reality, Allah made the Outermost Sphere three hundred and sixty degrees, and every degree summarizes what it contains of the details of minutes, seconds, and thirds, up to whatever Allah the Glorious wills to manifest in His creation until the Day of Resurrection. This Pen is called the Scribe.\n\n### [The Governing Angels: The Twelve Governors of the World of Creation]\n\nThen Allah the Glorious commanded that twelve Governors (الولاة) be appointed over the world of creation, whose abode would be in the Outermost Sphere, in the Zodiacal Signs (بروج). He divided the Outermost Sphere into twelve parts, making each part a Sign for the dwelling of these Governors, like the towers of a city wall. Allah sent them down to these Signs, and they settled therein, each Governor upon a throne in his Sign.\n\nAllah lifted the veil between them and the Preserved Tablet (اللوح المحفوظ). They saw inscribed therein their names, their ranks, and all that The Real willed to execute through their hands in the world of creation until the Day of Resurrection. All of that was imprinted upon their souls, and they knew it as preserved knowledge that neither changes nor alters.\n\nThen Allah appointed for each of these Governors two Chamberlains (حاجبين) who execute their orders to their deputies. He placed a Messenger (سفير) between every two Chamberlains, who walks between them with what each one conveys to him. Allah designated stations for those whom He made Chamberlains for these Governors in the second sphere from us, and sent them down to them. These are the twenty-eight Mansions (منازل) mentioned by Allah in His Book, where He said: <<وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ>> (And the moon, We have decreed for it stations)—meaning, in its journey, it descends to one station every night until it reaches the last one, then it completes another cycle—<<لِتَعْلَمُوا عَدَدَ السِّنِينَ وَالْحِسَابَ>> (That you may know the number of years and the calculation). And everything The Real has detailed for us in detail. These angels, who are the Chamberlains of those Governors in the Outermost Sphere, reside in these Mansions.\n\n### [The Deputies of the Twelve Governors in the Seven Heavens]\n\nThen Allah the Exalted commanded these Governors to appoint Deputies (نقباء) for themselves in the Seven Heavens—one Deputy in each heaven, acting as a Chamberlain for them. They oversee the interests of the elemental world (العالم العنصري) according to what these Governors convey and command them. This is His saying: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command).\n\nAllah made the bodies of these stellar Deputies luminous, spherical bodies, and breathed their spirits into them. He sent them down into the Seven Heavens, one in each heaven. He told them: \"I have made you extract what is with these twelve Governors through the mediation of the twenty-eight Chamberlains, just as those Governors receive from the Preserved Tablet.\"\n\nThen Allah made for each of these seven Deputies a sphere (فلك) in which he swims, which is like a steed for the rider. Likewise, the Chamberlains have spheres in which they swim, since they are responsible for managing the events of the world and overseeing it. They have servants and helpers exceeding a thousand. Allah granted them vehicles called spheres, and they also swim in them, revolving with them over the Kingdom once every day. Thus, nothing of the Kingdom of the Heavens and the Earth escapes them at all. The Governors, these Chamberlains, the Deputies, and the Servants all revolve in the service of these Governors. All of them are subservient (مسخرون) to us, since we are the intended purpose of the World. The Exalted said: <<وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ>> (And He subjected to you whatever is in the heavens and whatever is on the earth—all from Him). And Allah revealed in the Torah: \"O Son of Adam, I created things for your sake, and I created you for My sake.\"\n\n### [The King, the Dominion, and the Kingdom]\n\nThis is how a King should be: overseeing the affairs of the people of his kingdom every day. The Exalted says: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [some] affair), because <<يَسْأَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ>> (Whoever is in the heavens and on the earth asks Him), by the tongue of state and the tongue of speech. The preservation of the World does not weary Him, and <<وَهُوَ الْعَلِيُّ الْعَظِيمُ>> (He is the Most High, the Magnificent). He has no occupation other than them. The Exalted says: <<يُدَبِّرُ الْأَمْرَ مِنَ السَّمَاءِ إِلَى الْأَرْضِ>> (He arranges [all] affairs from the heaven to the earth). He arranges the affair and details the signs.\n\nWere it not for the existence of the Kingdom (الملك), the King (الملك) would not be called King. His preservation of His Kingdom is His preservation of the continuation of the Name *al-Malik* upon Him, even though, as He said, <<فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ>> (Indeed, Allah is free from need of the worlds). The Name *al-Malik* comes through the Name of Relation (اسم الإضافة), and Names of Relation only exist through the related object.\n\nAny sovereign who does not look into the affairs of his subjects, nor walks with justice among them, nor treats them with the kindness appropriate to them, has dismissed himself in reality. The jurists say that if a ruler acts immorally or unjustly, he is legally dismissed. However, in our view, he is legally dismissed only in the specific matter in which he acted immorally, because he did not rule according to what he was legislated to rule by. Yet, the Messenger of Allah (peace and blessings be upon him) confirmed them as rulers despite their injustice, saying concerning us and them: \"If they are just, it is for you and for them. If they are unjust, it is for you and against them.\" He forbade us from withdrawing our hand from obedience. Since he did not specify any particular ruler with this, we add that his legal dismissal is only in the matter in which he acted immorally.\n\nThe King is commanded to protect himself from departing from the rulings prescribed for him concerning his subjects and concerning himself, for he is a ruler over himself. \"All of you are shepherds, and all of you are responsible for your flock.\" The human being is a shepherd over his own soul, and over what is added to it. For this reason, the Prophet (peace and blessings be upon him) said: \"Indeed, your soul has a right over you, and your eye has a right over you,\" and so on.\n\nWhoever does not fulfill the covenant he made with those who pledged allegiance to him has dismissed himself and is not a King, even if he is a governor. Not every governor is a Sultan, for the Sultan is he who has the decisive argument, not the one against whom the argument is held.\n\nFor this reason, Allah made the spheres revolve over us once every day, so that the Governors may observe what the needs of creation call for, and thus they mend the deficiency and execute the rulings of Allah the Exalted, based on His being Willing (مريدا) in His creation, not merely His being Commanding (آمرًا). They execute His rulings which He commanded them to execute among them, which is the Divine Decree and Destiny (القضاء والقدر) in different times. Everything is by Decree and Destiny, even incapacity and cleverness. Every small and large thing is inscribed in the Preserved Tablet. Nothing is in it except what occurs, and these Governors execute nothing in the World except what is in it. Allah is a Watcher over everything.\n\nDespite all this, Allah has a special command with every individual in the Kingdom concerning his own self, which the Governors, Chamberlains, and Deputies know. They never fail to witness that Face, so that they may know that Allah <<قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا>> (has encompassed all things in knowledge) and that He is a Watcher over every soul for what it has earned, and <<إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ>> (Indeed, He encompasses all things).\n\n### [The Subservient Angels under the Authority of the Governing Angels]\n\nWhen Allah placed the reins of these affairs in the hands of this group of angels, seating those He seated in their Signs and their dwelling place where their royal throne is, and sending down those He sent down of the Chamberlains and Deputies to their stations in their heavens, He placed in every heaven subservient angels (ملائكة مسخرة) under the authority of these Governors. He made their subservience in classes.\n\nAmong them are those who ascend and descend, night and day, from The Real to us, and from us to The Real, every morning and evening, and they speak nothing but good concerning us. Among them are those who seek forgiveness for those on Earth, and among them are those who seek forgiveness for the believers, due to the dominance of Divine Jealousy over them, just as Mercy dominates those who seek forgiveness for those on Earth.\n\nAmong them are those entrusted with delivering the Divine Laws (الشرائع). Among them are those entrusted with thoughts (اللمات). Among them are those entrusted with inspiration (الإلهام), who convey knowledge to the hearts. Among them are those entrusted with wombs (الأرحام). Among them are those entrusted with forming what Allah wills in the wombs. Among them are those entrusted with blowing the spirits. Among them are those entrusted with sustenance (الأرزاق). Among them are those entrusted with rain. For this reason, they said: <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ>> (And there is none of us except that he has a known station).\n\nThere is no event that Allah causes to happen in the World except that Allah has entrusted angels with its execution, but by the command of these Governors among the angels. Among them are also the Ranks (الصافات), the Drivers (الزاجرات), the Reciters (التاليات), the Dividers (المقسمات), the Sent Ones (المرسلات), the Spreaders (الناشرات), the Pullers (النازعات), the Drawers (الناشطات), the Preceders (السابقات), the Swimmers (السابحات), the Throwers (الملقيات), and the Arrangers (المدبرات).\n\nDespite all this, they remain under the dominion of these Governors, except for the Veiled Spirits (الأرواح المهيمة), for they are the elect of Allah. Those below them execute the commands of Allah in His creation. The common people only witness their stations, while the elite witness them in their stations, just as the common people witness the bodies of the stars but do not witness the essences of the Chamberlains or the Deputies.\n\n### [The Subtle Connections and Correspondences between the Elemental World and the Governors in the Spheres]\n\nAllah created beings in the elemental world of their own kind. Among them are the Messengers, the Caliphs, the Sultans, the Kings, and the governors of the world’s affairs.\n\nAllah established correspondences and subtle connections (رقائق) between the spirits of these terrestrial rulers—whom He made governors on Earth from among its people—and these celestial Governors in the spheres. These subtle connections extend to them from the Governors with justice, purified from impurities and sanctified from defects. The spirits of these terrestrial governors receive this according to their preparedness.\n\nWhoever has a strong and good preparedness receives that manifest command in its pure and sanctified form, and thus becomes a just governor and an Imam of grace. Whoever has a poor preparedness receives that manifest command but returns it to its form of baseness and ugliness, and thus becomes a tyrannical governor and a deputy of injustice and stinginess. Let him blame no one but himself.\n\nI have thus made clear to you the dominion of the celestial world over the terrestrial world, and how Allah arranged His Kingdom in this wondrous order. We have mentioned only the fundamental principles (الأمهات), nothing else. Allah the Exalted says: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command), and He said: <<يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ>> (The command descends between them). This much suffices for this chapter. Allah speaks The Truth (الحق) and He guides to the Way.\n\nIn the book *Al-Tanazzulat al-Mawsiliyya* (The Mosul Descents), we mentioned the account of these Governors, Deputies, and Chamberlains, and the influence Allah entrusted them with in the spiritual elemental world. We did not address what they grant of nature and bodily affairs there. We discussed everything we mentioned in detail in the chapter on Sunday, which is the Chapter of the Imam. We clarified what is in the hand of each Deputy among the seven Deputies in the chapter on Sunday and the rest of the days until Saturday. We clarified the stations of the spirits of the Prophets (peace be upon them) in that context. We assigned these spiritual titles to the spirits of the Prophets (peace be upon them) and clarified their ranks in vision and veiling on the Day of Resurrection, and what they will speak concerning their followers, whether they are among the fortunate or the wretched. That is found in the chapter on Monday, in the language of Adam and the interpretation of the Moon. It came out wonderfully in its affair. Allah is the Supporter and the Granter of Success; there is no Lord but Him.",
    "ur": "(باب ساٹھواں) عناصر کی معرفت میں\n\nاور عالم بالا کا عالم زیریں پر تسلط، اور فلک اقصیٰ کے ادوار میں سے کس دور میں اس عالم انسانی کا وجود ہوا، اور ہماری روحانیہ کیا ہے۔ (بسم اللہ الرحمن الرحیم)\n\n> عناصر چار ہیں جو مائیں ہیں *** اور یہ عالم افلاک کی بیٹیاں ہیں\n>\n> ان سے ہم پیدا ہوئے، سو ہمارا وجود ہوا *** عالم ارکان اور حکمرانوں میں\n>\n> اللہ نے ہماری غذا خوشوں میں رکھی *** حکمت کے خوشوں میں، بغیر کسی شرک کے\n>\n> اور اسی طرح اس نے ہمارے اجر کو سات خوشوں سے دوگنا کیا *** یہ بات جھوٹے کی نہیں ہے\n>\n> اور ہمارا زمانہ سات ہزار سال کا ہے *** روشنیوں اور تاریکیوں کے تکرار کے ساتھ\n>\n> پس اپنے عقل سے سات میں سات کو دیکھ *** جو سات سے ہیں، اور وہ حکمران نہیں ہیں\n>\n> اور اپنی فکر سے ان کے حکم کی مناسبت میں دیکھ *** اور ایک کاٹ دینے والی تلوار سے ضرب لگا\n\n### [حقائق الٰہیہ (الحقائق إلهية) اربعہ اور مراتب علوم اربعہ]\n\nپہلے \"الأملاك\" سے مراد ملائکہ (جمع ملک) ہیں اور دوسرے \"الأملاك\" سے مراد ملوک (جمع ملک) ہیں۔ مصنف کہتے ہیں کہ وہ مسخر ہیں، اور مسخر (جسے تابع کیا گیا ہو) بادشاہ (ملک) کا نام پانے کا مستحق نہیں ہوتا۔ مذکورہ سات سے مراد سات سیارے (الدراری) ہیں جو سات افلاک میں موجود ہیں، جو سات ایامِ جمعہ سے ہیں، اور یہ وہ حرکت ہے جو آسمانوں کے اوپر ہے، یعنی فلک اقصیٰ کی یومیہ حرکت۔\n\nجان لو کہ کائنات میں ہر شے کا استناد حقائق الٰہیہ (الحقائق إلهية) پر ہونا ضروری ہے۔ پس ہر علم علم الٰہی میں شامل ہے اور اسی سے تمام علوم کی شاخیں پھوٹی ہیں۔ یہ علوم چار مراتب میں منحصر ہیں، اور ہر مرتبہ علماء کے نزدیک معلوم و محدود انواع میں منقسم ہے: علم منطقی، علم ریاضی، علم طبیعی، اور علم الٰہی۔\n\nعالم حقائق الٰہیہ (الحقائق إلهية) سے چار نسبتیں طلب کرتا ہے: حیات (الحياة)، علم (العلم)، ارادہ (الإرادة)، اور قدرت (القدرة)۔ جب یہ چار نسبتیں واجب الوجود (الواجب الوجود) کے لیے ثابت ہو جائیں تو بلا شک یہ صحیح ہو جاتا ہے کہ وہ عالم کو وجود بخشنے والا (الموجد) ہے۔\n\nحیات (الحياة) اور علم (العلم) نسبتوں میں اصل ہیں، اور ارادہ (الإرادة) اور قدرت (القدرة) ان سے کم ہیں۔ اصل حیات ہے، کیونکہ یہ علم کے وجود کے لیے شرط ہے۔ اور علم کا تعلق عام ہے، کیونکہ یہ واجب الوجود (الواجب الوجود)، ممکن (الممكن)، اور محال (المحال) سے متعلق ہوتا ہے۔ ارادہ تعلق میں اس سے کم ہے، کیونکہ اس کا تعلق صرف ممکن سے ہوتا ہے، تاکہ اسے وجود (الوجود) اور عدم کی دو حالتوں میں سے کسی ایک پر ترجیح دی جا سکے۔ پس ارادہ کو حیات طلب کرتی ہے، لہٰذا یہ حیات سے منفعل (متاثر) ہونے والے کی طرح ہے، کیونکہ یہ قدرت سے زیادہ عام تعلق رکھتا ہے۔ اور قدرت تعلق میں سب سے خاص ہے، کیونکہ اس کا تعلق ممکن کو ایجاد کرنے سے ہے، نہ کہ اسے معدوم کرنے سے۔ پس یہ علم سے منفعل ہونے والے کی طرح ہے، کیونکہ یہ ارادہ سے اس مقام پر ہے جس مقام پر علم حیات سے ہے۔\n\n### [عالم کی صورتوں کے ظہور کے چار اصول]\n\nجب ان الٰہی نسبتوں میں مراتب ممتاز ہو گئے، اور فاعل منفعل سے ممتاز ہو گیا، تو عالم اسی صورت پر فاعل اور منفعل کی شکل میں ظاہر ہوا۔ عالم، مجموعی طور پر، اللہ کے اعتبار سے منفعل اور محدث (نیا پیدا کیا گیا) ہے، اور اپنے آپ کے اعتبار سے، اس میں سے کچھ فاعل ہے اور کچھ منفعل۔\n\nاللہ سبحانہ و تعالیٰ نے عقل اول (العقل الأول) کو نسبت حیات (الحياة) سے پیدا کیا، اور نفس (النفس) کو نسبت علم (العلم) سے پیدا کیا۔ پس عقل، نفس کے وجود کے لیے شرط بنا، جیسے حیات علم کے وجود کے لیے شرط ہے۔ اور عقل اور نفس سے منفعل ہونے والے ہباء (الهباء) اور جسم کل (الجسم الكل) تھے۔ یہ چار چیزیں عالم میں صورتوں کے ظہور کا اصل ہیں۔\n\n### [طبیعت (الطبيعة) کا مرتبہ اور اس کی چار حقائق]\n\nمگر نفس اور ہباء (الهباء) کے درمیان طبیعت (الطبيعة) کا مرتبہ ہے، اور یہ چار حقائق پر مشتمل ہے، جن میں سے دو فاعل ہیں اور دو منفعل۔ اور یہ سب، جس سے صادر ہوئے ہیں اس کے اعتبار سے، انفعال کے مرتبہ میں ہیں۔ یہ چار حقائق ہیں: حرارت (الحرارة)، برودت (البرودة)، رطوبت (الرطوبة)، اور یبوست (اليبوسة)۔\n\nپس یبوست حرارت سے منفعل ہوئی، اور رطوبت برودت سے منفعل ہوئی۔ حرارت عقل سے ہے، اور عقل حیات سے ہے۔ اسی لیے حیات کی طبیعت عنصری اجسام میں حرارت ہے۔ اور برودت نفس سے ہے، اور نفس علم سے ہے۔ اسی لیے علم کو جب وہ مستقر ہو جاتا ہے تو \"برد الیقین\" (یقین کی ٹھنڈک) اور برف سے موصوف کیا جاتا ہے۔ اور اسی سے نبی اکرم صلی اللہ علیہ وسلم کا یہ قول ہے جب آپ نے اپنے سینے کے درمیان انگلیوں کی ٹھنڈک (برد الأنامل) محسوس کی، تو آپ کو اولین و آخرین کا علم ہو گیا۔\n\nاور جب یبوست اور رطوبت حرارت اور برودت سے منفعل ہوئیں، تو ارادہ (الإرادة) نے یبوست کو طلب کیا کیونکہ وہ اس کے مرتبہ میں ہے، اور قدرت (القدرة) نے رطوبت کو طلب کیا کیونکہ وہ اس کے مرتبہ میں ہے۔ اور چونکہ قدرت کا تعلق صرف ایجاد سے ہے، اس لیے حیات کی طبیعت، یعنی حرارت اور اجسام میں رطوبت، اس کی زیادہ حقدار تھی۔ اور صورتیں اور شکلیں ہباء (الهباء) اور جسم کل (الجسم الكل) میں ظاہر ہوئیں، پس آسمان اور زمین جڑے ہوئے (مرتوق) ظاہر ہوئے، جو متمیز نہیں تھے۔\n\n### [عناصر کے مراتب، ان کی ماہیت اور ان کا مصدر]\n\nپھر اللہ تعالیٰ نے اس رتق (جڑے ہوئے وجود) کو فتق (کھولنے) کی طرف توجہ فرمائی تاکہ ان کے اعیان کو ممتاز کرے۔ اور ان کے وجود میں اصل پانی (الماء) تھا۔ اسی لیے فرمایا:\n**وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ**\n(اور ہم نے پانی سے ہر زندہ چیز بنائی)۔\nاور اس کی حیات کی وجہ سے اسے تسبیح سے موصوف کیا گیا۔\n\nپس اللہ نے پہلے ان چار طبائع کو ایک مخصوص نظم میں ترتیب دیا:\n۱. حرارت کو یبوست کے ساتھ ملایا، تو سادہ معقول آگ (النار البسيطة المعقولة) بنی۔ اس کا حکم عرش کے جسم میں ظاہر ہوا جو فلک اقصیٰ (الفلك الأقصى) ہے۔ اور جسم کل میں تین مقامات پر: ایک مقام کو حمل (Aries)، دوسرے کو، جو مقدرہ مقامات میں سے پانچواں ہے، اسد (Leo)، اور تیسرے کو، جو مقدرہ مقامات میں سے نواں ہے، قوس (Sagittarius) کا نام دیا۔\n۲. پھر برودت کو یبوست کے ساتھ ملایا، اور ان کا تسلط اس فلک کے تین مقامات میں ظاہر کیا، جو سادہ معقول مٹی (التراب البسيط المعقول) ہے۔ ایک مقام کو ثور (Taurus)، دوسرے کو سنبلہ (Virgo)، اور تیسرے کو جدی (Capricorn) کا نام دیا۔\n۳. پھر حرارت کو رطوبت کے ساتھ ملایا، تو سادہ ہوا (الهواء البسيط) بنی۔ اور اس کا حکم اس فلک اقصیٰ کے تین مقامات میں ظاہر کیا، ایک مقام کو جوزاء (Gemini)، دوسرے کو میزان (Libra)، اور تیسرے کو دالی (Aquarius) کا نام دیا۔\n۴. پھر برودت کو رطوبت کے ساتھ ملایا، تو سادہ پانی (الماء البسيط) بنا۔ اور اس کا حکم فلک اقصیٰ کے تین مقامات میں ظاہر کیا، ایک مقام کو سرطان (Cancer)، دوسرے کو عقرب (Scorpio)، اور تیسرے کو حوت (Pisces) کا نام دیا۔\n\nیہ بروج (Zodiac) کے فلک کی بارہ حصوں میں تقسیم ہے، جن کا تعین اٹھائیس کواکب کرتے ہیں، اور یہ سب عزیز و علیم (العزيز العليم) کے اندازے سے ہے۔\n\n### [رتق کے بعد دائرہ وجود کا فتق]\n\nجب اللہ نے اس کی صنعت اور ترتیب کو مضبوط کر دیا اور اسے گردش دی، تو وجود جڑا ہوا (مرتوق) ظاہر ہوا۔ پھر حق (الحق) نے اسے کھولنے کا ارادہ کیا، پس آسمان اور زمین کو جدا کر دیا، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**كَانَتَا رَتْقًا فَفَتَقْنَاهُمَا**\n(وہ دونوں جڑے ہوئے تھے، پھر ہم نے انہیں کھول دیا)۔\nیعنی ان میں سے بعض کو بعض سے ممتاز کر دیا۔\n\nپس آسمان نے بلندی کی طرف دھواں (دخان) اختیار کیا، اور آسمان اور زمین کے درمیان مرکبات (المركبات) کے دو رکن پیدا ہوئے۔\n۱. ایک رکن مرکب پانی (الماء المركب) ہے جو زمین کے قریب ہے، کیونکہ وہ ٹھنڈا اور مرطوب ہے۔ اس میں اوپر چڑھنے کی طاقت نہیں تھی، لہٰذا وہ زمین پر باقی رہا، اس میں موجود یبوست کی وجہ سے اس پر جما رہا۔\n۲. اور دوسرا رکن آگ (النار) ہے، جو اثیر کا کرہ ہے اور آسمان کے قریب ہے، کیونکہ وہ گرم اور خشک ہے۔ اس میں زمین کی طرف اترنے کی طبیعت نہیں تھی، لہٰذا وہ اپنی حرارت کی وجہ سے آسمان کے قریب رہا، اور یبوست نے اسے وہاں تھامے رکھا۔\n\nاور آگ اور پانی کے درمیان ہوا (الهواء) کا رکن پیدا ہوا، جو آگ کی حرارت اور پانی کی رطوبت سے بنا۔ یہ نہ تو آگ سے مل سکتا ہے، کیونکہ رطوبت کا بوجھ اسے آگ کے مقام پر ہونے سے روکتا ہے، اور نہ ہی رطوبت اسے پانی کے مقام تک نیچے لے جا سکتی ہے، کیونکہ حرارت اسے نیچے اترنے سے روکتی ہے۔ جب یہ دونوں رکاوٹیں آئیں، تو اس کے لیے آگ اور پانی کے درمیان رہنا ہی باقی رہا، کیونکہ وہ دونوں اسے برابر کھینچتے ہیں۔ اسی کو ہوا (ہواء) کہتے ہیں۔\n\nپس تمہارے لیے عناصر کے مراتب، ان کی ماہیت، ان کے ظہور کا مقام، اور طبیعت (الطبيعة) کی اصل واضح ہو گئی۔\n\n### [خلیفہ کا ظہور دورہ سنبلہ (العذراء) میں]\n\nجب افلاک گھومے اور ارکان نے اس معنوی نکاح میں جو کچھ ان میں ڈالا گیا تھا، اسے مکھن کی طرح نکالا، اور ہر رکن کی حقیقت کے تقاضے کے مطابق مولدات (پیدا ہونے والی چیزیں) ظاہر ہوئیں، تو عالم کی امتیں ظاہر ہوئیں، اور حرکت معکوسہ اور حرکت افقیہ ظاہر ہوئی۔ جب حکم سنبلہ (Virgo) تک پہنچا، تو عزیز و علیم (العزيز العليم) کے اندازے سے انسانی نشأت (النشأة الإنسانية) ظاہر ہوئی۔ پس اللہ عزوجل نے انسان کو اس کے جسم کے لحاظ سے ایک سیدھی تخلیق کے طور پر پیدا کیا، اور اسے حرکت مستقیمہ عطا کی، اور اللہ نے اسے عالم عنصری میں سات ہزار سال کی ولایت عطا کی۔\n\n### [قیامت کا زمانہ - فضل اور عدل کی حکومت - دورہ میزان (الميزان) میں]\n\nاور حکم میزان (Libra) کی طرف منتقل ہو گا، اور یہ قیامت کا زمانہ ہے۔ اسی میں اللہ قیامت کے دن انصاف کے ترازو (الموازين القسط) رکھے گا، تاکہ کسی جان پر ذرہ برابر بھی ظلم نہ ہو۔ اور چونکہ دنیا میں اس عدل کی وجہ سے جو اللہ نے اس میں ودیعت کیا تھا، اس کے لیے حکومت نہیں تھی، اس لیے اس نے ترازو (الموازين) کو مشروع کیا، مگر بہت کم لوگوں نے ان پر عمل کیا، اور وہ خاص طور پر انبیاء اور وہ اولیاء تھے جو محفوظ تھے۔ اور چونکہ قیامت میزان (Libra) کے تسلط کا مقام ہے، اس لیے کسی جان پر ذرہ برابر بھی ظلم نہیں ہو گا۔ اللہ تعالیٰ نے فرمایا:\n**وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْئًا ۖ وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا ۗ وَكَفَىٰ بِنَا حَاسِبِينَ**\n(اور ہم قیامت کے دن انصاف کے ترازو رکھیں گے، پس کسی جان پر ذرہ برابر بھی ظلم نہیں کیا جائے گا، اور اگر رائی کے دانے کے برابر بھی عمل ہو گا تو ہم اسے لے آئیں گے، اور ہم حساب لینے کے لیے کافی ہیں)۔\n\n### [عدد ۷ اور عدد ۱۲ کی رمزیت]\n\nاور چونکہ سنبلہ (العذراء) کے لیے اعداد میں سات کا عدد تھا، اس لیے اس کے لیے اجروں کے دوگنا ہونے اور صدقات میں مثالیں بیان کرنے میں سات، ستّر، اور سات سو کے اعداد تھے۔ اللہ تعالیٰ نے فرمایا:\n**مَّثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنبُلَةٍ مِّائَةُ حَبَّةٍ ۗ وَاللَّهُ يُضَاعِفُ لِمَن يَشَاءُ**\n(جو لوگ اپنا مال اللہ کی راہ میں خرچ کرتے ہیں، ان کی مثال اس دانے کی سی ہے جس نے سات خوشے اگائے، اور ہر خوشے میں سو دانے ہوں، اور اللہ جسے چاہتا ہے دوگنا کر دیتا ہے)۔\nیہ سات ہزار، ستر ہزار، سات لاکھ، اور لامتناہی تک جاتا ہے، لیکن یہ سات کے حساب سے ہے۔\n\nاور فلک اطلس (الفلك الأطلس) میں مقدرہ فرض بارہ ہی تھے، کیونکہ اعداد کے ناموں کی انتہا بارہ ناموں پر ہوتی ہے، جو ایک سے دس تک، پھر سو (جو گیارہواں ہے)، اور پھر ہزار (جو بارہواں ہے) ہے۔ اس کے بعد کوئی دوسرا مرتبہ نہیں ہے۔ اور ان میں ترکیب صرف ان ہی ناموں کے ذریعے تضعیف (دوگنا کرنے) کے ساتھ لامتناہی تک ہوتی ہے۔\n\n### [جنت اور دوزخ کے درمیان موت کے مینڈھے کو ذبح کرنے کے بعد قرار اور استقرار کی حکومت]\n\nاور لوگ جنت اور دوزخ میں داخل ہوں گے، اور یہ جوزاء (Gemini) کے گیارہویں درجے کے آغاز میں ہو گا۔ اور ہر گروہ اپنے ٹھکانے میں مستقر ہو جائے گا، اور دوزخ میں کوئی ایسا شخص باقی نہیں رہے گا جو شفاعت یا کسی الٰہی عنایت سے نکلے۔ اور موت کو جنت اور دوزخ کے درمیان ذبح کر دیا جائے گا۔\n\nاور اہل جنت میں حکم اس الٰہی امر کے مطابق لوٹ آئے گا جو اللہ نے فلک اقصیٰ (الفلك الأقصى) کی حرکات میں ودیعت کیا ہے، اور اسی کے ذریعے جنت میں آخرت کے گھر کی نشأت کے تقاضے کے مطابق تکوین (پیدائش) واقع ہو گی۔ کیونکہ حکم ہمیشہ قابلوں (قبول کرنے والوں) میں ہوتا ہے، حرکت ایک ہی ہے لیکن اس کے اثرات قابلوں کے مطابق مختلف ہوتے ہیں۔\n\nاور اس کا سبب یہ ہے تاکہ مخلوق میں سے کوئی بھی اپنے فعل یا امر میں بغیر شراکت کے خود مختار نہ ہو جائے، تاکہ اس سے اللہ کا فعل ممتاز ہو جائے جو مخلوق کے فعل کی شراکت کے بغیر کرتا ہے۔ پس مخلوق ہمیشہ احتیاج اور عجز کے مقام پر ہے، اور اللہ غنی اور عزیز ہے۔\n\nاور اہل دوزخ میں حکم اس الٰہی امر کے مطابق ہو گا جو اللہ تعالیٰ نے فلک اقصیٰ (الفلك الأقصى) کی حرکات میں، اور ثابت کواکب میں، اور سات سیاروں (الدراري السبعة) کی گردش میں ودیعت کیا ہے، اور وہ کواکب جن کی روشنیاں بجھ چکی ہیں (المطموسة الأنوار)، وہ کواکب تو ہیں لیکن ثاقب (چمکدار) نہیں ہیں۔ پس دوزخ کا حکم جنت کے حکم کے خلاف ہو گا۔ دوزخ کا حکم دنیا کے حکم کے قریب ہو گا، پس نہ تو وہ خالص عذاب ہو گا اور نہ ہی خالص نعمت۔ اسی لیے اللہ تعالیٰ نے فرمایا:\n**لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ**\n(نہ وہ اس میں مرے گا اور نہ ہی جیئے گا)۔\nپس اللہ نے اسے دونوں صورتوں میں سے کسی ایک کے لیے خالص نہیں کیا۔ اور اسی طرح نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n**أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون**\n(رہے اہل دوزخ جو اس کے مستحق ہیں، تو وہ اس میں نہ مریں گے اور نہ جیئیں گے)۔\n\nاور ہم نے اس سے پہلے باب میں نعمت اور عذاب کی صورت اور اس کا سبب بیان کر دیا ہے کہ ان پر وہ الٰہی امر باقی رہا جو اللہ نے افلاک اور کواکب کی حرکات میں ودیعت کیا تھا، اور اس میں سے اتنا ہی بدلا جتنا افلاک کی صورتوں میں تبدیلی اور کواکب میں روشنی کے بجھنے اور بکھرنے سے بدلا۔ پس ان کا حکم کمی اور زیادتی کے ساتھ مختلف ہو گیا، کیونکہ تبدیلی صورتوں میں واقع ہوئی ہے نہ کہ ذاتوں میں۔\n\n### [ملائکہ مہیمہ (المهيمة)، کروبیون (الكروبيون): حاجب، کاتب، لوح]\n\nاور جان لو کہ جب اللہ تعالیٰ نے اپنے آپ کو ملک (بادشاہ) کے نام سے موسوم کیا، تو اس نے عالم کو مملکت (بادشاہت) کی ترتیب پر منظم کیا۔ پس اس نے اپنے بندوں میں سے خاص لوگ بنائے، اور وہ ملائکہ مہیمہ (الملائكة المهيمة) ہیں جو حق تعالیٰ کے ذکر کے ساتھ اس کے ہم نشین ہیں:\n**لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَلَا يَسْتَحْسِرُونَ ﴿١٩﴾ يُسَبِّحُونَ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ**\n(وہ اس کی عبادت سے نہ تکبر کرتے ہیں اور نہ تھکتے ہیں، وہ رات دن تسبیح کرتے ہیں اور سست نہیں ہوتے)۔\n\nپھر اس نے کروبیون (الكروبيون) میں سے ایک کو حاجب (پردہ دار) بنایا، اور اسے اپنی مخلوق کے بارے میں اپنا علم عطا کیا، اور یہ علم اجمال میں تفصیل ہے۔ پس اللہ کا علم اس میں اس کے لیے ایک جلوہ گاہ (مجلی) تھا، اور اس ملک کا نام نون (النون) رکھا گیا۔ وہ ہمیشہ اللہ عزوجل کے علم کی بارگاہ میں معتکف رہتا ہے، اور وہ الٰہی دیوان کا سربراہ ہے۔ اور حق (الحق) کے علیم ہونے کی حیثیت سے وہ اس سے پردہ نہیں کرتا۔\n\nپھر اس نے اپنے ملائکہ میں سے ایک اور ملک کو مقرر کیا جو مرتبہ میں اس سے کم تھا، اسے قلم (القلم) کا نام دیا، اور اس کا مقام نون (النون) سے نیچے رکھا، اور اسے کاتب (لکھنے والا) بنایا۔ پس اللہ سبحانہ و تعالیٰ اسے اپنے علم میں سے جو کچھ اپنی مخلوق میں چاہتا ہے، نون (النون) کی وساطت سے سکھاتا ہے، لیکن یہ علم اجمالی میں سے ہوتا ہے۔ اور جو علم اجمالی اپنے اندر رکھتا ہے، اس میں سے علم تفصیل بھی ہے، کیونکہ یہ اجمالی علوم میں سے بعض ہے۔ چونکہ علوم کے مراتب ہوتے ہیں، جن میں سے ایک علم تفصیل ہے۔ پس الٰہی قلم (القلم الإلهي) کے پاس اجمالی علوم کے مراتب میں سے صرف مطلق علم تفصیل اور بعض مفصل علوم ہی ہیں۔\n\nاور اس ملک کو اپنے دیوان کا کاتب بنایا، اور اپنے اسم القادر (القادر) سے اس پر تجلی (التجلی) فرمائی، پس اس الٰہی ظہور (التجلی) سے اسے مدد دی، اور اس کی نظر عالم تدوین اور تسطیر (لکھنے اور سطریں کھینچنے) کی طرف کر دی۔ پس اس کے لیے ایک لوح (لوح) پیدا کی، اور اسے حکم دیا کہ اس میں وہ سب کچھ لکھ دے جو اللہ سبحانہ و تعالیٰ قیامت تک اپنی مخلوق میں جاری کرنا چاہتا ہے۔ اور اسے اس سے استاد کے مقابلے میں شاگرد کا مقام دیا۔ پس یہاں اس پر الٰہی ارادہ (الإرادة الإلهية) متوجہ ہوا، اور اس کے لیے مفصل علوم کی یہ مقدار خاص کر دی گئی۔ اور اس کے لیے حق (الحق) کی طرف سے بلا واسطہ دو تجلیات (التجلی) ہیں، جبکہ نون (النون) کے لیے صرف ایک تجلی ہے، اگرچہ وہ اشرف مقام پر ہے۔ کیونکہ تجلیات کی کثرت یا تعدد اشرفیت پر دلالت نہیں کرتا، بلکہ اشرف وہ ہے جس کا مقام زیادہ عام ہو۔\n\nپس اللہ نے نون (النون) کو حکم دیا کہ وہ قلم (القلم) کو اجمالی علوم میں سے تین سو ساٹھ علوم کی مدد دے، جن میں سے ہر علم کے تحت تفاصیل ہیں، لیکن وہ معین اور محدود ہیں، اس کے علاوہ اسے کچھ نہیں دیا گیا۔ ان اجمالی علوم میں سے ہر ایک تین سو ساٹھ تفصیلی علوم پر مشتمل ہے۔ پس اگر تم تین سو ساٹھ کو اسی سے ضرب دو، تو جو مقدار نکلے گی، وہ خاص طور پر قیامت تک اللہ کے علم کی مقدار ہے جو اس کی مخلوق میں ہے۔ لوح (اللوح) کے پاس اس علم سے زیادہ نہیں ہے جو اس قلم نے اس میں لکھا ہے، نہ اس میں اضافہ ہوتا ہے اور نہ کمی۔\n\nاور اسی الٰہی حقیقت کی وجہ سے اللہ نے فلک اقصیٰ (الفلك الأقصى) کو تین سو ساٹھ درجے بنائے، اور ہر درجہ اجمالی ہے اس تفصیل کے لیے جو وہ اپنے اندر رکھتا ہے، دقائق، ثوانی، اور ثوالث تک، جو کچھ اللہ سبحانہ و تعالیٰ قیامت تک اپنی مخلوق میں ظاہر کرنا چاہتا ہے۔ اور اس کاتب قلم (القلم الكاتب) کا نام رکھا گیا۔\n\n### [ملائکہ مدبرہ: عالم خلق کے بارہ والیان (الولاة)]\n\nپھر اللہ سبحانہ و تعالیٰ نے حکم دیا کہ عالم خلق پر بارہ والیان (الولاة) مقرر کیے جائیں، جن کا ٹھکانہ ہم سے فلک اقصیٰ (الفلك الأقصى) میں بروج (Zodiac signs) میں ہو گا۔ پس اس نے فلک اقصیٰ کو بارہ حصوں میں تقسیم کیا، اور ان میں سے ہر حصے کو ان والیان کے رہنے کے لیے ایک برج بنایا، جیسے شہر کی فصیل کے برج ہوتے ہیں۔ پس اللہ نے انہیں ان میں اتارا، اور وہ ان میں اترے، ہر والی اپنے برج میں ایک تخت پر۔\n\nاور اللہ نے ان کے اور لوح محفوظ (اللوح المحفوظ) کے درمیان سے پردہ اٹھا دیا، پس انہوں نے اس میں اپنے نام، اپنے مراتب، اور جو کچھ حق (الحق) نے قیامت تک عالم خلق میں ان کے ہاتھوں جاری کرنا چاہا، وہ سب لکھا ہوا دیکھا۔ پس وہ سب ان کے نفوس میں نقش ہو گیا، اور انہوں نے اسے محفوظ علم کے طور پر جان لیا جو نہ بدلتا ہے اور نہ متغیر ہوتا ہے۔\n\nپھر اللہ نے ان والیان میں سے ہر ایک کے لیے دو حاجب (پردہ دار) مقرر کیے جو ان کے اوامر کو ان کے نائبین تک پہنچاتے ہیں۔ اور ہر دو حاجبوں کے درمیان ایک سفیر (پیغام رساں) مقرر کیا جو ان دونوں کے درمیان چلتا ہے، جو کچھ ان میں سے ہر ایک اسے دیتا ہے۔\n\nاور اللہ نے ان حاجبوں کے لیے، جنہیں اللہ نے ان والیان کا پردہ دار بنایا، ہم سے دوسرے فلک میں ٹھکانے مقرر کیے اور انہیں ان میں اتارا۔ اور یہ اٹھائیس منازل ہیں جنہیں منازل کہا جاتا ہے، جن کا ذکر اللہ نے اپنی کتاب میں کیا، فرمایا:\n**وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ**\n(اور ہم نے چاند کے لیے منزلیں مقرر کیں)۔\nیعنی اس کی گردش میں، وہ ہر رات ایک منزل میں اترتا ہے، یہاں تک کہ وہ آخری منزل تک پہنچ جاتا ہے، پھر وہ ایک اور دورہ کرتا ہے،\n**لِتَعْلَمُوا عَدَدَ السِّنِينَ وَالْحِسَابَ**\n(تاکہ تم اس کی گردش اور سورج کی گردش کے ذریعے سالوں کی گنتی اور حساب جان لو)۔\nاور ہر چیز کو حق (الحق) نے ہمارے لیے تفصیل سے بیان کر دیا ہے۔ پس اللہ نے ان منازل میں ان ملائکہ کو ٹھہرایا، اور وہ ان والیان کے حاجب ہیں جو فلک اقصیٰ (الفلك الأقصى) میں ہیں۔\n\n### [سات آسمانوں میں بارہ والیان کے نقیب (نقباء)]\n\nپھر اللہ تعالیٰ نے ان والیان کو حکم دیا کہ وہ سات آسمانوں میں اپنے نائبین اور نقیب (نقباء) مقرر کریں، ہر آسمان میں ایک نقیب، جو ان کے لیے حاجب کی طرح ہو، جو عالم عنصری کے مصالح کو دیکھے، جو کچھ یہ والیان انہیں القاء کرتے ہیں اور انہیں حکم دیتے ہیں۔ اور یہی اللہ کا قول ہے:\n**وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا**\n(اور اس نے ہر آسمان میں اس کا امر وحی کیا)۔\n\nپس اللہ نے ان نقیبوں کے کواکب کے اجسام کو روشن، گول اجسام بنایا، اور ان میں ان کی روحیں پھونکیں، اور انہیں سات آسمانوں میں اتارا، ہر آسمان میں ان میں سے ایک۔ اور ان سے کہا: \"میں نے تمہیں مقرر کیا ہے کہ تم ان بارہ والیان کے پاس جو کچھ ہے، اسے ان اٹھائیس حاجبوں کی وساطت سے نکالو، جیسے وہ والیان لوح محفوظ (اللوح المحفوظ) سے لیتے ہیں۔\"\n\nپھر اللہ نے ان سات نقیبوں میں سے ہر ایک کے لیے ایک فلک بنایا جس میں وہ گردش کرتا ہے، جو اس کے لیے سوار کے لیے گھوڑے کی طرح ہے۔ اور اسی طرح حاجبوں کے لیے بھی افلاک ہیں جن میں وہ گردش کرتے ہیں، کیونکہ انہیں عالم کے حوادث میں تصرف اور اس پر نگرانی حاصل ہے۔ اور ان کے خادم اور مددگار ہیں جن کی تعداد ہزار سے زیادہ ہے۔ اور اللہ نے انہیں سواریاں عطا کیں جنہیں افلاک کا نام دیا، پس وہ بھی ان میں گردش کرتے ہیں، اور وہ انہیں ہر روز ایک بار مملکت پر گھماتے ہیں۔ پس ان سے آسمانوں اور زمین کی مملکت میں سے کوئی چیز بالکل بھی نہیں چھوٹتی۔\n\nپس والیان، یہ حاجب، نقیب، اور خادم سب ان والیان کی خدمت میں گردش کرتے ہیں، اور یہ سب ہمارے حق میں مسخر ہیں، کیونکہ ہم ہی عالم کا مقصود ہیں۔ اللہ تعالیٰ نے فرمایا:\n**وَسَخَّرَ لَكُم مَّا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِّنْهُ**\n(اور اس نے تمہارے لیے وہ سب کچھ مسخر کر دیا جو آسمانوں میں ہے اور جو زمین میں ہے، سب اسی کی طرف سے ہے)۔\nاور اللہ نے تورات میں نازل فرمایا: \"اے ابن آدم! میں نے چیزوں کو تیرے لیے پیدا کیا اور تجھے اپنے لیے پیدا کیا۔\"\n\n### [ملک (بادشاہ)، ملک (بادشاہت) اور مملکت (سلطنت)]\n\nاور اسی طرح بادشاہ (الملك) کو چاہیے کہ وہ ہر روز اپنی مملکت کے لوگوں کے حالات پر نظر رکھے، اللہ تعالیٰ فرماتا ہے:\n**كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ**\n(وہ ہر روز ایک نئی شان میں ہوتا ہے)۔\nکیونکہ\n**يَسْأَلُهُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ**\n(جو کوئی آسمانوں اور زمین میں ہے، وہ اس سے سوال کرتا ہے)\nزبان حال اور زبان قال سے۔ اور عالم کی حفاظت اسے تھکاتی نہیں،\n**وَهُوَ الْعَلِيُّ الْعَظِيمُ**\n(اور وہ بلند و بالا، عظمت والا ہے)۔\nپس اسے ان کے علاوہ کوئی مشغولیت نہیں ہے۔ اللہ تعالیٰ فرماتا ہے:\n**يُدَبِّرُ الْأَمْرَ مِنَ السَّمَاءِ إِلَى الْأَرْضِ**\n(وہ آسمان سے زمین تک امر کی تدبیر کرتا ہے)،\n**يُفَصِّلُ الْآيَاتِ**\n(وہ آیات کو کھول کر بیان کرتا ہے)۔\n\nاور اگر بادشاہت (الملك) کا وجود نہ ہوتا تو بادشاہ (الملك) کو بادشاہ نہ کہا جاتا۔ پس اس کی اپنی بادشاہت کی حفاظت اس کے لیے اسم الملک (بادشاہ) کے باقی رہنے کی حفاظت ہے۔ اگرچہ وہ جیسا کہ فرمایا:\n**فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ**\n(تو بے شک اللہ تمام جہانوں سے بے نیاز ہے)۔\nلیکن وہ اسم الملک کے ساتھ آیا ہے، اور اضافت کے اسماء مضاف کے بغیر نہیں ہوتے۔\n\nپس جو بھی سلطان اپنی رعایا کے حالات پر نظر نہیں رکھتا، اور ان میں عدل کے ساتھ نہیں چلتا، اور ان کے ساتھ وہ احسان نہیں کرتا جو ان کے لائق ہے، تو اس نے حقیقت میں خود کو معزول کر لیا۔ اور فقہاء کہتے ہیں کہ جب حاکم فاسق ہو جائے یا ظلم کرے تو وہ شرعاً معزول ہو جاتا ہے۔ لیکن ہمارے نزدیک وہ شرعاً صرف اسی چیز میں معزول ہوتا ہے جس میں اس نے فسق کیا، کیونکہ اس نے اس حکم کے مطابق فیصلہ نہیں کیا جس کا اسے حکم دیا گیا تھا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے ان کو ان کے ظلم کے باوجود والیان (ولاة) ثابت کیا، پس آپ نے ہمارے اور ان کے بارے میں فرمایا:\n**فإن عدلوا فلكم ولهم وإن جاروا فلكم وعليهم**\n(اگر وہ عدل کریں تو تمہارے لیے بھی ہے اور ان کے لیے بھی، اور اگر وہ ظلم کریں تو تمہارے لیے بھی ہے اور ان پر بھی)۔\nاور آپ نے اطاعت سے ہاتھ کھینچنے سے منع فرمایا، اور آپ نے کسی والی کو اس سے خاص نہیں کیا۔ اسی لیے ہم نے اس کے شرعی عزل میں اضافہ کیا کہ یہ صرف اسی چیز میں ہے جس میں اس نے فسق کیا۔\n\nپس بادشاہ کو حکم ہے کہ وہ اپنے آپ کو ان احکام سے باہر نکلنے سے محفوظ رکھے جو اس کی رعایا اور اس کے اپنے بارے میں مقرر کیے گئے ہیں، کیونکہ وہ اپنے نفس پر بھی والی ہے۔\n**كلكم راع وكلكم مسئول عن رعيته**\n(تم میں سے ہر ایک نگہبان ہے اور تم میں سے ہر ایک سے اس کی رعیت کے بارے میں پوچھا جائے گا)۔\nپس انسان اپنے نفس پر نگہبان ہے، اور اس سے زیادہ پر نہیں۔ اسی لیے نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n**إن لنفسك عليك حقا ولعينك عليك حقا**\n(بے شک تمہارے نفس کا تم پر حق ہے، اور تمہاری آنکھ کا تم پر حق ہے)۔ (الحدیث)\n\nپس جس نے اس شخص کے ساتھ وفا نہیں کی جس کے ساتھ اس نے بیعت کی تھی، تو اس نے خود کو معزول کر لیا، اور وہ بادشاہ نہیں ہے، اگرچہ وہ حاکم ہو۔ کیونکہ ہر حاکم سلطان نہیں ہوتا۔ سلطان وہ ہے جس کے لیے حجت ہو، نہ کہ اس کے خلاف۔\n\nاور اسی لیے اللہ نے افلاک کو ہم پر ہر روز ایک دورہ کرنے کے لیے بنایا، تاکہ والیان (الولاة) دیکھیں کہ مخلوق کی کیا ضرورت ہے، پس وہ کمی کو پورا کرتے ہیں اور اللہ کے احکام کو نافذ کرتے ہیں، اس حیثیت سے کہ وہ اپنی مخلوق میں ارادہ کرنے والا ہے، نہ کہ اس حیثیت سے کہ وہ حکم دینے والا ہے۔ پس وہ اس کے احکام کو نافذ کرتے ہیں جن کے نفاذ کا اللہ سبحانہ و تعالیٰ نے انہیں حکم دیا ہے، اور وہ مختلف زمانوں میں قضاء اور قدر (القضاء والقدر) ہے۔ پس ہر چیز قضاء اور قدر کے ساتھ ہے، یہاں تک کہ عجز اور ہوشیاری بھی۔ اور ہر چھوٹی اور بڑی چیز لوح محفوظ (اللوح المحفوظ) میں لکھی ہوئی ہے۔ پس اس میں وہی ہے جو واقع ہوتا ہے، اور یہ والیان عالم میں صرف وہی نافذ کرتے ہیں جو اس میں ہے۔ اور اللہ ہر چیز پر نگہبان ہے۔\n\nاور اس سب کے باوجود، اللہ کا مملکت میں سے ہر ایک کے ساتھ اس کے نفس میں ایک خاص امر ہے، جسے والیان، حاجب، اور نقیب جانتے ہیں۔ پس وہ اس وجہ کے مشاہدے سے محروم نہیں ہوتے، تاکہ وہ جان لیں کہ اللہ نے\n**قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا**\n(ہر چیز کو علم سے گھیر رکھا ہے)\nاور یہ کہ وہ ہر جان پر نگہبان ہے جو اس نے کمایا، اور\n**إِنَّهُ بِكُلِّ شَيْءٍ مُّحِيطٌ**\n(بے شک وہ ہر چیز کو گھیرے ہوئے ہے)۔\n\n### [والی ملائکہ کے ماتحت مسخر ملائکہ]\n\nاور جب اللہ نے ان امور کی باگ ڈور ملائکہ کے اس گروہ کے ہاتھ میں دے دی، اور ان میں سے جسے اس کے برج اور اس کے ٹھکانے میں بٹھایا جہاں اس کا تخت سلطنت ہے، اور حاجبوں اور نقیبوں میں سے جسے ان کے آسمانوں میں ان کے ٹھکانوں پر اتارا، اور ہر آسمان میں مسخر ملائکہ (ملائكة مسخرة) کو ان والیان کے ماتحت کر دیا، اور ان کی تسخیر کو طبقات پر رکھا۔\n\nپس ان میں سے وہ ہیں جو رات اور دن حق (الحق) کی طرف سے ہماری طرف اور ہماری طرف سے حق کی طرف عروج کرتے ہیں، اور وہ ہمارے حق میں صرف خیر ہی کہتے ہیں۔ اور ان میں سے وہ ہیں جو زمین والوں کے لیے استغفار کرتے ہیں۔ اور ان میں سے وہ ہیں جو مومنوں کے لیے استغفار کرتے ہیں، ان پر الٰہی غیرت کے غلبے کی وجہ سے، جیسا کہ زمین والوں کے لیے استغفار کرنے والوں پر رحمت کا غلبہ ہے۔\n\nاور ان میں سے وہ ہیں جو شرائع (قوانین) پہنچانے پر مقرر ہیں۔ اور ان میں سے وہ ہیں جو لمات (شیطانی وسوسے) پر مقرر ہیں۔ اور ان میں سے وہ ہیں جو الہام (الإلهام) پر مقرر ہیں، اور وہ دلوں تک علوم پہنچانے والے ہیں۔ اور ان میں سے وہ ہیں جو ارحام (رحموں) پر مقرر ہیں۔ اور ان میں سے وہ ہیں جو ارحام میں اللہ کی تخلیق کی تصویر کشی پر مقرر ہیں۔ اور ان میں سے وہ ہیں جو روحیں پھونکنے پر مقرر ہیں۔ اور ان میں سے وہ ہیں جو رزق پر مقرر ہیں۔ اور ان میں سے وہ ہیں جو بارشوں پر مقرر ہیں۔ اسی لیے انہوں نے کہا:\n**وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَّعْلُومٌ**\n(اور ہم میں سے کوئی نہیں مگر اس کا ایک مقرر مقام ہے)۔\n\nاور عالم میں اللہ جو بھی حادثہ پیدا کرتا ہے، اللہ نے اس کے جاری کرنے پر ملائکہ کو مقرر کیا ہے، لیکن ان والیان (الولاة) کے حکم سے۔ جیسا کہ ان میں سے صافات (صفیں باندھنے والے)، زاجرات (جھڑکنے والے)، تالیات (تلاوت کرنے والے)، مقسمات (تقسیم کرنے والے)، مرسلات (بھیجے جانے والے)، ناشرات (پھیلانے والے)، نازعات (کھینچنے والے)، ناشطات (آسانی سے نکالنے والے)، سابقات (سبقت لے جانے والے)، سابحات (تیرنے والے)، ملقيات (القاء کرنے والے)، اور مدبرات (تدبیر کرنے والے) بھی ہیں۔\n\nاور اس سب کے باوجود، وہ ملائکہ مہیمہ (الأرواح المهيمة) کے علاوہ ان والیان کے تسلط کے تحت رہتے ہیں، کیونکہ وہ اللہ کی خصوصیات ہیں۔ اور ان کے علاوہ جو ہیں، وہ اللہ کے احکام کو اس کی مخلوق میں نافذ کرتے ہیں۔ پھر عام لوگ صرف ان کے ٹھکانوں کا مشاہدہ کرتے ہیں، اور خاص لوگ انہیں ان کے ٹھکانوں میں دیکھتے ہیں، جیسا کہ عام لوگ کواکب کے اجسام کا مشاہدہ کرتے ہیں اور حاجبوں اور نقیبوں کے اعیان کا مشاہدہ نہیں کرتے۔\n\n### [عالم عناصر اور افلاک کے والیان کے درمیان رقائق اور مناسبات]\n\nاور اللہ نے عالم عنصری میں ان کی جنس سے مخلوق پیدا کی، پس ان میں سے رسول، خلفاء، سلاطین، بادشاہ، اور عالم کے امور کے والیان ہیں۔ اور اللہ نے ان لوگوں کی روحوں کے درمیان، جنہیں اللہ نے زمین میں ان کے اہل میں سے والی بنایا ہے، اور افلاک میں ان والیان کے درمیان مناسبات اور رقائق (لطیف تعلقات) بنائے ہیں۔ یہ رقائق ان والیان سے عدل کے ساتھ ان کی طرف پھیلتی ہیں، جو آلائشوں سے پاک اور عیوب سے مقدس ہوتی ہیں۔\n\nپس زمین کے ان والیان کی روحیں ان سے اس امر کو اپنی استعداد کے مطابق قبول کرتی ہیں۔ پس جس کی استعداد قوی اور اچھی ہوتی ہے، وہ اس ظاہر ہونے والے امر کو اس کی صورت پر، پاک اور مطہر قبول کرتا ہے، پس وہ عدل کا والی اور فضل کا امام بنتا ہے۔ اور جس کی استعداد بری ہوتی ہے، وہ اس ظاہر ہونے والے امر کو قبول کرتا ہے اور اسے اپنی برائی اور قباحت کی شکل میں لوٹا دیتا ہے، پس وہ ظلم کا والی اور جور و بخل کا نائب بنتا ہے۔ پس وہ اپنے آپ کو ہی ملامت کرے گا۔\n\nپس میں نے تمہارے لیے عالم بالا کی عالم زیریں پر سلطنت واضح کر دی، اور اللہ نے اپنی بادشاہت کو یہ عجیب ترتیب کیسے دی۔ اور ہم نے اس میں سے صرف امہات (اصول) کا ہی ذکر کیا ہے۔ اللہ تعالیٰ فرماتا ہے:\n**وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا**\n(اور اس نے ہر آسمان میں اس کا امر وحی کیا)۔\nاور فرمایا:\n**يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ**\n(امر ان کے درمیان نازل ہوتا ہے)۔\nاور اس باب میں یہ مقدار کافی ہے۔ اور اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے۔\n\nاور کتاب \"التنزلات الموصلیہ\" میں ہم نے ان والیان، نائبین، اور حاجبوں کی حدیث کا ذکر کیا ہے، اور جو کچھ اللہ نے انہیں عالم عنصری میں روحانی تاثیرات پر مقرر کیا ہے۔ اس میں سے ہم نے ان چیزوں کا ذکر نہیں کیا جو وہ طبیعت اور بدنی امور سے عطا کرتے ہیں۔ اور ہم نے اس میں ہر اس چیز پر تفصیل سے بات کی ہے جس کا ہم نے اتوار کے باب میں ذکر کیا ہے، جو امام کا باب ہے۔ اور ہم نے اتوار کے دن کے باب میں اور ہفتہ کے دن تک باقی دنوں میں سات نقیبوں میں سے ہر ایک کے ہاتھ میں کیا ہے، اسے بیان کیا ہے۔ اور ہم نے اس میں انبیاء علیہم السلام کی روحوں کے مقامات کو بیان کیا ہے، اور ہم نے یہ روحانی القاب انبیاء علیہم السلام کی روحوں کے لیے بنائے ہیں۔ اور ہم نے قیامت کے دن رویت اور حجاب میں ان کے مراتب کو بیان کیا ہے، اور جو کچھ وہ سعادت مند اور بدبخت لوگوں میں سے اپنے پیروکاروں کے بارے میں بات کریں گے، اور یہ آدم کی زبان اور قمر (چاند) کے ترجمے کے ساتھ پیر کے دن کے باب میں ہے، اور یہ اپنے معاملے میں عجیب آیا ہے۔ اور اللہ ہی مددگار اور توفیق دینے والا ہے، اس کے سوا کوئی رب نہیں۔",
    "fa": "باب شصتم: در معرفت عناصر\n\nو سلطنت عالم علوی بر عالم سفلی، و اینکه وجود این عالم انسانی در کدام دوره از دوره‌های فلک اقصی بوده است، و چه روحانیتی برای ماست. (بسم الله الرحمن الرحیم)\n\n> عناصر را چهار مادر است، *** و آنها دختران عالم افلاک‌اند.\n> از آنها زاده شدیم و وجود ما *** در عالم ارکان و املاک (فرشتگان) پدید آمد.\n> خداوند روزی ما را در خوشه‌هایی *** از حکم سنبله (برج خوشه) بدون شریک قرار داد.\n> و همچنین پاداش ما را با خوشه‌هایی *** هفت‌گانه مضاعف کرد، که قولی دروغ نیست.\n> و زمان ما هفت هزار سال است *** که با تکرار روشنایی‌ها و تاریکی‌ها (روز و شب) می‌آید.\n> پس با عقل خود بنگر هفت در هفت را *** از هفت‌هایی که از املاک (پادشاهان) نیستند.\n> و با فکر خود در تناسب حکم آنها نظر کن *** و با شمشیری برنده و قاطع ضربه بزن.\n\n### [حقایق الهی چهارگانه و مراتب علوم چهارگانه]\n\nمنظور از «املاک» اول، فرشتگان (جمع مَلَک) است و منظور از «املاک» دوم، پادشاهان (جمع مَلِک) است. می‌گوید: آنها مسخر شده‌اند و مسخر شده شایسته نام پادشاه (مَلِک) نیست. هفت مورد ذکر شده، هفت سیاره (دراری) در هفت فلک هستند که از هفت روز (ایام جمعه) پدید آمده‌اند و اینها مربوط به حرکتی است که بالای آسمان‌ها قرار دارد و آن حرکت روزانه فلک اقصی است.\n\nبدان که هر چیزی از اکوان (موجودات) ناگزیر باید به حقایق الهی مستند باشد. پس هر علمی در علم الهی (العلم الإلهي) گنجانده شده و تمامی علوم از آن منشعب گشته‌اند. این علوم در چهار مرتبه منحصر می‌شوند و هر مرتبه به انواع معلوم و محصوری نزد دانشمندان تقسیم می‌گردد: علم منطقی، علم ریاضی، علم طبیعی و علم الهی.\n\nعالم از حقایق الهی چهار نسبت را طلب می‌کند: حیات، علم، اراده و قدرت (القدرة). اگر این چهار نسبت برای واجب الوجود (الواجب الوجود) ثابت شود، صحیح است که او بی‌شک ایجادکننده عالم است. حیات و علم دو اصل در این نسبت‌ها هستند و اراده و قدرت پایین‌تر از آنها قرار دارند. و اصل، حیات است، زیرا شرط وجود علم است. علم تعلق عام دارد، زیرا به واجب الوجود، ممکن و محال تعلق می‌گیرد. اراده در تعلق پایین‌تر از علم است، زیرا تنها به ممکن تعلق می‌گیرد تا آن را به یکی از دو حالت وجود یا عدم ترجیح دهد. پس اراده را حیات می‌طلبد و اراده مانند منفعل از حیات است، زیرا تعلق آن عام‌تر از قدرت است. قدرت تعلق خاص‌تری دارد، زیرا تنها به ایجاد ممکن تعلق می‌گیرد نه به معدوم کردن آن. پس قدرت مانند منفعل از علم است، زیرا نسبت آن به اراده مانند نسبت علم به حیات است.\n\n### [اصول چهارگانه برای ظهور صورت‌های عالم]\n\nهنگامی که مراتب در این نسبت‌های الهی متمایز شدند، فاعل از منفعل متمایز گشت و عالم به صورت فاعل و منفعل خارج شد. عالم نسبت به خداوند از حیث کلی، منفعل و حادث است؛ اما با نظر به خودش، برخی از آن فاعل و برخی منفعل هستند.\n\nخداوند سبحان عقل اول (العقل الأول) را از نسبت حیات ایجاد کرد و نفس (النفس) را از نسبت علم ایجاد کرد. پس عقل شرط وجود نفس بود، همان‌گونه که حیات شرط وجود علم است. و دو منفعل از عقل و نفس، هباء (الهباء) و جسم کل (الجسم الكل) بودند. پس این چهار مورد، اصل ظهور صورت‌ها در عالم هستند.\n\n### [مرتبه طبیعت و حقایق چهارگانه آن]\n\nبا این حال، بین نفس و هباء مرتبه طبیعت (الطبيعة) قرار دارد که بر چهار حقیقت استوار است؛ دو تای آنها فاعل و دو تای دیگر منفعل هستند. همه آنها در مرتبه انفعال قرار دارند، با نظر به منشأ صدورشان. این حقایق عبارتند از: حرارت، برودت (سردی)، رطوبت (تری) و یبوست (خشکی). یبوست منفعل از حرارت است و رطوبت منفعل از برودت.\n\nحرارت از عقل است و عقل از حیات؛ به همین دلیل طبع حیات در اجسام عنصری، حرارت است. برودت از نفس است و نفس از علم؛ و به همین دلیل است که علم هنگامی که مستقر شود، به «سردی یقین» و «برف» توصیف می‌شود. و از همین روست سخن پیامبر (صلی الله علیه و سلم) هنگامی که سردی انگشتان را بین دو پستان خود یافت، پس علم اولین و آخرین را دانست.\n\nهنگامی که یبوست و رطوبت از حرارت و برودت منفعل شدند، اراده، یبوست را طلب کرد زیرا در مرتبه آن قرار دارد و قدرت، رطوبت را طلب کرد زیرا در مرتبه آن قرار دارد. و چون قدرت تنها به ایجاد تعلق دارد، شایسته‌ترین به آن طبع حیات است که همان حرارت و رطوبت در اجسام است. و صورت‌ها و شکل‌ها در هباء و جسم کل ظاهر شدند، پس آسمان و زمین به صورت به هم پیوسته و نامتمایز ظاهر گشتند.\n\n### [مراتب عناصر، ماهیت و منشأ آنها]\n\nسپس خداوند متعال به گشودن این پیوستگی توجه کرد تا اعیان آنها را متمایز سازد. اصل در وجود آنها آب بود و به همین دلیل فرمود: **وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ** (و هر چیز زنده‌ای را از آب قرار دادیم). و به دلیل حیاتش به تسبیح وصف شد.\n\nخداوند ابتدا این طبایع چهارگانه را به نظمی مخصوص سازمان داد:\n\n۱. حرارت را به یبوست ضمیمه کرد، پس آتش بسیط معقول (النار البسيطة المعقولة) پدید آمد. حکم آن در جسم عرش که همان فلک اقصی و جسم کل است، در سه مکان ظاهر شد: مکان اول را حمل (برج قوچ) نامید، مکان دوم را که پنجمین مکان مقدر در آن است، اسد (برج شیر) نامید، و مکان سوم را که نهمین مکان مقدر در آن است، قوس (برج کمان) نامید.\n\n۲. سپس برودت را به یبوست ضمیمه کرد و سلطنت آن دو را در سه مکان از این فلک ظاهر ساخت که همان خاک بسیط معقول (التراب البسيط المعقول) است. مکان اول را ثور (برج گاو)، دیگری را سنبله (برج خوشه) و سومی را جدی (برج بزغاله) نامید.\n\n۳. سپس حرارت را به رطوبت ضمیمه کرد، پس هوای بسیط (الهواء البسيط) پدید آمد و حکم آن را در سه مکان از این فلک اقصی ظاهر ساخت: مکان اول را جوزاء (برج دوپیکر)، دیگری را میزان (برج ترازو) و سومی را دالی (برج دلو) نامید.\n\n۴. سپس برودت را به رطوبت ضمیمه کرد، پس آب بسیط (الماء البسيط) پدید آمد و حکم آن را در سه مکان از فلک اقصی ظاهر ساخت: مکان اول را سرطان (برج خرچنگ)، دیگری را عقرب (برج کژدم) و سومی را حوت (برج ماهی) نامید.\n\nاین تقسیم فلک بروج به دوازده بخش مفروض است که ۲۸ ستاره (منازل قمر) آن را تعیین می‌کنند، و این به تقدیر خدای عزیز و داناست.\n\n### [گشودن دایره وجود پس از پیوستگی آن]\n\nهنگامی که خداوند ساخت و ترتیب آن را محکم کرد و آن را به گردش درآورد، وجود به صورت به هم پیوسته ظاهر شد. پس حق (الحق) اراده کرد که آن را بگشاید و بین آسمان و زمین جدایی انداخت، چنانکه خداوند متعال فرمود: **كَانَتَا رَتْقًا فَفَتَقْنَاهُمَا** (آن دو به هم پیوسته بودند، پس ما آنها را از هم گشودیم)؛ یعنی برخی را از برخی دیگر متمایز ساخت.\n\nآسمان به صورت دود به بالا رفت، پس در میان آسمان و زمین دو رکن از مرکبات پدید آمد:\n\n۱. رکن اول آب مرکب است که به زمین نزدیک است، زیرا سرد و مرطوب است و نیروی صعود نداشت، پس بر روی زمین باقی ماند و یبوست موجود در زمین آن را نگه داشت.\n\n۲. و دیگری آتش است که کره اثیر است و به آسمان نزدیک است، زیرا گرم و خشک است و طبع نزول به زمین نداشت، پس به دلیل حرارتش در نزدیکی آسمان باقی ماند و یبوست آن را در آنجا نگه داشت.\n\nو در میان آتش و آب، رکن هوا از حرارت آتش و رطوبت آب پدید آمد. هوا نمی‌تواند به آتش بپیوندد، زیرا سنگینی رطوبت مانع می‌شود که در جایگاه آتش باشد؛ و اگرچه رطوبت می‌خواهد آن را به جایگاه آب پایین آورد، حرارت مانع نزول آن می‌شود. هنگامی که این دو مانع شدند، چاره‌ای جز این نماند که هوا بین آب و آتش قرار گیرد، زیرا هر دو به طور مساوی آن را به سوی خود می‌کشند. این همان چیزی است که هوا نامیده می‌شود. پس مراتب عناصر و ماهیت آنها و منشأ ظهورشان و اصل طبیعت برای تو آشکار شد.\n\n### [ظهور خلیفه در دوره سنبله (عذراء)]\n\nهنگامی که افلاک چرخیدند و ارکان آنچه را که در این نکاح معنوی در آنها افکنده شده بود، به هم زدند و مولدات (موجودات زاینده) از هر رکن بر حسب اقتضای حقیقت آن رکن ظاهر شدند، امت‌های عالم و حرکت معکوس و حرکت افقی پدید آمدند.\n\nهنگامی که حکم به سنبله (برج خوشه/عذراء) رسید، نشأت انسانی به تقدیر خدای عزیز و دانا ظاهر شد. خداوند عز و جل انسان را از حیث جسمش به خلقی متناسب آفرید و به او حرکت مستقیم داد و خداوند برای او در عالم عنصری هفت هزار سال ولایت قرار داد.\n\n### [زمان قیامت - دولت فضل و عدل - در دوره میزان]\n\nو حکم به میزان (برج ترازو) منتقل می‌شود که زمان قیامت است. در آن روز خداوند ترازوهای عدل را برای روز قیامت می‌نهد، پس به هیچ کس ستم نمی‌شود. و چون در دنیا حکم عدل به واسطه آنچه خداوند در میزان نهاده بود، اجرا نشد، خداوند ترازوها را تشریع کرد، اما جز اندکی از مردم که همان پیامبران و اولیای محفوظ بودند، به آن عمل نکردند. و چون قیامت محل سلطنت میزان است، به هیچ کس ستم نمی‌شود. خداوند متعال فرمود: **وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْئًا وَإِنْ كَانَ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ** (یعنی از عمل) **أَتَيْنَا بِهَا وَكَفَى بِنَا حَاسِبِينَ** (و ما ترازوهای عدل را برای روز قیامت می‌نهیم، پس به هیچ کس ستم نمی‌شود، و اگر به اندازه سنگینی دانه خردلی باشد، آن را می‌آوریم، و کافی است که ما حسابرس باشیم).\n\n### [رمزیت عدد ۷ و عدد ۱۲]\n\nو چون برای عذراء (سنبله) عدد هفت بود، اعداد هفت، هفتاد و هفتصد در تضاعف پاداش‌ها و ضرب‌المثل‌های صدقات برای او بود. خداوند متعال فرمود: **مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ** (مَثَل کسانی که اموال خود را در راه خدا انفاق می‌کنند، مانند دانه‌ای است که هفت خوشه برویاند، در هر خوشه صد دانه باشد، و خداوند برای هر که بخواهد، چند برابر می‌کند)؛ تا هفت هزار، تا هفتاد هزار، تا هفتصد هزار و تا بی‌نهایت، اما از حساب هفت.\n\nو این که فرائض مقدر در فلک اطلس دوازده فرض بود، به این دلیل است که منتهای نام‌های عدد به دوازده نام می‌رسد؛ که از یک تا ده، تا صد (که یازدهمی است) و تا هزار (که دوازدهمی است) می‌باشد. و پس از آن مرتبه دیگری نیست و ترکیب در آنها با تضعیف تا بی‌نهایت، تنها با همین نام‌ها صورت می‌گیرد.\n\n### [دولت قرار و استقرار پس از ذبح قوچ مرگ بین بهشت و جهنم]\n\nو مردم وارد بهشت و جهنم می‌شوند و این در ابتدای درجه یازدهم از جوزاء (برج دوپیکر) است. و هر گروه در سرای خود مستقر می‌شود و کسی که با شفاعت یا عنایت الهی خارج شود، در آتش باقی نمی‌ماند. و مرگ بین بهشت و جهنم ذبح می‌شود.\n\nو حکم در اهل بهشت بر حسب آنچه امر الهی که خداوند در حرکات فلک اقصی نهاده است، داده می‌شود. و تکوین در بهشت بر حسب آنچه نشأت سرای آخرت اقتضا می‌کند، واقع می‌شود. زیرا حکم همیشه در قابلیت‌ها (قوابل) است؛ حرکت یکی است و آثار آن بر حسب قابلیت‌ها متفاوت است. و دلیل این امر آن است که هیچ یک از خلق به فعلی یا امری بدون مشارکت مستقل نباشد، تا بدین وسیله فعل خداوند که بدون مشارکت فعل مخلوق انجام می‌دهد، متمایز گردد. پس مخلوق همیشه در جایگاه نیازمندی و عجز است و خداوند بی‌نیاز و عزیز است.\n\nو حکم در اهل آتش بر حسب آنچه امر الهی که خداوند متعال در حرکات فلک اقصی و در ستارگان ثابت و در شناوری هفت سیاره (دراری) و ستارگان خاموش شده (المطموسة الأنوار) نهاده است، داده می‌شود. اینها ستارگانی هستند، اما درخشان نیستند. پس حکم در آتش خلاف حکم در بهشت است و حکم آتش به حکم دنیا نزدیک می‌شود، نه عذاب خالص است و نه نعمت خالص. به همین دلیل خداوند متعال فرمود: **لَا يَمُوتُ فِيهَا وَلَا يَحْيَى** (نه در آن می‌میرد و نه زنده می‌شود). و همچنین پیامبر (صلی الله علیه و سلم) فرمود: «اما اهل آتشی که اهل آن هستند، نه در آن می‌میرند و نه زنده می‌شوند.»\n\nما در باب پیش از این، صورت نعمت و عذاب و سبب آن را بیان کردیم. و سبب آن این است که آنچه خداوند در افلاک و حرکات ستارگان از امر الهی بر آنها نهاده بود، باقی مانده است، و به اندازه‌ای که صورت‌های افلاک با تبدیل و ستارگان با خاموشی و پراکندگی تغییر کرده‌اند، حکم آنها با افزایش و کاهش متفاوت شده است، زیرا تغییر در صورت‌ها واقع شده نه در ذات‌ها.\n\n### [فرشتگان مهیمه کروبیان: حاجب، کاتب، لوح]\n\nبدان که خداوند متعال هنگامی که به «مَلِک» (پادشاه) نامیده شد، عالم را به ترتیب پادشاهی (المملكة) سازمان داد. پس برای خود خواصی از بندگانش قرار داد که همان فرشتگان مهیمه (الملائكة المهيمة) هستند؛ همنشینان حق تعالی (الحق تعالی) با ذکر: **لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَلَا يَسْتَحْسِرُونَ يُسَبِّحُونَ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ** (از عبادت او تکبر نمی‌ورزند و خسته نمی‌شوند، شب و روز تسبیح می‌گویند و سستی نمی‌کنند).\n\nسپس یک حاجب (پرده‌دار) از کروبیان (الکروبيين) برگزید و علم خود را در خلقش به او داد، که علمی مفصل در اجمال است. علم خداوند سبحان در او متجلی شد و آن فرشته «نون» نامیده شد. او پیوسته در محضر علم خداوند عز و جل معتکف است و او رئیس دیوان الهی است، و حق (الحق) از جهت علیم بودن، از او محجوب نیست.\n\nسپس فرشته دیگری را که در مرتبه پایین‌تر از او بود، تعیین کرد و او را قلم (القلم) نامید و منزلتش را پایین‌تر از نون قرار داد و او را کاتب (نویسنده) برگزید. خداوند سبحان از علم خود آنچه را که در خلقش خواسته است، به واسطه نون به او می‌آموزد، اما از علم اجمالی. و آنچه علم تفصیل را در بر می‌گیرد، از برخی علوم اجمال است، زیرا علوم دارای مراتبی هستند که علم تفصیل از جمله آنهاست. پس نزد قلم الهی از مراتب علوم مجمل، جز علم تفصیل مطلق و برخی علوم مفصل دیگر نیست.\n\nخداوند این فرشته را کاتب دیوان خود برگزید و از اسم «قادر» بر او تجلی کرد و او را از این تجلی الهی مدد رساند. و نظر او را به سوی عالم تدوین و نگارش قرار داد. پس برای او لوحی (اللوح) آفرید و به او فرمان داد که هر آنچه خداوند سبحان خواسته است تا روز قیامت در خلقش جاری سازد، به طور خاص در آن بنویسد. و او را در این مقام به منزله شاگردی در برابر استاد قرار داد. پس اراده الهی در اینجا بر او متوجه شد و این مقدار از علوم مفصل را به او اختصاص داد. او دو تجلی از حق (الحق) بدون واسطه دارد، در حالی که نون تنها یک تجلی در مقامی شریف‌تر دارد. زیرا تعدد یا کثرت تجلیات دلالت بر شرافت نمی‌کند، بلکه شریف‌تر کسی است که مقام عام‌تری داشته باشد.\n\nخداوند به نون فرمان داد که قلم را با سیصد و شصت علم از علوم اجمال مدد رساند، که زیر هر علمی تفاصیلی معین و منحصر وجود دارد و جز آن به او داده نشده است. هر علم اجمالی از آن علوم، سیصد و شصت علم از علوم تفصیل را در بر می‌گیرد. پس اگر سیصد و شصت را در خودش ضرب کنی، آنچه به دست می‌آید، مقدار علم خداوند متعال در خلقش تا روز قیامت به طور خاص است. نزد لوح از علمی که این قلم در آن نوشته است، بیش از این نیست، نه زیاد می‌شود و نه کم. و به خاطر این حقیقت الهی، خداوند فلک اقصی را سیصد و شصت درجه قرار داد و هر درجه‌ای مجمل است برای آنچه از تفصیل دقایق و ثانیه‌ها و ثلث‌ها در بر می‌گیرد، تا آنچه خداوند سبحان بخواهد تا روز قیامت در خلقش ظاهر سازد. و این قلم، کاتب نامیده شد.\n\n### [فرشتگان مدبر: والیان دوازده‌گانه عالم خلق]\n\nسپس خداوند سبحان فرمان داد که دوازده والی (حاکم) را بر عالم خلق بگمارد که مقر آنها در فلک اقصی، در برج‌ها باشد. پس فلک اقصی را به دوازده بخش تقسیم کرد و هر بخش را برجی برای سکونت این والیان قرار داد، مانند برج‌های دیوار یک شهر. خداوند آنها را در آنجا منزل داد و هر والی بر تختی در برج خود نشست.\n\nخداوند حجابی را که بین آنها و لوح محفوظ (اللوح المحفوظ) بود، برداشت، پس در آن نام‌ها و مراتب خود و آنچه را که حق خواسته است تا روز قیامت به دست آنها در عالم خلق جاری سازد، نگاشته دیدند. پس همه آن در نفوس آنها نقش بست و آن را به صورت علمی محفوظ دانستند که نه تبدیل می‌شود و نه تغییر.\n\nسپس خداوند برای هر یک از این والیان دو حاجب قرار داد که اوامر آنها را به نایبانشان ابلاغ می‌کنند، و بین هر دو حاجب یک سفیر قرار داد که میان آن دو رفت و آمد می‌کند. خداوند برای این حاجبان که پرده‌داران این والیان هستند، در فلک دوم منازلی برای سکونت تعیین کرد و آنها را در آنجا منزل داد. اینها همان بیست و هشت منزلی هستند که منازل نامیده می‌شوند و خداوند در کتابش فرمود: **وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ** (و برای ماه منزل‌هایی مقدر کردیم)؛ یعنی در سیر خود هر شب در یکی از آنها منزل می‌کند تا به آخر برسد، سپس دوره‌ای دیگر را آغاز می‌کند، **لِتَعْلَمُوا** (تا بدانید) با سیر آن و سیر خورشید در آن و ستارگان پنهان‌شونده (الخنس)، **عَدَدَ السِّنِينَ وَالْحِسَابَ** (تعداد سال‌ها و حساب را). و هر چیزی را حق برای ما تفصیل داده است. پس این فرشتگان که حاجبان آن والیان در فلک اقصی هستند، در این منازل ساکن شدند.\n\n### [نقیبان والیان دوازده‌گانه در آسمان‌های هفت‌گانه]\n\nسپس خداوند متعال به این والیان فرمان داد که نایبان و نقیبانی (سرپرستان) برای خود در آسمان‌های هفت‌گانه قرار دهند، در هر آسمان یک نقیب، مانند حاجب برای آنها، که در مصالح عالم عنصری بر حسب آنچه این والیان به آنها القا می‌کنند و به آن فرمان می‌دهند، نظر کنند. و این همان سخن اوست: **وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا** (و در هر آسمانی امر آن را وحی کرد).\n\nخداوند اجسام این ستارگان نقیب را اجسامی نورانی و گرد قرار داد و ارواحشان را در آنها دمید و آنها را در آسمان‌های هفت‌گانه منزل داد، در هر آسمان یکی از آنها. و به آنها فرمود: شما را قرار دادم تا آنچه نزد این دوازده والی است، به واسطه حاجبان که بیست و هشت نفر هستند، استخراج کنید، همان‌گونه که آن والیان از لوح محفوظ (اللوح المحفوظ) دریافت می‌کنند.\n\nسپس خداوند برای هر نقیب از این هفت نقیب، فلکی قرار داد که در آن شناور است و آن فلک برای او مانند اسب برای سوار است. همچنین حاجبان نیز افلاکی دارند که در آنها شناورند، زیرا آنها در حوادث عالم تصرف و بر آن اشراف دارند. و آنها خادمان و یارانی دارند که بیش از هزار نفرند. و خداوند به آنها مرکب‌هایی داده که آنها را افلاک نامیده است. پس آنها نیز در آن افلاک شناورند و این افلاک هر روز یک بار به دور قلمرو پادشاهی می‌چرخند. پس هیچ چیز از قلمرو پادشاهی آسمان‌ها و زمین از آنها فوت نمی‌شود.\n\nوالیان، حاجبان، نقیبان و خادمان، همگی در خدمت این والیان می‌چرخند و همه در حق ما مسخر شده‌اند، زیرا ما مقصود عالم بودیم. خداوند متعال فرمود: **وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ** (و آنچه در آسمان‌ها و آنچه در زمین است، همه را از جانب خود مسخر شما گردانید). و خداوند در تورات نازل کرد: «ای فرزند آدم، اشیاء را برای تو آفریدم و تو را برای خودم آفریدم.»\n\n### [پادشاه، پادشاهی و قلمرو]\n\nو شایسته است که پادشاه هر روز بر احوال اهل قلمرو خود اشراف داشته باشد. خداوند متعال می‌فرماید: **كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ** (هر روز در کاری است)، زیرا هر که در آسمان‌ها و زمین است، با زبان حال و زبان قال از او درخواست می‌کند. و حفظ عالم او را خسته نمی‌کند، **وَهُوَ الْعَلِيُّ الْعَظِيمُ** (و او بلندمرتبه و بزرگ است). پس او جز به آنها مشغول نیست. خداوند متعال می‌فرماید: **يُدَبِّرُ الْأَمْرَ مِنَ السَّمَاءِ إِلَى الْأَرْضِ يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ** (امر را از آسمان به سوی زمین تدبیر می‌کند، امر را تدبیر می‌کند، آیات را تفصیل می‌دهد).\n\nاگر وجود پادشاه نبود، پادشاه به نام «مَلِک» خوانده نمی‌شد. پس حفظ او از قلمرو پادشاهی‌اش، حفظ او برای بقای نام «مَلِک» بر اوست، هرچند که همان‌گونه که فرمود: **فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ** (همانا خداوند از جهانیان بی‌نیاز است). اما نام «مَلِک» با اسم اضافه آمده است و اسم‌های اضافه جز با مضاف (مملکت) وجود ندارند.\n\nپس هر سلطانی که در احوال رعیت خود نظر نکند و با عدل در میان آنها رفتار ننماید و با احسانی که شایسته آنهاست، با ایشان معامله نکند، در واقع خود را در نفس الامر عزل کرده است. فقها می‌گویند: اگر حاکم فاسق شود یا ستم کند، شرعاً عزل شده است. اما نزد ما، او شرعاً تنها در همان موردی که فسق کرده، عزل شده است، زیرا به آنچه برایش تشریع شده بود که حکم کند، حکم نکرده است.\n\nرسول خدا (صلی الله علیه و سلم) والیان را با وجود ستمشان، والی ثابت کرد و در مورد ما و آنها فرمود: «اگر عدالت ورزند، به نفع شما و آنهاست، و اگر ستم کنند، به نفع شما و به ضرر آنهاست.» و نهی کرد که از طاعت سر باز زنیم. و این را به والی خاصی اختصاص نداد. به همین دلیل ما در عزل شرعی او افزودیم که تنها در همان موردی است که فسق کرده است.\n\nپادشاه مأمور است که خود را از خروج از احکامی که برای رعیت و برای خودش تعیین شده، حفظ کند، زیرا او بر نفس خود والی است. «همه شما راعی هستید و همه شما مسئول رعیت خود هستید.» پس انسان بر نفس خود راعی است و بس. به همین دلیل پیامبر (صلی الله علیه و سلم) فرمود: «همانا نفس تو بر تو حقی دارد، و چشمت بر تو حقی دارد...» (الحدیث).\n\nهر کس به کسی که با او بیعت کرده، به آنچه بر آن بیعت کرده، وفا نکند، خود را عزل کرده است و پادشاه نیست، هرچند حاکم باشد. زیرا هر حاکمی سلطان نیست. سلطان کسی است که حجت به نفع او باشد نه علیه او.\n\nبه همین دلیل خداوند افلاک را قرار داد که هر روز یک بار بر ما بچرخند تا والیان ببینند که نیاز خلق به چه چیزی آنها را فرا می‌خواند، پس خلل را برطرف کنند و احکام خداوند متعال را از جهت اراده‌کننده بودن او در خلقش اجرا کنند، نه از جهت امرکننده بودن او. پس احکامی را که خداوند سبحان به آنها فرمان داده است که در میان خلق اجرا کنند، که همان قضا و قدر است، در زمان‌های مختلف اجرا می‌کنند. پس هر چیزی به قضا و قدر است، حتی عجز و زیرکی. و هر کوچک و بزرگی در لوح محفوظ (اللوح المحفوظ) نگاشته شده است. پس در آن جز آنچه واقع می‌شود، نیست و این والیان در عالم جز آنچه در لوح است، اجرا نمی‌کنند. و خداوند بر هر چیزی نگهبان است.\n\nبا همه اینها، خداوند با هر یک از افراد قلمرو پادشاهی، امری خاص در نفس او دارد که والیان، حاجبان و نقیبان آن را می‌دانند. پس آنها از مشاهده آن وجه غافل نمی‌شوند تا بدانند که خداوند **قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا** (به هر چیزی احاطه علمی دارد) و او بر هر نفسی به آنچه کسب کرده، نگهبان است، و **إِنَّهُ بِكُلِّ شَيْءٍ مُحِيط** (و او بر هر چیزی احاطه دارد).\n\n### [فرشتگان مسخر تحت فرمان فرشتگان والی]\n\nهنگامی که خداوند زمام این امور را به دست این گروه از فرشتگان سپرد و برخی از آنها را در برج و مسکنشان که تخت پادشاهی‌شان در آن است، نشاند و برخی از حاجبان و نقیبان را به منازلشان در آسمان‌هایشان فرود آورد، در هر آسمانی فرشتگانی مسخر تحت فرمان این والیان قرار داد. و تسخیر آنها را بر طبقاتی قرار داد:\n\nبرخی از آنها اهل عروج شب و روز از حق (الحق) به سوی ما و از ما به سوی حق در هر صبح و شام هستند و جز خیر در حق ما نمی‌گویند. برخی از آنها برای کسانی که در زمین هستند استغفار می‌کنند، و برخی برای مؤمنان استغفار می‌کنند به دلیل غلبه غیرت الهی بر آنها، همان‌گونه که رحمت بر استغفارکنندگان برای کسانی که در زمین هستند، غلبه کرده است. برخی از آنها موکل به رساندن شرایع هستند، و برخی نیز موکل به «لَمّات» (الهامات شیطانی) هستند. برخی موکل به الهام هستند که علوم را به قلب‌ها می‌رسانند. برخی موکل به ارحام هستند، و برخی موکل به تصویرسازی آنچه خداوند در ارحام قرار می‌دهد. برخی موکل به دمیدن ارواح هستند، برخی موکل به روزی‌ها، و برخی موکل به باران‌ها. به همین دلیل گفتند: **وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ** (و هیچ یک از ما نیست مگر اینکه برای او مقامی معلوم است).\n\nو هیچ حادثه‌ای نیست که خداوند در عالم ایجاد کند، مگر اینکه فرشتگانی را برای اجرای آن گمارده است، اما به فرمان این والیان از فرشتگان. همچنین از آنها هستند: صافات (صف‌بستگان)، زاجرات (رانندگان)، تالیات (تلاوت‌کنندگان)، مقسمات (تقسیم‌کنندگان)، مرسلات (فرستادگان)، ناشرات (پراکنده‌کنندگان)، نازعات (بیرون‌کشندگان)، ناشطات (به نرمی بیرون‌کشندگان)، سابقات (پیشی‌گیرندگان)، سابحات (شناوران)، ملقيات (القا کنندگان) و مدبرات (تدبیرکنندگان).\n\nبا همه اینها، آنها پیوسته تحت سلطنت این والیان هستند، مگر ارواح مهیمه (الأرواح المهيمة) که آنها خواص خداوند هستند. و غیر از آنها اوامر خداوند را در خلقش اجرا می‌کنند. سپس عامه مردم تنها منازل آنها را مشاهده می‌کنند، اما خواص آنها را در منازلشان شهود می‌کنند، همان‌گونه که عامه اجرام ستارگان را می‌بینند و اعیان حاجبان و نقیبان را مشاهده نمی‌کنند.\n\n### [لطایف و مناسبات بین عالم عناصر و والیان در افلاک]\n\nو خداوند در عالم عنصری خلقی از جنس آنها قرار داد، که برخی از آنها رسولان، خلفا، سلاطین، پادشاهان و والیان امور عالم هستند. و خداوند بین ارواح این والیان زمینی و آن والیان در افلاک، مناسبت‌ها و رقایقی (لطایفی) قرار داد که از این والیان با عدل به سوی آنها کشیده می‌شود، پاکیزه از آلودگی‌ها و مقدس از عیوب.\n\nپس ارواح این والیان زمینی آن را بر حسب استعدادشان می‌پذیرند. هر کس استعدادش قوی و نیکو باشد، آن امر را بر صورت پاک و پاکیزه‌اش می‌پذیرد و والی عدل و امام فضل می‌شود. و هر کس استعدادش پست باشد، آن امر ظاهر را می‌پذیرد و آن را به شکل پستی و زشتی خود برمی‌گرداند، پس والی جور و نایب ظلم و بخل می‌شود، و جز خود را ملامت نکند.\n\nپس من سلطنت عالم علوی بر عالم سفلی و اینکه خداوند چگونه قلمرو پادشاهی خود را به این ترتیب شگفت‌انگیز سازمان داده است، برای تو آشکار ساختم. و ما از اینها جز اصول را ذکر نکردیم. خداوند متعال می‌فرماید: **وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا** (و در هر آسمانی امر آن را وحی کرد) و فرمود: **يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ** (امر در میان آنها نازل می‌شود).\n\nو همین مقدار از این باب کافی است. و خداوند حق می‌گوید و او راه را هدایت می‌کند. در کتاب «التنزلات الموصلیه» از سرگذشت این والیان، نایبان و حاجبان و تأثیری که خداوند بر آنها در عالم عنصری روحانی قرار داده است، سخن گفته‌ایم. در آنجا به آنچه طبیعت و امور بدنی اقتضا می‌کند، نپرداختیم و در باب روز یکشنبه که باب امام است، درباره هر آنچه ذکر کردیم، به تفصیل سخن گفتیم. و آنچه در دست هر نایب از هفت نقیب است، در باب روز یکشنبه و سایر روزها تا روز شنبه بیان کردیم. و مقامات ارواح پیامبران (علیهم السلام) را در آن بیان کردیم و این القاب روحانی را برای ارواح پیامبران (علیهم السلام) قرار دادیم. و مراتب آنها را در رؤیت و حجاب در روز قیامت و آنچه در مورد پیروانشان از اهل سعادت و شقاوت سخن می‌گویند، بیان کردیم. و این در باب روز دوشنبه به زبان آدم و ترجمه قمر به شکلی بدیع آمده است. و خداوند یاری‌دهنده و موفق‌کننده است و پروردگاری جز او نیست."
  },
  "page_count": 6
}