{
  "id": 112,
  "title": {
    "ar": "الباب الثاني عشر ومائة في مخالفة النفس",
    "en": "Chapter One Hundred and Twelve: Concerning the Opposition to the Self (مخالفة النفس)",
    "ur": "باب ایک سو بارہ: نفس کی مخالفت کے بیان میں",
    "fa": "باب صد و دوازدهم در مخالفت با نفس"
  },
  "content": {
    "ar": "## (الباب الثاني عشر ومائة في مخالفة النفس)\n\n\n> خالف هواك فإنه محمود *** واعلم بأنك وحدك المقصود\n\n\n> الكل يسعد غير من هو مثله *** فلتلق سمعك لي وأنت شهيد\n\n\n> أنت العزيز فذق وبال صفاته *** يوم القيامة والأنام شهود\n\n\n### [مخالفة النفس هو الموت الأحمر]\n\n\nاعلم أيدك الله أن مخالفة النفس هو الموت الأحمر وهو حال شاق عليها وهي المخالفة نفسها فالمخالف عين المخالف وهذا من أعجب الأمور أعني وجود المشقة نعم لو كان المخالف نفسا أخرى لم يكن التعجب من حصول المشقة في ذلك‏\nونحن بحمد الله حيث قلنا بمخالفتها ولم نقل تخالف بالمقابل فقد يكون الخلاف بما ليس بمقابل فيجمع بين وجود الخلاف وبين المساعدة وسيأتي في الباب الذي بعد هذا الباب وفائدة المخالفة عظيمة\n\n\n### [مواطن مخالفة النفس‏]\n\n\nواعلم أنه لا يخالف النفس إلا في ثلاثة مواطن في المباح والمكروه والمحظور لا غير وأما إذا وقعت لها لذة في طاعة مخصوصة وعمل مقرب فهنالك علة خفية يخالفها بطاعة أخرى وعمل مقرب فإن استوى عندها جميع التصرفات في فنون الطاعات سلمنا لها تلك اللذة بتلك الطاعة الخاصة وإن وجدت المشقة في العمل المقرب الآخر الذي هو خلاف هذا العمل فالعدول إلى الشاق واجب لأنها إن اعتادت المساعدة في مثل هذا أثرت في المساعدة في المحظور والمكروه والمباح‏\n\n\n### [السبب في صعوبة المخالفة للنفس‏]\n\n\nوإنما صعب على النفس المخالفة لكريم أصلها وعلو منصبها فإن النيابة الإلهية في العالم لها فتقول في نفسها بيدي أزمة الأمر وملاكه ولا سيما وقد خلقني الله تعالى على الصورة فمخالفتي مخالفة الحق من هذا المقام يكون لها المخالفة موتا أحمر وحجبت هذه النفس عن الاتساع الإلهي وعما خلقت له وعن العلم بأن الصورة ليست لكل نفس وإنما هي للنفس الكاملة كنفوس الأنبياء ومن كمل من الناس فلو كملت هذه النفس ما كانت المخالفة لها موتا أحمر فإن لذة العرفان تعطيها الحياة التي لا موت فيها فالوجود والفتح مقرونان بمخالفتها في كل شي‏ء ينبغي أن تخالف فيه فافهم‏\n\n",
    "en": "Chapter One Hundred and Twelve: Concerning the Contradiction of the Soul\n\nContradict your caprice, for it is praiseworthy,\nAnd know that you alone are the intended goal.\n\nEveryone is happy except one who is like it,\nSo lend your ear to me while you are a witness (شهيد).\n\nYou are the Mighty, so taste the consequence of its attributes,\nOn the Day of Resurrection, while all creatures are witnesses.\n\n### [Contradicting the Soul is the Red Death]\n\nKnow, may Allah support you, that contradicting the soul (النفس) is the Red Death (الموت الأحمر). It is a state difficult for the soul, and it is the contradiction itself. Thus, the contradictor is the very essence (عين) of the contradicted. This is one of the most astonishing matters, meaning the existence of the difficulty. Yes, if the contradictor were another soul, there would be no astonishment at the occurrence of difficulty in that.\n\nWe, by the grace of Allah, said that it is contradicted (مخالفتها), and did not say that it contradicts by opposition (بالمقابل). For the contradiction (الخلاف) may occur through that which is not an opposite, thereby combining the existence of contradiction with assistance (المساعدة). This will come in the chapter following this one, and the benefit of contradiction is immense.\n\n### [The Loci of Contradicting the Soul]\n\nAnd know that the soul is contradicted only in three loci (مواطن): the permissible (المباح), the disliked (المكروه), and the forbidden (المحظور)—no others. But if it finds pleasure (لذة) in a specific act of obedience (طاعة) and a proximity-gaining deed (عمل مقرب), then there is a hidden defect (علة خفية); one contradicts it with another act of obedience and proximity-gaining deed.\n\nIf all dispositions (التصرفات) in the various kinds of obedience are equal to it (the soul), then we concede that pleasure to it in that specific obedience. But if it finds difficulty (المشقة) in the other proximity-gaining deed, which is the opposite of this deed, then turning toward the difficult one is obligatory (واجب). This is because if it becomes accustomed to assistance in such matters, it will influence assistance in the forbidden, the disliked, and the permissible.\n\n### [The Reason for the Difficulty of Contradiction for the Soul]\n\nContradiction is difficult for the soul only because of its noble origin (كريم أصلها) and the loftiness of its station (علو منصبها). For the Divine Vicegerency (النيابة الإلهية) in the world belongs to it. So it says to itself: \"The reins of the command and its essence (ملاكه) are in my hands,\" especially since Allah the Exalted created me upon the Form (على الصورة). Therefore, contradicting me is contradicting The Real (الحق) from this station, and thus contradiction becomes the Red Death (موتا أحمر) for it.\n\nYet, this soul is veiled (حجبت) from the Divine Expansion (الاتساع الإلهي) and from that for which it was created, and from the knowledge that the Form (الصورة) is not for every soul, but rather it is for the Perfect Soul (النفس الكاملة), such as the souls of the Prophets and those among mankind who have attained perfection. If this soul were perfect, contradiction would not be the Red Death for it. For the pleasure of Gnosis (العرفان) grants it the life in which there is no death. Thus, Being (الوجود) and Spiritual Opening (الفتح) are coupled with contradicting it in everything in which it ought to be contradicted. So understand this.",
    "ur": "(باب ایک سو بارہ: نفس کی مخالفت کے بیان میں)\n\nاپنے نفسانی خواہشات کی مخالفت کر، کیونکہ یہ قابل تعریف ہے\nاور جان لے کہ صرف تو ہی مقصود ہے\nہر کوئی خوش ہوتا ہے سوائے اس کے جو اس (نفس) جیسا ہو\nپس تو میری طرف کان دھر، جبکہ تو خود شاہد (شہید) ہے\nتو ہی عزیز ہے، پس قیامت کے دن اپنی صفات کا وبال چکھ\nجبکہ تمام مخلوقات گواہ ہوں گی\n\n[نفس کی مخالفت ہی موت احمر ہے]\n\nاللہ تعالیٰ تیری مدد فرمائے، جان لے کہ نفس کی مخالفت ہی موت احمر (الموت الأحمر) ہے، اور یہ نفس پر ایک شاق (مشکل) حال ہے۔ اور یہ مخالفت خود نفس ہی ہے۔ پس مخالفت کرنے والا (المخالف) عین وہی ہے جس کی مخالفت کی جا رہی ہے (عین المخالف)۔ اور یہ سب سے حیرت انگیز امور میں سے ہے، یعنی مشقت کا پایا جانا۔ ہاں، اگر مخالفت کرنے والا کوئی دوسرا نفس ہوتا تو اس میں مشقت کے حصول پر کوئی تعجب نہ ہوتا۔\n\nاور ہم اللہ کے فضل سے، چونکہ ہم نے اس (نفس) کی مخالفت کا حکم دیا ہے اور یہ نہیں کہا کہ وہ بالمقابل مخالفت کرے، اس لیے ممکن ہے کہ اختلاف ایسی چیز میں ہو جو مقابل نہ ہو، پس اس طرح اختلاف کے وجود اور مدد (المساعدة) کے درمیان جمع ہو جاتا ہے۔ اور اس کا بیان اس باب کے بعد والے باب میں آئے گا۔ اور مخالفت کا فائدہ بہت عظیم ہے۔\n\n[نفس کی مخالفت کے مقامات]\n\nاور جان لے کہ نفس کی مخالفت صرف تین مقامات پر کی جاتی ہے: مباح، مکروہ، اور محظور (حرام) میں، بس۔ لیکن اگر اسے کسی مخصوص طاعت اور عمل مقرب میں لذت حاصل ہو جائے، تو وہاں ایک پوشیدہ علت (خفیہ) ہوتی ہے، جس کی وجہ سے اس کی مخالفت کسی دوسری طاعت اور عمل مقرب کے ذریعے کی جاتی ہے۔ پس اگر اس کے نزدیک طاعات کے مختلف فنون میں تمام تصرفات برابر ہو جائیں، تو ہم اس خاص طاعت میں اس لذت کو اس کے لیے تسلیم کر لیتے ہیں۔ اور اگر اسے دوسرے عمل مقرب میں، جو اس عمل کے خلاف ہے، مشقت محسوس ہو، تو شاق (مشکل) کی طرف مائل ہونا واجب ہے، کیونکہ اگر وہ ایسے معاملات میں مدد (المساعدة) کی عادی ہو گئی، تو یہ محظور، مکروہ اور مباح میں بھی مدد کرنے پر اثر انداز ہو گی۔\n\n[نفس کے لیے مخالفت کی دشواری کا سبب]\n\nاور نفس پر مخالفت صرف اس لیے مشکل ہوتی ہے کہ اس کی اصل کریم ہے اور اس کا منصب بلند ہے۔ کیونکہ عالم میں نیابت الٰہیہ (النیابۃ الإلہیۃ) اسی کے لیے ہے۔ پس وہ اپنے دل میں کہتی ہے کہ امر کی باگ ڈور اور اس کا مرکز میرے ہاتھ میں ہے، خاص طور پر جب اللہ تعالیٰ نے مجھے اپنی صورت (الصورة) پر پیدا کیا ہے۔ لہٰذا اس مقام سے میری مخالفت، ذات حق (الحق) کی مخالفت ہے۔ اسی وجہ سے مخالفت اس کے لیے موت احمر (الموت الأحمر) بن جاتی ہے۔ اور یہ نفس وسعت الٰہیہ (الاتساع الإلہی) سے، اور اس چیز سے جس کے لیے اسے پیدا کیا گیا ہے، اور اس علم سے کہ صورت (الصورة) ہر نفس کے لیے نہیں ہے، بلکہ صرف نفس کاملہ (النفس الکاملۃ) کے لیے ہے، جیسے انبیاء کے نفوس اور وہ لوگ جو لوگوں میں سے کامل ہوئے ہیں۔ پس اگر یہ نفس کامل ہو جاتا تو مخالفت اس کے لیے موت احمر نہ ہوتی۔ کیونکہ معرفت (العرفان) کی لذت اسے وہ زندگی عطا کرتی ہے جس میں موت نہیں ہے۔ پس ہستی (الوجود) اور فتح (الفتح) ہر اس چیز میں اس کی مخالفت کے ساتھ جڑے ہوئے ہیں جس میں اس کی مخالفت ہونی چاہیے۔ پس سمجھ لے۔ (فافہم)",
    "fa": "با هوای نفس خود مخالفت کن، زیرا این کار ستوده است\nو بدان که تنها تویی مقصود\nهمه شادمان می‌شوند جز کسی که مانند اوست\nپس گوش خود را به من بسپار در حالی که تو شاهدی\nتو عزیز هستی، پس عواقب صفات خود را بچش\nدر روز قیامت، در حالی که مردمان شاهدند\n\n### [مخالفت با نفس همان مرگ سرخ است]\n\nبدان، خداوند تو را تأیید کند، که مخالفت با نفس (مخالفة النفس) همان مرگ سرخ (الموت الأحمر) است. و این حالتی است که بر نفس دشوار است، و این مخالفت، خودِ نفس است. پس مخالفت‌کننده عین مخالفت‌شده است. و این از شگفت‌انگیزترین امور است، منظورم وجود دشواری (مشقة) است. آری، اگر مخالفت‌کننده نفس دیگری بود، تعجبی از حصول دشواری در آن نبود.\nو ما به حمد خدا، از آنجا که گفتیم با آن مخالفت شود و نگفتیم که با مقابل آن مخالفت شود، پس ممکن است مخالفت با چیزی باشد که مقابل نیست، در نتیجه بین وجود مخالفت و کمک (مساعدة) جمع شود. و این در بابی که پس از این باب است خواهد آمد، و فایده مخالفت بسیار عظیم است.\n\n### [مواضع مخالفت با نفس]\n\nو بدان که با نفس مخالفت نمی‌شود مگر در سه موضع: در مباح، مکروه و محظور (حرام)، نه غیر از اینها. اما اگر برای نفس در طاعتی خاص و عملی مقرب (نزدیک‌کننده به حق) لذتی حاصل شود، در آنجا علتی پنهان وجود دارد که باید با طاعت دیگری و عمل مقرب دیگری با آن مخالفت کند. پس اگر همه تصرفات در انواع طاعات نزد نفس یکسان باشد، آن لذت را در آن طاعت خاص به او واگذار می‌کنیم. و اگر در عمل مقرب دیگری که خلاف این عمل است، دشواری (مشقة) یافت، روی آوردن به کار دشوار واجب است. زیرا اگر نفس به کمک (مساعدة) در مثل این موارد عادت کند، این عادت در کمک به محظور (حرام)، مکروه و مباح نیز تأثیر می‌گذارد.\n\n### [علت دشواری مخالفت با نفس]\n\nو مخالفت بر نفس دشوار شد به دلیل اصل کریم و جایگاه بلندش. زیرا نیابت الهی در عالم از آنِ اوست. پس نفس در درون خود می‌گوید: زمام امر و اساس آن در دست من است. به ویژه آنکه خداوند متعال مرا بر صورت (الهی) آفریده است. پس مخالفت با من، مخالفت با حق (الحق) است. از این مقام است که مخالفت برای نفس، مرگ سرخ (موتا أحمر) می‌شود. و این نفس از گستردگی الهی (الاتساع الإلهي) و از آنچه برای آن خلق شده است، محجوب مانده است. و نیز از این علم که صورت (الهی) برای هر نفسی نیست، بلکه فقط برای نفس کامل (النفس الكاملة) است، مانند نفوس انبیا و کسانی از مردم که به کمال رسیده‌اند. پس اگر این نفس کامل می‌شد، مخالفت برای آن مرگ سرخ نمی‌بود. زیرا لذت عرفان (المعرفة) به آن حیاتی می‌بخشد که در آن مرگی نیست. پس هستی (الوجود) و گشایش (الفتح) با مخالفت با نفس در هر چیزی که شایسته مخالفت است، همراه هستند. پس بفهم."
  },
  "page_count": 2
}