{
  "id": 327,
  "title": {
    "ar": "الباب السابع والعشرون وثلاثمائة في معرفة منزل المد والنصيف من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Twenty-Seven, concerning the knowledge of the station of the Measure (*al-Madd*) and the Half-Measure (*al-Nasif*) [المد والنصيف] from the Muhammadan Presence [الحضرة المحمدية]",
    "ur": "باب تین سو ستائیس: الحضرة المحمدية (الحضرة المحمدية) سے منزل المد (المد) اور النصيف (النصيف) کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب سیصد و بیست و هفتم در معرفت منزل مدّ و نصیف (نصف) از حضرت محمدیه (الحضرة المحمدية)."
  },
  "content": {
    "ar": "## «الباب السابع والعشرون وثلاثمائة في معرفة منزل المد والنصيف من الحضرة المحمدية»\n\n\n> الابتداع شريعة مرعية *** أثنى عليها الله في تنزيله‏\n\n\n> هذا بغير حقيقة قد سنها *** فمشرع المسنون من تأويله‏\n\n\n> أولى بأن ترعى ويعرف قدرها *** هذا هو المعروف من تفصيله‏\n\n\n### [علم المفاضلة]\n\n\nاعلم أيدك الله أن من علوم هذا المنزل علم المفاضلة والمفاضلة تكون على ضروب مفاضلة بالعلم ومفاضلة بالعمل والمفاضلة بالعلم قد تقع بفضل المعلومات وقد تكون بطريق الوصول إلى المعلوم فواحد يأخذ علمه عن الله وآخر يأخذ علمه عن كون من الأكوان والذي يأخذ علمه عن الله يتفاضل فمنهم من يأخذ عن سبب كالمتقي بتقواه ومنهم من يأخذ عن الله لا عند سبب ومن الأسباب الدعاء في الزيادة من العلم والمفاضلة في المعلوم فعلم يتعلق بالأفعال وآخر بالأسماء وآخر بالذات فبين العلماء من الفصل ما بين متعلقات هذه العلوم والكل علم إلهي وكذلك المفاضلة بالأعمال قد تكون بأعيانها وبالأزمان وبالمكان وبالحال فتقدر في كل شي‏ء بحسب ما تعطيه حقيقة ما وقع فيه التفاضل فثم من يكون التقدير فيه بالمكيال والميزان إذا كان إنفاقا أو وقع التشبيه فيه بالإنفاق كالعقل لما قسمه الله بين الناس بمكيال فجعل لواحد قفيزا ولآخر قفيزين وقد يكون التقدير فيه بالمراتب والدرجات والذي يحصر لك باب المفاضلة إنما هو العدد وبما ذا يقع ما هو فيقال بحسب ما يريده الواضع أو المخبر به يَرْفَعِ الله الَّذِينَ آمَنُوا مِنْكُمْ والَّذِينَ أُوتُوا الْعِلْمَ دَرَجاتٍ والنفقة بعد الهجرة لا يبلغ أجرها أجر النفقة قبل الهجرة في أهل مكة ولا في كل موضع يكون العبد مخاطبا فيه بالهجرة منه إلى غيره فيعمل فيه خيرا وهو فيه مستوطن ثم يعمل خيرا بعد هجرته فهذا الخير يتفاضل بقدر المشقة\n\n\n### [منزل المد والنصيف من منازل التنزيه‏]\n\n\nواعلم أن هذا المنزل يتضمن علوما شتى أومأنا إلى تسميتها في آخره لتعرف فتطلب وهذا المنزل من منازل التنزيه الذي ذكرناه في أول هذا الكتاب عند ذكرنا منزل المنازل وهو تنزيه نصف العالم ونصف محل وجود أعيان العالم من مقام العزة الحاكمة على الكل بالقهر والعجز عن بلوغ الغاية فيما قصدوه من الثناء على الله مثل‏\n\n\nقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لا أحصي ثناء عليك‏\n\n\nما قال ذلك حتى عجز عن بلوغ الغاية التي في نفسه طلبها فلم تف الجوارح بذلك ولا ما عندنا من الأسماء الإلهية فإنه ما يثنى عليه عز وجل إلا بأسمائه الحسنى ولا يعلم منها إلا ما أظهر ولا يثنى عليه إلا بالكلام بتلك الأسماء وهو الذكر ولا يكون إلا منه لا بالوضع منا فإنه لا يجوز عندنا أن يسمى إلا بما سمي به نفسه فلا يثنى عليه إلا بما أثنى على نفسه إلا القاضي أبو بكر بن الطيب فإنه ذهب إلى جواز تسميته بكل اسم لا يوهم صفة الحدوث فالعالم كله تحت قهره وفي قبضته يحيى بشهوده وتجليه إذا شاء أو لمن شاء ويميته باحتجابه وستره إذا شاء أو في حق من شاء ولكن ما لم يتجل لشخص تجليا يعلم أنه هو غير مقيد فإذا تجلى في مثل هذا فلا حجاب بعد هذا التجلي فله الحياة الذاتية بشهوده فلا يموت أبدا موت الحجاب والستر فإن لم يتجل له وهو متجل أبدا ولكن لا يعرف فالمحجوب بجهله به ميت فإن حياة العلم يقابلها موت الجهل وبالنور يقع حصوله كما بالظلمة يكون الجهل في حكمه قال تعالى أَ ومن كانَ مَيْتاً فَأَحْيَيْناهُ فقد وصفه بالموت ثم بالحياة لمن أحياه ثم قال وجَعَلْنا لَهُ نُوراً به يشهده فليس مثله كَمَنْ مَثَلُهُ في الظُّلُماتِ وإن كان حيا وهو الحي يعلم الغيب في الغيب الذي يحكم عليه به الاسم الباطن فإن لم يكن حيا يعلم فتلك الظلمة المحضة والعدم الخالص ولله سبحانه الاقتدار على كل ما ذكرناه أخبرني الوارد والشاهد يشهد له بصدقه مني بعد أن جعلني في ذلك على بينة من ربي بشهودي إياه لما ألقاه من الوجود في قلبي إن اختصاص البسملة في أول كل سورة تتويج الرحمة الإلهية في منشور تلك السورة إنها تنال كل مذكور فيها فإنها علامة الله على كل سورة إنها منه كعلامة السلطان على مناشيره فقلت للوارد فسورة التوبة عندكم فقال‏\nهي والأنفال سورة واحدة قسمها الحق على فصلين فإن فصلها وحكم بالفصل فقد سماها سورة التوبة أي سورة الرجعة الإلهية بالرحمة على من غضب عليه من العباد فما هو غضب أبد لكنه غضب أمد والله هو التواب فما قرن بالتواب إلا الرحيم ليئول المغضوب عليه إلى الرحمة أو الحكيم لضرب المدة في الغضب وحكمها فيه إلى أجل فيرجع عليه بعد انقضاء المدة بالرحمة فانظر إلى الاسم الذي نعت به التواب تجد حكمه كما ذكرناه والقرآن جامع لذكر من رضي عنه وغضب عليه وتتويج منازله بالرحمن الرحيم والحكم للتتويج فإن به يقع القبول وبه يعلم أنه من عند الله هذا إخبار الوارد لنا ونحن نشهد ونسمع ونعقل لله الحمد والمنة على ذلك وو الله ما قلت ولا حكمت إلا عن نفث في روع من روح إلهي قدسي علمه الباطن حين احتجب عن الظاهر للفرق بين الولاية والرسالة والولاية لها الأولية ثم تنصحب وتثبت ولا تزول ومن درجاتها النبوة والرسالة فينا لها بعض الناس ويصلون إليها وبعض الناس لا يصل إليها وأما اليوم فلا يصل إلى درجة النبوة نبوة التشريع أحد لأن بابها مغلق والولاية لا ترتفع دنيا ولا آخرة فللولاية حكم الأول والآخر والظاهر والباطن بنبوة عامة وخاصة وبغير نبوة ومن أسمائه الولي وليس من أسمائه نبي ولا رسول فلهذا انقطعت النبوة والرسالة لأنه لا مستند لها في الأسماء الإلهية ولم تنقطع الولاية فإن الاسم الولي يحفظها ثم إن الله تعالى قدر الأشياء علما ثم أوجدها حكما وجعلها طرفين وواسطة جامعة للطرفين لها وجه إلى كل طرف في تلك الواسطة البرزخية إنشاء الإنسان الكامل فجمع بين التقدير وهو العام وبين الإيجاد وهو خاص مثل قوله فينفخ فيه فيكون طائرا بإذني فهو أَحْسَنُ الْخالِقِينَ تقديرا وإيجادا وهذه مسألة غير مجمع عليها من أهل النظر فإنه من لا يرى الفعل إلا الله ثم يفرق بين الحق والخلق بأن يجعل للخلق وجودا في عينه وللحق وجودا في عينه لم يقل أحسن الخالقين إلا تقديرا لا إيجادا ومن أهل الله من يرى ذلك ولكن لا يرى أن في الوجود إلا الله وأحكام أعيان الممكنات في عين وجوده وهذا هو النظر التام الذي لا ينال بالفكر ولكن ينال بالشهود وهوقول النبي صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nفمن عرف نفسه أنه لم تزل عينه في إمكانها عرف ربه بأنه الموجود في الوجود ومن عرف أن التغييرات الظاهرة في الوجود هي أحكام استعدادات الممكنات عرف ربه بأنه عين مظهرها والناس بل العلماء على مراتب في ذلك فلما أوجد العالم طرفين وواسطة جعل الطرف الواحد كالنقطة من الدائرة وجعل الطرف الآخر كالمحيط للدائرة وإنشاء العالم بين هذين الطرفين في مراتب ودوائر فسمى المحيط عرشا وسمي النقطة أرضا وما بينهما دوائر أركان وأفلاك جعلها محلا لأشخاص أنواع أجناس ما خلق من العالم وتجلى سبحانه تجليا عاما إحاطيا وتجلى تجليا خاصا شخصيا فالتجلي العام تجل رحماني وهو قوله تعالى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ والتجلي الخاص هو ما لكل شخص شخص من العلم بالله وبهذا التجلي يكون الدخول والخروج والنزول والصعود والحركة والسكون والاجتماع والافتراق والتجاوز ومن يكون بحيث محله وميز العالم بعضه عن بعضه بالمكان والمكانة والصورة والعرض فما ميزه إلا به فهو عين ما تميز وعين ما تميز به فهو مع كل موجود حيث كان بالصورة الظاهرة المنسوبة لذلك الموجود يعلم ذلك كله العلماء بالله من طريق الشهود والوجود فما ميز الغيب من الشهادة فجعل الشهادة عين تجليه وجعل الغيب عين الحجاب عليه فهو شهادة للحجاب لا للمحجوب فمن كان حجابه عين صورته والحجاب يشهد ما وراءه فالصورة من الكون تشهده والمحجوب بصورته عن وجود الحق محجوب فهو من حيث صورته عارف بربه مسبح بحمده ومن حيث ما هو غير صورة أو من خلف الصورة محجوب إما بالصورة أو بشهود نفسه فإن رزقه الله شهود نفسه فقد عرفها فيعرف ربه بلا شك فيكون من أهل الصدور الذين أعماهم الله بشهوده عن شهودهم كما قال ولكِنْ تَعْمَى الْقُلُوبُ وهي أعيان البصائر الَّتِي في الصُّدُورِ أي في الرجوع بعد الورود فهو ثناء فإنه لا يصدر إلا بما شاهد في الورود للقوة الإلهية التي أعطاه الله إياها فمن جميع بين العلمين وظهر بالصورتين فهو من أهل العلم بالغيب والشهادة وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ‏\n\n\nومن هذا المنزل حكم الاسم الإلهي الوارث وهم حكم عجيب لأنه ينفذ في السموات وفي الأرض ونفوذه‏\nفي ذلك دليل على خراب السموات والأرض وهو قوله يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ فكما كان في أول الخلق إن الأرض خلقت قبل السماء كما قدمناه في ترتيب وجود خلق العالم كذلك لما وقع التبديل ابتدأ بالأرض قبل السموات فوقف الخلق على الجسر دون الظلمة وبدل الأرض غير الأرض لا في الصفة فلو كان في الصفة ما ذكر العين ولا يكون وارث إلا من مالك متقدم يكون ذلك الموروث في ملكه فيموت عنه فيأخذه الوارث بحكم الورث وقد أخبر الله أن له مِيراثُ السَّماواتِ والْأَرْضِ فلا يرثها إلا الاسم الوارث لا يكون غير هذا ولو لم يكن لها مالك إلا المتصرف فيها وهي الأسماء الإلهية التي لها التصرف فإذا انقضت مدتها بالحكم فيها ما دامت على هذه الصورة والنظم الخاص وكانت المدبرة لها فلما زال تدبيرها وانقضى حكمها الخاص لانقضاء أمد مدة القبول لذلك سمي هذا الزوال موتا وصارت هذه الأعيان ورثا فتولاها الاسم الوارث فأزال حكم ما كانت عليه فبدل الأرض غير الأرض والسموات حتى لا تعرف الأرض ولا السماء موجدا لها إلا هذا الاسم ولو بقي عين الأرض والسماء لتقسمت وذكرت من كانت ملكا له من الأسماء قبل هذا فربما حنت إليه والأسماء الإلهية لها غيرة لأن المسمى بها وصف نفسه بالغيرة فتعلق حكمها بالأسماء لتعلقها بالمسمى والغيرة مأخوذة من شهود الأغيار وكل اسم إلهي يريد الحكم له وانفراد المحكوم عليه إليه لا يلتفت إلى غيره فبدل الأرض والسماء في العين فلم تعرف هذه الأرض ولا السماء إلا هذا الاسم الوارث خاصة فزالت الشركة في العبادة وظهر التوحيد وحكم المال الموروث ما هو مثل حكم المالك الأصلي فإن حكم الوارث حكم الواهب وحكم المالك الأصلي الموروث عنه حكم الكاسب فتختلف الأذواق فيختلف الحكم فيختلف التصريف فالكاسب حاله ينزل بقدر ما يشاء لأنه في موطن تكليف وانتظار سؤال وحساب ومؤاخذة فهو حفيظ لهذه المراتب التي لا بد منها وحكم الوارث يعطي بغير حساب وينزل بلا مقدار لأن الآخرة لا ينتهي أمدها فتكون الأشياء فيها تجري إِلى‏ أَجَلٍ مُسَمًّى فينزل بِقَدَرٍ ما يَشاءُ لأجل ذلك الأجل والدنيا لأمور فيها تجري إلى أجل مسمى وينقضي أمدها فينزل فيها مالكها بقدر معلوم مساو لمدة الأجل فلو أعطى بغير حساب لزاد على الأمد أو نقص فتبطل الحكمة فحكم الوارث حكم الوهاب وحكم المالك الموروث عنه حكم المقدر المقيت أ لا تسمع إلى قوله في خلق هذه الأرض الأولى وقَدَّرَ فِيها أَقْواتَها فجعلها ذات مقدار فلن تموت نفس حتى تستكمل رزقها وإذا استكملت رزقها ذهب حكم الرازق منها من كونه رازقا في هذه المدة الخاصة وبقي الرزاق ينظر إلى حكم الوارث ما يقول له فيقول الوارث له ارزق بغير قدر ولا انتهاء مدة أ لا ترى أن الله قال للقلم اكتب في اللوح علمي في خلقي إلى يوم القيامة فضرب له الأمد لانقضاء مدة الدنيا وتناهيها ولا يصح أن يكتب علمه في خلقه في الآخرة لأنه لا ينتهي أمدها وما لا ينتهي لا يحويه الوجود والكتابة وجود فلا يصح أن يحصرها لانفصاله فإنه انتهاء ما لا ينتهي وهذا خلف فيرجع حكم الأسماء التي كانت تحكم على الأشياء في الدنيا تحكم فيها في الآخرة بحسب ما يرسم لها الاسم الوارث فمن حاز معرفة الأسماء الإلهية فقد حاز المعرفة بالله على أكمل الوجوه وهذا المنزل يتضمن علوما جمة منها علم تنزيه العالم العلوي بما هو محصور في أين وتنزيه أين العالم السفلي ومحله لا تنزيهه وعلم الترتيب والمنازل والمراتب التي لا يمكن أن يوصل إليها ذوقا ولا حالا وعلم أصناف الحياة وضروب الموت المعنوي والحسي ومن يقبل ذلك ممن لا يقبله وعلم الأضداد هل يجمعها عين فتكون الأضداد عينا واحدة أو هي الأحكام لعين واحدة تطلبها النسب وعلم حكم الزمان في الإيجاد الإلهي هل حكمه في ذلك لذاته أعني لذات الزمان أو هو بتولية يمكن عزله عنها ومن هنا يعلم الاسم الإلهي الدهر وعلم الأموات التي توجب المهلة وعدم المهلة فيحكم على الحق في الأشياء بحسب الأداة فيقدم إن اقتضت الأداة التقديم ويؤخر إن اقتضت الأداة التأخير وعلم الملك بطريق الإحاطة وعلم النكاح الذي يكون عنه التوالد من النكاح الذي لمجرد الشهوة من غير توالد وعلم مشاهدة الحق إيانا بما ذا\n\n\nيشهدنا هل بذاته أو بصفة تقوم به وعلم ما يظهر من الغيب للشهادة وما لا يظهر وعلم رجوع الشهادة إلى الغيب بعد ما كان شهادة بحيث أن لا يبقى في الخيال مثال منه فيمن من شأنه أن يتخيل وعلم النور المنزل في ظلمة الطبيعة هل يبقى على صفائه أو يؤثر فيه ظلام الطبيعة فيكون‏\nكالسدفة وعلم الايمان بالمجموع هل يقبل الايمان الزيادة والنقص أو لا يقبل وعلم المفاضلة على اختلافها وكثرتها وعلم الربا المحمود المشروط في المعاملة وما معنى‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم لم يكن الله لينهاكم عن الربا ويأخذه منكم‏\n\n\nفاعلم أنه لا يأخذه منا ويعطينا إياه ويجوز اشتراطه في معاملة الحق دون الخلق في زمان مخصوص وعلم من ينسب إليه المشي من غير إن يكون موصوفا بأن له المشي وعلم نطق من ليس من شأنه في رتبة الحس أنه يتكلم وعلم رد الأعمال على العاملين وعلم البرزخ الذي بين الرحمة والغضب الإلهي فلا يكون لواحد حكم يستقل به في الموجود ما حكم ذلك البرزخ وهل له عين موجودة في نفس الأمر أو هو نسبة لها وجهان في الحكم وعلم ما الذي قعد بالثقلين عن النهوض إلى ما فيه سعادتهم بعد إبانة الله طريق السعادة على ألسنة المخبرين عن الله وعلم الموطن الذي يقوم البدل فيها في الحكم مقام المبدل منه من الموطن الذي لا يقبل ذلك مع كونه يقبل التبديل لذاته وعلم المدد ولما ذا يرجع عددها المحكوم عليها به هل لعين المدة فيقبل العدد كالأشخاص في النوع الواحد أو هل تختلف المدد لذواتها وعلم ما يحصل من الأثر فيمن هو تحت حكم المدة من قصرها وطولها وعلم اختلاف الأحكام على الأعيان هل تختلف لاختلاف استعداد الأعيان باختلاف الأوقات أو هل تختلف باختلاف الأسماء الحاكمة وعلم مراتب العبيد من الأحرار وما لكل واحد من الصنفين من الله وعلم الفرق بين الصديقية والشهادة ومن أي مقام نال السر أبو بكر الذي فضل به غيره وعلم مراتب النار ولما ذا تنوعت الأسماء عليها وما لكل اسم من الأصناف الذين يدخلونها وعلم الفرقان بين النشأتين والحياتين وعلم السبب الذي ثبط قوما وأسرع بآخرين والفرق بين السرعة والسبق وعلم الموطن الذي يقوم به الواحد مقام الكثير وعلم القضاء السابق على الحكم الواقع بالسورة وعلم اتصاف الحق باليسر دون العسر وما هو الأصعب عنده من الأهون إذ كان هو الفاعل للأمرين وعلم مقام إزالة العبد من حكم الصفتين المتقابلتين فلا وصف له كأبي يزيد وعلم ما يؤدي شهوده إلى أن لا يحب الشي‏ء نفسه الذي من شأنه أن يتصف بالحب وعلم المنع الإلهي لما يرجع وعلم المنافع والمضار المحسوسة والمعنوية وعلم الرسالة والرسل وعلم الاختراع والتدبير وعلم من له من كل شي‏ء زوجان وعلم العناية الإلهية هل حكمها في الفرع مثل حكمها في الأصل أم لا فهذا حصر ما يتضمنه هذا المنزل من العلوم وفي كل علم علوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Twenty-Seven: Concerning the Knowledge of the Station of the Measure (المد) and the Portion (النصيف) from the Muhammadan Presence (الحضرة المحمدية)\n\n> Innovation (الابتداع) is an observed Law (شريعة مرعية),\n>\n> Which Allah praised in His Revelation (تنزيله).\n>\n> This is without a Reality (حقيقة) that established it,\n>\n> So the legislator of the established is from its interpretation (تأويله).\n>\n> It is more worthy of being observed and its value known;\n>\n> This is what is known from its detailed explanation.\n\n### [The Science of Preferential Distinction (علم المفاضلة)]\n\nKnow, may Allah support you, that among the sciences of this station is the science of preferential distinction (علم المفاضلة). Preferential distinction occurs in various ways: distinction by Knowledge (العلم) and distinction by Action (العمل).\n\nDistinction in Knowledge may occur due to the superiority of the known things (المعلومات), or it may be through the manner of reaching the known thing (المعلوم). One person takes his knowledge directly from Allah, and another takes his knowledge from a specific entity of the cosmos (كون من الأكوان). The one who takes his knowledge from Allah is also subject to distinction. Among them are those who take it through a cause, such as the pious person through his piety (تقواه), and among them are those who take it from Allah without any intermediary cause. Among the causes is supplication (الدعاء) for an increase in Knowledge.\n\nAs for distinction in the known thing: one knowledge relates to the Acts (الأفعال), another to the Names (الأسماء), and another to the Essence (الذات). Thus, the separation between the scholars is equivalent to the separation between the objects of these sciences, yet all of it is Divine Knowledge (علم إلهي).\n\nLikewise, distinction in actions may be due to their essences (أعيانها), or due to times (الأزمان), or due to places (المكان), or due to spiritual states (الحال). The measure is determined in everything according to what the reality (حقيقة) in which the distinction occurred grants.\n\nThere are those for whom the measure is determined by volume (مكيال) and scale (ميزان), if it is expenditure (إنفاق) or if the analogy is made to expenditure, such as the intellect (العقل) which Allah divided among people with a measure, giving one a *qafiz* and another two *qafiz*. Sometimes the measure is determined by levels (المراتب) and degrees (الدرجات).\n\nThat which limits the scope of preferential distinction for you is only number, and how it occurs is said to be according to what the Establisher or the Informer wills: <<يَرْفَعِ الله الَّذِينَ آمَنُوا مِنْكُمْ والَّذِينَ أُوتُوا الْعِلْمَ دَرَجاتٍ>> (Allah will raise those who have believed among you and those who were given Knowledge, by degrees).\n\nAnd expenditure after the Hijra (emigration) does not reach the reward of expenditure before the Hijra, neither for the people of Mecca nor in every place where the servant is commanded to emigrate from it to another place, where he performs good deeds while residing there, and then performs good deeds after his emigration. This good deed is distinguished according to the difficulty (المشقة).\n\n### [The Station of the Measure (المد) and the Portion (النصيف) from the Stations of Transcendence (التنزيه)]\n\nKnow that this station contains various sciences, which we have alluded to naming at the end of this chapter so that they may be known and sought after. This station is one of the stations of Transcendence (التنزيه) that we mentioned at the beginning of this book when discussing the Station of Stations (منزل المنازل).\n\nIt is the transcendence of half the World (العالم) and half the locus of existence of the Fixed Entities (الأعيان الثابتة) from the station of Might (العزة) which rules over all by overwhelming power (القهر) and the inability to reach the ultimate goal in what they intended of praising Allah.\n\nSuch as the saying of the Messenger of Allah, peace and blessings be upon him: \"I cannot enumerate Your praise.\" He did not say that until he was unable to reach the ultimate goal he sought within himself. Neither the limbs nor the Divine Names (الأسماء الإلهية) we possess sufficed for that. For He, the Mighty and Majestic, is only praised by His Most Beautiful Names (أسمائه الحسنى), and only what He has manifested of them is known, and He is only praised by speaking those Names, which is remembrance (الذكر), and this only comes from Him, not by our own designation. For it is not permissible according to us that He be named except by what He named Himself, and thus He is not praised except by what He praised Himself with—except for the Judge Abu Bakr ibn al-Tayyib, who held the view that it is permissible to name Him with any name that does not imply the attribute of createdness (الحدوث).\n\nThe entire World is under His overwhelming power and in His grasp. He gives life (يحيى) through His Witnessing (شهوده) and His Theophany (تجليه) when He wills or to whom He wills, and He causes death (يميته) through His veiling (احتجابه) and concealment (ستره) when He wills or concerning whom He wills.\n\nHowever, if He has not disclosed Himself to a person with a Theophany that makes him know that He is the Unrestricted (غير مقيد), then when He discloses Himself in such a manner, there is no veil (حجاب) after this Theophany. Thus, he possesses essential life (الحياة الذاتية) through his witnessing Him, and he never dies the death of veiling and concealment. But if He does not disclose Himself to him—though He is eternally disclosing Himself, but is not known—then the one veiled by his ignorance of Him is dead. For the life of Knowledge (العلم) is countered by the death of ignorance (الجهل), and its attainment occurs through Light (النور), just as ignorance occurs through darkness (الظلمة) in its ruling.\n\nThe Exalted said: <<أَ ومن كانَ مَيْتاً فَأَحْيَيْناهُ>> (Is one who was dead and We gave him life?). He described him first with death, then with life for the one He gave life to. Then He said: <<وجَعَلْنا لَهُ نُوراً>> (And We made for him a Light) by which he witnesses Him, <<فليس مثله كَمَنْ مَثَلُهُ في الظُّلُماتِ>> (Is he like one whose likeness is in the darknesses?), even if he is alive. And the living one knows the Unseen (الغيب) within the Unseen over which the Name The Inner (الباطن) rules. If he is not alive and knowing, then that is pure darkness (الظلمة المحضة) and absolute non-existence (العدم الخالص).\n\nAnd Allah, the Glorified, has the power (الاقتدار) over everything we have mentioned. The Influx (الوارد) informed me, and the Witness (الشاهد) testifies to its truth from me, after my Lord placed me upon clear evidence regarding it through my witnessing Him when He cast Being (الوجود) into my heart: that the specific placement of the *Basmala* at the beginning of every Surah is the crowning of the Divine Mercy (الرحمة الإلهية) in the decree (منشور) of that Surah, ensuring that it reaches everything mentioned within it. For it is Allah’s sign upon every Surah that it originates from Him, like the signet of the Sultan upon his decrees.\n\nI asked the Influx, \"What about the Surah of Repentance (Al-Tawbah) according to you?\" He replied, \"It and Al-Anfal are a single Surah which The Real (الحق) divided into two sections. If He separated it and ruled by separation, He named it the Surah of Repentance, meaning the Surah of the Divine Return (الرجعة الإلهية) with Mercy upon those servants with whom He was angry.\" That anger is not eternal, but temporary. And Allah is The Acceptor of Repentance (التواب). The Acceptor of Repentance is only coupled with The Merciful (الرحيم) so that the one angered against returns to Mercy, or with The Wise (الحكيم) for setting a duration for the anger and its ruling until a term, so that after the expiration of the duration, Mercy returns to him. Look at the Name by which The Acceptor of Repentance is qualified, and you will find its ruling as we have mentioned.\n\nThe Quran gathers the mention of those He is pleased with and those He is angry with, and the crowning of its stations with *Ar-Rahman Ar-Rahim* (The Most Compassionate, The Most Merciful). The ruling belongs to the crowning, for through it acceptance occurs, and through it, it is known that it is from Allah. This is the information of the Influx to us, and we witness, hear, and comprehend. To Allah belongs all praise and favor for that.\n\nBy Allah, I have neither spoken nor judged except based on an inspiration (نفث في روع) from a Holy Divine Spirit (روح إلهي قدسي), whose knowledge is Inner (الباطن) when it is veiled from the Outer (الظاهر), in order to distinguish between Sainthood (الولاية) and Messengership (الرسالة). Sainthood has priority (الأولية); then it accompanies and remains firm and does not vanish. Among its degrees are Prophethood (النبوة) and Messengership. Some people attain them and reach them, and some people do not reach them. As for today, no one reaches the degree of Prophethood of Legislation (نبوة التشريع) because its door is closed. But Sainthood does not cease, neither in this world nor the Hereafter. Thus, Sainthood holds the ruling of The First (الأول), The Last (الآخر), The Outer, and The Inner, through general and specific prophethood, and without prophethood. Among His Names is The Guardian (الولي), but Prophet and Messenger are not among His Names. For this reason, Prophethood and Messengership ceased, because they have no basis in the Divine Names (الأسماء الإلهية). But Sainthood did not cease, for the Name The Guardian preserves it.\n\nThen, Allah the Exalted decreed things by Knowledge (علما), then brought them into existence by ruling (حكما), and made them two extremes and an intermediary (واسطة) that unites the two extremes, having a face toward each extreme in that Isthmus-like (البرزخية) intermediary, which is the creation of the Perfect Human (الإنسان الكامل). Thus, He combined decree (التقدير), which is general, and bringing into existence (الإيجاد), which is specific, such as His saying: \"and I breathe into it, and it becomes a bird by My permission.\" So He is <<أَحْسَنُ الْخالِقِينَ>> (The Best of Creators) in decree and in bringing into existence.\n\nThis is an issue upon which the people of speculation (أهل النظر) do not agree. For whoever sees the Act as belonging only to Allah, and then distinguishes between The Real (الحق) and Creation (الخلق) by assigning existence to Creation in its essence and existence to The Real in His Essence, he would only say \"The Best of Creators\" in terms of decree, not in terms of bringing into existence. But among the People of Allah (أهل الله) are those who see that, yet they do not see anything in Existence (الوجود) except Allah, and the rulings of the essences of the contingent things (أعيان الممكنات) are within the very Essence of His Being. This is the perfect view (النظر التام) which is not attained by thought (الفكر) but is attained by Witnessing (الشهود). And this is the saying of the Prophet, peace and blessings be upon him: \"Whoever knows himself knows his Lord.\"\n\nSo, whoever knows himself—that his essence (عينه) has never ceased to be in its contingency (إمكانها)—knows his Lord as the Existent (الموجود) within Existence. And whoever knows that the apparent changes in Existence are the rulings of the preparedness (استعدادات) of the contingent things knows his Lord as the very Essence (عين) that manifests them. People, indeed scholars, are at various levels regarding this.\n\nWhen He brought the World into existence as two extremes and an intermediary, He made one extreme like the point (النقطة) of the circle and the other extreme like the circumference (المحيط) of the circle. And the creation of the World between these two extremes is in levels (مراتب) and circles (دوائر). He named the circumference the Throne (*Arsh*) and the point the Earth (*Ard*). And what is between them are circles of pillars and spheres (*aflak*), which He made the locus for the individuals, species, and genera of what He created in the World.\n\nAnd He, the Glorified, disclosed Himself (تجلى) with a general, encompassing Theophany (تجليا عاما إحاطيا), and disclosed Himself with a specific, individual Theophany (تجليا خاصا شخصيا). The general Theophany is a Merciful Theophany (تجل رحماني), which is His saying, the Exalted: <<الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏>> (The Most Compassionate established Himself upon the Throne). And the specific Theophany is the portion of Knowledge of Allah that belongs to every single person. By this Theophany occur entry and exit, descent and ascent, movement and stillness, gathering and separation, and passing beyond, and whoever is in the state of his locus.\n\nAnd He distinguished parts of the World from others by place (المكان), status (المكانة), form (الصورة), and accident (العرض). He only distinguished it by Himself, so He is the very essence (عين) of what is distinguished and the very essence of that by which it is distinguished. Thus, He is with every existent wherever it is, by the apparent form attributed to that existent. The scholars of Allah know all of this through the path of Witnessing (الشهود) and Being (الوجود).\n\nHe distinguished the Unseen (الغيب) from the Visible (الشهادة), making the Visible the very essence of His Theophany (تجلي), and making the Unseen the very essence of the veil (الحجاب) upon Him. Thus, it is a witnessing *of* the veil, not *of* the Veiled One. So, whoever’s veil is the very essence of his form (صورته), and the veil witnesses what is behind it, then the form, being part of the cosmos, witnesses Him. And the one veiled by his form from the Being of The Real (وجود الحق) is veiled. Thus, in terms of his form, he is a Gnostic (عارف) of his Lord, glorifying Him with praise. But in terms of what is not form, or what is behind the form, he is veiled, either by the form or by witnessing his own self.\n\nIf Allah grants him the witnessing of his self, he has known it, and thus he knows his Lord without doubt. He is then among the People of the Breasts (أهل الصدور) whom Allah blinded from witnessing themselves by His Witnessing, as He said: <<ولكِنْ تَعْمَى الْقُلُوبُ>> (But the hearts are blinded), which are the essences of the insights (أعيان البصائر) <<الَّتِي في الصُّدُورِ>> (which are in the breasts). That is, in the return (الرجوع) after the arrival (الورود). This is praise, for he only issues forth (يصدر) with what he witnessed during the arrival, due to the Divine Power that Allah granted him. So, whoever combines the two knowledges and appears in the two forms is among the people of Knowledge of the Unseen and the Visible, and <<هُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ>> (He is All-Knowing of everything).\n\nFrom this station is the ruling of the Divine Name The Inheritor (الوارث), and it is a wondrous ruling because it penetrates the heavens (السموات) and the earth (الأرض). And its penetration therein is evidence of the destruction of the heavens and the earth, which is His saying: <<يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ>> (The Day the earth will be replaced by another earth, and the heavens as well). Just as in the beginning of creation the earth was created before the heaven, as we presented in the order of the existence of the creation of the World, likewise, when the replacement occurs, He begins with the earth before the heavens. So, creation stands upon the bridge (*jisr*) without darkness. And the earth is replaced by another earth, not in attribute (الصفة), for if it were in attribute, the essence (العين) would not have been mentioned.\n\nAnd there is no inheritor (وارث) except from a preceding owner (مالك متقدم) who possessed the inherited thing, and then dies concerning it, so the inheritor takes it by the ruling of inheritance. And Allah has informed that to Him belongs <<مِيراثُ السَّماواتِ والْأَرْضِ>> (the inheritance of the heavens and the earth). Thus, only the Name The Inheritor inherits them; it cannot be otherwise. Even if their only owners were those who dispose of them, which are the Divine Names that possess the power of disposal. When their duration of ruling over them expires, as long as they are upon this specific form and order, and those Names were their administrators. When their administration ceased and their specific ruling expired due to the termination of the period of acceptance for that, this cessation was called death. And these entities (أعيان) became an inheritance, so the Name The Inheritor took charge of them and removed the ruling they were under, thus replacing the earth with another earth and the heavens.\n\nSo that neither the earth nor the heaven knows any originator for them except this Name. If the essence of the earth and the heaven had remained, they would have been divided and would have remembered which Names owned them before this, and perhaps longed for them. And the Divine Names possess jealousy (*ghayra*) because the One named by them described Himself with jealousy, so their ruling is attached to the Names due to their attachment to the Named One. And jealousy is derived from the witnessing of others (*aghyar*). Every Divine Name desires the ruling to belong to it and the isolation of the ruled thing to itself, not turning to any other. So, He replaced the earth and the heaven in essence, and neither this earth nor this heaven knew anything except this Name, The Inheritor, specifically. Thus, partnership in worship ceased, and Unity (التوحيد) appeared.\n\nAnd the ruling of the inherited property is not like the ruling of the original owner. For the ruling of The Inheritor is the ruling of The Giver (الواهب), and the ruling of the original owner from whom it was inherited is the ruling of The Acquirer (الكاسب). Thus, the tastes (أذواق) differ, so the ruling differs, and the disposal (التصريف) differs. The state of The Acquirer is that He sends down (provisions) according to what He wills, because He is in a place of obligation (*taklif*), awaiting questioning, reckoning, and accountability. Thus, He is the Preserver of these necessary levels. But the ruling of The Inheritor is that He gives without reckoning and sends down without measure, because the Hereafter (الآخرة) has no termination period.\n\nAnd the world (الدنيا), for the matters within it, runs to an appointed term and its duration expires. So, its Owner sends down in it a known measure (بقدر معلوم) equal to the duration of the term. If He gave without reckoning, it would exceed the duration or fall short, and wisdom (الحكمة) would be invalidated. Thus, the ruling of The Inheritor is the ruling of The Bestower (الوهاب), and the ruling of the inherited Owner is the ruling of The Determiner (المقدر), The Maintainer (المقيت). Do you not hear His saying concerning the creation of this first earth: <<وقَدَّرَ فِيها أَقْواتَها>> (And He determined therein its provisions)? So, He made it possess measure. No soul will die until it has completed its provision. And when it completes its provision, the ruling of The Provider (الرازق) over it ceases, in terms of His being the Provider during this specific duration. And The Sustainer (الرزاق) remains, looking to the ruling of The Inheritor, asking what He commands. The Inheritor says to Him: \"Provide without measure and without termination of duration.\"\n\nDo you not see that Allah said to the Pen (القلم): \"Write in the Tablet My Knowledge concerning My creation until the Day of Resurrection\"? Thus, He set a limit for it due to the expiration and finitude of the duration of the world. And it is not valid for His Knowledge concerning His creation in the Hereafter to be written, because its duration does not end. And what does not end cannot be contained by Existence (الوجود), and writing is existence. Thus, it is not valid to confine it due to its separation, for that would be the termination of what does not terminate, and this is a contradiction. So, the ruling of the Names that governed things in the world returns to govern them in the Hereafter according to what the Name The Inheritor prescribes for them. Whoever has attained the Gnosis (معرفة) of the Divine Names has attained Gnosis of Allah in the most complete manner.\n\nThis station contains numerous sciences, among them: the science of the transcendence (تنزيه) of the Upper World (العالم العلوي) in terms of how it is confined to \"where\" (*ayn*), and the transcendence of the \"where\" of the Lower World (العالم السفلي) and its locus, but not its transcendence itself. And the science of arrangement, stations (المنازل), and levels (المراتب) that cannot be reached by spiritual taste (*dhawq*) or spiritual state (*hal*). And the science of the types of life and the forms of death, both spiritual (المعنوي) and sensory (الحسي), and who accepts that and who does not. And the science of opposites (الأضداد): whether a single essence (عين) unites them, making the opposites one essence, or whether they are rulings for a single essence demanded by relationships (النسب). And the science of the ruling of Time (الزمان) in the Divine bringing into existence: whether its ruling in that is due to its own essence, meaning the essence of Time, or whether it is by appointment from which it can be dismissed. And from this is known the Divine Name Time/Eternity (الدهر). And the science of the deaths that necessitate respite (المهلة) and the absence of respite, so that The Real (الحق) rules over things according to the instrument (الأداة), advancing if the instrument requires advancement, and delaying if the instrument requires delay. And the science of Sovereignty (الملك) by way of encompassing (الإحاطة). And the science of marriage (*nikah*) that results in procreation, as distinct from the marriage that is merely for desire without procreation. And the science of The Real’s witnessing us: by what does He witness us? Is it by His Essence (ذاته) or by an Attribute (صفة) subsisting in Him? And the science of what appears from the Unseen (الغيب) to the Visible (الشهادة) and what does not appear. And the science of the return of the Visible to the Unseen after it was visible, such that no image of it remains in the Imagination (الخيال) for those whose nature it is to imagine. And the science of the Light (النور) sent down into the darkness of Nature (الطبيعة): does it remain upon its purity, or does the darkness of Nature affect it, making it like twilight (*sudfa*)? And the science of Faith (الايمان) in its totality: does Faith accept increase and decrease, or does it not accept it? And the science of preferential distinction (المفاضلة) in its various and numerous forms. And the science of praiseworthy usury (*riba*) stipulated in transaction, and the meaning of the saying of the Prophet, peace and blessings be upon him: \"Allah would not forbid you from usury and then take it from you.\" Know that He does not take it from us but gives it to us, and it is permissible to stipulate it in transaction with The Real (الحق), but not with creation (الخلق), during a specific time. And the science of the one to whom walking is attributed without his being described as possessing walking. And the science of the speech (نطق) of one whose nature, in the sensory degree, is not to speak. And the science of the return of actions upon the doers. And the science of the Isthmus (البرزخ) that lies between Divine Mercy (الرحمة) and Divine Wrath (الغضب). What is the ruling of that Isthmus, such that no single ruling is independent in the existent thing? Does it have an existing essence (*ayn*) in reality, or is it a relationship (نسبة) that has two faces in ruling? And the science of what held back the two weighty ones (mankind and jinn) from rising up to what contains their happiness, after Allah made clear the path of happiness upon the tongues of those who inform about Allah. And the science of the locus where the substitute (البدل) stands in ruling in place of the substituted (المبدل منه), as distinct from the locus that does not accept that, despite accepting substitution in its essence. And the science of durations (المدد), and why their decreed number returns: is it due to the essence of the duration, so it accepts number like individuals in a single species, or do the durations differ due to their own essences? And the science of the effect that occurs in one who is under the ruling of duration, whether short or long. And the science of the variation of rulings upon the essences (الأعيان): do they vary due to the varying preparedness of the essences at different times, or do they vary due to the varying ruling Names? And the science of the levels of slaves (*abid*) versus free men (*ahrar*), and what each of the two categories receives from Allah. And the science of the difference between Truthfulness (*Siddiqiyya*) and Witnessing (*Shahada*), and from which station Abu Bakr attained the secret by which he surpassed others. And the science of the levels of the Fire (النار), why the Names applied to it are varied, and what portion of the categories of those who enter it belongs to each Name. And the science of the Criterion (*Furqan*) between the two creations (النشأتين) and the two lives (الحياتين). And the science of the reason that held back some people and hastened others, and the difference between speed (السرعة) and precedence (السبق). And the science of the locus where the single one stands in place of the multitude. And the science of the Preceding Decree (القضاء السابق) over the ruling that occurs by the Surah. And the science of The Real’s being characterized by Ease (اليسر) rather than Difficulty (العسر), and what is more difficult for Him than what is easier, since He is the Doer of both matters. And the science of the station of removing the servant from the ruling of the two opposing Attributes, so that he has no description, like Abu Yazid. And the science of what the witnessing of which leads a thing, whose nature it is to be described by love, not to love itself. And the science of the Divine withholding of what returns. And the science of benefits and harms, both sensory and spiritual. And the science of Messengership (الرسالة) and Messengers (الرسل). And the science of Invention (الاختراع) and Administration (التدبير). And the science of the one who has two spouses/pairs from everything. And the science of Divine Providence (العناية الإلهية): is its ruling in the derivative (الفرع) like its ruling in the origin (الأصل), or not?\n\nThis is a summary of the sciences contained within this station, and within every science are further sciences. And Allah speaks the Truth, and He guides to the Way.",
    "ur": "باب نمبر تین سو ستائیس: \"حضور محمدیہ (الحضرة المحمدیۃ) میں منزلِ مد اور نصیف کی معرفت کے بیان میں۔\"\n\nنئی راہ نکالنا ایک مرعی شریعت ہے،\nجس کی اللہ نے اپنی تنزیل میں تعریف کی ہے۔\nیہ اس حقیقت کے بغیر ہے جسے اس نے سنت بنایا،\nپس سنت کو مشروع کرنے والا اس کی تاویل سے ہے۔\nیہ زیادہ لائق ہے کہ اس کی رعایت کی جائے اور اس کی قدر پہچانی جائے،\nیہ اس کی تفصیل سے معروف ہے۔\n\n### [علمِ فضیلت]\n\nجان لو، اللہ تمہاری مدد کرے، کہ اس منزل کے علوم میں سے ایک علمِ فضیلت (علم المفاضلة) ہے۔ اور فضیلت کئی طرح کی ہوتی ہے: علم کے ذریعے فضیلت اور عمل کے ذریعے فضیلت۔ علم کے ذریعے فضیلت معلومات کی فضیلت کی وجہ سے واقع ہو سکتی ہے، اور کبھی معلوم تک رسائی کے طریقے کی وجہ سے ہوتی ہے۔ پس ایک وہ ہے جو اپنا علم اللہ سے حاصل کرتا ہے اور دوسرا وہ ہے جو اپنا علم کائنات (الأکوان) میں سے کسی کون سے حاصل کرتا ہے۔ اور جو اپنا علم اللہ سے حاصل کرتا ہے، ان میں بھی فضیلت ہوتی ہے؛ پس ان میں سے کچھ وہ ہیں جو کسی سبب کے ذریعے لیتے ہیں، جیسے متقی اپنے تقویٰ کے ذریعے، اور کچھ وہ ہیں جو اللہ سے بغیر کسی سبب کے لیتے ہیں۔ اور اسباب میں سے ایک علم میں اضافے کے لیے دعا ہے۔ اور معلوم میں فضیلت یہ ہے کہ ایک علم افعال سے متعلق ہوتا ہے، دوسرا اسماء سے، اور تیسرا ذات سے۔ پس علماء کے درمیان اتنا ہی فرق (الفصل) ہے جتنا ان علوم کے متعلقات کے درمیان ہے، اور یہ سب الٰہی علم ہے۔ اسی طرح اعمال میں فضیلت بھی ان کی ذات، زمان، مکان، اور حال کے اعتبار سے ہو سکتی ہے۔ پس ہر چیز میں اس حقیقت کے مطابق اندازہ لگایا جاتا ہے جس میں فضیلت واقع ہوئی ہو۔ پس کچھ چیزیں ایسی ہیں جن میں اندازہ پیمانے اور وزن کے ذریعے ہوتا ہے، جب وہ انفاق ہو یا اس میں انفاق سے تشبیہ دی گئی ہو، جیسے عقل جسے اللہ نے لوگوں کے درمیان ایک پیمانے سے تقسیم کیا، پس ایک کے لیے ایک قفیز (پیمانہ) اور دوسرے کے لیے دو قفیز بنا دیا۔ اور کبھی اندازہ مراتب اور درجات کے ذریعے ہوتا ہے۔ اور جو چیز تمہارے لیے بابِ فضیلت کو محدود کرتی ہے، وہ صرف عدد ہے، اور یہ کس چیز سے واقع ہوتا ہے؟ تو کہا جائے گا کہ یہ واضع (قانون بنانے والے) یا خبر دینے والے کے ارادے کے مطابق ہوتا ہے۔ اللہ تعالیٰ کا فرمان ہے: **يَرْفَعِ الله الَّذِينَ آمَنُوا مِنْكُمْ والَّذِينَ أُوتُوا الْعِلْمَ دَرَجاتٍ** (اللہ تم میں سے ایمان لانے والوں اور جنہیں علم دیا گیا ہے، ان کے درجات بلند کرتا ہے)۔ اور ہجرت کے بعد کا خرچ (نفقة) اس خرچ کے اجر کو نہیں پہنچتا جو ہجرت سے پہلے کیا گیا، نہ اہل مکہ میں اور نہ ہی ہر اس جگہ میں جہاں بندے کو اس سے ہجرت کر کے کسی دوسری جگہ جانے کا حکم دیا گیا ہو، پس وہ اس میں رہتے ہوئے کوئی نیکی کرے، پھر ہجرت کے بعد کوئی نیکی کرے۔ پس یہ نیکی مشقت کی مقدار کے مطابق فضیلت رکھتی ہے۔\n\n### [منازلِ تنزیہ میں سے منزلِ مد اور نصیف]\n\nجان لو کہ یہ منزل مختلف علوم پر مشتمل ہے، جن کے ناموں کی طرف ہم نے اس کے آخر میں اشارہ کیا ہے تاکہ تم انہیں جانو اور طلب کرو۔ اور یہ منزل ان منازلِ تنزیہ (التنزیہ) میں سے ہے جن کا ذکر ہم نے اس کتاب کے شروع میں منزل المنازل کے ذکر کے وقت کیا تھا۔ اور یہ نصف عالم اور عالم کی اعیانِ ہستی (وجود أعیان العالم) کے محل کے نصف کو مقامِ عزت (مقام العزة) سے پاک قرار دینا ہے جو سب پر قہر (القہر) کے ساتھ حاکم ہے، اور اس غایت تک پہنچنے سے عاجز ہونا ہے جس کا انہوں نے اللہ کی ثنا میں ارادہ کیا، جیسے:\n\nرسول اللہ صلی اللہ علیہ وسلم کا یہ فرمان: **\"لا أحصي ثناء عليك\"** (میں تیری ثنا کا احاطہ نہیں کر سکتا)۔\n\nآپ نے یہ بات اس وقت تک نہیں کہی جب تک کہ آپ اس غایت تک پہنچنے سے عاجز نہ ہو گئے جسے آپ نے اپنے نفس میں طلب کیا تھا۔ پس نہ تو اعضاء اس کو پورا کر سکے اور نہ ہی وہ الٰہی اسماء جو ہمارے پاس ہیں۔ کیونکہ اس (عز و جل) کی ثنا صرف اس کے اسماء حسنیٰ کے ذریعے کی جاتی ہے، اور ان میں سے صرف وہی معلوم ہیں جو اس نے ظاہر کیے، اور اس کی ثنا صرف ان اسماء کے ذریعے کلام کرنے سے کی جاتی ہے، اور وہ ذکر (الذکر) ہے۔ اور یہ صرف اسی کی طرف سے ہوتا ہے، نہ کہ ہماری طرف سے وضع کرنے سے۔ کیونکہ ہمارے نزدیک یہ جائز نہیں کہ اسے کسی ایسے نام سے پکارا جائے جس سے اس نے خود کو نہ پکارا ہو۔ پس اس کی ثنا صرف اسی چیز سے کی جاتی ہے جس سے اس نے خود اپنی ثنا کی ہے، سوائے قاضی ابو بکر بن الطیب کے، جو اس بات کے قائل تھے کہ اسے ہر اس نام سے پکارنا جائز ہے جو حدوث (پیدا ہونے) کی صفت کا وہم نہ دلائے۔\n\nپس سارا عالم اس کے قہر کے تحت اور اس کی گرفت میں ہے۔ وہ جسے چاہے یا جب چاہے اپنے شہود (الشہود) اور ظہور الٰہی (التجلی) کے ذریعے زندہ کرتا ہے، اور جسے چاہے یا جب چاہے اپنے احتجاب (پردہ) اور ستر کے ذریعے موت دیتا ہے۔ لیکن جب تک کسی شخص پر ایسا ظہور الٰہی (التجلی) نہ ہو جائے جس سے وہ جان لے کہ وہ (ذات حق) غیر مقید ہے، تو اگر اس طرح کا ظہور الٰہی ہو جائے تو اس ظہور الٰہی کے بعد کوئی حجاب نہیں رہتا۔ پس اسے اپنے شہود (الشہود) کے ذریعے ذاتی زندگی (الحیاة الذاتیۃ) حاصل ہو جاتی ہے، اور وہ کبھی حجاب اور پردے کی موت نہیں مرتا۔ اور اگر اس پر ظہور الٰہی نہ ہو، حالانکہ وہ ہمیشہ ظہور الٰہی میں ہے لیکن وہ اسے نہیں جانتا، تو وہ شخص جو اپنی جہالت کی وجہ سے محجوب ہے، وہ مردہ ہے۔ کیونکہ علم کی زندگی کے مقابلے میں جہل کی موت ہے، اور نور کے ذریعے اس کا حصول ہوتا ہے، جیسا کہ تاریکی کے ذریعے اس کے حکم میں جہالت ہوتی ہے۔ اللہ تعالیٰ فرماتا ہے: **أَ ومن كانَ مَيْتاً فَأَحْيَيْناهُ** (کیا وہ شخص جو مردہ تھا، پھر ہم نے اسے زندہ کیا)۔ پس اس نے اسے موت سے متصف کیا، پھر اس شخص کے لیے زندگی سے جسے اس نے زندہ کیا، پھر فرمایا: **وجَعَلْنا لَهُ نُوراً** (اور ہم نے اس کے لیے ایک نور بنا دیا) جس کے ذریعے وہ اس کا شہود (الشہود) کرتا ہے۔ پس اس کی مثال اس شخص کی طرح نہیں ہے **كَمَنْ مَثَلُهُ في الظُّلُماتِ** (جس کی مثال تاریکیوں میں ہے)، اگرچہ وہ زندہ ہے، اور وہ (ذات حق) زندہ ہے جو غیب کو جانتا ہے اس غیب میں جس پر اسمِ باطن (الاسم الباطن) حکم کرتا ہے۔ پس اگر وہ زندہ نہ ہو کر نہ جانے، تو وہ محض تاریکی اور خالص عدم ہے۔ اور اللہ سبحانہ و تعالیٰ کو ہر اس چیز پر قدرت حاصل ہے جس کا ہم نے ذکر کیا۔\n\nمجھے وارد (الوارد) نے خبر دی، اور شاہد (الشاہد) نے میرے لیے اس کی سچائی کی گواہی دی، جب میرے رب نے مجھے اس بارے میں بصیرت عطا کی کہ میں نے اس کا شہود (الشہود) کیا جب اس نے میرے دل میں ہستی (الوجود) کو ڈالا، کہ ہر سورت کے شروع میں بسم اللہ کا اختصاص اس سورت کے منشور میں الٰہی رحمت (الرحمة الإلهیۃ) کی تاج پوشی ہے، تاکہ وہ اس میں مذکور ہر چیز کو حاصل ہو۔ کیونکہ یہ ہر سورت پر اللہ کی علامت ہے کہ وہ اس کی طرف سے ہے، جیسے سلطان کی اپنے منشورات پر علامت ہوتی ہے۔ پس میں نے وارد (الوارد) سے کہا: \"تو آپ کے نزدیک سورۃ التوبہ کا کیا حکم ہے؟\" اس نے کہا: \"وہ اور الانفال ایک ہی سورت ہیں جسے حق (الحق) نے دو فصلوں میں تقسیم کیا ہے۔ پس جب اس نے اسے الگ کیا اور فصل کا حکم دیا، تو اس نے اسے سورۃ التوبہ یعنی الٰہی رجعت (الرجعة الإلهیۃ) کی سورت کا نام دیا، رحمت کے ساتھ ان بندوں پر جن پر اس نے غضب کیا تھا۔ پس یہ غضب ابدی نہیں، بلکہ ایک مدت کا غضب ہے۔ اور اللہ ہی تواب (توبہ قبول کرنے والا) ہے۔ پس تواب کے ساتھ رحیم (الرحیم) کو ہی ملایا گیا تاکہ مغضوب علیہ رحمت کی طرف لوٹ آئے، یا حکیم (الحکیم) کو ملایا گیا تاکہ غضب میں مدت مقرر کی جائے اور اس میں اس کا حکم ایک وقت تک ہو، تاکہ مدت کے ختم ہونے کے بعد رحمت کے ساتھ اس کی طرف رجوع کرے۔ پس اس اسم کو دیکھو جس سے تواب کی صفت بیان کی گئی ہے، تم اس کا حکم ویسا ہی پاؤ گے جیسا ہم نے ذکر کیا۔ اور قرآن ان لوگوں کے ذکر کو جمع کرنے والا ہے جن سے وہ راضی ہوا اور جن پر اس نے غضب کیا۔ اور اس کی منازل کی تاج پوشی رحمن و رحیم کے ساتھ ہے، اور حکم تاج پوشی کا ہے، کیونکہ اسی سے قبولیت واقع ہوتی ہے اور اسی سے معلوم ہوتا ہے کہ یہ اللہ کی طرف سے ہے۔ یہ وارد (الوارد) کی ہمیں خبر ہے، اور ہم سنتے، دیکھتے اور سمجھتے ہیں۔ اس پر اللہ کا شکر اور احسان ہے۔\n\nاور اللہ کی قسم! میں نے کوئی بات نہیں کہی اور نہ ہی کوئی حکم لگایا مگر ایک الٰہی قدسی روح (روح إلهي قدسي) کے میرے دل میں پھونکنے (نفث في روع) سے، جس کا باطنی علم اس وقت ظاہر سے محجوب ہو گیا جب ولایت (الولایۃ) اور رسالت (الرسالۃ) کے درمیان فرق کیا گیا۔ اور ولایت (الولایۃ) کو اولیت حاصل ہے، پھر وہ ساتھ رہتی ہے اور ثابت رہتی ہے اور زائل نہیں ہوتی۔ اور اس کے درجات میں نبوت اور رسالت شامل ہیں۔ ہم میں سے کچھ لوگ اس تک پہنچتے ہیں اور کچھ لوگ اس تک نہیں پہنچتے۔ لیکن آج کے دن نبوتِ تشریع کے درجے تک کوئی نہیں پہنچ سکتا، کیونکہ اس کا دروازہ بند ہے۔ اور ولایت (الولایۃ) دنیا اور آخرت میں ختم نہیں ہوتی۔ پس ولایت کے لیے اول اور آخر، ظاہر اور باطن کا حکم ہے، عام اور خاص نبوت کے ساتھ اور بغیر نبوت کے۔ اور اس کے اسماء میں سے الولی (ولی) ہے، اور اس کے اسماء میں سے نبی یا رسول نہیں ہے۔ اسی لیے نبوت اور رسالت منقطع ہو گئیں، کیونکہ الٰہی اسماء میں ان کا کوئی مستند نہیں ہے، اور ولایت منقطع نہیں ہوئی کیونکہ اسمِ ولی (الاسم الولی) اس کی حفاظت کرتا ہے۔\n\nپھر اللہ تعالیٰ نے اشیاء کو علم کے لحاظ سے مقدر کیا، پھر انہیں حکم کے لحاظ سے موجود کیا، اور انہیں دو سرے (طرفین) اور ایک واسطہ (واسطۃ) بنا دیا جو دونوں سروں کو جمع کرتا ہے۔ اس واسطہ برزخی (الواسطة البرزخیۃ) میں ہر سرے کی طرف ایک رُخ ہے، اور یہ انسان کامل (الإنسان الکامل) کی تخلیق ہے۔ پس اس نے تقدیر (جو عام ہے) اور ایجاد (جو خاص ہے) کو جمع کیا، جیسے اس کا فرمان: **فَيَنْفُخُ فِيهِ فَيَكُونُ طائِراً بِإِذْنِي** (پھر وہ اس میں پھونکتا ہے تو وہ میرے حکم سے پرندہ بن جاتا ہے)۔ پس وہ تقدیر اور ایجاد کے لحاظ سے **أَحْسَنُ الْخالِقِينَ** (بہترین خالق) ہے۔\n\nاور یہ اہل نظر کے درمیان ایک غیر متفقہ مسئلہ ہے، کیونکہ جو شخص فعل کو صرف اللہ کا فعل سمجھتا ہے، پھر حق (الحق) اور خلق (الخلق) کے درمیان فرق کرتا ہے کہ خلق کے لیے اس کی اپنی عین میں ہستی (الوجود) ہے اور حق کے لیے اس کی اپنی عین میں ہستی ہے، وہ \"أحسن الخالقین\" صرف تقدیر کے لحاظ سے کہے گا، نہ کہ ایجاد کے لحاظ سے۔ اور اہل اللہ میں سے کچھ وہ ہیں جو اسے دیکھتے ہیں، لیکن وہ ہستی (الوجود) میں اللہ کے سوا کسی کو نہیں دیکھتے، اور ممکنات کی اعیان کے احکام اس کی عینِ ہستی (عین وجوده) میں ہیں۔ اور یہ وہ کامل نظر (النظر التام) ہے جو فکر سے حاصل نہیں ہوتی، بلکہ شہود (الشہود) سے حاصل ہوتی ہے۔ اور یہ نبی صلی اللہ علیہ وسلم کا قول ہے: **\"من عرف نفسه عرف ربه\"** (جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا)۔\n\nپس جس نے اپنے نفس کو پہچانا کہ اس کی عین ہمیشہ اپنے امکان میں رہی ہے، اس نے اپنے رب کو پہچانا کہ وہ ہستی (الوجود) میں موجود ہے۔ اور جس نے یہ پہچانا کہ ہستی (الوجود) میں ظاہر ہونے والی تبدیلیاں ممکنات کے استعدادات کے احکام ہیں، اس نے اپنے رب کو پہچانا کہ وہ ان کا مظہر (عین مظهرها) ہے۔ اور لوگ، بلکہ علماء، اس میں مراتب رکھتے ہیں۔\n\nپس جب اس نے عالم کو دو سروں اور ایک واسطہ کے طور پر موجود کیا، تو ایک سرے کو دائرے کے نقطے کی طرح بنایا، اور دوسرے سرے کو دائرے کے محیط کی طرح بنایا۔ اور ان دونوں سروں کے درمیان عالم کی تخلیق مراتب اور دائروں میں کی۔ پس اس نے محیط کو عرش (عرش) کا نام دیا اور نقطے کو زمین (أرض) کا نام دیا، اور ان کے درمیان کے دائروں کو ارکان اور افلاک بنایا، اور انہیں عالم کی مخلوقات کی انواع و اجناس کے اشخاص کا محل بنایا۔\n\nاور اس (سبحانہ و تعالیٰ) نے ایک عام احاطہ کرنے والا ظہور الٰہی (التجلی العام إحاطي) کیا، اور ایک خاص شخصی ظہور الٰہی (التجلی الخاص شخصي) کیا۔ پس عام ظہور الٰہی (التجلی العام) رحمانی ظہور الٰہی ہے، اور یہ اس کا فرمان ہے: **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏** (رحمن عرش پر مستوی ہوا)۔ اور خاص ظہور الٰہی (التجلی الخاص) وہ ہے جو ہر شخص کو اللہ کے بارے میں حاصل ہوتا ہے۔ اور اسی ظہور الٰہی (التجلی) کے ذریعے داخل ہونا اور نکلنا، اترنا اور چڑھنا، حرکت اور سکون، جمع ہونا اور جدا ہونا، اور تجاوز واقع ہوتا ہے۔ اور جو اپنے محل کے لحاظ سے ہوتا ہے، اور اس نے عالم کے بعض کو بعض سے مکان، مکانت، صورت اور عرض کے ذریعے ممتاز کیا۔ پس اس نے اسے صرف اسی کے ذریعے ممتاز کیا، پس وہ عین وہی ہے جو ممتاز ہوا، اور عین وہی ہے جس کے ذریعے وہ ممتاز ہوا۔ پس وہ ہر موجود کے ساتھ ہے جہاں بھی وہ ہو، اس ظاہری صورت کے ساتھ جو اس موجود سے منسوب ہے۔\n\nاللہ کے علماء یہ سب کچھ شہود (الشہود) اور ہستی (الوجود) کے طریقے سے جانتے ہیں۔ پس اس نے غیب کو شہادت سے ممتاز نہیں کیا، بلکہ شہادت کو اپنے ظہور الٰہی (عین تجلیه) کی عین بنا دیا، اور غیب کو اپنے اوپر حجاب (عین الحجاب) کی عین بنا دیا۔ پس یہ حجاب کے لیے شہادت ہے، نہ کہ محجوب کے لیے۔ پس جس کا حجاب اس کی صورت کی عین ہو، اور حجاب اپنے پیچھے کی چیز کا شہود (الشہود) کرتا ہو، تو کائنات کی صورت اس کا شہود کرتی ہے، اور جو اپنی صورت کے ذریعے ذات حق (الحق) کی ہستی (الوجود) سے محجوب ہے، وہ محجوب ہے۔ پس وہ اپنی صورت کے لحاظ سے اپنے رب کو پہچاننے والا ہے، اس کی حمد کے ساتھ تسبیح کرنے والا ہے، اور جس لحاظ سے وہ صورت نہیں ہے یا صورت کے پیچھے ہے، وہ محجوب ہے، یا تو صورت کے ذریعے یا اپنے نفس کے شہود (شہود نفسه) کے ذریعے۔ پس اگر اللہ اسے اپنے نفس کا شہود عطا کر دے، تو اس نے اسے پہچان لیا، پس وہ بلا شک اپنے رب کو پہچان لے گا، اور وہ اہل صدور میں سے ہو گا جنہیں اللہ نے اپنے شہود (الشہود) کے ذریعے ان کے اپنے شہود سے اندھا کر دیا، جیسا کہ اس نے فرمایا: **ولكِنْ تَعْمَى الْقُلُوبُ** (لیکن دل اندھے ہو جاتے ہیں)، اور وہ بصیرتوں کی اعیان ہیں **الَّتِي في الصُّدُورِ** (جو سینوں میں ہیں)۔ یعنی ورود (آنے) کے بعد رجوع (لوٹنے) میں۔ پس یہ ثنا ہے، کیونکہ وہ صرف اسی چیز کو صادر کرتا ہے جس کا اس نے ورود میں مشاہدہ کیا، اس الٰہی قوت کے لیے جو اللہ نے اسے عطا کی ہے۔ پس جس نے دونوں علموں کو جمع کیا اور دونوں صورتوں کے ساتھ ظاہر ہوا، وہ غیب اور شہادت کے علم والوں میں سے ہے، اور **وَهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ‏** (اور وہ ہر چیز کا جاننے والا ہے)۔\n\nاور اس منزل میں الٰہی اسم الوارث (الاسم الإلهي الوارث) کا حکم بھی شامل ہے، اور یہ ایک عجیب حکم ہے کیونکہ یہ آسمانوں اور زمین میں نافذ ہوتا ہے، اور اس کا نفاذ آسمانوں اور زمین کی خرابی کی دلیل ہے۔ اور یہ اس کا فرمان ہے: **يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ** (جس دن زمین دوسری زمین سے بدل دی جائے گی اور آسمان بھی)۔\n\nپس جیسا کہ تخلیق کے آغاز میں زمین آسمان سے پہلے پیدا کی گئی تھی، جیسا کہ ہم نے عالم کی تخلیق کی ترتیب میں بیان کیا، اسی طرح جب تبدیلی واقع ہوئی تو زمین سے پہلے آسمانوں کا آغاز ہوا۔ پس مخلوق ظلمت کے بجائے پل پر کھڑی ہو گی۔ اور زمین کو دوسری زمین سے بدل دیا جائے گا، نہ کہ صفت میں۔ اگر صفت میں ہوتا تو عین کا ذکر نہ ہوتا۔\n\nاور وارث (الوارث) صرف وہی ہو سکتا ہے جو کسی سابقہ مالک سے ہو، جس کی ملکیت میں وہ موروثی چیز ہو، پھر وہ اس سے مر جائے، تو وارث وراثت کے حکم سے اسے لے لے۔ اور اللہ نے خبر دی ہے کہ اس کے لیے **مِيراثُ السَّماواتِ والْأَرْضِ** (آسمانوں اور زمین کی میراث) ہے۔ پس اسے صرف اسمِ وارث (الاسم الوارث) ہی ورثہ میں لے گا، اس کے علاوہ کوئی نہیں۔ اور اگر اس کا کوئی مالک نہ ہوتا سوائے اس کے جو اس میں تصرف کرتا ہے، اور وہ الٰہی اسماء ہیں جنہیں تصرف حاصل ہے، تو جب تک وہ اس خاص صورت اور نظم پر قائم رہے، ان کا حکم ختم ہو جائے گا، اور وہ اس کی تدبیر کرنے والے تھے۔ پس جب ان کی تدبیر زائل ہو گئی اور ان کا خاص حکم قبولیت کی مدت کے ختم ہونے کی وجہ سے ختم ہو گیا، تو اس زوال کو موت کا نام دیا گیا، اور یہ اعیان ورثہ بن گئیں۔ پس اسمِ وارث (الاسم الوارث) نے ان کی ذمہ داری سنبھالی، اور اس حکم کو زائل کر دیا جس پر وہ قائم تھیں۔ پس زمین کو دوسری زمین سے اور آسمانوں کو بدل دیا، یہاں تک کہ زمین اور آسمان اس اسم کے سوا کسی کو اپنا موجد نہیں پہچانیں گے۔ اور اگر زمین اور آسمان کی عین باقی رہتی، تو وہ تقسیم ہو جاتی اور ان اسماء کا ذکر کرتی جو اس سے پہلے اس کے مالک تھے، تو شاید وہ ان کی طرف مائل ہو جاتی۔ اور الٰہی اسماء غیرت رکھتے ہیں، کیونکہ جس کے نام یہ ہیں اس نے خود کو غیرت سے متصف کیا ہے۔ پس ان کا حکم اسماء سے متعلق ہوا کیونکہ وہ مسمیٰ سے متعلق ہیں۔ اور غیرت اغیار (دوسروں) کے شہود (الشہود) سے لی گئی ہے۔ اور ہر الٰہی اسم چاہتا ہے کہ حکم اسی کا ہو اور جس پر حکم کیا گیا ہے وہ صرف اسی کی طرف متوجہ ہو، کسی اور کی طرف التفات نہ کرے۔\n\nپس اس نے زمین اور آسمان کو عین میں بدل دیا، تو اس زمین اور آسمان نے صرف اس اسمِ وارث (الاسم الوارث) کو ہی پہچانا۔ پس عبادت میں شرکت زائل ہو گئی اور توحید ظاہر ہو گئی۔\n\nاور موروثی مال کا حکم وہی نہیں ہوتا جو اصلی مالک کا حکم ہوتا ہے۔ کیونکہ وارث کا حکم واہب (الوہاب) کا حکم ہے، اور موروثی اصلی مالک کا حکم کاسب (الکاسب) کا حکم ہے۔ پس ذوق مختلف ہوتے ہیں، تو حکم مختلف ہوتا ہے، تو تصرف مختلف ہوتا ہے۔ پس کاسب کا حال اس مقدار میں نازل ہوتا ہے جتنا وہ چاہتا ہے، کیونکہ وہ تکلیف، سوال، حساب اور مؤاخذہ کے مقام پر ہے، پس وہ ان مراتب کا محافظ ہے جو ضروری ہیں۔ اور وارث کا حکم بغیر حساب کے عطا کرتا ہے اور بغیر مقدار کے نازل ہوتا ہے، کیونکہ آخرت کی مدت ختم نہیں ہوتی، تاکہ اس میں چیزیں **إِلى‏ أَجَلٍ مُسَمًّى** (ایک مقررہ مدت تک) چلیں، اور اس مدت کی وجہ سے وہ **بِقَدَرٍ ما يَشاءُ** (جتنا وہ چاہے) نازل کرے۔ اور دنیا میں کچھ امور ایک مقررہ مدت تک چلتے ہیں اور ان کی مدت ختم ہو جاتی ہے، پس اس کا مالک اس میں ایک معلوم مقدار میں نازل کرتا ہے جو مدت کے برابر ہوتی ہے۔ اگر وہ بغیر حساب کے عطا کرتا تو مدت سے بڑھ جاتا یا کم ہو جاتا، تو حکمت باطل ہو جاتی۔\n\nپس وارث کا حکم وہاب (الوہاب) کا حکم ہے، اور موروثی مالک کا حکم مقدر مقیت (المقدر المقیت) کا حکم ہے۔ کیا تم اس پہلی زمین کی تخلیق کے بارے میں اس کے فرمان کو نہیں سنتے: **وقَدَّرَ فِيها أَقْواتَها** (اور اس میں اس کی غذائیں مقرر کیں)۔ پس اس نے اسے ایک مقدار والا بنایا۔ پس کوئی جان نہیں مرے گی جب تک کہ وہ اپنا رزق پورا نہ کر لے، اور جب وہ اپنا رزق پورا کر لے گی، تو اس مدت خاص میں رازق ہونے کے لحاظ سے رازق کا حکم اس سے چلا جائے گا۔ اور رزاق (الرزاق) باقی رہے گا، وہ دیکھے گا کہ اسمِ وارث (الاسم الوارث) اسے کیا کہتا ہے، تو وارث اسے کہے گا: \"بغیر کسی مقدار اور مدت کے رزق دے۔\"\n\nکیا تم نہیں دیکھتے کہ اللہ نے قلم سے کہا: \"لوح میں میری مخلوق کا علم قیامت تک لکھ دے۔\" پس اس نے دنیا کی مدت کے ختم ہونے اور اس کے اختتام کے لیے مدت مقرر کر دی۔ اور آخرت میں اپنی مخلوق کا علم لکھنا صحیح نہیں ہے، کیونکہ اس کی مدت ختم نہیں ہوتی۔ اور جو چیز ختم نہیں ہوتی، اسے ہستی (الوجود) گھیر نہیں سکتی، اور کتابت ہستی ہے۔ پس اس کا احاطہ کرنا صحیح نہیں ہے کیونکہ وہ انفصال ہے، اور یہ اس چیز کا اختتام ہے جو ختم نہیں ہوتی، اور یہ ایک تضاد ہے۔\n\nپس وہ اسماء جو دنیا میں اشیاء پر حکم کرتی تھیں، ان کا حکم آخرت میں اس کے مطابق ہو گا جو اسمِ وارث (الاسم الوارث) ان کے لیے رسم کرے گا۔ پس جس نے الٰہی اسماء کی معرفت (المعرفۃ) حاصل کر لی، اس نے اللہ کی معرفت کو کامل ترین طریقوں سے حاصل کر لیا۔\n\nاور یہ منزل بہت سے علوم پر مشتمل ہے، جن میں سے:\n\nعالمِ علوی (اوپر کے عالم) کی پاکیزگی کا علم، اس لحاظ سے کہ وہ \"کہاں\" (أین) میں محدود ہے، اور عالمِ سفلی (نیچے کے عالم) کے محل کی پاکیزگی کا علم، نہ کہ اس کی پاکیزگی کا۔\n\nترتیب، منازل اور مراتب کا علم جن تک ذوقاً یا حالاً نہیں پہنچا جا سکتا۔\n\nزندگی کی اقسام اور معنوی و حسی موت کی اقسام کا علم، اور کون اسے قبول کرتا ہے اور کون قبول نہیں کرتا۔\n\nمتضاد چیزوں (الأضداد) کا علم، کیا انہیں کوئی عین جمع کرتی ہے، پس متضاد چیزیں ایک ہی عین ہوں، یا وہ ایک ہی عین کے احکام ہیں جنہیں نسبتیں طلب کرتی ہیں۔\n\nالٰہی ایجاد میں زمانے (الزمان) کے حکم کا علم، کیا اس کا حکم اس کی ذات کے لیے ہے، یعنی زمانے کی ذات کے لیے، یا یہ کسی تولیت کے ذریعے ہے جسے معزول کیا جا سکتا ہے؟ اور یہیں سے الٰہی اسم الدھر (الاسم الإلهي الدهر) کا علم حاصل ہوتا ہے۔\n\nاموات کا علم جو مہلت اور عدمِ مہلت کو واجب کرتی ہیں، پس اشیاء میں حق (الحق) پر آلے کے مطابق حکم کیا جاتا ہے، پس اگر آلہ تقدیم کا تقاضا کرے تو مقدم کیا جاتا ہے، اور اگر آلہ تاخیر کا تقاضا کرے تو مؤخر کیا جاتا ہے۔\n\nاحاطہ کے طریقے سے ملک (بادشاہت) کا علم۔\n\nاس نکاح کا علم جس سے توالد (نسل) ہوتی ہے، اس نکاح سے جو صرف شہوت کے لیے ہو اور توالد نہ ہو۔\n\nہمارے مشاہدے کا علم کہ حق (الحق) ہمیں کس چیز سے دیکھتا ہے، کیا اپنی ذات سے یا کسی صفت سے جو اس کے ساتھ قائم ہے۔\n\nغیب سے شہادت کے لیے کیا ظاہر ہوتا ہے اور کیا ظاہر نہیں ہوتا، اس کا علم۔\n\nشہادت کے غیب کی طرف لوٹنے کا علم، اس کے بعد جب وہ شہادت تھی، اس طرح کہ جو شخص تخیل کرنے کی صلاحیت رکھتا ہو، اس کے خیال میں بھی اس کی کوئی مثال باقی نہ رہے۔\n\nطبیعت کی تاریکی میں نازل ہونے والے نور کا علم، کیا وہ اپنی صفائی پر باقی رہتا ہے یا طبیعت کی تاریکی اس پر اثر انداز ہوتی ہے، پس وہ سدفعہ (تاریکی میں روشنی) کی طرح ہو جاتا ہے۔\n\nمجموعی ایمان کا علم، کیا ایمان زیادتی اور کمی کو قبول کرتا ہے یا قبول نہیں کرتا۔\n\nفضیلت (المفاضلة) کا علم، اس کے مختلف ہونے اور کثرت کے باوجود۔\n\nقابل تعریف سود (الربا المحمود) کا علم جو معاملے میں مشروط ہے، اور نبی صلی اللہ علیہ وسلم کے اس فرمان کا کیا معنی ہے:\n\n**\"لم يكن الله لينهاكم عن الربا ويأخذه منكم\"** (اللہ ایسا نہیں ہے کہ تمہیں سود سے منع کرے اور پھر تم سے اسے لے لے)۔\n\nپس جان لو کہ وہ اسے ہم سے نہیں لیتا بلکہ ہمیں عطا کرتا ہے، اور مخلوق کے بجائے حق (الحق) کے ساتھ مخصوص زمانے میں معاملے میں اس کی شرط لگانا جائز ہے۔\n\nاس شخص کا علم جس کی طرف چلنے (المشي) کی نسبت کی جاتی ہے، بغیر اس کے کہ وہ چلنے کی صفت سے متصف ہو۔\n\nاس شخص کے بولنے کا علم جو حسی مرتبے میں بولنے کی صلاحیت نہیں رکھتا۔\n\nاعمال کو عمل کرنے والوں پر لوٹانے کا علم۔\n\nالٰہی رحمت (الرحمة) اور غضب (الغضب) کے درمیان برزخ (البرزخ) کا علم، پس کسی ایک کے لیے موجود میں کوئی ایسا حکم نہیں ہوتا جو اس برزخ کے حکم سے آزاد ہو۔ اور کیا اس کی نفس الامر میں کوئی موجود عین ہے یا یہ ایک نسبت ہے جس کے حکم میں دو رُخ ہیں۔\n\nاس سبب کا علم جس نے دونوں بھاری مخلوقات (جن و انس) کو اس چیز کی طرف اٹھنے سے روک دیا جس میں ان کی سعادت تھی، جبکہ اللہ نے سعادت کا راستہ خبر دینے والوں کی زبانوں سے واضح کر دیا تھا۔\n\nاس مقام کا علم جہاں بدل (تبدیل ہونے والی چیز) حکم میں مبدل منہ (جس سے بدلا گیا) کی جگہ لیتا ہے، اس مقام سے جو اسے قبول نہیں کرتا، باوجود اس کے کہ وہ اپنی ذات کے لیے تبدیلی کو قبول کرتا ہے۔\n\nمدتوں (المدد) کا علم، اور ان کی مقرر کردہ تعداد کیوں لوٹتی ہے، کیا مدت کی عین کے لیے، پس وہ عدد کو قبول کرتی ہے جیسے ایک نوع میں اشخاص، یا کیا مدتیں اپنی ذات کے لحاظ سے مختلف ہوتی ہیں۔\n\nاس اثر کا علم جو اس شخص میں پیدا ہوتا ہے جو مدت کے حکم کے تحت ہے، اس کی کمی اور زیادتی سے۔\n\nاعیان پر احکام کے اختلاف کا علم، کیا وہ اوقات کے اختلاف سے اعیان کے استعدادات کے اختلاف کی وجہ سے مختلف ہوتے ہیں، یا کیا وہ حاکم اسماء کے اختلاف کی وجہ سے مختلف ہوتے ہیں۔\n\nآزاد لوگوں میں سے غلاموں کے مراتب کا علم، اور دونوں قسموں میں سے ہر ایک کے لیے اللہ کی طرف سے کیا ہے۔\n\nصدیقیت (الصدیقیۃ) اور شہادت (الشہادۃ) کے درمیان فرق کا علم، اور ابو بکر نے وہ راز کس مقام سے حاصل کیا جس سے وہ دوسروں پر فضیلت لے گئے۔\n\nآگ (النار) کے مراتب کا علم، اور اس پر اسماء کیوں متنوع ہوئے، اور ہر اسم کے لیے ان اقسام میں سے کیا ہے جو اس میں داخل ہوں گی۔\n\nدونوں نشأتوں (دنیا و آخرت) اور دونوں زندگیوں کے درمیان فرقان (امتیاز) کا علم۔\n\nاس سبب کا علم جس نے کچھ لوگوں کو سست کر دیا اور دوسروں کو تیز کر دیا، اور تیزی (السرعة) اور سبقت (السبق) کے درمیان فرق کا علم۔\n\nاس مقام کا علم جہاں ایک شخص بہت سے لوگوں کی جگہ کھڑا ہوتا ہے۔\n\nسورت کے ذریعے واقع ہونے والے حکم سے پہلے کی قضا (القضاء السابق) کا علم۔\n\nحق (الحق) کا آسانی (الیسر) سے متصف ہونا، نہ کہ تنگی (العسر) سے، اور اس کے نزدیک مشکل ترین چیز آسان ترین چیز سے کیا ہے، جبکہ وہ دونوں کام کرنے والا ہے۔\n\nبندے کو دو متقابل صفات کے حکم سے ہٹانے کے مقام کا علم، پس اس کی کوئی صفت نہ ہو، جیسے ابو یزید۔\n\nاس چیز کے شہود (الشہود) کا علم جو اس بات کا باعث بنتا ہے کہ کوئی چیز خود سے محبت نہ کرے، جو محبت کی صفت سے متصف ہونے کی صلاحیت رکھتی ہے۔\n\nالٰہی ممانعت کا علم جب وہ لوٹتی ہے۔\n\nمحسوس اور معنوی منافع اور نقصانات کا علم۔\n\nرسالت (الرسالۃ) اور رسولوں (الرسل) کا علم۔\n\nاختراع (ایجاد) اور تدبیر کا علم۔\n\nاس شخص کا علم جس کے لیے ہر چیز کے دو جوڑے ہیں۔\n\nالٰہی عنایت (العنایۃ الإلهیۃ) کا علم، کیا اس کا حکم فرع میں وہی ہے جو اصل میں ہے یا نہیں۔\n\nپس یہ ان علوم کا احاطہ ہے جو یہ منزل اپنے اندر رکھتی ہے، اور ہر علم میں کئی علوم ہیں۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏** (حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و بیست و هفتم: در معرفت منزل \"مد\" و \"نصیف\" از حضرت محمدیه (الحضرة المحمدية)\n\nبدعت (الابتداع) شریعتی است مورد توجه و رعایت، *** که خداوند در تنزیل خود آن را ستوده است.\nاین [بدعت] بدون حقیقتی است که آن را وضع کرده باشد، *** پس وضع‌کننده سنت (المسنون) از تأویل اوست.\nسزاوارتر است که رعایت شود و قدرش شناخته گردد، *** این همان شناخته شده از تفصیل اوست.\n\n### [علم برتری‌جویی]\n\nبدان، خداوند تو را تأیید کند، که از علوم این منزل، علم برتری‌جویی (المفاضلة) است. برتری‌جویی به چند گونه است: برتری‌جویی به علم و برتری‌جویی به عمل. برتری‌جویی به علم گاهی به سبب فزونی معلومات رخ می‌دهد و گاهی به طریق وصول به معلوم. یکی علم خود را از خدا می‌گیرد و دیگری علم خود را از کونی از اکوان (هستی‌ها). و آن کس که علمش را از خدا می‌گیرد، خود برتری می‌یابد؛ پس برخی از آنان به واسطه سببی علم می‌گیرند، مانند پرهیزکار به سبب تقوایش، و برخی دیگر از خدا علم می‌گیرند بدون واسطه سبب. و از جمله اسباب، دعا برای افزایش علم است. و برتری‌جویی در معلوم: علمی است که به افعال تعلق دارد، و دیگری به اسماء، و دیگری به ذات. پس میان علما تفاوتی است به اندازه تفاوت متعلقات این علوم، و همه علم الهی است. همچنین برتری‌جویی به اعمال، گاهی به عین اعمال، و گاهی به زمان‌ها، و گاهی به مکان، و گاهی به حال است. پس در هر چیزی به حسب آنچه حقیقت محل تفاضل اقتضا می‌کند، اندازه‌گیری می‌شود. در آنجا کسانی هستند که اندازه‌گیری در موردشان با پیمانه و ترازو است، اگر انفاقی باشد یا تشبیه به انفاق شده باشد، مانند عقل که خداوند آن را میان مردم با پیمانه تقسیم کرد، پس برای یکی یک قفیز (پیمانه) و برای دیگری دو قفیز قرار داد. و گاهی اندازه‌گیری با مراتب و درجات است. آنچه باب برتری‌جویی را برای تو محدود می‌کند، همانا عدد است و اینکه آن [برتری] به چه چیزی واقع می‌شود؟ گفته می‌شود: به حسب آنچه واضع یا خبردهنده اراده کند: **«يَرْفَعِ الله الَّذِينَ آمَنُوا مِنْكُمْ والَّذِينَ أُوتُوا الْعِلْمَ دَرَجاتٍ»** (خداوند کسانی از شما را که ایمان آورده‌اند و کسانی را که علم داده شده‌اند، به درجاتی بالا می‌برد). و انفاق پس از هجرت، اجرش به اجر انفاق پیش از هجرت نمی‌رسد، نه در مورد اهل مکه و نه در هر موضعی که بنده در آنجا مخاطب به هجرت از آن به سوی دیگری باشد، پس در آنجا که مستوطن است خیری انجام دهد، سپس پس از هجرتش خیری انجام دهد؛ این خیر به اندازه مشقت برتری می‌یابد.\n\n### [منزل مد و نصیف از منازل تنزیه]\n\nو بدان که این منزل دربردارنده علوم گوناگونی است که در پایان به نام‌گذاری آن‌ها اشاره کردیم تا شناخته شوند و طلب گردند. و این منزل از منازل تنزیه (التنزيه) است که در ابتدای این کتاب هنگام ذکر منزل المنازل (منزلِ منزل‌ها) بیان کردیم. و آن، تنزیه نصف عالم و نصف محل وجود اعیان عالم از مقام عزت است که بر همه با قهر حکم می‌راند، و [تنزیه] از عجز در رسیدن به نهایت در آنچه از ثنای بر خداوند قصد کرده‌اند، مانند:\nقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم: **«لا أحصي ثناء عليك»** (نمی‌توانم ثنای تو را به شمار آورم).\nاین را نگفت مگر آنکه از رسیدن به غایتی که در نفس خود طلب می‌کرد، عاجز شد. پس نه جوارح به آن وفا کردند و نه آنچه از اسماء الهی نزد ماست؛ زیرا بر او عز و جل ثنا گفته نمی‌شود مگر به اسماء حسنایش، و از آن‌ها دانسته نمی‌شود مگر آنچه آشکار کرده است، و بر او ثنا گفته نمی‌شود مگر با سخن گفتن به آن اسماء، که همان ذکر است، و این [ذکر] جز از او نیست، نه به وضع ما. زیرا نزد ما جایز نیست که او نامیده شود مگر به آنچه خود را بدان نامیده است، پس بر او ثنا گفته نمی‌شود مگر به آنچه خود بر خویش ثنا گفته است، مگر قاضی ابوبکر بن الطیب که به جواز نامیدن او به هر اسمی که صفت حدوث را به وهم نیندازد، رفته است. پس عالم تماماً تحت قهر او و در قبضه اوست. با شهود (الشهود) و تجلی الهی (التجلی) او زنده می‌شود، هرگاه که بخواهد یا برای هر که بخواهد، و با احتجاب و پوشش خود می‌میراند، هرگاه که بخواهد یا در حق هر که بخواهد. اما تا زمانی که برای شخصی تجلی‌ای رخ ندهد که بداند او [حق] است و غیر مقید، [وضعیت فرق می‌کند]. پس اگر در چنین حالتی تجلی کند، پس از این تجلی حجابی نیست. پس او به واسطه شهودش، حیات ذاتی دارد و هرگز به مرگ حجاب و ستر نمی‌میرد. و اگر برای او تجلی نکند، در حالی که او همیشه متجلی است اما شناخته نمی‌شود، پس محجوب به جهلش نسبت به او مرده است؛ زیرا حیات علم در مقابلش مرگ جهل قرار دارد، و حصول آن با نور واقع می‌شود، همان‌گونه که جهل در حکم خود با ظلمت است. خداوند متعال می‌فرماید: **«أَ ومن كانَ مَيْتاً فَأَحْيَيْناهُ»** (آیا کسی که مرده بود و ما او را زنده کردیم). پس او را به مرگ و سپس به حیات برای کسی که او را زنده کرد، وصف نمود. سپس فرمود: **«وجَعَلْنا لَهُ نُوراً»** (و برای او نوری قرار دادیم) که با آن شهود می‌کند. پس او مانند کسی نیست که **«كَمَنْ مَثَلُهُ في الظُّلُماتِ»** (مانند کسی که در تاریکی‌هاست)، اگرچه زنده باشد. و او [حق] زنده است و غیب را در غیبی که اسم باطن بر آن حکم می‌راند، می‌داند. پس اگر زنده نباشد که بداند، آن ظلمت محض و عدم خالص است. و خداوند سبحان بر هر آنچه ذکر کردیم، اقتدار دارد. وارد (الوارد) به من خبر داد و شاهد (الشاهد) بر صدق آن از جانب من گواهی می‌دهد، پس از آنکه پروردگارم مرا در این امر بر بینه‌ای قرار داد، به واسطه شهودم او را، هنگامی که هستی (الوجود) را در قلبم افکند، که اختصاص بسمله در ابتدای هر سوره، تاج‌گذاری رحمت الهی در منشور آن سوره است، به این معنا که آن [رحمت] به هر آنچه در آن ذکر شده می‌رسد؛ زیرا بسمله نشانه خداوند بر هر سوره است که آن سوره از جانب اوست، مانند نشانه سلطان بر منشورهایش. پس به وارد گفتم: سوره توبه نزد شما چگونه است؟ گفت: آن و انفال یک سوره واحدند که حق (الحق) آن را به دو فصل تقسیم کرده است. پس اگر آن را جدا کرد و به جدایی حکم نمود، آن را سوره توبه نامید، یعنی سوره بازگشت الهی با رحمت بر کسی از بندگان که بر او غضب شده است. پس این غضب ابدی نیست، بلکه غضب مدت‌دار است. و خداوند همان تواب است. پس تواب جز با رحیم قرین نشده است تا مغضوب علیه به رحمت بازگردد، یا با حکیم قرین شده است تا مدت غضب و حکم آن تا اجلی معین باشد، پس از انقضای مدت با رحمت به او بازگردد. پس به اسمی که تواب بدان وصف شده بنگر، حکمش را همان‌گونه که ذکر کردیم خواهی یافت. و قرآن جامع ذکر کسانی است که از آن‌ها راضی شده و کسانی که بر آن‌ها غضب کرده است، و منازل آن با الرحمن الرحیم تاج‌گذاری شده است. و حکم از آنِ تاج‌گذاری است، زیرا با آن قبول واقع می‌شود و با آن دانسته می‌شود که از نزد خداست. این خبر وارد (الوارد) برای ماست و ما شهود (الشهود) می‌کنیم و می‌شنویم و تعقل می‌کنیم. حمد و منت برای خدا بر این امر. و به خدا سوگند، نگفتم و حکم نکردم مگر از دمیدنی در قلب از روح الهی قدسی که علم باطن (الباطن) اوست، هنگامی که از ظاهر احتجاب کرد تا میان ولایت و رسالت فرق گذاشته شود. و ولایت اولویت دارد، سپس همراهی می‌کند و ثابت می‌ماند و زایل نمی‌شود. و از درجات آن، نبوت و رسالت است. برخی از مردم به آن می‌رسند و برخی به آن نمی‌رسند. اما امروز هیچ کس به درجه نبوت تشریعی نمی‌رسد، زیرا باب آن بسته است. و ولایت در دنیا و آخرت برداشته نمی‌شود. پس ولایت حکم اول و آخر و ظاهر و باطن را دارد، با نبوت عامه و خاصه و بدون نبوت. و از اسماء او، الولی است، اما نبی و رسول از اسماء او نیستند. به همین دلیل نبوت و رسالت منقطع شدند، زیرا مستندی در اسماء الهی ندارند، اما ولایت منقطع نشد، زیرا اسم الولی آن را حفظ می‌کند. سپس خداوند متعال اشیاء را از نظر علم تقدیر کرد، سپس از نظر حکم ایجاد نمود و آن‌ها را دو طرف و یک واسطه جامع برای دو طرف قرار داد که در آن واسطه برزخی، به هر طرفی وجهی دارد، که همان ایجاد انسان کامل (الإنسان الکامل) است. پس میان تقدیر که عام است و میان ایجاد که خاص است، جمع نمود. مانند قول او: «پس در آن می‌دمد و به اذن من پرنده‌ای می‌شود». پس او **«أَحْسَنُ الْخالِقِينَ»** (بهترین آفرینندگان) است، از نظر تقدیر و ایجاد. و این مسئله‌ای است که اهل نظر بر آن اجماع ندارند؛ زیرا کسی که فعل را جز از خدا نمی‌بیند، سپس میان حق (الحق) و خلق فرق می‌گذارد به اینکه برای خلق وجودی در عین خود و برای حق وجودی در عین خود قرار دهد، «أحسن الخالقین» را جز از نظر تقدیر نمی‌گوید، نه از نظر ایجاد. و برخی از اهل الله این را می‌بینند، اما نمی‌بینند که در هستی (الوجود) جز خدا باشد و احکام اعیان ممکنات در عین وجود اوست. و این همان نظر تام است که با فکر به دست نمی‌آید، بلکه با شهود (الشهود) حاصل می‌شود، و آن قول پیامبر (ص) است: **«من عرف نفسه عرف ربه»** (هر کس خود را شناخت، پروردگارش را شناخت). پس هر کس خود را شناخت که عینش همواره در امکان خود بوده است، پروردگارش را شناخت که او موجود در هستی (الوجود) است. و هر کس دانست که تغییرات ظاهری در هستی، احکام استعدادهای ممکنات است، پروردگارش را شناخت که او عین مظهر آن‌هاست. و مردم، بلکه علما، در این باره بر مراتب‌اند. پس هنگامی که عالم را دو طرف و یک واسطه ایجاد کرد، یک طرف را مانند نقطه از دایره قرار داد و طرف دیگر را مانند محیط دایره قرار داد، و ایجاد عالم میان این دو طرف در مراتب و دوایر است. پس محیط را عرش نامید و نقطه را ارض (زمین) نامید، و آنچه میان آن دو است، دوایر ارکان و افلاک هستند که آن‌ها را محل اشخاص انواع اجناس آنچه از عالم خلق کرده، قرار داد. و او سبحانه تجلی (التجلی) عام احاطی کرد و تجلی خاص شخصی کرد. تجلی عام، تجلی رحمانی است و آن قول خداوند متعال است: **«الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏»** (رحمان بر عرش استیلا یافت). و تجلی خاص، همان علم به خداست که برای هر شخص شخصی وجود دارد. و با این تجلی است که دخول و خروج، نزول و صعود، حرکت و سکون، اجتماع و افتراق، و تجاوز رخ می‌دهد. و کسی که در محل خود باشد، عالم را برخی از برخی دیگر به مکان و مکانت و صورت و عرض متمایز ساخت. پس آن را متمایز نکرد مگر به خودش، پس او عین چیزی است که متمایز شده و عین چیزی است که بدان متمایز گشته است. پس او با هر موجودی، هر جا که باشد، به صورت ظاهری منسوب به آن موجود است. این همه را علمای بالله از طریق شهود (الشهود) و هستی (الوجود) می‌دانند. پس غیب را از شهادت متمایز نکرد، بلکه شهادت را عین تجلی (التجلی) خود قرار داد و غیب را عین حجاب بر خود قرار داد. پس آن [غیب] شهادتی است برای حجاب، نه برای محجوب. پس کسی که حجابش عین صورت اوست و حجاب آنچه را که پشت سر اوست شهود می‌کند، صورت از کون (هستی) او را شهود می‌کند. و کسی که به واسطه صورتش از وجود حق (الحق) محجوب است، محجوب است. پس او از حیث صورتش عارف به پروردگارش است و به حمد او تسبیح می‌گوید، و از حیث آنچه غیر صورت است یا از پشت صورت، محجوب است، یا به واسطه صورت یا به واسطه شهود نفس خود. پس اگر خداوند شهود نفسش را روزی او کند، آن را شناخته و بدون شک پروردگارش را می‌شناسد. پس او از اهل صدور (صادرکنندگان) خواهد بود که خداوند آن‌ها را به واسطه شهود خود از شهودشان کور کرده است، چنانکه فرمود: **«ولكِنْ تَعْمَى الْقُلُوبُ»** (بلکه دل‌هایی کور می‌شوند) که همان اعیان بصیرت‌ها هستند **«الَّتِي في الصُّدُورِ»** (که در سینه‌هاست)، یعنی در بازگشت پس از ورود. پس این ثنا است، زیرا صادر نمی‌کند مگر آنچه را که در ورود، به واسطه نیروی الهی که خداوند به او داده، شهود کرده است. پس هر کس میان دو علم جمع کند و با دو صورت ظاهر شود، او از اهل علم به غیب و شهادت است و **«وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ‏»** (و او به هر چیزی داناست).\n\nو از این منزل، حکم اسم الهی الوارث (وارث) است، و آن حکمی شگفت‌انگیز است، زیرا در آسمان‌ها و زمین نفوذ می‌کند، و نفوذش در آن دلیل بر خرابی آسمان‌ها و زمین است، و آن قول اوست: **«يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ والسَّماواتُ»** (روزی که زمین به زمینی دیگر و آسمان‌ها [به آسمان‌هایی دیگر] تبدیل می‌شوند). پس همان‌گونه که در آغاز خلقت، زمین پیش از آسمان خلق شد، چنانکه در ترتیب وجود خلق عالم بیان کردیم، همچنین هنگامی که تبدیل واقع شد، با زمین پیش از آسمان‌ها آغاز کرد، پس خلق بر پل ایستادند نه در ظلمت. و زمین را به زمینی دیگر تبدیل کرد، نه در صفت؛ زیرا اگر در صفت بود، عین را ذکر نمی‌کرد. و وارثی نیست مگر از مالکی پیشین که آن موروث در ملک او باشد و از او بمیرد، پس وارث آن را به حکم ارث می‌گیرد. و خداوند خبر داده است که **«مِيراثُ السَّماواتِ والْأَرْضِ»** (میراث آسمان‌ها و زمین) از آن اوست. پس آن را جز اسم الوارث (وارث) به ارث نمی‌برد، و غیر از این نخواهد بود. و اگر مالکی برای آن‌ها نبود جز متصرف در آن‌ها، که همان اسماء الهی هستند که تصرف دارند. پس هنگامی که مدت آن‌ها با حکم در آن‌ها، مادامی که بر این صورت و نظم خاص بودند، سپری شد و آن‌ها مدبر آن بودند، چون تدبیرشان زایل شد و حکم خاصشان به دلیل انقضای مدت قبول آن منقضی گشت، این زوال، مرگ نامیده شد و این اعیان، ارث شدند. پس اسم الوارث (وارث) متولی آن‌ها شد. پس حکم آنچه بر آن بودند را زایل کرد و زمین را به زمینی دیگر و آسمان‌ها را [به آسمان‌هایی دیگر] تبدیل نمود، تا زمین و آسمان جز این اسم [الوارث]، موجدی برای خود نشناسند. و اگر عین زمین و آسمان باقی می‌ماند، تقسیم می‌شد و به یاد می‌آورد که پیش از این ملک کدام یک از اسماء بوده است، پس شاید به سوی آن میل می‌کرد. و اسماء الهی غیرت دارند، زیرا مسمای آن‌ها خود را به غیرت وصف کرده است. پس حکم آن‌ها به اسماء تعلق می‌گیرد به دلیل تعلقشان به مسمی. و غیرت از شهود اغیار (دیگران) گرفته شده است. و هر اسم الهی می‌خواهد که حکم از آن او باشد و محكوم عليه تنها به سوی او باشد و به غیر او التفات نکند. پس زمین و آسمان را در عین [وجود] تبدیل کرد، و این زمین و آسمان جز این اسم الوارث (وارث) را به طور خاص نشناختند. پس شرکت در عبادت زایل شد و توحید آشکار گشت. و حکم مال موروث مانند حکم مالک اصلی نیست؛ زیرا حکم وارث، حکم واهب (بخشنده) است و حکم مالک اصلی که از او ارث برده شده، حکم کاسب (به دست آورنده) است. پس ذوق‌ها متفاوت می‌شود و حکم متفاوت می‌شود و تصریف (گرداندن امور) متفاوت می‌شود. پس حال کاسب به اندازه‌ای که بخواهد نازل می‌شود، زیرا او در موطن تکلیف و انتظار سؤال و حساب و مؤاخذه است، پس او حافظ این مراتب ضروری است. و حکم وارث بدون حساب می‌بخشد و بدون مقدار نازل می‌شود، زیرا آخرت مدت آن به پایان نمی‌رسد. پس اشیاء در آن [دنیا] تا **«إِلى‏ أَجَلٍ مُسَمًّى»** (تا مدتی معین) جریان دارند، پس به **«بِقَدَرٍ ما يَشاءُ»** (به اندازه‌ای که بخواهد) به خاطر آن اجل نازل می‌شود. و دنیا برای اموری است که تا اجلی معین جریان دارند و مدتشان منقضی می‌شود، پس مالک آن به مقداری معلوم و مساوی با مدت اجل در آن نازل می‌شود. پس اگر بدون حساب ببخشد، از مدت فراتر می‌رود یا کمتر می‌شود و حکمت باطل می‌گردد. پس حکم وارث، حکم وهاب (بخشنده) است و حکم مالک موروث عنه، حکم مقدر (اندازه‌گیر) و مقیت (روزی‌دهنده) است. آیا به قول او در خلق این زمین اولی گوش نمی‌دهی: **«وقَدَّرَ فِيها أَقْواتَها»** (و در آن روزی‌هایش را مقدر کرد)؟ پس آن را دارای مقدار قرار داد. پس هیچ نفسی نمی‌میرد تا روزی خود را کامل کند. و هنگامی که روزی خود را کامل کرد، حکم رازق از آن [نفس]، از جهت رازق بودن در این مدت خاص، زایل می‌شود. و رزاق باقی می‌ماند و به حکم وارث می‌نگرد که چه به او می‌گوید. پس وارث به او می‌گوید: روزی بده بدون مقدار و بدون انتهای مدت. آیا نمی‌بینی که خداوند به قلم گفت: علم مرا در خلقم تا روز قیامت در لوح بنویس. پس برای آن مدت تعیین کرد، به دلیل انقضای مدت دنیا و پایان یافتن آن. و صحیح نیست که علم او در خلقش در آخرت نوشته شود، زیرا مدت آن به پایان نمی‌رسد. و آنچه پایان نمی‌پذیرد، هستی (الوجود) آن را در بر نمی‌گیرد، و کتابت، وجود است. پس صحیح نیست که آن را محدود کند، زیرا [این کار] انفصال است، و آن پایان دادن به چیزی است که پایان نمی‌پذیرد، و این محال است. پس حکم اسمایی که در دنیا بر اشیاء حکم می‌راندند، باز می‌گردد و در آخرت بر آن‌ها حکم می‌رانند، به حسب آنچه اسم الوارث (وارث) برای آن‌ها ترسیم می‌کند. پس هر کس معرفت (المعرفة) اسماء الهی را به دست آورد، معرفت به خدا را به کامل‌ترین وجوه به دست آورده است. و این منزل دربردارنده علوم بسیاری است، از جمله: علم تنزیه (التنزيه) عالم علوی به آنچه در «أین» (کجا) محصور است، و تنزیه «أین» عالم سفلی و محل آن، نه تنزیه خود آن، و علم ترتیب و منازل و مراتبی که رسیدن به آن‌ها نه با ذوق و نه با حال ممکن نیست. و علم انواع حیات و اقسام مرگ معنوی و حسی، و اینکه چه کسی آن را می‌پذیرد و چه کسی نمی‌پذیرد. و علم اضداد: آیا یک عین آن‌ها را جمع می‌کند، پس اضداد یک عین واحد باشند، یا آن‌ها احکام یک عین واحد هستند که نسب‌ها آن‌ها را طلب می‌کنند؟ و علم حکم زمان در ایجاد الهی: آیا حکم آن در این باره به خاطر ذات خود زمان است، یعنی ذات زمان، یا به واسطه ولایتی است که می‌توان آن را از آن عزل کرد؟ و از اینجا اسم الهی الدهر (روزگار) دانسته می‌شود. و علم اموات (مردگان) که مهلت و عدم مهلت را واجب می‌سازند، پس بر حق (الحق) در اشیاء به حسب ابزار حکم می‌شود؛ اگر ابزار اقتضای تقدیم کند، مقدم می‌شود و اگر اقتضای تأخیر کند، مؤخر می‌شود. و علم ملک به طریق احاطه. و علم نکاحی که از آن توالد حاصل می‌شود، از نکاحی که صرفاً برای شهوت و بدون توالد است. و علم مشاهده حق (الحق) ما را: با چه چیزی ما را شهود می‌کند؟ آیا با ذات خود یا با صفتی که در او قائم است؟ و علم آنچه از غیب برای شهادت ظاهر می‌شود و آنچه ظاهر نمی‌شود. و علم بازگشت شهادت به غیب پس از آنکه شهادت بود، به گونه‌ای که در خیال کسی که شأنش تخیل است، مثالی از آن باقی نماند. و علم نور نازل شده در ظلمت طبیعت: آیا بر صفای خود باقی می‌ماند یا ظلمت طبیعت در آن تأثیر می‌گذارد و مانند سدفه (تاریکی مختلط با نور) می‌شود؟ و علم ایمان به مجموع: آیا ایمان افزایش و کاهش را می‌پذیرد یا نمی‌پذیرد؟ و علم برتری‌جویی (المفاضلة) با اختلاف و کثرت آن. و علم ربای ستوده شده که در معامله شرط می‌شود، و معنای قول پیامبر (ص): **«لم يكن الله لينهاكم عن الربا ويأخذه منكم»** (خداوند شما را از ربا نهی نمی‌کند در حالی که آن را از شما بگیرد). پس بدان که او آن را از ما نمی‌گیرد، بلکه به ما می‌دهد، و شرط کردن آن در معامله حق (الحق) جایز است نه در معامله خلق، در زمانی مخصوص. و علم کسی که راه رفتن به او نسبت داده می‌شود، بدون اینکه به داشتن راه رفتن وصف شده باشد. و علم سخن گفتن کسی که در مرتبه حس، شأنش تکلم نیست. و علم بازگرداندن اعمال بر عاملان. و علم برزخ (البرزخ) که میان رحمت و غضب الهی است، پس برای هیچ موجودی حکمی مستقل در آن نیست. حکم آن برزخ چیست؟ و آیا برای آن عین موجودی در نفس‌الامر هست یا نسبتی است که در حکم دو وجه دارد؟ و علم آنچه دو موجود سنگین (جن و انس) را از برخاستن به سوی آنچه سعادتشان در آن است، بازداشت، پس از آنکه خداوند راه سعادت را بر زبان خبردهندگان از خدا آشکار ساخت. و علم موطنی که بدل در حکم، مقام مبدل‌منه (آنچه بدل شده) را می‌گیرد، از موطنی که آن را نمی‌پذیرد، با وجود اینکه ذاتاً تبدیل را می‌پذیرد. و علم مدت‌ها، و اینکه چرا عدد آن‌ها که بر آن‌ها حکم شده، باز می‌گردد؟ آیا به عین مدت باز می‌گردد، پس عدد را مانند اشخاص در نوع واحد می‌پذیرد، یا مدت‌ها به خاطر ذواتشان متفاوت می‌شوند؟ و علم آنچه از اثر در کسی که تحت حکم مدت است، از کوتاهی و بلندی آن حاصل می‌شود. و علم اختلاف احکام بر اعیان: آیا به دلیل اختلاف استعداد اعیان با اختلاف اوقات، متفاوت می‌شوند، یا به دلیل اختلاف اسماء حاکمه متفاوت می‌شوند؟ و علم مراتب بردگان از آزادگان، و آنچه برای هر یک از این دو صنف از جانب خداست. و علم فرق میان صدیقیت و شهادت. و ابوبکر از کدام مقام به سری دست یافت که با آن بر دیگران برتری یافت؟ و علم مراتب آتش (جهنم)، و اینکه چرا اسماء بر آن متنوع شده‌اند، و برای هر اسم کدام یک از اصنافی است که وارد آن می‌شوند. و علم فرقان (جدایی) میان دو نشئه و دو حیات. و علم سببی که قومی را بازداشت و قومی دیگر را شتاب داد، و فرق میان سرعت و سبقت. و علم موطنی که در آن یک نفر مقام کثیر را می‌گیرد. و علم قضای سابق بر حکم واقع شده با سوره. و علم متصف شدن حق (الحق) به یُسر (آسانی) نه عُسر (سختی)، و اینکه نزد او دشوارتر از آسان‌تر چیست، در حالی که او فاعل هر دو امر است. و علم مقام زدودن بنده از حکم دو صفت متقابل، به طوری که وصفی برای او نباشد، مانند ابویزید. و علم آنچه شهود (الشهود) آن منجر به این می‌شود که شیء، خود را که شأنش متصف شدن به حب است، دوست نداشته باشد. و علم منع الهی برای آنچه باز می‌گردد. و علم منافع و مضار محسوس و معنوی. و علم رسالت و رسولان. و علم اختراع و تدبیر. و علم کسی که از هر چیزی دو زوج دارد. و علم عنایت الهی: آیا حکم آن در فرع مانند حکم آن در اصل است یا خیر؟ پس این حصر (محدودسازی) علومی است که این منزل دربردارد، و در هر علمی، علوم دیگری است. و خداوند **«يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏»** (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 4
}