{
  "id": 292,
  "title": {
    "ar": "الباب الثاني والتسعون ومائتان في معرفة منزل اشتراك عالم الغيب وعالم الشهادة من الحضرة الموسوية",
    "en": "Chapter Two Hundred and Ninety-Two: Concerning the Knowledge of the Station (منزل) of Intersection between the World of the Unseen (عالم الغيب) and the World of Witnessing (عالم الشهادة), derived from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب دو سو بانوے (۲۹۲): موسوی حضور (الحضرة الموسوية) سے عالم الغیب (عالم الغيب) اور عالم الشہادہ (عالم الشهادة) کے اشتراک کی منزل کی معرفت میں۔",
    "fa": "باب دویست و نود و دوم در معرفت منزل اشتراک عالم غیب و عالم شهادت از حضرت موسوی (موسویه)"
  },
  "content": {
    "ar": "## «الباب الثاني والتسعون ومائتان في معرفة منزل اشتراك عالم الغيب وعالم الشهادة من الحضرة الموسوية»\n\n\n> الليل يستر ما في الغيب من عجب *** والشمس تظهر ما الأظلام يستره‏\n\n\n> والشخص إن كان أنثى ليس يذكره *** حتى إذا جاءت الأخرى تذكره‏\n\n\n> والجود أصل وضد الجود ليس بذي *** أصل ولكن عين الجود تظهره‏\n\n\n> لا شي‏ء يغنيك غير الله فارض به *** ربا ولا تك ممن ظل يضمره‏\n\n\n> وقم به علما في رأس رابية *** وإن شهدت هلالا فهو يبدره‏\n\n\n> وإن دعاك الهوى يوما لمنقصة *** فإن داعيه عن ذاك يزجره‏\n\n\n> عطاؤه منه أولى وآخرة *** وليس عن عوض كذاك أذكره‏\n> إن الجزاء وفاق لا على عوض *** فإن يكن عوض فلست أوثره‏\n\n\n### [اختصاص منزل عالم الغيب والشهادة بعلم التجلي الإلهي المشبه بالشمس‏]\n\n\nسلام عليكم ورحمة الله وبركاته اعلموا يا إخواننا أن هذا المنزل من أعظم المنازل قدرا هو منزل النكاح الغيبي وهو نكاح المعاني والأرواح ويختص بهذا المنزل علم التجلي الإلهي المشبه بالشمس ليس دونها سحاب دون التجلي القمري البدري وهوقوله صلى الله عليه وسلم ترون ربكم كما ترون القمر ليلة البدر\n\n\nوليس لهذا التجلي مدخل في هذا المنزل‏\n\n\nوكما ترون الشمس بالظهيرة ليس دونها سحاب‏\n\n\nوهذا المنزل منزله ومن هنا يعرف وهو مظهر إلهي عجيب ومن هذا المنزل يعرف الجود المقيد بالخوف والجزاء ومرتبة الصدق وإن قبح ومرتبة الكذب وإن حسن والغني المكتسب وهو الغني العرضي وعلامات السعادة وعلامات الشقاء وخيبة المعتمد على الأمور التي قد نصبها الله للاعتماد عليها ولما ذا يخيب صاحبها مع كون الحق نصبها لهذا وأهلها لها وعلم الإفصاح عن درجات التقريب الإلهي من حضرة اللسن ومعرفة المقام الذي تتألف فيه الضرتان وتتحابان ومعرفة الاصطلام اللازم وصفة من أعطى مقام هذا الاصطلام من المقربين من أمثالهم ممن لم يعطه والجود بما يجده العارف من كل شي‏ء مما لا يجب عليه وهو خلق الجود الإلهي وهل يكون الحق عوضا ينال بعمل خاص أم لا ولنبين إن شاء الله حقائق هذا المنزل فصلا فصلا إيماء وتلويحا فإنه يطول والله المؤيد لا رب غيره فمن ذلك النكاح الغيبي المنتج قال تعالى وأَرْسَلْنَا الرِّياحَ لَواقِحَ وقال تعالى وأَنْزَلَ من السَّماءِ ماءً فَأَخْرَجَ به من الثَّمَراتِ وقال جَعَلَ لَكُمُ الْأَرْضَ فِراشاً والسَّماءَ بِناءً وقد تقدم الكلام على هذا الفصل في فصل المعارف من هذا الكتاب في باب الآباء العلويات والأمهات السفليات فلينظر هنالك ولنذكر في هذا المنزل ما يتعلق به وهو أن المعاني تنكح الأجسام نكاحا غيبيا معنويا فيتولد بينهما أحكامهما وذلك حجاب على اليد الإلهية الغيبية التي ما من شأنها أن تدرك ومن ذلك جميع الصور الظاهرة في الهباء الهباء لها كالمرأة والصور لها كالبعل ولا يوجد عنهما إلا أعيانهما وهذا من أعجب الأسرار أن يكون الولد عين الأب والأم لمن هو لهما ولد والأب والأم عين الولد لمن هما له أبوان وهو الذي أشار إليه الحلاج رحمه الله في قوله ولدت أمي أباها ولا يكون الوالد عين الولد لمن هو له والد وهو له ولد إلا في هذا النكاح ومن هذا الباب قوله كُنْ وهي كلمة أمر التكوين وقال في عيسى إنه كلمة الله وفي الموجودات إنها كلمات الله وما له كلمة في الموجودات إلا كن وهي عين الموجود فإنه الكلمة وتوجهها على العيون الثابتة فالأعين لها كالأم فظهرت الكلمات وهو وجود تلك الأعيان عن هذا النكاح الغيبي وكان الولد بينهما عينهما ليس غيرهما وهذا ألطف من الأمر الأول فإن الولد هنا عين كلمة الحضرة فكن عين المكون وهو منسوب إلى الله والأول في الدرجة الثانية فإنه منسوب إلى الهباء والصورة وهذا النكاح مدرج فيه فافهم فقد رميت بك على الطريق فالجسمانيات كلها أولاد عن نكاح غيبي والأجسام كلها منها ما هو عن نكاح غيبي ومنها ما هو عن نكاح غيبي مدرج في نكاح حسي كنكاح الرياح والمياه والحيوانات والنبات والمعادن وما يتولد في الأجسام العنصرية لا الأجسام الطبيعية فإن العالم الملكي لا يتولد عنه من جنسه شي‏ء إلا أن يكون أبا في وقت لأم عنصرية بما يلقى إليها فما ينتج فذلك الولد بينهما قد يخلق ملكا وهو المعبر عنه بلمة الملك وهو ما يلقيه إلى النفس الإنسانية فيتولد بينهما تسبيحة أو تهليلة تخرج نفسا من المسبح والمهلل فينفتح في عين ذلك النفس وجوهره صورة ملكية يكون ذلك الملك الملقي أباها والنفس أمها فترتقي تلك الصورة إلى أبيها وتلازمه بالاستغفار لأمه التي هي النفس الإنسانية إلى يوم القيامة ومن هنا يحكم في الشريعة للوالد بأخذ ولده عن أمه إذا ميز وعقل بلا خلاف فإن هذا الملك يخلق عاقلا ومن أعجب الأنكحة الإعدام ولهذا اختلف فيه أهل الكشف فالله سبحانه علقه بالمشيئة فقال إِنْ يَشَأْ يُذْهِبْكُمْ وعلق الاقتدار بإيجاد قوم آخرين فقال ويَأْتِ بِآخَرِينَ وكان الله على ذلك ولم يقل ذينك على التثنية فكانت الإشارة من حيث أحديتها للأقرب وهو الذي أتى به ومن هذا الباب إرسال الريح العقيم فإنها لإزالة أعيان الصور الظاهرة عن التأليف لا أعيان الجواهر فما أنتجت وجودا فنسب إليها العقم ونفي عنها أن تكون لاقحة فهذا نكاح لمجرد الشهوة لا لوجود الولد كنكاح أهل الجنة فما يكون عن كل شهوة كيان ولا بد وجود عيني لنفسه‏\nومن هنا وقع الخلاف بين أهل الكشف فمن كشف رجوع أعيان الصور التي كانت موجودة إلى كونها ثابتة غير موجودة قال بأن الريح العقيم قد أنتجت في حضرة الثبوت ما كان قد خرج عنها وهو مشهود للحق وبه تعلقت المشيئة بقوله إِنْ يَشَأْ يُذْهِبْكُمْ أي يردكم إلى الحالة التي كنتم موصوفين فيها بالعدم وإنما كان هذا عقما لأنه لم يظهر عنه وجود العين لنفسه وإن كان ظاهرا مشهودا لخالقه ومن لم يشهد رجوع أعيان الصور الموجودة إلى العدم عند توجه المشيئة أو هبوب الريح العقيم قال إن ذلك لا ينتج شيئا فإن الإيجاد للاقتدار لا للمشيئة فقط وللريح اللاقحة لا للعقيم إذ لو ظهر شي‏ء وجودي عنها لم تكن عقيما فهذا سبب الخلاف بين أهل الكشف فمتعلق النافي عين الوجود ومتعلق المثبت عين الثبوت فما تواردا على شي‏ء واحد فلا خلاف في الحقيقة إذ كان هذا الطريق عند المحققين منا لا يتصور فيه خلاف إلا أن يكون مثل هذا وهذا خلاف لفظي فإذا فسر كل واحد ما أراده بذلك اللفظ ارتفع الخلاف ويكفي ما أومأنا إليه‏\n\n\n### [اختلاف المظهرين باختلاف المنازل‏]\n\n\nومن هذا المنزل التجلي الشمسي لما وقع التشبه عند علماء الرسوم في رفع الشك عن الرائي في المرئي بالشمس والقمر ليلة البدر وهو من بعض الوجوه المقصودة في هذا الحديث ولكن عرف المحققون زائدا على هذا أن المظهرين مختلفان وأن التجلي المشبه بالقمر ليلة البدر مظهر خاص لأنه قال ليلة البدر ولم يقل في إبداره فأضافه إلى الليلة فإني أشاهده بدرا مع وجود الشمس بالنهار فما أضافه إلى الليلة إلا لأمر عرفه المحققون وليس هذا منزل الكلام عليه ولكن هذا المنزل يتضمن منزل التجلي في الشمس فإن الحق يتعالى عند المحققين أن يتجلى في صورة واحدة مرتين أو لشخصين فلا تكرار في أمر عند الحق للإطلاق الذي هو عليه والاتساع الإلهي والتكرار مؤد إلى الضيق والتقييد فاعلم إن التجلي الشمسي أي المشبه بالشمس هو يسمى عندنا التجلي الأوسع وهو التجلي الذي لا يفنى الإنسان عن رؤية نفسه فيه وقد أومأنا إليه في أول هذا الكتاب في باب الأرض التي خلقت من بقية الطينة الآدمية وهذا التجلي مظهر ذاتي عجيب ونسب التجلي فيه إلى معلوله لا إلى علته مع ظهور العلة في معلولها عينا محققة مجهولة الكيفية كظهور الشمس في النهار مع كون النهار معلولا عن ظهور الشمس ونور السراج عن السراج المنبسط في زوايا الكون فمثل هذا يسمى شهود العلة ومعلولها معا فكل تجل لا يغنيك عنك فهو بهذه المثابة وإنما سمي أوسع لأن المشاهد يعم رؤيته المتجلي والمتجلي فيه وله وغير الأوسع لا تشاهد غيره لا نفسك ولا غيرك ولا تعلم شهودك ولا ما أنت فيه حتى تعود إليك ويقع الحجاب فلو قرع الحجاب كان ذلك التجلي مقيدا ضيقا إذ قيده الحجاب والأوسع يظهر في الحجاب وفي غير الحجاب ويفرق الشاهد بين الصورتين ولهذا يقال فيهم ردوهم إلى قصورهم للاشارة إلى عجزهم أي يحبسون فيه وهنا بحور تحوي على أنواع من نفيس الجواهر لا يدركها إلا كل غواص واسع النفس عاشق في الغيب فقد بينت لك المقصود من هذا التجلي الذي يحويه هذا المنزل وفوائده لا تحصى لو ذهبنا نذكرها ما وسعها ديوان فإن له التأبيد في العالم العلوي في الدنيا وله التأبيد في العالم الأخروي السفلي وما ثم تجل يجمع فيما يكون عنه بين الضدين من ألم ولذة إلا هذا التجلي وهو كتجلي المحبوب للمحب يعانق غيره ويقبله فهو من نظره في لذة ومن نظره في ألم ومن هذا المنزل معرفة الجود المقيد بالخوف والجزاء ومرتبة الصدق وإن قبح ومرتبة الكذب وإن حسن والغني المكتسب وهو الغني العرضي وعلامات السعادة وعلامات الشقاء\n\n\n### [اختلاف سبب العطاء]\n\n\nواعلم أن أسباب العطاء تختلف فمنهم من يعطي للعوض ويسمى شراء وبيعا ففيه من الجود إن المشتري قد أنعمت عليه من كونك بائعا ماله غرض عظيم في تحصيله وقد أعطاك هو ما هو مستغن عنه فكل واحد منهما قد جاد على صاحبه بإيصاله إليه ما كان له غرض في تحصيله إذ كان له منع ذلك فبهذا القدر يلحق بباب الجود من جهة المعطي له اسم مفعول لا من جهة المعطي اسم فاعل وقد يعطي الإنسان من هذا الباب خوفا على عرضه أو حلول آلام حسية تحل به فكأنه يشتري الثناء الحسن والعافية والأمن بذلك العطاء فهو كالأول والفرق بينهما إن الذي اشترى به في الأول هو مما يمكن أن يكون له فيه غرض وهذا لا يمكن أن يكون له في الألم وإزالة العافية والأمن غرض أصلا ومن يقول بخلاف هذا من أصحابنا إن كان محققا كأبي يزيد في قوله‏\n\n\n> وكل مآربي قد نلت منها *** سوى ملذوذ وجدي بالعذاب‏\nفقد أبان عن مقصوده وهو اللذة وهو ما قلناه وذهبنا إليه وإن لم يكن محققا فما هو من أصل طريقنا بالمعنى وإن ظهر بالصورة فلا كلام لنا معه ومنهم من يعطي للانعام وغير ذلك وليس من هذا المنزل إلا ما ذكرناه خاصة ومن هذا الباب‏\n\n\nقول رسول الله صلى الله عليه وسلم أحبوا الله لما يغذوكم به من نعمه‏\n\n\nفأمرنا بمحبته لإنعامه وإحسانه وهل يكون منه سبحانه في حق العباد أمر وجودي يخرج عن الإنعام بوجه من الوجوه اختلف أصحابنا في ذلك فمنهم من رأى أن الإنعام فيه عين وجوده ولا يلتفت إلى الأغراض المتعلقة مما يعطيه حكم هذا الموجود المنعم عليه بالوجود فإنه قد أنعم على الألم بوجود عينه وإن كان من يتألم به لا يوافق غرضه فهو نعمة الله على نفسه ولو توقف الأمر على عموم النعمة على الكل بالعين الواحدة ما كان شي‏ء أصلا فإن الحقائق تأبى ذلك فإذا له في كل وجود نعمة فمن كان مقامه الإيثار يصدق في غرضه بزهده إذا قام به حكم الألم أن يشكر الله على ما أنعم به على الألم من وجود عينه بعد أن لم يكن إيثار الجناب الله على غرضه حيث ظهر في الملك من يساعده على تعظيم الله وشكره لأنه يشاهد شكر الألم لله تعالى على إيجاد عينه فأعظم شفيع يكون لمن هذه حاله عند الله الألم من الموجودات والاسم المبلى والمسقم من الإلهيات فيكون نتيجة تلك الشفاعة وجود اللذة ورحلة الألم إما بزوال السبب أو ببقائه فيكون خرق عادة وهذا من أعظم الخلق الذي يشرف به الإنسان وأما إيثاره في هذا لإرادة الله فلا يدري أحد ما يحصل له من اسمه المريد من الخير إلا الله الذي خصه بهذه الحال الشريفة فهذا هو الصدق مع الله في المعاملة وإن قبح فإنه لو نزل ذلك الألم بغيره فلا بد أن تصحبه هذه الحالة وقبيح عليه في حق الغير أن يراه يشكر الله على ما قام بذلك الغير من الألم ولا سيما إن كان محبوبا له أو نبيا أو رسولا وبما ينتجه هذا المقام من وجود العافية في ذلك الغير ستر القبح الذي كان لبسه هذا المحقق وأما من ترك العطاء في مثل هذا الموطن الذي ذكرناه فأنت تعرف مما بيناه لك ما سبب ذلك الترك وما المشهود لهذا التارك في وقت الترك فإنه يندرج علم ذلك كله فيما قررناه فابحث عنه فإنه يطول إن أوردناه وقد أعطيناك المفتاح وعينا لك قفله فافتح ما شئته من ذلك وأما الغني المكتسب في هذا الباب فهو حكمه فإن الإنسان إذا استغنى عن الغير كان دليلا على جهله بالحقائق إذ كان الغير لا أثر له فيه فقد علق غناه بغير متعلق وإن استغنى عن الله تعالى فأجهل وأجهل فإنه خرج بهذا الوصف عن العلم المحقق وعن الإسلام فلا أخسر منه لأنه لا أجهل منه فالاستغناء لا يصح حقيقة فإذا أضيف الغني إلى أحد فهي إضافة عرضية لا ذاتية ولهذا هو الاسم الغني للحق تعالى وصف سلبي سلب عنه الافتقار إلى العالم ومن افتقر إلى شي‏ء لم يستغن عنه البتة فالاستغناء على الحقيقة إنما هو بالأسباب من حيث النسب أي من حيث إنها نسب فكل نسبة أذهبت عنك ضدها فهي الحاكمة عليك وهل تسمى بغني أم لا فلك النظر فيها بحسب ما تعطيك حقيقة تلك النسبة فإن كانت أغنتك عن غيرها فهي غنى وأنت غني بها وإن لم تغنك فما هي غنى ولا أنت غني بها فالشبع مثلا بمجرد حقيقته لا يقال فيه إنك قد استغنيت به عن الجوع من حيث حقيقة الجوع لأن الجوع ليس مطلوبا لك حتى تستغني بالشبع عنه ولكن إن كان الجوع إذا قام بك أعطاك من الصفاء والرقة واللطافة والتحقق بالعبودة والافتقار ما يعطيه حقيقته فأنت طالب له غير مستغن عنه فإن أعطاك الشبع ما أعطاك الجوع من كل ما ذكرناه فقد استغنيت بالشبع عن الجوع إذ الجوع ليس مطلوبا لنفسه وإنما هو مطلوب لما ذكرناه فإذا وجدنا ذلك في ضده فلا حاجة لنا به إذ الطبع يرده كما إن الطبع يوجده ولذلك‏\n\n\nكان رسول الله صلى الله عليه وسلم يتعوذ من الجوع ويقول إنه بئس الضجيع‏\n\n\nوذلك لأنه أيضا وإن أعطى ما ذكرناه ولكن لا يقطع أن يكون افتقاره ذلك إلى الله بل قد يكون لغير الله فلذا قال رسول الله صلى الله عليه وسلم فيه إنه بئس الضجيع في العموم فإن شيوخ الطريق يقولون لو بيع الجوع في السوق لزم المريد أن يشتريه ومن نظر منهم إلى ما نظره النبي صلى الله عليه وسلم جعله من أغاليط أهل الطريق كأبي عبد الرحمن السلمي إذ عمل أوراقا فيما غلطت فيه الصوفية وهو مذهبنا وللجوع حد ومقدار وهو الجوع المحقق بخلاف الجوع المتخيل فما وقعت الاستعاذة النبوية إلا من الجوع المحقق فإنه يكون به الإنسان عاصيا للشرع ظالما لنفسه إذا كان اختيارا ولهذا كان رسول الله صلى الله عليه وسلم لا يجوع قط إلا اضطرارا وهو حال العلماء بالله لأنهم من صفتهم العدل‏\nوقد أبنت لك ما فيه كفاية فإنه تلويح يغني عن التصريح‏\n\n\n### [علامة عمل السعادة أن يستعمل الإنسان في الحضور مع الله‏]\n\n\nوأما أعمال السعادة فعلاماتها أن يستعمل الإنسان في الحضور مع الله في جميع حركاته وممكناته وأن تكون مشاهدة نسبة الأفعال إلى الله تعالى من حيث الإيجاد والارتباط المحمود منها وأما الارتباط المذموم منها فإن نسبه إلى الله فقد أساء الأدب وجهل علم التكليف وبمن تعلق ومن المكلف الذي قيل له افعل إذ لو لم يكن للمكلف نسبة إلى الفعل بوجه ما لما قيل له افعل وكانت الشريعة كلها عبثا وهي حق في نفسها فلا بد أن يكون للعبد نسبة صحيحة إلى الفعل من تلك النسبة قيل له افعل وليس متعلقها الإرادة كالقائلين بالكسب وإنما هو سبب اقتداري لطيف مدرج في الاقتدار الإلهي الذي يعطيه الذليل كاندراج نور الكواكب في نور الشمس فتعلم بالدليل أن للكواكب نورا منبسطا على الأرض لكن ما ندركه حسا لسلطان نور الشمس كما يعطي الحس في أفعال العباد إن الفعل لهم حسا وشرعا وأن الاقتدار الإلهي مندرج فيه يدركه العقل ولا يدركه الحس كاندراج نور الشمس في نور الكواكب فإن نور الكواكب هو عين نور الشمس والكواكب لها مجلى فالنور كله الشمس والحس يجعل النور للكواكب فيقول قد اندرج نور الكواكب في نور الشمس وعلى الحقيقة ما ثم إلا نور الشمس فاندرج نوره في نفسه إذ لم يكن ثم نور غيره والمرائي وإن كان لها أثر فليس ذلك من نورها وإنما النور يكون له أثر من كونه بلا واسطة في الكون ويكون له أثر آخر في مرآة تجليه بحكم يخالف حكمه من غير تلك الواسطة فنور الشمس إذا تجلى في البدر يعطي من الحكم ما لا يعطيه من الحكم بغير البدر لا شك في ذلك كذلك الاقتدار الإلهي إذا تجلى في العبيد فظهرت الأفعال عن الخلق فهو وإن كان بالاقتدار الإلهي ولكن يختلف الحكم لأنه بوساطة هذا المجلى الذي كان مثل المرآة لتجليه وكما ينسب النور الشمسي إلى البدر في الحس والفعل لنور البدر وهو للشمس فكذلك ينسب الفعل للخلق في الحس والفعل إنما هو لله في نفس الأمر ولاختلاف الأثر تغير الحكم النوري في الأشياء فكان ما يعطيه النور بوساطة البدر خلاف ما يعطيه بنفسه بلا واسطة كذلك يختلف الحكم في أفعال العباد ومن هنا يعرف التكليف على من توجه وبمن تعلق وكما تعلم عقلا إن القمر في نفسه ليس فيه من نور الشمس شي‏ء وأن الشمس ما انتقلت إليه بذاتها وإنما كان لها مجلى وأن الصفة لا تفارق موصوفها والاسم مسماه كذلك العبد ليس فيه من خالقه شي‏ء ولا حل فيه وإنما هو مجلى له خاصة ومظهر له وكما ينسب نور الشمس إلى البدر كذلك ينسب الاقتدار إلى الخلق حسا والحال الحال وإذا كان الأمر بين الشمس والبدر بهذه المثابة مع الخفاء وإنه لا يعلم ذلك كل أحد فما ظنك بالأمر الإلهي في هذه المسألة مع الخلق أخفى وأخفى فمن وقف على هذا العلم فهو من أعلى علامات السعادة وفقد مثل هذا من علامات الشقاء وأريد بهذا سعادة الأرواح وشقاوتها المعنوية وإنما السعادة الحسية والشقاوة فعلاماتهما الأعمال المشروعة بشروطها وهو الإخلاص قال تعالى أَلا لِلَّهِ الدِّينُ الْخالِصُ وقال وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ ويكفي هذا القدر من العلامات مجملا والله الموفق لا رب غيره‏\n\n\n### [أما خيبة المعتمد على الأمور التي نصبها الله للاعتماد عليها]\n\n\nوأما خيبة المعتمد على الأمور التي نصبها الله للاعتماد عليها ولما ذا يخيب صاحبها مع كون الحق نصبها لهذا الأمر وأهلها له فاعلم أيها الأخ الولي أن الأمور التي نصبها الحق للاعتماد عليها ما خرجت عنه ولكن جعلها هذا الخائب أربابا من دون الله فاعتمد عليها لذواتها لا على من جعلها فاضربه الجهل كما ذكرناه آنفا فالآثار الظاهرة عن نور الشمس في مرآة البدر إذا نظر فيه الناظر واعتمد على الشمس في ذلك من حيث هذا المجلى الخاص الذي ربط الله الأثر به فهذا لا يخيب فاته أعطى الأمر حقه وهذا لا ينكسف البدر في حقه أبدا والذي يخيب هو الذي ينكسف البدر في حقه فيبقى في ظلمة جهله مع وجود ذات المرآة القمرية فيكون هذا الخائب مع ذلك المظهر في الظلمات فإن القمر قد حجب في حق هذا الشخص الذي كان يعتمد عليه إِنَّكُمْ وما تَعْبُدُونَ من دُونِ الله حَصَبُ جَهَنَّمَ وهي الظلمة فإن الظلمة جهنم وأية ظلمة وأي جهنم أعظم من الجهل وبها شبه الله في قوله أَوْ كَظُلُماتٍ فقال ظُلُماتٌ بَعْضُها فَوْقَ بَعْضٍ وهو جهل على جهل وهو من جهل ولا يعلم أنه جهل فنفى عنه إن يقارب رؤية يده فكيف إن يراها وأدخل اليد هنا دون غيرها لأنها محل وجود الاقتدار وبها يقع الإيجاد أي إذا أخرج اقتداره ليراه لم يقارب رؤيته لظلمة الجهل لأنه لو رآه لرآه عين الاقتدار الإلهي أ لا تراه إذا أخرجه في‏\nالنور الذي هو العلم رأى يده وهو اقتداره فعلم إن الاقتدار الكوني هو اقتدار الحق لارتفاع الظلمات المتراكمة التي كانت بعضها فوق بعض ولهذا وقع التشبيه بأشد الظلمات فإن ظلمة الجو تقترن معها ظلمة البحر تقترن معها ظلمة الموج تقترن معها ظلمة تراكم الموج تقترن معها ظلمة السحاب التي تحجب أنوار الكواكب فلا يبقى للنور ظهور لا في عينه ولا في مجلى من مجاليه فظلمة الليل ظلمة الطبع وظلمة البحر ظلمة الجهل وهو فقد العلم وظلمة الفكر ظلمة الموج وظلمة الموج المتراكم ظلمة تداخل الأفكار في الشبه وظلمة السحاب ظلمة الكفر فمن جمع هذه الظلمات فقد خسر خسرانا مبينا وهذه حالة المعطلة لا غيرهم‏\n\n\n### [علم الإفصاح عن درجات القرب الإلهي من حضرة اللسن‏]\n\n\nوأما ما يتضمنه هذا المنزل من علم الإفصاح عن درجات القرب الإلهي من حضرة اللسن فاعلم أن ذلك معرفة علم الشارع المترجم عن الله الذي أمرنا بالإيمان بمحكمه ومتشابهه ولنقبل جميع ما جاء به فإن ناولنا شيئا من ذلك على أنه مراد المتكلم به في نفس الأمر زال عنا درجة الايمان فإن الدليل حكم على الخير فيعطل حكم الايمان وجاء العلم الصحيح من المؤمن يقول لصاحب هذا الدليل أما القطع منك بأن هذا الذي أعطاك نظرك هو مقصود المفصح بما أفصح به فهو عين الجهل وفقد العلم الصحيح وإن صادف العلم وقد زال عنك الايمان والسعادة مرتبطة بالإيمان وبالعلم الصحيح عن علم والعلم الصحيح هو الذي يبقى معه الايمان فعلى العارف أن يبين طريق السعادة نيابة عن الله تعالى في خلقه كنيابة القمر عن الشمس في إيصال النور فالأنبياء المرسلون عليهم السلام هم التراجمة عن الحق والورثة على درجتهم بما يعطيهم الله من الفهم فيما جاءت به الرسل من كتاب وسنة فهذا هو علم الإفصاح مختصر\n\n\n### [اجتماع الضدان في العلم الإلهي سبب تألفت الضرتان‏]\n\n\nوأما علم تألف الضرتين فاعلم إن أبا سعيد الخراز قيل له بم عرفت الله فقال بجمعه بين الضدين وتلا هُوَ الْأَوَّلُ والْآخِرُ أي هو أول من عين ما هو آخر وظاهر من حيث ما هو باطن لأن الحيثية في حقه واحدة وكل ضدين ضرتان وهذا لا يدرك من قوة العقل فإن قوة العقل لا تعطيه وإنما يدرك هذا من المقام الذي وراء طور العقل الذي كان من ذلك الطور أعطى الواجبات وجوبها والجايزات جوازها والمستحيلات إحالتها والأحديات أحديتها فهو الذي جعل الواحد واحدا كما جعل الواجب واجبا بإعطائه الوجوب وليس في قوة العقل إدراك ما ذكرناه من حيث فكره فهذا علم صحيح إلهي لا عقلي فإذا اجتمع الضدان في العلم الإلهي فقد تألفت الضرتان وتحابا إذ كانا لعين واحدة فتدبر هذا الفصل بنور الايمان لا بنور العقل فإنه مردود عقلا غير مقبول وكما لم يكن في قوة البصر أن يدرك المعقولات ولم يتعد حده كذلك العقل ليس في قوته إن يدرك ما يعطيه البصر بذاته من غير واسطة البصر فإذا عجزت قوة العقل أن تستقل بعلم المبصرات من حيث ما هي مبصرات وهي مخلوقة وقوة البصر مخلوقة فمن له بإدراك ما يخرج عن طوره إلى ما هو أعلى في نسبته إلى الحق وقد عجز عن إدراك ما خرج عن طوره إلى ما هو أنزل درجة وهو الحس في زعمه ومن افتقر إلى مخلوق مثله في أمر فهو إلى الخالق أفقر ويكفي هذه الإشارة فيما يعرفه العارفون من ذلك‏\n\n\n### [الاصطلام نار ترد على قلوب المحبين تحرق كل شي‏ء تجده ما سوى المحبوب‏]\n\n\nوأما معرفة الاصطلام اللازم وصفة من أعطى مقام هذا الاصطلام من المقربين من أمثالهم ممن لم يعطه فاعلم أن الاصطلام نار ترد على قلوب المحبين تحرق كل شي‏ء تجده ما سوى المحبوب وقد تذهب في أوقات بصورة المحبوب من نفس المحب وهو الوقت الذي يطلب المحب أن يتخيل محبوبه فلا يقدر على تخيله ولا يقيم صورته لقوة سلطان حرقة لهيب نار الحب فيقال فيه في ذلك الحال مصطلم وهو الذي أراد القائل بقوله‏\n\n\n> أودع فؤادي حرقا أودع *** ذاتك توذى أنت في أضلعي‏\n\n\n> وارم سهام الحب أو كفها *** أنت بما ترمي مصاب معي‏\n\n\n> موقعها القلب وأنت الذي *** مسكنه بذاك الموضع‏\n\n\nومن هذه الحال قال قيس بن الملوح مجنون بنى عامر صاحب ليلى وكان قد جاءته ليلى وهو مصطلم يأخذ الجليد ويلقيه على صدره فيذيبه من ساعته حرارة الفؤاد وهو يصيح ليلى ليلى طلبا لها لفقد صورتها من خياله فنادته يا قيس أنا مطلوبك أنا ليلى فلم يكن لها في نفسه صورة متخيلة يعرفها بها إلا أنه لما سمع منها اسمها قال لها إليك عني فإن حبك‏\nشغلني عنك فهذا حال الاصطلام وهو نعت لازم للحضرة الإلهية مؤثر ولكل اسم إلهي مشهود فيه جمال الحق يحول بين العبد وبين تكييف الحق ويذهب بكل صورة يضبطها أو يتخيلها ولهذا\n\n\nقال صلى الله عليه وسلم ألظوا بيا ذا الجلال والإكرام‏\n\n\nمن الإلظاظ وهو المثابرة وقرن الجلال بالإكرام وما ورد الجلال قط في النبويات إلا والإكرام مصاحب له ليبقى رسم العبد ولا يذهب بعينه فالجلال الذي هو جلال الجمال يكسوك الهيبة فتهاب المقام وهو الذي يجده المحب والعارف في نفسه من تعظيم المحبوب فيؤثر جنابه على كل شي‏ء فإكرام الله به أنه يؤثره على كل شي‏ء وثم اصطلام يزول في الوقت وهو ما يرد على القلب من مشاهدة المحبوب في صورة الخيال فما دام هذا الخيال دام اصطلامه والجلال يمحو هذه الصورة من النفس غيرة من تقييده بصورة وله الإطلاق فيزول اصطلام تلك الصورة المقيدة بزوالها ويبقى الاصطلام اللازم الذي هو أثر الجلال في النفس فيرى المحب يكذب الصورة المتخيلة في نفسه التي تقول له أنا محبوبك ويعرض عنها إجلالا لمحبوبه أن يقيده لمعرفته بأن محبوبه لا يتقيد فلهذا يحترق في نفسه حيث يريد أو يتمنى أن يضبط ما لا ينضبط لينعم به ولهذا كان العلم أشرف من المحبة وبه أمر الله تعالى نبيه صلى الله عليه وسلم أن يسأله الزيادة منه لأنه عين الولاية الإلهية به يتولى الله عباده وبه يكرمهم وبه يعرفون أنه لا يعرف وأما المحب إذا لم يكن عارفا فهو يخلق في نفسه صورة يهيم فيها ويعشقها فما عبد ولا اشتاق إلا لمن هو تحت حيطته ولا يزيله عن هذا المقام إلا المعرفة فحيرة العارف في الجناب الإلهي أعظم الحيرات لأنه خارج عن الحصر والتقييد\n\n\n> تفرقت الظباء على خداش *** فما يدري خداش ما يصيد\n\n\nفله جميع الصور وما له صورة تقيده ولهذا\n\n\nكان يقول صلى الله عليه وسلم اللهم زدني فيك تحيرا\n\n\nلأنه المقام الأعلى والمنظر الأجلى والمكانة الزلفى والمظهر الأزهى والطريقة المثلى ومن هذه الحضرة صدر الإنذار فعدم القرار وحل البوار بساحة الكفار فلم يبق ستر ولا حجاب إلا مزقه وخرقه هذا المشهد الأسنى فإن الستر يقيد المستور والحجاب يحد المحجوب ولا حد لذاته ولا تقييد لجلاله فكيف يستره شي‏ء أو تغيب له عين تَجْرِي بِأَعْيُنِنا جَزاءً لِمَنْ كانَ كُفِرَ فمن قال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فقد صدق لأنه ما ثم موجود لا يغيب له عين ولا يحصره أين إلا الله فجميع الصور الحسية والمعنوية مظاهره فهو الناطق من كل صورة لا في كل صورة وهو المنظور بكل عين وهو المسموع بكل سمع وهو الذي لم يسمع له كلام فيعقل ولا نظر إليه بصر فيحد ولا كان له مظهر فيتقيد فالهو له لازم لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ يَمْحُوا وهو عين ما يمحو قال ويُثْبِتُ وهو عين ما يثبت ف لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ في هذا الحكم وبه شهد له العلم الصحيح الموهوب فعلم الدليل ينفيه إذ لم يكن بيده منه ولا له تعلق بسوى صفات السلب والتنزيه وعلم الكشف يثبته ويبقيه ولا يبدو له مظهرا لا ويراه فيه والعلمان صحيحان فهو لكل قوة مدركة بحسبها ليعرفها أنها ما زالت عن منصبها وأنها لم تحصل بيدها من العلم بالله إلا ما هي عليه في نفسها فذاتها عرفت ونفسها وصفت فخرج عن التقييد والحدود بظهوره فيها ليكون هو المعبود فقد قضى أن لا يعبد إلا إياه فكانت الأصنام والأوثان مظاهر له في زعم الكفار فأطلقوا عليها اسم الإله فما عبدوا إلا الإله وهو الذي دل عليه ذلك المظهر فقضى حوائجهم وسقاهم وعاقبهم إذ لم يحترموا ذلك الجناب الإلهي في هذه الصورة الجمادية فهم الأشقياء وإن أصابوا أو لم يعبدوا إلا الله فانظر إلى هذا السريان الوجودي في هذه المظاهر كيف سعد به قوم وشقي به آخرون قال بعضهم كل ما تخيلته في نفسك أو صوره وهمك فالله بخلاف ذلك فصدق وكذب وأظهر وحجب وقال الآخر لا يكون الحق مدلولا لدليل ولا معقولا للعقول لا تحصله العقول بأفكارها ولا تستنزله المعارف بأذكارها فإذا ذكر فبه يذكر وبه يفكر ويعقل فهو عقل العقلاء وفكرة المفكرين وذكر الذاكرين ودليل الدالين لو خرج عن شي‏ء لم يكن ولو كان في شي‏ء لم يكن فهذا قد أبنت لك ما أثره الاصطلام اللازم وأن العلماء هم المقربون الذين أدركوا هذا المشهد الأحمى وهذه المعرفة العظمى ومن سواهم فقد نصب له علامة يعبدها وحقيقة يشهدها وهي ما انطوى عليه اعتقاده لدليل قام عنده أو قلد صاحب دليل فهو عند نفسه قد ظفر بمطلوبه واعتكف على معبوده وسكن إليه واستراح من الحيرة وكفر بما ناقض ما عنده وكفر بلا شك غيره ممن اعتقد غير معتقده فلهذا يكفر\nبعضهم ببعض ويلعن بعضهم بعضا دنيا وآخرة والعالم المحقق لما هو الأمر في عينه يتفرج في ذاته وفي العالم ظاهره وباطنه فهو العين المصيبة وهو المثل المنزه المنصوص عليه الذي نفى الحق أن يماثل أو يقابل بقوله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ أي ليس مثل مثله شي‏ء فالكاف كاف الصفة ما هي زائدة كما يرى بعضهم فبعض العلماء يرى في ذلك أن لو فرض له مثل لم يماثل ذلك المثل فأحرى إن يماثل هو في نفسه وعند بعضهم نفي المثل عن المثل المحقق الذي ذكرناه سئل الجنيد عن المعرفة والعارف فقال لون الماء لون إنائه فأثبت الماء والإناء فأثبت الحرف والمعنى والإدراك ونفى الإدراك ففرق وجمع فنعم ما قال وبعد أن أبنت لك عن مرتبة الاصطلام اللازم فلنبين لك ما بقي من هذا المنزل وهو العلم بالجود الإلهي الخارج عن الوجوب وهل يكون الحق عوضا ينال بعمل خاص أم لا\n\n\n### [إن لله جودا مقيدا وجودا]\n\n\nفاعلم إن لله جودا مقيدا وجودا مطلقا فإنه سبحانه قد قيد بعض جوده بالوجود فقال كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ أي أوجب وفرض على نفسه الرحمة لقوم خواص نعتهم بعمل خاص وهو أنه من عَمِلَ مِنْكُمْ سُوءاً بِجَهالَةٍ ثُمَّ تابَ من بَعْدِهِ وأَصْلَحَ فَأَنَّهُ غَفُورٌ رَحِيمٌ فهذا جود مقيد بالوجوب لمن هذه صفته وهو عوض عن هذا العمل الخاص والتوبة والإصلاح من الجود المطلق فجلب جوده بجوده فما حكم عليه سواه ولا قيده غيره والعبد بين الجودين عرض زائل وعرض ماثل قال سهل بن عبد الله عالمنا وامامنا لقيت إبليس فعرفته وعرف مني أني عرفته فوقعت بيننا مناظرة فقال لي وقلت له وعلا بيننا الكلام وطال النزاع بحيث إن وقفت ووقف وحرت وحار فكان من آخر ما قال لي يا سهل الله عز وجل يقول ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ فعم ولا يخفى عليك إني شي‏ء بلا شك لأن لفظة كل تقتضي الإحاطة والعموم وشي‏ء أنكر النكرات فقد وسعتني رحمته قال سهل فو الله لقد أخرسني وحيرني بلطافة سياقه وظفره بمثل هذه الآية وفهم منها ما لم نفهم وعلم منها ومن دلالتها ما لم نعلم فبقيت حائرا متفكرا وأخذت أتلو الآية في نفسي فلما جئت إلى قوله تعالى فيها فَسَأَكْتُبُها الآية سررت وتخيلت أني قد ظفرت بحجة وظهرت عليه\n\n\nبما يقصم ظهره وقلت له يا ملعون إن الله قد قيدها بنعوت مخصوصة يخرجها من ذلك العموم فقال فَسَأَكْتُبُها فتبسم إبليس وقال يا سهل ما كنت أظن أن يبلغ بك الجهل هذا المبلغ ولا ظننت إنك هاهنا أ لست تعلم يا سهل أن التقييد صفتك لا صفته قال سهل فرجعت إلى نفسي وغصصت بريقي وأقام الماء في حلقي وو الله ما وجدت جوابا ولا سددت في وجهه بابا وعلمت أنه طمع في مطمع وانصرف وانصرفت وو الله ما أدري بعد هذا ما يكون فإن الله سبحانه ما نص بما يرفع هذا الإشكال فبقي الأمر عندي على المشيئة منه في خلقه لا أحكم عليه في ذلك بأمد ينتهي أو بأمد لا ينتهي فاعلم يا أخي أني تتبعت ما حكي عن إبليس من الحجج فما رأيت أقصر منه حجة ولا أجهل منه بين العلماء فلما وقفت له على هذه المسألة التي حكى عنه سهل ابن عبد الله تعجبت وعلمت أنه قد علم علما لا جهل فيه فهو أستاذ سهل في هذه المسألة وأما نحن فما أخذناها إلا من الله فما لإبليس علينا منة في هذه المسألة بحمد الله ولا غيرها وكذا أرجو فيما بقي من عمرنا وهي مسألة أصل لا مسألة فرع فإبليس ينتظر رحمة الله إن تناله من عين المنة والجود المطلق الذي به أوجب على نفسه سبحانه ما أوجب وبه تاب على من تاب وأصلح فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ عن التقييد في التقييد فلا يجب على الله إلا ما أوجبه على نفسه فالعارف كذلك في جوده لا يتقيد ولا يعطي واجبا يجب عليه فإن وجوب العطاء إنما سببه الملك ولا ملك للعارف مع الله فالمال الذي بيد العارف هو لله ليس له والزكاة تجب في عين المال على رب المال ولا رب له سواه سبحانه فقد أوجب على نفسه أن يخرج من هذا المال مقدارا معينا هو حق لطائفة من خلقه أوجبه لهم على نفسه في هذا المال الذي بيد العارف فيخرج العارف من هذا المال حق تلك الطائفة نيابة عن رب المال كما يخرج الوصي عن اليتيم بحكم الوكالة فإنه وليه ومن هذا الباب زلت طائفة في كشفها لهذا المقام فلم تؤد زكاة ما بيدها من المال ورأيت منهم جماعة مع كونهم يخرجون ما هو أكثر من الزكاة ولا يزكونه ويقولون إن الله تعالى لا يجب عليه شي‏ء وهذا المال لله ليس لي ويدي فيه عارية وأنا في هذه المسألة حنفي المذهب فكما لا يجب على ولي اليتيم إخراج الزكاة عن اليتيم لأن اليتيم لا تجب عليه الزكاة في ماله لأنه المخاطب فلا أزكيه فقد بينت لك وفقك الله الجود الإلهي وتقسيمه وأما هل يكون الحق عوضا لعمل خاص أم لا فاعلم إن مالك بن أنس رضي الله عنه يقول في الرجل يعطي الرجل هدية ثم إن المعطى له لا يكافئه فيطلبه بالمكافاة عند الحاكم‏\nفللحاكم إن يفصل عليه الأمر لما فيه من الإجمال ليترتب الحكم على التعيين فيقول له حين أعطيته هذه الهدية ما ابتغيت بها هل ابتغيت بها جزاء من الجنة أو معاوضة في الدنيا أو ابتغيت بها وجه الله فإن قال الخصم ابتغيت بها الأجر في الآخرة من الجنة أو المعاوضة في الدنيا حكم على المعطي إياه برد عين ما أخذه منه إن كانت عينه باقية وإن كانت العين قد ذهبت حكم له بالقيمة على الخلاف في ذلك هل تعتبر القيمة في الشي‏ء في زمان العطاء أو في زمان القضاء وإن قال إنما أعطيتها ابتغاء وجه الله لم يحكم له بشي‏ء في ذلك وقال ليس بيد صاحبك ما قصدته بهديتك فمن وجه أثبته عوضا عنها فيما يظهر فإنه لم يصرح مالك بأكثر من هذا ومن وجه ينفي أن يكون عوضا فإنه لا يماثله في القدر شي‏ء من مخلوقاته والكل نعمته غير أنه المعاوضة على الله لهذا المعطي في الدار الآخرة مما يناسب هديته فإن زاد على ذلك فمن باب المنة وقد قيل‏\n\n\n> لكل شي‏ء إذا فارقته عوض *** وليس لله إن فارقت من عوض‏\n\n\nوالتحقيق في هذه المسألة أن الحق من حيث ذاته ووجوده لا يقاومه شي‏ء ولا يصح أن يراد ولا يطلب لذاته وإنما يطلب الطالب ويريد المريد معرفته أو مشاهدته أو رؤيته وهذا كله منه ليس هو عينه وإذا كان منه لا عينه فقد يصح أن يكون عوضا فيكون عمله في الدنيا الذي هو الحضور مع الله في‏\n\n\nقوله اعبد الله كأنك تراه‏\n\n\nفيكون هذا العمل جزاؤه عند الله رؤيته وهي أرفع المنازل فهي للحاضر هنا في عمله جزاء وهي لغير الحاضر زيادة ومنة فهو عند هذا ليس عوضا وهو عند الآخر عوض فيكون الحضور في الدنيا من الجود المطلق من عين المنة وتكون الرؤية من الجود المقيد جزاء بما أوجبه على نفسه فمن جوده شهدت جوده فما خرج عنه شي‏ء ولا أوجب مخلوق عليه شيئا لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ فإذا أعطى العبد ابتداء لغيره لا جزاء يستحقه ذلك الغير فيكون هذا المعطي لأجل ذلك الاستحقاق تحت قيد الحق فيكون عطاه مثل هذا لا عن استحقاق لا يطلب بذلك إلا وجه الله سواء طلبه بنيته أو لم يطلبه فإن حالة العطاء المبتدأ يعطي ذلك فإنه اتصف فيه بصفة الحق من الجود المطلق حيث لم يكن عطاؤه جزاء ولما كان حاله هذا فكما إن الله تعالى يطلب الجزاء على ما امتن به من النعم على عباده وهو الشكر عليها ومعرفة النعم منه ويجازي هو على ذلك الشكر وعلى تلك المعرفة كذلك يعطى هذا العبد المنعم على غيره ابتداء إطلاق لسان المنعم عليه بالشكر والثناء عليه ثم يتولى الله جزاءه به لا بالجنة حتى اتصف بهذا العطاء بصفته تعالى فهذا قد أبنت محتملات ما يتضمنه هذا المنزل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Ninety-Two: Concerning the Knowledge of the Station of the Shared Realm of the Unseen (عالم الغيب) and the Visible (عالم الشهادة) from the Mosaic Presence (الحضرة الموسوية)\n\nThe night conceals the wonder that is in the Unseen,\nAnd the Sun reveals what the darkness conceals.\n\nAnd the person, if feminine, does not mention it,\nUntil the other (feminine) comes and reminds her of it.\n\nGenerosity (الجود) is the origin, and the opposite of Generosity has no\nOrigin, but the very Essence of Generosity manifests it.\n\nNothing enriches you save Allah, so be content with Him\nAs Lord, and do not be among those who conceal Him.\n\nStand by Him in knowledge upon the peak of a hill,\nAnd if you witness a crescent moon, He makes it full.\n\nAnd if passion (الهوى) calls you one day to deficiency,\nThen its caller (the Divine) will restrain it from that.\n\nHis giving is from Him, first and last,\nAnd it is not in exchange (عوض); thus I mention it.\nIndeed, recompense (الجزاء) is conformity, not based on exchange,\nFor if it were an exchange, I would not prefer it.\n\n### [The Specificity of the Station of the Realm of the Unseen and the Visible to the Knowledge of the Divine Theophany (التجلي الإلهي) Likened to the Sun]\n\nPeace be upon you, and the mercy of Allah and His blessings. Know, O our brethren, that this station (منزل) is one of the greatest in rank. It is the station of the Unseen Marriage (النكاح الغيبي), which is the marriage of meanings (المعاني) and spirits (الأرواح). The knowledge of the Divine Theophany (التجلي الإلهي) likened to the Sun—with no cloud beneath it—is specific to this station, unlike the lunar theophany of the full moon. The latter is referred to in the saying of the Prophet, peace and blessings be upon him: \"You will see your Lord as you see the moon on the night of the full moon.\"\n\nThat lunar theophany has no entry into this station.\n\n[This station is characterized by the vision] \"as you see the sun at noon, with no cloud beneath it.\"\n\nThis station is its place, and from here it is known. It is a wondrous Divine manifestation (مظهر إلهي عجيب). From this station is known: Generosity (الجود) constrained by fear and recompense; the rank of truthfulness (الصدق) even if it appears ugly; the rank of falsehood (الكذب) even if it appears beautiful; acquired wealth (الغني المكتسب), which is accidental wealth; the signs of felicity (السعادة) and the signs of misery (الشقاء); the failure of one who relies upon matters that Allah has established for reliance, and why the reliant person fails despite the Real (الحق) having established those matters for this purpose and qualified their people for it; the science of clarifying the degrees of Divine Proximity (التقريب الإلهي) from the Presence of the Tongue (حضرة اللسن); the knowledge of the station where the two co-wives (الضرتان) reconcile and love each other; the knowledge of the necessary Rapture (الاصطلام اللازم); the description of those among the near ones (المقربين) who are granted this station of Rapture, as opposed to those like them who are not; and Generosity (الجود) with what the Gnostic (العارف) finds of everything that is not obligatory upon him, which is the character of Divine Generosity. [Also known is] whether the Real (الحق) can be an exchange (عوض) attained through a specific deed or not. We shall explain the realities of this station, chapter by chapter, through allusion and suggestion, for it is lengthy. Allah is the Supporter, there is no Lord but Him.\n\nAmong these matters is the productive Unseen Marriage (النكاح الغيبي). Allah the Exalted said: <<وَأَرْسَلْنَا الرِّيَاحَ لَوَاقِحَ>> (And We sent the fertilizing winds). And He the Exalted said: <<وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ>> (And He sent down water from the heaven and brought forth thereby fruits). And He said: <<جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً>> (He made the earth a resting place for you and the heaven a canopy). We have previously discussed this section in the chapter on Gnosis (المعارف) in this book, in the chapter on the Celestial Fathers and the Terrestrial Mothers, so let it be reviewed there.\n\nIn this station, we mention what relates to it, which is that meanings (المعاني) marry bodies (الأجسام) in an unseen, spiritual marriage, and their effects (أحكامهما) are generated between them. This is a veil over the unseen Divine Hand, whose nature is not to be perceived. From this [marriage] are all the forms (الصور) that appear in the Primordial Dust (الهباء). The Primordial Dust is like the wife to the forms, and the forms are like the husband to the Dust. Nothing is produced from them except their Immutable Essences (أعيانهما). This is one of the most wondrous secrets: that the child is the very essence (عين) of the father and mother for whom it is a child, and the father and mother are the very essence of the child for whom they are parents. This is what Al-Hallaj, may Allah have mercy on him, alluded to in his saying: \"My mother gave birth to her father.\" The parent is the very essence of the child for whom he is a parent and the child is his offspring only in this marriage.\n\nFrom this chapter is His saying: \"Be!\" (كُنْ), which is the word of formation (أمر التكوين). He said concerning Jesus that he is the Word of Allah, and concerning the existents that they are the Words of Allah. He has no word in the existents except \"Be!\" (كُنْ), and it is the very essence of the existent (عين الموجود), for it is the Word. Its direction is toward the Fixed Entities (العيون الثابتة), and the Essences are like the mother to it. Thus, the Words appeared, which is the existence of those Essences resulting from this Unseen Marriage. The child between them was their very essence, nothing else. This is subtler than the first matter, for the child here is the very essence of the Word of the Presence. \"Be!\" (كُنْ) is the very essence of the Formed (المكون), and it is attributed to Allah. The first [marriage] is in the second degree, for it is attributed to the Primordial Dust (الهباء) and the form. This marriage is integrated into it, so understand, for I have set you upon the path.\n\nAll corporeal things (الجسمانيات) are offspring of an unseen marriage. All bodies are either from a purely unseen marriage, or from an unseen marriage integrated into a sensory marriage, such as the marriage of winds and waters, animals, plants, minerals, and what is generated in the elemental bodies (الأجسام العنصرية), but not the natural bodies. The mundane world (العالم الملكي) does not generate anything of its own kind, unless it acts as a father at a certain time to an elemental mother by what it casts into her. What is produced is the child between them, which may be created as an angel. This is what is expressed as the \"angelic impulse\" (لمة الملك), which is what the angel casts into the human soul (النفس الإنسانية). A glorification (تسبيحة) or a declaration of unity (تهليلة) is generated between them, issuing from the breath of the one glorifying or declaring unity. A kingly form (صورة ملكية) opens up in the essence and substance of that breath, with the casting angel as its father and the soul as its mother. That form ascends to its father and remains attached to him, seeking forgiveness for its mother, the human soul, until the Day of Resurrection. From this, the ruling in the Sacred Law (الشريعة) is derived, allowing the father to take his child from the mother when the child reaches discernment and intellect, without dispute, for this angel is created rational.\n\nAmong the most wondrous marriages is Non-Existence (الإعدام), and for this reason, the people of Unveiling (أهل الكشف) differed concerning it. Allah the Glorious linked it to the Will (المشيئة), saying: <<إِنْ يَشَأْ يُذْهِبْكُمْ>> (If He wills, He can remove you). And He linked Power (الاقتدار) to the creation of other people, saying: <<وَيَأْتِ بِآخَرِينَ>> (And bring others). And Allah was capable of that, and He did not say \"those two\" in the dual form. The allusion was, by virtue of His Oneness (أحديتها), to the nearest, which is what He brought forth.\n\nFrom this chapter is the sending of the Barren Wind (الريح العقيم), for it is meant to remove the essences of the manifest forms (أعيان الصور الظاهرة) from composition, not the essences of the substances (أعيان الجواهر). Since it produced no existence, barrenness was attributed to it, and it was negated from being fertilizing. This is a marriage purely for desire (الشهوة), not for the existence of offspring, like the marriage of the people of Paradise. Not every desire results in a substantial existence for itself.\n\nFrom here arose the disagreement among the people of Unveiling. Those whose unveiling showed the return of the existent forms to their immutable, non-existent state (ثابتة غير موجودة) said that the Barren Wind did produce in the Presence of Immutability (حضرة الثبوت) what had departed from it, and this is witnessed by the Real (الحق). To this relates the Will in His saying: <<إِنْ يَشَأْ يُذْهِبْكُمْ>> (If He wills, He can remove you), meaning, return you to the state in which you were described by non-existence (العدم). This was barrenness because no existence of the essence for itself appeared from it, even though it was manifest and witnessed by its Creator.\n\nThose who did not witness the return of the essences of the existent forms to non-existence upon the direction of the Will or the blowing of the Barren Wind said that it produces nothing, for creation (الإيجاد) is for Power (الاقتدار), not for Will alone, and it is for the fertilizing wind, not the barren one. If anything existent appeared from it, it would not be barren. This is the cause of the disagreement among the people of Unveiling: the concern of the denier is the eye of existence (عين الوجود), and the concern of the affirmant is the eye of immutability (عين الثبوت). Since they do not refer to the same thing, there is no real disagreement. For us, the realized ones (المحققين), disagreement is inconceivable on this path, unless it is of this nature, which is a verbal disagreement (خلاف لفظي). If each explains what he intended by that word, the disagreement is lifted. What we have alluded to is sufficient.\n\n### [The Variation of Manifestations According to Stations]\n\nFrom this station is the Solar Theophany (التجلي الشمسي), because the similitude used by the scholars of external forms (علماء الرسوم) to remove doubt from the viewer regarding the object of vision was the sun and the moon on the night of the full moon. This is one of the intended aspects of that Hadith. However, the realized ones (المحققون) know, in addition to this, that the two manifestations (المظهرين) are different. The theophany likened to the moon on the night of the full moon is a specific manifestation (مظهر خاص), because the Prophet said \"on the night of the full moon\" and did not say \"in its fullness,\" thus attributing it to the night. I witness it as full even when the sun is present during the day. He attributed it to the night only for a reason known to the realized ones, but this is not the station for discussing it.\n\nHowever, this station includes the station of the Theophany in the Sun. For the Real (الحق), according to the realized ones, is too exalted to manifest in one form twice or to two persons. There is no repetition in any matter concerning the Real, due to the Absolute (الإطلاق) nature He possesses and the Divine Vastness (الاتساع الإلهي). Repetition leads to constraint and limitation.\n\nKnow that the Solar Theophany—that is, the one likened to the sun—is called by us the Wider Theophany (التجلي الأوسع). It is the theophany in which the human does not perish from seeing himself within it. We alluded to this at the beginning of this book in the chapter on the earth created from the remainder of the Adamic clay. This Theophany is a wondrous essential manifestation (مظهر ذاتي عجيب). The Theophany in it is attributed to its effect (معلوله) and not to its cause (علته), even though the cause appears in its effect as a verified essence (عينا محققة) of unknown modality (مجهولة الكيفية), like the appearance of the sun in the day, even though the day is an effect of the sun's appearance, or the light of a lamp from the lamp spreading into the corners of the cosmos. Such a vision is called the witnessing of the cause and its effect together.\n\nEvery theophany that does not make you independent of yourself is of this nature. It is called Wider (أوسع) because the observer's vision encompasses the Self-discloser (المتجلي), the medium in which the disclosure occurs (المتجلي فيه), and himself (له). The non-wider theophany causes you to witness nothing else—neither yourself nor others—nor do you know your witnessing or the state you are in until you return to yourself and the veil (الحجاب) falls. If the veil were permanent, that theophany would be constrained and narrow, as the veil would limit it. The Wider Theophany appears in the veil and outside the veil, and the witness distinguishes between the two forms. For this reason, it is said of them, \"Return them to their palaces,\" alluding to their incapacity, meaning they are confined therein.\n\nHere are oceans containing types of precious jewels that only every wide-souled diver, passionately in love with the Unseen, can perceive. I have explained to you the purpose of this Theophany contained within this station. Its benefits are countless; if we were to mention them, no register could contain them. It has perpetuity in the higher world (العالم العلوي) in this life, and perpetuity in the lower world (العالم الأخروي السفلي) in the Hereafter. There is no theophany that combines opposites in its effects—such as pain and pleasure—except this Theophany. It is like the manifestation of the Beloved to the lover while the Beloved embraces and kisses another. The lover is in pleasure from his gaze [upon the Beloved] and in pain from his gaze [upon the other].\n\nFrom this station is the knowledge of Generosity (الجود) constrained by fear and recompense, the rank of truthfulness (الصدق) even if it appears ugly, the rank of falsehood (الكذب) even if it appears beautiful, acquired wealth (الغني المكتسب), which is accidental wealth, and the signs of felicity and the signs of misery.\n\n### [The Variation of the Cause of Giving]\n\nKnow that the causes of giving (العطاء) vary. Some give for exchange (العوض), which is called buying and selling. There is generosity in it, in that the buyer has been graced by you, the seller, since he has a great purpose in obtaining it, and he has given you what he is independent of. Thus, each has shown generosity (جاد) to his companion by delivering to him what he had a purpose in obtaining, since he had the power to withhold it. To this extent, it is included in the chapter of Generosity from the perspective of the recipient (اسم مفعول), but not from the perspective of the giver (اسم فاعل).\n\nA person may also give in this chapter out of fear for his honor or the onset of sensory pains that afflict him. It is as if he buys good praise, well-being, and security with that giving. This is like the first case, but the difference is that what was bought in the first case is something in which he might have a purpose, whereas in pain, the removal of well-being, and security, he can have no purpose whatsoever.\n\nAs for those among our companions who say otherwise, if they are realized ones, like Abu Yazid in his saying:\n\n> All my desires I have attained,\n> Except the pleasurable ecstasy of my torment.\n\nHe has clarified his intention, which is pleasure (اللذة), and this is what we have said and adopted. If he is not a realized one, then he is not fundamentally on our path, even if he appears so externally, and we have no discussion with him.\n\nSome give for grace (الإنعام) and other reasons, but only what we have mentioned specifically belongs to this station. From this chapter is the saying of the Messenger of Allah, peace and blessings be upon him: \"Love Allah for the graces (نعم) He nourishes you with.\"\n\nHe commanded us to love Him for His grace and beneficence. Does any existent matter from Him concerning the servants fall outside of grace (الإنعام) in any way? Our companions differed on this. Some held that grace is the very essence of existence (عين وجوده), and they do not pay attention to the related purposes. The ruling of this existent being, graced with existence, is that He has graced the pain (الألم) with the existence of its essence, even if the one afflicted by it does not agree with his purpose. It is Allah's grace upon Himself. If the matter depended on the universality of grace upon everyone through a single essence, nothing would exist at all, for realities reject that.\n\nThus, He has grace in every existence. The one whose station is altruism (الإيثار) is truthful in his purpose by his asceticism (زهده) if the ruling of pain afflicts him, in that he thanks Allah for the existence of the pain's essence after it was non-existent. This is preferring the Divine Presence (جناب الله) over his own purpose, since there appeared in the cosmos one who assists him in magnifying and thanking Allah, because he witnesses the pain thanking Allah the Exalted for creating its essence. The greatest intercessor (شفيع) for one in this state before Allah is the pain among the existents, and the Name *Al-Mubli* (The Afflicter) and *Al-Musqim* (The One Who Causes Sickness) among the Divine Names. The result of that intercession is the existence of pleasure (اللذة) and the departure of pain, either by the removal of its cause or by its remaining, which would be a breaking of habit (خرق عادة). This is one of the greatest characters by which a human is honored.\n\nAs for his altruism in this matter for the sake of Allah's Will, no one knows the good that accrues to him from the Name *Al-Murīd* (The Willer) except Allah, who has singled him out for this noble state. This is truthfulness (الصدق) in dealing with Allah, even if it appears ugly. If that pain were to descend upon someone else, this state would necessarily accompany him. It would be ugly for him, concerning the other person, to see him thanking Allah for the pain that afflicted that other, especially if the other were beloved to him, or a prophet or messenger. However, what this station produces—the existence of well-being (العافية) in that other—veils the ugliness that this realized one had worn.\n\nAs for the one who refrains from giving in a situation like the one we mentioned, you know from what we have explained the reason for that refraining and what the refrainer witnesses at the time of refraining. The knowledge of all that is integrated into what we have established, so search for it, for it would be lengthy if we were to detail it. We have given you the key and specified its lock, so open whatever you wish of it.\n\nAs for acquired wealth (الغني المكتسب) in this chapter, it is its ruling. If a person becomes independent of others, it is evidence of his ignorance of realities, since the other has no effect on him. He has linked his independence to something that has no link. If he becomes independent of Allah the Exalted, he is even more ignorant, for by this description he has departed from verified knowledge (العلم المحقق) and from Islam. There is no one more lost than him, because there is no one more ignorant than him.\n\nTrue independence (الاستغناء) is not genuinely valid. Therefore, if wealth is attributed to anyone, it is an accidental attribution (إضافة عرضية), not essential. For this reason, the Name *Al-Ghanī* (The Rich) for the Real (الحق) the Exalted is a negative attribute (صفة سلبي), negating His need for the world. Whoever needs something is never independent of it.\n\nTrue independence is only through means (الأسباب) in terms of relationships (النسب). Every relationship that removes its opposite is the one that governs you. Whether it is called wealth or not is up to your consideration, according to what the reality of that relationship grants you. If it makes you independent of others, then it is wealth, and you are wealthy by it. If it does not make you independent, then it is not wealth, and you are not wealthy by it.\n\nSatiety (الشبع), for example, by its mere reality, is not said to make you independent of hunger (الجوع) in terms of the reality of hunger, because hunger is not sought by you so that you might become independent of it through satiety. However, if hunger, when it afflicts you, grants you purity (الصفاء), subtlety (الرقة), refinement (اللطافة), and realization of servitude (العبودة) and neediness (الافتقار)—which is what its reality grants—then you seek it and are not independent of it. If satiety grants you what hunger grants you of all that we mentioned, then you have become independent of hunger, since hunger is not sought for itself, but is sought for what we mentioned. If we find that in its opposite, we have no need for it, as nature rejects it, just as nature produces it.\n\nFor this reason, the Messenger of Allah, peace and blessings be upon him, sought refuge from hunger and said, \"It is a bad companion.\"\n\nThis is because, even though it grants what we mentioned, it does not guarantee that the neediness is directed toward Allah; rather, it may be directed toward something other than Allah. Therefore, the Messenger of Allah, peace and blessings be upon him, called it a \"bad companion\" generally. The masters of the Path say that if hunger were sold in the market, the seeker (المريد) would be obliged to buy it. But whoever views it as the Prophet viewed it considers it among the errors of the people of the Path, like Abu Abd al-Rahman al-Sulami, who compiled papers on the errors of the Sufis—and this is our doctrine. Hunger has a limit and measure, which is verified hunger (الجوع المحقق), unlike imagined hunger. The Prophetic seeking of refuge was only from verified hunger, for by it a person becomes disobedient to the Law (الشرع) and unjust to himself if it is by choice. For this reason, the Messenger of Allah, peace and blessings be upon him, never went hungry except out of necessity, which is the state of the scholars of Allah, because justice is their attribute.\n\nI have clarified what is sufficient for you, for it is an allusion that suffices for explicit statement.\n\n### [The Sign of the Deed of Felicity is that the Human is Employed in Presence with Allah]\n\nAs for the deeds of felicity (أعمال السعادة), their signs are that the human is employed in the Presence (الحضور) with Allah in all his movements and possibilities, and that he witnesses the attribution of acts to Allah the Exalted in terms of creation and the praiseworthy connection. As for the blameworthy connection, if he attributes it to Allah, he has shown bad manners and is ignorant of the science of obligation (علم التكليف) and to whom the obligation is directed, and who the obligated one is who was told \"Do!\" If the obligated one had no connection to the act whatsoever, he would not have been told \"Do!\" and the entire Sacred Law would be futile, yet it is true in itself.\n\nTherefore, the servant must have a correct connection (نسبة صحيحة) to the act, and it is because of that connection that he is told \"Do!\" Its connection is not the Will (الإرادة), as those who speak of acquisition (الكسب) claim, but rather it is a subtle power-cause (سبب اقتداري لطيف) integrated into the Divine Power (الاقتدار الإلهي) that the humble one grants, like the integration of the light of the stars into the light of the sun. You know by reason (الدليل) that the stars have light spread upon the earth, but we do not perceive it sensually due to the dominance of the sun's light. Similarly, the senses perceive that the acts of the servants belong to them sensually and legally, but the Divine Power is integrated into it, perceived by the intellect (العقل) but not by the senses, like the integration of the sun's light into the light of the stars. The light of the stars is the very essence of the sun's light, and the stars are merely a medium of manifestation (مجلى). The entire light is the sun, yet the senses attribute the light to the stars, saying the light of the stars is integrated into the light of the sun. In reality, there is only the light of the sun, so its light is integrated into itself, since there is no other light there.\n\nAlthough mirrors have an effect, that effect is not from their own light. Light has one effect when it is in the cosmos without an intermediary, and it has another effect in the mirror of its theophany (مرآة تجليه) by a ruling that differs from its ruling without that intermediary. When the sun's light manifests in the full moon (البدر), it grants rulings that it does not grant without the full moon; there is no doubt about this. Similarly, when the Divine Power manifests in the servants, and acts appear from creation, even though it is by Divine Power, the ruling differs because of the mediation of this medium of manifestation (مجلى) which was like a mirror for His Theophany. Just as the solar light is attributed to the full moon sensually and functionally, even though the light belongs to the sun, so too is the act attributed to creation sensually, while the act belongs to Allah in reality. Due to the difference in effect, the luminous ruling (الحكم النوري) changes in things. Thus, what the light grants through the mediation of the full moon differs from what it grants by itself without mediation. Similarly, the ruling differs in the acts of the servants.\n\nFrom here is known upon whom the obligation (التكليف) is directed and to whom it is connected. Just as you know intellectually that the moon itself contains none of the sun's light, and that the sun has not transferred to it in its essence, but rather the moon is a medium of manifestation for it, and that the attribute does not depart from its possessor and the Name from its named, similarly, the servant contains nothing of his Creator, nor has He indwelt him; rather, the servant is merely a medium of manifestation (مجلى) and a locus of appearance (مظهر) for Him. Just as the sun's light is attributed to the moon, so too is Power attributed to creation sensually, and the state is the state.\n\nIf the matter between the sun and the moon is of this nature, despite its subtlety, and not everyone knows it, then what do you think of the Divine matter concerning creation in this issue? It is subtler and subtler. Whoever grasps this knowledge possesses one of the highest signs of felicity. The loss of such knowledge is a sign of misery. By this, I mean the spiritual felicity and misery of the souls. As for sensory felicity and misery, their signs are the prescribed deeds (الأعمال المشروعة) performed with their conditions, which is sincerity (الإخلاص). Allah the Exalted said: <<أَلَا لِلَّهِ الدِّينُ الْخَالِصُ>> (Unquestionably, to Allah belongs the pure religion). And He said: <<وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ>> (And they were not commanded except to worship Allah, dedicating the religion to Him). This much is sufficient for the signs in summary. Allah is the Granter of success, there is no Lord but Him.\n\n### [Concerning the Failure of One Who Relies Upon Matters that Allah Has Established for Reliance]\n\nAs for the failure of one who relies upon matters that Allah has established for reliance, and why the reliant person fails despite the Real (الحق) having established those matters for this purpose and qualified their people for it: Know, O noble brother, that the matters which the Real established for reliance have not departed from Him. However, this failed person made them lords (أربابا) besides Allah, relying upon their essences (ذواتها) and not upon the One who established them. Thus, ignorance (الجهل) struck him, as we mentioned earlier.\n\nIf the observer looks at the effects appearing from the sun's light in the mirror of the full moon and relies upon the sun in that, by virtue of this specific medium of manifestation (مجلى) to which Allah linked the effect, then this person will not fail. He has given the matter its due. The moon will never be eclipsed for him. The one who fails is the one for whom the moon is eclipsed, so he remains in the darkness of his ignorance (ظلمة جهله) despite the existence of the lunar mirror's essence. This failed person is in darkness with that manifestation, for the moon has been veiled concerning this person who relied upon it. <<إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ>> (Indeed, you and what you worship besides Allah are the fuel of Hell), which is darkness. Darkness is Hell (جهنم). What darkness and what Hell is greater than ignorance (الجهل)?\n\nAllah likened it to darkness in His saying: <<أَوْ كَظُلُمَاتٍ>> (Or like layers of darkness), saying: <<ظُلُمَاتٌ بَعْضُهَا فَوْقَ بَعْضٍ>> (Darkness, one above the other). This is ignorance upon ignorance, which is the ignorance of one who is ignorant and does not know that he is ignorant. He negated that he could even *almost* see his hand, so how could he see it? The hand is mentioned here rather than anything else because it is the locus of the existence of Power (الاقتدار) and by it creation occurs. That is, if he extends his power to see it, he cannot almost see it due to the darkness of ignorance. If he saw it, he would see it as the very essence of Divine Power. Do you not see that when he extends it in the light, which is knowledge (العلم), he sees his hand, which is his power? Thus, he knows that cosmic power is the Power of the Real (اقتدار الحق), due to the removal of the accumulated darknesses, one above the other.\n\nFor this reason, the similitude was made with the most intense darknesses: the darkness of the atmosphere is coupled with the darkness of the sea, coupled with the darkness of the wave, coupled with the darkness of the piling up of waves, coupled with the darkness of the clouds that veil the lights of the stars. No light remains manifest, neither in its essence nor in any of its media of manifestation. The darkness of the night is the darkness of nature (الطبع). The darkness of the sea is the darkness of ignorance, which is the loss of knowledge. The darkness of thought is the darkness of the wave. The darkness of the piled-up waves is the darkness of the confusion of thoughts in ambiguities (الشبه). The darkness of the clouds is the darkness of disbelief (الكفر). Whoever combines these darknesses has suffered a manifest loss. This is the state of the Nullifiers (المعطلة) and no others.\n\n### [The Science of Clarifying the Degrees of Divine Proximity from the Presence of the Tongue]\n\nAs for what this station contains concerning the science of clarifying the degrees of Divine Proximity (القرب الإلهي) from the Presence of the Tongue (حضرة اللسن): Know that this is the knowledge of the Lawgiver (الشارع) who translates for Allah, whom we are commanded to believe in regarding both the firm (محكمه) and the ambiguous (متشابهه) verses. We must accept everything he brought. If we claim certainty (قطع) about any part of that, believing it to be the exact intention of the Speaker (God) in reality, the rank of Faith (الإيمان) departs from us. For the intellectual proof (الدليل) rules over the good, thereby nullifying the ruling of Faith.\n\nThe sound knowledge (العلم الصحيح) comes from the believer who says to the proponent of this proof: \"Your certainty that what your observation granted you is the intended meaning of the one who spoke it is the very essence of ignorance and the loss of sound knowledge, even if it coincides with knowledge. Faith has departed from you.\" Felicity (السعادة) is linked to Faith and to sound knowledge based on knowledge. Sound knowledge is that which remains accompanied by Faith.\n\nThe Gnostic (العارف) must clarify the path of felicity as a deputy for Allah the Exalted among His creation, like the moon acting as a deputy for the sun in delivering light. The Messengers (الأنبياء المرسلون), peace be upon them, are the translators (التراجمة) for the Real (الحق), and the inheritors are upon their degree by virtue of the understanding Allah grants them concerning what the Messengers brought of the Book and the Sunnah. This is the science of clarification in brief.\n\n### [The Combination of Opposites in Divine Knowledge is the Cause of the Reconciliation of the Two Co-Wives]\n\nAs for the knowledge of the reconciliation of the two co-wives (الضرتين): Know that Abu Sa'id al-Kharraz was asked, \"How did you know Allah?\" He replied, \"By His combining of opposites,\" and recited: <<هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ>> (He is the First and the Last, the Manifest and the Hidden). That is, He is the First who specified what is the Last, and the Manifest from the perspective of what is the Hidden, because the perspective (الحيثية) is one in His regard. Every two opposites are two co-wives.\n\nThis cannot be grasped by the power of the intellect (قوة العقل), for the power of the intellect does not grant it. Rather, this is grasped from the station beyond the sphere of the intellect (وراء طور العقل), which is the sphere that granted necessities their necessity, possibilities their possibility, impossibilities their impossibility, and Onenesses their oneness. It is He who made the one single, just as He made the necessary necessary by granting it necessity. The power of the intellect cannot grasp what we have mentioned through its thought. This is sound Divine knowledge (علم صحيح إلهي), not intellectual knowledge.\n\nWhen the two opposites meet in Divine Knowledge, the two co-wives reconcile and love each other, since they belong to a single Essence (عين واحدة). Reflect upon this section with the light of Faith, not the light of the intellect, for it is intellectually rejected and unacceptable. Just as the power of sight cannot perceive intelligibles and does not exceed its limit, similarly, the intellect does not have the power to perceive what sight grants by itself without the mediation of sight. If the power of the intellect is incapable of independently knowing the visible things (المبصرات) as visible things—and both it and the power of sight are created—then how can it grasp what is beyond its sphere, toward what is higher in its relation to the Real, when it has failed to grasp what is beyond its sphere toward what is, in its estimation, a lower degree, namely the senses? Whoever needs a created being like himself in a matter is more in need of the Creator. This allusion is sufficient for what the Gnostics know of this.\n\n### [Rapture (الاصطلام) is a Fire that Descends upon the Hearts of the Lovers, Burning Everything it Finds Except the Beloved]\n\nAs for the knowledge of the necessary Rapture (الاصطلام اللازم) and the description of those among the near ones (المقربين) who are granted this station of Rapture, as opposed to those like them who are not: Know that Rapture is a fire that descends upon the hearts of the lovers, burning everything it finds except the Beloved. At times, it removes the image of the Beloved from the lover's soul (نفس المحب). This is the moment when the lover seeks to imagine his Beloved but cannot, nor can he establish her form, due to the intense heat of the flame of love. In that state, he is called raptured (مصطلم). This is what the poet intended in his saying:\n\n> Deposit burning in my heart, deposit\n> Your essence, you are tormented within my ribs.\n\n> Cast the arrows of love or withhold them,\n> You are afflicted with what you cast, along with me.\n\n> Its target is the heart, and you are the one\n> Whose dwelling is in that very place.\n\nFrom this state, Qays ibn al-Mulawwah, Majnun Layla, spoke. Layla came to him while he was raptured, taking ice and placing it on his chest, which immediately melted due to the heat of his heart. He was crying, \"Layla! Layla!\" seeking her because her image was lost from his imagination (خيال). She called out to him, \"O Qays, I am your object of desire, I am Layla!\" But he had no imagined form of her in his soul by which to recognize her. When he heard her name, he said to her, \"Go away from me, for your love has distracted me from you.\"\n\nThis is the state of Rapture. It is a necessary characteristic of the Divine Presence (الحضرة الإلهية) and an effect of every Divine Name in which the Beauty of the Real (جمال الحق) is witnessed. It intervenes between the servant and the qualification (تكييف) of the Real, and it removes every form that the servant tries to fix or imagine. For this reason, the Prophet, peace and blessings be upon him, said: \"Persist in [saying] O Possessor of Majesty and Honor (يا ذا الجلال والإكرام),\" meaning persistence (الإلظاظ). Majesty (الجلال) is never mentioned in the Prophetic sayings without Honor (الإكرام) accompanying it, so that the servant's form (رسم العبد) remains and is not utterly annihilated (يذهب بعينه).\n\nThe Majesty that is the Majesty of Beauty (جلال الجمال) clothes you with awe, so you revere the station. This is what the lover and the Gnostic find in themselves of the magnification of the Beloved, preferring His Presence over everything else. Allah's Honor (إكرام) to him is that He prefers Him over everything.\n\nThere is also a rapture that vanishes immediately, which is what descends upon the heart from witnessing the Beloved in the form of imagination. As long as this imagination lasts, the rapture lasts. Majesty (الجلال) erases this image from the soul out of jealousy of its being limited by a form, for He is the Absolute (الإطلاق). The rapture of that limited form vanishes with its removal.\n\nThe Necessary Rapture (الاصطلام اللازم) remains, which is the effect of Majesty in the soul. The lover sees himself rejecting the imagined form in his soul that says, \"I am your Beloved,\" and turns away from it, magnifying his Beloved, lest he limit Him, knowing that his Beloved is not limited. For this reason, he burns within himself when he desires or wishes to fix what cannot be fixed, so that he may enjoy it.\n\nFor this reason, knowledge (العلم) is more noble than love, and by it Allah commanded His Prophet, peace and blessings be upon him, to ask for increase in it, because it is the very essence of Divine Guardianship (الولاية الإلهية). By it, Allah takes charge of His servants, by it He honors them, and by it they know that He is unknowable. As for the lover who is not a Gnostic, he creates an image in his soul in which he wanders and which he loves. He has only worshipped and longed for what is under his own control. Nothing removes him from this station except Gnosis (المعرفة).\n\nThe bewilderment (حيرة) of the Gnostic concerning the Divine Presence is the greatest of bewilderments, because He is beyond confinement and limitation.\n\n> The gazelles scattered upon Khidash,\n> And Khidash knows not what he hunts.\n\nHe possesses all forms, yet no form limits Him. For this reason, the Prophet, peace and blessings be upon him, used to say: \"O Allah, increase my bewilderment concerning You (اللهم زدني فيك تحيرا).\" This is the highest station, the most manifest view, the nearest rank, the most radiant manifestation, and the most excellent path. From this Presence issued the warning, so stability ceased, and destruction descended upon the realm of the disbelievers. No veil or screen remains but is torn and rent by this most sublime witnessing. For the screen limits the screened, and the veil confines the veiled, and there is no limit to His Essence (ذاته) and no constraint to His Majesty (جلاله). How can anything conceal Him, or how can His Essence be absent? <<تَجْرِي بِأَعْيُنِنَا جَزَاءً لِمَنْ كَانَ كُفِرَ>> (Sailing under Our observation, a recompense for he who had been denied).\n\nWhoever says: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) has spoken the truth, because there is no existent whose Essence is not absent from Him, nor is He confined by a \"where\" (أين), except Allah. All sensory and spiritual forms are His manifestations. He is the Speaker from every form, not *in* every form. He is the One seen by every eye, and the One heard by every ear. He is the One whose speech was never heard so as to be comprehended, nor was He looked upon by sight so as to be limited, nor did He have a manifestation so as to be constrained. The \"He\" (الهو) is necessary for Him: <<لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the Exalted in Might, the Wise). He erases (يَمْحُو), and He is the very essence of what He erases. He establishes (وَيُثْبِتُ), and He is the very essence of what He establishes. <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) in this ruling. Sound, gifted knowledge (العلم الصحيح الموهوب) testifies to this.\n\nThe knowledge of intellectual proof (علم الدليل) negates Him, since it has no grasp of Him and is only concerned with the attributes of negation and transcendence (التنزيه). The knowledge of Unveiling (علم الكشف) affirms Him and maintains Him, and no manifestation appears to it but that it sees Him within it. Both knowledges are sound. He is for every perceptive power according to its capacity, so that it may know that it has not departed from its rank, and that it has attained no knowledge of Allah beyond what it is in itself. Its essence is known, and its soul is described. He departed from limitation and boundaries by His manifestation within them, so that He might be the Worshipped One. He decreed that none should be worshipped but Him. Thus, the idols and statues were manifestations for Him in the belief of the disbelievers, who applied the name of god to them. They worshipped none but the God (الإله) whom that manifestation indicated. He fulfilled their needs, gave them drink, and punished them when they did not respect that Divine Presence in that inanimate form. They are the wretched ones (الأشقياء), even if they were correct that they worshipped none but Allah. Look at this existential permeation (السريان الوجودي) in these manifestations, how some were made felicitous by it and others wretched.\n\nSome said: \"Everything you imagine in yourself or that your imagination forms, Allah is contrary to that.\" He spoke the truth and lied, manifested and veiled. Another said: \"The Real is not indicated by proof, nor is He intelligible to the intellects. Intellects do not attain Him through their thoughts, nor do gnoses bring Him down through their remembrance. When He is remembered, it is by Him that one remembers, and by Him that one thinks and comprehends. He is the intellect of the rational, the thought of the thinkers, the remembrance of the rememberers, and the proof of the indicators. If He departed from anything, He would not be; and if He were contained in anything, He would not be.\"\n\nI have clarified for you the effect of the Necessary Rapture, and that the scholars (العلماء) are the near ones (المقربون) who attained this most protected witnessing and this tremendous Gnosis. As for those besides them, a sign has been established for them which they worship, and a reality which they witness, which is what their belief encompasses, based on a proof established for them or their imitation of the proponent of a proof. In their own estimation, they have achieved their goal, devoted themselves to their worshipped object, found peace in it, and rested from bewilderment. They disbelieve in whatever contradicts what they hold, and they undoubtedly disbelieve others who hold a different belief. For this reason, some disbelieve others and some curse others, in this world and the Hereafter.\n\nThe realized scholar (العالم المحقق), knowing the reality of the matter, finds delight in his own essence and in the world, both its manifest and hidden aspects. He is the correct Essence (العين المصيبة) and the transcendent, stipulated similitude (المثل المنزه المنصوص عليه) which the Real negated from being likened or opposed in His saying: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). That is, there is nothing like the like of Him. The *kāf* (like) is the *kāf* of description; it is not superfluous, as some believe. Some scholars hold that even if a like were hypothesized for Him, that like would not be similar to Him, so how much more so is He Himself not similar? Others hold that it is the negation of the like from the verified similitude we mentioned.\n\nAl-Junayd was asked about Gnosis (المعرفة) and the Gnostic (العارف). He said, \"The color of the water is the color of its container.\" He affirmed the water and the container, thus affirming the letter and the meaning, and perception and negating perception. He separated and combined. How excellent was his saying!\n\nNow that I have clarified the rank of the Necessary Rapture, let us clarify what remains of this station, which is the knowledge of Divine Generosity (الجود الإلهي) that is outside of obligation, and whether the Real can be an exchange attained through a specific deed or not.\n\n### [Indeed, Allah Has Constrained Generosity and Absolute Generosity]\n\nKnow that Allah has Constrained Generosity (جود مقيد) and Absolute Generosity (جود مطلق). He the Glorious constrained some of His Generosity with obligation, saying: <<كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ>> (Your Lord has prescribed mercy for Himself). That is, He obligated and imposed mercy upon Himself for a specific group characterized by a specific deed: <<مَنْ عَمِلَ مِنْكُمْ سُوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَحِيمٌ>> (Whoever among you does wrong out of ignorance and then repents after that and reforms—indeed, He is Forgiving and Merciful). This is a constrained generosity (جود مقيد) by obligation for one who possesses this description, and it is an exchange (عوض) for this specific deed. However, the repentance and reform are themselves from Absolute Generosity (الجود المطلق). Thus, He attracted His Generosity by His Generosity. Nothing besides Him ruled over Him, nor did anything besides Him constrain Him.\n\nThe servant, between the two Generosities, is a vanishing accident and a subsisting accident. Sahl ibn Abdullah, our scholar and Imam, said: \"I met Iblis, and I recognized him, and he recognized from me that I recognized him. A debate ensued between us. He spoke to me, and I spoke to him. The discussion escalated and the dispute lengthened until I stopped, and he stopped, and I was bewildered, and he was bewildered. The last thing he said to me was: 'O Sahl, Allah the Almighty says: <<وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ>> (My mercy encompasses all things). This is general, and it is not hidden from you that I am a 'thing' without doubt, because the word 'all' necessitates encompassing and generality, and 'thing' is the most indefinite of indefinites. Therefore, His mercy has encompassed me.' Sahl said: 'By Allah, he silenced me and bewildered me with the subtlety of his presentation and his triumph with such a verse. He understood from it what we did not understand, and knew from it and its indication what we did not know. I remained bewildered and reflective, and I began reciting the verse to myself. When I reached His saying in it: <<فَسَأَكْتُبُهَا>> (I will prescribe it), I was delighted and imagined that I had triumphed with a proof and overcome him with what would break his back. I said to him: 'O accursed one, Allah has constrained it with specific descriptions that exclude it from that generality: <<فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ>> (I will prescribe it for those who fear Me).' Iblis smiled and said: 'O Sahl, I did not think that ignorance would reach this extent with you, nor did I think you were here. Do you not know, O Sahl, that constraint (التقييد) is your attribute, not His attribute?' Sahl said: 'I returned to myself, choked on my saliva, and the water stood in my throat. By Allah, I found no answer, nor did I close any door in his face. I knew that he had found a point of hope. He departed, and I departed. By Allah, I do not know what will happen after this, for Allah the Glorious did not stipulate what removes this ambiguity. The matter remains with me dependent on His Will (المشيئة) concerning His creation. I do not rule over Him in this matter with a limit that ends or a limit that does not end.'\"\n\nKnow, O my brother, that I tracked the arguments narrated from Iblis, and I found no argument shorter than his, nor anyone more ignorant than him among the scholars. But when I came across this issue narrated from him by Sahl ibn Abdullah, I was astonished and knew that he possessed knowledge free from ignorance. He is Sahl's master in this issue. As for us, we took it only from Allah, so Iblis has no favor over us in this issue, praise be to Allah, nor in any other. I hope the same for the rest of our lives. This is a fundamental issue, not a secondary one.\n\nIblis awaits Allah's mercy to reach him from the very essence of Grace (المنة) and Absolute Generosity (الجود المطلق), by which He obligated upon Himself what He obligated, and by which He accepted the repentance and reform of those who repented. <<فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ>> (The ruling belongs to Allah, the Most High, the Grand), free from constraint in constraint. Nothing is obligatory upon Allah except what He obligated upon Himself.\n\nThe Gnostic (العارف) is likewise in his generosity: he is not constrained, and he does not give what is obligatory upon him, for the obligation of giving is caused by ownership (الملك), and the Gnostic has no ownership with Allah. The wealth in the Gnostic's hand belongs to Allah, not to him. Zakat (obligatory charity) is due on the essence of the wealth, upon the owner of the wealth, and there is no owner but Him, the Glorious. He obligated upon Himself to give a specific amount from this wealth, which is the right of a group of His creation, which He obligated for them upon Himself in this wealth held by the Gnostic. The Gnostic gives the right of that group from this wealth as a deputy for the Owner of the wealth, just as a guardian gives on behalf of an orphan by virtue of agency, for he is his guardian.\n\nFrom this chapter, a group erred in their unveiling of this station, and they did not pay the Zakat on the wealth in their hands. I saw a group of them who gave more than the Zakat but did not pay Zakat, saying, \"Allah the Exalted is not obligated to do anything, and this wealth belongs to Allah, not to me, and my hand in it is a loan.\" In this matter, I follow the Hanafi school: just as the guardian of an orphan is not obliged to pay Zakat on the orphan's wealth because the orphan is not obligated to pay Zakat, since he is the one addressed, I do not pay Zakat on it.\n\nI have clarified for you, may Allah grant you success, Divine Generosity and its division.\n\nAs for whether the Real (الحق) can be an exchange (عوض) for a specific deed or not: Know that Malik ibn Anas, may Allah be pleased with him, said concerning a man who gives a gift to another, and the recipient does not reciprocate, so the giver demands recompense before the judge: The judge must clarify the matter for him, due to its ambiguity, so that the ruling can be based on specification. He asks him: \"When you gave this gift, what did you seek by it? Did you seek recompense (جزاء) in Paradise, or exchange (معاوضة) in this world, or did you seek the Face of Allah (وجه الله)?\" If the litigant says, \"I sought reward in the Hereafter from Paradise, or exchange in this world,\" the judge rules against the recipient to return the essence of what he took, if the essence remains. If the essence is gone, he rules for the value, with disagreement on whether the value is considered at the time of giving or the time of judgment. If he says, \"I only gave it seeking the Face of Allah,\" the judge rules nothing for him in that, saying, \"Your companion does not possess what you sought with your gift.\"\n\nFrom one perspective, [Malik] affirmed it as an exchange in what appears, for Malik did not explicitly state more than this. From another perspective, he negated it from being an exchange, for nothing among His creatures can match Him in measure, and everything is His grace. However, the exchange with Allah for this giver is in the Hereafter, with something commensurate with his gift. If He adds more than that, it is from the chapter of Grace (المنة). It has been said:\n\n> For everything, if you depart from it, there is a substitute,\n> But there is no substitute for Allah if you depart from Him.\n\nThe verification in this matter is that the Real (الحق), in terms of His Essence (ذاته) and Existence (وجوده), cannot be matched by anything, nor is it correct to desire or seek Him for His Essence. Rather, the seeker seeks and the desirer desires His Gnosis (معرفته), or His Witnessing (مشاهدته), or His Vision (رؤيته). All of this is *from* Him, not *Himself* (ليس هو عينه). Since it is from Him and not Him, it can be an exchange.\n\nThus, his deed in this world, which is the Presence with Allah in the saying: \"Worship Allah as if you see Him,\"\n\nThis deed's recompense (جزاؤه) with Allah is His Vision (رؤيته), which is the highest of stations. It is a recompense for the one who is present here in his deed, and it is an increase and grace (زيادة ومنة) for the one who is not present. Thus, for the latter, it is not an exchange, but for the former, it is an exchange.\n\nThe Presence in this world is from Absolute Generosity (الجود المطلق), from the very essence of Grace (عين المنة). The Vision is from Constrained Generosity (الجود المقيد), as a recompense for what He obligated upon Himself. From His Generosity, you witnessed His Generosity. Nothing departed from Him, nor did any creature obligate anything upon Him. <<لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the Exalted in Might, the Wise).\n\nIf the servant gives to another initially, without that other deserving recompense, then this giver is under the constraint of the Real (الحق) because of that deserving. His giving, in this case, is not due to desert, and he seeks nothing by it but the Face of Allah, whether he seeks it by his intention or not. For the state of initial giving grants that, as he is characterized therein by the Attribute of the Real, which is Absolute Generosity, since his giving was not a recompense. Since this is his state, just as Allah the Exalted seeks recompense for the graces He bestowed upon His servants—which is gratitude (الشكر) for them and the knowledge that the graces are from Him—and He rewards that gratitude and that knowledge, similarly, this servant who bestows grace upon others initially is granted the freedom of the tongue of the recipient to thank and praise him. Then Allah takes charge of his recompense, not with Paradise, but by virtue of his being characterized by His Attribute through this giving.\n\nI have clarified the possibilities contained within this station. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "باب نمبر دو سو بانوے: حضرت موسویہ (الحضرة الموسوية) سے عالم غیب (عالم الغيب) اور عالم شہادت (عالم الشهادة) کے اشتراک کے مقام کی معرفت میں۔\n\nرات چھپاتی ہے جو کچھ غیب میں عجائبات ہیں،\nاور سورج ظاہر کرتا ہے جسے تاریکی چھپاتی ہے۔\n\nاور شخص اگر مؤنث ہو تو وہ اسے یاد نہیں کرتا،\nیہاں تک کہ جب دوسری (مؤنث) آتی ہے تو وہ اسے یاد دلاتی ہے۔\n\nاور جود (سخاوت) اصل ہے، اور جود کی ضد کوئی اصل نہیں رکھتی،\nلیکن جود کی عینیت ہی اسے ظاہر کرتی ہے۔\n\nاللہ کے سوا کوئی چیز تمہیں بے نیاز نہیں کر سکتی، پس اسے رب مان کر راضی ہو جاؤ،\nاور ان میں سے نہ ہو جو اسے چھپاتے ہیں۔\n\nاور اس کے ساتھ علم کی صورت میں ایک ٹیلے کی چوٹی پر کھڑے ہو جاؤ،\nاور اگر تم نے ہلال دیکھا تو وہ اسے بدر (چودھویں کا چاند) بنا دیتا ہے۔\n\nاور اگر نفسانی خواہش تمہیں کسی دن کمی کی طرف بلائے،\nتو اس کا بلانے والا تمہیں اس سے روکتا ہے۔\n\nاس کا عطا کرنا اسی کی طرف سے ہے، اول بھی اور آخر بھی،\nاور یہ کسی عوض کے بدلے نہیں ہے، میں اسے اسی طرح یاد کرتا ہوں۔\nبے شک جزا موافقت ہے، نہ کہ عوض کے بدلے،\nاور اگر وہ عوض ہو تو میں اسے ترجیح نہیں دیتا۔\n\n### [عالم غیب اور عالم شہادت کے مقام کا شمسی ظہور الٰہی (التجلی الإلهي) کے علم کے ساتھ خاص ہونا]\n\nسلام علیکم ورحمۃ اللہ وبرکاتہ۔ اے ہمارے بھائیو! جان لو کہ یہ مقام قدر کے لحاظ سے عظیم ترین مقامات میں سے ہے، یہ نکاح غیبی (النكاح الغيبي) کا مقام ہے، اور یہ معانی اور ارواح کا نکاح ہے۔ اس مقام کے ساتھ ظہور الٰہی (التجلی الإلهی) کا وہ علم خاص ہے جو سورج سے مشابہ ہے، جس کے نیچے کوئی بادل نہیں ہوتا، برخلاف قمری یا بدری ظہور (التجلی القمري البدري) کے۔ اور وہ آپ صلی اللہ علیہ وسلم کا یہ فرمان ہے:\n**\"تم اپنے رب کو اسی طرح دیکھو گے جیسے تم چودھویں کی رات چاند کو دیکھتے ہو\"** (حدیث)\nاور اس ظہور (التجلی) کا اس مقام میں کوئی دخل نہیں ہے۔\n**\"اور جیسے تم سورج کو دوپہر کے وقت دیکھتے ہو، جس کے نیچے کوئی بادل نہیں ہوتا۔\"** (حدیث کا حصہ)\nاور یہ مقام اسی کا مقام ہے، اور یہیں سے اس کی معرفت حاصل ہوتی ہے، اور یہ ایک عجیب الٰہی مَظہر ہے۔ اسی مقام سے خوف اور جزا کے ساتھ مقید جود (الجود المقيد)، اور سچائی کا مرتبہ خواہ وہ قبیح ہو، اور جھوٹ کا مرتبہ خواہ وہ حسین ہو، اور کمایا ہوا غنا (الغني المكتسب) جو کہ عرضی غنا ہے، اور سعادت کی علامتیں، اور شقاوت کی علامتیں، اور ان امور پر بھروسہ کرنے والے کی ناکامی کی معرفت حاصل ہوتی ہے جنہیں اللہ نے بھروسہ کرنے کے لیے مقرر کیا ہے، اور یہ بھی کہ اس کا صاحب کیوں ناکام ہوتا ہے جبکہ ذات حق (الحق) نے انہیں اسی مقصد کے لیے مقرر کیا ہے اور ان کے اہل کو بھی۔ اور لسان (حضرة اللسن) کی بارگاہ سے تقرب الٰہی (التقريب الإلهي) کے درجات کو واضح کرنے کا علم، اور اس مقام کی معرفت جہاں دو سوکنیں (الضرتان) آپس میں مل جاتی ہیں اور محبت کرتی ہیں، اور لازم اصطلام (الاصطلام اللازم) کی معرفت، اور اس شخص کی صفت جسے مقربین میں سے یہ اصطلام (الاصطلام) کا مقام عطا ہوا ہے اور ان کی مثالوں میں سے جسے یہ عطا نہیں ہوا، اور ہر اس چیز سے جود (سخاوت) کرنا جو عارف کو ملتی ہے، جس کا اس پر واجب ہونا ضروری نہیں، اور یہ جود الٰہی (الجود الإلهي) کا خلق ہے۔ اور کیا ذات حق (الحق) کسی خاص عمل کے بدلے میں ملنے والا عوض ہو سکتا ہے یا نہیں؟ اور ہم ان شاء اللہ اس مقام کی حقیقتوں کو اشاروں اور کنایوں میں فصل در فصل بیان کریں گے، کیونکہ یہ طویل ہو جائے گا، اور اللہ ہی مددگار ہے، اس کے سوا کوئی رب نہیں۔\n\nان میں سے ایک نکاح غیبی (النكاح الغيبي) ہے جو نتیجہ خیز ہوتا ہے۔ اللہ تعالیٰ فرماتا ہے:\n**\"اور ہم نے ہواؤں کو بار آور بنا کر بھیجا\"** (الحجر: 22)\nاور اللہ تعالیٰ فرماتا ہے:\n**\"اور آسمان سے پانی نازل کیا، پھر اس کے ذریعے ہر طرح کے پھل نکالے\"** (البقرہ: 22)\nاور فرمایا:\n**\"جس نے تمہارے لیے زمین کو بچھونا اور آسمان کو چھت بنایا\"** (البقرہ: 22)\nاس فصل پر کلام اس کتاب کے معارف کے باب میں، علوی باپوں اور سفلی ماؤں کے باب میں گزر چکا ہے، لہٰذا وہاں دیکھ لیا جائے۔ اور ہم اس مقام میں صرف اس سے متعلقہ چیزوں کا ذکر کریں گے۔ وہ یہ ہے کہ معانی اجسام سے نکاح غیبی (النكاح الغيبي) اور معنوی طور پر کرتے ہیں، تو ان دونوں کے درمیان ان کے احکام پیدا ہوتے ہیں۔ اور یہ اس غیبی الٰہی ہاتھ پر ایک پردہ ہے جس کی شان یہ نہیں کہ اسے ادراک کیا جائے۔ اور اسی میں ہباء (الهباء) میں ظاہر ہونے والی تمام صورتیں شامل ہیں، ہباء ان کے لیے عورت کی مانند ہے اور صورتیں ان کے لیے شوہر کی مانند ہیں۔ اور ان دونوں سے ان کی عینیت کے سوا کچھ پیدا نہیں ہوتا۔ اور یہ عجیب ترین اسرار میں سے ہے کہ بیٹا باپ اور ماں کی عینیت ہو، اس کے لیے جو ان کا بیٹا ہے، اور باپ اور ماں بیٹے کی عینیت ہوں، اس کے لیے جن کے وہ والدین ہیں۔ اور یہی وہ بات ہے جس کی طرف حلاج رحمہ اللہ نے اپنے قول میں اشارہ کیا:\n**\"میری ماں نے اپنے باپ کو جنم دیا\"** (شعر)\nاور والد اپنے بیٹے کی عینیت نہیں ہو سکتا، اس کے لیے جس کا وہ والد ہے اور وہ اس کا بیٹا ہے، مگر اسی نکاح میں۔ اور اسی باب سے اس کا قول \"کُن\" (ہو جا) ہے، اور یہ امرِ تخلیق (تکوین) کا کلمہ ہے۔ اور عیسیٰ علیہ السلام کے بارے میں فرمایا کہ وہ اللہ کا کلمہ ہیں، اور موجودات کے بارے میں فرمایا کہ وہ اللہ کے کلمات ہیں۔ اور موجودات میں اس کا کوئی کلمہ نہیں سوائے \"کُن\" کے، اور وہ موجود کی عینیت ہے۔ پس وہ کلمہ ہے، اور اس کا اعیان ثابتہ (العيون الثابتة) پر متوجہ ہونا، پس اعیان ان کے لیے ماں کی مانند ہیں، تو کلمات ظاہر ہوئے، اور یہ اس غیبی نکاح (النكاح الغيبي) سے ان اعیان کا وجود ہے۔ اور ان دونوں کے درمیان پیدا ہونے والا بیٹا ان کی عینیت تھا، کوئی اور نہیں۔ اور یہ پہلے امر سے زیادہ لطیف ہے، کیونکہ یہاں بیٹا حضرہ کے کلمے کی عینیت ہے، پس \"کُن\" (ہو جا) مکوّن کی عینیت ہے، اور اس کی نسبت اللہ کی طرف ہے۔ اور پہلا درجہ ثانوی ہے، کیونکہ اس کی نسبت ہباء (الهباء) اور صورت کی طرف ہے۔ اور یہ نکاح اس میں شامل ہے، پس سمجھ لو، میں نے تمہیں راستے پر ڈال دیا ہے۔ پس تمام جسمانیات نکاح غیبی (النكاح الغيبي) سے اولاد ہیں، اور تمام اجسام میں سے کچھ نکاح غیبی سے ہیں، اور کچھ نکاح غیبی سے ہیں جو نکاح حسی میں شامل ہیں، جیسے ہواؤں، پانیوں، حیوانات، نباتات اور معدنیات کا نکاح، اور وہ جو عنصری اجسام میں پیدا ہوتا ہے، نہ کہ طبعی اجسام میں۔ کیونکہ عالم ملکی (الملكي) سے اس کی جنس کی کوئی چیز پیدا نہیں ہوتی، مگر یہ کہ وہ کسی وقت عنصری ماں کے لیے باپ ہو، اس چیز کے ذریعے جو وہ اس میں ڈالتا ہے۔ تو جو کچھ پیدا ہوتا ہے، وہ ان دونوں کے درمیان کا بیٹا ہوتا ہے، جو کبھی فرشتہ (ملک) پیدا ہوتا ہے، جسے \"لمۃ الملک\" (فرشتے کا القاء) سے تعبیر کیا جاتا ہے۔ اور یہ وہ ہے جو وہ انسانی نفس (النفس الإنسانية) میں ڈالتا ہے، تو ان دونوں کے درمیان ایک تسبیح یا تہلیل پیدا ہوتی ہے جو مسبح اور تہلیل کرنے والے کے نفس سے نکلتی ہے، تو اس نفس کے جوہر میں ایک ملکی صورت کھل جاتی ہے، وہ القاء کرنے والا فرشتہ اس کا باپ ہوتا ہے اور نفس اس کی ماں ہوتی ہے۔ پس وہ صورت اپنے باپ کی طرف چڑھ جاتی ہے اور قیامت تک اپنی ماں جو کہ انسانی نفس ہے، کے لیے استغفار کے ساتھ اس کے ساتھ لازم رہتی ہے۔ اور اسی سے شریعت میں والد کے لیے یہ حکم لگایا جاتا ہے کہ جب بیٹا تمیز اور عقل حاصل کر لے تو وہ اسے ماں سے لے لے، اس میں کوئی اختلاف نہیں، کیونکہ یہ فرشتہ عاقل پیدا ہوتا ہے۔ اور عجیب ترین نکاحوں میں سے ایک اعدام (عدم میں لے جانا) ہے، اور اسی وجہ سے اہل کشف (أهل الكشف) میں اس میں اختلاف ہوا ہے۔ پس اللہ سبحانہ نے اسے مشیئت (ارادہ) سے معلق کیا، فرمایا:\n**\"اگر وہ چاہے تو تمہیں لے جائے\"** (الأنعام: 133)\nاور قدرت کو دوسری قوم کو وجود دینے سے معلق کیا، فرمایا:\n**\"اور دوسروں کو لے آئے\"** (النساء: 133)\nاور اللہ اس پر قادر تھا۔ اور اس نے تثنیہ کے صیغے میں \"ذینك\" نہیں کہا، تو اشارہ اس کی احدیت کے لحاظ سے قریب تر کی طرف تھا، اور وہ وہی ہے جسے وہ لایا۔ اور اسی باب سے بانجھ ہوا (الريح العقيم) کا بھیجنا ہے، کیونکہ وہ صرف ظاہری صورتوں کی عینیت کو تالیف سے زائل کرنے کے لیے ہے، نہ کہ جواہر کی عینیت کو۔ پس جب اس نے کوئی وجود پیدا نہیں کیا تو اس کی طرف بانجھ پن کی نسبت کی گئی اور اس سے بار آور ہونا کی نفی کی گئی۔ پس یہ نکاح محض شہوت کے لیے ہے، نہ کہ اولاد کے وجود کے لیے، جیسے اہل جنت کا نکاح۔ پس ہر شہوت سے کوئی وجود نہیں ہوتا، لیکن اس کے لیے ایک عینی وجود کا ہونا ضروری ہے۔\nاور اسی وجہ سے اہل کشف (أهل الكشف) میں اختلاف واقع ہوا۔ پس جس نے موجود صورتوں کی عینیت کے ثابت ہونے کی حالت کی طرف لوٹنے کا کشف کیا، جو کہ غیر موجود تھیں، اس نے کہا کہ بانجھ ہوا (الريح العقيم) نے حضرہ ثبوت میں وہ چیز پیدا کی جو اس سے نکل چکی تھی، اور وہ ذات حق (الحق) کے لیے مشہود ہے، اور اسی سے مشیئت (ارادہ) متعلق ہوئی، اس کے قول سے: **\"اگر وہ چاہے تو تمہیں لے جائے\"** یعنی تمہیں اس حالت کی طرف لوٹا دے جس میں تم عدم سے موصوف تھے۔ اور یہ بانجھ پن اس لیے تھا کہ اس سے عین کا وجود اپنے لیے ظاہر نہیں ہوا، اگرچہ وہ اپنے خالق کے لیے ظاہر اور مشہود تھا۔ اور جس نے موجود صورتوں کی عینیت کے عدم کی طرف لوٹنے کا مشاہدہ نہیں کیا جب مشیئت متوجہ ہوئی یا بانجھ ہوا چلی، اس نے کہا کہ وہ کوئی چیز پیدا نہیں کرتی، کیونکہ ایجاد صرف قدرت کے لیے ہے، نہ کہ صرف مشیئت کے لیے، اور بار آور ہوا (الريح اللاقحة) کے لیے ہے، نہ کہ بانجھ ہوا کے لیے، کیونکہ اگر اس سے کوئی وجودی چیز ظاہر ہوتی تو وہ بانجھ نہ ہوتی۔ پس یہ اہل کشف کے درمیان اختلاف کا سبب ہے۔ پس نفی کرنے والے کا تعلق عین وجود سے ہے، اور ثابت کرنے والے کا تعلق عین ثبوت سے ہے۔ پس وہ دونوں ایک ہی چیز پر وارد نہیں ہوئے، لہٰذا حقیقت میں کوئی اختلاف نہیں، کیونکہ ہمارے محققین کے نزدیک اس طریقے میں اختلاف کا تصور نہیں کیا جا سکتا، مگر یہ کہ اس طرح کا ہو، اور یہ لفظی اختلاف ہے۔ پس جب ہر ایک اس لفظ سے اپنی مراد کی تفسیر کرے گا تو اختلاف ختم ہو جائے گا، اور جو ہم نے اشارہ کیا ہے وہ کافی ہے۔\n\n### [منازل کے اختلاف سے مظاہر کا اختلاف]\n\nاور اسی مقام سے شمسی ظہور (التجلي الشمسي) ہے، کیونکہ علماء رسوم کے نزدیک دیکھنے والے سے دیکھی جانے والی چیز کے بارے میں شک کو دور کرنے میں سورج اور چودھویں کی رات کے چاند سے تشبیہ دی گئی ہے، اور یہ اس حدیث میں مقصود بعض وجوہ میں سے ہے۔ لیکن محققین نے اس کے علاوہ یہ بھی جانا کہ مظاہر مختلف ہیں، اور چودھویں کی رات کے چاند سے مشابہ ظہور (التجلی) ایک خاص مَظہر ہے، کیونکہ آپ نے فرمایا: \"چودھویں کی رات\"، اور یہ نہیں فرمایا: \"اس کے بدر ہونے میں\"، پس اسے رات کی طرف منسوب کیا، کیونکہ میں اسے دن میں سورج کے موجود ہونے کے باوجود بدر کی صورت میں دیکھتا ہوں۔ پس اسے رات کی طرف منسوب صرف اس امر کے لیے کیا جسے محققین نے جانا، لیکن یہ اس پر کلام کرنے کا مقام نہیں ہے۔ لیکن یہ مقام سورج میں ظہور (التجلی) کے مقام کو شامل ہے۔ کیونکہ محققین کے نزدیک ذات حق (الحق) اس سے بلند ہے کہ وہ ایک ہی صورت میں دو بار یا دو اشخاص کے لیے تجلی (ظہور) کرے۔ پس ذات حق کے ہاں کسی امر میں تکرار نہیں ہے، اس اطلاق کی وجہ سے جو اس پر ہے اور الٰہی وسعت کی وجہ سے، اور تکرار تنگی اور تقیید کا باعث بنتا ہے۔ پس جان لو کہ شمسی ظہور (التجلي الشمسي)، یعنی جو سورج سے مشابہ ہے، ہمارے نزدیک اسے ظہورِ وسیع (التجلي الأوسع) کہا جاتا ہے۔ اور یہ وہ ظہور ہے جس میں انسان اپنے آپ کو دیکھنے سے فنا (الفناء) نہیں ہوتا۔ اور ہم نے اس کی طرف اس کتاب کے شروع میں اس زمین کے باب میں اشارہ کیا تھا جو آدم کی مٹی کے باقی ماندہ حصے سے پیدا کی گئی تھی۔ اور یہ ظہور ایک عجیب ذاتی مَظہر ہے، اور اس میں ظہور (التجلی) کی نسبت اس کے معلول کی طرف کی گئی ہے نہ کہ اس کی علت کی طرف، جبکہ علت اپنے معلول میں ایک محقق عینیت کی صورت میں ظاہر ہے جس کی کیفیت مجہول ہے، جیسے دن میں سورج کا ظاہر ہونا، جبکہ دن سورج کے ظاہر ہونے کا معلول ہے، اور چراغ کا نور جو کائنات کے کونوں میں پھیلا ہوا ہے۔ پس اس طرح کے مشاہدے کو علت اور اس کے معلول کا ایک ساتھ شہود (الشہود) کہا جاتا ہے۔ پس ہر وہ ظہور (تجلی) جو تمہیں تم سے بے نیاز نہ کرے، وہ اسی درجے کا ہے۔ اور اسے وسیع اس لیے کہا گیا کہ مشاہدہ کرنے والا متجلی (ظہور کرنے والے) اور متجلی فیہ (جس میں ظہور ہوا) اور اس کے لیے، سب کو دیکھتا ہے۔ اور غیر وسیع میں تم اس کے سوا کسی کو نہیں دیکھتے، نہ اپنے آپ کو اور نہ کسی اور کو، اور نہ تم اپنے شہود (الشہود) کو جانتے ہو اور نہ اس چیز کو جس میں تم ہو، یہاں تک کہ وہ تمہاری طرف لوٹ آئے اور پردہ (حجاب) واقع ہو جائے۔ پس اگر پردہ کھٹکھٹایا جائے تو وہ ظہور مقید اور تنگ ہو گا، کیونکہ پردے نے اسے مقید کر دیا۔ اور وسیع ظہور پردے میں اور پردے کے بغیر ظاہر ہوتا ہے، اور دیکھنے والا دونوں صورتوں میں فرق کرتا ہے۔ اور اسی لیے ان کے بارے میں کہا جاتا ہے کہ \"انہیں ان کے محلوں کی طرف لوٹا دو\"، ان کی عاجزی کی طرف اشارہ کرتے ہوئے، یعنی انہیں اس میں قید کر دیا جاتا ہے۔ اور یہاں ایسے سمندر ہیں جو نفیس جواہر کی اقسام پر مشتمل ہیں، جنہیں صرف ہر وہ غوطہ خور پا سکتا ہے جو وسیع النفس ہو اور غیب کا عاشق ہو۔ پس میں نے تمہیں اس ظہور (التجلی) کا مقصود بیان کر دیا ہے جسے یہ مقام شامل ہے، اور اس کے فوائد بے شمار ہیں، اگر ہم انہیں ذکر کرنے لگیں تو کوئی دفتر انہیں سما نہیں سکتا، کیونکہ اس کے لیے دنیا میں عالم علوی میں دوام ہے اور آخرت میں عالم سفلی میں دوام ہے۔ اور وہاں کوئی ایسا ظہور نہیں جو اپنے نتیجے میں دو متضاد چیزوں کو جمع کرے، جیسے درد اور لذت، سوائے اس ظہور کے۔ اور یہ محبوب کا محب کے لیے ظہور کرنے کی طرح ہے، وہ کسی اور کو گلے لگاتا ہے اور اسے چومتا ہے، پس وہ اس کے دیکھنے سے لذت میں ہے اور اس کے دیکھنے سے درد میں ہے۔ اور اسی مقام سے خوف اور جزا کے ساتھ مقید جود (الجود المقيد)، اور سچائی کا مرتبہ خواہ وہ قبیح ہو، اور جھوٹ کا مرتبہ خواہ وہ حسین ہو، اور کمایا ہوا غنا (الغني المكتسب) جو کہ عرضی غنا ہے، اور سعادت کی علامتیں، اور شقاوت کی علامتیں، کی معرفت حاصل ہوتی ہے۔\n\n### [عطا کے سبب کا اختلاف]\n\nاور جان لو کہ عطا کے اسباب مختلف ہوتے ہیں۔ پس ان میں سے کچھ وہ ہیں جو عوض کے بدلے دیتے ہیں اور اسے خرید و فروخت کہا جاتا ہے۔ پس اس میں جود (سخاوت) اس لحاظ سے ہے کہ خریدار پر تم نے انعام کیا ہے، اس لیے کہ تم بیچنے والے ہو، اور اسے حاصل کرنے میں اس کا بڑا مقصد ہے، اور اس نے تمہیں وہ چیز دی ہے جس سے وہ بے نیاز ہے۔ پس ان میں سے ہر ایک نے اپنے ساتھی پر جود کیا ہے، اسے وہ چیز پہنچا کر جسے حاصل کرنے میں اس کا مقصد تھا، جبکہ اسے اس سے روکنے کا اختیار تھا۔ پس اس قدر کے ساتھ یہ جود کے باب سے ملحق ہوتا ہے، عطا کرنے والے کی طرف سے اسم مفعول کے لحاظ سے، نہ کہ عطا کرنے والے کی طرف سے اسم فاعل کے لحاظ سے۔ اور کبھی انسان اس باب سے اپنی عزت پر خوف کی وجہ سے یا اس پر نازل ہونے والے حسی دردوں کے خوف سے دیتا ہے، تو گویا وہ اس عطا کے ذریعے اچھی تعریف، عافیت اور امن خریدتا ہے۔ پس یہ پہلے کی طرح ہے، اور ان دونوں میں فرق یہ ہے کہ جس چیز کے بدلے میں اس نے پہلے میں خریدا، وہ ایسی ہے جس میں اس کا مقصد ہو سکتا ہے، اور اس میں درد، عافیت کے زائل ہونے اور امن میں اس کا کوئی مقصد نہیں ہو سکتا۔ اور جو ہمارے اصحاب میں سے اس کے خلاف کہتا ہے، اگر وہ محقق ہے جیسے ابو یزید اپنے قول میں:\n**\"اور میں نے اپنے تمام مقاصد حاصل کر لیے، سوائے عذاب کے ساتھ اپنے وجد کی لذت کے\"** (شعر)\nتو اس نے اپنے مقصود کو واضح کر دیا، اور وہ لذت ہے، اور یہی وہ ہے جو ہم نے کہا اور جس کی طرف ہم گئے ہیں۔ اور اگر وہ محقق نہیں ہے تو وہ ہمارے طریقے کی اصل سے نہیں ہے، اگرچہ وہ صورت میں ظاہر ہو۔ پس ہمارا اس سے کوئی کلام نہیں۔ اور ان میں سے کچھ وہ ہیں جو انعام کے لیے دیتے ہیں اور اس کے علاوہ بھی۔ اور اس مقام سے صرف وہی ہے جو ہم نے خاص طور پر ذکر کیا ہے۔ اور اسی باب سے ہے۔\nرسول اللہ صلی اللہ علیہ وسلم کا فرمان:\n**\"اللہ سے محبت کرو اس لیے کہ وہ تمہیں اپنی نعمتوں سے رزق دیتا ہے\"** (حدیث)\nپس آپ نے ہمیں اس کے انعام اور احسان کی وجہ سے اس سے محبت کرنے کا حکم دیا۔ اور کیا اس کی طرف سے بندوں کے حق میں کوئی وجودی امر ایسا ہو سکتا ہے جو کسی بھی لحاظ سے انعام سے باہر ہو؟ ہمارے اصحاب میں اس میں اختلاف ہے۔ پس ان میں سے کچھ نے یہ رائے دی کہ انعام میں اس کا وجود ہی عین ہے، اور وہ ان اغراض کی طرف توجہ نہیں کرتے جو اس موجود کے حکم سے متعلق ہیں جس پر وجود کا انعام کیا گیا ہے، کیونکہ اس نے درد پر اس کی عینیت کے وجود کا انعام کیا ہے، اگرچہ جس کو اس سے درد ہوتا ہے وہ اس کے مقصد کے موافق نہ ہو۔ پس یہ اس کے نفس پر اللہ کی نعمت ہے۔ اور اگر معاملہ ایک ہی عین کے ساتھ سب پر نعمت کے عموم پر موقوف ہوتا تو کوئی چیز سرے سے نہ ہوتی، کیونکہ حقائق اس سے انکار کرتی ہیں۔ پس اس کے لیے ہر وجود میں نعمت ہے۔ پس جس کا مقام ایثار (الإيثار) ہو، وہ اپنے زہد کے مقصد میں سچا ہوتا ہے جب اس پر درد کا حکم غالب ہو، کہ وہ اللہ کا شکر ادا کرے کہ اس نے درد کو اس کی عینیت کے وجود کا انعام کیا، بعد اس کے کہ وہ نہ تھا۔ اللہ کی بارگاہ کا ایثار اپنے مقصد پر، جہاں وہ ملک (کائنات) میں ظاہر ہوا جو اسے اللہ کی تعظیم اور شکر پر مدد دیتا ہے، کیونکہ وہ درد کا اللہ کا شکر ادا کرنا دیکھتا ہے کہ اس نے اس کی عینیت کو ایجاد کیا۔ پس اس شخص کے لیے اللہ کے ہاں سب سے بڑا شفیع موجودات میں سے درد اور الٰہی اسماء میں سے \"المُبْلِی\" (آزمائش میں ڈالنے والا) اور \"المُسْقِم\" (بیمار کرنے والا) ہوتا ہے۔ پس اس شفاعت کا نتیجہ لذت کا وجود اور درد کا کوچ کرنا ہوتا ہے، یا تو سبب کے زائل ہونے سے یا اس کے باقی رہنے سے، تو یہ خرق عادت ہوتا ہے۔ اور یہ عظیم ترین اخلاق میں سے ہے جس سے انسان کو شرف حاصل ہوتا ہے۔ اور جہاں تک اس میں اللہ کے ارادے کے لیے اس کا ایثار ہے، تو کوئی نہیں جانتا کہ اس کے اسم \"المُرِید\" (ارادہ کرنے والا) سے اسے کیا خیر حاصل ہوتی ہے، سوائے اللہ کے جس نے اسے یہ شریف حال عطا کیا۔ پس یہ معاملہ میں اللہ کے ساتھ سچائی ہے، اگرچہ وہ قبیح ہو، کیونکہ اگر وہ درد کسی اور پر نازل ہوتا تو یہ حالت اس کے ساتھ ضرور ہوتی۔ اور اس پر دوسرے کے حق میں یہ قبیح ہے کہ وہ اسے اس درد پر اللہ کا شکر ادا کرتے ہوئے دیکھے جو اس دوسرے پر غالب آیا ہے، خاص طور پر اگر وہ اس کا محبوب ہو یا نبی یا رسول ہو۔ اور اس مقام سے جو عافیت اس دوسرے میں پیدا ہوتی ہے، وہ اس قباحت کو چھپا دیتی ہے جسے اس محقق نے پہنا تھا۔ اور جس نے اس طرح کے موقع پر عطا کو ترک کر دیا جس کا ہم نے ذکر کیا، تو تم ہماری بیان کردہ باتوں سے جانتے ہو کہ اس ترک کا سبب کیا ہے اور ترک کے وقت اس ترک کرنے والے کا مشہود کیا ہے، کیونکہ اس کا علم سب کچھ اس میں شامل ہے جو ہم نے مقرر کیا ہے، پس اسے تلاش کرو، کیونکہ اگر ہم اسے بیان کریں گے تو یہ طویل ہو جائے گا، اور ہم نے تمہیں کنجی دے دی ہے اور اس کا قفل بھی بتا دیا ہے، پس اس میں سے جو چاہو کھول لو۔ اور جہاں تک اس باب میں کمائے ہوئے غنا (الغني المكتسب) کا تعلق ہے، تو وہ اس کا حکم ہے۔ کیونکہ جب انسان غیر سے بے نیاز ہوتا ہے تو یہ حقائق سے اس کی جہالت کی دلیل ہے، کیونکہ غیر کا اس میں کوئی اثر نہیں، پس اس نے اپنے غنا کو غیر متعلق چیز سے معلق کر دیا۔ اور اگر وہ اللہ تعالیٰ سے بے نیاز ہو جائے تو وہ سب سے زیادہ جاہل اور جاہل تر ہے، کیونکہ وہ اس صفت کے ساتھ علم محقق اور اسلام سے باہر ہو گیا ہے۔ پس اس سے زیادہ خسارہ والا کوئی نہیں، کیونکہ اس سے زیادہ جاہل کوئی نہیں۔ پس حقیقی طور پر بے نیازی (الاستغناء) درست نہیں ہے۔ پس جب غنا (الغني) کی نسبت کسی کی طرف کی جاتی ہے تو یہ عرضی نسبت ہوتی ہے، نہ کہ ذاتی۔ اور اسی وجہ سے ذات حق (الحق) کے لیے اسم \"الغنی\" (بے نیاز) ایک سلبی صفت ہے، جو اس سے عالم کی طرف محتاجی کو سلب کرتی ہے۔ اور جو کسی چیز کا محتاج ہو جائے وہ اس سے کبھی بے نیاز نہیں ہو سکتا۔ پس حقیقی بے نیازی (الاستغناء) اسباب کے ذریعے ہوتی ہے، نسبتوں کے لحاظ سے، یعنی اس لحاظ سے کہ وہ نسبتیں ہیں۔ پس ہر وہ نسبت جو تم سے اس کی ضد کو دور کر دے، وہی تم پر حاکم ہے۔ اور کیا اسے غنا کہا جائے گا یا نہیں؟ پس تمہیں اس میں غور کرنا ہو گا، اس نسبت کی حقیقت کے مطابق جو وہ تمہیں دیتی ہے۔ پس اگر اس نے تمہیں دوسروں سے بے نیاز کر دیا تو وہ غنا ہے اور تم اس کے ذریعے غنی ہو، اور اگر اس نے تمہیں بے نیاز نہیں کیا تو وہ نہ غنا ہے اور نہ تم اس کے ذریعے غنی ہو۔ پس مثال کے طور پر، محض اپنی حقیقت کے لحاظ سے پیٹ بھرنے کے بارے میں یہ نہیں کہا جا سکتا کہ تم اس کے ذریعے بھوک سے بے نیاز ہو گئے، بھوک کی حقیقت کے لحاظ سے، کیونکہ بھوک تمہارے لیے مطلوب نہیں ہے کہ تم پیٹ بھرنے سے اس سے بے نیاز ہو جاؤ۔ لیکن اگر بھوک جب تم پر غالب آتی ہے تو تمہیں وہ صفائی، رقت، لطافت، اور عبودیت اور افتقار کے ساتھ تحقق عطا کرتی ہے جو اس کی حقیقت عطا کرتی ہے، تو تم اس کے طالب ہو، اس سے بے نیاز نہیں۔ پس اگر پیٹ بھرنے نے تمہیں وہ سب کچھ دے دیا جو بھوک نے دیا تھا، تو تم پیٹ بھرنے سے بھوک سے بے نیاز ہو گئے، کیونکہ بھوک بذات خود مطلوب نہیں ہے، بلکہ وہ اس چیز کے لیے مطلوب ہے جس کا ہم نے ذکر کیا ہے۔ پس جب ہم نے وہ اس کی ضد میں پایا تو ہمیں اس کی ضرورت نہیں، کیونکہ طبع اسے رد کرتی ہے، جیسے طبع اسے پیدا کرتی ہے۔ اور اسی وجہ سے:\n**رسول اللہ صلی اللہ علیہ وسلم بھوک سے پناہ مانگتے تھے اور فرماتے تھے کہ یہ برا ساتھی ہے** (حدیث)\nاور یہ اس لیے کہ اگرچہ وہ مذکورہ چیزیں عطا کرتی ہے، لیکن یہ یقینی نہیں کہ اس کا افتقار اللہ کے لیے ہو، بلکہ وہ غیر اللہ کے لیے بھی ہو سکتا ہے۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے اس کے بارے میں فرمایا کہ یہ عموم میں برا ساتھی ہے۔ کیونکہ اہل طریقت کے شیوخ کہتے ہیں کہ اگر بھوک بازار میں بیچی جائے تو مرید پر لازم ہے کہ وہ اسے خریدے۔ اور جس نے ان میں سے اس چیز کو دیکھا جسے نبی صلی اللہ علیہ وسلم نے دیکھا، اس نے اسے اہل طریقت کی غلطیوں میں سے قرار دیا، جیسے ابو عبدالرحمن سلمی نے، جب انہوں نے ان غلطیوں کے بارے میں اوراق لکھے جو صوفیاء سے سرزد ہوئیں، اور یہی ہمارا مذہب ہے۔ اور بھوک کی ایک حد اور مقدار ہے، اور وہ بھوک محققہ ہے، برخلاف متخیلہ بھوک کے۔ پس نبوی پناہ صرف بھوک محققہ سے تھی، کیونکہ اس سے انسان شرع کا نافرمان اور اپنے نفس پر ظلم کرنے والا ہوتا ہے، اگر وہ اختیاری ہو۔ اور اسی وجہ سے رسول اللہ صلی اللہ علیہ وسلم کبھی بھوکے نہیں رہے مگر اضطراراً، اور یہ اللہ والوں کا حال ہے، کیونکہ ان کی صفت عدل ہے۔\nاور میں نے تمہارے لیے وہ بیان کر دیا ہے جو کافی ہے، کیونکہ یہ ایسا کنایہ ہے جو تصریح سے بے نیاز کر دیتا ہے۔\n\n### [سعادت کے عمل کی علامت یہ ہے کہ انسان اللہ کے ساتھ حضور میں مشغول رہے]\n\nاور جہاں تک سعادت کے اعمال کا تعلق ہے، تو ان کی علامت یہ ہے کہ انسان اپنی تمام حرکات اور ممکنات میں اللہ کے ساتھ حضور (الحضور) میں مشغول رہے۔ اور یہ کہ افعال کی نسبت اللہ تعالیٰ کی طرف سے ایجادی اور محمود تعلق کے لحاظ سے دیکھی جائے۔ اور جہاں تک مذموم تعلق کا تعلق ہے، تو اگر اس کی نسبت اللہ کی طرف کی جائے تو اس نے بے ادبی کی اور علم تکلیف سے جہالت برتی۔ اور کس سے تعلق ہے؟ اور وہ مکلف کون ہے جسے \"افعل\" (کر) کہا گیا؟ کیونکہ اگر مکلف کا فعل سے کسی بھی لحاظ سے کوئی نسبت نہ ہوتی تو اسے \"افعل\" نہ کہا جاتا، اور پوری شریعت عبث ہو جاتی، جبکہ وہ بذات خود حق ہے۔ پس بندے کے لیے فعل سے ایک صحیح نسبت کا ہونا ضروری ہے، اور اسی نسبت کی وجہ سے اسے \"افعل\" کہا گیا۔ اور اس کا تعلق ارادے سے نہیں ہے، جیسا کہ کسب کے قائلین کہتے ہیں، بلکہ یہ ایک لطیف اقتداری سبب ہے جو الٰہی اقتدار میں شامل ہے، جو ذلیل کو عطا کرتا ہے، جیسے ستاروں کے نور کا سورج کے نور میں شامل ہونا۔ پس تم دلیل سے جانتے ہو کہ ستاروں کا ایک نور ہے جو زمین پر پھیلا ہوا ہے، لیکن ہم اسے حسی طور پر سورج کے نور کے غلبے کی وجہ سے ادراک نہیں کر پاتے۔ جیسا کہ حواس بندوں کے افعال میں یہ حکم دیتے ہیں کہ فعل حسی اور شرعی طور پر ان کا ہے، اور الٰہی اقتدار (الاقتدار الإلهي) اس میں شامل ہے، جسے عقل ادراک کرتی ہے اور حواس ادراک نہیں کرتے، جیسے ستاروں کے نور کا سورج کے نور میں شامل ہونا۔ کیونکہ ستاروں کا نور سورج کے نور کی عینیت ہے، اور ستاروں کے لیے ایک مَجلیٰ (ظہور کی جگہ) ہے۔ پس سارا نور سورج کا ہے، اور حواس نور کو ستاروں کے لیے قرار دیتے ہیں، اور کہتے ہیں کہ ستاروں کا نور سورج کے نور میں شامل ہو گیا ہے۔ جبکہ حقیقت میں سورج کے نور کے سوا کچھ نہیں، پس اس کا نور اپنے آپ میں شامل ہو گیا، کیونکہ اس کے سوا کوئی نور نہیں تھا۔ اور اگرچہ آئینے (مرائی) کا اثر ہوتا ہے، لیکن وہ اس کے نور سے نہیں ہے۔ بلکہ نور کا اثر اس کے بغیر واسطہ کے کائنات میں ہونے کی وجہ سے ہوتا ہے، اور اس کا دوسرا اثر اس کے ظہور کے آئینے میں ہوتا ہے، ایک ایسے حکم کے ساتھ جو اس واسطہ کے بغیر اس کے حکم سے مختلف ہوتا ہے۔ پس سورج کا نور جب چاند میں تجلی کرتا ہے تو وہ ایسے احکام دیتا ہے جو چاند کے بغیر اس کے حکم سے نہیں ملتے، اس میں کوئی شک نہیں۔ اسی طرح الٰہی اقتدار (الاقتدار الإلهي) جب بندوں میں تجلی کرتا ہے، تو افعال مخلوق سے ظاہر ہوتے ہیں، تو اگرچہ وہ الٰہی اقتدار سے ہیں، لیکن حکم مختلف ہوتا ہے، کیونکہ یہ اس مَجلیٰ کے واسطے سے ہے جو اس کے ظہور کے لیے آئینے کی طرح تھا۔ اور جیسے شمسی نور کی نسبت چاند کی طرف حسی اور فعلی طور پر چاند کے نور کی وجہ سے کی جاتی ہے، جبکہ وہ سورج کا ہے، اسی طرح فعل کی نسبت مخلوق کی طرف حسی طور پر کی جاتی ہے، جبکہ فعل حقیقت میں اللہ ہی کا ہے۔ اور اثر کے اختلاف کی وجہ سے نوری حکم چیزوں میں بدل جاتا ہے۔ پس جو نور چاند کے واسطے سے دیتا ہے، وہ اس سے مختلف ہوتا ہے جو وہ خود بغیر واسطہ کے دیتا ہے۔ اسی طرح بندوں کے افعال میں حکم مختلف ہوتا ہے۔ اور یہیں سے معلوم ہوتا ہے کہ تکلیف کس پر متوجہ ہوئی اور کس سے متعلق ہوئی۔ اور جیسے تم عقلی طور پر جانتے ہو کہ چاند میں بذات خود سورج کا کوئی نور نہیں ہے، اور سورج اپنی ذات کے ساتھ اس کی طرف منتقل نہیں ہوا، بلکہ اس کے لیے ایک مَجلیٰ تھا، اور صفت اپنے موصوف سے جدا نہیں ہوتی اور اسم اپنے مسمیٰ سے، اسی طرح بندے میں اس کے خالق کا کوئی حصہ نہیں ہے اور نہ وہ اس میں حلول کیا ہے، بلکہ وہ صرف اس کے لیے ایک مَجلیٰ اور مَظہر ہے۔ اور جیسے سورج کے نور کی نسبت چاند کی طرف کی جاتی ہے، اسی طرح اقتدار کی نسبت مخلوق کی طرف حسی طور پر کی جاتی ہے، اور حال وہی حال ہے۔ اور جب سورج اور چاند کے درمیان معاملہ اس طرح ہے، اس کے باوجود کہ یہ پوشیدہ ہے اور ہر کوئی اسے نہیں جانتا، تو تمہارا اس مسئلے میں مخلوق کے ساتھ الٰہی امر کے بارے میں کیا خیال ہے، جو اس سے بھی زیادہ پوشیدہ ہے؟ پس جو اس علم پر واقف ہو گیا، وہ سعادت کی اعلیٰ ترین علامتوں میں سے ہے۔ اور اس طرح کی چیز کا فقدان شقاوت کی علامتوں میں سے ہے۔ اور اس سے مراد ارواح کی سعادت اور ان کی معنوی شقاوت ہے۔ اور جہاں تک حسی سعادت اور شقاوت کا تعلق ہے، تو ان کی علامتیں وہ شرعی اعمال ہیں جو اپنی شرائط کے ساتھ ہوں، اور وہ اخلاص ہے۔ اللہ تعالیٰ فرماتا ہے:\n**\"خبردار! خالص دین اللہ ہی کے لیے ہے\"** (الزمر: 3)\nاور فرمایا:\n**\"اور انہیں صرف اسی بات کا حکم دیا گیا تھا کہ وہ اللہ کی عبادت کریں، اس کے لیے دین کو خالص کرتے ہوئے\"** (البینہ: 5)\nاور علامتوں کے اس قدر اجمالی بیان کافی ہے، اور اللہ ہی توفیق دینے والا ہے، اس کے سوا کوئی رب نہیں۔\n\n### [ان امور پر بھروسہ کرنے والے کی ناکامی جنہیں اللہ نے بھروسہ کرنے کے لیے مقرر کیا ہے]\n\nاور جہاں تک ان امور پر بھروسہ کرنے والے کی ناکامی کا تعلق ہے جنہیں اللہ نے بھروسہ کرنے کے لیے مقرر کیا ہے، اور یہ کہ اس کا صاحب کیوں ناکام ہوتا ہے جبکہ ذات حق (الحق) نے انہیں اسی مقصد کے لیے مقرر کیا ہے اور ان کے اہل کو بھی، تو اے ولی بھائی! جان لو کہ وہ امور جنہیں ذات حق نے بھروسہ کرنے کے لیے مقرر کیا ہے، وہ اس سے باہر نہیں ہوئے، لیکن اس ناکام شخص نے انہیں اللہ کے سوا رب بنا لیا، پس اس نے ان کی ذات پر بھروسہ کیا، نہ کہ اس پر جس نے انہیں بنایا۔ پس جہالت نے اسے مارا، جیسا کہ ہم نے ابھی ذکر کیا۔ پس سورج کے نور سے چاند کے آئینے میں ظاہر ہونے والے آثار کو جب دیکھنے والا دیکھتا ہے اور اس میں سورج پر بھروسہ کرتا ہے، اس خاص مَجلیٰ کے لحاظ سے جس سے اللہ نے اثر کو جوڑ دیا ہے، تو یہ ناکام نہیں ہوتا، کیونکہ اس نے امر کو اس کا حق دیا۔ اور اس کے حق میں چاند کبھی گہنایا نہیں جاتا۔ اور جو ناکام ہوتا ہے، وہ ہے جس کے حق میں چاند گہنا جاتا ہے، پس وہ اپنی جہالت کی تاریکی میں رہتا ہے، جبکہ قمری آئینے کی ذات موجود ہوتی ہے۔ پس یہ ناکام شخص اس مَظہر کے ساتھ تاریکیوں میں ہوتا ہے۔ کیونکہ چاند اس شخص کے حق میں چھپ گیا جس پر وہ بھروسہ کرتا تھا:\n**\"بے شک تم اور وہ جن کی تم اللہ کے سوا عبادت کرتے ہو، جہنم کا ایندھن ہیں\"** (الأنبياء: 98)\nاور وہ تاریکی ہے، کیونکہ تاریکی جہنم ہے، اور جہالت سے بڑی کون سی تاریکی اور کون سی جہنم ہے؟ اور اللہ نے اسی سے تشبیہ دی، اپنے قول میں:\n**\"یا جیسے گہرے اندھیرے\"** (النور: 40)\nپس فرمایا:\n**\"اندھیرے ہیں، ایک دوسرے کے اوپر\"** (النور: 40)\nاور یہ جہالت پر جہالت ہے، اور وہ اس شخص کی جہالت ہے جو جاہل ہے اور نہیں جانتا کہ وہ جاہل ہے۔ پس اس سے اپنے ہاتھ کو دیکھنے کے قریب ہونے کی نفی کی گئی، تو وہ اسے کیسے دیکھے گا؟ اور یہاں ہاتھ کو دوسروں کے بجائے داخل کیا گیا، کیونکہ یہ اقتدار کے وجود کی جگہ ہے، اور اسی سے ایجاد واقع ہوتی ہے، یعنی جب وہ اپنے اقتدار کو نکالے تاکہ اسے دیکھے تو وہ اسے دیکھنے کے قریب نہیں ہوتا، جہالت کی تاریکی کی وجہ سے، جو ایک دوسرے کے اوپر جمع ہو گئی ہیں۔ کیونکہ اگر وہ اسے دیکھتا تو اسے عین الٰہی اقتدار (الاقتدار الإلهي) دیکھتا۔ کیا تم نہیں دیکھتے کہ جب وہ اسے نور (جو کہ علم ہے) میں نکالتا ہے تو وہ اپنا ہاتھ دیکھتا ہے، اور وہ اس کا اقتدار ہے، پس اس نے جانا کہ کونی اقتدار (الاقتدار الكوني) ذات حق کا اقتدار ہے، ان جمع شدہ تاریکیوں کے ہٹ جانے کی وجہ سے جو ایک دوسرے کے اوپر تھیں۔ اور اسی وجہ سے سخت ترین تاریکیوں سے تشبیہ دی گئی، کیونکہ فضا کی تاریکی اس کے ساتھ سمندر کی تاریکی سے ملتی ہے، جو اس کے ساتھ موج کی تاریکی سے ملتی ہے، جو اس کے ساتھ موجوں کے جمع ہونے کی تاریکی سے ملتی ہے، جو اس کے ساتھ بادلوں کی تاریکی سے ملتی ہے جو ستاروں کے نور کو چھپا دیتے ہیں۔ پس نور کا کوئی ظہور باقی نہیں رہتا، نہ اپنی عینیت میں اور نہ اپنے کسی مَجلیٰ میں۔ پس رات کی تاریکی طبع کی تاریکی ہے، اور سمندر کی تاریکی جہل (الجهل) کی تاریکی ہے، اور وہ علم کا فقدان ہے۔ اور فکر کی تاریکی موج کی تاریکی ہے، اور جمع شدہ موج کی تاریکی شبہات میں افکار کے داخل ہونے کی تاریکی ہے، اور بادل کی تاریکی کفر کی تاریکی ہے۔ پس جس نے ان تاریکیوں کو جمع کر لیا، اس نے کھلا خسارہ اٹھایا۔ اور یہ صرف معطلہ (منکرین) کا حال ہے۔\n\n### [لسان کی بارگاہ سے الٰہی قرب کے درجات کو واضح کرنے کا علم]\n\nاور جہاں تک اس علم کا تعلق ہے جسے یہ مقام لسان (حضرة اللسن) کی بارگاہ سے الٰہی قرب (القرب الإلهي) کے درجات کو واضح کرنے میں شامل کرتا ہے، تو جان لو کہ وہ شارع کے علم کی معرفت ہے جو اللہ کی طرف سے ترجمانی کرتا ہے، جس نے ہمیں اس کے محکم اور متشابہ پر ایمان لانے کا حکم دیا ہے، اور یہ کہ ہم اس کی لائی ہوئی ہر چیز کو قبول کریں۔ پس اگر اس نے ہمیں اس میں سے کوئی چیز اس طرح دی کہ وہ متکلم کی مراد ہے، تو ہم سے ایمان کا درجہ زائل ہو جائے گا، کیونکہ دلیل خیر پر حکم لگاتی ہے، تو وہ ایمان کے حکم کو معطل کر دیتی ہے۔ اور مؤمن کی طرف سے صحیح علم آیا ہے جو اس دلیل والے کے ساتھی سے کہتا ہے کہ تمہارا یہ قطعی فیصلہ کہ جو کچھ تمہاری نظر نے تمہیں دیا ہے، وہی اس واضح کرنے والے کا مقصود ہے، یہ عین جہالت اور صحیح علم کا فقدان ہے، اگرچہ وہ علم سے موافق ہو جائے۔ اور تم سے ایمان زائل ہو چکا ہے۔ اور سعادت ایمان اور صحیح علم سے متعلق ہے، اور صحیح علم وہ ہے جس کے ساتھ ایمان باقی رہے۔ پس عارف پر لازم ہے کہ وہ اللہ کی طرف سے اس کی مخلوق میں سعادت کا راستہ واضح کرے، جیسے سورج کی طرف سے چاند کا نور پہنچانے میں نیابت کرنا۔ پس انبیاء مرسلین علیہم السلام ذات حق (الحق) کی طرف سے ترجمان ہیں، اور ورثاء ان کے درجے پر ہیں، اس فہم کے ذریعے جو اللہ انہیں رسولوں کی لائی ہوئی کتاب اور سنت میں عطا کرتا ہے۔ پس یہ علم الإفصاح (واضح کرنے کا علم) مختصر ہے۔\n\n### [الٰہی علم میں دو متضاد چیزوں کا جمع ہونا دو سوکنوں کے ملنے کا سبب ہے]\n\nاور جہاں تک دو سوکنوں (الضرتان) کے ملنے کے علم کا تعلق ہے، تو جان لو کہ ابو سعید الخراز سے پوچھا گیا کہ تم نے اللہ کو کیسے پہچانا؟ تو انہوں نے کہا: اس کے دو متضاد چیزوں کو جمع کرنے سے۔ اور انہوں نے یہ آیت تلاوت کی:\n**\"وہی اول ہے اور آخر ہے اور ظاہر ہے اور باطن ہے\"** (الحدید: 3)\nیعنی وہ اول ہے اس لحاظ سے کہ وہ آخر ہے، اور ظاہر ہے اس لحاظ سے کہ وہ باطن ہے، کیونکہ اس کے حق میں حیثیت ایک ہے۔ اور ہر دو متضاد چیزیں دو سوکنیں (ضرتان) ہیں۔ اور یہ عقل کی قوت سے ادراک نہیں کیا جا سکتا، کیونکہ عقل کی قوت اسے نہیں دیتی۔ بلکہ یہ اس مقام سے ادراک کیا جاتا ہے جو عقل کے دائرے سے ماوراء ہے، جس نے اس دائرے سے واجبات کو ان کا وجوب، جائزات کو ان کا جواز، محالات کو ان کا محال ہونا، اور احدیات کو ان کی احدیت عطا کی۔ پس وہی ہے جس نے واحد کو واحد بنایا، جیسے اس نے واجب کو وجوب عطا کر کے واجب بنایا۔ اور عقل کی قوت میں یہ ادراک نہیں ہے جو ہم نے ذکر کیا، اس کی فکر کے لحاظ سے۔ پس یہ ایک صحیح الٰہی علم ہے، نہ کہ عقلی۔ پس جب الٰہی علم میں دو متضاد چیزیں جمع ہو گئیں، تو دو سوکنیں (الضرتان) مل گئیں اور محبت کرنے لگیں، کیونکہ وہ ایک ہی عین کے لیے تھیں۔ پس اس فصل پر ایمان کے نور سے غور کرو، نہ کہ عقل کے نور سے، کیونکہ یہ عقلی طور پر مردود اور ناقابل قبول ہے۔ اور جیسے بصارت کی قوت میں معقولات کو ادراک کرنے کی طاقت نہیں ہے اور وہ اپنی حد سے تجاوز نہیں کرتی، اسی طرح عقل میں یہ قوت نہیں ہے کہ وہ ان چیزوں کو ادراک کرے جو بصارت اسے بغیر بصارت کے واسطہ کے دیتی ہے۔ پس جب عقل کی قوت مبصرات کو ادراک کرنے میں خود مختار ہونے سے عاجز ہے، اس لحاظ سے کہ وہ مبصرات ہیں، اور وہ مخلوق ہیں اور بصارت کی قوت بھی مخلوق ہے، تو کون ہے جو اسے اس چیز کے ادراک کی طرف لے جائے جو اس کے دائرے سے نکل کر اس چیز کی طرف جاتی ہے جو ذات حق (الحق) سے نسبت میں اعلیٰ ہے، جبکہ وہ اس چیز کے ادراک سے عاجز ہے جو اس کے دائرے سے نکل کر اس چیز کی طرف جاتی ہے جو اس کے زعم میں نچلے درجے پر ہے، اور وہ حواس ہیں۔ اور جو کسی مخلوق کا محتاج ہو، وہ خالق کا زیادہ محتاج ہے۔ اور یہ اشارہ اس چیز کے لیے کافی ہے جو عارفین اس سے جانتے ہیں۔\n\n### [اصطلام ایک آگ ہے جو محبت کرنے والوں کے دلوں پر وارد ہوتی ہے اور محبوب کے سوا ہر چیز کو جلا دیتی ہے]\n\nاور جہاں تک لازم اصطلام (الاصطلام اللازم) کی معرفت اور اس شخص کی صفت کا تعلق ہے جسے مقربین میں سے یہ اصطلام کا مقام عطا ہوا ہے اور ان کی مثالوں میں سے جسے یہ عطا نہیں ہوا، تو جان لو کہ اصطلام (الاصطلام) ایک آگ ہے جو محبت کرنے والوں کے دلوں پر وارد ہوتی ہے اور محبوب کے سوا ہر چیز کو جلا دیتی ہے۔ اور کبھی یہ محبوب کی صورت کو محب کے نفس سے لے جاتی ہے، اور یہ وہ وقت ہوتا ہے جب محب اپنے محبوب کا تصور کرنا چاہتا ہے تو وہ اس کا تصور نہیں کر پاتا اور نہ اس کی صورت کو قائم کر پاتا، محبت کی آگ کے شعلے کی قوت کے غلبے کی وجہ سے۔ پس اس حال میں اسے \"مصطلم\" (مستغرق) کہا جاتا ہے۔ اور یہی وہ ہے جس کا ارادہ کہنے والے نے اپنے قول میں کیا:\n**\"میرے دل میں جلن رکھ دے، رکھ دے، تیری ذات میری پسلیوں میں تکلیف دیتی ہے۔\"** (شعر)\n**\"اور محبت کے تیر چلا یا انہیں روک لے، تو جس چیز کو نشانہ بناتا ہے وہ میرے ساتھ ہی زخمی ہوتی ہے۔\"** (شعر)\n**\"اس کا ٹھکانہ دل ہے، اور تو ہی وہ ہے جس کا مسکن اس جگہ پر ہے۔\"** (شعر)\nاور اسی حال سے قیس بن ملوح، مجنون بنی عامر، لیلیٰ کے صاحب نے کہا، اور لیلیٰ اس کے پاس آئی جبکہ وہ اصطلام (الاصطلام) کی حالت میں تھا، وہ برف لے کر اپنے سینے پر ڈالتا تھا تو وہ دل کی حرارت سے فوراً پگھل جاتی تھی، اور وہ لیلیٰ لیلیٰ پکار رہا تھا، اس کی صورت کے اپنے خیال سے غائب ہونے کی وجہ سے اسے طلب کر رہا تھا۔ تو اس نے اسے پکارا: اے قیس! میں تمہاری مطلوب ہوں، میں لیلیٰ ہوں۔ تو اس کے نفس میں اس کی کوئی متخیلہ صورت نہیں تھی جس سے وہ اسے پہچانتا، مگر جب اس نے اس کا نام سنا تو اس سے کہا: مجھ سے دور ہو جا، کیونکہ تیری محبت نے مجھے تجھ سے مشغول کر دیا ہے۔ پس یہ اصطلام (الاصطلام) کا حال ہے، اور یہ الٰہی بارگاہ کے لیے ایک لازم صفت ہے جو مؤثر ہے۔ اور ہر الٰہی اسم جس میں ذات حق (الحق) کا جمال مشہود ہو، وہ بندے اور ذات حق کی کیفیت بیان کرنے کے درمیان حائل ہو جاتا ہے، اور ہر اس صورت کو لے جاتا ہے جسے وہ ضبط کرتا ہے یا تصور کرتا ہے۔ اور اسی وجہ سے:\n**آپ صلی اللہ علیہ وسلم نے فرمایا: \"یا ذوالجلال والاکرام (اے جلال اور اکرام والے) کو لازم پکڑو\"** (حدیث)\n\"الإلظاظ\" (لازم پکڑنا) سے مراد ثابت قدمی ہے۔ اور جلال کو اکرام کے ساتھ جوڑا گیا، اور نبوی احادیث میں جلال کبھی نہیں آیا مگر اکرام اس کے ساتھ ہوتا ہے، تاکہ بندے کا نقش باقی رہے اور اس کی عینیت زائل نہ ہو۔ پس جلال جو کہ جمال کا جلال ہے، تمہیں ہیبت عطا کرتا ہے، تو تم مقام کی ہیبت محسوس کرتے ہو، اور یہی وہ ہے جسے محب اور عارف اپنے نفس میں محبوب کی تعظیم سے پاتا ہے، تو وہ اس کی بارگاہ کو ہر چیز پر ترجیح دیتا ہے۔ پس اللہ کا اکرام اس کے ساتھ یہ ہے کہ وہ اسے ہر چیز پر ترجیح دیتا ہے۔ اور ایک اصطلام وہ ہے جو وقت پر زائل ہو جاتا ہے، اور وہ وہ ہے جو محبوب کے مشاہدے سے خیال کی صورت میں دل پر وارد ہوتا ہے۔ پس جب تک یہ خیال رہتا ہے، اس کا اصطلام باقی رہتا ہے۔ اور جلال اس صورت کو نفس سے مٹا دیتا ہے، اس پر غیرت کی وجہ سے کہ اسے کسی صورت سے مقید کیا جائے، جبکہ اس کے لیے اطلاق ہے۔ پس اس مقید صورت کے زائل ہونے سے اس کا اصطلام زائل ہو جاتا ہے، اور لازم اصطلام (الاصطلام اللازم) باقی رہتا ہے، جو نفس میں جلال کا اثر ہے۔ پس محب اپنے نفس میں اس متخیلہ صورت کو جھٹلاتا ہوا دیکھتا ہے جو اسے کہتی ہے کہ میں تمہارا محبوب ہوں، اور وہ اس سے اعراض کرتا ہے، اپنے محبوب کی تعظیم کی وجہ سے کہ اسے مقید کرے، اس معرفت کی وجہ سے کہ اس کا محبوب مقید نہیں ہوتا۔ اسی لیے وہ اپنے نفس میں جلتا ہے جہاں وہ چاہتا ہے یا تمنا کرتا ہے کہ وہ اس چیز کو ضبط کرے جو ضبط نہیں ہوتی، تاکہ اس سے لطف اندوز ہو۔ اور اسی وجہ سے علم محبت سے زیادہ اشرف ہے، اور اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو اس میں زیادتی مانگنے کا حکم دیا، کیونکہ یہ عین ولایت الٰہیہ ہے۔ اسی سے اللہ اپنے بندوں کی ولایت کرتا ہے، اور اسی سے انہیں عزت دیتا ہے، اور اسی سے وہ جانتے ہیں کہ وہ جانا نہیں جاتا۔ اور جہاں تک محب کا تعلق ہے، اگر وہ عارف نہ ہو تو وہ اپنے نفس میں ایک صورت پیدا کرتا ہے جس میں وہ سرگرداں رہتا ہے اور اس سے عشق کرتا ہے۔ پس اس نے صرف اسی کی عبادت کی اور اسی کا مشتاق ہوا جو اس کی احاطہ میں ہے، اور اسے اس مقام سے صرف معرفت ہی ہٹا سکتی ہے۔ پس عارف کی حیرت الٰہی بارگاہ میں سب سے بڑی حیرت ہے، کیونکہ وہ حصر اور تقیید سے باہر ہے۔\n**\"ہرن خداش پر بکھر گئے، پس خداش نہیں جانتا کہ وہ کیا شکار کرتا ہے۔\"** (شعر)\nپس اس کے لیے تمام صورتیں ہیں، اور اس کے لیے کوئی صورت نہیں جو اسے مقید کرے۔ اور اسی وجہ سے:\n**آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے: \"اے اللہ! مجھ میں اپنے بارے میں حیرت (تحیر) بڑھا دے\"** (حدیث)\nکیونکہ یہ اعلیٰ ترین مقام، سب سے زیادہ روشن منظر، قربت کا مقام، سب سے زیادہ چمکدار مَظہر، اور بہترین طریقہ ہے۔ اور اسی بارگاہ سے انذار (ڈرانا) صادر ہوا، پس قرار ختم ہو گیا، اور کفار کے میدان میں ہلاکت نازل ہوئی۔ پس کوئی پردہ اور حجاب باقی نہیں رہا مگر اس اعلیٰ مشاہدے نے اسے پھاڑ ڈالا اور چیر دیا۔ کیونکہ پردہ پردہ دار کو مقید کرتا ہے اور حجاب محجوب کو محدود کرتا ہے، اور اس کی ذات کی کوئی حد نہیں اور اس کے جلال کی کوئی تقیید نہیں، پس کوئی چیز اسے کیسے چھپا سکتی ہے یا اس کی عینیت غائب ہو سکتی ہے؟\n**\"جو ہماری آنکھوں کے سامنے چل رہی تھی، اس شخص کی جزا کے طور پر جس نے کفر کیا تھا\"** (القمر: 14)\nپس جس نے کہا: **\"کوئی چیز اس کے مثل نہیں ہے\"** (الشورى: 11)، تو اس نے سچ کہا، کیونکہ کوئی موجود نہیں ہے جس کی عینیت غائب ہو اور جسے کوئی جگہ محدود کرے، سوائے اللہ کے۔ پس تمام حسی اور معنوی صورتیں اس کے مظاہر ہیں۔ پس وہ ہر صورت سے بولنے والا ہے، نہ کہ ہر صورت میں۔ اور وہ ہر آنکھ سے دیکھا جانے والا ہے، اور وہ ہر کان سے سنا جانے والا ہے۔ اور وہ وہ ہے جس کا کلام سنا نہیں گیا کہ اسے سمجھا جائے، اور نہ اسے کسی بصارت نے دیکھا کہ اسے محدود کیا جائے، اور نہ اس کا کوئی مَظہر تھا کہ وہ مقید ہو جائے۔ پس \"ھو\" (وہ) اس کے لیے لازم ہے: **\"کوئی معبود نہیں مگر وہ، جو غالب، حکمت والا ہے\"** (آل عمران: 6)۔ وہ مٹاتا ہے، اور وہ عین ہے جسے وہ مٹاتا ہے۔ اور فرمایا: **\"اور ثابت کرتا ہے\"** (الرعد: 39)، اور وہ عین ہے جسے وہ ثابت کرتا ہے۔ پس **\"کوئی چیز اس کے مثل نہیں ہے\"** (الشورى: 11) اس حکم میں۔ اور اسی کی گواہی صحیح موہوب علم نے دی ہے۔ پس دلیل کا علم اس کی نفی کرتا ہے، کیونکہ اس کے ہاتھ میں اس میں سے کچھ نہیں ہے اور نہ اس کا تعلق سلب اور تنزیہ کی صفات کے سوا کسی سے ہے۔ اور کشف (الکشف) کا علم اسے ثابت کرتا ہے اور اسے باقی رکھتا ہے، اور اس کے لیے کوئی مَظہر ظاہر نہیں ہوتا مگر وہ اسے اس میں دیکھتا ہے۔ اور دونوں علم صحیح ہیں، پس وہ ہر مدرک قوت کے لیے اس کے مطابق ہے، تاکہ اسے معلوم ہو جائے کہ وہ اپنے منصب سے ہٹی نہیں ہے اور اس نے اللہ کے بارے میں علم میں صرف وہی حاصل کیا ہے جو وہ بذات خود ہے۔ پس اس کی ذات پہچانی گئی اور اس کا نفس بیان کیا گیا، پس وہ ان حدود اور تقییدات سے باہر ہو گیا، اس میں اس کے ظاہر ہونے کی وجہ سے، تاکہ وہی معبود ہو۔ پس اس نے فیصلہ کر دیا کہ اس کے سوا کسی کی عبادت نہ کی جائے، پس بت اور مورتیاں کفار کے زعم میں اس کے مظاہر تھے، پس انہوں نے ان پر الٰہ کا نام اطلاق کیا، پس انہوں نے صرف الٰہ کی عبادت کی، اور وہی ہے جس پر اس مَظہر نے دلالت کی۔ پس اس نے ان کی حاجتیں پوری کیں، اور انہیں سیراب کیا، اور انہیں سزا دی، کیونکہ انہوں نے اس الٰہی بارگاہ کا اس جمادی صورت میں احترام نہیں کیا۔ پس وہ بدبخت ہیں، اگرچہ انہوں نے درست کیا یا صرف اللہ کی عبادت کی۔ پس اس وجودی سرایت کو ان مظاہر میں دیکھو کہ کیسے ایک قوم اس سے سعادت مند ہوئی اور دوسری اس سے بدبخت ہوئی۔ بعض نے کہا: جو کچھ تم نے اپنے نفس میں تصور کیا یا تمہارے وہم نے اس کی صورت بنائی، تو اللہ اس کے خلاف ہے۔ پس اس نے سچ کہا اور جھوٹ کہا، اور ظاہر کیا اور چھپایا۔ اور دوسرے نے کہا: ذات حق (الحق) نہ دلیل کا مدلول ہو سکتا ہے اور نہ عقلوں کا معقول، عقلیں اسے اپنی فکروں سے حاصل نہیں کر سکتیں اور نہ معارف اسے اپنے اذکار سے اتار سکتے ہیں۔ پس جب ذکر کیا جاتا ہے تو اسی کے ذریعے ذکر کیا جاتا ہے، اور اسی کے ذریعے فکر کی جاتی ہے اور سمجھا جاتا ہے۔ پس وہ عقل مندوں کی عقل، فکر کرنے والوں کی فکر، ذکر کرنے والوں کا ذکر، اور دلالت کرنے والوں کی دلیل ہے۔ اگر وہ کسی چیز سے باہر ہو جائے تو وہ نہ ہو، اور اگر وہ کسی چیز میں ہو تو وہ نہ ہو۔ پس یہ میں نے تمہیں بیان کر دیا ہے کہ لازم اصطلام (الاصطلام اللازم) کا اثر کیا ہے، اور یہ کہ علماء ہی مقربین ہیں جنہوں نے یہ سب سے زیادہ محفوظ مشاہدہ اور یہ عظیم معرفت حاصل کی۔ اور ان کے سوا، اس کے لیے ایک علامت مقرر کی گئی ہے جس کی وہ عبادت کرتا ہے، اور ایک حقیقت جس کا وہ مشاہدہ کرتا ہے، اور وہ وہی ہے جو اس کے اعتقاد میں شامل ہے، کسی دلیل کی وجہ سے جو اس کے پاس قائم ہوئی یا اس نے کسی دلیل والے کی تقلید کی۔ پس وہ اپنے نزدیک اپنے مطلوب کو پا چکا ہے، اور اپنے معبود پر اعتکاف کر چکا ہے، اور اس سے سکون حاصل کر چکا ہے اور حیرت سے راحت پا چکا ہے۔ اور اس نے اس چیز کا کفر کیا جو اس کے پاس موجود چیز کے خلاف تھی، اور اس نے بلا شک دوسرے کا کفر کیا جس نے اس کے اعتقاد کے علاوہ اعتقاد رکھا۔ اسی لیے وہ ایک دوسرے کا کفر کرتے ہیں اور دنیا و آخرت میں ایک دوسرے پر لعنت کرتے ہیں۔ اور عالم محقق، جو امر کی عینیت کو جانتا ہے، وہ اپنی ذات میں اور عالم کے ظاہر و باطن میں سیر کرتا ہے۔ پس وہ عین مصیبہ (درست عینیت) ہے، اور وہ منزہ مثال ہے جس پر نص وارد ہوئی ہے، جس کی ذات حق نے مماثلت یا مقابلہ سے نفی کی، اپنے قول سے: **\"کوئی چیز اس کے مثل نہیں ہے\"** (الشورى: 11) یعنی اس کے مثل کے مثل کوئی چیز نہیں ہے۔ پس \"کاف\" صفت کا \"کاف\" ہے، وہ زائد نہیں ہے، جیسا کہ بعض سمجھتے ہیں۔ پس بعض علماء اس میں یہ رائے رکھتے ہیں کہ اگر اس کے لیے کوئی مثل فرض بھی کر لیا جائے تو وہ اس مثل کے مماثل نہیں ہو گا، تو پھر وہ بذات خود کیسے مماثل ہو سکتا ہے؟ اور بعض کے نزدیک، اس مثل کی نفی جو ہم نے ذکر کیا، محقق مثل سے ہے۔ جنید سے معرفت اور عارف کے بارے میں پوچھا گیا تو انہوں نے کہا: پانی کا رنگ اس کے برتن کا رنگ ہے۔ پس انہوں نے پانی اور برتن کو ثابت کیا، پس انہوں نے حرف اور معنی اور ادراک کو ثابت کیا اور ادراک کی نفی کی۔ پس انہوں نے فرق کیا اور جمع کیا۔ پس انہوں نے کیا خوب کہا۔ اور جب میں نے تمہیں لازم اصطلام (الاصطلام اللازم) کے مرتبے کے بارے میں بیان کر دیا ہے، تو ہم تمہیں اس مقام میں باقی ماندہ چیز بیان کرتے ہیں، اور وہ وجوب سے باہر جود الٰہی (الجود الإلهي) کا علم ہے، اور کیا ذات حق (الحق) کسی خاص عمل کے بدلے میں عوض ہو سکتا ہے یا نہیں؟\n\n### [بے شک اللہ کے لیے جود مقید اور جود مطلق ہے]\n\nاور جان لو کہ اللہ کے لیے جود مقید (الجود المقيد) بھی ہے اور جود مطلق (الجود المطلق) بھی ہے۔ کیونکہ اس نے اپنے بعض جود کو وجود سے مقید کیا، فرمایا:\n**\"تمہارے رب نے اپنے اوپر رحمت کو لازم کر لیا ہے\"** (الأنعام: 54)\nیعنی اس نے اپنے اوپر رحمت کو واجب اور فرض کر لیا ہے، خاص لوگوں کے لیے جن کی صفت ایک خاص عمل سے بیان کی گئی ہے، اور وہ یہ ہے کہ:\n**\"تم میں سے جس نے جہالت سے کوئی برا کام کیا، پھر اس کے بعد توبہ کی اور اصلاح کر لی، تو بے شک وہ بہت بخشنے والا، نہایت رحم کرنے والا ہے\"** (الأنعام: 54)\nپس یہ جود (سخاوت) وجوب کے ساتھ مقید ہے، اس شخص کے لیے جس کی یہ صفت ہے۔ اور یہ اس خاص عمل کا عوض ہے۔ اور توبہ اور اصلاح جود مطلق (الجود المطلق) سے ہے۔ پس اس نے اپنے جود کو اپنے جود سے کھینچا۔ پس اس کے سوا کسی نے اس پر حکم نہیں لگایا اور نہ کسی اور نے اسے مقید کیا۔ اور بندہ دونوں جود کے درمیان ایک زائل ہونے والا عرض اور ایک موجود عرض ہے۔ ہمارے عالم اور امام سہل بن عبداللہ نے کہا: میں ابلیس سے ملا، تو میں نے اسے پہچانا اور اس نے مجھ سے پہچانا کہ میں نے اسے پہچانا۔ پس ہمارے درمیان مناظرہ ہوا، تو اس نے مجھ سے کہا اور میں نے اس سے کہا، اور ہمارے درمیان کلام بڑھ گیا اور جھگڑا طویل ہو گیا، یہاں تک کہ میں ٹھہر گیا اور وہ ٹھہر گیا، اور میں حیران ہوا اور وہ حیران ہوا۔ پس اس کی آخری بات یہ تھی کہ: اے سہل! اللہ عزوجل فرماتا ہے:\n**\"اور میری رحمت ہر چیز پر محیط ہے\"** (الأعراف: 156)\nپس اس نے عموم کیا، اور تم پر یہ پوشیدہ نہیں کہ میں بلا شک ایک چیز ہوں، کیونکہ لفظ \"کل\" (ہر) احاطہ اور عموم کا تقاضا کرتا ہے، اور \"شیء\" (چیز) نکرہ میں سب سے زیادہ نکرہ ہے۔ پس اس کی رحمت مجھ پر محیط ہو گئی۔ سہل نے کہا: خدا کی قسم! اس نے مجھے خاموش کر دیا اور اپنے بیان کی لطافت اور اس طرح کی آیت پر اس کی کامیابی سے مجھے حیران کر دیا، اور اس نے اس سے وہ سمجھا جو ہم نہیں سمجھے، اور اس سے اور اس کی دلالت سے وہ جانا جو ہم نہیں جانتے تھے۔ پس میں حیران اور متفکر رہا، اور میں نے اپنے نفس میں آیت کو تلاوت کرنا شروع کیا، پس جب میں اس میں اس کے قول پر پہنچا: **\"پس میں اسے لکھ دوں گا\"** (الأعراف: 156) تو میں خوش ہوا اور مجھے خیال آیا کہ میں نے ایک دلیل پا لی ہے اور اس پر غالب آ گیا ہوں، اس چیز کے ذریعے جو اس کی کمر توڑ دے گی۔ اور میں نے اس سے کہا: اے ملعون! اللہ نے اسے مخصوص صفات سے مقید کر دیا ہے جو اسے اس عموم سے نکال دیتی ہیں۔ تو اس نے کہا: **\"پس میں اسے لکھ دوں گا\"**۔ تو ابلیس مسکرایا اور کہا: اے سہل! میں نے نہیں سوچا تھا کہ جہالت تمہیں اس حد تک پہنچا دے گی، اور نہ میں نے سوچا تھا کہ تم یہاں ہو۔ کیا تم نہیں جانتے اے سہل کہ تقیید تمہاری صفت ہے نہ کہ اس کی صفت؟ سہل نے کہا: پس میں اپنے نفس کی طرف لوٹا اور میرا حلق خشک ہو گیا اور پانی میرے حلق میں ٹھہر گیا، اور خدا کی قسم! مجھے کوئی جواب نہیں ملا اور نہ میں نے اس کے سامنے کوئی دروازہ بند کیا۔ اور میں نے جانا کہ اس نے ایک طمع کی جگہ پر طمع کی ہے، اور وہ چلا گیا اور میں چلا گیا۔ اور خدا کی قسم! میں اس کے بعد نہیں جانتا کہ کیا ہو گا، کیونکہ اللہ سبحانہ نے اس چیز کو واضح نہیں کیا جو اس اشکال کو دور کرے۔ پس معاملہ میرے نزدیک اس کی مخلوق میں اس کی مشیئت (ارادہ) پر باقی رہا، میں اس پر اس میں کسی ایسی مدت کے ساتھ حکم نہیں لگاتا جو ختم ہو جائے یا ایسی مدت کے ساتھ جو ختم نہ ہو۔ پس جان لو اے میرے بھائی! کہ میں نے ابلیس سے حکایت کی گئی دلیلوں کا پیچھا کیا، تو میں نے اس سے کمزور دلیل والا اور علماء کے درمیان اس سے زیادہ جاہل کسی کو نہیں دیکھا۔ پس جب میں اس مسئلے پر واقف ہوا جو سہل بن عبداللہ نے اس سے حکایت کیا، تو مجھے تعجب ہوا اور میں نے جانا کہ اس نے ایسا علم جانا ہے جس میں جہالت نہیں ہے۔ پس وہ اس مسئلے میں سہل کا استاد ہے۔ اور جہاں تک ہمارا تعلق ہے، تو ہم نے اسے صرف اللہ سے لیا ہے۔ پس اس مسئلے میں ابلیس کا ہم پر کوئی احسان نہیں ہے، اللہ کے فضل سے، اور نہ کسی اور میں۔ اور میں اپنی باقی ماندہ عمر میں بھی یہی امید رکھتا ہوں۔ اور یہ ایک اصل مسئلہ ہے، نہ کہ فرعی مسئلہ۔ پس ابلیس اللہ کی رحمت کا انتظار کر رہا ہے کہ وہ اسے عین منت اور جود مطلق (الجود المطلق) سے حاصل ہو، جس کے ذریعے اس نے اپنے اوپر واجب کیا جو اس نے واجب کیا، اور جس کے ذریعے اس نے توبہ کرنے والے اور اصلاح کرنے والے پر توبہ قبول کی۔ پس **\"حکم اللہ ہی کا ہے جو بلند اور بڑا ہے\"** (غافر: 12)، تقیید میں تقیید سے۔ پس اللہ پر صرف وہی واجب ہے جو اس نے اپنے اوپر واجب کیا۔ پس عارف بھی اسی طرح اپنے جود میں مقید نہیں ہوتا اور نہ وہ کوئی واجب عطا کرتا ہے جو اس پر واجب ہو۔ کیونکہ عطا کا وجوب صرف ملکیت کی وجہ سے ہوتا ہے، اور عارف کے لیے اللہ کے ساتھ کوئی ملکیت نہیں۔ پس جو مال عارف کے ہاتھ میں ہے وہ اللہ کا ہے، اس کا نہیں۔ اور زکوٰۃ مال کی عینیت میں رب المال پر واجب ہوتی ہے، اور اس کے سوا کوئی رب نہیں۔ پس اس نے اپنے اوپر واجب کیا کہ وہ اس مال میں سے ایک معین مقدار نکالے، جو اس کی مخلوق کے ایک گروہ کا حق ہے، جو اس نے اپنے اوپر اس مال میں واجب کیا جو عارف کے ہاتھ میں ہے۔ پس عارف اس مال میں سے اس گروہ کا حق رب المال کی نیابت میں نکالتا ہے، جیسے وصی یتیم کی طرف سے وکالت کے حکم سے نکالتا ہے، کیونکہ وہ اس کا ولی ہے۔ اور اسی باب سے ایک گروہ اپنے اس مقام کے کشف (الکشف) میں پھسل گیا، پس انہوں نے اپنے ہاتھ میں موجود مال کی زکوٰۃ ادا نہیں کی، اور میں نے ان میں سے ایک جماعت کو دیکھا، اس کے باوجود کہ وہ زکوٰۃ سے زیادہ نکالتے ہیں، لیکن وہ اسے زکوٰۃ نہیں دیتے، اور کہتے ہیں کہ اللہ تعالیٰ پر کوئی چیز واجب نہیں ہے، اور یہ مال اللہ کا ہے، میرا نہیں، اور میرا ہاتھ اس میں عاریت ہے۔ اور میں اس مسئلے میں حنفی مذہب کا ہوں۔ پس جیسے یتیم کے ولی پر یتیم کی طرف سے زکوٰۃ نکالنا واجب نہیں، کیونکہ یتیم پر زکوٰۃ واجب نہیں، کیونکہ وہ مخاطب ہے، پس میں اس کی زکوٰۃ نہیں نکالتا۔ پس میں نے تمہارے لیے جود الٰہی (الجود الإلهي) اور اس کی تقسیم کو بیان کر دیا ہے، اللہ تمہیں توفیق دے۔ اور جہاں تک یہ سوال ہے کہ کیا ذات حق (الحق) کسی خاص عمل کا عوض ہو سکتا ہے یا نہیں؟ تو جان لو کہ مالک بن انس رضی اللہ عنہ اس شخص کے بارے میں کہتے ہیں جو کسی شخص کو ہدیہ دیتا ہے، پھر جسے ہدیہ دیا گیا وہ اسے بدلہ نہیں دیتا، تو وہ حاکم کے پاس اس سے بدلہ طلب کرتا ہے۔\nتو حاکم پر لازم ہے کہ وہ اس پر معاملہ کو واضح کرے، کیونکہ اس میں اجمال ہے، تاکہ حکم تعین پر مرتب ہو جائے۔ پس وہ اس سے کہے گا کہ جب تم نے اسے یہ ہدیہ دیا تو تم نے اس سے کیا چاہا؟ کیا تم نے اس سے جنت سے جزا چاہی یا دنیا میں معاوضہ، یا تم نے اس سے اللہ کی رضا چاہی؟ پس اگر فریق مخالف نے کہا کہ میں نے اس سے آخرت میں جنت سے اجر چاہا یا دنیا میں معاوضہ، تو وہ اسے عطا کرنے والے پر حکم لگائے گا کہ وہ اس چیز کی عینیت واپس کرے جو اس نے لی تھی، اگر اس کی عینیت باقی ہو، اور اگر عینیت ختم ہو گئی ہو تو وہ اس کے لیے قیمت کا حکم لگائے گا، اس اختلاف پر کہ کیا قیمت کا اعتبار عطا کے وقت کیا جائے یا فیصلے کے وقت۔ اور اگر اس نے کہا کہ میں نے اسے صرف اللہ کی رضا کے لیے دیا تھا، تو وہ اس کے لیے اس میں کوئی حکم نہیں لگائے گا، اور کہے گا کہ تمہارے ساتھی کے ہاتھ میں وہ چیز نہیں ہے جس کا تم نے اپنے ہدیے سے قصد کیا تھا۔ پس ایک لحاظ سے اس نے اسے عوض کے طور پر ثابت کیا، جو ظاہر ہوتا ہے، کیونکہ مالک نے اس سے زیادہ واضح نہیں کیا۔ اور ایک لحاظ سے اس نے عوض ہونے کی نفی کی، کیونکہ اس کی مخلوقات میں سے کوئی چیز اس کے برابر نہیں ہو سکتی، اور سب اس کی نعمت ہے۔ سوائے اس کے کہ اس عطا کرنے والے کے لیے اللہ پر آخرت میں معاوضہ ہے، جو اس کے ہدیے کے مناسب ہو۔ پس اگر اس سے زیادہ ہو تو وہ منت کے باب سے ہے۔ اور کہا گیا ہے:\n**\"ہر چیز کا جب تم اسے چھوڑ دو تو عوض مل جاتا ہے، اور اللہ کا اگر تم اسے چھوڑ دو تو کوئی عوض نہیں\"** (شعر)\nاور اس مسئلے میں تحقیق یہ ہے کہ ذات حق (الحق) اپنی ذات اور وجود کے لحاظ سے کسی چیز کے مقابلے میں نہیں آ سکتا، اور نہ اس کی ذات کے لیے ارادہ کیا جا سکتا ہے اور نہ اسے طلب کیا جا سکتا ہے۔ بلکہ طالب صرف اس کی معرفت (المعرفۃ) یا اس کا مشاہدہ (الشہود) یا اس کا دیدار چاہتا ہے۔ اور یہ سب کچھ اس کی طرف سے ہے، وہ اس کی عینیت نہیں۔ اور جب وہ اس کی طرف سے ہے، نہ کہ اس کی عینیت، تو وہ عوض ہو سکتا ہے۔ پس اس کا دنیا میں عمل، جو اللہ کے ساتھ حضور (الحضور) ہے، اس کے قول میں:\n**\"اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو\"** (حدیث)\nپس یہ عمل اس کے لیے اللہ کے ہاں اس کا دیدار جزا ہو گا، اور یہ اعلیٰ ترین منازل میں سے ہے۔ پس یہ یہاں اپنے عمل میں حاضر رہنے والے کے لیے جزا ہے، اور غیر حاضر کے لیے زیادتی اور منت ہے۔ پس اس کے نزدیک یہ عوض نہیں ہے، اور دوسرے کے نزدیک یہ عوض ہے۔ پس دنیا میں حضور (الحضور) جود مطلق (الجود المطلق) سے ہے، عین منت سے، اور دیدار جود مقید (الجود المقيد) سے جزا ہو گا، اس چیز کے بدلے جو اس نے اپنے اوپر واجب کی۔ پس اس کے جود سے تم نے اس کا جود دیکھا۔ پس کوئی چیز اس سے باہر نہیں نکلی اور نہ کسی مخلوق نے اس پر کوئی چیز واجب کی۔ **\"کوئی معبود نہیں مگر وہ، جو غالب، حکمت والا ہے\"** (آل عمران: 6)۔ پس جب بندہ ابتداءً کسی دوسرے کو عطا کرتا ہے، نہ کہ کسی جزا کے بدلے جس کا وہ دوسرا مستحق ہو، تو یہ عطا کرنے والا اس استحقاق کی وجہ سے ذات حق کی قید میں ہوتا ہے۔ پس اس طرح کی عطا استحقاق کے بغیر ہوتی ہے، وہ اس سے صرف اللہ کی رضا نہیں چاہتا، خواہ وہ اپنی نیت سے طلب کرے یا نہ کرے۔ کیونکہ ابتداءً عطا کرنے کی حالت یہ عطا کرتی ہے، کیونکہ وہ اس میں جود مطلق (الجود المطلق) کی صفت سے متصف ہوا، جہاں اس کی عطا جزا نہیں تھی۔ اور جب اس کا حال یہ تھا، تو جیسے اللہ تعالیٰ اپنے بندوں پر اپنی نعمتوں کے بدلے میں جزا طلب کرتا ہے، اور وہ ان پر شکر اور نعمتوں کی معرفت ہے، اور وہ اس شکر اور اس معرفت پر جزا دیتا ہے، اسی طرح یہ بندہ جو ابتداءً دوسرے پر انعام کرتا ہے، اس پر انعام کیے جانے والے کی زبان کو شکر اور تعریف کے ساتھ آزاد کر دیتا ہے، پھر اللہ اس کی جزا خود دیتا ہے، نہ کہ جنت سے، یہاں تک کہ وہ اس عطا کے ذریعے اس کی صفت سے متصف ہو جائے۔ پس یہ میں نے تمہیں ان احتمالات کو بیان کر دیا ہے جو یہ مقام شامل کرتا ہے، اور **\"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\"** (الأحزاب: 4)۔",
    "fa": "باب دویست و نود و دوم: در معرفت منزل اشتراک عالم غیب و عالم شهادت از حضرت موسوی\n\nشب، آنچه در غیب از شگفتی‌هاست، می‌پوشاند؛ و خورشید، آنچه را تاریکی‌ها پنهان می‌کنند، آشکار می‌سازد.\nو شخص، اگر مؤنث باشد، او را یاد نمی‌کند، تا آنکه دیگری بیاید و او را به یاد آورد.\nو جود (بخشندگی) اصل است، و ضد جود اصلی ندارد، بلکه عین جود آن را آشکار می‌سازد.\nهیچ چیز جز خدا تو را بی‌نیاز نمی‌کند، پس او را پروردگار بپذیر و از کسانی مباش که او را پنهان می‌دارند.\nو به واسطه او، دانشی بر فراز تپه‌ای برپا کن؛ و اگر هلالی را شهود (al-Shuhūd) کردی، او آن را بدر کامل می‌سازد.\nو اگر هوس (هوی) روزی تو را به سوی نقصی فراخواند، همانا دعوت‌کننده او، تو را از آن باز می‌دارد.\nعطای او از جانب اوست، در آغاز و پایان؛ و نه در ازای عوض، این‌گونه آن را یاد می‌کنم.\nهمانا جزا موافقت است، نه در ازای عوض؛ و اگر عوضی باشد، من آن را برنمی‌گزینم.\n\n[اختصاص منزل عالم غیب و شهادت به علم تجلی الهی (al-Tajallī al-Ilāhī) که به خورشید تشبیه شده است]\n\nسلام و رحمت و برکات خدا بر شما باد. ای برادران ما، بدانید که این منزل از بزرگ‌ترین منازل از نظر قدر و منزلت است. این منزل نکاح غیبی است، و آن نکاح معانی و ارواح است. علم تجلی الهی (al-Tajallī al-Ilāhī) که به خورشید تشبیه شده و ابری در زیر آن نیست، به این منزل اختصاص دارد؛ برخلاف تجلی قمری بدری (ماه شب چهارده) که در مورد آن پیامبر (ص) فرمود: «پروردگارتان را می‌بینید، همان‌گونه که ماه شب بدر را می‌بینید.»\n\nو این تجلی (قمری) در این منزل (شمسی) راهی ندارد.\n\nو همان‌گونه که خورشید را در نیمروز می‌بینید که ابری در زیر آن نیست.\n\nو این منزل، منزل اوست و از اینجا شناخته می‌شود، و آن مظهری الهی و شگفت‌انگیز است. از این منزل، جود (بخشندگی) مقید به ترس و جزا، و مرتبه صدق (راستی) هرچند زشت باشد، و مرتبه کذب (دروغ) هرچند نیکو باشد، و غنای اکتسابی که همان غنای عرضی است، و نشانه‌های سعادت و نشانه‌های شقاوت، و ناامیدی کسی که بر اموری تکیه کرده که خداوند آن‌ها را برای اعتماد قرار داده است، و اینکه چرا صاحب آن با وجود اینکه حق (al-Ḥaqq) آن‌ها را برای این امر و اهل آن قرار داده، ناامید می‌شود، شناخته می‌شود. همچنین علم افصاح از درجات تقرب الهی از حضرت لسن (زبان)، و معرفت مقامی که دو هوو (ضرتان) در آن با هم الفت می‌گیرند و یکدیگر را دوست می‌دارند، و معرفت اصطلام (غرق شدن) لازم، و صفت کسی که مقام این اصطلام را از مقربین دریافت کرده است، در مقایسه با امثالشان که آن را دریافت نکرده‌اند، و جود به آنچه عارف (al-ʿĀrif) از هر چیزی می‌یابد که بر او واجب نیست، که همان خلق جود الهی است، و اینکه آیا حق (al-Ḥaqq) می‌تواند عوضی باشد که با عمل خاصی به دست آید یا خیر. و اگر خدا بخواهد، حقایق این منزل را فصل به فصل با اشاره و تلویح بیان خواهیم کرد، زیرا طولانی می‌شود، و خداوند یاری‌دهنده است و پروردگاری جز او نیست.\n\nاز جمله آن موارد، نکاح غیبی مولد است. خداوند متعال می‌فرماید: **«وَأَرْسَلْنَا الرِّيَاحَ لَوَاقِحَ»** (و بادها را بارورکننده فرستادیم). و نیز می‌فرماید: **«وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ»** (و از آسمان آبی فرو فرستاد و به وسیله آن از میوه‌ها بیرون آورد). و فرمود: **«جَعَلَ لَكُمُ الْأَرْضَ فِرَاشاً وَالسَّمَاءَ بِنَاءً»** (زمین را برای شما بستر و آسمان را بنا قرار داد). سخن در مورد این فصل پیش‌تر در فصل معارف این کتاب، در باب پدران علوی و مادران سفلی، گذشت؛ پس باید به آنجا مراجعه شود.\n\nو در این منزل، آنچه به آن مربوط است را ذکر می‌کنیم، و آن این است که معانی، با اجسام نکاحی غیبی و معنوی می‌کنند و از میان آن دو، احکامشان متولد می‌شود. و این حجابی است بر دست غیبی الهی که شأن آن ادراک شدن نیست. و از جمله آن، تمام صور ظاهری در هباء (غبار کیهانی) است؛ هباء برای آن‌ها مانند زن است و صور برای آن مانند شوهر، و از آن دو جز اعیانشان به وجود نمی‌آید. و این از شگفت‌انگیزترین اسرار است که فرزند، عین پدر و مادر باشد برای کسی که فرزند آن‌هاست، و پدر و مادر، عین فرزند باشند برای کسی که آن‌ها والدین او هستند. و این همان است که حلاج (رحمه الله) در قول خود به آن اشاره کرده است: «مادرم پدرش را زایید.» و والد، عین ولد نمی‌شود برای کسی که والد اوست و او ولد اوست، مگر در این نکاح.\n\nو از این باب است قول او: **«كُنْ»** (باش)، که کلمه امر تکوین است. و در مورد عیسی (ع) فرمود که او کلمه خداست، و در مورد موجودات فرمود که آن‌ها کلمات خدا هستند. و او در موجودات کلمه‌ای جز «کن» ندارد، و آن عین موجود است، زیرا آن کلمه است و توجه آن بر عیون ثابته است. پس اعیان برای آن مانند مادر هستند، و کلمات ظاهر شدند، که همان وجود آن اعیان از این نکاح غیبی است، و فرزند میان آن دو، عین خودشان بود و نه غیر آن‌ها. و این لطیف‌تر از امر اول است، زیرا فرزند در اینجا عین کلمه حضرت است، پس «کن» عین مُکَوَّن (ایجاد شده) است و به خدا نسبت داده می‌شود. و اولی در درجه دوم است، زیرا به هباء و صورت نسبت داده می‌شود. و این نکاح در آن (نکاح اول) درج شده است، پس بفهم، که تو را بر سر راه انداختم.\n\nپس جسمانیات همگی فرزندان نکاح غیبی هستند، و اجسام همگی برخی از آن‌ها از نکاح غیبی هستند و برخی از آن‌ها از نکاح غیبی هستند که در نکاح حسی درج شده است، مانند نکاح بادها و آب‌ها و حیوانات و گیاهان و معادن، و آنچه در اجسام عنصری متولد می‌شود، نه اجسام طبیعی. زیرا عالم ملکی چیزی از جنس خود را متولد نمی‌کند، مگر اینکه در زمانی پدر باشد برای مادری عنصری، به واسطه آنچه به او القا می‌کند. پس آنچه تولید می‌شود، آن فرزند میان آن دو ممکن است مَلَکی خلق شود، که از آن به «لَمَّة المَلَک» (الهام فرشته) تعبیر می‌شود، و آن چیزی است که به نفس انسانی القا می‌کند، و از میان آن دو، تسبیح یا تهلیلی متولد می‌شود که نفسی را از مسبّح و مُهَلِّل خارج می‌سازد، و در عین و جوهر آن نفس، صورتی ملکی گشوده می‌شود که آن مَلَک القاکننده پدر آن و نفس مادر آن است. پس آن صورت به سوی پدرش ارتقا می‌یابد و با استغفار برای مادرش که همان نفس انسانی است، تا روز قیامت ملازم او می‌ماند. و از اینجا در شریعت حکم می‌شود که والد حق دارد فرزند خود را از مادرش بگیرد، اگر ممیز و عاقل شود، بدون هیچ اختلافی، زیرا این مَلَک عاقل خلق می‌شود.\n\nو از شگفت‌انگیزترین نکاح‌ها، اعدام (نیست کردن) است، و به همین دلیل اهل کشف (al-Kashf) در مورد آن اختلاف کرده‌اند. خداوند سبحان آن را به مشیئت (خواست) خود معلق کرد و فرمود: **«إِنْ يَشَأْ يُذْهِبْكُمْ»** (اگر بخواهد شما را می‌برد). و اقتدار را به ایجاد قوم دیگری معلق کرد و فرمود: **«وَيَأْتِ بِآخَرِينَ»** (و دیگرانی را می‌آورد). و خداوند بر آن بود و «ذینِک» (آن دو) را به صورت تثنیه نگفت، پس اشاره از جهت احدیتش به نزدیک‌تر بود، که همان کسی است که او را آورد.\n\nو از این باب است فرستادن باد عقیم (نازا)، زیرا آن برای از بین بردن اعیان صور ظاهری از تألیف است، نه اعیان جواهر. پس چون وجودی تولید نکرد، عقیم بودن به آن نسبت داده شد و بارور بودن از آن نفی گردید. پس این نکاح صرفاً برای شهوت است، نه برای وجود فرزند، مانند نکاح اهل بهشت. پس از هر شهوتی، کیانی به وجود می‌آید و وجود عینی برای خودش ضروری است.\n\nو از اینجا اختلاف میان اهل کشف (al-Kashf) رخ داد. پس کسی که کشف (al-Kashf) رجوع اعیان صور موجود را به حالت ثابته غیر موجود کرد، گفت که باد عقیم در حضرت ثبوت، آنچه را که از آن خارج شده بود، تولید کرده است، و آن برای حق (al-Ḥaqq) مشهود است و مشیئت (خواست) به آن تعلق گرفته است، با این قول که: **«إِنْ يَشَأْ يُذْهِبْكُمْ»** (اگر بخواهد شما را می‌برد)، یعنی شما را به حالتی که در آن به عدم موصوف بودید، باز می‌گرداند. و این عقیم بود، زیرا وجود عین برای خودش از آن ظاهر نشد، هرچند برای خالقش ظاهر و مشهود بود. و کسی که رجوع اعیان صور موجود به عدم را هنگام توجه مشیئت یا وزش باد عقیم شهود (al-Shuhūd) نکرد، گفت که آن چیزی تولید نمی‌کند، زیرا ایجاد برای اقتدار است نه فقط برای مشیئت، و برای باد بارور است نه برای عقیم؛ چرا که اگر چیزی وجودی از آن ظاهر می‌شد، عقیم نبود. پس این سبب اختلاف میان اهل کشف (al-Kashf) است. متعلق نفی‌کننده، عین الوجود (هستی) است و متعلق اثبات‌کننده، عین الثبوت است. پس چون بر یک چیز وارد نشده‌اند، در حقیقت اختلافی نیست، زیرا در این طریق نزد محققان ما، اختلافی جز مانند این تصور نمی‌شود، و این اختلافی لفظی است. پس اگر هر یک آنچه را که از آن لفظ اراده کرده، تفسیر کند، اختلاف برطرف می‌شود. و آنچه اشاره کردیم، کافی است.\n\n[اختلاف مظاهر به واسطه اختلاف منازل]\n\nو از این منزل، تجلی شمسی (خورشیدی) است، زیرا تشبیه نزد علمای رسوم (ظاهر) در رفع شک از بیننده در مورد مرئی، به خورشید و ماه شب بدر واقع شده است. و این از برخی وجوه مقصود در این حدیث است. اما محققان علاوه بر این دانسته‌اند که مظاهر مختلف‌اند و تجلی (al-Tajallī) که به ماه شب بدر تشبیه شده، مظهر خاصی است، زیرا فرمود: «شب بدر» و نگفت: «در هنگام بدر کامل شدن آن». پس آن را به شب اضافه کرد، در حالی که من آن را در روز نیز با وجود خورشید، بدر کامل شهود (al-Shuhūd) می‌کنم. پس آن را به شب اضافه نکرد، مگر برای امری که محققان آن را دانسته‌اند، و این منزل، جایگاه سخن گفتن درباره آن نیست.\n\nاما این منزل، منزل تجلی (al-Tajallī) در خورشید را در بر می‌گیرد. زیرا حق (al-Ḥaqq) نزد محققان متعالی‌تر از آن است که در یک صورت دو بار یا برای دو شخص تجلی (al-Tajallī) کند. پس نزد حق (al-Ḥaqq) تکراری در امری نیست، به دلیل اطلاقی که او بر آن است و وسعت الهی. و تکرار به سوی تنگی و تقیید می‌انجامد. پس بدان که تجلی شمسی، یعنی تشبیه شده به خورشید، نزد ما «تجلی الأوسع» (تجلی گسترده‌تر) نامیده می‌شود، و آن تجلی‌ای است که انسان در آن از رؤیت خود فانی (al-Fanāʾ) نمی‌شود. و ما در ابتدای این کتاب در باب زمینی که از باقیمانده گِل آدم خلق شد، به آن اشاره کردیم.\n\nو این تجلی، مظهر ذاتی شگفت‌انگیزی است، و نسبت تجلی در آن به معلولش داده می‌شود نه به علتش، با وجود ظهور علت در معلولش به صورت عینی محقق و مجهول الکیفیه؛ مانند ظهور خورشید در روز، با اینکه روز معلول ظهور خورشید است، و نور چراغ از چراغی که در زوایای هستی گسترده شده است. چنین چیزی، شهود (al-Shuhūd) علت و معلولش با هم نامیده می‌شود. پس هر تجلی‌ای که تو را از خودت بی‌نیاز نکند، در این مرتبه است. و تنها به این دلیل «أوسع» (گسترده‌تر) نامیده شد که بیننده، رؤیت خود را شامل متجلی و متجلی‌فیه و برای او می‌سازد. و در غیر «أوسع»، جز او را شهود (al-Shuhūd) نمی‌کنی، نه خودت و نه غیر خودت را، و شهود (al-Shuhūd) خود و آنچه در آن هستی را نمی‌دانی، تا اینکه به سوی خود بازگردی و حجاب واقع شود. پس اگر حجاب کوبیده شود، آن تجلی مقید و تنگ خواهد بود، زیرا حجاب آن را مقید کرده است. اما «أوسع» در حجاب و غیر حجاب ظاهر می‌شود و شاهد میان دو صورت فرق می‌گذارد. و به همین دلیل در مورد آن‌ها گفته می‌شود: «آن‌ها را به قصرهایشان بازگردانید»، به اشاره به عجزشان، یعنی در آن محبوس می‌شوند.\n\nو در اینجا دریاهایی است که انواع جواهرات نفیس را در خود جای داده‌اند که جز هر غواص وسیع‌النفس و عاشق در غیب، آن را درک نمی‌کند. پس من مقصود از این تجلی را که این منزل در بر می‌گیرد، برای تو بیان کردم. و فواید آن بی‌شمار است؛ اگر بخواهیم آن‌ها را ذکر کنیم، در دیوانی نمی‌گنجد، زیرا برای آن تأبید در عالم علوی در دنیا و تأبید در عالم اخروی سفلی است. و هیچ تجلی‌ای نیست که در آنچه از آن حاصل می‌شود، میان دو ضد از درد و لذت جمع کند، مگر این تجلی. و آن مانند تجلی محبوب برای محب است که دیگری را در آغوش می‌گیرد و می‌بوسد. پس او از یک نظر در لذت است و از نظر دیگر در درد.\n\nو از این منزل، معرفت جود (بخشندگی) مقید به ترس و جزا، و مرتبه صدق (راستی) هرچند زشت باشد، و مرتبه کذب (دروغ) هرچند نیکو باشد، و غنای اکتسابی که همان غنای عرضی است، و نشانه‌های سعادت و نشانه‌های شقاوت شناخته می‌شود.\n\n[اختلاف سبب عطا]\n\nو بدان که اسباب عطا متفاوت است. برخی برای عوض می‌بخشند و این خرید و فروش نامیده می‌شود. در این حالت نیز جود (بخشندگی) وجود دارد، زیرا تو به خریدار نعمت داده‌ای از این جهت که فروشنده‌ای هستی که او غرض بزرگی در به دست آوردن آن دارد، و او نیز چیزی را به تو داده که از آن بی‌نیاز است. پس هر یک از آن دو با رساندن آنچه دیگری غرضی در به دست آوردن آن داشته، بر صاحبش جود کرده است، زیرا می‌توانست از آن جلوگیری کند. پس به این مقدار، از جهت کسی که به او عطا شده (اسم مفعول)، به باب جود ملحق می‌شود، نه از جهت عطا کننده (اسم فاعل).\n\nو گاهی انسان از این باب، به دلیل ترس بر آبرویش یا حلول دردهای حسی که به او می‌رسد، عطا می‌کند. پس گویی با آن عطا، ثنای نیکو، عافیت و امنیت را می‌خرد. پس این مانند اولی است، و فرق میان آن دو این است که آنچه در اولی با آن خرید، چیزی است که ممکن است در آن غرضی داشته باشد، اما در این حالت، اصلاً نمی‌تواند در درد و از بین رفتن عافیت و امنیت غرضی داشته باشد. و کسی از اصحاب ما که خلاف این را می‌گوید، اگر محقق باشد، مانند ابویزید در قولش:\n\n> **وکل مآربي قد نلت منها *** سوى ملذوذ وجدي بالعذاب‏**\n> (و به تمام خواسته‌هایم رسیدم، جز لذت یافتن در عذابم)\n\nپس او مقصود خود را که همان لذت است، آشکار کرده، و این همان است که ما گفتیم و به آن رفتیم. و اگر محقق نباشد، به معنای حقیقی از اصل طریق ما نیست، هرچند در صورت ظاهر شود، و ما با او سخنی نداریم.\n\nو برخی برای انعام و غیر آن عطا می‌کنند، و از این منزل جز آنچه به طور خاص ذکر کردیم، نیست. و از این باب است قول رسول خدا (ص): **«أحبوا الله لما يغذوكم به من نعمه»** (خدا را دوست بدارید به خاطر نعمت‌هایی که شما را با آن تغذیه می‌کند). پس ما را به محبت او به خاطر انعام و احسانش امر کرد. و آیا از جانب او سبحانه در حق بندگان، امر وجودی‌ای هست که از انعام به وجهی از وجوه خارج شود؟ اصحاب ما در این مورد اختلاف کرده‌اند.\n\nبرخی از آن‌ها بر این نظرند که انعام، عین وجود (al-Wujūd) اوست و به اغراض مربوط به آنچه حکم این موجودِ مورد انعام واقع شده با وجود، به او می‌دهد، توجه نمی‌کند. زیرا او بر درد، با وجود عینش انعام کرده است، هرچند کسی که با آن متألم می‌شود، با غرض او موافق نباشد. پس آن نعمت خدا بر خودش است. و اگر امر بر عموم نعمة بر همه با عین واحده متوقف می‌شد، اصلاً چیزی وجود نداشت، زیرا حقایق از آن ابا دارند. پس او در هر وجودی نعمتی دارد. پس کسی که مقامش ایثار است، در غرض خود با زهدش صادق است، اگر حکم درد بر او غالب شود، که خدا را بر آنچه بر درد از وجود عینش انعام کرده، شکر کند، پس از آنکه ایثار جناب خدا بر غرضش نبود، زیرا در مُلک کسی ظاهر شده که او را بر تعظیم و شکر خدا یاری می‌کند، چون او شکر درد را برای خدای متعال بر ایجاد عینش مشاهده می‌کند. پس بزرگ‌ترین شفیع برای کسی که حالش این است، نزد خدا، درد از موجودات و اسم «المُبلی» (آزمایش‌کننده) و «المُسقِم» (بیمارکننده) از الهیات است. پس نتیجه آن شفاعت، وجود لذت و کوچ درد است، یا با زوال سبب یا با بقای آن، و این خرق عادت خواهد بود. و این از بزرگ‌ترین اخلاقی است که انسان با آن شرافت می‌یابد. اما ایثار او در این مورد برای اراده خدا، هیچ کس نمی‌داند که چه خیری از اسم «المُرید» (اراده‌کننده) به او می‌رسد، جز خدایی که او را به این حال شریف اختصاص داده است.\n\nپس این همان صدق (راستی) با خدا در معامله است، هرچند زشت باشد. زیرا اگر آن درد بر دیگری نازل شود، این حالت باید همراه او باشد. و قبیح است بر او در حق دیگری که ببیند او خدا را بر آنچه بر آن دیگری از درد وارد شده، شکر می‌کند، به ویژه اگر محبوب او یا پیامبر یا رسولی باشد. و به واسطه آنچه این مقام از وجود عافیت در آن دیگری تولید می‌کند، قبحی که این محقق بر تن کرده بود، پوشیده می‌شود.\n\nاما کسی که عطا را در مثل این موطن که ذکر کردیم، ترک کرد، تو از آنچه برایت بیان کردیم، می‌دانی که سبب آن ترک چیست و مشهود (mashhūd) این ترک‌کننده در وقت ترک چیست. زیرا علم همه آن در آنچه مقرر کردیم، مندرج است. پس در مورد آن جستجو کن، زیرا اگر آن را بیاوریم، طولانی می‌شود. و ما کلید را به تو دادیم و قفل آن را برایت مشخص کردیم، پس هرچه می‌خواهی از آن بگشا.\n\nاما غنای اکتسابی در این باب، حکم آن است. زیرا انسان اگر از غیر بی‌نیاز شود، دلیل بر جهل او به حقایق است، زیرا غیر در او اثری ندارد. پس غنای خود را به غیر متعلق معلق کرده است. و اگر از خدای متعال بی‌نیاز شود، جاهل‌تر و جاهل‌تر است، زیرا با این وصف از علم محقق و از اسلام خارج شده است. پس هیچ کس زیانکارتر از او نیست، زیرا هیچ کس جاهل‌تر از او نیست. استغنا (بی‌نیازی) به حقیقت صحیح نیست. پس اگر غنا به کسی اضافه شود، این اضافه‌ای عرضی است نه ذاتی. و به همین دلیل، اسم «الغنی» (بی‌نیاز) برای حق (al-Ḥaqq) تعالی، وصفی سلبی است که افتقار به عالم را از او سلب می‌کند. و کسی که به چیزی محتاج شود، هرگز از آن بی‌نیاز نمی‌شود.\n\nپس استغنا در حقیقت، تنها به اسباب است از حیث نسبت‌ها، یعنی از حیث اینکه آن‌ها نسبت هستند. پس هر نسبتی که ضد خود را از تو ببرد، آن بر تو حاکم است. و آیا آن غنا نامیده می‌شود یا خیر؟ تو باید در آن نظر کنی بر حسب آنچه حقیقت آن نسبت به تو می‌دهد. اگر تو را از غیر خود بی‌نیاز کرد، پس آن غناست و تو به آن غنی هستی. و اگر تو را بی‌نیاز نکرد، پس نه آن غناست و نه تو به آن غنی هستی.\n\nمثلاً در مورد سیری، به صرف حقیقت آن گفته نمی‌شود که تو به واسطه آن از گرسنگی بی‌نیاز شده‌ای، از حیث حقیقت گرسنگی، زیرا گرسنگی مطلوب تو نیست تا با سیری از آن بی‌نیاز شوی. اما اگر گرسنگی، هنگامی که بر تو غالب شود، از صفا، رقت، لطافت، و تحقق به عبودیت و افتقار، آنچه را که حقیقتش می‌دهد، به تو بدهد، پس تو طالب آن هستی و از آن بی‌نیاز نیستی. پس اگر سیری، آنچه را که گرسنگی به تو داد، از همه آنچه ذکر کردیم، به تو بدهد، پس تو با سیری از گرسنگی بی‌نیاز شده‌ای، زیرا گرسنگی مطلوب بالذات نیست، بلکه مطلوب برای آن چیزی است که ذکر کردیم. پس اگر آن را در ضدش یافتیم، نیازی به آن نداریم، زیرا طبع آن را رد می‌کند، همان‌گونه که طبع آن را ایجاد می‌کند.\n\nو به همین دلیل، رسول خدا (ص) از گرسنگی پناه می‌برد و می‌فرمود: **«إنه بئس الضجيع»** (همانا آن بد همخوابه‌ای است). و این بدان سبب است که آن نیز، هرچند آنچه را ذکر کردیم، می‌دهد، اما قطعیت ندارد که آن افتقار به سوی خدا باشد، بلکه ممکن است برای غیر خدا باشد. به همین دلیل رسول خدا (ص) در مورد آن به طور عموم فرمود: «همانا آن بد همخوابه‌ای است.» زیرا شیوخ طریقت می‌گویند: اگر گرسنگی در بازار فروخته می‌شد، بر مرید لازم بود که آن را بخرد. و کسی از آن‌ها که به آنچه پیامبر (ص) نظر کرده، نظر کند، آن را از اشتباهات اهل طریقت می‌داند، مانند ابوعبدالرحمن سلمی، که اوراقی در مورد اشتباهات صوفیه نوشت، و این مذهب ماست. و گرسنگی حدی و مقداری دارد، و آن گرسنگی محقق است، برخلاف گرسنگی متخیل. و پناه بردن نبوی تنها از گرسنگی محقق واقع شده است، زیرا انسان با آن، اگر اختیاری باشد، عاصی شرع و ظالم به نفس خود می‌شود. و به همین دلیل، رسول خدا (ص) هرگز گرسنه نمی‌شد، مگر از روی اضطرار، و این حال علمای بالله است، زیرا صفت آن‌ها عدل است.\n\nو من آنچه را که در آن کفایت است، برای تو بیان کردم، زیرا آن تلویحی است که از تصریح بی‌نیاز می‌کند.\n\n[نشانه عمل سعادت این است که انسان در حضور با خدا به کار گرفته شود]\n\nاما اعمال سعادت، نشانه‌های آن‌ها این است که انسان در تمام حرکات و امکانات خود در حضور با خدا به کار گرفته شود، و مشاهده نسبت افعال به خدای متعال از حیث ایجاد و ارتباط ستوده آن‌ها باشد. اما ارتباط نکوهیده آن‌ها، اگر آن را به خدا نسبت دهد، سوء ادب کرده و علم تکلیف را نادیده گرفته است، و اینکه تکلیف به چه کسی تعلق گرفته و مکلفی که به او گفته شده «انجام بده» کیست؟ زیرا اگر مکلف به هیچ وجه نسبتی به فعل نداشت، به او گفته نمی‌شد «انجام بده»، و شریعت تماماً عبث می‌بود، در حالی که شریعت در ذات خود حق است. پس ناگزیر است که بنده نسبتی صحیح به فعل داشته باشد، و از آن نسبت به او گفته شده «انجام بده». و متعلق آن اراده نیست، مانند کسانی که قائل به کسب هستند، بلکه آن سببی اقتداری لطیف است که در اقتدار الهی که ذلیل آن را می‌دهد، درج شده است؛ مانند درج شدن نور ستارگان در نور خورشید.\n\nپس با دلیل می‌دانی که ستارگان نوری دارند که بر زمین گسترده شده است، اما ما آن را حساً درک نمی‌کنیم به دلیل سلطه نور خورشید. همان‌گونه که حس در افعال بندگان می‌دهد که فعل حساً و شرعاً برای آن‌هاست، و اقتدار الهی در آن مندرج است که عقل آن را درک می‌کند و حس آن را درک نمی‌کند؛ مانند درج شدن نور خورشید در نور ستارگان. زیرا نور ستارگان، عین نور خورشید است و ستارگان مَجلی (محل تجلی) دارند. پس تمام نور، خورشید است، و حس نور را برای ستارگان قرار می‌دهد و می‌گوید: نور ستارگان در نور خورشید درج شده است. و در حقیقت، جز نور خورشید در آنجا نیست، پس نورش در خودش درج شده است، زیرا نور دیگری در آنجا نبود. و آینه‌ها (مرایا) اگرچه اثری دارند، اما آن اثر از نور آن‌ها نیست. بلکه نور از این جهت که بدون واسطه در هستی است، اثری دارد، و اثر دیگری در آینه تجلی‌اش (al-Tajallī) دارد، با حکمی که با حکم آن بدون آن واسطه متفاوت است. پس نور خورشید هنگامی که در ماه کامل تجلی (al-Tajallī) می‌کند، حکمی را می‌دهد که بدون ماه کامل نمی‌دهد، شکی در این نیست. همچنین اقتدار الهی هنگامی که در بندگان تجلی (al-Tajallī) می‌کند و افعال از خلق ظاهر می‌شود، اگرچه با اقتدار الهی است، اما حکم متفاوت می‌شود، زیرا به واسطه این مَجلی است که مانند آینه برای تجلی (al-Tajallī) او بوده است. و همان‌گونه که نور شمسی در حس به ماه کامل نسبت داده می‌شود و فعل برای نور ماه کامل است در حالی که برای خورشید است، همچنین فعل در حس به خلق نسبت داده می‌شود، در حالی که فعل در نفس الأمر (حقیقت امر) برای خداست. و به دلیل اختلاف اثر، حکم نوری در اشیاء تغییر می‌کند. پس آنچه نور به واسطه ماه کامل می‌دهد، خلاف چیزی است که به خودی خود بدون واسطه می‌دهد. همچنین حکم در افعال بندگان متفاوت می‌شود. و از اینجا شناخته می‌شود که تکلیف بر چه کسی متوجه شده و به چه کسی تعلق گرفته است.\n\nو همان‌گونه که عقلاً می‌دانی که ماه در نفس خود چیزی از نور خورشید ندارد و خورشید با ذات خود به آن منتقل نشده، بلکه برای آن مَجلی داشته است، و صفت از موصوف خود و اسم از مسمای خود جدا نمی‌شود؛ همچنین بنده چیزی از خالق خود در خود ندارد و در او حلول نکرده است، بلکه او تنها مَجلی و مظهر برای اوست. و همان‌گونه که نور خورشید در حس به ماه کامل نسبت داده می‌شود، همچنین اقتدار به خلق نسبت داده می‌شود حساً، و حال همان حال است. و اگر امر میان خورشید و ماه کامل با این مرتبه از خفا باشد و همه آن را ندانند، پس گمان تو درباره امر الهی در این مسئله با خلق چیست؟ پنهان‌تر و پنهان‌تر است. پس کسی که بر این علم واقف شود، از بالاترین نشانه‌های سعادت است، و فقدان چنین چیزی از نشانه‌های شقاوت است. و مقصود از این، سعادت ارواح و شقاوت معنوی آن‌هاست. اما سعادت و شقاوت حسی، نشانه‌های آن‌ها اعمال مشروع با شروط آن‌هاست، که همان اخلاص است. خداوند متعال می‌فرماید: **«أَلَا لِلَّهِ الدِّينُ الْخَالِصُ»** (آگاه باشید که دین خالص از آن خداست). و فرمود: **«وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ»** (و امر نشدند مگر برای اینکه خدا را بپرستند در حالی که برای او اخلاص ورزند). و این مقدار از نشانه‌ها به طور خلاصه کافی است. و خداوند توفیق‌دهنده است و پروردگاری جز او نیست.\n\n[اما ناامیدی کسی که بر اموری تکیه کرده که خداوند آن‌ها را برای اعتماد قرار داده است]\n\nاما ناامیدی کسی که بر اموری تکیه کرده که خداوند آن‌ها را برای اعتماد قرار داده است، و اینکه چرا صاحب آن ناامید می‌شود با وجود اینکه حق (al-Ḥaqq) آن‌ها را برای این امر و اهل آن قرار داده است؛ ای برادر ولی، بدان که اموری که حق (al-Ḥaqq) آن‌ها را برای اعتماد قرار داده، از او خارج نشده‌اند، اما این شخص ناامید آن‌ها را اربابانی جز خدا قرار داده و بر ذات آن‌ها تکیه کرده، نه بر کسی که آن‌ها را قرار داده است. پس جهل او را در بر می‌گیرد، همان‌گونه که پیش‌تر ذکر کردیم. پس آثار ظاهری از نور خورشید در آینه ماه کامل، اگر بیننده در آن نظر کند و بر خورشید در آن تکیه کند، از حیث این مَجلی خاص که خدا اثر را به آن مرتبط کرده است، این شخص ناامید نمی‌شود، زیرا حق امر را به آن داده است. و ماه کامل هرگز در حق این شخص کسوف نمی‌کند. و کسی که ناامید می‌شود، کسی است که ماه کامل در حق او کسوف می‌کند و در تاریکی جهل خود باقی می‌ماند، با وجود ذات آینه قمری. پس این شخص ناامید با آن مظهر در تاریکی‌هاست. زیرا ماه در حق این شخص که بر آن تکیه می‌کرد، محجوب شده است. **«إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ»** (همانا شما و آنچه جز خدا می‌پرستید، هیزم جهنم هستید)، و آن تاریکی است. زیرا تاریکی، جهنم است. و کدام تاریکی و کدام جهنم بزرگ‌تر از جهل است؟\n\nو خداوند در قول خود: **«أَوْ كَظُلُمَاتٍ»** (یا مانند تاریکی‌ها) به آن تشبیه کرده و فرموده است: **«ظُلُمَاتٌ بَعْضُهَا فَوْقَ بَعْضٍ»** (تاریکی‌هایی که برخی بر روی برخی دیگر است)، و آن جهل بر روی جهل است. و آن کسی است که جاهل است و نمی‌داند که جاهل است. پس از او نفی کرد که نزدیک به دیدن دست خود شود، پس چگونه آن را ببیند؟ و دست را در اینجا وارد کرد نه غیر آن، زیرا دست محل وجود اقتدار است و ایجاب به واسطه آن واقع می‌شود. یعنی اگر اقتدار خود را بیرون آورد تا آن را ببیند، به دلیل تاریکی جهل نزدیک به دیدن آن نشد، زیرا اگر آن را می‌دید، آن را عین اقتدار الهی می‌دید. آیا نمی‌بینی که وقتی آن را در نور که همان علم است، بیرون می‌آورد، دست خود را می‌بیند که همان اقتدار اوست؟ پس می‌داند که اقتدار کونی، اقتدار حق (al-Ḥaqq) است، به دلیل برطرف شدن تاریکی‌های متراکمی که برخی بر روی برخی دیگر بودند. و به همین دلیل، تشبیه به شدیدترین تاریکی‌ها واقع شده است. زیرا تاریکی جو با آن تاریکی دریا همراه می‌شود، و با آن تاریکی موج همراه می‌شود، و با آن تاریکی تراکم موج همراه می‌شود، و با آن تاریکی ابری که انوار ستارگان را می‌پوشاند، همراه می‌شود. پس نوری باقی نمی‌ماند که نه در عین خود و نه در مَجلی‌ای از مَجلی‌هایش ظهوری داشته باشد. پس تاریکی شب، تاریکی طبع است؛ و تاریکی دریا، تاریکی جهل است که همان فقدان علم است؛ و تاریکی فکر، تاریکی موج است؛ و تاریکی موج متراکم، تاریکی تداخل افکار در شبهات است؛ و تاریکی ابر، تاریکی کفر است. پس کسی که این تاریکی‌ها را جمع کند، زیانی آشکار کرده است. و این حالت مُعَطِّله (منکران صفات الهی) است و نه غیر آن‌ها.\n\n[علم افصاح از درجات قرب الهی از حضرت لسن (زبان)]\n\nاما آنچه این منزل از علم افصاح از درجات قرب الهی از حضرت لسن (زبان) در بر می‌گیرد، بدان که آن معرفت (al-Maʿrifa) علم شارع است که از جانب خدا ترجمه می‌کند و ما را به ایمان به محکم و متشابه آن امر کرده است و باید تمام آنچه را که آورده بپذیریم. زیرا اگر چیزی از آن را به گونه‌ای تأویل کنیم که مراد متکلم در نفس الأمر (حقیقت امر) باشد، درجه ایمان از ما زائل می‌شود، زیرا دلیل بر خیر حکم می‌کند و حکم ایمان را باطل می‌سازد. و علم صحیح از مؤمن می‌آید که به صاحب این دلیل می‌گوید: اما قطعیت تو بر اینکه آنچه نظر تو به تو داده، مقصود کسی است که با آن افصاح کرده، عین جهل و فقدان علم صحیح است، هرچند با علم مصادف شود، در حالی که ایمان از تو زائل شده است. و سعادت به ایمان و به علم صحیح از روی علم مرتبط است. و علم صحیح آن است که ایمان با آن باقی بماند. پس بر عارف (al-ʿĀrif) است که راه سعادت را به نیابت از خدای متعال در خلقش بیان کند، مانند نیابت ماه از خورشید در رساندن نور. پس پیامبران مرسل (ع) مترجمان از حق (al-Ḥaqq) هستند، و ورثه در درجه آن‌ها هستند به واسطه فهمی که خداوند در مورد آنچه رسولان از کتاب و سنت آورده‌اند، به آن‌ها می‌دهد. پس این است علم افصاح به اختصار.\n\n[اجتماع دو ضد در علم الهی، سبب الفت گرفتن دو هوو است]\n\nاما علم الفت گرفتن دو هوو (ضرتان)، بدان که از ابوسعید خراز پرسیده شد: خدا را به چه شناختی؟ گفت: به جمع کردن او میان دو ضد. و این آیه را تلاوت کرد: **«هُوَ الْأَوَّلُ وَالْآخِرُ»** (او اول و آخر است)، یعنی او اول کسی است که آنچه را که آخر است، تعیین کرد، و ظاهر است از حیث آنچه باطن است، زیرا حیثیت در حق او یکی است. و هر دو ضدی، دو هوو هستند. و این از قدرت عقل درک نمی‌شود، زیرا قدرت عقل آن را نمی‌دهد. بلکه این از مقامی درک می‌شود که ورای طور عقل است؛ مقامی که از آن طور، واجبات، وجوب خود، و جایزات، جواز خود، و مستحیلات، امتناع خود، و احدیات، احدیت خود را دریافت کردند. پس اوست که واحد را واحد قرار داد، همان‌گونه که واجب را با دادن وجوب به آن، واجب قرار داد. و در قدرت عقل نیست که آنچه را ذکر کردیم، از حیث فکرش درک کند. پس این علم صحیح الهی است نه عقلی. پس هنگامی که دو ضد در علم الهی جمع شدند، دو هوو با هم الفت گرفته و یکدیگر را دوست داشته‌اند، زیرا برای یک عین بوده‌اند. پس در این فصل با نور ایمان تدبر کن، نه با نور عقل، زیرا عقلاً مردود و غیر قابل قبول است. و همان‌گونه که در قدرت بصر (بینایی) نبود که معقولات را درک کند و از حد خود تجاوز نکرد، همچنین در قدرت عقل نیست که آنچه را بصر به ذات خود بدون واسطه بصر می‌دهد، درک کند. پس هنگامی که قدرت عقل عاجز است که به تنهایی علم مبصرات را از حیث مبصر بودنشان درک کند، در حالی که آن‌ها مخلوق‌اند و قدرت بصر نیز مخلوق است، پس چگونه می‌تواند آنچه را که از طورش خارج است و در نسبت به حق (al-Ḥaqq) بالاتر است، درک کند، در حالی که از درک آنچه از طورش خارج است و در زعم او درجه پایین‌تری دارد (یعنی حس)، عاجز مانده است؟ و کسی که در امری به مخلوقی مانند خود محتاج شود، به خالق محتاج‌تر است. و این اشاره در مورد آنچه عارفان (al-ʿĀrifūn) از آن می‌دانند، کافی است.\n\n[اصطلام (غرق شدن) آتشی است که بر قلب‌های محبان وارد می‌شود و هرچه جز محبوب بیابد، می‌سوزاند]\n\nاما معرفت (al-Maʿrifa) اصطلام (al-Iṣṭilām) لازم و صفت کسی که مقام این اصطلام را از مقربین دریافت کرده است، در مقایسه با امثالشان که آن را دریافت نکرده‌اند، بدان که اصطلام آتشی است که بر قلب‌های محبان وارد می‌شود و هرچه جز محبوب بیابد، می‌سوزاند. و گاهی در اوقاتی، صورت محبوب را از نفس محب می‌برد، و آن زمانی است که محب می‌خواهد محبوب خود را تخیل کند، اما به دلیل قدرت سلطه سوزش شعله آتش عشق، نمی‌تواند آن را تخیل کند و صورتش را برپا دارد. پس در آن حال به او «مصطلم» (غرق شده) گفته می‌شود. و این همان است که گوینده با این شعر اراده کرده است:\n\n> **أودع فؤادي حرقا أودع *** ذاتك توذى أنت في أضلعي‏**\n> (در قلبم سوزشی بگذار، بگذار؛ ذات تو در سینه‌ام آزار می‌بیند)\n\n> **وارم سهام الحب أو كفها *** أنت بما ترمي مصاب معي‏**\n> (و تیرهای عشق را پرتاب کن یا بازدار؛ تو با آنچه پرتاب می‌کنی، همراه من مصیبت‌زده‌ای)\n\n> **موقعها القلب وأنت الذي *** مسكنه بذاك الموضع‏**\n> (جایگاه آن قلب است، و تو کسی هستی که مسکنش در آن موضع است)\n\nو از این حال است که قیس بن ملوح، مجنون بنی عامر، صاحب لیلی، گفت. لیلی نزد او آمد در حالی که او مصطلم بود و یخ برمی‌داشت و بر سینه‌اش می‌انداخت و حرارت قلبش فوراً آن را آب می‌کرد، و او لیلی لیلی فریاد می‌زد و او را می‌طلبید به دلیل فقدان صورتش از خیالش. پس لیلی او را صدا زد: ای قیس، من مطلوب تو هستم، من لیلی هستم. اما در نفس او صورت متخیلی از لیلی نبود که او را با آن بشناسد. با این حال، وقتی نام او را شنید، به او گفت: از من دور شو، زیرا عشق تو مرا از تو مشغول کرده است.\n\nپس این حال اصطلام است، و آن وصفی لازم برای حضرت الهی است که تأثیرگذار است. و برای هر اسم الهی که جمال حق (al-Ḥaqq) در آن شهود (al-Shuhūd) شود، میان بنده و تکییف حق (al-Ḥaqq) حائل می‌شود و هر صورتی را که بنده ضبط کند یا تخیل کند، از بین می‌برد. و به همین دلیل پیامبر (ص) فرمود: **«ألظوا بيا ذا الجلال والإكرام»** (بر «یا ذالجلال و الاکرام» مداومت کنید)، از «الإلظاظ» که همان مداومت است. و جلال را با اکرام قرین ساخت. و جلال هرگز در نبویات نیامده، مگر اینکه اکرام همراه آن بوده است، تا رسم بنده باقی بماند و عین او از بین نرود. پس جلال که همان جلال جمال است، هیبت را بر تو می‌پوشاند، پس از مقام می‌ترسی. و این همان است که محب و عارف (al-ʿĀrif) در نفس خود از تعظیم محبوب می‌یابد، پس جناب او را بر هر چیزی ترجیح می‌دهد. و اکرام خدا به او این است که او را بر هر چیزی ترجیح می‌دهد.\n\nو اصطلامی هست که در وقت زائل می‌شود، و آن چیزی است که از مشاهده محبوب در صورت خیال بر قلب وارد می‌شود. پس تا زمانی که این خیال باقی است، اصطلام او نیز باقی است. و جلال این صورت را از نفس محو می‌کند، به دلیل غیرت از مقید شدن او به صورتی، در حالی که او اطلاق دارد. پس اصطلام آن صورت مقید با زوال آن زائل می‌شود. و اصطلام لازم باقی می‌ماند که اثر جلال در نفس است. پس محب، صورت متخیل در نفس خود را که به او می‌گوید: «من محبوب تو هستم»، تکذیب می‌کند و از آن روی می‌گرداند، به دلیل اجلال محبوبش از اینکه او را مقید کند، به خاطر معرفتش (al-Maʿrifa) به اینکه محبوبش مقید نمی‌شود. به همین دلیل در نفس خود می‌سوزد، زیرا می‌خواهد یا آرزو می‌کند که آنچه را که ضبط نمی‌شود، ضبط کند تا با آن متنعم شود.\n\nو به همین دلیل، علم شریف‌تر از محبت بود، و خداوند متعال پیامبرش (ص) را امر کرد که از او طلب زیادت در آن کند، زیرا آن عین ولایت الهی است. خداوند بندگانش را به واسطه آن ولایت می‌کند و به واسطه آن اکرامشان می‌کند و به واسطه آن می‌دانند که او شناخته نمی‌شود. اما محب اگر عارف (al-ʿĀrif) نباشد، در نفس خود صورتی خلق می‌کند که در آن سرگردان می‌شود و عاشق آن می‌گردد. پس او جز کسی را که تحت احاطه اوست، نپرستیده و مشتاق نشده است. و جز معرفت (al-Maʿrifa) او را از این مقام زائل نمی‌کند. پس حیرت عارف (al-ʿĀrif) در جناب الهی، بزرگ‌ترین حیرت‌هاست، زیرا او خارج از حصر و تقیید است:\n\n> **تفرقت الظباء على خداش *** فما يدري خداش ما يصيد**\n> (آهوان بر خداش پراکنده شدند، و خداش نمی‌داند چه چیزی را شکار می‌کند)\n\nپس او تمام صور را دارد و صورتی ندارد که او را مقید کند. و به همین دلیل پیامبر (ص) می‌فرمود: **«اللهم زدني فيك تحيرا»** (خداوندا، حیرت مرا در خودت زیاد کن)، زیرا آن مقام اعلی، منظر اجلی، مکانت زلفی، مظهر ازهی و طریقت مثلی است. و از این حضرت، انذار صادر شد، پس قرار نبود و بوار (هلاکت) در ساحت کفار فرود آمد. پس هیچ پرده و حجابی باقی نماند، مگر اینکه این مشهد اسنی آن را پاره کرد و درید. زیرا پرده، مستور را مقید می‌کند و حجاب، محجوب را محدود می‌سازد، در حالی که ذات او حدی ندارد و جلال او تقییدی ندارد. پس چگونه چیزی او را بپوشاند یا چشمی از او غایب شود؟ **«تَجْرِي بِأَعْيُنِنَا جَزَاءً لِمَنْ كَانَ كُفِرَ»** (که زیر نظر ما روان بود، جزایی برای کسی که کفر ورزیده بود).\n\nپس کسی که گفت: **«لَيْسَ كَمِثْلِهِ شَيْءٌ»** (چیزی مانند او نیست)، راست گفت، زیرا موجودی نیست که چشمی از او غایب شود و «کجا» او را محصور کند، مگر خدا. پس تمام صور حسی و معنوی، مظاهر او هستند. پس اوست که از هر صورتی سخن می‌گوید، نه در هر صورتی. و اوست که با هر چشمی دیده می‌شود، و اوست که با هر گوشی شنیده می‌شود. و او کسی است که کلامی از او شنیده نشد که تعقل شود، و بصری به او ننگریست که محدود شود، و مظهری نداشت که مقید شود. پس «هو» (او) برای او لازم است: **«لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ»** (هیچ معبودی جز او نیست، عزیز حکیم). **«يَمْحُو»** (محو می‌کند)، و او عین چیزی است که محو می‌کند. و فرمود: **«وَيُثْبِتُ»** (و اثبات می‌کند)، و او عین چیزی است که اثبات می‌کند. پس **«لَيْسَ كَمِثْلِهِ شَيْءٌ»** (چیزی مانند او نیست) در این حکم. و علم صحیح موهوب به این برای او شهادت داد.\n\nپس علم دلیل آن را نفی می‌کند، زیرا چیزی از آن در دست او نیست و به جز صفات سلب و تنزیه، تعلقی ندارد. و علم کشف (al-Kashf) آن را اثبات می‌کند و باقی می‌گذارد و مظهری برای او آشکار نمی‌شود، مگر اینکه او را در آن ببیند. و هر دو علم صحیح هستند. پس او برای هر نیروی ادراک‌کننده‌ای بر حسب آن است، تا به آن بفهماند که از منصب خود زائل نشده و از علم به خدا جز آنچه در نفس خود بر آن است، به دست نیاورده است. پس ذاتش شناخته شد و نفسش وصف شد. پس با ظهورش در آن‌ها، از تقیید و حدود خارج شد تا او معبود باشد. و حکم کرده است که جز او پرستیده نشود. پس بت‌ها و اوثان در زعم کفار، مظاهر او بودند. پس نام «إله» (معبود) را بر آن‌ها نهادند. پس جز إله را نپرستیدند. و او کسی است که آن مظهر بر او دلالت کرد. پس حوائج آن‌ها را برآورده کرد و سیرابشان نمود و مجازاتشان کرد، زیرا آن جناب الهی را در این صورت جمادی احترام نکردند. پس آن‌ها شقاوتمند هستند، هرچند درست گفته باشند که جز خدا را نپرستیده‌اند. پس به این سریان وجودی (al-Wujūdī) در این مظاهر بنگر که چگونه قومی با آن سعادتمند شدند و قومی دیگر شقاوتمند.\n\nبرخی گفتند: هرچه در نفس خود تخیل کنی یا وهمت آن را صورت دهد، خدا خلاف آن است. پس راست گفت و دروغ گفت، و آشکار کرد و پنهان نمود. و دیگری گفت: حق (al-Ḥaqq) مدلول دلیل نیست و معقول عقول نیست. عقول با افکارشان او را به دست نمی‌آورند و معارف (al-Maʿārif) با اذکارشان او را فرود نمی‌آورند. پس هنگامی که ذکر شود، به واسطه او ذکر می‌شود و به واسطه او فکر می‌شود و تعقل می‌شود. پس او عقل عاقلان، فکر متفکران، ذکر ذاکران و دلیل دلالت‌کنندگان است. اگر از چیزی خارج می‌شد، وجود نداشت، و اگر در چیزی بود، وجود نداشت.\n\nپس من اثر اصطلام لازم را برای تو بیان کردم، و اینکه علما همان مقربانی هستند که این مشهد احمی و این معرفت (al-Maʿrifa) عظمی را درک کرده‌اند. و غیر از آن‌ها، برای او علامتی نصب شده که آن را می‌پرستد و حقیقتی را شهود (al-Shuhūd) می‌کند که همان چیزی است که اعتقادش بر آن منطوی شده، به دلیل دلیلی که نزد او اقامه شده یا از صاحب دلیلی تقلید کرده است. پس او نزد خود به مطلوبش دست یافته و بر معبودش اعتکاف کرده و به او آرام گرفته و از حیرت آسوده شده است. و به آنچه با او در تناقض است، کفر ورزیده است. و بدون شک به غیر خود که اعتقادی غیر از اعتقاد او دارد، کفر ورزیده است. به همین دلیل، برخی از آن‌ها به برخی دیگر کفر می‌ورزند و برخی از آن‌ها برخی دیگر را در دنیا و آخرت لعنت می‌کنند. و عالم محقق لما هو الأمر در عین آن، در ذات خود و در عالم، ظاهر و باطن آن، تفرج می‌کند. پس او عین مصیب است و او مَثَل منزه منصوص علیه است که حق (al-Ḥaqq) نفی کرده که با قولش: **«لَيْسَ كَمِثْلِهِ شَيْءٌ»** (چیزی مانند او نیست)، مماثل یا مقابل داشته باشد. یعنی چیزی مانند مَثَلِ مَثَلِ او نیست. پس کاف، کاف صفت است و زائد نیست، همان‌گونه که برخی می‌بینند. پس برخی از علما در این مورد بر این نظرند که اگر برای او مَثَلی فرض می‌شد، آن مَثَل با آن مَثَل مماثل نبود، پس سزاوارتر است که خود او مماثل نداشته باشد. و نزد برخی دیگر، نفی مَثَل از مَثَل محققی است که ذکر کردیم. از جنید درباره معرفت (al-Maʿrifa) و عارف (al-ʿĀrif) پرسیده شد، گفت: «رنگ آب، رنگ ظرف آن است.» پس آب و ظرف را اثبات کرد، و حرف و معنی و ادراک را اثبات کرد و ادراک را نفی کرد. پس فرق گذاشت و جمع کرد. پس چه نیکو گفت. و بعد از آنکه مرتبه اصطلام لازم را برای تو بیان کردم، آنچه از این منزل باقی مانده است را بیان می‌کنیم، و آن علم به جود الهی خارج از وجوب است، و اینکه آیا حق (al-Ḥaqq) عوضی است که با عمل خاصی به دست آید یا خیر.\n\nبدان که برای خدا جود (بخشندگی) مقید و جود مطلق است. زیرا او سبحانه برخی از جود خود را به وجود (al-Wujūd) مقید کرده و فرموده است: **«كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ»** (پروردگارتان رحمت را بر خود واجب کرده است)، یعنی رحمت را بر خود واجب و فرض کرده است برای قومی خاص که با عمل خاصی وصف شده‌اند، و آن این است که: **«مَنْ عَمِلَ مِنْكُمْ سُوءاً بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَحِيمٌ»** (هر کس از شما به نادانی کار بدی انجام دهد، سپس بعد از آن توبه کند و اصلاح نماید، پس او آمرزنده و مهربان است). پس این جود (بخشندگی) مقید به وجوب است برای کسی که صفتش این است، و آن عوضی است برای این عمل خاص. و توبه و اصلاح از جود مطلق است. پس جود خود را با جود خود جلب کرد. پس جز او بر او حکم نکرد و غیر او او را مقید نساخت. و بنده میان دو جود، عرضی زائل و عرضی متمثل است.\n\nسهل بن عبدالله، عالم و امام ما، گفت: ابلیس را دیدم، او را شناختم و او نیز دانست که من او را شناخته‌ام. پس مناظره‌ای میان ما درگرفت. او به من گفت و من به او گفتم، و سخن میان ما بالا گرفت و نزاع طولانی شد، به طوری که من ایستادم و او ایستاد، و من متحیر شدم و او متحیر شد. از آخرین سخنان او به من این بود: ای سهل، خداوند عزوجل می‌فرماید: **«وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ»** (و رحمت من همه چیز را فرا گرفته است). پس عمومیت دارد. و بر تو پوشیده نیست که من بدون شک «شیء» هستم، زیرا لفظ «کل» احاطه و عموم را اقتضا می‌کند، و «شیء» نکره‌ترین نکره‌هاست. پس رحمت او مرا فرا گرفته است. سهل گفت: به خدا سوگند، او مرا لال کرد و با لطافت سیاقش و پیروزی‌اش با چنین آیه‌ای، مرا متحیر ساخت. و از آن چیزی فهمید که ما نفهمیدیم، و از آن و دلالتش چیزی دانست که ما ندانستیم. پس متحیر و متفکر ماندم و شروع به تلاوت آیه در نفس خود کردم. هنگامی که به قول خدای متعال در آن رسیدم: **«فَسَأَكْتُبُهَا»** (پس آن را خواهم نوشت)، خوشحال شدم و تصور کردم که بر حجتی پیروز شده‌ام و بر او با چیزی که پشتش را می‌شکند، غلبه کرده‌ام. و به او گفتم: ای ملعون، خداوند آن را به اوصاف مخصوصی مقید کرده که آن را از آن عموم خارج می‌کند. پس او گفت: **«فَسَأَكْتُبُهَا»**. ابلیس تبسم کرد و گفت: ای سهل، گمان نمی‌کردم که جهل تو به این حد برسد، و گمان نمی‌کردم که تو اینجا باشی. ای سهل، آیا نمی‌دانی که تقیید صفت توست نه صفت او؟ سهل گفت: به سوی خود بازگشتم و آب دهانم در گلویم گیر کرد و آب در حلقم ماند. و به خدا سوگند، جوابی نیافتم و راهی را به روی او نبستم. و دانستم که او در مطلبی طمع کرده است. و او رفت و من رفتم. و به خدا سوگند، بعد از این نمی‌دانم چه خواهد شد، زیرا خداوند سبحان به چیزی که این اشکال را برطرف کند، تصریح نکرده است. پس امر نزد من بر مشیئت او در خلقش باقی ماند. در این مورد بر او حکم نمی‌کنم، نه به مدتی که پایان یابد و نه به مدتی که پایان نیابد.\n\nای برادر من، بدان که من آنچه را که از ابلیس از حجت‌ها حکایت شده، دنبال کردم، و کسی را کوتاه‌حجت‌تر و جاهل‌تر از او در میان علما ندیدم. اما هنگامی که بر این مسئله که سهل بن عبدالله از او حکایت کرد، واقف شدم، تعجب کردم و دانستم که او علمی دارد که جهلی در آن نیست. پس او استاد سهل در این مسئله است. اما ما آن را جز از خدا نگرفتیم. پس ابلیس در این مسئله و نه در غیر آن، بر ما منتی ندارد، و همچنین امیدوارم در باقیمانده عمرمان. و این مسئله اصلی است نه فرعی. پس ابلیس منتظر رحمت خداست که از عین منت و جود مطلق به او برسد، همان جودی که خداوند سبحانه به واسطه آن آنچه را که واجب کرد، بر خود واجب کرد، و به واسطه آن بر کسی که توبه کرد و اصلاح نمود، توبه کرد. پس **«فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ»** (پس حکم از آن خداست، بلندمرتبه بزرگ)، از تقیید در تقیید. پس بر خدا واجب نیست، مگر آنچه را که بر خود واجب کرده است.\n\nپس عارف (al-ʿĀrif) نیز در جود خود چنین است؛ مقید نمی‌شود و عطایی را که بر او واجب باشد، نمی‌دهد. زیرا وجوب عطا تنها سببش مُلک است، و عارف (al-ʿĀrif) با خدا مُلکی ندارد. پس مالی که در دست عارف (al-ʿĀrif) است، برای خداست و برای او نیست. و زکات در عین مال بر رب المال واجب است، و رب المالی جز او سبحانه ندارد. پس او بر خود واجب کرده است که از این مال، مقدار معینی را خارج کند که حق طایفه‌ای از خلق اوست، و آن را بر خود در این مالی که در دست عارف (al-ʿĀrif) است، واجب کرده است. پس عارف (al-ʿĀrif) حق آن طایفه را از این مال به نیابت از رب المال خارج می‌کند، همان‌گونه که وصی به حکم وکالت از یتیم خارج می‌کند، زیرا او ولی اوست. و از این باب، طایفه‌ای در کشف (al-Kashf) این مقام لغزیدند و زکات مالی را که در دست داشتند، نپرداختند. و من جماعتی از آن‌ها را دیدم که با وجود اینکه بیشتر از زکات خارج می‌کردند، اما آن را به عنوان زکات نمی‌پرداختند و می‌گفتند: خداوند متعال چیزی بر او واجب نیست، و این مال برای خداست و برای من نیست و دست من در آن عاریه است. و من در این مسئله حنفی مذهب هستم. پس همان‌گونه که بر ولی یتیم واجب نیست که زکات را از مال یتیم خارج کند، زیرا یتیم مخاطب نیست، پس من آن را به عنوان زکات نمی‌پردازم. پس خداوند تو را موفق بدارد، جود الهی و تقسیم آن را برای تو بیان کردم.\n\nاما اینکه آیا حق (al-Ḥaqq) عوضی برای عمل خاصی هست یا خیر؟ بدان که مالک بن انس (رضی الله عنه) در مورد مردی که هدیه‌ای به دیگری می‌دهد و سپس گیرنده آن را مکافات نمی‌کند و او نزد حاکم طلب مکافات می‌کند، می‌گوید: بر حاکم است که امر را بر او تفصیل دهد، زیرا در آن اجمال است، تا حکم بر تعیین مترتب شود. پس به او می‌گوید: هنگامی که این هدیه را دادی، چه چیزی را با آن طلب کردی؟ آیا جزایی از بهشت را طلب کردی، یا معاوضه‌ای در دنیا، یا وجه خدا را طلب کردی؟ اگر خصم گفت: اجر در آخرت از بهشت یا معاوضه در دنیا را طلب کردم، بر عطا کننده حکم می‌شود که عین آنچه را که گرفته، بازگرداند، اگر عین آن باقی باشد. و اگر عین از بین رفته باشد، بهای آن را بر او حکم می‌کند، با اختلافی که در این مورد هست که آیا قیمت شیء در زمان عطا معتبر است یا در زمان قضاوت. و اگر گفت: آن را تنها برای طلب وجه خدا دادم، حاکم در این مورد چیزی به نفع او حکم نمی‌کند و می‌گوید: آنچه را که با هدیه‌ات قصد کردی، در دست طرف مقابلت نیست. پس از یک جهت آن را عوضی برای آن اثبات کرد، در آنچه ظاهر می‌شود، زیرا مالک به بیش از این تصریح نکرده است. و از جهتی نفی می‌کند که عوض باشد، زیرا چیزی از مخلوقات او در قدر با او مماثل نیست، و همه نعمت او هستند. جز اینکه معاوضه بر خداست برای این عطا کننده در سرای آخرت، به چیزی که مناسب هدیه او باشد. و اگر بر آن بیفزاید، از باب منت است. و گفته شده است:\n\n> **لكل شي‏ء إذا فارقته عوض *** وليس لله إن فارقت من عوض‏**\n> (برای هر چیزی اگر از آن جدا شوی، عوضی هست؛ و برای خدا اگر از او جدا شوی، عوضی نیست)\n\nو تحقیق در این مسئله این است که حق (al-Ḥaqq) از حیث ذات و وجودش (al-Wujūd)، چیزی با او مقاومت نمی‌کند و صحیح نیست که او اراده شود یا برای ذاتش طلب شود. بلکه طالب، معرفت (al-Maʿrifa) یا مشاهده یا رؤیت او را طلب می‌کند و مرید آن را اراده می‌کند. و این همه از اوست و عین او نیست. و چون از اوست و عین او نیست، پس صحیح است که عوض باشد. پس عمل او در دنیا که همان حضور با خداست در قول: **«اعبد الله كأنك تراه»** (خدا را چنان بپرست که گویی او را می‌بینی)، جزای این عمل نزد خدا، رؤیت او خواهد بود، و آن بالاترین منازل است. پس آن برای حاضر در اینجا در عملش، جزا است، و برای غیر حاضر، زیادت و منت است. پس نزد این شخص عوض نیست، و نزد دیگری عوض است. پس حضور در دنیا از جود مطلق و عین منت است، و رؤیت از جود مقید است، به عنوان جزایی که بر خود واجب کرده است. پس جود او را با جود او شهود (al-Shuhūd) کردی. پس چیزی از او خارج نشد و هیچ مخلوقی چیزی بر او واجب نکرد. **«لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ»** (هیچ معبودی جز او نیست، عزیز حکیم).\n\nپس هنگامی که بنده ابتدائاً به دیگری عطا می‌کند، نه به عنوان جزایی که آن دیگری مستحق آن باشد، پس این عطا کننده به خاطر آن استحقاق تحت قید حق (al-Ḥaqq) قرار می‌گیرد. پس عطای او مانند این است که نه از روی استحقاق باشد و با آن جز وجه خدا را نطلبد، چه با نیت خود آن را طلب کند یا نکند. زیرا حالت عطای ابتدایی، آن را می‌دهد. پس او در آن به صفت حق (al-Ḥaqq) از جود مطلق متصف شده است، زیرا عطای او جزا نبوده است. و چون حال او این است، همان‌گونه که خدای متعال جزا را بر آنچه از نعمت‌ها بر بندگانش منت نهاده، طلب می‌کند، که همان شکر بر آن‌ها و معرفت (al-Maʿrifa) نعمت‌ها از جانب اوست، و او بر آن شکر و بر آن معرفت جزا می‌دهد؛ همچنین به این بنده که ابتدائاً بر دیگری انعام می‌کند، آزادی زبان منعم علیه به شکر و ثنا بر او داده می‌شود، سپس خدا جزای او را به واسطه آن می‌دهد، نه با بهشت، تا با این عطا به صفت او تعالی متصف شود. پس من محتملات آنچه این منزل در بر می‌گیرد را بیان کردم. و **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خدا حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 9
}