{
  "id": 412,
  "title": {
    "ar": "الباب الثاني عشر وأربعمائة في معرفة منازلة من كان لي لم يذل ولا يخزي أبدا",
    "en": "Chapter Four Hundred and Twelve: Concerning the Knowledge of the Station of him who was Mine, who shall never be Abased nor ever Disgraced.",
    "ur": "باب چار سو بارہ: اس شخص کے روحانی مقامات (منازل) کی معرفت میں جو صرف میرے لیے ہو، وہ نہ کبھی ذلیل ہوگا اور نہ ہی کبھی رسوا ہوگا۔",
    "fa": "باب چهارصد و دوازدهم در معرفت منازل کسی که برای من بود، هرگز خوار و رسوا نمی‌شود"
  },
  "content": {
    "ar": "## «الباب الثاني عشر وأربعمائة في معرفة منازلة من كان لي لم يذل ولا يخزي أبدا»\n\n\n> إذا كانت أعمالي إلى خالقي تعزى *** فيوم التنادي لا نذل ولا نخزى‏\n\n\n> وآتي سليما وهو كوني محققا *** فنعطي على قدر الإله إذا نجزي‏\n\n\n> ونحظى بعلم واحد فيه كثرة *** وذلك علم يورث العالم العزا\n\n\n> ففي جنة الفردوس سوق معين *** به نشر الرحمن من صوره بزا\n\n\n> فمن شاء يجلي الحق في أي صورة *** يشاء ولا كون يؤزهم أزا\n\n\n> فطوبى لعبد قام لله وحده *** ولم يعرف اللات المسماة والعزى‏\n\n\n### [الذل صفة شريفة إذا كانت الذلة لله‏]\n\n\nقال الله عز وجل وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فابتدأ بلام العلة وختم بياء الإضافة وقال فيما أوحى به إلى موسى عليه السلام يا ابن آدم خلقت الأشياء من أجلك وخلقتك من أجلي‏\n\n\nوقال لنا على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم الصوم لي‏\n\n\nوقال الصوم لا مثل له فإنه له‏\n\n\nولَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وأذل الأذلاء من كان له عز وجل لأن ذلك الذليل على قدر من ذل‏\nتحت عزه ولا عز أعظم من عز الحق فلا ذل أذل ممن هو لله ومن ذل لله فإنه لا يذل لغير الله أصلا إلا أن يذل لعين الصفة حيث يراها في مخلوق أو غير مخلوق فيتخيل من لا علم له بما شهده هذا الذليل أنه ذل تحت سلطان هذا العزيز وإنما ذل تحت سلطان العزة وهي لله فما ذل إلا للحق المنعوت بهذا النعت وينبغي له أن يذل فلها يذل كل ذليل في العالم فمنهم العالم بذلك في حال ذله ومنهم من لا يعلم وأما الخزي فلا يخزي إذا كان لله فإن الخزي لا يكون من الله لمن هو له وإنما يكون لمن هو لغير الله في شهوده ولذلك قالت خديجة وورقة بن نوفل لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم كلا والله لا يخزيك الله أبدا لما ذكر له ابتداء نزول الناموس عليه فالخزي الذي يقوم بالعبد إنما هو ما جناه على نفسه بجهله وتعديه رسوم سيده وحدوده فالذل صفة شريفة إذا كانت الذلة لله والخزي صفة ذميمة بكل وجه إذا قامت بالنفس فجميع مذام الأخلاق وسفسافها صفات مخزية عند الله وفي العرف وجميع مكارم الأخلاق صفات شريفة في حق وخلق أ لا ترى إلى‏\n\n\nقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إنما بعثت لأتمم مكارم الأخلاق‏\n\n\nفإنه نقص منها المسمى سفسافا فعين لها مصارف فعادت مكارم أخلاق فهي إذا اتصف بها العبد في المواطن المعينة لها لم يلحقه خزي ولا كان ذا صفة مخزية فما ثم إلا خلق كريم مهما زال حكم الغرض النفسي المخالف للأمر الإلهي والحد الزماني النبوي وأما الكائنون لله فهم على مراتب منهم من هو لله بالله ومنهم من هو لله بنفسه ومنهم من هو لله لا بالله ولا بنفسه لكن بغيره من حيث ما هو مجبور لذلك الغير فمن هو لله بالله فلا يذل ولا يخزي فإن الله لا يوصف بالذلة كما قال الله لأبي يزيد في بعض منازلاته تقرب إلي بما ليس لي الذلة والافتقار ومن هو لله بنفسه فيذل ذل شرف لكنه لا يخزي ومن كان لله لا بالله ولا بنفسه فهو بحيث يقبل الجبر فإن أجبر في الله فمنزلته منزلة من هو لله بالله في حق شخص وبنفسه في حق شخص وإن أجبر في أمر نفسي وهو بنفسه في تلك الحالة لا لله فهو في الخزي الدائم والذل اللازم وانحصرت أقسام هذه المنازلة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 412: Concerning the Knowledge of the Spiritual Station of the One Who Belongs to Me, Who Shall Never Be Humiliated Nor Disgraced\n\nIf my deeds are attributed to my Creator,\nThen on the Day of the Call, we shall neither be humiliated nor disgraced.\n\nI come whole, and this is my realized existence,\nSo we are rewarded according to the measure of the Divine when we are recompensed.\n\nWe attain a single Knowledge (العلم) within which is Multiplicity (الكثرة),\nAnd that is the Knowledge that bequeaths glory to the knower.\n\nIn the Garden of Paradise (جنة الفردوس) is a specific market,\nWhere the All-Merciful (الرحمن) spreads out garments from His forms.\n\nWhoever wills, The Real (الحق) manifests in whatever form\nHe desires, and no created thing shall incite them.\n\nBlessedness (طوبى) is for the servant who stands for Allah alone,\nAnd who knows neither al-Lat nor al-Uzza.\n\n### [Humiliation (الذل) is a noble Attribute if the abasement (الذلة) is for Allah]\n\nAllah, the Mighty and Majestic, said: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me). He began with the *lam* of causation (لام العلة) and concluded with the *ya* of possession (ياء الإضافة). And He said in what He revealed to Moses (peace be upon him): \"O son of Adam, I created things for your sake, and I created you for My sake.\"\n\nAnd He said to us through the tongue of His Messenger (peace and blessings be upon him): \"Fasting is for Me.\" And He said: \"Fasting has no likeness, for it belongs to Him.\" <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him).\n\nAnd the most abased of the abased (أذل الأذلاء) is the one who belongs to Him, the Mighty and Majestic, because that abased one is according to the measure of the one who is abased beneath His Glory (عزه). There is no glory (عز) greater than the Glory of The Real (عز الحق), so there is no abasement (ذل) more abased than that of the one who is for Allah.\n\nWhoever is abased for Allah (ذل لله) shall never be abased for other than Allah, unless he is abased before the very Essence of the Attribute (عين الصفة) when he witnesses it in a created or uncreated thing. Then, the one who lacks Knowledge (العلم) of what this abased person witnesses imagines that he has been abased beneath the authority of that mighty one. Yet, he was only abased beneath the authority of Glory (العزة), which belongs to Allah. Thus, he was only abased before The Real (الحق) who is described by this description. It is incumbent upon him to be abased, for it is to this [Glory] that every abased one in the World (العالم) is abased. Among them are those who know this during their state of abasement, and among them are those who do not know.\n\nAs for disgrace (الخزي), one is not disgraced if one belongs to Allah, for disgrace does not come from Allah to the one who belongs to Him. Rather, it occurs to the one who, in his witnessing (شهوده), belongs to other than Allah. That is why Khadijah and Waraqa ibn Nawfal said to the Messenger of Allah (peace and blessings be upon him)—when he mentioned the beginning of the descent of the Divine Law (الناموس) upon him—\"No, by Allah, Allah will never disgrace you.\"\n\nThe disgrace that befalls the servant is only what he has brought upon himself through his ignorance and his transgression of the limits and boundaries of his Lord. Thus, abasement (الذل) is a noble attribute (صفة شريفة) if the abasement is for Allah, whereas disgrace (الخزي) is a blameworthy attribute (صفة ذميمة) in every respect if it resides in the soul (النفس).\n\nAll blameworthy characteristics (مذام الأخلاق) and their trivialities (سفسافها) are disgraceful attributes in the sight of Allah and in common usage. Conversely, all noble moral qualities (مكارم الأخلاق) are noble attributes concerning The Real (حق) and creation (خلق). Do you not see the saying of the Messenger of Allah (peace and blessings be upon him): \"I was only sent to perfect noble moral qualities\"? He removed from them what is called triviality and designated specific applications for them, so they returned to being noble moral qualities. Thus, if the servant is characterized by them in their designated stations, no disgrace shall befall him, nor shall he possess a disgraceful attribute. There is nothing there but a noble character (خلق كريم), provided the ruling of the egoistic purpose (الغرض النفسي) that contradicts the Divine Command (الأمر الإلهي) and the prophetic temporal limit (الحد الزماني النبوي) is removed.\n\nAs for those who exist for Allah (الكائنون لله), they are of various Levels (مراتب): among them is the one who is for Allah *by* Allah (لله بالله); among them is the one who is for Allah *by* his own soul (لله بنفسه); and among them is the one who is for Allah neither *by* Allah nor *by* his own soul, but *by* another, insofar as he is compelled (مجبور) by that other.\n\nThe one who is for Allah *by* Allah shall neither be humiliated nor disgraced, for Allah is not described by abasement (الذلة), as Allah said to Abu Yazid in one of his spiritual communications (منازلاته): \"Draw near to Me with that which is not Mine: abasement (الذلة) and need (الافتقار).\"\n\nThe one who is for Allah *by* his own soul is abased with the abasement of honor (ذل شرف), but he is not disgraced.\n\nAnd the one who is for Allah neither *by* Allah nor *by* his own soul is in a state where he accepts compulsion (الجبر). If he is compelled *in* Allah, his station (منزلته) is the station of the one who is for Allah *by* Allah concerning one person, and *by* his own soul concerning another person. But if he is compelled in an egoistic matter (أمر نفسي)—and he is *by* his own soul in that state, not for Allah—then he is in perpetual disgrace (الخزي الدائم) and necessary humiliation (الذل اللازم).\n\nAnd the divisions of this spiritual station (المنازلة) are thus confined. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب چار سو بارہ: اس شخص کے مقام کی معرفت میں جو میرے لیے ہو، وہ کبھی ذلیل نہیں ہوگا اور نہ ہی رسوا ہوگا۔\n\nاگر میرے اعمال میرے خالق کی طرف منسوب کیے جائیں،\nتو پکار کے دن (قیامت) ہم نہ ذلیل ہوں گے اور نہ رسوا۔\n\nاور میں سالم (سلامتی کے ساتھ) آؤں گا، اور یہی میرا وجود ہے جو متحقق ہو چکا ہے،\nپس جب ہمیں جزا دی جائے گی تو ہم اللہ کے قدر کے مطابق عطا کیے جائیں گے۔\n\nاور ہم ایک ایسے علم سے بہرہ مند ہوں گے جس میں کثرت ہے،\nاور وہ علم عالم کو عزت و جلال عطا کرتا ہے۔\n\nپس جنت الفردوس میں ایک مخصوص بازار ہے،\nجہاں رحمن اپنی صورتوں سے لباس (تجلی) پھیلاتا ہے۔\n\nپس جو چاہے، حق (الحق) کو جس صورت میں چاہے ظاہر کرے،\nاور کوئی وجود انہیں سختی سے نہیں روکے گا۔\n\nپس اس بندے کے لیے خوشخبری ہے جو صرف اللہ کے لیے کھڑا ہوا،\nاور اس نے نام نہاد لات اور عزیٰ کو نہ پہچانا۔\n\n[الذل صفة شريفة إذا كانت الذلة لله‏] ذلت ایک شریف صفت ہے اگر وہ اللہ کے لیے ہو\n\nاللہ عزوجل نے فرمایا: اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ)۔ پس اس نے لامِ علت سے ابتدا کی اور یاءِ اضافت پر ختم کیا۔ اور اس نے وہ فرمایا جو موسیٰ علیہ السلام پر وحی کیا: اے ابن آدم! میں نے تمام اشیاء کو تیرے لیے پیدا کیا اور تجھے اپنے لیے پیدا کیا۔\n\nاور ہمارے لیے اپنے رسول صلی اللہ علیہ وسلم کی زبان سے فرمایا: روزہ میرے لیے ہے۔ اور فرمایا: روزے کی کوئی مثال نہیں، کیونکہ وہ اسی (اللہ) کے لیے ہے۔ اور اس کی مثل کوئی چیز نہیں (وَلَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)۔ اور سب سے زیادہ ذلیل وہ ہے جو اللہ عزوجل کے لیے ہو۔ کیونکہ وہ ذلیل اس قدر کے مطابق ہے جس کے تحت وہ اس کی عزت (العز) کے سامنے ذلیل ہوا۔ اور حق (الحق) کی عزت سے بڑھ کر کوئی عزت نہیں۔ پس اس سے زیادہ ذلیل کوئی نہیں جو اللہ کے لیے ہو۔ اور جو اللہ کے لیے ذلیل ہوا، وہ درحقیقت کبھی بھی غیر اللہ کے لیے ذلیل نہیں ہوتا۔ مگر یہ کہ وہ عین صفت کے لیے ذلیل ہو، جہاں وہ اسے کسی مخلوق یا غیر مخلوق میں دیکھتا ہے۔ پس وہ شخص جو اس چیز کا علم نہیں رکھتا جس کا اس ذلیل نے مشاہدہ کیا، وہ یہ گمان کرتا ہے کہ یہ شخص اس عزیز (مخلوق) کے اقتدار کے تحت ذلیل ہوا۔ حالانکہ وہ صرف عزت (العزۃ) کے اقتدار کے تحت ذلیل ہوا، اور وہ عزت اللہ کے لیے ہے۔ پس وہ ذلیل نہیں ہوا مگر اس حق (الحق) کے لیے جو اس صفت سے متصف ہے۔ اور اس کے لیے ضروری ہے کہ وہ ذلیل ہو، کیونکہ اسی کے لیے دنیا میں ہر ذلیل ذلیل ہوتا ہے۔ پس ان میں سے کچھ ایسے ہیں جو اپنی ذلت (الذل) کی حالت میں اس بات کو جانتے ہیں، اور کچھ ایسے ہیں جو نہیں جانتے۔\n\nاور جہاں تک رسوائی (الخزی) کا تعلق ہے، تو وہ رسوا نہیں ہوتا اگر وہ اللہ کے لیے ہو۔ کیونکہ رسوائی اللہ کی طرف سے اس شخص کے لیے نہیں ہوتی جو اس کے لیے ہو۔ بلکہ یہ اس شخص کے لیے ہوتی ہے جو اپنے شہود (الشہود) میں غیر اللہ کے لیے ہو۔ اور اسی لیے خدیجہ اور ورقہ بن نوفل نے رسول اللہ صلی اللہ علیہ وسلم سے کہا: ہرگز نہیں، اللہ کی قسم! اللہ آپ کو کبھی رسوا نہیں کرے گا۔ جب آپ صلی اللہ علیہ وسلم نے ان سے ناموس (وحی) کے ابتدائی نزول کا ذکر کیا۔ پس وہ رسوائی جو بندے کے ساتھ قائم ہوتی ہے، وہ صرف وہی ہے جو اس نے اپنی جہالت اور اپنے آقا کے رسم و حدود سے تجاوز کر کے اپنے اوپر کمائی ہے۔\n\nپس ذلت (الذل) ایک شریف صفت ہے اگر وہ اللہ کے لیے ہو۔ اور رسوائی (الخزی) ہر لحاظ سے ایک مذموم صفت ہے اگر وہ نفس کے ساتھ قائم ہو۔ پس تمام مذموم اخلاق اور ان کی پستی اللہ کے نزدیک اور عرف میں رسوا کن صفات ہیں۔ اور تمام مکارم اخلاق حق (الحق) اور خلق (مخلوق) کے معاملے میں شریف صفات ہیں۔ کیا تم رسول اللہ صلی اللہ علیہ وسلم کے اس قول پر غور نہیں کرتے: مجھے صرف مکارم اخلاق کی تکمیل کے لیے بھیجا گیا ہے۔ پس آپ صلی اللہ علیہ وسلم نے اس میں سے جسے پستی کہا جاتا تھا، اسے کم کیا، اور اس کے لیے مخصوص مصارف (مقامات) مقرر کیے، تو وہ مکارم اخلاق بن گئے۔ پس جب بندہ ان (صفات) سے ان کے مقررہ مقامات پر متصف ہوتا ہے، تو اسے نہ رسوائی لاحق ہوتی ہے اور نہ ہی وہ رسوا کن صفت والا ہوتا ہے۔ پس وہاں صرف خلق کریم (شریف خصلت) ہی ہے، جب بھی نفسانی غرض کا حکم جو امر الٰہی اور نبوی زمانی حد کے خلاف ہو، زائل ہو جائے۔\n\nاور جو لوگ اللہ کے لیے ہیں (الکائنون لله)، وہ کئی مراتب پر ہیں۔ ان میں سے کچھ وہ ہیں جو اللہ کے لیے ہیں، اللہ کے ذریعے (لله بالله)۔ اور ان میں سے کچھ وہ ہیں جو اللہ کے لیے ہیں، اپنے نفس کے ذریعے (لله بنفسه)۔ اور ان میں سے کچھ وہ ہیں جو اللہ کے لیے ہیں، نہ اللہ کے ذریعے اور نہ اپنے نفس کے ذریعے، بلکہ کسی اور کے ذریعے، اس لحاظ سے کہ وہ اس دوسرے کے لیے مجبور ہے۔\n\nپس جو اللہ کے لیے ہے، اللہ کے ذریعے (لله بالله)، وہ نہ ذلیل ہوتا ہے اور نہ رسوا۔ کیونکہ اللہ ذلت (الذلۃ) سے متصف نہیں ہوتا۔ جیسا کہ اللہ نے ابو یزید (بسطامی) سے ان کے بعض منازلات میں فرمایا: میرے قریب آؤ اس چیز کے ذریعے جو میرے لیے نہیں ہے—یعنی ذلت (الذلۃ) اور محتاجی (الافتقار)۔ اور جو اللہ کے لیے ہے، اپنے نفس کے ذریعے (لله بنفسه)، وہ شرف کی ذلت اختیار کرتا ہے، لیکن وہ رسوا نہیں ہوتا۔ اور جو اللہ کے لیے ہے، نہ اللہ کے ذریعے اور نہ اپنے نفس کے ذریعے، وہ اس مقام پر ہے جہاں وہ جبر (مجبوری) کو قبول کرتا ہے۔ پس اگر اسے اللہ میں مجبور کیا جائے، تو اس کا مقام اس شخص کا مقام ہے جو ایک شخص کے حق میں اللہ کے ذریعے (لله بالله) ہے اور دوسرے شخص کے حق میں اپنے نفس کے ذریعے (لله بنفسه) ہے۔ اور اگر اسے کسی نفسانی معاملے میں مجبور کیا جائے، اور وہ اس حالت میں اپنے نفس کے ذریعے ہو، نہ کہ اللہ کے لیے، تو وہ دائمی رسوائی (الخزی الدائم) اور لازمی ذلت (الذل اللازم) میں ہے۔ اور اس مقام کے حصے محدود ہو گئے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و دوازدهم در معرفت مقام کسی که از آنِ من باشد، هرگز خوار و رسوا نمی‌شود.\n\nاگر اعمالم به خالقم نسبت داده شود،\nپس در روز ندا (قیامت) نه خوار می‌شویم و نه رسوا.\n\nو در حالی که وجودم محقق شده است، سالم می‌آیم؛\nپس چون پاداش داده شویم، به اندازه قدر الهی عطا می‌شویم.\n\nو به علمی واحد دست می‌یابیم که در آن کثرت است؛\nو آن علمی است که به عالم، عزت می‌بخشد.\n\nپس در بهشت فردوس، بازاری معین است\nکه در آن، خداوند رحمان از صورت‌های خود، جامه‌هایی می‌گستراند.\n\nپس هر کس بخواهد، حق (الحق) در هر صورتی که بخواهد تجلی (التجلی) می‌کند،\nو هیچ هستی‌ای (کون) آنان را به شدت تحریک نمی‌کند.\n\nپس خوشا به حال بنده‌ای که تنها برای خدا قیام کرد\nو لات و عزای نامیده شده را نشناخت.\n\n### [ذلت، صفتی شریف است اگر ذلت برای خدا باشد]\n\nخداوند عز و جل فرمود: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند). پس با لام علت آغاز کرد و با یای اضافه (در «لیعبدونی») پایان داد. و در آنچه به موسی علیه السلام وحی کرد، فرمود: «ای فرزند آدم، اشیاء را برای تو آفریدم و تو را برای خودم آفریدم.»\n\nو از زبان رسولش صلی الله علیه و سلم به ما فرمود: «الصوم لي» (روزه برای من است).\n\nو فرمود: «روزه را مِثلی نیست، زیرا آن از آنِ اوست.»\n\n«لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی همانند او نیست). و خوارترینِ خواران کسی است که از آنِ خداوند عز و جل باشد، زیرا آن ذلیل به اندازه کسی است که تحت عزّت او ذلت پذیرفته است. و هیچ عزتی بزرگتر از عزّت حق (الحق) نیست. پس هیچ ذلتی خوارتر از ذلت کسی که از آنِ خداست، وجود ندارد. و هر کس برای خدا ذلت پذیرد، هرگز برای غیر خدا خوار نمی‌شود، مگر اینکه برای عین صفت ذلت پذیرد، آنجا که آن صفت را در مخلوقی یا غیر مخلوقی می‌بیند. پس کسی که به آنچه این ذلیل شهود (الشهود) کرده است، علم ندارد، گمان می‌کند که او تحت سلطنت آن عزیز خوار شده است، در حالی که او تنها تحت سلطنت عزّت خوار شده است و عزّت از آنِ خداست. پس او ذلت نپذیرفته مگر برای حق (الحق) که به این صفت توصیف شده است، و شایسته است که ذلت پذیرد. پس هر ذلیلی در عالم برای آن (عزت) ذلت می‌پذیرد. برخی از آنان در حال ذلت خود به این امر عالمند و برخی دیگر نمی‌دانند.\n\nو اما رسوایی (خزی)، اگر کسی از آنِ خدا باشد، رسوا نمی‌شود، زیرا رسوایی از جانب خدا برای کسی که از آنِ اوست، رخ نمی‌دهد، بلکه تنها برای کسی رخ می‌دهد که در شهودش (الشهود) از آنِ غیر خدا باشد. به همین دلیل بود که خدیجه و ورقة بن نوفل به رسول خدا صلی الله علیه و سلم گفتند: «کلا والله لا يخزيك الله أبدا» (هرگز، به خدا سوگند، خداوند تو را رسوا نخواهد کرد)، هنگامی که پیامبر آغاز نزول ناموس (وحی) بر خود را برایشان بازگو کرد. پس رسوایی‌ای که به بنده می‌رسد، تنها نتیجه‌ای است که او با جهل خود و تجاوز از حدود و رسوم مولایش بر خود وارد کرده است.\n\nپس ذلت صفتی شریف است اگر ذلت برای خدا باشد، و رسوایی (خزی) صفتی نکوهیده است از هر جهت، اگر در نفس پدید آید. بنابراین، تمامی اخلاق نکوهیده و پست، صفاتی رسواکننده نزد خدا و در عرف هستند، و تمامی مکارم اخلاق، صفاتی شریف در حق و خلق می‌باشند. آیا به این توجه نمی‌کنی که:\n\nرسول خدا صلی الله علیه و سلم فرمود: «إنما بعثت لأتمم مكارم الأخلاق» (من تنها برای کامل کردن مکارم اخلاق مبعوث شدم).\n\nزیرا او آنچه را که سفساف (پستی) نامیده می‌شد، از آن (اخلاق) کاست و مصارفی برای آن تعیین کرد، پس آن (صفات) به مکارم اخلاق بازگشتند. بنابراین، اگر بنده در مواطن معین شده برای آن صفات، متصف به آن‌ها شود، رسوایی به او نمی‌رسد و صاحب صفت رسواکننده‌ای نخواهد بود. پس در آنجا جز خلق کریم وجود ندارد، مادامی که حکم غرض نفسانی که مخالف امر الهی و حد زمانی نبوی است، زائل شود.\n\nو اما کسانی که از آنِ خدا هستند، بر مراتبی می‌باشند: برخی از آنان «لله بالله» (برای خدا به واسطه خدا) هستند، و برخی «لله بنفسه» (برای خدا به واسطه نفس خود) هستند، و برخی «لله لا بالله ولا بنفسه» (برای خدا نه به واسطه خدا و نه به واسطه نفس خود) هستند، بلکه به واسطه غیر خود، از آن جهت که مجبور به آن غیر می‌باشند. پس کسی که «لله بالله» است، نه خوار می‌شود و نه رسوا، زیرا خداوند به ذلت توصیف نمی‌شود، چنانکه خداوند در برخی از منازلات (تجلیات) خود به ابویزید فرمود: «تقرب إلي بما ليس لي: الذلة والافتقار» (به من تقرب جوی با آنچه از آنِ من نیست: ذلت و فقر). و کسی که «لله بنفسه» است، ذلت شرف را می‌پذیرد، اما رسوا نمی‌شود. و کسی که «لله لا بالله ولا بنفسه» است، در وضعیتی است که جبر را می‌پذیرد. پس اگر در راه خدا مجبور شود، مقامش در حق یک شخص، مقام کسی است که «لله بالله» است، و در حق شخص دیگر، مقام کسی است که «لله بنفسه» است. و اگر در امری نفسانی مجبور شود و در آن حالت از آنِ نفس خود باشد نه از آنِ خدا، پس او در رسوایی (خزی) دائمی و ذلت لازم است. و اقسام این مقام (منازله) محدود شد. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}