{
  "id": 58,
  "title": {
    "ar": "الباب الثامن والخمسون في معرفة أسرار أهل الإلهام‏",
    "en": "Chapter Fifty-Eight: On the Knowledge of the Mysteries of the People of Divine Inspiration",
    "ur": "اٹھاونواں باب: اہل الہام کے اسرار کی معرفت میں",
    "fa": "باب پنجاه و هشتم در معرفت اسرار اهل الهام"
  },
  "content": {
    "ar": "## (الباب الثامن والخمسون) في معرفة أسرار أهل الإلهام‏\n\n\nالمستدلين ومعرفة علم إلهي فاض على القلب ففرق خواطره وشتتها\n\n\n> إذا أعطاك بالإلهام علما *** تحققه فأنت به سعيد\n\n\n> كمثل النحل مختلف المعاني *** قوي في مبانيه سديد\n\n\n> فتلقى طيبا عن طيب أصل *** وأنت لحالها أبدا شهيد\n\n\n> وفي الأشجار والشم الرواسي *** لها من فعلها قصر مشيد\n\n\n> فلا تعجزك للعلياء نحل *** وأنت السيد الندب الجليد\n\n\n> فمنك القصد خيرا واختيارا *** كما لك في منازلك القصود\n\n\n> فحقق والتمس علما وحيدا *** كمثلك إنك الخلق الجديد\n\n\n### [معرفة الله من طريقى العقل والنقل‏]\n\n\nاعلم أيدك الله بروح منه أن الله عز وجل أمرنا بالعلم بوحدانيته في ألوهيته غير أن النفوس لما سمعت ذلك منه مع كونها قد نظرت بفكرها ودلت على وجود الحق بالأدلة العقلية بل بضرورة العقل بعلم وجود الباري تعالى ثم دلت على توحيد هذا الموجود الذي خلقها وأنه من المحال أن يوجد واجبا الوجود لنفسه ولا ينبغي أن يكون إلا واحدا ثم استدلوا على ما ينبغي أن يكون عليه من هو واجب الوجود لنفسه من النسب التي ظهر عنه بها ما ظهر من الممكنات ودل على إمكان الرسالة ثم جاء الرسول وأظهر من الدلائل على صدقه أنه رسول من الله إلينا فعرفنا بالأدلة العقلية أنه رسول الله فلم نشك وقام لنا الدليل العقلي على صدق ما يخبر به فيما ينسب إليه ورآه قد أتى في أخباره عنه تعالى بنسب وأمور كان الدليل العقلي يحيلها ويرمي بها فتوقف العقل وأنهم معرفته وقدح في دليله هذا الإنباء الإلهي بما نسبه لنفسه ولا يقدر على تكذيب المخبر\n\n\n### [معرفة من طريق النقل ليست عين معرفة الله من طريق العقل‏]\n\n\nثم كان من بعض ما قال له هذا الشارع اعرف ربك وهذا العاقل لو لم يعلم ربه الذي هو الأصل المعول عليه ما صدق هذا الرسول فلا بد أن يكون العلم الذي طلب منه الرسول أن يعلم به ربه غير العلم الذي أعطاه دليله وهو أن يتعمل في تحصيل علم من الله بالله يقبل به على بصيرة هذه الأمور التي نسبها الله إلى نفسه ووصف نفسه بها التي أحالها العقل بدليله فانقدح له بتصديقه الرسول إن ثم وراء العقل وما يعطيه بفكره أمرا آخر يعطي من العلم بالله ما لا تعطيه الأدلة العقلية بل تحيله قولا واحدا\n\n\n### [المعرفة النقلية وراء طور العقل‏]\n\n\nفإذا علمه بهذه القوة التي عرف أنها وراء طور العقل هل يبقى له الحكم فيما كان يحيله العقل من حيث فكره أولا على ما كان عليه أم لا يبقى فإن لم يبق له الحكم بأن ذلك محال فلا بد أن يعثر على الوجه الذي وقع له منه الغلط بلا شك وأن ذلك الذي اتخذه دليلا على إحالة ذلك على الله لم يكن دليلا في نفس الأمر وإذا كان هذا فما ذلك الأمر مما هو وراء طور العقل فإن العقل قد يصيب وقد يخطئ وإن بقي للعقل بعد كشفه وتحقيقه لصحة هذا الأمر الذي نسبه الله لنفسه ووصف به نفسه وقبلته عقول الأنبياء وقبله عقل هذا المكاشف بلا شك ولا ريب ومع هذا فإنه يحكم على الله بأن ذلك الأمر محال عقلا من حيث فكره لا من حيث قبوله وحينئذ يصح أن يكون ذلك المقام وراء طور العقل من جهة أخذه عن الفكر لا من جهة أخذه عن الله‏\n\n\n### [عجبا للعقل يتبع فكره ولا يتبع ربه‏]\n\n\nهذا ومن أعجب الأمور عندنا إن يكون الإنسان يقلد فكره ونظره وهو محدث مثله وقوة من قوى الإنسان التي خلقها الله فيه وجعل تلك القوة خديمة للعقل ويقلدها العقل فيما تعطيه هذه القوة ويعلم أنها لا تتعدى مرتبتها وأنها تعجز في نفسها عن إن يكون لها حكم قوة أخرى مثل القوة الحافظة والمصورة والمتخيلة والقوي التي هي الحواس من لمس وطعم وشم وسمع وبصر ومع هذا القصور كله يقلدها العقل في معرفة ربه ولا يقلد ربه فيما يخبر به عن نفسه في كتابه وعلى لسان رسوله صلى الله عليه وسلم فهذا من أعجب ما طرأ في العالم من الغلط\n\n\n### [حدود آفاق العقل من حيث قواه الظاهرة والباطنة]\n\n\nوكل صاحب فكر تحت حكم هذا الغلط بلا شك إلا من نور الله بصيرته فعرف إن الله قد أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فأعطى السمع خلقه فلا يتعدى إدراكه وجعل العقل فقيرا إليه يستمد منه معرفة الأصوات وتقطيع الحروف وتغيير الألفاظ وتنوع اللغات فيفرق بين صوت الطير وهبوب الرياح وصرير الباب وخرير الماء وصياح الإنسان ويعار الشاة وثؤاج الكباش وخوار البقر ورغاء الإبل وما أشبه هذه الأصوات كلها ولبس في قوة لعقل من حيث ذاته إدراك‏\nشي‏ء من هذا ما لم يوصله إليه السمع وكذلك القوة البصرية جعل الله العقل فقيرا إليها فيما توصله إليه من المبصرات فلا يعرف الخضرة ولا الصفرة ولا الزرقة ولا البياض ولا السواد ولا ما بينهما من الألوان ما لم ينعم البصر على العقل بها وهكذا جميع القوي المعروفة بالحواس ثم إن الخيال فقير إلى هذه الحواس فلا يتخيل أصلا إلا ما تعطيه هذه القوي ثم إن القوة الحافظة إن لم تمسك على الخيال ما حصل عنده من هذه القوي لا يبقى في الخيال منها شي‏ء فهو فقير إلى الحواس وإلى القوة الحافظة ثم إن القوة الحافظة قد تطرأ عليها موانع تحول بينها وبين الخيال فيفوت الخيال أمور كثيرة من أجل ما طرأ على القوة الحافظة من الضعف لوجود المانع فافتقر إلى القوة المذكرة فتذكره ما غاب عنه فهي معينة للقوة الحافظة على ذلك ثم إن القوة المفكرة إذا جاءت إلى الخيال افتقرت إلى القوة المصورة لتركب بها مما ضبطه الخيال من الأمور صورة دليل على أمر ما وبرهان تستند فيه إلى المحسوسات أو الضرورات وهي أمور مركوزة في الجبلة فإذا تصور الفكر ذلك الدليل حينئذ يأخذه العقل منه فيحكم به على المدلول وما من قوة إلا ولها موانع وأغاليط فيحتاج إلى فصلها من الصحيح الثابت فانظر يا أخي ما أفقر العقل حيث لا يعرف شيئا مما ذكرناه إلا بوساطة هذه القوي وفيها من العلل ما فيها فإذا أنفق للعقل أن يحصل شيئا من هذه الأمور بهذه الطرق ثم أخبره الله بأمر ما توقف في قبوله وقال إن الفكر يرده فما أجهل هذا العقل بقدر ربه كيف قلد فكره وجرح ربه‏\n\n\n### [طريق العقل إلى الله من جهة الشرع أقرب إليه من جهة الفكر]\n\n\nفقد علمنا إن العقل ما عنده شي‏ء من حيث نفسه وأن الذي يكتسبه من العلوم إنما هو من كونه عنده صفة القبول فإذا كان بهذه المثابة فقبوله من ربه لما يخبر به عن نفسه تعالى أولى من قبوله من فكره وقد عرف أن فكره مقلد لخياله وأن خياله مقلد لحواسه ومع تقليده فهو غير قوي على إمساك ما عنده ما لم تساعده على ذلك القوة الحافظة والمذكرة ومع هذه المعرفة بأن القوي لا تتعدى خلقها وما تعطيه حقيقتها وأنه بالنظر إلى ذاته لا علم عنده إلا الضروريات التي فطر عليها لا يقبل قول من يقول له إن ثم قوة أخرى وراءك تعطيك خلاف ما أعطتك القوة المفكرة نالها أهل الله من الملائكة والأنبياء والأولياء ونطقت بها الكتب المنزلة فاقبل منها هذه الأخبار الإلهية فتقليد الحق أولى وقد رأيت عقول الأنبياء على كثرتهم والأولياء قد قبلتها وآمنت بها وصدقتها ورأت أن تقليدها ربها في معرفة نفسه أولى من تقليد أفكارها فما لك أيها العاقل المنكر لها لا تقبلها ممن جاء بها ولا سيما عقول تقول إنها في محل الايمان بالله ورسله وكتبه‏\n\n\n### [الرياضيات والخلوات والمجاهدات وأثرها في المعرفة الحقيقية]\n\n\nولما رأت عقول أهل الايمان بالله تعالى إن الله قد طلب منها أن تعرفه بعد أن عرفته بأدلتها النظرية علمت إن ثم علما آخر بالله لا تصل إليه من طريق الفكر فاستعملت الرياضات والخلوات والمجاهدات وقطع العلائق والانفراد والجلوس مع الله بتفريغ المحل وتقديس القلب عن شوائب الأفكار إذ كان متعلق الأفكار الأكوان واتخذت هذه الطريقة من الأنبياء والرسل وسمعت أن الحق جل جلاله ينزل إلى عباده ويستعطفهم فعلمت إن الطريق إليه من جهته أقرب إليه من الطريق من فكرها ولا سيما أهل الايمان وقد سمعت‏\n\n\nقوله تعالى من أتاني يسعى أتيته هرولة\n\n\nوإن قلبه وسع جلال الله وعظمته فتوجه إليه بكله وانقطع من كل ما يأخذ عنه من هذه القوي فعند هذا التوجه أفاض الله عليه من نوره علما إلهيا عرفه بأن الله تعالى من طريق المشاهدة والتجلي لا يقبله كون ولا يرده ولذلك قال إِنَّ في ذلِكَ يشير إلى العلم بالله من حيث المشاهدة لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ ولم يقل غير ذلك‏\n\n\n### [القلب كقوة وراء طور العقل تصل العبد بالرب‏]\n\n\nفإن القلب معلوم بالتقليب في الأحوال دائما فهو لا يبقى على حالة واحدة فكذلك التجليات الإلهية فمن لم يشهد التجليات بقلبه ينكرها فإن العقل يقيد وغيره من القوي إلا القلب فإنه لا يتقيد وهو سريع التقلب في كل حال ولذا\n\n\nقال الشارع إن القلب بين أصبعين من أصابع الرحمن يقلبه كيف يشاء\n\n\nفهو يتقلب بتقلب التجليات والعقل ليس كذلك فالقلب هو القوة التي وراء طور العقل فلو أراد الحق في هذه الآية بالقلب أنه العقل ما قال لِمَنْ كانَ لَهُ قَلْبٌ فإن كل إنسان له عقل وما كل إنسان يعطي هذه القوة التي وراء طور العقل المسماة قلبا في هذه الآية فلذلك قال لِمَنْ كانَ لَهُ قَلْبٌ فالتقليب في القلب نظير التحول الإلهي في الصور فلا تكون معرفة الحق من الحق إلا بالقلب لا بالعقل ثم يقبلها العقل من القلب كما يقبل من الفكر فلا يسعه سبحانه إلا أن يقلب ما عندك ومعنى قلب ما عندك هو أنك علقت المعرفة به عز وجل وضبطت عندك في علمك أمرا ما وأعلى أمر ضبطته في‏\nعلمك به أنه لا ينضبط سبحانه ولا يتقيد ولا يشبه شيئا ولا يشبه شي‏ء فلا ينضبط مضبوط لتميزه عما ينضبط فقد انضبط ما لا ينضبط مثل قولك العجز عن درك الإدراك إدراك والحق إنما وسعه القلب ومعنى ذلك أن لا يحكم على الحق تعالى بأنه لا يقبل ولا يقبل فإن ذات الحق وأنيته مجهولة عند الكون ولا سيما وقد أخبر جل جلاله عن نفسه بالنقيضين في الكتاب والسنة فشبه في موضع ونزه في موضع ب لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وشبيه بقوله وهُوَ السَّمِيعُ الْبَصِيرُ فتفرقت خواطر التشبيه وتشتتت خواطر التنزيه فإن المنزه على الحقيقة قد قيده وحصره في تنزيهه وأخلي عنه التشبيه والمشبه أيضا قيده وحصره في التشبيه وأخلي عنه التنزيه والحق في الجمع بالقول بحكم الطائفتين فلا ينزه تنزيها يخرج عن التشبيه ولا يشبه تشبيها يخرج عن التنزيه فلا تطلق ولا تقيد لتميزه عن التقييد ولو تميز تقيد في إطلاقه ولو تقيد في إطلاقه لم يكن هو فهو المقيد بما قيد به نفسه من صفات الجلال وهو المطلق بما سمي به نفسه من أسماء الكمال وهو الواحد الحق الجلي الخفي لا إله إلا هو العلي العظيم‏\n\n\n### (وصل) [السدرة هي المرتبة الخامسة التي تنتهي إليها الأعمال‏]\n\n\nوأما أسرار أهل الإلهام المستدلين فلا تتجاوز سدرة المنتهى فإن إليها تنتهي أعمال بنى آدم ونهاية كل أمر إلى ما منه بدا فإن قال لك عارف ممن لا علم له بهذا الأمر إن الكرسي موضع القدمين فقل له ذلك عالم الخلق والأمر والتكليف إنما انقسم من السدرة فإنه قطع أربع مراتب والسدرة هي المرتبة الخامسة فنزل من قلم إلى لوح إلى عرش إلى كرسي إلى سدرة\n\n\n### [الأحكام الشرعية الخمسة وما يقابلها من مراتب الوجود]\n\n\nفظهر الواجب من القلم والمندوب من اللوح والمحظور من العرش والمكروه من الكرسي والمباح من السدرة والمباح قسم النفس وإليها تنتهي نفوس عالم السعادة ولأصولها وهي الزقوم تنتهي نفوس أهل الشقاء وقد بيناها في كتاب التنزلات الموصلية في باب يوم الإثنين وإذا ظهرت قسمة الأحكام من السدرة فإذا صعدت الأعمال التي لا تخلو من أحد هذه الأحكام لا بد أن تكون نهايتها إلى الموضع الذي منه ظهرت إذ لا تعرف من كونها منقسمة إلى السدرة ثم يكون من العقل الذي هو القلم نظر إلى الأعمال المفروضة فيمدها بحسب ما يرى فيها ويكون من اللوح نظر إلى الأعمال المندوب إليها فيمدها بحسب ما يرى فيها ويكون من العرش نظر إلى المحظورات وهو مستوي الرحمن فلا ينظرها إلا بعين الرحمة ولهذا يكون مال أصحابها إلى الرحمة ويكون من الكرسي نظر إلى الأعمال المكروهة فينظر إليها بحسب ما يرى فيها وهو تحت حيطة العرش والعرش مستوي الرحمن والكرسي موضع القدمين فيسرع العفو والتجاوز عن أصحاب المكروه من الأعمال ولهذا يؤجر تاركها ولا يؤاخذ فاعلها\n\n\n### [عذاب أهل الجحيم في الجحيم: الخلود في النار]\n\n\nفكتاب الأبرار في عليين ويدخل فيهم العصاة أهل الكبائر والصغائر وأما كتاب الفجار ففي سجين وفيه أصول السدرة التي هي شجرة الزقوم فهناك تنتهي أعمال الفجار في أسفل سافلين فإن رحمهم الرحمن من عرش الرحمانية بالنظرة التي ذكرناها جعل لهم نعيما في منزلهم فلا يموتون فيه ولا يحبون فهم في نعيم النار دائمون مؤبدون كنعيم النائم بالرؤيا التي يراها في حال نومه من السرور وربما يكون في فراشه مريضا ذا بؤس وفقر ويرى نفسه في المنام ذا سلطان ونعمة وملك فإن نظرت إلى النائم من حيث ما يراه في منامه ويلتذ به قلت إنه في نعيم وصدقت وإن نظرت إليه من حيث ما تراه في فراشه الخشن ومرضه ويأسه وفقره وكلومه قلت إنه في عذاب هكذا يكون أهل النار ف لا يَمُوتُ فِيها ولا يَحْيى‏ أي لا يستيقظ أبدا من نومته فتلك الرحمة التي يرحم الله بها أهل النار الذين هم أهلها وأمثالها كالمحرور منهم بتنعم بالزمهرير والمقرور منهم يجعل في الحرور وقد يكون عذابهم توهم وقوع العذاب بهم وذلك كله بعد قوله لا يُفَتَّرُ عَنْهُمْ العذاب وهُمْ فِيهِ مُبْلِسُونَ ذلك زمان عذابهم وأخذهم بجرائمهم قبل أن تلحقهم الرحمة التي سبقت الغضب الإلهي فإذا اطلع أهل الجنان في هذه الحالة على أهل النار ورأوا منازلهم في النار وما أعد الله فيها وما هي عليه من قبح المنظر قالوا معذبون وإذا كوشفوا على الحسن المعنوي الإلهي في خلق ذلك المسمى قبحا ورأوا ما هم فيه في نومتهم وعلموا أحوال أمزجتهم قالوا منعمون فسبحان القادر على ما يشاء لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ فقد فهمت قول الله تعالى لا يَمُوتُ فِيها ولا يَحْيى‏ وقول رسول الله صلى الله عليه وسلم أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون‏\n\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Fifty-Eight: Concerning the Knowledge of the Secrets of the People of Inspired Reasoning, and the Knowledge of a Divine Science that Overflows onto the Heart, Dispersing and Scattering its Thoughts.\n\n> If He grants you knowledge through inspiration,\n> Realize it, for you are blessed by it.\n\n> Like the bee, diverse in meanings,\n> Strong and sound in its foundations.\n\n> It receives goodness from a good origin,\n> And you are eternally a witness to its state.\n\n> And in the trees and the towering mountains,\n> It has a lofty palace built by its action.\n\n> So let not the bee hinder you from the heights,\n> For you are the master, the noble, the steadfast.\n\n> From you comes the intention, good and chosen,\n> Just as intentions reside in your stations.\n\n> So realize and seek a singular knowledge,\n> Like yourself, for you are the new creation.\n\n### [Knowledge of Allah through the Paths of Intellect and Transmission]\n\nKnow—may Allah support you with a spirit from Him—that Allah, the Mighty and Majestic, commanded us to know His Oneness (الوحدة) in His Divinity (الألوهية). However, when souls heard this command from Him, they had already looked with their thought (فكر) and demonstrated the existence of The Real (الحق) through rational proofs, or rather, through the necessity of the intellect, knowing the existence of the Creator, the Exalted. They then demonstrated the unity of this Existing One who created them, and that it is impossible for the Necessary Existence (واجب الوجود) to exist by Himself and not be One. They further deduced the necessary attributes of the One who is Necessary Existence by Himself, including the relations (نسب) through which the contingent things (الممكنات) appeared. This demonstrated the possibility of Prophetic Mission (الرسالة).\n\nThen the Messenger came and presented proofs of his truthfulness, showing that he was a Messenger from Allah to us. We recognized through rational proofs that he was the Messenger of Allah, and we had no doubt. The rational proof established for us the truth of what he reported concerning what was attributed to Him. Yet, the intellect observed that the Messenger brought news concerning Allah, the Exalted, involving relations and matters that the rational proof deemed impossible and rejected. At this point, the intellect paused, and its knowledge was exhausted. This Divine report challenged its proof regarding what was attributed to Allah, yet the intellect was unable to accuse the reporter of lying.\n\n### [Knowledge via Transmission is not the same as Knowledge of Allah via Intellect]\n\nAmong the things this Lawgiver (الشارع) said to him was, \"Know your Lord.\" This rational person, had he not known his Lord—who is the fundamental reliance (الأصل المعول عليه)—would not have believed this Messenger. Therefore, the knowledge that the Messenger demanded he acquire concerning his Lord must be different from the knowledge provided by his rational proof. This requires him to strive to attain a knowledge *from Allah, by Allah*, through which he accepts with insight (بصيرة) those matters that Allah attributed to Himself and described Himself with, which the intellect had deemed impossible by its proof.\n\nBy confirming the Messenger, it became clear to him that there is something beyond the sphere (طور) of the intellect and what it yields through its thought (فكر)—another matter that grants knowledge of Allah which rational proofs cannot provide; indeed, they unanimously deem it impossible.\n\n### [Knowledge via Transmission is Beyond the Sphere of the Intellect]\n\nIf he acquires knowledge through this faculty, which he knows is beyond the sphere of the intellect, does his previous judgment—that which the intellect deemed impossible based on its thought—remain as it was, or does it cease? If that judgment of impossibility ceases, he must undoubtedly discover the aspect from which the error occurred, and that what he had taken as proof for deeming that matter impossible for Allah was not a proof in reality. If this is the case, what is that matter which is beyond the sphere of the intellect? For the intellect may be right or wrong.\n\nIf, however, the intellect retains its judgment—even after the Unveiling (كشف) and realization of the soundness of this matter which Allah attributed to Himself, described Himself with, and which the intellects of the Prophets and the intellect of this person of Unveiling (المكاشف) accepted without doubt or uncertainty—then he judges Allah as impossible rationally, based on his thought, not based on his acceptance. In this case, it is correct to say that this station is beyond the sphere of the intellect, based on its acquisition from thought, not based on its acquisition from Allah.\n\n### [How Strange that the Intellect Follows its Thought and not its Lord]\n\nIt is, in our view, among the most astonishing things that a human being should blindly follow his thought (فكر) and speculation (نظر), which are contingent like himself, and which are merely a faculty among the human faculties that Allah created in him and made subservient to the intellect. Yet, the intellect follows this faculty in what it provides, knowing that it does not exceed its rank and that it is inherently incapable of possessing the judgment of another faculty, such as the memorizing faculty (القوة الحافظة), the forming faculty (المصورة), the imagining faculty (المتخيلة), or the sensory faculties (الحواس) of touch, taste, smell, hearing, and sight. Despite all this limitation, the intellect follows it in knowing its Lord, yet it does not follow its Lord in what He reveals about Himself in His Book and upon the tongue of His Messenger (peace and blessings be upon him). This is one of the most astonishing errors that has occurred in the world.\n\n### [The Limits of the Horizons of the Intellect in terms of its Outer and Inner Faculties]\n\nEvery person of thought (صاحب فكر) is undoubtedly subject to this error, except for the one whose insight Allah has illuminated, so that he knows that Allah <<gave everything its creation>> [Q. 20:50]. He gave hearing its creation, so its perception does not exceed its bounds. He made the intellect dependent upon it, drawing from it the knowledge of sounds, the articulation of letters, the variation of expressions, and the diversity of languages. Thus, it distinguishes between the sound of a bird, the blowing of the wind, the creaking of a door, the murmuring of water, the cry of a human, the bleating of sheep, the lowing of rams, the mooing of cattle, and the grumbling of camels, and all similar sounds. The intellect, in its essence, has no power to perceive any of this unless hearing conveys it to it.\n\nSimilarly, Allah made the intellect dependent upon the visual faculty (القوة البصرية) for what it conveys of visible things. The intellect does not know green, yellow, blue, white, black, or the colors between them, unless the sight bestows this upon the intellect. This applies to all the faculties known as the senses.\n\nFurthermore, the Imagination (الخيال) is dependent upon these senses; it cannot imagine anything unless these faculties provide it. Then, if the memorizing faculty (القوة الحافظة) does not retain what the Imagination has acquired from these faculties, nothing remains in the Imagination. Thus, it is dependent upon the senses and the memorizing faculty.\n\nMoreover, the memorizing faculty may be subject to obstacles that prevent it from reaching the Imagination, causing the Imagination to miss many things due to the weakness of the memorizing faculty caused by the obstacle. Thus, it becomes dependent upon the recalling faculty (القوة المذكرة), which reminds it of what was absent, thereby assisting the memorizing faculty.\n\nThen, when the thinking faculty (القوة المفكرة) approaches the Imagination, it becomes dependent upon the forming faculty (القوة المصورة) to construct from the matters retained by the Imagination a form of proof (دليل) or evidence (برهان) that relies on sensory perceptions or necessities—matters inherent in the natural disposition (الجبلة). When thought conceives that proof, the intellect then takes it from thought and uses it to judge the thing proven.\n\nThere is no faculty that is without obstacles and errors, requiring the separation of the sound from the fixed truth. Look, my brother, how poor the intellect is, knowing nothing of what we have mentioned except through the mediation of these faculties, which are themselves fraught with defects. If the intellect manages to acquire something through these methods, and then Allah informs it of a matter, it hesitates to accept it and says, \"Thought rejects it.\" How ignorant is this intellect of the measure of its Lord, how it follows its thought and discredits its Lord!\n\n### [The Intellect's Path to Allah via the Law is Closer to Him than via Thought]\n\nWe have learned that the intellect possesses nothing by itself, and that the knowledge it acquires is only due to its inherent quality of acceptance (صفة القبول). Since this is its state, its acceptance of what its Lord reports about Himself, the Exalted, is more appropriate than its acceptance from its own thought. It knows that its thought follows its Imagination (الخيال), and its Imagination follows its senses (الحواس). Despite this following, it is not strong enough to retain what it possesses unless the memorizing and recalling faculties assist it.\n\nDespite this knowledge—that the faculties do not exceed their creation and what their reality grants, and that, viewed in its essence, the intellect has no knowledge except the necessary truths (الضروريات) upon which it was naturally disposed—it does not accept the word of one who tells it that there is another faculty beyond it that grants you the opposite of what the thinking faculty granted, a faculty attained by the People of Allah (أهل الله) among the angels, Prophets, and Saints (الأولياء), and spoken of by the revealed Books.\n\nSo, accept these Divine reports from it, for following The Real (الحق) is more appropriate. You have seen that the intellects of the Prophets, despite their multitude, and the Saints have accepted and believed in them, and have realized that following their Lord in knowing Himself is more appropriate than following their own thoughts. Why, O rational denier of these truths, do you not accept them from those who brought them, especially when these intellects claim to be in the station of faith in Allah, His Messengers, and His Books?\n\n### [Spiritual Disciplines, Solitude, and Striving, and their Effect on True Gnosis]\n\nWhen the intellects of the people of faith in Allah, the Exalted, realized that Allah demanded them to know Him after they had known Him through their speculative proofs (أدلتها النظرية), they knew that there was another knowledge of Allah that could not be reached through the path of thought. So, they employed spiritual disciplines (الرياضات), retreats (الخلوات), spiritual striving (المجاهدات), cutting off attachments (قطع العلائق), solitude, and sitting with Allah by emptying the vessel and sanctifying the heart from the impurities of thoughts, since the objects of thought are the contingent things (الأكوان).\n\nThey adopted this method from the Prophets and Messengers, and they heard that The Real (الحق), majestic is His glory, descends to His servants and seeks to win their affection. Thus, they knew that the path to Him from His side is closer than the path from their thought, especially since the people of faith had heard His saying, Hadith Qudsi: <<Whoever comes to Me walking, I come to him running.>>\n\nAnd since the heart (القلب) encompasses the majesty and greatness of Allah, they turned to Him completely, cutting themselves off from everything they acquired from these faculties. At the moment of this turning, Allah poured upon them from His Light a Divine Knowledge (علم إلهي) that made them know Allah, the Exalted, through the path of Witnessing (المشاهدة) and Theophany (التجلي), which no contingent thing can accept or reject. That is why He said, <<Indeed, in that is a reminder>>—referring to the knowledge of Allah through Witnessing—<<for whoever has a heart>> [Q. 50:37], and He did not say otherwise.\n\n### [The Heart as a Faculty Beyond the Sphere of the Intellect that Connects the Servant to the Lord]\n\nThe heart (القلب) is known for its constant turning (التقليب) in states; it never remains in one condition. Likewise are the Divine Theophanies (التجليات الإلهية). Whoever does not witness the Theophanies with his heart will deny them, for the intellect and other faculties are restricted, except for the heart, which is not restricted and is swift in changing in every state. For this reason, the Lawgiver said, Hadith: <<The heart is between two fingers of the Fingers of the All-Merciful; He turns it however He wills.>>\n\nThus, the heart turns with the turning of the Theophanies, but the intellect is not like that. The heart is the faculty that is beyond the sphere of the intellect. Had The Real intended the intellect by the word 'heart' in this verse, He would not have said, <<for whoever has a heart>>, for every human has an intellect. But not every human is granted this faculty beyond the sphere of the intellect, which is called the heart in this verse. Therefore, He said, <<for whoever has a heart>>. The turning (تقليب) in the heart is analogous to the Divine transformation in forms.\n\nTherefore, Gnosis (المعرفة) of The Real must come from The Real through the heart, not the intellect. The intellect then accepts it from the heart, just as it accepts from thought. He, glory be to Him, cannot be contained except by turning what is with you. The meaning of turning what is with you is that you have attached the Gnosis of Him, the Mighty and Majestic, and retained a certain matter in your knowledge, and the highest matter retained in your knowledge of Him is that He, glory be to Him, cannot be contained or restricted, nor does He resemble anything, nor does anything resemble Him. Thus, the uncontainable has been contained by distinguishing it from what is containable. This is like your saying, \"The inability to grasp the grasp is itself a grasp.\"\n\nThe Real is only encompassed by the heart (القلب). The meaning of this is that one should not judge The Real, the Exalted, by saying He accepts or does not accept, for the Essence (الذات) and I-ness (أنيته) of The Real are unknown to creation. Especially since He, majestic is His glory, informed about Himself using opposites in the Book and the Sunnah. He used analogy (تشبيه) in one place and transcendence (تنزيه) in another, as in <<There is nothing like Him>> [Q. 42:11] and similar to His saying, <<And He is the All-Hearing, the All-Seeing>> [Q. 42:11].\n\nThe thoughts of analogy (تشبيه) became dispersed, and the thoughts of transcendence (تنزيه) became scattered. For the one who truly affirms transcendence has restricted and confined Him in his transcendence and emptied Him of analogy, and the one who affirms analogy has also restricted and confined Him in analogy and emptied Him of transcendence. The Truth (الحق) lies in combining the judgment of both groups: He is not transcendent in a way that excludes analogy, nor is He analogous in a way that excludes transcendence. Do not release Him, nor restrict Him, for He is distinguished from restriction. If He were distinguished, He would be restricted in His release, and if He were restricted in His release, He would not be Him.\n\nThus, He is restricted by what He restricted Himself with, concerning the Attributes of Majesty (صفات الجلال), and He is released by what He named Himself with, concerning the Names of Perfection (أسماء الكمال). He is the One, The Real, The Manifest, The Hidden. There is no god but He, The Exalted, The Magnificent.\n\n### (Continuation) [The Lote-Tree is the Fifth Level where Deeds Terminate]\n\nAs for the secrets of the people of inspired reasoning (أهل الإلهام المستدلين), they do not pass beyond the Lote-Tree of the Utmost Boundary (سدرة المنتهى), for it is where the deeds of the children of Adam terminate. The end of every matter is where it began. If a Gnostic (عارف) who lacks knowledge of this matter tells you that the Footstool (الكرسي) is the place of the two Feet, tell him that the world of Creation, Command, and Obligation (التكليف) is divided starting from the Lote-Tree (السدرة), for it cuts across four levels. The Lote-Tree is the fifth level. It descends from the Pen (القلم) to the Tablet (اللوح), to the Throne (العرش), to the Footstool (الكرسي), to the Lote-Tree (السدرة).\n\n### [The Five Legal Rulings and their Corresponding Levels of Existence]\n\nThe Obligatory (الواجب) appeared from the Pen (القلم); the Recommended (المندوب) from the Tablet (اللوح); the Forbidden (المحظور) from the Throne (العرش); the Disliked (المكروه) from the Footstool (الكرسي); and the Permissible (المباح) from the Lote-Tree (السدرة). The Permissible is the portion of the soul (قسم النفس), and to it terminate the souls of the world of felicity (السعادة). To its roots, which are the Zaqqum, terminate the souls of the people of wretchedness (الشقاء). We have explained this in the *Kitab al-Tanazzulat al-Mawsiliyya* in the chapter on Monday.\n\nSince the division of the legal rulings (الأحكام) appeared from the Lote-Tree, the deeds that ascend—which are never devoid of one of these rulings—must terminate at the place from which they appeared, since they are known to be divided up to the Lote-Tree.\n\nThen, the Intellect (العقل), which is the Pen (القلم), looks upon the obligatory deeds (المفروضة) and provides them with support according to what it sees in them. The Tablet (اللوح) looks upon the recommended deeds (المندوب إليها) and provides them with support according to what it sees in them. The Throne (العرش) looks upon the forbidden things (المحظورات)—and it is the level of the All-Merciful (مستوي الرحمن)—so it only looks upon them with the eye of Mercy. This is why the destiny of those who commit them tends toward Mercy. The Footstool (الكرسي) looks upon the disliked deeds (المكروهة) according to what it sees in them, and it is under the protection of the Throne. Since the Throne is the level of the All-Merciful and the Footstool is the place of the two Feet, forgiveness and overlooking are hastened for those who commit the disliked deeds. This is why the one who abandons them is rewarded, but the one who performs them is not punished.\n\n### [The Punishment of the People of Hell in Hell: Eternity in the Fire]\n\nThe Book of the Righteous (الأبرار) is in Illiyyin, and this includes the disobedient who committed major and minor sins. As for the Book of the Wicked (الفجار), it is in Sijjin, which contains the roots of the Lote-Tree, which is the Zaqqum tree. There, the deeds of the wicked terminate in the lowest of the low (أسفل سافلين).\n\nIf the All-Merciful (الرحمن) has mercy upon them from the Throne of Rahmaniyya (عرش الرحمانية) with the glance we mentioned, He grants them bliss (نعيم) in their abode. They neither die therein nor love to leave it. Thus, they are perpetually and eternally in the bliss of the Fire (نعيم النار). This is like the bliss of a sleeper who sees a joyful dream while asleep, even though he may be sick, miserable, and poor in his bed, yet he sees himself in the dream as having sovereignty, grace, and kingship. If you look at the sleeper from the perspective of what he sees in his dream and the pleasure he derives from it, you would say he is in bliss, and you would be truthful. But if you look at him from the perspective of what you see in his rough bed, his illness, despair, poverty, and wounds, you would say he is in torment.\n\nThis is how the people of the Fire will be: <<He will neither die therein nor live>> [Q. 20:74]—meaning he will never awaken from his sleep. That is the mercy with which Allah shows mercy to the people of the Fire who are its inhabitants and their likes. For example, those suffering from heat among them are blessed by extreme cold (الزمهرير), and those suffering from cold are placed in extreme heat (الحرور). Their torment may also be the mere illusion of torment occurring to them.\n\nAll of this occurs after His saying, <<The punishment will not be lightened for them, and they will be in despair therein>> [Q. 43:75]. That is the time of their torment and their reckoning for their crimes, before the Mercy that preceded the Divine Wrath overtakes them.\n\nWhen the people of the Gardens (أهل الجنان) look upon the people of the Fire in this state and see their abodes in the Fire and what Allah has prepared therein, and the ugliness of their appearance, they say, \"They are tormented.\" But when they are granted Unveiling (كوشفوا) regarding the Divine spiritual beauty (الحسن المعنوي الإلهي) in the creation of that which is called ugliness, and they see what the people of the Fire are experiencing in their sleep, and they know the state of their temperaments, they say, \"They are in bliss.\"\n\nGlory be to the One who has power over whatever He wills. There is no god but He, The Almighty, The Wise. You have now understood the saying of Allah, the Exalted, <<He will neither die therein nor live>>, and the saying of the Messenger of Allah (peace and blessings be upon him), Hadith: <<As for the people of the Fire who are its inhabitants, they will neither die therein nor live.>>\n\nAnd Allah speaks the Truth, and He guides to the Way.",
    "ur": "**(باب اٹھاون) استدلال کرنے والے اہل الہام (Ilhām) کے اسرار کی معرفت میں، اور اس الٰہی علم کی معرفت میں جو قلب (Qalb) پر فیضان کرتا ہے اور اس کے خواطر (Khawāṭir) کو منتشر اور متفرق کر دیتا ہے۔**\n\n> جب وہ (الحق) تمہیں الہام (Ilhām) کے ذریعے علم عطا کرے،\n> تو اسے حاصل کر لو، کیونکہ تم اس سے سعادت مند ہو جاؤ گے۔\n> یہ شہد کی مکھی کی مانند ہے جس کے معانی مختلف ہیں،\n> اپنی بنیادوں میں مضبوط اور درست ہے۔\n> تم پاکیزہ اصل سے پاکیزہ چیز حاصل کرتے ہو،\n> اور تم ہمیشہ اس کے حال کے شاہد ہو۔\n> اور درختوں اور بلند پہاڑوں میں،\n> اس کے عمل سے ایک مضبوط محل تعمیر ہوتا ہے۔\n> پس شہد کی مکھی تمہیں بلندیوں سے عاجز نہ کر دے،\n> جبکہ تم سردار، منتخب اور مضبوط ہو۔\n> تمہاری طرف سے نیکی اور اختیار کا ارادہ ہے،\n> جیسا کہ تمہارے لیے تمہاری منزلوں میں مقاصد ہیں۔\n> پس تحقیق کرو اور ایک واحد علم کی تلاش کرو،\n> جو تمہاری مانند ہو، کیونکہ تم ہی نئی تخلیق ہو۔\n\n### [اللہ کی معرفت (Ma'rifah) عقل اور نقل کے طریقوں سے]\n\nجان لو، اللہ تمہیں اپنی روح سے مدد دے، کہ اللہ عزوجل نے ہمیں اپنی الوہیت میں اپنی وحدانیت کے علم کا حکم دیا ہے۔ لیکن جب نفوس نے یہ حکم سنا، جبکہ وہ اپنے فکر (Fikr) سے غور کر چکے تھے اور عقلی دلائل سے بلکہ عقل کی ضرورت سے باری تعالیٰ کے وجود کے علم پر دلالت کر چکے تھے، پھر انہوں نے اس موجود کی توحید پر دلالت کی جس نے انہیں پیدا کیا، اور یہ کہ واجب الوجود (Wājib al-Wujūd) کا اپنے لیے موجود ہونا محال ہے اور اسے ایک ہی ہونا چاہیے۔ پھر انہوں نے ان نسبتوں پر استدلال کیا جو واجب الوجود (Wājib al-Wujūd) کے لیے ہونی چاہئیں جن کے ذریعے ممکنات کا ظہور ہوا، اور رسالت کے امکان پر دلالت کی۔ پھر رسول (Rasūl) تشریف لائے اور اپنی سچائی پر دلائل ظاہر کیے کہ وہ اللہ کی طرف سے ہمارے لیے رسول ہیں۔ پس ہم نے عقلی دلائل سے جانا کہ وہ اللہ کے رسول ہیں، اور ہمیں کوئی شک نہیں ہوا۔ اور ہمیں عقلی دلیل قائم ہو گئی کہ وہ جو کچھ اللہ تعالیٰ کے بارے میں خبر دیتے ہیں وہ سچ ہے۔ اور عقل نے دیکھا کہ وہ اللہ تعالیٰ کے بارے میں ایسی نسبتیں اور امور بیان کرتے ہیں جنہیں عقلی دلیل محال قرار دیتی تھی اور رد کرتی تھی۔ پس عقل رک گئی اور اس کی معرفت (Ma'rifah) نے اس الٰہی خبر پر قدح کی جو اس نے اپنے رب کی طرف منسوب کی، لیکن وہ خبر دینے والے (رسول) کو جھٹلا نہیں سکتی۔\n\n### [نقل کے ذریعے معرفت (Ma'rifah) اللہ کی معرفت (Ma'rifah) بذریعہ عقل نہیں ہے]\n\nپھر اس شارع (Shāri') نے جو کچھ کہا، اس میں سے یہ بھی تھا کہ: \"اپنے رب کو پہچانو۔\" اور یہ عاقل شخص اگر اپنے رب کو نہ جانتا جو کہ اصل اور بھروسے کی جگہ ہے، تو وہ اس رسول کی تصدیق نہ کرتا۔ لہٰذا، ضروری ہے کہ وہ علم جس کے ذریعے رسول نے اسے اپنے رب کو جاننے کا مطالبہ کیا، وہ اس علم سے مختلف ہو جو اس کی دلیل نے اسے دیا تھا، یعنی یہ کہ وہ اللہ سے، اللہ کے ذریعے ایک ایسا علم حاصل کرنے کی کوشش کرے جس سے وہ بصیرت کے ساتھ ان امور کو قبول کرے جو اللہ نے اپنی ذات کی طرف منسوب کیے ہیں اور اپنی ذات کو ان سے متصف کیا ہے، جنہیں عقل نے اپنی دلیل سے محال قرار دیا تھا۔ پس رسول کی تصدیق سے اس کے لیے یہ بات واضح ہو گئی کہ عقل اور اس کے فکر (Fikr) سے حاصل ہونے والے علم کے پیچھے کوئی اور امر ہے جو اللہ کے بارے میں ایسا علم عطا کرتا ہے جو عقلی دلائل نہیں دے سکتیں، بلکہ وہ اسے یکسر محال قرار دیتی ہے۔\n\n### [نقلی معرفت (Ma'rifah) عقل کی حد (Ṭawr al-Aql) سے ماورا ہے]\n\nپس جب وہ اس قوت کے ذریعے جان لیتا ہے جسے وہ عقل کی حد (Ṭawr al-Aql) سے ماورا سمجھتا ہے، تو کیا اس کے لیے وہ حکم باقی رہتا ہے جو عقل اپنے فکر (Fikr) کی رو سے محال قرار دیتی تھی، یا وہ حکم باقی نہیں رہتا؟ اگر وہ حکم باقی نہیں رہتا کہ یہ محال ہے، تو اسے بلا شک وہ وجہ ضرور مل جائے گی جس سے اس سے غلطی سرزد ہوئی تھی، اور یہ کہ جس چیز کو اس نے اللہ پر اس امر کو محال قرار دینے کی دلیل بنایا تھا، وہ حقیقت میں دلیل نہیں تھی۔ اور اگر ایسا ہے، تو وہ امر کیا ہے جو عقل کی حد (Ṭawr al-Aql) سے ماورا ہے؟ کیونکہ عقل کبھی صحیح ہوتی ہے اور کبھی غلطی کرتی ہے۔ اور اگر عقل کے لیے اس امر کی صحت کے کشف (Kashf) اور تحقیق کے بعد بھی حکم باقی رہے جسے اللہ نے اپنی ذات کی طرف منسوب کیا اور اپنی ذات کو اس سے متصف کیا، اور جسے انبیاء کی عقلوں نے اور اس مکاشف (جس پر کشف ہوا) کی عقل نے بلا شک و شبہ قبول کر لیا، اور اس کے باوجود وہ اللہ پر یہ حکم لگائے کہ وہ امر عقلی طور پر محال ہے، اپنے فکر (Fikr) کی رو سے نہ کہ اپنے قبول کی رو سے، تو اس وقت یہ صحیح ہو گا کہ وہ مقام عقل کی حد (Ṭawr al-Aql) سے ماورا ہے، اس لحاظ سے کہ وہ اسے فکر (Fikr) سے نہیں بلکہ اللہ سے حاصل کرتا ہے۔\n\n### [عقل پر تعجب ہے کہ وہ اپنے فکر (Fikr) کی پیروی کرتی ہے اور اپنے رب کی نہیں]\n\nاور ہمارے نزدیک سب سے عجیب بات یہ ہے کہ انسان اپنے فکر (Fikr) اور اپنے غور و فکر کی تقلید کرے، جبکہ وہ بھی اسی کی طرح ایک حادث (پیدا شدہ) چیز ہے اور انسان کی ان قوتوں میں سے ایک قوت ہے جسے اللہ نے اس میں پیدا کیا ہے اور اس قوت کو عقل کا خادم بنایا ہے۔ اور عقل اس قوت کی تقلید کرتی ہے جو یہ قوت اسے دیتی ہے، حالانکہ وہ جانتی ہے کہ یہ اپنے مرتبے سے تجاوز نہیں کر سکتی اور یہ بذات خود کسی دوسری قوت کے حکم سے عاجز ہے، جیسے قوت حافظہ، قوت مصورہ، قوت متخیلہ، اور وہ قوتیں جو حواس ہیں جیسے لمس، ذائقہ، سونگھنا، سننا، اور دیکھنا۔ اور اس تمام کمی کے باوجود، عقل اپنے رب کی معرفت (Ma'rifah) میں اس کی تقلید کرتی ہے، لیکن اپنے رب کی تقلید نہیں کرتی جو وہ اپنی کتاب میں اور اپنے رسول صلی اللہ علیہ وسلم کی زبان پر اپنی ذات کے بارے میں خبر دیتا ہے۔ پس یہ دنیا میں واقع ہونے والی سب سے عجیب غلطیوں میں سے ہے۔\n\n### [عقل کے آفاق کی حدود اس کی ظاہری اور باطنی قوتوں کے لحاظ سے]\n\nاور ہر صاحب فکر (Fikr) بلا شک اس غلطی کے حکم کے تحت ہے، سوائے اس کے جس کی بصیرت کو اللہ نے منور کر دیا ہو، پس اس نے جان لیا کہ اللہ نے *أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ* (ہر چیز کو اس کی تخلیق عطا کی)۔ پس اس نے سننے کی قوت کو اس کی تخلیق عطا کی، لہٰذا وہ اپنے ادراک سے تجاوز نہیں کر سکتی۔ اور اس نے عقل کو اس کا محتاج بنایا کہ وہ اس سے آوازوں کی معرفت، حروف کے ٹکڑے، الفاظ کی تبدیلی، اور زبانوں کے تنوع میں مدد لے، تاکہ وہ پرندے کی آواز، ہوا کے چلنے، دروازے کے چرچرانے، پانی کے بہنے، انسان کے چلانے، بکری کی آواز، مینڈھوں کی آواز، گائے کے ڈکارنے، اونٹ کے بلبلانے اور اس طرح کی تمام آوازوں میں فرق کر سکے۔ اور عقل کی قوت میں بذات خود ان میں سے کسی چیز کا ادراک نہیں ہے جب تک کہ سماعت اسے نہ پہنچائے۔ اسی طرح قوت بصری، اللہ نے عقل کو اس کا محتاج بنایا ہے جو وہ اسے بصری چیزوں سے پہنچاتی ہے۔ پس عقل نہ سبز رنگ کو جانتی ہے، نہ پیلے کو، نہ نیلے کو، نہ سفید کو، نہ سیاہ کو، اور نہ ہی ان کے درمیان کے رنگوں کو، جب تک کہ بصارت عقل پر یہ انعام نہ کرے۔ اور اسی طرح تمام حواس سے جانی جانے والی قوتیں ہیں۔ پھر خیال (Imagination) ان حواس کا محتاج ہے، پس وہ کسی چیز کا تصور نہیں کر سکتا مگر جو یہ قوتیں اسے دیتی ہیں۔ پھر اگر قوت حافظہ خیال کے پاس موجود چیزوں کو نہ روکے جو اسے ان قوتوں سے حاصل ہوئی ہیں، تو خیال میں ان میں سے کچھ باقی نہیں رہتا۔ پس وہ حواس اور قوت حافظہ کا محتاج ہے۔ پھر قوت حافظہ پر ایسی رکاوٹیں آ سکتی ہیں جو اس کے اور خیال کے درمیان حائل ہو جائیں، تو قوت حافظہ کی کمزوری کی وجہ سے خیال سے بہت سی چیزیں فوت ہو جاتی ہیں کیونکہ رکاوٹ موجود ہے۔ پس وہ قوت مذکرہ (یاد دلانے والی قوت) کا محتاج ہوا، جو اسے وہ چیز یاد دلاتی ہے جو اس سے غائب ہو گئی تھی، پس وہ قوت حافظہ کی مددگار ہے۔ پھر جب قوت مفکرہ (غور و فکر کرنے والی قوت) خیال کے پاس آتی ہے، تو وہ قوت مصورہ (تصویر بنانے والی قوت) کی محتاج ہوتی ہے تاکہ وہ ان امور سے جو خیال نے ضبط کیے ہیں، کسی چیز پر دلیل کی صورت یا برہان کو ترکیب دے جس میں وہ محسوسات یا ضروریات پر انحصار کرے، جو کہ فطرت میں مرکوز ہیں۔ پس جب فکر (Fikr) اس دلیل کا تصور کر لیتا ہے، تب عقل اسے اس سے لے لیتی ہے اور اس کے ذریعے مدلول پر حکم لگاتی ہے۔ اور کوئی قوت ایسی نہیں ہے جس میں رکاوٹیں اور غلطیاں نہ ہوں، لہٰذا اسے صحیح اور ثابت سے الگ کرنے کی ضرورت ہوتی ہے۔ پس اے میرے بھائی! دیکھو کہ عقل کتنی محتاج ہے، جہاں وہ ان مذکورہ چیزوں میں سے کسی کو نہیں جانتی مگر ان قوتوں کے واسطے سے، اور ان میں بھی بہت سی خرابیاں ہیں۔ پس جب عقل کے لیے ان طریقوں سے کچھ حاصل کرنا ممکن ہو جاتا ہے، پھر اللہ اسے کسی امر کی خبر دیتا ہے، تو وہ اسے قبول کرنے میں توقف کرتی ہے اور کہتی ہے کہ فکر (Fikr) اسے رد کرتا ہے۔ پس یہ عقل اپنے رب کی قدر کے بارے میں کتنی جاہل ہے کہ اس نے اپنے فکر (Fikr) کی تقلید کی اور اپنے رب پر جرح کی۔\n\n### [اللہ کی طرف عقل کا راستہ شرع کی طرف سے فکر (Fikr) کی طرف سے زیادہ قریب ہے]\n\nہم نے جان لیا کہ عقل کے پاس بذات خود کچھ نہیں ہے، اور جو علم وہ حاصل کرتی ہے وہ صرف اس وجہ سے ہے کہ اس میں قبول کرنے کی صفت ہے۔ جب وہ اس مرتبے پر ہے، تو اس کے لیے اپنے رب سے اس چیز کو قبول کرنا جو وہ اپنی ذات کے بارے میں خبر دیتا ہے، اپنے فکر (Fikr) سے قبول کرنے سے زیادہ اولیٰ ہے۔ اور وہ جانتا ہے کہ اس کا فکر (Fikr) اس کے خیال کا مقلد ہے، اور اس کا خیال اس کے حواس کا مقلد ہے۔ اور اپنی تقلید کے باوجود، وہ اپنے پاس موجود چیزوں کو روکنے پر بھی قوی نہیں ہے جب تک کہ قوت حافظہ اور مذکرہ اس کی مدد نہ کریں۔ اور اس معرفت (Ma'rifah) کے باوجود کہ یہ قوتیں اپنی تخلیق اور جو کچھ ان کی حقیقت عطا کرتی ہے، اس سے تجاوز نہیں کرتیں، اور یہ کہ اپنی ذات کے لحاظ سے اس کے پاس صرف وہ ضروریات ہیں جن پر وہ فطرت میں پیدا ہوا ہے، وہ اس شخص کی بات قبول نہیں کرتا جو اسے کہتا ہے کہ تمہارے پیچھے ایک اور قوت ہے جو تمہیں وہ چیز دیتی ہے جو قوت مفکرہ نے نہیں دی، جسے اہل اللہ (فرشتوں، انبیاء اور اولیاء) نے حاصل کیا ہے، اور جس کا ذکر نازل شدہ کتابوں نے کیا ہے۔ پس ان الٰہی خبروں کو ان سے قبول کرو، کیونکہ الحق (Al-Ḥaqq) کی تقلید زیادہ اولیٰ ہے۔ اور تم نے دیکھا ہے کہ انبیاء کی عقلوں نے، ان کی کثرت کے باوجود، اور اولیاء نے اسے قبول کیا ہے، اس پر ایمان لائے ہیں، اور اس کی تصدیق کی ہے، اور انہوں نے دیکھا ہے کہ اپنے رب کی معرفت (Ma'rifah) میں اس کی تقلید کرنا اپنے افکار کی تقلید کرنے سے زیادہ اولیٰ ہے۔ پس اے عاقل منکر! تمہیں کیا ہو گیا ہے کہ تم اسے قبول نہیں کرتے جو اسے لایا ہے، خاص طور پر ان عقلوں سے جو کہتی ہیں کہ وہ اللہ، اس کے رسولوں اور اس کی کتابوں پر ایمان کے مقام پر ہیں۔\n\n### [ریاضتیں، خلوتیں، اور مجاہدات (Mujāhadāt) اور حقیقی معرفت (Ma'rifah) میں ان کا اثر]\n\nاور جب اللہ پر ایمان رکھنے والوں کی عقلوں نے دیکھا کہ اللہ نے ان سے مطالبہ کیا ہے کہ وہ اسے پہچانیں، اس کے بعد کہ انہوں نے اسے اپنے نظری دلائل سے پہچان لیا تھا، تو انہوں نے جان لیا کہ اللہ کے بارے میں کوئی اور علم بھی ہے جو فکر (Fikr) کے راستے سے حاصل نہیں ہو سکتا۔ پس انہوں نے ریاضتیں، خلوتیں، اور مجاہدات (Mujāhadāt) اختیار کیے، تعلقات کو منقطع کیا، تنہائی اختیار کی، اور محل کو خالی کر کے اور قلب (Qalb) کو افکار کی آلودگیوں سے پاک کر کے اللہ کے ساتھ بیٹھے، کیونکہ افکار کا تعلق کائنات سے ہے۔ اور انہوں نے یہ طریقہ انبیاء اور رسولوں سے اختیار کیا، اور سنا کہ الحق (Al-Ḥaqq) جل جلالہ اپنے بندوں کی طرف نزول فرماتا ہے اور انہیں اپنی طرف مائل کرتا ہے۔ پس انہوں نے جان لیا کہ اس کی طرف جانے کا راستہ اس کی طرف سے ان کے فکر (Fikr) کے راستے سے زیادہ قریب ہے، خاص طور پر اہل ایمان کے لیے، جنہوں نے سنا ہے:\n\n**حدیث قدسی کا مفہوم:**\n*مَنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً* (جو میری طرف چل کر آتا ہے، میں اس کی طرف دوڑ کر آتا ہوں)۔\n\nاور یہ کہ اس کا قلب (Qalb) اللہ کے جلال اور عظمت کو سمو سکتا ہے۔ پس وہ پوری طرح اس کی طرف متوجہ ہوا اور ان تمام قوتوں سے منقطع ہو گیا جن سے وہ علم حاصل کرتا تھا۔ اس توجہ کے وقت، اللہ نے اس پر اپنے نور سے ایک الٰہی علم کا فیضان کیا جس نے اسے مشاہدہ (Mushāhadah) اور التجلی (Tajallī) کے ذریعے اللہ تعالیٰ کی معرفت (Ma'rifah) کرائی، جسے کوئی کائنات قبول نہیں کرتی اور نہ ہی کوئی رد کرتا ہے۔ اسی لیے اس نے فرمایا: *إِنَّ فِي ذَلِكَ* (بیشک اس میں) - یہاں اشارہ اللہ کے علم کی طرف ہے مشاہدہ (Mushāhadah) کے لحاظ سے - *لَذِكْرَىٰ لِمَن كَانَ لَهُ قَلْبٌ* (یقیناً اس میں نصیحت ہے اس شخص کے لیے جس کے پاس قلب (Qalb) ہو)۔ اور اس نے اس کے علاوہ کچھ نہیں کہا۔\n\n### [قلب (Qalb) عقل کی حد (Ṭawr al-Aql) سے ماورا ایک قوت کے طور پر جو بندے کو رب سے جوڑتی ہے]\n\nکیونکہ قلب (Qalb) ہمیشہ احوال میں پلٹنے کی وجہ سے معلوم ہے، پس وہ ایک حالت پر باقی نہیں رہتا۔ اور اسی طرح الٰہی التجلیات (Tajalliyāt) بھی ہیں۔ پس جو شخص اپنے قلب (Qalb) سے التجلیات (Tajalliyāt) کا شہود (Shuhūd) نہیں کرتا، وہ ان کا انکار کرتا ہے۔ کیونکہ عقل اور دیگر قوتیں مقید ہیں، سوائے قلب (Qalb) کے، کیونکہ وہ مقید نہیں ہوتا اور ہر حال میں تیزی سے پلٹتا ہے۔ اسی لیے:\n\n**حدیث کا ترجمہ:**\nشارع (Shāri') نے فرمایا: *إِنَّ الْقَلْبَ بَيْنَ إِصْبَعَيْنِ مِنْ أَصَابِعِ الرَّحْمَنِ يُقَلِّبُهُ كَيْفَ يَشَاءُ* (بیشک قلب (Qalb) رحمن کی انگلیوں میں سے دو انگلیوں کے درمیان ہے، وہ اسے جیسے چاہتا ہے پلٹتا ہے)۔\n\nپس وہ التجلیات (Tajalliyāt) کے پلٹنے سے پلٹتا ہے، جبکہ عقل ایسی نہیں ہے۔ پس قلب (Qalb) وہ قوت ہے جو عقل کی حد (Ṭawr al-Aql) سے ماورا ہے۔ اگر الحق (Al-Ḥaqq) کا اس آیت میں قلب (Qalb) سے مراد عقل ہوتا، تو وہ یہ نہ فرماتا: *لِمَن كَانَ لَهُ قَلْبٌ* (اس کے لیے جس کے پاس قلب (Qalb) ہو)، کیونکہ ہر انسان کے پاس عقل ہوتی ہے۔ لیکن ہر انسان کو وہ قوت نہیں دی جاتی جو عقل کی حد (Ṭawr al-Aql) سے ماورا ہے اور جسے اس آیت میں قلب (Qalb) کہا گیا ہے۔ اسی لیے اس نے فرمایا: *لِمَن كَانَ لَهُ قَلْبٌ*۔ پس قلب (Qalb) میں پلٹنا، صورتوں میں الٰہی تحول کے مشابہ ہے۔ پس الحق (Al-Ḥaqq) کی معرفت (Ma'rifah) الحق (Al-Ḥaqq) سے صرف قلب (Qalb) کے ذریعے ہوتی ہے، عقل کے ذریعے نہیں۔ پھر عقل اسے قلب (Qalb) سے قبول کرتی ہے، جیسے وہ فکر (Fikr) سے قبول کرتی ہے۔ پس وہ (سبحانہ) اس کے سوا کسی چیز کو نہیں سمو سکتا کہ وہ تمہارے پاس موجود چیز کو پلٹ دے۔ اور تمہارے پاس موجود چیز کو پلٹنے کا مطلب یہ ہے کہ تم نے اس کی معرفت (Ma'rifah) کو اس سے وابستہ کیا اور اپنے علم میں ایک امر کو ضبط کیا، اور سب سے اعلیٰ امر جو تم نے اپنے علم میں اس کے بارے میں ضبط کیا وہ یہ ہے کہ وہ (سبحانہ) ضبط نہیں ہوتا، نہ مقید ہوتا ہے، نہ کسی چیز سے مشابہت رکھتا ہے اور نہ کوئی چیز اس سے مشابہت رکھتی ہے۔ پس جو ضبط نہیں ہوتا وہ ضبط ہو گیا، کیونکہ وہ اس چیز سے ممتاز ہے جو ضبط ہوتی ہے۔ پس جو ضبط نہیں ہوتا وہ ضبط ہو گیا، جیسے تمہارا یہ قول کہ \"ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے\"۔ اور الحق (Al-Ḥaqq) کو صرف قلب (Qalb) نے سمویا ہے۔ اور اس کا مطلب یہ ہے کہ الحق (Al-Ḥaqq) تعالیٰ پر یہ حکم نہ لگایا جائے کہ وہ قبول نہیں کرتا یا قبول کرتا ہے۔ کیونکہ الحق (Al-Ḥaqq) کی ذات اور اس کی انیت (Ipseity) کائنات کے نزدیک مجہول ہے۔ خاص طور پر جب اس نے جل جلالہ نے کتاب اور سنت میں اپنی ذات کے بارے میں متضاد چیزوں کی خبر دی ہے۔ پس ایک جگہ تشبیہ دی اور ایک جگہ تنزیہ کی، جیسے *لَيْسَ كَمِثْلِهِ شَيْءٌ* (اس کی مانند کوئی چیز نہیں) اور اس کے مشابہ قول *وَهُوَ السَّمِيعُ الْبَصِيرُ* (اور وہ سننے والا، دیکھنے والا ہے)۔ پس تشبیہ کے خواطر (Khawāṭir) متفرق ہو گئے اور تنزیہ کے خواطر (Khawāṭir) منتشر ہو گئے۔ کیونکہ حقیقی منزہ نے اسے اپنی تنزیہ میں مقید اور محدود کر دیا اور تشبیہ کو اس سے خالی کر دیا۔ اور مشبہ نے بھی اسے تشبیہ میں مقید اور محدود کر دیا اور تنزیہ کو اس سے خالی کر دیا۔ اور الحق (Al-Ḥaqq) دونوں گروہوں کے حکم کے ساتھ جمع کرنے میں ہے۔ پس وہ ایسی تنزیہ نہیں کرتا جو تشبیہ سے خارج ہو جائے، اور نہ ایسی تشبیہ دیتا ہے جو تنزیہ سے خارج ہو جائے۔ پس نہ مطلق کرو اور نہ مقید کرو، کیونکہ وہ تقیید سے ممتاز ہے۔ اور اگر وہ تقیید سے ممتاز ہوتا تو اپنے اطلاق میں مقید ہو جاتا، اور اگر وہ اپنے اطلاق میں مقید ہو جاتا تو وہ نہ ہوتا۔ پس وہ ان صفات جلال سے مقید ہے جن سے اس نے خود کو مقید کیا، اور وہ ان اسماء کمال سے مطلق ہے جن سے اس نے خود کو موسوم کیا، اور وہ واحد، الحق (Al-Ḥaqq)، ظاہر، پوشیدہ ہے، اس کے سوا کوئی معبود نہیں، وہ بلند، عظیم ہے۔\n\n### (وصل) [سدرۃ المنتہیٰ (Sidrat al-Muntahā) پانچواں مرتبہ ہے جہاں اعمال ختم ہوتے ہیں]\n\nاور جہاں تک استدلال کرنے والے اہل الہام (Ilhām) کے اسرار کا تعلق ہے، تو وہ سدرۃ المنتہیٰ (Sidrat al-Muntahā) سے تجاوز نہیں کرتے، کیونکہ بنی آدم کے اعمال اسی پر ختم ہوتے ہیں۔ اور ہر امر کی انتہا اسی کی طرف ہوتی ہے جہاں سے وہ شروع ہوا تھا۔ پس اگر کوئی عارف تمہیں کہے جسے اس امر کا علم نہیں ہے کہ کرسی دونوں قدموں کی جگہ ہے، تو اسے کہو کہ وہ عالم خلق اور امر ہے، اور تکلیف (شرعی احکام) سدرۃ المنتہیٰ (Sidrat al-Muntahā) سے تقسیم ہوئی ہے۔ کیونکہ اس نے چار مراتب طے کیے ہیں اور سدرۃ المنتہیٰ (Sidrat al-Muntahā) پانچواں مرتبہ ہے۔ پس وہ قلم (Qalam) سے لوح (Lawḥ) کی طرف، عرش (Arsh) کی طرف، کرسی (Kursī) کی طرف، اور سدرۃ المنتہیٰ (Sidrat al-Muntahā) کی طرف نازل ہوا۔\n\n### [پانچ شرعی احکام اور وجود کے مراتب کے ساتھ ان کا مقابلہ]\n\nپس واجب (Wājib) قلم (Qalam) سے ظاہر ہوا، اور مندوب (Mustaḥabb) لوح (Lawḥ) سے، اور محظور (Ḥarām) عرش (Arsh) سے، اور مکروہ (Makrūh) کرسی (Kursī) سے، اور مباح (Mubāḥ) سدرۃ المنتہیٰ (Sidrat al-Muntahā) سے۔ اور مباح (Mubāḥ) نفس کا حصہ ہے۔ اور عالم سعادت کے نفوس اسی پر ختم ہوتے ہیں۔ اور اس کی اصلیں، جو کہ زقوم ہیں، اہل شقاوت کے نفوس کی انتہا ہیں۔ اور ہم نے ان کا بیان کتاب \"التنزلات الموصلیہ\" میں یوم الاثنین کے باب میں کیا ہے۔ اور جب احکام کی تقسیم سدرۃ المنتہیٰ (Sidrat al-Muntahā) سے ظاہر ہوئی، تو جب اعمال اوپر چڑھتے ہیں جو ان احکام میں سے کسی ایک سے خالی نہیں ہوتے، تو ان کی انتہا اسی جگہ پر ہونی چاہیے جہاں سے وہ ظاہر ہوئے تھے، کیونکہ وہ سدرۃ المنتہیٰ (Sidrat al-Muntahā) تک تقسیم ہونے کی وجہ سے پہچانے جاتے ہیں۔ پھر عقل جو کہ قلم (Qalam) ہے، فرض کیے گئے اعمال پر نظر ڈالتی ہے، اور جو کچھ وہ ان میں دیکھتی ہے اس کے مطابق انہیں مدد دیتی ہے۔ اور لوح (Lawḥ) سے مندوب (Mustaḥabb) اعمال پر نظر ہوتی ہے، اور جو کچھ وہ ان میں دیکھتی ہے اس کے مطابق انہیں مدد دیتی ہے۔ اور عرش (Arsh) سے محظورات (Ḥarām things) پر نظر ہوتی ہے، اور وہ رحمن کا مستویٰ (جگہ قرار) ہے، پس وہ انہیں صرف رحمت کی آنکھ سے دیکھتا ہے۔ اور اسی وجہ سے ان کے اصحاب کا انجام رحمت کی طرف ہوتا ہے۔ اور کرسی (Kursī) سے مکروہ (Makrūh) اعمال پر نظر ہوتی ہے، اور وہ ان پر اس کے مطابق نظر ڈالتا ہے جو وہ ان میں دیکھتا ہے، اور وہ عرش (Arsh) کی حفاظت کے تحت ہے، اور عرش (Arsh) رحمن کا مستویٰ (جگہ قرار) ہے، اور کرسی (Kursī) دونوں قدموں کی جگہ ہے۔ پس مکروہ اعمال کے اصحاب کے لیے عفو اور درگزر میں تیزی ہوتی ہے۔ اور اسی وجہ سے اسے چھوڑنے والے کو اجر ملتا ہے اور کرنے والے کو مؤاخذہ نہیں ہوتا۔\n\n### [اہل جہنم کا جہنم میں عذاب: آگ میں ہمیشگی]\n\nپس نیک لوگوں کا نامہ اعمال علیین میں ہے، اور ان میں گناہگار، کبیرہ اور صغیرہ گناہوں والے بھی شامل ہیں۔ اور جہاں تک فاجروں کے نامہ اعمال کا تعلق ہے، تو وہ سجين میں ہے، اور اس میں سدرۃ المنتہیٰ (Sidrat al-Muntahā) کی اصلیں ہیں جو کہ شجرۃ الزقوم (Zaqqūm Tree) ہے۔ پس فاجروں کے اعمال اسفل سافلین (سب سے نچلی سطح) میں اسی پر ختم ہوتے ہیں۔ پس اگر رحمن نے انہیں رحمانیت کے عرش (Arsh) سے اس نظر سے رحم کیا جس کا ہم نے ذکر کیا، تو وہ ان کے لیے ان کے ٹھکانے میں نعمت پیدا کر دیتا ہے۔ پس وہ نہ اس میں مرتے ہیں اور نہ ہی محبت کرتے ہیں۔ پس وہ آگ کی نعمت میں ہمیشہ ہمیشہ کے لیے رہتے ہیں، جیسے سونے والے کی نعمت جو وہ اپنی نیند کی حالت میں خوشی کے خواب میں دیکھتا ہے۔ اور بسا اوقات وہ اپنے بستر پر بیمار، بدحال اور غریب ہوتا ہے، اور خواب میں خود کو بادشاہت، نعمت اور ملکیت والا دیکھتا ہے۔ پس اگر تم سونے والے کو اس لحاظ سے دیکھو جو وہ اپنے خواب میں دیکھتا ہے اور اس سے لذت حاصل کرتا ہے، تو تم کہو گے کہ وہ نعمت میں ہے اور تم سچ کہو گے۔ اور اگر تم اسے اس لحاظ سے دیکھو جو تم اسے اس کے کھردرے بستر، اس کی بیماری، اس کی مایوسی، اس کی غربت اور اس کے زخموں میں دیکھتے ہو، تو تم کہو گے کہ وہ عذاب میں ہے۔ اہل نار اسی طرح ہوں گے۔ پس *لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ* (نہ وہ اس میں مرے گا اور نہ جیئے گا)، یعنی وہ اپنی نیند سے کبھی بیدار نہیں ہو گا۔ پس یہ وہ رحمت ہے جس سے اللہ اہل نار پر رحم کرے گا جو اس کے اہل ہیں۔ اور ان کی مثالیں یہ ہیں کہ ان میں سے جو گرمی سے پریشان ہو گا وہ زمہریر (شدید ٹھنڈک) سے لطف اندوز ہو گا، اور جو ٹھنڈک سے پریشان ہو گا اسے حرور (شدید گرمی) میں رکھا جائے گا۔ اور ہو سکتا ہے کہ ان کا عذاب ان پر عذاب کے واقع ہونے کا وہم ہو۔ اور یہ سب اس کے بعد ہو گا جب اللہ کا قول ہے: *لَا يُفَتَّرُ عَنْهُمُ* (ان سے عذاب ہلکا نہیں کیا جائے گا) *وَهُمْ فِيهِ مُبْلِسُونَ* (اور وہ اس میں مایوس ہوں گے)۔ یہ ان کے عذاب کا وقت ہے اور ان کے جرائم پر ان کا مؤاخذہ ہے، اس سے پہلے کہ ان پر وہ رحمت لاحق ہو جو الٰہی غضب پر سبقت لے گئی۔ پس جب اہل جنت اس حالت میں اہل نار پر جھانکیں گے اور آگ میں ان کے ٹھکانے دیکھیں گے اور جو کچھ اللہ نے اس میں تیار کیا ہے اور وہ جس بدصورتی پر ہیں، تو وہ کہیں گے کہ وہ عذاب میں ہیں۔ اور جب ان پر اس چیز کی الٰہی معنوی خوبصورتی کا کشف (Kashf) ہو گا جسے بدصورتی کہا جاتا ہے، اور وہ دیکھیں گے کہ وہ اپنی نیند میں کس حال میں ہیں اور ان کے مزاج کے احوال کو جانیں گے، تو وہ کہیں گے کہ وہ نعمت میں ہیں۔ پس پاک ہے وہ جو جو چاہتا ہے اس پر قادر ہے، *لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ* (اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے)۔ پس تم نے اللہ تعالیٰ کے قول *لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ* (نہ وہ اس میں مرے گا اور نہ جیئے گا) اور رسول اللہ صلی اللہ علیہ وسلم کے قول کو سمجھ لیا: *أَمَّا أَهْلُ النَّارِ الَّذِينَ هُمْ أَهْلُهَا فَإِنَّهُمْ لَا يَمُوتُونَ فِيهَا وَلَا يَحْيَوْنَ* (جہاں تک اہل نار کا تعلق ہے جو اس کے اہل ہیں، تو وہ نہ اس میں مریں گے اور نہ جیئیں گے)۔\n\n**قرآنی آیت کا ترجمہ:**\n*وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ* (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب پنجاه و هشتم) در معرفت اسرار اهل الهام (الإلهام) و کسانی که با استدلال به معرفت می‌رسند، و شناخت علم الهی که بر قلب جاری شده و خواطر آن را پراکنده و متشتت ساخته است.\n\n> إذا أعطاك بالإلهام علما *** تحققه فأنت به سعيد\nچون با الهام (الإلهام) علمی به تو بخشد *** آن را محقق کن که تو به آن سعادتمندی\n> كمثل النحل مختلف المعاني *** قوي في مبانيه سديد\nهمچون زنبور عسل که معانی‌اش گوناگون است *** در ساختار خود قوی و استوار است\n> فتلقى طيبا عن طيب أصل *** وأنت لحالها أبدا شهيد\nپس پاکی را از اصل پاک دریافت می‌کنی *** و تو همیشه شاهد حال آن هستی\n> وفي الأشجار والشم الرواسي *** لها من فعلها قصر مشيد\nو در درختان و کوه‌های بلند و استوار *** برای آن از کارش قصری برافراشته است\n> فلا تعجزك للعلياء نحل *** وأنت السيد الندب الجليد\nپس زنبور عسل تو را از رسیدن به علو باز ندارد *** در حالی که تو سرور، بزرگوار و بردبار هستی\n> فمنك القصد خيرا واختيارا *** كما لك في منازلك القصود\nپس قصد خیر و اختیار از توست *** همان‌طور که در منازل تو مقاصدی هست\n> فحقق والتمس علما وحيدا *** كمثلك إنك الخلق الجديد\nپس تحقیق کن و علم یگانه را بجوی *** که تو مانند آنی، تو آفرینش جدید هستی\n\n### شناخت حق از طریق عقل و نقل\n\nبدان، خداوند تو را با روحی از جانب خود تأیید کند، که حق عز و جل ما را به علم وحدانیت خود در الوهیتش امر فرموده است. غیر از این، نفوس، هنگامی که این امر را از او شنیدند، با وجود اینکه با فکر خود نظر کرده و با ادله عقلی، بلکه با ضرورت عقل، بر وجود حق (الحق) دلالت کرده بودند، به علم وجود باری تعالی رسیدند. سپس بر توحید این موجودی که آن‌ها را خلق کرده است، دلالت کردند و اینکه محال است واجب‌الوجود (واجب الوجود) برای خود وجود داشته باشد و شایسته نیست جز یکی باشد. سپس بر آنچه شایسته است واجب‌الوجود برای خود باشد، از نسبت‌هایی که ممکنات (الممکنات) از طریق آن‌ها ظاهر شده‌اند، استدلال کردند و بر امکان رسالت دلالت نمودند. سپس رسول آمد و دلایلی بر صدق خود آشکار کرد که او فرستاده‌ای از جانب حق به سوی ماست. پس ما با ادله عقلی دانستیم که او رسول حق است و شک نکردیم. و دلیل عقلی بر صدق آنچه خبر می‌دهد، در آنچه به او نسبت داده می‌شود، برای ما اقامه شد. و دیدند که او در اخبارش از حق تعالی، نسبت‌ها و اموری را آورده است که دلیل عقلی آن‌ها را محال می‌دانست و رد می‌کرد. پس عقل متوقف شد و معرفت (المعرفة) آن را انکار کرد و این خبر الهی، دلیل عقل را به خاطر آنچه حق به خود نسبت داده بود، خدشه‌دار ساخت، در حالی که عقل توان تکذیب خبردهنده را نداشت.\n\n### شناخت از طریق نقل، عین شناخت حق از طریق عقل نیست\n\nسپس از جمله آنچه این شارع (الشارع) به او گفت، این بود که: «پروردگارت را بشناس.» و این عاقل اگر پروردگارش را که اصل مورد اعتماد است، نمی‌شناخت، این رسول را تصدیق نمی‌کرد. پس ناگزیر است که علمی که رسول از او خواسته است تا پروردگارش را با آن بشناسد، غیر از علمی باشد که دلیلش به او داده است. و آن این است که در تحصیل علمی از حق به واسطه حق بکوشد که با آن، این اموری را که حق به خود نسبت داده و خود را با آن‌ها وصف کرده و عقل با دلیل خود آن‌ها را محال دانسته بود، با بصیرت بپذیرد. پس با تصدیق رسول، برای او روشن شد که ورای عقل و آنچه با فکر خود می‌دهد، امر دیگری وجود دارد که از علم به حق، چیزی را می‌دهد که ادله عقلی نمی‌دهند، بلکه به طور قطع آن را محال می‌دانند.\n\n### معرفت نقلی ورای مرحله عقل است\n\nپس هنگامی که با این قوه‌ای که دانست ورای مرحله عقل است، به آن علم پیدا کرد، آیا حکم عقل در مورد آنچه عقل از حیث فکرش محال می‌دانست، بر همان حال باقی می‌ماند یا خیر؟ اگر حکم عقل بر محال بودن آن باقی نماند، پس ناگزیر است که به وجهی که از آن دچار اشتباه شده بود، بدون شک پی ببرد و بداند که آنچه آن را دلیلی بر محال بودن آن بر حق قرار داده بود، در نفس‌الامر دلیل نبوده است. و اگر چنین باشد، پس آن امر که ورای مرحله عقل است، چیست؟ زیرا عقل ممکن است درست بگوید و ممکن است خطا کند. و اگر حکم عقل پس از کشف (الکشف) و تحقیق (التحقیق) صحت این امر که حق به خود نسبت داده و خود را با آن وصف کرده و عقول انبیا و عقل این مکاشف آن را بدون شک و تردید پذیرفته‌اند، باقی بماند، با این حال، از حیث فکرش، نه از حیث پذیرش، بر حق حکم می‌کند که آن امر عقلاً محال است. در این صورت، صحیح است که آن مقام ورای مرحله عقل باشد، از جهت اخذ آن از فکر، نه از جهت اخذ آن از حق.\n\n### شگفتا از عقل که از فکر خود پیروی می‌کند و از پروردگارش پیروی نمی‌کند\n\nو از شگفت‌انگیزترین امور نزد ما این است که انسان از فکر و نظر خود تقلید کند، در حالی که آن نیز مانند خودش حادث است و قوه‌ای از قوای انسانی است که حق آن را در او خلق کرده و آن قوه را خادم عقل قرار داده است، و عقل از آن قوه در آنچه به او می‌دهد تقلید می‌کند. و می‌داند که آن قوه از مرتبه خود تجاوز نمی‌کند و در ذات خود از داشتن حکم قوه دیگری مانند قوه حافظه، مصوره، متخیله و قوای حواس از لمس، چشایی، بویایی، شنوایی و بینایی عاجز است. با وجود این همه قصور، عقل در شناخت پروردگارش از آن تقلید می‌کند و از پروردگارش در آنچه درباره خود در کتابش و بر زبان رسولش (صلی الله علیه و سلم) خبر می‌دهد، تقلید نمی‌کند. پس این از شگفت‌انگیزترین اشتباهاتی است که در عالم رخ داده است.\n\n### حدود آفاق عقل از حیث قوای ظاهری و باطنی آن\n\nو هر صاحب فکری بدون شک تحت حکم این اشتباه است، مگر کسی که حق بصیرتش را نورانی کرده باشد و بداند که حق **«أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ»** (به هر چیزی آفرینش آن را داده است). پس به شنوایی آفرینش آن را داده و از درک خود تجاوز نمی‌کند و عقل را نیازمند آن قرار داده است تا از آن، معرفت اصوات، تقطیع حروف، تغییر الفاظ و تنوع لغات را استمداد کند. پس بین صدای پرنده، وزش باد، جیرجیر در، صدای آب، فریاد انسان، صدای گوسفند، صدای قوچ، صدای گاو و صدای شتر و امثال این اصوات تمایز قائل می‌شود. و در قوه عقل از حیث ذاتش، ادراک هیچ یک از این‌ها نیست، مگر اینکه شنوایی آن را به عقل برساند. و همچنین قوه بینایی؛ حق عقل را در آنچه از دیدنی‌ها به او می‌رساند، نیازمند آن قرار داده است. پس عقل، سبزی، زردی، آبی، سفیدی، سیاهی و رنگ‌های بین آن‌ها را نمی‌شناسد، مگر اینکه بینایی این نعمت را به عقل ببخشد. و همین‌طور است همه قوایی که به حواس معروفند. سپس خیال (الخیال) نیازمند این حواس است، پس اصلاً چیزی را تخیل نمی‌کند مگر آنچه این قوا به او می‌دهند. سپس اگر قوه حافظه آنچه را که نزد خیال از این قوا حاصل شده است، نگه ندارد، چیزی از آن در خیال باقی نمی‌ماند. پس خیال نیازمند حواس و قوه حافظه است. سپس ممکن است موانعی بر قوه حافظه عارض شود که بین آن و خیال حائل گردد، پس امور بسیاری از خیال فوت می‌شود به دلیل ضعفی که بر قوه حافظه به علت وجود مانع عارض شده است. پس نیازمند قوه متذکره (المذکرة) می‌شود تا آنچه را از او غایب شده به یادش آورد، و این قوه در این امر یاور قوه حافظه است. سپس قوه مفکره (المفکرة) هنگامی که به خیال می‌آید، نیازمند قوه مصوره (المصورة) است تا با آن، از اموری که خیال ضبط کرده است، صورتی بسازد که دلیلی بر امری باشد و برهانی که در آن به محسوسات یا ضروریات تکیه کند، که اموری سرشته در فطرت هستند. پس هنگامی که فکر آن دلیل را تصور کرد، در آن هنگام عقل آن را از فکر می‌گیرد و با آن بر مدلول حکم می‌کند. و هیچ قوه‌ای نیست مگر اینکه موانع و اشتباهاتی دارد و نیاز به جدا کردن آن از صحیح و ثابت دارد. پس ای برادر من، بنگر که عقل چقدر نیازمند است، در حالی که هیچ یک از آنچه ذکر کردیم را نمی‌شناسد مگر به واسطه این قوا، و در آن‌ها نیز عیب‌ها و نقص‌ها وجود دارد. پس اگر برای عقل میسر شود که چیزی از این امور را از این طرق به دست آورد، سپس حق او را به امری خبر دهد، در پذیرش آن توقف می‌کند و می‌گوید: «فکر آن را رد می‌کند.» پس این عقل چقدر نسبت به قدر پروردگارش جاهل است که چگونه از فکر خود تقلید کرد و پروردگارش را جرح نمود.\n\n### راه عقل به سوی حق از جهت شرع، به او نزدیک‌تر است تا از جهت فکر\n\nما دانستیم که عقل از حیث ذات خود چیزی ندارد و آنچه از علوم کسب می‌کند، تنها به دلیل داشتن صفت قبول است. پس وقتی چنین است، پذیرش آنچه پروردگارش درباره خود خبر می‌دهد، برای او اولی‌تر است تا پذیرش از فکرش. در حالی که می‌داند فکرش مقلد خیالش است و خیالش مقلد حواسش است، و با وجود تقلید، بر نگه داشتن آنچه نزد اوست قوی نیست، مگر اینکه قوه حافظه و متذکره او را یاری کنند. با وجود این معرفت که قوا از آفرینش خود و آنچه حقیقتشان می‌دهد، تجاوز نمی‌کنند و اینکه عقل با نظر به ذات خود، علمی جز ضروریاتی که بر آن سرشته شده، ندارد، قول کسی را که به او می‌گوید: «قوه دیگری ورای تو وجود دارد که خلاف آنچه قوه مفکره به تو داده است، به تو می‌دهد، و اهل حق از ملائکه، انبیا و اولیا به آن دست یافته‌اند و کتب آسمانی به آن نطق کرده‌اند، پس این اخبار الهی را از آن بپذیر»، قبول نمی‌کند. در حالی که تقلید از حق اولی‌تر است. و دیده‌ای که عقول انبیا با کثرتشان و اولیا آن را پذیرفته‌اند و به آن ایمان آورده و تصدیق کرده‌اند و دیده‌اند که تقلید پروردگارشان در شناخت خود، اولی‌تر از تقلید افکارشان است. پس ای عاقل منکر آن، تو را چه شده که آن را از کسی که آورده است، نمی‌پذیری؟ به ویژه عقولی که می‌گویند در جایگاه ایمان به حق، رسولان و کتب او هستند.\n\n### ریاضت‌ها، خلوت‌ها و مجاهدت‌ها و تأثیر آن‌ها در معرفت حقیقی\n\nو هنگامی که عقول اهل ایمان به حق تعالی دیدند که حق از آن‌ها خواسته است که او را بشناسند، پس از آنکه او را با ادله نظری خود شناختند، دانستند که علم دیگری به حق وجود دارد که از طریق فکر به آن نمی‌رسند. پس به ریاضت‌ها، خلوت‌ها، مجاهدت‌ها، قطع علایق، انفراد و نشستن با حق با خالی کردن محل و تقدیس قلب (القلب) از آلودگی‌های افکار روی آوردند، زیرا متعلق افکار، اکوان (المکونات) هستند. و این طریقه را از انبیا و رسولان گرفتند و شنیدند که حق جل جلاله به سوی بندگانش فرود می‌آید و آن‌ها را به عطوفت می‌خواند. پس دانستند که راه به سوی او از جانب خودش، نزدیک‌تر است تا راه از فکرشان؛ به ویژه اهل ایمان که شنیده‌اند:\n> قول خداوند متعال: **«مَنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً»** (هر کس با راه رفتن به سوی من آید، من با شتاب به سوی او می‌روم.) (حدیث قدسی)\nو اینکه قلب او وسعت جلال و عظمت حق را دارد. پس با تمام وجود به سوی او روی آورد و از هر آنچه از این قوا می‌گرفت، منقطع شد. در این توجه، حق از نور خود علمی الهی بر او افاضه کرد که او را از طریق مشاهده و تجلی (التجلی) به حق تعالی شناساند؛ علمی که هیچ کونی آن را نمی‌پذیرد و رد نمی‌کند. به همین دلیل فرمود: **«إِنَّ فِي ذَلِكَ»** (به راستی در این) - اشاره به علم به حق از حیث مشاهده - **«لَذِكْرَى لِمَنْ كَانَ لَهُ قَلْبٌ»** (یادآوری است برای کسی که قلب دارد) و غیر از آن نگفت.\n\n### قلب به عنوان قوه‌ای ورای مرحله عقل که بنده را به پروردگار وصل می‌کند\n\nزیرا قلب (القلب) به دلیل دائم در احوال مختلف دگرگون شدن (تقلیب)، معلوم است. پس بر یک حال باقی نمی‌ماند. و تجلیات الهی (التجلیات الإلهية) نیز چنین هستند. پس کسی که تجلیات را با قلب خود شهود (الشهود) نکند، آن‌ها را انکار می‌کند. زیرا عقل و قوای دیگر مقید هستند، مگر قلب که مقید نیست و در هر حالی سریع‌التقلب است. به همین دلیل:\n> شارع (الشارع) فرمود: **«إِنَّ الْقَلْبَ بَيْنَ إِصْبَعَيْنِ مِنْ أَصَابِعِ الرَّحْمَنِ يُقَلِّبُهُ كَيْفَ يَشَاءُ»** (قلب بین دو انگشت از انگشتان رحمان است، آن را هرگونه که بخواهد دگرگون می‌کند.) (حدیث)\nپس قلب با دگرگونی تجلیات دگرگون می‌شود، در حالی که عقل چنین نیست. پس قلب همان قوه‌ای است که ورای مرحله عقل است. اگر حق در این آیه، منظور از قلب را عقل می‌داشت، نمی‌فرمود: **«لِمَنْ كَانَ لَهُ قَلْبٌ»** (برای کسی که قلب دارد)، زیرا هر انسانی عقل دارد، اما هر انسانی این قوه‌ای را که ورای مرحله عقل است و در این آیه قلب نامیده شده، به او داده نمی‌شود. به همین دلیل فرمود: **«لِمَنْ كَانَ لَهُ قَلْبٌ»**. پس دگرگونی در قلب، نظیر تحول الهی در صور است. بنابراین، معرفت (المعرفة) حق از حق، تنها با قلب است، نه با عقل. سپس عقل آن را از قلب می‌پذیرد، همان‌طور که از فکر می‌پذیرد. پس حق سبحانه را چیزی جز دگرگون کردن آنچه نزد توست، وسعت نمی‌دهد. و معنای دگرگون کردن آنچه نزد توست، این است که تو معرفت به حق عز و جل را معلق کرده و امری را در علم خود ضبط کرده‌ای، و عالی‌ترین امری که در علم خود درباره او ضبط کرده‌ای، این است که او سبحانه ضبط نمی‌شود، مقید نمی‌گردد، شبیه چیزی نیست و چیزی شبیه او نیست. پس مضبوطی که از آنچه ضبط می‌شود متمایز است، ضبط نمی‌شود. پس آنچه ضبط نمی‌شود، ضبط شده است، مانند قول تو: «عجز از درک، خود درک است.» و حق را تنها قلب وسعت داده است. و معنای آن این است که بر حق تعالی حکم نکنی که او نمی‌پذیرد یا می‌پذیرد. زیرا ذات و انیت حق نزد کون (الکون) مجهول است، به ویژه که جل جلاله در کتاب و سنت از خود به نقیضین خبر داده است. در جایی تشبیه کرده و در جایی تنزیه نموده است، با **«لَيْسَ كَمِثْلِهِ شَيْءٌ»** (چیزی مانند او نیست) و شبیه قولش: **«وَهُوَ السَّمِيعُ الْبَصِيرُ»** (و او شنوای بیناست). پس خواطر تشبیه پراکنده شد و خواطر تنزیه متشتت گشت. زیرا منزه حقیقی، او را در تنزیه خود مقید و محصور کرده و تشبیه را از او خالی دانسته است. و مشبه نیز او را در تشبیه مقید و محصور کرده و تنزیه را از او خالی دانسته است. در حالی که حق در جمع است، با حکم به قول هر دو طایفه. پس نه تنزیهی می‌کند که از تشبیه خارج شود و نه تشبیهی می‌کند که از تنزیه خارج شود. پس نه مطلق است و نه مقید، زیرا از تقیید متمایز است. و اگر متمایز می‌شد، در اطلاق خود مقید می‌گشت، و اگر در اطلاق خود مقید می‌گشت، او نبود. پس او مقید است به آنچه خود را با آن مقید کرده است از صفات جلال، و مطلق است به آنچه خود را با آن نامیده است از اسماء کمال. و اوست واحد، حق (الحق)، آشکار، پنهان. **«لَا إِلَهَ إِلَّا هُوَ الْعَلِيُّ الْعَظِيمُ»** (هیچ معبودی جز او نیست، بلندمرتبه و بزرگ).\n\n### (وصل) سدره مرتبه پنجمی است که اعمال به آن ختم می‌شود\n\nو اما اسرار اهل الهام (الإلهام) که با استدلال به معرفت می‌رسند، از سدرة المنتهی تجاوز نمی‌کند. زیرا اعمال بنی آدم به آنجا ختم می‌شود و نهایت هر امر به جایی است که از آن آغاز شده است. اگر عارفی که به این امر علم ندارد، به تو بگوید که کرسی جایگاه دو قدم است، به او بگو: آن عالم خلق و امر است. و تکلیف تنها از سدره تقسیم شده است، زیرا چهار مرتبه را قطع کرده است و سدره مرتبه پنجم است. پس از قلم (القلم) به لوح (اللوح)، به عرش (العرش)، به کرسی (الکرسی) و به سدره فرود آمده است.\n\n### احکام شرعی پنج‌گانه و آنچه از مراتب هستی (الوجود) در مقابل آن‌هاست\n\nپس واجب (الواجب) از قلم، مندوب (المندوب) از لوح، محظور (المحظور) از عرش، مکروه (المکروه) از کرسی و مباح (المباح) از سدره ظاهر شد. و مباح، قسمت نفس است و نفوس عالم سعادت به آنجا ختم می‌شود. و نفوس اهل شقاوت به اصول آن که زقوم است، ختم می‌شود. و ما این را در کتاب *التنزلات الموصلیة* در باب روز دوشنبه بیان کرده‌ایم. و چون تقسیم احکام از سدره ظاهر شد، پس هنگامی که اعمالی که از یکی از این احکام خالی نیستند، بالا می‌روند، ناگزیر است که نهایتشان به موضعی باشد که از آن ظاهر شده‌اند، زیرا از آنجا که به سدره تقسیم شده‌اند، شناخته می‌شوند. سپس از عقل که همان قلم است، نظری به اعمال واجب (المفروضة) می‌شود و آن‌ها را بر حسب آنچه در آن‌ها می‌بیند، مدد می‌رساند. و از لوح، نظری به اعمال مندوب (المندوب إلیها) می‌شود و آن‌ها را بر حسب آنچه در آن‌ها می‌بیند، مدد می‌رساند. و از عرش، نظری به محظورات (المحظورات) می‌شود، و آن مستوای رحمان است، پس به آن‌ها جز با چشم رحمت نمی‌نگرد. و به همین دلیل، سرانجام صاحبان آن‌ها به رحمت است. و از کرسی، نظری به اعمال مکروه (المکروهة) می‌شود و بر حسب آنچه در آن‌ها می‌بیند، به آن‌ها می‌نگرد. و کرسی تحت احاطه عرش است و عرش مستوای رحمان و کرسی جایگاه دو قدم است. پس عفو و گذشت از صاحبان اعمال مکروه سریع است. و به همین دلیل، ترک‌کننده آن پاداش می‌گیرد و انجام‌دهنده آن مؤاخذه نمی‌شود.\n\n### عذاب اهل دوزخ در دوزخ: جاودانگی در آتش\n\nپس کتاب ابرار در علیین است و گناهکاران صاحب کبائر و صغائر در آن‌ها داخل می‌شوند. و اما کتاب فجار در سجین است و در آن اصول سدره که همان درخت زقوم است، قرار دارد. پس اعمال فجار در اسفل سافلین به آنجا ختم می‌شود. اگر رحمان از عرش رحمانیت خود با نظری که ذکر کردیم، به آن‌ها رحم کند، برای آن‌ها در منزلشان نعمتی قرار می‌دهد. پس در آن نمی‌میرند و دوست داشته نمی‌شوند. آن‌ها در نعیم آتش دائمی و جاودان هستند، مانند نعیم خوابیده‌ای که در حال خواب از سرور می‌بیند. و چه بسا در بستر خود بیمار، بدبخت و فقیر باشد، اما در خواب خود را صاحب سلطنت، نعمت و ملک ببیند. اگر به خوابیده از حیث آنچه در خواب می‌بیند و از آن لذت می‌برد، بنگری، می‌گویی او در نعمت است و راست گفته‌ای. و اگر به او از حیث آنچه در بستر خشن، بیماری، یأس، فقر و زخم‌هایش می‌بینی، بنگری، می‌گویی او در عذاب است. اهل آتش این‌گونه خواهند بود. پس **«لَا يَمُوتُ فِيهَا وَلَا يَحْيَى»** (در آن نمی‌میرد و زندگی نمی‌کند)، یعنی هرگز از خواب خود بیدار نمی‌شود. این همان رحمتی است که حق با آن بر اهل آتش که اهل آن و امثال آن هستند، رحم می‌کند. مانند کسی که از گرما رنج می‌برد، با زمهرير (سرمای شدید) متنعم می‌شود و کسی که از سرما رنج می‌برد، در حرور (گرمای شدید) قرار داده می‌شود. و ممکن است عذاب آن‌ها توهم وقوع عذاب بر آن‌ها باشد. و این همه پس از قول اوست: **«لَا يُفَتَّرُ عَنْهُمُ الْعَذَابُ وَهُمْ فِيهِ مُبْلِسُونَ»** (عذاب از آن‌ها کاسته نمی‌شود و آن‌ها در آن مأیوسند). آن زمان، زمان عذاب و مؤاخذه آن‌ها به خاطر جرائمشان است، پیش از آنکه رحمتی که بر غضب الهی سبقت گرفته است، به آن‌ها برسد. پس هنگامی که اهل بهشت در این حالت بر اهل آتش مطلع شوند و منازل آن‌ها را در آتش و آنچه حق در آن آماده کرده و قبح منظری که بر آن هستند، ببینند، می‌گویند: «معذبند.» و هنگامی که بر حسن معنوی الهی در خلق آن امر که قبح نامیده شده، مکاشف (کشف) شوند و آنچه را که در خواب خود در آن هستند، ببینند و از احوال مزاج‌هایشان آگاه شوند، می‌گویند: «متنعمند.» پس منزه است قادری که هر چه بخواهد انجام می‌دهد. **«لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ»** (هیچ معبودی جز او نیست، شکست‌ناپذیر و حکیم). پس قول حق تعالی: **«لَا يَمُوتُ فِيهَا وَلَا يَحْيَى»** و قول رسول خدا (صلی الله علیه و سلم): **«أَمَّا أَهْلُ النَّارِ الَّذِينَ هُمْ أَهْلُهَا فَإِنَّهُمْ لَا يَمُوتُونَ فِيهَا وَلَا يَحْيَوْنَ»** (اما اهل آتشی که اهل آن هستند، در آن نمی‌میرند و زندگی نمی‌کنند) را فهمیدی.\n\nو **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}