{
  "id": 151,
  "title": {
    "ar": "الباب الحادي والخمسون ومائة في معرفة مقام ترك الغيرة وأسراره",
    "en": "Chapter One Hundred and Fifty-One, Concerning the Gnosis (معرفة) of the Station (مقام) of Relinquishing Zeal (ترك الغيرة) and its Mysteries.",
    "ur": "باب ایک سو اکاون: غیْرت کو ترک کرنے کے مقام (مقام ترك الغيرة) اور اس کے اسرار کی معرفت (المعرفۃ) کے بیان میں",
    "fa": "باب صد و پنجاه و یکم در معرفت مقام ترک غیرت و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الحادي والخمسون ومائة في معرفة مقام ترك الغيرة وأسراره)\n\n\n> من يُوقَ شُحَّ نَفْسِهِ فهو الذي *** بنوره في كل أمر يهتدى‏\n\n\n> وغيرة العبد إذا حققتها *** شح طبيعي من أسباب الردي‏\n\n\n> وغيرة الحق إذا علمتها *** من رؤية الغير ولا غير بدا\n\n\n> فلا تقل بغيرة فإنها *** مشتقة من غير فاتركها سدى‏\n\n\n> وأين عين الغير وهو عدم *** فاسلك هديت الرشد أسباب الهدى‏\n\n\n> وانسب إلى الباري ما قال وما *** جاء به شرع ولكن ابتدا\n\n\n> مما لو أن العقل يبقى وحده *** ما قاله معتقدا وقدا\n\n\n> فإن يكن بعد سؤال قاله *** فهو دواء وهو بالبرهان دا\n\n\n> فالحق ما قرره الشرع ولو *** دل على كل محال وبدا\n\n\n> فالمؤمن الحق بهذا مؤمن *** وكل من أوله قد اعتدى‏\n\n\n> لأنه ظن وبعض الظن قد *** يكون إثما قائدا نحو الردي‏\n\n\n### [إذا كانت العين واحدة فلا غيرة إذ لا غير]\n\n\nإذا اقتضى نظر العبد العارف ظهور الحق في أعيان الممكنات الثابتة وإنها ما استفادت منه الوجود وإنما استفادت منه ما ظهر مما هي عليه من الحقائق عند ظهوره فيها فأعطته كل وصف ونعت اتصف به مما تضيفه بطريق الحقيقة إلى الإنسان أو العالم كيفما شئت قلت ومن جملة النعوت الغيرة المحكوم بها في نسبة ما ظهر به الظاهر لظهور آخر لحكم آخر من عين آخر فإذا كانت العين واحدة فلا غيرة إذ لا غير\n\n\n### [الغيرة متعلقها النسب أو الأعمال وهي كلها لله‏]\n\n\nوإذا نزلت عن هذا النظر إلى قوله ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها وقوله والله خَلَقَكُمْ وما تَعْمَلُونَ لم يصح وجود الغيرة فإن الغيرة متعلقها النسب أو قل الأعمال وهي كلها لله فعلى من تقع الغيرة وما هو ثم إذ كانت النسب والأعمال كلها لله‏\n\n\n### [الغيرة المعلومة الظاهرة في الكون شح طبيعي الكرم المطلق لا تكون معه غيرة]\n\n\nوالغيرة المعلومة الظاهرة في الكون شح طبيعي والشح في ذلك الجناب العالي وفي الأرواح العلى لا يصح فإذا ظهرت فمن النفس الحيوانية ولهذا توجد الغيرة في الحيوانات وأصلها ضيق الملك وفقد الغرض فالكرم المطلق لا يكون معه غيرة أصلا\n\n",
    "en": "Chapter One Hundred and Fifty-One: Concerning the Knowledge of the Station of Abandoning Jealousy [al-Ghīra] and its Secrets.\n\nHe who is protected from the avarice [shuhh] of his soul / Is the one who is guided by his light in every affair.\n\nAnd the jealousy of the servant, if you verify its nature, / Is natural avarice stemming from the causes of perdition.\n\nAnd the jealousy of the Real [al-Haqq], if you come to know it, / [Arises] from the vision of the Other [al-ghayr], yet no Other has manifested.\n\nSo do not speak of jealousy, for it / Is derived from 'otherness' [ghayr], so abandon it as vain.\n\nAnd where is the essence [‘ayn] of the Other, when it is non-existence [‘adam]? / So follow, may you be guided to rectitude, the paths of guidance.\n\nAnd attribute to the Creator [al-Bārī] what He said and what / The Law [al-Shar‘] brought forth, but which He originated—\n\n—From that which, if the intellect remained alone, / It would not have affirmed or believed.\n\nIf He said it after a question, / Then it is a remedy, and it is a cure by proof.\n\nThe Real is what the Law established, even if / It pointed to every impossibility and manifested.\n\nThe true believer believes in this, / And everyone who interprets it allegorically has transgressed.\n\nBecause that is mere conjecture, and some conjecture / May be a sin leading toward perdition.\n\n### [If the Essence is One, there is no Jealousy, for there is no Other]\n\nWhen the vision of the gnostic servant (العبد العارف) necessitates the manifestation of the Real (الحق) in the Fixed Entities (الأعيان الثابتة) of the contingent things—and [when he sees] that they did not gain Existence (الوجود) from Him, but rather gained from Him what manifested of the realities upon which they subsist when He disclosed Himself within them—then they grant Him every description and attribute by which He is described, from what you truly attribute to the human being or the cosmos, however you wish to express it. Among these attributes is jealousy (الغيرة), which is decreed in the attribution of what the Manifest One appeared by, due to the manifestation of another [thing] for another ruling from another essence. But if the Essence (العين) is one, there is no jealousy, for there is no other (غير).\n\n### [Jealousy relates to relationships or actions, and all of them belong to Allah]\n\nAnd if you descend from this [metaphysical] vision to His saying: <<مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا>> (There is no creature but He holds it by its forelock), and His saying: <<وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do), the existence of jealousy (الغيرة) is not valid. For jealousy relates to relationships (النسب) or, say, actions (الأعمال), and all of them belong to Allah. So upon whom does jealousy fall, and what is there [to be jealous of], since the relationships and actions all belong to Allah?\n\n### [The Known Jealousy Manifest in the Cosmos is Natural Avarice; Absolute Generosity precludes Jealousy]\n\nThe known jealousy (الغيرة) manifest in the cosmos (الكون) is natural avarice (شح طبيعي). Avarice is not valid in that Exalted Presence nor in the elevated spirits. So if jealousy appears, it stems from the animal soul (النفس الحيوانية), and for this reason, jealousy is found in animals. Its origin is the narrowness of possession and the loss of the object. Therefore, Absolute Generosity (الكرم المطلق) is never accompanied by jealousy.",
    "ur": "باب ایک سو اکاون: غیرت (الغيرة) کو ترک کرنے کے مقام اور اس کے اسرار کی معرفت میں\n\nجو شخص اپنی نفس کی حرص (شُحَّ نَفْسِهِ) سے بچا لیا گیا، وہی ہے جو اپنے نور کے ذریعے ہر معاملے میں ہدایت پاتا ہے۔\n\nاور بندے کی غیرت (الغيرة)، اگر تم اس کی حقیقت کو جانچو، تو وہ ایک طبعی حرص (شح طبيعي) ہے جو ہلاکت (الردي) کے اسباب میں سے ہے۔\n\nاور ذات حق (الحق) کی غیرت (الغيرة)، اگر تم اسے جان لو، تو وہ غیر (الغير) کو دیکھنے سے پیدا ہوتی ہے، حالانکہ کوئی غیر ظاہر ہی نہیں ہوا۔\n\nلہٰذا غیرت (الغيرة) کے ساتھ بات نہ کرو، کیونکہ یہ لفظ 'غیر' (الغير) سے مشتق ہے، پس اسے بے کار چھوڑ دو۔\n\nاور غیر (الغير) کی حقیقت (عین) کہاں ہے جبکہ وہ تو عدم (عدم) ہے؟ پس، تم ہدایت یافتہ ہو، رشد (الرشد) اور ہدایت (الهدى) کے اسباب پر چلو۔\n\nاور باری تعالیٰ (الباري) کی طرف منسوب کرو جو اس نے کہا، اور جو شریعت (شرع) لائی، اگرچہ وہ بظاہر ایک نئی بات (ابتدا) ہو۔\n\n(اس بات کو منسوب کرو) جسے اگر عقل (العقل) تنہا رہتی تو وہ اسے اعتقاد اور یقین کے ساتھ نہ کہتی۔\n\nپس اگر اس نے کسی سوال کے بعد یہ بات کہی ہے، تو وہ ایک دوا ہے، اور وہ دلیل (البرهان) کے ذریعے علاج ہے۔\n\nپس حق (الحق) وہی ہے جسے شریعت (الشرع) نے مقرر کیا، اگرچہ وہ ہر محال اور ظاہر ہونے والی چیز پر دلالت کرے۔\n\nپس سچا مؤمن (المؤمن الحق) اسی پر ایمان رکھتا ہے، اور جس نے بھی اس کی تاویل کی، اس نے زیادتی کی۔\n\nکیونکہ یہ (تاویل) گمان (الظن) ہے، اور بعض گمان یقیناً گناہ ہوتا ہے جو ہلاکت (الردي) کی طرف لے جاتا ہے۔\n\n***\n\n### [جب حقیقت (العین) ایک ہے تو کوئی غیرت نہیں کیونکہ کوئی غیر نہیں]\n\nجب عارف (العارف) بندے کا مشاہدہ (نظر) یہ تقاضا کرے کہ ذات حق (الحق) کا ظہور ثابت ممکنات (الممكنات الثابتة) کی حقیقتوں (أعيان) میں ہوا ہے، اور یہ کہ انہوں نے اس سے وجود (الوجود) حاصل نہیں کیا، بلکہ انہوں نے اس سے صرف وہ چیز حاصل کی جو ان حقائق میں ظاہر ہوئی جن پر وہ قائم ہیں جب حق ان میں ظاہر ہوا، تو انہوں نے حق کو ہر وہ وصف اور نعت عطا کیا جس سے وہ متصف ہوا، جسے تم حقیقت کے طریقے پر انسان یا عالم کی طرف منسوب کرتے ہو، جیسا تم چاہو۔ اور ان صفات میں سے ایک غیرت (الغيرة) ہے جس کا حکم اس ظاہر ہونے والے (الظاهر) کی نسبت میں لگایا جاتا ہے، کسی دوسرے ظہور کے لیے، کسی دوسرے حکم کے لیے، کسی دوسری حقیقت (عین) سے۔ پس جب حقیقت (العین) ایک ہے، تو کوئی غیرت (الغيرة) نہیں، کیونکہ کوئی غیر (الغير) موجود نہیں۔\n\n### [غیرت (الغيرة) کا تعلق نسبتوں یا اعمال سے ہے اور وہ سب اللہ کے لیے ہیں]\n\nاور جب تم اس مشاہدے (النظر) سے نیچے اتر کر اس کے قول کی طرف آتے ہو: **\"کوئی چلنے والا نہیں مگر وہ اس کی پیشانی پکڑے ہوئے ہے\"** (مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا) اور اس کے قول: **\"اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا\"** (وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ)، تو غیرت (الغيرة) کا وجود درست نہیں رہتا۔ کیونکہ غیرت کا تعلق نسبتوں (النسب) سے ہے یا یوں کہو کہ اعمال (الأعمال) سے ہے، اور وہ سب اللہ کے لیے ہیں۔ پس غیرت کس پر واقع ہو گی؟ اور وہاں کیا ہے؟ جبکہ تمام نسبتیں اور اعمال سب اللہ کے لیے ہیں۔\n\n### [کائنات میں ظاہر ہونے والی معلوم غیرت (الغيرة) ایک طبعی حرص (شح طبيعي) ہے؛ کرم مطلق کے ساتھ غیرت نہیں ہو سکتی]\n\nاور کائنات (الکون) میں ظاہر ہونے والی معلوم غیرت (الغيرة) ایک طبعی حرص (شح طبيعي) ہے۔ اور اس بلند بارگاہ میں اور اعلیٰ ارواح میں حرص (الشح) درست نہیں ہے۔ پس جب یہ ظاہر ہوتی ہے تو نفس حیوانی (النفس الحيوانية) کی طرف سے ہوتی ہے۔ اسی وجہ سے غیرت جانوروں میں بھی پائی جاتی ہے، اور اس کی اصل ملکیت کا تنگ ہونا اور مقصد کا فوت ہو جانا ہے۔ پس کرم مطلق (الکرم المطلق) کے ساتھ غیرت (الغيرة) بالکل نہیں ہو سکتی۔",
    "fa": "باب صد و پنجاه و یکم در معرفت مقام ترک غیرت (غيرة) و اسرار آن\n\nآن کس که از بخل (شُحّ) نفس خود در امان ماند، اوست که با نورش در هر امری هدایت می‌شود.\nو غیرت (غيرة) بنده، اگر آن را به حقیقت دریابی، بخل طبیعی است که از اسباب هلاکت است.\nو غیرت (غيرة) حق (الحق)، اگر آن را بدانی، ناشی از دیدن «غیری» است، در حالی که هیچ غیری (غير) پدیدار نشده است.\nپس از غیرت (غيرة) سخن مگو، زیرا آن از «غیر» مشتق شده است، پس آن را بیهوده رها کن.\nو عین (عين) غیر کجاست، در حالی که او عدم است؟ پس راه رشد را بپوی، که به اسباب هدایت رهنمون شده‌ای.\nو آنچه را که [حق] گفت و آنچه را که شریعت (شرع) آورد، به آفریدگار (الباری) نسبت ده، اما [آنچه را که] آغاز کرد...\n...از اموری است که اگر عقل (العقل) به تنهایی باقی می‌ماند، آن را با اعتقاد و قصد نمی‌گفت.\nپس اگر آن را پس از سؤالی گفت، آن دواست، و با برهان (البرهان) خود، درد است.\nپس حق (الحق) آن است که شریعت (الشرع) مقرر کرده است، حتی اگر بر هر محالی دلالت کند و پدیدار شود.\nپس مؤمن حقیقی به این ایمان دارد، و هر کس که آن را تأویل (تأويل) کند، تجاوز کرده است.\nزیرا آن گمان (ظن) است، و برخی از گمان‌ها ممکن است گناهی باشد که به سوی هلاکت می‌کشاند.\n\n### [اگر عین (عين) یکی باشد، غیرتی نیست، زیرا غیری وجود ندارد]\n\nهنگامی که نظر بنده عارف (العارف) اقتضا کند که حق (الحق) در اعیان ممکنات ثابت (الثابتة) ظاهر شود، و اینکه این اعیان هستی (الوجود) را از او کسب نکرده‌اند، بلکه آنچه را که از حقایق (الحقائق) خودشان بر آن هستند، هنگام ظهور حق در آن‌ها، کسب کرده‌اند؛ پس هر وصف و نعمتی را که حق به آن متصف شده است، به او داده‌اند، از جمله آنچه را که به طریق حقیقت (الحقيقة) به انسان یا عالم نسبت می‌دهی، هر طور که بخواهی. و از جمله این نعوت، غیرت (الغيرة) است که در نسبت آنچه ظاهر به آن ظاهر شده است، حکم می‌شود، به دلیل ظهور دیگری برای حکمی دیگر از عینی دیگر. پس اگر عین (العين) یکی باشد، غیرتی نیست، زیرا غیری (غير) وجود ندارد.\n\n### [غیرت (الغيرة) متعلق به نسبت‌ها یا اعمال است و همه آن‌ها از آنِ خداست]\n\nو اگر از این نظر فرود آیی به قول او: «مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا» (سوره هود، آیه ۵۶) و قول او: «وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ» (سوره صافات، آیه ۹۶)، وجود غیرت (الغيرة) صحیح نیست. زیرا متعلق غیرت (الغيرة) نسبت‌ها یا به عبارتی اعمال است، و همه آن‌ها از آنِ خداست. پس غیرت بر چه کسی واقع می‌شود؟ و در آنجا چه چیزی هست، در حالی که نسبت‌ها و اعمال همه از آنِ خداست؟\n\n### [غیرت (الغيرة) معلوم و آشکار در هستی، بخل طبیعی است؛ کرم مطلق با آن غیرتی ندارد]\n\nو غیرت (الغيرة) معلوم و آشکار در هستی (الکون)، بخل طبیعی (شُحّ طبيعي) است. و بخل (الشح) در آن ساحت بلند و در ارواح والا صحیح نیست. پس اگر غیرت ظاهر شود، از نفس حیوانی است. به همین دلیل است که غیرت در حیوانات یافت می‌شود و ریشه آن تنگی مُلک و فقدان غرض است. بنابراین، کرم مطلق (الکرم المطلق) اصلاً با آن غیرتی ندارد."
  },
  "page_count": 1
}