{
  "id": 364,
  "title": {
    "ar": "الباب الرابع والستون وثلاثمائة في معرفة منزل سرين من عرفهما نال الراحة في الدنيا والآخرة والغيرة الإلهية",
    "en": "Chapter Three Hundred and Sixty-Four: Concerning the Gnosis of the Station (منزل) of Two Secrets (سرين), the Knowledge of which Attains Repose in This World and the Hereafter, and the Divine Jealousy (الغيرة الإلهية).",
    "ur": "باب تین سو چونسٹھ: دو رازوں (سرین) کے مقام کی معرفت کے بیان میں، جنہیں جاننے والا دنیا اور آخرت میں راحت حاصل کرتا ہے، اور غیرت الٰہیہ (الغيرة الإلهية) کا بیان۔",
    "fa": "باب سیصد و شصت و چهارم در معرفت منزل دو راز (سرّین) که هر کس آن دو را بشناسد، در دنیا و آخرت به آسایش و غیرت الهی (الغيرة الإلهية) دست می‌یابد."
  },
  "content": {
    "ar": "## «الباب الرابع والستون وثلاثمائة في معرفة منزل سرين من عرفهما نال الراحة في الدنيا والآخرة والغيرة الإلهية»\n\n\n> إذا ما قام شخص عن سواه *** بأحكام فذاك المستناب‏\n\n\n> فإن لم يستنبه وقام فيها *** فلا شك لديه ولا ارتياب‏\n\n\n> ولو يدعو عليه إذا تعدى *** لكان دعاؤه فيه يجاب‏\n\n\n> لصدق الوعد والإخلاص فيه *** يصيب إذا يريد ولا يصاب‏\n\n\n### [لم يزل كل شي‏ء عند الله بالفعل في عباده ما عنده شي‏ء بالقوة]\n\n\nهذا منزل البشري الإلهية بالراحة التي أوجبها الاعتناء الإلهي بمن بشر بها من عباد الله الصالحين إلى يوم القيامة وفي القيامة فإن الله لم يزل كل شي‏ء عنده بالفعل في عباده ما عنده شي‏ء بالقوة فوردت التعريفات الإلهية إليه بما كان لله فيه‏\nمن الأفعال والأحوال ليتذكر بعقله شهوده ذلك من ربه فيه في حال عدمه لما كان عليه من الثبوت الذي أوجب له قبول التصرف إلهي فيه وبتلك الحالة الثبوتية امتثل أمر الحق بالتكوين فإن الأمر لا يرد إلا على متصف بالسمع فالقول الإلهي لم يزل والسمع الثبوتي لم يزل وما حدث إلا السمع الوجودي الذي هو فرع عن السمع الثبوتي فانتقلت الحال على عين السمع ما انتقل السمع فإن الأعيان لا تنقلب من حال إلى حال وإنما الأحوال تلبسها أحكاما فتلبسها فيتخيل من لا علم له أن العين انتقل فالأحوال تطلب الأسماء الإلهية لا أن الأعيان هي الموصوفة بالطلب ويحدث للاعيان أسماء والقلب بحسب أحكام الأحوال التي تنقلب عليها ولو لا الأحوال ما تميزت الأعيان فإنه ما ثم إلا عين واحدة تميزت بذاتها عن واجب الوجود كما اشتركت معه في وجوب الثبوت فله تعالى وجوب الثبوت والوجود ولهذه العين وجوب الثبوت فالأحوال لهذه العين كالاسماء الإلهية للحق فكما إن الأسماء للعين الواحدة لا تعدد المسمى ولا تكثره كذلك الأحوال لهذه العين لا تعددها ولا تكثرها مع معقولية الكثرة والعدد في الأسماء والأحوال وبهذا صح لهذه العين أن يقال فيها إنها على الصورة أي على ما هو عليه الأمر الإلهي فحصل لهذه العين الكمال بالوجود الذي هو من جملة الأحوال التي تقلبت عليها فما نقصها من الكمال إلا وهو نفى حكم وجوب الوجود للتمييز بينها وبين الله إذ لا يرتفع ذلك ولا يصح لها فيه قدم وله تمييز آخر وذلك أن الحق يتقلب في الأحوال لا تتقلب عليه الأحوال لأنه يستحيل أن يكون للحال على الحق حكم بل له تعالى الحكم عليها فلهذا يتقلب فيها ولا تتقلب عليه كُلَّ يَوْمٍ هُوَ في شَأْنٍ فإنها لو تقلبت عليه أوجبت له أحكاما وعين العالم ليس كذلك تتقلب عليه الأحوال فتظهر فيها أحكامها وتقليبها عليها بيد الله تعالى فأما تقليب الحق في الأحوال فمعلوم بالنزول والاستواء والمعية والضحك والفرح والرضي والغضب وكل حال وصف الحق به نفسه فهو سبحانه يتقلب فيها بالحكم فهذا الفرق بيننا وبين الحق وهو أوضح الفروق وأجلاها فوقعت المشاركة في الأحوال كما وقعت في الأسماء لأن الأسماء هي أسماء الأحوال ومسماها العين كما أنه لها الأسماء بنسبة غير هذه النسبة ومسماها الحق ف هُوَ السَّمِيعُ الْبَصِيرُ العالم القدير وأنت السميع البصير العالم القدير فحال السمع والبصر والعلم والقدرة لنا وله بنسبتين مختلفتين فإنه هو هو ونحن نحن فلنا آلات ونحن له آلات فإن الله قال على لسان عبده سمع الله لمن حمده وقال فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ والآلة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فالتقلب للحق في الأحوال لإظهار أعيانها كتقلب الواحد في مراتب الأعداد لإظهار أعيانها واعلم أن هذا المنزل ما سمي منزل سرين إلا لسر عجيب وهو أن الشي‏ء الواحد تثنيه نفسه لا غيره في المحسوس والمعقول فأما في المحسوس فآدم ثناه ما فتح في ضلعه القصير الأيسر من صورة حواء فكان واحدا في عينه فصار زوجا بها وليست سوى نفسه التي قيل بها فيه إنه واحد وأما في المعقول فالألوهية ليست غير ذاته تعالى ومعقول الألوهة خلاف معقول كونه ذاتا فثنت الألوهة ذات الحق وليست سوى عينها فكما بث في الحس من آدم ومن ثناه من ذاته رجالا كثيرا ونساء على صورة الزوجين كذلك بث من ذات الحق تعالى وكونه إله العالم على صورة هذين المعقولين فالعالم خرج على صورة مؤثر ومؤثر فيه للتوالد أي لتوالد أجزائه فإن الألوهة حكم للذات فيها حكمت بإيجاد العالم فلما آثرت الحكم بإيجاد العالم لذلك ظهر العالم بصورة من أوجده بين مؤثر ومؤثر فيه كما جرى في المحسوس فإن الله ما خلق من آدم وحواء أرضا ولا سماء ولا جبلا ولا غير نوعه بل ما خلق منهما إلا مثلهما في الصورة والحكم‏\n\n\n> إن التي كان الوجود بكونها *** ذات يقدس لفظها معناها\n\n\n> إني لأهواها وأهوى قربها *** مني وأهوى كل من يهواها\n\n\n> ليلى ولبني والرباب وزينب *** أتراب من حبي لها محياها\n\n\n> لو مت مات وجودها بمماتنا *** فوجودنا عين لها وسواها\n\n\n> عجبا لنا ولها فإن وجودنا *** فرد فلا ثان فمن ثناها\n\n\nولما كان الأصل واحدا وما ثناه سوى‏\n\n\nنفسه ولا ظهرت كثرة إلا من عينه كذلك كانت له في كل شي‏ء من العالم آية تدل‏\nعلى أنه واحد فالكون كله جسم وروح بهما قامت نشأة الوجود فالعالم للحق كالجسم للروح وكما لم يعرف الروح إلا من الجسم فإنا لما نظرنا فيه ورأينا صورته مع بقائها تزول عنها أحكام كنا نشاهدها من الجسم وصورته من إدراك المحسوسات والمعاني فعلمنا إن وراء الجسم الظاهر معنى آخر هو الذي أعطاه أحكام الإدراكات فيه فسمينا ذلك المعنى روحا لهذا الجسم فكذلك ما علمنا أن لنا أمرا يحركنا ويسكننا ويحكم فينا بما شاء حتى نظرنا في نفوسنا فلما عرفنا نفوسنا عرفنا ربنا حذوك النعل بالنعل ولهذا أخبر في الوحي‏\n\n\nبقوله من عرف نفسه عرف ربه‏\n\n\nوفي الخبر المنزل الإلهي سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ فما ظهر العالم عن الله إلا بصورة ما هو الأمر عليه وما في الأصل شرفا لي من تستند الشرور والعالم في قبضة الخير المحض وهو الوجود التام غير أن الممكن لما كان للعدم نظر إليه كان بذلك القدر ينسب إليه من الشر ما ينسب إليه فإنه ليس له من ذاته حكم وجوب الوجود لذاته فإذا عرض له الشر فمن هناك ولا يستمر عليه ولا يثبت فإنه في قبضة الخير المحض والوجود ثم من تمام المعرفة الموضوعة في العلم بالله أن للجسم في الروح آثارا معقولة معلومة لما يعطيه من علوم الأذواق وما لا يمكن أن يعلمها إلا به وأن الروح له آثار في الجسم محسوسة يشهدها كل حيوان من نفسه كذلك العالم مع الحق لله فيه آثار ظاهرة وهي ما يتقلب فيه العالم من الأحوال وذلك من حكم اسمه الدهر وأخبر الحق سبحانه أن للعالم من حيث ما كلفه آثارا لو لا تعريفه إيانا بها ما عرفناها وذلك أنه إذا اتبعنا رسوله فيما جاءنا به من طاعة الله أحبنا وأرضيناه فرضي عنا وإذا خالفناه ولم نمتثل أمره وعصيناه أخبرنا إنا أسخطناه وأغضبناه فغضب علينا وإذا دعوناه أجابنا فالدعاء من أثره والإجابة من أثرنا ذلك لتعلموا أنه ما أظهر شيئا إلا من صورة ما هو هو ويستحيل أن يكون الأمر إلا كذلك وإلا فمن أين وما ثم إلا هو ولا يعطي الشي‏ء إلا ما في قوته ولهذا نعت الحق لنا نفسه بنعوت المحدثات عندنا وهي في الحقيقة نعوته ظهرت فينا ثم ما عادت عليه ونعتنا سبحانه بنعوت ما يستحقه جلاله فهي نعوته على الحقيقة فلو لا ما أوجدنا على صورة ما هو عليه في نفسه ما صح ولا ثبت أن نقبل صفة مما وصفنا بها مما هي حق له ولا كان يقبل صفة مما وصف بها نفسه مما هي حق لنا والكل حق له فهو الأصل الذي نحن فرعه والأسماء أغصان هذه الشجرة أعني شجرة الوجود ونحن عين الثمر بل هو عين الثمر فما لنا مثل سوى وجود هذا الشجر ومن تمام المعرفة بالله ما أخبرنا به على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم من تحوله تعالى في الصور في مواطن التجلي وذلك أصل تقلبنا في الأحوال باطنا وظاهرا وكل ذلك فيه تعالى وكذلك هو تعالى في شئون العالم بحسب ما يقتضيه الترتيب الحكمي فشأنه غدا لا يمكن أن يكون إلا في غد وشأن اليوم لا يمكن أن يكون إلا اليوم وشأن أمس لا يمكن أن يكون إلا في أمس هذا كله بالنظر إليه تعالى وأما بالنظر إلى الشأن يمكن أن يكون في غير الوقت الذي تكون فيه لو شاء الحق تعالى وما في مشيئته جبر ولا تحير تعالى الله عن ذلك بل ليس لمشيئته إلا تعلق واحد لا غير ومنها قوله سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ يعني منكم ومن العالم الذي هو سوانا وإنما سمانا بالثقلين لما فينا من الثقل وهو عين تأخرنا بالوجود فأبطأنا ومن عادة الثقيل الإبطاء كما أنه من عادة الخفيف الإسراع فنحن والجن من الثقلين ونحن أثقل من الجن للركن الأغلب علينا وهو التراب فالإنسان آخر موجود في العالم لأن المختصر لا يختصر إلا من مطول وإلا فليس بمختصر فالعالم مختصر الحق والإنسان مختصر العالم والحق فهو نقاوة المختصر أعني الإنسان الكامل وأما الإنسان الحيوان فإنه مختصر العالم وله يفرغ الحق ليقيم عليه ميزان ما خلق له فإن قوله سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ كلمة تهديد والإنسان الكامل لا يتوجه عليه هذا الخطاب غير إن في هذه الكلمة إشارة للحوق الرحمة بهما أعني الثقلين وذلك في فتح اللام الداخلة على ضمير المخاطب في لكم وإن كان الفتح الإلهي قد يكون بما يسوء كما يكون بما يسر ولكن رحمته سبقت غضبه وجاء بآلة الاستقبال وهو السين وآخر درجة الاستقبال ما يؤول إليه أمر العالم من الرحمة التي لا غضب بعدها لارتفاع التكليف واستيفاء الحدود ولما جاء بضمير الخطاب في قوله لكم وعلمنا من الكرم الإلهي أبدا أنه يرجح جانب السعداء وجانب الرحمة على النقيض ولهذا سمي ما يتألم به أهل الشقاء عذابا لأن السعداء يستعذبون آلام أهل الشقاء إيثار\n\n\nالجناب الحق حيث أشركوا فلهم في أسباب الآلام نعيم فسمى الحق ذلك عذابا إيثارا لهم حين آثروه‏\nفلذلك جاء بحرف الخطاب ليفتح اللام وليعلم بآلة الخطاب أنهم قوم مخصوصون لأنه لا يفقد من العالم ضمير الغائب فلا بد له من أهل مثل قوله في السعداء لَهُمْ جَنَّاتٍ تَجْرِي فأتى بضمير الغائب فغابوا عن هؤلاء المخاطبين وفتح اللام فتح رحمة تعطيها قرائن الأحوال ولهذه الأداة مراتب يعامل الحق بها عباده مثل قوله وإِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ ومثل قوله ما كانَ الله لِيَذَرَ الْمُؤْمِنِينَ عَلى‏ ما أَنْتُمْ عَلَيْهِ وما كانَ الله لِيُضِيعَ إِيمانَكُمْ وسَخَّرَ لَكُمْ ما في السَّماواتِ وما في الْأَرْضِ وخَلَقَ لَكُمْ ما في الْأَرْضِ ولَهُ ما في السَّماواتِ وما في الْأَرْضِ وما بَيْنَهُما وما تَحْتَ الثَّرى‏ فله ولنا ومع هذا فالأدب يلزمنا وبالأدب يكون أصحاب السلطان جلساء من غير انبساط لأن الشهود والانبساط لا يجتمعان قال بعضهم اقعد على البساط وإياك والانبساط\n\n\n> إني عبدت من أمر ليس يصلح لي *** ولست أعبد من نعتي بصورته‏\n\n\n> فإنه قال هذا لم أقله أنا *** وليس سورة حالي غير سورته‏\n\n\nفإن الدون الأدون إذا نسب إليه ما لا يقتضيه مقامه من الصفات الشريفة يأنف من ذلك لأنه هجو به كما يأنف الشريف أن يوصف بدون ما يستحقه شرفه‏\n\n\n### (وصل) [الفرق بين الولي والنبي‏]\n\n\nوأما من قال من أصحابنا وذهب إليه كالإمام أبي حامد الغزالي وغيره بأن الفرق بين الولي والنبي نزول الملك فإن الولي ملهم والنبي ينزل عليه الملك مع كونه في أمور يكون ملهما فإنه جامع بين الولاية والنبوة فهذا غلط عندنا من القائلين به ودليل على عدم ذوق القائلين به وإنما الفرقان إنما هو فيما ينزل به الملك لا في نزول الملك فالذي ينزل به الملك على الرسول والنبي خلاف الذي ينزل به الملك على الولي التابع فإن الملك قد ينزل على الولي التابع بالاتباع وبإفهام ما جاء به النبي مما لم يتحقق هذا الولي بالعلم به وإن كان متأخرا عنه بالزمان أعني متأخرا عن زمان وجوده فقد ينزل عليه بتعريف صحة ما جاء به النبي وسقمه مما قد وضع عليه أو توهم أنه صحيح عنه أو ترك لضعف الراوي وهو صحيح في نفس الأمر وقد ينزل عليه الملك بالبشرى من الله بأنه من أهل السعادة والفوز وبالأمان كل ذلك في الحياة الدنيا فإن الله عز وجل يقول لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وقال في أهل الاستقامة القائلين بربوبية الله إن الملائكة تنزل عليهم قال تعالى إِنَّ الَّذِينَ قالُوا رَبُّنَا الله ثُمَّ اسْتَقامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ أَلَّا تَخافُوا ولا تَحْزَنُوا وأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ نَحْنُ أَوْلِياؤُكُمْ في الْحَياةِ الدُّنْيا ومن أولياء الله من يكون له من الله ذوق الإنزال في التنزيل فما طرأ ما طرأ على القائلين بخلاف هذا إلا من اعتقادهم في نفوسهم أنهم قد عموا بسلوكهم جميع الطرق والمقامات وأنه ما بقي مقام إلا ولهم فيه ذوق وما رأوا أنهم نزل عليهم ملك فاعتقدوا إن ذلك مما يختص به النبي فذوقهم صحيح وحكمهم باطل وهم قائلون إنه من أتى منهم بزيادة قبلت منه لأنه عدل صاحب ذوق ما عندهم تجريح ولا طعن ولا يتعدون ذوقهم فمن هنالك وقع الغلط ولو وصل إليهم ممن تقدمهم أو كان معهم في زمانهم من أهل الله القول بنزول الملك على الولي قبلوه وما ردوه وقد رأينا في الوقائع ممن تقدم جماعة غير قائلين بأمر ما فلما سمعوه منا قبلوه ولم ينكروه لارتفاع التهمة عنهم في أشكالهم وأمثالهم فإن قال أحد من أهل الله من أهل الإشارات وهم أصحاب النداء على رأس البعد إنك قد قلت إنه ما من حقيقة ولا نسبة في العالم إلا وهي صادرة عن نسبة إلهية ومن نسب العالم الافتقار وقد قال أبو يزيد وهو من أهل الكشف والوجود إن الله قال له في بعض مشاهده معه تقرب إلي بما ليس لي الذلة والافتقار\n\n\n### [أن للحق تعالى الرحمة والعفو والكرم والمغفرة]\n\n\nفاعلم أيها المستفيدان الحق تعالى له الرحمة والعفو والكرم والمغفرة وما جاء من ذلك من أسمائه الحسنى وهي له تعالى حقيقة وكذلك له الانتقام والبطش الشديد فهو سبحانه الرحيم العفو الكريم الغفور ذو انتقام ومن المحال أن تكون آثار هذه الأسماء فيه أو يكون محلا لآثارها فرحيم بمن وعفو عمن وكريم على من وغفور لمن وذو انتقام ممن فلا بد أن يقول إن الله الخالق يطلب المخلوق والمخلوق يطلب الخالق وصفة الطالب معروفة والحاصل لا ينفي فلا بد من العالم لأن الحقائق الإلهية تطلبه وقد بينا لك أن معقولية كونه ذاتا ما هي معقولية كونه إلها فثنت المرتبة وليس في الوجود العيني سوى العين فهو من حيث هو غني عن العالمين ومن حيث الأسماء الحسنى التي تطلب العالم لإمكانه لظهور آثارها فيه يطلب وجود العالم فلو كان العالم موجودا ما طلب وجوده فالأسماء\nله كالعائلة ورب العيال يسعى على عياله والخلق عيال الله الأبعد والأسماء الآل الأقرب فسأله العالم لإمكانه وسألته الأسماء لظهور آثارها وما يسأل إلا فيما ليس له وجود فلا بد من وجود العالم والكتاب حاكم والعلم سابق والمشيئة محققة فمن المحال أن لا يقع وإنما وقع التكفير في الطائفة التي قالت إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ بالمجموع فإنهم ليسوا بأغنياء عن الله وليس الحق بمتأخر عن إيجادهم ولا عن إسباغ النعم عليهم فضلا منه ومنة لحكم كتاب سبق قال الله تعالى لَوْ لا كِتابٌ من الله سَبَقَ لَمَسَّكُمْ فِيما أَخَذْتُمْ عَذابٌ فالحكم للكتاب ونسبة الكتاب ما هي نسبة الذات وتعين إمضاء الحكم فيمن أمضاه فهو للكتاب كالسادن والمتصرف بحكم جبر المرتبة هذا تعطيه الحقائق بأنفسها وهي لا تتبدل ولو تبدلت الحقائق اختل النظام ولم يكن علم أصلا ولا حق ولا خلق فلو نظر العاقل في حكمة الخطاب الإلهي في قوله تعالى سَنَكْتُبُ ما قالُوا وأخذه من قوله كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ يريد أوجبها على نفسه لأنه ما ثم موجب إلا هو تعالى فقال سنوجب ما قالوه فيما يرجع ضرره عليهم وقال في تمام الآية ونَقُولُ ذُوقُوا عَذابَ الْحَرِيقِ عقوبة لقولهم ولهذا كان تحقيق كفرهم بالمجموع فإنهم ليسوا بأغنياء فهذا روح هذه الآية وأما احتجاجك بما قاله لأبي يزيد فهو أيضا عين المجموع فلم يقل الذلة وحدها بل قال الذلة والافتقار ونسبة المجموع ليست بنسبة الأفراد فلو لا الممكن ما ظهر أثر للأسماء الإلهية والاسم هو المسمى عينه ولا سيما الأسماء الإلهية فالوجود طالب ومطلوب ومتعلق الطلب العدم فأما إعدام موجود وإما إيجاد معدوم قال الله تعالى الله لا إِلهَ إِلَّا هُوَ فما نفى إلا الألوهة أن تكون نعتا لأكثر من واحد فللأسماء الإلهية أو المرتبة التي هي مرتبة المسمى إلها التصريف والحكم فيمن نعت بها فبها يتصرف ولها يتصرف وهو غني عن العالمين في حال تصرفه لا بد منه فانظر ما أعجب الأمر في نفسه ومن هنا يعرف قول أبي سعيد الخراز أنه ما عرف الله إلا بجمعه بين الضدين ثم تلا هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وأما قول اليهود في البخل يَدُ الله مَغْلُولَةٌ فقال تعالى فيهم غُلَّتْ أَيْدِيهِمْ ولُعِنُوا بِما قالُوا أي أبعدوا عن صفة الكرم الإلهي فإن أقوالهم من أعمالهم فغلت أيديهم فوقع البخل الذي نسبوه إلى الله بهم فما شهدوا من الله إلا ما قالوا فأذاقهم طعم ما جاءوا به وكذبهم الله بعد ذلك في المال فبسط عليهم الكرم بالرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ ليعرفهم بأنهم كانوا كاذبين وهو أشد العذاب عليهم وأشد النعيم فإنه إذا بسط عليهم الجود والكرم علموا جهلهم فتوهموه فتعذبت نفوسهم بتصور الحال التي كانوا عليها من الجهل بالله ويتنعمون بإزالة ذلك ووقوفهم على العلم وعلموا أن جهلهم أورثهم الكذب على الله تعالى بَلْ يَداهُ مَبْسُوطَتانِ يُنْفِقُ كَيْفَ يَشاءُ فالحكم للمشيئة فافهم وليست مشيئته غير ذاته فأسماؤه عينه وأحكامها حكمه وما ظهر العالم إلا بما هي عليه من القوي‏\n\n\n> فانظر إليه تكنه *** ولا تجاوز حدك‏\n\n\n> فكل ما هو فيه *** فإنما هو عندك‏\n\n\n> من قدر الله حق قدره *** أظهر أمر الوجود منه‏\n\n\n> فكل أمر تراه عين *** من علمه فيه فهو عنه‏\n\n\n> فعينه عين من تراه *** لذاك ما للوجود كنه‏\n\n\nفإذا قلت الله فهو مجموع حقائق الأسماء الإلهية كلها فمن المحال أن يقال على الإطلاق فلا بد أن تقيده الأحوال وإن قيدته الألفاظ فبحكم التبعية للأحوال فكلما أضيف إليه فانظر أي اسم تستحقه تلك الإضافة فليس المطلوب من الله في ذلك الأمر إلا الاسم الذي تخصه تلك الإضافة والحقيقة الإلهية التي تطلبه فلا تتعداه ومن كان هذا حاله فقد وفى الله حقه وقدر قدره مجملا فإنه لا يقدر قدره مفصلا لأن الزيادة من العلم بالله لا تنقطع دنيا ولا آخرة فالأمر في ذلك غير متناه أ لم تر أن الله تعالى بعث موسى عليه السلام برسالة إلى فرعون كان من جملتها أن يقول له إذا قال له فرعون فَما بالُ الْقُرُونِ الْأُولى‏ ... عِلْمُها عِنْدَ رَبِّي في كِتابٍ لا يَضِلُّ رَبِّي ولا يَنْسى‏ يعني ما أوجبه على نفسه من ذلك فما كتبها في اللوح المحفوظ إلا ليعلم من ليس من شأنه أن لا يعلم إلا بالإعلام لا ليتذكر ما أوجبه على نفسه مما تستقبل أوقاته في‏\n\n\nالمدد الطائلة فإنه سبحانه لا يَضِلُّ رَبِّي الذي جئتك من عنده لأدعوك إلى عبادته ولا يَنْسى‏ وقال‏\nتعالى عن نفسه نَسُوا الله فَنَسِيَهُمْ وما نسوه على الإطلاق فما ينساهم على الإطلاق وإنما ينساهم فيما نسوه فيه مما لو علموا به نالتهم الرحمة من الرحيم بذلك فلما نسوه نسيهم الرحيم إذ تولاهم الاسم الإلهي الذي كانوا في العمل الذي يدعو ذلك الاسم إليه فإذا انقضى عدل ميزانه فيه زال النسيان إذ لا بد من زواله عند كشف الغطاء عند الموت في الدنيا فلا يموت أحد من أهل التكليف إلا مؤمنا عن علم وعيان محقق لا مرية فيه ولا شك من العلم بالله والايمان به خاصة هذا هو الذي يعم فلا بأس أشد من الموت وما بقي الأهل ينفعه ذلك الايمان أم لا أما في رفع العقوبة عنهم فلا إلا من اختصه الله مثل قوله تعالى فَلَمْ يَكُ يَنْفَعُهُمْ إِيمانُهُمْ لَمَّا رَأَوْا بَأْسَنا ثم قال وهو موضع استشهادنا سُنَّتَ الله الَّتِي قَدْ خَلَتْ في عِبادِهِ وأما الاستثناء فقوله تعالى إِلَّا قَوْمَ يُونُسَ لَمَّا آمَنُوا كَشَفْنا عَنْهُمْ عَذابَ الْخِزْيِ في الْحَياةِ الدُّنْيا ومَتَّعْناهُمْ إِلى‏ حِينٍ فلا حكم على الله في خلقه وأما نفع ذلك الايمان في المال فإن ربك فَعَّالٌ لِما يُرِيدُ وإنه يقول تعالى إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً فهذا قوله عهده إلينا في كتابه وعلى ألسنة رسله ع‏\n\n\n> فقد أن الحق فيما أتى به *** رسول إلى قلبي من الملإ الأعلى‏\n\n\n> فأخبرني بالأمر من نصفه فما *** أقول بأحرى في الأمور ولا أولى‏\n\n\n> بل الأمر فيه واحد ليس غيره *** فمن عالم يبلى ومن عالم يبلى‏\n\n\n> وذلك فرقان يبين دليله *** وليس بقرآن على قلبنا يتلى‏\n\n\n> وإن كان قول الله في كل حالة *** علي إذا ما جئت حضرته يملي‏\n\n\n> وخلقي عجيب لا يزال مجددا *** وما مر منه لا يزال ولا يبلى‏\n\n\n> فحكم الحكيم الحق في الخلق ظاهر *** فسبحان من أعمى وسبحان من أجلي‏\n\n\n> لقد جاد لي إنعامه بشهوده *** وقد خصني منه بمورده الأحلى‏\n\n\nفمن اتقى الله جعل له فرقانا وإن كان في عين القرآن العزيز الذي هو الجمع من قريت الماء في الحوض إذا جمعته فما كل فرقان قرآن وكل قرآن فرقان‏\n\n\n> فعين الجمع عين الفرق فانظر *** بعينك لاجتماع في افتراق‏\n\n\n> فليس المثل عين المثل فاحكم *** عليه بالفراق وبالتلاق‏\n\n\n> وإن شئنا إذا فكرت فيه *** حكمنا بالنكاح وبالطلاق‏\n\n\n> فلو لا الحق ما كان اتساق *** فساق الحق ملتف بساقي‏\n\n\n> وعند شرودنا عنه دعاني *** لا علم أن في العقبي مساقي‏\n\n\n> إليه في جسوم من نبات *** فإن طبنا فمسك في حقاق‏\n\n\nفَرِيقٌ في الْجَنَّةِ وفَرِيقٌ في السَّعِيرِ فتميز الواحد عمن ثناه فانفرد كل فريق بأحديته وجمعيته فمنهم من تأنس بانفراده بفرديته وأحديته ومنهم من استوحش في انفراده بفرديته وأحديته فتلك عند العارفين وحشة الحجاب‏\n\n\n> فأي نعيم لا يكدره الدهر *** ولله فيما قلته الخلق والأمر\n\n\n> فلو لا وجود الحق ما كان خيره *** ولو لا وجودي لم ير في الورى الشر\n\n\n> ولست سواه لو تسر حقيقتي *** ولكنه أخفى فشأني له ستر\n\n\n> فمن يتحقق صورتي فإنه *** يلوح له من نشأتي الدر والدر\n\n\n> فدر لا حجار تنافس نشأتي *** وللعلم منها ما يجود به الدر\n\n\n> فإن كنت ذا عقل تبين حكمه *** وإن كنت ذا عين فقد رفع الستر\n\n\n> فإن شئت فأشر به رحيقا مختما *** وإن لم تشأ خمرا فمشربك المزر\n> فسبحان من أحيا الفؤاد بذكره *** ولو لم يكن ذكر لقام به الفكر\n\n\n### [ثبوت العلم على صورته‏]\n\n\nواعلم أيدك الله بروح منه أني ما رأيت ثبوت العلم على صورته لا يتغير إلا في هذا المنزل فأورثني الطمأنينة فيما علمت أنه لا يزول وأن الشبه لا تزلزله وأن الشبهة إذا جاءت لمن شاهد هذا الأمر في هذا المنزل رآها شبهة لا يمكن أن تتغير له عن صورتها بخلاف من ليس له هذا المنزل فإنه يتزلزل ويؤديه ذلك التزلزل إلى النظر فيما كان قد قطع أنه يعلمه ولا يعرف هل العلم الأول كان شبهة أو هل الشهود شبهة أو هل الأمران شبهة فيحار وذلك أنه ليس هو في علمه بالأمور على بصيرة لأنه ولدها بفكره فإذا جاءت الأمور بأنفسها لا بجعلك وإنشائك أعطتك حقائقها فعلمتها على ما هي عليه ويتعلق بهذا المنزل آيات كثيرة من القرآن العزيز ولو بسطنا الكلام فيها لطال المدى فلنذكر منها بعض آيات لا كلها ولا أشرحها وإنما أنبه عليها للعقول السليمة والأبصار النافذة فمن ذلك ولِلَّهِ مُلْكُ السَّماواتِ والْأَرْضِ ومنها لَهُ الْمُلْكُ ولَهُ الْحَمْدُ وهُوَ عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ في سورة التغابن ومنها وقالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِي ولَكَ ومنها وَيْلٌ لِلْمُطَفِّفِينَ ومنها فَوَيْلٌ لِلْمُصَلِّينَ ومنها فَوَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ حيث وقع ومنها وتَاللَّهِ لَأَكِيدَنَّ أَصْنامَكُمْ بَعْدَ أَنْ تُوَلُّوا مُدْبِرِينَ ومنها ولَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله توطئة لسعادتهم ومنها لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ فصدر بهذه الآية ليعلم بما هو الأمر عليه بالنسبة إليه ومنها إِنَّ رَبَّهُمْ بِهِمْ يَوْمَئِذٍ لَخَبِيرٌ فاكتفى بالخبرة عن العلم إذ كانت كل خبرة علما ومنها ولَوْ شاءَ الله لَجَمَعَهُمْ عَلَى الْهُدى‏ فجاء بحرف امتناع لامتناع ومنها ولَوْ لا أَنْ يَكُونَ النَّاسُ أُمَّةً واحِدَةً لَجَعَلْنا لِمَنْ يَكْفُرُ بِالرَّحْمنِ لِبُيُوتِهِمْ سُقُفاً من فِضَّةٍ ومَعارِجَ عَلَيْها يَظْهَرُونَ ومنها إِنَّ السَّاعَةَ آتِيَةٌ أَكادُ أُخْفِيها لِتُجْزى‏ كُلُّ نَفْسٍ بِما تَسْعى‏ ومنها وكَذلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِيَقُولُوا أَ هؤُلاءِ من الله عَلَيْهِمْ من بَيْنِنا ومنها ما كانَ الله لِيَذَرَ الْمُؤْمِنِينَ عَلى‏ ما أَنْتُمْ عَلَيْهِ الآية ومنها ثُمَّ لْيَقْضُوا تَفَثَهُمْ ولْيُوفُوا نُذُورَهُمْ ولْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ ومنها لَتُؤْمِنُنَّ به ولَتَنْصُرُنَّهُ ومنها وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ الآية ومنها وإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ ومنها يَوْمَئِذٍ تُحَدِّثُ أَخْبارَها بِأَنَّ رَبَّكَ أَوْحى‏ لَها ومنها أَ فَمَنْ يَمْشِي مُكِبًّا عَلى‏ وَجْهِهِ أَهْدى‏ وهو الذي سقط على وجهه في النار من الصراط وهو من الموحدين ومنها وهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ من بَعْدِ ما قَنَطُوا ويَنْشُرُ رَحْمَتَهُ ومنها إِنَّ في ذلِكَ لَعِبْرَةً لِأُولِي الْأَبْصارِ أي تعجبا ومنها فَمَنْ يَكْفُرْ بَعْدُ مِنْكُمْ فَإِنِّي أُعَذِّبُهُ عَذاباً لا أُعَذِّبُهُ أَحَداً من الْعالَمِينَ ومنها وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فتدبر منازل هذه الآيات وأمثالها ومن هنا تعرف قوة الألف واللام اللتين للعهد والتعريف والجنس وإلحاق لام ألف بالحروف والحروف على قسمين حروف هجاء وهي الحروف الأصلية وحروف معاني وكلاهما في الرقم بالوضع وفي اللفظ بالطبع في الإنسان وكلها منك وفيك وما ثم أمر خارج عنك فلا ترجو أن تعرف نفسك بسواك فإنه ما ثم فأنت دليل عليك وعليه وما ثم من هو دليل عليك‏\n\n\n> من ذا الذي ترتجيه بعدك *** وأنت في الحالتين وحدك‏\n\n\n> فانظر إليه به تكن هو *** فكل ما فيه فهو عندك‏\n\n\nوفي هذا المنزل من العلوم علم ما للأسباب في المسببات من الأحكام وتفصيل الأسباب وهل العالم كله أسباب بعضه لبعضه وهل من الأسباب ما يكون عدما وهو سيب مثل النسب كتعلقات المعاني الموجبة أحكاما بتعلقها وفيه علم ما ثبت لله من الأحكام عقلا وشرعا وفيه علم ما فائدة الأخبار في المخير المعقول وما الأخبار التي تفيد علما من التي تفيد ظنا أو غلبة ظن من الأخبار التي تفيد حيرة من الأخبار التي تقدح في الأدلة النظرية لقدحها في العلم وفيه علم الخلق عيال الله هل معناه معنى يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله وفيما ذا يكون الفقر مع كونهم موجودين وعلمهم من الحق أنهم لا يعدمون بعد وجودهم وإنما هو تقلب أحوال عليهم فمن حال يزول وحال يأتي والزائل يعطي زواله حكما والآتي يعطي إتيانه حكما والمحكوم عليه بالحكمين واحد العين كالقائم‏\n\n\nيقعد فالقعود آت والقيام زائل فحكم زوال القيام كونه ليس بقائم وهو عين حكم القعود ويزيده القعود أحكاما لم تفهم من زوال القيام قد صار إليها وهي أنه ليس بمضطجع ولا راكع ولا ساجد ولا منبطح وفيه علم ما حكمة استفهام العالم عما يعلم وفيه علم لما ذا يرجع ما يدركه البصر من تحول العين الواحدة في الصور في نظر الناظر هل هي في نفسها على ما يدركها البصر أو هي على ما هي عليه في نفسها لم تنقلب عينها وهذا راجع إلى ما يرى‏\nمن الأعيان ويحكم عليها بأنها أعيان هل تكثرت بأعراض أو بجواهر فإن الصور تختلف في النظر دائما وكل منظور إليه بالبصر من الأجسام جسم فالجسمية حكم عام ونرى فيها صورا مختلفة منها ما يكون سريع الزوال ومنها ما يبطى‏ء في النظر والجسم جسم لم يتبدل وليس الموصوف بما ظهر إلا الجسم وكذلك الصور الروحانية والتجلي الإلهي وهذا علم فيه إشكال عظيم والتخلص منه بطريق النظر الفكري عسير جدا وفيه علم ما للنائب من الشروط أن يشترطها على من استخلفه مع علمه بأنه مقهور في إقامته نائبا فهل اشتراطه مؤذن بجهله بمن استخلفه أو بنسيانه فيذكره أو يعلمه بمصالحه أكثر من علم من استخلفه بها وينفتح في هذا الاشتراط أمور هائلة تقدح أو يعلم النائب أن من استخلفه يريد منه أن يسأله فيما اشترط عليه ليريه فقره إليه ذوقا إذ لو كان للنائب الاستقلال بما طلبه في شرطه ما اشترطه وفيه علم تعرض النائب لمن استخلفه بالرشاء وما يقبل من الرشاء وما لا يقبل وفيه علم إجابة المستخلف النائب في كل ما يسأله من مصالحه وفيه علم إن في الطعن على المستخدمين تسفيه من استخدمهم وهو علم خطر جدا ولذلك نهي عن الطعن على الملوك والخلفاء وأخبرنا أن قلوبهم بيد الله إن شاء قبضها عنا وإن شاء عطف بها علينا وأمرنا أن ندعو لهم وإن وقوع المصلحة بهم في العامة أكثر من جورهم وما حكمة جورهم مع كونهم نواب الله على الحقيقة في خلقه سواء كانوا كفار أو مؤمنين وعادلين أو جائرين ما يخرجهم ذلك عن إطلاق النيابة عليهم فهل إذا جار النائب انعزل فيما جار فيه من النيابة أو انعزل على الإطلاق من النيابة ثم جدد الحق له نيابة أخرى مجددة وفيه علم تعداد النعم من المنعم على المنعم عليه هل هو من قادح أو هل هو تعريف ليعلم قدر ذلك لما طلب منه من الشكر عليها أو هل هو عقوبة لأمر وقع منهم أو هل تسوغ فيه مجموع هذه الوجوه كلها وفيه علم الرفق في التعليم في مواطن والإغلاظ في مواطن وفيه علم من أين جئت وإلى أين تروح وهل ثم رجوع على الحقيقة أم لا أو هو سلوك أبدا قد ما لا رجوع فيه والرجوع للمعقول والمحسوس في العالم لأية نسبة إلهية يرجع وهل وصف الحق بالرجوع على ما قلناه في الرجوع أم لا فإن الحقائق تأبى أن يكون ثم رجوع وفيه علم الفرق بين وصف النفوس الناطقة بالعقول والنهي والأحكام والألباب وأمثال هذه الألقاب لما ذا يرجع وفيه علم ما حكمة إقامة الدليل لمن لا يعلم أن ذلك دليل وهو يعلم أنه عالم بهذه الصفة فهل هو عينه مقصود بذاك الدليل أو غيره فيكون فيه ناقلا فينتفع به ويقبله من يصل إليه من نقل هذا الذي لم يعلم أن ذلك دليل وهذا يقع كثيرا وهوقول النبي صَلَّى اللهُ عَليهِ وسَلَّم رب حامل فقه ليس بفقيه‏\n\n\nفإذا حمله ونقله إلى فقيه قبله ذلك الفقيه واستفاد به علما لم يكن عنده والناقل لا علم له بشي‏ء من ذلك وفيه علم تسمية الشي‏ء باسم الشي‏ء إذا كان مجاورا له أو كان منه سبب وفيه علم لم أمر الشارع بقتل الساحر ولما ذا سمي كافرا ولما علم فرعون صدق موسى عليه السلام وأضمر الايمان في نفسه الذي أظهره عند غرقه حين رأى البأس هل قتل من قتل من السحرة الذين آمنوا لكونهم سحرة فقتلهم شرعا في باطن الأمر ولإيمانهم في ظاهر الأمر وإذا قتل الساحر هل ذلك القتل كفارة له وجزاء على سحره ولم يبق عليه من جهة ذلك السحر في الآخرة مطالبة فيه من الحق سبحانه وتعالى أم لا مطالبة عليه فيه من الله وفيه علم تفاضل المقربين عند الله بما ذا فضل بعضهم بعضا وفيه علم‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم في ابتلاء المؤمن بالرزايا والمصائب إن له خيرا في ذلك كله‏\n\n\nولما ذا كان أهل الله في الدنيا أشد بلاء من سواهم ولما ذا يرجع اقتضاء ذلك في حقهم دون غيرهم من الناس المؤمنين وفيه علم لما ذا جبلت النفوس على حب المال ولا سيما الذهب هل لحيازته درجة الكمال المعدني فوقعت المناسبة بين الكاملين أو هل لما فيه من قضاء حوائجهم فهم فقراء إليه لوصولهم به إلى أغراضهم وقول عيسى عليه السلام قلب كل إنسان حيث ماله فاجعلوا أموالكم في السماء تكن قلوبكم في السماء\n\n\nفمن اكتنز ماله فقد دفن قلبه في أرض طبيعته فلا يلتذ بمشاهدة أبيه الذي هو الروح الإلهي أبدا ومثل هذا يكون ابن أمه وإن كان له أب ولكن لا ينسب إليه كعيسى ابن مريم عليه السلام ينسب إلى أمه وما وهبه لها إلا جبريل عليه السلام لما تمثل لَها بَشَراً سَوِيًّا وأعلمها ومع هذا فما نسب إلا إلى البقعة الجسمية مع كونه يحيي الموتى من حيث ما هو من هبات الروح الأمين وفيه علم الغيرة الإلهية وممن زاحمه في الاسم الخاص الذي به شرفه وفيه علم متى يتعين إجابة السائل فيما سأل إذا سأل ومن سأل بالحال هل يتعين‏\nإجابته بالحال فيكون الجواب مطابقا للسؤال وفيه علم وضع من ارتفع بنفسه وانحطاط من تطاول فوق قدره وفيه علم فائدة الموعظة ولو كفر بها فإن لها أثرا في الباطن عند السامع وإن لم يظهر ذلك فإنه يحس به من نفسه وفيه علم من أراد كيدا فصادف حقا فهو عنده كذب ثم أسفرت العاقبة إنه صدق في نفس الأمر ولكن لا علم له بذلك وفيه علم الأوقات وما تعامل به عقلا وشرعا عند السليم الفكر وفيه علم تعيين مكارم الأخلاق وفيه علم أن العلم بما لا يعلم أنه لا يعلم علم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 364: Concerning the Knowledge of the Station of Two Secrets, the Attainment of Repose in This World and the Hereafter by Him Who Knows Them, and the Divine Jealousy (الغيرة الإلهية).\n\nIf a person stands up for judgments (aḥkām) on behalf of another, that one is the deputy (al-mustanāb).\nBut if he was not deputized, yet stands up for them, he has neither doubt nor uncertainty.\nAnd if he were to pray against him who transgresses, his prayer concerning him would be answered.\nDue to the truthfulness of the promise and the sincerity (al-ikhlāṣ) within it, he strikes when he wills, and is not struck.\n\n[Everything has always been with Allah in Actuality (bi-l-fi‘l) concerning His servants; nothing is with Him in Potentiality (bi-l-quwwa)]\n\nThis station (manzil) is the Divine glad tidings (al-bushrā al-ilāhiyya) of the repose (al-rāḥa) necessitated by the Divine solicitude (al-i‘tinā’ al-ilāhī) for those righteous servants of Allah who are given these tidings, until the Day of Resurrection and in the Resurrection. For everything has always been with Allah in Actuality (bi-l-fi‘l) concerning His servants; nothing is with Him in Potentiality (bi-l-quwwa). Thus, the Divine definitions (al-ta‘rīfāt al-ilāhiyya) came to him concerning what Allah had in it of Acts (al-af‘āl) and States (al-aḥwāl), so that he might recall with his intellect his witnessing (shuhūd) of that from his Lord within himself, during his state of non-existence, due to the Fixity (al-thubūt) upon which he was, which necessitated his acceptance of the Divine disposal (al-taṣarruf al-ilāhī) within him.\n\nAnd by that Fixed State (al-ḥāla al-thubūtiyya), he complied with the command of the Real (al-Ḥaqq) for creation (al-takwīn), for the command is only directed toward one characterized by hearing (al-sam‘). The Divine Word (al-qawl al-ilāhī) has always been, and the Fixed Hearing (al-sam‘ al-thubūtī) has always been. What came into existence (ḥadatha) was only the Existential Hearing (al-sam‘ al-wujūdī), which is a branch of the Fixed Hearing. Thus, the state transferred onto the essence (ayn) of the hearing, but the hearing itself did not transfer, for the essences (al-a‘yān) do not change from one state to another. Rather, the states clothe them with judgments (aḥkām), and they are clothed, leading the ignorant to imagine that the essence has transferred. The states seek the Divine Names (al-asmā’ al-ilāhiyya), not that the essences are described as seeking. New names and a heart (al-qalb) arise for the essences according to the judgments of the states upon which they revolve. Were it not for the states, the essences would not be distinguished, for there is nothing there but a single essence (ayn wāḥida) distinguished by its Essence (dhāt) from the Necessary of Existence (wājib al-wujūd), just as it shares with Him the necessity of Fixity (wujūb al-thubūt). Thus, for Him (Exalted is He) is the necessity of Fixity and Existence (al-wujūd), and for this essence is the necessity of Fixity. The states for this essence are like the Divine Names for the Real (al-Ḥaqq). Just as the Names belong to the single Essence (al-ayn al-wāḥida) without multiplying or increasing the Named, so too the states for this essence do not multiply or increase it, despite the intelligibility of multiplicity (al-kathra) and number in the Names and the states. By this, it is valid to say of this essence that it is \"upon the Image\" (alā al-ṣūra), meaning upon the reality of the Divine Command. This essence attained perfection through Existence (al-wujūd), which is one of the states upon which it revolved. The only thing lacking from its perfection is the negation of the judgment of the necessity of Existence (wujūb al-wujūd), for the sake of distinction between it and Allah, since that cannot be lifted, nor can it establish a footing therein.\n\nAnd He has another distinction: the Real (al-Ḥaqq) revolves *in* the states; the states do not revolve *upon* Him, because it is impossible for a state to have a judgment over the Real. Rather, He (Exalted is He) has judgment over them. Therefore, He revolves in them, and they do not revolve upon Him: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in a [new] affair). For if they revolved upon Him, they would necessitate judgments upon Him. The essence of the world (ayn al-‘ālam) is not like that; the states revolve upon it, and their judgments appear therein, though their revolution upon it is by the hand of Allah (Exalted is He). As for the Real's revolving in the states, this is known through the descent (al-nuzūl), the establishment (al-istiwā’), the concomitance (al-ma‘iyya), the laughter, the joy, the pleasure, and the wrath. Every state by which the Real describes Himself, He (Glorified is He) revolves in it by judgment. This is the difference between us and the Real, and it is the clearest and most manifest of differences. Thus, participation occurred in the states, just as it occurred in the Names, because the Names are the names of the states, and their Named is the essence (al-‘ayn), just as they are Names for Him by a different proportion, and their Named is the Real (al-Ḥaqq). So, He is <<هُوَ السَّمِيعُ الْبَصِيرُ>> (He is the All-Hearing, the All-Seeing), the All-Knowing, the All-Powerful, and you are the hearing, the seeing, the knowing, the powerful. The state of hearing, sight, knowledge, and power is for us and for Him by two different proportions, for He is He, and we are we. We are instruments for Him, and He is instruments for us. For Allah said, upon the tongue of His servant, \"Allah hears him who praises Him,\" and He said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله>> (Grant him protection until he hears the Word of Allah), and <<وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏>> (And you did not throw when you threw, but Allah threw). The instrument (al-āla) was the Messenger of Allah (peace and blessings be upon him).\n\nThe revolving of the Real in the states is for the manifestation of their essences (a‘yān), like the revolving of the One in the degrees of numbers for the manifestation of their essences. Know that this station (manzil) was only named the Station of Two Secrets (manzil sirrayn) because of a marvelous secret: that the single thing is doubled by itself, and not by another, in the sensible (al-maḥsūs) and the intelligible (al-ma‘qūl). As for the sensible: Adam was doubled by what was opened in his short left rib, the form of Eve (Ḥawwā’). He was one in his essence, then became a pair through her, yet she is nothing other than his own self, concerning which it was said that he is one. As for the intelligible: the Divinity (al-ulūhiyya) is nothing other than His Essence (dhāt), yet the intelligible concept of Divinity is contrary to the intelligible concept of His being an Essence. Thus, Divinity doubled the Essence of the Real, yet it is nothing other than its own essence. Just as He spread forth in the sensible realm from Adam and from what doubled him from his own essence, many men and women, upon the image of the pair, so too did He spread forth from the Essence of the Real (Exalted is He) and His being the God (Ilāh) of the world, upon the image of these two intelligible concepts. The world came forth upon the image of an effector (mu’aththir) and an affected (mu’aththar fīhi) for the sake of procreation (al-tawālud)—that is, the procreation of its parts. For Divinity is a judgment (ḥukm) for the Essence, by which it judged the creation of the world. When it preferred the judgment of creating the world for that purpose, the world appeared in the image of its Creator, between an effector and an affected, just as occurred in the sensible realm. For Allah did not create from Adam and Eve an earth, nor a heaven, nor a mountain, nor anything other than their own species; rather, He created from them only their like in form and judgment.\n\nIndeed, She whose existence was the cause of Being (al-wujūd), is an Essence whose word sanctifies its meaning.\nI surely love Her, and I love Her nearness to me, and I love everyone who loves Her.\nLayla, Lubna, Rabab, and Zaynab are peers whose faces are brought to life by my love for Her.\nIf I die, Her existence dies with our death, for our existence is Her essence and Her other.\nHow wondrous is our case and Hers! For our existence is single (fard), there is no second, so who doubled it?\n\nSince the Origin (al-aṣl) was one, and nothing doubled it except itself, and no multiplicity (kathra) appeared except from its essence, likewise, in everything in the world, there was a sign (āya) indicating that He is One. The entire cosmos (al-kawn) is body and spirit (rūḥ), by which the genesis of Existence (nash’at al-wujūd) is established. The world is to the Real (al-Ḥaqq) as the body is to the spirit. Just as the spirit is only known through the body—for when we looked into it and saw its form, while it remained, the judgments we witnessed from the body and its form, such as the perception of sensibles and meanings, departed from it—we knew that beyond the manifest body there is another meaning (ma‘nā) which granted it the judgments of perceptions therein. We named that meaning the spirit (rūḥ) of this body. Likewise, we did not know that we have a command (amr) that moves us, stills us, and judges in us as it wills, until we looked into our souls (nufūs). When we knew our souls, we knew our Lord, exactly like one sandal following another. For this reason, He informed us in the Revelation (al-waḥy) with His saying: \"Whoever knows his self knows his Lord.\" And in the revealed Divine tradition (al-khabar al-munazzal al-ilāhī): <<سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ>> (We shall show them Our signs in the horizons and in themselves, until it becomes clear to them that He is the Real).\n\nThe world only appeared from Allah in the image of the reality upon which the Command rests. There is no honor in the Origin (al-aṣl) for me from which evils (al-shurūr) are derived. The world is in the grasp of Pure Good (al-khayr al-maḥḍ), which is Complete Existence (al-wujūd al-tāmm). However, since the contingent (al-mumkin) has a view toward non-existence (al-‘adam), it is by that measure that evil is attributed to it. For it does not possess the judgment of the necessity of Existence (wujūb al-wujūd) by its own essence. If evil occurs to it, it is from that perspective, and it does not persist or become fixed, for it is in the grasp of Pure Good and Existence.\n\nFurthermore, part of the complete Gnosis (al-ma‘rifa) established in the knowledge of Allah is that the body has intelligible and known effects in the spirit, due to the sciences of spiritual tastes (ulūm al-adhwāq) that can only be known through it. And the spirit has sensible effects in the body, witnessed by every living creature in itself. Likewise, concerning the world and the Real (al-Ḥaqq), Allah has manifest effects in it, which are the states in which the world revolves—and that is due to the judgment of His Name, Time (al-Dahr). The Real (Glorified is He) informed us that the world, in terms of what He has obligated it with, has effects that we would not have known had He not informed us of them. This is because if we follow His Messenger in what he brought us concerning obedience to Allah, He loves us and is pleased with us, and thus is pleased with us. If we disobey Him, fail to comply with His command, and rebel against Him, He informs us that we have displeased Him and angered Him, and thus He is wrathful toward us. If we supplicate Him, He answers us. Thus, supplication is from His effect, and the answer is from our effect. This is so that you may know that He only manifests something from the image of what He is. It is impossible for the matter to be otherwise, for where else could it come from? There is nothing there but Him.\n\nA thing only gives what is in its potentiality. For this reason, the Real described Himself to us with attributes (nu‘ūt) that are contingent (muḥdathāt) in our view, yet in reality, they are His attributes that appeared in us, and then returned to Him. And He (Glorified is He) described us with attributes that His Majesty (jalāl) deserves, and thus they are truly His attributes. Were it not that He created us upon the image of what He is in Himself, it would not be valid or established for us to accept any attribute with which He described us that is rightfully His, nor would He accept any attribute with which He described Himself that is rightfully ours. Yet, all is rightfully His. He is the Origin (al-aṣl) of which we are the branch, and the Names are the branches of this tree—I mean the Tree of Existence (shajarat al-wujūd)—and we are the essence of the fruit. Rather, He is the essence of the fruit. We have no analogy except the existence of this tree.\n\nPart of the complete Gnosis of Allah is what He informed us of through the tongue of His Messenger (peace and blessings be upon him) concerning His transformation (taḥawwul) in images (al-ṣuwar) in the stations of Theophany (mawāṭin al-tajallī). This is the origin of our own transformation in states (al-aḥwāl), inwardly and outwardly, and all of that is in Him (Exalted is He). Likewise, He (Exalted is He) is in the affairs (shu’ūn) of the world according to what the judicial arrangement (al-tartīb al-ḥukmī) necessitates. His affair tomorrow cannot be except tomorrow, and the affair of today cannot be except today, and the affair of yesterday cannot be except yesterday. This is all when viewed in relation to Him (Exalted is He). As for the view toward the affair itself, it could occur at a time other than when it does, had the Real (Exalted is He) willed it. There is no compulsion (jabr) or confusion in His Will (mashī’a)—Exalted is Allah far above that! Rather, His Will has only one single connection.\n\nAmong [the verses related to this station] is His saying: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> (We shall attend to you, O you two heavy burdens [al-thaqalān]). This means, [We shall attend] to you and to the world which is other than us. He only named us the two heavy burdens because of the heaviness (al-thiql) in us, which is the essence of our delay in existence (al-wujūd), so we were slow. It is the habit of the heavy to be slow, just as it is the habit of the light to be quick. We and the Jinn are the two heavy burdens, and we are heavier than the Jinn due to the element that predominates us, which is earth (al-turāb). The human is the last existent in the world, because an abbreviation (al-mukhtaṣar) is only abbreviated from an extended work (muṭawwal); otherwise, it is not an abbreviation. The world is the abbreviation of the Real, and the human is the abbreviation of the world and the Real. He is the purity of the abbreviation—I mean the Perfect Human (الإنسان الكامل). As for the animal human (al-insān al-ḥayawān), he is the abbreviation of the world. It is for him that the Real attends, to establish upon him the balance (mīzān) for which he was created.\n\nHis saying <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> is a word of threat, and the Perfect Human is not addressed by this speech. However, in this word there is an indication of the attachment of Mercy (al-raḥma) to them (the two heavy burdens), which is found in the opening (fatḥ) of the *lām* attached to the pronoun of the addressee (لَكُمْ). Although the Divine opening (al-fatḥ al-ilāhī) may be with what displeases, just as it may be with what pleases, His Mercy preceded His Wrath. The verse uses the instrument of the future (al-sīn, *sa-*), and the final degree of the future is the ultimate destiny of the world toward the Mercy that has no wrath after it, due to the lifting of obligation (al-taklīf) and the fulfillment of limits (al-ḥudūd). Since the address uses the pronoun of the addressee (لَكُمْ), and we know from the Divine Generosity (al-karam al-ilāhī) that He always prefers the side of the blessed (al-su‘adā’) and the side of Mercy over the opposite, for this reason, what the people of wretchedness (ahl al-shaqā’) suffer is called *‘adhāb* (punishment/torment), because the blessed find the pains of the wretched sweet (yasta‘dhibūn) out of preference for the Divine Presence (al-janāb al-Ḥaqq) when they associated partners with Him. Thus, they find bliss in the causes of pain. So the Real named that *‘adhāb* (torment) out of preference for them when they preferred Him. Therefore, the letter of address (ḥarf al-khiṭāb) was used, and the *lām* was opened, so that it might be known by the instrument of address that they are a specific people, because the pronoun of the absent (ḍamīr al-ghā’ib) is not missing from the world. Thus, He must have people [who are absent], like His saying concerning the blessed: <<لَهُمْ جَنَّاتٍ تَجْرِي>> (For them are Gardens beneath which rivers flow), where He used the pronoun of the absent, so they are absent from these addressees. The opening of the *lām* is an opening of mercy, which the contextual clues (qarā’in al-aḥwāl) grant.\n\nThis instrument has degrees by which the Real deals with His servants, such as His saying: <<وَإِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ>> (And indeed, they are with Us among the chosen, the best), and His saying: <<ما كانَ الله لِيَذَرَ الْمُؤْمِنِينَ عَلى‏ ما أَنْتُمْ عَلَيْهِ>> (Allah would not leave the believers upon the state in which you are), and <<وما كانَ الله لِيُضِيعَ إِيمانَكُمْ>> (Nor would Allah let your faith be lost), and <<وَسَخَّرَ لَكُمْ ما في السَّماواتِ وما في الْأَرْضِ>> (And He subjected to you whatever is in the heavens and whatever is in the earth), and <<وَخَلَقَ لَكُمْ ما في الْأَرْضِ>> (And He created for you whatever is on the earth), and <<وَلَهُ ما في السَّماواتِ وما في الْأَرْضِ وما بَيْنَهُما وما تَحْتَ الثَّرى‏>> (And to Him belongs whatever is in the heavens and whatever is in the earth and what is between them and what is beneath the moist earth). Thus, it is for Him and for us. Despite this, proper conduct (al-adab) is incumbent upon us. Through proper conduct, the people of authority become companions without familiarity (inbisāṭ), because witnessing (al-shuhūd) and familiarity do not combine. One of them said: \"Sit upon the carpet (al-bisāṭ), but beware of familiarity (al-inbisāṭ).\"\n\nI have worshipped Him by a command that is not fitting for me, and I do not worship Him whom I describe by His image.\nFor He said this—I did not say it—and the form of my state is none other than His form.\n\nFor the lowliest of the low (al-dūn al-adwan), if an attribute not necessitated by his station is attributed to him, he recoils from it because it is a satire against him, just as the noble recoils from being described with less than what his nobility deserves.\n\n(A Connection) [The Difference Between the Saint (al-Walī) and the Prophet (al-Nabī)]\n\nAs for those among our companions who said—and to which Imam Abū Ḥāmid al-Ghazālī and others subscribed—that the difference between the saint (al-walī) and the prophet (al-nabī) is the descent of the Angel (al-malak), such that the saint is inspired (mulham) while the prophet has the Angel descend upon him, even though the prophet is also inspired in some matters, being a synthesis of sainthood (al-wilāya) and prophecy (al-nubūwa)—this is an error in our view on the part of those who hold it, and evidence of their lack of spiritual taste (dhawq). The difference lies only in *what* the Angel brings down, not in the descent of the Angel itself. What the Angel brings down upon the Messenger (al-rasūl) and the Prophet is different from what the Angel brings down upon the following saint (al-walī al-tābi‘). For the Angel may descend upon the following saint, through his following, to give him understanding of what the Prophet brought, which this saint had not realized through knowledge, even if he is later in time—meaning, later than the time of the Prophet’s existence. The Angel may descend upon him to define the soundness or weakness of what the Prophet brought, concerning matters that have been fabricated against him, or which were mistakenly thought to be sound from him, or which were abandoned due to the weakness of the narrator while being sound in reality. The Angel may also descend upon him with glad tidings (al-bushrā) from Allah that he is among the people of felicity (ahl al-sa‘āda) and triumph, and with security (al-amān)—all of this in the life of this world. For Allah (Mighty and Majestic) says: <<لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا>> (For them are glad tidings in the life of this world). And He said concerning the people of uprightness (ahl al-istiqāma) who affirm the Lordship of Allah, that the angels descend upon them. The Exalted said: <<إِنَّ الَّذِينَ قالُوا رَبُّنَا الله ثُمَّ اسْتَقامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ أَلَّا تَخافُوا ولا تَحْزَنُوا وأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ نَحْنُ أَوْلِياؤُكُمْ في الْحَياةِ الدُّنْيا>> (Indeed, those who say, \"Our Lord is Allah,\" and then remain upright, the angels will descend upon them, [saying], \"Do not fear and do not grieve, but receive good tidings of the Paradise which you were promised. We are your protecting friends [awliyā’ukum] in the life of this world). Among the friends of Allah (awliyā’ Allāh) are those who have from Allah the spiritual taste (dhawq) of the descent (al-inzāl) in the revelation (al-tanzīl).\n\nThe error that occurred to those who hold the contrary view arose only from their belief in themselves that they had encompassed all paths and stations (al-maqāmāt) through their spiritual journeying, and that no station remained without them having a taste (dhawq) of it. Since they did not see an Angel descend upon them, they believed that this was exclusive to the Prophet. Their spiritual taste is sound, but their judgment is false. They hold that if one of them brings an addition [to knowledge], it is accepted from him because he is a trustworthy person of spiritual taste; they have no disparagement or criticism, and they do not transgress their own taste. It is from this point that the error occurred. Had the statement concerning the descent of the Angel upon the saint reached them from those who preceded them, or those who were contemporary with them among the People of Allah (ahl Allāh), they would have accepted it and not rejected it. We have seen in events that a group of predecessors did not affirm a certain matter, but when they heard it from us, they accepted it and did not deny it, due to the removal of suspicion concerning their peers and likes. If one of the People of Allah, who are the people of allusions (ahl al-ishārāt)—those who call out from the head of distance—were to say: \"You have stated that there is no reality (ḥaqīqa) or proportion (nisba) in the world except that it originates from a Divine proportion, and among the proportions of the world is need (al-iftiqār). Abū Yazīd, who is one of the people of Unveiling (al-kashf) and Existence (al-wujūd), said that Allah told him in one of his witnessings with Him: 'Draw near to Me with what is not Mine: abasement (al-dhilla) and need (al-iftiqār).'\"\n\n[That the Real (Exalted is He) possesses Mercy, Pardon, Generosity, and Forgiveness]\n\nKnow, O seeker of benefit, that the Real (Exalted is He) possesses Mercy (al-raḥma), Pardon (al-‘afw), Generosity (al-karam), and Forgiveness (al-maghfira). These are among His Beautiful Names (al-asmā’ al-ḥusnā), and they are truly His (Exalted is He). Likewise, He possesses Retribution (al-intiqām) and Severe Punishment (al-baṭsh al-shadīd). He (Glorified is He) is the Merciful, the Pardoner, the Generous, the Forgiving, the Possessor of Retribution. It is impossible for the effects of these Names to be *in* Him, or for Him to be a locus for their effects. For Merciful toward whom? Pardoner of whom? Generous toward whom? Forgiving of whom? Possessor of Retribution against whom? One must say that Allah the Creator seeks the created, and the created seeks the Creator. The attribute of the seeker is known, and the attained does not negate. Thus, the world is necessary because the Divine Realities (al-ḥaqā’iq al-ilāhiyya) seek it. We have explained to you that the intelligibility of His being an Essence is not the intelligibility of His being a God (Ilāh). Thus, the rank (al-martaba) doubled. There is nothing in objective existence (al-wujūd al-‘aynī) except the essence (al-‘ayn). He, from the perspective of His Essence, is independent of the worlds (ghanī ‘an al-‘ālamīn). But from the perspective of the Beautiful Names, which seek the world due to its contingency (imkān) so that their effects may appear in it, He seeks the existence of the world. If the world were already existent, He would not seek its existence. The Names are like a family (al-‘ā’ila) to Him, and the master of the family strives for his dependents. The creation (al-khalq) is the more distant dependent, and the Names are the nearer family. The world asked Him for existence due to its contingency, and the Names asked Him for existence for the manifestation of their effects. And one only asks for what does not yet exist. Therefore, the existence of the world is necessary. The Book (al-kitāb) is the ruler, Knowledge (al-‘ilm) is prior, and the Will (al-mashī’a) is the confirmer. It is impossible for it not to occur.\n\nThe charge of disbelief (al-takfīr) fell upon the faction that said: <<إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ>> (Indeed, Allah is poor, and we are rich)—taken as a whole. For they are not rich (independent) of Allah, nor is the Real delayed in bringing them into existence or in showering blessings upon them, which is a favor and grace from Him, due to the judgment of a prior Book. Allah the Exalted said: <<لَوْ لا كِتابٌ من الله سَبَقَ لَمَسَّكُمْ فِيما أَخَذْتُمْ عَذابٌ>> (Had it not been for a decree [kitāb] from Allah that preceded, you would have been touched by a great punishment for what you took). Thus, the judgment belongs to the Book. The proportion of the Book is not the proportion of the Essence (al-dhāt). The determination of the execution of the judgment upon whom it is executed belongs to the Book, like the custodian (al-sādin) and the disposer by the judgment of the compulsion of the rank (jabr al-martaba). This is what the Realities (al-ḥaqā’iq) grant by themselves, and they do not change. If the Realities were to change, the order (al-niẓām) would be corrupted, and there would be no knowledge (‘ilm) at all, nor Real (Ḥaqq), nor creation (khalq).\n\nIf the rational person (al-‘āqil) were to look at the wisdom of the Divine address in His saying: <<سَنَكْتُبُ ما قالُوا>> (We shall record what they said), and took it from His saying: <<كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ>> (Your Lord has decreed [kataba] upon Himself Mercy)—meaning, He made it incumbent upon Himself, because there is no obligator except Him (Exalted is He)—He said: We shall make incumbent what they said, concerning what returns as harm upon them. And He said at the end of the verse: <<وَنَقُولُ ذُوقُوا عَذابَ الْحَرِيقِ>> (And We shall say, \"Taste the punishment of the Burning Fire\") as a penalty for their saying. For this reason, the confirmation of their disbelief was based on the totality [of their statement], for they are not rich. This is the spirit (rūḥ) of this verse.\n\nAs for your argument concerning what He said to Abū Yazīd, that is also the essence of the totality. He did not say abasement (al-dhilla) alone, but said abasement *and* need (al-dhilla wa-l-iftiqār). The proportion of the totality is not the proportion of the individuals. Were it not for the contingent (al-mumkin), no effect of the Divine Names would appear. The Name is the Named itself, especially the Divine Names. Existence (al-wujūd) is the seeker and the sought, and the object of the seeking is non-existence (al-‘adam)—either the annihilation of an existent or the creation of a non-existent. Allah the Exalted said: <<الله لا إِلهَ إِلَّا هُوَ>> (Allah, there is no god except Him). He only negated Divinity (al-ulūhiyya) from being an attribute of more than one. Thus, the Divine Names, or the rank which is the rank of the Named as God (Ilāh), have the disposal (al-taṣrīf) and the judgment over those described by them. By them He disposes, and for them He disposes, yet He is independent of the worlds (ghanī ‘an al-‘ālamīn) in the state of His disposal, which is necessary. Look at how marvelous the matter is in itself. From here, the saying of Abū Sa‘īd al-Kharrāz is understood: that Allah is only known by combining the two opposites (al-ḍiddayn). Then he recited: <<هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ>> (He is the First and the Last, the Manifest and the Hidden).\n\nAs for the saying of the Jews concerning stinginess: <<يَدُ الله مَغْلُولَةٌ>> (The Hand of Allah is chained), He said concerning them: <<غُلَّتْ أَيْدِيهِمْ ولُعِنُوا بِما قالُوا>> (May their hands be chained, and may they be cursed for what they said). That is, they were distanced from the attribute of Divine Generosity (al-karam al-ilāhī). Their sayings are part of their actions, so their hands were chained, and the stinginess they attributed to Allah occurred through them. Thus, they witnessed nothing from Allah except what they said. Then He made them taste the flavor of what they brought forth. After that, Allah refuted them concerning wealth, for He extended Generosity (al-karam) upon them through the Mercy that <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompassed everything), so that He might make them know that they were liars. This is the most severe torment for them and the most intense bliss. For when He extends bounty and generosity upon them, they realize their ignorance and imagine it. Their souls are tormented by the visualization of the state of ignorance concerning Allah that they were upon, yet they are blessed by the removal of that and their attainment of knowledge. They knew that their ignorance led them to lie against Allah the Exalted: <<بَلْ يَداهُ مَبْسُوطَتانِ يُنْفِقُ كَيْفَ يَشاءُ>> (Rather, His hands are outstretched; He spends as He wills). Thus, the judgment belongs to the Will (al-mashī’a). Understand this. His Will is not other than His Essence. His Names are His Essence, and their judgments are His judgment. The world only appeared through the powers (al-quwā) upon which they rest.\n\nLook to Him, and you will be Him, and do not transgress your limit.\nFor everything that is in Him is only with you.\nWhoever estimates Allah with His true estimation, the reality of Existence (al-wujūd) is manifested from him.\nEvery matter you see is an essence, and whoever has knowledge of it, it is from Him.\nSo its essence is the essence of whom you see, and thus Existence has no quiddity (kunh).\n\nIf you say \"Allah,\" it is the totality of all Divine Names (al-asmā’ al-ilāhiyya). It is impossible to speak of Him in absolute terms; the states must qualify Him. If words qualify Him, it is by way of dependence on the states. Whatever is attributed to Him, look at which Name that attribution deserves. The Name sought from Allah in that matter is only the Name specialized by that attribution and the Divine Reality (al-ḥaqīqa al-ilāhiyya) that seeks it. Do not transgress it. Whoever is in this state has fulfilled the right of Allah and estimated His estimation in a general sense, for His estimation cannot be estimated in detail, because the increase in the knowledge of Allah (al-‘ilm bi-llāh) never ceases, neither in this world nor the Hereafter. The matter in this regard is infinite.\n\nDo you not see that Allah the Exalted sent Moses (peace be upon him) with a message to Pharaoh, part of which was that if Pharaoh asked him: <<فَما بالُ الْقُرُونِ الْأُولى‏>> (Then what is the state of the former generations?), he should say: <<عِلْمُها عِنْدَ رَبِّي في كِتابٍ لا يَضِلُّ رَبِّي ولا يَنْسى‏>> (The knowledge thereof is with my Lord in a Book. My Lord neither errs [yaḍillu] nor forgets [yansā]). This means what He made incumbent upon Himself concerning that. He only wrote it in the Preserved Tablet (al-Lawḥ al-Maḥfūẓ) so that he whose nature is not to know except by being informed might know, not so that He might remember what He made incumbent upon Himself concerning future times over long periods. For He (Glorified is He) is the Lord who neither errs (yaḍillu) nor forgets (yansā)—the Lord from whom I came to call you to His worship.\n\nThe Exalted said concerning Himself: <<نَسُوا الله فَنَسِيَهُمْ>> (They forgot Allah, so He forgot them). They did not forget Him absolutely, so He does not forget them absolutely. Rather, He forgets them concerning that in which they forgot Him, which, had they known it, Mercy (al-raḥma) from the Merciful (al-Raḥīm) concerning that would have reached them. When they forgot it, the Merciful forgot them, since the Divine Name that called for the action they were engaged in took charge of them. When the balance of that Name's justice was fulfilled, the forgetting ceased, for it must cease upon the removal of the veil (kashf al-ghiṭā’) at death in this world. No one among the people of obligation (ahl al-taklīf) dies except as a believer, based on certain knowledge and verified witnessing (al-yaqīn al-muḥaqqaq), without doubt or uncertainty, specifically concerning the knowledge of Allah and faith in Him. This is what is universal. The only question remaining is whether that faith will benefit them or not. As for the lifting of punishment from them, no, except for those whom Allah singles out, such as His saying: <<فَلَمْ يَكُ يَنْفَعُهُمْ إِيمانُهُمْ لَمَّا رَأَوْا بَأْسَنا>> (Their faith was not to benefit them when they saw Our punishment). Then He said—and this is our point of evidence—<<سُنَّتَ الله الَّتِي قَدْ خَلَتْ في عِبادِهِ>> (This is the way [sunna] of Allah which has passed concerning His servants). As for the exception, it is His saying: <<إِلَّا قَوْمَ يُونُسَ لَمَّا آمَنُوا كَشَفْنا عَنْهُمْ عَذابَ الْخِزْيِ في الْحَياةِ الدُّنْيا ومَتَّعْناهُمْ إِلى‏ حِينٍ>> (Except the people of Jonah; when they believed, We removed from them the punishment of disgrace in the life of this world and gave them enjoyment for a time). There is no judgment over Allah concerning His creation. As for the benefit of that faith in the end, your Lord is <<فَعَّالٌ لِما يُرِيدُ>> (Doer of what He intends). And He (Exalted is He) says: <<إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً>> (Indeed, Allah forgives all sins). This is His word, His covenant to us in His Book and upon the tongues of His Messengers (peace be upon them).\n\nThe Real has appeared in what a Messenger brought to my heart from the Highest Assembly (al-Mala’ al-A‘lā).\nHe informed me of the matter from its half, so I do not say \"more likely\" or \"more worthy\" concerning matters.\nRather, the matter in it is one and nothing else: from a world that perishes, and from a world that perishes.\nAnd that is a Criterion (furqān) whose proof is made clear, and it is not a Qur’an recited upon our heart.\nEven though the Word of Allah, in every state, is dictated to me when I come to His Presence (ḥaḍra).\nAnd my creation is wondrous, constantly renewed, and what has passed of it neither ceases nor perishes.\nThe judgment of the Wise Real (al-Ḥakīm al-Ḥaqq) is manifest in creation. Glory be to Him who blinds, and Glory be to Him who clarifies.\nHe has been generous to me with His grace through His witnessing (shuhūd), and He has singled me out with the sweetest source of it.\n\nWhoever fears Allah, He grants him a Criterion (furqān), even though it is in the essence of the Glorious Qur’an (al-Qur’ān al-‘Azīz), which is the gathering (al-jam‘)—just as you gather water in a basin when you collect it. Not every criterion is a Qur’an, but every Qur’an is a criterion.\n\nThe essence of Gathering (al-jam‘) is the essence of Separation (al-farq). So look with your eye at the union in separation.\nThe like is not the essence of the like, so judge concerning it with separation and with meeting.\nAnd if we wish, when you reflect upon it, we judge by marriage (al-nikāḥ) and by divorce (al-ṭalāq).\nWere it not for the Real, there would be no coherence (ittisāq). So the leg of the Real is wrapped around my leg.\nWhen we stray from Him, He calls me, so that I may know that in the Hereafter is my destination.\nTo Him, in bodies made of plants. If we are good, then musk in caskets.\n\n<<فَرِيقٌ في الْجَنَّةِ وفَرِيقٌ في السَّعِيرِ>> (A party in Paradise and a party in the Blazing Fire). The one who doubled himself is distinguished from the one who doubled him. Each party is singled out by its oneness (aḥadiyya) and its collectivity (jam‘iyya). Among them are those who find intimacy (ta’annasa) in their singularity through their oneness and individuality, and among them are those who feel alienation (istaḥwasha) in their singularity through their oneness and individuality. That, according to the Gnostics (al-‘ārifīn), is the alienation of the Veil (waḥshat al-ḥijāb).\n\nWhat bliss is there that Time (al-dahr) does not disturb? And to Allah belongs the creation (al-khalq) and the command (al-amr) in what I have said.\nWere it not for the Existence of the Real (wujūd al-Ḥaqq), His good would not be; and were it not for my existence, evil (al-sharr) would not be seen among creatures.\nI am not other than Him, if my reality were revealed, but He concealed, so my affair is a veil for Him.\nWhoever realizes my image, for him, the pearl and the pearl (al-durr wa-l-durr) shine forth from my genesis.\nA pearl, not stones, competes with my genesis, and for knowledge, the pearl grants what it grants from them.\nIf you possess intellect (‘aql), its judgment will be clear; and if you possess the eye (‘ayn), the veil (al-sitr) has been lifted.\nIf you wish, point to it as sealed nectar (raḥīqan makhtūman); and if you do not wish wine (khamr), then your drink is beer (al-mizr).\nGlory be to Him who revives the heart (al-fu’ād) with His remembrance (dhikr), and were there no remembrance, reflection (al-fikr) would stand in its place.\n\n[The Fixity of Knowledge upon its Image]\n\nKnow, may Allah support you with a spirit from Him, that I have not seen the Fixity of Knowledge (thubūt al-‘ilm) upon its image, unchanging, except in this station (manzil). It bequeathed to me the tranquility (al-ṭuma’nīna) that what I know will not vanish, and that doubts (al-shubah) will not shake it. If a doubt comes to one who witnesses this matter in this station, he sees it as a doubt that cannot change its image for him. This is unlike one who does not possess this station, for he is shaken, and that shaking leads him to examine what he had previously determined he knew. He does not know whether the first knowledge was a doubt, or whether the witnessing (al-shuhūd) is a doubt, or whether both matters are doubts, so he becomes bewildered. This is because he is not upon clear insight (baṣīra) in his knowledge of matters, for he generated them by his reflection (fikr). When matters come by themselves, not by your making or creation, they grant you their realities (ḥaqā’iq), and you know them as they truly are.\n\nMany verses from the Glorious Qur’an (al-Qur’ān al-‘Azīz) relate to this station. If we were to elaborate on them, the discussion would be lengthy. We shall mention some, but not all, and I will not explain them, but only point them out for sound intellects and penetrating insights. Among them are: <<ولِلَّهِ مُلْكُ السَّماواتِ والْأَرْضِ>> (And to Allah belongs the dominion of the heavens and the earth). And: <<لَهُ الْمُلْكُ ولَهُ الْحَمْدُ وهُوَ عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ>> (To Him belongs the dominion, and to Him belongs the praise, and He is over all things competent) in Sūrat al-Taghābun. And: <<وقالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِي ولَكَ>> (And the wife of Pharaoh said, \"[He will be] a comfort of the eye for me and for you\"). And: <<وَيْلٌ لِلْمُطَفِّفِينَ>> (Woe to those who give less than due). And: <<فَوَيْلٌ لِلْمُصَلِّينَ>> (So woe to those who pray). And: <<فَوَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ>> (So woe, that Day, to the deniers), wherever it occurs. And: <<وتَاللَّهِ لَأَكِيدَنَّ أَصْنامَكُمْ بَعْدَ أَنْ تُوَلُّوا مُدْبِرِينَ>> (And by Allah, I will surely plot against your idols after you have turned your backs and gone away). And: <<ولَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله>> (And if you asked them who created them, they would surely say, \"Allah\")—a preparation for their felicity. And: <<لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ>> (To Allah belongs the command before and after). This verse begins [the chapter] so that it may be known what the Command is upon, in relation to Him. And: <<إِنَّ رَبَّهُمْ بِهِمْ يَوْمَئِذٍ لَخَبِيرٌ>> (Indeed, their Lord is, concerning them, that Day, All-Aware [khabīr]). He sufficed with awareness (khibra) instead of knowledge (‘ilm), since every awareness is knowledge. And: <<ولَوْ شاءَ الله لَجَمَعَهُمْ عَلَى الْهُدى‏>> (And if Allah had willed, He could have gathered them upon guidance). He used the particle of refusal for refusal (ḥarf imtinā‘ li-mtinā‘). And: <<ولَوْ لا أَنْ يَكُونَ النَّاسُ أُمَّةً واحِدَةً لَجَعَلْنا لِمَنْ يَكْفُرُ بِالرَّحْمنِ لِبُيُوتِهِمْ سُقُفاً من فِضَّةٍ ومَعارِجَ عَلَيْها يَظْهَرُونَ>> (And were it not that the people would become one community [in disbelief], We would have made for those who disbelieve in the Most Merciful, for their houses, roofs of silver and stairways upon which they ascend). And: <<إِنَّ السَّاعَةَ آتِيَةٌ أَكادُ أُخْفِيها لِتُجْزى‏ كُلُّ نَفْسٍ بِما تَسْعى‏>> (Indeed, the Hour is coming—I almost conceal it—so that every soul may be recompensed for what it strives). And: <<وَكَذلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِيَقُولُوا أَ هؤُلاءِ من الله عَلَيْهِمْ من بَيْنِنا>> (And thus We have tried some of them by others, so that they might say, \"Are these the ones whom Allah has favored among us?\"). And: <<ما كانَ الله لِيَذَرَ الْمُؤْمِنِينَ عَلى‏ ما أَنْتُمْ عَلَيْهِ>> (Allah would not leave the believers upon the state in which you are), and the rest of the verse. And: <<ثُمَّ لْيَقْضُوا تَفَثَهُمْ ولْيُوفُوا نُذُورَهُمْ ولْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ>> (Then let them end their untidiness and fulfill their vows and perform circumambulation around the Ancient House). And: <<لَتُؤْمِنُنَّ به ولَتَنْصُرُنَّهُ>> (You will surely believe in him and you will surely support him). And: <<وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ>> (And say, \"The truth is from your Lord,\" so whoever wills—let him believe; and whoever wills—let him disbelieve), and the rest of the verse. And: <<وإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ>> (And indeed, he is severe in the love of wealth [al-khayr]). And: <<يَوْمَئِذٍ تُحَدِّثُ أَخْبارَها بِأَنَّ رَبَّكَ أَوْحى‏ لَها>> (That Day, it will report its news because your Lord has inspired it). And: <<أَ فَمَنْ يَمْشِي مُكِبًّا عَلى‏ وَجْهِهِ أَهْدى‏>> (Then is he who walks headlong upon his face more rightly guided?)—and this is he who falls upon his face into the Fire from the Bridge (al-Ṣirāṭ), yet he is one of the monotheists (al-muwaḥḥidīn). And: <<وهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ من بَعْدِ ما قَنَطُوا ويَنْشُرُ رَحْمَتَهُ>> (And He is the one who sends down the rain after they have despaired and spreads His Mercy). And: <<إِنَّ في ذلِكَ لَعِبْرَةً لِأُولِي الْأَبْصارِ>> (Indeed, in that is a lesson [‘ibra] for those of insight)—meaning, a wonder. And: <<فَمَنْ يَكْفُرْ بَعْدُ مِنْكُمْ فَإِنِّي أُعَذِّبُهُ عَذاباً لا أُعَذِّبُهُ أَحَداً من الْعالَمِينَ>> (So whoever disbelieves after that among you, I will surely punish him with a punishment that I will not punish anyone among the worlds). And: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are).\n\nReflect upon the stations of these verses and their likes. From here, you know the power of the *alif* and *lām* (ال) which denote definition, specification, and genus, and the attachment of *lām-alif* (لا) to the letters. The letters are of two types: letters of the alphabet (ḥurūf hijā’), which are the original letters, and letters of meaning (ḥurūf ma‘ānī). Both are in the written form by convention and in the utterance by nature in the human. All of it is from you and in you. There is no matter outside of you. So do not hope to know yourself by other than yourself, for there is nothing there. You are the proof for yourself and for Him, and there is no one who is a proof for you.\n\nWho is it you hope for besides yourself, when you are alone in both states?\nLook to Him by Him, and you will be Him, for everything that is in Him is with you.\n\nIn this station are sciences: the science of the judgments that causes (al-asbāb) have in the effects (al-musabbabāt), and the detailed explanation of the causes, and whether the entire world is causes for one another, and whether some causes are non-existent (adam) yet are a means (sabab), such as proportions (al-nisab)—like the connections of meanings that necessitate judgments by their connection. In it is the science of what is established for Allah of judgments, rationally and legally. In it is the science of the benefit of news (al-akhbār) in the intelligible object of information (al-mukhayyar al-ma‘qūl), and which news provides certain knowledge, which provides conjecture (ẓann) or dominant conjecture (ghalabat ẓann), which news provides bewilderment (ḥayra), and which news impugns theoretical proofs (al-adilla al-naẓariyya) by impugning knowledge.\n\nIn it is the science of whether the creation being the dependents of Allah (iyāl Allāh) means the same as: <<يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله>> (O mankind, you are the needy [al-fuqarā’] toward Allah). And in what respect is the poverty (al-faqr) when they are existent and know from the Real that they will not cease to exist after their existence? Rather, it is a revolution of states upon them: a state that vanishes and a state that comes. The vanishing state grants a judgment by its vanishing, and the coming state grants a judgment by its coming. The entity (al-‘ayn) upon which the two judgments are passed is one, like the standing person who sits. Sitting is coming, and standing is vanishing. The judgment of the vanishing of standing is that he is not standing, which is the essence of the judgment of sitting. Sitting adds judgments to him that were not understood from the vanishing of standing, which he has now attained: that he is neither reclining, nor bowing, nor prostrating, nor lying prone.\n\nIn it is the science of the wisdom of questioning the knowledgeable person about what he knows. In it is the science of why what the sight perceives of the transformation of the single essence (al-‘ayn al-wāḥida) into images, in the view of the observer, returns to: Is it in itself as the sight perceives it, or is it as it is in itself, its essence having not changed? This returns to what is seen of the essences (al-a‘yān) and judged to be essences: Did they multiply by accidents (‘arāḍ) or by substances (jawāhir)? For the images constantly differ in perception. Every object seen by the eye among bodies is a body. Corporeality (al-jismīyya) is a general judgment, and we see different images in it, some of which vanish quickly, and some slowly in perception. The body is a body; it has not changed. The body is the only thing described by what appeared. Likewise are the spiritual images (al-ṣuwar al-rūḥāniyya) and the Divine Theophany (al-tajallī al-ilāhī). This is a science involving a great difficulty, and escaping it through theoretical reflection (al-naẓar al-fikrī) is extremely hard.\n\nIn it is the science of the conditions that the deputy (al-nā’ib) may stipulate upon the one who appointed him (al-mustakhlaf), despite the deputy's knowledge that he is compelled (maqhūr) in his appointment. Does his stipulation indicate his ignorance of the one who appointed him, or his forgetfulness, so that he reminds him, or does he know his interests better than the one who appointed him? In this stipulation, terrifying matters open up that impugn [the appointment]. Or does the deputy know that the one who appointed him wants him to ask him concerning what he stipulated, so that He may show him his need (faqr) for Him through spiritual taste (dhawq)? For if the deputy had independence (al-istiqlāl) concerning what he requested in his condition, he would not have stipulated it.\n\nIn it is the science of the deputy offering a bribe (al-rishā’) to the one who appointed him, and what kind of bribe is acceptable and what is not. In it is the science of the appointer answering the deputy in everything he asks concerning his interests. In it is the science that criticizing the employed (al-mustakhdamīn) is a disparagement of the one who employed them. This is a very dangerous science. For this reason, criticism of kings and caliphs is forbidden, and we are informed that their hearts are in the Hand of Allah; if He wills, He contracts them away from us, and if He wills, He inclines them toward us. We are commanded to pray for them. The occurrence of benefit through them for the general populace is greater than their tyranny (jawr). What is the wisdom of their tyranny, despite their being truly the deputies of Allah over His creation, whether they are disbelievers or believers, just or tyrannical? This does not remove the designation of deputyship (al-niyāba) from them. If the deputy is tyrannical, is he dismissed from the deputyship only in that specific act of tyranny, or is he dismissed from the deputyship absolutely, and then the Real renews another, renewed deputyship for him?\n\nIn it is the science of counting blessings (al-ni‘am) by the Bestower upon the recipient: Is this a disparagement? Or is it a definition so that the recipient may know the measure of that blessing, for which he is required to give thanks? Or is it a punishment for something that occurred from them? Or is it permissible to include all these aspects together? In it is the science of gentleness in teaching in some situations, and harshness in others. In it is the science of where you came from and where you are going. Is there truly a return (rujū‘), or is it an eternal journey (sulūk abadan qadam) with no return? And to what Divine proportion does the return of the intelligible and the sensible in the world relate? Is the Real described by return in the way we described return, or not? For the Realities (al-ḥaqā’iq) refuse that there be a return. In it is the science of the difference between describing the speaking souls (al-nufūs al-nāṭiqa) with intellects (‘uqūl), prohibitions (nahy), judgments (aḥkām), hearts (albāb), and similar titles—to what does this return?\n\nIn it is the science of the wisdom of establishing a proof (dalīl) for one who does not know that it is a proof, while knowing that he is knowledgeable in this attribute. Is he himself intended by that proof, or is it someone else, so that he becomes a transmitter (nāqil) in it, and thus benefits and accepts it from those to whom the transmission of this person who did not know it was a proof reaches? This happens often, and it is the saying of the Prophet (peace and blessings be upon him): \"Perhaps the carrier of jurisprudence (fiqh) is not a jurist (faqīh).\" If he carries it and transmits it to a jurist, that jurist accepts it and benefits from it with knowledge he did not possess, while the transmitter has no knowledge of any of that.\n\nIn it is the science of naming a thing by the name of another thing if it is adjacent to it or if it is a cause of it. In it is the science of why the Lawgiver commanded the killing of the sorcerer (al-sāḥir), and why he was named a disbeliever (kāfir). Since Pharaoh knew the truthfulness of Moses (peace be upon him) and concealed faith in his soul, which he manifested when he drowned upon seeing the punishment (al-ba’s), was the killing of the sorcerers who believed due to their being sorcerers, so that their killing was legally justified in the inner reality (bāṭin al-amr), and due to their faith in the outer reality (ẓāhir al-amr)? If the sorcerer is killed, is that killing an expiation for him and a recompense for his sorcery, such that no claim remains against him concerning that sorcery in the Hereafter from the Real (Glorified and Exalted is He), or is there no claim against him from Allah?\n\nIn it is the science of the preference (tafāḍul) of those brought near (al-muqarrabīn) to Allah: by what are some preferred over others? In it is the science of the saying of the Prophet (peace and blessings be upon him) concerning the affliction of the believer with calamities and misfortunes (al-razāyā wa-l-maṣā’ib): that there is good for him in all of that. Why are the People of Allah (ahl Allāh) in this world afflicted with greater tribulation than others? And to what does the necessity of that return in their case, as opposed to other believing people?\n\nIn it is the science of why souls are naturally inclined to love wealth (al-māl), especially gold: Is it because of its attainment of the degree of mineral perfection (al-kamāl al-ma‘danī), leading to a correspondence between the two perfect ones? Or is it because it fulfills their needs, so they are poor toward it for reaching their goals? And the saying of Jesus (peace be upon him): \"The heart of every person is where his wealth is, so place your wealth in heaven, and your hearts will be in heaven.\" Whoever hoards his wealth has buried his heart in the earth of his nature, and thus will never enjoy the witnessing (mushāhada) of his Father, who is the Divine Spirit (al-Rūḥ al-Ilāhī). Such a person is the son of his mother, even if he has a father, but he is not attributed to him, like Jesus son of Mary (peace be upon him), who is attributed to his mother. Yet, Gabriel (peace be upon him) only bestowed him upon her when he appeared to her as <<بَشَراً سَوِيًّا>> (a man in all respects) and informed her. Despite this, he is only attributed to the physical location (al-buq‘a al-jismīyya), even though he revives the dead by virtue of his being from the gifts of the Trustworthy Spirit (al-Rūḥ al-Amīn).\n\nIn it is the science of the Divine Jealousy (الغيرة الإلهية) and against whom He is jealous concerning the specific Name by which He honored him. In it is the science of when the answer to the petitioner is determined concerning what he asked, if he asked. And if one asks by state (bi-l-ḥāl), is his answer determined by state, such that the answer corresponds to the question?\n\nIn it is the science of the abasement of him who elevates himself and the degradation of him who overreaches his measure. In it is the science of the benefit of admonition (al-maw‘iẓa), even if one disbelieves in it, for it has an effect in the inner being (al-bāṭin) of the listener, even if it does not appear; he senses it within himself. In it is the science of him who intended a deception (kayd) but encountered a truth (ḥaqq), which he considered a lie, but the outcome revealed that it was true in reality, though he has no knowledge of that. In it is the science of times (al-awqāt) and how they are dealt with, rationally and legally, according to sound reflection. In it is the science of defining noble character (makārim al-akhlāq). In it is the science that knowledge of what is not known to be known is [still] knowledge. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو چونسٹھ: دو رازوں کے مقام (منزل سرین) کی معرفت میں، جسے جاننے والا دنیا اور آخرت میں راحت پاتا ہے، اور غیرت الٰہیہ (الغیرۃ الإلهیۃ) کا بیان۔\n\nجب کوئی شخص اپنے علاوہ کسی اور کی طرف سے احکام کی تعمیل کرتا ہے،\nتو وہ نائب (المستناب) کہلاتا ہے۔\nاگر اسے نائب نہ بنایا گیا ہو اور پھر بھی وہ ان احکام کو بجا لائے،\nتو اس کے پاس کوئی شک یا تردد نہیں ہوتا۔\nاور اگر وہ کسی ایسے شخص کے خلاف دعا کرے جو حد سے تجاوز کرے،\nتو اس کی دعا قبول کی جاتی ہے۔\nوعدے کی سچائی اور اس میں اخلاص کی بنا پر،\nوہ جب چاہتا ہے نشانہ لگاتا ہے اور خود نشانہ نہیں بنتا۔\n\n[اللہ کے نزدیک ہر شے اس کے بندوں میں بالفعل (بالفعل) موجود ہے، اس کے پاس کوئی شے بالقوۃ (بالقوۃ) نہیں]\n\nیہ راحت کی بشارت الٰہیہ (البشري الإلهية) کا مقام ہے، جسے اللہ کی طرف سے اپنے صالح بندوں کے لیے قیامت تک اور قیامت میں بھی لازم کر دیا گیا ہے۔ کیونکہ اللہ کے نزدیک ہر شے اس کے بندوں میں بالفعل (بالفعل) موجود ہے، اس کے پاس کوئی شے بالقوۃ (بالقوۃ) نہیں ہے۔ چنانچہ، اس کی طرف وہ تعریفات الٰہیہ (التعریفات الإلهیۃ) وارد ہوئیں جو اللہ کے لیے اس میں افعال (الأفعال) اور احوال (الأحوال) کی صورت میں تھیں، تاکہ وہ اپنی عقل سے اس بات کو یاد کرے کہ اس نے اپنے رب کا شہود (الشہود) اس میں اس کی عدمی حالت میں بھی کیا تھا، جب وہ اس ثبوت (الثبوت) پر قائم تھا جس نے اس کے لیے تصرف الٰہی (التصرف إلهي) کو قبول کرنا واجب کر دیا تھا۔ اور اسی ثبوتی حالت کے ذریعے اس نے تکوین (التکوین) کے حق (الحق) کے حکم کی تعمیل کی۔ کیونکہ حکم صرف اسی پر وارد ہوتا ہے جو سننے کی صفت سے متصف ہو۔ پس قول الٰہی (القول الإلهي) ہمیشہ سے ہے اور سمع ثبوتی (السمع الثبوتی) ہمیشہ سے ہے، اور جو چیز نئی پیدا ہوئی وہ صرف سمع وجودی (السمع الوجودی) ہے جو سمع ثبوتی کی ایک شاخ ہے۔\n\nپس حال (الحال) عین سمع (عین السمع) پر منتقل ہوا، سمع منتقل نہیں ہوا۔ کیونکہ اعیان (الأعیان) ایک حال سے دوسرے حال میں نہیں پلٹتیں، بلکہ احوال (الأحوال) ان پر احکام کے طور پر لباس پہنتے ہیں، اور وہ انہیں پہن لیتی ہیں۔ چنانچہ، جو شخص علم نہیں رکھتا وہ یہ گمان کرتا ہے کہ عین (العین) منتقل ہو گئی ہے۔ پس احوال ہی اسماء الٰہیہ (الأسماء الإلهیۃ) کو طلب کرتے ہیں، نہ کہ اعیان طلب کی صفت سے موصوف ہوں۔ اور اعیان کے لیے اسماء پیدا ہوتے ہیں اور قلب (القلب) ان احوال کے احکام کے مطابق ہوتا ہے جن پر وہ پلٹتے ہیں۔ اگر احوال نہ ہوتے تو اعیان میں تمیز نہ ہو پاتی۔ کیونکہ وہاں ایک ہی عین (عین واحدۃ) ہے جو اپنی ذات کے ذریعے واجب الوجود (واجب الوجود) سے ممتاز ہوئی، جیسا کہ وہ اس کے ساتھ وجوب ثبوت (وجوب الثبوت) میں شریک ہوئی۔ پس ذات حق (الحق) کے لیے وجوب ثبوت اور وجود (الوجود) ہے، اور اس عین کے لیے وجوب ثبوت ہے۔ پس یہ احوال اس عین کے لیے ایسے ہی ہیں جیسے اسماء الٰہیہ ذات حق (الحق) کے لیے ہیں۔ جس طرح اسماء ایک ہی عین کے لیے ہیں اور مسمیٰ کو نہ تو متعدد کرتے ہیں اور نہ ہی کثیر، اسی طرح یہ احوال اس عین کو نہ تو متعدد کرتے ہیں اور نہ ہی کثیر، باوجود اس کے کہ اسماء اور احوال میں کثرت اور عدد کا تصور موجود ہے۔ اور اسی بنا پر اس عین کے بارے میں یہ کہنا درست ہوا کہ یہ صورت (الصورة) پر ہے، یعنی اس پر ہے جو امر الٰہی (الأمر الإلهي) ہے۔ پس اس عین کو وجود (الوجود) کے ذریعے کمال حاصل ہوا، جو ان احوال میں سے ہے جن پر یہ پلٹتی رہی۔ اس کمال میں سے جو کمی اس میں رکھی گئی، وہ صرف وجوب الوجود (وجوب الوجود) کے حکم کی نفی تھی تاکہ اس کے اور اللہ کے درمیان تمیز ہو سکے، کیونکہ یہ حکم ختم نہیں ہو سکتا اور نہ ہی اس کے لیے اس میں کوئی قدم رکھنا صحیح ہے۔ اور اس کے لیے ایک اور تمیز بھی ہے، اور وہ یہ کہ ذات حق (الحق) احوال میں پلٹتی ہے، احوال اس پر نہیں پلٹتے۔ کیونکہ یہ محال ہے کہ حال کا ذات حق (الحق) پر کوئی حکم ہو۔ بلکہ حکم تو ذات حق (الحق) کا ان احوال پر ہے۔ اسی لیے وہ ان میں پلٹتا ہے اور وہ اس پر نہیں پلٹتے: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (ہر دن وہ ایک نئی شان میں ہے)۔ کیونکہ اگر وہ اس پر پلٹتے تو اس کے لیے احکام لازم کر دیتے۔ اور عالم کی عین (عین العالم) ایسی نہیں ہے، احوال اس پر پلٹتے ہیں اور ان میں اپنے احکام ظاہر کرتے ہیں، اور ان کا اس پر پلٹانا اللہ کے ہاتھ میں ہے۔\n\nجہاں تک ذات حق (الحق) کا احوال میں پلٹنا ہے، وہ نزول (النزول)، استواء (الاستواء)، معیت (المعیۃ)، ہنسنے، خوش ہونے، راضی ہونے اور غضب کرنے سے معلوم ہوتا ہے۔ اور ہر وہ حال جس سے ذات حق (الحق) نے خود کو موصوف کیا ہے، وہ سبحانہ و تعالیٰ حکم کے ذریعے ان میں پلٹتا ہے۔ پس یہ ہمارے اور ذات حق (الحق) کے درمیان فرق ہے، اور یہ واضح ترین اور روشن ترین فرق ہے۔ چنانچہ احوال میں شرکت واقع ہوئی، جیسا کہ اسماء میں واقع ہوئی، کیونکہ اسماء احوال کے اسماء ہیں اور ان کا مسمیٰ (مسماها) عین (العین) ہے، جیسا کہ اس کے لیے اسماء ایک دوسرے نسبت سے ہیں اور ان کا مسمیٰ ذات حق (الحق) ہے۔ پس هُوَ السَّمِيعُ الْبَصِيرُ (وہ سننے والا، دیکھنے والا ہے)، العالم القدیر (جاننے والا، قدرت والا ہے)، اور تم بھی سننے والے، دیکھنے والے، جاننے والے، قدرت والے ہو۔ پس سمع (السمع)، بصر (البصر)، علم (العلم) اور قدرت (القدرۃ) کا حال ہمارے اور اس کے لیے دو مختلف نسبتوں سے ہے۔ کیونکہ وہ 'وہ' ہے اور ہم 'ہم' ہیں۔ ہمارے لیے آلات ہیں اور ہم اس کے لیے آلات ہیں۔ کیونکہ اللہ نے اپنے بندے کی زبان پر فرمایا: \"سمع الله لمن حمده\" (اللہ نے اس کی سن لی جس نے اس کی تعریف کی)، اور فرمایا: فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله (پس اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے)، اور (اے محمد!) وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ (اور جب تم نے پھینکا تو تم نے نہیں پھینکا بلکہ اللہ نے پھینکا)۔ اور آلہ رسول اللہ صلی اللہ علیہ وسلم تھے۔ پس ذات حق (الحق) کا احوال میں پلٹنا ان کے اعیان (أعیان) کو ظاہر کرنے کے لیے ہے، جیسے اعداد کی مراتب میں واحد کا پلٹنا ان کے اعیان کو ظاہر کرنے کے لیے ہے۔\n\nاور جان لو کہ اس مقام کو منزل سرین (منزل سرین) کا نام ایک عجیب راز کی وجہ سے دیا گیا ہے، اور وہ یہ ہے کہ ایک ہی شے کو اس کی اپنی ذات دوہرا کرتی ہے، نہ کہ کوئی اور، خواہ وہ محسوسات میں ہو یا معقولات میں۔ محسوسات میں تو آدم (علیہ السلام) کو ان کی اپنی ذات نے دوہرا کیا، جو ان کی بائیں چھوٹی پسلی سے حواء کی صورت میں نکلی۔ پس وہ اپنی عین میں ایک تھے، پھر ان کے ذریعے زوج بن گئے۔ اور وہ ان کی اپنی ذات کے سوا کچھ نہیں تھیں، جس کے بارے میں کہا گیا کہ وہ ایک ہیں۔ اور معقولات میں، الوہیت (الألوهية) اس کی ذات (ذاتہ) کے سوا کچھ نہیں ہے، لیکن الوہیت کا معقول (معقول الألوهة) اس کے ذات ہونے کے معقول کے خلاف ہے۔ پس الوہیت نے ذات حق (ذات الحق) کو دوہرا کیا، حالانکہ وہ اس کی عین (عینها) کے سوا کچھ نہیں ہے۔ پس جس طرح آدم سے اور ان کی ذات سے جو دوہرا ہوا، اس سے کثرت سے مرد اور عورتیں زوجین کی صورت پر پھیلائے گئے، اسی طرح ذات حق تعالیٰ سے اور اس کے عالم کا الٰہ ہونے سے ان دو معقولوں کی صورت پر پھیلایا گیا۔ پس عالم ایک مؤثر (مؤثر) اور ایک مؤثر فیہ (مؤثر فیہ) کی صورت پر نکلا تاکہ توالد (پیدائش) ہو، یعنی اس کے اجزاء کی توالد۔ کیونکہ الوہیت (الألوهية) ذات کے لیے ایک حکم ہے، جس میں اس نے عالم کو وجود دینے کا حکم دیا۔ پس جب اس نے عالم کو وجود دینے کے حکم کو ترجیح دی، تو عالم اس کی صورت میں ظاہر ہوا جس نے اسے وجود بخشا، ایک مؤثر اور مؤثر فیہ کے درمیان، جیسا کہ محسوسات میں ہوا۔ کیونکہ اللہ نے آدم اور حواء سے نہ زمین پیدا کی، نہ آسمان، نہ پہاڑ، اور نہ ہی ان کی نوع کے علاوہ کوئی چیز، بلکہ ان سے صرف ان کی جیسی صورت اور حکم میں چیزیں پیدا کیں۔\n\nوہ ذات جس کے ہونے سے وجود قائم ہوا،\nاس کا لفظ اس کے معنی کو پاکیزہ کرتا ہے۔\nمیں اس سے محبت کرتا ہوں اور اس کی قربت کو پسند کرتا ہوں،\nاور ہر اس شخص کو پسند کرتا ہوں جو اس سے محبت کرے۔\nلیلیٰ، لبنیٰ، رباب اور زینب،\nسب اس کے لیے میری محبت سے زندہ ہیں۔\nاگر میں مر جاؤں تو ہمارے مرنے سے اس کا وجود بھی مر جائے گا،\nکیونکہ ہمارا وجود اس کی عین (عین) ہے اور اس کے سوا ہے۔\nہم پر اور اس پر تعجب ہے، کیونکہ ہمارا وجود فرد (فرد) ہے، کوئی دوسرا نہیں،\nتو کس نے اسے دوہرا کیا؟\n\nاور چونکہ اصل ایک تھی اور اسے اس کی اپنی ذات کے سوا کسی نے دوہرا نہیں کیا، اور کثرت (الکثرۃ) صرف اس کی عین سے ظاہر ہوئی، اسی طرح عالم کی ہر شے میں اس کے لیے ایک نشانی ہے جو اس بات پر دلالت کرتی ہے کہ وہ واحد ہے۔ پس پورا عالم جسم (جسم) اور روح (روح) ہے، جن کے ذریعے نشأت الوجود (نشأة الوجود) قائم ہوئی۔ پس عالم ذات حق (الحق) کے لیے ایسا ہے جیسے جسم کے لیے روح۔ اور جس طرح روح کو صرف جسم سے جانا گیا، کیونکہ جب ہم نے اس میں غور کیا اور اس کی صورت کو دیکھا، باوجود اس کے کہ اس کے باقی رہنے کے باوجود اس سے وہ احکام زائل ہو جاتے ہیں جن کا ہم جسم اور اس کی صورت سے مشاہدہ کرتے تھے، جیسے محسوسات اور معانی کا ادراک، تو ہم نے جان لیا کہ اس ظاہر جسم کے پیچھے ایک اور معنی ہے جس نے اسے ادراکات کے احکام عطا کیے ہیں۔ پس ہم نے اس معنی کو اس جسم کی روح (روح) کا نام دیا۔ اسی طرح ہم نے یہ نہیں جانا کہ ہمارے لیے کوئی امر ہے جو ہمیں حرکت دیتا ہے، ہمیں ساکن کرتا ہے، اور ہم میں جو چاہتا ہے حکم کرتا ہے، یہاں تک کہ ہم نے اپنی جانوں میں غور کیا۔ پس جب ہم نے اپنی جانوں کو پہچانا تو ہم نے اپنے رب کو پہچانا، بالکل جوتے کے نعل کے برابر۔ اور اسی لیے وحی میں یہ خبر دی گئی:\n\nاس کے قول سے: \"جس نے اپنی جان کو پہچانا، اس نے اپنے رب کو پہچانا۔\"\n\nاور خبر منزل الٰہی (الخبر المنزل الإلهي) میں: سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ (ہم انہیں عنقریب اپنی نشانیاں آفاق میں اور ان کی جانوں میں دکھائیں گے، یہاں تک کہ ان پر ظاہر ہو جائے کہ وہی حق ہے)۔ پس عالم اللہ سے صرف اسی صورت پر ظاہر ہوا جس پر امر ہے۔ اور اصل میں کوئی شرف نہیں ہے کہ شرور (الشرور) کی نسبت کس کی طرف کی جائے، حالانکہ عالم خیر محض (الخیر المحض) کی گرفت میں ہے، اور وہ الوجود التام (الوجود التام) ہے۔ مگر چونکہ ممکن (الممکن) عدم (العدم) کی طرف نظر رکھتا تھا، اس لیے اسی قدر کی وجہ سے اس کی طرف شر کی نسبت کی جاتی ہے جو اس کی طرف منسوب ہوتا ہے۔ کیونکہ اس کی اپنی ذات سے وجوب الوجود لذاتہ (وجوب الوجود لذاتہ) کا کوئی حکم نہیں ہے۔ پس جب اسے شر لاحق ہوتا ہے تو وہ اسی طرف سے ہوتا ہے، اور وہ اس پر مستمر نہیں رہتا اور نہ ہی ثابت ہوتا ہے، کیونکہ وہ خیر محض اور وجود (الوجود) کی گرفت میں ہے۔\n\nپھر اللہ کی معرفت (المعرفۃ) میں جو علم رکھا گیا ہے، اس کی تکمیل میں یہ بھی شامل ہے کہ جسم کے روح میں معقول اور معلوم آثار ہوتے ہیں، جو اسے ذوق (الأذواق) کے علوم عطا کرتے ہیں، اور جو اس کے بغیر معلوم نہیں ہو سکتے۔ اور روح کے جسم میں محسوس آثار ہوتے ہیں جن کا ہر حیوان اپنی ذات سے مشاہدہ کرتا ہے۔ اسی طرح عالم کا ذات حق (الحق) کے ساتھ معاملہ ہے۔ اللہ کے لیے اس میں ظاہر آثار ہیں، اور وہ وہ احوال ہیں جن میں عالم پلٹتا ہے، اور یہ اس کے اسم الدھر (الدهر) کے حکم سے ہے۔ اور ذات حق (الحق) سبحانہ نے خبر دی کہ عالم کے لیے، جہاں تک اسے مکلف کیا گیا ہے، ایسے آثار ہیں کہ اگر وہ ہمیں ان سے آگاہ نہ کرتا تو ہم انہیں نہ جان پاتے۔ اور وہ یہ ہے کہ جب ہم اس کے رسول کی پیروی کرتے ہیں اس میں جو وہ اللہ کی اطاعت کے بارے میں لائے، تو وہ ہم سے محبت کرتا ہے اور ہم اسے راضی کرتے ہیں، پس وہ ہم سے راضی ہو جاتا ہے۔ اور جب ہم اس کی مخالفت کرتے ہیں اور اس کے حکم کی تعمیل نہیں کرتے اور اس کی نافرمانی کرتے ہیں، تو وہ ہمیں خبر دیتا ہے کہ ہم نے اسے ناراض کیا اور غضبناک کیا، پس وہ ہم پر غضبناک ہوا۔ اور جب ہم اسے پکارتے ہیں تو وہ ہمیں جواب دیتا ہے۔ پس دعا (الدعاء) اس کے اثر میں سے ہے اور اجابت (الإجابۃ) ہمارے اثر میں سے ہے۔ یہ اس لیے ہے تاکہ تم جان لو کہ اس نے کوئی چیز ظاہر نہیں کی مگر اس کی صورت پر جو وہ خود ہے۔ اور یہ محال ہے کہ امر اس کے سوا ہو، ورنہ کہاں سے؟ اور وہاں اس کے سوا کوئی نہیں ہے۔ اور شے وہی دیتی ہے جو اس کی قوت (قوتہ) میں ہے۔\n\nاور اسی لیے ذات حق (الحق) نے ہمارے لیے اپنی ذات کو ان صفات سے بیان کیا جو ہمارے نزدیک محدثات (المحدثات) کی صفات ہیں، حالانکہ حقیقت میں وہ اس کی صفات ہیں جو ہم میں ظاہر ہوئیں، پھر اس کی طرف واپس نہیں لوٹیں۔ اور اس نے ہمیں ان صفات سے بیان کیا جو اس کے جلال کے مستحق ہیں، پس وہ حقیقت میں اس کی صفات ہیں۔ پس اگر اس نے ہمیں اس صورت پر پیدا نہ کیا ہوتا جو وہ خود ہے، تو یہ صحیح اور ثابت نہ ہوتا کہ ہم ان صفات میں سے کسی کو قبول کریں جن سے اس نے ہمیں موصوف کیا ہے اور جو اس کے لیے حق ہیں، اور نہ ہی وہ ان صفات میں سے کسی کو قبول کرتا جن سے اس نے خود کو موصوف کیا ہے اور جو ہمارے لیے حق ہیں۔ اور سب کچھ اس کے لیے حق ہے۔ پس وہ اصل ہے جس کی ہم فرع ہیں، اور اسماء اس درخت کی شاخیں ہیں، یعنی شجرۃ الوجود (شجرة الوجود) کی۔ اور ہم عین ثمر (عین الثمر) ہیں، بلکہ وہ خود عین ثمر ہے۔ پس ہمارے لیے اس درخت کے وجود کے سوا کوئی مثال نہیں ہے۔\n\nاور اللہ کی معرفت (المعرفۃ) کی تکمیل میں وہ بھی شامل ہے جس کی خبر اس نے ہمیں اپنے رسول صلی اللہ علیہ وسلم کی زبان پر دی، یعنی تجلی (التجلی) کے مقامات پر اس کا صورتوں میں بدلنا (تحوله تعالى في الصور)۔ اور یہی ہمارے باطنی اور ظاہری احوال میں پلٹنے کی اصل ہے۔ اور یہ سب کچھ اس میں (ذات حق میں) ہے۔ اور اسی طرح وہ تعالیٰ عالم کے معاملات میں حکمی ترتیب (الترتیب الحکمی) کے تقاضے کے مطابق ہے۔ پس اس کی شان کل (آنے والے دن) میں وہی ہو سکتی ہے جو کل میں ہو، اور آج کی شان آج ہی ہو سکتی ہے، اور گزشتہ کل کی شان گزشتہ کل میں ہی ہو سکتی ہے۔ یہ سب اس کی ذات کے اعتبار سے ہے۔ لیکن جہاں تک شان کا تعلق ہے، اگر ذات حق (الحق) چاہے تو وہ اس وقت کے علاوہ کسی اور وقت میں بھی ہو سکتی ہے جس میں وہ ہوتی ہے۔ اور اس کی مشیئت (مشیئتہ) میں نہ کوئی جبر ہے اور نہ کوئی حیرانی۔ اللہ اس سے پاک ہے۔ بلکہ اس کی مشیئت کا تعلق صرف ایک ہی ہے، اور کوئی نہیں۔\n\nاور اسی میں سے اس کا قول ہے: سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (اے دو بھاری بوجھ والو! ہم عنقریب تمہاری طرف متوجہ ہوں گے)۔ یعنی تم سے اور اس عالم سے جو ہمارے سوا ہے۔ اور اس نے ہمیں ثقلین (الثقلان) (دو بھاری بوجھ) اس لیے کہا کہ ہم میں ثقل (بھاری پن) ہے، اور یہی ہمارے وجود میں تاخیر کی عین ہے۔ پس ہم نے دیر کی، اور ثقیل کی عادت دیر کرنا ہے، جیسا کہ خفیف کی عادت جلدی کرنا ہے۔ پس ہم اور جن ثقلین میں سے ہیں، اور ہم جنوں سے زیادہ ثقیل ہیں، کیونکہ ہم پر غالب رکن مٹی (التراب) ہے۔ پس انسان عالم میں سب سے آخر میں موجود ہوا، کیونکہ مختصر (المختصر) صرف مطول (طویل) سے ہی مختصر کیا جاتا ہے، ورنہ وہ مختصر نہیں ہوتا۔ پس عالم ذات حق (الحق) کا مختصر ہے، اور انسان عالم اور ذات حق (الحق) کا مختصر ہے۔ پس وہ خلاصہ ہے مختصر کا، یعنی انسان کامل (الإنسان الکامل)۔ اور جہاں تک انسان حیوانی (الإنسان الحیوان) کا تعلق ہے، وہ عالم کا مختصر ہے۔ اور ذات حق (الحق) اس کے لیے متوجہ ہو گا تاکہ اس پر اس چیز کا میزان قائم کرے جس کے لیے اسے پیدا کیا گیا۔ کیونکہ اس کا قول سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (اے دو بھاری بوجھ والو! ہم عنقریب تمہاری طرف متوجہ ہوں گے) ایک دھمکی کا کلمہ ہے۔ اور انسان کامل (الإنسان الکامل) اس خطاب کا مخاطب نہیں ہے۔ مگر اس کلمے میں ان دونوں (ثقلین) کے لیے رحمت (الرحمۃ) کے لاحق ہونے کا اشارہ ہے، اور وہ \"لکم\" میں ضمیر مخاطب پر داخل ہونے والے لام کے فتحہ (زبر) میں ہے۔ اگرچہ فتح الٰہی (الفتح الإلهي) کبھی اس چیز سے بھی ہوتا ہے جو ناگوار ہو، جیسا کہ اس چیز سے ہوتا ہے جو خوش کرے، لیکن اس کی رحمت اس کے غضب پر سبقت لے گئی۔ اور اس نے استقبال (آنے والے وقت) کا آلہ یعنی سین (س) استعمال کیا، اور استقبال کی آخری حد وہ ہے جس کی طرف عالم کا معاملہ رحمت کے ساتھ لوٹتا ہے، جس کے بعد کوئی غضب نہیں ہو گا، کیونکہ تکلیف (التکلیف) ختم ہو جائے گی اور حدود پوری ہو جائیں گی۔ اور چونکہ اس نے \"لکم\" میں ضمیر خطاب استعمال کیا، اور ہم نے ہمیشہ سے کرم الٰہی (الکرم الإلهي) سے جانا ہے کہ وہ ہمیشہ سعادت مندوں کے پہلو اور رحمت کے پہلو کو اس کے برعکس پر ترجیح دیتا ہے۔ اور اسی لیے اس نے اس چیز کو عذاب (عذاب) کا نام دیا جس سے اہل شقاوت (اہل الشقاء) تکلیف اٹھائیں گے، کیونکہ سعادت مند لوگ اہل شقاوت کی تکلیفوں کو شیریں سمجھتے ہیں، اس لیے کہ انہوں نے ذات حق (الحق) کے جناب کو ترجیح دی جہاں انہوں نے شرک کیا۔ پس ان کے لیے اسباب آلام میں بھی نعمت ہے۔ پس ذات حق (الحق) نے اسے عذاب کا نام دیا، ان کو ترجیح دیتے ہوئے جب انہوں نے اسے ترجیح دی۔\n\nاسی لیے وہ حرف خطاب (الخطاب) کے ساتھ آیا تاکہ لام کو فتحہ دے، اور خطاب کے آلے سے یہ معلوم ہو جائے کہ وہ مخصوص لوگ ہیں، کیونکہ عالم سے ضمیر غائب (ضمير الغائب) ختم نہیں ہوتا۔ پس اس کے لیے اہل کا ہونا ضروری ہے، جیسے اس کا قول سعادت مندوں کے بارے میں: لَهُمْ جَنَّاتٍ تَجْرِي (ان کے لیے باغات ہیں جن کے نیچے نہریں بہتی ہیں)۔ پس وہ ضمیر غائب کے ساتھ آیا، تو وہ ان مخاطبین سے غائب ہو گئے۔ اور لام کا فتحہ (زبر) رحمت کا فتحہ (فتح رحمۃ) ہے، جو احوال کے قرائن عطا کرتے ہیں۔ اور اس آلے کے مراتب ہیں جن کے ذریعے ذات حق (الحق) اپنے بندوں سے معاملہ کرتا ہے، جیسے اس کا قول: وإِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ (اور بے شک وہ ہمارے نزدیک چنے ہوئے نیک لوگوں میں سے ہیں)، اور جیسے اس کا قول: ما كانَ الله لِيَذَرَ الْمُؤْمِنِينَ عَلى‏ ما أَنْتُمْ عَلَيْهِ (اللہ مومنوں کو اس حال پر نہیں چھوڑے گا جس پر تم ہو)، اور ما كانَ الله لِيُضِيعَ إِيمانَكُمْ (اور اللہ تمہارے ایمان کو ضائع نہیں کرے گا)، اور سَخَّرَ لَكُمْ ما في السَّماواتِ وما في الْأَرْضِ (اور اس نے تمہارے لیے مسخر کر دیا جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے)، اور خَلَقَ لَكُمْ ما في الْأَرْضِ (اور اس نے تمہارے لیے پیدا کیا جو کچھ زمین میں ہے)، اور ولَهُ ما في السَّماواتِ وما في الْأَرْضِ وما بَيْنَهُما وما تَحْتَ الثَّرى‏ (اور اسی کا ہے جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے اور جو کچھ ان کے درمیان ہے اور جو کچھ زمین کی تہہ کے نیچے ہے)۔ پس اس کے لیے بھی ہے اور ہمارے لیے بھی ہے۔ اس کے باوجود، ادب ہم پر لازم ہے، اور ادب کے ذریعے ہی صاحب سلطان کے ساتھی بغیر انبساط (بے تکلفی) کے بیٹھتے ہیں، کیونکہ شہود (الشہود) اور انبساط جمع نہیں ہو سکتے۔ بعض نے کہا ہے: \"بساط پر بیٹھو، اور انبساط سے بچو۔\"\n\nمیں نے اس کی عبادت کی جس کا حکم میرے لیے مناسب نہیں،\nاور میں اس کی عبادت نہیں کرتا جس کی صفت میری صورت سے بیان کی گئی ہو۔\nکیونکہ اس نے کہا: \"یہ میں نے نہیں کہا،\"\nاور میرے حال کی صورت اس کی صورت کے سوا کچھ نہیں۔\n\nکیونکہ ادنیٰ سے ادنیٰ شخص بھی جب اس کی شان کے خلاف شریف صفات کی نسبت اس کی طرف کی جاتی ہے تو وہ اس سے نفرت کرتا ہے، کیونکہ یہ اس کی ہجو ہوتی ہے، جیسا کہ شریف شخص اس سے کم صفت سے موصوف ہونے سے نفرت کرتا ہے جس کا اس کا شرف مستحق ہے۔\n\n(وصل) [ولی اور نبی کے درمیان فرق]\n\nاور جہاں تک ہمارے اصحاب میں سے ان لوگوں کا قول ہے، اور جس کی طرف امام ابو حامد الغزالی اور دیگر گئے ہیں، کہ ولی (الولی) اور نبی (النبی) کے درمیان فرق فرشتے کا نازل ہونا ہے، کیونکہ ولی ملہم (ملہم) ہوتا ہے اور نبی پر فرشتہ نازل ہوتا ہے، باوجود اس کے کہ نبی بعض امور میں ملہم بھی ہوتا ہے، کیونکہ وہ ولایت (الولایۃ) اور نبوت (النبوۃ) کو جمع کرنے والا ہے—تو یہ ہمارے نزدیک ان کہنے والوں کی غلطی ہے اور ان کے ذوق (ذوق) کی کمی پر دلیل ہے۔ فرق صرف اس چیز میں ہے جسے لے کر فرشتہ نازل ہوتا ہے، نہ کہ فرشتے کے نازل ہونے میں۔ پس جو چیز فرشتہ رسول (الرسول) اور نبی پر لے کر نازل ہوتا ہے، وہ اس چیز کے خلاف ہے جسے فرشتہ تابعدار ولی (الولی التابع) پر لے کر نازل ہوتا ہے۔ کیونکہ فرشتہ تابعداری کی بنا پر ولی پر نازل ہو سکتا ہے، اور اسے وہ چیز سمجھا سکتا ہے جو نبی لایا ہے اور جس کا علم اس ولی کو حاصل نہیں ہوا، اگرچہ وہ زمانے کے لحاظ سے اس سے مؤخر ہو، یعنی اس کے وجود کے زمانے سے مؤخر ہو۔ پس فرشتہ اس پر نازل ہو سکتا ہے تاکہ اسے نبی کی لائی ہوئی چیز کی صحت اور سقم (خرابی) سے آگاہ کرے، جو اس پر لاد دی گئی ہو یا جسے وہ صحیح سمجھتا ہو، یا جسے ضعیف راوی کی وجہ سے چھوڑ دیا گیا ہو حالانکہ وہ حقیقت میں صحیح ہو۔ اور فرشتہ اس پر اللہ کی طرف سے بشارت (البشری) لے کر بھی نازل ہو سکتا ہے کہ وہ سعادت اور کامیابی والوں میں سے ہے، اور دنیا کی زندگی میں ہر طرح کی امان کے ساتھ۔ کیونکہ اللہ عزوجل فرماتا ہے: لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا (ان کے لیے دنیا کی زندگی میں بشارت ہے)۔ اور استقامت والوں کے بارے میں، جو اللہ کی ربوبیت کا اقرار کرتے ہیں، فرمایا کہ ان پر فرشتے نازل ہوتے ہیں: قال تعالى إِنَّ الَّذِينَ قالُوا رَبُّنَا الله ثُمَّ اسْتَقامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ أَلَّا تَخافُوا ولا تَحْزَنُوا وأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ نَحْنُ أَوْلِياؤُكُمْ في الْحَياةِ الدُّنْيا (بے شک جن لوگوں نے کہا کہ ہمارا رب اللہ ہے، پھر وہ ثابت قدم رہے، ان پر فرشتے نازل ہوتے ہیں کہ نہ ڈرو اور نہ غم کرو، اور اس جنت کی خوشخبری سنو جس کا تم سے وعدہ کیا جاتا تھا۔ ہم تمہارے دوست ہیں دنیا کی زندگی میں)۔ اور اللہ کے اولیاء (أولیاء الله) میں سے بعض ایسے ہوتے ہیں جنہیں اللہ کی طرف سے تنزیل (نزول) میں انزال (نازل ہونے) کا ذوق (ذوق) حاصل ہوتا ہے۔\n\nپس ان لوگوں پر جو اس کے خلاف کہتے ہیں، جو کچھ بھی وارد ہوا، وہ صرف ان کے اپنے اس اعتقاد کی وجہ سے ہوا کہ انہوں نے اپنے سلوک سے تمام راستوں اور مقامات کو مکمل کر لیا ہے، اور کوئی مقام باقی نہیں رہا جس میں انہیں ذوق حاصل نہ ہوا ہو۔ اور انہوں نے یہ نہیں دیکھا کہ ان پر کوئی فرشتہ نازل ہوا، تو انہوں نے یہ اعتقاد کر لیا کہ یہ صرف نبی کے ساتھ خاص ہے۔ پس ان کا ذوق صحیح ہے اور ان کا حکم باطل ہے۔ اور وہ یہ کہتے ہیں کہ ان میں سے جو کوئی اضافہ لائے گا، وہ قبول کیا جائے گا، کیونکہ وہ صاحب ذوق (صاحب ذوق) عادل ہے۔ ان کے نزدیک کوئی تجریح (تنقید) یا طعن نہیں ہے، اور وہ اپنے ذوق سے تجاوز نہیں کرتے۔ اسی وجہ سے غلطی واقع ہوئی۔ اگر ان تک ان سے پہلے والوں میں سے یا ان کے زمانے میں موجود اہل اللہ میں سے ولی پر فرشتے کے نازل ہونے کا قول پہنچتا تو وہ اسے قبول کر لیتے اور رد نہ کرتے، کیونکہ ان کی شکل و صورت اور مثالوں میں تہمت کا کوئی امکان نہیں تھا۔ ہم نے واقعات میں دیکھا ہے کہ پہلے زمانے کے ایک گروہ نے کسی امر کو نہیں مانا، لیکن جب انہوں نے اسے ہم سے سنا تو قبول کر لیا اور انکار نہیں کیا، کیونکہ ان سے تہمت اٹھ گئی تھی۔\n\nپس اگر اہل اللہ میں سے کوئی، جو اشارات (الإشارات) والے ہیں اور جو دوری کے سرے پر پکارنے والے ہیں، یہ کہے کہ تم نے کہا ہے کہ عالم میں کوئی حقیقت (حقیقۃ) یا نسبت (نسبۃ) ایسی نہیں جو نسبت الٰہیہ (نسبۃ إلهیۃ) سے صادر نہ ہوئی ہو، اور عالم کی نسبتوں میں سے ایک افتقار (الافتقار) بھی ہے، حالانکہ ابو یزید (بسطامی)، جو اہل کشف (أهل الکشف) اور وجود (الوجود) میں سے ہیں، نے کہا ہے کہ اللہ نے ان سے اپنے بعض مشاہدات میں فرمایا: \"میری طرف اس چیز سے قریب ہو جو میرے لیے نہیں ہے، یعنی ذلت (الذلۃ) اور افتقار (الافتقار)۔\"\n\n[کہ ذات حق تعالیٰ کے لیے رحمت، عفو، کرم اور مغفرت ہے]\n\nپس اے فائدہ اٹھانے والے! جان لو کہ ذات حق تعالیٰ کے لیے رحمت (الرحمۃ)، عفو (العفو)، کرم (الکرم) اور مغفرت (المغفرۃ) ہے، اور جو کچھ اس کے اسماء حسنیٰ (الأسماء الحسنیٰ) میں سے آیا ہے، وہ حقیقت میں اس کے لیے ہے۔ اور اسی طرح اس کے لیے انتقام (الانتقام) اور شدید پکڑ (البطش الشدید) بھی ہے۔ پس وہ سبحانہ و تعالیٰ رحیم (الرحیم)، عفو کرنے والا (العفو)، کریم (الکریم)، غفور (الغفور)، اور انتقام والا (ذو انتقام) ہے۔ اور یہ محال ہے کہ ان اسماء کے آثار اس میں ہوں یا وہ ان کے آثار کا محل ہو۔ پس وہ کس پر رحیم ہے؟ کسے عفو کرتا ہے؟ کس پر کریم ہے؟ کسے بخشتا ہے؟ اور کس سے انتقام لیتا ہے؟ پس یہ کہنا ضروری ہے کہ اللہ الخالق (الخالق) مخلوق (المخلوق) کو طلب کرتا ہے، اور مخلوق خالق کو طلب کرتی ہے۔ اور طالب کی صفت معروف ہے، اور حاصل نفی نہیں ہوتا۔ پس عالم کا ہونا ضروری ہے، کیونکہ حقائق الٰہیہ (الحقائق الإلهیۃ) اسے طلب کرتی ہیں۔ اور ہم نے تمہیں بیان کر دیا ہے کہ اس کے ذات ہونے کا معقول (معقولیۃ کونہ ذاتا) اس کے الٰہ ہونے کا معقول نہیں ہے۔ پس مرتبے نے دوہرا کیا، اور وجود عینی (الوجود العینی) میں عین کے سوا کچھ نہیں ہے۔ پس وہ اپنی حیثیت سے عالمین سے غنی (غنی) ہے، اور اسماء حسنیٰ (الأسماء الحسنیٰ) کی حیثیت سے، جو عالم کو اس کے ممکن ہونے کی وجہ سے طلب کرتے ہیں تاکہ ان کے آثار اس میں ظاہر ہوں، وہ عالم کے وجود کو طلب کرتا ہے۔ اگر عالم موجود ہوتا تو وہ اس کے وجود کو طلب نہ کرتا۔ پس اسماء اس کے لیے عیال (خاندان) کی طرح ہیں، اور عیال کا رب اپنے عیال کے لیے کوشش کرتا ہے۔ اور مخلوق اللہ کے دور کے عیال ہیں، اور اسماء قریب کے عیال ہیں۔ پس عالم نے اپنے ممکن ہونے کی وجہ سے اسے سوال کیا، اور اسماء نے اپنے آثار کے ظاہر ہونے کے لیے اس سے سوال کیا۔ اور سوال صرف اس چیز کے بارے میں کیا جاتا ہے جس کا وجود نہ ہو۔ پس عالم کا وجود ضروری ہے۔\n\nاور کتاب (الکتاب) حاکم ہے، اور علم (العلم) سابق ہے، اور مشیئت (المشیئۃ) محقق کرنے والی ہے۔ پس یہ محال ہے کہ وہ واقع نہ ہو۔ اور تکفیر (التکفیر) صرف اس گروہ میں واقع ہوئی جس نے کہا: إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ (بے شک اللہ فقیر ہے اور ہم غنی ہیں)۔ یہ مجموعی طور پر کفر ہے، کیونکہ وہ اللہ سے غنی نہیں ہیں، اور ذات حق (الحق) ان کو وجود دینے یا ان پر نعمتیں برسانے میں تاخیر کرنے والا نہیں ہے، یہ اس کی طرف سے فضل اور احسان ہے، ایک سابقہ کتاب کے حکم کی وجہ سے۔ اللہ تعالیٰ نے فرمایا: لَوْ لا كِتابٌ من الله سَبَقَ لَمَسَّكُمْ فِيما أَخَذْتُمْ عَذابٌ (اگر اللہ کی طرف سے ایک نوشتہ پہلے سے نہ ہوتا تو جو کچھ تم نے لیا ہے اس میں تمہیں بڑا عذاب پہنچتا)۔ پس حکم کتاب کا ہے، اور کتاب کی نسبت ذات کی نسبت نہیں ہے۔ اور حکم کو نافذ کرنے والے میں اس کے نفاذ کا تعین کتاب کے لیے ایسا ہے جیسے سادن (متولی) اور مرتبے کے جبر کے حکم سے تصرف کرنے والا۔ یہ حقائق خود بخود عطا کرتی ہیں، اور وہ تبدیل نہیں ہوتیں۔ اگر حقائق تبدیل ہو جائیں تو نظام بگڑ جائے گا اور کوئی علم، کوئی حق، اور کوئی خلق باقی نہیں رہے گا۔\n\nپس اگر عقل مند شخص اللہ تعالیٰ کے اس قول میں خطاب الٰہی (الخطاب الإلهي) کی حکمت پر غور کرے: سَنَكْتُبُ ما قالُوا (ہم لکھ لیں گے جو انہوں نے کہا)، اور اسے اس کے قول سے لے: كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ (تمہارے رب نے اپنے اوپر رحمت لازم کر لی ہے)۔ یعنی اس نے اسے اپنے اوپر واجب کر لیا، کیونکہ اس کے سوا کوئی واجب کرنے والا نہیں ہے۔ پس اس نے فرمایا: ہم وہ لکھ لیں گے جو انہوں نے کہا، اس میں جو نقصان ان کی طرف لوٹتا ہے۔ اور آیت کے آخر میں فرمایا: ونَقُولُ ذُوقُوا عَذابَ الْحَرِيقِ (اور ہم کہیں گے کہ جلنے والے عذاب کا مزہ چکھو)، ان کے قول کی سزا کے طور پر۔ اور اسی لیے ان کا کفر مجموعی طور پر ثابت ہوا، کیونکہ وہ غنی نہیں ہیں۔ پس یہ اس آیت کی روح ہے۔ اور جہاں تک تمہارے اس احتجاج کا تعلق ہے جو اس نے ابو یزید سے کہا، وہ بھی عین مجموع (عین المجموع) ہے۔ اس نے صرف ذلت (الذلۃ) نہیں کہا، بلکہ کہا: \"ذلت اور افتقار (الذلۃ والافتقار)\"۔ اور مجموع کی نسبت افراد کی نسبت نہیں ہے۔ پس اگر ممکن (الممکن) نہ ہوتا تو اسماء الٰہیہ (الأسماء الإلهیۃ) کا کوئی اثر ظاہر نہ ہوتا، اور اسم عین مسمیٰ ہوتا ہے، خاص طور پر اسماء الٰہیہ۔ پس وجود (الوجود) طالب (طلب کرنے والا) بھی ہے اور مطلوب (طلب کیا جانے والا) بھی، اور طلب کا تعلق عدم (العدم) سے ہے۔ یا تو موجود کو معدوم کرنا، یا معدوم کو موجود کرنا۔ اللہ تعالیٰ نے فرمایا: الله لا إِلهَ إِلَّا هُوَ (اللہ، اس کے سوا کوئی معبود نہیں)۔ پس اس نے صرف الوہیت (الألوهۃ) کی نفی کی کہ وہ ایک سے زیادہ کی صفت ہو۔ پس اسماء الٰہیہ (الأسماء الإلهیۃ) یا وہ مرتبہ جو الٰہ کہلانے والے کا مرتبہ ہے، اس میں تصرف اور حکم ہے جس کی صفت ان سے بیان کی گئی ہے۔ پس وہ ان کے ذریعے تصرف کرتا ہے اور ان کے لیے تصرف کرتا ہے، اور وہ اپنے تصرف کی حالت میں عالمین سے غنی ہے۔ اس کا ہونا ضروری ہے۔ پس دیکھو کہ یہ امر اپنی ذات میں کتنا عجیب ہے۔ اور یہیں سے ابو سعید الخراز کا قول معلوم ہوتا ہے کہ اس نے اللہ کو نہیں پہچانا مگر دو ضدوں کو جمع کرنے سے، پھر اس نے تلاوت کی: هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ (وہی اول ہے اور آخر ہے اور ظاہر ہے اور باطن ہے)۔\n\nاور جہاں تک بخل کے بارے میں یہودیوں کا قول ہے: يَدُ الله مَغْلُولَةٌ (اللہ کا ہاتھ بندھا ہوا ہے)، تو اللہ نے ان کے بارے میں فرمایا: غُلَّتْ أَيْدِيهِمْ ولُعِنُوا بِما قالُوا (ان کے ہاتھ باندھ دیے گئے اور ان پر لعنت کی گئی اس وجہ سے جو انہوں نے کہا)۔ یعنی انہیں کرم الٰہی (الکرم الإلهي) کی صفت سے دور کر دیا گیا۔ کیونکہ ان کے اقوال ان کے اعمال میں سے ہیں۔ پس ان کے ہاتھ باندھ دیے گئے، اور بخل جو انہوں نے اللہ کی طرف منسوب کیا تھا، وہ ان کے ذریعے واقع ہوا۔ پس انہوں نے اللہ سے صرف وہی دیکھا جو انہوں نے کہا تھا۔ پس اس نے انہیں اس چیز کا ذائقہ چکھایا جو وہ لائے تھے۔ اور اللہ نے اس کے بعد مال کے معاملے میں انہیں جھٹلایا، پس اس نے ان پر رحمت کے ساتھ کرم کو پھیلا دیا، جو وَسِعَتْ كُلَّ شَيْ‏ءٍ (ہر چیز پر چھا گئی ہے)، تاکہ انہیں یہ معلوم ہو جائے کہ وہ جھوٹے تھے۔ اور یہ ان پر سب سے شدید عذاب ہے اور سب سے شدید نعمت ہے۔ کیونکہ جب اس نے ان پر جود و کرم پھیلا دیا، تو انہوں نے اپنی جہالت کو جانا، پس انہوں نے اس کا تصور کیا، تو ان کی جانیں اس حال کے تصور سے عذاب میں مبتلا ہوئیں جس پر وہ اللہ کے بارے میں جہالت کی وجہ سے تھے، اور وہ اس کے زائل ہونے اور علم پر قائم ہونے سے نعمت حاصل کرتے ہیں۔ اور انہوں نے جانا کہ ان کی جہالت نے انہیں اللہ پر جھوٹ بولنے کا وارث بنایا: بَلْ يَداهُ مَبْسُوطَتانِ يُنْفِقُ كَيْفَ يَشاءُ (بلکہ اس کے دونوں ہاتھ کھلے ہیں، وہ جیسے چاہتا ہے خرچ کرتا ہے)۔ پس حکم مشیئت (المشیئۃ) کا ہے۔ پس سمجھو۔ اور اس کی مشیئت اس کی ذات کے سوا کچھ نہیں ہے۔ پس اس کے اسماء اس کی عین ہیں، اور ان کے احکام اس کا حکم ہیں۔ اور عالم صرف ان قوتوں کے ذریعے ظاہر ہوا جن پر وہ ہیں۔\n\nاس کی طرف دیکھو، تم وہی ہو جاؤ گے،\nاور اپنی حد سے تجاوز نہ کرو۔\nپس جو کچھ بھی اس میں ہے،\nوہ سب تمہارے پاس ہی ہے۔\nجس نے اللہ کی قدر کو اس طرح جانا جیسا کہ اس کا حق ہے،\nاس نے وجود کے امر کو اس سے ظاہر کیا۔\nپس ہر وہ امر جسے تم عین دیکھتے ہو،\nجس کا علم اس میں ہے، وہ اسی کی طرف سے ہے۔\nپس اس کی عین (عین) وہی ہے جسے تم دیکھتے ہو،\nاسی لیے وجود کی کوئی حقیقت (کنہ) نہیں ہے۔\n\nپس جب تم \"اللہ\" کہتے ہو، تو وہ تمام حقائق اسماء الٰہیہ (الأسماء الإلهیۃ) کا مجموعہ ہے۔ پس یہ محال ہے کہ اسے مطلقاً کہا جائے، بلکہ احوال کا اسے مقید کرنا ضروری ہے۔ اور اگر الفاظ اسے مقید کریں تو وہ احوال کی تابعیت کے حکم سے ہے۔ پس جب بھی کوئی چیز اس کی طرف منسوب کی جائے، تو دیکھو کہ وہ اضافہ کس اسم کا مستحق ہے۔ پس اس امر میں اللہ سے مطلوب صرف وہ اسم ہے جو اس اضافے کے لیے خاص ہے، اور وہ حقیقت الٰہیہ (الحقیقۃ الإلهیۃ) جو اسے طلب کرتی ہے۔ پس اس سے تجاوز نہ کرو۔ اور جس کا یہ حال ہو، اس نے اللہ کا حق پورا کیا اور اس کی قدر کو اجمالی طور پر جانا، کیونکہ وہ اس کی قدر کو تفصیلی طور پر نہیں جان سکتا، کیونکہ اللہ کے علم میں اضافہ دنیا اور آخرت میں منقطع نہیں ہوتا۔ پس یہ امر غیر متناہی (لا متناہی) ہے۔ کیا تم نے نہیں دیکھا کہ اللہ تعالیٰ نے موسیٰ علیہ السلام کو فرعون کی طرف رسالت دے کر بھیجا، جس میں یہ بھی شامل تھا کہ اگر فرعون ان سے پوچھے: فَما بالُ الْقُرُونِ الْأُولى‏ (تو پہلی قوموں کا کیا حال ہوا؟)، تو وہ اسے جواب دیں: عِلْمُها عِنْدَ رَبِّي في كِتابٍ لا يَضِلُّ رَبِّي ولا يَنْسى‏ (اس کا علم میرے رب کے پاس ایک کتاب میں ہے، میرا رب نہ بہکتا ہے اور نہ بھولتا ہے)۔ یعنی جو کچھ اس نے اپنے اوپر لازم کیا ہے۔ پس اس نے اسے لوح محفوظ (اللوح المحفوظ) میں صرف اس لیے لکھا تاکہ وہ جان لے جس کی شان یہ ہے کہ وہ صرف اطلاع سے ہی جانتا ہے، نہ کہ اس لیے کہ وہ اس چیز کو یاد کرے جو اس نے اپنے اوپر لازم کی ہے اور جس کے اوقات طویل مدتوں میں آنے والے ہیں۔ کیونکہ وہ سبحانہ و تعالیٰ لا يَضِلُّ رَبِّي (میرا رب نہ بہکتا ہے) جس کے پاس سے میں تمہارے پاس آیا ہوں تاکہ تمہیں اس کی عبادت کی دعوت دوں، اور نہ يَنْسى‏ (بھولتا ہے)۔ اور اللہ تعالیٰ نے اپنی ذات کے بارے میں فرمایا: نَسُوا الله فَنَسِيَهُمْ (انہوں نے اللہ کو بھلا دیا تو اس نے انہیں بھلا دیا)۔ اور انہوں نے اسے مطلقاً نہیں بھلایا، پس وہ انہیں مطلقاً نہیں بھولتا۔ بلکہ وہ انہیں اس چیز میں بھول جاتا ہے جس میں انہوں نے اسے بھلایا، جس کے بارے میں اگر وہ جانتے تو رحیم (الرحیم) کی طرف سے اس رحمت کو پا لیتے۔ پس جب انہوں نے اسے بھلا دیا تو رحیم نے انہیں بھلا دیا، کیونکہ وہ اسم الٰہی (الاسم الإلهي) ان پر غالب آ گیا جس کے عمل کی طرف وہ اسم دعوت دیتا ہے۔ پس جب اس میں اس کے میزان کا عدل پورا ہو جاتا ہے، تو نسیان (بھول) زائل ہو جاتا ہے، کیونکہ موت کے وقت دنیا میں پردہ ہٹنے پر اس کا زائل ہونا ضروری ہے۔ پس اہل تکلیف (أهل التکلیف) میں سے کوئی بھی نہیں مرتا مگر علم اور محقق عیان (مشاہدہ) کے ساتھ مومن ہو کر، جس میں اللہ کے علم اور اس پر ایمان کے بارے میں کوئی شک یا تردد نہیں ہوتا۔ یہ وہ چیز ہے جو عام ہے۔ اور موت سے زیادہ سخت کوئی مصیبت نہیں ہے۔ اور یہ باقی رہا کہ آیا یہ ایمان انہیں فائدہ دے گا یا نہیں؟ جہاں تک ان سے سزا اٹھانے کا تعلق ہے، تو نہیں، مگر جسے اللہ خاص کر دے، جیسے اس کا قول تعالیٰ: فَلَمْ يَكُ يَنْفَعُهُمْ إِيمانُهُمْ لَمَّا رَأَوْا بَأْسَنا (پس جب انہوں نے ہمارا عذاب دیکھا تو ان کا ایمان انہیں فائدہ نہ دے سکا)۔ پھر فرمایا، اور یہی ہماری دلیل کا مقام ہے: سُنَّتَ الله الَّتِي قَدْ خَلَتْ في عِبادِهِ (یہ اللہ کا طریقہ ہے جو اس کے بندوں میں گزر چکا ہے)۔ اور استثناء اس کا قول تعالیٰ ہے: إِلَّا قَوْمَ يُونُسَ لَمَّا آمَنُوا كَشَفْنا عَنْهُمْ عَذابَ الْخِزْيِ في الْحَياةِ الدُّنْيا ومَتَّعْناهُمْ إِلى‏ حِينٍ (سوائے یونس کی قوم کے، جب وہ ایمان لائے تو ہم نے ان سے دنیا کی زندگی میں رسوائی کا عذاب ہٹا دیا اور انہیں ایک مدت تک فائدہ پہنچایا)۔ پس اس کی مخلوق پر اللہ کا کوئی حکم نہیں ہے۔ اور جہاں تک اس ایمان کے انجام میں فائدہ دینے کا تعلق ہے، تو تمہارا رب فَعَّالٌ لِما يُرِيدُ (جو چاہتا ہے کرنے والا ہے)۔ اور وہ تعالیٰ فرماتا ہے: إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً (بے شک اللہ تمام گناہوں کو بخش دیتا ہے)۔ پس یہ اس کا قول ہے جو اس نے اپنی کتاب میں اور اپنے رسولوں کی زبانوں پر ہم سے وعدہ کیا ہے۔\n\nپس حق (الحق) نے میرے دل میں ملأ اعلیٰ (الملإ الأعلى) سے جو کچھ رسول لایا، اس میں ظاہر ہوا۔\nپس اس نے مجھے امر کے نصف حصے کی خبر دی، تو میں امور میں نہ زیادہ مناسب کہتا ہوں اور نہ زیادہ اولیٰ۔\nبلکہ امر اس میں ایک ہی ہے، اس کے سوا نہیں،\nپس ایک عالم فنا ہوتا ہے اور ایک عالم باقی رہتا ہے۔\nاور یہ ایک فرقان (الفرقان) ہے جو اپنی دلیل کو واضح کرتا ہے،\nاور یہ قرآن نہیں ہے جو ہمارے دل پر تلاوت کیا جائے۔\nاگرچہ اللہ کا قول ہر حال میں،\nجب میں اس کی بارگاہ میں آتا ہوں، مجھ پر املا کیا جاتا ہے۔\nاور میری تخلیق عجیب ہے، جو ہمیشہ نئی ہوتی رہتی ہے،\nاور جو اس میں سے گزر چکا ہے، وہ نہ زائل ہوتا ہے اور نہ فنا ہوتا ہے۔\nپس حکیم حق (الحکیم الحق) کا حکم مخلوق میں ظاہر ہے،\nپس پاک ہے وہ جس نے اندھا کیا اور پاک ہے وہ جس نے روشن کیا۔\nاس نے اپنے انعام کو اپنے شہود (شہود) کے ساتھ مجھ پر سخاوت کی،\nاور اس نے مجھے اس کے شیریں ترین گھاٹ (مورد) سے خاص کیا۔\n\nپس جس نے اللہ کا تقویٰ اختیار کیا، اللہ اس کے لیے فرقان (فرقان) بنا دیتا ہے، اگرچہ وہ عین قرآن عزیز (القرآن العزیز) میں ہو، جو جمع ہے، جیسے تم حوض میں پانی جمع کرتے ہو جب تم اسے اکٹھا کرتے ہو۔ پس ہر فرقان قرآن نہیں ہے، اور ہر قرآن فرقان ہے۔\n\nپس عین جمع (عین الجمع) عین فرق (عین الفرق) ہے، پس دیکھو،\nاپنی آنکھ سے جدائی میں اجتماع کو۔\nپس مثال عین مثال نہیں ہے، پس حکم کرو،\nاس پر جدائی کا اور ملاپ کا۔\nاور اگر ہم چاہیں، جب تم اس میں غور کرو،\nتو ہم نکاح (شادی) اور طلاق کا حکم لگائیں گے۔\nاگر ذات حق (الحق) نہ ہوتی تو کوئی ہم آہنگی نہ ہوتی،\nپس حق کی پنڈلی میری پنڈلی سے لپٹی ہوئی ہے۔\nاور جب ہم اس سے بھاگتے ہیں، تو وہ مجھے پکارتا ہے،\nتاکہ میں جان لوں کہ آخرت میں میرا ٹھکانہ (مساق) ہے۔\nاس کی طرف نباتات کے جسموں میں،\nپس اگر ہم پاکیزہ ہوئے تو ہم ڈبیوں میں مشک ہوں گے۔\n\nفَرِيقٌ في الْجَنَّةِ وفَرِيقٌ في السَّعِيرِ (ایک گروہ جنت میں ہے اور ایک گروہ دوزخ میں ہے)۔ پس واحد اس سے ممتاز ہو گیا جس نے اسے دوہرا کیا تھا۔ پس ہر گروہ اپنی احدیت (أحدیتہ) اور جمعیت (جمعیتہ) کے ساتھ منفرد ہو گیا۔ پس ان میں سے بعض اپنی فردیت (فردیتہ) اور احدیت میں تنہا ہونے سے مانوس ہوئے، اور بعض اپنی فردیت اور احدیت میں تنہا ہونے سے وحشت زدہ ہوئے۔ اور یہ عارفین (العارفین) کے نزدیک حجاب کی وحشت ہے۔\n\nپس کون سی نعمت ہے جسے زمانہ مکدر نہیں کرتا؟\nاور جو کچھ میں نے کہا ہے، اس میں خلق (تخلیق) اور امر (حکم) اللہ ہی کے لیے ہے۔\nاگر ذات حق (الحق) کا وجود نہ ہوتا تو اس کی خیر نہ ہوتی،\nاور اگر میرا وجود نہ ہوتا تو مخلوق میں شر نہ دیکھا جاتا۔\nمیں اس کے سوا نہیں ہوں اگر تم میری حقیقت کو جان لو،\nلیکن اس نے چھپا دیا، پس میرا معاملہ اس کے لیے پردہ ہے۔\nپس جو میری صورت کو متحقق کرتا ہے،\nاس کے لیے میری نشأت سے موتی اور موتی ظاہر ہوتے ہیں۔\nپس موتی ہیں، پتھر نہیں جو میری نشأت سے مقابلہ کریں،\nاور علم کے لیے ان میں سے وہی ہے جو موتی سخاوت کرتا ہے۔\nاگر تم عقل والے ہو تو اس کا حکم واضح ہو جائے گا،\nاور اگر تم آنکھ والے ہو تو پردہ اٹھا دیا گیا ہے۔\nپس اگر تم چاہو تو اسے مہر بند خالص شراب (رحیق مختوم) سے پیو،\nاور اگر تم شراب نہ چاہو تو تمہارا مشروب جو کی شراب (مزر) ہے۔\nپس پاک ہے وہ جس نے دل کو اپنے ذکر سے زندہ کیا،\nاور اگر ذکر نہ ہوتا تو فکر (سوچ) اس کے ساتھ قائم ہوتی۔\n\n[علم کا اپنی صورت پر ثابت ہونا]\n\nاور جان لو، اللہ تمہیں اپنی روح سے مدد دے، کہ میں نے علم (العلم) کا اپنی صورت پر ثابت ہونا، جو تبدیل نہیں ہوتا، صرف اسی مقام (منزل) میں دیکھا ہے۔ پس اس نے مجھے اس علم میں اطمینان (الطمانینۃ) بخشا کہ وہ زائل نہیں ہو گا، اور شبہات (الشبه) اسے متزلزل نہیں کریں گے۔ اور جب شبہہ اس شخص کے پاس آتا ہے جس نے اس امر کا اس مقام میں مشاہدہ کیا ہے، تو وہ اسے شبہہ ہی دیکھتا ہے جو اس کے لیے اپنی صورت سے تبدیل نہیں ہو سکتا۔ برخلاف اس شخص کے جس کے لیے یہ مقام نہیں ہے، کیونکہ وہ متزلزل ہو جاتا ہے، اور یہ تزلزل اسے اس چیز میں غور کرنے پر مجبور کرتا ہے جسے وہ پہلے جاننے کا یقین کر چکا تھا، اور وہ نہیں جانتا کہ آیا پہلا علم شبہہ تھا یا مشاہدہ (الشہود) شبہہ ہے یا دونوں امر شبہہ ہیں۔ پس وہ حیران ہو جاتا ہے۔ اور یہ اس لیے ہے کہ وہ امور کے علم میں بصیرت پر نہیں ہے، کیونکہ اس نے اسے اپنی فکر (فکرہ) سے پیدا کیا تھا۔ لیکن جب امور خود بخود آتے ہیں، نہ کہ تمہارے بنانے اور ایجاد کرنے سے، تو وہ تمہیں اپنی حقائق عطا کرتے ہیں، پس تم انہیں اس پر جانتے ہو جس پر وہ ہیں۔\n\nاور اس مقام سے قرآن عزیز (القرآن العزیز) کی بہت سی آیات متعلق ہیں، اور اگر ہم ان میں کلام کو پھیلاتے تو بات لمبی ہو جاتی۔ پس ہم ان میں سے بعض آیات کا ذکر کریں گے، سب کا نہیں، اور میں ان کی شرح نہیں کروں گا، بلکہ صرف سلیم عقلوں اور نافذ بصیرتوں کے لیے ان پر تنبیہ کروں گا۔ ان میں سے یہ ہے: ولِلَّهِ مُلْكُ السَّماواتِ والْأَرْضِ (اور آسمانوں اور زمین کی بادشاہی اللہ ہی کے لیے ہے)۔ اور یہ ہے: لَهُ الْمُلْكُ ولَهُ الْحَمْدُ وهُوَ عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ (اسی کی بادشاہی ہے اور اسی کے لیے حمد ہے، اور وہ ہر چیز پر قادر ہے) سورۃ التغابن میں۔ اور یہ ہے: وقالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِي ولَكَ (اور فرعون کی بیوی نے کہا: یہ میری اور تمہاری آنکھوں کی ٹھنڈک ہے)۔ اور یہ ہے: وَيْلٌ لِلْمُطَفِّفِينَ (ہلاکت ہے ناپ تول میں کمی کرنے والوں کے لیے)۔ اور یہ ہے: فَوَيْلٌ لِلْمُصَلِّينَ (پس ہلاکت ہے ان نمازیوں کے لیے)۔ اور یہ ہے: فَوَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ (پس اس دن جھٹلانے والوں کے لیے ہلاکت ہے) جہاں بھی یہ واقع ہو۔ اور یہ ہے: وتَاللَّهِ لَأَكِيدَنَّ أَصْنامَكُمْ بَعْدَ أَنْ تُوَلُّوا مُدْبِرِينَ (اور اللہ کی قسم! میں تمہارے بتوں کے ساتھ ضرور ایک چال چلوں گا جب تم پیٹھ پھیر کر چلے جاؤ گے)۔ اور یہ ہے: ولَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله (اور اگر تم ان سے پوچھو کہ انہیں کس نے پیدا کیا، تو وہ ضرور کہیں گے: اللہ نے)۔ یہ ان کی سعادت کے لیے تمہید ہے۔ اور یہ ہے: لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ (اللہ ہی کے لیے حکم ہے پہلے بھی اور بعد میں بھی)۔ پس اس آیت سے شروع کیا تاکہ اس امر کو جانا جائے جو اس کے لیے ہے۔ اور یہ ہے: إِنَّ رَبَّهُمْ بِهِمْ يَوْمَئِذٍ لَخَبِيرٌ (بے شک ان کا رب اس دن ان سے خوب باخبر ہو گا)۔ پس علم کے بجائے خبرت (خبرہ) پر اکتفا کیا، کیونکہ ہر خبرت علم ہے۔ اور یہ ہے: ولَوْ شاءَ الله لَجَمَعَهُمْ عَلَى الْهُدى‏ (اور اگر اللہ چاہتا تو انہیں ہدایت پر جمع کر دیتا)۔ پس امتناع کے لیے حرف امتناع لایا۔ اور یہ ہے: ولَوْ لا أَنْ يَكُونَ النَّاسُ أُمَّةً واحِدَةً لَجَعَلْنا لِمَنْ يَكْفُرُ بِالرَّحْمنِ لِبُيُوتِهِمْ سُقُفاً من فِضَّةٍ ومَعارِجَ عَلَيْها يَظْهَرُونَ (اور اگر یہ نہ ہوتا کہ سب لوگ ایک ہی امت ہو جائیں گے، تو ہم رحمن کا انکار کرنے والوں کے گھروں کے لیے چاندی کی چھتیں اور سیڑھیاں بنا دیتے جن پر وہ چڑھتے)۔ اور یہ ہے: إِنَّ السَّاعَةَ آتِيَةٌ أَكادُ أُخْفِيها لِتُجْزى‏ كُلُّ نَفْسٍ بِما تَسْعى‏ (بے شک قیامت آنے والی ہے، میں اسے چھپانا چاہتا ہوں تاکہ ہر جان کو اس کے بدلے میں دیا جائے جو وہ کوشش کرتی ہے)۔ اور یہ ہے: وكَذلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِيَقُولُوا أَ هؤُلاءِ من الله عَلَيْهِمْ من بَيْنِنا (اور اسی طرح ہم نے ان میں سے بعض کو بعض کے ذریعے آزمائش میں ڈالا تاکہ وہ کہیں: کیا یہ وہ لوگ ہیں جن پر اللہ نے ہم میں سے احسان کیا ہے؟)۔ اور یہ ہے: ما كانَ الله لِيَذَرَ الْمُؤْمِنِينَ عَلى‏ ما أَنْتُمْ عَلَيْهِ (اللہ مومنوں کو اس حال پر نہیں چھوڑے گا جس پر تم ہو)۔ اور یہ ہے: ثُمَّ لْيَقْضُوا تَفَثَهُمْ ولْيُوفُوا نُذُورَهُمْ ولْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ (پھر وہ اپنی میل کچیل دور کریں اور اپنی نذریں پوری کریں اور قدیم گھر کا طواف کریں)۔ اور یہ ہے: لَتُؤْمِنُنَّ به ولَتَنْصُرُنَّهُ (تم ضرور اس پر ایمان لاؤ گے اور ضرور اس کی مدد کرو گے)۔ اور یہ ہے: وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ (اور کہہ دو کہ حق تمہارے رب کی طرف سے ہے، پس جو چاہے ایمان لائے اور جو چاہے کفر کرے)۔ اور یہ ہے: وإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ (اور بے شک وہ مال کی محبت میں بہت سخت ہے)۔ اور یہ ہے: يَوْمَئِذٍ تُحَدِّثُ أَخْبارَها بِأَنَّ رَبَّكَ أَوْحى‏ لَها (اس دن وہ اپنی خبریں بیان کرے گی، کیونکہ تمہارے رب نے اسے حکم دیا ہو گا)۔ اور یہ ہے: أَ فَمَنْ يَمْشِي مُكِبًّا عَلى‏ وَجْهِهِ أَهْدى‏ (تو کیا وہ شخص جو اپنے منہ کے بل چلتا ہے، زیادہ ہدایت یافتہ ہے؟) اور یہ وہ ہے جو صراط سے آگ میں اپنے منہ کے بل گرا، حالانکہ وہ موحدین (توحید پرستوں) میں سے تھا۔ اور یہ ہے: وهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ من بَعْدِ ما قَنَطُوا ويَنْشُرُ رَحْمَتَهُ (اور وہی ہے جو بارش نازل کرتا ہے جب لوگ مایوس ہو جاتے ہیں اور اپنی رحمت پھیلاتا ہے)۔ اور یہ ہے: إِنَّ في ذلِكَ لَعِبْرَةً لِأُولِي الْأَبْصارِ (بے شک اس میں آنکھوں والوں کے لیے عبرت ہے) یعنی تعجب۔ اور یہ ہے: فَمَنْ يَكْفُرْ بَعْدُ مِنْكُمْ فَإِنِّي أُعَذِّبُهُ عَذاباً لا أُعَذِّبُهُ أَحَداً من الْعالَمِينَ (پس جو کوئی تم میں سے اس کے بعد کفر کرے گا، تو میں اسے ایسا عذاب دوں گا جو میں نے جہانوں میں سے کسی کو نہیں دیا)۔ اور یہ ہے: وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ پس ان آیات اور ان جیسی آیات کے مقامات پر غور کرو۔\n\nاور یہیں سے تم الف اور لام کی قوت کو جانتے ہو جو عہد (العهد)، تعریف (التعریف) اور جنس (الجنس) کے لیے ہیں، اور حروف کے ساتھ لام الف کا ملانا۔ اور حروف دو قسم کے ہیں: حروف ہجاء (حروف تہجی) جو اصلی حروف ہیں، اور حروف معانی (معنی والے حروف)۔ اور یہ دونوں انسان میں رقم میں وضع کے اعتبار سے اور لفظ میں طبع کے اعتبار سے ہیں۔ اور یہ سب تم سے ہیں اور تم میں ہیں۔ اور تمہارے باہر کوئی امر نہیں ہے۔ پس اپنے آپ کو اپنے سوا کسی اور سے جاننے کی امید نہ رکھو، کیونکہ وہاں کوئی نہیں ہے۔ پس تم اپنے اوپر اور اس پر دلیل ہو، اور تمہارے اوپر کوئی اور دلیل نہیں ہے۔\n\nتمہارے بعد کون ہے جس سے تم امید رکھتے ہو،\nجبکہ تم دونوں حالتوں میں اکیلے ہو؟\nپس اس کی طرف اس کے ذریعے دیکھو، تم وہی ہو جاؤ گے،\nپس جو کچھ بھی اس میں ہے، وہ تمہارے پاس ہی ہے۔\n\nاور اس مقام میں علوم میں سے یہ علم بھی ہے کہ اسباب (الأسباب) کا مسببات (المسببات) میں کیا حکم ہے، اور اسباب کی تفصیل کیا ہے، اور کیا پورا عالم ایک دوسرے کے لیے اسباب ہے؟ اور کیا اسباب میں سے کوئی عدم (العدم) بھی ہو سکتا ہے، اور وہ سبب ہو، جیسے نسبتیں (النسب) جیسے معانی کا تعلق جو اپنے تعلق سے احکام کو واجب کرتے ہیں۔ اور اس میں یہ علم بھی ہے کہ اللہ کے لیے عقلی اور شرعی طور پر کیا احکام ثابت ہیں۔ اور اس میں یہ علم بھی ہے کہ معقول مخبر (جس کی خبر دی گئی) میں خبروں کا کیا فائدہ ہے، اور کون سی خبریں علم کا فائدہ دیتی ہیں، اور کون سی گمان یا غالب گمان کا فائدہ دیتی ہیں، اور کون سی خبریں حیرت کا فائدہ دیتی ہیں، اور کون سی خبریں نظری دلائل میں قدح (نقص) پیدا کرتی ہیں کیونکہ وہ علم میں نقص پیدا کرتی ہیں۔ اور اس میں یہ علم بھی ہے کہ کیا \"مخلوق اللہ کے عیال ہیں\" کا معنی وہی ہے جو يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى الله (اے لوگو! تم اللہ کے محتاج ہو) کا معنی ہے؟ اور ان کا فقر (الفقر) کس چیز میں ہے، باوجود اس کے کہ وہ موجود ہیں اور حق (الحق) کی طرف سے ان کا علم ہے کہ وہ وجود کے بعد معدوم نہیں ہوں گے؟ بلکہ یہ ان پر احوال (الأحوال) کا پلٹنا ہے، پس ایک حال زائل ہوتا ہے اور ایک حال آتا ہے۔ اور زائل ہونے والا اپنے زوال کا حکم دیتا ہے، اور آنے والا اپنے آنے کا حکم دیتا ہے۔ اور جس پر دو حکم لگائے گئے ہیں، وہ عین میں ایک ہی ہے، جیسے کھڑا ہونے والا بیٹھ جاتا ہے۔ پس بیٹھنا آنے والا ہے اور کھڑا ہونا زائل ہونے والا ہے۔ پس کھڑے ہونے کے زائل ہونے کا حکم یہ ہے کہ وہ کھڑا نہیں ہے، اور یہ عین بیٹھنے کا حکم ہے۔ اور بیٹھنا اسے مزید احکام دیتا ہے جو کھڑے ہونے کے زائل ہونے سے نہیں سمجھے گئے، جن کی طرف وہ منتقل ہوا ہے، اور وہ یہ کہ وہ لیٹا ہوا نہیں ہے، نہ رکوع کرنے والا ہے، نہ سجدہ کرنے والا ہے، اور نہ پیٹ کے بل لیٹا ہوا ہے۔\n\nاور اس میں یہ علم بھی ہے کہ عالم سے اس چیز کے بارے میں سوال کرنے کی کیا حکمت ہے جسے وہ جانتا ہے۔ اور اس میں یہ علم بھی ہے کہ دیکھنے والے کی نظر میں ایک ہی عین (العین الواحدۃ) کا صورتوں میں بدلنا جو بصارت ادراک کرتی ہے، کیا وہ اپنی ذات میں اسی پر ہے جسے بصارت ادراک کرتی ہے یا وہ اپنی ذات میں اسی پر ہے جس پر وہ ہے اور اس کی عین نہیں بدلی؟ اور یہ اس چیز کی طرف لوٹتا ہے جو اعیان (الأعیان) میں سے دیکھی جاتی ہے اور ان پر اعیان ہونے کا حکم لگایا جاتا ہے، کہ کیا وہ اعراض (Accidents) یا جواہر (Substances) سے کثیر ہوئیں؟ کیونکہ صورتیں نظر میں ہمیشہ مختلف ہوتی ہیں، اور ہر وہ چیز جسے بصارت سے دیکھا جاتا ہے، وہ جسموں میں سے جسم ہے۔ پس جسمیت (الجسمیۃ) ایک عام حکم ہے، اور ہم اس میں مختلف صورتیں دیکھتے ہیں، جن میں سے بعض جلد زائل ہونے والی ہوتی ہیں اور بعض نظر میں دیر سے زائل ہوتی ہیں۔ اور جسم جسم ہی رہا، وہ تبدیل نہیں ہوا۔ اور جو کچھ ظاہر ہوا ہے، اس کی صفت سے موصوف صرف جسم ہی ہے۔ اور اسی طرح روحانی صورتیں اور ظہور الٰہی (التجلی الإلهي)۔ اور یہ ایک ایسا علم ہے جس میں بڑا اشکال ہے، اور فکری نظر کے ذریعے اس سے نکلنا بہت مشکل ہے۔ اور اس میں یہ علم بھی ہے کہ نائب (النائب) کے لیے کیا شرائط ہیں کہ وہ انہیں اس پر شرط کرے جس نے اسے خلیفہ بنایا ہے، باوجود اس کے کہ وہ جانتا ہے کہ وہ نائب مقرر کیے جانے میں مغلوب ہے۔ تو کیا اس کا شرط لگانا اس کے خلیفہ بنانے والے سے جہالت کی علامت ہے، یا بھول جانے کی، تو وہ اسے یاد دلاتا ہے، یا وہ اسے اس کے مصالح کا زیادہ علم دیتا ہے جتنا کہ خلیفہ بنانے والے کو ہے؟ اور اس شرط میں ہولناک امور کھلتے ہیں جو نقص پیدا کرتے ہیں۔ یا نائب جانتا ہے کہ جس نے اسے خلیفہ بنایا ہے، وہ اس سے چاہتا ہے کہ وہ اس سے سوال کرے جو اس نے اس پر شرط کیا ہے، تاکہ وہ اسے ذوقاً اپنی محتاجی دکھائے؟ کیونکہ اگر نائب کو اپنی شرط میں طلب کی گئی چیز میں استقلال حاصل ہوتا تو وہ اسے شرط نہ کرتا۔ اور اس میں یہ علم بھی ہے کہ نائب کا اپنے خلیفہ بنانے والے کو رشوت (الرشاء) پیش کرنا، اور کون سی رشوت قبول کی جاتی ہے اور کون سی نہیں قبول کی جاتی۔ اور اس میں یہ علم بھی ہے کہ خلیفہ بنانے والے کا نائب کو اس کی ہر مصلحت میں جواب دینا جو وہ سوال کرتا ہے۔\n\nاور اس میں یہ علم بھی ہے کہ استعمال کیے جانے والوں پر طعن کرنا ان کو استعمال کرنے والے کو بے وقوف بنانا ہے، اور یہ بہت خطرناک علم ہے۔ اور اسی لیے بادشاہوں اور خلفاء پر طعن کرنے سے منع کیا گیا، اور ہمیں خبر دی گئی کہ ان کے دل اللہ کے ہاتھ میں ہیں، اگر وہ چاہے تو انہیں ہم سے قبض کر لے، اور اگر چاہے تو انہیں ہم پر مہربان کر دے۔ اور ہمیں حکم دیا گیا کہ ہم ان کے لیے دعا کریں۔ اور یہ کہ عام لوگوں میں ان کے ذریعے مصلحت کا وقوع ان کے ظلم سے زیادہ ہے۔ اور ان کے ظلم کی کیا حکمت ہے، باوجود اس کے کہ وہ حقیقت میں اللہ کے نائب ہیں اپنی مخلوق پر، خواہ وہ کافر ہوں یا مومن، عادل ہوں یا ظالم؟ یہ چیز انہیں نیابت (النیابۃ) کے اطلاق سے خارج نہیں کرتی۔ تو کیا جب نائب ظلم کرتا ہے تو وہ اس نیابت سے معزول ہو جاتا ہے جس میں اس نے ظلم کیا، یا وہ نیابت سے مطلقاً معزول ہو جاتا ہے، پھر ذات حق (الحق) اس کے لیے ایک اور نئی نیابت کو تجدید کرتا ہے؟ اور اس میں یہ علم بھی ہے کہ نعمت دینے والے کا نعمت پانے والے پر نعمتوں کو گنوانا، کیا یہ نقص پیدا کرنے والی چیز ہے، یا یہ تعریف ہے تاکہ وہ اس کی قدر کو جان لے، کیونکہ اس سے ان پر شکر ادا کرنے کا مطالبہ کیا گیا ہے؟ یا کیا یہ ان کی طرف سے واقع ہونے والے کسی امر کی سزا ہے؟ یا کیا یہ تمام وجوہات اس میں جائز ہیں؟\n\nاور اس میں یہ علم بھی ہے کہ بعض مقامات پر تعلیم میں نرمی کرنا اور بعض مقامات پر سختی کرنا۔ اور اس میں یہ علم بھی ہے کہ تم کہاں سے آئے ہو اور کہاں جاؤ گے، اور کیا حقیقت میں کوئی واپسی (رجوع) ہے یا نہیں؟ یا یہ ہمیشہ کی سلوک ہے جس میں کوئی واپسی نہیں؟ اور عالم میں معقول اور محسوس کی واپسی کس نسبت الٰہیہ (نسبۃ إلهیۃ) کی طرف لوٹتی ہے؟ اور کیا ذات حق (الحق) کو واپسی کی صفت سے موصوف کیا جاتا ہے جیسا کہ ہم نے واپسی کے بارے میں کہا ہے یا نہیں؟ کیونکہ حقائق اس بات سے انکار کرتی ہیں کہ وہاں کوئی واپسی ہو۔ اور اس میں یہ علم بھی ہے کہ ناطق نفوس (النفوس الناطقۃ) کو عقول (العقول)، نہی (منع)، احکام (احکام) اور الباب (مغز) جیسے القاب سے موصوف کرنے میں کیا فرق ہے، اور یہ کس چیز کی طرف لوٹتا ہے۔ اور اس میں یہ علم بھی ہے کہ اس شخص کے لیے دلیل قائم کرنے کی کیا حکمت ہے جو یہ نہیں جانتا کہ وہ دلیل ہے، حالانکہ وہ جانتا ہے کہ وہ اس صفت سے عالم ہے۔ تو کیا وہ خود اس دلیل سے مقصود ہے یا کوئی اور؟ تو وہ اس میں ناقل (پہنچانے والا) بن جاتا ہے، اور جو شخص اس سے پہنچتا ہے وہ اس سے فائدہ اٹھاتا ہے اور اسے قبول کرتا ہے، جو اس ناقل سے پہنچا جس نے یہ نہیں جانا کہ وہ دلیل ہے۔ اور یہ اکثر ہوتا ہے۔ اور یہ نبی صلی اللہ علیہ وسلم کا قول ہے: \"بہت سے فقہ کو اٹھانے والے ایسے ہیں جو فقیہ نہیں ہوتے۔\"\n\nپس جب وہ اسے اٹھاتا ہے اور کسی فقیہ (فقہیہ) تک پہنچاتا ہے، تو وہ فقیہ اسے قبول کر لیتا ہے اور اس سے ایسا علم حاصل کرتا ہے جو اس کے پاس نہیں تھا۔ اور ناقل کو اس میں سے کسی چیز کا علم نہیں ہوتا۔ اور اس میں یہ علم بھی ہے کہ کسی شے کو دوسری شے کے نام سے موسوم کرنا جب وہ اس کے پڑوس میں ہو یا اس سے کوئی سبب ہو۔ اور اس میں یہ علم بھی ہے کہ شارع (شریعت لانے والے) نے جادوگر کو قتل کرنے کا حکم کیوں دیا، اور اسے کافر کیوں کہا گیا؟ اور جب فرعون نے موسیٰ علیہ السلام کی سچائی کو جان لیا اور اپنے دل میں ایمان کو چھپا لیا، جسے اس نے غرق ہونے کے وقت ظاہر کیا جب اس نے عذاب دیکھا، تو کیا اس نے ان جادوگروں کو قتل کیا جو ایمان لائے تھے، اس لیے کہ وہ جادوگر تھے؟ تو کیا اس نے انہیں باطنی طور پر شرعاً اور ظاہری طور پر ان کے ایمان کی وجہ سے قتل کیا؟ اور جب جادوگر کو قتل کیا جاتا ہے، تو کیا وہ قتل اس کے لیے کفارہ ہے اور اس کے جادو کی سزا ہے، اور آخرت میں اس جادو کی وجہ سے ذات حق سبحانہ و تعالیٰ کی طرف سے اس پر کوئی مطالبہ باقی نہیں رہتا؟ یا اس پر اللہ کی طرف سے کوئی مطالبہ باقی رہتا ہے؟ اور اس میں یہ علم بھی ہے کہ اللہ کے نزدیک مقربین (المقربین) کی فضیلت کس چیز سے ہے، کس چیز سے بعض نے بعض پر فضیلت حاصل کی؟\n\nاور اس میں نبی صلی اللہ علیہ وسلم کا یہ قول بھی ہے کہ مومن کو مصیبتوں اور بلاؤں سے آزمایا جاتا ہے، اور اس میں اس کے لیے سب خیر ہی ہے۔ اور اہل اللہ دنیا میں دوسروں سے زیادہ کیوں آزمائے جاتے ہیں؟ اور ان کے حق میں اس کا تقاضا کیوں لوٹتا ہے، نہ کہ دوسرے مومن لوگوں کے حق میں؟ اور اس میں یہ علم بھی ہے کہ نفوس (النفوس) کو مال کی محبت پر کیوں پیدا کیا گیا، خاص طور پر سونے کی؟ کیا اس لیے کہ اس نے معدنی کمال کا درجہ حاصل کر لیا ہے، تو کاملین کے درمیان مناسبت واقع ہوئی؟ یا کیا اس لیے کہ اس میں ان کی ضروریات پوری ہوتی ہیں، پس وہ اس کے محتاج ہیں تاکہ اس کے ذریعے اپنے مقاصد تک پہنچ سکیں؟ اور عیسیٰ علیہ السلام کا قول: \"ہر انسان کا دل وہاں ہوتا ہے جہاں اس کا مال ہوتا ہے، پس اپنے مال کو آسمان میں رکھو تاکہ تمہارے دل آسمان میں ہوں۔\"\n\nپس جس نے اپنا مال جمع کیا، اس نے اپنے دل کو اپنی طبیعت کی زمین میں دفن کر دیا، پس وہ اپنے باپ، جو روح الٰہی (الروح الإلهي) ہے، کے مشاہدے سے کبھی لذت نہیں اٹھائے گا۔ اور ایسا شخص اپنی ماں کا بیٹا ہوتا ہے، اگرچہ اس کا باپ ہو، لیکن اس کی نسبت اس کی طرف نہیں کی جاتی، جیسے عیسیٰ ابن مریم علیہ السلام کی نسبت ان کی ماں کی طرف کی جاتی ہے، حالانکہ جبرائیل علیہ السلام نے انہیں وہ ہبہ کیا تھا جب وہ لَها بَشَراً سَوِيًّا (اس کے سامنے ایک مکمل انسان کی صورت میں) متمثل ہوئے اور اسے آگاہ کیا۔ اس کے باوجود، ان کی نسبت جسمانی جگہ کی طرف ہی کی گئی، باوجود اس کے کہ وہ روح الامین (الروح الأمین) کے ہبات میں سے ہونے کی حیثیت سے مردوں کو زندہ کرتے تھے۔ اور اس میں غیرت الٰہیہ (الغیرۃ الإلهیۃ) کا علم بھی ہے، اور اس شخص سے جو اس خاص اسم میں اس کے ساتھ مقابلہ کرتا ہے جس سے اسے شرف بخشا گیا۔ اور اس میں یہ علم بھی ہے کہ سائل (سوال کرنے والے) کو اس کے سوال میں کب جواب دینا متعین ہوتا ہے جب وہ سوال کرے؟ اور کیا جو حال (الحال) سے سوال کرتا ہے، اس کا جواب حال سے دینا متعین ہوتا ہے، تاکہ جواب سوال کے مطابق ہو؟\n\nاور اس میں یہ علم بھی ہے کہ جو شخص خود سے بلند ہوتا ہے، اسے نیچے گرانا، اور جو اپنی قدر سے زیادہ بڑھتا ہے، اسے پست کرنا۔ اور اس میں یہ علم بھی ہے کہ موعظہ (نصیحت) کا کیا فائدہ ہے، اگرچہ اس کا کفر کیا جائے؟ کیونکہ سننے والے کے باطن میں اس کا اثر ہوتا ہے، اگرچہ وہ ظاہر نہ ہو، کیونکہ وہ اسے اپنی ذات سے محسوس کرتا ہے۔ اور اس میں یہ علم بھی ہے کہ جس نے کوئی چال چلنی چاہی اور اسے حق (الحق) مل گیا، تو وہ اس کے نزدیک جھوٹ ہے، پھر انجام نے ظاہر کیا کہ وہ حقیقت میں سچ تھا، لیکن اسے اس کا علم نہیں ہے۔ اور اس میں یہ علم بھی ہے کہ اوقات (الأوقات) اور ان کے ساتھ عقلی اور شرعی طور پر سلیم فکر کے نزدیک کیا معاملہ کیا جاتا ہے۔ اور اس میں یہ علم بھی ہے کہ مکارم اخلاق (اچھے اخلاق) کا تعین کیا ہے۔ اور اس میں یہ علم بھی ہے کہ اس چیز کا علم جو معلوم نہیں ہے کہ وہ معلوم نہیں ہے، وہ بھی علم ہے۔ اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و شصت و چهارم: در معرفت منزل دو راز که هر کس آن دو را بشناسد، به آسایش در دنیا و آخرت و غیرت الهی (الغيرة الإلهية) دست می‌یابد.»\n\nاگر شخصی به جای دیگری *** به احکامی قیام کند، او نایب است.\nو اگر کسی او را نایب نکرده باشد و خود به آن احکام قیام کند، *** پس هیچ شک و تردیدی برای او نیست.\nو اگر بر کسی که تجاوز کرده دعا کند، *** دعایش در حق او مستجاب می‌شود.\nبه سبب صدق وعده و اخلاص در آن، *** هرگاه اراده کند به هدف می‌زند و خود هدف قرار نمی‌گیرد.\n\n[همواره هر چیزی نزد خداوند در بندگانش بالفعل است و هیچ چیز نزد او بالقوه نیست]\n\nاین منزل، منزل بشارت الهی به آسایشی است که عنایت الهی برای بندگان صالح خدا که به آن بشارت داده شده‌اند، تا روز قیامت و در قیامت، واجب کرده است. زیرا همواره هر چیزی نزد خداوند در بندگانش بالفعل است و هیچ چیز نزد او بالقوه نیست. از این رو، تعاریف الهی به سوی او وارد شد، به آنچه خداوند در آن از افعال و احوال داشت، تا با عقل خود، شهود (الشهود) آن را از پروردگارش در خود، در حال عدمش، به یاد آورد؛ به سبب ثبوتی که قبول تصرف الهی را در او واجب کرده بود. و به واسطه آن حالت ثبوتی، امر حق (الحق) به تکوین را امتثال کرد، زیرا امر جز بر متصف به سمع وارد نمی‌شود. پس قول الهی همواره بوده و سمع ثبوتی همواره بوده است، و جز سمع وجودی که فرع سمع ثبوتی است، چیزی حادث نشده است. پس حال بر عین سمع منتقل شد، نه سمع؛ زیرا اعیان (الأعيان) از حالی به حال دیگر منقلب نمی‌شوند، بلکه احوال، احکام خود را بر آن‌ها می‌پوشانند و آن‌ها را در بر می‌گیرند. پس کسی که علم ندارد، خیال می‌کند که عین منتقل شده است. احوال، اسماء الهی (الأسماء الإلهية) را می‌طلبند، نه اینکه اعیان به طلب موصوف باشند. و برای اعیان، اسماء و قلب، بر حسب احکام احوالی که بر آن‌ها منقلب می‌شوند، حادث می‌گردد. و اگر احوال نبودند، اعیان از یکدیگر متمایز نمی‌شدند. زیرا در آنجا جز یک عین نیست که به ذات خود از واجب الوجود متمایز شده است، همان‌گونه که در وجوب ثبوت با او مشترک است. پس برای او تعالی وجوب ثبوت و وجود (الوجود) است، و برای این عین وجوب ثبوت. پس احوال برای این عین، مانند اسماء الهی برای حق (الحق) هستند. همان‌گونه که اسماء برای عین واحد، مسمی را متعدد و متکثر نمی‌سازند، احوال نیز برای این عین، آن را متعدد و متکثر نمی‌سازند، با وجود معقولیت کثرت و عدد در اسماء و احوال. و به این سبب، برای این عین صحیح است که گفته شود: «بر صورت است»، یعنی بر آنچه امر الهی بر آن است. پس این عین، کمال را به واسطه وجودی که از جمله احوالی است که بر آن منقلب شده، به دست آورده است. و هیچ نقصی از کمال برای آن نیست، مگر نفی حکم وجوب الوجود، برای تمایز بین آن و خداوند؛ زیرا آن حکم مرتفع نمی‌شود و برای آن عین در آن قدمی صحیح نیست. و برای او تمایز دیگری است، و آن این است که حق (الحق) در احوال متقلب می‌شود، اما احوال بر او متقلب نمی‌شوند؛ زیرا محال است که حال بر حق حکمی داشته باشد، بلکه حکم بر آن‌ها از آنِ او تعالی است. به همین دلیل، او در آن‌ها متقلب می‌شود و آن‌ها بر او متقلب نمی‌شوند: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (هر روز او در کاری است). زیرا اگر احوال بر او متقلب می‌شدند، احکامی را بر او واجب می‌کردند. و عین عالم این‌گونه نیست؛ احوال بر آن متقلب می‌شوند و احکام و تقلب آن‌ها بر آن به دست خداوند تعالی ظاهر می‌گردد. اما تقلب حق (الحق) در احوال، با نزول، استواء، معیت، خنده، شادی، رضایت و غضب معلوم است. و هر حالی که حق (الحق) خود را به آن وصف کرده است، او سبحانه در آن با حکم متقلب می‌شود. پس این تفاوت میان ما و حق است، و این واضح‌ترین و آشکارترین تفاوت‌هاست. پس مشارکت در احوال واقع شد، همان‌گونه که در اسماء واقع شد؛ زیرا اسماء، اسماء احوال هستند و مسمای آن‌ها عین است، همان‌گونه که برای او اسماء به نسبتی غیر از این نسبت است و مسمای آن‌ها حق (الحق) است. پس هُوَ السَّمِيعُ الْبَصِيرُ (او شنوای بیناست)، عالم و قدیر است، و تو نیز سمیع، بصیر، عالم و قدیر هستی. پس حال سمع و بصر و علم و قدرت برای ما و برای او با دو نسبت متفاوت است؛ زیرا او، اوست و ما، ماییم. ما آلات او هستیم و او آلات ما. زیرا خداوند بر زبان بنده‌اش فرمود: «خداوند دعای کسی را که او را ستایش کند، شنید.» و فرمود: فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله (پس او را پناه ده تا کلام خدا را بشنود). و (خطاب به پیامبر) فرمود: وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ (و تو پرتاب نکردی آنگاه که پرتاب کردی، بلکه خدا پرتاب کرد). و آلت، رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) است. پس تقلب برای حق (الحق) در احوال، برای آشکار ساختن اعیان آن‌هاست، مانند تقلب واحد در مراتب اعداد برای آشکار ساختن اعیان آن‌ها. و بدان که این منزل، منزل دو راز (سرين) نامیده نشد، مگر به خاطر رازی شگفت‌انگیز، و آن این است که شیء واحد، خودش آن را تثنیه می‌کند، نه دیگری، چه در محسوس و چه در معقول. اما در محسوس، آدم را آنچه از صورت حوا در دنده کوتاه چپش گشوده شد، تثنیه کرد. پس او در عین خود واحد بود و با او زوج شد، در حالی که او جز نفس خود آدم نبود که درباره‌اش گفته شد که واحد است. و اما در معقول، الوهیت غیر از ذات او تعالی نیست، و معقول الوهیت خلاف معقول ذات بودن اوست. پس الوهیت، ذات حق (الحق) را تثنیه کرد، در حالی که جز عین آن نیست. همان‌گونه که در حس، از آدم و آنچه از ذات او تثنیه شد، مردان و زنان بسیاری را بر صورت آن دو زوج پراکنده ساخت، همچنین از ذات حق تعالی و الوهیت او، عالم را بر صورت این دو معقول پراکنده ساخت. پس عالم بر صورت مؤثر و مؤثرٌفیه خارج شد، برای توالد، یعنی برای توالد اجزای آن. زیرا الوهیت، حکمی برای ذات است که در آن حکم به ایجاد عالم کرد. پس چون حکم به ایجاد عالم را تأثیر بخشید، عالم به صورت کسی که آن را ایجاد کرده، میان مؤثر و مؤثرٌفیه ظاهر شد، همان‌گونه که در محسوس رخ داد. زیرا خداوند از آدم و حوا، نه زمین و نه آسمان و نه کوه و نه غیر نوع آن‌ها را خلق نکرد، بلکه از آن دو جز مانند خودشان را در صورت و حکم خلق نکرد.\n\nآنکه هستی (الوجود) به واسطه بودنش *** ذاتی است که لفظش معنایش را تقدیس می‌کند.\nمن او را دوست دارم و قربش را *** به خود دوست دارم و هر کس او را دوست دارد، دوست دارم.\nلیلی و لبنی و رباب و زینب، *** همگی هم‌سن و سالانی هستند که از محبت من به او زنده شده‌اند.\nاگر بمیرم، وجود او با مرگ ما می‌میرد، *** پس وجود ما عین او و غیر اوست.\nشگفتا بر ما و بر او، زیرا وجود ما *** فرد است و دومی ندارد، پس چه کسی او را تثنیه کرد؟\n\nو چون اصل واحد بود و جز نفس خود آن را تثنیه نکرد، و کثرتی جز از عین آن ظاهر نشد، همچنین در هر چیزی از عالم، نشانه‌ای (آیه) برای او بود که دلالت بر واحد بودن او می‌کند. پس کل هستی (الکون) جسم و روح است، و نشأت وجود (الوجود) به واسطه آن دو برپا شده است. عالم برای حق (الحق) مانند جسم برای روح است. و همان‌گونه که روح جز از جسم شناخته نشد، زیرا وقتی به آن نگریستیم و صورتش را دیدیم، با وجود بقای آن، احکامی که از جسم مشاهده می‌کردیم، مانند ادراک محسوسات و معانی، از آن زائل شد. پس دانستیم که ورای جسم ظاهر، معنای دیگری است که احکام ادراکات را در آن به جسم داده است، و آن معنا را روح برای این جسم نامیدیم. همچنین، ما ندانستیم که امری داریم که ما را به حرکت درمی‌آورد و ساکن می‌کند و هر چه بخواهد در ما حکم می‌کند، مگر وقتی که در نفوس خود نگریستیم. پس چون نفوس خود را شناختیم، پروردگارمان را شناختیم، مانند گام به گام. و به همین دلیل در وحی خبر داد:\nبه قولش: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت).\nو در خبر نازل الهی: سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ (به زودی آیات خود را در آفاق و در نفوسشان به آن‌ها نشان خواهیم داد تا برایشان آشکار شود که او حق است). پس عالم از خداوند ظاهر نشد، مگر بر صورت آنچه امر بر آن است. و در اصل، شرافتی برای من نیست که شرور به آن مستند شوند، و عالم در قبضه خیر محض است، و آن وجود (الوجود) تام است. جز اینکه ممکن، چون به عدم نظر داشت، به همان اندازه، شر به او نسبت داده می‌شود. زیرا برای او از ذات خود، حکم وجوب الوجود لذاته نیست. پس اگر شر به او عارض شود، از آنجاست، و بر او مستمر نمی‌شود و ثابت نمی‌ماند، زیرا او در قبضه خیر محض و وجود است. سپس، از تمامیت معرفتی (المعرفة) که در علم به خداوند قرار داده شده، این است که جسم در روح، آثار معقول و معلومی دارد، به واسطه علومی که از اذواق به دست می‌آورد و جز به واسطه آن نمی‌تواند آن‌ها را بداند. و روح نیز در جسم، آثار محسوسه‌ای دارد که هر حیوانی آن را از خود مشاهده می‌کند. همچنین عالم با حق (الحق)؛ خداوند در آن آثار ظاهری دارد، و آن احوالی است که عالم در آن‌ها متقلب می‌شود، و این از حکم اسم «الدهر» اوست. و حق سبحانه خبر داد که عالم، از آن جهت که مکلف شده، آثاری دارد که اگر او آن‌ها را به ما معرفی نمی‌کرد، ما آن‌ها را نمی‌شناختیم. و آن این است که اگر از رسول او در آنچه برای ما از طاعت خدا آورده، پیروی کنیم، ما را دوست می‌دارد و از ما راضی می‌شود، پس از ما خشنود می‌گردد. و اگر با او مخالفت کنیم و امرش را امتثال نکنیم و نافرمانی کنیم، به ما خبر می‌دهد که او را به خشم آورده‌ایم و غضبناک کرده‌ایم، پس بر ما غضب می‌کند. و اگر او را بخوانیم، اجابت می‌کند. پس دعا از اثر اوست و اجابت از اثر ما. این برای آن است که بدانید او چیزی را ظاهر نکرده، مگر از صورت آنچه اوست. و محال است که امر جز این باشد، وگرنه از کجا؟ در حالی که جز او نیست. و شیء جز آنچه در قوه اوست، نمی‌دهد. و به همین دلیل، حق (الحق) خود را برای ما به صفات محدثات نزد ما وصف کرده است، در حالی که آن‌ها در حقیقت صفات او هستند که در ما ظاهر شده‌اند و سپس به او بازنگشته‌اند. و او سبحانه ما را به صفاتی وصف کرده که شایسته جلال اوست، پس آن‌ها صفات او بر حقیقت هستند. اگر ما را بر صورتی که او بر آن است، ایجاد نکرده بود، صحیح و ثابت نبود که صفتی از آنچه ما را به آن وصف کرده و حق اوست، بپذیریم، و او نیز صفتی از آنچه خود را به آن وصف کرده و حق ماست، نمی‌پذیرفت. و همه چیز حق اوست. او اصلی است که ما فرع آن هستیم، و اسماء، شاخه‌های این درخت هستند، یعنی درخت وجود (الوجود)، و ما عین ثمره هستیم، بلکه او عین ثمره است. پس برای ما مثلی جز وجود این درخت نیست. و از تمامیت معرفت (المعرفة) به خداوند، آن است که بر زبان رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) به ما خبر داد، از تحول او تعالی در صور در مواطن تجلی (التجلی)، و این اصل تقلب ما در احوال، باطناً و ظاهراً است. و همه این‌ها در او تعالی است. و همچنین او تعالی در شئون عالم است، بر حسب آنچه ترتیب حکمی اقتضا می‌کند. پس شأن فردا نمی‌تواند جز در فردا باشد، و شأن امروز نمی‌تواند جز امروز باشد، و شأن دیروز نمی‌تواند جز در دیروز باشد. این همه با نظر به او تعالی است. اما با نظر به شأن، می‌تواند در غیر وقتی باشد که در آن واقع می‌شود، اگر حق تعالی بخواهد. و در مشیت او جبر و تحیری نیست، تعالی الله از آن. بلکه مشیت او جز یک تعلق ندارد و بس. و از جمله آن، قول اوست: سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (به زودی برای شما فارغ خواهیم شد، ای دو گروه سنگین). یعنی از شما و از عالمی که غیر ماست. و ما را به «ثقلین» (دو گروه سنگین) نامید، به دلیل سنگینی که در ماست، و آن عین تأخر ما در وجود (الوجود) است، پس ما کند شدیم. و از عادت سنگین، کندی است، همان‌گونه که از عادت سبک، سرعت است. پس ما و جن از ثقلین هستیم، و ما سنگین‌تر از جن هستیم، به دلیل رکن غالبی که بر ماست، یعنی خاک. پس انسان آخرین موجود در عالم است، زیرا مختصر جز از مطول، مختصر نمی‌شود، وگرنه مختصر نیست. پس عالم، مختصر حق (الحق) است، و انسان، مختصر عالم و حق است. پس او عصاره مختصر است، یعنی انسان کامل (الإنسان الکامل). اما انسان حیوانی، مختصر عالم است. و حق (الحق) برای او فارغ می‌شود تا ترازوی آنچه برای آن خلق شده را بر او برپا کند. زیرا قول او: سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ کلمه تهدید است، و انسان کامل (الإنسان الکامل) مخاطب این خطاب نیست. جز اینکه در این کلمه، اشاره‌ای به پیوستن رحمت به آن دو، یعنی ثقلین، وجود دارد، و آن در فتح لامِ داخل بر ضمیر مخاطب در «لَكُمْ» است. اگرچه فتح الهی ممکن است با آنچه ناخوشایند است باشد، همان‌گونه که با آنچه خوشایند است می‌باشد، اما رحمت او بر غضبش پیشی گرفته است. و با آلت استقبال، یعنی سین (سَـ)، آمده است. و آخرین درجه استقبال، آن چیزی است که امر عالم به آن منتهی می‌شود، یعنی رحمتی که پس از آن غضبی نیست، به دلیل برداشته شدن تکلیف و استیفای حدود. و چون با ضمیر خطاب در قولش «لَكُمْ» آمد، و ما از کرم الهی همواره می‌دانیم که جانب سعادتمندان و جانب رحمت را بر نقیض ترجیح می‌دهد، و به همین دلیل، آنچه اهل شقاوت به واسطه آن درد می‌کشند، «عذاب» نامیده شده است، زیرا سعادتمندان، دردهای اهل شقاوت را شیرین می‌یابند، به دلیل ترجیح دادن جناب حق (الحق) در جایی که آن‌ها شرک ورزیدند. پس برای آن‌ها در اسباب دردها، نعمتی است. پس حق (الحق) آن را «عذاب» نامید، به دلیل ترجیح دادن آن‌ها، هنگامی که او را ترجیح دادند.\nبه همین دلیل، با حرف خطاب آمد تا لام را مفتوح کند و با آلت خطاب دانسته شود که آن‌ها قومی مخصوص هستند، زیرا ضمیر غایب از عالم مفقود نیست. پس ناگزیر برای او اهل است، مانند قولش در مورد سعادتمندان: لَهُمْ جَنَّاتٍ تَجْرِي (برای آن‌ها باغ‌هایی است که نهرها در زیر آن جاری است). پس با ضمیر غایب آمد، و آن‌ها از این مخاطبان غایب شدند. و فتح لام، فتح رحمتی است که قرائن احوال آن را می‌بخشد. و برای این اداه، مراتبی است که حق (الحق) با آن‌ها با بندگانش رفتار می‌کند، مانند قولش: وإِنَّهُمْ عِنْدَنا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيارِ (و آنان نزد ما از برگزیدگان نیکوکارند). و مانند قولش: ما كانَ الله لِيَذَرَ الْمُؤْمِنِينَ عَلى‏ ما أَنْتُمْ عَلَيْهِ (خداوند مؤمنان را بر آنچه شما بر آن هستید رها نمی‌کند). و ما كانَ الله لِيُضِيعَ إِيمانَكُمْ (و خداوند ایمان شما را ضایع نمی‌کند). و سَخَّرَ لَكُمْ ما في السَّماواتِ وما في الْأَرْضِ (و آنچه در آسمان‌ها و آنچه در زمین است را برای شما مسخر کرد). و خَلَقَ لَكُمْ ما في الْأَرْضِ (و آنچه در زمین است را برای شما خلق کرد). و لَهُ ما في السَّماواتِ وما في الْأَرْضِ وما بَيْنَهُما وما تَحْتَ الثَّرى‏ (و آنچه در آسمان‌ها و آنچه در زمین و آنچه میان آن دو و آنچه زیر خاک است، از آن اوست). پس از آنِ اوست و از آنِ ما. با این حال، ادب ما را ملزم می‌کند. و با ادب است که صاحبان قدرت، همنشینان بدون انبساط (گشاده‌رویی بیش از حد) هستند. زیرا شهود (الشهود) و انبساط با هم جمع نمی‌شوند. برخی گفته‌اند: «بر بساط بنشین و از انبساط بپرهیز.»\n\nمن کسی را پرستیدم که امرش برای من شایسته نیست، *** و کسی را که به صورتش وصف شده‌ام، نمی‌پرستم.\nزیرا او این را گفت، من نگفتم، *** و صورت حال من جز صورت او نیست.\n\nزیرا فرومایه پست، اگر صفات شریفی که شایسته مقامش نیست به او نسبت داده شود، از آن بیزاری می‌جوید، زیرا با آن هجو شده است، همان‌گونه که شریف از اینکه به کمتر از آنچه شرفش شایسته آن است، وصف شود، بیزاری می‌جوید.\n\n(وصل) [تفاوت میان ولی و نبی]\n\nاما کسانی از اصحاب ما که گفتند و به آن رفتند، مانند امام ابوحامد غزالی و دیگران، که تفاوت میان ولی و نبی، نزول ملک (فرشته) است؛ زیرا ولی مُلهَم است و نبی ملک بر او نازل می‌شود، با وجود اینکه نبی در اموری مُلهَم نیز هست، زیرا او جامع میان ولایت و نبوت است؛ این نزد ما غلطی است از سوی گویندگان آن و دلیلی بر عدم ذوق گویندگان آن. تفاوت تنها در چیزی است که ملک با آن نازل می‌شود، نه در نزول ملک. پس آنچه ملک بر رسول و نبی نازل می‌کند، خلاف چیزی است که ملک بر ولیِ تابع نازل می‌کند. زیرا ملک ممکن است بر ولیِ تابع، به واسطه تبعیت و برای فهماندن آنچه نبی آورده و این ولی به علم آن متحقق نشده است، نازل شود، اگرچه از نظر زمانی متأخر از او باشد، یعنی متأخر از زمان وجود او. ممکن است ملک بر او نازل شود تا صحت و سقم آنچه نبی آورده و بر او وضع شده یا توهم شده که صحیح است، یا به دلیل ضعف راوی ترک شده، در حالی که در نفس الامر صحیح است، را به او بشناساند. و ممکن است ملک بر او نازل شود با بشارت از جانب خداوند که او از اهل سعادت و رستگاری است و با امان، همه این‌ها در زندگی دنیا. زیرا خداوند عز و جل می‌فرماید: لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا (برای آن‌ها در زندگی دنیا بشارت است). و درباره اهل استقامت که به ربوبیت خداوند قائل شدند، فرمود که فرشتگان بر آن‌ها نازل می‌شوند. خداوند تعالی می‌فرماید: إِنَّ الَّذِينَ قالُوا رَبُّنَا الله ثُمَّ اسْتَقامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ أَلَّا تَخافُوا ولا تَحْزَنُوا وأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ نَحْنُ أَوْلِياؤُكُمْ في الْحَياةِ الدُّنْيا (همانا کسانی که گفتند پروردگار ما الله است، سپس استقامت ورزیدند، فرشتگان بر آن‌ها نازل می‌شوند که نترسید و غمگین نباشید و به بهشتی که به شما وعده داده شده، بشارت باد. ما دوستان شما در زندگی دنیا هستیم). و از اولیاء الله کسانی هستند که از جانب خداوند، ذوق انزال در تنزیل را دارند. آنچه بر قائلین به خلاف این عارض شده، جز از اعتقاد آن‌ها در نفوسشان نیست که گمان کرده‌اند با سلوک خود، همه راه‌ها و مقامات را فرا گرفته‌اند و هیچ مقامی نمانده مگر اینکه در آن ذوقی دارند، و ندیده‌اند که ملکی بر آن‌ها نازل شده باشد. پس اعتقاد کردند که این از مختصات نبی است. پس ذوق آن‌ها صحیح است و حکم آن‌ها باطل. و آن‌ها می‌گویند که اگر کسی از آن‌ها با افزایشی بیاید، پذیرفته می‌شود، زیرا او عادل و صاحب ذوق است. نزد آن‌ها جرح و طعنی نیست و از ذوق خود تجاوز نمی‌کنند. از آنجاست که این غلط واقع شده است. اگر از اهل الله که پیش از آن‌ها بودند یا در زمان آن‌ها بودند، قول به نزول ملک بر ولی به آن‌ها می‌رسید، آن را می‌پذیرفتند و رد نمی‌کردند، به دلیل رفع تهمت از هم‌شکلان و امثالشان. اگر یکی از اهل الله، از اهل اشارات که صاحبان ندا در رأس بُعد هستند، بگوید که تو گفتی هیچ حقیقتی و نسبتی در عالم نیست، مگر اینکه از یک نسبت الهی صادر شده است، و از نسبت‌های عالم، افتقار است. و ابویزید که از اهل کشف (الکشف) و وجود (الوجود) است، گفت که خداوند در برخی از مشاهداتش با او فرمود: «به سوی من تقرب جوی به آنچه برای من نیست: ذلت و افتقار.»\n\n[اینکه حق تعالی دارای رحمت، عفو، کرم و مغفرت است]\n\nپس ای جوینده فایده، بدان که حق تعالی (الحق تعالی) دارای رحمت، عفو، کرم و مغفرت است، و آنچه از اسماء حسنای او آمده، حقیقتاً از آن او تعالی است. و همچنین او دارای انتقام و بطش شدید است. پس او سبحانه رحیم، عفو، کریم، غفور و صاحب انتقام است. و محال است که آثار این اسماء در او باشد یا او محل آثار آن‌ها باشد. پس رحیم به چه کسی؟ عفو از چه کسی؟ کریم بر چه کسی؟ و غفور برای چه کسی؟ و صاحب انتقام از چه کسی؟ پس ناگزیر باید گفت که خداوند خالق، مخلوق را می‌طلبد و مخلوق، خالق را می‌طلبد. و صفت طالب معروف است. و حاصل، نفی نمی‌شود. پس عالم ناگزیر است، زیرا حقایق الهی آن را می‌طلبند. و ما برای تو بیان کردیم که معقولیت ذات بودن او، معقولیت اله بودن او نیست. پس مرتبه تثنیه شد، در حالی که در وجود عینی جز عین نیست. پس او از حیث ذات، از عالمیان بی‌نیاز است، و از حیث اسماء حسنی که عالم را به دلیل امکانش می‌طلبند تا آثارشان در آن ظاهر شود، وجود عالم را می‌طلبد. اگر عالم موجود بود، وجودش را نمی‌طلبید. پس اسماء برای او مانند خانواده هستند، و صاحب خانواده برای خانواده‌اش تلاش می‌کند. و خلق، خانواده دورتر خداوند هستند و اسماء، خانواده نزدیک‌تر. پس عالم به دلیل امکانش از او سؤال کرد، و اسماء برای ظهور آثارشان از او سؤال کردند. و سؤال جز در مورد چیزی که وجود ندارد، نیست. پس وجود عالم ضروری است. و کتاب حاکم است و علم سابق و مشیت محقق‌کننده. پس محال است که واقع نشود. و تکفیر تنها در مورد طایفه‌ای واقع شد که گفتند: إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ (خداوند فقیر است و ما بی‌نیازیم)، به دلیل مجموع کلامشان. زیرا آن‌ها از خداوند بی‌نیاز نیستند و حق (الحق) از ایجاد آن‌ها و از گسترش نعمت‌ها بر آن‌ها تأخیر نمی‌کند، که این فضلی و منتی از اوست، به حکم کتابی که سبقت گرفته است. خداوند تعالی فرمود: لَوْ لا كِتابٌ من الله سَبَقَ لَمَسَّكُمْ فِيما أَخَذْتُمْ عَذابٌ (اگر کتابی از جانب خدا سبقت نگرفته بود، به خاطر آنچه گرفتید، عذابی به شما می‌رسید). پس حکم از آنِ کتاب است. و نسبت کتاب، نسبت ذات نیست. و تعیین اجرای حکم در مورد کسی که حکم بر او اجرا می‌شود، از آنِ کتاب است، مانند سادن (کلیددار) و متصرف به حکم جبر مرتبه. این را حقایق به خودی خود می‌دهند و آن‌ها تغییر نمی‌کنند. و اگر حقایق تغییر می‌کردند، نظام مختل می‌شد و علمی اصلاً وجود نداشت، نه حق و نه خلق. اگر عاقل در حکمت خطاب الهی در قول او تعالی: سَنَكْتُبُ ما قالُوا (به زودی آنچه را گفتند خواهیم نوشت) نظر کند، و آن را از قول او: كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ (پروردگارتان رحمت را بر خود واجب کرده است) بگیرد، یعنی آن را بر خود واجب کرد، زیرا جز او تعالی، واجب‌کننده‌ای نیست. پس فرمود: آنچه را گفتند، در آنچه ضررش به خودشان بازمی‌گردد، واجب خواهیم کرد. و در ادامه آیه فرمود: ونَقُولُ ذُوقُوا عَذابَ الْحَرِيقِ (و می‌گوییم عذاب سوزان را بچشید)، به عنوان عقوبت برای گفتارشان. و به همین دلیل، تحقق کفر آن‌ها به دلیل مجموع کلامشان بود، زیرا آن‌ها بی‌نیاز نیستند. پس این روح این آیه است. و اما احتجاج تو به آنچه به ابویزید گفته شد، آن نیز عین مجموع است. او تنها «ذلت» را نگفت، بلکه گفت: «ذلت و افتقار». و نسبت مجموع، نسبت افراد نیست. اگر ممکن نبود، اثری برای اسماء الهی (الأسماء الإلهية) ظاهر نمی‌شد. و اسم، عین مسمی است، به ویژه اسماء الهی. پس وجود (الوجود)، طالب و مطلوب است، و متعلق طلب، عدم است. یا اعدام موجود، یا ایجاد معدوم. خداوند تعالی فرمود: الله لا إِلهَ إِلَّا هُوَ (الله، معبودی جز او نیست). پس جز الوهیت را نفی نکرد که صفتی برای بیش از یک نفر باشد. پس برای اسماء الهی یا مرتبه‌ای که مرتبه مسمای «إله» است، تصریف و حکم در مورد کسی که به آن وصف شده، وجود دارد. پس به واسطه آن تصرف می‌کند و برای آن تصرف می‌کند، در حالی که در حال تصرفش، از عالمیان بی‌نیاز است و وجود او ضروری است. پس بنگر که این امر در ذات خود چقدر شگفت‌انگیز است. و از اینجا قول ابوسعید خراز شناخته می‌شود که او خداوند را نشناخت، مگر با جمع میان دو ضد. سپس تلاوت کرد: هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ (او اول است و آخر و ظاهر و باطن). و اما قول یهود در مورد بخل: يَدُ الله مَغْلُولَةٌ (دست خدا بسته است)، خداوند تعالی در مورد آن‌ها فرمود: غُلَّتْ أَيْدِيهِمْ ولُعِنُوا بِما قالُوا (دست‌هایشان بسته باد و به سبب آنچه گفتند، لعنت شدند). یعنی از صفت کرم الهی دور شدند. زیرا گفتار آن‌ها از اعمال آن‌هاست. پس دست‌هایشان بسته شد و بخلی که به خداوند نسبت دادند، به واسطه خودشان واقع شد. پس از خداوند جز آنچه گفتند، مشاهده نکردند. پس طعم آنچه را آوردند، به آن‌ها چشاند. و خداوند پس از آن، آن‌ها را در مال تکذیب کرد. پس کرم را با رحمتی که وَسِعَتْ كُلَّ شَيْ‏ءٍ (همه چیز را فرا گرفته است) بر آن‌ها گسترد، تا به آن‌ها بشناساند که دروغگو بودند. و این شدیدترین عذاب بر آن‌ها و شدیدترین نعمت است. زیرا وقتی جود و کرم را بر آن‌ها گسترد، جهل خود را دانستند و آن را تصور کردند. پس نفوسشان با تصور حالی که بر آن بودند، یعنی جهل به خداوند، عذاب کشیدند و با از بین رفتن آن و وقوف بر علم، متنعم شدند. و دانستند که جهلشان، دروغ بستن بر خداوند را برایشان به ارث گذاشت: بَلْ يَداهُ مَبْسُوطَتانِ يُنْفِقُ كَيْفَ يَشاءُ (بلکه دو دست او گشاده است، هرگونه که بخواهد انفاق می‌کند). پس حکم از آنِ مشیت است، پس بفهم. و مشیت او غیر از ذات او نیست. پس اسماء او عین او هستند و احکام آن‌ها حکم اوست. و عالم جز به واسطه قوایی که بر آن است، ظاهر نشد.\n\nپس به او بنگر تا او باشی، *** و از حد خود تجاوز مکن.\nزیرا هر آنچه در اوست، *** همانا نزد توست.\nهر کس خداوند را آن‌گونه که شایسته اوست قدر بداند، *** امر وجود (الوجود) را از او آشکار می‌سازد.\nپس هر امری که می‌بینی، عین *** کسی است که علمش در آن است، پس آن از اوست.\nپس عین او، عین کسی است که او را می‌بینی، *** به همین دلیل، هستی (الوجود) کنه ندارد.\n\nپس اگر بگویی «الله»، آن مجموع حقایق همه اسماء الهی (الأسماء الإلهية) است. پس محال است که به طور مطلق گفته شود، و ناگزیر باید احوال آن را مقید کنند. و اگر الفاظ آن را مقید کنند، به حکم تبعیت از احوال است. پس هرگاه چیزی به او اضافه شد، بنگر که کدام اسم شایسته آن اضافه است. پس مطلوب از خداوند در آن امر، جز اسمی که آن اضافه را تخصیص می‌دهد و حقیقت الهی که آن را می‌طلبد، نیست. پس از آن تجاوز مکن. و کسی که حالش این باشد، حق خداوند را ادا کرده و قدر او را به طور اجمالی دانسته است. زیرا قدر او به طور تفصیلی دانسته نمی‌شود، چون افزایش علم به خداوند در دنیا و آخرت قطع نمی‌شود. پس امر در این باره نامتناهی است. آیا ندیدی که خداوند تعالی موسی (علیه السلام) را با رسالتی به سوی فرعون فرستاد که از جمله آن این بود که اگر فرعون به او گفت: فَما بالُ الْقُرُونِ الْأُولى‏ (پس حال قرون اولیه چیست؟)، بگوید: عِلْمُها عِنْدَ رَبِّي في كِتابٍ لا يَضِلُّ رَبِّي ولا يَنْسى‏ (علم آن نزد پروردگار من در کتابی است که پروردگارم گمراه نمی‌شود و فراموش نمی‌کند). یعنی آنچه را بر خود واجب کرده است. پس آن را در لوح محفوظ ننوشت، مگر برای اینکه کسی که شأنش این است که جز با اعلام نداند، بداند، نه برای اینکه آنچه را بر خود واجب کرده و اوقاتش در مدت‌های طولانی در پیش است، به یاد آورد. زیرا او سبحانه لا يَضِلُّ رَبِّي (پروردگارم گمراه نمی‌شود) که من از نزد او آمده‌ام تا تو را به عبادتش دعوت کنم، ولا يَنْسى‏ (و فراموش نمی‌کند). و تعالی درباره خود فرمود: نَسُوا الله فَنَسِيَهُمْ (خداوند را فراموش کردند، پس او نیز آن‌ها را فراموش کرد). و آن‌ها او را به طور مطلق فراموش نکردند، پس او نیز آن‌ها را به طور مطلق فراموش نمی‌کند. بلکه او آن‌ها را در آنچه فراموش کردند، فراموش می‌کند؛ چیزی که اگر به آن علم داشتند، رحمت از رحیم به واسطه آن به آن‌ها می‌رسید. پس چون آن را فراموش کردند، رحیم آن‌ها را فراموش کرد، زیرا اسم الهی که آن‌ها در عملی بودند که آن اسم به آن دعوت می‌کرد، متولی آن‌ها شد. پس وقتی عدل ترازوی آن در مورد آن‌ها به پایان رسید، نسیان زائل می‌شود، زیرا زوال آن هنگام برداشته شدن پرده در هنگام مرگ در دنیا ضروری است. پس هیچ‌کس از اهل تکلیف نمی‌میرد، مگر مؤمن، از روی علم و عیان محقق که در آن شک و تردیدی نیست، به ویژه علم به خداوند و ایمان به او. این همان چیزی است که عمومیت دارد. پس هیچ بأس (سختی) شدیدتر از مرگ نیست. و اما اینکه آیا آن ایمان برای اهلش نفعی دارد یا نه، در رفع عقوبت از آن‌ها، خیر، مگر کسی که خداوند او را استثناء کرده باشد، مانند قول او تعالی: فَلَمْ يَكُ يَنْفَعُهُمْ إِيمانُهُمْ لَمَّا رَأَوْا بَأْسَنا (پس ایمانشان هنگامی که عذاب ما را دیدند، برایشان سودی نداشت). سپس فرمود، و این محل استشهاد ماست: سُنَّتَ الله الَّتِي قَدْ خَلَتْ في عِبادِهِ (سنت خداوندی که در میان بندگانش جاری بوده است). و اما استثناء، قول او تعالی است: إِلَّا قَوْمَ يُونُسَ لَمَّا آمَنُوا كَشَفْنا عَنْهُمْ عَذابَ الْخِزْيِ في الْحَياةِ الدُّنْيا ومَتَّعْناهُمْ إِلى‏ حِينٍ (مگر قوم یونس، هنگامی که ایمان آوردند، عذاب رسوایی را در زندگی دنیا از آن‌ها برداشتیم و تا مدتی آن‌ها را بهره‌مند ساختیم). پس حکمی بر خداوند در خلقش نیست. و اما نفع آن ایمان در عاقبت، پروردگار تو فَعَّالٌ لِما يُرِيدُ (هر چه بخواهد انجام می‌دهد) است. و او تعالی می‌فرماید: إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً (همانا خداوند همه گناهان را می‌آمرزد). پس این قول اوست که در کتابش و بر زبان رسولانش (ع) به ما عهد کرده است.\n\nحق (الحق) در آنچه رسولی از ملأ اعلی به قلبم آورد، آشکار شد.\nپس مرا از امر از نیمه آن خبر داد، و من *** در امور نه به «شایسته‌تر» می‌گویم و نه به «اولی».\nبلکه امر در آن یکی است و غیر آن نیست، *** پس عالمی که کهنه می‌شود و عالمی که کهنه نمی‌شود.\nو آن فرقانی است که دلیلش را بیان می‌کند، *** و قرآنی نیست که بر قلب ما تلاوت شود.\nو اگرچه قول خداوند در هر حالتی *** بر من است، هنگامی که به محضرش می‌آیم، املاء می‌کند.\nو خلق من شگفت‌انگیز است که پیوسته تجدید می‌شود، *** و آنچه از آن گذشته، زائل نمی‌شود و کهنه نمی‌گردد.\nپس حکم حکیم حق (الحق) در خلق ظاهر است، *** پس منزه است کسی که کور کرد و منزه است کسی که آشکار ساخت.\nهمانا انعام او با شهودش (الشهود) بر من بخشش کرد، *** و مرا به شیرین‌ترین آبشخورش مخصوص گردانید.\n\nپس هر کس تقوای خدا پیشه کند، خداوند برای او فرقان (تمییز دهنده حق از باطل) قرار می‌دهد، اگرچه در عین قرآن عزیز باشد که جمع است، مانند جمع کردن آب در حوض. پس هر فرقانی قرآن نیست، اما هر قرآنی فرقان است.\n\nپس عین جمع، عین فرق است، پس بنگر *** با چشمت به اجتماع در افتراق.\nپس مثل، عین مثل نیست، پس حکم کن *** بر آن به فراق و به تلاقی.\nو اگر بخواهیم، هنگامی که در آن فکر کنی، *** حکم به نکاح و طلاق می‌کنیم.\nو اگر حق (الحق) نبود، هماهنگی وجود نداشت، *** پس ساق حق به ساق من پیچیده است.\nو هنگام گریز ما از او، مرا خواند، *** تا بدانم که در عاقبت، مسیر من است.\nبه سوی او در جسم‌هایی از نبات، *** پس اگر پاکیزه شویم، مشک در جعبه‌ها هستیم.\n\nفَرِيقٌ في الْجَنَّةِ وفَرِيقٌ في السَّعِيرِ (گروهی در بهشت و گروهی در آتش سوزان). پس واحد از کسی که او را تثنیه کرد، متمایز شد. پس هر گروهی به فردیت و جامعیت خود منفرد شد. پس برخی از آن‌ها با انفراد به فردیت و احدیت خود مأنوس شدند، و برخی در انفراد به فردیت و احدیت خود به وحشت افتادند. و آن نزد عارفان، وحشت حجاب است.\n\nپس کدام نعمتی است که روزگار آن را مکدر نمی‌سازد؟ *** و برای خداوند است در آنچه گفتم، خلق و امر.\nو اگر وجود حق (الحق) نبود، خیر او نبود، *** و اگر وجود من نبود، شر در میان خلق دیده نمی‌شد.\nو من غیر او نیستم، اگر حقیقتم آشکار شود، *** اما او پنهان کرد، پس شأن من برای او پرده است.\nپس هر کس صورت مرا محقق کند، *** برای او از نشأت من، درّ و درّ (مروارید) آشکار می‌شود.\nپس مروارید است، نه سنگ‌هایی که با نشأت من رقابت کنند، *** و برای علم از آن، چیزی است که مروارید می‌بخشد.\nپس اگر صاحب عقل باشی، حکم آن را درمی‌یابی، *** و اگر صاحب عین باشی، پرده برداشته شده است.\nپس اگر خواستی، به آن شراب ناب مهر و موم شده اشاره کن، *** و اگر شراب نخواستی، نوشیدنی تو آبجو است.\nپس منزه است کسی که قلب را با ذکر خود زنده کرد، *** و اگر ذکری نبود، فکر به جای آن برمی‌خاست.\n\n[ثبوت علم بر صورت خود]\n\nو بدان، خداوند تو را با روحی از جانب خود تأیید کند، که من ثبوت علم را بر صورتش که تغییر نمی‌کند، جز در این منزل ندیدم. پس به من اطمینان داد در آنچه دانستم که زائل نمی‌شود و شبهات آن را متزلزل نمی‌کند. و اگر شبهه‌ای برای کسی که این امر را در این منزل مشاهده کرده، بیاید، آن را شبهه‌ای می‌بیند که نمی‌تواند صورتش را برای او تغییر دهد، برخلاف کسی که این منزل را ندارد. زیرا او متزلزل می‌شود و آن تزلزل او را به نظر در آنچه قطع کرده بود که می‌داند، می‌کشاند، و نمی‌داند آیا علم اول شبهه بوده یا شهود (الشهود) شبهه است یا هر دو امر شبهه‌اند، پس متحیر می‌شود. و این به دلیل آن است که او در علمش به امور بر بصیرت نیست، زیرا آن‌ها را با فکر خود تولید کرده است. اما وقتی امور به خودی خود بیایند، نه با جعل و ایجاد تو، حقایق خود را به تو می‌دهند و آن‌ها را بر آنچه هستند، می‌دانی. و آیات بسیاری از قرآن عزیز به این منزل تعلق دارد. اگر کلام را در آن‌ها بسط می‌دادیم، طولانی می‌شد. پس برخی از آیات را ذکر می‌کنیم، نه همه آن‌ها را، و آن‌ها را شرح نمی‌دهم، بلکه تنها برای عقول سلیم و دیده‌های نافذ به آن‌ها اشاره می‌کنم. از جمله آن: ولِلَّهِ مُلْكُ السَّماواتِ والْأَرْضِ (و ملک آسمان‌ها و زمین از آن خداست). و از جمله آن: لَهُ الْمُلْكُ ولَهُ الْحَمْدُ وهُوَ عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ (پادشاهی از آن اوست و ستایش از آن اوست و او بر هر چیزی تواناست) در سوره تغابن. و از جمله آن: وقالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِي ولَكَ (و زن فرعون گفت: مایه روشنی چشم من و توست). و از جمله آن: وَيْلٌ لِلْمُطَفِّفِينَ (وای بر کم‌فروشان). و از جمله آن: فَوَيْلٌ لِلْمُصَلِّينَ (پس وای بر نمازگزاران). و از جمله آن: فَوَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ (پس وای در آن روز بر تکذیب‌کنندگان) هر جا که واقع شده است. و از جمله آن: وتَاللَّهِ لَأَكِيدَنَّ أَصْنامَكُمْ بَعْدَ أَنْ تُوَلُّوا مُدْبِرِينَ (و به خدا سوگند، پس از آنکه پشت کنید و بروید، برای بت‌های شما تدبیری خواهم اندیشید). و از جمله آن: ولَئِنْ سَأَلْتَهُمْ من خَلَقَهُمْ لَيَقُولُنَّ الله (و اگر از آن‌ها بپرسی چه کسی آن‌ها را آفریده است، قطعاً می‌گویند: الله)، که این زمینه‌سازی برای سعادت آن‌هاست. و از جمله آن: لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ (امر از پیش و پس از آن، از آن خداست). پس با این آیه آغاز شد تا دانسته شود که امر نسبت به او بر چه صورتی است. و از جمله آن: إِنَّ رَبَّهُمْ بِهِمْ يَوْمَئِذٍ لَخَبِيرٌ (همانا پروردگارشان در آن روز به آن‌ها آگاه است). پس به «خبرت» اکتفا کرد، زیرا هر خبرتی علم است. و از جمله آن: ولَوْ شاءَ الله لَجَمَعَهُمْ عَلَى الْهُدى‏ (و اگر خدا می‌خواست، قطعاً آن‌ها را بر هدایت جمع می‌کرد). پس با حرف امتناع برای امتناع آمد. و از جمله آن: ولَوْ لا أَنْ يَكُونَ النَّاسُ أُمَّةً واحِدَةً لَجَعَلْنا لِمَنْ يَكْفُرُ بِالرَّحْمنِ لِبُيُوتِهِمْ سُقُفاً من فِضَّةٍ ومَعارِجَ عَلَيْها يَظْهَرُونَ (و اگر نه این بود که مردم امتی واحد شوند، برای خانه‌های کسانی که به رحمان کفر می‌ورزند، سقف‌هایی از نقره و نردبان‌هایی که بر آن‌ها بالا روند، قرار می‌دادیم). و از جمله آن: إِنَّ السَّاعَةَ آتِيَةٌ أَكادُ أُخْفِيها لِتُجْزى‏ كُلُّ نَفْسٍ بِما تَسْعى‏ (همانا قیامت آمدنی است، نزدیک است آن را پنهان کنم، تا هر کس به آنچه تلاش می‌کند، جزا داده شود). و از جمله آن: وكَذلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِيَقُولُوا أَ هؤُلاءِ من الله عَلَيْهِمْ من بَيْنِنا (و این‌گونه برخی از آن‌ها را با برخی دیگر آزمودیم تا بگویند: آیا این‌ها کسانی هستند که خداوند از میان ما بر آن‌ها منت نهاده است؟). و از جمله آن: ما كانَ الله لِيَذَرَ الْمُؤْمِنِينَ عَلى‏ ما أَنْتُمْ عَلَيْهِ (خداوند مؤمنان را بر آنچه شما بر آن هستید رها نمی‌کند) تا آخر آیه. و از جمله آن: ثُمَّ لْيَقْضُوا تَفَثَهُمْ ولْيُوفُوا نُذُورَهُمْ ولْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ (سپس باید آلودگی‌های خود را برطرف کنند و نذرهای خود را وفا کنند و بر گرد خانه عتیق طواف کنند). و از جمله آن: لَتُؤْمِنُنَّ به ولَتَنْصُرُنَّهُ (قطعاً به او ایمان می‌آورید و قطعاً او را یاری می‌کنید). و از جمله آن: وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ (و بگو: حق از جانب پروردگار شماست، پس هر کس خواست ایمان بیاورد و هر کس خواست کفر بورزد) تا آخر آیه. و از جمله آن: وإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ (و همانا او در دوست داشتن خیر، سخت‌گیر است). و از جمله آن: يَوْمَئِذٍ تُحَدِّثُ أَخْبارَها بِأَنَّ رَبَّكَ أَوْحى‏ لَها (در آن روز زمین اخبار خود را بازگو می‌کند، زیرا پروردگارت به او وحی کرده است). و از جمله آن: أَ فَمَنْ يَمْشِي مُكِبًّا عَلى‏ وَجْهِهِ أَهْدى‏ (آیا کسی که به رو افتاده راه می‌رود، هدایت یافته‌تر است؟) و او کسی است که از صراط به رو در آتش می‌افتد، در حالی که از موحدین است. و از جمله آن: وهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ من بَعْدِ ما قَنَطُوا ويَنْشُرُ رَحْمَتَهُ (و او کسی است که باران را پس از آنکه ناامید شدند، نازل می‌کند و رحمت خود را می‌گستراند). و از جمله آن: إِنَّ في ذلِكَ لَعِبْرَةً لِأُولِي الْأَبْصارِ (همانا در آن عبرتی است برای صاحبان بینش)، یعنی شگفتی. و از جمله آن: فَمَنْ يَكْفُرْ بَعْدُ مِنْكُمْ فَإِنِّي أُعَذِّبُهُ عَذاباً لا أُعَذِّبُهُ أَحَداً من الْعالَمِينَ (پس هر کس از شما پس از آن کفر ورزد، او را عذابی می‌کنم که هیچ‌کس از جهانیان را آن‌گونه عذاب نکرده‌ام). و از جمله آن: وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ (و او با شماست هر جا که باشید). پس در منازل این آیات و امثال آن‌ها تدبر کن. و از اینجا قدرت الف و لام را که برای عهد و تعریف و جنس است، و الحاق لام الف به حروف را می‌شناسی. و حروف بر دو قسم هستند: حروف هجاء که حروف اصلی هستند، و حروف معانی. و هر دوی آن‌ها در رقم به وضع و در لفظ به طبع در انسان هستند. و همه آن‌ها از تو و در تو هستند، و هیچ امری خارج از تو نیست. پس امید نداشته باش که خودت را با غیر خودت بشناسی، زیرا در آنجا غیر تو نیست. پس تو دلیل بر خودت و بر او هستی، و کسی نیست که دلیل بر تو باشد.\n\nکیست که پس از تو به او امید داشته باشی، *** در حالی که تو در هر دو حالت تنهایی؟\nپس به او بنگر تا او باشی، *** زیرا هر آنچه در اوست، نزد توست.\n\nو در این منزل از علوم، علم احکام اسباب در مسببات و تفصیل اسباب وجود دارد. و اینکه آیا عالم تماماً اسباب برخی برای برخی دیگر است؟ و آیا از اسباب، چیزی هست که عدم باشد و آن سبب است، مانند نسبت‌ها، چون تعلقات معانی که احکامی را به واسطه تعلقشان ایجاب می‌کنند؟ و در آن، علم آنچه برای خداوند از احکام عقلاً و شرعاً ثابت شده، وجود دارد. و در آن، علم فایده اخبار در مُخبَر معقول است. و اینکه کدام اخبار علم‌آورند، از اخباری که ظن یا غلبه ظن می‌آورند، از اخباری که حیرت می‌آورند، از اخباری که به دلیل قدح در علم، در ادله نظری قدح می‌کنند. و در آن، علم «خلق، خانواده خدا هستند» وجود دارد. آیا معنای آن، معنای يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله (ای مردم، شما نیازمندان به خدا هستید) است؟ و فقر در چه چیزی است، با وجود اینکه آن‌ها موجودند و علم دارند از حق (الحق) که پس از وجودشان معدوم نمی‌شوند؟ بلکه آن، تقلب احوال بر آن‌هاست. پس حالی زائل می‌شود و حالی می‌آید. و زائل‌شونده، زوال خود را حکمی می‌دهد و آینده، آمدن خود را حکمی می‌دهد. و محکوم به هر دو حکم، عین واحد است، مانند کسی که ایستاده و می‌نشیند. پس نشستن می‌آید و ایستادن زائل می‌شود. پس حکم زوال ایستادن، این است که او ایستاده نیست، و این عین حکم نشستن است. و نشستن، احکامی را به او اضافه می‌کند که از زوال ایستادن فهمیده نمی‌شد، و آن احکام این است که او نه خوابیده است، نه رکوع‌کننده، نه سجده‌کننده و نه درازکش. و در آن، علم حکمت استفهام از عالم درباره آنچه می‌داند، وجود دارد. و در آن، علم اینکه چرا آنچه بصر از تحول عین واحد در صور ادراک می‌کند، در نظر بیننده به خود عین بازمی‌گردد؟ آیا آن عین در ذات خود بر صورتی است که بصر آن را ادراک می‌کند، یا بر صورتی است که در ذات خود بر آن است و عینش منقلب نشده است؟ و این به آنچه از اعیان دیده می‌شود و بر آن‌ها حکم می‌شود که اعیان هستند، بازمی‌گردد. آیا به واسطه اعراض یا جواهر متکثر شده‌اند؟ زیرا صور در نظر دائماً مختلف هستند. و هر آنچه با بصر دیده می‌شود از اجسام، جسم است. پس جسمیت حکم عام است، و ما در آن صور مختلفی می‌بینیم که برخی از آن‌ها سریع الزوال هستند و برخی در نظر کند می‌شوند. و جسم، جسم است و تبدیل نشده است. و موصوف به آنچه ظاهر شده، جز جسم نیست. و همچنین صور روحانی و تجلی الهی (التجلی الإلهي). و این علمی است که در آن اشکال عظیمی است و رهایی از آن از طریق نظر فکری بسیار دشوار است. و در آن، علم شروطی که نایب می‌تواند بر کسی که او را خلیفه کرده، شرط کند، با علم به اینکه او در اقامتش به عنوان نایب مقهور است، وجود دارد. آیا شرط کردن او، نشان‌دهنده جهل او به کسی است که او را خلیفه کرده، یا فراموشی اوست تا او را به یاد آورد، یا او را به مصالحش بیشتر از علم کسی که او را خلیفه کرده، آگاه می‌کند؟ و در این شرط کردن، اموری هولناک گشوده می‌شود که قدح می‌کنند. یا نایب می‌داند که کسی که او را خلیفه کرده، می‌خواهد که او در مورد آنچه بر او شرط کرده، از او سؤال کند تا فقر خود را به او از روی ذوق نشان دهد، زیرا اگر نایب در آنچه در شرطش طلب کرده، استقلال داشت، آن را شرط نمی‌کرد. و در آن، علم عرضه رشوه توسط نایب به کسی که او را خلیفه کرده، و آنچه از رشوه پذیرفته می‌شود و آنچه پذیرفته نمی‌شود، وجود دارد. و در آن، علم اجابت خلیفه به نایب در هر آنچه از مصالحش می‌پرسد، وجود دارد. و در آن، علم اینکه طعن بر مستخدمین، سفیه شمردن کسی است که آن‌ها را استخدام کرده، وجود دارد. و این علم بسیار خطرناکی است. و به همین دلیل، از طعن بر ملوک و خلفا نهی شده است و به ما خبر داده شده که قلب‌های آن‌ها در دست خداست؛ اگر بخواهد آن‌ها را از ما می‌گیرد و اگر بخواهد آن‌ها را بر ما مهربان می‌کند. و به ما امر شده که برای آن‌ها دعا کنیم. و اینکه وقوع مصلحت به واسطه آن‌ها در عموم، بیشتر از جور آن‌هاست. و حکمت جور آن‌ها چیست، با وجود اینکه آن‌ها نواب حقیقی خداوند بر خلقش هستند، چه کافر باشند یا مؤمن، عادل باشند یا ستمگر؟ این آن‌ها را از اطلاق نیابت بر آن‌ها خارج نمی‌کند. پس آیا اگر نایب ستم کرد، در آنچه ستم کرده، از نیابت عزل می‌شود، یا به طور مطلق از نیابت عزل می‌شود، سپس حق (الحق) نیابت دیگری را برای او تجدید می‌کند؟ و در آن، علم شمردن نعمت‌ها از سوی نعمت‌دهنده بر نعمت‌گیرنده وجود دارد. آیا این از قدح است، یا تعریفی است تا قدر آن را بداند، به دلیل شکری که از او خواسته شده است، یا عقوبتی است برای امری که از آن‌ها سر زده است، یا آیا مجموع این وجوه در آن جایز است؟ و در آن، علم رفق در تعلیم در مواطنی و سخت‌گیری در مواطنی وجود دارد. و در آن، علم اینکه از کجا آمده‌ای و به کجا می‌روی، و آیا بازگشتی بر حقیقت وجود دارد یا نه؟ یا آن، سلوکی همیشگی است که بازگشتی در آن نیست؟ و بازگشت برای معقول و محسوس در عالم، به کدام نسبت الهی بازمی‌گردد؟ و آیا حق (الحق) به بازگشت وصف می‌شود، بر آنچه ما در مورد بازگشت گفتیم یا نه؟ زیرا حقایق ابا دارند که بازگشتی وجود داشته باشد. و در آن، علم تفاوت میان وصف نفوس ناطقه به عقول، نهی، احکام و الباب و امثال این القاب، به چه چیزی بازمی‌گردد؟ و در آن، علم حکمت اقامه دلیل برای کسی که نمی‌داند آن دلیل است، در حالی که او می‌داند که به این صفت عالم است. آیا او عیناً مقصود آن دلیل است یا دیگری؟ پس او ناقل می‌شود و کسی که از نقل این شخص که نمی‌دانست آن دلیل است، به او می‌رسد، از آن بهره‌مند می‌شود و آن را می‌پذیرد. و این بسیار اتفاق می‌افتد، و آن قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است: «رب حامل فقه ليس بفقيه» (چه بسا حامل فقهی که فقیه نیست). پس وقتی آن را حمل کند و به فقیهی منتقل کند، آن فقیه آن را می‌پذیرد و از آن علمی را که نزدش نبوده، استفاده می‌کند، در حالی که ناقل به هیچ‌یک از آن علم ندارد. و در آن، علم نامیدن شیء به نام شیء دیگر، هنگامی که مجاور آن باشد یا سببی از آن باشد، وجود دارد. و در آن، علم اینکه چرا شارع به کشتن ساحر امر کرده و چرا کافر نامیده شده است؟ و هنگامی که فرعون صدق موسی (علیه السلام) را دانست و ایمان را در نفس خود پنهان کرد، که هنگام غرق شدن، وقتی عذاب را دید، آن را آشکار کرد، آیا کشتن ساحرانی که ایمان آوردند، به دلیل ساحر بودنشان بود؟ پس کشتن آن‌ها شرعاً در باطن امر و به دلیل ایمانشان در ظاهر امر بود. و اگر ساحر کشته شود، آیا آن قتل کفاره او و جزای سحر اوست و از جهت آن سحر در آخرت، مطالبه‌ای از حق سبحانه و تعالی بر او باقی نمی‌ماند یا نه؟ و در آن، علم برتری مقربان نزد خداوند به چه چیزی است که برخی بر برخی دیگر برتری یافتند؟ و در آن، علم\nقول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در مورد ابتلای مؤمن به مصیبت‌ها و بلاها که در همه آن برای او خیر است.\nو اینکه چرا اهل الله در دنیا بیشتر از دیگران در بلا هستند؟ و چرا اقتضای آن در حق آن‌هاست، نه دیگر مؤمنان؟ و در آن، علم اینکه چرا نفوس بر حب مال، به ویژه طلا، سرشته شده‌اند؟ آیا به دلیل حیازت درجه کمال معدنی است، پس مناسبتی میان کاملین واقع شده است؟ یا به دلیل رفع حوائج آن‌هاست؟ پس آن‌ها به آن نیازمندند تا به واسطه آن به مقاصد خود برسند؟ و قول عیسی (علیه السلام): «قلب هر انسانی جایی است که مال اوست، پس اموال خود را در آسمان قرار دهید تا قلب‌هایتان در آسمان باشد.» پس کسی که مال خود را ذخیره کند، قلب خود را در زمین طبیعتش دفن کرده است. پس هرگز از مشاهده پدرش که روح الهی است، لذت نمی‌برد. و چنین کسی، پسر مادرش خواهد بود، اگرچه پدری داشته باشد، اما به او نسبت داده نمی‌شود، مانند عیسی بن مریم (علیه السلام) که به مادرش نسبت داده می‌شود، در حالی که جز جبرئیل (علیه السلام) او را به مریم نبخشید، هنگامی که به صورت بَشَراً سَوِيًّا (بشری کامل) بر او متمثل شد و او را آگاه ساخت. با این حال، جز به بقعه جسمانی نسبت داده نشد، با وجود اینکه مردگان را زنده می‌کند، از آن جهت که از موهبت‌های روح الامین است. و در آن، علم غیرت الهی (الغيرة الإلهية) و اینکه از چه کسی در اسم خاصی که با آن شرافت یافته، با او رقابت کرده است، وجود دارد. و در آن، علم اینکه چه زمانی اجابت سائل در آنچه سؤال کرده، واجب می‌شود، اگر سؤال کند. و آیا کسی که با حال سؤال می‌کند، اجابتش با حال واجب می‌شود، به طوری که جواب مطابق سؤال باشد؟ و در آن، علم پایین آوردن کسی که خود را بالا برده و پست کردن کسی که بیش از قدر خود بلندپروازی کرده، وجود دارد. و در آن، علم فایده موعظه، حتی اگر به آن کفر ورزیده شود، وجود دارد. زیرا موعظه در باطن شنونده اثری دارد، اگرچه ظاهر نشود، زیرا او آن را از خود احساس می‌کند. و در آن، علم کسی که اراده مکر کند و با حق (الحق) مواجه شود، وجود دارد. پس آن نزد او کذب است، سپس عاقبت آشکار می‌شود که آن در نفس الامر صدق بوده است، اما او به آن علم ندارد. و در آن، علم اوقات و آنچه عقلاً و شرعاً نزد سلیم الفکر با آن رفتار می‌شود، وجود دارد. و در آن، علم تعیین مکارم اخلاق وجود دارد. و در آن، علم اینکه علم به آنچه دانسته نمی‌شود که دانسته نمی‌شود، علم است. و الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 9
}