{
  "id": 398,
  "title": {
    "ar": "الباب الثامن والتسعون وثلاثمائة في معرفة منازلة من وعظ الناس لم يعرفني ومن ذكرهم عرفني فكن أي الرجلين شئت",
    "en": "Chapter Three Hundred and Ninety-Eight: Concerning the Gnosis of the Spiritual Stations (منازلة) of him who admonishes the people yet does not know Me, and of him who reminds them who does know Me. Therefore, be whichever of the two men you desire.",
    "ur": "باب تین سو اٹھانوے (۳۹۸): ان لوگوں کے مراتب کی معرفت کے بیان میں جنہوں نے لوگوں کو وعظ کیا مگر مجھے (الحق) نہ پہچانا، اور ان لوگوں کے مراتب کے بیان میں جنہوں نے انہیں (حق کی طرف) متوجہ کیا اور مجھے پہچانا۔ پس تم ان دونوں میں سے جو چاہو بن جاؤ۔",
    "fa": "باب سیصد و نود و هشتم در معرفت جایگاه کسی که مردم را موعظه کرد در حالی که مرا نشناخت، و کسی که آنان را متذکر ساخت در حالی که مرا شناخت؛ پس تو هر کدام از این دو مرد که می‌خواهی باش."
  },
  "content": {
    "ar": "## «الباب الثامن والتسعون وثلاثمائة في معرفة منازلة من وعظ الناس لم يعرفني ومن ذكرهم عرفني فكن أي الرجلين شئت»\n\n\n> الخلق ظل لذات الحق ليس له *** كون يحققه علم ولا بصر\n\n\n> إن قام قام به أو سار سار به *** فعينه ليس هو وكونه بشر\n\n\n> فأعجب له من وجود لا وجود له *** ولو يزول لزال النفع والضرر\n\n\n> هذا الذي قلته العقل يجهله *** وليس يدريه إلا الشمس والقمر\n\n\n> فالشمس أنثى وبدر التم إن نظرت *** عين التفكر فيه حاكم ذكر\n\n\n> فكان بينهما إلا بنا وليس هما *** سواهما فاعتبر إن كنت تعتبر\n\n\n> عجبت من واحد في ذاته عدد *** له الظهور وفيه الكون والغير\n\n\n### [التذكرة والوعظ لمن‏]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الله يقول سبحانه وذَكِّرْهُمْ بِأَيَّامِ الله وقال تعالى فيما أمر به نبيه صَلَّى اللهُ عَليهِ وسَلَّم في كتابه العزيز قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ وقال عز وجل أَوْ يَأْتِيَهُمْ عَذابُ يَوْمٍ عَقِيمٍ فمدار هذه المنازلة على هذه الثلاثة الآيات فالتذكر للعلماء الغافلين والوعظ لا يكون للناس أجمعين ولهذا قال من وعظ الناس لم يعرفني فإنه إنما يعظهم بما يكون مني لا بي وكذلك من يخوفهم إنما يخوف بما يكون مني لا مني فالترغيب لا يجري مجرى الترهيب فإن الترغيب قد يكون في والترهيب لا يكون إلا مما يكون مني لا مني واليوم العقيم الذي لا ينتج زمانا مثله أي ليس بعده يوم يكون عنه لأن الأيام في الدنيا كل يوم هو ابن اليوم الذي قبله وهما توأمان ليلة ونهار فالليلة أنني والنهار ذكر فيتناكحان فيولد إن النهار والليل اللذين يأتيان بعدهما ويذهبان الأبوان فإنهما لا يجتمعان أبدا وفي غشيان الليل والنهار وإيلاج بعضهما في بعض يكون ولادة ما يتكون في كل واحد منهما من الأمور والكوائن التي هي من شئون الحق فيكون الليل ذكرا والنهار أنثى لما يتولد في النهار من الحوادث ويكون النهار ذكرا والليل أنثى لما يتولد في الليل من الحوادث وتكون الليلة أنثى والنهار ذكر الولادة التوأمين وهما اليوم الثاني وليلته والليل أصل والنهار منه كحواء من آدم ثم يقع النكاح والنتاج‏\n\n\n### «فصل» في الواحدة التي يعظ بها الواعظ\n\n\nوهي أن يقوم من أجل الله إذا رأيت من فعل الله في كونه ما أمرك أن تقوم له فيه إما غيرة وإما تعظيما فقوله في القيام مثنى بالله وبرسوله فإنه من أطاع الرسول فَقَدْ أَطاعَ الله فقمت لله بكتاب أو سنة لا تقوم عن هوى نفس ولا عيرة طبيعية ولا تعظيم كوني وفرادي إما بالله خاصة أو لرسوله خاصة كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم لا أرى أحدكم متكئا على أريكته يأتيه الحديث عني فيقول اتل به علي قرآنا إنه والله لمثل القرآن أو أكثر\n\n\nفقوله أكثر في رفع المنزلة فإن القرآن بينه وبين الله فيه الروح الأمين والحديث من الله إليه ومعلوم أن القرب في الإسناد أعظم رتبة من البعد فيه ولو بشخص واحد ينقص من الطريق وذلك لأنه ينقص حكمه فيه فإنه لا بد أن يكتسب الخبر صورة من المبلغ فلا يبقى على ما هو عليه في الأصل الذي ينقل عنه ولا يكون في الصدق في قول المخبر هذا كلام فلان مثل من ينقله عنه أو يسمعه منه وذلك لتبدل اللغة واللسان فيه فإن الترجمان لا ينقل عين ما تكلم به من ينقل عنه وإنما يتكلم في نقله بما فهمه منه وإذا كنت أنت الذي تنقل عنه كنت في طبقته وقد تفهم منه أمرا لم يفهمه منه المترجم لك عنه فبهذا كان الحديث أكثر من القرآن وغايته أن يكون إذا نزل عن هذه الطبقة مثله وما عدل‏\nرسول الله صَلَّى اللهُ عَليهِ وسَلَّم إلى الأكثرية إلا والأمر أكثر بلا شك وإنما قلنا في القرآن إنه بواسطة لقوله تعالى نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ وقوله قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ من رَبِّكَ وقوله ولا تَعْجَلْ بِالْقُرْآنِ من قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ وقُلْ رَبِّ زِدْنِي عِلْماً بما يكون من الله إليه برفع الواسطة وهو الحديث الذي لا يسمى قرآنا فلا ينبغي لواعظ أن يخرج في وعظه عن الكتاب أو السنة ولا يدخل في هذه الطوام فينقل عن اليهود والنصارى والمفسرين الذين ينقلون في كتب تفاسيرهم ما لا يليق بجناب الله ولا بمنزلة رسل الله عليه السلام كما روينا عن منصور بن عمار أنه رآه إنسان بعد موته وكان من الواعظين فقال له يا منصور ما لقيت فقال أوقفني الحق بين يديه وقال إلي يا منصور بم تقربت إلي فقلت له كنت أعظ الناس وأذكرهم فقال يا منصور بشعر زينب وسعاد تطلب القرب مني وتعظ عبادي وذكر لي أشعارا كنت أنشد بها على المنبر مما قاله أهل المحبة في محبوباتهم فشدد علي ثم قال إن بعض أوليائي حصر مجلسك فقلت في ذلك المجلس اللهم اغفر لأقسانا قلبا وأجمدنا عينا فقال ذلك الولي الذي حضر عندك اللهم اغفر لمن هذه صفته فاطلعت فلم أر أجمد عينا ولا أقسى قلبا منك فاستجبت فيك دعاء وليي فغفرت لك فلا ينبغي أن ينشد واعظ في مجلسه إلا الشعر الذي قصد فيه قائله ذكر الله بلسان التغزل أو بغيره فإنه من الكلام الذي يقوله أهل الله فهو حلال قولا وسماعا فإنه مما ذكر اسم الله عليه ولا ينبغي أن ينشد في حق الله شعرا قصد به قائله في أول وضعه غير الله نسيبا كان أو مديحا فإنه بمنزلة من يتوضأ بالنجاسة قربة إلى الله فإن القول في المحدث حدث بلا شك وقد نبه الله في كتابه على هذه المنزلة بقوله وما لَكُمْ أَلَّا تَأْكُلُوا مِمَّا ذُكِرَ اسْمُ الله عَلَيْهِ وقوله ولا تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ الله عَلَيْهِ وإِنَّهُ لَفِسْقٌ وقال حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ والدَّمُ ولَحْمُ الْخِنْزِيرِ وما أُهِلَّ لِغَيْرِ الله به والشعر في غير الله مما أهل لغير الله به فإنه للنية أثر في الأشياء والله يقول وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ والإخلاص النية وهذا الشارع ما نوى في شعره إلا التغزل في محبوبه والمديح فيمن ليس له بأهل لما شهد به فيه ولقد كتب إلي شخص من إخواني بكتاب يعظمني فيه بحيث أن لقبني فيه بثلاثة وستين لقبا فكتبت له سَتُكْتَبُ شَهادَتُهُمْ ويُسْئَلُونَ وذكرت له مع هذا في جواب كتابه‏\n\n\nإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قال لا أزكي على الله أحدا ولكن يقول أحسبه كذا وأظنه كذا\n\n\nويقول الله تعالى فَلا تُزَكُّوا أَنْفُسَكُمْ هُوَ أَعْلَمُ بِمَنِ اتَّقى‏ فلو نوى جانب الحق هذا القائل ابتداء في أي صورة شاء ربما كان ذلك القول قربة إلى الله فإن الأعمال بالنيات وإنما لكل امرئ ما نوى فإن الله مطلع على ما في نفس الإنسان ولله يوم تبلى فيه السرائر وكل ما كان قربة إلى الله شرعا فهو مما ذكر اسم الله عليه وأهل به لله وإن كان بلفظ التغزل وذكر الأماكن والبساتين والجوار وكان القصد بهذا كله ما يناسبها من الاعتبار في المعارف الإلهية والعلوم الربانية فلا بأس وإن أنكر ذلك المنكر فإن لنا أصلا نرجع إليه فيه وهو أن الله تعالى يتجلى يوم القيامة لعباده في صورة ينكر فيها حتى يتعوذوا منها فيقولون نعوذ بالله منك لست ربنا وهو يقول أنا ربكم وهو هو تعالى وهنا سر في تجليه فابحث عليه في معرفة العقائد واختلافها كذلك هذه الألفاظ وإن كان صورة المسمى فيها في الظاهر غير الله وهو خلاف ما نواه القائل فإن الله ما يعامله إلا بما نواه في ذلك وتدل عليه أحوال القائل كما قيل ينظر إلى القول وقائله يريدون وحال قاتله ما هو فإن كان وليا فهو الولاء وإن خشن وإن كان عدوا فهو البذاء وإن حسن كما نذكر نحن في أشعارنا فإنها كلها معارف إلهية في صور مختلفة من تشبيب ومديح وأسماء نساء وصفاتهن وأنهار وأماكن ونجوم وقد شرحنا من ذلك نظما لنا بمكة سميناه ترجمان الأشواق وشرحناه في كتاب سميناه الذخائر والأغلاق فإن بعض فقهاء حلب اعترض علينا في كوننا ذكرنا أن جميع ما نظمناه في هذا الترجمان إنما المراد به معارف إلهية وأمثالها فقال إنما فعل ذلك لكونه منسوبا إلى الدين فما أراد أن ينسب إليه مثل هذا الغزل والنسيب فجزاه الله خيرا لهذه المقالة فإنها حرمت دواعينا إلى هذا الشرح فانتفع به الناس فأبدينا له ولأمثاله صدق ما نويناه وما ادعيناه فلما وقف على شرحه تاب إلى الله من ذلك ورجع ولو رأينا رجلا ينظر إلى وجه امرأة وهو خاطب لها ونحن لا نعرف أنه خاطب وكنا منصفين في الأمر لم نقدم على الإنكار عليه إذا جهلنا حاله حتى نسأله ما دعاه إلى ذلك فإن قال أو قيل لنا إنه خاطب لها أو هو طبيب وبها مرض يستدعي ذلك المرض نظر الطبيب‏\nإلى وجهها علمنا أنه ما نظر إلا إلى ما يجوز له النظر إليه فيه بل نظره عبادة لو ورد الأمر من الرسول صَلَّى اللهُ عَليهِ وسَلَّم في ذلك ولا ينكر عليه ابتداء مع هذا الاحتمال فليس الإنكار عليه من المنكر بأولى من الإنكار على المنكر في ذلك مع إمكان وجود هذه الاحتمالات إذ لا تصح المنكرات إلا بما لا يتطرق إليها احتمال وهذا يغلط فيه كثير من المتدينين لا من أصحاب الدين فإن أصحاب الدين المتين أول ما يحتاط على نفسه ولا سيما في الإنكار خاصة فإن للمغير شروطا في التغيير فإن الله ندبنا إلى حسن الظن بالناس لا إلى سوء الظن بهم فلا ينكر صاحب الدين مع الظن وقد سمع إِنَّ بَعْضَ الظَّنِّ إِثْمٌ فلعل هذا من ذلك البعض وإثمه أن ينطق به وإن وافق العلم في نفس الأمر فإن الله يؤاخذه بكونه ظن وما علم فنطق فيه بأمر محتمل ولم يكن له ذلك وسوء الظن بنفس الإنسان أولى من سوء ظنه بالغير لأنه من نفسه على بصيرة وليس هو من غيره على بصيرة فلا يقال فيه في حق نفسه إنه سيئ الظن بنفسه لأنه عالم بنفسه وإنما قلنا فيه إنه يسي‏ء الظن بنفسه اتباعا لسوء ظنه بغيره فهو من تناسب الكلام وله وجه في الحقائق الشرعية فإنه بالنظر إلى نفسه ليس هو في فعله ما ينكره على نفسه على الحقيقة عالما بأنه في فعله ذلك على منكر يعلمه بل هو على ظن فسوء الظن بنفسه أولى وذلك‏\n\n\nأن لله عبادا قد قال لهم الله افعلوا ما شئتم فقد غفرت لكم‏\n\n\nفما فعلوا إلا ما أباح الشرع لهم فعله وإن لم يعلموا أنهم ممن خوطبوا بذلك وهو في الحديث الصحيح فما فعل إلا ما هو مباح عند الله وهو لا علم له بذلك فهو عند الله بهذه المثابة فلهذا قلنا سوء الظن بنفسه إذ لم يكن فيها على بصيرة على الحقيقة مع هذا الاحتمال من جانب الحق وقد جعل الله لمن هذه صفته علامة يعرف بها نفسه أنه من أولئك القوم ولا يشك بالعلم الشرعي الصحيح أن حرمة نفس الإنسان عليه عند الله أعظم من حرمة غيره بما لا يتقارب وإنه من قتل نفسه أعظم في الجرم ممن قتل غيره وأن صدقته على نفسه أعظم في الأجر من صدقته على غيره فالعالم الصالح من استبرأ لدينه في كل أحواله في حق نفسه وفي حق غيره وإلى الآن ما رأيت أحدا من أهل الانتماء إلى الدين وإلى العلم على هذا القدم فالحمد لله الذي وفقنا لاستعماله وحال بيننا وبين إهماله ولو لا ما في ذكر هذا من المنفعة لعباد الله والنصيحة لهم ما بسطنا القول فيه هذا البسط وإن كان الفصل يقتضيه فإنه فصل المواعظة والله يقول لنبيه صَلَّى اللهُ عَليهِ وسَلَّم فيما أنزله عليه ادْعُ إِلى‏ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ والْمَوْعِظَةِ الْحَسَنَةِ مثل هذه التي ذكرناها فإنها وصية منها إلى عباد الله جمعت بين الحكمة لأنا أنزلناها منزلتها وبين الحكم والحكيم من ينزل الأمر منزلته ولا يتعدى به مرتبته وأما الموعظة الحسنة فهي الموعظة التي تكون عند المذكر بها عن شهود فإن الإحسان أن تعبد الله كأنك تراه فكيف بمن حقق أنه يراه فإن ذلك أعظم وأحسن وقد يكون قوله مَثْنى‏ يريد به التعاون في القيام لله تعالى في ذلك الأمر وصورة التعاون فيه إن الشرع في نفس الأمر قد أنكر هذا الفعل ممن صدر عنه عليه فينبغي للعالم المؤمن أن يقوم مع المشرع في ذلك فيعينه فيكون اثنان هو والشرع وفُرادى‏ أن يكون هذا المنكر لا يعلم أنه معين للشرع في إنكاره ووعظه فيقول قد انفردت بهذا الأمر وما هو إلا معين للشرع وللملك الذي يقول بلمته للفاعل لا تفعل إذ يقول له الشيطان بلمته افعل فيكون مع الملك مثنى فإن الملك مكلف بأن ينهى العبد الذي قد ألزمه الله به أن ينهاه فيما كلفه الله به أن ينهاه عنه فيساعده الإنسان على ذلك فيكون ممن قام لله في ذلك مثنى وقد يكون معينا للشارع وهو الرسول عليه السلام فهو الذي أنكر أولا هذا الفعل على فاعله وتقدم في الوعظ في ذلك فيكون هذا الإنسان الواعظ مع وعظ الرسول المتقدم مثنى كما\n\n\nسأل بعض الناس رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن يجعله رفيقه في الجنة فقال له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أعني على نفسك بكثرة السجود\n\n\nفطلب منه العون فقد قاما في ذلك مثنى هو ورسول الله صَلَّى اللهُ عَليهِ وسَلَّم قال تعالى وتَعاوَنُوا عَلَى الْبِرِّ والتَّقْوى‏ وقال اسْتَعِينُوا بِاللَّهِ فشرك نفسه مع عبده في الفعل وما لا يفعله الله إلا بالأدلة فهو من هذا الباب ولا يعلم ذلك إلا العالم بأسرار الله وما هي الحقائق عليه فلا تغفل عن هذا النفس وكن المعين لمن ذكرت لك تحمد عاقبتك ويحصل لك سهم في الإعانة مع المعين يقول العبد وإِيَّاكَ نَسْتَعِينُ فيقول الحق هذه بيني وبين عبدي ولعبدي ما سأل فتبين قوله تعالى هذه بيني وبين عبدي فهي لله وله في حكم الإعانة إذا أراد الله وجود الصلاة فلا بد من استعداد المحل الذي به ظهور الصلاة فافهم‏\n### «فصل» في قوله تعالى وذَكِّرْهُمْ بِأَيَّامِ الله‏\n\n\nوأما تذكيره بأيام الله فهي أيام الأنفاس على الحقيقة فإنها أقل ما ينطلق عليه اسم يوم فهو أن تذكره بقوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ فتلك أيام الله وأنت في غفلة عنها وتدخل في مضمون قوله تعالى إِنَّ في ذلِكَ إشارة إلى قوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ مع غير ذلك لعبرة لِمَنْ كانَ لَهُ قَلْبٌ أي لمن له فطنة بالتقلب في الأحوال أو تقلب الأحوال عليه فيعلم من ذلك شئون الحق وحقائق الأيام التي الحق فيها في شأن فالشأن واحد العين والقوابل مختلفة كثيرة يتنوع فيها هذا الشأن بتنوعها واختلافها فهو من الله واحدة وفي صور العالم كثيرة كالصورة الواحدة في المرايا الكثيرة والظلالات الكثيرة من الشخص الواحد للسرج المتعددة هكذا الأمر أَوْ أَلْقَى السَّمْعَ لما يتلى عليه من قوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ وأمثاله وهُوَ شَهِيدٌ من نفسه تقلب أحواله فيكون على بصيرة في ذلك من الله فهذه أيام الله التي ينبغي أن يذكر العبد بها إلى أمثال ذلك من أيام الله وهي أيام النعم وأيام الانتقام التي أخذ الله فيها المقرون الماضية واعلم أن البلايا أكثر من النعم في الدنيا فإنه ما من نعمة ينعمها الله على عباده تكون خالصة من البلاء فإن الله يطالبه بالقيام بحقها من الشكر عليها وإضافتها إلى من يستحقها بالإيجاد وأن يصرفها في الموطن الذي أمره الحق أن يصرفها فيه فمن كان شهوده في النعم هذا الشهود متى يتفرغ للالتذاذ بها وكذلك في الرزايا هي في نفسها مصائب وبلايا ويتضمنها من التكليف ما يتضمنه النعم من طلب الصبر عليها ورجوعه إلى الحق في رفعها عنه وتلقيها بالرضى أو الصبر الذي هو حبس النفس عن الشكوى بالله إلى غير الله وهذا غاية الجهل بالله لأنك تشكو بالقوي إلى الضعيف لما تجد في حال الشكوى من الراحة مع كونك تشتكي إلى غير مشتكى لأنك تعلم أنه ما بيده شي‏ء ولا يقدر على رفع ما نزل بك إلا من أنزله وقد علمت أن الدار دار بلاء لا يخلص فيها النعيم عن البلاء وقتا واحدا وأقله طلب الشكر من المنعم بها عليها وأي تكليف أشق منه على النفس ولذلك قال تعالى وقَلِيلٌ من عِبادِيَ الشَّكُورُ لجهلهم بالنعم إنها نعم يجب الشكر عليها يؤيد ما قلناه قوله تعالى إِنَّ في ذلِكَ لَآياتٍ لِكُلِّ صَبَّارٍ شَكُورٍ في حق راكب البحر إذا اشتد الريح عليه وبرد فيما فيها من النعمة يطلب منه الشكر عليها وبما فيها من الشدة والخوف يطلب منه الصبر فافهم وتدبر كلام الله تغنم وما أنزله الله إلا تذكرة للبيب كما قال لِيَدَّبَّرُوا آياتِهِ ولِيَتَذَكَّرَ أُولُوا الْأَلْبابِ ولا تكن ممن ليس له منه نصيب إلا البلاغ‏\n\n\n### «فصل» في اليوم العقيم‏\n\n\nوالعقيم ما يوجب أن لا يولد منه فلا تكون له ولادة على مثله وسمي عقيما لأنه لا يوم بعده أصلا وهو من يوم الأسبوع يوم السبت وهو يوم الأبد فنهاره نور لأهل الجنة دائم لا يزال أبدا وليلة ظلمة على أهل النار لا يزال أبدا ولهذا يموتون أهل الكبائر فيها الذين يخرجون منها بعد العقوبة إلى الجنة إذ لا خلود في النار إلا لأهلها الذين هم أهلها\n\n\nيقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن ناس أصابتهم النار بذنوبهم فأماتهم الله فيها إماتة\n\n\nالحديث وهو صحيح فينامون فيها نومة حتى لا يحسوا بالنار إذا مستهم عند ما تتسلط على آلات المعاصي بالأكل وهي الجوارح والايمان يمنع من تخلصها إلى القلب فهذه عناية التوحيد الذي كان في قلوبهم فعلم التوحيد يميتهم في النار موتة النائم في حال نومه والايمان على باب النار ينتظرهم حتى إذا بعثهم الله من تلك النومة وهم قد صاروا فحما أخرجهم سبحانه فغمسهم في نهر الحياة فينبتون كما تنبت الحبة تكون في حميل السيل ثم يدخلون الجنة فلا يبقى في النار من علم إن الله إله واحد في الدنيا جملة واحدة ولأهل الجنة في الجنة مقادير يعرفون بها انتهاء مدة طلوع الشمس إلى غروبها في الدنيا وإن لم يكن في الجنة شمس فالحركة التي كانت تسير بالشمس فيظهر من أجلها طلوعها وغروبها موجودة في الفلك الأطلس الذي على الجنة وهو سقفها والحركة بعينها فيه موجودة ولأهل الجنة كشف ورؤية إلى المقادير التي فيه المعبر عنها بالبروج فإن ذلك الفلك هو السماء الذي أقسم الله به في قوله والسَّماءِ ذاتِ الْبُرُوجِ فيعلمون بها حد ما كان عليهم في الدنيا مما يسمى بكرة وعشيا وكان لهم في هذا الزمان في الدنيا حالة تسمى الغداء والعشاء فيتذكرونها هنالك فيأتيهم الله عند ذلك برزق يرزقهم فيها كما قال لَهُمْ رِزْقُهُمْ فِيها بُكْرَةً وعَشِيًّا وهو رزق خاص في وقت خاص معلوم عندهم وما عدا ذلك فأكلها دائم لا ينقطع والدوام في الأكل إنما هو عين النعيم بما يكون‏\nبه الغذاء للجسم ولكن لا يشعر به كثير من الناس إلا العلماء بعلم الطبيعة وذلك أعني صورة قوله أُكُلُها دائِمٌ إن الإنسان إذا أكل الطعام حتى يشبع فذلك ليس بغذاء ولا بأكل على الحقيقة وإنما هو كالجاني الجامع مع المال في خزانته والمعدة خزانة لما جمعه هذا الآكل من الأطعمة والأشربة فإذا جعل فيها أعني في خزانة معدته وما اختزنه فيها ورفع يده حينئذ تتولاها الطبيعة بالتدبير وينتقل ذلك الطعام من حال إلى حال ويغذيه بها في كل نفس يخرج عنه دائما فهو لا يزال في غذاء دائم ولو لا ذلك لبطلت الحكمة في ترتيب نشأة كل متغذ والله حكيم فإذا خلت الخزانة حرك الطبع الجابي إلى تحصيل ما يملؤها به فلا يزال الأمر هكذا دائما أبدا فهكذا صورة الغذاء في المتغذي فالتغذي في كل نفس دنيا وآخرة وكذلك أهل النار وقد وصفهم الله بالأكل والشرب فيها على هذا الحد إلا أنها دار بلاء فيأكلون عن جوع ويشربون عن عطش وأهل الجنة يأكلون ويشربون عن شهوة لالتذاذ لا عن جوع فإنهم ما يتناولون الشي‏ء المسمى غذاء إلا عن علم بأن الزمان الذي كان الاختزان فيه قد فرغ ما كان مختزنا فيه فيسارع إلى الطبيعة بما تدبره فلا يزال في لذة ونعيم لا يحوج الطبيعة إلى طلب وحاجة للكشف الذي هم عليه كما إن أهل النار في الحجاب فلا يعلمون هذا القدر فيجوعون ويظمئون لأن المقصود منهم أن يتألموا فتبين لك أنه لا لذة إلا العلم ولا ألم إلا الجهل والشمس مكورة قد نزع نورها في أعينهم طالعة على أهل النار وغاربة كما تطلع على أهل الدنيا في حال كسوفها وكذلك القمر يسبحان وجميع الدراري على صورة سباحتهم الآن في أفلاكهم لكنها مطموسة في أعينهم فعلى ما هو الأمر في نفسه هم الذين طمس الله أعينهم إذ شاء عن إدراك الأنوار التي في المنبرات فالحجاب على أعينهم كما نعلم أن الشمس هنا في حال كسوفها ما زال نورها منها وإنما القمر حجبها عنا ولو لم يكن كذلك ما عرف أهل التعاليم متى يكون الكسوف وكم يذهب منها في الكسوف عن أعيننا ويقع ذلك على ما ذكروه فلو كان من الأمور التي لا تجري على مقادير موضوعة وموازين محكمة قد أعلمها الله من وفقه لطلب مثل هذا العلم ما علمه وهذا لا يقدح في قولنا إن الشمس قد كسفت أو قد زال نورها عن إدراك أعيننا فإن هذا القدر وهذه الصورة ما ثم من يمنعنا أن نصطلح على أن نطلق عليها اسم كسوف وخسوف وتكوير وطمس فيشهد أهل النار أجرام السيارة طالعة عليهم وغاربة ولا يشهدون لها نورا لما في الدخان من التطفيف فكما كانوا في الدنيا عمياء عن إدراك أنوار ما جاءت به الشرائع من الحق كذلك هم في النار عمي عن إدراك أنوار هذه السيارة وغيرها من الكواكب ومن كانَ في هذِهِ أَعْمى‏ فَهُوَ في الْآخِرَةِ أَعْمى‏ وأَضَلُّ سَبِيلًا وإنما كان أضل سبيلا فإنه في الدنيا يجد من يرشده إلى الطريق ولكن لا يسمع وفي النار ما يجد من يرشده إلى الطريق فإنه ما ثم طريق لكن يجد من يندمه على ما فاته ليزيده حسرة إلى حسرته وعذابا إلى عذابه فليل أهل النار لا صباح له ونهار أهل الجنة لا مساء له أي لا ليل فيه فمن وعظ الناس في عقده طلبا منه بذلك أن ينفع الناس في عقده فما عرف الله بخلاف المذكر فإنه يذكر ويعظ بما عنده ويعلم أن من السامعين من يكون له ذلك الوعظ شفاء ودواء ومن الناس من يزيده مرضا إلى مرضه كما قال تعالى وإِذا ما أُنْزِلَتْ سُورَةٌ وهي واحدة فَأَمَّا الَّذِينَ آمَنُوا فَزادَتْهُمْ إِيماناً وهُمْ يَسْتَبْشِرُونَ بورود العافية عليهم وأَمَّا الَّذِينَ في قُلُوبِهِمْ مَرَضٌ فَزادَتْهُمْ رِجْساً إِلَى رِجْسِهِمْ والسورة واحدة والمزاج مختلف فلا يعرف حقيقة هذه الآية إلا الأطباء الذين يعلمون أن العقار الفلاني فيه شفاء لمزاج خاص من مرض خاص وهو داء وعلة لمزاج خاص وزيادة مرض في مرض خاص فالطبيب أحق الناس علما بهذه الآية وكذلك طبيب القلوب فيما يؤمنها ويخيفها فالحكيم هو الذي يأتي إلى العليل من ما منه ويظهر له بصورة من يعتقد فيه ليستدرجه إلى صورة الحق بالحق الذي يليق به ولكن وقع‏\n\n\nالأمر الإلهي في العالم بخلاف هذا لأن مشيئة الله تعلقت بأن الله لا يجمعهم على الهدى وأما الطريق في ذلك فمعلوم عند الله وعند أهله لا يشكون فيه فإن الذي يعتقد في مخلوق ما من حجر أو نبات أو حيوان أو كوكب إنه إلهه وهو يعبده ويخاطبه ذلك الإله المشهود له على الكشف بما هو الحق عليه يرجع إلى قوله لاعتقاده فيه كما يرجع إلى قوله في الآخرة ويتبرأ منه كما تبرأ إلهه منه والله قادر على أن ينطقه في الدنيا بذلك في حق من يعبده لكن العلم السابق والمشيئة الإلهية منعا من ذلك ليكون الخلاف في العالم فجرى الأمر على ذلك في الدنيا وبعض‏\nالآخرة ويرجع الأمر إلى حكم أخذ الميثاق بالرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 398: Concerning the Station of Him Who Preaches to People but Does Not Know Me, and Him Who Reminds Them and Does Know Me, So Be Whichever of the Two Men You Wish.\n\nCreation (الخلق) is a shadow of the Essence of the Real (ذات الحق); it has no existence (كون) that Knowledge or Sight can verify.\nIf it stands, it stands by Him; if it moves, it moves by Him. Its essence is not Him, yet its existence is human.\nMarvel at an existence (وجود) that has no existence of its own! Yet if it were to vanish, benefit and harm would also vanish.\nWhat I have said here, the intellect (العقل) is ignorant of, and none comprehends it save the Sun and the Moon.\nThe Sun is female, and the full Moon, if the eye of contemplation (عين التفكر) looks upon it, is a male ruler.\nThus, what is between them exists only through us, and they are not other than themselves. Reflect, if you are one who reflects.\nI marvel at a Single One (واحد) who is a multiplicity (عدد) in His Essence (ذاته); to Him belongs the Manifestation (الظهور), and in Him are the Cosmos (الكون) and the Other.\n\n### [Reminder and Admonition for Whom]\n\nKnow—may Allah support us and you with a Spirit from Him—that Allah, the Glorified, says: <<وَذَكِّرْهُمْ بِأَيَّامِ الله>> (And remind them of the Days of Allah). And He, the Exalted, said concerning what He commanded His Prophet (peace and blessings be upon him) in His Glorious Book: <<قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ>> (Say: I admonish you concerning one thing). And He, the Mighty and Majestic, said: <<أَوْ يَأْتِيَهُمْ عَذابُ يَوْمٍ عَقِيمٍ>> (Or that the punishment of a barren day should come upon them). The pivot of this station (منازلة) rests upon these three verses. Reminding (التذكر) is for the heedless scholars, while admonition (الوعظ) is not for all people universally. This is why He said: \"He who preaches to people does not know Me,\" for he only admonishes them concerning what proceeds *from* Me, not *by* Me. Similarly, he who frightens them only frightens them with what proceeds *from* Me, not *by* Me. Thus, encouragement (الترغيب) does not follow the same course as intimidation (الترهيب). Encouragement may be *in* Me, but intimidation can only be concerning what proceeds *from* Me, not *by* Me.\n\nThe barren day (اليوم العقيم) is that which does not produce a time like itself; that is, there is no day after it that originates from it. This is because the days in this world (الدنيا) are such that every day is the son of the day preceding it. They are twins: night and day. The night is female and the day is male. They couple, and from them are born the day and night that follow them, while the parents depart, for they never meet again. In the covering of the night and the day, and the insertion of one into the other, occurs the birth of what is formed within each of them: the matters and existents (الكوائن) which are among the affairs (شئون) of the Real (الحق). Thus, the night may be male and the day female, due to the events (الحوادث) born in the day. And the day may be male and the night female, due to the events born in the night. And the night may be female and the day male for the birth of the twins, which are the second day and its night. The night is the origin, and the day is derived from it, like Eve from Adam. Then the coupling and production occur.\n\n### A Section on the One Thing by Which the Preacher Admonishes\n\nThis \"one thing\" is that you stand up for the sake of Allah when you see an act of Allah in His Cosmos (كونه) concerning which He commanded you to stand up, either out of zeal (غيرة) or out of magnification (تعظيما). His saying concerning standing up is \"in pairs\" (مثنى): by Allah and by His Messenger, for whoever obeys the Messenger has obeyed Allah. Thus, you stand up for Allah by means of the Book or the Sunna, not out of personal caprice (هوى نفس), natural shame (عيرة طبيعية), or cosmic magnification (تعظيم كوني). And \"singly\" (فرادى): either for Allah specifically, or for His Messenger specifically, as the Prophet (peace and blessings be upon him) said: \"I do not want to see any of you reclining on his couch when a Hadith from me comes to him, saying: 'Recite the Qur'an to me.' By Allah, it is like the Qur'an, or more.\"\n\nHis saying \"or more\" is due to the elevation of the rank (المنزلة). For the Qur'an, the Trustworthy Spirit (الروح الأمين) is between it and Allah, whereas the Hadith is directly from Allah to him [the Prophet]. It is known that proximity (القرب) in the chain of transmission (*isnad*) is a greater degree (رتبة) than distance in it, even if only by one person being removed from the path. This is because the ruling concerning it is diminished, for the report inevitably acquires a form from the conveyor, so it does not remain exactly as it was in the original source from which it is transmitted. The veracity of the statement, \"This is the speech of so-and-so,\" when reported by someone else, is not the same as hearing it directly from the speaker. This is due to the change in language and tongue, for the translator does not convey the exact words spoken by the one he translates from; rather, he speaks in his translation what he understood from him. If you are the one transmitting directly from the source, you are on his level, and you may understand something from him that the translator did not grasp. For this reason, the Hadith was \"more\" than the Qur'an. At the very least, if it descends from this level, it is its equal. The Messenger of Allah (peace and blessings be upon him) would not have inclined toward the \"more\" unless the matter was undoubtedly greater. We said the Qur'an involves an intermediary because of His saying, the Exalted: <<نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ>> (The Trustworthy Spirit brought it down upon your heart), and His saying: <<قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ من رَبِّكَ>> (Say: The Holy Spirit brought it down from your Lord), and His saying: <<ولا تَعْجَلْ بِالْقُرْآنِ من قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ>> (And hasten not with the Qur'an before its revelation is concluded to you), and <<وقُلْ رَبِّ زِدْنِي عِلْماً>> (And say: My Lord, increase me in knowledge)—which refers to what comes from Allah to him by removing the intermediary, which is the Hadith that is not called Qur'an.\n\nIt is not fitting for a preacher (واعظ) to depart from the Book or the Sunna in his admonition, nor to enter into these calamities by transmitting from the Jews, the Christians, or the exegetes who transmit in their books of exegesis what is unfitting for the Divine Presence (جناب الله) or the station of the Messengers of Allah (peace be upon them). As we related concerning Mansur ibn Ammar, someone saw him after his death—he was one of the preachers—and asked him, \"O Mansur, what did you encounter?\" He replied, \"The Real (الحق) stood me before Him and said, 'Come to Me, O Mansur. By what did you seek proximity to Me?' I said, 'I used to admonish and remind people.' He said, 'O Mansur, by the poetry of Zaynab and Su'ad do you seek proximity to Me and admonish My servants?' He mentioned poems I used to recite on the pulpit, which were spoken by the people of love concerning their beloveds. He was severe with me. Then He said, 'One of My friends (*awliya'*) attended your gathering. In that gathering, I said, \"O Allah, forgive the one among us who is hardest of heart and driest of eye.\" That friend who attended your gathering said, \"O Allah, forgive the one who has this description.\" I looked and saw none drier of eye or harder of heart than you. So I answered the prayer of My friend concerning you, and I forgave you.'\"\n\nTherefore, a preacher should not recite in his gathering any poetry unless the author intended it to be a remembrance (*dhikr*) of Allah, whether in the language of amorous verse (*taghazzul*) or otherwise. For such is the speech spoken by the People of Allah (*Ahl Allah*), and it is lawful (حلال) to speak and to hear, as it is something over which the Name of Allah has been mentioned. It is not fitting to recite poetry concerning the Real (الحق) that the author originally intended for other than Allah, whether it be amorous verse (*nasib*) or praise (*madh*). This is equivalent to performing ablution with impurity as an act of proximity to Allah. For speech concerning the created (المحدث) is undoubtedly a created event (*hadath*). Allah has drawn attention to this station in His Book by His saying: <<وما لَكُمْ أَلَّا تَأْكُلُوا مِمَّا ذُكِرَ اسْمُ الله عَلَيْهِ>> (And why should you not eat of that upon which the Name of Allah has been mentioned?), and His saying: <<ولا تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ الله عَلَيْهِ وإِنَّهُ لَفِسْقٌ>> (And eat not of that upon which the Name of Allah has not been mentioned, for indeed, that is grave disobedience). And He said: <<حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ والدَّمُ ولَحْمُ الْخِنْزِيرِ وما أُهِلَّ لِغَيْرِ الله به>> (Forbidden to you are carrion, and blood, and the flesh of swine, and that which has been dedicated to other than Allah). Poetry concerning other than Allah is among that which has been dedicated to other than Allah, for intention (*niyya*) has an effect on things. Allah says: <<وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ>> (And they were not commanded except to worship Allah, dedicating the religion sincerely to Him). Sincerity (*Ikhlas*) is the intention.\n\nThe author of this [secular] poetry only intended amorous verse concerning his beloved or praise for one who is unworthy of it, based on what he witnessed in him. Indeed, a person among my brethren wrote a letter to me magnifying me, to the extent that he titled me with sixty-three epithets. I wrote back to him: <<سَتُكْتَبُ شَهادَتُهُمْ ويُسْئَلُونَ>> (Their testimony will be recorded, and they will be questioned). Along with this, I mentioned in my reply that the Messenger of Allah (peace and blessings be upon him) said: \"I do not purify anyone before Allah, but one may say: 'I reckon him to be such,' or 'I think him to be such.'\" And Allah, the Exalted, says: <<فَلا تُزَكُّوا أَنْفُسَكُمْ هُوَ أَعْلَمُ بِمَنِ اتَّقى‏>> (So do not purify yourselves; He is most knowing of who is righteous).\n\nIf this speaker had intended the side of the Real (جانب الحق) from the outset, in whatever form he wished, that speech might have been an act of proximity (*qurba*) to Allah. For deeds are judged by intentions (*al-a'mal bi al-niyyat*), and every person shall have only what he intended. Allah is aware of what is in the human soul, and to Allah belongs the Day when secrets will be tested. Everything that is an act of proximity to Allah according to the Law (*shar'an*) is something over which the Name of Allah has been mentioned and dedicated to Allah, even if it is in the language of amorous verse (*taghazzul*) and mentions places, gardens, and neighbors. If the intention behind all of this is the contemplation (*i'tibar*) appropriate to Divine Gnosis (المعارف الإلهية) and Lordly Sciences (العلوم الربانية), then there is no harm, even if the denier (المنكر) rejects it. For we have a principle to which we refer in this matter: that Allah, the Exalted, will manifest Himself (*yatajalla*) to His servants on the Day of Resurrection in a form that they will deny, until they seek refuge from it, saying, \"We seek refuge in Allah from you, you are not our Lord.\" And He will say, \"I am your Lord,\" and He is He, the Exalted. There is a secret here in His Theophany (تجلي), so search for it in the knowledge of creeds and their differences.\n\nLikewise, these expressions, even if the apparent form of the referent is other than Allah, contrary to what the speaker intended, Allah only deals with him according to what he intended in that matter. The state of the speaker indicates this, as it was said: \"One looks at the speech and its speaker\"—meaning, what is the state of its author? If he is a friend of Allah (*wali*), then it is loyalty (*wala'*) even if it is rough; and if he is an enemy, then it is obscenity (*badha'*) even if it is beautiful. This is how we speak in our poetry, for all of it is Divine Gnosis (معارف إلهية) in various forms of amorous prelude (*tashbib*), praise, names of women, their descriptions, rivers, places, and stars. We have explained some of this in a poem we composed in Mecca, which we named *Tarjuman al-Ashwaq* (The Interpreter of Desires), and we explained it in a book we named *Al-Dhakhā'ir wa al-Aghlāq* (The Treasures and the Locks). This was because some jurists (*fuqaha'*) of Aleppo objected to our statement that the intention behind everything we composed in that *Tarjuman* was only Divine Gnosis and its similitudes. He said, \"He only did that because he is attributed to the religion, and he did not want such amorous verse and prelude to be attributed to him.\" May Allah reward him well for this statement, for it compelled us to write this commentary, and people benefited from it. Thus, we demonstrated to him and his like the truth of what we intended and claimed. When he became acquainted with the commentary, he repented to Allah for his objection and retracted it.\n\nIf we saw a man looking at the face of a woman whom he was proposing to, and we did not know he was proposing, if we were fair in the matter, we would not proceed to denounce him (*al-inkar*) while ignorant of his state, until we asked him what prompted him to do that. If he said, or if it was said to us, that he was proposing to her, or that he was a doctor and she had an illness that required the doctor to look at her face, we would know that he only looked at what was permissible for him to look at. Indeed, his looking would be an act of worship if the command from the Messenger (peace and blessings be upon him) had been issued concerning it. He should not be denounced initially given this possibility. The denouncer is no more entitled to denounce him than he is to denounce himself in that situation, given the possibility of these interpretations. For denunciation is only valid concerning matters that admit no possibility of interpretation. Many of the merely religious people (*al-mutadayyinin*) err in this, but not the People of the Firm Religion (*ashab al-din*). The People of the Firm Religion first take precautions concerning themselves, especially regarding denunciation, for the one who seeks to change a wrong (*al-mughayyir*) has conditions for making that change. Allah has encouraged us to have good presumption (*husn al-zann*) toward people, not ill presumption (*su' al-zann*). Therefore, the person of religion does not denounce based on mere presumption, having heard: <<إِنَّ بَعْضَ الظَّنِّ إِثْمٌ>> (Indeed, some presumption is sin). Perhaps this case falls under that \"some,\" and the sin lies in speaking about it. Even if it corresponds to the truth of the matter in reality, Allah holds him accountable for having presumed and not known, yet speaking about a matter that was open to interpretation, which was not his right.\n\nIll presumption concerning one's own self is more appropriate than ill presumption concerning others, because one is aware of one's own self with insight (*basira*), but not of others. Thus, it is not said concerning oneself that one has ill presumption toward oneself, because one is knowledgeable of oneself. We only said that he has ill presumption toward himself as a consequence of his ill presumption toward others; this is due to the coherence of the discourse, and it has a basis in the legal realities (*al-haqa'iq al-shar'iyya*). For, when looking at himself, he is not truly aware with certainty that the action he denounces in himself is a forbidden act that he knows; rather, he is operating on presumption. Therefore, ill presumption toward himself is more appropriate. This is because:\n\nThere are servants of Allah to whom Allah has said: \"Do what you wish, for I have forgiven you.\"\n\nYet they only perform what the Law permits them to do, even if they do not know that they are among those addressed by that statement—which is in the authentic Hadith. So, he only performs what is permissible in the sight of Allah, yet he has no knowledge of this. He is in this position before Allah. For this reason, we said ill presumption toward himself is appropriate, since he is not truly operating with insight concerning himself, given this possibility from the side of the Real (جانب الحق).\n\nAllah has established a sign for the one who possesses this characteristic, by which he knows himself to be one of those people. It is known without doubt, through sound legal knowledge, that the sanctity of a person's own soul before Allah is incomparably greater than the sanctity of others. He who kills himself is greater in crime than he who kills another, and his charity toward himself is greater in reward than his charity toward others. The righteous scholar is he who seeks to clear his religion in all his states, concerning himself and concerning others. Up until now, I have not seen anyone who claims affiliation with religion or knowledge standing upon this footing. Praise be to Allah, Who guided us to practice it and prevented us from neglecting it. Were it not for the benefit in mentioning this for the servants of Allah and the counsel it provides them, we would not have elaborated on the matter to this extent, even though the section requires it, for it is the section on admonition (*al-muwa'iza*).\n\nAllah says to His Prophet (peace and blessings be upon him) in what He revealed to him: <<ادْعُ إِلى‏ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ والْمَوْعِظَةِ الْحَسَنَةِ>> (Invite to the way of your Lord with wisdom and good admonition), such as the one we have mentioned. For this is a counsel from Him to the servants of Allah that combines wisdom (الحكمة)—because we have placed it in its proper station—and the ruling (*al-hukm*). The wise person (*al-hakim*) is he who places the matter in its proper station and does not exceed its degree. As for \"good admonition\" (الموعظة الحسنة), it is the admonition that comes from the one who reminds based on witnessing (*shuhud*). For *Ihsan* (spiritual excellence) is that you worship Allah as if you see Him. How much greater and better is the state of one who has realized that he *does* see Him!\n\nHis saying \"in pairs\" (مثنى) may refer to cooperation in standing up for Allah, the Exalted, in that matter. The form of cooperation in it is that the Law (*shar'*) has, in reality, denounced this action from the one who committed it. Thus, the believing scholar should stand up with the Lawgiver (*al-Musharri'*) in that matter and assist Him. Then there are two: he and the Law. And \"singly\" (فرادى) is when this denouncer does not know that he is assisting the Law in his denunciation and admonition, and he says, \"I have acted alone in this matter.\" Yet he is only assisting the Law and the Angel who says by his inner suggestion (*lumma*) to the doer, \"Do not do it,\" just as the Devil says by his inner suggestion, \"Do it.\" Thus, he is \"in pairs\" with the Angel, for the Angel is tasked with forbidding the servant whom Allah has assigned him to forbid concerning what Allah has tasked him to forbid. The human assists him in this, and thus becomes one of those who stood up for Allah \"in pairs.\" He may also be assisting the Lawgiver, who is the Messenger (peace be upon him), for it was he who first denounced this action by the doer and preceded in admonition concerning it. Thus, this admonishing person is \"in pairs\" with the preceding admonition of the Messenger, just as:\n\nSomeone asked the Messenger of Allah (peace and blessings be upon him) to make him his companion in Paradise. The Messenger of Allah (peace and blessings be upon him) said to him: \"Help me against your own self by increasing prostration.\"\n\nHe requested help from him, so they stood up \"in pairs\" in that matter: he and the Messenger of Allah (peace and blessings be upon him). Allah, the Exalted, said: <<وتَعاوَنُوا عَلَى الْبِرِّ والتَّقْوى‏>> (And cooperate in righteousness and piety), and He said: <<اسْتَعِينُوا بِاللَّهِ>> (Seek help from Allah). Thus, He associated Himself with His servant in the action. What Allah does not do except through proofs belongs to this category. Only the one knowledgeable of the secrets of Allah and the realities upon which they rest knows this. So, do not be heedless of this subtle point, and be the helper of the one I mentioned to you, and your outcome will be praiseworthy, and you will obtain a share in the assistance alongside the one who is assisted. The servant says: <<وإِيَّاكَ نَسْتَعِينُ>> (And You we ask for help), and the Real (الحق) says: \"This is between Me and My servant, and My servant shall have what he asked.\" Thus, His saying, \"This is between Me and My servant,\" is clarified: it is for Allah and for him in the ruling of assistance. If Allah wills the existence of the prayer, the preparedness of the locus (المحل) through which the prayer appears is necessary. Understand this.\n\n### A Section on His Saying, the Exalted: <<وَذَكِّرْهُمْ بِأَيَّامِ الله>>\n\nAs for reminding them of the Days of Allah (أيام الله), they are, in reality, the days of the breaths (*anfas*), for the breath is the shortest duration to which the name \"day\" can be applied. This is when you remind him by His saying: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in [a new] affair). Those are the Days of Allah, and you are heedless of them. This falls under the meaning of His saying, the Exalted: <<إِنَّ في ذلِكَ>> (Indeed, in that)—referring to His saying <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> along with other matters—<<لَعِبْرَةً لِمَنْ كانَ لَهُ قَلْبٌ>> (is a lesson for whoever has a heart), meaning, for whoever has insight (*fitna*) into the changing of states, or the changing of states upon him. Through this, he knows the affairs (شئون) of the Real (الحق) and the realities of the days in which the Real is engaged in an affair. The affair (*al-sha'n*) is one in essence, but the receptive loci (*al-qawabil*) are many and varied, and this affair diversifies within them according to their variety and difference. Thus, it is one from Allah, but many in the forms of the World (العالم), like a single image in many mirrors, or the many shadows cast by a single person due to multiple lamps. The matter is thus.\n\nOr, <<أَوْ أَلْقَى السَّمْعَ>> (or gives ear) to what is recited to him, such as His saying <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> and its like, <<وَهُوَ شَهِيدٌ>> (while he is a witness) to the changing of his own states, so that he is upon insight (*basira*) concerning that from Allah. These are the Days of Allah by which the servant should be reminded, in addition to other examples of the Days of Allah, which are the days of blessings (*ni'am*) and the days of vengeance (*intiqam*) in which Allah seized the past generations.\n\nKnow that afflictions (*balaya*) are more numerous than blessings (*ni'am*) in this world (الدنيا). There is no blessing that Allah bestows upon His servants that is free from affliction, for Allah demands that they fulfill its right: by giving thanks for it, by attributing it to the One Who deserves it through origination (*al-ijad*), and by spending it in the place where the Real (الحق) commanded it to be spent. If one's witnessing (شهود) of blessings is this kind of witnessing, when will he find time to enjoy them? Likewise, calamities (*razaya*) are in themselves misfortunes and afflictions, and they contain the same kind of obligation (*taklif*) as blessings: the demand for patience (*sabr*) concerning them, turning back to the Real for their removal, and receiving them with contentment (*rida*) or patience, which is restraining the soul from complaining *by* Allah to other than Allah. This is the height of ignorance concerning Allah, because you complain *by* the Powerful to the weak, due to the comfort you find in the state of complaining, even though you complain to one who cannot be complained to, for you know that he possesses nothing and cannot remove what has befallen you except the One Who sent it down. You already know that this abode is the abode of affliction, where bliss is never free from affliction for a single moment. The least of it is the demand for gratitude from the Bestower of the blessing. What obligation is harder on the soul than this? That is why the Exalted said: <<وقَلِيلٌ من عِبادِيَ الشَّكُورُ>> (And few of My servants are grateful), due to their ignorance that blessings are indeed blessings for which gratitude is obligatory. What we have said is supported by His saying, the Exalted: <<إِنَّ في ذلِكَ لَآياتٍ لِكُلِّ صَبَّارٍ شَكُورٍ>> (Indeed, in that are signs for everyone patient and grateful). This refers to the sea traveler when the wind intensifies upon him: in the blessing contained therein, gratitude is demanded of him; and in the severity and fear contained therein, patience is demanded of him. So understand and contemplate the speech of Allah, and you will profit. Allah only sent it down as a reminder for the intelligent, as He said: <<لِيَدَّبَّرُوا آياتِهِ ولِيَتَذَكَّرَ أُولُوا الْأَلْبابِ>> (That they might reflect upon its verses and that those of understanding might be reminded). Do not be among those whose only share of it is the mere conveyance [of the message].\n\n### A Section on the Barren Day\n\nThe barren (*al-'aqim*) is that which necessitates that nothing is born from it, so it has no offspring like itself. It is called barren because there is absolutely no day after it. It is, among the days of the week, Saturday (يوم السبت), which is the Day of Eternity (يوم الأبد). Its day is perpetual light for the People of Paradise (أهل الجنة), never ceasing eternally, and its night is perpetual darkness for the People of the Fire (أهل النار), never ceasing eternally. For this reason, the perpetrators of major sins who will exit the Fire after punishment and enter Paradise will die in it, since there is no eternity in the Fire except for its true inhabitants.\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"As for the People of the Fire who are its inhabitants, they will neither die therein nor live. But there are people whom the Fire will strike due to their sins, and Allah will cause them to die therein, a death...\"\n\nThe Hadith is authentic. They will sleep a sleep in it so that they do not feel the Fire when it touches them, when it takes hold of the instruments of disobedience by consuming them—which are the limbs. Faith (الإيمان) prevents the Fire from reaching the heart. This is the providence of the Oneness (التوحيد) that was in their hearts. Thus, the knowledge of Oneness causes them to die in the Fire the death of a sleeper during his sleep. Faith waits for them at the gate of the Fire until Allah resurrects them from that sleep, when they have become charcoal. The Glorified One will bring them out and immerse them in the River of Life, where they will sprout like a seed carried by the flood. Then they will enter Paradise. Thus, no one who knew that Allah is one God in this world, even for a single moment, will remain in the Fire.\n\nThe People of Paradise (أهل الجنة) have measures in Paradise by which they know the duration of the rising and setting of the sun in the world (الدنيا), even though there is no sun in Paradise. The movement that used to carry the sun, causing its rising and setting to appear, exists in the Atlas Sphere (*al-Falak al-Atlas*), which is the roof of Paradise. The very same movement exists within it. The People of Paradise have an unveiling (*kashf*) and a vision of the measures within it, which are expressed by the constellations (*al-buruj*). That sphere is the heaven by which Allah swore in His saying: <<والسَّماءِ ذاتِ الْبُرُوجِ>> (By the heaven containing the constellations). By this, they know the limits of what was upon them in the world, which was called morning (*bukra*) and evening (*'ashiyy*). They had a state in this time in the world called breakfast (*ghada'*) and dinner (*'asha'*). They remember these times there, and Allah brings them provision at those times, as He said: <<لَهُمْ رِزْقُهُمْ فِيها بُكْرَةً وعَشِيًّا>> (They will have their provision therein, morning and evening). This is a special provision at a special time known to them. Apart from that, their food is perpetual (*dā'im*) and never ceases.\n\nThe perpetuity in eating is the very essence of bliss, due to the nourishment it provides to the body. However, many people are unaware of this, except for those knowledgeable in the science of nature (*'ilm al-tabi'a*). This—meaning the meaning of His saying <<أُكُلُها دائِمٌ>> (its food is perpetual)—is that when a person eats food until he is full, that is not nourishment (*ghidha'*) or eating in the true sense. Rather, it is like the collector gathering money in his treasury, and the stomach is the treasury for what this eater has gathered of foods and drinks. When he places it therein—that is, in the treasury of his stomach—and finishes eating, nature (*al-tabi'a*) takes over the management. That food transitions from state to state and nourishes him with it constantly, with every breath he exhales. Thus, he is perpetually in constant nourishment. Were it not for this, the wisdom in the arrangement of the growth of every nourished being would be nullified, and Allah is Wise. When the treasury is empty, nature moves the collector to acquire what will fill it. The matter remains thus, perpetually and eternally. This is the form of nourishment for the nourished being. Nourishment occurs with every breath, both in this world (dunya) and the Hereafter (akhira).\n\nLikewise, the People of the Fire (أهل النار) are described by Allah as eating and drinking therein according to this limit, except that it is the abode of affliction. They eat out of hunger and drink out of thirst. The People of Paradise eat and drink out of desire for pleasure, not out of hunger, for they do not consume the thing called nourishment except with the knowledge that the time for the stored provision has passed, and they hasten to nature with what it manages. Thus, they remain in pleasure and bliss, without nature needing to seek or require anything, due to the unveiling (الكشف) they possess.\n\nJust as the People of the Fire (أهل النار) are in veiling (*hijab*), they do not know this measure, so they hunger and thirst, because the purpose for them is to suffer pain. Thus, it becomes clear to you that there is no pleasure except Knowledge (العلم) and no pain except Ignorance (الجهل).\n\nThe Sun is coiled up (*mukawwara*), its light having been removed in their eyes, rising upon the People of the Fire and setting, just as it rises upon the people of the world during its eclipse. Likewise, the Moon and all the planets orbit in the same manner as they orbit now in their spheres, but they are obscured (*matmusa*) in the eyes of the People of the Fire. In reality, it is they whose eyes Allah has obscured, by His Will, from perceiving the lights in the visible objects. The veil (*hijab*) is over their eyes, just as we know that the Sun here, during its eclipse, has not lost its light, but the Moon has merely veiled it from us. If it were not so, the people of the sciences would not know when the eclipse would occur and how much of it would be obscured from our eyes during the eclipse, and this occurs exactly as they predict. If these were not matters that proceed according to established measures and precise balances, which Allah has informed those whom He guided to seek such knowledge, they would not know it. This does not contradict our statement that the Sun has been eclipsed or that its light has vanished from the perception of our eyes, for concerning this measure and this form, there is nothing to prevent us from agreeing to apply to it the name eclipse (*kusuf*), lunar eclipse (*khusuf*), coiling (*takwir*), and obscuring (*tams*).\n\nThe People of the Fire witness the celestial bodies rising and setting upon them, but they do not witness any light for them, due to the dimming effect of the smoke. Just as they were blind in the world (الدنيا) to the perception of the lights brought by the Divine Laws (الشرائع) of the Real (الحق), so too are they blind in the Fire to the perception of the lights of these planets and other stars. <<ومَنْ كانَ في هذِهِ أَعْمى‏ فَهُوَ في الْآخِرَةِ أَعْمى‏ وأَضَلُّ سَبِيلًا>> (And whoever is blind in this [world] will be blind in the Hereafter and more astray in way). He is more astray in way because in the world he finds someone to guide him to the path, but he does not listen. In the Fire, he finds no one to guide him to the path, for there is no path there. Rather, he finds those who cause him regret for what he missed, to increase his sorrow upon his sorrow and his torment upon his torment. Thus, the night of the People of the Fire has no morning, and the day of the People of Paradise has no evening—meaning, no night.\n\nTherefore, whoever preaches to people concerning their creed (*'aqd*), seeking thereby to benefit them in their creed, has not known Allah. This is contrary to the Reminder (*al-Mudhakkir*), who reminds and admonishes with what he possesses, and knows that among the listeners, that admonition will be a healing and a remedy for some, while for others it will increase sickness upon their sickness. As the Exalted said: <<وإِذا ما أُنْزِلَتْ سُورَةٌ>> (And whenever a surah is revealed)—and it is one—<<فَأَمَّا الَّذِينَ آمَنُوا فَزادَتْهُمْ إِيماناً وهُمْ يَسْتَبْشِرُونَ>> (as for those who believed, it increased them in faith, and they rejoice) at the arrival of well-being upon them, <<وأَمَّا الَّذِينَ في قُلُوبِهِمْ مَرَضٌ فَزادَتْهُمْ رِجْساً إِلَى رِجْسِهِمْ>> (but as for those in whose hearts is sickness, it added defilement to their defilement). The *surah* is one, but the temperaments (*al-mizaj*) are different.\n\nThe reality of this verse is known only by physicians, who know that a certain drug is a cure for a specific temperament suffering from a specific disease, yet it is a sickness and ailment for another specific temperament, increasing the disease upon the disease. Thus, the physician is the most knowledgeable person concerning this verse, and likewise is the physician of hearts concerning what gives them security and what frightens them. The wise person (*al-hakim*) is he who approaches the sick person from what he is made of, and manifests himself to him in the form of one whom the sick person believes in, so as to gradually lead him toward the form of the Real (الحق) with the truth that is appropriate for him. However, the Divine Command (*al-amr al-ilahi*) in the world has occurred contrary to this, because the Will of Allah (*Mashi'at Allah*) decreed that Allah would not unite them upon guidance.\n\nAs for the path in this matter, it is known to Allah and to His People, who have no doubt concerning it. For the one who believes that a created thing—be it a stone, a plant, an animal, or a star—is his god, and he worships it, that perceived god addresses him through unveiling (*kashf*) with what the Real (الحق) is upon, and he returns to its word due to his belief in it, just as he will return to its word in the Hereafter, and it will disavow him, just as his god disavowed him. Allah is capable of making it speak in this world concerning the one who worships it, but the Pre-existent Knowledge (*al-'Ilm al-Sabiq*) and the Divine Will (المشيئة الإلهية) prevented this, so that difference might exist in the world. Thus, the matter proceeded according to this in the world and in part of the Hereafter. The matter returns to the ruling of the taking of the Covenant (*al-mithaq*) by the Mercy (الرحمة) that <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompasses all things). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر تین سو اٹھانوے: ان لوگوں کے مقام کی معرفت میں جنہوں نے لوگوں کو وعظ کیا مگر مجھے نہ پہچانا، اور جنہوں نے انہیں یاد دلایا (تذکر کیا) انہوں نے مجھے پہچانا۔ پس تم ان دونوں میں سے جو چاہو بن جاؤ۔\n\nمخلوق ذات حق (الحق) کا سایہ ہے، اس کے لیے کوئی ایسی ہستی (الوجود) نہیں ہے جسے علم یا بصارت ثابت کر سکے۔\n\nاگر وہ کھڑا ہو تو اس کے ذریعے کھڑا ہوتا ہے، یا چلے تو اس کے ذریعے چلتا ہے۔ پس اس کی حقیقت وہ (الحق) نہیں ہے، اور اس کی ہستی (الوجود) بشر ہے۔\n\nاس ہستی (الوجود) پر تعجب کرو جس کی اپنی کوئی ہستی (الوجود) نہیں، اور اگر وہ زائل ہو جائے تو نفع اور نقصان بھی زائل ہو جائیں گے۔\n\nیہ جو میں نے کہا ہے، عقل اسے نہیں جانتی، اور اسے سورج اور چاند کے سوا کوئی نہیں سمجھتا۔\n\nپس سورج مونث ہے، اور چاند (بدر التم) اگر تفکر کی آنکھ اس میں دیکھے تو وہ حاکم مذکر ہے۔\n\nپس وہ ان دونوں کے درمیان تھا، مگر ہمارے ذریعے، اور وہ دونوں ان کے سوا نہیں ہیں۔ اگر تم عبرت حاصل کرنے والے ہو تو عبرت حاصل کرو۔\n\nمیں اس ایک پر حیران ہوں جس کی ذات میں کثرت ہے، اسی کے لیے ظہور ہے اور اسی میں کائنات اور غیر ہیں۔\n\n### [تذکر اور وعظ کس کے لیے ہے]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح سے تائید بخشے، کہ اللہ سبحانہ و تعالیٰ فرماتا ہے: \"اور انہیں اللہ کے دنوں کی یاد دلاؤ (وَذَكِّرْهُمْ بِأَيَّامِ الله)\"۔ اور اللہ تعالیٰ نے اپنی عزیز کتاب میں اپنے نبی صلی اللہ علیہ وسلم کو جس کا حکم دیا، فرمایا: \"کہہ دو، میں تمہیں صرف ایک بات کی نصیحت کرتا ہوں (قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ)\"۔ اور اللہ عزوجل نے فرمایا: \"یا ان پر بانجھ دن کا عذاب آ جائے (أَوْ يَأْتِيَهُمْ عَذابُ يَوْمٍ عَقِيمٍ)\"۔ پس اس مقام کا مدار ان تین آیات پر ہے۔\n\nپس تذکر (یاد دہانی) غافل علماء (العلماء الغافلين) کے لیے ہے، اور وعظ تمام لوگوں (الناس أجمعين) کے لیے نہیں ہوتا۔ اسی لیے فرمایا: \"جس نے لوگوں کو وعظ کیا اس نے مجھے نہیں پہچانا\"، کیونکہ وہ انہیں اس چیز کے ذریعے وعظ کرتا ہے جو مجھ سے ہوتی ہے، نہ کہ میرے ذریعے (بی)۔ اسی طرح جو انہیں خوف دلاتا ہے، وہ بھی اس چیز کے ذریعے خوف دلاتا ہے جو مجھ سے ہوتی ہے، نہ کہ مجھ سے (منی)۔ پس ترغیب (الترغيب) ترہیب (الترهيب) کے درجے میں نہیں آتی، کیونکہ ترغیب تو مجھ میں ہو سکتی ہے، لیکن ترہیب صرف اس چیز سے ہوتی ہے جو مجھ سے ہوتی ہے، نہ کہ مجھ سے (منی)۔\n\nاور بانجھ دن (اليوم العقيم) وہ ہے جو اپنے جیسا کوئی زمانہ پیدا نہ کرے، یعنی اس کے بعد کوئی دن نہ ہو جو اس سے پیدا ہو۔ کیونکہ دنیا میں دن، ہر دن اپنے سے پچھلے دن کا بیٹا ہوتا ہے، اور وہ دونوں (رات اور دن) جڑواں ہوتے ہیں۔ رات مونث ہے اور دن مذکر، پس وہ باہم نکاح کرتے ہیں اور وہ دن اور رات پیدا ہوتے ہیں جو ان کے بعد آتے ہیں، اور والدین چلے جاتے ہیں، کیونکہ وہ کبھی اکٹھے نہیں ہوتے۔ اور رات اور دن کے ایک دوسرے پر چھا جانے اور ایک دوسرے میں داخل ہونے سے ان امور اور کوائن (الكوائن) کی پیدائش ہوتی ہے جو ان میں سے ہر ایک میں تشکیل پاتے ہیں، جو کہ ذات حق (الحق) کے شؤون میں سے ہیں۔ پس رات مذکر ہوتی ہے اور دن مونث، ان حوادث کی وجہ سے جو دن میں پیدا ہوتے ہیں، اور دن مذکر ہوتا ہے اور رات مونث، ان حوادث کی وجہ سے جو رات میں پیدا ہوتے ہیں۔ اور رات مونث ہوتی ہے اور دن مذکر، ان جڑواں بچوں کی پیدائش کے لیے جو دوسرا دن اور اس کی رات ہیں۔ اور رات اصل ہے اور دن اس سے ہے، جیسے حوا آدم سے ہیں۔ پھر نکاح اور پیداوار واقع ہوتی ہے۔\n\n### «فصل» اس ایک بات میں جس کے ذریعے واعظ وعظ کرتا ہے\n\nوہ ایک بات یہ ہے کہ تم اللہ کی خاطر کھڑے ہو جاؤ، جب تم اللہ کا کوئی ایسا فعل اس کی کائنات میں دیکھو جس کے لیے تمہیں کھڑے ہونے کا حکم دیا گیا ہے، خواہ غیرت کی وجہ سے ہو یا تعظیم کی وجہ سے۔ پس اس کے کھڑے ہونے کا قول \"دو دو\" (مثنیٰ) ہے، اللہ اور اس کے رسول کے ساتھ، کیونکہ جس نے رسول کی اطاعت کی، \"تو اس نے یقیناً اللہ کی اطاعت کی (فَقَدْ أَطاعَ الله)\"۔ پس تم اللہ کے لیے کتاب یا سنت کے ساتھ کھڑے ہو، نہ کہ نفسانی خواہش، طبعی عار، یا کونی تعظیم کی وجہ سے۔ اور \"تنہا تنہا\" (فرادیٰ) یا تو صرف اللہ کے لیے ہو، یا صرف اس کے رسول کے لیے، جیسا کہ نبی صلی اللہ علیہ وسلم نے فرمایا: \"میں تم میں سے کسی کو اس حال میں نہ دیکھوں کہ وہ اپنی مسند پر ٹیک لگائے بیٹھا ہو، اور میری کوئی حدیث اس کے پاس آئے تو وہ کہے کہ اسے مجھ پر قرآن کے طور پر پڑھو۔ اللہ کی قسم! یہ (حدیث) قرآن کی مانند ہے یا اس سے زیادہ ہے۔\"\n\nپس آپ صلی اللہ علیہ وسلم کا قول \"زیادہ\" مرتبے کی بلندی کے لیے ہے۔ کیونکہ قرآن کے معاملے میں اللہ اور آپ کے درمیان روح الامین واسطہ ہیں، جبکہ حدیث اللہ کی طرف سے براہ راست آپ کی طرف ہوتی ہے۔ اور یہ معلوم ہے کہ اسناد میں قرب، دوری سے زیادہ بڑا مرتبہ رکھتا ہے، اگرچہ راستے میں صرف ایک شخص کی کمی ہو۔ یہ اس لیے ہے کہ اس میں اس کا حکم کم ہو جاتا ہے، کیونکہ خبر لازمی طور پر پہنچانے والے سے ایک صورت اختیار کر لیتی ہے، لہٰذا وہ اپنی اصل حالت پر نہیں رہتی جس سے وہ نقل کی گئی ہے۔ اور خبر دینے والے کے اس قول میں سچائی نہیں ہوتی کہ \"یہ فلاں کا کلام ہے\" جیسا کہ وہ شخص جو اسے براہ راست نقل کرتا ہے یا اسے سنتا ہے، اور یہ زبان اور لغت کی تبدیلی کی وجہ سے ہے۔ کیونکہ ترجمان اس بات کو بعینہٖ نقل نہیں کرتا جو اس شخص نے کہی جس سے وہ نقل کر رہا ہے، بلکہ وہ اپنے نقل میں وہی بات کرتا ہے جو اس نے اس سے سمجھی ہے۔ اور جب تم خود وہ ہو جس سے نقل کیا جا رہا ہے، تو تم اس کے طبقے میں ہو، اور تم اس سے کوئی ایسی بات سمجھ سکتے ہو جو تمہارے لیے ترجمہ کرنے والا نہ سمجھ سکا ہو۔ اسی وجہ سے حدیث قرآن سے زیادہ تھی، اور زیادہ سے زیادہ یہ ہو سکتا ہے کہ جب وہ اس طبقے سے نیچے اترے تو اس کے برابر ہو۔ اور رسول اللہ صلی اللہ علیہ وسلم نے \"زیادہ ہونے\" کی طرف رجوع نہیں فرمایا مگر اس لیے کہ معاملہ بلاشبہ زیادہ ہی تھا۔ اور ہم نے قرآن کے بارے میں یہ اس لیے کہا کہ وہ واسطے سے ہے، اللہ تعالیٰ کے اس قول کی وجہ سے: \"اسے روح الامین نے آپ کے دل پر نازل کیا (نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ)\"، اور اس کے قول کی وجہ سے: \"کہہ دو، اسے روح القدس نے تمہارے رب کی طرف سے نازل کیا ہے (قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ من رَبِّكَ)\"، اور اس کے قول کی وجہ سے: \"اور قرآن کے معاملے میں جلدی نہ کرو اس سے پہلے کہ اس کی وحی تمہاری طرف پوری کر دی جائے (ولا تَعْجَلْ بِالْقُرْآنِ من قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ)\"، اور \"کہو، اے میرے رب! مجھے علم میں اضافہ فرما (قُلْ رَبِّ زِدْنِي عِلْماً)\"۔ یہ وہ علم ہے جو اللہ کی طرف سے واسطے کو ہٹا کر آپ کی طرف ہوتا ہے، اور یہی وہ حدیث ہے جسے قرآن نہیں کہا جاتا۔ پس کسی واعظ کے لیے مناسب نہیں کہ وہ اپنے وعظ میں کتاب یا سنت سے باہر نکلے، اور نہ ہی ان بڑی غلطیوں میں پڑے کہ یہودیوں، عیسائیوں اور ان مفسرین سے نقل کرے جو اپنی تفاسیر کی کتابوں میں ایسی باتیں نقل کرتے ہیں جو نہ تو اللہ کی جناب کے لائق ہیں اور نہ ہی اللہ کے رسولوں علیہم السلام کے مرتبے کے لائق ہیں۔\n\nجیسا کہ ہم نے منصور بن عمار سے روایت کی ہے کہ ایک شخص نے انہیں ان کی وفات کے بعد خواب میں دیکھا، اور وہ واعظین میں سے تھے۔ اس نے ان سے پوچھا: \"اے منصور! تمہارے ساتھ کیا معاملہ ہوا؟\" انہوں نے کہا: \"ذات حق (الحق) نے مجھے اپنے سامنے کھڑا کیا اور فرمایا: 'اے منصور! تم کس چیز کے ذریعے میرے قریب ہوئے؟' میں نے عرض کیا: 'میں لوگوں کو وعظ کرتا اور انہیں یاد دلاتا تھا۔' تو الحق نے فرمایا: 'اے منصور! کیا تم زینب اور سعاد کے اشعار کے ذریعے میرا قرب چاہتے تھے اور میرے بندوں کو وعظ کرتے تھے؟' اور مجھے وہ اشعار یاد دلائے جو میں منبر پر پڑھا کرتا تھا، جو اہل محبت نے اپنے محبوبوں کے بارے میں کہے تھے۔ پس مجھ پر سختی کی گئی، پھر فرمایا: 'میرے اولیاء میں سے ایک تمہاری مجلس میں حاضر ہوا تھا۔ میں نے اس مجلس میں کہا: اے اللہ! ہم میں سے سب سے سخت دل اور سب سے خشک آنکھ والے کو بخش دے۔' تو اس ولی نے جو تمہارے پاس حاضر تھا، کہا: 'اے اللہ! جس کی یہ صفت ہے اسے بخش دے۔' پس میں نے جھانکا تو تجھ سے زیادہ خشک آنکھ والا اور سخت دل والا کوئی نہ پایا۔ پس میں نے تیرے حق میں اپنے ولی کی دعا قبول کر لی اور تجھے بخش دیا۔\"\n\nپس کسی واعظ کے لیے مناسب نہیں کہ وہ اپنی مجلس میں صرف وہی شعر پڑھے جس میں کہنے والے نے تغزل کی زبان میں یا کسی اور طریقے سے اللہ کا ذکر کرنے کا ارادہ کیا ہو۔ کیونکہ یہ وہ کلام ہے جو اہل اللہ کہتے ہیں، لہٰذا یہ قولاً اور سماعاً حلال ہے، کیونکہ اس پر اللہ کا نام لیا گیا ہے۔ اور اللہ کے حق میں ایسا شعر نہیں پڑھنا چاہیے جسے کہنے والے نے پہلی بار وضع کرتے وقت اللہ کے علاوہ کسی اور کے لیے ارادہ کیا ہو، خواہ وہ تغزل ہو یا مدح۔ کیونکہ یہ اس شخص کی طرح ہے جو اللہ کا قرب حاصل کرنے کے لیے ناپاکی سے وضو کرے۔ کیونکہ محدث (نئی بات) میں قول بلاشبہ ایک حدث ہے۔ اور اللہ نے اپنی کتاب میں اس مقام پر متنبہ فرمایا ہے، اپنے اس قول سے: \"اور تمہیں کیا ہے کہ تم اس میں سے نہ کھاؤ جس پر اللہ کا نام لیا گیا ہو (وما لَكُمْ أَلَّا تَأْكُلُوا مِمَّا ذُكِرَ اسْمُ الله عَلَيْهِ)\"، اور اس کے قول سے: \"اور اس میں سے نہ کھاؤ جس پر اللہ کا نام نہ لیا گیا ہو، اور یہ یقیناً فسق ہے (ولا تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ الله عَلَيْهِ وإِنَّهُ لَفِسْقٌ)\"۔ اور فرمایا: \"تم پر مردار، خون، خنزیر کا گوشت، اور وہ چیز حرام کی گئی ہے جو اللہ کے علاوہ کسی اور کے لیے ذبح کی گئی ہو (حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ والدَّمُ ولَحْمُ الْخِنْزِيرِ وما أُهِلَّ لِغَيْرِ الله به)\"۔ اور وہ شعر جو اللہ کے علاوہ کسی اور کے حق میں ہو، وہ اس چیز میں سے ہے جو اللہ کے علاوہ کسی اور کے لیے پکارا گیا ہے۔ کیونکہ نیت کا چیزوں میں اثر ہوتا ہے۔ اور اللہ فرماتا ہے: \"اور انہیں صرف اسی بات کا حکم دیا گیا تھا کہ وہ اللہ کی عبادت کریں، دین کو اس کے لیے خالص کرتے ہوئے (وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ)\"۔ اور اخلاص (الإخلاص) نیت ہے۔ اور اس شاعر نے اپنے شعر میں اپنے محبوب کے تغزل اور اس شخص کی مدح کے سوا کچھ نیت نہیں کی جس کا وہ اہل نہیں تھا، جیسا کہ اس نے اس میں گواہی دی۔\n\nاور میرے بھائیوں میں سے ایک شخص نے مجھے ایک خط لکھا جس میں اس نے میری بہت تعظیم کی، یہاں تک کہ مجھے تریسٹھ (۶۳) القاب سے نوازا۔ تو میں نے اسے لکھا: \"ان کی گواہیاں لکھی جائیں گی اور ان سے پوچھا جائے گا (سَتُكْتَبُ شَهادَتُهُمْ ويُسْئَلُونَ)\"۔ اور اس کے ساتھ ہی میں نے اپنے جوابی خط میں اسے یاد دلایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"میں اللہ پر کسی کا تزکیہ نہیں کرتا، لیکن کہتا ہوں کہ میں اسے ایسا سمجھتا ہوں اور ایسا گمان کرتا ہوں۔\" اور اللہ تعالیٰ فرماتا ہے: \"پس تم اپنی جانوں کا تزکیہ نہ کرو، وہ زیادہ جانتا ہے کہ کون پرہیزگار ہے (فَلا تُزَكُّوا أَنْفُسَكُمْ هُوَ أَعْلَمُ بِمَنِ اتَّقى‏)\"۔\n\nاگر یہ کہنے والا شروع ہی سے ذات حق (الحق) کی نیت کرتا، خواہ وہ کسی بھی صورت میں چاہے، تو شاید وہ قول اللہ کا قرب بن جاتا۔ کیونکہ اعمال کا دار و مدار نیتوں پر ہے، اور ہر شخص کے لیے وہی ہے جو اس نے نیت کی۔ بے شک اللہ انسان کے دل میں موجود چیزوں سے باخبر ہے، اور اللہ کے لیے وہ دن ہے جب پوشیدہ رازوں کو جانچا جائے گا۔ اور ہر وہ چیز جو شرعاً اللہ کا قرب ہو، وہ اس میں سے ہے جس پر اللہ کا نام لیا گیا اور اللہ کے لیے پکارا گیا۔ اور اگرچہ وہ تغزل کے الفاظ میں ہو، اور جگہوں، باغات اور پڑوسیوں کا ذکر ہو، اور ان سب سے مقصود وہ عبرت ہو جو معارف الٰہیہ اور علوم ربانیہ کے مناسب ہو، تو کوئی حرج نہیں، اگرچہ انکار کرنے والا (المنكر) اس کا انکار کرے۔ کیونکہ ہمارے پاس ایک اصل ہے جس کی طرف ہم اس معاملے میں رجوع کرتے ہیں، اور وہ یہ ہے کہ اللہ تعالیٰ قیامت کے دن اپنے بندوں کے لیے ایک ایسی صورت میں ظہور الٰہی (التجلی) فرمائے گا جسے وہ پہچاننے سے انکار کر دیں گے، یہاں تک کہ وہ اس سے پناہ مانگیں گے اور کہیں گے: \"ہم تجھ سے اللہ کی پناہ مانگتے ہیں، تو ہمارا رب نہیں ہے۔\" اور وہ فرمائے گا: \"میں تمہارا رب ہوں،\" اور وہ وہی (الحق) ہے۔ اور اس کے ظہور الٰہی (التجلی) میں ایک راز ہے، پس تم عقائد کی معرفت اور ان کے اختلاف میں اس کی تحقیق کرو۔\n\nاسی طرح یہ الفاظ بھی ہیں، اگرچہ ان میں مسمیٰ کی صورت ظاہر میں اللہ کے علاوہ کوئی اور ہو، اور یہ کہنے والے کی نیت کے خلاف ہو، تو اللہ اس کے ساتھ صرف اس کی نیت کے مطابق معاملہ کرتا ہے۔ اور کہنے والے کے احوال اس پر دلالت کرتے ہیں، جیسا کہ کہا گیا ہے: \"قول اور اس کے کہنے والے کو دیکھا جاتا ہے\" (وہ یہ مراد لیتے ہیں) \"اور اس کے قاتل کا حال کیا ہے؟\" پس اگر وہ ولی ہے تو وہ ولایت ہے، اگرچہ وہ سخت ہو، اور اگر وہ دشمن ہے تو وہ بدکلامی ہے، اگرچہ وہ اچھی ہو۔ جیسا کہ ہم اپنے اشعار میں ذکر کرتے ہیں، وہ سب مختلف صورتوں میں معارف الٰہیہ ہیں، خواہ وہ تشبیب (عشق و محبت کا ذکر)، مدح، عورتوں کے نام اور ان کی صفات، نہریں، جگہیں اور ستارے ہوں۔ اور ہم نے مکہ میں اپنی ایک نظم کی شرح کی جسے ہم نے \"ترجمان الأشواق\" نام دیا، اور اس کی شرح ایک کتاب میں کی جسے ہم نے \"الذخائر والأغلاق\" نام دیا۔ کیونکہ حلب کے بعض فقہاء نے ہم پر اعتراض کیا تھا کہ ہم نے ذکر کیا کہ اس \"ترجمان\" میں ہم نے جو کچھ بھی نظم کیا ہے، اس سے مراد صرف معارف الٰہیہ اور ان کی مثالیں ہیں۔ تو انہوں نے کہا کہ اس نے ایسا اس لیے کیا کہ وہ دین سے منسوب ہے، لہٰذا وہ نہیں چاہتا تھا کہ اس کی طرف اس طرح کا تغزل اور نسيب منسوب کیا جائے۔ پس اللہ انہیں اس قول پر جزائے خیر دے، کیونکہ اس نے ہمیں اس شرح کی طرف مائل کیا، جس سے لوگوں نے فائدہ اٹھایا۔ پس ہم نے انہیں اور ان جیسے لوگوں کو اپنی نیت اور دعوے کی سچائی ظاہر کر دی۔ جب وہ اس کی شرح پر مطلع ہوئے تو انہوں نے اللہ سے توبہ کی اور رجوع کیا۔\n\nاور اگر ہم کسی شخص کو کسی عورت کے چہرے کی طرف دیکھتے ہوئے دیکھیں، اور وہ اس کا منگیتر ہو، اور ہمیں معلوم نہ ہو کہ وہ منگیتر ہے، اور ہم معاملے میں انصاف کرنے والے ہوں، تو ہم اس پر انکار کرنے میں پہل نہیں کریں گے جب تک کہ ہم اس کا حال نہ جان لیں، یہاں تک کہ ہم اس سے پوچھیں کہ اسے کس چیز نے اس کی طرف مائل کیا۔ پس اگر وہ کہے، یا ہمیں بتایا جائے کہ وہ اس کا منگیتر ہے، یا وہ ڈاکٹر ہے اور اسے کوئی ایسی بیماری ہے جس کے لیے ڈاکٹر کا اس کے چہرے کو دیکھنا ضروری ہے، تو ہم جان لیں گے کہ اس نے صرف اسی چیز کی طرف دیکھا ہے جس کی طرف اسے دیکھنا جائز ہے، بلکہ اس کا دیکھنا عبادت ہو گا اگر رسول اللہ صلی اللہ علیہ وسلم کی طرف سے اس بارے میں حکم وارد ہوتا۔ اور اس احتمال کے ساتھ ابتداء میں اس پر انکار نہیں کیا جائے گا۔ پس انکار کرنے والے کا اس پر انکار کرنا، اس انکار کرنے والے پر انکار کرنے سے زیادہ بہتر نہیں ہے، جبکہ ان احتمالات کا موجود ہونا ممکن ہے۔ کیونکہ منکرات (ناپسندیدہ افعال) صرف اسی صورت میں صحیح ہوتے ہیں جب ان میں کسی احتمال کی گنجائش نہ ہو۔ اور اس میں بہت سے متدین لوگ غلطی کرتے ہیں، نہ کہ اہل دین۔ کیونکہ مضبوط دین والے سب سے پہلے اپنی ذات پر احتیاط کرتے ہیں، خاص طور پر انکار کے معاملے میں۔ کیونکہ تغیر (برائی کو بدلنے) کے لیے شرائط ہیں۔ بے شک اللہ نے ہمیں لوگوں کے ساتھ حسن ظن رکھنے کی ترغیب دی ہے، نہ کہ سوء ظن کی۔ پس صاحب دین گمان کی بنیاد پر انکار نہیں کرتا، جبکہ اس نے سنا ہے کہ \"بے شک بعض گمان گناہ ہیں (إِنَّ بَعْضَ الظَّنِّ إِثْمٌ)\"۔ تو شاید یہ اسی بعض میں سے ہو، اور اس کا گناہ یہ ہے کہ وہ اسے زبان سے نکالے، اگرچہ وہ حقیقت میں علم کے مطابق ہو۔ کیونکہ اللہ اسے اس بات پر پکڑے گا کہ اس نے گمان کیا اور علم نہیں رکھا، پس اس نے ایک محتمل امر میں بات کی، اور اسے اس کا حق نہیں تھا۔ اور انسان کا اپنی ذات کے بارے میں سوء ظن رکھنا، دوسروں کے بارے میں سوء ظن رکھنے سے زیادہ بہتر ہے، کیونکہ وہ اپنی ذات کے بارے میں بصیرت پر ہے، اور دوسروں کے بارے میں بصیرت پر نہیں ہے۔ پس اس کے حق میں یہ نہیں کہا جائے گا کہ وہ اپنی ذات کے بارے میں سوء ظن رکھتا ہے، کیونکہ وہ اپنی ذات کو جانتا ہے۔ اور ہم نے اس کے بارے میں یہ اس لیے کہا کہ وہ اپنی ذات کے بارے میں سوء ظن رکھتا ہے، تاکہ وہ دوسروں کے بارے میں سوء ظن رکھنے کی پیروی کرے۔ پس یہ کلام کی مناسبت میں سے ہے، اور شرعی حقائق میں اس کی ایک وجہ ہے۔ کیونکہ اپنی ذات کے اعتبار سے، وہ اپنے اس فعل میں جس کا وہ اپنی ذات پر انکار کرتا ہے، حقیقت میں یہ جانتے ہوئے نہیں ہوتا کہ وہ اپنے اس فعل میں کسی ایسے منکر پر ہے جسے وہ جانتا ہو، بلکہ وہ گمان پر ہوتا ہے۔ پس اپنی ذات کے بارے میں سوء ظن زیادہ بہتر ہے، اور یہ اس لیے ہے کہ:\n\n\"اللہ کے کچھ بندے ہیں جن سے اللہ نے فرمایا ہے: جو چاہو کرو، میں نے تمہیں بخش دیا ہے۔\"\n\nپس انہوں نے صرف وہی کیا جس کی شریعت نے انہیں اجازت دی، اگرچہ انہیں یہ معلوم نہ ہو کہ وہ ان لوگوں میں سے ہیں جن سے یہ خطاب کیا گیا ہے۔ اور یہ صحیح حدیث میں ہے۔ پس اس نے صرف وہی کیا جو اللہ کے نزدیک مباح ہے، اور اسے اس کا علم نہیں ہے۔ پس وہ اللہ کے نزدیک اس مرتبے پر ہے۔ اسی لیے ہم نے کہا کہ اپنی ذات کے بارے میں سوء ظن رکھنا، کیونکہ وہ اس میں حقیقت میں بصیرت پر نہیں تھا، جبکہ ذات حق (الحق) کی طرف سے یہ احتمال موجود ہے۔ اور اللہ نے جس کی یہ صفت ہے، اس کے لیے ایک علامت مقرر کی ہے جس سے وہ خود کو پہچانتا ہے کہ وہ ان لوگوں میں سے ہے۔ اور صحیح شرعی علم کے ساتھ اس میں کوئی شک نہیں کہ انسان کی اپنی جان کی حرمت اللہ کے نزدیک دوسروں کی حرمت سے بہت زیادہ ہے، جس کا کوئی مقابلہ نہیں۔ اور جس نے خود کو قتل کیا، وہ اس سے زیادہ بڑا مجرم ہے جس نے کسی دوسرے کو قتل کیا، اور اس کا اپنی ذات پر صدقہ کرنا، دوسروں پر صدقہ کرنے سے زیادہ اجر رکھتا ہے۔ پس نیک عالم وہ ہے جو اپنے دین کے لیے ہر حال میں، اپنی ذات کے حق میں اور دوسروں کے حق میں، احتیاط کرے۔ اور اب تک میں نے اہل دین اور اہل علم میں سے کسی کو اس قدم پر نہیں دیکھا۔ پس تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں اس کے استعمال کی توفیق دی اور ہمیں اس کے نظر انداز کرنے سے روکا۔ اور اگر اس ذکر میں اللہ کے بندوں کے لیے فائدہ اور ان کے لیے نصیحت نہ ہوتی، تو ہم اس بات کو اتنی تفصیل سے بیان نہ کرتے، اگرچہ یہ فصل اس کا تقاضا کرتی ہے، کیونکہ یہ وعظ کی فصل ہے۔ اور اللہ اپنے نبی صلی اللہ علیہ وسلم سے فرماتا ہے جو اس نے آپ پر نازل کیا: \"اپنے رب کے راستے کی طرف حکمت اور اچھی نصیحت کے ساتھ بلاؤ (ادْعُ إِلى‏ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ والْمَوْعِظَةِ الْحَسَنَةِ)\"۔ جیسے یہ (نصیحت) جو ہم نے ذکر کی، کیونکہ یہ اللہ کے بندوں کے لیے ایک وصیت ہے جس میں حکمت اور حکم دونوں جمع ہیں، کیونکہ ہم نے اسے اس کے مقام پر اتارا ہے۔ اور حکیم وہ ہے جو معاملے کو اس کے مقام پر اتارے اور اس کے مرتبے سے تجاوز نہ کرے۔ اور اچھی نصیحت (الموعظة الحسنة) وہ نصیحت ہے جو یاد دلانے والے کے پاس شہود (الشہود) کے ذریعے ہو۔ کیونکہ احسان یہ ہے کہ تم اللہ کی عبادت ایسے کرو گویا تم اسے دیکھ رہے ہو، تو اس شخص کا کیا حال ہو گا جس نے یہ حقیقت حاصل کر لی کہ وہ اسے دیکھتا ہے؟ پس یہ زیادہ عظیم اور بہتر ہے۔ اور اس کا قول \"دو دو\" (مثنیٰ) سے مراد یہ ہو سکتا ہے کہ اس معاملے میں اللہ کے لیے کھڑے ہونے میں تعاون کیا جائے۔ اور اس میں تعاون کی صورت یہ ہے کہ شرع نے حقیقت میں اس فعل کا انکار کیا ہے جو اس شخص سے صادر ہوا ہے۔ پس مومن عالم کو چاہیے کہ وہ اس میں شارع کے ساتھ کھڑا ہو اور اس کی مدد کرے، تو وہ دو ہو جائیں گے: وہ اور شرع۔ اور \"تنہا تنہا\" (فرادیٰ) یہ ہے کہ یہ انکار کرنے والا یہ نہ جانتا ہو کہ وہ اپنے انکار اور وعظ میں شرع کا مددگار ہے، اور وہ کہے کہ میں اس معاملے میں اکیلا کھڑا ہوا ہوں، حالانکہ وہ صرف شرع اور اس فرشتے کا مددگار ہے جو اپنی لمہ (دل میں آنے والی بات) سے فاعل سے کہتا ہے: \"یہ نہ کرو\"، جبکہ شیطان اپنی لمہ سے اسے کہتا ہے: \"یہ کرو\"۔ پس وہ فرشتے کے ساتھ دو ہو جاتا ہے۔ کیونکہ فرشتہ اس بندے کو منع کرنے کا مکلف ہے جسے اللہ نے اس پر لازم کیا ہے کہ وہ اسے اس چیز سے منع کرے جس سے اللہ نے اسے منع کرنے کا مکلف کیا ہے۔ پس انسان اس میں اس کی مدد کرتا ہے، تو وہ ان لوگوں میں سے ہو جاتا ہے جو اللہ کے لیے \"دو دو\" (مثنیٰ) کھڑے ہوئے۔ اور کبھی وہ شارع یعنی رسول علیہ السلام کا مددگار ہوتا ہے، پس وہی ہیں جنہوں نے پہلے اس فعل کا انکار کرنے والے پر کیا اور اس وعظ میں سبقت کی۔ پس یہ واعظ انسان، رسول کے سابقہ وعظ کے ساتھ \"دو دو\" (مثنیٰ) ہو جاتا ہے، جیسا کہ بعض لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے درخواست کی کہ وہ انہیں جنت میں اپنا رفیق بنا لیں۔ تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: \"کثرت سے سجدے کر کے اپنی ذات پر میری مدد کرو۔\" پس آپ نے ان سے مدد طلب کی، تو وہ اور رسول اللہ صلی اللہ علیہ وسلم اس میں \"دو دو\" (مثنیٰ) کھڑے ہوئے۔ اللہ تعالیٰ فرماتا ہے: \"اور نیکی اور تقویٰ پر ایک دوسرے کی مدد کرو (وتَعاوَنُوا عَلَى الْبِرِّ والتَّقْوى‏)\"۔ اور فرمایا: \"اللہ سے مدد مانگو (اسْتَعِينُوا بِاللَّهِ)\"۔ پس اس نے اپنے آپ کو اپنے بندے کے ساتھ فعل میں شریک کر لیا۔ اور جو کچھ اللہ دلائل کے بغیر نہیں کرتا، وہ اسی باب میں سے ہے۔ اور اسے صرف وہی جانتا ہے جو اللہ کے اسرار اور حقائق (الحقائق) سے واقف ہے۔ پس اس نفس سے غافل نہ ہو، اور جس کا میں نے ذکر کیا ہے اس کا مددگار بن جاؤ، تمہارا انجام اچھا ہو گا اور تمہیں مدد کرنے والے کے ساتھ مدد میں حصہ ملے گا۔ بندہ کہتا ہے: \"اور ہم تجھ ہی سے مدد مانگتے ہیں (وإِيَّاكَ نَسْتَعِينُ)\"، تو ذات حق (الحق) فرماتا ہے: \"یہ میرے اور میرے بندے کے درمیان ہے، اور میرے بندے کے لیے وہ ہے جو اس نے مانگا۔\" پس اللہ تعالیٰ کا یہ قول واضح ہو گیا کہ \"یہ میرے اور میرے بندے کے درمیان ہے\"، پس یہ اللہ کے لیے ہے اور مدد کے حکم میں اس کے لیے ہے۔ جب اللہ نماز کا وجود چاہتا ہے، تو اس محل کی تیاری ضروری ہے جس کے ذریعے نماز کا ظہور ہوتا ہے۔ پس سمجھو۔\n\n### «فصل» اللہ تعالیٰ کے قول: \"اور انہیں اللہ کے دنوں کی یاد دلاؤ\" میں\n\nاور جہاں تک اللہ کے دنوں کی یاد دہانی (تذکر) کا تعلق ہے، تو وہ حقیقت میں سانسوں کے دن ہیں، کیونکہ یہ کم سے کم چیز ہے جس پر دن کا نام بولا جا سکتا ہے۔ پس یہ ہے کہ تم اسے اللہ کے اس قول سے یاد دلاؤ: \"ہر دن وہ ایک شان میں ہے (كُلَّ يَوْمٍ هُوَ في شَأْنٍ)\"۔ پس وہ اللہ کے دن ہیں اور تم ان سے غافل ہو۔ اور یہ اللہ تعالیٰ کے اس قول کے مضمون میں داخل ہوتا ہے: \"بے شک اس میں (إِنَّ في ذلِكَ)\"، جو اس کے قول \"ہر دن وہ ایک شان میں ہے (كُلَّ يَوْمٍ هُوَ في شَأْنٍ)\" اور دیگر باتوں کی طرف اشارہ ہے، \"اس کے لیے عبرت ہے جس کے پاس دل ہو (لَعِبْرَةً لِمَنْ كانَ لَهُ قَلْبٌ)\"۔ یعنی وہ شخص جو احوال کے بدلنے میں یا احوال کے اس پر بدلنے میں فطانت رکھتا ہو، پس وہ اس سے ذات حق (الحق) کے شؤون اور ان دنوں کی حقیقتوں کو جانتا ہے جن میں الحق ایک شان میں ہے۔ پس شان تو ایک ہی ہے، لیکن قبول کرنے والے مختلف اور کثیر ہیں، جن میں یہ شان ان کے تنوع اور اختلاف کے ساتھ متنوع ہوتی ہے۔ پس وہ اللہ کی طرف سے ایک ہے، اور عالم کی صورتوں میں کثیر ہے، جیسے ایک ہی صورت کا بہت سے آئینوں میں ہونا، اور ایک ہی شخص کے بہت سے سائے مختلف چراغوں کی وجہ سے۔ معاملہ اسی طرح ہے۔ \"یا وہ کان لگائے (أَوْ أَلْقَى السَّمْعَ)\" اس چیز کی طرف جو اس پر تلاوت کی جاتی ہے، جیسے اس کا قول: \"ہر دن وہ ایک شان میں ہے (كُلَّ يَوْمٍ هُوَ في شَأْنٍ)\" اور اس کی مثالیں، \"اور وہ خود گواہ ہے (وَهُوَ شَهِيدٌ)\" اپنے احوال کے بدلنے پر، پس وہ اللہ کی طرف سے اس میں بصیرت پر ہوتا ہے۔ پس یہ اللہ کے وہ دن ہیں جن کے ذریعے بندے کو یاد دلانا چاہیے، اور اسی طرح اللہ کے دیگر دنوں کی طرف، جو نعمتوں کے دن اور انتقام کے دن ہیں جن میں اللہ نے گزشتہ قوموں کو پکڑا۔\n\nاور جان لو کہ دنیا میں نعمتوں سے زیادہ بلائیں ہیں۔ کیونکہ اللہ اپنے بندوں پر جو بھی نعمت نازل کرتا ہے، وہ بلاء سے پاک نہیں ہوتی۔ کیونکہ اللہ اس پر شکر کا حق ادا کرنے، اور اسے اس ذات کی طرف منسوب کرنے کا مطالبہ کرتا ہے جو اسے ایجاد کرنے کا مستحق ہے، اور یہ کہ اسے اس جگہ خرچ کیا جائے جہاں ذات حق (الحق) نے اسے خرچ کرنے کا حکم دیا ہے۔ پس جس کا شہود (الشہود) نعمتوں میں یہ ہو، وہ کب ان سے لذت حاصل کرنے کے لیے فارغ ہو گا؟ اسی طرح مصیبتوں میں، وہ بذات خود مصائب اور بلائیں ہیں، اور ان میں بھی وہی تکلیف شامل ہوتی ہے جو نعمتوں میں ہوتی ہے، یعنی ان پر صبر کا مطالبہ، اور انہیں دور کرنے کے لیے ذات حق (الحق) کی طرف رجوع کرنا، اور انہیں رضا یا صبر کے ساتھ قبول کرنا، جو کہ اللہ کی شکایت کو اللہ کے علاوہ کسی اور سے کرنے سے نفس کو روکنا ہے۔ اور یہ اللہ کے بارے میں انتہائی جہالت ہے، کیونکہ تم طاقتور کی شکایت کمزور سے کرتے ہو، اس راحت کی وجہ سے جو تمہیں شکایت کی حالت میں ملتی ہے، حالانکہ تم ایک ایسے شخص سے شکایت کر رہے ہو جس سے شکایت نہیں کرنی چاہیے، کیونکہ تم جانتے ہو کہ اس کے ہاتھ میں کچھ نہیں ہے اور نہ ہی وہ اس چیز کو دور کر سکتا ہے جو تم پر نازل ہوئی ہے، سوائے اس کے جس نے اسے نازل کیا ہے۔ اور تم جانتے ہو کہ یہ دنیا بلاؤں کا گھر ہے، جس میں نعمت ایک لمحے کے لیے بھی بلاء سے پاک نہیں ہوتی۔ اور کم از کم یہ ہے کہ نعمت دینے والا اس پر شکر کا مطالبہ کرتا ہے۔ اور نفس پر اس سے زیادہ مشکل کون سی تکلیف ہے؟ اسی لیے اللہ تعالیٰ نے فرمایا: \"اور میرے بندوں میں سے شکر گزار بہت کم ہیں (وقَلِيلٌ من عِبادِيَ الشَّكُورُ)\"، ان کی جہالت کی وجہ سے کہ نعمتیں ایسی ہیں جن پر شکر واجب ہے۔ ہمارے اس قول کی تائید اللہ تعالیٰ کا یہ قول کرتا ہے: \"بے شک اس میں ہر بڑے صابر اور شکر گزار کے لیے نشانیاں ہیں (إِنَّ في ذلِكَ لَآياتٍ لِكُلِّ صَبَّارٍ شَكُورٍ)\"، یہ سمندر کے مسافر کے حق میں ہے جب اس پر تیز ہوا چلتی ہے اور وہ ٹھنڈا ہو جاتا ہے۔ اس میں جو نعمت ہے اس پر شکر کا مطالبہ کیا جاتا ہے، اور اس میں جو سختی اور خوف ہے اس پر صبر کا مطالبہ کیا جاتا ہے۔ پس سمجھو اور اللہ کے کلام پر غور کرو، تم فائدہ اٹھاؤ گے۔ اور اللہ نے اسے صرف عقل مند کے لیے یاد دہانی کے طور پر نازل کیا، جیسا کہ فرمایا: \"تاکہ وہ اس کی آیات پر غور کریں اور عقل والے نصیحت حاصل کریں (لِيَدَّبَّرُوا آياتِهِ ولِيَتَذَكَّرَ أُولُوا الْأَلْبابِ)\"۔ اور تم ان لوگوں میں سے نہ ہو جن کا اس میں صرف پہنچانے کے سوا کوئی حصہ نہیں۔\n\n### «فصل» بانجھ دن میں\n\nاور بانجھ (العقيم) وہ ہے جس سے کوئی پیدائش نہ ہو، پس اس کی اپنے جیسی کوئی اولاد نہ ہو۔ اور اسے بانجھ اس لیے کہا گیا کہ اس کے بعد کوئی دن نہیں ہوتا۔ اور یہ ہفتے کے دنوں میں سے ہفتے کا دن ہے، اور یہ ابد کا دن ہے۔ پس اس کا دن اہل جنت کے لیے دائمی نور ہے جو ہمیشہ رہے گا، اور اس کی رات اہل جہنم پر دائمی تاریکی ہے جو ہمیشہ رہے گی۔ اور اسی لیے اس میں کبیرہ گناہوں والے مر جائیں گے جو سزا کے بعد اس سے نکل کر جنت میں جائیں گے، کیونکہ جہنم میں ہمیشہ رہنا صرف اس کے اہل کے لیے ہے جو اس کے مستحق ہیں۔ رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: \"جہاں تک اہل جہنم کا تعلق ہے جو اس کے مستحق ہیں، تو وہ اس میں نہ مریں گے اور نہ زندہ رہیں گے، لیکن کچھ لوگ ایسے ہیں جنہیں ان کے گناہوں کی وجہ سے آگ لگی، تو اللہ انہیں اس میں موت دے دے گا۔\" (یہ حدیث صحیح ہے)۔ پس وہ اس میں ایک نیند سو جائیں گے، یہاں تک کہ جب آگ انہیں چھوئے گی تو وہ اسے محسوس نہیں کریں گے، جب وہ گناہوں کے آلات یعنی اعضاء کو کھانے کے لیے مسلط ہو گی۔ اور ایمان اس کے دل تک پہنچنے سے روکتا ہے۔ پس یہ اس توحید کی عنایت ہے جو ان کے دلوں میں تھی۔ پس علم توحید انہیں جہنم میں سونے والے کی موت کی طرح مار دیتا ہے۔ اور ایمان جہنم کے دروازے پر ان کا انتظار کرتا ہے، یہاں تک کہ جب اللہ انہیں اس نیند سے اٹھائے گا اور وہ کوئلہ بن چکے ہوں گے، تو اللہ سبحانہ و تعالیٰ انہیں نکالے گا اور انہیں نہر حیات میں غوطہ دے گا، تو وہ اس طرح اگیں گے جیسے دانہ سیلاب کے بہاؤ میں اگتا ہے۔ پھر وہ جنت میں داخل ہوں گے۔ پس جہنم میں کوئی ایسا شخص باقی نہیں رہے گا جس نے دنیا میں ایک بار بھی یہ جان لیا ہو کہ اللہ ایک معبود ہے۔\n\nاور اہل جنت کے لیے جنت میں کچھ مقداریں ہیں جن سے وہ دنیا میں سورج کے طلوع ہونے سے غروب ہونے تک کی مدت کو پہچانتے ہیں، اگرچہ جنت میں سورج نہیں ہے۔ پس وہ حرکت جو سورج کو چلاتی تھی اور جس کی وجہ سے اس کا طلوع و غروب ظاہر ہوتا تھا، وہ فلک اطلس میں موجود ہے جو جنت پر ہے اور وہ اس کی چھت ہے۔ اور وہی حرکت اس میں موجود ہے۔ اور اہل جنت کے لیے ان مقداروں کا کشف (الکشف) اور رؤیت ہے جنہیں برجوں سے تعبیر کیا جاتا ہے، کیونکہ وہ فلک وہی آسمان ہے جس کی اللہ نے اپنے اس قول میں قسم کھائی: \"برجوں والے آسمان کی قسم (وَالسَّماءِ ذاتِ الْبُرُوجِ)\"۔ پس وہ اس سے اس حد کو جان لیتے ہیں جو دنیا میں ان پر صبح و شام کہلاتا تھا۔ اور دنیا میں اس وقت ان کے لیے ایک حالت تھی جسے غداء (صبح کا کھانا) اور عشاء (شام کا کھانا) کہا جاتا تھا، پس وہ وہاں اسے یاد کریں گے، تو اللہ انہیں اس وقت رزق دے گا، جیسا کہ فرمایا: \"ان کے لیے اس میں صبح و شام ان کا رزق ہو گا (لَهُمْ رِزْقُهُمْ فِيها بُكْرَةً وعَشِيًّا)\"۔ اور یہ ایک خاص رزق ہے جو ایک خاص وقت میں ان کے نزدیک معلوم ہے۔ اور اس کے علاوہ ان کا کھانا دائمی ہے جو کبھی منقطع نہیں ہوتا۔ اور کھانے میں دوام ہی عین نعمت ہے، اس غذا کی وجہ سے جو جسم کو ملتی ہے، لیکن بہت سے لوگ اسے محسوس نہیں کرتے سوائے علمِ طبیعت کے علماء کے۔ اور وہ، یعنی اللہ کے قول \"اس کا کھانا دائمی ہے (أُكُلُها دائِمٌ)\" کی صورت یہ ہے کہ جب انسان کھانا کھاتا ہے یہاں تک کہ سیر ہو جاتا ہے، تو وہ حقیقت میں غذا نہیں ہوتی اور نہ ہی کھانا ہوتا ہے، بلکہ وہ جمع کرنے والے کی طرح ہے جو مال کو اپنے خزانے میں جمع کرتا ہے، اور معدہ اس کھانے والے کے جمع کیے ہوئے کھانوں اور مشروبات کا خزانہ ہے۔ پس جب وہ اسے اس میں، یعنی اپنے معدے کے خزانے میں ڈال دیتا ہے اور ہاتھ اٹھا لیتا ہے، تو اس وقت طبیعت اس کی تدبیر سنبھال لیتی ہے، اور وہ کھانا ایک حال سے دوسرے حال میں منتقل ہوتا ہے اور ہر سانس کے ساتھ اسے ہمیشہ غذا دیتا رہتا ہے۔ پس وہ ہمیشہ دائمی غذا میں رہتا ہے۔ اور اگر ایسا نہ ہوتا تو ہر غذا حاصل کرنے والے کی نشوونما کے انتظام میں حکمت باطل ہو جاتی، اور اللہ حکیم ہے۔ پس جب خزانہ خالی ہو جاتا ہے تو طبیعت جمع کرنے والے کو حرکت دیتی ہے کہ وہ اسے بھرنے کے لیے حاصل کرے۔ پس یہ معاملہ ہمیشہ اسی طرح جاری رہتا ہے۔ پس غذا حاصل کرنے والے میں غذا کی صورت یہی ہے۔ پس غذا حاصل کرنا ہر سانس میں ہے، دنیا میں بھی اور آخرت میں بھی۔ اور اسی طرح اہل جہنم بھی ہیں، اور اللہ نے انہیں اسی حد تک کھانے پینے سے موصوف کیا ہے، مگر یہ کہ وہ بلاء کا گھر ہے، پس وہ بھوک کی وجہ سے کھائیں گے اور پیاس کی وجہ سے پیئیں گے۔ اور اہل جنت لذت کے لیے خواہش سے کھائیں گے اور پیئیں گے، نہ کہ بھوک کی وجہ سے۔ کیونکہ وہ غذا کہلانے والی چیز کو صرف اس علم کی وجہ سے لیتے ہیں کہ جس زمانے میں ذخیرہ اندوزی ہوئی تھی، وہ ذخیرہ ختم ہو چکا ہے، پس وہ طبیعت کی طرف تیزی سے رجوع کرتے ہیں جو اس کی تدبیر کرتی ہے۔ پس وہ ہمیشہ لذت اور نعمت میں رہتے ہیں، اور انہیں اس کشف (الکشف) کی وجہ سے طبیعت کو طلب اور حاجت کی طرف مائل کرنے کی ضرورت نہیں ہوتی جو ان پر ہے۔ جیسا کہ اہل جہنم حجاب میں ہیں، پس وہ اس مقدار کو نہیں جانتے، لہٰذا وہ بھوکے اور پیاسے ہوتے ہیں، کیونکہ ان کا مقصد یہ ہے کہ وہ تکلیف اٹھائیں۔ پس تمہارے لیے یہ واضح ہو گیا کہ لذت صرف علم میں ہے اور تکلیف صرف جہالت میں ہے۔\n\nاور سورج کو لپیٹ دیا گیا ہو گا، اس کا نور ان کی آنکھوں میں چھین لیا گیا ہو گا، وہ اہل جہنم پر طلوع ہو رہا ہو گا اور غروب ہو رہا ہو گا، جیسا کہ دنیا والوں پر اس کے گہن کی حالت میں طلوع ہوتا ہے۔ اور اسی طرح چاند بھی، اور تمام ستارے اپنے افلاک میں اسی طرح تیر رہے ہوں گے جیسے اب تیر رہے ہیں، لیکن ان کی آنکھوں میں وہ بے نور ہوں گے۔ پس حقیقت میں معاملہ یہ ہے کہ وہ خود ہی ہیں جن کی آنکھوں کو اللہ نے بے نور کر دیا، جب اس نے چاہا کہ وہ روشن چیزوں میں موجود انوار کا ادراک نہ کر سکیں۔ پس ان کی آنکھوں پر حجاب ہے، جیسا کہ ہم جانتے ہیں کہ جب سورج یہاں گہن کی حالت میں ہوتا ہے تو اس کا نور اس سے زائل نہیں ہوتا، بلکہ چاند اسے ہم سے چھپا لیتا ہے۔ اور اگر ایسا نہ ہوتا تو اہل تعلیم یہ نہ جان پاتے کہ گہن کب ہو گا اور ہماری آنکھوں سے گہن میں کتنا حصہ غائب ہو گا، اور یہ اسی طرح واقع ہوتا ہے جیسا کہ انہوں نے ذکر کیا ہے۔ پس اگر یہ ان امور میں سے ہوتا جو مقررہ مقداروں اور محکم میزانوں پر جاری نہیں ہوتے جن کا علم اللہ نے اسے دیا جسے اس نے اس علم کے طلب کرنے کی توفیق دی، تو وہ اسے نہ جان پاتا۔ اور یہ ہمارے اس قول میں کوئی نقص پیدا نہیں کرتا کہ سورج کو گہن لگ گیا ہے یا اس کا نور ہماری آنکھوں کے ادراک سے زائل ہو گیا ہے، کیونکہ اس مقدار اور اس صورت کو ہم پر کوئی نہیں روکتا کہ ہم اس پر کسوف (گہن)، خسوف، تکویر (لپیٹنا) اور طمس (بے نور کرنا) کا نام بولنے پر اتفاق کر لیں۔ پس اہل جہنم سیاروں کو اپنے اوپر طلوع ہوتے اور غروب ہوتے دیکھیں گے، لیکن وہ ان کے لیے کوئی نور نہیں دیکھیں گے، اس دھویں کی وجہ سے جو وہاں ہو گا۔ پس جس طرح وہ دنیا میں ان انوار کے ادراک سے اندھے تھے جو شرائع حق کے ساتھ لائی تھیں، اسی طرح وہ جہنم میں بھی ان سیاروں اور دیگر ستاروں کے انوار کے ادراک سے اندھے ہوں گے۔ \"اور جو اس دنیا میں اندھا ہے، وہ آخرت میں بھی اندھا ہو گا اور راستے سے زیادہ بھٹکا ہوا ہو گا (ومن كانَ في هذِهِ أَعْمى‏ فَهُوَ في الْآخِرَةِ أَعْمى‏ وأَضَلُّ سَبِيلًا)\"۔ اور وہ راستے سے زیادہ بھٹکا ہوا اس لیے ہو گا کہ وہ دنیا میں تو کسی کو پاتا ہے جو اسے راستہ دکھائے، لیکن وہ سنتا نہیں، اور جہنم میں اسے کوئی نہیں ملتا جو اسے راستہ دکھائے، کیونکہ وہاں کوئی راستہ نہیں ہے۔ لیکن وہ کسی کو پاتا ہے جو اسے اس چیز پر نادم کرے جو اس سے چھوٹ گئی، تاکہ اس کی حسرت میں اور اس کے عذاب میں اضافہ ہو۔ پس اہل جہنم کی رات کی کوئی صبح نہیں ہو گی، اور اہل جنت کے دن کی کوئی شام نہیں ہو گی، یعنی اس میں کوئی رات نہیں ہو گی۔\n\nپس جس نے لوگوں کو ان کے عقیدے میں وعظ کیا، اس سے یہ طلب کرتے ہوئے کہ وہ لوگوں کو ان کے عقیدے میں فائدہ پہنچائے، تو اس نے اللہ کو نہیں پہچانا۔ بخلاف تذکر کرنے والے کے، کیونکہ وہ اپنے پاس موجود چیز کے ذریعے یاد دلاتا اور وعظ کرتا ہے، اور وہ جانتا ہے کہ سننے والوں میں سے کچھ ایسے ہوں گے جن کے لیے وہ وعظ شفا اور دوا ہو گا، اور کچھ ایسے ہوں گے جن کے مرض میں اضافہ ہو گا، جیسا کہ اللہ تعالیٰ نے فرمایا: \"اور جب کوئی سورت نازل کی جاتی ہے (اور وہ ایک ہی ہے)، تو جو لوگ ایمان لائے، تو اس نے ان کے ایمان میں اضافہ کیا، اور وہ خوش ہوتے ہیں (فَزادَتْهُمْ إِيماناً وهُمْ يَسْتَبْشِرُونَ)\"، ان پر عافیت کے آنے کی وجہ سے، \"اور جن کے دلوں میں بیماری ہے، تو اس نے ان کی گندگی میں مزید گندگی کا اضافہ کیا (فَزادَتْهُمْ رِجْساً إِلَى رِجْسِهِمْ)\"۔ اور سورت ایک ہے، لیکن مزاج مختلف ہے۔ پس اس آیت کی حقیقت کو صرف وہی ڈاکٹر جانتے ہیں جو جانتے ہیں کہ فلاں دوا کسی خاص مرض کے خاص مزاج کے لیے شفا ہے، اور وہی دوا کسی خاص مزاج کے لیے بیماری اور علت ہے، اور کسی خاص مرض میں مرض کا اضافہ ہے۔ پس ڈاکٹر اس آیت کے علم کا سب سے زیادہ حقدار ہے، اور اسی طرح دلوں کا ڈاکٹر بھی، اس چیز میں جو انہیں امن دیتی ہے اور خوف دلاتی ہے۔ پس حکیم وہ ہے جو مریض کے پاس اس چیز سے آتا ہے جو اس میں ہے، اور اسے اس شخص کی صورت میں ظاہر کرتا ہے جس پر وہ اعتقاد رکھتا ہے، تاکہ اسے حق کے ذریعے حق کی صورت کی طرف کھینچ لائے جو اس کے لائق ہے۔ لیکن عالم میں امر الٰہی اس کے خلاف واقع ہوا، کیونکہ اللہ کی مشیت کا تعلق اس بات سے تھا کہ اللہ انہیں ہدایت پر جمع نہیں کرے گا۔ اور اس میں راستہ اللہ کے نزدیک اور اس کے اہل کے نزدیک معلوم ہے، وہ اس میں شک نہیں کرتے۔ کیونکہ جو شخص کسی مخلوق میں، خواہ وہ پتھر ہو، پودا ہو، حیوان ہو یا ستارہ ہو، یہ اعتقاد رکھتا ہے کہ وہ اس کا معبود ہے اور وہ اس کی عبادت کرتا ہے، اور وہ معبود جس کا اسے کشف (الکشف) کے ذریعے شہود (الشہود) ہوتا ہے، اس سے اس بات کے ساتھ مخاطب ہوتا ہے جو الحق پر ہے، تو وہ اپنے اعتقاد کی وجہ سے اس کے قول کی طرف رجوع کرتا ہے، جیسا کہ وہ آخرت میں اس کے قول کی طرف رجوع کرے گا اور اس سے بیزاری ظاہر کرے گا، جیسا کہ اس کے معبود نے اس سے بیزاری ظاہر کی۔ اور اللہ قادر ہے کہ وہ دنیا میں بھی اس کے حق میں اسے اس بات کے ساتھ گویا کر دے جو اس کی عبادت کرتا ہے، لیکن علم سابق اور مشیت الٰہیہ نے اس سے منع کیا تاکہ عالم میں اختلاف باقی رہے۔ پس دنیا میں اور آخرت کے بعض حصے میں معاملہ اسی طرح جاری رہا، اور معاملہ اس رحمت کے میثاق کے حکم کی طرف لوٹتا ہے جو \"ہر چیز پر محیط ہے (وَسِعَتْ كُلَّ شَيْ‏ءٍ)\"۔ اور اللہ \"حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)\"۔",
    "fa": "باب سیصد و نود و هشتم: در معرفت مقام کسی که مردم را موعظه کرد و مرا نشناخت، و کسی که آنان را متذکر ساخت و مرا شناخت؛ پس هر کدام از این دو مرد که می‌خواهی باش.\n\nخلق، سایه‌ای برای ذات حق است که *** نه علمی و نه بصری هستی او را محقق نمی‌سازد.\n\nاگر برخیزد، به واسطه او برخاسته، یا اگر برود، به واسطه او رفته است؛ *** پس عین او، او نیست و هستی او بشر است.\n\nپس شگفتا از هستی‌ای (الوجود) که هستی ندارد، *** و اگر زائل شود، نفع و ضرر نیز زائل می‌گردد.\n\nاین که گفتم، عقل آن را نمی‌داند، *** و جز خورشید و ماه آن را درک نمی‌کنند.\n\nپس خورشید مؤنث است و ماه کامل (بدر) اگر *** چشم تفکر در آن بنگرد، حاکمی مذکر است.\n\nپس میان آن دو جز به واسطه ما نبود، و آن دو *** جز خودشان نیستند؛ پس اگر اهل اعتبار هستی، عبرت بگیر.\n\nشگفت دارم از یگانه‌ای که در ذاتش کثرت است، *** ظهور از آن اوست و کائنات و غیر در اوست.\n\n### تذکر و موعظه برای چه کسی است؟\n\nبدان، خداوند ما و تو را به روحی از جانب خود تأیید کند، که خداوند سبحان می‌فرماید: «وَذَكِّرْهُمْ بِأَيَّامِ اللهِ» (و روزهای خدا را به آنان یادآوری کن). و در مورد آنچه به پیامبرش (صلی الله علیه و سلم) در کتاب عزیزش امر فرموده، می‌گوید: «قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ» (بگو: من فقط شما را به یک چیز موعظه می‌کنم). و عز و جل می‌فرماید: «أَوْ يَأْتِيَهُمْ عَذابُ يَوْمٍ عَقِيمٍ» (یا عذاب روزی عقیم به سراغشان آید).\n\nپس محور این مقام بر این سه آیه است. تذکر برای عالمان غافل است و موعظه برای همه مردم نیست. به همین دلیل فرمود: «کسی که مردم را موعظه کرد، مرا نشناخت»، زیرا او تنها آنان را به آنچه از جانب من است موعظه می‌کند، نه به واسطه من. همچنین کسی که آنان را می‌ترساند، تنها به آنچه از جانب من است می‌ترساند، نه از من.\n\nپس ترغیب (تشویق) در جایگاه ترهیب (ترساندن) قرار نمی‌گیرد. زیرا ترغیب می‌تواند «در» من باشد، اما ترهیب تنها می‌تواند «از آنچه از جانب من است» باشد، نه «از من». و «یوم عقیم» (روز عقیم) روزی است که زمان مشابهی را تولید نمی‌کند، یعنی روزی پس از آن نیست که از آن زاده شود؛ زیرا روزها در دنیا، هر روز فرزند روز قبل است و شب و روز توأمان هستند. شب مؤنث است و روز مذکر، پس با هم نکاح می‌کنند و روز و شبی را که پس از آن‌ها می‌آیند، می‌زایند و والدین از بین می‌روند، زیرا هرگز با هم جمع نمی‌شوند. و در پوشاندن شب و روز و دخول برخی از آن‌ها در برخی دیگر، ولادت آنچه در هر یک از آن‌ها از امور و حوادثی که از شئون حق هستند، شکل می‌گیرد. پس شب مذکر و روز مؤنث است به دلیل حوادثی که در روز متولد می‌شوند، و روز مذکر و شب مؤنث است به دلیل حوادثی که در شب متولد می‌شوند. و شب مؤنث و روز مذکر است برای ولادت توأمان، که همان روز دوم و شب آن است. و شب اصل است و روز از آن است، مانند حوا از آدم؛ سپس نکاح و تولید واقع می‌شود.\n\n### فصل: در مورد آن «یک چیز» که واعظ به آن موعظه می‌کند\n\nو آن این است که به خاطر خدا قیام کنی، هنگامی که در هستی (الوجود) فعل خدا را دیدی که به تو امر کرده است که برای آن قیام کنی، خواه از روی غیرت باشد یا تعظیم. پس سخن او در مورد قیام، «مثنی» (دوگانه) است: به واسطه خدا و به واسطه رسولش؛ زیرا هر کس از رسول اطاعت کند، «فَقَدْ أَطاعَ اللهَ» (قطعاً از خدا اطاعت کرده است). پس برای خدا به کتاب یا سنت قیام کردی، نه از روی هوای نفس، نه از روی غیرت طبیعی، و نه از روی تعظیم کونی. و «فرادی» (تک‌تک) است: یا فقط به واسطه خدا، یا فقط به واسطه رسولش، چنانکه\n\nپیامبر (صلی الله علیه و سلم) فرمود: «نمی‌بینم یکی از شما بر پشتی خود تکیه داده باشد و حدیثی از من به او برسد، پس بگوید: آن را به صورت قرآن بر من بخوان. به خدا سوگند، آن (حدیث) مانند قرآن یا بیشتر است.»\n\nسخن او «بیشتر» در جهت بالا بردن منزلت است؛ زیرا قرآن واسطه‌ای دارد که روح الامین است، اما حدیث مستقیماً از خدا به اوست. معلوم است که نزدیکی در سند، مرتبه‌ای عظیم‌تر از دوری در آن است، حتی اگر تنها یک شخص از مسیر کم شود. این بدان روست که حکم آن در آن کاهش می‌یابد؛ زیرا خبر ناگزیر است صورتی از ابلاغ‌کننده کسب کند و بر آنچه در اصل از آن نقل می‌شود، باقی نمی‌ماند. و در صدقِ سخنِ خبردهنده که «این کلام فلانی است»، مانند کسی نیست که آن را از او نقل می‌کند یا از او می‌شنود. این به دلیل تغییر زبان و لغت در آن است؛ زیرا مترجم عین آنچه را که کسی که از او نقل می‌کند، گفته است، منتقل نمی‌کند، بلکه در نقل خود آنچه را که از او فهمیده است، بیان می‌کند. و اگر تو خود کسی باشی که از او نقل می‌کنی، در طبقه او هستی و چه بسا امری را از او بفهمی که مترجم برای تو آن را نفهمیده باشد. به همین دلیل، حدیث «بیشتر» از قرآن بود. نهایت آن است که اگر از این طبقه پایین‌تر آید، مانند آن باشد. و رسول خدا (صلی الله علیه و سلم) به «اکثریت» روی نیاورد، مگر آنکه امر بدون شک بیشتر باشد. و اینکه گفتیم قرآن واسطه دارد، به دلیل فرموده خداوند متعال است: «نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ» (روح الامین آن را بر قلب تو نازل کرد) و فرموده: «قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ من رَبِّكَ» (بگو: روح القدس آن را از پروردگارت نازل کرده است) و فرموده: «وَلا تَعْجَلْ بِالْقُرْآنِ من قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ» (و در [تلاوت] قرآن پیش از آنکه وحی آن به تو پایان یابد، شتاب مکن) و «قُلْ رَبِّ زِدْنِي عِلْماً» (بگو: پروردگارا، علم مرا زیاد کن) که این علم از جانب خدا به اوست با رفع واسطه، و آن همان حدیث است که قرآن نامیده نمی‌شود.\n\nپس شایسته نیست که واعظ در موعظه خود از کتاب یا سنت خارج شود و وارد این مصیبت‌ها گردد و از یهود و نصاری و مفسرانی نقل کند که در کتب تفاسیر خود مطالبی را نقل می‌کنند که شایسته مقام خداوند و منزلت رسولان خدا (علیهم السلام) نیست. چنانکه از منصور بن عمار روایت کرده‌ایم که شخصی او را پس از مرگش دید و او از واعظان بود. به او گفت: ای منصور، چه دیدی؟ گفت: حق مرا در برابر خود نگه داشت و فرمود: ای منصور، به چه چیز به من تقرب جستی؟ گفتم: مردم را موعظه می‌کردم و آنان را متذکر می‌ساختم. فرمود: ای منصور، با شعر زینب و سعاد، تقرب به من می‌جویی و بندگانم را موعظه می‌کنی؟ و اشعاری را که من بر منبر می‌خواندم و اهل محبت در مورد معشوقه‌هایشان سروده بودند، برایم ذکر کرد. پس بر من سخت گرفت. سپس فرمود: یکی از اولیای من در مجلس تو حاضر شد. من در آن مجلس گفتم: «اللهم اغفر لأقسانا قلبا وأجمدنا عينا» (خدایا، سخت‌دل‌ترین ما و خشک‌چشم‌ترین ما را بیامرز). آن ولی که نزد تو حاضر بود، گفت: «اللهم اغفر لمن هذه صفته» (خدایا، کسی را که این صفت اوست، بیامرز). من نگریستم و خشک‌چشم‌تر و سخت‌دل‌تر از تو ندیدم. پس دعای ولی‌ام را در مورد تو مستجاب کردم و تو را بخشیدم.\n\nپس شایسته نیست که واعظ در مجلس خود شعری بخواند، مگر شعری که گوینده آن قصد ذکر خدا را با زبان تغزل یا غیر آن داشته باشد؛ زیرا آن از کلامی است که اهل الله می‌گویند و از نظر گفتن و شنیدن حلال است، زیرا نام خدا بر آن برده شده است. و شایسته نیست که در حق خدا شعری خوانده شود که گوینده آن در ابتدا قصد غیر خدا را داشته است، خواه تغزل باشد یا مدح؛ زیرا این به منزله کسی است که با نجاست برای تقرب به خدا وضو می‌گیرد. زیرا سخن در مورد مُحدِث (کسی که حدث کرده) بدون شک حدث است. و خداوند در کتاب خود بر این منزلت با فرموده‌اش هشدار داده است: «وَما لَكُمْ أَلَّا تَأْكُلُوا مِمَّا ذُكِرَ اسْمُ الله عَلَيْهِ» (و شما را چه شده که از آنچه نام خدا بر آن برده شده نمی‌خورید؟) و فرموده: «وَلا تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ الله عَلَيْهِ وَإِنَّهُ لَفِسْقٌ» (و از آنچه نام خدا بر آن برده نشده، نخورید، که آن فسق است). و فرمود: «حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ والدَّمُ ولَحْمُ الْخِنْزِيرِ وما أُهِلَّ لِغَيْرِ الله به» (مردار و خون و گوشت خوک و آنچه برای غیر خدا ذبح شده، بر شما حرام شده است). و شعر در غیر خدا، از جمله چیزهایی است که برای غیر خدا به آن ندا داده شده است؛ زیرا نیت در اشیاء تأثیر دارد. و خداوند می‌فرماید: «وَما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ» (و امر نشدند مگر برای اینکه خدا را بپرستند در حالی که دین را برای او خالص کرده‌اند). و اخلاص همان نیت است. و این شاعر در شعر خود جز تغزل در معشوقش و مدح کسی که شایسته آن نیست، به دلیل آنچه در آن شهادت داده، نیت نکرده است.\n\nشخصی از برادرانم نامه‌ای به من نوشت و در آن مرا بسیار تعظیم کرده بود، به طوری که شصت و سه لقب به من داده بود. در پاسخ برایش نوشتم: «سَتُكْتَبُ شَهادَتُهُمْ ويُسْئَلُونَ» (شهادتشان نوشته خواهد شد و از آنان سؤال می‌شود). و همراه با آن در جواب نامه‌اش ذکر کردم:\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «کسی را بر خدا تزکیه نمی‌کنم، بلکه می‌گوید: او را چنین می‌پندارم و گمان می‌کنم چنین است.»\n\nو خداوند متعال می‌فرماید: «فَلا تُزَكُّوا أَنْفُسَكُمْ هُوَ أَعْلَمُ بِمَنِ اتَّقى‏» (پس خودتان را تزکیه نکنید؛ او به کسی که تقوا پیشه کرده، داناتر است).\n\nاگر این گوینده در ابتدا جانب حق را نیت می‌کرد، در هر صورتی که می‌خواست، شاید آن سخن تقربی به سوی خدا می‌شد؛ زیرا اعمال به نیت‌هاست و «إِنَّما لِكُلِّ امْرِئٍ ما نَوى» (همانا برای هر کس همان است که نیت کرده است). زیرا خداوند بر آنچه در نفس انسان است، آگاه است. و هر آنچه شرعاً تقرب به خدا باشد، از چیزهایی است که نام خدا بر آن برده شده و برای خدا به آن ندا داده شده است، حتی اگر با لفظ تغزل و ذکر مکان‌ها و باغ‌ها و همسایگان باشد، و قصد از همه این‌ها، اعتباری باشد که در معارف الهیه و علوم ربانیه مناسب آن‌هاست، اشکالی ندارد. و اگر منکر آن را انکار کند، ما اصلی داریم که در این باره به آن باز می‌گردیم، و آن این است که خداوند متعال در روز قیامت بر بندگانش در صورتی تجلی (التجلی) می‌کند که آن را انکار می‌کنند، تا جایی که از آن به خدا پناه می‌برند و می‌گویند: «نعوذ بالله منك لست ربنا» (به خدا از تو پناه می‌بریم، تو پروردگار ما نیستی). و او می‌گوید: «أنا ربكم» (من پروردگار شما هستم). و او همان اوست (تعالی). و در تجلی (التجلی) او رازی نهفته است؛ پس در معرفت عقاید و اختلاف آن‌ها به دنبال آن بگرد. همچنین این الفاظ، اگرچه صورت مسمای ظاهری آن‌ها غیر خدا باشد و خلاف آنچه گوینده نیت کرده است، خداوند با او جز بر اساس آنچه نیت کرده، رفتار نمی‌کند. و احوال گوینده بر آن دلالت می‌کند، چنانکه گفته شده است: «به سخن و گوینده آن نگاه می‌شود.» یعنی حال گوینده چیست؟ اگر ولی باشد، آن ولایت است، هرچند خشن باشد؛ و اگر دشمن باشد، آن زشتی است، هرچند نیکو باشد.\n\nچنانکه ما در اشعار خود ذکر می‌کنیم، که همه آن‌ها معارف الهیه در صور مختلفی از تشبیب (تغزل)، مدح، نام زنان و صفات آن‌ها، رودخانه‌ها، مکان‌ها و ستارگان هستند. ما شرحی بر منظومه خود در مکه نوشتیم که آن را «ترجمان الأشواق» نامیدیم و شرح آن را در کتابی به نام «الذخائر والأغلاق» آوردیم. زیرا برخی از فقهای حلب بر ما اعتراض کردند که ما ذکر کردیم مراد از تمام آنچه در این ترجمان سروده‌ایم، معارف الهیه و امثال آن است. او گفت: «او این کار را کرده است چون به دین منسوب است، پس نخواسته است که چنین غزل و نسیبی به او نسبت داده شود.» خداوند به خاطر این سخن به او جزای خیر دهد، زیرا این سخن ما را به نگارش این شرح واداشت و مردم از آن بهره‌مند شدند. پس ما صدق آنچه نیت کرده بودیم و ادعا کرده بودیم را برای او و امثال او آشکار ساختیم. هنگامی که بر شرح آن آگاه شد، از آن توبه کرد و بازگشت.\n\nاگر مردی را ببینیم که به چهره زنی نگاه می‌کند و او خواستگار آن زن است، و ما نمی‌دانیم که او خواستگار است، و در این امر منصف باشیم، تا زمانی که از حال او بی‌خبریم، اقدام به انکار نمی‌کنیم، مگر اینکه از او بپرسیم چه چیزی او را به این کار واداشته است. اگر گفت یا به ما گفته شد که او خواستگار اوست، یا او طبیب است و بیماری‌ای دارد که مستلزم نگاه طبیب به چهره اوست، می‌دانیم که او جز به آنچه برایش جایز است، نگاه نکرده است. بلکه نگاه او عبادت است، اگر امر آن از رسول (صلی الله علیه و سلم) در این باره وارد شده باشد. و با وجود این احتمال، نباید از ابتدا بر او انکار کرد. پس انکار بر او از سوی منکر، اولی‌تر از انکار بر منکر در این باره نیست، با وجود امکان وجود این احتمالات. زیرا منکرات تنها با اموری صحیح می‌شوند که احتمال در آن‌ها راه نداشته باشد. بسیاری از متدینین (کسانی که ادعای دینداری دارند)، نه اصحاب دین (صاحبان دین متین)، در این مورد دچار اشتباه می‌شوند. زیرا اصحاب دین متین، ابتدا بر نفس خود احتیاط می‌کنند، به ویژه در مورد انکار. زیرا تغییردهنده (مُغیّر) شروطی برای تغییر دارد. خداوند ما را به حسن ظن نسبت به مردم ترغیب کرده است، نه به سوء ظن به آنان. پس صاحب دین با گمان، انکار نمی‌کند، در حالی که شنیده است: «إِنَّ بَعْضَ الظَّنِّ إِثْمٌ» (همانا برخی از گمان‌ها گناه است). شاید این از آن «برخی» باشد، و گناه آن این است که به زبان آورده شود، حتی اگر در واقع با علم موافق باشد؛ زیرا خداوند او را به خاطر گمانش مؤاخذه می‌کند، نه علمش. پس در امری محتمل سخن گفته است و این برای او جایز نبوده است. و سوء ظن به نفس انسان، اولی‌تر از سوء ظن به دیگری است، زیرا او نسبت به نفس خود بصیرت دارد، اما نسبت به دیگری بصیرت ندارد. پس در حق نفس خود گفته نمی‌شود که سوء ظن دارد، زیرا او به نفس خود عالم است. و اینکه گفتیم در حق نفس خود سوء ظن دارد، به تبعیت از سوء ظن او به دیگری است، پس این از تناسب کلام است و در حقایق شرعیه وجهی دارد. زیرا با نظر به نفس خود، او در فعلی که بر نفس خود انکار می‌کند، در حقیقت عالم نیست که در آن فعل بر منکری است که آن را می‌داند، بلکه بر گمان است. پس سوء ظن به نفس اولی‌تر است. و این بدان روست که\n\nخداوند بندگانی دارد که به آنان فرموده است: «هر چه می‌خواهید انجام دهید، من شما را آمرزیده‌ام.»\n\nو آنان جز آنچه شرع برایشان مباح کرده، انجام نداده‌اند، حتی اگر ندانند که از کسانی هستند که مورد خطاب قرار گرفته‌اند. و این در حدیث صحیح آمده است. پس او جز آنچه نزد خدا مباح است، انجام نداده، در حالی که خود به آن علم ندارد. پس او نزد خدا در این جایگاه است. به همین دلیل گفتیم سوء ظن به نفس او اولی‌تر است، زیرا با وجود این احتمال از جانب حق، بر حقیقت بصیرت نداشته است. و خداوند برای کسی که این صفت اوست، نشانه‌ای قرار داده است که با آن خود را بشناسد که از آن قوم است. و با علم شرعی صحیح شکی نیست که حرمت نفس انسان بر او نزد خدا، عظیم‌تر از حرمت دیگری است، به طوری که قابل مقایسه نیست. و کسی که خود را بکشد، در جرم عظیم‌تر از کسی است که دیگری را کشته است. و صدقه او بر نفس خود، در اجر عظیم‌تر از صدقه او بر دیگری است. پس عالم صالح کسی است که در همه احوال خود، در حق نفس خود و در حق دیگری، دین خود را حفظ کند. و تا کنون کسی از اهل انتساب به دین و علم را بر این قدم ندیده‌ام. پس حمد خدایی را که ما را به به کار بستن آن موفق کرد و میان ما و اهمال آن حائل شد. و اگر در ذکر این مطلب، منفعتی برای بندگان خدا و نصیحتی برای آنان نبود، سخن را این‌گونه بسط نمی‌دادیم، هرچند که این فصل آن را اقتضا می‌کند، زیرا فصل موعظه است. و خداوند به پیامبرش (صلی الله علیه و سلم) در آنچه بر او نازل کرده، می‌فرماید: «ادْعُ إِلى‏ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ والْمَوْعِظَةِ الْحَسَنَةِ» (به راه پروردگارت با حکمت و موعظه نیکو دعوت کن). مانند همین موعظه‌ای که ذکر کردیم، زیرا این وصیتی است از جانب او به بندگان خدا که حکمت را در خود جمع کرده است، زیرا ما آن را در جایگاه خود قرار دادیم، و همچنین حکم را. و حکیم کسی است که امر را در جایگاه خود قرار دهد و از مرتبه آن تجاوز نکند. و اما موعظه حسنه (نیکو)، موعظه‌ای است که نزد تذکردهنده از روی شهود (الشهود) باشد. زیرا احسان این است که خدا را چنان بپرستی که گویی او را می‌بینی. پس حال کسی که محقق کرده است که او را می‌بیند، چگونه است؟ این عظیم‌تر و نیکوتر است. و ممکن است منظور از فرموده او «مثنی» (دوگانه)، همکاری در قیام برای خدا در آن امر باشد. و صورت همکاری در آن این است که شرع در واقع این فعل را از کسی که از او سر زده، انکار کرده است. پس شایسته است که عالم مؤمن با شارع در آن قیام کند و او را یاری رساند. پس دو نفر می‌شوند: او و شرع. و «فرادی» (تک‌تک) این است که این منکر نداند که در انکار و موعظه خود، یاری‌رسان شرع است. پس می‌گوید: من در این امر تنها هستم. در حالی که او جز یاری‌رسان شرع و فرشته‌ای که با الهام خود به فاعل می‌گوید: «انجام نده»، نیست. زیرا شیطان با الهام خود به او می‌گوید: «انجام بده.» پس او با فرشته، «مثنی» است. زیرا فرشته مکلف است که بنده‌ای را که خداوند او را به او ملزم کرده است، از آنچه خداوند او را مکلف به نهی از آن کرده، نهی کند. پس انسان او را در این کار یاری می‌دهد و از کسانی می‌شود که برای خدا به صورت «مثنی» قیام کرده‌اند. و ممکن است یاری‌رسان شارع باشد، که همان رسول (علیه السلام) است. او کسی است که ابتدا این فعل را بر فاعلش انکار کرده و در موعظه در آن پیشی گرفته است. پس این انسان واعظ با موعظه پیشین رسول، «مثنی» است. چنانکه\n\nشخصی از رسول خدا (صلی الله علیه و سلم) خواست که او را رفیق خود در بهشت قرار دهد. رسول خدا (صلی الله علیه و سلم) به او فرمود: «مرا بر نفس خود با کثرت سجود یاری کن.»\n\nپس از او یاری خواست. پس آن دو، یعنی او و رسول خدا (صلی الله علیه و سلم)، در آن به صورت «مثنی» قیام کردند. خداوند متعال می‌فرماید: «وَتَعاوَنُوا عَلَى الْبِرِّ والتَّقْوى‏» (و بر نیکی و تقوا همکاری کنید). و فرمود: «اسْتَعِينُوا بِاللَّهِ» (از خدا یاری بجویید). پس خود را در فعل با بنده خود شریک کرد. و آنچه خداوند جز با دلایل انجام نمی‌دهد، از این باب است. و این را جز عالم به اسرار خدا و حقایق امور نمی‌داند. پس از این نفس غافل مشو و یاری‌رسان کسی باش که برایت ذکر کردم تا عاقبتت ستوده شود و سهمی در یاری‌رسانی با یاری‌رسان به دست آوری. بنده می‌گوید: «وَإِيَّاكَ نَسْتَعِينُ» (و تنها از تو یاری می‌جوییم). حق می‌فرماید: «هذه بيني وبين عبدي ولعبدي ما سأل» (این میان من و بنده من است و برای بنده من است آنچه خواسته است). پس فرموده خداوند متعال که «هذه بيني وبين عبدي» (این میان من و بنده من است) روشن می‌شود. پس در حکم یاری‌رسانی، اگر خداوند وجود نماز را اراده کند، ناگزیر است که محل (محل ظهور نماز) آماده باشد. پس بفهم.\n\n### فصل: در مورد فرموده خداوند متعال: «وَذَكِّرْهُمْ بِأَيَّامِ اللهِ»\n\nو اما تذکر دادن به روزهای خدا، در حقیقت همان روزهای نَفَس‌ها (دم و بازدم) است؛ زیرا کمترین چیزی است که نام روز بر آن اطلاق می‌شود. پس آن این است که او را به فرموده خداوند متذکر سازی: «كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» (هر روز او در کاری است). این‌ها روزهای خدا هستند و تو از آن‌ها غافلی. و این در مضمون فرموده خداوند متعال داخل می‌شود: «إِنَّ فِي ذلِكَ» (همانا در آن) که اشاره به فرموده «كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» و غیر آن دارد، «لَعِبْرَةً لِمَنْ كانَ لَهُ قَلْبٌ» (عبرتی است برای کسی که قلب دارد)، یعنی برای کسی که به واسطه دگرگونی احوال یا دگرگونی احوال بر او، فطنت دارد. پس از آن، شئون حق و حقایق روزهایی را که حق در آن‌ها در شأن است، می‌داند. شأن (کار الهی) از نظر عین واحد است، اما قوابل (پذیرندگان) مختلف و بسیارند که این شأن به واسطه تنوع و اختلاف آن‌ها، متنوع می‌شود. پس از جانب خدا واحد است و در صور عالم کثیر، مانند صورت واحد در آینه‌های بسیار و سایه‌های بسیار از شخص واحد برای چراغ‌های متعدد. امر چنین است. «أَوْ أَلْقَى السَّمْعَ» (یا گوش فرا دهد) به آنچه بر او تلاوت می‌شود، از قبیل فرموده «كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» و امثال آن، «وَهُوَ شَهِيدٌ» (و او شاهد است) از نفس خود بر دگرگونی احوالش. پس در این باره از جانب خدا بر بصیرت است. این‌ها روزهای خدا هستند که شایسته است بنده به آن‌ها متذکر شود، علاوه بر امثال آن از روزهای خدا، که همان روزهای نعمت‌ها و روزهای انتقام است که خداوند در آن‌ها امت‌های گذشته را مؤاخذه کرد.\n\nو بدان که بلاها در دنیا بیشتر از نعمت‌ها هستند؛ زیرا هیچ نعمتی نیست که خداوند بر بندگانش ارزانی دارد و از بلا خالص باشد. زیرا خداوند او را به قیام به حق آن، از شکر بر آن و نسبت دادن آن به کسی که شایسته آن است (به واسطه ایجاد)، و صرف کردن آن در موطنی که حق به او امر کرده است که در آن صرف کند، مطالبه می‌کند. کسی که شهود (الشهود) او در نعمت‌ها این شهود باشد، چه زمانی برای لذت بردن از آن‌ها فراغت می‌یابد؟ همچنین در مورد مصیبت‌ها (رزایا)، آن‌ها خودشان مصیبت و بلا هستند و تکلیفی را در بر دارند که نعمت‌ها در بر دارند، یعنی طلب صبر بر آن‌ها و بازگشت به حق برای رفع آن‌ها از او، و پذیرش آن‌ها با رضایت یا صبری که همان حبس نفس از شکایت به غیر خداست. و این نهایت جهل به خداست، زیرا تو از قوی به ضعیف شکایت می‌کنی، به دلیل راحتی که در حال شکایت می‌یابی، در حالی که به کسی شکایت می‌کنی که شایسته شکایت نیست، زیرا می‌دانی که او چیزی در دست ندارد و نمی‌تواند آنچه بر تو نازل شده را رفع کند، مگر کسی که آن را نازل کرده است. و دانستی که این دنیا سرای بلاست و نعمت در آن حتی برای یک لحظه از بلا خالص نمی‌شود. و کمترین آن، طلب شکر از نعمت‌دهنده بر آن است. و چه تکلیفی بر نفس دشوارتر از آن است؟ به همین دلیل خداوند متعال فرمود: «وَقَلِيلٌ مِنْ عِبادِيَ الشَّكُورُ» (و اندکی از بندگان من شکرگزارند)، به دلیل جهلشان به نعمت‌ها که باید بر آن‌ها شکر کرد. فرموده خداوند متعال: «إِنَّ فِي ذلِكَ لَآياتٍ لِكُلِّ صَبَّارٍ شَكُورٍ» (همانا در آن نشانه‌هایی است برای هر صبرکننده شکرگزار)، آنچه گفتیم را تأیید می‌کند. این در مورد دریانوردی است که باد بر او سخت می‌وزد. در آنچه از نعمت در آن است، طلب شکر بر آن می‌شود، و در آنچه از سختی و ترس در آن است، طلب صبر می‌شود. پس بفهم و در کلام خدا تدبر کن تا غنیمت بری. و خداوند آن را نازل نکرده است، مگر تذکری برای خردمندان، چنانکه فرمود: «لِيَدَّبَّرُوا آياتِهِ وَلِيَتَذَكَّرَ أُولُوا الْأَلْبابِ» (تا در آیاتش تدبر کنند و خردمندان متذکر شوند). و از کسانی مباش که نصیبی از آن ندارند، جز ابلاغ.\n\n### فصل: در مورد روز عقیم\n\nو عقیم (نازا) چیزی است که موجب می‌شود از آن فرزندی متولد نشود، پس ولادتی مانند خود نخواهد داشت. و عقیم نامیده شد، زیرا اصلاً روزی پس از آن نیست. و آن از روزهای هفته، روز شنبه است که روز ابدیت است. روز آن، نوری دائمی برای اهل بهشت است که هرگز زائل نمی‌شود، و شب آن، ظلمتی بر اهل آتش است که هرگز زائل نمی‌شود. به همین دلیل، اهل کبائر که پس از عقوبت از آن خارج شده و به بهشت می‌روند، در آن می‌میرند؛ زیرا جاودانگی در آتش جز برای اهل آن که اهل آن هستند، نیست.\n\nرسول خدا (صلی الله علیه و سلم) می‌فرماید: «اما اهل آتشی که اهل آن هستند، در آن نمی‌میرند و زنده نمی‌شوند، بلکه مردمی هستند که آتش به سبب گناهانشان به آنان رسیده است، پس خداوند آنان را در آن می‌میراند، میراندنی.»\n\nو این حدیث صحیح است. پس در آن می‌خوابند، خوابی که آتش را احساس نمی‌کنند، هنگامی که بر ابزارهای معصیت (جوارح) با خوردن مسلط می‌شود. و ایمان مانع از رسیدن آن به قلب می‌شود. این عنایت توحیدی است که در قلب‌هایشان بوده است. پس علم توحید آنان را در آتش می‌میراند، میراندنِ خوابیده در حال خوابش. و ایمان بر در آتش منتظر آنان است تا زمانی که خداوند آنان را از آن خواب برانگیزد، در حالی که زغال شده‌اند. خداوند سبحان آنان را خارج می‌کند و در نهر حیات غوطه‌ور می‌سازد. پس می‌رویند، چنانکه دانه در سیلاب می‌روید. سپس وارد بهشت می‌شوند. پس در آتش کسی که در دنیا حتی یک بار علم به اینکه خداوند، خدای یگانه است، داشته، باقی نمی‌ماند.\n\nو اهل بهشت در بهشت مقادیری دارند که با آن‌ها پایان مدت طلوع خورشید تا غروب آن در دنیا را می‌شناسند، هرچند در بهشت خورشیدی نیست. پس حرکتی که خورشید با آن سیر می‌کرد و به واسطه آن طلوع و غروبش ظاهر می‌شد، در فلک اطلس که بر فراز بهشت و سقف آن است، موجود است. و عین آن حرکت در آن وجود دارد. و اهل بهشت کشف (الکشف) و رؤیتی نسبت به مقادیری که در آن است و با بروج (صورت‌های فلکی) تعبیر می‌شود، دارند. زیرا آن فلک، همان آسمانی است که خداوند در فرموده‌اش: «وَالسَّماءِ ذاتِ الْبُرُوجِ» (سوگند به آسمان دارای برج‌ها) به آن سوگند یاد کرده است. پس با آن، حد آنچه در دنیا بر آنان بود و «بکره» (بامداد) و «عشی» (شامگاه) نامیده می‌شد، می‌دانند. و در این زمان در دنیا حالتی داشتند که «غداء» (ناهار) و «عشاء» (شام) نامیده می‌شد. پس آن را در آنجا به یاد می‌آورند. در آن هنگام، خداوند رزقی را که در آن به آنان روزی می‌دهد، برایشان می‌آورد، چنانکه فرمود: «لَهُمْ رِزْقُهُمْ فِيها بُكْرَةً وَعَشِيًّا» (روزی‌شان در آنجا بامداد و شامگاه است). و این رزقی خاص در وقت خاصی است که نزد آنان معلوم است. و غیر از آن، خوردنی‌های آن دائمی است و قطع نمی‌شود. و دوام در خوردن، عین نعیم است، به واسطه آنچه غذا برای جسم فراهم می‌کند. اما بسیاری از مردم جز عالمان به علم طبیعت، آن را درک نمی‌کنند. و آن، یعنی صورت فرموده «أُكُلُها دائِمٌ» (خوردنی‌های آن دائمی است)، این است که انسان اگر غذا بخورد تا سیر شود، آن در حقیقت نه غذاست و نه خوردن. بلکه مانند جمع‌آوری‌کننده‌ای است که مال را در خزانه‌اش جمع می‌کند. و معده، خزانه چیزی است که این خورنده از غذاها و نوشیدنی‌ها جمع کرده است. پس هنگامی که آن را در آن، یعنی در خزانه معده‌اش قرار داد و آنچه را در آن ذخیره کرد، و دست کشید، در آن هنگام طبیعت تدبیر آن را بر عهده می‌گیرد و آن غذا از حالی به حال دیگر منتقل می‌شود و در هر نفسی که از او خارج می‌شود، دائماً او را تغذیه می‌کند. پس او دائماً در تغذیه دائمی است. و اگر چنین نبود، حکمت در ترتیب نشأت هر متغذی (کسی که تغذیه می‌شود) باطل می‌شد. و خداوند حکیم است. پس هنگامی که خزانه خالی شد، طبیعت، جمع‌آوری‌کننده را به سوی تحصیل آنچه آن را پر کند، تحریک می‌کند. پس امر همیشه این‌گونه دائمی است. پس صورت تغذیه در متغذی چنین است، تغذیه در هر نفس، در دنیا و آخرت. و همچنین اهل آتش. خداوند آنان را به خوردن و نوشیدن در آن بر این حد وصف کرده است، جز اینکه آن سرای بلاست. پس از گرسنگی می‌خورند و از تشنگی می‌نوشند. و اهل بهشت از روی شهوت برای التذاذ می‌خورند و می‌نوشند، نه از روی گرسنگی. زیرا آنان چیزی را که غذا نامیده می‌شود، تناول نمی‌کنند، مگر با علم به اینکه زمانی که ذخیره‌سازی در آن بود، آنچه ذخیره شده بود، تمام شده است. پس به سرعت به سوی طبیعت می‌روند تا آنچه را تدبیر می‌کند، به دست آورند. پس دائماً در لذت و نعیم هستند و طبیعت را به طلب و نیاز محتاج نمی‌کنند، به دلیل کشف (الکشف) که بر آن هستند. چنانکه اهل آتش در حجاب هستند، پس این مقدار را نمی‌دانند و گرسنه و تشنه می‌شوند، زیرا مقصود از آنان این است که درد بکشند. پس برای تو روشن شد که لذتی جز علم نیست و دردی جز جهل نیست.\n\nو خورشید کروی است که نورش در چشمان آنان گرفته شده است، در حالی که بر اهل آتش طلوع و غروب می‌کند، چنانکه بر اهل دنیا در حال کسوفش طلوع می‌کند. و همچنین ماه. هر دو و تمام ستارگان بر صورت سیر کنونی‌شان در افلاکشان شناورند، اما در چشمان آنان مطموس (تاریک) هستند. پس در واقع، خود آنان هستند که خداوند چشمانشان را از درک انواری که در دیدنی‌هاست، کور کرده است. پس حجاب بر چشمان آنان است. چنانکه می‌دانیم خورشید در اینجا در حال کسوف، نورش از آن زائل نشده است، بلکه ماه آن را از ما پوشانده است. و اگر چنین نبود، اهل تعلیم نمی‌دانستند که کسوف چه زمانی رخ می‌دهد و چه مقدار از آن در کسوف از چشمان ما پنهان می‌شود. و این بر اساس آنچه ذکر کرده‌اند، واقع می‌شود. پس اگر از اموری بود که بر مقادیر وضع شده و موازین محکمی که خداوند به کسی که او را برای طلب چنین علمی موفق کرده، تعلیم داده است، جاری نمی‌شد، آن را نمی‌دانست. و این در سخن ما که «خورشید کسوف کرده است» یا «نورش از درک چشمان ما زائل شده است»، قدحی وارد نمی‌کند. زیرا هیچ کس ما را از اینکه بر این مقدار و این صورت، نام کسوف و خسوف و تکویر و طمس (تاریک شدن) بگذاریم، منع نمی‌کند. پس اهل آتش اجرام سیاره را در حال طلوع و غروب بر خود مشاهده می‌کنند، اما نوری برای آن‌ها نمی‌بینند، به دلیل تطفيف (کاهش) در دود. همان‌گونه که در دنیا از درک انوار آنچه شرایع از حق آورده بودند، کور بودند، در آتش نیز از درک انوار این سیارات و دیگر کواکب کور هستند. «وَمَنْ كانَ فِي هذِهِ أَعْمى‏ فَهُوَ فِي الْآخِرَةِ أَعْمى‏ وَأَضَلُّ سَبِيلًا» (و کسی که در این دنیا کور باشد، در آخرت نیز کور و گمراه‌تر است). و اینکه «گمراه‌تر» است، بدان روست که در دنیا کسی را می‌یابد که او را به راه ارشاد کند، اما نمی‌شنود. و در آتش کسی را نمی‌یابد که او را به راه ارشاد کند، زیرا راهی در آنجا نیست. اما کسی را می‌یابد که او را بر آنچه از دست داده، پشیمان سازد تا حسرتش را بر حسرتش و عذابش را بر عذابش بیفزاید. پس شب اهل آتش، صبح ندارد و روز اهل بهشت، شام ندارد، یعنی شبی در آن نیست.\n\nپس کسی که مردم را در عقیده موعظه کند و با این کار قصد نفع رساندن به مردم در عقیده‌شان را داشته باشد، خدا را نشناخته است. بر خلاف مذکر (تذکردهنده)، که تذکر می‌دهد و موعظه می‌کند با آنچه نزد اوست و می‌داند که برخی از شنوندگان، آن موعظه برایشان شفا و دوا خواهد بود و برخی دیگر، مرضشان را بر مرضشان می‌افزاید. چنانکه خداوند متعال می‌فرماید: «وَإِذا ما أُنْزِلَتْ سُورَةٌ» (و هنگامی که سوره‌ای نازل می‌شود) که واحد است، «فَأَمَّا الَّذِينَ آمَنُوا فَزادَتْهُمْ إِيماناً وَهُمْ يَسْتَبْشِرُونَ» (اما کسانی که ایمان آورده‌اند، بر ایمانشان می‌افزاید و شادمان می‌شوند) به دلیل ورود عافیت بر آنان، «وَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ فَزادَتْهُمْ رِجْساً إِلَى رِجْسِهِمْ» (و اما کسانی که در دل‌هایشان مرض است، پلیدی بر پلیدی‌شان می‌افزاید). و سوره واحد است و مزاج‌ها مختلف. حقیقت این آیه را جز پزشکانی که می‌دانند فلان دارو برای مزاج خاصی از بیماری خاص شفاست، و برای مزاج خاصی درد و علت و افزایش بیماری در بیماری خاص است، نمی‌دانند. پس طبیب سزاوارترین مردم به علم این آیه است. و همچنین طبیب قلب‌ها در آنچه به آن‌ها امنیت می‌دهد و آن‌ها را می‌ترساند. پس حکیم کسی است که از همان جایی که بیمار از آن رنج می‌برد، به سراغ او می‌آید و خود را به صورتی که بیمار به او اعتقاد دارد، نشان می‌دهد تا او را به سوی صورت حق با حقی که شایسته اوست، بکشاند.\n\nاما امر الهی در عالم بر خلاف این واقع شده است، زیرا مشیت خدا به این تعلق گرفته است که خداوند آنان را بر هدایت جمع نکند. و اما راه در این باره، نزد خدا و نزد اهل او معلوم است و در آن شک نمی‌کنند. زیرا کسی که به مخلوقی، خواه سنگ یا گیاه یا حیوان یا ستاره، اعتقاد دارد که خدای اوست و او را می‌پرستد، آن خدای مشهود (مشهود له) بر اساس کشف (الکشف) با او سخن می‌گوید به آنچه حق بر آن است. این امر به سخن او باز می‌گردد، به دلیل اعتقادش به او، چنانکه در آخرت به سخن او باز می‌گردد و از او بیزاری می‌جوید، همان‌گونه که خدای او از او بیزاری جسته است. و خداوند قادر است که او را در دنیا به این امر در حق کسی که او را می‌پرستد، به سخن آورد، اما علم سابق و مشیت الهیه از آن منع کردند تا اختلاف در عالم باشد. پس امر در دنیا و بخشی از آخرت بر این جاری شد. و امر به حکم گرفتن میثاق با رحمتی که «وَسِعَتْ كُلَّ شَيْ‏ءٍ» (همه چیز را فرا گرفته است) باز می‌گردد. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}