{
  "id": 336,
  "title": {
    "ar": "الباب السادس والثلاثون وثلاثمائة في معرفة منزل مبايعة النبات القطب صاحب الوقت في كل زمان وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Thirty-Six: Concerning the Gnosis (معرفة) of the Station (منزل) of the Pledge of Allegiance (مبايعة) of the Vegetation (النبات) to the Pole (القطب), the Master of the Time (صاحب الوقت) in every age, and he is from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو چھتیس: ہر زمانے میں قطب صاحب الوقت (القطب صاحب الوقت) کے ساتھ نباتات کی بیعت (مبايعة النبات) کے مقام (منزل) کی معرفت (المعرفۃ) کے بیان میں، اور یہ (مقام) الحضرة المحمدية (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و سی و ششم در معرفت منزل بیعت گیاه (النبات) قطب صاحب زمان در هر عصر، و او از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب السادس والثلاثون وثلاثمائة في معرفة منزل مبايعة النبات القطب صاحب الوقت في كل زمان وهو من الحضرة المحمدية»\n> أقسمت بالله الذي أقسما *** بنفسه وإي وربي وما\n\n\n> بأنه وتر بلا موتر *** في أرضه وخلقه أينما\n\n\n> وإنه ينزل من عرشه *** نزوله لعرشه من عما\n\n\n> من غير تكييف ولا فرقة *** فإنه منزه عنهما\n\n\n### [أن المبايعة العامة لا تكون إلا لواحد الزمان خاصة]\n\n\nاعلم أيدك الله أن المبايعة العامة لا تكون إلا لواحد الزمان خاصة وإن واحد الزمان هو الذي يظهر بالصورة الإلهية في الأكوان هذا علامته في نفسه ليعلم أنه هو ثم له الخيار في إمضاء ذلك الحكم أو عدم إمضائه والظهور به عند الغير فذلك له فمنهم الظاهر ومنهم من لا يظهر ويبقي عبدا إلا إن أمره الحق بالظهور فيظهر على قدر ما وقع به الأمر الإلهي لا يزيد على ذلك شيئا هذا هو المقام العالي الذي يعتمد عليه في هذا الطريق لأن العبد ما خلق بالأصالة إلا ليكون لله فيكون عبدا دائما ما خلق أن يكون ربا فإذا خلع الله عليه خلعة السيادة وأمره بالبروز فيها برز عبدا في نفسه سيدا عند الناظر إليه فتلك زينة ربه وخلعته عليه قيل لأبي يزيد البسطامي رحمه الله في تمسح الناس به وتبركهم فقال رضي الله عنه ليس بي يتمسحون وإنما يتمسحون بحلية حلانيها ربي أ فامنعهم ذلك وذلك لغيري وقيل لأبي مدين في تمسح الناس به بنية البركة وتركهم يفعلون ذلك أما تجد في نفسك من ذلك أثرا فقال هل يجد الحجر الأسود في نفسه أثرا يخرجه عن حجريته إذا قبلته الرسل والأنبياء والأولياء وكونه يمين الله قيل لا قال أنا ذلك الحجر قال تعالى في هذا المقام إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله فنفاه بعد ما أثبته صورة كما فعل به في الرمي سواء أثبته ونفاه وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ ثم جعل الله يده في المبايعة فوق أيدي المبايعين فمن أدب المبايعة إذا أخذ المبايعون يد المبايع للبيعة ليقبلوها جعلوا أيديهم تحتها وجعلوها فوق أيديهم كما يأخذ الرحمن الصدقة بيمينه من يد المتصدق فمن الأدب من المتصدق أن يضع الصدقة في كف نفسه وينزل بها حتى تعلو يد السائل إذا أخذها على يد المعطي حتى تكون هي اليد العليا وهي خير من اليد السفلي واليد العليا هي المنفقة فيأخذها الرحمن لينفقها له تجارة حتى تعظم فيجدها يوم القيامة قد نمت وزادت هذا مذهب الجماعة وأما مذهبنا الذي أعطاه الكشف إيانا فليس كذلك إنما السائل إذا بسط يده لقبول الصدقة من المتصدق جعل الحق يده على يد السائل فإذا أعطى المتصدق الصدقة وقعت بيد الرحمن قبل إن تقع بيد السائل كرامة بالمتصدق ويخلق مثلها في يد السائل لينتفع بها السائل ويأخذ الحق عين تلك الصدقة فيربيها فتربو حتى تصير مثل جبل أحد في العظم وهذا من باب الغيرة الإلهية حيث كان العطاء من أجله لما يرى أن الإنسان يعطي من أجل هواه ما يعظم شأنه من الهبات ويعطي من أجل الله أحقر ما عنده هذا هو الغالب في الناس فيغار الله لجنابه إن لا يرى في مقام الاستهضام فيربي تلك الصدقة حتى تعظم فإذا جلاها في صورة تلك العظمة حصل المقصود فيد المعطي تعلو على يد الآخذ ولهذا قال تقع والوقوع لا يكون إلا من أعلى وقد قال صَلَّى اللهُ عَليهِ وسَلَّم لو دليتم بحبل لهبط على الله‏\n\n\nأي كما ينسب إلى العلو في الاستواء على العرش هو في التحت أيضا كما هو بِكُلِّ شَيْ‏ءٍ مُحِيطٌ للحفظ كما يحفظ محيط الدائرة الوجود أو نسبة الوجود على النقطة التي ظهرت عنها نسبة الإحاطة لوجود الدائرة المحيطة فله الفوق كما له التحت وله الظاهر كما له الباطن فهو المبايع والمبايع فإنه لا يبايع إلا بالسمع والطاعة والسمع لا يكون إلا هو والعمل بالطاعة لا يكون إلا له فهو السميع العامل لما أمر بعمله فلنذكر صورة البيعة ولنا فيها كتاب مستقل سميناه مبايعة القطب يتضمن علما كبيرا ما علمنا أنا سبقنا إليه وإن كان العارفون من أهل الله شاهدوه وعلموه ولكن شغلهم عن تبيينه للناس ما كان المهم عندهم كما كان إظهاره للناس من المهم عندنا إذ هذه الطائفة لا شغل لها إلا بالأهم هذا إذا لم يظهر بحكم القوة الإلهية فإذا ظهر بها لم يشغله شي‏ء عن شي‏ء إذ هو حق كله فاعلم ذلك إيضاح وبيان لمنصب البيعة وصورتها\n\n\n### [إن الله إذا ولي قطبا وخليفة نصب له في حضرة المثال سريرا أقعده عليه ينبئ صورة ذلك المكان عن صورة المكانة]\n\n\nفاعلم إن الله سبحانه إذا ولي من ولاة النظر في العالم المعبر عنه بالقطب وواحد الزمان والغوث والخليفة نصب له في حضرة المثال سريرا أقعده عليه ينبئ صورة ذلك المكان عن صورة المكانة كما أنبأ صورة الاستواء على العرش عن صورة إحاطته علما بكل شي‏ء فإذا نصب له ذلك السرير خلع عليه جميع الأسماء التي يطلبها العالم وتطلبه فيظهر بها حللا وزينة متوجا مسورا مدملجا\nلتعمه الزينة علو أو سفلا ووسطا وظاهرا وباطنا فإذا قعد عليه بالصورة الإلهية وأمر الله العالم ببيعته على السمع والطاعة في المنشط والمكره فيدخل في بيعته كل مأمور أعلى وأدنى إلا العالين وهم المهيمون العابدون بالذات لا بالأمر فيدخل في أول من يدخل عليه في ذلك المجلس الملأ الأعلى على مراتبهم الأول فالأول فيأخذون بيده على السمع والطاعة ولا يتقيدون بمنشط ولا مكره لأنهم لا يعرفون هاتين الصفتين فيهم إذ لا يعرف شي‏ء منهما إلا بذوق ضده فهم في منشط لا يعرفون له طعما لأنهم لم يذوقوا المكره وما منهم روح يدخل عليه للمبايعة إلا ويسأله في مسألة من العلم الإلهي فيقول له يا هذا أنت القائل كذا فيقول له نعم فيقول له في المسألة وجها يتعلق بالعلم بالله يكون أعلى من الذي كان عند ذلك الشخص فيستفيد منه كل من بايعه وحينئذ يخرج عنه هذا شأن هذا للقطب والكتاب الذي صنفته فيه ذكرت فيه سؤالاته للمبايعين له التي وقعت في زماننا لقطب وقتنا فإنها ما هي مسائل معينة تتكرر من كل قطب وإنما يسأل كل قطب فيما يخطر الله في ذلك الحين مما جرى لهذا الذي بايعه من الأرواح فيه كلام فأول مبايع له العقل الأول ثم النفس ثم المقدمون من عمال السموات والأرض من الملائكة المسخرة ثم الأرواح المدبرة للهياكل التي فارقت أجسامها بالموت ثم الجن ثم المولدات وذلك أنه كل ما سبح الله من مكان ومتمكن ومحل وحال فيه يبايعه إلا العالين من الملائكة وهم المهيمون والأفراد من البشر الذين لا يدخلون تحت دائرة القطب وما له فيهم تصرف وهم كمل مثله مؤهلون لما ناله هذا الشخص من القطبية لكن لما كان الأمر لا يقتضي أن يكون في الزمان إلا واحد يقوم بهذا الأمر تعين ذلك الواحد لا بالأولوية ولكن بسبق العلم فيه بأن يكون الوالي وفي الأفراد من يكون أكبر منه في العلم بالله وهذا المنزل يتضمن مبايعة النبات من المولدات ويدخل فيه قوله في الأجسام الإنسانية والله أَنْبَتَكُمْ من الْأَرْضِ فنبتم نَباتاً فجاء في ذكرهم بالإنبات أنه أنبتهم ولم يؤكده بالمصدر وجاء بمصدر آخر ليعرف بأنهم نبتوا حين أنبتهم فأوقع الاشتراك بينه وبينهم في الخلق ينبه أنه لو لا استعدادهم للانبات ما أثرت فيهم الأسماء فكان خروجهم من الأسماء والاستعداد فللأسماء قوله أَنْبَتَكُمْ من الْأَرْضِ وللاستعداد قوله نَباتاً لأن نباتا مصدر نبت لا مصدر أنبت فإن مصدر أنبت إنما هو إنبات فانظروا ما أعجب مساق القرآن وإبراز الحقائق فيه كيف يعلمنا الله في إخباراته ما هي الأمور عليه فيعطي كل ذي حق حقه إذ لا ينفذ الاقتدار الإلهي إلا فيمن هو على استعداد النفوذ فيه ولا يكون ذلك إلا في الممكنات إذ لا نفوذ له في الواجب الوجود لنفسه ولا في المحال الوجود فسبحان العليم الحكيم‏\n\n\n### [أن الإنسان شجرة من الشجرات‏]\n\n\nواعلم أن الإنسان شجرة من الشجرات أنبتها الله شجرة لا نجما لأنه قائم على ساق وجعله شجرة من التشاجر الذي فيه لكونه مخلوقا من الأضداد والأضداد تطلب الخصام والتشاجر والمنازعة ولهذا يختصم الملأ الأعلى وأصل وجوده في العالم حكم الأسماء الإلهية المتقابلة في الحكم لا غير هذا مستندها الإلهي قال تعالى في حق محمد صَلَّى اللهُ عَليهِ وسَلَّم إنه قال ما كانَ لِي من عِلْمٍ بِالْمَلَإِ الْأَعْلى‏ إِذْ يَخْتَصِمُونَ حتى أعلمه الله تعالى فعلم إن للطبيعة فيهم أثرا كما إن للأركان في أجسام المولدات أثرا فلما كان الناس شجرات جعل فيهم ولاة يرجعون إليهم إذا اختصموا ليحكموا بينهم ليزول حكم التشاجر وجعل لهم إماما في الظاهر واحدا يرجع إليه أمر الجميع لإقامة الدين وأمر عباده أن لا ينازعوه ومن ظهر عليه ونازعه أمرنا الله بقتاله لما علم إن منازعته تؤدي إلى فساد في الدين الذي أمرنا الله بإقامته وأصله قوله تعالى لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا فمن هناك ظهر اتخاذ الإمام وأن يكون واحدا في الزمان ظاهرا بالسيف فقد يكون قطب الوقت هو الإمام نفسه كأبي بكر وغيره في وقته وقد لا يكون قطب الوقت فتكون الخلافة لقطب الوقت\n\n\nالذي لا يظهر إلا بصفة العدل ويكون هذا الخليفة الظاهر من جملة نواب القطب في الباطن من حيث لا يشعر فالجور والعدل يقع في أئمة الظاهر ولا يكون القطب إلا عدلا وأما سبب ظهوره في وقت وخفاء بعضهم في وقت فهو إن الله ما جبر أحدا على كينونته في مقام الخلافة وإنما الله أعطاه الأهلية لذلك المقام وعرض عليه الظهور فيه بالسيف حسبما ما أمره فمن قبله ظهر بالسيف فكان خليفة ظاهرا وباطنا ما ثم غيره وإن اختار عدم الظهور لمصلحة رآها أخفاه الله وأقام عنه نائبا في العالم يسمى خليفة يجور ويعدل وقد يكون عادلا على قدر ما يوفقه الله سبحانه ويكون حكمه وإن كان جائرا حكم الإمام العادل من نازعه قتل ولا يقتل إلا الآخر فإنه المنازع وأمرنا الله أن لا نخرج يدا من‏\nطاعته وأخبرنا أنه من عدل منهم فلهم وأن من جار منهم فعليهم ولنا ولما كان الإنسان شجرة كما ذكرناه نهى الله أول إنسان عن قرب شجرة عينها له دون سائر الشجرات كما هو الإنسان شجرة معينة بالخلافة دون سائر الشجرات فنبهه أن لا يقرب هذه الشجرة المعينة على نفسه وظهر ذلك في وصيته لداود ولا تَتَّبِعِ الْهَوى‏ يعني هوى نفسه فهو الشجرة التي نهى آدم أن يقربها أي لا تقارب موضع النزاع والخلاف فيؤثر فيك نشأة جسدك الطبيعي العنصري يقول ذلك لنفسه الناطقة المدبرة فإن بها يخالف أمر الله فيما أمره به أو نهاه عنه فقوله هذه الشجرة بحرف الإشارة تعيين لشجرة معينة ولما كانت الإمامة عرضا كما كانت الأمانة عرضا والإمامة أمانة لذلك ظهر بها بعض الأقطاب ولم يظهر بها بعضهم فنظر الحق لهذا القطب بالأهلية ولو نظر الله للإمام الظاهر بهذه العين ما جار إمام قط كما تراه الإمامية في الإمام المعصوم فإنه من شرط الإمام الباطن أن يكون معصوما وليس الظاهر إن كان غيره يكون له مقام العصمة ومن هنا غلطت الإمامية فلو كانت الإمامة غير مطلوبة له وأمره الله أن يقوم فيها عصمه الله بلا شك عندنا وقد نبه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم على ما قررناه كله فنبه على العرض بفعله حيث لم يجبر أحدا على ولاية\n\n\nبل ذكر أنه من تركها كان خيرا له وإنها يوم القيامة حسرة وندامة إلا لمن قام فيها بصورة العدل‏\n\n\nونبه على عصمة من أمر بها\n\n\nبقوله فمن أعطيها عن مسألة وكل إليها ومن جاءته عن غير مسألة وكل الله به ملكا يسدده‏\n\n\nوهذا معنى العصمة والسؤال هنا إشارة إلى الرضاء بها والمحبة لهذا المنصب فهو سائل بباطنه وغيره ممن يكره ذلك يجبره أهل الحل والعقد عليها ويرى أنه قد تعين عليه الدخول فيها والتلبس بها لما يرى أن تخلف عنها من ظهور الفساد فيقوم له ذلك في الظاهر مقام الجبر الإلهي بالأمر على التلبس بها فيعصم فيكون عادلا إذ الملك الذي يسدده لا يأمره إلا بخير حتى القرنين‏\n\n\nكما قال صَلَّى اللهُ عَليهِ وسَلَّم إنه أعانه الله عليه فأسلم‏\n\n\nبرفع الميم ونصبها وقال فلا يأمرني إلا بخير فمبايعة النبات هذا القطب هو أن تبايعه نفسه أن لا تخالفه في منشط ولا مكره مما يأمرها به من طاعة الله في أحكامه فإن الله قد جعل زمام كل نفس بيد صاحبها وأمرها إليه فقال وأَمَّا من خافَ مَقامَ رَبِّهِ ونَهَى النَّفْسَ عَنِ الْهَوى‏ يعني نفسه وكذلك في داود ولا تَتَّبِعِ الْهَوى‏ يعني نفسه فإنه لو كان هوى غيره نهى أن يتبعه فاتبعه فما يتبعه إلا بهوى نفسه فطاوع نفسه في ذلك فلذلك تعين أنه أراد بالهوى نفسه لا غيره وهو أن يأمره بمخالفة ما أمره الله به أن يفعله أو ينهاه عنه فإذا بايعته نفسه انصرف حكم شجريتها إلى منازعة من ينازع أمر الله فبقي حكم حقيقتها في المخالفين أمر الله إذ علم الله أن حقيقة الخلاف لا تزول فإنها شجرة لعينها فلو زال لزال عينها فلهذا عين الله لها مصرفا خاصا يكون فيه سعادتها وكل من عرف القطب من الناس لزمته مبايعته وإذا بايعه لزمته بيعته وهي من مبايعة النبات فإنها بيعة ظاهرة لهذا القطب التحكم في ظاهره بما شاء وعلى الآخر التزام طاعته وقد ظهر مثل هذا في الشرع الظاهر أن المتنازعين لو اتفقا على حكم بينهما فيما تنازعا فيه فحكم بينهما بحكم لزمهما الوقوف عند ذلك الحكم وأن لا يخالفا ما حكم به فالقطب المنصوب من جهة الحق أولى بالحكم فيمن عرف إمامته في الباطن من الناس ولهذا التحكم الذي قلناه منه في ظاهر من بايعه ألحقنا هذه المبايعة ببيعة النبات بل إن حققت الأمر واتبعت فيه الأصل وجدت النباتية في النفس الجزئية الناطقة لأنها ما ظهرت إلا من هذا الجسم المسوي المعدل وعلى صورة مزاجه فهي أرضه التي نبتت منه حين أنبتها الله بالنفخ في هذا الجسم من روحه وهكذا كل روح مدبر لجسم عنصري فالسعيد من عرف إمام وقته فبايعه وحكمه في نفسه وأهله وماله كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم في حق نفسه لا يكمل لعبد الايمان حتى أكون أحب إليه من أهله وماله والناس أجمعين‏\n\n\nولهذا يشترط في البيعة المنشط والمكره لأن الإنسان ما ينشط إلا إذا وافق الله هوى نفسه والمكره إذا خالف أمر الله هوى نفسه فيقوم به على كره لإنصافه ووفائه بحكم البيعة فإنه ما بايع إلا الله إذ كانت يَدُ الله فَوْقَ أَيْدِيهِمْ وما شاهدوا بالأبصار إلا يد هذا الشخص الذي بايعوه والنفس أبدا في الغالب تحت حكم مزاجها والقليل من الناس من يحكم نفسه على طبيعته ومزاجه فإن الأمومة للجسم المسوي والنبوة للنفس وقد أمر الإنسان بالإحسان لأبويه والبر بهما وامتثال أوامرهما ما لم يأمره أحد الأبوين بمخالفة أمر الحق فلا يطعه كما قال تعالى وإِنْ جاهَداكَ عَلى‏ أَنْ تُشْرِكَ بِي ما لَيْسَ لَكَ به عِلْمٌ فَلا تُطِعْهُما وصاحِبْهُما في الدُّنْيا مَعْرُوفاً واتَّبِعْ سَبِيلَ من أَنابَ إِلَيَ‏\nفأمر باتباع المنيبين إلى الله ومخالفة نفوسهم إن أبت ذلك فحق الإمام أحق بالاتباع قال الله تعالى يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ وهم الأقطاب والخلفاء والولاة وما بقي لهم حكم إلا في صنف ما أبيح لك التصرف فيه فإن الواجب والمحظور من طاعة الله وطاعة رسوله فما بقي للائمة إلا المباح ولا أجر فيه ولا وزر فإذا أمرك الإمام المقدم عليك الذي بايعته على السمع والطاعة بأمر من المباحات وجبت عليك طاعته في ذلك وحرمت مخالفته وصار حكم ذلك الذي كان مباحا واجبا فيحصل للإنسان إذا عمل بأمره أجر الواجب وارتفع حكم الإباحة منه بأمر هذا الذي بايعه فتدبر ما ذكرناه وما نبهنا عليه من أمر الإمام بالمباح واعرف منزلة البيعة وما أثمرت وما أثرت وكيف نسخت حكم الإباحة بالوجوب عن أمر الحق بذلك فنزل الإمام منزلة الشارع بأمر الشارع فتغير الحكم في المحكوم عليه عما كان عليه في الشرع قبل أمر هذا الإمام فمن أنزله الحق منزلته في الحكم تعين اتباعه‏\n\n\n### [أن النبات عالم وسط بين المعدن والحيوان‏]\n\n\nواعلم أن النبات عالم وسط بين المعدن والحيوان فله حكم البرازخ فله وجهان فيعطي من العلم بذاته لمن كوشف بحقيقة ما فيه من الوجوه فإن الكمال في البرازخ أظهر منه في غير البرازخ لأنه يعطيك العلم بذاته وبغيره وغير البرزخ يعطيك العلم بذاته لا غير لأن البرزخ مرآة للطرفين فمن أبصره أبصر فيه الطرفين لا بد من ذلك وفي النبات سر برزخي لا يكون في غيره فإنه برزخ بينه من قوله نَباتاً وبين ربه من قوله أَنْبَتَكُمْ والمنصف العادل من حكم بين نفسه وربه ولا يكون حكما حتى تكون نفسه تنازع ربها فيحكم له عليها لعلمه أن الحق بيد الله بكل وجه وعلى كل حال وسبب نزاعها كونها على الصورة ففيها مضادة الأمثال لا مضادة الأضداد فيدخل الإنسان حكما بين ربه وبين نفسه أ لا تراه مأمورا بأن ينهاها عن هواها فأنزلها منزلة الأجنبي وليس إلا عينها وهي التي ادعت فهي الحكم والخصم ولو اقتصر الأمر دونها على الجسم النامي منه وغير النامي لم تكن منازعة فإنه مفطور على التسبيح لله بحمده فالجسم الإنساني كالنجم من النبات لا يقول على ساق فلا يرجع شجرة إلا بوجود الروح المنفوخ فيه فحينئذ يقوم على ساق بخلاف الأشجار كلها فإنها تقوم على ساق من غير نفخ الروح الحيواني فيها فهو نجم بالأصالة وشجرة بالنفخ فسجوده لله سجود الظلال وسجود الشجر لله سجود الأشخاص القائمين على ساق ولما كان النبات برزخيا كان مرآة قابلا لصور ما هو لها برزخ وهما الحيوان والمعدن إذا بايع بايع لبيعته ما ظهر فيه من صور ما هو برزخ لهما تابعا له فتضمنت بيعة النبات بيعة الحيوان والمعادن لأن هذا الإمام يشاهد الصور الظاهرة في مرآة البرازخ وهو علم عجيب كما يرى الناظر في المرآة في الحس غير صورته مما تقبله المرآة من صور غير الناظر من الأشخاص فيدرك فيها ما هي تلك الأشخاص عليه في أنفسها مع كونها في أعيانها غيبا عنه وما رأى لها صورة إلا في هذا الجسم الصقيل فإن أعطته تلك الصورة علما غير النظر إليها كان ذلك العطاء بمنزلة ما يعطي المبايع في البيعة من السمع والطاعة لمن بايعه وإن لم تعط علما لم يرجع ذلك إليها وإنما هو رجع إلى الناظر وإنه ليس بإمام ولا خليفة ولا له بيعة أصلا وبهذا يتميز الإمام في نفسه عن غيره ويعلم أنه إمام فإن أخذ العلم هذا الناظر من تلك الصورة بحكم التفكر والاعتبار فيخيل أنه إمام وقته فليس كذلك إلا أن تعطيه الصور العلم من ذاتها كشفا من غير فكر ولا اعتبار وإن اتفق أن يساويه صاحب الفكر في ذلك العلم الكشفي فليس بإمام لاختلاف الطريق فإن الإمام لا يقتني العلوم من فكره بل لو رجع إلى نظره لأخطأ فإن نفسه ما اعتادت إلا الأخذ عن الله وما أراد الله لعنايته بهذا العبد أن يرزقه الأخذ من طريق فكره فيحجبه ذلك عن ربه فإنه في كل حال يريد الحق أن يأخذ عنه ما هو فيه من الشئون في كل نفس فلا فراغ له ولا نظر لغيره وللعاقل إذا استبصر دليل قد وقع يدل على صحة ما ذكرناه‏\n\n\nنهى النبي صَلَّى اللهُ عَليهِ وسَلَّم عن إبار النخل ففسد لأنه لم يكن عن وحي إلهي ونزوله يوم بدر على غير ماء فرجع إلى كلام أصحابه‏\n\n\nفإنه صَلَّى اللهُ عَليهِ وسَلَّم ما تعود أن يأخذ العلوم إلا من الله لا نظر له إلى نفسه في ذلك وهو الشخص الأكمل الذي لا أكمل منه فما ظنك بمن هو دونه وما بقي للعارفين بالله علاقة بين الفكر وبينهم بطريق الاستفادة ولا يسمى الشخص إلهيا إلا أن لا يكون أخذه العلوم إلا عن الله من فتوح المكاشفة بالحق يقول أبو يزيد البسطامي أخذتم‏\nعلمكم ميتا عن ميت حدثنا فلان وأين هو قال مات عن فلان وأين هو قال مات فقال أبو يزيد وأخذنا علمنا عن الحي الذي لا يموت فلا حجاب بين الله وبين عبده أعظم من نظره إلى نفسه وأخذه العلم عن فكره ونظره وإن وافق العلم فالأخذ عن الله أشرف وعلم ضرورات العقول من الله لأنها حاصلة لا عن فكر واستدلال ولهذا لا تقبل الضروريات الشبه أصلا ولا الشكوك إذا كان الإنسان عاقلا فإن حيل بينه وبين عقله فما هو الذي قصدنا البيان عنه وبعد أن أعلمناك ببيعة النبات ومرتبته وأنك نبات وأمثالك فلنذكر ما يتضمنه هذا المنزل من العلوم لترتفع الهمة إلى الوقوف عليها والتحلي بها فمن ذلك علم الرحموت وعلم فتوح المكاشفة بالحق وعلم فتوح الحلاوة في الباطن وعلم فتوح العبارات في الترجمة عن الله وعلم نسخ الأحكام بعد النبي صَلَّى اللهُ عَليهِ وسَلَّم عن أمر النبي صَلَّى اللهُ عَليهِ وسَلَّم فإنه المقرر حكم المجتهد لتعارض الأدلة فله الاختيار فيها وعلم العناية الإلهية ببعض العبيد وعلم الإشارات وعلم التمام والكمال وأن التمام للنشأة والكمال بالمرتبة وعلم البيان والتبيين وعلم الاستقامة وما شيب النبي صَلَّى اللهُ عَليهِ وسَلَّم من سورة هود وعلم الكشف على مقامات النص الإلهي هل يؤثر فيه حكم الأكوان أم لا وعلم الطمأنينة والفرق بينها وبين اليقين والعلم وعلم نسبة العالم ملكا لله وعلم من نازعه فيه بما ذا نازعه حتى ذكر الله أن له جنودا من كونه ملكا وما هم أولئك الأجناد وهل تعلم بطريق الإحصاء أو لا تعلم إلا بطريق الإجمال من غير تفصيل وهل وقع لأحد العلم بها على التفصيل أم لا وعلم العلل الإلهية في الكون وعلم الرجوع الإلهي على العباد بم يرجع إليه ولما ذا يرجع وهو القائل وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فهل هو عين ذلك الأمر الراجع أم لا وهو علم شريف وعلم منزلة من يستحق التعظيم الإلهي ممن لا يستحقه وعلم الوفاء بالعقد مع الله فيما يعقده معه مما له الخيار في حله ومذهبنا الوفاء به ولا بد إلا أن يقترن به أمر من شيخ معتبر لتلميذ أو لأحد ممن له فيه اعتقاد التقدم فإن له أن يحل ذلك العقد مع الله المخير فيه ولا بد وإن لم يفعل قوبل فإن لم يقترن به مثل هذا فالوفاء به مذهبنا ومذهب أهل الخصوص وعلم السواء بين النشأتين فلا يظهر الظاهر إلا بصورة الباطن وهو المعبر عنه بالصدق وعلم من طلب الستر عند تجلى الحقيقة حذرا أن تذهب عينه وعلم التبديل وما حضرته وما يقبل التبديل وما لا يقبله مما هو ممكن أن يقبله وعلم الإقبال والتولي هل الإقبال تول أو هو إقبال بلا تول وعلم رفع الحرج من العالم مع وجوده بما ذا يرتفع عند من يرتفع في حقه وعلم الرضاء ومحله وما ثوابه عند الله وعلم ما ينتج التعجيل بالخير وعلم الاقتدار الكوني من الاقتدار الإلهي وعلم تأثير العالم بعضه في بعض هل هو تأثير علة أم لا وعلم التعصب في العالم في أي صنف يظهر وهل يتصف به الملأ الأعلى أم لا وهل له مستند في الأسماء الإلهية المؤثرة في الأعيان للأحوال التي يقام فيها أعيان المكلفين كالعاصي إذا توجه عليه الاسم المنتقم وتوجه عليه الاسم العفو فيتعصب له الاسم التواب والرحيم والغفور والحليم هذا أعني بالمستند الإلهي وعلم ما يظهر على أعيان الممكنات المكلفين هل يظهر بحكم الاستحقاق أو بحكم المشيئة وعلم ما تجتمع فيه الرسل وما تفترق فيه وعلم منازل القرون الثلاثة الآتية على نسق والقرن الرابع وما لها في الزمان من الشهور الأربعة الحرم التي هي ثلاثة سرد وواحد فرد وعلم ما يطلب بالسجود من الله ومراتب السجود والسجود الذي يقبل الرفع منه الساجد من السجود الذي إذا وقع لم يرفع منه وهل خلق العالم ساجدا أو خلق قائما ثم دعي إلى السجود أو خلق بعضه قائما وبعضه ساجدا وتعيين من خلق ساجدا ممن خلق قائما ثم سجدا ولم يسجد وعلم العلامات الإلهية في الأشياء وما يدل منها على سعادة العبد وعلى شقاوته وعلم تفاصيل الوعد الإلهي ولما ذا\n\n\nنفذ بكل وجه ولم ينفذ الوعيد في كل من توعد وكلاهما خبر إلهي فهذا بعض ما يحوي عليه هذا المنزل من العلوم وتركنا منها علوما لم نذكرها طلبا للاختصار والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ ومن هذا المنزل علمنا حين وقفنا عليه سنة إحدى وتسعين وخمسمائة نصر المؤمنين على الكفار قبل وقوعه بمدينة فاس من بلاد المغرب‏\n\n",
    "en": "Chapter 336: On the Knowledge of the Station of the Allegiance of the Vegetable Kingdom to the Pole, the Master of the Time in Every Era, which belongs to the Muhammadan Presence (الحضرة المحمدية).\n\nI swear by Allah, Who swore\nBy Himself, and by my Lord, and by what He swore by,\n\nThat He is the Unique (Witr), without a peer,\nIn His earth and His creation, wherever they may be.\n\nAnd that He descends from His Throne,\nHis descent to His Throne from the Cloud ('Amā'),\n\nWithout modality (takyīf) or separation (furqa),\nFor He is transcendent above both of them.\n\n### [That the General Allegiance is only for the Unique One of the Time]\n\nKnow, may Allah strengthen you, that the general allegiance (المبايعة العامة) is only for the Unique One of the Time (واحد الزمان) specifically. The Unique One of the Time is he who manifests with the Divine Form (الصورة الإلهية) in the cosmos (الأكوان). This is his sign within himself, so that he knows that he is that one. Then he has the choice whether to execute that ruling or not to execute it, and whether to manifest it to others. That is his prerogative. Some of them manifest, and some do not manifest and remain a servant, unless The Real (الحق) commands him to manifest. If he manifests, he does so only to the extent of the Divine Command (الأمر الإلهي) that has occurred, not adding anything to it. This is the lofty station (المقام العالي) relied upon in this Path, because the servant was not created essentially except to be for Allah, remaining perpetually a servant; he was not created to be a Lord. If Allah bestows upon him the robe of mastery (خلعة السيادة) and commands him to appear in it, he appears as a servant in himself, but as a master in the eyes of those who behold him. That is the adornment and the robe bestowed upon him by his Lord.\n\nAbū Yazīd al-Bisṭāmī (may Allah have mercy on him) was asked about people touching him and seeking blessing through him. He replied (may Allah be pleased with him), \"They are not touching me; rather, they are touching the adornment with which my Lord has adorned me. Should I prevent them from that, when it belongs to another (i.e., Allah)?\"\n\nAbū Madyan was asked about people touching him with the intention of seeking blessing, and why he allowed them to do so: \"Do you not find any effect of this in yourself?\" He replied, \"Does the Black Stone (الحجر الأسود) find any effect in itself that removes it from its stoniness when the Messengers, Prophets, and Saints kiss it, despite its being the Hand of Allah?\" He was told, \"No.\" He said, \"I am that Stone.\"\n\nAllah the Exalted said concerning this station: <<إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله>> (Indeed, those who pledge allegiance to you are actually pledging allegiance to Allah). Thus, He negated the act after affirming it formally, just as He did concerning the throwing, affirming it and then negating it: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللهَ رَمَىٰ>> (And you did not throw when you threw, but Allah threw).\n\nThen, in the allegiance, Allah placed His Hand above the hands of those pledging allegiance. Thus, it is part of the etiquette (adab) of the allegiance that when those pledging allegiance take the hand of the one receiving the pledge to kiss it, they place their hands beneath his, making his hand superior to theirs, just as the All-Merciful (الرحمن) takes the charity with His Right Hand from the hand of the giver. Therefore, it is part of the etiquette for the giver of charity to place the charity in his own palm and lower it until the hand of the beggar, when taking it, is above the hand of the giver, so that the beggar's hand is the upper hand, which is better than the lower hand. The upper hand is the one that spends (i.e., receives and uses). The All-Merciful takes it to spend it for him as a trade, so that it grows great, and he finds it on the Day of Resurrection having increased and multiplied. This is the doctrine of the general community (الجماعة).\n\nAs for our doctrine (مذهبنا), which Unveiling (الكشف) has granted us, it is not so. Rather, when the beggar extends his hand to receive the charity from the giver, The Real (الحق) places His Hand upon the hand of the beggar. When the giver offers the charity, it falls into the Hand of the All-Merciful before it falls into the hand of the beggar, as an honor to the giver. He then creates a likeness of it in the hand of the beggar so that the beggar may benefit from it. The Real takes the very essence of that charity and nurtures it until it grows in magnitude to be like Mount Uhud. This stems from Divine Jealousy (الغيرة الإلهية), since the giving was for His sake. This is because He sees that a person gives the gifts he values highly for the sake of his own desire (هواه), but gives the most insignificant thing he possesses for the sake of Allah. This is the prevalent tendency among people. Thus, Allah is jealous for His Majesty, lest He be seen in a position of belittlement. So, He nurtures that charity until it becomes great. When He manifests it in the form of that greatness, the intended purpose is achieved.\n\nTherefore, the hand of the giver is superior to the hand of the receiver. This is why He said it \"falls\" (تقع), and falling only occurs from above. The Prophet (peace and blessings be upon him) said: \"If you were to lower a rope, it would descend upon Allah.\"\n\nThat is, just as He is attributed with highness (al-ʿuluww) in His establishment (al-istawā’) upon the Throne, He is also in the below, just as He is <<بِكُلِّ شَيْءٍ مُحِيطٌ>> (encompassing all things) for preservation, just as the circumference of the circle encompasses existence (الوجود), or the relation of existence to the point from which the relation of encompassing the existence of the surrounding circle appeared. Thus, He has the Above just as He has the Below, and He has the Manifest (الظاهر) just as He has the Hidden (الباطن). He is both the one who pledges allegiance (المبايع) and the one to whom allegiance is pledged (المبايع), for allegiance is only pledged through hearing and obedience (السمع والطاعة). The hearing is none other than Him, and the act of obedience is only for Him. Thus, He is the Hearer, the Doer of what He commanded to be done. Let us now mention the form of the allegiance. We have a separate book on this, which we named *The Allegiance of the Pole* (*Mubāyaʿat al-Quṭb*), containing great knowledge that we do not know of anyone preceding us in, even though the Gnostics (العارفون) among the People of Allah witnessed and knew it. However, they were preoccupied from explaining it to people because it was not as important to them as its manifestation to people is important to us, since this group (the Sufis) is only concerned with what is most important. This is when he (the Pole) does not manifest by the ruling of Divine Power (القوة الإلهية). But if he manifests by it, nothing distracts him from anything else, for he is entirely The Real (الحق). Know this as an elucidation and explanation of the station (منصب) and form of the allegiance.\n\n### [That when Allah appoints a Pole and a Caliph, He sets up a Throne for him in the Presence of Imagination (Ḥaḍrat al-Mithāl) upon which He seats him, the form of that place informing of the form of the station]\n\nKnow that when Allah, the Glorious, appoints one of the overseers of the World (العالم), who is referred to as the Pole (القطب), the Unique One of the Time (واحد الزمان), the Succor (الغوث), and the Caliph (الخليفة), He sets up a throne for him in the Presence of Imagination (حضرة المثال) and seats him upon it. The form of that place informs of the form of the station (المكانة), just as the form of the establishment (الاستواء) upon the Throne informs of the form of His encompassing all things with Knowledge (العلم). When that throne is set up for him, He bestows upon him all the Names (الأسماء) that the World seeks and that seek him. He manifests through them, adorned with robes and ornaments, crowned, braceletted, and armleted, so that the adornment encompasses him high and low, center, manifest, and hidden. When he sits upon it with the Divine Form (الصورة الإلهية), and Allah commands the World to pledge allegiance to him, promising hearing and obedience (السمع والطاعة) in ease and hardship (المنشط والمكره), every commanded being, high and low, enters into his allegiance, except for the Exalted Ones (العالين), who are the Dazed Ones (المهيمون) who worship by the Essence (الذات), not by command (الأمر).\n\nThe first to enter upon him in that assembly are the Highest Assembly (الملأ الأعلى), according to their ranks, first by first. They take his hand, pledging hearing and obedience, and they are not restricted by ease or hardship, because they do not recognize these two qualities in themselves, since neither is known except by tasting its opposite. Thus, they are in a state of ease (منشط) whose flavor they do not know, because they have not tasted hardship (المكره). There is no spirit (روح) that enters upon him to pledge allegiance except that he questions it on a matter of Divine Knowledge (العلم الإلهي). He says to it, \"O so-and-so, are you the one who said such-and-such?\" It replies, \"Yes.\" Then he presents a facet of the issue related to the Knowledge of Allah (العلم بالله) that is higher than what that person possessed. Thus, everyone who pledges allegiance benefits from him. Then he departs from him. This is the affair of the Pole. In the book I composed about him, I mentioned the questions he posed to those who pledged allegiance to him, which occurred in our time to the Pole of our time. These are not specific questions that are repeated by every Pole; rather, every Pole asks about what Allah inspires at that moment concerning what has transpired with the spirits that pledged allegiance to him, which contains discourse.\n\nThe first to pledge allegiance to him is the First Intellect (العقل الأول), then the Soul (النفس), then the foremost workers of the heavens and the earth among the subjugated angels (الملائكة المسخرة), then the spirits governing the bodies (الأرواح المدبرة للهياكل) that have departed their physical forms through death, then the Jinn, and then the generated things (المولدات). This is because everything that glorifies Allah—whether place, inhabitant, locus, or state within it—pledges allegiance to him, except for the Exalted Ones among the angels, who are the Dazed Ones (المهيمون), and the Individuals (الأفراد) among humanity who do not fall under the sphere of the Pole and over whom he has no authority. These Individuals are perfect like him, qualified for the Pole-ship (القطبية) that this person attained. However, since the matter requires that there be only one person in the time to undertake this affair, that one is designated, not by priority, but by the precedence of Knowledge (سبق العلم) that he will be the appointed one. Among the Individuals, there may be one who is greater than him in the Knowledge of Allah.\n\nThis station includes the allegiance of the vegetable kingdom (النبات) among the generated things. Into this falls His saying concerning human bodies: <<وَاللهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ فَنَبَتُمْ نَبَاتاً>> (And Allah caused you to grow from the earth, growing a growth). In mentioning their growth (الإنبات), He stated that He caused them to grow, but He did not confirm it with the verbal noun of *anbata* (to cause to grow); rather, He brought another verbal noun (*nabātan*), to make known that they grew when He caused them to grow. Thus, He established a partnership between Himself and them in creation, alerting us that were it not for their readiness (استعداد) for growth, the Names (الأسماء) would not have affected them. Their emergence was therefore from the Names and the readiness. To the Names belongs His saying: <<أَنْبَتَكُمْ مِنَ الْأَرْضِ>> (He caused you to grow from the earth), and to the readiness belongs His saying: <<نَبَاتاً>> (growing a growth), because *nabātan* is the verbal noun of *nabata* (to grow), not the verbal noun of *anbata* (to cause to grow), whose verbal noun is *inbāt* (causing to grow). Look at the wondrous flow of the Quran and the manifestation of Realities (الحقائق) within it, how Allah informs us in His reports about the nature of things, giving every possessor of a right his due. For Divine Power (الاقتدار الإلهي) only takes effect in that which is ready for its effect, and this only occurs in the possibles (الممكنات), since it has no effect in the Necessarily Existent (الواجب الوجود) by Himself, nor in the impossibly existent (المحال الوجود). Glory be to the All-Knowing, the Wise.\n\n### [That the Human is a Tree among the Trees]\n\nKnow that the human being is a tree among the trees. Allah caused him to grow as a tree, not a star, because he stands upon a trunk (ساق). He made him a tree due to the contention (التشاجر) within him, resulting from his creation from opposites (الأضداد), and opposites seek dispute, contention, and conflict. This is why the Highest Assembly (الملأ الأعلى) contend. The origin of his existence in the World is nothing but the ruling of the Divine Names (الأسماء الإلهية) that are opposed in their ruling. This is its Divine basis. Allah the Exalted said concerning Muhammad (peace and blessings be upon him) that he said: <<مَا كَانَ لِي مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَىٰ إِذْ يَخْتَصِمُونَ>> (I had no knowledge of the Highest Assembly when they disputed) until Allah the Exalted informed him. Thus, he knew that Nature (الطبيعة) had an effect on them, just as the elements (الأركان) have an effect on the bodies of the generated things (المولدات).\n\nSince people are trees, He placed governors (ولاة) among them to whom they return when they dispute, so that they may judge between them and the ruling of contention may cease. He appointed for them one manifest Imam (إمام) to whom the affair of all returns for the establishment of the Religion. He commanded His servants not to dispute with him. If someone manifests against him and disputes with him, Allah commands us to fight him, knowing that his dispute leads to corruption in the Religion that Allah commanded us to establish. The origin of this is His saying: <<لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللهُ لَفَسَدَتَا>> (Had there been in them [heaven and earth] gods besides Allah, they would have been ruined). From this, the necessity of appointing an Imam arose, and that he must be one in the time, manifesting with the sword.\n\nThe Pole of the Time (قطب الوقت) may sometimes be the Imam himself, like Abū Bakr and others in their time. Or the Pole of the Time may not be the Imam, and the Caliphate (الخلافة) belongs to the Pole of the Time who only manifests with the attribute of Justice (العدل). This manifest Caliph (الخليفة الظاهر) may be one of the deputies of the Pole in the Hidden (الباطن), without realizing it. Injustice (الجور) and justice occur among the manifest Imams, but the Pole is only just.\n\nThe reason for some Poles manifesting at one time and others remaining hidden at another is that Allah does not compel anyone to be in the station of the Caliphate. Rather, Allah grants him the qualification (الأهلية) for that station and offers him the manifestation in it with the sword, according to what He commands him. Whoever accepts it manifests with the sword and becomes a Caliph, manifest and hidden, and there is no other. If he chooses not to manifest for a benefit he perceives, Allah conceals him and establishes a deputy (نائب) for him in the World, who is called a Caliph, who may be unjust or just. He may be just to the extent that Allah the Glorious grants him success. Even if his rule is unjust, the ruling concerning him is the same as the just Imam: whoever disputes with him is killed, and no one is killed except the disputant. Allah commanded us not to withdraw our hand from obedience to him, and informed us that whoever among them is just, it is for them (the people), and whoever among them is unjust, it is against them (the people), and for us.\n\nSince the human being is a tree, as we mentioned, Allah forbade the first human from approaching a specific tree designated for him, excluding all other trees, just as the human is a specific tree designated for the Caliphate (الخلافة) excluding all other trees. He warned him not to approach this specific tree concerning himself. This appeared in His counsel to David: <<وَلَا تَتَّبِعِ الْهَوَىٰ>> (And do not follow the desire), meaning his own desire (هوى نفسه). This desire is the tree that Adam was forbidden to approach—that is, do not approach the place of conflict and dispute, lest the nature of your elemental physical body affect you. He says this to his own rational, governing soul (النفس الناطقة المدبرة), for it is through it that he disobeys the command of Allah concerning what He commanded or forbade. His saying \"this tree\" (هذه الشجرة) with the demonstrative particle is a designation of a specific tree.\n\nSince the Imamate (الإمامة) is an offer (عرض), just as the Trust (الأمانة) was an offer, and the Imamate is a Trust, some Poles manifested through it and some did not. The Real looks upon this Pole with the eye of qualification (الأهلية). If Allah were to look upon the manifest Imam with this same eye, no Imam would ever be unjust, as the Imamiyya (Shi'a) believe concerning the infallible Imam (الإمام المعصوم). For it is a condition of the Hidden Imam (الإمام الباطن) that he be infallible, but the manifest Imam, if he is someone else, does not necessarily possess the station of infallibility (العصمة). It is here that the Imamiyya erred. If the Imamate were not sought by him, and Allah commanded him to undertake it, Allah would certainly render him infallible, in our view.\n\nThe Messenger of Allah (peace and blessings be upon him) drew attention to everything we have established. He drew attention to the offer by his action, where he did not compel anyone to accept governorship, but rather mentioned that whoever abandons it, it is better for him, and that on the Day of Resurrection it will be regret and remorse, except for him who undertook it with the form of justice. He drew attention to the infallibility of the one commanded to undertake it by his saying: \"Whoever is given it due to his request is entrusted to it, and whoever receives it without requesting it, Allah appoints an angel to guide him.\" This is the meaning of infallibility (العصمة). The request (السؤال) here is an indication of satisfaction with it and love for this station, so he is requesting it inwardly. Others who dislike it are compelled to accept it by the people of binding and loosing (أهل الحل والعقد), and he sees that he is obliged to enter into it and assume it, because he perceives that his failure to do so would lead to the manifestation of corruption. This then takes the place of Divine Compulsion (الجبر الإلهي) by command to assume it, so he is rendered infallible and becomes just, since the angel who guides him only commands him to good, even the two horns (القرنين). As the Prophet (peace and blessings be upon him) said, Allah helped him, so he submitted (أسلم), and he said, \"He only commands me to good.\"\n\nThe allegiance of the vegetable kingdom (مبايعة النبات) to this Pole is that his own soul (نفسه) pledges allegiance to him not to oppose him in ease or hardship concerning what he commands it of obedience to Allah in His rulings. For Allah has placed the reins of every soul in the hand of its owner, and its affair is referred to him. He said: <<وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ>> (But as for him who feared the station of his Lord and restrained the soul from [following] desire), meaning his own soul. Likewise, concerning David: <<وَلَا تَتَّبِعِ الْهَوَىٰ>> (And do not follow the desire), meaning his own soul. For if it were the desire of another, he would have been forbidden to follow it, yet he followed it. He only follows it by his own desire, so he obeyed his soul in that. Therefore, it is designated that by \"desire\" He meant his own soul and nothing else, which is that it commands him to disobey what Allah commanded him to do or forbade him from. When his soul pledges allegiance to him, the ruling of its treeness (شجريتها) is diverted to contending with whoever disputes the command of Allah. Thus, the ruling of its reality remains in those who oppose the command of Allah, for Allah knows that the reality of conflict (الخلاف) does not cease, since it is a tree by its very essence. If it were to cease, its essence would cease. For this reason, Allah designated a specific outlet for it, in which its felicity lies.\n\nEveryone among the people who recognizes the Pole is obliged to pledge allegiance to him. If he pledges allegiance to him, his allegiance becomes binding, and this is part of the allegiance of the vegetable kingdom (مبايعة النبات), for it is a manifest allegiance to this Pole to control his outward affairs as he wills, and upon the other is the commitment to obey him. A similar principle has appeared in the manifest Law (الشرع الظاهر): if two disputing parties agree on a judgment between them concerning their dispute, and a ruling is issued between them, they are obliged to abide by that ruling and not oppose what was judged. The Pole appointed by The Real (الحق) is more entitled to rule over those who recognize his Imamate in the Hidden. Due to this control that we mentioned he exercises over the outward affairs of those who pledge allegiance to him, we have attached this allegiance to the allegiance of the vegetable kingdom. Indeed, if you verify the matter and follow the origin, you will find the vegetativeness (النباتية) in the particular rational soul (النفس الجزئية الناطقة), because it only manifested from this perfected, balanced body, and according to the form of its temperament (مزاجه). Thus, the body is its earth from which it grew when Allah caused it to grow by breathing His Spirit into this body. The same applies to every spirit governing an elemental body.\n\nFortunate is he who recognizes the Imam of his time, pledges allegiance to him, and grants him authority over himself, his family, and his wealth, just as the Prophet (peace and blessings be upon him) said concerning himself: \"The faith of a servant is not complete until I am dearer to him than his family, his wealth, and all people.\" For this reason, ease and hardship (المنشط والمكره) are stipulated in the allegiance, because a person is only at ease when Allah agrees with his own desire (هوى نفسه), and hardship occurs when the command of Allah opposes his own desire, so he undertakes it reluctantly, due to his fairness and fulfillment of the ruling of the allegiance. For he has pledged allegiance only to Allah, since <<يَدُ اللهِ فَوْقَ أَيْدِيهِمْ>> (The Hand of Allah is over their hands), and they witnessed with their eyes only the hand of the person to whom they pledged allegiance.\n\nThe soul is always, for the most part, under the ruling of its temperament (مزاجه). Few are the people who rule their soul over their nature and temperament. For motherhood belongs to the perfected body, and prophethood belongs to the soul. The human being is commanded to be kind to his parents, honor them, and comply with their commands, unless one of the parents commands him to disobey the command of The Real, in which case he must not obey them, as Allah the Exalted said: <<وَإِن جَاهَدَاكَ عَلَىٰ أَن تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ>> (But if they strive to make you associate with Me that of which you have no knowledge, do not obey them, but accompany them in [this] world with kindness and follow the way of him who turns back to Me). Thus, He commanded the following of those who turn back to Allah, and the opposition of their own souls if they refuse that. Therefore, the right of the Imam is more deserving of being followed.\n\nAllah the Exalted said: <<يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ>> (O you who have believed, obey Allah and obey the Messenger and those in authority among you). These are the Poles, the Caliphs, and the governors. Their authority remains only in the category of what you are permitted to dispose of, for the obligatory (الواجب) and the forbidden (المحظور) belong to the obedience of Allah and His Messenger. Thus, nothing remains for the Imams except the permissible (المباح), in which there is neither reward nor sin. If the Imam placed over you, to whom you have pledged hearing and obedience, commands you to do something permissible, your obedience to him in that becomes obligatory (واجبة), and opposing him becomes forbidden. The ruling of that which was permissible thus becomes obligatory. Consequently, when a person acts upon his command, he receives the reward of the obligatory, and the ruling of permissibility is lifted from it by the command of the one to whom he pledged allegiance. Reflect upon what we have mentioned and what we have drawn attention to concerning the Imam's command regarding the permissible, and know the station of the allegiance, what it yields, what effect it has, and how it abrogates the ruling of permissibility with obligation by the command of The Real for that. Thus, the Imam descends to the rank of the Lawgiver (الشارع) by the command of the Lawgiver, and the ruling concerning the subject changes from what it was in the Law before the command of this Imam. Whoever The Real places in His station of ruling, his following becomes mandatory.\n\n### [That the Vegetable Kingdom is an Intermediate World between the Mineral and the Animal]\n\nKnow that the vegetable kingdom (النبات) is an intermediate world (عالم وسط) between the mineral and the animal; thus, it has the ruling of the Isthmuses (البرازخ). It has two faces, and it imparts knowledge of its own essence to whoever is unveiled (كوشف) to the reality of the faces within it. For perfection is more manifest in the Isthmuses than in non-Isthmuses, because the Isthmus gives you knowledge of itself and of others, while the non-Isthmus gives you knowledge only of itself. This is because the Isthmus (Barzakh) is a mirror for both sides. Whoever perceives it perceives both sides necessarily. In the vegetable kingdom, there is an isthmus-secret (سر برزخي) that is not found elsewhere, for it is an Isthmus between itself, from His saying *nabātan* (growing a growth), and its Lord, from His saying *anbatakum* (He caused you to grow).\n\nThe fair and just person is he who judges between his soul and his Lord. He is not a judge unless his soul contends with its Lord, and he judges against it in favor of his Lord, knowing that The Real (الحق) is in Allah’s Hand in every aspect and under all circumstances. The reason for its contention is its being upon the Form (الصورة), so in it is the opposition of likes (مضادة الأمثال), not the opposition of opposites (مضادة الأضداد). Thus, the human being enters as a judge between his Lord and his soul. Do you not see that he is commanded to restrain it from its desire (هواها)? Thus, he places it in the position of a stranger, yet it is none other than his very essence, and it is the one that made the claim; thus, it is both the judge and the opponent. If the matter were restricted below the soul to the growing body and the non-growing body, there would be no contention, for it is naturally disposed to glorify Allah with His praise.\n\nThe human body is like the star (نجم) of the vegetable kingdom; it does not stand upon a trunk (ساق). It only becomes a tree by the existence of the Spirit (الروح) breathed into it, at which point it stands upon a trunk. This is unlike all other trees, which stand upon a trunk without the breathing of the animal spirit into them. Thus, the human body is essentially a star and becomes a tree through the breathing. Its prostration (سجود) to Allah is the prostration of shadows (الظلال), while the prostration of the tree to Allah is the prostration of persons standing upon a trunk.\n\nSince the vegetable kingdom is an Isthmus (برزخيا), it is a mirror capable of receiving the forms of that for which it is an Isthmus, namely the animal and the mineral. When it pledges allegiance, it pledges allegiance for the forms that appear in it, for which it is an Isthmus, following him. Thus, the allegiance of the vegetable kingdom includes the allegiance of the animal and the mineral kingdoms, because this Imam witnesses the forms that appear in the mirror of the Isthmuses (البرازخ). This is a wondrous knowledge, just as the observer in the sensory mirror sees forms other than his own, which the mirror receives from the forms of other persons, and he perceives in it what those persons are in themselves, even though they are hidden from him in their essences (أعيانها). He only sees a form for them in this polished body. If that form imparts knowledge to him beyond merely looking at it, that impartation is equivalent to the hearing and obedience (السمع والطاعة) that the one pledging allegiance gives to the one to whom he pledges allegiance. If it does not impart knowledge, that is not attributed to the form, but rather to the observer, and he is neither an Imam nor a Caliph, nor does he have any allegiance whatsoever.\n\nBy this, the Imam distinguishes himself from others and knows that he is the Imam. If this observer acquires knowledge from that form by means of reflection (التفكر) and consideration, and he imagines that he is the Imam of his time, this is not the case, unless the forms impart the knowledge to him from their own essence, as an Unveiling (كشف), without reflection or consideration. Even if the person of reflection happens to equal the Imam in that unveiled knowledge, he is not the Imam, due to the difference in the path. For the Imam does not acquire knowledge from his reflection; indeed, if he were to resort to his own consideration, he would err, for his soul is accustomed only to receiving from Allah. Allah, out of His care for this servant, did not wish to grant him acquisition through the path of his reflection, lest that veil him from his Lord. For in every state, The Real desires that he receive from Him what he is involved in concerning affairs at every moment. Thus, he has no leisure and no consideration for anything other than Him.\n\nFor the rational person, if he seeks insight, there is a precedent that indicates the soundness of what we have mentioned: The Prophet (peace and blessings be upon him) forbade the pollination of the date palms, and they failed, because it was not based on Divine Revelation (وحي إلهي). And his descent at the Battle of Badr to a place without water, whereupon he reverted to the counsel of his Companions. For the Prophet (peace and blessings be upon him) was not accustomed to acquiring knowledge except from Allah, having no consideration for himself in that, and he is the Most Perfect Human (الشخص الأكمل), than whom there is none more perfect. What then do you think of one who is lesser than him? The Gnostics (العارفون بالله) have no connection remaining between reflection and themselves as a means of benefit. A person is not called Divine (إلهيا) unless his acquisition of knowledge is only from Allah, through the openings of Unveiling by The Real (فتوح المكاشفة بالحق).\n\nAbū Yazīd al-Bisṭāmī said: \"You took your knowledge from a dead person about a dead person: 'So-and-so narrated to us,' and where is he? He said, 'He died, from so-and-so,' and where is he? He said, 'He died.'\" Abū Yazīd said: \"And we took our knowledge from the Living Who never dies.\" There is no veil between Allah and His servant greater than his looking at himself and acquiring knowledge from his reflection and consideration. Even if it agrees with the knowledge, receiving from Allah is more noble. The knowledge of the necessities of the intellect (ضرورات العقول) is from Allah, because they are acquired without reflection or inference. For this reason, necessary truths do not accept ambiguities or doubts at all, provided the person is rational. If he is prevented from his intellect, then that is not what we intended to explain.\n\nAfter we have informed you about the allegiance of the vegetable kingdom and its rank, and that you and your likes are plants, let us mention the sciences contained in this station, so that aspiration may be raised to understand them and be adorned by them. Among these are: The Science of Mercy (علم الرحموت); The Science of the Openings of Unveiling by The Real (علم فتوح المكاشفة بالحق); The Science of the Openings of Sweetness in the Hidden (علم فتوح الحلاوة في الباطن); The Science of the Openings of Expressions in Translating for Allah (علم فتوح العبارات في الترجمة عن الله); The Science of the Abrogation of Rulings after the Prophet (peace and blessings be upon him) by the command of the Prophet (peace and blessings be upon him)—for he is the one who confirms the ruling of the independent jurist (المجتهد) when evidences conflict, so he has the choice in them; The Science of Divine Providence (علم العناية الإلهية) concerning certain servants; The Science of Signs (علم الإشارات); The Science of Completion (التمام) and Perfection (الكمال), and that completion belongs to the origination (النشأة) and perfection belongs to the rank (المرتبة); The Science of Elucidation and Clarification (علم البيان والتبيين); The Science of Uprightness (علم الاستقامة) and what caused the Prophet (peace and blessings be upon him) to turn gray in Sūrat Hūd; The Science of Unveiling concerning the stations of the Divine Text (النص الإلهي)—whether the ruling of the cosmos (الأكوان) affects it or not; The Science of Tranquility (علم الطمأنينة) and the difference between it and Certainty (اليقين) and Knowledge (العلم); The Science of the World’s relation as property (ملكًا) to Allah; The Science of who disputes Him in it, and with what he disputes, such that Allah mentioned that He has armies (جنودًا) by virtue of His being the Owner—and who those armies are, and whether they are known by way of enumeration or only by way of generalization without detail, and whether anyone has attained detailed knowledge of them or not; The Science of Divine Causes (العلل الإلهية) in the cosmos; The Science of the Divine Return (الرجوع الإلهي) upon the servants—with what He returns to them and why He returns, He being the One Who said: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him is returned the whole affair)—and whether He is the very essence of that returning affair or not, which is a noble science; The Science of the station of those who deserve Divine Magnification (التعظيم الإلهي) from those who do not deserve it; The Science of fulfilling the covenant (الوفاء بالعقد) with Allah concerning what one contracts with Him, in which one has the choice to dissolve it—our doctrine is that fulfillment is mandatory, unless it is accompanied by a command from a recognized Shaykh to a disciple or to someone who believes in his precedence, in which case he is obliged to dissolve that optional covenant with Allah, and if he does not, he will be met with consequences. If it is not accompanied by such a command, then fulfillment is our doctrine and the doctrine of the People of Distinction (أهل الخصوص); The Science of Equality between the two originations (النشأتين), so that the Manifest (الظاهر) only appears in the form of the Hidden (الباطن), which is expressed as Truthfulness (الصدق); The Science of him who seeks concealment when the Reality (الحقيقة) discloses itself, fearing that his essence (عينه) might vanish; The Science of Substitution (التبديل), its Presence (حضرة), what accepts substitution, and what does not accept it among the possibilities that could accept it; The Science of Turning Towards (الإقبال) and Turning Away (التولي)—is turning towards a turning away, or is it turning towards without turning away; The Science of the Removal of Constraint (رفع الحرج) from the World despite its existence—by what is it removed for those for whom it is removed; The Science of Satisfaction (الرضاء), its locus, and its reward with Allah; The Science of what results from hastening to do good; The Science of Cosmic Power (الاقتدار الكوني) derived from Divine Power (الاقتدار الإلهي); The Science of the World’s influence upon itself—is it the influence of a cause or not; The Science of Partisanship (التعصب) in the World—in which category does it appear, and are the Highest Assembly (الملأ الأعلى) characterized by it or not, and does it have a basis in the Divine Names (الأسماء الإلهية) that affect the essences (الأعيان) according to the states in which the essences of the morally responsible (المكلفين) are established, such as the disobedient person upon whom the Name the Avenger (المنتقم) is directed, and upon whom the Name the Pardoner (العفو) is directed, so that the Names the Acceptor of Repentance (التواب), the Merciful (الرحيم), the Forgiving (الغفور), and the Clement (الحليم) become partisan for him—this is what I mean by the Divine Basis (المستند الإلهي); The Science of what manifests upon the essences of the morally responsible possibles—does it manifest by the ruling of desert (الاستحقاق) or by the ruling of the Will (المشيئة); The Science of what the Messengers agree upon and what they differ upon; The Science of the stations of the three successive generations and the fourth generation, and their relation in time to the four Sacred Months (الشهور الأربعة الحرم), which are three consecutive and one solitary; The Science of what is sought from Allah through prostration (السجود), the ranks of prostration, and the prostration from which the prostrator is permitted to rise, as distinct from the prostration from which, once performed, he does not rise; And whether the World was created prostrating or created standing and then called to prostration, or whether some of it was created standing and some prostrating, and the designation of who was created prostrating from those who were created standing and then prostrated, and those who did not prostrate; The Science of the Divine Signs (العلامات الإلهية) in things, and what among them indicates the servant’s felicity and his wretchedness; The Science of the details of the Divine Promise (الوعد الإلهي), and why the Promise was executed in every aspect, while the Threat (الوعيد) was not executed against everyone who was threatened, even though both are Divine reports.\n\nThis is some of what this station contains of sciences. We have omitted some sciences seeking brevity. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way). It was from this station that we learned, when we stood upon it in the year 591 AH, of the victory of the believers over the disbelievers before it occurred, in the city of Fez in the lands of the Maghrib.",
    "ur": "باب نمبر تین سو چھتیس: ہر زمانے میں قطب (القطب) صاحب الوقت کی بیعتِ نبات (مبايعة النبات) کے مقام کی معرفت میں، اور یہ مقام الحضرة المحمدية (الحضرة المحمدية) سے ہے۔\n\nمیں نے اس اللہ کی قسم کھائی جس نے قسم کھائی *** اپنی ذات کی، اور ہاں میرے رب کی، اور اس کی جو\n\nکہ وہ اپنی زمین اور اپنی مخلوق میں ہر جگہ *** اکیلا ہے، اس کا کوئی اکیلا کرنے والا نہیں\n\nاور بے شک وہ اپنے عرش سے نازل ہوتا ہے *** اس کا نزول اس کے عرش کے لیے غیب (عما) سے ہے\n\nبغیر کسی کیفیت کے اور بغیر کسی جدائی کے *** کیونکہ وہ ان دونوں سے پاک ہے۔\n\n[یہ کہ عام بیعت (المبايعة) صرف واحد الزمان (واحد الزمان) کے لیے خاص ہوتی ہے]\n\nاللہ آپ کی مدد فرمائے، جان لیجیے کہ عام بیعت (المبايعة) صرف واحد الزمان (واحد الزمان) کے لیے خاص ہوتی ہے۔ اور واحد الزمان (واحد الزمان) وہ ہے جو اکوان (الأكوان) میں صورتِ الٰہیہ کے ساتھ ظاہر ہوتا ہے۔ یہ اس کی اپنی ذات میں اس کی علامت ہے تاکہ وہ جان لے کہ وہ یہی ہے۔ پھر اسے اختیار ہوتا ہے کہ وہ اس حکم کو نافذ کرے یا غیر کے سامنے اس کے ساتھ ظاہر نہ ہو۔ یہ اس کے لیے ہے۔ پس ان میں سے کچھ ظاہر ہوتے ہیں اور کچھ ظاہر نہیں ہوتے اور بندہ ہی رہتے ہیں، مگر یہ کہ الحق (الحق) اسے ظہور کا حکم دے، تو وہ اسی قدر ظاہر ہوتا ہے جس قدر امرِ الٰہی واقع ہوا ہو، اس سے ذرہ برابر بھی زیادہ نہیں کرتا۔ یہ وہ بلند مقام ہے جس پر اس طریق میں اعتماد کیا جاتا ہے، کیونکہ بندے کو اصالتاً صرف اس لیے پیدا کیا گیا ہے کہ وہ اللہ کے لیے ہو، پس وہ ہمیشہ بندہ ہی رہے، اسے رب بننے کے لیے پیدا نہیں کیا گیا۔ پس جب اللہ اس پر سیادت کی خلعت ڈالتا ہے اور اسے اس میں ظاہر ہونے کا حکم دیتا ہے، تو وہ اپنی ذات میں بندہ ہوتا ہے اور دیکھنے والے کے نزدیک سید ہوتا ہے۔ یہ اس کے رب کی زینت اور اس کی خلعت ہے۔\n\nابو یزید بسطامی رحمۃ اللہ علیہ سے لوگوں کے ان سے مس ہونے اور برکت حاصل کرنے کے بارے میں پوچھا گیا، تو انہوں نے فرمایا: \"لوگ مجھ سے مس نہیں ہوتے، بلکہ وہ اس زیور سے مس ہوتے ہیں جو میرے رب نے مجھے پہنایا ہے۔ کیا میں انہیں اس سے منع کروں؟ حالانکہ یہ کسی اور کے لیے ہے؟\" اور ابو مدین سے لوگوں کے برکت کی نیت سے ان سے مس ہونے اور انہیں ایسا کرنے دینے کے بارے میں پوچھا گیا، \"کیا آپ اپنے نفس میں اس کا کوئی اثر نہیں پاتے؟\" تو انہوں نے فرمایا: \"کیا حجر اسود اپنی ذات میں کوئی اثر پاتا ہے جو اسے اس کی پتھریلی حالت سے نکال دے، جب رسول، انبیاء اور اولیاء اسے بوسہ دیتے ہیں اور وہ اللہ کا دایاں ہاتھ ہے؟\" کہا گیا: \"نہیں۔\" انہوں نے فرمایا: \"میں وہی پتھر ہوں۔\"\n\nاللہ تعالیٰ نے اس مقام میں فرمایا:\n**إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله** (بے شک جو لوگ آپ سے بیعت کرتے ہیں، وہ درحقیقت اللہ سے بیعت کرتے ہیں)۔\nپس اس نے اسے صورت کے طور پر ثابت کرنے کے بعد اس کی نفی کر دی، جیسا کہ اس نے تیر اندازی کے معاملے میں کیا، اسے ثابت بھی کیا اور نفی بھی کی:\n**وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏** (اور جب آپ نے پھینکا تو آپ نے نہیں پھینکا، بلکہ اللہ نے پھینکا)۔\nپھر اللہ نے بیعت میں اپنا ہاتھ بیعت کرنے والوں کے ہاتھوں کے اوپر رکھا۔ پس بیعت کا ادب یہ ہے کہ جب بیعت کرنے والے بیعت کے لیے بیعت لینے والے کا ہاتھ پکڑیں تاکہ اسے چومیں، تو وہ اپنے ہاتھ اس کے ہاتھ کے نیچے رکھیں اور اس کے ہاتھ کو اپنے ہاتھوں کے اوپر رکھیں، جیسا کہ رحمن صدقہ دینے والے کے ہاتھ سے صدقہ اپنے دائیں ہاتھ سے لیتا ہے۔ پس صدقہ دینے والے کا ادب یہ ہے کہ وہ صدقہ اپنی ہتھیلی میں رکھے اور اسے نیچے کرے یہاں تک کہ جب سائل اسے لے تو اس کا ہاتھ دینے والے کے ہاتھ پر بلند ہو جائے، تاکہ وہی ہاتھ بالا ہو اور وہ نچلے ہاتھ سے بہتر ہے۔ اور بالا ہاتھ خرچ کرنے والا ہوتا ہے۔ پس رحمن اسے لیتا ہے تاکہ اسے اس کے لیے تجارت کے طور پر خرچ کرے یہاں تک کہ وہ عظیم ہو جائے، اور وہ اسے قیامت کے دن دیکھے گا کہ وہ بڑھ چکا ہے اور زیادہ ہو گیا ہے۔ یہ جماعت کا مسلک ہے۔\n\nلیکن ہمارا مسلک، جو ہمیں الکشف (الکشف) نے عطا کیا ہے، وہ ایسا نہیں ہے۔ بلکہ جب سائل صدقہ دینے والے سے صدقہ قبول کرنے کے لیے اپنا ہاتھ پھیلاتا ہے، تو الحق (الحق) اپنا ہاتھ سائل کے ہاتھ پر رکھ دیتا ہے۔ پس جب صدقہ دینے والا صدقہ دیتا ہے، تو وہ سائل کے ہاتھ میں پڑنے سے پہلے رحمن کے ہاتھ میں پڑتا ہے، یہ صدقہ دینے والے کی کرامت ہے۔ اور سائل کے ہاتھ میں اس جیسا ایک اور پیدا کر دیا جاتا ہے تاکہ سائل اس سے فائدہ اٹھائے۔ اور الحق (الحق) عین اسی صدقے کو لے لیتا ہے اور اسے بڑھاتا ہے، یہاں تک کہ وہ بڑھ کر عظمت میں کوہ احد جیسا ہو جاتا ہے۔ یہ غیرتِ الٰہیہ کے باب سے ہے، جب وہ دیکھتا ہے کہ انسان اپنی خواہش کی خاطر وہ چیزیں دیتا ہے جن کی شان عظیم ہوتی ہے، اور اللہ کی خاطر اپنے پاس کی حقیر ترین چیز دیتا ہے۔ لوگوں میں یہی غالب ہے۔ پس اللہ اپنے جلال کی خاطر غیرت کرتا ہے کہ وہ مقامِ استہضام (حقارت) میں نہ دیکھا جائے، پس وہ اس صدقے کو بڑھاتا ہے یہاں تک کہ وہ عظیم ہو جاتا ہے۔ پس جب وہ اسے اس عظمت کی صورت میں ظاہر کرتا ہے تو مقصود حاصل ہو جاتا ہے۔ اور دینے والے کا ہاتھ لینے والے کے ہاتھ پر بلند ہوتا ہے۔ اسی لیے آپ صلی اللہ علیہ وسلم نے فرمایا:\n**لو دليتم بحبل لهبط على الله‏** (اگر تم ایک رسی لٹکاؤ تو وہ اللہ پر گرے گی)۔\nیعنی جیسا کہ اس کی نسبت عرش پر استواء کے ذریعے بلندی کی طرف کی جاتی ہے، وہ نیچے بھی ہے، جیسا کہ وہ **بِكُلِّ شَيْ‏ءٍ مُحِيطٌ** (ہر چیز کو گھیرے ہوئے ہے) حفاظت کے لیے، جیسا کہ دائرے کا محیط وجود کی حفاظت کرتا ہے، یا نقطے پر وجود کی نسبت جس سے وہ ظاہر ہوا، محیط دائرے کے وجود کے لیے احاطے کی نسبت ہے۔ پس اس کے لیے بلندی ہے جیسا کہ اس کے لیے پستی ہے، اور اس کے لیے ظاہر ہے جیسا کہ اس کے لیے باطن ہے۔ پس وہی بیعت کرنے والا (المبايع) ہے اور وہی جس سے بیعت کی جاتی ہے (المبايع)، کیونکہ بیعت صرف سمع و طاعت کے ساتھ کی جاتی ہے، اور سمع صرف وہی ہے، اور طاعت کا عمل صرف اسی کے لیے ہوتا ہے۔ پس وہی سننے والا ہے اور وہی عمل کرنے والا ہے جس کا اس نے حکم دیا۔\n\nپس ہم بیعت کی صورت کا ذکر کرتے ہیں، اور اس بارے میں ہماری ایک مستقل کتاب ہے جسے ہم نے \"مبايعة القطب\" (قطب کی بیعت) کا نام دیا ہے، جس میں ایک بڑا علم شامل ہے جس کے بارے میں ہم نہیں جانتے کہ ہم سے پہلے کسی نے اس کا ذکر کیا ہو، اگرچہ اہل اللہ کے عارفین نے اسے دیکھا اور جانا ہے، لیکن لوگوں کے لیے اسے بیان کرنے سے انہیں اس چیز نے مشغول رکھا جو ان کے نزدیک اہم نہیں تھی، جیسا کہ لوگوں کے لیے اس کا اظہار ہمارے نزدیک اہم تھا۔ کیونکہ اس گروہ کا کام صرف اہم ترین چیزوں سے ہوتا ہے۔ یہ اس وقت ہے جب وہ قوتِ الٰہیہ کے حکم سے ظاہر نہ ہو۔ لیکن جب وہ اس کے ساتھ ظاہر ہوتا ہے تو کوئی چیز اسے کسی چیز سے مشغول نہیں کرتی، کیونکہ وہ سب کا سب حق (الحق) ہے۔ پس بیعت کے منصب اور اس کی صورت کی وضاحت اور بیان کے لیے یہ جان لو۔\n\n[بے شک جب اللہ کسی قطب (القطب) اور خلیفہ کو والی بناتا ہے تو وہ اس کے لیے حضرة المثال میں ایک تخت نصب کرتا ہے جس پر اسے بٹھاتا ہے، اس جگہ کی صورت اس کے مقام کی صورت کی خبر دیتی ہے]\n\nپس جان لو کہ اللہ سبحانہ و تعالیٰ جب عالم میں اپنے والیانِ نظر میں سے کسی کو والی بناتا ہے، جسے قطب (القطب)، واحد الزمان (واحد الزمان)، غوث اور خلیفہ سے تعبیر کیا جاتا ہے، تو وہ اس کے لیے حضرة المثال میں ایک تخت نصب کرتا ہے جس پر اسے بٹھاتا ہے۔ اس جگہ کی صورت اس کے مقام کی صورت کی خبر دیتی ہے، جیسا کہ عرش پر استواء کی صورت نے اس کے ہر چیز کو علم کے ذریعے گھیرنے کی صورت کی خبر دی۔ پس جب اس کے لیے وہ تخت نصب کیا جاتا ہے، تو وہ اس پر تمام وہ اسماء کی خلعت ڈالتا ہے جن کا عالم طالب ہے اور جو عالم کو مطلوب ہیں، پس وہ ان کے ساتھ حُلّوں اور زینت کے ساتھ ظاہر ہوتا ہے، تاج پہنے ہوئے، کنگن پہنے ہوئے، بازو بند پہنے ہوئے، تاکہ زینت اسے بلندی، پستی، وسط، ظاہر اور باطن ہر طرف سے گھیر لے۔\n\nپس جب وہ صورتِ الٰہیہ کے ساتھ اس پر بیٹھتا ہے اور اللہ عالم کو اس کی بیعت کا حکم دیتا ہے کہ وہ خوشی اور ناخوشی (المنشط والمكره) میں سمع و طاعت کریں، تو ہر مامور، اعلیٰ اور ادنیٰ، اس کی بیعت میں داخل ہو جاتا ہے، سوائے عالین (بلند مرتبہ) کے، اور وہ مہیمون (المهيمون) ہیں جو ذات کے ساتھ عبادت کرنے والے ہیں نہ کہ حکم کے ساتھ۔ پس سب سے پہلے جو اس مجلس میں داخل ہوتے ہیں وہ ملأ اعلیٰ (بلند فرشتے) اپنی اپنی مراتب کے مطابق، اول فالاول، ہوتے ہیں، اور وہ سمع و طاعت پر اس کا ہاتھ پکڑتے ہیں، اور وہ خوشی یا ناخوشی (منشط ولا مكره) کے پابند نہیں ہوتے، کیونکہ وہ ان دونوں صفات کو اپنے اندر نہیں جانتے، کیونکہ ان میں سے کسی چیز کو بھی اس کے ضد کے ذائقے کے بغیر نہیں جانا جاتا۔ پس وہ خوشی میں ہوتے ہیں جس کا وہ کوئی ذائقہ نہیں جانتے، کیونکہ انہوں نے ناخوشی کا ذائقہ نہیں چکھا۔ اور کوئی روح جو بیعت کے لیے اس کے پاس داخل ہوتی ہے، وہ اس سے علمِ الٰہی کے کسی مسئلے میں سوال ضرور کرتی ہے، اور وہ اسے کہتا ہے: \"اے فلاں! کیا تم نے یہ بات نہیں کہی تھی؟\" تو وہ کہتا ہے: \"ہاں۔\" تو وہ اسے اس مسئلے میں ایک ایسا پہلو بتاتا ہے جو اللہ کے علم سے متعلق ہوتا ہے اور اس شخص کے پاس موجود علم سے بلند ہوتا ہے۔ پس ہر وہ شخص جو اس کی بیعت کرتا ہے، اس سے فائدہ اٹھاتا ہے۔ اور تب وہ اس سے باہر نکلتا ہے۔\n\nیہ اس قطب (القطب) کا معاملہ ہے۔ اور جو کتاب میں نے اس بارے میں لکھی ہے، اس میں میں نے ان سوالات کا ذکر کیا ہے جو ہمارے زمانے کے قطبِ وقت سے بیعت کرنے والوں نے کیے تھے۔ کیونکہ یہ کوئی معین مسائل نہیں ہیں جو ہر قطب سے دہرائے جائیں، بلکہ ہر قطب اس چیز کے بارے میں سوال کرتا ہے جو اللہ اس وقت اس کے دل میں ڈالتا ہے، جس میں ان ارواح کے لیے کلام ہوتا ہے جنہوں نے اس کی بیعت کی ہے۔ پس سب سے پہلے اس کی بیعت کرنے والا عقلِ اول (العقل الأول) ہے، پھر نفس، پھر آسمانوں اور زمین کے مسخر فرشتوں میں سے مقدم کارکنان، پھر ان ارواح جو ان ہیکلوں کی تدبیر کرتی ہیں جو موت کے ذریعے اپنے اجسام سے جدا ہو چکی ہیں، پھر جن، پھر مولدات (پیدا شدہ چیزیں)۔ اور یہ اس لیے کہ ہر وہ چیز جو اللہ کی تسبیح کرتی ہے، خواہ وہ جگہ ہو، یا جگہ میں رہنے والا ہو، یا محل ہو، یا حال ہو، وہ اس کی بیعت کرتی ہے، سوائے فرشتوں کے عالین (بلند مرتبہ) کے، اور وہ مہیمون (المهيمون) ہیں، اور انسانوں کے افراد (الأفراد) جو قطب (القطب) کے دائرے میں داخل نہیں ہوتے اور نہ ہی اس کا ان پر کوئی تصرف ہوتا ہے۔ وہ اس کی طرح کامل ہوتے ہیں اور اس مقام کے اہل ہوتے ہیں جو اس شخص کو قطبیت (القطبية) کی صورت میں ملا ہے، لیکن چونکہ امر کا تقاضا یہ نہیں ہے کہ زمانے میں اس کام کو انجام دینے والا ایک سے زیادہ ہو، اس لیے وہ واحد متعین ہو جاتا ہے، اولویت کی بنا پر نہیں، بلکہ اس میں علمِ سابق کی بنا پر کہ وہ والی ہو گا۔ اور افراد میں ایسے بھی ہوتے ہیں جو اللہ کے علم میں اس سے بڑے ہوتے ہیں۔\n\nاور یہ مقام مولدات (پیدا شدہ چیزوں) میں سے نبات (النبات) کی بیعت کو شامل ہے۔ اور اس میں انسانی اجسام کے بارے میں اس کا یہ قول بھی شامل ہے:\n**وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ فَنَبَتُمْ نَبَاتًا** (اور اللہ نے تمہیں زمین سے اگایا، پس تم نبات (نباتاً) کی طرح اگے)۔\nپس ان کے ذکر میں انبات (اگانے) کے ساتھ آیا کہ اس نے انہیں اگایا، اور اس نے اسے مصدر کے ساتھ مؤکد نہیں کیا، اور ایک دوسرا مصدر لایا تاکہ یہ معلوم ہو جائے کہ جب اس نے انہیں اگایا تو وہ اگے۔ پس اس نے تخلیق میں اپنے اور ان کے درمیان اشتراک واقع کیا، یہ تنبیہ کرتے ہوئے کہ اگر ان میں اگنے کا استعداد نہ ہوتا تو اسماء ان میں اثر انداز نہ ہوتے۔ پس ان کا اسماء سے نکلنا اور استعداد سے نکلنا تھا۔ پس اسماء کے لیے اس کا قول ہے: **أَنْبَتَكُمْ مِنَ الْأَرْضِ** (اللہ نے تمہیں زمین سے اگایا)، اور استعداد کے لیے اس کا قول ہے: **نَبَاتًا** (نبات کی طرح)، کیونکہ \"نباتاً\" (نبات) \"نبت\" کا مصدر ہے نہ کہ \"أنبت\" کا۔ کیونکہ \"أنبت\" کا مصدر تو \"إنبات\" (اگانا) ہے۔ پس دیکھو کہ قرآن کا انداز اور اس میں حقائق کا اظہار کتنا عجیب ہے، کہ اللہ ہمیں اپنی خبروں میں سکھاتا ہے کہ اس پر امور کیا ہیں، پس وہ ہر حقدار کو اس کا حق دیتا ہے، کیونکہ اقتدارِ الٰہی صرف اسی میں نافذ ہوتا ہے جو اس میں نفوذ کے لیے استعداد رکھتا ہو، اور یہ صرف ممکنات میں ہوتا ہے، کیونکہ واجب الوجود لذاتہ میں اور محال الوجود میں اس کا نفوذ نہیں ہے۔ پس سبحان العلیم الحکیم (پاک ہے وہ جو جاننے والا، حکمت والا ہے)۔\n\n[بے شک انسان درختوں میں سے ایک درخت ہے]\n\nاور جان لو کہ انسان درختوں میں سے ایک درخت ہے، اللہ نے اسے درخت کی طرح اگایا ہے نہ کہ ستارے کی طرح، کیونکہ وہ ایک ساق پر قائم ہے۔ اور اسے درخت اس تشاجر (جھگڑے) کی وجہ سے بنایا جو اس میں ہے، کیونکہ وہ اضداد سے مخلوق ہے، اور اضداد جھگڑے، تشاجر اور تنازع کا مطالبہ کرتے ہیں۔ اسی لیے ملأ اعلیٰ (بلند فرشتے) بھی جھگڑتے ہیں۔ اور عالم میں اس کے وجود کی اصل صرف متقابل حکم رکھنے والے اسماءِ الٰہیہ کا حکم ہے۔ یہ اس کا الٰہی مستند ہے۔ اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کے حق میں فرمایا کہ آپ نے کہا:\n**مَا كَانَ لِيَ مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَى إِذْ يَخْتَصِمُونَ** (مجھے ملأ اعلیٰ کے جھگڑنے کا کوئی علم نہیں تھا)\nیہاں تک کہ اللہ تعالیٰ نے آپ کو علم دیا، پس آپ نے جانا کہ ان میں طبیعت کا اثر ہے، جیسا کہ مولدات (پیدا شدہ چیزوں) کے اجسام میں ارکان کا اثر ہوتا ہے۔\n\nپس جب لوگ درخت تھے، تو اس نے ان میں والی مقرر کیے جن کی طرف وہ جھگڑنے پر رجوع کریں تاکہ وہ ان کے درمیان فیصلہ کریں، تاکہ تشاجر (جھگڑے) کا حکم زائل ہو جائے۔ اور اس نے ان کے لیے ظاہر میں ایک امام مقرر کیا جس کی طرف سب کا معاملہ رجوع کرتا ہے تاکہ دین قائم ہو، اور اپنے بندوں کو حکم دیا کہ وہ اس سے تنازع نہ کریں۔ اور جو اس پر ظاہر ہوا اور اس سے تنازع کیا، اللہ نے ہمیں اس سے قتال کا حکم دیا، کیونکہ اس نے جانا کہ اس کا تنازع اس دین میں فساد کا باعث بنے گا جسے قائم کرنے کا اللہ نے ہمیں حکم دیا ہے۔ اور اس کی اصل اللہ تعالیٰ کا یہ قول ہے:\n**لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا** (اگر ان دونوں میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں بگڑ جاتیں)۔\nاسی وجہ سے امام کا تقرر ظاہر ہوا اور یہ کہ وہ زمانے میں ایک ہو جو تلوار کے ساتھ ظاہر ہو۔ پس کبھی قطبِ وقت خود امام ہوتا ہے، جیسے ابو بکر اور ان کے زمانے میں دوسرے، اور کبھی قطبِ وقت نہیں ہوتا، تو خلافت قطبِ وقت کے لیے ہوتی ہے۔\n\nجو صرف صفتِ عدل کے ساتھ ظاہر ہوتا ہے۔ اور یہ ظاہر خلیفہ باطن میں قطب (القطب) کے نائبوں میں سے ہوتا ہے، جہاں سے وہ خود بھی بے خبر ہوتا ہے۔ پس ظاہر ائمہ میں جور (ظلم) اور عدل واقع ہوتا ہے، لیکن قطب (القطب) صرف عادل ہی ہوتا ہے۔ اور اس کے کسی وقت ظاہر ہونے اور بعض کا کسی وقت پوشیدہ رہنے کا سبب یہ ہے کہ اللہ نے کسی کو بھی مقامِ خلافت میں ہونے پر مجبور نہیں کیا، بلکہ اللہ نے اسے اس مقام کی اہلیت دی اور اس پر تلوار کے ساتھ ظاہر ہونے کی پیشکش کی، جیسا کہ اس نے اسے حکم دیا۔ پس جس نے اسے قبول کیا، وہ تلوار کے ساتھ ظاہر ہوا، پس وہ ظاہر اور باطن کا خلیفہ تھا، اس کے سوا کوئی دوسرا نہیں تھا۔ اور اگر اس نے کسی مصلحت کی بنا پر جو اس نے دیکھی، ظہور کو ترک کرنے کا انتخاب کیا، تو اللہ اسے پوشیدہ رکھتا ہے اور اس کی طرف سے عالم میں ایک نائب مقرر کرتا ہے جسے خلیفہ کہا جاتا ہے، جو ظلم بھی کرتا ہے اور عدل بھی، اور کبھی وہ عادل ہوتا ہے اس قدر جس کی اللہ سبحانہ و تعالیٰ اسے توفیق دیتا ہے۔ اور اس کا حکم، اگرچہ وہ ظالم ہو، عادل امام کا حکم ہوتا ہے۔ جس نے اس سے تنازع کیا وہ قتل کیا جائے گا، اور صرف وہی قتل کیا جائے گا، کیونکہ وہی تنازع کرنے والا ہے۔ اور اللہ نے ہمیں حکم دیا ہے کہ ہم اس کی اطاعت سے ہاتھ نہ کھینچیں۔ اور ہمیں خبر دی کہ ان میں سے جس نے عدل کیا تو وہ ان کے لیے ہے، اور جس نے ظلم کیا تو وہ ان پر ہے، اور ہمارے لیے بھی ہے۔\n\nاور چونکہ انسان ایک درخت ہے جیسا کہ ہم نے ذکر کیا، اللہ نے پہلے انسان کو ایک درخت کے قریب جانے سے منع کیا جسے اس نے اس کے لیے مخصوص کیا تھا، باقی تمام درختوں کے برعکس، جیسا کہ انسان خلافت کے ساتھ مخصوص ایک درخت ہے، باقی تمام درختوں کے برعکس۔ پس اس نے اسے تنبیہ کی کہ وہ اس مخصوص درخت کے قریب نہ جائے جو اس کی اپنی ذات پر ہے۔ اور یہ بات داؤد علیہ السلام کو اس کی وصیت میں ظاہر ہوئی: **وَلَا تَتَّبِعِ الْهَوَى** (اور خواہش کی پیروی نہ کرو)، یعنی اپنی نفسانی خواہش (ہویٰ نفسہ)، پس وہی وہ درخت ہے جس کے قریب جانے سے آدم کو منع کیا گیا تھا، یعنی تنازع اور اختلاف کی جگہ کے قریب نہ جاؤ، ورنہ تمہاری جسمانی، عنصری نشأت تم پر اثر انداز ہو گی۔ وہ یہ بات اپنے مدبر، ناطق نفس سے کہہ رہا ہے، کیونکہ اسی کے ذریعے وہ اللہ کے حکم کی مخالفت کرتا ہے جو اس نے اسے دیا یا جس سے اسے منع کیا۔ پس اس کا قول \"یہ درخت\" حرفِ اشارہ کے ساتھ ایک مخصوص درخت کا تعین ہے۔\n\nاور چونکہ امامت ایک عرض (عارضی چیز) تھی، جیسا کہ امانت ایک عرض تھی، اور امامت ایک امانت ہے، اسی لیے بعض اقطاب (الأقطاب) اس کے ساتھ ظاہر ہوئے اور بعض ظاہر نہیں ہوئے۔ پس الحق (الحق) نے اس قطب (القطب) کو اہلیت کی نظر سے دیکھا۔ اور اگر اللہ ظاہر امام کو بھی اسی نظر سے دیکھتا تو کوئی امام کبھی ظلم نہ کرتا، جیسا کہ امامیہ (شیعہ) امام معصوم میں دیکھتے ہیں۔ کیونکہ باطنی امام کی شرط یہ ہے کہ وہ معصوم ہو، اور ظاہر امام کے لیے، اگر وہ کوئی اور ہو، مقامِ عصمت نہیں ہوتا۔ اور یہیں سے امامیہ نے غلطی کی۔ اگر امامت اس کے لیے مطلوب نہ ہوتی اور اللہ اسے اس میں کھڑا ہونے کا حکم دیتا، تو بلا شبہ ہمارے نزدیک اللہ اسے معصوم کر دیتا۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم نے ان تمام باتوں پر تنبیہ فرمائی جنہیں ہم نے مقرر کیا ہے۔ پس آپ نے اپنے فعل سے عرض (عارضی ہونے) پر تنبیہ فرمائی، جہاں آپ نے کسی کو بھی ولایت پر مجبور نہیں کیا۔ بلکہ آپ نے ذکر فرمایا کہ جس نے اسے چھوڑ دیا وہ اس کے لیے بہتر تھا، اور یہ کہ قیامت کے دن یہ حسرت اور ندامت ہو گی، سوائے اس کے جس نے اس میں عدل کی صورت کے ساتھ قیام کیا۔\n\nاور آپ نے اس شخص کی عصمت پر تنبیہ فرمائی جسے اس کا حکم دیا گیا:\nآپ کے اس قول سے: **فمن أعطيها عن مسألة وكل إليها ومن جاءته عن غير مسألة وكل الله به ملكا يسدده‏** (پس جسے یہ (ولایت) سوال کرنے پر دی گئی، وہ اسی کے سپرد کر دیا گیا، اور جسے بغیر سوال کے ملی، اللہ نے اس کے ساتھ ایک فرشتہ مقرر کر دیا جو اسے سدھاتا ہے)۔\nاور یہی عصمت کا معنی ہے۔ اور یہاں سوال سے مراد اس پر راضی ہونا اور اس منصب سے محبت رکھنا ہے، پس وہ اپنے باطن سے سوال کرنے والا ہے۔ اور دوسرا وہ ہے جو اسے ناپسند کرتا ہے، لیکن اہل حل و عقد اسے اس پر مجبور کرتے ہیں، اور وہ دیکھتا ہے کہ اس میں داخل ہونا اور اسے اختیار کرنا اس پر متعین ہو گیا ہے، کیونکہ وہ دیکھتا ہے کہ اس سے پیچھے ہٹنا فساد کے ظہور کا سبب بنے گا۔ پس یہ چیز ظاہر میں اس کے لیے امرِ الٰہی کے ذریعے جبر کا مقام لے لیتی ہے کہ وہ اسے اختیار کرے۔ پس وہ معصوم ہو جاتا ہے اور عادل ہوتا ہے، کیونکہ وہ فرشتہ جو اسے سدھاتا ہے، اسے صرف خیر کا حکم دیتا ہے، یہاں تک کہ قرین (ساتھی شیطان) بھی۔\n\nجیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے اس پر میری مدد کی، پس وہ مسلمان ہو گیا (میم کے رفع اور نصب دونوں کے ساتھ)۔ اور فرمایا: \"پس وہ مجھے صرف خیر کا حکم دیتا ہے۔\"\nپس اس قطب (القطب) کی بیعتِ نبات (مبايعة النبات) یہ ہے کہ اس کا نفس اس سے بیعت کرے کہ وہ خوشی یا ناخوشی میں اس کی مخالفت نہیں کرے گا، ان تمام چیزوں میں جن کا وہ اسے اللہ کی اطاعت میں اس کے احکام کے بارے میں حکم دیتا ہے۔ کیونکہ اللہ نے ہر نفس کی لگام اس کے مالک کے ہاتھ میں دے دی ہے اور اس کا معاملہ اسی کے سپرد کر دیا ہے، پس فرمایا: **وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَى** (اور جس نے اپنے رب کے مقام سے ڈرا اور نفس کو خواہش سے روکا)، یعنی اپنے نفس کو۔ اور اسی طرح داؤد علیہ السلام کے بارے میں: **وَلَا تَتَّبِعِ الْهَوَى** (اور خواہش کی پیروی نہ کرو)، یعنی اپنے نفس کی۔ کیونکہ اگر وہ کسی اور کی خواہش ہوتی تو اسے اس کی پیروی سے منع کیا جاتا، لیکن اس نے اس کی پیروی کی، پس وہ صرف اپنے نفس کی خواہش سے ہی اس کی پیروی کرتا ہے۔ پس اس نے اس معاملے میں اپنے نفس کی اطاعت کی۔ اسی لیے یہ متعین ہوا کہ اس نے \"ہویٰ\" سے مراد اپنا نفس لیا ہے نہ کہ کوئی اور، اور وہ یہ ہے کہ وہ اسے اس چیز کی مخالفت کا حکم دے جس کا اللہ نے اسے کرنے کا حکم دیا یا جس سے اسے منع کیا۔\n\nپس جب اس کا نفس اس کی بیعت کر لیتا ہے، تو اس کی شجریت (درخت ہونے) کا حکم اس شخص سے تنازع کرنے کی طرف پھر جاتا ہے جو اللہ کے حکم سے تنازع کرتا ہے۔ پس اس کی حقیقت کا حکم اللہ کے حکم کی مخالفت کرنے والوں میں باقی رہتا ہے، کیونکہ اللہ جانتا تھا کہ اختلاف کی حقیقت زائل نہیں ہو گی، کیونکہ وہ اس کی عین ذات کے لیے ایک درخت ہے۔ اگر وہ زائل ہو جاتی تو اس کی عین ذات زائل ہو جاتی۔ اسی لیے اللہ نے اس کے لیے ایک خاص مصرف متعین کیا جس میں اس کی سعادت ہو۔\nاور لوگوں میں سے جس نے بھی قطب (القطب) کو پہچانا، اس پر اس کی بیعت لازم ہو گئی، اور جب اس نے بیعت کر لی تو اس پر اس کی بیعت کے تقاضے لازم ہو گئے، اور یہ بیعتِ نبات (مبايعة النبات) میں سے ہے۔ کیونکہ یہ اس قطب (القطب) کے لیے ایک ظاہری بیعت ہے کہ وہ اس کے ظاہر میں جو چاہے حکم کرے، اور دوسرے پر اس کی اطاعت لازم ہے۔ اور ایسی ہی چیز ظاہر شریعت میں بھی ظاہر ہوئی ہے کہ اگر تنازع کرنے والے کسی تنازع میں اپنے درمیان کسی حکم پر متفق ہو جائیں، اور وہ ان کے درمیان کوئی فیصلہ کر دے، تو ان پر لازم ہے کہ وہ اس حکم پر قائم رہیں اور اس کے فیصلے کی مخالفت نہ کریں۔\nپس الحق (الحق) کی طرف سے مقرر کردہ قطب (القطب) ان لوگوں میں فیصلہ کرنے کا زیادہ حقدار ہے جنہوں نے باطن میں اس کی امامت کو پہچانا۔ اور اسی تصرف کی وجہ سے جو ہم نے کہا کہ وہ اپنے بیعت کرنے والے کے ظاہر میں کرتا ہے، ہم نے اس بیعت کو بیعتِ نبات (مبايعة النبات) کے ساتھ ملحق کیا ہے۔ بلکہ اگر آپ نے معاملے کی تحقیق کی اور اس میں اصل کی پیروی کی، تو آپ نے جزوی ناطق نفس میں نباتیت (النباتية) پائی، کیونکہ وہ صرف اسی جسمِ مسویٰ (متوازن) اور معتدل سے ظاہر ہوا ہے، اور اس کے مزاج کی صورت پر ہے، پس وہی اس کی زمین ہے جس سے وہ اگا جب اللہ نے اس جسم میں اپنی روح سے پھونک کر اسے اگایا۔ اور اسی طرح ہر وہ روح جو عنصری جسم کی تدبیر کرتی ہے۔\nپس خوش نصیب وہ ہے جس نے اپنے وقت کے امام کو پہچانا، پس اس کی بیعت کی اور اسے اپنے نفس، اپنے اہل اور اپنے مال میں حاکم بنایا، جیسا کہ\nآپ صلی اللہ علیہ وسلم نے اپنے حق میں فرمایا: **لا يكمل لعبد الايمان حتى أكون أحب إليه من أهله وماله والناس أجمعين‏** (کسی بندے کا ایمان کامل نہیں ہوتا جب تک کہ میں اسے اس کے اہل، اس کے مال اور تمام لوگوں سے زیادہ محبوب نہ ہو جاؤں)۔\n\nاور اسی لیے بیعت میں خوشی اور ناخوشی (المنشط والمكره) کی شرط لگائی جاتی ہے، کیونکہ انسان خوش تب ہوتا ہے جب اللہ اس کے نفس کی خواہش کے موافق ہو، اور ناخوش تب ہوتا ہے جب اللہ کا حکم اس کے نفس کی خواہش کے خلاف ہو۔ پس وہ انصاف اور بیعت کے حکم کی وفا کی خاطر ناخوشی کے باوجود اس پر قائم رہتا ہے۔ کیونکہ اس نے صرف اللہ سے بیعت کی ہے، جب کہ **يَدُ اللهِ فَوْقَ أَيْدِيهِمْ** (اللہ کا ہاتھ ان کے ہاتھوں کے اوپر ہے)، اور انہوں نے آنکھوں سے صرف اسی شخص کا ہاتھ دیکھا جس سے انہوں نے بیعت کی۔\nاور نفس ہمیشہ غالب طور پر اپنے مزاج کے حکم کے تحت ہوتا ہے، اور لوگوں میں سے بہت کم ہیں جو اپنے نفس کو اپنی طبیعت اور مزاج پر حاکم کرتے ہیں۔ کیونکہ جسمِ مسویٰ (متوازن جسم) کے لیے امومت (ماں ہونا) ہے اور نفس کے لیے نبوت (نبی ہونا) ہے۔ اور انسان کو اپنے والدین کے ساتھ احسان کرنے اور ان کے ساتھ نیکی کرنے کا حکم دیا گیا ہے، اور ان کے احکام کی تعمیل کا، جب تک کہ والدین میں سے کوئی اسے الحق (الحق) کے حکم کی مخالفت کا حکم نہ دے، تو وہ ان کی اطاعت نہ کرے۔ جیسا کہ اللہ تعالیٰ نے فرمایا:\n**وَإِنْ جَاهَدَاكَ عَلَى أَنْ تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ** (اور اگر وہ دونوں تجھ پر زور ڈالیں کہ تو میرے ساتھ شرک کرے جس کا تجھے علم نہیں، تو ان کی اطاعت نہ کر، اور دنیا میں ان کے ساتھ بھلائی سے رہ، اور اس شخص کے راستے کی پیروی کر جس نے میری طرف رجوع کیا)۔\nپس اس نے اللہ کی طرف رجوع کرنے والوں کی پیروی کا حکم دیا اور ان کے نفوس کی مخالفت کا اگر وہ انکار کریں۔ پس امام کا حق پیروی کا زیادہ حقدار ہے۔ اللہ تعالیٰ نے فرمایا:\n**يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ** (اے ایمان والو! اللہ کی اطاعت کرو اور رسول کی اطاعت کرو اور تم میں سے اولی الامر (حکم دینے والوں) کی)۔\nاور وہ اقطاب (الأقطاب)، خلفاء اور ولاۃ (حکمران) ہیں۔ اور ان کے لیے کوئی حکم باقی نہیں رہتا مگر اس صنف میں جس میں آپ کو تصرف کی اجازت دی گئی ہے، کیونکہ واجب اور محظور (حرام) اللہ کی اطاعت اور اس کے رسول کی اطاعت میں سے ہیں۔ پس ائمہ کے لیے صرف مباح (جائز) باقی رہا، اور اس میں نہ کوئی اجر ہے اور نہ کوئی گناہ۔ پس جب آپ کے مقدم امام، جس سے آپ نے سمع و طاعت پر بیعت کی ہے، آپ کو مباحات میں سے کسی چیز کا حکم دے، تو اس میں آپ پر اس کی اطاعت واجب ہو جاتی ہے اور اس کی مخالفت حرام ہو جاتی ہے۔ اور اس چیز کا حکم جو مباح تھا، واجب ہو جاتا ہے۔ پس جب انسان اس کے حکم پر عمل کرتا ہے تو اسے واجب کا اجر حاصل ہوتا ہے، اور اس مباح سے اباحت کا حکم اس شخص کے حکم سے ختم ہو جاتا ہے جس سے اس نے بیعت کی ہے۔ پس جو کچھ ہم نے ذکر کیا اور جس پر ہم نے امام کے مباح کے حکم کے بارے میں تنبیہ کی، اس پر غور کرو، اور بیعت کے مقام کو پہچانو، اور اس نے کیا ثمر دیا اور کیا اثر کیا، اور کس طرح اس نے الحق (الحق) کے حکم سے اباحت کے حکم کو وجوب سے منسوخ کر دیا۔ پس امام شارع کے حکم سے شارع کے مقام پر نازل ہوا، پس محکوم علیہ میں حکم اس سے بدل گیا جو شریعت میں اس امام کے حکم سے پہلے تھا۔ پس جسے الحق (الحق) نے حکم میں اپنا مقام دیا، اس کی پیروی متعین ہے۔\n\n[بے شک نبات (النبات) معدن اور حیوان کے درمیان ایک درمیانی عالم ہے]\n\nاور جان لو کہ نبات (النبات) معدن اور حیوان کے درمیان ایک درمیانی عالم ہے، پس اس کے لیے برزخوں (البرازخ) کا حکم ہے۔ پس اس کے دو پہلو ہیں۔ پس وہ اپنی ذات کے علم سے اس شخص کو عطا کرتا ہے جسے اس کی حقیقت کے وجوہ کا کشف (كوشف) کیا گیا ہو۔ کیونکہ کمال برزخوں میں غیر برزخوں کی نسبت زیادہ ظاہر ہوتا ہے، کیونکہ وہ آپ کو اپنی ذات کا اور غیر کا علم دیتا ہے، اور غیر برزخ آپ کو صرف اپنی ذات کا علم دیتا ہے۔ کیونکہ برزخ دونوں اطراف کے لیے آئینہ ہے۔ پس جس نے اسے دیکھا، اس نے اس میں دونوں اطراف کو دیکھا، یہ ضروری ہے۔\nاور نبات (النبات) میں ایک برزخی راز ہے جو کسی اور میں نہیں ہوتا۔ کیونکہ وہ اپنے اور اپنے رب کے درمیان برزخ ہے، اس کے قول **نَبَاتًا** (نبات کی طرح) سے، اور اس کے رب سے، اس کے قول **أَنْبَتَكُمْ** (اس نے تمہیں اگایا) سے۔\n\nاور منصف عادل وہ ہے جو اپنے نفس اور اپنے رب کے درمیان فیصلہ کرے۔ اور وہ حاکم نہیں ہو سکتا جب تک کہ اس کا نفس اپنے رب سے تنازع نہ کرے، پس وہ اس پر اس کے حق میں فیصلہ کرتا ہے، کیونکہ وہ جانتا ہے کہ الحق (الحق) ہر پہلو سے اور ہر حال میں اللہ کے ہاتھ میں ہے۔ اور اس کے تنازع کا سبب یہ ہے کہ وہ صورت پر ہے، پس اس میں امثال کی مخالفت ہے نہ کہ اضداد کی۔ پس انسان اپنے رب اور اپنے نفس کے درمیان حاکم بن کر داخل ہوتا ہے۔ کیا آپ نہیں دیکھتے کہ اسے حکم دیا گیا ہے کہ وہ اسے اس کی خواہش سے روکے؟ پس اس نے اسے اجنبی کے مقام پر اتارا، حالانکہ وہ اس کی عین ذات ہے، اور وہی ہے جس نے دعویٰ کیا، پس وہی حاکم ہے اور وہی فریقِ مخالف۔ اور اگر معاملہ اس کے بغیر صرف جسمِ نامی (بڑھنے والے جسم) اور غیر نامی پر اکتفا کرتا، تو کوئی تنازع نہ ہوتا، کیونکہ وہ اللہ کی حمد کے ساتھ تسبیح کرنے پر فطرت میں ہے۔\nپس انسانی جسم نبات (النبات) میں ستارے کی طرح ہے جو ساق پر قائم نہیں ہوتا۔ پس وہ درخت نہیں بنتا مگر اس روح کے وجود سے جو اس میں پھونکی گئی ہے۔ تب وہ ساق پر قائم ہوتا ہے، تمام درختوں کے برعکس، کیونکہ وہ ان میں حیوانی روح پھونکے بغیر ساق پر قائم ہوتے ہیں۔ پس وہ اصالتاً ایک ستارہ ہے اور پھونکے جانے سے ایک درخت ہے۔ پس اس کا اللہ کو سجدہ کرنا ظلوں کا سجدہ ہے، اور درخت کا اللہ کو سجدہ کرنا ساق پر قائم اشخاص کا سجدہ ہے۔\n\nاور چونکہ نبات (النبات) برزخی تھا، وہ ایک آئینہ تھا جو ان صورتوں کو قبول کرنے والا تھا جن کے لیے وہ برزخ ہے، اور وہ حیوان اور معدن ہیں۔ جب وہ بیعت کرتا ہے، تو وہ اپنی بیعت کے لیے ان صورتوں کی بیعت کرتا ہے جو اس میں ظاہر ہوتی ہیں جن کے لیے وہ برزخ ہے، اس کی پیروی کرتے ہوئے۔ پس بیعتِ نبات (مبايعة النبات) میں حیوان اور معادن کی بیعت شامل ہے۔ کیونکہ یہ امام برزخوں کے آئینے میں ظاہر ہونے والی صورتوں کا مشاہدہ کرتا ہے، اور یہ ایک عجیب علم ہے۔ جیسا کہ دیکھنے والا حسی آئینے میں اپنی صورت کے علاوہ وہ صورتیں بھی دیکھتا ہے جو آئینہ غیر دیکھنے والے اشخاص کی صورتوں سے قبول کرتا ہے۔ پس وہ ان میں وہ چیزیں پاتا ہے جن پر وہ اشخاص اپنی ذات میں ہیں، حالانکہ وہ اپنی عین ذات میں اس سے غائب ہیں۔ اور اس نے ان کی صورت صرف اسی چمکدار جسم میں دیکھی۔\nپس اگر وہ صورت اس دیکھنے والے کو دیکھنے کے علاوہ کوئی علم عطا کرے، تو وہ عطاء اس مقام پر ہو گی جو بیعت کرنے والا بیعت میں سمع و طاعت کے طور پر بیعت لینے والے کو دیتا ہے۔ اور اگر وہ علم عطا نہ کرے، تو وہ اس کی طرف رجوع نہیں کرے گا، بلکہ وہ دیکھنے والے کی طرف رجوع کرے گا، اور وہ نہ امام ہے، نہ خلیفہ، اور نہ ہی اس کی کوئی بیعت ہے۔ اور اسی سے امام اپنی ذات میں غیر سے ممتاز ہوتا ہے اور جانتا ہے کہ وہ امام ہے۔\n\nپس اگر یہ دیکھنے والا اس صورت سے علم تفکر اور اعتبار کے حکم سے حاصل کرے، تو اسے خیال ہوتا ہے کہ وہ اپنے وقت کا امام ہے، لیکن ایسا نہیں ہے، مگر یہ کہ وہ صورتیں اسے اپنی ذات سے علم عطا کریں، الکشف (الکشف) کے طور پر، بغیر فکر اور اعتبار کے۔ اور اگر اتفاق سے صاحبِ فکر اس کشفی علم میں اس کے برابر ہو جائے، تب بھی وہ امام نہیں ہے، کیونکہ راستہ مختلف ہے۔ کیونکہ امام اپنے فکر سے علوم حاصل نہیں کرتا، بلکہ اگر وہ اپنی نظر کی طرف رجوع کرے تو غلطی کرے گا، کیونکہ اس کے نفس کو صرف اللہ سے لینے کی عادت ہے، اور اللہ نے اس بندے کی عنایت کی وجہ سے یہ نہیں چاہا کہ وہ اسے اس کے فکر کے راستے سے رزق دے، کیونکہ یہ چیز اسے اس کے رب سے حجاب میں ڈال دے گی۔ کیونکہ وہ ہر حال میں چاہتا ہے کہ الحق (الحق) ہر سانس میں ان معاملات کے بارے میں اس سے لے جن میں وہ ہے۔ پس اسے نہ کوئی فراغت ہے اور نہ ہی کسی غیر کی طرف نظر۔ اور عقل مند کے لیے جب وہ بصیرت حاصل کرے، تو ایک دلیل واقع ہوئی ہے جو اس بات کی صحت پر دلالت کرتی ہے جو ہم نے ذکر کیا۔\n\nنبی صلی اللہ علیہ وسلم نے کھجوروں کو بارور کرنے سے منع فرمایا، تو وہ خراب ہو گئیں، کیونکہ یہ وحیِ الٰہی سے نہیں تھا۔ اور بدر کے دن آپ کا پانی کے بغیر اترنا، تو آپ نے اپنے اصحاب کی بات کی طرف رجوع کیا۔\nکیونکہ آپ صلی اللہ علیہ وسلم کو علوم صرف اللہ سے لینے کی عادت تھی، اس معاملے میں آپ کی اپنی ذات کی طرف کوئی نظر نہیں تھی۔ اور وہ کامل ترین شخص ہیں، ان سے زیادہ کامل کوئی نہیں۔ پس جو ان سے کم ہو، اس کے بارے میں آپ کا کیا خیال ہے؟ اور عارفین باللہ کے لیے فکر اور ان کے درمیان استفادے کے طریقے سے کوئی تعلق باقی نہیں رہا۔ اور کسی شخص کو الٰہی (إلهيا) نہیں کہا جاتا جب تک کہ وہ اپنے علوم صرف اللہ سے، مکاشفہ بالحق (فتوح المكاشفة بالحق) کے فتوحات سے نہ لے۔\nابو یزید بسطامی فرماتے ہیں: \"تم نے اپنا علم مردہ سے مردہ کے ذریعے لیا، 'ہمیں فلاں نے حدیث بیان کی' اور وہ کہاں ہے؟ کہا: 'وہ مر گیا'، 'عن فلاں' اور وہ کہاں ہے؟ کہا: 'وہ مر گیا'۔\" پس ابو یزید نے فرمایا: \"اور ہم نے اپنا علم اس زندہ سے لیا جو کبھی نہیں مرتا۔\"\nپس اللہ اور اس کے بندے کے درمیان اس کے اپنے نفس کی طرف دیکھنے اور اپنے فکر اور نظر سے علم حاصل کرنے سے بڑا کوئی حجاب نہیں ہے، اگرچہ وہ علم کے موافق ہو۔ پس اللہ سے لینا زیادہ شرف والا ہے۔ اور عقول کی ضروریات کا علم اللہ کی طرف سے ہے، کیونکہ وہ فکر اور استدلال کے بغیر حاصل ہوتی ہیں۔ اسی لیے ضروریات شبہات کو بالکل قبول نہیں کرتیں، اور نہ ہی شکوک کو، اگر انسان عقل مند ہو۔ پس اگر اس کے اور اس کی عقل کے درمیان رکاوٹ ڈال دی جائے، تو وہ وہ نہیں ہے جس کے بیان کا ہم نے ارادہ کیا۔\n\nاور اس کے بعد کہ ہم نے آپ کو بیعتِ نبات (مبايعة النبات) اور اس کے مرتبے کے بارے میں آگاہ کیا، اور یہ کہ آپ اور آپ جیسے لوگ نبات (نبات) ہیں، تو ہم ان علوم کا ذکر کرتے ہیں جو یہ مقام شامل کرتا ہے، تاکہ ہمت ان پر مطلع ہونے اور ان سے آراستہ ہونے کے لیے بلند ہو۔\nپس ان میں سے علمِ رحموت (علم الرحموت)، اور فتوحِ مکاشفہ بالحق (فتوح المكاشفة بالحق) کا علم، اور باطن میں حلاوت کے فتوحات کا علم، اور اللہ کی طرف سے ترجمانی میں عبارات کے فتوحات کا علم، اور نبی صلی اللہ علیہ وسلم کے بعد نبی صلی اللہ علیہ وسلم کے حکم سے احکام کے نسخ (منسوخ ہونے) کا علم، کیونکہ وہ مجتہد کے حکم کو مقرر کرنے والے ہیں جب دلائل میں تعارض ہو، پس انہیں ان میں اختیار ہوتا ہے۔ اور بعض بندوں کے ساتھ عنایتِ الٰہیہ کا علم، اور اشارات کا علم، اور تمام اور کمال کا علم، اور یہ کہ تمام نشأت کے لیے ہے اور کمال مرتبے کے ساتھ ہے۔ اور بیان اور تبیین کا علم، اور استقامت کا علم، اور وہ چیز جس سے نبی صلی اللہ علیہ وسلم سورتِ ہود سے بوڑھے ہو گئے تھے۔ اور نصِ الٰہی کے مقامات پر الکشف (الکشف) کا علم کہ کیا اکوان (الأكوان) کا حکم اس پر اثر انداز ہوتا ہے یا نہیں؟ اور اطمینان کا علم اور اس کا یقین اور علم سے فرق۔ اور عالم کی اللہ کی ملکیت کی نسبت کا علم۔ اور جس نے اس میں اس سے تنازع کیا، اس نے کس چیز سے تنازع کیا، یہاں تک کہ اللہ نے ذکر کیا کہ اس کی ملکیت کی وجہ سے اس کے لشکر ہیں، اور وہ لشکر کون ہیں؟ اور کیا ان کا علم احصاء (گنتی) کے طریقے سے ہوتا ہے یا صرف اجمال کے طریقے سے ہوتا ہے بغیر تفصیل کے؟ اور کیا کسی کو ان کا علم تفصیل سے ہوا ہے یا نہیں؟ اور کون میں عللِ الٰہیہ کا علم۔ اور بندوں پر رجوعِ الٰہی کا علم کہ وہ کس چیز سے رجوع کرتا ہے اور کیوں رجوع کرتا ہے، حالانکہ وہ فرماتا ہے: **وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور اسی کی طرف تمام معاملات لوٹائے جاتے ہیں)۔ پس کیا وہ عین وہی امر ہے جو لوٹایا جاتا ہے یا نہیں؟ اور یہ ایک شریف علم ہے۔ اور اس شخص کے مقام کا علم جو تعظیمِ الٰہی کا مستحق ہے اور جو مستحق نہیں ہے۔ اور اللہ کے ساتھ کیے گئے عہد کی وفا کا علم، ان چیزوں میں جو وہ اس کے ساتھ باندھتا ہے جن میں اسے توڑنے کا اختیار ہوتا ہے۔ اور ہمارا مسلک اس کی وفا کرنا ہے، اور یہ ضروری ہے، مگر یہ کہ اس کے ساتھ کسی معتبر شیخ کا اپنے مرید کو یا کسی ایسے شخص کو جس کا اس میں اعتقادِ تقدم ہو، حکم شامل ہو جائے، تو اسے اختیار ہے کہ وہ اللہ کے ساتھ کیے گئے اس عہد کو توڑ دے جس میں اسے اختیار دیا گیا تھا، اور یہ ضروری ہے، اور اگر اس نے ایسا نہ کیا تو اسے بدلہ دیا جائے گا۔ اور اگر اس کے ساتھ ایسا کوئی حکم شامل نہ ہو، تو اس کی وفا کرنا ہمارا اور اہل خصوص کا مسلک ہے۔ اور دونوں نشأتوں کے درمیان برابری کا علم، پس ظاہر صرف باطن کی صورت میں ظاہر ہوتا ہے، اور اسی کو صدق سے تعبیر کیا جاتا ہے۔ اور اس شخص کا علم جس نے حقیقت کے التجلی (ظہور الٰہی) کے وقت پردہ طلب کیا، اس خوف سے کہ اس کی عین ذات زائل نہ ہو جائے۔ اور تبدیل (التبديل) کا علم، اور اس کی حضرة کیا ہے، اور کیا چیز تبدیل کو قبول کرتی ہے اور کیا قبول نہیں کرتی، ان چیزوں میں سے جو ممکن ہے کہ وہ اسے قبول کرے۔ اور اقبال اور تولی (منہ پھیرنا) کا علم، کیا اقبال تولی ہے یا وہ تولی کے بغیر اقبال ہے؟ اور عالم سے حرج کے اٹھ جانے کا علم، اس کے وجود کے باوجود، کس چیز سے وہ اس شخص کے حق میں اٹھ جاتا ہے جس کے حق میں وہ اٹھتا ہے؟ اور رضا کا علم، اور اس کا محل، اور اللہ کے نزدیک اس کا ثواب کیا ہے؟ اور خیر میں جلدی کرنے سے کیا نتیجہ نکلتا ہے اس کا علم۔ اور اقتدارِ کونی کا اقتدارِ الٰہی سے علم۔ اور عالم کا بعض کا بعض میں اثر انداز ہونے کا علم، کیا یہ علت کا اثر ہے یا نہیں؟ اور عالم میں تعصب کا علم، یہ کس صنف میں ظاہر ہوتا ہے؟ اور کیا ملأ اعلیٰ اس سے متصف ہوتے ہیں یا نہیں؟ اور کیا اس کے لیے اسماءِ الٰہیہ میں کوئی مستند ہے جو اعیان میں ان احوال کے لیے اثر انداز ہوتے ہیں جن میں مکلفین کے اعیان کو کھڑا کیا جاتا ہے، جیسے گنہگار جب اس پر اسم المنتقم (انتقام لینے والا) متوجہ ہو، اور اس پر اسم العفو (معاف کرنے والا) متوجہ ہو، تو اس کے لیے اسم التواب (توبہ قبول کرنے والا)، الرحیم (رحم کرنے والا)، الغفور (بخشنے والا) اور الحلیم (بردبار) تعصب کرتے ہیں؟ یہ میرا مطلب الٰہی مستند سے ہے۔ اور مکلف ممکنات کے اعیان پر جو کچھ ظاہر ہوتا ہے، کیا وہ استحقاق کے حکم سے ظاہر ہوتا ہے یا مشیئت کے حکم سے؟ اور وہ علم جس میں رسول جمع ہوتے ہیں اور جس میں وہ جدا ہوتے ہیں۔ اور تین آنے والی نسلوں کے مقامات کا علم جو ایک ترتیب پر ہیں، اور چوتھی نسل کا، اور زمانے میں ان کے لیے چار حرمت والے مہینے ہیں جو تین مسلسل ہیں اور ایک اکیلا ہے۔ اور سجدے سے اللہ سے کیا مطلوب ہے، اور سجدے کے مراتب، اور وہ سجدہ جس سے ساجد کو اٹھنے کی اجازت ہے، اس سجدے سے جو جب واقع ہو جائے تو اس سے نہیں اٹھا جاتا۔ اور کیا عالم سجدہ کرتے ہوئے پیدا کیا گیا یا کھڑا پیدا کیا گیا پھر اسے سجدے کی دعوت دی گئی، یا اس کا کچھ حصہ کھڑا اور کچھ سجدہ کرتے ہوئے پیدا کیا گیا، اور اس شخص کا تعین جو سجدہ کرتے ہوئے پیدا کیا گیا، اس شخص سے جو کھڑا پیدا کیا گیا پھر سجدہ کیا اور جس نے سجدہ نہیں کیا؟ اور چیزوں میں الٰہی علامات کا علم، اور ان میں سے کیا چیز بندے کی سعادت پر دلالت کرتی ہے اور کیا اس کی شقاوت پر؟ اور وعدہِ الٰہی کی تفصیلات کا علم، اور کیوں\n\nوہ ہر پہلو سے نافذ ہوا اور وعید (سزا کا وعدہ) ہر اس شخص میں نافذ نہیں ہوئی جسے وعید دی گئی، حالانکہ دونوں الٰہی خبریں ہیں۔\nپس یہ ان علوم میں سے کچھ ہیں جو یہ مقام شامل کرتا ہے، اور ہم نے ان میں سے کچھ علوم کو اختصار کی خاطر چھوڑ دیا جن کا ہم نے ذکر نہیں کیا۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\nاور اسی مقام سے ہمیں علم ہوا جب ہم اس پر ۵۹۱ھ میں فاس شہر، بلادِ مغرب میں کھڑے تھے، کہ کفار پر مومنین کی فتح اس کے وقوع سے پہلے ہو گی۔",
    "fa": "«باب سیصد و سی و ششم: در معرفت منزل بیعت گیاهان (النبات) با قطب صاحب زمان در هر عصر، و این منزل از حضرت محمدیه (الحضرة المحمدية) است.»\n\nسوگند خوردم به خدایی که سوگند خورد *** به ذات خویش، و آری به پروردگارم و آنچه هست\n\nکه او یگانه است و یگانه‌کننده‌ای ندارد *** در زمین و خلقش در هر کجا که باشد\n\nو او از عرش خود فرود می‌آید *** فرود آمدنش به عرش خویش از «عماء» (عما) است\n\nبدون چگونگی (تکییف) و بدون جدایی *** زیرا او از هر دوی این‌ها منزه است.\n\n### [اینکه بیعت عمومی تنها مخصوص یگانه زمان (واحد الزمان) است]\n\nآگاه باش، خداوند تو را تأیید کند، که بیعت عمومی تنها مخصوص یگانه زمان (واحد الزمان) است. و یگانه زمان کسی است که در کائنات با صورت الهی (الصورة الإلهية) ظاهر می‌شود. این نشانه او در ذات خودش است تا بداند که اوست. سپس او اختیار دارد که آن حکم را اجرا کند یا از اجرای آن و ظهور به آن نزد دیگران خودداری کند؛ این امر به اختیار اوست. پس برخی از آنان ظاهرند و برخی دیگر ظاهر نمی‌شوند و بنده باقی می‌مانند، مگر اینکه حق (الحق) او را به ظهور امر کند. پس به اندازه‌ای که امر الهی واقع شده است، ظاهر می‌شود و چیزی بر آن نمی‌افزاید. این همان مقام والایی است که در این طریق بر آن تکیه می‌شود؛ زیرا بنده در اصل آفریده نشده است مگر برای اینکه از آنِ خدا باشد و همواره بنده بماند. او آفریده نشده است که پروردگار باشد. پس هنگامی که خداوند خلعت سیادت را بر او بپوشاند و او را به آشکار شدن در آن امر کند، در ذات خود بنده و نزد بیننده سید و سرور ظاهر می‌شود. این زینت پروردگارش و خلعت او بر اوست.\n\nبه ابویزید بسطامی (رحمه الله) درباره تبرک جستن و دست کشیدن مردم به او گفته شد. او (رضی الله عنه) فرمود: «به من دست نمی‌کشند، بلکه به زیوری دست می‌کشند که پروردگارم مرا بدان آراسته است. آیا می‌توانم آنان را از این کار منع کنم، در حالی که این زیور از آنِ دیگری است؟» و به ابومدین درباره تبرک جستن مردم به او به نیت برکت و اینکه چرا اجازه می‌دهد چنین کنند، گفته شد: «آیا در خود از این کار اثری نمی‌یابی؟» او گفت: «آیا حجرالأسود در خود اثری می‌یابد که او را از سنگی بودن خارج کند، در حالی که رسولان و پیامبران و اولیا آن را می‌بوسند و آن دست راست خداست؟» گفته شد: «نه.» گفت: «من آن سنگ هستم.»\n\nخداوند متعال در این مقام می‌فرماید: «آنان که با تو بیعت می‌کنند، در حقیقت با خدا بیعت می‌کنند.» (إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله) پس آن را پس از اثباتش به صورت، نفی کرد، همان‌گونه که در مورد پرتاب کردن (رمی) نیز چنین کرد؛ آن را اثبات و نفی نمود: «و تو پرتاب نکردی آنگاه که پرتاب کردی، بلکه خدا پرتاب کرد.» (وَما رَمَيْتَ إِذْ رَمَيْتَ وَلكِنَّ الله رَمىٰ) سپس خداوند دست خود را در بیعت، بالای دست بیعت‌کنندگان قرار داد.\n\nپس از آداب بیعت این است که وقتی بیعت‌کنندگان دست بیعت‌شونده را برای بیعت می‌گیرند تا آن را ببوسند، دست‌های خود را زیر دست او قرار می‌دهند و دست او را بالای دست‌های خود می‌گذارند، همان‌گونه که خداوند رحمان صدقه را با دست راست خود از دست صدقه‌دهنده می‌گیرد. پس از آداب صدقه‌دهنده این است که صدقه را در کف دست خود بگذارد و آن را پایین بیاورد تا دست سائل هنگام گرفتن آن، بر دست دهنده بالا قرار گیرد، تا دست سائل دست برتر (الید العلیا) باشد و آن بهتر از دست زیرین (الید السفلی) است. و دست برتر همان دست انفاق‌کننده است. پس رحمان آن را می‌گیرد تا برای او تجارت کند تا بزرگ شود و در روز قیامت آن را می‌یابد که رشد کرده و افزوده شده است. این مذهب عموم است.\n\nاما مذهب ما که کشف (الکشف) آن را به ما عطا کرده است، چنین نیست. بلکه هنگامی که سائل دست خود را برای پذیرش صدقه از صدقه‌دهنده دراز می‌کند، حق (الحق) دست خود را بر دست سائل قرار می‌دهد. پس هنگامی که صدقه‌دهنده صدقه را می‌دهد، آن قبل از اینکه به دست سائل برسد، به دست رحمان می‌افتد، به جهت کرامتی که به صدقه‌دهنده داده می‌شود. و مانند آن در دست سائل خلق می‌شود تا سائل از آن بهره‌مند شود. و حق (الحق) عین آن صدقه را می‌گیرد و آن را پرورش می‌دهد تا رشد کند و در بزرگی مانند کوه احد شود. این از باب غیرت الهی (الغيرة الإلهية) است، زیرا بخشش به خاطر او بوده است. چون می‌بیند که انسان به خاطر هوای نفس خود، هدایایی را که شأن بزرگی دارند می‌بخشد، اما به خاطر خدا حقیرترین چیزهایی را که دارد، می‌دهد. این امر در میان مردم غالب است. پس خداوند برای جناب خود غیرت می‌ورزد که در مقام کوچک شمردن دیده نشود. از این رو آن صدقه را پرورش می‌دهد تا بزرگ شود. پس هنگامی که آن را در صورت آن عظمت جلوه دهد، مقصود حاصل می‌شود. و دست دهنده بر دست گیرنده برتری می‌یابد. و به همین دلیل فرمود: «می‌افتد» (تقع)، و افتادن تنها از بالا صورت می‌گیرد.\n\nو پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «اگر طنابی را آویزان کنید، بر خدا فرود می‌آید.» (لو دليتم بحبل لهبط على الله) یعنی همان‌گونه که نسبت به علو در استوا بر عرش به او داده می‌شود، در پایین نیز هست، همان‌گونه که «او به هر چیزی احاطه دارد.» (بِكُلِّ شَيْ‏ءٍ مُحِيطٌ) برای حفظ کردن، همان‌گونه که محیط دایره، هستی (الوجود) را حفظ می‌کند، یا نسبت هستی (الوجود) به نقطه‌ای که از آن ظاهر شده است، نسبت احاطه به هستی دایره محیط است. پس همان‌گونه که فوق از آنِ اوست، تحت نیز از آنِ اوست، و همان‌گونه که ظاهر از آنِ اوست، باطن نیز از آنِ اوست. پس او هم بیعت‌کننده (المبايع) است و هم بیعت‌شونده (المبايع)، زیرا بیعت نمی‌شود مگر بر شنیدن و اطاعت کردن. و شنیدن جز او نیست، و عمل به اطاعت جز برای او نیست. پس او شنونده و عمل‌کننده به آنچه به انجامش امر شده است، می‌باشد. اکنون صورت بیعت را ذکر می‌کنیم. ما در این باره کتاب مستقلی داریم که آن را «مبایعة القطب» (بیعت قطب) نامیده‌ایم و حاوی علم بزرگی است که نمی‌دانیم کسی در آن بر ما سبقت گرفته باشد. اگرچه عارفان اهل الله آن را مشاهده کرده و دانسته‌اند، اما مشغولیت آنان از تبیین آن برای مردم، به دلیل اینکه نزد آنان مهم نبوده است، مانع شده است؛ در حالی که اظهار آن برای ما مهم بوده است، زیرا این طایفه شغلی جز به مهم‌ترین امور ندارند. این در صورتی است که او به حکم نیروی الهی (القوة الإلهية) ظاهر نشود. اما اگر به آن ظاهر شود، هیچ چیز او را از چیز دیگری باز نمی‌دارد، زیرا او تماماً حق (حق) است. پس این را برای توضیح و بیان منصب بیعت و صورت آن بدان.\n\n### [اینکه خداوند هنگامی که قطب و خلیفه‌ای را ولیّ قرار دهد، در حضرت مثال (حضرة المثال) برای او تختی برپا می‌کند که او را بر آن می‌نشاند، و صورت آن مکان از صورت جایگاه (مکانت) خبر می‌دهد]\n\nپس بدان که خداوند سبحان هنگامی که یکی از والیان نظر در عالم را که از او به قطب (القطب)، یگانه زمان (واحد الزمان)، غوث (الغوث) و خلیفه (الخليفة) تعبیر می‌شود، ولیّ قرار دهد، در حضرت مثال (حضرة المثال) برای او تختی برپا می‌کند که او را بر آن می‌نشاند. صورت آن مکان از صورت جایگاه (مکانت) خبر می‌دهد، همان‌گونه که صورت استوا بر عرش از صورت احاطه علمی او بر هر چیزی خبر داد. پس هنگامی که آن تخت برای او برپا شد، تمام اسم‌هایی را که عالم می‌طلبد و او را می‌طلبد، بر او می‌پوشاند. پس او با آن‌ها به صورت جامه‌ها و زینت، در حالی که تاج بر سر دارد و دستبند و بازوبند بسته است، ظاهر می‌شود. تا زینت او را از بالا و پایین و وسط و ظاهر و باطن فرا گیرد.\n\nپس هنگامی که با صورت الهی (الصورة الإلهية) بر آن نشست و خداوند عالم را به بیعت با او بر شنیدن و اطاعت در خوشی و ناخوشی (المنشط والمكره) امر کرد، هر مأموری، اعم از بالا و پایین، وارد بیعت او می‌شود، مگر عالین که همان مهیمون (المهيمون) هستند و با ذات (بالذات) و نه با امر، عبادت می‌کنند. پس اولین کسانی که در آن مجلس بر او وارد می‌شوند، ملأ اعلی (الملأ الأعلى) بر اساس مراتبشان، اول به اول، هستند. پس دست او را بر شنیدن و اطاعت می‌گیرند و خود را به خوشی و ناخوشی مقید نمی‌کنند، زیرا این دو صفت را در خود نمی‌شناسند، چرا که هیچ یک از آن‌ها شناخته نمی‌شود مگر با چشیدن ضدش. پس آنان در خوشی هستند که طعم آن را نمی‌شناسند، زیرا ناخوشی را نچشیده‌اند.\n\nو هیچ روحی از آنان نیست که برای بیعت بر او وارد شود، مگر اینکه در مسئله‌ای از علم الهی (العلم الإلهي) از او سؤال کند. پس او به آن روح می‌گوید: «ای فلان، تو گوینده فلان چیز هستی؟» آن روح می‌گوید: «بله.» پس او در آن مسئله وجهی را که به علم به خدا (العلم بالله) مربوط است، بیان می‌کند که بالاتر از آن چیزی است که نزد آن شخص بوده است. پس هر کس که با او بیعت کند، از او بهره می‌برد. و در این هنگام از نزد او خارج می‌شود. این شأن این قطب است.\n\nو کتابی که در این باره تألیف کرده‌ام، سؤالات او از بیعت‌کنندگانش را که در زمان ما برای قطب وقت ما رخ داده است، ذکر کرده‌ام. زیرا این‌ها مسائل معینی نیستند که از هر قطبی تکرار شوند، بلکه هر قطبی در مورد آنچه خداوند در آن هنگام به دلش می‌اندازد و در آن کلامی از ارواحی که با او بیعت کرده‌اند، سؤال می‌کند.\n\nپس اولین بیعت‌کننده با او عقل اول (العقل الأول) است، سپس نفس (النفس)، سپس مقدمان از کارگزاران آسمان‌ها و زمین از فرشتگان مسخر، سپس ارواح مدبر هیئت‌ها (هیاکل) که با مرگ از اجسامشان جدا شده‌اند، سپس جن، سپس مولدات (موجودات متولد شده). و این بدان سبب است که هر آنچه در مکان و متمکن و محل و حال، خدا را تسبیح می‌گوید، با او بیعت می‌کند، مگر عالین از فرشتگان که همان مهیمون (المهيمون) هستند، و افراد (الأفراد) از بشر که تحت دایره قطب قرار نمی‌گیرند و او در آن‌ها تصرفی ندارد. آنان کاملانی مانند خود او هستند که شایسته مقامی هستند که این شخص از قطبیت به دست آورده است، اما چون امر اقتضا نمی‌کند که در زمان جز یک نفر متصدی این امر باشد، آن یک نفر تعیین شده است، نه به دلیل اولویت، بلکه به دلیل سبقت علم الهی در اینکه او والی باشد. و در میان افراد کسانی هستند که در علم به خدا (العلم بالله) از او بزرگترند.\n\nو این منزل شامل بیعت گیاهان (النبات) از مولدات است. و این شامل فرموده خداوند در مورد اجسام انسانی است: «و خدا شما را از زمین رویانید، پس روییدنی شدید.» (وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ فَنَبَتُّمْ نَباتاً) در ذکر آنان به رویاندن (إنبات)، فرمود که او آنان را رویانید (أنبتکم) و آن را با مصدر تأکید نکرد، بلکه مصدر دیگری آورد تا دانسته شود که آنان هنگامی که او آنان را رویانید، روییدند (نبتوا). پس اشتراکی بین او و آنان در خلق ایجاد کرد. این هشدار را می‌دهد که اگر استعداد روییدن در آنان نبود، اسم‌ها در آن‌ها تأثیر نمی‌گذاشتند. پس خروج آنان از اسم‌ها و استعداد بود. برای اسم‌ها فرموده اوست: «شما را از زمین رویانید» (أَنْبَتَكُمْ مِنَ الْأَرْضِ)، و برای استعداد فرموده اوست: «روییدنی شدید» (نَباتاً)، زیرا «نباتاً» مصدر «نبت» است نه مصدر «أنبت». چرا که مصدر «أنبت» همانا «إنبات» است. پس بنگرید که جریان قرآن و آشکار ساختن حقایق در آن چقدر شگفت‌انگیز است. چگونه خداوند در اخبارات خود به ما می‌آموزد که امور بر او چگونه است، پس حق هر صاحب حقی را به او می‌دهد، زیرا اقتدار الهی (الاقتدار الإلهي) تنها در کسی نفوذ می‌کند که استعداد نفوذ در او را داشته باشد، و این تنها در ممکنات است، زیرا در واجب الوجود بالذات و در محال الوجود نفوذی ندارد. پس منزه است خدای دانا و حکیم.\n\n### [اینکه انسان درختی از درختان است]\n\nو بدان که انسان درختی از درختان است که خداوند آن را رویانده است؛ درختی نه ستاره، زیرا بر ساق ایستاده است. و او را به دلیل «مشاجره» (التشاجر) که در اوست، درخت قرار داد، زیرا از اضداد آفریده شده است و اضداد خواهان خصومت، مشاجره و نزاع هستند. و به همین دلیل ملأ اعلی (الملأ الأعلى) با یکدیگر خصومت می‌کنند. و اصل وجود او در عالم، حکم اسم‌های الهی (الأسماء الإلهية) است که در حکم متقابل‌اند و نه چیز دیگر. این مستند الهی آن است.\n\nخداوند متعال در حق محمد (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید که او گفت: «مرا به ملأ اعلی (الملأ الأعلى) آنگاه که با هم خصومت می‌کردند، علمی نبود.» (ما كانَ لِي مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلى‏ إِذْ يَخْتَصِمُونَ) تا اینکه خداوند متعال او را آگاه ساخت. پس دانست که طبیعت در آنان اثری دارد، همان‌گونه که ارکان در اجسام مولدات اثری دارند.\n\nپس چون مردم درختانی بودند، خداوند در میان آنان والیانی قرار داد که هنگام خصومت به آنان رجوع کنند تا میانشان حکم کنند و حکم مشاجره از بین برود. و برای آنان در ظاهر یک امام قرار داد که امر همگان برای برپایی دین به او بازگردد. و بندگانش را امر کرد که با او نزاع نکنند. و هر کس که بر او ظاهر شود و با او نزاع کند، خداوند ما را به جنگ با او امر کرده است، زیرا می‌دانست که نزاع با او منجر به فساد در دینی می‌شود که خداوند ما را به برپایی آن امر کرده است. و اصل آن فرموده خداوند متعال است: «اگر در آسمان و زمین خدایانی جز الله بودند، قطعاً تباه می‌شدند.» (لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا) از آنجا بود که اتخاذ امام و اینکه او در زمان یک نفر باشد و با شمشیر ظاهر شود، پدید آمد.\n\nپس گاهی قطب وقت، خود امام است، مانند ابوبکر و دیگران در زمان خودشان. و گاهی قطب وقت نیست، پس خلافت برای قطب وقت است که جز به صفت عدل ظاهر نمی‌شود. و این خلیفه ظاهری، خود از جمله نایبان قطب در باطن است، بی‌آنکه خود بداند. پس جور و عدل در امامان ظاهر رخ می‌دهد، اما قطب جز عادل نیست.\n\nو اما سبب ظهور او در یک زمان و پنهان بودن برخی دیگر در زمانی دیگر، این است که خداوند هیچ کس را بر بودن در مقام خلافت مجبور نکرده است، بلکه خداوند شایستگی آن مقام را به او عطا کرده و ظهور در آن با شمشیر را، بر اساس آنچه به او امر شده است، به او عرضه کرده است. پس هر کس آن را پذیرفت، با شمشیر ظاهر شد و خلیفه ظاهر و باطن بود و جز او کسی نبود. و اگر عدم ظهور را به مصلحتی که می‌دید، انتخاب کرد، خداوند او را پنهان کرد و نایبی از جانب او در عالم برپا داشت که خلیفه نامیده می‌شود و جور و عدل می‌کند. و ممکن است عادل باشد به اندازه‌ای که خداوند سبحان او را توفیق دهد. و حکم او، حتی اگر جائر باشد، حکم امام عادل است. هر کس با او نزاع کند، کشته می‌شود و جز آن دیگری کشته نمی‌شود، زیرا او نزاع‌کننده است.\n\nو خداوند ما را امر کرده است که از طاعت او سرپیچی نکنیم و به ما خبر داده است که هر کس از آنان عدل ورزد، به نفع خودشان است و هر کس جور ورزد، به ضرر خودشان و به نفع ماست.\n\nو چون انسان درختی بود، همان‌گونه که ذکر کردیم، خداوند اولین انسان را از نزدیک شدن به درختی که برای او معین کرده بود، نهی کرد، نه از سایر درختان؛ همان‌گونه که انسان درختی معین به خلافت است، نه سایر درختان. پس او را آگاه ساخت که به این درخت معین بر خود نزدیک نشود. و این در وصیت او به داوود (علیه السلام) ظاهر شد: «و از هوای نفس پیروی مکن.» (وَلا تَتَّبِعِ الْهَوىٰ) یعنی هوای نفس خود. پس آن همان درختی است که آدم از نزدیک شدن به آن نهی شد، یعنی به موضع نزاع و اختلاف نزدیک نشو تا طبیعت جسم عنصری تو در تو اثر نگذارد. این را به نفس ناطقه مدبر خود می‌گوید، زیرا با آن، امر خدا را در آنچه به آن امر کرده یا از آن نهی نموده، مخالفت می‌کند.\n\nپس فرموده او «این درخت» با حرف اشاره، تعیین درختی معین است. و چون امامت یک «عرض» بود، همان‌گونه که امانت یک «عرض» بود و امامت امانت است، به همین دلیل برخی از اقطاب با آن ظاهر شدند و برخی دیگر ظاهر نشدند. پس حق (الحق) به این قطب با چشم شایستگی نگریست. و اگر خداوند به امام ظاهر با این چشم می‌نگریست، هیچ امامی هرگز جور نمی‌کرد، همان‌گونه که امامیه در امام معصوم می‌بینند. زیرا از شرط امام باطن این است که معصوم باشد، و امام ظاهر اگر غیر او باشد، مقام عصمت را ندارد. و از اینجا امامیه دچار اشتباه شدند.\n\nپس اگر امامت برای او مطلوب نبود و خداوند او را امر می‌کرد که در آن قیام کند، بدون شک نزد ما او را معصوم می‌ساخت.\n\nو رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بر تمام آنچه مقرر کردیم، هشدار داد. پس با فعل خود بر «عرض» هشدار داد، آنجا که کسی را بر ولایت مجبور نکرد، بلکه ذکر کرد که هر کس آن را ترک کند، برایش بهتر است و آن در روز قیامت حسرت و پشیمانی است، مگر برای کسی که در آن با صورت عدل قیام کند.\n\nو بر عصمت کسی که به آن امر شده است، هشدار داد، با فرموده خود: «پس هر کس که آن را با درخواست به او داده شود، به آن واگذار می‌شود، و هر کس که بدون درخواست به او برسد، خداوند فرشته‌ای را بر او می‌گمارد که او را هدایت کند.»\n\nو این معنای عصمت است. و سؤال در اینجا اشاره به رضایت به آن و محبت به این منصب است. پس او با باطن خود سائل است. و دیگری که از آن کراهت دارد، اهل حل و عقد او را بر آن مجبور می‌کنند و او می‌بیند که ورود و متلبس شدن به آن بر او واجب شده است، زیرا می‌بیند که تخلف از آن منجر به ظهور فساد می‌شود. پس این امر در ظاهر برای او مقام جبر الهی (الجبر الإلهي) به امر بر تلبس به آن را پیدا می‌کند. پس معصوم می‌شود و عادل خواهد بود، زیرا فرشته‌ای که او را هدایت می‌کند، جز به خیر امر نمی‌کند، حتی قرین او، همان‌گونه که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «خداوند مرا بر او یاری داد، پس او اسلام آورد.» (إنه أعانه الله عليه فأسلم) (با رفع میم و نصب آن) و فرمود: «پس مرا جز به خیر امر نمی‌کند.»\n\nپس بیعت گیاهان (النبات) با این قطب این است که نفس او با او بیعت کند که در خوشی و ناخوشی (منشط ولا مكره) در آنچه او را به طاعت خدا در احکامش امر می‌کند، مخالفت نکند. زیرا خداوند زمام هر نفسی را به دست صاحبش قرار داده و امر آن را به او واگذار کرده است. پس فرمود: «و اما کسی که از مقام پروردگارش ترسید و نفس را از هوای نفس بازداشت.» (وَأَمَّا مَنْ خافَ مَقامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوىٰ) یعنی نفس خود. و همچنین در مورد داوود: «و از هوای نفس پیروی مکن.» (وَلا تَتَّبِعِ الْهَوىٰ) یعنی نفس خود. زیرا اگر هوای نفس دیگری بود، او را از پیروی آن نهی می‌کرد، اما او از آن پیروی کرد. پس جز با هوای نفس خود از آن پیروی نمی‌کند. از این رو، با نفس خود در آن موافقت کرد. به همین دلیل، تعیین شد که منظور از هوای نفس، نفس خود اوست و نه دیگری. و آن این است که او را به مخالفت با آنچه خداوند به انجامش امر کرده یا از آن نهی نموده، امر کند.\n\nپس هنگامی که نفس او با او بیعت کرد، حکم درختی بودن (شجریتها) او به نزاع با کسی که با امر خدا نزاع می‌کند، منصرف می‌شود. پس حکم حقیقت او در مخالفان امر خدا باقی می‌ماند، زیرا خداوند می‌دانست که حقیقت اختلاف (الخلاف) از بین نمی‌رود، چرا که او درختی برای عین خود است. اگر از بین می‌رفت، عین او نیز از بین می‌رفت. به همین دلیل، خداوند مصرف خاصی را برای آن معین کرد که سعادت او در آن باشد.\n\nو هر کس از مردم که قطب را شناخت، بیعت با او بر او لازم می‌شود. و هنگامی که با او بیعت کرد، بیعت او بر او لازم می‌شود، و این از بیعت گیاهان (مبايعة النبات) است، زیرا این بیعتی ظاهری برای این قطب است که در ظاهر بیعت‌کننده هر چه بخواهد، حکم کند، و بر دیگری التزام به اطاعت اوست.\n\nو مانند این در شرع ظاهر نیز آشکار شده است که اگر متنازعین بر حکمی میان خود در آنچه نزاع کرده‌اند، توافق کنند و حاکم میانشان حکمی کند، بر آنان لازم است که بر آن حکم توقف کنند و آنچه را که حکم کرده است، مخالفت نکنند. پس قطبی که از جانب حق (الحق) منصوب شده است، برای حکم کردن در مورد کسانی که امامت او را در باطن شناخته‌اند، سزاوارتر است.\n\nو به دلیل همین حکمی که از او در ظاهر کسی که با او بیعت کرده است، گفتیم، این بیعت را به بیعت گیاهان (بيعة النبات) ملحق کردیم. بلکه اگر امر را تحقیق کنی و اصل را در آن دنبال کنی، نباتی بودن (النباتية) را در نفس جزئی ناطقه می‌یابی، زیرا آن جز از این جسم تسویه‌شده و معتدل و بر صورت مزاج آن ظاهر نشده است. پس این جسم، زمین اوست که از آن روییده است، هنگامی که خداوند با دمیدن از روح خود در این جسم، آن را رویانید. و همچنین است هر روح مدبر برای جسم عنصری.\n\nپس سعادتمند کسی است که امام زمان خود را بشناسد و با او بیعت کند و او را در نفس، خانواده و مال خود حاکم گرداند، همان‌گونه که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در حق خود فرمود: «ایمان بنده‌ای کامل نمی‌شود تا زمانی که من نزد او از خانواده، مال و همه مردم محبوب‌تر باشم.» (لا يكمل لعبد الايمان حتى أكون أحب إليه من أهله وماله والناس أجمعين)\n\nو به همین دلیل در بیعت، خوشی و ناخوشی (المنشط والمكره) شرط می‌شود، زیرا انسان خوشحال نمی‌شود مگر زمانی که امر خدا با هوای نفس او موافق باشد، و ناخوش می‌شود زمانی که امر خدا با هوای نفس او مخالف باشد. پس او به دلیل انصاف و وفای به حکم بیعت، با کراهت بر آن قیام می‌کند، زیرا او جز با خدا بیعت نکرده است، چرا که «دست خدا بالای دست‌های آنان است.» (يَدُ الله فَوْقَ أَيْدِيهِمْ) و با چشم‌ها جز دست این شخصی که با او بیعت کرده‌اند، مشاهده نکرده‌اند.\n\nو نفس همیشه غالباً تحت حکم مزاج خود است. و اندکی از مردم هستند که نفس خود را بر طبیعت و مزاج خود حاکم می‌کنند. زیرا مادری برای جسم تسویه‌شده و نبوت برای نفس است. و انسان به احسان به والدین و نیکی به آنان و اطاعت از اوامرشان امر شده است، مگر اینکه یکی از والدین او را به مخالفت با امر حق (الحق) امر کند، که در این صورت نباید از آنان اطاعت کند، همان‌گونه که خداوند متعال فرمود: «و اگر آن دو تلاش کردند که چیزی را که به آن علم نداری، شریک من قرار دهی، از آن دو اطاعت مکن، و در دنیا با آنان به نیکی مصاحبت کن و راه کسی را که به سوی من بازگشته است، پیروی کن.» (وَإِنْ جاهَداكَ عَلى‏ أَنْ تُشْرِكَ بِي ما لَيْسَ لَكَ بِهِ عِلْمٌ فَلا تُطِعْهُما وَصاحِبْهُما فِي الدُّنْيا مَعْرُوفاً وَاتَّبِعْ سَبِيلَ مَنْ أَنابَ إِلَيَ)\n\nپس به پیروی از بازگشت‌کنندگان به سوی خدا (المنيبين) و مخالفت با نفوسشان اگر از آن سر باز زنند، امر کرد. پس حق امام برای پیروی سزاوارتر است. خداوند متعال می‌فرماید: «ای کسانی که ایمان آورده‌اید، از خدا اطاعت کنید و از پیامبر و صاحبان امر (أُولِي الْأَمْرِ) خود اطاعت کنید.» (يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ) و آنان اقطاب (الأقطاب)، خلفا و والیان هستند.\n\nو برای آنان حکمی باقی نمانده است مگر در صنفی که تصرف در آن برای تو مباح شده است. زیرا واجب و محظور از طاعت خدا و طاعت رسول اوست. پس برای امامان جز مباح باقی نمانده است و در آن نه پاداشی است و نه گناهی. پس اگر امام مقدم بر تو که با او بر شنیدن و اطاعت بیعت کرده‌ای، تو را به امری از مباحات امر کند، اطاعت او در آن بر تو واجب می‌شود و مخالفت با او حرام می‌گردد. و حکم آن چیزی که مباح بود، واجب می‌شود. پس اگر انسان به امر او عمل کند، پاداش واجب را به دست می‌آورد و حکم اباحه از آن به امر کسی که با او بیعت کرده است، برداشته می‌شود. پس در آنچه ذکر کردیم و در مورد امر امام به مباح هشدار دادیم، تدبر کن و منزلت بیعت و ثمره و تأثیر آن را بشناس و اینکه چگونه حکم اباحه را با وجوب، به امر حق (الحق) نسخ کرد. پس امام به امر شارع، منزلت شارع را یافت. پس حکم در مورد محکوم‌علیه از آنچه در شرع قبل از امر این امام بود، تغییر کرد. پس هر کس که حق (الحق) او را در حکم به منزلت خود قرار دهد، پیروی از او واجب می‌شود.\n\n### [اینکه گیاهان (النبات) عالمی واسط بین جماد (المعدن) و حیوان هستند]\n\nو بدان که گیاهان (النبات) عالمی واسط بین جماد (المعدن) و حیوان هستند. پس حکم برزخ‌ها را دارند. پس دو وجه دارند. و از علم به ذات خود به کسی که به حقیقت آنچه در آن است، کشف شود، عطا می‌کنند. زیرا کمال در برزخ‌ها آشکارتر از غیر برزخ‌هاست، چون علم به ذات خود و به غیر خود را به تو می‌دهد، در حالی که غیر برزخ تنها علم به ذات خود را به تو می‌دهد. زیرا برزخ آینه دو طرف است. پس هر کس آن را ببیند، ناگزیر دو طرف را در آن می‌بیند.\n\nو در گیاهان (النبات) سرّ برزخی وجود دارد که در غیر آن نیست. زیرا برزخ بین خود از فرموده او «روییدنی شدید» (نَباتاً) و بین پروردگارش از فرموده او «شما را رویانید» (أَنْبَتَكُمْ) است.\n\nو منصف عادل کسی است که بین نفس خود و پروردگارش حکم کند. و حکم‌کننده نمی‌شود مگر زمانی که نفس او با پروردگارش نزاع کند. پس به نفع پروردگارش بر نفس خود حکم می‌کند، زیرا می‌داند که حق (الحق) در هر وجه و در هر حال به دست خداست. و سبب نزاع نفس، این است که بر صورت (الصورة) است. پس در آن تضاد امثال است، نه تضاد اضداد. پس انسان به عنوان حکم‌کننده بین پروردگارش و نفس خود وارد می‌شود. آیا نمی‌بینی که او مأمور است که نفس خود را از هوای آن بازدارد؟ پس آن را در منزلت بیگانه قرار داده است، در حالی که آن جز عین او نیست و همان است که ادعا کرده است. پس او هم حکم‌کننده است و هم خصم.\n\nو اگر امر بدون نفس، تنها به جسم نامی (رشدکننده) و غیر نامی محدود می‌شد، نزاعی نبود، زیرا آن بر تسبیح خدا با حمد او سرشته شده است. پس جسم انسانی مانند ستاره‌ای از گیاهان است که بر ساق نمی‌ایستد. پس جز با وجود روح دمیده شده در آن، درخت نمی‌شود. در آن هنگام است که بر ساق می‌ایستد، برخلاف همه درختان که بدون دمیده شدن روح حیوانی در آن‌ها، بر ساق می‌ایستند. پس او در اصل ستاره و با دمیدن روح، درخت است. پس سجده او برای خدا، سجده سایه‌هاست، و سجده درخت برای خدا، سجده اشخاصی است که بر ساق ایستاده‌اند.\n\nو چون گیاهان (النبات) برزخی بودند، آینه‌ای بودند که صورت‌های آنچه برزخ برای آن‌هاست را می‌پذیرفتند، و آن دو حیوان و جماد (المعدن) هستند. هنگامی که بیعت می‌کند، برای بیعت خود، آنچه از صورت‌های آنچه برزخ برای آن‌هاست، در او ظاهر شده است، بیعت می‌کند، در حالی که تابع او هستند. پس بیعت گیاهان (بيعة النبات) شامل بیعت حیوان و جمادات می‌شود، زیرا این امام صورت‌های ظاهری در آینه برزخ‌ها را مشاهده می‌کند. و این علم شگفت‌انگیزی است.\n\nهمان‌گونه که بیننده در آینه حسی، غیر از صورت خود را می‌بیند که آینه صورت‌های غیر بیننده از اشخاص را می‌پذیرد. پس در آن درک می‌کند که آن اشخاص در ذات خود چگونه‌اند، در حالی که در اعیان خود از او غایب هستند و او صورتی از آن‌ها ندیده است مگر در این جسم صیقلی. پس اگر آن صورت به او علمی غیر از نگریستن به آن عطا کند، آن عطا به منزله چیزی است که بیعت‌کننده در بیعت از شنیدن و اطاعت به کسی که با او بیعت کرده است، می‌دهد. و اگر علم عطا نکند، آن به او باز نمی‌گردد، بلکه به بیننده باز می‌گردد و او اصلاً امام و خلیفه نیست و بیعتی ندارد. و با این، امام در ذات خود از غیر خود متمایز می‌شود و می‌داند که او امام است.\n\nپس اگر این بیننده علم را از آن صورت به حکم تفکر و اعتبار بگیرد و خیال کند که امام وقت خود است، چنین نیست، مگر اینکه صورت‌ها علم را از ذات خود به او عطا کنند، به صورت کشف (كشفا) بدون فکر و اعتبار. و اگر اتفاقاً صاحب فکر در آن علم کشفی با او مساوی باشد، او امام نیست، به دلیل اختلاف طریق. زیرا امام علوم را از فکر خود به دست نمی‌آورد، بلکه اگر به نظر خود بازگردد، خطا می‌کند. زیرا نفس او جز به گرفتن از خدا عادت نکرده است. و خداوند به دلیل عنایت خود به این بنده، نخواسته است که او را از طریق فکرش روزی دهد، تا این امر او را از پروردگارش محجوب نسازد. زیرا او در هر حال می‌خواهد که حق (الحق) در هر نفسی، آنچه را که در آن از شئون است، از او بگیرد. پس او فراغتی ندارد و به غیر او نظری ندارد.\n\nو برای عاقل، اگر بینا شود، دلیلی واقع شده است که بر صحت آنچه ذکر کردیم، دلالت می‌کند: پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از تلقیح نخل نهی کرد، پس فاسد شد، زیرا از وحی الهی نبود. و فرود آمدن او در روز بدر در مکانی که آب نداشت، پس به سخن اصحابش بازگشت.\n\nزیرا او (صَلَّى اللهُ عَليهِ وسَلَّم) عادت نکرده بود که علوم را جز از خدا بگیرد و در این باره به خود نظری نداشت. و او شخص کامل‌ترین است که کامل‌تر از او نیست. پس گمان تو درباره کسی که پایین‌تر از اوست، چیست؟\n\nو برای عارفان بالله، رابطه‌ای بین فکر و خودشان از طریق استفاده باقی نمانده است. و شخص الهی نامیده نمی‌شود مگر اینکه گرفتن علوم او جز از خدا از فتوحات مکاشفه به حق (فتوح المكاشفة بالحق) نباشد.\n\nابویزید بسطامی می‌گوید: «شما علم خود را مرده از مرده گرفتید. فلان برای ما حدیث گفت، و او کجاست؟» گفت: «مرد.» «از فلان، و او کجاست؟» گفت: «مرد.» پس ابویزید گفت: «و ما علم خود را از زنده جاوید گرفتیم.»\n\nپس هیچ حجابی بین خدا و بنده او بزرگتر از نظر کردن او به نفس خود و گرفتن علم از فکر و نظر خود نیست، حتی اگر با علم موافق باشد. زیرا گرفتن از خدا شریف‌تر است. و علم ضروریات عقول از خداست، زیرا بدون فکر و استدلال حاصل می‌شود. و به همین دلیل، اگر انسان عاقل باشد، ضروریات هرگز شبهه و شک را نمی‌پذیرند. و اگر بین او و عقلش حائل شود، او کسی نیست که ما قصد بیان او را داریم.\n\nو پس از آنکه تو را از بیعت گیاهان (بيعة النبات) و مرتبه آن آگاه ساختیم و اینکه تو و امثال تو گیاه هستید، اکنون آنچه این منزل از علوم در بر دارد را ذکر می‌کنیم تا همت به ایستادن بر آن‌ها و آراسته شدن به آن‌ها بالا رود.\n\nاز جمله آن علوم: علم رحموت (علم الرحموت)، علم فتوحات مکاشفه به حق (علم فتوح المكاشفة بالحق)، علم فتوحات حلاوت در باطن، علم فتوحات عبارات در ترجمه از خدا، علم نسخ احکام پس از پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به امر پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) - زیرا او مقررکننده حکم مجتهد برای تعارض ادله است، پس اختیار در آن‌ها با اوست -، علم عنایت الهی (العناية الإلهية) به برخی بندگان، علم اشارات، علم تمام و کمال و اینکه تمام برای نشأت و کمال برای مرتبه است، علم بیان و تبیین، علم استقامت و آنچه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) را از سوره هود پیر کرد، علم کشف بر مقامات نص الهی که آیا حکم کائنات در آن تأثیر می‌گذارد یا خیر، علم طمأنینه و فرق بین آن و یقین و علم، علم نسبت عالم به عنوان ملک خدا، علم کسی که در آن با او نزاع کرده است و اینکه با چه چیزی نزاع کرده است تا خداوند ذکر کرد که برای او لشکرهایی از جهت ملک بودنش هست و آن لشکریان چه کسانی هستند، و آیا از طریق شمارش دانسته می‌شوند یا تنها از طریق اجمال بدون تفصیل دانسته می‌شوند، و آیا علم به آن‌ها به تفصیل برای کسی حاصل شده است یا خیر، علم علل الهی در کون، علم رجوع الهی (الرجوع الإلهي) بر بندگان که با چه چیزی به سوی او باز می‌گردد و چرا باز می‌گردد، در حالی که او می‌فرماید: «و امر همه به سوی او بازگردانده می‌شود.» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ) پس آیا او عین آن امر بازگشت‌کننده است یا خیر؟ و این علم شریفی است. علم منزلت کسی که مستحق تعظیم الهی است از کسی که مستحق نیست، علم وفای به عهد با خدا در آنچه با او می‌بندد و اختیار فسخ آن را دارد. و مذهب ما وفای به آن است و چاره‌ای جز آن نیست، مگر اینکه امری از شیخ معتبری برای شاگرد یا یکی از کسانی که در او اعتقاد به تقدم دارد، همراه شود. در این صورت، او می‌تواند آن عهد با خدا را که در آن اختیار دارد، فسخ کند و چاره‌ای جز آن نیست. و اگر این کار را نکند، مورد مؤاخذه قرار می‌گیرد. و اگر چنین امری همراه نشود، وفای به آن مذهب ما و مذهب اهل خصوص است. علم برابری بین دو نشأت، پس ظاهر جز به صورت باطن ظاهر نمی‌شود و این همان است که به صدق تعبیر می‌شود. علم کسی که هنگام تجلی حقیقت (تجلى الحقيقة) طلب پوشش می‌کند، از ترس اینکه عینیت او از بین برود. علم تبدیل و حضور آن و آنچه تبدیل را می‌پذیرد و آنچه نمی‌پذیرد از آنچه ممکن است بپذیرد. علم اقبال و تولّی (رو آوردن و پشت کردن) که آیا اقبال، تولّی است یا اقبال بدون تولّی است. علم رفع حرج از عالم با وجود آن، که چگونه نزد کسی که حرج از او برداشته می‌شود، رفع می‌گردد. علم رضا و محل آن و پاداش آن نزد خدا. علم آنچه تعجیل در خیر به بار می‌آورد. علم اقتدار کونی از اقتدار الهی (الاقتدار الإلهي). علم تأثیر عالم بر یکدیگر که آیا تأثیر علت است یا خیر. علم تعصب در عالم که در کدام صنف ظاهر می‌شود و آیا ملأ اعلی (الملأ الأعلى) به آن متصف می‌شوند یا خیر. و آیا برای آن مستندی در اسم‌های الهی (الأسماء الإلهية) که در اعیان برای احوالی که اعیان مکلفین در آن قرار می‌گیرند، تأثیر می‌گذارند، هست؟ مانند عاصی که اسم منتقم بر او متوجه می‌شود و اسم عفو بر او متوجه می‌شود، پس اسم تواب و رحیم و غفور و حلیم برای او تعصب می‌ورزند. منظورم از مستند الهی این است. علم آنچه بر اعیان ممکنات مکلفین ظاهر می‌شود که آیا به حکم استحقاق ظاهر می‌شود یا به حکم مشیت. علم آنچه رسولان در آن جمع می‌شوند و آنچه در آن از هم جدا می‌شوند. علم منازل سه قرن آینده به ترتیب و قرن چهارم و آنچه برای آن‌ها در زمان از ماه‌های چهارگانه حرام است که سه تا پیوسته و یکی تنهاست. علم آنچه با سجده از خدا طلب می‌شود و مراتب سجده و سجده‌ای که ساجد می‌تواند از آن سر بردارد از سجده‌ای که اگر واقع شود، از آن سر برداشته نمی‌شود. و آیا عالم سجده‌کنان آفریده شده یا ایستاده آفریده شده و سپس به سجده دعوت شده است، یا برخی از آن ایستاده و برخی سجده‌کنان آفریده شده‌اند، و تعیین کسی که سجده‌کنان آفریده شده از کسی که ایستاده آفریده شده و سپس سجده کرده و کسی که سجده نکرده است. علم نشانه‌های الهی (العلامات الإلهية) در اشیا و آنچه از آن‌ها بر سعادت بنده و بر شقاوت او دلالت می‌کند. علم جزئیات وعده الهی و اینکه چرا وعده به هر وجهی اجرا شد، اما وعید در مورد هر کس که به او وعید داده شد، اجرا نشد، در حالی که هر دو خبر الهی هستند. این‌ها برخی از علومی است که این منزل در بر دارد و ما برخی از علوم آن را به دلیل اختصار ذکر نکردیم. «و خدا حق می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)\n\nو از این منزل بود که ما در سال پانصد و نود و یکم، هنگامی که بر آن وقوف یافتیم، پیروزی مؤمنان بر کافران را قبل از وقوع آن در شهر فاس از سرزمین مغرب دانستیم."
  },
  "page_count": 6
}