{
  "id": 226,
  "title": {
    "ar": "الباب السادس والعشرون ومائتان في معرفة الإرادة",
    "en": "Chapter 226: Concerning the Gnosis (معرفة) of the Will (الإرادة)",
    "ur": "۲۲۶ واں باب، ارادہ (الإرادة) کی معرفت میں",
    "fa": "باب دویست و بیست و ششم در معرفت اراده"
  },
  "content": {
    "ar": "## «الباب السادس والعشرون ومائتان في معرفة الإرادة»\n\n\nالإرادة عند القوم لوعة يجدها المريد من أهل هذه الطريقة تحول بينه وبين ما كان عليه مما يحجبه عن مقصوده‏\n\n\n> لوعة في القلب محرقة *** هي بدء الأمر لو علموا\n\n\n> فلهذا حن صاحبها *** للذي عنه العباد عموا\n\n\n> فإذا يبدو لناظره *** يعتريه البهت والصمم‏\n\n\n> فتراه دائما أبدا *** بلهيب النار يصطلم‏\n\n\n> كل شي‏ء عنده حسن *** وبهذا كلهم حكموا\n\n\n### [أن الإرادة هو ترك الإرادة]\n\n\nوالإرادة عند أبي يزيد البسطامي ترك الإرادة وذلك قوله أريد أن لا أريد فأراد محو الإرادة من نفسه وقال هذا القول في حال قيام الإرادة به ثم تمم وقال لأني أنا المراد وأنت المريد يخاطب الحق وذلك أنه لما علم إن الإرادة متعلقها العدم والمراد لا بد أن يكون معدوما لا وجود له ورأى أن الممكن عدم وإن اتصف بالوجود لذلك قال أنا المراد أي أنا المعدوم‏\nوأنت المريد فإن المريد لا يكون إلا موجودا وأما الإرادة عندنا فهي قصد خاص في المعرفة بالله وهي أن تقوم به إرادة العلم بالله من فتوح المكاشفة لا من طريق الدلالة بالبراهين العقلية فتحصل له المعرفة بالله ذوقا وتعليما إلهيا فيما لا يمكن ذوقه وهو قوله واتَّقُوا الله ويُعَلِّمُكُمُ الله وقالت المشايخ في الإرادة إنها ترك ما عليه العادة وقد تكون عادة زيد ما هي عادة عمرو فيترك عمرو عادته بعادة زيد لأنها ليست عادة له ثم اعلم في مذهبنا إنك إذا علمت أن الإرادة متعلقها العدم وعلمت إن العلم بالله مراد للعبد وعلمت أنه لا يحصل العلم به على ما يعلم الله به نفسه لأحد من المخلوقين مع كون الإرادة من المخلوقين لذلك موجودة فالإرادة للعبد ما دام في هذا المقام لازمة لازم حكمها وهو التعلق بالمعدوم والعلم بالله كما قلنا لا يصح وجوده فالعبد حكم الإرادة فيه أتم من كونها فيمن يدرك ما يريد فليست الإرادة الحقيقية إلا ما لا يدرك متعلقها فلا يزال عينها متصفا بالوجود ما دام متعلقها متصفا بالعدم فإن الإرادة إذا وجد مرادها أو ثبت زال حكمها وإذا زال حكمها زال عينها وينبغي للإرادة فينا أن لا تزول فإن مرادها لا يكون وأما من يتكون عن إرادته ما يريد فلا تصحبه الإرادة وجودا وإنما بقيت الإرادة هناك لأن متعلقها آحاد الممكنات وآحادها لا تتناهى فوجودها هناك لا يتناهى ولكن يختلف تعلقها باختلاف المرادات والذي يشير إليه أهل الله في تحقيق الإرادة أنها معنى يقوم بالإنسان يوجب له نهوض القلب في طلب الحق المشروع ليتصف به بالعمل ليرضى الله بذلك فيكون ممن رَضِيَ الله عَنْهُمْ ورَضُوا عَنْهُ فصاحب الإرادة يسعى في إن يكون بهذه المثابة ثم ما زاد على هذا مما يناله أهل الله من الفتوح والكشف والشهود وأمثال هذه الأحوال فذلك من الله ليست مطلوبة لصاحب الإرادة التي يقتضيها طريق الله إنما جل إرادتهم إن يكونوا على حال مع الله يرضى الله في أقوالهم وأفعالهم وأحوالهم إيثار الجناب الحق لا رغبة في نعيم ينالونه بذلك ولا فرارا من ضده دنيا ولا آخرة بل هم على ما شرع لهم ولله الأمر فيهم بما يشاء لا تخطر لهم حظوظ نفوسهم بخاطر هذا أتم ما توجبه الإرادة في المريد وإن خطر لهم حظ في ذلك فما خرجوا عن حكم الإرادة ولكن يكون صاحب الحظ النفسي ناقص المقام بالنظر إلى الأول مع كونه صاحب إرادة كما قال تعالى ولَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ مع أن النبوة موجودة فما زالوا من النبوة مع فضل بعضهم على بعض وأما معنى قول الطائفة في الإرادة إنها لوعة يجدها المريد تحول بينه وبين ما كان عليه مما يحجبه عن مقصوده فصحيح غير أنه ثم أمر تعطيه المعرفة بالله إذا حصل له العلم بالله من طريق الكشف والتعليم الإلهي فلا يبقى شي‏ء يتصف به العبد يحجبه عن مقصوده إذا كان مقصوده الحق فهو يشهده في كل عين وفي كل حال ولا ينال هذا المقام إلا من رضي الله عنه ومن علامات صاحب هذا المقام معانقة الأدب إلا أن يسلب عنه عقله بهذه المشاهدة فلا يطالب بالأدب كالبهاليل وعقلاء المجانين لأنه طرأ عليهم أمر إلهي ضعفوا عن حمله فذهب بعقولهم في الذاهبين وحكمهم عند الله حكم من مات على حالة شهود ونعت استقامة وبقي من حالته هذه حكمه حكم الحيوان ينال جميع ما يطلبه حكم طبيعته من أكل وشرب ونكاح وكلام من غير تقييد ولا مطالبة عليه عند الله مع وجود الكشف وبقائه عليهم كما يكشف الحيوان وكل دابة حياة الميت على النعش وهو يخور ويقول سعيدهم قدموني قدموني ويقول الشقي إلى أين تذهبون بي ويشاهدون عذاب القبر ويرون ما لا يراه الثقلان كذلك هذا الذي ذهب الله بعقله فيه حكمه حكم الحيوان وكل دابة وكما هو الميت على حكم ما مات عليه كذلك هذا البهلول هو على حكم ما ذهب عنده عقله فهو معدود في الأموات بذهاب عقله معدود في الأحباء بطبعه فهو من السعداء الذين رضي الله عنهم كمسعود الحبشي وعلي الكردي وجماعة رأيناهم بهذه المثابة بالشام وبالمغرب وهم من عباد الله على مثل هذا الحال نفعنا الله بهم ومهما رد على من هذه حاله عقله وهو في الحياة الدنيا\n\n\nفإنه من حينه يلازم الآداب الشرعية ويعانقها ومن أبقى عليه عقله كان عند القوم أتم وأعلى قيل للشيخ أبي السعود بن الشبل ما تقول في هؤلاء المجانين من أهل الله فقال رضي الله عنه هم ملاح ولكن العاقل أملح يشير إلى أن العناية بمن أبقى عليه عقله أتم فهذا أصل ما يرجع إليه مجموع أقوال أهل الله في الإرادة المصطلح عليها عندهم وإن اختلفت عباراتهم فهم بين أن ينطقوا في ذلك بأمر كلي أو بأمر جزئي بحسب ذوقه وما يترجح عنده في حاله فإنهم لا يتعدون في العبارة عن الشي‏ء ما يعطيه ذوقهم ولا يتصنعون ولا يتعملون‏\nولا يأخذون شيئا في تحقيق ذلك عن فكرهم بل ما يتعدى نطقهم ذوقهم ووجودهم فهم أهل صدق وعلم محقق لا تدخله شبهة عندهم ومن فكر فليس منهم ويصيب ويخطئ وليس صاحب الفكر بصاحب حال ولا ذوق وأما أهل الاعتبار فيكون منهم أصحاب أذواق ويعتبرون عن ذوق لا عن فكر وقد يكون الاعتبار عن فكر فيلتبس على الأجنبي بالصورة فيقول في كل واحد إنه معتبر ومن أهل الاعتبار وما يعلم أن الاعتبار قد يكون عن فكر وعن ذوق والاعتبار في أهل الأذواق هو الأصل وفي أهل الأفكار فرع وصاحب الفكر ليس من أهل الإرادة إلا في الموضع الذي يجوز له الفكر فيه إن كان ثم مما لا يمكن أن يحصل الأمر المفكر فيه إلا به بفتح الكاف فحينئذ يأخذه من بابه وهل ثم أمر بهذه المثابة لا يمكن أن ينال من طريق الكشف والوجود أم لا فنحن نقول ما ثم ونمنع من الفكر جملة واحدة لأنه يورث صاحبه التلبيس وعدم الصدق وما ثم شي‏ء إلا ويجوز أن ينال العلم به من طريق الكشف والوجود والاشتغال بالفكر حجاب وغيرنا يمنع هذا ولكن لا يمنعه أحد من أهل طريق الله بل مانعة إنما هو من أهل النظر والاستدلال من علماء الرسوم الذين لا ذوق لهم في الأحوال فإن كان لهم ذوق في الأحوال كأفلاطون الإلهي من الحكماء فذلك نادر في القوم وتجد نفسه يخرج مخرج نفس أهل الكشف والوجود وما كرهه من كرهه من أهل الإسلام إلا لنسبته إلى الفلسفة لجهلهم بمدلول هذه اللفظة والحكماء هم على الحقيقة العلماء بالله وبكل شي‏ء ومنزلة ذلك الشي‏ء المعلوم والله هُوَ الْحَكِيمُ الْعَلِيمُ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً والحكمة هي علم النبوة كما قال في داود عليه السلام وإنه ممن آتاه الله الملك والحكمة فقال وآتاهُ الله الْمُلْكَ والْحِكْمَةَ وعَلَّمَهُ مِمَّا يَشاءُ والفيلسوف معناه محب الحكمة لأن سوفيا باللسان اليوناني هي الحكمة وقيل هي المحبة فالفلسفة معناه حب الحكمة وكل عاقل يحب الحكمة غير أن أهل الفكر خطؤهم في الإلهيات أكثر من إصابتهم سواء كان فيلسوفا أو معتزليا أو أشعريا أو ما كان من أصناف أهل النظر فما ذمت الفلاسفة لمجرد هذا الاسم وإنما ذموا لما أخطئوا فيه من العلم الإلهي مما يعارض ما جاءت به الرسل عليهم السلام بحكمهم في نظرهم بما أعطاهم الفكر الفاسد في أصل النبوة والرسالة ولما ذا تستند فتشوش عليهم الأمر فلو طلبوا الحكمة حين أحبوها من الله لا من طريق الفكر أصابوا في كل شي‏ء وأما ما عدا الفلاسفة من أهل النظر من المسلمين كالمعتزلة والأشاعرة فإن الإسلام سبق لهم وحكم عليهم ثم شرعوا في أن يذبوا عنه بحسب ما فهموا منه فهم مصيبون بالأصالة مخطئون في بعض الفروع بما يتأولونه مما يعطيهم الفكر والدليل العقلي من أنهم إن حملوا بعض ألفاظ الشارع على ظاهرها في حق الله مما أحالته أدلة العقول كان كفرا عندهم فيؤولونه وما علموا إن لله قوة في بعض عباده تعطي حكما خلاف ما تعطي قوة العقل في بعض الأمور وتوافق في بعض وهذا هو المقام الخارج عن طور العقل فلا يستقل العقل بإدراكه ولا يؤمن به إلا إذا كانت معه هذه القوة في الشخص فحينئذ يعلم قصوره ويعلم أن ذلك حق فإن القوي متفاضلة تعطي بحسب حقائقها التي أوجدها الله عليها فقوة السمع لو عرض عليها حكم البصر أحالته والبصر كذلك مع غيره من القوي والعقل من جملة القوي بل هو المستفيد من جميع القوي ولا يفيد العقل سائر القوي شيئا ومن صح له حكم الإرادة المصطلح عليها عند أهل الله عرف هذه المقامات كلها والمراتب كشفا وعرف صورة الغلط في الأشياء وأنه واقع في النسب والوجوه وكل غالط إنما غلط في النسبة حيث نسبها إلى غير جهتها فيأخذها أهل الله فيجعلون تلك النسبة في موضعها ويلحقونها بمنسوبها وهذا معنى الحكمة فأهل الله من الرسل والأولياء هم الحكماء على الحقيقة وهم أهل الخير الكثير جعلنا الله من أهل الإرادة وممن جمع بين العادة وترك العادة من حيث ما تعطيه الشهادة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Twenty-Six: Concerning the Gnosis of Aspiration (الإرادة)\n\nAspiration (الإرادة), according to the People [of this Path], is a passionate longing (لوعة) found by the Aspirant (المريد) belonging to this Way, which intervenes between him and that state he was in which veiled him from his ultimate Goal (مقصوده).\n\n> A burning anguish in the heart,\n> It is the beginning of the matter, if they but knew.\n> For this, its possessor yearns\n> For that from which the servants are blind.\n> When it appears to his gaze,\n> Astonishment and deafness seize him.\n> You see him always, eternally,\n> Consumed by the flame of the fire.\n> Everything is beautiful in his sight,\n> And by this, all of them have judged.\n\n### [That Aspiration is the Abandonment of Aspiration]\n\nAspiration (الإرادة), according to Abu Yazid al-Bistami, is the abandonment of aspiration. This is his saying: \"I aspire not to aspire.\" Thus, he sought the effacement of aspiration from himself. He spoke this while aspiration was still active within him. Then he completed it by saying, addressing the Real (الحق): \"For I am the Object of Aspiration (المراد), and You are the Aspirant (المريد).\" This is because he knew that the object of aspiration (الإرادة) is related to Non-existence (العدم), and the Object of Aspiration (المراد) must necessarily be non-existent (معدوما), having no existence (وجود) of its own. Since he saw that the contingent (الممكن) is non-existence, even though it is qualified by existence, he therefore said, \"I am the Object of Aspiration,\" meaning, \"I am the non-existent.\" \"And You are the Aspirant,\" for the Aspirant (المريد) can only be existent.\n\nAs for Aspiration (الإرادة) according to us, it is a specific intention concerning the Gnosis (المعرفة) of Allah. It is that the aspiration for the Knowledge (العلم) of Allah arises within the seeker through the openings of Unveiling (الكشف), not through the path of indication by rational proofs (البراهين العقلية). Thus, Gnosis of Allah is attained by him through direct experience (ذوقا) and Divine instruction (تعليما إلهيا) regarding that which cannot be tasted. This is referenced in His saying: <<وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ>> (And fear Allah, and Allah will teach you). The Shaykhs said concerning Aspiration that it is the abandonment of customary habits. It may be that Zayd's habit is not 'Amr's habit, so 'Amr abandons his habit for Zayd's habit because it is not his own custom.\n\nFurthermore, know, according to our doctrine, that if you understand that Aspiration (الإرادة) is related to Non-existence (العدم), and you know that the Knowledge of Allah is the object of aspiration (مراد) for the servant, and you know that the Knowledge of Him, as Allah knows Himself, is not attained by any creature—even though the creature's aspiration for it exists—then Aspiration is necessary for the servant as long as he remains in this station. Its necessary consequence is its relation to the non-existent (المعدوم). Since the Knowledge of Allah, as we said, cannot properly exist [for the creature], the rule of Aspiration is more complete in the servant than it is in one who attains what he aspires to. Thus, true Aspiration (الإرادة الحقيقية) is only that whose object is unattainable. Its essence (عينها) therefore remains qualified by Existence (الوجود) as long as its object remains qualified by Non-existence (العدم). For if Aspiration's object is found or established, its ruling ceases, and when its ruling ceases, its essence vanishes. Aspiration should not vanish in us, for its object cannot be. As for one whose aspiration brings into being what he desires, Aspiration does not accompany him in existence. Aspiration remains there [in the realm of the contingent] only because its objects are the individual contingent things (آحاد الممكنات), and these individuals are inexhaustible. Thus, its existence there is inexhaustible, but its relation varies according to the variation of the objects of aspiration.\n\nWhat the People of Allah (أهل الله) point to in defining Aspiration (الإرادة) is that it is a meaning that arises in the human being, necessitating the heart's rising up in the search for the prescribed Truth (الحق المشروع), so that he may be qualified by it through action, thereby pleasing Allah, and becoming one of those concerning whom He said: <<رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ>> (Allah is pleased with them, and they are pleased with Him). The possessor of Aspiration strives to reach this rank. Anything beyond this—such as the Openings (الفتوح), Unveiling (الكشف), Witnessing (الشهود), and similar states attained by the People of Allah—is a gift from Allah. These are not sought by the possessor of Aspiration whose path is dictated by Allah. Rather, the entirety of their aspiration is to be in a state with Allah that pleases Him in their sayings, actions, and states, preferring the Divine Presence (الجناب الحق), neither desiring the bliss they might attain thereby, nor fleeing from its opposite, whether in this world or the Hereafter. Rather, they abide by what has been legislated for them, and the Command concerning them belongs to Allah, as He wills. The portions of their lower selves (حظوظ نفوسهم) do not even cross their minds. This is the most complete state necessitated by Aspiration in the Aspirant. If a portion of the self does cross their mind, they have not departed from the ruling of Aspiration, but the possessor of the self's portion is deficient in rank compared to the former, even though he is still an Aspirant. This is like His saying, the Exalted: <<وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّينَ عَلَى بَعْضٍ>> (And We have certainly favored some of the prophets over others), even though Prophethood exists [in all of them]. They have not ceased to be prophets despite the favoring of some over others.\n\nAs for the meaning of the statement of the Sufi group concerning Aspiration (الإرادة)—that it is a passionate longing (لوعة) found by the Aspirant which intervenes between him and that state he was in which veiled him from his ultimate Goal—this is correct. However, there is a matter granted by the Gnosis of Allah when the servant attains the Knowledge of Allah through Unveiling (الكشف) and Divine instruction (التعليم الإلهي). Then, nothing remains in the servant's attributes that veils him from his Goal. If his Goal is the Real (الحق), he witnesses Him in every entity (عين) and in every state. This station is attained only by one with whom Allah is pleased. Among the signs of the possessor of this station is adherence to proper spiritual etiquette (الأدب), unless his intellect is stripped away from him by this Witnessing (المشاهدة). In that case, he is not held accountable for etiquette, like the ecstatic madmen (البهاليل) and the sane among the insane. This is because a Divine matter has suddenly come upon them, which they were too weak to bear, so it carried their intellects away with those who have departed. Their ruling before Allah is the ruling of one who died in a state of witnessing (شهود) and a description of uprightness (استقامة). What remains of his state is governed by the ruling of the animal: he attains everything his nature dictates, such as eating, drinking, sexual intercourse, and speech, without restriction or accountability before Allah, even while Unveiling (الكشف) exists and remains upon them. This is similar to how animals and every creature perceive the life of the deceased upon the bier—the happy one bellows and says, \"Take me forward! Take me forward!\" and the wretched one says, \"Where are you taking me?\" They witness the torment of the grave and see what the two weighty races (mankind and jinn) do not see. Likewise, this person whose intellect Allah has taken away is governed by the ruling of the animal and every creature. Just as the deceased is governed by the state in which he died, so too is this ecstatic madman (البهلول) governed by the state in which his intellect departed. He is counted among the dead due to the loss of his intellect, yet counted among the beloved due to his nature. He is among the blessed ones with whom Allah is pleased, such as Mas'ud al-Habashi and Ali al-Kurdi, and a group we saw in this state in Syria and the Maghreb. They are servants of Allah in such a condition—may Allah benefit us through them.\n\nWhenever the intellect is restored to one in this state while he is still in this worldly life, he immediately adheres to and embraces the prescribed religious etiquette (الآداب الشرعية). However, the one whose intellect Allah preserves is considered more complete and higher in rank by the People [of the Path]. Shaykh Abu al-Su'ud ibn al-Shibl was asked, \"What do you say about these madmen among the People of Allah?\" He replied, may Allah be pleased with him, \"They are beautiful, but the one who retains his intellect is more beautiful,\" indicating that the Divine care (العناية) shown to the one whose intellect is preserved is more complete. This is the fundamental principle to which the collective sayings of the People of Allah concerning Aspiration (الإرادة)—as technically defined by them—return. Although their expressions may differ, they speak either of a universal matter or a particular matter according to their direct experience (ذوق) and what prevails in their state. They never exceed in their expression of a thing what their direct experience grants them; they neither pretend nor strive artificially.\n\nThey do not derive anything in the realization of this from their intellect (فكرهم); rather, their speech does not exceed their direct experience (ذوقهم) and their existence (وجودهم). They are people of sincerity and verified knowledge (علم محقق) into which no doubt enters, in their view. Whoever relies on speculation (فكر) is not one of them; he may be right or wrong, and the person of speculation is not a person of spiritual state (حال) or direct experience (ذوق). As for the People of Consideration (أهل الاعتبار), some of them possess direct experiences (أذواق) and reflect based on taste, not on speculation. Consideration may also be based on speculation, which confuses the outsider due to the outward form, leading him to say that everyone is a reflector and belongs to the People of Consideration. He does not know that consideration may stem from speculation or from direct experience. Consideration among the People of Direct Experience is the root (الأصل), while among the People of Speculation (الأفكار) it is a branch. The person of speculation is not among the People of Aspiration (أهل الإرادة), except in the place where speculation is permissible for him—if there is anything that cannot be attained except through the matter speculated upon. In that case, he takes it from its proper door. But is there anything of this nature that cannot be attained through the path of Unveiling (الكشف) and Existence (الوجود)? We say there is not, and we forbid speculation entirely, because it bequeaths confusion (التلبيس) and lack of sincerity to its possessor. There is nothing whose knowledge cannot be attained through the path of Unveiling and Existence, and preoccupation with speculation is a veil (حجاب). Others forbid this [Unveiling], but no one from the People of Allah's Path forbids it. Rather, those who forbid it are the People of Rational Inquiry and Deduction (أهل النظر والاستدلال) among the scholars of outward forms (علماء الرسوم) who have no direct experience of the spiritual states.\n\nIf they do possess direct experience of the states, like Plato the Divine (أفلاطون الإلهي) among the Sages (الحكماء), then that is rare among the people. You find that his soul proceeds in the manner of the souls of the People of Unveiling (الكشف) and Existence (الوجود). Those among the Muslims who disliked him only did so because of his association with philosophy (الفلسفة), due to their ignorance of the meaning of this word. The Sages (الحكماء) are, in reality, those who possess knowledge of Allah, of everything, and of the rank of that known thing. Allah is <<هُوَ الْحَكِيمُ الْعَلِيمُ>> (He is the Wise, the All-Knowing), and <<وَمَنْ يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً>> (And whoever is granted Wisdom has certainly been granted much good). Wisdom (الحكمة) is the knowledge of Prophethood, as He said concerning David, peace be upon him, that he was among those whom Allah granted kingship and wisdom, saying: <<وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهُ مِمَّا يَشَاءُ>> (And Allah gave him the kingdom and the Wisdom and taught him from that which He willed). The meaning of *Philosopher* (فيلسوف) is \"lover of wisdom,\" because *sophia* (سوفيا) in the Greek language is Wisdom, and it is also said to mean Love. Thus, *Philosophy* (فلسفة) means the love of Wisdom, and every rational person loves Wisdom. However, the People of Speculation (أهل الفكر) err in Divine matters (الإلهيات) more often than they are correct, whether they are philosophers, Mu'tazilites, Ash'arites, or any other category of the People of Rational Inquiry (أهل النظر). Philosophers were not condemned merely for this name; rather, they were condemned for their errors in Divine Knowledge (العلم الإلهي), which contradicted what the Messengers, peace be upon them, brought, due to their judgment based on their speculation, which was derived from corrupt thought concerning the very foundation of Prophethood and the Message, and why they rely on it, thereby confusing the matter. If they had sought Wisdom, when they loved it, from Allah and not through the path of speculation, they would have been correct in everything.\n\nAs for the People of Rational Inquiry among the Muslims other than the philosophers, such as the Mu'tazilites and the Ash'arites, Islam preceded them and judged them, and then they began to defend it according to what they understood of it. They are fundamentally correct but err in some secondary matters due to their interpretations derived from speculation (الفكر) and rational proof (الدليل العقلي). This is because they believe that if they take some of the Lawgiver's expressions concerning Allah literally—expressions which rational proofs deem impossible—it would constitute disbelief (كفرا) in their view, so they interpret them allegorically. They did not know that Allah possesses a power in some of His servants that yields a ruling contrary to what the power of the intellect yields in some matters, while agreeing in others. This is the station that lies outside the domain of the intellect (طور العقل). The intellect cannot independently grasp it, nor can one believe in it unless this power is present in the person. Only then does he recognize the intellect's limitation and know that [the spiritual ruling] is true. For the powers are differentiated, yielding results according to their realities upon which Allah created them. If the ruling of sight were presented to the power of hearing, the latter would deem it impossible, and similarly for sight regarding other powers. The intellect is one of the powers; indeed, it is the beneficiary of all the powers, but the intellect benefits none of the other powers. Whoever has correctly established the ruling of Aspiration (الإرادة) as technically defined by the People of Allah knows all these stations and levels through Unveiling (كشفا). He knows the nature of error in things, and that it occurs in relations (النسب) and aspects (الوجوه). Every person who errs only errs in the relation, by relating it to a direction other than its own. The People of Allah take that relation, place it in its proper position, and attach it to what it is related to. This is the meaning of Wisdom (الحكمة). Thus, the People of Allah, comprising the Messengers and the Saints (الأولياء), are the Sages (الحكماء) in reality, and they are the People of much good (الخير الكثير). May Allah make us among the People of Aspiration and among those who combine custom and the abandonment of custom, according to what Witnessing (الشهادة) grants. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## «باب نمبر دو سو چھبیس: ارادے کی معرفت میں»\n\nاہلِ طریق کے نزدیک ارادہ (الإرادة) ایک ایسی سوزش ہے جسے مرید اپنے اندر پاتا ہے، جو اس کے اور ان چیزوں کے درمیان حائل ہو جاتی ہے جو اسے اس کے مقصود سے حجاب میں رکھتی تھیں۔\n\n> دل میں ایک سوزش ہے جو جلا دینے والی ہے\n> اگر وہ جانیں تو یہی امر کی ابتدا ہے۔\n\n> اسی لیے اس کا صاحب اس کی طرف جھکتا ہے\n> جس سے بندے اندھے ہو گئے۔\n\n> جب وہ اس کی نظر کے سامنے ظاہر ہوتا ہے\n> تو اسے حیرت اور بہرا پن گھیر لیتا ہے۔\n\n> پس تو اسے ہمیشہ دیکھتا ہے\n> کہ وہ آگ کے شعلوں میں جل رہا ہے۔\n\n> ہر شے اس کے نزدیک حسین ہے\n> اور اسی پر ان سب نے حکم لگایا ہے۔\n\n### [یہ کہ ارادہ، ارادے کو ترک کرنا ہے]\n\nاور ابو یزید بسطامی کے نزدیک ارادہ، ارادے کو ترک کرنا ہے، اور یہ ان کا قول ہے: \"میں ارادہ کرتا ہوں کہ میں ارادہ نہ کروں۔\" پس انہوں نے اپنے نفس سے ارادے کو مٹانے کا ارادہ کیا، اور یہ بات انہوں نے اس حال میں کہی جب ارادہ ان کے ساتھ قائم تھا، پھر انہوں نے اسے مکمل کرتے ہوئے کہا: \"کیونکہ میں مراد (جس کا ارادہ کیا گیا) ہوں اور تو مرید (ارادہ کرنے والا) ہے۔\" وہ ذات حق (الحق) سے مخاطب تھے۔ اور یہ اس لیے کہ جب انہوں نے جان لیا کہ ارادے کا تعلق عدم (العدم) سے ہے، اور مراد (جس کا ارادہ کیا گیا) کا معدوم ہونا ضروری ہے، اس کا کوئی وجود نہ ہو، اور انہوں نے دیکھا کہ ممکن (الممکن) عدم ہے اگرچہ وہ وجود (الوجود) کے ساتھ متصف ہو، اس لیے انہوں نے کہا: \"میں مراد ہوں،\" یعنی میں معدوم ہوں۔\n\n\"اور تو مرید ہے،\" کیونکہ مرید موجود (موجود) کے سوا نہیں ہو سکتا۔\n\nاور ہمارے نزدیک ارادہ (الإرادة) اللہ کی معرفت (المعرفۃ) میں ایک خاص قصد ہے، اور وہ یہ ہے کہ بندے کے ساتھ اللہ کے علم کا ارادہ قائم ہو، جو کشف (الکشف) کے فتوحات سے حاصل ہو، نہ کہ عقلی دلائل کے ذریعے رہنمائی کے طریق سے۔ پس اسے اللہ کی معرفت ذوق (ذوق) اور الٰہی تعلیم کے ذریعے حاصل ہو، ان امور میں جن کا ذوق ممکن نہیں، اور یہ اللہ تعالیٰ کا قول ہے: **﴿وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ﴾** (اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے)۔\n\nاور مشائخ نے ارادے کے بارے میں کہا ہے کہ یہ اس چیز کو ترک کرنا ہے جس پر عادت قائم ہو۔ اور ہو سکتا ہے کہ زید کی عادت وہ نہ ہو جو عمرو کی عادت ہے، پس عمرو اپنی عادت کو زید کی عادت کے لیے ترک کر دے، کیونکہ وہ اس کی عادت نہیں ہے۔\n\nپھر ہمارے مذہب میں جان لو کہ جب تم یہ جان لو کہ ارادے کا تعلق عدم سے ہے، اور تم یہ جان لو کہ اللہ کا علم بندے کے لیے مراد ہے، اور تم یہ جان لو کہ اللہ کا علم اس طرح حاصل نہیں ہوتا جس طرح اللہ خود کو جانتا ہے، مخلوقات میں سے کسی کو بھی، اس کے باوجود کہ مخلوقات کی طرف سے ارادہ موجود ہے، تو بندے کے لیے ارادہ جب تک وہ اس مقام پر ہے، لازم ہے، اور اس کا حکم لازم ہے، جو معدوم سے تعلق ہے، اور اللہ کا علم جیسا کہ ہم نے کہا، اس کا وجود صحیح نہیں ہے۔ پس بندے میں ارادے کا حکم اس شخص سے زیادہ مکمل ہے جو اپنی مراد کو پا لیتا ہے۔\n\nپس حقیقی ارادہ وہی ہے جس کے متعلق کو پایا نہ جا سکے، پس اس کا عین (حقیقت) وجود کے ساتھ متصف رہتا ہے جب تک اس کا متعلق عدم کے ساتھ متصف رہے۔ کیونکہ جب ارادے کی مراد پائی جائے یا ثابت ہو جائے تو اس کا حکم زائل ہو جاتا ہے، اور جب اس کا حکم زائل ہو جاتا ہے تو اس کا عین زائل ہو جاتا ہے۔ اور ہم میں ارادے کے لیے ضروری ہے کہ وہ زائل نہ ہو، کیونکہ اس کی مراد حاصل نہیں ہوتی۔\n\nاور رہا وہ شخص جس کے ارادے سے اس کی مراد وجود میں آ جاتی ہے، تو ارادہ وجود کے اعتبار سے اس کے ساتھ نہیں رہتا، بلکہ ارادہ وہاں اس لیے باقی رہا کہ اس کا متعلق ممکنات (الممکنات) کے آحاد (اکائیاں) ہیں، اور اس کے آحاد لامتناہی ہیں، پس وہاں اس کا وجود لامتناہی ہے۔ لیکن اس کا تعلق مرادات کے اختلاف سے مختلف ہوتا ہے۔\n\nاور اہل اللہ جس چیز کی طرف ارادے کی تحقیق میں اشارہ کرتے ہیں، وہ یہ ہے کہ یہ ایک ایسا معنی ہے جو انسان میں قائم ہوتا ہے، جو اس کے لیے مشروع حق کی طلب میں دل کے اٹھان کو واجب کرتا ہے، تاکہ وہ عمل کے ذریعے اس کے ساتھ متصف ہو، تاکہ اللہ اس سے راضی ہو، پس وہ ان لوگوں میں شامل ہو جائے جن سے **﴿رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ﴾** (اللہ راضی ہوا اور وہ اللہ سے راضی ہوئے)۔ پس صاحب ارادہ اس کوشش میں رہتا ہے کہ وہ اس مقام پر فائز ہو جائے۔\n\nپھر اس سے جو کچھ زیادہ ہے، جو اہل اللہ کو فتوحات، کشف (الکشف)، شہود (الشہود) اور اس طرح کے احوال سے حاصل ہوتا ہے، وہ اللہ کی طرف سے ہے، اور وہ صاحب ارادہ کی مطلوب نہیں ہے جو طریق اللہ کا تقاضا کرتا ہے۔ بلکہ ان کا تمام تر ارادہ یہ ہے کہ وہ اللہ کے ساتھ اس حال پر ہوں جس میں اللہ ان کے اقوال، افعال اور احوال میں راضی ہو، جناب حق (الحق) کو ترجیح دیتے ہوئے، نہ کہ اس نعمت کی رغبت میں جو انہیں اس سے حاصل ہو، اور نہ ہی دنیا و آخرت میں اس کے برعکس سے فرار میں۔ بلکہ وہ اس پر ہیں جو ان کے لیے مشروع کیا گیا ہے، اور ان میں اللہ کا حکم ہے جو وہ چاہتا ہے، ان کے نفسوں کے حصے ان کے دل میں نہیں آتے۔\n\nیہ وہ مکمل ترین چیز ہے جو ارادہ مرید میں واجب کرتا ہے۔ اور اگر ان کے دل میں اس میں کوئی حصہ آ بھی جائے، تو وہ ارادے کے حکم سے باہر نہیں نکلے، لیکن نفسانی حصہ رکھنے والا شخص پہلے کے مقابلے میں مقام میں ناقص ہو گا، باوجود اس کے کہ وہ صاحب ارادہ ہے۔ جیسا کہ اللہ تعالیٰ نے فرمایا: **﴿وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّينَ عَلَى بَعْضٍ﴾** (اور ہم نے یقیناً بعض نبیوں کو بعض پر فضیلت دی)، حالانکہ نبوت موجود ہے، پس وہ نبوت سے خارج نہیں ہوئے باوجود اس کے کہ ان میں سے بعض کو بعض پر فضیلت حاصل ہے۔\n\nاور رہا طائفہ کا یہ قول کہ ارادہ ایک سوزش ہے جسے مرید پاتا ہے جو اس کے اور ان چیزوں کے درمیان حائل ہو جاتی ہے جو اسے اس کے مقصود سے حجاب میں رکھتی تھیں، تو یہ صحیح ہے، لیکن پھر ایک ایسا امر ہے جو اللہ کی معرفت (المعرفۃ) دیتی ہے جب اسے کشف اور الٰہی تعلیم کے ذریعے اللہ کا علم حاصل ہو جاتا ہے، تو کوئی ایسی چیز باقی نہیں رہتی جس سے بندہ متصف ہو اور وہ اسے اس کے مقصود سے حجاب میں رکھے، جب اس کا مقصود ذات حق (الحق) ہو، تو وہ اسے ہر عین اور ہر حال میں دیکھتا ہے۔\n\nاور یہ مقام صرف وہی حاصل کرتا ہے جس سے اللہ راضی ہو، اور اس مقام کے صاحب کی علامات میں سے ایک ادب کو لازم پکڑنا ہے، مگر یہ کہ اس مشاہدے سے اس کی عقل سلب ہو جائے، تو پھر اس سے ادب کا مطالبہ نہیں کیا جاتا، جیسے بہلول اور عقلمند مجنون، کیونکہ ان پر ایک الٰہی امر وارد ہوا جسے اٹھانے سے وہ کمزور پڑ گئے، پس وہ ان کی عقلوں کو لے گیا جو جانے والے تھے۔ اور اللہ کے نزدیک ان کا حکم اس شخص کا حکم ہے جو شہود (الشہود) کی حالت اور استقامت کی صفت پر فوت ہوا، اور اس کی حالت کا حکم باقی رہا، اس کا حکم حیوان کا حکم ہے، وہ اپنی طبیعت کے حکم سے جو کچھ طلب کرتا ہے، سب حاصل کرتا ہے، جیسے کھانا، پینا، نکاح اور کلام، بغیر کسی قید کے اور اللہ کے نزدیک اس پر کوئی مطالبہ نہیں، باوجود کشف کے وجود اور اس کے ان پر باقی رہنے کے، جیسا کہ حیوان کشف کرتا ہے، اور ہر چوپایہ میت کی زندگی کو تختے پر دیکھتا ہے، اور وہ گدھے کی طرح آواز نکالتا ہے اور کہتا ہے: \"خوش نصیب کو آگے بڑھاؤ، آگے بڑھاؤ،\" اور بدبخت کہتا ہے: \"تم مجھے کہاں لے جا رہے ہو؟\" اور وہ عذاب قبر کا مشاہدہ کرتے ہیں اور وہ دیکھتے ہیں جو جن و انس نہیں دیکھتے۔ اسی طرح یہ شخص جس کی عقل اللہ نے لے لی ہے، اس کا حکم حیوان اور ہر چوپائے کا حکم ہے، اور جیسا کہ میت اس حکم پر ہے جس پر وہ فوت ہوا، اسی طرح یہ بہلول اس حکم پر ہے جب اس کی عقل چلی گئی، پس وہ اپنی عقل کے جانے کی وجہ سے مردوں میں شمار ہوتا ہے، اور اپنی طبیعت کے اعتبار سے محبوبوں میں شمار ہوتا ہے، پس وہ ان خوش نصیبوں میں سے ہے جن سے اللہ راضی ہوا، جیسے مسعود حبشی اور علی کردی اور ایک جماعت جنہیں ہم نے شام اور مغرب میں اس مقام پر دیکھا، اور وہ اللہ کے بندوں میں سے اسی حال پر ہیں، اللہ ہمیں ان سے نفع دے۔\n\nاور جب بھی اس حال والے شخص کی عقل دنیا کی زندگی میں واپس لوٹائی جاتی ہے، تو وہ اسی وقت سے شرعی آداب کو لازم پکڑتا ہے اور ان سے چمٹ جاتا ہے۔ اور جس کی عقل اللہ نے باقی رکھی، وہ قوم کے نزدیک زیادہ کامل اور اعلیٰ تھا۔\n\nشیخ ابو السعود بن الشبل سے پوچھا گیا: \"آپ ان مجنونوں کے بارے میں کیا کہتے ہیں جو اہل اللہ میں سے ہیں؟\" تو انہوں نے فرمایا، اللہ ان سے راضی ہو: \"وہ اچھے ہیں، لیکن عاقل زیادہ اچھا ہے۔\" وہ اس بات کی طرف اشارہ کر رہے تھے کہ جس کی عقل باقی رکھی گئی اس پر عنایت زیادہ مکمل ہے۔\n\nپس یہ وہ اصل ہے جس کی طرف اہل اللہ کے ارادے کے بارے میں تمام اقوال لوٹتے ہیں جو ان کے ہاں اصطلاح میں رائج ہے، اگرچہ ان کی عبارات مختلف ہوں، تو وہ یا تو اس بارے میں کسی کلی امر کے ساتھ بات کرتے ہیں یا کسی جزوی امر کے ساتھ، ان کے ذوق کے مطابق اور جو ان کے حال میں ان کے نزدیک راجح ہوتا ہے۔ کیونکہ وہ کسی شے کی عبارت میں اس سے تجاوز نہیں کرتے جو ان کا ذوق انہیں دیتا ہے، اور نہ ہی وہ بناوٹ کرتے ہیں اور نہ ہی تکلف کرتے ہیں۔\n\nاور وہ اس کی تحقیق میں اپنی فکر سے کوئی چیز نہیں لیتے، بلکہ ان کا نطق ان کے ذوق اور وجود (الوجود) سے تجاوز نہیں کرتا۔ پس وہ صدق اور محقق علم والے ہیں جس میں ان کے نزدیک کوئی شبہ داخل نہیں ہوتا۔ اور جو فکر کرتا ہے وہ ان میں سے نہیں ہے، اور وہ صحیح بھی ہوتا ہے اور غلطی بھی کرتا ہے، اور صاحب فکر نہ صاحب حال ہے اور نہ صاحب ذوق۔\n\nاور رہے اہل اعتبار، تو ان میں سے صاحب ذوق ہوتے ہیں اور وہ ذوق سے اعتبار کرتے ہیں نہ کہ فکر سے۔ اور کبھی اعتبار فکر سے بھی ہوتا ہے، تو یہ اجنبی پر صورت میں مشتبہ ہو جاتا ہے، پس وہ ہر ایک کے بارے میں کہتا ہے کہ وہ معتبر ہے اور اہل اعتبار میں سے ہے، حالانکہ وہ نہیں جانتا کہ اعتبار کبھی فکر سے ہوتا ہے اور کبھی ذوق سے۔ اور اہل اذواق میں اعتبار اصل ہے، اور اہل افکار میں فرع ہے۔\n\nاور صاحب فکر اہل ارادہ میں سے نہیں ہے، مگر اس جگہ جہاں اسے فکر کی اجازت ہو، اگر وہاں کوئی ایسا امر ہو جس کے بارے میں فکر کیے بغیر وہ امر حاصل نہ ہو سکے، تو اس وقت وہ اسے اس کے دروازے سے لیتا ہے۔ اور کیا کوئی ایسا امر ہے جو اس مقام پر ہو اور کشف (الکشف) اور وجود کے طریق سے حاصل نہ ہو سکے؟ تو ہم کہتے ہیں کہ ایسا کوئی امر نہیں ہے، اور ہم فکر سے کلی طور پر منع کرتے ہیں، کیونکہ یہ اپنے صاحب کو التباس اور عدم صدق کا وارث بناتا ہے۔ اور کوئی ایسی چیز نہیں ہے جس کا علم کشف اور وجود کے طریق سے حاصل نہ ہو سکے۔ اور فکر میں مشغول ہونا حجاب ہے۔\n\nاور ہمارے علاوہ دوسرے لوگ اس سے منع کرتے ہیں، لیکن اہل طریق اللہ میں سے کوئی بھی اس سے منع نہیں کرتا، بلکہ اس کے مانع صرف اہل نظر اور استدلال میں سے وہ علماء رسوم ہیں جنہیں احوال میں کوئی ذوق نہیں ہے۔ اور اگر انہیں احوال میں ذوق ہو، جیسے حکماء میں سے افلاطون الٰہی، تو یہ قوم میں نادر ہے۔ اور تم دیکھو گے کہ اس کا نفس اہل کشف اور وجود کے نفس کی طرح نکلتا ہے۔ اور مسلمانوں میں سے جس نے اسے ناپسند کیا، وہ صرف فلسفہ سے اس کی نسبت کی وجہ سے تھا، اس لفظ کے مدلول سے ان کی جہالت کی وجہ سے۔\n\nاور حکماء حقیقت میں اللہ کے عالم ہیں اور ہر شے کے عالم ہیں اور اس معلوم شے کے مرتبے کے عالم ہیں۔ اور اللہ **﴿هُوَ الْحَكِيمُ الْعَلِيمُ﴾** (وہی حکمت والا، علم والا ہے)۔ اور **﴿وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا﴾** (اور جسے حکمت دی گئی، اسے بہت زیادہ بھلائی دی گئی)۔ اور حکمت نبوت کا علم ہے، جیسا کہ داؤد علیہ السلام کے بارے میں فرمایا، اور وہ ان میں سے ہیں جنہیں اللہ نے بادشاہت اور حکمت دی، پس فرمایا: **﴿وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهُ مِمَّا يَشَاءُ﴾** (اور اللہ نے اسے بادشاہت اور حکمت دی اور اسے سکھایا جو وہ چاہتا تھا)۔\n\nاور فیلسوف کا معنی ہے حکمت سے محبت کرنے والا، کیونکہ سوفیا یونانی زبان میں حکمت ہے، اور کہا گیا ہے کہ یہ محبت ہے۔ پس فلسفہ کا معنی ہے حکمت سے محبت۔ اور ہر عاقل حکمت سے محبت کرتا ہے، مگر اہل فکر کی غلطیاں الٰہیات میں ان کی درستگی سے زیادہ ہوتی ہیں، خواہ وہ فیلسوف ہو یا معتزلی یا اشعری یا اہل نظر کی کسی بھی قسم سے ہو۔\n\nپس فلاسفہ کی مذمت صرف اس نام کی وجہ سے نہیں کی گئی، بلکہ ان کی مذمت اس لیے کی گئی کہ انہوں نے علم الٰہی میں غلطی کی، جو ان چیزوں کے خلاف ہے جو رسولوں علیہم السلام لائے، ان کے نظر میں اس حکم کی وجہ سے جو فاسد فکر نے انہیں نبوت اور رسالت کی اصل میں دیا، اور کیوں وہ اس پر بھروسہ کرتے ہیں اور ان پر معاملہ کو الجھا دیتے ہیں۔ اگر وہ حکمت کو جب انہوں نے اس سے محبت کی، اللہ سے طلب کرتے، نہ کہ فکر کے طریق سے، تو وہ ہر چیز میں درست ہوتے۔\n\nاور فلاسفہ کے علاوہ مسلمانوں میں سے اہل نظر، جیسے معتزلہ اور اشاعرہ، تو اسلام ان کے لیے سبقت لے گیا اور ان پر حکم لگایا، پھر انہوں نے اس کی حمایت شروع کی جس قدر انہوں نے اسے سمجھا، پس وہ اصالت میں درست ہیں، اور بعض فروع میں غلطی کرتے ہیں، اس تاویل کی وجہ سے جو فکر اور عقلی دلیل انہیں دیتی ہے، کہ اگر وہ شارع کے بعض الفاظ کو اللہ کے حق میں ان کے ظاہر پر محمول کریں، جنہیں عقل کی دلیلیں محال قرار دیتی ہیں، تو ان کے نزدیک وہ کفر ہو گا، پس وہ اس کی تاویل کرتے ہیں۔ اور وہ نہیں جانتے کہ اللہ کے لیے اس کے بعض بندوں میں ایک قوت ہے جو بعض امور میں عقل کی قوت کے خلاف حکم دیتی ہے اور بعض میں موافق ہوتی ہے۔ اور یہ وہ مقام ہے جو عقل کی حد سے باہر ہے، پس عقل اس کے ادراک میں خود کفیل نہیں ہے، اور اس پر ایمان نہیں لایا جاتا مگر جب یہ قوت اس شخص میں موجود ہو، تو اس وقت وہ اپنی کمی کو جانتا ہے اور جانتا ہے کہ وہ حق ہے۔ کیونکہ قوتیں مختلف ہوتی ہیں، وہ ان حقائق کے مطابق حکم دیتی ہیں جن پر اللہ نے انہیں پیدا کیا ہے۔ پس قوت سماعت اگر قوت بصارت کے حکم پر پیش کی جائے تو وہ اسے محال قرار دے گی، اور بصارت بھی اسی طرح دوسری قوتوں کے ساتھ۔ اور عقل تمام قوتوں میں سے ہے، بلکہ وہ تمام قوتوں سے فائدہ اٹھانے والی ہے، اور عقل دوسری قوتوں کو کوئی فائدہ نہیں دیتی۔\n\nاور جس کے لیے اہل اللہ کے ہاں اصطلاح میں رائج ارادے کا حکم صحیح ہو گیا، وہ ان تمام مقامات اور مراتب کو کشف (الکشف) کے ذریعے جانتا ہے، اور وہ چیزوں میں غلطی کی صورت کو جانتا ہے، اور یہ کہ وہ نسبتوں اور وجوہ میں واقع ہوتی ہے۔ اور ہر غلطی کرنے والا صرف نسبت میں غلطی کرتا ہے، جہاں وہ اسے اس کی جہت کے علاوہ کسی اور سے منسوب کرتا ہے۔ پس اہل اللہ اسے لیتے ہیں اور اس نسبت کو اس کی جگہ پر رکھتے ہیں اور اسے اس کے منسوب سے ملاتے ہیں۔ اور یہی حکمت کا معنی ہے۔ پس اہل اللہ میں سے رسول اور اولیاء حقیقت میں حکماء ہیں، اور وہ بہت زیادہ بھلائی والے ہیں۔\n\nاللہ ہمیں اہل ارادہ میں سے بنائے اور ان میں سے بنائے جنہوں نے عادت اور ترک عادت کو جمع کیا، اس لحاظ سے جو شہادت (مشاہدہ) دیتی ہے۔ اور **﴿وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ﴾** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و بیست و ششم در معرفت اراده (الإرادة)\n\nاراده (الإرادة) نزد این طایفه، سوز و گدازی است که مرید از اهل این طریقت آن را می‌یابد؛ سوزی که میان او و آنچه پیشتر بر آن بوده و او را از مقصودش محجوب می‌داشته، حائل می‌شود.\n\n> سوزشی در قلب، سوزاننده است *** اگر بدانند، این آغاز کار است\n> از این رو صاحبش مشتاق آن چیزی است *** که بندگان از آن کور و غافلند\n> پس چون بر بیننده‌اش آشکار شود *** حیرت و کرانگی او را فرا می‌گیرد\n> او را می‌بینی که همیشه و پیوسته *** با شعله آتش درگیر است\n> هر چیزی نزد او نیکوست *** و همگی بر این حکم کرده‌اند.\n\n### [اینکه اراده، ترک اراده است]\n\nو اراده (الإرادة) نزد ابویزید بسطامی، ترک اراده است؛ و این همان سخن اوست که گفت: «می‌خواهم که نخواهم.» پس او محو اراده را از نفس خود خواست. این سخن را در حالی گفت که اراده در او برقرار بود. سپس آن را کامل کرد و گفت: «زیرا من مراد هستم و تو مرید.» (خطاب به حق). این بدان سبب است که او دانست متعلق اراده، عدم (العدم) است و مراد (آنچه خواسته می‌شود) ناگزیر باید معدوم باشد و وجودی نداشته باشد. و چون دید که ممکن، عدم است، هرچند به وجود (الوجود) متصف شده باشد، از این رو گفت: «من مراد هستم»، یعنی من معدوم هستم. و «تو مرید هستی»، زیرا مرید جز موجود (موجود) نمی‌تواند باشد.\n\nاما اراده (الإرادة) نزد ما، قصدی خاص در معرفت (المعرفة) به خداوند است؛ و آن این است که اراده علم به خداوند از طریق فتوحات کشف (المکاشفة) در او پدید آید، نه از راه دلالت براهین عقلی. در نتیجه، معرفت (المعرفة) به خداوند از طریق ذوق و تعلیم الهی برای او حاصل می‌شود، در آنچه ذوق آن ممکن نیست؛ و این همان سخن خداوند است: «وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ» (و از خدا پروا کنید و خدا به شما می‌آموزد).\n\nو مشایخ درباره اراده (الإرادة) گفته‌اند که آن ترک عاداتی است که شخص بر آن است. و چه بسا عادت زید، عادت عمرو نباشد؛ پس عمرو عادت خود را به خاطر عادت زید ترک می‌کند، زیرا آن عادت برای او نیست.\n\nسپس بدان که در مذهب ما، اگر بدانی که متعلق اراده، عدم (العدم) است، و بدانی که علم به خداوند مراد بنده است، و بدانی که علم به خداوند آن‌گونه که خداوند خود را می‌شناسد، برای هیچ‌یک از مخلوقات حاصل نمی‌شود، با وجود اینکه اراده از سوی مخلوقات برای آن موجود است؛ پس اراده برای بنده تا زمانی که در این مقام است، لازم است و حکم آن، یعنی تعلق به معدوم، نیز لازم است. و علم به خداوند، همان‌طور که گفتیم، وجودش صحیح نیست (به طور کامل حاصل نمی‌شود). بنابراین، حکم اراده در بنده کامل‌تر است تا در کسی که آنچه را می‌خواهد درک می‌کند. پس اراده حقیقی (الإرادة الحقيقية) نیست مگر آنچه متعلقش درک نشود. از این رو، ذات اراده پیوسته متصف به وجود (الوجود) است، مادامی که متعلقش متصف به عدم (العدم) باشد. زیرا اراده اگر مرادش موجود شود یا ثابت گردد، حکمش زائل می‌شود، و چون حکمش زائل شود، ذاتش نیز زائل می‌گردد. و شایسته است که اراده در ما زائل نشود، زیرا مراد آن حاصل نمی‌شود.\n\nاما کسی که آنچه می‌خواهد از اراده‌اش پدید می‌آید، اراده (الإرادة) به طور وجودی همراه او نیست. اراده در آنجا باقی مانده است، زیرا متعلق آن آحاد ممکنات است و آحاد ممکنات پایان نمی‌پذیرد، پس وجود اراده در آنجا پایان نمی‌پذیرد، اما تعلق آن با اختلاف مرادات، متفاوت می‌شود.\n\nآنچه اهل الله در تحقیق اراده (الإرادة) به آن اشاره می‌کنند، این است که اراده معنایی است که در انسان پدید می‌آید و موجب برانگیختن قلب در طلب حق مشروع می‌شود تا با عمل به آن متصف گردد و خداوند از این طریق راضی شود و از کسانی باشد که: «رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ» (خداوند از ایشان خشنود است و ایشان از خداوند خشنودند). پس صاحب اراده می‌کوشد تا به این مرتبه برسد. سپس آنچه بر این افزوده می‌شود، از قبیل فتوحات، کشف (الکشف)، شهود (الشهود) و امثال این احوال که اهل الله به آن دست می‌یابند، از جانب خداوند است و مطلوب صاحب اراده‌ای که طریق خدا آن را اقتضا می‌کند، نیست. بلکه عمده اراده آنان این است که در حالتی با خداوند باشند که خداوند از اقوال، افعال و احوالشان راضی باشد، به جهت ایثار جناب حق، نه به دلیل رغبت در نعمتی که از این طریق به دست می‌آورند و نه به دلیل فرار از ضد آن در دنیا یا آخرت. بلکه آنان بر آنچه برایشان تشریع شده است، هستند و امر ایشان به دست خداست که هرچه بخواهد انجام دهد؛ حظوظ نفسانی‌شان به خاطرشان خطور نمی‌کند. این کامل‌ترین چیزی است که اراده در مرید واجب می‌کند. و اگر حظی از آن به خاطرشان خطور کند، از حکم اراده خارج نشده‌اند، اما صاحب حظ نفسانی نسبت به اولی، ناقص مقام است، با وجود اینکه صاحب اراده است؛ چنانکه خداوند متعال می‌فرماید: «وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّينَ عَلَى بَعْضٍ» (و به راستی برخی از پیامبران را بر برخی دیگر برتری دادیم)، با اینکه نبوت موجود است، پس با برتری برخی بر برخی دیگر، از نبوت خارج نشده‌اند.\n\nو اما معنای سخن این طایفه درباره اراده (الإرادة) که می‌گویند: «سوز و گدازی است که مرید می‌یابد و میان او و آنچه بر آن بوده و او را از مقصودش محجوب می‌داشته، حائل می‌شود»، صحیح است. جز اینکه امری وجود دارد که معرفت (المعرفة) به خداوند آن را عطا می‌کند؛ هنگامی که علم به خداوند از طریق کشف (الکشف) و تعلیم الهی برای او حاصل شود، دیگر چیزی که بنده به آن متصف باشد و او را از مقصودش محجوب سازد، باقی نمی‌ماند. اگر مقصود او حق (الحق) باشد، او حق را در هر عین و در هر حالی مشاهده می‌کند. و به این مقام نمی‌رسد مگر کسی که خداوند از او راضی باشد. و از نشانه‌های صاحب این مقام، ملازمت با ادب است، مگر اینکه عقلش به سبب این مشاهده از او سلب شود؛ در این صورت، مانند بهلول‌ها و عاقلان دیوانه، مطالبه ادب از او ساقط می‌شود، زیرا امری الهی بر آنان عارض شده که از تحمل آن ناتوان بوده‌اند، پس عقلشان در زمره رفتگان رفته است. حکم آنان نزد خداوند، حکم کسی است که بر حالت شهود (الشهود) و وصف استقامت مرده است. و حکم باقی‌مانده از این حالت او، حکم حیوان است؛ هر آنچه را که حکم طبیعتش از خوردن، نوشیدن، نکاح و سخن گفتن می‌طلبد، بدون هیچ قید و مطالبه‌ای نزد خداوند به دست می‌آورد، با وجود کشف (الکشف) و بقای آن بر ایشان. همان‌طور که برای حیوان و هر جنبنده‌ای، زندگی مرده بر روی تابوت آشکار می‌شود و مرده ناله می‌کند و سعادتمندشان می‌گوید: «مرا پیش ببرید، مرا پیش ببرید» و شقی می‌گوید: «مرا به کجا می‌برید؟» و عذاب قبر را مشاهده می‌کنند و آنچه را که جن و انس نمی‌بینند، می‌بینند. همچنین این کسی که خداوند عقلش را از او گرفته، حکمش حکم حیوان و هر جنبنده‌ای است. و همان‌طور که مرده بر حکم حالتی است که بر آن مرده، این بهلول نیز بر حکم حالتی است که عقلش نزد او رفته است. پس او به سبب رفتن عقلش در زمره مردگان شمرده می‌شود و به سبب طبعش در زمره دوستان (خدا) شمرده می‌شود. او از سعادتمندانی است که خداوند از آنان راضی است، مانند مسعود حبشی و علی کردی و جماعتی که ما آنان را در شام و مغرب در این مرتبه دیدیم و آنان از بندگان خدا بر چنین حالی هستند. خداوند ما را به واسطه آنان بهره‌مند سازد. و هرگاه عقل کسی که حالش چنین است، در حیات دنیا به او بازگردانده شود، از همان لحظه ملازم آداب شرعی می‌شود و آن را در آغوش می‌گیرد. و کسی که خداوند عقلش را بر او باقی گذاشته باشد، نزد این طایفه کامل‌تر و والاتر است.\n\nاز شیخ ابوالسعود بن شبل پرسیده شد: درباره این دیوانگان از اهل الله چه می‌گویی؟ او (رضی الله عنه) پاسخ داد: «آنان نیکو هستند، اما عاقل نیکوتر است.» این اشاره به آن دارد که عنایت به کسی که عقلش بر او باقی مانده، کامل‌تر است.\n\nاین اصلی است که مجموع اقوال اهل الله درباره اراده (الإرادة) که نزد آنان اصطلاح شده، به آن باز می‌گردد. اگرچه عباراتشان متفاوت است، اما آنان یا درباره آن به امری کلی سخن می‌گویند یا به امری جزئی، بر اساس ذوق خود و آنچه در حالشان برایشان ترجیح دارد. زیرا آنان در بیان چیزی از آنچه ذوقشان به آنان می‌دهد، فراتر نمی‌روند و تصنع و تکلف نمی‌کنند. و هیچ چیزی را در تحقیق آن از فکر خود نمی‌گیرند، بلکه گفتارشان از ذوق و وجودشان فراتر نمی‌رود. پس آنان اهل صدق و علم محقق هستند که شبهه‌ای در آن راه ندارد. و کسی که تفکر کند، از آنان نیست؛ او گاهی درست می‌گوید و گاهی خطا می‌کند، و صاحب فکر، صاحب حال و ذوق نیست.\n\nاما اهل اعتبار، برخی از آنان صاحبان ذوق هستند و از روی ذوق، نه از روی فکر، اعتبار می‌کنند. و چه بسا اعتبار از روی فکر باشد، که در این صورت بر بیگانه مشتبه می‌شود و او درباره هر دو می‌گوید که معتبر و از اهل اعتبار است، در حالی که نمی‌داند اعتبار گاهی از فکر و گاهی از ذوق است. و اعتبار در اهل ذوق، اصل است و در اهل فکر، فرع. و صاحب فکر از اهل اراده (الإرادة) نیست، مگر در موضعی که تفکر برای او جایز باشد؛ اگر چیزی باشد که امر مورد تفکر جز از طریق آن (تفکر) حاصل نشود. در این صورت، آن را از باب خود می‌گیرد. و آیا امری بدین مرتبه وجود دارد که نتوان آن را از طریق کشف (الکشف) و وجود (الوجود) به دست آورد یا خیر؟ ما می‌گوییم چنین چیزی وجود ندارد و به طور کلی از تفکر منع می‌کنیم، زیرا برای صاحبش موجب التباس و عدم صدق می‌شود. و هیچ چیزی نیست مگر اینکه جایز است علم به آن از طریق کشف (الکشف) و وجود (الوجود) حاصل شود، و اشتغال به فکر حجاب است. دیگران این را منع می‌کنند، اما هیچ‌یک از اهل طریق خدا آن را منع نمی‌کند، بلکه منع‌کنندگان آن، تنها اهل نظر و استدلال از علمای رسوم هستند که در احوال، ذوقی ندارند. اگر هم در احوال ذوقی داشته باشند، مانند افلاطون الهی از حکما، این در میان این طایفه نادر است. و می‌بینی که نفس او از مخرج نفس اهل کشف (الکشف) و وجود (الوجود) خارج می‌شود. و کسانی از اهل اسلام که او را ناپسند دانسته‌اند، تنها به دلیل نسبت دادن او به فلسفه بوده است، به سبب جهلشان به مدلول این لفظ.\n\nو حکما در حقیقت، دانایان به خداوند و به هر چیزی و منزلت آن شیء معلوم هستند. و خداوند «هُوَ الْحَكِيمُ الْعَلِيمُ» (اوست حکیم دانا). و «وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا» (و به هر کس حکمت داده شود، به راستی خیر فراوانی داده شده است). و حکمت، علم نبوت است، چنانکه درباره داوود (علیه السلام) فرمود که او از کسانی است که خداوند به او ملک و حکمت عطا کرد و فرمود: «وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهُ مِمَّا يَشَاءُ» (و خداوند به او ملک و حکمت داد و از آنچه می‌خواست به او آموخت). و معنای فیلسوف، دوستدار حکمت است، زیرا «سوفیا» در زبان یونانی به معنای حکمت است و گفته شده به معنای محبت است. پس فلسفه به معنای دوست داشتن حکمت است. و هر عاقلی حکمت را دوست دارد. جز اینکه خطای اهل فکر در الهیات بیشتر از صوابشان است، خواه فیلسوف باشد یا معتزلی یا اشعری یا هر صنف دیگری از اهل نظر. فلاسفه تنها به خاطر این اسم مذمت نشده‌اند، بلکه به دلیل خطایی که در علم الهی مرتکب شده‌اند و با آنچه پیامبران (علیهم السلام) آورده‌اند، معارضه دارد، مذمت شده‌اند؛ به سبب حکمشان در نظر خود، بر اساس آنچه فکر فاسد در اصل نبوت و رسالت به آنان داده است. و چرا باید استناد کنند و امر را بر آنان مشوش سازند؟ اگر آنان حکمت را هنگامی که دوستش داشتند، از خداوند می‌طلبیدند نه از راه فکر، در هر چیزی به صواب می‌رسیدند.\n\nو اما غیر فلاسفه از اهل نظر مسلمان، مانند معتزله و اشاعره، اسلام بر آنان سبقت گرفته و بر ایشان حکم کرده است، سپس شروع به دفاع از آن بر اساس آنچه فهمیده‌اند، کرده‌اند. آنان در اصل بر صوابند، اما در برخی فروع به دلیل تأویلاتی که فکر و دلیل عقلی به آنان می‌دهد، خطا می‌کنند؛ زیرا اگر برخی الفاظ شارع را در حق خداوند بر ظاهرشان حمل کنند، که ادله عقول آن را محال می‌داند، نزد آنان کفر خواهد بود، پس آن را تأویل می‌کنند. و ندانسته‌اند که خداوند در برخی از بندگانش نیرویی قرار داده که در برخی امور حکمی خلاف آنچه نیروی عقل می‌دهد، عطا می‌کند و در برخی امور موافق آن است. و این همان مقامی است که خارج از طور عقل است؛ پس عقل به تنهایی قادر به درک آن نیست و به آن ایمان نمی‌آورد مگر زمانی که این نیرو در شخص همراه او باشد. در این صورت، عقل به قصور خود پی می‌برد و می‌داند که آن حق است. زیرا قوا (نیروها) با یکدیگر متفاوتند و بر اساس حقایقی که خداوند بر آن آفریده، حکم می‌دهند. نیروی شنوایی اگر حکم بینایی بر آن عرضه شود، آن را محال می‌داند، و بینایی نیز با سایر قوا چنین است. و عقل از جمله قواست، بلکه از همه قوا بهره می‌گیرد، اما عقل به سایر قوا چیزی نمی‌آموزد.\n\nو کسی که حکم اراده (الإرادة) اصطلاح شده نزد اهل الله برایش صحیح باشد، همه این مقامات و مراتب را از طریق کشف (الکشف) می‌شناسد و صورت خطا در اشیاء را می‌شناسد و می‌داند که خطا در نسبت‌ها و وجوه واقع می‌شود. و هر خطاکاری تنها در نسبت خطا کرده است، زیرا آن را به غیر جهت خود نسبت داده است. پس اهل الله آن نسبت را می‌گیرند و در جایگاه خود قرار می‌دهند و به منسوبش ملحق می‌سازند. و این معنای حکمت است. پس اهل الله از رسولان و اولیا، حکما بر حقیقت هستند و آنان اهل خیر کثیرند. خداوند ما را از اهل اراده (الإرادة) و از کسانی قرار دهد که میان عادت و ترک عادت، از حیث آنچه شهود (الشهود) عطا می‌کند، جمع کرده‌اند. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 3
}