{
  "id": 380,
  "title": {
    "ar": "الباب الثمانون وثلاثمائة في معرفة منزل العلماء ورثة الأنبياء من المقام المحمدي",
    "en": "Chapter Three Hundred and Eighty: Concerning the Knowledge of the Station (منزل) of the Scholars, the Inheritors of the Prophets, derived from the Muhammadan Station (المقام المحمدي).",
    "ur": "باب تین سو اسی: علماء ورثۃ الانبیاء کی منزل کی معرفت کے بیان میں جو المقام المحمدی (المقام المحمدي) سے ہے۔",
    "fa": "باب سیصد و هشتاد در معرفت جایگاه عالمان وارثان انبیا از مقام محمدی."
  },
  "content": {
    "ar": "## «الباب الثمانون وثلاثمائة في معرفة منزل العلماء ورثة الأنبياء من المقام المحمدي»\n\n\n> ما قرة العين إلا قرة النفس *** فانظر إلى كل معنى دس في الحس‏\n\n\n> تجده يا سيدي إن كنت ذا نظر *** في الفصل والنوع بالأحكام والجنس‏\n\n\n> فليس تشهد عيني غيرها أبدا *** والناس من ذاك في شك وفي لبس‏\n\n\n> الطيب والمرأة الحسناء قد اشتركا *** مع المناجاة في المعنى وفي النفس‏\n\n\n> ففي الصلاة وجودي والنساء لنا *** عرش وفي الطيب أنفاس مع الأنس‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حبب إلي من دنياكم ثلاث النساء والطيب وجعلت قرة عيني في الصلاة\n\n\nوقال صَلَّى اللهُ عَليهِ وسَلَّم إن ربكم واحد وإن أباكم واحد فلا فضل لعربي على أعجمي ولا لأعجمي على عربي إلا بالتقوى ثم تلا إِنَّ أَكْرَمَكُمْ عِنْدَ الله أَتْقاكُمْ‏\n\n\nيريد بالأب آدم صَلَّى اللهُ عَليهِ وسَلَّم وهو قوله تعالى خَلَقَكُمْ من نَفْسٍ واحِدَةٍ يعني نفس آدم يخاطب ما تفرع منه‏\n\n\n### [الورث على نوعين معنوي ومحسوس‏]\n\n\nفاعلم أن الورث على نوعين معنوي ومحسوس فالمحسوس منه ما يتعلق بالألفاظ والأفعال وما يظهر من الأحوال فأما الأفعال فإن ينظر الوارث إلى ما كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بفعله مما أبيح للوارث أن يفعله اقتداء به لا مما هو مختص به عليه السلام مخلص له في نفسه ومع ربه وفي عشرته لأهله وولده وقرابته وأصحابه وجميع العالم ويتبع الوارث ذلك كله في الأخبار المروية عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم الموضحة لما كان عليه في أفعاله من صحيحها وسقيمها فيأتيها كلها على حد ما وردت لا يزيد عليها ولا ينقص منها وإن اختلفت فيها الروايات فليعمل بكل رواية وقتا بهذه ووقتا بهذه ولو مرة واحدة ويدوم على الرواية التي ثبتت ولا يخل بما روى من ذلك وإن لم يثبت من جهة الطريق فلا يبالي إلا أن تعلق بتحليل أو تحريم فيغلب الحرمة في حق نفسه فهو أولى به فإنه من أولي العزم وما عدا التحليل أو التحريم فليفعل بكل رواية وإذا أفتى إن كان من أهل الفتيا وتتعارض الأدلة السمعية بالحكم من كل وجه ويجهل التأريخ ولا يقدر على الجمع فيفتي بما هو أقرب لرفع الحرج ويعمل هو في حق نفسه بالأشد فإنه في حقه الأشد وهذا من الورث اللفظي فإنه المفتى به فيصلي صلاة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في ليله ونهاره وعلى كيفيتها في أحوالها وكمياتها في أعدادها ويصوم كذلك ويعامل أهله من مزاح وجد كذلك ويكون على أخلاقه في مأكله ومشربه وما يأكل وما يشرب كأحمد بن حنبل فإنه كان بهذه المثابة روينا عنه أنه ما أكل البطيخ حتى مات وكان يقال له في ذلك فيقول ما بلغني كيف كان يأكله رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وكل ما كان من فعل لم يجد فيه حديثا يبين فيه أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فعله بكيفية خاصة وإن كان من الكميات بكمية خاصة ولكن ورد فيه حديث فاعمل به كصومه صَلَّى اللهُ عَليهِ وسَلَّم كان يصوم حتى نقول إنه لا يفطر ويفطر حتى نقول إنه لا يصوم ولم يوقت الراوي فيه توقيتا فصم أنت كذلك وأفطر كذلك وأكثر من صوم شعبان ولا تتم صوم شهر قط بوجه من الوجوه إلا شهر رمضان وكل صوم أو فعل مأمور به وإن لم يرو\nفيه فعله فاعمل به لأمره وهذا معنى قول الله إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله وما رأينا أحدا ممن رأيناه أو سمعنا عنه عمل على هذا القدم إلا رجل كبير باليمن يقال له الحداد رآه الشيخ ربيع بن محمود المارديني الخطاب وأخبر أنه كان على هذا الحال من الاقتداء أخبرني بذلك صاحبي الخادم عبد الله بدر الحبشي عن الشيخ ربيع فلتتبعه في كل شي‏ء لأن الله يقول لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ ما لم يخصص شيئا من ذلك بنهي عن فعله وقال صَلَّى اللهُ عَليهِ وسَلَّم صلوا كما رأيتمونى أصلي‏\n\n\nوقال في الحج خذوا عني مناسككم‏\n\n\nوإذا حججت فإن قدرت على الهدى فأدخل به محرما بالحج أو العمرة وإن حجت مرة أخرى فأدخل أيضا إن قدرت على الهدى محرما بالحج وإن لم تجد هديا فاحذر أن تدخل محرما بالحج لكن ادخل متمتعا بعمرة مفردة فإذا طفت وسعيت فحل من إحرامك الحل كله ثم بعد ذلك أحرم بالحج وأنسك نسيكة كما أمرت واعزم على أن لا تخل بشي‏ء من أفعاله وما ظهر من أحواله مما أبيح لك من ذلك والتزم آدابه كلها جهد الاستطاعة لا تترك شيئا من ذلك إذا ورد مما أنت مستطيع عليه فإن الله ما كلفك إلا وسعك فابذله ولا تترك منه شيئا فإن النتيجة لذلك عظيمة لا يقدر قدرها وهي محبة الله إياك وقد علمت حكم الحب في المحب وأما الوارث المعنوي فما يتعلق بباطن الأحوال من تطهير النفس من مذام الأخلاق وتحليتها بمكارم الأخلاق وما كان عليه صلى الله عليه وسلم من ذكر ربه على كل أحيانه وليس إلا الحضور والمراقبة لآثاره سبحانه في قلبك وفي العالم فلا يقع في عينك ولا يحصل في سمعك ولا يتعلق بشي‏ء قوة من قواك إلا ولك في ذلك نظر واعتبار إلهي تعلم موقع الحكمة الإلهية في ذلك فهكذا كان حال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيما روت عنه عائشة وكذلك إن كنت من أهل الاجتهاد في الاستنباط للاحكام الشرعية فأنت وارث نبوة شرعية فإنه تعالى قد شرع لك في تقرير ما أدى إليه اجتهادك ودليك من الحكم أن تشرعه لنفسك وتفتي به غيرك إذا سألت وإن لم تسأل فلا فإن ذلك أيضا من الشرع الذي أذن الله لك فيه ما هو من الشرع الذي لم يأذن به الله‏\n\n\n### [أن الاجتهاد ما هو في أن تحدث حكما]\n\n\nواعلم أن الاجتهاد ما هو في أن تحدث حكما هذا غلط وإنما الاجتهاد المشروع في طلب الدليل من كتاب أو سنة وإجماع وفهم عربي على إثبات حكم في تلك المسألة بذلك الدليل الذي اجتهدت في تحصيله والعلم به في زعمك هذا هو الاجتهاد فإن الله تعالى ورسوله ما ترك شيئا إلا وقد نص عليه ولم يتركه مهملا فإن الله تعالى يقول الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وبعد ثبوت الكمال فلا يقبل الزيادة فإن الزيادة في الدين نقص من الدين وذلك هو الشرع الذي لم يأذن به والله ومن الورث المعنوي ما يفتح عليك به من الفهم في الكتاب وفي حركات العالم كله وأما الورث الإلهي فهو ما يحصل لك في ذاتك من صور التجلي الإلهي عند ما يتجلى لك فيها فإنك لا تراه إلا به فإن الحق بصرك في ذلك الموطن ولا يتكرر عليك صورة تجل فقد انتقل عنها وحصل لك نظيرها في ذاتك وفي ملكك ولذلك تقول في الآخرة عموما للشي‏ء إذا أردته كُنْ فَيَكُونُ وفي الدنيا خصوصا فالحق لك في الدنيا محل تكوينك فإنه يتنوع لتنوعك وفي الآخرة تتنوع لتنوعه فهو في الدنيا يلبس صورتك وأنت في الآخرة تلبس صورته فانظر ما أعجب هذا الأمر وكذلك لك في الميراث الإلهي في مراتب العدد فقد يكون الحق رابع ثلاثة فإذا جئت أنت وانضممت إلى الثلاثة فربعتهم لا يكون ذلك لك حتى ينتقل الحق إلى مرتبة الخمسة فيكون خامس أربعة بعد ما قد كان رابع ثلاثة فأخلي لك المرتبة فورثتها وكذلك في كل جماعة تنضم إليها هذا حكم الميراث في الدنيا وأما في ميراث الخصوص وفي الآخرة فإنه رابع أربعة في حال كونك أنت رابع تلك الأربعة فإنك في الدنيا في الخصوص جئت بصورة حق وفي الآخرة كذلك أنت صورة حق ولهذا كفر أي ستر من قال إِنَّ الله ثالِثُ ثَلاثَةٍ فستر نفسه بربه لأنه هو عين ثالث الثلاثة ورأى نفسه حقا لا خلقا إلا من حيث الصورة الجسدية لا من حيث ما هي به موصوفة فهو حق في خلق فستر خلقه بما شهده من الحق القائم به المنصوص عليه في العموم بأنه جميع قوى عبده وصفاته إذا كان من أهل الخصوص فقال عن نفسه إِنَّ الله ثالِثُ ثَلاثَةٍ ثم بين الحق تعالى عقيب هذا القول فقال وما من إِلهٍ إِلَّا إِلهٌ واحِدٌ وهو الذي ثلث الثلاثة فالاثنان من العامة والذي ثلثهم بخلقه هو الثالث خلقا بخلقه ثم إنه قد علم أن الحق جميع قواه وأشهده الحق أنه مع الاثنين مثل ما هو معه إلا أنه حجب عنهم علم ذلك فقالوا بالخلق دون حق فقال هذا الخاص إِنَّ الله ثالِثُ ثَلاثَةٍ لأنه‏\nشاهده فيها كما شاهده في نفسه وهُمْ لا يَشْعُرُونَ فرأى أن الحق جمعهم في صورة ثلاثة فصح قول القائل إنه ثالث ثلاثة في الوجهين في الخلق والحق وصح وما من إِلهٍ إِلَّا إِلهٌ واحِدٌ لأنه عين كل واحد من الثلاثة ليس غيره فهو واحد وهو ثلاثة فهذا من الورث الإلهي النبوي فإنه ما حصل لنا هذا الشهود إلا بالاقتداء والاتباع النبوي فلما علمنا ورثناه صَلَّى اللهُ عَليهِ وسَلَّم ولا يصح ميراث لأحد إلا بعد انتقال الموروث إلى البرزخ وما حصل لك من غير انتقال فليس بورث وإنما ذلك وهب وأعطية ومنحة أنت فيها نائب وخليفة لا وارث فأنت من حيث العلم وارث وأنت من حيث الشهود عينه لا وارث أ لا ترى في‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إن ربكم واحد كما إن أباكم واحد\n\n\nوليس أبوك إلا من أنت عنه فإن عرفت عمن أنت عرفت أباك وما ذكر النبي صَلَّى اللهُ عَليهِ وسَلَّم أن أبوينا اثنان كما وقع في الظاهر فإنا عن آدم وحواء مثل قوله ورَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ ولكن لما كانت حواء عين آدم لأنها عين ضلعه فما كان إلا أب واحد في صورتين مختلفتين كما هو التجلي فعين حواء عين آدم انفصال اليمين عن الشمال وهو عين زيد كذلك انفصال حواء عن آدم فهي عين آدم فما ثم إلا أب واحد فما صدرنا إلا عن واحد كما أن العالم كله ما صدر إلا عن إله واحد فالعين واحدة كثيرة نسب إن لم يكن الأمر كذلك وإلا فما كان يظهر لنا وجود ولا لنا وجود عين ولا لنا إيجاد حكم فكما أوجدنا عينا أوجدنا الحكم له جَزاءً وِفاقاً إن تفطنت فهو لنا موجد عين ونحن له موجد رب‏\n\n\n> فلو لا الحق ما كان الوجود *** ولو لا الكون ما كان إلا له‏\n\n\n> جزاء قد أراد الحق منه *** سؤال السائلين بمن وما هو\n\n\n> فما هو في العموم بغير شك *** وأما في الخصوص فهو وما هوثم ما زال التوالد والتناسل في كل نوع نوع من المولدات كلها في الدنيا ما دامت الدنيا وفي الآخرة إلى ما لا يتناهى وإن تنوعت أحوال التوالد كما ظهر ذلك في الدنيا في حواء وعيسى وبنى آدم وأما في آدم فباليدين وبالأركان وفي النبات متنوع أيضا في غراسه وبزوره وكذلك في المعادن فانظر ما أحكم حكمة الله في خلقه ولما أطلعنا على الوجه الخاص الذي لكل موجود لم يتمكن لنا أن نضيف التوالد لنا جملة واحدة بل أضفنا كل ما ظهر في الكون إليه وهو قوله تعالى وما أَمْرُنا ونحن أمره إِلَّا واحِدَةٌ فما ثم موجد إلا الله تعالى على كل وجه علم ذلك من علمه وجهله من جهله كما يقول الطبيعيون في الموجودات الطبيعية بأحدية الطبيعة فكل ما ظهر من الموجودات الطبيعية قالوا هذا عن الطبيعة فوحدوا الأمر كما وحدنا الإله في خلقه فلم يكن إلا الله وهو الذي سموه أولئك طبيعة ولا علم لهم كما سمته الدهرية بالدهر ولا علم لهم إلا أن الله تسمى لنا بالدهر وما تسمى بالطبيعة لأن الطبيعة ليست بغير لمن وجد عنها عينا فهي عين كل موجود طبيعي ولما كان الحق له هذا الحكم وظهر به عند الخواص من عباده وعلمنا إن الاسم دلالة على المسمى فرأينا الاسم وإن دل فهو أجنبي فعلمنا أن حكم الطبيعة يخالف حكم الدهر فإن الدهر ما هو عين الكوائن ورأينا الطبيعة عين الكوائن الطبيعية ورأينا أن الحق له تنزيه ينفصل به عنا انفصال الدهر عما يكون فيه فتسمى تعالى بالدهر تنزيها وما تسمى بالطبيعة لكون الأمر ما هو غيره بل هو عينه والمسمى لا يسمى نفسه لنفسه فلا يسمى بالطبيعة وإنما يسمى نفسه لغيره حتى إذا ذكره عرف أنه يذكره وإذا ذكر عرفه فهذا أصل وضع الأسماء\n\n\n> فما ثم إلا الله لا شي‏ء غيره *** وما ثم إلا اثنان والله ثالث‏\n\n\n> قد انتجه العلم الذي قاله لنا *** فإني لعلمي بالحقيقة حارث‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nفقدم معرفة الإنسان نفسه لأنه عين الدليل ولا بد أن يكون العلم بالدليل مقدما على العلم بالمدلول والدليل نحن ونحن في مقام الشفعية فلذلك عبرنا بالاثنين لوجود الشفع فنتج لنا النظر فينا وجود الحق وأحديته فهو ثالث اثنين كما هو رابع ثلاثة فلذلك قلنا والله ثالث لهذين الاثنين وأنا حارث أي كاسب لهذا العلم بالنظر ثم إن للحق ورثا منا كما قال إِنَّا نَحْنُ نَرِثُ الْأَرْضَ ومن عَلَيْها عينا وحكما فأما في العين فقوله وإِلَيْنا تُرْجَعُونَ فإن الأمور ترجع إلى أصولها كما ينعطف آخر الدائرة على أولها فمن أول ما تبتدئ بالدائرة\nإنما يطلب بذلك الرجوع إلى أصلها وهو بدؤها فإليه تنتهي فنحن لا نعلم شيئا إلا به فورث منا هذه الصفة فقال تعالى ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ كما نظرنا نحن حتى علمنا فما خلص لنا هذا الوصف من غير مشاركة فعلمنا أن علمنا عن النظر والاستدلال بما علمناه أنه هو العالم به من حيث إن نظرنا لم يكن بنا لأنه قال إنه عين صفتنا التي بها ننظر ونبصر ونسمع ونبطش وهذا كله هو علم الأنبياء الذين ورثناهم لأنهم ما ورثونا إلا العلم على الحقيقة وهو أشرف ما يورث ثم انظر في‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم العلماء ورثة الأنبياء\n\n\nفعم الألف واللام فيهما كل عالم وكل مخبر ولا شك أن كل مخبر فإنه متصور لما يخبر به وكل سامع ذلك الخبر فقد علمه أي علم ما تصوره ذلك المخبر سواء كان كذبا ذلك الخبر أو صدقا فهو ورث بلا شك أ لا تراه‏\n\n\nص قد قال من حدث بحديث يرى أنه كذب فهو أحد الكاذبين‏\n\n\nلأنه قد ورث منه الكذب وصار حكمه حكم الكاذب كما صار حكم الوارث في المال حكم من مات عنه وخلفه ولما عمم بالألف واللام العلماء دخل فيه قوله حَتَّى نَعْلَمَ ولما عمم بالألف واللام الأنبياء دخل فيه كل مخبر بنطق أو بحال لأنه من ظهر لعينك بعد أن لم يكن ظاهرا فقد أخبرك بظهوره أنه ظهر لك حتى لو قال لك قد ظهرت لك لم يفدك علما بظهوره وإنما أفادك علما بقوله لك أي من أجلك ظهر لعينك فالمفهوم الأول القرب الظاهر النازل منزلة النص عند أهل الظاهر أن العلماء ورثة الأنبياء الذين هم المخبرون عن الله وبالمفهوم الثاني الذي لا يقدح فيه المفهوم الأول إن العلماء ورثة المخبرين بما أخبروا به كانوا من كانوا لكن العلم الموروث من الأنبياء عليه السلام ليس هو العلم الذي يستقل بإدراكه العقول والحواس دون الأخبار فإن ذلك لا يكون وراثة وإنما الذي يرثه العلماء من الأنبياء ما لا تستقل العقول من حيث نظرها بإدراكه وأما ما ورثته من الأنبياء من العلم الإلهي فهو ما تحلئة العقول بأدلتها وأما ما تجوزه العقول فتعين لها الأنبياء أحد الجائزين مثل قول إبراهيم ولكِنْ لِيَطْمَئِنَّ قَلْبِي وأما العلم الذي ترثه من الأنبياء عليه السلام من علم الأكوان فعلم الآخرة ومال العالم لأن ذلك كله من قبيل الإمكان فالأنبياء تعين عن الله إن بعض الممكنات على التعيين هو الواقع فيعلمه العالم فذلك ورث نبوي لم يكن يعلمه قبل إخبار هذا النبي به وما عدا هذا فما هو علم موروث إلا في حق العامي الذي ما وفى عقله حقه فتلقى من النبي علما بما لو نظر فيه بعقله أدركه كتوحيد الله ووجوده وبعض ما يتعلق به من حكم الأوصاف والأسماء فيكون ذلك في حق من لم يعلمه إلا من طريق النبي علم موروث وإنما قلنا فيه إنه علم لأن الأنبياء لا تخبر إلا بما هو الأمر عليه في نفسه فإنهم معصومون في أخبارهم عن الله أن يقولوا ما ليس هو الأمر عليه في نفسه بخلاف غير الأنبياء من المخبرين من عالم وغير عالم فإن العالم قد يتخير فيما ليس بدليل أنه دليل فيخبر بما أعطاه ذلك الدليل ثم يرجع عنه بعد ذلك فلهذا لا ينزل في درجة العلم منزلة النبي صَلَّى اللهُ عَليهِ وسَلَّم وقد يخبر بالعلم على ما هو عليه في نفس الأمر ولكن لا يتعين على الحقيقة لما ذكرناه من دخول الاحتمال فيه وكذلك غير العالم من العوام فقد يصادفون العلم وقد لا يصادفونه في أخبارهم والنبي صَلَّى اللهُ عَليهِ وسَلَّم ليس كذلك فإذا أخبر عن أمر من جهة الله فهو كما أخبر فالمحصل له عالم بلا شك كما إن ذلك الخبر علم بلا شك فلذلك قيد صَلَّى اللهُ عَليهِ وسَلَّم إن العلماء هم ورثة الأنبياء لأنهم إذا قبلوا ما قاله الرسول فقد علموا الأمر على ما هو عليه ومن وراثته صَلَّى اللهُ عَليهِ وسَلَّم حب النساء والطيب وجعلت قرة عينه في الصلاة ولكن إذا كان ذلك في الإنسان محببا إليه حينئذ يكون وارثا وأما إن أحب ذلك من غير تحبب فليس بوارث فإن العبد لما كان مخلوقا لله لا لغيره كما قال تعالى وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فما خلقهم إلا لعبادته وقال لموسى في الاثنتي عشرة كلمة يا ابن آدم خلقتك من أجلي‏\n\n\nالحديث ثم إن الله في ثاني حال من العبد حبب إليه أمرا ما أكثر من غيره وبقي الكلام فيمن حببه إليه هل حببه إليه طبع أو طمع أو حذر أو حببه إليه الله فإن‏\n\n\nالنبي صَلَّى اللهُ عَليهِ وسَلَّم قال حبب إلي‏\n\n\nولم يقل من حببه كما قال الله في حق المؤمنين ولكِنَّ الله حَبَّبَ إِلَيْكُمُ الْإِيمانَ وزَيَّنَهُ في قُلُوبِكُمْ وكَرَّهَ إِلَيْكُمُ الْكُفْرَ والْفُسُوقَ والْعِصْيانَ والنبي صَلَّى اللهُ عَليهِ وسَلَّم ما عدل إلى قوله حبب ولم يذكر من حببه إلا لمعنى لا يمكن إظهاره لضعف النفوس القابلة فالعارفون بالمواطن يعلمون من حيث ما ذكره الله والنساء والطيب وجعل قرة العين في الصلاة لأنه مصل على شهود من وقف يناجيه بين يديه‏\nمن حضرة التمثيل وموطنه لأن فيه خطابا وردا وقبولا ولا يكون ذلك إلا في شهود التمثيل فإنه في موطن يجمع بين الشهود والكلام ولما كانت المناسبات تقتضي ميل المناسب إلى المناسب كان الذي حبب عين المناسب والمناسبة قد تكون ذاتية وعرضية ولما كان النساء محل التكوين وكان الإنسان بالصورة يقتضي أن يكون فعالا ولا بد له من محل يفعل وفيه ويريد لكماله أن لا يصدر عنه إلا الكمال كما كان في الأصل الذي أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ وهو كمال ذلك الشي‏ء ولا أكمل من وجود الإنسان ولا يكون ذلك إلا في النساء اللاتي جعلهن الله محلا والمرأة جزء من الرجل بالانفعال الذي انفعلت عنه فحبب إلى الكامل النساء ولما كانت المرأة كما ذكرت عين ضلع الرجل فما كان محل تكوين ما كون فيها إلا نفسه فما ظهر عنه مثله إلا في عينه ونفسه فانظر ما أعجب هذا الأمر فمن حصل له مثل هذا العلم فقد ورث النبي عليه السلام في هذا التحبب بهذا الوجه وأما الطيب فإنه من الأنفاس والأنفاس رحمانية\n\n\nفإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول إني لأجد نفس الرحمن‏\n\n\nفأضافه إلى الرحمن والله يقول والطَّيِّباتُ لِلطَّيِّبِينَ والطَّيِّبُونَ لِلطَّيِّباتِ ومن أسمائه تعالى الطيب فعلمنا أن النفس الطيب لا يكون إلا من الاسم الطيب وما ثم اسم أطيب للكون من الرحمن فإنه مبالغة في الرحمة العامة التي تعم الكون أجمعه فمن حصل له الطيب في كل شي‏ء وإن أدركه من أدركه خبيثا بالطبع فإنه بالنعت الإلهي طيب وقد ذقنا ذلك بمكة فهو وارث على الحقيقة وما حبب إليه الصلاة إلا لما فيها من الجمع بين الشهود والكلام‏\n\n\nبقوله جعلت قرة عيني في الصلاة\n\n\nوما تعرض لسمعه ولا للكلام لأن ذلك معروف في العموم إن الصلاة مناجاة بقوله يقول العبد كذا فيقول الله كذا وإنها منقسمة بين الله وبين عبده المصلي نصفين كما ورد في الحديث وما كانت الصلاة كبيرة إلا على غير المشاهد وعلى من لم يسمع قول الحق مجيبا لما يقوله العبد في صلاته ثم نيابته في قوله سمع الله لمن حمده من أتم المقامات فإن الله ما عظم الإنسان الكامل على من عظمه إلا بالخلافة ولما كان مقامه عظيما لذلك وقع الطعن فيه ممن وقع لعظيم المرتبة وما علم الطاعن ما أودع الله في النشأة الإنسانية من الكمال الإلهي فلو تقدم لذلك الطاعن العلم ما طعن فلما كانت الخلافة وهي النيابة عن الحق بهذه المنزلة وكان المصلي نائبا في سمع الله لمن حمده الذي لا يكون إلا في الصلاة كانت مرتبة الصلاة عظيمة فحببت إليه صَلَّى اللهُ عَليهِ وسَلَّم فمن رأيته يحب الصلاة على هذا الحد فهو وارث ومن رأيته يحبها لغير هذا الشهود فليس بوارث وفي هذا المنزل من العلوم علم صدور الكثير من الواحد أعني أحدية الكثرة لا أحدية الواحد وعلم النكاح الإلهي والكوني وعلم النتائج والمقدمات وعلم مفاضلة النكاح لأنه قد يراد لمجرد الالتذاذ وقد يراد للتناسل وقد يراد لهما وعلم الوصايا وعلم التقاسيم وعلم المبادرة خوف الفوت وعلم الخلطاء وعلم الهبات وعلم ما يعتبر من طيب النفوس وعلم التصرف بالمعروف وما هو المعروف وعلم الأمانات وعلم الحظوظ وعلم الحقوق وعلم ما ينبغي أن يقدم وما ينبغي أن يؤخر وعلم الحدود وعلم الطاعة والمعصية وعلم الشهادات والأقضية وعلم العشائر وهي الجماعة التي ترجع إلى عقد واحد كعقد العشرة ولهذا سمي الزوج بالعشير لأن اجتماع الزوجين كان عن عقد والمعاشرة الصحبة فالعشائر الأصحاب والمرء على دين خليله فقد عقد معه على ما هو عليه وحينئذ يكون قد عاشره قال تعالى وعاشِرُوهُنَّ بِالْمَعْرُوفِ أي صاحبوهن بما يعرف أنه يدوم بينكما الصحبة به والمعاشرة وعلم العزة والمنع وعلم صنوف التجارات وعلم فضل الرجل على المرأة بما ذا كان وما الكمال الذي تشارك فيه المرأة الرجل وعلم أصحاب الحقوق وعلم التقديس وعلم العناية الإلهية وعلم مراتب الخلفاء وعلم ما حقيقة الايمان وعلم المعيبات وعلم ما يرغب فيه ويتمنى تحصيله وعلم الموت وعلم ما هو لله وللخلق وعلم الفرق بين نصيب الحسنة ونصيب السيئة وعلم التوقيت وما يوقت مما لا يدخله التوقيت وعلم حرمة المؤمن ومكانته وعلم الهجرة وعلم إيمان الايمان وعلم الرفق وعلم السر والجهر وعلم ما يجتمع فيه الملك مع الكامل من البشر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وهو عَلى‏ ما نَقُولُ وَكِيلٌ‏\n\n",
    "en": "Chapter 380: Concerning the Station of the Scholars, the Heirs of the Prophets, within the Muhammadan Station (المقام المحمدي)\n\nThe delight of the eye (قرة العين) is only the delight of the soul (قرة النفس);\nSo look closely at every meaning concealed within the senses.\n\nYou will find it, O my master, if you possess insight,\nIn the differentiation (الفصل) and the species (النوع), through the rulings (الأحكام) and the genus (الجنس).\n\nMy eye never witnesses anything other than that [meaning],\nYet people remain in doubt and confusion concerning it.\n\nPerfume (الطيب) and the beautiful woman share,\nAlong with the intimate converse (المناجاة), in the meaning and the spirit (النفس).\n\nIn the Prayer (الصلاة) is my existence (وجودي), and women are a Throne (عرش) for us,\nAnd in perfume are breaths (أنفاس) accompanied by intimacy (الأنس).\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"Three things from your world have been made beloved to me: women, perfume, and the delight of my eye (قرة عيني) has been placed in the Prayer (الصلاة).\"\n\nAnd he, may Allah bless him and grant him peace, said: \"Indeed, your Lord is One, and your father is one. There is no superiority for an Arab over a non-Arab, nor for a non-Arab over an Arab, except by piety (التقوى).\" Then he recited: <<إِنَّ أَكْرَمَكُمْ عِنْدَ الله أَتْقاكُمْ>> (Indeed, the most noble of you in the sight of Allah is the most righteous of you).\n\nBy \"father,\" he means Adam, may Allah bless him and grant him peace, which is confirmed by the Almighty’s saying: <<خَلَقَكُمْ من نَفْسٍ واحِدَةٍ>> (He created you from a single soul), meaning the soul of Adam, addressing those who branched off from him.\n\n### [Inheritance is of Two Types: Spiritual and Sensory]\n\nKnow that inheritance (الورث) is of two types: spiritual (معنوي) and sensory (محسوس). The sensory type relates to words, actions, and manifest states (الأحوال).\n\nAs for actions (الأفعال), the heir (الوارث) must observe what the Messenger of Allah, may Allah bless him and grant him peace, used to do—those actions which are permissible for the heir to perform in emulation of him—but not those actions specific to the Prophet, peace be upon him, which were reserved for him in his own person, with his Lord, and in his dealings with his family, children, relatives, companions, and the entire world. The heir follows all of this through the narrations (الأخبار المروية) transmitted from the Messenger of Allah, may Allah bless him and grant him peace, which clarify his actions, both sound and weak. He performs all of them exactly as they were reported, neither adding to them nor subtracting from them. If the narrations differ, he should act upon every narration, practicing one at one time and the other at another time, even if only once, while adhering primarily to the narration that is established (ثبتت). He should not neglect what has been narrated, even if its chain of transmission is not established, unless it pertains to permissibility (تحليل) or prohibition (تحريم). In that case, he should prioritize the prohibition for himself, as this is characteristic of the people of resolve (أولي العزم). Regarding matters other than permissibility or prohibition, he should act upon every narration.\n\nIf he issues a legal ruling (فتيا)—should he be qualified to do so—and the textual proofs (الأدلة السمعية) conflict in every aspect, and the chronology is unknown, and reconciliation is impossible, he should issue the ruling that is closest to removing hardship (رفع الحرج). However, for himself, he should act upon the stricter ruling (الأشد), for that is the more rigorous path for him. This is part of the verbal inheritance (الورث اللفظي), as it is the basis for the ruling.\n\nThus, he prays the Prayer (الصلاة) of the Messenger of Allah, may Allah bless him and grant him peace, by night and day, following its manner in its states and its quantity in its numbers. He fasts likewise, and treats his family with the same mix of jest and seriousness. He adopts his character (أخلاقه) in his eating and drinking, and in what he eats and drinks, like Ahmad ibn Hanbal, who was at this level. It is narrated about him that he never ate watermelon until he died. When asked about it, he would say, \"I have not received a report detailing how the Messenger of Allah, may Allah bless him and grant him peace, used to eat it.\"\n\nRegarding any action for which he finds no hadith specifying that the Messenger of Allah, may Allah bless him and grant him peace, performed it in a particular manner or quantity, but a hadith concerning it has been reported, he should act upon it. For example, the Prophet, may Allah bless him and grant him peace, would fast until one would say he would never break his fast, and he would break his fast until one would say he would never fast, and the narrator did not specify a time limit (توقيتا). You should fast likewise and break your fast likewise, and increase your fasting in Sha'ban, but never complete the fast of any month fully, except the month of Ramadan.\n\nAny fast or action that is commanded, even if his performance of it is not narrated, should be performed because of the command. This is the meaning of Allah’s saying: <<إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله>> (If you love Allah, then follow me, [and] Allah will love you). We have not seen or heard of anyone who acted upon this footing except for an elderly man in Yemen called Al-Haddad, whom Shaykh Rabi’ ibn Mahmud al-Mardini al-Khattab saw and reported that he was in this state of emulation (الاقتداء). My companion, the servant Abdullah Badr al-Habashi, informed me of this from Shaykh Rabi’.\n\nYou must follow him in everything, for Allah says: <<لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ>> (Indeed, in the Messenger of Allah you have an excellent example), provided that nothing of that has been specified by a prohibition against performing it. And he, may Allah bless him and grant him peace, said: \"Pray as you have seen me praying.\"\n\nAnd concerning the Hajj, he said: \"Take from me your rituals (مناسككم).\"\n\nIf you perform Hajj, and you are able to offer the sacrifice (الهدى), then enter *ihram* for Hajj or Umrah with it. If you perform Hajj again, enter *ihram* for Hajj with the sacrifice if you are able. If you cannot find a sacrifice, beware of entering *ihram* for Hajj, but enter as one performing *Tamattu'* with a singular Umrah. When you have performed the circumambulation (Tawaf) and the running (Sa’y), then exit your state of *ihram* completely. After that, enter *ihram* for Hajj and perform your ritual as commanded.\n\nResolve not to neglect any of his actions or manifest states (أحواله) that are permissible for you. Adhere to all his manners (آدابه) to the best of your ability. Do not abandon anything of that which has been reported and which you are capable of performing, for Allah has only burdened you with what is within your capacity. So expend that capacity and leave nothing of it, for the result of this is immense, its value cannot be estimated, and that is the love of Allah for you. And you know the ruling of love upon the lover.\n\nAs for the spiritual heir (الوارث المعنوي), this relates to the inner states (باطن الأحوال): purifying the soul (النفس) from blameworthy traits and adorning it with noble character (مكارم الأخلاق), and the constant remembrance of his Lord that the Prophet, may Allah bless him and grant him peace, maintained in all his states. This is nothing but Presence (الحضور) and Contemplation (المراقبة) of His traces (آثاره), glory be to Him, in your heart and in the cosmos (العالم). Nothing should fall into your sight, nor reach your hearing, nor be connected to any of your faculties, except that you have a divine consideration (اعتبار إلهي) and reflection upon it, learning the location of the Divine Wisdom (الحكمة الإلهية) within it. This was the state of the Messenger of Allah, may Allah bless him and grant him peace, as reported by Aisha.\n\nLikewise, if you are among the people of independent legal reasoning (الاجتهاد) in deriving Sharia rulings (الأحكام الشرعية), you are an heir of the legislative prophecy (نبوة شرعية). For the Almighty has legislated for you, in establishing the ruling reached by your *ijtihad* and your proof, that you may legislate it for yourself and issue it as a *fatwa* to others if you are asked, but not if you are not asked. This is also part of the legislation (الشرع) that Allah has permitted you, as opposed to the legislation that Allah has not permitted.\n\n### [That Ijtihad is not about creating a ruling]\n\nKnow that *Ijtihad* is not about creating a ruling (تحدث حكما)—this is an error. Rather, the sanctioned *Ijtihad* is the search for the proof (الدليل) from the Book, the Sunnah, consensus, and Arabic understanding, in order to establish a ruling already present in that issue by means of that proof which you strove to acquire and know, in your estimation. This is *Ijtihad*.\n\nFor Allah the Almighty and His Messenger left nothing unaddressed; they have provided a text for everything and did not leave it neglected. Allah the Almighty says: <<الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ>> (This day I have perfected for you your religion). After the establishment of perfection, no addition is accepted, for addition to the religion is a deficiency (نقص) in the religion, and that is the legislation Allah has not permitted.\n\nPart of the spiritual inheritance (الورث المعنوي) is the unveiling (يفتح عليك به) of understanding regarding the Book and the movements of the entire cosmos.\n\nAs for the Divine Inheritance (الورث الإلهي), it is what manifests in your Essence (ذاتك) from the forms of the Divine Theophany (صور التجلي الإلهي) when He discloses Himself to you within them. You only see Him through Him, for the Real (الحق) is your sight in that station. The form of the theophany does not repeat; He has moved on from it, and its counterpart (نظيرها) has been attained in your essence and your dominion (ملكك).\n\nThat is why, in the Hereafter, you generally say to a thing you desire, <<كُنْ فَيَكُونُ>> (Be, and it is). In this world, it is specific. The Real is the locus of your formation (محل تكوينك) in this world, diversifying according to your diversification. In the Hereafter, you diversify according to His diversification. In this world, He wears your form, and you, in the Hereafter, wear His form. Look at how wondrous this matter is!\n\nLikewise, in the Divine Inheritance, regarding the ranks of number, the Real may be the fourth of three (رابع ثلاثة). When you arrive and join the three, making them four, this rank is not yours until the Real moves to the rank of five, becoming the fifth of four (خامس أربعة) after having been the fourth of three. He vacates the rank for you, and you inherit it. This is the ruling of inheritance in this world for every group you join.\n\nAs for the inheritance of particularity (ميراث الخصوص) and in the Hereafter, He is the fourth of four while you are also the fourth of those four. This is because, in the particularity of this world, you came in the form of the Real (صورة حق), and in the Hereafter, you are likewise a form of the Real.\n\nThis is why the one who said <<إِنَّ الله ثالِثُ ثَلاثَةٍ>> (Indeed, Allah is the third of three) committed *kufr*—meaning he veiled the truth. He veiled himself by his Lord because he is the very essence of the third of the three. He saw himself as the Real (حقا), not as creation (خلقا), except in terms of the physical form. He is the Real in creation, so he veiled his creation by witnessing the Real subsisting in him, which is generally stated to be all the powers and attributes of His servant when that servant is among the people of particularity (أهل الخصوص).\n\nThis special person said concerning himself, \"Indeed, Allah is the third of three.\" Then the Real Almighty clarified immediately after this statement, saying: <<وما من إِلهٍ إِلَّا إِلهٌ واحِدٌ>> (There is no god except one God). He is the One who made the three into three. The two are from the common people, and the one who made them three by His creation is the third, created by His creation. Then, he knew that the Real is all his powers, and the Real showed him that He is with the two just as He is with him, except that the knowledge of this was veiled from them, so they spoke of creation (الخلق) without the Real (الحق). This special person said, \"Indeed, Allah is the third of three,\" because he witnessed Him in them just as he witnessed Him in himself, while <<وَهُمْ لا يَشْعُرُونَ>> (they perceive not). He saw that the Real gathered them in the form of three. Thus, the statement of the speaker that He is the third of three is correct in both aspects: creation and the Real. And the statement <<وما من إِلهٍ إِلَّا إِلهٌ واحِدٌ>> (There is no god except one God) is correct because He is the essence of every single one of the three; He is not other than them. He is One, yet He is Three.\n\nThis is part of the Divine Prophetic Inheritance, for this witnessing (الشهود) was only achieved through prophetic emulation (الاقتداء) and following (الاتباع). When we knew this, we inherited it from the Prophet, may Allah bless him and grant him peace.\n\nInheritance is not valid for anyone unless the inherited person has transitioned to the Isthmus (البرزخ). What you receive without this transition is a gift (وهب), a grant (أعطية), or a boon (منحة), making you a deputy (نائب) or successor (خليفة), not an heir (وارث). You are an heir in terms of Knowledge (العلم), but in terms of Witnessing (الشهود), you are His very essence (عينه), not an heir.\n\nDo you not see in his saying, may Allah bless him and grant him peace: \"Indeed, your Lord is One, just as your father is One\"?\n\nYour father is only that from which you originate. If you know your origin, you know your father. The Prophet, may Allah bless him and grant him peace, did not mention that our parents are two, as appears outwardly—for we originate from Adam and Eve—like His saying: <<ورَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ>> (He raised his parents upon the Throne). However, since Eve is the essence of Adam (عين ضلعه), there was only one father in two different forms (صورتين مختلفتين), just like the Theophany (التجلي). The essence of Eve is the essence of Adam, a separation of the right from the left, just as the separation of Eve from Adam is the essence of Adam. Thus, there is only one father, and we originated only from One, just as the entire cosmos originated only from one God (إله واحد). The Essence (العين) is One, with many relations. If this were not the case, our existence (وجود) would not appear, nor would we possess an essential existence, nor would we establish a ruling. Just as He brought us into essential existence, He established the ruling for us, <<جَزاءً وِفاقاً>> (a fitting recompense). If you understand this, He is the originator of our essence, and we are the originator of His Lordship (موجد رب).\n\nWere it not for the Real (الحق), Existence (الوجود) would not be;\nAnd were it not for the Cosmos (الكون), He alone would be.\n\nA recompense the Real desired from it:\nThe questioning of the seekers regarding Who and What He is.\n\nSo what He is, in generality, is without doubt;\nBut as for particularity (الخصوص), He is what He is, and what He is not.\n\nFurthermore, procreation (التوالد والتناسل) continues in every species of all generated things in this world, as long as the world lasts, and in the Hereafter, to infinity, even if the modes of procreation vary, as appeared in this world in Eve, Jesus, and the Sons of Adam. As for Adam, he was created by the Two Hands and the Pillars. In plants, procreation is also varied in their planting and their seeds, and likewise in minerals. Look at how perfectly Allah’s Wisdom (حكمة الله) is established in His creation.\n\nSince we were informed of the specific aspect (الوجه الخاص) of every existent thing, we cannot attribute procreation to ourselves universally. Rather, we attribute everything that appears in the cosmos to Him, which is His saying: <<وما أَمْرُنا ونحن أمره إِلَّا واحِدَةٌ>> (And Our command—and We are His command—is but one).\n\nThere is no originator (موجد) except Allah the Almighty in every aspect, whether known by those who know it or ignored by those who ignore it. This is similar to what the naturalists (الطبيعيون) say regarding natural existents, affirming the oneness of Nature (أحدية الطبيعة). Everything that appears from natural existents, they say, is from Nature. Thus, they unified the matter, just as we unified the Godhead (الإله) in His creation.\n\nThere was nothing but Allah, whom those people called Nature without true knowledge, just as the Materialists (الدهرية) called Him Time (الدهر) without true knowledge. However, Allah named Himself Time (الدهر) for us, but He did not name Himself Nature (الطبيعة), because Nature is not other than the existent things that originated from it; rather, it is the essence (عين) of every natural existent.\n\nSince the Real possesses this ruling and manifests through it to His special servants (الخواص), and we know that the Name (الاسم) is an indication of the Named (المسمى), we saw the Name, and even if it indicates, it is foreign. Thus, we knew that the ruling of Nature contradicts the ruling of Time, for Time is not the essence of the created things (الكوائن). We saw that Nature is the essence of the natural created things. We saw that the Real possesses a transcendence (تنزيه) by which He is separated from us, just as Time is separated from what occurs within it. Thus, He named Himself Time (الدهر) in transcendence, but He did not name Himself Nature, because the matter is not other than Him; rather, He is its essence. The Named does not name Himself for Himself, but names Himself for others so that when they mention Him, they know they are mentioning Him, and when He is mentioned, they know Him. This is the origin of the placement of Names.\n\nThere is nothing there but Allah, and nothing other than Him;\nYet there are only two, and Allah is the third.\n\nThis was produced by the Knowledge He spoke to us;\nFor I am, by my knowledge of the Reality (الحقيقة), a cultivator (حارث).\n\nHis saying, may Allah bless him and grant him peace: \"Whoever knows his self (نفسه) knows his Lord.\"\n\nHe prioritized the knowledge of the human self because it is the very essence of the proof (عين الدليل). Knowledge of the proof must precede knowledge of the proven (المدلول). We are the proof, and we are in the station of pairing (مقام الشفعية). Therefore, we expressed ourselves as \"two\" due to the existence of the pair (الشفع). Our contemplation of ourselves resulted in the existence and oneness (أحديته) of the Real. He is the third of two, just as He is the fourth of three. Therefore, we said, \"Allah is the third of these two,\" and \"I am a cultivator (حارث),\" meaning a seeker/acquirer of this knowledge through contemplation.\n\nFurthermore, the Real also inherits from us, as He said: <<إِنَّا نَحْنُ نَرِثُ الْأَرْضَ ومن عَلَيْها>> (Indeed, We are the ones who inherit the earth and whoever is upon it), essentially and legally.\n\nAs for the inheritance in essence (العين), this is His saying: <<وإِلَيْنا تُرْجَعُونَ>> (And to Us you will be returned). Things return to their origins, just as the end of a circle bends back toward its beginning. The very beginning of the circle is sought only to return to its origin, which is its start, and to Him it ends.\n\nWe know nothing except through Him. So, He inherited this attribute from us, saying: <<ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know), just as we contemplated until we knew. This attribute was not perfected for us without His participation. We know that our knowledge comes from contemplation and inference, based on the fact that He is the Knower of it, since our contemplation was not by ourselves, for He said that He is the essence of our attributes by which we look, see, hear, and strike.\n\nAll of this is the knowledge of the Prophets (الأنبياء) whom we inherited, for they bequeathed to us nothing but true Knowledge (العلم على الحقيقة), which is the noblest thing to inherit.\n\nThen look at his saying, may Allah bless him and grant him peace: \"The scholars (العلماء) are the heirs of the Prophets (الأنبياء).\"\n\nThe definite article (ال) generalizes both terms to include every scholar and every informant (مخبر). There is no doubt that every informant conceptualizes what he reports, and every listener knows what the informant conceptualized, whether the report is false or true. This is undoubtedly inheritance. Do you not see that he, may Allah bless him and grant him peace, said: \"Whoever narrates a hadith which he knows to be false is one of the two liars\"? Because he inherited the falsehood from him, and his ruling became the ruling of the liar, just as the heir's ruling regarding wealth becomes the ruling of the deceased who left it behind.\n\nSince the definite article generalized \"scholars,\" it includes the concept of <<حَتَّى نَعْلَمَ>> (until We know). Since it generalized \"Prophets,\" it includes every informant, whether by speech or state (حال), because whoever appears to your sight after not having been apparent has informed you by his appearance that he has appeared to you. Even if he were to say to you, \"I have appeared to you,\" it would not benefit you with knowledge of his appearance; rather, it would benefit you with knowledge of his saying to you, i.e., for your sake, he appeared to your sight.\n\nThe first meaning, which is the apparent proximity that takes the place of a textual ruling (نص) for the people of the apparent, is that the scholars are the heirs of the Prophets who inform about Allah. The second meaning, which does not contradict the first, is that the scholars are the heirs of informants regarding what they reported, whoever they may be.\n\nHowever, the knowledge inherited from the Prophets, peace be upon them, is not that which intellects and senses can grasp independently of revelation (الأخبار), for that is not inheritance. Rather, what scholars inherit from the Prophets is what intellects cannot grasp through their own contemplation. As for the Divine Knowledge that intellects can deduce through their proofs, the Prophets specify for them one of the two possibilities that intellects deem permissible, such as the saying of Abraham: <<ولكِنْ لِيَطْمَئِنَّ قَلْبِي>> (But [I ask] so that my heart may be assured).\n\nAs for the knowledge of the cosmos (علم الأكوان) that you inherit from the Prophets, peace be upon them, it is the knowledge of the Hereafter and the destiny of the world (مال العالم), for all of that is in the realm of possibility (الإمكان). The Prophets specify, by Allah's command, which of the possibilities will occur, and the scholar learns this. That is prophetic inheritance, which he did not know before the Prophet informed him of it.\n\nAnything other than this is not inherited knowledge, except in the case of the common person (العامي) whose intellect has not fulfilled its right, so he receives from the Prophet knowledge that he could have grasped through his own intellect, such as the Oneness of God, His existence, and some rulings related to the Attributes (الصفات) and Names (الأسماء). This knowledge is inherited for the one who only learned it through the Prophet. We only called it knowledge because the Prophets only report what the matter truly is in itself, for they are infallible (معصومون) in their reports about Allah from saying what is not the case in itself. This is unlike other informants, whether scholars or not. The scholar may choose as a proof what is not a proof, and thus report what that proof yielded, only to retract it later. For this reason, he does not reach the rank of the Prophet, may Allah bless him and grant him peace, in the degree of knowledge. He may report the knowledge as it is in reality, but it is not definitively established due to the possibility of error mentioned. Likewise, the non-scholar among the common people may or may not happen upon the truth in their reports.\n\nThe Prophet, may Allah bless him and grant him peace, is not like that. If he reports a matter from Allah, it is exactly as he reported. Therefore, the one who acquires this knowledge is undoubtedly a scholar, just as that report is undoubtedly knowledge. For this reason, he, may Allah bless him and grant him peace, stipulated that the scholars are the heirs of the Prophets, because when they accept what the Messenger said, they know the matter as it truly is.\n\nPart of his inheritance, may Allah bless him and grant him peace, is the love of women and perfume, and the delight of his eye being placed in the Prayer. However, this is only inheritance if it is *made* beloved (محببا إليه) to the person. If he loves it without it being made beloved, he is not an heir. Since the servant was created for Allah and not for other than Him, as the Almighty said: <<وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me), He created them only for His worship. And He said to Moses in the twelve words: \"O son of Adam, I created you for My sake.\"\n\nThen, in a second state of the servant, Allah made something beloved to him more than others. The discussion remains concerning who made it beloved to him: was it made beloved by nature (طبع), by desire (طمع), by caution (حذر), or was it made beloved by Allah? The Prophet, may Allah bless him and grant him peace, said, \"made beloved to me\" (حبب إلي), and did not mention who made it beloved, unlike Allah’s statement concerning the believers: <<ولكِنَّ الله حَبَّبَ إِلَيْكُمُ الْإِيمانَ وزَيَّنَهُ في قُلُوبِكُمْ وكَرَّهَ إِلَيْكُمُ الْكُفْرَ والْفُسُوقَ والْعِصْيانَ>> (But Allah has made faith beloved to you and adorned it in your hearts and has made disbelief, wickedness, and disobedience hateful to you).\n\nThe Prophet, may Allah bless him and grant him peace, only resorted to saying \"made beloved\" without mentioning the one who made it beloved due to a meaning that cannot be revealed because of the weakness of the receptive souls (النفوس القابلة). The knowers of the stations understand why Allah mentioned women and perfume, and placed the delight of the eye in the Prayer: because the worshipper prays while witnessing the One he is intimately conversing with (يناجيه) before Him, from the Presence of Representation (حضرة التمثيل) and its station, for it involves address, response, and acceptance. This only occurs in the witnessing of representation, as it is a station that combines witnessing and speech.\n\nSince affinities necessitate the inclination of the suitable to the suitable, the one who made it beloved is the very essence of the suitable. Affinity may be essential or accidental. Since women are the locus of formation (محل التكوين), and the human being, by his form, necessitates being an active agent, he must have a locus in which he acts. For his perfection, he desires that nothing should issue from him except perfection, just as in the Originator <<أَعْطى كُلَّ شَيْءٍ خَلْقَهُ>> (Who gave each thing its creation), which is the perfection of that thing. Nothing is more perfect than the existence of the human being, and this only occurs in women, whom Allah made the locus. The woman is a part of the man through the passivity (الانفعال) from which she was formed. Thus, women were made beloved to the Perfect Human (الكامل). Since the woman is, as mentioned, the essence of the man’s rib, the locus of formation within her is nothing but his own self. Nothing like him appeared from him except in his own essence and self. Look at how wondrous this matter is! Whoever attains knowledge like this has inherited the Prophet, peace be upon him, in this being made beloved in this aspect.\n\nAs for perfume (الطيب), it comes from the Breaths (الأنفاس), and the Breaths are Rahmanic (رحمانية). The Messenger of Allah, may Allah bless him and grant him peace, said: \"I find the Breath of the All-Merciful (نفس الرحمن).\" Thus, he attributed it to the All-Merciful (الرحمن). And Allah says: <<والطَّيِّباتُ لِلطَّيِّبِينَ والطَّيِّبُونَ لِلطَّيِّباتِ>> (And the good things are for the good people, and the good people are for the good things). One of His Names, the Almighty, is *al-Tayyib* (The Good/Pure). Thus, we know that the good breath (النفس الطيب) can only come from the Good Name. There is no Name better for the cosmos than *al-Rahman* (The All-Merciful), for it is an exaggeration of the universal mercy that encompasses the entire cosmos. Whoever attains goodness (الطيب) in everything, even if others perceive it as naturally foul, it is good by the Divine description. We have tasted this in Mecca. Such a person is truly an heir.\n\nPrayer (الصلاة) was only made beloved to him because of what it contains of the combination of Witnessing (الشهود) and Speech (الكلام), as indicated by his saying: \"the delight of my eye has been placed in the Prayer.\" He did not mention hearing or speech because it is generally known that Prayer is intimate converse (مناجاة), as indicated by His saying: \"The servant says such-and-such, and Allah says such-and-such,\" and that it is divided equally between Allah and His praying servant, as reported in the Hadith. Prayer is only difficult for the one who does not witness (غير المشاهد) and for the one who does not hear the word of the Real responding to what the servant says in his Prayer.\n\nFurthermore, his deputyship (نيابته) in saying, \"Allah hears the one who praises Him\" (سمع الله لمن حمده), which only occurs in the Prayer, is one of the most complete stations. Allah only honored the Perfect Human (الإنسان الكامل) above those who honor him through vicegerency (الخلافة). Because his station was so great, the criticism that occurred against him occurred due to the greatness of the rank. The critic did not know the Divine Perfection (الكمال الإلهي) that Allah deposited in the human constitution (النشأة الإنسانية). Had the critic possessed this knowledge beforehand, he would not have criticized. Since the vicegerency—which is the deputyship for the Real—is of this status, and the worshipper acts as a deputy (نائبا) in saying \"Allah hears the one who praises Him,\" the rank of the Prayer is immense, and thus it was made beloved to him, may Allah bless him and grant him peace. Whoever you see loving the Prayer to this extent is an heir, and whoever you see loving it without this witnessing is not an heir.\n\nIn this station (المنزل) are the sciences of: the emanation of multiplicity from the One (صدور الكثير من الواحد)—meaning the oneness of multiplicity (أحدية الكثرة), not the oneness of the One; Divine and cosmic marriage (النكاح الإلهي والكوني); results and premises; the preference of marriage (whether desired merely for pleasure, or for procreation, or for both); wills (الوصايا); divisions (التقاسيم); anticipation out of fear of missing out (المبادرة خوف الفوت); associates (الخلطاء); gifts (الهبات); what is considered good in souls (طيب النفوس); disposal by what is known (التصرف بالمعروف) and what the known is; trusts (الأمانات); portions (الحظوظ); rights (الحقوق); what should be prioritized and what should be delayed; limits (الحدود); obedience and disobedience; testimonies and judgments (الشهادات والأقضية); clans/tribes (العشائر)—which is the group that returns to a single bond, like the bond of ten, and for this reason the spouse is called *al-Ashir* (the associate), because the union of the two spouses is based on a contract, and association (*mu'ashara*) is companionship, so the clans are the companions, and a person is upon the religion of his intimate friend, having contracted with him upon what he is upon—hence the Almighty said: <<وعاشِرُوهُنَّ بِالْمَعْرُوفِ>> (And live with them in kindness), meaning accompany them in a way that is known to sustain companionship and association between you; honor and prevention (العزة والمنع); types of trade; the superiority of man over woman and the perfection woman shares with man; those who possess rights; sanctification (التقديس); Divine Providence (العناية الإلهية); ranks of successors (الخلفاء); the reality of faith (الايمان); defects (المعيبات); what is desired and hoped for; death; what belongs to Allah and what belongs to creation; the difference between the portion of a good deed and the portion of an evil deed; timing (التوقيت) and what is timed, and what is not subject to timing; the sanctity and status of the believer; migration (الهجرة); the faith of faith (إيمان الايمان); gentleness (الرفق); secrecy and openness; and what the angel shares with the Perfect Human.\n\nAnd Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وهو عَلى ما نَقُولُ وَكِيلٌ>> (says the truth, and He guides to the way, and He is a Trustee over what we say).",
    "ur": "باب تین سو اسی: مقام محمدی سے علماء، ورثاء انبیاء کے مرتبے کی معرفت میں\n\nآنکھ کی ٹھنڈک درحقیقت نفس (نفس) کی ٹھنڈک ہی ہے۔\nپس ہر اس معنی کو دیکھو جو حس (حس) میں چھپا دیا گیا ہے۔\n\nاے میرے آقا! اگر تم صاحبِ نظر ہو تو تم اسے\nفصل (فصل)، نوع (نوع)، احکام (احکام) اور جنس (جنس) میں پاؤ گے۔\n\nپس میری آنکھ اس کے سوا کبھی کسی اور کا مشاہدہ نہیں کرتی،\nجبکہ لوگ اس معاملے میں شک اور التباس (التباس) میں ہیں۔\n\nخوشبو اور خوبصورت عورت، دونوں مناجات (مناجاة) کے ساتھ\nمعنی اور نفس (نفس) میں شریک ہیں۔\n\nپس نماز میں میرا وجود (وجود) ہے، اور عورتیں ہمارے لیے عرش (عرش) ہیں،\nاور خوشبو میں انس (انس) کے ساتھ سانسیں ہیں۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"تمہاری دنیا کی تین چیزیں میرے لیے محبوب بنا دی گئیں: عورتیں، خوشبو، اور میری آنکھ کی ٹھنڈک نماز میں رکھی گئی۔\"\n\nاور آپ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک تمہارا رب ایک ہے اور تمہارا باپ ایک ہے۔ کسی عربی کو عجمی پر اور کسی عجمی کو عربی پر کوئی فضیلت نہیں مگر تقویٰ (تقویٰ) کے ذریعے۔\" پھر آپ نے یہ آیت تلاوت فرمائی: **\"بے شک اللہ کے نزدیک تم میں سب سے زیادہ عزت والا وہ ہے جو تم میں سب سے زیادہ پرہیزگار ہے۔\"** (الحجرات: ۱۳)\n\nباپ سے مراد آدم علیہ السلام ہیں، اور یہی اللہ تعالیٰ کا یہ فرمان ہے: **\"جس نے تمہیں ایک جان (نفس واحدہ) سے پیدا کیا۔\"** (النساء: ۱) یعنی نفس آدم (نفس آدم)، جو ان سے شاخ در شاخ ہوئے ان سے خطاب ہے۔\n\n### [ورث دو قسم کا ہے: معنوی اور محسوس]\n\nپس جان لو کہ ورث (الورث) دو قسم کا ہے: معنوی (معنوی) اور محسوس (محسوس)۔ محسوس ورث وہ ہے جو الفاظ، افعال اور احوال (احوال) کے ظہور سے متعلق ہو۔\n\nجہاں تک افعال کا تعلق ہے، وارث اس بات پر نظر رکھتا ہے کہ رسول اللہ صلی اللہ علیہ وسلم کون سے افعال کرتے تھے جنہیں وارث کے لیے کرنا مباح ہے تاکہ وہ آپ کی اقتداء (اقتداء) کرے۔ نہ کہ وہ افعال جو آپ صلی اللہ علیہ وسلم کے ساتھ خاص تھے، آپ کے اپنے نفس (نفس) میں، اپنے رب کے ساتھ، اور اپنے اہل، اولاد، رشتہ داروں، صحابہ اور تمام عالم کے ساتھ آپ کے برتاؤ میں۔ وارث ان سب کی پیروی ان روایات میں کرتا ہے جو رسول اللہ صلی اللہ علیہ وسلم سے مروی ہیں اور جو آپ کے افعال کی وضاحت کرتی ہیں، خواہ وہ صحیح ہوں یا ضعیف۔ پس وہ ان سب کو اسی حد تک بجا لاتا ہے جس حد تک وہ وارد ہوئی ہیں، نہ ان میں اضافہ کرتا ہے اور نہ کمی۔ اگر ان میں روایات کا اختلاف ہو تو وہ ہر روایت پر عمل کرتا ہے، کبھی اس روایت پر اور کبھی اس پر، اگرچہ ایک ہی بار ہو۔ اور وہ اس روایت پر قائم رہتا ہے جو ثابت ہو چکی ہو، اور جو کچھ مروی ہے اسے ترک نہیں کرتا، اگرچہ وہ سند کے لحاظ سے ثابت نہ ہو۔ البتہ اگر اس کا تعلق کسی حلال یا حرام سے ہو تو وہ اپنے حق میں حرمت کو غالب رکھتا ہے، کیونکہ یہ اس کے لیے زیادہ بہتر ہے، اس لیے کہ وہ اولو العزم (أولي العزم) میں سے ہے۔ اور حلال یا حرام کے علاوہ ہر معاملے میں وہ ہر روایت پر عمل کرتا ہے۔\n\nاور اگر وہ فتویٰ دینے کا اہل ہو اور سمعی دلائل (الأدلة السمعية) ہر لحاظ سے حکم میں متعارض ہوں، اور تاریخ معلوم نہ ہو، اور جمع کرنا ممکن نہ ہو، تو وہ اس چیز کا فتویٰ دیتا ہے جو حرج کو دور کرنے کے قریب تر ہو، اور اپنے حق میں وہ سخت تر (الأشد) پر عمل کرتا ہے، کیونکہ وہ اس کے حق میں سخت تر ہے۔ اور یہ ورث لفظی (الورث اللفظي) میں سے ہے، کیونکہ اسی کا فتویٰ دیا جاتا ہے۔\n\nپس وہ رسول اللہ صلی اللہ علیہ وسلم کی طرح دن اور رات میں نماز پڑھتا ہے، اور اس کی کیفیات میں اور اس کی تعداد میں اس کی کمیات (کميات) پر عمل کرتا ہے۔ اسی طرح روزہ رکھتا ہے، اور اپنی بیویوں کے ساتھ مزاح اور سنجیدگی میں اسی طرح برتاؤ کرتا ہے۔ اور کھانے پینے میں اور جو کچھ وہ کھاتا اور پیتا ہے، اس میں آپ کے اخلاق پر ہوتا ہے، جیسے احمد بن حنبل، کیونکہ وہ اسی مرتبے پر تھے۔ ہم سے روایت کی گئی ہے کہ انہوں نے مرتے دم تک تربوز نہیں کھایا، اور جب ان سے اس بارے میں پوچھا جاتا تو وہ کہتے کہ مجھے یہ نہیں معلوم ہوا کہ رسول اللہ صلی اللہ علیہ وسلم اسے کس طرح کھاتے تھے۔\n\nاور ہر وہ فعل جس کے بارے میں کوئی حدیث نہ ملے جو یہ بیان کرے کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے کسی خاص کیفیت یا خاص کمیت کے ساتھ کیا، لیکن اس کے بارے میں حدیث وارد ہوئی ہو، تو اس پر عمل کرو۔ جیسے آپ صلی اللہ علیہ وسلم کا روزہ رکھنا، آپ روزہ رکھتے تھے یہاں تک کہ ہم کہتے کہ آپ افطار نہیں کریں گے، اور افطار کرتے تھے یہاں تک کہ ہم کہتے کہ آپ روزہ نہیں رکھیں گے۔ اور راوی نے اس میں کوئی وقت مقرر نہیں کیا، تو تم بھی اسی طرح روزہ رکھو اور اسی طرح افطار کرو۔ اور شعبان کے روزے زیادہ رکھو، اور رمضان کے مہینے کے علاوہ کسی بھی مہینے کے روزے مکمل نہ کرو۔\n\nاور ہر وہ روزہ یا فعل جس کا حکم دیا گیا ہو، اگرچہ اس کا فعل مروی نہ ہو، تو اس کے حکم کی وجہ سے اس پر عمل کرو۔ اور یہی اللہ تعالیٰ کے اس فرمان کا معنی ہے: **\"اگر تم اللہ سے محبت رکھتے ہو تو میری پیروی کرو، اللہ تم سے محبت کرے گا۔\"** (آل عمران: ۳۱)\n\nاور ہم نے کسی ایسے شخص کو نہیں دیکھا جسے ہم نے دیکھا ہو یا جس کے بارے میں سنا ہو کہ وہ اس قدم پر عمل کرتا ہو، سوائے یمن کے ایک بزرگ کے جنہیں الحداد کہا جاتا تھا۔ شیخ ربیع بن محمود الماردینی الخطاب نے انہیں دیکھا اور خبر دی کہ وہ اقتداء (اقتداء) کے اس حال پر تھے۔ یہ بات مجھے میرے خادم ساتھی عبداللہ بدر الحبشی نے شیخ ربیع سے بتائی۔\n\nپس تم ہر چیز میں آپ کی پیروی کرو، کیونکہ اللہ فرماتا ہے: **\"بے شک تمہارے لیے رسول اللہ (صلی اللہ علیہ وسلم) میں بہترین نمونہ (اسوہ حسنہ) ہے۔\"** (الاحزاب: ۲۱) جب تک کہ آپ نے کسی چیز کو اس کے فعل سے منع کر کے خاص نہ کر دیا ہو۔\n\nاور آپ صلی اللہ علیہ وسلم نے فرمایا: \"نماز اس طرح پڑھو جس طرح تم نے مجھے نماز پڑھتے دیکھا ہے۔\"\n\nاور حج کے بارے میں فرمایا: \"حج میں اپنے مناسک (مناسک) مجھ سے لے لو۔\"\n\nاور جب تم حج کرو، اگر تم قربانی (الھدی) کی قدرت رکھتے ہو، تو حج یا عمرہ کے ساتھ احرام باندھ کر داخل ہو، اور اگر تم دوبارہ حج کرو تو بھی اگر قربانی کی قدرت ہو تو حج کا احرام باندھ کر داخل ہو۔ اور اگر تمہیں قربانی نہ ملے تو خبردار! حج کا احرام باندھ کر داخل نہ ہونا، بلکہ تمتع (متمتع) کے طور پر صرف عمرہ کا احرام باندھ کر داخل ہونا۔ جب تم طواف اور سعی کر چکو تو اپنے احرام سے مکمل طور پر حلال ہو جاؤ، پھر اس کے بعد حج کا احرام باندھو اور جیسا تمہیں حکم دیا گیا ہے، اپنی قربانی کرو۔\n\nاور اس بات کا پختہ ارادہ کرو کہ تم آپ کے افعال اور آپ کے احوال (احوال) میں سے کسی بھی چیز کو ترک نہیں کرو گے جو تمہارے لیے مباح ہے۔ اور اپنی استطاعت کے مطابق آپ کے تمام آداب کو لازم پکڑو۔ جب کوئی چیز وارد ہو جائے اور تم اس کی استطاعت رکھتے ہو تو اسے ترک نہ کرو، کیونکہ اللہ نے تم پر تمہاری وسعت سے زیادہ بوجھ نہیں ڈالا۔ پس اپنی وسعت صرف کر دو اور اس میں سے کچھ بھی نہ چھوڑو، کیونکہ اس کا نتیجہ بہت عظیم ہے جس کی قدر و قیمت کا اندازہ نہیں لگایا جا سکتا، اور وہ ہے اللہ کی تم سے محبت۔ اور تم محب (محب) کے حق میں محبت کا حکم جانتے ہو۔\n\nجہاں تک ورث معنوی (الورث المعنوی) کا تعلق ہے، تو وہ باطنی احوال سے متعلق ہے، جیسے نفس (نفس) کو مذموم اخلاق سے پاک کرنا اور اسے مکارم اخلاق (مکارم الأخلاق) سے آراستہ کرنا، اور ہر حال میں اپنے رب کا ذکر کرنا جو آپ صلی اللہ علیہ وسلم کا طریقہ تھا۔ اور یہ صرف تمہارے دل میں اور عالم میں اس کی نشانیوں (آثار) کا حضور (حضور) اور مراقبہ (مراقبة) ہے۔ پس تمہاری آنکھ میں کوئی چیز نہ پڑے، نہ تمہارے کان میں کوئی چیز آئے، اور نہ تمہاری کسی قوت (قوۃ) سے کوئی چیز متعلق ہو، مگر اس میں تمہاری ایک الٰہی نظر اور عبرت ہو، جس سے تم اس میں حکمت الٰہیہ (الحکمة الإلهية) کا مقام جانو۔ رسول اللہ صلی اللہ علیہ وسلم کا حال ایسا ہی تھا جیسا کہ عائشہ رضی اللہ عنہا نے آپ سے روایت کیا ہے۔\n\nاسی طرح، اگر تم شرعی احکام کے استنباط (استنباط) میں اجتہاد (اجتہاد) کے اہل ہو، تو تم نبوت شرعیہ (نبوۃ شرعیۃ) کے وارث ہو۔ کیونکہ اللہ تعالیٰ نے تمہارے لیے یہ مشروع کیا ہے کہ تمہارا اجتہاد اور دلیل جس حکم کی طرف لے جائے، تم اسے اپنے لیے مشروع کرو اور اگر تم سے پوچھا جائے تو دوسروں کو بھی اس کا فتویٰ دو، اور اگر نہ پوچھا جائے تو نہیں۔ کیونکہ یہ بھی اس شریعت میں سے ہے جس کی اللہ نے تمہیں اجازت دی ہے، نہ کہ اس شریعت میں سے جس کی اللہ نے اجازت نہیں دی۔\n\n### [اجتہاد یہ نہیں ہے کہ تم کوئی نیا حکم ایجاد کرو]\n\nاور جان لو کہ اجتہاد یہ نہیں ہے کہ تم کوئی نیا حکم ایجاد کرو، یہ غلطی ہے۔ بلکہ مشروع اجتہاد (الاجتہاد المشروع) کتاب، سنت، اجماع (إجماع) اور عربی فہم سے دلیل کی تلاش میں ہے تاکہ اس دلیل کے ذریعے اس مسئلے میں کسی حکم کو ثابت کیا جا سکے جسے تم نے اپنی سمجھ میں حاصل کرنے کی کوشش کی ہے۔ یہی اجتہاد ہے۔ کیونکہ اللہ تعالیٰ اور اس کے رسول نے کوئی چیز نہیں چھوڑی مگر اس پر نص (نص) موجود ہے اور اسے مہمل نہیں چھوڑا۔\n\nاللہ تعالیٰ فرماتا ہے: **\"آج میں نے تمہارے لیے تمہارا دین مکمل کر دیا۔\"** (المائدہ: ۳) اور کمال ثابت ہونے کے بعد اضافہ قبول نہیں کیا جاتا، کیونکہ دین میں اضافہ دین میں کمی ہے، اور یہی وہ شریعت ہے جس کی اللہ نے اجازت نہیں دی۔\n\nاور ورث معنوی (الورث المعنوی) میں سے وہ فہم بھی ہے جو تم پر کتاب اور پورے عالم کی حرکات میں کھولا جاتا ہے۔\n\nجہاں تک ورث الٰہی (الورث الإلهي) کا تعلق ہے، تو وہ صور التجلی الإلهی (صور التجلی الإلهی) ہیں جو تمہاری ذات (ذات) میں اس وقت حاصل ہوتی ہیں جب وہ تم پر تجلی (التجلی) فرماتا ہے، کیونکہ تم اسے صرف اسی کے ذریعے دیکھتے ہو۔ ذات حق (الحق) نے تمہیں اس مقام پر بصارت عطا کی ہے۔ اور تجلی (تجلی) کی صورت تم پر دوبارہ نہیں آتی، بلکہ وہ اس سے منتقل ہو کر تمہاری ذات اور تمہاری ملکیت میں اس کا نظیر (نظیر) حاصل ہو جاتا ہے۔ اسی لیے تم آخرت میں عموماً کسی چیز کے بارے میں جب ارادہ کرتے ہو تو کہتے ہو: **\"ہو جا، پس وہ ہو جاتی ہے۔\"** (یس: ۸۲) اور دنیا میں خصوصاً۔\n\nپس دنیا میں ذات حق تمہارے لیے تمہارے تکوین (تکوین) کا محل ہے، کیونکہ وہ تمہارے تنوع (تنوع) کے لیے متنوع ہوتا ہے، اور آخرت میں تم اس کے تنوع کے لیے متنوع ہوتے ہو۔ پس وہ دنیا میں تمہاری صورت (صورتک) پہنتا ہے، اور تم آخرت میں اس کی صورت پہنتے ہو۔ پس دیکھو یہ کتنا عجیب معاملہ ہے۔\n\nاسی طرح تمہارے لیے میراث الٰہی (الميراث الإلهي) میں اعداد کے مراتب میں بھی حصہ ہے۔ ذات حق تین کا چوتھا ہو سکتا ہے، پس جب تم آ کر ان تینوں میں شامل ہو جاتے ہو اور انہیں چار بنا دیتے ہو، تو یہ تمہارے لیے اس وقت تک نہیں ہوتا جب تک کہ ذات حق پانچ کے مرتبے پر منتقل نہ ہو جائے، پس وہ تین کا چوتھا ہونے کے بعد چار کا پانچواں ہو جاتا ہے۔ پس وہ تمہارے لیے مرتبے کو خالی کر دیتا ہے اور تم اس کے وارث بن جاتے ہو۔ اور ہر اس جماعت میں جس میں تم شامل ہوتے ہو، یہی حکم ہے۔ یہ دنیا میں میراث کا حکم ہے۔\n\nلیکن خصوص (الخصوص) کی میراث میں اور آخرت میں، وہ چار کا چوتھا ہوتا ہے جبکہ تم بھی ان چار میں سے چوتھے ہوتے ہو۔ کیونکہ تم دنیا میں خصوص میں ذات حق کی صورت میں آئے ہو، اور آخرت میں بھی تم ذات حق کی صورت ہو۔\n\nاسی لیے جس نے کہا: **\"بے شک اللہ تین میں کا تیسرا ہے۔\"** (المائدہ: ۷۳) اس نے کفر کیا، یعنی پردہ ڈالا، اپنے رب کے ذریعے، کیونکہ وہ خود تین میں سے تیسرے کا عین (عین) ہے۔ اور اس نے اپنے آپ کو حق (الحق) دیکھا نہ کہ خلق (الخلق)، سوائے جسمانی صورت کے لحاظ سے، نہ کہ اس لحاظ سے جس سے وہ موصوف ہے۔ پس وہ خلق میں حق ہے، تو اس نے اپنی خلق کو اس حق کے ذریعے چھپا لیا جس کا وہ مشاہدہ کر رہا تھا اور جس پر عموم میں نص موجود ہے کہ وہ بندے کی تمام قوتیں اور صفات ہے جب وہ اہل خصوص (أهل الخصوص) میں سے ہو۔ پس اس نے اپنے بارے میں کہا: **\"بے شک اللہ تین میں کا تیسرا ہے۔\"** پھر ذات حق نے اس قول کے فوراً بعد بیان فرمایا: **\"حالانکہ ایک معبود کے سوا کوئی معبود نہیں ہے۔\"** (المائدہ: ۷۳) اور وہی ہے جس نے تین کو تین بنایا۔ پس دو عام لوگ ہیں، اور جس نے انہیں اپنی خلق کے ذریعے تین بنایا وہ خلق کے لحاظ سے تیسرا ہے۔ پھر اس نے جان لیا کہ ذات حق اس کی تمام قوتیں ہے، اور ذات حق نے اسے مشاہدہ کرایا کہ وہ ان دو کے ساتھ بھی ویسا ہی ہے جیسا کہ وہ اس کے ساتھ ہے، مگر ان سے اس کا علم چھپا دیا گیا، پس انہوں نے خلق کے ساتھ کہا نہ کہ حق کے ساتھ۔ پس اس خاص شخص نے کہا: **\"بے شک اللہ تین میں کا تیسرا ہے۔\"** کیونکہ اس نے اس کا مشاہدہ ان میں بھی کیا جیسا کہ اس نے اپنے نفس میں کیا، **\"اور وہ نہیں جانتے۔\"** (یوسف: ۶۸) پس اس نے دیکھا کہ ذات حق نے انہیں تین کی صورت میں جمع کیا، تو کہنے والے کا قول صحیح ہوا کہ وہ خلق اور حق دونوں لحاظ سے تین کا تیسرا ہے۔ اور یہ بھی صحیح ہوا کہ **\"ایک معبود کے سوا کوئی معبود نہیں ہے۔\"** کیونکہ وہ تینوں میں سے ہر ایک کا عین ہے، کوئی اور نہیں۔ پس وہ ایک ہے اور وہ تین ہے۔\n\nیہ ورث الٰہی نبوی (الورث الإلهي النبوي) میں سے ہے، کیونکہ ہمیں یہ شہود (الشهود) صرف نبوی اقتداء (اقتداء) اور اتباع (اتباع) کے ذریعے حاصل ہوا ہے۔ جب ہم نے اسے جان لیا تو ہم آپ صلی اللہ علیہ وسلم کے وارث بن گئے۔ اور کسی کے لیے میراث صحیح نہیں ہوتی مگر موروث کے برزخ (البرزخ) میں منتقل ہونے کے بعد۔ اور جو کچھ تمہیں انتقال کے بغیر حاصل ہو، وہ ورث نہیں ہے، بلکہ وہ وہب (وہب)، عطیہ (أعطية) اور بخشش (منحة) ہے، جس میں تم نائب (نائب) اور خلیفہ (خلیفہ) ہو، وارث نہیں۔ پس تم علم کے لحاظ سے وارث ہو، اور تم شہود (الشهود) کے لحاظ سے اس کا عین ہو، وارث نہیں۔\n\nکیا تم نہیں دیکھتے کہ آپ صلی اللہ علیہ وسلم کا فرمان ہے: \"بے شک تمہارا رب ایک ہے جیسا کہ تمہارا باپ ایک ہے۔\"\n\nاور تمہارا باپ وہی ہے جس سے تم ہو۔ پس اگر تم جان لو کہ تم کس سے ہو تو تم اپنے باپ کو جان لو گے۔ اور نبی صلی اللہ علیہ وسلم نے یہ ذکر نہیں کیا کہ ہمارے دو باپ ہیں جیسا کہ ظاہر میں واقع ہے، کیونکہ ہم آدم اور حوا سے ہیں، جیسا کہ اس کا فرمان ہے: **\"اور اس نے اپنے والدین کو تخت پر بٹھایا۔\"** (یوسف: ۱۰۰) لیکن چونکہ حوا آدم کا عین تھیں، کیونکہ وہ ان کی پسلی کا عین تھیں، تو ایک ہی باپ تھا جو دو مختلف صورتوں میں تھا۔ جیسا کہ تجلی (التجلی) ہے۔ پس حوا کا عین آدم کا عین ہے، دائیں کا بائیں سے جدا ہونا، اور وہ زید کا عین بھی ہے۔ اسی طرح حوا کا آدم سے جدا ہونا، وہ آدم کا عین ہے۔ پس وہاں ایک ہی باپ ہے، تو ہم صرف ایک سے صادر ہوئے، جیسا کہ سارا عالم صرف ایک الٰہ (إله) سے صادر ہوا۔ پس عین (العین) ایک ہے، نسبتیں بہت ہیں۔ اگر معاملہ ایسا نہ ہوتا تو نہ ہمارے لیے وجود (وجود) ظاہر ہوتا، نہ ہمارے لیے عین کا وجود ہوتا، اور نہ ہمارے لیے حکم کا ایجاد ہوتا۔ پس جس طرح اس نے ہمیں عین کے طور پر موجود کیا، اسی طرح اس نے ہمارے لیے حکم کو بھی موجود کیا، **\"بدلہ ہے موافق۔\"** (النبأ: ۲۶) اگر تم غور کرو۔ پس وہ ہمارے لیے عین کو موجود کرنے والا ہے اور ہم اس کے لیے رب کو موجود کرنے والے ہیں۔\n\nاگر ذات حق (الحق) نہ ہوتی تو وجود (الوجود) نہ ہوتا،\nاور اگر کائنات (الکون) نہ ہوتی تو وہ صرف الٰہ (الٰہ) ہی ہوتا۔\n\nیہ ایک بدلہ ہے جو ذات حق نے اس سے چاہا،\nسوال کرنے والوں کا سوال کہ وہ کون ہے اور کیا ہے۔\n\nپس وہ عموم (عموم) میں بلاشک وہی ہے،\nلیکن خصوص (خصوص) میں وہ ہے اور وہ کیا ہے۔\n\nپھر ہر نوع میں توالد (توالد) اور تناسل (تناسل) کا سلسلہ دنیا میں جب تک دنیا باقی ہے، جاری رہا، اور آخرت میں بھی لامتناہی طور پر جاری رہے گا، اگرچہ توالد کے احوال متنوع ہو جائیں، جیسا کہ دنیا میں حوا، عیسیٰ اور بنی آدم میں ظاہر ہوا۔ اور آدم میں تو دونوں ہاتھوں سے اور ارکان (الأركان) سے، اور نباتات میں بھی اس کی کاشت اور بیجوں میں متنوع ہے۔ اسی طرح معدنیات میں بھی۔ پس دیکھو اللہ کی حکمت اس کی تخلیق میں کتنی محکم ہے۔\n\nاور جب ہمیں ہر موجود کے لیے خاص وجہ (الوجه الخاص) پر اطلاع ملی، تو ہمارے لیے یہ ممکن نہ رہا کہ ہم توالد کو مکمل طور پر اپنی طرف منسوب کریں، بلکہ ہم نے ہر وہ چیز جو کائنات میں ظاہر ہوئی، اسے اس کی طرف منسوب کیا، اور یہی اللہ تعالیٰ کا فرمان ہے: **\"اور ہمارا حکم تو بس ایک ہی ہوتا ہے۔\"** (القمر: ۵۰) اور ہم اس کا حکم ہیں۔ پس اللہ تعالیٰ کے سوا کوئی موجد (موجد) نہیں ہے، ہر لحاظ سے، جسے اس کا علم ہے وہ جانتا ہے اور جسے اس کا علم نہیں وہ نہیں جانتا۔ جیسا کہ طبیعیات دان (الطبيعيون) طبیعی موجودات میں طبیعت (الطبیعۃ) کی احدیت (أحدية) کا قول کرتے ہیں۔ پس ہر وہ چیز جو طبیعی موجودات سے ظاہر ہوئی، انہوں نے کہا کہ یہ طبیعت کی طرف سے ہے۔ پس انہوں نے معاملے کو واحد قرار دیا، جیسا کہ ہم نے اس کی خلق میں الٰہ کو واحد قرار دیا۔ پس اللہ کے سوا کوئی نہیں تھا، اور وہی ہے جسے انہوں نے طبیعت کہا، اور انہیں اس کا علم نہیں، جیسا کہ دہریہ (الدهرية) نے اسے دہر (الدهر) کہا، اور انہیں اس کا علم نہیں۔ مگر یہ کہ اللہ نے ہمارے لیے اپنا نام دہر (الدهر) رکھا، اور طبیعت (الطبیعۃ) نہیں رکھا، کیونکہ طبیعت اس کے لیے غیر نہیں ہے جس کا عین (عین) اس سے موجود ہوا ہو، پس وہ ہر طبیعی موجود کا عین ہے۔\n\nاور جب ذات حق کا یہ حکم تھا اور وہ اپنے خاص بندوں پر اس کے ذریعے ظاہر ہوا، اور ہم نے جان لیا کہ نام مسمیٰ (المسمى) پر دلالت کرتا ہے، تو ہم نے دیکھا کہ نام اگرچہ دلالت کرتا ہے، لیکن وہ اجنبی ہے۔ پس ہم نے جان لیا کہ طبیعت کا حکم دہر کے حکم سے مختلف ہے۔ کیونکہ دہر (الدهر) کائنات کا عین نہیں ہے، اور ہم نے دیکھا کہ طبیعت طبیعی کائنات کا عین ہے۔ اور ہم نے دیکھا کہ ذات حق کے لیے ایک تنزیہ (تنزیہ) ہے جس کے ذریعے وہ ہم سے جدا ہوتا ہے، جیسے دہر اس سے جدا ہوتا ہے جو اس میں ہوتا ہے۔ پس اس نے اپنے آپ کو دہر کے نام سے پکارا تنزیہ کے لیے، اور طبیعت کے نام سے نہیں پکارا، کیونکہ معاملہ اس کے غیر نہیں ہے، بلکہ وہ اس کا عین ہے۔ اور مسمیٰ (المسمى) اپنے آپ کو اپنے لیے نام نہیں دیتا۔ پس وہ طبیعت کے نام سے نہیں پکارا جاتا، بلکہ وہ اپنے آپ کو دوسروں کے لیے نام دیتا ہے، تاکہ جب وہ اسے یاد کریں تو جان لیں کہ وہ اسے یاد کر رہے ہیں، اور جب وہ یاد کیا جائے تو وہ اسے پہچان لے۔ یہ ناموں کے وضع (وضع) کا اصول ہے۔\n\nپس اللہ کے سوا کچھ نہیں، کوئی اور شے نہیں۔\nاور دو کے سوا کچھ نہیں، اور اللہ تیسرا ہے۔\n\nیہ اس علم کا نتیجہ ہے جو اس نے ہمیں بتایا،\nپس میں حقیقت (الحقیقۃ) کے علم کا کاشتکار (حارث) ہوں۔\n\nآپ صلی اللہ علیہ وسلم کا فرمان ہے: \"جس نے اپنے نفس (نفس) کو پہچانا، اس نے اپنے رب کو پہچانا۔\"\n\nپس آپ نے انسان کے اپنے نفس کی معرفت (معرفۃ) کو مقدم کیا، کیونکہ وہ دلیل (الدلیل) کا عین ہے۔ اور دلیل کے علم کا مدلول (المدلول) کے علم پر مقدم ہونا ضروری ہے۔ اور دلیل ہم ہیں، اور ہم شفعیہ (الشفعية) کے مقام پر ہیں، اس لیے ہم نے دو کے ذریعے تعبیر کیا کیونکہ شفع (الشفع) موجود ہے۔ پس ہم میں غور کرنے سے ذات حق کا وجود (وجود) اور اس کی احدیت (أحديته) کا نتیجہ نکلا۔ پس وہ دو کا تیسرا ہے، جیسا کہ وہ تین کا چوتھا ہے۔ اسی لیے ہم نے کہا کہ اللہ ان دو کا تیسرا ہے، اور میں حارث (حارث) ہوں، یعنی نظر کے ذریعے اس علم کو کمانے والا ہوں۔\n\nپھر ذات حق کے لیے ہم میں سے بھی ورث (ورث) ہے، جیسا کہ اس نے فرمایا: **\"بے شک ہم ہی زمین اور جو کچھ اس پر ہے، اس کے وارث ہوں گے۔\"** (مریم: ۴۰) عین (عینا) اور حکم (حکما) کے لحاظ سے۔ جہاں تک عین کا تعلق ہے، تو اس کا فرمان ہے: **\"اور تم ہماری طرف لوٹائے جاؤ گے۔\"** (القصص: ۸۸) کیونکہ معاملات اپنی اصل کی طرف لوٹتے ہیں، جیسے دائرے کا آخر اس کے اول پر پلٹتا ہے۔ دائرے کو شروع کرنے سے صرف اس کی اصل کی طرف لوٹنا مطلوب ہوتا ہے، جو اس کا آغاز ہے۔ پس اسی پر وہ ختم ہوتا ہے۔\n\nہم کسی چیز کو نہیں جانتے مگر اسی کے ذریعے۔ پس اس نے ہم سے یہ صفت ورث میں لی، تو اللہ تعالیٰ نے فرمایا: **\"اور ہم تمہیں ضرور آزمائیں گے یہاں تک کہ ہم جان لیں۔\"** (محمد: ۳۱) جیسا کہ ہم نے غور کیا یہاں تک کہ ہم نے جان لیا۔ پس یہ وصف ہمیں بغیر شرکت کے خالص نہیں ہوا، تو ہم نے جان لیا کہ ہمارا علم غور و استدلال (الاستدلال) سے ہے، اس چیز کے ذریعے جسے ہم نے جانا کہ وہ اس کا عالم ہے، اس لحاظ سے کہ ہمارا غور ہماری وجہ سے نہیں تھا، کیونکہ اس نے فرمایا کہ وہ ہماری صفت کا عین ہے جس کے ذریعے ہم دیکھتے ہیں، سنتے ہیں اور پکڑتے ہیں۔ اور یہ سب انبیاء کا علم ہے جن کے ہم وارث ہیں، کیونکہ انہوں نے ہمیں صرف علم کی حقیقت (الحقیقۃ) کا ورث دیا، اور یہ سب سے اشرف چیز ہے جو ورث میں دی جاتی ہے۔\n\nپھر آپ صلی اللہ علیہ وسلم کے فرمان پر غور کرو: \"علماء انبیاء کے وارث ہیں۔\"\n\nالف لام (ال) نے ان دونوں میں ہر عالم اور ہر خبر دینے والے کو عام کر دیا۔ اور بلاشک ہر خبر دینے والا اس چیز کا تصور رکھتا ہے جس کی وہ خبر دیتا ہے، اور ہر سننے والا اس خبر کو جانتا ہے، یعنی اس نے وہ جان لیا جس کا اس خبر دینے والے نے تصور کیا، خواہ وہ خبر جھوٹی ہو یا سچی۔ پس یہ بلاشک ورث ہے۔ کیا تم نہیں دیکھتے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: \"جس نے کوئی حدیث بیان کی اور وہ جانتا تھا کہ وہ جھوٹ ہے، تو وہ دو جھوٹوں میں سے ایک ہے۔\"\n\nکیونکہ اس نے اس سے جھوٹ کا ورث لیا اور اس کا حکم جھوٹے کا حکم ہو گیا، جیسا کہ مال میں وارث کا حکم اس شخص کا حکم ہو جاتا ہے جو مر گیا اور اسے چھوڑ گیا۔\n\nاور جب الف لام کے ذریعے علماء کو عام کیا گیا تو اس میں اللہ کا قول **\"یہاں تک کہ ہم جان لیں۔\"** شامل ہو گیا۔ اور جب الف لام کے ذریعے انبیاء کو عام کیا گیا تو اس میں ہر وہ خبر دینے والا شامل ہو گیا جو زبان سے یا حال سے خبر دیتا ہے، کیونکہ جو چیز تمہاری آنکھ کے سامنے ظاہر ہوئی جبکہ وہ پہلے ظاہر نہیں تھی، تو اس نے تمہیں اپنے ظہور کی خبر دی کہ وہ تمہارے لیے ظاہر ہو گئی ہے۔ یہاں تک کہ اگر وہ تم سے کہے کہ میں تمہارے لیے ظاہر ہو گیا ہوں، تو اس سے تمہیں اس کے ظہور کا علم حاصل نہیں ہو گا، بلکہ تمہیں اس کے قول کا علم حاصل ہو گا، یعنی وہ تمہاری خاطر تمہاری آنکھ کے لیے ظاہر ہوا۔\n\nپس پہلا مفہوم (المفهوم الأول) ظاہری قربت ہے جو اہل ظاہر کے نزدیک نص (نص) کے مرتبے پر نازل ہے کہ علماء ان انبیاء کے وارث ہیں جو اللہ کی طرف سے خبر دینے والے ہیں۔ اور دوسرا مفہوم (المفهوم الثاني) جس میں پہلا مفہوم کوئی قدح نہیں کرتا، یہ ہے کہ علماء ان خبر دینے والوں کے وارث ہیں جس کی انہوں نے خبر دی، خواہ وہ کوئی بھی ہوں۔\n\nلیکن وہ علم جو علماء انبیاء علیہم السلام سے ورث میں لیتے ہیں، وہ وہ علم نہیں ہے جسے عقلیں اور حواس خبروں کے بغیر خود سے ادراک کر سکیں، کیونکہ وہ میراث نہیں ہوتی۔ بلکہ وہ علم جو علماء انبیاء سے ورث میں لیتے ہیں، وہ ہے جسے عقلیں اپنی نظر سے ادراک کرنے میں خود مختار نہیں ہوتیں۔\n\nاور جہاں تک وہ علم الٰہی (العلم الإلهي) جو تم انبیاء سے ورث میں لیتے ہو، وہ وہ ہے جسے عقلیں اپنی دلیلوں سے حاصل کرتی ہیں۔ اور جو چیز عقلوں کے لیے جائز ہو، تو انبیاء ان کے لیے دو جائز چیزوں میں سے ایک کو متعین کر دیتے ہیں، جیسے ابراہیم علیہ السلام کا قول: **\"لیکن تاکہ میرے دل کو اطمینان ہو جائے۔\"** (البقرہ: ۲۶۰)\n\nاور جہاں تک وہ علم ہے جو تم انبیاء علیہم السلام سے کائنات (الأکوان) کے علم میں ورث میں لیتے ہو، تو وہ آخرت کا علم اور عالم کا مال ہے۔ کیونکہ یہ سب امکان (الإمکان) کے قبیل سے ہے۔ پس انبیاء اللہ کی طرف سے یہ متعین کرتے ہیں کہ بعض ممکنات (الممکنات) تعین کے ساتھ واقع ہوں گے، تو عالم اسے جان لیتا ہے۔ پس یہ نبوی ورث ہے جسے وہ اس نبی کی خبر سے پہلے نہیں جانتا تھا۔\n\nاور اس کے علاوہ جو کچھ ہے، وہ موروثی علم نہیں ہے، سوائے عامی (العامی) کے حق میں جس کی عقل نے اپنا حق ادا نہیں کیا، تو اس نے نبی سے وہ علم حاصل کیا جسے اگر وہ اپنی عقل سے غور کرتا تو ادراک کر لیتا، جیسے اللہ کی توحید (توحید) اور اس کا وجود (وجود)، اور بعض وہ چیزیں جو اوصاف اور اسماء کے حکم سے متعلق ہیں۔ پس یہ اس شخص کے حق میں جو اسے صرف نبی کے ذریعے جانتا ہے، موروثی علم ہو گا۔ اور ہم نے اسے علم اس لیے کہا کہ انبیاء صرف اسی چیز کی خبر دیتے ہیں جو حقیقت میں امر ہوتا ہے، کیونکہ وہ اللہ کی طرف سے خبر دینے میں معصوم (معصومون) ہوتے ہیں کہ وہ ایسی بات کہیں جو حقیقت میں نہ ہو۔ بخلاف انبیاء کے علاوہ خبر دینے والوں کے، خواہ وہ عالم ہوں یا غیر عالم۔ کیونکہ عالم اس چیز میں اجتہاد کر سکتا ہے جو دلیل نہیں ہے کہ وہ دلیل ہے، پس وہ اس چیز کی خبر دیتا ہے جو اس دلیل نے اسے دی، پھر اس کے بعد اس سے رجوع کر لیتا ہے۔ اسی لیے وہ علم کے درجے میں نبی صلی اللہ علیہ وسلم کے مرتبے پر نہیں اترتا۔ اور وہ حقیقت میں امر کے مطابق علم کی خبر دے سکتا ہے، لیکن حقیقت پر متعین نہیں ہوتا، جیسا کہ ہم نے اس میں احتمال (الاحتمال) کے داخل ہونے کا ذکر کیا۔ اسی طرح عوام میں سے غیر عالم بھی کبھی علم کو پا لیتے ہیں اور کبھی اپنی خبروں میں نہیں پاتے۔ اور نبی صلی اللہ علیہ وسلم ایسے نہیں ہیں۔ پس جب وہ اللہ کی طرف سے کسی امر کی خبر دیتے ہیں تو وہ ویسا ہی ہوتا ہے جیسا کہ انہوں نے خبر دی۔ پس اسے حاصل کرنے والا بلاشک عالم ہے، جیسا کہ وہ خبر بلاشک علم ہے۔\n\nاسی لیے آپ صلی اللہ علیہ وسلم نے یہ قید لگائی کہ علماء ہی انبیاء کے وارث ہیں، کیونکہ جب وہ رسول کے قول کو قبول کرتے ہیں تو وہ امر کو ویسا ہی جان لیتے ہیں جیسا کہ وہ ہے۔\n\nاور آپ صلی اللہ علیہ وسلم کی وراثت میں سے عورتوں اور خوشبو کی محبت اور آپ کی آنکھ کی ٹھنڈک نماز میں رکھی جانا ہے۔ لیکن جب یہ چیزیں انسان کے لیے محبوب بنا دی جائیں، تب وہ وارث ہوتا ہے۔ اور اگر وہ انہیں بغیر محبوب بنائے جانے کے خود سے محبت کرے تو وہ وارث نہیں ہے۔ کیونکہ بندہ اللہ کے لیے مخلوق ہے نہ کہ کسی اور کے لیے، جیسا کہ اللہ تعالیٰ نے فرمایا: **\"اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا۔\"** (الذاریات: ۵۶) پس اس نے انہیں صرف اپنی عبادت کے لیے پیدا کیا۔ اور موسیٰ علیہ السلام سے بارہ کلمات میں فرمایا: \"اے ابن آدم! میں نے تجھے اپنے لیے پیدا کیا۔\" (الحدیث)\n\nپھر اللہ نے بندے کے لیے دوسری حالت میں کسی چیز کو دوسروں سے زیادہ محبوب بنا دیا۔ اور بات اس میں باقی رہی کہ کس نے اسے محبوب بنایا؟ کیا اسے طبیعت (طبع) نے محبوب بنایا، یا لالچ (طمع) نے، یا خوف (حذر) نے، یا اللہ نے اسے محبوب بنایا؟ کیونکہ نبی صلی اللہ علیہ وسلم نے فرمایا: \"میرے لیے محبوب بنا دی گئیں۔\"\n\nاور یہ نہیں فرمایا کہ کس نے محبوب بنایا، جیسا کہ اللہ نے مومنوں کے حق میں فرمایا: **\"لیکن اللہ نے تمہارے لیے ایمان کو محبوب بنا دیا اور اسے تمہارے دلوں میں آراستہ کر دیا، اور کفر، فسق اور نافرمانی کو تمہارے لیے ناپسندیدہ بنا دیا۔\"** (الحجرات: ۷)\n\nاور نبی صلی اللہ علیہ وسلم نے \"محبوب بنا دی گئیں\" کہنے پر اکتفا کیا اور یہ ذکر نہیں کیا کہ کس نے محبوب بنایا، مگر اس معنی کی وجہ سے جسے قبول کرنے والے نفوس (نفوس) کی کمزوری کی وجہ سے ظاہر کرنا ممکن نہیں ہے۔ پس مواطن (المواطن) کے عارفین اس بات کو جانتے ہیں کہ اللہ نے عورتوں اور خوشبو کا ذکر کیوں کیا اور آنکھ کی ٹھنڈک نماز میں کیوں رکھی، کیونکہ وہ تمثیل (التمثیل) کی حضرۃ (حضرۃ) اور اس کے مقام سے اس کے مشاہدے پر نماز پڑھنے والا ہے جو اس کے سامنے مناجات (مناجاة) کے لیے کھڑا ہوتا ہے، کیونکہ اس میں خطاب، جواب اور قبولیت ہوتی ہے، اور یہ صرف شہود تمثیل (شہود التمثيل) میں ہی ہو سکتا ہے، کیونکہ یہ ایک ایسا مقام ہے جو شہود (الشهود) اور کلام (الکلام) کو جمع کرتا ہے۔\n\nاور چونکہ مناسبتیں مناسب کی طرف میلان کا تقاضا کرتی ہیں، اس لیے جس نے محبوب بنایا وہ عین مناسب (عین المناسب) ہے۔ اور مناسبت ذاتی (ذاتیۃ) بھی ہو سکتی ہے اور عرضی (عرضیۃ) بھی۔ اور چونکہ عورتیں تکوین (التکوین) کا محل ہیں، اور انسان صورت کے لحاظ سے فعال (فعال) ہونے کا تقاضا کرتا ہے، اور اس کے لیے ایک محل کا ہونا ضروری ہے جس میں وہ فعل کرے، اور وہ اپنے کمال کے لیے چاہتا ہے کہ اس سے صرف کمال ہی صادر ہو، جیسا کہ اصل میں تھا جس نے **\"ہر چیز کو اس کی خلقت عطا کی۔\"** (طٰہٰ: ۵۰) اور وہ اس شے کا کمال ہے۔ اور انسان کے وجود سے زیادہ کامل کوئی چیز نہیں، اور یہ صرف ان عورتوں میں ہو سکتا ہے جنہیں اللہ نے محل بنایا ہے۔ اور عورت انفعال (الانفعال) کے لحاظ سے مرد کا جزو ہے جس سے وہ منفعل ہوئی ہے۔ پس کامل کے لیے عورتیں محبوب بنا دی گئیں۔ اور چونکہ عورت جیسا کہ ذکر کیا گیا، مرد کی پسلی کا عین ہے، تو جو کچھ اس میں پیدا ہوا، وہ اس کا اپنا نفس ہی تھا، پس اس سے اس کے جیسا ظاہر نہیں ہوا مگر اس کے عین اور اس کے نفس میں۔ پس دیکھو یہ کتنا عجیب معاملہ ہے۔ پس جسے ایسا علم حاصل ہو گیا، اس نے اس تحبب (التحبب) میں اس وجہ سے نبی علیہ السلام کا ورث لیا۔\n\nجہاں تک خوشبو (الطيب) کا تعلق ہے، تو وہ سانسوں (الأنفاس) میں سے ہے، اور سانسیں رحمانی (رحمانیۃ) ہیں۔\n\nکیونکہ رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: \"میں رحمن (الرحمن) کی سانس (نفس الرحمن) پاتا ہوں۔\"\n\nپس آپ نے اسے رحمن کی طرف منسوب کیا۔ اور اللہ فرماتا ہے: **\"اور پاکیزہ عورتیں پاکیزہ مردوں کے لیے ہیں اور پاکیزہ مرد پاکیزہ عورتوں کے لیے ہیں۔\"** (النور: ۲۶) اور اللہ تعالیٰ کے اسماء میں سے ایک الطیب (الطيب) ہے۔ پس ہم نے جان لیا کہ پاکیزہ سانس (النفس الطيب) صرف اسم الطیب (الاسم الطيب) سے ہی ہو سکتی ہے۔ اور کائنات کے لیے رحمن سے زیادہ پاکیزہ کوئی نام نہیں، کیونکہ یہ رحمت عامہ (الرحمة العامة) میں مبالغہ ہے جو پوری کائنات کو شامل ہے۔ پس جسے ہر چیز میں خوشبو حاصل ہو، اگرچہ کوئی اسے طبعاً خبیث (خبیثا) سمجھے، تو وہ الٰہی صفت کے لحاظ سے پاکیزہ ہے۔ اور ہم نے مکہ میں اس کا ذائقہ چکھا ہے۔ پس وہ حقیقت میں وارث ہے۔\n\nاور نماز آپ کے لیے صرف اس لیے محبوب بنائی گئی کہ اس میں شہود (الشهود) اور کلام (الکلام) کا جمع ہونا ہے۔\n\nآپ کے اس قول کی وجہ سے: \"میری آنکھ کی ٹھنڈک نماز میں رکھی گئی۔\"\n\nاور آپ نے سننے یا کلام کرنے کا ذکر نہیں کیا، کیونکہ یہ عموم میں معروف ہے کہ نماز مناجات (مناجاة) ہے، آپ کے اس فرمان کی وجہ سے کہ بندہ ایسا کہتا ہے تو اللہ ایسا کہتا ہے۔ اور یہ اللہ اور اس کے نمازی بندے کے درمیان آدھی آدھی تقسیم ہے، جیسا کہ حدیث میں وارد ہے۔ اور نماز صرف غیر مشاہد (غیر المشاہد) پر اور اس شخص پر بھاری تھی جس نے حق کے قول کو نہیں سنا جو بندے کے نماز میں کہے ہوئے کا جواب دیتا ہے۔\n\nپھر آپ کا یہ نیابت (نیابۃ) کرنا کہ \"سمع اللہ لمن حمدہ\" (اللہ نے سن لیا جس نے اس کی حمد کی) مکمل ترین مقامات (المقامات) میں سے ہے۔ کیونکہ اللہ نے انسان کامل (الإنسان الکامل) کو کسی پر بھی خلافت (الخلافة) کے ذریعے ہی عظمت نہیں بخشی۔ اور چونکہ اس کا مقام عظیم تھا، اس لیے جس نے اس پر طعن کیا، اس نے مرتبے کی عظمت کی وجہ سے طعن کیا۔ اور طعن کرنے والے کو یہ علم نہیں تھا کہ اللہ نے انسانی نشأۃ (النشأة الإنسانية) میں کمال الٰہی (الکمال الإلهي) کو ودیعت کر رکھا ہے۔ اگر اس طعن کرنے والے کو پہلے علم ہوتا تو وہ طعن نہ کرتا۔\n\nپس جب خلافت، جو کہ ذات حق کی نیابت ہے، اس مرتبے پر تھی، اور نمازی \"سمع اللہ لمن حمدہ\" کہنے میں نائب تھا، جو صرف نماز میں ہوتا ہے، تو نماز کا مرتبہ عظیم تھا، پس وہ آپ صلی اللہ علیہ وسلم کے لیے محبوب بنا دی گئی۔ پس جسے تم دیکھو کہ وہ اس حد تک نماز سے محبت کرتا ہے، تو وہ وارث ہے، اور جسے تم دیکھو کہ وہ اس شہود (الشهود) کے علاوہ کسی اور وجہ سے اس سے محبت کرتا ہے، تو وہ وارث نہیں ہے۔\n\nاور اس منزل میں علوم میں سے یہ علم بھی ہے کہ کثیر کا واحد سے صادر ہونا، یعنی کثرت کی احدیت (أحدية الكثرة) نہ کہ واحد کی احدیت۔ اور نکاح الٰہی (النکاح الإلهي) اور کونی (الکونی) کا علم۔ اور نتائج اور مقدمات کا علم۔ اور نکاح کی فضیلت کا علم، کیونکہ کبھی وہ صرف لذت کے لیے مطلوب ہوتا ہے، اور کبھی تناسل (التناسل) کے لیے، اور کبھی دونوں کے لیے۔ اور وصیتوں کا علم۔ اور تقسیموں کا علم۔ اور فوت ہونے کے خوف سے پہل کرنے کا علم۔ اور خلطاء (الخلطاء) کا علم۔ اور ہبات (الھبات) کا علم۔ اور نفوس کی پاکیزگی (طیب النفوس) سے جو چیزیں معتبر ہیں ان کا علم۔ اور معروف (المعروف) کے ساتھ تصرف کا علم اور معروف کیا ہے۔ اور امانتوں کا علم۔ اور حصوں کا علم۔ اور حقوق کا علم۔ اور جو چیز مقدم کی جانی چاہیے اور جو مؤخر کی جانی چاہیے اس کا علم۔ اور حدود کا علم۔ اور اطاعت اور معصیت کا علم۔ اور شہادتوں اور فیصلوں کا علم۔ اور عشائر (العشائر) کا علم، جو وہ جماعت ہے جو ایک عقد (عقد) کی طرف لوٹتی ہے، جیسے عقد عشرہ۔ اور اسی لیے زوج کو عشیر (عشیر) کہا جاتا ہے، کیونکہ میاں بیوی کا اجتماع ایک عقد سے ہوتا ہے۔ اور معاشرت (المعاشرة) صحبت ہے۔ پس عشائر ساتھی ہیں۔ اور آدمی اپنے دوست کے دین پر ہوتا ہے، پس اس نے اس کے ساتھ اس چیز پر عقد کیا جو وہ ہے۔ اور تب وہ اس کے ساتھ معاشرت کرتا ہے۔ اللہ تعالیٰ فرماتا ہے: **\"اور ان کے ساتھ بھلے طریقے سے زندگی گزارو۔\"** (النساء: ۱۹) یعنی ان کے ساتھ اس طرح صحبت رکھو جس سے معلوم ہو کہ تم دونوں کے درمیان صحبت اور معاشرت قائم رہے گی۔ اور عزت اور منع کا علم۔ اور تجارتوں کی اقسام کا علم۔ اور مرد کی عورت پر فضیلت کا علم کہ وہ کس چیز سے ہے، اور وہ کمال کیا ہے جس میں عورت مرد کے ساتھ شریک ہوتی ہے۔ اور حقوق والوں کا علم۔ اور تقدیس (التقديس) کا علم۔ اور عنایت الٰہیہ (العنایۃ الإلهية) کا علم۔ اور خلفاء کے مراتب کا علم۔ اور ایمان کی حقیقت کیا ہے اس کا علم۔ اور عیبوں کا علم۔ اور جس چیز کی رغبت کی جاتی ہے اور جس کے حصول کی تمنا کی جاتی ہے اس کا علم۔ اور موت کا علم۔ اور جو کچھ اللہ کے لیے ہے اور جو خلق کے لیے ہے اس کا علم۔ اور نیکی کے حصے اور برائی کے حصے کے درمیان فرق کا علم۔ اور توقیت (التوقيت) کا علم اور جو چیز وقت کے ساتھ مقرر کی جاتی ہے اور جو وقت کے ساتھ مقرر نہیں کی جاتی اس کا علم۔ اور مومن کی حرمت اور اس کے مقام کا علم۔ اور ہجرت کا علم۔ اور ایمان کے ایمان کا علم۔ اور نرمی کا علم۔ اور راز اور ظاہر کا علم۔ اور وہ علم جس میں فرشتہ انسان کامل کے ساتھ جمع ہوتا ہے۔\n\nاور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے، اور جو کچھ ہم کہتے ہیں وہ اس پر نگہبان (وکیل) ہے۔",
    "fa": "«باب سیصد و هشتادم در شناخت جایگاه عالمان، وارثان پیامبران، از مقام محمدی»\n\nنور چشم نیست مگر نور نفس (قرة النفس) *** پس بنگر به هر معنایی که در حس پنهان شده است\n\nای سرور من، اگر صاحب بصیرت باشی، آن را خواهی یافت *** در فصل و نوع، با احکام و جنس\n\nچشم من هرگز جز آن را شهود (تشهد) نمی‌کند *** و مردم از این امر در شک و ابهام هستند\n\nبوی خوش و زن زیبا مشترک شده‌اند *** با مناجات، در معنا و در نفس\n\nپس در نماز، هستی (وجود) من است و زنان برای ما *** عرش هستند و در بوی خوش، دم‌ها (أنفاس) همراه با انس است.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «از دنیای شما سه چیز برای من دوست‌داشتنی گردانیده شده است: زنان، بوی خوش، و نور چشم من در نماز قرار داده شده است.»\n\nو فرمود (صلی الله علیه و سلم): «همانا پروردگار شما یکی است و پدر شما یکی است. پس هیچ برتری برای عرب بر عجم و برای عجم بر عرب نیست مگر به تقوا.» سپس این آیه را تلاوت فرمود: إِنَّ أَكْرَمَكُمْ عِنْدَ الله أَتْقاكُمْ (همانا گرامی‌ترین شما نزد خداوند، پرهیزگارترین شماست).\n\nمنظور از «پدر»، آدم (علیه السلام) است و این همان سخن خداوند متعال است: خَلَقَكُمْ من نَفْسٍ واحِدَةٍ (شما را از یک نفس واحد آفرید)، یعنی نفس آدم، که با آنچه از او منشعب شده است، سخن می‌گوید.\n\n[میراث (الورث) بر دو نوع است: معنوی و محسوس]\n\nپس بدان که میراث (الورث) بر دو نوع است: معنوی و محسوس. میراث محسوس آن است که به الفاظ، افعال و آنچه از احوال ظاهر می‌شود، تعلق دارد. اما افعال؛ وارث به آنچه رسول خدا (صلی الله علیه و سلم) انجام می‌داد، می‌نگرد؛ از اموری که برای وارث جایز است به جهت اقتدا به ایشان انجام دهد، نه آنچه مختص به آن حضرت است. این اقتدا باید در خلوص ایشان در نفس خود، با پروردگارش، در معاشرت با خانواده، فرزندان، خویشاوندان، یاران و تمام جهانیان باشد. وارث همه این‌ها را در اخبار روایت‌شده از رسول خدا (صلی الله علیه و سلم) که افعال ایشان را از صحیح و سقیم روشن می‌سازد، دنبال می‌کند. پس همه آن‌ها را دقیقاً همان‌گونه که وارد شده است، انجام می‌دهد؛ نه چیزی بر آن می‌افزاید و نه از آن می‌کاهد. و اگر روایات در آن‌ها اختلاف داشت، باید به هر روایت در زمانی عمل کند؛ یک بار به این روایت و یک بار به آن، حتی اگر یک بار باشد. و بر روایتی که ثابت شده است، مداومت کند و آنچه را که روایت شده است، حتی اگر از جهت سند ثابت نباشد، ترک نکند، مگر اینکه به حلال یا حرام تعلق داشته باشد؛ در این صورت، حرمت را در حق خود غالب سازد، که این برای او اولی است، زیرا او از اولی العزم است. و غیر از حلال و حرام، به هر روایتی عمل کند. و اگر اهل فتوا باشد و فتوایی دهد، در صورتی که ادله سمعی در حکم از هر جهت متعارض باشند و تاریخ (ناسخ و منسوخ) مجهول باشد و نتواند جمع کند، به آنچه برای رفع حرج نزدیک‌تر است، فتوا دهد و خود در حق خویش به سخت‌ترین عمل کند، زیرا سخت‌ترین برای او بهتر است. این از میراث لفظی است، زیرا مورد فتوا قرار می‌گیرد. پس نماز رسول خدا (صلی الله علیه و سلم) را در شب و روز، با کیفیت آن در حالاتش و کمیت آن در تعدادش، به جا می‌آورد. و روزه را نیز همین‌گونه می‌گیرد و با خانواده‌اش در شوخی و جد همین‌گونه رفتار می‌کند و در خوردن و آشامیدن و آنچه می‌خورد و می‌نوشد، بر اخلاق ایشان باشد، مانند احمد بن حنبل که در این مرتبه بود. از او روایت کرده‌ایم که تا زمان مرگ خربزه نخورد و وقتی در این باره از او می‌پرسیدند، می‌گفت: «به من نرسیده است که رسول خدا (صلی الله علیه و سلم) چگونه آن را می‌خورد.» و هر فعلی که در آن حدیثی نیافت که بیان کند رسول خدا (صلی الله علیه و سلم) آن را با کیفیت خاصی انجام داده است، یا اگر از کمیت‌ها باشد با کمیت خاصی، اما حدیثی در مورد آن وارد شده باشد، به آن عمل کن؛ مانند روزه گرفتن ایشان (صلی الله علیه و سلم) که آنقدر روزه می‌گرفت که می‌گفتیم افطار نمی‌کند و آنقدر افطار می‌کرد که می‌گفتیم روزه نمی‌گیرد، و راوی در آن توقیتی (زمان‌بندی) مشخص نکرده است. پس تو نیز همین‌گونه روزه بگیر و همین‌گونه افطار کن و روزه ماه شعبان را زیاد کن و هیچ ماهی را به طور کامل روزه نگیر، مگر ماه رمضان. و هر روزه یا فعلی که به آن امر شده است، حتی اگر فعل آن روایت نشده باشد، به خاطر امر آن عمل کن. و این معنای سخن خداوند است: إِنْ كُنْتُمْ تُحِبُّونَ الله فَاتَّبِعُونِي يُحْبِبْكُمُ الله (اگر خدا را دوست دارید، از من پیروی کنید تا خدا شما را دوست بدارد). و ما هیچ‌کس از کسانی را که دیده‌ایم یا درباره‌شان شنیده‌ایم، ندیده‌ایم که بر این قدم عمل کرده باشد، مگر مرد بزرگی در یمن به نام حداد، که شیخ ربیع بن محمود ماردینی خطّاب او را دیده بود و خبر داد که او بر این حال از اقتدا بوده است. این را دوست و خادم من، عبدالله بدر حبشی، از شیخ ربیع به من خبر داد. پس باید در هر چیزی از او پیروی کنی، زیرا خداوند می‌فرماید: لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ (قطعاً برای شما در رسول خدا سرمشقی نیکو است)، مگر آنکه چیزی از آن را با نهی از انجامش تخصیص داده باشد. و فرمود (صلی الله علیه و سلم): «نماز بخوانید همان‌گونه که دیدید من نماز می‌خوانم.»\n\nو در حج فرمود: «مناسک خود را از من بگیرید.»\n\nو اگر حج گزاردی، چنانچه توانایی قربانی (هدی) داشتی، با آن به صورت مُحرم برای حج یا عمره وارد شو. و اگر بار دیگر حج گزاردی، باز هم اگر توانایی قربانی داشتی، به صورت مُحرم برای حج وارد شو. و اگر قربانی نیافتی، برحذر باش که به صورت مُحرم برای حج وارد شوی، بلکه به صورت مُتمتّع با عمره مفرده وارد شو. پس چون طواف و سعی کردی، کاملاً از احرام خود خارج شو، سپس برای حج احرام ببند و مناسک را همان‌گونه که امر شده‌ای، انجام ده. و عزم کن که هیچ‌یک از افعال و احوال ظاهرشده ایشان را که برای تو مباح شده است، ترک نکنی و تمام آداب ایشان را تا حد توان رعایت کن. هیچ‌یک از آنچه وارد شده و تو توانایی انجامش را داری، ترک مکن، زیرا خداوند تو را جز به اندازه توانت مکلف نکرده است. پس آن را بذل کن و چیزی از آن را فرو مگذار، زیرا نتیجه آن بسیار عظیم است و قدرش قابل اندازه‌گیری نیست، و آن محبت خداوند نسبت به تو است، و تو حکم محبت را در محب می‌دانی. اما وارث معنوی، آن است که به باطن احوال تعلق دارد؛ از پاک‌سازی نفس از اخلاق نکوهیده و آراستن آن به مکارم اخلاق، و آنچه پیامبر (صلی الله علیه و سلم) بر آن بود از ذکر پروردگارش در همه احوالش، و این چیزی نیست جز حضور و مراقبه (المراقبة) آثار او سبحانه در قلب تو و در عالم. پس هیچ‌چیز در چشم تو نیفتد و در گوش تو حاصل نشود و هیچ نیرویی از نیروهای تو به چیزی تعلق نگیرد، مگر اینکه در آن نظر و اعتبار الهی داشته باشی و جایگاه حکمت الهی را در آن بدانی. حال رسول خدا (صلی الله علیه و سلم) همین‌گونه بود، چنانکه عایشه از ایشان روایت کرده است. همچنین، اگر از اهل اجتهاد در استنباط احکام شرعی باشی، وارث نبوت شرعی هستی، زیرا خداوند متعال برای تو در تثبیت حکمی که اجتهاد و دلیل تو به آن انجامیده است، تشریع کرده که آن را برای خودت تشریع کنی و اگر از تو سؤال شد، به دیگران فتوا دهی، و اگر سؤال نشد، فتوا ندهی. زیرا این نیز از شریعتی است که خداوند به تو اجازه داده است، نه از شریعتی که خداوند به آن اجازه نداده است.\n\n[اینکه اجتهاد به معنای ایجاد حکم جدید نیست]\n\nو بدان که اجتهاد به معنای ایجاد حکم جدید نیست؛ این اشتباه است. بلکه اجتهاد مشروع، در طلب دلیل از کتاب یا سنت و اجماع و فهم عربی برای اثبات حکمی در آن مسئله، با همان دلیلی است که در گمان خود برای تحصیل و علم به آن کوشیده‌ای. این است اجتهاد. زیرا خداوند متعال و رسولش چیزی را فرو نگذاشته‌اند مگر اینکه بر آن نص آورده‌اند و آن را مهمل رها نکرده‌اند. خداوند متعال می‌فرماید: الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ (امروز دین شما را برایتان کامل کردم). و پس از ثبوت کمال، افزایش پذیرفته نیست، زیرا افزایش در دین، نقص در دین است و آن همان شریعتی است که خداوند به آن اجازه نداده است. و از میراث معنوی (الورث المعنوی) آن است که از فهم در کتاب و در حرکات تمام عالم بر تو گشوده می‌شود. اما میراث الهی (الورث الإلهی)، آن است که از صور تجلی الهی (التجلی الإلهی) در ذات تو حاصل می‌شود، هنگامی که بر تو در آن تجلی می‌کند، زیرا تو او را جز به واسطه خودش نمی‌بینی. حق (الحق) در آن موطن، بینایی تو است. و صورت تجلی (تجلی) بر تو تکرار نمی‌شود، بلکه از آن منتقل شده و نظیر آن در ذات و مُلک تو حاصل شده است. به همین دلیل است که در آخرت به طور عمومی برای چیزی که اراده کنی، می‌گویی: كُنْ فَيَكُونُ (باش، پس می‌شود). و در دنیا به طور خصوصی، حق (الحق) برای تو در دنیا محل تکوین تو است، زیرا او به خاطر تنوع تو، متنوع می‌شود، و در آخرت تو به خاطر تنوع او، متنوع می‌شوی. پس او در دنیا صورت تو را می‌پوشد و تو در آخرت صورت او را می‌پوشی. پس بنگر که این امر چقدر شگفت‌انگیز است. همچنین، در میراث الهی (الميراث الإلهي) در مراتب عدد، برای تو سهمی است. حق (الحق) ممکن است چهارمینِ سه نفر باشد. پس اگر تو بیایی و به آن سه نفر بپیوندی و آن‌ها را چهار نفر کنی، این مرتبه برای تو حاصل نمی‌شود مگر اینکه حق (الحق) به مرتبه پنج منتقل شود و پنجمینِ چهار نفر گردد، پس از آنکه چهارمینِ سه نفر بود. پس مرتبه را برای تو خالی کرده و تو آن را به ارث برده‌ای. و همین‌گونه است در هر جماعتی که به آن می‌پیوندی. این حکم میراث در دنیا است. اما در میراث خصوص و در آخرت، او چهارمینِ چهار نفر است، در حالی که تو خود چهارمینِ آن چهار نفر هستی. زیرا تو در دنیا در مقام خصوص، به صورت حق (الحق) آمده‌ای و در آخرت نیز همین‌گونه، تو صورت حق هستی. و به همین دلیل، کسی که گفت: إِنَّ الله ثالِثُ ثَلاثَةٍ (خداوند سومینِ سه نفر است)، کفر ورزید، یعنی خود را پوشاند (ستر کرد) به پروردگارش، زیرا او عین سومینِ سه نفر است و خود را حق (الحق) دید نه خلق، مگر از حیث صورت جسمانی، نه از حیث آنچه بدان موصوف است. پس او حق (الحق) است در خلق، و خلق خود را با آنچه شهود (شهده) کرده از حق (الحق) که قائم به اوست و در عموم بر آن نص آمده که جمیع قوای بنده و صفات اوست، پوشاند، اگر از اهل خصوص باشد. پس درباره خود گفت: إِنَّ الله ثالِثُ ثَلاثَةٍ. سپس حق تعالی بلافاصله پس از این سخن بیان فرمود: وما من إِلهٍ إِلَّا إِلهٌ واحِدٌ (و هیچ معبودی جز خدای یگانه نیست). و اوست که آن سه را سه‌تایی کرده است. پس آن دو نفر از عامه هستند و آنکه آن‌ها را با خلق خود سه‌تایی کرده، سومینِ خلقی با خلق خود است. سپس او دانسته است که حق (الحق) جمیع قوای اوست و حق (الحق) به او شهود داده است که او با آن دو نفر نیز همانند حالتی است که با او دارد، جز اینکه علم این امر از آن دو نفر پوشیده شده است، پس آن‌ها به خلق قائل شدند نه به حق. پس این شخص خاص گفت: إِنَّ الله ثالِثُ ثَلاثَةٍ، زیرا او را در آن دو نفر شهود کرد، همان‌گونه که در نفس خود شهود کرد، در حالی که هُمْ لا يَشْعُرُونَ (آنان درک نمی‌کنند). پس دید که حق (الحق) آن‌ها را در صورت سه نفر جمع کرده است. بنابراین، سخن گوینده که او سومینِ سه نفر است، در هر دو وجه (خلق و حق) صحیح است. و این سخن نیز صحیح است که: وما من إِلهٍ إِلَّا إِلهٌ واحِدٌ، زیرا او عین هر یک از آن سه نفر است و غیر او نیست. پس او واحد است و سه نفر است. این از میراث الهی نبوی است، زیرا این شهود (الشهود) برای ما حاصل نشد مگر با اقتدا و پیروی نبوی. پس چون دانستیم، آن را از پیامبر (صلی الله علیه و سلم) به ارث بردیم. و میراث برای هیچ‌کس صحیح نیست مگر پس از انتقال موروث به برزخ. و آنچه بدون انتقال برای تو حاصل شود، میراث نیست، بلکه آن موهبت، عطیه و بخششی است که تو در آن نایب و خلیفه هستی، نه وارث. پس تو از حیث علم، وارث هستی و از حیث شهود (الشهود)، عین او هستی، نه وارث. آیا نمی‌بینی در:\n\nسخن ایشان (صلی الله علیه و سلم): «همانا پروردگار شما یکی است، همان‌گونه که پدر شما یکی است.»\n\nو پدر تو نیست مگر کسی که تو از او هستی. پس اگر دانستی که از چه کسی هستی، پدرت را شناخته‌ای. و پیامبر (صلی الله علیه و سلم) ذکر نکرد که پدر و مادر ما دو نفر هستند، چنانکه در ظاهر واقع شده است، زیرا ما از آدم و حوا هستیم، مانند سخن خداوند: ورَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ (و پدر و مادرش را بر تخت بالا برد). اما چون حوا عین آدم بود، زیرا او عین دنده او بود، پس جز یک پدر در دو صورت مختلف وجود نداشت، همان‌گونه که تجلی (التجلی) چنین است. پس عین حوا، عین آدم است، مانند جدایی راست از چپ، و آن عین زید است. همچنین جدایی حوا از آدم، پس او عین آدم است. پس در آنجا جز یک پدر نیست. پس ما جز از یک واحد صادر نشده‌ایم، همان‌گونه که تمام عالم جز از یک خدای واحد صادر نشده است. پس اگر امر چنین نباشد، عین (ذات) یکی است با نسبت‌های بسیار. وگرنه، نه وجودی برای ما ظاهر می‌شد، نه وجود عینی برای ما بود و نه ایجاد حکمی برای ما. پس همان‌گونه که ما را به صورت عین (ذات) موجود کرد، حکم را نیز برای او موجود کرد: جَزاءً وِفاقاً (پاداشی موافق). اگر متوجه شوی، او برای ما موجِدِ عین است و ما برای او موجِدِ رب.\n\nاگر حق (الحق) نبود، هستی (الوجود) نبود *** و اگر کَون (جهان) نبود، جز او نبود\n\nپاداشی که حق (الحق) از او اراده کرده است *** سؤال سؤال‌کنندگان است که «به چه کسی» و «او چیست»\n\nپس او در عموم بدون شک «او» است *** و اما در خصوص، اوست و «او چیست».\n\nسپس توالد و تناسل در هر نوعی از همه مولودات در دنیا تا زمانی که دنیا باقی است و در آخرت تا بی‌نهایت ادامه دارد، اگرچه احوال توالد متنوع باشد، چنانکه در دنیا در حوا، عیسی و بنی آدم ظاهر شد. و اما در آدم، با دو دست و با ارکان بود. و در گیاهان نیز در کاشت و بذر آن‌ها متنوع است. و همچنین در معادن. پس بنگر که حکمت خداوند در خلقش چقدر محکم است. و چون ما بر وجه خاصی که برای هر موجودی است آگاه شدیم، نتوانستیم توالد را به طور کلی به خود نسبت دهیم، بلکه هر آنچه در کَون (جهان) ظاهر شد، به او نسبت دادیم، و این همان سخن خداوند متعال است: وما أَمْرُنا (و فرمان ما) - و ما فرمان او هستیم - إِلَّا واحِدَةٌ (جز یک چیز نیست). پس در آنجا جز خداوند متعال، موجِدی نیست، از هر وجهی که باشد؛ کسی که می‌داند، می‌داند و کسی که نمی‌داند، نمی‌داند. همان‌گونه که طبیعیون در موجودات طبیعی به یگانگی طبیعت قائل هستند. پس هر آنچه از موجودات طبیعی ظاهر شد، گفتند این از طبیعت است. پس امر را واحد دانستند، همان‌گونه که ما اله را در خلقش واحد دانستیم. پس جز خدا نبود و او همان است که آنان طبیعت نامیدند، در حالی که علمی ندارند، همان‌گونه که دهریون آن را دهر (زمان) نامیدند، در حالی که علمی ندارند، جز اینکه خداوند برای ما خود را به «الدهر» نامیده است، اما خود را به «الطبیعة» نام ننهاده است. زیرا طبیعت برای کسی که عینی از آن به وجود آمده، غیر نیست، بلکه عین هر موجود طبیعی است. و چون حق (الحق) این حکم را داشت و نزد خواص بندگانش به آن ظاهر شد، و ما دانستیم که اسم دلالت بر مُسمّی دارد، پس دیدیم که اسم، اگرچه دلالت می‌کند، بیگانه است. پس دانستیم که حکم طبیعت با حکم دهر (الدهر) متفاوت است، زیرا دهر عین کائنات نیست. و ما طبیعت را عین کائنات طبیعی دیدیم. و دیدیم که حق (الحق) تنزیهی دارد که به واسطه آن از ما جدا می‌شود، مانند جدایی دهر از آنچه در آن واقع می‌شود. پس خداوند متعال برای تنزیه، خود را به «الدهر» نامید و خود را به «الطبیعة» نام ننهاد، زیرا امر غیر او نیست، بلکه عین اوست. و مُسمّی خود را برای خودش نام نمی‌گذارد، پس به «الطبیعة» نامیده نمی‌شود، بلکه خود را برای غیر خود نام می‌گذارد تا وقتی او را ذکر کند، بداند که او را ذکر می‌کند و وقتی ذکر شد، او را بشناسد. این است اصل وضع اسماء.\n\nپس در آنجا جز خدا نیست و هیچ چیز غیر او نیست *** و در آنجا جز دو نیست و خداوند سومین است\n\nاین را علمی که او برای ما گفته، نتیجه داده است *** پس من به علم خود به حقیقت، کِشت‌کارم (حارث).\n\nسخن ایشان (صلی الله علیه و سلم): «هر کس خود را شناخت، پروردگارش را شناخت.»\n\nپس شناخت انسان از نفس خود را مقدم داشت، زیرا نفس عین دلیل است و ناگزیر علم به دلیل باید بر علم به مدلول مقدم باشد. و دلیل، ما هستیم و ما در مقام زوجیت (الشفعية) قرار داریم. به همین دلیل، به خاطر وجود زوج، با «دو» تعبیر کردیم. پس نظر کردن در ما، وجود حق (الحق) و احدیت او را برای ما نتیجه داد. پس او سومینِ دو نفر است، همان‌گونه که چهارمینِ سه نفر است. به همین دلیل گفتیم: «و خداوند سومینِ این دو است.» و من «حارث» هستم، یعنی کسب‌کننده این علم از طریق نظر. سپس حق (الحق) نیز از ما میراثی دارد، چنانکه فرمود: إِنَّا نَحْنُ نَرِثُ الْأَرْضَ ومن عَلَيْها (همانا ما زمین و هر که بر آن است را به ارث می‌بریم)، از حیث عین و حکم. اما در عین، سخن اوست: وإِلَيْنا تُرْجَعُونَ (و به سوی ما بازگردانده می‌شوید). زیرا امور به اصول خود بازمی‌گردند، همان‌گونه که آخر دایره به اول آن برمی‌گردد. از همان ابتدا که دایره را شروع می‌کنی، هدف از آن بازگشت به اصل آن است که آغاز آن است، پس به سوی او ختم می‌شود. ما چیزی را جز به واسطه او نمی‌دانیم. پس او این صفت را از ما به ارث برد و خداوند متعال فرمود: ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ (و قطعاً شما را می‌آزماییم تا بدانیم)، همان‌گونه که ما نظر کردیم تا دانستیم. پس این وصف بدون مشارکت برای ما خالص نشد. پس دانستیم که علم ما از طریق نظر و استدلال است، با علم به اینکه او عالم به آن است، از آن جهت که نظر ما به واسطه ما نبوده است، زیرا او فرمود که آن عین صفت ماست که با آن می‌نگریم و می‌بینیم و می‌شنویم و می‌گیریم. و همه این‌ها علم پیامبرانی است که ما از آن‌ها ارث برده‌ایم، زیرا آن‌ها جز علم بر حقیقت را به ما به ارث نداده‌اند و آن شریف‌ترین چیزی است که به ارث برده می‌شود. سپس بنگر در:\n\nسخن ایشان (صلی الله علیه و سلم): «عالمان (العلماء) وارثان پیامبران (الأنبياء) هستند.»\n\nپس الف و لام در هر دو (عالمان و پیامبران) شامل هر عالم و هر خبردهنده‌ای می‌شود. و شکی نیست که هر خبردهنده‌ای آنچه را که خبر می‌دهد، تصور می‌کند و هر شنونده آن خبر، آن را دانسته است، یعنی آنچه را که آن خبردهنده تصور کرده، دانسته است، چه آن خبر دروغ باشد و چه راست. پس آن بی‌شک میراث است. آیا نمی‌بینی که:\n\nایشان (صلی الله علیه و سلم) فرمود: «هر کس حدیثی را روایت کند که می‌داند دروغ است، پس او یکی از دروغ‌گویان است.»\n\nزیرا او دروغ را از او به ارث برده و حکم او، حکم دروغ‌گو شده است، همان‌گونه که حکم وارث در مال، حکم کسی است که از او مرده و مال را به جا گذاشته است. و چون عالمان (العلماء) با الف و لام تعمیم داده شدند، سخن خداوند: حَتَّى نَعْلَمَ (تا بدانیم) در آن داخل شد. و چون پیامبران (الأنبياء) با الف و لام تعمیم داده شدند، هر خبردهنده‌ای با گفتار یا حال در آن داخل شد، زیرا کسی که پس از عدم ظهور، برای چشم تو ظاهر شود، با ظهورش به تو خبر داده است که برای تو ظاهر شده است. حتی اگر به تو بگوید: «من برای تو ظاهر شدم»، علم به ظهورش را به تو نمی‌دهد، بلکه علم به سخن گفتن او را به تو می‌دهد، یعنی به خاطر تو برای چشمت ظاهر شده است. پس مفهوم اول، نزد اهل ظاهر، نزدیکی ظاهری است که در منزلت نص قرار دارد، مبنی بر اینکه عالمان (العلماء) وارثان پیامبرانی هستند که خبردهندگان از جانب خدایند. و با مفهوم دوم که مفهوم اول را خدشه‌دار نمی‌کند، عالمان (العلماء) وارثان خبردهندگان به آنچه خبر داده‌اند، هستند، هر که می‌خواهند باشند. اما علم موروث از پیامبران (علیهم السلام) آن علمی نیست که عقول و حواس بدون اخبار، به تنهایی قادر به درک آن باشند، زیرا آن وراثت نخواهد بود. بلکه آنچه عالمان از پیامبران به ارث می‌برند، چیزی است که عقول از حیث نظر خود، به تنهایی قادر به درک آن نیستند. اما آنچه از پیامبران از علم الهی به ارث برده‌ای، آن است که عقول با ادله خود آن را می‌آرایند. و اما آنچه عقول آن را جایز می‌دانند، پیامبران یکی از آن دو امر جایز را برای آن‌ها تعیین می‌کنند، مانند سخن ابراهیم: ولكِنْ لِيَطْمَئِنَّ قَلْبِي (بلکه تا قلبم آرام گیرد). و اما علمی که ترثه از پیامبران (علیهم السلام) از علم اکوان (جهان‌ها) به ارث می‌بری، علم آخرت و مال عالم است، زیرا همه این‌ها از قبیل امکان است. پس پیامبران از جانب خدا تعیین می‌کنند که برخی از ممکنات به طور مشخص واقع خواهند شد، و عالم آن را می‌داند. پس این میراث نبوی است که قبل از خبر دادن این پیامبر، آن را نمی‌دانست. و غیر از این، علم موروث نیست، مگر در حق شخص عامی که عقلش حق خود را ادا نکرده است، پس علمی را از پیامبر دریافت می‌کند که اگر با عقل خود در آن نظر می‌کرد، آن را درک می‌کرد، مانند توحید خدا و وجود او و بعضی از احکام اوصاف و اسماء که به او تعلق دارد. پس این در حق کسی که آن را جز از طریق پیامبر نیاموخته، علم موروث است. و ما آن را علم نامیدیم، زیرا پیامبران جز به آنچه امر در نفس خود بر آن است، خبر نمی‌دهند، زیرا آن‌ها در اخبارشان از جانب خدا معصوم هستند از اینکه چیزی بگویند که امر در نفس خود بر آن نیست. برخلاف غیر پیامبران از خبردهندگان، چه عالم و چه غیر عالم. زیرا عالم ممکن است چیزی را که دلیل نیست، دلیل بپندارد و به آنچه آن دلیل به او داده است، خبر دهد، سپس از آن بازگردد. به همین دلیل، او در درجه علم به منزلت پیامبر (صلی الله علیه و سلم) نمی‌رسد. و ممکن است به علم بر آنچه در نفس الامر است، خبر دهد، اما به حقیقت تعیین نمی‌شود، به دلیل آنچه ذکر کردیم از ورود احتمال در آن. و همچنین غیر عالم از عوام، ممکن است به علم دست یابند و ممکن است در اخبارشان به آن دست نیابند. و پیامبر (صلی الله علیه و سلم) چنین نیست. پس اگر از امری از جهة الله خبر دهد، همان‌گونه است که خبر داده است. پس کسی که آن را به دست می‌آورد، بی‌شک عالم است، همان‌گونه که آن خبر بی‌شک علم است. به همین دلیل، ایشان (صلی الله علیه و سلم) مقید فرمود که عالمان (العلماء) وارثان پیامبران (الأنبياء) هستند، زیرا وقتی آنچه را رسول گفته است، می‌پذیرند، امر را بر آنچه هست، دانسته‌اند. و از میراث ایشان (صلی الله علیه و سلم)، دوست داشتن زنان و بوی خوش و قرار گرفتن نور چشم (قرة عينه) در نماز است. اما اگر این امور در انسان دوست‌داشتنی گردانیده شده باشد، در آن هنگام وارث است. و اگر آن را بدون اینکه دوست‌داشتنی گردانیده شود، دوست بدارد، وارث نیست. زیرا بنده مخلوق خداست نه غیر او، چنانکه خداوند متعال فرمود: وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ (و جن و انس را نیافریدم مگر برای اینکه مرا بپرستند). پس آن‌ها را جز برای عبادت خود نیافرید. و در دوازده کلمه به موسی فرمود: «ای پسر آدم، تو را برای خودم آفریدم.»\n\nحدیث. سپس خداوند در حالت دوم از بنده، امری را بیش از دیگر امور برای او دوست‌داشتنی گردانید. و سخن در این باقی است که چه کسی آن را برای او دوست‌داشتنی گردانیده است؟ آیا طبع، یا طمع، یا ترس، یا خداوند آن را برای او دوست‌داشتنی گردانیده است؟\n\nپیامبر (صلی الله علیه و سلم) فرمود: «دوست‌داشتنی گردانیده شد برای من.»\n\nو نگفت چه کسی آن را دوست‌داشتنی گردانیده است، همان‌گونه که خداوند در حق مؤمنان فرمود: ولكِنَّ الله حَبَّبَ إِلَيْكُمُ الْإِيمانَ وزَيَّنَهُ في قُلُوبِكُمْ وكَرَّهَ إِلَيْكُمُ الْكُفْرَ والْفُسُوقَ والْعِصْيانَ (ولی خداوند ایمان را برای شما دوست‌داشتنی گردانید و آن را در دل‌های شما آراست و کفر و فسق و عصیان را برای شما ناخوشایند ساخت). و پیامبر (صلی الله علیه و سلم) به گفتن «دوست‌داشتنی گردانیده شد» اکتفا کرد و ذکر نکرد چه کسی آن را دوست‌داشتنی گردانیده است، مگر به دلیلی که اظهار آن به خاطر ضعف نفوس پذیرنده ممکن نیست. پس عارفان به مواطن (جایگاه‌ها) می‌دانند که از حیث آنچه خداوند ذکر کرده است، زنان و بوی خوش و قرار دادن نور چشم (قرة العين) در نماز، به این دلیل است که نمازگزار بر شهود (الشهود) کسی است که در مقابل او ایستاده و با او مناجات می‌کند.\n\nاین از حضرت تمثیل و موطن آن است، زیرا در آن خطاب، پاسخ و پذیرش وجود دارد و این جز در شهود تمثیل (شهود) حاصل نمی‌شود، زیرا آن در موطنی است که شهود و کلام را جمع می‌کند. و چون مناسبت‌ها اقتضای میل مناسب به مناسب را دارد، پس آنکه دوست‌داشتنی گردانیده، عین مناسب است. و مناسبت ممکن است ذاتی یا عرضی باشد. و چون زنان محل تکوین هستند و انسان به واسطه صورت، اقتضا دارد که فاعل باشد و ناگزیر به محلی نیاز دارد که در آن فعل کند، و برای کمال خود می‌خواهد که جز کمال از او صادر نشود، همان‌گونه که در اصل بود که أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ (به هر چیزی خلقتش را عطا کرد)، و آن کمال آن چیز است، و کامل‌تر از وجود انسان نیست، و این جز در زنان که خداوند آن‌ها را محل قرار داده است، حاصل نمی‌شود. و زن جزئی از مرد است به واسطه انفعالی که از او منفعل شده است. پس زنان برای انسان کامل (الکامل) دوست‌داشتنی گردانیده شدند. و چون زن، همان‌گونه که ذکر شد، عین دنده مرد است، پس محل تکوین آنچه در او تکوین یافته، جز نفس خود او نبوده است. پس نظیر او جز در عین و نفس او ظاهر نشده است. پس بنگر که این امر چقدر شگفت‌انگیز است. پس هر کس چنین علمی را به دست آورد، پیامبر (علیه السلام) را در این دوست‌داشتنی گردانیده شدن، به این وجه به ارث برده است. و اما بوی خوش (الطیب)، آن از دم‌ها (الأنفاس) است و دم‌ها رحمانی هستند.\n\nزیرا رسول خدا (صلی الله علیه و سلم) می‌فرماید: «من بوی (نفس) رحمان را می‌یابم.»\n\nپس آن را به رحمان نسبت داد. و خداوند می‌فرماید: والطَّيِّباتُ لِلطَّيِّبِينَ والطَّيِّبُونَ لِلطَّيِّباتِ (زنان پاک برای مردان پاک و مردان پاک برای زنان پاک). و از اسماء متعالی او «الطیب» (پاک) است. پس دانستیم که نفس پاک (النفس الطیب) جز از اسم پاک (الاسم الطیب) نیست. و برای کَون (جهان) هیچ اسمی پاک‌تر از «الرحمن» نیست، زیرا آن مبالغه در رحمت عامه‌ای است که تمام کَون را در بر می‌گیرد. پس هر کس بوی خوش را در هر چیزی بیابد، حتی اگر کسی آن را به طبع خبیث بداند، اما آن به وصف الهی پاک است. و ما این را در مکه چشیدیم. پس او وارث بر حقیقت است. و نماز برای او دوست‌داشتنی گردانیده نشد، مگر به دلیل آنچه در آن از جمع بین شهود (الشهود) و کلام وجود دارد.\n\nبه واسطه سخن ایشان: «نور چشم من در نماز قرار داده شده است.»\n\nو به گوش و کلام خود نپرداخت، زیرا این امر در عموم معروف است که نماز مناجات است، به واسطه سخن خداوند که می‌فرماید: «بنده چنین می‌گوید و خداوند چنین می‌گوید»، و اینکه نماز میان خدا و بنده نمازگزارش به دو نیم تقسیم شده است، چنانکه در حدیث وارد شده است. و نماز سنگین نبود مگر بر کسی که شهود (المشاهد) ندارد و بر کسی که سخن حق (الحق) را در پاسخ به آنچه بنده در نمازش می‌گوید، نمی‌شنود. سپس نیابت او در گفتن «سَمِعَ اللهُ لِمَن حَمِدَهُ» (خداوند سخن کسی که او را ستایش کند، شنید) از کامل‌ترین مقامات است، زیرا خداوند انسان کامل (الإنسان الکامل) را بر کسی که او را بزرگ داشته، جز به واسطه خلافت (نیابت) بزرگ نداشته است. و چون مقام او عظیم بود، به همین دلیل طعن از سوی کسانی که طعن زدند، به خاطر عظمت مرتبه واقع شد. و طعن‌زننده ندانست که خداوند چه کمال الهی را در نشأت انسانی به ودیعه نهاده است. اگر علم بر آن طعن‌زننده پیشی می‌گرفت، طعن نمی‌زد. پس چون خلافت که همان نیابت از حق (الحق) است، دارای این منزلت بود و نمازگزار در «سَمِعَ اللهُ لِمَن حَمِدَهُ» که جز در نماز نیست، نایب بود، مرتبه نماز عظیم شد و برای ایشان (صلی الله علیه و سلم) دوست‌داشتنی گردانیده شد. پس هر کس را دیدی که نماز را بر این حد دوست می‌دارد، او وارث است و هر کس را دیدی که آن را برای غیر این شهود (الشهود) دوست می‌دارد، وارث نیست. و در این منزل از علوم، علم صدور کثیر از واحد، یعنی احدیت کثرت نه احدیت واحد، و علم نکاح الهی و کونی، و علم نتایج و مقدمات، و علم برتری نکاح (مفاضلة النکاح) است، زیرا گاهی برای صرف لذت، گاهی برای تناسل و گاهی برای هر دو اراده می‌شود. و علم وصایا، و علم تقسیمات، و علم پیشی گرفتن از ترس فوت، و علم همنشینان (الخلطاء)، و علم هبه‌ها (بخشش‌ها)، و علم آنچه از پاکی نفوس (طیب النفوس) معتبر است، و علم تصرف به معروف و اینکه معروف چیست، و علم امانات، و علم بهره‌ها (الحظوظ)، و علم حقوق، و علم آنچه باید مقدم شود و آنچه باید مؤخر شود، و علم حدود، و علم طاعت و معصیت، و علم شهادات و قضاوت‌ها، و علم عشایر (العشائر) که همان جماعتی است که به یک عقد واحد بازمی‌گردند، مانند عقد ده نفر. و به همین دلیل، زوج را «عشیر» نامیده‌اند، زیرا اجتماع زوجین از روی عقد بوده است. و معاشرت همان مصاحبت است. پس عشایر همان اصحاب هستند و انسان بر دین دوست صمیمی خود است، پس با او بر آنچه هست، عقد بسته است و در آن هنگام با او معاشرت کرده است. خداوند متعال می‌فرماید: وعاشِرُوهُنَّ بِالْمَعْرُوفِ (و با آنان به شایستگی معاشرت کنید)، یعنی با آنان به گونه‌ای مصاحبت کنید که دانسته شود مصاحبت و معاشرت میان شما دوام می‌یابد. و علم عزت و منع، و علم انواع تجارت‌ها، و علم برتری مرد بر زن به چه دلیل بوده است و کمالی که زن در آن با مرد شریک است، و علم صاحبان حقوق، و علم تقدیس، و علم عنایت الهی، و علم مراتب خلفا، و علم اینکه حقیقت ایمان چیست، و علم عیب‌ها (المعیبات)، و علم آنچه مورد رغبت است و آرزوی تحصیل آن می‌رود، و علم مرگ، و علم آنچه برای خدا و برای خلق است، و علم تفاوت میان نصیب حسنه و نصیب سیئه، و علم توقیت (زمان‌بندی) و آنچه زمان‌بندی می‌شود از آنچه توقیت در آن راه ندارد، و علم حرمت مؤمن و جایگاه او، و علم هجرت، و علم ایمانِ ایمان، و علم رفق (مدارا)، و علم سر و جهر (آشکار)، و علم آنچه مَلَک (فرشته) با انسان کامل (الکامل من البشر) در آن جمع می‌شود. و خداوند يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وهو عَلى‏ ما نَقُولُ وَكِيلٌ‏ (حق را می‌گوید و او راه را هدایت می‌کند و او بر آنچه می‌گوییم وکیل است)."
  },
  "page_count": 5
}