{
  "id": 403,
  "title": {
    "ar": "الباب الثالث وأربعمائة في معرفة منازلة لا حجة لي على عبيدي ما قلت لأحد منهم لم عملت إلا قال لي أنت عملت",
    "en": "Chapter Four Hundred and Three: Concerning the Gnosis (معرفة) of the Spiritual Station (منازلة) wherein [The Real declares]: \"I have no proof against My servants. I have not said to any one of them, 'Why did you act?' except that he replied to Me, 'You acted.'\"",
    "ur": "باب چار سو تین: اس مباحثہ (منازلة) کی معرفت میں [جہاں ذات حق فرماتی ہے]: \"مجھے اپنے بندوں پر کوئی حجت (دلیل) نہیں ہے، میں نے ان میں سے کسی سے نہیں کہا کہ تم نے یہ کیوں کیا؟ مگر اس نے مجھے جواب دیا کہ آپ نے ہی یہ کیا ہے۔\"",
    "fa": "باب چهارصد و سوم در معرفتِ منازله‌ای که مرا بر بندگانم حجتی نیست؛ به هیچ یک از ایشان نگفتم «چرا عمل کردی؟» مگر آنکه به من گفت: «تو عمل کردی.»"
  },
  "content": {
    "ar": "## «الباب الثالث وأربعمائة في معرفة منازلة لا حجة لي على عبيدي ما قلت لأحد منهم لم عملت إلا قال لي أنت عملت»\n\n\nوقال الحق ولكن السابقة أسبق بلا شك فلا تبديل‏\n\n\n> إذا كنت حقا فالمقال مقالتي *** وإن لم أكن فالقول قول المنازع‏\n\n\n> لي الحجة البيضاء في كل موطن *** به فهي تبدو في قريب وشاسع‏\n\n\n> ولما دعاني للحديث مسامرا *** تجافت جنوبي رغبة عن مضاجعي‏\n\n\n> فقال لنا أهلا بأكرم سامر *** يعيد عن الأكفاء للكل جامع‏\n\n\n> فقلت له لولاك ما كنت جامعا *** لحق وخلق ثم فاضت مدامعي‏\n\n\n> فقال أ تبكي قلت دمع مسرة *** لما ملئت مما تقول مسامعي‏\n\n\n### [الكريم هو الذي يترك ماله قبل أن يسألها]\n\n\nقال الله عز وجل والله خَلَقَكُمْ وما تَعْمَلُونَ اعلم أن الكريم هو الذي يترك ماله ويؤدي ما أوجبه على نفسه من الحقوق كرما منه قبل أن يسألها ثم إنه يمنع وقتا ويطالب وقتا لتظهر بذلك منزلة الشافع عنده في مثل هذا وكرمه بالسائل فيما سأله فيه بإجابته وعبيد الله عبد إن عبد ليس للشيطان عليه سلطان وهو عبد الاختصاص وهو الذي لا ينطق إلا بالله ولا يسمع إلا بالله فالحجة لله لا له قُلْ فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ فإنها حجة الله ومن عبيد الاختصاص من ينطق عن الله ويسمع من الله فهذا أيضا من أهل الحجة البالغة لأنه لا ينطق عَنِ الْهَوى‏ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏ فهو تعالى السائل والمجيب وأما عبد العموم فهو الذي قال عنهم لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم وإِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فما خص عبيدا من عبيد وأضافهم إليه وقوله يا عِبادِيَ الَّذِينَ أَسْرَفُوا فأضافهم إليه مع كونهم مسرفين على الإطلاق في الإسراف ونهاهم أن يقنطوا من رحمة الله وهذا وأمثاله أطمع إبليس في رحمة الله من عين المنة ولو قنط من رحمة الله لزاد إلى عصيانه عصيانا وأخبر الله عنه في إسرافه أنه يعدنا الفقر ويأمرنا بالفحشاء ليجعل فضله تعالى في مقابلة ما وعد به الشيطان من الفقر الذي هو به مأمور في قوله تعالى وعِدْهُمْ فهو مصدق لله فيما أخبر به عنه ممتثل أمر الله بشبهة في أمره في قوله وعِدْهُمْ وجعل مغفرته في مقابلة الفحشاء والأمر بالفحشاء من الفحشاء فدخل تحت وعد الحق بالمغفرة فزاده طمعا وإن كانت دار النار مسكنه لأنه من أهلها وإن حارت عليه أو زار من اتبعه ممن هو من أهل النار فما حمل إلا ما هو منقطع بالغ إلى أجل وفضل الله لا انقطاع له لأنه خارج عن الجزاء الوفاق ورحمة الله لا تخص محلا من محل ولا دارا من دار بل وسعت كل شي‏ء فدار الرحمة هي دار الوجود وهؤلاء العبيد المذكورون ذكرهم الله بالإضافة إليه والإضافة إليه تشريف فجمع في الإضافة بين العبيد الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ الذين نهاهم سبحانه أن يقنطوا من رحمة الله وبشرهم أنه يَغْفِرُ الذُّنُوبَ جَمِيعاً ولم يعين وقتا فقد تكون المغفرة سابقة لبعض العبيد لاحقة لبعض العبيد وبين العبيد الذين ليس للشيطان عليهم سلطان‏\n> فما تم إلا عبده وهو ربه *** وما تم إلا راحم ورحيم‏\n\n\nأراد بالرحيم هنا المرحوم اسم مفعول مثل قتيل وجريح وطريد ولا تَبْدِيلَ لِكَلِماتِ الله وهي أعيان العالم وإنما التبديل لله لا لهم ما نَنْسَخْ من آيَةٍ أَوْ نُنْسِها نَأْتِ بِخَيْرٍ مِنْها أَوْ مِثْلِها وفي قراءة أو ننساها فَأُوْلئِكَ يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ ومن يُبَدِّلْ نِعْمَةَ الله وهي ما بشرنا به من عموم مغفرته من بَعْدِ ما جاءَتْهُ فمن هنا وإن كانت شرطا ففيها رائحة الاستفهام وقال في الجواب فَإِنَّ الله شَدِيدُ الْعِقابِ ولم يقل فإن الله يعاقب من بدل نعمة الله فهو كما قال شَدِيدُ الْعِقابِ في حال العقوبة فما ثم من يقدر يُبَدِّلْ نِعْمَةَ الله من بَعْدِ ما جاءَتْهُ فيبدل نعمة الله بما هو خير منها بحسب حاجة الوقت فإن الحكم له أو مثلها والنسخ تبديل لا بدائم أنه القائل‏\n\n\nأنا عند ظن عبدي بي فليظن بي خيرا\n\n\nفمن لم يظن بالله خيرا فقد عصى أمره وجهل ربه وأشقى من إبليس فلا يكون وقد أخبر الله تعالى عنه أنه يتبرأ من الكافر ووصفه بالخوف لله رب العالمين وقد ذكر تعالى أنه إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ وأتم هذه الآية بقوله إِنَّ الله عَزِيزٌ أي يمتنع أن يؤثر فيه أمر يحول بينه وبين عموم مغفرته على عباده غَفُورٌ ببنية مبالغة في الغفران بعمومها فهي رجاء مطلق للعصاة على طبقاتهم وقوله فيمن يُبَدِّلْ نِعْمَةَ الله من بَعْدِ ما جاءَتْهُ أنه شَدِيدُ الْعِقابِ أي يسرع تعالى إلى من هذه صفته بالعقاب وهو أن يعقبه فيما بدله أن التبديل لله عز وجل ليس له فيعرفه أنه بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ فإن الله ما قرن بهذا العقاب ألما ومتى لم يقرن الألم بعذاب أو عقاب فله محمل في عين الأمر المؤلم فإنه لا يخاف إلا من الألم ولا يرغب إلا في الالتذاذ خاصة هذا يقتضيه الطبع الذي وجد عليه من يقبل الألم واللذة وقد أعطى الله لعبيدة في القرآن من الاحتجاج ما لا يحصى كثرة كل ذلك تعليم من الله فلو كان الشقاء يستأصل الشقي ما بسط الله لعباده من الرحمة ما بسط ولا ذكر من الحجج ما ذكره وهو قوله وعَلَّمَكَ ما لَمْ تَكُنْ تَعْلَمُ وكانَ فَضْلُ الله عَلَيْكَ عَظِيماً ولا يعظم الفضل الإلهي إلا في المسرفين والمجرمين وأما في المحسنين ف ما عَلَى الْمُحْسِنِينَ من سَبِيلٍ فإن الفضل الإلهي جاءهم ابتداء وبه كانوا محسنين وما بقي الفضل الإلهي إلا في غير المحسنين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ ويَهْدِي من يَشاءُ. إِلى‏ صِراطٍ مُسْتَقِيمٍ‏\n\n",
    "en": "## Chapter 403: Concerning the Knowledge of a Station Where I Have No Argument Against My Servants. I Did Not Say to Any of Them, \"Why Did You Do This?\" Except That He Replied to Me, \"You Did It.\"\n\nThe Real (الحق) spoke, but the Precedence (السابقة) is undoubtedly more precedent, so there is no alteration (تبديل).\n\n> If I am the Real, then the saying is My saying;\n> And if I am not, then the speech is the speech of the contender.\n>\n> I possess the clear argument (الحجة البيضاء) in every station\n> Where it appears, whether near or far.\n>\n> And when He called me to converse in the night,\n> My sides drew away from my resting places.\n>\n> Then He said to us, \"Welcome to the noblest night companion,\n> Who returns from the equals, gathering all.\"\n>\n> I said to Him, \"Were it not for You, I would not be a gatherer\n> Of the Real (حق) and Creation (خلق).\" Then my tears flowed.\n>\n> He said, \"Do you weep?\" I replied, \"Tears of joy,\n> Because my ears have been filled with what You say.\"\n\n### [The Generous One (الكريم) is He who relinquishes His wealth before it is requested]\n\nAllah, the Mighty and Majestic, said: <<وَاللهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do). Know that the Generous One (الكريم) is He who relinquishes His wealth and fulfills the rights He has made incumbent upon Himself, out of His generosity, before they are requested. Then, at times He withholds, and at times He demands, so that the station of the intercessor (الشافع) in such matters may become manifest before Him, as well as His generosity toward the petitioner by answering what he requested.\n\nAnd among the servants of Allah is a servant—if he is a servant—over whom Satan has no authority. This is the servant of Specialization (عبد الاختصاص), who speaks only by Allah and hears only by Allah. Thus, the argument (الحجة) belongs to Allah, not to him. <<قُلْ فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ>> (Say: 'To Allah belongs the conclusive argument'), for it is Allah’s argument. And among the servants of Specialization (عبيد الاختصاص) are those who speak on behalf of Allah and hear from Allah. This one is also among the people of the conclusive argument (الحجة البالغة), because he <<مَا يَنطِقُ عَنِ الْهَوَىٰ * إِنْ هُوَ إِلَّا وَحْيٌ يُوحَىٰ>> (does not speak out of [personal] desire; it is nothing but a revelation revealed). Thus, He (the Exalted) is the Questioner and the Answerer.\n\nAs for the servant of Generality (عبد العموم), they are those concerning whom He said to the Messenger of Allah (may Allah bless him and grant him peace): <<وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ>> (And when My servants ask you concerning Me, then indeed I am near; I answer the call of the caller when he calls upon Me). He did not specify certain servants apart from others, yet He attributed them to Himself. And His saying: <<يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا>> (O My servants who have transgressed [against themselves]), He attributed them to Himself despite their absolute excessiveness in transgression, and He forbade them from despairing of Allah’s Mercy. This and similar instances gave Iblis more hope in Allah’s Mercy, stemming from the very source of the Divine Favor (المنة). If he had despaired of Allah’s Mercy, he would have added disobedience to his disobedience.\n\nAllah informed us concerning Iblis’s transgression that he promises us poverty and commands us to immorality (الفحشاء), so that His (Exalted) Favor (فضل) may be set against what Satan promised—namely, poverty—which he was commanded to do in His saying: <<وَعِدْهُمْ>> (And promise them). Thus, he confirms Allah in what He informed about him, and he obeys Allah’s command, albeit with a semblance of doubt regarding His command in the saying <<وَعِدْهُمْ>>. And He made His forgiveness (مغفرة) correspond to immorality. Since commanding immorality is itself an immorality, it falls under the promise of the Real (الحق) for forgiveness, which increases Iblis’s hope. Even though the Abode of Fire (دار النار) is his dwelling, because he is one of its people, and even if it encompasses him or he visits those who followed him who are also people of the Fire, he only bears what is finite and reaches a term. But Allah’s Favor (فضل الله) has no cessation, because it is outside the scope of the commensurate recompense (الجزاء الوفاق). And Allah’s Mercy (رحمة الله) does not specify one place over another, nor one abode over another; rather, it encompasses everything. Thus, the Abode of Mercy is the Abode of Existence (دار الوجود).\n\nThese mentioned servants are those whom Allah mentioned by attributing them to Himself, and attribution to Him is an honor. Thus, He combined in this attribution the servants <<الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ>> (who have transgressed against themselves)—whom He forbade from despairing of Allah’s Mercy and gave glad tidings that He <<يَغْفِرُ الذُّنُوبَ جَمِيعًا>> (forgives all sins), without specifying a time—so forgiveness may be precedent for some servants and subsequent for others—and the servants over whom Satan has no authority.\n\n> Nothing is perfected except His servant, and He is his Lord;\n> And nothing is perfected except the Merciful (Rahim) and the one shown mercy (Marhum).\n\nBy *al-Rahim* (الرحيم) here, He intended *al-Marhum* (the one shown mercy), which is the passive participle, like *qatil* (slain), *jarih* (wounded), and *tarid* (expelled).\n\n<<لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ>> (There is no alteration of the Words of Allah), and these Words are the Fixed Entities (أعيان العالم). Rather, alteration (تبديل) belongs to Allah, not to them. <<مَا نَنسَخْ مِنْ آيَةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍ مِّنْهَا أَوْ مِثْلِهَا>> (Whatever verse We abrogate or cause to be forgotten, We bring forth [one] better than it or similar to it). And in one reading: *aw nunsāhā* (or cause you to forget it). <<فَأُولَٰئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ>> (For those, Allah will change their evil deeds into good deeds).\n\nAnd <<وَمَن يُبَدِّلْ نِعْمَةَ اللَّهِ>> (whoever alters the favor of Allah)—which is the general forgiveness He gave us glad tidings of—<<مِن بَعْدِ مَا جَاءَتْهُ>> (after it has come to him)—the *man* (whoever) here, although conditional, carries a hint of interrogation. And He said in the answer: <<فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ>> (then indeed Allah is severe in penalty). He did not say, \"then Allah will punish whoever alters the favor of Allah.\" Thus, He is, as He said, severe in penalty (شَدِيدُ الْعِقَابِ) in the state of punishment.\n\nThere is no one who is able to alter the favor of Allah (نعمة الله) after it has come to him, and thus replace the favor of Allah with something better than it, according to the need of the time—for the ruling belongs to Him—or similar to it. Abrogation (النسخ) is alteration, for He is eternally the Speaker who said:\n\n\"I am as My servant thinks of Me, so let him think good of Me.\"\n\nWhoever does not think good of Allah has disobeyed His command, been ignorant of his Lord, and is more wretched than Iblis—so let this not be. Allah the Exalted informed us that Iblis will disavow the disbeliever and described him as fearing Allah, the Lord of the Worlds. The Exalted mentioned that <<إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ>> (Only those who have knowledge among His servants fear Allah). He completed this verse with His saying: <<إِنَّ اللَّهَ عَزِيزٌ>> (Indeed, Allah is Almighty), meaning it is impossible for any matter to affect Him that would prevent His general forgiveness (عموم مغفرته) upon His servants. He is <<غَفُورٌ>> (All-Forgiving), using the intensive form for the universality of forgiveness. Thus, it is an absolute hope for sinners across all their degrees.\n\nAnd His saying concerning whoever alters the favor of Allah after it has come to him, that He is severe in penalty (شَدِيدُ الْعِقَابِ), means that the Exalted hastens to punish the one with this characteristic by following up his alteration with a penalty, since alteration (التبديل) belongs to Allah, the Mighty and Majestic, not to the servant. Thus, He makes him know that <<بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ>> (in His Hand is the dominion [Malakut] of all things). For Allah did not link pain (ألم) to this penalty. Whenever pain is not linked to a torment (*‘adhab*) or a penalty (*‘iqab*), it carries a meaning within the very painful matter itself. For the servant fears nothing but pain and desires nothing but pleasure, specifically. This is necessitated by the nature upon which the one who accepts pain and pleasure was created.\n\nAllah has granted His servants in the Quran arguments (الاحتجاج) whose abundance cannot be counted; all of this is instruction from Allah. If wretchedness (الشقاء) were to utterly destroy the wretched one, Allah would not have extended His Mercy to His servants as He did, nor would He have mentioned the arguments He mentioned, which is His saying: <<وَعَلَّمَكَ مَا لَمْ تَكُن تَعْلَمُ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا>> (And He taught you what you did not know, and great has been the favor [فضل] of Allah upon you). The Divine Favor (الفضل الإلهي) is not magnified except in the case of the transgressors (المسرفين) and the criminals (المجرمين). As for the virtuous (المحسنين), <<مَا عَلَى الْمُحْسِنِينَ مِن سَبِيلٍ>> (There is no cause [for blame] against the virtuous), for the Divine Favor came to them initially, and by it they became virtuous. The Divine Favor remains only for those who are not virtuous. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way), and <<يَهْدِي مَن يَشَاءُ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ>> (He guides whom He wills to a straight path).",
    "ur": "باب نمبر چار سو تین: اس منزلت کی معرفت میں کہ میرے بندوں پر میری کوئی حجت نہیں، میں نے ان میں سے کسی سے نہیں کہا کہ تم نے یہ کیوں کیا، مگر اس نے مجھے جواب دیا کہ آپ نے ہی کیا ہے۔\n\nاور الحق (ذات حق) نے فرمایا، لیکن سابقہ (ازلی تقدیر) بلاشبہ زیادہ سبقت رکھتی ہے، لہٰذا کوئی تبدیلی نہیں۔\n\n> اگر میں حق ہوں تو یہ مقال میرا مقال ہے\n> اور اگر میں نہ ہوں تو یہ قول جھگڑنے والے کا ہے۔\n\n> ہر مقام پر میری روشن حجت ہے\n> سو وہ قریب اور دور ہر جگہ ظاہر ہوتی ہے۔\n\n> اور جب اس نے مجھے رات کی محفل میں بات چیت کے لیے بلایا\n> تو میرے پہلو بستروں سے کراہت کرتے ہوئے الگ ہو گئے۔\n\n> پھر اس نے ہم سے کہا: خوش آمدید، اے سب سے معزز ہم نشین\n> جو ہمسروں سے دور رہ کر سب کو جمع کرتا ہے۔\n\n> میں نے اس سے کہا: اگر آپ نہ ہوتے تو میں حق اور خلق کو جمع کرنے والا نہ ہوتا\n> پھر میری آنکھیں اشکبار ہو گئیں۔\n\n> اس نے کہا: کیا تم روتے ہو؟ میں نے کہا: یہ خوشی کے آنسو ہیں\n> اس لیے کہ جو کچھ آپ فرما رہے ہیں اس سے میرے کان بھر گئے ہیں۔\n\n### [کریم وہ ہے جو اپنا مال اس سے مانگے جانے سے پہلے ہی چھوڑ دیتا ہے]\n\nاللہ عزوجل نے فرمایا: \"وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ\" (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا)۔ جان لو کہ الکریم (کریم) وہ ہے جو اپنا مال چھوڑ دیتا ہے اور وہ حقوق ادا کرتا ہے جو اس نے اپنے اوپر کرم کے طور پر واجب کیے ہیں، اس سے پہلے کہ ان کا مطالبہ کیا جائے۔ پھر وہ ایک وقت روکتا ہے اور ایک وقت مطالبہ کرتا ہے تاکہ اس سے اس کے ہاں شفاعت کرنے والے کا مقام ظاہر ہو، اور سائل پر اس کا کرم ظاہر ہو جو اس نے جواب دے کر مانگا ہے۔ اور اللہ کا بندہ، اگر وہ بندہ ہے، تو شیطان کو اس پر کوئی تسلط حاصل نہیں ہوتا۔ اور وہ عبد الاختصاص (خاص بندہ) ہے، وہ جو اللہ کے سوا کسی سے نہیں بولتا اور اللہ کے سوا کسی سے نہیں سنتا۔ پس حجت اللہ کے لیے ہے نہ کہ اس کے لیے۔ \"قُلْ فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ\" (کہہ دیجیے: پس اللہ ہی کے لیے کامل حجت ہے)، کیونکہ یہ اللہ کی حجت ہے۔ اور عبد الاختصاص (خاص بندوں) میں سے وہ بھی ہے جو اللہ کی طرف سے بولتا ہے اور اللہ سے سنتا ہے۔ پس یہ بھی اہل الحجۃ البالغۃ (کامل حجت والے) میں سے ہے، کیونکہ وہ \"عَنِ الْهَوَىٰ إِنْ هُوَ إِلَّا وَحْيٌ يُوحَىٰ\" (اپنی خواہش سے نہیں بولتا، یہ تو صرف وحی ہے جو نازل کی جاتی ہے)۔ پس وہ (اللہ تعالیٰ) ہی سائل بھی ہے اور مجیب (جواب دینے والا) بھی ہے۔ اور جہاں تک عبد العموم (عام بندے) کا تعلق ہے، تو وہ وہ ہیں جن کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے فرمایا: \"وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ\" (اور جب میرے بندے آپ سے میرے بارے میں پوچھیں تو میں قریب ہوں، میں دعا کرنے والے کی دعا قبول کرتا ہوں جب وہ مجھے پکارتا ہے)۔ پس اس نے کسی بندے کو دوسرے بندے سے خاص نہیں کیا اور ان سب کو اپنی طرف منسوب کیا۔\n\nاور اس کا فرمان: \"يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا\" (اے میرے بندو جنہوں نے اپنی جانوں پر زیادتی کی)، پس اس نے انہیں اپنی طرف منسوب کیا باوجود اس کے کہ وہ اسراف (حد سے تجاوز) میں مطلقاً مسرف تھے۔ اور اس نے انہیں اللہ کی رحمت سے مایوس ہونے سے منع فرمایا۔ یہ اور اس جیسی چیزیں ابلیس کو عین احسان کی وجہ سے اللہ کی رحمت میں زیادہ طمع دلاتی ہیں۔ اور اگر وہ اللہ کی رحمت سے مایوس ہو جاتا تو اپنی نافرمانی میں ایک اور نافرمانی کا اضافہ کر دیتا۔ اور اللہ نے اس کے اسراف کے بارے میں خبر دی کہ وہ ہمیں فقر کا وعدہ دیتا ہے اور فحشاء (برائی) کا حکم دیتا ہے، تاکہ اللہ تعالیٰ اپنا فضل اس فقر کے مقابلے میں رکھے جس کا شیطان نے وعدہ کیا، اور جس کا اسے حکم دیا گیا تھا اللہ کے اس فرمان میں: \"وَعِدْهُمْ\" (اور انہیں وعدہ دے)۔ پس وہ اللہ کی تصدیق کرنے والا ہے اس چیز میں جس کی اللہ نے اس کے بارے میں خبر دی، اور وہ اللہ کے حکم کی تعمیل کرنے والا ہے، اس کے حکم \"وَعِدْهُمْ\" میں ایک شبہ کے ساتھ۔ اور اللہ نے اپنی مغفرت کو فحشاء کے مقابلے میں رکھا، اور فحشاء کا حکم دینا بھی فحشاء میں سے ہے۔ پس وہ الحق (ذات حق) کے مغفرت کے وعدے کے تحت داخل ہو گیا، جس نے اس کے طمع کو بڑھا دیا، اگرچہ دار النار (جہنم) اس کا ٹھکانہ ہے، کیونکہ وہ اس کے اہل میں سے ہے۔ اگرچہ وہ اس پر حیران ہو یا ان لوگوں سے ملاقات کرے جنہوں نے اس کی پیروی کی جو اہل نار میں سے ہیں، تو اس نے صرف وہی اٹھایا جو منقطع ہونے والا ہے اور ایک مقررہ مدت تک پہنچنے والا ہے۔ اور اللہ کے فضل کا کوئی انقطاع نہیں، کیونکہ وہ جزاء الوفاق (مطابق بدلہ) سے خارج ہے۔ اور اللہ کی رحمت کسی ایک جگہ یا کسی ایک گھر کے ساتھ خاص نہیں، بلکہ اس نے ہر چیز کو گھیر رکھا ہے۔ پس دار الرحمۃ (رحمت کا گھر) ہی دار الوجود (ہستی کا گھر) ہے۔ اور یہ مذکورہ بندے، اللہ نے انہیں اپنی طرف منسوب کر کے ذکر کیا، اور اس کی طرف نسبت کرنا ایک تشریف (عزت) ہے۔ پس اس نے نسبت میں ان بندوں کو جمع کیا \"الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ\" (جنہوں نے اپنی جانوں پر زیادتی کی)، جنہیں اللہ سبحانہ نے اپنی رحمت سے مایوس ہونے سے منع فرمایا اور انہیں یہ خوشخبری دی کہ وہ \"يَغْفِرُ الذُّنُوبَ جَمِيعًا\" (تمام گناہوں کو بخش دیتا ہے)، اور کوئی وقت مقرر نہیں کیا۔ پس ہو سکتا ہے کہ مغفرت بعض بندوں کے لیے سابقہ ہو اور بعض بندوں کے لیے لاحقہ ہو، اور ان بندوں کے درمیان جن پر شیطان کا کوئی تسلط نہیں۔\n\n> پس مکمل نہیں ہوا مگر اس کا بندہ اور وہ اس کا رب ہے\n> اور مکمل نہیں ہوا مگر راحم (رحم کرنے والا) اور رحیم (رحم کیا گیا)۔\n\nیہاں رحیم سے مراد المرحوم (رحم کیا گیا) ہے، جو اسم مفعول ہے، جیسے قتیل (قتل کیا گیا)، جریح (زخمی)، اور طرید (نکالا گیا)۔ اور \"لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ\" (اللہ کے کلمات میں کوئی تبدیلی نہیں)، اور وہ کلمات اعیان العالم (عالم کی حقیقتیں) ہیں۔ اور تبدیلی اللہ کے لیے ہے نہ کہ ان کے لیے۔ \"مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا\" (ہم جو بھی آیت منسوخ کرتے ہیں یا اسے بھلا دیتے ہیں، تو اس سے بہتر یا اس جیسی لے آتے ہیں)۔ اور ایک قراءت میں \"أَوْ نُنْسَاهَا\" (یا ہم اسے بھلا دیں) ہے۔ \"فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ\" (تو وہ ایسے لوگ ہیں جن کی برائیوں کو اللہ نیکیوں سے بدل دیتا ہے)۔ اور \"وَمَنْ يُبَدِّلْ نِعْمَةَ اللَّهِ\" (اور جو اللہ کی نعمت کو بدل دے)، اور وہ نعمت جس کی ہمیں عموم مغفرت کی خوشخبری دی گئی ہے، \"مِنْ بَعْدِ مَا جَاءَتْهُ\" (اس کے پاس آ جانے کے بعد)۔ یہاں \"مَنْ\" اگرچہ شرطیہ ہے، لیکن اس میں استفہام کی جھلک ہے۔ اور جواب میں فرمایا: \"فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ\" (تو بے شک اللہ سخت عذاب دینے والا ہے)۔ اور یہ نہیں فرمایا کہ \"بے شک اللہ اسے سزا دے گا جو اللہ کی نعمت کو بدل دے\"۔ پس وہ جیسا کہ اس نے فرمایا، سزا کی حالت میں \"شَدِيدُ الْعِقَابِ\" (سخت عذاب دینے والا) ہے۔ پس وہاں کوئی نہیں جو اللہ کی نعمت کو اس کے پاس آ جانے کے بعد بدل سکے، تاکہ وہ اللہ کی نعمت کو اس سے بہتر چیز سے بدل دے وقت کی ضرورت کے مطابق، کیونکہ حکم اسی کا ہے، یا اس جیسی چیز سے۔ اور نسخ (منسوخ کرنا) تبدیلی ہے، نہ کہ دائمی، کیونکہ وہ ہی فرمانے والا ہے:\n\nمیں اپنے بندے کے گمان کے مطابق ہوتا ہوں، پس اسے چاہیے کہ وہ مجھ سے اچھا گمان رکھے۔\n\nپس جس نے اللہ سے اچھا گمان نہ رکھا، اس نے اس کے حکم کی نافرمانی کی اور اپنے رب سے جہالت برتی، اور وہ ابلیس سے بھی زیادہ بدبخت ہے، لہٰذا ایسا نہیں ہو سکتا۔ اور اللہ تعالیٰ نے ابلیس کے بارے میں خبر دی کہ وہ کافر سے براءت کا اظہار کرے گا اور اسے \"لِلَّهِ رَبِّ الْعَالَمِينَ\" (اللہ رب العالمین کے لیے) خوف رکھنے والا قرار دیا۔ اور اللہ تعالیٰ نے ذکر فرمایا کہ \"إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ\" (بے شک اللہ سے اس کے بندوں میں سے صرف علماء ہی ڈرتے ہیں)۔ اور اس آیت کو اس فرمان سے مکمل کیا: \"إِنَّ اللَّهَ عَزِيزٌ\" (بے شک اللہ غالب ہے)، یعنی یہ ناممکن ہے کہ کوئی امر اس پر اثر انداز ہو جو اس کے اور اس کے بندوں پر عموم مغفرت کے درمیان حائل ہو جائے۔ \"غَفُورٌ\" (بخشنے والا) ہے، جو مغفرت کے عموم میں مبالغے کا صیغہ ہے۔ پس یہ تمام طبقات کے گناہگاروں کے لیے مطلق امید ہے۔ اور اس کا فرمان اس شخص کے بارے میں جو \"يُبَدِّلْ نِعْمَةَ اللَّهِ مِنْ بَعْدِ مَا جَاءَتْهُ\" (اللہ کی نعمت کو اس کے پاس آ جانے کے بعد بدل دے) کہ وہ \"شَدِيدُ الْعِقَابِ\" (سخت عذاب دینے والا) ہے، یعنی اللہ تعالیٰ اس صفت والے کی طرف عذاب کے ساتھ تیزی سے متوجہ ہوتا ہے، اور وہ یہ ہے کہ وہ اسے اس چیز میں سزا دے جو اس نے بدلی، کیونکہ التبدیل (تبدیلی) اللہ عزوجل کے لیے ہے نہ کہ اس کے لیے۔ پس وہ اسے یہ المعرفۃ (معرفت) کراتا ہے کہ \"بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ\" (ہر چیز کا ملکوت اسی کے ہاتھ میں ہے)۔ بے شک اللہ نے اس سزا کے ساتھ کوئی تکلیف نہیں جوڑی۔ اور جب عذاب یا سزا کے ساتھ تکلیف نہ جوڑی جائے، تو اس کے لیے تکلیف دہ امر میں ایک خاص مفہوم ہوتا ہے، کیونکہ وہ صرف تکلیف سے ڈرتا ہے اور خاص طور پر صرف لذت میں رغبت رکھتا ہے۔ یہ اس طبع کا تقاضا ہے جس پر وہ شخص پیدا کیا گیا ہے جو تکلیف اور لذت کو قبول کرتا ہے۔ اور اللہ نے اپنے بندوں کو قرآن میں بے شمار حجتیں عطا کی ہیں، یہ سب اللہ کی طرف سے تعلیم ہے۔ اگر شقاوت (بدبختی) شقی (بدبخت) کو جڑ سے اکھاڑ پھینکتی، تو اللہ اپنے بندوں پر اتنی رحمت نہ پھیلاتا جتنی اس نے پھیلائی، اور نہ ہی وہ حجتیں ذکر کرتا جو اس نے ذکر کیں، اور وہ اس کا فرمان ہے: \"وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا\" (اور اس نے آپ کو وہ سکھایا جو آپ نہیں جانتے تھے، اور آپ پر اللہ کا فضل عظیم ہے)۔ اور الفضل الإلهي (فضل الٰہی) صرف مسرفین (حد سے تجاوز کرنے والوں) اور مجرمین (گناہگاروں) میں ہی عظیم ہوتا ہے۔ اور جہاں تک المحسنین (نیکی کرنے والوں) کا تعلق ہے، تو \"مَا عَلَى الْمُحْسِنِينَ مِنْ سَبِيلٍ\" (محسنین پر کوئی الزام نہیں)، کیونکہ فضل الٰہی ان کے پاس ابتداءً آیا اور اسی کے ذریعے وہ محسنین بنے۔ اور فضل الٰہی صرف غیر محسنین میں ہی باقی رہا۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ \"وَيَهْدِي مَنْ يَشَاءُ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ\" (اور وہ جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے۔)",
    "fa": "«باب چهارصد و سوم در معرفت منزلتی که در آن بر بندگانم حجتی ندارم؛ به هیچ‌یک از آنان نگفتم چرا چنین کردی، مگر آنکه به من گفت: تو کردی.»\n\nو حق (الحق) فرمود، اما بی‌شک سابقه (السبقة) پیش‌تر است، پس تبدیلی نیست.\n\n> اگر حق (الحق) باشم، پس گفتار، گفتار من است *** و اگر نباشم، پس سخن، سخنِ ستیزه‌جوست.\n>\n> در هر جایگاهی، حجت روشن (الحجة البيضاء) از آنِ من است *** پس آن حجت در نزدیک و دور آشکار می‌شود.\n>\n> و چون مرا برای گفتگوی شبانه فراخواند *** پهلوهایم از بسترها دوری گزید.\n>\n> پس به ما گفت: خوش آمدی ای گرامی‌ترین هم‌سخن شبانه *** که از همتایان دوری می‌گزیند و همگان را گرد می‌آورد.\n>\n> گفتم: اگر تو نبودی، من جمع‌کننده نبودم *** برای حق (الحق) و خلق؛ سپس اشک‌هایم سرازیر شد.\n>\n> گفت: آیا گریه می‌کنی؟ گفتم: اشک شادی است *** زیرا گوش‌هایم از آنچه می‌گویی پر شده است.\n\n### [کریم کسی است که مال خود را پیش از آنکه از او خواسته شود، رها می‌کند]\n\nخداوند عز و جل فرمود: «و خداوند شما و آنچه را که عمل می‌کنید، آفریده است.» (وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ) بدان که کریم (الکریم) کسی است که مال خود را رها می‌کند و آنچه را که از حقوق بر خود واجب کرده است، از روی کرم، پیش از آنکه از او خواسته شود، ادا می‌کند. سپس گاهی منع می‌کند و گاهی مطالبه می‌نماید تا بدین وسیله منزلت شفاعت‌کننده نزد او در چنین مواردی آشکار شود و نیز کرم او به سائل در آنچه خواسته است، با اجابتش نمایان گردد. و بندگان خدا، بنده‌ای هستند که اگر بندگی کنند، شیطان بر آنان سلطه‌ای ندارد. او بنده اختصاص (عبد الاختصاص) است؛ کسی که جز به واسطه خدا سخن نمی‌گوید و جز به واسطه خدا نمی‌شنود. پس حجت از آنِ خداست، نه از آنِ او. «بگو: پس حجت رسا (الحجة البالغة) از آنِ خداست.» (قُلْ فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ) زیرا آن، حجت خداست. و از بندگان اختصاص (عبيد الاختصاص) کسی است که از جانب خدا سخن می‌گوید و از خدا می‌شنود. این شخص نیز از اهل حجت رسا (الحجة البالغة) است، زیرا «از روی هوس سخن نمی‌گوید. آن نیست مگر وحی‌ای که به او الهام می‌شود.» (إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى) پس او تعالی هم سائل است و هم مجیب. اما بنده عموم (عبد العموم)، کسی است که خداوند درباره‌اش به رسول خدا (صلی الله علیه و سلم) فرمود: «و هرگاه بندگانم از من بپرسند، پس همانا من نزدیکم؛ دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم.» (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ) پس بنده‌ای را از بنده‌ای خاص نگردانید و آنان را به خود اضافه کرد. و سخن او: «ای بندگان من که بر خود اسراف کرده‌اید» (يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا)؛ آنان را با وجود اسراف مطلقشان، به خود اضافه کرد و نهی‌شان نمود از اینکه از رحمت خدا ناامید شوند. این و امثال آن، ابلیس را به رحمت خدا از سرِ منت (المنة) طمعکارتر ساخت. و اگر از رحمت خدا ناامید می‌شد، بر نافرمانی خود نافرمانی دیگری می‌افزود. و خداوند درباره اسراف او خبر داد که او ما را به فقر وعده می‌دهد و به فحشا امر می‌کند، تا فضل او تعالی در مقابل آنچه شیطان به آن وعده داده است، یعنی فقری که شیطان به آن در قول خداوند «و به آنان وعده بده» (وَعِدْهُمْ) مأمور شده است، قرار گیرد. پس او (شیطان) خدا را در آنچه درباره‌اش خبر داده، تصدیق‌کننده است و امر خدا را با شبهه‌ای در امرش در قول «وعده بده» (وَعِدْهُمْ) امتثال می‌کند. و خداوند مغفرت خود را در مقابل فحشا قرار داد، و امر به فحشا خود از فحشا است، پس تحت وعده حق (الحق) به مغفرت داخل شد و این امر طمع او را افزود، اگرچه سرای آتش جایگاه اوست، زیرا او از اهل آن است، حتی اگر آتش بر او احاطه کند یا از کسانی که از اهل آتش هستند و از او پیروی کرده‌اند، دیدن کند. پس او جز آنچه منقطع و محدود به اجلی است، حمل نکرده است، در حالی که فضل خدا انقطاعی ندارد، زیرا خارج از جزای وفاق (الجزاء الوفاق) است. و رحمت خدا مکانی را از مکان دیگر و سرایی را از سرای دیگر تخصیص نمی‌دهد، بلکه «همه چیز را فرا گرفته است.» (وَسِعَتْ كُلَّ شَيْءٍ) پس سرای رحمت، همان دار الوجود (دار الوجود) است. و این بندگان مذکور را خداوند با اضافه کردن به خود یاد کرده است، و اضافه کردن به او تشریف است. پس در این اضافه، میان بندگانی که «بر خود اسراف کرده‌اند» (الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ) - که خداوند سبحان آنان را از ناامیدی از رحمت خدا نهی کرد و به آنان بشارت داد که «همه گناهان را می‌آمرزد» (يَغْفِرُ الذُّنُوبَ جَمِيعًا) و زمانی را مشخص ننمود، پس ممکن است مغفرت برای برخی بندگان پیشین و برای برخی دیگر پسین باشد - و میان بندگانی که شیطان بر آنان سلطه‌ای ندارد، جمع نمود.\n\n> کامل نشد مگر بنده او، در حالی که او پروردگارش است *** و کامل نشد مگر رحم‌کننده (راحم) و مورد رحمت (رحیم).\n\nمنظور از رحیم (الرحيم) در اینجا، مورد رحمت (مرحوم) است، اسم مفعول است، مانند قتیل (کشته شده)، جریح (زخمی) و طرید (رانده شده). و «در کلمات خدا تبدیلی نیست.» (لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ) و این کلمات، همان اعیان عالم هستند. و همانا تبدیل (التبدیل) از آنِ خداست، نه از آنِ آنان. «هر آیه‌ای را که نسخ کنیم یا آن را به فراموشی بسپاریم، بهتر از آن یا مانند آن را می‌آوریم.» (مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا) و در قرائتی دیگر: «یا آن را به فراموشی بسپاریم.» «پس آنان کسانی هستند که خداوند بدی‌هایشان را به نیکی‌ها تبدیل می‌کند.» (فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ) و «هر کس نعمت خدا را - که همان بشارت او به مغفرت عمومی است - پس از آنکه به او رسید، تبدیل کند» (وَمَنْ يُبَدِّلْ نِعْمَةَ اللَّهِ مِنْ بَعْدِ مَا جَاءَتْهُ). پس \"مَن\" (هر کس) در اینجا، اگرچه شرطیه است، اما بوی استفهام می‌دهد. و در جواب فرمود: «پس همانا خداوند سخت‌کیفر است.» (فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ) و نگفت: «همانا خداوند کسی را که نعمت خدا را تبدیل کند، عقاب می‌کند.» پس او همان‌گونه که فرمود، در حال عقوبت «سخت‌کیفر» (شَدِيدُ الْعِقَابِ) است. پس کسی نیست که بتواند «نعمت خدا را پس از آنکه به او رسید، تبدیل کند» (يُبَدِّلْ نِعْمَةَ اللَّهِ مِنْ بَعْدِ مَا جَاءَتْهُ) و نعمت خدا را به چیزی بهتر از آن، بر حسب نیاز وقت، تبدیل کند، زیرا حکم از آنِ اوست، یا به مانند آن. و نسخ، تبدیل است، نه دائمی؛ زیرا اوست که می‌فرماید:\n\nمن نزد گمان بنده خود به خویش هستم، پس باید به من گمان نیک ببرد.\n\nپس هر کس به خدا گمان نیک نبرد، امر او را نافرمانی کرده و پروردگارش را نشناخته و از ابلیس شقی‌تر است، پس چنین چیزی واقع نمی‌شود. و خداوند تعالی درباره او (ابلیس) خبر داده است که از کافر بیزاری می‌جوید و او را به ترس از خداوند، پروردگار جهانیان، وصف کرده است. و خداوند تعالی ذکر کرده است که «همانا از میان بندگان خدا، فقط دانشمندان (العلماء) از او می‌ترسند.» (إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ) و این آیه را با قول خود کامل کرد: «همانا خداوند عزیز است» (إِنَّ اللَّهَ عَزِيزٌ)؛ یعنی محال است که امری در او تأثیر بگذارد که میان او و عموم مغفرتش بر بندگانش حائل شود؛ «آمرزنده است» (غَفُورٌ) با صیغه مبالغه در غفران به دلیل عمومیت آن. پس این امید مطلق برای گناهکاران در تمام طبقاتشان است. و قول او درباره کسی که «نعمت خدا را پس از آنکه به او رسید، تبدیل کند» (يُبَدِّلْ نِعْمَةَ اللَّهِ مِنْ بَعْدِ مَا جَاءَتْهُ) که او «سخت‌کیفر» (شَدِيدُ الْعِقَابِ) است؛ یعنی خداوند تعالی به سوی کسی که این صفت اوست، با عقاب شتاب می‌کند، و آن این است که او را در آنچه تبدیل کرده است، دنبال کند، زیرا تبدیل از آنِ خداوند عز و جل است، نه از آنِ بنده. پس به او می‌شناساند که «ملکوت هر چیزی به دست اوست.» (بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ) زیرا خداوند این عقاب را با درد همراه نکرده است. و هرگاه درد با عذاب یا عقاب همراه نشود، در عین امر دردناک، قابل تحمل است. زیرا انسان جز از درد نمی‌ترسد و جز به لذت‌جویی رغبت ندارد. این را طبیعتی اقتضا می‌کند که کسی که درد و لذت را می‌پذیرد، بر آن سرشته شده است. و خداوند به بندگانش در قرآن از احتجاجات (حجت‌ها) آنچه را که کثرتش قابل شمارش نیست، عطا کرده است. همه اینها تعلیم از جانب خداست. پس اگر شقاوت، شقی را ریشه‌کن می‌کرد، خداوند آن‌قدر که رحمت بر بندگانش گسترانده، نمی‌گستراند و آن‌قدر که از حجت‌ها ذکر کرده، ذکر نمی‌کرد. و آن، قول اوست: «و آنچه را نمی‌دانستی به تو آموخت و فضل خدا بر تو بزرگ بود.» (وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا) و فضل الهی (الفضل الإلهي) بزرگ شمرده نمی‌شود مگر در حق اسراف‌کنندگان و مجرمان. اما در حق نیکوکاران، «بر نیکوکاران هیچ راهی (برای مؤاخذه) نیست.» (مَا عَلَى الْمُحْسِنِينَ مِنْ سَبِيلٍ) زیرا فضل الهی از ابتدا به آنان رسید و به واسطه آن نیکوکار شدند. و فضل الهی باقی نماند مگر در حق غیر نیکوکاران. و «خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) و «هر کس را بخواهد به راه راست هدایت می‌کند.» (وَيَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ)"
  },
  "page_count": 2
}