{
  "id": 207,
  "title": {
    "ar": "الباب السابع ومائتان في حال العلة",
    "en": "Chapter 207: Concerning the State of the Cause (حال العلة)",
    "ur": "باب نمبر دو سو سات: علت (سبب) کا حال",
    "fa": "باب دویست و هفتم در بیان حال بیماری (العلة)"
  },
  "content": {
    "ar": "## «الباب السابع ومائتان في حال العلة»\n\n\n> إن العليل إلى الطبيب ركونه *** مهما أحس بعلة في نفسه‏\n\n\n> فتراه يعبده وما هو ربه *** حذرا عليه أن يحل برمسه‏\n\n\n> فسألت ما سبب الركون فقيل لي *** ما كان إلا كونه من جنسه‏\n\n\n### [العلة تنبيه من الحق‏]\n\n\nاعلم أن العلة عند القوم تنبيه من الحق ومن تنبيهات الحق‏\n\n\nقوله على لسان نبيه صلى الله عليه وسلم إن الله خلق آدم على صورته وفي رواية يصححها الكشف‏\n\n\nوإن لم تثبت عند أصحاب النقل على صورة الرحمن فارتفع الإشكال وهو الشافي من هذه\n\n\nالعلة يقول تعالى لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ فعلمنا أن كل رواية ترفع الإشكال هي الصحيحة وإن ضعفت عند أهل النقل وإذا كان الله هو الشافي والمعافي فهو الطبيب كما قال الصديق الطبيب أمرضني فسبب حنين صاحب العلة إلى الطبيب ما ذكرناه في الشعر وهو خلقه على الصورة ثم أيد هذا الخبر وهذا النظر الكشفي‏\n\n\nقول الله تعالى مرضت فلم تعدني‏\n\n\nولما فسر قال مرض فلان فأنزل نفسه فيما أصاب فلانا عناية منه بفلان وهذه كلها علل لمن عقل عن الله فالعلة إثبات السبب والحق عين السبب إذ لولاه ما كان العالم فهو الْخالِقُ الْبارِئُ الْمُصَوِّرُ الشافي فإذا كان هو عين العلة في قوله منك من‏\n\n\nقوله أعوذ بك منك‏\n\n\nفما شفاه إلا منه إذ لا شافي إلا الله فهو الشافي من كل علة فإن الله وضع الأسباب فلا يقدر على رفعها ووضع الله لها أحكاما فلا يمكن ردها وهو مسبب الأسباب فخلق الداء والدواء وما جعل الشفاء إلا له خاصة فالشفاء علة لإزالة المرض وما كل علة شفاء فكل مسبب سبب وما كل سبب مسبب لكن قد يكون مسبب الحكم لا مسبب العين كقوله أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فالعلة إذا كانت بمعنى السبب لها حكم وإذا كانت بمعنى المرض لها حكم فهي بمعنى المرض داء وهي بمعنى السبب حكمة فالعلة تنبيه من الحق لعبده على كل حال فوقتا ينبهه من رقدة غفلته بأمر ينزل به وذلك هو الداء والمرض فإذا فقد العافية أحس بالألم فعلم أن مصيبة نزلت به فشرع الله له أن يقول إِنَّا لِلَّهِ وإِنَّا إِلَيْهِ راجِعُونَ ولا يرجع إلا من خرج ووقتا ينبهه من رقدة غفلته بحكمة تظهر له في نفسه من غير أن يكون ذا مرض نفساني فإذا كان الحق عين علته فلا يكون إلا من تجل إلهي فجأة فإن لله فجآت على قلوب عباده ترد عليهم من غير استدعاء ولا تقدم سبب معين عنده وإن كان عن سبب في نفس الأمر ولكن لا علم له بذلك غير أن القوم ما عدلوا إلى هذا الاسم الذي هو العلة إلا لما رأوا العلة مرتبطة بمعلولها والمعلول مربوطا بعلته وعلموا أن العالم ملك لله والملك مربوط حقيقة وجوده ملكا بالملك والملك الله والملك لا يكون ملكا على نفسه فهو مربوط بالملك فلما ظهر التضايف في كون العالم مربوبا ومملوكا عدلوا إلى اسم العلة ولم يعدلوا إلى اسم السبب ولا إلى اسم الشرط ولما كان بعض التنبيهات الإلهية آلاما ونوازل تكرهها النفوس بالطبع عدلوا إلى اسم بجمع التنبيهات كلها فعدلوا إلى العلة فإن المرض يسمى علة وهو من أقوى المنبهات في الرجوع إلى الله لما يتضمنه من الضعف ثم إن الله جعل الأسباب حجبا عن الله وركنت النفوس إليها ونسي الله فيها وانتقل الاعتماد عليها من الخلق والعلة وإن كانت عين السبب ولكن لاختلاف الاسم حكم فالعلة على النقيض من السبب فإنها منبهة بذاتها على الله فكان اسم العلة بالمنبه أولى فكل سبب لا يردك إلى الله ولا ينبهك عليه ولا يحضره عندك فليس بعلة\n\n\n> فدائي هو الداء العضال لأنه *** ينبهني في كل حال على نفسي‏\n\n\n> فما علتي غيري وما علتي أنا *** ولست بذي فصل ولست بذي جنس‏\n\n\n> ولست على علم فاعرف من أنا *** ولست على جهل بذاتي ولا لبس‏\n\n\n> فما أنا من تعني ولا أنا غيره *** ولكنني في الطرح في الضرب كالأس‏\n\n\n### [إن العلة تنبيه من تنبهات الإلهي‏]\n\n\nولما كانت العلة التنبه الإلهي فتنبيهات الحق لا تنحصر إلا من طريق ما وهو أن التنبيه الإلهي لا يخلو ما أن يكون من‏\nخارج أو من داخل فإن كان من خارج فقد يثبت وقد لا يثبت وإن كان من داخل فإنه يثبت ولا بد كإبراهيم بن أدهم فإنه نودي من قربوس سرجه فالتفت نحوه فإذا النداء من قلبه فتخيل أنه من قربوس سرجه وكصاحب القنبرة العمياء حين انشقت لها الأرض عن سكرجتين ذهب وفضة في الواحدة ماء وفي الأخرى سمسم فأكلت من السمسم وشربت من الماء فكانت القنبرة العمياء نفسه مثلت له في هذه الصورة لأنها كانت في حال عمى من المخالفة مع ما هو عليه من نعمة الله فعلم ذلك فرجع إلى الله فهذه أمثلة ضربت لهم فالصورة تظهر من خارج والأمر عنده في حاله ولذلك ثبتوا وقد يكون التنبيه الإلهي من واقعة ومن الواقعة كان رجوعنا إلى الله وهو أتم العلل لأن الوقائع هي المبشرات وهي أوائل الوحي الإلهي وهي من داخل فإنها من ذات الإنسان فمن الناس من يراها في حال نوم ومنهم من يراها في حال فناء ومنهم من يراها في حال يقظة ولا تحجبه عن مدركات حواسه في ذلك الوقت وإنما سميت علة لأنها تورث ألما في النفس على ما فاته من الحق الذي خلق له ويتوهم أنه لو مات في حال المخالفة كيف يكون وجهه عند الله ولو غفر له أ ما كان يستحيي منه حيث عصاه بنعمته ومن نعمته عليه أنه أمهله ولم يؤاخذه بما كان منه كما قلنا في نظم لنا\n\n\n> يا من يراني ولا أراه *** كم ذا أراه ولا يراني‏\n\n\nفقال لي بعض إخواني كيف تقول إنه لا يراك وأنت تعلم أنه يراك فقلت له في الحال مرتجلا\n\n\n> يا من يراني مجرما *** ولا أراه آخذا\n\n\n> كم ذا أراه منعما *** ولا يراني لائذا\n\n\nفلو لم يكن في المخالفة إلا الاستحياء لكان عظيما بل هو أعظم من العقوبة فالمغفرة أشد على العارفين من العقوبة فإن العقوبة جزاء فتكون الراحة عقيب الاستيفاء فهو بمنزلة من استوفى حقه والغفران ليس كذلك فإنك تعرف أن الحق عليك متوجه وأنه أنعم عليك بترك المطالبة فلا تزال خجلا ذا حياء أبدا ولهذا إذا غفر الله للعبد ذنبه حال بينه وبين تذكره وأنساه إياه فإنه لو تذكره لاستحيا ولا عذاب على النفوس أعظم من الحياء حتى يود صاحب الحياء إنه لم يكن شيئا كما قالت الكاملة يا لَيْتَنِي مِتُّ قَبْلَ هذا وكُنْتُ نَسْياً مَنْسِيًّا هذا حياء من المخلوق كيف نسبوا إليها ما لا يليق ببيتها ولا بأصلها ولهذا قالوا ما كانَ أَبُوكِ امْرَأَ سَوْءٍ وما كانَتْ أُمُّكِ بَغِيًّا فبرأها الله مما نسبوا إليها لما نالها من عذاب الحياء من قومها فكيف الحياء من الله فيما يتحققه العبد من مخالفة أمر سيده فإن قلت وهل يمكن أن يعصى على الكشف قلنا لا قيل فقول أبي يزيد لما قيل له أ يعصي العارف والعارف من أهل الكشف فقال وكانَ أَمْرُ الله قَدَراً مَقْدُوراً فجوز قلنا هكذا يكون أدب العارفين مع الحق في أجوبتهم حيث قال إن كان الله قدر عليهم في سابق علمه ذلك فلا بد منه وهي معصية فلا بد من الحجاب كما\n\n\nقال صلى الله عليه وسلم إذا أراد الله إنفاذ قضائه وقدره سلب ذوي العقول عقولهم حتى إذا أمضى فيهم قدره ردها عليهم ليعتبروا\n\n\nوكذلك حال العارف إذا أراد الله وقوع المخالفة منه ومعرفته تمنعه من ذلك فيزين الله له ذلك العمل بتأويل يقع له فيه وجه إلى الحق لا يقصد العارف به انتهاك الحرمة كما فعل آدم كالمجتهد يخطئ فإذا وقع منه المقدور أظهر الله له فساد ذلك التأويل الذي أداه إلى ذلك الفعل كما فعل بآدم فإنه عصى بالتأويل فإذا تحقق بعد الوقوع أنه أخطأ علم أنه عصى فعند ذلك يحكم عليه لسان الظاهر بأنه عاص وهو عاص عند نفسه وأما في حال وقوع الفعل منه فلا لأجل شبهة التأويل كالمجتهد في زمان فتياه بأمر ما اعتقادا منه أن ذلك عين الحكم المشروع في المسألة وفي ثاني حال يظهر له بالدليل أنه أخطأ فيكون لسان الظاهر عليه أنه مخطئ في زمان ظهور الدليل لا قبل ذلك فإن كان العارف ممن قيل له على لسان الشارع افعل ما شئت فقد غفرت لك فما عصى لا ظاهرا ولا باطنا عند الله وإن كان لسان الظاهر عليه بالمعصية لأنه لم يدرك نسخ ذلك بالإباحة من الشارع فلسان الظاهر كمجتهد مخطئ بري إصابة غيره من المجتهدين خطأ اعتمادا منه على دليله فمن كان هذا مقامه فما فعل فعلا يوجب له الحياء مع لسان الظاهر عليه بالمعصية فمن تنبيهات الحق التوفيق لإصابة الأدلة كما هي في نفس الأمر ليكون على بصيرة وهو المعتنى به في أول قدم فإذا أورثته العلة علة طهرته فإذا وقع التطهير أنسي ما كان عليه من المخالفة وشغل بما توجه إليه مبسوطا لا مقبوضا ولذلك قال بعضهم في حد التوبة أن تنسى ذنبك ومعنى ذلك عند هذا القائل إن الله تعالى إذا قبل توبتك أنساك‏\nذنبك فلم يذكرك إياه فإنك إن ذكرته أحصرته بينك وبين الحق وهو قبيح الصورة فجعلت بينك وبين الحق صورة قبيحة تؤذن بالبعد فهذا فائدة النسيان لما قال الله لنبيه عليه الصلاة والسلام لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ لم يزل جبريل ينزل عليه في صورة دحية وكان أجمل أهل زمانه يقول له بصورة الحال يا محمد ما بيني وبينك إلا صورة الحسن والجمال فإن جبريل كان بينه وبين الله وكان من جمال دحية إنه لما ورد إلى المدينة وخرج الناس إليه نساء ورجالا فما رأته حامل إلا ألقت ما في بطنها لما أدركها في نفسها مما رأته من حسن صورته فالله ينسى التائبين من العارفين ذنوبهم السالفة ولهذا غفرت أي سترت عنهم والستر على نوعين إما أن تستر عنهم جملة واحدة وإما أن تبدل بحسنة فتحسن صورة تلك السيئة بالتوبة فتظهر له حسنة كما قال يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ أي يرد قبحها حسنا فمن تنبيهات الحق قوله تعالى فَأُوْلئِكَ يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ فإذا علموا ذلك أسرعوا في الرجعة إلى الله وسارعوا إليها فهذا قد أبنت لك معنى حال العلة عند الطائفة وما تؤثر في الرجال‏\n\n\n«بسم الله الرحمن الرحيم»\n\n",
    "en": "## Chapter Two Hundred and Seven, Concerning the State of the Ailment [or Cause] (العلة)\n\nThe ailing one relies upon the physician,\nWhenever he senses an ailment within his soul.\n\nYou see him worshipping him, though he is not his Lord,\nOut of fear that [the ailment] might lead him to his tomb.\n\nSo I asked what the reason for this reliance was, and I was told:\nIt was nothing other than his being of his own kind.\n\n### The Ailment (العلة) is an Admonition from The Real (الحق)\n\nKnow that the Ailment (العلة), according to the People [Sufis], is an admonition (تنبيه) from The Real (الحق). And among the admonitions of The Real is His saying, through the tongue of His Prophet (peace and blessings be upon him): <<Indeed, Allah created Adam upon His form.>> And in a narration validated by Unveiling (الكشف), even if it is not established by the People of Transmission (أصحاب النقل): \"upon the form of the All-Merciful (الرحمن).\" Thus, the ambiguity is removed, and He is the Healer (الشافي) of this Ailment.\n\nThe Exalted says: <<لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ>> (That you may make clear to the people what was sent down to them). Thus, we know that every narration that removes ambiguity is sound, even if it is weak according to the People of Transmission. Since Allah is the Healer and the Restorer of Health, He is the Physician (الطبيب). As the Veracious One (الصديق) said: \"The Physician made me ill.\" The reason for the yearning of the ailing person (صاحب العلة) toward the Physician is what we mentioned in the poetry: his creation upon the Form.\n\nThis report and this Gnostic insight (النظر الكشفي) are then supported by the saying of Allah the Exalted: \"I was sick, and you did not visit Me.\" When He explained it, He said: \"So-and-so was sick, and [Allah] placed Himself in what afflicted So-and-so, out of His concern for So-and-so.\" All of these are Ailments (علل) for one who understands from Allah. The Ailment (العلة) is the establishment of the Cause (السبب), and The Real (الحق) is the very essence of the Cause, for without Him, the World (العالم) would not exist. He is the Creator (الْخالِقُ), the Inventor (الْبارِئُ), the Fashioner (الْمُصَوِّرُ), the Healer (الشافي).\n\nIf He is the very essence of the Ailment, as in His saying, \"From You, from...\" [referring to the prayer] \"I seek refuge in You from You,\" then nothing heals him except from Him, since there is no healer but Allah. He is the Healer of every Ailment. Indeed, Allah established the secondary causes (الأسباب), and He is not able to remove them; and Allah established rulings (أحكاما) for them, which cannot be rejected. He is the Causer of Causes (مسبب الأسباب). He created the disease (الداء) and the remedy (الدواء), and He reserved healing (الشفاء) for Himself alone.\n\nThus, healing is a cause (علة) for the removal of sickness, but not every cause is healing. Every effect (مسبب) is a cause (سبب), but not every cause is an effect. However, sometimes the effect is related to the ruling (الحكم) and not the essence (العين), as in His saying: <<أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ>> (I answer the call of the caller when he calls upon Me).\n\nTherefore, when the Ailment (العلة) is understood in the sense of Cause, it has one ruling; and when it is understood in the sense of Sickness (المرض), it has another ruling. In the sense of sickness, it is a disease (داء); and in the sense of cause, it is wisdom (حكمة).\n\nThe Ailment is an admonition from The Real to His servant in every state. Sometimes, He admonishes him from the slumber of his heedlessness (غفلته) by an affair that descends upon him, and that is the disease and the sickness. When he loses well-being (العافية), he feels pain and knows that a calamity has befallen him. Allah has legislated for him to say: <<إِنَّا لِلَّهِ وإِنَّا إِلَيْهِ راجِعُونَ>> (Indeed, we belong to Allah, and indeed to Him we will return). And only he who has departed returns.\n\nAnd sometimes, He admonishes him from the slumber of his heedlessness by a wisdom (حكمة) that appears within his soul, without him having a physical sickness. If The Real is the very essence of his Ailment, then it can only be through a sudden Divine Theophany (تجل إلهي فجأة). For Allah has sudden manifestations (فجآت) upon the hearts of His servants that descend upon them without solicitation or the prior establishment of a specific cause known to the servant, even if it is due to a cause in the reality of the matter, but he has no knowledge of it.\n\nHowever, the People [Sufis] only resorted to this Name, which is the Ailment (العلة), because they saw the cause (*`illa*) linked to its effect (*ma`lul*), and the effect linked to its cause. They knew that the World (العالم) is the dominion (ملك) of Allah, and the dominion is truly bound in its existence as a dominion to the Sovereign (الملك), and the Sovereign is Allah. The dominion cannot be a sovereign over itself; thus, it is bound to the Sovereign. Since the correlation (التضايف) appeared in the World being governed (*marbub*) and possessed (*mamluk*), they resorted to the name Ailment and did not resort to the name Cause or Condition (الشرط). And because some of the Divine admonitions are pains and calamities that souls naturally dislike, they resorted to a name that encompasses all admonitions, thus choosing the Ailment. For sickness is called an *`illa*, and it is one of the strongest admonitions for returning to Allah, due to the weakness it entails.\n\nFurthermore, Allah made the secondary causes (الأسباب) veils (حجبا) from Allah, and souls relied upon them, forgetting Allah in them, and reliance shifted to them among creation. Although the Ailment is the very essence of the Cause, the difference in the name implies a different ruling. The Ailment is the opposite of the Cause, for it inherently admonishes one toward Allah. Thus, the name Ailment is more appropriate for the admonisher. Therefore, any cause that does not return you to Allah, nor admonish you concerning Him, nor make Him present for you, is not an Ailment.\n\nMy disease is the chronic ailment, because\nIt admonishes me in every state concerning my self.\n\nMy Ailment is not other than me, nor am I my Ailment,\nI am not possessed of separation, nor am I possessed of kind.\n\nI am not based on knowledge, so know who I am,\nNor am I based on ignorance of my Essence (ذاتي), nor confusion.\n\nI am not the one you mean, nor am I other than Him,\nBut I am, in subtraction and multiplication, like the root (الأس).\n\n### Indeed, the Ailment is one of the Divine Admonitions\n\nSince the Ailment (العلة) is the Divine Admonition (التنبه الإلهي), the admonitions of The Real (الحق) are confined only in one way: that the Divine Admonition must be either from the outside or from the inside. If it is from the outside, it may be established or it may not. If it is from the inside, it is necessarily established, such as the case of Ibrahim ibn Adham, who was called from the pommel of his saddle. He turned toward it, but the call was from his heart, though he imagined it was from the pommel of his saddle.\n\nAnd like the owner of the blind lark (القنبرة العمياء) when the earth split open for it, revealing two small bowls, one of gold and one of silver. In one was water, and in the other, sesame seeds. The lark ate the sesame and drank the water. The blind lark was his own soul (نفسه) represented to him in this form, because his soul was in a state of blindness due to disobedience, despite the grace of Allah upon him. He understood this and returned to Allah. These are examples presented to them: the form appears externally, but the matter is internal to his state, and that is why they were confirmed [in their return].\n\nThe Divine Admonition may also come from an Occurrence (واقعة), and it was through the Occurrence that our return to Allah took place, and this is the most complete of the Ailments (العلل). For Occurrences are the glad tidings (المبشرات) and the beginnings of Divine Revelation (الوحي الإلهي), and they are internal, originating from the very essence (ذات) of the human being. Some people see them in the state of sleep, some see them in the state of Annihilation (فناء), and some see them in the state of wakefulness, without being veiled from the perceptions of their senses at that time.\n\nIt is only called an Ailment because it causes pain in the soul over what it missed of The Real (الحق) for which it was created. It makes one imagine what his standing would be before Allah if he were to die in a state of disobedience. And even if he were forgiven, would he not feel shame before Him, having disobeyed Him using His grace? And among His graces upon him is that He granted him respite and did not hold him accountable for what he did, as we said in a poem of ours:\n\nO You who sees me, but Whom I do not see,\nHow often do I see Him, but He does not see me?\n\nOne of my brethren said to me: \"How can you say that He does not see you, when you know that He sees you?\" I replied immediately, extemporaneously:\n\nO You who sees me as a criminal,\nBut Whom I do not see taking hold [of me],\n\nHow often do I see Him bestowing grace,\nBut He does not see me seeking refuge!\n\nIf there were nothing in disobedience except shame (الاستحياء), that would be immense; rather, it is greater than punishment (العقوبة). Forgiveness (المغفرة) is harder upon the Gnostics (العارفين) than punishment. Punishment is a recompense, and comfort follows the settlement of the debt; it is like one who has received his due. Forgiveness is not like that, for you know that the claim of The Real is directed against you, and that He has graced you by abandoning the demand. Thus, you remain embarrassed and ashamed forever.\n\nFor this reason, when Allah forgives His servant his sin, He intervenes between him and the remembrance of it and makes him forget it. For if he remembered it, he would feel shame, and there is no torment upon souls greater than shame, to the point that the one who feels shame wishes he had never existed, as the Perfect Woman (الكاملة) said: <<يا لَيْتَنِي مِتُّ قَبْلَ هذا وكُنْتُ نَسْياً مَنْسِيًّا>> (Oh, would that I had died before this and was a thing forgotten, utterly forgotten). This was shame before a creature, when they attributed to her what was unfitting for her house and her origin. For this reason, they said: <<ما كانَ أَبُوكِ امْرَأَ سَوْءٍ وما كانَتْ أُمُّكِ بَغِيًّا>> (Your father was not a man of evil, nor was your mother unchaste). So Allah acquitted her of what they attributed to her, due to the torment of shame she experienced from her people. How then is the shame before Allah concerning the disobedience of the command of his Master that the servant realizes?\n\nIf you ask, \"Is it possible to disobey while in a state of Unveiling (الكشف)?\" We say, \"No.\" It was asked, \"What about the saying of Abu Yazid when he was asked, 'Does the Gnostic (العارف)—and the Gnostic is one of the People of Unveiling—disobey?' He replied: <<وكانَ أَمْرُ الله قَدَراً مَقْدُوراً>> (And the command of Allah is a decree determined), thus permitting it.\" We say: This is the etiquette (أدب) of the Gnostics with The Real (الحق) in their answers. Where he said that if Allah decreed that [disobedience] upon them in His prior Knowledge, then it must occur, and it is a disobedience, so the veil (الحجاب) must descend. As the Prophet (peace and blessings be upon him) said: \"When Allah desires to execute His decree (قضائه) and destiny (قدره), He strips the people of intellect of their intellects, until He has executed His destiny upon them, then He restores it to them so they may reflect.\"\n\nLikewise is the state of the Gnostic when Allah desires the occurrence of disobedience from him, even though his Gnosis (معرفته) prevents him from it. Allah beautifies that action for him through an interpretation (تأويل) in which he finds a face toward The Real. The Gnostic does not intend thereby to violate sanctity, just as Adam did, like a jurist who makes an error. When the decreed event occurs, Allah reveals to him the corruption of that interpretation which led him to that action, just as He did with Adam, for he disobeyed through interpretation.\n\nWhen he realizes after the occurrence that he erred, he knows that he disobeyed. At that point, the tongue of the Exoteric Law (لسان الظاهر) judges him to be disobedient, and he is disobedient in his own estimation. But at the time the action occurred, he was not, due to the ambiguity of the interpretation, like the jurist during the time of his legal ruling on a matter, believing that it is the very prescribed ruling in that issue. In the second state, it becomes clear to him through evidence that he erred, and thus the tongue of the Exoteric Law judges him to be mistaken at the time the evidence appears, not before.\n\nIf the Gnostic is one of those to whom it was said through the tongue of the Lawgiver, \"Do what you wish, for I have forgiven you,\" then he has not disobeyed, neither exoterically nor esoterically, in the sight of Allah. Even if the tongue of the Exoteric Law judges him to be disobedient, it is because it did not grasp the abrogation of that ruling by the Lawgiver's permission. Thus, the tongue of the Exoteric Law is like a mistaken jurist who deems the correct ruling of other jurists to be an error, relying on his own evidence. Whoever holds this station has not performed an action that necessitates shame, even if the tongue of the Exoteric Law judges him to be disobedient.\n\nAmong the admonitions of The Real is the granting of success (التوفيق) in hitting upon the evidence exactly as it is in the reality of the matter, so that he may be upon clear insight (بصيرة). This is what is cared for at the very first step. If the Ailment causes him an ailment, it purifies him. When purification occurs, he forgets the disobedience he was engaged in and becomes occupied with what he is directed toward, in a state of expansion (مبسوطا), not contraction (مقبوضا). For this reason, some defined repentance (التوبة) as forgetting your sin. The meaning of this, according to this speaker, is that when Allah the Exalted accepts your repentance, He makes you forget your sin and does not remind you of it. For if you remembered it, you would confine it between yourself and The Real, and it is an ugly form, thus placing an ugly image between you and The Real that signals distance. This is the benefit of forgetting.\n\nRegarding the saying of Allah to His Prophet (peace and blessings be upon him): <<لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ>> (That Allah may forgive you your sin that preceded and that which will follow), Gabriel (جبريل) never ceased descending upon him in the form of Dihya, who was the most handsome man of his time, saying to him, through the image of the state: \"O Muhammad, there is nothing between me and you except the form of beauty and perfection.\" For Gabriel was between him and Allah. Such was the beauty of Dihya that when he arrived in Medina and people, men and women, came out to him, no pregnant woman saw him but that she miscarried what was in her womb, due to what she perceived within herself from the beauty of his form.\n\nThus, Allah makes the repentant Gnostics forget their past sins. For this reason, they are forgiven—that is, veiled (ستر) from them. Veiling is of two types: either they are veiled from them entirely, or they are exchanged for good deeds (حسنة), so that the form of that evil deed is made beautiful through repentance, and it appears to him as a good deed, as He said: <<يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ>> (Allah will change their evil deeds into good deeds)—meaning, He returns their ugliness as beauty. Among the admonitions of The Real is His saying, the Exalted: <<فَأُوْلئِكَ يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ>> (For those, Allah will change their evil deeds into good deeds). When they know this, they hasten in returning to Allah and race toward it. Thus, I have made clear to you the meaning of the state of the Ailment (العلة) according to the Group [Sufis] and the effect it has upon men.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر دو سو سات: حالتِ علت (علت) کے بیان میں\n\nمریض کا بھروسہ طبیب پر ہوتا ہے، جب بھی وہ اپنے اندر کسی علت (علت) کو محسوس کرتا ہے۔\nتو تم اسے دیکھتے ہو کہ وہ اس کی عبادت کرتا ہے، حالانکہ وہ اس کا رب نہیں ہے، اس خوف سے کہ کہیں وہ (علت) اسے اس کی قبر میں نہ اتار دے۔\nپس میں نے پوچھا کہ اس بھروسے کا سبب (سبب) کیا ہے؟ تو مجھے جواب دیا گیا: یہ صرف اس کا اس کی جنس سے ہونا ہے۔\n\n### [علت (العلة) ذات حق (الحق) کی طرف سے ایک تنبیہ (التنبيه) ہے]\n\nجان لو کہ علت (العلة) صوفیہ (القوم) کے نزدیک ذات حق (الحق) کی طرف سے ایک تنبیہ (التنبيه) ہے، اور ذات حق (الحق) کی تنبیہات (التنبيهات) میں سے ایک یہ ہے کہ اس کا اپنے نبی صلی اللہ علیہ وسلم کی زبان پر یہ فرمان ہے: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا\" اور ایک روایت میں جسے کشف (الکشف) صحیح قرار دیتا ہے، اگرچہ وہ اہل نقل کے نزدیک ثابت نہیں ہے، یہ ہے کہ \"رحمٰن کی صورت پر\"۔ پس اشکال ختم ہو گیا، اور وہی (اللہ) اس علت (العلة) سے شفا دینے والا ہے۔ اللہ تعالیٰ فرماتا ہے: لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ (تاکہ تم لوگوں کے لیے بیان کر دو جو ان کی طرف نازل کیا گیا ہے)۔ پس ہم نے جان لیا کہ ہر وہ روایت جو اشکال کو دور کر دے، وہی صحیح ہے، اگرچہ اہل نقل کے نزدیک وہ ضعیف ہی کیوں نہ ہو۔ اور جب اللہ ہی شفا دینے والا اور عافیت دینے والا ہے، تو وہی طبیب ہے، جیسا کہ صدیق (ابو بکر) نے فرمایا: \"طبیب نے مجھے بیمار کیا\"۔ پس صاحب علت (العلة) کے طبیب کی طرف مائل ہونے کا سبب (السبب) وہی ہے جو ہم نے شعر میں ذکر کیا، یعنی اس کا صورت پر پیدا کیا جانا۔ پھر اس خبر اور اس کشفی (الکشف) نظر کی تائید اللہ تعالیٰ کے اس قول سے ہوئی: \"میں بیمار ہوا تو تم نے میری عیادت نہیں کی\"۔ اور جب اس کی تفسیر کی گئی تو فرمایا: \"فلاں بیمار ہوا، تو اس نے اپنے آپ کو اس میں اتارا جو فلاں کو پہنچا، یہ اس کی طرف سے فلاں کی دیکھ بھال کی وجہ سے تھا\"۔ یہ سب ان لوگوں کے لیے علتیں (علل) ہیں جو اللہ کی طرف سے عقل رکھتے ہیں۔\n\nپس علت (العلة) سبب (السبب) کا اثبات ہے، اور ذات حق (الحق) عین سبب (السبب) ہے، کیونکہ اگر وہ نہ ہوتا تو عالم وجود میں نہ آتا۔ پس وہی الْخالِقُ الْبارِئُ الْمُصَوِّرُ الشافي (پیدا کرنے والا، وجود بخشنے والا، صورت بنانے والا، شفا دینے والا) ہے۔ پس جب وہ اپنے اس قول میں عین علت (العلة) ہے کہ \"تجھ سے، تجھ میں سے\" (منك من)، اور اپنے اس قول میں کہ \"میں تیری پناہ مانگتا ہوں تجھ سے\" (أعوذ بك منك)، تو اسے شفا بھی اسی نے دی، کیونکہ اللہ کے سوا کوئی شفا دینے والا نہیں ہے۔ پس وہ ہر علت (العلة) سے شفا دینے والا ہے۔ بے شک اللہ نے اسباب (الأسباب) کو مقرر کیا ہے، تو وہ انہیں اٹھانے پر قادر نہیں ہے، اور اللہ نے ان کے لیے احکام مقرر کیے ہیں، تو انہیں رد کرنا ممکن نہیں ہے، اور وہی اسباب (الأسباب) کا مسبب ہے۔ پس اس نے بیماری اور دوا کو پیدا کیا، اور شفا کو خاص طور پر صرف اپنے لیے رکھا۔ پس شفا مرض کو زائل کرنے کی علت (العلة) ہے، لیکن ہر علت (العلة) شفا نہیں ہوتی۔ پس ہر مسبب سبب (السبب) ہے، لیکن ہر سبب (السبب) مسبب نہیں ہوتا۔ البتہ، کبھی وہ حکم کا مسبب ہوتا ہے، نہ کہ عین کا مسبب، جیسا کہ اس کا قول ہے: أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ (میں دعا کرنے والے کی دعا قبول کرتا ہوں جب وہ مجھے پکارتا ہے)۔ پس جب علت (العلة) کا معنی سبب (السبب) ہو تو اس کا ایک حکم ہے، اور جب اس کا معنی مرض ہو تو اس کا دوسرا حکم ہے۔ پس مرض کے معنی میں وہ بیماری (داء) ہے، اور سبب (السبب) کے معنی میں وہ حکمت (حكمة) ہے۔ پس علت (العلة) ہر حال میں ذات حق (الحق) کی طرف سے اپنے بندے کے لیے ایک تنبیہ (التنبيه) ہے۔ کبھی وہ اسے اس کی غفلت کی نیند سے کسی ایسی چیز کے ذریعے بیدار کرتا ہے جو اس پر نازل ہوتی ہے، اور یہی بیماری اور مرض ہے۔ پس جب وہ عافیت کھو دیتا ہے تو درد محسوس کرتا ہے، اور جانتا ہے کہ اس پر کوئی مصیبت نازل ہوئی ہے۔ پس اللہ نے اس کے لیے یہ کہنا مشروع کیا: إِنَّا لِلَّهِ وإِنَّا إِلَيْهِ راجِعُونَ (بے شک ہم اللہ ہی کے لیے ہیں اور بے شک ہم اسی کی طرف لوٹنے والے ہیں)، اور لوٹتا وہی ہے جو باہر نکلا ہو۔ اور کبھی وہ اسے اس کی غفلت کی نیند سے کسی ایسی حکمت (حكمة) کے ذریعے بیدار کرتا ہے جو اس کے نفس میں ظاہر ہوتی ہے، بغیر اس کے کہ وہ کسی نفسانی مرض میں مبتلا ہو۔\n\nپس جب ذات حق (الحق) عین اس کی علت (العلة) ہو، تو یہ صرف اچانک ظہور الٰہی (التجلی) سے ہی ہو سکتا ہے، کیونکہ اللہ کے لیے اپنے بندوں کے دلوں پر اچانک ظہور (فجآت) ہوتے ہیں جو ان پر بغیر کسی طلب یا کسی مخصوص سبب (السبب) کے پیشگی علم کے وارد ہوتے ہیں، اگرچہ نفس الامر میں وہ کسی سبب (السبب) سے ہی ہوتے ہیں، لیکن بندے کو اس کا علم نہیں ہوتا۔ صوفیہ (القوم) نے اس نام (علت) کی طرف رجوع صرف اس لیے کیا جب انہوں نے دیکھا کہ علت (العلة) اپنے معلول (اثر) سے جڑی ہوئی ہے اور معلول اپنی علت (العلة) سے جڑا ہوا ہے۔ اور انہوں نے جانا کہ عالم اللہ کی ملکیت ہے، اور ملکیت کا وجود حقیقت میں مالک کے ساتھ جڑا ہوا ہے، اور مالک اللہ ہے۔ اور ملکیت خود پر ملکیت نہیں ہو سکتی، لہٰذا وہ مالک سے جڑی ہوئی ہے۔ جب عالم کے مربوب (پروردہ) اور مملوک (ملکیت) ہونے میں تضایف (باہمی تعلق) ظاہر ہوا، تو انہوں نے علت (العلة) کے نام کی طرف رجوع کیا، اور سبب (السبب) یا شرط کے نام کی طرف رجوع نہیں کیا۔ اور چونکہ بعض تنبیہاتِ الٰہیہ ایسے درد اور مصیبتیں ہوتی ہیں جنہیں نفوس طبعاً ناپسند کرتے ہیں، اس لیے انہوں نے ایک ایسے نام کی طرف رجوع کیا جو تمام تنبیہات (التنبيهات) کو جمع کرے۔ پس انہوں نے علت (العلة) کی طرف رجوع کیا، کیونکہ مرض کو علت (العلة) کہا جاتا ہے، اور یہ اللہ کی طرف رجوع کرنے کے لیے سب سے قوی منبہات میں سے ہے، کیونکہ اس میں ضعف شامل ہوتا ہے۔ پھر اللہ نے اسباب (الأسباب) کو اللہ سے حجاب بنا دیا، اور نفوس ان پر بھروسہ کرنے لگے، اور ان میں اللہ کو بھول گئے، اور مخلوق کا ان پر اعتماد منتقل ہو گیا۔ اور اگرچہ علت (العلة) عین سبب (السبب) ہے، لیکن نام کے اختلاف کی وجہ سے حکم مختلف ہوتا ہے۔ پس علت (العلة) سبب (السبب) کے برعکس ہے، کیونکہ وہ اپنی ذات سے اللہ کی طرف متنبہ کرنے والی ہے۔ پس علت (العلة) کا نام منبہ (بیدار کرنے والے) کے لیے زیادہ موزوں تھا۔ پس ہر وہ سبب (السبب) جو تمہیں اللہ کی طرف نہ لوٹائے، نہ تمہیں اس پر متنبہ کرے، اور نہ اسے تمہارے پاس حاضر کرے، وہ علت (العلة) نہیں ہے۔\n\nپس میرا مرض ہی وہ لاعلاج بیماری ہے، کیونکہ وہ مجھے ہر حال میں میرے نفس پر متنبہ کرتا ہے۔\nپس میری علت (العلة) نہ کوئی اور ہے اور نہ میں خود میری علت (العلة) ہوں، اور نہ میں فصل (امتیازی وصف) والا ہوں اور نہ میں جنس (نوع) والا ہوں۔\nاور نہ میں علم پر ہوں کہ تم جان سکو کہ میں کون ہوں، اور نہ میں اپنی ذات سے جاہل ہوں اور نہ کوئی ابہام ہے۔\nپس نہ میں وہ ہوں جس کا تم ارادہ کرتے ہو اور نہ میں اس کے سوا کوئی اور ہوں، لیکن میں ضرب اور طرح (ریاضیاتی عمل) میں بنیاد (الأس) کی مانند ہوں۔\n\n### [بے شک علت (العلة) تنبیہاتِ الٰہیہ میں سے ایک تنبیہ (التنبيه) ہے]\n\nاور چونکہ علت (العلة) تنبیہ (التنبيه) الٰہیہ ہے، تو ذات حق (الحق) کی تنبیہات (التنبيهات) صرف ایک ہی طریقے سے محدود نہیں ہوتیں، اور وہ یہ ہے کہ تنبیہ (التنبيه) الٰہیہ یا تو باہر سے ہوتی ہے یا اندر سے۔ اگر باہر سے ہو تو وہ ثابت ہو بھی سکتی ہے اور نہیں بھی، اور اگر اندر سے ہو تو وہ ضرور ثابت ہوتی ہے۔ جیسے ابراہیم بن ادہم کا واقعہ، جنہیں ان کی زین کے اگلے حصے سے پکارا گیا، تو انہوں نے اس کی طرف دیکھا، تو وہ آواز ان کے دل سے تھی، لیکن انہوں نے گمان کیا کہ وہ ان کی زین کے اگلے حصے سے ہے۔ اور جیسے اندھی قنبرہ (چڑیا) کا قصہ، جب زمین اس کے لیے دو پیالیوں (سكرجتين) میں پھٹ گئی، ایک سونے کی اور دوسری چاندی کی، ایک میں پانی تھا اور دوسری میں تل، تو اس نے تل کھائے اور پانی پیا۔ پس وہ اندھی قنبرہ (چڑیا) خود اس کے نفس کی مثال تھی جو اس صورت میں اس کے لیے ظاہر ہوئی، کیونکہ وہ اللہ کی نعمت کے باوجود نافرمانی کی حالت میں اندھی تھی۔ پس اس نے یہ جان لیا اور اللہ کی طرف رجوع کیا۔ یہ ان کے لیے مثالیں بیان کی گئی ہیں۔ صورت باہر سے ظاہر ہوتی ہے، لیکن امر اس کے حال میں اس کے پاس ہوتا ہے، اسی لیے وہ ثابت قدم رہے۔\n\nاور کبھی تنبیہ (التنبيه) الٰہیہ کسی واقعہ (واقعہ) سے ہوتی ہے، اور واقعہ (واقعہ) ہی سے ہمارا اللہ کی طرف رجوع ہوا، اور یہ سب سے مکمل علت (العلة) ہے۔ کیونکہ واقعات (الوقائع) ہی مبشرات ہیں اور وحی الٰہیہ کی ابتدائی شکلیں ہیں، اور یہ اندر سے ہوتی ہیں، کیونکہ یہ انسان کی ذات سے ہوتی ہیں۔ پس بعض لوگ اسے نیند کی حالت میں دیکھتے ہیں، اور بعض فنا (الفناء) کی حالت میں، اور بعض بیداری کی حالت میں، اور یہ اس وقت اس کے حواس کے ادراکات سے اسے حجاب میں نہیں ڈالتی۔ اور اسے علت (العلة) اس لیے کہا گیا کہ یہ نفس میں اس حق (الحق) پر درد پیدا کرتی ہے جو اس سے فوت ہو گیا جس کے لیے وہ پیدا کیا گیا تھا، اور وہ گمان کرتا ہے کہ اگر وہ نافرمانی کی حالت میں مر جاتا تو اللہ کے سامنے اس کا کیا حال ہوتا؟ اور اگر اسے معاف کر دیا جاتا، تو کیا وہ اللہ سے شرمندہ نہ ہوتا کہ اس نے اس کی نعمت سے اس کی نافرمانی کی؟ اور اس پر اللہ کی نعمتوں میں سے یہ بھی ہے کہ اس نے اسے مہلت دی اور اس کے کیے پر اس کا مواخذہ نہیں کیا، جیسا کہ ہم نے اپنے ایک نظم میں کہا:\n\n\"اے وہ جو مجھے دیکھتا ہے اور میں اسے نہیں دیکھتا، میں اسے کتنا دیکھتا ہوں اور وہ مجھے نہیں دیکھتا\"\n\nتو میرے بعض بھائیوں نے مجھ سے کہا: تم کیسے کہتے ہو کہ وہ تمہیں نہیں دیکھتا، حالانکہ تم جانتے ہو کہ وہ تمہیں دیکھتا ہے؟ تو میں نے فوراً برجستہ کہا:\n\n\"اے وہ جو مجھے مجرم دیکھتا ہے، اور میں اسے پکڑتے ہوئے نہیں دیکھتا، میں اسے کتنا انعام دیتے ہوئے دیکھتا ہوں، اور وہ مجھے پناہ لیتے ہوئے نہیں دیکھتا\"\n\nاگر نافرمانی میں صرف شرمندگی ہی ہوتی تو یہ بہت بڑی بات ہوتی، بلکہ یہ سزا سے بھی زیادہ عظیم ہے۔ پس عارفین (العارفین) کے لیے مغفرت سزا سے زیادہ سخت ہے۔ کیونکہ سزا بدلہ ہے، تو استیفاء (حق پورا ہونے) کے بعد راحت ہوتی ہے، پس یہ اس شخص کی طرح ہے جس نے اپنا حق پورا کر لیا۔ اور مغفرت ایسی نہیں ہے، کیونکہ تم جانتے ہو کہ حق تم پر واجب ہے، اور اس نے تم پر مطالبہ ترک کر کے انعام کیا ہے، تو تم ہمیشہ شرمندہ اور حیا والے رہتے ہو۔ اسی لیے جب اللہ کسی بندے کے گناہ کو معاف کر دیتا ہے، تو وہ اس کے اور اس کے یاد کرنے کے درمیان رکاوٹ ڈال دیتا ہے اور اسے بھلا دیتا ہے۔ کیونکہ اگر وہ اسے یاد کرے گا تو شرمندہ ہو گا، اور اس نے اسے اپنے اور ذات حق (الحق) کے درمیان محصور کر لیا، اور ایک قبیح صورت کو اپنے اور ذات حق (الحق) کے درمیان بنا لیا جو دوری کی خبر دیتی ہے۔ اور نفوس پر حیا سے بڑا کوئی عذاب نہیں، یہاں تک کہ صاحبِ حیا یہ تمنا کرتا ہے کہ کاش وہ کوئی چیز نہ ہوتا، جیسا کہ کاملہ (مریم علیہا السلام) نے کہا: يا لَيْتَنِي مِتُّ قَبْلَ هذا وكُنْتُ نَسْياً مَنْسِيًّا (اے کاش میں اس سے پہلے مر چکی ہوتی اور بھولی بسری ہو جاتی)۔ یہ مخلوق سے حیا تھی، جب انہوں نے ان کی طرف وہ بات منسوب کی جو ان کے گھرانے اور ان کی اصل کے لائق نہیں تھی۔ اسی لیے انہوں نے کہا: ما كانَ أَبُوكِ امْرَأَ سَوْءٍ وما كانَتْ أُمُّكِ بَغِيًّا (نہ تمہارا باپ برا آدمی تھا اور نہ تمہاری ماں بدکار تھی)۔ پس اللہ نے انہیں اس چیز سے بری کر دیا جو انہوں نے ان کی طرف منسوب کی تھی، اس حیا کے عذاب کی وجہ سے جو انہیں اپنی قوم سے پہنچا۔ تو اللہ سے حیا کا کیا عالم ہو گا جب بندہ اپنے آقا کے حکم کی خلاف ورزی کا یقین کر لے؟\n\nاگر تم کہو: کیا کشف (الکشف) کی حالت میں نافرمانی ممکن ہے؟ ہم کہیں گے: نہیں۔ کہا گیا: تو ابو یزید کا قول کیا ہے، جب ان سے پوچھا گیا: کیا عارف (العارف) نافرمانی کرتا ہے، اور عارف (العارف) اہل کشف (الکشف) میں سے ہوتا ہے؟ تو انہوں نے کہا: وكانَ أَمْرُ الله قَدَراً مَقْدُوراً (اور اللہ کا حکم ایک طے شدہ تقدیر تھا)۔ پس انہوں نے اسے جائز قرار دیا۔ ہم کہیں گے: عارفین (العارفین) کا ذات حق (الحق) کے ساتھ اپنے جوابات میں یہی ادب ہوتا ہے۔ جہاں انہوں نے کہا کہ اگر اللہ نے اپنے سابقہ علم میں ان پر یہ مقدر کر دیا ہے، تو یہ ضرور ہو گا، اور یہ نافرمانی ہے، تو حجاب ضروری ہے، جیسا کہ نبی صلی اللہ علیہ وسلم نے فرمایا: \"جب اللہ اپنے قضا و قدر کو نافذ کرنے کا ارادہ کرتا ہے، تو وہ عقل والوں سے ان کی عقلیں سلب کر لیتا ہے، یہاں تک کہ جب ان میں اپنی تقدیر نافذ کر دیتا ہے، تو انہیں ان کی عقلیں واپس کر دیتا ہے تاکہ وہ عبرت حاصل کریں\"۔\n\nاور عارف (العارف) کا حال بھی ایسا ہی ہوتا ہے جب اللہ اس سے نافرمانی کا وقوع چاہتا ہے، اور اس کی معرفت (المعرفۃ) اسے اس سے روکتی ہے۔ تو اللہ اس عمل کو اس کے لیے ایک تاویل (تأویل) کے ذریعے مزین کر دیتا ہے جس میں اسے ذات حق (الحق) کی طرف کوئی پہلو نظر آتا ہے، اور عارف (العارف) کا مقصد حرمت کو پامال کرنا نہیں ہوتا، جیسا کہ آدم نے کیا۔ یہ ایک مجتہد کی طرح ہے جو غلطی کرتا ہے۔ پس جب مقدر شدہ چیز اس سے واقع ہو جاتی ہے، تو اللہ اس تاویل (تأویل) کے فساد کو اس پر ظاہر کر دیتا ہے جس نے اسے اس فعل کی طرف لے جایا، جیسا کہ آدم کے ساتھ ہوا۔ کیونکہ انہوں نے تاویل (تأویل) کی وجہ سے نافرمانی کی۔ پس جب وقوع کے بعد اسے یقین ہو جاتا ہے کہ اس نے غلطی کی ہے، تو وہ جانتا ہے کہ اس نے نافرمانی کی ہے۔ اس وقت ظاہر کی زبان اس پر عاصی (نافرمان) ہونے کا حکم لگاتی ہے، اور وہ اپنے نفس کے نزدیک بھی عاصی ہوتا ہے۔ لیکن فعل کے وقوع کے وقت نہیں، تاویل (تأویل) کے شبہ کی وجہ سے، جیسے کوئی مجتہد اپنے فتوے کے وقت کسی معاملے میں یہ اعتقاد رکھتا ہے کہ وہ مسئلہ میں مشروع حکم کا عین ہے۔ اور دوسری حالت میں دلیل سے اس پر ظاہر ہوتا ہے کہ اس نے غلطی کی ہے، تو ظاہر کی زبان اس پر غلطی کرنے والا ہونے کا حکم لگاتی ہے، دلیل کے ظاہر ہونے کے وقت، اس سے پہلے نہیں۔\n\nاور اگر عارف (العارف) ان لوگوں میں سے ہو جن سے شارع کی زبان پر کہا گیا: \"جو چاہو کرو، میں نے تمہیں بخش دیا\"، تو اس نے نہ ظاہراً اور نہ باطناً اللہ کے نزدیک نافرمانی کی۔ اگرچہ ظاہر کی زبان اس پر نافرمانی کا حکم لگاتی ہے، کیونکہ اس نے شارع کی طرف سے اس کی اباحت کے نسخ کو نہیں پایا۔ پس ظاہر کی زبان ایک غلطی کرنے والے مجتہد کی طرح ہے جو اپنے دلیل پر اعتماد کرتے ہوئے دوسرے مجتہدین کی درستی کو غلطی سمجھتا ہے۔ پس جس کا یہ مقام ہو، تو اس نے ایسا کوئی فعل نہیں کیا جو اس کے لیے حیا کو واجب کرے، اگرچہ ظاہر کی زبان اس پر نافرمانی کا حکم لگاتی ہے۔\n\nپس ذات حق (الحق) کی تنبیہات (التنبيهات) میں سے یہ ہے کہ وہ دلائل کی درستی کی توفیق دے، جیسا کہ وہ نفس الامر میں ہیں، تاکہ وہ بصیرت پر ہو، اور یہی وہ چیز ہے جس پر پہلے قدم پر توجہ دی جاتی ہے۔ پس جب علت (العلة) اسے ایک اور علت (العلة) عطا کرتی ہے، تو اسے پاک کر دیتی ہے۔ اور جب تطہیر واقع ہو جاتی ہے، تو وہ اس نافرمانی کو بھول جاتا ہے جس پر وہ تھا، اور اس چیز میں مشغول ہو جاتا ہے جس کی طرف وہ کشادہ دلی سے متوجہ ہوا، نہ کہ تنگی سے۔ اسی لیے بعض نے توبہ کی تعریف میں کہا ہے کہ تم اپنے گناہ کو بھول جاؤ۔ اور اس کہنے والے کے نزدیک اس کا مطلب یہ ہے کہ جب اللہ تعالیٰ تمہاری توبہ قبول کر لیتا ہے، تو وہ تمہیں تمہارا گناہ بھلا دیتا ہے، اور تمہیں وہ یاد نہیں دلاتا۔ کیونکہ اگر تم اسے یاد کرو گے تو تم اسے اپنے اور ذات حق (الحق) کے درمیان محصور کر لو گے، اور وہ قبیح صورت ہے، تو تم نے اپنے اور ذات حق (الحق) کے درمیان ایک قبیح صورت بنا لی جو دوری کی خبر دیتی ہے۔ یہ فائدہ ہے نسیان (بھول جانے) کا۔ جیسا کہ اللہ نے اپنے نبی علیہ الصلاۃ والسلام سے فرمایا: لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ (تاکہ اللہ تمہارے اگلے اور پچھلے گناہ معاف کر دے)۔ جبرائیل ہمیشہ دحیہ کی صورت میں نازل ہوتے تھے، اور وہ اپنے زمانے کے سب سے خوبصورت شخص تھے۔ وہ حالت کی صورت میں آپ سے کہتے تھے: \"اے محمد! میرے اور آپ کے درمیان صرف حسن و جمال کی صورت ہے\"۔ اور دحیہ کے جمال کا یہ عالم تھا کہ جب وہ مدینہ آئے اور مرد و عورت ان کی طرف نکلے، تو کسی حاملہ عورت نے انہیں نہیں دیکھا مگر اس نے اپنے پیٹ کا بوجھ گرا دیا، اس حسنِ صورت کی وجہ سے جو اس نے اپنے اندر محسوس کیا۔ پس اللہ عارفین (العارفین) میں سے توبہ کرنے والوں کو ان کے سابقہ گناہ بھلا دیتا ہے، اور اسی لیے وہ بخش دیے گئے، یعنی ان سے چھپا دیے گئے۔ اور پردہ دو طرح کا ہوتا ہے: یا تو ان سے مکمل طور پر چھپا دیا جائے، یا اسے نیکی سے بدل دیا جائے، تو توبہ کے ذریعے اس برائی کی صورت کو خوبصورت بنا دیا جاتا ہے، تو وہ اسے نیکی کے طور پر ظاہر ہوتی ہے، جیسا کہ فرمایا: يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ (اللہ ان کی برائیوں کو نیکیوں سے بدل دیتا ہے)، یعنی ان کی قباحت کو حسن میں بدل دیتا ہے۔ پس ذات حق (الحق) کی تنبیہات (التنبيهات) میں سے اللہ تعالیٰ کا یہ قول ہے: فَأُوْلئِكَ يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ (تو یہ وہ لوگ ہیں جن کی برائیوں کو اللہ نیکیوں سے بدل دیتا ہے)۔ پس جب وہ یہ جان لیتے ہیں تو اللہ کی طرف رجوع کرنے میں تیزی کرتے ہیں اور اس کی طرف سبقت لے جاتے ہیں۔\n\nپس میں نے تمہارے لیے اس فرقے (صوفیہ) کے نزدیک حالتِ علت (العلة) کا معنی اور مردانِ حق پر اس کے اثرات کو واضح کر دیا۔\n\nبسم الله الرحمن الرحيم",
    "fa": "«باب دویست و هفتم در بیان حال علت»\n\nبیمار به طبیب خود تکیه می‌کند، هرگاه در نفس خود علتی (علة) احساس کند.\nپس او را می‌بینی که طبیب را می‌پرستد، در حالی که او پروردگارش نیست، از بیم آنکه بیمار در گور خود جای گیرد.\nپس پرسیدم که سبب این تکیه چیست؟ به من گفته شد: چیزی جز این نیست که او (طبیب) از جنس اوست.\n\n### [علت (العلة) هشداری از جانب حق (الحق)]\n\nبدان که علت (العلة) نزد این طایفه، هشداری از جانب حق (الحق) و از جمله هشدارهای حق است. سخن او بر زبان پیامبرش (صلی الله علیه و سلم) که فرمود: «إن الله خلق آدم على صورته» (خداوند آدم را بر صورت خود آفرید)، و در روایتی که کشف (الکشف) آن را تصحیح می‌کند، هرچند نزد اصحاب نقل ثابت نشده باشد: «على صورة الرحمن» (بر صورت رحمان). پس اشکال برطرف می‌شود، و اوست شفا دهنده از این علت. خداوند متعال می‌فرماید: «لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ» (تا برای مردم آنچه را که بر ایشان نازل شده است، بیان کنی). پس دانستیم که هر روایتی که اشکال را برطرف کند، صحیح است، هرچند نزد اهل نقل ضعیف باشد. و چون خداوند خود شفا دهنده و عافیت بخش است، پس او طبیب است، چنانکه صدیق (ابوبکر) گفت: «طبیب مرا بیمار کرد.» پس سبب اشتیاق صاحب علت به طبیب، همان است که در شعر ذکر کردیم، یعنی آفرینش او بر صورت (الهی). سپس این خبر و این نظر کشفی (الکشف) با سخن خداوند متعال تأیید شد: «مرضت فلم تعدني» (بیمار شدم و مرا عیادت نکردی).\n\nو چون تفسیر شد، فرمود: فلانی بیمار شد، پس خود را در آنچه به فلانی رسیده بود، از روی عنایت به او، نازل کرد. اینها همه علل (العلل) هستند برای کسی که از جانب خدا تعقل کند. پس علت (العلة) اثبات سبب است، و حق (الحق) عین سبب است، زیرا اگر او نبود، عالَم وجود نمی‌یافت. پس اوست: «الْخالِقُ الْبارِئُ الْمُصَوِّرُ الشافي» (آفریننده، پدیدآورنده، صورت‌بخش، شفا دهنده). پس اگر او عین علت (العلة) باشد در سخن خود که می‌گوید: «منک من» (از تو، از من)، و در سخن خود: «أعوذ بك منك» (پناه می‌برم به تو از تو)، پس او را شفا نداد مگر از خودش، زیرا شفا دهنده‌ای جز خدا نیست. پس او شفا دهنده از هر علتی است. خداوند اسباب را قرار داد، پس کسی نمی‌تواند آنها را برطرف کند، و خداوند برای آنها احکامی قرار داد که رد کردن آنها ممکن نیست. و او مسبب‌الاسباب است. پس درد و دوا را آفرید، و شفا را جز برای خود قرار نداد. پس شفا علتی است برای از بین بردن بیماری، اما هر علتی شفا نیست. پس هر مسببی سبب است، اما هر سببی مسبب نیست. اما گاهی مسبب حکم است نه مسبب عین، مانند سخن او: «أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ» (دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم). پس علت (العلة)، اگر به معنای سبب باشد، حکمی دارد، و اگر به معنای بیماری باشد، حکمی دیگر. پس به معنای بیماری، درد است، و به معنای سبب، حکمت است. پس علت (العلة) در هر حال، هشداری از جانب حق (الحق) به بنده خود است. گاهی او را از خواب غفلتش با امری که بر او نازل می‌شود، بیدار می‌کند، و آن همان درد و بیماری است. پس چون عافیت را از دست داد، درد را احساس می‌کند و می‌داند که مصیبتی بر او نازل شده است. پس خداوند برای او تشریع کرده است که بگوید: «إِنَّا لِلَّهِ وإِنَّا إِلَيْهِ راجِعُونَ» (ما از آن خداییم و به سوی او باز می‌گردیم)، و باز نمی‌گردد مگر کسی که خارج شده باشد. و گاهی او را از خواب غفلتش با حکمتی که در نفس او ظاهر می‌شود، بیدار می‌کند، بدون اینکه بیماری جسمانی داشته باشد. پس اگر حق (الحق) عین علت (العلة) او باشد، این جز از یک تجلی (التجلی) ناگهانی الهی نیست، زیرا خداوند بر دل‌های بندگانش ناگهانی‌هایی دارد که بدون درخواست و بدون مقدمه سبب معینی بر آنها وارد می‌شود، هرچند در نفس‌الامر سببی وجود داشته باشد، اما بنده از آن آگاه نیست. غیر از این، این طایفه به این نام که «علت» است، روی نیاوردند، مگر به این دلیل که دیدند علت (العلة) به معلول خود مرتبط است و معلول به علت خود گره خورده است. و دانستند که عالَم ملک خداست، و ملک (مملوک) حقیقت وجودش به عنوان ملک، به مالک (الملک) گره خورده است، و مالک، خداست. و ملک نمی‌تواند بر خودش مالک باشد، پس به مالک گره خورده است. چون تضایف (نسبت متقابل) در مربوب و مملوک بودن عالَم ظاهر شد، به نام علت (العلة) روی آوردند و به نام سبب (السبب) یا شرط (الشرط) روی نیاوردند. و چون برخی از هشدارهای الهی، دردها و مصیبت‌هایی هستند که نفوس طبعاً از آنها کراهت دارند، به نامی روی آوردند که همه هشدارها را در بر می‌گیرد، و آن «علت» است. زیرا بیماری، علت نامیده می‌شود و از قوی‌ترین بیدارکننده‌ها برای بازگشت به سوی خداست، به دلیل ضعفی که در بر دارد. سپس خداوند اسباب را حجاب‌هایی برای خود قرار داد و نفوس به آنها تکیه کردند و خدا را در آنها فراموش کردند و اعتماد خلق از خدا به اسباب منتقل شد. و علت (العلة)، هرچند عین سبب است، اما اختلاف نام، حکم متفاوتی دارد. علت (العلة) در نقطه مقابل سبب (السبب) است، زیرا ذاتاً هشدار دهنده به سوی خداست. پس نام علت برای هشدار دهنده سزاوارتر است. پس هر سببی که تو را به سوی خدا باز نگرداند و تو را به او متوجه نسازد و او را نزد تو حاضر نکند، علت نیست.\n\nپس دوای من همان درد لاعلاج است، زیرا در هر حالی مرا به سوی نفسم هشدار می‌دهد.\nپس علت (العلة) من غیر من نیست و علت من، من نیستم، و من صاحب فصل (فصل) و صاحب جنس (جنس) نیستم.\nو من بر علم نیستم تا بدانی که من کیستم، و بر جهل به ذات خود و ابهام نیستم.\nپس من آن کسی نیستم که تو قصد می‌کنی و نه غیر او هستم، بلکه من در طرح و ضرب (ریاضی) مانند اصل (الأس) هستم.\n\n### [علت (العلة) هشداری از هشدارهای الهی است]\n\nو چون علت (العلة) همان تنبه الهی بود، هشدارهای حق (الحق) منحصر نمی‌شوند مگر از یک طریق، و آن این است که تنبه الهی یا از خارج است یا از داخل. اگر از خارج باشد، ممکن است ثابت شود و ممکن است ثابت نشود. و اگر از داخل باشد، حتماً ثابت می‌شود. مانند ابراهیم بن ادهم که از زین اسبش ندا داده شد، پس به آن سو نگریست و دید که ندا از قلب اوست، اما خیال کرد که از زین اسبش است. و مانند صاحب قنبره کور (بلدرچین کور) که زمین برایش شکافته شد و دو کاسه (سكرجتين) طلا و نقره ظاهر شد، در یکی آب و در دیگری کنجد بود. پس از کنجد خورد و از آب نوشید. آن قنبره کور، نفس او بود که در این صورت برایش تمثل یافته بود، زیرا او در حال کوری از مخالفت با نعمتی بود که خدا به او داده بود. پس او این را دانست و به سوی خدا بازگشت. اینها مثال‌هایی هستند که برای آنها زده شده است. صورت از خارج ظاهر می‌شود، در حالی که امر نزد او در حال خودش است، و به همین دلیل ثابت شدند. و ممکن است تنبه الهی از یک واقعه باشد، و بازگشت ما به سوی خدا از واقعه بود، و آن کامل‌ترین علل (العلل) است، زیرا وقایع (الوقائع) همان مبشرات و اوایل وحی الهی هستند و از داخل می‌باشند، زیرا از ذات انسان سرچشمه می‌گیرند. برخی از مردم آن را در حال خواب می‌بینند، و برخی در حال فنا (الفناء)، و برخی در حال بیداری می‌بینند و در آن هنگام از درک حواسشان محجوب نمی‌شوند. و این امر علت (العلة) نامیده شد، زیرا در نفس، دردی را به ارث می‌گذارد بر آنچه از حقی (الحق) که برای آن آفریده شده، از دست داده است، و گمان می‌کند که اگر در حال مخالفت بمیرد، چهره‌اش نزد خدا چگونه خواهد بود؟ و اگر هم بخشیده شود، آیا از او شرم نمی‌کند که با نعمت او نافرمانی کرده است؟ و از جمله نعمت‌های او بر بنده این است که به او مهلت داد و او را به آنچه از او سر زده بود، مؤاخذه نکرد، چنانکه در شعری از ما آمده است:\n\nای کسی که مرا می‌بینی و من تو را نمی‌بینم *** چقدر من او را می‌بینم و او مرا نمی‌بیند\n\nپس یکی از برادرانم به من گفت: چگونه می‌گویی او تو را نمی‌بیند، در حالی که می‌دانی او تو را می‌بیند؟ در همان حال بداهتاً گفتم:\n\nای کسی که مرا گناهکار می‌بینی *** و من او را در حال مؤاخذه نمی‌بینم\nچقدر من او را در حال نعمت بخشی می‌بینم *** و او مرا در حال پناه بردن نمی‌بیند\n\nاگر در مخالفت جز شرمندگی نبود، باز هم عظیم بود. بلکه شرمندگی از عقوبت (العقوبة) بزرگتر است. مغفرت (المغفرة) بر عارفان (العارفین) از عقوبت سخت‌تر است، زیرا عقوبت جزاست، پس آسودگی پس از استیفاء حاصل می‌شود. این مانند کسی است که حق خود را استیفا کرده باشد. اما آمرزش چنین نیست، زیرا می‌دانی که حق بر عهده توست و او با ترک مطالبه بر تو نعمت بخشیده است، پس همیشه خجل و شرمسار خواهی بود. به همین دلیل، اگر خداوند گناه بنده را بیامرزد، بین او و یادآوری آن حائل می‌شود و آن را از یادش می‌برد، زیرا اگر آن را به یاد آورد، آن را بین خود و حق (الحق) محصور کرده است و این صورتی زشت است. پس تو بین خود و حق، صورتی زشت قرار داده‌ای که نشان از دوری می‌دهد. این فایده فراموشی است. چنانکه خداوند به پیامبرش (علیه الصلاة والسلام) فرمود: «لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ» (تا خداوند گناهان گذشته و آینده تو را بیامرزد). جبرئیل پیوسته در صورت دحیه (که زیباترین فرد زمان خود بود) بر او نازل می‌شد و با زبان حال به او می‌گفت: ای محمد، بین من و تو جز صورت حسن و جمال نیست. از زیبایی دحیه این بود که وقتی به مدینه وارد شد و زنان و مردان به استقبالش بیرون آمدند، هیچ زن حامله‌ای او را ندید مگر اینکه از شدت تأثیری که از زیبایی صورتش بر او وارد شد، جنین خود را سقط کرد. خداوند گناهان گذشته تائبین از عارفان (العارفین) را از یادشان می‌برد، و به همین دلیل آمرزیده شدند، یعنی از آنها پوشیده شد. و پوشش بر دو نوع است: یا به طور کلی از آنها پوشیده می‌شود، یا با حسنه جایگزین می‌شود، پس صورت آن بدی با توبه نیکو می‌شود و به صورت حسنه برای او ظاهر می‌گردد، چنانکه فرمود: «يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ» (خداوند بدی‌هایشان را به نیکی‌ها تبدیل می‌کند)، یعنی زشتی آنها را به نیکی باز می‌گرداند. و از جمله هشدارهای حق (الحق)، سخن خداوند متعال است: «فَأُوْلئِكَ يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ» (پس آنان کسانی هستند که خداوند بدی‌هایشان را به نیکی‌ها تبدیل می‌کند). پس چون این را دانستند، در بازگشت به سوی خدا شتاب کردند و مسارعت نمودند.\n\nاین بود آنچه برای تو در مورد معنای حال علت (العلة) نزد این طایفه و تأثیر آن در مردان بیان کردم.\n\n«بسم الله الرحمن الرحيم» (به نام خداوند بخشنده مهربان)"
  },
  "page_count": 3
}