{
  "id": 40,
  "title": {
    "ar": "الباب الأربعون في معرفة منزل مجاور لعلم جزئي من علوم الكون وترتيبه وغرائبه وأقطابه‏",
    "en": "Chapter Forty: Concerning the Gnosis of a Station Adjacent to a Particular Science of the Cosmic Sciences, its Arrangement, its Marvels, and its Poles (أقطابه).",
    "ur": "چالیسواں باب: کونیاتی علوم (علوم الكون) میں سے ایک جزوی علم کی پڑوسی منزل کی معرفت میں، اور اس کی ترتیب، اس کے عجائبات، اور اس کے اقطاب۔",
    "fa": "باب چهلم در معرفت منزل همسایه‌ای برای علم جزئی از علوم کائنات و ترتیب آن و غرایب و اقطاب آن."
  },
  "content": {
    "ar": "## (الباب الأربعون) في معرفة منزل مجاور لعلم جزئي من علوم الكون وترتيبه وغرائبه وأقطابه‏\n\n\nنظم يتضمن ما ترجمنا عليه‏\n> مجاور علم الكون علم إلهي *** يقول الذي يعطاه كشف حقيقي‏\n\n\n> وما هو من علم البرازخ خالص *** وما هو علوي وما هو سفلي‏\n\n\n> له في العلى وجه غريب محقق *** وفي السفل وجه بالحقائق علوي‏\n\n\n> وليس الذي يدريه ملك مخلص *** ولا هو جني ولا هو إنسي‏\n\n\n> ولكنها الأعيان لما تألفت *** بدا لك شكل مستفاد كياني‏\n\n\n> فقل فيه ما تهواء يقبله أصله *** فلست تراه وهو للعين مرئي‏\n\n\n> فما هو محكوم وليس بحاكم *** فما هو غيبي وما هو حسي‏\n\n\n> تنزه عن حصر الجهات ضياؤه *** فلا هو شرقي ولا هو غربي‏\n\n\n> فسبحان من أخفى عن العين ذاته *** ويسرى مثال منه فينا اتصالي‏\n\n\n> نراه إذا كنا وما هو عينه *** ولكنه كشف صحيح خيالي‏\n\n\n> تجلى لرأي العين في كل صورة *** فذلك مقصودي بقولي مثالي‏\n\n\n### [خرق العوائد: المعجزات، الكرامات، السحر]\n\n\nاعلم أيدك الله بروح القدس أن هذا المنزل منزل الكمال وهو مجاور منزل الجلال والجمال هو من أجل المنازل والنازل فيه أتم نازل اعلم أن خرق العوائد على ثلاثة أقسام قسم منها يرجع إلى ما يدركه البصر أو بعض القوي على حسب ما يظهر لتلك القوة مما ارتبطت في العادة بإدراكه وهو في نفسه على غير ما أدركته تلك القوة مثل قوله تعالى يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏ وهذا القسم داخل تحت قدرة البشر وهو على قسمين منه ما يرجع إلى قوة نفسية ومنه ما يرجع إلى خواص أسماء إذا تلفظ بتلك الأسماء ظهرت تلك الصور في عين الرائي أو في سمعه خيالا وما ثم في نفس الأمر أعني في المحسوس شي‏ء من صورة مرئية ولا مسموعة وهو فعل الساحر وهو على علم أنه ما ثم شي‏ء مما وقع في الأعين والأسماع والقسم الآخر الذي هو قوة نفسية يكون عنها فيما تراه العين أو أي إدراك كان ما كان من الأمر الذي ظهر عن خواص الأسماء والفرق بينهما إن الذي يفعله بطريق الأسماء وهو الساحر يعلم أنه ما ثم شي‏ء من خارج وإنما لها سلطان على خيال الحاضرين فتخطف أبصار الناظرين فيرى صورا في خياله كما يرى النائم في نومه وما ثم في الخارج شي‏ء مما يدركه وهذا القسم الآخر الذي للقوة النفسية منهم من يعلم أنه ما ثم شي‏ء في الخارج ومنهم من لا يعلم ذلك فيعتقد إن الأمر كما رآه ذكر أبو عبد الرحمن السلمي في كتاب مقامات الأولياء في باب الكرامات منه أن عليما الأسود وكان من أكابر أهل الطريق إن بعض الصالحين اجتمع به في قصة أدته إلى أن ضرب عليم الأسود إلى أسطوانة كانت قائمة في المسجد من رخام فإذا هي كلها ذهب فنظر إليها الرجل أسطوانة ذهب فتعجب فقال له يا هذا إن الأعيان لا تنقلب ولكن هكذا تراها لحقيقتك بربك وهي غير ذلك فخرج من كلامه فيما يظهر لمن لا علم له بالأشياء ببادي الرأي أو من أول نظر أن الأسطوانة حجر كما كانت وليست ذهبا إلا في عين الرائي ثم إن الرجل أبصرها بعد ذلك حجرا كما كانت أول مرة\n\n\n### [عصا موسى وسحرة فرعون‏]\n\n\nقال تعالى في عصا موسى عليه السلام وما تِلْكَ بِيَمِينِكَ يا مُوسى‏ قالَ هِيَ عَصايَ ثم قال أَلْقِها يا مُوسى‏ فَأَلْقاها من يده في الأرض فَإِذا هِيَ حَيَّةٌ تَسْعى‏ فلما خاف موسى عليه السلام منها على مجرى العادة في النفوس أنها تخاف من الحيات إذا فاجأتها لما قرن الله بها من الضرر لبني آدم وما علم موسى مراد الله في ذلك ولو علمه ما خاف فقال الله تعالى له خُذْها ولا تَخَفْ سَنُعِيدُها سِيرَتَهَا الْأُولى‏ أي ترجع عصا كما كانت أو ترجع تراها عصا كما كانت فالآية محتملة فإن الضمير الذي في قوله عز وجل سَنُعِيدُها سِيرَتَهَا الْأُولى‏ إذا لم تكن عصا في حال كونها في نظر موسى حية لم يجد الضمير على من يعود كما إن الإنسان إذا عودك أمرا ما وهو أنه كان يحسن إليك ثم أساء إليك فتقول له قد تغيرت سيرتك معي ما أنت هو ذاك الذي كان يحسن إلي ومعلوم أنه هو فيقال له سيعود معك إلى سيرته الأولى من الإحسان إليك وهو في صورته ما تغير ولكن تغير عليك فعله معك وقدم الله هذا لموسى عليه السلام توطئة لما سبق في علمه سبحانه أن السحرة تظهر لعينه مثل هذا فيكون عنده علم من ذلك حتى لا يذهل ولا يخاف إذا وقع منهم عند إلقائهم حبالهم وعصيهم وخيل إلى موسى‏\nأنها تسعى يقول له فلا تخف إذا رأيت ذلك منهم يقوى جأشه فلما وقع من السحرة ما وقع مما ذكر الله لنا في كتابه وامتلأ الوادي من حبالهم وعصيهم ورآها موسى فيما خيل له حيات تسعى فَأَوْجَسَ في نَفْسِهِ خِيفَةً مُوسى‏ فلم يكن نسبة الخوف إليه في هذا الوقت نسبة الخوف الأول فإن الخوف الأول كان من الحية ف وَلَّى مُدْبِراً ولَمْ يُعَقِّبْ حتى أخبره الله تعالى وكان هذا الخوف الآخر الذي ظهر منه للسحرة على الحاضرين لئلا تظهر عليه السحرة بالحجة فيلتبس الأمر على الناس ولهذا قال الله له لا تَخَفْ إِنَّكَ أَنْتَ الْأَعْلى‏ ولما ظهر للسحرة خوف موسى مما رآه وما علموا متعلق هذا الخوف أي شي‏ء هو علموا أنه ليس عند موسى من علم السحر شي‏ء فإن الساحر لا يخاف مما يفعله لعلمه أنه لا حقيقة له من خارج وأنه ليس كما يظهر لا عين الناظرين فأمر الله موسى أن يلقي عصاه وأخبر أنها تَلْقَفْ ما صَنَعُوا فلما ألقى موسى عصاه فكانت حية علمت السحرة بأجمعها مما علمت من خوف موسى أنه لو كان ذلك منه وكان ساحرا ما خاف ورأوا عصاه حية حقيقة علموا عند ذلك أنه أمر غيب من الله الذي يدعوهم إلى الايمان به وما عنده من علم السحر خبر فتلقفت تلك الحية جميع ما كان في الوادي من الحبال والعصي أي تلقفت صور الحيات منها فبدت حبالا وعصيا كما هي وأخذ الله بأبصارهم عن ذلك فإن الله يقول تَلْقَفْ ما صَنَعُوا وما صنعوا الحبال ولا العصي وإنما صنعوا في أعين الناظرين صور الحيات وهي التي تلقفت عصا موسى فتنبه لما ذكرت لك فإن المفسرين ذهلوا عن هذا الإدراك في أخبار الله تعالى فإنه ما قال تلقف حبالهم وعصيهم فكانت الآية عند السحرة خوف موسى وأخذ صور الحيات من الحبال والعصي وعلموا إن الذي جاء به موسى من عند الله فآمنوا بما جاء به موسى عن آخرهم وخروا سجدا عند هذه الآية وقالُوا آمَنَّا بِرَبِّ الْعالَمِينَ رَبِّ مُوسى‏ وهارُونَ حتى يرتفع الالتباس فإنهم لو وقفوا على العالمين لقال فرعون أنا رب العالمين إياي عنوا فزادوا رب موسى وهارون أي الذي يدعو إليه موسى وهارون فارتفع الإشكال فتوعدهم فرعون بالعذاب فآثروا عذاب الدنيا على عذاب الآخرة وكان من كلامهم ما قص الله علينا وأما العامة فنسبوا ما جاء به موسى إلى أنه من قبيل ما جاءت به السحرة إلا أنه أقوى منهم وأعلم بالسحر بالتلقف الذي ظهر من حية عصا موسى عليه السلام فقالوا هذا سحر عظيم ولم تكن آية موسى عند السحرة إلا خوفه وأخذ صور الحيات من الحبال والعصي خاصة فمثل هذا خارج عن قوة النفس وعن خواص الأسماء لوجود الخوف الذي ظهر من موسى في أول مرة فكان الفعل من الله ولما واقع السحرة اللبس على أعين الناظرين بتصيير الحبال والعصي حيات في نظرهم أراد الحق أن يأتيهم من بابهم الذي يعرفونه كما قال تعالى ولَلَبَسْنا عَلَيْهِمْ ما يَلْبِسُونَ فإن الله يراعي في الأمور المناسبات فجعل العصا حية كحيات عصيهم في عموم الناس ولبس على السحرة بما أظهر من خوف موسى فتخيلوا أنه خاف من الحيات وكان موسى في نفس الأمر غير خائف من الحيات لما تقدم له في ذلك من الله في الفعل الأول حين قال له خُذْها ولا تَخَفْ فنهاه عن الخوف منها وأعلمه أن ذلك آية له فكان خوفه الثاني على الناس لئلا يلتبس عليهم الدليل والشبهة والسحرة تظن أنه خاف من الحيات فلبس الله عليهم خوفه كما لبسوا على الناس وهذا غاية الاستقصاء الإلهي في المناسبات في هذا الموطن لأن السحرة لو علمت إن خوف موسى من الغلبة بالحجة لما سارعت إلى الايمان ثم إنه كان لحية موسى التلقف ولم يكن لحياتهم تلقف ولا أثر لأنها حبال وعصى في نفس الأمر\n\n\n### [المعجزات وانقلاب الأعيان‏]\n\n\nفهذا المنزل الذي ذكرناه في هذا الباب أنه مجاور لعلم جزئي من علوم الكون هو هذا العلم الجزئي علم المعجزات لأنه ليس عن قوة نفسية ولا عن خواص أسماء فإن موسى عليه السلام لو كان انفعال العصا حية عن قوة وهمية أو عن أسماء أعطيها ما ولى مدبرا ولم يعقب خوفا فعلمنا أن ثم أمورا تختص بجانب الحق في علمه لا يعرفها من ظهرت على يده تلك الصورة فهذا المنزل مجاور لما جاءت به الأنبياء من كونه ليس عن حيلة ولم يكن مثل معجزات الأنبياء عليهم السلام لأن الأنبياء لا علم لهم بذلك وهؤلاء ظهر ذلك عنهم بهمتهم أو قوة نفسهم أو صدقهم قل كيف شئت فلهذا اختصت باسم الكرامات ولم تسم معجزات ولا سميت سحرا فإن المعجزة ما يعجز الخلق عن الإتيان بمثلها إما صرفا وإما أن تكون ليست من مقدورات البشر العدم قوة النفس وخواص الأسماء وتظهر على أيديهم وإن السحر هو الذي يظهر فيه وجه إلى الحق وهو في نفس الأمر ليس حقا مشتق من السحر الزماني‏\nوهو اختلاط الضوء والظلمة فما هو بليل لما خالطه من ضوء الصبح وهو ليس بنهار لعدم طلوع الشمس للابصار فكذلك هذا الذي يسمى سحرا ما هو باطل محقق فيكون عدما فإن العين أدركت أمرا ما لا تشك فيه وما هو حق محض فيكون له وجود في عينه فإنه ليس في نفسه كما تشهده العين ويظنه الرائي وكرامات الأولياء ليست من قبيل السحر فإن لها حقيقة في نفسها وجودية وليست بمعجزة فإنه على علم وعن قوة همة وأما قول عليم لحقيقتك بربك تراها ذهبا فإن الأعيان لا تنقلب وذلك لما رآه قد عظم ذلك الأمر عند ما رآه فقال له العلم بك أشرف مما رأيت فاتصف بالعلم فإنه أعظم من كون الأسطوانة كانت ذهبا في نفس الأمر فأعلمه إن الأعيان لا تنقلب وهو صحيح في نفس الأمر أي أن الحجرية لم ترجع ذهبا فإن حقيقة الحجرية قبلها هذا الجوهر كما قبل الجسم الحرارة فقيل فيه إنه حار فإذا أراد الله أن يكسو هذا الجوهر صورة الذهب خلع عنه صورة الحجر وكساه صورة الذهب فظهر الجوهر أو الجسم الذي كان حجرا ذهبا كما خلع عن الجسم الحار الحرارة وكساه البرد فصار باردا فما انقلبت عين الحرارة برودة والجسم البارد بعينه هو الذي كان حارا فما انقلبت الأعيان كذلك حكاية عليم الجوهر الذي قبل صورة الذهب عند الضرب هو الذي كان قد قبل صورة الحجر والجوهر هو الجوهر بعينه فالحجر ما عاد ذهبا ولا الذهب عاد حجرا كما إن الجوهر الهيولاني قبل صورة الماء فقيل هو ماء بلا شك فإذا جعلته في القدر وأغليتها على النار إلى أن يصعد بخارا فتعلم قطعا إن صورة الماء زالت عنه وقبل صورة البخار فصار يطلب الصعود لعنصره الأعظم كما كان إذ قامت به صورة الماء يطلب عنصره الأعظم فيأخذ سفلا فهذا معنى قول عليم في هذا المنزل المختص بالأولياء والهمة المجاورة لعلم المعجزة أن الأعيان لا تنقلب وقوله لحقيقتك بربك أي إذا اطلعت إلى حقيقتك وجدت نفسك عبدا محضا عاجزا ميتا ضعيفا عدما لا وجود لك كمثل هذا الجوهر ما لم يلبس الصور لم يظهر له عين في الوجود فهذا العبد يلبس صور الأسماء الإلهية فتظهر بها عينه فأول اسم يلبسه الوجود فيظهر موجودا لنفسه حتى يقبل جميع ما يمكن أن يقبله الموجود من حيث ما هو موجود فيقبل جميع ما يخلع عليه الحق من الأسماء الإلهية فيتصف عند ذلك بالحي والقادر والعليم والمريد والسميع والبصير والمتكلم والشكور والرحيم والخالق والمصور وجميع الأسماء كما اتصف هذا الجسم بالحجر والذهب والفضة والنحاس والماء والهواء ولم تزل حقيقة الجسمية عن كل واحد مع وجود هذه الصفات كذلك لا يزول عن الإنسان حقيقة كونه عبدا إنسانا مع وجود هذه الأسماء الإلهية فيه فهذا معنى قوله لحقيقتك بربك أي لارتباط حقيقتك بربك فلا تخلو عن صورة إلهية تظهر فيها كذلك هذا الجسم لا يخلو عن صورة يظهر فيها وكما تتنوع أنت بصور الأسماء الإلهية فينطلق عليك بحسب كل صورة اسم غير الاسم الآخر كذلك ينطلق على هذا الجوهر اسم الحجرية والذهبية للوصف لا لعينه فقد تبينت فيما ذكرناه الثلاثة الأقسام في خرق العوائد وهي المعجزات والكرامات والسحر وما ثم خرق عادة أكثر من هذا ولست أعني بالكرامات إلا ما ظهر عن قوة الهمة لا إني أريد بهذا الاصطلاح في هذا الموضع التقريب الإلهي لهذا الشخص فإنه قد يكون ذلك استدراجا ومكرا وإنما أطلقت عليه اسم الكرامة لأنه الغالب والمكر فيه قليل جدا فهذا المنزل مجاور آيات الأنبياء عليهم السلام وهو العلم الجزئي من علوم الكون لا يجاور السحر فإن كرامة الولي وخرق العادة له إنما كانت باتباع الرسول والجري على سنته فكأنها من آيات ذلك النبي إذ باتباعه ظهرت للمتحقق بالاتباع فلهذا جاورته فأقطاب هذا المنزل كل ولي ظهر عليه خرق عادة عن غير همته فيكون إلى النبوة أقرب ممن ظهر عنه خرق العادة بهمته والأنبياء هم العبيد على أصلهم فكذلك أقطاب هذا المنزل فكلما قربت أحوالك من أحوال الأنبياء عليهم السلام كنت في العبودة أمكن وكانت لك الحجة ولم يكن للشيطان عليك سلطان كما قال تعالى إِنَّ عِبادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ وقال يَسْلُكُ من بَيْنِ يَدَيْهِ ومن خَلْفِهِ رَصَداً فلا أثر للشيطان فيهم فكذلك من قرب منهم ولما عاينت هذا المشهد قلت‏\n\n\nالقصيدة التي أولها\n\n\n> تنزلت الأملاك ليلا على قلبي *** ودارت عليه مثل دائرة القلب‏\n\n\n> حذرا من إلقاء اللعين إذا يرى *** نزول علوم الغيب عينا على القلب‏\n> وذلك حفظ الله في مثل طورنا *** وعصمته في المرسلين بلا ريب‏\n\n\nالقصيدة بكمالها وهي مذكورة في أول الباب الثلاثين وثلاثمائة من هذا الكتاب‏\n\n\n### [تروحن الأجساد وتجسد الأرواح‏]\n\n\nوترتيب هذا الباب هو ما ذكرناه من مراتب خرق العوائد وأما ما فيه من الغرائب فإلحاق البشر بالروحانيين في التمثل وإلحاق الروحانيين بالبشر في الصورة وظهور صورة عنهم شبيه الصورة التي يتمثلون بها قال تعالى فَتَمَثَّلَ لَها بَشَراً سَوِيًّا يسمى روحا مثل ما هو جبريل روح فيحيي الموتى كما يحيي جبريل قال ابن عباس ما وطئ جبريل عليه السلام قط موضعا من الأرض إلا حيي ذلك الموضع ولهذا أخذ السامري قبضة من أثره حين عرفه لما جاء لموسى وقد علم إن وطأته يحيا بها ما وطئه من الأشياء فقبض قبضة من أثر الرسول فرمى بها في العجل الذي صنعه فحيي ذلك العجل وكان ذلك إلقاء من الشيطان في نفس السامري لأن الشيطان يعلم منزلة الأرواح فوجد السامري في نفسه هذه القوة وما علم بأنها من إلقاء إبليس فقال وكَذلِكَ سَوَّلَتْ لِي نَفْسِي وفعل ذلك إبليس من حرصه على إضلاله بما يعتقده من الشريك لله تعالى فخرج عيسى على صورة جبريل في المعنى والاسم والصورة الممثلة فالتحقق البشر بالروحاني والتحق الروحاني بصورة البشر في نازلة واحدة ويكفي هذا القدر من هذا الباب فإنه باب واسع لمريم وآسية لحقائق الرسل عليهم السلام فيه مجال رحب فإنه منزل الكمال من حصله ساد على أبناء جنسه وظهر حاكما على صاحب الجلال والجمال وهو من مقامات أبي يزيد البسطامي والأفراد والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الحادي والعشرون‏\n\n",
    "en": "Chapter Forty: Concerning the knowledge of a station (منزل) adjacent to a partial science (علم جزئي) of the cosmic sciences (علوم الكون), its arrangement, its wonders, and its spiritual poles (أقطابه).\n\nA poem containing what we have titled:\n> Adjacent to the cosmic science is a Divine science (علم إلهي) / He who is granted it speaks of true unveiling (كشف حقيقي).\n\n> It is not purely from the science of the Isthmuses (علم البرازخ) / Nor is it celestial (علوي) nor is it terrestrial (سفلي).\n\n> It has a strange, verified aspect in the high realms / And in the low realms, an aspect that is celestial by virtue of the Realities (الحقائق).\n\n> He who perceives it is neither a devoted angel (ملك مخلص) / Nor is he a jinn nor is he a human.\n\n> But when the Fixed Entities (الأعيان) are compounded / A form derived from Being (كياني) appears to you.\n\n> Say concerning it whatever you wish, its origin accepts it / You do not see it, yet it is visible to the eye.\n\n> It is not governed, nor is it a governor / It is neither unseen (غيبي) nor is it sensible (حسي).\n\n> Its light is exalted beyond the confinement of directions / So it is neither Eastern nor is it Western.\n\n> Glory be to Him who concealed His Essence (ذاته) from the eye / Yet a connecting image (مثال) of Him flows within us.\n\n> We see it when we exist, yet it is not its very essence / But it is a true unveiling (كشف صحيح) of the Imagination (خيالي).\n\n> It manifests (تجلى) to the sight of the eye in every form / That is what I mean by my saying, \"imaginal\" (مثالي).\n\n### [The Breaking of Habits: Miracles, Charismata, Magic]\n\nKnow, may Allah support you with the Holy Spirit (روح القدس), that this station is the station of Perfection (منزل الكمال). It is adjacent to the station of Majesty (الجلال) and Beauty (الجمال). It is one of the most glorious stations, and he who descends into it is the most complete descender.\n\nKnow that the breaking of habits (خرق العوائد) is of three types. One type relates to what the sight or some other faculty perceives, according to what appears to that faculty, which is habitually linked to its perception, yet the thing itself is not as that faculty perceived it. An example is His saying, the Exalted: <<يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏>> (It seemed to him, by their magic, that they were moving swiftly).\n\nThis type falls under the capacity of humankind and is of two sub-types: one that relates to psychic power (قوة نفسية), and one that relates to the properties (خواص) of Names (أسماء). If those Names are uttered, those forms appear in the eye or ear of the beholder as imagination (خيالا), while in reality—meaning in the sensible world—there is nothing of a visible or audible form. This is the act of the sorcerer, who knows that nothing of what appeared to the eyes and ears is actually there.\n\nThe other sub-type, which is psychic power, produces in what the eye sees, or whatever perception it may be, the same effect that arises from the properties of the Names. The difference between them is that the one who acts through the Names—the sorcerer—knows that nothing external exists; rather, the Names have authority over the imagination (خيال) of those present, snatching the sight of the beholders, who then see forms in their imagination, just as a sleeper sees in his sleep, while nothing of what they perceive exists externally.\n\nAs for the other sub-type, which belongs to psychic power, some of those who possess it know that nothing external exists, while others do not know this and believe that the matter is as they saw it. Abu Abd al-Rahman al-Sulami mentioned in his book *Maqamat al-Awliya* (Stations of the Saints), in the chapter on Charismata (الكرامات), that Alim al-Aswad, who was one of the great people of the Path, met with a righteous man in a story that led Alim al-Aswad to strike a marble pillar standing in the mosque, whereupon it turned entirely into gold. The man looked at it and saw a pillar of gold and was astonished. Alim said to him: \"O man, the essences (الأعيان) do not transform, but you see it thus due to your reality (حقيقتك) through your Lord, and it is otherwise.\"\n\nWhat appeared from his speech, to one who lacks knowledge of things at first glance or initial consideration, was that the pillar remained stone as it was, and was not gold except in the eye of the beholder. Then, the man saw it afterwards as stone, just as it was the first time.\n\n### [The Staff of Moses and the Sorcerers of Pharaoh]\n\nAllah, the Exalted, said concerning the staff of Moses (peace be upon him): <<وَمَا تِلْكَ بِيَمِينِكَ يَا مُوسَىٰ * قَالَ هِيَ عَصَايَ>> (And what is that in your right hand, O Moses? He said, \"It is my staff.\") Then He said: <<أَلْقِهَا يَا مُوسَىٰ>> (Cast it down, O Moses). So he cast it from his hand onto the ground, <<فَإِذَا هِيَ حَيَّةٌ تَسْعَىٰ>> (and behold, it was a serpent moving swiftly).\n\nWhen Moses (peace be upon him) feared it, according to the usual course of souls that fear snakes when suddenly confronted, due to the harm Allah has associated with them for the children of Adam—and Moses did not know Allah’s intent in that, for had he known, he would not have feared—Allah the Exalted said to him: <<خُذْهَا وَلَا تَخَفْ سَنُعِيدُهَا سِيرَتَهَا الْأُولَىٰ>> (Take it and fear not; We will restore it to its former state). That is, it will return to being a staff as it was, or you will return to seeing it as a staff as it was. The verse is open to interpretation. If the pronoun in His saying, the Mighty and Majestic, <<سَنُعِيدُهَا سِيرَتَهَا الْأُولَىٰ>> (We will restore it to its former state) did not refer to the staff in the state where Moses saw it as a serpent, the pronoun would have no referent.\n\nIt is like when a person has accustomed you to a certain manner—say, he used to treat you kindly, then he treated you badly—and you say to him, \"Your manner with me has changed; you are not the one who used to treat me kindly.\" It is known that he is the same person. So it is said to him, \"He will return to his former manner of kindness toward you.\" He has not changed in his form, but his action toward you has changed.\n\nAllah presented this to Moses (peace be upon him) as a preparation for what preceded in His knowledge (سبحانه) that the sorcerers would display something similar before his eyes. Thus, he would have knowledge of it so that he would not be bewildered or afraid when it occurred from them upon casting their ropes and staffs, and it was imagined (خيل) to Moses that they were moving swiftly. He is telling him, \"Do not fear when you see that from them,\" strengthening his resolve.\n\nWhen the sorcerers performed what they did, which Allah mentioned to us in His Book, and the valley was filled with their ropes and staffs, and Moses saw them, in what was imagined to him, as swiftly moving serpents, <<فَأَوْجَسَ فِي نَفْسِهِ خِيفَةً مُّوسَىٰ>> (Moses felt a fear within himself). The attribution of fear to him at this time was not the same as the attribution of the first fear. The first fear was of the serpent, so he <<وَلَّى مُدْبِرًا وَلَمْ يُعَقِّبْ>> (turned his back and fled, and did not look back) until Allah informed him.\n\nThis latter fear that appeared from him before the sorcerers was for the sake of those present, lest the sorcerers prevail over him with their argument, causing confusion among the people. For this reason, Allah said to him: <<لَا تَخَفْ إِنَّكَ أَنتَ الْأَعْلَىٰ>> (Fear not; indeed, you are the superior).\n\nWhen the sorcerers perceived Moses' fear of what he saw, and they did not know the object of this fear, they knew that Moses possessed no knowledge of magic (سحر). For a sorcerer does not fear what he himself performs, knowing that it has no external reality and is not as it appears to the eyes of the beholders.\n\nThen Allah commanded Moses to cast his staff and informed him that it would <<تَلْقَفْ مَا صَنَعُوا>> (swallow what they fabricated). When Moses cast his staff and it became a real serpent, the sorcerers collectively understood, based on their knowledge of Moses' fear, that if the act had been his and he had been a sorcerer, he would not have feared. Seeing his staff as a true serpent, they knew immediately that this was an unseen matter (أمر غيب) from Allah, the One Who calls them to faith, and that Moses had no knowledge of magic.\n\nSo, that serpent swallowed all that was in the valley of ropes and staffs—meaning, it swallowed the *images* of the serpents from them, whereupon they reappeared as ropes and staffs as they were. Allah veiled their eyes from this, for Allah says: <<تَلْقَفْ مَا صَنَعُوا>> (It will swallow what they fabricated). They did not fabricate the ropes or the staffs; rather, they fabricated the *images* of the serpents in the eyes of the beholders, and it was these images that the staff of Moses swallowed.\n\nPay attention to what I have mentioned to you, for the commentators have overlooked this understanding in Allah’s reports. He did not say, \"It will swallow their ropes and staffs.\" Thus, the sign (آية) for the sorcerers was Moses' fear and the removal of the images of the serpents from the ropes and staffs specifically. They knew that what Moses brought was from Allah, so they believed in what Moses brought, every last one of them, and fell down in prostration upon witnessing this sign, saying: <<قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ * رَبِّ مُوسَىٰ وَهَارُونَ>> (They said, \"We believe in the Lord of the worlds, the Lord of Moses and Aaron\"), so that the confusion would be lifted. Had they stopped at \"Lord of the worlds,\" Pharaoh would have said, \"I am the Lord of the worlds; they mean me.\" So they added, \"the Lord of Moses and Aaron,\" meaning the One to Whom Moses and Aaron call, and the ambiguity was removed. Pharaoh then threatened them with torment, but they preferred the torment of this world over the torment of the Hereafter, and their words were as Allah recounted to us.\n\nAs for the common people, they attributed what Moses brought to the same category as what the sorcerers brought, except that he was stronger than them and more knowledgeable in magic, due to the swallowing that appeared from the serpent of Moses' staff (peace be upon him). They said, \"This is great magic.\"\n\nHowever, the sign of Moses for the sorcerers was only his fear and the removal of the images of the serpents from the ropes and staffs. Such an act is outside the scope of psychic power (قوة النفس) and the properties of the Names (خواص الأسماء), due to the existence of the fear that appeared from Moses the first time. Thus, the action was from Allah.\n\nWhen the sorcerers caused confusion in the eyes of the beholders by making the ropes and staffs appear as serpents in their sight, the Real (الحق) desired to approach them through the door they knew, as He, the Exalted, said: <<وَلَلَبَسْنَا عَلَيْهِم مَّا يَلْبِسُونَ>> (And We would certainly have confused for them what they confuse). Allah observes appropriateness in matters. So He made the staff a serpent, like the serpents of their staffs, for the general populace, but He confused the sorcerers by manifesting Moses' fear. They imagined that he feared the serpents, while Moses, in reality, was not afraid of the serpents, due to what had previously occurred to him from Allah in the first act when He said to him: <<خُذْهَا وَلَا تَخَفْ>> (Take it and fear not), forbidding him from fearing it and informing him that it was a sign for him. His second fear was for the people, lest the proof and the ambiguity be confused for them. The sorcerers thought he feared the serpents, so Allah confused them with his fear, just as they confused the people. This is the ultimate Divine thoroughness in observing appropriateness in this situation. Had the sorcerers known that Moses' fear was of being overcome by argument, they would not have hastened to believe.\n\nFurthermore, the serpent of Moses had the power of swallowing, while their serpents had no power of swallowing or effect, because they were ropes and staffs in reality.\n\n### [Miracles and the Transformation of Essences]\n\nThis station (منزل) that we mentioned in this chapter, that it is adjacent to a partial science (علم جزئي) of the cosmic sciences, is this partial science: the science of Miracles (علم المعجزات). This is because it does not arise from psychic power (قوة نفسية) nor from the properties of Names (خواص أسماء). If the transformation of the staff into a serpent had been due to imaginative power (قوة وهمية) or Names granted to him, Moses (peace be upon him) would not have turned his back and fled in fear.\n\nThus, we know that there are matters specific to the side of the Real (جانب الحق) in His Knowledge, which are unknown to the one through whom that form appears. This station is adjacent to what the Prophets brought, in that it is not based on artifice.\n\nHowever, it is not like the miracles of the Prophets (peace be upon them), because the Prophets have no knowledge of that [Divine action], whereas these people [the saints] manifest it through their spiritual resolve (همتهم) or their psychic power (قوة نفسهم) or their sincerity—say what you will. For this reason, it is specifically called Charismata (الكرامات) and is not called Miracles (معجزات) nor is it called Magic (سحرا).\n\nA Miracle (المعجزة) is that which creation is incapable of producing the like of, either by being a sheer Divine act (صرفا) or by being outside the scope of human capacity due to the absence of psychic power and the properties of Names, yet it appears through their hands.\n\nMagic (السحر) is that which presents an aspect of the Real (الحق) but is not real in itself. It is derived from the temporal *sihr* (twilight), which is the mixing of light and darkness. It is not night because it is mixed with the light of dawn, and it is not day because the sun has not yet risen to sight. Likewise, this phenomenon called magic is not absolute falsehood, such that it would be non-existence, for the eye perceives something about which it has no doubt. Yet it is not pure reality (حق محض) such that it would have existence in its essence, for it is not in itself as the eye witnesses it and the beholder imagines.\n\nThe Charismata of the saints (كرامات الأولياء) are not of the category of magic, for they have an existential reality (حقيقة وجودية) in themselves. Yet they are not a miracle (معجزة), for they arise from knowledge and the power of spiritual resolve (همة).\n\nAs for Alim’s saying, \"due to your reality (حقيقتك) through your Lord, you see it as gold, for the essences (الأعيان) do not transform,\" this was because he saw the man greatly magnifying the matter when he saw it. So he told him, \"The knowledge you possess is more honorable than what you saw. Be characterized by knowledge, for it is greater than the pillar being gold in reality.\"\n\nHe informed him that the essences do not transform, which is true in reality. That is, the reality of stoniness (الحجرية) did not turn into gold. The reality of stoniness accepts this substance (الجوهر), just as the body accepts heat, so it is called hot. If Allah wills to clothe this substance with the form of gold, He strips it of the form of stone and clothes it with the form of gold. Thus, the substance or body that was stone appears as gold, just as He strips the hot body of heat and clothes it with cold, so it becomes cold. The essence of heat did not transform into coldness, and the cold body is the very same body that was hot. Thus, the essences have not transformed.\n\nLikewise, in the account of Alim, the substance (الجوهر) that accepted the form of gold upon being struck is the same substance that had accepted the form of stone, and the substance is the substance itself. The stone did not become gold, nor did the gold become stone.\n\nIt is like the hylic substance (الجوهر الهيولاني) accepting the form of water, so it is called water without doubt. If you place it in a pot and boil it over fire until it rises as vapor, you know with certainty that the form of water has departed from it, and it has accepted the form of vapor, so it seeks to ascend to its greater element, just as when the form of water subsisted in it, it sought its greater element and descended.\n\nThis is the meaning of Alim’s statement in this station, which is specific to the saints and spiritual resolve (الهمة) adjacent to the science of Miracles: that the essences do not transform.\n\nAnd his saying, \"due to your reality (حقيقتك) through your Lord,\" means: if you look into your reality, you find yourself a pure servant (عبدا محضا), incapable, mortal, weak, non-existent, having no existence unless clothed in forms, just like this substance (الجوهر). This servant is clothed in the forms of the Divine Names (الأسماء الإلهية), and his essence (عينه) appears through them. The first Name he is clothed in is Existence (الوجود), so he appears as existent for himself, so that he may accept all that the existent can accept, insofar as he is existent. Thus, he accepts all the Divine Names that the Real (الحق) bestows upon him, and he is then characterized by the Living, the Powerful, the Knowing, the Willing, the Hearing, the Seeing, the Speaking, the Thankful, the Merciful, the Creator, the Fashioner, and all the Names. Just as this body is characterized by stone, gold, silver, copper, water, and air, yet the reality of corporeality (حقيقة الجسمية) does not depart from any of them despite the existence of these attributes, likewise, the reality of being a servant (عبدا إنسانا) does not depart from the human, despite the existence of these Divine Names within him.\n\nThis is the meaning of his saying, \"due to your reality through your Lord,\" meaning due to the connection of your reality to your Lord, you are never devoid of a Divine form in which you manifest. Likewise, this body is never devoid of a form in which it manifests. And just as you are diversified by the forms of the Divine Names, so that a different Name is applied to you according to each form, likewise, the name of stoniness and goldness is applied to this substance (الجوهر) due to the description, not due to its essence.\n\nThus, the three categories in the breaking of habits have become clear in what we have mentioned: Miracles, Charismata, and Magic. There is no breaking of habit beyond these. I do not mean by Charismata (الكرامات) only what appears through the power of spiritual resolve (قوة الهمة), nor do I mean by this technical term (الاصطلاح) in this context the Divine drawing near (التقريب الإلهي) to this person, for that may sometimes be a gradual enticement (استدراجا) and a trick (مكرا). I only applied the name Charisma because it is the dominant case, and trickery in it is very rare.\n\nThis station is adjacent to the signs (آيات) of the Prophets (peace be upon them). It is the partial science (العلم الجزئي) of the cosmic sciences. It is not adjacent to magic, for the charisma of the saint and his breaking of habit only occur through following the Messenger and adhering to his tradition (سنته). It is as if it is one of the signs of that Prophet, since it appeared for the one who realized the following. For this reason, it is adjacent to it.\n\nThe poles (أقطاب) of this station are every saint through whom a breaking of habit appeared without his own spiritual resolve (همته). Such a person is closer to Prophethood than one through whom the breaking of habit appeared through his resolve. The Prophets are servants (العبيد) according to their origin, and likewise are the poles of this station. The closer your states are to the states of the Prophets (peace be upon them), the more established you are in servitude (العبودة), and the proof is yours, and Satan has no authority over you, as the Exalted said: <<إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ>> (Indeed, over My servants there is no authority for you). And He said: <<يَسْلُكُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا>> (He places before him and behind him observers). Thus, Satan has no effect on them, and likewise on those who are close to them.\n\nWhen I witnessed this vision, I said the poem that begins:\n\n> The angels descended upon my heart at night / And circled around it like the circle of the heart.\n\n> Guarding against the casting of the accursed one when he sees / The descent of the sciences of the Unseen (علوم الغيب) directly upon the heart.\n\n> That is the preservation of Allah in a stage like ours / And His protection in the Messengers without doubt.\n\nThe complete poem is mentioned at the beginning of Chapter Three Hundred and Thirty of this book.\n\n### [The Spiritualization of Bodies and the Embodiment of Spirits]\n\nThe arrangement (ترتيب) of this chapter is what we mentioned concerning the levels (مراتب) of the breaking of habits. As for the wonders (الغرائب) within it, they include the joining of humans to the spiritual beings (الروحانيين) in representation (التمثل), and the joining of the spiritual beings to humans in form, and the appearance of a form from them resembling the form in which they are represented.\n\nAllah, the Exalted, said: <<فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا>> (He appeared to her as a man in all respects). He is called a spirit (روح), just as Gabriel is a spirit. He gives life to the dead, just as Gabriel gives life. Ibn Abbas said: \"Gabriel (peace be upon him) never trod upon a place on earth except that place came to life.\" For this reason, the Samiri took a handful of dust from his footprint when he recognized him when he came to Moses, knowing that wherever his foot trod, life entered the things he stepped upon. So he took a handful of dust from the Messenger's footprint and threw it into the calf he had fashioned, and that calf came to life.\n\nThis was an inspiration (إلقاء) from Satan into the soul of the Samiri, because Satan knows the rank of the spirits (الأرواح). He found this power within the Samiri, who did not know that it was an inspiration from Iblis, so he said: <<وَكَذَٰلِكَ سَوَّلَتْ لِي نَفْسِي>> (And thus did my soul entice me). Iblis did this out of his eagerness to mislead him through what he believed concerning partnership with Allah, the Exalted.\n\nThus, Jesus (peace be upon him) emerged in the form of Gabriel in meaning, name, and the represented form. The human was joined to the spiritual, and the spiritual was joined to the form of the human in a single event.\n\nThis much suffices for this chapter, for it is a vast chapter. For Mary and Asiya, and for the realities of the Messengers (peace be upon them), there is a wide scope in it. It is the station of Perfection (منزل الكمال). Whoever attains it reigns over the children of his kind and appears as a ruler over the possessor of Majesty (الجلال) and Beauty (الجمال). It is one of the stations of Abu Yazid al-Bistami and the Solitaries (الأفراد).\n\nAnd Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).\n\nEnd of the Twenty-First Part.",
    "ur": "(چالیسواں باب) کائنات کے علوم میں سے ایک جزوی علم کے پڑوسی مقام کی معرفت میں، اور اس کی ترتیب، اس کے عجائبات اور اس کے اقطاب کے بیان میں۔\n\nنظم جو اس مضمون پر مشتمل ہے جس کا ہم نے ترجمہ کیا ہے:\n> علمِ کائنات کا پڑوسی ایک علمِ الٰہی ہے\n> جسے یہ عطا ہوتا ہے وہ حقیقی کشف (كشف حقيقي) سے بات کرتا ہے۔\n\n> اور نہ ہی یہ خالصتاً علمِ برزخ (علم البرازخ) ہے\n> اور نہ ہی یہ علوی ہے اور نہ ہی سفلی۔\n\n> اس کا علوی جہت میں ایک عجیب و محقق چہرہ ہے\n> اور سفلی جہت میں حقائق کے اعتبار سے علوی چہرہ ہے۔\n\n> اور نہ ہی اسے کوئی مخلص فرشتہ (ملك مخلص) جانتا ہے\n> اور نہ ہی وہ جن ہے اور نہ ہی انسان۔\n\n> لیکن جب اعیان (الأعيان) باہم ملتے ہیں\n> تو تمہارے لیے ایک مستفاد کیانی شکل ظاہر ہوتی ہے۔\n\n> پس تم اس کے بارے میں جو چاہو کہو، اس کی اصل اسے قبول کرتی ہے\n> تم اسے نہیں دیکھتے حالانکہ وہ آنکھ کے لیے مرئی ہے۔\n\n> پس نہ وہ محکوم ہے اور نہ ہی حاکم\n> نہ وہ غیبی ہے اور نہ ہی حسی۔\n\n> اس کی روشنی جہات کی قید سے پاک ہے\n> پس نہ وہ مشرقی ہے اور نہ ہی مغربی۔\n\n> پاک ہے وہ ذات جس نے اپنی حقیقت کو آنکھ سے چھپا دیا\n> اور اس کا ایک مثال ہم میں متصل طور پر جاری ہے۔\n\n> ہم اسے دیکھتے ہیں جب ہم موجود ہوتے ہیں، حالانکہ وہ اس کی عین ذات نہیں ہے\n> لیکن یہ ایک صحیح خیالی کشف (كشف صحيح خيالي) ہے۔\n\n> وہ آنکھ کے سامنے ہر صورت میں ظہور الٰہی (تجلی) کرتا ہے\n> پس یہی میری مراد ہے جب میں مثالی کہتا ہوں۔\n\n### [خلاف معمول امور: معجزات، کرامات، جادو]\n\nجان لو، اللہ تمہیں روح القدس کے ذریعے تائید بخشے، کہ یہ مقام (المنزل) کمال کا مقام ہے، اور یہ جلال و جمال کے مقام کا پڑوسی ہے۔ یہ عظیم ترین مقامات میں سے ہے اور اس میں اترنے والا کامل ترین نازل ہے۔ جان لو کہ خلاف معمول امور (خرق العوائد) تین قسموں پر ہیں:\n\nایک قسم وہ ہے جو بصارت یا بعض قوتوں کے ادراک میں آتی ہے، اس قوت کے لیے جو کچھ ظاہر ہوتا ہے اس کے مطابق جس کے ادراک سے وہ عادتاً وابستہ ہوتی ہے، حالانکہ وہ بذات خود اس سے مختلف ہوتا ہے جو اس قوت نے ادراک کیا۔ جیسے اللہ تعالیٰ کا فرمان ہے: يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏ (ان کے جادو کے زور سے موسیٰ کو خیال ہوا کہ وہ رسیاں دوڑ رہی ہیں)۔\n\nیہ قسم انسان کی قدرت کے تحت داخل ہے اور اس کی دو قسمیں ہیں: ایک وہ جو نفسانی قوت (قوة نفسية) سے متعلق ہے، اور دوسری وہ جو اسماء کی خواص سے متعلق ہے، جب ان اسماء کا تلفظ کیا جاتا ہے تو وہ صورتیں دیکھنے والے کی آنکھ یا اس کے کان میں خیالی طور پر ظاہر ہوتی ہیں، حالانکہ نفس الامر میں، یعنی محسوسات میں، کوئی مرئی یا مسموع صورت موجود نہیں ہوتی۔ یہ ساحر کا فعل ہوتا ہے اور وہ جانتا ہے کہ آنکھوں اور کانوں میں جو کچھ واقع ہوا ہے وہ حقیقت میں موجود نہیں ہے۔\n\nاور دوسری قسم جو نفسانی قوت (قوة نفسية) سے متعلق ہے، اس کے ذریعے آنکھ جو کچھ دیکھتی ہے یا جو بھی ادراک ہوتا ہے، وہ وہی ہوتا ہے جو اسماء کے خواص سے ظاہر ہوا تھا۔ ان دونوں میں فرق یہ ہے کہ جو شخص اسماء کے ذریعے یہ فعل کرتا ہے، یعنی ساحر، وہ جانتا ہے کہ باہر کوئی چیز موجود نہیں ہے، بلکہ اس کا تسلط حاضرین کے خیال پر ہوتا ہے، پس وہ دیکھنے والوں کی نگاہوں کو اچک لیتا ہے، اور وہ اپنے خیال میں صورتیں دیکھتے ہیں، جیسے سونے والا اپنے خواب میں دیکھتا ہے، حالانکہ باہر کوئی چیز موجود نہیں ہوتی جسے وہ ادراک کر رہے ہوں۔ اور یہ دوسری قسم جو نفسانی قوت کی ہے، ان میں سے بعض جانتے ہیں کہ باہر کوئی چیز موجود نہیں ہے، اور بعض یہ نہیں جانتے، پس وہ اعتقاد کر لیتے ہیں کہ معاملہ ویسا ہی ہے جیسا انہوں نے دیکھا۔\n\nابو عبدالرحمن السلمی نے اپنی کتاب *مقامات الاولیاء* میں بابِ کرامات کے تحت ذکر کیا ہے کہ علیم الاسود جو کہ اکابر اہل طریق میں سے تھے، ان سے بعض صالحین کی ملاقات ہوئی، ایک قصے کے دوران علیم الاسود نے مسجد میں کھڑے ایک سنگ مرمر کے ستون کو مارا، تو وہ سارا سونا بن گیا۔ اس شخص نے اسے سونے کا ستون دیکھا اور حیران ہوا، تو علیم الاسود نے اس سے کہا: \"اے شخص! اعیان (الأعيان) تبدیل نہیں ہوتے، لیکن تم اسے اپنے رب کی حقیقت (لحقيقتك بربك) کی وجہ سے ایسا دیکھ رہے ہو، حالانکہ وہ اس کے علاوہ ہے۔\" ان کی بات سے بادی النظر میں یا پہلی نظر میں، جس شخص کو اشیاء کا علم نہیں ہے، یہ ظاہر ہوتا ہے کہ ستون پتھر ہی ہے جیسا کہ پہلے تھا، اور وہ سونا نہیں بنا، سوائے دیکھنے والے کی آنکھ کے۔ پھر اس شخص نے بعد میں اسے پتھر ہی دیکھا جیسا کہ وہ پہلی بار تھا۔\n\n### [موسیٰ کا عصا اور فرعون کے جادوگر]\n\nاللہ تعالیٰ نے موسیٰ علیہ السلام کے عصا کے بارے میں فرمایا: وَمَا تِلْكَ بِيَمِينِكَ يَا مُوسَىٰ (اور اے موسیٰ! تمہارے دائیں ہاتھ میں کیا ہے؟) قَالَ هِيَ عَصَايَ (موسیٰ نے کہا: یہ میرا عصا ہے)۔ پھر فرمایا: أَلْقِهَا يَا مُوسَىٰ (اے موسیٰ! اسے ڈال دو)۔ پس انہوں نے اسے اپنے ہاتھ سے زمین پر ڈالا، فَإِذَا هِيَ حَيَّةٌ تَسْعَىٰ (تو اچانک وہ ایک دوڑتا ہوا سانپ بن گیا)۔\n\nجب موسیٰ علیہ السلام کو اس سے خوف محسوس ہوا، جو کہ نفوس میں معمول کی بات ہے کہ جب سانپ اچانک سامنے آ جائے تو خوف آتا ہے، کیونکہ اللہ نے اسے بنی آدم کے لیے نقصان سے جوڑ دیا ہے، اور موسیٰ کو اس میں اللہ کی مراد کا علم نہیں تھا۔ اگر انہیں علم ہوتا تو وہ خوفزدہ نہ ہوتے۔ پس اللہ تعالیٰ نے ان سے فرمایا: خُذْهَا وَلَا تَخَفْ سَنُعِيدُهَا سِيرَتَهَا الْأُولَىٰ (اسے پکڑ لو اور ڈرو نہیں، ہم اسے اس کی پہلی حالت پر لوٹا دیں گے)۔ یعنی وہ دوبارہ عصا بن جائے گا جیسا کہ تھا، یا تم اسے دوبارہ عصا کے طور پر دیکھو گے جیسا کہ وہ تھا۔ آیت دونوں معانی کا احتمال رکھتی ہے۔\n\nاگر اللہ عزوجل کے فرمان سَنُعِيدُهَا سِيرَتَهَا الْأُولَىٰ میں ضمیر (ھا) اس حال میں عصا کی طرف نہ لوٹے جب موسیٰ کی نظر میں وہ سانپ تھا، تو ضمیر کا مرجع نہیں ملے گا۔ جیسے اگر کوئی شخص تمہارے ساتھ کوئی معاملہ کرتا رہا ہو، مثلاً وہ تمہارے ساتھ احسان کرتا تھا، پھر اس نے تمہارے ساتھ برا سلوک کیا، تو تم اس سے کہتے ہو: \"تمہارا رویہ میرے ساتھ بدل گیا ہے، تم وہ نہیں ہو جو میرے ساتھ احسان کرتا تھا،\" حالانکہ معلوم ہے کہ وہ وہی شخص ہے۔ تو اسے کہا جائے گا کہ وہ تمہارے ساتھ احسان کی اپنی پہلی حالت پر لوٹ آئے گا، اور وہ اپنی صورت میں نہیں بدلا، لیکن اس کا فعل تمہارے ساتھ بدل گیا۔\n\nاللہ نے یہ واقعہ موسیٰ علیہ السلام کے لیے بطور تمہید پیش کیا، اس علم کے لیے جو اللہ سبحانہ کے علم میں پہلے سے تھا کہ جادوگر بھی ان کی آنکھوں کے سامنے ایسا ہی ظاہر کریں گے، تاکہ موسیٰ کو اس کا علم ہو اور جب وہ اپنی رسیاں اور لاٹھیاں ڈالیں تو وہ گھبراہٹ اور خوف کا شکار نہ ہوں۔ اور موسیٰ کو خیال ہوا کہ وہ دوڑ رہی ہیں، اللہ نے فرمایا: \"پس جب تم ان کی طرف سے یہ دیکھو تو ڈرنا نہیں،\" تاکہ ان کا دل مضبوط ہو جائے۔\n\nجب جادوگروں کی طرف سے وہ واقعہ پیش آیا جس کا ذکر اللہ نے اپنی کتاب میں کیا ہے، اور وادی ان کی رسیوں اور لاٹھیوں سے بھر گئی، اور موسیٰ نے اسے دیکھا جیسا کہ انہیں خیال ہوا کہ وہ دوڑتے ہوئے سانپ ہیں، فَأَوْجَسَ فِي نَفْسِهِ خِيفَةً مُّوسَىٰ (موسیٰ نے اپنے دل میں کچھ خوف محسوس کیا)۔ اس وقت ان کے خوف کی نوعیت پہلے خوف کی نوعیت سے مختلف تھی۔ پہلا خوف سانپ سے تھا، پس وہ وَلَّى مُدْبِرًا وَلَمْ يُعَقِّبْ (پیٹھ پھیر کر بھاگے اور پیچھے مڑ کر نہ دیکھا) یہاں تک کہ اللہ تعالیٰ نے انہیں خبر دی۔ اور یہ دوسرا خوف جو جادوگروں کے سامنے ظاہر ہوا، وہ حاضرین کے لیے تھا، تاکہ جادوگر ان پر دلیل کے ذریعے غالب نہ آ جائیں اور لوگوں پر معاملہ مشتبہ نہ ہو جائے۔ اسی لیے اللہ نے ان سے فرمایا: لَا تَخَفْ إِنَّكَ أَنتَ الْأَعْلَىٰ (ڈریں نہیں، یقیناً آپ ہی غالب رہیں گے)۔\n\nجب جادوگروں نے موسیٰ کا خوف دیکھا جو انہوں نے دیکھا تھا، اور وہ یہ نہ جان سکے کہ اس خوف کا تعلق کس چیز سے ہے، تو انہیں معلوم ہو گیا کہ موسیٰ کے پاس علمِ سحر میں سے کچھ نہیں ہے۔ کیونکہ ساحر اپنے فعل سے نہیں ڈرتا، اس علم کی بنا پر کہ باہر اس کی کوئی حقیقت نہیں ہے اور وہ ویسا نہیں ہے جیسا دیکھنے والوں کی آنکھوں کو ظاہر ہوتا ہے۔ پس اللہ نے موسیٰ کو حکم دیا کہ وہ اپنا عصا ڈالیں اور خبر دی کہ وہ تَلْقَفْ مَا صَنَعُوا (جو کچھ انہوں نے بنایا ہے اسے نگل جائے گا)۔\n\nجب موسیٰ نے اپنا عصا ڈالا اور وہ ایک حقیقی سانپ بن گیا، تو تمام جادوگروں نے موسیٰ کے خوف سے جو کچھ جانا تھا، اس سے یہ سمجھ لیا کہ اگر یہ فعل موسیٰ کی طرف سے ہوتا اور وہ ساحر ہوتے تو وہ خوفزدہ نہ ہوتے۔ اور جب انہوں نے موسیٰ کے عصا کو حقیقی سانپ دیکھا، تو انہیں معلوم ہو گیا کہ یہ اللہ کی طرف سے ایک غیبی امر ہے جو انہیں ایمان کی طرف بلا رہا ہے، اور موسیٰ کے پاس علمِ سحر کا کوئی علم نہیں ہے۔ پس اس سانپ نے وادی میں موجود تمام رسیوں اور لاٹھیوں کو نگل لیا، یعنی اس نے ان سے سانپوں کی صورتوں کو نگل لیا، تو وہ رسیاں اور لاٹھیاں دوبارہ اپنی اصل حالت میں ظاہر ہو گئیں۔ اور اللہ نے ان کی نگاہوں کو اس سے روک لیا۔\n\nکیونکہ اللہ فرماتا ہے: تَلْقَفْ مَا صَنَعُوا (جو کچھ انہوں نے بنایا ہے اسے نگل جائے گا)۔ اور انہوں نے رسیاں یا لاٹھیاں نہیں بنائی تھیں، بلکہ انہوں نے دیکھنے والوں کی آنکھوں میں سانپوں کی صورتیں بنائی تھیں، اور وہی تھیں جنہیں موسیٰ کے عصا نے نگل لیا۔ پس جو کچھ میں نے تمہیں بتایا ہے اس پر غور کرو، کیونکہ مفسرین اللہ کی خبروں میں اس ادراک سے غافل رہے ہیں۔ اللہ نے یہ نہیں فرمایا کہ وہ ان کی رسیوں اور لاٹھیوں کو نگل جائے گا، بلکہ جو کچھ انہوں نے بنایا تھا۔\n\nپس جادوگروں کے نزدیک موسیٰ کی آیت (نشانی) صرف ان کا خوف اور رسیوں اور لاٹھیوں سے سانپوں کی صورتوں کا چھین لینا تھا۔ چنانچہ انہیں معلوم ہو گیا کہ موسیٰ جو کچھ لائے ہیں وہ اللہ کی طرف سے ہے، پس وہ سب کے سب اس پر ایمان لے آئے جو موسیٰ لائے تھے، اور اس آیت کو دیکھ کر سجدے میں گر گئے اور قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ رَبِّ مُوسَىٰ وَهَارُونَ (انہوں نے کہا: ہم تمام جہانوں کے رب پر ایمان لائے، جو موسیٰ اور ہارون کا رب ہے)۔ انہوں نے \"رب موسیٰ و ہارون\" کا اضافہ اس لیے کیا تاکہ التباس دور ہو جائے، کیونکہ اگر وہ صرف \"رب العالمین\" پر رک جاتے تو فرعون کہتا کہ میں رب العالمین ہوں اور ان کی مراد میں ہوں۔ پس انہوں نے \"رب موسیٰ و ہارون\" کا اضافہ کیا، تو اشکال دور ہو گیا۔ فرعون نے انہیں عذاب کی دھمکی دی، تو انہوں نے آخرت کے عذاب پر دنیا کے عذاب کو ترجیح دی، اور ان کی گفتگو وہی تھی جو اللہ نے ہم پر بیان کی۔\n\nجہاں تک عام لوگوں کا تعلق ہے، تو انہوں نے موسیٰ جو کچھ لائے تھے اسے جادوگروں کے لائے ہوئے کی قبیل سے منسوب کیا، مگر یہ کہا کہ وہ ان سے زیادہ قوی اور جادو کے زیادہ عالم ہیں، اس نگلنے کی وجہ سے جو موسیٰ علیہ السلام کے عصا کے سانپ سے ظاہر ہوا۔ پس انہوں نے کہا: یہ بہت بڑا جادو ہے۔ حالانکہ جادوگروں کے نزدیک موسیٰ کی آیت صرف ان کا خوف اور رسیوں اور لاٹھیوں سے سانپوں کی صورتوں کا چھین لینا ہی تھی۔\n\nپس ایسا فعل نفسانی قوت (قوة النفس) اور اسماء کے خواص سے باہر ہے، کیونکہ موسیٰ سے پہلی بار خوف کا ظاہر ہونا پایا گیا۔ پس یہ فعل اللہ کی طرف سے تھا۔ اور جب جادوگروں نے دیکھنے والوں کی آنکھوں پر رسیوں اور لاٹھیوں کو ان کی نظر میں سانپ بنا کر التباس ڈالا، تو ذات حق (الحق) نے چاہا کہ وہ ان کے دروازے سے ان کے پاس آئے جسے وہ جانتے ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا: وَلَلَبَسْنَا عَلَيْهِم مَّا يَلْبِسُونَ (اور ہم ان پر وہی التباس ڈال دیں گے جو وہ ڈالتے ہیں)۔ کیونکہ اللہ معاملات میں مناسبتوں کا خیال رکھتا ہے۔ پس اس نے عصا کو سانپ بنا دیا، عام لوگوں کے لیے ان کے عصا کے سانپوں کی طرح، اور جادوگروں پر موسیٰ کے خوف کے ذریعے التباس ڈالا، تو انہوں نے گمان کیا کہ وہ سانپوں سے ڈر گئے ہیں۔ حالانکہ موسیٰ نفس الامر میں سانپوں سے خوفزدہ نہیں تھے، کیونکہ اللہ کی طرف سے پہلے فعل میں انہیں یہ بات بتا دی گئی تھی جب اس نے فرمایا: خُذْهَا وَلَا تَخَفْ (اسے پکڑ لو اور ڈرو نہیں)۔ پس اللہ نے انہیں اس سے ڈرنے سے منع کیا اور انہیں بتایا کہ یہ ان کے لیے ایک نشانی ہے۔ پس ان کا دوسرا خوف لوگوں کے لیے تھا، تاکہ ان پر دلیل اور شبہ کا التباس نہ ہو جائے۔ اور جادوگروں نے گمان کیا کہ وہ سانپوں سے ڈر گئے ہیں، پس اللہ نے ان کے خوف پر التباس ڈالا، جیسا کہ انہوں نے لوگوں پر التباس ڈالا تھا۔ اور یہ اس مقام پر مناسبتوں میں الٰہی استقصاء کی انتہا ہے، کیونکہ اگر جادوگروں کو معلوم ہو جاتا کہ موسیٰ کا خوف دلیل سے مغلوب ہونے کا ہے، تو وہ ایمان لانے میں جلدی نہ کرتے۔ پھر یہ کہ موسیٰ کے سانپ میں نگلنے کی خاصیت تھی، جبکہ ان کے سانپوں میں نگلنے یا کسی اثر کی خاصیت نہیں تھی، کیونکہ وہ نفس الامر میں رسیاں اور لاٹھیاں ہی تھیں۔\n\n### [معجزات اور اعیان کی تبدیلی]\n\nپس یہ مقام جس کا ہم نے اس باب میں ذکر کیا ہے کہ یہ کائنات کے علوم میں سے ایک جزوی علم کا پڑوسی ہے، یہ جزوی علم معجزات کا علم ہے۔ کیونکہ یہ نہ تو نفسانی قوت (قوة نفسية) سے ہے اور نہ ہی اسماء کے خواص سے۔ اگر موسیٰ علیہ السلام کے عصا کا سانپ میں تبدیل ہونا وہمی قوت یا انہیں عطا کیے گئے اسماء کی وجہ سے ہوتا، تو وہ خوفزدہ ہو کر پیٹھ پھیر کر نہ بھاگتے اور پیچھے مڑ کر نہ دیکھتے۔ پس ہمیں معلوم ہوا کہ کچھ امور ایسے ہیں جو ذات حق (الحق) کے علم کے ساتھ خاص ہیں، جنہیں وہ شخص نہیں جانتا جس کے ہاتھ پر وہ صورت ظاہر ہوئی ہے۔\n\nپس یہ مقام اس چیز کا پڑوسی ہے جو انبیاء لائے ہیں، اس لحاظ سے کہ یہ کسی حیلے سے نہیں تھا، اور یہ انبیاء علیہم السلام کے معجزات جیسا بھی نہیں تھا، کیونکہ انبیاء کو اس کا علم نہیں ہوتا، جبکہ ان (اولیاء) سے یہ ان کی ہمت، یا ان کی نفسانی قوت، یا ان کے صدق کی وجہ سے ظاہر ہوا—تم اسے جو چاہو کہہ لو۔ اسی لیے اسے کرامات کا نام دیا گیا، اور اسے نہ تو معجزات کہا گیا اور نہ ہی جادو۔\n\nمعجزہ وہ ہے جسے لانے سے مخلوق عاجز ہو جائے، یا تو صرف (صرف) کے طور پر، یا اس لیے کہ وہ نفسانی قوت اور اسماء کے خواص نہ ہونے کی وجہ سے انسان کی قدرت میں نہیں ہوتا، اور وہ ان کے ہاتھوں پر ظاہر ہوتا ہے۔ اور جادو وہ ہے جس میں ایک پہلو حق کی طرف ظاہر ہوتا ہے، حالانکہ وہ نفس الامر میں حق نہیں ہوتا۔ یہ زمانی سحر (السحر الزماني) سے مشتق ہے، جو روشنی اور تاریکی کا اختلاط ہے۔ پس وہ نہ تو رات ہے کیونکہ اس میں صبح کی روشنی شامل ہو گئی ہے، اور نہ ہی وہ دن ہے کیونکہ آنکھوں کے لیے سورج طلوع نہیں ہوا ہے۔ اسی طرح یہ جسے جادو کہا جاتا ہے، نہ تو وہ مکمل طور پر باطل ہے کہ وہ عدم ہو جائے، کیونکہ آنکھ نے ایک ایسی چیز کا ادراک کیا ہے جس میں اسے کوئی شک نہیں، اور نہ ہی وہ خالص حق ہے کہ اس کا عین میں وجود ہو، کیونکہ وہ بذات خود ویسا نہیں ہے جیسا کہ آنکھ اسے دیکھتی ہے اور دیکھنے والا اسے گمان کرتا ہے۔\n\nاور اولیاء کی کرامات جادو کی قبیل سے نہیں ہیں، کیونکہ ان کا نفس الامر میں وجودی حقیقت ہوتی ہے، اور وہ معجزہ بھی نہیں ہیں، کیونکہ وہ علم اور قوتِ ہمت سے ہوتی ہیں۔\n\nجہاں تک علیم کا یہ قول ہے کہ \"تم اسے اپنے رب کی حقیقت (لحقيقتك بربك) کی وجہ سے سونا دیکھتے ہو، کیونکہ اعیان (الأعيان) تبدیل نہیں ہوتے،\" تو یہ اس لیے تھا کہ جب اس شخص نے یہ معاملہ دیکھا تو اسے بہت بڑا سمجھا، تو علیم نے اس سے کہا کہ \"تمہارا علم اس سے زیادہ شرف والا ہے جو تم نے دیکھا، پس علم سے متصف ہو جاؤ، کیونکہ یہ اس سے کہیں زیادہ عظیم ہے کہ ستون نفس الامر میں سونا بن گیا ہو۔\" پس انہوں نے اسے بتایا کہ اعیان (الأعيان) تبدیل نہیں ہوتے، اور یہ نفس الامر میں صحیح ہے۔ یعنی پتھر کی حقیقت سونے میں تبدیل نہیں ہوئی، بلکہ پتھر کی حقیقت نے اس جوہر کو قبول کیا، جیسا کہ جسم نے حرارت کو قبول کیا تو اسے گرم کہا گیا۔ پس جب اللہ چاہتا ہے کہ اس جوہر کو سونے کی صورت پہنائے، تو وہ اس سے پتھر کی صورت اتار دیتا ہے اور اسے سونے کی صورت پہنا دیتا ہے۔ پس وہ جوہر یا جسم جو پتھر تھا، سونا بن کر ظاہر ہوتا ہے، جیسا کہ گرم جسم سے حرارت اتار دی جاتی ہے اور اسے ٹھنڈک پہنا دی جاتی ہے تو وہ ٹھنڈا ہو جاتا ہے۔ پس حرارت کی عین ٹھنڈک میں تبدیل نہیں ہوئی، اور ٹھنڈا جسم بعینہ وہی ہے جو گرم تھا۔ پس اعیان تبدیل نہیں ہوئے۔\n\nاسی طرح علیم کے قصے میں، وہ جوہر جس نے ضرب لگنے پر سونے کی صورت قبول کی، وہی تھا جس نے پتھر کی صورت قبول کی تھی، اور جوہر بعینہ وہی جوہر ہے۔ پس نہ پتھر سونا بنا اور نہ سونا پتھر بنا۔ جیسا کہ ہیولانی جوہر (الجوهر الهيولاني) نے پانی کی صورت قبول کی، تو اسے بلا شک پانی کہا گیا۔ پھر جب تم اسے برتن میں ڈال کر آگ پر ابالتے ہو یہاں تک کہ وہ بھاپ بن کر اوپر اٹھتا ہے، تو تم یقیناً جانتے ہو کہ پانی کی صورت اس سے زائل ہو گئی اور اس نے بھاپ کی صورت قبول کر لی۔ پس وہ اپنے اعظم عنصر کی طرف صعود کا طلبگار ہوتا ہے، جیسا کہ جب اس میں پانی کی صورت قائم تھی تو وہ اپنے اعظم عنصر کی طرف نزول کا طلبگار ہوتا تھا۔\n\nپس اولیاء اور ہمت کے ساتھ خاص اس مقام میں، جو معجزے کے علم کا پڑوسی ہے، علیم کے قول کا یہی مطلب ہے کہ اعیان (الأعيان) تبدیل نہیں ہوتے۔ اور ان کا قول \"لحقیقتک بربك\" (تمہاری حقیقت کے لیے تمہارے رب کے ساتھ) کا مطلب یہ ہے کہ جب تم اپنی حقیقت پر مطلع ہوتے ہو، تو تم اپنے آپ کو محض ایک عاجز، مردہ، کمزور، معدوم بندہ پاتے ہو، تمہارا کوئی وجود نہیں، جیسے یہ جوہر جب تک صورتیں نہیں پہنتا، اس کا کوئی وجود ظاہر نہیں ہوتا۔ پس یہ بندہ الٰہی اسماء کی صورتیں پہنتا ہے، اور ان کے ذریعے اس کا وجود ظاہر ہوتا ہے۔ پس پہلا اسم جو وہ پہنتا ہے وہ الوجود (ہستی) ہے، تو وہ اپنے لیے موجود ظاہر ہوتا ہے، یہاں تک کہ وہ ہر وہ چیز قبول کرتا ہے جو موجود ہونے کے ناطے قبول کر سکتا ہے۔ پس وہ تمام اسماء الٰہیہ کو قبول کرتا ہے جو ذات حق (الحق) اس پر ڈالتا ہے، اور اس وقت وہ حی (زندہ)، قادر، علیم (جاننے والا)، مرید (ارادہ کرنے والا)، سمیع (سننے والا)، بصیر (دیکھنے والا)، متکلم (کلام کرنے والا)، شکور (قدردان)، رحیم (رحم کرنے والا)، خالق (پیدا کرنے والا)، اور مصور (صورت بنانے والا) اور تمام اسماء سے متصف ہو جاتا ہے، جیسا کہ یہ جسم پتھر، سونا، چاندی، تانبا، پانی اور ہوا سے متصف ہوا۔ اور ان صفات کے موجود ہونے کے باوجود ہر ایک سے جسمیت کی حقیقت زائل نہیں ہوتی۔ اسی طرح انسان سے اس کے بندہ اور انسان ہونے کی حقیقت زائل نہیں ہوتی، باوجود اس کے کہ اس میں یہ اسماء الٰہیہ موجود ہوتے ہیں۔\n\nپس ان کے قول \"لحقیقتك بربك\" کا یہی مطلب ہے، یعنی تمہاری حقیقت کے تمہارے رب کے ساتھ تعلق کی وجہ سے، پس تم کسی الٰہی صورت سے خالی نہیں ہوتے جس میں تم ظاہر ہوتے ہو۔ اسی طرح یہ جسم بھی کسی ایسی صورت سے خالی نہیں ہوتا جس میں وہ ظاہر ہو۔ اور جس طرح تم اسماء الٰہیہ کی صورتوں سے متنوع ہوتے ہو، تو ہر صورت کے مطابق تم پر ایک نام دوسرے نام سے مختلف بولا جاتا ہے، اسی طرح اس جوہر پر وصف کے لیے حجر (پتھر) اور ذہب (سونا) کا نام بولا جاتا ہے، نہ کہ اس کی عین ذات کے لیے۔\n\nپس جو کچھ میں نے تمہارے لیے ذکر کیا ہے، اس میں خلاف معمول امور (خرق العوائد) کی تینوں قسمیں واضح ہو گئیں، یعنی معجزات، کرامات اور جادو۔ اور اس سے زیادہ کوئی خلاف معمول امر نہیں ہے۔ اور کرامات سے میری مراد صرف وہ ہے جو قوتِ ہمت سے ظاہر ہو، نہ کہ میں اس اصطلاح سے اس مقام پر اس شخص کے لیے الٰہی تقرب مراد لے رہا ہوں، کیونکہ وہ استدراج (تدریجی پکڑ) یا مکر بھی ہو سکتا ہے۔ میں نے اسے کرامت کا نام اس لیے دیا ہے کہ یہ غالب ہے اور مکر اس میں بہت کم ہوتا ہے۔\n\nپس یہ مقام انبیاء علیہم السلام کی آیات (نشانیوں) کا پڑوسی ہے، اور یہ کائنات کے علوم میں سے ایک جزوی علم ہے، یہ جادو کا پڑوسی نہیں ہے۔ کیونکہ ولی کی کرامت اور اس کا خلاف معمول امر (خرق العادة) رسول کی پیروی اور ان کی سنت پر چلنے سے ہی ہوتا ہے۔ پس گویا یہ اسی نبی کی نشانیوں میں سے ہے، کیونکہ پیروی کرنے والے کے لیے پیروی کے ذریعے یہ ظاہر ہوا۔ اسی لیے یہ اس کا پڑوسی ہوا۔\n\nاس مقام کے اقطاب ہر وہ ولی ہیں جس پر خلاف معمول امر اس کی اپنی ہمت کے بغیر ظاہر ہوا ہو، پس وہ اس شخص کے مقابلے میں نبوت کے زیادہ قریب ہوتا ہے جس سے خلاف معمول امر اس کی ہمت سے ظاہر ہو۔ اور انبیاء اپنی اصل کے اعتبار سے بندے ہیں، اسی طرح اس مقام کے اقطاب بھی ہیں۔ پس جب بھی تمہارے احوال انبیاء علیہم السلام کے احوال کے قریب ہوں گے، تم عبودیت میں زیادہ پختہ ہو گے، اور تمہارے پاس حجت ہو گی، اور شیطان کا تم پر کوئی تسلط نہیں ہو گا، جیسا کہ اللہ تعالیٰ نے فرمایا: إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ (یقیناً میرے بندوں پر تیرا کوئی تسلط نہیں ہے)۔ اور فرمایا: يَسْلُكُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا (وہ اس کے آگے اور پیچھے سے نگہبان مقرر کرتا ہے)۔ پس ان میں شیطان کا کوئی اثر نہیں ہوتا۔ اسی طرح جو ان کے قریب ہوتے ہیں۔\n\nاور جب میں نے اس مشہد کا مشاہدہ کیا تو میں نے کہا:\n\nقصیدہ جس کا آغاز یہ ہے:\n> فرشتے رات کو میرے قلب پر نازل ہوئے\n> اور اس کے گرد دل کے دائرے کی طرح گھومے۔\n\n> اس لعین کے القاء سے بچنے کے لیے، جب وہ دیکھتا ہے\n> علومِ غیب کا عین قلب پر نازل ہونا۔\n\n> اور یہ ہمارے جیسے مقام میں اللہ کی حفاظت ہے\n> اور رسولوں میں اس کی عصمت بلا شک و شبہ ہے۔\n\n(یہ قصیدہ مکمل طور پر اس کتاب کے تین سو تیسویں باب کے شروع میں مذکور ہے۔)\n\n### [اجسام کا روحانی بننا اور ارواح کا جسمانی بننا]\n\nاور اس باب کی ترتیب وہی ہے جو ہم نے خلاف معمول امور (خرق العوائد) کے مراتب میں ذکر کی ہے۔ جہاں تک اس میں موجود عجائبات کا تعلق ہے، تو وہ تمثل (صورت اختیار کرنے) میں بشر کا روحانیوں کے ساتھ مل جانا، اور صورت میں روحانیوں کا بشر کے ساتھ مل جانا، اور ان سے ایک ایسی صورت کا ظاہر ہونا ہے جو اس صورت سے مشابہ ہو جس میں وہ تمثل کرتے ہیں۔ اللہ تعالیٰ نے فرمایا: فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا (تو وہ اس کے سامنے ایک مکمل انسان کی صورت میں ظاہر ہوا)۔ اسے روح کہا جاتا ہے، جیسے جبرائیل ایک روح ہیں، اور وہ مردوں کو زندہ کرتے ہیں، جیسا کہ جبرائیل زندہ کرتے ہیں۔\n\nابن عباس رضی اللہ عنہما نے فرمایا: جبرائیل علیہ السلام نے زمین پر کبھی کسی جگہ قدم نہیں رکھا مگر وہ جگہ زندہ ہو گئی۔ اسی لیے سامری نے ان کے قدموں کے نشان سے ایک مٹھی بھر لی تھی، جب اس نے انہیں پہچانا جب وہ موسیٰ کے پاس آئے تھے، اور وہ جانتا تھا کہ ان کے قدموں کے نشان سے وہ چیزیں زندہ ہو جاتی ہیں جن پر وہ قدم رکھتے ہیں۔ پس اس نے رسول کے اثر سے ایک مٹھی بھر لی اور اسے اس بچھڑے میں ڈال دیا جو اس نے بنایا تھا، تو وہ بچھڑا زندہ ہو گیا۔ اور یہ شیطان کی طرف سے سامری کے نفس میں القاء تھا، کیونکہ شیطان ارواح کے مقام کو جانتا ہے۔ پس اس نے سامری میں یہ قوت پائی، اور سامری کو یہ معلوم نہ ہوا کہ یہ ابلیس کا القاء ہے، پس اس نے کہا: وَكَذَلِكَ سَوَّلَتْ لِي نَفْسِي (اور اسی طرح میرے نفس نے مجھے سجھایا)۔ اور ابلیس نے یہ اس لیے کیا کہ وہ اللہ کے لیے شریک کے اعتقاد کے ذریعے اسے گمراہ کرنے کی حرص رکھتا تھا۔\n\nپس عیسیٰ علیہ السلام معنی، نام اور تمثل شدہ صورت میں جبرائیل کی صورت پر ظاہر ہوئے۔ پس ایک ہی واقعے میں بشر کا روحانی سے متحقق ہونا اور روحانی کا بشر کی صورت سے مل جانا پایا گیا۔ اور اس باب کے لیے یہ مقدار کافی ہے، کیونکہ یہ مریم اور آسیہ کے لیے ایک وسیع باب ہے، اور اس میں رسولوں کی حقائق کے لیے ایک کشادہ میدان ہے۔ کیونکہ یہ کمال کا مقام ہے، جس نے اسے حاصل کر لیا وہ اپنی جنس کے لوگوں پر سردار بن گیا اور صاحبِ جلال و جمال پر حاکم بن کر ظاہر ہوا۔ اور یہ ابو یزید بسطامی اور افراد کے مقامات میں سے ہے۔\n\nاور اللہ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\n\n(اکیسواں حصہ مکمل ہوا)",
    "fa": "(باب چهلم) در شناخت منزلی که مجاور علم جزئی از علوم کائنات، ترتیب آن، غرایبش و اقطاب آن است.\n\nنظمی که متضمن ترجمه ماست:\n> علم الهی مجاور علم کائنات است، *** کسی که به او عطا شود، می‌گوید کشف حقیقی است.\n> و آن نه از علم برازخ (برزخ) خالص است، *** و نه علوی است و نه سفلی.\n> در عالم بالا وجهی غریب و محقق دارد، *** و در عالم پایین وجهی علوی به واسطه حقایق.\n> و کسی که آن را درک می‌کند نه فرشته‌ای مخلص است، *** و نه جن است و نه انسان.\n> بلکه اعیان (الأعيان) چون با هم الفت گرفتند، *** شکلی کیانی و مستفاد برای تو آشکار شد.\n> پس هر چه خواهی در مورد آن بگو، اصلش آن را می‌پذیرد، *** تو آن را نمی‌بینی در حالی که برای چشم مرئی است.\n> پس نه محکوم است و نه حاکم، *** نه غیبی است و نه حسی.\n> نورش از محدود شدن به جهات منزه است، *** پس نه شرقی است و نه غربی.\n> پاک و منزه است کسی که ذاتش را از چشم پنهان کرد، *** و مثالی از او به صورت پیوسته در ما جاری است.\n> او را می‌بینیم وقتی که هستیم، در حالی که عین او نیست، *** بلکه کشفی صحیح و خیالی است.\n> برای دید چشم در هر صورتی تجلی (التجلی) کرد، *** و این مقصود من از گفتار «مثالی» است.\n\n### [نقض عادات: معجزات، کرامات، سحر]\n\nبدان، خداوند تو را به روح القدس تأیید کند، که این منزل، منزل کمال است و مجاور منزل جلال و جمال است. این از شریف‌ترین منازل است و کسی که در آن فرود آید، کامل‌ترین فرودآینده است.\n\nبدان که نقض عادات (خرق العوائد) بر سه قسم است:\n\nقسم اول: به چیزی بازمی‌گردد که با چشم یا برخی قوای دیگر درک می‌شود، بر حسب آنچه برای آن قوه ظاهر می‌شود، از آنچه در عادت به درک آن مرتبط شده است، در حالی که در نفس خود بر خلاف آن چیزی است که آن قوه درک کرده است. مانند این فرموده خداوند متعال: يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏ (از سحرشان چنان به نظرش می‌آمد که آن ریسمان‌ها و عصاها می‌دوند).\n\nاین قسم تحت قدرت بشر قرار دارد و خود بر دو بخش است: بخشی که به نیروی نفسانی بازمی‌گردد، و بخشی که به خواص اسمایی بازمی‌گردد که اگر آن اسماء بر زبان جاری شوند، آن صورت‌ها در چشم بیننده یا در گوش او به صورت خیال ظاهر می‌شوند، در حالی که در نفس‌الامر (یعنی در محسوسات) هیچ صورتی دیدنی یا شنیدنی وجود ندارد. این کار ساحر است و او می‌داند که در چشم‌ها و گوش‌ها چیزی از آنچه واقع شده، وجود ندارد.\n\nقسم دیگر که نیروی نفسانی است، همانند آنچه از خواص اسماء ظاهر می‌شود، در آنچه چشم می‌بیند یا هر ادراک دیگری که باشد، پدید می‌آید. تفاوت میان این دو آن است که کسی که کار را از طریق اسماء انجام می‌دهد (که همان ساحر است)، می‌داند که در خارج چیزی وجود ندارد و تنها بر خیال حاضران سلطه دارد، پس دیدگان ناظران را می‌رباید و او صورت‌هایی را در خیال خود می‌بیند، همان‌گونه که شخص خوابیده در خواب می‌بیند، در حالی که در خارج چیزی از آنچه درک می‌کند، وجود ندارد.\n\nاما این قسم دیگر که مربوط به نیروی نفسانی است، برخی از انجام‌دهندگان آن می‌دانند که در خارج چیزی نیست و برخی دیگر نمی‌دانند و معتقدند که امر همان‌گونه است که دیده‌اند.\n\nابوعبدالرحمن سلمی در کتاب *مقامات الأولیاء* در باب کرامات ذکر کرده است که علیم اسود، که از بزرگان اهل طریقت بود، با یکی از صالحان ملاقات کرد. در داستانی که پیش آمد، علیم اسود به ستونی مرمرین که در مسجد برپا بود، ضربه‌ای زد، و ناگهان تمام آن ستون طلا شد. آن مرد به آن ستون طلا نگاه کرد و تعجب نمود. علیم به او گفت: ای مرد، اعیان (الأعيان) دگرگون نمی‌شوند، بلکه تو آن را به حقیقت خودت به واسطه پروردگارت این‌گونه می‌بینی، در حالی که غیر از این است. از کلام او برای کسی که در نگاه اول یا اولین نظر، علم به اشیاء ندارد، چنین برمی‌آید که ستون همان سنگ است که بود و طلا نشده، مگر در چشم بیننده. سپس آن مرد بعد از آن، ستون را همان‌گونه که در ابتدا بود، سنگ دید.\n\n### [عصای موسی و ساحران فرعون]\n\nخداوند متعال درباره عصای موسی (علیه السلام) می‌فرماید: وَما تِلْكَ بِيَمِينِكَ يا مُوسى‏ (و آن چیست در دست راست تو ای موسی؟) قَالَ هِيَ عَصَايَ (گفت: آن عصای من است). سپس فرمود: أَلْقِها يا مُوسى‏ (ای موسی آن را بینداز). پس آن را از دستش بر زمین انداخت فَإِذا هِيَ حَيَّةٌ تَسْعى‏ (ناگهان اژدهایی شد که می‌دوید).\n\nچون موسی (علیه السلام) از آن ترسید، بر اساس جریان عادی در نفوس که از مارها می‌ترسند وقتی ناگهان با آن‌ها مواجه می‌شوند، به دلیل ضرری که خداوند برای بنی‌آدم با آن همراه کرده است، و موسی مراد خداوند را در آن نمی‌دانست (و اگر می‌دانست نمی‌ترسید)، خداوند متعال به او فرمود: خُذْها ولا تَخَفْ سَنُعِيدُها سِيرَتَهَا الْأُولى‏ (آن را بگیر و نترس، ما آن را به حالت اولش بازمی‌گردانیم).\n\nیعنی یا عصا به همان صورت اولش بازمی‌گردد، یا تو آن را عصا می‌بینی همان‌گونه که در ابتدا بود. آیه محتمل هر دو معناست. زیرا اگر در حالتی که موسی آن را مار می‌دید، عصا نبود، ضمیر در فرموده عز و جل سَنُعِيدُها سِيرَتَهَا الْأُولى‏ (آن را به حالت اولش بازمی‌گردانیم) به چیزی که بازگردد، وجود نداشت. همان‌گونه که اگر انسانی به تو عادتی داشته باشد (مثلاً به تو احسان می‌کرده) و سپس به تو بدی کند، تو به او می‌گویی: «رفتار تو با من تغییر کرده است، تو آن کسی نیستی که احسان می‌کردی.» در حالی که معلوم است او همان شخص است. پس به او گفته می‌شود: «او به رفتار اولش در احسان به تو بازخواهد گشت.» او در صورتش تغییری نکرده، بلکه فعلش نسبت به تو تغییر کرده است.\n\nخداوند این امر را برای موسی (علیه السلام) مقدم داشت تا زمینه‌ای باشد برای آنچه در علم سبحانه‌اش گذشته بود که ساحران نیز چیزی شبیه به این را در چشم او ظاهر خواهند کرد. پس او از آن علم داشته باشد تا هنگام انداختن ریسمان‌ها و عصاهایشان، مبهوت نشود و نترسد. و چون به موسی تخیل شد که آن ریسمان‌ها می‌دوند (يُخَيَّلُ إِلَيْهِ أَنَّها تَسْعى‏)، به او می‌گوید: «پس اگر آن را از ایشان دیدی، نترس» تا قلبش قوی شود.\n\nهنگامی که از ساحران آنچه واقع شد که خداوند در کتابش برای ما ذکر کرده است و دره از ریسمان‌ها و عصاهایشان پر شد و موسی آن‌ها را در آنچه برایش تخیل شده بود، مارهایی دید که می‌دوند، فَأَوْجَسَ في نَفْسِهِ خِيفَةً مُوسى‏ (موسی در دل خود ترسی احساس کرد). نسبت دادن ترس به او در این زمان، مانند نسبت دادن ترس اول نبود. زیرا ترس اول از مار بود و وَلَّى مُدْبِراً ولَمْ يُعَقِّبْ (پشت کرد و بازنگشت) تا اینکه خداوند متعال او را خبر داد. اما این ترس دوم که از او در برابر ساحران ظاهر شد، برای حاضران بود تا ساحران با حجت بر او غلبه نکنند و امر بر مردم مشتبه نشود. به همین دلیل خداوند به او فرمود: لا تَخَفْ إِنَّكَ أَنْتَ الْأَعْلى‏ (نترس، تو برتری).\n\nهنگامی که ساحران ترس موسی را از آنچه دید، مشاهده کردند و ندانستند که متعلق این ترس چیست، دانستند که موسی هیچ علمی از سحر ندارد. زیرا ساحر از آنچه خود انجام می‌دهد نمی‌ترسد، چون می‌داند که در خارج حقیقتی ندارد و آن‌گونه که برای چشم بینندگان ظاهر می‌شود، نیست.\n\nپس خداوند به موسی امر کرد که عصایش را بیندازد و خبر داد که تَلْقَفْ ما صَنَعُوا (آنچه را ساخته‌اند می‌بلعد). هنگامی که موسی عصایش را انداخت و اژدهایی شد، ساحران همگی از ترس موسی که مشاهده کردند، دانستند که اگر این کار از او بود و ساحر بود، نمی‌ترسید. و چون عصای او را ماری حقیقی دیدند، در آن هنگام دانستند که این امری غیبی از جانب خداوندی است که آن‌ها را به ایمان به او دعوت می‌کند و او هیچ خبری از علم سحر ندارد.\n\nپس آن مار تمام آنچه در دره بود از ریسمان‌ها و عصاها را بلعید، یعنی صورت‌های مارها را از آن‌ها بلعید، و آن‌ها ریسمان‌ها و عصاها شدند همان‌گونه که بودند. و خداوند دیدگان آن‌ها را از این امر بازداشت. زیرا خداوند می‌فرماید: تَلْقَفْ ما صَنَعُوا (آنچه را ساخته‌اند می‌بلعد). و آن‌ها ریسمان‌ها و عصاها را نساخته بودند، بلکه صورت‌های مارها را در چشم ناظران ساخته بودند، و این صورت‌ها بودند که عصای موسی آن‌ها را بلعید.\n\nپس به آنچه برایت ذکر کردم توجه کن، زیرا مفسران از این درک در اخبار خداوند متعال غافل شده‌اند. چرا که خداوند نگفت: «ریسمان‌ها و عصاهایشان را می‌بلعد.» پس آیه (نشانه) برای ساحران، ترس موسی و گرفتن صورت‌های مارها از ریسمان‌ها و عصاها بود. آن‌ها دانستند که آنچه موسی آورده از جانب خداست، پس همگی به آنچه موسی آورده بود ایمان آوردند و در برابر این آیه به سجده افتادند و گفتند: آمَنَّا بِرَبِّ الْعالَمِينَ رَبِّ مُوسى‏ وهارُونَ (ایمان آوردیم به پروردگار جهانیان، پروردگار موسی و هارون). این را اضافه کردند تا اشتباه برطرف شود، زیرا اگر بر «العالمین» توقف می‌کردند، فرعون می‌گفت: «من پروردگار جهانیان هستم، منظورشان من بودم.» پس اضافه کردند: «پروردگار موسی و هارون»، یعنی کسی که موسی و هارون به او دعوت می‌کنند، و اشکال برطرف شد.\n\nپس فرعون آن‌ها را به عذاب تهدید کرد، اما آن‌ها عذاب دنیا را بر عذاب آخرت ترجیح دادند و سخنانشان همان بود که خداوند بر ما حکایت کرده است. اما عوام، آنچه را موسی آورده بود، از قبیل آنچه ساحران آورده بودند دانستند، جز اینکه قوی‌تر از آن‌ها و داناتر به سحر بود، به دلیل بلعیدنی که از مار عصای موسی (علیه السلام) ظاهر شد. پس گفتند: «این سحری عظیم است.» در حالی که آیه موسی نزد ساحران تنها ترس او و گرفتن صورت‌های مارها از ریسمان‌ها و عصاها بود.\n\nپس چنین امری خارج از نیروی نفس و خواص اسماء است، به دلیل وجود ترسی که در اولین بار از موسی ظاهر شد. پس آن فعل از جانب خداوند بود. و چون ساحران بر دیدگان ناظران با تبدیل ریسمان‌ها و عصاها به مار در نظرشان، اشتباه ایجاد کردند، حق (الحق) اراده کرد که از همان دری که می‌شناسند به سراغشان بیاید، چنانکه می‌فرماید: ولَلَبَسْنا عَلَيْهِمْ ما يَلْبِسُونَ (و قطعاً بر آنان مشتبه می‌کردیم آنچه را که مشتبه می‌سازند).\n\nزیرا خداوند در امور، مناسبات را رعایت می‌کند. پس عصا را ماری قرار داد مانند مارهای عصاهای آن‌ها در نظر عموم مردم، و بر ساحران با آنچه از ترس موسی ظاهر کرد، اشتباه ایجاد نمود. پس آن‌ها گمان کردند که او از مارها ترسیده است، در حالی که موسی در نفس‌الامر از مارها نمی‌ترسید، به دلیل آنچه قبلاً از جانب خداوند در فعل اول به او رسیده بود، آنجا که فرمود: خُذْها ولا تَخَفْ (آن را بگیر و نترس). پس او را از ترسیدن از آن نهی کرد و به او اعلام نمود که این آیتی برای اوست. پس ترس دوم او برای مردم بود تا دلیل و شبهه بر آن‌ها مشتبه نشود. و ساحران گمان کردند که او خائف از مارهاست. پس خداوند ترس او را بر آن‌ها مشتبه کرد، همان‌گونه که آن‌ها بر مردم مشتبه کردند. و این نهایت استقصای الهی در رعایت مناسبات در این موطن است. زیرا اگر ساحران می‌دانستند که ترس موسی از غلبه با حجت است، به سرعت ایمان نمی‌آوردند. سپس، مار موسی خاصیت بلعیدن داشت، در حالی که مارهای آن‌ها خاصیت بلعیدن یا اثری نداشتند، زیرا در نفس‌الامر ریسمان و عصا بودند.\n\n### [معجزات و دگرگونی اعیان]\n\nپس این منزلی که در این باب ذکر کردیم که مجاور علم جزئی از علوم کائنات است، همین علم جزئی، یعنی علم معجزات است. زیرا نه از نیروی نفسانی است و نه از خواص اسماء. اگر تبدیل عصا به مار از موسی (علیه السلام) ناشی از نیروی وهمی یا اسمایی بود که به او داده شده بود، هرگز پشت نمی‌کرد و از ترس بازنمی‌گشت. پس دانستیم که اموری وجود دارد که در علم حق (الحق) مختص به جانب اوست و کسی که آن صورت بر دست او ظاهر شده، آن را نمی‌شناسد.\n\nپس این منزل مجاور چیزی است که پیامبران آورده‌اند، از این جهت که از حیله نیست. و مانند معجزات پیامبران (علیهم السلام) نبود، زیرا پیامبران به آن علم نداشتند، در حالی که این امور از این افراد به واسطه همتشان یا نیروی نفسشان یا صدقشان ظاهر شده است. هر طور که می‌خواهی بگو. به همین دلیل به نام کرامات (الکرامات) اختصاص یافت و معجزات (المعجزات) نامیده نشد و سحر نیز نامیده نشد.\n\nزیرا معجزه چیزی است که خلق از آوردن مانند آن عاجز باشند، یا به صورت صرف (بازداشتن) یا به دلیل اینکه از مقدورات بشر نیست به دلیل نبود نیروی نفس و خواص اسماء، و بر دست آن‌ها ظاهر می‌شود. و سحر آن است که در آن وجهی به حق (الحق) ظاهر می‌شود، در حالی که در نفس‌الامر حق نیست. مشتق از سحر زمانی (سحر زمانی) است، که اختلاط نور و ظلمت است. نه شب است، زیرا نور صبح با آن آمیخته شده، و نه روز است، زیرا خورشید برای دیدگان طلوع نکرده است. همچنین این چیزی که سحر نامیده می‌شود، باطلی محقق نیست که معدوم باشد، زیرا چشم امری را درک کرده که در آن شک نمی‌کند. و حق محض نیز نیست که در عین خود وجود داشته باشد، زیرا در نفس خود آن‌گونه که چشم مشاهده می‌کند و بیننده گمان می‌برد، نیست.\n\nو کرامات اولیاء از قبیل سحر نیست، زیرا برای آن‌ها در نفس خود حقیقتی وجودی است. و معجزه نیز نیست، زیرا بر اساس علم و نیروی همت است.\n\nاما سخن علیم که گفت: «به حقیقت خودت به واسطه پروردگارت آن را طلا می‌بینی، زیرا اعیان (الأعيان) دگرگون نمی‌شوند»، این را گفت چون دید که آن مرد آن امر را بسیار بزرگ شمرده است. پس به او گفت: «علم تو شریف‌تر از چیزی است که دیدی، پس به علم متصف شو، زیرا آن بزرگ‌تر از این است که ستون در نفس‌الامر طلا باشد.» پس به او اعلام کرد که اعیان دگرگون نمی‌شوند، و این در نفس‌الامر صحیح است. یعنی سنگ بودن به طلا تبدیل نشده است. زیرا حقیقت سنگ بودن این جوهر را پذیرفته است، همان‌گونه که جسم حرارت را پذیرفته و به آن گفته شده است که گرم است. پس اگر خداوند اراده کند که این جوهر را صورت طلا بپوشاند، صورت سنگ را از آن برمی‌کند و صورت طلا را به آن می‌پوشاند. پس جوهر یا جسمی که سنگ بود، طلا ظاهر می‌شود. همان‌گونه که حرارت را از جسم گرم برمی‌کند و سردی را به آن می‌پوشاند، پس سرد می‌شود. پس عین حرارت به سردی دگرگون نشده است، و جسم سرد همان جسمی است که گرم بود. پس اعیان دگرگون نشده‌اند.\n\nهمچنین حکایت علیم: جوهری که صورت طلا را هنگام ضربه پذیرفت، همان جوهری بود که صورت سنگ را پذیرفته بود، و جوهر همان جوهر است. پس سنگ طلا نشده و طلا سنگ نشده است. همان‌گونه که جوهر هیولانی (الجوهر الهيولاني) صورت آب را پذیرفت و بدون شک به آن آب گفته شد. اگر آن را در دیگ بگذاری و بر آتش بجوشانی تا بخار شود، قطعاً می‌دانی که صورت آب از آن زائل شده و صورت بخار را پذیرفته است. پس به دنبال صعود به عنصر اعظم خود است، همان‌گونه که وقتی صورت آب در آن بود، به دنبال عنصر اعظم خود بود و به سمت پایین می‌رفت.\n\nاین معنای سخن علیم در این منزل مختص به اولیاء و همت است که مجاور علم معجزه است، که اعیان دگرگون نمی‌شوند. و سخن او: «لحقیقتک بربک» (به حقیقت خودت به واسطه پروردگارت)، یعنی اگر به حقیقت خودت بنگری، خود را بنده‌ای محض، عاجز، مرده، ضعیف و معدوم می‌یابی که وجودی نداری، مانند همین جوهر که تا زمانی که صورت‌ها را نپوشد، عینی در هستی (الوجود) برایش ظاهر نمی‌شود.\n\nپس این بنده صورت‌های اسماء الهی را می‌پوشد و عین او به واسطه آن‌ها ظاهر می‌شود. اولین اسمی که می‌پوشد، هستی (الوجود) است، پس برای خودش موجود ظاهر می‌شود تا هر آنچه را که موجود می‌تواند بپذیرد، بپذیرد. پس تمام آنچه را که حق (الحق) از اسماء الهی بر او می‌پوشاند، می‌پذیرد. در آن هنگام به حی، قادر، علیم، مرید، سمیع، بصیر، متکلم، شکور، رحیم، خالق، مصور و تمام اسماء متصف می‌شود. همان‌گونه که این جسم به سنگ، طلا، نقره، مس، آب و هوا متصف شد. و حقیقت جسمیت از هیچ یک زائل نمی‌شود، با وجود این صفات. همچنین حقیقت بنده بودن و انسان بودن از انسان زائل نمی‌شود، با وجود این اسماء الهی در او.\n\nاین معنای سخن اوست: «لحقیقتک بربک» (به حقیقت خودت به واسطه پروردگارت)، یعنی به دلیل ارتباط حقیقت تو با پروردگارت، از صورتی الهی که در آن ظاهر شوی، خالی نیستی. همچنین این جسم از صورتی که در آن ظاهر شود، خالی نیست. و همان‌گونه که تو به واسطه صورت‌های اسماء الهی متنوع می‌شوی و بر حسب هر صورت، اسمی غیر از اسم دیگر بر تو اطلاق می‌شود، همچنین بر این جوهر، اسم سنگ بودن و طلا بودن اطلاق می‌شود، برای وصف نه برای عین آن.\n\nپس سه قسم نقض عادات (خرق العوائد) که ذکر کردیم، یعنی معجزات، کرامات و سحر، برایت روشن شد. و نقض عادتی بیش از این وجود ندارد. و منظور من از کرامات (الکرامات) تنها آن چیزی است که از نیروی همت ظاهر می‌شود. منظورم از این اصطلاح در این موضع، تقریب الهی برای این شخص نیست، زیرا ممکن است آن استدراج و مکر باشد. بلکه نام کرامت را بر آن اطلاق کردم، چون غالب است و مکر در آن بسیار کم است.\n\nپس این منزل مجاور آیات پیامبران (علیهم السلام) است و آن علم جزئی از علوم کائنات است. مجاور سحر نیست. زیرا کرامت ولی و نقض عادت او تنها به واسطه پیروی از رسول و جاری شدن بر سنت او بوده است. پس گویی آن کرامت از آیات آن پیامبر است، زیرا به واسطه پیروی از او برای کسی که به پیروی محقق شده، ظاهر گشته است. به همین دلیل مجاور آن شده است.\n\nپس اقطاب این منزل، هر ولی‌ای است که نقض عادتی از او ظاهر شده باشد، بدون همت خودش. پس او به نبوت نزدیک‌تر است از کسی که نقض عادت از او به واسطه همتش ظاهر شده است. و پیامبران بر اصل خود بنده هستند. همچنین اقطاب این منزل. هر چه احوال تو به احوال پیامبران (علیهم السلام) نزدیک‌تر باشد، در عبودیت استوارتر خواهی بود و حجت برای تو خواهد بود و شیطان بر تو سلطه‌ای نخواهد داشت، چنانکه خداوند متعال می‌فرماید: إِنَّ عِبادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ (همانا بر بندگان من سلطه‌ای نداری). و می‌فرماید: يَسْلُكُ من بَيْنِ يَدَيْهِ ومن خَلْفِهِ رَصَداً (از پیش رو و پشت سرش نگهبانانی می‌گمارد). پس شیطان در آن‌ها اثری ندارد. همچنین کسی که به آن‌ها نزدیک باشد.\n\nو چون این مشهد را مشاهده کردم، گفتم:\n\nقصیده‌ای که آغازش این است:\n> فرشتگان شبانه بر قلبم فرود آمدند، *** و بر گرد آن چرخیدند، مانند دایره قلب.\n> از بیم آنکه آن ملعون (شیطان) ببیند *** نزول علوم غیب عیناً بر قلب را، القایی نکند.\n> و این حفظ خداوند در مرحله‌ای مانند مرحله ماست، *** و عصمت او در پیامبران بدون شک است.\n\nقصیده به طور کامل در ابتدای باب سیصد و سی‌ام این کتاب ذکر شده است.\n\n### [روحانی شدن اجساد و جسمانی شدن ارواح]\n\nو ترتیب این باب همان است که از مراتب نقض عادات (خرق العوائد) ذکر کردیم. اما آنچه در آن از غرایب است، ملحق شدن بشر به روحانیان در تمثل (به صورت مثالی) و ملحق شدن روحانیان به بشر در صورت، و ظهور صورتی از آن‌ها شبیه صورتی است که به آن تمثل می‌یابند. خداوند متعال می‌فرماید: فَتَمَثَّلَ لَها بَشَراً سَوِيًّا (پس برای او به صورت بشری کامل مجسم شد). او روح نامیده می‌شود، همان‌گونه که جبرئیل روح است. پس مردگان را زنده می‌کند، همان‌گونه که جبرئیل زنده می‌کند.\n\nابن عباس گفته است: جبرئیل (علیه السلام) هرگز قدم بر جایی از زمین نگذاشت، مگر اینکه آن موضع زنده شد. به همین دلیل سامری هنگامی که جبرئیل را شناخت، وقتی نزد موسی آمد، مشتی از اثر او برداشت. او می‌دانست که هر چیزی که قدم او بر آن نهاده شود، زنده می‌شود. پس مشتی از اثر رسول (جبرئیل) برداشت و آن را در گوساله‌ای که ساخته بود، انداخت، و آن گوساله زنده شد. و این القایی از شیطان در نفس سامری بود، زیرا شیطان منزلت ارواح را می‌داند. پس سامری این نیرو را در خود یافت و ندانست که آن از القائات ابلیس است. پس گفت: وكَذلِكَ سَوَّلَتْ لِي نَفْسِي (و این‌گونه نفس من برایم آراست). و ابلیس این کار را از حرص خود بر گمراهی او انجام داد، به واسطه اعتقادی که سامری به شریک برای خداوند متعال داشت.\n\nپس عیسی (علیه السلام) در معنا، اسم و صورت تمثل یافته، بر صورت جبرئیل خارج شد. پس بشر به روحانی ملحق شد و روحانی در یک واقعه به صورت بشر ملحق شد. و این مقدار از این باب کافی است، زیرا باب گسترده‌ای برای مریم و آسیه است. برای حقایق رسولان (علیهم السلام) در آن میدان وسیعی است، زیرا آن منزل کمال است. کسی که آن را به دست آورد، بر هم‌نوعان خود سروری می‌کند و بر صاحب جلال و جمال حاکم ظاهر می‌شود. و این از مقامات ابویزید بسطامی و افراد (اوتاد) است.\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند).\n\nجزء بیست و یکم به پایان رسید."
  },
  "page_count": 5
}