{
  "id": 246,
  "title": {
    "ar": "الباب السادس والأربعون ومائتان في السكر",
    "en": "Chapter Two Hundred and Forty-Six, Concerning Intoxication (السكر)",
    "ur": "باب نمبر دو سو چھیالیس: سکر (السکر) کے بیان میں",
    "fa": "باب دویست و چهل و ششم در سُکر (سکر)"
  },
  "content": {
    "ar": "## «الباب السادس والأربعون ومائتان في السكر»\n\n\n> السكر أقعدني على العرش *** المحيط المستدير\n\n\n> وأنا بقاع قرقر *** من كل ما يغني فقير\n\n\n> والسكر من خمر الهوى *** والسكر من نظر المدير\n\n\n> قد قال قبلي شاعر *** وهو العليم به الخبير\n\n\n> فإذا سكرت فإنني *** رب الخورنق والسرير\n\n\n> وإذا صحوت فإنني *** رب الشويهة والبعير\n\n\nقال تعالى وأَنْهارٌ من خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وهو علم الأحوال ولهذا يكون لمن قام به الطرب والالتذاذ وأما حدهم له بأنه غيبة بوارد قوي فما هو غيبة إلا عن كل ما يناقض السرور والطرب والفرح وتجلى الأماني صورا قائمة في عين صاحب هذا الحال ورجال الله تعالى في حال السكر على مراتب نذكرها إن شاء الله‏\n\n\nفسكر طبيعي‏\n\n\nوهو ما تجده النفوس من الطرب والالتذاذ والسرور والابتهاج بوارد الأماني إذا قامت الأماني له في خياله صورا قائمة لها حكم وتصرف يقول شاعرهم‏\n\n\n> فإذا سكرت فإنني *** رب الخورنق والسرير\n\n\nفإنه كان يرى ملكه لذينك غاية مطلوبه فلما سكر قامت له صورة الخورنق والسرير ملكا له يتصرف فيه في حضرة تخيله وخياله أعطاه إياه حال السكر فإن له أثرا قويا في القوة المتخيلة قالوا قفون من أهل الله مع الخيال لهم هذا السكر الطبيعي فإنهم لا يزالون يراقبون ما تخيلوا تحصيله من الأمور المطلوبة لهم من الله حتى يتقوى عندهم ذلك ويحكم عليهم مثل‏\n\n\nقوله عليه السلام اعبد الله كأنك تراه‏\n\n\nوقوله صلى الله عليه وسلم أيضا إن الله في قبلة المصلي‏\n\n\nوقول الصاحب لرسول الله صلى الله عليه وسلم وقد سأله صلى الله عليه وسلم عن حقيقة إيمانه حين قال أنا مؤمن حقا فقال رضي الله عنه كأني أنظر إلى عرش ربي بارزا\n\n\nيعني في يوم القيامة فجاء بما تعطيه حضرة الخيال فإذا تقوى مثل هذا التخيل أسكر النفس وقامت له صورة ما تخيل ينظر إليها بعينه ويخبر عنها كرؤية صاحب الرؤيا سواء وتلقي إليه ويصغي إليها وهو لا يعلم أنه يخاطب ويشاهد صورة خيالية بل يقطع أن ذلك شهود حسي فإذا صحا من ذلك السكر ارتفع عنه ذلك الأمر من حيث صورته مع بقاء تخيله عند بعض الناس ممن يتذكر ذلك في الذهن كما يرتفع عنه صورة ما رأى في النوم بالانتباه ومن أهل هذا المقام من يبقي الله له تلك الصورة المتخيلة في حال صحوه فيثبتها له محسوسة بعد ما كانت متخيلة كالجنة التي خيلها إبليس في الخيال المنفصل لسليمان عليه السلام ليفتنه بها ولا علم لسليمان عليه السلام بذلك فسجد شكر الله تعالى حيث أتحفه بها فأبقاها الله له جنة محسوسة يتنعم بها ورجع إبليس خاسرا لأنه أراد بذلك فتنته وما علم أن أهل الله إذا وقع لهم مثل هذا أنه يحدث ذلك عبادة لله عندهم هذا والمخيل عدو فكيف حالهم إذا كان خيالهم منهم وليسوا بأعداء نفوسهم فإنهم يسعون في خلاصها ونجاتها فإذا كان سكرهم الطبيعي أثمر لهم مثل هذا فما ظنك بما فوقه من مراتب الإسكار\n\n\nوأما السكر العقلي‏\n\n\nفهو شبيه بالسكر الطبيعي في رد الأمور إلى ما تقتضيه حقيقته لا إلى‏\nما يقتضيه الأمر في نفسه ويأتي الخبر الإلهي عن الله لصاحب هذا المقام بنعوت المحدثات إنها نعت لله فيأبى قبولها على هذا الوجه لأنه في سكرة دليله وبرهانه فيرد ذلك الخبر لما يقتضيه نظره مع جهله بذات الحق وهل تقبل هذا النعت أو لا تقبله بل تخيل أنها لا تقبله فيمد رجله هذا العقل لسكره في غير بساطه فوقع في الحق بسكره ويعذره الحق في ذلك لأن السكران غير مؤاخذ بما ينطق فجرد عن الله ما نسبه الحق لنفسه فإذا صحا هذا العاقل عن سكره بالإيمان لم يرد الخبر الصدق والقول الحق وقال إن الحق أعلم بنفسه وبما ينسبه إليه من العقل فإن العقل مخلوق والمخلوق لا يحكم على الخالق فإنه ما من مصنوع إلا ويجهل صانعه فإن الشقة تجهل صانعها وهو الحائك كذلك الأركان مع الأفلاك وكذلك الأفلاك مع النفس والنفس مع العقل وكذلك العقل مع الله وغاية ما علم من علم منهم افتقاره إليه واستناده في وجوده إلى صانعه ولا يحكم عليه بشي‏ء ولا سيما إن أخبر الصانع عن نفسه بأمور فليس للمصنوع إلا قبولها فإن ردها فلسكر قام به فخمره الذي يشرب إنما هو دليله وبرهانه ويقويه على ذلك ما تعطيه بعض الأخبار الإلهية من النعوت في حقه الموافقة لبرهانه ودليله فهذا سكر عقلي فالسكر الطبيعي سكر المؤمنين والسكر العقلي سكر العارفين‏\n\n\nوبقي سكر الكمل من الرجال وهو السكر الإلهي‏\n\n\nقال فيه رسول الله صلى الله عليه وسلم اللهم زدني فيك تحيرا\n\n\nوالسكران حيران فالسكر الإلهي ابتهاج وسرور بالكمال وقد يقع في التجلي في الصور سكر بحق قال بعضهم‏\n\n\n> وأسكر القوم دور كأس *** وكان سكرى من المدير\n\n\nفمن أسكره الشهود فلا صحو له البتة وكل حال لا يورث طربا وبسطا وإدلالا وإفشاء أسرار إلهية فليس بسكر وإنما هو غيبة أو فناء أو محق ولا يقاس سكر القوم في طريق الله على سكر شارب الخمر فإنه ربما أورث بعض من يشربه غما وبكاء وفكرة وذلك لما يقتضيه مزاج ذلك الشارب ويسمونه سكران ومثل هذا لا يكون في سكر الطريق وقليل من الناس من يفرق بين الحيوان والسكران وعندنا في العلم الطبيعي أن شارب الخمر إذا أورثه غما وبكاء وحزنا وفكرة وإطراقا لما يقتضيه طبعه ومزاجه فليس بسكران ولا هو صاحب سكر فإن بعض الأمزجة لا تقبل السكر ولا أثر له فيها فغيبة السكران ليست عن إحساسه وإنما غيبته عن مقابل الطرب لا غير ونظير هؤلاء الذين لا يطربون نظير أصحاب الفكرة والغيبة والفناء ويفارق السكر سائر الغيبات لأن الصحو لا يكون إلا عن سكر والسكر يتقدم صحوه وليس الحضور مع الغيبة كذلك ولا الفناء مع البقاء كذلك لكنه مثل الصعق مع الإفاقة والنوم مع اليقظة فإن النوم مقدم على الانتباه والغشية متقدمة على الإفاقة وإنما ذكرنا هذا التفصيل من أجل مذهبهم في حد السكر أنه غيبة بوارد قوي فأطلقوا عليه اسم الغيبة فيتخيل من لا ذوق له أن حكمه حكم الغيبة فيقيس فيخطئ في تربيته للمريد إن كان من المتشيخين فيلتبس عليه الأمر فلا يفرق في حال المريد بين سكره وغيبته وفنائه والسكران في هذا الطريق لا يغيب عن إحساسه فإن غاب كما يراه الحنفيون في سكر شارب الخمر فقد انتقل عندنا من حال السكر إلى حال فناء أو غيبة أو محق ولم يعقب سكره صحو بل انتقل من حال سكر إلى حال فناء أو غيره من الأحوال المغيبة عن بعضه أو كله ولا يتخيل أن السكر لما كان على هذه المراتب المتميزة أنه يمكن أن يكون لصاحب هذه الحال سكران أو يجمعها كلها لما هو عليه من الحقائق كما قررنا في بعض المسائل من جمع الإنسان لأمور كثيرة لحقائق تطلبها منه ولا سيما وقد أنشد بعض من أسكره الخمر والهوى فقال‏\n\n\n> سكران سكر هوى وسكر مدامة *** فتى يفيق فتى به سكران‏\n\n\nفأخبر أنه قام به سكران وسكر هل الله ليس كذلك فإن المعرفة تمنع منه فإن السكران الإلهي لا يتمكن أن يكون له السكر العقلي فإن الشهود يمنع من ذلك والسكران بالسكر العقلي لا يتمكن له أن يتمكن منه السكر الطبيعي فإن دليله ينفيه فإنه إذا كان يرد حكم\n\n\nالسكر الإلهي فكيف يقبل حكم السكر الطبيعي وإنما السكران من أهل الله يرتقي في سكره من سكر إلى سكر لا يجمع بينهما مثل ما قال هذا الشاعر وما استشهد به في الطريق إلا صاحب قياس لا صاحب ذوق فمن أسكره السكر الطبيعي ثم جاءه السكر العقلي فإن السكر الطبيعي يفارق المحل بالضرورة ويزول حكمه عن صاحبه وما هو الأمر في هذه الإسكارات بالتدريج قد يوهب الإنسان السكر ابتداء أعني السكر الإلهي فلا يمكن أن يكون له ذوق السكر\nالعقلي أبدا لكنه قد يكون له العلم به وبمرتبته من غير أن يكون له أثر فيه وهو الذوق وقد يوهب السكر العقلي ابتداء ذوقا فلا يتمكن له أن يكون له ذوق في السكر الطبيعي لكن قد يتنقل إلى السكر الإلهي ذوقا فيزول عنه حكم السكر العقلي ذوقا وحالا ويبقى له العلم به من طريق الذوق لأنه قد تقدمه ذوقه قبل أن ينتقل فهكذا هو الأمر في سكر أهل الطريق في الإلهيات وأما في غير الإلهيات فقد يمكن أن يجمع بين السكرين في الصورة وإذا حققت الأمر فيه وجدته على خلاف ذلك فإنه قد يتخيل في الإنسان أنه إذا علم شيئا فهو صاحب ذوق له وليس الأمر كذلك فإن الذوق لا يكون إلا عن تجل والعلم قد يحصل بنقل الخير الصادق الصحيح فهكذا فلتعرف طريق الله يا ولي فقد أعطيتك ميزان الأمور في هذه المقامات وأريتك مستندها وما تجد هذا البيان في غير هذا الكتاب في كلام هذه الطائفة إلا أن تكون إشارات منهم إلى ذلك في بعض ما ينقل عنهم فإنهم عالمون به ضرورة إذا كانوا أصحاب ذوق وهم أصحاب ذوق إذ لا يكون منهم إلا من هو صاحب ذوق فالطبع يشهده فيسكر والعقل يشهده فيسكر والسر يشهده فيسكر ولا تجتمع هذه الإسكارات أبدا لا حد في وقت واحد وإن كان الكل من أهل الله كما أن الظالم لنفسه ما هو مقتصد فيما هو ظالم ولا سابق فيما هو مقتصد مع كون كل واحد منهم مصطفى من ورثة الكتاب الإلهي بل يعطي الكشف الصحيح أنه لا يكون ظالما لنفسه من ذاق الاقتصاد وكذا ما بقي من غير تقييد فإن حكم الأذواق في الأمور وحصول العلم عنها ما هو مثل حكم سائر الطرق فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ ولَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ‏\n\n",
    "en": "## Chapter Two Hundred and Forty-Six: Concerning Intoxication (السكر)\n\n> Intoxication seated me upon the encompassing, circular Throne,\n> While I, in a barren valley, am poor regarding all that enriches.\n> And the intoxication is from the wine of passion (الهوى),\n> And the intoxication is from the gaze of the Director (المدير).\n\n> A poet before me has said—and he is the Knower, the Expert concerning it:\n> \"When I am intoxicated, then I am the lord of Khawarnaq and the Throne,\n> And when I am sober, then I am the lord of the ewe and the camel.\"\n\nThe Exalted said: <<وَأَنْهَارٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشَّارِبِينَ>> (And rivers of wine, a delight to those who drink). This [Intoxication] is the science of spiritual states (علم الأحوال), and for this reason, it belongs to the one who experiences joy (الطرب) and delight (الالتذاذ). As for their definition of it as an absence (غيبة) caused by a powerful incoming spiritual influx (وارد قوي), it is not an absence except from everything that contradicts happiness, joy, and delight, and the manifestation of hopes (الأماني) as standing forms in the eye of the possessor of this state. The Men of God (رجال الله) are in degrees (مراتب) concerning the state of Intoxication, which we shall mention, God willing.\n\n### Natural Intoxication (سكر طبيعي)\n\nThis is the joy, delight, happiness, and elation that souls find through the influx of hopes when those hopes stand before them in their imagination (خيال) as established forms that possess authority and action. Their poet says:\n\n> \"When I am intoxicated, then I am the lord of Khawarnaq and the Throne.\"\n\nThis is because he considered his dominion over those two things to be the ultimate object of his desire. When he became intoxicated, the image of Khawarnaq and the Throne stood before him as his kingdom, in which he acted within the Presence of his conceptualization (تخيل) and his Imagination (خيال), which the state of Intoxication granted him, for it has a powerful effect on the imaginative faculty (القوة المتخيلة).\n\nThey said that a group of the People of God (أهل الله) who are associated with the Imagination possess this Natural Intoxication. They continuously observe what they have imagined achieving of the things they seek from God until that conceptualization becomes strong within them and dominates them, such as the Prophet’s saying, peace be upon him: \"Worship God as if you see Him,\" and his saying, peace be upon him, also: \"Indeed, God is in the direction of the worshipper’s prayer (قبلة).\" And the saying of the Companion to the Messenger of God, peace be upon him, when the Prophet asked him about the reality of his faith after he had said, \"I am truly a believer,\" and the Companion, may God be pleased with him, replied: \"It is as if I am looking at the Throne of my Lord, manifest,\" meaning on the Day of Resurrection. Thus, he brought forth what the Presence of Imagination (حضرة الخيال) grants.\n\nWhen such conceptualization is strengthened, it intoxicates the soul, and the image of what was conceptualized stands before it. The person looks at it with his eye and speaks about it, exactly like the vision of the dreamer. It speaks to him, and he listens to it, yet he does not know that he is addressing and witnessing an imaginary form; rather, he is certain that it is a sensory witnessing (شهود حسي).\n\nWhen he becomes sober (صحا) from that intoxication, that matter is lifted from him in terms of its form, though the conceptualization remains with some people who recall it in the mind, just as the image of what one saw in sleep is lifted upon waking. Among the people of this station (مقام) are those for whom God preserves that conceptualized form in their state of sobriety (صحو) and establishes it for them as something sensible (محسوسة) after it was merely conceptualized, like the Garden that Iblis conceptualized in the separate Imagination (الخيال المنفصل) for Solomon, peace be upon him, to tempt him with it. Solomon, peace be upon him, had no knowledge of this, so he prostrated in thanks to God the Exalted for having bestowed it upon him. God then preserved it for him as a sensible Garden in which he enjoyed bliss. Iblis returned defeated, for he intended to tempt him, but he did not know that when such a thing occurs to the People of God, it generates an act of worship (عبادة) of God in their view.\n\nThis is when the conceptualizer (المخيل) is an enemy; what then is their state when their imagination is from themselves, and they are not enemies of their own souls, for they strive for its salvation and deliverance? If their Natural Intoxication yields such results for them, what do you think of the degrees of Intoxication (الإسكار) above it?\n\n### Intellectual Intoxication (السكر العقلي)\n\nIt is similar to Natural Intoxication in referring matters back to what its reality (حقيقته) necessitates, not to what the matter necessitates in itself. The Divine report (الخبر الإلهي) comes to the possessor of this station (مقام) from God, stating that the attributes of created things (نعوت المحدثات) are attributes of God. He refuses to accept this on this basis because he is in the intoxication of his proof (دليله) and demonstration (برهانه). Thus, he rejects that report based on what his own consideration necessitates, coupled with his ignorance of the Essence (الذات) of the Real (الحق)—whether It accepts this attribute or does not accept it; rather, he conceptualizes that It does not accept it.\n\nThis intellect, due to its intoxication, extends its leg beyond its mat, thus falling into error concerning the Real (الحق) due to its intoxication. The Real excuses him for this because the intoxicated person is not held accountable for what he utters. So, he strips God of what the Real attributed to Himself.\n\nWhen this rational person (العاقل) becomes sober (صحا) from his intoxication through faith (الإيمان), he does not reject the truthful report and the true saying, and he says that the Real is more knowledgeable of Himself and of what He attributes to Himself than the intellect (العقل). For the intellect is created (مخلوق), and the created does not judge the Creator. There is no artifact (مصنوع) that does not ignore its maker. The cloth ignores its maker, who is the weaver; likewise, the elements (الأركان) with the celestial spheres (الأفلاك), and likewise the celestial spheres with the Soul (النفس), and the Soul with the Intellect, and likewise the Intellect with God. The utmost knowledge attained by those who know is their awareness of their need for Him and their reliance on their Maker for their existence. They do not judge Him concerning anything, especially if the Maker informs about Himself concerning certain matters. The artifact has no choice but to accept them. If it rejects them, it is due to an intoxication that has overcome it. The wine that he drinks is nothing but his proof and his demonstration. He is strengthened in this by what some Divine reports grant concerning attributes regarding the Real that conform to his demonstration and proof.\n\nThis, then, is Intellectual Intoxication (سكر عقلي). Natural Intoxication is the intoxication of the believers (المؤمنين), and Intellectual Intoxication is the intoxication of the Gnostics (العارفين).\n\n### Divine Intoxication (السكر الإلهي)\n\nThere remains the Intoxication of the Perfect Men (الكمل من الرجال), which is Divine Intoxication (السكر الإلهي). Concerning it, the Messenger of God, peace be upon him, said: \"O God, increase my perplexity (تحير) in You.\" The intoxicated person (السكران) is perplexed (حيران). Divine Intoxication is elation and happiness in Perfection (الكمال). Intoxication may truly occur during the Theophany (التجلي) in forms. One of them said:\n\n> The cup's circulation intoxicated the people,\n> But my intoxication was from the Director (المدير).\n\nWhoever is intoxicated by Witnessing (الشهود) has no sobriety (صحو) whatsoever. Any state that does not yield joy (طرب), expansion (بسط), familiarity (إدلال), and the disclosure of Divine secrets (أسرار إلهية) is not Intoxication; rather, it is Absence (غيبة), Annihilation (فناء), or Effacement (محق).\n\nThe intoxication of the People [of the Path] in the Way of God is not to be compared to the intoxication of the wine drinker, for the latter may sometimes cause grief, weeping, and deep thought in some who drink it, due to the temperament (مزاج) of that drinker. They call such a person intoxicated, but this kind of state does not occur in the intoxication of the Path. Few people distinguish between the living and the intoxicated. In our natural science (العلم الطبيعي), if wine drinking causes grief, weeping, sorrow, deep thought, and silence due to the demands of his nature and temperament, he is neither intoxicated nor the possessor of intoxication, for some temperaments do not accept intoxication and it has no effect on them. The absence (غيبة) of the intoxicated person is not from his sensation (إحساسه); rather, his absence is only from the opposite of joy. Those who do not experience joy are similar to the people of deep thought, Absence, and Annihilation.\n\nIntoxication differs from all other states of Absence because Sobriety (الصحو) only occurs after Intoxication, and Intoxication precedes its Sobriety. Presence (الحضور) with Absence is not like that, nor is Annihilation (الفناء) with Subsistence (البقاء) like that. Rather, it is like swooning (الصعق) with recovery (الإفاقة), and sleep with wakefulness, for sleep precedes waking up, and fainting precedes recovery.\n\nWe have mentioned this detail because of their doctrine regarding the definition of Intoxication as \"an absence caused by a powerful influx.\" They applied the name Absence (غيبة) to it, so one who lacks direct experience (ذوق) imagines that its ruling is the same as the ruling of Absence, and thus he makes an analogy and errs in the spiritual training (تربية) of the novice (مريد) if he is one of the pseudo-shaykhs. The matter becomes confused for him, and he does not distinguish between the novice’s Intoxication, his Absence, and his Annihilation.\n\nThe intoxicated person on this Path does not lose his sensation. If he loses it, as the Hanafis see in the intoxication of the wine drinker, then in our view, he has moved from the state of Intoxication to a state of Annihilation, Absence, or Effacement (محق). His Intoxication is not followed by Sobriety; rather, he has moved from a state of Intoxication to a state of Annihilation or another state that causes absence from part or all of himself.\n\nIt should not be imagined that since Intoxication is of these distinct degrees, the possessor of this state can have two intoxications or combine them all, due to the realities (حقائق) he possesses, as we established in some issues concerning the human being combining many matters due to realities demanded of him—especially since one who was intoxicated by wine and passion recited:\n\n> Intoxicated by the intoxication of passion and the intoxication of wine,\n> A youth who recovers, a youth who is intoxicated by two.\n\nHe reported that two intoxications overcame him. The Intoxication of God (سكر هل الله) is not like that, for Gnosis (المعرفة) prevents it. The Divinely Intoxicated person (السكران الإلهي) cannot possess Intellectual Intoxication (السكر العقلي), for Witnessing (الشهود) prevents that. And the person intoxicated by Intellectual Intoxication cannot possess Natural Intoxication (السكر الطبيعي), for his proof negates it. If he rejects the ruling of Divine Intoxication, how can he accept the ruling of Natural Intoxication?\n\nRather, the intoxicated person among the People of God ascends in his intoxication from one intoxication to another, not combining them as this poet said. No one uses this as evidence on the Path except a person of analogy (قياس), not a person of direct experience (ذوق).\n\nIf someone is intoxicated by Natural Intoxication and then Intellectual Intoxication comes to him, the Natural Intoxication necessarily leaves the locus and its ruling ceases for its possessor.\n\nThe matter in these intoxications is not necessarily gradual. A person may be granted Intoxication initially—I mean Divine Intoxication—and then he can never have the taste (ذوق) of Intellectual Intoxication. However, he may have knowledge (العلم) of it and its degree without having its effect, which is the direct experience.\n\nConversely, one may be granted Intellectual Intoxication initially as a direct experience. He cannot then have a direct experience of Natural Intoxication. However, he may transition to Divine Intoxication as a direct experience, in which case the ruling of Intellectual Intoxication departs from him, both as a direct experience and as a state, though the knowledge of it remains with him through the path of direct experience, because his direct experience preceded his transition.\n\nThis is the case concerning the intoxication of the People of the Path regarding Divine matters (الإلهيات). As for non-Divine matters, it may be possible to combine the two intoxications in appearance, but if you verify the matter, you will find it to be otherwise. It may be imagined that if a person knows something, he is the possessor of a direct experience (ذوق) of it, but the matter is not so, for direct experience only occurs through a Theophany (تجل), while knowledge may be obtained through the transmission of a truthful and sound report.\n\nThus, O friend (ولي), you must know the Way of God. I have given you the balance (ميزان) of matters in these stations (مقامات) and shown you their basis. You will not find this explanation in the discourse of this group (الطائفة) outside of this book, unless it be in the form of allusions from them in some of what is transmitted from them, for they necessarily know it if they are people of direct experience (أصحاب ذوق), and they are people of direct experience, since none of them exists except one who is a person of direct experience.\n\nThe nature (الطبع) witnesses it and becomes intoxicated; the intellect (العقل) witnesses it and becomes intoxicated; and the secret (السر) witnesses it and becomes intoxicated. These intoxications never combine for anyone at one time, even though all of them are among the People of God (أهل الله). Just as the one who wrongs his soul (الظالم لنفسه) is not moderate (مقتصد) while he is wronging, nor is the foremost (سابق) moderate while he is foremost, despite each of them being chosen from the inheritors of the Divine Book. Rather, sound Unveiling (الكشف الصحيح) grants that the one who has tasted moderation cannot be one who wrongs his soul, and likewise for the rest without restriction. For the ruling of direct experiences (الأذواق) in matters and the acquisition of knowledge from them is not like the ruling of other paths. Know this. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ>> (And Allah speaks the Truth, and He guides to the Way. And if He had willed, He would have guided you all). And praise be to God, Lord of the Worlds.",
    "ur": "باب نمبر دو سو چھیالیس: سکر (Intoxication) کے بیان میں\n\nسکر نے مجھے اس محیط، گول عرش پر بٹھا دیا ہے\nاور میں ہر اس چیز سے جو بے نیاز کرتی ہے، ایک فقیر کی طرح گہری وادی میں ہوں\nاور سکر عشق کی شراب سے ہے، اور سکر ساقی کے دیدار سے ہے\nمجھ سے پہلے ایک شاعر نے کہا تھا، اور وہ اس کا جاننے والا اور باخبر ہے:\n\"جب میں سکر میں ہوتا ہوں تو میں خورنق اور تخت کا مالک ہوتا ہوں\nاور جب میں صحو میں ہوتا ہوں تو میں چھوٹی بکری اور اونٹ کا مالک ہوتا ہوں\"\n\nاللہ تعالیٰ نے فرمایا: وَأَنْهَارٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشَّارِبِينَ (اور شراب کی نہریں جو پینے والوں کے لیے لذیذ ہوں گی۔) یہ (سکر) احوال کا علم ہے، اور اسی لیے یہ اس شخص کے لیے ہوتا ہے جس میں طرب (جذبہ) اور التذاذ (لذت) پیدا ہو۔ جہاں تک اس کی تعریف کا تعلق ہے کہ یہ کسی قوی وارد (وارد) کے ذریعے غیبت ہے، تو یہ غیبت صرف ہر اس چیز سے ہوتی ہے جو سرور، طرب اور فرحت کے منافی ہو۔ اور آرزوئیں اس حال کے حامل کی آنکھ میں قائم صورتوں کی شکل میں ظہور پذیر ہوتی ہیں۔ اور اللہ تعالیٰ کے رجال (مردان خدا) سکر (Intoxication) کی حالت میں مختلف مراتب پر ہوتے ہیں جن کا ذکر ہم ان شاء اللہ کریں گے۔\n\n**سکر طبیعی (سكر طبيعي)**\n\nیہ وہ ہے جو نفوس کو طرب، التذاذ، سرور اور خوشی کی صورت میں محسوس ہوتا ہے جب آرزوئیں کسی وارد کے ذریعے ان کے تخیل (الخيال) میں قائم صورتوں کی شکل میں ظاہر ہوتی ہیں جن کا اپنا حکم اور تصرف ہوتا ہے۔ ان کا شاعر کہتا ہے:\n\nفَإِذَا سَكِرْتُ فَإِنَّنِي *** رَبُّ الْخَوَرْنَقِ وَالسَّرِيرِ\n(جب میں سکر میں ہوتا ہوں تو میں خورنق اور تخت کا مالک ہوتا ہوں۔)\n\nکیونکہ وہ ان دونوں کی بادشاہت کو اپنی آخری مطلوبہ منزل سمجھتا تھا۔ جب وہ سکر میں آیا تو خورنق اور تخت کی صورت اس کے لیے بادشاہت کی شکل میں قائم ہو گئی، جس میں وہ اپنے تخیل (الخيال) کی حضوری میں تصرف کرتا ہے۔ یہ اسے سکر کی حالت نے عطا کیا، کیونکہ اس کا قوت متخیلہ (Imagination) پر قوی اثر ہوتا ہے۔ انہوں نے کہا کہ اہل اللہ میں سے وہ لوگ جو تخیل (الخيال) کے ساتھ کھڑے ہوتے ہیں، ان کے لیے یہ سکر طبیعی (سكر طبيعي) ہوتا ہے۔ وہ ہمیشہ ان مطلوبہ امور کے حصول کی نگرانی کرتے رہتے ہیں جن کا انہوں نے اللہ سے تخیل کیا ہے، یہاں تک کہ وہ ان کے نزدیک قوی ہو جاتے ہیں اور ان پر حکم لگاتے ہیں۔ جیسے کہ آپ صلی اللہ علیہ وسلم کا فرمان ہے: اعبد الله كأنك تراه (اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو۔) اور آپ صلی اللہ علیہ وسلم کا یہ فرمان بھی: إن الله في قبلة المصلي (بے شک اللہ نمازی کے قبلہ میں ہے۔) اور صحابی کا رسول اللہ صلی اللہ علیہ وسلم سے جواب، جب آپ صلی اللہ علیہ وسلم نے ان کے ایمان کی حقیقت کے بارے میں پوچھا جب انہوں نے کہا کہ میں سچا مومن ہوں، تو انہوں نے (رضی اللہ عنہ) فرمایا: كأني أنظر إلى عرش ربي بارزا (گویا میں اپنے رب کے عرش کو نمایاں دیکھ رہا ہوں۔) یعنی قیامت کے دن۔\n\nپس وہ ایسی چیز لائے جو حضرۃ الخیال (تخیل کی حضوری) عطا کرتی ہے۔ جب اس طرح کا تخیل (التخيل) قوی ہو جاتا ہے تو وہ نفس کو سکر میں مبتلا کر دیتا ہے، اور جو کچھ اس نے تخیل کیا تھا اس کی صورت اس کے لیے قائم ہو جاتی ہے، جسے وہ اپنی آنکھ سے دیکھتا ہے اور اس کے بارے میں خبر دیتا ہے، بالکل اسی طرح جیسے خواب دیکھنے والا دیکھتا ہے۔ وہ اس سے مخاطب ہوتا ہے اور اس کی طرف کان لگاتا ہے، حالانکہ وہ نہیں جانتا کہ وہ ایک خیالی صورت سے مخاطب ہو رہا ہے اور اسے دیکھ رہا ہے، بلکہ وہ یقین کرتا ہے کہ یہ حسی شہود (حسی مشاہدہ) ہے۔ جب وہ اس سکر سے صحو (الصحو) میں آتا ہے تو وہ امر اس کی صورت کے لحاظ سے اس سے اٹھ جاتا ہے، البتہ بعض لوگوں میں اس کا تخیل باقی رہتا ہے جو اسے ذہن میں یاد رکھتے ہیں، جیسے بیدار ہونے پر نیند میں دیکھی ہوئی صورت اٹھ جاتی ہے۔ اور اس مقام کے اہل میں سے بعض ایسے ہیں جن کے لیے اللہ تعالیٰ اس متخیلہ صورت کو ان کی حالت صحو (الصحو) میں بھی باقی رکھتا ہے، اور اسے ان کے لیے محسوس بنا دیتا ہے، جبکہ پہلے وہ متخیلہ تھی۔ جیسے وہ جنت جسے ابلیس نے سلیمان علیہ السلام کے لیے تخیل منفصل (الخيال المنفصل) میں ظاہر کیا تھا تاکہ انہیں فتنے میں ڈالے، اور سلیمان علیہ السلام کو اس کا علم نہ تھا۔ پس انہوں نے اللہ تعالیٰ کا شکر ادا کرتے ہوئے سجدہ کیا کہ اس نے انہیں یہ عطا کی، تو اللہ نے اسے ان کے لیے ایک محسوس جنت بنا دیا جس سے وہ لطف اندوز ہوتے تھے۔ اور ابلیس خسارے میں واپس لوٹا، کیونکہ اس نے اس سے ان کو فتنے میں ڈالنا چاہا تھا، اور اسے یہ علم نہ تھا کہ جب اہل اللہ کو ایسا کچھ پیش آتا ہے تو وہ ان کے نزدیک اللہ کی عبادت کا سبب بن جاتا ہے۔ یہ تو تب ہے جب متخیل (ابلیس) دشمن ہو، تو ان کا کیا حال ہو گا جب ان کا خیال ان کی اپنی ذات سے ہو اور وہ اپنے نفوس کے دشمن نہ ہوں؟ کیونکہ وہ ان کی نجات اور خلاصی کے لیے کوشاں رہتے ہیں۔ پس جب ان کا سکر طبیعی (سكر طبيعي) اس طرح کا نتیجہ دیتا ہے، تو تم اس سے اوپر کے مراتب اسکار (Intoxication) کے بارے میں کیا گمان کرتے ہو؟\n\n**سکر عقلی (السكر العقلي)**\n\nسکر عقلی (السكر العقلي) سکر طبیعی (السكر الطبيعي) سے مشابہت رکھتا ہے اس لحاظ سے کہ یہ امور کو ان کی حقیقت کے تقاضے کی طرف لوٹاتا ہے نہ کہ اس کے تقاضے کی طرف جو امر بذات خود ہے۔ اس مقام کے حامل کے لیے اللہ کی طرف سے الٰہی خبر آتی ہے جس میں محدثات (مخلوقات) کی صفات کو اللہ کی صفت قرار دیا جاتا ہے، تو وہ اسے اس صورت میں قبول کرنے سے انکار کر دیتا ہے، کیونکہ وہ اپنے دلیل اور برہان کے سکر میں ہوتا ہے۔ پس وہ اس خبر کو اپنے نظر کے تقاضے کی طرف لوٹاتا ہے، حالانکہ وہ ذات حق (ذات الحق) سے جاہل ہوتا ہے کہ آیا وہ اس صفت کو قبول کرتی ہے یا نہیں، بلکہ وہ تخیل کرتا ہے کہ وہ اسے قبول نہیں کرتی۔ پس یہ عقل اپنے سکر کی وجہ سے اپنے بساط (دائرہ) سے باہر قدم رکھتی ہے، اور اپنے سکر کی وجہ سے حق (الحق) میں واقع ہو جاتی ہے۔ اور حق (الحق) اسے اس میں معذور رکھتا ہے، کیونکہ سکران (نشے میں دھت) شخص اپنے کلام پر مؤاخذہ نہیں کیا جاتا۔ پس اس نے اللہ سے وہ چیزیں الگ کر دیں جو حق نے اپنی ذات سے منسوب کی تھیں۔\n\nجب یہ عاقل ایمان کے ذریعے اپنے سکر سے صحو (الصحو) میں آتا ہے، تو وہ سچی خبر اور قول حق کو رد نہیں کرتا، اور کہتا ہے کہ حق (الحق) اپنی ذات اور ان چیزوں کو جو وہ اپنی طرف منسوب کرتا ہے، عقل سے زیادہ جانتا ہے۔ کیونکہ عقل مخلوق ہے، اور مخلوق خالق پر حکم نہیں لگا سکتی۔ کوئی بھی مصنوع (بنائی ہوئی چیز) ایسی نہیں جو اپنے صانع سے جاہل نہ ہو۔ کپڑا اپنے صانع (جولاہے) سے جاہل ہوتا ہے، اسی طرح ارکان افلاک کے ساتھ، اور افلاک نفس کے ساتھ، اور نفس عقل کے ساتھ، اور اسی طرح عقل اللہ کے ساتھ۔ ان میں سے جس نے علم حاصل کیا، اس کے علم کی انتہا یہ ہے کہ وہ اپنی فقر مندی اور اپنے وجود میں اپنے صانع پر انحصار کو جانتا ہے، اور وہ اس پر کسی چیز کا حکم نہیں لگاتا۔ خاص طور پر اگر صانع اپنی ذات کے بارے میں کچھ امور کی خبر دے، تو مصنوع کے لیے صرف انہیں قبول کرنا ہے۔ اگر وہ انہیں رد کرتا ہے تو یہ اس سکر کی وجہ سے ہے جو اس پر طاری ہوا ہے۔ پس اس کی شراب جو وہ پیتا ہے، وہ اس کی دلیل اور برہان ہے۔ اور اس پر وہ الٰہی خبریں اسے تقویت دیتی ہیں جو اس کے حق میں اس کے برہان اور دلیل کے موافق صفات بیان کرتی ہیں۔ یہ سکر عقلی (السكر العقلي) ہے۔ پس سکر طبیعی (السكر الطبيعي) مومنین کا سکر ہے، اور سکر عقلی (السكر العقلي) عارفین کا سکر ہے۔\n\n**سکر الٰہی (السكر الإلهي)**\n\nاور کاملین رجال کا سکر باقی ہے، جو سکر الٰہی (السكر الإلهي) ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے اس کے بارے میں فرمایا: اللهم زدني فيك تحيرا (اے اللہ! مجھ میں اپنے بارے میں حیرت اور سرگردانی بڑھا دے۔) اور سکران (نشے میں دھت) حیران ہوتا ہے۔ پس سکر الٰہی (السكر الإلهي) کمال کے ساتھ خوشی اور سرور ہے۔ اور کبھی ظہور الٰہی (التجلی) میں صورتوں میں سکر حق کے ساتھ واقع ہوتا ہے۔ بعض نے کہا:\n\nوَأَسْكَرَ الْقَوْمَ دَوْرُ كَأْسٍ *** وَكَانَ سُكْرِي مِنَ الْمُدِيرِ\n(قوم کو جام کے دور نے سکر میں مبتلا کیا، اور میرا سکر ساقی کے دیدار سے تھا۔)\n\nپس جسے شہود (الشہود) نے سکر میں مبتلا کر دیا، اس کے لیے کبھی صحو (الصحو) نہیں ہوتا۔ اور ہر وہ حال جو طرب، انبساط، ادلال (ناز) اور الٰہی اسرار کے افشاء کا باعث نہ بنے، وہ سکر نہیں ہے، بلکہ وہ غیبت (غیبہ) یا فنا (فناء) یا محق (مٹ جانا) ہے۔ قوم کا سکر (Intoxication) طریق اللہ میں شراب پینے والے کے سکر پر قیاس نہیں کیا جا سکتا، کیونکہ شراب پینے والوں میں سے بعض کو غم، رونا اور فکر لاحق ہو جاتی ہے، اور یہ اس پینے والے کے مزاج کے تقاضے کی وجہ سے ہوتا ہے۔ وہ اسے بھی سکران کہتے ہیں۔ اور اس طرح کا سکر طریق (تصوف) کے سکر میں نہیں ہوتا۔ بہت کم لوگ ہیں جو حیوان (بے حس) اور سکران (نشے میں دھت) میں فرق کرتے ہیں۔ ہمارے نزدیک علم طبیعی میں، اگر شراب پینے والے کو غم، رونا، حزن اور فکر لاحق ہو جائے، جو اس کی طبیعت اور مزاج کا تقاضا ہے، تو وہ سکران نہیں ہے اور نہ ہی وہ صاحب سکر ہے۔ کیونکہ بعض مزاج سکر کو قبول نہیں کرتے اور اس کا ان پر کوئی اثر نہیں ہوتا۔ سکران کی غیبت (غیبہ) اس کے احساس سے نہیں ہوتی، بلکہ اس کی غیبت صرف طرب کے مقابل سے ہوتی ہے۔ اور جو لوگ طرب محسوس نہیں کرتے، وہ فکر، غیبت (غیبہ) اور فنا (فناء) کے حاملین کی طرح ہیں۔\n\nسکر دیگر غیبتوں سے اس لیے مختلف ہے کہ صحو (الصحو) صرف سکر کے بعد ہی ہوتا ہے، اور سکر اپنے صحو سے پہلے ہوتا ہے۔ جبکہ حضور (حاضری) غیبت کے ساتھ ایسا نہیں ہے، اور نہ ہی فنا (الفناء) بقا (البقاء) کے ساتھ ایسا ہے۔ بلکہ یہ صعق (بے ہوشی) کا افاقہ کے ساتھ اور نیند کا بیداری کے ساتھ ہونا جیسا ہے۔ کیونکہ نیند بیداری سے پہلے ہوتی ہے، اور غشی افاقہ سے پہلے ہوتی ہے۔ ہم نے یہ تفصیل اس لیے بیان کی تاکہ ان کے اس مذہب کی وجہ سے جو سکر کی تعریف میں اسے قوی وارد کے ذریعے غیبت قرار دیتے ہیں۔ انہوں نے اس پر غیبت کا نام مطلقاً استعمال کیا، تو جسے ذوق (الذوق) نہیں ہے وہ یہ گمان کرتا ہے کہ اس کا حکم غیبت کا حکم ہے، اور وہ قیاس میں غلطی کرتا ہے جب وہ مرید کی تربیت کرتا ہے، اگر وہ متشیخین (شیخ ہونے کا دعویٰ کرنے والوں) میں سے ہو۔ پس اس پر معاملہ مشتبہ ہو جاتا ہے، اور وہ مرید کی حالت میں اس کے سکر، غیبت اور فنا میں فرق نہیں کر پاتا۔ اس طریق میں سکران (نشے میں دھت) اپنے احساس سے غائب نہیں ہوتا۔ اگر وہ غائب ہو جائے، جیسا کہ حنفی شارب خمر کے سکر میں دیکھتے ہیں، تو ہمارے نزدیک وہ سکر کی حالت سے فنا (فناء) یا غیبت (غیبہ) یا محق (مٹ جانے) کی حالت میں منتقل ہو گیا ہے۔ اور اس کے سکر کے بعد صحو (الصحو) نہیں آتا، بلکہ وہ سکر کی حالت سے فنا یا دیگر احوال کی طرف منتقل ہو گیا جو اسے جزوی یا کلی طور پر غائب کر دیتے ہیں۔\n\nیہ گمان نہ کیا جائے کہ چونکہ سکر ان متمیز مراتب پر ہے، اس لیے اس حال کے حامل کے لیے دو سکر ہو سکتے ہیں یا وہ ان سب کو جمع کر سکتا ہے، جیسا کہ ہم نے بعض مسائل میں انسان کے بہت سے امور کو جمع کرنے کے بارے میں بیان کیا ہے جو حقائق اس سے طلب کرتے ہیں، خاص طور پر جب کسی ایسے شخص نے شعر پڑھا جسے شراب اور عشق نے سکر میں مبتلا کیا تھا:\n\nسَكْرَانِ سُكْرُ هَوًى وَسُكْرُ مُدَامَةٍ *** فَتًى يُفِيقُ فَتًى بِهِ سَكْرَانِ\n(دو سکر ہیں: عشق کا سکر اور شراب کا سکر۔ ایک جوان ہوش میں آتا ہے، ایک جوان نشے میں دھت رہتا ہے۔)\n\nپس اس نے خبر دی کہ اس میں دو سکر جمع ہو گئے ہیں۔ لیکن اہل اللہ کا سکر ایسا نہیں ہے۔ کیونکہ معرفت (المعرفۃ) اس سے منع کرتی ہے۔ سکر الٰہی (السكر الإلهي) کا حامل سکر عقلی (السكر العقلي) کا حامل نہیں ہو سکتا، کیونکہ شہود (الشہود) اس سے مانع ہے۔ اور سکر عقلی (السكر العقلي) کا حامل سکر طبیعی (السكر الطبيعي) کا حامل نہیں ہو سکتا، کیونکہ اس کی دلیل اسے رد کرتی ہے۔ جب وہ سکر الٰہی کے حکم کو رد کرتا ہے، تو وہ سکر طبیعی کے حکم کو کیسے قبول کرے گا؟ اہل اللہ میں سے سکران اپنے سکر میں ایک سکر سے دوسرے سکر کی طرف ترقی کرتا ہے، وہ ان دونوں کو جمع نہیں کرتا جیسا کہ اس شاعر نے کہا۔ اور اس نے اس طریق میں جس چیز سے استدلال کیا ہے، وہ صرف صاحب قیاس ہے، صاحب ذوق (الذوق) نہیں۔ پس جسے سکر طبیعی (السكر الطبيعي) نے سکر میں مبتلا کیا، پھر اس کے پاس سکر عقلی (السكر العقلي) آیا، تو سکر طبیعی ضرورتاً محل سے جدا ہو جاتا ہے اور اس کا حکم اس کے حامل سے زائل ہو جاتا ہے۔\n\nاور ان اسکارات (Intoxications) میں معاملہ تدریج کا نہیں ہے۔ کبھی انسان کو ابتداء میں سکر عطا کر دیا جاتا ہے، یعنی سکر الٰہی (السكر الإلهي)، تو اس کے لیے سکر عقلی (السكر العقلي) کا ذوق (الذوق) کبھی ممکن نہیں ہوتا، لیکن اسے اس کا علم اور اس کے مرتبے کا علم ہو سکتا ہے، بغیر اس کے کہ اس میں اس کا کوئی اثر ہو، جو کہ ذوق ہے۔ اور کبھی سکر عقلی (السكر العقلي) ابتداء میں ذوق کے طور پر عطا کیا جاتا ہے، تو اس کے لیے سکر طبیعی (السكر الطبيعي) میں ذوق ممکن نہیں ہوتا، لیکن وہ ذوق کے طور پر سکر الٰہی (السكر الإلهي) کی طرف منتقل ہو سکتا ہے، تو اس سے سکر عقلی کا حکم ذوق اور حال کے لحاظ سے زائل ہو جاتا ہے، اور اس کے لیے اس کا علم ذوق کے ذریعے باقی رہتا ہے، کیونکہ وہ منتقل ہونے سے پہلے اس کا ذوق حاصل کر چکا تھا۔ اہل طریق کے سکر کا الٰہیات میں یہی معاملہ ہے۔ جہاں تک غیر الٰہیات کا تعلق ہے، تو صورت میں دو سکروں کو جمع کرنا ممکن ہو سکتا ہے، لیکن اگر تم اس معاملے کی تحقیق کرو تو تم اسے اس کے خلاف پاؤ گے۔ کیونکہ انسان کے بارے میں یہ گمان کیا جا سکتا ہے کہ جب وہ کسی چیز کو جانتا ہے تو وہ اس کا صاحب ذوق (الذوق) بھی ہے، حالانکہ معاملہ ایسا نہیں ہے۔ ذوق (الذوق) صرف ظہور الٰہی (التجلی) سے ہوتا ہے، اور علم سچی اور صحیح خبر کے نقل سے بھی حاصل ہو سکتا ہے۔\n\nپس اے ولی! طریق اللہ کو اسی طرح پہچان، میں نے تمہیں ان مقامات میں امور کا میزان دے دیا ہے اور تمہیں ان کا مستند دکھا دیا ہے۔ اور تم اس بیان کو اس کتاب کے علاوہ اس طائفہ (صوفیاء) کے کلام میں نہیں پاؤ گے، سوائے اس کے کہ ان کی طرف سے بعض منقولات میں اشارے ہوں۔ کیونکہ وہ اس کے عالم ہیں، اگر وہ صاحب ذوق ہیں، اور وہ صاحب ذوق ہیں، کیونکہ ان میں سے کوئی نہیں ہوتا مگر وہ صاحب ذوق ہوتا ہے۔ طبیعت اس کا شہود (الشہود) کرتی ہے تو سکر میں مبتلا ہوتی ہے، اور عقل اس کا شہود کرتی ہے تو سکر میں مبتلا ہوتی ہے، اور سر (باطن) اس کا شہود کرتا ہے تو سکر میں مبتلا ہوتا ہے۔ اور یہ اسکارات (Intoxications) کبھی بھی ایک وقت میں جمع نہیں ہو سکتے، اگرچہ سب اہل اللہ میں سے ہوں۔ جیسا کہ اپنی جان پر ظلم کرنے والا (ظالم لنفسہ) اس میں مقتصد (میانہ رو) نہیں ہوتا جس میں وہ ظالم ہے، اور نہ ہی سابق بالخیرات (نیکیوں میں سبقت کرنے والا) اس میں مقتصد ہوتا ہے، باوجود اس کے کہ ان میں سے ہر ایک الٰہی کتاب کے ورثاء میں سے چنا گیا ہے۔ بلکہ صحیح کشف (الکشف) یہ عطا کرتا ہے کہ جس نے اقتصاد (میانہ روی) کا ذوق چکھا، وہ اپنی جان پر ظلم کرنے والا نہیں ہو سکتا۔ اور اسی طرح باقی بھی بغیر کسی قید کے۔ کیونکہ امور میں اذواق (ذوق) کا حکم اور ان سے علم کا حصول دیگر طریقوں کے حکم جیسا نہیں ہے۔ پس یہ جان لو، اور وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے) وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ (اور اگر وہ چاہتا تو تم سب کو ہدایت دے دیتا) وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے۔)",
    "fa": "باب دویست و چهل و ششم در سُکر (مستی)\n\nسُکر مرا بر عرش محیط و گردان نشاند\nو من در دشتی هموار هستم\nکه از هر آنچه بی‌نیاز می‌کند، فقیر است\nو سُکر از باده‌ی هوی است\nو سُکر از نظر مدیر (گرداننده) است\nشاعری پیش از من این را گفته\nو او به آن دانا و آگاه است\n\nخداوند متعال می‌فرماید: **«و رودهایی از باده (خمر) که برای نوشندگان لذت‌بخش است»** (وَأَنْهَارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ). این (سُکر) علم احوال است و از این رو برای کسی است که طرب و التذاذ در او پدید آید. اما تعریف آنان که سُکر را «غیبت (غيبة) به واسطه‌ی واردی قوی» دانسته‌اند، صحیح نیست؛ زیرا سُکر غیبت نیست مگر از هر آنچه که با سرور، طرب و شادی منافات دارد، و آرزوها به صورت‌هایی قائم در چشم صاحب این حال تجلی (التجلی) می‌کنند. مردان حق (الحق) در حال سُکر بر مراتبی هستند که ان‌شاءالله آن‌ها را ذکر خواهیم کرد.\n\n**سُکر طبیعی (سكر طبيعي)**\n\nو آن چیزی است که نفوس از طرب، التذاذ، سرور و شادمانی به واسطه‌ی وارد شدن آرزوها می‌یابند، هنگامی که آرزوها در خیال (الخيال) او به صورت‌هایی قائم درآیند که دارای حکم و تصرف باشند. شاعرشان می‌گوید:\n\nپس اگر مست شوم، منم\nصاحب خورنق و سریر (تخت پادشاهی)\n\nزیرا او پادشاهی بر آن دو (خورنق و سریر) را نهایت مطلوب خود می‌دید. پس چون مست شد، صورت خورنق و سریر به عنوان ملک او در حضور تخیل و خیالش قائم شد که در آن تصرف می‌کند. این را حال سُکر به او بخشیده است، زیرا سُکر تأثیر قوی در قوه‌ی متخیله دارد. گفته‌اند: «قفون» از اهل الله کسانی هستند که با خیال (الخيال) این سُکر طبیعی (سكر طبيعي) را دارند؛ زیرا آنان پیوسته مراقب اموری هستند که تخیل کرده‌اند از خداوند به دست آورند، تا آن تخیل نزدشان قوی شود و بر آنان حکم کند، مانند:\n\nسخن پیامبر (صلی الله علیه و آله و سلم): **«خدا را چنان بپرست که گویی او را می‌بینی»** (اعبد الله كأنك تراه).\n\nو سخن دیگر ایشان (صلی الله علیه و آله و سلم): **«همانا خداوند در قبله‌ی نمازگزار است»** (إن الله في قبلة المصلي).\n\nو سخن صحابی به رسول خدا (صلی الله علیه و آله و سلم) هنگامی که پیامبر (صلی الله علیه و آله و سلم) از حقیقت ایمانش پرسید و او گفت: «من حقیقتاً مؤمن هستم»، آن صحابی (رضی الله عنه) گفت: «گویی به عرش پروردگارم که آشکار شده است، می‌نگرم» (كأني أنظر إلى عرش ربي بارزا).\n\nیعنی در روز قیامت. پس او چیزی را آورد که حضور خیال (الخيال) به او می‌بخشد. هنگامی که چنین تخیلی قوی شود، نفس را مست می‌کند و صورت آنچه تخیل شده است برای او قائم می‌شود، به طوری که با چشم خود به آن می‌نگرد و از آن خبر می‌دهد، درست مانند دیدن صاحب رؤیا. به او القا می‌شود و او گوش می‌دهد، در حالی که نمی‌داند با یک صورت خیالی مخاطب قرار می‌گیرد و آن را مشاهده می‌کند، بلکه یقین دارد که آن شهود (الشهود) حسی است. هنگامی که از آن سُکر به صحو (هوشیاری) باز می‌گردد، آن امر از حیث صورتش از او برداشته می‌شود، البته با باقی ماندن تخیل آن نزد برخی از کسانی که آن را در ذهن به یاد می‌آورند، همان‌طور که صورت آنچه در خواب دیده با بیداری برطرف می‌شود. و از اهل این مقام کسانی هستند که خداوند آن صورت متخیله را در حال صحو (هوشیاری) برایشان باقی می‌گذارد و آن را برایشان محسوس می‌سازد، پس از آنکه متخیله بود؛ مانند بهشتی که ابلیس در خیال منفصل برای سلیمان (علیه السلام) تخیل کرد تا او را بفریبد، و سلیمان (علیه السلام) از آن آگاه نبود. پس سلیمان سجده‌ی شکر به جای آورد، زیرا خداوند آن را به او هدیه کرده بود. پس خداوند آن را برای او بهشتی محسوس ساخت که در آن متنعم شود، و ابلیس زیانکار بازگشت، زیرا قصد او فتنه‌انگیزی بود و نمی‌دانست که اهل الله اگر چنین چیزی برایشان رخ دهد، آن را نزد خود به عبادت خداوند تبدیل می‌کنند. این در حالی است که مُخَیِّل (ابلیس) دشمن است؛ پس حال آنان چگونه خواهد بود اگر خیالشان از خودشان باشد و دشمن نفس خود نباشند؟ زیرا آنان در رهایی و نجات نفس خود می‌کوشند. پس اگر سُکر طبیعی‌شان چنین ثمری برایشان داشته باشد، گمانت به مراتب بالاتر از مستی چیست؟\n\n**و اما سُکر عقلی (السكر العقلي)**\n\nآن شبیه سُکر طبیعی (سكر طبيعي) است در بازگرداندن امور به آنچه حقیقت (حقيقة) آن اقتضا می‌کند، نه به آنچه امر در ذات خود اقتضا می‌کند. خبر الهی از جانب حق (الحق) برای صاحب این مقام با صفات امور حادث (مخلوقات) می‌آید که آن صفات، نعت (صفت) حق (الحق) هستند. اما او از پذیرش آن به این وجه امتناع می‌ورزد، زیرا در سُکر دلیل و برهان خود است. پس آن خبر را به آنچه نظرش اقتضا می‌کند، رد می‌کند، در حالی که به ذات حق (الحق) جاهل است و نمی‌داند آیا حق این نعت را می‌پذیرد یا نمی‌پذیرد، بلکه تخیل می‌کند که نمی‌پذیرد. پس این عقل به دلیل سُکرش، پای خود را در غیر بساط خود دراز می‌کند و به واسطه‌ی سُکرش در حق (الحق) دچار خطا می‌شود. حق (الحق) او را در این امر معذور می‌دارد، زیرا شخص مست مؤاخذه نمی‌شود به آنچه بر زبان می‌آورد. پس او آنچه را که حق (الحق) به خود نسبت داده است، از خداوند سلب می‌کند. هنگامی که این عاقل از سُکر خود به واسطه‌ی ایمان به صحو (هوشیاری) باز می‌گردد، خبر صادق و قول حق (الحق) را رد نمی‌کند و می‌گوید: حق (الحق) به ذات خود و آنچه به خود نسبت می‌دهد، داناتر از عقل است؛ زیرا عقل مخلوق است و مخلوق بر خالق حکم نمی‌کند. هیچ مصنوع و ساخته‌ای نیست مگر اینکه سازنده‌ی خود را نمی‌شناسد. پارچه سازنده‌ی خود یعنی بافنده را نمی‌شناسد، همچنین ارکان با افلاک، و افلاک با نفس، و نفس با عقل، و همچنین عقل با خداوند. نهایت علمی که از آنان حاصل می‌شود، نیازشان به او و استناد وجودشان به صانع خود است و بر او به چیزی حکم نمی‌کنند، به ویژه اگر صانع از خود به اموری خبر دهد. مصنوع را جز پذیرش آن راهی نیست. اگر آن را رد کند، به دلیل سُکری است که بر او عارض شده است. پس باده‌ای که می‌نوشد، همان دلیل و برهان اوست. و آنچه برخی از اخبار الهی از نعوت (صفات) حق (الحق) که موافق برهان و دلیل اوست، به او می‌دهد، او را بر این امر تقویت می‌کند. پس این سُکر عقلی (السكر العقلي) است. سُکر طبیعی (السكر الطبيعي) سُکر مؤمنان است و سُکر عقلی (السكر العقلي) سُکر عارفان (العارفين) است.\n\n**و سُکر کاملان از مردان باقی ماند که همان سُکر الهی (السكر الإلهي) است**\n\nرسول خدا (صلی الله علیه و آله و سلم) در مورد آن فرمود: **«خداوندا، تحیر مرا در خودت بیفزا»** (اللهم زدني فيك تحيرا).\n\nو سکران (مست) حیران است. پس سُکر الهی (السكر الإلهي) شادمانی و سرور به کمال است. و گاهی در تجلی (التجلی) در صور، سُکر به حق (الحق) رخ می‌دهد. برخی گفته‌اند:\n\nمردم را گردش جام مست کرد\nو مستی من از مدیر (گرداننده) بود\n\nپس کسی که شهود (الشهود) او را مست کند، هرگز صحو (هوشیاری) ندارد. و هر حالی که طرب، بسط، ناز و افشای اسرار الهی را به ارث نگذارد، سُکر نیست، بلکه غیبت (غيبة) یا فنا (الفناء) یا مَحق (محو) است. سُکر این قوم در طریق الله را نباید با سُکر شراب‌خوار قیاس کرد، زیرا شراب‌خواری گاهی برای برخی از نوشندگان غم، گریه، و فکر را به ارث می‌گذارد، و این به دلیل اقتضای مزاج آن نوشنده است و آن را سکران می‌نامند. چنین چیزی در سُکر طریق (عرفان) وجود ندارد. اندکی از مردم هستند که بین حیوان و سکران (مست) فرق می‌گذارند. نزد ما در علم طبیعی، اگر شراب‌خواری غم، گریه، حزن، فکر و سر به زیر افکندن را به دلیل اقتضای طبع و مزاجش به ارث بگذارد، او سکران نیست و صاحب سُکر هم نیست؛ زیرا برخی از مزاج‌ها سُکر را نمی‌پذیرند و سُکر در آن‌ها اثری ندارد. غیبت (غيبة) سکران از احساس او نیست، بلکه غیبت او فقط از مقابل طرب است و بس. نظیر این کسانی که طرب نمی‌کنند، نظیر اصحاب فکر، غیبت (غيبة) و فنا (الفناء) هستند. سُکر با سایر غیبت‌ها فرق دارد، زیرا صحو (هوشیاری) فقط از سُکر حاصل می‌شود و سُکر مقدم بر صحو است. در حالی که حضور با غیبت (غيبة) چنین نیست، و فنا (الفناء) با بقا (البقاء) نیز چنین نیست، بلکه مانند صَعق (بیهوشی) با افاقه (به هوش آمدن) و خواب با بیداری است؛ زیرا خواب مقدم بر بیداری است و غشوه (بیهوشی) مقدم بر افاقه است. ما این تفصیل را به خاطر مذهب آنان در تعریف سُکر که آن را «غیبت (غيبة) به واسطه‌ی واردی قوی» دانسته‌اند، ذکر کردیم. آنان نام غیبت را بر آن نهاده‌اند، پس کسی که ذوق (الذوق) ندارد، تخیل می‌کند که حکم آن مانند حکم غیبت است و در تربیت مرید، اگر از متشیخین (مدعیان شیخی) باشد، قیاس می‌کند و خطا می‌ورزد. پس امر بر او مشتبه می‌شود و در حال مرید بین سُکر، غیبت و فنای او فرق نمی‌گذارد. سکران در این طریق از احساس خود غایب نمی‌شود. اگر غایب شود، چنانکه حنفیان در سُکر شراب‌خوار می‌بینند، نزد ما از حال سُکر به حال فنا (الفناء) یا غیبت (غيبة) یا مَحق (محو) منتقل شده است و سُکر او به صحو (هوشیاری) منجر نمی‌شود، بلکه از حال سُکر به حال فنا یا یکی دیگر از احوال مغیبه (غایب‌کننده) از بخشی یا تمام وجودش منتقل شده است. نباید تخیل شود که چون سُکر بر این مراتب متمایز است، ممکن است صاحب این حال دو سُکر داشته باشد یا همه‌ی آن‌ها را جمع کند، به دلیل حقایقی که بر او حاکم است، چنانکه در برخی مسائل در مورد جمع شدن امور کثیر در انسان به دلیل حقایقی که از او طلب می‌شود، بیان کردیم. به ویژه که برخی از کسانی که باده و هوی او را مست کرده بود، چنین سروده است:\n\nدو مستی دارد: مستی هوی و مستی باده\nجوانی به هوش می‌آید و جوانی به آن مست است\n\nپس خبر داد که دو سُکر در او پدید آمده است. اما سُکر اهل الله چنین نیست، زیرا معرفت (المعرفة) مانع آن می‌شود. سکران الهی (السكران الإلهي) نمی‌تواند سُکر عقلی (السكر العقلي) داشته باشد، زیرا شهود (الشهود) مانع آن است. و سکران به سُکر عقلی (السكر العقلي) نمی‌تواند سُکر طبیعی (السكر الطبيعي) داشته باشد، زیرا دلیل او آن را نفی می‌کند. اگر او حکم سُکر الهی (السكر الإلهي) را رد می‌کند، چگونه حکم سُکر طبیعی (السكر الطبيعي) را می‌پذیرد؟ سکران از اهل الله در سُکر خود از سُکری به سُکر دیگر ارتقا می‌یابد و بین آن‌ها جمع نمی‌کند، مانند آنچه این شاعر گفت. و کسی که در این طریق به این شعر استشهاد کند، صاحب قیاس است نه صاحب ذوق (الذوق). پس کسی که سُکر طبیعی (السكر الطبيعي) او را مست کند، سپس سُکر عقلی (السكر العقلي) به او روی آورد، سُکر طبیعی بالضروره محل را ترک می‌کند و حکم آن از صاحبش زایل می‌شود. امر در این مستی‌ها تدریجی نیست. گاهی سُکر از ابتدا به انسان بخشیده می‌شود، منظورم سُکر الهی (السكر الإلهي) است، پس هرگز نمی‌تواند ذوق (الذوق) سُکر عقلی (السكر العقلي) را داشته باشد، اما ممکن است علم به آن و مرتبه‌اش را داشته باشد، بدون اینکه اثر آن که همان ذوق است، در او باشد. و گاهی سُکر عقلی (السكر العقلي) از ابتدا به صورت ذوق (الذوق) به او بخشیده می‌شود، پس نمی‌تواند ذوقی در سُکر طبیعی (السكر الطبيعي) داشته باشد، اما ممکن است به سُکر الهی (السكر الإلهي) منتقل شود، در این صورت حکم سُکر عقلی (السكر العقلي) از حیث ذوق و حال از او زایل می‌شود و علم به آن از طریق ذوق برایش باقی می‌ماند، زیرا ذوق آن پیش از انتقال، بر او مقدم بوده است. پس امر در سُکر اهل طریق در الهیات چنین است. اما در غیر الهیات، ممکن است جمع بین دو سُکر در ظاهر امکان‌پذیر باشد، اما اگر در آن تحقیق کنی، آن را بر خلاف این خواهی یافت. زیرا ممکن است در مورد انسان تخیل شود که اگر چیزی را بداند، صاحب ذوق (الذوق) آن است، در حالی که امر چنین نیست؛ زیرا ذوق (الذوق) فقط از تجلی (التجلی) حاصل می‌شود، و علم ممکن است با نقل خبر صادق و صحیح به دست آید. پس ای ولی، طریق الله را این‌گونه بشناس. من میزان امور را در این مقامات به تو دادم و مستند آن را به تو نشان دادم. این بیان را در کلام این طایفه در غیر این کتاب نخواهی یافت، مگر اینکه اشاراتی از آنان به آن در برخی از منقولاتشان باشد؛ زیرا آنان بالضروره به آن عالم هستند، اگر صاحب ذوق (الذوق) باشند، و آنان صاحب ذوق هستند، زیرا از میانشان کسی نیست مگر اینکه صاحب ذوق باشد. طبع آن را شهود (الشهود) می‌کند و مست می‌شود، و عقل آن را شهود می‌کند و مست می‌شود، و سِرّ آن را شهود می‌کند و مست می‌شود. و این مستی‌ها هرگز در یک زمان جمع نمی‌شوند، حتی اگر همه از اهل الله باشند، همان‌طور که ظالم به نفس خود، در آنچه ظالم است، مقتصد نیست و در آنچه مقتصد است، سابق نیست، با وجود اینکه هر یک از آنان از ورثه‌ی برگزیده‌ی کتاب الهی هستند. بلکه کشف (الکشف) صحیح نشان می‌دهد که کسی که ذوق (الذوق) اقتصاد را چشیده باشد، ظالم به نفس خود نخواهد بود، و همچنین در مورد بقیه بدون قید. زیرا حکم ذوق‌ها (الأذواق) در امور و حصول علم از آن‌ها، مانند حکم سایر طرق نیست. پس این را بدان، و **خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند** (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) و **اگر می‌خواست، همه‌ی شما را هدایت می‌کرد** (وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ). و **حمد و ستایش مخصوص پروردگار جهانیان است** (وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)."
  },
  "page_count": 3
}