{
  "id": 141,
  "title": {
    "ar": "الباب الواحد والأربعون ومائة في مقام ترك الحرية",
    "en": "Chapter One Hundred and Forty-One, Concerning the Station (مقام) of Relinquishing Freedom (الحرية)",
    "ur": "باب ایک سو اکتالیس: مقام ترکِ حُریت میں",
    "fa": "باب صد و چهل و یکم در مقام ترک آزادی (الحرية)"
  },
  "content": {
    "ar": "## (الباب الواحد والأربعون ومائة في مقام ترك الحرية)\n\n\n> من ليس ينفك عن حاجاته أبدا *** كيف التحرر والحاجات تطلبه‏\n\n\n> فهو الفقير إلى الأشياء أجمعها *** فالفقر مذهبه والفقر مكسبه‏\n\n\n> لذا تسمى بأعيان الكيان لنا *** حتى تعين في المنطوق مذهبه‏\n\n\n> فليس في الكون حر حيث يطلبنا *** من كل وجه ومنه نحن نطلبه‏\n\n\n### [من توجهت عليه الحقوق أنى له بالحرية]\n\n\nاعلم وفقك الله أن ترك الحرية عبودة محضة خالصة تسترق صاحبها الأسباب لتحققه بعلم الحكمة في وضعها فهو بذل تحت سلطانها فصاحبها كالأرض يطئوها البر والفاجر وتعطي منفعتها المؤمن والكافر تؤثر فيه تأثير الدعاء من الكون في الحق إجابة دعائه تحققا بمولاه حين رأى هذا المقام يصحبه مع الغني المنسوب إليه فكيف حال من يجوع مركبه ويعري ويظمأ ويضحى وهو مأمور بحفظه والنظر في شأنه وما يصلحه قد ولاة الله عليه وأنزله خليفة فيه وليس في قوته أن يقوم بحقه إلا أن تمكنه الأسباب من نفسها فبالضرورة يخضع في تحصيلها لأداء حق الله فيه المتوجه عليه فإن الله يقول له إن لنفسك عليك حقا ولعينك عليك حقا ولزورك عليك حقا ومن توجهت عليه الحقوق فإني له الحرية\n\n\n> فكل كون عليه حق *** فهو عبيد لذلك الحق‏\n\n\n> وليس حرا فكن عليما *** به خبيرا كمن تحقق‏\n\n\n> ولا تكن مثل من تأبى *** عن أمر مولاه إذ تخلق‏\n\n\n> الله رب وأنت عبد *** له فكنه فالكون أسبق‏\n\n\n> قد قلت ذا حين كان سمعي *** ومقولي حين كنت أنطق‏\n\n\n> ومن يكن مثل ما ذكرنا *** فذلك العالم الموفق‏\n### [التكليف قائم والاضطرار لازم فكيف تعقل الحرية]\n\n\nفهو عبد نفسه ما دامت تطلبه بحقها وعبد عينه ما دام يطلبه بحقه وعبد زوره ما دام يطلبه بحقه والنعم الإلهية تطلبه بشكر المنعم بها عليه والتكليف قائم والاضطرار لازم إن رام دفعه لا يندفع يؤثر فيه المدح والثناء فيقول الحمد لله المنعم المفضل ويملكه الذم والجفاء والأذى فيقول الحمد لله على كل حال فتغير حمده لتغير الأحوال فلو تغيرت الأحوال لتغير حمده لكان حرا عنها\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لأبي بكر الصديق ما أخرجك قال يا رسول الله الجوع قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وأنا أخرجني الجوع فجاء مع من كان معه من أصحابه إلى دار الهيثم بن أبي التيهان فذبح لهم وأطعمهم‏\n\n\nفما أخرجهم إلا من حكم عليهم لما توجه له حق عليهم وهو الجوع والجوع أمر عدمي فموجود يؤثر فيه المعدوم كيف حاله مع الموجود ومثل هؤلاء المشهود لهم بالحرية ولهذا الذوق ما خرجوا إلا لطلب أداء ما عليهم من الحقوق لأنفسهم فقد استرقهم الجوع ولو لم يخرجوا وسكنوا لكانوا تحت قهر الصبر وما تطلبه هذه الحال فغاية نسبة الفضل إليهم أنهم خرجوا كما قلنا يلتمسون أداء حقوق نفوسهم بالسعي فيها إذ كانوا متمكنين من ذلك وأعلى من هذا فلا يكون فإن قعدوا مع التمكن اتصفوا بالظلم والجهل بالحكم الإلهي وإني تعقل الحرية فيمن هذه صفته في الدنيا والآخرة\n\n\n### [الحرية حديث نفس وحال عرضى لا ثبات له مع الحضور والصحو]\n\n\nأما في الدنيا فواقع لا يقدر على إنكاره جحده ويجحده من نفسه وإن لم يركن إلى الأسباب ولا يعتمد عليها وغايته إن يعتمد على الله في استعمالها فهو عبد معلول لأنه توجه خاص وكذلك في الآخرة عبد شهوته لكونه تحت سلطانها تحكم فيه ولا معنى للعبودية إلا هذا دخوله تحت الأحكام ورق الأسباب ولما أبصر هذا العارف من نفسه علم إن الحرية حديث نفس وحال عرضي لا ثبات له مع الصحو\n\n\n### [ترك الحرية نعت إلهى فكيف يصح للعبد الخروج عنه‏]\n\n\nثم إن ترك الحرية نعت إلهي فكيف يصح له الخروج عنه وغايته إن يكون فيه بصورة حق يلتمس الدعاء ويطلب التوبة من عباده وسؤال المغفرة منهم ويذمهم إن لم يأتوا بما التمسه منهم حتى‏\n\n\nقال لو لم تذنبوا لجاء الله بقوم يذنبون ثم يتوبون فيغفر لهم‏\n\n\nفقد نبهتك عن أسرار هذا المقام إن وقفت معها عرفت نفسك وعرفت ربك وما تعديت قدرك‏\n\n\n### [درجات الحرية ودرجات ترك الحرية]\n\n\nوإن كان للحرية درجات في عباد الله فغير الأحرار أعظم عند الله درجة وأكمل وصفا والأصل معهم حفيظ يحفظ عليهم ترك الحرية والاسترقاق لما تعطيه الحكمة فإن قلت فكم للحرية من الدرجات فنقول لها في العارفين من أهل الأنس ستمائة درجة وتسع وأربعون درجة وفي العارفين من أهل الأدب أربع وخمسون درجة ومائتا درجة وفي الملامية من أهل الأنس ستمائة وثمان عشرة درجة وفي الملامية من أهل الأدب ثلاث وعشرون ومائتا درجة وهذه الدرجات بأعيانها لمن ترك الحرية وزيادة ما يعطيه الترك من الدرجات لقيامه بالحكمة وحفظ الأصل لإبقاء الحرية\n\n",
    "en": "(Chapter 141: On the Station of Abandoning Freedom)\n\nHe who is never free from his needs,\nHow can he attain freedom when needs pursue him?\nHe is the one poor (فقير) toward all things collectively,\nSo Poverty (الفقر) is his doctrine and Poverty is his gain.\nThus, he is named by the essences of Being (أعيان الكيان) for us,\nUntil his doctrine is specified in speech.\nThere is no free one in the Cosmos (الكون) since He seeks us\nFrom every aspect, and from Him, we seek.\n\n### [How can he who has duties incumbent upon him attain Freedom?]\n\nKnow, may Allah grant you success, that the abandoning of freedom (ترك الحرية) is pure, unadulterated servitude (عبودة محضة خالصة). The necessities (الأسباب) enslave its practitioner because he realizes the science of wisdom (علم الحكمة) in their placement. Thus, he is subject to their authority. The practitioner of this station is like the earth: the righteous and the wicked tread upon it, and it yields its benefit to the believer and the disbeliever. It affects him with the influence of the Cosmos's (الكون) supplication to The Real (الحق), answering its prayer through the realization of his Lord, when he sees that this station accompanies him despite the richness attributed to Him.\n\nWhat, then, is the state of one whose mount starves, who is naked, thirsty, and exposed to the sun, yet is commanded to preserve it, to look after its affairs, and to provide what benefits it? Allah has appointed him over it and made him a vicegerent (خليفة) within it. It is not within his power to fulfill its rights unless the necessities (الأسباب) enable him to do so. Therefore, he necessarily submits to acquiring these necessities in order to fulfill the right of Allah incumbent upon him concerning it. For Allah says to him: \"Indeed, your soul has a right over you, your eye has a right over you, and your visitor has a right over you.\" And for one upon whom rights (الحقوق) are incumbent, how can he attain freedom (الحرية)?\n\nEvery being (كون) upon whom a right is due,\nIs a servant (عبيد) to that Right (الحق).\nHe is not free, so be knowledgeable\nAnd expert in this, like one who has realized it.\nDo not be like one who refuses\nThe command of his Lord when he is created.\nAllah is the Lord, and you are His servant (عبد),\nSo be that, for the Cosmos (الكون) precedes.\nI said this when it was my hearing,\nAnd it is my saying when I speak.\nAnd whoever is as we have mentioned,\nThat is the successful Gnostic (العالم الموفق).\n\n### [The Divine Command is established and Necessity is binding, so how can Freedom be conceived?]\n\nHe is a servant of his soul (نفسه) as long as it seeks him by its right, a servant of his eye as long as it seeks him by its right, and a servant of his visitor as long as it seeks him by its right. The Divine Blessings seek him through the gratitude owed to the Bestower, and the Divine Command (التكليف) is established, and necessity (الاضطرار) is binding; if he attempts to repel it, it will not be repelled. Praise and commendation affect him, so he says, \"Praise be to Allah, the Benefactor, the Gracious.\" And blame, harshness, and harm possess him, so he says, \"Praise be to Allah in every state.\" His praise changes due to the change in circumstances. If the circumstances were to change such that his praise changed, he would be free from them.\n\nThe Messenger of Allah, peace and blessings be upon him, said to Abu Bakr al-Siddiq, \"What brought you out?\" He replied, \"O Messenger of Allah, hunger.\" The Messenger of Allah, peace and blessings be upon him, said, \"And I, hunger brought me out.\" So he came, along with those of his Companions who were with him, to the house of Al-Haytham ibn Abi al-Tayyihan, who slaughtered [a sheep] for them and fed them.\n\nNothing brought them out except that which ruled over them due to a right incumbent upon them, which was hunger (الجوع). Hunger is a non-existent matter (أمر عدمي). If an existent being is affected by a non-existent thing, what will be his state with an existent thing? And such people, who are witnessed to possess freedom (الحرية) and this spiritual taste (الذوق), only went out seeking to fulfill the rights due to their own souls, for hunger had enslaved them. Had they not gone out and remained still, they would have been under the compulsion of patience (الصبر) and what that state demands. The utmost attribution of merit to them is that they went out, as we said, seeking to fulfill the rights of their souls by striving for them, since they were capable of doing so. Nothing is higher than this. If they had remained seated despite being able, they would have been characterized by injustice and ignorance of the Divine Decree (الحكم الإلهي). How can freedom be conceived for one whose description is this, both in this world and the Hereafter?\n\n### [Freedom is a thought of the soul and an accidental state that has no permanence with Presence and Sobriety]\n\nAs for this world, it is a reality that the denier cannot deny, and he denies it from his own soul, even if he does not rely upon the necessities (الأسباب) or depend on them. His utmost achievement is to rely upon Allah in their utilization. Thus, he is a servant bound by cause (عبد معلول) because of a specific orientation. Likewise, in the Hereafter, he is a servant of his desire (شهوته) because he is under its authority, which rules over him. The meaning of servitude (العبودية) is nothing other than this: his entry under the rulings and the bondage (رق) of the necessities (الأسباب). When the Gnostic (العارف) perceived this from his own soul, he knew that freedom (الحرية) is a thought of the soul (حديث نفس) and an accidental state (حال عرضي) that has no permanence with Sobriety (الصحو).\n\n### [The Abandoning of Freedom is a Divine Attribute, so how can the Servant rightly depart from it?]\n\nFurthermore, the abandoning of freedom (ترك الحرية) is a Divine Attribute (نعت إلهي). How, then, can it be right for the servant (العبد) to depart from it? His utmost state is to be in it in the form of The Real (حق), seeking supplication (الدعاء), requesting repentance (التوبة) from His servants, and asking for forgiveness from them. He even blames them if they do not bring what He sought from them, to the extent that He said: <<لو لم تذنبوا لجاء الله بقوم يذنبون ثم يتوبون فيغفر لهم>> (Had you not sinned, Allah would have brought forth a people who would sin, then seek forgiveness, and He would forgive them). I have thus alerted you to the secrets of this station (مقام). If you stand by them, you will know yourself, know your Lord, and not transgress your measure.\n\n### [The Degrees of Freedom and the Degrees of Abandoning Freedom]\n\nAlthough freedom (الحرية) has degrees (درجات) among the servants of Allah, those who are not free (غير الأحرار) are greater in degree and more perfect in description (وصفا) in the sight of Allah. The Origin (الأصل) is with them, a Preserver (حفيظ) who preserves for them the abandoning of freedom (ترك الحرية) and the state of enslavement (الاسترقاق) due to what Wisdom (الحكمة) grants. If you ask, \"How many degrees does freedom have?\" We say: Among the Gnostics (العارفين) of the People of Intimacy (أهل الأنس), it has six hundred and forty-nine degrees. Among the Gnostics of the People of Propriety (أهل الأدب), it has two hundred and fifty-four degrees. Among the Malamiyya (المالامية) of the People of Intimacy, it has six hundred and eighteen degrees. And among the Malamiyya of the People of Propriety, it has two hundred and twenty-three degrees. These very degrees belong to the one who abandons freedom, plus the additional degrees granted by the abandoning, due to his upholding of Wisdom and preserving the Origin (الأصل) for the sake of maintaining freedom.",
    "ur": "(باب ایک سو اکتالیس: آزادی کے ترک کے مقام کے بیان میں)\n\nجو شخص اپنی ضروریات سے کبھی جدا نہیں ہوتا،\nوہ کیسے آزاد ہو سکتا ہے جبکہ ضروریات اسے طلب کرتی ہیں؟\n\nپس وہ تمام اشیاء کا محتاج (فقیر) ہے،\nفقر (الفقر) ہی اس کا مسلک ہے اور فقر ہی اس کا ذریعۂ کسب ہے۔\n\nاسی لیے وہ ہمارے لیے ہستی (الکیان) کے اعیان کے نام سے موسوم ہوا،\nتاکہ اس کا مسلک کلام میں متعین ہو جائے۔\n\nپس کائنات میں کوئی آزاد نہیں، کیونکہ وہ ہمیں ہر رُخ سے طلب کرتا ہے\nاور ہم اسے طلب کرتے ہیں۔\n\n### [جس پر حقوق عائد ہوں، اس کے لیے آزادی کہاں؟]\n\nاللہ آپ کو توفیق دے، جان لیجیے کہ آزادی کا ترک (ترك الحرية) ایک خالص بندگی (عبودية محضة خالصة) ہے جو اپنے صاحب کو اسباب (الأسباب) کا غلام بنا دیتی ہے، کیونکہ وہ ان کے وضع ہونے میں علم حکمت (علم الحكمة) کے ساتھ متحقق ہوتا ہے۔ پس وہ ان کے تسلط کے تحت خرچ ہوتا ہے۔ اس کا صاحب زمین کی مانند ہے، جس پر نیک اور بد چلتے ہیں، اور وہ اپنا فائدہ مومن اور کافر دونوں کو دیتی ہے۔ کائنات کی طرف سے ذات حق (الحق) میں دعا کا اثر اس پر پڑتا ہے، جو اس کے مولا کی طرف سے اس کی دعا کی قبولیت کا تحقق (تحقق) ہے، جب اس نے دیکھا کہ یہ مقام اس کے ساتھ اس غنی کے باوجود ہے جو اس کی طرف منسوب ہے۔\n\nتو اس شخص کا کیا حال ہو گا جس کی سواری بھوکی ہو، ننگی ہو، پیاسی ہو اور دھوپ میں ہو، جبکہ اسے اس کی حفاظت اور اس کے معاملات اور اصلاح کی دیکھ بھال کا حکم دیا گیا ہے؟ اللہ نے اسے اس پر والی بنایا ہے اور اس میں خلیفہ مقرر کیا ہے۔ اور اس کی طاقت میں نہیں کہ وہ اس کا حق ادا کر سکے، مگر یہ کہ اسباب (الأسباب) خود اسے اس کی قدرت دیں۔ پس وہ لازمی طور پر ان کے حصول میں جھکتا ہے تاکہ اس میں اللہ کا حق ادا کر سکے جو اس پر عائد ہے۔ کیونکہ اللہ اسے فرماتا ہے: \"بے شک تمہارے نفس کا تم پر حق ہے، اور تمہاری آنکھ کا تم پر حق ہے، اور تمہارے ملاقاتی کا تم پر حق ہے۔\" اور جس پر حقوق عائد ہوں، اس کے لیے آزادی کہاں؟\n\nپس ہر ہستی (کون) پر حق ہے،\nلہٰذا وہ اس حق کا غلام ہے۔\n\nاور وہ آزاد نہیں، پس تم اس کے بارے میں جاننے والے\nاور باخبر بنو، جیسے وہ شخص جو متحقق ہو چکا ہے۔\n\nاور اس شخص کی طرح نہ بنو جو اپنے مولا کے حکم سے\nانکار کرتا ہے جب وہ پیدا کیا گیا۔\n\nاللہ رب ہے اور تم اس کے بندے ہو،\nپس وہی بنو، کیونکہ کائنات (الکون) سبقت لے گئی ہے۔\n\nمیں نے یہ تب کہا جب یہ میری سماعت تھی،\nاور یہ میری بات ہے جب میں بول رہا تھا۔\n\nاور جو شخص ایسا ہو جیسا ہم نے ذکر کیا،\nتو وہی کامیاب عالم ہے۔\n\n### [تکلیف قائم ہے اور اضطرار لازم ہے، تو آزادی کا تصور کیسے کیا جا سکتا ہے؟]\n\nپس وہ اپنے نفس کا بندہ ہے جب تک وہ اپنے حق کے ساتھ اسے طلب کرتا ہے، اور اپنی آنکھ کا بندہ ہے جب تک وہ اپنے حق کے ساتھ اسے طلب کرتی ہے، اور اپنے ملاقاتی کا بندہ ہے جب تک وہ اپنے حق کے ساتھ اسے طلب کرتا ہے۔ اور الٰہی نعمتیں اس سے انعام دینے والے کا شکر طلب کرتی ہیں، اور تکلیف (التكليف) قائم ہے اور اضطرار (الاضطرار) لازم ہے، اگر وہ اسے دفع کرنا چاہے تو وہ دفع نہیں ہوتا۔ مدح اور ثناء اس پر اثر انداز ہوتی ہے تو وہ کہتا ہے: \"الحمد لله المنعم المفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام دینے والا اور فضل کرنے والا ہے)، اور مذمت، جفا اور تکلیف اسے اپنی ملکیت میں لے لیتی ہے تو وہ کہتا ہے: \"الحمد لله على كل حال\" (ہر حال میں اللہ کے لیے تعریف ہے)۔ پس اس کی تعریف احوال کے بدلنے سے بدل گئی، اگر وہ احوال کے بدلنے سے اپنی تعریف بدلتا تو وہ ان سے آزاد ہوتا۔\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے ابوبکر صدیق رضی اللہ عنہ سے پوچھا: \"ما أخرجك\" (تمہیں کس چیز نے نکالا؟) انہوں نے عرض کیا: \"يا رسول الله الجوع\" (یا رسول اللہ، بھوک نے)۔ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"وأنا أخرجني الجوع\" (اور مجھے بھی بھوک نے نکالا ہے)۔ پس آپ اپنے ساتھیوں کے ساتھ جو آپ کے ہمراہ تھے، ہیثم بن ابی التیہان کے گھر تشریف لائے، تو انہوں نے ان کے لیے ذبح کیا اور انہیں کھانا کھلایا۔\n\nپس انہیں کسی چیز نے نہیں نکالا مگر اس نے جس کا حکم ان پر نافذ تھا، جب ان پر اس کا حق عائد ہوا، اور وہ بھوک ہے۔ اور بھوک ایک عدمی امر ہے۔ پس ایک موجود (انسان) پر ایک معدوم (بھوک) اثر انداز ہو رہا ہے، تو موجود کے ساتھ اس کا کیا حال ہو گا؟ اور ان جیسے لوگ جن کے لیے آزادی کی گواہی دی جاتی ہے، اور اس ذوق کے حامل، وہ نہیں نکلے مگر اپنی جانوں کے حقوق کی ادائیگی کی طلب میں، پس بھوک نے انہیں غلام بنا لیا۔ اور اگر وہ نہ نکلتے اور ٹھہرے رہتے تو وہ صبر کے قہر کے تحت ہوتے اور اس حال کے تقاضوں کے تحت۔ پس ان کی طرف فضیلت کی نسبت کی انتہا یہ ہے کہ وہ نکلے، جیسا کہ ہم نے کہا، اپنی جانوں کے حقوق کی ادائیگی کی تلاش میں، اس میں کوشش کرتے ہوئے، کیونکہ وہ اس پر قادر تھے۔ اور اس سے اعلیٰ کوئی چیز نہیں ہو سکتی۔ اگر وہ قدرت کے باوجود بیٹھے رہتے تو ظلم اور حکم الٰہی (الحکم الإلهي) سے جہالت کے ساتھ متصف ہوتے۔ اور اس شخص کے لیے آزادی کا تصور کیسے کیا جا سکتا ہے جس کی یہ صفت دنیا اور آخرت میں ہو؟\n\n### [آزادی ایک نفسانی خیال اور عارضی حال ہے، جسے حضور اور صحو کے ساتھ ثبات نہیں]\n\nجہاں تک دنیا کا تعلق ہے، تو یہ ایک حقیقت ہے جس کا منکر انکار نہیں کر سکتا، اور وہ اپنے نفس سے اس کا انکار کرتا ہے، اگرچہ وہ اسباب (الأسباب) کی طرف مائل نہ ہو اور نہ ہی ان پر بھروسہ کرے، اور اس کی انتہا یہ ہے کہ وہ ان کے استعمال میں اللہ پر بھروسہ کرتا ہے۔ پس وہ ایک معلول بندہ ہے کیونکہ یہ ایک خاص توجہ ہے۔ اسی طرح آخرت میں بھی وہ اپنی شہوت کا بندہ ہو گا کیونکہ وہ اس کے تسلط کے تحت ہے جو اس پر حکم چلاتی ہے۔ اور بندگی (العبودية) کا کوئی معنی نہیں مگر یہی: احکام کے تحت داخل ہونا اور اسباب (الأسباب) کی غلامی۔ اور جب اس عارف نے اپنے نفس سے یہ دیکھا، تو اسے معلوم ہوا کہ آزادی (الحرية) ایک نفسانی خیال (حديث نفس) اور ایک عارضی حال (حال عرضي) ہے، جسے صحو (الصحو) (ہوشمندی) کے ساتھ ثبات حاصل نہیں۔\n\n### [آزادی کا ترک ایک الٰہی صفت ہے، تو بندے کے لیے اس سے باہر نکلنا کیسے درست ہو سکتا ہے؟]\n\nپھر یہ کہ آزادی کا ترک (ترك الحرية) ایک الٰہی صفت (نعت إلهي) ہے، تو بندے کے لیے اس سے باہر نکلنا کیسے درست ہو سکتا ہے؟ اور اس کی انتہا یہ ہے کہ وہ اس میں حق (الحق) کی صورت میں ہو، جو دعا کی التجا کرتا ہے، اور اپنے بندوں سے توبہ طلب کرتا ہے، اور ان سے مغفرت کا سوال کرتا ہے، اور اگر وہ وہ چیز نہ لائیں جس کی اس نے ان سے التجا کی ہے تو وہ ان کی مذمت کرتا ہے، یہاں تک کہ:\n\n(اس نے) فرمایا: \"لو لم تذنبوا لجاء الله بقوم يذنبون ثم يتوبون فيغفر لهم\" (اگر تم گناہ نہ کرتے تو اللہ ایسی قوم کو لاتا جو گناہ کرتے، پھر توبہ کرتے، تو وہ انہیں بخش دیتا)۔\n\nپس میں نے تمہیں اس مقام کے اسرار سے آگاہ کر دیا ہے۔ اگر تم ان پر قائم رہے تو تم نے اپنے نفس کو پہچان لیا، اور اپنے رب کو پہچان لیا، اور اپنی حد سے تجاوز نہیں کیا۔\n\n### [آزادی کے درجات اور آزادی کے ترک کے درجات]\n\nاور اگرچہ اللہ کے بندوں میں آزادی کے درجات ہیں، لیکن غیر آزاد لوگ اللہ کے نزدیک زیادہ عظیم درجہ اور کامل صفت رکھتے ہیں۔ اور اصل ان کے ساتھ ایک محافظ ہے جو ان پر آزادی کا ترک (ترك الحرية) اور غلامی کو محفوظ رکھتا ہے، اس حکمت (الحكمة) کی بنا پر جو وہ عطا کرتی ہے۔ اگر تم پوچھو کہ آزادی کے کتنے درجات ہیں، تو ہم کہتے ہیں کہ اہل انس (اہل الأنس) میں سے عارفین کے لیے اس کے چھ سو انچاس (۶۴۹) درجات ہیں، اور اہل ادب (اہل الأدب) میں سے عارفین کے لیے دو سو چون (۲۵۴) درجات ہیں۔ اور ملامتیہ (الملامية) میں سے اہل انس کے لیے چھ سو اٹھارہ (۶۱۸) درجات ہیں، اور ملامتیہ میں سے اہل ادب کے لیے دو سو تیئیس (۲۲۳) درجات ہیں۔ اور یہ درجات بعینہٖ ان لوگوں کے لیے بھی ہیں جنہوں نے آزادی کو ترک کیا (ترك الحرية)، اور اس کے علاوہ وہ اضافی درجات بھی ہیں جو ترک انہیں عطا کرتا ہے، کیونکہ وہ حکمت (الحكمة) پر قائم رہتے ہیں اور آزادی کو باقی رکھنے کے لیے اصل کی حفاظت کرتے ہیں۔",
    "fa": "(باب صد و چهل و یکم در مقام ترک آزادی)\n\nآن کس که هرگز از نیازهایش جدا نمی‌شود،\nچگونه می‌تواند آزاد باشد در حالی که نیازها او را می‌طلبند؟\nپس او نیازمند (فقیر) به همه چیزهاست،\nو فقر (الفقر) آیین او و فقر (الفقر) کسب اوست.\nاز این رو، به عین‌های هستی (أعيان الكيان) برای ما نامیده شد،\nتا آیین او در گفتار مشخص گردد.\nپس در هستی (الکون) آزاده‌ای نیست، زیرا او ما را می‌طلبد\nاز هر جهت، و ما نیز او را می‌طلبیم.\n\n### [کسی که حقوقی بر عهده اوست، چگونه می‌تواند به آزادی دست یابد؟]\n\nبدان، خداوند تو را توفیق دهد، که ترک آزادی (ترك الحرية) بندگی (عبودة) محض و خالصی است که صاحب خود را به بردگی اسباب (الأسباب) می‌کشاند، زیرا او به علم حکمت (الحكمة) در جایگاه خود تحقق یافته است. پس او تحت سلطه اسباب است. صاحب این مقام مانند زمینی است که نیکوکار و بدکار بر آن گام می‌نهند و منفعت خود را به مؤمن و کافر می‌دهد. این مقام در او تأثیر می‌گذارد، مانند تأثیر دعای هستی (الکون) در حق (الحق) که اجابت دعای اوست، به سبب تحقق یافتن به مولای خود، هنگامی که دید این مقام با غنایی که به او نسبت داده شده همراه است. پس حال کسی که مرکبش گرسنه و برهنه و تشنه و در معرض آفتاب است، چگونه خواهد بود؟ در حالی که او مأمور به حفظ آن و رسیدگی به امور و اصلاح آن است. خداوند او را بر آن ولایت داده و او را خلیفه در آن قرار داده است. و او در توان خود ندارد که حق آن را ادا کند مگر اینکه اسباب (الأسباب) خود را در اختیار او قرار دهند. پس به ناچار برای به دست آوردن آن اسباب، خضوع می‌کند تا حق خداوند را که بر عهده اوست، ادا نماید. زیرا خداوند به او می‌فرماید: «نفس تو بر تو حقی دارد، و چشمت بر تو حقی دارد، و مهمانت بر تو حقی دارد.» و کسی که حقوقی بر عهده اوست، چگونه می‌تواند به آزادی دست یابد؟\n\nپس هر هستی (کون) که حقی بر اوست،\nبنده آن حق است.\nو آزاده نیست، پس دانا باش\nو آگاه، مانند کسی که تحقق یافته است.\nو مانند کسی مباش که سر باز زد\nاز فرمان مولای خود هنگامی که آفریده شد.\nخداوند پروردگار است و تو بنده\nاو هستی، پس چنین باش، زیرا هستی (الکون) پیشی گرفته است.\nاین را گفتم هنگامی که گوش من بود،\nو گفتار من هنگامی که سخن می‌گفتم.\nو هر کس مانند آنچه ذکر کردیم باشد،\nاو همان دانشمند موفق است.\n\n### [تکلیف (التكليف) برقرار است و ناچاری (الاضطرار) لازم، پس چگونه آزادی قابل تصور است؟]\n\nپس او بنده نفس خود است تا زمانی که نفس حق خود را از او می‌طلبد، و بنده چشم خود است تا زمانی که چشم حق خود را از او می‌طلبد، و بنده مهمان خود است تا زمانی که مهمان حق خود را از او می‌طلبد. و نعمت‌های الهی او را به شکرگزاری از نعمت‌دهنده می‌طلبند. تکلیف (التكليف) برقرار است و ناچاری (الاضطرار) لازم است؛ اگر بخواهد آن را دفع کند، دفع نمی‌شود. مدح و ثنا در او تأثیر می‌گذارد و می‌گوید: «سپاس خدای را که نعمت‌بخش و فضل‌دهنده است.» و نکوهش و جفا و آزار بر او مسلط می‌شود و می‌گوید: «سپاس خدای را در هر حال.» پس حمد او به دلیل تغییر احوال تغییر کرد. اگر احوال تغییر می‌کردند و حمد او تغییر نمی‌کرد، از آنها آزاد بود.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به ابوبکر صدیق فرمود: «چه چیز تو را بیرون آورده است؟» ابوبکر گفت: «ای رسول خدا، گرسنگی.» رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «و مرا نیز گرسنگی بیرون آورده است.» پس با کسانی از اصحابش که همراهش بودند، به خانه هیثم بن ابی التیهان آمدند. او برایشان ذبح کرد و به آنان غذا داد.\n\nپس آنان را بیرون نیاورد مگر کسی که بر ایشان حکم رانده بود، زیرا حقی بر عهده آنان بود و آن گرسنگی بود. و گرسنگی امری عدمی است. پس موجودی که معدوم در او تأثیر می‌گذارد، حالش با موجود چگونه خواهد بود؟ و کسانی که به آزادی (الحرية) مشهورند و دارای این ذوق هستند، بیرون نیامدند مگر برای طلب ادای حقوقی که بر عهده‌شان نسبت به نفس‌هایشان بود. پس گرسنگی آنان را به بردگی کشیده بود. و اگر بیرون نمی‌آمدند و آرام می‌گرفتند، تحت قهر صبر و آنچه این حال می‌طلبد، قرار می‌گرفتند. پس نهایت فضیلتی که می‌توان به آنان نسبت داد این است که همان‌طور که گفتیم، بیرون آمدند و در پی ادای حقوق نفس‌هایشان با تلاش در آن بودند، زیرا توانایی این کار را داشتند. و مقامی بالاتر از این برایشان نیست. زیرا اگر با وجود توانایی، دست از کار می‌کشیدند، به ظلم و جهل نسبت به حکم الهی متصف می‌شدند. و چگونه آزادی (الحرية) در کسی که صفتش در دنیا و آخرت چنین است، قابل تصور است؟\n\n### [آزادی (الحرية) حدیث نفس و حالی عارضی است که با حضور و صحو (الصحو) ثباتی ندارد]\n\nاما در دنیا، این امری واقع است که منکر آن نمی‌تواند آن را انکار کند و از درون خود آن را انکار می‌کند، حتی اگر به اسباب (الأسباب) تکیه نکند و بر آنها اعتماد نورزد. نهایت کار او این است که در استفاده از اسباب بر خداوند توکل کند. پس او بنده‌ای است که به علتی وابسته است، زیرا توجهی خاص دارد. همچنین در آخرت، بنده شهوت خود است، زیرا تحت سلطه آن قرار دارد و شهوت بر او حکم می‌راند. و معنای بندگی (العبودية) جز این نیست: داخل شدن تحت احکام و بردگی اسباب (الأسباب). و هنگامی که این عارف این حقیقت را در نفس خود مشاهده کرد، دانست که آزادی (الحرية) حدیث نفس و حالی عارضی است که با صحو (الصحو) (هوشیاری) ثباتی ندارد.\n\n### [ترک آزادی (ترك الحرية) صفتی الهی است، پس چگونه برای بنده خروج از آن صحیح است؟]\n\nسپس، ترک آزادی (ترك الحرية) صفتی الهی است، پس چگونه برای بنده صحیح است که از آن خارج شود؟ و نهایت کار او این است که در آن به صورت حق (الحق) باشد که دعا را می‌طلبد و توبه را از بندگانش می‌خواهد و طلب مغفرت از آنان می‌کند و اگر آنچه را از آنان خواسته انجام ندهند، آنان را نکوهش می‌کند، تا جایی که\nفرمود: «اگر شما گناه نمی‌کردید، خداوند قومی را می‌آورد که گناه کنند، سپس توبه کنند و او آنان را بیامرزد.»\nمن تو را از اسرار این مقام آگاه ساختم. اگر با آن همراه شوی، خودت را خواهی شناخت و پروردگارت را خواهی شناخت و از حد خود تجاوز نخواهی کرد.\n\n### [درجات آزادی (الحرية) و درجات ترک آزادی (ترك الحرية)]\n\nو اگرچه آزادی (الحرية) در میان بندگان خدا درجاتی دارد، اما کسانی که آزاد نیستند، نزد خداوند دارای درجه‌ای عظیم‌تر و وصفی کامل‌تر هستند. و اصل (الأصل) با آنان حافظی است که ترک آزادی (ترك الحرية) و بردگی را به دلیل آنچه حکمت (الحكمة) اقتضا می‌کند، برایشان حفظ می‌کند. اگر بپرسی آزادی چند درجه دارد؟ می‌گوییم: برای عارفان از اهل اُنس، ششصد و چهل و نه درجه دارد؛ و برای عارفان از اهل ادب، دویست و پنجاه و چهار درجه دارد؛ و برای ملامتیان از اهل اُنس، ششصد و هجده درجه دارد؛ و برای ملامتیان از اهل ادب، دویست و بیست و سه درجه دارد. و این درجات عیناً برای کسی است که آزادی (الحرية) را ترک کرده است، به علاوه درجاتی که این ترک به دلیل قیام او به حکمت (الحكمة) و حفظ اصل برای بقای آزادی (الحرية) به او می‌بخشد."
  },
  "page_count": 2
}