{
  "id": 438,
  "title": {
    "ar": "الباب الثامن والثلاثون وأربعمائة في معرفة منازلة من قرأ كلامي رأى غمامتي فيها سرج ملائكتي تنزل عليه وفيه فإذا سكت رفعت عنه ونزلت أنا",
    "en": "Chapter Four Hundred and Thirty-Eight: Concerning the Knowledge of the Spiritual Station of him who reads My Speech, [wherein] he sees My Cloud, in which are the Lamps of My Angels, descending upon him and within him. And when he becomes silent, it is lifted from him, and I Myself descend.",
    "ur": "باب نمبر چار سو اڑتیس: اس شخص کے نزول کے مقام (منازلة) کی معرفت میں جو میری کلام پڑھے گا، وہ میری غمامہ (غمامتی) کو دیکھے گا جس میں میرے فرشتوں کے چراغ (سرج ملائکتی) ہیں جو اس پر اور اس کے اندر نازل ہوتے ہیں۔ اور جب وہ خاموش ہو جائے گا تو وہ (غمامہ) اس سے اٹھا لیا جائے گا اور میں (خود) نازل ہوں گا۔",
    "fa": "باب چهارصد و سی و هشتم: در معرفت منزلت کسی که کلام مرا قرائت کند، ابر مرا مشاهده می‌کند که در آن چراغ‌های فرشتگان من است و بر او و در او نازل می‌شوند؛ و چون خاموش شود، از او مرتفع می‌گردد و من نازل می‌شوم."
  },
  "content": {
    "ar": "## «الباب الثامن والثلاثون وأربعمائة في معرفة منازلة من قرأ كلامي رأى غمامتي فيها سرج ملائكتي تنزل عليه وفيه فإذا سكت رفعت عنه ونزلت أنا»\n\n\n> كلامي ليس غيري وهو غيري *** وإن المثل للامثال ضد\n\n\n> فقل للعارفين إذا قرأتم *** كلام الله فالوجدان فقد\n\n\n> دليلي في شهادته حروف *** وفي الغيب المعاني وهي حد\n\n\n> وأسبلت الستور فما رآه *** فعين القرب في التحقيق بعد\n\n\n> فمن قرأ القرآن فلا يفكر *** ولا ينظر فإن السم شهد\n\n\n### [السكينة لقلوب المؤمنين‏]\n\n\nقال الله تعالى في آية طالوت وقالَ لَهُمْ نَبِيُّهُمْ إِنَّ آيَةَ مُلْكِهِ أَنْ يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ من رَبِّكُمْ وأنزلها الله في قلوب المؤمنين من أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم وبهذا وأمثاله كانت هذه الأمة المحمدية خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ قال الله عز وجل هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ في قُلُوبِ الْمُؤْمِنِينَ فما كان شهادة في غير هذه الأمة نزل غيبا في هذه الأمة فوجده أهل الأذواق في قلوبهم فكانت صفة من صفاتهم وكانت فيمن تقدم هذه الأمة من الأمم أجنبية عنها فعلامة هذه الأمة في قلوبهم استفت قلبك وإن أفتاك المفتون ومع كونها منزلة في قلوبهم‏\n\n\nثم أشهدها الله تعالى بعض أصحاب محمد صَلَّى اللهُ عَليهِ وسَلَّم في تلاوته القرآن وكانت له فرس فجعلت تخبط فرفع رأسه فرأى غمامة فيها سرج كلما قرأ نزلت ودنت منه وإذا سكت ارتفعت فلما ذكر ذلك لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم قال له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم تلك السكينة نزلت للقرآن‏\n\n\nفرأى هذا الصاحب ممثلا خارجا عنه ببصره ما كان فيه فكان الحق له مرآة رأى صورة ما في قلبه فيها فإن القرآن ذكر الله وبِذِكْرِ الله تَطْمَئِنُّ الْقُلُوبُ كذا ذكر الله لنا في كتابه العزيز والطمأنينة سكينة أنزلها القرآن في قلوب المؤمنين فكانت آيات بنى إسرائيل ظاهرة وآياتنا في قلوبنا وهذا الفرق بين الورثة المحمديين وسائر الأنبياء فورثة الأنبياء يعرفون في العموم بما يظهر عليهم من خرق العوائد ووارث محمد صَلَّى اللهُ عَليهِ وسَلَّم مجهول في العموم معلوم في الخصوص لأن خرق عادته إنما هو حال وعلم في قلبه فهو في كل نفس يزداد علما بربه علم حال وذوق لا يزال كذلك وقد نبه الجنيد على ذلك باختلاف أجوبته عن المسألة الواحدة من التوحيد في المجلس الواحد لاختلاف دقائق الزمان ذكر ذلك القشيري في صدر رسالته المنسوبة إليه وكلما ازداد المحمدي علما بربه ازداد قربا فهم المقربون وأحوالهم الظاهرة تجري بحكم العوائد فيعرفون ولا يعرفون ويأتون بما أعطاهم الله من العلم به في طريق النصح لهذه الأمة فلا تعرف العامة قدر ذلك لأنها اعتادت من علماء الرسوم مثل هذا إذا تكلموا في العلم بالله عز وجل من طريق الدليل ولم تفرق بين علم الدليل وبين علم الذوق وأما علماء الرسوم فيكفرونهم غالبا مع كونهم يسلمونه لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم بعينه إذا نقل عنه في قرآن أو خبر إلهي وغير إلهي فانظر ما أشد هذا العمي ولو لا إن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بعثه رسولا ما ظهرت عليه آية ظاهرة في العموم كما ظهرت على من تقدم فما ظهر عنه صَلَّى اللهُ عَليهِ وسَلَّم من الآيات المنقولة في العموم إنما كان ذلك من كونه رسولا رفقا من الله تعالى بهذه الأمة وإقامة حجة على من كذبه وكذب ما جاء به أ لا ترى إلى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم كيف أسرى به إلى المقام الذي قد عرف وجاء به القرآن والخبر الصحيح فلما خرج إلى الناس بكرة تلك الليلة وذكر للاصحاب ما ذكر مما جرى له في إسرائه بينه وبين ربه تعالى أنكر عليه بعض أصحابه لكونهم ما رأوا لذلك أثرا في الظاهر بل زادهم حكما في التكليف وموسى عليه السلام لما جاء من عند ربه كساه الله نورا على وجهه يعرف به صدق ما ادعاه فما رآه أحد الأعمى من شدة نوره فكان يتبرقع حتى لا يتأذى الناظر إلى وجهه عند رؤيته وكان شيخنا أبو يعزى بالمغرب موسوي الورث فأعطاه الله هذه‏\nالكرامة فكان ما يرى أحد وجهه الأعمى فيمسح الرائي إليه وجهه بثوب مما هو عليه فيرد الله عليه بصره وممن رآه فعمي شيخنا أبو مدين رحمة الله تعالى عليهما حين رحل إليه فمسح عينيه بالثوب الذي على أبي يعزى فرد الله عليه بصره وخرق عوائده بالمغرب مشهورة وكان في زماني وما رأيته لما كنت عليه من الشغل وكان غيره من الأولياء المحمديين ممن هو أكبر منه في العلم والحال والقرب الإلهي لا يعرفهم أبو يعزى ولا غيره فمن جعل الله آيته في قلبه وكانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ في قربه فقد ملأ يديه من الخير كله واختصه واصطنعه لنفسه وكساه الصفة الحجابية غيرة منه عليه فلم تشهد حاله الأبصار في الدنيا وهم الأخفياء والأبرياء فمن تحققهم بالحق وليسوا برسل مشرعين حجبهم الحق لاحتجابه إلى يوم القيامة فيظهرهم الله في الموطن الذي بتجلى الله فيه لأبصار عباده ويظهر بنفسه وعينه للخاص والعام فهناك يعرف قدر المحمدي في القرب الإلهي بمقامه في تلاوته كلام ربه عز وجل وهو سكونه لما يتلوه من كشفه واطلاعه على معانيه فهو في حال تلاوته يستذكر ما عنده فيطلع على نفسه ويسمعه الله نثر كلامه ونظمه بتأييد الروح القدسي لما جاء في النظم المسمى شعرا من نفخ الشيطان إلا مثل هذا النظم وقد صح في الخبر أن حسان بن ثابت لما أراد أن يهجو قريشا ينافح بذلك عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قال له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قل يا حسان فإن روح القدس يؤيدك ما دمت تنافح عن عرض رسول الله‏\n\n\nفلم يجعل للشيطان عليه سبيلا وإذا كان هذا لمن ينافح فما ظنك بحال من ينطق عن الله بالله فيكون القائل منه عند قوله ربه عز وجل كما\n\n\nورد في الصحيح أن الله قال على لسان عبده سمع الله لمن حمده في الصلاة والحاضرون ما سمعوا إلا صوت المصلي‏\n\n\nوكلامه بهذا المتكلم به ما ينسبه الحق تعالى جلاله إلا إلى نفسه لا إلى المصلي فاعلم أيها الولي الحميم ذلك تسعد إن شاء الله‏\n\n\n> كلامي ليس غيري وهو غيري *** كما قلنا رميت وما رميتا\n\n\n> فيا نفسي إذا طلبت نفوس *** بمشهدك التحاما قول هيتا\n\n\n> ولا تبخل فإن البخل شؤم *** وتعلو بالعطاء إذا علوتا\n\n\n> وكن حقا ولا تظهر بزور *** وكن عين القرآن إذا تلوتا\n\n\n> لأن الله لم يسمع لعبد *** يناديه بما يتلوه صوتا\n\n\n> فإن يتلو بحق قال عبدي *** وكان خاله المشهود ميتا\n\n\n> لأن الحق ليس يراه حي *** لذا كتبوا على الأحياء موتا\n\n\nفكل من تلا وسكن لما تلا بصدق بصورة ظاهر وحكمة باطن فذلك تال وصاحب سكينة فإن هو تلا وسكن ظاهرا ولم يسكن باطنا والسكون الباطن فهم المعنى الساري في الوجود من تلك الآية المتلوة لا يقتصر بها على ما تدل عليه في الظاهر خاصة فمن تلا هكذا فليس بصاحب سكينة أصلا ولا هو وارث محمدي وإن كان من أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم فإن تلا وسكن باطنا ولم يسكن ظاهرا وتعدى الظاهر المشروع فذلك ليس بوارث ولا محمدي ولا بمؤمن وهو أبعد الناس من الله فإن الروح القدسي أول من يرميه ويرمى به والنبي محمد صَلَّى اللهُ عَليهِ وسَلَّم يقول لربه فيه يوم القيامة سحقا سحقا والله عند ذلك لا يسعده ولا يساعده وأعظم حسرة تقوم به إذا عاين يوم القيامة من سكن إليه إذا تلاه ظاهرا وباطنا فيرى ما سكن إليه باطنا قد سعد به هذا الآخر وشقي هو به وما شقي إلا بعدم سكون الظاهر فيفوته خير كثير حين فاته الايمان به فإنه أتى البيت من ظهره لم يأته من بابه جعلنا الله وإياكم ممن تلا فسكن وفي التلوين في تلاوته بحسب الآيات ثبت وتمكن أنه الملي بذلك والقادر عليه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Thirty-Eight: Concerning the Knowledge of the Descent of the Divine Presence, where He says: \"Whoever reads My speech sees My cloud in which are the lamps of My angels descending upon him and within him. And when he becomes silent, it is lifted from him, and I descend.\"\n\nMy speech is not other than Me, yet it is other than Me,\nAnd indeed, the likeness is the opposite of the likenesses.\n\nSo say to the Gnostics (العارفين), when you read\nThe Speech of God, then the finding (الوجدان) is loss.\n\nMy proof in its witnessing (شهادة) is letters (حروف),\nAnd in the Unseen (الغيب), the meanings (المعاني), and they are the limit.\n\nAnd the veils (الستور) were lowered, so he did not see Him,\nFor the very essence of nearness (عين القرب) is, in realization (التحقيق), distance.\n\nSo whoever reads the Quran, let him not reflect,\nNor look, for indeed the poison has witnessed.\n\n### [Tranquility (السكينة) for the Hearts of the Believers]\n\nGod Almighty said concerning the verse of Talut: <<وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ آيَةَ مُلْكِهِ أَنْ يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ من رَبِّكُمْ>> (And their Prophet said to them, 'Indeed, the sign of his kingship is that the Ark will come to you, in which is tranquility (سكينة) from your Lord'). God sent it down into the hearts of the believers of the community of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم). By this and similar things, this Muhammadan community became <<خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ>> (the best community brought forth for mankind). God, the Mighty and Majestic, said: <<هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ في قُلُوبِ الْمُؤْمِنِينَ>> (It is He who sent down tranquility (السكينة) into the hearts of the believers).\n\nWhat was a visible sign (شهادة) in other communities descended as an Unseen reality (غيبا) in this community. The people of spiritual taste (أهل الأذواق) found it in their hearts, making it an Attribute (صفة) of their own. In the communities preceding this one, it was external to them (أجنبية عنها). Thus, the sign of this community is in their hearts: \"Consult your heart, even if the jurists (المفتون) give you a ruling.\"\n\nDespite its being sent down into their hearts, God Almighty then made some of the Companions of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) witness it during his recitation of the Quran. He had a horse, and it began to stampede. He raised his head and saw a cloud (غمامة) containing lamps (سرج). Whenever he recited, it descended and drew near him, and when he became silent, it ascended. When he mentioned this to the Messenger of God (صَلَّى اللهُ عَليهِ وسَلَّم), the Messenger of God (صَلَّى اللهُ عَليهِ وسَلَّم) told him: \"That was the Tranquility (السكينة) that descended for the Quran.\"\n\nThis Companion saw, represented externally to his sight, what was actually within him. The Real (الحق) was a mirror for him, in which he saw the image of what was in his heart. The Quran is the remembrance of God, and <<بِذِكْرِ الله تَطْمَئِنُّ الْقُلُوبُ>> (by the remembrance of God do hearts find rest/tranquility). This is how God mentioned it to us in His Glorious Book. This rest/tranquility (الطمأنينة) is the tranquility (سكينة) that the Quran sends down into the hearts of the believers.\n\nThe signs (آيات) of the Children of Israel were manifest, while our signs are in our hearts. This is the difference between the Muhammadan inheritors (الورثة المحمديين) and the rest of the prophets. The inheritors of the other prophets are generally known by the extraordinary breaches of custom (خرق العوائد) that appear through them. The inheritor of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) is unknown generally but known specifically, because his breach of custom is only a spiritual state (حال) and knowledge (علم) in his heart. He increases in knowledge of his Lord with every breath—a knowledge of state and spiritual taste (علم حال وذوق) that never ceases. Junayd drew attention to this by the variation in his answers to the same question concerning Unity (التوحيد) within a single session, due to the subtle differences in moments of time (دقائق الزمان). Qushayri mentioned this at the beginning of his famous *Risala*.\n\nThe more the Muhammadan inheritor increases in knowledge of his Lord, the more he increases in nearness (قربا). They are the Near Ones (المقربون). Their outward states proceed according to customary laws, so they are known, yet they are not known. They convey the knowledge God has granted them through the path of sincere counsel (النصح) to this community. The common people (العامة) do not recognize the value of this, because they are accustomed to hearing similar things from the scholars of external law (علماء الرسوم) when they speak about the knowledge of God, the Mighty and Majestic, through the path of intellectual proof (طريق الدليل). They do not distinguish between the knowledge of proof (علم الدليل) and the knowledge of spiritual taste (علم الذوق). As for the scholars of external law, they usually declare the Sufis to be unbelievers, even though they accept the very same knowledge when it is transmitted directly from the Messenger of God (صَلَّى اللهُ عَليهِ وسَلَّم) in the Quran or in a Divine or non-Divine report.\n\nLook at how severe this blindness (العمي) is! Had the Messenger of God (صَلَّى اللهُ عَليهِ وسَلَّم) not been sent as a Messenger, no manifest sign would have appeared through him generally, as appeared through those who preceded him. The signs (الآيات) that were transmitted generally concerning him (صَلَّى اللهُ عَليهِ وسَلَّم) only occurred because he was a Messenger, out of God Almighty's kindness (رفقا) to this community and to establish proof against those who denied him and what he brought. Do you not see how the Messenger of God (صَلَّى اللهُ عَليهِ وسَلَّم) was taken on the Night Journey (أسرى به) to the known station, which the Quran and the sound reports confirm? Yet, when he went out to the people the morning after that night and mentioned to the Companions what had transpired between him and his Lord during his Night Journey, some of his Companions denied him, because they saw no outward trace of it. Rather, it only increased the burden of their religious obligations.\n\nWhen Moses (عليه السلام) returned from his Lord, God clothed his face with a light (نورا) by which the truth of his claim was known. No one saw him without being blinded by the intensity of his light, so he had to wear a veil (يتبرقع) so that those looking at his face would not be harmed upon seeing him. Our Shaykh Abu Ya'za in the Maghrib (Morocco) was an inheritor of the Mosaic path (موسوي الورث). God granted him this miraculous gift (الكرامة). No one saw his face without being blinded. The viewer would wipe his face with a piece of cloth from what Abu Ya'za was wearing, and God would restore his sight. Among those who saw him and were blinded was our Shaykh Abu Madyan (رحمة الله تعالى عليهما) when he traveled to him. He wiped his eyes with the cloth that was on Abu Ya'za, and God restored his sight. His breaches of custom are famous in the Maghrib. He lived in my time, but I did not meet him due to my preoccupation.\n\nYet, there were other Muhammadan saints (الأولياء المحمديين) who were greater than him in knowledge, spiritual state (الحال), and Divine nearness (القرب الإلهي), whom neither Abu Ya'za nor anyone else knew. Whoever has his sign placed by God in his heart, and is <<عَلى‏ بَيِّنَةٍ من رَبِّهِ>> (upon clear evidence from his Lord) in his nearness, has filled his hands with all goodness. God has chosen him and fashioned him for Himself, clothing him in the Attribute of Veiling (الصفة الحجابية) out of Divine jealousy (غيرة منه عليه). Thus, their state is not witnessed by eyes in this world. They are the Hidden Ones (الأخفياء) and the Innocent Ones (الأبرياء).\n\nThose who are realized by the Real (تحققهم بالحق), and who are not legislative Messengers (رسل مشرعين), are veiled by the Real due to His own Self-veiling (احتجابه) until the Day of Resurrection. God will manifest them in the station where God discloses Himself (يتجلى الله فيه) to the sight of His servants, and where He manifests Himself, in His Essence and Eye, to the elite and the common folk. It is there that the worth of the Muhammadan inheritor in Divine nearness (القرب الإلهي) will be known, by his station in the recitation of the speech of his Lord, the Mighty and Majestic. This station is his tranquility (سكونه) during recitation, derived from his unveiling (كشفه) and his insight into its meanings. While reciting, he recalls what he possesses, gaining insight into his own self.\n\nGod makes him hear the prose and poetry of His speech through the support of the Holy Spirit (الروح القدسي), except for the poetry that comes from the breath of Satan, save for poetry like this [the one being discussed]. It is confirmed in the report that when Hassan ibn Thabit wished to satirize the Quraysh in defense of the Messenger of God (صَلَّى اللهُ عَليهِ وسَلَّم), the Messenger of God (صَلَّى اللهُ عَليهِ وسَلَّم) said to him: \"Speak, O Hassan, for the Holy Spirit supports you as long as you defend the honor of the Messenger of God.\" Thus, no path was made for Satan over him. If this is the case for one who merely defends, what do you think of the state of one who speaks *from* God *by* God?\n\nThe speaker in this case is the Real (الحق) when His servant says, \"God hears the one who praises Him\" (سمع الله لمن حمده) in prayer, as reported in the sound Hadith, where God said this upon the tongue of His servant. Yet, those present heard only the voice of the one praying. The Real (الحق تعالى جلاله) attributes this speech, spoken by this speaker, only to Himself, not to the one praying. Know this, O intimate friend (الولي الحميم), and you shall be happy, God willing.\n\nMy speech is not other than Me, yet it is other than Me,\nJust as We said, \"You threw, yet it was not you who threw.\"\n\nO my soul, if souls seek\nTo be joined in your witnessing (مشهدك), say, \"Come forth!\"\n\nAnd do not be stingy, for stinginess is ill-omened,\nAnd you rise through giving when you ascend.\n\nAnd be the Real (حقاً) and do not appear falsely,\nAnd be the very essence of the Quran when you recite.\n\nBecause God does not hear a servant\nWho calls upon Him with what he recites merely as a sound.\n\nBut if he recites with the Real (بحق), He says, \"My servant,\"\nWhile his witnessed state (خاله المشهود) was dead.\n\nBecause the Real (الحق) is not seen by the living,\nTherefore, they decreed death upon the living.\n\nEveryone who recites and achieves tranquility (سكن) in what he recites with sincerity, both in outward form (صورة ظاهر) and inward wisdom (حكمة باطن), is a reciter and a possessor of tranquility (صاحب سكينة). Inner tranquility (السكون الباطن) is the comprehension of the meaning that permeates Existence (المعنى الساري في الوجود) from that recited verse, not limiting it only to what it indicates outwardly.\n\nWhoever recites and achieves outward tranquility but not inward tranquility—he is not a possessor of tranquility at all, nor is he a Muhammadan inheritor, even if he belongs to the community of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم). If he recites and achieves inward tranquility but not outward tranquility, and transgresses the prescribed outward law (الظاهر المشروع), then he is neither an inheritor nor a Muhammadan, nor a believer. He is the furthest person from God. The Holy Spirit (الروح القدسي) is the first to cast him out and cast him away. On the Day of Resurrection, the Prophet Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) will say to his Lord concerning him, \"Away with him! Away with him!\" God will neither grant him happiness nor aid him.\n\nHis greatest regret on the Day of Resurrection will be when he witnesses the one who achieved tranquility through recitation, both outwardly and inwardly. He will see that what he attained inwardly brought happiness to that other person, while he himself was wretched because of it. He became wretched only due to the lack of outward tranquility, thus missing out on great goodness when he missed faith in it. He approached the House from its back, not from its door. May God make us and you among those who recite and achieve tranquility, and who remain firm and established in the variation (التلوين) of their recitation according to the verses. Indeed, He is the One capable of that and powerful over it. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And God speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو اڑتیس: اس شخص کے مقام کی معرفت میں جو میرا کلام پڑھتا ہے، وہ میرا بادل (غمامہ) دیکھتا ہے جس میں میرے فرشتوں کے چراغ (سرج) ہیں جو اس پر اور اس کے اندر نازل ہوتے ہیں، اور جب وہ خاموش ہو جاتا ہے تو وہ بادل اس سے اٹھا لیا جاتا ہے اور میں (ذات حق) نازل ہو جاتا ہوں۔\n\nمیرا کلام میں ہی ہوں اور وہ مجھ سے غیر بھی ہے\nاور بے شک مثالیں مثالوں کے لیے ضد ہوتی ہیں۔\n\nپس عارفوں سے کہو کہ جب تم کلام اللہ پڑھو\nتو وجدان (باطنی ادراک) گم ہو جاتا ہے۔\n\nشہود (شہود) میں میری دلیل حروف ہیں\nاور غیب میں معانی ہیں اور وہی حد ہیں۔\n\nاور پردے لٹکا دیے گئے، پس اس نے اسے نہ دیکھا\nکیونکہ تحقیق میں قرب کی آنکھ دوری ہے۔\n\nپس جو قرآن پڑھے وہ نہ غور و فکر کرے اور نہ دیکھے\nکیونکہ زہر نے گواہی دی ہے۔\n\n### [مؤمنوں کے دلوں کے لیے سکینہ]\n\nاللہ تعالیٰ نے طالوت کی آیت میں فرمایا: اور ان کے نبی نے ان سے کہا کہ اس کی بادشاہی کی نشانی یہ ہے کہ تمہارے پاس وہ صندوق (تابوت) آئے گا جس میں تمہارے رب کی طرف سے سکینہ (سکينة) ہے۔ (البقرہ: ۲۴۸) اور اللہ نے اسے امت محمد صلی اللہ علیہ وسلم کے مؤمنین کے دلوں میں نازل فرمایا۔ اسی اور اس جیسی چیزوں کی وجہ سے یہ امت محمدیہ لوگوں کے لیے نکالی گئی بہترین امت (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ) ہے۔ (آل عمران: ۱۱۰) اللہ عزوجل نے فرمایا: وہی ہے جس نے مؤمنوں کے دلوں میں سکینہ (سکينة) نازل فرمایا۔ (الفتح: ۴) پس جو چیز دوسری امتوں میں شہود (شہود) (ظاہری مشاہدہ) تھی، وہ اس امت میں غیب کے طور پر نازل ہوئی، جسے اہل ذوق نے اپنے دلوں میں پایا۔ پس یہ ان کی صفات میں سے ایک صفت بن گئی، جبکہ اس امت سے پہلے کی امتوں میں یہ ان کے لیے اجنبی تھی۔ پس اس امت کی علامت ان کے دلوں میں ہے: اپنے دل سے فتویٰ لو، اگرچہ مفتی تمہیں فتویٰ دے دیں۔ اور اس کے باوجود کہ یہ ان کے دلوں میں نازل شدہ ہے۔\n\nپھر اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کے بعض صحابہ کو قرآن کی تلاوت کے دوران اس کا مشاہدہ کرایا۔ ان کے پاس ایک گھوڑا تھا جو اچھلنے لگا۔ انہوں نے اپنا سر اٹھایا تو ایک بادل (غمامہ) دیکھا جس میں چراغ (سرج) تھے، جب بھی وہ تلاوت کرتے تو وہ نیچے اترتا اور ان کے قریب ہو جاتا، اور جب وہ خاموش ہو جاتے تو وہ اوپر اٹھ جاتا۔ جب انہوں نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: وہ سکینہ (سکينة) تھی جو قرآن کے لیے نازل ہوئی تھی۔\n\nپس اس صحابی نے اپنی بصارت سے اپنے اندر کی چیز کو باہر مجسم (مثال) ہوتے ہوئے دیکھا۔ پس ذات حق (الحق) ان کے لیے ایک آئینہ بن گئی جس میں انہوں نے اپنے دل کی صورت دیکھی۔ بے شک قرآن اللہ کا ذکر ہے، اور اللہ کے ذکر سے دلوں کو اطمینان (تَطْمَئِنُّ الْقُلُوبُ) حاصل ہوتا ہے۔ (الرعد: ۲۸) اسی طرح اللہ نے ہمیں اپنی عزیز کتاب میں ذکر فرمایا ہے۔ اور اطمینان ہی وہ سکینہ (سکينة) ہے جسے قرآن نے مؤمنوں کے دلوں میں نازل کیا۔ پس بنی اسرائیل کی نشانیاں ظاہری تھیں اور ہماری نشانیاں ہمارے دلوں میں ہیں۔ اور یہی فرق ہے ورثاء محمدیین (الورثة المحمديين) اور دیگر انبیاء کے درمیان۔ پس انبیاء کے ورثاء عام طور پر ان خرق عادات کے ذریعے پہچانے جاتے ہیں جو ان سے ظاہر ہوتی ہیں، جبکہ وارث محمد صلی اللہ علیہ وسلم عام لوگوں میں مجہول (نامعلوم) اور خاص لوگوں میں معلوم ہوتے ہیں، کیونکہ ان کی خرق عادت صرف ان کے دل میں ایک حال اور علم ہوتی ہے۔ پس وہ ہر سانس میں اپنے رب کے علم میں بڑھتے رہتے ہیں، یہ حالی اور ذوقی علم (علم حال وذوق) ہے جو ہمیشہ جاری رہتا ہے۔\n\nاور جنید بغدادی نے اس پر تنبیہ کی ہے کہ وہ ایک ہی مجلس میں توحید کے ایک ہی مسئلے کے مختلف جوابات دیتے تھے، جو وقت کی باریکیوں کے اختلاف کی وجہ سے تھا۔ قشیری نے اپنی منسوب رسالہ کے آغاز میں اس کا ذکر کیا ہے۔ اور جتنا محمدی (المحمدي) اپنے رب کے علم میں بڑھتا ہے، اتنا ہی قرب میں بڑھتا ہے۔ پس وہی مقربین ہیں۔ ان کے ظاہری احوال عادات کے حکم کے مطابق جاری ہوتے ہیں، پس وہ پہچانے بھی جاتے ہیں اور نہیں بھی پہچانے جاتے۔ اور وہ اس علم کے ساتھ آتے ہیں جو اللہ نے انہیں عطا کیا ہے، اس امت کی نصیحت کے راستے میں۔ پس عام لوگ اس کی قدر نہیں جانتے، کیونکہ وہ رسمی علماء (علماء الرسوم) سے اس طرح کی بات سننے کے عادی ہیں جب وہ اللہ عزوجل کے علم کے بارے میں استدلالی طریقے (علم الدليل) سے بات کرتے ہیں، اور انہوں نے استدلالی علم اور ذوقی علم (علم الذوق) کے درمیان فرق نہیں کیا۔\n\nاور جہاں تک رسمی علماء (علماء الرسوم) کا تعلق ہے، وہ اکثر انہیں کافر قرار دیتے ہیں، حالانکہ اگر وہی بات قرآن یا خبر الٰہی یا غیر الٰہی میں رسول اللہ صلی اللہ علیہ وسلم سے منقول ہو تو وہ اسے بعینہ تسلیم کر لیتے ہیں۔ پس دیکھو یہ اندھا پن کتنا شدید ہے۔ اور اگر رسول اللہ صلی اللہ علیہ وسلم کو رسول بنا کر نہ بھیجا جاتا تو آپ پر کوئی ظاہری نشانی عام لوگوں میں ظاہر نہ ہوتی، جیسا کہ آپ سے پہلے والوں پر ظاہر ہوئی۔ پس آپ صلی اللہ علیہ وسلم سے جو نشانیاں عام طور پر منقول ہیں، وہ صرف آپ کے رسول ہونے کی وجہ سے تھیں، جو اللہ تعالیٰ کی طرف سے اس امت پر شفقت اور آپ کو جھٹلانے والوں اور آپ کی لائی ہوئی چیزوں کو جھٹلانے والوں پر حجت قائم کرنے کے لیے تھیں۔\n\nکیا تم نہیں دیکھتے کہ رسول اللہ صلی اللہ علیہ وسلم کو اس مقام کی طرف کیسے معراج کرائی گئی جو معروف ہے اور جس کا ذکر قرآن اور صحیح خبر میں آیا ہے؟ جب آپ اس رات کی صبح لوگوں کے پاس باہر تشریف لائے اور صحابہ سے وہ سب کچھ بیان کیا جو آپ کے معراج میں آپ کے اور آپ کے رب کے درمیان پیش آیا تھا، تو بعض صحابہ نے اس کا انکار کیا، کیونکہ انہوں نے ظاہر میں اس کا کوئی اثر نہیں دیکھا، بلکہ اس نے ان کے لیے تکالیف میں ایک حکم کا اضافہ کر دیا۔ اور موسیٰ علیہ السلام جب اپنے رب کے پاس سے آئے تو اللہ نے ان کے چہرے پر ایک نور کی چادر اوڑھا دی جس سے ان کے دعوے کی سچائی پہچانی جاتی تھی۔ ان کے نور کی شدت کی وجہ سے جس نے بھی انہیں دیکھا وہ اندھا ہو گیا، پس وہ نقاب ڈالتے تھے تاکہ ان کے چہرے کو دیکھنے والا تکلیف نہ اٹھائے۔\n\nاور ہمارے شیخ ابو یعزیٰ مغرب (مراکش) میں موسوی وارث تھے، پس اللہ نے انہیں یہ کرامت عطا فرمائی۔ جو بھی ان کا چہرہ دیکھتا وہ اندھا ہو جاتا، تو دیکھنے والا اپنے چہرے کو اس کپڑے سے مس کرتا جو ان کے جسم پر ہوتا، تو اللہ اس کی بینائی واپس کر دیتا۔ ان لوگوں میں سے جنہوں نے انہیں دیکھا اور اندھے ہو گئے، ہمارے شیخ ابو مدین رحمۃ اللہ علیہما بھی تھے، جب وہ ان کی طرف سفر کر کے گئے، تو انہوں نے اپنی آنکھوں کو اس کپڑے سے مس کیا جو ابو یعزیٰ پر تھا، تو اللہ نے ان کی بینائی واپس کر دی۔ ان کی خرق عادات مغرب میں مشہور ہیں۔ وہ میرے زمانے میں تھے لیکن میں نے انہیں نہیں دیکھا، کیونکہ میں اپنے مشاغل میں مصروف تھا۔ اور ان کے علاوہ دیگر اولیاء محمدیین (الأولياء المحمديين) بھی تھے جو علم، حال اور قرب الٰہی میں ان سے بڑے تھے، جنہیں نہ ابو یعزیٰ جانتے تھے اور نہ کوئی اور۔\n\nپس جس شخص کی نشانی اللہ نے اس کے دل میں رکھ دی اور وہ اپنے قرب میں اپنے رب کی طرف سے دلیل (بَيِّنَةٍ من رَبِّهِ) پر تھا، (ہود: ۱۷) تو اس نے تمام خیر سے اپنے ہاتھ بھر لیے، اور اللہ نے اسے خاص کر لیا اور اپنے لیے چن لیا، اور غیرت کی وجہ سے اسے حجابی صفت کا لباس پہنایا۔ پس دنیا میں آنکھیں اس کے حال کا مشاہدہ نہیں کرتیں، اور یہی لوگ اخفیاء (الأخفياء) اور ابرار (الأبرياء) ہیں۔ پس جو لوگ ذات حق (الحق) کے ساتھ متحقق ہوئے اور وہ رسول مشرع نہیں ہیں، ذات حق (الحق) نے انہیں اپنے حجاب کی وجہ سے قیامت تک کے لیے پردے میں رکھا۔ اللہ انہیں اس مقام پر ظاہر کرے گا جہاں اللہ اپنے بندوں کی آنکھوں کے لیے ظہور (تجلی) فرمائے گا اور خود خاص و عام کے لیے ظاہر ہو گا۔ تب وہاں محمدی (المحمدي) کا قدر قرب الٰہی میں اس کے مقام کے ذریعے پہچانا جائے گا، جو اس کے رب عزوجل کے کلام کی تلاوت میں ہے۔\n\nاور وہ اس کا سکون ہے جب وہ تلاوت کرتا ہے، جو اس کے کشف (الکشف) اور اس کے معانی پر مطلع ہونے سے حاصل ہوتا ہے۔ پس وہ اپنی تلاوت کے حال میں اپنے پاس موجود چیزوں کو یاد کرتا ہے، اور اپنے نفس پر مطلع ہوتا ہے، اور اللہ اسے اس کے کلام کا نثر اور نظم روح القدس (الروح القدسي) کی تائید سے سناتا ہے۔ کیونکہ جو نظم شعر کہلاتا ہے وہ شیطان کی پھونک سے ہوتا ہے، سوائے اس طرح کے نظم کے۔ اور خبر میں صحیح ثابت ہے کہ جب حسان بن ثابت نے قریش کی ہجو کرنے کا ارادہ کیا تاکہ اس کے ذریعے رسول اللہ صلی اللہ علیہ وسلم کی طرف سے دفاع کریں، تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: اے حسان! کہو، کیونکہ جب تک تم رسول اللہ کی عزت کا دفاع کرتے رہو گے، روح القدس (روح القدس) تمہاری تائید کرتا رہے گا۔\n\nپس شیطان کے لیے ان پر کوئی راستہ نہیں بنایا گیا۔ اور جب یہ حال اس شخص کا ہے جو دفاع کرتا ہے، تو اس شخص کے حال کے بارے میں تمہارا کیا گمان ہے جو اللہ کی طرف سے اللہ کے ذریعے بولتا ہے؟ پس وہ کہنے والا اس وقت اللہ عزوجل کا قول ہوتا ہے، جیسا کہ صحیح حدیث میں آیا ہے کہ اللہ نے اپنے بندے کی زبان پر فرمایا: سَمِعَ اللهُ لِمَنْ حَمِدَهُ (اللہ نے اس کی سن لی جس نے اس کی تعریف کی) نماز میں، حالانکہ حاضرین نے صرف نمازی کی آواز سنی۔ اور اس کلام کو، جو اس کے ذریعے بولا گیا، ذات حق (الحق) تعالیٰ جلالہ صرف اپنی طرف منسوب کرتا ہے، نہ کہ نمازی کی طرف۔ پس اے ولی حمیم! یہ جان لو، ان شاء اللہ تم کامیاب ہو جاؤ گے۔\n\nمیرا کلام میں ہی ہوں اور وہ مجھ سے غیر بھی ہے\nجیسا کہ ہم نے کہا: تم نے نہیں پھینکا جب تم نے پھینکا۔ (الأنفال: ۱۷)\n\nپس اے میرے نفس! جب نفوس تمہارے مشاہدہ (شہود) میں\nیکجا ہونے کا مطالبہ کریں تو کہو: ہیتا (آؤ)۔\n\nاور بخل نہ کرو، کیونکہ بخل نحوست ہے\nاور جب تم بلند ہوتے ہو تو سخاوت سے بلند ہوتے ہو۔\n\nاور حق (الحق) بن جاؤ اور جھوٹ کے ساتھ ظاہر نہ ہو\nاور جب تم تلاوت کرو تو قرآن کی عین ذات بن جاؤ۔\n\nکیونکہ اللہ کسی بندے کی آواز نہیں سنتا\nجو اسے اس چیز کے ساتھ پکارتا ہے جس کی وہ تلاوت کرتا ہے۔\n\nپس اگر وہ حق (الحق) کے ساتھ تلاوت کرے تو اللہ کہتا ہے: یہ میرا بندہ ہے\nاور اس کا مشہود (المشہود) حال مردہ ہو چکا ہوتا ہے۔\n\nکیونکہ ذات حق (الحق) کو کوئی زندہ نہیں دیکھتا\nاسی لیے انہوں نے زندوں پر موت لکھ دی۔\n\nپس ہر وہ شخص جس نے تلاوت کی اور جو تلاوت کی اس پر صدق کے ساتھ ظاہری صورت اور باطنی حکمت کے ساتھ سکون اختیار کیا، تو وہ تلاوت کرنے والا اور صاحب سکینہ (سکينة) ہے۔ اور اگر اس نے تلاوت کی اور ظاہری طور پر سکون اختیار کیا لیکن باطنی طور پر سکون اختیار نہ کیا—اور باطنی سکون یہ ہے کہ تلاوت کی جانے والی اس آیت سے ہستی (الوجود) میں سرایت کرنے والے معنی کو سمجھا جائے اور صرف اس کے ظاہری مفہوم پر اکتفا نہ کیا جائے—تو جس نے اس طرح تلاوت کی وہ اصلاً صاحب سکینہ (سکينة) نہیں ہے اور نہ ہی وہ وارث محمدی (وارث محمدي) ہے، اگرچہ وہ امت محمد صلی اللہ علیہ وسلم میں سے ہو۔ اور اگر اس نے تلاوت کی اور باطنی طور پر سکون اختیار کیا لیکن ظاہری طور پر سکون اختیار نہ کیا اور ظاہری شریعت سے تجاوز کر گیا، تو وہ نہ وارث ہے، نہ محمدی، اور نہ ہی مؤمن ہے۔ اور وہ اللہ سے سب سے زیادہ دور ہے۔ کیونکہ روح القدس (الروح القدسي) سب سے پہلے اسے پھینکتا ہے اور اس کے ذریعے پھینکا جاتا ہے۔ اور نبی محمد صلی اللہ علیہ وسلم قیامت کے دن اپنے رب سے اس کے بارے میں فرمائیں گے: دوری ہو، دوری ہو۔ اور اللہ اس وقت اسے نہ سعادت بخشے گا اور نہ اس کی مدد کرے گا۔ اور سب سے بڑی حسرت جو اسے لاحق ہو گی جب وہ قیامت کے دن اس شخص کو دیکھے گا جس نے ظاہری اور باطنی طور پر تلاوت کرتے ہوئے سکون اختیار کیا تھا، تو وہ دیکھے گا کہ جس چیز پر اس نے باطنی طور پر سکون اختیار کیا تھا، اس دوسرے شخص نے اس سے سعادت حاصل کر لی اور یہ خود اس کی وجہ سے بدبخت ہوا، اور وہ صرف ظاہری سکون نہ ہونے کی وجہ سے بدبخت ہوا، پس جب اس سے ایمان فوت ہو گیا تو اس کا بہت سا خیر فوت ہو گیا۔ کیونکہ وہ گھر میں اس کے دروازے سے نہیں آیا بلکہ اس کی پشت سے آیا۔ اللہ ہمیں اور آپ کو ان لوگوں میں شامل کرے جنہوں نے تلاوت کی اور سکون اختیار کیا، اور اپنی تلاوت میں آیات کے مطابق رنگ بدلنے میں ثابت قدم رہے اور مضبوط ہوئے، بے شک وہی اس کا مالک ہے اور اس پر قادر ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔ (الاحزاب: ۴)",
    "fa": "باب چهارصد و سی و هشتم در معرفت منزلت کسی که کلام مرا بخواند و ابری را ببیند که چراغ‌های فرشتگانم در آن است و بر او و در او فرود می‌آید، و چون سکوت کند، آن ابر از او برداشته می‌شود و من فرود می‌آیم.\n\nکلام من غیر من نیست و در عین حال غیر من است *** و همانا مَثَل برای مَثَل‌ها ضد است.\n\nپس به عارفان بگو: چون کلام خدا را بخوانید *** پس وجدان (یافت) از دست رفته است.\n\nدلیل من در شهودش (الشهود) حروف است *** و در غیب، معانی است و آن حد و مرز است.\n\nو پرده‌ها آویخته شد، پس آن را ندید *** پس عین قرب در حقیقت (التحقیق) دوری است.\n\nپس هر که قرآن بخواند، نباید بیندیشد *** و نباید بنگرد، زیرا زهر، عسل است.\n\n### [سکینه (آرامش) برای دل‌های مؤمنان]\n\nخداوند متعال در آیه طالوت فرمود: «وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ آيَةَ مُلْكِهِ أَنْ يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِنْ رَبِّكُمْ» (و پیامبرشان به آنان گفت: نشانه پادشاهی او این است که تابوت [عهد] به سوی شما می‌آید که در آن آرامشی (سکینه) از جانب پروردگارتان است). و خداوند آن را در دل‌های مؤمنان از امت محمد (صلی الله علیه و سلم) نازل کرد. و به واسطه این و امثال آن بود که این امت محمدیه «خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ» (بهترین امتی است که برای مردم پدیدار شده است). خداوند عز و جل فرمود: «هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ» (اوست که آرامش (السکینة) را در دل‌های مؤمنان نازل کرد). پس آنچه در امت‌های دیگر به صورت شهود (ظاهر) بود، در این امت به صورت غیب نازل شد و اهل ذوق آن را در دل‌های خود یافتند. پس این (سکینه) صفتی از صفات آنان شد، در حالی که در امت‌های پیشین نسبت به آنان بیگانه بود. پس نشانه این امت در دل‌هایشان است: «از دلت فتوا بخواه، اگرچه مفتیان به تو فتوا دهند.» و با وجود اینکه این (سکینه) در دل‌هایشان نازل شده است.\n\nسپس خداوند متعال آن (سکینه) را به برخی از اصحاب محمد (صلی الله علیه و سلم) هنگام تلاوت قرآن نشان داد. او اسبی داشت که شروع به لگد زدن کرد. سرش را بالا برد و ابری دید که در آن چراغ‌هایی بود؛ هرگاه قرائت می‌کرد، آن ابر پایین می‌آمد و به او نزدیک می‌شد، و چون سکوت می‌کرد، بالا می‌رفت. هنگامی که این را برای رسول خدا (صلی الله علیه و سلم) بازگو کرد، رسول خدا (صلی الله علیه و سلم) به او فرمود: «آن سکینه (السکینة) بود که برای قرآن نازل شده بود.»\n\nپس این صحابی آنچه را که در درونش بود، به صورت مثالی خارج از خود با چشمش دید. پس حق (الحق) برای او آینه‌ای بود که صورت آنچه در قلبش بود را در آن مشاهده کرد. زیرا قرآن ذکر خداست و «بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ» (با یاد خدا دل‌ها آرام می‌گیرد). خداوند در کتاب عزیزش این‌گونه برای ما ذکر کرده است. و این اطمینان، همان سکینه‌ای است که قرآن در دل‌های مؤمنان نازل کرده است. پس آیات بنی اسرائیل آشکار بود، اما آیات ما در دل‌های ماست. و این تفاوت میان وارثان محمدی و سایر انبیاست.\n\nپس وارثان انبیا عموماً به واسطه خرق عاداتی که از آنان ظاهر می‌شود شناخته می‌شوند، اما وارث محمد (صلی الله علیه و سلم) در عموم ناشناخته و در خصوص معلوم است؛ زیرا خرق عادت او تنها حال و علمی است در قلبش. پس او در هر نفس، علمش به پروردگارش افزون می‌شود؛ علمی که علم حال و ذوق است و پیوسته چنین است. جنید (الجنید) به این نکته با اختلاف پاسخ‌هایش به یک مسئله واحد توحید در یک مجلس، به دلیل تفاوت‌های دقیق زمانی، اشاره کرده است. قشیری این مطلب را در ابتدای رساله‌ای که به او منسوب است، ذکر کرده است.\n\nو هرچه محمدی (وارث محمدی) علمش به پروردگارش بیشتر شود، قربش افزون می‌گردد؛ پس آنان مقربان هستند. احوال ظاهری آنان بر اساس حکم عادات جاری است، پس شناخته می‌شوند و شناخته نمی‌شوند. و آنچه را خداوند از علم به او عطا کرده است، در راه نصیحت این امت می‌آورند، اما عامه مردم قدر آن را نمی‌دانند، زیرا آنان به شنیدن چنین سخنانی در علم به خداوند عز و جل از طریق دلیل از علمای رسوم عادت کرده‌اند و میان علم دلیل و علم ذوق تفاوتی قائل نمی‌شوند. اما علمای رسوم غالباً آنان را تکفیر می‌کنند، با وجود اینکه عین همان مطلب را اگر از رسول خدا (صلی الله علیه و سلم) در قرآن یا خبر الهی و غیر الهی نقل شود، می‌پذیرند. پس بنگر که این کوری چقدر شدید است!\n\nو اگر نه این بود که رسول خدا (صلی الله علیه و سلم) به عنوان رسول مبعوث شد، آیه ظاهری در عموم بر او آشکار نمی‌شد، چنانکه بر پیشینیان آشکار شد. پس آنچه از آیات که در عموم از او (صلی الله علیه و سلم) نقل شده، تنها به دلیل رسول بودن او بوده است؛ از باب مهربانی خداوند متعال به این امت و اقامه حجت بر کسی که او و آنچه آورده بود را تکذیب می‌کرد. آیا نمی‌بینی که رسول خدا (صلی الله علیه و سلم) چگونه به مقامی که شناخته شده است و قرآن و خبر صحیح آن را آورده، به معراج برده شد؟ اما هنگامی که صبح آن شب نزد مردم آمد و آنچه را که در معراج میان او و پروردگارش رخ داده بود برای اصحاب ذکر کرد، برخی از اصحابش آن را انکار کردند، زیرا در ظاهر اثری از آن ندیده بودند، بلکه تنها حکمی بر تکالیفشان افزوده شد. و موسی (علیه السلام) هنگامی که از نزد پروردگارش بازگشت، خداوند نوری بر چهره‌اش پوشاند که صدق ادعایش با آن شناخته می‌شد. هیچ کس او را ندید مگر اینکه از شدت نورش کور شد، پس او نقاب می‌زد تا بیننده هنگام دیدن چهره‌اش آزار نبیند.\n\nو شیخ ما، ابویعزی در مغرب، وارث موسوی بود. پس خداوند این کرامت را به او عطا کرده بود؛ به طوری که هیچ کس چهره او را نمی‌دید مگر اینکه کور می‌شد. پس بیننده صورت خود را با جامه‌ای که بر تن ابویعزی بود مسح می‌کرد و خداوند بینایی‌اش را به او باز می‌گرداند. از کسانی که او را دید و کور شد، شیخ ما ابومدین (رحمة الله تعالی علیهما) بود، هنگامی که به سوی او سفر کرد. پس چشمانش را با جامه‌ای که بر ابویعزی بود مسح کرد و خداوند بینایی‌اش را به او بازگرداند. خرق عادات او در مغرب مشهور است. او در زمان من بود، اما به دلیل اشتغالی که داشتم، او را ندیدم.\n\nو دیگرانی از اولیای محمدی بودند که در علم و حال و قرب الهی (القرب الإلهی) از او بزرگ‌تر بودند، اما نه ابویعزی و نه دیگران آنان را نمی‌شناختند. پس کسی که خداوند آیت خود را در قلبش قرار داده و «كَانَ عَلَى بَيِّنَةٍ مِنْ رَبِّهِ» (برهان و حجتی از پروردگارش دارد) در قربش (قرب)، دستانش را از همه خیر پر کرده و خداوند او را مخصوص خود گردانیده و برای خویش ساخته و صفت حجاب را از روی غیرت بر او پوشانده است. پس دیده‌ها حال او را در دنیا مشاهده نمی‌کنند. آنان اخفیا (پنهان‌شدگان) و ابرار (نیکان) هستند. کسانی که به حق (الحق) متحقق شده‌اند و رسولان صاحب شریعت نیستند، حق (الحق) آنان را به دلیل احتجاب خود تا روز قیامت محجوب کرده است. پس خداوند آنان را در موطنی آشکار می‌سازد که در آن خداوند برای دیدگان بندگانش تجلی (التجلی) می‌کند و خود او با ذات و عینش برای خاص و عام ظاهر می‌شود. در آنجاست که قدر محمدی در قرب الهی (القرب الإلهی) به واسطه مقامش در تلاوت کلام پروردگار عز و جل شناخته می‌شود.\n\nو آن (مقام) سکون اوست هنگام تلاوت، که ناشی از کشف (الکشف) و آگاهی او بر معانی آن است. پس او در حال تلاوت، آنچه نزد خود دارد را به یاد می‌آورد و بر نفس خود آگاه می‌شود. و خداوند نثر و نظم کلامش را با تأیید روح القدس به او می‌شنواند، برخلاف نظمی که شعر نامیده می‌شود و از دمیدن شیطان است، مگر نظمی مانند این. و در خبر صحیح آمده است که حسان بن ثابت هنگامی که خواست قریش را هجو کند و بدین وسیله از رسول خدا (صلی الله علیه و سلم) دفاع نماید، رسول خدا (صلی الله علیه و سلم) به او فرمود: «بگو ای حسان، زیرا روح القدس تو را تأیید می‌کند تا زمانی که از آبروی رسول خدا دفاع می‌کنی.»\n\nپس شیطان را بر او راهی نیست. و اگر این حال کسی باشد که دفاع می‌کند، گمانت به حال کسی که از جانب خدا و به واسطه خدا سخن می‌گوید چیست؟ به طوری که گوینده از او، در هنگام گفتن پروردگار عز و جل باشد، چنانکه در حدیث صحیح آمده است که خداوند بر زبان بنده‌اش فرمود: «سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ» (خداوند سخن کسی که او را ستایش کند شنید) در نماز، در حالی که حاضران جز صدای نمازگزار را نشنیدند.\n\nو کلام او با این متکلم، چیزی است که حق (الحق) تعالی جلاله آن را جز به خود نسبت نمی‌دهد، نه به نمازگزار. پس ای ولیّ صمیمی، این را بدان تا ان‌شاءالله سعادتمند شوی.\n\nکلام من غیر من نیست و در عین حال غیر من است *** چنانکه گفتیم: «رَمَيْتَ وَمَا رَمَيْتَ» (تو پرتاب کردی و پرتاب نکردی).\n\nپس ای نفس من، اگر نفوس طلب کنند *** در مشهد (الشهود) تو پیوستگی را، بگو: «هَیْتَ» (بشتاب).\n\nو بخل نورز، زیرا بخل شومی است *** و با بخشش برتری می‌یابی، اگر برتری جویی.\n\nو حق (الحق) باش و به باطل ظاهر مشو *** و عین قرآن باش، هنگامی که تلاوت می‌کنی.\n\nزیرا خداوند برای بنده‌ای که او را با آنچه تلاوت می‌کند ندا می‌دهد، صدایی نشنیده است.\n\nپس اگر به حق تلاوت کند، [خداوند] می‌گوید: «بنده‌ام» *** و حال مشهود او مرده است.\n\nزیرا حق (الحق) را زنده‌ای نمی‌بیند *** از این رو بر زندگان، مرگ را نوشتند.\n\nپس هر کس که تلاوت کند و به هنگام تلاوت با صدق، به صورت ظاهر و حکمت باطن، سکون یابد، او تلاوت‌کننده و صاحب سکینه (السکینة) است. اما اگر تلاوت کند و ظاهراً سکون یابد ولی باطناً سکون نیابد – و سکون باطنی همان فهم معنای جاری در هستی (الوجود) از آن آیه تلاوت شده است و منحصر کردن آن به آنچه صرفاً در ظاهر دلالت می‌کند نیست – پس هر کس این‌گونه تلاوت کند، اصلاً صاحب سکینه نیست و وارث محمدی هم نیست، اگرچه از امت محمد (صلی الله علیه و سلم) باشد.\n\nو اگر تلاوت کند و باطناً سکون یابد ولی ظاهراً سکون نیابد و از ظاهر مشروع تجاوز کند، پس او نه وارث است و نه محمدی و نه مؤمن، و دورترین مردم از خداست. زیرا روح القدس اولین کسی است که او را طرد می‌کند و به واسطه او طرد می‌شود. و پیامبر محمد (صلی الله علیه و سلم) در روز قیامت به پروردگارش درباره او می‌گوید: «دور باد، دور باد!» و خداوند در آن هنگام او را سعادتمند نمی‌کند و یاری نمی‌رساند. و بزرگ‌ترین حسرتی که در روز قیامت به او دست می‌دهد، هنگامی است که کسی را ببیند که هنگام تلاوت، ظاهراً و باطناً به آن سکون یافته بود؛ پس می‌بیند که آنچه او باطناً به آن سکون یافته بود، این دیگری به واسطه آن سعادتمند شده و او به واسطه آن شقی گشته است. و او شقی نشد مگر به دلیل عدم سکون ظاهر، پس خیر بسیاری از او فوت شد، آنگاه که ایمان به آن از دستش رفت. زیرا او از پشت خانه وارد شد، نه از در آن. خداوند ما و شما را از کسانی قرار دهد که تلاوت کردند و سکون یافتند و در تلوین (تغییر حال) در تلاوتشان بر حسب آیات، ثابت و متمکن شدند. همانا او شایسته آن و توانا بر آن است. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 2
}