{
  "id": 172,
  "title": {
    "ar": "الباب الثاني والسبعون ومائة في معرفة مقام التوحيد",
    "en": "Chapter One Hundred and Seventy-Two: Concerning the Gnosis (معرفة) of the Station (مقام) of Unification (التوحيد)",
    "ur": "ایک سو بہترواں باب: مقام توحید (مقام التوحيد) کی معرفت کے بیان میں۔",
    "fa": "باب صد و هفتاد و دوم در معرفت مقام توحید"
  },
  "content": {
    "ar": "## (الباب الثاني والسبعون ومائة في معرفة مقام التوحيد)\n\n\n> دمية في القلب قد نصبت *** ما لها روح ولا جسد\n\n\n> كتبت فيه عقيدتها *** بمداد كله جسد\n\n\n> أحد ما مثله أحد *** بجمال النعت منفرد\n\n\n> مصدر الأكوان حضرته *** وهو لا شفع ولا عدد\n\n\n> الذي قام الوجود به *** أمرنا عليه ينعقد\n\n\n> وأنا العبد الفقير به *** وهو المحسان والصمد\n\n\n> فأعجبوا من حكمة وجدت *** نعم والرحمن ما وجدوا\n\n\n> حكمة تحوي على حكم *** نالها الحساد إذ حسدوا\n\n\n> أبد يعنو إلى أزل *** أزل يمده الأبد\n\n\n> كل من يجري إلى أمد *** سيرى وما له أمد\n\n\n> هكذا التوحيد فاعتبروا *** واحد في واحد أحد\n\n\n### [التوحيد التعمل في حصول العلم في نفس الإنسان‏]\n\n\nاعلم أن التوحيد التعمل في حصول العلم في نفس الإنسان أو الطالب بأن الله الذي أوجده واحد لا شريك له في ألوهيته والوحدة صفة الحق والاسم منه الأحد والواحد وأما الوحدانية فقيام الوحدة بالواحد من حيث إنها لا تعقل إلا بقيامها بالواحد وإن كانت نسبة وهي نسبة تنزيه فهذا معنى التوحيد كالتجريد والتفريد وهو التعمل في حصول الانفراد الذي إذا نسب إلى الموصوف به سمي الموصوف به فردا أو منفردا أو متفردا إذا سمي به فالتوحيد نسبة فعل من الموحد يحصل في نفس العالم به إن الله واحد قال تعالى لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا وقد وجد الصلاح وهو بقاء العالم‏\nووجوده فدل على أن الموجد له لو لم يكن واحدا ما صح وجود العالم هذا دليل الحق فيه على أحديته وطابق الدليل العقلي في ذلك ولو كان غير هذا من الأدلة أدل منه عليه لعدل إليه وجاء به وما عرفنا بهذا ولا بالطريق إليه في الدلالة عليه وقد تكلف قوم الدلالة عليه بطريق آخر وقدحوا في هذه الدلالة فجمعوا بين الجهل فيما نصبه الحق دليلا على أحديته وبين سوء الأدب فأما جهلهم فكونهم ما عرفوا موضح الدلالة على توحيده في هذه الآية حتى قدحوا فيه وأما سوء الأدب فمعارضتهم بما دخلوا فيها بالأمور القادحة فجعلوا نظرهم في توحيده أتم في الدلالة مما دل به الحق على أحديته وما ذهب إلى هذا إلا المتأخرون من المتكلمين الناظرين في هذا الشأن وأما المتقدمون كأبي حامد وإمام الحرمين وأبي إسحاق الأسفراييني والشيخ أبي الحسن فما عرجوا عن هذه الدلالة وسعوا في تقريرها وأبانوا عن استقامتها أدبا مع الله تعالى وعلما بموضع الدلالة منها\n\n\n### [أن توحيد الله فرع إثبات وجوده تعالى‏]\n\n\nواعلم أن الكلام في توحيد الله من كونه إلها فرع عن إثبات وجوده وهذا باب التوحيد فلا حاجة لنا في إثبات الوجود فإنه ثابت عند الذي نازعنا في توحيده وأما إثبات وجوده فمدرك بضرورة العقل لوجود ترجيح الممكن بأحد الحكمين‏\n\n\n### [إثبات توحيده تعالى في الطريقين‏]\n\n\nولنا في توحيده طريقان الطريق الواحدة أن يقال للمشرك قد اجتمعنا في العلم بأن ثم مخصصا وقد ثبت عينه وأقل ما يكون واحدا فمن زاد على الواحد فليدل عليه فعليك بالدليل على ثبوت الزائد الذي جعلته شريكا فليكن الخصم هو الذي يتكلف إثبات ذلك والطريقة الأخرى قوله تعالى لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا هذه مقدمة والمقدمة الأخرى السماء والأرض وأعني بهما كل ما سوى الله ما فسدتا وهذه هي المقدمة الأخرى والجامع بين المقدمتين وهو الرابط الفساد فانتجنا أحدية المخصص وهي المطلوب وإنما قلنا ذلك لأنه لو كان ثم إله زائد على الواحد لم يخل هذا الزائد إما أن يتفقا في الإرادة أو يختلفا ولو اتفقا فليس بمحال أن يفرض الخلاف لننظر من تنفذ إرادته منهما فإن اختلفا حقيقة أو فرضا في الإرادة فلا يخلو إما أن ينفذ في الممكن حكم إرادتهما معا وهو محال لأن الممكن لا يقبل الضدين وإما أن لا ينفذ أو إما أن ينفذ حكم إرادة أحدهما دون الآخر فإن لم ينفذ حكم إرادتهما فليس واحد منهما بإله وقد وقع الترجيح فلا بد أن يكون أحدهما نافذ الإرادة وقصر الآخر عن تنفيذ إرادته فحصل العجز والإله ليس بعاجز فالإله من نفذت إرادته وهو الله الواحد لا شريك له وهكذا استدل الخليل عليه السلام في الأقوال فأعطاه النظر أن الأفول يناقض حفظ العالم فالإله لا يتصف بالأفول أو الأفول حادث لطروه على الآفل بعد أن لم يكن آفلا والإله لا يكون محلا للحوادث لبراهين أخر قريبة المأخذ وهذه الأنوار قد قبلت الأفول فليس واحد منها بإله وهذه بعينها طريقة قوله تعالى لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا وكل دليل لا يرجع إلى هذا المعنى فلا يكون دليلا ثم قال الله تعالى في قصة إبراهيم هذه وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ ولم يكن له غير هذا فقوله حُجَّتُنا أي مثل حجتنا التي نصبناها دليلا على توحيدنا وهي قولنا لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا وهذه الأدلة وأمثالها إنما المطلوب بها توحيد الله أي ما ثم إله آخر زائد على هذا الواحد وأما أحدية الذات في نفسها فلا تعرف لها ماهية حتى يحكم عليها لأنها لا تشبه شيئا من العالم ولا يشبهها شي‏ء فلا يتعرض العاقل إلى الكلام في ذاته إلا بخبر من عنده ومع إتيان الخبر فإنا نجهل نسبة ذلك الحكم إليه لجهلنا به بل نؤمن به على ما قاله وعلى ما يعلمه فإن الدليل ما يقوم إلا على نفي التشبيه شرعا وعقلا فهذه طريقة قريبة عليها أكثر علماء النظر وأما الموحد بنور الايمان الزائد على نور العقل وهو الذي يعطي السعادة وهو نور لا يحصل عن دليل أصلا وإنما يكون عن عناية إلهية بمن وجد عنده ومتعلقة صدق المخبر فيما أخبر به عن نفسه خاصة ليس متعلق الايمان أكثر من هذا فإن كشف متعلق الخبر فبنور آخر ليس نور الايمان لكن لا يفارقه نور الايمان وذلك النور هو الذي يكشف له عن أحدية نفسه وأحدية كل موجود التي بها يتميز عن غيره سواء كانت ثم صفة يقع فيها الاشتراك أو لا يكون لا بد من أحدية تخصه يقع بها الامتياز له عن غيره فلما كشف للعبد هذا النور أحدية الموجودات علم قطعا بهذا النور ان الله تعالى له أحدية تخصه فأما أن تكون عينه فيكون أحدي الذات أحدي المرتبة وهي عينها وأما أن يكون أحدية المرتبة فيوافق الكشف الدليل النظري ويعلم قطعا أن الذات على أحدية تخصها هي عينها وهذا معنى قول أبي العتاهية\n> وفي كل شي‏ء له آية *** تدل على أنه واحد\n\n\nوتلك الآية أحدية كل معلوم سواء كان كثيرا أو غير كثير فإن للكثرة أحدية الكثرة لا تكون لغيرها البتة والأحدية صفة تنزيه على الحقيقة فلا تكون بجعل جاعل كما يراه بعض أصحابنا فمن قال إنه وحد الواحد ويريد به ما يريد بالوحدة فليس بصحيح وإن أراد بقوله وحد الواحد ويعني به القبائل الثاني فهذا يصح وإنما الواحد من حيث عينه هو واحد لنفسه فأهل طريق الله رأوا أن التوحيد إذا ثبت أنه عين الشرك فإن الواحد لنفسه لا يكون واحدا بإثباتك إياه واحدا فما أنت أثبته بل هو ثابت لنفسه وأنت علمت أنه واحد لا أنك أثبت أنه واحد فلهذا قال من أصحابنا قوله إذ كل من وحده جاحد لأن الواحد لا يوحد لأنه لا يقبل ذلك لأنه لو قبل ذلك لكان اثنين وحدته في نفسه ووحدة الموحد التي أثبتها له فيكون واحدا بنفسه وواحدا بإثبات الوحدة له من غيره فيكون ذا وحدتين فينتفي كونه واحدا وكل أمر لا يصح إثباته إلا بنفيه فلا يكون له ثبوت أصلا فالتوحيد على الحقيقة منا له سكوت خاصة ظاهرا وباطنا فمهما تكلم أوجد وإذا أوجد أشرك والسكون صفة عدمية فيبقى توحيد الوجود له وما دخل الشرك في توحيده إلا بإيجاد الخلق لأن الخلق استدعى بحقائقه نسبا مختلفة تطلب الكثرة في الحكم وإن كانت العين واحدة فما طرأت الآفة في التوحيد إلا من الإيجاد فالتوحيد جنى على نفسه لم تجن عليه الموجودات وهذا هو علم التوحيد الوهبي الذي لا يدرك بالنظر الفكري وكل توحيد يعطيه النظر الفكري هو كسبي عند الطائفة\n\n\n### [أن الشرع ما تعرض لاحدية الذات في نفسها بشي‏ء]\n\n\nواعلم أن الشرع ما تعرض لاحدية الذات في نفسها بشي‏ء وإنما نص على توحيد الألوهية وأحديتها بأنه لا إله إلا هو وإنما ذلك من فضول العقل لأن العقل عنده فضول كثير أداه إليه حكم الفكر عليه وجميع القوي التي في الإنسان فلا شي‏ء أكثر تقليدا من العقل وهو يتخيل أنه صاحب دليل إلهي وإنما هو صاحب دليل فكري فإن دليل الفكر يمشي به حيث يريد والعقل كالأعمى بل هو أعمى عن طريق الحق فأهل الله لم يقلدوا أفكارهم فإن المخلوق لا يقلد المخلوق فجنحوا إلى تقليد الله فعرفوا الله بالله فهو بحسب ما قال عن نفسه ما هو بحسب ما حكم فضول العقل عليه وكيف ينبغي للعاقل أن يقلد القوة المفكرة وهو يقسم النظر الفكري إلى صحيح وإلى فاسد ولا بد له أن يحتاج إلى فارق بين صحيحه وفاسده ومحال أن يفرق بين صحيح النظر الفكر وفاسده بالنظر الفكري فلا بد أن يحتاج إلى الله في ذلك فالذي نلجأ إليه في تمييز النظر الفكري صحيحه من فاسده حتى نحكم به نلجأ إليه ابتداء في أن يعطينا العلم بذلك المطلوب من غير استعمال فكر وعليه عولت الطائفة وعملت به وهو علم الأنبياء والرسل وأولي العلم من أهل الله ولم تتعد بأفكارها محالها وعلمت أن غايتها في الإدراك الصحيح في زعمها أن تبنى أدلتها على\n\n\nالأمور الحسية والبديهية وقد حكمت بغلط الحس ابتداء في أشياء وبالقدح في البديهيات ثم رجعت تأخذها مصادرة لتعذر الدلالة عليها فالرجوع إلى الله أولى في الأمور كلها كما قال وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ وهذا من جملة الأمر فلا علم إلا العلم المأخوذ عن الله فهو العالم سبحانه وحده والمعلم الذي لا يدخل على المتعلم منه فيما يأخذه عنه شبهة ونحن المقلدون له والذي عنده حق فنحن في تقليدنا إياه فيما أعلمنا به أولى باسم العلماء من أصحاب النظر الفكري الذين قلدوه فيما أعطاهم لا جرم أنهم لا يَزالُونَ مُخْتَلِفِينَ في العلم بالله والأنبياء مع كثرتهم وتباعد ما بينهم من الأعصار لا خلاف عندهم في العلم بالله لأنهم أخذوه عن الله وكذلك أهل الله وخاصته فالمتأخر يصدق المتقدم ويشد بعضهم بعضا ولو لم يكن ثم إلا هذا لكفى ووجب الأخذ عنهم وهذا الباب أعني باب التوحيد يعطي المناسبة من وجه وقد قال بذلك جماعة من أهل الله كأبي حامد وغيره من شيوخنا ولا يعطي المناسبة من وجه وقد قال به جماعة من أصحابنا كأبي العباس بن العريف الصنهاجى ونفوا المناسبة جملة والذي أذهب إليه وأقول به على ما أصلناه أولا أن لا نقلد في علمنا بالله وبغير الله إلا الله فنحن بحسب ما يلقى إلينا في حق نفسه فإن خاطبنا بالمناسبة قلنا بها حيث خاطبنا لا نتعدى ذلك الموضع ونقتصر عليه وإن خاطبنا برفع المناسبة رفعناها في ذلك الموطن الذي رفعها فيه لا نتعداه فيكون الحكم له لا لنا فلا نزال نصيب أبدا ولا نخطى‏ء وهو المعبر عنه بالعصمة في حق الأنبياء عليه السلام والحفظ في حق الأولياء ومتى ما لم يخبر عن الله فالإصابة إذا حصلت منه للحق اتفاقية بالنظر إليه مقصودة بالنظر إلى الحق هذا هو الذي نعتمد عليه فقوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\nعلى زيادة الكاف رفع للمناسبة الشيئية وتمام الآية وهُوَ السَّمِيعُ الْبَصِيرُ إثبات للمناسبة والآية واحدة والكلمات مختلفة فلا نعدل عن هذه المحجة فهي أقوى حجة وهي ما ذهبنا إليه من تقليد الحق فإنه طريق العلم والنجاة في الدنيا والآخرة وهي طريق النبيين والمرسلين والقائلين بالفيض من الإلهيين فإذا جاءك من الله علم فلا تدخله في ميزان الفكر ولا تجعل لعقلك سبيلا إلى ذلك فتهلك من ساعتك فإن العلم الإلهي لا يدخل في الميزان لأنه الواضع له فكيف يدخل واضعه تحت حكمه النائب لا يحكم على من استخلفه وإنما يحكم على من استخلف عليه والعلم يناقض العقل فإن العقل قيد والعلم ما حصل عن علامة وأدل العلامات على الشي‏ء نفس الشي‏ء وكل علامة سواها فالإصابة فيها بالنظر إلينا اتفاقي وهذا القدر في هذا الباب على حكم طريقنا كاف في الغرض المقصود والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n(وصل) في الوتر\n\n\nوهو نوع من أنواع التوحيد اعلم أن الوتر في لسان العرب هو طلب الثأر فأحدية الحق إنما اتصفت بالوتر لطلبها الثأر من الأحدية التي للواحد الذي أظهر الاثنين بوجوده فما زاد إلى ما لا يتناهى من الأعداد فلما أزال بهذا الظهور حكم الأحدية فصارت أحدية الحق تطلب ثار الأحدية المزالة التي أذهب عينها هذا الواحد الذي بوجوده ظهرت الكثرة وتطلب الوحدانية فتسمى بالوتر لهذا الطلب فوكل هذا الواحد من ينوب عنه في الذب عنه فأقام العارف وكيلا بلسان حق فقال أيها الحاكم الطالب ثار الأحدية ما ذهبت الأحدية بل هذا الذي تطلبه ما أعطى الاثنينية ولا الثلاثة ولا الأربعة فصاعدا فإنه لا يعطي ما لا يقتضيه حقيقته وإنما الذي أعطانا الاثنين أحدية الاثنين وأحدية الثلاثة والأربعة بالغا ما بلغ العدد وذلك لتستدل أعيان الأعداد بأحديتها تلك على أحديتك فما سعت إلا في حقك ومن أجلك إذ تعلم أن الأعداد ما ظهرت في الكون إلا من حكم الأسماء الإلهية فإنها كثرة ومع كثرتها فالأحدية لها متحققة فأراد هذا الواحد أن لا يجهل أعيان الأعداد أحدية الأسماء حتى لا تتوهم الكثرة في جناب الله فأعطى في كل عدد أحدية ذلك العدد غيرة من وجود الكثرة المذهبة لعين الأحدية والوحدة فقبل عذره وعلم أنه متخلق في ذلك بأخلاق أحدية الحق في إقامة أحدية الأسماء الكثيرة ومشى عليه اسم الوتر للغيرة فالله وتر يحب الوتر وسيأتي في الباب الذي بعد هذا العلم بالكثرة والاشتراك إن شاء الله‏\n\n\n(وصل) في الفرد\n\n\nوأما الفرد فهو من حكم هذا الباب ويسمى به لانفراده بما يتميز به عن خلقه فما هو فرد من حيث ما هو واحد فإنه واحد لنفسه وفرد لتميزه عن أحدية كل شي‏ء ولا يصح الفرد لغيره سبحانه فإنه كل ما سوى الله فيه اشتراك بعضه مع بعض ويتميز بأحديته ولا ينفرد فإن صفة الاشتراك تمنع من ذلك فلا يصح اسم الفرد على الحقيقة إلا لله الحق خاصة فإنه الفرد من جميع الوجوه إذ لم تكن له صفة اشتراك كما لسواه من الموجودات ولذلك تطلب الحدود الموجودات والله لا يطلبه حد ولا يقابله مثل ولا ضد تعالى الله وأسماؤه كلها لها الفردية فإنها له نسب لا أعيان فيأخذ الحد ذلك الاسم إذا دل على الحادث ولا يأخذه الحد إذا سميت به الله تعالى فتحد اللفظ ولا تحد مدلوله إلا إذ كان مدلوله حادثا لا غير ولا يلزم من الاشتراك في اللفظ الاشتراك في المعنى لأن اللفظ لك لا له وأنت مشترك فيك فلهذا قيل اللفظ الاشتراك أ لا ترى الألفاظ المشتركة كالمشتري ليس الاشتراك إلا في إطلاق الاسم ولهذا يقع التفصيل إذا طولب بالحد صاحبه فيقال أي مشتر تريد المشتري الذي هو كوكب في السماء أو المشتري الذي هو عاقد البيع فإذا حده تميز كل عين عن صاحبتها فليس في اللفظ من ماهية المدلول شي‏ء فبهذا تقول في الحق سميع وبصير وله يد ويدان أو أيد وأعين ورجل وجميع ما أطلقه على نفسه مما لا يتمكن للعقل أن يطلقه عليه لأنه لم يعلم ذلك الإطلاق إلا على المحدثات ولو لا الشرع والأخبار النبوية الإلهية ما جاءت بها ما أطلقناها عقلا عليه ومع هذا فننفي التشبيه ولا يتناول أمرا بعينه لجهلنا بذاته وإنما نفينا التشبيه بقوله ليس كمثله شي‏ء لا بما أعطاه الدليل العقلي حتى لا يحكم عليه إلا كلامه تعالى وبهذا نحب نلقاه إذا لقيناه وكشف عن بصائرنا وأبصارنا غطاء العمي إن كان يمكن كشفه مطلقا أو يكشف منه ما يمكن كشفه إما على التساوي في حق الجميع وإما على التفاضل في حق العباد فينفرد كل شخص برؤية لا تكون لغيره ولا يصح الكشف‏\nفي علم التوحيد إلا عند من يقول بالمناسبة ولا عند من يقول بنفي المناسبة لأن التوحيد ليس بأمر وجودي وإنما هو نسبة والنسب لا تدرك كشفا وإنما تعلم من طريق الدليل فإن الكشف رؤية ولا تتعلق الرؤية من المرئي إلا بكيفيات يكون المرئي عليها وهل في ذلك الجناب الإلهي كيفية أم لا فالدليل ينفي الكيفية فإن كان يريد أنه لا كيفية له في ذاته فلا يكشف وإن كان يريد أنه لا تعقل كيفيته فيمكن أن يكشف من حيث ما له كيفية لا تعقل لكن يحصل العلم بها عند الكشف فإن كل كيفية حصلها العقل من نظره في الأشياء فإنها تستحيل عليه عنده مع ثبوت الايمان بأسمائها لا بمعقوليتها من نزول واستواء ومعية وتقليب وتردد وضحك وتعجب ورضي وغضب فإن جسد الله هذه المعاني في حضرة التمثيل كالعلم في صورة اللبن فذلك له وحينئذ تنال كشفا وإلا فلا تنال أبدا ولا يعلم من أين أخذتها النبوة هل تلقتها خبرا أو كشفا فإن كان خبرا فقد وقع التساوي وإن كان عن كشف فهو بحسب ما ذكرناه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter One Hundred and Seventy-Two: On the Knowledge of the Station of Unification (مقام التوحيد)\n\n> A doll is set up in the heart,\n> It has neither spirit nor body.\n\n> Its creed is written within it,\n> With ink that is entirely body.\n\n> The Unique One (أحد), nothing is like Him,\n> Singular in the beauty of the Attribute (النعت).\n\n> The source of the universes (الأكوان) is His Presence (حضرة),\n> And He is neither pair nor number.\n\n> He by whom Existence (الوجود) subsists,\n> Our affair is bound up with Him.\n\n> And I am the poor servant through Him,\n> And He is the Benefactor (المحسان) and the Eternal Refuge (الصمد).\n\n> So marvel at a wisdom that was found,\n> Yes, by the Merciful, they did not find it.\n\n> A wisdom that encompasses judgments,\n> Which the envious attained when they envied.\n\n> Eternity (أبد) bows to Pre-eternity (أزل),\n> Pre-eternity is extended by Eternity.\n\n> Everyone who runs toward a limit,\n> Will see that He has no limit.\n\n> Thus is Unification (التوحيد), so reflect:\n> One (واحد) in the One (واحد), the Unique (أحد).\n\n### [The Practical Unification (التوحيد التعمل) in the Attainment of Knowledge in the Human Soul]\n\nKnow that the practical Unification (التوحيد التعمل) is the active pursuit of knowledge (العلم) in the soul of the human or the seeker, that Allah, Who brought him into existence, is One (واحد) and has no partner in His Divinity (ألوهية). Unity (الوحدة) is an Attribute (صفة) of the Real (الحق), and the Names derived from it are *al-Ahad* (The Unique) and *al-Wahid* (The One). As for Oneness (الوحدانية), it is the subsistence of Unity in the One, in that Unity cannot be conceived except by its subsistence in the One, even though it is a relation (نسبة)—a relation of transcendence (تنزيه).\n\nThis is the meaning of Unification (التوحيد), similar to abstraction (التجريد) and singularization (التفريد). It is the active pursuit of attaining singularity (الانفراد), such that when this singularity is attributed to the one described by it, that one is called singular (فرد), solitary (منفرد), or unique (متفرد), if named by it. Thus, Unification is the attribution of an act originating from the unifier (الموحد) that results in the knowledge within the knower that Allah is One.\n\nThe Exalted said: <<لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا>> (Had there been in them [heaven and earth] gods besides Allah, they would have been corrupted). And indeed, soundness (الصلاح)—which is the subsistence and existence of the world (العالم)—has been found. This indicates that if the One Who brought it into existence were not One, the existence of the world would not be sound. This is the proof of the Real (الحق) for His Uniqueness (أحديته) in this matter, and the rational proof (الدليل العقلي) corresponds to it.\n\nIf there were any other proof more indicative of His Uniqueness than this, He would have resorted to it and brought it forth. Yet, we have not been informed of this, nor of any path leading to it in demonstrating His Uniqueness.\n\nSome people have gone to great lengths to demonstrate His Uniqueness through another path and have criticized this proof. They have thus combined ignorance regarding what the Real established as proof of His Uniqueness with bad manners (سوء الأدب). Their ignorance lies in their failure to recognize the clarity of the demonstration of His Unification in this verse, leading them to criticize it. Their bad manners lie in their opposition to it by introducing destructive arguments, making their own intellectual consideration (نظرهم) of His Unification seem more complete in demonstration than the proof by which the Real demonstrated His Uniqueness.\n\nOnly the later speculative theologians (المتأخرون من المتكلمين) who examine this matter have adopted this view. As for the earlier scholars, such as Abu Hamid [al-Ghazali], Imam al-Haramayn [al-Juwayni], Abu Ishaq al-Isfara’ini, and Shaykh Abu al-Hasan [al-Ash’ari], they did not deviate from this proof. They strove to establish it and clarified its rectitude, out of reverence (أدبا) for Allah the Exalted and knowledge of the point of demonstration contained within it.\n\n### [That the Unification of God is a Branch of the Affirmation of His Existence]\n\nKnow that the discussion concerning the Unification of God, in terms of His being a Deity (إله), is a branch of the affirmation of His Existence (وجوده). Since this is the chapter on Unification (التوحيد), we have no need to affirm Existence, for it is already established for the one who disputes His Unification. As for the affirmation of His Existence, it is grasped by the necessity of the intellect (ضرورة العقل) due to the existence of the preference (ترجيح) of the contingent (الممكن) by one of the two judgments [existence or non-existence].\n\n### [Affirming His Unification through Two Paths]\n\nWe have two paths for His Unification.\n\nThe first path is to say to the polytheist (المشرك): We agree on the knowledge that there is a Determiner (مخصص), and His identity is established, and the minimum He can be is One. Whoever adds to the One must provide proof for it. Thus, the burden of proof for the establishment of the additional entity you have made a partner falls upon you. The opponent must be the one to undertake the task of proving that.\n\nThe second path is His saying, the Exalted: <<لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا>> (Had there been in them gods besides Allah, they would have been corrupted). This is the first premise. The second premise is that the heavens and the earth—and by them, I mean everything other than Allah—have not been corrupted. This is the other premise. The link that connects the two premises is corruption (الفساد). This yields the conclusion of the Uniqueness (أحدية) of the Determiner, which is the desired outcome.\n\nWe say this because if there were a god in addition to the One, this additional god would either agree with the first in intention (إرادة) or disagree. If they agreed, it is not impossible to hypothesize disagreement in order to see whose intention is executed. If they disagreed, whether actually or hypothetically, regarding the intention, then one of three things must occur: either the judgment of both their intentions is executed upon the contingent (الممكن) simultaneously—which is impossible, because the contingent cannot accept two opposites; or neither of their intentions is executed; or the judgment of the intention of one of them is executed, but not the other.\n\nIf the judgment of neither of their intentions is executed, then neither of them is a god. Since preference (الترجيح) has occurred, one of them must have an executed intention, while the other falls short of executing his intention, resulting in incapacity (العجز). A god is not incapable. Therefore, the God is the One whose intention is executed, and He is Allah, the One (الواحد), Who has no partner.\n\nIn this manner, Abraham (الخليل), peace be upon him, argued in his statements. His consideration led him to the conclusion that setting (الأفول) contradicts the preservation of the world. Therefore, a god cannot be described by setting, or setting is an accident (حادث) that occurs to the setting body after it was not setting, and God cannot be a locus for accidents, based on other easily grasped proofs. These lights [stars/planets] have accepted setting, so none of them is a god. This is precisely the method of His saying, the Exalted: <<لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا>>. Any proof that does not return to this meaning is not a valid proof.\n\nThen Allah the Exalted said concerning this story of Abraham: <<وَتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ>> (And that was Our argument, which We gave to Abraham). He had no other argument than this. His saying, *Our argument* (حُجَّتُنا), means *like Our argument* which We established as proof for Our Unification, which is Our saying: <<لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا>>.\n\nThe purpose of these proofs and their like is only the Unification of God, meaning that there is no other god in addition to this One. As for the Uniqueness of the Essence (أحدية الذات) in itself, we do not know its quiddity (ماهية) so that we may pass judgment upon it, because it resembles nothing in the world, nor does anything resemble it. Therefore, the rational person does not approach speaking about His Essence (ذات) except through information received from Him. Even with the arrival of the information, we remain ignorant of the relation of that judgment to Him due to our ignorance of Him. Rather, we believe in it according to what He said and according to what He knows.\n\nThe proof is established only upon the negation of resemblance (التشبيه), legally and rationally. This is the close path followed by most scholars of intellectual consideration (النظر).\n\nAs for the unifier by the light of faith (نور الايمان)—which is a light exceeding the light of the intellect and which grants felicity—it is a light that is not attained through any proof whatsoever. Rather, it comes from Divine care (عناية إلهية) bestowed upon the one who possesses it, and it is related to the truthfulness of the Informer regarding what He informed about Himself specifically. The object of faith is no more than this. If the object of the information is unveiled (كشف), it is by another light, not the light of faith, though the light of faith does not depart from it.\n\nThat light is what unveils to him the uniqueness (أحدية) of his own self and the uniqueness of every existent thing, by which it is distinguished from everything else. Whether there is an attribute in which sharing occurs or not, there must be a uniqueness specific to it, by which it is distinguished from others.\n\nWhen this light unveiled to the servant the uniqueness of existent things, he knew with certainty by this light that Allah the Exalted possesses a uniqueness specific to Him. Either this uniqueness is His very Essence (عين), making Him unique in Essence (أحدي الذات) and unique in Level (أحدي المرتبة), which is His Essence; or it is the uniqueness of the Level, in which case the Unveiling (الكشف) conforms to the speculative proof, and he knows with certainty that the Essence possesses a specific uniqueness that is its very self.\n\nThis is the meaning of Abu al-Atahiyya’s saying:\n\n> And in everything there is a sign for Him,\n> That indicates He is One (واحد).\n\nThat sign is the uniqueness (أحدية) of every known thing, whether it is multiple or not. For multiplicity has a uniqueness of multiplicity that belongs to nothing else whatsoever.\n\nUniqueness (الأحدية) is truly an attribute of transcendence (تنزيه). It does not come about by the act of an agent (جعل جاعل), as some of our companions believe. Thus, whoever says that he unified the One (وحد الواحد) and means by it what he means by Unity (الوحدة) is incorrect. But if he means by his saying, \"he unified the One,\" the second meaning [the practical application], then this is sound.\n\nThe One (الواحد), in terms of His identity (عينه), is One for Himself. The people of the Path of God (أهل طريق الله) saw that if Unification (التوحيد) is established, it is the very essence of association (الشرك), because the One, being One for Himself, is not made One by your affirmation of Him as One. You did not establish Him; rather, He is established for Himself, and you merely knew that He is One, you did not establish that He is One.\n\nFor this reason, one of our companions said: \"His saying, 'For everyone who unifies Him is an associator (جاحد),' is because the One is not unified, for He does not accept that. If He accepted that, there would be two unities: His unity in Himself, and the unity of the unifier which he established for Him. Thus, He would be One by Himself and One by the establishment of unity for Him by another, resulting in two unities, which negates His being One.\n\nAny matter whose affirmation is only valid through its negation has no subsistence whatsoever. Therefore, true Unification (التوحيد على الحقيقة) requires silence from us, both outwardly and inwardly. Whenever one speaks, he creates, and when he creates, he associates (أشرك). Since silence is a non-existent attribute (صفة عدمية), the Unification of Existence (توحيد الوجود) remains His.\n\nAssociation (الشرك) only entered into His Unification through the creation of creatures (الخلق), because creatures, by their realities (حقائق), necessitated different relations (نسب) that demand multiplicity in judgment, even if the Essence (العين) is one. The flaw in Unification only arose from the act of bringing into existence (الإيجاد). Unification sinned against itself; the existent things did not sin against it.\n\nThis is the science of bestowed Unification (علم التوحيد الوهبي) which is not grasped by intellectual consideration (النظر الفكري). Any unification granted by intellectual consideration is considered acquired (كسبي) by the Sufi community (الطائفة).\n\n### [That the Law did not address the Uniqueness of the Essence Itself]\n\nKnow that the Law (الشرع) did not address the Uniqueness of the Essence (أحدية الذات) in itself at all. It only stipulated the Unification of Divinity (توحيد الألوهية) and its Uniqueness, stating that there is no god but He. The discussion of the Essence is merely a surplus of the intellect (فضول العقل), because the intellect has many surpluses resulting from the judgment of thought (الفكر) upon it and upon all the faculties in the human being.\n\nThere is nothing that imitates (تقليدا) more than the intellect, yet it imagines itself to be the possessor of a divine proof (دليل إلهي). In reality, it is only the possessor of a speculative proof (دليل فكري), for the proof of thought leads it wherever it wishes. The intellect is like a blind man; rather, it is blind to the path of the Real (الحق).\n\nThe People of God (أهل الله) do not imitate their thoughts, for the created does not imitate the created. They inclined toward imitating God (تقليد الله), so they knew God by God. He is as He described Himself, not as the surplus of the intellect judged Him to be.\n\nHow can the rational person imitate the thinking faculty when he divides intellectual consideration into sound and corrupt? He must need a discriminator between the sound and the corrupt, and it is impossible to distinguish between the sound and corrupt intellectual consideration by intellectual consideration itself. Therefore, he must resort to God in this matter.\n\nThe One to Whom we resort to distinguish the sound from the corrupt in intellectual consideration, so that we may judge by it, is the One to Whom we should resort initially to grant us knowledge of the desired object without employing thought. This is what the Sufi community (الطائفة) relied upon and acted by. It is the knowledge of the Prophets, the Messengers, and the people of knowledge among the People of God. They did not exceed the limits of their thoughts, knowing that the utmost they could achieve in correct perception, in their estimation, was to build their proofs upon sensory and self-evident matters. Yet, they initially judged the senses to be wrong in certain things and criticized self-evident truths, only to return and take them as postulates due to the impossibility of demonstrating them otherwise.\n\nResorting to God is preferable in all matters, as He said: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him returns the whole affair). This [knowledge] is part of the affair. Thus, there is no knowledge except the knowledge taken from God, for He alone, the Exalted, is the Knower (العالم) and the Teacher (المعلم) from whom no doubt enters the learner regarding what he receives. We are His imitators (المقلدون), and what He possesses is the truth. Therefore, in our imitation of Him regarding what He has informed us, we are more deserving of the name 'scholars' than the people of speculative consideration who imitated what their thought gave them.\n\nInevitably, they <<لَا يَزَالُونَ مُخْتَلِفِينَ>> (will not cease to differ) concerning the knowledge of God. But the Prophets, despite their multitude and the vast distance between their eras, have no disagreement in the knowledge of God, because they received it from God. Likewise, the People of God and His elect: the later confirms the earlier, and they strengthen one another. If there were nothing else but this, it would suffice, and it would be obligatory to take knowledge from them.\n\nThis chapter—I mean the chapter on Unification—affirms analogy (المناسبة) from one perspective, and a group of the People of God, such as Abu Hamid and others of our Shaykhs, have affirmed this. It negates analogy from another perspective, and a group of our companions, such as Abu al-Abbas ibn al-Arif al-Sanhaji, have affirmed this and negated analogy entirely.\n\nThe position I adopt and affirm, based on what we established earlier, is that we imitate no one in our knowledge of God and of anything else except God. We proceed according to what He reveals to us concerning Himself. If He addresses us with analogy, we affirm it where He addressed us, not exceeding that point, and we restrict ourselves to it. If He addresses us by negating analogy, we negate it in the context where He negated it, not exceeding it. Thus, the judgment belongs to Him, not to us. We will always be correct and never err. This is what is expressed as infallibility (العصمة) concerning the Prophets, peace be upon them, and preservation (الحفظ) concerning the Friends of God (الأولياء).\n\nWhenever He does not inform us about God, then if correctness is achieved, it is accidental (اتفاقية) when viewed in relation to the person, but intended when viewed in relation to the Real. This is what we rely upon.\n\nHis saying: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him), with the addition of the particle *ka* (like), is a negation of the analogy of thingness (المناسبة الشيئية). The completion of the verse: <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (And He is the All-Hearing, the All-Seeing), is an affirmation of analogy. The verse is one, but the words are different. We do not deviate from this clear path, for it is the strongest argument, and it is the path we have adopted: the imitation of the Real (تقليد الحق). It is the path of knowledge and salvation in this world and the Hereafter, and it is the path of the Prophets, the Messengers, and those among the Theologians (الإلهيين) who affirm emanation (الفيض).\n\nTherefore, if knowledge comes to you from God, do not subject it to the scale of thought (ميزان الفكر), nor give your intellect a way to it, lest you perish instantly. For Divine Knowledge (العلم الإلهي) does not enter the scale, because He is the One Who established it. How can the Establisher enter under the judgment of His deputy? The deputy only judges those over whom he is deputized, not the one who deputized him.\n\nKnowledge contradicts the intellect, for the intellect is a restraint (قيد), while knowledge is attained through a sign (علامة). The clearest sign for a thing is the thing itself. Any sign other than the thing itself, correctness in it is accidental when viewed in relation to us. This much in this chapter, according to the rule of our path, is sufficient for the intended purpose. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (says the truth, and He guides to the way).\n\n***\n\n### (A Supplement) On the Odd/Singular (الوتر)\n\nThis is a type of Unification (التوحيد). Know that *al-Witr* (الوتر) in the Arabic language means the seeking of vengeance or retribution (طلب الثأر). The Uniqueness (أحدية) of the Real is described by *al-Witr* because it seeks retribution from the uniqueness of the One (الواحد) who manifested the duality (الاثنين) through His existence, and then increased to the infinite numbers.\n\nWhen this manifestation removed the judgment of Uniqueness (الأحدية), the Uniqueness of the Real began to seek retribution for the removed Uniqueness, whose identity was effaced by this One, through whose existence multiplicity (الكثرة) appeared. It seeks Oneness (الوحدانية), and thus is named *al-Witr* for this seeking.\n\nThis One (الواحد) appointed a representative to defend Him, so the Gnostic (العارف) stood as a representative with the tongue of the Real (لسان حق) and said: O Judge, seeker of the retribution of Uniqueness! Uniqueness has not departed. Rather, this One whom you seek retribution from did not grant duality, nor trinity, nor quaternity, and so on to whatever number. For He does not grant what His reality does not necessitate.\n\nRather, what granted us duality is the uniqueness of duality, and the uniqueness of trinity and quaternity, however far the number reaches. This is so that the essences of the numbers (أعيان الأعداد) may use their specific uniqueness to point to Your Uniqueness. They strove only for Your right and for Your sake, since You know that the numbers only appeared in the cosmos (الكون) from the judgment of the Divine Names (الأسماء الإلهية), for they are multiplicity, yet with their multiplicity, Uniqueness is realized for them.\n\nThis One (الواحد) desired that the essences of the numbers should not be ignorant of the Uniqueness of the Names, lest they imagine multiplicity in the Divine Presence. So, He granted to every number the uniqueness of that number, out of jealousy (غيرة) against the existence of multiplicity that would efface the identity of Uniqueness and Unity.\n\nThus, His excuse was accepted, and it was known that in this, He was characterized by the morals of the Uniqueness of the Real in establishing the uniqueness of the multiple Names. The Name *al-Witr* (The Odd/Singular) was applied to Him due to this jealousy. Thus, Allah is *Witr* and loves *Witr*. The knowledge of multiplicity and sharing will come in the chapter after this, God willing.\n\n***\n\n### (A Supplement) On the Unique/Solitary (الفرد)\n\nAs for *al-Fard* (The Solitary), it falls under the judgment of this chapter. He is named by it because of His singularity (انفراده) in that by which He is distinguished from His creation. He is not *Fard* merely because He is *Wahid* (One), for He is One for Himself, but *Fard* due to His distinction from the uniqueness of everything else.\n\nThe term *al-Fard* is not truly valid for anyone other than Him, the Exalted, for everything other than God involves some sharing (اشتراك) of one part with another. It is distinguished by its uniqueness (أحديته) but is not solitary (ينفرد), for the attribute of sharing prevents that. Therefore, the Name *al-Fard* is truly valid only for Allah the Real (الحق), for He is the Solitary from all aspects, since He has no attribute of sharing, unlike the existent things besides Him.\n\nFor this reason, existent things require definitions (الحدود), but God is not sought by a definition, nor is He opposed by a likeness or an opposite. Exalted is Allah!\n\nAll His Names possess singularity (الفردية), for they are relations (نسب) to Him, not essences (أعيان). Thus, the definition applies to that Name if it indicates a contingent thing (حادث), but the definition does not apply to it when you name God the Exalted by it. You define the word, but you do not define its referent unless its referent is contingent and nothing else.\n\nSharing in the word does not necessitate sharing in the meaning, because the word belongs to you, not to Him, and sharing exists in you. For this reason, it was said that the word is shared. Do you not see that in shared words like *al-Mushtari* (the buyer/Jupiter), the sharing is only in the application of the name? Therefore, when the one who uses the term is asked for a definition, clarification occurs. It is said: Which *Mushtari* do you mean? The *Mushtari* which is a planet in the sky, or the *Mushtari* who is the contracting party in a sale? When he defines it, each essence is distinguished from the other. Thus, the word contains nothing of the quiddity (ماهية) of the referent.\n\nBased on this, we say concerning the Real that He is Hearing (سميع) and Seeing (بصير), and that He has a Hand, or two Hands, or Hands, and Eyes, and a Foot, and everything He applied to Himself that the intellect cannot apply to Him, because the intellect only knows that application in relation to created things (المحدثات). Were it not for the Law (الشرع) and the Divine Prophetic reports that brought them, we would not apply them to Him rationally.\n\nDespite this, we negate resemblance (التشبيه) and do not address a specific matter, due to our ignorance of His Essence (ذاته). We only negate resemblance by His saying: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him), not by what the rational proof provides, so that we judge Him only by His own words.\n\nWe desire to meet Him in this state when we meet Him, and when the veil of blindness is removed from our insights and visions—if its removal is possible absolutely, or if what can be removed is removed, either equally for all, or differentially for the servants. In the latter case, each person is solitary in a vision that belongs to no one else.\n\nUnveiling (الكشف) in the science of Unification (التوحيد) is not valid for those who negate analogy, nor for those who affirm it, because Unification is not an existent thing (أمر وجودي); rather, it is a relation (نسبة). Relations are not grasped by unveiling, but are known through the path of proof (الدليل). Unveiling is vision (رؤية), and vision is only related to the qualities (كيفيات) upon which the seen object subsists.\n\nIs there a quality in that Divine Presence or not? The proof negates quality (الكيفية). If it means that He has no quality in His Essence, then there is no unveiling. If it means that His quality cannot be grasped by the intellect, then it is possible for unveiling to occur in terms of His having a quality that is not rationally grasped, but knowledge of it is attained through unveiling.\n\nFor every quality that the intellect attains through its consideration of things, it deems that quality impossible for Him, even while affirming faith in the Names of those qualities—such as descending (نزول), establishing (استواء), companionship (معية), turning over (تقليب), hesitation (تردد), laughter (ضحك), wonder (تعجب), pleasure (رضي), and wrath (غضب). For God embodies these meanings in the Presence of Representation (حضرة التمثيل), like knowledge in the form of milk. That belongs to Him, and at that time, you attain it through unveiling; otherwise, you will never attain it.\n\nIt is not known where the Prophethood received this—whether it received it as information (خبر) or as unveiling (كشف). If it was information, then equality has occurred [among those who receive it]. If it was through unveiling, then it is according to what we have mentioned. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (says the truth, and He guides to the way).",
    "ur": "(باب ایک سو بہتر: مقام توحید (Al-Tawhid) کی معرفت (Al-Ma'rifah) میں)\n\nدل میں ایک گڑیا نصب کی گئی ہے (دمية في القلب قد نصبت)\nجس کی نہ کوئی روح ہے اور نہ کوئی جسم (ما لها روح ولا جسد)\nاس میں اس کا عقیدہ لکھا گیا ہے (كتبت فيه عقيدتها)\nایسی سیاہی سے جو سراسر جسم ہے (بمداد كله جسد)\nوہ احد (Al-Ahad) ہے، اس کی کوئی مثال نہیں (أحد ما مثله أحد)\nوہ صفات کے جمال میں یکتا ہے (بجمال النعت منفرد)\nکائناتوں کا سرچشمہ اس کی بارگاہ ہے (مصدر الأكوان حضرته)\nاور وہ نہ جفت ہے اور نہ عدد (وهو لا شفع ولا عدد)\nجس کے ذریعے ہستی (الوجود) قائم ہے (الذي قام الوجود به)\nہمارا معاملہ اسی پر منحصر ہے (أمرنا عليه ينعقد)\nاور میں اس کے ذریعے فقیر بندہ ہوں (وأنا العبد الفقير به)\nاور وہ احسان کرنے والا اور بے نیاز ہے (وهو المحسان والصمد)\nپس اس حکمت پر تعجب کرو جو پائی گئی (فأعجبوا من حكمة وجدت)\nہاں، رحمن کی قسم، انہوں نے اسے نہیں پایا (نعم والرحمن ما وجدوا)\nوہ حکمت جو کئی احکام پر مشتمل ہے (حكمة تحوي على حكم)\nحاسدوں نے حسد کرتے ہوئے اسے حاصل کیا (نالها الحساد إذ حسدوا)\nابد (ہمیشہ) ازل (قدیم) کے سامنے جھکتا ہے (أبد يعنو إلى أزل)\nازل کو ابد مدد دیتا ہے (أزل يمده الأبد)\nہر وہ شخص جو ایک مدت کی طرف دوڑتا ہے (كل من يجري إلى أمد)\nوہ دیکھے گا، اور اس کی کوئی مدت نہیں (سيرى وما له أمد)\nتوحید (Al-Tawhid) اسی طرح ہے، پس غور کرو (هكذا التوحيد فاعتبروا)\nایک میں ایک، احد (واحد في واحد أحد)\n\n### [انسان کے نفس میں علم کے حصول میں توحید (Al-Tawhid) کا عمل]\n\nجان لو کہ توحید (Al-Tawhid) کا عمل انسان یا طالب کے نفس میں اس علم کے حصول میں ہے کہ جس اللہ نے اسے وجود بخشا وہ واحد (Al-Wāḥid) ہے، اس کی الوہیت (Al-Ulūhiyyah) میں کوئی شریک نہیں۔ اور وحدت (Al-Waḥdah) حق (Al-Haqq) کی صفت ہے، اور اس سے اسم احد (Al-Ahad) اور واحد (Al-Wāḥid) ہے۔ جہاں تک وحدانیت (Al-Waḥdāniyyah) کا تعلق ہے، تو یہ واحد کے ساتھ وحدت کا قیام ہے، اس لحاظ سے کہ یہ واحد کے ساتھ اس کے قیام کے بغیر معقول نہیں ہو سکتی، اگرچہ یہ ایک نسبت ہے، اور یہ تنزیہ (پاکیزگی) کی نسبت ہے۔ پس یہ توحید (Al-Tawhid) کا معنی ہے، جیسے تجرید (پاک کرنا) اور تفرید (یکتا کرنا)، اور یہ انفراد (انفرادیت) کے حصول میں عمل کرنا ہے، جسے جب موصوف کی طرف منسوب کیا جائے تو موصوف کو فرد (Fard)، منفرد، یا متفرد کہا جاتا ہے۔ پس توحید (Al-Tawhid) موحد (توحید قائم کرنے والے) کے فعل کی ایک نسبت ہے جو اس کے عالم کے نفس میں حاصل ہوتی ہے کہ اللہ واحد ہے۔ اللہ تعالیٰ فرماتا ہے:\n**لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا**\n(اگر آسمانوں اور زمین میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں تباہ ہو جاتیں)۔\nاور صلاح (درستگی) موجود ہے، جو عالم کا بقا اور اس کا وجود ہے۔ پس یہ اس بات کی دلیل ہے کہ اگر اسے وجود بخشنے والا واحد نہ ہوتا تو عالم کا وجود صحیح نہ ہوتا۔ یہ اس کی احدیت (Aḥadiyyah) پر حق (Al-Haqq) کی دلیل ہے، اور یہ عقلی دلیل کے مطابق ہے۔ اگر اس کے علاوہ کوئی اور دلیل اس سے زیادہ واضح ہوتی تو وہ اس کی طرف رجوع کرتا اور اسے لاتا۔ لیکن ہم نے اس کے ذریعے یا اس تک پہنچنے کے راستے کے ذریعے اس کی دلالت کو نہیں جانا۔ کچھ لوگوں نے دوسرے طریقے سے اس پر دلالت کرنے کی کوشش کی اور اس دلیل پر اعتراض کیا، پس انہوں نے اس جہالت کو جمع کیا جو حق (Al-Haqq) نے اپنی احدیت پر دلیل کے طور پر قائم کی تھی، اور سوءِ ادب (بدتمیزی) کو بھی۔ ان کی جہالت یہ ہے کہ وہ اس آیت میں اس کی توحید (Al-Tawhid) پر دلالت کی وضاحت کو نہیں جان سکے، یہاں تک کہ انہوں نے اس پر اعتراض کیا۔ اور سوءِ ادب یہ ہے کہ انہوں نے ان امور کے ساتھ مخالفت کی جن میں وہ داخل ہوئے، اور انہوں نے اپنی نظر کو اس کی توحید میں اس سے زیادہ مکمل قرار دیا جس سے حق (Al-Haqq) نے اپنی احدیت پر دلالت کی تھی۔ اور اس طرف صرف متاخرین متکلمین ہی گئے ہیں جو اس معاملے میں غور کرتے ہیں۔ جہاں تک متقدمین کا تعلق ہے جیسے ابو حامد، امام الحرمین، ابو اسحاق الاسفرائینی، اور شیخ ابو الحسن، تو انہوں نے اس دلیل سے منہ نہیں موڑا، اور اس کی تائید میں کوشش کی اور اللہ تعالیٰ کے ساتھ ادب اور اس میں دلالت کے مقام کے علم کی وجہ سے اس کی استقامت کو واضح کیا۔\n\n### [یہ کہ اللہ کی توحید (Al-Tawhid) اس کے وجود (Al-Wujud) کے اثبات کی فرع ہے]\n\nاور جان لو کہ اللہ کی توحید (Al-Tawhid) کے بارے میں بات کرنا، اس کے معبود ہونے کے لحاظ سے، اس کے وجود (Al-Wujud) کے اثبات کی فرع ہے۔ اور یہ توحید (Al-Tawhid) کا باب ہے، لہٰذا ہمیں وجود کے اثبات کی ضرورت نہیں، کیونکہ یہ اس شخص کے نزدیک ثابت ہے جو ہماری توحید میں اختلاف کرتا ہے۔ جہاں تک اس کے وجود کے اثبات کا تعلق ہے، تو یہ ممکن کے دو احکام میں سے ایک کے ترجیح پانے کے وجود کی وجہ سے عقل کی ضرورت سے حاصل ہوتا ہے۔\n\n### [دو طریقوں سے اس کی توحید (Al-Tawhid) کا اثبات]\n\nاور اس کی توحید (Al-Tawhid) میں ہمارے پاس دو طریقے ہیں۔ پہلا طریقہ یہ ہے کہ مشرک سے کہا جائے کہ ہم اس علم میں متفق ہیں کہ کوئی مخصص (ترجیح دینے والا) موجود ہے، اور اس کی ذات ثابت ہے، اور کم از کم وہ ایک ہے۔ پس جو ایک سے زیادہ کا اضافہ کرے، اسے اس پر دلیل لانی چاہیے۔ لہٰذا تم پر لازم ہے کہ تم اس زائد کے ثبوت پر دلیل لاؤ جسے تم نے شریک بنایا ہے۔ پس فریق مخالف کو ہی اس کے اثبات کی ذمہ داری اٹھانی چاہیے۔ اور دوسرا طریقہ اللہ تعالیٰ کا یہ قول ہے:\n**لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا**\n(اگر آسمانوں اور زمین میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں تباہ ہو جاتیں)۔\nیہ ایک مقدمہ ہے۔ اور دوسرا مقدمہ یہ ہے کہ آسمان اور زمین—اور میرا مطلب ہے اللہ کے سوا ہر چیز—تباہ نہیں ہوئیں۔ اور یہ دوسرا مقدمہ ہے۔ اور دونوں مقدموں کو جمع کرنے والا، جو کہ ربط ہے، فساد (تباہی) ہے۔ پس ہم نے مخصص (ترجیح دینے والے) کی احدیت (Aḥadiyyah) کا نتیجہ نکالا، اور یہی مطلوب ہے۔ ہم نے یہ اس لیے کہا کہ اگر واحد (Al-Wāḥid) سے زیادہ کوئی اور معبود ہوتا، تو یہ زائد یا تو ارادے میں متفق ہوتے یا مختلف ہوتے۔ اگر وہ متفق ہوتے، تو یہ ناممکن نہیں کہ اختلاف فرض کیا جائے تاکہ ہم دیکھیں کہ ان میں سے کس کا ارادہ نافذ ہوتا ہے۔ اور اگر وہ حقیقت میں یا فرضاً ارادے میں مختلف ہوں، تو یا تو ممکن میں ان دونوں کے ارادے کا حکم نافذ ہو گا، جو کہ محال ہے کیونکہ ممکن دو متضاد چیزوں کو قبول نہیں کرتا۔ یا تو حکم نافذ نہیں ہو گا، یا ان میں سے ایک کے ارادے کا حکم دوسرے کے بغیر نافذ ہو گا۔ اگر ان دونوں کے ارادے کا حکم نافذ نہ ہو، تو ان میں سے کوئی بھی معبود نہیں، حالانکہ ترجیح واقع ہو چکی ہے۔ لہٰذا ضروری ہے کہ ان میں سے ایک نافذ الارادہ ہو اور دوسرا اپنے ارادے کو نافذ کرنے سے قاصر رہا ہو۔ پس عجز (کمزوری) حاصل ہوا، اور معبود عاجز نہیں ہوتا۔ پس معبود وہی ہے جس کا ارادہ نافذ ہوا، اور وہ اللہ واحد (Al-Wāḥid) ہے، اس کا کوئی شریک نہیں۔ خلیل علیہ السلام (ابراہیم) نے بھی اقوال میں اسی طرح استدلال کیا، پس غور و فکر نے انہیں یہ نتیجہ دیا کہ غروب ہونا عالم کی حفاظت کے منافی ہے۔ لہٰذا معبود غروب ہونے کی صفت سے متصف نہیں ہوتا، یا غروب ہونا ایک حادث (عارضی) چیز ہے کیونکہ یہ غروب ہونے والے پر اس کے غروب نہ ہونے کے بعد طاری ہوتا ہے، اور معبود حادثات کا محل نہیں ہو سکتا، دیگر قریبی ماخذ کی دلیلوں کی بنا پر۔ اور یہ انوار (ستارے) غروب ہونے کو قبول کرتے ہیں، لہٰذا ان میں سے کوئی بھی معبود نہیں۔ اور یہ بعینہٖ اللہ تعالیٰ کے اس قول کا طریقہ ہے: **لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا**۔ اور ہر وہ دلیل جو اس معنی کی طرف رجوع نہ کرے، وہ دلیل نہیں ہو گی۔ پھر اللہ تعالیٰ نے ابراہیم علیہ السلام کے قصے میں فرمایا:\n**وَتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ**\n(اور یہ ہماری دلیل تھی جو ہم نے ابراہیم کو عطا کی)۔\nاور ان کے پاس اس کے سوا کوئی اور دلیل نہیں تھی۔ پس اس کا قول **حُجَّتُنا** (ہماری دلیل) یعنی ہماری اس دلیل کی طرح جسے ہم نے اپنی توحید (Al-Tawhid) پر دلیل کے طور پر قائم کیا، اور وہ ہمارا قول ہے: **لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا**۔ اور یہ دلائل اور ان کی مثالیں صرف اللہ کی توحید (Al-Tawhid) کو مطلوب کرتی ہیں، یعنی اس واحد (Al-Wāḥid) کے علاوہ کوئی دوسرا معبود نہیں۔ جہاں تک ذات (Al-Dhāt) کی اپنی احدیت (Aḥadiyyah) کا تعلق ہے، تو اس کی ماہیت (حقیقت) معلوم نہیں ہو سکتی تاکہ اس پر کوئی حکم لگایا جا سکے، کیونکہ وہ عالم کی کسی چیز سے مشابہت نہیں رکھتی اور نہ ہی کوئی چیز اس سے مشابہت رکھتی ہے۔ لہٰذا عاقل اس کی ذات کے بارے میں بات کرنے کی طرف رجوع نہیں کرتا مگر اس کی طرف سے خبر کے ساتھ۔ اور خبر آنے کے باوجود، ہم اس حکم کی نسبت کو اس کی طرف جاننے سے قاصر ہیں کیونکہ ہم اسے نہیں جانتے، بلکہ ہم اس پر ایمان لاتے ہیں جیسا کہ اس نے کہا اور جیسا کہ وہ جانتا ہے۔ کیونکہ دلیل صرف شرعاً اور عقلاً تشبیہ کی نفی پر قائم ہوتی ہے۔ یہ ایک قریبی طریقہ ہے جس پر اکثر اہل نظر علماء ہیں۔\n\nجہاں تک ایمان کے نور سے توحید (Al-Tawhid) قائم کرنے والے کا تعلق ہے جو عقل کے نور سے زیادہ ہے، اور جو سعادت عطا کرتا ہے، اور وہ ایسا نور ہے جو کسی دلیل سے حاصل نہیں ہوتا، بلکہ یہ صرف اس شخص کے لیے الٰہی عنایت سے ہوتا ہے جس کے پاس یہ پایا جاتا ہے، اور اس کا تعلق مخبر (خبر دینے والے) کی سچائی سے ہے جو اس نے خاص طور پر اپنے بارے میں خبر دی ہے۔ ایمان کا تعلق اس سے زیادہ نہیں ہے۔ اگر خبر کا تعلق کشف (Al-Kashf) ہو، تو وہ ایک دوسرے نور سے ہوتا ہے، جو ایمان کا نور نہیں ہے، لیکن ایمان کا نور اس سے جدا نہیں ہوتا۔ اور وہ نور ہی ہے جو بندے کے لیے اس کی اپنی احدیت (Aḥadiyyah) اور ہر موجود کی احدیت کو ظاہر کرتا ہے، جس کے ذریعے وہ دوسرے سے ممتاز ہوتا ہے، خواہ کوئی ایسی صفت ہو جس میں اشتراک واقع ہو یا نہ ہو، اس کے لیے ایک مخصوص احدیت کا ہونا ضروری ہے جس کے ذریعے وہ دوسرے سے امتیاز حاصل کرے۔ پس جب اس نور نے بندے کے لیے موجودات کی احدیت کو ظاہر کیا، تو اس نے اس نور سے قطعی طور پر جان لیا کہ اللہ تعالیٰ کے لیے ایک مخصوص احدیت ہے۔ یا تو وہ اس کی عین (ذات) ہو گی، تو وہ احدی الذات (Aḥadī al-Dhāt) اور احدی المرتبہ (Aḥadī al-Martabah) ہو گا، اور وہ اس کی عین ہے۔ یا وہ احدیت المرتبہ ہو گی، تو کشف (Al-Kashf) نظری دلیل کے مطابق ہو گا، اور وہ قطعی طور پر جان لے گا کہ ذات (Al-Dhāt) ایک مخصوص احدیت پر ہے جو اس کی عین ہے۔ اور یہی ابو العتاہیہ کے اس قول کا معنی ہے:\n> وفي كل شي‏ء له آية *** تدل على أنه واحد\n(اور ہر چیز میں اس کے لیے ایک نشانی ہے جو اس بات پر دلالت کرتی ہے کہ وہ واحد ہے)۔\n\nاور وہ نشانی ہر معلوم کی احدیت (Aḥadiyyah) ہے، خواہ وہ کثیر ہو یا غیر کثیر۔ کیونکہ کثرت کے لیے کثرت کی احدیت ہوتی ہے جو کسی اور کے لیے ہرگز نہیں ہو سکتی۔ اور احدیت حقیقت میں تنزیہ (پاکیزگی) کی صفت ہے، لہٰذا یہ کسی بنانے والے کے بنانے سے نہیں ہوتی، جیسا کہ ہمارے بعض اصحاب کا خیال ہے۔ پس جس نے کہا کہ اس نے واحد (Al-Wāḥid) کو واحد کیا اور اس سے وہی مراد لی جو وہ وحدت (Al-Waḥdah) سے مراد لیتا ہے، تو یہ صحیح نہیں ہے۔ اور اگر اس نے اپنے قول \"وحد الواحد\" سے دوسری قسم مراد لی، تو یہ صحیح ہے۔ واحد (Al-Wāḥid) اپنی ذات کے لحاظ سے اپنے لیے واحد ہے۔ پس اہل طریق اللہ نے دیکھا کہ توحید (Al-Tawhid) اگر ثابت ہو جائے کہ وہ عین شرک (Al-Shirk) ہے، تو جو اپنی ذات کے لیے واحد ہے وہ تمہارے اسے واحد ثابت کرنے سے واحد نہیں ہوتا۔ پس تم نے اسے ثابت نہیں کیا، بلکہ وہ اپنی ذات کے لیے ثابت ہے۔ اور تم نے جانا کہ وہ واحد ہے، نہ یہ کہ تم نے اسے واحد ثابت کیا۔ اسی لیے ہمارے اصحاب میں سے کسی نے کہا: \"اس کا قول کہ جس نے بھی اسے واحد کیا وہ منکر ہے (جاحد)\"، کیونکہ واحد کو واحد نہیں کیا جاتا، کیونکہ وہ اسے قبول نہیں کرتا۔ کیونکہ اگر وہ اسے قبول کرتا تو وہ دو ہو جاتا: اس کی اپنی وحدت اور موحد کی وہ وحدت جو اس نے اس کے لیے ثابت کی۔ پس وہ اپنی ذات سے واحد ہو گا اور دوسرے کی طرف سے اس کے لیے وحدت کے اثبات سے واحد ہو گا، تو وہ دو وحدتوں والا ہو جائے گا، اور اس کا واحد ہونا ختم ہو جائے گا۔ اور ہر وہ امر جس کا اثبات اس کی نفی کے بغیر صحیح نہ ہو، تو اس کا کوئی ثبوت نہیں ہوتا۔ پس حقیقی توحید (Al-Tawhid) ہمارے لیے خاص طور پر ظاہراً اور باطناً خاموشی ہے۔ جب بھی وہ بولتا ہے، وہ وجود دیتا ہے، اور جب وہ وجود دیتا ہے، تو وہ شرک (Al-Shirk) کرتا ہے۔ اور خاموشی ایک عدمی صفت ہے۔ پس وجود (Al-Wujud) کی توحید اس کے لیے باقی رہتی ہے۔ اور شرک (Al-Shirk) اس کی توحید میں صرف مخلوق کے وجود میں لانے سے داخل ہوا، کیونکہ مخلوق نے اپنی حقائق کے ذریعے مختلف نسبتوں کا مطالبہ کیا جو حکم میں کثرت کا تقاضا کرتی ہیں، اگرچہ عین (ذات) ایک ہے۔ پس توحید (Al-Tawhid) میں آفت صرف ایجاد (وجود میں لانے) سے طاری ہوئی ہے۔ پس توحید نے اپنے اوپر ظلم کیا، موجودات نے اس پر ظلم نہیں کیا۔ اور یہ توحید (Al-Tawhid) کا وہبی علم ہے جو فکری نظر سے حاصل نہیں ہوتا۔ اور ہر وہ توحید جو فکری نظر سے حاصل ہوتی ہے، وہ اس گروہ کے نزدیک کسبی (حاصل کردہ) ہے۔\n\n### [یہ کہ شریعت نے ذات (Al-Dhāt) کی اپنی احدیت (Aḥadiyyah) سے کسی چیز کے ذریعے تعرض نہیں کیا]\n\nاور جان لو کہ شریعت نے ذات (Al-Dhāt) کی اپنی احدیت (Aḥadiyyah) سے کسی چیز کے ذریعے تعرض نہیں کیا، بلکہ اس نے صرف الوہیت (Al-Ulūhiyyah) کی توحید (Al-Tawhid) اور اس کی احدیت پر نص قائم کی کہ اس کے سوا کوئی معبود نہیں۔ اور یہ عقل کی فضول خرچیوں میں سے ہے، کیونکہ عقل کے پاس بہت سی فضول چیزیں ہیں جو اس پر فکر کے حکم اور انسان کی تمام قوتوں نے اسے پہنچائی ہیں۔ اور عقل سے زیادہ تقلید کرنے والی کوئی چیز نہیں، حالانکہ وہ یہ خیال کرتی ہے کہ وہ الٰہی دلیل کی مالک ہے، حالانکہ وہ صرف فکری دلیل کی مالک ہے۔ کیونکہ فکری دلیل اسے جہاں چاہتی ہے لے جاتی ہے، اور عقل اندھے کی طرح ہے، بلکہ وہ حق (Al-Haqq) کے راستے سے اندھی ہے۔ پس اہل اللہ نے اپنی فکروں کی تقلید نہیں کی، کیونکہ مخلوق مخلوق کی تقلید نہیں کرتی۔ پس انہوں نے اللہ کی تقلید کی طرف رجوع کیا، پس انہوں نے اللہ کو اللہ کے ذریعے پہچانا۔ پس وہ ویسا ہی ہے جیسا اس نے اپنے بارے میں کہا، نہ کہ جیسا فضول عقل نے اس پر حکم لگایا۔ اور عاقل کے لیے یہ کیسے مناسب ہے کہ وہ قوت مفکرہ (سوچنے والی قوت) کی تقلید کرے، حالانکہ وہ فکری نظر کو صحیح اور فاسد میں تقسیم کرتا ہے، اور اسے صحیح اور فاسد کے درمیان فرق کرنے والے کی ضرورت ہوتی ہے، اور فکری نظر کے صحیح اور فاسد کے درمیان فکری نظر سے فرق کرنا محال ہے۔ لہٰذا اسے اس معاملے میں اللہ کی ضرورت ہو گی۔ پس جس کی طرف ہم فکری نظر کے صحیح کو فاسد سے ممتاز کرنے کے لیے پناہ لیتے ہیں تاکہ ہم اس کے ذریعے حکم لگائیں، ہم ابتداء میں بھی اسی کی طرف پناہ لیتے ہیں کہ وہ ہمیں مطلوبہ علم بغیر فکر کے استعمال کے عطا کرے۔ اور اسی پر اس گروہ نے بھروسہ کیا اور اسی پر عمل کیا، اور یہ انبیاء، رسولوں اور اہل اللہ میں سے اہل علم کا علم ہے۔ اور انہوں نے اپنی فکروں کو ان کے مقام سے تجاوز نہیں کرنے دیا، اور انہوں نے جانا کہ ان کی صحیح ادراک کی انتہا، ان کے زعم میں، یہ ہے کہ وہ اپنی دلیلوں کو حسی اور بدیہی امور پر قائم کریں۔ حالانکہ انہوں نے ابتداء میں حواس کی غلطی کا حکم لگایا اور بدیہیات پر اعتراض کیا، پھر وہ ان کو مصادرہ (بغیر دلیل کے قبول) کرنے کے لیے واپس آئے کیونکہ ان پر دلیل لانا مشکل تھا۔ پس تمام امور میں اللہ کی طرف رجوع کرنا زیادہ بہتر ہے، جیسا کہ اس نے فرمایا:\n**وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ**\n(اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں)۔\nاور یہ بھی معاملات میں سے ہے۔ پس کوئی علم نہیں مگر وہ علم جو اللہ سے حاصل کیا گیا ہو، کیونکہ وہ سبحانہٗ اکیلا عالم ہے، اور وہ معلم ہے جس سے حاصل کرنے والے پر کوئی شبہ داخل نہیں ہوتا۔ اور ہم اس کے مقلد (تقلید کرنے والے) ہیں، اور جو اس کے پاس ہے وہ حق (Al-Haqq) ہے۔ پس ہم اس کی تقلید میں، جو اس نے ہمیں بتایا، فکری نظر رکھنے والوں سے زیادہ علماء کے نام کے مستحق ہیں جنہوں نے اس کی تقلید کی جو اس نے انہیں عطا کیا۔ اسی لیے وہ اللہ کے علم میں **لَا يَزَالُونَ مُخْتَلِفِينَ** (ہمیشہ اختلاف کرتے رہیں گے)۔ اور انبیاء، ان کی کثرت اور ان کے درمیان زمانوں کے فاصلے کے باوجود، اللہ کے علم میں ان کے درمیان کوئی اختلاف نہیں، کیونکہ انہوں نے اسے اللہ سے حاصل کیا۔ اور اسی طرح اہل اللہ اور اس کے خاص بندے بھی۔ پس متاخر متقدم کی تصدیق کرتا ہے اور وہ ایک دوسرے کو مضبوط کرتے ہیں۔ اور اگر صرف یہی ہوتا تو کافی تھا اور ان سے علم حاصل کرنا واجب تھا۔\n\nاور یہ باب، یعنی توحید (Al-Tawhid) کا باب، ایک لحاظ سے مناسبت (مماثلت) دیتا ہے، اور اہل اللہ کی ایک جماعت نے یہ کہا ہے، جیسے ابو حامد اور ہمارے دیگر شیوخ۔ اور ایک لحاظ سے مناسبت نہیں دیتا، اور ہمارے اصحاب کی ایک جماعت نے یہ کہا ہے، جیسے ابو العباس بن العریف الصنہاجی، اور انہوں نے مناسبت کی مکمل نفی کی۔ اور جس کی طرف میں جاتا ہوں اور جو میں کہتا ہوں، جیسا کہ ہم نے پہلے اصول قائم کیا ہے، وہ یہ ہے کہ ہم اللہ کے علم میں اور غیر اللہ کے علم میں صرف اللہ کی تقلید کریں۔ پس ہم اس کے مطابق ہیں جو وہ اپنے حق میں ہم پر القا کرتا ہے۔ اگر اس نے ہم سے مناسبت کے ساتھ خطاب کیا، تو ہم نے اس پر کہا جہاں اس نے ہم سے خطاب کیا، ہم اس مقام سے تجاوز نہیں کرتے اور اسی پر اکتفا کرتے ہیں۔ اور اگر اس نے ہم سے مناسبت کو اٹھانے کے ساتھ خطاب کیا، تو ہم نے اسے اس مقام پر اٹھا دیا جہاں اس نے اسے اٹھایا، ہم اس سے تجاوز نہیں کرتے۔ پس حکم اس کا ہو گا، ہمارا نہیں۔ پس ہم ہمیشہ درست رہیں گے اور کبھی غلطی نہیں کریں گے۔ اور اسی کو انبیاء علیہم السلام کے حق میں عصمت (Infallibility) اور اولیاء کے حق میں حفظ (حفاظت) سے تعبیر کیا جاتا ہے۔ اور جب بھی وہ اللہ کی طرف سے خبر نہیں دیتا، تو اگر اس سے حق (Al-Haqq) کو پہنچنا حاصل ہو، تو یہ اس کی طرف نظر کرنے سے اتفاقی ہے، اور حق کی طرف نظر کرنے سے مقصود ہے۔ یہی وہ چیز ہے جس پر ہم بھروسہ کرتے ہیں۔\n\nاس کا قول:\n**لَيْسَ كَمِثْلِهِ شَيْءٌ**\n(اس کی مثال کوئی چیز نہیں)\nکاف (Kāf) کے اضافے کے ساتھ، شیئیت (چیز ہونے) کی مناسبت کو اٹھاتا ہے۔ اور آیت کا بقیہ حصہ:\n**وَهُوَ السَّمِيعُ الْبَصِيرُ**\n(اور وہ سننے والا، دیکھنے والا ہے)\nمناسبت کا اثبات ہے۔ اور آیت ایک ہے اور کلمات مختلف ہیں۔ پس ہم اس واضح راستے سے نہیں ہٹیں گے، کیونکہ یہ سب سے مضبوط دلیل ہے، اور یہ وہی ہے جس کی طرف ہم گئے ہیں، یعنی حق (Al-Haqq) کی تقلید، کیونکہ یہ دنیا اور آخرت میں علم اور نجات کا راستہ ہے۔ اور یہ نبیوں، رسولوں اور الٰہیین میں سے فیض (Faiz) کے قائلین کا راستہ ہے۔ پس جب تمہارے پاس اللہ کی طرف سے کوئی علم آئے، تو اسے فکر کے میزان میں داخل نہ کرو، اور اپنی عقل کو اس تک رسائی نہ دو، ورنہ تم اسی وقت ہلاک ہو جاؤ گے۔ کیونکہ الٰہی علم میزان میں داخل نہیں ہوتا، کیونکہ وہ ہی اسے قائم کرنے والا ہے۔ پس اسے قائم کرنے والا اس کے حکم کے تحت کیسے داخل ہو سکتا ہے؟ نائب اس پر حکم نہیں لگاتا جس نے اسے خلیفہ بنایا، بلکہ اس پر حکم لگاتا ہے جس پر اسے خلیفہ بنایا گیا۔ اور علم عقل کے منافی ہے، کیونکہ عقل ایک قید ہے، اور علم علامت سے حاصل ہوتا ہے، اور کسی چیز پر سب سے بڑی علامت خود وہ چیز ہے۔ اور اس کے علاوہ ہر علامت میں، ہماری نظر میں، درستگی اتفاقی ہے۔ اور اس باب میں یہ مقدار ہمارے طریقے کے حکم کے مطابق مقصودہ غرض کے لیے کافی ہے۔ اور **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\n\n### (فصل) وتر (Al-Witr) کے بارے میں\n\nاور یہ توحید (Al-Tawhid) کی اقسام میں سے ایک قسم ہے۔ جان لو کہ عربی زبان میں وتر (Al-Witr) کا مطلب بدلہ (ثأر) طلب کرنا ہے۔ حق (Al-Haqq) کی احدیت (Aḥadiyyah) وتر (Al-Witr) کی صفت سے اس لیے متصف ہوئی کہ وہ اس احدیت کا بدلہ طلب کرتی ہے جو اس واحد (Al-Wāḥid) کی احدیت تھی جس نے اپنے وجود سے دو کو ظاہر کیا، پھر اس سے لے کر لا متناہی اعداد تک۔ پس جب اس ظہور نے احدیت کے حکم کو زائل کر دیا، تو حق (Al-Haqq) کی احدیت اس زائل شدہ احدیت کا بدلہ طلب کرنے لگی جس کی عین (ذات) کو اس واحد نے ختم کر دیا جس کے وجود سے کثرت ظاہر ہوئی، اور وہ وحدانیت (Al-Waḥdāniyyah) کا مطالبہ کرتی ہے۔ پس اس مطالبے کی وجہ سے اسے وتر (Al-Witr) کہا گیا۔ پس اس واحد نے اپنی طرف سے دفاع کے لیے ایک نائب مقرر کیا، اور اس نے عارف (Al-Ārif) کو حق (Al-Haqq) کی زبان سے وکیل بنا کر کھڑا کیا، پس اس نے کہا: اے حاکم جو احدیت کا بدلہ طلب کرتا ہے، احدیت ختم نہیں ہوئی، بلکہ یہ جس کا تم مطالبہ کر رہے ہو، اس نے دوئیت، نہ تین، نہ چار، اور نہ ہی اس سے اوپر کے اعداد کو عطا کیا، کیونکہ وہ وہ چیز عطا نہیں کرتا جو اس کی حقیقت کا تقاضا نہ ہو۔ بلکہ جس نے ہمیں دو عطا کیا وہ دو کی احدیت ہے، اور تین اور چار کی احدیت ہے، جہاں تک بھی عدد پہنچے۔ اور یہ اس لیے ہے تاکہ اعداد کی اعیان (ذاتیں) اپنی اس احدیت کے ذریعے تمہاری احدیت پر استدلال کریں، پس انہوں نے صرف تمہارے حق میں اور تمہاری خاطر کوشش کی، کیونکہ تم جانتے ہو کہ اعداد کائنات میں صرف اسماء الٰہیہ کے حکم سے ظاہر ہوئے ہیں، کیونکہ وہ کثرت ہیں، اور ان کی کثرت کے باوجود احدیت ان کے لیے متحقق ہے۔ پس اس واحد نے چاہا کہ اعداد کی اعیان اسماء کی احدیت سے ناواقف نہ رہیں، تاکہ وہ اللہ کے جناب میں کثرت کا وہم نہ کریں، پس اس نے ہر عدد میں اس عدد کی احدیت عطا کی، کثرت کے وجود سے غیرت کی وجہ سے جو احدیت اور وحدت کی عین کو ختم کر دیتی ہے۔ پس اس کا عذر قبول کیا گیا، اور یہ معلوم ہوا کہ وہ اس میں حق (Al-Haqq) کی احدیت کے اخلاق سے متصف ہے، جو کثیر اسماء کی احدیت کو قائم کرنے میں ہے۔ اور اس پر غیرت کی وجہ سے وتر (Al-Witr) کا نام جاری ہوا۔ پس اللہ وتر ہے اور وتر کو پسند کرتا ہے۔ اور اس کے بعد والے باب میں ان شاء اللہ کثرت اور اشتراک کا علم آئے گا۔\n\n### (فصل) فرد (Al-Fard) کے بارے میں\n\nاور فرد (Al-Fard) اس باب کے حکم میں سے ہے، اور اسے اس لیے فرد کہا جاتا ہے کہ وہ اپنی مخلوق سے ممتاز ہونے والی چیزوں میں یکتا ہے۔ پس وہ اس لحاظ سے فرد نہیں ہے کہ وہ واحد (Al-Wāḥid) ہے، کیونکہ وہ اپنی ذات کے لیے واحد ہے، اور وہ ہر چیز کی احدیت سے ممتاز ہونے کی وجہ سے فرد ہے۔ اور اس کے سوا کسی اور کے لیے فرد (Al-Fard) صحیح نہیں ہے، کیونکہ اللہ کے سوا ہر چیز میں ایک دوسرے کے ساتھ اشتراک ہے، اور وہ اپنی احدیت سے ممتاز ہوتی ہے، لیکن منفرد نہیں ہوتی، کیونکہ اشتراک کی صفت اس سے مانع ہے۔ پس فرد (Al-Fard) کا نام حقیقت میں صرف اللہ حق (Al-Haqq) کے لیے ہی صحیح ہے، کیونکہ وہ تمام پہلوؤں سے فرد ہے، إذ لم تكن له صفة اشتراك (کیونکہ اس میں اشتراک کی کوئی صفت نہیں ہے) جیسا کہ اس کے سوا موجودات میں ہے۔ اور اسی لیے موجودات حدود (تعریفوں) کا مطالبہ کرتی ہیں، اور اللہ کو کوئی حد طلب نہیں کرتی، اور نہ ہی کوئی مثال یا ضد اس کے مقابل آتی ہے۔ اللہ اور اس کے اسماء سب فردیت (Fardiyyah) رکھتے ہیں، کیونکہ وہ اس کے لیے نسبتیں ہیں نہ کہ اعیان (ذاتیں)، پس حد اس اسم کو لے لیتی ہے جب وہ حادث (مخلوق) پر دلالت کرے، اور حد اسے نہیں لیتی جب اس سے اللہ کو نامزد کیا جائے، پس تم لفظ کی حد بیان کرتے ہو اور اس کے مدلول (جس پر دلالت کی گئی) کی حد بیان نہیں کرتے، مگر جب اس کا مدلول حادث ہو، اور بس۔ اور لفظ میں اشتراک سے معنی میں اشتراک لازم نہیں آتا، کیونکہ لفظ تمہارا ہے، اس کا نہیں، اور تم میں اشتراک ہے۔ اسی لیے اسے لفظی اشتراک کہا جاتا ہے۔ کیا تم مشترک الفاظ کو نہیں دیکھتے جیسے \"المشتری\" (خریدار/مشتری سیارہ)، اشتراک صرف نام کے اطلاق میں ہے۔ اسی لیے جب اس کے مالک سے حد کا مطالبہ کیا جاتا ہے تو تفصیل واقع ہوتی ہے، پس کہا جاتا ہے کہ تم کون سا مشتری چاہتے ہو؟ وہ مشتری جو آسمان میں ایک سیارہ ہے، یا وہ مشتری جو بیع کا معاہدہ کرنے والا ہے؟ پس جب اس کی حد بیان کی جاتی ہے تو ہر عین دوسرے سے ممتاز ہو جاتی ہے۔ پس لفظ میں مدلول کی ماہیت (حقیقت) میں سے کچھ نہیں ہے۔ اسی سے ہم حق (Al-Haqq) کے بارے میں کہتے ہیں کہ وہ سمیع (سننے والا) اور بصیر (دیکھنے والا) ہے، اور اس کے لیے ہاتھ، دو ہاتھ یا کئی ہاتھ، اور آنکھیں، اور پاؤں ہیں، اور ہر وہ چیز جو اس نے اپنے لیے مطلق کی ہے جسے عقل اس پر مطلق نہیں کر سکتی، کیونکہ اس نے یہ اطلاق صرف محدثات (نئی پیدا ہونے والی چیزوں) پر جانا ہے۔ اور اگر شریعت اور الٰہی نبوی خبریں انہیں نہ لاتیں تو ہم عقلی طور پر انہیں اس پر مطلق نہ کرتے۔ اور اس کے باوجود ہم تشبیہ کی نفی کرتے ہیں اور کسی خاص امر کو نہیں لیتے کیونکہ ہم اس کی ذات (Al-Dhāt) سے ناواقف ہیں۔ اور ہم نے تشبیہ کی نفی اس کے قول **لَيْسَ كَمِثْلِهِ شَيْءٌ** کے ذریعے کی ہے، نہ کہ اس کے ذریعے جو عقلی دلیل نے دیا، تاکہ اس پر صرف اس کے کلام سے ہی حکم لگایا جائے۔ اور اسی کے ساتھ ہم اس سے ملنا پسند کرتے ہیں جب ہم اس سے ملیں گے اور وہ ہماری بصیرتوں اور آنکھوں سے اندھے پن کا پردہ ہٹا دے گا، اگر اس کا ہٹانا مطلقاً ممکن ہو، یا اس میں سے جو ہٹانا ممکن ہو، یا تو سب کے حق میں برابری کے ساتھ، یا بندوں کے حق میں فضیلت کے ساتھ، پس ہر شخص ایک ایسے دیدار کے ساتھ منفرد ہو جائے گا جو کسی اور کے لیے نہ ہو گا۔ اور توحید (Al-Tawhid) کے علم میں کشف (Al-Kashf) صرف اس شخص کے نزدیک صحیح ہے جو مناسبت کا قائل ہو، نہ کہ اس کے نزدیک جو مناسبت کی نفی کا قائل ہو، کیونکہ توحید کوئی وجودی امر نہیں ہے، بلکہ یہ ایک نسبت ہے، اور نسبتیں کشف (Al-Kashf) کے ذریعے ادراک نہیں کی جاتیں، بلکہ دلیل کے ذریعے معلوم ہوتی ہیں۔ کیونکہ کشف (Al-Kashf) رؤیت (دیکھنا) ہے، اور رؤیت مرئی (دیکھی جانے والی چیز) سے صرف ان کیفیات سے متعلق ہوتی ہے جن پر مرئی ہوتا ہے۔ اور کیا اس الٰہی جناب میں کوئی کیفیت ہے یا نہیں؟ دلیل کیفیت کی نفی کرتی ہے۔ پس اگر وہ یہ چاہتا ہے کہ اس کی ذات میں کوئی کیفیت نہیں ہے، تو کشف نہیں ہو گا، اور اگر وہ یہ چاہتا ہے کہ اس کی کیفیت معقول نہیں ہے، تو یہ ممکن ہے کہ کشف ہو، اس لحاظ سے کہ اس کی کوئی ایسی کیفیت ہے جو معقول نہیں ہے، لیکن کشف کے وقت اس کا علم حاصل ہو جاتا ہے۔ کیونکہ ہر وہ کیفیت جو عقل نے چیزوں میں اپنی نظر سے حاصل کی ہے، وہ اس کے نزدیک اس پر محال ہے، اس کے اسماء پر ایمان کے ثبوت کے ساتھ، نہ کہ ان کے معقول ہونے کے ساتھ، جیسے نزول، استواء، معیت (ساتھ ہونا)، تقلیب (پلٹنا)، تردد (ہچکچاہٹ)، ہنسنا، تعجب، رضا، اور غضب۔ کیونکہ اللہ نے ان معانی کو تمثیل (مثال) کی بارگاہ میں مجسم کیا ہے، جیسے علم کو دودھ کی صورت میں۔ پس یہ اس کے لیے ہے، اور اس وقت تم اسے کشف (Al-Kashf) کے ذریعے حاصل کرو گے، ورنہ تم اسے کبھی حاصل نہیں کر سکو گے۔ اور یہ معلوم نہیں کہ نبوت نے اسے کہاں سے لیا، کیا اسے خبر کے طور پر حاصل کیا یا کشف کے طور پر؟ اگر خبر کے طور پر، تو برابری واقع ہوئی، اور اگر کشف کے ذریعے، تو یہ اس کے مطابق ہے جو ہم نے ذکر کیا ہے۔ اور **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب صد و هفتاد و دوم در معرفت مقام توحید)\n\nعروسکی در قلب نصب شده است\nکه نه روح دارد و نه جسد\n\nعقیده‌اش در آن نوشته شده است\nبا مرکبی که تماماً جسد است\n\nیکتایی که هیچ کس مانند او نیست\nبه زیبایی وصف، یگانه است\n\nسرچشمه هستی‌ها (الأکوان) حضور اوست\nو او نه جفت دارد و نه عدد\n\nآنکه هستی (الوجود) به او قائم است\nکار ما بر او استوار می‌شود\n\nو من بنده فقیر به او هستم\nو او نیکوکار و بی‌نیاز (الصمد) است\n\nپس از حکمتی که یافت شد، شگفت‌زده شوید\nآری، و به حق رحمان، نیافتند\n\nحکمتی که دربرگیرنده احکام است\nحسودان چون حسد ورزیدند، به آن دست یافتند\n\nابد در برابر ازل سر فرود می‌آورد\nازلی که ابد آن را امتداد می‌دهد\n\nهر کس به سوی غایتی می‌شتابد\nخواهد دید، در حالی که او را غایتی نیست\n\nتوحید این‌گونه است، پس عبرت بگیرید\nواحدی در واحدی که احد است\n\n### [توحید عملی در حصول علم در نفس انسان]\n\nبدان که توحید عملی (التوحيد التعمل) در حصول علم در نفس انسان یا سالک (الطالب) است به اینکه خدایی که او را ایجاد کرده، واحد است و در الوهیت (ألوهیته) شریکی ندارد. وحدت (الوحدة) صفت حق (الحق) است و اسم‌های او از آن، احد (الأحد) و واحد (الواحد) هستند. اما وحدانیت (الوحدانية)، قیام وحدت به واحد است از آن جهت که جز با قیام آن به واحد، تعقل نمی‌شود، هرچند که نسبتی است و آن نسبت تنزیه است. این معنای توحید است، مانند تجرید (التجريد) و تک‌سازی (التفريد)، و آن عملی است در حصول انفراد که اگر به موصوف نسبت داده شود، موصوف به آن فرد یا منفرد یا متفرد نامیده می‌شود. پس توحید نسبتی است از فعل موحد که در نفس عالم به آن حاصل می‌شود که خداوند واحد است. خداوند متعال می‌فرماید: لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا (اگر در آسمان و زمین خدایانی جز الله بودند، قطعاً تباه می‌شدند). و حال آنکه صلاح (بقا و وجود عالم) یافت شده است. پس این دلالت می‌کند بر اینکه اگر ایجادکننده آن واحد نبود، وجود عالم صحیح نمی‌بود. این دلیل حق (الحق) در آن بر احدیت (أحدیته) اوست و با دلیل عقلی در این زمینه مطابقت دارد. اگر دلیلی غیر از این، رساتر از آن بر احدیت او بود، به آن روی می‌آورد و آن را می‌آورد. ما نه با این دلیل و نه با راه رسیدن به آن در دلالت بر احدیت او آشنا شدیم. گروهی به زحمت افتادند تا از راهی دیگر بر احدیت او دلالت کنند و در این دلالت خدشه وارد کردند، پس میان جهل به آنچه حق (الحق) آن را دلیل بر احدیت خود قرار داده و سوء ادب جمع کردند. اما جهلشان این است که موضع دلالت بر توحید او در این آیه را نشناختند تا در آن قدح کردند. و اما سوء ادب، معارضه آنان با اموری است که در آن وارد شدند و قدح‌آور است، پس نظر خود را در توحید، در دلالت کامل‌تر از آنچه حق (الحق) با آن بر احدیت خود دلالت کرده، قرار دادند. و این راه را جز متأخرین از متکلمین که در این شأن نظر می‌کنند، نپیموده‌اند. اما متقدمین مانند ابوحامد، امام الحرمین، ابواسحاق اسفرايینی و شیخ ابوالحسن، از این دلالت روی نگرداندند و در تقریر آن کوشیدند و از استقامت آن پرده برداشتند، از روی ادب با خداوند متعال و علم به موضع دلالت آن.\n\n### [اینکه توحید خداوند فرع بر اثبات وجود اوست]\n\nو بدان که سخن گفتن درباره توحید خداوند از حیث اینکه او اله است، فرع بر اثبات وجود اوست. و این باب توحید است، پس ما نیازی به اثبات وجود نداریم، زیرا وجود نزد کسی که در توحید ما با او نزاع داریم، ثابت است. اما اثبات وجود او، با ضرورت عقل درک می‌شود، به دلیل وجود ترجیح ممکن به یکی از دو حکم.\n\n### [اثبات توحید خداوند متعال در دو طریق]\n\nو ما در توحید او دو طریق داریم: طریق اول این است که به مشرک گفته شود: ما در این علم که مخصص (ایجادکننده) وجود دارد، متفق هستیم و وجود او ثابت شده و حداقل آن است که واحد باشد. پس هر کس بر واحد بیفزاید، باید بر آن دلیل بیاورد. پس بر توست که دلیل بر ثبوت آن زائد که شریک قرار داده‌ای، بیاوری. در این صورت، خصم باید اثبات آن را به عهده بگیرد. و طریق دیگر، قول خداوند متعال است: لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا (اگر در آسمان و زمین خدایانی جز الله بودند، قطعاً تباه می‌شدند). این یک مقدمه است. و مقدمه دیگر این است که آسمان و زمین – و منظورم از آن هر آنچه غیر خداست – تباه نشده‌اند. و این مقدمه دیگر است. و جامع میان دو مقدمه که رابط است، فساد است. پس نتیجه می‌گیریم احدیت مخصص را، که مطلوب است. این را از آن رو گفتیم که اگر الهی زائد بر واحد وجود داشت، این زائد از دو حال خارج نبود: یا در اراده توافق می‌کردند یا اختلاف. اگر توافق می‌کردند، محال نیست که فرض اختلاف کنیم تا ببینیم اراده کدام یک از آن دو نافذ است. اگر در اراده حقیقتاً یا فرضاً اختلاف کنند، از این سه حال خارج نیست: یا حکم اراده هر دو در ممکن نافذ می‌شود که محال است، زیرا ممکن دو ضد را نمی‌پذیرد؛ یا هیچ یک نافذ نمی‌شود؛ یا حکم اراده یکی از آن دو بدون دیگری نافذ می‌شود. اگر حکم اراده هیچ یک نافذ نشود، پس هیچ یک اله نیستند، در حالی که ترجیح واقع شده است. پس ناگزیر باید اراده یکی از آن دو نافذ باشد و دیگری از اجرای اراده‌اش ناتوان بماند، در نتیجه عجز حاصل می‌شود، و اله عاجز نیست. پس اله کسی است که اراده‌اش نافذ شده و او خداوند واحد است که شریکی ندارد. خلیل (ابراهیم) علیه السلام نیز در اقوال خود این‌گونه استدلال کرد، و نظر او این بود که افول (غروب) با حفظ عالم منافات دارد. پس اله به افول متصف نمی‌شود، یا افول حادث است به دلیل عارض شدن آن بر آفل پس از آنکه آفل نبود، و اله محل حوادث نمی‌شود به دلایل دیگری که مأخذ نزدیکی دارند. و این انوار (ستارگان) افول را پذیرفته‌اند، پس هیچ یک از آن‌ها اله نیست. و این دقیقاً همان طریق قول خداوند متعال است: لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا (اگر در آسمان و زمین خدایانی جز الله بودند، قطعاً تباه می‌شدند). و هر دلیلی که به این معنا بازنگردد، دلیل نخواهد بود. سپس خداوند متعال در داستان ابراهیم فرمود: وَتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ (و این حجت ما بود که به ابراهیم دادیم). و او حجتی جز این نداشت. پس قول او \"حجتنا\" یعنی مانند حجت ما که آن را دلیل بر توحید خود قرار دادیم، و آن قول ماست: لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا. و این دلایل و امثال آن‌ها، تنها مطلوبشان توحید خداوند است، یعنی اله دیگری زائد بر این واحد وجود ندارد. اما احدیت ذات (الذات) در نفس خود، ماهیتی برای آن شناخته نمی‌شود تا بر آن حکم شود، زیرا او شبیه هیچ چیز از عالم نیست و هیچ چیز شبیه او نیست. پس عاقل به سخن گفتن درباره ذات او جز با خبری از جانب او نمی‌پردازد. و حتی با آمدن خبر، ما نسبت آن حکم را به او نمی‌دانیم، به دلیل جهل ما به او. بلکه به آن ایمان می‌آوریم بر اساس آنچه او گفته و بر اساس آنچه او می‌داند. زیرا دلیل جز بر نفی تشبیه شرعاً و عقلاً اقامه نمی‌شود. این طریقی نزدیک است که بیشتر علمای نظر بر آن هستند. اما موحد به نور ایمان که زائد بر نور عقل است، و آن نوری است که سعادت می‌بخشد، و اصلاً از دلیلی حاصل نمی‌شود، بلکه از عنایت الهی (عناية إلهية) به کسی که نزد او یافت شود، حاصل می‌گردد و متعلق آن، صدق مخبر در آنچه درباره خود خبر داده، است و متعلق ایمان بیش از این نیست. اگر متعلق خبر کشف شود، به نور دیگری است، نه نور ایمان، اما نور ایمان از آن جدا نمی‌شود. و آن نور است که احدیت نفس او و احدیت هر موجودی را که با آن از غیر خود متمایز می‌شود، برای او کشف می‌کند، خواه صفتی باشد که در آن اشتراک واقع شود یا نباشد. ناگزیر باید احدیتی باشد که مخصوص اوست و با آن از غیر خود امتیاز می‌یابد. پس هنگامی که این نور، احدیت موجودات را برای بنده کشف کرد، قطعاً با این نور دانست که خداوند متعال احدیتی مخصوص به خود دارد. یا اینکه عین او باشد، پس احدی الذات، احدی المرتبه است و عین آن است. و یا اینکه احدیت مرتبه باشد، پس کشف با دلیل نظری موافق می‌آید و قطعاً می‌داند که ذات بر احدیتی مخصوص به خود است که عین اوست. و این معنای قول ابوالعتاهیه است:\n\n> و در هر چیزی برای او نشانه‌ای است *** که دلالت می‌کند بر اینکه او واحد است\n\nو آن نشانه، احدیت هر معلومی است، خواه کثیر باشد یا غیر کثیر. زیرا کثرت، احدیتی دارد که هرگز برای غیر آن نخواهد بود. و احدیت (الأحدية) صفتی تنزیهی بر حقیقت است، پس به جعل جاعل نیست، چنانکه برخی از اصحاب ما می‌پندارند. پس کسی که می‌گوید او واحد را توحید کرده و منظورش همان است که از وحدت می‌خواهد، صحیح نیست. و اگر منظورش از قولش «واحد را توحید کرده» معنای دوم باشد، این صحیح است. واحد از حیث عین خود، برای خود واحد است. پس اهل طریق الله دیده‌اند که اگر توحید ثابت شود که عین شرک است، واحد برای خود، با اثبات تو واحد بودن او، واحد نمی‌شود. پس تو او را اثبات نکرده‌ای، بلکه او برای خود ثابت است و تو دانسته‌ای که او واحد است، نه اینکه تو اثبات کرده‌ای که او واحد است. به همین دلیل یکی از اصحاب ما گفته است: «زیرا هر کس او را توحید کند، منکر است»، چون واحد توحید نمی‌شود، زیرا آن را نمی‌پذیرد. زیرا اگر آن را بپذیرد، دو چیز خواهد بود: وحدت او در نفس خود و وحدت موحد که برای او اثبات کرده است. پس او واحد به نفس خود و واحد به اثبات وحدت برای او از جانب دیگری خواهد بود، در نتیجه دارای دو وحدت می‌شود و واحد بودن او منتفی می‌گردد. و هر امری که ثبوتش جز با نفی آن صحیح نباشد، اصلاً ثبوتی ندارد. پس توحید بر حقیقت، برای ما سکوت خاصی است، ظاهراً و باطناً. هرگاه سخن بگوید، ایجاد می‌کند، و اگر ایجاد کند، شرک می‌ورزد. و سکون صفتی عدمی است، پس توحید هستی (الوجود) برای او باقی می‌ماند. و شرک در توحید او جز با ایجاد خلق وارد نشده است، زیرا خلق به حقایق خود، نسبت‌های مختلفی را طلب کرده که کثرت را در حکم می‌طلبند، هرچند که عین (ذات) یکی است. پس آفت در توحید جز از ایجاد عارض نشده است. پس توحید بر خود جنایت کرده است، نه اینکه موجودات بر آن جنایت کرده باشند. و این همان علم توحید وهبی است که با نظر فکری درک نمی‌شود. و هر توحیدی که نظر فکری آن را بدهد، نزد این طایفه کسبی است.\n\n### [اینکه شریعت به احدیت ذات در نفس خود به چیزی نپرداخته است]\n\nو بدان که شریعت به احدیت ذات (الذات) در نفس خود به چیزی نپرداخته است، بلکه تنها بر توحید الوهیت و احدیت آن تصریح کرده است که: لا إله إلا هو (هیچ معبودی جز او نیست). و این تنها از فضول عقل است، زیرا عقل فضول بسیاری دارد که حکم فکر بر آن و تمام قوای موجود در انسان، آن را به این فضول کشانده است. و هیچ چیز مقلدتر از عقل نیست، در حالی که خیال می‌کند صاحب دلیل الهی است. در حالی که او صاحب دلیل فکری است، زیرا دلیل فکر او را به هر جا که بخواهد می‌برد. و عقل مانند نابیناست، بلکه از راه حق (الحق) نابیناست. پس اهل الله از افکار خود تقلید نکردند، زیرا مخلوق از مخلوق تقلید نمی‌کند. پس به تقلید از خداوند روی آوردند و خداوند را به واسطه خداوند شناختند. پس او بر اساس آنچه خود درباره خود گفته است، شناخته می‌شود، نه بر اساس آنچه فضول عقل بر او حکم کرده است. و چگونه شایسته است که عاقل از قوه متفکره تقلید کند، در حالی که نظر فکری را به صحیح و فاسد تقسیم می‌کند و ناگزیر به جداکننده‌ای میان صحیح و فاسد خود نیاز دارد؟ و محال است که میان صحیح و فاسد نظر فکری با نظر فکری فرق بگذارد. پس ناگزیر در این امر به خداوند نیاز دارد. پس کسی که در تمییز نظر فکری، صحیح آن از فاسدش، به او پناه می‌بریم تا با آن حکم کنیم، از ابتدا به او پناه می‌بریم تا علم به آن مطلوب را بدون به کارگیری فکر به ما عطا کند. و طایفه (صوفیه) بر این تکیه کرده و به آن عمل نموده‌اند، و آن علم انبیا و رسولان و اولی العلم از اهل الله است. و با افکار خود از جایگاهشان تجاوز نکردند و دانستند که نهایت ادراک صحیحشان، به زعم خود، این است که دلایل خود را بر امور حسی و بدیهی بنا کنند. و حال آنکه ابتدا به غلط بودن حس در چیزهایی حکم کرده‌اند و در بدیهیات قدح نموده‌اند، سپس بازگشته‌اند و آن‌ها را به عنوان مصادره (فرض مسلم) می‌گیرند، به دلیل دشواری دلالت بر آن‌ها. پس بازگشت به خداوند در همه امور اولی است، چنانکه فرمود: وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (و همه امور به سوی او بازگردانده می‌شود). و این از جمله امر است. پس علمی نیست مگر علمی که از خداوند گرفته شود، زیرا اوست عالم سبحانه و وحده، و معلمی که هیچ شبهه‌ای در آنچه متعلم از او می‌گیرد، وارد نمی‌شود. و ما مقلدان او هستیم و حق نزد اوست. پس ما در تقلیدمان از او در آنچه به ما آموخته، سزاوارتر به نام علما هستیم تا اصحاب نظر فکری که از آنچه به آن‌ها داده، تقلید کرده‌اند. ناگزیر آن‌ها لَا يَزَالُونَ مُخْتَلِفِينَ (همواره در اختلاف هستند) در علم به خداوند، در حالی که انبیا با کثرتشان و دوری اعصار میانشان، اختلافی در علم به خداوند ندارند، زیرا آن را از خداوند گرفته‌اند. و همچنین اهل الله و خواص او. پس متأخر، متقدم را تصدیق می‌کند و یکدیگر را تقویت می‌کنند. و اگر جز این نبود، کافی بود و اخذ از آن‌ها واجب می‌شد. و این باب، یعنی باب توحید، از یک جهت مناسبت (المناسبة) را می‌دهد، و گروهی از اهل الله مانند ابوحامد و دیگر مشایخ ما به آن قائل شده‌اند. و از جهتی مناسبت را نمی‌دهد، و گروهی از اصحاب ما مانند ابوالعباس بن العریف صنهاجی به آن قائل شده و مناسبت را به کلی نفی کرده‌اند. و آنچه من به آن می‌روم و بر آن می‌گویم، بر اساس آنچه قبلاً اصل قرار دادیم، این است که در علم خود به خداوند و غیر خداوند، جز از خداوند تقلید نکنیم. پس ما بر اساس آنچه در حق خود به ما القا می‌کند، عمل می‌کنیم. اگر با مناسبت ما را خطاب کرد، در همان جایی که خطاب کرده، به آن قائل می‌شویم و از آن موضع تجاوز نمی‌کنیم و به آن اکتفا می‌کنیم. و اگر با رفع مناسبت ما را خطاب کرد، آن را در همان موطنی که رفع کرده، رفع می‌کنیم و از آن تجاوز نمی‌کنیم. پس حکم برای اوست نه برای ما. پس همواره به صواب می‌رسیم و هرگز خطا نمی‌کنیم. و این همان است که در حق انبیا علیهم السلام به عصمت و در حق اولیا به حفظ تعبیر می‌شود. و هرگاه از جانب خداوند خبری نباشد، اگر اصابت (رسیدن به حق) از او حاصل شود، نسبت به او اتفاقی است و نسبت به حق (الحق) مقصود است. این همان چیزی است که ما بر آن اعتماد می‌کنیم. قول خداوند: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (هیچ چیز مانند او نیست)، با اضافه کاف (کمثله)، رفع مناسبت شیئیت است. و ادامه آیه: وَهُوَ السَّمِيعُ الْبَصِيرُ (و او شنوای بیناست)، اثبات مناسبت است. و آیه یکی است و کلمات متفاوت. پس از این راه روشن روی نمی‌گردانیم، زیرا قوی‌ترین حجت است و همان است که ما به آن رفته‌ایم، یعنی تقلید از حق (الحق)، زیرا آن راه علم و نجات در دنیا و آخرت است و راه پیامبران و رسولان و قائلان به فیض از الهیون است. پس هرگاه علمی از خداوند به تو رسید، آن را در ترازوی فکر وارد نکن و برای عقلت راهی به آن قرار مده که در همان ساعت هلاک می‌شوی. زیرا علم الهی در ترازو وارد نمی‌شود، چون او واضع آن است. چگونه واضع آن تحت حکم نایب خود قرار گیرد؟ نایب بر کسی که او را جانشین کرده، حکم نمی‌کند، بلکه بر کسی که بر او جانشین شده، حکم می‌کند. و علم با عقل منافات دارد، زیرا عقل قید است و علم از نشانه حاصل می‌شود. و بهترین نشانه‌ها بر شیء، خود شیء است. و هر نشانه‌ای غیر از آن، اصابت در آن نسبت به ما اتفاقی است. و این مقدار در این باب، بر اساس حکم طریق ما، برای مقصود کافی است. وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند).\n\n(فصل) در وتر (تک)\n\nو آن نوعی از انواع توحید است. بدان که وتر (الوتر) در زبان عربی به معنای طلب انتقام (الثأر) است. احدیت (الأحدية) حق (الحق) به وتر متصف شد، زیرا طلب انتقام می‌کند از احدیتی که برای واحدی بود که دوگانگی را با وجود خود آشکار کرد، و سپس تا بی‌نهایت اعداد افزایش یافت. پس هنگامی که با این ظهور، حکم احدیت را از بین برد، احدیت حق (الحق) به دنبال انتقام احدیت زائل شده‌ای شد که این واحد با وجود خود، عین آن را از بین برده بود. و طلب وحدانیت می‌کند. پس به دلیل این طلب، وتر نامیده شد. این واحد کسی را وکیل کرد تا از جانب او دفاع کند، پس عارف را به زبان حق (الحق) وکیل قرار داد و گفت: ای حاکمِ طالبِ انتقام احدیت، احدیت از بین نرفته است، بلکه این کسی که تو طلبش می‌کنی، دوگانگی و سه گانگی و چهارگانگی و بالاتر را نداده است، زیرا او چیزی را نمی‌دهد که حقیقتش اقتضا نکند. بلکه آنچه به ما دوگانگی را داده، احدیت دوگانگی و احدیت سه گانگی و چهارگانگی است، تا هر جا که عدد برسد. و این برای آن است که اعیان اعداد با آن احدیت خود بر احدیت تو استدلال کنند. پس جز در حق تو و به خاطر تو نکوشیده‌اند، زیرا می‌دانی که اعداد در هستی (الکون) جز از حکم اسماء الهی ظاهر نشده‌اند، زیرا آن‌ها کثرت هستند و با وجود کثرتشان، احدیت برای آن‌ها محقق است. پس این واحد خواست که اعیان اعداد، احدیت اسماء را نادیده نگیرند تا توهم کثرت در جناب خداوند نرود. پس در هر عددی، احدیت آن عدد را عطا کرد، از روی غیرت نسبت به وجود کثرتی که عین احدیت و وحدت را از بین می‌برد. پس عذر او پذیرفته شد و دانسته شد که او در این کار به اخلاق احدیت حق (الحق) در اقامه احدیت اسماء کثیر متخلق شده است. و اسم وتر به دلیل غیرت بر او جاری شد. فالله وتر يحب الوتر (پس خداوند وتر است و وتر را دوست دارد). و علم به کثرت و اشتراک، ان‌شاءالله در باب بعد از این خواهد آمد.\n\n(فصل) در فرد\n\nو اما فرد (الفرد)، از حکم این باب است و به دلیل انفرادش به آنچه با آن از خلق خود متمایز می‌شود، به این نام خوانده می‌شود. پس او از حیث واحد بودن، فرد نیست، زیرا او برای خود واحد است، و فرد است به دلیل تمایزش از احدیت هر چیز. و فرد برای غیر او سبحانه صحیح نیست، زیرا هر آنچه غیر خداست، در آن اشتراک برخی با برخی دیگر وجود دارد و با احدیت خود متمایز می‌شود، اما منفرد نمی‌گردد، زیرا صفت اشتراک مانع از آن است. پس اسم فرد (الفرد) بر حقیقت جز برای خداوند حق (الحق) خاصه صحیح نیست، زیرا او فرد از جمیع وجوه است، چون صفت اشتراکی مانند آنچه برای سایر موجودات است، برای او نیست. به همین دلیل موجودات حدود (الحدود) را می‌طلبند، در حالی که خداوند را حدی نمی‌طلبد و مثلی و ضدی با او مقابله نمی‌کند. خداوند متعال است. و تمام اسماء او فردیت دارند، زیرا آن‌ها برای او نسبت‌هایی هستند نه اعیان. پس حد، آن اسم را در بر می‌گیرد اگر بر حادث دلالت کند، اما اگر خداوند متعال به آن نامیده شود، حد آن را در بر نمی‌گیرد. پس لفظ را حد می‌زنی و مدلول آن را حد نمی‌زنی، مگر اینکه مدلول آن حادث باشد و نه غیر آن. و از اشتراک در لفظ، اشتراک در معنا لازم نمی‌آید، زیرا لفظ برای توست نه برای او، و تو در خود مشترک هستی. به همین دلیل گفته شده است: لفظ اشتراک است. آیا نمی‌بینی الفاظ مشترک مانند «مشتری» را؟ اشتراک جز در اطلاق اسم نیست. به همین دلیل هنگامی که صاحب آن به حد (تعریف) مطالبه می‌شود، تفصیل واقع می‌گردد و گفته می‌شود: کدام مشتری را می‌خواهی؟ مشتری که ستاره‌ای در آسمان است یا مشتری که عقدکننده بیع است؟ پس هنگامی که حد زده شود، هر عین از دیگری متمایز می‌شود. پس در لفظ، چیزی از ماهیت مدلول وجود ندارد. با این بیان، ما در حق (الحق) می‌گوییم: سمیع (شنوا) و بصیر (بینا) است و برای او دست و دو دست یا دست‌ها و چشم‌ها و پا هست و هر آنچه را که بر خود اطلاق کرده و عقل نمی‌تواند آن را بر او اطلاق کند، زیرا عقل آن اطلاق را جز بر محدثات (مخلوقات) نمی‌داند. و اگر شریعت و اخبار نبوی الهی آن‌ها را نیاورده بودند، ما عقلاً آن‌ها را بر او اطلاق نمی‌کردیم. با این حال، ما تشبیه را نفی می‌کنیم و به امر خاصی نمی‌پردازیم، به دلیل جهل ما به ذات او. و ما تشبیه را با قول او: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (هیچ چیز مانند او نیست) نفی کردیم، نه با آنچه دلیل عقلی داده است، تا بر او جز کلام خودش حکم نکنیم. و با این (اعتقاد) دوست داریم او را ملاقات کنیم، هنگامی که او را ملاقات کنیم و پرده کوری از بصیرت‌ها و دیدگان ما برداشته شود، اگر کشف مطلقاً ممکن باشد، یا آن مقدار که کشف آن ممکن است، برداشته شود، یا بر تساوی در حق همه یا بر تفاضل در حق بندگان، به طوری که هر شخص به رؤیتی منفرد شود که برای دیگری نباشد. و کشف (الکشف) در علم توحید جز نزد کسی که قائل به مناسبت (المناسبة) است، صحیح نیست، و نزد کسی که قائل به نفی مناسبت است، صحیح نیست، زیرا توحید امری وجودی نیست، بلکه نسبتی است و نسبت‌ها با کشف درک نمی‌شوند، بلکه از طریق دلیل دانسته می‌شوند. زیرا کشف، رؤیت است و رؤیت به مرئی جز با کیفیاتی که مرئی بر آن‌هاست، تعلق نمی‌گیرد. و آیا در آن جناب الهی کیفیت هست یا نه؟ دلیل کیفیت را نفی می‌کند. اگر منظورش این است که در ذات او کیفیتی نیست، پس کشف نمی‌شود. و اگر منظورش این است که کیفیت او تعقل نمی‌شود، ممکن است کشف شود از آن حیث که او کیفیتی دارد که تعقل نمی‌شود، اما علم به آن هنگام کشف حاصل می‌شود. زیرا هر کیفیتی که عقل از نظر در اشیا به دست آورده، نزد او بر خداوند محال است، با وجود ثبوت ایمان به اسم‌های آن‌ها، نه به معقولیت آن‌ها، مانند نزول، استواء، معیت، زیر و رو کردن، تردد، خنده، تعجب، رضایت و غضب. زیرا خداوند این معانی را در حضرت تمثیل، مانند علم در صورت شیر، جسمیت بخشیده است. پس آن برای اوست و در آن هنگام با کشف به دست می‌آید، وگرنه هرگز به دست نمی‌آید. و دانسته نمی‌شود که نبوت آن را از کجا گرفته است، آیا آن را به صورت خبر دریافت کرده یا کشف؟ اگر خبر باشد، تساوی واقع شده است. و اگر از کشف باشد، بر اساس آنچه ذکر کردیم است. وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}