{
  "id": 4,
  "title": {
    "ar": "الباب الرابع في سبب بدء العالم ومراتب الأسماء الحسنى من العالم كله",
    "en": "The Fourth Chapter: Concerning the Cause of the Beginning of the World (العالم) and the Levels (المراتب) of the Beautiful Names (الأسماء الحسنى) in relation to the Entirety of the Cosmos.",
    "ur": "چوتھا باب: عالم کے آغاز کے سبب اور تمام عالم سے اسماء حسنیٰ کے مراتب کے بیان میں",
    "fa": "باب چهارم در سبب آغاز عالم و مراتب اسماء حسنای الهی از کل عالم"
  },
  "content": {
    "ar": "## «الباب الرابع في سبب بدء العالم ومراتب الأسماء الحسنى من العالم كله»\n\n\n> في سبب البدء وأحكامه *** وغاية الصنع وإحكامه‏\n\n\n> والفرق ما بين رعاة العلى *** في نشئه وبين حكامه‏\n\n\n> دلائل دلت على صانع *** قد قهر الكل بأحكامه‏\n\n\n### [خواص المكان وإحساس الجنان‏]\n\n\nقد وقف الصفي الولي أبقاه الله على سبب بدء العالم في كتابنا المسمى بعنقاء مغرب في معرفة ختم الأولياء وشمس المغرب وفي كتابنا المسمى بإنشاء الدوائر الذي ألفنا بعضه بمنزله الكريم في وقت زيارتنا إياه سنة ثمان وتسعين وخمسمائة ونحن نريد الحج فقيد له منه خديمه عبد الجبار أعلى الله قدره القدر الذي كنت سطرته منه ورحلت به معي إلى مكة زادها الله تشريفا في السنة المذكورة لأتممه بها فشغلنا هذا الكتاب عنه وعن غيره بسبب الأمر الإلهي الذي ورد علينا في تقييده مع رغبة بعض الإخوان والفقراء في ذلك حرصا منهم على مزيد العلم ورغبة في أن تعود عليهم بركات هذا البيت المبارك الشريف محل البركات والهدى والآيات البينات وأن نعرف أيضا في هذا الموضوع الصفي الكريم أبا محمد عبد العزيز رضي الله عنه ما تعطيه مكة من البركات وإنها خير وسيلة عبادية وأشرف منزلة جمادية ترابية عسى تنهض به همة الشوق إليه وتنزل به رغبة عليه فقد قيل لمن أوتي جوامع الكلم وكان من ربه في مشاهدة العين أدنى من قاب قوسين ومع هذا التقريب الأكمل والحظ الأوفر الأجزل أنزل عليه وقُلْ رَبِّ زِدْنِي عِلْماً ومن شرط العالم المشاهد صاحب المقامات الغيبية والمشاهد أن يعلم أن للامكنة في القلوب اللطيفة تأثيرا ولو وجد القلب في أي موضع كان الوجود الأعم‏\nفوجوده بمكة أسنى وأتم فكما تتفاضل المنازل الروحانية كذلك تتفاضل المنازل الجسمانية وإلا فهل الدر مثل الحجر إلا عند صاحب الحال وأما المكمل صاحب المقام فإنه يميز بينهما كما ميز بينهما الحق هل ساوى الحق بين دار بناؤها لبن التراب والتبن ودار بناؤها لبن العسجد واللجين فالحكيم الواصل من أعطى كل ذي حق حقه فذلك واحد عصره وصاحب وقته وكثير بين مدينة يكون أكثر عمارتها الشهوات وبين مدينة يكون أكثر عمارتها الآيات البينات أ ليس قد جمع معي صفي أبقاه الله أن وجود قلوبنا في بعض المواطن أكثر من بعض وقد كان رضي الله عنه يترك الخلوة في بيوت المنارة المحروسة الكائنة بشرقي تونس بساحل البحر وينزل إلى الرابطة التي في وسط المقابر بقرب المنارة من جهة بابها وهي تعزى إلى الخضر فسألته عن ذلك فقال إن قلبي أجده هنالك أكثر منه في المنارة وقد وجدت فيها أنا أيضا ما قاله الشيخ وقد علم وليي أبقاه الله أن ذلك من أجل من يعمر ذلك الموضع إما في الحال من الملائكة المكرمين أو من الجن الصادقين وإما من همة من كان يعمره وفقد كبيت أبي يزيد الذي يسمى بيت الأبرار وكزاوية الجنيد بالشونيزية وكمغارة ابن أدهم باليقين وما كان من أماكن الصالحين الذين فنوا عن هذه الدار وبقيت آثارهم في أماكنهم تنفعل لها القلوب اللطيفة ولهذا يرجع تفاضل المساجد في وجود القلب لا في تضاعف الأجر فقد تجد قلبك في مسجد أكثر مما تجده في غيره من المساجد وذلك ليس للتراب ولكن لمجالسة الأتراب أو هممهم ومن لا يجد الفرق في وجود قلبه بين السوق والمساجد فهو صاحب حال لا صاحب مقام ولا أشك كشفا وعلما أنه وإن عمرت الملائكة جميع الأرض مع تفاضلهم في المعارف والرتب فإن أعلاهم رتبة وأعظمهم علما ومعرفة عمرة المسجد الحرام وعلى قدر جلساتك يكون وجودك فإنه لهمم الجلساء في قلب الجليس لهم تأثيرا وهممهم على قدر مراتبهم وإن كان من جهة الهمم فقد طاف بهذا البيت مائة ألف نبي وأربعة وعشرون ألف نبي سوى الأولياء وما من نبي ولا ولي إلا وله همة متعلقة بهذا البيت وهذا البلد الحرام لأنه البيت الذي اصطفاه الله على سائر البيوت وله سر الأولية في المعابد كما قال تعالى إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبارَكاً وهُدىً لِلْعالَمِينَ فِيهِ آياتٌ بَيِّناتٌ مَقامُ إِبْراهِيمَ ومن دَخَلَهُ كانَ آمِناً من كل مخوف إلى غير ذلك من الآيات فلو رحل الصفي أبقاه الله إلى هذا البلد الحرام الشريف لوجد من المعارف والزيادات ما لم يكن رآه قبل ذلك ولا خطر له بالبال وقد علم رضي الله عنه إن النفس تحشر على صورة علمها والجسم على صورة عمله وصورة العلم والعمل بمكة أتم مما في سواها ولو دخلها صاحب قلب ساعة واحدة لكان له ذلك فكيف إن جاور بها وأقام وأتى فيها بجميع الفرائض والقواعد فلا شك أن مشهده بها يكون أتم وأجلي ومورده أصفى وأعذب وأحلى وإذ وصفيي أبقاه الله قد أخبرني أنه يحس بالزيادة والنقص على حسب الأماكن والأمزجة ويعلم أن ذلك راجع أيضا إلى حقيقة الساكن به أو همته كما ذكرنا ولا شك عندنا إن معرفة هذا الفن أعني معرفة الأماكن والإحساس بالزيادة والنقص من تمام تمكن معرفة العارف وعلو مقامه وإشرافه على الأشياء وقوة ميزه فالله يكتب لوليي فيها أثرا حسنا ويهبه فيها خيرا طيبا إنه الملي بذلك والقادر عليه‏\n\n\n### [الأسماء الإلهية والحقائق الوجودية]\n\n\nاعلم وفقنا الله وإياك وجميع المسلمين أن أكثر العلماء بالله من أهل الكشف والحقائق ليس عندهم علم بسبب بدء العالم إلا تعلق العلم القديم بإيجاده فكون ما علم أنه سيكونه وهنا ينتهي أكثر الناس وأما نحن ومن أطلعه الله على ما أطلعنا عليه فقد وقفنا على أمور أخر غير هذا وذلك أنك إذا نظرت العالم مفصلا بحقائقه ونسبه وجدته محصور الحقائق والنسب معلوم المنازل والرتب متناهى الأجناس بين متماثل ومختلف فإذا وقفت على هذا الأمر علمت إن لهذا سرا لطيفا وأمرا عجيبا لا تدرك حقيقته بدقيق فكر ولا نظر بل بعلم موهوب من علوم الكشف ونتائج المجاهدات المصاحبة للهمم فإن مجاهدة بغير همة غير منتجة شيئا ولا مؤثرة في العلم ولكن تؤثر في الحال من رقة وصفاء يجده صاحب المجاهدة فاعلم علمك الله سرائر الحكم ووهبك من جوامع الكلم أن الأسماء الحسنى التي تبلغ فوق أسماء الإحصاء عددا وتنزل دون أسماء الإحصاء سعادة هي المؤثرة في هذا العالم وهي المفاتح الأول التي لا يَعْلَمُها إِلَّا هُوَ وأن لكل حقيقة اسما ما يخصها من الأسماء وأعني بالحقيقة حقيقة تجمع جنسا من الحقائق رب تلك الحقيقة ذلك الاسم وتلك الحقيقة عابدته وتحت تكليفه ليس غير ذلك وإن جمع لك شي‏ء ما أشياء كثيرة فليس الأمر على ما توهمته فإنك إن نظرت إلى‏\nذلك الشي‏ء وجدت له من الوجوه ما يقابل به تلك الأسماء التي تدل عليها وهي الحقائق التي ذكرناها مثال ذلك ما ثبت لك في العلم الذي في ظاهر العقول وتحت حكمها في حق موجود ما فرد لا ينقسم مثل الجوهر الفرد الجزء الذي لا ينقسم فإن فيه حقائق متعددة تطلب أسماء إلهية على عددها فحقيقة إيجاده يطلب الاسم القادر ووجه إحكامه يطلب الاسم العالم ووجه اختصاصه يطلب الاسم المريد ووجه ظهوره يطلب الاسم البصير والرائي إلى غير ذلك فهذا وإن كان فردا فله هذه الوجوه وغيرها مما لم نذكرها ولكل وجه وجوه متعددة تطلب من الأسماء بحسبها وتلك الوجوه هي الحقائق عندنا الثواني والوقوف عليها عسير وتحصيلها من طريق الكشف أعسر\n\n\n### [أمهات الأسماء الإلهية]\n\n\nواعلم أن الأسماء قد نتركها على كثرتها إذا لحظنا وجوه الطالبين لها من العالم وإذا لم نلحظ ذلك فلنرجع ونلحظ أمهات المطالب التي لا غنى لنا عنها فنعرف إن الأسماء التي الأمهات موقوفة عليها هي أيضا أمهات الأسماء فيسهل النظر ويكمل الغرض ويتيسر التعدي من هذه الأمهات إلى البنات كما يتيسر رد البنات إلى الأمهات فإذا نظرت الأشياء كلها المعلومة في العالم العلوي والسفلي تجد الأسماء السبعة المعبر عنها بالصفات عند أصحاب علم الكلام تتضمنها وقد ذكرنا هذا في كتابنا الذي سميناه إنشاء الدوائر وليس غرضنا في هذا الكتاب في هذه الأمهات السبعة المعبر عنها بالصفات ولكن قصدنا الأمهات التي لا بد لإيجاد العالم منها كما إنا لا نحتاج في دلائل العقول من معرفة الحق سبحانه إلا كونه موجودا عالما مريدا قادرا حيا لا غير وما زاد على هذا فإنما يقتضيه التكليف فمجي‏ء الرسول عليه السلام جعلنا نعرفه متكلما والتكليف جعلنا نعرفه سميعا بصيرا إلى غير ذلك من الأسماء فالذي نحتاج إليه من معرفة الأسماء لوجود العالم وهي أرباب الأسماء وما عداها فسدنة لها كما إن بعض هذه الأرباب سدنة لبعضها فأمهات الأسماء الحي العالم المريد القادر القائل الجواد المقسط وهذه الأسماء بنات الاسمين المدبر والمفصل فالحي يثبت فهمك بعد وجودك وقبله والعالم يثبت أحكامك في وجودك وقبل وجودك يثبت تقديرك والمريد يثبت اختصاصك والقادر يثبت عدمك والقائل يثبت قدمك والجواد يثبت إيجادك والمقسط يثبت مرتبتك والمرتبة آخر منازل الوجود فهذه حقائق لا بد من وجودها فلا بد من أسمائها التي هي أربابها فالحي رب الأرباب والمربوبين وهو الإمام ويليه في الرتبة العالم ويلي العالم المريد ويلي المريد القائل ويلي القائل القادر ويلي القادر الجواد وآخرهم المقسط فإنه رب المراتب وهي آخر منازل الوجود وما بقي من الأسماء فتحت طاعة هؤلاء الأسماء الأئمة الأرباب‏\n\n\n### [أئمة الأسماء الإلهية]\n\n\nوكان سبب توجه هؤلاء الأسماء إلى الاسم الله في إيجاد العالم بقية الأسماء مع حقائقها أيضا على إن أئمة الأسماء من غير نظر إلى العالم إنما هي أربعة لا غير اسمه الحي والمتكلم والسميع والبصير فإنه إذا سمع كلامه ورأى ذاته فقد كمل وجوده في ذاته من غير نظر إلى العالم ونحن لا نريد من الأسماء إلا ما يقوم بها وجود العالم فكثرت علينا الأسماء فعدلنا إلى أربابها فدخلنا عليهم في حضراتهم فما وجدنا غير هؤلاء الذين ذكرناهم وأبرزناهم على حسب ما شاهدناهم فكان سبب توجه أرباب الأسماء إلى الاسم الله في إيجاد أعياننا بقية الأسماء فأول من قام لطلب هذا العالم الاسم المدبر والمفصل عن سؤال الاسم الملك فعند ما توجه على الشي‏ء عنه وجد المثال في نفس العالم من غير عدم متقدم ولكن تقدم مرتبة لا تقدم وجود كتقدم طلوع الشمس على أول النهار وإن كان أول النهار مقارنا لطلوع الشمس ولكن قد تبين أن العلة في وجود أول النهار طلوع الشمس وقد قارنه في الوجود فهكذا هو هذا الأمر فلما دبر العالم وفصله هذان الاسمان من غير جهل متقدم به أو عدم علم وانتشأت صورة المثال في نفس العالم تعلق اسمه العالم إذ ذاك بذلك المثال كما تعلق بالصورة التي أخذ منها وإن كانت غير مرئية لأنها غير موجودة كما سنذكره في باب مم وجد العالم‏\n\n\n### [أول أسماء العالم‏]\n\n\nفأول أسماء العالم هذان الاسمان والاسم المدبر هو الذي حقق وقت الإيجاد المقدر فتعلق به المريد على حد ما أبرزه المدبر ودبره وما عملا شيئا من نش‏ء هذا المثال إلا بمشاركة بقية الأسماء لكن من وراء حجاب هذين الاسمين ولهذا صحت لهما الإمامة والآخرون لا يشعرون بذلك حتى بدت صورة المثال فرأوا ما فيه من الحقائق المناسبة لهم تجذبهم للتعشق بها فصار كل اسم يتعشق بحقيقته التي في المثال ولكن لا يقدر على التأثير فيها إذ لا تعطي الحضرة التي تجلى فيها هذا المثال فأداهم ذلك التعشق والحب إلى الطلب والسعي والرغبة في إيجاد صورة عين ذلك المثال ليظهر سلطانهم ويصح على الحقيقة وجودهم‏\nفلا شي‏ء أعظم هما من عزيز لا يجد عزيزا يقهره حتى يذل تحت قهره فيصح سلطان عزه أو غني لا يجد من يفتقر إلى غناه وهكذا جميع هذه الأسماء فلجأت إلى أربابها الأئمة السبعة التي ذكرناها ترغب إليها في إيجاد عين هذا المثال الذي شاهدوه في ذات العالم به وهو المعبر عنه بالعالم‏\n\n\n### [الأسماء الإلهية متحدة من حيث الذات مختلفة من حيث التعلقات‏]\n\n\nوربما يقول القائل يا أيها المحقق وكيف ترى الأسماء هذا المثال ولا يراه إلا الاسم البصير خاصة لا غيره وكل اسم على حقيقة ليس الاسم الآخر عليها قلنا له لتعلم وفقك الله أن كل اسم إلهي يتضمن جميع الأسماء كلها وأن كل اسم ينعت بجميع الأسماء في أفقه فكل اسم فهو حي قادر سميع بصير متكلم في أفقه وفي علمه وإلا فكيف يصح أن يكون ربا لعابده هيهات غير إن ثم لطيفة لا يشعر بها وذلك أنك تعلم قطعا في حبوب البر وأمثاله إن كل برة فيها من الحقائق ما في أختها كما تعلم أيضا أن هذه الحبة ليست عين هذه الحبة الأخرى وإن كانتا تحويان على حقائق متماثلة فإنهما مثلان فابحث عن هذه الحقيقة التي تجعلك تفرق بين هاتين الحبتين وتقول إن هذه ليست عين هذه وهذا سار في جميع المتماثلات من حيث ما تماثلوا به كذلك الأسماء كل اسم جامع لما جمعت الأسماء من الحقائق ثم تعلم على القطع أن هذا الاسم ليس هو هذا الآخر بتلك اللطيفة التي بها فرقت بين حبوب البر وكل متماثل فابحث عن هذا المعنى حتى تعرفه بالذكر لا بالفكر غير أني أريد أن أوقفك على حقيقة ما ذكرها أحد من المتقدمين وربما ما أطلع عليها فربما خصصت بها ولا أدري هل تعطي لغيري بعدي أم لا من الحضرة التي أعطيتها فإن استقرأها أو فهمها من كتابي فأنا المعلم له وأما المتقدمون فلم يجدوها وذلك أن كل اسم كما قررنا يجمع حقائق الأسماء ويحتوي عليها مع وجود اللطيفة التي وقع لك التمييز بها بين المثلين وذلك أن الاسم المنعم والاسم المعذب اللذين هما الظاهر والباطن كل اسم من هذين الاسمين يتضمن ما تحويه سدنته من أولهم إلى آخرهم غير إن أرباب الأسماء ومن سواهم من الأسماء على ثلاث مراتب منها ما يلحق بدرجات أرباب الأسماء ومنها ما ينفرد بدرجة فمنها ما ينفرد بدرجة المنعم وبدرجة المعذب فهذه أسماء العالم محصورة والله المستعان‏\n\n\n### [اسم الله الأعظم‏]\n\n\nفلما لجأت الأسماء كلها إلى هؤلاء الأئمة ولجأت الأئمة إلى الاسم الله لجأ الاسم الله إلى الذات من حيث غناها عن الأسماء سائلا في إسعاف ما سألته الأسماء فيه فأنعم المحسان الجواد بذلك وقال قل للأئمة يتعلقون بإبراز العالم على حسب ما تعطيه حقائقهم فخرج إليهم الاسم الله وأخبرهم الخبر فانقلبوا مسرعين فرحين مبتهجين ولم يزالوا كذلك فنظروا إلى الحضرة التي أذكرها في الباب السادس من هذا الكتاب فأوجدوا العالم كما سنذكره فيما يأتي من الأبواب بعد هذا إن شاء الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## The Fourth Chapter: Concerning the Cause of the World’s Beginning and the Levels of the Beautiful Names (الأسماء الحسنى) Relative to the Entire Cosmos\n\nConcerning the cause of the beginning and its rulings,\nAnd the purpose of creation and its perfection.\nAnd the difference between the shepherds of the high stations\nIn its origination and between its rulers.\nProofs that point to a Maker\nWho has subdued all things by His rulings.\n\n### [Properties of Place and the Feeling of the Heart]\n\nThe Pure Friend (الصفي الولي)—may Allah preserve him—has already been informed of the cause of the world’s beginning in our book titled *Anqa’ Mughrib* (The Gryphon of the West) concerning the knowledge of the Seal of the Saints and the Sun of the West, and in our book titled *Insha’ al-Dawa’ir* (The Production of the Circles), part of which we composed in his noble dwelling during our visit to him in the year 598 AH, when we intended to perform the Hajj. His servant, Abd al-Jabbar—may Allah exalt his rank—recorded for him the portion I had written of it, and I traveled with it to Mecca—may Allah increase its honor—in the aforementioned year to complete it there. However, this book distracted us from it and from others, due to the Divine Command that came to us regarding its inscription, coupled with the desire of some brethren and poor ones (فقراء) for increased knowledge, and their hope that the blessings of this noble, blessed House (البيت المبارك), the locus of blessings, guidance, and clear signs (الآيات البينات), would return to them. We also wish to inform the noble Pure Friend, Abu Muhammad Abd al-Aziz—may Allah be pleased with him—in this context, of the blessings that Mecca bestows, and that it is the best means of worship and the most noble terrestrial, earthly station (منزلة جمادية ترابية). Perhaps this will raise his aspiration (همة) of longing for it and bring down his desire upon it. For it was said to him who was given comprehensive words (جوامع الكلم) and was, in the witnessing of the Eye, nearer to his Lord than two bow-lengths (قاب قوسين), and despite this most perfect proximity and most abundant, greatest portion, the command descended upon him: <<وَقُلْ رَبِّ زِدْنِي عِلْماً>> (And say: ‘My Lord, increase me in knowledge’).\n\nIt is a condition of the witnessing scholar, the possessor of unseen stations (المقامات الغيبية) and spiritual witnessings (المشاهد), that he knows that places have an effect on subtle hearts (القلوب اللطيفة). Even if the heart finds existence in any place whatsoever—that is, general existence (الوجود الأعم)—its existence in Mecca is more sublime and complete. Just as spiritual stations (المنازل الروحانية) differ in excellence, so too do physical stations (المنازل الجسمانية). Otherwise, is a pearl like a stone, except in the view of the possessor of a state (صاحب الحال)? As for the perfected one, the possessor of a station (صاحب المقام), he distinguishes between them just as The Real (الحق) distinguished between them. Did The Real equate a dwelling whose bricks are of dust and straw with a dwelling whose bricks are of gold and silver? The wise, realized one (الحكيم الواصل) is he who gives every possessor of a right his due. Such a one is the unique individual of his age and the master of his time. There is a great difference between a city whose construction is mostly based on desires and a city whose construction is mostly based on clear signs.\n\nDid not my Pure Friend—may Allah preserve him—agree with me that the existence of our hearts is greater in some places than in others? He—may Allah be pleased with him—used to leave the spiritual retreat (الخلوة) in the houses of the protected lighthouse located east of Tunis on the coast and descend to the retreat (الرابطة) in the middle of the graves near the lighthouse, on the side of its gate, which is attributed to al-Khidr. I asked him about that, and he said, “I find my heart there more present than in the lighthouse.” I, too, found what the Shaykh said in that place.\n\nMy Friend—may Allah preserve him—knows that this is due to those who inhabit that place, whether they are the noble angels in the present time, or truthful jinn, or due to the spiritual aspiration (همة) of those who used to inhabit it, such as the house of Abu Yazid, called the House of the Righteous (بيت الأبرار), or the corner of Junayd in al-Shuniziyya, or the cave of Ibn Adham in Yaqin, and other places of the righteous who have passed away from this abode, but whose traces remain in their places, affecting subtle hearts. For this reason, the superiority of mosques is due to the presence of the heart, not the multiplication of reward (تضاعف الأجر). You may find your heart more present in one mosque than in others, and this is not due to the dust, but to the companionship of peers or their spiritual aspirations. He who finds no difference in the presence of his heart between the marketplace and the mosques is a possessor of a state (صاحب حال), not a possessor of a station (صاحب مقام).\n\nI have no doubt, through Unveiling (كشف) and Knowledge (علم), that even if the angels inhabit the entire earth—despite their differences in gnosis (معارف) and rank—the highest in rank and the greatest in knowledge and gnosis are those who inhabit the Sacred Mosque (المسجد الحرام). Your presence is commensurate with your sittings, for the aspirations (همم) of the companions have an effect on the heart of the sitter, and their aspirations are according to their ranks. If we consider the aspect of aspirations, one hundred and twenty-four thousand prophets have circumambulated this House, besides the saints. There is no prophet or saint who does not have an aspiration connected to this House and this Sacred Land, because it is the House that Allah chose above all other houses, and it holds the secret of priority among places of worship, as He the Exalted said: <<إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبارَكاً وهُدىً لِلْعالَمِينَ فِيهِ آياتٌ بَيِّناتٌ مَقامُ إِبْراهِيمَ ومن دَخَلَهُ كانَ آمِناً>> (Indeed, the first House [of worship] established for mankind was that at Bakkah [Mecca]—blessed and a guidance for the worlds. In it are clear signs: the station of Abraham. And whoever enters it shall be safe), and other verses besides.\n\nIf the Pure Friend—may Allah preserve him—were to travel to this noble Sacred Land, he would find gnosis and spiritual increases that he had not seen before, nor had they crossed his mind. He knows—may Allah be pleased with him—that the soul is resurrected in the form of its knowledge, and the body in the form of its action. The form of knowledge and action in Mecca is more complete than anywhere else. If the possessor of a heart were to enter it for a single hour, that would suffice him; so what if he resides there, stays there, and performs all the obligatory duties and principles there? There is no doubt that his witnessing (مشهده) there would be more complete and manifest, and his source (مورده) purer, sweeter, and more delightful.\n\nSince my Friend—may Allah preserve him—has informed me that he senses increase and decrease according to places and temperaments, and he knows that this also relates to the reality of the inhabitant or his aspiration, as we mentioned, we have no doubt that the knowledge of this art—meaning the knowledge of places and the sensing of increase and decrease—is part of the perfection of the gnostic’s (العارف) established knowledge, the loftiness of his station, his oversight of things, and the strength of his discernment. May Allah decree for my Friend a good effect therein and grant him pure goodness therein, for He is capable of that and has the power over it.\n\n### [The Divine Names and Existential Realities]\n\nKnow—may Allah grant success to us, you, and all Muslims—that most scholars of Allah among the people of Unveiling (الكشف) and Realities (الحقائق) have no knowledge concerning the cause of the world’s beginning, except that Ancient Knowledge (العلم القديم) attached itself to its creation, so that what He knew would exist came into being. This is where most people stop.\n\nAs for us, and those whom Allah has informed of what He has informed us, we have come to know other matters besides this. This is because if you look at the world detailed by its realities and relations, you will find it confined in its Realities and relations, known in its stations and ranks, and finite in its genera, whether similar or different. If you grasp this matter, you will know that it holds a subtle secret and a wondrous affair whose reality cannot be grasped by subtle thought or contemplation, but rather by a gifted knowledge (علم موهوب) from the sciences of Unveiling (الكشف) and the results of spiritual strivings (مجاهدات) accompanied by spiritual aspirations (الهمم). For striving without aspiration yields nothing and has no effect on Knowledge, though it does affect the spiritual state (الحال) with a tenderness and purity that the striver finds.\n\nKnow—may Allah teach you the secrets of wisdom and grant you comprehensive words—that the Beautiful Names (الأسماء الحسنى), which exceed the enumerated Names in number and fall short of the enumerated Names in felicity, are the ones that influence this world. They are the first keys (المفاتح الأول) <<لَا يَعْلَمُهَا إِلَّا هُوَ>> (which none knows but He). Every reality has a Name that is specific to it among the Names. By \"reality,\" I mean a reality that gathers a genus of realities. The Lord (رب) of that reality is that Name, and that reality is its worshipper and under its command, nothing else.\n\nEven if something gathers many things for you, the matter is not as you imagine. If you look at that thing, you will find that it has aspects corresponding to those Names that point to them, which are the realities we mentioned. An example of this is what is established for you in the knowledge that is apparent to the intellects and under their rule, concerning an individual, indivisible existing thing, such as the indivisible atom (الجوهر الفرد). It contains multiple realities that demand Divine Names according to their number. The reality of its creation demands the Name The Powerful (القادر); the aspect of its perfection demands the Name The Knowing (العالم); the aspect of its specification demands the Name The Willing (المريد); and the aspect of its manifestation demands the Name The Seeing and Observing (البصير والرائي), and so on. Thus, even though this is an individual, it possesses these aspects and others that we have not mentioned. Furthermore, every aspect has multiple sub-aspects that demand Names according to them. These sub-aspects are what we call secondary realities (الحقائق الثواني), and grasping them is difficult, while achieving them through the path of Unveiling is even more difficult.\n\n### [The Mother Names of God]\n\nKnow that we may disregard the Names in their multiplicity if we consider the aspects of those in the world who seek them. If we do not consider that, we must return and consider the essential demands (أمهات المطالب) that we cannot do without. We then realize that the Names upon which these essential demands depend are also the Mother Names (أمهات الأسماء). This simplifies contemplation and completes the objective, making it easy to move from these Mothers to the Daughters, just as it is easy to return the Daughters to the Mothers.\n\nIf you look at all the known things in the upper and lower worlds, you will find them encompassed by the seven Names referred to as Attributes (الصفات) by the theologians (أصحاب علم الكلام). We have mentioned this in our book *Insha’ al-Dawa’ir*. However, our purpose in this book is not these seven Mothers referred to as Attributes, but rather the Mothers that are indispensable for the creation of the world. Just as in the rational proofs for knowing The Real—Exalted is He—we only need Him to be Existing, Knowing, Willing, Powerful, and Living, and nothing more. Whatever is added to this is required by the Divine Command (التكليف). The coming of the Messenger—peace be upon him—made us know Him as The Speaker (متكلما), and the Divine Command made us know Him as The Hearing (سميعا) and The Seeing (بصيرا), and so on among the Names.\n\nThe Names we need to know for the existence of the world are the Lords of the Names (أرباب الأسماء), and all others are custodians (سدنة) for them, just as some of these Lords are custodians for others.\n\nThe Mother Names are: The Living (الحي), The Knowing (العالم), The Willing (المريد), The Powerful (القادر), The Speaker (القائل), The Generous (الجواد), and The Equitable (المقسط). These Names are the daughters of the two Names: The Director (المدبر) and The Detailer (المفصل).\n\nThe Living establishes your understanding after your existence and before it. The Knowing establishes your rulings in your existence, and before your existence, it establishes your predestination. The Willing establishes your specification. The Powerful establishes your non-existence. The Speaker establishes your eternity. The Generous establishes your creation. The Equitable establishes your level (مرتبتك), and the Level is the last station of Existence.\n\nThese realities must exist, so their Names, which are their Lords, must exist. The Living is the Lord of Lords and the Lord of the created (المربوبين), and He is the Imam (Leader). He is followed in rank by The Knowing, then The Willing, then The Speaker, then The Powerful, then The Generous, and the last of them is The Equitable, for He is the Lord of the Levels (المراتب), which are the last stations of Existence. All remaining Names are under the obedience of these Imams, the Lords of the Names.\n\n### [The Imams of the Divine Names]\n\nThe reason for the turning of these Names toward the Name Allah in the creation of the world was the rest of the Names, along with their realities. However, the Imams of the Names, without considering the world, are only four: His Name The Living (الحي), The Speaker (المتكلم), The Hearing (السميع), and The Seeing (البصير). For when He hears His speech and sees His Essence (ذاته), His existence in His Essence is complete, without regard to the world.\n\nWe, however, only seek the Names by which the existence of the world is established. Thus, the Names multiplied for us, so we turned to their Lords and entered their Presences (حضراتهم). We found none other than those we mentioned and brought forth according to what we witnessed.\n\nThe reason for the turning of the Lords of the Names toward the Name Allah in the creation of our Fixed Entities (أعياننا) was the rest of the Names. The first to rise to request this world were the Names The Director (المدبر) and The Detailer (المفصل), following the request of the Name The King (الملك). When the matter turned toward the thing, the archetype (المثال) was found in the soul of the cosmos (نفس العالم), without any prior non-existence, but rather a precedence of rank, not a precedence of existence—like the precedence of the sun’s rising over the beginning of the day, even though the beginning of the day is simultaneous with the sun’s rising. Yet, it is clear that the cause of the beginning of the day is the sun’s rising, even though it coincided with it in existence. This is how this matter is.\n\nWhen these two Names directed and detailed the world—without any prior ignorance of it or lack of knowledge—and the form of the archetype arose in the soul of the cosmos, His Name The Knowing (العالم) then attached itself to that archetype, just as it attached itself to the form from which it was taken, even though that form was unseen because it was non-existent, as we shall mention in the chapter concerning the source from which the world came into existence.\n\n### [The First Names of the World]\n\nThe first Names of the world are these two Names. The Name The Director (المدبر) is the one that actualized the predetermined time of creation. The Willing (المريد) attached itself to it according to what The Director brought forth and directed. They did nothing in the origination of this archetype except with the participation of the rest of the Names, but from behind the veil (من وراء حجاب) of these two Names. For this reason, the leadership (الإمامة) was established for them, and the others were unaware of it until the form of the archetype appeared. They then saw the realities within it that were suitable for them, drawing them to be passionately attached (التعشق) to them. Thus, every Name became passionately attached to its reality within the archetype, but it could not influence it, as the Presence (الحضرة) in which this archetype manifested did not permit it.\n\nThis passionate attachment and love led them to seek and strive for the creation of the physical form of that archetype, so that their sovereignty (سلطانهم) might appear and their existence might be truly established. Nothing is more concerned than a mighty one who finds no mighty one to subdue, so that he may be humbled under his subjugation, thereby establishing the sovereignty of his might; or a rich one who finds no one poor enough to be in need of his wealth. This is the case for all these Names. So they resorted to their Lords, the seven Imams we mentioned, desiring them to bring into existence the physical form of this archetype that they witnessed in the Essence of the cosmos, which is referred to as the World (العالم).\n\n### [The Divine Names are United in Essence, Different in Relation]\n\nPerhaps someone might say: “O Verifier, how can the Names see this archetype when only the Name The Seeing (البصير) sees, and every Name is based on a reality that is not the reality of the other Name?”\n\nWe say to him: Know—may Allah grant you success—that every Divine Name encompasses all the Names, and every Name is described by all the Names in its own sphere (أفقه). Thus, every Name is Living, Powerful, Hearing, Seeing, and Speaking in its own sphere and in its knowledge. Otherwise, how could it rightly be the Lord (رب) of its worshipper? Far be it!\n\nHowever, there is a subtlety here that is not perceived. You know with certainty regarding grains of wheat and their like that every grain contains the same realities as its sister grain. You also know that this grain is not the eye (عين) of the other grain, even though they contain similar realities, for they are two similars. Search for this reality that makes you distinguish between these two grains and say that this one is not the eye of that one. This applies to all similars in terms of the aspect by which they are similar.\n\nLikewise, the Names: every Name gathers the realities that the other Names gather, yet you know with certainty that this Name is not that other Name, due to that subtlety by which you distinguished between the grains of wheat and every similar thing. Search for this meaning until you know it through remembrance (الذكر), not through thought (الفكر).\n\nHowever, I wish to draw your attention to a reality that none of the predecessors mentioned, and perhaps none were informed of it. Perhaps I have been singled out with it, and I do not know whether it will be granted to anyone after me from the Presence (الحضرة) that granted it to me. If someone deduces it or understands it from my book, then I am his teacher. But the predecessors did not find it.\n\nThis reality is that every Name, as we established, gathers and contains the realities of the Names, along with the existence of the subtlety by which you distinguished between the two similars. This is because the Name The Bestower of Blessings (المنعم) and the Name The Punisher (المعذب)—which are The Manifest (الظاهر) and The Hidden (الباطن)—each of these two Names encompasses what its custodians contain, from the first of them to the last. However, the Lords of the Names and the other Names are of three ranks: some join the degrees of the Lords of the Names, and some are singular in degree. Among them are those singular in the degree of The Bestower of Blessings and those singular in the degree of The Punisher. These are the confined Names of the world, and Allah is the Helper.\n\n### [The Greatest Name of God]\n\nWhen all the Names resorted to these Imams, and the Imams resorted to the Name Allah, the Name Allah resorted to the Essence (الذات) from the perspective of Its independence from the Names, asking for the fulfillment of what the Names had requested. The Benefactor, The Generous, granted this and said: “Tell the Imams to attach themselves to the manifestation of the world according to what their realities bestow.”\n\nThe Name Allah went out to them and informed them of the news. They returned quickly, joyful and delighted, and they remained so. They looked toward the Presence (الحضرة) that I shall mention in the Sixth Chapter of this book, and they brought the world into existence, as we shall mention in the chapters that follow, if Allah wills. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب چہارم: عالم کے آغاز کے سبب اور عالم کل میں اسماء حسنیٰ کے مراتب کے بیان میں\n\nآغاز کے سبب اور اس کے احکام میں\nاور صنعت کی انتہا اور اس کے استحکام میں\nاور بلند مراتب کے نگہبانوں کے درمیان فرق\nاس کی پیدائش میں اور اس کے حکام میں\nوہ دلائل جو ایک ایسے صانع پر دلالت کرتے ہیں\nجس نے سب کو اپنے احکام سے مغلوب کر رکھا ہے۔\n\n### [مقام کی خصوصیات اور دل کا احساس]\n\nہمارے ولی صفی، اللہ تعالیٰ ان کو باقی رکھے، عالم کے آغاز کے سبب پر ہماری کتاب \"عنقاء مغرب فی معرفۃ ختم الاولیاء و شمس المغرب\" میں اور ہماری کتاب \"انشاء الدوائر\" میں واقف ہو چکے ہیں، جس کا کچھ حصہ ہم نے ان کی قیام گاہ پر اس وقت لکھا تھا جب ہم ۵۹۸ھ میں حج کا ارادہ رکھتے ہوئے ان کی زیارت کے لیے گئے تھے۔ ان کے خادم عبدالجبار، اللہ ان کا مرتبہ بلند کرے، نے اس حصے کو ان کے لیے قلم بند کیا جو میں نے لکھا تھا اور میں اسے اپنے ساتھ مکہ لے گیا، اللہ اس کی عزت و شرف میں اضافہ کرے، تاکہ میں اسے وہاں مکمل کروں۔ لیکن اس کتاب نے ہمیں اس سے اور دیگر کاموں سے مشغول کر دیا، اس الٰہی حکم کی وجہ سے جو ہمیں اس کی تدوین کے بارے میں ملا، ساتھ ہی بعض بھائیوں اور فقراء کی خواہش بھی تھی، جو علم میں اضافے کے حریص تھے اور اس مبارک و شریف گھر کی برکات کے لوٹنے کی رغبت رکھتے تھے، جو برکات، ہدایت اور واضح نشانیوں کا مقام ہے۔ اور ہم اس موضوع میں اپنے صفی کریم ابومحمد عبدالعزیز رضی اللہ عنہ کو بھی وہ برکات بتانا چاہتے ہیں جو مکہ عطا کرتا ہے، اور یہ کہ یہ بہترین عبادتی وسیلہ اور اشرف ترین جمادی (مادی) و ترابی (خاکی) منزل ہے۔ شاید اس سے ان کے شوق کی ہمت بیدار ہو اور ان کی رغبت اس کی طرف مائل ہو۔ کیونکہ جس کو جوامع الکلم (جامع کلمات) عطا کیے گئے اور جو اپنے رب کے ساتھ مشاہدۂ عین میں قاب قوسین سے بھی زیادہ قریب تھا، اس کمال قرب اور وافر و عظیم حصہ کے باوجود، اس پر یہ آیت نازل ہوئی: **وَقُلْ رَبِّ زِدْنِي عِلْماً** (اور کہو: اے میرے رب! میرے علم میں اضافہ فرما)۔ اور عالمِ مشاہد، جو غیبی مقامات اور مشاہدات کا مالک ہے، اس کی شرط یہ ہے کہ وہ جانتا ہو کہ لطیف دلوں پر مقامات کا اثر ہوتا ہے، اگرچہ قلب کسی بھی جگہ موجود ہو جہاں وجودِ عام ہو۔ لیکن مکہ میں اس کا وجود زیادہ بلند اور کامل ہوتا ہے۔ جس طرح روحانی منازل میں تفاوت ہوتا ہے، اسی طرح جسمانی منازل میں بھی تفاوت ہوتا ہے۔ ورنہ کیا موتی پتھر کی طرح نہیں ہے؟ مگر صاحبِ حال کے نزدیک۔ لیکن کامل صاحبِ مقام ان دونوں میں تمیز کرتا ہے، جیسا کہ ذات حق (Al-Ḥaqq) نے ان میں تمیز کی ہے۔ کیا ذات حق (Al-Ḥaqq) نے اس گھر کو برابر کیا جس کی بنیاد مٹی اور تنکے کی اینٹوں سے بنی ہو، اور اس گھر کو جس کی بنیاد سونے اور چاندی کی اینٹوں سے بنی ہو؟ پس کامل حکیم وہی ہے جو ہر حقدار کو اس کا حق دے، وہی اپنے زمانے کا واحد اور اپنے وقت کا صاحب ہے۔ اور اس شہر میں بہت فرق ہے جس کی اکثر آبادی شہوات سے ہو، اور اس شہر میں جس کی اکثر آبادی واضح نشانیوں (آیات بینات) سے ہو۔ کیا میرے صفی، اللہ ان کو باقی رکھے، نے میرے ساتھ یہ بات تسلیم نہیں کی کہ بعض مقامات پر ہمارے دلوں کا وجود بعض دوسرے مقامات سے زیادہ ہوتا ہے؟ وہ رضی اللہ عنہ تونس کے مشرق میں سمندر کے کنارے واقع محفوظ مینار کے گھروں میں خلوت چھوڑ کر، مینار کے قریب قبرستانوں کے بیچ میں واقع اس رباط میں اتر جاتے تھے جو اس کے دروازے کی طرف تھی اور جس کی نسبت خضر علیہ السلام کی طرف کی جاتی ہے۔ میں نے ان سے اس بارے میں پوچھا تو انہوں نے فرمایا: \"میں اپنے دل کو وہاں مینار کی نسبت زیادہ پاتا ہوں۔\" اور میں نے بھی وہاں وہی پایا جو شیخ نے فرمایا تھا۔ میرے ولی، اللہ ان کو باقی رکھے، جانتے ہیں کہ یہ اس وجہ سے ہے کہ اس جگہ کو آباد کرنے والے یا تو فی الحال مکرم فرشتے ہیں یا سچے جنات، یا پھر ان لوگوں کی ہمتیں ہیں جو اسے آباد کرتے تھے اور فنا ہو گئے، جیسے ابویزید کا گھر جسے بیت الابرار کہا جاتا ہے، اور شونیزیہ میں جنید کا زاویہ، اور یقین میں ابن ادہم کا غار۔ اور وہ تمام مقامات جو صالحین کے تھے جو اس دنیا سے فنا (Al-Fanā’) ہو گئے، لیکن ان کے آثار ان کے مقامات پر باقی ہیں، جن سے لطیف دل متاثر ہوتے ہیں۔ اسی لیے مساجد کی فضیلت قلب کے وجود میں تفاوت کی وجہ سے ہے، نہ کہ اجر کے دوگنا ہونے کی وجہ سے۔ آپ اپنے دل کو ایک مسجد میں دوسری مساجد کی نسبت زیادہ پاتے ہیں، اور یہ مٹی کی وجہ سے نہیں، بلکہ ہم نشینوں کی ہم نشینی یا ان کی ہمتوں کی وجہ سے ہے۔ اور جو شخص اپنے دل کے وجود میں بازار اور مساجد کے درمیان فرق نہیں پاتا، وہ صاحبِ حال ہے، صاحبِ مقام نہیں۔ اور میں کشف (Al-Kashf) اور علم کے ذریعے شک نہیں کرتا کہ اگرچہ فرشتے تمام زمین کو آباد کرتے ہیں، ان کے معارف اور مراتب میں تفاوت کے باوجود، ان میں سب سے بلند مرتبہ اور علم و معرفت (Al-Ma‘rifah) میں سب سے عظیم وہ ہیں جو مسجد حرام کو آباد کرتے ہیں۔ اور آپ کی نشستوں کے مطابق ہی آپ کا وجود ہوتا ہے، کیونکہ ہم نشینوں کی ہمتیں ہم نشین کے دل پر اثر انداز ہوتی ہیں، اور ان کی ہمتیں ان کے مراتب کے مطابق ہوتی ہیں۔ اور اگر ہمتوں کے لحاظ سے دیکھا جائے تو اس گھر کا طواف ایک لاکھ چوبیس ہزار نبیوں نے کیا ہے، اولیاء کے علاوہ۔ اور کوئی نبی یا ولی ایسا نہیں جس کی کوئی ہمت اس گھر اور اس بلد حرام سے متعلق نہ ہو، کیونکہ یہ وہ گھر ہے جسے اللہ نے تمام گھروں پر چنا ہے، اور عبادت گاہوں میں اسے اولیت کا راز حاصل ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: **إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبارَكاً وهُدىً لِلْعالَمِينَ فِيهِ آياتٌ بَيِّناتٌ مَقامُ إِبْراهِيمَ ومن دَخَلَهُ كانَ آمِناً** (بے شک سب سے پہلا گھر جو لوگوں کے لیے بنایا گیا وہ مکہ میں ہے، جو برکت والا اور جہانوں کے لیے ہدایت ہے، اس میں واضح نشانیاں ہیں، مقام ابراہیم ہے، اور جو اس میں داخل ہوا وہ امن والا ہو گیا)۔ اور اس کے علاوہ دیگر آیات ہیں۔ اگر میرے صفی، اللہ ان کو باقی رکھے، اس شریف بلد حرام کی طرف سفر کریں، تو وہ ایسے معارف اور اضافے پائیں گے جو انہوں نے اس سے پہلے نہ دیکھے ہوں گے اور نہ ان کے دل میں کبھی آئے ہوں گے۔ وہ رضی اللہ عنہ جانتے ہیں کہ نفس اپنے علم کی صورت پر اور جسم اپنے عمل کی صورت پر حشر کیا جائے گا، اور مکہ میں علم اور عمل کی صورت اس کے علاوہ دیگر مقامات سے زیادہ کامل ہے۔ اگر صاحبِ قلب ایک گھڑی کے لیے بھی اس میں داخل ہو جائے تو اسے یہ حاصل ہو جائے گا، تو پھر کیا حال ہو گا اگر وہ وہاں پڑوس اختیار کرے، قیام کرے اور تمام فرائض و قواعد کو وہاں ادا کرے؟ بلاشبہ اس کا مشہد (Ash-Shuhūd) وہاں زیادہ کامل اور روشن ہو گا، اور اس کا منبع زیادہ صاف، شیریں اور میٹھا ہو گا۔ اور چونکہ میرے صفی، اللہ ان کو باقی رکھے، نے مجھے بتایا ہے کہ وہ مقامات اور مزاجوں کے مطابق زیادتی اور کمی محسوس کرتے ہیں، اور وہ جانتے ہیں کہ یہ بھی اس میں رہنے والے کی حقیقت یا اس کی ہمت کی طرف لوٹتا ہے، جیسا کہ ہم نے ذکر کیا۔ اور ہمیں اس میں کوئی شک نہیں کہ اس فن کی معرفت، یعنی مقامات کی معرفت اور زیادتی و کمی کا احساس، عارف کی معرفت (Al-Ma‘rifah) کے مکمل تمکن، اس کے مقام کی بلندی، اشیاء پر اس کے اشراف اور اس کی تمیز کی قوت کی علامت ہے۔ پس اللہ میرے ولی کے لیے اس میں اچھا اثر لکھے اور انہیں اس میں پاکیزہ خیر عطا فرمائے، بے شک وہ اس کا مالک اور اس پر قادر ہے۔\n\n### [اسماء الٰہیہ اور ہستی (Al-Wujūd) کی حقائق]\n\nجان لو، اللہ ہمیں اور تمہیں اور تمام مسلمانوں کو توفیق دے، کہ اکثر علماء باللہ جو اہل کشف (Al-Kashf) اور حقائق میں سے ہیں، ان کے پاس عالم کے آغاز کے سبب کا علم نہیں ہے، سوائے اس کے کہ قدیم علم کا تعلق اس کے ایجاد سے تھا، پس وہ چیز وجود میں آئی جس کے بارے میں اسے معلوم تھا کہ وہ وجود میں آئے گی۔ اور اکثر لوگ یہیں پر رک جاتے ہیں۔ لیکن ہم اور وہ جسے اللہ نے ان چیزوں پر مطلع کیا جن پر ہمیں مطلع کیا، ہم اس کے علاوہ دیگر امور پر بھی واقف ہوئے ہیں۔ وہ یہ کہ جب تم عالم کو اس کی حقائق اور نسبتوں کے ساتھ تفصیل سے دیکھو گے تو اسے حقائق اور نسبتوں میں محدود، منازل اور مراتب میں معلوم، اور متماثل و مختلف اجناس میں متناہی پاؤ گے۔ جب تم اس امر پر واقف ہو جاؤ گے تو جان لو گے کہ اس میں ایک لطیف راز اور ایک عجیب معاملہ ہے، جس کی حقیقت کو نہ تو باریک فکر سے پایا جا سکتا ہے اور نہ ہی نظر سے، بلکہ یہ کشف (Al-Kashf) کے علوم میں سے ایک موہوب علم ہے اور ہمتوں کے ساتھ کی گئی مجاہدات کا نتیجہ ہے۔ کیونکہ ہمت کے بغیر مجاہدہ کوئی نتیجہ خیز نہیں ہوتا اور نہ ہی علم میں مؤثر ہوتا ہے، البتہ حال میں رقت اور صفائی پیدا کرتا ہے جسے مجاہدہ کرنے والا پاتا ہے۔ پس جان لو، اللہ تمہیں حکمتوں کے بھید سکھائے اور تمہیں جوامع الکلم عطا کرے، کہ اسماء حسنیٰ جو تعداد میں اسماءِ احصاء سے اوپر پہنچتے ہیں اور سعادت میں اسماءِ احصاء سے نیچے اترتے ہیں، وہی اس عالم میں مؤثر ہیں، اور وہی پہلی کنجیاں ہیں جنہیں **لَا يَعْلَمُهَا إِلَّا هُوَ** (اسے اس کے سوا کوئی نہیں جانتا)۔ اور ہر حقیقت کے لیے ایک مخصوص اسم ہوتا ہے، اور حقیقت سے میری مراد وہ حقیقت ہے جو حقائق کی ایک جنس کو جمع کرتی ہے، اور وہ اسم اس حقیقت کا رب (مالک) ہوتا ہے، اور وہ حقیقت اس کی عابدہ ہوتی ہے اور اس کے حکم کے تحت ہوتی ہے، اس کے علاوہ کچھ نہیں۔ اور اگر کوئی چیز تمہارے لیے بہت سی چیزوں کو جمع کر دے، تو معاملہ ویسا نہیں ہے جیسا تم نے گمان کیا ہے۔ کیونکہ اگر تم اس چیز کو دیکھو گے تو اس میں ایسے وجوہ پاؤ گے جو ان اسماء کے مقابل ہوں گے جن پر وہ دلالت کرتے ہیں، اور یہی وہ حقائق ہیں جن کا ہم نے ذکر کیا۔ اس کی مثال وہ ہے جو تمہارے لیے اس علم میں ثابت ہے جو ظاہری عقلوں میں ہے اور ان کے حکم کے تحت ہے، کسی ایسے موجود کے حق میں جو فرد ہو اور تقسیم نہ ہو، جیسے جوہر فرد (وہ جزو جو تقسیم نہ ہو سکے)۔ پس اس میں متعدد حقائق ہیں جو اپنی تعداد کے مطابق الٰہی اسماء کا تقاضا کرتی ہیں۔ چنانچہ اس کے ایجاد کی حقیقت اسم القادر کا تقاضا کرتی ہے، اور اس کے استحکام کا پہلو اسم العالم کا تقاضا کرتا ہے، اور اس کے اختصاص کا پہلو اسم المرید کا تقاضا کرتا ہے، اور اس کے ظہور کا پہلو اسم البصیر اور الرائی کا تقاضا کرتا ہے، وغیرہ۔ پس اگرچہ یہ فرد ہے، لیکن اس میں یہ وجوہ اور دیگر وجوہ ہیں جن کا ہم نے ذکر نہیں کیا، اور ہر وجہ کے متعدد وجوہ ہیں جو اپنے حساب سے اسماء کا تقاضا کرتے ہیں، اور وہ وجوہ ہمارے نزدیک ثانوی حقائق ہیں، اور ان پر واقف ہونا مشکل ہے، اور کشف (Al-Kashf) کے ذریعے ان کا حصول زیادہ مشکل ہے۔\n\n### [اسماء الٰہیہ کی امہات (بنیادی اسماء)]\n\nاور جان لو کہ ہم اسماء کی کثرت کو نظر انداز کر سکتے ہیں جب ہم عالم سے ان کے طالبوں کے وجوہ کو ملحوظ رکھتے ہیں، اور اگر ہم اسے ملحوظ نہ رکھیں تو ہمیں ان امہاتِ مطالب کی طرف رجوع کرنا چاہیے جن سے ہمیں کوئی چارہ نہیں۔ پس ہم جان لیں گے کہ وہ اسماء جن پر امہات موقوف ہیں، وہ بھی اسماء کی امہات (بنیادی اسماء) ہیں، تو نظر آسان ہو جائے گی اور مقصد پورا ہو جائے گا، اور ان امہات سے بنات (ذیلی اسماء) کی طرف تجاوز کرنا آسان ہو جائے گا، جیسا کہ بنات کو امہات کی طرف لوٹانا آسان ہے۔ پس جب تم عالم علوی اور سفلی میں تمام معلوم اشیاء کو دیکھو گے تو پاؤ گے کہ وہ ان سات اسماء کو شامل ہیں جنہیں علم کلام کے ماہرین صفات سے تعبیر کرتے ہیں۔ ہم نے اس کا ذکر اپنی کتاب \"انشاء الدوائر\" میں کیا ہے۔ لیکن اس کتاب میں ہمارا مقصد ان سات امہات سے نہیں ہے جنہیں صفات سے تعبیر کیا جاتا ہے، بلکہ ہمارا مقصد ان امہات سے ہے جو عالم کے ایجاد کے لیے ضروری ہیں۔ جیسا کہ ہمیں ذات حق (Al-Ḥaqq) کی معرفت کے لیے عقلی دلائل میں صرف اس کے موجود، عالم، مرید، قادر اور حی ہونے کی ضرورت ہے، بس۔ اور جو اس سے زیادہ ہے، وہ صرف تکلیف (شرعی ذمہ داری) کا تقاضا کرتا ہے۔ پس رسول علیہ السلام کی آمد نے ہمیں اسے متکلم کے طور پر جاننے پر مجبور کیا، اور تکلیف نے ہمیں اسے سمیع (سننے والا) اور بصیر (دیکھنے والا) کے طور پر جاننے پر مجبور کیا، اور اس کے علاوہ دیگر اسماء۔ پس عالم کے وجود کے لیے ہمیں اسماء کی معرفت کی جو ضرورت ہے، وہ اسماء کے ارباب (مالک) ہیں، اور ان کے علاوہ باقی سب ان کے سدنے (خادم) ہیں، جیسا کہ ان ارباب میں سے بعض بعض کے سدنے ہیں۔ پس اسماء کی امہات (بنیادی اسماء) یہ ہیں: الحی (زندہ)، العالم (جاننے والا)، المرید (ارادہ کرنے والا)، القادر (قدرت والا)، القائل (کہنے والا)، الجواد (سخاوت کرنے والا)، المقسط (انصاف کرنے والا)۔ اور یہ اسماء المدبر (تدبیر کرنے والا) اور المفصل (تفصیل دینے والا) نامی دو اسماء کی بنات (ذیلی اسماء) ہیں۔ الحی تمہارے وجود کے بعد اور اس سے پہلے تمہاری فہم کو ثابت کرتا ہے۔ العالم تمہارے وجود میں تمہارے احکام کو ثابت کرتا ہے، اور تمہارے وجود سے پہلے تمہاری تقدیر کو ثابت کرتا ہے۔ المرید تمہارے اختصاص کو ثابت کرتا ہے۔ القادر تمہارے عدم کو ثابت کرتا ہے۔ القائل تمہارے قدم (قدیم ہونے) کو ثابت کرتا ہے۔ الجواد تمہارے ایجاد کو ثابت کرتا ہے۔ اور المقسط تمہارے مرتبے کو ثابت کرتا ہے، اور مرتبہ وجود کی آخری منزل ہے۔ پس یہ وہ حقائق ہیں جن کا وجود ضروری ہے، لہٰذا ان کے اسماء کا ہونا بھی ضروری ہے جو ان کے ارباب ہیں۔ پس الحی (زندہ) ارباب اور مربوبین کا رب ہے، اور وہ امام ہے۔ مرتبے میں اس کے بعد العالم ہے، العالم کے بعد المرید ہے، المرید کے بعد القائل ہے، القائل کے بعد القادر ہے، القادر کے بعد الجواد ہے، اور ان سب میں آخری المقسط ہے، کیونکہ وہ مراتب کا رب ہے، اور یہ وجود کی آخری منزلیں ہیں۔ اور باقی جو اسماء ہیں وہ ان ائمہ ارباب اسماء کی اطاعت میں ہیں۔\n\n### [اسماء الٰہیہ کے ائمہ]\n\nاور ان اسماء کے اسم اللہ کی طرف متوجہ ہونے کا سبب عالم کے ایجاد میں باقی اسماء بھی تھے، اپنی حقائق کے ساتھ۔ اگرچہ اسماء کے ائمہ، عالم کو نظر میں رکھے بغیر، صرف چار ہیں: الحی (زندہ)، المتکلم (کلام کرنے والا)، السمیع (سننے والا) اور البصیر (دیکھنے والا)۔ کیونکہ جب وہ اپنا کلام سنتا ہے اور اپنی ذات کو دیکھتا ہے، تو اس کا وجود اپنی ذات میں کامل ہو جاتا ہے، عالم کو نظر میں رکھے بغیر۔ لیکن ہم اسماء میں سے صرف وہی چاہتے ہیں جن سے عالم کا وجود قائم ہو۔ پس اسماء ہم پر کثیر ہو گئے، تو ہم نے ان کے ارباب کی طرف رجوع کیا اور ان کی حضرات میں داخل ہوئے، تو ہمیں ان کے علاوہ کوئی نہیں ملا جن کا ہم نے ذکر کیا اور جنہیں ہم نے اپنے مشاہدے کے مطابق ظاہر کیا۔ پس ارباب اسماء کے اسم اللہ کی طرف متوجہ ہونے کا سبب ہماری اعیان (ذوات) کے ایجاد میں باقی اسماء تھے۔ پس سب سے پہلے جس نے اس عالم کے طلب کے لیے قیام کیا، وہ اسم الملک کے سوال پر اسم المدبر اور المفصل تھے۔ جب ان دونوں نے اس چیز کی طرف توجہ کی، تو انہوں نے عالم کے نفس میں مثال کو پایا، بغیر کسی سابقہ عدم کے، لیکن مرتبے میں تقدم تھا، وجود میں تقدم نہیں، جیسے سورج کا طلوع ہونا دن کے آغاز سے پہلے، اگرچہ دن کا آغاز سورج کے طلوع ہونے کے ساتھ ہی ہوتا ہے، لیکن یہ واضح ہو چکا ہے کہ دن کے آغاز کے وجود کی علت سورج کا طلوع ہونا ہے، حالانکہ وہ وجود میں اس کے ساتھ ہی ہے۔ پس یہ معاملہ بھی اسی طرح ہے۔ جب ان دونوں اسماء نے عالم کی تدبیر کی اور اسے تفصیل دی، بغیر کسی سابقہ جہل یا عدم علم کے، اور عالم کے نفس میں مثال کی صورت پیدا ہوئی، تو اس وقت اسم العالم کا تعلق اس مثال سے ہو گیا، جیسا کہ اس صورت سے ہوا جس سے یہ مثال لی گئی تھی، اگرچہ وہ غیر مرئی تھی کیونکہ وہ موجود نہیں تھی، جیسا کہ ہم باب \"مم وجد العالم\" میں ذکر کریں گے۔\n\n### [عالم کے پہلے اسماء]\n\nپس عالم کے پہلے اسماء یہ دونوں اسماء ہیں، اور اسم المدبر ہی وہ ہے جس نے مقدر ایجاد کے وقت کو متحقق کیا، پس اسم المرید کا تعلق اس سے اسی حد تک ہوا جس حد تک المدبر نے اسے ظاہر کیا اور اس کی تدبیر کی۔ اور انہوں نے اس مثال کی پیدائش میں کوئی کام نہیں کیا مگر باقی اسماء کی شرکت سے، لیکن ان دونوں اسماء کے پردے کے پیچھے سے۔ اسی لیے ان دونوں کے لیے امامت صحیح ہوئی، اور دوسرے اس سے واقف نہیں ہوئے، یہاں تک کہ مثال کی صورت ظاہر ہوئی، تو انہوں نے اس میں اپنے لیے مناسب حقائق کو دیکھا جو انہیں ان سے عشق کرنے کے لیے کھینچ رہی تھیں۔ پس ہر اسم اس حقیقت سے عشق کرنے لگا جو مثال میں تھی، لیکن وہ اس میں اثر انداز ہونے پر قادر نہیں تھا، کیونکہ وہ حضرہ جس میں یہ مثال ظہور الٰہی (At-Tajallī) ہوئی تھی، اس کی اجازت نہیں دیتی تھی۔ پس اس عشق اور محبت نے انہیں اس مثال کی عین صورت کو ایجاد کرنے کی طلب، کوشش اور رغبت کی طرف لے گیا تاکہ ان کا اقتدار ظاہر ہو اور حقیقت میں ان کا وجود صحیح ہو۔ پس کسی عزیز کے لیے اس سے بڑھ کر کوئی غم نہیں کہ اسے کوئی ایسا عزیز نہ ملے جسے وہ مغلوب کرے، یہاں تک کہ وہ اس کے قہر کے نیچے ذلیل ہو جائے، تاکہ اس کی عزت کا اقتدار صحیح ہو، یا کسی غنی کے لیے اس سے بڑھ کر کوئی غم نہیں کہ اسے کوئی ایسا نہ ملے جو اس کی غنا کا محتاج ہو۔ اور اسی طرح یہ تمام اسماء ہیں۔ پس وہ اپنے ارباب، ان سات ائمہ کی طرف پناہ گزیں ہوئے جن کا ہم نے ذکر کیا، اور ان سے اس مثال کی عین صورت کو ایجاد کرنے کی رغبت کی جسے انہوں نے عالم کی ذات میں مشاہدہ کیا تھا، اور جسے عالم سے تعبیر کیا جاتا ہے۔\n\n### [اسماء الٰہیہ ذات کے لحاظ سے متحد اور تعلقات کے لحاظ سے مختلف ہیں]\n\nاور شاید کوئی کہنے والا کہے: اے محقق! اسماء اس مثال کو کیسے دیکھتے ہیں، حالانکہ اسے صرف اسم البصیر ہی دیکھتا ہے، کوئی اور نہیں؟ اور ہر اسم ایک ایسی حقیقت پر ہے جس پر دوسرا اسم نہیں ہے۔ ہم اسے کہیں گے: جان لو، اللہ تمہیں توفیق دے، کہ ہر اسم الٰہی تمام اسماء کو اپنے اندر شامل رکھتا ہے، اور ہر اسم اپنے افق میں تمام اسماء سے متصف ہوتا ہے۔ پس ہر اسم اپنے افق اور اپنے علم میں حی، قادر، سمیع، بصیر، متکلم ہے۔ ورنہ یہ کیسے صحیح ہو سکتا ہے کہ وہ اپنے عابد کا رب ہو؟ یہ ناممکن ہے۔ مگر وہاں ایک لطیف نکتہ ہے جسے لوگ محسوس نہیں کرتے۔ وہ یہ کہ تم گندم کے دانوں اور ان کی مثالوں میں یقیناً جانتے ہو کہ ہر دانے میں وہی حقائق ہیں جو اس کے دوسرے دانے میں ہیں، جیسا کہ تم یہ بھی جانتے ہو کہ یہ دانہ دوسرے دانے کا عین نہیں ہے، اگرچہ وہ دونوں متماثل حقائق پر مشتمل ہیں۔ پس وہ دونوں مثالیں ہیں۔ پس اس حقیقت کو تلاش کرو جو تمہیں ان دونوں دانوں میں فرق کرنے پر مجبور کرتی ہے اور تم کہتے ہو کہ یہ اس کا عین نہیں ہے۔ اور یہ بات تمام متماثلات میں جاری ہے، جس حیثیت سے وہ متماثل ہیں۔ اسی طرح اسماء بھی ہیں، ہر اسم ان حقائق کو جمع کرنے والا ہے جنہیں اسماء نے جمع کیا ہے، پھر تم یقین کے ساتھ جانتے ہو کہ یہ اسم دوسرے اسم کا عین نہیں ہے، اسی لطیف نکتہ کی وجہ سے جس سے تم نے گندم کے دانوں اور ہر متماثل چیز میں فرق کیا۔ پس اس معنی کو تلاش کرو تاکہ تم اسے ذکر سے جانو، نہ کہ فکر سے۔ تاہم، میں تمہیں ایک ایسی حقیقت پر واقف کرانا چاہتا ہوں جس کا ذکر متقدمین میں سے کسی نے نہیں کیا، اور شاید وہ اس پر مطلع بھی نہیں ہوئے، تو شاید میں اس کے ساتھ مخصوص کیا گیا ہوں، اور میں نہیں جانتا کہ کیا یہ میرے بعد کسی اور کو اس حضرہ سے عطا کی جائے گی جس سے مجھے عطا کی گئی ہے یا نہیں؟ پس اگر کوئی اسے میری کتاب سے پڑھ لے یا سمجھ لے تو میں اس کا معلم ہوں۔ لیکن متقدمین نے اسے نہیں پایا۔ وہ یہ ہے کہ ہر اسم، جیسا کہ ہم نے طے کیا، اسماء کی حقائق کو جمع کرتا ہے اور ان پر مشتمل ہوتا ہے، اس لطیف نکتہ کے وجود کے ساتھ جس سے تم نے دو مثالوں کے درمیان تمیز کی۔ اور وہ یہ کہ اسم المنعم (انعام کرنے والا) اور اسم المعذب (عذاب دینے والا)، جو کہ الظاہر اور الباطن ہیں، ان دونوں اسماء میں سے ہر ایک وہ سب کچھ شامل رکھتا ہے جو ان کے سدنے (خادم) اول سے آخر تک رکھتے ہیں۔ مگر اسماء کے ارباب اور ان کے علاوہ باقی اسماء تین مراتب پر ہیں: ان میں سے کچھ وہ ہیں جو ارباب اسماء کے درجات سے ملحق ہوتے ہیں، اور کچھ وہ ہیں جو ایک درجے میں منفرد ہوتے ہیں، پس ان میں سے کچھ وہ ہیں جو المنعم کے درجے میں اور المعذب کے درجے میں منفرد ہوتے ہیں۔ پس یہ عالم کے اسماء محدود ہیں۔ اور اللہ ہی مددگار ہے۔\n\n### [اسم اللہ الاعظم]\n\nپس جب تمام اسماء ان ائمہ کی طرف پناہ گزیں ہوئے، اور ائمہ اسم اللہ کی طرف پناہ گزیں ہوئے، تو اسم اللہ نے ذات کی طرف پناہ لی، اس حیثیت سے کہ وہ اسماء سے بے نیاز ہے، اور اس چیز کی تکمیل کے لیے سوال کیا جو اسماء نے اس سے مانگی تھی۔ پس المحسان الجواد (احسان کرنے والے، سخاوت کرنے والے) نے اس کی اجازت دی اور فرمایا: \"ائمہ سے کہو کہ وہ عالم کو ان حقائق کے مطابق ظاہر کرنے میں مشغول ہو جائیں جو ان کی حقائق عطا کرتی ہیں۔\" پس اسم اللہ ان کی طرف نکلا اور انہیں خبر دی، تو وہ تیزی سے، خوشی اور مسرت کے ساتھ لوٹے، اور وہ اسی حال میں رہے۔ پس انہوں نے اس حضرہ کی طرف دیکھا جس کا ذکر میں اس کتاب کے باب ششم میں کروں گا، اور انہوں نے عالم کو وجود بخشا، جیسا کہ ہم اس کے بعد آنے والے ابواب میں ان شاء اللہ ذکر کریں گے۔ **وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب چهارم در سبب آغاز عالم و مراتب اسماء حسنی از کل عالم»\n\nدر سبب آغاز و احکام آن *** و نهایت آفرینش و استحکام آن\n\nو فرق میان پاسداران علو *** در پیدایش آن و میان حاکمان آن\n\nدلایلی که بر صانعی دلالت کردند *** که همه را با احکام خود مقهور ساخته است\n\n### [خواص مکان و احساس دل‌ها]\n\nصفیِ ولی (دوست خدا)، که خداوند او را نگه دارد، بر سبب آغاز عالم در کتاب ما که «عنقاء مغرب در معرفت ختم اولیاء و شمس مغرب» نام دارد، وقوف یافته است؛ و نیز در کتاب ما که «انشاء الدوائر» نامیده می‌شود و بخشی از آن را در منزل کریم او، هنگام زیارتمان در سال پانصد و نود و هشت، در حالی که قصد حج داشتیم، تألیف کردیم. پس خادم او، عبدالجبار، که خداوند قدرش را بلند گرداند، آن مقدار از کتاب را که من سطر زده بودم، برای او ثبت کرد و من آن را با خود به مکه، که خداوند بر شرفش بیفزاید، در همان سال بردم تا آن را در آنجا به اتمام رسانم. اما این کتاب (فتوحات) ما را از آن و از غیر آن بازداشت، به سبب امر الهی که در ثبت آن بر ما وارد شد، همراه با رغبت برخی از برادران و فقرا در این امر، به دلیل حرصشان بر علم بیشتر و میلشان به اینکه برکات این بیت مبارک شریف، که محل برکات و هدایت و آیات بینات است، به ایشان بازگردد؛ و نیز اینکه در این موضوع، صفیِ کریم، ابومحمد عبدالعزیز (رضی الله عنه)، را از آنچه مکه از برکات عطا می‌کند، آگاه سازیم؛ و اینکه مکه بهترین وسیله عبادی و شریف‌ترین منزلت جمادی و ترابی است. باشد که همت شوق او به سوی آن برخیزد و رغبتش به آن فرود آید.\n\nزیرا به کسی که جوامع الکلم (جوامع الكلم) به او داده شده بود و در مشاهده عین (مشاهدة العين) از پروردگارش نزدیک‌تر از قاب قوسین (قاب قوسين) بود، با وجود این تقرب کامل‌تر و بهره وافرتر و عظیم‌تر، این آیه نازل شد: **«و بگو: پروردگارا، علم مرا زیاد کن.»** (وَقُلْ رَبِّ زِدْنِي عِلْماً). و از شرط‌های عالمِ شاهد (المشاهد)، صاحب مقامات غیبی (المقامات الغيبية) و مشاهدات، این است که بداند مکان‌ها در قلب‌های لطیف تأثیر دارند، حتی اگر قلب در هر موضعی که هستیِ عام (الوجود الأعم) در آن باشد، یافت شود.\n\nپس وجود قلب در مکه والاتر و کامل‌تر است. همان‌طور که منازل روحانی (المنازل الروحانية) بر یکدیگر برتری دارند، منازل جسمانی (المنازل الجسمانية) نیز بر یکدیگر برتری دارند. وگرنه، آیا مروارید مانند سنگ است؟ جز نزد صاحب حال (صاحب الحال). اما انسان کامل (المكمل) صاحب مقام (صاحب المقام)، میان آن دو تمایز قائل می‌شود، همان‌طور که حق (الحق) میان آن دو تمایز قائل شده است. آیا حق (الحق) میان خانه‌ای که بنای آن از خشت خاک و کاه است و خانه‌ای که بنای آن از خشت طلا و نقره است، برابری قرار داده است؟ پس حکیم واصل (الحكيم الواصل) کسی است که حق هر صاحب حقی را به او بدهد؛ او یگانه عصر و صاحب وقت خویش است. و تفاوت بسیار است میان شهری که بیشتر آبادانی‌اش شهوات است و شهری که بیشتر آبادانی‌اش آیات بینات است. آیا صفیِ من، که خداوند او را نگه دارد، با من هم‌عقیده نیست که وجود قلب‌های ما در برخی مکان‌ها بیشتر از برخی دیگر است؟\n\nاو (رضی الله عنه) خلوت در خانه‌های مناره محفوظ واقع در شرق تونس در ساحل دریا را ترک می‌کرد و به رباطی که در میان قبرها نزدیک مناره از سمت دروازه‌اش قرار داشت و به خضر منسوب بود، فرود می‌آمد. از او در این باره پرسیدم، گفت: «قلبم را در آنجا بیشتر از مناره می‌یابم.» من نیز در آنجا آنچه را که شیخ گفت، یافتم. ولیِ من، که خداوند او را نگه دارد، می‌داند که این به خاطر کسانی است که آن مکان را آباد می‌کنند؛ یا در حال حاضر از فرشتگان گرامی (الملائكة المكرمين) یا از جن‌های صادق (الجن الصادقين)، و یا به خاطر همت کسی است که پیش‌تر آنجا را آباد می‌کرده و از دست رفته است؛ مانند خانه ابویزید که «بیت الابرار» نامیده می‌شود، و مانند زاویه جنید در شونیزیه، و مانند غار ابن ادهم در یقین (الیقين). و مانند هر مکان دیگری از صالحان که از این دنیا فانی (فناء) شدند و آثارشان در مکان‌هایشان باقی مانده است و قلب‌های لطیف از آن متأثر می‌شوند. به همین دلیل، برتری مساجد به وجود قلب (وجود القلب) بازمی‌گردد، نه به دوچندان شدن پاداش. چه بسا قلب خود را در مسجدی بیشتر از مساجد دیگر بیابی، و این به خاطر خاک نیست، بلکه به خاطر همنشینی با هم‌ردیفان یا همت‌های آنان است. و کسی که تفاوتی در وجود قلبش میان بازار و مساجد نمی‌یابد، او صاحب حال (صاحب حال) است نه صاحب مقام (صاحب مقام).\n\nو من از طریق کشف (كشف) و علم شک ندارم که اگرچه فرشتگان تمام زمین را آباد می‌کنند، با وجود برتری‌هایشان در معارف و مراتب، اما والاترینشان از نظر رتبه و عظیم‌ترینشان از نظر علم و معرفت، آبادکنندگان مسجد الحرام هستند. و وجود تو به اندازه نشستن‌های توست، زیرا همت‌های همنشینان در قلب همنشین تأثیر دارد و همت‌های آنان به اندازه مراتبشان است. و اگر از جهت همت‌ها باشد، صد و بیست و چهار هزار پیامبر، به جز اولیاء، این خانه را طواف کرده‌اند. و هیچ پیامبر و ولی‌ای نیست مگر اینکه همتی متعلق به این خانه و این بلد حرام دارد، زیرا این خانه‌ای است که خداوند آن را بر سایر خانه‌ها برگزیده و سرِ اولیت (الأولية) را در معابد دارد، چنانکه خداوند متعال می‌فرماید: **«همانا نخستین خانه‌ای که برای مردم نهاده شد، همان است که در بکه (مکه) است، مبارک و هدایتی برای جهانیان. در آن نشانه‌های روشنی است؛ مقام ابراهیم است و هر کس وارد آن شود، در امان خواهد بود.»** (إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبارَكاً وهُدىً لِلْعالَمِينَ فِيهِ آياتٌ بَيِّناتٌ مَقامُ إِبْراهِيمَ ومن دَخَلَهُ كانَ آمِناً) و آیات دیگر.\n\nپس اگر صفی، که خداوند او را نگه دارد، به این بلد حرام شریف سفر کند، از معارف و افزونی‌هایی خواهد یافت که پیش از آن ندیده و به خاطرش خطور نکرده است. او (رضی الله عنه) می‌داند که نفس بر صورت علمش محشور می‌شود و جسم بر صورت عملش، و صورت علم و عمل در مکه کامل‌تر از جاهای دیگر است. و اگر صاحب قلبی یک ساعت هم وارد آن شود، این برای او حاصل خواهد شد؛ پس چگونه است اگر در آنجا مجاورت کند و اقامت گزیند و تمام فرایض و قواعد را در آن به جا آورد؟ شکی نیست که شهود (مشهده) او در آنجا کامل‌تر و آشکارتر خواهد بود و مأخذ او صاف‌تر و گواراتر و شیرین‌تر. و از آنجا که صفیِ من، که خداوند او را نگه دارد، به من خبر داده است که بر حسب مکان‌ها و مزاج‌ها، احساس افزایش و کاهش می‌کند و می‌داند که این نیز به حقیقت ساکن در آن مکان یا همت او بازمی‌گردد، همان‌طور که ذکر کردیم. و نزد ما شکی نیست که معرفت این فن، یعنی معرفت مکان‌ها و احساس افزایش و کاهش، از کمال تمکن معرفت عارف (المعرفة) و علو مقام او و اشرافش بر اشیاء و قدرت تمییز اوست. پس خداوند برای ولیِ من در آنجا اثری نیکو بنویسد و خیری پاکیزه به او ببخشد. همانا او شایسته آن و توانا بر آن است.\n\n### [اسماء الهی و حقایق هستی]\n\nبدان، خداوند ما و تو و همه مسلمانان را توفیق دهد، که بیشتر علمای بالله از اهل کشف (الكشف) و حقایق (الحقائق)، علمی به سبب آغاز عالم ندارند، مگر تعلق علم قدیم به ایجاد آن؛ پس آنچه را که می‌دانست خواهد بود، ایجاد شد. و بیشتر مردم در اینجا متوقف می‌شوند. اما ما و کسانی که خداوند آنان را بر آنچه ما را مطلع ساخته، مطلع کرده است، بر امور دیگری غیر از این وقوف یافته‌ایم. و آن این است که اگر به عالم با تفصیل حقایق و نسبت‌هایش بنگری، آن را محدود در حقایق و نسبت‌ها، معلوم در منازل و مراتب، و متناهی در اجناس، میان مشابه و متفاوت، خواهی یافت.\n\nپس چون بر این امر وقوف یابی، خواهی دانست که این سرّی لطیف و امری شگفت‌انگیز دارد که حقیقت آن با اندیشه دقیق و نظر درک نمی‌شود، بلکه با علمی موهوب از علوم کشف (الكشف) و نتایج مجاهداتی که همراه با همت‌ها هستند، درک می‌گردد. زیرا مجاهده بدون همت، چیزی تولید نمی‌کند و در علم تأثیری ندارد، بلکه در حال (الحال) تأثیر می‌گذارد؛ از لطافت و صفایی که صاحب مجاهده آن را می‌یابد. پس بدان، خداوند اسرار حکمت را به تو بیاموزد و از جوامع الکلم (جوامع الكلم) به تو ببخشد، که اسماء حسنی (الأسماء الحسنى) که از نظر عدد به بالاتر از اسماء احصاء می‌رسند و از نظر سعادت به پایین‌تر از اسماء احصاء فرود می‌آیند، همان‌ها هستند که در این عالم تأثیرگذارند و همان‌ها مفاتح اولیه (المفاتح الأول) هستند که **«جز او کسی آنها را نمی‌داند.»** (لَا يَعْلَمُها إِلَّا هُوَ). و اینکه برای هر حقیقتی، اسم خاصی از اسماء وجود دارد. و منظورم از حقیقت، حقیقتی است که جنسی از حقایق را گرد می‌آورد. ربّ (پروردگار) آن حقیقت، همان اسم است و آن حقیقت، عابدِ آن اسم و تحت تکلیف اوست، نه غیر آن. و اگر چیزی، اشیاء بسیاری را برای تو جمع کند، امر بر آن نیست که تو گمان کرده‌ای. زیرا اگر به آن شیء بنگری، وجوهی برای آن خواهی یافت که با آن وجوه، مقابل آن اسمایی قرار می‌گیرد که بر آن دلالت می‌کنند، و آن وجوه همان حقایقی هستند که ذکر کردیم. مثال آن، چیزی است که در علمی که در ظاهر عقول و تحت حکم آنهاست، برای تو ثابت شده است؛ در مورد موجودی واحد که تقسیم نمی‌شود، مانند جوهر فرد (الجوهر الفرد) که جزئی است که تقسیم نمی‌پذیرد. همانا در آن حقایق متعددی وجود دارد که به تعداد خود، اسماء الهی را طلب می‌کنند. پس حقیقت ایجاد آن، اسم القادر را می‌طلبد؛ و وجه استحکام آن، اسم العالم را می‌طلبد؛ و وجه اختصاص آن، اسم المرید را می‌طلبد؛ و وجه ظهور آن، اسم البصیر و الرائی را می‌طلبد؛ و غیر از اینها. فهذا (جوهر فرد)، اگرچه واحد است، این وجوه و وجوه دیگری دارد که ما ذکر نکردیم. و برای هر وجهی، وجوه متعددی وجود دارد که بر حسب خود، از اسماء طلب می‌شوند. و آن وجوه، نزد ما حقایق ثانوی (الحقائق الثواني) هستند و وقوف بر آنها دشوار و تحصیل آنها از طریق کشف (الكشف) دشوارتر است.\n\n### [امّهات اسماء الهی]\n\nو بدان که ما ممکن است اسماء را با وجود کثرتشان رها کنیم، اگر وجوه طالبان آنها را از عالم در نظر بگیریم. و اگر آن را در نظر نگیریم، بازمی‌گردیم و امّهات مطالب (أمهات المطالب) را که از آنها بی‌نیاز نیستیم، در نظر می‌گیریم. پس می‌دانیم که اسمایی که امّهات بر آنها متوقف هستند، خود نیز امّهات اسماء هستند. در نتیجه، نظر آسان می‌شود و غرض کامل می‌گردد و تجاوز از این امّهات به بنات (فرعیات) میسر می‌شود، همان‌طور که بازگرداندن بنات به امّهات میسر است. پس اگر به همه اشیاء معلوم در عالم علوی و سفلی بنگری، خواهی دید که اسماء هفت‌گانه، که نزد اصحاب علم کلام به صفات تعبیر می‌شوند، آنها را در بر می‌گیرند. و ما این را در کتابمان که «انشاء الدوائر» نامیدیم، ذکر کرده‌ایم. و غرض ما در این کتاب، این امّهات هفت‌گانه که به صفات تعبیر می‌شوند، نیست؛ بلکه قصد ما امّهاتی است که برای ایجاد عالم از آنها گریزی نیست. همان‌طور که ما در دلایل عقول برای معرفت حق (الحق) سبحانه، جز به موجود بودن، عالم بودن، مرید بودن، قادر بودن و حی بودن او، نیاز نداریم و بس. و آنچه بر این افزوده شود، تنها مقتضای تکلیف است. پس آمدن رسول (علیه السلام) باعث شد او را متکلم بشناسیم، و تکلیف باعث شد او را سمیع و بصیر بشناسیم، و غیر از اینها از اسماء.\n\nپس آنچه ما از معرفت اسماء برای وجود عالم (وجود العالم) به آن نیاز داریم، همان ارباب اسماء (أرباب الأسماء) هستند، و غیر از آنها، خادمان (سدنه) برای آنها هستند، همان‌طور که برخی از این ارباب، خادمان برخی دیگر هستند. پس امّهات اسماء عبارتند از: الحی (زنده)، العالم (دانا)، المرید (اراده‌کننده)، القادر (توانا)، القائل (گوینده)، الجواد (بخشنده)، المقسط (عدالت‌گستر). و این اسماء، بنات (فرزندان) دو اسم المدبر (تدبیرکننده) و المفصل (تفصیل‌دهنده) هستند. پس الحی (زنده) فهم تو را پس از وجودت و پیش از آن ثابت می‌کند؛ و العالم (دانا) احکام تو را در وجودت ثابت می‌کند و پیش از وجودت، تقدیر تو را ثابت می‌کند؛ و المرید (اراده‌کننده) اختصاص تو را ثابت می‌کند؛ و القادر (توانا) عدم تو را ثابت می‌کند؛ و القائل (گوینده) قدمت تو را ثابت می‌کند؛ و الجواد (بخشنده) ایجاد تو را ثابت می‌کند؛ و المقسط (عدالت‌گستر) مرتبه تو را ثابت می‌کند. و مرتبه، آخرین منزلگاه‌های هستی (الوجود) است. پس اینها حقایقی هستند که وجودشان ضروری است، لذا اسمایشان که ارباب آنها هستند نیز ضروری‌اند. پس الحی (زنده)، ربّ ارباب و مربوبین است و او امام است. و در رتبه پس از او العالم (دانا) قرار دارد، و پس از العالم، المرید (اراده‌کننده)، و پس از المرید، القائل (گوینده)، و پس از القائل، القادر (توانا)، و پس از القادر، الجواد (بخشنده)، و آخرین آنها المقسط (عدالت‌گستر) است، زیرا او ربّ مراتب است و مراتب آخرین منزلگاه‌های هستی (الوجود) هستند. و آنچه از اسماء باقی می‌ماند، تحت طاعت این اسماءِ امام و ارباب قرار دارند.\n\n### [امامان اسماء الهی]\n\nو سبب توجه این اسماء به اسم «الله» در ایجاد عالم، بقیه اسماء همراه با حقایقشان نیز بود. با این حال، امامان اسماء، بدون در نظر گرفتن عالم، تنها چهار اسم هستند و بس: اسم الحی (زنده)، المتکلم (سخن‌گو)، السمیع (شنوا) و البصیر (بینا). زیرا هنگامی که کلام خود را بشنود و ذات خود را ببیند، وجودش در ذات خود کامل شده است، بدون نظر به عالم. و ما از اسماء جز آنچه وجود عالم (وجود العالم) به واسطه آن قوام می‌یابد، نمی‌خواهیم. پس اسماء بر ما زیاد شدند و ما به ارباب آنها روی آوردیم و در حضراتشان بر آنان وارد شدیم. پس جز اینهایی که ذکر کردیم و بر حسب آنچه مشاهده کردیم، آشکار ساختیم، نیافتیم. پس سبب توجه ارباب اسماء به اسم «الله» در ایجاد اعیان ما، بقیه اسماء بودند. اولین کسانی که برای طلب این عالم برخاستند، اسم المدبر (تدبیرکننده) و المفصل (تفصیل‌دهنده) بودند، به درخواست اسم الملک (پادشاه). پس هنگامی که (اسم الله) به شیء توجه کرد، مثال (المثال) در نفس عالم یافت شد، بدون عدمی که پیشی گرفته باشد، بلکه تقدم مرتبه‌ای بود نه تقدم وجودی؛ مانند تقدم طلوع خورشید بر آغاز روز، اگرچه آغاز روز مقارن با طلوع خورشید است، اما روشن شده است که علت وجود آغاز روز، طلوع خورشید است و در وجود با آن مقارن بوده است. پس این امر چنین است. فلما هنگامی که این دو اسم، عالم را تدبیر و تفصیل دادند، بدون جهل یا عدم علم پیشین به آن، و صورت مثال (صورة المثال) در نفس عالم پدید آمد، اسم العالم (دانا) در آن هنگام به آن مثال تعلق گرفت، همان‌طور که به صورتی که مثال از آن گرفته شده بود، تعلق گرفت، اگرچه آن صورت دیده نمی‌شود، زیرا موجود نیست، چنانکه در باب «از چه چیز عالم موجود شد» ذکر خواهیم کرد.\n\n### [اولین اسماء عالم]\n\nپس اولین اسماء عالم، این دو اسم هستند. و اسم المدبر (تدبیرکننده) همان است که وقت ایجاد مقدر را محقق ساخت. پس المرید (اراده‌کننده) به آن تعلق گرفت، بر همان حدی که المدبر آن را آشکار و تدبیر کرده بود. و این دو اسم، هیچ کاری از پیدایش این مثال (المثال) را انجام ندادند مگر با مشارکت بقیه اسماء، اما از پشت حجاب این دو اسم. و به همین دلیل، امامت برای این دو اسم صحیح شد، در حالی که دیگران از آن آگاه نبودند، تا اینکه صورت مثال (صورة المثال) آشکار شد. پس آنچه را که در آن از حقایق مناسب خود بود، دیدند که آنان را به تعشق به آن جذب می‌کرد. پس هر اسمی به حقیقت خود که در مثال بود، عاشق شد، اما نمی‌توانست در آن تأثیر بگذارد، زیرا حضرتی که این مثال در آن تجلی (تجلی) یافته بود، اجازه نمی‌داد. پس آن تعشق و محبت، آنان را به طلب و کوشش و رغبت در ایجاد صورت عین آن مثال سوق داد تا سلطنتشان آشکار شود و وجودشان بر حقیقت صحیح گردد. پس هیچ غمی بزرگ‌تر از غم عزیزی نیست که عزیزی را نیابد تا او را مقهور سازد و زیر قهرش خوار شود، تا سلطنت عزتش صحیح گردد؛ یا غنی‌ای که کسی را نیابد که به غنای او محتاج باشد. و همه این اسماء چنین هستند. پس به ارباب خود، یعنی امامان هفت‌گانه‌ای که ذکر کردیم، پناه بردند و از آنان خواستند تا عین این مثال را که در ذات عالم به واسطه آن مشاهده کرده بودند و به «عالم» تعبیر می‌شود، ایجاد کنند.\n\n### [اسماء الهی از حیث ذات متحد و از حیث تعلقات مختلف هستند]\n\nو شاید کسی بگوید: ای محقق، چگونه اسماء این مثال را می‌بینند، در حالی که جز اسم البصیر (بینا) به طور خاص، کسی آن را نمی‌بیند؟ و هر اسمی بر حقیقتی است که اسم دیگر بر آن نیست. به او می‌گوییم: بدان، خداوند تو را توفیق دهد، که هر اسم الهی (اسم إلهي) شامل تمام اسماء است و هر اسمی در افق خود به تمام اسماء نعت داده می‌شود. پس هر اسمی در افق خود و در علم خود، حی، قادر، سمیع، بصیر و متکلم است. وگرنه، چگونه صحیح است که ربّ (پروردگار) عابد خود باشد؟ هیهات! جز اینکه در اینجا لطیفه‌ای است که کسی از آن آگاه نیست. و آن این است که تو به طور قطع در دانه‌های گندم و امثال آن می‌دانی که هر دانه گندمی همان حقایقی را دارد که دانه دیگر دارد، همان‌طور که می‌دانی این دانه عین آن دانه دیگر نیست، اگرچه هر دو حاوی حقایق متماثل هستند؛ زیرا آنها دو مِثل (مانند) هستند. پس در جستجوی این حقیقت باش که تو را وامی‌دارد میان این دو دانه فرق بگذاری و بگویی این عین آن نیست. و این در تمام متماثلات، از حیث آنچه به آن متماثل شده‌اند، جاری است. اسماء نیز چنین هستند؛ هر اسمی جامع حقایقی است که اسماء دیگر جمع کرده‌اند. سپس به طور قطع می‌دانی که این اسم، آن اسم دیگر نیست، به واسطه همان لطیفه‌ای که با آن میان دانه‌های گندم و هر متماثلی فرق گذاشتی. پس در جستجوی این معنا باش تا آن را با ذکر (الذكر) بشناسی نه با فکر (الفكر). جز اینکه می‌خواهم تو را بر حقیقتی آگاه سازم که هیچ‌یک از متقدمین آن را ذکر نکرده‌اند و شاید بر آن مطلع نشده باشند. پس شاید من به آن اختصاص یافته باشم و نمی‌دانم آیا از حضرتی که به من عطا شده، پس از من به دیگری نیز داده می‌شود یا خیر. پس اگر کسی آن را از کتاب من استقرا کند یا بفهمد، من معلم او هستم. اما متقدمین آن را نیافتند. و آن این است که هر اسمی، همان‌طور که مقرر کردیم، حقایق اسماء را جمع می‌کند و بر آنها احاطه دارد، همراه با وجود آن لطیفه‌ای که تمییز میان دو مِثل به واسطه آن برای تو حاصل شد. و آن این است که اسم المنعم (نعمت‌دهنده) و اسم المعذب (عذاب‌دهنده) که همان الظاهر (آشکار) و الباطن (پنهان) هستند، هر یک از این دو اسم، شامل آنچه خادمانشان از اول تا آخر در بر دارند، می‌شود. جز اینکه ارباب اسماء و غیر آنها از اسماء، بر سه مرتبه هستند: برخی از آنها به درجات ارباب اسماء ملحق می‌شوند، و برخی به درجه‌ای منفرد می‌شوند. پس برخی از آنها به درجه المنعم و به درجه المعذب منفرد می‌شوند. پس اینها اسماء محصور عالم هستند. و خداوند یاری‌دهنده است.\n\n### [اسم اعظم الله]\n\nپس هنگامی که همه اسماء به این امامان پناه بردند و امامان به اسم «الله» پناه بردند، اسم «الله» از حیث بی‌نیازی‌اش از اسماء، به ذات (الذات) پناه برد و در مورد برآوردن آنچه اسماء از او خواسته بودند، درخواست کرد. پس احسان‌کننده بخشنده (المحسان الجواد) با آن انعام کرد و فرمود: «به امامان بگو که به آشکار ساختن عالم، بر حسب آنچه حقایقشان اقتضا می‌کند، تعلق گیرند.» پس اسم «الله» نزد آنان بیرون آمد و خبر را به ایشان داد. پس شتابان، شادمان و مسرور بازگشتند و پیوسته چنین بودند. پس به حضرتی که آن را در باب ششم این کتاب ذکر می‌کنم، نظر کردند و عالم را ایجاد نمودند، چنانکه در باب‌های بعدی پس از این، ان‌شاءالله، ذکر خواهیم کرد. **«و خداوند حق را می‌گوید و او راه را می‌نمایاند.»** (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}