{
  "id": 150,
  "title": {
    "ar": "الباب الخمسون ومائة في معرفة مقام الغيرة التي هي الستر وأسراره",
    "en": "Chapter One Hundred and Fifty: Concerning the Gnosis (معرفة) of the Station (مقام) of Divine Jealousy (الغيرة), which is the Veiling (الستر), and its Mysteries.",
    "ur": "باب ایک سو پچاس: غَیرت (الغیرۃ) کے مقام (مقام) کی معرفت (المعرفۃ) کے بیان میں، جو کہ سِتر (الستر) ہے اور اس کے اسرار (أسرار) کا بیان",
    "fa": "باب صد و پنجاهم در معرفت مقام غیرت که همان ستر (پوشش) و اسرار آن است."
  },
  "content": {
    "ar": "## (الباب الخمسون ومائة في معرفة مقام الغيرة التي هي الستر وأسراره)\n\n\n> ما أعجب الغيرة في العالم *** ووصفنا الله بها أعجب‏\n\n\n> وقولنا الله غيور على *** ما قرر الشرع وما نذهب‏\n\n\n> وقد قبلناه ولكنه *** من أصعب الأمر الذي ينسب‏\n\n\n> وإنه من حيث أفكارنا *** فرض محال عينه ينصب‏\n\n\n> والكشف مثل الشرع في قوله *** وشأن رب الكشف لا يحجب‏\n\n\n> والأمر حق وهو أعجوبة *** من أجلها عقولهم تهرب‏\n\n\n> قد جعل الشبلي في حكمه *** أن لها حكما وذا أصعب‏\n\n\n> وهو من أهل الكشف في علمنا *** ضرب مثال عندنا يضرب‏\n\n\n> وعند أهل الفكر في زعمهم *** على الذي يعطيهم المذهب‏\n\n\n> بأنها من عالم زلة *** وهي إلى حكم العمي أقرب‏\n\n\n### [الغيرة الإلهية أثبتها الإيمان ولكن بأداة مخصوصة]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الغيرة نعت إلهي‏\n\n\nورد في الخبر أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قال في سعد إن سعدا لغيور وأنا أغير من سعد والله أغير مني ومن غيرته حرم الفواحش‏\n\n\nوفي هذا الحديث مسألة عظيمة بين الأشاعرة والمعتزلة وهو حديث صحيح فالغيرة أثبتها الايمان ولكن بأداة مخصوصة وهي اللام الأجلية أو من أو الباء وتستحيل بأداة على وهي التي وقعت من الشبلي إما غلطة وإما قبل أن يعرف الله معرفة العارفين فالغيرة في طريق الله هي الغيرة لله أو بالله أو من أجل الله والغيرة على الله محال‏\n\n\n### [من كمال العالم وجود النقص الإضافي فيه‏]\n\n\nفتحقيق كونها نعتا إلهيا وهو نعت يطلب الغير ولذا سميت غيرة فلو لا ملاحظة الغير ما سميت غيرة ولا وجدت فالإله القادر يطلب المألوه المقدور وهو الغير فلا بد من وجود ما يطلب إلا له وجوده فأوجد العالم على أكمل ما يكون الوجود فإنه لا بد أن يكون كذلك لاستحالة إضافة النقص إلى الكامل الاقتدار فلذلك قال أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ وهو الكمال فلو لم يوجد النقص في العالم لما كمل العالم فمن كمال العالم وجود النقص الإضافي فيه فلذلك قلنا إنه وجد على أكمل صورة بحيث إنه لم يبق في الإمكان أكمل منه لأنه على الصورة الإلهية\n\n\nورد في الخبر أن الله خلق آدم على صورته‏\n\n\nفكان في قوة الإنسان من أجل الصورة أن ينسى عبوديته ولذلك وصف الإنسان بالنسيان فقال في آدم فَنَسِيَ والنسيان نعت إلهي فما نسي إلا من كونه على الصورة فما زلنا مما كنا فيه قال تعالى نَسُوا الله فَنَسِيَهُمْ كما يليق‏\n\n\n### [العبد المكمل بالصورة ودعوى الربوبية]\n\n\nبجلاله فلما علم الحق أن هذا العبد بما كمله الله به من القوة الإلهية بالصورة الكمالية لا بد أن يدعي في نعوت ما هو حق لله لطلب الصورة الكمالية لذلك النعت وهو من بعض النعوت الإلهية فغار الحق من المشاركة في بعض نعوت الجلال وشغل الإنسان بما أباح له من باقي النعوت الإلهية فلما علم أيضا أنه لا يقف عند ذلك وأنه لا بد أن يعطي الصورة الكمالية حقها في الاتصاف بالنعوت الإلهية وإنها تتعدى ما حجر عليها مثل العظمة والكبرياء والجبروت‏\n\n\nفقال الكبرياء ردائي والعظمة إزاري من نازعني واحدا منهما قصمته‏\n\n\nوقال كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ فهذا هو عين الغيرة غار على هذه النعوت أن تكون لغير الله فحجرها وكذلك تحجرت على الحقيقة بقوله كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ فلا يدخل مع هذا الطابع قلب كون من الأكوان تكبر على الله ولا جبروت لأجل هذا الطبع‏\n\n\n### [معنى الطابع الذي طبع الله على قلب المتكبر الجبار]\n\n\nفعلم كل من أظهر من المخلوقين دعوى الألوهية كفرعون وغيره وتكبر وتجبر كل ذلك في ظاهر\nالكون وهذا الذي ظهرت منه صفة الكبرياء مطبوع على قلبه إن يدخل فيه الكبرياء على الله فإنه يعلم من نفسه افتقاره وحاجته وقيام الآلام به من ألم جوع وعطش وهواء ومرض التي لا تخلو هذه النشأة الحيوانية عنه في هذه الدار وتعذر بعض الأغراض أن تنال مرادها وتألمه لذلك ومن هذه صفته من المحال أن يتكبر في نفسه على ربه فهذا معنى الطابع الذي طبع الله على قلب المتكبر الذي يظهر لكم به من الدعوى الجبار يجبركم على ما يريد فمنكم المطيع والمخالف ولو هلك بمخالفته ولهذا يرجى حكم السعادة في المال ولو بعد حين فإن القلوب ما يدخلها كبرياء على الله لكن يدخلها بعضهم على بعض قال تعالى لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ وإذا علمت السماء أنها أكبر من خلق الناس كانت موصوفة بالكبرياء على الناس وذلك الكبرياء لا يقدح فيها فهذا معنى الغيرة الإلهية فلا رافع لما حجره فلا يتكبر على الله فيما بينه وبين الله أحد من خلق الله هذا محال وقوعه والقدر الذي وقع عليه التحجير الظاهر عليه وقع الذم لمن انتهكه وأضافه إلى نفسه وكذبوا على الله فيه‏\n\n\n### [الغيرة لله ومن أجل الله وبالله وعلى الله‏]\n\n\nوأما الغيرة لله ومن أجل الله وبالله فهو أن يرى الإنسان ما حده الحق أن يتعداه الخلق فيقوم به صفة الغيرة لله لا لنفسه ومن أجل الله لا من أجل نفسه إذ علم أن الخلق عبيد الله وأنه من حكم العبد أن لا يتعدى حد ما رسم له سيده وأما أن يغار على الله فإن الغيرة ستر يحجب المغار عليه حتى لا يكون إلا عنده خاصة وطريق الله مبني على أن ندعو الخلق إلى الله وأن نردهم إليه ونحببه إليهم ونعرفهم به وبمكانته وبهذا أمرنا والغيرة الكونية تأبى ذلك كله لجهلها بالمغار عليه الذي لا يستحق الغيرة عليه ولو لا الوقوع فيمن انتمى إلى الله وجهل بعض ما ينبغي لله وقصد بذلك الخير ولكن ما علم طريقه وإلا كنا نذكر جهل هذا القائل بالغيرة على الله ولكن يكفي تنبيهنا على أن هذا ليس بصحيح وإنما التبس على مثل هؤلاء الغيرة لله بالغيرة على الله وما علموا ما بينهما من الفرقان‏\n\n\n### [ما ذكره القشيري في باب الغيرة وليس هو من الغيرة]\n\n\nذكر في باب الغيرة القشيري في رسالته عن بعضهم أنه قيل له متى تستريح قال إذا لم أر له ذاكرا وليس هذا بغيرة فالقشيري أخطأ حيث جعل مثل هذا في باب الغيرة من كتابه وتخيل أن الشبلي في حال رؤية الذاكرين الله على الغفلة وبعدم الحرمة مثل من يذكره بلغو الايمان والايمان الفاجرة وذكر الله في طلب المعاش في الأسواق فغار أن يذكر بهذه الصفة لما لم يوف المذكور حقه من الحرمة عند الذكر والشبلي ما يبعد أن يكون هذا قصده بذلك القول في بدء أمره وفي وقت حجابه عن معرفة ربه وأما مع المعرفة فلا يكون هذا يعني قوله إذا لم أر له ذاكرا وإن معنى ذلك عندنا في حق كبراء العارفين أن الذكر لا يكون مع المشاهدة فلا بد للذاكر أن يكون محجوبا وإن كان الله جليس الذاكر ولكنه من وراء حجاب الذكر وكل من هو خلف حجاب من مطلوبه فإنه لا راحة عنده فإذا رفع الحجاب وقعت المشاهدة وزال الذكر بتجلى المذكور فلذلك قال إنما أستريح إذا لم أر له ذاكرا فطلب إن تكون مشاهدته تمنعه عن إدراك الذاكرين أو تمنى للذاكرين أن يكونوا في مقام الشهود الذي يمنعهم من الذكر إذ المؤمن يحب لأخيه ما يحب لنفسه على هذا يخرج قول هذا الرجل إن كان من العارفين وعلى ذوق آخر وهو أنه لا يستريح إلا إذا رأى أن الذكر هو الله لا الكون إذا كان الحق لسانه كما هو سمعه وبصره ويده فيستريح لأنه رأى أنه قد ذكره من يعلم كيف يذكره إذ كان هو الذاكر نفسه بلسان عبده فاستراح عند ذلك فلم ير له ذاكرا غيره‏\n\n\n### [غيرة الرسول وأكابر الأولياء]\n\n\nوأما غيرة الرسول وأكابر الأولياء فغيرتهم لله كما قلنا وهي غيرة أدب والغيرة كتمان ما ينبغي أن يكتم لعدم احترامه لو ظهر عند من لا يقدر قدره كما قال تعالى وما قَدَرُوا الله حَقَّ قَدْرِهِ فمن الغيرة ستر مثل هذا ومن الغيرة الإلهية ستره لضنائنه من أهل الخصوص في كنف صونه فلا يعرفون وذلك رحمة بالخلق فإنه تعالى لو أبدى مكانتهم ورتبتهم العلية لمن علم منه أنه لا بد أن يجري الأذى على يديه في حق هذا المقرب المجتبى ثم جرى منه ذلك الأذى في حقه لكان عدم احترام للجناب الإلهي حيث لم يعظم ما عظمه الله فسترهم عن العلم بهم فما احترموهم وآذوهم لجهلهم بهم وذلك لما قدره الله ولهذا تسأل هذا الذي آذى ذلك العبد المقرب من نبي أو صديق فتقول له من غير تعيين ما عندك في أولياء الله فيجد عنده من الحرمة لهم والتبرك بذكرهم والخضوع تحت أقدامهم لو وجدهم فإذا قلت له هذا منهم وهو منهم لم يقم عنده تصديق بذلك ولو جئته بأمر معجز وكل آية ما قدر يعتقد أن ذلك آية ولا أعطته علما فما آذى إلا من جهل لا من علم‏\n\n\n### [من غيرة الحق حجابه الخلق عن العلم به وبالخاصة من عباده‏]\nيؤيد ما ذكرناه أنه لو حسن الظن بشخص وتخيل أنه من أولياء الله وليس كذلك في نفس الأمر عظمه واحترمه هذا في فطرة كل مخلوق فما قصد أحد انتهاك حرمة الله في أوليائه وهذا من غيرة الحق فإن قلت فقد آذوا الله مع علمهم بأنه الله قلنا في الجواب عن ذلك ما علموا إن ذلك أذى وأنهم تأولوا فأخطئوا في نفس الأمر لحكم الشبهة التي قامت لهم وتخيلوا أنها دليل وهي في نفس الأمر ليست كذلك وهذه كلها من الحق في عباده أمور مقدرة لا بد من وقوعها فمن غيرته حجابهم عن العلم به وبالخاصة من عباده فجناب الله وأهل الله على الإطلاق محترمون ما لم تعين أو يتأول فاعلم ذلك‏\n\n",
    "en": "## Chapter One Hundred and Fifty: On the Knowledge of the Station of Zealousness (الغيرة), which is Concealment (الستر), and its Secrets\n\nHow wondrous is Zealousness (الغيرة) in the world,\nAnd our description of Allah with it is more wondrous still.\n\nAnd our saying that Allah is Zealous *over* (على)\nWhat the Law (الشرع) has established, and what we follow.\n\nWe have accepted it, yet it is\nAmong the most difficult matters attributed [to Him].\n\nAnd indeed, from the perspective of our thoughts,\nIt is an impossible premise whose essence is established.\n\nAnd Unveiling (الكشف) is like the Law in its pronouncement,\nAnd the affair of the Lord of Unveiling is not veiled.\n\nThe matter is true, and it is a marvel\nFrom which their intellects flee.\n\nAl-Shibli established in his ruling\nThat it has a specific judgment, and that is more difficult.\n\nHe is, in our knowledge, one of the People of Unveiling,\n[But] he struck an example that is struck against us.\n\nAnd according to the People of Intellect (أهل الفكر), in their claim,\n[It is based] upon what gives them their doctrine.\n\nThat it belongs to the world of error (زلة),\nAnd is closer to the judgment of blindness.\n\n### [Divine Zealousness (الغيرة الإلهية) is Established by Faith, but with a Specific Particle]\n\nKnow—may Allah support us and you with a spirit from Him—that Zealousness (الغيرة) is a Divine Attribute (نعت إلهي). It is mentioned in the Tradition (الخبر) that the Messenger of Allah, peace and blessings be upon him, said concerning Sa'd: \"Indeed, Sa'd is zealous, and I am more zealous than Sa'd, and Allah is more zealous than me. And out of His Zealousness, He forbade abominations (الفواحش).\" In this Hadith, there is a great issue between the Ash'aris and the Mu'tazilis, and it is an authentic Hadith. Thus, Faith (الإيمان) establishes Zealousness, but with a specific particle (أداة مخصوصة): namely, the particle of cause (اللام الأجلية), or *min* (من), or *bi* (الباء). It is impossible with the particle *‘ala* (على), which is what occurred with al-Shibli, either as an error or before he attained the Gnosis (معرفة) of the Gnostics (العارفين). Zealousness in the path of Allah is Zealousness *for* Allah (لله), or *by* Allah (بالله), or *on account of* Allah (من أجل الله). Zealousness *over* Allah (على الله) is impossible.\n\n### [The Existence of Relative Deficiency is Part of the Perfection of the World]\n\nThe verification of its being a Divine Attribute (نعت إلهي)—and it is an attribute that seeks the other (الغير)—is why it is called Zealousness (غيرة). Were it not for the observation of the other, it would not be called Zealousness, nor would it exist. The Capable God (الإله القادر) seeks the adored, the determined (المألوه المقدور), which is the other (الغير). Therefore, the existence of that which is sought is necessary for His Divinity. So, He brought the World (العالم) into existence in the most perfect state possible for existence, for it must necessarily be so, given the impossibility of attributing deficiency (النقص) to the Perfectly Capable (الكامل الاقتدار). For this reason, He said: <<أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ>> (He gave everything its creation/form), and that is perfection (الكمال). If deficiency did not exist in the World, the World would not be perfect. Thus, the existence of relative deficiency (النقص الإضافي) within it is part of the World’s perfection. Therefore, we said that it came into existence in the most complete form (أكمل صورة), such that nothing more perfect remained possible, because it is upon the Divine Form (الصورة الإلهية). It is mentioned in the Tradition that Allah created Adam upon His Form (صورته).\n\nBecause of this Form, the human being possessed the potential (قوة) to forget his servitude (عبوديته). For this reason, the human being is described by forgetfulness, as He said concerning Adam: <<فَنَسِيَ>> (and he forgot). Forgetfulness (النسيان) is a Divine Attribute, so he only forgot because he was upon the Form. We have not ceased from what we were in. The Exalted said: <<نَسُوا الله فَنَسِيَهُمْ>> (They forgot Allah, so He forgot them), in a manner befitting His Majesty (جلاله). When the Real (الحق) knew that this servant, due to the Divine Power (القوة الإلهية) with which Allah perfected him through the perfect Form (الصورة الكمالية), would inevitably claim, in certain attributes, what belongs rightfully to Allah—due to the perfect Form seeking that attribute, which is one of the Divine Attributes—the Real became Zealous (غار الحق) against participation in some Attributes of Majesty (نعوت الجلال). He occupied the human being with what He permitted him from the remaining Divine Attributes. When He also knew that the human being would not stop there, and that he would inevitably give the perfect Form its due right in being described by the Divine Attributes, and that these would transgress the boundaries set for them, such as Grandeur (العظمة), Pride (الكبرياء), and Omnipotence (الجبروت)—\n\n### [The Servant Perfected by the Form and the Claim of Lordship]\n\nHe said: \"Pride (الكبرياء) is My cloak and Grandeur (العظمة) is My wrapper (إزاري). Whoever contends with Me over one of them, I shall break him.\" And He said: <<كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ>> (Thus does Allah seal every heart of an arrogant tyrant). This is the very essence of Zealousness (الغيرة). He became zealous over these Attributes, lest they belong to anyone other than Allah, and thus He restricted them. Likewise, they became restricted in reality (الحقيقة) by His saying: <<كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ>>. Due to this seal (الطابع), the heart of no existent being (كون من الأكوان) who is arrogant toward Allah or possesses Omnipotence (جبروت) can enter into it.\n\n### [The Meaning of the Seal (الطابع) that Allah Placed Upon the Heart of the Arrogant Tyrant]\n\nEvery creature who outwardly claimed Divinity (الألوهية), such as Pharaoh and others, and acted arrogantly (تكبر) and tyrannically (تجبر), did so only in the manifest world (ظاهر الكون). This person, from whom the attribute of Pride (الكبرياء) appeared, has a seal (مطبوع) upon his heart that prevents Pride toward Allah from entering it. For he knows within himself his destitution (افتقاره), his need (حاجته), and the afflictions (الآلام) that befall him—such as the pain of hunger, thirst, heat, and illness, which this animal existence (النشأة الحيوانية) in this abode is never free from—and the frustration of some goals failing to achieve their desired outcome, and his suffering because of that. It is impossible for someone whose state is this to be inwardly arrogant toward his Lord. This is the meaning of the Seal (الطابع) that Allah placed upon the heart of the arrogant one (المتكبر) who appears to you with claims, and the tyrant (الجبار) who compels you to what he desires—among you are the obedient and the disobedient, even if the latter perishes due to his disobedience. For this reason, the judgment of felicity (السعادة) is hoped for in the end, even after a time, because hearts are not entered by arrogance toward Allah, but rather by arrogance toward one another. The Exalted said: <<لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ>> (The creation of the heavens and the earth is greater than the creation of mankind). If the heaven knows that it is greater than the creation of mankind, it is described by Pride (الكبرياء) over mankind, and that Pride does not diminish it. This is the meaning of Divine Zealousness (الغيرة الإلهية). There is no remover of what He has restricted. No one among Allah’s creation is arrogant toward Allah in what is between him and Allah; this is impossible to occur. The measure upon which the outward restriction fell resulted in blame for whoever violated it and attributed it to himself, and they lied against Allah concerning it.\n\n### [Zealousness for Allah (لله), On Account of Allah (ومن أجل الله), By Allah (وبالله), and Over Allah (وعلى الله)]\n\nAs for Zealousness *for* Allah (لله), *on account of* Allah (من أجل الله), and *by* Allah (بالله), it is when the human being sees that which the Real has limited, and which the Creation transgresses, so the attribute of Zealousness arises in him *for* Allah, not for himself, and *on account of* Allah, not on account of himself. This is because he knows that the Creation are the servants of Allah, and that it is the duty of the servant not to transgress the boundary drawn for him by his Master. As for being zealous *over* Allah (على الله), Zealousness is a concealment (ستر) that veils the object of zeal so that it is only present with the zealous one exclusively. The path of Allah is built upon calling the Creation to Allah, returning them to Him, making Him beloved to them, and making them know Him and His station. We have been commanded to do this. Cosmic Zealousness (الغيرة الكونية) rejects all of that due to its ignorance of the object of zeal, who does not deserve to be zealously guarded *over*. Were it not for the occurrence [of this error] in those who affiliate themselves with Allah and are ignorant of some of what is proper for Allah—and they intend good by it, but do not know its path—we would mention the ignorance of this speaker concerning Zealousness *over* Allah. However, it suffices to alert [the reader] that this is not correct, and that such people confused Zealousness *for* Allah (لله) with Zealousness *over* Allah (على الله), and they did not know the distinction (الفرقان) between the two.\n\n### [What Al-Qushayri Mentioned in the Chapter on Zealousness (الغيرة), Which is Not Zealousness]\n\nAl-Qushayri mentioned in the chapter on Zealousness in his *Risala* (Treatise), concerning one of them, that he was asked: \"When will you rest?\" He replied: \"When I do not see anyone remembering Him (ذاكرا).\" This is not Zealousness (غيرة). Al-Qushayri erred by placing such a statement in the chapter on Zealousness in his book. He imagined that al-Shibli, upon seeing those who remember Allah (الذاكرين) heedlessly (على الغفلة) and without the reverence (الحرمة) due to the One being remembered—like those who remember Him with frivolous or sinful faith, or those who mention Allah in the markets while seeking livelihood—became zealous that He should be mentioned in this manner, since the One being mentioned was not given His due right of reverence during the remembrance. It is not far-fetched that this was al-Shibli’s intention with that saying in the beginning of his affair and during the time of his veiling (حجابه) from the Gnosis of his Lord. However, with Gnosis (المعرفة), this meaning—namely, his saying, \"When I do not see anyone remembering Him\"—cannot stand. Rather, the meaning of that, according to us among the great Gnostics (كبراء العارفين), is that remembrance (الذكر) does not occur alongside witnessing (المشاهدة). The one who remembers must necessarily be veiled (محجوبا), even if Allah is the companion of the rememberer, but He is behind the veil of remembrance. Anyone who is behind a veil from his object of desire finds no rest. When the veil is lifted, witnessing occurs, and remembrance ceases with the Self-disclosure (تجلي) of the One being remembered. Therefore, he said: \"I only rest when I do not see anyone remembering Him.\" He sought that his witnessing should prevent him from perceiving the rememberers, or he wished for the rememberers to be in the Station of Witnessing (مقام الشهود) which prevents them from remembrance, since the believer loves for his brother what he loves for himself. This is one interpretation of the man’s saying, if he was one of the Gnostics. Upon another taste (ذوق آخر), it means that he will not rest until he sees that the Rememberer is Allah, not the creation, if the Real is his tongue, just as He is his hearing, sight, and hand. Then he rests because he sees that He has been remembered by One who knows how to remember Him, since He was the Rememberer Himself by the tongue of His servant. He found rest then, and thus saw no rememberer other than Him.\n\n### [The Zealousness of the Messenger and the Greatest Saints]\n\nAs for the Zealousness of the Messenger and the greatest Saints (أكابر الأولياء), their Zealousness is *for* Allah, as we said, and it is the Zealousness of etiquette (غيرة أدب). Zealousness is the concealment of what ought to be concealed due to the lack of respect it would receive if revealed to those who do not appreciate its worth, as the Exalted said: <<وما قَدَرُوا الله حَقَّ قَدْرِهِ>> (And they did not estimate Allah with the estimation due to Him). Part of Zealousness is the concealment of such things. And part of Divine Zealousness (الغيرة الإلهية) is His concealing His treasures (ضنائنه) among the people of exclusivity (أهل الخصوص) within the shelter of His protection, so that they are not known. This is a mercy to the Creation. For if the Exalted were to reveal their station and their lofty rank to one whom He knew would inevitably inflict harm upon the person thus brought near and chosen (المقرب المجتبى), and that harm then occurred, it would constitute a lack of respect for the Divine Presence (الجناب الإلهي), since what Allah magnified was not magnified. So, He concealed them from knowledge [of them]. Thus, they were not respected and were harmed due to ignorance of them. This is due to what Allah has decreed. For this reason, if you ask the one who harmed that close servant—whether a Prophet or a Veracious One (صديق)—without specifying [the victim], \"What is your opinion of the Saints of Allah (أولياء الله)?\" you will find in him reverence for them, seeking blessing through their mention, and submission beneath their feet, if he were to find them. But if you told him, \"This person is one of them,\" and he truly is, he would not believe it, even if you brought him a miraculous sign (أمر معجز) and every wonder, he would not be able to believe that it was a sign, nor would it grant him knowledge. Thus, he only harmed out of ignorance, not out of knowledge.\n\n### [Part of the Real’s Zealousness (غيرة الحق) is His Veiling the Creation from Knowledge of Him and His Special Servants]\n\nWhat we have mentioned is supported by the fact that if someone has a good opinion of a person and imagines that he is one of the Saints of Allah, even if he is not so in reality, he will magnify and respect him. This is in the nature (فطرة) of every creature. No one intends to violate the sanctity of Allah in His Saints. This is part of the Zealousness of the Real (غيرة الحق). If you say: \"But they harmed Allah while knowing that He is Allah,\" we reply that they did not know that this was harm, and they interpreted (تأولوا) and erred in reality due to the ambiguity (الشبهة) that arose for them, imagining it to be proof when in reality it was not. All these matters concerning the Real and His servants are decreed affairs (أمور مقدرة) that must occur. Part of His Zealousness is His veiling them from knowledge of Him and His special servants. The Presence of Allah (جناب الله) and the People of Allah (أهل الله) are absolutely respected, unless they are specified or misinterpreted. Know this.",
    "ur": "باب ایک سو پچاس: غیرت (الغيرة) کے مقام کی معرفت میں جو کہ پردہ پوشی (الستر) ہے اور اس کے اسرار\n\nکائنات میں غیرت (الغيرة) کتنی عجیب ہے، اور ہمارا اللہ کو اس سے متصف کرنا اس سے بھی زیادہ عجیب ہے۔\nاور ہمارا یہ کہنا کہ اللہ اس چیز پر غیور ہے جس کا شریعت (الشرع) نے فیصلہ کیا ہے اور جس کی طرف ہم جاتے ہیں۔\nہم نے اسے قبول تو کر لیا ہے، لیکن یہ ان مشکل ترین امور میں سے ہے جو منسوب کیے جاتے ہیں۔\nاور یہ ہماری فکری سطح پر ایک ایسا محال فرض ہے جس کا وجود قائم ہے۔\nاور کشف (الکشف) بھی شریعت (الشرع) کی طرح اس کے بارے میں کہتا ہے، اور صاحبِ کشف (الکشف) کا معاملہ پوشیدہ نہیں رہتا۔\nاور یہ امر حق ہے، اور ایک ایسا عجوبہ ہے جس کی وجہ سے عقلیں بھاگ کھڑی ہوتی ہیں۔\nشبلی نے اپنے حکم میں یہ قرار دیا ہے کہ اس (غیرت) کا ایک حکم ہے، اور یہ زیادہ مشکل ہے۔\nاور وہ ہمارے علم میں اہل کشف (الکشف) میں سے ہیں، ایک ایسی مثال جو ہمارے ہاں دی جاتی ہے۔\nاور اہل فکر کے نزدیک، ان کے گمان میں، اس (غیرت) پر جو انہیں مسلک عطا کرتی ہے۔\nکہ یہ لغزش کی دنیا سے ہے، اور اندھوں کے حکم کے زیادہ قریب ہے۔\n\n### [الٰہی غیرت (الغيرة الإلهية) کو ایمان نے ثابت کیا ہے لیکن ایک مخصوص ذریعے سے]\n\nاے اللہ! ہمیں اور تمہیں اپنی روح سے تائید عطا فرمائے، جان لو کہ غیرت (الغيرة) ایک الٰہی صفت (نعت إلهي) ہے۔\nحدیث میں آیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے سعد کے بارے میں فرمایا: \"سعد بہت غیور ہے، اور میں سعد سے زیادہ غیور ہوں، اور اللہ مجھ سے زیادہ غیور ہے، اور اس کی غیرت ہی کی وجہ سے اس نے فواحش کو حرام قرار دیا ہے۔\"\nیہ حدیث صحیح ہے اور اس میں اشاعرہ اور معتزلہ کے درمیان ایک عظیم مسئلہ ہے۔ پس غیرت (الغيرة) کو ایمان (الإيمان) نے ثابت کیا ہے، لیکن ایک مخصوص ذریعے سے، اور وہ ہے لامِ اجلیہ، یا \"مِنْ\" (سے)، یا \"باء\" (کے ذریعے)۔ اور یہ \"عَلَى\" (پر) کے ذریعے محال ہو جاتی ہے، جو کہ شبلی سے واقع ہوئی، یا تو غلطی سے، یا اس سے پہلے کہ وہ اللہ کی معرفت (المعرفۃ) عارفین کی معرفت کے مطابق حاصل کر پائیں۔ پس اللہ کے راستے میں غیرت (الغيرة) یا تو اللہ کے لیے، یا اللہ کے ذریعے، یا اللہ کی خاطر ہوتی ہے، اور اللہ پر غیرت (الغيرة على الله) محال ہے۔\n\n### [کائنات کے کمال میں اضافی نقص کا وجود شامل ہے]\n\nاس کے الٰہی صفت (نعت إلهي) ہونے کی تحقیق یہ ہے کہ یہ ایک ایسی صفت ہے جو غیر (دوسرے) کا تقاضا کرتی ہے، اسی لیے اسے غیرت (غيرة) کہا گیا۔ اگر غیر کا لحاظ نہ ہوتا تو اسے غیرت نہ کہا جاتا اور نہ ہی یہ پائی جاتی۔ قادر الٰہ معبودِ مقدور کا تقاضا کرتا ہے، اور وہ غیر ہے۔ لہٰذا جس چیز کا الٰہ تقاضا کرتا ہے، اس کا وجود ضروری ہے۔ پس اس نے کائنات (العالم) کو ہستی (الوجود) کے کامل ترین درجے پر پیدا کیا، کیونکہ اس کا ایسا ہونا ضروری ہے، اس لیے کہ کامل اقتدار والے کی طرف نقص کی نسبت محال ہے۔ اسی لیے اللہ تعالیٰ نے فرمایا: **أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ** (اس نے ہر چیز کو اس کی خلقت عطا کی) اور یہی کمال ہے۔ اگر کائنات میں نقص نہ پایا جاتا تو کائنات کامل نہ ہوتی۔ پس کائنات کے کمال میں اضافی نقص کا وجود شامل ہے۔ اسی لیے ہم نے کہا کہ یہ کامل ترین صورت پر موجود ہوئی، اس طرح کہ امکان میں اس سے زیادہ کامل کوئی چیز باقی نہیں رہی، کیونکہ یہ الٰہی صورت پر ہے۔\nحدیث میں آیا ہے کہ: \"اللہ نے آدم کو اپنی صورت پر پیدا کیا۔\"\nپس صورت کی وجہ سے انسان کی قوت میں یہ شامل تھا کہ وہ اپنی بندگی کو بھول جائے، اور اسی لیے انسان کو نسیان (بھول) سے متصف کیا گیا، چنانچہ آدم کے بارے میں فرمایا: **فَنَسِيَ** (تو وہ بھول گیا)۔ اور نسیان ایک الٰہی صفت (نعت إلهي) ہے۔ اس نے صرف اس لیے بھولا کہ وہ اس صورت پر تھا۔ ہم اس سے نہیں ہٹے جس پر ہم تھے، اللہ تعالیٰ فرماتا ہے: **نَسُوا الله فَنَسِيَهُمْ** (وہ اللہ کو بھول گئے تو اللہ نے انہیں بھلا دیا) جیسا کہ اس کے جلال کے لائق ہے۔\n\n### [صورت کے ذریعے کامل کیے گئے بندے اور ربوبیت کا دعویٰ]\n\nجب ذات حق (الحق) نے جان لیا کہ یہ بندہ، جسے اللہ نے کمالی صورت (الصورة الكمالية) کے ذریعے الٰہی قوت سے کامل کیا ہے، لازماً بعض صفات (نعوت) میں اس چیز کا دعویٰ کرے گا جو اللہ کا حق ہے، کیونکہ وہ صفت کمالی صورت کا تقاضا کرتی ہے، اور وہ الٰہی صفات میں سے ہے۔ پس ذات حق (الحق) نے جلال کی بعض صفات میں شراکت پر غیرت (غيرة) کھائی، اور انسان کو ان باقی الٰہی صفات میں مشغول کر دیا جو اس کے لیے مباح تھیں۔ جب اللہ نے یہ بھی جان لیا کہ وہ اس پر نہیں رکے گا اور یہ کہ وہ لازماً الٰہی صفات سے متصف ہونے میں کمالی صورت کا حق ادا کرے گا، اور یہ کہ وہ ان حدود سے تجاوز کرے گا جو اس پر مقرر کی گئی ہیں، جیسے عظمت، کبریائی اور جبروت۔\nتو اللہ نے فرمایا: \"کبریائی میری چادر ہے اور عظمت میرا تہبند ہے، جو کوئی ان میں سے کسی ایک میں بھی مجھ سے جھگڑا کرے گا، میں اسے توڑ ڈالوں گا۔\" اور فرمایا: **كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ** (اسی طرح اللہ ہر متکبر، جبار کے دل پر مہر لگا دیتا ہے)۔ یہی عین غیرت (الغيرة) ہے۔ اللہ نے ان صفات پر غیرت کھائی کہ وہ اللہ کے سوا کسی اور کے لیے ہوں، چنانچہ انہیں محدود کر دیا۔ اور اسی طرح یہ صفات حقیقت میں بھی محدود ہو گئیں، اللہ کے اس قول سے: **كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ**۔ پس اس مہر کے ساتھ کسی بھی کائنات (الأكوان) کے دل میں اللہ کے مقابلے میں تکبر داخل نہیں ہوتا، اور نہ ہی اس مہر کی وجہ سے جبروت داخل ہوتا ہے۔\n\n### [اس مہر کا مفہوم جو اللہ نے متکبر جبار کے دل پر لگائی ہے]\n\nپس ہر وہ مخلوق جس نے فرعون وغیرہ کی طرح الوہیت کا دعویٰ ظاہر کیا، اور تکبر و تجبر کیا، یہ سب کائنات (الكون) کے ظاہر میں تھا۔ اور جس شخص سے صفتِ کبریائی ظاہر ہوئی، اس کے دل پر مہر لگی ہوئی ہے کہ اس میں اللہ کے مقابلے میں کبریائی داخل نہیں ہو سکتی۔ کیونکہ وہ اپنے اندر سے اپنی محتاجی، ضرورت، اور بھوک، پیاس، ہوا، اور بیماری کے دردوں کا قیام جانتا ہے، جن سے یہ حیوانی نشأۃ اس دنیا میں خالی نہیں رہتی، اور بعض مقاصد کا اپنی مراد کو نہ پا سکنا اور اس پر اس کا تکلیف محسوس کرنا۔ اور جس کی یہ صفت ہو، اس کے لیے محال ہے کہ وہ اپنے رب کے مقابلے میں اپنے نفس میں تکبر کرے۔ پس یہ اس مہر کا مفہوم ہے جو اللہ نے متکبر کے دل پر لگائی ہے، جو تمہیں دعوے کے ذریعے ظاہر ہوتا ہے، جبار تمہیں اس پر مجبور کرتا ہے جو وہ چاہتا ہے، پس تم میں سے کچھ اطاعت کرنے والے ہیں اور کچھ مخالفت کرنے والے، اگرچہ وہ اپنی مخالفت کی وجہ سے ہلاک ہو جائے۔ اسی لیے انجام کار سعادت کے حکم کی امید کی جاتی ہے، اگرچہ کچھ دیر بعد ہی سہی، کیونکہ دلوں میں اللہ کے مقابلے میں کبریائی داخل نہیں ہوتی، لیکن بعض دلوں میں ایک دوسرے کے مقابلے میں داخل ہوتی ہے۔ اللہ تعالیٰ فرماتا ہے: **لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ** (یقیناً آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے)۔ اور جب آسمان یہ جانتا ہے کہ وہ لوگوں کی تخلیق سے بڑا ہے، تو وہ لوگوں پر کبریائی سے متصف ہوتا ہے، اور یہ کبریائی اس میں کوئی نقص پیدا نہیں کرتی۔ پس یہ الٰہی غیرت (الغيرة الإلهية) کا مفہوم ہے۔ لہٰذا جس چیز کو اللہ نے محدود کر دیا ہے، اسے کوئی اٹھانے والا نہیں ہے۔ اللہ کی مخلوق میں سے کوئی بھی اللہ اور اپنے درمیان اللہ کے مقابلے میں تکبر نہیں کرتا، یہ محال الوقوع ہے۔ اور جس قدر پر ظاہری تحدید واقع ہوئی ہے، اس کی خلاف ورزی کرنے والے اور اسے اپنی طرف منسوب کرنے والے کی مذمت کی گئی ہے، اور انہوں نے اس میں اللہ پر جھوٹ بولا۔\n\n### [اللہ کے لیے، اللہ کی خاطر، اللہ کے ذریعے، اور اللہ پر غیرت]\n\nاور جہاں تک اللہ کے لیے، اللہ کی خاطر، اور اللہ کے ذریعے غیرت کا تعلق ہے، تو وہ یہ ہے کہ انسان دیکھے کہ مخلوق اس حد سے تجاوز کر رہی ہے جو ذات حق (الحق) نے مقرر کی ہے، تو وہ اللہ کے لیے غیرت کی صفت کے ساتھ کھڑا ہو جائے، نہ کہ اپنے نفس کے لیے، اور اللہ کی خاطر، نہ کہ اپنی خاطر۔ کیونکہ وہ جانتا ہے کہ مخلوق اللہ کے بندے ہیں، اور بندے کا حکم یہ ہے کہ وہ اس حد سے تجاوز نہ کرے جو اس کے آقا نے اس کے لیے مقرر کی ہے۔ اور جہاں تک اللہ پر غیرت (الغيرة على الله) کا تعلق ہے، تو غیرت ایک پردہ پوشی (ستر) ہے جو اس پر پردہ ڈالتی ہے جس پر غیرت کھائی جا رہی ہو، تاکہ وہ صرف اسی کے پاس خاص رہے۔ اور اللہ کا راستہ اس اصول پر مبنی ہے کہ ہم مخلوق کو اللہ کی طرف بلائیں، انہیں اس کی طرف لوٹائیں، انہیں اس سے محبت دلائیں، اور انہیں اس کی اور اس کے مقام کی معرفت (المعرفۃ) کرائیں۔ اور ہمیں اسی کا حکم دیا گیا ہے۔ اور کونیاتی غیرت (الغيرة الكونية) اس سب سے انکار کرتی ہے، کیونکہ وہ اس ذات پر غیرت کھانے کی جہالت میں مبتلا ہے جو اپنے اوپر غیرت کھانے کا مستحق نہیں ہے۔ اگر ان لوگوں کا معاملہ نہ ہوتا جو اللہ سے منسوب ہوئے اور اللہ کے لیے جو کچھ مناسب ہے اس میں سے بعض سے ناواقف رہے، اور ان کا ارادہ خیر کا تھا لیکن وہ اس کا راستہ نہ جان سکے، تو ہم اس شخص کی جہالت کا ذکر کرتے جو اللہ پر غیرت کا قائل ہے۔ لیکن ہمارا یہ تنبیہ کرنا کافی ہے کہ یہ صحیح نہیں ہے، بلکہ ایسے لوگوں پر اللہ کے لیے غیرت (الغيرة لله) اور اللہ پر غیرت (الغيرة على الله) کا التباس ہو گیا، اور انہوں نے ان دونوں کے درمیان فرق کو نہیں جانا۔\n\n### [جو کچھ قشیری نے بابِ غیرت میں ذکر کیا ہے اور وہ غیرت میں سے نہیں ہے]\n\nقشیری نے اپنی رسالہ میں بابِ غیرت میں بعض لوگوں سے نقل کیا ہے کہ ان سے پوچھا گیا: \"آپ کو کب راحت ملتی ہے؟\" انہوں نے کہا: \"جب میں اس (اللہ) کا کوئی ذکر کرنے والا نہ دیکھوں۔\" اور یہ غیرت نہیں ہے۔ قشیری نے غلطی کی جب انہوں نے ایسی بات کو اپنی کتاب میں بابِ غیرت میں شامل کیا، اور یہ خیال کیا کہ شبلی، اللہ کا ذکر کرنے والوں کو غفلت میں اور بے حرمتی کے ساتھ دیکھ کر، جیسے کوئی ایمان (الإيمان) کے لغو اور فاجر ہونے کے ساتھ ذکر کرے، یا بازاروں میں معاش کی طلب میں اللہ کا ذکر کرے، تو اس پر غیرت کھائی کہ اس صفت کے ساتھ اس کا ذکر کیا جائے، کیونکہ ذکر کے وقت مذکور کا حقِ حرمت ادا نہیں کیا گیا۔ اور یہ بعید نہیں کہ شبلی کا یہی مقصد رہا ہو اپنے ابتدائی دور میں اور اپنے رب کی معرفت (المعرفۃ) سے پردہ پوشی کے وقت۔ لیکن معرفت (المعرفۃ) کے ساتھ ایسا نہیں ہو سکتا، یعنی ان کا یہ قول کہ \"جب میں اس کا کوئی ذکر کرنے والا نہ دیکھوں۔\" اور ہمارے نزدیک کبار عارفین (العارفين) کے حق میں اس کا مطلب یہ ہے کہ ذکر مشاہدہ کے ساتھ نہیں ہوتا۔ لہٰذا ذاکر کا محجوب ہونا ضروری ہے، اگرچہ اللہ ذاکر کا ہم نشین ہوتا ہے، لیکن ذکر کے پردے کے پیچھے سے۔ اور جو کوئی بھی اپنے مطلوب سے پردے کے پیچھے ہو، اسے راحت نہیں ملتی۔ پس جب پردہ اٹھ جاتا ہے تو مشاہدہ واقع ہوتا ہے، اور مذکور کے تجلی (التجلی) سے ذکر زائل ہو جاتا ہے۔ اسی لیے انہوں نے کہا: \"مجھے راحت تب ہی ملتی ہے جب میں اس کا کوئی ذکر کرنے والا نہ دیکھوں۔\" پس انہوں نے یہ طلب کی کہ ان کا مشاہدہ انہیں ذاکرین کے ادراک سے روک دے، یا انہوں نے ذاکرین کے لیے یہ تمنا کی کہ وہ مقامِ شہود (الشهود) میں ہوں جو انہیں ذکر سے روک دے، کیونکہ مؤمن اپنے بھائی کے لیے وہی پسند کرتا ہے جو اپنے لیے پسند کرتا ہے۔ اس بنیاد پر اس شخص کا قول نکلتا ہے اگر وہ عارفین (العارفين) میں سے ہو۔ اور ایک دوسرے ذوق کے مطابق، وہ تب ہی راحت پاتا ہے جب وہ یہ دیکھے کہ ذکر کرنے والا اللہ ہے نہ کہ کائنات (الكون)، جب حق (الحق) اس کی زبان ہو، جیسا کہ وہ اس کی سماعت، بصارت اور ہاتھ ہوتا ہے۔ تو اسے راحت ملتی ہے کیونکہ اس نے دیکھا کہ اسے وہ ذات یاد کر رہی ہے جو جانتی ہے کہ اسے کیسے یاد کرنا ہے، کیونکہ وہ خود اپنے بندے کی زبان سے ذاکر ہے۔ پس اسے اس وقت راحت ملی، اور اس نے اپنے سوا کسی اور کو اس کا ذکر کرنے والا نہ دیکھا۔\n\n### [رسول اور اکابر اولیاء کی غیرت]\n\nاور جہاں تک رسول صلی اللہ علیہ وسلم اور اکابر اولیاء کی غیرت کا تعلق ہے، تو ان کی غیرت اللہ کے لیے ہے، جیسا کہ ہم نے کہا، اور یہ غیرتِ ادب ہے۔ اور غیرت اس چیز کو چھپانا ہے جسے چھپانا ضروری ہے، اس لیے کہ اگر وہ ایسے شخص کے سامنے ظاہر ہو جائے جو اس کی قدر نہ جانتا ہو تو اس کی بے احترامی ہو گی۔ جیسا کہ اللہ تعالیٰ نے فرمایا: **وما قَدَرُوا الله حَقَّ قَدْرِهِ** (اور انہوں نے اللہ کی قدر نہیں کی جیسا کہ اس کی قدر کرنے کا حق تھا)۔ پس ایسی چیز کو چھپانا غیرت میں سے ہے۔ اور الٰہی غیرت (الغيرة الإلهية) میں سے یہ ہے کہ وہ اپنے خاص بندوں کو اپنی حفاظت کے پردے میں چھپا دیتا ہے، تاکہ وہ پہچانے نہ جائیں۔ اور یہ مخلوق پر رحمت ہے۔ کیونکہ اگر اللہ تعالیٰ ان کے مقام اور بلند مرتبے کو اس شخص پر ظاہر کر دیتا جس کے بارے میں وہ جانتا ہے کہ وہ لازماً اس مقرب و منتخب بندے کے حق میں تکلیف پہنچائے گا، اور پھر اس نے اس کے حق میں وہ تکلیف پہنچائی، تو یہ جنابِ الٰہی کی بے احترامی ہوتی، کیونکہ اس نے اس چیز کی تعظیم نہیں کی جسے اللہ نے عظیم بنایا۔ پس اللہ نے انہیں لوگوں کے علم سے چھپا دیا، چنانچہ انہوں نے ان کی بے احترامی کی اور انہیں تکلیف پہنچائی، اپنی جہالت کی وجہ سے نہ کہ علم کی وجہ سے۔ اور یہ سب اللہ کی تقدیر میں تھا۔ اسی لیے تم اس شخص سے پوچھو جس نے کسی نبی یا صدیق جیسے مقرب بندے کو تکلیف پہنچائی، اور تم اس سے بغیر تعین کے پوچھو کہ تمہارے دل میں اللہ کے اولیاء کے بارے میں کیا ہے؟ تو تم پاؤ گے کہ اس کے دل میں ان کے لیے حرمت ہے، ان کے ذکر سے برکت حاصل کرنا ہے، اور اگر وہ انہیں پا لے تو ان کے قدموں تلے عاجزی کرنا ہے۔ لیکن جب تم اسے بتاؤ کہ یہ شخص ان میں سے ہے، حالانکہ وہ واقعی ان میں سے ہے، تو وہ اس کی تصدیق نہیں کرے گا، اگرچہ تم اس کے پاس کوئی معجزانہ امر لے آؤ۔ اور ہر آیت اسے یہ یقین نہیں دلا سکتی کہ یہ آیت ہے، اور نہ ہی اسے علم عطا کر سکتی ہے۔ پس اس نے صرف جہالت کی وجہ سے تکلیف پہنچائی، نہ کہ علم کی وجہ سے۔\n\n### [ذات حق (الحق) کی غیرت میں سے یہ ہے کہ وہ مخلوق کو اپنے اور اپنے خاص بندوں کے علم سے پردہ میں رکھتا ہے]\n\nجو کچھ ہم نے ذکر کیا ہے اس کی تائید اس بات سے ہوتی ہے کہ اگر کوئی شخص کسی کے بارے میں اچھا گمان رکھے اور یہ خیال کرے کہ وہ اللہ کے اولیاء میں سے ہے، حالانکہ حقیقت میں ایسا نہیں ہے، تو وہ اس کی تعظیم اور احترام کرے گا۔ یہ ہر مخلوق کی فطرت میں ہے۔ پس کسی نے بھی اللہ کے اولیاء کے حق میں اللہ کی حرمت کو پامال کرنے کا ارادہ نہیں کیا۔ اور یہ ذات حق (الحق) کی غیرت میں سے ہے۔ اگر تم کہو کہ انہوں نے اللہ کو تکلیف پہنچائی، حالانکہ وہ جانتے تھے کہ وہ اللہ ہے، تو ہم اس کا جواب یہ دیں گے کہ انہیں یہ علم نہیں تھا کہ یہ تکلیف ہے، اور انہوں نے تاویل کی اور حقیقت میں غلطی کی، اس شبہ کی وجہ سے جو ان کے لیے قائم ہوا اور انہوں نے اسے دلیل سمجھا، حالانآنکہ حقیقت میں وہ ایسا نہیں تھا۔ اور یہ تمام امور اللہ کی طرف سے اپنے بندوں میں مقدر ہیں، جن کا وقوع ضروری ہے۔ پس اس کی غیرت میں سے یہ ہے کہ وہ انہیں اپنے اور اپنے خاص بندوں کے علم سے پردہ میں رکھتا ہے۔ پس جنابِ الٰہی اور اہل اللہ علی الاطلاق قابل احترام ہیں، جب تک کہ تعین نہ کیا جائے یا تاویل نہ کی جائے۔ پس یہ جان لو۔",
    "fa": "(باب صد و پنجاهم در معرفت مقام غیرت که همان پوشش (الستر) و اسرار آن است)\n\nچقدر غیرت در جهان شگفت‌انگیز است،\nو وصف خداوند به آن شگفت‌انگیزتر.\n\nو اینکه می‌گوییم خداوند بر آنچه\nشریعت مقرر کرده و ما بدان معتقدیم، غیور است.\n\nما آن را پذیرفته‌ایم، اما این از دشوارترین\nاموری است که به او نسبت داده می‌شود.\n\nو از منظر افکار ما، این فرض محالی است\nکه عین آن برپا می‌شود.\n\nو کشف (الکشف) در گفتار خود مانند شریعت است،\nو شأن پروردگار کشف (الکشف) پوشیده نمی‌ماند.\n\nو این امر حق است و شگفتی‌ای است\nکه عقل‌ها از درک آن می‌گریزند.\n\nشبلی در حکم خود قرار داده\nکه غیرت حکمی دارد، و این دشوارتر است.\n\nو او در علم ما از اهل کشف (الکشف) است،\nمثالی زده که نزد ما ضرب‌المثل است.\n\nو نزد اهل فکر، در گمان خود،\nبر اساس آنچه مذهب به آنان می‌دهد (چنین است).\n\nکه آن (غیرت) از عالم لغزش است\nو به حکم نابینایی نزدیک‌تر است.\n\n### [غیرت الهی را ایمان ثابت کرده است، اما با ابزاری مخصوص]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که غیرت صفتی الهی است.\n\nدر خبر آمده است که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) درباره سعد فرمود: «سعد بسیار غیور است و من از سعد غیورترم و خداوند از من غیورتر است، و از غیرت اوست که فواحش را حرام کرده است.»\n\nدر این حدیث مسئله‌ای عظیم میان اشاعره و معتزله وجود دارد و آن حدیثی صحیح است. پس ایمان، غیرت را ثابت کرده است، اما با ابزاری مخصوص؛ و آن «لام اجلیه» (لام به معنای برای) یا «مِن» (از) یا «باء» (به وسیله) است. و با ابزار «عَلی» (بر) محال است، که این همان چیزی است که از شبلی سر زد؛ یا اشتباهی بود یا پیش از آنکه خداوند را به معرفت (المعرفة) عارفان بشناسد. پس غیرت در راه حق (الحق)، غیرت «لله» (برای خدا)، یا «بالله» (به وسیله خدا)، یا «من أجل الله» (به خاطر خدا) است، و غیرت «علی الله» (بر خدا) محال است.\n\n### [از کمال عالم وجود نقص اضافی در آن است]\n\nپس تحقق اینکه غیرت صفتی الهی است، صفتی است که غیر را می‌طلبد و به همین دلیل غیرت نامیده شده است. اگر ملاحظه غیر نبود، غیرت نامیده نمی‌شد و وجود نمی‌یافت. پس معبود قادر، مألوه مقدور را می‌طلبد که همان غیر است. بنابراین، وجود آنچه که می‌طلبد، ضروری است، مگر اینکه وجودش برای او باشد. پس عالم را بر کامل‌ترین وجه هستی (الوجود) ایجاد کرد، زیرا محال است که نقص به کاملِ اقتدار نسبت داده شود. به همین دلیل فرمود: **أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ** (به هر چیزی آفرینش [شایسته] آن را داد) [طه: ۵۰] و آن همان کمال است. اگر نقص در عالم وجود نمی‌یافت، عالم کامل نمی‌شد. پس از کمال عالم، وجود نقص اضافی در آن است. به همین دلیل گفتیم که عالم بر کامل‌ترین صورت موجود شد، به طوری که کامل‌تر از آن در امکان باقی نماند، زیرا بر صورت الهی است.\n\nدر خبر آمده است که: «خداوند آدم را بر صورت خود آفرید.»\n\nپس به دلیل این صورت، در توان انسان بود که بندگی خود را فراموش کند، و به همین دلیل انسان به نسیان (فراموشی) وصف شده است. درباره آدم فرمود: **فَنَسِيَ** (پس فراموش کرد) [طه: ۱۱۵]. و نسیان صفتی الهی است. او فراموش نکرد مگر به دلیل اینکه بر صورت الهی بود. ما همچنان در همان وضعیتی هستیم که بودیم. خداوند متعال می‌فرماید: **نَسُوا الله فَنَسِيَهُمْ** (خدا را فراموش کردند، پس او نیز آنان را فراموش کرد) [توبه: ۶۷]، آن‌گونه که شایسته جلال اوست.\n\n### [بنده کامل‌شده به واسطه صورت و ادعای ربوبیت]\n\nپس چون حق (الحق) دانست که این بنده، به واسطه نیروی الهی و صورت کمالی که خداوند او را بدان کامل کرده است، ناگزیر است در صفاتی که حق خداوند است، ادعایی داشته باشد، به دلیل طلب صورت کمالی آن صفت که خود از برخی صفات الهی است؛ حق (الحق) از مشارکت در برخی صفات جلال غیرت ورزید و انسان را به آنچه از باقی صفات الهی برایش مباح کرده بود، مشغول ساخت. و چون همچنین دانست که او به همین حد بسنده نمی‌کند و ناگزیر است حق صورت کمالی را در متصف شدن به صفات الهی ادا کند و از آنچه بر او ممنوع شده است، مانند عظمت، کبریا و جبروت، فراتر رود.\n\nفرمود: «کبریا ردای من است و عظمت ازار (لنگ) من؛ هر کس در یکی از آن دو با من ستیزه کند، او را درهم می‌شکنم.»\n\nو فرمود: **كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ** (این‌گونه خداوند بر هر دل متکبر و زورگویی مُهر می‌نهد) [غافر: ۳۵]. پس این عین غیرت است. بر این صفات غیرت ورزید که مبادا برای غیر خدا باشند، پس آن‌ها را ممنوع ساخت. و همچنین این صفات بر حقیقت (الحقیقة) ممنوع شدند به واسطه این قول او: **كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ**. پس با این مُهر، کبریا و جبروت بر قلب هیچ موجودی از موجودات که بر خدا تکبر ورزد، وارد نمی‌شود، به خاطر این مُهر.\n\n### [معنای مُهری که خداوند بر قلب متکبر زورگو نهاده است]\n\nپس هر کس از مخلوقات که ادعای الوهیت کرد، مانند فرعون و دیگران، و تکبر و تجبر ورزید، همه این‌ها در ظاهر عالم (الکون) است. و این کسی که صفت کبریا از او ظاهر شده، بر قلبش مُهر زده شده است که کبریا بر خدا در آن وارد نشود. زیرا او از درون خود فقر و نیاز و تحمل دردها را می‌داند؛ از درد گرسنگی و تشنگی و هوا و بیماری که این نشئه حیوانی در این دنیا از آن خالی نیست، و نیز ناتوانی برخی مقاصد از رسیدن به مراد و رنج کشیدن او به خاطر آن. و کسی که صفتش این باشد، محال است که در درون خود بر پروردگارش تکبر ورزد. پس این معنای مُهری است که خداوند بر قلب متکبری زده که ادعای زورگویی (الجبار) از او برای شما ظاهر می‌شود و شما را بر آنچه می‌خواهد مجبور می‌کند؛ پس برخی از شما مطیع و برخی مخالف‌اند، هرچند به سبب مخالفتش هلاک شود. و به همین دلیل است که حکم سعادت در نهایت امر، هرچند پس از مدتی، امید می‌رود؛ زیرا کبریا بر خدا وارد قلب‌ها نمی‌شود، بلکه کبریا برخی از آن‌ها بر برخی دیگر وارد می‌شود. خداوند متعال می‌فرماید: **لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ** (آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است) [غافر: ۵۷]. و چون آسمان دانست که از آفرینش مردم بزرگ‌تر است، به کبریا بر مردم وصف شد، و آن کبریا در آن عیبی ایجاد نمی‌کند. پس این معنای غیرت الهی است. هیچ‌کس نمی‌تواند آنچه را که او ممنوع کرده، بردارد. پس هیچ‌یک از خلق خدا در آنچه میان او و خداست، بر خدا تکبر نمی‌ورزد؛ وقوع این محال است. و آن مقداری که تحجیر (ممنوعیت) ظاهری بر آن واقع شده، مذمت بر کسی واقع شده که آن را هتک کرده و به خود نسبت داده و در آن بر خدا دروغ بسته‌اند.\n\n### [غیرت برای خدا، و به خاطر خدا، و به وسیله خدا، و بر خدا]\n\nو اما غیرت «لله» (برای خدا)، و «من أجل الله» (به خاطر خدا)، و «بالله» (به وسیله خدا)، آن است که انسان ببیند آنچه را که حق (الحق) حد گذاشته، خلق از آن تجاوز می‌کنند، پس صفت غیرت برای خدا در او برپا شود، نه برای نفس خود، و به خاطر خدا، نه به خاطر نفس خود؛ زیرا می‌داند که خلق بندگان خدا هستند و از حکم بنده این است که از حدی که مولایش برای او ترسیم کرده، تجاوز نکند. و اما اینکه «علی الله» (بر خدا) غیرت ورزد، غیرت پوششی است که مغار علیه (کسی که بر او غیرت ورزیده می‌شود) را می‌پوشاند تا جز نزد او نباشد. و راه خدا بر این بنا شده است که خلق را به سوی خدا دعوت کنیم و آنان را به او بازگردانیم و او را محبوب آنان سازیم و آنان را به او و جایگاهش بشناسانیم، و به این امر شده‌ایم. و غیرت کونی از همه این‌ها سر باز می‌زند، به دلیل جهلش به مغار علیه که شایسته غیرت ورزیدن بر او نیست. و اگر نبود که در میان کسانی که خود را به خدا نسبت می‌دهند، کسانی یافت می‌شوند که برخی از آنچه شایسته خداست را نمی‌دانند و قصد خیر دارند اما راه آن را نمی‌دانند، ما جهل این گوینده به غیرت «علی الله» را ذکر می‌کردیم. اما همین تذکر ما کافی است که این صحیح نیست، بلکه غیرت «لله» (برای خدا) بر امثال این افراد با غیرت «علی الله» (بر خدا) مشتبه شده است و فرق میان آن دو را ندانسته‌اند.\n\n### [آنچه قشیری در باب غیرت ذکر کرده و از غیرت نیست]\n\nقشیری در رساله خود در باب غیرت از برخی نقل کرده که به او گفته شد: «چه زمانی آسوده می‌شوی؟» گفت: «زمانی که هیچ ذاکری برای او نبینم.» و این غیرت نیست. قشیری اشتباه کرده که چنین مطلبی را در باب غیرت کتاب خود آورده است. و گمان کرده که شبلی در حال دیدن ذاکرانی که خدا را با غفلت و بدون حرمت یاد می‌کنند، مانند کسی که او را با سخنان بیهوده و ایمان‌های فاجر یاد می‌کند و ذکر خدا را در طلب معاش در بازارها می‌گوید، غیرت ورزیده که مبادا او با این صفت یاد شود، زیرا حق حرمت مذکور (خداوند) هنگام ذکر ادا نشده است. و بعید نیست که قصد شبلی در ابتدای امر و در زمان حجابش از معرفت (المعرفة) پروردگارش همین بوده باشد. اما با معرفت (المعرفة)، این سخن (یعنی: «اگر ذاکری برای او نبینم») صحیح نیست. و معنای آن نزد ما در حق بزرگان عارفان این است که ذکر با مشاهده همراه نیست. پس ذاکر ناگزیر باید محجوب باشد، هرچند خداوند همنشین ذاکر است، اما از پس حجاب ذکر. و هر کس که پشت حجابی از مطلوب خود باشد، آسایشی ندارد. پس چون حجاب برداشته شود، مشاهده واقع می‌شود و ذکر با تجلی (التجلی) مذکور زائل می‌گردد. به همین دلیل گفت: «تنها زمانی آسوده می‌شوم که ذاکری برای او نبینم.» پس او خواسته است که مشاهده‌اش او را از درک ذاکرین بازدارد، یا آرزو کرده است که ذاکرین در مقام شهود (الشهود) باشند که آنان را از ذکر بازمی‌دارد؛ زیرا مؤمن آنچه را برای خود دوست دارد، برای برادرش نیز دوست دارد. بر این اساس، اگر این مرد از عارفان باشد، سخن او توجیه می‌شود. و بر ذوقی دیگر، این است که او آسوده نمی‌شود مگر زمانی که ببیند ذاکر خود خداست، نه عالم (الکون)، آنگاه که حق (الحق) زبان او باشد، همان‌گونه که گوش و چشم و دست اوست. پس آسوده می‌شود، زیرا دیده است کسی او را یاد کرده که می‌داند چگونه او را یاد کند، چرا که او خود ذاکر خویش با زبان بنده خود بوده است. پس در آن هنگام آسوده شد و ذاکری جز او ندید.\n\n### [غیرت رسول و بزرگان اولیا]\n\nو اما غیرت رسول (صَلَّى اللهُ عَليهِ وسَلَّم) و بزرگان اولیا، غیرت آنان «لله» (برای خدا) است، همان‌گونه که گفتیم، و آن غیرت ادب است. و غیرت، پنهان کردن چیزی است که باید پنهان شود، به دلیل عدم احترام آن در صورتی که نزد کسی ظاهر شود که قدر آن را نمی‌داند، چنانکه خداوند متعال می‌فرماید: **وما قَدَرُوا الله حَقَّ قَدْرِهِ** (و خدا را آن‌گونه که شایسته قدر اوست، نشناختند) [انعام: ۹۱]. پس پوشاندن چنین چیزی از غیرت است. و از غیرت الهی، پوشاندن خاصان او از اهل خصوص در کنف حمایت اوست تا شناخته نشوند. و این رحمتی است بر خلق؛ زیرا اگر خداوند متعال جایگاه و مرتبه والای آنان را برای کسی آشکار می‌ساخت که می‌دانست ناگزیر است به دست او آزاری در حق این مقرب برگزیده جاری شود، و سپس آن آزار در حق او جاری می‌شد، این بی‌احترامی به ساحت الهی بود، زیرا آنچه را خدا بزرگ داشته، بزرگ نداشته است. پس آنان را از علم به ایشان پوشاند، در نتیجه به دلیل جهلشان به آنان، احترامشان نکردند و آزارشان دادند، و این همان چیزی است که خداوند مقدر کرده است. به همین دلیل، از کسی که آن بنده مقرب، اعم از پیامبر یا صدیق، را آزار داده است، بدون تعیین شخص، می‌پرسی: «درباره اولیای خدا چه نظری داری؟» در او حرمت و تبرک جستن به ذکر آنان و خضوع زیر پایشان را می‌یابی، اگر آنان را بیابد. اما اگر به او بگویی: «این شخص از آنان است»، و او واقعاً از آنان باشد، تصدیقی در او ایجاد نمی‌شود، حتی اگر امر معجزه‌آسا و هر نشانه‌ای برایش بیاوری، نمی‌تواند باور کند که آن نشانه است و به او علم نمی‌دهد. پس او آزار نداده مگر از روی جهل، نه از روی علم.\n\n### [از غیرت حق پوشاندن خلق از علم به او و به خاصان از بندگان اوست]\n\nآنچه ذکر کردیم را این امر تأیید می‌کند که اگر کسی به شخصی گمان نیک ببرد و تصور کند که او از اولیای خداست، در حالی که در واقع چنین نیست، او را بزرگ می‌دارد و احترام می‌کند. این در فطرت هر مخلوقی است. پس هیچ‌کس قصد هتک حرمت خدا در اولیای او را نداشته است، و این از غیرت حق (الحق) است. اگر بگویی: «پس آنان خدا را آزار دادند، با اینکه می‌دانستند او خداست»، در پاسخ می‌گوییم: آنان ندانستند که آن آزار است، و تأویل کردند و در واقع امر به دلیل شبهه‌ای که برایشان پیش آمد و گمان کردند که دلیل است، در حالی که در واقع چنین نیست، خطا کردند. و این‌ها همه اموری مقدر از جانب حق (الحق) در حق بندگانش است که ناگزیر باید واقع شوند. پس از غیرت اوست که آنان را از علم به خود و به خاصان از بندگانش پوشانده است. پس ساحت خداوند و اهل خدا به طور مطلق محترم‌اند، مگر اینکه شخصی را تعیین کنی یا تأویل نمایی. پس این را بدان."
  },
  "page_count": 3
}