{
  "id": 540,
  "title": {
    "ar": "الباب الموفي أربعين وخمسمائة في معرفة حال قطب كان منزله ولَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكانَ خَيْراً لَهُمْ",
    "en": "Chapter Five Hundred and Forty: Concerning the knowledge of the state of a Pole (*Qutb*) whose station (*manzil*) was: <<وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَهُمْ>> (And if they had been patient until you came out to them, it would have been better for them).",
    "ur": "باب نمبر پانچ سو چالیس: ایک قطب (قطب) کے حال کی معرفت میں جس کا روحانی مقام یہ تھا: وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكانَ خَيْراً لَهُمْ (اور اگر وہ صبر کرتے یہاں تک کہ آپ ان کے پاس خود باہر تشریف لاتے تو یہ ان کے لیے بہتر ہوتا۔) (سورۃ الحجرات ۴۹: آیت ۵)",
    "fa": "باب پانصد و چهلم در معرفت حال قطبی که منزل او این آیه بود: «و اگر صبر می‌کردند تا تو به سوی ایشان بیرون آیی، قطعاً برایشان بهتر بود» (وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكانَ خَيْراً لَهُمْ)."
  },
  "content": {
    "ar": "## «الباب الموفي أربعين وخمسمائة في معرفة حال قطب كان منزله ولَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكانَ خَيْراً لَهُمْ»\n\n\n> اركن إلى الله لا تركن إلى السبب *** واجنح إلى السلم لا تجنح إلى الحرب‏\n\n\n> فانظر إلى كل ما في الكون من عجب *** يأتيك سهلا بلا كد ولا نصب‏\n\n\n> إذا اعتمدت على الرحمن فيه فكن *** في كل حال مع الرحمن في السبب‏\n\n\n> فكن به لا تكن فيه بكم فترى *** ما شئت من صور فيه ومن سبب‏\n\n\n> فإن دعاك إلى ما أنت تجهله *** فلا تجبه فإن العلم في النسب‏\n> ولا تنازع وكن بالله معتصما *** ولا تحارب فخيل الله في الطلب‏\n\n\n### [معية الله مع العبد]\n\n\nقال الله جل ثناؤه وتقدست أسماؤه إِنَّ الله مَعَ الصَّابِرِينَ والمدار كله على شهود هذه المعية فإنه مَعَ الَّذِينَ اتَّقَوْا والَّذِينَ هُمْ مُحْسِنُونَ فهو مع الصابرين والمتقين والمحسنين فهذا الذكر ينتج شهود المعية التي له مع الصابرين خاصة هذا وما هو إلا صبر على الرسول حتى يخرج إليهم فكيف الصبر على الله لما كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يذكر الله على كل أحيانه والله جليس من يذكره فلم يزل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم جليس الحق دائما فمن جاء إليه صَلَّى اللهُ عَليهِ وسَلَّم فإنما يخرج إليه من عند ربه إما مبشرا وإما موصيا ناصحا ولهذا قال لَكانَ خَيْراً لَهُمْ فلو كان خروجه إليهم مما يسوءهم في آخرتهم ما كان خيرا لهم وقد شهد الله بالخيرية فلا بد منها وهي على ما ذكرناه من بشارة بخير أو وصية ونصيحة وإبانة عن أمر مقرب إلى سعادتهم غير ذلك لا يكون ومن صبر نفسه على ما شرع الله له على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم فإن الله لا بد أن يخرج إليه رسوله صَلَّى اللهُ عَليهِ وسَلَّم في مبشرة يراها أو في كشف بما يكون له عند الله من الخير وإنما يخرج الله إليه رسوله صَلَّى اللهُ عَليهِ وسَلَّم لأن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لا يتصور على صورته غيره فمن رآه رآه لا شك فيه بخلاف رؤية الحق فإن الحق له التجلي في صور الأشياء كلها فإن الأشياء ما ظهرت إلا به سبحانه وتعالى فالعارف يعلم أن كل شي‏ء يراه ليس إلا الحق وهو معطي السعادة والشقاء والرسول ليس كذلك فيعتمد على رؤية الرسول ولا يغتر برؤية الحق ولهذا الذي أشرنا إليه ادعى من ادعى من البشر والجن الألوهة وقبل منهم وعبدوا من دون الله وما قدر أحد يدعى بأنه محمد بن عبد الله رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وأن تنبى فما يقول إنه محمد وإنما يقول إنه رسول الله فيطالب بالدليل على دعواه فتنبه إلى عصمة هذا الاسم العلم أن يتصور عليه أحد من خلق الله في كشف ولا نوم كصورته في اليقظة سواء فمن رآه رآه فما تغير من صورته تغير حسن فذلك راجع إلى حال الرائي أو صورة الشرع في المكان الذي رآه فيه عند ولاة أمور الناس وكذلك لو كان تغير قبح كذلك فاعلم ذلك فيكون تغيره بالحسن والقبح عين إعلامه وخطابه إياه بما هو الأمر عليه في حقه أو في حق ولاة العصر بالموضع الذي يراه فيه ورؤية الحق ليست كذلك لأنه ما ثم شي‏ء خارج عنه فكل شي‏ء فيه حسن لا قبح فيه وما قبح من الأمور إلا بالشرع وفي أصحاب الأغراض بالعرض وفي أصحاب المزاج بالملاءمة للطبع وفي أصحاب النظر الفكري من الحكماء بالكمال والنقص وصاحب هذا الهجير كثير الصلاة على محمد صَلَّى اللهُ عَليهِ وسَلَّم وعلى هذا الذكر يحبس نفسه ويصبر حتى يخرج إليه صَلَّى اللهُ عَليهِ وسَلَّم وما لقيت أحدا على هذا القدم غير رجل كبير حداد بإشبيلية كان يعرف بأللهم صل على محمد ما كان يعرف بغير هذا الاسم رأيته ودعا لي وانتفعت به لم يزل مستهترا بالصلاة على محمد صَلَّى اللهُ عَليهِ وسَلَّم لا يتفرغ لكلام أحد إلا قدر الحاجة إذا جاء أحد يطلبه أن يعمل له شيئا من الحديد فيشارطه على ذلك ولا يزيد وما وقف عليه أحد من رجل ولا صبي ولا امرأة إلا ولا بد أن يصلي على محمد ذلك الواقف إلى أن ينصرف من عنده وهو مشهور بالبلد بذلك وكان من أهل الله فكل ما ينتج لصاحب هذا الذكر فإنه علم حق معصوم فإنه لا يأتيه شي‏ء من ذلك إلا بواسطة الرسول صَلَّى اللهُ عَليهِ وسَلَّم هو المتجلي له والمخبر لقي رجل بعض الناس في زمان أبي يزيد البسطامي فقال له هل رأيت أبا يزيد فقال رأيت الله فأغناني عن أبي يزيد فقال له الرجل لو رأيت أبا يزيد مرة كان خيرا لك من أن ترى الله ألف مرة فلما سمع ذلك منه رحل إليه فقعد مع الرجل على طريقه فعبر أبو يزيد وفروته على كتفه فقال له الرجل هذا أبو يزيد فنظر إليه فمات من ساعته فأخبر الرجل أبا يزيد بشأن الرجل فقال أبو يزيد كان يرى الله على قدره فلما أبصرنا تجلى له الحق على قدرنا فلم يطق فمات ولما كان الأمر هكذا علمنا إن رؤيتنا الله في الصورة المحمدية بالرؤية المحمدية هي أتم رؤية تكون فما زلنا نحرض الناس عليها مشافهة وفي كتابنا هذا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 540: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was [the Verse]: <<And if they had patience until you came out to them, it would have been better for them>>\n\n> Rely upon Allah, do not rely upon the means (السبب),\n>\n> And incline toward peace (السلم), do not incline toward war (الحرب).\n>\n> Look at all the wonders (عجب) in the cosmos (الكون),\n>\n> It comes to you easily, without toil or fatigue.\n>\n> If you depend upon the All-Merciful (الرحمن) in it, then be,\n>\n> In every state, with the All-Merciful in the means (السبب).\n>\n> Be *by* Him, do not be *in* Him blindly, so that you may see\n>\n> Whatever you wish of forms and means (سبب) within Him.\n>\n> If He calls you to what you are ignorant of,\n>\n> Do not answer Him, for Knowledge (العلم) is in the relationship (النسب).\n>\n> Do not dispute, and be protected (معتصما) by Allah,\n>\n> Do not fight, for the cavalry of Allah is in the seeking (الطلب).\n\n### [Allah’s Companionship (معية) with the Servant]\n\nAllah, exalted is His praise and sanctified are His Names, said: <<Indeed, Allah is with the patient>>. The entire focus is upon witnessing (شهود) this Companionship (معية), for He is <<with those who fear [Him] and those who are doers of good (محسنون)>>. Thus, He is with the patient, the God-fearing, and the doers of good. This remembrance (الذكر) results in the witnessing of the Companionship that He has specifically with the patient. This [patience] is nothing but patience for the Messenger until he comes out to them. So, how great must be the patience for Allah?\n\nSince the Messenger of Allah (may Allah bless him and grant him peace) remembered Allah in all his states, and Allah is the Companion (جليس) of whoever remembers Him, the Messenger of Allah (may Allah bless him and grant him peace) was perpetually the Companion of the Real (جليس الحق). Therefore, whoever came to him (may Allah bless him and grant him peace), he only came out to them from the presence of his Lord, either as a bearer of good tidings (مبشرا) or as an advisor and counselor (موصيا ناصحا). This is why [the verse] said: <<it would have been better for them>>.\n\nIf his coming out to them were something that would harm them in their Hereafter, it would not have been better for them. Since Allah testified to its goodness (الخيرية), it must necessarily occur, and it is as we mentioned: good tidings, or advice and counsel, or clarification of a matter that brings them closer to their felicity (سعادتهم)—nothing else can be the case. Whoever disciplines his soul (صبر نفسه) upon what Allah has legislated for him through the tongue of His Messenger (may Allah bless him and grant him peace), Allah will inevitably send His Messenger (may Allah bless him and grant him peace) out to him, either in a vision of good tidings that he sees, or in an Unveiling (كشف) concerning the good that awaits him with Allah.\n\nAllah only sends His Messenger (may Allah bless him and grant him peace) out to him because no one else can take the form (صورته) of the Messenger of Allah (may Allah bless him and grant him peace). Whoever sees him, sees him, without doubt. This is unlike the vision of the Real (رؤية الحق), for the Real (الحق) has Theophany (التجلي) in the forms of all things, since things only appeared through Him, glory and transcendence be to Him.\n\nThe Gnostic (العارف) knows that everything he sees is none other than the Real (الحق), and He is the Giver of felicity and wretchedness. The Messenger is not like that. Therefore, one relies upon the vision of the Messenger and is not deceived by the vision of the Real. Because of what we have indicated, some humans and jinn claimed divinity (الألوهة), and this was accepted from them, and they were worshipped besides Allah. Yet, no one has ever been able to claim to be Muhammad ibn Abdullah, the Messenger of Allah (may Allah bless him and grant him peace), even if he claimed prophethood. He does not say he is Muhammad; rather, he says he is a Messenger of Allah, and is then asked for proof of his claim. Pay attention to the infallibility (عصمة) of this proper name (الاسم العلم): that none of Allah’s creation can take his form (صورته) in an Unveiling (كشف) or in sleep exactly as his form is in wakefulness. Whoever sees him, sees him. Any change in his form that is a change for the better is due to the state of the viewer, or the form of the Law (الشرع) in the place where he saw him, in relation to the rulers of the people. Likewise, if the change is for the worse, know that this is also the case.\n\nThus, his change, whether for the better or the worse, is precisely his informing and addressing the viewer concerning the state of affairs regarding the viewer himself, or regarding the rulers of the age in the location where he is seen. The vision of the Real (رؤية الحق) is not like this, because there is nothing outside of Him. Everything in Him is beautiful (حسن) and contains no ugliness (قبح). Things are only deemed ugly by the Law (الشرع), or, for those with specific aims, by accident (بالعرض), or, for those with temperaments (المزاج), by incompatibility with nature (الطبع), or, for those who rely on intellectual speculation (النظر الفكري) among the philosophers (الحكماء), by perfection and deficiency.\n\nThe master of this path (الهجير) frequently invokes blessings upon Muhammad (may Allah bless him and grant him peace). He restrains his soul and remains patient upon this remembrance (الذكر) until [the Messenger] (may Allah bless him and grant him peace) comes out to him. I have not met anyone upon this spiritual footing (قدم) except for an elderly blacksmith in Seville who was known as \"O Allah, bless Muhammad.\" He was not known by any other name. I saw him, and he prayed for me, and I benefited from him. He was constantly absorbed (مستهترا) in invoking blessings upon Muhammad (may Allah bless him and grant him peace). He would not spare time to speak to anyone except for what was necessary when someone came asking him to make something out of iron; he would agree on the price and nothing more. No one—man, boy, or woman—stood before him without that person necessarily invoking blessings upon Muhammad until they departed from his presence. He was famous in the city for this and was one of the People of Allah (أهل الله). Everything that results for the practitioner of this remembrance is infallible, true Knowledge (علم حق معصوم), for nothing of it comes to him except through the mediation (بواسطة) of the Messenger (may Allah bless him and grant him peace), who is the one making the Theophany (المتجلي) and the one informing him.\n\nA man met someone during the time of Abu Yazid al-Bistami and asked him, \"Have you seen Abu Yazid?\" The man replied, \"I have seen Allah, and that has made me independent of Abu Yazid.\" The first man said to him, \"If you had seen Abu Yazid once, it would have been better for you than seeing Allah a thousand times.\" When the man heard this, he traveled to [Abu Yazid]. He sat with the first man on the road. Abu Yazid passed by, with his fur cloak (فروته) over his shoulder. The man said to him, \"This is Abu Yazid.\" [The traveler] looked at him and died instantly. The first man informed Abu Yazid about the traveler. Abu Yazid said, \"He used to see Allah according to his own capacity (قدره). When he saw us, the Real (الحق) manifested (تجلى) to him according to our capacity, and he could not bear it, so he died.\" Since the matter is thus, we know that our vision of Allah in the Muhammadan Form (الصورة المحمدية), through the Muhammadan Vision (الرؤية المحمدية), is the most perfect vision possible. We have continuously encouraged people toward it, both orally and in this book of ours. <<And Allah speaks the Truth, and He guides to the way.>>",
    "ur": "باب نمبر ۵۴۰: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور اگر وہ صبر کرتے یہاں تک کہ آپ ان کے پاس خود تشریف لاتے، تو یہ ان کے لیے بہتر ہوتا۔\"\n\nاللہ پر بھروسہ کر، سبب پر بھروسہ نہ کر\nاور صلح کی طرف مائل ہو، جنگ کی طرف مائل نہ ہو\n\nپس کائنات میں موجود ہر عجوبے کو دیکھ\nوہ تیرے پاس آسانی سے آئے گا، بغیر کسی مشقت یا تھکاوٹ کے\n\nجب تو اس میں رحمن پر بھروسہ کرے\nتو ہر حال میں سبب میں بھی رحمن کے ساتھ رہ\n\nپس تو اس (اللہ) کے ذریعے ہو، اس (سبب) میں اپنی ذات سے نہ ہو، تاکہ تو دیکھے\nجو تو چاہے اس میں سے صورتیں اور اس میں سے سبب\n\nپس اگر وہ تجھے اس چیز کی طرف بلائے جسے تو نہیں جانتا\nتو اسے جواب نہ دے، کیونکہ علم تو نسبت (رابطے) میں ہے\n\nاور جھگڑا نہ کر، اور اللہ کے ساتھ مضبوطی سے وابستہ رہ\nاور جنگ نہ کر، کیونکہ اللہ کے گھوڑے (مدد) طلب میں ہیں\n\n[بندے کے ساتھ اللہ کی معیت (معية الله مع العبد)]\n\nاللہ جل شانہ اور تقدست اسمائے حسنیٰ نے فرمایا: إِنَّ الله مَعَ الصَّابِرِينَ (بے شک اللہ صبر کرنے والوں کے ساتھ ہے)۔ اور سارا دار و مدار اسی معیت (معية) کے شہود (الشهود) پر ہے۔ کیونکہ وہ مَعَ الَّذِينَ اتَّقَوْا والَّذِينَ هُمْ مُحْسِنُونَ (ان لوگوں کے ساتھ ہے جنہوں نے تقویٰ اختیار کیا اور جو احسان کرنے والے ہیں)۔ پس وہ صبر کرنے والوں، متقیوں اور احسان کرنے والوں کے ساتھ ہے۔ یہ ذکر خاص طور پر اس معیت (معية) کے شہود (الشهود) کو پیدا کرتا ہے جو اللہ کو صبر کرنے والوں کے ساتھ خاص طور پر حاصل ہے۔\n\nیہ (معیت) اور کچھ نہیں مگر رسول (ﷺ) پر صبر کرنا ہے یہاں تک کہ وہ ان کے پاس تشریف لائیں۔ تو اللہ پر صبر کیسا ہوگا؟ چونکہ رسول اللہ (ﷺ) ہر حال میں اللہ کا ذکر کرتے تھے اور اللہ اس کا ہم نشین ہوتا ہے جو اسے یاد کرتا ہے، لہٰذا رسول اللہ (ﷺ) ہمیشہ ذات حق (الحق) کے ہم نشین رہے۔ پس جو شخص بھی آپ (ﷺ) کے پاس آتا ہے، آپ (ﷺ) اپنے رب کے پاس سے ہی اس کی طرف تشریف لاتے ہیں، یا تو بشارت دینے والے کے طور پر، یا نصیحت کرنے والے کے طور پر۔ اور اسی لیے فرمایا: لَكانَ خَيْراً لَهُمْ (تو یہ ان کے لیے بہتر ہوتا)۔\n\nاگر آپ (ﷺ) کا ان کے پاس تشریف لانا ان کے لیے آخرت میں نقصان دہ ہوتا، تو یہ ان کے لیے بہتر نہ ہوتا۔ اور اللہ نے خیر (بھلائی) کی گواہی دی ہے، لہٰذا یہ لازمی ہے۔ اور یہ اسی طرح ہے جیسا کہ ہم نے ذکر کیا: کسی بھلائی کی بشارت، یا وصیت اور نصیحت، اور کسی ایسے امر کی وضاحت جو ان کی سعادت کے قریب لے جائے؛ اس کے علاوہ کچھ نہیں ہو سکتا۔ اور جس نے اپنے نفس کو اس چیز پر صبر کرنے کا عادی بنایا جو اللہ نے اپنے رسول (ﷺ) کی زبان پر اس کے لیے مشروع کی، تو اللہ لازماً اپنے رسول (ﷺ) کو اس کے پاس بھیجے گا، یا تو کسی ایسی بشارت میں جسے وہ دیکھے، یا کسی ایسے کشف (الکشف) میں جس میں اسے اللہ کے ہاں حاصل ہونے والی بھلائی کا علم ہو۔\n\nاور اللہ اپنے رسول (ﷺ) کو اس کے پاس اس لیے بھیجتا ہے کیونکہ رسول اللہ (ﷺ) کی صورت پر کسی اور کا تصور نہیں کیا جا سکتا۔ پس جس نے آپ کو دیکھا، اس نے آپ ہی کو دیکھا، اس میں کوئی شک نہیں۔ بخلاف ذات حق (الحق) کے دیدار کے، کیونکہ ذات حق (الحق) کے لیے تمام اشیاء کی صورتوں میں ظہور الٰہی (التجلی) ہے۔ کیونکہ اشیاء ظاہر ہی اسی (سبحانہ و تعالیٰ) کے ذریعے ہوئی ہیں۔ پس عارف (العارف) جانتا ہے کہ ہر وہ چیز جسے وہ دیکھتا ہے، وہ ذات حق (الحق) کے سوا کچھ نہیں۔ اور وہی سعادت اور شقاوت عطا کرنے والا ہے۔ اور رسول (ﷺ) کا معاملہ ایسا نہیں ہے۔\n\nلہٰذا وہ رسول (ﷺ) کے دیدار پر بھروسہ کرتا ہے اور ذات حق (الحق) کے دیدار سے دھوکہ نہیں کھاتا۔ اور اسی بات کی طرف جس کی ہم نے اشارہ کیا، اسی وجہ سے انسانوں اور جنوں میں سے بعض نے الوہیت کا دعویٰ کیا اور ان کا دعویٰ قبول کیا گیا اور اللہ کے سوا ان کی عبادت کی گئی۔ لیکن کوئی شخص یہ دعویٰ نہ کر سکا کہ وہ محمد بن عبداللہ رسول اللہ (ﷺ) ہے۔ اور اگر کسی نے نبوت کا دعویٰ کیا بھی تو وہ یہ نہیں کہتا کہ وہ محمد ہے، بلکہ وہ صرف یہ کہتا ہے کہ وہ اللہ کا رسول ہے۔ تو اس سے اس کے دعوے پر دلیل طلب کی جاتی ہے۔\n\nپس اس اسمِ علم (محمد) کی عصمت (عصمت) پر غور کر کہ اللہ کی مخلوق میں سے کوئی بھی شخص کشف (الکشف) میں یا خواب میں، آپ (ﷺ) کی بیداری کی صورت کے عین مطابق، آپ کی صورت اختیار نہیں کر سکتا۔ پس جس نے آپ کو دیکھا، اس نے آپ ہی کو دیکھا۔ پس اگر آپ کی صورت میں کوئی تبدیلی آئی جو خوبصورتی میں اضافہ ہو، تو یہ دیکھنے والے کے حال کی طرف راجع ہے، یا اس جگہ کے شرعی حکم کی طرف جہاں اس نے آپ کو دیکھا، لوگوں کے حکمرانوں کے نزدیک۔ اور اسی طرح اگر تبدیلی بدصورتی کی ہو، تو بھی یہی جان لے۔ پس آپ (ﷺ) کی خوبصورتی یا بدصورتی میں تبدیلی عین اس بات کی اطلاع اور خطاب ہوتی ہے جو اس کے حق میں یا اس جگہ کے حکمرانوں کے حق میں معاملہ درپیش ہے۔\n\nاور ذات حق (الحق) کا دیدار ایسا نہیں ہے، کیونکہ وہاں کوئی چیز اس سے باہر نہیں ہے۔ پس اس میں ہر چیز حسن ہے، اس میں کوئی قباحت نہیں۔ اور امور میں قباحت صرف شریعت کے ذریعے آئی ہے۔ اور اغراض والوں کے نزدیک یہ عارضی ہے، اور مزاج والوں کے نزدیک طبعی موافقت کی وجہ سے ہے، اور حکماء میں فکری نظر رکھنے والوں کے نزدیک کمال اور نقص کی وجہ سے ہے۔\n\nاور اس مقام کا مالک محمد (ﷺ) پر کثرت سے درود بھیجنے والا ہوتا ہے۔ اور وہ اپنے نفس کو اسی ذکر پر روکتا ہے اور صبر کرتا ہے یہاں تک کہ آپ (ﷺ) اس کے پاس تشریف لائیں۔ اور میں نے اس قدم (طریقے) پر کسی کو نہیں پایا سوائے اشبیلیہ کے ایک بوڑھے لوہار کے، جو \"اللهم صل على محمد\" (اے اللہ محمد پر درود بھیج) کے نام سے جانا جاتا تھا، وہ اس نام کے علاوہ کسی اور نام سے نہیں پہچانا جاتا تھا۔ میں نے اسے دیکھا اور اس نے میرے لیے دعا کی اور میں نے اس سے فائدہ اٹھایا۔ وہ ہمیشہ محمد (ﷺ) پر درود بھیجنے میں مستغرق رہتا تھا۔ وہ کسی کی بات سننے کے لیے فارغ نہیں ہوتا تھا مگر صرف ضرورت کے مطابق، جب کوئی شخص اس سے لوہے کا کوئی کام کروانے آتا تو وہ اس پر شرط طے کر لیتا اور اس سے زیادہ بات نہ کرتا۔ اور کوئی بھی شخص، مرد، بچہ یا عورت اس کے پاس کھڑا نہیں ہوتا تھا مگر یہ کہ وہ کھڑا ہونے والا شخص محمد (ﷺ) پر درود بھیجتا جب تک کہ وہ اس کے پاس سے چلا نہ جاتا۔ اور وہ شہر میں اسی وجہ سے مشہور تھا اور وہ اہل اللہ میں سے تھا۔\n\nپس جو کچھ بھی اس ذکر کے مالک کے لیے پیدا ہوتا ہے، وہ حق (الحق) کا معصوم (عصمت والا) علم ہوتا ہے۔ کیونکہ اسے ان میں سے کوئی چیز نہیں آتی مگر رسول (ﷺ) کے واسطے سے، جو اس کے لیے متجلی (التجلی) ہوتے ہیں اور خبر دینے والے ہوتے ہیں۔\n\nابو یزید بسطامی کے زمانے میں ایک شخص کسی دوسرے شخص سے ملا اور اس سے پوچھا: کیا تم نے ابو یزید کو دیکھا ہے؟ اس نے کہا: میں نے اللہ کو دیکھا ہے، پس اس نے مجھے ابو یزید سے بے نیاز کر دیا۔ اس شخص نے اسے کہا: اگر تم ایک بار ابو یزید کو دیکھ لیتے تو یہ تمہارے لیے ہزار بار اللہ کو دیکھنے سے بہتر ہوتا۔ جب اس نے یہ سنا تو وہ اس کی طرف سفر کر گیا۔ پس وہ اس شخص کے ساتھ اس کے راستے پر بیٹھ گیا۔ پس ابو یزید وہاں سے گزرے، اور ان کی کھال کی چادر ان کے کندھے پر تھی۔ اس شخص نے اسے کہا: یہ ابو یزید ہیں۔ اس نے ان کی طرف دیکھا اور اسی وقت مر گیا۔ اس شخص نے ابو یزید کو اس آدمی کے حال کے بارے میں بتایا۔ ابو یزید نے فرمایا: وہ اللہ کو اپنی استعداد کے مطابق دیکھتا تھا۔ لیکن جب اس نے ہمیں دیکھا تو ذات حق (الحق) نے ہماری استعداد کے مطابق اس پر ظہور الٰہی (التجلی) فرمایا، پس وہ برداشت نہ کر سکا اور مر گیا۔\n\nاور جب معاملہ ایسا ہے، تو ہم نے جان لیا کہ محمدی رؤیت (رؤیت محمدیہ) کے ذریعے محمدی صورت میں اللہ کا دیدار کرنا ہی سب سے کامل دیدار ہے جو ہو سکتا ہے۔ پس ہم لوگوں کو زبانی اور اپنی اس کتاب میں بھی اس کی ترغیب دیتے رہے ہیں۔ اور اللہ یَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب پانصد و چهلم در شناخت حال قطبی که منزل او این آیه بود: «و اگر صبر می‌کردند تا تو به سوی ایشان بیرون آیی، قطعاً برایشان بهتر بود.» (وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكانَ خَيْراً لَهُمْ)\n\nبه خدا تکیه کن، نه به سبب (واسطه)؛ و به صلح متمایل شو، نه به جنگ.\nپس به هر آنچه در هستی (الکون) از شگفتی است بنگر؛ که بدون رنج و سختی، آسان به تو می‌رسد.\nاگر در آن بر رحمان اعتماد کردی، پس در هر حال با رحمان در سبب باش.\nپس به او باش، نه در او؛ تا هر آنچه از صورت‌ها و سبب‌ها که خواستی، در آن ببینی.\nاگر تو را به چیزی که نمی‌دانی فراخواند، پاسخش مده؛ زیرا علم در نسبت‌هاست.\nو نزاع مکن و به خدا پناهنده باش؛ و نجنگ، زیرا سپاه خدا در طلب است.\n\n### [معیت (همراهی) خداوند با بنده]\n\nخداوند جل ثناؤه و تقدست اسماؤه فرمود: «همانا خداوند با صابران است» (إِنَّ الله مَعَ الصَّابِرِينَ). و مدار همه چیز بر شهود (الشهود) این معیت (همراهی) است؛ زیرا او «با کسانی است که تقوا پیشه کرده‌اند و کسانی که نیکوکارند» (مَعَ الَّذِينَ اتَّقَوْا والَّذِينَ هُمْ مُحْسِنُونَ). پس او با صابران، پرهیزکاران و نیکوکاران است. این ذکر (یاد) به شهود (الشهود) معیتی می‌انجامد که خداوند به طور خاص با صابران دارد. و این صبر چیزی نیست جز صبر بر رسول (صلی الله علیه و سلم) تا به سوی ایشان بیرون آید؛ پس صبر بر خداوند چگونه است؟\n\nاز آنجا که رسول خدا (صلی الله علیه و سلم) در همه احوال خود خدا را ذکر می‌کرد و خداوند همنشین کسی است که او را یاد کند، پس رسول خدا (صلی الله علیه و سلم) همواره جلیس (همنشین) حق (الحق) بود. بنابراین، هر کس نزد او (صلی الله علیه و سلم) می‌آمد، او تنها از نزد پروردگارش به سوی آن شخص بیرون می‌آمد؛ یا به عنوان بشارت‌دهنده، یا به عنوان وصیت‌کننده و نصیحت‌گو. و به همین دلیل فرمود: «قطعاً برایشان بهتر بود» (لَكانَ خَيْراً لَهُمْ).\n\nاگر خروج او به سوی ایشان چیزی بود که در آخرتشان موجب ناراحتی آنان می‌شد، برایشان بهتر نبود. حال آنکه خداوند به خیریت (بهتر بودن) شهادت داده است، پس ناگزیر باید خیری در آن باشد. و این خیریت همان است که ذکر کردیم: بشارت به خیر، یا وصیت و نصیحت، و یا آشکار ساختن امری که آنان را به سعادتشان نزدیک می‌کند؛ غیر از این نخواهد بود.\n\nو هر کس نفس خود را بر آنچه خداوند بر زبان رسولش (صلی الله علیه و سلم) برای او تشریع کرده است، صابر سازد، خداوند ناگزیر رسولش (صلی الله علیه و سلم) را به سوی او بیرون می‌آورد؛ یا در بشارتی که می‌بیند، یا در کشف (الکشف) آنچه از خیر نزد خداوند برای اوست. و خداوند رسولش (صلی الله علیه و سلم) را به سوی او بیرون می‌آورد، زیرا هیچ کس دیگری نمی‌تواند به صورت رسول خدا (صلی الله علیه و سلم) متصور شود. پس هر کس او را ببیند، قطعاً خود او را دیده است و شکی در آن نیست. برخلاف رؤیت حق (الحق)، زیرا حق (الحق) در صورت‌های همه اشیاء تجلی (التجلی) دارد؛ چرا که اشیاء جز به واسطه او سبحانه و تعالی ظاهر نشده‌اند.\n\nپس عارف می‌داند که هر چیزی که می‌بیند، جز حق (الحق) نیست؛ و اوست که سعادت و شقاوت می‌بخشد. اما رسول (صلی الله علیه و سلم) چنین نیست. از این رو، بر رؤیت رسول اعتماد می‌شود و به رؤیت حق (الحق) مغرور نمی‌گردد. به همین دلیلی که اشاره کردیم، برخی از بشر و جن ادعای الوهیت کردند و از آنان پذیرفته شد و به جای خداوند پرستیده شدند. اما هیچ کس نتوانسته است ادعا کند که محمد بن عبدالله رسول خدا (صلی الله علیه و سلم) است. و اگر کسی ادعای نبوت کند، نمی‌گوید که محمد است، بلکه می‌گوید رسول خداست؛ در این صورت از او دلیل بر ادعایش خواسته می‌شود. پس به عصمت این اسم عَلَم (محمد) توجه کن که هیچ یک از خلق خدا، چه در کشف (الکشف) و چه در خواب، نمی‌تواند دقیقاً به صورت او در بیداری متصور شود.\n\nپس هر کس او را ببیند، خود او را دیده است. اگر تغییری نیکو در صورت او مشاهده شود، آن تغییر به حال بیننده یا به صورت شریعت در مکانی که او را در آن دیده است، نزد والیان امور مردم باز می‌گردد. و همچنین اگر تغییر، تغییری زشت باشد، همین حکم را دارد. پس بدان که تغییر او به نیکویی و زشتی، عین آگاه ساختن و خطاب او به بیننده است درباره آنچه امر بر آن است؛ چه در حق خود بیننده و چه در حق والیان عصر در آن مکانی که او را می‌بیند. اما رؤیت حق (الحق) چنین نیست، زیرا هیچ چیز خارج از او وجود ندارد؛ پس هر چیزی در او نیکوست و قبحی در آن نیست. و امور تنها به واسطه شریعت، یا به واسطه عوارض در نزد صاحبان اغراض، یا به واسطه سازگاری با طبع در نزد صاحبان مزاج، و یا به واسطه کمال و نقص در نزد صاحبان نظر فکری از حکما، قبیح شمرده شده‌اند.\n\nو صاحب این هجیر (راه و روش) بسیار بر محمد (صلی الله علیه و سلم) صلوات می‌فرستد و نفس خود را بر این ذکر (یاد) حبس می‌کند و صبر می‌ورزد تا او (صلی الله علیه و سلم) به سویش بیرون آید. من کسی را بر این قدم (روش) نیافتم جز مردی سالخورده و آهنگر در اشبیلیه که به «اللهم صل علی محمد» معروف بود و به غیر این نام شناخته نمی‌شد. او را دیدم و برایم دعا کرد و از او بهره بردم. او پیوسته غرق در صلوات بر محمد (صلی الله علیه و سلم) بود و جز به اندازه نیاز، برای سخن گفتن با کسی فراغت نمی‌یافت. اگر کسی نزد او می‌آمد و از او می‌خواست که کاری آهنی برایش انجام دهد، با او بر سر آن شرط می‌کرد و چیزی اضافه نمی‌کرد. هیچ کس، نه مرد و نه کودک و نه زن، نزد او نمی‌ایستاد مگر اینکه آن ایستاده ناگزیر بر محمد صلوات می‌فرستاد تا از نزد او برود. او در شهر به این امر مشهور بود و از اهل الله بود.\n\nپس هر آنچه برای صاحب این ذکر (یاد) حاصل می‌شود، علم حق (الحق) و معصوم است؛ زیرا هیچ یک از آن امور جز به واسطه رسول (صلی الله علیه و سلم) به او نمی‌رسد، که اوست تجلی‌کننده (المتجلی) و خبردهنده. مردی در زمان ابویزید بسطامی با شخصی ملاقات کرد و به او گفت: آیا ابویزید را دیده‌ای؟ آن شخص پاسخ داد: خدا را دیده‌ام و این مرا از ابویزید بی‌نیاز کرده است. آن مرد به او گفت: اگر ابویزید را یک بار می‌دیدی، برایت بهتر بود از اینکه خدا را هزار بار ببینی. هنگامی که آن شخص این سخن را شنید، به سوی ابویزید سفر کرد و با آن مرد (که او را راهنمایی کرده بود) بر سر راه ابویزید نشست. ابویزید در حالی که پوستینش بر دوشش بود، از آنجا عبور کرد. آن مرد (راهنما) به او گفت: این ابویزید است. آن شخص به او نگاه کرد و در همان لحظه جان داد. آن مرد (راهنما) ابویزید را از حال آن شخص باخبر ساخت. ابویزید گفت: او خدا را به اندازه ظرفیت خود می‌دید. اما وقتی ما را دید، حق (الحق) به اندازه ظرفیت ما بر او تجلی (التجلی) کرد، پس طاقت نیاورد و مُرد. و چون امر چنین است، دانستیم که رؤیت ما خداوند را در صورت محمدیه (الحقیقة المحمدیة) و با رؤیت محمدیه، کامل‌ترین رؤیتی است که می‌تواند باشد. از این رو، ما پیوسته مردم را به صورت شفاهی و در این کتابمان به آن ترغیب می‌کنیم. و «خداوند حق (الحق) را می‌گوید و اوست که راه را می‌نمایاند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}