{
  "id": 431,
  "title": {
    "ar": "الباب الأحد والثلاثون وأربعمائة في معرفة منازلة من حجبته حجبته",
    "en": "Chapter Four Hundred and Thirty-One: Concerning the Gnosis (معرفة) of the Spiritual Station (منازلة) of the One Whom His Own Veil Has Veiled.",
    "ur": "باب چار سو اکتیس: اس شخص کے مقامات کی معرفت میں جسے اس کے حجاب نے پردہ ڈال دیا ہے۔",
    "fa": "باب چهارصد و سی و یکم در معرفت منزل کسی که حجابش او را محجوب ساخته است"
  },
  "content": {
    "ar": "## «الباب الأحد والثلاثون وأربعمائة في معرفة منازلة من حجبته حجبته»\n\n\n> حجاب العبد منه وليس يدري *** بأن وجوده عين الحجاب‏\n\n\n> فيا قوم اسمعوا قولي تفوزوا *** بما قد قال في أم الكتاب‏\n\n\n> فلفظة نستعين قد أظهرتنا *** وأفعالي وعيني في تباب‏\n\n\n> فنحن التائهون بكل قفر *** ونحن الواقفون بكل باب‏\n\n\n### [إن الله إذا أراد تعظيم عبد عند عباده وكساه خلعته وأعطاه أسماءه وجعله خليفة في خلقه‏]\n\n\nقال الله تعالى وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ فإذا خاطبهم ما يخاطبهم إلا بما تواطئوا عليه وإذا ظهر لهم في فعل من الأفعال فلا يظهر لهم إلا بما ألفوه في عاداتهم ومن عاداتهم مع الكبير عندهم إذا مشى أن يحجبوه ومعناه أن يكونوا له حجبة بين يديه كما قال نُورُهُمْ يَسْعى‏ بَيْنَ أَيْدِيهِمْ وسبب ذلك أن الكبير لو تقدم الجماعة لم يعرف ولم تتوفر الدواعي إلى تعظيمه فإذا تقدم الحجاب بين يديه طرقوا له وتأهبت العامة لرؤيته وحصل في قلوبها من تعظيمه على قدر ما يعرفونه من عظمة الحجبة في نفوسهم فيعظم شأنه فإذا أراد الله تعظيم عبد عند عباده عدل به عن منزلته وكساه خلعته وأعطاه أسماءه وجعله خليفة في خلقه وملكه أزمة الأمور وحمل الغاشية بين يديه كما يحمل الملك الغاشية بين يدي ولي عهده وإن كان في المنزلة أعظم منه ولا بد لمن هذه حالته أن يعطي المرتبة حقها فلا بد أن ينحجب عن رتبة عبوديته وعلى قدر ما ينحجب عنها ينحجب عن ربه ولا يمكن إلا هذا فإن الحضرة في الوقت له والوقت وقته والحكم للوقت في كل حاكم أ لا ترى الحق يقول عن نفسه إنه كُلَّ يَوْمٍ (هُوَ) في شَأْنٍ فهو بحسب الوقت لأنه لا يعطي إلا بحسب القابل فالقبول وقته حتى يجري الأمور على الحكمة ولما كان الوقت لصاحبه حكم عليه بما يظهر به وقال صَلَّى اللهُ عَليهِ وسَلَّم لا يؤمن الرجل في سلطانه ولا يقعد على تكرمته إلا بإذنه ولو كان الخليفة بنفسه إذا دخل دار أحد من رعيته فالأدب الإلهي المعتاد يحكم عليه بأن يحكم عليه رب البيت فحيثما أقعده قعد ما دام في سلطانه وإن كان الخليفة أكبر منه وأعظم ولكن حكم المنزل حكم عليه فرده مرءوسا أ لا ترى أن وجود العبد وأعني به العالم ما ظهر إلا بوجود الحق وإيجاده لأن الحكم له ثم تأخر المتقدم وتقدم المتأخر فلم يظهر للعلم بالله عين حتى أظهره العلم بالعالم فكان ذلك جزاء الإيجاد وعاد ذلك الجزاء\nعلى العالم بذلك الناظر فيه إذ لم يكن الحق محلا للجزاء فعاد عمل العبد عليه كما عاد عمل الحق على الحق بما وقع به الثناء عليه من المحدثات وقد اتفق لعارفين من أهل زماننا فقال لي أبو البدر دخلت على الواحد منهما بميافارقين فذكرت له شأن العارف الذي ببغداد فقال لي إنه من جملة من يمضي أمري فيه قال فجئت إلى العارف الآخر ببغداد فقلت له إني أدخلت بميافارقين على الوكاف فذكرت له شأنك فقال لي إني رأيته في جملة من يمضي أمري فيه من خولي فقال كذا يزعم والله لقد رأيته يحمل الغاشية بين يدي قال أبو البدر فحرت بينهما وكلاهما صادقان عندي فأزل عني هذه الغمة فقلت له رحمه الله كل واحد منهما صدق وإن كل واحد منهما رأى صاحبه في سلطانه وفي محله والحكم لصاحب المحل فذلك كان حكم المحل لا حكم مراتبهما وأما مقامهما فلا يعرف من هذا وإنما يعرف من أمر آخر فسر بذلك وعرف أنه الحق فينبغي للمنصف أن يعرف المواطن وأحكامها أين موطن الغضب الإلهي من موطن الرضاء يفعل العبد فعلا فيسخط ربه به عليه فهو جنى على نفسه والحق بحكم ذلك الواقع بين عفو ومؤاخذة ويفعل ذلك العبد فعلا يرضي به ربه فهو الذي أرضاه كما أسخطه فالحق مع عباده بحسب أحوالهم غير هذا ما يكون انظر في أحوال الخلق في الكثيب إذا نزلوا على الحق هنالك يتفرج العارفون فيما ذكرناه فإذا عادوا إلى جناتهم وأهليهم وتجلى الحق لهم يتغير الحال منهم لكون المنازل لهم ومنزل الكثيب له إذا كان الحق سمعك وبصرك فقد نزل بك فإن تأدبت معه في النظر والاستماع بقي عندك وإن أسأت الأدب رحل عنك وصورة الأدب معه موجودة فيما شرع لك أن تعامله به فإذا دخلت عليه في بيته وهو المسجد كان له الحكم فيك بسبب إضافة الدار إليه والحكم له فأوجب عليك أن تحييه بركعتين وأن لا تعمل فيه ما لم يأذن لك في عمله فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 431: On the Gnosis of the Station of the One Whose Veil is His Own Veil\n\nThe servant’s veil is from himself, yet he does not know\nThat his very existence (وجوده) is the essence of the veil (عين الحجاب).\n\nO people, listen to my saying, that you may triumph\nBy what He has said in the Mother of the Book (أم الكتاب).\n\nThe word *nasta'īn* (we seek help) has manifested us,\nWhile my acts and my essence (عيني) are in ruin.\n\nWe are the wanderers (التائهون) in every wasteland,\nAnd we are the standers (الواقفون) at every door.\n\n[When Allah desires to magnify a servant in the eyes of His creatures, He clothes him in His robe of honor, grants him His Names, and appoints him as a vicegerent (خليفة) among His creation.]\n\nAllah the Exalted said: <<وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ>> (And We did not send any messenger except with the language of his people). Thus, when He addresses them, He addresses them only with what they have agreed upon. And when He manifests Himself to them in any Act (فعل), He manifests Himself only through what they are accustomed to in their habits. One of their habits concerning a great personage (الكبير) among them is that when he walks, they veil him. The meaning of this is that they act as guards or veilers (حجبة) before him, as He said: <<نُورُهُمْ يَسْعَى بَيْنَ أَيْدِيهِمْ>> (Their light runs before them). The reason for this is that if the great personage were to precede the group, he would not be recognized, and the motives for his magnification would not be fully present. But if the veil (الحجاب) precedes him, they clear the way for him, and the common people prepare themselves for his sight. A magnification of him arises in their hearts commensurate with the greatness they perceive in the guards (الحجبة) themselves, thus his status is magnified. Therefore, when Allah desires to magnify a servant in the eyes of His creatures, He shifts him from his station (منزلته), clothes him in His robe of honor (خلعته), grants him His Names (أسماءه), appoints him as a vicegerent (خليفة) among His creation, gives him mastery over the reins of affairs (أزمة الأمور), and causes the canopy (الغاشية) to be carried before him, just as the king carries the canopy before his crown prince, even if the crown prince is greater in station than the king.\n\nIt is necessary for one whose state is this to give the Level (المرتبة) its due right. Thus, he must be veiled (ينحجب) from the rank of his servitude (عبوديته). To the degree that he is veiled from it, he is veiled from his Lord. Nothing else is possible. For the Divine Presence (الحضرة) belongs to him at that moment (الوقت), and the moment is his moment, and the ruling (الحكم) belongs to the moment in every ruler. Do you not see that The Real (الحق) says of Himself that <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [some] affair)? Thus, He acts according to the moment, because He only gives according to the recipient (القابل). The acceptance (القبول) is his moment, so that affairs may proceed according to wisdom (الحكمة). Since the moment belongs to its possessor, it rules over him by what manifests through him. The Prophet, peace and blessings be upon him, said: \"A man should not be led in prayer in his domain (سلطانه), nor should one sit on his place of honor (تكرمته) except with his permission.\" Even if the Caliph (الخليفة) himself enters the house of one of his subjects, the customary Divine etiquette (الأدب الإلهي) dictates that the master of the house rules over him. Wherever the master seats him, he sits, as long as he is within the master's domain, even though the Caliph is greater and mightier than him. But the ruling of the dwelling (حكم المنزل) has ruled over him, reducing him to a subordinate.\n\nDo you not see that the existence (وجود) of the servant—by which I mean the World (العالم)—did not manifest except through the Existence of The Real (وجود الحق) and His bringing it into existence (إيجاده), because the ruling belongs to Him? Then the Precedent (المتقدم) was delayed, and the Subsequent (المتأخر) was advanced. Thus, the Essence (عين) of the Knowledge of Allah (العلم بالله) did not appear until the Knowledge of the World (العلم بالعالم) manifested it. This was the recompense (جزاء) for the act of bringing into existence (الإيجاد). And that recompense returned upon the knower (العالم) who contemplates it, since The Real (الحق) is not a locus for recompense. Thus, the servant's action returned upon himself, just as the action of The Real returned upon The Real through the praise (الثناء) that occurred by means of the originated things (المحدثات).\n\nThis occurred to two Gnostics (عارفين) of our time. Abu al-Badr told me: \"I entered upon one of them in Mayyafariqin and mentioned the matter of the Gnostic in Baghdad. He said to me, 'He is among those over whom my command passes.'\" He continued: \"Then I came to the other Gnostic in Baghdad and said to him, 'I was introduced in Mayyafariqin to the *Wakkāf* (the one who stands/stops), and I mentioned your matter to him.' He replied, 'I saw him among those of my servants (خولي) over whom my command passes.'\" [The Gnostic in Baghdad] then said: \"That is what he claims! By Allah, I saw him carrying the canopy (الغاشية) before me!\" Abu al-Badr said: \"I was perplexed between them, and both are truthful in my view. So, remove this distress (الغمة) from me.\" I said to him, may Allah have mercy on him: \"Each of them spoke the truth. Each of them saw his companion in his own domain (سلطانه) and in his own place (محله), and the ruling belongs to the master of the place. That was the ruling of the place, not the ruling of their respective Levels (مراتبهما). As for their spiritual Station (مقامهما), it is not known from this incident, but rather from another matter.\" He was pleased by this and recognized that it was the truth.\n\nIt is therefore incumbent upon the just person (المنصف) to know the various locations (المواطن) and their rulings: where the location of Divine Wrath (الغضب الإلهي) is, and where the location of Satisfaction (الرضاء) is. The servant performs an act by which his Lord becomes wrathful toward him, and thus he has wronged himself. The Real, by the ruling of that occurrence, is between pardon and retribution. And that servant performs an act by which he satisfies his Lord, and it is He who satisfied Him, just as He made Him wrathful. Thus, The Real is with His servants according to their states (أحوالهم); nothing else occurs. Look at the states of the creatures on the Dune (الكثيب) when they descend upon The Real there. The Gnostics (العارفون) find relief in what we have mentioned. But when they return to their Gardens (جناتهم) and their families, and The Real manifests (تجلى) to them, their state changes, because those dwellings belong to them, while the dwelling of the Dune belongs to Him. If The Real is your hearing and your sight, then He has descended upon you. If you observe proper etiquette (تأدبت) with Him in seeing and hearing, He remains with you. If you behave improperly, He departs from you. The form of proper etiquette with Him is found in what He has legislated for you regarding how you should deal with Him. Thus, if you enter upon Him in His house, which is the mosque (المسجد), He has the ruling over you due to the attribution of the dwelling to Him and the ruling belonging to Him. Therefore, He obligated you to greet Him with two cycles of prayer (*rak'atayn*) and not to perform any action within it unless He has permitted you to do so. Know this. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب چار سو اکتیس: اس شخص کے مقام کی معرفت میں جسے اس کے حجاب نے محجوب کر دیا ہے۔\n\nبندے کا حجاب اسی کی طرف سے ہے، اور وہ نہیں جانتا\nکہ اس کا وجود (الوجود) ہی عین حجاب ہے۔\n\nاے قوم! میری بات سنو تاکہ تم کامیاب ہو جاؤ\nاس چیز کے ذریعے جو ام الکتاب (قرآن) میں کہی گئی ہے۔\n\nپس لفظ \"نستعین\" (ہم مدد چاہتے ہیں) نے ہمیں ظاہر کیا،\nجبکہ میرے افعال اور میری ذات (عین) تباہی میں ہیں۔\n\nپس ہم ہر بیابان میں بھٹکنے والے ہیں،\nاور ہم ہر دروازے پر کھڑے ہونے والے ہیں۔\n\n### جب اللہ تعالیٰ کسی بندے کو اپنے بندوں کے نزدیک عظمت دینا چاہتا ہے، تو اسے اپنی خلعت پہناتا ہے، اسے اپنے اسماء عطا کرتا ہے، اور اسے اپنی مخلوق میں خلیفہ بنا دیتا ہے۔\n\nاللہ تعالیٰ نے فرمایا: **وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ** (اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان میں)۔ پس جب وہ ان سے خطاب کرتا ہے تو صرف اسی چیز سے خطاب کرتا ہے جس پر وہ متفق ہو چکے ہوں۔ اور جب وہ ان کے لیے کسی فعل میں ظاہر ہوتا ہے، تو صرف اسی چیز کے ذریعے ظاہر ہوتا ہے جس سے وہ اپنی عادات میں مانوس ہوں۔ اور ان کی عادات میں سے ہے کہ جب ان کا کوئی بڑا چلتا ہے تو وہ اسے محجوب کر دیتے ہیں، اور اس کا مطلب یہ ہے کہ وہ اس کے آگے اس کے لیے حجبہ (حفاظتی دستہ) بن جائیں، جیسا کہ فرمایا: **نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ** (ان کا نور ان کے آگے دوڑ رہا ہوگا)۔ اور اس کی وجہ یہ ہے کہ اگر بڑا شخص جماعت سے آگے نکل جائے تو وہ پہچانا نہیں جائے گا اور اس کی تعظیم کے محرکات پورے نہیں ہوں گے۔ پس جب حجبہ (حفاظتی دستہ) اس کے آگے چلتا ہے تو وہ اس کے لیے راستہ بناتے ہیں اور عام لوگ اسے دیکھنے کے لیے تیار ہو جاتے ہیں، اور ان کے دلوں میں اس کی تعظیم اس قدر پیدا ہوتی ہے جس قدر وہ حجبہ کی عظمت کو اپنی جانوں میں جانتے ہیں۔ پس اس کی شان بلند ہو جاتی ہے۔\n\nپس جب اللہ تعالیٰ کسی بندے کو اپنے بندوں کے نزدیک عظمت دینا چاہتا ہے، تو وہ اسے اس کے مقام سے ہٹا دیتا ہے، اسے اپنی خلعت پہناتا ہے، اسے اپنے اسماء عطا کرتا ہے، اور اسے اپنی مخلوق میں خلیفہ بنا دیتا ہے، اور اسے امور کی باگ ڈور سونپ دیتا ہے، اور اس کے آگے غاشیہ (چتر یا پردہ) اٹھواتا ہے، جیسا کہ بادشاہ اپنے ولی عہد کے آگے غاشیہ اٹھواتا ہے، اگرچہ وہ مرتبے میں اس سے بڑا ہی کیوں نہ ہو۔ اور جس کی یہ حالت ہو، اس کے لیے ضروری ہے کہ وہ اس مرتبے کا حق ادا کرے، لہٰذا اس کے لیے ضروری ہے کہ وہ اپنی عبودیت (بندگی) کے مرتبے سے محجوب ہو جائے، اور جس قدر وہ اس سے محجوب ہوتا ہے، اسی قدر وہ اپنے رب سے محجوب ہو جاتا ہے۔ اور اس کے سوا ممکن نہیں، کیونکہ اس وقت (الوقت) میں حضرہ (حضور الٰہی) اسی کے لیے ہے، اور وقت اس کا وقت ہے، اور ہر حاکم میں حکم وقت (الوقت) کا ہوتا ہے۔ کیا تم نہیں دیکھتے کہ حق (الحق) اپنے بارے میں فرماتا ہے کہ وہ **كُلَّ يَوْمٍ (هُوَ) فِي شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہے)۔ پس وہ وقت کے مطابق ہوتا ہے، کیونکہ وہ صرف قابل (قبول کرنے والے) کے مطابق ہی عطا کرتا ہے۔ پس قبول (القبول) ہی اس کا وقت ہے، تاکہ امور حکمت (الحکمۃ) کے مطابق جاری ہوں۔ اور چونکہ وقت اس کے صاحب (مالک) کا تھا، اس لیے اس پر اسی چیز کا حکم لگایا گیا جس سے وہ ظاہر ہوتا ہے، اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"کوئی شخص کسی کے علاقے میں امامت نہ کرائے اور نہ ہی اس کی مخصوص نشست پر بیٹھے مگر اس کی اجازت سے۔\" اور اگر خلیفہ خود بھی کسی رعایا کے گھر میں داخل ہو، تو معمول کا الٰہی ادب اس پر یہ حکم لگاتا ہے کہ گھر کا مالک اس پر حکم چلائے۔ پس جہاں وہ اسے بٹھائے، وہ وہیں بیٹھے گا جب تک وہ اس کے علاقے میں ہے، اگرچہ خلیفہ اس سے بڑا اور عظیم ہی کیوں نہ ہو، لیکن منزل (گھر) کے حکم نے اس پر حکم لگایا اور اسے ماتحت بنا دیا۔\n\nکیا تم نہیں دیکھتے کہ بندے کا وجود (الوجود) – اور میری مراد عالم (کائنات) ہے – حق (الحق) کے وجود (الوجود) اور اس کے ایجاد (پیدا کرنے) کے بغیر ظاہر نہیں ہوا، کیونکہ حکم اسی کا ہے۔ پھر متقدم (پہلے آنے والا) پیچھے ہٹ گیا اور متاخر (بعد میں آنے والا) آگے بڑھ گیا۔ پس اللہ کی معرفت (المعرفۃ) کے لیے کوئی ذات (عین) ظاہر نہ ہوئی یہاں تک کہ عالم (کائنات) کی معرفت نے اسے ظاہر کر دیا۔ پس یہ ایجاد (پیدا کرنے) کا بدلہ تھا، اور یہ بدلہ اس عالم (عالم) پر لوٹ آیا جو اس میں غور کرنے والا تھا، کیونکہ حق (الحق) جزاء (بدلے) کا محل نہیں تھا۔ پس بندے کا عمل اسی پر لوٹ آیا، جیسا کہ حق (الحق) کا عمل حق (الحق) پر لوٹ آیا اس چیز کے ذریعے جس سے محدثات (نئی پیدا شدہ چیزوں) کی وجہ سے اس کی تعریف واقع ہوئی۔\n\nاور ہمارے زمانے کے دو عارفین (عارفین) کے ساتھ ایک واقعہ پیش آیا۔ ابو البدر نے مجھے بتایا: \"میں میافارقین میں ان میں سے ایک کے پاس گیا اور میں نے ان سے بغداد کے عارف کا حال ذکر کیا، تو انہوں نے مجھ سے کہا: 'وہ ان لوگوں میں سے ہے جن پر میرا حکم چلتا ہے۔'\" ابو البدر نے کہا: \"پھر میں بغداد میں دوسرے عارف کے پاس آیا اور میں نے ان سے کہا کہ میں میافارقین میں وکاف (پہلے عارف کا لقب) کے پاس گیا تھا اور میں نے ان سے آپ کا حال ذکر کیا، تو انہوں نے مجھ سے کہا کہ 'میں نے اسے اپنے خولی (خدمت گاروں) میں سے ان لوگوں میں دیکھا جن پر میرا حکم چلتا ہے۔'\" بغداد کے عارف نے کہا: \"وہ ایسا ہی گمان کرتا ہے! اللہ کی قسم، میں نے اسے اپنے آگے غاشیہ (چتر) اٹھائے ہوئے دیکھا ہے۔\" ابو البدر نے کہا: \"میں ان دونوں کے درمیان حیران ہو گیا، اور دونوں ہی میرے نزدیک سچے ہیں۔ پس مجھ سے یہ غم دور کیجیے۔\" میں نے ان سے کہا، اللہ ان پر رحم کرے: \"ان میں سے ہر ایک نے سچ کہا، اور ان میں سے ہر ایک نے اپنے ساتھی کو اس کے علاقے (سلطان) اور اس کے محل (مقام) میں دیکھا، اور حکم محل (مقام) کے مالک کا ہوتا ہے۔ پس یہ محل کا حکم تھا، نہ کہ ان کے مراتب کا حکم۔ اور جہاں تک ان کے مقام (مقام) کا تعلق ہے، وہ اس سے نہیں پہچانا جاتا، بلکہ کسی اور امر سے پہچانا جاتا ہے۔\" پس وہ اس سے خوش ہوئے اور جان لیا کہ یہ حق (الحق) ہے۔\n\nپس انصاف کرنے والے کے لیے ضروری ہے کہ وہ مقامات (المواطن) اور ان کے احکام کو پہچانے۔ غضب الٰہی (الغضب الإلهي) کا مقام رضائے الٰہی (الرضاء) کے مقام سے کہاں ہے؟ بندہ کوئی فعل کرتا ہے تو اس کا رب اس پر ناراض ہوتا ہے، پس اس نے اپنی جان پر ظلم کیا، اور حق (الحق) اس واقعے کے حکم کے مطابق عفو (معافی) اور مؤاخذہ (پکڑ) کے درمیان ہوتا ہے۔ اور وہی بندہ کوئی فعل کرتا ہے جس سے اس کا رب راضی ہوتا ہے، پس وہی ہے جس نے اسے راضی کیا، جیسا کہ اس نے اسے ناراض کیا تھا۔ پس حق (الحق) اپنے بندوں کے ساتھ ان کے احوال کے مطابق ہوتا ہے، اس کے علاوہ کچھ نہیں ہوتا۔ میدان حشر (الکثیب) میں مخلوق کے احوال پر غور کرو، جب وہ وہاں حق (الحق) پر اتریں گے۔ وہاں عارفین (عارفین) اس چیز میں تفریح کریں گے جو ہم نے ذکر کی۔ پھر جب وہ اپنی جنتوں اور اپنے اہل خانہ کی طرف لوٹیں گے اور حق (الحق) ان کے لیے تجلی (التجلی) فرمائے گا، تو ان کی حالت بدل جائے گی، کیونکہ منازل (ٹھکانے) ان کے لیے ہیں، جبکہ کثیب (میدان حشر) کا ٹھکانہ اس (اللہ) کے لیے ہے۔\n\nجب حق (الحق) تمہاری سماعت اور تمہاری بصارت ہو، تو وہ تمہارے ساتھ نازل ہو چکا ہے۔ اگر تم نے دیکھنے اور سننے میں اس کے ساتھ ادب کیا تو وہ تمہارے پاس باقی رہے گا، اور اگر تم نے بدتمیزی کی تو وہ تم سے کوچ کر جائے گا۔ اور اس کے ساتھ ادب کی صورت اس چیز میں موجود ہے جو تمہارے لیے مشروع کی گئی ہے کہ تم اس کے ساتھ کیسا معاملہ کرو۔ پس جب تم اس کے گھر میں داخل ہوتے ہو، جو کہ مسجد ہے، تو اس گھر کی اضافت (نسبت) کی وجہ سے تم پر اسی کا حکم ہوتا ہے، اور حکم اسی کا ہے۔ پس اس نے تم پر واجب کیا کہ تم دو رکعتوں سے اسے سلام کرو، اور اس میں وہ کام نہ کرو جس کی اس نے تمہیں اجازت نہیں دی۔ پس یہ جان لو، اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و سی و یکم در معرفت منزلت کسی که حجابش او را محجوب کرده است\n\nحجاب بنده از خود اوست و نمی‌داند *** که هستی‌اش عین حجاب است\n\nای قوم، سخن مرا بشنوید تا رستگار شوید *** به آنچه در ام‌الکتاب (قرآن) گفته شده است\n\nپس لفظ «نستعین» (یاری می‌جوییم) ما را آشکار ساخت *** و افعال و عینیت من در هلاکت است\n\nما سرگردانان در هر بیابانیم *** و ما ایستادگان بر هر درگاهیم\n\n[همانا خداوند هنگامی که بخواهد بنده‌ای را نزد بندگانش بزرگ بدارد، خلعت خود را بر او می‌پوشاند و اسماء خود را به او می‌دهد و او را خلیفه در خلقش قرار می‌دهد]\n\nخداوند متعال می‌فرماید: «و ما هیچ رسولی را نفرستادیم مگر به زبان قومش» (وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ). پس هنگامی که با آنان سخن می‌گوید، جز به آنچه بر آن توافق کرده‌اند، با ایشان سخن نمی‌گوید. و هنگامی که در فعلی از افعال بر آنان ظاهر می‌شود، جز به آنچه در عادات خود به آن خو گرفته‌اند، بر ایشان ظاهر نمی‌شود. و از عادات آنان در مورد بزرگ قومشان این است که وقتی راه می‌رود، او را محجوب سازند؛ و معنای آن این است که حاجبانی (حُجبه) پیش روی او باشند، چنانکه فرمود: «نورشان پیشاپیش آنان می‌شتابد» (نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ). و سبب این امر آن است که اگر بزرگ قوم از جماعت پیشی گیرد، شناخته نمی‌شود و انگیزه‌های تعظیم او فراهم نمی‌آید. پس هنگامی که حاجبان پیش روی او حرکت می‌کنند، مردم برای او راه باز می‌کنند و عامه برای دیدن او آماده می‌شوند و در دل‌هایشان به اندازه‌ای که عظمت حاجبان را در خود می‌شناسند، تعظیم او حاصل می‌شود و شأن او بزرگ می‌گردد.\n\nپس هنگامی که خداوند بخواهد بنده‌ای را نزد بندگانش بزرگ بدارد، او را از منزلتش فراتر می‌برد و خلعت خود را بر او می‌پوشاند و اسماء خود را به او می‌دهد و او را خلیفه در خلقش قرار می‌دهد و زمام امور را به او می‌سپارد و غاشیه (پرده یا سایبان سلطنتی) را پیش روی او حمل می‌کند، همان‌گونه که پادشاه غاشیه را پیش روی ولیعهد خود حمل می‌کند، هرچند ولیعهد در منزلت از او بزرگ‌تر باشد. و برای کسی که حالش چنین است، ناگزیر است که حق مرتبه را ادا کند؛ پس باید از رتبه عبودیت خود محجوب شود، و به همان اندازه که از آن محجوب می‌شود، از پروردگارش نیز محجوب می‌گردد. و جز این ممکن نیست، زیرا در آن زمان، حضرت (الهی) از آن اوست و وقت، وقت اوست، و حکم در هر حاکمی از آنِ وقت است.\n\nآیا نمی‌بینی که حق (الحق) درباره خود می‌فرماید که «او هر روز در کاری است» (كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ)؟ پس او بر حسب وقت است، زیرا جز بر حسب قابل (پذیرنده) عطا نمی‌کند. پس قبول، وقت اوست تا امور بر اساس حکمت جاری شود. و چون وقت از آنِ صاحبش بود، بر او حکم کرد به آنچه که با آن ظاهر می‌شود. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «هیچ مردی در قلمرو (سلطان) دیگری امامت نکند و بر جایگاه گرامی او ننشیند مگر به اذن او.» و اگر خود خلیفه نیز وارد خانه یکی از رعایای خود شود، ادب الهی معمول بر او حکم می‌کند که صاحبخانه بر او حکم کند؛ پس هر جا او را بنشاند، می‌نشیند، مادامی که در قلمرو اوست، هرچند خلیفه از او بزرگ‌تر و عظیم‌تر باشد، اما حکم منزل بر او حکم کرده و او را به مرتبه مرئوس (زیردست) بازگردانده است.\n\nآیا نمی‌بینی که وجود بنده – و منظورم از آن، عالم است – جز به وجود حق (الحق) و ایجاد او ظاهر نشد، زیرا حکم از آنِ اوست؟ سپس متقدم (حق) تأخیر یافت و متأخر (عالم) تقدم یافت. پس برای علم به خداوند (الله) عینی ظاهر نشد تا اینکه علم به عالم آن را آشکار ساخت. پس این، جزای ایجاد بود و آن جزا به عالمِ ناظر در آن بازگشت، زیرا حق (الحق) محل جزا نبود. پس عمل بنده بر خودش بازگشت، همان‌گونه که عمل حق بر حق بازگشت به واسطه ثنایی که از سوی موجودات حادث بر او واقع شد.\n\nو این امر برای دو عارف از اهل زمان ما اتفاق افتاد. ابوالبدر به من گفت: بر یکی از آن دو در میافارقین وارد شدم و شأن عارفی را که در بغداد بود، برایش ذکر کردم. او به من گفت: «او از جمله کسانی است که امر من در مورد او جاری می‌شود.» ابوالبدر گفت: سپس نزد عارف دیگر در بغداد آمدم و به او گفتم: من در میافارقین بر وکاف وارد شدم و شأن تو را برایش ذکر کردم. او به من گفت: «من او را در زمره خادمانم دیدم که امر من در مورد او جاری می‌شود.» ابوالبدر گفت: «او چنین گمان می‌کند؟ به خدا سوگند، من او را دیدم که غاشیه را پیش روی من حمل می‌کرد.» ابوالبدر گفت: من میان آن دو متحیر شدم، در حالی که هر دو نزد من صادق بودند. پس این اندوه را از من برطرف کن. من به او گفتم: خداوند او را رحمت کند، هر دوی آنها راست گفتند، و هر یک از آنها دیگری را در قلمرو (سلطان) و محل خود دید. و حکم از آنِ صاحب محل است. پس آن، حکم محل بود نه حکم مراتب آن دو. اما مقام (مقام) آن دو از این طریق شناخته نمی‌شود، بلکه از امری دیگر شناخته می‌شود. پس او از این سخن شاد شد و دانست که حق (الحق) همین است.\n\nپس شایسته است که شخص منصف، مواطن (جایگاه‌ها) و احکام آنها را بشناسد؛ موطن غضب الهی کجاست و موطن رضایت کجاست؟ بنده فعلی انجام می‌دهد و پروردگارش به سبب آن بر او خشم می‌گیرد؛ پس او بر خود جنایت کرده است، و حق (الحق) به حکم آن واقعه، میان عفو و مؤاخذه قرار دارد. و آن بنده فعلی انجام می‌دهد که پروردگارش را با آن خشنود می‌سازد؛ پس او همان کسی است که او را خشنود ساخت، همان‌گونه که او را به خشم آورد. پس حق (الحق) با بندگانش بر حسب احوال آنهاست و جز این نمی‌تواند باشد. به احوال خلق در «کثیب» (تپه شنی) بنگر، هنگامی که بر حق (الحق) فرود می‌آیند. در آنجا عارفون در آنچه ذکر کردیم، به تماشا می‌پردازند. و هنگامی که به بهشت‌ها و اهل خود باز می‌گردند و حق (الحق) بر آنان تجلی (التجلی) می‌کند، حالشان دگرگون می‌شود، زیرا منازل از آنِ آنهاست و منزل کثیب از آنِ اوست.\n\nهنگامی که حق (الحق) گوش و چشم تو باشد، پس بر تو فرود آمده است. اگر در نگاه و شنیدن با او ادب ورزی، نزد تو باقی می‌ماند، و اگر بدادبی کنی، از تو کوچ می‌کند. و صورت ادب با او در آنچه برای تو تشریع شده که با او معامله کنی، موجود است. پس هنگامی که بر او در خانه‌اش که مسجد است، وارد شدی، به سبب اضافه شدن خانه به او و حکم از آنِ او بودن، حکم بر تو جاری می‌شود. پس بر تو واجب کرد که با دو رکعت به او درود گویی و در آن کاری انجام ندهی مگر آنچه را که به تو اجازه داده است. پس این را بدان، و خداوند «حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}