{
  "id": 260,
  "title": {
    "ar": "الباب الموفي ستين ومائتان في معرفة القرب",
    "en": "Chapter Two Hundred and Sixty: Concerning the Gnosis (معرفة) of Proximity (القرب)",
    "ur": "دو سو ساٹھواں باب: قرب (القرب) کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب دویست و شصتم در معرفت قرب (القرب)"
  },
  "content": {
    "ar": "## «الباب الموفي ستين ومائتان في معرفة القرب»\n\n\nوهو القيام بالطاعات وقد يطلقونه ويريدون به قرب قابَ قَوْسَيْنِ وهما قوسا الدائرة إذا قطعت بخط أَوْ أَدْنى‏\n\n\n> إذا قطعت بخط أكرة فبدا *** قوسان ذلك قرب الحق فاعتبروا\n\n\n> إلى حقيقة أدنى منهما فإذا *** ما حزته لاح ما يقضي به النظر\n\n\n> إن المعارج للأرواح نسبتها *** خلاف نسبة ما يسرى به البصر\n\n\n### [المطلوب في القرب أن يكون صفة العبد]\n\n\nقال تعالى ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ فوصف نفسه بالقرب من عباده والمطلوب بالقرب إنما هو أن يكون صفة العبد فيتصف بالقرب من الحق اتصاف الحق بالقرب منه كما قال وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ والرجال يطلبون أن يكونوا مع الحق أبدا في أي صورة تجلى وهو لا يزال متجليا في صور عباده دائما فيكون العبد معه حيث تجلى دائما كما لا يخلو العبد عن أينية دائما والله معه أينما كان دائما فأينية الحق صورة ما يتجلى فيها فالعارفون لا يزالون في شهود القرب دائمين لأنهم لا يزالون في شهادة الصور في نفوسهم وفي غير نفوسهم وليس إلا تجلى الحق وأما القرب الذي هو القيام بالطاعات فذلك القرب من سعادة العبد بالفوز من شقاوته وسعادة العبد في نيل جميع أغراضه كلها ولا يكون له ذلك إلا في الجنة وأما في الدنيا فإنه لا بد من ترك بعض أغراضه القادحة في سعادته فقرب العامة والقرب العام إنما هو القرب من السعادة فيطيع ليسعد وقرب العارفين ما ذكرناه فهو يتضمن السعادة وزيادة ولو لا الأسماء الإلهية وحكمها في الأكوان ما ظهر حكم القرب والبعد في العالم فإن كل عبد في كل وقت لا بد أن يكون صاحب‏\nقرب من اسم إلهي صاحب بعد من اسم آخر لا حكم له فيه في الوقت فإن كان حكم ذلك الاسم الحاكم في الوقت المتصف بالقرب منه يعطي للعبد فوزا من الشقاء وحيازة لسعادته فذلك هو القرب المطلوب عند القوم وهو كل ما يعطي العبد سعادة وإن لم يعط ذلك فليس بقرب عند القوم وإن كان قربا من وجه آخر لا من حيث ما وقع عليه الاصطلاح‏\n\n\nأخبر رسول الله صلى الله عليه وسلم عن ربه في هذا الباب أن الله يقول ما تقرب المتقربون بأحب إلي من أداء ما افترضته عليهم ولا يزال العبد يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت له سمعا وبصرا ويدا ومؤيدا\n\n\nوقال سبحانه في الخبر الصحيح من تقرب إلي شبرا تقربت إليه ذراعا ومن تقرب إلي ذراعا تقربت منه باعا ومن أتاني يسعى أتيته هرولة\n\n\nوقال تعالى وإِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ وقال في حق الميت ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ ومعناه عندنا لا تميزون يقول تبصرون ولكن لا تعرفون ما تبصرون فكأنكم لا تبصرون‏\n\n\n### [أن القرب من الله على ثلاثة أنحاء]\n\n\nاعلم أن القرب من الله على ثلاثة أنحاء\n\n\nقرب بالنظر في معرفة الله جهد الاستطاعة\n\n\nأصاب في ذلك أو أخطأ بعد بذل الوسع في الاجتهاد في ذلك فقد يعتقد المجتهد فيما ليس ببرهان أنه برهان فيجازيه الله مجازاة أصحاب البراهين الصحيحة وقد نبه سبحانه على ما يفهم منه ما ذكرناه وهو قوله ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به وقد رأى بعض العلماء أن الاجتهاد يسوغ في الفروع والأصول فإن أخطأ فله أجر وإن أصاب فله أجران‏\n\n\n### [النوع الثاني قرب بالعلم‏]\n\n\nوالنوع الآخر قرب بالعلم‏\n\n\nوالنوع الثالث قرب بالعمل‏\n\n\nوينقسم على قسمين قرب بأداء الواجبات وقرب بالمندوبات في عمل الظاهر والباطن‏\n\n\nفأما قرب العلم فأعلاه توحيد الله في الوهته فإنه لا إله إلا هو فإن كان عن شهود لا عن نظر وفكر فهو من أولي العلم الذين ذكرهم الله في قوله شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ لأن الشهادة إن لم تكن عن شهود وإلا فلا فإن الشهود لا يدخله الريب ولا الشكوك وإن وحده بالدليل الذي أعطاه النظر فما هو من هذه الطائفة المذكورة فإنه ما من صاحب فكر وإن أنتج له علما إلا وقد يخطر له دخل في دليله وشبهة في برهانه يؤديه ذلك إلى التحير والنظر في رد تلك الشبهة فلذلك لا يقوى صاحب النظر في علم ما يعطيه لنظر قوة صاحب الشهود وهذا الصنف إذا قضى الله عليه بدخول النار لأسباب أوجبت له ذلك فهو الذي يخرجه الحق من النار بعد شفاعة الشافعين وأما قرب العمل فهو علم ظاهر وهو ما يتعلق بالجوارح وعلم باطن وهو ما يتعلق بالنفس فأعم الأعمال الباطنة الايمان بالله وما جاء من عنده لقول الرسول لا للعلم بذلك وعمل الايمان يعم جميع الأفعال والتروك فما من مؤمن يرتكب معصية ظاهرة أو باطنة إلا وله فيها قربة إلى الله من حيث إيمانه بها إنها معصية فلا يخلص أبد المؤمن عمل سيئ دون أن يخالطه عمل صالح قوله تعالى فيمن هذه صفته عَسَى الله أَنْ يَتُوبَ عَلَيْهِمْ وما ذكر لهم قربة فما تاب هنا في هذه الآية عليهم ليتوبوا وإنما هو رجوع بالعفو والتجاوز وعسى من الله واجبة عند جميع العلماء فالشرط المصحح لقبول جميع الفرائض فرض الايمان ثم يتقرب العبد بأداء الفرائض فمن حصل له هنا ثمرتها كان سمعا للحق وبصرا فيريد الحق بإرادته على غير علم منه أن مراده مراد لله وقوعه فإن علم فليس هو صاحب هذا المقام هذا ميزان أداء الفرائض وهو أحب ما يتقرب به إلى الله وأما قرب النوافل فإنه أيضا يحبه الله ومحبة الله أعطته أن يكون الحق سمعه وبصره هذا ميزانها في قرب النوافل ولما كانت المحبة لها مراتب متميزة في المحب قيل محب وأحب وقد وصف الله نفسه بأحب في قوله بأحب إلي\n\n\nمن أداء ما افترضته عليه وفي النوافل قال أحببته من غير مفاضلة وافترض عليه الايمان به وبما جاء من عنده فالمؤمن له مرتبة الحب والأحب وأما عمل الجوارح فإنه قرب أيضا ولا بد أن تجني الجارحة ثمرتها أي ثمرة عملها في حق كل إنسان من غير تقييد ولكن هم في ذلك على طبقات مختلفة في أي دار كانوا أو من أي صنف كانوا وسواء قصد القرب بذلك العمل أو لم يقصد فإن العمل يطلب ميزانه وقد وقع من الجارحة فهو حق لها والنية حق للنفس حتى أنه لو ذكر الله بيمين فاجرة يقتطع بها حق امرئ لكان للجارحة أجر ذكر الله لما جرى على اللسان وعلى النفس وزر ما نوته من ذلك والتنبيه على ما ذكرناه كون حكم ظاهر الشرع أسقط عنه بيمينه حق الطالب فإذا كان أثرها في الظاهر بهذه القوة في الدنيا فما ظنك بما تجنيه تلك الجارحة الذاكرة ربها في الأخرى فإن الجارحة لا خبر لها بما نوته‏\nالنفس من ذلك فحظها النطق بذكر الله لا تدري أن ذلك الذكر يعود منه وبال على النفس أم لا ولا تدري هل هو مشروع أم غير مشروع ولذلك إذا شهدت الجوارح والجلود بما وقع منها من الأعمال على النفس المدبرة لها ما تشهد بوقوع معصية ولا طاعة وإنما شهادتها بما عملته والله يعلم حكمه في ذلك العمل ولهذا إذا كان يوم القيامة تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ ولم يشهدوا بكون ذلك العمل طاعة ولا معصية فإن مرتبتهم لا تقتضي ذلك فالإنسان من حيث هيكله سعيد كله ومن حيث نفسه إن كان مؤمنا فهو صاحب تخليط\n\n\n### [إن قرب الله على نوعين‏]\n\n\nوأما قرب الله منه فعلى نوعين النوع الواحد قرب رحمة وعطف وتجاوز ومغفرة وإحسان والنوع الآخر قرب لا يمكن كشفه لكن نومئ إليه فنقول لا يخلو الحق مع كل عبد عند ما يتجلى له أن يظهر له في مادة أو في غير مادة فإن تجلى له في مادة وهي الصورة تبع القرب تلك المادة في مجلس الشهود وحضرة الرؤية وإن تجلى له في غير مادة كان قرب المنزلة والمرتبة كقرب الوزير والقاضي والوالي وصاحب الحسية من الملك فإنه قرب متفاضل وقد يدني مجلس الأدون ليسارره بأمر ينفذ في مرتبته ويكون الأعلى أبعد منه مجلسا في ذلك المجلس ولا يقتضي قربه في ذلك المجلس بأنه أعلى رتبة من الأعلى منه فإن حكم المواد يخالف حكم النفوس في الصورة وإذا علمت هذا فقد قربت من العلم بقرب الحق والقرب بين الاثنين على حد واحد فمن قرب منك فقد اتصفت بأنك منه قريب وفي نفس الأمر ليس للبعد من الله سبيل وإنما البعد أمر إضافي يظهر في أحكام الأسماء الإلهية فزمان حكم الاسم الإلهي في الشخص هو زمان اتصافه بالقرب من البعد وقرب العبد منه والاسم الإلهي الذي ما له حكم الوقت في الشخص هو منه بعيد كيف يتصف بالبعد عنك أو تتصف بالبعد منه من أنت في قبضته أ لم يفتح لآدم يده اليمنى تعالى وكلتا يديه يمين مباركة فبسطها فإذا فيها آدم وذريته وهل يؤبد شقاء من هو في يمين الحق لا والله وكانت القبضة الأخرى جميع العالم فانظر في اختيار آدم يمين الحق للتمييز مع كونه يعرف أن كلتي يدي ربه يمين مباركة وليس إلا ما ذكرناه ولو لا ما كان التجلي لآدم في صورة مادية ما اتصفت اليدان بالقبض والبسط وقد نبهتك على معرفة القرب حتى تشهده من نفسك مع الله إن كنت من أهل التجلي في هذه الدار وإذا وقع التجلي في المواد جاءت الحدود بغير شك فجاء الشبر والذراع والباع والسعي والهرولة بحسب ما يقتضيه الحال فإن قرب المواد تابع للأحوال فعلى قدر الحال يكون القرب في المادة بين القريبين ليعلم بذلك القرب أن حاله أعطى ذلك فهو ترجمان عن الأحوال وأما القرب من الله بحياز الصورة فليس ذلك إلا للخلفاء خاصة سواء كانوا رسلا أو لم يكونوا فإن الرسالة ليست بنعت إلهي وإنما هي نسبة بين مرسل ومرسل إليه لينوب عنه فيما يريد أن يبلغه إلى هذا الشخص المرسل إليه فالرسول خليفة ونائب في التبليغ خاصة وتتمة الخلافة والنيابة إنما هي في الحكم بما تقتضيه حقائق الأسماء الإلهية من القهر والإرعاد والإبراق والأخذ والرحمة والعفو والتجاوز والانتقام والحساب والمصادرة وما ثم أصعب في الإلهيات من المصادرة إذا لم تقع عن حساب أو تجاوز في الأخذ حد الاستحقاق وذلك في قوله لا يُسْئَلُ عَمَّا يَفْعَلُ والأخذ والتجاوز بعد التقرير والحساب والسؤال في قوله وهُمْ يُسْئَلُونَ وقوله فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ\n\n\nفقرب بالصورة على نوعين في الخلافة\n\n\nالنوع الواحد خلافة عن تعريف إلهي بمنشور وخلافة لا عن تعريف إلهي مع نفوذ الأحكام منه ولا يسمى مثل هذا القرب على طريق الأدب بلسان الأدباء خلافة ولا هو خليفة وبالحقيقة هو خليفة وتلك خلافة فالخلفاء متفاضلون أيضا فيها والخلافة بغير التعريف أتم في القرب المعنوي فإن الخليفة بالتعريف والأمر الظاهر يبعد من المستخلف في الصورة فإن حكمه في العالم لم يكن عن أمر من غيره بل هو حاكم لنفسه فمن حكم في العالم بنفسه ونفذ حكمه فيه من غير أمر إلهي ولا استخلاف بتعريف ولا منشور فهو أقرب من الصورة الإلهية ممن عقدت له الخلافة عن أمر إلهي بتعريف ومنشور لكنه أقرب إلى السعادة المطلوبة له من ذلك الذي لم يقترن بخلافته أمر إلهي والقرب إلى السعادة هو المطلوب عند العلماء بالله وهذا القدر كاف في معرفة القرب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 260: On the Knowledge of Proximity\n\nThis [Proximity (القرب)] is the performance of acts of obedience (الطاعات). Sometimes they use this term intending the proximity of <<the distance of two bow-lengths>> (قابَ قَوْسَيْنِ), which are the two arcs of a circle when cut by a line, <<or nearer>> (أَوْ أَدْنى).\n\n> When a sphere is cut by a line, and two arcs appear,\n> That is the Proximity of the Real (الحق), so reflect upon it.\n> To a Reality (حقيقة) nearer than those two, and when you attain it,\n> What the sight decrees becomes manifest.\n> Indeed, the ascensions (المعارج) for the spirits (الأرواح) have a relationship\n> Contrary to the relationship of what the eye traverses.\n\n### [The Requirement in Proximity is that it be an Attribute of the Servant]\n\nAllah the Exalted said: <<And We are nearer to him than his jugular vein>> (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ). Thus, He described Himself with Proximity to His servants. However, the Proximity sought is that it be an attribute (صفة) of the servant, so that the servant is characterized by Proximity to the Real (الحق), just as the Real is characterized by Proximity to him, as He said: <<And He is with you wherever you are>> (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ).\n\nThe men [of God] seek to be with the Real always, in whatever form He manifests (تجلى). And He is continuously manifesting in the forms of His servants always. Thus, the servant is with Him wherever He manifests constantly, just as the servant is never devoid of 'whereness' (أينية) constantly. And Allah is with him wherever he is constantly. The 'whereness' (أينية) of the Real is the form in which He manifests. The Gnostics (العارفون) are continuously in the witnessing (شهود) of Proximity, because they are continuously witnessing the forms, both in their own souls (نفوسهم) and outside their souls, and there is nothing but the Self-disclosure (تجلى) of the Real.\n\nAs for the Proximity that is the performance of acts of obedience (الطاعات), that Proximity is related to the servant's happiness (سعادة) through salvation from his wretchedness (شقاوته). The servant's happiness lies in attaining all his aims entirely, and this only occurs for him in Paradise (الجنة). As for this world (الدنيا), he must necessarily abandon some of his aims that detract from his happiness. The proximity of the common people (العامة) and general proximity is proximity to happiness, so he obeys in order to be happy. The proximity of the Gnostics (العارفين) is what we have mentioned, and it includes happiness and more.\n\nWere it not for the Divine Names (الأسماء الإلهية) and their ruling (حكمها) in the Existents (الأكوان), the ruling of Proximity and Distance would not appear in the World (العالم). Every servant, at every moment, must be characterized by Proximity to one Divine Name (اسم إلهي) and Distance from another Name that has no ruling over him at that time. If the ruling of that Name, which is dominant at the time and with which the servant is characterized by Proximity, grants the servant salvation from wretchedness and the attainment of his happiness, then that is the Proximity sought by the People [Sufis]. This includes everything that grants the servant happiness. If it does not grant that, it is not Proximity according to the People, even if it is proximity from another perspective, not according to the established technical usage (الاصطلاح).\n\nThe Messenger of Allah (peace and blessings be upon him) informed us from his Lord concerning this chapter that Allah says: \"My servants do not draw near to Me with anything more beloved to Me than the performance of what I have made obligatory upon them. And My servant continues to draw near to Me through supererogatory acts (النوافل) until I love him. When I love him, I am his hearing, his sight, his hand, and his supporter.\"\n\nAnd He, the Glorified, said in the authentic report: \"Whoever draws near to Me by a span, I draw near to him by a cubit. Whoever draws near to Me by a cubit, I draw near to him by an arm's length. And whoever comes to Me walking, I come to him running.\"\n\nAnd Allah the Exalted said: <<And when My servants ask you concerning Me, then indeed I am near (قَرِيبٌ). I respond to the invocation of the supplicant when he calls upon Me.>> (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ). And He said concerning the dying person: <<And We are nearer to him than you, but you do not see.>> (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ). Its meaning, according to us, is: you do not distinguish (تميزون). He means: you see, but you do not know what you see, so it is as if you do not see.\n\n### [That Proximity to Allah is of Three Kinds]\n\nKnow that Proximity to Allah is of three kinds:\n\n1. Proximity through speculation (النظر) in the knowledge (معرفة) of Allah to the utmost of one's ability, whether one is correct or mistaken after exerting effort in striving (الاجتهاد) in that. The striver may believe something that is not a proof (برهان) to be a proof, and Allah rewards him with the reward of those who possess sound proofs. He, the Glorified, drew attention to what can be understood from what we have mentioned, which is His saying: <<And whoever invokes, along with Allah, another deity for which he has no proof>> (وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ). Some scholars hold that striving is permissible in both subsidiary matters (الفروع) and fundamental principles (الأصول). If he errs, he has one reward, and if he is correct, he has two rewards.\n\n### [The Second Kind: Proximity through Knowledge]\n\n2. The other kind is Proximity through Knowledge (العلم).\n\n3. The third kind is Proximity through Action (العمل). This is divided into two sections: Proximity through performing obligatory duties (الواجبات) and Proximity through recommended acts (المندوبات) in both outward and inward action.\n\nAs for the Proximity of Knowledge (قرب العلم), its highest degree is the Unification (توحيد) of Allah in His Divinity (ألوهته), for there is no god but He. If this is based on Witnessing (شهود) and not on speculation (نظر) and reflection (فكر), then he is among the People of Knowledge (أولي العلم) whom Allah mentioned in His saying: <<Allah witnesses that there is no god except Him, and [so do] the angels and those of knowledge>> (شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ). This is because if the testimony (الشهادة) is not based on Witnessing, then it is not [true testimony]. Witnessing is not entered by doubt or suspicion. If he unifies Him through the evidence provided by speculation, he is not among this mentioned group. For every person of reflection, even if it produces knowledge for him, doubt may cross his mind regarding his evidence, or a suspicion regarding his proof, leading him to confusion and the need to reflect on refuting that suspicion. Therefore, the strength of the person of speculation in the knowledge it yields is not equal to the strength of the person of Witnessing. This category [the person of speculation], if Allah decrees that he enters the Fire due to reasons that necessitated it, is the one whom the Real (الحق) will bring out of the Fire after the intercession of the intercessors.\n\nAs for the Proximity of Action (قرب العمل), it is outward knowledge, which relates to the limbs (الجوارح), and inward knowledge, which relates to the soul (النفس). The most general of inward actions is faith (الإيمان) in Allah and what came from Him, based on the statement of the Messenger, not based on knowledge of it. The action of faith encompasses all deeds and abstentions. There is no believer who commits an outward or inward transgression (معصية) except that he has in it a means of Proximity (قربة) to Allah, by virtue of his belief that it is a transgression. Thus, the believer's evil deed is never pure without being mixed with a righteous deed. Concerning those whose attribute is this, Allah the Exalted says: <<Perhaps Allah will turn to them in forgiveness>> (عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ). What He mentioned for them is a means of Proximity. He did not turn to them in this verse so that they might repent, but rather it is a return (رجوع) through pardon and overlooking. And 'Perhaps' (عسى) from Allah is obligatory according to all scholars.\n\nThe condition that validates the acceptance of all obligatory duties (الفرائض) is the obligation of faith (فرض الايمان). Then the servant draws near by performing the obligatory duties. Whoever attains its fruit here, becomes the hearing of the Real and the sight of the Real. Thus, the Real wills through his willing, without his knowing that his will is the will of Allah for its occurrence. If he knows, he is not the possessor of this station (مقام). This is the measure (ميزان) of performing obligatory duties, and it is the most beloved thing by which one draws near to Allah.\n\nAs for the Proximity of supererogatory acts (قرب النوافل), Allah also loves it, and Allah's love grants that the Real becomes his hearing and his sight. This is its measure in the Proximity of supererogatory acts. Since love has distinct levels in the lover, it is said: 'beloved' and 'more beloved'. Allah described Himself with 'more beloved' (أحب) in His saying: \"more beloved to Me than the performance of what I have made obligatory upon him.\" And regarding the supererogatory acts, He said: \"I love him\" (أحببته) without comparison. He made faith in Him and what came from Him obligatory upon him. Thus, the believer has the rank of 'love' and 'more beloved'.\n\nAs for the action of the limbs (عمل الجوارح), it is also Proximity, and the limb must necessarily reap its fruit—that is, the fruit of its action—for every human being without restriction. However, they are in different classes regarding this, regardless of which abode they are in or which category they belong to. Whether one intended Proximity by that action or not, the action seeks its measure, and since it occurred from the limb, it is a right for the limb. The intention (النية) is a right for the soul (النفس). Even if someone remembers Allah with a wicked oath (يمين فاجرة) by which he unjustly takes the right of another, the limb would have the reward of remembering Allah for what occurred on the tongue, while the soul bears the burden of what it intended by that. The indication of what we have mentioned is that the ruling of the outward Law (ظاهر الشرع) nullified the claimant's right due to his oath. If its effect in the outward world is of this strength in this world, what do you think of what that limb, which remembers its Lord, will reap in the Hereafter? The limb has no knowledge of what the soul intended by that. Its portion is the utterance of the remembrance of Allah. It does not know whether that remembrance will bring harm upon the soul or not, nor does it know whether it is lawful or unlawful.\n\nThat is why, on the Day of Resurrection, when the limbs and skins testify to the deeds that occurred from them against the soul that directed them, they do not testify to the occurrence of a transgression or an act of obedience. Rather, their testimony is about what they did, and Allah knows the ruling concerning that action. For this reason, on the Day of Resurrection, <<their tongues, their hands, and their feet will testify against them as to what they used to do>> (تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ). They do not testify that the action was obedience or transgression, because their rank does not necessitate that. Thus, the human being, in terms of his structure (هيكله), is entirely happy, but in terms of his soul (نفسه), if he is a believer, he is a person of mixing [good and bad deeds].\n\n### [Indeed, Allah's Proximity is of Two Kinds]\n\nAs for Allah's Proximity to the servant, it is of two kinds. The first kind is the Proximity of mercy, compassion, overlooking, forgiveness, and beneficence (إحسان). The other kind is a Proximity that cannot be unveiled (كشفه), but we allude to it by saying: The Real (الحق), when He manifests (يتجلى) to every servant, must appear to him either in matter (مادة) or not in matter.\n\nIf He manifests to him in matter, which is the form (الصورة), the Proximity follows that matter in the session of Witnessing (مجلس الشهود) and the Presence of Vision (حضرة الرؤية). If He manifests to him without matter, it is the Proximity of station (منزلة) and rank (مرتبة), like the proximity of the minister, the judge, the governor, or the person of sensory perception (صاحب الحسية) to the King. This is a differentiated Proximity. The King may bring the lower-ranked person closer to his session to confide a matter to him that is executed within his rank, while the higher-ranked person is seated further away in that session. This proximity in that session does not imply that the lower-ranked person is higher in rank than the higher-ranked one, for the ruling of materials (المواد) differs from the ruling of souls (النفوس) in form.\n\nIf you know this, you have drawn near to the knowledge of the Proximity of the Real. Proximity between two things is on one level: whoever draws near to you, you are characterized by being near to him. In reality (نفس الأمر), there is no path to distance from Allah. Distance is merely a relative matter (أمر إضافي) that appears in the rulings of the Divine Names (الأسماء الإلهية). The time when a Divine Name rules over a person is the time when that person is characterized by Proximity to Distance, and the servant's Proximity to Him. The Divine Name that has no ruling over the person at that time is distant from him.\n\nHow can one be characterized by distance from you, or you be characterized by distance from him, when you are in His grasp (قبضته)? Did He not open His right hand (يده اليمنى) to Adam—exalted is He, and both His hands are blessed right hands—and spread it out, and behold, Adam and his progeny were in it? Will the wretchedness of one who is in the right hand of the Real be eternal? No, by Allah! The other grasp contained the entire World (العالم). Look at Adam's choice of the right hand of the Real for distinction, despite his knowing that both hands of his Lord are blessed right hands. It is nothing but what we have mentioned. Were it not for the manifestation (التجلي) to Adam being in a material form (صورة مادية), the two hands would not have been characterized by grasping and spreading.\n\nI have alerted you to the knowledge of Proximity so that you may witness it from yourself with Allah, if you are among the people of Self-disclosure (التجلي) in this abode. When the Self-disclosure occurs in materials (المواد), limits (الحدود) undoubtedly appear. Thus, the span, the cubit, the arm's length, the walking, and the running appear according to what the state (الحال) necessitates. The proximity of materials is dependent on the states (الأحوال). The Proximity in matter between the two near ones is according to the state, so that it may be known by that Proximity that his state granted that; thus, it is an interpreter of the states.\n\nAs for Proximity through possessing the Form (الصورة), that belongs only to the Caliphs/Vicegerents (الخلفاء) specifically, whether they are Messengers (رسلا) or not. Messengership (الرسالة) is not a Divine attribute (نعت إلهي); rather, it is a relationship between a sender (مرسل) and a recipient (مرسل إليه) for the purpose of acting as a deputy (ينوب) for Him in what He wishes to convey to that recipient. The Messenger (الرسول) is a Caliph and a deputy specifically in conveyance (التبليغ). The completion of the Caliphate (الخلافة) and deputyship is only in ruling according to what the realities of the Divine Names necessitate, such as overpowering (القهر), thundering (الإرعاد), lightning (الإبراق), seizing (الأخذ), mercy (الرحمة), pardon (العفو), overlooking (التجاوز), vengeance (الانتقام), reckoning (الحساب), and confiscation (المصادرة). There is nothing more difficult in Divine matters than confiscation if it does not occur after reckoning or if the seizing exceeds the limit of deservingness. This is in His saying: <<He is not questioned about what He does>> (لَا يُسْأَلُ عَمَّا يَفْعَلُ). Seizing and overlooking occur after confirmation, reckoning, and questioning, as in His saying: <<And they will be questioned>> (وَهُمْ يُسْأَلُونَ) and His saying: <<For Allah is the conclusive argument>> (فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ).\n\nProximity through the Form (الصورة) is of two kinds in the Caliphate:\n\n1. Caliphate based on a Divine designation (تعريف إلهي) with a decree (منشور).\n2. Caliphate not based on a Divine designation, yet with the execution of rulings (نفوذ الأحكام) from him.\n\nSuch Proximity is not called Caliphate in the language of the refined (لسان الأدباء) out of courtesy, nor is he called a Caliph. But in reality (بالحقيقة), he is a Caliph, and that is a Caliphate. Thus, the Caliphs are also differentiated in it. The Caliphate without designation is more complete in spiritual Proximity (القرب المعنوي). The Caliph by designation and outward command is distant from the one who appointed him (المستخلف) in the Form (الصورة), because his ruling in the World was not by command from another; rather, he is a ruler unto himself.\n\nWhoever rules in the World by himself and whose ruling is executed therein without a Divine command, designation, or decree, is nearer to the Divine Form (الصورة الإلهية) than the one whose Caliphate was established by a Divine command, designation, and decree. However, the latter is nearer to the desired happiness (السعادة المطلوبة) than the one whose Caliphate was not accompanied by a Divine command. Proximity to happiness is what is sought by the Gnostics of Allah (العلماء بالله). This much is sufficient for the knowledge of Proximity. <<And Allah speaks the Truth, and He guides to the way>> (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).",
    "ur": "باب نمبر دو سو ساٹھ قرب (القرب) کی معرفت میں\n\nیہ طاعات پر قائم رہنے کا نام ہے، اور کبھی وہ اسے مطلقاً استعمال کرتے ہیں اور اس سے مراد قابَ قَوْسَيْنِ (دو کمانوں کے فاصلے) کا قرب لیتے ہیں، اور یہ دائرے کے دو کمان ہیں جب اسے ایک خط سے کاٹا جائے، یا اس سے بھی کم (أَوْ أَدْنىٰ)۔\n\n> جب ایک کرہ خط سے کاٹ دیا جائے اور دو کمان ظاہر ہوں،\n> تو یہی ذات حق (الحق) کا قرب ہے، پس غور کرو۔\n>\n> اس حقیقت کی طرف جو ان دونوں سے بھی زیادہ قریب ہے،\n> اور جب تم اسے حاصل کر لو گے تو وہ ظاہر ہو جائے گا جس کا فیصلہ نظر کرتی ہے۔\n>\n> بے شک ارواح کے لیے عروج کی نسبت\n> اس نسبت کے خلاف ہے جس کے ذریعے بصارت سفر کرتی ہے۔\n\n### [مطلوب یہ ہے کہ قرب بندے کی صفت ہو]\n\nاللہ تعالیٰ نے فرمایا: \"اور ہم اس (انسان) کی شہ رگ سے بھی زیادہ قریب ہیں (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ)\"۔ پس اس نے اپنے آپ کو اپنے بندوں سے قرب (القرب) کے ساتھ متصف کیا۔ اور قرب (القرب) سے مطلوب یہ ہے کہ وہ بندے کی صفت ہو جائے، تاکہ وہ ذات حق (الحق) سے قرب کے ساتھ متصف ہو جائے، جیسا کہ ذات حق (الحق) اس سے قرب کے ساتھ متصف ہے، جیسا کہ اس نے فرمایا: \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ)\"۔ اور (صوفی) رجال یہ طلب کرتے ہیں کہ وہ ہمیشہ ذات حق (الحق) کے ساتھ رہیں، خواہ وہ کسی بھی صورت میں ظہور الٰہی (التجلی) فرمائے، اور وہ ہمیشہ اپنے بندوں کی صورتوں میں ظہور الٰہی (التجلی) فرماتا رہتا ہے۔ پس بندہ ہمیشہ اس کے ساتھ ہوتا ہے جہاں وہ ظہور الٰہی (التجلی) فرماتا ہے، جیسا کہ بندہ ہمیشہ \"کہاں\" (اَینِیَّت) سے خالی نہیں ہوتا، اور اللہ ہمیشہ اس کے ساتھ ہوتا ہے جہاں کہیں بھی وہ ہو۔ پس ذات حق (الحق) کی اَینِیَّت (کہاں ہونا) اس صورت کا نام ہے جس میں وہ ظہور الٰہی (التجلی) فرماتا ہے۔ پس عارفین ہمیشہ قرب (القرب) کے شہود (الشہود) میں رہتے ہیں، کیونکہ وہ ہمیشہ اپنی جانوں میں اور اپنی جانوں کے علاوہ صورتوں کے مشاہدے میں رہتے ہیں، اور یہ ذات حق (الحق) کے ظہور الٰہی (التجلی) کے سوا کچھ نہیں۔\n\nاور رہا وہ قرب (القرب) جو طاعات پر قائم رہنے کا نام ہے، تو وہ بندے کی شقاوت سے فوز و فلاح حاصل کر کے سعادت کے قریب ہونے کا نام ہے۔ اور بندے کی سعادت اس کے تمام مقاصد کے حصول میں ہے، اور یہ اسے صرف جنت میں ہی حاصل ہو سکتا ہے۔ لیکن دنیا میں، اسے اپنی بعض ایسی اغراض کو ترک کرنا پڑتا ہے جو اس کی سعادت میں خلل ڈالتی ہیں۔ پس عوام کا قرب (القرب) اور قرب عام صرف سعادت کے قریب ہونا ہے، لہٰذا وہ اطاعت کرتا ہے تاکہ سعادت حاصل کرے۔ اور عارفین کا قرب (القرب) وہ ہے جو ہم نے ذکر کیا، پس وہ سعادت اور اس سے بھی زیادہ کو شامل ہے۔ اور اگر اسماء الٰہیہ اور اکوان میں ان کا حکم نہ ہوتا تو عالم میں قرب اور بعد کا حکم ظاہر نہ ہوتا۔ کیونکہ ہر بندہ ہر وقت لازمی طور پر کسی ایک اسم الٰہی سے قرب (القرب) رکھنے والا ہوتا ہے، اور کسی دوسرے اسم سے بعد رکھنے والا ہوتا ہے جس کا اس وقت اس میں کوئی حکم نہیں ہوتا۔ پس اگر اس وقت میں حاکم اسم کا حکم، جس سے وہ قرب (القرب) کے ساتھ متصف ہے، بندے کو شقاوت سے فوز و فلاح اور اس کی سعادت کا حصول عطا کرے، تو یہی وہ قرب (القرب) ہے جو اہل اللہ کے نزدیک مطلوب ہے۔ اور یہ ہر وہ چیز ہے جو بندے کو سعادت عطا کرے۔ اور اگر وہ یہ عطا نہ کرے تو اہل اللہ کے نزدیک وہ قرب (القرب) نہیں ہے، اگرچہ وہ کسی دوسرے پہلو سے قرب ہو، نہ کہ اس اصطلاح کے لحاظ سے جس پر اتفاق ہوا ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے اس باب میں اپنے رب کی طرف سے خبر دی کہ اللہ فرماتا ہے: \"مجھ سے قرب حاصل کرنے والوں نے ان چیزوں سے زیادہ محبوب کسی چیز کے ذریعے قرب حاصل نہیں کیا جو میں نے ان پر فرض کی ہیں، اور میرا بندہ نوافل کے ذریعے مجھ سے قرب حاصل کرتا رہتا ہے یہاں تک کہ میں اس سے محبت کرنے لگتا ہوں، اور جب میں اس سے محبت کرتا ہوں تو میں اس کا کان، اس کی آنکھ، اس کا ہاتھ اور اس کا مددگار بن جاتا ہوں۔\"\n\nاور اللہ سبحانہ و تعالیٰ نے صحیح حدیث میں فرمایا: \"جو مجھ سے ایک بالشت قریب ہوتا ہے، میں اس سے ایک ہاتھ قریب ہوتا ہوں، اور جو مجھ سے ایک ہاتھ قریب ہوتا ہے، میں اس سے ایک بازو کے برابر قریب ہوتا ہوں، اور جو میری طرف چل کر آتا ہے، میں اس کی طرف دوڑ کر آتا ہوں۔\"\n\nاور اللہ تعالیٰ نے فرمایا: \"اور جب میرے بندے آپ سے میرے بارے میں پوچھیں، تو بے شک میں قریب ہوں (فَإِنِّي قَرِيبٌ)، میں دعا کرنے والے کی دعا قبول کرتا ہوں جب وہ مجھ سے دعا کرتا ہے (أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ)\"۔ اور میت کے حق میں فرمایا: \"اور ہم تم سے زیادہ اس کے قریب ہوتے ہیں، لیکن تم دیکھتے نہیں ہو (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ)\"۔ اور ہمارے نزدیک اس کا معنی یہ ہے کہ تم تمیز نہیں کرتے۔ یعنی تم دیکھتے تو ہو لیکن جو دیکھتے ہو اسے پہچانتے نہیں، لہٰذا گویا تم دیکھتے ہی نہیں۔\n\n### [قرب الٰہی کی تین اقسام]\n\nجان لو کہ اللہ سے قرب (القرب) تین طرح کا ہے۔\n\n۱. معرفت (المعرفۃ) الٰہی میں اپنی استطاعت کی حد تک غور و فکر کے ذریعے قرب (القرب)۔\n\nاس میں وہ درست ہو یا غلط، اس میں اجتہاد میں پوری کوشش صرف کرنے کے بعد۔ کبھی مجتہد کسی ایسی چیز کو دلیل سمجھ لیتا ہے جو دلیل نہیں ہوتی، تو اللہ اسے صحیح دلائل والوں کی طرح جزا دیتا ہے۔ اور اللہ سبحانہ و تعالیٰ نے اس چیز پر متنبہ فرمایا ہے جس سے ہماری ذکر کردہ بات سمجھی جاتی ہے، اور وہ اس کا یہ قول ہے: \"اور جو اللہ کے ساتھ کسی دوسرے معبود کو پکارتا ہے، جس کے لیے اس کے پاس کوئی دلیل نہیں (وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ)\"۔ اور بعض علماء نے یہ رائے دی ہے کہ اجتہاد فروع اور اصول دونوں میں جائز ہے، پس اگر وہ خطا کرے تو اسے ایک اجر ملتا ہے، اور اگر وہ درست ہو تو اسے دو اجر ملتے ہیں۔\n\n### [دوسری قسم علم کے ذریعے قرب]\n\n۲. اور دوسری قسم علم کے ذریعے قرب (القرب) ہے۔\n\n۳. اور تیسری قسم عمل کے ذریعے قرب (القرب) ہے۔\n\nاور یہ دو حصوں میں تقسیم ہوتا ہے: واجبات کی ادائیگی کے ذریعے قرب (القرب)، اور ظاہر و باطن کے عمل میں مستحبات کے ذریعے قرب (القرب)۔\n\nجہاں تک علم کے قرب (القرب) کا تعلق ہے، تو اس کا اعلیٰ ترین درجہ اللہ کی الوہیت میں توحید ہے، کیونکہ اس کے سوا کوئی معبود نہیں۔ پس اگر یہ شہود (الشہود) سے ہو، نہ کہ غور و فکر سے، تو یہ ان اہل علم میں سے ہے جن کا ذکر اللہ نے اپنے اس قول میں کیا: \"اللہ نے گواہی دی کہ اس کے سوا کوئی معبود نہیں، اور فرشتوں نے اور اہل علم نے بھی (شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ)\"۔ کیونکہ اگر شہادت شہود (الشہود) سے نہ ہو تو وہ شہادت نہیں ہے۔ بے شک شہود (الشہود) میں شک و شبہ داخل نہیں ہوتا۔ اور اگر وہ اسے اس دلیل کے ذریعے موحد جانے جو اسے غور و فکر نے دی ہے، تو وہ اس مذکورہ گروہ میں سے نہیں ہے۔ کیونکہ کوئی بھی صاحب فکر ایسا نہیں جس کے لیے اس نے علم پیدا کیا ہو، مگر یہ کہ اس کے دل میں اس کی دلیل میں کوئی خلل یا اس کے برہان میں کوئی شبہ پیدا ہو سکتا ہے، جو اسے حیرت اور اس شبہ کو رد کرنے کے لیے غور و فکر کی طرف لے جاتا ہے۔ اسی لیے صاحب نظر اپنے غور و فکر سے حاصل ہونے والے علم میں صاحب شہود (الشہود) جیسی قوت نہیں رکھتا۔ اور یہ صنف، اگر اللہ اس پر ایسے اسباب کی وجہ سے جہنم میں داخلہ لکھ دے جو اس کے لیے واجب ہوئے، تو یہی وہ ہے جسے ذات حق (الحق) شفاعت کرنے والوں کی شفاعت کے بعد جہنم سے نکالے گا۔\n\nاور رہا عمل کا قرب (القرب)، تو وہ ایک ظاہری علم ہے جو جوارح (اعضاء) سے متعلق ہے، اور ایک باطنی علم ہے جو نفس سے متعلق ہے۔ پس باطنی اعمال میں سب سے عام اللہ پر اور اس کی طرف سے آئی ہوئی چیزوں پر ایمان لانا ہے، رسول کے قول کی وجہ سے، نہ کہ اس کے علم کی وجہ سے۔ اور ایمان کا عمل تمام افعال اور تروک (چھوڑنے) کو شامل ہے۔ پس کوئی بھی مومن ایسا نہیں جو کوئی ظاہری یا باطنی معصیت کا ارتکاب کرے، مگر یہ کہ اس میں بھی اس کے لیے اللہ سے قرب (القرب) کا ایک پہلو ہوتا ہے، اس لحاظ سے کہ وہ اس پر ایمان رکھتا ہے کہ یہ معصیت ہے۔ پس مومن کا کوئی بھی برا عمل ایسا نہیں ہوتا جو نیک عمل کی آمیزش کے بغیر خالص ہو۔ اللہ تعالیٰ کا قول ان لوگوں کے بارے میں جن کی یہ صفت ہے: \"عنقریب اللہ ان پر مہربان ہو جائے گا (عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ)\"۔ اور جو قرب (القرب) ان کے لیے ذکر کیا گیا، تو اس آیت میں ان پر توبہ کا رجوع اس لیے نہیں ہوا کہ وہ توبہ کریں، بلکہ یہ عفو اور درگزر کے ساتھ رجوع ہے۔ اور اللہ کی طرف سے \"عَسَى\" (عنقریب) تمام علماء کے نزدیک واجب ہے۔\n\nپس تمام فرائض کی قبولیت کے لیے صحیح شرط ایمان کا فرض ہے۔ پھر بندہ فرائض کی ادائیگی کے ذریعے قرب (القرب) حاصل کرتا ہے۔ پس جسے یہاں اس کا پھل مل جائے، وہ ذات حق (الحق) کا کان اور آنکھ بن جاتا ہے، تو وہ ذات حق (الحق) کی ارادے سے ارادہ کرتا ہے، بغیر اس کے علم کے کہ اس کا ارادہ اللہ کا ارادہ ہے جو واقع ہو رہا ہے۔ اگر اسے علم ہو جائے تو وہ اس مقام کا مالک نہیں ہے۔ یہ فرائض کی ادائیگی کا معیار ہے، اور یہ سب سے محبوب چیز ہے جس کے ذریعے اللہ سے قرب حاصل کیا جاتا ہے۔ اور رہا نوافل کا قرب (القرب)، تو اللہ اسے بھی پسند کرتا ہے، اور اللہ کی محبت نے اسے یہ عطا کیا کہ ذات حق (الحق) اس کا کان اور اس کی آنکھ بن جائے۔ یہ نوافل کے قرب (القرب) میں اس کا معیار ہے۔ اور چونکہ محبت کے محب میں ممتاز درجات ہوتے ہیں، اس لیے کہا گیا: محب (محبت کرنے والا) اور اَحَبّ (زیادہ محبوب)۔ اور اللہ نے اپنے آپ کو اَحَبّ کے ساتھ متصف کیا اپنے اس قول میں: \"ان چیزوں سے زیادہ محبوب (بِأَحَبَّ إِلَيَّ) جو میں نے ان پر فرض کی ہیں\"۔ اور نوافل کے بارے میں فرمایا: \"میں نے اس سے محبت کی (أَحْبَبْتُهُ)\"، بغیر کسی فضیلت کے۔\n\nاور اس پر اللہ پر اور اس کی طرف سے آئی ہوئی چیزوں پر ایمان لانا فرض کیا گیا ہے۔ پس مومن کے لیے حب اور اَحَبّ دونوں کا مرتبہ ہے۔ اور جہاں تک جوارح (اعضاء) کے عمل کا تعلق ہے، تو وہ بھی قرب (القرب) ہے، اور لازمی ہے کہ ہر انسان کے حق میں جوارح اس کا پھل، یعنی اپنے عمل کا پھل، بغیر کسی قید کے حاصل کریں۔ لیکن وہ اس میں مختلف طبقات پر ہیں، خواہ وہ کسی بھی گھر میں ہوں یا کسی بھی صنف سے ہوں۔ اور خواہ اس عمل سے قرب (القرب) کا ارادہ کیا ہو یا نہ کیا ہو، کیونکہ عمل اپنا معیار طلب کرتا ہے، اور وہ جوارح سے واقع ہوا ہے، لہٰذا وہ اس کا حق ہے۔ اور نیت نفس کا حق ہے۔ یہاں تک کہ اگر کوئی شخص کسی فاجر قسم کے ساتھ اللہ کا ذکر کرے جس سے وہ کسی دوسرے شخص کا حق مار رہا ہو، تو جوارح کے لیے اللہ کے ذکر کا اجر ہوگا جو زبان پر جاری ہوا، اور نفس پر اس نیت کا بوجھ ہوگا جو اس نے کی تھی۔ اور جو ہم نے ذکر کیا ہے اس پر تنبیہ یہ ہے کہ ظاہر شریعت کا حکم یہ ہے کہ اس کی قسم سے طالب کا حق ساقط ہو جاتا ہے۔ پس جب دنیا میں اس کا اثر ظاہر میں اس قدر قوی ہے، تو تمہارا کیا خیال ہے کہ وہ جوارح جو اپنے رب کا ذکر کر رہی ہیں، آخرت میں کیا پھل حاصل کریں گی؟ کیونکہ جوارح کو اس نیت کی کوئی خبر نہیں ہوتی جو نفس نے کی ہے۔ پس اس کا حصہ اللہ کے ذکر کا نطق ہے، اسے یہ معلوم نہیں ہوتا کہ اس ذکر سے نفس پر کوئی وبال آئے گا یا نہیں، اور نہ ہی اسے یہ معلوم ہوتا ہے کہ یہ مشروع ہے یا غیر مشروع۔ اسی لیے جب جوارح اور کھالیں ان اعمال کی گواہی دیں گی جو ان سے نفس مدبرہ کے خلاف واقع ہوئے، تو وہ کسی معصیت یا طاعت کے واقع ہونے کی گواہی نہیں دیں گی، بلکہ ان کی گواہی صرف اس چیز کی ہوگی جو انہوں نے کیا، اور اللہ اس عمل میں اپنا حکم جانتا ہے۔ اور اسی لیے جب قیامت کا دن ہوگا تو: \"ان کی زبانیں، ان کے ہاتھ اور ان کے پاؤں ان کے اعمال کی گواہی دیں گے (تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ)\"۔ اور انہوں نے اس عمل کے طاعت یا معصیت ہونے کی گواہی نہیں دی، کیونکہ ان کا مرتبہ اس کا تقاضا نہیں کرتا۔ پس انسان اپنے ڈھانچے کے لحاظ سے مکمل طور پر سعادت مند ہے، اور اپنے نفس کے لحاظ سے، اگر وہ مومن ہے، تو وہ آمیزش (تخلیط) والا ہے۔\n\n### [قرب الٰہی دو طرح کا ہے]\n\nاور جہاں تک اللہ کا اس سے قرب (القرب) ہے، تو وہ دو طرح کا ہے۔ پہلی قسم رحمت، شفقت، درگزر، مغفرت اور احسان کا قرب ہے۔ اور دوسری قسم وہ قرب ہے جس کا کشف (الکشف) ممکن نہیں، لیکن ہم اس کی طرف اشارہ کرتے ہوئے کہتے ہیں کہ ذات حق (الحق) ہر بندے کے ساتھ جب اس پر ظہور الٰہی (التجلی) فرماتا ہے تو وہ یا تو کسی مادہ میں ظاہر ہوتا ہے یا غیر مادہ میں۔ اگر وہ کسی مادہ میں ظہور الٰہی (التجلی) فرمائے، اور وہ صورت ہے، تو قرب (القرب) شہود (الشہود) کی مجلس اور رؤیت کی حاضری میں اس مادہ کے تابع ہوگا۔ اور اگر وہ غیر مادہ میں ظہور الٰہی (التجلی) فرمائے، تو وہ منزلت اور مرتبے کا قرب ہوگا، جیسے بادشاہ سے وزیر، قاضی، حاکم اور حسیات کے مالک کا قرب، کیونکہ یہ ایک فضیلت والا قرب ہے۔ اور کبھی وہ کم مرتبے والے کو قریب کرتا ہے تاکہ اسے کسی ایسے معاملے میں سرگوشی کرے جو اس کے مرتبے میں نافذ ہو، اور اعلیٰ مرتبے والا اس مجلس میں اس سے زیادہ دور بیٹھا ہو۔ اور اس مجلس میں اس کا قرب یہ تقاضا نہیں کرتا کہ وہ اس سے اعلیٰ مرتبے والے سے زیادہ بلند رتبہ رکھتا ہے۔ کیونکہ صورت میں مادیات کا حکم نفوس کے حکم سے مختلف ہوتا ہے۔\n\nاور جب تم یہ جان لو گے تو تم ذات حق (الحق) کے قرب (القرب) کے علم کے قریب ہو جاؤ گے۔ اور دو چیزوں کے درمیان قرب (القرب) ایک ہی حد پر ہوتا ہے، پس جو تم سے قریب ہوا، تم اس سے قریب ہونے کی صفت سے متصف ہو گئے۔ اور حقیقت میں اللہ سے دوری کا کوئی راستہ نہیں، بلکہ دوری ایک اضافی امر ہے جو اسماء الٰہیہ کے احکام میں ظاہر ہوتا ہے۔ پس کسی شخص میں اسم الٰہی کے حکم کا وقت ہی اس کا قرب (القرب) سے متصف ہونے کا وقت ہے، اور بندے کا اس سے قرب (القرب) ہے۔ اور وہ اسم الٰہی جس کا اس شخص میں اس وقت کوئی حکم نہیں، وہ اس سے دور ہے۔ وہ کیسے تم سے دوری کے ساتھ متصف ہو سکتا ہے یا تم اس سے دوری کے ساتھ متصف ہو سکتے ہو جب کہ تم اس کی گرفت میں ہو؟ کیا اللہ تعالیٰ نے آدم کے لیے اپنا دایاں ہاتھ نہیں کھولا، حالانکہ اس کے دونوں ہاتھ مبارک دائیں ہیں؟ پس اس نے اسے پھیلایا تو اس میں آدم اور ان کی ذریت تھی۔ اور کیا جو ذات حق (الحق) کے دائیں ہاتھ میں ہو، اس کی شقاوت دائمی ہو سکتی ہے؟ نہیں، اللہ کی قسم! اور دوسری مٹھی میں تمام عالم تھا۔ پس تم آدم کے تمیز کے لیے ذات حق (الحق) کے دائیں ہاتھ کے انتخاب میں غور کرو، حالانکہ وہ جانتے تھے کہ ان کے رب کے دونوں ہاتھ مبارک دائیں ہیں۔ اور یہ وہی ہے جو ہم نے ذکر کیا۔ اور اگر آدم کے لیے ظہور الٰہی (التجلی) مادی صورت میں نہ ہوتا تو دونوں ہاتھ قبض اور بسط (بند کرنے اور پھیلانے) کی صفت سے متصف نہ ہوتے۔ اور میں نے تمہیں قرب (القرب) کی معرفت (المعرفۃ) پر متنبہ کر دیا ہے تاکہ تم اسے اپنے نفس سے اللہ کے ساتھ مشاہدہ کرو، اگر تم اس دنیا میں ظہور الٰہی (التجلی) کے اہل میں سے ہو۔\n\nاور جب مادیات میں ظہور الٰہی (التجلی) واقع ہوتا ہے تو بلا شبہ حدود آ جاتی ہیں، پس بالشت، ہاتھ، بازو، چلنا اور دوڑنا حال کے تقاضے کے مطابق آ جاتا ہے۔ کیونکہ مادیات کا قرب (القرب) احوال کے تابع ہوتا ہے۔ پس حال کے مطابق ہی قریب ہونے والوں کے درمیان مادہ میں قرب (القرب) ہوتا ہے، تاکہ اس قرب (القرب) سے معلوم ہو جائے کہ اس کے حال نے یہ عطا کیا ہے، پس یہ احوال کا ترجمان ہے۔\n\nاور جہاں تک صورت کے حصول کے ذریعے اللہ سے قرب (القرب) کا تعلق ہے، تو یہ صرف خلفاء کے لیے خاص ہے، خواہ وہ رسول ہوں یا نہ ہوں۔ کیونکہ رسالت کوئی الٰہی صفت نہیں ہے، بلکہ یہ بھیجنے والے اور جس کی طرف بھیجا گیا ہے، ان کے درمیان ایک نسبت ہے، تاکہ وہ اس کی طرف سے نیابت کرے جو وہ اس شخص کو پہنچانا چاہتا ہے جس کی طرف بھیجا گیا ہے۔ پس رسول خاص طور پر تبلیغ میں خلیفہ اور نائب ہوتا ہے۔ اور خلافت اور نیابت کی تکمیل صرف اس چیز کے ساتھ حکم کرنے میں ہے جس کا تقاضا اسماء الٰہیہ کی حقائق کرتی ہیں، جیسے قہر، گرج، چمک، پکڑ، رحمت، عفو، درگزر، انتقام، حساب اور مصادرہ (ضبط کرنا)۔ اور الٰہیات میں مصادرہ سے زیادہ مشکل کوئی چیز نہیں، جب وہ حساب کے بغیر واقع ہو یا استحقاق کی حد سے تجاوز کر کے پکڑ ہو۔ اور یہ اس کے اس قول میں ہے: \"اس سے نہیں پوچھا جائے گا جو وہ کرتا ہے (لَا يُسْأَلُ عَمَّا يَفْعَلُ)\"۔ اور تقرر، حساب اور سوال کے بعد پکڑ اور درگزر اس کے اس قول میں ہے: \"اور ان سے پوچھا جائے گا (وَهُمْ يُسْأَلُونَ)\"، اور اس کا قول: \"پس اللہ ہی کے لیے کامل دلیل ہے (فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ)\"۔\n\nپس خلافت میں صورت کے ذریعے قرب (القرب) دو طرح کا ہے۔ پہلی قسم: الٰہی تعریف کے ذریعے منشور کے ساتھ خلافت، اور دوسری خلافت جو الٰہی تعریف کے بغیر ہو، مگر اس سے احکام نافذ ہوتے ہوں۔ اور اس طرح کے قرب (القرب) کو اہل ادب کی زبان میں ادب کے طور پر خلافت نہیں کہا جاتا اور نہ ہی وہ خلیفہ ہوتا ہے، لیکن حقیقت میں وہ خلیفہ ہوتا ہے اور وہ خلافت ہے۔ پس خلفاء بھی اس میں ایک دوسرے سے افضل ہوتے ہیں۔ اور بغیر تعریف کے خلافت معنوی قرب (القرب) میں زیادہ کامل ہوتی ہے۔ کیونکہ تعریف اور ظاہری حکم کے ساتھ خلیفہ صورت میں مستخلف سے دور ہوتا ہے۔ کیونکہ عالم میں اس کا حکم کسی دوسرے کے حکم سے نہیں ہوتا، بلکہ وہ اپنے نفس کے لیے حاکم ہوتا ہے۔ پس جس نے عالم میں اپنے نفس سے حکم کیا اور اس کا حکم اس میں نافذ ہوا، بغیر کسی الٰہی حکم کے اور بغیر کسی تعریف یا منشور کے استخلاف کے، تو وہ الٰہی صورت سے اس شخص کے مقابلے میں زیادہ قریب ہے جسے الٰہی حکم، تعریف اور منشور کے ذریعے خلافت سونپی گئی ہے۔ لیکن وہ اس شخص کے مقابلے میں مطلوبہ سعادت کے زیادہ قریب ہے جس کی خلافت کے ساتھ کوئی الٰہی حکم شامل نہیں ہوا۔ اور سعادت کا قرب (القرب) ہی علماء باللہ کے نزدیک مطلوب ہے۔ اور یہ مقدار قرب (القرب) کی معرفت (المعرفۃ) کے لیے کافی ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "## باب دویست و شصتم در معرفت قرب\n\nو آن [قرب] عبارت است از انجام طاعات. و گاهی آن را اطلاق می‌کنند و منظورشان قرب قابَ قَوْسَيْنِ (به اندازه دو کمان) است، که آن دو، کمان‌های دایره‌ای هستند که با یک خط قطع شده باشد، أَوْ أَدْنى‏ (یا نزدیک‌تر).\n\n> چون گوی با خطی بریده شد و دو کمان پدیدار گشت *** آن است قرب حق (الحق)، پس عبرت گیرید\n> به سوی حقیقتی که از آن دو نزدیک‌تر است، پس اگر *** آن را به دست آوری، آنچه نظر حکم می‌کند آشکار می‌شود\n> همانا نسبت معراج‌ها برای ارواح *** برخلاف نسبت چیزی است که بصر با آن سیر می‌کند\n\n### [مطلوب در قرب آن است که صفت بنده باشد]\n\nخداوند متعال می‌فرماید: «و ما از رگ گردن به او نزدیک‌تریم» (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ). پس خداوند خود را به نزدیکی با بندگانش وصف کرده است. اما آنچه در قرب مطلوب است، این است که صفت بنده باشد تا به قرب از حق (الحق) متصف شود، همان‌گونه که حق (الحق) به قرب از او متصف است، چنانکه فرمود: «و او با شماست هر کجا که باشید» (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ). و مردان [اهل حق] می‌خواهند که همیشه با حق (الحق) باشند، در هر صورتی که تجلی (التجلی) کند. و او پیوسته در صور بندگانش دائماً تجلی می‌کند. پس بنده همیشه با اوست، هر جا که تجلی کند، همان‌گونه که بنده همیشه از «أینیّت» (کجا بودن) خالی نیست و خداوند همیشه با اوست هر کجا که باشد. پس أینیّت حق (الحق) صورت چیزی است که در آن تجلی می‌کند. بنابراین، عارفان پیوسته در شهود (الشهود) قرب دائمی هستند، زیرا همیشه در شهادت صور در نفوس خود و در غیر نفوس خود هستند، و جز تجلی حق (التجلی الحق) چیزی نیست.\n\nاما قربی که عبارت است از انجام طاعات، آن قرب به سعادت بنده است از طریق رهایی از شقاوتش. و سعادت بنده در رسیدن به تمامی خواسته‌هایش است، و این برای او جز در بهشت حاصل نمی‌شود. اما در دنیا، ناگزیر است که برخی از خواسته‌هایی را که مخلّ سعادت او هستند، ترک کند. پس قرب عامه و قرب عمومی، همان قرب به سعادت است؛ اطاعت می‌کند تا سعادتمند شود. و قرب عارفان همان است که ذکر کردیم، که سعادت و افزون بر آن را در بر می‌گیرد. و اگر اسماء الهی (الأسماء الإلهية) و حکم آن‌ها در اکوان نبود، حکم قرب و بعد در عالم ظاهر نمی‌شد. زیرا هر بنده‌ای در هر زمانی ناگزیر است که صاحب قرب از یک اسم الهی باشد و صاحب بعد از اسم دیگری که در آن زمان حکمی برای او ندارد. پس اگر حکم آن اسم حاکم در آن زمان که بنده به قرب آن متصف است، به بنده رستگاری از شقاوت و دستیابی به سعادتش را بدهد، آن همان قرب مطلوب نزد این قوم است، و آن هر چیزی است که به بنده سعادت بخشد. و اگر آن را ندهد، نزد این قوم قرب نیست، هرچند از وجه دیگری قرب باشد، نه از حیث آنچه اصطلاح بر آن واقع شده است.\n\nرسول خدا (صلی الله علیه و آله و سلم) در این باب از پروردگارش خبر داد که خداوند می‌فرماید: «متقربان به چیزی نزد من محبوب‌تر از انجام آنچه بر آن‌ها واجب کرده‌ام، تقرب نجسته‌اند. و بنده پیوسته با نوافل به من تقرب می‌جوید تا آنکه او را دوست بدارم. پس چون او را دوست بدارم، گوش و چشم و دست و مؤید او خواهم بود.»\n\nو خداوند سبحان در خبر صحیح فرمود: «هر کس به اندازه یک وجب به من نزدیک شود، من به اندازه یک ذراع (آرنج تا سر انگشتان) به او نزدیک می‌شوم، و هر کس به اندازه یک ذراع به من نزدیک شود، من به اندازه یک باع (دو دست گشاده) به او نزدیک می‌شوم، و هر کس شتابان به سوی من آید، من دوان دوان به سوی او می‌روم.»\n\nو خداوند متعال فرمود: «و هرگاه بندگانم از من بپرسند، پس همانا من نزدیکم؛ دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم» (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ). و در حق میت فرمود: «و ما از شما به او نزدیک‌تریم، ولی شما نمی‌بینید» (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ). و معنای آن نزد ما این است که «تمییز نمی‌دهید»؛ یعنی می‌بینید ولی آنچه را می‌بینید نمی‌شناسید، پس گویی نمی‌بینید.\n\n### [قرب از خداوند بر سه گونه است]\n\nبدان که قرب از خداوند بر سه گونه است:\n\n۱. قرب از طریق نظر در معرفت (المعرفة) خداوند، به اندازه توانایی.\nچه در آن به صواب رسد و چه خطا کند، پس از بذل نهایت تلاش در اجتهاد در آن. چه بسا مجتهد چیزی را که برهان نیست، برهان بپندارد، و خداوند او را به پاداش صاحبان براهین صحیح پاداش دهد. و خداوند سبحان به آنچه از آن، مطلب ما فهمیده می‌شود، تنبیه کرده است، و آن قول اوست: «و هر کس با خداوند، معبود دیگری را بخواند که برهانی بر آن ندارد» (وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ). و برخی از علما بر این نظرند که اجتهاد در فروع و اصول جایز است؛ اگر خطا کند، یک پاداش دارد و اگر به صواب رسد، دو پاداش.\n\n### [نوع دوم قرب به علم]\n\n۲. و نوع دیگر، قرب به علم است.\n\n۳. و نوع سوم، قرب به عمل است.\nو این [قرب به عمل] به دو بخش تقسیم می‌شود: قرب به انجام واجبات و قرب به مستحبات در عمل ظاهر و باطن.\n\nاما قرب علم، بالاترین مرتبه آن توحید خداوند در الوهیت اوست، زیرا هیچ معبودی جز او نیست. اگر این توحید از طریق شهود (الشهود) باشد، نه از طریق نظر و فکر، پس او از «اولی العلم» (صاحبان علم) است که خداوند در این قول خود از آن‌ها یاد کرده است: «خداوند شهادت داد که هیچ معبودی جز او نیست، و فرشتگان و صاحبان علم نیز» (شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ). زیرا شهادت اگر از شهود (الشهود) نباشد، ارزشی ندارد؛ چرا که شک و تردید به شهود راه نمی‌یابد. اما اگر [کسی] او را با دلیلی که نظر به او داده است، توحید کند، از این طایفه مذکور نیست؛ زیرا هیچ صاحب فکری نیست، هرچند علمی برایش حاصل شود، مگر آنکه ممکن است خطایی در دلیلش و شبهه‌ای در برهانش به ذهنش خطور کند که او را به تحیر و نظر در رد آن شبهه بکشاند. به همین دلیل، صاحب نظر در علمی که نظر به او می‌دهد، به قوت صاحب شهود (الشهود) قوی نیست. و این صنف [صاحبان نظر] اگر خداوند به دلایلی حکم به دخولشان در آتش کند، همان کسانی هستند که حق (الحق) پس از شفاعت شفاعت‌کنندگان، آن‌ها را از آتش خارج می‌سازد.\n\nاما قرب عمل، آن علم ظاهر است که به جوارح (اعضای بدن) مربوط می‌شود، و علم باطن است که به نفس مربوط می‌شود. فراگیرترین اعمال باطنی، ایمان به خدا و آنچه از جانب او آمده است، به دلیل قول رسول (نه به دلیل علم به آن). و عمل ایمان شامل تمامی افعال و ترک‌ها می‌شود. هیچ مؤمنی مرتکب معصیت ظاهری یا باطنی نمی‌شود، مگر آنکه در آن، از حیث ایمانش به اینکه آن معصیت است، قربی به سوی خدا دارد. پس هرگز عمل بد مؤمن خالص نمی‌شود مگر آنکه عمل صالحی با آن آمیخته باشد. قول خداوند متعال در مورد کسی که صفتش چنین است: «امید است که خداوند توبه آن‌ها را بپذیرد» (عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ). و آنچه برای آن‌ها قرب ذکر شده است، این نیست که در این آیه بر آن‌ها توبه کرده تا آن‌ها توبه کنند، بلکه بازگشت به عفو و گذشت است. و «عسی» (امید است) از جانب خداوند، نزد همه علما واجب است.\n\nپس شرط صحت قبول تمامی فرایض، فرض ایمان است. سپس بنده با انجام فرایض تقرب می‌جوید. کسی که ثمره آن [فرایض] در اینجا برایش حاصل شود، گوش و چشم حق (الحق) خواهد بود. پس حق (الحق) با اراده او اراده می‌کند، بدون آنکه او بداند که مرادش، مراد خداوند برای وقوع است. اگر بداند، صاحب این مقام نیست. این معیار انجام فرایض است و آن محبوب‌ترین چیزی است که با آن به خدا تقرب جسته می‌شود.\n\nاما قرب نوافل (مستحبات)، آن نیز مورد محبت خداوند است، و محبت خداوند به او این را داده است که حق (الحق) گوش و چشم او باشد. این معیار آن در قرب نوافل است. و چون محبت دارای مراتب متمایزی در محب است، گفته شده است: «محب» و «احبّ» (محبوب‌تر). و خداوند خود را به «احبّ» وصف کرده است در قولش: «محبوب‌تر نزد من از انجام آنچه بر آن‌ها واجب کرده‌ام». و در نوافل فرمود: «او را دوست بدارم» بدون مفاضله [برتری دادن]. و ایمان به او و آنچه از جانب او آمده است، بر او واجب شده است. پس مؤمن دارای مرتبه حب و احبّ است.\n\nاما عمل جوارح (اعضای بدن)، آن نیز قرب است و ناگزیر است که جارحه ثمره عمل خود را در حق هر انسانی بچیند، بدون هیچ قیدی. اما آن‌ها در این امر در طبقات مختلفی هستند، در هر سرایی که باشند یا از هر صنفی که باشند. و چه قصد قربت با آن عمل داشته باشد یا نداشته باشد، عمل طالب میزان خود است و چون از جارحه صادر شده، حق آن است، و نیت حق نفس است. تا آنجا که اگر کسی با دست راست فاجری که با آن حق دیگری را قطع می‌کند، ذکر خدا بگوید، برای جارحه اجر ذکر خدا به دلیل آنچه بر زبان جاری شده است، خواهد بود، و بر نفس، وزر آنچه نیت کرده است. و تنبیه بر آنچه ذکر کردیم، این است که حکم ظاهر شرع، حق طلب‌کننده را با قسم او ساقط کرده است. پس اگر اثر آن [عمل] در ظاهر دنیا با این قوت باشد، گمانت چیست به آنچه آن جارحه ذاکر پروردگارش در آخرت می‌چیند؟ زیرا جارحه از آنچه نفس نیت کرده است، خبری ندارد. پس بهره آن، نطق به ذکر خداست. نمی‌داند که آیا آن ذکر وبالی بر نفس دارد یا نه، و نمی‌داند که آیا مشروع است یا غیر مشروع. به همین دلیل، هنگامی که جوارح و پوست‌ها بر نفس مدبر خود به آنچه از اعمال از آن‌ها سر زده است، شهادت می‌دهند، شهادت به وقوع معصیت یا طاعت نمی‌دهند، بلکه شهادت آن‌ها به کاری است که انجام داده‌اند، و خداوند حکم آن عمل را می‌داند. و به همین دلیل، چون روز قیامت شود، «زبان‌ها و دست‌ها و پاهایشان بر آنچه انجام می‌دادند، شهادت می‌دهند» (تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ). و شهادت نمی‌دهند که آن عمل طاعت بوده یا معصیت، زیرا مرتبه آن‌ها اقتضای آن را ندارد. پس انسان از حیث هیکلش کاملاً سعادتمند است، و از حیث نفسش، اگر مؤمن باشد، صاحب آمیختگی [عمل صالح و بد] است.\n\n### [قرب خداوند بر دو نوع است]\n\nاما قرب خداوند از بنده بر دو نوع است:\nنوع اول: قرب رحمت و عطوفت و گذشت و مغفرت و احسان.\nنوع دیگر: قربی است که کشف (الکشف) آن ممکن نیست، اما به آن اشاره می‌کنیم و می‌گوییم: حق (الحق) در هنگام تجلی (التجلی) بر هر بنده‌ای، خالی از این نیست که یا در ماده‌ای ظاهر شود یا در غیر ماده. اگر در ماده‌ای تجلی کند که همان صورت است، قرب تابع آن ماده در مجلس شهود (الشهود) و محضر رؤیت خواهد بود. و اگر در غیر ماده‌ای تجلی کند، قرب منزلت و مرتبه خواهد بود، مانند نزدیکی وزیر و قاضی و والی و صاحب حسّیه به پادشاه، که قربی است متفاضل (دارای برتری). و چه بسا مجلس فرد پایین‌تر را نزدیک کند تا با او در مورد امری که در مرتبه او نافذ است، نجوا کند، در حالی که فرد بالاتر در آن مجلس از او دورتر باشد. و نزدیکی او در آن مجلس به این معنا نیست که رتبه‌اش از آن فرد بالاتر، بالاتر است؛ زیرا حکم مواد با حکم نفوس در صورت متفاوت است.\n\nو چون این را دانستی، به علم قرب حق (الحق) نزدیک شده‌ای. و قرب میان دو چیز بر یک حد است؛ پس هر کس به تو نزدیک شود، تو نیز به اینکه از او نزدیکی، متصف شده‌ای. و در نفس‌الامر، راهی برای دوری از خداوند نیست، بلکه دوری امری اضافی است که در احکام اسماء الهی (الأسماء الإلهية) ظاهر می‌شود. پس زمان حکم اسم الهی در شخص، زمان اتصاف او به قرب از بعد و قرب بنده از اوست. و اسم الهی که در آن زمان حکمی در شخص ندارد، از او دور است. چگونه کسی که تو در قبضه او هستی، به دوری از تو متصف شود یا تو به دوری از او متصف شوی؟ آیا خداوند دست راست خود را برای آدم باز نکرد؟ و هر دو دست او یمین مبارک است. پس آن را گشود و ناگهان آدم و ذریه‌اش در آن بودند. و آیا شقاوت کسی که در یمین حق (الحق) است، جاودانه می‌شود؟ نه، به خدا سوگند. و قبضه دیگر، تمامی عالم بود. پس در انتخاب آدم، یمین حق (الحق) را برای تمییز بنگر، با وجود اینکه می‌دانست هر دو دست پروردگارش یمین مبارک است. و جز آنچه ذکر کردیم، نیست. و اگر تجلی (التجلی) برای آدم در صورت مادی نبود، دو دست به قبض و بسط متصف نمی‌شدند.\n\nو من تو را بر معرفت قرب آگاه ساختم تا آن را از نفس خود با خداوند شهود (الشهود) کنی، اگر از اهل تجلی (التجلی) در این دنیا باشی. و هنگامی که تجلی در مواد واقع شود، حدود بدون شک می‌آیند؛ پس وجب و ذراع و باع و سعی و هروله (دویدن) بر حسب آنچه حال اقتضا می‌کند، می‌آیند. زیرا قرب مواد تابع احوال است. پس قرب در ماده میان دو نزدیک، به اندازه حال است تا با آن قرب دانسته شود که حال او آن را داده است، پس آن [قرب] ترجمان احوال است.\n\nاما قرب از خداوند به واسطه حیازت صورت، این تنها مخصوص خلفا است، چه رسول باشند و چه نباشند. زیرا رسالت، وصف الهی نیست، بلکه نسبتی است میان فرستنده و فرستاده شده تا از جانب او در آنچه می‌خواهد به شخص فرستاده شده ابلاغ کند، نیابت کند. پس رسول، خلیفه و نایب در ابلاغ است به طور خاص. و تمامیت خلافت و نیابت تنها در حکم کردن به آنچه حقایق اسماء الهی (الأسماء الإلهية) اقتضا می‌کند، از قهر و رعد و برق و گرفتن و رحمت و عفو و گذشت و انتقام و حساب و مصادره است. و در الهیات چیزی دشوارتر از مصادره نیست، اگر بدون حساب یا تجاوز از حد استحقاق در گرفتن واقع شود، و آن در قول اوست: «از آنچه انجام می‌دهد، سؤال نمی‌شود» (لَا يُسْأَلُ عَمَّا يَفْعَلُ). و گرفتن و گذشت پس از اقرار و حساب و سؤال در قول اوست: «و آن‌ها سؤال می‌شوند» (وَهُمْ يُسْأَلُونَ). و قول او: «پس حجت بالغه از آن خداست» (فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ).\n\nپس قرب به صورت در خلافت بر دو نوع است:\nنوع اول: خلافت از طریق تعریف الهی با منشور [حکم رسمی].\nنوع دوم: خلافت بدون تعریف الهی، همراه با نفوذ احکام از او. و چنین قربی به طریق ادب در زبان ادیبان، خلافت نامیده نمی‌شود و او خلیفه نیست، اما در حقیقت او خلیفه است و آن [عمل او] خلافت است. پس خلفا نیز در آن با هم برتری دارند. و خلافت بدون تعریف، در قرب معنوی کامل‌تر است؛ زیرا خلیفه با تعریف و امر ظاهر، از مستخلف در صورت دور می‌شود. زیرا حکم او در عالم از امر دیگری نبوده، بلکه او حاکم بر نفس خود است. پس کسی که در عالم به نفس خود حکم کند و حکمش در آن نافذ شود، بدون امر الهی و بدون استخلاف با تعریف و منشور، از صورت الهی به کسی که خلافت برایش با امر الهی و تعریف و منشور منعقد شده، نزدیک‌تر است. اما او به سعادت مطلوب خود نزدیک‌تر است تا آن کسی که امر الهی به خلافتش مقرون نشده است. و قرب به سعادت، مطلوب نزد علمای بالله است. و این مقدار در معرفت قرب کافی است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}