{
  "id": 191,
  "title": {
    "ar": "الباب الحادي والتسعون ومائة في معرفة السفر والطريق وهو توجه القلب إلى الله بالذكر عن مراسم الشرع بالعزائم لا بالرخص ما دام مسافرا",
    "en": "Chapter One Hundred and Ninety-One: Concerning the Gnosis (معرفة) of the Journey (السفر) and the Path (الطريق), which is the orientation of the heart toward Allah through Remembrance (الذكر), away from the customs of the Sacred Law (الشرع), by means of the Strict Obligations (العزائم) and not the Dispensations (الرخص), as long as one remains a traveler.",
    "ur": "باب ایک سو اکیانوے: سفر اور طریق کی معرفت (المعرفۃ) کے بیان میں، اور یہ (سفر) ذکر کے ذریعے قلب کا اللہ کی طرف رجوع کرنا ہے، جو شریعت کی رسومات سے ہٹ کر، رخص (آسانیوں) کے بجائے عزائم (سختیوں) کے ساتھ ہوتا ہے، جب تک کہ سالک مسافر رہے۔",
    "fa": "باب صد و نود و یکم در معرفت سفر و طریق، و آن توجه قلب به سوی حق (الله) با ذکر است، از طریق آداب شریعت با عزیمت‌ها نه با رخصت‌ها، تا زمانی که سالک در سفر است."
  },
  "content": {
    "ar": "## (الباب الحادي والتسعون ومائة في معرفة السفر والطريق وهو توجه القلب إلى الله بالذكر عن مراسم الشرع بالعزائم لا بالرخص ما دام مسافرا)\n\n\n> توجه القلب بالأذكار مرتحلا *** على مراسم دين الله عنوان‏\n\n\n> على التحقق إن القلب في سفر *** عزما وفيه دلالات وبرهان‏\n\n\n> وكل متصف بالسير راحته *** معدومة العين والأحوال سلطان‏\n\n\n> الرب ينزل من عرش إلى فلك *** أدنى أتاك به وحي وفرقان‏\n\n\n> إليك وحدك دون الخلق كلهم *** وفي تنزله للكون تبيان‏\n\n\n> على محبته فينا وصورته *** تدعوه مني فلا يحجبك إنسان‏\n\n\n> وأنت حق وذاك الحق أنزله *** في مظهر قيدته فيه أركان‏\n\n\n### [السفر إلى الله‏]\n\n\nاعلم أيدك الله أن السفر حال المسافر والطريق هو ما يمشي فيه ويقطعه بالمعاملات والمقامات والأحوال والمعارف لأن في المعارف والأحوال الأسفار عن أخلاق المسافرين ومراتب العالم ومنازل الأسماء والحقائق ولهذا استحقت هذا اللقب وقد مشى الكلام في السالك والسلوك بما قد وقفت عليه والإنسان لما كان مجموع العالم ونسخة الحضرة الإلهية التي هي ذات وصفات وأفعال احتاج إلى مطرق يطرق له السلوك عليها والسفر فيها ليرى العجائب ويقتني العلوم والأسرار فإنه سفر تجارة فكان المطرق الشارع والطريق المطرقة الشريعة فمن سافر في هذه الطريق وصل إلى الحقيقة\nفثم سفر بحق وسفر بخلق فالسفر بالحق على نوعين سفر ذات وسفر صفة والإنسان الكامل يسافر هذه الأسفار كلها فيسافر بربه عن كشف إلهي ومعية محققة يكون فيها مع الحق كما هو الحق معنا أينما كنا وقد عين سبحانه لنفسه أماكن كما يليق بجلاله ووصف نفسه بتردده فيها فإذا كان العبد معه سافر بسفره فيسفر له إنه هو كما أسفر له أنه ليس هو فالسفر الرباني من العماء إلى العرش فيظهر في العرش بالاسم الرحمن ثم ينزل معه بالاسم الرب كل ليلة إلى السماء الدنيا ثم ينزل بالاسم الإله إلى الأرض ثم يصحبه بالهوية مع كل واحد من الكون ثم يسافر معه بالصحبة في سفر الكون ثم يختلف معه بالخلافة في الأهل ثم يسافر صحبة القرآن في سفره من كونه صفة الله إلى السماء الدنيا ثم يصحبه في سفره ثلاثا وعشرين سنة ثم يصحب الأسماء الإلهية في سفرها في الكون ثم يصحبه الكون في سفره من العدم إلى الوجود ثم يصحب الأنبياء في سفرهم فيصحب آدم في سفره من الجنة إلى الأرض ثم يصحبه في سفره في سبعمائة عمرة وثلاثمائة حجة ثم يصحب إدريس في سفره إلى المكان العلي ثم يصحب نوحا في سفره في سفينة نجاته إلى الجودي ثم يصحب إبراهيم عليه السلام في جميع أسفاره وكذلك كل نبي وملك كأسفار جبريل إلى كل نبي ورسول وكسفر ميكائيل والملائكة بالعروج والنزول وسفر السياحين منهم وسفر الكواكب في سيرها وسفر الأفلاك في حركاتها وسفر العناصر في استحالاتها وسفر التجلي في صوره إلى أن يقف على حقائق هذا كله ذوقا من نفسه لا يرتاب ولا يشك ويجرد من ذاته في كل سفر ما يناسب صاحب ذلك السفر من حق وخلق فهذا هو سفر العارفين وطرق العلماء بالله الراسخين‏\n\n",
    "en": "Chapter One Hundred and Ninety-One: Concerning the Gnosis of the Journey and the Path, which is the orientation of the heart toward Allah through Remembrance, following the ordinances of the Law by firm resolve, not by dispensations, as long as one is traveling.\n\nThe heart turns with acts of remembrance (الأذكار), journeying,\nUpon the ordinances of Allah’s religion, which is the sign.\n\nBased on verification (التحقق) that the heart is on a journey\nWith firm resolve (عزما), and in it are signs and proof.\n\nAnd every one characterized by traveling, his rest\nIs essentially non-existent (معدومة العين), and the spiritual states (الأحوال) are sovereign.\n\nThe Lord descends from the Throne (عرش) to the nearest sphere (فلك أدنى);\nRevelation (وحي) and the Criterion (فرقان) came to you concerning it.\n\nTo you alone, without all other creatures,\nAnd in His descent (تنزله) there is clarification for the cosmos (الكون).\n\nConcerning His love for us and His form (صورته),\nCall upon Him from me, and let no human veil you.\n\nAnd you are the Real (حق), and that Real has caused Him to descend\nInto a manifestation (مظهر) wherein pillars have constrained Him.\n\n### [The Journey to Allah (السفر إلى الله)]\n\nKnow, may Allah support you, that the journey (السفر) is the state (حال) of the traveler (المسافر). The Path (الطريق) is that wherein he walks and traverses it by means of spiritual practices (المعاملات), stations (المقامات), states (الأحوال), and gnosis (المعارف). This is because in gnosis and states are the journeys away from the characteristics of the travelers, the levels (المراتب) of the World (العالم), and the stations of the Names (الأسماء) and Realities (الحقائق). For this reason, they deserved this appellation. The discussion concerning the spiritual wayfarer (السالك) and the spiritual journey (السلوك) has proceeded in a manner you are already aware of.\n\nSince the human being (الإنسان) is the totality of the World (العالم) and the copy (نسخة) of the Divine Presence (الحضرة الإلهية)—which is Essence (ذات), Attributes (صفات), and Acts (أفعال)—he needs a guide (مطرق) who can pave the way for him to traverse upon it and journey within it, so that he may see wonders and acquire sciences and secrets, for it is a journey of commerce. Thus, the guide is the Lawgiver (الشارع), and the paved path is the Law (الشريعة). Whoever journeys upon this Path reaches the Reality (الحقيقة).\n\nThus, there is a journey by the Real (حق) and a journey by the creation (خلق). The journey by the Real (السفر بالحق) is of two types: the journey of the Essence (سفر ذات) and the journey of the Attribute (سفر صفة). The Perfect Human (الإنسان الكامل) travels all these journeys. He journeys by his Lord through a Divine Unveiling (كشف إلهي) and a verified companionship (معية محققة), wherein he is with the Real (الحق), just as the Real is with us wherever we may be. The Glorified One (سبحانه) has designated places for Himself, as befits His Majesty (جلاله), and He described Himself by His frequenting those places. So, if the servant is with Him, he journeys by His journey. Thus, He reveals to him that He is He, just as He revealed to him that He is not he.\n\nThe Lordly Journey (السفر الرباني) is from the Cloud (العماء) to the Throne (العرش), where He manifests upon the Throne by the Name *al-Rahman* (The All-Merciful). Then He descends with him by the Name *al-Rabb* (The Lord) every night to the lowest heaven (السماء الدنيا). Then He descends by the Name *al-Ilah* (The God) to the earth. Then He accompanies him by the Identity (الهوية) with every single entity in the cosmos (الكون). Then he journeys with Him in companionship (الصحبة) during the journey of the cosmos. Then he differs with Him by means of vicegerency (الخلافة) among the people.\n\nThen he journeys in companionship with the Quran in its journey from being an Attribute of Allah (صفة الله) to the lowest heaven. Then he accompanies it (the Quran) in its journey for twenty-three years. Then he accompanies the Divine Names (الأسماء الإلهية) in their journey throughout the cosmos. Then the cosmos accompanies him in its journey from non-existence (العدم) to existence (الوجود).\n\nThen he accompanies the Prophets (الأنبياء) in their journeys: he accompanies Adam in his journey from Paradise (الجنة) to the Earth, and then he accompanies him in his journey through seven hundred minor pilgrimages (*'umra*) and three hundred major pilgrimages (*hajj*). Then he accompanies Idris in his journey to the High Place. Then he accompanies Noah in his journey in his Ark of Salvation to Mount Judi. Then he accompanies Abraham (peace be upon him) in all his journeys.\n\nAnd likewise, every Prophet and Angel, such as the journeys of Gabriel to every Prophet and Messenger, and like the journey of Michael and the Angels in ascent (العروج) and descent (النزول), and the journey of the wanderers (السياحين) among them, and the journey of the stars in their courses, and the journey of the spheres (الأفلاك) in their movements, and the journey of the elements (العناصر) in their transformations, and the journey of the Theophany (التجلي) in its forms.\n\nThis continues until he stands upon the realities (حقائق) of all this through a direct tasting (ذوقا) from his own self, neither doubting nor wavering. And he strips away from his essence (ذاته) in every journey that which is appropriate to the master of that journey, whether it be the Real (حق) or the creation (خلق). This, then, is the journey of the Gnostics (العارفين) and the paths of those deeply rooted in Knowledge of Allah (العلماء بالله الراسخين).",
    "ur": "باب ایک سو اکیانوے: سفر اور طریق کی معرفت میں، اور یہ سفر جب تک جاری ہے، شرعی رسومات کے مطابق، رخصتوں کے بجائے عزائم کے ساتھ، ذکر کے ذریعے قلب کا اللہ کی طرف متوجہ ہونا ہے۔\n\nقلب کا اذکار کے ساتھ کوچ کرنا، *** اللہ کے دین کی رسومات پر بطور عنوان۔\nاس تحقیق پر کہ قلب سفر میں ہے *** عزم کے ساتھ، اور اس میں دلائل اور برہان ہیں۔\nاور ہر وہ شخص جو سیر (السير) سے متصف ہے، اس کا آرام معدوم ہے، *** اور احوال (الأحوال) ہی بادشاہ ہیں۔\nرب عرش (العرش) سے نچلے آسمان (فلك أدنى) کی طرف نزول فرماتا ہے، *** جس کے ذریعے تمہارے پاس وحی (وحي) اور فرقان (فرقان) آتا ہے۔\nصرف تمہاری طرف، تمام مخلوقات کے بغیر، *** اور اس کے نزول میں کائنات کے لیے وضاحت ہے۔\nہم میں اس کی محبت اور اس کی صورت (صورته) پر، *** وہ مجھے پکارتا ہے، پس کوئی انسان تمہیں حجاب نہ بنائے۔\nاور تم حق (حق) ہو، اور اس حق (الحق) نے اسے نازل کیا *** ایک ایسے مظهر (مظهر) میں جسے ارکان (أركان) نے مقید کر دیا۔\n\n### اللہ کی طرف سفر\n\nجان لو، اللہ تمہاری تائید کرے، کہ سفر (السفر) مسافر کا حال ہے، اور طریق (الطريق) وہ ہے جس پر وہ چلتا ہے اور اسے معاملات، مقامات (المقامات)، احوال (الأحوال)، اور معارف (المعارف) کے ذریعے طے کرتا ہے، کیونکہ معارف (المعارف) اور احوال (الأحوال) میں مسافروں کے اخلاق، عالم کے مراتب، اور اسماء (الأسماء) و حقائق (الحقائق) کی منازل سے سفر کرنا شامل ہے، اور اسی لیے یہ لقب (سفر) اس کے مستحق ہوئے۔ سالک (السالك) اور سلوک (السلوك) کے بارے میں کلام گزر چکا ہے جس سے تم واقف ہو چکے ہو۔ اور چونکہ انسان تمام عالم کا مجموعہ اور حضرۃ الٰہیہ (الحضرة الإلهية) کا نسخہ ہے جو کہ ذات (الذات)، صفات (الصفات)، اور افعال (الأفعال) پر مشتمل ہے، اس لیے اسے ایک ایسے راستے کی ضرورت تھی جو اس کے لیے اس پر سلوک (السلوك) اور اس میں سفر (السفر) کو ممکن بنائے تاکہ وہ عجائبات دیکھ سکے اور علوم و اسرار حاصل کر سکے، کیونکہ یہ ایک تجارتی سفر ہے۔ پس شارع (شریعت لانے والا) ہی راستہ دکھانے والا بنا، اور شریعت (الشريعة) ہی وہ طریق بنی جس پر چلا جائے۔ لہٰذا، جو شخص اس طریق میں سفر کرتا ہے وہ حقیقت (الحقيقة) تک پہنچ جاتا ہے۔\n\nپس ایک سفر حق (الحق) کے ساتھ ہے اور ایک سفر خلق (الخلق) کے ساتھ ہے۔ حق (الحق) کے ساتھ سفر دو قسم کا ہے: سفر ذات (سفر ذات) اور سفر صفت (سفر صفة)۔ اور انسان کامل (الإنسان الکامل) یہ تمام اسفار طے کرتا ہے۔ وہ اپنے رب کے ساتھ سفر کرتا ہے، الٰہی کشف (کشف إلهي) اور محققہ معیت کے ذریعے، جس میں وہ حق (الحق) کے ساتھ ہوتا ہے، جیسا کہ حق (الحق) ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں۔ اور اللہ سبحانہ و تعالیٰ نے اپنے لیے ایسے مقامات مقرر کیے ہیں جو اس کے جلال کے لائق ہیں، اور اس نے خود کو ان میں تردد (آنا جانا) سے متصف کیا ہے۔ پس جب بندہ اس کے ساتھ ہوتا ہے تو وہ اس کے سفر کے ساتھ سفر کرتا ہے، اور اس کے لیے یہ منکشف ہوتا ہے کہ وہ (بندہ) وہی ہے، جیسا کہ اس کے لیے یہ منکشف ہوا کہ وہ (بندہ) وہ نہیں ہے۔\n\nپس ربانی سفر (السفر الرباني) عماء (العماء) سے عرش (العرش) تک ہے، جہاں وہ عرش پر اسم الرحمن (الاسم الرحمن) کے ذریعے ظاہر ہوتا ہے۔ پھر وہ ہر رات اسم الرب (الاسم الرب) کے ساتھ آسمان دنیا (السماء الدنيا) کی طرف نزول فرماتا ہے۔ پھر اسم الإلہ (الاسم الإله) کے ساتھ زمین کی طرف نزول فرماتا ہے۔ پھر وہ کائنات کے ہر فرد کے ساتھ ہویت (الهوية) کے ذریعے اس کی صحبت اختیار کرتا ہے۔ پھر وہ کائنات کے سفر میں صحبت (الصحبة) کے ساتھ اس کے ساتھ سفر کرتا ہے۔ پھر وہ اہل میں خلافت (الخلافة) کے ذریعے اس سے مختلف ہوتا ہے۔ پھر وہ قرآن (القرآن) کی صحبت میں سفر کرتا ہے، اس کے اللہ کی صفت ہونے سے لے کر آسمان دنیا (السماء الدنيا) تک کے سفر میں۔ پھر وہ تئیس سال تک اس کے سفر میں اس کی صحبت اختیار کرتا ہے۔ پھر وہ الٰہی اسماء (الأسماء الإلهية) کی کائنات میں ان کے سفر میں صحبت اختیار کرتا ہے۔ پھر وہ کائنات (الکون) کی عدم (العدم) سے وجود (الوجود) تک کے سفر میں صحبت اختیار کرتا ہے۔ پھر وہ انبیاء (الأنبياء) کی ان کے سفر میں صحبت اختیار کرتا ہے، پس وہ آدم (آدم) کی جنت (الجنة) سے زمین (الأرض) تک کے سفر میں صحبت اختیار کرتا ہے۔ پھر وہ سات سو عمروں اور تین سو حجوں کے سفر میں اس کی صحبت اختیار کرتا ہے۔ پھر وہ ادریس (إدريس) کی بلند مقام (المكان العلي) تک کے سفر میں صحبت اختیار کرتا ہے۔ پھر وہ نوح (نوح) کی اس کی نجات کی کشتی میں جودی (الجودي) تک کے سفر میں صحبت اختیار کرتا ہے۔ پھر وہ ابراہیم علیہ السلام (إبراهيم عليه السلام) کی ان کے تمام اسفار میں صحبت اختیار کرتا ہے، اور اسی طرح ہر نبی اور فرشتے کی، جیسے جبرائیل (جبريل) کے ہر نبی اور رسول کی طرف اسفار، اور میکائیل (ميكائيل) اور فرشتوں کے عروج و نزول کے اسفار، اور ان میں سے سیاحوں کے اسفار۔ اور ستاروں کا ان کی گردش میں سفر، اور افلاک (الأفلاك) کا ان کی حرکات میں سفر، اور عناصر (العناصر) کا ان کی تبدیلیوں میں سفر، اور تجلی (التجلی) کا اس کی صورتوں میں سفر، یہاں تک کہ وہ ان سب کی حقائق (الحقائق) پر اپنے اندرونی ذوق (ذوقا) کے ذریعے کھڑا ہو جاتا ہے، نہ شک کرتا ہے اور نہ تردد، اور ہر سفر میں اپنی ذات سے وہ چیز الگ کر دیتا ہے جو اس سفر کے صاحب کے لیے حق (حق) اور خلق (خلق) میں سے مناسب ہو۔ پس یہی عارفین (العارفين) کا سفر اور اللہ کے راسخ علماء (العلماء بالله الراسخين) کے طریق ہیں۔",
    "fa": "باب صد و نود و یکم در معرفت سفر و طریق، و آن عبارت است از توجه قلب به سوی خداوند از طریق ذکر، بر اساس آداب شریعت با عزیمت‌ها (عزائم) نه با رخصت‌ها (رخص)، مادامی که سالک در سفر است.\n\nتوجه قلب با اذکار، در حال کوچ کردن،\nبر آداب دین خدا، عنوانی است.\n\nبر تحقق این امر که قلب در سفر است،\nبا عزمی راسخ، و در آن دلالت‌ها و برهان است.\n\nو هر کس که به سیر متصف است، آسایش او\nاز نظر معدوم است و احوال (الأحوال) او سلطان است.\n\nرب (الرب) از عرش (العرش) به فلک\nپایین‌تر نازل می‌شود، و وحی و فرقان (فرقان) به واسطه آن به تو می‌رسد.\n\nتنها به سوی تو، نه به سوی همه خلق،\nو در نزول او برای هستی (الکون) تبیین است.\n\nبر محبت او در ما و صورت او،\nاو را از جانب من بخوان، پس هیچ انسانی تو را محجوب نسازد.\n\nو تو حق (حق) هستی و آن حق (الحق) او را نازل کرد\nدر مظهری که ارکان (أرکان) آن را مقید ساخته است.\n\n### [سفر به سوی خداوند]\n\nبدان، خداوند تو را تأیید کند، که سفر (السفر) حال مسافر است و طریق (الطریق) آن چیزی است که مسافر در آن گام می‌زند و آن را با معاملات، مقامات (المقامات)، احوال (الأحوال) و معارف (المعارف) طی می‌کند؛ زیرا در معارف و احوال، سفرهایی از اخلاق مسافرین، مراتب عالم، و منازل اسماء و حقایق (الحقائق) وجود دارد، و به همین دلیل شایسته این لقب شده است. و سخن درباره سالک و سلوک (السلوک) به گونه‌ای که بر آن واقف شده‌ای، پیش رفته است. و چون انسان مجموع عالم و نسخه حضرت الهیه (الحضرة الإلهية) است که عبارت از ذات و صفات و افعال است، نیازمند راهنمایی بود که سلوک بر آن و سفر در آن را برایش هموار سازد تا عجایب را ببیند و علوم و اسرار را به دست آورد، زیرا این سفر، سفر تجارت است. پس راهنما، شارع (پیامبر) بود و طریق هموار شده، شریعت (الشریعة) بود. پس هر کس در این طریق سفر کند، به حقیقت (الحقیقة) می‌رسد.\n\nپس سفری به حق (بالحق) و سفری به خلق (بالخلق) وجود دارد. سفر به حق بر دو نوع است: سفر ذات و سفر صفت. و انسان کامل (الإنسان الکامل) همه این سفرها را طی می‌کند. پس او به واسطه رب خود سفر می‌کند، از طریق کشف (الکشف) الهی و معیّت محققه‌ای که در آن با حق (الحق) است، همان‌گونه که حق با ماست هر کجا که باشیم. و خداوند سبحان برای خود مکان‌هایی را تعیین کرده است، آن‌گونه که شایسته جلال اوست، و خود را به تردد در آن‌ها وصف نموده است. پس هرگاه بنده با او باشد، با سفر او سفر می‌کند. پس برای او آشکار می‌شود که او (حق) است، همان‌گونه که برای او آشکار شد که او (حق) نیست.\n\nپس سفر ربانی (الرباني) از عماء (العماء) تا عرش (العرش) است، و در عرش با اسم الرحمن (الرحمن) ظاهر می‌شود، سپس هر شب با اسم الرب (الرب) با او به آسمان دنیا نازل می‌شود. سپس با اسم الإله (الإله) به زمین نازل می‌شود، سپس با هویت (الهوية) با هر یک از موجودات هستی (الکون) همراهی می‌کند، سپس با او در سفر هستی با مصاحبت سفر می‌کند، سپس با او در اهل (خانواده/مخلوقات) با خلافت (الخلافة) اختلاف می‌یابد. سپس در مصاحبت قرآن (القرآن) در سفرش از صفت خداوند بودن تا آسمان دنیا سفر می‌کند، سپس در سفر بیست و سه ساله با او همراهی می‌کند. سپس با اسماء الهیه (الأسماء الإلهية) در سفرشان در هستی همراه می‌شود، سپس هستی (الکون) در سفرش از عدم (العدم) به وجود (الوجود) با او همراه می‌شود. سپس با انبیاء در سفرشان همراه می‌شود، پس با آدم (آدم) در سفرش از جنت (الجنة) به زمین همراه می‌شود، سپس در سفرش در هفتصد عمره و سیصد حج با او همراهی می‌کند. سپس با ادریس (إدریس) در سفرش به مکان بلند همراه می‌شود، سپس با نوح (نوح) در سفرش در کشتی نجاتش تا کوه جودی همراه می‌شود، سپس با ابراهیم (إبراهيم) علیه السلام در تمام سفرهایش همراه می‌شود، و همچنین هر نبی و ملکی؛ مانند سفرهای جبرئیل (جبريل) به سوی هر نبی و رسول، و مانند سفر میکائیل (ميكائيل) و ملائکه (الملائكة) با عروج و نزول، و سفر سیاحان از میان آن‌ها، و سفر ستارگان در سیرشان، و سفر افلاک در حرکاتشان، و سفر عناصر در استحالاتشان (دگرگونی‌هایشان). و سفر تجلی (التجلی) در صور آن، تا آنکه بر حقایق (حقائق) این همه، از درون خود، ذوقاً (ذوقاً) واقف شود، نه با شک و تردید، و در هر سفر، آنچه را که مناسب صاحب آن سفر است، از حق (حق) و خلق (خلق)، از ذات خود مجرد سازد. پس این است سفر عارفین (العارفين) و طرق علمای راسخ در معرفت الله."
  },
  "page_count": 2
}