{
  "id": 282,
  "title": {
    "ar": "الباب الثاني والثمانون ومائتان في معرفة منزل تزاور الموتى وأسراره من الحضرة الموسوية",
    "en": "Chapter Two Hundred and Eighty-Two: Concerning the Knowledge of the Station (منزل) of the Mutual Visitation of the Dead and its Secrets, derived from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب دو سو بیاسی (۲۸۲) مردوں کی باہمی زیارت کی منزل کی معرفت اور اس کے اسرار کے بیان میں، جو حضرت موسویہ سے ہیں۔",
    "fa": "باب دویست و هشتاد و دوم در معرفت منزل دیدار مردگان و اسرار آن از حضرت موسوی."
  },
  "content": {
    "ar": "## «الباب الثاني والثمانون ومائتان في معرفة منزل تزاور الموتى وأسراره من الحضرة الموسوية»\n\n\n> إذا جهلت أرواحنا علم ذاتها *** فذلك موت والجسوم قبور\n\n\n> وإن علمت فالحشر فيها محقق *** وكان لها من أجل ذاك نشور\n\n\n> فما العلم إلا بين نور وظلمة *** وكل كلام دون ذلك زور\n\n\n### [الموت عبارة عن مفارقة الروح الجسد]\n\n\nاعلم أن الموت عبارة عن مفارقة الروح الجسد الذي كانت به حياته الحسية وهو طارئ عليهما بعد ما كانا موصوفين بالاجتماع الذي هو علة الحياة فكذلك موت النفس بعدم العلم فإن قلت إن العلم بالله طارئ الذي هو حياة النفوس والجهل ثابت لها قبل وجود العلم فكيف يوصف الجاهل بالموت وما تقدمه علم قلنا إن العلم بالله سبق إلى نفس كل إنسان في الأخذ الميثاقي حين أشهدهم على أنفسهم فلما عمرت الأنفس الأجسام الطبيعية في الدنيا فارقها العلم بتوحيد الله فبقيت النفوس ميتة بالجهل بتوحيد الله ثم بعد ذلك أحيا الله بعض النفوس بالعلم بتوحيد الله وأحياها كلها بالعلم بوجود الله إذ كان من ضرورة العقل العلم بوجود الله فلهذا سميناه ميتا قال تعالى أَ ومن كانَ مَيْتاً يعني بما كان الله قد قبض منه روح العلم بالله فَأَحْيَيْناهُ وجَعَلْنا لَهُ نُوراً يَمْشِي به في النَّاسِ فرد إليه علمه فحيي به كما ترد الأرواح إلى أجسامها في الدار الآخرة يوم البعث وقوله كَمَنْ مَثَلُهُ في الظُّلُماتِ يريد مقابلة النور الذي يمشي به في الناس وما هو عين الحياة فالحياة الإقرار بالوجود أي بوجود الله والنور المجعول العلم بتوحيد الله والظلمات الجهل بتوحيد الله والموت الجهل بوجود الله ولهذا لم يذكر الله في الآية عنا في الأخذ الميثاقي إلا الإقرار بوجود الله لا بتوحيده ما تعرض للتوحيد فيها فقال أَ لَسْتُ بِرَبِّكُمْ ف قالُوا بَلى‏ فأقروا له بالربوبية أي أنه سيدهم وقد يكون العبد مملوكا لاثنين بحكم الشركة فأي سيد قال له أ لست بربك فلا بد أن يقول العبد بلى ويصدق فلهذا قلنا إن الإقرار إنما كان بوجود الله ربا له أي مالكا وسيدا ولهذا أردف الله في الآية حين قال فَأَحْيَيْناهُ فلم يكتف حتى قال وجَعَلْنا لَهُ نُوراً يَمْشِي به في النَّاسِ يريد العلم بتوحيد الله لا غيره فإنه العلم الذي يقع به الشرف له والسعادة وما عدا هذا لا يقوم مقامه في هذه المنزلة فتأمل ما قلناه فقد علمت أن ورود الموت على النفوس إنما كان عن حياة سابقة إذ الموت لا يرد إلا على حي والتفرق لا يكون إلا عن اجتماع وبعد أن علمت هذا\n\n\n### [أن علم الواحد بالكثرة يوجب له الجهل بنفسه‏]\n\n\nفاعلم أنه من خصائص هذا المنزل أن علم الواحد بالكثرة يوجب له الجهل بنفسه لأن الكثرة مشهودة له وذلك أن الروح لا يعقل نفسه إلا مع هذا الجسم محل الكم والكثرة ولم يشهد نفسه قط وحده مع كونه في نفسه غير منقسم ولا يعرف إنسانيته إلا بوجود الجسم معه ولهذا إذا سئل عن حده وحقيقته يقول جسم متغذ حساس ناطق هذا هو حقيقة الإنسان وحده الذاتي النفسي فيأخذ أبدا في حده إذا سئل عنه من كونه إنسانا هذه الكثرة فلا يعقل أحديته في ذاته وإنما يعقل أحدية الجنس لا الأحدية الحقيقية والذي يحصل له بالاكتساب أنه واحد في عينه علم دليل فكري لا علم ذوق شهودي كشفي وكذلك العلم بالله إنما متعلقة العلم بتوحيد الألوهة لمسمى الله لا توحيد الذات‏\nفإن الذات لا يصح أن تعلم أصلا فالعلم بتوحيد الله علم دليل فكري لا علم شهود كشفي فالعلم بالتوحيد لا يكون ذوقا أبدا ولا تعلق له إلا بالمراتب وأين التوحيد في الذات مع ما قد ورد من الصفات المعنوية واختلاف الناس فيها واختلاف أعيانها بالحد والحقيقة وإن هذه ليست عين هذه هذا في العقل وفي الشرع ثم انفرد التعريف الإلهي باليد والعين والقدم والأصابع وغير ذلك وهذه كلها تنافي توحيد الذات ولا تنافي توحيد الألوهة ولهذا ورد التنازع في‏\n\n\nقوله عليه السلام إذا بويع لخليفتين فاقتلوا الآخر منهما\n\n\nلأن أحدية المرتبة لا تقبل الثاني ولا تحمل الشركة لأن المطلوب الصلاح لا الفساد والإيجاد لا الإعدام وقال تعالى لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا فوحد الإله وما قال لو كانت ذات الإله تنقسم لفسدتا ما تعرض لشي‏ء من ذلك وإن الإله عند المتكلمين مجموع ذوات فإن الصفات أعيان زائدة موجودة قائمة بذات الحق وبالمجموع يكون إلها فأين التوحيد الذي يزعمونه وكذلك العقلاء من الفلاسفة الإله عندهم مجموع نسب فأين الوحدانية عندهم فإنهم يصفونه بالعلم والحياة واللذة والابتهاج بكماله فالوحدة أمر يسمع واسم على غير مسمى حقيقي إذا أنصفت فلا إله إلا الله الواحد في ألوهيته القهار للمنازعين له في ألوهيته من عباده والمزاحمين له في أفعاله وما عدا هذين الصنفين فلهم الله الواحد الغفار وبعد أن علمت هذا فلا تحجبك هذه الكثرة عن توحيد الله تعالى ولكن بينت لك متعلق توحيدك وما تعرضنا إلى الذات في عينها لأن الفكر فيها ممنوع شرعا\n\n\nقال رسول الله صلى الله عليه وسلم لا تتفكروا في ذات الله‏\n\n\nوقال تعالى ويُحَذِّرُكُمُ الله نَفْسَهُ يعني أن تتفكروا فيها فتحكموا عليها بأمر أنها كذا وكذا وما حجر الكلام في الألوهة ولا تدرك بفكر ومشاهدتها من حيث نفسها ممنوعة عند أهل الله وإنما لها مظاهر تظهر فيها بتلك المظاهر تتعلق رؤية العباد وقد وردت بها الشرائع وما بأيدينا من العلم به إلا صفات تنزيه أو صفات أفعال ومن زعم أن عنده علما بصفة نفسية ثبوتية فباطل زعمه فإنها كانت تحده ولا حد لذاته فهذا باب مغلق دون الكون لا يصح أن يفتح انفرد به الحق سبحانه وإذا كان الحق على ما أخبر الرسول صلى الله عليه وسلم عن علمه بما علمه الله‏\n\n\nفقال اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك أو استأثرت به في علم غيبك فعنده أسماء لا يعلمها إلا هوهي راجعة إليه وقد منع باستئثاره أنه لا يعلمها أحدا من خلقه وأسماؤه ليست أعلاما ولا جوامد وإنما أسماؤه على طريق المحمدة والمدح والثناء ولهذا كانت حسني لما يفهم من معانيها بخلاف الأسماء الأعلام التي لا تدل إلا على الأعيان المسماة بها خاصة لا على جهة المدح ولا جهة الذم وأعظمها عندنا الاسم الله الذي لا تقع فيه المشاركة فأين التوحيد مع هذا التعريف الذي يزعمه هذا الزاعم أنه قد حصل على علم التوحيد النفسي وإذا لم يشهد له شرع ولا عقل ولا كشف وما ثم غير هؤلاء وهم عدول فكيف بك بما خرج عن هؤلاء فالزم ما كلفته من زيارة الموتى وهو اللحوق بهم والانخراط في سلكهم وهو العجز عن إدراك الأمر على ما هو عليه وإنما نحن متصرفون في أفعال المقاربة وهي كاد وأخواتها\n\n\nفيقال كاد العروس يكون أميرا وما هو أمير في نفس الأمر وكاد زيد يحج أي قارب الحج وقال تعالى إِذا أَخْرَجَ يَدَهُ لَمْ يَكَدْ يَراها فوصفه بأنه ما رآها ولا قارب رؤيتها فإنه نفى القرب بدخول لم على يكاد وهو حرف نفي وجزم يدخل على الأفعال المضارعة للأسماء فينفيها ويتعلق بهذا المنزل علم الزجر والردع لمن قال من الناس إنه قد علم ذات الحق أنه لا ينكشف له جهله بما زعم أنه عالم به إلا في الدار الآخرة فيعلم هناك أن الأمر على خلاف ما كان يعتقده من علمه وأنه لا يعلم دنيا ولا آخرة قال تعالى وبَدا لَهُمْ من الله ما لَمْ يَكُونُوا يَحْتَسِبُونَ فعم فبدا لكل طائفة تعتقد أمرا ما مما الأمر ليس عليه نفي ذلك المعتقد وما تعرض في الآية بما انتفى ذلك هل بالعجز أو بمعرفة النقيض وكلا الأمرين كائن في الدار الآخرة كمن يقول بإنفاذ الوعيد لمن مات عاصيا على غير توبة فيغفر الله له يوم القيامة فقد بدا له من الله ما لم يكن يعلمه من التجاوز وزال علمه بالمؤاخذة فكل طائفة يبدو لها من الله بحسب مسألتها فلو كان العلم في نفس الأمر علم يقين لما تبدل وإنما هو حسبان وظن قد احتجب عن صاحبه بصورة علم فهو يقول إنه يعلم والحق يقول له تظن وتحسب وأين مقام من مقام فما كل أمر يعلم ولا كل أمر يجهل فاعلم العلماء من علم ما يعلم أنه يعلم وما لا يعلم أنه لا يعلم‏\n\n\nقال صلى الله عليه وسلم لا أحصي ثناء عليك‏\n\n\nفقد علم أنه ثم أمر لا يحاط به وقال الصديق العجز عن درك الإدراك إدراك‏\nأي أنه أدرك أن ثم أمرا يعجز عن إدراكه فهذا علم لا علم فيعلم الإنسان يوم القيامة عجز فكره عن إدراك ما حسب أنه أدركه غير أنه معذب بفكره بنار اصطلامه فإن حجة الشرع عليه قائمة إذ قد أبان له وأعرب عما ينبغي له أن يفكر فيه كما قال أَ ولَمْ يَتَفَكَّرُوا ما بِصاحِبِهِمْ من جِنَّةٍ أي أنه يوصل إلى معرفة الرسول بالدليل وبهذه الآية يستدل على أنه لا بد من أن ينصب الله تعالى على يد هذا الرسول دليلا يصدقه في دعواه ولو لم يكن كذلك ما صدق قوله أَ ولَمْ يَتَفَكَّرُوا ولا تكون الفكرة إلا في دليل على صدقه إنه رسول من عند الله والدليل هو المنظور فيه الموصل إلى المدلول فلو لا ما نصب الأدلة ما شرع للعقلاء التفكر ولا طالبهم وكذلك في معرفتهم به سبحانه فقال لما ذكر أمورا إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ فإذا تعدى بالفكر حده وفكر فيما لا ينبغي له أن يفكر فيه عذب يوم القيامة بنار فكره ثم إن الإنسان يشغله الفكر فيما لم يشرع له التفكر فيه عن شكر المنعم على النعم التي أنعم الله عليه بها فيكون صاحب عذابين عذاب الفكر فيما لا ينبغي وعذاب عدم الشكر على ما أنعم به عليه ولا نعمة أعظم من نعمة العلم وإن كانت نعم الله لا تحصى من حيث أسبابها الموجبة لها وإنما النعيم على الحقيقة وجود اللذة في نفس المنعم عليه بها عند أسباب كثيرة لا تحصى محصورة في أمرين في وجود ما تكون به اللذة وفي عدم ما يكون بعدمه اللذة وهي أمور نسبية كوجود لذة خائف من عدو يتوقعه فيهلك ذلك العدو فيجد هذا من اللذة عند هلاكه ما لا يقدر قدرها وذلك لوجود الأمن مما كان يحذره فالأسباب لا تحصى كثرة واللذة واحدة وهي النعمة المحققة كما إن الألم هو العذاب المحقق وأسبابه لا تحصى فسمى الشي‏ء باسم الشي‏ء إذا كان مجاورا له أو كان منه بسبب‏\n\n\n### [أن الزيارة وهو الميل‏]\n\n\nواعلم أن الزيارة مأخوذة من الزور وهو الميل فمن زار قوما فقد مال إليهم بنفسه فإن زارهم بمعناه فقد مال إليهم يقلبه وشهادة الزور الميل إلى الباطل عن الحق فزيارة الموتى الميل إليهم تعشقا لصفة الموت إن تحل به فإن الميت لا حكم له في نفسه وإنما هو في حكم من يتصرف فيه ولا يتصور من الميت منع ولا إباية ولا حمد ولا ذم ولا اعتراض بل هو مسلم تسليم حال ذاتي كذلك ينبغي لزائره إن يكون حاله مع الله حال الميت مع من يتصرف فيه وإذا بلغ إلى هذا المقام على الحد المشروع فيه لا على الإطلاق حينئذ يبلغ مبلغ الرجال ولا يكون موصوفا بهذه الصفة على الإطلاق إلا في معناه لا في حسه الظاهر والباطن بل ينبغي له أن يكون حيا في أفعاله الظاهرة والباطنة في الأمور التي تعلق بها النهي الإلهي ويكون ميتا بالتسليم لموارد القضاء عليه في كل ذلك لا للمقضي والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Eighty-Two: On the Gnosis of the Station of the Mutual Visitation of the Dead (تزاور الموتى) and its Secrets, derived from the Mosaic Presence (الحضرة الموسوية).\n\nIf our spirits are ignorant of the knowledge of their Essence (ذات),\nThat is death, and the bodies are graves.\n\nBut if they know, then the Gathering (الحشر) within them is realized,\nAnd because of that, they have a resurrection (نشور).\n\nFor Knowledge (العلم) is only between light and darkness,\nAnd every discourse besides that is falsehood.\n\n### [Death is the separation of the spirit from the body]\n\nKnow that death (الموت) is the separation of the spirit (الروح) from the body (الجسد) through which its sensory life existed. It is an accident (طارئ) that occurs to both after they were characterized by the conjunction (الاجتماع) which is the cause of life. Likewise is the death of the soul (النفس) through the absence of Knowledge (العلم). If you say that the Knowledge of Allah, which is the life of the souls, is an accident (طارئ) that occurs, and ignorance (الجهل) is fixed (ثابت) for them before the existence of Knowledge, then how can the ignorant person be described as dead when no Knowledge preceded him?\n\nWe say that the Knowledge of Allah preceded the soul of every human being during the taking of the Covenant (الأخذ الميثاقي), when He made them testify against themselves. When the souls inhabited the natural bodies in this world (الدنيا), the Knowledge of the Unity (توحيد) of Allah departed from them. Thus, the souls remained dead due to the ignorance of the Unity of Allah. Then, after that, Allah revived some souls with the Knowledge of the Unity of Allah, and He revived all of them with the Knowledge of the existence (وجود) of Allah, since the Knowledge of Allah’s existence is a necessity of the intellect (العقل).\n\nFor this reason, we call him dead. Allah the Exalted said: <<أَوَمَن كَانَ مَيْتًا>> (Is he who was dead)—meaning, whom Allah had seized the spirit of Knowledge of Allah from—<<فَأَحْيَيْنَاهُ وَجَعَلْنَا لَهُ نُورًا يَمْشِي بِهِ فِي النَّاسِ>> (and We gave him life and appointed for him a light by which he walks among the people). He restored his Knowledge to him, and he was thereby revived, just as spirits are returned to their bodies in the Hereafter (الدار الآخرة) on the Day of Resurrection (يوم البعث).\n\nAnd His saying: <<كَمَن مَّثَلُهُ فِي الظُّلُمَاتِ>> (Is he like one whose likeness is in the darknesses) refers to the contrast with the light by which he walks among the people, which is the very essence of life. Life is the affirmation of existence (الإقرار بالوجود)—that is, the existence of Allah. The light that is appointed is the Knowledge of the Unity of Allah (توحيد الله), and the darknesses are the ignorance of the Unity of Allah. Death is the ignorance of the existence of Allah.\n\nFor this reason, Allah did not mention in the verse concerning the taking of the Covenant (الأخذ الميثاقي) anything from us except the affirmation of existence, not His Unity (توحيد). He did not address Unity therein, saying: <<أَلَسْتُ بِرَبِّكُمْ>> (Am I not your Lord?) They said: <<قَالُوا بَلَى>> (Yes, indeed). Thus, they affirmed His Lordship (الربوبية), meaning that He is their Master (سيدهم). A servant may be owned by two masters due to partnership, but whichever master asks him, \"Am I not your Lord?\" the servant must say, \"Yes, indeed,\" and speak the truth.\n\nTherefore, we said that the affirmation was only of the existence of Allah as their Lord, meaning their Owner and Master. This is why Allah followed up the verse when He said: <<فَأَحْيَيْنَاهُ>> (and We gave him life), and did not stop there, but continued: <<وَجَعَلْنَا لَهُ نُورًا يَمْشِي بِهِ فِي النَّاسِ>> (and appointed for him a light by which he walks among the people). He means the Knowledge of the Unity of Allah and nothing else, for it is the Knowledge (العلم) through which honor and felicity are attained. Nothing else can take its place in this station (منزلة). Reflect upon what we have said, for you have now learned that the occurrence of death upon the souls is only subsequent to a previous life, since death only occurs to the living, and separation (التفرق) only occurs after conjunction (اجتماع). Having known this,\n\n### [That the knowledge of the One concerning Multiplicity necessitates ignorance of its own self]\n\nKnow that one of the characteristics of this station (منزل) is that the knowledge of the One (الواحد) concerning Multiplicity (الكثرة) necessitates ignorance of its own self, because Multiplicity is what is witnessed (مشهودة) by it. This is because the spirit (الروح) does not comprehend itself except in conjunction with this body, which is the locus of quantity and multiplicity. It has never witnessed itself alone, despite being in itself indivisible.\n\nIt does not know its humanity (إنسانيته) except through the existence of the body alongside it. Therefore, when asked about its definition (حد) and reality (حقيقة), it says: \"A body that nourishes itself, senses, and speaks.\" This is the reality of the human being and its essential, psychic definition (حده الذاتي النفسي). Thus, when asked about its definition as a human being, it always includes this Multiplicity (الكثرة). Therefore, it does not comprehend its own Oneness (أحديته) in its Essence (ذات), but rather comprehends the oneness of the genus, not the true Oneness (الأحدية الحقيقية). What it gains through acquisition is that it is one in its specific entity (عينه)—a knowledge based on intellectual proof (علم دليل فكري), not a knowledge of experiential witnessing (علم ذوق شهودي كشفي).\n\nLikewise, the Knowledge of Allah (العلم بالله) relates only to the Knowledge of the Unity of Divinity (توحيد الألوهة) for the Named Entity (مسمى) 'Allah,' not the Unity of the Essence (توحيد الذات). For the Essence (الذات) cannot be known at all. Thus, the Knowledge of the Unity of Allah is a knowledge based on intellectual proof (علم دليل فكري), not a knowledge of unveiled witnessing (علم شهود كشفي). Knowledge of Unity (التوحيد) is never experiential taste (ذوق), and it relates only to the Levels (المراتب). Where is Unity in the Essence (الذات) when there have been reported the Attributes of Meaning (الصفات المعنوية), the disagreement among people concerning them, and the disagreement concerning their specific entities (أعيانها) in definition and reality—that this is not the same as that? This is in the intellect (العقل) and in the Sacred Law (الشرع).\n\nFurthermore, the Divine definition (التعريف الإلهي) is uniquely characterized by the Hand, the Eye, the Foot, the Fingers, and other such things. All of these contradict the Unity of the Essence (توحيد الذات), but they do not contradict the Unity of Divinity (توحيد الألوهة). This is why disagreement arose concerning his saying (peace be upon him):\n\n\"If allegiance is sworn to two Caliphs, kill the latter of them.\"\n\nThis is because the Oneness (أحدية) of the rank (المرتبة) does not accept a second and does not tolerate partnership, since the desired outcome is righteousness (الصلاح), not corruption (الفساد); origination (الإيجاد), not annihilation (الإعدام). Allah the Exalted said: <<لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا>> (Had there been in them [the heavens and earth] gods besides Allah, they would have been ruined). He unified the Godhead (الإله), and He did not say, \"Had the Essence of the Godhead been divisible, they would have been ruined.\" He did not address anything of that nature.\n\nMoreover, the Godhead (الإله) according to the theologians (المتكلمين) is a collection of essences (ذوات), for the Attributes (الصفات) are existing, superadded entities (أعيان زائدة موجودة) subsisting in the Essence of the Real (ذات الحق), and by this collection, He is God (إلها). Where, then, is the Unity (التوحيد) they claim? Likewise, the rationalists among the philosophers (الفلاسفة) consider God (الإله) to be a collection of relations (نسب). Where is Oneness (الوحدانية) according to them? For they describe Him with Knowledge, Life, Pleasure, and Joy in His perfection.\n\nUnity (الوحدة) is a matter that is heard and a name without a true referent (مسمى حقيقي), if you are fair. There is no god but Allah, the One (الواحد) in His Divinity (ألوهيته), the Subduer (القهار) of those among His servants who dispute His Divinity and those who compete with Him in His Acts (أفعاله). As for those besides these two types, Allah, the One, the Forgiving, is for them.\n\nHaving known this, let not this Multiplicity (الكثرة) veil you from the Unity of Allah the Exalted. Rather, I have clarified for you the object of your Unity (توحيدك). We have not addressed the Essence (الذات) in its specific entity (عينها), because reflection upon it is forbidden by the Sacred Law (شرعا).\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"Do not reflect upon the Essence of Allah.\"\n\nAnd Allah the Exalted said: <<وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ>> (And Allah warns you of Himself)—meaning, lest you reflect upon it and judge concerning it that it is such-and-such. He did not restrict discourse concerning the Divinity (الألوهة), nor is it attained by reflection. Witnessing (مشاهدتها) the Essence (نفسها) is forbidden according to the People of Allah (أهل الله). Rather, it has manifestations (مظاهر) in which it appears, and it is through those manifestations that the vision (رؤية) of the servants relates, and the Sacred Laws (الشرائع) have been revealed concerning them.\n\nThe only Knowledge (العلم) we possess of Him consists of Attributes of Transcendence (صفات تنزيه) or Attributes of Acts (صفات أفعال). Whoever claims to possess knowledge of an essential, affirmative Attribute (صفة نفسية ثبوتية), his claim is false, for such an attribute would define Him, and His Essence (ذاته) has no definition (حد). This is a door closed off from creation (الكون), which cannot rightly be opened; the Real (الحق) alone, glory be to Him, is unique in possessing it.\n\nIf the Real is as the Messenger of Allah (peace and blessings be upon him) informed concerning His Knowledge of what Allah taught him, when he said:\n\n\"O Allah, I ask You by every Name You have named Yourself with, or taught to any one of Your creation, or kept exclusively in the Knowledge of the Unseen (علم غيبك) with You,\"\n\nthen He possesses Names that none knows but Him. These Names refer back to Him, and by His exclusivity (استئثاره), He has prevented any of His creation from knowing them. His Names are not mere signs (أعلام) or inert objects (جوامد); rather, His Names are in the manner of praise, commendation, and glorification. For this reason, they are the Most Beautiful (حسنى), due to the meanings understood from them, unlike proper names (الأسماء الأعلام) which indicate only the specific entities named by them, without implying praise or blame. The greatest of them, in our view, is the Name Allah, in which no partnership occurs.\n\nWhere, then, is the Unity (التوحيد) with this definition claimed by the one who asserts that he has attained the knowledge of essential Unity (التوحيد النفسي)? If neither Sacred Law (شرع), nor intellect (عقل), nor Unveiling (كشف) witnesses to him—and there are none besides these, and they are trustworthy—then what about that which falls outside of these?\n\nTherefore, adhere to what you have been commanded regarding the visitation of the dead (زيارة الموتى), which is joining them and being enrolled in their rank: the inability to grasp the matter as it truly is. We are only acting within the scope of approximate actions (أفعال المقاربة), which are like the verb *kāda* (to be near/almost) and its sisters.\n\nIt is said, \"The groom *kāda* (almost) became a prince,\" yet he is not a prince in reality. And \"Zayd *kāda* (almost) performed the Hajj,\" meaning he approached the Hajj. Allah the Exalted said: <<إِذَا أَخْرَجَ يَدَهُ لَمْ يَكَدْ يَرَاهَا>> (When he brings out his hand, he can hardly see it). He described him as not having seen it, nor having approached seeing it, for He negated the proximity by the entrance of *lam* upon *yakādu*, which is a particle of negation and apocopation that enters upon imperfect verbs for nouns, negating them.\n\nRelated to this station (منزل) is the knowledge of prohibition and deterrence for anyone who claims to have known the Essence of the Real (ذات الحق). His ignorance concerning what he claimed to know will not be unveiled to him until the Hereafter (الدار الآخرة). There, he will know that the matter is contrary to what he believed concerning his knowledge, and that he knows neither this world nor the next. Allah the Exalted said: <<وَبَدَا لَهُم مِّنَ اللَّهِ مَا لَمْ يَكُونُوا يَحْتَسِبُونَ>> (And there will appear to them from Allah that which they had not been calculating). This is general, meaning that for every group that believes in a matter that is not the case, the negation of that belief will appear to them. The verse does not address whether that negation occurs through inability or through the knowledge of the opposite, and both matters occur in the Hereafter.\n\nFor example, one who believes in the execution of the threat (الوعيد) against a disobedient person who died without repentance, yet Allah forgives him on the Day of Resurrection. That which he did not know—the act of overlooking (التجاوز)—has appeared to him from Allah, and his knowledge concerning accountability has vanished. Every group will have something appear to them from Allah according to their specific issue. If the knowledge were truly certain knowledge (علم يقين) in reality, it would not change. Rather, it is calculation (حسبان) and conjecture (ظن) that has been veiled from its possessor in the form of knowledge, so he says he knows, while the Real says to him, \"You conjecture and calculate.\" What comparison is there between one station and another?\n\nNot every matter is known, nor is every matter unknown. The most knowledgeable of scholars is he who knows what he knows that he knows, and what he does not know that he does not know.\n\nThe Prophet (peace and blessings be upon him) said: \"I cannot enumerate Your praise.\"\n\nThus, he knew that there is a matter that cannot be encompassed. And Al-Siddiq (Abu Bakr) said: \"The inability to grasp the realization is itself realization (العجز عن درك الإدراك إدراك).\" Meaning that he realized that there is a matter he is incapable of realizing. This is Knowledge (علم), unlike mere knowledge.\n\nOn the Day of Resurrection, the human being will know the inability of his thought (فكر) to grasp what he calculated he had grasped. Nevertheless, he will be tormented by his thought with the fire of its destruction (نار اصطلامه), for the proof of the Sacred Law (حجة الشرع) stands against him, since it clarified and expressed what he ought to reflect upon, as He said: <<أَوَلَمْ يَتَفَكَّرُوا مَا بِصَاحِبِهِم مِّن جِنَّةٍ>> (Have they not reflected that there is no madness in their companion?).\n\nThis means that the knowledge of the Messenger is reached through proof (الدليل). By this verse, it is inferred that Allah the Exalted must establish a proof (دليلا) through this Messenger that confirms his claim. Were it not so, His saying <<أَوَلَمْ يَتَفَكَّرُوا>> would not be true, and reflection (الفكرة) can only be upon a proof of his truthfulness that he is a Messenger from Allah. The proof is that which is contemplated (المنظور فيه) and leads to the proven point (المدلول). Had He not established the proofs, He would not have legislated reflection for the rational beings (العقلاء) nor demanded it of them. Likewise, in their knowledge of Him, glory be to Him, when He mentioned certain matters, He said: <<إِنَّ فِي ذَلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ>> (Indeed, in that are signs for a people who reflect).\n\nIf thought transgresses its limit and reflects upon what it ought not to reflect upon, the person will be tormented on the Day of Resurrection by the fire of his thought. Furthermore, reflection upon what has not been legislated for him distracts the human being from thanking the Benefactor for the blessings (النعم) Allah has bestowed upon him. Thus, he becomes subject to two torments: the torment of reflecting upon what is inappropriate, and the torment of failing to thank for the blessings bestowed upon him.\n\nNo blessing (نعمة) is greater than the blessing of Knowledge (العلم), even though the blessings of Allah are innumerable in terms of their necessitating causes. True bliss (النعيم على الحقيقة) is the existence of pleasure (اللذة) in the recipient of the blessing (المنعم عليه بها) itself, arising from many innumerable causes, confined to two matters: the existence of that by which pleasure occurs, and the absence of that by whose absence pleasure occurs. These are relative matters, such as the existence of pleasure for one who fears an expected enemy, when that enemy perishes. He finds a pleasure upon the enemy’s destruction whose measure cannot be estimated. This is due to the existence of security from what he was fearing. The causes are innumerable in their multiplicity, but the pleasure is one, and it is the realized blessing (النعمة المحققة). Likewise, pain (الألم) is the realized torment (العذاب المحقق), and its causes are innumerable. Thus, a thing is named after another thing if it is adjacent to it or related to it by cause.\n\n### [That Visitation is Inclination]\n\nKnow that visitation (الزيارة - al-Ziyāra) is derived from *al-zawr* (الزور), which means inclination (الميل). Whoever visits a people has inclined toward them with his self. If he visits them in meaning (معناه), he has inclined toward them with his heart. False witness (شهادة الزور) is the inclination toward falsehood away from the Real (الحق).\n\nThe visitation of the dead (زيارة الموتى) is the inclination toward them, out of passionate love (تعشقا) for the attribute of death (صفة الموت), so that it may reside in him. For the dead person (الميت) has no ruling (حكم) over himself; rather, he is under the ruling of whoever disposes of him. It is inconceivable for the dead person to prevent, refuse, praise, blame, or object. Rather, he is one who submits (مسلم) with an essential submission of state (تسليم حال ذاتي).\n\nLikewise, his visitor should have a state with Allah similar to the state of the dead person with the one who disposes of him. When he reaches this station (مقام) within the prescribed limit (الحد المشروع فيه), not absolutely, then he attains the rank of men (مبلغ الرجال). He is not described by this attribute absolutely except in its meaning (معناه), not in his apparent or inner sensory perception. Rather, he must be alive in his apparent and inner acts (أفعاله الظاهرة والباطنة) concerning matters related to the Divine prohibition (النهي الإلهي). And he must be dead through submission (التسليم) to the occurrences of the Divine Decree (القضاء) upon him in all of that, but not to the decreed thing itself. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو بیاسی: مردوں کی باہمی ملاقات (تزاور الموتى) کے مقام کی معرفت اور اس کے اسرار، حضرت موسیٰ علیہ السلام کی بارگاہ (الحضرة الموسوية) سے۔\n\nجب ہماری روحیں اپنی ذات کا علم نہ جانیں،\nتو یہ موت ہے اور جسم قبریں ہیں۔\nاور اگر وہ جان لیں، تو ان میں حشر یقینی ہے،\nاور اسی سبب سے ان کے لیے دوبارہ اٹھنا (نشور) ہے۔\nپس علم نور اور ظلمت کے درمیان ہی ہے،\nاور اس کے علاوہ ہر کلام جھوٹ (زور) ہے۔\n\n### [موت روح کا جسم سے جدا ہونا ہے]\n\nجان لیجیے کہ موت (الموت) روح کا اس جسم سے جدا ہو جانا ہے جس کے ذریعے اس کی حسی حیات (حياة) قائم تھی، اور یہ ان دونوں پر اس اجتماع کے بعد وارد ہوتی ہے جو حیات (حياة) کی علت ہے۔ اسی طرح نفس کی موت علم (علم) کے نہ ہونے سے ہے۔ اگر آپ کہیں کہ اللہ کا علم (جو نفوس کی حیات ہے) عارضی ہے اور علم کے وجود سے پہلے جہل (جہل) ان میں ثابت تھا، تو جاہل کو موت سے کیسے موصوف کیا جائے گا جبکہ اس سے پہلے کوئی علم نہیں تھا؟ ہم کہتے ہیں کہ اللہ کا علم ہر انسان کے نفس میں میثاق (الأخذ الميثاقي) کے وقت پہلے سے موجود تھا جب اللہ نے انہیں ان کی جانوں پر گواہ بنایا تھا۔ پھر جب نفوس نے دنیا میں طبعی اجسام کو آباد کیا تو اللہ کی توحید (توحید) کا علم ان سے جدا ہو گیا، پس نفوس اللہ کی توحید کے جہل (جہل) کے سبب مردہ رہ گئے۔ پھر اس کے بعد اللہ نے بعض نفوس کو اللہ کی توحید کے علم سے زندہ کیا، اور ان سب کو اللہ کے وجود (الوجود) کے علم سے زندہ کیا، کیونکہ اللہ کے وجود کا علم عقل کی ضرورت ہے۔ اسی لیے ہم نے اسے مردہ کہا۔ اللہ تعالیٰ فرماتا ہے:\n**أَ ومن كانَ مَيْتاً فَأَحْيَيْناهُ وجَعَلْنا لَهُ نُوراً يَمْشِي به في النَّاسِ**\n(کیا وہ شخص جو مردہ تھا، پھر ہم نے اسے زندہ کیا اور اس کے لیے ایک نور (نور) مقرر کیا جس کے ساتھ وہ لوگوں میں چلتا ہے)۔\nیعنی (مردہ تھا) اس سے مراد یہ ہے کہ اللہ نے اس سے اللہ کے علم کی روح قبض کر لی تھی، **فَأَحْيَيْناهُ** (پھر ہم نے اسے زندہ کیا) یعنی اس کا علم اسے واپس کر دیا گیا، پس وہ اس سے زندہ ہو گیا، جیسے آخرت میں بعث کے دن روحیں اپنے اجسام کی طرف لوٹائی جائیں گی۔ اور اس کا قول **كَمَنْ مَثَلُهُ في الظُّلُماتِ** (اس شخص کی طرح جو اندھیروں (الظُّلُمات) میں ہو) سے مراد اس نور (نور) کا مقابلہ ہے جس کے ساتھ وہ لوگوں میں چلتا ہے۔ اور جو چیز حیات (حياة) کا عین ہے، وہ وجود (الوجود) کا اقرار ہے، یعنی اللہ کے وجود کا۔ اور جو نور (نور) بنایا گیا ہے وہ اللہ کی توحید (توحید) کا علم ہے، اور ظلمات (الظُّلُمات) اللہ کی توحید کا جہل (جہل) ہے، اور موت (الموت) اللہ کے وجود کا جہل ہے۔ اسی لیے اللہ نے میثاق (الأخذ الميثاقي) کے وقت ہم سے متعلق آیت میں صرف اللہ کے وجود کا اقرار ذکر کیا، نہ کہ اس کی توحید کا۔ اس میں توحید کا ذکر نہیں کیا، پس فرمایا:\n**أَ لَسْتُ بِرَبِّكُمْ ف قالُوا بَلى‏**\n(کیا میں تمہارا رب نہیں ہوں؟ انہوں نے کہا: کیوں نہیں!)\nپس انہوں نے اس کی ربوبیت کا اقرار کیا، یعنی وہ ان کا آقا ہے۔ اور کبھی غلام شرکت کے حکم سے دو آقاؤں کا مملوک ہو سکتا ہے، تو جو بھی آقا اس سے کہے: کیا میں تمہارا رب نہیں ہوں؟ تو غلام کو لازماً کہنا پڑے گا: کیوں نہیں! اور وہ سچ کہے گا۔ اسی لیے ہم نے کہا کہ اقرار صرف اللہ کے وجود کا تھا بطور رب کے، یعنی مالک اور آقا کے۔ اسی لیے اللہ نے آیت میں جب **فَأَحْيَيْناهُ** (پھر ہم نے اسے زندہ کیا) کہا تو اس پر اکتفا نہیں کیا، بلکہ یہاں تک فرمایا: **وجَعَلْنا لَهُ نُوراً يَمْشِي به في النَّاسِ** (اور اس کے لیے ایک نور مقرر کیا جس کے ساتھ وہ لوگوں میں چلتا ہے)۔ اس سے مراد صرف اللہ کی توحید کا علم ہے، نہ کہ کوئی اور، کیونکہ یہی وہ علم ہے جس سے اسے شرف اور سعادت حاصل ہوتی ہے۔ اس کے علاوہ کوئی چیز اس مقام (منزل) پر اس کی جگہ نہیں لے سکتی۔ پس جو کچھ ہم نے کہا ہے اس پر غور کیجیے، آپ نے جان لیا کہ نفوس پر موت کا وارد ہونا سابقہ حیات (حياة) کی وجہ سے تھا، کیونکہ موت صرف زندہ پر ہی وارد ہوتی ہے، اور تفرق صرف اجتماع کے بعد ہی ہوتا ہے۔ اور جب آپ یہ جان چکے۔\n\n### [یہ کہ واحد کا کثرت کا علم اس کے لیے اپنی ذات کا جہل لازم کرتا ہے]\n\nتو جان لیجیے کہ اس مقام (منزل) کی خصوصیات میں سے یہ ہے کہ واحد (الواحد) کا کثرت (الكثرة) کا علم اس کے لیے اپنی ذات کا جہل (جہل) لازم کرتا ہے، کیونکہ کثرت (الكثرة) اس کے لیے مشہود ہے۔ اور یہ اس لیے ہے کہ روح اپنے آپ کو اس جسم کے ساتھ ہی سمجھتی ہے جو کمیت اور کثرت (الكثرة) کا محل ہے، اور اس نے کبھی بھی اپنے آپ کو تنہا نہیں دیکھا، باوجود اس کے کہ وہ اپنی ذات میں غیر منقسم ہے۔ اور وہ اپنی انسانیت کو اپنے ساتھ جسم کے وجود کے بغیر نہیں پہچانتی۔ اسی لیے جب اس کی حد اور حقیقت کے بارے میں پوچھا جاتا ہے تو وہ کہتی ہے: \"جسم متغذی، حساس، ناطق\"۔ یہ انسان کی ذاتی، نفسیاتی حقیقت اور حد ہے۔ پس جب بھی اس سے انسان ہونے کی حیثیت سے اس کی حد کے بارے میں پوچھا جاتا ہے تو وہ ہمیشہ اس کثرت (الكثرة) کو لیتی ہے، لہٰذا وہ اپنی ذات میں اپنی احدیت (أحدية) کو نہیں سمجھتی، بلکہ صرف جنس کی احدیت کو سمجھتی ہے، نہ کہ حقیقی احدیت کو۔ اور جو کچھ اسے اکتساب سے حاصل ہوتا ہے وہ یہ ہے کہ وہ اپنی عین میں واحد ہے، یہ ایک فکری دلیل کا علم ہے، نہ کہ ذوق (ذوق)، شہود (الشہود)، یا کشف (الکشف) کا علم۔ اسی طرح اللہ کے بارے میں علم کا تعلق صرف مسمیٰ اللہ کی الوہیت (الألوهة) کی توحید (توحید) کے علم سے ہے، نہ کہ ذات (الذات) کی توحید سے۔ کیونکہ ذات (الذات) کا علم اصلاً ممکن نہیں ہے۔ پس اللہ کی توحید کا علم ایک فکری دلیل کا علم ہے، نہ کہ کشفی شہود (شہود) کا علم۔ توحید کا علم کبھی بھی ذوق (ذوق) نہیں ہو سکتا، اور اس کا تعلق صرف مراتب سے ہے۔ اور ذات (الذات) میں توحید کہاں، جبکہ صفات معنویہ وارد ہوئی ہیں اور ان میں لوگوں کا اختلاف ہے، اور حد اور حقیقت کے لحاظ سے ان کے اعیان کا اختلاف ہے، اور یہ کہ یہ اس کا عین نہیں ہے۔ یہ عقل اور شرع میں ہے۔ پھر تعریف الٰہی میں ہاتھ، آنکھ، قدم، انگلیاں اور دیگر چیزیں منفرد طور پر بیان کی گئی ہیں، اور یہ سب ذات (الذات) کی توحید کے منافی ہیں، لیکن الوہیت (الألوهة) کی توحید کے منافی نہیں ہیں۔ اسی لیے تنازع اس قول میں وارد ہوا ہے:\n\nرسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے:\n**إذا بويع لخليفتين فاقتلوا الآخر منهما**\n(جب دو خلیفوں کی بیعت کی جائے تو ان میں سے بعد والے کو قتل کر دو)۔\n\nکیونکہ مرتبے کی احدیت (أحدية) دوسرے کو قبول نہیں کرتی اور نہ ہی شرکت کو برداشت کرتی ہے، اس لیے کہ مطلوب اصلاح ہے نہ کہ فساد، اور ایجاد ہے نہ کہ معدوم کرنا۔ اور اللہ تعالیٰ نے فرمایا:\n**لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا**\n(اگر آسمانوں اور زمین میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں بگڑ جاتے)۔\nپس اس نے معبود (الإله) کو واحد قرار دیا، اور یہ نہیں فرمایا کہ اگر ذات (الذات) الٰہی تقسیم ہو جاتی تو وہ دونوں بگڑ جاتے۔ اس نے اس طرح کی کسی چیز کا ذکر نہیں کیا۔ اور متکلمین کے نزدیک الٰہ (الإله) ذوات کا مجموعہ ہے، کیونکہ صفات زائدہ اعیان ہیں جو ذات حق (ذات الحق) کے ساتھ قائم موجود ہیں، اور اس مجموعے کے ساتھ وہ الٰہ ہوتا ہے۔ تو وہ توحید کہاں ہے جس کا وہ دعویٰ کرتے ہیں؟ اسی طرح فلاسفہ میں سے عقلاء کے نزدیک الٰہ نسبتوں کا مجموعہ ہے۔ تو ان کے نزدیک وحدانیت کہاں ہے؟ کیونکہ وہ اسے علم، حیات، لذت اور اپنے کمال پر خوشی سے متصف کرتے ہیں۔ پس اگر آپ انصاف کریں تو وحدت ایک سنی جانے والی چیز ہے اور ایک ایسا نام ہے جس کا کوئی حقیقی مسمیٰ نہیں ہے۔ پس اللہ کے سوا کوئی معبود نہیں، جو اپنی الوہیت (ألوهية) میں واحد ہے، جو اپنے بندوں میں سے اپنی الوہیت میں جھگڑنے والوں اور اپنے افعال میں اس کے ساتھ مزاحمت کرنے والوں پر قہار ہے۔ اور ان دو صنفوں کے علاوہ، ان کے لیے اللہ واحد (الواحد) غفار ہے۔ اور جب آپ یہ جان چکے، تو یہ کثرت (الكثرة) آپ کو اللہ تعالیٰ کی توحید (توحید) سے حجاب میں نہ ڈالے، لیکن میں نے آپ کے لیے آپ کی توحید کا متعلق بیان کر دیا ہے۔ اور ہم نے ذات (الذات) کے عین کا ذکر نہیں کیا، کیونکہ شرعاً اس میں غور و فکر ممنوع ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n**لا تتفكروا في ذات الله‏**\n(اللہ کی ذات (ذات اللہ) میں غور و فکر نہ کرو)۔\n\nاور اللہ تعالیٰ نے فرمایا:\n**ويُحَذِّرُكُمُ الله نَفْسَهُ**\n(اور اللہ تمہیں اپنی ذات (نفسہ) سے ڈراتا ہے)۔\nیعنی اس سے کہ تم اس میں غور و فکر کرو اور اس پر کسی امر کا حکم لگاؤ کہ وہ ایسی ہے یا ویسی ہے۔ اور الوہیت (الألوهة) میں کلام کو محدود نہیں کیا گیا، اور نہ ہی وہ فکر سے ادراک کی جا سکتی ہے۔ اور اہل اللہ کے نزدیک اس کا اپنی حیثیت سے مشاہدہ ممنوع ہے۔ بلکہ اس کے مظاہر (مظاہر) ہیں جن میں وہ ظاہر ہوتا ہے، اور ان مظاہر کے ساتھ بندوں کی رؤیت کا تعلق ہے۔ اور شرائع ان کے ساتھ وارد ہوئی ہیں۔ اور ہمارے پاس اس کے بارے میں علم صرف صفات تنزیہ یا صفات افعال کی صورت میں ہے۔ اور جس نے یہ دعویٰ کیا کہ اس کے پاس کسی نفسیاتی ثبوتی صفت کا علم ہے، تو اس کا دعویٰ باطل ہے، کیونکہ وہ صفت اس کی حد بندی کرے گی، جبکہ اس کی ذات (ذات) کی کوئی حد نہیں۔ پس یہ ایک ایسا دروازہ ہے جو کائنات کے سامنے بند ہے، جسے کھولنا درست نہیں، اور حق سبحانہ و تعالیٰ اس میں منفرد ہے۔ اور جب حق (الحق) ویسا ہی ہے جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے علم کے بارے میں خبر دی جو اللہ نے انہیں سکھایا:\n\nآپ صلی اللہ علیہ وسلم نے فرمایا:\n**اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك أو استأثرت به في علم غيبك**\n(اے اللہ! میں تجھ سے تیرے ہر اس نام کے واسطے سے سوال کرتا ہوں جو تو نے خود کو دیا، یا اپنی مخلوق میں سے کسی کو سکھایا، یا جسے تو نے اپنے علم غیب (علم غيب) میں اپنے پاس محفوظ رکھا)۔\nپس اس کے پاس ایسے نام ہیں جنہیں اس کے سوا کوئی نہیں جانتا، اور وہ اسی کی طرف راجع ہیں۔ اور اس نے اپنے استئثار (محفوظ رکھنے) سے یہ منع کر دیا کہ وہ انہیں اپنی مخلوق میں سے کسی کو نہیں سکھائے گا۔ اور اس کے اسماء نہ تو محض نام ہیں اور نہ ہی جامد، بلکہ اس کے اسماء تعریف، مدح اور ثناء کے طریقے پر ہیں۔ اسی لیے وہ حسنیٰ (اچھے) ہیں، ان معانی کی وجہ سے جو ان سے سمجھے جاتے ہیں، برخلاف ان ناموں کے جو صرف مسمیٰ اعیان پر دلالت کرتے ہیں، نہ کہ مدح یا ذم کی جہت پر۔ اور ہمارے نزدیک سب سے بڑا نام \"اللہ\" ہے جس میں شرکت واقع نہیں ہوتی۔ تو اس تعریف کے ساتھ توحید (توحید) کہاں ہے جس کا یہ دعویٰ کرنے والا گمان کرتا ہے کہ اس نے توحید نفسی کا علم حاصل کر لیا ہے؟ جبکہ اس کے لیے نہ شرع گواہی دیتی ہے، نہ عقل، اور نہ ہی کشف (الکشف)، اور ان کے علاوہ کوئی نہیں ہے اور یہ سب عادل ہیں۔ تو پھر آپ کا کیا حال ہو گا اس کے بارے میں جو ان سے باہر ہو؟ پس آپ اس چیز کو لازم پکڑیں جس کا آپ کو مکلف بنایا گیا ہے، یعنی مردوں کی زیارت (زيارة الموتى)، اور وہ ان کے ساتھ مل جانا اور ان کی صف میں شامل ہو جانا ہے، اور وہ امر کو جیسا کہ وہ ہے ادراک کرنے سے عاجز ہونا ہے۔ اور ہم صرف افعال مقاربہ (قربت والے افعال) میں تصرف کرتے ہیں، اور وہ \"کاد\" اور اس کے اخوات ہیں۔\n\nپس کہا جاتا ہے کہ \"دولہا امیر ہونے ہی والا تھا\" حالانکہ وہ حقیقت میں امیر نہیں ہے، اور \"زید حج کرنے ہی والا تھا\" یعنی وہ حج کے قریب پہنچ گیا۔ اور اللہ تعالیٰ نے فرمایا:\n**إِذا أَخْرَجَ يَدَهُ لَمْ يَكَدْ يَراها**\n(جب وہ اپنا ہاتھ نکالتا ہے تو اسے دیکھ بھی نہیں پاتا)۔\nپس اس نے اسے اس طرح بیان کیا کہ اس نے نہ تو اسے دیکھا اور نہ ہی اس کے دیکھنے کے قریب پہنچا، کیونکہ \"لم\" کے \"یکاد\" پر داخل ہونے سے قرب کی نفی ہو گئی ہے، اور یہ نفی اور جزم کا حرف ہے جو اسماء کے لیے افعال مضارعہ پر داخل ہو کر ان کی نفی کرتا ہے۔ اور اس مقام (منزل) سے علم زجر و ردع کا تعلق ہے اس شخص کے لیے جو لوگوں میں سے یہ کہتا ہے کہ اس نے ذات حق (ذات الحق) کو جان لیا ہے، کہ اس کا جہل (جہل) اس چیز کے بارے میں جس کا وہ عالم ہونے کا دعویٰ کرتا ہے، اسے آخرت میں ہی منکشف ہو گا، پس وہ وہاں جان لے گا کہ معاملہ اس کے علم کے اعتقاد کے خلاف ہے، اور یہ کہ وہ دنیا میں بھی نہیں جانتا تھا اور آخرت میں بھی نہیں۔ اللہ تعالیٰ نے فرمایا:\n**وبَدا لَهُمْ من الله ما لَمْ يَكُونُوا يَحْتَسِبُونَ**\n(اور ان کے لیے اللہ کی طرف سے وہ ظاہر ہوا جس کا وہ گمان بھی نہیں کرتے تھے)۔\nپس یہ عام ہے، لہٰذا ہر اس گروہ کے لیے جو کسی ایسے امر کا اعتقاد رکھتا ہے جو حقیقت میں نہیں ہے، اس اعتقاد کی نفی ظاہر ہو گی۔ اور آیت میں اس بات کا ذکر نہیں کیا گیا کہ یہ نفی عجز کے ذریعے ہوئی یا نقیض کی معرفت کے ذریعے۔ اور یہ دونوں امر آخرت میں ہوں گے۔ جیسے وہ شخص جو اس شخص کے لیے وعید کے نفاذ کا قائل ہو جو بغیر توبہ کے نافرمانی کی حالت میں مر گیا، پھر اللہ قیامت کے دن اسے معاف کر دے، تو اس کے لیے اللہ کی طرف سے وہ ظاہر ہوا جو وہ تجاوز (معافی) کے بارے میں نہیں جانتا تھا، اور مؤاخذہ کا اس کا علم زائل ہو گیا۔ پس ہر گروہ کے لیے اللہ کی طرف سے اس کے مسئلے کے مطابق ظاہر ہو گا۔ اگر علم حقیقت میں علم یقین ہوتا تو وہ تبدیل نہ ہوتا۔ بلکہ یہ تو گمان اور ظن ہے جو اپنے صاحب سے علم کی صورت میں پردہ میں رہا، پس وہ کہتا ہے کہ وہ جانتا ہے، اور حق (الحق) اس سے کہتا ہے کہ تو گمان کرتا ہے اور حساب لگاتا ہے۔ اور ایک مقام کا دوسرے مقام سے کیا مقابلہ؟ پس نہ ہر امر معلوم ہوتا ہے اور نہ ہی ہر امر مجہول ہوتا ہے۔ پس علماء میں سب سے بڑا عالم وہ ہے جو یہ جانتا ہے کہ جو چیز معلوم ہے وہ معلوم ہے، اور جو معلوم نہیں ہے وہ معلوم نہیں ہے۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا:\n**لا أحصي ثناء عليك‏**\n(میں تیری ثناء کا احاطہ نہیں کر سکتا)۔\n\nپس آپ نے جان لیا کہ وہاں کوئی ایسا امر ہے جس کا احاطہ نہیں کیا جا سکتا۔ اور صدیق (ابو بکر رضی اللہ عنہ) نے فرمایا:\n**العجز عن درك الإدراك إدراك‏**\n(ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے)۔\n\nیعنی اس نے ادراک کر لیا کہ کوئی ایسا امر ہے جس کے ادراک سے وہ عاجز ہے۔ پس یہ علم ہے، نہ کہ جہل۔ انسان قیامت کے دن اپنے فکر کے اس عجز کو جان لے گا جس کے ادراک کا وہ گمان کرتا تھا، لیکن وہ اپنے فکر کی آگ سے عذاب میں ہو گا، کیونکہ شرع کی حجت اس پر قائم ہے، اس لیے کہ شرع نے اس کے لیے واضح کر دیا اور بیان کر دیا کہ اسے کس چیز میں غور و فکر کرنا چاہیے۔ جیسا کہ اللہ نے فرمایا:\n**أَ ولَمْ يَتَفَكَّرُوا ما بِصاحِبِهِمْ من جِنَّةٍ**\n(کیا انہوں نے غور نہیں کیا کہ ان کے ساتھی کو کوئی جنون نہیں ہے؟)\nیعنی یہ دلیل کے ذریعے رسول کی معرفت تک پہنچاتا ہے۔ اور اس آیت سے یہ استدلال کیا جاتا ہے کہ اللہ تعالیٰ کا اس رسول کے ہاتھ پر کوئی ایسی دلیل قائم کرنا ضروری ہے جو اس کے دعوے میں اس کی تصدیق کرے، اور اگر ایسا نہ ہوتا تو اس کا قول **أَ ولَمْ يَتَفَكَّرُوا** (کیا انہوں نے غور نہیں کیا) سچا نہ ہوتا۔ اور فکر صرف اس دلیل میں ہو سکتی ہے جو اس کی سچائی پر دلالت کرے کہ وہ اللہ کی طرف سے رسول ہے۔ اور دلیل وہ ہے جس میں غور کیا جائے اور جو مدلول تک پہنچائے۔ اگر اللہ نے دلائل قائم نہ کیے ہوتے تو وہ عقلمندوں کے لیے غور و فکر کو مشروع نہ کرتا اور نہ ہی ان سے اس کا مطالبہ کرتا۔ اسی طرح اللہ سبحانہ و تعالیٰ کی معرفت میں بھی، جب اس نے کچھ امور کا ذکر کیا تو فرمایا:\n**إِنَّ في ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ**\n(بے شک اس میں ان لوگوں کے لیے نشانیاں ہیں جو غور و فکر کرتے ہیں)۔\nپس جب انسان فکر میں اپنی حد سے تجاوز کرتا ہے اور اس چیز میں غور کرتا ہے جس میں اسے غور نہیں کرنا چاہیے، تو قیامت کے دن اسے اس کے فکر کی آگ سے عذاب دیا جائے گا۔ پھر یہ کہ انسان کو اس چیز میں غور و فکر کرنا مشغول کر دیتا ہے جس میں اسے غور و فکر مشروع نہیں کیا گیا، اور وہ ان نعمتوں پر منعم (اللہ) کا شکر ادا کرنے سے غافل ہو جاتا ہے جو اللہ نے اسے عطا کی ہیں۔ پس وہ دو عذابوں کا مستحق ہوتا ہے: ایک نامناسب چیز میں فکر کا عذاب، اور دوسرا اس نعمت پر شکر نہ کرنے کا عذاب جو اسے عطا کی گئی۔ اور علم کی نعمت سے بڑھ کر کوئی نعمت نہیں، اگرچہ اللہ کی نعمتیں ان کے موجب اسباب کے لحاظ سے بے شمار ہیں۔ لیکن حقیقت میں نعمت (النعيم) منعم علیہ کے نفس میں لذت (اللذة) کا وجود ہے، جو بے شمار اسباب کے ساتھ ہوتی ہے، اور وہ دو چیزوں میں محدود ہے: ایک اس چیز کا وجود جس سے لذت حاصل ہو، اور دوسرا اس چیز کا عدم جس کے عدم سے لذت حاصل ہو۔ اور یہ نسبتی امور ہیں، جیسے کسی دشمن سے خوف زدہ شخص کو لذت کا حاصل ہونا جس کا وہ انتظار کر رہا ہو، پھر وہ دشمن ہلاک ہو جائے، تو اسے اس کی ہلاکت پر ایسی لذت ملتی ہے جس کا اندازہ نہیں لگایا جا سکتا، اور یہ اس خوف سے امن کے وجود کی وجہ سے ہے جس سے وہ ڈر رہا تھا۔ پس اسباب کثرت میں بے شمار ہیں، اور لذت (اللذة) ایک ہے، اور یہی حقیقی نعمت (النعمة المحققة) ہے، جیسا کہ درد ہی حقیقی عذاب (العذاب المحقق) ہے اور اس کے اسباب بے شمار ہیں۔ پس کسی چیز کو اس کے پڑوس یا سبب کی وجہ سے دوسرے چیز کے نام سے موسوم کیا گیا۔\n\n### [یہ کہ زیارت (الزيارة) میلان (الميل) ہے]\n\nاور جان لیجیے کہ زیارت (الزيارة) \"زور\" سے ماخوذ ہے، اور وہ میلان (الميل) ہے۔ پس جس نے کسی قوم کی زیارت کی تو اس نے اپنی ذات سے ان کی طرف میلان کیا۔ اور اگر اس نے ان کی زیارت اپنے معنی کے ساتھ کی تو اس نے اپنے قلب سے ان کی طرف میلان کیا۔ اور جھوٹی گواہی (شہادة الزور) حق سے باطل کی طرف میلان ہے۔ پس مردوں کی زیارت (زيارة الموتى) ان کی طرف میلان کرنا ہے، اس صفت موت (الموت) کے ساتھ عاشقانہ تعلق کی وجہ سے کہ وہ اس میں حلول کر جائے۔ کیونکہ میت کا اپنی ذات میں کوئی حکم نہیں ہوتا، بلکہ وہ اس کے حکم میں ہوتا ہے جو اس میں تصرف کرتا ہے۔ اور میت سے نہ تو منع کرنا، نہ انکار، نہ تعریف، نہ مذمت، اور نہ ہی اعتراض کا تصور کیا جا سکتا ہے، بلکہ وہ ایک ذاتی حالی تسلیم کے ساتھ مسلم ہوتا ہے۔ اسی طرح اس کے زائر (زیارت کرنے والے) کا حال اللہ کے ساتھ ایسا ہونا چاہیے جیسا کہ میت کا حال اس کے ساتھ ہوتا ہے جو اس میں تصرف کرتا ہے۔ اور جب وہ اس مقام (مقام) تک پہنچ جائے، اس حد تک جو اس میں مشروع ہے نہ کہ مطلقاً، تب وہ مردوں کے مقام کو پہنچتا ہے۔ اور وہ اس صفت کے ساتھ مطلقاً موصوف نہیں ہو گا مگر اپنے معنی میں، نہ کہ اپنے ظاہر و باطن کے حس میں۔ بلکہ اسے چاہیے کہ وہ ان امور میں اپنے ظاہر و باطن کے افعال میں زندہ ہو جن کا تعلق نہی الٰہی سے ہے، اور ان تمام امور میں قضاء کے وارد ہونے پر تسلیم کے ساتھ مردہ ہو، نہ کہ مقضیٰ (جس کا فیصلہ کیا گیا) کے لیے۔\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏**\n(اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و هشتاد و دوم در معرفت منزل دیدار مردگان (تزاور الموتى) و اسرار آن از حضرت موسوی.\n\nاگر ارواح ما از علم ذات خود جاهل شوند،\nآن مرگ است و جسدها گورها هستند.\nو اگر دانا شوند، حشر در آن‌ها محقق است،\nو به همین دلیل برای آن‌ها رستاخیزی (نشور) خواهد بود.\nپس علم چیزی نیست جز میان نور و ظلمت،\nو هر سخنی غیر از این، انحراف (زور) است.\n\n### [مرگ عبارت است از جدایی روح از جسد]\n\nبدان که مرگ عبارت است از جدایی روح (الروح) از جسدی که حیات حسی‌اش به واسطه آن بود. این جدایی بر هر دو (روح و جسد) عارض می‌شود، پس از آنکه به اجتماع (که علت حیات است) متصف بودند. همچنین است مرگ نفس (النفس) به سبب فقدان علم. اگر بگویی که علم به خداوند (که حیات نفوس است) امری عارضی است و جهل قبل از وجود علم برای نفس ثابت بوده است، پس چگونه جاهل به مرگ توصیف می‌شود در حالی که علمی بر او مقدم نبوده است؟ می‌گوییم: علم به خداوند در پیمان میثاق (الأخذ الميثاقي) به نفس هر انسانی سبقت گرفت، آنگاه که خداوند آن‌ها را بر خودشان گواه گرفت. اما هنگامی که نفوس، اجسام طبیعی را در دنیا آباد کردند، علم به توحید خداوند از آن‌ها جدا شد. پس نفوس به واسطه جهل به توحید خداوند مرده باقی ماندند. سپس خداوند برخی از نفوس را با علم به توحید خداوند زنده کرد و همه آن‌ها را با علم به وجود خداوند زنده نمود، زیرا علم به وجود خداوند از ضروریات عقل است. به همین دلیل ما او را مرده نامیدیم. خداوند متعال می‌فرماید: «أَ وَمَنْ كانَ مَيْتاً» (آیا کسی که مرده بود)، یعنی کسی که خداوند روح علم به خود را از او قبض کرده بود، «فَأَحْيَيْناهُ وَجَعَلْنا لَهُ نُوراً يَمْشِي بِهِ فِي النَّاسِ» (پس او را زنده کردیم و برایش نوری قرار دادیم که با آن در میان مردم راه می‌رود). پس علمش را به او بازگرداند و به واسطه آن زنده شد، همان‌گونه که ارواح در سرای آخرت در روز بعث به اجسادشان بازگردانده می‌شوند. و قول او: «كَمَنْ مَثَلُهُ فِي الظُّلُماتِ» (مانند کسی که مَثَل او در تاریکی‌هاست) اشاره به مقابله با نوری است که با آن در میان مردم راه می‌رود و آن عین حیات است. پس حیات، اقرار به وجود (الوجود) است، یعنی به وجود خداوند؛ و نور قرار داده شده، علم به توحید خداوند است؛ و تاریکی‌ها، جهل به توحید خداوند است؛ و مرگ، جهل به وجود خداوند است. به همین دلیل، خداوند در آیه مربوط به پیمان میثاق (الأخذ الميثاقي) تنها اقرار به وجود خود را ذکر کرد، نه توحیدش را. در آنجا متعرض توحید نشد و فرمود: «أَ لَسْتُ بِرَبِّكُمْ ف قالُوا بَلى‏» (آیا من پروردگار شما نیستم؟ گفتند: بله). پس به ربوبیت (الربوبية) او اقرار کردند، یعنی او سرور آن‌هاست. ممکن است یک بنده به حکم شراکت، مملوک دو نفر باشد. اما هر سروری که به او بگوید: آیا من پروردگار تو نیستم؟ بنده ناگزیر باید بگوید: بله، و تصدیق کند. به همین دلیل گفتیم که اقرار تنها به وجود خداوند به عنوان رب (پروردگار)، یعنی مالک و سرور، بوده است. و به همین دلیل خداوند در آیه، پس از آنکه فرمود: «فَأَحْيَيْناهُ» (پس او را زنده کردیم)، به آن اکتفا نکرد تا اینکه فرمود: «وَجَعَلْنا لَهُ نُوراً يَمْشِي بِهِ فِي النَّاسِ» (و برایش نوری قرار دادیم که با آن در میان مردم راه می‌رود). منظور علم به توحید خداوند است و نه غیر آن، زیرا این علمی است که به واسطه آن شرف و سعادت برای او حاصل می‌شود و غیر از این در این منزلت جایگزین آن نمی‌شود. پس در آنچه گفتیم تأمل کن؛ اکنون دانستی که عارض شدن مرگ بر نفوس، تنها پس از یک حیات سابق بوده است، زیرا مرگ تنها بر موجود زنده عارض می‌شود و تفرق تنها پس از اجتماع رخ می‌دهد. و پس از آنکه این را دانستی،\n\n### [اینکه علم واحد به کثرت، موجب جهل او به نفس خود می‌شود]\n\nبدان که از ویژگی‌های این منزل این است که علم واحد به کثرت، موجب جهل او به نفس خود می‌شود، زیرا کثرت برای او مشهود است. این بدان سبب است که روح (الروح)، خود را تعقل نمی‌کند مگر همراه با این جسم که محل کمیت و کثرت است، و هرگز خود را به تنهایی شهود نکرده است، با وجود اینکه در ذات خود غیرقابل تقسیم است. انسان، انسانیت خود را نمی‌شناسد مگر با وجود جسم همراهش. به همین دلیل، اگر از حد و حقیقتش سؤال شود، می‌گوید: جسمی است تغذیه‌کننده، حساس و ناطق. این حقیقت انسان و حد ذاتی نفسی اوست. پس او همیشه در تعریف خود، هنگامی که از او سؤال می‌شود، این کثرت را در نظر می‌گیرد و احدیت (أحديته) خود را در ذاتش تعقل نمی‌کند، بلکه احدیت جنس را تعقل می‌کند نه احدیت حقیقی را. آنچه از طریق اکتساب برای او حاصل می‌شود، این است که او در عین خود واحد است؛ این علم، علم دلیل فکری است، نه علم ذوق شهودی کشفی (علم ذوق شهودي كشفي). همچنین علم به خداوند، متعلقش علم به توحید الوهیت (توحيد الألوهة) برای مسمای «الله» است، نه توحید ذات. زیرا ذات (الذات) اصلاً صحیح نیست که دانسته شود. پس علم به توحید خداوند، علم دلیل فکری است نه علم شهود کشفی (علم شهود كشفي). علم به توحید هرگز ذوق (تجربه) نخواهد بود و تنها به مراتب تعلق دارد. توحید در ذات کجا می‌تواند باشد، با وجود صفات معنوی که وارد شده است و اختلاف مردم در آن‌ها و اختلاف اعیان آن‌ها از نظر حد و حقیقت، و اینکه این صفات عین آن صفات نیستند؟ این در عقل و در شرع است. سپس تعریف الهی به دست، چشم، پا، انگشتان و غیره منحصر شد. همه این‌ها با توحید ذات منافات دارند، اما با توحید الوهیت (توحيد الألوهة) منافات ندارند. به همین دلیل، نزاع در مورد\n\nقول پیامبر (صلی الله علیه و سلم): «إذا بويع لخليفتين فاقتلوا الآخر منهما» (اگر با دو خلیفه بیعت شد، دومی را بکشید)\n\nرخ داد، زیرا احدیت مرتبه، دومی را نمی‌پذیرد و تحمل شراکت ندارد، چون مطلوب، صلاح است نه فساد، و ایجاد است نه اعدام. و خداوند متعال می‌فرماید: «لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا» (اگر در آسمان و زمین خدایانی جز الله وجود داشت، قطعاً تباه می‌شدند). پس خداوند، اله (معبود) را واحد شمرد و نگفت اگر ذات اله قابل تقسیم بود، تباه می‌شدند؛ متعرض هیچ‌یک از این‌ها نشد. اله نزد متکلمان مجموعه‌ای از ذوات است، زیرا صفات، اعیان زائدی هستند که موجود و قائم به ذات حق‌اند، و با این مجموع، اله حاصل می‌شود. پس توحیدی که ادعا می‌کنند کجاست؟ همچنین عقلا از فلاسفه، اله نزد آن‌ها مجموعه‌ای از نِسب است. پس وحدانیت نزد آن‌ها کجاست؟ زیرا او را به علم، حیات، لذت و ابتهاج به کمالش وصف می‌کنند. اگر منصف باشی، وحدت امری است که شنیده می‌شود و اسمی است بر غیر مسمای حقیقی. پس هیچ معبودی (إله) جز الله نیست، که در الوهیتش واحد است و بر کسانی از بندگانش که در الوهیت با او منازعه می‌کنند و در افعال با او مزاحمت می‌نمایند، قهار است. و غیر از این دو صنف، خداوند برای آن‌ها واحد و غفار است. و پس از آنکه این را دانستی، نباید این کثرت تو را از توحید خداوند متعال محجوب سازد، بلکه من متعلق توحید تو را بیان کردم و متعرض ذات در عین آن نشدیم، زیرا تفکر در آن شرعاً ممنوع است.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «لا تتفكروا في ذات الله» (در ذات خداوند تفکر نکنید).\n\nو خداوند متعال می‌فرماید: «وَيُحَذِّرُكُمُ الله نَفْسَهُ» (و خداوند شما را از [ناحیه] خود برحذر می‌دارد)، یعنی از اینکه در آن تفکر کنید و بر آن حکم کنید که چنین و چنان است. اما کلام در الوهیت را منع نکرده است. ذات با فکر درک نمی‌شود و مشاهده آن از حیث خودش نزد اهل الله ممنوع است. بلکه ذات مظاهری دارد که در آن‌ها ظاهر می‌شود و رؤیت بندگان به واسطه آن مظاهر تعلق می‌گیرد و شرایع نیز به آن‌ها وارد شده‌اند. آنچه از علم به او در دست ماست، تنها صفات تنزیه یا صفات افعال است. و هر کس گمان کند که علمی به صفت نفسی ثبوتی دارد، گمانش باطل است، زیرا آن صفت او را محدود می‌سازد، در حالی که ذات او حدی ندارد. این بابی است که بر روی کائنات بسته است و صحیح نیست که گشوده شود؛ حق سبحانه (الحق سبحانه) به آن منحصر شده است. و اگر حق بر همان‌گونه باشد که رسول (صلی الله علیه و سلم) از علم خود به آنچه خداوند به او آموخته خبر داده است،\n\nپس فرمود: «اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك أو استأثرت به في علم غيبك» (بار خدایا، من از تو می‌خواهم به حق هر اسمی که خود را بدان نامیدی، یا آن را به یکی از مخلوقاتت آموختی، یا آن را در علم غیب خود منحصر ساختی)،\n\nپس نزد او اسم‌هایی است که جز خودش کسی آن‌ها را نمی‌داند؛ این‌ها به او بازمی‌گردند. و با منحصر ساختن (استئثار) منع کرده است که آن را به احدی از خلقش بیاموزد. و اسم‌های او نه عَلَم (نام خاص) هستند و نه جامد، بلکه اسم‌های او بر طریق ستایش، مدح و ثنا هستند. به همین دلیل، به خاطر معانی‌ای که از آن‌ها فهمیده می‌شود، حُسنی (نیکو) هستند، برخلاف اسم‌های عَلَم که تنها بر اعیان نامیده شده دلالت می‌کنند، نه بر جهت مدح و نه بر جهت ذم. و بزرگترین آن‌ها نزد ما اسم «الله» است که در آن مشارکت رخ نمی‌دهد. پس توحید کجاست با این تعریفی که این مدعی گمان می‌کند که به علم توحید نفسی دست یافته است؟ در حالی که نه شرع، نه عقل و نه کشف (الکشف) برای او شهادت نمی‌دهند، و غیر از این‌ها چیزی نیست و آن‌ها عادل هستند. پس چگونه است حال تو با آنچه از این‌ها خارج شده است؟ پس به آنچه مکلف شده‌ای پایبند باش، یعنی زیارت مردگان (زيارة الموتى) که همان پیوستن به آن‌ها و داخل شدن در سلک آن‌هاست، و آن عبارت است از عجز از درک امر بر آنچه هست. و ما تنها در افعال مقاربت (نزدیک شدن) تصرف می‌کنیم که همان «کاد» و اخوات آن است.\n\nگفته می‌شود: «کاد العروس يكون أميراً» (نزدیک بود که داماد امیر شود)، در حالی که در واقع امیر نیست. و «کاد زيد يحج» (نزدیک بود که زید حج کند)، یعنی به حج نزدیک شد. و خداوند متعال می‌فرماید: «إِذا أَخْرَجَ يَدَهُ لَمْ يَكَدْ يَراها» (هنگامی که دستش را بیرون آورد، نزدیک نبود که آن را ببیند). پس او را به این وصف کرد که آن را ندید و نزدیک به دیدن آن هم نشد، زیرا با ورود «لم» بر «یکاد» (که حرف نفی و جزم است و بر افعال مضارع وارد می‌شود و آن‌ها را نفی می‌کند) نزدیکی را نفی کرده است. و علم زجر و بازدارندگی برای کسی که ادعا می‌کند ذات حق را شناخته است، به این منزل تعلق دارد؛ جهل او به آنچه گمان می‌کرد عالم به آن است، آشکار نمی‌شود مگر در سرای آخرت. در آنجا می‌داند که امر بر خلاف چیزی است که از علم خود اعتقاد داشت و اینکه او نه در دنیا و نه در آخرت عالم نیست. خداوند متعال می‌فرماید: «وَبَدا لَهُمْ مِنَ اللهِ ما لَمْ يَكُونُوا يَحْتَسِبُونَ» (و از جانب خداوند برایشان چیزی آشکار شد که هرگز گمان نمی‌کردند). پس این حکم عام است. برای هر گروهی که امری را اعتقاد داشتند که امر بر آن نیست، نفی آن معتقد آشکار می‌شود. و در آیه متعرض این نشده است که نفی آن به واسطه عجز است یا به واسطه معرفت نقیض؛ و هر دو امر در سرای آخرت واقع می‌شود. مانند کسی که به اجرای وعید برای کسی که عاصی مرده و توبه نکرده است، قائل است، اما خداوند در روز قیامت او را می‌آمرزد. پس از جانب خداوند چیزی برای او آشکار شده که از آن بی‌خبر بود (یعنی گذشت و عفو)، و علم او به مؤاخذه از بین رفت. پس برای هر گروهی از جانب خداوند بحسب مسئله‌شان چیزی آشکار می‌شود. اگر علم در واقعیت امر، علم یقین بود، تغییر نمی‌کرد. بلکه آن گمان و پنداری است که به صورت علم بر صاحبش پوشیده شده است. پس او می‌گوید که می‌داند، در حالی که حق به او می‌گوید: تو گمان می‌کنی و می‌پنداری. و مقام کجا و مقام کجا؟ پس نه هر امری دانسته می‌شود و نه هر امری مجهول می‌ماند. داناترین علما کسی است که بداند آنچه را می‌داند، می‌داند و آنچه را نمی‌داند، نمی‌داند.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «لا أحصي ثناء عليك» (من نمی‌توانم ثنای تو را شمارش کنم).\n\nو صدیق (ابوبکر) فرمود: «العجز عن درك الإدراك إدراك» (عجز از درکِ درک، خود درک است).\n\nیعنی او درک کرده است که امری وجود دارد که از درک آن عاجز است. این علم است، نه جهل. پس انسان در روز قیامت عجز فکر خود را از درک آنچه گمان می‌کرد درک کرده است، می‌داند. با این حال، به واسطه فکرش با آتش هلاکت (اصطلامه) عذاب می‌شود، زیرا حجت شرع بر او قائم است، چرا که شرع برای او بیان کرده و آشکار ساخته است که در چه چیزی باید تفکر کند، چنانکه فرمود: «أَ وَلَمْ يَتَفَكَّرُوا ما بِصاحِبِهِمْ مِنْ جِنَّةٍ» (آیا تفکر نکردند که همنشین آن‌ها هیچ جنونی ندارد؟). یعنی با دلیل می‌توان به معرفت رسول رسید. و با این آیه استدلال می‌شود که خداوند متعال باید بر دست این رسول دلیلی نصب کند که او را در ادعایش تصدیق کند. اگر چنین نبود، قول او «أَ وَلَمْ يَتَفَكَّرُوا» صادق نبود، و تفکر تنها در دلیلی بر صدق اوست که او رسولی از جانب خداست. و دلیل همان چیزی است که در آن نظر می‌شود و به مدلول می‌رساند. اگر خداوند ادله را نصب نمی‌کرد، تفکر را برای عقلا تشریع نمی‌کرد و از آن‌ها مطالبه نمی‌نمود. همچنین در معرفت آن‌ها به خداوند سبحان، هنگامی که اموری را ذکر کرد، فرمود: «إِنَّ فِي ذلِكَ لَآياتٍ لِقَوْمٍ يَتَفَكَّرُونَ» (قطعاً در این امر نشانه‌هایی است برای قومی که تفکر می‌کنند). پس اگر فکر از حد خود تجاوز کند و در آنچه نباید تفکر کند، بیندیشد، در روز قیامت با آتش فکرش عذاب می‌شود. علاوه بر این، تفکر در آنچه برای او تشریع نشده، انسان را از شکر منعم بر نعمت‌هایی که خداوند به او ارزانی داشته، باز می‌دارد. پس او صاحب دو عذاب می‌شود: عذاب تفکر در آنچه شایسته نیست و عذاب عدم شکر بر آنچه به او انعام شده است. و هیچ نعمتی بزرگتر از نعمت علم نیست، اگرچه نعمت‌های خداوند از حیث اسباب موجبه‌شان قابل شمارش نیستند. اما نعیم حقیقی، وجود لذت در نفس کسی است که به او انعام شده است، در هنگام اسباب بسیاری که قابل شمارش نیستند و در دو امر محصورند: در وجود آنچه لذت به واسطه آن حاصل می‌شود و در عدم آنچه با نبودش لذت حاصل می‌شود. این‌ها امور نسبی هستند، مانند وجود لذت برای کسی که از دشمنی می‌ترسد و انتظار او را می‌کشد، سپس آن دشمن هلاک می‌شود. این شخص از هلاکت او لذتی می‌یابد که قابل اندازه‌گیری نیست، و این به دلیل وجود امنیتی است که از آنچه می‌ترسید، حاصل شده است. پس اسباب از نظر کثرت قابل شمارش نیستند، اما لذت یکی است و آن نعمت محقق است، همان‌گونه که ألم (درد) همان عذاب محقق است و اسباب آن قابل شمارش نیستند. پس شیء به نام شیء دیگر نامیده می‌شود، اگر در مجاورت آن باشد یا به واسطه آن حاصل شده باشد.\n\n### [اینکه زیارت (الزيارة) همان میل است]\n\nبدان که زیارت (الزيارة) از «زور» گرفته شده است که به معنای میل (انحراف/گرایش) است. پس هر کس قومی را زیارت کند، با نفس خود به سوی آن‌ها متمایل شده است. اگر آن‌ها را به معنای خود زیارت کند، با قلب خود به سوی آن‌ها متمایل شده است. و شهادت زور (شهادت دروغ) میل به باطل از حق است. پس زیارت مردگان (زيارة الموتى) میل به سوی آن‌هاست، به دلیل عشق به صفت مرگ که در آن‌ها حلول کرده است. زیرا میت در نفس خود حکمی ندارد، بلکه تحت حکم کسی است که در او تصرف می‌کند. از میت تصور منع، امتناع، ستایش، مذمت یا اعتراض نمی‌رود، بلکه او تسلیم است؛ تسلیم حال ذاتی. همچنین شایسته است که حال زائر با خداوند، حال میت با کسی باشد که در او تصرف می‌کند. و هنگامی که به این مقام، بر حد مشروع آن (نه به طور مطلق) برسد، در آن هنگام به مرتبه مردان می‌رسد. و به طور مطلق به این صفت موصوف نمی‌شود مگر در معنای خود، نه در حس ظاهر و باطن خود. بلکه شایسته است که در افعال ظاهر و باطن خود در اموری که نهی الهی به آن‌ها تعلق گرفته، زنده باشد و در تسلیم به موارد قضا (قضاء) که بر او وارد می‌شود، مرده باشد، نه تسلیم به مقضی (آنچه قضا شده است). و خداوند حق را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 3
}