{
  "id": 231,
  "title": {
    "ar": "الباب الأحد والثلاثون ومائتان في المكر",
    "en": "Chapter Two Hundred and Thirty-One: Concerning Stratagem (المكر)",
    "ur": "۲۳۱ واں باب مکر (المکر) کے بیان میں",
    "fa": "باب دویست و سی و یکم در مکر (المکر)"
  },
  "content": {
    "ar": "## «الباب الأحد والثلاثون ومائتان في المكر»\n\n\n> يستدرج العاقل في عقله *** من حيث لا يعلمه الماكر\n\n\n> ومكره عاد عليه وما *** يدري بذاك الفطن الخابر\n\n\n> فمن أراد الأمن من مكره *** ليحصل الباطن والظاهر\n\n\n> يحقق الميزان من شرعه *** فيعلم الرابح والخاسر\n\n\n### [أن المكر يطلقه على إرداف النعم مع المخالفة]\n\n\nاعلم أن المكر يطلقه أهل الله على إرداف النعم مع المخالفة وإبقاء الحال مع سوء الأدب وإظهار الآيات من غير أمر ولا حد واعلم أنه من المكر عندنا بالعبد أن يرزق العبد العلم\n\n\nالذي يطلب العمل ويحرم العمل به وقد يرزق العمل ويحرم الإخلاص فيه فإذا رأيت هذا من نفسك أو علمته من غيرك فاعلم إن المتصف به ممكور به ولقد رأيت في‏\nواقعة وأنا ببغداد سنة ثمان وستمائة قد فتحت أبواب السماء ونزلت خزائن المكر الإلهي مثل المطر العام وسمعت ملكا يقول ما ذا نزل الليلة من المكر فاستيقظت مرعوبا ونظرت في السلامة من ذلك فلم أجدها إلا في العلم بالميزان المشروع فمن أراد الله به خيرا وعصمه من غوائل المكر فلا يضع ميزان الشرع من يده وشهود حاله وهذه حالة المعصوم والمحفوظ فأما إرداف النعم مع المخالفة فهو موجود اليوم كثير في المنتمين إلى طريق الله وعاينت من الممكور بهم خلقا كثيرا لا يحصى عددهم إلا الله وهو أمر عام وأما إبقاء الحال مع سوء الأدب فهو في أصحاب الهمم وهم قليلون على أنا رأينا منهم جماعة بالمغرب وبهذه البلاد وهو أنهم يسيئون الأدب مع الحق بالخروج عن مراسمه مع بقاء الحال المؤثرة في العالم عليهم مكرا من الله فيتخيلون أنهم لو لم يكونوا على حق في ذلك لتغير عليهم الحال نعوذ بالله من مكره الخفي قال تعالى سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ وأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ وقال ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ وقال إِنَّهُمْ يَكِيدُونَ كَيْداً وأَكِيدُ كَيْداً وهو من كاد من أفعال المقاربة أي كاد إن يكون حقا لظهوره بصفة حق فهو كالسحر المشتق من السحر الذي له وجه إلى الليل ووجه إلى النهار فيظهر للممكور به وجه النهار منه فيتخيل أنه الحق نعوذ بالله من الجهل واعلم أن المكر الإلهي إنما أخفاه الله عن الممكور به خاصة لا عن غير الممكور به ولهذا قال من حَيْثُ لا يَعْلَمُونَ فأعاد الضمير على المضمر في سَنَسْتَدْرِجُهُمْ وقال ومَكَرُوا مَكْراً ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ فمضمرهم هو المضمر في مكروا فكان مكر الله بهؤلاء عين مكرهم الذي اتصفوا به وهُمْ لا يَشْعُرُونَ ثم قد يمكر بهم بأمر زائد على مكرهم فإنه أرسله سبحانه نكرة فقال ومَكَرْنا مَكْراً فدخل فيه عين مكرهم ومكر آخر زائد على مكرهم وقد يكون المكر الإلهي في حق بعض الناس من الممكور بهم يعطي الشقاء وهو في العامة وقد يكون يعطي نقصان الحظ وهو المكر بالخاصة وخاصة الخاصة لسر إلهي وهو أن لا يأمن أحد مكر الله لما ورد في ذلك من الذم الإلهي في قوله فَلا يَأْمَنُ مَكْرَ الله إِلَّا الْقَوْمُ الْخاسِرُونَ ومن خسر فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ فأخفى المكر الإلهي وأشده سترا في المتأولين ولا سيما إن كانوا من أهل الاجتهاد وممن يعتقد أن كل مجتهد مصيب وكل من لا يدعوا إِلَى الله عَلى‏ بَصِيرَةٍ وعلم قطعي فما هو صاحب أتباع لأن المجتهد مشرع ما هو متبع إلا على مذهبنا فإن المجتهد إنما يجتهد في طلب الدليل على الحكم لا في استنباط الحكم من الخبر بتأويل يمكن أن يكون المقصود خلافه فإذا أمكن فليس صاحبه ممن هو على بصيرة وإن صادف الحق بالتأويل فكان صاحب أجرين بحكم الاتفاق لا بحكم القصد فإنه ليس على بصيرة وإن لم يصادف الحق كان له أجر طلب الحق فنقص حظه فهذا مكر إلهي خفي بهذا العالم المتأول فإنه من المتأهلين أن يدعو إِلَى الله عَلى‏ بَصِيرَةٍ بتعليم الله إياه إذا كان من المتقين فمكر العموم الإلهي في إرداف النعم على أثر المخالفات وزوالها عند الموافقات فلا يؤخذ بها فإن كان من علماء عامة الطريق فيرى إن ذلك من حكم قوة الصورة التي خلق عليها فيدعي القهر والتأثير في الحكم الإلهي بالوعيد ويرى أن عموم الحكمة أن يعطي الأسماء الإلهية حقها فيرى أن الاسم الغفار والغفور وأخواته ليس له حكم إلا في المخالفة فإن لم تقم به مخالفات لم يعط بعض الأسماء الإلهية حقها في هذه الدار ويحتج لنفسه بقول الله يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً وكذلك يفعل وهذا النظر كله لا يخطر له عند المخالفة وإنما يخطر له ذلك بعد وقوع المخالفة فلو تقدمها هذا الخاطر لمنع من المخالفة فإنه شهود والشهود يمنعه من انتهاك الحرمة الشرعية ولهذا\n\n\nورد الخبر إذا أراد الله إنفاذ قضائه وقدره سلب ذوي العقول عقولهم حتى إذا أمضى فيهم قضاءه وقدره ردها عليهم ليعتبروا\n\n\nفمنهم من يعتبر ومنهم من لا يعتبر كما قال وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فمنهم من عبده ومنهم من أشرك به فما يلزم نفوذ حكم العلة في كل معلول فلو أبقى عليهم عقلهم ما وقع منهم ما وقع كذلك لو كان المشهود له عند إرادة وقوع المخالفة للأسماء الإلهية لمنعه الحياء من المسمى أن ينتهك حرمة خطابه في دار تكليفه فالمخالف يقاوم القهر الإلهي ومن قاوم القهر الإلهي هلك فإذا أردف النعم على من هذه حالته تخيل أن ذلك بقوة نفسه ونفوذ همته وعناية الله به حيث رزقه من القوة ما أثر بها في الشديد العقاب وغاب عن الحليم وعن الإمهال‏\nوعدم الإهمال فإن لم يقصد انتهاك الحرمة بقوة ما هو عليه من حكم اسم إلهي فليس بممكور به مثل عصاة العامة عن غفلة وندامة بعد وقوع مخالفة فالصبر على إرداف النعم لما في طيها من المكر الإلهي أعظم من الصبر على الرزايا والبلايا\n\n\nفإن الله يقول لعبده مرضت فلم تعدني ثم قال في تفسير ذلك أما إن فلانا مرض فلم تعده فلو عدته لوجدتني عنده‏\n\n\nكما يجده الظمآن المضطر عند ما يسفر له السراب عن عدم الماء فيرجع إلى الله بخلاف النعم فإنها أعظم حجاب عن الله إلا من وفقه الله وأما مكر الله بالخاصة فهو مستور في إبقاء الحال عليه مع سوء الأدب الواقع منه وهو التلذذ بالحال والوقوف معه وما يورث من الإدلال فيمن قام به والهجوم على الله وعدم طلب الانتقال منه وما قال الله لنبيه وقُلْ رَبِّ زِدْنِي عِلْماً وما أسمعنا ذلك إلا تنبيها لنقول ذلك ونطلبه من الله ولو كان خصوصا بالنبي لم يسمعنا أو كان يذكر أنه خاص به كما قال في نكاح الهبة فللحال لذة وحلاوة في النفس يعسر على بعض النفوس طلب الانتقال من الأمر الذي أورثه ذلك الحال بل لا يطلب المزيد إلا منه وجهل أن الأحوال مواهب وأما المكر الذي في خصوص الخصوص وهو في إظهار الآيات وخرق العوائد من غير أمر ولا حد الذي هو ميزانها فإنه لما وجب على الأولياء سترها كما وجب في الرسل إظهارها إذ أمكن الولي منها وأعطى عين التحكيم في العالم يطلب الممكور به لنقص حظ عن درجة غيره يريد الحق ذلك به وجعل فيهم طلبا لطريق إظهارها من حيث لا يشعر أن ذلك مكر إلهي يؤدي إلى نقص حظ فوقع الإلهام في النفس بما في إظهار الآيات على أيديهم من انقياد الخلق إلى الله عز وجل وإنقاذ الغرقى من بحار الذنوب المهلكة وأخذهم عن المألوفات وإن ذلك من أكبر ما يدعى به إلى الله ولهذا كان من نعت الأنبياء والرسل ويرى في نفسه أنه من الورثة وأن هذا من ورث الأحوال فيحجبهم ذلك عما أوجب الله على الأولياء من ستر هذه الآيات مع قوتهم عليها وغيبهم عن ما أوجب الله على الرسل من إظهارها لكونهم مأمورين بالدعاء إلى الله ابتداء والولي ليس كذلك إنما يدعو إلى الله بحكاية دعوة الرسول ولسانه لا بلسان يحدثه كما يحدث لرسول آخر والشرع مقرر من عند العلماء به فالرسول على بصيرة في الدعاء إلى الله بما أعلمه الله من الأحكام المشروعة والولي على بصيرة في الدعاء إلى الله بحكم الاتباع لا بحكم التشريع فلا يحتاج إلى آية ولا بينة فإنه لو قال ما يخالف حكم الرسول لم يتبع في ذلك ولا كان على بصيرة فلا فائدة لإظهار الآية بخلاف الرسول فإنه ينشئ التشريع وينسخ بعض شرع مقرر على يد غيره من الرسل فلا بد من إظهار آية وعلامة تكون دليلا على صدقه إنه يخبر عن الله إزالة ما قرره الله حكما على لسان رسول آخر أعلاما بانتهاء مدة الحكم في تلك المسألة فيكون الولي مع خصوصيته قد ترك واجبا فنقصه من مرتبته ما يعطيه الوقوف مع ذلك الواجب والعمل به فلا شي‏ء أضر بالعبد من التأويل في الأشياء فالله يجعلنا على بصيرة من أمرنا ولا يتعدى بنا ما يقتضيه مقامنا والذي أسأل الله تعالى أن يرزقنا أعلى مقام عنده يكون لأعلى ولي فإن باب الرسالة والنبوة مغلق وينبغي للعالم أنه لا يسأل في المحال وبعد الأخبار الإلهي يغلق هذا الباب فلا ينبغي أن نسأل فيه فإن السائل فيه يضرب في حديد بارد إذ لا يصدر هذا السؤال من مؤمن أصلا قد عرف هذا ويكفي الولي من الله أن جعله على بصيرة في الدعاء إلى الله تعالى من حيث ما يقتضيه مقام الولاية والاتباع كما جعل الرسول يدعو إِلَى الله عَلى‏ بَصِيرَةٍ من حيث ما يقتضيه مقام الرسالة والتشريع ويعصمنا من مكره ولا يجعلنا من أهل النقص ويرزقنا المزيد والترقي دنيا وآخرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Thirty-One: Concerning the Subtle Stratagem (المكر)\n\nThe Cunning One (الماكر) leads the intelligent person astray in his own intellect,\nFrom a place the intelligent one does not perceive.\nAnd His Subtle Stratagem (مكره) returns upon him, yet the shrewd, experienced one\nDoes not know this.\nSo whoever desires safety from His Subtle Stratagem,\nTo secure both the inner (الباطن) and the outer (الظاهر),\nLet him verify the Balance (الميزان) of His Sacred Law (شرعه),\nThat he may know the winner and the loser.\n\n### [That the Subtle Stratagem (المكر) is applied to the succession of blessings despite transgression]\n\nKnow that the People of God (أهل الله) apply the term Subtle Stratagem (المكر) to the succession of blessings despite transgression (المخالفة), the persistence of a spiritual state (الحال) despite bad manners (سوء الأدب), and the manifestation of Signs (الآيات) without command or limit. Know also that, in our view, it is part of the Subtle Stratagem (المكر) against the servant (العبد) that the servant is granted the knowledge (العلم) that demands action, yet is deprived of acting upon it. Or he may be granted the action, yet deprived of sincerity (الإخلاص) within it. If you observe this in yourself or know it of another, then know that the one characterized by this is subjected to the Subtle Stratagem (ممكور به).\n\nI saw in a vision (واقعة) while I was in Baghdad in the year 608 AH, that the gates of heaven were opened and the treasuries of the Divine Subtle Stratagem (المكر الإلهي) descended like a general rain. I heard an angel saying, \"What has descended tonight of the Subtle Stratagem?\" I awoke terrified and sought safety from it. I found safety only in the knowledge of the prescribed Balance (الميزان المشروع). Therefore, whoever God wills good for, and protects him from the perils of the Subtle Stratagem (المكر), must not let go of the Balance of the Sacred Law (ميزان الشرع) and the witnessing (شهود) of his own state. This is the state of the protected (المعصوم) and the preserved (المحفوظ).\n\nAs for the succession of blessings despite transgression, this is widespread today among those who claim affiliation with the Path of God (طريق الله). I have witnessed countless people subjected to the Subtle Stratagem (الممكور بهم)—their number is known only to God—and this is a general matter.\n\nAs for the persistence of the spiritual state (الحال) despite bad manners (سوء الأدب), this occurs among the people of high spiritual resolve (أصحاب الهمم), who are few. Nevertheless, we have seen a group of them in the Maghrib and in these lands. This involves them behaving improperly toward the Real (الحق) by departing from His ordinances, yet their spiritual state, which affects the world, remains—this is a Subtle Stratagem (مكرا) from God against them. They imagine that if they were not upon the truth in that matter, their state would have changed. We seek refuge in God from His hidden Subtle Stratagem (مكره الخفي). The Exalted said: <<سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ>> (We will lead them on step by step from where they do not know), and <<وأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ>> (And I will grant them respite. Indeed, My plan (كيدي) is firm). And He said: <<ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ>> (And We planned a plan (مكراً), while they perceived not). And He said: <<إِنَّهُمْ يَكِيدُونَ كَيْداً وأَكِيدُ كَيْداً>> (Indeed, they are planning a plan, and I am planning a plan).\n\n[The word *kayd* (كيد) is related to the verb *kāda* (كاد), which denotes proximity, meaning it is *close* to being the truth (حق) because it appears in the guise of the truth. It is like magic (*sihr*), which is derived from the time of *sahar* (dawn), having one face toward the night and one face toward the day. The face of the day appears to the one subjected to the Subtle Stratagem (الممكور به), so he imagines it is the Real (الحق). We seek refuge in God from ignorance (الجهل).\n\nKnow that the Divine Subtle Stratagem (المكر الإلهي) is hidden by God specifically from the one subjected to it, not from others. This is why He said: <<من حَيْثُ لا يَعْلَمُونَ>> (from where they do not know), referring the pronoun back to the implied subject in <<سَنَسْتَدْرِجُهُمْ>> (We will lead them on step by step). And He said: <<ومَكَرُوا مَكْراً ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ>> (And they planned a plan, and We planned a plan, while they perceived not). Their implied subject is the implied subject in \"they planned.\" Thus, God’s Subtle Stratagem against these people was the very essence of their own stratagem with which they were characterized, <<وهُمْ لا يَشْعُرُونَ>> (while they perceived not). Then, He may employ a Subtle Stratagem against them with an additional matter beyond their own stratagem, for the Exalted sent it down as an indefinite noun when He said: <<ومَكَرْنا مَكْراً>> (And We planned a plan), which includes the essence of their own stratagem and another stratagem added to theirs.\n\nThe Divine Subtle Stratagem (المكر الإلهي) may, in the case of some of those subjected to it, grant wretchedness (الشقاء)—this is among the common folk (العامة). Or it may grant a deficiency in spiritual portion (نقصان الحظ)—this is the Subtle Stratagem against the elite (الخاصة) and the elite of the elite (خاصة الخاصة), due to a Divine secret: that no one should feel safe from God’s Subtle Stratagem, based on the Divine censure mentioned in His saying: <<فَلا يَأْمَنُ مَكْرَ الله إِلَّا الْقَوْمُ الْخاسِرُونَ>> (None feel secure from the Subtle Stratagem of Allah except the losing people). And whoever loses, <<فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ>> (their trade was not profitable, nor were they guided).\n\nThe Divine Subtle Stratagem is most hidden and most veiled among those who engage in interpretive reasoning (المتأولين), especially if they are people of independent juridical reasoning (أهل الاجتهاد) and believe that every *mujtahid* (one who exercises *ijtihad*) is correct. And whoever does not call to God with insight (بصيرة) and certain knowledge (علم قطعي) is not one who should be followed, because the *mujtahid* is a legislator, not a follower—except according to our school of thought. For the *mujtahid* only strives to find the evidence for a ruling, not to deduce the ruling from a report through an interpretation (تأويل) where the intended meaning might be otherwise. If such an alternative is possible, then the one who holds that interpretation is not among those who possess insight (بصيرة). Even if he happens upon the truth through interpretation, he receives two rewards by accident, not by intention, for he lacks insight. If he does not happen upon the truth, he receives one reward for seeking the truth, and thus his spiritual portion (حظه) is diminished. This is a hidden Divine Subtle Stratagem (مكر إلهي خفي) against this scholar who engages in interpretation, for he is qualified to call to God with insight (بصيرة) through God’s teaching him, provided he is among the pious (المتقين).\n\nThe general Divine Subtle Stratagem (مكر العموم الإلهي) lies in the succession of blessings following transgressions, and the disappearance of those blessings upon acts of conformity, so that the servant is not guided by them. If the servant is one of the scholars of the general Path, he sees this as a consequence of the strength of the form upon which he was created, and he claims dominance and influence over the Divine ruling concerning the threat of punishment. He believes that the universality of wisdom requires that the Divine Names (الأسماء الإلهية) be given their due. Thus, he sees that the Names *al-Ghaffār* (The Ever-Forgiving) and *al-Ghafūr* (The Forgiving) and their sisters have no effect except in the presence of transgression. If no transgressions occur, some of the Divine Names are not given their due in this world. He argues for himself using God’s saying: <<يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً>> (O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins). And he acts accordingly. Yet, this entire line of reasoning does not occur to him at the time of the transgression; rather, it occurs to him only after the transgression has taken place. If this thought had preceded the transgression, it would have prevented it, for it is a witnessing (شهود), and witnessing prevents him from violating the sanctity of the Sacred Law (الحرمة الشرعية). For this reason, the tradition (الخبر) states: \"When God desires to execute His decree (*qadā’*) and destiny (*qadar*), He strips those with intellects of their intellects, until He has executed His decree and destiny upon them, then He restores their intellects so they may reflect.\"\n\nSome reflect, and some do not, just as He said: <<وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me). Some worship Him, and some associate partners with Him. Thus, the ruling of the cause is not necessarily executed in every effect. If He had left them their intellects, what occurred would not have occurred. Likewise, if the one who witnesses (المشهود له) were present when the transgression against the Divine Names (الأسماء الإلهية) was intended, shame before the Named One would prevent him from violating the sanctity of His address in the abode of obligation. The transgressor resists the Divine Compulsion (القهر الإلهي), and whoever resists the Divine Compulsion perishes. When blessings follow one whose state is this, he imagines that it is due to the strength of his own soul, the effectiveness of his resolve (همته), and God’s special care for him, having granted him a power by which he influences the Severe in Punishment, while remaining oblivious to the Clement (الحليم), the Grantor of Respite (الإمهال), and the fact that He does not neglect (عدم الإهمال). If he did not intend to violate the sanctity by the strength of the ruling of a Divine Name that he possesses, then he is not subjected to the Subtle Stratagem (ممكور به)—such as the common transgressors who act out of heedlessness and feel remorse after the transgression occurs. Therefore, patience regarding the succession of blessings, due to the Divine Subtle Stratagem (المكر الإلهي) concealed within them, is greater than patience regarding misfortunes and afflictions.\n\nFor God says to His servant, \"I was sick, and you did not visit Me.\" Then He said in explanation of that, \"Indeed, so-and-so was sick, and you did not visit him. Had you visited him, you would have found Me with him.\" This is like the desperate thirsty person who, when the mirage reveals the absence of water, turns back to God. In contrast, blessings are the greatest veil (حجاب) from God, except for those whom God grants success.\n\nAs for God’s Subtle Stratagem (مكر الله) against the elite (الخاصة), it is concealed in the persistence of their spiritual state (الحال) despite the bad manners (سوء الأدب) that occur from them. This bad manner is the enjoyment of the state and resting content with it, and the resulting presumption (الإدلال) in the one who possesses it, and the boldness toward God, and the failure to seek transition from it—despite God saying to His Prophet: <<وقُلْ رَبِّ زِدْنِي عِلْماً>> (And say, \"My Lord, increase me in knowledge\"). He only made us hear this as an admonition for us to say it and seek it from God. If it were specific to the Prophet, He would not have made us hear it, or He would have mentioned that it was specific to him, as He did concerning the marriage of donation (نكاح الهبة). For the spiritual state (الحال) has a pleasure and sweetness in the soul, making it difficult for some souls to seek transition from the matter that produced that state. Rather, they seek increase only from that state, ignorant that the spiritual states (الأحوال) are gifts (مواهب).\n\nAs for the Subtle Stratagem (المكر) specific to the elite of the elite (خصوص الخصوص), it lies in the manifestation of Signs (الآيات) and the breaking of customs (خرق العوائد) without command or limit, which is their balance. Since it is obligatory upon the Saints (الأولياء) to conceal them, just as it is obligatory upon the Messengers (الرسل) to manifest them, when the Saint is enabled to perform them and is given the essence of authority (عين التحكيم) in the world, the one subjected to the Subtle Stratagem (الممكور به) seeks to manifest them due to a deficiency in his spiritual portion (نقص حظ) compared to others—the Real (الحق) intends this for him. A desire for the means of manifesting them is placed within them, yet they do not perceive that this is a Divine Subtle Stratagem (مكر إلهي) leading to a deficiency in their portion. The inspiration (الإلهام) occurs in the soul regarding the submission of creation to God Almighty and the rescue of the drowning from the seas of destructive sins, and their removal from familiar habits, through the manifestation of Signs (الآيات) at their hands, and that this is one of the greatest means of calling to God. This is why it was a characteristic of the Prophets and Messengers. He sees himself as one of the inheritors, and that this is part of the inheritance of spiritual states (الأحوال). This veils them from what God has made obligatory upon the Saints: the concealment of these Signs, despite their power over them. It also veils them from what God has made obligatory upon the Messengers: the manifestation of these Signs, because the Messengers are commanded to call to God initially, whereas the Saint is not. The Saint only calls to God by recounting the call of the Messenger and by his tongue, not by a tongue that is newly inspired, as happens to another Messenger. The Sacred Law (الشرع) is established by those who possess knowledge of it.\n\nThe Messenger (الرسول) possesses insight (بصيرة) in calling to God through the prescribed rulings that God has taught him. The Saint (الولي) possesses insight in calling to God by virtue of following (الاتباع), not by virtue of legislation (التشريع). Thus, he does not require a Sign (آية) or a clear proof (بينة). For if he were to say something that contradicts the ruling of the Messenger, he would not be followed in that, nor would he possess insight, and there would be no benefit in manifesting the Sign. This is unlike the Messenger, who initiates legislation and abrogates some law established by another Messenger. Therefore, the manifestation of a Sign and a mark is necessary as proof of his truthfulness, showing that he reports from God the removal of a ruling that God had established through the tongue of another Messenger, thereby announcing the end of the duration of that ruling in that specific matter. Thus, the Saint, despite his particularity, has abandoned an obligation, and he is diminished in his rank by what the adherence to and action upon that obligation would have granted him. Nothing is more harmful to the servant than interpretation (التأويل) in matters. May God grant us insight (بصيرة) concerning our affair and not allow us to exceed what our station (مقامنا) requires. What I ask of God the Exalted is that He grant us the highest station (أعلى مقام) with Him that can be attained by the highest Saint, for the door of Messengership (الرسالة) and Prophethood (النبوة) is closed. It is incumbent upon the scholar not to ask for the impossible. Since the Divine report has closed this door, we should not ask for it. For the one who asks for it is striking cold iron, as this question would not issue from a believer who has truly understood this. It is sufficient for the Saint that God has placed him upon insight (بصيرة) in calling to God in accordance with what the station of Sainthood (الولاية) and following (الاتباع) requires, just as He made the Messenger call to God with insight (بصيرة) in accordance with what the station of Messengership (الرسالة) and legislation (التشريع) requires. May He protect us from His Subtle Stratagem (مكره), not make us among the people of deficiency, and grant us increase and ascent in this world and the Hereafter. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "**باب نمبر دو سو اکتیس: مکر کے بیان میں**\n\nعاقل کو اس کی عقل میں ہی تدریجاً کھینچا جاتا ہے،\nاس جگہ سے جہاں سے مکر کرنے والا (مکر کرنے والے کو) نہیں جانتا۔\nاور اس کا مکر اسی پر لوٹ آتا ہے، مگر یہ بات\nوہ ذہین اور تجربہ کار شخص نہیں جانتا۔\nپس جو شخص اس کے مکر سے امن چاہتا ہے،\nتاکہ باطن اور ظاہر کو حاصل کر لے،\nوہ اپنی شریعت کے میزان (الميزان المشروع) کو محقق کرے،\nتاکہ وہ نفع پانے والے اور نقصان اٹھانے والے کو جان لے۔\n\n**[مکر کا اطلاق مخالفت کے باوجود نعمتوں کے پے در پے آنے پر ہوتا ہے]**\n\nجان لو کہ اہل اللہ (أهل الله) مکر (المكر) کا اطلاق مخالفت کے باوجود نعمتوں کے پے در پے آنے، سوءِ ادب کے باوجود حال (الحال) کے برقرار رہنے، اور کسی حکم یا حد کے بغیر آیات (نشانیاں) کے ظاہر ہونے پر کرتے ہیں۔ اور جان لو کہ ہمارے نزدیک بندے (العبد) کے ساتھ مکر (المكر) یہ ہے کہ بندے کو وہ علم (العلم) عطا کیا جائے جو عمل کا تقاضا کرتا ہو، مگر اسے اس پر عمل (العمل) کرنے سے محروم رکھا جائے۔ اور کبھی اسے عمل (العمل) عطا کیا جاتا ہے، مگر اس میں اخلاص (الإخلاص) سے محروم رکھا جاتا ہے۔ پس جب تم یہ چیز اپنے اندر دیکھو یا کسی اور میں جانو، تو جان لو کہ جو شخص اس صفت سے متصف ہے، اس سے مکر کیا گیا ہے۔\n\nاور میں نے ۶۰۸ھ میں بغداد میں ایک واقعہ (واقعة) دیکھا، جب آسمان کے دروازے کھول دیے گئے اور مکر الٰہی (المكر الإلهي) کے خزانے عام بارش کی طرح نازل ہوئے۔ میں نے ایک فرشتے کو کہتے سنا: \"آج رات مکر میں سے کیا نازل ہوا ہے؟\" تو میں خوفزدہ ہو کر بیدار ہوا اور میں نے اس سے سلامتی کی راہ تلاش کی، تو مجھے وہ شریعت کے میزان (الميزان المشروع) کے علم کے سوا کہیں نہ ملی۔ پس جس کے ساتھ اللہ تعالیٰ بھلائی کا ارادہ کرے اور اسے مکر (المكر) کی آفات سے بچائے، تو وہ شریعت کے میزان (الميزان) کو اپنے ہاتھ سے اور اپنے حال (الحال) کے مشاہدے (شہود) سے دور نہ کرے۔ اور یہ معصوم اور محفوظ شخص کی حالت ہے۔ جہاں تک مخالفت کے باوجود نعمتوں کے پے در پے آنے کا تعلق ہے، تو یہ آج کل اللہ کے راستے سے منسوب ہونے والوں میں بہت زیادہ پایا جاتا ہے۔ اور میں نے ایسے بہت سے لوگوں کو دیکھا ہے جن سے مکر کیا گیا ہے (الممكور بهم)، جن کی تعداد اللہ کے سوا کوئی نہیں جانتا، اور یہ ایک عام معاملہ ہے۔\n\nاور جہاں تک سوءِ ادب کے باوجود حال (الحال) کے برقرار رہنے کا تعلق ہے، تو یہ اصحابِ ہمم (أصحاب الهمم) میں پایا جاتا ہے، اور وہ کم ہیں۔ اگرچہ ہم نے ان میں سے ایک جماعت کو مغرب (اندلس) اور ان علاقوں میں دیکھا ہے۔ وہ یہ ہے کہ وہ ذات حق (الحق) کے ساتھ اس کے آداب سے باہر نکل کر سوءِ ادب کرتے ہیں، اس کے باوجود ان پر وہ حال (الحال) برقرار رہتا ہے جو عالم میں مؤثر ہوتا ہے، یہ اللہ کی طرف سے ان پر مکر (مكراً) ہوتا ہے۔ چنانچہ وہ یہ گمان کرتے ہیں کہ اگر وہ اس میں حق پر نہ ہوتے تو ان کا حال (الحال) بدل جاتا۔ ہم اللہ کے پوشیدہ مکر (مكره الخفي) سے پناہ مانگتے ہیں۔ اللہ تعالیٰ نے فرمایا:\n**سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ وأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ**\n(ہم انہیں تدریجاً کھینچیں گے اس طرح کہ انہیں خبر بھی نہ ہوگی، اور میں انہیں مہلت دوں گا، بے شک میری تدبیر (کید) بڑی مضبوط ہے۔)\nاور فرمایا:\n**ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ**\n(اور ہم نے ایک تدبیر کی، اور انہیں خبر بھی نہ ہوئی۔)\nاور فرمایا:\n**إِنَّهُمْ يَكِيدُونَ كَيْداً وأَكِيدُ كَيْداً**\n(بے شک وہ ایک چال چل رہے ہیں، اور میں بھی ایک چال چل رہا ہوں۔)\n\nاور یہ (کید) افعالِ مقاربہ میں سے ہے، یعنی وہ قریب تھا کہ حق ہو جائے، کیونکہ وہ حق کی صفت میں ظاہر ہوتا ہے۔ پس یہ اس سحر (جادو) کی طرح ہے جو سحر (صبح کا وقت) سے مشتق ہے، جس کا ایک رُخ رات کی طرف ہوتا ہے اور ایک رُخ دن کی طرف۔ چنانچہ جس سے مکر کیا گیا ہو (الممكور به)، اس کے لیے اس کا دن والا رُخ ظاہر ہوتا ہے، تو وہ گمان کرتا ہے کہ یہ حق ہے۔ ہم جہالت سے اللہ کی پناہ مانگتے ہیں۔ اور جان لو کہ مکر الٰہی (المكر الإلهي) کو اللہ تعالیٰ نے خاص طور پر صرف اس شخص سے پوشیدہ رکھا ہے جس سے مکر کیا گیا ہو، نہ کہ اس سے جس سے مکر نہیں کیا گیا۔ اسی لیے فرمایا: **من حَيْثُ لا يَعْلَمُونَ** (اس طرح کہ انہیں خبر بھی نہ ہوگی)، پس ضمیر کو **سَنَسْتَدْرِجُهُمْ** میں موجود ضمیر پر لوٹایا۔ اور فرمایا: **ومَكَرُوا مَكْراً ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ** (اور انہوں نے ایک تدبیر کی اور ہم نے ایک تدبیر کی، اور انہیں خبر بھی نہ ہوئی۔) پس ان کا ضمیر وہی ہے جو **مكروا** میں ہے۔ تو اللہ کا مکر ان لوگوں کے ساتھ بعینہٖ وہی ان کا مکر تھا جس سے وہ متصف تھے، اور **وهُمْ لا يَشْعُرُونَ** (اور انہیں خبر بھی نہ ہوئی)۔ پھر کبھی ان کے ساتھ ان کے مکر سے زائد کسی اور امر کے ذریعے بھی مکر کیا جاتا ہے، کیونکہ اللہ سبحانہ و تعالیٰ نے اسے نکرہ (عام) بھیجا، چنانچہ فرمایا: **ومَكَرْنا مَكْراً** (اور ہم نے ایک تدبیر کی)، تو اس میں ان کا اپنا مکر اور ان کے مکر سے زائد ایک دوسرا مکر بھی شامل ہو گیا۔\n\nاور مکر الٰہی (المكر الإلهي) بعض لوگوں کے حق میں، جن سے مکر کیا گیا ہو، شقاوت (بدبختی) عطا کرتا ہے، اور یہ عام لوگوں میں ہوتا ہے۔ اور کبھی یہ حظ (نصیب) کی کمی عطا کرتا ہے، اور یہ خاص لوگوں اور خاص الخاص لوگوں کے ساتھ مکر ہوتا ہے، ایک الٰہی راز کی وجہ سے، اور وہ یہ ہے کہ کوئی بھی اللہ کے مکر (مكر الله) سے بے خوف نہ ہو، کیونکہ اس بارے میں اللہ تعالیٰ کی طرف سے مذمت وارد ہوئی ہے، جیسا کہ اس کے قول میں ہے:\n**فَلا يَأْمَنُ مَكْرَ الله إِلَّا الْقَوْمُ الْخاسِرُونَ**\n(پس اللہ کے مکر سے صرف نقصان اٹھانے والے لوگ ہی بے خوف ہوتے ہیں۔)\nاور جس نے نقصان اٹھایا، تو **فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ** (تو ان کی تجارت نے کوئی نفع نہ دیا اور وہ ہدایت پانے والے نہ تھے۔)\nپس مکر الٰہی (المكر الإلهي) اور اس کا شدید ترین پردہ تاویل کرنے والوں (المتأولين) میں پوشیدہ ہے، خاص طور پر اگر وہ اہل اجتہاد میں سے ہوں اور ان میں سے ہوں جو یہ عقیدہ رکھتے ہیں کہ ہر مجتہد درست ہے۔\n\nاور ہر وہ شخص جو بصیرت (بصيرة) اور قطعی علم کے ساتھ اللہ کی طرف دعوت نہیں دیتا، وہ پیروکاروں کا مالک نہیں ہے، کیونکہ مجتہد شارع ہوتا ہے، وہ متبع نہیں ہوتا، مگر ہمارے مذہب کے مطابق (وہ متبع ہوتا ہے)۔ کیونکہ مجتہد صرف حکم پر دلیل کی تلاش میں اجتہاد کرتا ہے، نہ کہ خبر سے حکم کو تاویل (تأويل) کے ذریعے اخذ کرنے میں، جس میں یہ ممکن ہو کہ مقصود اس کے خلاف ہو۔ پس جب یہ ممکن ہو، تو اس کا صاحب ان لوگوں میں سے نہیں جو بصیرت (بصيرة) پر ہیں۔ اور اگر وہ تاویل (التأويل) کے ذریعے حق کو پا بھی لے، تو وہ اتفاقاً دو اجر کا مستحق ہوا، نہ کہ قصد کے حکم سے، کیونکہ وہ بصیرت (بصيرة) پر نہیں ہے۔ اور اگر وہ حق کو نہ پا سکا، تو اسے حق کی تلاش کا ایک اجر ملا، پس اس کا حظ (نصیب) کم ہو گیا۔ پس یہ اس تاویل کرنے والے عالم کے ساتھ ایک پوشیدہ مکر الٰہی (مكر إلهي خفي) ہے، کیونکہ وہ اس بات کا اہل ہے کہ اگر وہ متقیوں میں سے ہو تو اللہ کے سکھانے سے بصیرت (بصيرة) کے ساتھ اللہ کی طرف دعوت دے۔\n\nپس عام لوگوں کے ساتھ مکر الٰہی (مكر العموم الإلهي) مخالفتوں کے بعد نعمتوں کے پے در پے آنے اور موافقتوں کے وقت ان کے زائل ہو جانے میں ہے، چنانچہ وہ ان سے عبرت حاصل نہیں کرتے۔ اگر وہ عام طریق کے علماء میں سے ہو، تو وہ یہ سمجھتا ہے کہ یہ اس صورت کی قوت کا حکم ہے جس پر وہ پیدا کیا گیا ہے، چنانچہ وہ وعید کے ساتھ الٰہی حکم میں قہر اور تاثیر کا دعویٰ کرتا ہے۔ اور وہ یہ سمجھتا ہے کہ حکمت کا عموم یہ ہے کہ الٰہی اسماء (الأسماء الإلهية) کو ان کا حق دیا جائے، چنانچہ وہ دیکھتا ہے کہ اسم الغفار (الغفار) اور الغفور (الغفور) اور ان کے ہم معنی اسماء کا حکم صرف مخالفت کی صورت میں ہی ہے، پس اگر اس سے مخالفتیں سرزد نہ ہوں تو اس دنیا میں بعض الٰہی اسماء (الأسماء الإلهية) کو ان کا حق نہیں دیا جائے گا۔ اور وہ اپنے لیے اللہ کے اس قول سے دلیل پکڑتا ہے:\n**يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً**\n(اے میرے بندو جنہوں نے اپنی جانوں پر زیادتی کی ہے، اللہ کی رحمت سے مایوس نہ ہو، بے شک اللہ تمام گناہوں کو بخش دیتا ہے۔)\nاور وہ ایسا ہی کرتا ہے۔ اور یہ سارا خیال اسے مخالفت کے وقت نہیں آتا، بلکہ یہ خیال اسے مخالفت کے واقع ہونے کے بعد آتا ہے۔ اگر یہ خیال مخالفت سے پہلے آ جاتا تو وہ اسے مخالفت سے روک دیتا، کیونکہ یہ شہود (الشهود) ہے، اور شہود (الشهود) اسے شرعی حرمت کو پامال کرنے سے روکتا ہے۔ اور اسی لیے یہ خبر وارد ہوئی ہے:\n\n**جب اللہ تعالیٰ اپنے قضا و قدر کو نافذ کرنے کا ارادہ کرتا ہے، تو وہ عقل والوں کی عقلیں سلب کر لیتا ہے، یہاں تک کہ جب ان میں اپنا قضا و قدر نافذ کر دیتا ہے، تو انہیں ان کی عقلیں لوٹا دیتا ہے تاکہ وہ عبرت حاصل کریں۔**\n\nپس ان میں سے کچھ عبرت حاصل کرتے ہیں اور کچھ عبرت حاصل نہیں کرتے، جیسا کہ فرمایا:\n**وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ**\n(اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا۔)\nپس ان میں سے کچھ نے اس کی عبادت کی اور کچھ نے اس کے ساتھ شرک کیا۔ پس یہ ضروری نہیں کہ علت کا حکم ہر معلول میں نافذ ہو۔ اگر اللہ ان کی عقلیں برقرار رکھتا تو ان سے وہ واقع نہ ہوتا جو واقع ہوا۔ اسی طرح اگر الٰہی اسماء (الأسماء الإلهية) کی مخالفت کے ارادے کے وقت مشہود (المشهود) شخص موجود ہوتا، تو مسمّٰی (جس کا نام لیا گیا ہے) سے حیا اسے اس کے دارِ تکلیف میں اس کے خطاب کی حرمت کو پامال کرنے سے روکتی۔ پس مخالفت کرنے والا قہر الٰہی (القهر الإلهي) کا مقابلہ کرتا ہے، اور جو قہر الٰہی (القهر الإلهي) کا مقابلہ کرتا ہے وہ ہلاک ہو جاتا ہے۔ پس جب اس حالت والے شخص پر نعمتیں پے در پے آتی ہیں، تو وہ گمان کرتا ہے کہ یہ اس کی اپنی قوت، اس کی ہمت کے نفوذ، اور اللہ کی اس پر عنایت کی وجہ سے ہے، کہ اللہ نے اسے ایسی قوت عطا کی جس سے اس نے شدید العقاب (سخت سزا دینے والے) میں تاثیر پیدا کی، اور وہ حلیم (بردبار) اور مہلت دینے والے اور نظر انداز نہ کرنے والے سے غافل ہو گیا۔ پس اگر اس نے کسی الٰہی اسم (اسم إلهي) کے حکم کی قوت کی وجہ سے حرمت کو پامال کرنے کا قصد نہ کیا ہو، تو اس سے مکر نہیں کیا گیا، جیسے عام گناہگار جو غفلت کی وجہ سے گناہ کرتے ہیں اور مخالفت کے واقع ہونے کے بعد نادم ہوتے ہیں۔ پس نعمتوں کے پے در پے آنے پر صبر کرنا، کیونکہ ان کے اندر مکر الٰہی (المكر الإلهي) پوشیدہ ہوتا ہے، مصیبتوں اور بلاؤں پر صبر کرنے سے زیادہ عظیم ہے۔\n\nکیونکہ اللہ تعالیٰ اپنے بندے سے فرماتا ہے: \"میں بیمار ہوا تو تو نے میری عیادت نہیں کی۔\" پھر اس کی تفسیر میں فرمایا:\n**\"خبردار! فلاں بیمار ہوا تو تو نے اس کی عیادت نہیں کی، اگر تو اس کی عیادت کرتا تو مجھے اس کے پاس پاتا۔\"**\nجیسا کہ پیاسا اور مضطر شخص اس وقت اللہ کو پاتا ہے جب سراب اس کے لیے پانی کی عدم موجودگی کو ظاہر کر دیتا ہے، تو وہ اللہ کی طرف رجوع کرتا ہے۔ اس کے برعکس نعمتیں ہیں، کیونکہ وہ اللہ سے سب سے بڑا حجاب ہیں، سوائے اس کے جسے اللہ توفیق دے۔\n\nاور جہاں تک خاص لوگوں کے ساتھ اللہ کے مکر (مكر الله) کا تعلق ہے، تو وہ ان کے سوءِ ادب کے باوجود حال (الحال) کے ان پر برقرار رہنے میں پوشیدہ ہے، اور وہ حال (الحال) سے لذت حاصل کرنا، اس پر ٹھہر جانا، اور جو شخص اس حال (الحال) پر قائم ہو اس میں جو ناز و غرور پیدا ہوتا ہے، اور اللہ پر ہجوم کرنا (بے باکی)، اور اس حال (الحال) سے منتقل ہونے کی طلب نہ کرنا ہے۔ حالانکہ اللہ نے اپنے نبی سے فرمایا:\n**وقُلْ رَبِّ زِدْنِي عِلْماً**\n(اور کہو: اے میرے رب! مجھے علم میں اور زیادہ کر۔)\nاور اللہ نے ہمیں یہ بات نہیں سنائی مگر اس لیے کہ ہم بھی یہ کہیں اور اللہ سے اس کا مطالبہ کریں۔ اگر یہ صرف نبی کے لیے خاص ہوتا تو وہ ہمیں نہ سناتا، یا یہ ذکر کرتا کہ یہ ان کے لیے خاص ہے، جیسا کہ نکاحِ ہبہ (بغیر مہر کے نکاح) کے بارے میں فرمایا۔\n\nپس حال (الحال) میں نفس کے لیے ایک لذت اور مٹھاس ہوتی ہے، جس کی وجہ سے بعض نفوس کے لیے اس امر سے منتقل ہونے کی طلب مشکل ہو جاتی ہے جس نے انہیں وہ حال (الحال) عطا کیا ہے۔ بلکہ وہ مزید کا مطالبہ بھی اسی سے کرتے ہیں، اور وہ اس بات سے غافل رہتے ہیں کہ احوال (الأحوال) عطیات ہیں۔\nاور جہاں تک خصوص الخصوص میں مکر (المكر) کا تعلق ہے، تو وہ آیات (نشانیاں) اور خرقِ عادات (عادتوں کو توڑنا) کو بغیر کسی حکم یا حد کے ظاہر کرنے میں ہے، جو کہ ان کا میزان ہے۔ چونکہ اولیاء (الأولياء) پر ان کا چھپانا واجب ہے، جیسا کہ رسولوں (الرسل) پر ان کا ظاہر کرنا واجب ہے، جب ولی (الولي) کو ان پر قدرت دی جاتی ہے اور اسے عالم میں تحکیم (حکم چلانے) کا اختیار دیا جاتا ہے، تو جس سے مکر کیا گیا ہو (الممكور به)، وہ اپنے حظ (نصیب) کی کمی کی وجہ سے دوسروں کے درجے سے کم ہو کر، ان کے اظہار کا طریقہ طلب کرتا ہے، ذات حق (الحق) اس کے ساتھ یہی چاہتا ہے۔ اور ان میں ان کے اظہار کے طریقے کی طلب پیدا کر دی جاتی ہے، اس طرح کہ انہیں شعور نہیں ہوتا کہ یہ مکر الٰہی (مكر إلهي) ہے جو حظ (نصیب) کی کمی کا باعث بنتا ہے۔ پس نفس میں یہ الہام (الإلهام) واقع ہوتا ہے کہ ان کے ہاتھوں پر آیات (آیات) کے ظاہر ہونے میں مخلوق کا اللہ عزوجل کی طرف جھکاؤ ہے، اور ہلاک کرنے والے گناہوں کے سمندروں میں ڈوبنے والوں کو بچانا ہے، اور انہیں مانوس چیزوں سے دور کرنا ہے، اور یہ سب سے بڑی چیز ہے جس کے ذریعے اللہ کی طرف دعوت دی جاتی ہے۔ اور اسی لیے یہ انبیاء اور رسولوں (الأنبياء والرسل) کی صفت تھی۔\n\nاور وہ اپنے نفس میں دیکھتا ہے کہ وہ وارثوں میں سے ہے اور یہ احوال (الأحوال) کی وراثت میں سے ہے۔ پس یہ چیز انہیں اس سے حجاب میں ڈال دیتی ہے جو اللہ نے اولیاء (الأولياء) پر ان آیات (آیات) کو چھپانے کے بارے میں واجب کیا ہے، باوجود اس کے کہ وہ ان پر قادر ہوتے ہیں، اور وہ اس سے غافل ہو جاتے ہیں جو اللہ نے رسولوں (الرسل) پر ان کے ظاہر کرنے کے بارے میں واجب کیا ہے، کیونکہ رسولوں کو ابتداءً اللہ کی طرف دعوت دینے کا حکم دیا گیا ہے، جبکہ ولی (الولي) ایسا نہیں ہے۔ ولی (الولي) تو رسول (الرسول) کی دعوت اور اس کی زبان کی حکایت کے ذریعے اللہ کی طرف دعوت دیتا ہے، نہ کہ کسی ایسی زبان سے جو اسے نئی عطا کی جائے جیسا کہ کسی دوسرے رسول کو عطا کی جاتی ہے۔ اور شریعت (الشرع) اس کے علماء کی طرف سے مقرر ہے۔ پس رسول (الرسول) اللہ کی طرف دعوت دینے میں بصیرت (بصيرة) پر ہوتا ہے، اس کے ذریعے جو اللہ نے اسے مشروع احکام کے بارے میں بتایا ہے۔ اور ولی (الولي) اللہ کی طرف دعوت دینے میں اتباع کے حکم سے بصیرت (بصيرة) پر ہوتا ہے، نہ کہ تشریع (قانون سازی) کے حکم سے۔ پس اسے کسی آیت (نشان) یا دلیل کی ضرورت نہیں ہوتی۔ کیونکہ اگر وہ کوئی ایسی بات کہے جو رسول (الرسول) کے حکم کے خلاف ہو، تو اس میں اس کی پیروی نہیں کی جائے گی اور نہ ہی وہ بصیرت (بصيرة) پر ہوگا۔ پس آیت (آية) کے ظاہر کرنے کا کوئی فائدہ نہیں، بخلاف رسول (الرسول) کے، کیونکہ وہ تشریع (قانون سازی) کا آغاز کرتا ہے اور دوسرے رسولوں کے ہاتھ سے مقرر کردہ بعض شریعت کو منسوخ کرتا ہے۔ پس اس کے لیے ضروری ہے کہ وہ کوئی آیت (آية) اور علامت ظاہر کرے جو اس کی سچائی پر دلیل ہو کہ وہ اللہ کی طرف سے خبر دے رہا ہے، اور یہ کہ اللہ نے جو حکم کسی دوسرے رسول کی زبان پر مقرر کیا تھا، اسے ختم کر رہا ہے، اس مسئلے میں حکم کی مدت کے اختتام کا اعلان کرتے ہوئے۔ پس ولی (الولي)، اپنی خصوصیت کے باوجود، ایک واجب کو ترک کر چکا ہوتا ہے، تو اس کے مرتبے میں اتنی کمی ہو جاتی ہے جتنا اس واجب پر ٹھہرنے اور اس پر عمل کرنے سے اسے ملتا۔\n\nپس بندے کے لیے چیزوں میں تاویل (التأويل) کرنے سے زیادہ نقصان دہ کوئی چیز نہیں ہے۔ پس اللہ ہمیں ہمارے معاملے میں بصیرت (بصيرة) پر رکھے اور ہمیں ہمارے مقام کے تقاضے سے تجاوز نہ کرنے دے۔ اور میں اللہ تعالیٰ سے سوال کرتا ہوں کہ وہ ہمیں اپنے ہاں سب سے اعلیٰ مقام عطا کرے جو کسی اعلیٰ ولی (الولي) کے لیے ہو، کیونکہ رسالت اور نبوت کا دروازہ بند ہو چکا ہے۔ اور عالم کے لیے مناسب ہے کہ وہ محال (ناممکن) چیز کا سوال نہ کرے، اور الٰہی خبر کے بعد یہ دروازہ بند ہو چکا ہے، لہٰذا ہمیں اس کے بارے میں سوال نہیں کرنا چاہیے۔ کیونکہ اس کے بارے میں سوال کرنے والا ٹھنڈے لوہے پر چوٹ مارتا ہے، اس لیے کہ یہ سوال کسی ایسے مومن سے سرزد نہیں ہوتا جو اس حقیقت کو جانتا ہو۔ اور ولی (الولي) کے لیے اللہ کی طرف سے یہ کافی ہے کہ اس نے اسے ولایت اور اتباع کے مقام کے تقاضے کے مطابق اللہ کی طرف دعوت دینے میں بصیرت (بصيرة) پر رکھا، جیسا کہ رسول (الرسول) کو رسالت اور تشریع کے مقام کے تقاضے کے مطابق اللہ کی طرف بصیرت (بصيرة) پر دعوت دینے والا بنایا۔ اور وہ ہمیں اپنے مکر (مكره) سے محفوظ رکھے اور ہمیں اہل نقص میں سے نہ بنائے، اور ہمیں مزید اور ترقی عطا فرمائے دنیا و آخرت میں۔ اور **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب دویست و سی و یکم در مکر\n\nخردمند در عقل خویش به تدریج گرفتار می‌شود / از آنجا که مکرکننده (ماکر) آن را نمی‌داند.\nو مکرش به خودش باز می‌گردد / و آن زیرک آگاه این را نمی‌داند.\nپس هر که امنیت از مکر او را بخواهد / تا باطن و ظاهر را به دست آورد،\nباید میزان شرعش را محقق سازد / تا سودبرنده و زیانکار را بشناسد.\n\n### [اینکه مکر را بر پی در پی آمدن نعمت‌ها همراه با مخالفت اطلاق می‌کند]\n\nبدان که اهل الله (أهل الله) مکر را بر پی در پی آمدن نعمت‌ها همراه با مخالفت، و باقی ماندن حال (حال) با وجود سوء ادب، و آشکار شدن آیات (آیات) بدون امر و حد، اطلاق می‌کنند. و بدان که از مکر (المكر) نزد ما بر بنده این است که به او علمی روزی شود که عمل را می‌طلبد، اما از عمل به آن محروم گردد. و گاهی عمل روزی می‌شود، اما از اخلاص در آن محروم می‌گردد. پس اگر این را در خود دیدی یا از دیگری دانستی، بدان که متصف به آن، ممکور به (الممكور به) است.\n\nو به راستی در واقعه‌ای (واقعة) دیدم، در حالی که در بغداد بودم در سال ششصد و هشت هجری، که درهای آسمان گشوده شد و خزانه‌های مکر الهی (المكر الإلهي) مانند باران عمومی فرود آمد. و شنیدم که فرشته‌ای می‌گفت: امشب چه چیزی از مکر نازل شد؟ پس هراسان بیدار شدم و به دنبال راه نجات از آن گشتم، و آن را نیافتم مگر در علم به میزان شرعی (الميزان المشروع). پس هر که خداوند برای او خیری بخواهد و او را از آفات مکر حفظ کند، میزان شرع و شهود (شهود) حالش را از دست ننهد. و این حال معصوم و محفوظ است.\n\nاما پی در پی آمدن نعمت‌ها همراه با مخالفت، امروز در میان کسانی که خود را به راه حق منتسب می‌کنند، بسیار است. و من بسیاری از ممکور بهان را دیده‌ام که تعدادشان را جز خداوند نمی‌داند، و این امری عمومی است. اما باقی ماندن حال با سوء ادب، در میان صاحبان همت (أصحاب الهمم) است، و آنان اندک‌اند. با این حال، ما گروهی از آنان را در مغرب و این سرزمین‌ها دیده‌ایم. و آن این است که با خروج از مراسم حق، سوء ادب می‌ورزند، در حالی که حال مؤثر در عالم بر ایشان باقی می‌ماند، که این مکر از جانب خداوند است. پس گمان می‌کنند که اگر بر حق نبودند، حالشان تغییر می‌کرد. پناه می‌بریم به خدا از مکر پنهان او.\n\nخداوند متعال می‌فرماید: «به زودی آنان را از جایی که نمی‌دانند، به تدریج گرفتار خواهیم کرد و به آنان مهلت می‌دهم؛ زیرا مکر من استوار است.» (سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ وأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ) و فرمود: «و مکر کردیم، مکری، در حالی که آنان درک نمی‌کردند.» (ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ) و فرمود: «آنان مکر می‌ورزند، مکری، و من نیز مکر می‌ورزم، مکری.» (إِنَّهُمْ يَكِيدُونَ كَيْداً وأَكِيدُ كَيْداً)\n\nو این از «کاد» است که از افعال مقاربه (أفعال المقاربة) است؛ یعنی نزدیک بود که حق باشد، به دلیل ظهورش در صفت حق. پس مانند سحر (السحر) است که از سحر (سحر) مشتق شده، که یک روی آن به شب و روی دیگرش به روز است. پس روی روز آن برای ممکور به (الممكور به) آشکار می‌شود و گمان می‌کند که آن حق است. پناه می‌بریم به خدا از جهل.\n\nو بدان که مکر الهی (المكر الإلهي) را خداوند فقط از ممکور به پنهان داشته است، نه از غیر ممکور به. و به همین دلیل فرمود: «از جایی که نمی‌دانند» (من حَيْثُ لا يَعْلَمُونَ)، پس ضمیر را به ضمیر مستتر در «به تدریج گرفتار خواهیم کرد» (سَنَسْتَدْرِجُهُمْ) بازگرداند. و فرمود: «و مکر کردند، مکری، و ما مکر کردیم، مکری، در حالی که آنان درک نمی‌کردند.» (ومَكَرُوا مَكْراً ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ) پس ضمیر مستتر در «درک نمی‌کردند» همان ضمیر مستتر در «مکر کردند» است. بنابراین، مکر خداوند بر اینان، عین مکر خودشان بود که بدان متصف شدند، در حالی که «درک نمی‌کردند» (وهُمْ لا يَشْعُرُونَ).\n\nسپس ممکن است با امری افزون بر مکرشان بر آنان مکر ورزد، زیرا خداوند آن را نکره (نكرة) فرستاد و فرمود: «و مکر کردیم، مکری» (ومَكَرْنا مَكْراً). پس عین مکرشان و مکر دیگری افزون بر مکرشان در آن داخل شد. و مکر الهی (المكر الإلهي) ممکن است در حق برخی از ممکور بهان، شقاوت (الشقاء) را به بار آورد، و این در عموم مردم است. و ممکن است نقصان بهره (نقصان الحظ) را به بار آورد، و این مکر بر خاصه و خاصه الخاصه است، به خاطر یک سرّ الهی (سرّ إلهي)؛ و آن این است که هیچ کس از مکر خداوند ایمن نباشد، به دلیل مذمتی که در این باره آمده است در قول او: «پس از مکر خدا ایمن نمی‌شوند مگر قوم زیانکاران.» (فَلا يَأْمَنُ مَكْرَ الله إِلَّا الْقَوْمُ الْخاسِرُونَ) و هر که زیان کند، «تجارتشان سودی نکرد و هدایت‌یافته نبودند.» (فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ)\n\nپس مکر الهی (المكر الإلهي) و شدیدترین پوشش آن، در تأویل‌کنندگان (المتأولين) پنهان است، به ویژه اگر از اهل اجتهاد باشند و از کسانی که معتقدند هر مجتهدی مصیب است. و هر کس که «بر بصیرت» (عَلى‏ بَصِيرَةٍ) و علم قطعی به سوی خداوند دعوت نکند، صاحب پیروانی نیست؛ زیرا مجتهد قانون‌گذار است، نه پیرو، مگر بر مذهب ما. زیرا مجتهد تنها در طلب دلیل بر حکم اجتهاد می‌کند، نه در استنباط حکم از خبر با تأویلی که ممکن است مقصود خلاف آن باشد. پس اگر چنین امکانی وجود داشته باشد، صاحب آن از کسانی نیست که بر بصیرت‌اند. و اگر با تأویل به حق برسد، به حکم اتفاق صاحب دو پاداش است، نه به حکم قصد؛ زیرا بر بصیرت نیست. و اگر به حق نرسد، پاداش طلب حق را دارد، پس بهره‌اش ناقص شده است. این مکر الهی پنهانی است بر این عالم تأویل‌کننده؛ زیرا او از شایستگان است که به تعلیم خداوند، اگر از پرهیزگاران باشد، «بر بصیرت» (عَلى‏ بَصِيرَةٍ) به سوی خداوند دعوت کند.\n\nپس مکر عمومی الهی (مكر العموم الإلهي) در پی در پی آمدن نعمت‌ها به دنبال مخالفت‌ها و زوال آن‌ها هنگام موافقت‌هاست، پس به آن گرفته نمی‌شود. اگر از علمای عامه راه باشد، می‌بیند که این از حکم قوت صورتی است که بر آن خلق شده است، پس ادعای قهر و تأثیر در حکم الهی با وعید می‌کند. و می‌بیند که عموم حکمت این است که به اسماء الهی (الأسماء الإلهية) حقشان داده شود. پس می‌بیند که اسم غفار (الغفار) و غفور (الغفور) و خواهرانش حکمی ندارند مگر در مخالفت. پس اگر مخالفت‌هایی از او سر نزند، حق برخی از اسماء الهی در این دنیا داده نمی‌شود. و برای خود به قول خداوند احتجاج می‌کند: «ای بندگان من که بر خود اسراف کرده‌اید، از رحمت خدا ناامید نشوید، همانا خداوند همه گناهان را می‌آمرزد.» (يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً) و چنین می‌کند. و این نظر تماماً هنگام مخالفت به خاطرش خطور نمی‌کند، بلکه این امر تنها پس از وقوع مخالفت به خاطرش می‌آید. اگر این خاطر پیش از آن می‌آمد، او را از مخالفت باز می‌داشت؛ زیرا این شهود (شهود) است، و شهود او را از هتک حرمت شرعی باز می‌دارد.\n\nخبر وارد شده است: «هرگاه خداوند بخواهد قضا و قدر خود را جاری سازد، عقل صاحبان عقل را از ایشان سلب می‌کند، تا زمانی که قضا و قدر خود را در مورد آنان اجرا کند، سپس آن را به ایشان باز می‌گرداند تا عبرت گیرند.»\n\nپس برخی عبرت می‌گیرند و برخی عبرت نمی‌گیرند، چنانکه فرمود: «و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند.» (وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ) پس برخی او را پرستیدند و برخی شرک ورزیدند. پس لازم نیست که حکم علت در هر معلولی نافذ شود. اگر عقلشان را بر ایشان باقی می‌گذاشت، آنچه واقع شد، واقع نمی‌شد. همچنین اگر کسی که شهود دارد، هنگام اراده وقوع مخالفت با اسماء الهی، شهودش حاضر بود، حیا از مسمّی (خداوند) او را از هتک حرمت خطاب او در دار تکلیفش باز می‌داشت. پس مخالف در برابر قهر الهی مقاومت می‌کند، و هر که در برابر قهر الهی مقاومت کند، هلاک می‌شود. پس هنگامی که نعمت‌ها بر کسی که حالش چنین است پی در پی می‌آید، گمان می‌کند که این به قوت نفس او و نفوذ همت او و عنایت خداوند به اوست، زیرا به او چنان قدرتی روزی کرده که در شدید العقاب تأثیر گذاشته است، و از حلیم و از مهلت دادن و عدم اهمال غافل مانده است.\n\nپس اگر قصد هتک حرمت به واسطه قوت آنچه بر آن است از حکم اسم الهی نداشته باشد، ممکور به نیست؛ مانند گناهکاران عامه از روی غفلت و پشیمانی پس از وقوع مخالفت. پس صبر بر پی در پی آمدن نعمت‌ها، به دلیل مکر الهی که در لایه‌های آن نهفته است، بزرگتر از صبر بر مصیبت‌ها و بلاهاست.\n\nزیرا خداوند به بنده‌اش می‌گوید: «بیمار شدم و مرا عیادت نکردی.» سپس در تفسیر آن فرمود: «آگاه باش که فلان بیمار شد و او را عیادت نکردی، اگر او را عیادت می‌کردی، مرا نزد او می‌یافتی.»\n\nهمان‌گونه که تشنه مضطر، هنگامی که سراب برایش از نبود آب پرده برمی‌دارد، او را می‌یابد و به سوی خداوند باز می‌گردد. بر خلاف نعمت‌ها، که بزرگترین حجاب از خداوند هستند، مگر برای کسی که خداوند او را توفیق دهد.\n\nاما مکر خداوند بر خاصه (الخاصة) در باقی ماندن حال بر اوست با وجود سوء ادبی که از او سر می‌زند، و آن عبارت است از لذت بردن از حال (التلذذ بالحال) و توقف در آن، و آنچه از ناز و دلبری (الإدلال) در کسی که به آن قیام کرده است، به ارث می‌گذارد، و هجوم بر خداوند و عدم طلب انتقال از آن.\n\nو آیا خداوند به پیامبرش نفرمود: «و بگو: پروردگارا، علم مرا زیاد کن.» (وقُلْ رَبِّ زِدْنِي عِلْماً) و این را به ما نشنواند مگر برای تنبیه تا ما نیز این را بگوییم و از خداوند طلب کنیم. و اگر مخصوص پیامبر بود، به ما نمی‌شنواند یا ذکر می‌کرد که مخصوص اوست، چنانکه در نکاح هبه فرمود. پس حال (حال) لذت و شیرینی در نفس دارد که طلب انتقال از امری که آن حال را به ارث گذاشته است، بر برخی نفوس دشوار است، بلکه جز از همان حال، طلب افزونی نمی‌کند. و ندانسته است که احوال (الأحوال) موهبت‌هایی هستند.\n\nاما مکری که در خصوص الخصوص (خصوص الخصوص) است، در آشکار کردن آیات (الآيات) و خرق عادات (خرق العوائد) بدون امر و حدّی است که میزان آن است. زیرا همان‌گونه که بر رسولان واجب بود که آن‌ها را آشکار کنند، بر اولیا واجب بود که آن‌ها را بپوشانند. هنگامی که ولی بر آن قادر می‌شود و عین تحکیم در عالم به او داده می‌شود، ممکور به به دلیل نقصان بهره‌ای از درجه غیر خود، طلب می‌کند که حق این را از او می‌خواهد، و در ایشان طلبی برای راه آشکار کردن آن‌ها قرار داده است، از آنجا که درک نمی‌کند که این مکر الهی (مكر إلهي) است که به نقصان بهره می‌انجامد. پس الهام در نفس واقع می‌شود به آنچه در آشکار کردن آیات بر دست ایشان از انقیاد خلق به سوی خداوند عز و جل و نجات غرق‌شدگان از دریاهای گناهان هلاک‌کننده و بازداشتن آنان از مألوفات است، و اینکه این از بزرگترین وسایلی است که با آن به سوی خداوند دعوت می‌شود.\n\nو به همین دلیل این از نعت انبیا و رسولان بود. و در نفس خود می‌بیند که از وارثان است و این از میراث احوال است. پس این امر آنان را از آنچه خداوند بر اولیا واجب کرده است، یعنی پوشاندن این آیات با وجود قدرت بر آن‌ها، محجوب می‌سازد، و از آنچه خداوند بر رسولان واجب کرده است، یعنی آشکار کردن آن‌ها، غافل می‌سازد؛ زیرا رسولان مأمور به دعوت به سوی خداوند از ابتدا هستند، در حالی که ولی چنین نیست. ولی به سوی خداوند با حکایت دعوت رسول و زبان او دعوت می‌کند، نه با زبانی که برای او حادث شود، چنانکه برای رسول دیگری حادث می‌شود. و شرع از نزد علمای به آن مقرر شده است. پس رسول بر بصیرت (بصيرة) در دعوت به سوی خداوند است به آنچه خداوند از احکام مشروع به او آموخته است، و ولی بر بصیرت در دعوت به سوی خداوند به حکم تبعیت است، نه به حکم تشریع. پس نیازی به آیه و بینه ندارد. زیرا اگر چیزی بگوید که مخالف حکم رسول باشد، در آن تبعیت نمی‌شود و بر بصیرت نیست. پس فایده‌ای در آشکار کردن آیه نیست. بر خلاف رسول، که تشریع را ایجاد می‌کند و برخی از شرع مقرر شده بر دست رسول دیگری را نسخ می‌کند. پس ناگزیر از آشکار کردن آیه و علامتی است که دلیلی بر صدق او باشد که از جانب خداوند خبر می‌دهد، برای از بین بردن حکمی که خداوند بر زبان رسول دیگری مقرر کرده بود، به عنوان اعلامی بر پایان مدت حکم در آن مسئله. پس ولی با وجود خصوصیتش، واجبی را ترک کرده است، و به همان اندازه که توقف در آن واجب و عمل به آن به او می‌بخشید، از مرتبه‌اش کاسته شده است. پس هیچ چیز برای بنده زیان‌بارتر از تأویل در امور نیست.\n\nپس خداوند ما را بر بصیرت (بصيرة) از امرمان قرار دهد و ما را از آنچه مقاممان اقتضا می‌کند، فراتر نبرد. و آنچه از خداوند متعال می‌خواهم این است که بالاترین مقامی را که نزد او برای بالاترین ولی است، به ما روزی کند؛ زیرا باب رسالت و نبوت مغلق است. و شایسته است که عالم در امر محال سؤال نکند. و پس از اخبار الهی مبنی بر بسته شدن این باب، شایسته نیست که در آن سؤال کنیم؛ زیرا سؤال‌کننده در آن، آهن سرد می‌کوبد، چرا که این سؤال اصلاً از مؤمنی که این را دانسته باشد، صادر نمی‌شود. و برای ولی از جانب خداوند کافی است که او را بر بصیرت (بصيرة) در دعوت به سوی خداوند متعال قرار داده است، از آن حیث که مقام ولایت و تبعیت اقتضا می‌کند، همان‌گونه که رسول را بر بصیرت (بصيرة) در دعوت به سوی خداوند قرار داده است، از آن حیث که مقام رسالت و تشریع اقتضا می‌کند. و ما را از مکر خود حفظ کند و ما را از اهل نقصان قرار ندهد و روزی ما را افزونی و ترقی در دنیا و آخرت قرار دهد. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)"
  },
  "page_count": 3
}