{
  "id": 550,
  "title": {
    "ar": "الباب الموفي خمسين وخمسمائة في معرفة حال قطب كان منزله فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا الآية",
    "en": "Chapter 550: Concerning the Knowledge of the State (حال) of a Pole (قطب) Whose Station (منزله) Was [Defined by] <<But when his Lord disclosed Himself (تجلى) to the mountain, He made it crumble to dust (دكًّا)>> (The Verse).",
    "ur": "باب نمبر پانچ سو پچاس: ایک قطب (Qutb) کے حال کی معرفت (Ma'rifa) کے بیان میں، جس کا منزل یہ تھا: \"پھر جب اس کے رب نے پہاڑ پر اپنا ظہور الٰہی (التجلی) فرمایا تو اسے ریزہ ریزہ کر دیا\" (الآیۃ) (فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا الآية)",
    "fa": "باب پانصد و پنجاه در شناخت حال قطبی که منزلگاهش این بود: «فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا» (و چون پروردگارش بر کوه تجلی کرد، آن را درهم کوبید) [الأعراف: ۱۴۳]."
  },
  "content": {
    "ar": "## «الباب الموفي خمسين وخمسمائة في معرفة حال قطب كان منزله فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا الآية»\n\n\n> إذا تجلى لمن تجلى *** أصعقه ذلك التجلي‏\n\n\n> وإن تولى عمن تولى *** أهلكه ذلك التولي‏\n\n\n> وإن تدلى بمن تدلى *** نوره ذلك التدلي‏\n\n\n> قلت الذي قد سمعتموه *** بالله يا سيدي فقل لي‏\n\n\n> لما رأيت الذي تجلى *** أشهدني فيه عين ظلي‏\n\n\n> من لي إذا لم أكن سواه *** وليس عيني قل لي فمن لي‏\n\n\n> الله لا ظاهر سواه *** في كل ضد وكل مثل‏\n\n\n> وكل جنس وكل نوع *** وكل وصل وكل فصل‏\n\n\n> وكل حس وكل عقل *** وكل جسم وكل شكل‏\n\n\n### [أن الأمر في التجلي قد يكون بخلاف الحكمة]\n\n\nاعلم أيدنا الله وإياك أن الأمر في التجلي قد يكون بخلاف ترتيب الحكمة التي عهدت وذلك إنا قد بينا استعداد القوابل وأن هناك ليس منع بل فيض دائم وعطاء غير محظور فلو لم يكن المتجلي له على استعداد أظهر له ذلك الاستعداد هذا المسمى تجليا ما صح أن يكون له هذا التجلي فكان ينبغي له أن لا يقوم به دك ولا صعق هذا قول المعترض علينا قلنا له يا هذا الذي قلناه من الاستعداد نحن على ذلك الحق متجل دائما والقابل لإدراك هذا التجلي لا يكون إلا باستعداد خاص وقد صح له ذلك الاستعداد فوقع التجلي في حقه فلا يخلو أن يكون له أيضا استعداد البقاء عند التجلي أو لا يكون له ذلك فإن كان له ذلك فلا بد أن يبقى وإن لم يكن له فكان له استعداد قبول التجلي ولم يكن له استعداد البقاء ولا يصح أن يكون له فإنه لا بد من اندكاك أو صعق أو فناء أو غيبة أو غشية فإنه لا يبقى له مع الشهود غير ما شهد فلا تطمع في غير مطمع وقد قال بعضهم شهود الحق فناء ما فيه لذة لا في الدنيا ولا في الآخرة فليس التفاضل ولا الفضل في التجلي وإنما التفاضل والفضل فيما يعطي الله لهذا المتجلي له من‏\nالاستعداد وعين حصول التجلي عين حصول العلم لا يعقل بينهما بون كوجه الدليل في الدليل سواء بل هذا أتم وأسرع في الحكم وأما التجلي الذي يكون معه البقاء والعقل وإلا لالتذاذ والخطاب والقبول فذلك التجلي الصوري ومن لم ير غيره ربما حكم على التجلي بذلك مطلقا من غير تقييد والذي ذاق الأمرين فرق ولا بد وبلغني عن الشيخ المسن شهاب الدين السهروردي ابن أخي أبي النجيب أنه يقول بالجمع بين الشهود والكلام فعلمت مقامه وذوقه عند ذلك فما أدري هل ارتقى بعد ذلك أم لا وعلمنا أنه في مرتبة التخيل وهو المقام العام الساري في العموم وأما الخواص فيعلمونه ويزيدون بأمر ما هو ذوق العامة وهو ما أشار إليه السياري ونحن ومن جرى مجرانا في التحقيق من الرجال والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Fifty: Concerning the Knowledge of the State of a Pole whose Station was: <<When his Lord manifested His glory to the mountain, He made it crumble to dust>> [Q 7:143].\n\nIf He manifests to one to whom He manifests,\nThat Theophany (التجلي) strikes him senseless.\n\nAnd if He turns away from one from whom He turns away,\nThat turning away destroys him.\n\nAnd if He draws near to one to whom He draws near,\nThat drawing near is his light.\n\nI said what you have heard:\nBy God, O my Master, tell me.\n\nWhen I saw the One who manifested,\nHe made me witness in Him the very essence of my shadow.\n\nWho is for me if I am not other than Him?\nAnd if He is not my essence, tell me, who is for me?\n\nAllah is not manifest save Him,\nIn every opposite (ضد) and every like.\n\nAnd every genus and every species,\nAnd every union and every separation.\n\nAnd every sense and every intellect,\nAnd every body and every form.\n\n### [That the matter of the Theophany may occur contrary to the Wisdom]\n\nKnow, may Allah strengthen us and you, that the matter concerning the Theophany (التجلي) may sometimes occur contrary to the arrangement of the Wisdom (الحكمة) that is known. This is because we have already explained the preparedness (استعداد) of the receptive loci (القوابل), and that there is no withholding there, but rather an everlasting emanation (فيض دائم) and an unrestricted gift (عطاء غير محظور).\n\nIf the recipient of the Theophany (المتجلي له) did not possess preparedness, it would not be valid for him to receive this Theophany, even if that preparedness were made manifest to him. Therefore, it would be necessary for him not to experience crumbling (دك) or being struck senseless (صعق). This is the argument of the one who objects to us.\n\nWe say to him: O you, concerning what we stated about preparedness (الاستعداد), The Real (الحق) is always manifesting upon that [preparedness], and the receptive locus (القابل) for the realization of this Theophany is only through a specific preparedness (استعداد خاص). That preparedness has been validated for him, so the Theophany occurred in his regard.\n\nIt must be that he either also possesses the preparedness for Subsistence (البقاء) during the Theophany, or he does not possess it. If he possesses the former, he must subsist. If he does not possess it—meaning he had the preparedness for accepting the Theophany but lacked the preparedness for Subsistence, and it is not valid for him to possess it—then crumbling, being struck senseless, annihilation (فناء), absence (غيبة), or swooning (غشية) must necessarily occur. For nothing remains for him during the Witnessing (الشهود) except that which he witnesses. Therefore, do not covet what is not covetable. Some have said: The Witnessing of The Real is an annihilation in which there is no pleasure, neither in this world nor in the Hereafter.\n\nThus, the superiority and merit are not in the Theophany itself, but rather the superiority and merit lie in the preparedness that Allah grants to the recipient of the Theophany. The very occurrence of the Theophany is the very occurrence of Knowledge (العلم). No gap (بون) can be conceived between them, just as the aspect of the proof is identical to the proof itself. Rather, this [Theophany] is more complete and swifter in its effect.\n\nAs for the Theophany that is accompanied by Subsistence, intellect (العقل), pleasure, address (الخطاب), and acceptance (القبول), that is the Formal Theophany (التجلي الصوري). And whoever has not seen other than this may judge the Theophany absolutely by this [formal type], without restriction. But the one who has tasted both matters must necessarily distinguish between them.\n\nIt reached me concerning the aged Shaykh Shihab al-Din al-Suhrawardi, the nephew of Abu al-Najib, that he affirmed the combination of Witnessing and Speech (الكلام). I thus knew his station (مقامه) and his spiritual tasting (ذوقه) at that point, but I do not know whether he ascended beyond that afterward or not. We know that he is in the Level (مرتبة) of Imagination (التخيل), which is the general station that pervades the commonality. As for the elite (الخواص), they know it and surpass it by a matter that is not the tasting of the commonality. This is what al-Sayyari alluded to, and we, and those men who follow our path in verification (التحقيق). And Allah says the Truth (الحق), and He guides to the Way (السبيل).",
    "ur": "باب نمبر پانچ سو پچاس، اس قطب (قطب) کے حال کی معرفت میں جس کا مقام یہ آیت تھی: فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا (پھر جب اس کے رب نے پہاڑ پر تجلی (التجلی) فرمائی تو اسے ریزہ ریزہ کر دیا)۔\n\nإِذَا تَجَلَّى لِمَنْ تَجَلَّى *** أَصْعَقَهُ ذَلِكَ التَّجَلِّي\nجب وہ تجلی (التجلی) فرماتا ہے جس پر تجلی فرماتا ہے، تو وہ تجلی اسے بے ہوش کر دیتی ہے۔\n\nوَإِنْ تَوَلَّى عَمَّنْ تَوَلَّى *** أَهْلَكَهُ ذَلِكَ التَّوَلِّي\nاور اگر وہ منہ موڑتا ہے جس سے منہ موڑتا ہے، تو وہ منہ موڑنا اسے ہلاک کر دیتا ہے۔\n\nوَإِنْ تَدَلَّى بِمَنْ تَدَلَّى *** نُورُهُ ذَلِكَ التَّدَلِّي\nاور اگر وہ قریب ہوتا ہے جس سے قریب ہوتا ہے، تو وہ قربت (التدلی) اسے منور کر دیتی ہے۔\n\nقُلْتُ الَّذِي قَدْ سَمِعْتُمُوهُ *** بِاللَّهِ يَا سَيِّدِي فَقُلْ لِي\nمیں نے کہا جو تم سن چکے ہو، اللہ کی قسم، اے میرے آقا، مجھے بتاؤ۔\n\nلَمَّا رَأَيْتُ الَّذِي تَجَلَّى *** أَشْهَدَنِي فِيهِ عَيْنَ ظِلِّي\nجب میں نے اس کو دیکھا جس نے تجلی فرمائی، تو اس نے مجھے اس میں میرے سائے (ظل) کی عینیت کا مشاہدہ کرایا۔\n\nمَنْ لِي إِذَا لَمْ أَكُنْ سِوَاهُ *** وَلَيْسَ عَيْنِي قُلْ لِي فَمَنْ لِي\nمیرا کون ہے اگر میں اس کے سوا نہیں ہوں؟ اور اگر یہ میری آنکھ (عین) نہیں ہے، تو بتاؤ میرا کون ہے؟\n\nاللَّهُ لَا ظَاهِرَ سِوَاهُ *** فِي كُلِّ ضِدٍّ وَكُلِّ مِثْلِ\nاللہ (الحق) کے سوا کوئی ظاہر نہیں، ہر ضد (ضد) اور ہر مثل (مثل) میں۔\n\nوَكُلِّ جِنْسٍ وَكُلِّ نَوْعٍ *** وَكُلِّ وَصْلٍ وَكُلِّ فَصْلِ\nاور ہر جنس (جنس) اور ہر نوع (نوع) میں، اور ہر وصل (وصل) اور ہر فصل (فصل) میں۔\n\nوَكُلِّ حِسٍّ وَكُلِّ عَقْلٍ *** وَكُلِّ جِسْمٍ وَكُلِّ شَكْلِ\nاور ہر حس (حس) اور ہر عقل (عقل) میں، اور ہر جسم (جسم) اور ہر شکل (شکل) میں۔\n\n### [یہ کہ ظہور الٰہی (التجلی) کا معاملہ حکمت (الحکمۃ) کے خلاف بھی ہو سکتا ہے]\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ ظہور الٰہی (التجلی) کا معاملہ اس حکمت (الحکمۃ) کے ترتیب کے خلاف بھی ہو سکتا ہے جو جانی پہچانی ہے۔ اور یہ اس لیے کہ ہم نے قوابل (قبول کرنے والوں) کی استعداد (استعداد) بیان کی ہے، اور یہ کہ وہاں کوئی ممانعت نہیں ہے، بلکہ فیض (فیض) دائمی ہے اور عطا غیر محدود ہے۔ پس اگر جس پر تجلی ہو رہی ہے وہ استعداد پر نہ ہو، تو اس کے لیے یہ استعداد ظاہر کرنا، جسے تجلی (التجلی) کہا جاتا ہے، درست نہیں ہو گا کہ اسے یہ تجلی حاصل ہو۔ تو اس کے لیے مناسب تھا کہ نہ تو اس میں ریزہ ریزہ ہونا (دک) واقع ہو اور نہ ہی بے ہوشی (صعق)۔ یہ ہم پر اعتراض کرنے والے کا قول ہے۔\n\nہم نے اسے کہا: اے شخص! جو ہم نے استعداد (استعداد) کے بارے میں کہا ہے، ہم اس پر قائم ہیں کہ الحق (ذات حق) ہمیشہ متجلی (ظاہر) ہے۔ اور اس تجلی (التجلی) کو ادراک کرنے والا قبول کنندہ (القابل) کسی خاص استعداد کے بغیر نہیں ہو سکتا، اور جب اس کے لیے وہ استعداد ثابت ہو گئی تو اس کے حق میں تجلی واقع ہوئی۔ اب یہ خالی نہیں ہو گا کہ یا تو اس میں تجلی کے وقت بقا (البقاء) کی استعداد بھی ہو، یا وہ استعداد نہ ہو۔ اگر اسے وہ استعداد حاصل ہے تو وہ ضرور باقی رہے گا، اور اگر اسے حاصل نہیں ہے—یعنی اسے تجلی قبول کرنے کی استعداد تو تھی لیکن بقا (البقاء) کی استعداد نہیں تھی، اور نہ ہی اس کا ہونا درست تھا—تو لازمی ہے کہ ریزہ ریزہ ہونا (اندکاک)، یا بے ہوشی (صعق)، یا فنا (الفناء)، یا غیبت (غیبہ)، یا غشی (غشیہ) واقع ہو۔ کیونکہ شہود (الشہود) کے ساتھ اس کے لیے اس کے سوا کچھ باقی نہیں رہتا جس کا اس نے مشاہدہ کیا، لہٰذا ایسی چیز کی طمع نہ کرو جس کی طمع نہیں کی جا سکتی۔\n\nاور بعض نے کہا ہے کہ الحق (ذات حق) کا شہود (الشہود) ایسی چیز کی فنا (الفناء) ہے جس میں نہ دنیا میں کوئی لذت ہے اور نہ آخرت میں۔ پس فضیلت اور برتری تجلی (التجلی) میں نہیں ہے، بلکہ فضیلت اور برتری اس استعداد (الاستعداد) میں ہے جو اللہ تعالیٰ اس متجلی لہ (جس پر تجلی ہوئی) کو عطا فرماتا ہے۔ اور تجلی (التجلی) کا حصول عین علم (العلم) کا حصول ہے، ان دونوں کے درمیان کوئی فرق نہیں سمجھا جا سکتا، جیسے دلیل میں دلیل کی صورت، بلکہ یہ (تجلی) حکم میں زیادہ کامل اور تیز تر ہے۔\n\nاور وہ تجلی (التجلی) جس کے ساتھ بقا (البقاء)، عقل (العقل)، لذت، خطاب اور قبولیت ہو، وہ تجلی صوری (التجلی الصوری) ہے۔ اور جس نے اس کے سوا کوئی اور تجلی نہیں دیکھی، وہ شاید تجلی پر بغیر کسی قید کے مطلقاً اسی کا حکم لگا دے۔ اور جس نے دونوں ذوق حاصل کیے ہیں، وہ لازماً فرق کرے گا۔\n\nاور مجھے شیخ المسن شہاب الدین سہروردی، جو ابو النجیب کے بھتیجے تھے، کے بارے میں یہ بات پہنچی ہے کہ وہ شہود (الشہود) اور کلام (الکلام) کے درمیان جمع کے قائل تھے، تو میں نے اس وقت ان کا مقام اور ذوق جان لیا۔ مجھے نہیں معلوم کہ اس کے بعد انہوں نے مزید ترقی کی یا نہیں۔ اور ہم جانتے ہیں کہ وہ تخیل (التخیل) کے مرتبے میں تھے، اور یہ وہ عام مقام ہے جو عوام میں جاری و ساری ہے۔ لیکن خواص (الخواص) اسے جانتے ہیں اور ایک ایسے امر کے ذریعے بڑھ جاتے ہیں جو عوام کا ذوق نہیں ہے، اور یہی وہ چیز ہے جس کی طرف سیاری نے اشارہ کیا ہے، اور ہم اور وہ لوگ جو تحقیق (التحقیق) میں ہمارے راستے پر چلے ہیں۔\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب پانصد و پنجاه در شناخت حال قطبی (قطب) که مقام او آیه «و چون پروردگارش بر کوه تجلی کرد، آن را متلاشی ساخت» (فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا) بود.\n\nچون بر کسی که تجلی کند، *** آن تجلی (التجلی) او را مدهوش سازد\nو اگر از کسی که روی برگرداند، *** آن روی برگرداندن او را هلاک کند\nو اگر به کسی که نزدیک شود، *** نور آن نزدیکی او را روشن سازد\nآنچه شنیدید را گفتم، *** به خدا سوگند ای سرورم، پس به من بگو\nهنگامی که آن کسی را که تجلی کرد دیدم، *** عین سایه‌ام را در آن به شهودم رساند\nچه کسی برای من است اگر من غیر او نباشم؟ *** و اگر عین من نیست، بگو پس چه کسی برای من است؟\nخداوند، جز او ظاهری نیست، *** در هر ضد و هر مانند\nو هر جنس و هر نوع، *** و هر وصل و هر فصل\nو هر حس و هر عقل، *** و هر جسم و هر شکل\n\n### [اینکه امر در تجلی (التجلی) ممکن است برخلاف حکمت باشد]\n\nبدان، خداوند ما و شما را تأیید کند، که امر در تجلی (التجلی) ممکن است برخلاف ترتیب حکمتی باشد که معهود است. این بدان سبب است که ما آمادگی (استعداد) پذیرندگان (القوابل) را بیان کرده‌ایم و اینکه در آنجا منعی نیست، بلکه فیض (فیض) دائم و عطایی نامحدود است. پس اگر کسی که تجلی بر او واقع می‌شود، آمادگی (استعداد) نداشته باشد، این تجلی نامیده شده، آن آمادگی را برای او آشکار نمی‌سازد، و صحیح نیست که این تجلی برای او رخ دهد. بنابراین شایسته بود که متلاشی شدن (دک) یا مدهوش شدن (صعق) برای او اتفاق نیفتد. این سخن معترض بر ماست. ما به او گفتیم: ای کسی که این سخن را می‌گویی، آنچه ما درباره آمادگی (الاستعداد) گفتیم، ما بر آن هستیم. حق (الحق) همواره در حال تجلی (التجلی) است، و پذیرنده برای درک این تجلی جز با آمادگی (استعداد) خاصی نمی‌تواند باشد. و چون آن آمادگی برای او محقق شده، تجلی در حق او واقع شده است. پس خالی از این نیست که او آمادگی بقا (البقاء) هنگام تجلی را نیز داشته باشد یا آن را نداشته باشد. اگر آن آمادگی را داشته باشد، ناگزیر باقی می‌ماند، و اگر نداشته باشد، پس آمادگی پذیرش تجلی را داشته اما آمادگی بقا (البقاء) را نداشته است و صحیح نیست که آن را داشته باشد. زیرا در این صورت ناگزیر متلاشی شدن (اندکاك)، یا مدهوش شدن (صعق)، یا فنا (الفناء)، یا غیبت، یا بیهوشی رخ می‌دهد. زیرا با شهود (الشهود)، جز آنچه شهود کرده، برای او باقی نمی‌ماند. پس در غیر آنچه مطمع است طمع مکن. و برخی گفته‌اند: شهود حق (الحق)، فنای (فناء) چیزی است که در آن لذتی نیست، نه در دنیا و نه در آخرت. پس برتری و فضیلت در خود تجلی (التجلی) نیست، بلکه برتری و فضیلت در آن آمادگی (الاستعداد) است که خداوند به کسی که تجلی بر او واقع می‌شود، عطا می‌کند. و عین حصول تجلی (التجلی)، عین حصول علم (العلم) است. بین این دو فاصله‌ای قابل تصور نیست، همانند وجه دلیل در خود دلیل، بلکه این (تجلی) در حکم، کامل‌تر و سریع‌تر است. اما تجلی (التجلی) که همراه با بقا (البقاء)، عقل، التذاذ، خطاب و پذیرش است، آن تجلی صوری است. و کسی که جز آن را ندیده باشد، چه بسا به طور مطلق و بدون قید، بر تجلی حکم به آن کند. اما کسی که هر دو امر را چشیده باشد، ناگزیر تفاوت می‌گذارد. و از شیخ سالخورده شهاب‌الدین سهروردی، برادرزاده ابوالنجیب، به من رسیده است که او قائل به جمع میان شهود (الشهود) و کلام است. پس من مقام و ذوق او را در آن هنگام دانستم. اما نمی‌دانم آیا پس از آن ارتقا یافته است یا خیر. و ما می‌دانیم که او در مرتبه تخیل (التخیل) است، و این مقام عامی است که در میان عموم جاری است. اما خواص آن را می‌دانند و به امری می‌افزایند که ذوق عامه نیست، و این همان چیزی است که سیاری و ما و کسانی که در تحقیق (التحقیق) از مردان راه ما را پیموده‌اند، به آن اشاره کرده‌ایم. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}