{
  "id": 219,
  "title": {
    "ar": "الباب التاسع عشر ومائتان في معرفة البسط وأسراره",
    "en": "Chapter Two Hundred and Nineteenth, On the Gnosis of Spiritual Expansion (البسط) and its Mysteries",
    "ur": "دو سو انیسواں باب، بسط (البسط) اور اس کے اسرار کی معرفت میں۔",
    "fa": "باب دویست و نوزدهم در معرفت بسط و اسرار آن"
  },
  "content": {
    "ar": "## «الباب التاسع عشر ومائتان في معرفة البسط وأسراره»\n\n\n> البسط حال ولكن ليس يدريه *** إلا الإله الذي أقامنا فيه‏\n\n\n> له التحكم في الأكوان أجمعها *** به الوجود الذي تبدو معانيه‏\n\n\n> وليس يحجبه عنا سوى قدر *** وهو الذي عن عيون الخلق يخفيه‏\n\n\n> البغي حكم له إن كنت ذا نظر *** جاء الكتاب به لو كنت تدريه‏\n\n\n> في عالم الخلق هذا الحكم ليس له *** في عالم الأمر هذا في تجليه‏\n### [البسط عبارة عن حال الرجاء في الوقت‏]\n\n\nاعلم وفقك الله أن البسط عند الطائفة عبارة عن حال الرجاء في الوقت وقال بعضهم القبض والبسط أخذ وارد الوقت بحكم قهر وغلبة والبسط عندنا حال حكم صاحبه أن يسع الأشياء ولا يسعه شي‏ء حقيقة البسط لا تكون إلا لرفيع المنزلة رفيع الدرجات فينزل بالحال إلى حال من هو في أدنى الدرجات فيساويه وهو في الجناب الإلهي في مثل قوله تعالى وأَقْرِضُوا الله قَرْضاً حَسَناً وأعظم في النزول من ذَا الَّذِي يُقْرِضُ الله ولأجل هذا البسط قال من قال إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ وهذا القول تصديق قوله تعالى ولَوْ بَسَطَ الله الرِّزْقَ لِعِبادِهِ لَبَغَوْا في الْأَرْضِ ومن البسط الإلهي قوله تعالى يَنْشُرُ رَحْمَتَهُ وهُوَ الْوَلِيُّ الْحَمِيدُ ولو لا البسيط الإلهي ما تمكن لأحد من خلق الله أن يتخلق بجميع الأسماء الإلهية وأعظم تعريف في البسط الإلهي إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ ويا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله فلما تمكن مثل هذا البسط في قلوب العباد ربما أثر في قلوبهم بغيا فتعدوا منزلتهم فلما علم الحق أنه ربما أثر ذلك مرضا في قلوب بعض العباد جعل دواءه تمام الآية وهو قوله والله هُوَ الْغَنِيُّ الْحَمِيدُ فأنزل الداء والدواء وهذا من نشر رحمته لأن الأدنى في مرتبة تقتضي أن لا يكون صاحب بسط فإن انبسط فليس له إلا أن يجول في غير ميدانه فيكون البسط من الأدنى سوء أدب ولما علم الحق هذا أمر عباده بالتخلق بمكارم الأخلاق وأثنى عليهم بها وجعل ذلك من أعظم أعمال العباد فظهروا بها عن الأمر الإلهي فكان بسطهم عبادة وقربة إلى الله وهذا من نشر رحمته واتساع مغفرته وعموم تفضله فبسط العباد بسط عن قبض وبسط الحق لا عن قبض بل له البسط ابتداء ثم بعد ذلك يكون القبض الإلهي وهوقوله صلى الله عليه وسلم إن رحمة الله سبقت غضبه‏\n\n\nفمن رحمته وبسطه أوجد الخلق ولا يكون حكم القبض والبسط إلا مع ثبوت الأغيار ولو لا الأغيار لم يتحقق بسط ولا قبض فتحقق ذلك‏\n\n\n### [إن من أعظم بسط العبد أن يكون خلاقا]\n\n\nواعلم أن أعظم بسط العبد أن يكون خلاقا فإن تأدب في هذا البسط فهو المذكور الداخل في عموم قوله تعالى فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ فأضاف الحسن إلى الخالقين غير إن الله أحسن الخالقين إذ كان هذا النعت من خصوص وصف الإله لأنه قال تعالى في الرد على عبدة الأوثان أَ فَمَنْ يَخْلُقُ كَمَنْ لا يَخْلُقُ فنفى الخلق عن الخلق فلو لم يرد عموم نفي الخلق عن الخلق لم تقم به حجة على من عبد فرعون وأمثاله ممن أمر من المخلوقين أن يعبد من دون الله ولم يكن هؤلاء ممن يدخل في عموم الخالقين من قوله أَحْسَنُ الْخالِقِينَ فإنهم لم يتصفوا بالإحسان في الخلق فإن الإحسان في العباد أن تعبد الله كأنك تراه فتعلم من هو الخالق على الحقيقة فلما كان هذا النعت من خصوص وصف الإله وقد أضاف الخلق إلى الخلق انفرد هو بالنظر إلى ما أثبت من الخلق للخلق بالأحسن في ذلك فقال أحسن الخالقين وهو معنى قوله تعالى فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ والبركة الزيادة فزاد أحسن في قوله أَحْسَنُ الْخالِقِينَ وما أحسن قوله تعالى أَ فَرَأَيْتُمْ ما تُمْنُونَ أَ أَنْتُمْ تَخْلُقُونَهُ أَمْ نَحْنُ الْخالِقُونَ ولم يقل أ أنتم تخلقون منه ولا فيه وإنما قال تخلقونه فأراد عين إيجاده منيا خاصة والاسم المصور هو الذي يتولى فتح الصورة فيه أي صورة شاء من الجنس أو غيره وهو قوله في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ فهو الاسم المصور وهنا أسرار من علوم الطبيعة لما جعل الله فيها من الاشتراك في التكوين فهل هي سبب من جملة الأسباب التي تفعل لعينها بذاتها فيكون الحق يفعل بها لا عندها أو تكون من الأسباب التي يفعل الحق مسببها عندها لا بها ويتفاوت هنا نظر النظار وأما أهل الكشف فيعلمون ذلك ابتداء عند الكشف من غير نظر لعلمهم بمرتبة الطبيعة وأن منزلتها منزلة جميع الحقائق والحقائق لا تتبدل فيجرونها مجراها وينزلونها منزلتها فبسط العلماء بالله هو عين العلم بالله فإذا علموا علموا من انبسط ومن له البسط وعلموا من انقبض ومن له القبض فيبقى عندهم كل أمر على أصله وحقيقته لا تبديل عندهم في ذلك ولا تحويل لأنهم على سنة الله فَلَنْ تَجِدَ لِسُنَّتِ الله تَبْدِيلًا ولَنْ تَجِدَ لِسُنَّتِ الله تَحْوِيلًا فأهل سنة الله لهم البسط المحقق لأن البسط نشر والنشر ظهور ولو لا الظهور ما أدركت الأشياء\n\n\n> فبسط العارفين على يقين *** وبسط الخلق تخمين وحدس‏\n\n\nإذا خشعت الأصوات للرحمن فكيف يكون الحال مع الجبار\n\n\n> خشوع حياء لا خشوع مهانة *** وهيبة إجلال وقبض تأدب‏\nقال تعالى وخَشَعَتِ الْأَصْواتُ لِلرَّحْمنِ فَلا تَسْمَعُ إِلَّا هَمْساً حكم اقتضاه الموطن‏\n\n\n### [الخلق كلهم في قبضة الحق‏]\n\n\nواعلم أيها الولي الحميم أن الخلق كان في قبض الحق للحق فلما انبسط ظهر للعالم‏\n\n\nقال الله تعالى لآدم ويداه مقبوضتان يا آدم اختر أيتهما شئت فقال آدم اخترت يمين ربي وكلتا يدي ربي يمين مباركة فبسطها فإذا فيها آدم وذريته‏\n\n\nولو فتح الأخرى لكان فيها سائر العالم فانظر إلى كون الإنسان في اليمين الحق إذ علم آدم أن بين اليدين فرقانا ولذلك قال أدبا وكلتا يدي ربي يمين مباركة فاختار القوة نظرا إلى نفسه لما علم أنه على الصورة وأنه خليفة فعلم إن القوة له فاختار الأقوى بأدب ولما كان الخلق مطويا في الحق لم ير نفسه وهو مشهود لله فلما كان البسط الإلهي ظهر العالم لنفسه فرأى نفسه ورأى من كان في قبضته عن شهود نفسه فعلم من أين صدر وكيف صدر وما علم هل له رجوع أم لا فقيل له وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ وإِلَيْهِ تُرْجَعُونَ وعلم أن الرجوع إنما هو رد إلى الأصل وقد علم أصل الوجود فعلم إلى أين يرجع وقد كان في الأصل لا يعلم نفسه فعلم أنه يرجع إلى منزله لا بعلم نفسه مع ظهور عينه كما لم يشهد نفسه إذ كان في قبضة موجدة فيكون مال العارفين ورجوعهم مع ثبوت عينهم إلى أن الحق عينهم لا هم وهذا مقام لا يكون إلا للعارفين فهم مقبوضون في حال بسطهم ولا يصح لعارف قط إن يكون مقبوضا في غير بسط ولا مبسوطا في غير قبض وما سوى العارف إذا كان في حال قبض لا يكون له حال بسط وإذا كان في حال بسط لا يكون له حال قبض فالعارف لا يعرف إلا بجمعه بين الضدين فإنه حق كله كما قال أبو سعيد الخراز وقد قيل له بم عرفت الله فقال بجمعه بين الضدين لأنه شاهد جمعهما في نفسه وقد علم أنه على صورته وسمعه يقول هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ وبهذه الآية احتج في ذلك ثم نظر إلى العالم فرآه إنسانا كبيرا في الجرم ورآه قد جمع بين الضدين فإنه رأى فيه الحركة والسكون والاجتماع والافتراق ورأى فيه الأضداد وهو أيضا على صورة العالم كما هو على صورة الحق فانظر ما أعجب هذه اللفظة من أبي سعيد ولهذا المقام كان يشير ذو النون المصري في مسائله من إيراد الكبير على الصغير وإدخال الواسع في الضيق من غير إن يوسع الضيق أو يضيق الواسع وقد ذكرنا هذه المسألة في معرفة الخيال من باب المعرفة من هذا الكتاب مستوفاة فبسط العلماء بالله من البسط المنسوب إلى الحق بل هو عين البسط المنسوب إلى الحق لأنهم إليه رجعوا\n\n\n> فلم يكن البسط الإله *** فهم أهل محو وإن أثبتوا\n\n\nوهذا القدر كاف في تحقيق البسط من العلم الإلهي‏\n\n",
    "en": "The Two Hundred and Nineteenth Chapter: Concerning the Knowledge of Spiritual Expansion (البسط) and its Secrets.\n\nSpiritual Expansion (البسط) is a state, but none comprehends it\nExcept the God who established us within it.\n\nTo Him belongs control over all the universes entirely,\nThrough Him is the Existence (الوجود) whose meanings become manifest.\n\nNothing veils Him from us except a measure (قدر),\nAnd He is the one who conceals it from the eyes of creation (الخلق).\n\nTransgression (البغي) is a ruling for Him, if you possess insight;\nThe Book came with it, if only you knew it.\n\nIn the world of Creation (عالم الخلق), this ruling does not belong to Him;\nIn the world of Command (عالم الأمر), this is in His Self-disclosure (تجلي).\n\n### [Spiritual Expansion (البسط) is the expression of the state of Hope in the Moment]\n\nKnow, may Allah grant you success, that Spiritual Expansion (البسط) among the Sufi community (الطائفة) is the expression of the state of hope in the moment (الوقت). Some have said that Contraction (القبض) and Expansion (البسط) are the reception of the incoming spiritual state (وارد الوقت) under the rule of subjugation and overwhelming power.\n\nFor us, Spiritual Expansion (البسط) is a state whose possessor is ruled by the capacity to encompass all things, while nothing encompasses him. The reality of Spiritual Expansion (البسط) belongs only to one of high station and elevated degrees. He descends with the state to the level of one who is in the lowest degrees, thus equaling him. This is exemplified in the Divine Presence (الجناب الإلهي) by His saying, <<وَأَقْرِضُوا اللهَ قَرْضاً حَسَناً>> (And lend to Allah a goodly loan), and even greater in descent than <<مَنْ ذَا الَّذِي يُقْرِضُ اللهَ>> (Who is it that would lend to Allah?).\n\nBecause of this Spiritual Expansion (البسط), some have said, <<إِنَّ اللهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ>> (Indeed, Allah is poor, and we are rich). This statement confirms His saying, <<وَلَوْ بَسَطَ اللهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ>> (And if Allah had expanded the provision for His servants, they would have committed transgression upon the earth).\n\nAmong the Divine Expansions (البسط الإلهي) is His saying, <<يَنْشُرُ رَحْمَتَهُ وَهُوَ الْوَلِيُّ الْحَمِيدُ>> (He spreads His mercy, and He is the Protecting Friend, the Praiseworthy). Were it not for the Divine Expander (البسيط الإلهي), none of Allah’s creation (الخلق) would be able to embody all the Divine Names (الأسماء الإلهية). The greatest definition of Divine Expansion (البسط الإلهي) is <<إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ>> (Indeed, your Lord is vast in forgiveness).\n\nAnd <<يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللهِ>> (O mankind, you are the needy ones toward Allah). When such Spiritual Expansion (البسط) became established in the hearts of the servants, it might sometimes induce transgression (بغيا) in their hearts, causing them to overstep their station. When The Real (الحق) knew that this might cause a sickness in the hearts of some servants, He made its cure the completion of the verse, which is His saying, <<وَاللهُ هُوَ الْغَنِيُّ الْحَمِيدُ>> (And Allah is the Self-Sufficient, the Praiseworthy). Thus, He sent down the ailment and the cure. This is part of the spreading of His mercy, because the one who is lower in rank is required not to be a possessor of Spiritual Expansion (بسط). If he expands, he can only roam outside his proper field, and thus, expansion from the lower one becomes a lack of proper conduct (سوء أدب).\n\nWhen The Real (الحق) knew this, He commanded His servants to embody noble character (مكارم الأخلاق) and praised them for it, making this one of the greatest acts of the servants. They manifested these qualities by Divine Command (الأمر الإلهي), so their expansion became an act of worship and proximity to Allah. This is part of the spreading of His mercy, the vastness of His forgiveness, and the universality of His favor. The expansion of the servants (بسط العباد) is an expansion following contraction (قبض), but the expansion of The Real (بسط الحق) is not preceded by contraction; rather, Expansion (البسط) belongs to Him initially, and only after that comes the Divine Contraction (القبض الإلهي). This is confirmed by his (peace and blessings be upon him) saying: \"Indeed, the mercy of Allah preceded His wrath.\"\n\nIt is from His mercy and His Expansion (بسطه) that He brought Creation (الخلق) into existence. The ruling of Contraction (القبض) and Expansion (البسط) only occurs with the establishment of the others (الأغيار). Were it not for the others, neither Expansion nor Contraction would be realized. Understand this clearly.\n\n### [Indeed, the greatest Spiritual Expansion (بسط) of the servant is to be a creator]\n\nKnow that the greatest Spiritual Expansion (بسط) of the servant is to be a creator (خلاقا). If he maintains proper conduct (تأدب) in this expansion, then he is the one mentioned, included in the generality of His saying, <<فَتَبَارَكَ اللهُ أَحْسَنُ الْخَالِقِينَ>> (So blessed is Allah, the best of creators).\n\nThus, He attributed goodness (الحسن) to the creators, yet Allah is the best of creators (أَحْسَنُ الْخَالِقِينَ), since this description is specific to the Divine Attribute (وصف الإله). For He said, in refutation of the idolaters, <<أَفَمَنْ يَخْلُقُ كَمَنْ لَا يَخْلُقُ>> (Is He who creates like one who does not create?). Thus, He negated creation (الخلق) from creation (الخلق). If He had not intended the general negation of creation from creation, there would be no argument against those who worshipped Pharaoh and others like him among the created beings who commanded to be worshipped besides Allah. These individuals were not included in the generality of \"creators\" (الخالقين) mentioned in His saying, \"the best of creators\" (أَحْسَنُ الْخَالِقِينَ), for they were not characterized by excellence (الإحسان) in creation.\n\nIndeed, excellence (الإحسان) for the servants is that you worship Allah as if you see Him, thereby knowing who the Creator (الخالق) is in reality. Since this description is specific to the Divine Attribute, and yet He attributed creation to creation, He distinguished Himself, regarding the creation He affirmed for creation, by being the most excellent (الأحسن) in it. Thus, He said, \"the best of creators\" (أَحْسَنُ الْخَالِقِينَ). This is the meaning of His saying, <<فَتَبَارَكَ اللهُ أَحْسَنُ الْخَالِقِينَ>> (So blessed is Allah, the best of creators). *Barakah* (البركة) means increase, so He added \"best\" (أحسن) in His saying, \"the best of creators.\"\n\nAnd how excellent is His saying, <<أَفَرَأَيْتُمْ مَا تُمْنُونَ * أَأَنْتُمْ تَخْلُقُونَهُ أَمْ نَحْنُ الْخَالِقُونَ>> (Have you considered the semen that you emit? Is it you who create it, or are We the Creator?). He did not say, \"Do you create *from* it?\" or \"Do you create *in* it?\" but rather, He said, \"Do you create *it*?\" meaning the very essence of its existence, specifically from semen. The Name, The Fashioner (المصور), is the one who undertakes the opening of the form within it—whatever form He wills, whether of the same species or otherwise. This is His saying, <<فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ>> (In whatever form He willed, He assembled you). Thus, He is The Fashioner (المصور).\n\nHerein lie secrets concerning the sciences of nature (علوم الطبيعة) due to the partnership Allah established within it regarding formation (التكوين). Is nature a cause among the causes that act essentially by themselves, such that The Real (الحق) acts *by* them, not *at* them? Or is it among the causes whose effects The Real produces *at* them, not *by* them? The views of the speculative thinkers (النظار) differ here. As for the People of Unveiling (أهل الكشف), they know this immediately upon Unveiling (الكشف), without speculation, due to their knowledge of the level (مرتبة) of nature and that its station is the station of all Realities (الحقائق). Realities do not change, so they treat them according to their course and assign them their proper station.\n\nTherefore, the Spiritual Expansion (بسط) of the Gnostics (العلماء بالله) is the very essence of the Knowledge (العلم) of Allah. When they know, they know who expands and who possesses Expansion (البسط), and they know who contracts and who possesses Contraction (القبض). Thus, every matter remains with them upon its origin and its reality. There is no substitution or alteration in this for them, because they follow the way (سنّة) of Allah: <<فَلَنْ تَجِدَ لِسُنَّةِ اللهِ تَبْدِيلًا وَلَنْ تَجِدَ لِسُنَّةِ اللهِ تَحْوِيلًا>> (You will never find any substitution for the way of Allah, and you will never find any alteration for the way of Allah). Thus, the People of Allah’s Way possess realized Expansion (البسط المحقق), because Expansion is spreading, and spreading is manifestation (ظهور). Were it not for manifestation, things would not be perceived.\n\nThe Expansion (بسط) of the Gnostics (العارفين) is based on certainty,\nWhile the expansion of creation (الخلق) is conjecture and guesswork.\n\nIf voices are humbled before the All-Merciful (الرحمن), what then will be the state before the Compeller (الجبار)?\n\nHumility born of modesty, not humility born of degradation,\nAnd awe born of veneration, and Contraction (قبض) born of proper conduct.\n\nHe, the Exalted, said, <<وَخَشَعَتِ الْأَصْوَاتُ لِلرَّحْمَنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا>> (And voices will be humbled before the Most Merciful, so you will not hear except a whisper). This is a ruling necessitated by the station.\n\n### [All of Creation (الخلق) is in the grasp of The Real (الحق)]\n\nKnow, O intimate friend (الولي الحميم), that Creation (الخلق) was in the Contraction (قبض) of The Real (الحق) for The Real. When He expanded (انبسط), it became manifest to the world (العالم).\n\nAllah, the Exalted, said to Adam while His two hands were contracted (مقبوضتان): \"O Adam, choose whichever of them you wish.\" Adam said, \"I choose the right hand of my Lord, and both hands of my Lord are blessed right hands.\" So He expanded it (بسطها), and behold, Adam and his progeny were within it. Had He opened the other, the rest of the world would have been in it. Look at the existence of the human being in the Right Hand of The Real (اليمين الحق), since Adam knew there was a distinction (فرقانا) between the two hands. Therefore, out of proper conduct (أدبا), he said, \"And both hands of my Lord are blessed right hands.\" He chose the power, considering his own nature, since he knew that he was created upon the Form (على الصورة) and that he was a vicegerent (خليفة). Thus, he knew that power belonged to him, so he chose the stronger one with proper conduct.\n\nWhen Creation (الخلق) was folded up within The Real (الحق), it did not see itself, though it was witnessed by Allah. When the Divine Expansion (البسط الإلهي) occurred, the world became manifest to itself. It saw itself and saw the One who was in its Contraction (قبضته) through its own witnessing. Thus, it knew from where it originated and how it originated, but it did not know whether it had a return or not. So it was told, <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him the matter will all be returned) and <<وَإِلَيْهِ تُرْجَعُونَ>> (And to Him you will be returned). It knew that the return is merely a restoration to the origin. Having known the origin of Existence (أصل الوجود), it knew where it would return. In the origin, it did not know itself, so it knew that it returns to its station without knowing itself, even while its essence (عينه) is manifest, just as it did not witness itself when it was in the grasp of its Originator.\n\nThus, the ultimate destination and return of the Gnostics (العارفين), while their essences (عينهم) remain established, is that The Real (الحق) is their essence, not they themselves. This station belongs only to the Gnostics. They are contracted (مقبوضون) in their state of expansion (بسطهم), and it is never correct for a Gnostic to be contracted without expansion, nor expanded without contraction. Anyone other than the Gnostic, if he is in a state of contraction, does not have a state of expansion, and if he is in a state of expansion, he does not have a state of contraction. The Gnostic is only known by his combination of the two opposites, for he is entirely The Real (حق كله), just as Abu Sa'id al-Kharraz said when asked, \"How did you know Allah?\" He replied, \"By His combination of the two opposites,\" because he witnessed their combination within himself, and he knew that he was created upon His Form (صورته), and he heard Him say, <<هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ>> (He is the First and the Last, the Manifest and the Hidden). He used this verse as proof for that.\n\nThen he looked at the World (العالم) and saw it as a great human being (إنسانا كبيرا) in body, and he saw that it combined the two opposites, for he saw in it movement and stillness, gathering and separation, and he saw the opposites within it. And it, too, is upon the form of the World, just as it is upon the Form of The Real (صورة الحق). Look at how marvelous this statement from Abu Sa'id is.\n\nDhu al-Nun al-Misri used to point to this station in his discussions concerning the introduction of the large into the small, and the insertion of the vast into the narrow, without the narrow being widened or the vast being narrowed. We have already discussed this issue fully in the chapter on the Knowledge of Imagination (الخيال) in this book.\n\nTherefore, the Spiritual Expansion (بسط) of the Gnostics (العلماء بالله) is part of the Expansion attributed to The Real; rather, it is the very essence of the Expansion attributed to The Real, because they have returned to Him.\n\nThe Divine Expansion (البسط الإله) was not [separate from them],\nFor they are the People of Annihilation (أهل محو), even if they are affirmed.\n\nThis much is sufficient for the realization of Spiritual Expansion (البسط) from the Divine Knowledge (العلم الإلهي).",
    "ur": "## باب نمبر دو سو انیس: البسط (کشادہ حالی) اور اس کے اسرار کی معرفت میں\n\nبسط (البسط) ایک حال ہے، لیکن اسے کوئی نہیں جانتا،\nسوائے اس معبود کے جس نے ہمیں اس میں قائم کیا۔\n\nتمام کائنات پر اسی کا حکم چلتا ہے،\nاسی کے ذریعے وہ ہستی (الوجود) ہے جس کے معانی ظاہر ہوتے ہیں۔\n\nہم سے اسے کوئی چیز نہیں چھپاتی سوائے ایک تقدیر کے،\nاور وہی ہے جو اسے مخلوق کی آنکھوں سے پوشیدہ رکھتا ہے۔\n\nاگر تم صاحب بصیرت ہو تو بغاوت (البغي) اس کا حکم ہے،\nاگر تم اسے جانو تو کتاب (قرآن) اسی کے ساتھ آئی ہے۔\n\nعالم خلق میں یہ حکم اس کے لیے نہیں ہے،\nعالم امر میں یہ اس کے ظہور (التجلی) میں ہے۔\n\n### [البسط (البسط) وقت (الوقت) میں رجاء (امید) کے حال کا نام ہے]\n\nجان لو، اللہ تمہیں توفیق دے، کہ طائفہ (صوفیاء) کے نزدیک بسط (البسط) سے مراد وقت (الوقت) میں رجاء (امید) کا حال ہے۔ اور بعض نے کہا ہے کہ قبض (القبض) اور بسط (البسط) وقت کے وارد (آنے والے الہام) کو قہر اور غلبے کے حکم سے لینا ہے۔\n\nاور ہمارے نزدیک بسط (البسط) ایک ایسا حال ہے جس کا حکم یہ ہے کہ اس کا صاحب تمام اشیاء کو اپنے اندر سمو لے، لیکن کوئی شے اسے اپنے اندر نہ سمو سکے۔ بسط (البسط) کی حقیقت صرف بلند مرتبہ اور بلند درجات والے کے لیے ہوتی ہے، جو اس حال کے ذریعے اس شخص کے حال تک اتر آتا ہے جو ادنیٰ درجات میں ہے، اور اس کے برابر ہو جاتا ہے۔\n\nاور جنابِ الٰہی میں یہ اس فرمانِ الٰہی کی مانند ہے: **وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا** (اور اللہ کو اچھا قرض دو)۔ اور نزول میں اس سے بھی عظیم ہے: **مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ** (کون ہے جو اللہ کو قرض دے؟)۔ اور اسی بسط (البسط) کی وجہ سے بعض نے کہا: **إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ** (بے شک اللہ فقیر ہے اور ہم غنی ہیں)۔ اور یہ قول اللہ تعالیٰ کے اس فرمان کی تصدیق ہے: **وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ** (اور اگر اللہ اپنے بندوں کے لیے رزق کشادہ کر دیتا تو وہ زمین میں سرکشی کرنے لگتے)۔\n\nاور بسط (البسط) الٰہی میں سے اللہ تعالیٰ کا یہ فرمان ہے: **يَنْشُرُ رَحْمَتَهُ وَهُوَ الْوَلِيُّ الْحَمِيدُ** (وہ اپنی رحمت پھیلاتا ہے، اور وہی کارساز ہے، قابل تعریف ہے)۔ اگر بسط (البسط) الٰہی نہ ہوتی تو اللہ کی مخلوق میں سے کوئی بھی تمام اسماءِ الٰہیہ سے متخلق نہ ہو سکتا۔ اور بسط (البسط) الٰہی میں سب سے بڑی تعریف یہ ہے: **إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ** (بے شک تمہارا رب وسیع مغفرت والا ہے)۔ اور: **يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ** (اے لوگو! تم سب اللہ کے محتاج ہو)۔\n\nجب اس طرح کا بسط (البسط) بندوں کے دلوں میں راسخ ہو جاتا ہے، تو بسا اوقات ان کے دلوں میں بغاوت (البغي) پیدا کر دیتا ہے، اور وہ اپنی منزل سے تجاوز کر جاتے ہیں۔ جب ذات حق (الحق) نے جان لیا کہ یہ بعض بندوں کے دلوں میں بیماری پیدا کر سکتا ہے، تو اس نے اس کا علاج آیت کے بقیہ حصے کو بنا دیا، اور وہ اس کا فرمان ہے: **وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ** (اور اللہ ہی غنی ہے، قابل تعریف ہے)۔ پس اس نے بیماری اور دوا دونوں نازل کیں، اور یہ اس کی رحمت کے پھیلاؤ میں سے ہے، کیونکہ ادنیٰ مرتبے والے کا تقاضا یہ ہے کہ وہ صاحب بسط (البسط) نہ ہو۔ اگر وہ بسط (البسط) اختیار کرتا ہے، تو اس کے لیے اپنے میدان سے باہر گھومنے کے سوا کچھ نہیں، لہٰذا ادنیٰ کی طرف سے بسط (البسط) سوءِ ادب ہے۔\n\nاور جب ذات حق (الحق) نے یہ جان لیا، تو اس نے اپنے بندوں کو مکارمِ اخلاق سے متخلق ہونے کا حکم دیا، اور اس پر ان کی تعریف کی، اور اسے بندوں کے عظیم ترین اعمال میں سے قرار دیا۔ پس وہ اس کے ذریعے امرِ الٰہی سے ظاہر ہوئے، تو ان کا بسط (البسط) عبادت اور اللہ کا قرب بن گیا۔ اور یہ اس کی رحمت کے پھیلاؤ، اس کی مغفرت کی وسعت، اور اس کے عام فضل میں سے ہے۔\n\nپس بندوں کا بسط (البسط) قبض (القبض) کے بعد ہوتا ہے، جبکہ ذات حق (الحق) کا بسط (البسط) قبض (القبض) کے بعد نہیں ہوتا، بلکہ ابتدا میں اسی کے لیے بسط (البسط) ہے، پھر اس کے بعد قبض (القبض) الٰہی ہوتا ہے، اور یہی نبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے: **\"إِنَّ رَحْمَةَ اللَّهِ سَبَقَتْ غَضَبَهُ\"** (بے شک اللہ کی رحمت اس کے غضب پر سبقت لے گئی)۔\n\nپس اپنی رحمت اور بسط (البسط) کی وجہ سے اس نے مخلوق کو وجود بخشا، اور قبض (القبض) اور بسط (البسط) کا حکم اغیار (الأغيار) کے ثبوت کے بغیر نہیں ہوتا۔ اگر اغیار (الأغيار) نہ ہوتے تو نہ بسط (البسط) متحقق ہوتا اور نہ قبض (القبض)، پس اس حقیقت کو جان لو۔\n\n### [بے شک بندے کا سب سے بڑا بسط (البسط) یہ ہے کہ وہ خالق (خلاق) ہو]\n\nاور جان لو کہ بندے کا سب سے بڑا بسط (البسط) یہ ہے کہ وہ خالق (خلاق) ہو، پس اگر وہ اس بسط (البسط) میں باادب رہے تو وہ اس عموم میں شامل ہے جس کا ذکر اللہ تعالیٰ کے اس فرمان میں ہے: **فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ** (پس بابرکت ہے اللہ، سب سے بہترین خالق)۔ پس اس نے حسن کو خالقین کی طرف منسوب کیا، لیکن اللہ سب سے بہترین خالق ہے، کیونکہ یہ صفت الٰہ کے خاص اوصاف میں سے ہے۔\n\nکیونکہ اس نے بت پرستوں کے رد میں فرمایا: **أَفَمَنْ يَخْلُقُ كَمَنْ لَا يَخْلُقُ** (تو کیا جو پیدا کرتا ہے وہ اس جیسا ہے جو پیدا نہیں کرتا؟)۔ پس اس نے مخلوق سے خلق کی نفی کر دی، اگر وہ مخلوق سے خلق کی عمومی نفی نہ چاہتا تو فرعون اور اس جیسے دیگر مخلوقوں کی عبادت کرنے والوں پر حجت قائم نہ ہوتی جنہیں اللہ کے سوا پوجنے کا حکم دیا گیا۔ اور یہ لوگ ان میں سے نہیں تھے جو اس فرمان **أَحْسَنُ الْخَالِقِينَ** (بہترین خالق) کے عموم میں داخل ہوں، کیونکہ وہ خلق میں احسان سے متصف نہیں تھے۔ کیونکہ بندوں میں احسان یہ ہے کہ تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو، پس تم جان لو کہ حقیقت میں خالق کون ہے۔\n\nپس جب یہ صفت الٰہ کے خاص اوصاف میں سے تھی، اور اس نے خلق کو مخلوق کی طرف منسوب بھی کیا، تو اس نے مخلوق کے لیے جو خلق ثابت کیا تھا، اس میں بہترین ہونے کے لحاظ سے خود کو منفرد کر لیا، اور فرمایا: **أَحْسَنُ الْخَالِقِينَ** (بہترین خالق)۔ اور یہی اللہ تعالیٰ کے اس فرمان کا مفہوم ہے: **فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ** (پس بابرکت ہے اللہ، سب سے بہترین خالق)۔ اور برکت (البرکۃ) زیادتی ہے، پس اس نے اپنے فرمان **أَحْسَنُ الْخَالِقِينَ** میں \"احسن\" (بہترین) کا اضافہ کیا۔\n\nاور اللہ تعالیٰ کا یہ فرمان کتنا خوبصورت ہے: **أَفَرَأَيْتُمْ مَا تُمْنُونَ * أَأَنْتُمْ تَخْلُقُونَهُ أَمْ نَحْنُ الْخَالِقُونَ** (کیا تم نے دیکھا جو تم ٹپکاتے ہو؟ کیا تم اسے پیدا کرتے ہو یا ہم پیدا کرنے والے ہیں؟)۔ اور اس نے یہ نہیں فرمایا کہ کیا تم اس سے یا اس میں پیدا کرتے ہو، بلکہ فرمایا: **تَخْلُقُونَهُ** (کیا تم اسے پیدا کرتے ہو؟)، پس اس نے خاص طور پر منی سے اس کے وجود کی عینیت مراد لی۔\n\nاور اسم المصور (صورت بنانے والا) وہ ہے جو اس میں صورت کھولنے کا ذمہ دار ہے، جو بھی صورت وہ چاہے، جنس کی ہو یا غیر جنس کی، اور یہی اس کا فرمان ہے: **فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ** (جس صورت میں چاہا تجھے جوڑ دیا)۔ پس وہ اسم المصور (صورت بنانے والا) ہے۔ اور یہاں علومِ طبیعت کے کچھ اسرار ہیں، اس اشتراک کی وجہ سے جو اللہ نے ان میں تخلیق (التکوین) میں رکھا ہے۔ تو کیا یہ ان اسباب میں سے ہے جو اپنی ذات کے لیے بذاتِ خود فعل کرتے ہیں، پس ذات حق (الحق) ان کے ذریعے فعل کرتی ہے نہ کہ ان کے پاس، یا یہ ان اسباب میں سے ہے جن کا مسبب ذات حق (الحق) ان کے پاس فعل کرتی ہے نہ کہ ان کے ذریعے؟ اور یہاں غور و فکر کرنے والوں (النظار) کی رائے مختلف ہو جاتی ہے۔\n\nلیکن اہل کشف (الکشف) اسے کشف (الکشف) کے وقت ابتداءً ہی جان لیتے ہیں، بغیر کسی غور و فکر کے، کیونکہ وہ طبیعت کے مرتبے کو جانتے ہیں، اور یہ کہ اس کا مرتبہ تمام حقائق (الحقائق) کے مرتبے جیسا ہے، اور حقائق (الحقائق) تبدیل نہیں ہوتیں، پس وہ انہیں ان کے مقام پر چلاتے ہیں اور ان کی منزل پر اتارتے ہیں۔\n\nپس اللہ کے عالموں کا بسط (البسط) عین علم باللہ ہے، جب وہ جان لیتے ہیں تو وہ جان لیتے ہیں کہ کس نے بسط (البسط) کیا اور کس کے لیے بسط (البسط) ہے، اور وہ جان لیتے ہیں کہ کس نے قبض (القبض) کیا اور کس کے لیے قبض (القبض) ہے۔ پس ان کے نزدیک ہر معاملہ اپنی اصل اور حقیقت پر قائم رہتا ہے، اس میں ان کے ہاں کوئی تبدیلی نہیں ہوتی اور نہ کوئی تحویل، کیونکہ وہ سنت اللہ پر ہیں: **فَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَبْدِيلًا وَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَحْوِيلًا** (پس تم اللہ کی سنت میں ہرگز کوئی تبدیلی نہیں پاؤ گے، اور تم اللہ کی سنت میں ہرگز کوئی تحویل نہیں پاؤ گے)۔ پس اہل سنت اللہ کے لیے بسط (البسط) محقق ہے، کیونکہ بسط (البسط) نشر (پھیلاؤ) ہے، اور نشر (پھیلاؤ) ظہور (الظہور) ہے، اور اگر ظہور (الظہور) نہ ہوتا تو اشیاء کا ادراک نہ ہوتا۔\n\nپس عارفین کا بسط (البسط) یقین پر مبنی ہے،\nاور عام مخلوق کا بسط (البسط) محض گمان اور اندازہ ہے۔\n\nجب آوازیں رحمن کے لیے پست ہو گئیں، تو جبار کے ساتھ کیا حال ہو گا؟\n\nیہ حیا کا خشوع ہے، ذلت کا خشوع نہیں،\nاور یہ تعظیم کی ہیبت اور ادب کا قبض (القبض) ہے۔\n\nاللہ تعالیٰ نے فرمایا: **وَخَشَعَتِ الْأَصْوَاتُ لِلرَّحْمَنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا** (اور آوازیں رحمن کے لیے پست ہو جائیں گی، پس تم سرسراہٹ کے سوا کچھ نہ سنو گے)۔ یہ وہ حکم ہے جس کا تقاضا اس مقام نے کیا۔\n\n### [مخلوق سب کی سب ذات حق (الحق) کے قبضے (القبض) میں ہے]\n\nاور اے میرے قریبی ولی! جان لو کہ مخلوق ذات حق (الحق) کے قبضے (القبض) میں ذات حق (الحق) کے لیے تھی، پھر جب اس نے بسط (البسط) کیا تو وہ عالم کے لیے ظاہر ہو گئی۔\n\nاللہ تعالیٰ نے آدم علیہ السلام سے فرمایا، جبکہ اس کے دونوں ہاتھ بند تھے: \"اے آدم! ان دونوں میں سے جسے چاہو چن لو۔\" تو آدم نے کہا: \"میں نے اپنے رب کا دایاں ہاتھ چنا، اور میرے رب کے دونوں ہاتھ مبارک دائیں ہاتھ ہیں۔\" پس اس نے اسے کھولا (بسط کیا)، تو اس میں آدم اور ان کی ذریت تھی۔ اور اگر وہ دوسرا ہاتھ کھولتا تو اس میں باقی تمام عالم ہوتا۔ پس غور کرو کہ انسان ذات حق (الحق) کے دائیں ہاتھ میں ہے، کیونکہ آدم نے جان لیا تھا کہ دونوں ہاتھوں کے درمیان فرقان (امتیاز) ہے۔ اور اسی لیے انہوں نے ادب سے کہا: \"اور میرے رب کے دونوں ہاتھ مبارک دائیں ہاتھ ہیں۔\" پس انہوں نے اپنی ذات کو دیکھتے ہوئے قوت کو چنا، کیونکہ وہ جانتے تھے کہ وہ صورت پر ہیں اور وہ خلیفہ ہیں، پس انہوں نے جان لیا کہ قوت ان کے لیے ہے، لہٰذا انہوں نے ادب کے ساتھ سب سے قوی کو چنا۔\n\nاور جب مخلوق ذات حق (الحق) میں لپٹی ہوئی تھی، تو وہ خود کو نہیں دیکھتی تھی، حالانکہ وہ اللہ کے لیے مشہود (الشہود) تھی۔ پھر جب بسط (البسط) الٰہی ہوا، تو عالم اپنے لیے ظاہر ہوا، پس اس نے خود کو دیکھا اور اسے بھی دیکھا جو اس کے قبضے (القبض) میں تھا، اپنے شہود (الشہود) سے۔ پس اس نے جان لیا کہ وہ کہاں سے صادر ہوا اور کیسے صادر ہوا، لیکن یہ نہ جان سکا کہ آیا اسے لوٹنا ہے یا نہیں، تو اسے کہا گیا: **وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں) اور **وَإِلَيْهِ تُرْجَعُونَ** (اور تم اسی کی طرف لوٹائے جاؤ گے)۔\n\nاور اس نے جان لیا کہ رجوع (لوٹنا) دراصل اصل کی طرف لوٹنا ہے، اور وہ اصل ہستی (الوجود) کو جان چکا تھا، پس اسے معلوم ہو گیا کہ اسے کہاں لوٹنا ہے۔ اور وہ اصل میں خود کو نہیں جانتا تھا، پس اس نے جان لیا کہ وہ اپنی منزل کی طرف لوٹ رہا ہے، اپنی عینیت کے ظاہر ہونے کے باوجود خود کو نہ جاننے کے ساتھ، جیسا کہ وہ خود کو نہیں دیکھتا تھا جب وہ وجود بخشنے والے کے قبضے (القبض) میں تھا۔\n\nپس عارفین کا انجام اور ان کا رجوع، ان کی عینیت کے ثابت ہونے کے باوجود، اس حقیقت کی طرف ہوتا ہے کہ ذات حق (الحق) ہی ان کی عینیت ہے، نہ کہ وہ خود۔ اور یہ مقام صرف عارفین کے لیے ہوتا ہے، پس وہ اپنے بسط (البسط) کے حال میں مقبوض (قبض میں) ہوتے ہیں، اور کسی عارف کے لیے یہ درست نہیں کہ وہ بسط (البسط) کے بغیر مقبوض (قبض میں) ہو، اور نہ قبض (القبض) کے بغیر مبسوط (بسط میں) ہو۔ اور عارف کے علاوہ جو بھی ہے، جب وہ قبض (القبض) کے حال میں ہوتا ہے تو اس کے لیے بسط (البسط) کا حال نہیں ہوتا، اور جب وہ بسط (البسط) کے حال میں ہوتا ہے تو اس کے لیے قبض (القبض) کا حال نہیں ہوتا۔\n\nپس عارف کو صرف دو ضدوں کو جمع کرنے سے ہی پہچانا جاتا ہے، کیونکہ وہ مکمل حق (الحق) ہے، جیسا کہ ابو سعید الخراز نے کہا، جب ان سے پوچھا گیا کہ آپ نے اللہ کو کیسے پہچانا؟ تو انہوں نے کہا: \"اس کے دو ضدوں کو جمع کرنے سے۔\" کیونکہ اس نے ان دونوں کو اپنی ذات میں جمع ہوتے دیکھا، اور وہ جانتا تھا کہ وہ اس کی صورت پر ہے، اور اس نے اسے یہ فرماتے ہوئے سنا: **هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ** (وہی اول ہے اور وہی آخر ہے، اور وہی ظاہر ہے اور وہی باطن ہے)۔ اور اس نے اس آیت سے اس پر دلیل پکڑی۔\n\nپھر اس نے عالم کی طرف دیکھا تو اسے جسم میں ایک بڑا انسان پایا، اور دیکھا کہ اس نے دو ضدوں کو جمع کر رکھا ہے، کیونکہ اس نے اس میں حرکت اور سکون، اجتماع اور افتراق دیکھا، اور اس میں اضداد کو دیکھا، اور وہ بھی عالم کی صورت پر ہے، جیسا کہ وہ ذات حق (الحق) کی صورت پر ہے۔ پس دیکھو ابو سعید کا یہ قول کتنا عجیب ہے۔ اور اسی مقام کی طرف ذوالنون مصری اپنے مسائل میں اشارہ کرتے تھے، بڑے کو چھوٹے پر وارد کرنے اور وسیع کو تنگ میں داخل کرنے سے، بغیر اس کے کہ تنگ کو وسیع کیا جائے یا وسیع کو تنگ کیا جائے۔ اور ہم اس مسئلے کو اس کتاب کے باب المعرفۃ میں معرفتِ خیال کے تحت مکمل طور پر بیان کر چکے ہیں۔\n\nپس اللہ کے عالموں کا بسط (البسط) وہ بسط (البسط) ہے جو ذات حق (الحق) کی طرف منسوب ہے، بلکہ یہ عین وہی بسط (البسط) ہے جو ذات حق (الحق) کی طرف منسوب ہے، کیونکہ وہ اسی کی طرف لوٹے۔\n\nپس بسط (البسط) الٰہی نہیں تھا (مگر ان کے لیے)،\nکیونکہ وہ محو (الفناء) کے اہل ہیں، اگرچہ انہیں ثابت کیا گیا ہو۔\n\nاور علم الٰہی سے بسط (البسط) کی تحقیق کے لیے یہ مقدار کافی ہے۔",
    "fa": "«باب دویست و نوزدهم در معرفت بسط (البسط) و اسرار آن»\n\n> بسط (البسط) حالی است، اما کسی آن را در نمی‌یابد\n> مگر آن خدایی که ما را در آن برپا داشت.\n> اوست که بر همه کائنات فرمانرواست،\n> و به واسطه اوست هستی (الوجود) که معانی‌اش آشکار می‌شود.\n> و چیزی جز تقدیر (قدر) آن را از ما پنهان نمی‌کند،\n> و اوست که آن را از دیدگان خلق مخفی می‌دارد.\n> اگر اهل نظر باشی، سرکشی (البغي) حکمی است که از آن اوست،\n> و کتاب (قرآن) آن را آورده است اگر درکش کنی.\n> این حکم در عالم خلق جایگاهی ندارد،\n> بلکه در عالم امر و در تجلی (التجلی) اوست.\n\n### [بسط (البسط) عبارت است از حال امید در وقت]\n\nبدان، خداوند تو را توفیق دهد، که بسط (البسط) نزد طایفه (الطائفة) عبارت است از حال امید (الرجاء) در وقت. برخی گفته‌اند: قبض (القبض) و بسط (البسط) عبارت است از گرفتن واردِ وقت به حکم قهر و غلبه. اما بسط (البسط) نزد ما، حالی است که حکم صاحب آن این است که همه چیز را در بر می‌گیرد و هیچ چیز او را در بر نمی‌گیرد. حقیقت بسط (البسط) جز برای کسی که منزلتی رفیع و درجاتی والا دارد، محقق نمی‌شود. پس او با این حال، به حال کسی که در پایین‌ترین درجات است، فرود می‌آید و با او برابر می‌شود. این در جناب الهی در مثل قول خداوند متعال است: **«وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا»** (و به خدا قرض نیکو دهید). و از این هم عظیم‌تر در نزول، این سخن است: **«مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ»** (کیست که به خدا قرض دهد؟). و به خاطر همین بسط (البسط) بود که کسی گفت: **«إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ»** (همانا خدا فقیر است و ما توانگریم). و این سخن تصدیق قول خداوند متعال است: **«وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ»** (و اگر خداوند روزی را بر بندگانش فراخ می‌گرداند، قطعاً در زمین سرکشی می‌کردند). و از بسط (البسط) الهی است قول خداوند متعال: **«يَنْشُرُ رَحْمَتَهُ وَهُوَ الْوَلِيُّ الْحَمِيدُ»** (رحمت خود را می‌گستراند و اوست سرپرست ستوده). و اگر بسط (البسط) الهی نبود، هیچ یک از خلق خدا نمی‌توانست به جمیع اسماء الهی متخلق شود. و عظیم‌ترین تعریف در بسط (البسط) الهی این است: **«إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ»** (همانا پروردگار تو گسترده آمرزش است) و **«يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ»** (ای مردم، شما نیازمندان به سوی خدا هستید). پس چون چنین بسطی (البسط) در دل‌های بندگان جای گرفت، چه بسا در قلب‌هایشان سرکشی (بغي) اثر گذاشت و از منزلت خود تجاوز کردند. چون حق (الحق) دانست که این امر ممکن است در دل برخی بندگان بیماری ایجاد کند، داروی آن را در ادامه آیه قرار داد و آن قول اوست: **«وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ»** (و خداست که بی‌نیاز ستوده است). پس درد و درمان را نازل کرد. و این از نشر رحمت اوست؛ زیرا کسی که در مرتبه پایین‌تر است، اقتضا می‌کند که صاحب بسط (البسط) نباشد. اگر بسط یابد، چاره‌ای ندارد جز اینکه در میدانی جز میدان خود جولان دهد، پس بسط (البسط) از سوی فرد پایین‌تر، سوء ادب محسوب می‌شود. چون حق (الحق) این را دانست، بندگانش را به تخلق به مکارم اخلاق امر کرد و آنان را به خاطر آن ستود و این را از بزرگ‌ترین اعمال بندگان قرار داد. پس آنان به فرمان الهی با این اخلاق ظاهر شدند، و بسطشان عبادت و تقرب به سوی خدا بود. و این از نشر رحمت و وسعت مغفرت و عموم تفضل اوست. پس بسط (البسط) بندگان، بسطی است که پس از قبض (القبض) می‌آید، اما بسط (البسط) حق (الحق) از قبض (القبض) نیست، بلکه بسط (البسط) برای او ابتدایی است، و سپس قبض (القبض) الهی می‌آید. و این همان قول پیامبر (صلی الله علیه و سلم) است: **«إن رحمة الله سبقت غضبه»** (همانا رحمت خدا بر غضبش پیشی گرفته است). پس از رحمت و بسط (البسط) اوست که خلق را ایجاد کرد. و حکم قبض (القبض) و بسط (البسط) جز با ثبوت اغیار محقق نمی‌شود. و اگر اغیار نبودند، نه بسطی (البسط) محقق می‌شد و نه قبض (القبض). پس این را دریاب.\n\n### [همانا از بزرگ‌ترین بسط (البسط) بنده این است که آفریننده باشد]\n\nو بدان که بزرگ‌ترین بسط (البسط) بنده این است که آفریننده (خلاق) باشد. اگر در این بسط (البسط) ادب ورزد، همان کسی است که در عموم قول خداوند متعال ذکر شده است: **«فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ»** (پس پر برکت است خدا، بهترین آفرینندگان). پس احسان را به آفرینندگان اضافه کرد، با این حال خدا بهترین آفرینندگان است، زیرا این صفت از خصوصیات وصف الهی است. چون خداوند متعال در رد بر بت‌پرستان فرمود: **«أَفَمَنْ يَخْلُقُ كَمَنْ لَا يَخْلُقُ»** (آیا کسی که می‌آفریند مانند کسی است که نمی‌آفریند؟). پس خلق را از خلق نفی کرد. اگر قصد نفی عمومی خلق از خلق را نداشت، حجت او بر کسانی که فرعون و امثال او را می‌پرستیدند (کسانی که از مخلوقات امر به پرستش شدند) اقامه نمی‌شد. و اینان از کسانی نبودند که در عموم آفرینندگان از قول **«أَحْسَنُ الْخَالِقِينَ»** داخل شوند، زیرا آنان به احسان در خلق متصف نبودند. احسان در بندگان آن است که خدا را چنان بپرستی که گویی او را می‌بینی، پس بدانی که خالق حقیقی کیست. چون این صفت از خصوصیات وصف الهی بود و او خلق را به خلق نسبت داد، خود را با نظر به آنچه از خلق برای خلق اثبات کرده، به «احسن» (بهترین) در آن منفرد ساخت و فرمود: **«أَحْسَنُ الْخَالِقِينَ»**. و این معنای قول خداوند متعال است: **«فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ»**. و برکت (البركة) به معنای فزونی است، پس «احسن» را در قول **«أَحْسَنُ الْخَالِقِينَ»** افزود. و چه نیکوست قول خداوند متعال: **«أَفَرَأَيْتُمْ مَا تُمْنُونَ * أَأَنْتُمْ تَخْلُقُونَهُ أَمْ نَحْنُ الْخَالِقُونَ»** (آیا آنچه را که فرو می‌ریزید دیده‌اید؟ آیا شما آن را می‌آفرینید یا ما آفریننده‌ایم؟). و نفرمود: آیا شما از آن یا در آن می‌آفرینید، بلکه فرمود: «تَخْلُقُونَهُ» (آن را می‌آفرینید). پس منظور، عین ایجاد آن منیِ خاص است. و اسم «المصور» (صورت‌بخش) است که متولی گشودن صورت در آن است، هر صورتی که بخواهد، از جنس یا غیر آن. و این همان قول اوست: **«فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ»** (در هر صورتی که خواست تو را ترکیب کرد). پس او اسم مصور است. و در اینجا اسراری از علوم طبیعت وجود دارد، به دلیل اشتراکی که خداوند در تکوین (آفرینش) در آن قرار داده است. آیا طبیعت سببی از جمله اسبابی است که به ذات خود برای عین خود فعل می‌کند، به طوری که حق (الحق) به واسطه آن فعل می‌کند نه نزد آن؟ یا از اسبابی است که حق (الحق) مسبب آن را نزد آن فعل می‌کند نه به واسطه آن؟ در اینجا نظر اهل نظر متفاوت است. اما اهل کشف (الکشف)، این را در ابتدا هنگام کشف (الکشف) می‌دانند، بدون نیاز به نظر، زیرا به مرتبه طبیعت آگاهند و می‌دانند که منزلت آن، منزلت همه حقایق (الحقائق) است و حقایق دگرگون نمی‌شوند. پس آن را در مسیر خود جاری می‌سازند و در منزلت خود قرار می‌دهند. پس بسط (البسط) عالمان به خدا، عین علم به خداست. پس چون دانستند، دانستند که چه کسی بسط یافته و بسط از آن کیست، و دانستند که چه کسی قبض یافته و قبض از آن کیست. پس هر امری نزد آنان بر اصل و حقیقت خود باقی می‌ماند و هیچ تبدیل و تحویلی در آن نیست، زیرا آنان بر سنت خدا هستند: **«فَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَبْدِيلًا وَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَحْوِيلًا»** (پس هرگز برای سنت خدا تبدیلی نخواهی یافت و هرگز برای سنت خدا تحویلی نخواهی یافت). پس اهل سنت خدا، بسط (البسط) محقق دارند، زیرا بسط (البسط) نشر است و نشر ظهور است، و اگر ظهور نبود، اشیاء درک نمی‌شدند.\n\n> پس بسط (البسط) عارفان بر یقین است\n> و بسط (البسط) خلق، گمان و حدس است.\n\nهنگامی که صداها در برابر رحمان (الرحمن) خاشع می‌شوند، حال در برابر جبار چگونه خواهد بود؟\n\n> خشوع از روی حیاست، نه خشوع از روی خواری،\n> و هیبت از روی بزرگداشت و قبض (القبض) از روی ادب است.\n\nخداوند متعال فرمود: **«وَخَشَعَتِ الْأَصْوَاتُ لِلرَّحْمَنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا»** (و صداها در برابر [خدای] رحمان فروتن شوند، پس جز زمزمه‌ای نشنوی). حکمی است که موطن آن را اقتضا کرده است.\n\n### [همه خلق در قبضه حق (الحق) هستند]\n\nو ای ولی (الولي) صمیمی، بدان که خلق در قبض (القبض) حق (الحق) برای حق (الحق) بود، پس چون بسط (البسط) یافت، برای عالم ظاهر شد.\n\nخداوند متعال به آدم فرمود در حالی که دو دستش بسته بود: ای آدم، هر کدام را که می‌خواهی انتخاب کن. آدم گفت: دست راست پروردگارم را انتخاب کردم، و هر دو دست پروردگارم دست راست مبارک است. پس آن را گشود، و در آن آدم و ذریه‌اش بودند.\n\nو اگر دیگری را می‌گشود، تمام عالم در آن بود. پس بنگر به قرار گرفتن انسان در دست راست حق (الحق)، زیرا آدم دانست که بین دو دست فرقانی وجود دارد، و به همین دلیل از روی ادب گفت: «و هر دو دست پروردگارم دست راست مبارک است». پس با نظر به خود، قدرت را انتخاب کرد، زیرا می‌دانست که بر صورت (الهی) است و خلیفه است. پس دانست که قدرت از آن اوست و قوی‌تر را با ادب انتخاب کرد. و چون خلق در حق (الحق) درهم پیچیده بود، خود را نمی‌دید، در حالی که مشهود خدا بود. پس چون بسط (البسط) الهی رخ داد، عالم برای خودش ظاهر شد، پس خود را دید و کسی را که در قبضه او بود، از طریق شهود (الشهود) خود دید. پس دانست که از کجا صادر شده و چگونه صادر شده است، اما نمی‌دانست که آیا بازگشتی دارد یا خیر. پس به او گفته شد: **«وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ»** (و همه کارها به سوی او بازگردانده می‌شود) و **«وَإِلَيْهِ تُرْجَعُونَ»** (و به سوی او بازگردانده می‌شوید). و دانست که بازگشت (الرجوع) همانا بازگشت به اصل است، و اصل هستی (الوجود) را دانست، پس دانست که به کجا باز می‌گردد. در حالی که در اصل، خود را نمی‌دانست، پس دانست که به منزل خود باز می‌گردد، نه با علم به خود، بلکه با ظهور عین خود، همان‌طور که خود را شهود (الشهود) نکرد هنگامی که در قبضه موجِد خود بود. پس سرانجام عارفان و بازگشتشان، با ثبوت عینشان، این است که حق (الحق) عین آنهاست نه آنها. و این مقامی است که جز برای عارفان نیست. پس آنان در حال بسط (البسط) خود مقبوضند، و برای هیچ عارفی صحیح نیست که در غیر بسط (البسط) مقبوض باشد، و نه در غیر قبض (القبض) مبسوط باشد. اما غیر عارف، اگر در حال قبض (القبض) باشد، حال بسط (البسط) ندارد، و اگر در حال بسط (البسط) باشد، حال قبض (القبض) ندارد. پس عارف جز با جمع بین دو ضد شناخته نمی‌شود، زیرا او تماماً حق (الحق) است، چنانکه ابوسعید خراز گفت. از او پرسیدند: خدا را به چه شناختی؟ گفت: به جمع کردن او بین دو ضد. زیرا او جمع آن دو را در خود شهود (الشهود) کرد و دانست که بر صورت اوست، و شنید که می‌گوید: **«هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ»** (اوست اول و آخر و ظاهر و باطن). و به همین آیه در این باره استدلال کرد. سپس به عالم نگریست و آن را انسانی بزرگ در جثه دید و دید که بین دو ضد جمع کرده است، زیرا در آن حرکت و سکون، اجتماع و افتراق و اضداد را دید. و او نیز بر صورت عالم است، همان‌طور که بر صورت حق (الحق) است. پس بنگر که این سخن ابوسعید چقدر شگفت‌انگیز است. و ذوالنون مصری در مسائل خود به همین مقام اشاره می‌کرد، از وارد کردن بزرگ بر کوچک و داخل کردن وسیع در تنگ، بدون اینکه تنگ را وسیع کند یا وسیع را تنگ سازد. ما این مسئله را در معرفت خیال (الخیال) از باب معرفت از این کتاب به طور کامل ذکر کرده‌ایم. پس بسط (البسط) عالمان به خدا، عین بسط (البسط) منسوب به حق (الحق) است، بلکه عین بسط (البسط) منسوب به حق (الحق) است، زیرا آنان به سوی او بازگشتند.\n\n> پس بسط (البسط) الهی نبود،\n> آنان اهل محو (فنا) هستند، هرچند که اثبات شوند.\n\nو این مقدار در تحقیق بسط (البسط) از علم الهی کافی است."
  },
  "page_count": 3
}