{
  "id": 157,
  "title": {
    "ar": "الباب السابع والخمسون ومائة في معرفة مقام النبوة الملكية",
    "en": "Chapter One Hundred and Fifty-Seven: Concerning the Knowledge of the Station of Royal Prophethood.",
    "ur": "باب ایک سو ستاونواں: ملوکی نبوت (النبوة الملكية) کے مقام کی معرفت میں",
    "fa": "باب صد و پنجاه و هفتم در معرفت مقام نبوت ملکیه (النبوة الملكية)"
  },
  "content": {
    "ar": "## (الباب السابع والخمسون ومائة في معرفة مقام النبوة الملكية)\n\n\n> أوحى الإله إلى الأملاك تعبده *** يأمره ما لهم في النهي من قدم‏\n\n\n> وهم عبيد اختصاص لا يقابله *** ضد وقد منحوا مفاتح الكرم‏\n\n\n> لا يعرفون خروجا عن أوامره *** ورأسهم ملك سماه بالقلم‏\n\n\n> أعطاه من علمه ما لا يقدره *** خلق وإن له في رتبة القدم‏\n\n\n> حكما كما قال في العرجون خالقنا *** في سورة القلب جل الله من حكم‏\n\n\n> هم أنبياء أحباء بأجمعهم *** بلا خلاف وهم من جملة الأمم‏\n\n\n> لكل شخص من الأملاك مرتبة *** معلومة ظهرت للعين كالعلم‏\n\n\n> وهم على فضلهم على التفاضل في *** تقريبهم ولهم جوامع الكلم‏\n\n\n### [الرسالة جنس حكم يعم الملائكة والجن والإنس‏]\n\n\nقال الله تعالى لإبليس أَسْتَكْبَرْتَ أَمْ كُنْتَ من الْعالِينَ وهم أرفع الأرواح العلوية وليسوا بملائكة من حيث الاسم فإنه موضوع للرسل منهم خاصة فمعنى الملائكة الرسل وهو من المقلوب وأصله مالكة والألوكة الرسالة والمالكة الرسالة فما تختص بجنس دون جنس ولهذا دخل إبليس في الخطاب بالأمر بالسجود لما قال الله لِلْمَلائِكَةِ اسْجُدُوا لأنه ممن كان يستعمل في الرسالة فهو رسول فأمره الله ف أَبى‏ واسْتَكْبَرَ وقالَ أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ وخَلَقْتَهُ من طِينٍ فالرسالة جنس حكم يعم الأرواح الكرام البررة السفرة والجن والإنس فمن كل صنف من أرسل ومنه من لم يرسل‏\n\n\n### [النبوة الملكية خاصة بالملائكة الحافين من حول العرش‏]\n\n\nفالنبوءة الملكية المهموزة لا ينالها إلا الطبقة الأولى الحافون من حول العرش ولهذا يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وأفراد من ملائكة الكرسي والسموات وملائكة العروج وآخر نبي من الملائكة إسماعيل صاحب سماء الدنيا وكل واحد منهم على شريعة من ربه متعبد بعبادة خاصة وذلك قولهم وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ فاعترفوا بأن لهم حدودا يقفون عندها لا يتعدونها ولا معنى للشريعة إلا هذا فإذا أتى الوحي إليهم وسمعوا كلام الله بالوحي ضربوا بأجنحتهم خضعانا يسمعونه كسلسلة على صفوان فيصعقون ما شاء الله ثم ينادون فيفيقون فيقولون ما ذا فيقال لهم ربكم فيقولون الحق وهو قوله تعالى في حقهم حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ قالُوا ما ذا قالَ رَبُّكُمْ قالُوا الْحَقَّ وهُوَ الْعَلِيُّ الْكَبِيرُ فجاءوا في ذكرهم بالاسم العلي في كبريائه إن كان من قولهم فإنه محتمل أن يكون قول الله أو يكون حكاية الحق عن قولهم‏\n\n\n### [العالون هم أرفع الأرواح العلوية]\n\n\nوالعالون هم الذين قالوا لهؤلاء الذين أفاقوا ربكم وهم الذين نادوهم وهم العالون فلهذا جاء بالاسم العلي لأن كل موجود لا يعرف الحق إلا من نفسه‏\nقال صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nفجاء بمن وهي نكرة فعم كل عارف من كل جنس وعلق المعرفة بالربوبية وكذا قال العالون لهؤلاء الذين صعقوا حين استفهموهم ربكم وما قالوا إلهكم وهم العالون فقالوا العلي الكبير\n\n\n### [العبادة على قسمين: ذاتية استحقاقية ووضعية أمرية]\n\n\nواعلم أن العبادة في كل ما سوى الله على قسمين عبادة ذاتية وهي العبادة التي تستحقها ذات الحق وهي عبادة عن تجل إلهي وعبادة وضعية أمرية وهي النبوة فكل من عبده عن أمره ووقف عند حده ك الصَّافَّاتِ صَفًّا فَالزَّاجِراتِ زَجْراً فَالتَّالِياتِ وفَالْمُلْقِياتِ ذِكْراً والنَّاشِطاتِ نَشْطاً والسَّابِحاتِ سَبْحاً فَالسَّابِقاتِ سَبْقاً فَالْمُدَبِّراتِ أَمْراً والْمُرْسَلاتِ عُرْفاً وهم صنف من الملائكة التاليات والنَّاشِراتِ نَشْراً فَالْفارِقاتِ فَرْقاً فَالْمُقَسِّماتِ أَمْراً وهم إخوان المدبرات من الملائكة حضرتهم متجاورة وكل هؤلاء أنبياء ملكيون عبدوا الله بما وصفهم به فهم في مقامهم لا يبرحون إلا من أمر منهم بأمر يبلغه وسيأتي في الرسالة الملكية وهو قول جبريل وما نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ فهم تحت تسخير رب محمد صَلَّى اللهُ عَليهِ وسَلَّم من الاسم الذي يخصه‏\n\n\n### [الملائكة السياحون في الأرض الذين يتبعون مجالس الذكر]\n\n\nولله ملائكة في الأرض سياحون فيها يتبعون مجالس الذكر فإذا وجدوا مجلس ذكر نادى بعضهم بعضا هلموا إلى بغيتكم وهم الملائكة الذي خلقهم الله من أنفاس بنى آدم فينبغي للمذكر أن يراقب الله ويستحيي منه ويكون عالما بما يورده وما ينبغي لجلال الله ويجتنب الطامات في وعظه فإن الملائكة يتأذون إذا سمعوا في الحق وفي المصطفين من عباده ما لا يليق وهم عالمون بالقصص وقد أخبر صَلَّى اللهُ عَليهِ وسَلَّم أن العبد إذا كذب الكذبة تباعد عنه الملك ثلاثين ميلا من نتن ما جاء به‏\n\n\nفتمقته الملائكة\n\n\n### [ما ينبغي للواعظ المذكر أن يذكره في وعظه وتذكيره‏]\n\n\nفإذا علم المذكران مثل هؤلاء يحضرون مجلسه فينبغي له أن يتحرى الصدق ولا يتعرض لما ذكره المؤرخون عن اليهود من زلات من أثنى الله عليهم واجتباهم ويجعل ذلك تفسير الكتاب الله ويقول قال المفسرون وما ينبغي أن يقدم على تفسير كلام الله بمثل هذه الطوام كقصة يوسف وداود وأمثالهم عليهم السلام ومحمد صَلَّى اللهُ عَليهِ وسَلَّم بتأويلات فاسدة وأسانيد واهية عن قوم قالوا في الله ما قد ذكر الله عنهم فإذا أورد المذكر مثل هذا في مجلسه مقتته الملائكة ونفروا عنه ومقته الله ووجد الذي في دينه رخصة يلجأ إليها في معصيته ويقول إذا كانت الأنبياء قد وقعت في مثل هذا فمن أكون أنا وحاشا والله الأنبياء مما نسبت إليهم اليهود لعنهم الله‏\n\n\n### [ما ذكره المؤرخون عن اليهود من زلات الأنبياء]\n\n\nفينبغي للمذكر أن يحترم جلساءه ولا يتعدى ذكر تعظيم الله بما ينبغي لجلاله ويرغب في الجنة ويحذر من النار وأهوال الموقف والوقوف بين يدي الله من أجل من عنده من البطالين المفرطين من البشر وقد ذكرنا في شرح كلام الله فيما ورد من ذكر الأنبياء عليهم السلام من التنزيه في حقهم ما هو شرح على الحقيقة لكلام الله فهؤلاء المذكورون نقلة عن اليهود لا عن كلام الله لما غلب عليهم من الجهل فواجب على المذكر إقامة حرمة الأنبياء عليهم السلام والحياء من الله أن لا يقلدا اليهود فيما قالوا في حق الأنبياء من المثالب ونقلة المفسرين خذلهم الله ومنها مراعاة من يحضر مجلسه من الملائكة السياحين فمن يراعي هذه الأمور ينبغي أن يذكر الناس ويكون مجلسه رحمة بالحاضرين ومنفعة\n\n",
    "en": "## Chapter One Hundred and Fifty-Seven: Concerning the Knowledge of the Station of Angelic Prophethood (مقام النبوة الملكية)\n\nThe God revealed to the Angels their worship,\nCommanding them, for they have no precedence in prohibition.\n\nThey are servants of specialization (اختصاص) which no opposite can confront,\nAnd they have been granted the keys of generosity.\n\nThey know no departure from His commands,\nAnd their chief is an Angel He named the Pen (القلم).\n\nHe gave him of His Knowledge what no creature can estimate,\nAnd indeed, he holds the rank of Pre-eternity (القدم).\n\nA ruling, just as our Creator said concerning the old date-stalk,\nIn the Surah of the Heart (Yasin). Glorified is Allah, the Ruler!\n\nThey are Prophets, beloved ones, all of them,\nWithout dispute, and they are among the totality of nations (الأمم).\n\nFor every individual Angel there is a known Level (مرتبة),\nWhich appears to the eye like a banner (علم).\n\nDespite their excellence, they possess degrees of superiority\nIn their proximity, and they possess the comprehensive words (جوامع الكلم).\n\n### [Messengership (الرسالة) is a category of ruling that encompasses Angels, Jinn, and Humans]\n\nAllah the Exalted said to Iblis: <<أَسْتَكْبَرْتَ أَمْ كُنْتَ من الْعالِينَ>> (Did you become arrogant, or were you among the Exalted Ones?). The Exalted Ones (العالين) are the highest celestial spirits (الأرواح العلوية), and they are not Angels in the specific sense of the name, for that name is reserved only for the Messengers (الرسل) among them. The meaning of *Al-Malā’ikah* (Angels) is the Messengers, and the word is a metathesis (مقلوب); its origin is *mālikah*, and *alūkah* means the message (الرسالة), and *mālikah* means the message. Thus, it is not restricted to one genus over another.\n\nFor this reason, Iblis was included in the address commanding prostration when Allah said: <<لِلْمَلائِكَةِ اسْجُدُوا>> (To the Angels: Prostrate!), because he was among those employed in messengership; he was a messenger. So Allah commanded him, but <<أَبى‏ واسْتَكْبَرَ وقالَ أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ وخَلَقْتَهُ من طِينٍ>> (He refused and was arrogant, and said: 'I am better than him. You created me from fire, and You created him from clay.').\n\nTherefore, Messengership (الرسالة) is a category of ruling that encompasses the noble, righteous, and traveling spirits (الأرواح الكرام البررة السفرة), the Jinn, and Humans. From every class, some are sent as Messengers, and some are not.\n\n### [Angelic Prophethood (النبوة الملكية) is specific to the Angels surrounding the Throne]\n\nAngelic Prophethood (النبوءة الملكية), when vocalized (المهموزة), is attained only by the first stratum: those surrounding the Throne (الحافون من حول العرش). For this reason, <<يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ>> (They glorify with the praise of their Lord). It also includes individuals from the Angels of the Footstool (الكرسي), the Heavens, and the Angels of Ascent (العروج). The last Prophet among the Angels is Isma'il, the master of the lowest heaven.\n\nEvery one of them follows a Law (شريعة) from his Lord, devoted to a specific worship (عبادة خاصة). This is their saying: <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ>> (There is none of us but has a known station). They acknowledged that they have limits (حدودا) at which they stand and which they do not transgress. The Law (الشريعة) means nothing other than this.\n\nWhen the Revelation (الوحي) comes to them, and they hear the Word of Allah through the Revelation, they strike their wings in submission (خضعانا). They hear it like a chain on a smooth rock (كسلسلة على صفوان), and they fall unconscious (يصعقون) for as long as Allah wills. Then they are called, and they awaken, asking: \"What did He say?\" They are told: \"Your Lord.\" They reply: \"The Truth (الحق).\"\n\nThis is His saying concerning them: <<حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ وَهُوَ الْعَلِيُّ الْكَبِيرُ>> (Until, when terror is removed from their hearts, they say: 'What did your Lord say?' They say: 'The Truth, and He is the Exalted, the Great.'). They mentioned the Name *Al-Ali* (The Exalted) in His Grandeur (كبريائه). This may be their own statement, or it may be the recounting of The Real (الحق) concerning their statement.\n\n### [The Exalted Ones (العالون) are the highest celestial spirits]\n\nThe Exalted Ones (العالون) are those who said \"Your Lord\" to those who awoke (from the swoon). They are the ones who called out to them, and they are the Exalted Ones. Therefore, the Name *Al-Ali* (The Exalted) is mentioned, because every existent being only knows The Real (الحق) from its own self.\n\nThe Prophet (peace and blessings be upon him) said: \"Whoever knows his self knows his Lord.\"\n\nThe use of *man* (من - whoever) is indefinite, encompassing every knower (عارف) from every genus, and linking the knowledge to Lordship (الربوبية). Similarly, the Exalted Ones said \"Your Lord\" to those who swooned when they inquired, and they did not say \"Your God\" (إلهكم). And they (the Exalted Ones) replied: \"The Exalted, the Great (العلي الكبير).\"\n\n### [Worship (العبادة) is of two types: Essential/Deserved and Prescribed/Commanded]\n\nKnow that worship (العبادة) for everything other than Allah is of two types: Essential Worship (عبادة ذاتية), which is the worship deserved by the Essence (الذات) of The Real (الحق)—this worship arises from a Divine Theophany (تجل إلهي); and Prescribed/Commanded Worship (عبادة وضعية أمرية), which is Prophethood (النبوة).\n\nEveryone who worships Him by His command and stands at his limit, such as: <<الصَّافَّاتِ صَفًّا>> (Those who set the ranks in rows), <<فَالزَّاجِرَاتِ زَجْرًا>> (Then those who restrain with a restraint), <<فَالتَّالِيَاتِ>> (Then those who recite), <<وَالْمُلْقِيَاتِ ذِكْرًا>> (And those who deliver the remembrance), <<وَالنَّاشِطَاتِ نَشْطًا>> (And those who pull out with violence), <<وَالسَّابِحَاتِ سَبْحًا>> (And those who glide with ease), <<فَالسَّابِقَاتِ سَبْقًا>> (Then those who race each other in a race), <<فَالْمُدَبِّرَاتِ أَمْرًا>> (Then those who arrange the matter), and <<وَالْمُرْسَلَاتِ عُرْفًا>> (And those sent forth in succession)—these are a class of Angels. And <<وَالنَّاشِرَاتِ نَشْرًا>> (And those who spread abroad a spreading), <<فَالْفَارِقَاتِ فَرْقًا>> (Then those who separate with a separation), <<فَالْمُقَسِّمَاتِ أَمْرًا>> (Then those who distribute the command)—these are the brethren of the Arranging Angels (المدبرات), and their Presences (حضراتهم) are adjacent.\n\nAll of these are Angelic Prophets (أنبياء ملكيون) who worshiped Allah according to the description He gave them. They remain in their station (مقامهم) and do not depart unless commanded to convey a matter. This will be discussed in the section on Angelic Messengership (الرسالة الملكية). This is the meaning of Gabriel's saying: <<وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ>> (And we do not descend except by the command of your Lord). They are under the subjugation (تسخير) of the Lord of Muhammad (peace and blessings be upon him), through the Name specific to him.\n\n### [The Angels who roam the Earth following the gatherings of Remembrance (الذكر)]\n\nAllah has Angels on Earth who roam, following the gatherings of Remembrance (مجالس الذكر). When they find such a gathering, they call out to one another: \"Come to your object of desire!\" These are the Angels whom Allah created from the breaths of the children of Adam.\n\nTherefore, the Reminder/Preacher (المذكر) must be mindful of Allah and feel shame before Him. He must be knowledgeable about what he presents and what is appropriate for the Majesty of Allah (جلال الله). He must avoid grave errors (الطامات) in his admonition, for the Angels are offended if they hear anything inappropriate concerning The Real (الحق) or His chosen servants (المصطفين). They are knowledgeable about the stories. The Prophet (peace and blessings be upon him) informed us that when a servant tells a lie, the Angel moves thirty miles away from him due to the stench of what he brought forth. Thus, the Angels despise him.\n\n### [What the Admonisher/Preacher should mention in his admonition and reminder]\n\nIf the Reminder knows that such Angels attend his gathering, he must strive for truthfulness (الصدق). He should not expose the slips (زلات) of those whom Allah praised and chose, which historians have narrated from the Jews. He should not present such narratives as exegesis (تفسير) of the Book of Allah. If he must mention them, he should say: \"The commentators (المفسرون) said...\"\n\nIt is inappropriate to proceed with the exegesis of Allah's Word using such grave errors, such as the stories of Joseph, David, and others (peace be upon them), or Muhammad (peace and blessings be upon him), based on corrupt interpretations (تأويلات فاسدة) and weak chains of transmission (أسانيد واهية) from people who spoke about Allah what He Himself mentioned concerning them (i.e., the Jews).\n\nIf the Reminder presents such things in his gathering, the Angels will despise him and flee from him, and Allah will despise him. Moreover, the person who finds a loophole in his religion will use it to justify his disobedience, saying: \"If the Prophets fell into such things, who am I?\" May Allah forbid that the Prophets committed what the cursed Jews attributed to them!\n\n### [What historians mentioned concerning the slips of the Prophets from the Jews]\n\nThe Reminder must respect his audience and not exceed the mention of Allah's glorification with what is appropriate for His Majesty. He should encourage desire for Paradise and warn against the Fire and the terrors of the Standing (الموقف) before Allah, especially for the sake of the negligent and careless humans (البطالين المفرطين) present.\n\nWe have already mentioned in our commentary on the Word of Allah, regarding the Prophets (peace be upon them), the necessary purification (التنزيه) concerning them, which is the true explanation of Allah's Word. Those who mention these stories are merely transmitters from the Jews, not from the Word of Allah, due to the ignorance that has overcome them.\n\nIt is obligatory upon the Reminder to uphold the sanctity of the Prophets (peace be upon them) and to be ashamed before Allah of imitating the Jews in the defects (المثالب) they attributed to the Prophets, and of imitating the transmitting commentators—may Allah abandon them. This includes observing the presence of the Roaming Angels (الملائكة السياحين) who attend his gathering. Whoever observes these matters should remind the people, and his gathering will be a mercy and a benefit to those present.",
    "ur": "ایک سو ستاونواں باب: نبوت ملکیہ (النبوة الملكية) کے مقام کی معرفت (المعرفۃ) میں\n\nمعبود نے ملائکہ کی طرف وحی کی کہ وہ اس کی عبادت کریں،\nوہ انہیں حکم دیتا ہے، اور انہیں منع کرنے میں کوئی سبقت حاصل نہیں۔\n\nاور وہ خاص بندے ہیں جن کا کوئی مخالف نہیں،\nاور انہیں کرم کی کنجیاں عطا کی گئی ہیں۔\n\nوہ اس کے احکام سے سرتابی نہیں جانتے،\nاور ان کا سردار وہ فرشتہ ہے جسے اس نے قلم (القلم) کا نام دیا۔\n\nاسے اپنے علم میں سے وہ کچھ عطا کیا جو کوئی مخلوق اندازہ نہیں کر سکتی،\nاور اس کے لیے قدم (القدم) کے مرتبے میں ہے۔\n\nایک حکم، جیسا کہ ہمارے خالق نے پرانی ٹہنی کے بارے میں فرمایا،\nسورۃ القلب میں، اللہ کتنا عظیم حاکم ہے۔\n\nوہ سب کے سب بلا اختلاف انبیاء اور محبوب ہیں،\nاور وہ امتوں میں شامل ہیں۔\n\nملائکہ میں سے ہر ایک کے لیے ایک معلوم مرتبہ ہے\nجو آنکھ کے لیے علم کی طرح ظاہر ہے۔\n\nوہ اپنے فضل کے باوجود قربت میں ایک دوسرے پر فضیلت رکھتے ہیں،\nاور انہیں جوامع الکلم (جامع کلمات) عطا کیے گئے ہیں۔\n\n### [رسالت ایک نوعی حکم ہے جو ملائکہ، جن اور انسانوں سب کو شامل ہے]\n\nاللہ تعالیٰ نے ابلیس سے فرمایا: \"کیا تو نے تکبر کیا یا تو بلند مرتبہ والوں (الْعالِينَ) میں سے تھا؟ (أَسْتَكْبَرْتَ أَمْ كُنْتَ من الْعالِينَ)\"۔ اور وہ بلند روحانی ہستیوں میں سب سے اعلیٰ ہیں، لیکن نام کے لحاظ سے وہ ملائکہ نہیں ہیں، کیونکہ یہ نام خاص طور پر ان میں سے رسولوں کے لیے وضع کیا گیا ہے۔ پس ملائکہ کا معنی رسول ہے، اور یہ مقلوب (الٹا) ہے، اس کی اصل \"مالکہ\" ہے، اور \"الُوکہ\" رسالت (الرسالة) ہے، اور \"مالکہ\" بھی رسالت ہے۔ لہٰذا یہ کسی ایک نوع کے ساتھ خاص نہیں ہے۔ اسی وجہ سے ابلیس بھی سجدے کے حکم کے خطاب میں شامل تھا جب اللہ نے فرمایا: \"ملائکہ کو سجدہ کرو (لِلْمَلائِكَةِ اسْجُدُوا)\"، کیونکہ وہ ان میں سے تھا جسے رسالت میں استعمال کیا جاتا تھا، پس وہ رسول تھا۔ اللہ نے اسے حکم دیا تو اس نے انکار کیا اور تکبر کیا اور کہا: \"میں اس سے بہتر ہوں، تو نے مجھے آگ سے پیدا کیا اور اسے مٹی سے پیدا کیا۔ (أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ وخَلَقْتَهُ من طِينٍ)\"۔ پس رسالت ایک نوعی حکم ہے جو تمام بزرگ، نیک، سفیر ارواح، جن اور انسانوں کو شامل ہے۔ چنانچہ ہر صنف میں سے کچھ کو رسول بنایا گیا اور کچھ کو نہیں بنایا گیا۔\n\n### [نبوت ملکیہ (النبوة الملكية) خاص ہے ان ملائکہ کے لیے جو عرش (العرش) کے گرد حلقہ بنائے ہوئے ہیں]\n\nپس ہمزہ والی نبوت ملکیہ (النبوة الملكية) صرف پہلی جماعت کو حاصل ہوتی ہے جو عرش (العرش) کے گرد حلقہ بنائے ہوئے ہیں، اور اسی لیے وہ \"اپنے رب کی حمد کے ساتھ تسبیح کرتے ہیں (يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ)\"۔ اور کرسی (الكرسي) اور آسمانوں کے ملائکہ میں سے چند افراد، اور عروج کے ملائکہ بھی۔ اور ملائکہ میں آخری نبی اسماعیل ہیں جو آسمان دنیا کے مالک ہیں۔ ان میں سے ہر ایک اپنے رب کی طرف سے ایک شریعت پر ہے اور ایک خاص عبادت میں مشغول ہے۔ اور یہی ان کا قول ہے: \"اور ہم میں سے کوئی نہیں مگر اس کے لیے ایک معلوم مقام ہے (وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ)\"۔ پس انہوں نے اعتراف کیا کہ ان کے لیے حدود ہیں جہاں وہ ٹھہر جاتے ہیں اور ان سے تجاوز نہیں کرتے، اور شریعت کا معنی اس کے سوا کچھ نہیں۔ جب ان کے پاس وحی آتی ہے اور وہ وحی کے ذریعے اللہ کا کلام سنتے ہیں تو وہ عاجزی سے اپنے پر مارتے ہیں، وہ اسے ایسے سنتے ہیں جیسے کسی سخت پتھر پر زنجیر کی آواز ہو۔ پھر وہ اللہ کی مشیت کے مطابق بے ہوش ہو جاتے ہیں، پھر انہیں پکارا جاتا ہے تو وہ ہوش میں آتے ہیں اور کہتے ہیں: \"کیا کہا گیا؟\" تو انہیں کہا جاتا ہے: \"تمہارے رب نے۔\" تو وہ کہتے ہیں: \"حق (الحق)\"۔ اور یہی ان کے حق میں اللہ تعالیٰ کا قول ہے: \"یہاں تک کہ جب ان کے دلوں سے گھبراہٹ دور کی جاتی ہے تو وہ کہتے ہیں: تمہارے رب نے کیا فرمایا؟ وہ کہتے ہیں: حق (الحق) فرمایا، اور وہ بلند و بالا، بہت بڑا ہے (حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ وَهُوَ الْعَلِيُّ الْكَبِيرُ)\"۔ پس انہوں نے اپنے ذکر میں اسمِ علی (العلي) کو اس کی کبریائی میں لایا، اگر یہ ان کا قول ہے، کیونکہ یہ احتمال ہے کہ یہ اللہ کا قول ہو یا ان کے قول کی طرف سے حق (الحق) کی حکایت ہو۔\n\n### [بلند مرتبہ والے (العالون) سب سے اعلیٰ روحانی ہستیاں ہیں]\n\nاور بلند مرتبہ والے (العالون) وہ ہیں جنہوں نے ہوش میں آنے والوں سے کہا: \"تمہارا رب۔\" اور وہی ہیں جنہوں نے انہیں پکارا، اور وہی بلند مرتبہ والے (العالون) ہیں۔ اسی لیے اسمِ علی (العلي) لایا گیا، کیونکہ ہر موجود ہستی (الوجود) ذات حق (الحق) کو صرف اپنے نفس سے پہچانتی ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا۔ (من عرف نفسه عرف ربه)\"\n\nپس \"مَن\" (جو) لایا گیا جو کہ نکرہ ہے، لہٰذا یہ ہر نوع کے ہر عارف کو شامل ہے، اور معرفت (المعرفۃ) کو ربوبیت کے ساتھ جوڑ دیا۔ اسی طرح بلند مرتبہ والوں (العالون) نے ان بے ہوش ہونے والوں سے کہا جب انہوں نے ان سے پوچھا: \"تمہارا رب۔\" اور انہوں نے \"تمہارا معبود\" نہیں کہا، اور وہ بلند مرتبہ والے (العالون) تھے، تو انہوں نے کہا: \"العلی الکبیر (بلند و بالا، بہت بڑا)\"۔\n\n### [عبادت دو قسموں پر ہے: ذاتی استحقاقی اور وضعی امری]\n\nاور جان لو کہ اللہ کے سوا ہر چیز میں عبادت دو قسموں پر ہے: ایک ذاتی عبادت، اور یہ وہ عبادت ہے جس کی ذات حق (الحق) مستحق ہے، اور یہ ظہور الٰہی (التجلی) سے حاصل ہونے والی عبادت ہے۔ دوسری وضعی امری عبادت، اور یہی نبوت ہے۔ پس ہر وہ ہستی جس نے اس کے حکم سے اس کی عبادت کی اور اپنی حد پر ٹھہر گئی، جیسے: \"صف باندھ کر کھڑے ہونے والے (الصَّافَّاتِ صَفًّا)، پھر جھڑک کر روکنے والے (فَالزَّاجِراتِ زَجْراً)، پھر تلاوت کرنے والے (فَالتَّالِياتِ)\"، اور \"پھر ذکر ڈالنے والے (فَالْمُلْقِياتِ ذِكْراً)\"، اور \"آسانی سے کھینچنے والے (وَالنَّاشِطَاتِ نَشْطًا)، اور تیزی سے تیرنے والے (وَالسَّابِحَاتِ سَبْحًا)، پھر سبقت لے جانے والے (فَالسَّابِقَاتِ سَبْقًا)، پھر کاموں کی تدبیر کرنے والے (فَالْمُدَبِّرَاتِ أَمْرًا)\"، اور \"بھلائی کے ساتھ بھیجے جانے والے (وَالْمُرْسَلَاتِ عُرْفًا)\"، اور یہ ملائکہ کی ایک صنف ہے، \"اور پھیلانے والے (وَالنَّاشِرَاتِ نَشْرًا)، پھر فرق کرنے والے (فَالْفَارِقَاتِ فَرْقًا)، پھر کاموں کو تقسیم کرنے والے (فَالْمُقَسِّمَاتِ أَمْرًا)\"، اور یہ مدبرات ملائکہ کے بھائی ہیں، ان کی حضرات (حضوریاں) ایک دوسرے کے قریب ہیں۔ اور یہ سب کے سب ملکی نبی ہیں جنہوں نے اللہ کی عبادت اس طرح کی جس طرح اس نے انہیں بیان کیا، پس وہ اپنے مقام پر قائم رہتے ہیں، سوائے اس کے کہ ان میں سے کسی کو کوئی حکم پہنچانے کا حکم دیا جائے، اور یہ رسالت ملکیہ میں آئے گا، اور یہی جبرائیل کا قول ہے: \"اور ہم نہیں اترتے مگر آپ کے رب کے حکم سے (وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ)\"۔ پس وہ سب محمد صلی اللہ علیہ وسلم کے رب کے تسخیر میں ہیں، اس اسم کے ذریعے جو آپ صلی اللہ علیہ وسلم کے ساتھ خاص ہے۔\n\n### [زمین میں گھومنے والے ملائکہ جو ذکر کی مجالس کی پیروی کرتے ہیں]\n\nاور اللہ کے لیے زمین میں گھومنے والے ملائکہ ہیں جو ذکر کی مجالس کی پیروی کرتے ہیں۔ جب وہ ذکر کی کوئی مجلس پاتے ہیں تو ایک دوسرے کو پکارتے ہیں: \"آؤ، اپنی مطلوبہ چیز کی طرف!\" اور یہ وہ ملائکہ ہیں جنہیں اللہ نے بنی آدم کے سانسوں سے پیدا کیا ہے۔ لہٰذا واعظ کو چاہیے کہ وہ اللہ کا مراقبہ کرے اور اس سے حیا کرے، اور اس بات کا علم رکھے کہ وہ کیا بیان کر رہا ہے اور کیا اللہ کے جلال کے لائق ہے، اور اپنے وعظ میں بڑی غلطیوں سے بچے، کیونکہ ملائکہ کو تکلیف ہوتی ہے جب وہ ذات حق (الحق) کے بارے میں اور اس کے چنے ہوئے بندوں کے بارے میں ایسی باتیں سنتے ہیں جو لائق نہیں ہوتیں۔ اور وہ قصوں کو جاننے والے ہیں۔ اور نبی اکرم صلی اللہ علیہ وسلم نے خبر دی ہے کہ جب بندہ کوئی جھوٹ بولتا ہے تو فرشتہ اس کی بدبو کی وجہ سے تیس میل دور ہو جاتا ہے۔ پس ملائکہ اس سے نفرت کرتے ہیں۔\n\n### [واعظ کو اپنے وعظ اور تذکیر میں کیا بیان کرنا چاہیے]\n\nپس جب واعظ کو معلوم ہو کہ ایسے ملائکہ اس کی مجلس میں حاضر ہوتے ہیں، تو اسے چاہیے کہ وہ سچائی کی تلاش کرے اور ان لغزشوں کا ذکر نہ کرے جو مؤرخین نے ان ہستیوں کے بارے میں یہودیوں سے نقل کی ہیں جن کی اللہ نے تعریف کی اور انہیں چن لیا، اور اسے اللہ کی کتاب کی تفسیر قرار دے کر یہ کہے کہ مفسرین نے ایسا کہا ہے۔ اور یہ مناسب نہیں کہ اللہ کے کلام کی تفسیر میں ایسی بڑی غلطیوں کو پیش کیا جائے، جیسے یوسف اور داؤد علیہم السلام اور محمد صلی اللہ علیہ وسلم کے قصے، جنہیں فاسد تاویلات اور کمزور اسناد کے ساتھ ان لوگوں سے نقل کیا گیا جنہوں نے اللہ کے بارے میں وہ باتیں کہیں جن کا ذکر اللہ نے خود ان کے بارے میں کیا ہے۔ پس جب واعظ اپنی مجلس میں ایسی باتیں بیان کرتا ہے تو ملائکہ اس سے نفرت کرتے ہیں اور دور بھاگ جاتے ہیں، اور اللہ بھی اس سے نفرت کرتا ہے، اور وہ شخص جو اپنے دین میں کوئی رخصت تلاش کرتا ہے، اسے اپنی نافرمانی میں پناہ لینے کا موقع مل جاتا ہے اور وہ کہتا ہے کہ جب انبیاء کو ایسی لغزشیں ہوئیں تو میں کون ہوں؟ اللہ کی پناہ، انبیاء ان باتوں سے پاک ہیں جو لعنتی یہودیوں نے ان کی طرف منسوب کیں۔\n\n### [وہ باتیں جو مؤرخین نے یہودیوں سے انبیاء کی لغزشوں کے بارے میں نقل کی ہیں]\n\nپس واعظ کو چاہیے کہ وہ اپنے ہم نشینوں کا احترام کرے اور اللہ کی تعظیم کے ذکر سے تجاوز نہ کرے جو اس کے جلال کے لائق ہے، اور جنت کی رغبت دلائے اور جہنم کے خوف اور میدان حشر کی ہولناکیوں اور اللہ کے حضور کھڑے ہونے سے ڈرائے، ان سست اور غفلت شعار انسانوں کی خاطر جو اس کے پاس موجود ہیں۔ اور ہم نے اللہ کے کلام کی شرح میں انبیاء علیہم السلام کے ذکر کے بارے میں ان کی پاکیزگی کا جو بیان کیا ہے، وہ اللہ کے کلام کی حقیقی شرح ہے۔ پس یہ مذکورہ باتیں نقل کرنے والے یہودیوں سے نقل کرتے ہیں نہ کہ اللہ کے کلام سے، کیونکہ ان پر جہالت غالب آ گئی ہے۔ لہٰذا واعظ پر واجب ہے کہ وہ انبیاء علیہم السلام کی حرمت قائم رکھے اور اللہ سے حیا کرے کہ وہ یہودیوں کی پیروی نہ کرے ان عیبوں میں جو انہوں نے انبیاء کے حق میں بیان کیے، اور ان مفسرین کے ناقلین کو اللہ ذلیل کرے۔ اور ان امور میں سے ایک یہ بھی ہے کہ وہ اپنی مجلس میں حاضر ہونے والے گھومنے والے ملائکہ کی رعایت کرے۔ پس جو شخص ان امور کی رعایت کرتا ہے، اسے چاہیے کہ وہ لوگوں کو نصیحت کرے اور اس کی مجلس حاضرین کے لیے رحمت اور فائدہ کا باعث ہو۔",
    "fa": "باب صد و پنجاه و هفتم: در معرفت مقام نبوت مَلَکی (النبوة الملكية)\n\nحق (الإله) به فرشتگان وحی کرد تا او را بپرستند،\nبه آنان فرمان می‌دهد، در نهی کردن هیچ قدمی ندارند.\n\nو آنان بندگان اختصاصی هستند که ضدی در مقابلشان نیست،\nو کلیدهای کرم به ایشان عطا شده است.\n\nخروج از اوامر او را نمی‌شناسند،\nو رئیسشان فرشته‌ای است که او را قلم (القلم) نامیده است.\n\nاز علم خود به او چیزی بخشیده که هیچ خلقی قادر به اندازه‌گیری آن نیست،\nو او در مرتبه قِدَم جایگاهی دارد.\n\nحکمی، چنان که خالق ما در سوره قلب (سوره یس) درباره عرجون (خوشه خرما) فرمود،\nپاک و منزه است خداوند از هر حکمی.\n\nآنان همگی پیامبران و دوستان (أحباء) هستند،\nبدون هیچ اختلافی، و از جمله امت‌ها به شمار می‌آیند.\n\nبرای هر یک از فرشتگان مرتبه‌ای معلوم است،\nکه برای چشم مانند نشانه (العلم) آشکار شده است.\n\nو با وجود فضلشان، در نزدیکی (تقریب) به حق (الحق) با یکدیگر تفاوت دارند،\nو جوامع الکلم (جوامع الكلم) از آنِ ایشان است.\n\n### [رسالت (الرسالة) جنسی از حکم است که فرشتگان، جن و انسان را در بر می‌گیرد]\n\nخداوند متعال به ابلیس فرمود: «آیا تکبر ورزیدی یا از بلندمرتبگان (الْعالِينَ) بودی؟» (ص: ۷۵). و عالین (الْعالِينَ) والاترین ارواح علوی هستند و از حیث نام، فرشته نیستند؛ زیرا این نام (ملائکه) به طور خاص برای رسولان از میان آنان وضع شده است. پس معنای ملائکه، رسولان است و این از مقلوب (کلمه‌ای که حروفش جابه‌جا شده) است و اصل آن \"مالِکة\" است و \"ألوکه\" به معنای رسالت است و \"مالِکة\" نیز به معنای رسالت است. بنابراین، رسالت به جنس خاصی محدود نمی‌شود. به همین دلیل، ابلیس در خطاب امر به سجده وارد شد، آنجا که خداوند فرمود: «به فرشتگان (لِلْمَلائِكَةِ) سجده کنید» (بقره: ۳۴)، زیرا او از کسانی بود که در رسالت به کار گرفته می‌شد، پس او رسول بود. خداوند به او امر کرد، اما او «سر باز زد (أَبى) و تکبر ورزید (اسْتَكْبَرَ) و گفت: من از او بهترم؛ مرا از آتش آفریدی و او را از گِل (طِينٍ) آفریدی» (ص: ۷۶). پس رسالت (الرسالة) جنسی از حکم است که ارواح گرامی، نیکوکار و سفیر (السفرة)، جن و انسان را در بر می‌گیرد. از هر صنفی کسانی فرستاده شده‌اند و کسانی نیز فرستاده نشده‌اند.\n\n### [نبوت مَلَکی (النبوة الملكية) مخصوص فرشتگان حافّ اطراف عرش است]\n\nپس نبوت مَلَکی (النبوة الملكية) که با همزه تلفظ می‌شود، تنها نصیب طبقه اول، یعنی فرشتگان حافّ اطراف عرش (العرش) می‌شود. به همین دلیل است که آنان «پروردگارشان را با حمد تسبیح می‌گویند» (غافر: ۷). و همچنین افراد خاصی از فرشتگان کرسی و آسمان‌ها و فرشتگان عروج. و آخرین پیامبر از فرشتگان، اسماعیل، صاحب آسمان دنیا است. هر یک از آنان بر شریعتی از جانب پروردگار خود هستند و به عبادتی خاص متعبدند. این همان سخن آنان است که: «و هیچ یک از ما نیست مگر آنکه برای او مقامی معلوم است (مَقامٌ مَعْلُومٌ)» (صافات: ۱۶۴). پس اعتراف کردند که برایشان حدودی است که در آنجا توقف می‌کنند و از آن تجاوز نمی‌کنند، و شریعت معنایی جز این ندارد. هنگامی که وحی به آنان می‌رسد و کلام خدا را با وحی می‌شنوند، از سر خضوع بال‌های خود را به هم می‌زنند و آن را مانند صدای زنجیر بر سنگ صاف می‌شنوند، پس تا هر زمان که خدا بخواهد مدهوش می‌شوند (صعقون). سپس ندا داده می‌شوند و به هوش می‌آیند، پس می‌گویند: «پروردگارتان چه گفت؟» به آنان گفته می‌شود: «حق (الحق) را گفت.» و این همان قول خداوند متعال در حق آنان است: «تا هنگامی که ترس از دل‌هایشان برطرف شود، می‌گویند: پروردگارتان چه گفت؟ می‌گویند: حق (الْحَقَّ) را گفت، و او بلندمرتبه و بزرگ است (الْعَلِيُّ الْكَبِيرُ)» (سبأ: ۲۳). پس در ذکر خود، اسم «العلی» را در کبریایی او آوردند، اگر این از قول خودشان باشد، زیرا محتمل است که این قول خداوند باشد یا حکایت حق (الحق) از قول آنان.\n\n### [عالین (العالون) والاترین ارواح علوی هستند]\n\nو عالین (العالون) کسانی هستند که به این به هوش آمدگان گفتند: «پروردگارتان». و آنان کسانی هستند که به ایشان ندا دادند و آنان عالین هستند. به همین دلیل اسم «العلی» (بلندمرتبه) آمد، زیرا هر موجودی حق (الحق) را جز از نفس خود نمی‌شناسد.\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «هر کس خود را شناخت، پروردگارش را شناخت (من عرف نفسه عرف ربه)».\n\nپس با کلمه «مَن» (هر کس) آمد که نکره است و شامل هر عارف از هر جنسی می‌شود و معرفت (المعرفة) را به ربوبیت پیوند داد. همچنین عالین (العالون) به این کسانی که مدهوش شده بودند، هنگامی که از آنان پرسیدند، گفتند: «پروردگارتان» و نگفتند «معبودتان»؛ و آنان عالین هستند، پس گفتند: «العلی الکبیر» (بلندمرتبه بزرگ).\n\n### [عبادت (العبادة) بر دو قسم است: ذاتی استحقاقی و وضعی امری]\n\nبدان که عبادت (العبادة) در هر آنچه غیر خداست بر دو قسم است: عبادت ذاتی (عبادة ذاتية) و آن عبادتی است که ذات حق (الحق) مستحق آن است و این عبادت ناشی از تجلی الهی (تجلی إلهي) است؛ و عبادت وضعی امری (عبادة وضعية أمرية) و آن همان نبوت است. پس هر کس او را به امرش عبادت کند و در حد خود توقف نماید، مانند: «سوگند به صف‌بستگان (الصَّافَّاتِ صَفًّا)، پس به بازدارندگان (فَالزَّاجِراتِ زَجْراً)، پس به تلاوت‌کنندگان (فَالتَّالِياتِ)» (صافات: ۱-۳) و «سوگند به افکندگان ذکر (فَالْمُلْقِياتِ ذِكْراً)» (مرسلات: ۵) و «سوگند به بیرون‌کشندگان به نرمی (النَّاشِطاتِ نَشْطاً)» (نازعات: ۲) و «سوگند به شناوران (السَّابِحاتِ سَبْحاً)» (نازعات: ۳) و «پس به پیشی‌گیرندگان در سبقت (فَالسَّابِقاتِ سَبْقاً)» (نازعات: ۴) و «پس به تدبیرکنندگان امر (فَالْمُدَبِّراتِ أَمْراً)» (نازعات: ۵) و «سوگند به فرستادگان پی در پی (الْمُرْسَلاتِ عُرْفاً)» (مرسلات: ۱) که آنان صنفی از فرشتگان هستند، و «تلاوت‌کنندگان (التاليات)» و «سوگند به منتشرکنندگان به انتشار (النَّاشِراتِ نَشْراً)» (مرسلات: ۳) و «پس به جداکنندگان به جدایی (فَالْفارِقاتِ فَرْقاً)» (مرسلات: ۴) و «پس به تقسیم‌کنندگان امر (فَالْمُقَسِّماتِ أَمْراً)» (ذاریات: ۴) که آنان برادران مدبرات از فرشتگان هستند و حضرتشان (حضورشان) در کنار یکدیگر است. همه اینها پیامبران مَلَکی (أنبياء ملكيون) هستند که خدا را به آنچه وصفشان کرده، عبادت نموده‌اند. پس آنان در مقام خود ثابت هستند و جز به امر ابلاغی که به آنان داده شود، از آنجا خارج نمی‌شوند. و این در بخش رسالت مَلَکی (الرسالة الملكية) خواهد آمد و آن قول جبرئیل است که: «و ما جز به فرمان پروردگارت نازل نمی‌شویم (وَما نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ)» (مریم: ۶۴). پس آنان تحت تسخیر پروردگار محمد (صَلَّى اللهُ عَليهِ وسَلَّم) از اسمی هستند که مخصوص اوست.\n\n### [فرشتگان سیاح در زمین که مجالس ذکر را دنبال می‌کنند]\n\nو خداوند را فرشتگانی است که در زمین سیاحت می‌کنند و مجالس ذکر را دنبال می‌نمایند. هنگامی که مجلس ذکری می‌یابند، برخی به برخی دیگر ندا می‌دهند: «بیایید به سوی گمشده خودتان.» اینان فرشتگانی هستند که خداوند آنان را از انفاس بنی آدم آفریده است. پس شایسته است که ذاکر (مذکر) مراقب خدا باشد و از او حیا کند و عالم به آنچه وارد می‌کند و آنچه شایسته جلال خداست باشد و از سخنان سخیف (الطامات) در وعظ خود دوری کند؛ زیرا فرشتگان هنگامی که در حق (الحق) و در مورد برگزیدگان از بندگانش سخنی ناشایست بشنوند، آزرده می‌شوند. آنان به قصص آگاهند. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داده است که بنده هنگامی که دروغی می‌گوید، فرشته به دلیل بوی گندی که از آن دروغ می‌آید، سی مایل از او دور می‌شود.\n\nپس فرشتگان از او بیزار می‌شوند.\n\n### [آنچه شایسته است واعظ ذاکر در وعظ و تذکر خود بیان کند]\n\nپس هنگامی که ذاکر بداند چنین کسانی در مجلس او حاضر می‌شوند، شایسته است که در پی صدق باشد و به آنچه مورخان از یهود درباره لغزش‌های کسانی که خداوند آنان را ستوده و برگزیده، ذکر کرده‌اند، نپردازد. و نباید آن را تفسیر کتاب خدا قرار دهد و بگوید: «مفسران چنین گفته‌اند.» و شایسته نیست که با چنین سخنان سخیفی (الطوام)، مانند داستان یوسف و داوود و امثال ایشان (علیهم السلام) و محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، با تأویلات فاسد و اسناد سست از قومی که درباره خدا سخنانی گفته‌اند که خداوند خود از آنان یاد کرده است، اقدام به تفسیر کلام خدا کند. اگر ذاکر چنین مطالبی را در مجلس خود بیاورد، فرشتگان از او بیزار می‌شوند و از او دور می‌گردند و خداوند نیز او را مورد غضب قرار می‌دهد. و کسی که در دینش رخصتی می‌یابد تا به آن در معصیت خود پناه ببرد، می‌گوید: «اگر پیامبران نیز دچار چنین لغزش‌هایی شده‌اند، من دیگر که هستم؟» و حاشا که پیامبران (علیهم السلام) از آنچه یهود (لعنهم الله) به آنان نسبت داده‌اند، مبرا باشند.\n\n### [آنچه مورخان از یهود درباره لغزش‌های پیامبران ذکر کرده‌اند]\n\nپس شایسته است که ذاکر به حاضران در مجلس خود احترام بگذارد و از ذکر تعظیم خداوند به آنچه شایسته جلال اوست، فراتر نرود و مردم را به بهشت ترغیب کند و از آتش و هول‌های روز قیامت و ایستادن در پیشگاه خدا بترساند، به خاطر وجود افراد بطّال و کوتاهی‌کننده از بشر که در میان حاضران هستند. ما در شرح کلام خدا، در آنچه درباره پیامبران (علیهم السلام) آمده، تنزیهی را در حق آنان ذکر کرده‌ایم که شرحی بر حقیقت کلام خداست. این افراد مذکور (که لغزش‌ها را نقل می‌کنند) ناقلان از یهود هستند، نه از کلام خدا، به دلیل جهلی که بر آنان غلبه کرده است. پس بر ذاکر واجب است که حرمت پیامبران (علیهم السلام) را حفظ کند و از خدا حیا کند که از یهود در آنچه درباره پیامبران از عیوب گفته‌اند، تقلید نکند. و همچنین باید مراعات حال فرشتگان سیاح حاضر در مجلس خود را بنماید. پس کسی که این امور را رعایت کند، شایسته است که مردم را تذکر دهد و مجلس او رحمت و منفعت برای حاضران باشد."
  },
  "page_count": 2
}