{
  "id": 165,
  "title": {
    "ar": "الباب الخامس والستون ومائة في معرفة مقام التحقيق والمحققين",
    "en": "Chapter One Hundred and Sixty-Five: Concerning the Knowledge of the Station of Realization (مقام التحقيق) and the Realizers (المحققين).",
    "ur": "باب ایک سو پینسٹھ (۱۶۵): مقامِ التحقیق (مقام التحقیق) اور المحققین (المحققین) کی معرفت کے بیان میں",
    "fa": "باب صد و شصت و پنجم در معرفت مقام التحقیق و محققان"
  },
  "content": {
    "ar": "## (الباب الخامس والستون ومائة في معرفة مقام التحقيق والمحققين)\n\n\n> الحق في حق الطبيعة *** كالآل تبصره بقيعة\n\n\n> فتظنه ماء فتاب *** لعين مائك أن تضيعه‏\n\n\n> انظر وحقق ما رأيت *** فربما كانت خديعة\n\n\n> صور التجلي هكذا *** الحق فيها كالوديعة\n\n\n> وأتت بها نكرا و*** إقرارا نصوص في الشريعة\n\n\n> لا تلتفت للقاع وانظر *** في منازلك الرفيعة\n\n\n> تجد المعمى ينجلي *** من خلف أستار بديعة\n\n\n> في غير شكل لا ولا *** صور تؤلفها الطبيعة\n\n\n> فإذا رأيت الحق *** فارجع والتزم سد الذريعة\n\n\n> وأنطق بما نطق الحديث *** به من ألفاظ شنيعة\n\n\n> وإذا عزيزة نازعتك *** فقل لها كوني مطيعه‏\n\n\n> كوني الكتومة لا تكوني *** بين صحبك بالمذيعة\n\n\n> وإذا دعيت بمثل ذا *** كوني المجيبة والسميعة\n\n\n> جمل صنيعك في القبول *** فقد تجازى بالصنيعة\n\n\n### [أن التحقيق هو المقام الذي لا يقبل الشبه‏]\n\n\nاعلم أيدك الله أن التحقيق هو المقام الذي لا يقبل الشبه القادحة فيه وصاحب هذا النعت هو المحقق فالتحقيق معرفة ما يجب لكل شي‏ء من الحق الذي تطلبه ذاته فيوفيه ذلك علما فإن اتفق أن يعامله به حالا فهو الذي ظهر عليه سلطان التحقيق وإن لم يظهر عليه فهو عالم بأنه أخطأ ولا يقدح ذلك الخطاء في تحقيقه لأنه بصير بنفسه وبما أخطأ فيه لأنه أخطأ عن تعمل وهنا سر إلهي وهو أن الله هو الحكيم المطلق وهو الواضع للأمور في مواضعها وهو الذي أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فليس في الكون خطأ بنسبة الترتيب لله وقد علم رب هذا التحقيق والمحقق به إن الأمر هكذا هو وقد علم أنه أخطأ ولكن بالنسبة إلى ما أمر به لا بالنسبة إلى ما هو الأمر عليه من حيث إن الله هو الواضع له في ذلك المحل المسمى هذا\nالفعل خطأ فصاحب التحقيق مأجور في خطئه أي مثنى عليه عند الله كالمجتهد ما هو مخطئ في نفس الأمر فإن حكمه مقرر وإنما خطؤه بالنسبة إلى غيره حيث لم يوافق دليله دليل غيره وكل شرع وكل حق فهكذا منزلة التحقيق والمحققين‏\n\n\n### [في شروط المحققين‏]\n\n\nومن شرط صاحب هذا المقام أن يكون الحق سمعه وبصره ويده ورجله وجميع قواه المصرفة له فلا يتصرف إلا بحق في حق لحق ولا يكون هذا الوصف إلا لمحبوب ولا يكون محبوبا حتى يكون مقربا ولا يكون مقربا إلا بنوافل الخيرات ولا تصح له نوافل الخيرات إلا بعد كمال الفرائض ولا تكمل الفرائض إلا باستيفاء حقوقها ولذلك منعنا أن تصح لأحد على التعيين نافلة إلا بأخبار أو مشاهدة وذلك أن الفرائض تستغرقها بالتكميل منها فإنه‏\n\n\nقد ورد في الصحيح عن الله تعالى أنه يقول يوم القيامة انظروا في صلاة عبدي أتمها أم نقصها فإن كانت تامة كتبت له تامة وإن كان انتقص منها شيئا قال انظروا هل لعبدي من تطوع فإن كان له تطوع وهو النافلة قال أكملوا لعبدي فريضته من تطوعه قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ثم تؤخذ الأعمال على ذاكم‏\n\n\nوما شهد الله بنافلة لأحد إلا لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقال ومن اللَّيْلِ فَتَهَجَّدْ به نافِلَةً لَكَ عَسى‏ أَنْ يَبْعَثَكَ رَبُّكَ مَقاماً مَحْمُوداً وهو مقام القرب والسيادة المشهودة للكون فمن كان الحق سمعه فلا تدخل عليه شبهة فيما يسمع بل يدري ما سمع ومن سمع وبمن سمع وما يقتضيه ذلك المسموع فيعمل بحسب ذلك فلا يخطئ سمعه وكذلك إذا كان الحق بصره علم بمن أبصر وما أبصر فلم يدخل في نظره شبهة ولا في حسه غلط ولا في عقله حيرة فهو لله بالله وكذلك في جميع حركاته وسكناته حركات عن تحقيق من محقق ولا ينظر في ذلك إلى تخطئة الغير فيها فإنه من المحال قطعا إن يكون في الوجود أمر يوافق أغراض الجميع فإن الله خلق نظرهم متفاوتا وما جعل في موجوداته من تفاوت في نفس الأمر كما قال تعالى الَّذِي خَلَقَ سَبْعَ سَماواتٍ طِباقاً ما تَرى‏ في خَلْقِ الرَّحْمنِ من تَفاوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرى‏ من فُطُورٍ فمنع إن يكون هناك تفاوت بل أراه الأمور على وضع الحكمة الإلهية فمن أعطى هذا العلم فقد أعطى ما يجب لكل أحد من خلق الله وهذا مقام عزيز قل إن ترى له ذائقا إلا من كان له هذا المقام وعلامة صاحب هذا المقام أن يكون عنده لكل ما يسمى خطأ في الوجود وجه إلى الحق يعرفه ويعرف به إن سئل عنه عند من يعرف منه القبول عليه هذه علامته وهو الذي يرى ربه بكل عقيدة وبكل عين وفي كل صورة وليس هذا إلا لصاحب هذا المقام فإذا ادعاه أحد ووقع أمر في العالم يقع فيه الإنكار ولا يكون عند مدعي هذا المقام له مخرج لحق جملة واحدة فدعواه في هذا المقام محال فإن صاحب هذا المقام يعلم أين وجه الحق في ذلك الأمر الذي صحبه النكر وأكثر ما يكون ذلك في العقائد والأمور الشرعية وما عدا هذين الموضعين فإنه يسهل وجود الحق فيما يقع فيه الإنكار العرضي ولا يلزم من إظهار حق ذلك الأمر أن يكون لسان الحمد يجري عليه ليس ذلك المطلوب بل هو مذموم مثلا مع كونه حقا فما كل حق محمود شرعا ولا عقلا وإنما المراد بالتحقيق علم ما يستحقه كل أمر عدما كان أو وجودا حتى الباطل يعطيه حقه ولا يتعدى به محله ومن كان هذا نعته فهو الإمام المبين وهو مجلى العالمين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n### (و في هذا الباب قلت أخاطب نفسي)\n\n\n> يا نفس كوني للذي *** أورده موافقة\n\n\n> والتزمي وانتظمي *** مع النفوس الصادقة\n\n\n> فإنها موقوفة *** على شهود السابقة\n\n\n> جنب براهين النهي *** فإن منها الحالقة\n\n\n> فما له فرده *** إليك بالموافقة\n\n\n> من سيئ لا يرتضى *** لا تنعتي بالخالقه‏\n\n\n> حضرة فعل الله لا *** تحتمل المشاققه‏\n\n\n> نفسك غالط عندها *** لا تركب المحاققه‏\n> شقوتها مقرونة *** بالبحث والمضايقة\n\n\n> لا تلتفت لما يرى *** من الأمور الخارقة\n\n\n> ما لم تكن مسلما *** لها على المطابقة\n\n\n> إن الحكيم المجتبى *** في حلبة المسابقة\n\n\n> يجري على حكمته *** مع العقول الفارقة\n\n\n> في حضرة النور التي *** لها الشموس الشارقه‏\n\n\n### [أن من التحقيق أن تعطي المغالطة في موضعها حقها]\n\n\nفاعلم أيدك الله أن من التحقيق أن تعطي المغالطة في موضعها حقها فإن لها في كتاب الله موضعا وهو قوله في أعمال الكفار كَسَرابٍ بِقِيعَةٍ يَحْسَبُهُ الظَّمْآنُ ماءً والحق هو الذي أعطاه في عين هذا الرائي صورة الماء وهو ليس بالماء الذي يطلبه هذا الظمآن فتجلى له في عين حاجته حَتَّى إِذا جاءَهُ لَمْ يَجِدْهُ شَيْئاً فنكر وما قال لم يجده الماء فإن السراب لم يكن ذلك المحل الذي جاء إليه محل السراب ولو كان لقال وجد السراب وما كان سرابا إلا في عين الرائي طالب الماء فرجع هذا الرائي لنفسه لما لم يجد مطلوبه في تلك البقعة فوجد الله عنده فلجأ إليه في إغاثته بالماء أو بالمزيل لذلك الظماء القائم به فبأي أمر أزاله فهو المعبر عنه بالماء فلما نفى عنه اسم الشي‏ء جعل الوجود له سبحانه لأنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فما هو شي‏ء بل هو وجود فانظر ما أدق هذا التحقيق فهذا كنار موسى فتجلى له في عين حاجته فلم تكن نارا كما قلنا\n\n\n> كنار موسى يراها عين حاجته *** وهو الإله ولكن ليس يدريه‏\n\n",
    "en": "(Chapter One Hundred and Sixty-Five: Concerning the Knowledge of the Station of Verification and the Verifiers)\n\nThe Real in the reality of Nature\nIs like the mirage you perceive in a plain,\nSo you deem it water, but it is forbidden\nFor the eye of your water to waste it.\nLook and verify what you have seen,\nFor perhaps it was a deception.\nThe forms of theophany (التجلي) are thus;\nThe Real (الحق) within them is like a trust (وديعة).\nAnd texts in the Sacred Law (الشريعة) came concerning them,\nBearing both denial and affirmation.\nDo not turn to the low ground, but look\nAt your lofty stations.\nYou will find the hidden unveiled\nFrom behind wondrous veils,\nIn neither a form nor images\nThat Nature composes.\nSo if you see The Real, then return\nAnd adhere to blocking the means (سد الذريعة).\nAnd speak what the Hadith spoke\nConcerning repugnant words.\nAnd if a dear one disputes with you,\nTell her: \"Be obedient.\"\nBe the keeper of secrets; do not be\nThe divulger among your companions.\nAnd if you are called by such a thing,\nBe the responder and the hearer.\nBeautify your action in acceptance,\nFor you may be rewarded by the action itself.\n\n### That Verification is the Station that Does Not Accept Ambiguities\n\nKnow, may Allah support you, that Verification (التحقيق) is the station (مقام) that does not accept ambiguities (شبه) that might undermine it. The possessor of this description is the Verifier (المحقق). Verification is the knowledge of what is due to every single thing of The Real (الحق) that its essence (ذاته) demands, thus fulfilling that requirement with knowledge. If it happens that he deals with it immediately (حالاً), then he is the one upon whom the sovereignty of Verification has appeared. If it has not appeared upon him, he knows that he has erred, yet that error does not invalidate his Verification, because he is insightful concerning himself and concerning that in which he erred, for his error arose from deliberate effort.\n\nHerein lies a Divine secret: Allah is the Absolute Wise One (الحكيم المطلق), the One Who places things in their proper stations, and He is the One Who gave everything its creation <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>>. Therefore, there is no error in the cosmos when the arrangement is attributed to Allah.\n\nThe master of this Verification and the one verified by it knows that the matter is thus. He knows that he erred, but only in relation to what he was commanded to do, not in relation to the actual state of the matter, since Allah is the One Who placed it in that very location which is called \"error.\" Thus, the possessor of Verification is rewarded for his error—that is, praised by Allah—like the jurist (المجتهد) who is not mistaken in the matter itself, for his ruling is established. His error is only relative to others, in that his evidence did not agree with the evidence of another. Every Sacred Law (شرع) and every Reality (حق) is thus the rank of Verification and the Verifiers (المحققين).\n\n### Concerning the Conditions of the Verifiers\n\nA condition for the possessor of this station is that The Real (الحق) must be his hearing, his sight, his hand, his foot, and all his operative powers. Thus, he acts only by The Real, in The Real, for The Real. This description belongs only to one who is beloved, and one is not beloved until one is brought near (مقرب), and one is not brought near except through supererogatory acts of goodness (نوافل الخيرات). Supererogatory acts of goodness are not valid for him until after the completion of the obligatory duties (الفرائض), and the obligatory duties are not completed except by fulfilling their rights.\n\nFor this reason, we are prevented from affirming the validity of a supererogatory act (نافلة) for anyone specifically, except through reports or direct witnessing (مشاهدة). This is because the obligatory duties absorb them by completing themselves through them. Indeed, it has been reported in the *Sahih* collection from Allah the Exalted that He will say on the Day of Resurrection: \"Look at the prayer of My servant. Did he complete it or fall short?\" If it was complete, it is written for him as complete. If he fell short in anything, He says: \"Look, does My servant have any voluntary worship (تطوع)?\" If he has voluntary worship, which is the supererogatory act, He says: \"Complete My servant’s obligatory duty from his voluntary worship.\" The Messenger of Allah, peace and blessings be upon him, said: \"Then the deeds are taken according to that.\"\n\nAllah did not testify to a supererogatory act for anyone except for the Messenger of Allah, peace and blessings be upon him, when He said: <<وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا>> (And during the night, wake up for prayer, a supererogatory act for you; perhaps your Lord will raise you to a Praised Station). This is the Station of Proximity (القرب) and the witnessed Lordship (السيادة المشهودة) over the cosmos.\n\nThus, he for whom The Real is his hearing, no ambiguity enters into what he hears. Rather, he knows what he heard, who heard, by Whom he heard, and what that heard thing necessitates, and he acts accordingly, so his hearing does not err. Likewise, if The Real is his sight, he knows by whom he sees and what he sees, so no ambiguity enters his gaze, no mistake enters his sensation, and no confusion enters his intellect. He is for Allah, by Allah. Similarly, all his movements and stillness are movements arising from the Verification of a Verifier (محقق).\n\nIn this, he does not look to the error of others concerning it, for it is absolutely impossible that there should be anything in Existence (الوجود) that agrees with the purposes of everyone. Allah created their perspectives as varying, yet He placed no disparity in His existent things in the matter itself, as the Exalted said: <<الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقًا مَّا تَرَى فِي خَلْقِ الرَّحْمَنِ مِن تَفَاوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرَى مِن فُطُورٍ>> (Who created seven heavens in layers. You do not see in the creation of the Most Merciful any inconsistency. So return [your] vision; do you see any breaks?).\n\nThus, He denied that there is any disparity, but rather showed him things according to the placement of the Divine Wisdom (الحكمة الإلهية). Whoever is granted this knowledge has been granted what is due to every creature of Allah. This is a noble station (مقام عزيز); rarely do you see anyone who tastes it except one who possesses this station. The sign of the possessor of this station is that for everything in Existence that is called an error, he has a face (وجه) toward The Real that he knows and by which he knows, if he is asked about it by one from whom he knows acceptance. This is his sign. He is the one who sees his Lord in every creed, with every eye, and in every form.\n\nThis belongs only to the possessor of this station. If someone claims it, and an event occurs in the world that meets with denial, and the claimant of this station does not have a single, comprehensive way out for The Real concerning it, then his claim to this station is impossible. The possessor of this station knows where the face of The Real lies in that matter which was accompanied by denial. This occurs most often in matters of creeds (العقائد) and legal affairs (الأمور الشرعية). As for matters other than these two, it is easier to find The Real in what meets with accidental denial. It is not necessary that the tongue of praise should run upon the manifestation of the reality of that matter; that is not the goal. Rather, it may be blameworthy, for example, despite being real (حقاً). Not every reality is praiseworthy, legally or rationally. What is intended by Verification is the knowledge of what every matter deserves, whether it be non-existence or existence, even falsehood (الباطل)—he gives it its due and does not transgress its proper place. Whoever possesses this description is the Manifest Imam (الإمام المبين) and the locus of manifestation (مجلى) for the worlds. And Allah says the Truth <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> and guides to the way.\n\n### (And in this Chapter, I spoke, addressing my soul)\n\nO soul, be in agreement\nWith that which He brings forth,\nAnd adhere and be organized\nWith the truthful souls.\nFor they are dependent upon\nThe witnessing (شهود) of the Precedence (السابقة).\nAvoid the proofs of prohibition,\nFor some of them are destructive.\nWhatever He has decreed, return it\nTo Him with agreement.\nDo not describe the Creator (الخالقه)\nWith anything evil that is not pleasing.\nThe Presence of Allah’s Act (فعل الله)\nDoes not tolerate contention.\nYour soul is mistaken concerning it,\nSo do not engage in disputation.\nIts wretchedness is linked\nTo searching and constraint.\nDo not turn to what is seen\nOf extraordinary matters (الأمور الخارقة),\nUnless you submit to them\nIn conformity.\nIndeed, the Chosen Wise One (الحكيم المجتبى)\nIn the arena of competition\nRuns according to His Wisdom (حكمته)\nWith the distinguishing intellects,\nIn the Presence of Light (حضرة النور)\nFor which the suns are rising.\n\n### That part of Verification is giving the sophistry its due in its proper place\n\nKnow, may Allah support you, that part of Verification (التحقيق) is giving the sophistry (المغالطة) its due in its proper place. It has a place in the Book of Allah, which is His saying concerning the deeds of the disbelievers: <<كَسَرَابٍ بِقِيعَةٍ يَحْسَبُهُ الظَّمْآنُ مَاءً>> (Like a mirage in a plain, which the thirsty one deems to be water).\n\nThe Real (الحق) is the One Who gave it the form of water in the eye of this beholder, though it is not the water that this thirsty one seeks. Thus, He disclosed Himself (تجلى) to him in the very locus of his need, <<حَتَّى إِذَا جَاءَهُ لَمْ يَجِدْهُ شَيْئًا>> (until, when he came to it, he found it nothing). So He denied it, and did not say, \"He did not find the water,\" for the mirage was not the location to which he came—the location of the mirage. Had it been so, He would have said, \"He found the mirage.\" It was only a mirage in the eye of the beholder seeking water.\n\nThis beholder returned to himself when he did not find what he sought in that plain, and he found Allah with him. So he sought refuge in Him for relief, either with water or with that which removes the thirst established within him. By whatever means He removed it, that is what is expressed as \"water.\" When He negated the name \"thing\" (شيء) from it, He assigned Being (الوجود) to Him, glory be to Him, because <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). Thus, He is not a thing, but rather He is Being. Look how subtle this Verification is.\n\nThis is like the fire of Moses, for He disclosed Himself to him in the very locus of his need, and it was not fire, as we said:\n\nLike the fire of Moses, which the eye of his need sees,\nAnd He is the God, but he does not know Him.",
    "ur": "ایک سو پینسٹھواں باب: مقام التحقیق (مقام التحقيق) اور محققین کی معرفت میں\n\nذات حق (الحق) طبیعت کے حق میں ایسی ہے، جیسے سراب جسے تو میدان میں دیکھتا ہے۔\nتو اسے پانی گمان کرتا ہے، پس تیرے پانی کی آنکھ کے لیے یہ عیب ہے کہ تو اسے ضائع کرے۔\nدیکھ اور جو تو نے دیکھا ہے اس کی تحقیق کر، کیونکہ بسا اوقات وہ فریب ہوتا ہے۔\nظہور الٰہی (التجلی) کی صورتیں ایسی ہی ہیں، ذات حق (الحق) ان میں امانت کی طرح ہے۔\nاور شریعت میں ایسی نصوص آئی ہیں جو اس کا انکار بھی کرتی ہیں اور اقرار بھی۔\nمیدان کی طرف مت دیکھ، اور اپنے بلند مقامات کی طرف نظر کر۔\nتو دیکھے گا کہ پوشیدہ چیزیں خوبصورت پردوں کے پیچھے سے ظاہر ہو رہی ہیں۔\nنہ کسی شکل میں اور نہ ہی ان صورتوں میں جنہیں طبیعت ترتیب دیتی ہے۔\nپس جب تو ذات حق (الحق) کو دیکھے، تو واپس پلٹ جا اور سد الذریعہ (برائی کے راستے کو بند کرنا) کو لازم پکڑ۔\nاور ان الفاظ شنیعہ (بظاہر ناگوار الفاظ) کے ساتھ بات کر جن کے ساتھ حدیث نے بات کی۔\nاور جب کوئی عزیز چیز تجھ سے جھگڑا کرے، تو اس سے کہہ کہ فرمانبردار ہو جا۔\nراز کو چھپانے والی بن، اپنے ساتھیوں کے درمیان راز افشا کرنے والی نہ بن۔\nاور جب تجھے اس جیسی چیز کے ساتھ بلایا جائے، تو جواب دینے والی اور سننے والی بن۔\nقبول کرنے میں اپنے عمل کو خوبصورت بنا، کیونکہ تجھے اسی عمل کا بدلہ دیا جائے گا۔\n\n### تحقیق (التحقيق) وہ مقام ہے جو شبہات کو قبول نہیں کرتا\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ تحقیق (التحقيق) وہ مقام ہے جو اس میں قدح کرنے والے شبہات کو قبول نہیں کرتا۔ اور اس صفت کا حامل محقق (المحقق) ہے۔ پس تحقیق (التحقيق) یہ ہے کہ ہر چیز کے لیے ذات حق (الحق) کی طرف سے جو واجب ہے، جس کا تقاضا اس کی ذات کرتی ہے، اسے علم کے طور پر پورا کرے۔ پھر اگر اتفاق سے وہ اس کے ساتھ حال (حالا) کے طور پر معاملہ کرے، تو وہ وہ شخص ہے جس پر سلطان تحقیق (سلطان التحقيق) ظاہر ہو چکا ہے۔ اور اگر وہ ظاہر نہ ہو، تو وہ جانتا ہے کہ اس نے غلطی کی ہے، اور یہ غلطی اس کی تحقیق (تحقيقه) میں قدح نہیں کرتی، کیونکہ وہ اپنی ذات اور جس میں اس نے غلطی کی ہے، اس سے باخبر ہے، کیونکہ اس نے یہ غلطی ارادے سے کی ہے۔\n\nیہاں ایک الٰہی راز ہے، اور وہ یہ ہے کہ اللہ ہی حکیم مطلق (الحكيم المطلق) ہے، اور وہی امور کو ان کے مقامات پر رکھنے والا ہے، اور وہی ہے جس نے:\n**أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ** (ہر چیز کو اس کی ساخت عطا کی)۔\nپس کائنات میں اللہ کی ترتیب کی نسبت سے کوئی غلطی نہیں ہے۔ اور اس تحقیق (التحقيق) کا رب اور اس کے ذریعے محقق ہونے والا جانتا ہے کہ معاملہ ایسا ہی ہے۔ اور وہ جانتا ہے کہ اس نے غلطی کی ہے، لیکن یہ غلطی اس چیز کی نسبت سے ہے جس کا اسے حکم دیا گیا تھا، نہ کہ اس چیز کی نسبت سے جس پر وہ امر قائم ہے، اس لحاظ سے کہ اللہ ہی نے اسے اس محل میں رکھا ہے جسے یہ فعل غلطی کہلاتا ہے۔ پس صاحب تحقیق (التحقيق) اپنی غلطی میں ماجور (اجر دیا گیا) ہے، یعنی اللہ کے نزدیک اس کی تعریف کی جاتی ہے، جیسے مجتہد (المجتهد) جو نفس الامر میں غلطی کرنے والا نہیں ہوتا، کیونکہ اس کا حکم مقرر ہے۔ اس کی غلطی صرف دوسروں کی نسبت سے ہوتی ہے، جہاں اس کی دلیل دوسرے کی دلیل سے موافقت نہیں رکھتی۔ اور ہر شریعت اور ہر حق میں تحقیق (التحقيق) اور محققین کا مقام ایسا ہی ہے۔\n\n### محققین (المحققين) کی شرائط\n\nاور اس مقام کے حامل کی شرط یہ ہے کہ ذات حق (الحق) اس کا کان، اس کی آنکھ، اس کا ہاتھ، اس کا پاؤں اور اس کی تمام قوتیں ہوں جو اسے تصرف میں لاتی ہیں۔ پس وہ صرف حق کے ساتھ، حق میں، حق کے لیے ہی تصرف کرتا ہے۔ اور یہ وصف صرف محبوب (محبوب) کے لیے ہوتا ہے، اور وہ محبوب نہیں ہوتا جب تک کہ مقرب (مقرب) نہ ہو، اور وہ مقرب نہیں ہوتا مگر نوافل خیرات (نوافل الخيرات) کے ذریعے، اور اس کے لیے نوافل خیرات درست نہیں ہوتیں مگر فرائض (الفرائض) کی تکمیل کے بعد، اور فرائض مکمل نہیں ہوتے مگر ان کے حقوق پورے کرنے سے۔\n\nاسی لیے ہم نے منع کیا ہے کہ کسی کے لیے خاص طور پر کوئی نفل (نافلة) درست ہو، مگر خبر یا مشاہدہ (مشاهدة) کے ذریعے، اور یہ اس لیے کہ فرائض اپنی تکمیل کے ذریعے اسے (نفل کو) اپنے اندر جذب کر لیتے ہیں۔\n\nصحیح حدیث میں اللہ تعالیٰ سے مروی ہے کہ وہ قیامت کے دن فرمائے گا:\n**انظروا في صلاة عبدي أتمها أم نقصها فإن كانت تامة كتبت له تامة وإن كان انتقص منها شيئا قال انظروا هل لعبدي من تطوع فإن كان له تطوع وهو النافلة قال أكملوا لعبدي فريضته من تطوعه قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ثم تؤخذ الأعمال على ذاكم‏**\n(میرے بندے کی نماز کو دیکھو، کیا اس نے اسے پورا کیا یا اس میں کمی کی؟ پس اگر وہ پوری ہوگی تو اس کے لیے پوری لکھی جائے گی۔ اور اگر اس میں کچھ کمی کی ہوگی، تو وہ فرمائے گا: دیکھو، کیا میرے بندے کے پاس کوئی تطوع (تطوع) ہے؟ پس اگر اس کے پاس تطوع ہو، جو کہ نفل (النافلة) ہے، تو وہ فرمائے گا: میرے بندے کے فرض کو اس کے تطوع سے مکمل کر دو۔) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"پھر اسی طرح اعمال لیے جائیں گے۔\"\n\nاور اللہ نے رسول اللہ صلی اللہ علیہ وسلم کے سوا کسی کے لیے نفل (نافلة) کی گواہی نہیں دی، پس فرمایا:\n**وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا**\n(اور رات کے کچھ حصے میں اس کے ساتھ تہجد پڑھو، یہ تمہارے لیے اضافی ہے، قریب ہے کہ تمہارا رب تمہیں مقام محمود (مقاماً محموداً) پر فائز کر دے)۔\nاور یہ قرب (القرب) اور سیادت (السيادة) کا وہ مقام ہے جو کائنات کے لیے مشہود ہے۔\n\nپس جس کا کان ذات حق (الحق) ہو، تو جو کچھ وہ سنتا ہے اس میں کوئی شبہہ (شبهة) داخل نہیں ہوتا، بلکہ وہ جانتا ہے کہ اس نے کیا سنا، اور کس کے ذریعے سنا، اور وہ مسموع کیا تقاضا کرتا ہے، پس وہ اس کے مطابق عمل کرتا ہے اور اس کا سننا غلطی نہیں کرتا۔ اسی طرح جب ذات حق (الحق) اس کی آنکھ ہو، تو وہ جانتا ہے کہ اس نے کس کو دیکھا اور کیا دیکھا، پس اس کی نظر میں کوئی شبہہ داخل نہیں ہوتا، نہ اس کے حس میں کوئی غلطی ہوتی ہے، اور نہ اس کے عقل میں کوئی حیرت۔ پس وہ اللہ کے لیے اللہ کے ساتھ ہے۔ اور اسی طرح اس کی تمام حرکات و سکنات محقق (محقق) کی تحقیق (تحقيق) سے ہوتی ہیں۔\n\nاور وہ اس میں دوسروں کی غلطی کو نہیں دیکھتا، کیونکہ یہ قطعی طور پر محال ہے کہ وجود میں کوئی ایسا امر ہو جو سب کے اغراض کے موافق ہو۔ کیونکہ اللہ نے ان کی نظر کو مختلف (متفاوتا) پیدا کیا ہے، اور اس نے اپنی موجودات میں نفس الامر میں کوئی تفاوت (تفاوت) نہیں رکھا، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقًا مَا تَرَى فِي خَلْقِ الرَّحْمَنِ مِنْ تَفَاوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرَى مِنْ فُطُورٍ**\n(جس نے سات آسمان تہ بہ تہ بنائے، تو رحمن کی تخلیق میں کوئی تفاوت (بے ربطی) نہیں دیکھے گا۔ پس نگاہ دوڑا کر دیکھ، کیا تجھے کوئی شگاف نظر آتا ہے؟)۔\n\nپس اس نے منع کیا کہ وہاں کوئی تفاوت ہو، بلکہ اس نے امور کو حکمت الٰہیہ کے وضع پر دکھایا۔ پس جسے یہ علم عطا ہوا، اسے وہ سب کچھ عطا ہوا جو اللہ کی مخلوق میں سے ہر ایک کے لیے واجب ہے۔ اور یہ ایک عزیز مقام ہے، کم ہی لوگ ہیں جو اس کا ذائقہ چکھتے ہیں، سوائے اس کے جو اس مقام کا حامل ہو۔\n\nاور اس مقام کے حامل کی علامت یہ ہے کہ وجود میں ہر اس چیز کے لیے جسے غلطی کہا جاتا ہے، اس کے پاس ذات حق (الحق) کی طرف ایک رُخ ہوتا ہے جسے وہ جانتا ہے، اور اگر اس سے اس کے بارے میں پوچھا جائے تو وہ اس کے ذریعے اسے پہچانتا ہے، بشرطیکہ پوچھنے والا ایسا ہو جس سے قبولیت کی توقع ہو۔ یہ اس کی علامت ہے۔ اور وہ وہ شخص ہے جو اپنے رب کو ہر عقیدے کے ساتھ، ہر آنکھ کے ساتھ اور ہر صورت میں دیکھتا ہے۔\n\nاور یہ صرف اسی مقام کے حامل کے لیے ہے۔ پس اگر کوئی اس کا دعویٰ کرے اور دنیا میں کوئی ایسا معاملہ پیش آئے جس پر انکار کیا جائے، اور اس دعویٰ کرنے والے کے پاس اس کے حق کے لیے کوئی ایک بھی مخرج نہ ہو، تو اس کا اس مقام کا دعویٰ محال ہے۔ کیونکہ اس مقام کا حامل جانتا ہے کہ اس امر میں ذات حق (الحق) کا رُخ کہاں ہے جس کے ساتھ انکار جڑا ہوا ہے۔ اور یہ زیادہ تر عقائد اور شرعی امور میں ہوتا ہے۔ اور ان دو مقامات کے علاوہ، عارضی انکار میں حق کا وجود آسانی سے مل جاتا ہے۔\n\nاور اس امر کے حق کو ظاہر کرنے سے یہ لازم نہیں آتا کہ اس پر حمد کی زبان جاری ہو، یہ مطلوب نہیں ہے۔ بلکہ وہ مذموم ہوتا ہے، مثال کے طور پر، باوجود اس کے کہ وہ حق ہو۔ پس ہر حق شرعاً یا عقلاً محمود نہیں ہوتا۔ بلکہ تحقیق (التحقيق) سے مراد ہر امر کا استحقاق جاننا ہے، خواہ وہ عدم ہو یا وجود، یہاں تک کہ باطل کو بھی اس کا حق دیا جائے اور وہ اپنی جگہ سے تجاوز نہ کرے۔ اور جس کی یہ صفت ہو، وہی امام مبین (الإمام المبين) ہے، اور وہی عالمین کا مظہر (مجلى العالمين) ہے۔ اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\n\n### (اور اس باب میں میں نے اپنے نفس کو مخاطب کرتے ہوئے کہا)\n\nاے نفس! جو کچھ اس نے وارد کیا ہے، اس کے لیے موافقت اختیار کر۔\nاور لازم پکڑ اور سچی جانوں (النفوس الصادقة) کے ساتھ منظم ہو جا۔\nکیونکہ وہ سابقہ (ازلی تقدیر) کے شہود (شہود) پر موقوف ہیں۔\nمنع کی دلیلوں سے بچ، کیونکہ ان میں سے بعض ہلاک کرنے والی ہیں۔\nپس جو کچھ اس کا ہے، اسے موافقت کے ساتھ تیری طرف لوٹا دے۔\nجو ناپسندیدہ برائی ہے، اسے خالق (الخالقه) کی صفت سے مت بیان کر۔\nاللہ کے فعل کی بارگاہ جھگڑے کو برداشت نہیں کرتی۔\nتیرا نفس اس کے نزدیک غلطی کرنے والا ہے، پس بحث و مباحثہ میں مت پڑ۔\nاس کی بدبختی بحث اور تنگی کے ساتھ جڑی ہوئی ہے۔\nان خارق عادت امور کی طرف مت دیکھ جو نظر آتی ہیں۔\nجب تک تو مطابقت کے ساتھ ان کے سامنے سر تسلیم خم نہ کرے۔\nبے شک چنا ہوا حکیم (الحكيم المجتبى) مسابقت کے میدان میں۔\nاپنی حکمت کے مطابق ممتاز عقلوں کے ساتھ چلتا ہے۔\nنور کی اس بارگاہ میں جس کے لیے سورج چمکتے ہیں۔\n\n### تحقیق (التحقيق) میں سے یہ ہے کہ مغالطہ (المغالطة) کو اس کی جگہ پر اس کا حق دیا جائے\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ تحقیق (التحقيق) میں سے یہ ہے کہ آپ مغالطہ (المغالطة) کو اس کی جگہ پر اس کا حق دیں۔ کیونکہ کتاب اللہ میں اس کا ایک مقام ہے، اور وہ کفار کے اعمال کے بارے میں اس کا یہ قول ہے:\n**كَسَرَابٍ بِقِيعَةٍ يَحْسَبُهُ الظَّمْآنُ مَاءً**\n(جیسے چٹیل میدان میں سراب، جسے پیاسا (الظمآن) پانی گمان کرتا ہے)۔\nاور ذات حق (الحق) ہی وہ ہے جس نے اس دیکھنے والے کی آنکھ میں پانی کی صورت عطا کی، حالانکہ وہ وہ پانی نہیں ہے جسے یہ پیاسا (الظمآن) طلب کر رہا ہے۔ پس اس کی ضرورت کے عین مطابق اس پر ظہور الٰہی (التجلی) ہوا،\n**حَتَّى إِذَا جَاءَهُ لَمْ يَجِدْهُ شَيْئًا**\n(یہاں تک کہ جب وہ اس کے پاس آیا تو اسے کچھ نہ پایا)۔\nپس اس نے انکار کیا، اور یہ نہیں کہا کہ اس نے پانی نہیں پایا۔ کیونکہ سراب وہ محل نہیں تھا جہاں وہ آیا تھا، اگر ایسا ہوتا تو وہ کہتا کہ اس نے سراب کو پایا۔ اور وہ سراب نہیں تھا مگر پانی طلب کرنے والے دیکھنے والے کی آنکھ میں۔ پس یہ دیکھنے والا اپنی طرف پلٹا جب اسے اس میدان میں اپنا مطلوب نہ ملا، تو اس نے اللہ کو اپنے پاس پایا۔ پس اس نے اللہ کی پناہ لی کہ وہ اسے پانی سے یا اس پیاس کو دور کرنے والی چیز سے نجات دے جو اس کے ساتھ قائم ہے۔ پس جس بھی چیز سے اس نے اسے دور کیا، اسی کو پانی سے تعبیر کیا گیا۔ پس جب اس سے \"شیء\" کا نام نفی کیا گیا، تو وجود (الوجود) صرف اسی سبحانہ و تعالیٰ کے لیے قرار دیا گیا، کیونکہ\n**لَيْسَ كَمِثْلِهِ شَيْءٌ**\n(اس کی مثال کوئی چیز نہیں ہے)۔\nپس وہ کوئی چیز نہیں ہے، بلکہ وہ وجود (الوجود) ہے۔ پس دیکھو یہ تحقیق (التحقيق) کتنی دقیق ہے۔ یہ موسیٰ علیہ السلام کی آگ کی طرح ہے، پس اس پر اس کی ضرورت کے عین مطابق ظہور الٰہی (التجلی) ہوا، حالانکہ وہ آگ نہیں تھی، جیسا کہ ہم نے کہا:\n\n**كنار موسى يراها عين حاجته *** وهو الإله ولكن ليس يدريه‏**\nموسیٰ کی آگ کی طرح، جسے وہ اپنی ضرورت کی آنکھ سے دیکھتا ہے، اور وہ (حقیقت میں) الٰہ ہے، لیکن وہ اسے نہیں جانتا۔",
    "fa": "(باب صد و شصت و پنجم در معرفت مقام تحقیق و محققان)\n\nحق (الحق) در قلمرو طبیعت (الطبيعة)، همچون سراب (الآل) است که آن را در دشتی (قيعة) می‌بینی.\nپس آن را آب می‌پنداری؛ اما بر چشم آب تو (عين مائك) حرام است که آن را تباه کند.\nبنگر و آنچه دیده‌ای را تحقیق کن، زیرا شاید فریب (خديعة) باشد.\nصور تجلی الهی (التجلي) این‌گونه است؛ حق (الحق) در آن‌ها همچون ودیعه‌ای (وديعة) است.\nو نصوص شریعت (الشريعة) با انکار و اقرار در مورد آن‌ها آمده است.\nبه دشت (القاع) توجه مکن و در منازل رفیع خود بنگر.\nآنچه پنهان است (المعمى)، از پس پرده‌های بدیع، آشکار می‌شود.\nدر غیر شکلی که طبیعت (الطبيعة) آن را ترکیب کند، و نه در صورتی.\nپس هرگاه حق (الحق) را دیدی، بازگرد و به سد ذریعه (بستن راه‌های منتهی به خطا) ملتزم باش.\nو به آنچه حدیث (الحديث) با الفاظ ناپسند (شنيعة) به آن نطق کرده، سخن بگو.\nو اگر عزیزه‌ای با تو نزاع کرد، به او بگو: فرمانبردار باش.\nرازدار باش، و در میان یاران خود فاش‌کننده (مذيعة) مباش.\nو اگر به مانند این خوانده شدی، پاسخ‌دهنده و شنونده باش.\nعمل خود را در پذیرش نیکو گردان، زیرا ممکن است با همان عمل پاداش داده شوی.\n\n### [اینکه تحقیق، مقامی است که شبهه را نمی‌پذیرد]\n\nبدان، خداوند تو را تأیید کند، که تحقیق (التحقيق) مقامی است که شبهه‌های (الشبه) قادح در آن را نمی‌پذیرد. و صاحب این صفت، محقق (المحقق) است. پس تحقیق (التحقيق)، معرفت (معرفة) آن حقی است که ذات هر شیئی آن را می‌طلبد و محقق آن حق را از روی علم به آن شیء می‌رساند. اگر اتفاق افتد که محقق در حال (حالا) با آن حق عمل کند، او کسی است که سلطان تحقیق (التحقيق) بر او ظاهر شده است. و اگر ظاهر نشود، او می‌داند که خطا کرده است، اما آن خطا در تحقیق او خللی وارد نمی‌کند، زیرا او به نفس خود و به آنچه در آن خطا کرده است، بیناست؛ چرا که خطای او از روی تعمّل (کوشش) بوده است.\n\nو در اینجا یک سرّ الهی است و آن این است که خداوند حکیم مطلق است و اوست که امور را در جایگاه‌های خود قرار داده و اوست که: **«به هر چیزی آفرینش (خلق) آن را عطا کرد.»** (أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ). پس در هستی (الکون) خطایی نسبت به ترتیب الهی وجود ندارد. و پروردگار این تحقیق و محقق به آن می‌داند که امر چنین است. و او می‌داند که خطا کرده است، اما این خطا نسبت به آنچه به آن امر شده است، می‌باشد، نه نسبت به آنچه امر بر آن است؛ از آن جهت که خداوند آن را در آن محل قرار داده که این فعل، خطا نامیده می‌شود. پس صاحب تحقیق (التحقيق) در خطای خود مأجور است، یعنی نزد خداوند ستوده شده است، مانند مجتهدی که در نفس امر خطا نکرده است، زیرا حکم او مقرر است. و خطای او تنها نسبت به دیگری است، آنجا که دلیل او با دلیل دیگری موافق نبوده است. و هر شریعت و هر حقی، منزلت تحقیق و محققان (المحققين) چنین است.\n\n### [در شروط محققان]\n\nو از شرط‌های صاحب این مقام آن است که حق (الحق) گوش و چشم و دست و پای او و تمامی قوای تصرف‌کننده او باشد. پس جز به حق، در حق، برای حق تصرف نمی‌کند. و این وصف جز برای محبوب حاصل نمی‌شود، و محبوب نمی‌شود مگر آنکه مقرب باشد، و مقرب نمی‌شود مگر به نوافل خیرات، و نوافل خیرات برای او صحیح نمی‌شود مگر پس از کمال فرائض، و فرائض کامل نمی‌شوند مگر با استیفای حقوق آن‌ها. و به همین دلیل، ما منع کردیم که نافله‌ای برای کسی به طور معین صحیح باشد، مگر با اخبار یا مشاهدت (شهود)، زیرا فرائض با تکمیل شدن، نوافل را در خود مستغرق می‌سازند. زیرا:\n\nدر حدیث صحیح از خداوند متعال وارد شده است که در روز قیامت می‌فرماید: **«به نماز بنده من بنگرید، آیا آن را کامل انجام داده یا ناقص؟ اگر کامل بود، برای او کامل نوشته می‌شود. و اگر چیزی از آن کم بود، می‌فرماید: بنگرید آیا بنده من عمل داوطلبانه‌ای (تطوع) دارد؟ اگر عمل داوطلبانه‌ای داشت که همان نافله است، می‌فرماید: فریضه بنده مرا از عمل داوطلبانه او کامل کنید.»** رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمودند: **«سپس اعمال بر این اساس مورد محاسبه قرار می‌گیرند.»**\n\nو خداوند برای هیچ‌کس نافله‌ای را شهادت نداد، مگر برای رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) که فرمود: **«و پاسی از شب را با آن (قرآن) بیدار باش و نماز بخوان، که این نافله‌ای برای توست، باشد که پروردگارت تو را به مقامی ستوده (مَقاماً مَحْمُوداً) برانگیزد.»** (وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا). و آن مقام قرب و سیادتی است که برای هستی (الکون) مشهود است.\n\nپس کسی که حق (الحق) گوش او باشد، شبهه‌ای (شبهة) در آنچه می‌شنود بر او وارد نمی‌شود، بلکه می‌داند چه شنیده، و از چه کسی شنیده، و به واسطه چه کسی شنیده، و آن مسموع چه اقتضایی دارد، و بر اساس آن عمل می‌کند، پس گوش او خطا نمی‌کند. و همچنین اگر حق (الحق) چشم او باشد، می‌داند چه کسی را دیده و چه چیزی را دیده است، پس نه شبهه‌ای در نگاهش وارد می‌شود، نه غلطی در حسش، و نه حیرتی در عقلش. پس او برای خدا و به واسطه خداست. و همچنین در تمامی حرکات و سکنات او، حرکاتی است که از تحقیق (تحقيق) یک محقق (محقق) سرچشمه می‌گیرد. و در این امر به تخطئه دیگران نمی‌نگرد.\n\nزیرا قطعاً محال است که در هستی (الوجود) امری باشد که موافق اغراض همگان باشد، چرا که خداوند دیدگاه‌های آن‌ها را متفاوت آفریده است و در موجودات خود در نفس امر تفاوتی قرار نداده است، چنانکه خداوند متعال فرمود: **«آن که هفت آسمان را طبقه طبقه آفرید. در آفرینش خدای رحمان هیچ تفاوت و خللی نمی‌بینی. پس دوباره بنگر، آیا هیچ شکافی می‌بینی؟»** (الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ طِبَاقًا مَا تَرَى فِي خَلْقِ الرَّحْمَنِ مِنْ تَفَاوُتٍ فَارْجِعِ الْبَصَرَ هَلْ تَرَى مِنْ فُطُورٍ).\n\nپس او منع کرد که تفاوتی در آنجا باشد، بلکه امور را بر اساس وضع حکمت الهی به او نشان داد. پس کسی که این علم به او عطا شود، آنچه را که برای هر یک از خلق خدا واجب است، به او عطا شده است. و این مقامی عزیز است که کمتر کسی را می‌بینی که طعم آن را چشیده باشد، مگر کسی که صاحب این مقام باشد. و نشانه صاحب این مقام آن است که برای هر آنچه در هستی (الوجود) خطا نامیده می‌شود، وجهی به سوی حق (الحق) نزد او باشد که آن را می‌شناسد و اگر از او سؤال شود، نزد کسی که می‌داند از او می‌پذیرد، آن وجه را بیان می‌کند. این نشانه اوست. و او کسی است که پروردگارش را با هر عقیده‌ای، با هر چشمی و در هر صورتی می‌بیند. و این جز برای صاحب این مقام نیست.\n\nپس اگر کسی ادعای این مقام را کند و امری در عالم رخ دهد که مورد انکار واقع شود و مدعی این مقام نتواند برای آن یکسره راهی به سوی حق (الحق) بیابد، ادعای او در این مقام محال است. زیرا صاحب این مقام می‌داند که وجه حق (الحق) در آن امری که با انکار همراه شده، کجاست. و بیشتر این امر در عقاید و امور شرعی رخ می‌دهد. و غیر از این دو موضع، یافتن حق در آنچه انکار عرضی در آن واقع می‌شود، آسان است. و لازم نیست که با آشکار شدن حق آن امر، زبان ستایش بر آن جاری شود؛ این مطلوب نیست، بلکه ممکن است آن امر با وجود حق بودنش، مذموم باشد. پس هر حقی شرعاً و عقلاً ستوده نیست. بلکه مراد از تحقیق (التحقيق)، علم به آن چیزی است که هر امری، چه عدمی باشد و چه وجودی، مستحق آن است، حتی باطل نیز حق خود را می‌گیرد و از جایگاه خود تجاوز نمی‌کند. و کسی که این صفت او باشد، او امام مبین (الإمام المبين) و مظهر (مجلی) عالمیان است. و خداوند **«حق را می‌گوید و او راه را هدایت می‌کند.»** (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).\n\n### (و در این باب گفتم که نفسم را خطاب می‌کنم)\n\nای نفس، نسبت به آنچه او وارد می‌کند، موافق باش.\nو ملتزم باش و با نفوس صادق (الصادقة) هم‌نظم شو.\nزیرا آن‌ها بر شهود (شهود) سابقه (تقدیر ازلی) متوقف‌اند.\nاز براهین نهی دوری کن، زیرا برخی از آن‌ها نابودکننده (الحالقة) هستند.\nپس آنچه را که او به موافقت به تو بازگرداند،\nاز بدی‌ای که مورد رضایت نیست، آن را به خالق (الخالقه) نسبت مده.\nحضور فعل خداوند، ستیزه‌جویی (المشاققه) را برنمی‌تابد.\nنفس تو نزد او در اشتباه است، پس به مجادله (المحاققه) مپرداز.\nبدبختی آن (نفس) با بحث و تنگنا همراه است.\nبه آنچه از امور خارق‌العاده (الخارقة) دیده می‌شود، توجه مکن.\nمگر آنکه بر اساس مطابقت (حقیقت) تسلیم آن باشی.\nهمانا حکیم برگزیده (المجتبى) در میدان مسابقه،\nبر اساس حکمت خود، با عقول متمایز (الفارقة) رفتار می‌کند.\nدر حضور نوری که خورشیدهای درخشان از آن اوست.\n\n### [اینکه از جمله تحقیق آن است که مغالطه را در جایگاه خود حقش را بدهی]\n\nپس بدان، خداوند تو را تأیید کند، که از جمله تحقیق (التحقيق) آن است که مغالطه (المغالطة) را در جایگاه خود حقش را بدهی. زیرا برای آن در کتاب خدا جایگاهی است و آن قول خداوند در مورد اعمال کافران است: **«همچون سرابی در دشتی هموار که تشنه آن را آب می‌پندارد.»** (كَسَرَابٍ بِقِيعَةٍ يَحْسَبُهُ الظَّمْآنُ مَاءً). و حق (الحق) همان است که در چشم این بیننده، صورت آب را به آن (سراب) بخشید، در حالی که آن آبی نیست که این تشنه آن را می‌طلبد. پس حق در عین حاجت او بر او تجلی کرد، **«تا آنکه چون به آن رسید، چیزی نیافت.»** (حَتَّى إِذَا جَاءَهُ لَمْ يَجِدْهُ شَيْئًا). پس آن را انکار کرد و نگفت آب را نیافت. زیرا سراب، آن محلی که تشنه به آن آمد، محل سراب نبود. و اگر بود، می‌گفت سراب را یافت. و سراب جز در چشم بیننده طالب آب، سراب نبود. پس این بیننده به سوی نفس خود بازگشت، هنگامی که مطلوب خود را در آن دشت نیافت، و خداوند را نزد خود یافت. پس به او پناه برد تا او را با آب یا با زائل‌کننده آن تشنگی که در او بود، یاری رساند. پس با هر امری که آن را زائل کند، همان است که از آن به آب تعبیر می‌شود. هنگامی که اسم شیء را از آن نفی کرد، هستی (الوجود) را برای او سبحانه قرار داد، زیرا **«چیزی مانند او نیست.»** (لَيْسَ كَمِثْلِهِ شَيْءٌ). پس او شیء نیست، بلکه هستی (وجود) است. پس بنگر که این تحقیق (التحقيق) چقدر دقیق است. پس این مانند آتش موسی است. حق در عین حاجت او بر او تجلی کرد، اما آتش نبود، چنانکه گفتیم:\n\nآتش موسی را چشم حاجت او می‌بیند، و او (آنچه دیده) همان اله است، اما او نمی‌داند."
  },
  "page_count": 3
}