{
  "id": 85,
  "title": {
    "ar": "الباب الخامس والثمانون في تقوى الحجاب والستر",
    "en": "Chapter Eighty-Five: Concerning the Piety of the Veil (الحجاب) and the Concealment (الستر)",
    "ur": "پچاسیواں باب: حجاب اور پردے کی تقویٰ کے بیان میں",
    "fa": "باب هشتاد و پنجم در تقوای حجاب و پوشش"
  },
  "content": {
    "ar": "## (الباب الخامس والثمانون في تقوى الحجاب والستر)\n\n\n> من يتقي الستر فذاك الذي *** يعلم أن الستر من نفسه‏\n\n\n> إذا أتى يوم عليه يرى *** يبكي على ما فات في أمسه‏\n\n\n> لو رفع الستر بدار الفناء *** من قبل أن يرفع في رمسه‏\n\n\n> لنال ما نال رجال سمت *** همتهم عن جنتي قدسه‏\n\n\n> ولاح وجه الحق في سرهم *** في بدره وقتا وفي شمسه‏\n\n\n> فلا يرى الترجيح فيما يرى *** بعقله من ذاك أو حسه‏\n\n\n> كما يخاف العقل من عقله *** كذا يخاف الحس من حسه‏\n\n\n> لأجل هذا يتقي المتقي *** كمتقي الشيطان من مسه‏\n\n\n### [نحن خلف حجاب الحجب والحق منا بمكان الوريد]\n\n\nاعلم أيدنا الله وإياك أن الله تعالى قال كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ وقال صلى الله عليه وسلم إن لله سبعين حجابا من نور وظلمة لو كشفها لأحرقت سبحات وجهه ما أدركه بصره من خلقه‏\n\n\nفانظر ما ألطف هذه الحجب وما أخفاها فإنه قال ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ مع وجود هذه الحجب التي تمنعنا من رؤيته في هذا القرب العظيم وما نرى لهذه الحجب عينا فهي أيضا محجوبة عنا وقال تعالى ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ نعم يا ربنا ما نبصرك ولا نبصر الحجب فنحن خلف حجاب الحجب وأنت منا بمكان الوريد أو أقرب إلينا منا وهذا القرب هو سبب عدم الرؤية منا أن تتعلق بك الإنسان لا يرى نفسه فكيف يراك وأنت أقرب إلينا من أنفسنا فغاية القرب حجاب كما غاية البعد حجاب‏\n\n\n### [العجب الذي قصم الظهر وحير الفكر]\n\n\nوإنما العجب الذي قصم الظهر وحير العقل قولك وعلمنا إن الله يرى في قولك توبيخا وتنبيها أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏ وقولك وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ ثم قلت إنك لو رفعت الحجب بيننا وبينك من كونك موصوفا بالسبحات الوجهية لاحترق ما أدركه بصرك بسبحات وجهك وبالنور صح ظهور العالم وهو وجوده فكيف يعدم من حقيقته الإيجاد هنا هي الحيرة ثم إنه على الأمرين أدخلت نفسك تحت حكم التحديد وهذا ينكره ما جعلته فينا من القوة العقلية الناظرة بالصفة الفكرية وما لنا إلا حس وعقل فبالحس ما ندرك وبالعقل ما ندرك فقد وقع الحد إن كنت خلف الحجاب فأنت محدود وإن كنت أقرب إلينا من الحجاب فأنت محدود وإن كنت بِكُلِّ شَيْ‏ءٍ مُحِيطٌ فأنت أقرب إلى نفي الحد فلما ذا أدخلت نفسك في الحد بما أعلمتنا به من الحجب الحائلة بينك وبيننا بيننا وبينك‏\n\n\n### [حارت العقول وما خاطب الحق إلا العقول‏]\n\n\nحارت العقول وما خاطب إلا العقول ونصب أدلتها متقابلة فما أثبته دليل نفاه آخر إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِها من تَشاءُ وتَهْدِي من تَشاءُ أَنْتَ وَلِيُّنا فَاغْفِرْ لَنا وارْحَمْنا وأي غفر أشد من هذا جزى الله عنا موسى عليه السلام حيرا إذ ترجم عنا بقوله إِنْ هِيَ إِلَّا فِتْنَتُكَ اختبرت عبادك بالأدلة وما ثم دليل يوصل إليك الدليل موضوع ليدل على واضع لا يدل على حقيقة واضعه فما رأينا بعد السبر والتقسيم وما أعطاه الكلام القديم إلا أن تكون أنت عين الحجب ولهذا احتجبت الحجب فلا نراها مع كونها نورا وظلمة وهو ما تسميت به لنا من الظاهر والباطن وقد أمرتنا أن نتقي الله فإن لم يكن الله عين الحجاب عليه النوري من الاسم الظاهر والظلمي من الاسم الباطن وإلا كنا مشركين وقد ثبت أنا موحدون فثبت أنك عين الحجاب‏\n\n\n### [احتجبنا عن الحق واحتجاب الحق عنا وسلبية الصفات الإلهية]\n\n\nفما احتجبنا عنك إلا بك ولا احتجبت عنا إلا بظهورك غير أنك لا نعرف لكوننا نطلبك من اسمك كما نطلب الملك من اسمه وصفته وإن كان معنا غير ظاهر بذلك الاسم ولا بتلك الصفة بل ظهور ذاتي فهو يكلمنا ونكلمه ويشهدنا ونشهده ويعرفنا ولا نعرفه وهذا أقوى دليل على أن صفاته سلبية لا ثبوتية إذ لو كانت ثبوتية لا ظهرته إذا ظهر بذاته فما نعرف أنه هو إلا بتعريفه فنحن في المعرفة مقلدون له وكانت صفاته ثبوتية لكانت عين ذاته وكنا نعرفه بنفس ما نراه ولم يكن الأمر كذلك فدل على خلاف ما يعتقده‏\nأهل النظر وأرباب الفكر الصفاتين من المشبهة من أرباب العقول‏\n\n\n### [ما في الوجود إلا الله وما في العدم الشيئى إلا أعيان الممكنات‏]\n\n\nوهذا الأمر أدانا إلى أن نعتقد في الموجودات على تفاصيلها أن ذلك ظهور الحق في مظاهر أعيان الممكنات بحكم ما هي الممكنات عليه من الاستعدادات فاختلفت الصفات على الظاهر لأن الأعيان التي ظهر فيها مختلفة فتميزت الموجودات وتعددت لتعدد الأعيان وتميزها في نفسه فما في الوجود إلا الله وأحكام الأعيان وما في العدم الشي‏ء إلا أعيان الممكنات مهياة للاتصاف بالوجود فهي لا هي في الوجود لأن الظاهر أحكامها فهي ولا عين لها في الوجود فلا هي كما هو ولا هو لأنه الظاهر فهو والتميز بين الموجودات معقول ومحسوس لاختلاف أحكام الأعيان فلا هو\n\n\n> فيا أنا ما هو أنا *** ولا هو ما هو هومغازلة رقيقة وإشارة دقية ردها البرهان ونفاها وأوجدها العيان وأثبتها فقل بعد هذا ما شئت فقد أنبت لك عن الأمر ما هو فما أخطأ معتقد في اعتقاده ولا جهل منتقد في انتقاده‏\n\n\n> فما ثم إلا الله والكون حادث *** وما ثم إلا الله والكون ظاهر\n\n\n> فما العلم إلا الجهل بالله فاعتصم *** بقولي فإني عن قريب أسافر\n\n\n> ومالي مال غير علمي ووارث *** سوى عين أولادي فذا المال حاضر\n\n",
    "en": "## Chapter Eighty-Five: Concerning the Piety of the Veil and Concealment\n\nHe who is pious regarding the Veil is the one\nWho knows that the Veil originates from his own self.\nIf a day comes upon him when he sees,\nHe weeps over what passed in his yesterday.\nIf the Veil were lifted in the abode of annihilation [this world],\nBefore it is lifted in his grave,\nHe would attain what men attained, whose aspiration\nSoared above the Garden of His Holiness.\nAnd the Face of the Real (وجه الحق) would shine in their secret core (سرهم),\nIn its full moon at one time, and in its sun at another.\nHe sees no preference (الترجيح) in what he perceives\nBy his intellect (عقله) or by his sense (حسه).\nJust as the intellect fears its own intellect,\nSo too the sense fears its own sense.\nIt is for this reason that the pious one (المتقي) is pious,\nLike one who fears the touch (مس) of Satan.\n\n### [We are behind the Veil of Veils, and the Real is to us as the place of the Jugular Vein]\n\nKnow, may Allah support us and you, that Allah the Exalted said: <<كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ>> (Nay, indeed, they will surely be veiled from their Lord on that Day). And the Prophet, peace and blessings be upon him, said: \"Indeed, Allah has seventy veils of light and darkness. If He were to remove them, the splendors (سبحات) of His Face would burn up everything reached by His sight from His creation.\"\n\nConsider how subtle these veils (الحجب) are, and how hidden, for He said: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ>> (And We are nearer to him than [his] jugular vein), despite the existence of these veils which prevent us from seeing Him in this immense proximity (القرب العظيم). Yet, we do not perceive the essence (عينا) of these veils; they too are veiled from us. And the Exalted said: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ>> (And We are nearer to him than you, but you do not see). Yes, our Lord, we do not perceive You, nor do we perceive the veils. Thus, we are behind the veil of veils (حجاب الحجب), and You are to us as the place of the jugular vein (الوريد) or even nearer to us than ourselves. This proximity (القرب) is the reason for our lack of vision: when a human being is attached to you, he does not see himself, so how can he see You, when You are nearer to us than our own selves? The extreme of proximity is a veil, just as the extreme of distance is a veil.\n\n### [The Astonishment that Broke the Back and Confused the Thought]\n\nThe astonishment (العجب) that truly broke the back and confused the intellect (الفكر) is Your statement and our knowledge that Allah sees, in Your words of reproach and warning: <<أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى>> (Does he not know that Allah sees?). And Your saying: <<وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are). Then You said that if You were to remove the veils between us and You—due to Your being described by the splendors of the Face (السبحات الوجهية)—everything reached by Your sight would be burned up by the splendors of Your Face. Yet, it is through the Light (النور) that the appearance of the World (العالم) is validated, which is its existence (وجوده). How then can that which is brought into existence (الإيجاد) be annihilated from its own reality (حقيقته)? This is the point of confusion (الحيرة). Furthermore, in both cases, You have placed Yourself under the rule of limitation (التحديد). This is denied by the intellectual power (القوة العقلية) You placed within us, which observes through the faculty of thought (الصفة الفكرية). We possess nothing but sense (حس) and intellect (عقل). By sense, we do not perceive, and by intellect, we do not perceive. Thus, limitation has occurred: if You are behind the veil, You are limited (محدود); and if You are nearer to us than the veil, You are limited. But if You are <<بِكُلِّ شَيْ‏ءٍ مُحِيطٌ>> (Encompassing all things), You are closer to the negation of limitation. Why then did You place Yourself within limitation by informing us of the veils that intervene between us and You?\n\n### [Intellects were Confused, yet the Real Addressed None but the Intellects]\n\nIntellects (العقول) were confused, yet He addressed none but the intellects, setting up their proofs (أدلتها) in opposition. What one proof establishes, another negates. <<إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِها من تَشاءُ وتَهْدِي من تَشاءُ أَنْتَ وَلِيُّنا فَاغْفِرْ لَنا وارْحَمْنا>> (It is nothing but Your trial [fitnah]; You mislead thereby whom You will and guide whom You will. You are our Protector, so forgive us and have mercy upon us). And what forgiveness is more severe than this? May Allah reward Moses (موسى), peace be upon him, for our confusion, as he spoke on our behalf when he said: <<إِنْ هِيَ إِلَّا فِتْنَتُكَ>> (It is nothing but Your trial). You tested Your servants with proofs (الأدلة), yet there is no proof that leads to You. The proof (الدليل) is established to indicate the Establisher, but it does not indicate the Reality (حقيقة) of its Establisher. After deep examination (السبر والتقسيم) and considering what the Ancient Word (الكلام القديم) has granted, we have seen nothing except that You must be the very essence of the Veils (عين الحجب). This is why the veils themselves are veiled (احتجبت الحجب)—we do not see them, despite their being light and darkness. This corresponds to how You named Yourself to us: the Outward (الظاهر) and the Inward (الباطن). You commanded us to be pious toward Allah (أن نتقي الله). If Allah were not the very essence of the Veil—the luminous aspect (النوري) from the Name the Outward, and the dark aspect (الظلمي) from the Name the Inward—we would be polytheists (مشركين). Since it is established that we are Unitarians (موحدون), it is established that You are the very essence of the Veil.\n\n### [Our Veiling from the Real, the Real’s Veiling from Us, and the Negativity of the Divine Attributes]\n\nWe are veiled from You only by You, and You are veiled from us only by Your manifestation (ظهورك). However, we do not know You because we seek You through Your Name (اسمك), just as we seek a king through his name and attribute (صفته), even though he is present with us but not manifest by that Name or that Attribute. Rather, His manifestation is essential (ظهور ذاتي). He speaks to us, and we speak to Him; He witnesses us (يشهدنا), and we witness Him; He grants us gnosis (يعرفنا), but we do not know Him. This is the strongest proof that His Attributes (صفاته) are negative (سلبية) and not affirmative (ثبوتية). For if they were affirmative, they would have been manifested when He manifested by His Essence (ذاته). We only know that He is He through His own instruction (تعريفه). Thus, in gnosis (المعرفة), we are imitators (مقلدون) of Him. If His Attributes were affirmative, they would be the very essence of His Essence (عين ذاته), and we would know Him by the very thing we see. Since the matter is not so, it proves the opposite of what the people of speculative thought (أهل النظر) and the masters of intellectual reflection (أرباب الفكر) among the anthropomorphists (المشبهة) believe regarding the Attributes.\n\n### [There is nothing in Existence but Allah, and nothing in Non-Existence but the Entities of the Contingents]\n\nThis matter has led us to believe regarding all existing things (الموجودات) in their details, that they are the manifestation (ظهور) of the Real (الحق) in the loci of manifestation (مظاهر) of the Fixed Entities (أعيان الممكنات), according to the states of readiness (الاستعدادات) upon which the contingents (الممكنات) subsist. Thus, the Attributes (الصفات) differ upon the Manifested One (الظاهر) because the entities (الأعيان) in which He manifests are different. The existing things are thus distinguished and multiplied due to the multiplicity of the entities and their distinction in themselves. Therefore, there is nothing in Existence (الوجود) except Allah and the rulings (أحكام) of the entities. And there is nothing in substantial non-existence (العدم الشيئى) except the Fixed Entities, prepared to be qualified by Existence. They are not *He* in Existence, because what is manifest are their rulings (أحكامها). So they are *He*, yet they have no entity (عين) in Existence. Thus, they are not *He* as He is, nor is He *He* (in the sense of being limited to them), because He is the Manifested One. The distinction between existing things is intelligible (معقول) and sensible (محسوس) due to the difference in the rulings of the entities. So He is not [them].\n\nO I, He is not I,\nNor is He what He is.\n\nThis is a delicate flirtation (مغازلة رقيقة) and a subtle indication (إشارة دقية) that proof (البرهان) rejected and negated, but direct witnessing (العيان) found and affirmed. Say what you wish after this, for I have informed you of the matter as it truly is. No believer has erred in his belief, nor has any critic been ignorant in his criticism.\n\nThere is nothing but Allah, and the cosmos (الكون) is originated (حادث),\nAnd there is nothing but Allah, and the cosmos is manifest (ظاهر).\nKnowledge (العلم) is nothing but ignorance (الجهل) of Allah, so hold fast\nTo my saying, for soon I shall depart.\nI have no wealth other than my knowledge, and no heir\nExcept the essence (عين) of my children, so this wealth is present.",
    "ur": "(پچاسیواں باب: حجاب اور پردے کے تقویٰ کے بیان میں)\n\nجو شخص پردے کا تقویٰ اختیار کرتا ہے، وہ وہی ہے جو جانتا ہے کہ پردہ اس کی اپنی ذات سے ہے۔\n\nجب اس پر کوئی دن آتا ہے تو وہ دیکھتا ہے کہ وہ اپنے گزرے ہوئے کل پر رو رہا ہے۔\n\nاگر دارِ فنا (Dār al-Fanā’) میں پردہ اٹھا دیا جاتا، اس سے پہلے کہ وہ اس کی قبر میں اٹھایا جاتا۔\n\nتو وہ پا لیتا جو ان مردانِ حق نے پایا جن کی ہمتیں جنتِ قدس سے بھی بلند تھیں۔\n\nاور ان کے راز میں الحق (Al-Ḥaqq) کا چہرہ ظاہر ہو جاتا، کبھی بدر (چاند) میں اور کبھی شمس (سورج) میں۔\n\nپھر وہ اس چیز میں ترجیح نہیں دیکھتا جسے وہ اپنی عقل یا اپنے حس (Ḥiss) سے دیکھتا ہے۔\n\nجس طرح عقل اپنی عقل سے خوف کھاتی ہے، اسی طرح حس (Ḥiss) اپنی حس سے خوف کھاتی ہے۔\n\nاسی وجہ سے متقی شخص تقویٰ اختیار کرتا ہے، جیسے شیطان کے چھونے سے بچنے والا تقویٰ اختیار کرتا ہے۔\n\n### [ہم حجابات کے حجاب کے پیچھے ہیں اور الحق (Al-Ḥaqq) ہم سے رگِ جاں کی جگہ پر ہے]\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ اللہ تعالیٰ نے فرمایا:\n**كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ**\n(ہرگز نہیں! بے شک وہ اس دن اپنے رب سے ضرور محجوب ہوں گے)۔\nاور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n\"بے شک اللہ کے ستر (۷۰) حجاب ہیں جو نور اور ظلمت کے ہیں، اگر وہ انہیں کھول دے تو اس کے چہرے کے انوارِ جلال (سبحات) اس کی مخلوق میں سے ہر اس چیز کو جلا ڈالیں گے جسے اس کی نگاہ پا لے گی۔\"\n\nپس دیکھو یہ حجابات کتنے لطیف اور کتنے پوشیدہ ہیں، کیونکہ اس نے فرمایا:\n**وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ**\n(اور ہم اس سے رگِ جاں سے بھی زیادہ قریب ہیں)۔\nیہ عظیم قرب ہونے کے باوجود ان حجابات کا وجود ہے جو ہمیں اس کے دیدار سے روکتے ہیں۔ اور ہم ان حجابات کی کوئی آنکھ (حقیقت) نہیں دیکھتے، لہٰذا وہ بھی ہم سے محجوب ہیں۔ اور اللہ تعالیٰ نے فرمایا:\n**وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ**\n(اور ہم تم سے زیادہ قریب ہیں لیکن تم نہیں دیکھتے)۔\nہاں، اے ہمارے رب! ہم نہ تجھے دیکھتے ہیں اور نہ ہی حجابات کو دیکھتے ہیں۔ پس ہم حجابات کے حجاب کے پیچھے ہیں، اور تو ہم سے رگِ جاں کی جگہ پر ہے یا ہم سے بھی زیادہ قریب ہے۔ اور یہ قرب ہی عدمِ رؤیت کا سبب ہے، کہ انسان جب تجھ سے متعلق ہو جاتا ہے تو وہ خود کو نہیں دیکھتا، تو وہ تجھے کیسے دیکھے گا جبکہ تو ہماری جانوں سے بھی زیادہ قریب ہے۔ پس قرب کی انتہا حجاب ہے، جیسے کہ بُعد (دوری) کی انتہا حجاب ہے۔\n\n### [وہ حیرت جس نے کمر توڑ دی اور فکر کو حیران کر دیا]\n\nاور وہ حیرت جس نے کمر توڑ دی اور عقل کو حیران کر دیا، وہ تیرا یہ قول اور ہمارا یہ علم ہے کہ اللہ دیکھتا ہے، جیسا کہ تیرے اس قول میں توبیخ اور تنبیہ ہے:\n**أَلَمْ يَعْلَمْ بِأَنَّ اللَّهَ يَرَى**\n(کیا وہ نہیں جانتا کہ اللہ دیکھتا ہے؟)\nاور تیرا یہ قول:\n**وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ**\n(اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔\nپھر تو نے فرمایا کہ اگر تو ہمارے اور اپنے درمیان سے حجابات اٹھا دے، اس وصف کے ساتھ کہ تو انوارِ جلالِ وجہ (سبحات الوجهیۃ) سے موصوف ہے، تو تیری نگاہ جس چیز کو بھی پائے گی وہ تیرے چہرے کے انوارِ جلال (سبحات) سے جل جائے گی۔ اور نور کے ذریعے ہی عالم کا ظہور (وجود) صحیح ہوا، تو پھر وہ اپنی حقیقت سے کیسے معدوم ہو جائے گا؟ یہاں پر حیرت ہے۔\nپھر تو نے دونوں صورتوں میں خود کو تحدید (حد بندی) کے حکم کے تحت داخل کر دیا، اور یہ وہ چیز ہے جس کا انکار وہ عقلی قوت کرتی ہے جو تو نے ہم میں فکری صفت کے ساتھ دیکھنے کے لیے رکھی ہے۔ اور ہمارے پاس حس (Ḥiss) اور عقل کے سوا کچھ نہیں ہے۔ حس سے ہم ادراک نہیں کرتے اور عقل سے بھی ہم ادراک نہیں کرتے۔ پس حد بندی واقع ہو گئی: اگر تو حجاب کے پیچھے ہے تو تو محدود ہے، اور اگر تو حجاب سے بھی زیادہ قریب ہے تو تو محدود ہے۔ اور اگر تو **بِكُلِّ شَيْءٍ مُحِيطٌ** (ہر چیز پر محیط) ہے، تو تو حد کی نفی کے زیادہ قریب ہے۔ تو پھر تو نے خود کو حد میں کیوں داخل کیا، اس چیز کے ذریعے جس کی خبر تو نے ہمیں اپنے اور ہمارے درمیان حائل حجابات کے بارے میں دی؟\n\n### [عقلیں حیران ہو گئیں اور الحق (Al-Ḥaqq) نے عقلوں کے سوا کسی کو مخاطب نہیں کیا]\n\nعقلیں حیران ہو گئیں، اور الحق (Al-Ḥaqq) نے عقلوں کے سوا کسی کو مخاطب نہیں کیا۔ اور اس نے اپنی دلیلوں کو آمنے سامنے نصب کیا، پس جسے ایک دلیل نے ثابت کیا، دوسری نے اس کی نفی کر دی۔\n**إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَاءُ وَتَهْدِي مَنْ تَشَاءُ أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا**\n(یہ تو بس تیری آزمائش (فتنہ) ہے، تو اس کے ذریعے جسے چاہتا ہے گمراہ کرتا ہے اور جسے چاہتا ہے ہدایت دیتا ہے۔ تو ہی ہمارا ولی ہے، پس ہمیں بخش دے اور ہم پر رحم فرما)۔\nاور اس سے بڑی بخشش کیا ہو گی؟ اللہ تعالیٰ ہماری طرف سے موسیٰ علیہ السلام کو جزائے خیر دے، جو حیران ہوئے جب انہوں نے ہماری طرف سے ترجمانی کرتے ہوئے کہا: **إِنْ هِيَ إِلَّا فِتْنَتُكَ** (یہ تو بس تیری آزمائش ہے)۔ تو نے اپنے بندوں کو دلیلوں سے آزمایا، حالانکہ وہاں کوئی دلیل نہیں جو تجھ تک پہنچا سکے۔ دلیل تو اس لیے رکھی گئی ہے کہ وہ اپنے واضع (رکھنے والے) پر دلالت کرے، نہ کہ اپنے واضع کی حقیقت پر دلالت کرے۔\nپس ہم نے سبر و تقسیم (تحقیق و تجزیہ) اور کلامِ قدیم کے عطا کردہ علم کے بعد یہی دیکھا کہ تو ہی حجابات کا عین (حقیقت) ہے۔ اور اسی لیے حجابات محجوب ہیں، پس ہم انہیں نہیں دیکھتے، باوجود اس کے کہ وہ نور اور ظلمت ہیں، اور یہی وہ نام ہیں جن سے تو نے ہمارے لیے اپنا تعارف کرایا ہے: الظاہر (ظاہر) اور الباطن (باطن)۔ اور تو نے ہمیں حکم دیا ہے کہ ہم اللہ کا تقویٰ اختیار کریں۔ اگر اللہ ہی حجاب کا عین نہ ہو، جو اسم الظاہر (Al-Ẓāhir) سے نوری ہے اور اسم الباطن (Al-Bāṭin) سے ظلمی ہے، تو ہم مشرک ہوتے۔ اور یہ ثابت ہے کہ ہم موحد ہیں، پس یہ ثابت ہوا کہ تو ہی حجاب کا عین ہے۔\n\n### [ہمارا الحق (Al-Ḥaqq) سے محجوب ہونا اور الحق (Al-Ḥaqq) کا ہم سے محجوب ہونا اور صفاتِ الٰہیہ کی سلبیہ (Negative) ہونا]\n\nپس ہم تجھ سے محجوب نہیں ہوئے مگر تیرے ہی ذریعے، اور تو ہم سے محجوب نہیں ہوا مگر اپنے ظہور کے ذریعے۔ فرق صرف یہ ہے کہ ہم تجھے نہیں پہچانتے کیونکہ ہم تجھے تیرے نام سے طلب کرتے ہیں، جیسے ہم بادشاہ کو اس کے نام اور صفت سے طلب کرتے ہیں، حالانکہ وہ ہمارے ساتھ موجود ہے لیکن اس نام یا اس صفت کے ساتھ ظاہر نہیں ہے، بلکہ اس کا ظہور ذاتی ہے۔ پس وہ ہم سے کلام کرتا ہے اور ہم اس سے کلام کرتے ہیں، وہ ہمیں شہود (Ash-Shuhūd) کراتا ہے اور ہم اسے شہود کرتے ہیں، وہ ہمیں معرفت (Al-Ma‘rifah) عطا کرتا ہے اور ہم اسے نہیں پہچانتے۔\nاور یہ اس بات پر سب سے قوی دلیل ہے کہ اس کی صفات سلبیہ (Negative) ہیں نہ کہ ثبوتیہ (Affirmative)۔ کیونکہ اگر وہ ثبوتیہ ہوتیں تو جب وہ اپنی ذات کے ساتھ ظاہر ہوتا تو وہ صفات بھی ظاہر ہو جاتیں۔ پس ہم نہیں جانتے کہ وہ وہی ہے مگر اس کے تعارف کرانے سے۔ لہٰذا ہم معرفت (Al-Ma‘rifah) میں اس کے مقلد ہیں۔ اگر اس کی صفات ثبوتیہ ہوتیں تو وہ عینِ ذات ہوتیں، اور ہم اسے اسی چیز سے پہچان لیتے جسے ہم دیکھتے ہیں، لیکن معاملہ ایسا نہیں ہے۔ پس یہ اس عقیدے کے خلاف پر دلالت کرتا ہے جو اہل نظر اور اربابِ فکر (عقلی مشبہہ) صفات کے بارے میں رکھتے ہیں۔\n\n### [ہستی (Al-Wujūd) میں اللہ کے سوا کچھ نہیں اور عدمِ شیئی میں اعیانِ ممکنات (A‘yān al-Mumkināt) کے سوا کچھ نہیں]\n\nاور یہ معاملہ ہمیں اس طرف لے گیا کہ ہم موجودات کے بارے میں ان کی تفصیلات کے ساتھ یہ عقیدہ رکھیں کہ یہ الحق (Al-Ḥaqq) کا ظہور ہے جو اعیانِ ممکنات (A‘yān al-Mumkināt) کے مظاہر میں ان استعدادات کے حکم کے مطابق ہوا جو ممکنات میں ہیں۔ پس ظاہر ہونے والے پر صفات مختلف ہو گئیں کیونکہ وہ اعیان (Al-A‘yān) جن میں وہ ظاہر ہوا، مختلف ہیں۔ پس موجودات متمیز ہو گئیں اور اعیان (Al-A‘yān) کی کثرت اور ان کے آپس میں امتیاز کی وجہ سے متعدد ہو گئیں۔\nپس ہستی (Al-Wujūd) میں اللہ اور احکامِ اعیان (Aḥkām al-A‘yān) کے سوا کچھ نہیں ہے۔ اور عدمِ شیئی میں اعیانِ ممکنات (A‘yān al-Mumkināt) کے سوا کچھ نہیں ہے جو ہستی (Al-Wujūd) کے ساتھ متصف ہونے کے لیے تیار ہیں۔ پس وہ ہستی (Al-Wujūd) میں نہ وہ ہیں (یعنی اعیان) کیونکہ ظاہر ان کے احکام ہیں، اور نہ ہی ان کی ہستی (Al-Wujūd) میں کوئی عین ہے، پس وہ نہ اس کی طرح ہیں اور نہ وہ (الحق) ان کی طرح ہے کیونکہ وہ ظاہر ہے۔ پس وہ (الحق) ہے، اور موجودات کے درمیان امتیاز عقلی اور حسی ہے، جو احکامِ اعیان (Aḥkām al-A‘yān) کے اختلاف کی وجہ سے ہے۔ پس وہ (الحق) نہیں ہے۔\n\nاے میں! وہ میں نہیں ہے، اور نہ وہ وہ ہے جو وہ ہے۔\n\nیہ ایک لطیف چھیڑ چھاڑ اور دقیق اشارہ ہے جسے برہان نے رد کر دیا اور نفی کر دی، اور عیان (مشاہدے) نے اسے پایا اور ثابت کر دیا۔ پس اس کے بعد جو چاہو کہو، کیونکہ میں نے تمہیں اس معاملے کے بارے میں بتا دیا ہے کہ وہ کیا ہے۔ پس کسی معتقد نے اپنے عقیدے میں غلطی نہیں کی اور نہ ہی کسی ناقد نے اپنے تنقید میں جہالت برتی۔\n\nپس وہاں اللہ کے سوا کچھ نہیں اور کائنات حادث ہے۔\n\nاور وہاں اللہ کے سوا کچھ نہیں اور کائنات ظاہر ہے۔\n\nپس اللہ کے بارے میں علم جہل کے سوا کچھ نہیں، لہٰذا میرے قول کو مضبوطی سے تھام لو، کیونکہ میں عنقریب سفر کرنے والا ہوں۔\n\nاور میرے پاس میرے علم کے سوا کوئی مال نہیں، اور میرے بیٹوں کی عین (ذات) کے سوا کوئی وارث نہیں، پس یہ مال حاضر ہے۔",
    "fa": "(باب هشتاد و پنجم در تقوای حجاب و ستر)\n\nآنکه از ستر (پوشش) پروا کند، او کسی است\nکه می‌داند ستر از خود اوست.\n\nچون روزی بر او آید، می‌بیند\nکه بر آنچه در دیروزش از دست رفته، می‌گرید.\n\nاگر ستر در سرای فنا (فناء) برداشته شود\nپیش از آنکه در گور او برداشته شود،\n\nبه آنچه مردانی که همتشان\nاز بهشت‌های قدس او فراتر رفت، دست یافتند، می‌رسید.\n\nو وجه حق (الحق) در سرّشان آشکار می‌شد\nگاه در ماه کاملش و گاه در خورشیدش.\n\nپس در آنچه می‌بیند، ترجیحی نمی‌بیند\nچه با عقلش باشد و چه با حسش.\n\nهمان‌گونه که عقل از عقل خود می‌ترسد\nحس نیز از حس خود می‌ترسد.\n\nبه همین دلیل، پرهیزکار پروا می‌کند\nمانند کسی که از تماس شیطان پروا می‌کند.\n\n[ما پشت حجاب حجاب‌ها هستیم و حق (الحق) از ما در جایگاه رگ گردن است]\n\nبدان، خداوند ما و تو را تأیید کند، که خدای تعالی فرمود: «كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لَمَحْجُوبُونَ» (چنین نیست، آنان در آن روز از پروردگارشان محجوبند). و پیامبر (صلی الله علیه و سلم) فرمود: «همانا خداوند هفتاد حجاب از نور و ظلمت دارد که اگر آن‌ها را بردارد، جلال‌های (سبحات) وجهش هر آنچه را که دیده‌اش از خلقش درک کند، خواهد سوزاند.»\n\nپس بنگر که این حجاب‌ها چقدر لطیف و پنهان هستند؛ زیرا او فرمود: «وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ» (و ما از رگ گردن به او نزدیک‌تریم)، با وجود این حجاب‌ها که ما را از رؤیت او در این قرب (نزدیکی) عظیم باز می‌دارند. و ما برای این حجاب‌ها عین (وجود خارجی) نمی‌بینیم، پس آن‌ها نیز از ما محجوبند. و خدای تعالی فرمود: «وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ» (و ما از شما به او نزدیک‌تریم، ولی شما نمی‌بینید). آری، ای پروردگار ما، نه تو را می‌بینیم و نه حجاب‌ها را؛ پس ما پشت حجاب حجاب‌ها هستیم و تو از ما در جایگاه رگ گردن یا نزدیک‌تر از ما به ما هستی. و این قرب (نزدیکی) سبب عدم رؤیت از جانب ماست، زیرا انسان به تو تعلق دارد و خود را نمی‌بیند، پس چگونه تو را ببیند در حالی که تو از خود ما به ما نزدیک‌تری؟ نهایت قرب (نزدیکی) حجاب است، همان‌گونه که نهایت بُعد (دوری) حجاب است.\n\n[شگفتی‌ای که کمر را شکست و فکر را حیران کرد]\n\nو شگفتی‌ای که کمر را شکست و عقل را حیران کرد، این سخن و علم ماست که خداوند می‌بیند، در سخن تو که توبیخ و تنبیهی است: «أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏» (آیا ندانست که خداوند می‌بیند؟) و سخن تو: «وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ» (و او با شماست هر کجا که باشید). سپس گفتی که اگر حجاب‌ها را میان ما و خودت برداری، به دلیل اینکه به جلال‌های وجه (السبحات الوجهية) متصف هستی، هر آنچه دیده‌ات درک کند، با جلال‌های وجهت خواهد سوخت. و با نور، ظهور عالم که همان هستی (الوجود) آن است، صحیح شد. پس چگونه ایجادی که از حقیقت اوست، معدوم می‌شود؟ حیرت در اینجاست. سپس، در هر دو حالت، خود را تحت حکم تحدید (محدودیت) قرار دادی، و این چیزی است که نیروی عقلی که در ما قرار دادی و با صفت فکری می‌نگرد، آن را انکار می‌کند. و ما جز حس و عقل نداریم؛ با حس درک نمی‌کنیم و با عقل نیز درک نمی‌کنیم. پس تحدید واقع شده است: اگر پشت حجاب باشی، محدود هستی؛ و اگر از حجاب به ما نزدیک‌تر باشی، محدود هستی. و اگر «بِكُلِّ شَيْءٍ مُحِيطٌ» (بر هر چیزی احاطه داری) باشی، به نفی حد نزدیک‌تری. پس چرا خود را در حد وارد کردی با آنچه از حجاب‌های حائل میان ما و خودت به ما خبر دادی؟\n\n[عقل‌ها حیران شدند و حق (الحق) جز عقل‌ها را مخاطب قرار نداد]\n\nعقل‌ها حیران شدند و او جز عقل‌ها را مخاطب قرار نداد و دلایل آن‌ها را متقابل قرار داد؛ پس آنچه را دلیلی اثبات کرد، دیگری نفی نمود: «إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَاءُ وَتَهْدِي مَنْ تَشَاءُ أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا» (این جز آزمون تو نیست، هر که را بخواهی با آن گمراه می‌کنی و هر که را بخواهی هدایت می‌کنی، تو ولیّ ما هستی، پس ما را بیامرز و بر ما رحم کن). و کدام آمرزش سخت‌تر از این است؟ خداوند به موسی (علیه السلام) که حیران بود، از جانب ما پاداش نیکو دهد، زیرا او از طرف ما ترجمه کرد با این سخنش: «إِنْ هِيَ إِلَّا فِتْنَتُكَ» (این جز آزمون تو نیست). بندگانت را با دلایل آزمودی، در حالی که دلیلی نیست که به تو برساند. دلیل وضع شده است تا بر واضع (وضع‌کننده) دلالت کند، نه بر حقیقت واضعش. پس ما پس از بررسی و تقسیم و آنچه کلام قدیم به ما داده است، جز این ندیدیم که تو عین حجاب‌ها هستی. و به همین دلیل، حجاب‌ها محجوب شدند و ما آن‌ها را نمی‌بینیم، با وجود اینکه نور و ظلمت هستند، و این همان چیزی است که تو خود را با آن برای ما نامیدی: الظاهر (آشکار) و الباطن (پنهان). و به ما امر کردی که تقوای خدا را پیشه کنیم. پس اگر خداوند عین حجاب نباشد، که جنبه نوری آن از اسم الظاهر و جنبه ظلمی آن از اسم الباطن است، در غیر این صورت ما مشرک بودیم. و ثابت شده است که ما موحد هستیم، پس ثابت می‌شود که تو عین حجاب هستی.\n\n[احتجاب ما از حق (الحق) و احتجاب حق (الحق) از ما و سلبی بودن صفات الهی]\n\nپس ما جز به واسطه تو از تو محجوب نشدیم و تو نیز جز به واسطه ظهور خودت از ما محجوب نشدی. با این تفاوت که ما تو را نمی‌شناسیم، زیرا تو را از اسمت می‌طلبیم، همان‌گونه که پادشاه را از اسم و صفتش می‌طلبیم، در حالی که او با ماست اما با آن اسم و آن صفت ظاهر نیست، بلکه ظهورش ذاتی است. پس او با ما سخن می‌گوید و ما با او سخن می‌گوییم، او ما را شهود (الشهود) می‌کند و ما او را شهود می‌کنیم، او ما را می‌شناساند ولی ما او را نمی‌شناسیم. و این قوی‌ترین دلیل است بر اینکه صفات او سلبی هستند نه ثبوتی؛ زیرا اگر ثبوتی بودند، هنگامی که با ذات خود ظاهر می‌شد، آن صفات نیز او را آشکار می‌کردند. پس ما نمی‌دانیم که او کیست مگر به واسطه شناساندن او؛ بنابراین ما در معرفت (المعرفة) مقلد او هستیم. اگر صفات او ثبوتی بودند، عین ذات او می‌بودند و ما او را به واسطه همان چیزی که می‌بینیم می‌شناختیم، در حالی که امر چنین نیست. پس این امر بر خلاف اعتقاد اهل نظر و صاحبان فکر که قائل به صفات ثبوتی هستند و از مشبهه (تشبیه‌کنندگان) و صاحبان عقول می‌باشند، دلالت می‌کند.\n\n[در هستی (الوجود) جز خدا نیست و در عدم شیئی جز اعیان ممکنات (الأعيان الممكنات) نیست]\n\nو این امر ما را به این اعتقاد رساند که در موجودات با تمام جزئیاتشان، این ظهور حق (الحق) در مظاهر اعیان ممکنات (الأعيان الممكنات) است، به حکم استعداداتی که ممکنات بر آن هستند. پس صفات بر ظاهر مختلف شدند، زیرا اعیانی که حق (الحق) در آن‌ها ظاهر شده، متفاوت هستند. بنابراین موجودات متمایز و متعدد شدند به دلیل تعدد اعیان و تمایز آن‌ها در ذات خود. پس در هستی (الوجود) جز خدا و احکام اعیان نیست، و در عدم شیئی جز اعیان ممکنات (الأعيان الممكنات) نیست که مهیای متصف شدن به هستی (الوجود) هستند. پس آن‌ها در هستی (الوجود) نه خودشان هستند، زیرا آنچه ظاهر است احکام آن‌هاست. پس آن‌ها هستند، در حالی که در هستی (الوجود) عین (وجود خارجی) ندارند. پس نه آن‌ها مانند او هستند و نه او، زیرا او ظاهر است، پس اوست. و تمایز میان موجودات معقول و محسوس است به دلیل اختلاف احکام اعیان. پس او نیست.\n\nای من، او من نیست\nو او نیز آن او نیست.\n\nاین یک مغازله لطیف و اشاره‌ای دقیق است که برهان آن را رد و نفی کرد، اما عیان (مشاهده) آن را ایجاد و اثبات نمود. پس بعد از این هر چه می‌خواهی بگو، زیرا من تو را از آنچه امر (حقیقت) است آگاه ساختم. پس نه معتقد در اعتقادش خطا کرده و نه منتقد در انتقادش جاهل بوده است.\n\nپس آنجا جز خدا نیست و کائنات حادث است\nو آنجا جز خدا نیست و کائنات ظاهر است.\n\nپس علم جز جهل به خدا نیست، پس به سخن من چنگ زن\nزیرا من به زودی سفر خواهم کرد.\n\nو من مالی جز علمم ندارم و وارثی\nجز عین فرزندانم، پس این مال حاضر است."
  },
  "page_count": 2
}