{
  "id": 395,
  "title": {
    "ar": "الباب الخامس والتسعون وثلاثمائة في معرفة منازلة من دخل حضرتي وبقيت عليه حياته فعزاؤه علي في موت صاحبه",
    "en": "Chapter Three Hundred and Ninety-Five: Concerning the Gnosis of the Station of him who entered My Presence (حضرة) while his life remained upon him, and whose consolation for the death of his companion is incumbent upon Me.",
    "ur": "باب تین سو پچانوے: ان منازل کی معرفت میں جو اس شخص کے لیے ہیں جو میری حضور میں داخل ہوا اور اس کی زندگی اس پر باقی رہی، تو اس کے ساتھی کی موت پر اس کا غم مجھ پر ہے۔",
    "fa": "باب سیصد و نود و پنجم: در معرفت (المعرفة) منازل کسی که به حضرت من وارد شد و حیاتش بر او باقی ماند، پس تسلیت او در مرگ صاحبش بر من است."
  },
  "content": {
    "ar": "## «الباب الخامس والتسعون وثلاثمائة في معرفة منازلة من دخل حضرتي وبقيت عليه حياته فعزاؤه علي في موت صاحبه»\n\n\n> منزل الآلاء والنعم *** عنده مفتاح الكرم‏\n\n\n> وله الحدوث ليس له *** قدم في رتبة القدم‏\n\n\n> وهو حكم عينه عدم *** ما له في الكون من قدم‏\n\n\nقال الله تعالى وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ والمعية صحبة وصح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم المترجم عن ربه بلسان حق لا ينطق عن هوى لكونه شديد القوي اللهم أنت الصاحب في السفر\n\n\nفاتخذه صاحبا له في سفره والسفر من الأسفار وهو الظهور فهو ظاهر الصحبة من الوجه الذي يليق به ويطلق عليه‏\n\n\n### [سر الحياة الإلهية سرى في الموجودات‏]\n\n\nفاعلم أن سر الحياة الإلهية سرى في الموجودات فحييت بحياة الحق فمنها ما ظهرت حياتها لأبصارنا ومنها ما أخذ الله بأبصارنا عنها في الدنيا إلا الأنبياء وبعض أولياء الله فإنه كشف لهم عن حياة كل شي‏ء والمحجوبون يدركونها بالإيمان إذ كانوا مؤمنين وأما من ليس بمؤمن فلا يدرك ذلك لا بالكشف ولا بالإيمان نسأل الله العصمة من الكفر ولسريان هذه الحياة في أعيان الموجودات نطقت كلها مسبحة بالثناء على موجدها إلا أنه صحبت الدعوى في هذه الحياة لكل حي ابتدئ فيتخيلون أن حياتهم لهم حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ فرأوا الأمر على خلاف ما اعتقدوه وهو رؤيتهم أن الحياة التي كانوا بها أحياء هي حياة الحق لا بل هي الحق عينه كما\n\n\nورد في الصحيح كنت سمعه وبصره‏\n\n\nوغير ذلك فمن جملة ذلك أنه حياته فعند ما أبصروا ذلك قالُوا ما ذا قالَ رَبُّكُمْ وما قال حياة ربكم ولهذا قلنا بل هو عين الحق قالُوا الْحَقَّ لما تبين لهم أنه الحق وهُوَ الْعَلِيُّ الْكَبِيرُ عن الحلول والمحل ولكن نسب وإضافات وشهود حقائق فبالوجه الذي يقول فيه إنه سمع العبد به بعينه يقول إنه حياة العبد وعلمه وجميع صفاته وقواه وهي نسب لا أعيان فهو الحي العالم السميع إلى غير ذلك فالعين واحدة وليس إلا ما ظهر فيه عين ما ظهر فالعبد المتحقق بالحق ينكشف له فيتبين أنه الحق أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ فالحياة التي كان يدعى فيها قبل دخوله إلى حضرة الحق لم تبق عليه في هذا الشهود أصلا وضد الحياة الموت فإن اشتبهت عليه الحضرة وتخيل أنه دخل حضرة الحق وما زالت عنه حياته أنها له كما تخيل صاف في عرش إبليس على البحر أنه العرش الذي استوى عليه الرحمن تعالى وجل فقال له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ذلك عرش إبليس كذلك صاحب هذا الشهود إذا رأى أن حياته باقية عليه منسوبة إليه فإن الحق قد مات في حقه وهو يدعي صحبة الحق فالحق يعزيه في موت صاحبه فإنه عنه في هذا الشهود أجنبي فهو الميت على الحقيقة فمن لم يصحبه الحق في جميع صفاته فما هو حق فإن الحق لا يتبعض فإذا كان كان وإذا لم يكن كان في نفس الأمر ولا نعرفه فكن عالما ولا تكن جاهلا ولهذا قيل ما اتخذ الله وليا جاهلا قط وإن الله يتولى بالفعل تعليم أوليائه مما يشهدهم إياه في تجلياته ومثل‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إن الله لا يمل حتى تملوا\n\n\nفمللكم هو في الإشارة ملل الحق ولما كان الحق في حق كل أحد عين اعتقاده فيه وعلمه به ثم غفل عن اعتقاده الذي هو ربه فقد ذهب عن محل عقده ففقده وهو كان صاحبه فعزاه الحق فيه من حيث‏\nما هو لنفسه في الحق الذي كان متعلق عقده قرب كل إنسان على صورة عقده فيه والحق الذي هو حق في نفس الأمر وراء كل معتقد لا بل هو صورة كل معتقد والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Ninety-Five: Concerning the Knowledge of the Station of One Who Enters My Presence, Yet Whose Own Life Remains Attributed to Him, and My Condolences to Him for the Death of His Companion.\n\nThe station of bounties and graces,\nWith him is the key to generosity.\n\nTo him belongs origination (huduth), not\nAn ancient footing in the degree of pre-eternity (qidam).\n\nAnd he is a ruling whose essence is non-existence ('adam),\nHe has no footing in the Cosmos.\n\nAllah the Exalted said: <<وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are). This \"with-ness\" (ma'iyya) is companionship (suhba). It is authentically reported from the Messenger of Allah (may Allah bless him and grant him peace), who speaks for his Lord with a tongue of truth that does not speak out of caprice, because he is mighty in power (shadid al-quwa): \"O Allah, You are the Companion (al-Sahib) in the journey (al-safar).\"\n\nThus, He took him as a Companion in his journey (safar). The journey is one of the manifestations (asfar), which is the act of appearing (al-zuhur). Therefore, He is the manifest Companion in the aspect that is fitting for Him and applicable to Him.\n\n### [The Secret of the Divine Life Permeates the Existents]\n\nKnow that the secret of the Divine Life (al-Hayat al-Ilahiyya) permeates the existents (al-mawjudat), so they are alive by the Life of The Real (Hayat al-Haqq). Of these existents, some have a life that is manifest to our sight, and some have a life from which Allah has veiled our sight in this world, except for the Prophets and some of Allah’s friends (awliya'), for whom the life of everything has been unveiled (kashf). Those who are veiled (al-mahjubun) perceive this life through faith (iman), provided they are believers. As for one who is not a believer, he perceives this neither through unveiling nor through faith. We ask Allah for preservation from disbelief (kufr).\n\nDue to the permeation of this Life into the fixed entities (al-a'yan) of the existents, all of them speak, glorifying and praising their Originator. However, the claim (al-da'wa) of possessing this life accompanies every creature that begins to live, so they imagine that their life belongs to them, until <<حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ>> (when terror is removed from their hearts). Then they see the matter contrary to what they believed, which is their realization that the life by which they were alive is the Life of The Real—nay, rather, it is The Real (al-Haqq) Himself, as is mentioned in the sound Hadith: \"I was his hearing and his sight.\"\n\nAnd other things besides. Among these is that He is his life. When they perceived this, they said: <<قالُوا ما ذا قالَ رَبُّكُمْ>> (They said: \"What did your Lord say?\"). They did not say, \"the life of your Lord.\" This is why we said, rather, He is the very Essence (ayn) of The Real. <<قالُوا الْحَقَّ>> (They said: \"The Truth\"), when it became clear to them that He is The Real. And He is the Exalted, the Great (al-'Aliyy al-Kabir), far above indwelling (hulul) or being contained in a locus (mahall), but rather, these are relations (nisab), attributions (idafat), and the witnessing (shuhud) of realities (haqa'iq).\n\nThus, in the same aspect by which He says that the servant hears by Him, He says that He is the servant's life, his knowledge ('ilm), and all his attributes (sifat) and powers (quwa). These are relations, not fixed entities (a'yan). Therefore, He is the Living (al-Hayy), the Knowing (al-'Alim), the Hearing (al-Sami'), and so on. The Essence (al-'ayn) is one, and there is nothing but that which appears in it, which is the very Essence of what appears. The servant who is realized (mutahaqqiq) in The Real has this unveiled to him, and it becomes clear that He is The Real: <<أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ>> (Unquestionably, He encompasses all things).\n\nThe life that the servant claimed for himself before entering the Divine Presence (Hadrat al-Haqq) does not remain attributed to him at all in this witnessing (shuhud). The opposite of life is death. If the Presence becomes ambiguous to him, and he imagines that he has entered the Divine Presence while his life still remains attributed to him as his own—just as a person sailing on the sea imagined that the throne of Iblis was the Throne upon which the Most Merciful (al-Rahman) established Himself, whereupon the Messenger of Allah (may Allah bless him and grant him peace) told him, \"That is the throne of Iblis\"—\n\nLikewise, the possessor of this witnessing, if he sees that his life remains attributed to him, then The Real has died in respect to him, even though he claims the companionship (suhba) of The Real. Thus, The Real offers him condolences for the death of his companion (sahib), for that companion is a stranger (ajnabi) to him in this witnessing, and he is, in reality, the dead one.\n\nTherefore, whoever is not accompanied by The Real in all his attributes is not The Real, for The Real does not admit division. If He is, He is; and if He is not, He is in the reality of the matter (fi nafs al-amr), though we do not know Him. Be knowledgeable ('alim) and do not be ignorant (jahil). For this reason, it was said: \"Allah never took an ignorant person as a friend (wali) at all.\" Indeed, Allah actively undertakes the teaching of His friends through what He causes them to witness (yushhiduhum) in His theophanies (tajalliyat).\n\nAn example of this is the saying of the Prophet (may Allah bless him and grant him peace): \"Indeed, Allah does not tire until you tire.\" Your tiring, by way of indication (ishara), is the tiring of The Real. Since The Real, in respect to every person, is the very Essence (ayn) of his belief (i'tiqad) in Him and his knowledge ('ilm) of Him, if he then becomes heedless of his belief, which is his Lord, he has departed from the locus of his contract ('aqd) and has lost Him, though He was his Companion. Thus, The Real offers him condolences for that Companion, in the sense that He is for Himself in The Real who was the object of his contract. Every human being is close to the image of his contract concerning Him. The Real who is truly The Real in the reality of the matter is beyond every object of belief—nay, rather, He is the form (sura) of every object of belief. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر ۳۹۵: اس شخص کے مقام کی معرفت میں جو میری (ذات حق کی) حضور میں داخل ہوا اور اس کی زندگی (اس کے لیے) باقی رہی، تو اس کے ساتھی کی موت پر میری طرف سے اس کے لیے تعزیت ہے۔\n\nیہ انعاموں اور نعمتوں کی منزل ہے، اس کے پاس کرم کی کنجی ہے۔\nاس کے لیے حدوث (نئی پیدائش) ہے، رتبۂ قدم (ازلیت) میں اس کے لیے کوئی قدم نہیں۔\nاور وہ حکم ہے جس کا عین (حقیقت) عدم ہے، کائنات میں اس کے لیے کوئی قدم نہیں۔\n\nاللہ تعالیٰ نے فرمایا: **\"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو\"** (الحدید: ۴)۔ اور معیت (ساتھ ہونا) صحبت (صحبة) ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم سے، جو اپنے رب کی طرف سے حق کی زبان سے ترجمانی کرتے ہیں اور خواہش سے کلام نہیں کرتے کیونکہ وہ شدید القوی (طاقتور) ہیں، یہ صحیح ثابت ہے: \"اے اللہ! تو ہی سفر میں ساتھی (الصاحب في السفر) ہے۔\"\n\nپس (اللہ نے) اسے اپنے سفر میں اپنا ساتھی (صاحب) بنا لیا۔ اور سفر (السفر) ظہور (الظہور) کے اسفار (سفروں) میں سے ہے۔ لہٰذا وہ اس پہلو سے صحبت (صحبة) میں ظاہر ہے جو اس کے لائق ہے اور اس پر اطلاق ہوتا ہے۔\n\n### [موجودات میں سرایت کرنے والا حیاتِ الٰہیہ (الحياة الإلهية) کا راز]\n\nپس جان لو کہ حیاتِ الٰہیہ (الحياة الإلهية) کا راز تمام موجودات میں سرایت کر گیا، چنانچہ وہ ذات حق (الحق) کی حیات سے زندہ ہو گئیں۔ ان میں سے کچھ کی زندگی ہماری آنکھوں کے لیے ظاہر ہو گئی، اور کچھ کی زندگی سے اللہ نے دنیا میں ہماری آنکھوں کو پردہ میں رکھا، سوائے انبیاء اور بعض اولیاء اللہ کے۔ کیونکہ ان کے لیے ہر شے کی زندگی کا کشف (الکشف) کر دیا گیا۔ اور محجوب (پردہ میں رکھے گئے) لوگ اسے ایمان کے ذریعے سمجھتے ہیں، بشرطیکہ وہ مومن ہوں۔ لیکن جو مومن نہیں ہے، وہ اسے نہ کشف (الکشف) سے سمجھ سکتا ہے اور نہ ایمان سے۔ ہم اللہ سے کفر سے بچاؤ (العصمة) کا سوال کرتے ہیں۔\n\nاور موجودات کے اعیان (حقیقی وجودوں) میں اس حیات کے سرایت کرنے کی وجہ سے، وہ سب اپنے موجد کی ثناء میں تسبیح کرتی ہیں۔ مگر یہ کہ ہر زندہ مخلوق کے ساتھ اس حیات میں دعویٰ (خود مختاری کا) شامل ہو گیا، چنانچہ وہ یہ گمان کرتے ہیں کہ ان کی زندگی ان کی اپنی ہے۔ یہاں تک کہ **\"جب ان کے دلوں سے گھبراہٹ دور کر دی جائے گی\"** (سبا: ۲۳)، تو وہ معاملے کو اپنے اعتقاد کے خلاف دیکھیں گے۔ اور وہ یہ ہے کہ وہ دیکھیں گے کہ جس زندگی کے ذریعے وہ زندہ تھے، وہ ذات حق (الحق) کی زندگی ہے، بلکہ وہ عین حق (الحق) ہے۔ جیسا کہ صحیح حدیث میں آیا ہے: \"میں اس کی سماعت اور اس کی بصارت بن جاتا ہوں۔\"\n\nاور اس کے علاوہ بھی (صفات ہیں)۔ ان میں سے ایک یہ ہے کہ وہ اس کی زندگی ہے۔ جب انہوں نے یہ دیکھ لیا تو انہوں نے کہا: **\"تمہارے رب نے کیا فرمایا؟\"** (سبا: ۲۳)۔ اور انہوں نے یہ نہیں کہا کہ تمہارے رب کی زندگی نے کیا فرمایا۔ اسی لیے ہم نے کہا کہ بلکہ وہ عین حق (الحق) ہے۔ انہوں نے کہا: **\"حق (سچ) فرمایا\"** (سبا: ۲۳)، جب ان پر واضح ہو گیا کہ وہ حق (الحق) ہے۔ اور وہ حلول (الحلول) اور محل (المحل) سے بلند و برتر (العلي الكبير) ہے۔ لیکن یہ نسبتیں (نسب) اور اضافات (إضافات) اور حقائق کا شہود (شہود حقائق) ہیں۔ پس جس پہلو سے وہ فرماتا ہے کہ وہ بندے کی سماعت ہے، اسی عین (حقیقت) سے وہ فرماتا ہے کہ وہ بندے کی زندگی، اس کا علم، اور اس کی تمام صفات اور قوتیں ہیں۔ اور یہ نسبتیں (نسب) ہیں، نہ کہ اعیان (حقیقی وجود)۔ پس وہ (اللہ) ہی حی (زندہ)، عالم (جاننے والا)، سمیع (سننے والا) ہے، وغیرہ۔ پس عین (حقیقت) ایک ہی ہے، اور جو کچھ ظاہر ہوا ہے وہ عینِ ظاہر ہونے والے کے سوا کچھ نہیں۔ پس وہ بندہ جو حق (الحق) کے ساتھ متحقق (حقیقت پذیر) ہو جاتا ہے، اس کے لیے کشف (الکشف) ہوتا ہے اور یہ واضح ہو جاتا ہے کہ وہ حق (الحق) ہی ہے: **\"خبردار! بے شک وہ ہر چیز پر محیط ہے\"** (فصلت: ۵۴)۔\n\nپس وہ زندگی جس کا وہ ذات حق (الحق) کی حضور (الحضرة) میں داخل ہونے سے پہلے دعویٰ کرتا تھا، اس شہود (الشهود) میں اس پر بالکل باقی نہیں رہتی۔ اور زندگی کی ضد موت ہے۔ اگر اس پر حضور (الحضرة) مشتبہ ہو جائے اور وہ یہ گمان کرے کہ وہ ذات حق (الحق) کی حضور میں داخل ہو گیا ہے، لیکن اس کی زندگی اس سے زائل نہیں ہوئی اور وہ اسی کی ہے، جیسا کہ ایک شخص نے سمندر پر ابلیس کے تخت کو دیکھ کر گمان کیا کہ یہ وہی عرش ہے جس پر رحمن تعالیٰ و جل نے استواء فرمایا ہے۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اسے فرمایا: \"وہ تو ابلیس کا تخت ہے۔\" اسی طرح اس شہود (الشهود) کا حامل شخص جب یہ دیکھے کہ اس کی زندگی اس پر باقی ہے اور اس کی طرف منسوب ہے، تو اس کے حق میں حق (الحق) مر چکا ہے، حالانکہ وہ حق (الحق) کی صحبت (صحبة) کا دعویٰ کرتا ہے۔ پس حق (الحق) اس کے ساتھی کی موت پر اسے تعزیت دیتا ہے۔ کیونکہ وہ (ساتھی) اس شہود میں اس سے اجنبی ہے، لہٰذا حقیقت میں وہی مردہ ہے۔\n\nپس جس کے ساتھ حق (الحق) اس کی تمام صفات میں صحبت (صحبة) نہ کرے، تو وہ حق نہیں ہے۔ کیونکہ حق (الحق) تقسیم نہیں ہوتا۔ پس جب وہ ہوتا ہے تو وہ ہوتا ہے، اور جب وہ نہیں ہوتا تو وہ نفس الامر (حقیقی معاملہ) میں ہوتا ہے اور ہم اسے نہیں جانتے۔ پس عالم بنو، جاہل نہ بنو۔ اسی لیے کہا گیا ہے کہ اللہ نے کبھی کسی جاہل کو اپنا ولی نہیں بنایا۔ اور بے شک اللہ بالفعل اپنے اولیاء کو ان چیزوں کی تعلیم دیتا ہے جن کا وہ انہیں اپنے تجلیات (التجلیات) میں شہود (شہود) کراتا ہے۔ اور اسی طرح رسول اللہ صلی اللہ علیہ وسلم کا یہ فرمان ہے: \"بے شک اللہ نہیں اکتاتا یہاں تک کہ تم اکتا جاؤ۔\" پس تمہارا اکتا جانا اشارے میں حق (الحق) کا اکتا جانا ہے۔\n\nاور چونکہ حق (الحق) ہر شخص کے حق میں اس کے اعتقاد کا عین (حقیقت) ہے اور اس کا علم ہے، پھر جب وہ اپنے اس اعتقاد سے غافل ہو گیا جو اس کا رب ہے، تو وہ اپنے عقد (عہد/اعتقاد) کے محل سے دور ہو گیا اور اسے کھو دیا، حالانکہ وہ اس کا ساتھی تھا۔ پس حق (الحق) نے اس میں اسے تعزیت دی، اس حیثیت سے کہ وہ خود حق (الحق) میں ہے جو اس کے عقد کا متعلق تھا۔ ہر انسان اپنے عقد (اعتقاد) کی صورت پر حق (الحق) کے قریب ہوتا ہے۔ اور وہ حق (الحق) جو نفس الامر (حقیقی معاملہ) میں حق ہے، ہر معتقد سے ماوراء ہے، بلکہ وہ ہر معتقد کی صورت ہے۔ اور **\"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\"** (الاحزاب: ۴)۔",
    "fa": "باب سیصد و نود و پنجم: در معرفت مقام کسی که به حضرت من وارد شد و زندگی‌اش بر او باقی ماند، پس تسلیت او بر من است به خاطر مرگ صاحبش\n\nمنزل نعمت‌ها و بخشش‌هاست *** کلید کرم نزد اوست\nو حدوث (نوپدیدی) از آن اوست، *** در مرتبه قدم (ازلیت) قدمی ندارد\nو او حکمی است که عینش عدم است *** در هستی (کون) هیچ قدمی ندارد\n\nخداوند متعال فرمود: «و او با شماست هر کجا که باشید» (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ). و این معیت (همراهی) همان مصاحبت (صحبة) است. و از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) که مترجم از جانب پروردگارش با زبان حق است و از روی هوی سخن نمی‌گوید، به دلیل آنکه «شدید القوی» است، به صحت رسیده است که فرمود: «اللهم أنت الصاحب في السفر» (بار خدایا، تو در سفر همراهی). پس او (بنده) حق را در سفرش به عنوان صاحب (همراه) گرفت، و سفر از جمله اسفار (سیرها) است که همان ظهور است. پس او (حق) از وجهی که شایسته اوست و بر او اطلاق می‌شود، ظاهرِ مصاحبت است.\n\n### [راز حیات الهی در موجودات جاری است]\n\nپس بدان که راز حیات الهیه (الحياة الإلهية) در موجودات (الموجودات) جاری شد، پس آن‌ها به حیات حق زنده شدند. از این موجودات، برخی حیاتشان برای دیدگان ما آشکار است و برخی دیگر را خداوند در دنیا دیدگان ما را از آن‌ها پوشانده است، مگر انبیا و برخی از اولیای خدا؛ زیرا برای آنان حیات هر شیئی کشف (الکشف) شده است. و محجوبان (پوشیدگان) آن را با ایمان درک می‌کنند، اگر مؤمن باشند. اما کسی که مؤمن نیست، آن را نه با کشف و نه با ایمان درک نمی‌کند. از خداوند درخواست عصمت از کفر داریم. و به دلیل سریان (جریان) این حیات در اعیان (ذوات) موجودات، همه آن‌ها به تسبیح و ثنای آفریننده خود سخن می‌گویند. جز اینکه ادعا (الدعوى) در این حیات، همراه هر موجود زنده‌ای است که آغاز می‌شود، پس گمان می‌کنند که حیاتشان از آنِ خودشان است. تا آنگاه که «هنگامی که ترس از دل‌هایشان برداشته شود» (حَتَّى إِذا فُزِّعَ عَنْ قُلُوبِهِمْ)، امر را بر خلاف آنچه اعتقاد داشتند می‌بینند. و آن، دیدن این حقیقت است که حیاتی که با آن زنده بودند، حیات حق است، بلکه عین حق است، چنانکه در حدیث صحیح آمده است: «کنت سمعه وبصره» (من گوش او و چشم او بودم).\n\nو غیر از آن؛ و از جمله آن است که او (حق) حیات اوست. پس هنگامی که این را مشاهده کردند، گفتند: «پروردگارتان چه گفت؟» (قالُوا ما ذا قالَ رَبُّكُمْ). و نگفتند «حیات پروردگارتان». به همین دلیل گفتیم، بلکه او عین حق است. گفتند: «حق» (قالُوا الْحَقَّ)، هنگامی که برایشان آشکار شد که او حق است. و او «بلندمرتبه و بزرگ» (الْعَلِيُّ الْكَبِيرُ) است و از حلول (درون‌شدن) و محل (جایگاه) بودن منزه است، بلکه این‌ها نسبت‌ها (نسب)، اضافات و شهود (الشهود) حقایق هستند. پس به همان وجهی که می‌گوید او (حق) گوش بنده است، به همان عین می‌گوید که او حیات بنده، علم او، و تمامی صفات و قوای اوست. و این‌ها نسبت‌ها هستند نه اعیان (ذوات). پس او حی (زنده)، عالم (دانا)، سمیع (شنوا) و غیره است. پس عین (ذات) یکی است و جز آنچه عینِ ظاهر در آن ظاهر شده، وجود ندارد. پس برای بنده‌ای که به حق متحقق (واصل) شده است، کشف (الکشف) حاصل می‌شود و برایش آشکار می‌گردد که او حق است: «آگاه باشید که او بر هر چیزی احاطه دارد» (أَلا إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ).\n\nپس حیاتی که پیش از ورود به حضرت حق (حضرة الحق) ادعای مالکیت آن را داشت، در این شهود (الشهود) اصلاً بر او باقی نمی‌ماند. و ضد حیات، مرگ است. اگر حضرت بر او مشتبه شود و گمان کند که وارد حضرت حق شده است، در حالی که حیاتش همچنان از آنِ اوست (به زعم خودش)، مانند کسی که بر تخت ابلیس بر روی دریا نشسته بود و گمان کرد که آن همان عرشی است که خداوند رحمان بر آن استیلا یافته است، پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به او فرمود: «آن عرش ابلیس است.» همچنین صاحب این شهود (الشهود)، اگر ببیند که حیاتش بر او باقی است و به او منسوب است، در این صورت حق در حق او مرده است. و او ادعای مصاحبت حق را دارد، پس حق او را در مرگ صاحبش (حیات ادعایی‌اش) تسلیت می‌گوید. زیرا او در این شهود نسبت به حق بیگانه (أجنبی) است و در حقیقت او مرده است. پس کسی که حق در تمامی صفاتش با او مصاحبت نکند، او حق نیست؛ زیرا حق تجزیه‌پذیر (لا یتبعض) نیست. پس اگر باشد، هست؛ و اگر نباشد (در ادراک ما)، در نفس الأمر (واقعیت امر) هست و ما او را نمی‌شناسیم. پس دانا (عالم) باش و جاهل مباش. و به همین دلیل گفته شده است: «خداوند هرگز ولی (ولی) جاهلی را برنگزید.» و خداوند بالفعل تعلیم اولیای خود را بر عهده می‌گیرد، از آنچه در تجلیات (التجلی) خود به آنان شهود می‌دهد. و مانند فرموده او (صَلَّى اللهُ عَليهِ وسَلَّم): «همانا خداوند خسته نمی‌شود تا زمانی که شما خسته شوید.» پس خستگی شما، به اشاره، خستگی حق است. و چون حق در حق هر کس، عین اعتقاد و علم او به اوست، سپس اگر از اعتقاد خود که پروردگارش است غافل شود، از محل پیمان خود دور شده و او را گم کرده است، در حالی که او صاحبش بود. پس حق او را در مورد او (صاحب از دست رفته) تسلیت می‌گوید، از آن حیث که او (حق) برای خود در حقی است که متعلق پیمان او بود. نزدیکی هر انسانی بر صورت اعتقاد او در حق است. و حقی که در نفس الأمر (واقعیت امر) حق است، ورای هر معتقدی است، بلکه او صورت هر معتقدی است. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}