{
  "id": 297,
  "title": {
    "ar": "الباب السابع والتسعون ومائتان في معرفة منزل ثناء تسوية الطينة الإنسية في المقام الأعلى من الحضرة المحمدية",
    "en": "Chapter Two Hundred and Ninety-Seven: Concerning the Gnosis (معرفة) of the Station (منزل) of the Praise (ثناء) for the Proportioning of the Human Clay (تسوية الطينة الإنسية) in the Highest Station (المقام الأعلى) of the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب دو سو ستانوے (۲۹۷): الحضرة المحمدية (الحضرة المحمدية) کے مقام اعلیٰ میں انسانی طینت (الطينة الإنسية) کی تشکیل کو ہموار کرنے کی تعریف (ثناء) کے منزل کی معرفت۔",
    "fa": "باب دویست و نود و هفتم در معرفت منزل ثنای تسویه طینت انسانی (الطينة الإنسية) در مقام اعلی از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب السابع والتسعون ومائتان في معرفة منزل ثناء تسوية الطينة الإنسية في المقام الأعلى من الحضرة المحمدية»\n\n\n> تنزه أيها الخلق المسوي *** على صفة المسوي بالسواء\n\n\n> ولا تنظر إلى ما حال منه *** وجاء به الرسول من السماء\n\n\n> فإن خفت الرجاء أيدت فيه *** بما تعطيه مأمنة الرجاء\n\n\n> سليمانية وقفت أمامي *** أقيم بها رخاء من رخاء\n\n\n> وقفت على الصفا أعنو لسر *** إلهي بمنزلة الصفاء\n\n\n> وعانقت الغزالة في سناها *** لا علو فوق منزلة السهاء\n\n\n> وجاوزت العقول بغير حد *** وخضت حيا النفوس على حياء\n\n\n### [كل شي‏ء في العالم يسبحون الله‏]\n\n\nقال الله تعالى وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ فما من صورة في العالم وما في العالم إلا صور إلا وهي مسبحة خالقها بحمد مخصوص ألهمها إياه وما من صورة في العالم تفسد إلا وعين فسادها ظهور صورة أخرى في تلك الجواهر عينها مسبحة لله تعالى حتى لا يخلو الكون كله عن تسبيح خالقه فتسبحه أعيان أجزاء تلك الصورة بما يليق بتلك الصورة والصور التي في العالم كلها نسب وأحوال لا موجودة ولا معدومة وإن كانت مشهودة من وجه ما فليست بمشهودة من وجه آخر وعين زمان فناء تلك الصور عين زمان وجود تلك الصور أي عين فسادها هو عين الأخرى لا أنه بعد الفساد تحدث الأخرى‏\n\n\n### [أن العالم كله ما عدا الإنس والجان مستوفى الكشف لما غاب عن الإحساس البشري‏]\n\n\nواعلم إذا علمت هذا أن العالم كله ما عدا الإنس والجان مستوفى الكشف لما غاب عن الإحساس البشري فلا يشاهد أحد من الجن والإنس ذلك الغيب إلا في وقت خرق العوائد لكرامة يكرمه الله بها أو خاصية أمر ما من الأمور التي تعطي كشف الغيوب كما إن كل جماد ونبات وحيوان في العالم كله وفي عالم الإنسان والجن وأجسام الملائكة والأفلاك وكل صورة يدبرها روح محسوسا كان ذلك التدبير فيمن ظهرت حياته أو غير محسوس فيمن بطنت حياته كأعضاء الإنسان وجلوده وما أشبه ذلك كل هؤلاء في محل كشف الغيوب الإلهية المستورة عن الأرواح المدبرة لهذه الأجسام من ملك وإنس وجن لا غير فإنها محجوبة عن إدراك هذا الغيب الإلهي إلا بخرق عادة في بعضهم أو في كلهم وقد عرفت أن الحجر والحيوان والنبات عرف من هذا الباب نبوة محمد صلى الله عليه وسلم وهو من الغيوب الإلهية فيجهل كل روح مثل هذا إلا أن يعرفه الله به إلا من ذكرناهم فإنهم يعرفونه بالفطرة التي فطرهم الله عليها إذا ظهر ناداهم الحق به في ذواتهم باسمه وإذا حضر بعينه أخبرني يوسف ابن يخلف الكومي من أكبر من لقيناه في هذا الطريق سنة ست وثمانين وخمسمائة رحمه الله قال أخبرني موسى السرداني وكان من الأبدال المحمولين قال لما مشيت أنا ورفيقي إلى الجبل المسمى قاف وهو جبل محيط بالبحر\nالمحيط بالأرض وقد خلق الله حية على شاطئ ذلك البحر بين البحر والجبل دارت بجسمها بالبحر المحيط إلى أن اجتمع رأسها بذنبها فوقفنا عندها فقال لي صاحبي سلم عليها فإنها ترد عليك قال موسى فسلمت عليها فقالت وعليك السلام ورحمة الله وبركاته ثم قالت لي كيف حال الشيخ أبي مدين وكان أبو مدين ببجاية في ذلك الوقت فقلت لها تركته في عافية وما علمك به فتعجبت وقالت وهل على وجه الأرض أحد لا يحبه وجهها إنه والله مذ اتخذه الله وليا نادى به في ذواتنا وأنزل محبته إلى الأرض في قلوبنا فما من حجر ولا مدر ولا شجر ولا حيوان إلا وهو يعرفه ويحبه فقلت لها والله لقد ثم أناس يريدون قتله لجهلهم به وبغضهم فيه فقالت ما علمت إن أحدا يكون على هذه الحال فيمن أحبه الله فهذا من ذلك الباب ومنه شهادة الأيدي والأرجل والجلود والأفواه والألسنة التي هي في نظرنا خرس هي ناطقة في نفس الأمر فكل مخلوق ما عدا بنى آدم في مقام الخشوع والتواضع إلا الإنسان فإنه يدعي الكبرياء والعزة والجبروت على الله تبارك وتعالى وأما الجن فتدعى ذلك على من دونها في زعمها من المخلوقين كاستكبار إبليس من حيث نشأته على آدم عليه السلام ولذا قال أَسْجُدُ لِمَنْ خَلَقْتَ طِيناً لأنه رأى عنصر النار أشرف من عنصر التراب وقال أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ وخَلَقْتَهُ من طِينٍ فلم يتكبر على الله عز وجل فاختص الإنسان وحده من سائر المخلوقات بهذه الصفة فلما حصلت مثل هذه الدعوى في الوجود وتحققت من المدعي في نفسه وفيمن اعتقد ذلك فيه مثل فرعون ومن استخف من قومه جعل الله في الوجود أفعل من كذا بمعنى المفاضلة كالمقرر لتلك الدعوى والمثبت لها فقال الله أكبر فأتى بلفظة افعل وقال صلى الله عليه وسلم الله أعلى وأجل‏\n\n\nفأتى بأفعل فكل افعل من كذا المنعوت به جلال الله فسببه مشاركة الدعوى في تلك الصفة لكن منها محمود ومذموم فالمذموم ما ادعاه فرعون والمحمود مثل قوله تعالى عن نفسه إنه أَرْحَمُ الرَّاحِمِينَ وأَحْسَنُ الْخالِقِينَ فأتى بأفعل وأثنى على الرحماء من عباده بأن جعل نفسه أرحم منهم بخلقه وأما تقريره العام فإن الرحمة منهم حقيقة أوجدها فيهم فتراحموا بها وأوجد الكبرياء في الإنسان بالصورة فتكبر به فإن قلت إذا ورد أفعل فليس هو المقصود به أفعل من قلنا فالله يقول أَحْسَنُ الْخالِقِينَ وهو هنا افعل من بلا شك وكذلك في حق الإنسان لما قال تعالى أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فكل موجود فهو على التقويم الذي يعطيه خلقه وقال في الإنسان إنه خلقه في أَحْسَنِ تَقْوِيمٍ أي التقويم الذي خلقه عليه أفضل من كل تقويم وما صحت له هذه الصفة التي فضل بها على غيره إلا بكونه خلقه الله على صورته فإن قلت فهذا التغيير الذي يطرأ على الإنسان في نفسه وصورة الحق لا تقبل التغيير قلنا الله يقول في هذا المقام سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وقال صلى الله عليه وسلم فرغ ربك وقال يتجلى في أدنى صورة ثم يتحول عند إنكارهم إلى الصورة التي عرفوه فيها بالعلامة التي يعرفونها\n\n\nفقد أضاف إلى نفسه هذا المقام وهو العلي عن مقام التغيير بذاته والتبديل ولكن التجليات في المظاهر الإلهية على قدر العقائد التي تحدث للمخلوقين مع الآنات تسمى بهذا المقام وإذا كان الأمر على ما ذكرناه وكذلك هو فيصح ما ذكرناه ويرتفع الاعتراض الوهمي تعالى الله علوا كبيرا\n\n\n### [الحروف المرقومة في الصحف يفهم منها كلام الله‏]\n\n\nومما يتضمن هذا المنزل من العلوم علم أسماء الأسماء وأن لها من الحرمة ما للمسمى بأسمائها فالحروف المرقومة في الصحف أعيان كلام يفهم منها كلام الله الذي هو موصوف به ولما ذا يرجع ذلك الوصف علم آخر اختلف الناس فيه ولا حاجة لنا في الخوض في ذلك فالحق سبحانه من كونه متكلما يذكر نفسه بأسمائه بحسب ما ينسب إليه الكلام الذي لا تكليف نسبته ولتلك الأسماء أسماء عندنا في لغة كل متكلم فيسمى بلغة العرب الاسم الذي سمي به نفسه من كونه متكلما الله وبالفارسية خداي وبالحبشية واق وبلسان الفرنج كربطور وهكذا بكل لسان فهذه أسماء تلك الأسماء وتعددت لتعدد النسب فهي معظمة في كل طائفة من حيث ما تدل عليه ولهذا نهينا عن السفر بالمصحف إلى أرض العدو وهو خط أيدينا أوراق مرقومة بأيدي المحدثات بمداد مركب من عفص وزاج فلو لا هذه الدلالة لما وقع التعظيم لها ولا الحقارة ولهذا يقال كلام قبيح وكلام حسن في عرف العادة وفي عرف الشرع وأمثال ذلك وسببه مدلول هذه الألفاظ في الاصطلاح والوضع وهذا علم شريف لا يدركه سوى أهل الكشف على ما هو\nالأمر عليه فليس بأيدينا سوى أسماء الأسماء فإذا وقع التنزيه لأسماء الأسماء فتنزيه العبد الكامل أولى بالحرمة لأجل الصورة ولا سيما الوجه إذ كان الوجه أشرف ما في ظاهر الإنسان لكونه حضرة جميع القوي الباطنة والظاهرة ووجه كل شي‏ء ذاته‏\n\n\nمر رسول الله صلى الله عليه وسلم على رجل وهو يضرب وجه غلام له فقال له رسول الله صلى الله عليه وسلم اتق الوجه فإن الله خلق آدم على صورته‏\n\n\nوهو محل الإقبال على الله دون غيره من الجهات فهي الجهة العظمى‏\n\n\n### [الفرق بين الخلق والتقدير]\n\n\nومن علوم هذا المنزل العلم بالفرق بين الخلق والتقدير فالتقدير متعلق الاسم المدبر والمفصل لا غيرهما من الأسماء وقد قال يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ وكلا الاسمين تحت حيطة الاسم العالم ولا دخول للاسم القادر في هذه الحضرة فإن هذه الأسماء الثلاثة راجعة إلى ذات الحق ولا يكون الحق مقدورا لنفسه فلا حكم للاسم القادر هنا فالاسم المقدر هو المعتبر في هذه المرتبة والخلق يطلب الاسم القادر عقلا ويطلب الاسم القائل كشفا وشرعا وإنما قلنا كشفا ليفرق في ذلك بين الولي والنبي لأن كل واحد من هذين الرجلين يقول بهذا بخلاف ما يعطيه النظر الفكري للعقل بدليله فكما تميز الاسم القادر من المقدر لفظا ومعنى كذلك تميز الخلق من التقدير لفظا ومعنى فبالتقدير يقع البيان في صور الموجودات على اختلاف ذواتها حسية كانت أو معنوية من عالم الحروف الرقمية أو اللفظية أو الفكرية ومن عالم الأعيان القائمة بأنفسها ومن عالم الأعيان التي لا تقوم بأنفسها ويدخل في ذلك عالم النسب فبما في هذه الأعيان من التسوية لذوات أشخاصها في عالم الغيب والشهادة يكون خلقا ولا يدخل في هذا عالم النسب لأنها ليست أعيانا وجودية ولا تتصف بالعدم المطلق لكونها معقولة وبما فيها كلها من التمييز الذي يتضمنه أعيانها عقلا كان أو حسا يكون للتقدير لا للخلق فإذا ظهر عين ما ذكرناه من كل عالم للحس أو للعقل عن الاسم الخالق أو المدبر المفصل والمقدر علق نفع بعضه ببعض فنفعت الأعيان بعضها بعضا ودعاهم الحق إليه من خلف ستر هذه الأعيان عند توجه بعضها لبعض بالمنافع فيدعو كل صورة من كل صورة إليه فمنا من يشعر فيعرف من دعاه ومنا من يلتبس عليه ذلك ولا يعرف كيف الأمر ويجد في نفسه قوة الفرقان ولا يبدو له وجه الفرقان ومنا من لا يلتبس عليه ذلك ويكون أعمى مكفوف البصر أكمه فيقول ما ثم إلا ما نشاهد وهي أعيان هذه الصور فنحن ثلاثة أصناف صنف سليم النظر حديد الطرف وصنف قام به غشاء في عينيه فلا يتحقق الصور مع معرفته أن ثم أمر أما ولكن لا يحقق صورته ومنا من هو أكمه ما أبصر شيئا قط فهو مستريح الخاطر وما ثم صنف رابع وتختلف منافع هذه الصور باختلاف القوابل والسائلين وكل سائل يسأل بحسب حاجته وعرضه وقد يكون ضروريا وقد لا يكون وعلى الحقيقة ما ثم إلا ضروري ولهذا يتعين العطاء فإن السائل ما يسأل إلا لغرض أحوجه ذلك الغرض إلى السؤال فالغرض هو السائل واللسان بالحال أو بالمقال هو المترجم عن ذلك الغرض وليس لذلك الغرض حياة إلا بتحصيل ما سأل فيه فإن لم ينله هلك فكان المانع له مما سأل فيه كان سبب زوال صورته من العالم فنقص بمنعه صورة من العالم كانت مسبحة لله تعالى والمحقق يريد أنه لو زاد ولا ينقص والأغراض قد تكون مذمومة وإذا مكنت مما تطلبه وقع الإنسان في محظور أشد من قتل هذا الغرض بما منع من سؤاله وكيف التخلص في هذه المسألة فاعلم أنه لا يخاطب بقضاء الأغراض على الإطلاق من هو مقيد معقول في قبضة عقل التكليف وإنما هذا المقام لأصحاب الأحوال المغلوب على عقولهم فإن قلت فالحفظ أحسن كما قال الإمام في وله الشبلي حين قيل له إنه يرد في أوقات الصلوات فإذا فرغ حكم عليه حال الوله وحال بينه وبين عقله الذي يعطيه الصحو فقال الإمام أبو القاسم الجنيد بن محمد سيد هذه الطائفة الحمد لله الذي لم يجر عليه لسان ذنب ولم يضف إليه الذنب ولكن يتعلق به لسان الذنب من حيث الصورة عند من لا يعرفه وهو في نفس الأمر غير مذنب قال بعض أصحابنا فلو لا إن التنزه عن جريان لسان الذنب أولى وأعظم لما حمد الله على ذلك هذا الإمام قلنا ليس الأمر كما زعمت وأن هذا الإمام خاف على من لم يبلغ هذه الرتبة أن يظهر بها وهو غير محقق بها فيخطئ فيقع في الذنب ولهم الشفقة على العالم وأما أن يكون من طريق الأفضلية وكيف يكون ذلك وقد أطلق سبحانه ألسنة عباده عليه وعلى رسله بالذم والسب فلصاحب هذا الوله فيمن ذكرنا أسوة وعز فليس في ذلك فضل عندنا\n\n\n### [علم الرحمة التي أبطنها الله في النسيان الموجود]\n\n\nومما يتضمن هذا المنزل علم الرحمة التي أبطنها الله في النسيان الموجود في العالم وإنه لو لم يكن‏\nلعظم الأمر وشق وفيما يقع فيه التذكر كفاية وأصل هذا وضع الحجاب بين العالم وبين الله في موطن التكليف إذ كانت المعاصي والمخالفات مقدرة في علم الله فلا بد من وقوعها من العبد ضرورة فلو وقعت مع التجلي والكشف لكان مبالغة في قلة الحياء من الله حيث يشهده ويراه والقدر حاكم بالوقوع فاحتجب رحمة بالخلق لعظيم المصاب أ لا تراهم في الأمور المدبرة بالعقل الجارية على السداد العقلي إذا أراد الله إمضاء قضائه وقدره في أمر ما أخفى في ذلك الأمر حكمته وعلمه الذي أجراه له مما لا يقتضيه نظر العقل فإذا أمضاه رد عليهم عقولهم ليعلموا أن الله قد رحمهم بزوال العقل في ذلك الحين لرفع المطالبة\n\n\nقال صلى الله عليه وسلم إن الله إذا أراد نفاذ قضائه وقدره سلب ذوي العقول عقولهم حتى إذا أمضى فيهم قضاءه وقدره ردها عليهم ليعتبروا\n\n\nوقال صلى الله عليه وسلم رفع عن أمتي الخطاء والنسيان‏\n\n\nفلا يؤاخذهم الله به في الدنيا ولا في الآخرة فأما في الآخرة فمجمع عليه من الكل وأما في الدنيا فأجمعوا على رفع الذنب واختلفوا في الحكم وكذلك في الخطاء على قدر ما شرع الشارع في أشخاص المسائل فمن أفطر ناسيا في رمضان فطائفة أوجبت القضاء عليه مع رفع الإثم وقوم لم يوجبوا القضاء عليه مع ارتفاع الإثم أيضا فإن الله أطعمه وسقاه هذا قول الشارع فيه فهذا من الرحمة المبطونة فيه أعني في النسيان وكذلك ما نسي من القرآن ولم يتذكر فينقل إلينا فيكون زيادة علينا في التكليف فرحم عباده بذلك وقد كان صلى الله عليه وسلم يقول اتركوني ما تركتكم‏\n\n\nوقال لو قلت نعم للسائل عن الحج في كل عام لوجبت‏\n\n\nوكانت الأحكام تحدث بحدوث السؤال عن النوازل فكان غرض النبي صلى الله عليه وسلم حين علم ذلك أن يمتنع الناس عن السؤال ويجرون مع طبعهم حتى يكون الحق هو الذي يتولى من تنزيل الأحكام ما شاء فكانت الواجبات والمحظورات تقل وتبقي الكثرة في قبيل المباحات التي لا يتعلق بها أجر ولا وزر فأبت النفوس قبول ذلك وأن تقف عند الأحكام المنصوص عليها فأثبتت لها عللا وجعلتها مقصودة للشارع وطردتها وألحقت المسكوت عنه في الحكم بالمنطوق به بعلة جامعة بينهما اقتضاها نظر الجاعل المجتهد ولو لم يفعل لبقي المسكوت عنه على أصله من الإباحة والعافية فكثرت الأحكام بالتعليل وطرد العلة والقياس والرأي والاستحسان وما كانَ رَبُّكَ نَسِيًّا ولكن بحمد الله جعل الله في ذلك رحمة أخرى لنا لو لا إن الفقهاء حجرت هذه الرحمة على العامة بإلزامهم إياها مذهب شخص معين لم يعينه الله ولا رسوله ولا دل عليه ظاهر كتاب ولا سنة صحيحة ولا ضعيفة ومنعوه أن يطلب رخصة في نازلته في مذهب عالم آخر اقتضاه اجتهاده وشددوا في ذلك وقالوا هذا يفضي إلى التلاعب بالدين وتخيلوا أن ذلك دين وقد قال النبي صلى الله عليه وسلم إن الله تصدق عليكم فأقبلوا صدقته‏\n\n\nفالرخص مما تصدق الله بها على عباده وقد أجمعنا على تقرير حكم المجتهد وعلى تقليد العامي له في ذلك الحكم لأنه عنده عن دليل شرعي سواء كان صاحب قياس أو غير قائل به فتلك الرخصة التي رآها الشافعي في مذهبه على ما اقتضاه دليله قد قررها الشرع فيمنع المفتي من المالكية المالكي المذهب أن يأخذ برخصة الشافعي التي تعبده بها الشارع وإنما أضفناها إلى الشارع لأن الشرع قررها بمنعه مما يقتضيه الدليل في الأخذ به بأمر لا يقتضيه الدليل الذي لا أصل له وهو ربط الرجل نفسه بمذهب خاص لا يعدل عنه إلى غيره ويحجر عليه ما لم يحجر الشرع عليه وهذا من أعظم الطوام وأشق المكلف على عباد الله فالذي وسع الشرع بتقرير حكم المجتهدين من هذه الأمة ضيقه عوام الفقهاء وأما الأئمة مثل أبي حنيفة ومالك وأحمد بن حنبل والشافعي فحاشاهم من هذا ما فعله واحد منهم قط ولا نقل عنهم إنهم قالوا لأحد اقتصر علينا ولا قلدني فيما أفتيتك به بل المنقول عنهم خلاف هذا رضي الله عنهم‏\n\n\n### [الفرق بين تعلق علمه سبحانه بما يسره العبد في نفسه وبين ما يبديه ويظهره‏]\n\n\nومما يتضمنه هذا المنزل الفرق بين تعلق علمه سبحانه بما يسره العبد في نفسه وبين ما يبديه ويظهره وهل يرجع ذلك إلى نسبة واحدة أو نسبتين ويتعلق بهذا الباب ما يريده الحق‏\n\n\nبقوله تعالى من ذكرني في نفسه ذكرته في نفسي ومن ذكرني في ملأ ذكرته في ملأ خير منهم‏\n\n\nفهاتان حالتان في الذكر والعلم فاعلم إن للحق سبحانه غيبا ومظهرا فبما هو غيب له الاسم الباطن وهو ذكره عبده في نفسه وعلمه بما يسره ومع ذلك الاسم يكون سر العبد الذي يعلمه الحق وذكر النفس الذي يذكر العبد به ربه وبما له المظهر من الاسم الظاهر وهو ذكره تعالى عبده في ملأ من ملائكته أو ملأ الأسماء الإلهية وعلمه بما يبديه العبد في عالم الشهادة ومع ذلك الاسم يكون علانية\nالعبد التي يعلمها الحق وذكر العلانية التي يذكر العبد به ربه وأما العلم بما هو أخفى من السر فهو ما لا يعلمه إلا الله وحده لا علم لهذا العبد به ولا يمكن أن يعلمه إلا الله وهو علمه بنفسه وما عدا هذا العلم فهو إما علم سره أو علم علانية فمتعلق العلم ثلاثة أشياء الجهر والسر وما هو أخفى من السر ومتعلق الذكر أمران ذكر الملإ وهو نوعان ملأ الأسماء وملأ الملائكة والأمر الآخر ذكر النفس فتساوي الذكر مع العلم في التقسيم‏\n\n\n### [إن الله قد أودع في الإنسان علم كل شي‏ء]\n\n\nومما يتضمن هذا المنزل كون الإنسان قد أودع الله فيه علم كل شي‏ء ثم حال بينه وبين أن يدرك ما عنده مما أودع الله فيه وما هو الإنسان مخصوص بهذا وحده بل العالم كله على هذا وهو من الأسرار الإلهية التي ينكرها العقل ويحيلها جملة واحدة وقربها من الذوات الجاهلة في حال علمها قرب الحق من عبده وهو قوله تعالى ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ وقوله ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ ومع هذا القرب لا يدرك ولا يعرف إلا تقليدا ولو لا إخباره ما دل عليه عقل وهكذا جميع ما لا يتناهى من المعلومات التي بعلمها هي كلها في الإنسان وفي العالم بهذه المثابة من القرب وهو لا يعلم ما فيه حتى يكشف له عنه مع الآنات ولا يصح فيه الكشف دفعة واحدة لأنه يقتضي الحصر وقد قلنا إنه لا يتناهى فليس يعلم الأشياء بعد شي‏ء إلى ما لا يتناهى وهذا من أعجب الأسرار الإلهية أن يدخل في وجود العبد ما لا يتناهى كما دخل في علم الحق ما لا يتناهى من المعلومات وعلمه عين ذاته والفرق بين تعلق علم الحق بما لا يتناهى وبين أن يودع الحق في قلب العبد ما لا يتناهى إن الحق يعلم ما في نفسه وما في نفس عبده تعيينا وتفصيلا والعبد لا يعلم ذلك إلا مجملا وليس في علم الحق بالأشياء إجمال مع علمه بالإجمال من حيث إن الإجمال معلوم للعبد من نفسه ومن غيره فكل ما يعلمه الإنسان دائما وكل موجود فإنما هو تذكر على الحقيقة وتجديد ما نسيه ويحكم هذا المنزل على إن العبد أقامه الحق في وقت ما في مقام تعلق علمه بما لا يتناهى وليس بمحال عندنا وإنما المحال دخول ما لا يتناهى في الوجود لا تعلق العلم به ثم إن الخلق أنساهم الله ذلك كما أنساهم شهادتهم بالربوبية في أخذ الميثاق مع كونه قد وقع وعرفنا ذلك بالأخبار الإلهي فعلم الإنسان دائما إنما هو تذكر فمنا من إذا ذكر تذكر أنه قد كان علم ذلك المعلوم ونسيه كذي النون المصري ومنا من لا يتذكر ذلك مع إيمانه به أنه قد كان يشهد بذلك ويكون في حقه ابتداء علم ولو لا أنه عنده ما قبله من الذي أعلمه ولكن لا شعور له بذلك ولا يعلمه إلا من نور الله بصيرته وهو مخصوص بمن حاله الخشية مع الأنفاس وهو مقام عزيز لأنه لا يكون إلا لمن يستصحبه التجلي دائما ويتضمن هذا المنزل مسائل ذي النون المشهورة وهي إيجاد المحال العقلي بالنسب الإلهية ويتضمن علم المفاضلة بين المتنافرين من جميع الوجوه ويتضمن أن كل جوهر في العالم يجمع كل حقيقة في العالم كما إن كل اسم إلهي مسمى بجميع الأسماء الإلهية وذلك قوله تعالى قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ وهذا العلم خاصة انفردت به دون الجماعة في علمي فلا أدري هل عثر عليه غيري وكوشف به أم لا من جنس المؤمنين أهل الولاية لا جنس الأنبياء وأما في الأسماء الإلهية فقد قال به أبو القسم بن قسي في خلع النعلين له فرحم الله عبدا بلغه إن أحدا قال بهذه المسألة عن نفسه كما فعلت أنا أو عن غيره فيلحقها بكتابي هذا في هذا الموضع استشهاد إلي فيما ادعيته فإني أحب الموافقة وأن لا أنفرد بشي‏ء دون أصحابي والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Ninety-Seven: Concerning the Knowledge of the Station of Praising the Leveling of the Human Clay in the Highest Degree of the Muhammadan Presence\n\nBe transcendent, O leveled creation,\nUpon the Attribute of the Leveler, in equilibrium.\n\nAnd do not look at what has changed from it,\nAnd what the Messenger brought from the Heaven.\n\nFor if you fear hope, you are supported therein,\nBy what the security of hope grants.\n\nA Solomonic [wisdom] stood before me,\nBy which I establish ease upon ease.\n\nI stood upon the Purity, submitting to a secret,\nDivine, in the station of Clarity.\n\nAnd I embraced the Gazelle in its radiance,\nThere is no height above the station of Sublimity.\n\nAnd I surpassed the intellects without limit,\nAnd I traversed the life of the souls with modesty.\n\n### [Everything in the World Glorifies God]\n\nAllah the Exalted said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing except that it glorifies [Him] with His praise). There is no form (*sura*) in the world—and there is nothing in the world but forms—except that it glorifies its Creator with a specific praise that He inspired in it. And there is no form in the world that corrupts except that the very essence of its corruption is the appearance of another form in those same substances (*jawahir*), which is itself glorifying God the Exalted, such that the entire cosmos (*al-kawn*) is never devoid of glorifying its Creator. Thus, the essences (*a'yan*) of the parts of that form glorify Him in a manner befitting that form. The forms in the world are all relations (*nisab*) and states (*ahwal*), neither existent (*mawjudah*) nor non-existent (*ma'dumah*). Even if they are witnessed from one perspective, they are not witnessed from another. The very time of the annihilation (*fana'*) of those forms is the very time of their existence (*wujud*); that is, the essence of their corruption is the essence of the other [form], not that the other [form] comes into being after the corruption.\n\n### [That the Entire World, Except for Humans and Jinn, is Fully Endowed with Unveiling of What is Hidden from Human Sensation]\n\nKnow, if you have understood this, that the entire world, excluding humans (*al-ins*) and jinn (*al-jann*), is fully endowed with the Unveiling (*al-kashf*) of what is hidden from human sensation. No one among the jinn or humans witnesses that Unseen (*al-ghayb*) except at the time of the breaking of habits (*kharq al-'awa'id*)—either through a miracle (*karamah*) with which God honors him, or through a specific property of a certain matter that grants the unveiling of the Unseen.\n\nJust as every inanimate object, plant, and animal in the entire world, and in the world of humans and jinn, and the bodies of the angels and the celestial spheres, and every form managed by a spirit—whether that management is perceptible (in those whose life is manifest) or imperceptible (in those whose life is hidden, such as the limbs and skins of humans and the like)—all of these are in the locus of the Unveiling of the Divine Unseen (*al-ghuyub al-ilahiyyah*) that is concealed from the spirits managing these bodies, whether they be angels, humans, or jinn, and no others. For these spirits are veiled from perceiving this Divine Unseen, except through the breaking of a habit in some or all of them.\n\nYou have already learned that the stone, the animal, and the plant knew the prophethood of Muhammad (PBUH) through this door, and that is one of the Divine Unseen matters. Every spirit is ignorant of such things unless God makes it known to him, except for those we mentioned, for they know it by the innate nature (*fitrah*) upon which God created them. When [the Prophet] appeared, the Real (*al-Haqq*) called them to him in their very essences (*dhawat*) by His Name, and when he was present in person, [they knew him].\n\nYusuf ibn Yakhluf al-Kumi, one of the greatest people we met on this path, may God have mercy on him, informed me in the year 586 AH. He said: Musa al-Sardani, who was one of the transported Substitutes (*al-Abdal al-mahmulin*), informed me, saying: When my companion and I walked to the mountain called Qaf—which is a mountain surrounding the ocean that surrounds the Earth—God created a serpent on the shore of that ocean, between the sea and the mountain. It encircled the surrounding ocean with its body until its head met its tail. We stood by it, and my companion said to me, \"Greet it, for it will return your greeting.\" Musa said: I greeted it, and it replied, \"And upon you be peace and the mercy of God and His blessings.\" Then it asked me, \"How is Shaykh Abu Madyan?\" (Abu Madyan was in Bijaya at that time.) I replied, \"I left him in good health. How do you know of him?\" She was astonished and said, \"Is there anyone on the face of the Earth who does not love him? By God, ever since God took him as a friend (*wali*), He proclaimed him in our essences and sent down his love into our hearts on Earth. There is no stone, clod, tree, or animal that does not know him and love him.\" I said to her, \"By God, there are people who wish to kill him due to their ignorance of him and their hatred for him.\" She said, \"I did not know that anyone could be in such a state regarding one whom God loves.\"\n\nThis is from that door [of knowledge]. From this door also is the witnessing (*shahadah*) of the hands, feet, skins, mouths, and tongues—which in our view are mute—but are in reality speaking.\n\nEvery creature, except for the children of Adam, is in the station of humility (*khushu'*) and lowliness. Only the human being claims arrogance (*kibriya'*), might (*'izzah*), and domination (*jabarut*) against God, blessed and exalted is He. As for the jinn, they claim this against those they deem beneath them among the creatures, such as the arrogance of Iblis based on his origin against Adam (peace be upon him). That is why he said, <<أَأَسْجُدُ لِمَنْ خَلَقْتَ طِيناً>> (Shall I prostrate to one You created from clay?), because he saw the element of fire as nobler than the element of dust, and he said, <<أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ وَخَلَقْتَهُ مِنْ طِينٍ>> (I am better than him. You created me from fire and created him from clay). He did not claim arrogance against God, the Mighty and Majestic.\n\nThus, the human being alone, among all creatures, is distinguished by this attribute. When such a claim arose in Existence (*al-wujud*) and was realized by the claimant in himself and by those who believed in him (like Pharaoh and those of his people whom he misled), God established in Existence the form \"more X than Y\" (the superlative *af'al min kadha*) as a confirmation and affirmation of that claim. Thus, God said, *Allahu Akbar* (God is Greater), using the superlative form (*af'al*). And the Prophet (PBUH) said, *Allahu A'la wa Ajall* (God is Higher and Nobler), also using the superlative form.\n\nTherefore, every superlative description (*af'al min kadha*) used to describe God’s Majesty is caused by the participation of the claim in that attribute, though some claims are praiseworthy and some are blameworthy. The blameworthy is what Pharaoh claimed. The praiseworthy is like God’s saying about Himself that He is <<أَرْحَمُ الرَّاحِمِينَ>> (The Most Merciful of the merciful ones) and <<أَحْسَنُ الْخَالِقِينَ>> (The Best of creators), using the superlative form, and praising the merciful among His servants by making Himself more merciful than them toward His creation.\n\nAs for the general affirmation of this, the mercy they possess is a reality (*haqiqah*) that He created in them, by which they show mercy to one another. And He created arrogance (*kibriya'*) in the human being through the Form (*sura*), by which he becomes arrogant.\n\nIf you say that when the superlative form (*af'al*) is used, it is not intended to mean \"more X than Y,\" we reply: God says <<أَحْسَنُ الْخَالِقِينَ>> (The Best of creators), and here it is undoubtedly \"more X than Y.\" Likewise, concerning the human being, when the Exalted said, <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (He gave every thing its creation), every existent thing is upon the proper constitution (*taqwim*) that its creation grants it. And He said concerning the human being that He created him in <<أَحْسَنِ تَقْوِيمٍ>> (the best constitution), meaning the constitution upon which He created him is superior to every other constitution. This attribute, by which he is favored over others, is only valid because God created him upon His Form (*sura*).\n\nIf you say: But this change (*taghyir*) occurs to the human being in himself, and the Form of the Real does not accept change. We reply: God says in this context, <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ>> (We shall attend to you, O you two heavy ones [humans and jinn]). And the Prophet (PBUH) said, \"Your Lord has attended.\" And he said, \"He manifests Himself in the lowest form, then transforms, upon their denial, into the form by which they knew Him, with the sign they recognize.\"\n\nThus, He attributed this station to Himself, though He is exalted far above the station of change (*taghyir*) and alteration (*tabdil*) in His Essence (*Dhat*). However, the Theophanies (*al-tajalliyat*) in the Divine Manifestations (*al-mazahir al-ilahiyyah*) occur according to the beliefs that arise for the creatures, and these are called by this station in the moments [of manifestation]. If the matter is as we have stated—and indeed it is—then what we have mentioned is sound, and the illusory objection is removed. Exalted is God in great exaltation.\n\n### [The Letters Inscribed in the Pages are Understood as the Speech of God]\n\nAmong the sciences contained in this station is the knowledge of the names of the Names (*asma' al-asma'*), and that they possess the same sanctity (*hurmah*) as the Named One possesses by His Names. The letters inscribed (*al-huruf al-marqumah*) in the pages are the very entities (*a'yan*) of speech, from which the Speech of God (*Kalam Allah*), with which He is described, is understood. The reason why that description returns [to the Essence] is another science about which people have differed, and we have no need to delve into that.\n\nThe Real (*al-Haqq*), glorified is He, by virtue of being the Speaker (*mutakallim*), mentions Himself by His Names according to the attribution of the Speech that does not require obligation (*taklif*). And those Names have names with us in the language of every speaker. Thus, the Name by which He named Himself, by virtue of being the Speaker, is called *Allah* in the Arabic language, *Khuday* in Persian, *Waq* in Abyssinian, and *Kribtor* in the language of the Franks, and so on in every tongue. These are the names of those Names. They multiplied due to the multiplicity of relations (*nisab*). They are revered in every community according to what they signify.\n\nFor this reason, we were forbidden from traveling with the Quran (*Mushaf*) to the land of the enemy, even though it is merely the writing of our hands—pages inscribed by the hands of created beings with ink composed of gallnuts and vitriol. Were it not for this signification (*dalalah*), neither reverence nor contempt would be accorded to it. This is why, in common usage and in the usage of the Law (*shar'*) and the like, we speak of \"ugly speech\" and \"beautiful speech.\" The reason for this is the meaning signified by these words in convention and usage.\n\nThis is a noble science that only the People of Unveiling (*Ahl al-Kashf*) grasp as the matter truly is. We possess nothing but the names of the Names. If the names of the Names are accorded transcendence (*tanzih*), then the transcendence of the Perfect Servant (*al-'abd al-kamil*) is even more worthy of sanctity because of the Form (*sura*), especially the face (*al-wajh*), since the face is the noblest part of the human exterior, being the presence (*hadrah*) of all inner and outer powers. The face of everything is its Essence (*Dhat*).\n\nThe Messenger of God (PBUH) passed by a man who was striking the face of his slave. The Messenger of God (PBUH) said to him: \"Fear the face, for Allah created Adam upon His Form.\"\n\nThe face is the locus of turning toward God, unlike other directions; thus, it is the Greatest Direction (*al-jihah al-'uzma*).\n\n### [The Difference Between Creation and Determination]\n\nAmong the sciences of this station is the knowledge of the difference between Creation (*al-khalq*) and Determination (*al-taqdir*). Determination is related to the Name *Al-Mudabbir* (The Director) and *Al-Mufassil* (The Detailer), and no other Names. He said, <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ>> (He directs the affair; He details the signs). Both of these Names are encompassed by the Name *Al-'Alim* (The All-Knowing). The Name *Al-Qadir* (The Powerful) has no entry into this Presence (*hadrah*), for these three Names refer back to the Essence (*Dhat*) of the Real, and the Real cannot be \"powered over\" by Himself. Thus, the Name *Al-Muqaddir* (The Determiner) is the one considered in this level (*martabah*).\n\nCreation (*al-khalq*) requires the Name *Al-Qadir* intellectually (*'aqlan*), and it requires the Name *Al-Qā'il* (The Speaker/Establisher) through unveiling (*kashfan*) and law (*shar'an*). We say \"through unveiling\" to distinguish between the saint (*wali*) and the prophet (*nabi*), for both of these men affirm this, unlike what intellectual speculation grants the mind through its proof.\n\nJust as the Name *Al-Qadir* is distinguished from *Al-Muqaddir* in wording and meaning, so too is Creation distinguished from Determination in wording and meaning.\n\nThrough Determination, the clarification (*bayan*) occurs in the forms of existing things, according to the difference in their essences, whether sensory or intellectual—from the world of numerical, verbal, or conceptual letters, and from the world of Fixed Entities (*al-a'yan al-thabitah*) that subsist by themselves, and from the world of entities that do not subsist by themselves. The world of relations (*nisab*) is included in this.\n\nBy virtue of the leveling (*taswiyah*) of the essences of their individuals in the world of the Unseen and the Witnessed, [the process] is Creation (*khalq*). The world of relations is not included in this, as they are not existential entities (*a'yan wujudiyyah*), nor are they described by absolute non-existence, since they are intelligible.\n\nBy virtue of the distinction (*tamiyiz*) contained within all of these entities, whether intellectually or sensually, [the process] is Determination (*taqdir*), not Creation.\n\nWhen the essence of what we have mentioned from every world appears to the sense or the intellect, originating from the Name *Al-Khaliq* (The Creator) or *Al-Mudabbir* (The Director), *Al-Mufassil* (The Detailer), and *Al-Muqaddir* (The Determiner), the benefit of some is attached to the benefit of others. Thus, the entities benefit one another. The Real calls them to Himself from behind the veil of these entities when some turn to others for benefits. Thus, every form calls every other form to Him.\n\nSome of us are aware and know who called them. Some are confused by this and do not know how the matter stands, finding within themselves the power of discernment (*furqan*) but not seeing the face of that discernment. And some are blind (*a'mah*), sightless, and say, \"There is nothing but what we witness, and these are the entities of these forms.\"\n\nWe are three types: 1) The sound of sight, sharp of vision. 2) The one whose eyes are covered by a veil, so he does not realize the forms, even though he knows that there is a matter, but he does not realize its form. 3) The one who is utterly blind (*akmah*) and has never seen anything, so he is at ease in his mind. There is no fourth type.\n\nThe benefits of these forms differ according to the differences in the recipients (*qawabil*) and the askers (*sa'ilin*). Every asker asks according to his need and purpose (*gharad*). This may be necessary (*daruri*) or not. In reality, there is nothing but the necessary, and for this reason, the granting [of the request] is incumbent. The asker only asks for a purpose that compels him to ask. The purpose is the asker, and the tongue, whether by state (*hal*) or by speech (*maqal*), is the translator of that purpose. That purpose has no life except by obtaining what it asked for. If it does not obtain it, it perishes. Thus, the one who prevents it from what it asked for becomes the cause of the removal of its form from the world, thereby diminishing a form in the world that was glorifying God the Exalted. The realized one (*al-muhaqqiq*) desires that [existence] should increase, not decrease.\n\nHowever, purposes may be blameworthy, and if the person is enabled to obtain what he seeks, he falls into a prohibition more severe than killing that purpose by denying his request. How is one to escape this dilemma?\n\nKnow that the one who is bound and constrained in the grasp of the intellect of obligation (*'aql al-taklif*) is not addressed concerning the fulfillment of purposes absolutely. This station belongs only to the People of States (*Ashab al-Ahwal*) whose intellects are overcome (*maghlub 'ala 'uqulihim*).\n\nIf you say: Preservation [of the intellect] is better, as the Imam [Al-Junayd] said concerning his disciple Al-Shibli, when it was said that [Shibli] would return to his senses during prayer times, but once finished, the state of ecstasy (*walah*) would rule him and intervene between him and his intellect that grants sobriety (*sahw*). Imam Abu al-Qasim al-Junayd ibn Muhammad, the master of this community, said: \"Praise be to God who did not allow the tongue of sin to run upon him, nor did He attribute sin to him.\" However, the tongue of sin may attach to him outwardly in the view of those who do not know him, though in reality, he is not a sinner.\n\nSome of our companions said: If transcendence from the running of the tongue of sin were not better and greater, this Imam would not have praised God for it. We reply: The matter is not as you claim. Rather, this Imam feared that someone who had not reached this rank might manifest it without having realized it, thus erring and falling into sin. They have compassion for the world. But as for it being a matter of preference, how could that be, when the Glorified One has allowed the tongues of His servants to utter blame and abuse against Him and His Messengers? The person in this state of ecstasy has an example and honor in those we mentioned, so there is no preference in that, in our view.\n\n### [The Knowledge of the Mercy God Concealed in Existing Forgetfulness]\n\nAmong the sciences contained in this station is the knowledge of the mercy that God concealed in the forgetfulness (*al-nisyan*) existing in the world. If it were not for this, the matter would be immense and difficult, and there is sufficiency in what occurs through recollection (*tadhakkur*).\n\nThe origin of this is the placement of the Veil (*al-hijab*) between the world and God in the realm of obligation (*mawtin al-taklif*). Since sins and transgressions are predetermined in God’s Knowledge, they must necessarily occur from the servant. If they occurred alongside Theophany (*tajalli*) and Unveiling (*kashf*), it would be an extreme lack of shame before God, since the servant would be witnessing and seeing Him while destiny rules the occurrence [of the sin]. So, He veiled Himself as a mercy to creation due to the magnitude of the affliction.\n\nDo you not see that in matters managed by the intellect and proceeding according to rational soundness, when God intends to execute His decree (*qada'*) and destiny (*qadar*) in a certain affair, He conceals in that affair His wisdom and knowledge that He has ordained for it, which the rational mind does not require? When He executes it, He restores their intellects to them so they may know that God has shown them mercy by the removal of the intellect at that time, thereby lifting the demand for accountability.\n\nThe Prophet (PBUH) said: \"Indeed, when God intends to execute His decree and destiny, He strips the intelligent ones of their intellects, until, when He has executed His decree and destiny upon them, He restores them so they may reflect.\"\n\nAnd the Prophet (PBUH) said: \"Mistake (*al-khata'*) and forgetfulness (*al-nisyan*) have been lifted from my community.\"\n\nThus, God does not hold them accountable for it in this world or the Hereafter. As for the Hereafter, there is consensus on this. As for this world, they agreed on the lifting of the sin, but differed on the ruling, and likewise concerning mistake, according to what the Lawgiver prescribed in specific cases. For example, regarding one who breaks the fast in Ramadan forgetfully, one group obligated him to make up the fast (*qada'*) while lifting the sin, and another group did not obligate him to make up the fast, while also lifting the sin, because God fed him and gave him drink—this is the statement of the Lawgiver concerning him. This is part of the mercy concealed within forgetfulness.\n\nLikewise, what was forgotten of the Quran and not recalled, so it was not transmitted to us, would have been an increase in obligation upon us. Thus, He showed mercy to His servants by this.\n\nThe Prophet (PBUH) used to say: \"Leave me alone as long as I leave you alone.\"\n\nAnd he said: \"If I had said 'Yes' to the questioner about Hajj being required every year, it would have become obligatory.\"\n\nRulings used to arise with the occurrence of questions about new cases (*nawazil*). The Prophet's intention, when he knew this, was for people to refrain from asking and to proceed according to their nature, so that the Real Himself would take charge of revealing the rulings He willed. Thus, the obligations (*wajibāt*) and prohibitions (*mahzūrāt*) would decrease, and the majority would remain in the category of permissible things (*mubahat*) to which neither reward nor sin is attached.\n\nBut souls refused to accept this and to stop at the explicitly stated rulings. They established causes (*'ilal*) for them, deemed them intended by the Lawgiver, extended them, and attached the unmentioned ruling to the mentioned ruling by a comprehensive cause required by the view of the establishing jurist (*mujtahid*). If they had not done so, the unmentioned ruling would have remained upon its original state of permissibility and well-being (*'afiyah*). Thus, rulings multiplied through causal reasoning (*ta'lil*), extension of the cause, analogy (*qiyas*), opinion (*ra'y*), and preference (*istihsan*).\n\n<<وَمَا كَانَ رَبُّكَ نَسِيًّا>> (And your Lord is never forgetful). But praise be to God, He placed another mercy in this for us. If only the jurists had not restricted this mercy upon the common people by obligating them to the school (*madhhab*) of a specific person whom neither God nor His Messenger appointed, nor was indicated by the apparent text of the Book or a sound or weak Sunnah. They prevented the layman from seeking a concession (*rukhsah*) in his case according to the school of another scholar whose independent judgment (*ijtihad*) required it. They were strict in this and claimed that it leads to trifling with religion, imagining that this was religion.\n\nYet the Prophet (PBUH) said: \"Indeed, God has given you charity, so accept His charity.\"\n\nConcessions are among the things God has given as charity to His servants. We have agreed upon the affirmation of the ruling of the *mujtahid* and the layman's imitation (*taqlid*) of him in that ruling, because, in the *mujtahid*'s view, it is based on a legal proof. Thus, the concession that Al-Shafi'i saw in his school, according to what his proof required, has been affirmed by the Law (*shar'*) itself. Yet the jurist of the Maliki school prevents the Maliki follower from taking the concession of Al-Shafi'i, which the Lawgiver has made an act of worship for him. We attribute it to the Lawgiver because the Law affirmed it by affirming the *mujtahid*'s ruling. [The jurist] prevents him based on a matter that is not required by any proof and has no basis: namely, binding oneself to a specific school and not deviating from it to another, and restricting what the Law has not restricted. This is one of the greatest calamities (*tawamm*) and the most difficult burdens placed upon God's servants. That which the Law expanded by affirming the rulings of the *mujtahids* of this community has been narrowed by the common jurists. As for the Imams themselves, such as Abu Hanifa, Malik, Ahmad ibn Hanbal, and Al-Shafi'i, far be it from them! Not one of them ever did this, nor is it transmitted from them that they told anyone, \"Confine yourself to us,\" or \"Imitate me in what I have ruled for you.\" Rather, what is transmitted from them is the opposite of this, may God be pleased with them.\n\n### [The Difference Between the Relation of His Knowledge to What the Servant Conceals Within Himself and What He Manifests]\n\nAmong the contents of this station is the difference between the relation of His Knowledge (glorified is He) to what the servant conceals within himself and what he reveals and manifests, and whether this returns to one relation or two. Related to this chapter is what the Real intends by His saying: <<مَنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَمَنْ ذَكَرَنِي فِي مَلَأٍ ذَكَرْتُهُ فِي مَلَأٍ خَيْرٍ مِنْهُمْ>> (If he remembers Me in himself, I remember him in Myself; and if he remembers Me in an assembly, I remember him in an assembly better than it).\n\nThese are two states in remembrance (*dhikr*) and knowledge (*'ilm*). Know that the Real (glorified is He) has an Unseen (*ghayb*) and a Manifestation (*mazhar*).\n\nBy virtue of His Unseen, He has the Name *Al-Batin* (The Inner). This is His remembrance of His servant *in Himself* and His knowledge of what the servant conceals (*sirr*). Along with this Name is the servant's secret that the Real knows, and the remembrance of the self by which the servant remembers his Lord.\n\nBy virtue of His Manifestation, He has the Name *Al-Zahir* (The Outer). This is His remembrance of His servant *in an assembly* (of His angels or the assembly of Divine Names) and His knowledge of what the servant manifests in the world of witnessing (*'alam al-shahadah*). Along with this Name is the servant's manifestation (*'alaniyyah*) that the Real knows, and the manifest remembrance by which the servant remembers his Lord.\n\nAs for the knowledge of what is *more hidden than the secret* (*akhfa min al-sirr*), that is what only God alone knows. The servant has no knowledge of it, nor is it possible for him to know it except through God. This is His knowledge of His own Essence (*nafsihi*). Everything besides this knowledge is either the knowledge of his secret or the knowledge of his manifestation.\n\nThus, the objects of Knowledge are three things: Manifestation (*jahr*), Secret (*sirr*), and What is more hidden than the Secret. The objects of Remembrance are two matters: Remembrance in an Assembly (which is of two types: the assembly of Names and the assembly of Angels) and Remembrance in the Self. Thus, Remembrance is equal to Knowledge in classification.\n\n### [That God Has Deposited the Knowledge of Everything in Humanity]\n\nAmong the contents of this station is the fact that God has deposited the knowledge of everything in the human being, and then placed a veil between him and the realization of what he possesses that God deposited in him. The human being is not unique in this; rather, the entire world is upon this state. This is one of the Divine Secrets that the intellect denies and deems impossible entirely.\n\nIts proximity to the ignorant essences (*dhawat*) in the state of their knowledge is the proximity of the Real to His servant, which is His saying: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ>> (And We are nearer to him than you, but you do not see) and His saying: <<وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ>> (And We are nearer to him than the jugular vein). Despite this proximity, He is not perceived or known except through imitation (*taqlid*). Were it not for His informing us, no intellect would have indicated it.\n\nLikewise, all the infinite information (*ma'lumat*)—by which knowledge exists—is entirely within the human being and within the world in this state of proximity, yet he does not know what is within him until it is unveiled to him gradually (*ma' al-anat*). Unveiling cannot occur all at once, because that would imply limitation (*hasr*), and we have said that it is infinite. Thus, he knows things one after another, infinitely.\n\nThis is one of the most astonishing Divine Secrets: that the infinite should enter into the existence of the servant, just as the infinite information entered into the Knowledge of the Real. His Knowledge is the very essence of His Essence (*'ayn Dhatihi*).\n\nThe difference between the relation of the Real's Knowledge to the infinite and the Real depositing the infinite in the servant's heart is that the Real knows what is in His own Essence and what is in the servant's essence specifically and in detail (*ta'yinan wa tafsilan*). The servant only knows this generally (*mujmalan*). There is no generality in the Real's knowledge of things, even though He knows generality, since generality is known to the servant from himself and from others.\n\nAll that the human being knows constantly, and every existent thing, is in reality recollection (*tadhakkur*) and the renewal of what he forgot. This station affirms that the servant was established by the Real at some time in the station of the relation of His Knowledge to the infinite, and this is not impossible in our view. What is impossible is the entry of the infinite into existence, not the relation of knowledge to it.\n\nThen, God caused creation to forget this, just as He caused them to forget their witnessing of Lordship during the taking of the Covenant (*mithaq*), even though it occurred, and we know this through Divine reports.\n\nThus, the constant knowledge of the human being is only recollection. Some of us, when they recollect, remember that they had known that information and forgotten it, like Dhu al-Nun al-Misri. Others do not remember this, even while believing that they had witnessed it, and for them, it is the beginning of knowledge (*ibtida' 'ilm*). Were it not already within him, he would not have accepted it from the one who informed him, but he has no awareness of it. Only the one whose insight God illuminates knows this, and this is specific to those whose state is fear (*khashyah*) with every breath. This is a noble station, for it belongs only to those who are constantly accompanied by Theophany (*al-tajalli*).\n\nThis station includes the famous issues of Dhu al-Nun, which is the creation of the rationally impossible (*al-muhal al-'aqli*) through Divine relations. It includes the science of preference (*mufadalah*) between things that are mutually exclusive in all respects. It includes the knowledge that every substance (*jawhar*) in the world gathers every reality (*haqiqah*) in the world, just as every Divine Name is named by all the Divine Names. That is His saying, <<قُلِ ادْعُوا اللهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَى>> (Say, \"Call upon Allah or call upon the Most Merciful. Whichever you call—to Him belong the Most Beautiful Names\").\n\nThis specific knowledge is one that I have been singled out with, apart from the community, in my knowledge. I do not know whether anyone else has stumbled upon it or been unveiled with it, among the believers who are People of Sainthood (*Ahl al-Wilayah*), excluding the Prophets. As for the Divine Names, Abu al-Qasim ibn Qasi affirmed it in his *Khala' al-Na'layn*. May God have mercy on a servant who informs me that someone else has stated this issue, either on his own authority, as I have done, or on the authority of another, so that I may append it to my book in this place as evidence for what I have claimed. For I love agreement and not to be singled out for anything apart from my companions. And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And God speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو ستانوے: انسانی مٹی (طینت) کی تسویہ کی تعریف کے مقام کی معرفت میں، جو حضرت محمدیہ (الحضرۃ المحمدیۃ) کے اعلیٰ ترین مقام پر ہے۔\n\nتنزه أيها الخلق المسوي *** على صفة المسوي بالسواء\nاے وہ مخلوق جسے برابر کیا گیا، تو پاکی بیان کر، مساوی کرنے والے کی صفت پر مساوات کے ساتھ۔\n\nولا تنظر إلى ما حال منه *** وجاء به الرسول من السماء\nاور اس چیز کی طرف مت دیکھ جو اس سے بدل گئی، اور جسے رسول آسمان سے لائے۔\n\nفإن خفت الرجاء أيدت فيه *** بما تعطيه مأمنة الرجاء\nپس اگر تو امید سے ڈرے، تو تجھے اس میں اس چیز سے تائید ملے گی جو امید کی جائے پناہ دیتی ہے۔\n\nسليمانية وقفت أمامي *** أقيم بها رخاء من رخاء\nایک سلیمانی (حالت) میرے سامنے کھڑی ہوئی، میں اس کے ذریعے ایک آسانی سے دوسری آسانی قائم کرتا ہوں۔\n\nوقفت على الصفا أعنو لسر *** إلهي بمنزلة الصفاء\nمیں صفا پر کھڑا ہوا، ایک الٰہی راز کے لیے جھکتا ہوں، جو صفائی کے مقام پر ہے۔\n\nوعانقت الغزالة في سناها *** لا علو فوق منزلة السهاء\nاور میں نے ہرنی کو اس کی چمک میں گلے لگایا، سہا (ستارے) کے مقام سے اوپر کوئی بلندی نہیں۔\n\nوجاوزت العقول بغير حد *** وخضت حيا النفوس على حياء\nاور میں نے عقلوں کو بغیر کسی حد کے پار کیا، اور میں نے حیا کے ساتھ نفوس کے حوض میں غوطہ لگایا۔\n\n### [عالم کی ہر چیز اللہ کی تسبیح کرتی ہے]\n\nاللہ تعالیٰ نے فرمایا: وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے۔)\n\nپس عالم میں کوئی صورت (تصویر) ایسی نہیں، اور عالم میں صور کے سوا کچھ نہیں، مگر وہ اپنے خالق کی تسبیح ایک مخصوص حمد کے ساتھ کر رہی ہے جو اسے الہام کی گئی ہے۔ اور عالم میں کوئی صورت ایسی نہیں جو فاسد ہو مگر اس کے فساد کی حقیقت (عین فساد) یہ ہے کہ انہی جواہر میں ایک دوسری صورت کا ظہور ہو جاتا ہے جو بعینہٖ اللہ تعالیٰ کی تسبیح کر رہی ہوتی ہے۔ یہاں تک کہ پوری کائنات اپنے خالق کی تسبیح سے خالی نہیں ہوتی۔ پس اس صورت کے اجزاء کی حقیقتیں (اعیان) اس کی تسبیح کرتی ہیں جو اس صورت کے لائق ہے۔ اور عالم میں جتنی بھی صورتیں ہیں وہ سب نسبتیں اور احوال ہیں، نہ موجود ہیں اور نہ معدوم، اگرچہ وہ کسی ایک رُخ سے مشہود ہیں، تو دوسرے رُخ سے مشہود نہیں ہیں۔ اور ان صورتوں کے فنا ہونے کا وقت بعینہٖ ان صورتوں کے وجود کا وقت ہے، یعنی ان کا فساد بعینہٖ دوسری صورت کا وجود ہے، نہ یہ کہ فساد کے بعد دوسری صورت پیدا ہوتی ہے۔\n\n### [انسان اور جن کے علاوہ پوری کائنات بشری احساس سے غائب چیزوں کے کشف (الکشف) سے پوری طرح بہرہ ور ہے]\n\nاور جب تم یہ جان چکے تو یہ بھی جان لو کہ انسان اور جن کے علاوہ پوری کائنات اس چیز کے کشف (الکشف) سے پوری طرح بہرہ ور ہے جو انسانی احساس سے غائب ہے۔ پس جن و انس میں سے کوئی بھی اس غیب کا مشاہدہ نہیں کرتا مگر اس وقت جب عادات کو توڑا جائے (خرق العوائد)، کسی ایسی کرامت کے لیے جس سے اللہ اسے نوازتا ہے، یا کسی خاص امر کی خاصیت کے سبب جو غیوب کا کشف (الکشف) عطا کرتی ہے۔\n\nجیسا کہ ہر جماد، نباتات، اور حیوان پوری کائنات میں، اور انسان و جن کے عالم میں، اور فرشتوں کے اجسام، اور افلاک، اور ہر وہ صورت جس کی تدبیر کوئی روح کر رہی ہے—خواہ وہ تدبیر ان میں محسوس ہو جن کی حیات ظاہر ہے یا ان میں غیر محسوس ہو جن کی حیات باطن ہے، جیسے انسان کے اعضاء، اس کی جلدیں اور اسی طرح کی چیزیں—یہ سب کے سب ان الٰہی غیوب کے کشف (الکشف) کے مقام پر ہیں جو ان اجسام کی تدبیر کرنے والی ارواح (فرشتہ، انسان، اور جن) سے پوشیدہ ہیں۔ صرف یہی (ارواح) ہیں جو اس الٰہی غیب کے ادراک سے محجوب ہیں، مگر یہ کہ ان میں سے بعض یا سب کے لیے خرق عادت واقع ہو۔\n\nتم جان چکے ہو کہ پتھر، حیوان اور نباتات نے اس باب سے محمد صلی اللہ علیہ وسلم کی نبوت کو پہچانا، اور یہ نبوت الٰہی غیوب میں سے ہے۔ پس ہر روح اس طرح کے غیب سے جاہل رہتی ہے، مگر یہ کہ اللہ اسے اس سے آگاہ کر دے، سوائے ان کے جن کا ہم نے ذکر کیا، کیونکہ وہ اسے اس فطرت کے ذریعے پہچانتے ہیں جس پر اللہ نے انہیں پیدا کیا۔ جب حق (الحق) ظاہر ہوتا ہے تو وہ ان کی ذاتوں میں اپنے نام کے ساتھ انہیں پکارتا ہے، اور جب وہ بعینہٖ حاضر ہوتے ہیں تو وہ انہیں خبر دیتے ہیں۔\n\nمجھے یوسف بن یخلف الکومی نے خبر دی، جو ان عظیم لوگوں میں سے تھے جن سے ہم ۵۸۶ھ میں اس راہ میں ملے تھے، اللہ ان پر رحم فرمائے۔ انہوں نے کہا: مجھے موسیٰ السردانی نے خبر دی، جو ابدالِ محمولین میں سے تھے، انہوں نے کہا: جب میں اور میرا ساتھی اس پہاڑ کی طرف چلے جسے قاف کہا جاتا ہے، اور وہ اس سمندر کے گرد محیط ہے جو زمین کے گرد محیط ہے، اور اللہ نے اس سمندر کے کنارے، سمندر اور پہاڑ کے درمیان ایک سانپ پیدا کیا ہے جو اپنے جسم کو محیط سمندر کے گرد گھماتا ہے یہاں تک کہ اس کا سر اس کی دم سے مل جاتا ہے۔ ہم اس کے پاس کھڑے ہوئے، تو میرے ساتھی نے مجھ سے کہا: اسے سلام کرو، یہ تمہیں جواب دے گا۔ موسیٰ نے کہا: میں نے اسے سلام کیا، تو اس نے کہا: \"وعلیکم السلام ورحمۃ اللہ وبرکاتہ۔\" پھر اس نے مجھ سے پوچھا: شیخ ابو مدین کا کیا حال ہے؟ (اس وقت ابو مدین بجایہ میں تھے)۔ میں نے اس سے کہا: میں نے انہیں عافیت میں چھوڑا، تمہیں ان کا علم کیسے ہوا؟ وہ حیران ہوئی اور کہا: کیا روئے زمین پر کوئی ایسا ہے جو ان سے محبت نہ کرتا ہو؟ اللہ کی قسم! جب سے اللہ نے انہیں اپنا ولی بنایا ہے، اس نے ہماری ذاتوں میں ان کا اعلان کر دیا ہے اور ان کی محبت کو زمین پر ہمارے دلوں میں نازل کر دیا ہے۔ پس کوئی پتھر، ڈھیلا، درخت یا حیوان ایسا نہیں جو انہیں نہ جانتا ہو اور نہ ہی ان سے محبت کرتا ہو۔ میں نے اس سے کہا: اللہ کی قسم! کچھ لوگ ایسے بھی ہیں جو ان کی جہالت اور ان سے بغض کی وجہ سے انہیں قتل کرنا چاہتے ہیں۔ اس نے کہا: میں نے نہیں جانا کہ کوئی شخص اس حال پر ہو جس سے اللہ محبت کرتا ہے۔\n\nیہ اسی باب سے ہے، اور اسی میں ہاتھوں، پیروں، جلدوں، منہ اور زبانوں کی گواہی شامل ہے، جو ہماری نظر میں گونگے ہیں مگر حقیقت میں بولنے والے ہیں۔ پس بنی آدم کے علاوہ ہر مخلوق خشوع اور تواضع کے مقام پر ہے، سوائے انسان کے، جو اللہ تبارک و تعالیٰ کے مقابلے میں کبر، عزت اور جبروت کا دعویٰ کرتا ہے۔ اور جنات اپنے زعم میں اپنے سے کم مخلوقات پر اس کا دعویٰ کرتے ہیں، جیسے ابلیس کا اپنی پیدائش کے لحاظ سے آدم علیہ السلام پر تکبر کرنا۔ اسی لیے اس نے کہا: أَسْجُدُ لِمَنْ خَلَقْتَ طِيناً (کیا میں اسے سجدہ کروں جسے تو نے مٹی سے پیدا کیا؟) کیونکہ اس نے آگ کے عنصر کو مٹی کے عنصر سے زیادہ شرف والا سمجھا۔ اور کہا: أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ وَخَلَقْتَهُ مِنْ طِينٍ (میں اس سے بہتر ہوں، تو نے مجھے آگ سے پیدا کیا اور اسے مٹی سے پیدا کیا)۔ پس اس نے اللہ عزوجل پر تکبر نہیں کیا۔\n\nپس تمام مخلوقات میں صرف انسان ہی اس صفت کے ساتھ خاص ہوا۔ جب وجود میں اس طرح کا دعویٰ پیدا ہوا اور دعویٰ کرنے والے کی ذات میں اور ان لوگوں میں جو اس پر اعتقاد رکھتے تھے (جیسے فرعون اور اس کی قوم کے وہ لوگ جنہیں اس نے ہلکا سمجھا) یہ دعویٰ متحقق ہوا، تو اللہ نے وجود میں \"افعل من کذا\" (فلاں سے زیادہ) کے معنی میں تفضیل کو مقرر کیا، گویا اس دعوے کی تصدیق اور اسے ثابت کرنے کے لیے۔ پس اللہ نے فرمایا: \"اللہ اکبر\" (اللہ سب سے بڑا ہے)، تو لفظ \"افعل\" لایا۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا: \"اللہ اعلیٰ اور اجل ہے\" (اللہ سب سے بلند اور سب سے بزرگ ہے)، تو \"افعل\" لایا۔ پس ہر وہ \"افعل من کذا\" جس سے اللہ کے جلال کی صفت بیان کی جاتی ہے، اس کا سبب اس صفت میں دعوے کی شرکت ہے، لیکن ان میں سے کچھ محمود ہیں اور کچھ مذموم۔ مذموم وہ ہے جس کا دعویٰ فرعون نے کیا، اور محمود وہ ہے جیسے اللہ تعالیٰ کا اپنے بارے میں یہ فرمان کہ وہ أَرْحَمُ الرَّاحِمِينَ (سب رحم کرنے والوں سے زیادہ رحم کرنے والا) اور أَحْسَنُ الْخَالِقِينَ (سب خالقوں سے بہترین خالق) ہے۔ پس اس نے \"افعل\" لایا اور اپنے بندوں میں سے رحم کرنے والوں کی تعریف کی کہ اس نے اپنی ذات کو اپنی مخلوق پر ان سے زیادہ رحم کرنے والا بنایا۔\n\nاور اس کا عمومی فیصلہ یہ ہے کہ رحمت ان (بندوں) کی طرف سے ایک حقیقت ہے جسے اللہ نے ان میں پیدا کیا، پس انہوں نے اس کے ذریعے آپس میں رحم کیا۔ اور اس نے انسان میں صورت کے ذریعے کبر پیدا کیا، پس اس نے اس کے ذریعے تکبر کیا۔ اگر تم کہو کہ جب \"افعل\" وارد ہوتا ہے تو اس سے \"افعل من\" (فلاں سے زیادہ) مراد نہیں ہوتا، تو ہم کہیں گے: اللہ فرماتا ہے أَحْسَنُ الْخَالِقِينَ (سب خالقوں سے بہترین)، اور یہاں بلا شک و شبہ \"افعل من\" مراد ہے۔ اور اسی طرح انسان کے حق میں، جب اللہ تعالیٰ نے فرمایا: أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ (اس نے ہر چیز کو اس کی خلقت عطا کی)۔ پس ہر موجود اس تقویم (ساخت) پر ہے جو اس کی خلقت اسے عطا کرتی ہے۔ اور انسان کے بارے میں فرمایا کہ اس نے اسے أَحْسَنِ تَقْوِيمٍ (بہترین ساخت) میں پیدا کیا، یعنی جس ساخت پر اسے پیدا کیا وہ ہر دوسری ساخت سے افضل ہے۔ اور یہ صفت جس کے ذریعے اسے دوسروں پر فضیلت دی گئی، صرف اس وجہ سے صحیح ہوئی کہ اللہ نے اسے اپنی صورت پر پیدا کیا۔\n\nاگر تم کہو کہ یہ تغیر جو انسان پر طاری ہوتا ہے، اور حق (الحق) کی صورت تغیر کو قبول نہیں کرتی، تو ہم کہیں گے: اللہ اس مقام پر فرماتا ہے: سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ (اے دونوں بوجھ والو! عنقریب ہم تمہاری طرف متوجہ ہوں گے)۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا: \"تمہارا رب فارغ ہو گیا ہے۔\" اور فرمایا: \"وہ ادنیٰ صورت میں تجلی (التجلی) فرماتا ہے، پھر جب وہ (بندے) انکار کرتے ہیں تو وہ اس صورت میں بدل جاتا ہے جسے وہ اس علامت کے ذریعے پہچانتے ہیں جو وہ جانتے ہیں۔\" پس اس نے اس مقام کو اپنی ذات کی طرف منسوب کیا، حالانکہ وہ اپنی ذات کے اعتبار سے تغیر اور تبدیلی کے مقام سے بلند ہے۔ لیکن الٰہی مظاہر میں تجلیات (التجلیات) ان عقائد کے مطابق ہوتی ہیں جو مخلوقات میں آنات (لمحات) کے ساتھ پیدا ہوتے ہیں، اور اسے اس مقام سے موسوم کیا جاتا ہے۔ اور جب معاملہ ایسا ہی ہے جیسا کہ ہم نے ذکر کیا، اور حقیقت میں ایسا ہی ہے، تو جو کچھ ہم نے ذکر کیا وہ صحیح ہے اور وہمی اعتراض ختم ہو جاتا ہے۔ اللہ بہت بلند و بالا ہے۔\n\n### [صحیفوں میں لکھے ہوئے حروف سے اللہ کا کلام سمجھا جاتا ہے]\n\nاور ان علوم میں سے جو یہ منزل اپنے اندر رکھتی ہے، وہ اسماء کے اسماء (ناموں کے نام) کا علم ہے، اور یہ کہ ان کے لیے وہی حرمت ہے جو ان کے مسمیٰ کے لیے ہے۔ پس صحیفوں میں لکھے ہوئے حروف کلام کی حقیقتیں (اعیان کلام) ہیں جن سے اللہ کا کلام سمجھا جاتا ہے، جس کے ساتھ وہ موصوف ہے۔ اور یہ وصف کس چیز کی طرف لوٹتا ہے، یہ ایک دوسرا علم ہے جس میں لوگوں نے اختلاف کیا ہے، اور ہمیں اس میں غوطہ لگانے کی ضرورت نہیں۔\n\nپس حق سبحانہ و تعالیٰ، متکلم ہونے کے ناطے، اپنے آپ کو اپنے اسماء کے ذریعے یاد کرتا ہے، اس کلام کی نسبت کے مطابق جس کی نسبت واجب نہیں ہے۔ اور ان اسماء کے ہمارے ہاں ہر متکلم کی زبان میں اسماء ہیں۔ پس عربی زبان میں اس نام کو جس سے اس نے خود کو متکلم ہونے کے ناطے موسوم کیا ہے، \"اللہ\" کہا جاتا ہے، اور فارسی میں \"خدائے\"، اور حبشی میں \"واق\"، اور فرنگی زبان میں \"کربطور\" (Creator) اور اسی طرح ہر زبان میں۔ پس یہ ان اسماء کے اسماء ہیں، اور نسبتوں کے تعدد کی وجہ سے یہ متعدد ہو گئے ہیں۔ پس ہر گروہ میں ان کی تعظیم اس لحاظ سے کی جاتی ہے جس پر وہ دلالت کرتے ہیں۔\n\nاسی لیے ہمیں مصحف لے کر دشمن کی سرزمین کی طرف سفر کرنے سے منع کیا گیا ہے، حالانکہ وہ ہمارے ہاتھوں کی لکھی ہوئی تحریر ہے، جو محدثات (نئی چیزوں) کے ہاتھوں سے عفص اور زاج سے بنے ہوئے سیاہی سے لکھی گئی ہے۔ اگر یہ دلالت نہ ہوتی تو نہ اس کی تعظیم ہوتی اور نہ ہی اس کی حقارت۔ اور اسی لیے عرفِ عادت اور عرفِ شرع میں \"برا کلام\" اور \"اچھا کلام\" کہا جاتا ہے، اور اس کی مثالیں ہیں۔ اور اس کا سبب اصطلاح اور وضع میں ان الفاظ کا مدلول ہے۔\n\nیہ ایک شریف علم ہے جسے اہل کشف (الکشف) کے سوا کوئی نہیں جانتا، جیسا کہ حقیقت میں ہے۔ پس ہمارے ہاتھوں میں اسماء کے اسماء کے سوا کچھ نہیں۔ پس جب اسماء کے اسماء کی تنزیہ واقع ہو، تو کامل بندے کی تنزیہ صورت کی وجہ سے حرمت کی زیادہ حقدار ہے، خاص طور پر چہرہ (وجہ)، کیونکہ چہرہ انسان کے ظاہر میں سب سے زیادہ شرف والا ہے، اس لیے کہ وہ تمام باطنی اور ظاہری قوتوں کی حضرت (حضور) ہے۔ اور ہر چیز کا چہرہ اس کی ذات ہوتی ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم ایک شخص کے پاس سے گزرے جو اپنے غلام کے چہرے پر مار رہا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: \"چہرے سے بچو، کیونکہ اللہ نے آدم کو اپنی صورت پر پیدا کیا۔\"\n\nاور یہ (چہرہ) اللہ کی طرف متوجہ ہونے کا مقام ہے، نہ کہ دیگر جہات۔ پس یہ سب سے بڑی جہت ہے۔\n\n### [خلق (پیدائش) اور تقدیر (اندازہ) کے درمیان فرق]\n\nاور اس منزل کے علوم میں سے خلق (پیدائش) اور تقدیر (اندازہ لگانا/مقرر کرنا) کے درمیان فرق کا علم ہے۔ تقدیر کا تعلق صرف اسم المدبر (تدبیر کرنے والا) اور المفصل (تفصیل دینے والا) سے ہے، نہ کہ کسی اور اسم سے۔ اور اللہ نے فرمایا: يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ (وہ امر کی تدبیر کرتا ہے، وہ آیات کو تفصیل سے بیان کرتا ہے)۔ اور یہ دونوں اسماء اسم العالم (جاننے والا) کے احاطے میں ہیں۔ اور اسم القادر (قدرت والا) کا اس حضرت (حضور) میں کوئی داخلہ نہیں۔ کیونکہ یہ تینوں اسماء حق (الحق) کی ذات کی طرف لوٹتے ہیں، اور حق اپنی ذات کے لیے مقدور نہیں ہو سکتا۔ پس یہاں اسم القادر کا کوئی حکم نہیں۔ پس اس مرتبے میں اسم المقدر (اندازہ لگانے والا) ہی معتبر ہے۔\n\nاور خلق (پیدائش) عقلی طور پر اسم القادر کا تقاضا کرتا ہے، اور کشف (الکشف) اور شرع کے لحاظ سے اسم القائل (کہنے والا) کا تقاضا کرتا ہے۔ ہم نے کشف (الکشف) اس لیے کہا تاکہ ولی اور نبی کے درمیان فرق کیا جا سکے، کیونکہ یہ دونوں حضرات اس بات کو کہتے ہیں، برخلاف اس کے جو عقلی فکری نظر اپنے دلیل کے ساتھ دیتی ہے۔ جس طرح اسم القادر لفظاً اور معنیً المقدر سے ممتاز ہے، اسی طرح خلق تقدیر سے لفظاً اور معنیً ممتاز ہے۔\n\nتقدیر کے ذریعے موجودات کی صورتوں میں بیان واقع ہوتا ہے، ان کی ذاتوں کے اختلاف کے باوجود، خواہ وہ حسی ہوں یا معنوی، خواہ وہ رقمی (اعداد) یا لفظی یا فکری حروف کے عالم سے ہوں، اور خواہ وہ قائم بالذات اعیان کے عالم سے ہوں، یا ان اعیان کے عالم سے جو قائم بالذات نہیں ہیں۔ اور اس میں نسبتوں کا عالم بھی داخل ہے۔ اور ان اعیان میں ان کے اشخاص کی ذاتوں کی تسویہ (برابری) کی وجہ سے، عالم غیب اور شہود میں، وہ خلق (پیدائش) ہوتا ہے۔ اور اس میں نسبتوں کا عالم داخل نہیں ہوتا، کیونکہ وہ وجودی اعیان نہیں ہیں، اور نہ ہی وہ عدم مطلق کے ساتھ متصف ہیں، کیونکہ وہ معقول ہیں۔ اور ان سب میں جو تمییز (امتیاز) ہے جو ان کی اعیان کو شامل ہے، خواہ عقلی ہو یا حسی، وہ تقدیر کے لیے ہے نہ کہ خلق کے لیے۔\n\nپس جب ہر عالم سے جو کچھ ہم نے ذکر کیا، حس یا عقل کے لیے، اسم الخالق یا المدبر المفصل والمقدر سے ظاہر ہوتا ہے، تو ان میں سے بعض کا نفع بعض سے متعلق ہو جاتا ہے۔ پس اعیان ایک دوسرے کو نفع پہنچاتی ہیں، اور حق (الحق) انہیں ان اعیان کے پردے کے پیچھے سے اپنی طرف بلاتا ہے، جب وہ ایک دوسرے کی طرف منافع کے لیے متوجہ ہوتے ہیں۔ پس ہر صورت ہر صورت سے اس کی طرف بلاتی ہے۔\n\nہم میں سے کچھ ایسے ہیں جو شعور رکھتے ہیں اور جانتے ہیں کہ کس نے انہیں بلایا، اور ہم میں سے کچھ ایسے ہیں جن پر یہ معاملہ مشتبہ ہو جاتا ہے اور وہ نہیں جانتے کہ معاملہ کیا ہے، اور وہ اپنے اندر فرقان کی قوت پاتے ہیں لیکن فرقان کا چہرہ ان پر ظاہر نہیں ہوتا۔ اور ہم میں سے کچھ ایسے ہیں جن پر یہ مشتبہ نہیں ہوتا، اور وہ اندھے، نابینا، اور پیدائشی اندھے ہوتے ہیں، اور وہ کہتے ہیں کہ یہاں وہی کچھ ہے جو ہم دیکھتے ہیں، اور وہ ان صورتوں کی اعیان ہیں۔ پس ہم تین قسم کے ہیں: ایک قسم سلیم النظر اور تیز نگاہ ہے، دوسری قسم وہ ہے جس کی آنکھوں پر پردہ پڑا ہوا ہے، پس وہ صورتوں کو متحقق نہیں کر پاتا، باوجود اس کے کہ وہ جانتا ہے کہ کوئی امر ہے، لیکن وہ اس کی صورت کو متحقق نہیں کرتا۔ اور ہم میں سے وہ ہے جو پیدائشی اندھا ہے، جس نے کبھی کچھ نہیں دیکھا، پس وہ مطمئن الخاطر ہے۔ اور کوئی چوتھی قسم نہیں۔\n\nاور ان صورتوں کے منافع سائلین اور قبول کرنے والوں کے اختلاف کے ساتھ مختلف ہوتے ہیں۔ اور ہر سائل اپنی حاجت اور غرض کے مطابق سوال کرتا ہے، اور یہ ضروری بھی ہو سکتا ہے اور غیر ضروری بھی۔ اور حقیقت میں ضروری کے سوا کچھ نہیں، اور اسی لیے عطا کرنا متعین ہے۔ کیونکہ سائل صرف اس غرض کے لیے سوال کرتا ہے جس نے اسے سوال کرنے پر مجبور کیا ہے۔ پس غرض ہی سائل ہے، اور زبان حال یا قال کے ذریعے اس غرض کی ترجمانی کرتی ہے۔ اور اس غرض کی کوئی زندگی نہیں مگر اس چیز کے حصول سے جس کے بارے میں اس نے سوال کیا ہے۔ پس اگر اسے وہ نہ ملے تو وہ ہلاک ہو جائے گا۔ پس جو اسے اس چیز سے روکے جس کے بارے میں اس نے سوال کیا، وہ عالم سے اس کی صورت کے زوال کا سبب بنا۔ پس اس نے روک کر عالم سے ایک ایسی صورت کو کم کر دیا جو اللہ کی تسبیح کر رہی تھی۔ اور محقق یہ چاہتا ہے کہ وہ زیادہ ہو اور کم نہ ہو۔\n\nاور اغراض مذموم بھی ہو سکتی ہیں، اور اگر انہیں وہ چیز مل جائے جس کا وہ مطالبہ کرتی ہیں، تو انسان اس غرض کو روکنے سے جو نقصان ہوتا ہے، اس سے بھی زیادہ سخت ممنوع کام میں پڑ جاتا ہے۔ اس مسئلے سے کیسے بچا جائے؟\n\nپس جان لو کہ اغراض کی مطلقاً تکمیل کے ساتھ اس شخص کو مخاطب نہیں کیا جاتا جو مقید اور معقول ہو اور عقلِ تکلیف کی گرفت میں ہو۔ بلکہ یہ مقام اصحابِ احوال کے لیے ہے جن کی عقلیں مغلوب ہوتی ہیں۔ اگر تم کہو کہ حفظ (بچاؤ) بہتر ہے، جیسا کہ امام نے شبلی کے بارے میں کہا تھا، جب ان سے کہا گیا کہ وہ نماز کے اوقات میں لوٹ آتے ہیں، اور جب فارغ ہوتے ہیں تو ان پر ولہ (مستی) کی حالت غالب آ جاتی ہے اور وہ ان کی عقل کے درمیان حائل ہو جاتی ہے جو انہیں صحو (ہوش) عطا کرتی ہے۔ تو اس جماعت کے سردار امام ابو القاسم جنید بن محمد نے فرمایا: \"الحمد للہ الذی لم یجر علیہ لسان ذنب\" (تمام تعریفیں اللہ کے لیے جس نے اس کی زبان پر گناہ کا لفظ جاری نہیں کیا)۔ اور گناہ اس کی طرف منسوب نہیں کیا گیا، لیکن جو اسے نہیں جانتا اس کے نزدیک صورت کے لحاظ سے گناہ کا لفظ اس سے متعلق ہوتا ہے، حالانکہ وہ حقیقت میں گنہگار نہیں ہے۔\n\nہمارے بعض اصحاب نے کہا: اگر گناہ کے لفظ کے جاری ہونے سے پاکی زیادہ اولیٰ اور عظیم نہ ہوتی، تو اس امام نے اس پر اللہ کی حمد نہ کی ہوتی۔ ہم کہتے ہیں: معاملہ ایسا نہیں جیسا تم نے گمان کیا، بلکہ اس امام کو اس شخص کا خوف تھا جو اس مرتبے کو نہیں پہنچا کہ وہ اس کا اظہار کرے، حالانکہ وہ اس سے متحقق نہیں ہے، پس وہ غلطی کرے گا اور گناہ میں پڑ جائے گا۔ اور انہیں عالم پر شفقت ہے۔ لیکن یہ کہ یہ افضلیت کے طریقے سے ہو، تو یہ کیسے ہو سکتا ہے؟ حالانکہ سبحانہ و تعالیٰ نے اپنے بندوں کی زبانوں کو اپنے اور اپنے رسولوں کے بارے میں مذمت اور سب و شتم کے لیے آزاد چھوڑ دیا ہے۔ پس اس ولہ والے شخص کے لیے، جس کا ہم نے ذکر کیا، اس میں اسوہ اور عزت ہے، پس ہمارے نزدیک اس میں کوئی فضیلت نہیں۔\n\n### [اس رحمت کا علم جسے اللہ نے موجود نسیان (بھول) میں پوشیدہ رکھا]\n\nاور ان علوم میں سے جو یہ منزل اپنے اندر رکھتی ہے، وہ اس رحمت کا علم ہے جسے اللہ نے عالم میں موجود نسیان (بھول) میں پوشیدہ رکھا ہے۔ اور اگر یہ نہ ہوتا تو معاملہ عظیم ہو جاتا اور مشکل ہو جاتا۔ اور جو کچھ تذکر (یاد) میں واقع ہوتا ہے وہ کافی ہے۔ اور اس کی اصل یہ ہے کہ اللہ اور عالم کے درمیان تکلیف کے مقام پر حجاب (پردہ) رکھا گیا، کیونکہ معاصی اور مخالفتیں اللہ کے علم میں مقدر ہیں، پس بندے سے ان کا وقوع ضروری ہے۔ اگر یہ تجلی (التجلی) اور کشف (الکشف) کے ساتھ واقع ہوتیں، تو یہ اللہ سے حیا کی کمی میں مبالغہ ہوتا، کیونکہ وہ اسے دیکھ رہا ہے اور مشاہدہ کر رہا ہے، اور تقدیر وقوع کا حکم دے رہی ہے۔ پس اللہ نے مخلوق پر رحمت کرتے ہوئے حجاب کر دیا، مصیبت کی عظمت کی وجہ سے۔\n\nکیا تم نہیں دیکھتے کہ عقلی تدبیر سے چلنے والے امور میں، جو عقلی درستی پر جاری ہوتے ہیں، جب اللہ کسی معاملے میں اپنے قضا و قدر کو نافذ کرنا چاہتا ہے، تو وہ اس معاملے میں اپنی حکمت اور علم کو چھپا دیتا ہے، جسے اس نے اس کے لیے جاری کیا ہے، جو عقل کی نظر کا تقاضا نہیں کرتا۔ پس جب وہ اسے نافذ کر دیتا ہے، تو ان کی عقلیں انہیں واپس کر دیتا ہے تاکہ وہ جان لیں کہ اللہ نے اس وقت عقل کے زائل ہونے سے ان پر رحم کیا تاکہ مطالبہ ختم ہو جائے۔\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: \"جب اللہ اپنے قضا و قدر کو نافذ کرنا چاہتا ہے، تو وہ عقل والوں سے ان کی عقلیں سلب کر لیتا ہے، یہاں تک کہ جب وہ ان میں اپنا قضا و قدر نافذ کر دیتا ہے، تو وہ انہیں واپس کر دیتا ہے تاکہ وہ عبرت حاصل کریں۔\"\n\nاور نبی صلی اللہ علیہ وسلم نے فرمایا: \"میری امت سے خطا اور نسیان (بھول) اٹھا لیا گیا ہے۔\"\n\nپس اللہ انہیں دنیا اور آخرت میں اس پر مؤاخذہ نہیں کرے گا۔ آخرت کے بارے میں تو سب کا اتفاق ہے، اور دنیا کے بارے میں وہ گناہ کے اٹھائے جانے پر متفق ہیں، اور حکم میں اختلاف کیا ہے۔ اور اسی طرح خطا میں بھی، اس قدر جس قدر شارع نے مسائل کے اشخاص میں شریعت مقرر کی ہے۔ پس جو رمضان میں بھول کر روزہ توڑ دے، تو ایک گروہ نے اس پر قضا واجب کی ہے، گناہ کے اٹھائے جانے کے ساتھ، اور ایک گروہ نے اس پر قضا واجب نہیں کی، گناہ کے اٹھائے جانے کے ساتھ بھی، کیونکہ اللہ نے اسے کھلایا اور پلایا۔ یہ شارع کا اس بارے میں قول ہے۔ پس یہ اس رحمت میں سے ہے جو اس (نسیان) میں پوشیدہ ہے۔\n\nاور اسی طرح وہ قرآن جو بھلا دیا گیا اور یاد نہیں رہا، پس وہ ہم تک منتقل نہیں ہوا، تو یہ ہم پر تکلیف میں اضافہ ہوتا۔ پس اللہ نے اپنے بندوں پر اس کے ذریعے رحم کیا۔ اور نبی صلی اللہ علیہ وسلم کہا کرتے تھے: \"مجھے چھوڑ دو جب تک میں تمہیں چھوڑے رکھوں۔\"\n\nاور فرمایا: \"اگر میں حج کے بارے میں ہر سال سوال کرنے والے کو 'ہاں' کہہ دیتا تو وہ واجب ہو جاتا۔\"\n\nاور احکام نو نازل شدہ مسائل کے بارے میں سوال کے پیدا ہونے سے پیدا ہوتے تھے۔ پس نبی صلی اللہ علیہ وسلم کا مقصد، جب آپ نے یہ جان لیا، یہ تھا کہ لوگ سوال کرنے سے باز رہیں اور اپنی فطرت کے ساتھ چلیں، یہاں تک کہ حق (الحق) خود ہی احکام کے نازل کرنے کا ذمہ لے جو وہ چاہے۔ پس واجبات اور محظورات کم ہو جاتے اور کثرت مباحات کے قبیل میں رہتی جن پر نہ کوئی اجر ہوتا اور نہ کوئی گناہ۔\n\nلیکن نفوس نے اسے قبول کرنے سے انکار کر دیا اور منصوص احکام پر ٹھہرنے سے انکار کر دیا، پس انہوں نے ان کے لیے علتیں ثابت کیں اور انہیں شارع کا مقصود قرار دیا اور انہیں جاری کیا اور مسکوت عنہ کو منطوق بہ کے حکم کے ساتھ ملحق کر دیا، ایک ایسی جامع علت کے ساتھ جس کا تقاضا مجتہد نے کیا تھا۔ اور اگر وہ ایسا نہ کرتے تو مسکوت عنہ اپنی اصل پر، یعنی اباحت اور عافیت پر باقی رہتا۔ پس تعلیل، علت کے جاری کرنے، قیاس، رائے اور استحسان سے احکام کی کثرت ہو گئی۔ وَمَا كَانَ رَبُّكَ نَسِيًّا (اور تمہارا رب بھولنے والا نہیں ہے)۔\n\nلیکن اللہ کی حمد ہے کہ اللہ نے اس میں ہمارے لیے ایک اور رحمت رکھی، اگر فقہاء نے اس رحمت کو عام لوگوں پر لازم کر کے محدود نہ کر دیا ہوتا کہ وہ کسی معین شخص کے مذہب کو لازم پکڑیں جسے نہ اللہ نے معین کیا، نہ اس کے رسول نے، اور نہ ہی کسی ظاہر کتاب یا صحیح یا ضعیف سنت نے اس پر دلالت کی۔ اور انہوں نے اسے منع کر دیا کہ وہ کسی دوسرے عالم کے مذہب میں اپنی نازلہ (پیش آنے والے مسئلے) کے لیے رخصت تلاش کرے جس کا تقاضا اس کے اجتہاد نے کیا ہو۔ اور انہوں نے اس میں سختی کی اور کہا کہ یہ دین کے ساتھ کھلواڑ کی طرف لے جائے گا۔ اور انہوں نے گمان کیا کہ یہ دین ہے۔\n\nاور نبی صلی اللہ علیہ وسلم نے فرمایا: \"اللہ نے تم پر صدقہ کیا ہے، پس اس کے صدقے کو قبول کرو۔\"\n\nپس رخصتیں ان چیزوں میں سے ہیں جن کا اللہ نے اپنے بندوں پر صدقہ کیا ہے۔ اور ہم مجتہد کے حکم کو مقرر کرنے پر اور عامی کے لیے اس حکم میں اس کی تقلید کرنے پر متفق ہیں، کیونکہ وہ اس کے نزدیک شرعی دلیل سے ہے۔ خواہ وہ صاحب قیاس ہو یا اس کا قائل نہ ہو۔ پس وہ رخصت جو شافعی نے اپنے مذہب میں اپنی دلیل کے تقاضے کے مطابق دیکھی، اسے شارع نے مقرر کیا ہے۔ لیکن مالکی مذہب کا مفتی مالکی شخص کو شافعی کی اس رخصت کو لینے سے منع کرتا ہے جسے شارع نے اس پر لازم کیا ہے۔ اور ہم نے اسے شارع کی طرف اس لیے منسوب کیا کہ شرع نے اسے مقرر کیا ہے، اس چیز سے منع کر کے جس کا تقاضا دلیل کرتی ہے، ایک ایسی چیز کے ذریعے جس کا تقاضا دلیل نہیں کرتی، اور جس کی کوئی اصل نہیں، اور وہ یہ ہے کہ آدمی خود کو ایک خاص مذہب سے باندھ لے اور اس سے دوسرے کی طرف نہ ہٹے، اور اس پر وہ چیزیں محدود کر دے جو شرع نے محدود نہیں کیں۔ اور یہ سب سے بڑی مصیبتوں اور اللہ کے بندوں پر سب سے زیادہ مشکل تکالیف میں سے ہے۔ پس جس چیز کو شرع نے اس امت کے مجتہدین کے حکم کو مقرر کر کے وسیع کیا، اسے عام فقہاء نے تنگ کر دیا۔ اور جہاں تک ائمہ جیسے ابو حنیفہ، مالک، احمد بن حنبل اور شافعی کا تعلق ہے، تو وہ اس سے پاک ہیں، ان میں سے کسی نے بھی یہ کام نہیں کیا، اور نہ ہی ان سے یہ نقل کیا گیا کہ انہوں نے کسی سے کہا ہو کہ صرف ہم پر اکتفا کرو یا جو میں نے تمہیں فتویٰ دیا ہے اس میں میری تقلید کرو، بلکہ ان سے اس کے خلاف منقول ہے، اللہ ان سب سے راضی ہو۔\n\n### [اللہ کے علم کا تعلق اس چیز سے جو بندہ اپنے نفس میں چھپاتا ہے اور اس چیز سے جو وہ ظاہر کرتا ہے، کے درمیان فرق]\n\nاور ان علوم میں سے جو یہ منزل اپنے اندر رکھتی ہے، وہ اس فرق کا علم ہے کہ اللہ سبحانہ و تعالیٰ کے علم کا تعلق اس چیز سے جو بندہ اپنے نفس میں چھپاتا ہے اور اس چیز سے جو وہ ظاہر کرتا ہے، کیا یہ ایک ہی نسبت کی طرف لوٹتا ہے یا دو نسبتوں کی طرف؟ اور اس باب سے وہ چیز متعلق ہے جو حق (الحق) اپنے اس فرمان سے چاہتا ہے: مَنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَمَنْ ذَكَرَنِي فِي مَلَأٍ ذَكَرْتُهُ فِي مَلَأٍ خَيْرٍ مِنْهُمْ (جس نے مجھے اپنے نفس میں یاد کیا، میں نے اسے اپنے نفس میں یاد کیا، اور جس نے مجھے کسی جماعت میں یاد کیا، میں نے اسے ان سے بہتر جماعت میں یاد کیا)۔\n\nپس ذکر اور علم میں یہ دو حالتیں ہیں۔ جان لو کہ حق سبحانہ و تعالیٰ کے لیے ایک غیب ہے اور ایک مظہر ہے۔ پس جو اس کا غیب ہے، اس کے لیے اسم الباطن (پوشیدہ) ہے، اور یہی اس کا اپنے بندے کو اپنے نفس میں یاد کرنا اور اس چیز کا علم رکھنا ہے جو وہ چھپاتا ہے۔ اور اس اسم کے ساتھ بندے کا وہ راز (سر) ہوتا ہے جسے حق جانتا ہے، اور نفس کا وہ ذکر ہوتا ہے جس سے بندہ اپنے رب کو یاد کرتا ہے۔ اور جو اس کا مظہر ہے، اس کے لیے اسم الظاہر (ظاہر) ہے، اور یہی اس کا اپنے بندے کو فرشتوں کی جماعت میں یا الٰہی اسماء کی جماعت میں یاد کرنا ہے، اور اس چیز کا علم رکھنا ہے جسے بندہ عالم شہود میں ظاہر کرتا ہے۔ اور اس اسم کے ساتھ بندے کی وہ علانیہ (ظاہر بات) ہوتی ہے جسے حق جانتا ہے، اور علانیہ کا وہ ذکر ہوتا ہے جس سے بندہ اپنے رب کو یاد کرتا ہے۔\n\nاور جہاں تک اس علم کا تعلق ہے جو راز (سر) سے بھی زیادہ پوشیدہ ہے، تو وہ صرف اللہ ہی جانتا ہے، اس بندے کو اس کا کوئی علم نہیں، اور نہ ہی وہ اسے جان سکتا ہے، اور وہ اس کا اپنی ذات کا علم ہے۔ اس علم کے علاوہ باقی سب یا تو اس کے راز کا علم ہے یا اس کی علانیہ کا علم۔ پس علم کا تعلق تین چیزوں سے ہے: جہر (ظاہر)، سر (راز)، اور ما ہو اخفیٰ من السر (جو راز سے بھی زیادہ پوشیدہ ہے)۔ اور ذکر کا تعلق دو امور سے ہے: ملأ (جماعت) کا ذکر، اور یہ دو قسم کا ہے: اسماء کی جماعت اور فرشتوں کی جماعت۔ اور دوسرا امر نفس کا ذکر ہے۔ پس تقسیم میں ذکر علم کے برابر ہو گیا۔\n\n### [اللہ نے انسان میں ہر چیز کا علم ودیعت کر دیا ہے]\n\nاور ان علوم میں سے جو یہ منزل اپنے اندر رکھتی ہے، وہ یہ ہے کہ اللہ نے انسان میں ہر چیز کا علم ودیعت (جمع) کر دیا ہے، پھر اس کے اور اس چیز کے ادراک کے درمیان رکاوٹ ڈال دی جو اللہ نے اس میں ودیعت کی ہے۔ اور انسان ہی اس کے ساتھ خاص نہیں، بلکہ پوری کائنات اسی پر ہے۔ اور یہ الٰہی اسرار میں سے ہے جسے عقل انکار کرتی ہے اور یکسر محال قرار دیتی ہے۔\n\nاور اس کا جاہل ذاتوں کے حالِ علم میں قریب ہونا، حق (الحق) کا اپنے بندے سے قریب ہونا ہے، اور یہ اس کا فرمان ہے: وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لَا تُبْصِرُونَ (اور ہم تم سے زیادہ اس کے قریب ہیں لیکن تم دیکھتے نہیں ہو)۔ اور اس کا فرمان: وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ (اور ہم اس کی شہ رگ سے بھی زیادہ اس کے قریب ہیں)۔ اور اس قرب کے باوجود وہ ادراک نہیں کرتا اور نہ ہی جانتا ہے، مگر تقلیداً۔ اور اگر وہ خبر نہ دیتا تو عقل اس پر دلالت نہ کرتی۔ اور اسی طرح تمام معلومات جو لامتناہی ہیں، وہ سب انسان میں اور عالم میں اسی قرب کے ساتھ ہیں، اور وہ نہیں جانتا کہ اس میں کیا ہے، یہاں تک کہ آنات (لمحات) کے ساتھ اس پر کشف (الکشف) کیا جائے۔ اور اس میں یکبارگی کشف (الکشف) صحیح نہیں، کیونکہ یہ حصر کا تقاضا کرتا ہے، اور ہم کہہ چکے ہیں کہ یہ لامتناہی ہے۔ پس وہ چیزوں کو ایک چیز کے بعد دوسری چیز کے ذریعے جانتا ہے، لامتناہی تک۔\n\nاور یہ سب سے عجیب الٰہی اسرار میں سے ہے کہ لامتناہی چیزیں بندے کے وجود میں داخل ہو جائیں، جیسا کہ لامتناہی معلومات حق (الحق) کے علم میں داخل ہو گئیں۔ اور اس کا علم عین اس کی ذات ہے۔ اور حق (الحق) کے علم کا لامتناہی سے تعلق ہونے اور حق (الحق) کا بندے کے دل میں لامتناہی چیزیں ودیعت کرنے کے درمیان فرق یہ ہے کہ حق (الحق) اپنی ذات میں اور اپنے بندے کے نفس میں موجود چیزوں کو تعین اور تفصیل کے ساتھ جانتا ہے، اور بندہ اسے صرف اجمالی طور پر جانتا ہے۔ اور حق (الحق) کے علم میں اجمال نہیں ہے، باوجود اس کے کہ وہ اجمال کو جانتا ہے، اس لحاظ سے کہ اجمال بندے کے لیے اپنی ذات سے اور دوسروں سے معلوم ہے۔\n\nپس جو کچھ انسان ہمیشہ جانتا ہے، اور ہر موجود، وہ حقیقت میں تذکر (یاد کرنا) اور اس چیز کی تجدید ہے جسے وہ بھول چکا ہے۔ اور یہ منزل اس بات پر حکم لگاتی ہے کہ حق (الحق) نے بندے کو کسی وقت لامتناہی سے اپنے علم کے تعلق کے مقام پر کھڑا کیا، اور یہ ہمارے نزدیک محال نہیں ہے۔ محال صرف لامتناہی کا وجود میں داخل ہونا ہے، نہ کہ علم کا اس سے متعلق ہونا۔ پھر اللہ نے مخلوق کو وہ بھلا دیا، جیسا کہ اس نے انہیں میثاق لینے کے وقت ربوبیت کی گواہی بھلا دی، باوجود اس کے کہ وہ واقع ہو چکا تھا اور ہم نے اسے الٰہی خبروں سے جانا۔ پس انسان کا علم ہمیشہ تذکر (یاد دہانی) ہی ہے۔\n\nپس ہم میں سے کچھ ایسے ہیں جو جب یاد کرتے ہیں تو انہیں یاد آتا ہے کہ وہ اس معلوم چیز کو پہلے جان چکے تھے اور بھول گئے تھے، جیسے ذوالنون مصری۔ اور ہم میں سے کچھ ایسے ہیں جو اس پر ایمان رکھنے کے باوجود اسے یاد نہیں کرتے کہ وہ اس کی گواہی دے چکے تھے، اور ان کے حق میں یہ علم کا آغاز ہوتا ہے، اور اگر وہ ان کے پاس نہ ہوتا تو وہ اسے قبول نہ کرتے جس کا علم انہیں دیا گیا، لیکن انہیں اس کا شعور نہیں ہوتا۔ اور اسے صرف وہی جانتا ہے جس کی بصیرت کو اللہ نے منور کیا ہو، اور یہ خاص طور پر اس شخص کے لیے ہے جس کی حالت ہر سانس کے ساتھ خشیت (خوف) کی ہو، اور یہ ایک عزیز مقام ہے، کیونکہ یہ صرف اسی کو حاصل ہوتا ہے جو ہمیشہ تجلی (التجلی) کو اپنے ساتھ رکھتا ہے۔\n\nاور یہ منزل ذوالنون کے مشہور مسائل کو اپنے اندر رکھتی ہے، اور وہ الٰہی نسبتوں کے ذریعے عقلی محال کو وجود میں لانا ہے۔ اور یہ تمام وجوہ سے متنافر چیزوں کے درمیان تفضیل کے علم کو اپنے اندر رکھتی ہے۔ اور یہ اس بات کو بھی اپنے اندر رکھتی ہے کہ عالم میں ہر جوہر عالم کی ہر حقیقت کو جمع کرتا ہے، جیسا کہ ہر الٰہی اسم تمام الٰہی اسماء سے موسوم ہے۔ اور یہ اللہ تعالیٰ کا فرمان ہے: قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَى (کہو: اللہ کو پکارو یا رحمن کو پکارو، تم جس نام سے بھی پکارو، اسی کے لیے سب اچھے نام ہیں)۔\n\nاور یہ علم خاص طور پر میرے علم میں مجھ سے ہی مخصوص ہے، نہ کہ جماعت سے۔ پس میں نہیں جانتا کہ کیا میرے علاوہ کسی اور نے اس پر اطلاع پائی ہے اور اسے کشف (الکشف) ہوا ہے یا نہیں، مؤمنین اہل ولایت کی جنس میں سے، نہ کہ انبیاء کی جنس میں سے۔ اور جہاں تک الٰہی اسماء کا تعلق ہے، تو ابو القاسم بن قسی نے اپنی کتاب *خلع النعلین* میں یہ بات کہی ہے۔ پس اللہ اس بندے پر رحم کرے جسے یہ خبر پہنچے کہ کسی نے اس مسئلے کو اپنی طرف سے کہا ہے جیسا کہ میں نے کیا، یا کسی اور کی طرف سے، تو وہ اسے میرے اس دعوے کی شہادت کے طور پر میری اس کتاب میں اس مقام پر شامل کر دے۔ کیونکہ میں موافقت کو پسند کرتا ہوں اور یہ نہیں چاہتا کہ اپنے اصحاب کے بغیر کسی چیز میں منفرد رہوں۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "باب دویست و نود و هفتم: در معرفت منزل ستایش (ثناء) تسویه طینت انسانی در مقام اعلی از حضرت محمدیه (الحضرة المحمدية)\n\nای خلقی که هموار گشته‌ای، تنزیه کن\nبر صفتی که هموارکننده (مسوی) به تساوی نهاده است.\nو به آنچه از آن دگرگون شده است منگر،\nو آنچه را که رسول از آسمان آورده است.\nاگر از امید بیمناک شدی، در آن تأیید گشتی\nبه آنچه ایمنیِ امید می‌بخشد.\nسلیمانیه‌ای در برابرم ایستاد\nکه با آن آسایشی از آسایش برپا می‌دارم.\nبر صفا ایستادم و سر فرود آوردم برای سِرّی\nالهی در منزلت صفا.\nو غزال را در فروغش در آغوش گرفتم،\nهیچ علوّی بالاتر از منزلت سهاء (بلندی) نیست.\nو از عقل‌ها بی‌حد گذشتم،\nو در حریم جان‌ها با حیا فرو رفتم.\n\n### [هر چیزی در عالم خداوند را تسبیح می‌گوید]\n\nخداوند متعال می‌فرماید: «و هیچ چیز نیست مگر آنکه با ستایش او تسبیح می‌گوید» (وَإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ). پس هیچ صورتی در عالم نیست، و در عالم جز صورت‌ها نیست، مگر آنکه خالق خود را با ستایشی مخصوص که به آن الهام شده است، تسبیح می‌گوید. و هیچ صورتی در عالم فاسد نمی‌شود مگر آنکه عین فساد آن، ظهور صورتی دیگر در همان جواهر است که عیناً تسبیح‌گوی خداوند متعال است، تا آنکه تمام هستی (الکون) از تسبیح خالق خود خالی نماند. پس اعیان اجزای آن صورت، او را به آنچه شایسته آن صورت است تسبیح می‌گویند. و صورت‌هایی که در عالم هستند، همگی نسبت‌ها و احوالی هستند که نه موجودند و نه معدوم، و اگرچه از جهتی مشهودند، از جهت دیگر مشهود نیستند. و عین زمان فنای آن صورت‌ها، عین زمان وجود آن صورت‌هاست؛ یعنی عین فساد آن، عین دیگری است، نه اینکه پس از فساد، دیگری پدید آید.\n\n### [اینکه تمام عالم به جز انس و جن، دارای کشف آنچه از احساس بشری پنهان است، می‌باشند]\n\nو چون این را دانستی، بدان که تمام عالم، به جز انس و جن، به طور کامل دارای کشف (الکشف) آنچه از حس بشری پنهان است، می‌باشد. پس هیچ‌یک از جن و انس آن غیب را مشاهده نمی‌کند مگر در هنگام خرق عادات، به خاطر کرامتی که خداوند او را بدان گرامی می‌دارد، یا خاصیتی از امری از امور که کشف غیوب را می‌بخشد. چنانکه هر جماد و نبات و حیوان در تمام عالم، و در عالم انسان و جن، و اجسام ملائکه و افلاک، و هر صورتی که روحی آن را تدبیر می‌کند، چه آن تدبیر در کسی که حیاتش آشکار است محسوس باشد و چه در کسی که حیاتش پنهان است نامحسوس باشد، مانند اعضای انسان و پوست‌های او و مانند آن؛ همه این‌ها در محل کشف (الکشف) غیوب الهی هستند که از ارواح مدبر این اجسام، یعنی ملک و انس و جن، پوشیده مانده است و بس. زیرا آن‌ها از درک این غیب الهی محجوبند، مگر با خرق عادتی در برخی از آن‌ها یا در همه آن‌ها. و تو دانستی که سنگ و حیوان و نبات، نبوت محمد (صلی الله علیه و سلم) را از این باب شناختند، و این از غیوب الهی است. پس هر روحی چنین چیزی را نمی‌داند، مگر اینکه خداوند او را بدان آگاه سازد، به جز کسانی که ذکر کردیم؛ زیرا آن‌ها آن را با فطرتی که خداوند بر آن آفریده است می‌شناسند. هنگامی که حق (الحق) ظاهر شود، آن‌ها را در ذاتشان به نام خود ندا می‌دهد، و هنگامی که با عین خود حاضر شود، به آن‌ها خبر می‌دهد. یوسف بن یخلف الکومی، از بزرگ‌ترین کسانی که در این طریق ملاقات کردیم، در سال پانصد و هشتاد و شش هجری (۵۸۶ق)، خدا او را رحمت کند، به من گفت: موسی السردانی که از ابدال محمولین بود، به من خبر داد که: هنگامی که من و رفیقم به سوی کوهی که قاف نامیده می‌شود، که کوهی است محیط بر دریای محیط بر زمین، می‌رفتیم، و خداوند ماری را بر ساحل آن دریا، بین دریا و کوه، آفریده بود که با بدن خود دور دریای محیط چرخیده بود تا سرش به دمش رسیده بود. ما نزد آن ایستادیم. رفیقم به من گفت: بر او سلام کن، زیرا او به تو پاسخ خواهد داد. موسی گفت: من بر او سلام کردم. او گفت: «و علیک السلام و رحمة الله و برکاته.» سپس به من گفت: حال شیخ ابومدین چگونه است؟ و ابومدین در آن زمان در بجایه بود. به او گفتم: او را در عافیت ترک کردم. تو از کجا او را می‌شناسی؟ او تعجب کرد و گفت: آیا بر روی زمین کسی هست که او را دوست نداشته باشد؟ به خدا سوگند، از زمانی که خداوند او را ولی خود قرار داد، در ذات‌های ما ندا داد و محبت او را در دل‌های ما به زمین نازل کرد. پس هیچ سنگ و کلوخ و درخت و حیوانی نیست مگر آنکه او را می‌شناسد و دوست می‌دارد. به او گفتم: به خدا سوگند، مردمی هستند که به دلیل جهل و کینه نسبت به او، قصد کشتن او را دارند. مار گفت: نمی‌دانستم کسی در مورد کسی که خداوند او را دوست داشته باشد، چنین حالی داشته باشد. این از همان باب است. و از همین باب است شهادت دست‌ها و پاها و پوست‌ها و دهان‌ها و زبان‌ها که در نظر ما گنگ هستند، اما در واقع ناطقند. پس هر مخلوقی به جز بنی آدم در مقام خشوع و تواضع است، مگر انسان که ادعای کبریا و عزت و جبروت بر خداوند تبارک و تعالی می‌کند. اما جن، این ادعا را بر مخلوقاتی که به زعم آن‌ها پایین‌تر از ایشان هستند، دارند، مانند استکبار ابلیس از حیث نشأت خود بر آدم (علیه السلام). و به همین دلیل گفت: «آیا سجده کنم برای کسی که او را از گِل آفریدی؟» (أَسْجُدُ لِمَنْ خَلَقْتَ طِيناً) زیرا عنصر آتش را شریف‌تر از عنصر خاک دید و گفت: «من از او بهترم؛ مرا از آتش آفریدی و او را از گِل آفریدی» (أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ وخَلَقْتَهُ من طِينٍ). پس او بر خداوند عز و جل تکبر نکرد. بنابراین، انسان به تنهایی از میان سایر مخلوقات به این صفت اختصاص یافت. چون چنین ادعایی در هستی (الوجود) حاصل شد و از مدعی در نفس خود و در کسانی که این را در او باور داشتند، مانند فرعون و کسانی از قومش که او را سبک شمردند، محقق گشت، خداوند در هستی (الوجود) «أفعل من کذا» (برتر از فلان) را به معنای برتری‌جویی قرار داد، به عنوان تأیید و اثبات آن ادعا. پس خداوند فرمود: «الله اکبر» (خداوند بزرگ‌تر است)، و لفظ «أفعل» (برتر) را آورد. و پیامبر (صلی الله علیه و سلم) فرمود: «الله أعلى وأجل» (خداوند والاتر و باشکوه‌تر است).\n\nپس «أفعل من کذا» (برتر از فلان) که جلال خداوند بدان وصف می‌شود، سببش مشارکت در ادعای آن صفت است، اما برخی از آن‌ها ستوده و برخی نکوهیده است. نکوهیده آن است که فرعون ادعا کرد، و ستوده مانند قول خداوند متعال درباره خود که: «او مهربان‌ترین مهربانان است» (أَرْحَمُ الرَّاحِمِينَ) و «بهترین آفرینندگان است» (أَحْسَنُ الْخالِقِينَ). پس لفظ «أفعل» را آورد و بر مهربانان از بندگانش ثنا گفت به اینکه خود را مهربان‌تر از آن‌ها نسبت به خلقش قرار داد. اما تقریر عام آن این است که رحمت از جانب آن‌ها حقیقتی است که خداوند در آن‌ها ایجاد کرده و با آن به یکدیگر رحم می‌کنند، و کبریا را در انسان به واسطه صورت ایجاد کرد و او با آن تکبر ورزید. اگر بگویی: اگر «أفعل» (برتر) وارد شود، منظور از آن «أفعل من» (برتر از) نیست، می‌گوییم: خداوند می‌فرماید: «بهترین آفرینندگان» (أَحْسَنُ الْخالِقِينَ)، و در اینجا بدون شک «أفعل من» است. و همچنین در حق انسان، هنگامی که خداوند متعال فرمود: «به هر چیزی آفرینش آن را عطا کرد» (أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ). پس هر موجودی بر تقویمی است که آفرینش او به او می‌دهد. و درباره انسان فرمود که او را در «بهترین تقویم» (أَحْسَنِ تَقْوِيمٍ) آفرید؛ یعنی تقویمی که او را بر آن آفرید، برتر از هر تقویمی است. و این صفتی که با آن بر دیگران برتری یافت، محقق نشد مگر به این دلیل که خداوند او را بر صورت خود آفرید. اگر بگویی: پس این تغییری که بر انسان عارض می‌شود، در حالی که صورت حق (الحق) تغییر نمی‌پذیرد، چگونه است؟ می‌گوییم: خداوند در این مقام می‌فرماید: «به زودی برای شما فارغ خواهیم شد، ای دو گروه جن و انس» (سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ). و پیامبر (صلی الله علیه و سلم) فرمود: «پروردگارت فارغ شد.» و فرمود: «در پایین‌ترین صورت تجلی می‌کند، سپس هنگام انکار آن‌ها، به صورتی که او را با علامتی که می‌شناسند، شناخته‌اند، تبدیل می‌شود.»\n\nپس خداوند این مقام را به خود نسبت داده است، در حالی که ذاتاً از مقام تغییر و تبدیل والاتر است. اما تجلیات (التجلیات) در مظاهر الهی به اندازه عقایدی است که برای مخلوقات در آنات (لحظات) پدید می‌آید و به این مقام نامیده می‌شود. و چون امر بر این منوال است که ذکر کردیم، و همین‌طور هم هست، پس آنچه ذکر کردیم صحیح است و اعتراض وهمی برطرف می‌شود. خداوند بسیار والاتر است.\n\n### [حروف مرقوم در صحیفه‌ها، کلام خداوند را می‌فهمانند]\n\nو از جمله علومی که این منزل در بر دارد، علم اسماء الاسماء (نام‌های نام‌ها) است، و اینکه آن‌ها حرمتی دارند که مسمای به آن نام‌ها دارد. حروف مرقوم در صحیفه‌ها، عین کلامی هستند که از آن‌ها کلام خداوند که او بدان وصف شده است، فهمیده می‌شود. و اینکه چرا آن وصف به آن باز می‌گردد، علم دیگری است که مردم در آن اختلاف کرده‌اند و ما نیازی به ورود در آن نداریم. حق (الحق) سبحانه، از جهت متکلم بودن، خود را با نام‌هایش ذکر می‌کند، بر حسب آنچه کلامی که نسبت دادنش تکلیفی ندارد، به او نسبت داده می‌شود. و آن نام‌ها نزد ما در زبان هر متکلمی نام‌هایی دارند. پس به زبان عربی، نامی که خود را بدان نامیده است، از جهت متکلم بودن، «الله» نامیده می‌شود، و به فارسی «خدای»، و به حبشی «واق»، و به زبان فرنگ «کربطور» و به همین ترتیب به هر زبانی. فهذه أسماء تلك الأسماء (این‌ها نام‌های آن نام‌ها هستند) و به دلیل تعدد نسبت‌ها، متعدد شده‌اند. پس در هر طایفه‌ای از حیث آنچه بر آن دلالت می‌کنند، تعظیم می‌شوند. و به همین دلیل است که ما از سفر با مصحف به سرزمین دشمن نهی شده‌ایم، در حالی که آن خط دست‌های ماست، اوراقی است که با دست‌های پدیدآمده (محدثات) با مرکبی از مازو و زاج نوشته شده است. اگر این دلالت نبود، تعظیمی برای آن واقع نمی‌شد و نه حقارتی. و به همین دلیل است که در عرف عادت و در عرف شرع، کلام زشت و کلام نیکو گفته می‌شود و امثال آن. و سبب آن، مدلول این الفاظ در اصطلاح و وضع است. این علمی شریف است که جز اهل کشف (الکشف) آن را درک نمی‌کنند، بر همان صورتی که امر بر آن است. پس در دست ما جز نام‌های نام‌ها نیست. پس اگر تنزیه برای نام‌های نام‌ها واقع شود، تنزیه بنده کامل (العبد الکامل) به خاطر صورت (الصورة)، به حرمت سزاوارتر است، به ویژه وجه (صورت)؛ زیرا وجه شریف‌ترین چیز در ظاهر انسان است، به دلیل اینکه حضرت (محل ظهور) تمام قوای باطنی و ظاهری است، و وجه هر چیزی ذات آن است.\n\nپیامبر (صلی الله علیه و سلم) بر مردی گذشت که صورت غلام خود را می‌زد. پیامبر (صلی الله علیه و سلم) به او فرمود: «از صورت بپرهیز، زیرا خداوند آدم را بر صورت خود آفرید.»\n\nو صورت محل روی آوردن به سوی خداوند است، نه جهات دیگر. پس آن جهت عظمی است.\n\n### [فرق میان خلق و تقدیر]\n\nو از جمله علوم این منزل، علم به فرق میان خلق (الخلق) و تقدیر (التقدیر) است. تقدیر (التقدیر) تنها به اسم مدبر (المدبر) و مفصل (المفصل) تعلق دارد، نه نام‌های دیگر. و فرموده است: «امر را تدبیر می‌کند و آیات را تفصیل می‌دهد» (يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ). و هر دو اسم تحت احاطه اسم عالم (العالم) هستند. و اسم قادر (القادر) در این حضرت (الحضرة) دخالتی ندارد، زیرا این سه اسم به ذات حق (الحق) باز می‌گردند، و حق مقدور نفس خود نمی‌باشد. پس اسم قادر در اینجا حکمی ندارد. اسم مقدر (المقدر) در این مرتبه معتبر است. و خلق (الخلق) عقلاً اسم قادر را می‌طلبد و کشفاً و شرعاً اسم قائل (گوینده) را می‌طلبد. و اینکه گفتیم کشفاً، برای این است که در این میان بین ولی و نبی فرق گذاشته شود، زیرا هر یک از این دو مرد به این قائل است، برخلاف آنچه نظر فکری برای عقل با دلیل خود می‌دهد. همان‌طور که اسم قادر از مقدر لفظاً و معناً متمایز شد، خلق نیز از تقدیر لفظاً و معناً متمایز گشت. با تقدیر، بیان در صورت‌های موجودات، بر اساس اختلاف ذات‌های آن‌ها، چه حسی باشند و چه معنوی، از عالم حروف رقمی یا لفظی یا فکری، و از عالم اعیان قائم به خود، و از عالم اعیانی که قائم به خود نیستند، واقع می‌شود. و عالم نسبت‌ها نیز در این داخل می‌شود. و به واسطه تسویه‌ای که در این اعیان برای ذات‌های اشخاص آن‌ها در عالم غیب و شهود وجود دارد، خلق (آفرینش) صورت می‌گیرد. و عالم نسبت‌ها در این داخل نمی‌شود، زیرا آن‌ها اعیان وجودی نیستند و به عدم مطلق نیز متصف نمی‌شوند، چون معقول هستند. و به واسطه تمییزی که در همه آن‌ها وجود دارد و اعیان آن‌ها را در بر می‌گیرد، چه عقلی باشد و چه حسی، تقدیر (التقدیر) صورت می‌گیرد، نه خلق. پس هنگامی که عین آنچه ذکر کردیم از هر عالمی، برای حس یا عقل، از اسم خالق یا مدبر مفصل و مقدر ظاهر شد، نفع برخی از آن‌ها به برخی دیگر تعلق می‌گیرد. پس اعیان به یکدیگر نفع می‌رسانند، و حق (الحق) آن‌ها را از پشت پرده این اعیان به سوی خود می‌خواند، هنگامی که برخی از آن‌ها برای منافع به سوی برخی دیگر روی می‌آورند. پس هر صورتی، هر صورتی را به سوی او می‌خواند. برخی از ما آگاه می‌شوند و می‌شناسند که چه کسی آن‌ها را خوانده است، و برخی بر آن‌ها مشتبه می‌شود و نمی‌دانند که امر چگونه است، و در نفس خود نیروی فرقان را می‌یابند، اما وجه فرقان برایشان آشکار نمی‌شود. و برخی از ما هستند که امر بر آن‌ها مشتبه نمی‌شود، اما کور و نابینا هستند و می‌گویند: جز آنچه مشاهده می‌کنیم، چیزی نیست، و آن اعیان این صورت‌هاست. پس ما سه صنف هستیم: صنفی که بینایی سالم و تیزبین دارد، و صنفی که پرده‌ای بر چشمانش افتاده است، پس صورت‌ها را محقق نمی‌کند، با وجود اینکه می‌داند امری هست، اما صورت آن را محقق نمی‌کند، و صنفی که کور مادرزاد است و هرگز چیزی را ندیده است، پس خاطرش آسوده است. و صنف چهارمی وجود ندارد. و منافع این صورت‌ها با اختلاف قابلیت‌ها و سائلان متفاوت است. و هر سائل به حسب حاجت و عرض خود سؤال می‌کند، و گاهی ضروری است و گاهی غیر ضروری. و در حقیقت، جز ضروری وجود ندارد. و به همین دلیل است که عطا حتمی می‌شود، زیرا سائل سؤال نمی‌کند مگر برای غرضی که آن غرض او را به سؤال محتاج کرده است. پس غرض، همان سائل است، و زبان با حال یا با گفتار، مترجم آن غرض است. و آن غرض حیاتی ندارد مگر با تحصیل آنچه در آن سؤال کرده است. اگر به آن نرسد، هلاک می‌شود. پس کسی که او را از آنچه در آن سؤال کرده است منع کند، سبب زوال صورت او از عالم شده است. پس با منع خود، صورتی را از عالم کاسته است که تسبیح‌گوی خداوند متعال بوده است. و محقق می‌خواهد که او بیفزاید و نکاهد. و اغراض ممکن است نکوهیده باشند، و اگر به آنچه می‌طلبند متمکن شوند، انسان در محظوری سخت‌تر از کشتن این غرض با منع از سؤالش واقع می‌شود. و چگونه در این مسئله رهایی یابیم؟ بدان که کسی که مقید و معقول در قبضه عقل تکلیف است، به قضای اغراض به طور مطلق مخاطب نمی‌شود. بلکه این مقام برای صاحبان احوالی است که عقلشان مغلوب شده است. اگر بگویی: پس حفظ بهتر است، چنانکه امام در مورد شیبلی که گفته می‌شد در اوقات نماز به هوش می‌آید و چون فارغ می‌شود، حال جنون بر او حکم می‌راند و میان او و عقلش که به او صحو (هوشیاری) می‌دهد، حائل می‌شود، فرمود. امام ابوالقاسم جنید بن محمد، سید این طایفه، فرمود: «حمد خدای را که زبان گناه بر او جاری نشد و گناهی به او نسبت داده نشد.» اما زبان گناه از حیث صورت، نزد کسی که او را نمی‌شناسد، به او تعلق می‌گیرد، در حالی که او در واقع گناهکار نیست. برخی از اصحاب ما گفتند: اگر تنزه از جاری شدن زبان گناه اولی و عظیم‌تر نبود، این امام خداوند را بر آن حمد نمی‌گفت. ما می‌گوییم: امر آن‌طور که پنداشتی نیست، و این امام بر کسی که به این رتبه نرسیده است، ترسید که با آن ظاهر شود در حالی که محقق به آن نیست، پس خطا کند و در گناه واقع شود. و آن‌ها بر عالم شفقت دارند. اما اینکه از طریق افضل بودن باشد، چگونه چنین باشد، در حالی که سبحانه زبان بندگانش را بر خود و بر رسولانش به ذم و سب گشوده است؟ پس برای صاحب این جنون (وله) در مورد کسانی که ذکر کردیم، اسوه و عزتی است. پس نزد ما در این فضیلتی نیست.\n\n### [علم رحمتی که خداوند در نسیان موجود پنهان کرده است]\n\nو از جمله علومی که این منزل در بر دارد، علم رحمتی است که خداوند آن را در نسیان (فراموشی) موجود در عالم پنهان کرده است، و اینکه اگر نبود، امر بزرگ و دشوار می‌شد. و در آنچه تذکر در آن واقع می‌شود، کفایت است. و اصل این، قرار دادن حجاب میان عالم و خداوند در موطن تکلیف است، زیرا معاصی و مخالفت‌ها در علم خداوند مقدر شده‌اند، پس وقوع آن‌ها از بنده ضرورتی است. اگر این‌ها با تجلی (التجلی) و کشف (الکشف) واقع می‌شد، مبالغه در کم‌حیایی از خداوند بود، در حالی که او را مشاهده می‌کند و می‌بیند و قضا بر وقوع حاکم است. پس خداوند از روی رحمت بر خلق، به دلیل مصیبت بزرگ، محجوب شد. آیا نمی‌بینی که در امور تدبیر شده با عقل که بر سداد عقلی جاری است، هرگاه خداوند بخواهد قضا و قدر خود را در امری اجرا کند، حکمت و علم خود را که برای آن جاری کرده است، پنهان می‌سازد، به گونه‌ای که نظر عقل آن را اقتضا نمی‌کند. پس هنگامی که آن را اجرا کرد، عقل‌هایشان را به آن‌ها باز می‌گرداند تا بدانند که خداوند در آن هنگام با زوال عقل، به آن‌ها رحم کرده است تا مطالبه برداشته شود.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «هرگاه خداوند بخواهد قضا و قدر خود را نافذ کند، عقل صاحبان عقل را از آن‌ها سلب می‌کند، تا هنگامی که قضا و قدر خود را در مورد آن‌ها اجرا کرد، آن را به آن‌ها باز گرداند تا عبرت گیرند.»\n\nو پیامبر (صلی الله علیه و سلم) فرمود: «خطا و نسیان (فراموشی) از امت من برداشته شده است.»\n\nپس خداوند آن‌ها را به خاطر آن در دنیا و آخرت مؤاخذه نمی‌کند. اما در آخرت، همه بر آن اجماع دارند. و اما در دنیا، بر رفع گناه اجماع کرده‌اند و در حکم اختلاف نموده‌اند. و همچنین در خطا، به اندازه‌ای که شارع در اشخاص مسائل تشریع کرده است. پس کسی که در رمضان از روی فراموشی روزه را افطار کند، طایفه‌ای قضا را بر او واجب دانسته‌اند، با وجود رفع گناه، و گروهی قضا را بر او واجب ندانسته‌اند، با وجود رفع گناه نیز. زیرا خداوند او را خورانده و نوشانده است. این قول شارع در مورد آن است. پس این از رحمت پنهان شده در آن است، یعنی در نسیان. و همچنین آنچه از قرآن فراموش شده و به ما منتقل نشده است، تا تکلیفی بر ما افزوده شود. خداوند با این کار به بندگانش رحم کرده است. و پیامبر (صلی الله علیه و سلم) می‌فرمود: «مرا واگذارید تا زمانی که من شما را وا می‌گذارم.»\n\nو فرمود: «اگر به سائل درباره حج در هر سال، \"بله\" می‌گفتم، واجب می‌شد.»\n\nو احکام با حدوث سؤال از وقایع جدید پدید می‌آمد. پس غرض پیامبر (صلی الله علیه و سلم)، هنگامی که این را دانست، این بود که مردم از سؤال خودداری کنند و با طبع خود پیش روند تا حق (الحق) خود متولی تنزیل احکام شود، هر آنچه را که بخواهد. پس واجبات و محرمات کم می‌شد و کثرت در قبیل مباحات باقی می‌ماند که نه پاداشی به آن‌ها تعلق می‌گیرد و نه گناهی. اما نفوس از پذیرش این امتناع ورزیدند و از توقف در احکام منصوص خودداری کردند، و برای آن‌ها علت‌هایی اثبات کردند و آن‌ها را مقصود شارع قرار دادند و آن‌ها را تعمیم دادند و مسکوت عنه را در حکم به منطوق به، با علتی جامع میان آن‌ها، ملحق کردند که نظر جاعل مجتهد آن را اقتضا می‌کرد. و اگر چنین نمی‌کردند، مسکوت عنه بر اصل خود از اباحه و عافیت باقی می‌ماند. پس احکام با تعلیل و تعمیم علت و قیاس و رأی و استحسان زیاد شد. «و پروردگار تو فراموشکار نبوده است» (وَما كانَ رَبُّكَ نَسِيًّا). اما به حمدالله، خداوند در این رحمت دیگری برای ما قرار داد، اگر فقها این رحمت را بر عوام با الزام آن‌ها به مذهب شخص معینی که نه خداوند و نه رسولش او را معین نکرده‌اند و نه ظاهر کتاب و نه سنت صحیح یا ضعیف بر آن دلالت کرده است، محدود نمی‌کردند. و آن‌ها را از اینکه در واقعه جدید خود در مذهب عالم دیگری که اجتهادش آن را اقتضا کرده است، رخصتی بجویند، منع کردند و در این سخت گرفتند و گفتند: این به بازی گرفتن دین می‌انجامد، و خیال کردند که این دین است. در حالی که پیامبر (صلی الله علیه و سلم) فرمود: «خداوند بر شما صدقه داده است، پس صدقه او را بپذیرید.»\n\nپس رخصت‌ها از جمله چیزهایی است که خداوند بر بندگانش صدقه داده است. و ما بر تقریر حکم مجتهد و بر تقلید عامی از او در آن حکم اجماع کرده‌ایم، زیرا آن حکم نزد او از دلیل شرعی است، چه صاحب قیاس باشد و چه قائل به آن نباشد. پس آن رخصتی که شافعی در مذهب خود بر اساس آنچه دلیلش اقتضا کرده است، دیده است، شرع آن را مقرر کرده است. پس مفتی مالکی مذهب، مالکی را از گرفتن رخصت شافعی که شارع او را بدان متعبد کرده است، منع می‌کند. و ما آن را به شارع نسبت دادیم، زیرا شرع آن را با منع او از آنچه دلیل اقتضا می‌کند، با امری که دلیل ندارد، مقرر کرده است، و آن این است که شخص خود را به مذهب خاصی مقید کند و از آن به دیگری عدول نکند و آنچه را که شرع بر او محدود نکرده است، بر او محدود کند. و این از بزرگ‌ترین مصیبت‌ها و دشوارترین تکالیف بر بندگان خداست. آنچه را که شرع با تقریر حکم مجتهدان این امت وسعت بخشیده است، عوام فقها تنگ کرده‌اند. اما ائمه، مانند ابوحنیفه و مالک و احمد بن حنبل و شافعی، حاشا که هیچ‌یک از آن‌ها چنین کاری کرده باشد و هرگز از آن‌ها نقل نشده است که به کسی گفته باشند: به ما اکتفا کن یا در آنچه به تو فتوا دادم، از من تقلید کن. بلکه آنچه از آن‌ها نقل شده، خلاف این است، خداوند از آن‌ها راضی باشد.\n\n### [فرق میان تعلق علم سبحانه به آنچه بنده در نفس خود پنهان می‌دارد و آنچه آشکار می‌سازد]\n\nو از جمله علومی که این منزل در بر دارد، فرق میان تعلق علم سبحانه به آنچه بنده در نفس خود پنهان می‌دارد و آنچه آشکار می‌سازد، و اینکه آیا این به یک نسبت باز می‌گردد یا به دو نسبت، است. و به این باب، آنچه حق (الحق) با قول خود اراده می‌کند، تعلق دارد:\n\n«هر کس مرا در نفس خود یاد کند، من او را در نفس خود یاد می‌کنم، و هر کس مرا در جمعی یاد کند، من او را در جمعی بهتر از آن‌ها یاد می‌کنم.»\n\nپس این دو حالت در ذکر و علم است. بدان که حق (الحق) سبحانه غیبی و مظهری دارد. به واسطه غیب بودن او، اسم باطن (الباطن) را دارد، و آن یاد کردن بنده خود در نفس خود و علم او به آنچه بنده پنهان می‌دارد، است. و همراه آن اسم، سرّ بنده است که حق آن را می‌داند، و ذکر نفس است که بنده با آن پروردگارش را یاد می‌کند. و به واسطه مظهری که دارد، اسم ظاهر (الظاهر) را دارد، و آن یاد کردن خداوند متعال بنده خود را در جمعی از ملائکه یا جمعی از اسماء الهی است، و علم او به آنچه بنده در عالم شهادت آشکار می‌سازد. و همراه آن اسم، علانیه (آشکار) بنده است که حق آن را می‌داند، و ذکر علانیه است که بنده با آن پروردگارش را یاد می‌کند. و اما علم به آنچه اخفی از سرّ است، چیزی است که جز خداوند به تنهایی آن را نمی‌داند، و این بنده به آن علمی ندارد و ممکن نیست که آن را بداند، و آن علم خداوند به نفس خود است. و غیر از این علم، یا علم سرّ اوست یا علم علانیه او. پس متعلق علم سه چیز است: جهر (آشکار)، سرّ، و آنچه اخفی از سرّ است. و متعلق ذکر دو امر است: ذکر ملأ، که دو نوع است: ملأ اسماء و ملأ ملائکه، و امر دیگر ذکر نفس است. پس ذکر با علم در تقسیم برابر است.\n\n### [اینکه خداوند علم هر چیزی را در انسان به ودیعه نهاده است]\n\nو از جمله علومی که این منزل در بر دارد، این است که خداوند علم هر چیزی را در انسان به ودیعه نهاده است، سپس میان او و درک آنچه نزد اوست و خداوند در او به ودیعه نهاده است، حائل شده است. و انسان تنها به این اختصاص ندارد، بلکه تمام عالم بر این منوال است. و این از اسرار الهی است که عقل آن را انکار می‌کند و به طور کلی محال می‌شمارد. و نزدیکی آن به ذات‌های جاهل در حال علمشان، مانند نزدیکی حق (الحق) به بنده خود است، و آن قول خداوند متعال است: «و ما به او از شما نزدیک‌تریم، ولی شما نمی‌بینید» (ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ). و قول او: «و ما به او از رگ گردن نزدیک‌تریم» (ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ). و با وجود این نزدیکی، درک و شناخته نمی‌شود مگر از طریق تقلید. و اگر خبر او نبود، عقلی بر آن دلالت نمی‌کرد. و همچنین تمام معلومات نامتناهی که با علم به آن‌ها، همه در انسان و در عالم به این منزلت از نزدیکی هستند، در حالی که او نمی‌داند چه در اوست تا اینکه در آنات (لحظات) برای او کشف (الکشف) شود. و کشف (الکشف) به یکباره در مورد او صحیح نیست، زیرا مستلزم حصر است، در حالی که گفتیم نامتناهی است. پس او اشیا را پی در پی تا بی‌نهایت نمی‌داند. و این از شگفت‌انگیزترین اسرار الهی است که آنچه نامتناهی است در وجود بنده داخل شود، همان‌طور که معلومات نامتناهی در علم حق (الحق) داخل شده است، در حالی که علم او عین ذات اوست. و فرق میان تعلق علم حق به آنچه نامتناهی است و میان به ودیعه نهادن حق در قلب بنده آنچه نامتناهی است، این است که حق آنچه در نفس خود و آنچه در نفس بنده خود است را به صورت تعیینی و تفصیلی می‌داند، و بنده آن را جز به صورت اجمالی نمی‌داند. و در علم حق به اشیا اجمالی وجود ندارد، با وجود علم او به اجمال، از این جهت که اجمال برای بنده از نفس خود و از غیر خود معلوم است. پس هر آنچه انسان همیشه می‌داند و هر موجودی، در حقیقت تذکر و تجدید آنچه فراموش کرده است، می‌باشد. و این منزل حکم می‌کند که حق (الحق) بنده را در زمانی در مقام تعلق علم خود به آنچه نامتناهی است، قرار داده است. و این نزد ما محال نیست، بلکه محال، دخول آنچه نامتناهی است در وجود است، نه تعلق علم به آن. سپس خداوند خلق را آن را به فراموشی سپرد، همان‌طور که شهادت آن‌ها به ربوبیت را در هنگام گرفتن میثاق به فراموشی سپرد، با وجود اینکه واقع شده بود و ما آن را با اخبار الهی دانستیم. پس علم انسان همیشه تذکر است. برخی از ما هستند که وقتی یادآوری می‌شوند، به یاد می‌آورند که آن معلوم را قبلاً می‌دانستند و فراموش کرده بودند، مانند ذوالنون مصری. و برخی از ما هستند که آن را به یاد نمی‌آورند، با وجود ایمانشان به اینکه قبلاً به آن شهادت داده‌اند، و در حق او علم ابتدایی است. و اگر نزد او نبود، آن را از کسی که به او آموخته است، نمی‌پذیرفت. اما او به آن شعوری ندارد و جز کسی که خداوند بصیرتش را نورانی کرده است، آن را نمی‌داند. و این مخصوص کسی است که حالش همراه با هر نفس، خشیت است، و این مقام عزیزی است، زیرا جز برای کسی که تجلی (التجلی) دائماً او را همراهی می‌کند، حاصل نمی‌شود. و این منزل مسائل مشهور ذوالنون را در بر دارد، و آن ایجاد محال عقلی با نسبت‌های الهی است. و علم مفاضله (برتری‌جویی) میان متنافرین از جمیع وجوه را در بر دارد. و این را در بر دارد که هر جوهری در عالم، هر حقیقتی را در عالم جمع می‌کند، همان‌طور که هر اسم الهی، مسمای به تمام اسماء الهی است. و این قول خداوند متعال است: «بگو: الله را بخوانید یا رحمان را بخوانید، هر کدام را بخوانید، پس نام‌های نیکو از آن اوست» (قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏). و این علم، خاصه‌ای است که من به تنهایی در علم خود بدان رسیده‌ام، و نمی‌دانم آیا غیر از من کسی از جنس مؤمنان اهل ولایت، نه از جنس انبیا، بر آن آگاه شده و کشف (الکشف) شده است یا خیر. اما در مورد اسماء الهی، ابوالقاسم بن قسی در کتاب «خلع النعلین» به آن قائل شده است. پس خداوند رحمت کند بنده‌ای را که به او برسد که کسی این مسئله را از جانب خود، چنانکه من کردم، یا از جانب دیگری گفته باشد، تا آن را در این موضع به کتاب من ملحق کند، به عنوان استشهاد بر آنچه ادعا کردم. زیرا من موافقت را دوست دارم و اینکه در چیزی از اصحاب خود تنها نباشم. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 5
}