{
  "id": 18,
  "title": {
    "ar": "الباب الثامن عشر في معرفة علم المتهجدين‏",
    "en": "Chapter Eighteen: Concerning the Knowledge of the Night-Vigil Keepers (المتهجدين)",
    "ur": "باب اٹھارہ: تہجد گزاروں کے علم کی معرفت میں",
    "fa": "باب هجدهم در معرفت علم شب‌زنده‌داران (المتهجدين)"
  },
  "content": {
    "ar": "## «الباب الثامن عشر» في معرفة علم المتهجدين‏\n\n\nوما يتعلق به من المسائل ومقداره في مراتب العلوم وما يظهر منه من العلوم في الوجود\n\n\n> علم التهجد علم الغيب ليس له *** في منزل العين إحساس ولا نظر\n\n\n> إن التنزل يعطيه وإن له *** في عينه سورا تعلو به صور\n\n\n> فإن دعاه إلى المعراج خالقه *** بدت له بين أعلام العلى سور\n\n\n> فكل منزلة تعطيه منزلة *** إذا تحكم في أجفانه السهر\n\n\n> ما لم ينم هذه في الليل حالته *** أو يدرك الفجر في آفاقه البصر\n\n\n> نوافج الزهر لا تعطيك رائحة *** ما لم يجد بالنسيم اللين السحر\n\n\n> إن الملوك وإن جلت مناصبها *** لها مع السوقة الأسرار والسمر\n\n\n### [المتهجد: من هو؟ ما له من الأسماء الإلهية؟]\n\n\nاعلم أيدك الله أن المتهجدين ليس لهم اسم خاص إلهي يعطيهم التهجد ويقيمهم فيه كما لمن يقوم الليل كله فإن قائم الليل كله له اسم إلهي يدعوه إليه ويحركه فإن التهجد عبارة عمن يقوم وينام ويقوم وينام ويقوم فمن لم يقطع الليل في مناجاة ربه هكذا فليس بمتهجد قال تعالى ومن اللَّيْلِ فَتَهَجَّدْ به نافِلَةً لَكَ وقال إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنى‏ من ثُلُثَيِ اللَّيْلِ ونِصْفَهُ وثُلُثَهُ‏\n\n\n### [المتهجد: ما مستنده من الأسماء الإلهية]\n\n\nوله علم خاص من جانب الحق غير أن هذه الحالة لما لم نجد في الأسماء الإلهية من تستند إليه ولم نر أقرب نسبة إليها من الاسم الحق فاستندت إلى الاسم الحق وقبلها هذا الاسم فكل علم يأتي به المتهجد إنما هو من الاسم الحق‏\n\n\nفإن النبي صلى الله عليه وسلم قال لمن يصوم الدهر ويقوم الليل إن لنفسك عليك حقا ولعينك عليك حقا فصم وأفطر وقم ونم‏\n\n\nفجمع له بين القيام والنوم لأداء حق النفس من أجل العين ولا داء حق النفس من جانب الله ولا تؤدي الحقوق إلا بالاسم الحق ومنه لا من غيره فلهذا استند المتهجدون لهذا الاسم‏\n\n\n### [المتهجد: ما خصوصيته‏]\n\n\nثم إنه للمتهجد أمر آخر لا يعلمه كل أحد وذلك أنه لا يجني ثمرة مناجاة التهجد ويحصل علومه إلا من كانت صلاة الليل له نافلة وأما من كانت فريضته من الصلاة ناقصة فإنها تكمل من نوافله فإن استغرقت الفرائض نوافل العبد المتهجد لم يبق له نافلة وليس بمتهجد ولا صاحب نافلة فهذا لا يحصل له حال النوافل ولا علومها ولا تجلياتها فاعلم ذلك‏\n\n\n### [المتهجد: في نومه وقيامه‏]\n\n\nفنوم المتهجد لحق عينه وقيامه لحق ربه فيكون ما يعطيه الحق من العلم والتجلي في نومه ثمرة قيامه وما يعطيه من النشاط والقوة وتجليهما وعلومهما في قيامه ثمرة نومه وهكذا جميع أعمال العبد مما افترض عليه فتتداخل علوم المتهجدين كتداخل ضفيرة الشعر وهي من العلوم المعشوقة للنفوس حيث تلتف هذا الالتفاف فيظهر لهذا الالتفاف أسرار العالم الأعلى والأسفل والأسماء الدالة على الأفعال والتنزيه وهو قوله تعالى والْتَفَّتِ السَّاقُ بِالسَّاقِ أي اجتمع أمر الدنيا بأمر الآخرة وما ثم إلا دنيا وآخرة وهو المقام المحمود الذي ينتجه التهجد قال تعالى ومن اللَّيْلِ فَتَهَجَّدْ به نافِلَةً لَكَ عَسى‏ أَنْ يَبْعَثَكَ رَبُّكَ مَقاماً مَحْمُوداً وعسى من الله واجبة والمقام المحمود هو الذي له عواقب الثناء أي إليه يرجع كل ثناء\n\n\n### [المتهجد: ما قدر علمه؟]\n\n\nوأما قدر علم التهجد فهو عزيز المقدار وذلك أنه لما لم يكن له اسم إلهي يستند إليه كسائر الآثار عرف من حيث الجملة إن ثم أمرا غاب عنه أصحاب الآثار والآثار\nفطلب ما هو فأداه النظر إلى أن يستكشف عن الأسماء الإلهية هل لها أعيان أو هل هي نسب حتى يرى رجوع الآثار هل ترجع إلى أمر وجودي أو عدمي فلما نظر رأى أنه ليس الأسماء أعيانا موجودة وإنما هي نسب فرأى مستند الآثار إلى أمر عدمي فقال المتهجد قصارى الأمر أن يكون رجوعي إلى أمر عدمي فأمعن النظر في ذلك ورأى نفسه مولدا من قيام ونوم ورأى النوم رجوع النفس إلى ذاتها وما تطلبه ورأى القيام حق الله عليه فلما كانت ذاته مركبة من هذين الأمرين نظر إلى الحق من حيث ذات الحق فلاح له إن الحق إذا انفرد بذاته لذاته لم يكن العالم وإذا توجه إلى العالم ظهر عين العالم لذلك التوجه فرأى إن العالم كله موجود عن ذلك التوجه المختلف النسب ورأى المتهجد ذاته مركبة من نظر الحق لنفسه دون العالم وهو حالة النوم للنائم ومن نظره إلى العالم وهو حالة القيام لأداء حق الحق عليه فعلم إن سبب وجود عينه أشرف الأسباب حيث استند من وجه إلى الذات معراة عن نسب الأسماء التي تطلب العالم إليه فتحقق إن وجوده أعظم الوجود وأن علمه أسنى العلوم وحصل له مطلوبه وهو كان غرضه وكان سبب ذلك انكساره وفقره فقال في قضاء وطره من ذلك متمثلا\n\n\n> رب ليل بتة ما أتى *** فجره حتى انقضى وطري‏\n\n\n> من مقام كنت أعشقه *** بحديث طيب الخبر\n\n\nوقال في الأسماء\n\n\n> لم أجد للاسم مدلولا *** غير من قد كان مفعولا\n\n\n> ثم أعطتنا حقيقته *** كونه للعقل معقولا\n\n\n> فتلفظنا به أدبا *** واعتقدنا الأمر مجهولا\n\n\nوكان قدر علمه في العلوم قدر معلومه وهو الذات في المعلومات فيتعلق بعلم التهجد علم جميع الأسماء كلها وأحقها به الاسم القيوم الذي لا تأخذه سنة ولا نوم وهو العبد في حال مناجاته فيعلم الأسماء على التفصيل أي كل اسم جاء علم ما يحوي عليه من الأسرار الوجودية وغير الوجودية على حسب ما تعطيه حقيقة ذلك الاسم ومما يتعلق بهذه الحالة من العلوم علم البرزخ وعلم التجلي الإلهي في الصور وعلم سوق الجنة وعلم تعبير الرؤيا لا نفس الرؤيا من جهة من يراها وإنما هي من جانب من ترى له فقد يكون الرائي هو الذي رآها لنفسه وقد يراها له غيره والعابر لها هو الذي له جزء من أجزاء النبوة حيث علم ما أريد بتلك الصورة ومن هو صاحب ذلك المقام‏\n\n\n### [المتهجد: حظه من المقام المحمود]\n\n\nواعلم أن المقام المحمود الذي للمتهجد يكون لصاحبه دعاء معين وهو قول الله تعالى لنبيه صلى الله عليه وسلم يأمره به وقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ يعني لهذا المقام فإنه موقف خاص بمحمد يحمد الله فيه بمحامد لا يعرفها إلا إذا دخل ذلك المقام وأَخْرِجْنِي مُخْرَجَ صِدْقٍ أي إذا انتقل عنه إلى غيره من المقامات والمواقف أن تكون العناية به معه في خروجه منه كما كانت معه في دخوله إليه واجْعَلْ لِي من لَدُنْكَ سُلْطاناً نَصِيراً من أجل المنازعين فيه فإن المقام الشريف لا يزال صاحبه محسودا ولما كانت النفوس لا تصل إليه رجعت تطلب وجها من وجوه القدح فيه تعظيما لحالهم التي هم عليها حتى لا ينسب النقص إليهم عن هذا المقام الشريف فطلب صاحب هذا المقام النصرة بالحجة التي هي السلطان على الجاحدين شرف هذه المرتبة وقُلْ جاءَ الْحَقُّ وزَهَقَ الْباطِلُ إِنَّ الْباطِلَ كانَ زَهُوقاً ... والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Eighteen: Concerning the Science of the Night Worshippers, the Issues Related to It, Its Rank Among the Levels of Knowledge, and the Sciences that Manifest from It in Existence\n\n> The science of *Tahajjud* is the science of the Unseen (الغيب); it has\n> In the abode of the eye, neither sensation nor sight.\n> The descent grants it, and indeed it has\n> In its eye, walls upon which forms ascend.\n> If its Creator calls it to the Ascent (*Mi'raj*),\n> Walls appear to it amidst the signs of loftiness.\n> For every station grants it a station,\n> When wakefulness dominates its eyelids.\n> Unless it sleeps, this is its state throughout the night,\n> Or until the sight perceives the dawn on its horizons.\n> The blossoms of flowers do not give you fragrance\n> Unless the gentle breeze of dawn (السحر) blows upon them.\n> Indeed, kings, even if their ranks are exalted,\n> Share secrets and night talks with the common folk.\n\n### [The Night Worshipper: Who is he? What Divine Names belong to him?]\n\nKnow, may Allah support you, that the Night Worshippers (المتهجدين) do not have a specific Divine Name (اسم إلهي) that grants them *Tahajjud* and establishes them in it, unlike the one who stands the entire night. The one who stands the entire night has a Divine Name that calls him to it and moves him. *Tahajjud* is defined as one who stands, sleeps, stands, sleeps, and stands. Whoever does not divide the night in intimate communion (*munajat*) with his Lord in this manner is not a Night Worshipper. Allah the Exalted said: <<وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ>> (And during the night, perform *Tahajjud* with it as a supererogatory act for you). And He said: <<إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَى مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ>> (Indeed, your Lord knows that you stand [in prayer] for less than two-thirds of the night, and half of it, and a third of it).\n\n### [The Night Worshipper: What is his reliance among the Divine Names?]\n\nHe possesses a specific knowledge from the side of The Real (الحق). However, since we did not find among the Divine Names (الأسماء الإلهية) one upon which this state could rely, and we saw no closer connection than to the Name The Real (الحق), this state relied upon the Name The Real, and this Name accepted it. Thus, all knowledge brought forth by the Night Worshipper is only from the Name The Real.\n\nThe Prophet (peace and blessings be upon him) said to the one who fasts perpetually and stands the night: \"Indeed, your self has a right over you, and your eye has a right over you. So fast and break your fast, and stand and sleep.\"\n\nHe thus combined for him standing and sleeping for the sake of fulfilling the right of the self due to the eye, and for fulfilling the right of the self from the side of Allah. Rights (الحقوق) are only fulfilled through the Name The Real (الحق) and from it, not from any other. For this reason, the Night Worshippers rely upon this Name.\n\n### [The Night Worshipper: What is his particularity?]\n\nFurthermore, the Night Worshipper has another matter that not everyone knows: he does not reap the fruit of the intimate communion of *Tahajjud* and acquire its sciences unless his night prayer is supererogatory (*nafilah*). As for the one whose obligatory prayers (*fara'id*) are deficient, they are completed by his supererogatory acts. If the obligatory duties consume the supererogatory acts of the worshipper, he is left with no supererogatory act, and he is neither a Night Worshipper nor a possessor of supererogatory acts. Such a person does not attain the state of supererogatory acts, nor their sciences, nor their Theophanies (تجلياتها). Know this.\n\n### [The Night Worshipper: Concerning his sleep and his standing]\n\nThe sleep of the Night Worshipper is for the right of his eye, and his standing is for the right of his Lord. Thus, the knowledge and Theophany (التجلي) that The Real grants him during his sleep are the fruit of his standing, and the vigor and strength, and their Theophanies and sciences, that He grants him during his standing are the fruit of his sleep. This is the case for all the servant’s actions, including those made obligatory upon him. The sciences of the Night Worshippers thus interweave like the intertwining of a braid of hair. These are sciences beloved by the souls, as this intertwining reveals the secrets of the Higher and Lower Worlds (العالم الأعلى والأسفل), the Names (الأسماء) indicating Acts (الأفعال), and Transcendent Purity (التنزيه). This is His saying, the Exalted: <<وَالْتَفَّتِ السَّاقُ بِالسَّاقِ>> (And the leg is joined with the leg)—meaning the affair of this world is joined with the affair of the Hereafter, and there is nothing there but this world and the Hereafter. This is The Praised Station (المقام المحمود) produced by *Tahajjud*. Allah the Exalted said: <<وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا>> (And during the night, perform *Tahajjud* with it as a supererogatory act for you; perhaps your Lord will raise you to a Praised Station). And \"perhaps\" (*‘asa*) from Allah is obligatory. The Praised Station is that which has consequences of praise, meaning all praise returns to it.\n\n### [The Night Worshipper: What is the measure of his knowledge?]\n\nAs for the measure of the science of *Tahajjud*, its rank is precious. Since it did not have a Divine Name (اسم إلهي) upon which to rely, like other effects (الآثار), it was known generally that there was an affair hidden from the people of effects and the effects themselves. He sought what that affair was, and contemplation led him to investigate whether the Divine Names (الأسماء الإلهية) are entities (أعيان) or relations (نسب), so that he might see whether the return of the effects is to an existent (وجودي) or non-existent (عدمي) affair. When he looked, he saw that the Names are not existing entities but rather relations. He thus saw that the reliance of the effects is upon a non-existent affair. The Night Worshipper said: \"The utmost extent of the matter is that my return is to a non-existent affair.\" He contemplated this deeply and saw himself generated from standing and sleeping. He saw sleep as the return of the soul to its Essence (ذاتها) and what it seeks, and standing as the right of Allah upon him. Since his essence was composed of these two affairs, he looked at The Real (الحق) from the perspective of the Essence of The Real (ذات الحق). It became clear to him that if The Real were isolated in His Essence for His Essence, the world would not exist; and if He turned toward the world, the essence of the world would manifest due to that turning. He saw that the entire world exists due to that turning of varying relations. The Night Worshipper saw his own essence composed of The Real’s contemplation of Himself without the world—which is the state of sleep for the sleeper—and His contemplation of the world—which is the state of standing for the fulfillment of the right of The Real upon him. He thus knew that the cause of the existence of his essence (عين وجوده) is the most noble of causes, as it relies, from one perspective, upon the Essence (الذات) stripped of the relations of the Names (نسب الأسماء) that demand the world toward Him. He thus verified that his existence is the greatest existence and his knowledge is the loftiest of sciences, and he attained his objective, which was his goal. The cause of this was his brokenness and poverty. He recited, fulfilling his need from that:\n\n> How many a night I spent, whose dawn did not come\n> Until my need was fulfilled.\n> From a station I adored\n> With a discourse of good tidings.\n\nAnd concerning the Names, he said:\n\n> I found no referent for the Name\n> Other than that which was acted upon.\n> Then its reality granted us\n> Its being intelligible to the intellect.\n> So we pronounced it out of courtesy\n> While believing the matter to be unknown.\n\nThe measure of his knowledge among the sciences is the measure of his object of knowledge, which is the Essence (الذات) among the objects of knowledge. Thus, the science of *Tahajjud* relates to the knowledge of all the Names (الأسماء) entirely. The Name most deserving of connection to him is The Self-Subsisting (القيوم), Whom neither slumber nor sleep overtakes—this is the servant in his state of intimate communion (*munajat*). He knows the Names in detail, meaning that for every Name that comes, he knows the secrets of existence and non-existence contained within it, according to what the reality of that Name grants. Among the sciences related to this state are the science of the Isthmus (علم البرزخ), the science of Divine Theophany (التجلي الإلهي) in forms, the science of the market of Paradise (سوق الجنة), and the science of dream interpretation (تعبير الرؤيا)—not the dream itself from the perspective of the one who sees it, but from the side of the one for whom it is seen. The viewer may be the one who saw it for himself, or someone else may have seen it for him. The interpreter of the dream is the one who possesses a portion of the parts of Prophethood, as he knows what was intended by that form and who is the possessor of that station.\n\n### [The Night Worshipper: His share of The Praised Station]\n\nKnow that The Praised Station (المقام المحمود) belonging to the Night Worshipper has a specific supplication for its possessor, which is the saying of Allah the Exalted to His Prophet (peace and blessings be upon him), commanding him with it: <<وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ>> (And say: 'My Lord, cause me to enter with a truthful entrance')—meaning into this Station, for it is a specific standing place for Muhammad where he praises Allah with praises known only when he enters that Station. <<وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ>> (And cause me to exit with a truthful exit)—meaning when he moves from it to other stations and standpoints, that the Divine Care remains with him in his exit from it, just as it was with him in his entrance into it. <<وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا>> (And grant me from Your presence an assisting authority)—because of those who dispute it. For the noble Station (المقام الشريف) is always envied by its possessor. Since souls cannot reach it, they resort to seeking some way to disparage it, magnifying their own state so that deficiency is not attributed to them regarding this noble Station. Thus, the possessor of this Station sought assistance through the proof (الحجة), which is the authority (السلطان) over those who deny the honor of this rank. <<وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا>> (And say: 'The Truth has come, and falsehood has vanished. Indeed, falsehood is ever bound to vanish')... <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks The Truth, and He guides to the way).",
    "ur": "باب اٹھارہ: علم تہجد گزاران کی معرفت میں\nاور اس سے متعلقہ مسائل، علوم کے مراتب میں اس کا مقام، اور وہ علوم جو اس سے ہستی (الوجود) میں ظاہر ہوتے ہیں۔\n\n> علم تہجد علم غیب ہے، اس کے لیے\n> منزلِ عین میں نہ کوئی احساس ہے نہ کوئی نظر۔\n> بیشک تنزل اسے عطا کرتا ہے، اور اس کے لیے\n> اس کی عین میں ایسی دیواریں ہیں جن پر صورتیں بلند ہوتی ہیں۔\n> پس اگر اس کا خالق اسے معراج کی طرف بلائے،\n> تو اس کے لیے بلندی کے نشانات کے درمیان دیواریں ظاہر ہوتی ہیں۔\n> ہر منزل اسے ایک نئی منزل عطا کرتی ہے،\n> جب بیداری اس کی پلکوں پر غالب آ جاتی ہے۔\n> رات میں اس کی یہ حالت ہے کہ وہ سوتا نہیں،\n> یا اس کی بصارت افق پر فجر کو پا لیتی ہے۔\n> پھولوں کی خوشبو تمہیں مہک نہیں دے گی،\n> جب تک سحر نرم نسیم کے ساتھ نہ آئے۔\n> بیشک بادشاہوں کے مناصب کتنے ہی بلند کیوں نہ ہوں،\n> ان کے لیے عام لوگوں کے ساتھ بھی راز اور شب کی محفلیں ہوتی ہیں۔\n\n[تہجد گزار: وہ کون ہے؟ اس کے لیے کون سے اسماء الٰہیہ ہیں؟]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ تہجد گزاروں کے لیے کوئی خاص اسم الٰہی نہیں ہے جو انہیں تہجد عطا کرے اور اس پر قائم رکھے، جیسا کہ ان لوگوں کے لیے ہے جو پوری رات قیام کرتے ہیں۔ کیونکہ پوری رات قیام کرنے والے کے لیے ایک اسم الٰہی ہے جو اسے اس کی طرف بلاتا اور متحرک کرتا ہے۔ تہجد اس شخص کا عمل ہے جو قیام کرتا ہے، سوتا ہے، پھر قیام کرتا ہے، پھر سوتا ہے، پھر قیام کرتا ہے۔ پس جو شخص رات کو اپنے رب کی مناجات میں اس طرح تقسیم نہیں کرتا، وہ تہجد گزار نہیں ہے۔ اللہ تعالیٰ نے فرمایا:\n**وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ** (اور رات کے کچھ حصے میں اس کے ساتھ تہجد پڑھو، یہ تمہارے لیے اضافی عبادت ہے)۔\nاور فرمایا:\n**إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ** (بیشک آپ کا رب جانتا ہے کہ آپ رات کے دو تہائی سے کم، آدھا اور ایک تہائی قیام کرتے ہیں)۔\n\n[تہجد گزار: اسماء الٰہیہ میں اس کا مستند کیا ہے؟]\n\nاس کے لیے ذات حق (الحق) کی طرف سے ایک خاص علم ہے۔ غیر ازیں، چونکہ ہمیں اسماء الٰہیہ (الأسماء الإلهية) میں کوئی ایسا اسم نہیں ملا جس سے یہ حالت مستند ہو، اور ہم نے اس کے لیے اسم الحق (الاسم الحق) سے زیادہ قریب کوئی نسبت نہیں دیکھی، لہٰذا یہ اسم الحق (الاسم الحق) سے مستند ہوئی اور اس اسم نے اسے قبول کیا۔ پس ہر وہ علم جو تہجد گزار لاتا ہے، وہ اسم الحق (الاسم الحق) کی طرف سے ہی ہوتا ہے۔\n\nکیونکہ نبی اکرم صلی اللہ علیہ وسلم نے اس شخص سے جو ہمیشہ روزہ رکھتا اور رات بھر قیام کرتا تھا، فرمایا:\n**إن لنفسك عليك حقا ولعينك عليك حقا فصم وأفطر وقم ونم** (بیشک تمہاری جان کا تم پر حق ہے، اور تمہاری آنکھ کا تم پر حق ہے، پس روزہ بھی رکھو اور افطار بھی کرو، قیام بھی کرو اور سوؤ بھی)۔\n\nآپ صلی اللہ علیہ وسلم نے اس کے لیے قیام اور نیند کو جمع کیا تاکہ آنکھ کی خاطر نفس کا حق ادا ہو، اور اللہ کی طرف سے نفس کا حق ادا ہو۔ اور حقوق صرف اسم الحق (الاسم الحق) کے ذریعے ہی ادا ہوتے ہیں، نہ کہ کسی اور کے ذریعے۔ اسی لیے تہجد گزار اس اسم سے مستند ہیں۔\n\n[تہجد گزار: اس کی خصوصیت کیا ہے؟]\n\nپھر تہجد گزار کے لیے ایک اور معاملہ ہے جسے ہر کوئی نہیں جانتا، اور وہ یہ ہے کہ تہجد کی مناجات کا پھل اور اس کے علوم صرف وہی حاصل کرتا ہے جس کے لیے رات کی نماز نفل ہو۔ لیکن جس کی فرض نماز میں کمی ہو، تو وہ اس کے نوافل سے پوری کی جاتی ہے۔ اگر فرائض تہجد گزار بندے کے نوافل کو مکمل طور پر استعمال کر لیں، تو اس کے لیے کوئی نفل باقی نہیں رہتا، اور وہ نہ تہجد گزار رہتا ہے اور نہ صاحبِ نفل۔ پس اسے نوافل کی حالت، نہ ان کے علوم اور نہ ان کے ظہور الٰہی (التجلی) حاصل ہوتے ہیں۔ یہ جان لو۔\n\n[تہجد گزار: اس کی نیند اور قیام میں]\n\nتہجد گزار کی نیند اس کی آنکھ کے حق کے لیے ہے، اور اس کا قیام اس کے رب کے حق کے لیے ہے۔ پس جو علم اور ظہور الٰہی (التجلی) ذات حق (الحق) اسے اس کی نیند میں عطا کرتی ہے، وہ اس کے قیام کا ثمرہ ہوتا ہے، اور جو چستی اور قوت، اور ان کا ظہور اور ان کے علوم اسے اس کے قیام میں عطا ہوتے ہیں، وہ اس کی نیند کا ثمرہ ہوتے ہیں۔ اور اسی طرح بندے کے تمام اعمال جو اس پر فرض کیے گئے ہیں۔ پس تہجد گزاروں کے علوم آپس میں اس طرح گڈ مڈ ہو جاتے ہیں جیسے بالوں کی چوٹی، اور یہ ان علوم میں سے ہیں جو نفوس کو محبوب ہیں، کیونکہ یہ اس طرح لپٹتے ہیں کہ اس لپیٹ سے عالم بالا اور عالم اسفل کے اسرار اور افعال پر دلالت کرنے والے اسماء اور تنزیہ ظاہر ہوتے ہیں۔ اور یہی اللہ تعالیٰ کا قول ہے:\n**وَالْتَفَّتِ السَّاقُ بِالسَّاقِ** (اور پنڈلی پنڈلی سے لپٹ جائے گی)۔\nیعنی دنیا کا معاملہ آخرت کے معاملے سے جمع ہو جائے گا، اور وہاں دنیا اور آخرت کے سوا کچھ نہیں ہے۔ اور یہی وہ مقام محمود (المقام المحمود) ہے جو تہجد سے پیدا ہوتا ہے۔ اللہ تعالیٰ نے فرمایا:\n**وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَىٰ أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا** (اور رات کے کچھ حصے میں اس کے ساتھ تہجد پڑھو، یہ تمہارے لیے اضافی عبادت ہے، قریب ہے کہ تمہارا رب تمہیں مقام محمود (المقام المحمود) پر فائز کرے)۔\nاور اللہ کی طرف سے \"عسیٰ\" (قریب ہے) واجب ہوتی ہے۔ اور مقام محمود (المقام المحمود) وہ ہے جس کے نتائج ثناء پر منتج ہوتے ہیں، یعنی ہر ثناء اسی کی طرف لوٹتی ہے۔\n\n[تہجد گزار: اس کے علم کی مقدار کیا ہے؟]\n\nجہاں تک علم تہجد کی مقدار کا تعلق ہے، تو وہ قدر و منزلت میں بہت عزیز ہے۔ اور یہ اس لیے کہ چونکہ اس کے لیے کوئی اسم الٰہی نہیں ہے جس سے وہ مستند ہو، جیسا کہ دیگر آثار کے لیے ہوتا ہے، لہٰذا اسے اجمالی طور پر معلوم ہوا کہ وہاں ایک ایسا امر ہے جو اصحابِ آثار اور آثار سے غائب ہے۔\n\nپس اس نے اس امر کو تلاش کیا کہ وہ کیا ہے؟ تو اس کی نظر نے اسے اس طرف رہنمائی کی کہ وہ اسماء الٰہیہ (الأسماء الإلهية) کے بارے میں کشف (الکشف) کرے کہ آیا ان کے اعیان ہیں یا وہ صرف نسبتیں ہیں، تاکہ وہ دیکھے کہ آثار کی واپسی کسی وجودی امر کی طرف ہے یا عدمی امر کی طرف؟ جب اس نے غور کیا تو دیکھا کہ اسماء موجود اعیان نہیں ہیں، بلکہ وہ صرف نسبتیں ہیں۔ پس اس نے دیکھا کہ آثار کا مستند ایک عدمی امر کی طرف ہے۔\n\nچنانچہ تہجد گزار نے کہا کہ معاملہ کی انتہا یہ ہے کہ میری واپسی ایک عدمی امر کی طرف ہو۔ پس اس نے اس میں گہرا غور کیا اور خود کو قیام اور نیند سے پیدا شدہ پایا۔ اس نے نیند کو نفس کا اپنی ذات کی طرف لوٹنا اور جو وہ طلب کرتا ہے، پایا۔ اور قیام کو اللہ کا حق پایا جو اس پر واجب ہے۔\n\nجب اس کی ذات ان دو امور سے مرکب تھی، تو اس نے ذات حق (الحق) کی طرف سے ذات حق (الحق) کے اعتبار سے دیکھا، تو اس پر یہ بات منکشف ہوئی کہ اگر ذات حق (الحق) اپنی ذات کے ساتھ اپنی ذات کے لیے منفرد ہو، تو عالم کا وجود نہ ہو، اور جب وہ عالم کی طرف متوجہ ہوتا ہے، تو اس توجہ کے سبب عالم کا عین ظاہر ہوتا ہے۔ پس اس نے دیکھا کہ سارا عالم اسی مختلف نسبتوں والی توجہ سے موجود ہے۔\n\nاور تہجد گزار نے اپنی ذات کو حق کے اپنے نفس کی طرف نظر کرنے سے مرکب پایا، عالم کو چھوڑ کر (جو سونے والے کی نیند کی حالت ہے)، اور اس کے عالم کی طرف نظر کرنے سے مرکب پایا (جو اس پر حق کا حق ادا کرنے کے لیے قیام کی حالت ہے)۔ پس اسے معلوم ہوا کہ اس کے عین کے وجود کا سبب اشرف ترین اسباب ہے، کیونکہ وہ ایک پہلو سے ذات سے مستند ہے، ان اسماء کی نسبتوں سے معریٰ ہو کر جو عالم کو اس کی طرف طلب کرتی ہیں۔ پس اسے یقین ہو گیا کہ اس کا وجود عظیم ترین ہستی (الوجود) ہے اور اس کا علم بلند ترین علوم ہے۔ اور اسے اپنا مطلوب حاصل ہو گیا، جو اس کا مقصد تھا۔ اور اس کا سبب اس کا انکسار اور فقر تھا۔ پس اس نے اپنی حاجت روائی کے بارے میں یہ اشعار کہے:\n\n> رب ليل بتة ما أتى *** فجره حتى انقضى وطري‏\n> من مقام كنت أعشقه *** بحديث طيب الخبر\n\n> کتنی ہی راتیں میں نے گزاریں کہ\n> فجر نہ آئی جب تک میری حاجت پوری نہ ہو گئی\n> اس مقام سے جسے میں محبوب رکھتا تھا\n> ایک پاکیزہ خبر والی حدیث کے ساتھ۔\n\nاور اسماء کے بارے میں کہا:\n\n> لم أجد للاسم مدلولا *** غير من قد كان مفعولا\n> ثم أعطتنا حقيقته *** كونه للعقل معقولا\n> فتلفظنا به أدبا *** واعتقدنا الأمر مجهولا\n\n> میں نے اسم کے لیے کوئی مدلول نہ پایا\n> سوائے اس کے جو مفعول (جس پر فعل کیا گیا) تھا۔\n> پھر اس کی حقیقت نے ہمیں عطا کیا\n> کہ وہ عقل کے لیے معقول ہے۔\n> پس ہم نے اسے ادب سے ادا کیا\n> اور امر کو مجہول (نامعلوم) اعتقاد کیا۔\n\nاور اس کے علم کی مقدار علوم میں اس کے معلوم (ذات) کی مقدار ہے جو معلومات میں ہے۔ پس علم تہجد سے تمام اسماء کا علم متعلق ہوتا ہے، اور ان میں سب سے زیادہ حقدار اسم القیوم (الاسم القيوم) ہے، جسے نہ اونگھ آتی ہے نہ نیند، اور وہ بندہ مناجات کی حالت میں ہوتا ہے۔ پس وہ اسماء کو تفصیل سے جانتا ہے، یعنی ہر اسم جو آیا، اس نے جانا کہ وہ وجودی اور غیر وجودی اسرار میں سے کیا کچھ اپنے اندر رکھتا ہے، اس اسم کی حقیقت کے تقاضے کے مطابق۔\n\nاور جو علوم اس حالت سے متعلق ہیں، ان میں علم برزخ (البرزخ)، صور میں ظہور الٰہی (التجلی) کا علم، جنت کے بازار کا علم، اور تعبیر رؤیا کا علم شامل ہے۔ یہ رؤیا خود اس شخص کی طرف سے نہیں ہوتی جو اسے دیکھتا ہے، بلکہ یہ اس کی طرف سے ہوتی ہے جس کے لیے وہ دیکھی جاتی ہے۔ دیکھنے والا خود بھی ہو سکتا ہے جس نے اپنے لیے دیکھا، اور کوئی دوسرا بھی اس کے لیے دیکھ سکتا ہے۔ اور اس کی تعبیر کرنے والا وہ ہے جسے نبوت کا ایک جز حاصل ہوتا ہے، کیونکہ وہ جانتا ہے کہ اس صورت سے کیا مراد ہے اور اس مقام کا صاحب کون ہے۔\n\n[تہجد گزار: مقام محمود میں اس کا حصہ]\n\nجان لیجیے کہ تہجد گزار کے لیے جو مقام محمود (المقام المحمود) ہے، اس کے صاحب کے لیے ایک مخصوص دعا ہوتی ہے، اور وہ اللہ تعالیٰ کا اپنے نبی صلی اللہ علیہ وسلم کو حکم دینا ہے کہ وہ کہیں:\n**وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ** (اور کہو: اے میرے رب! مجھے سچائی کے داخلے سے داخل کر)۔\nیعنی اس مقام کے لیے، کیونکہ یہ محمد صلی اللہ علیہ وسلم کا خاص موقف ہے، جہاں وہ اللہ کی ایسی تعریفیں کرتے ہیں جو وہ اس مقام میں داخل ہونے سے پہلے نہیں جانتے۔\n**وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ** (اور مجھے سچائی کے اخراج سے نکال)۔\nیعنی جب وہ اس سے کسی دوسرے مقام یا موقف کی طرف منتقل ہوں، تو ان کے نکلنے میں بھی ان کے ساتھ وہی عنایت ہو جو ان کے داخل ہونے میں تھی۔\n**وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا** (اور میرے لیے اپنی طرف سے ایک مددگار غلبہ عطا فرما)۔\nیہ اس لیے ہے کہ اس مقام میں جھگڑنے والے موجود ہوتے ہیں۔ کیونکہ شریف مقام کا صاحب ہمیشہ حسد کا شکار رہتا ہے۔ اور چونکہ نفوس اس تک نہیں پہنچ پاتے، اس لیے وہ واپس لوٹ کر اس میں عیب نکالنے کا کوئی پہلو تلاش کرتے ہیں تاکہ ان کی اپنی حالت کی تعظیم ہو اور اس شریف مقام کی وجہ سے ان کی طرف نقص منسوب نہ ہو۔ پس اس مقام کے صاحب نے نصرت طلب کی اس حجت کے ذریعے جو اس مرتبے کے شرف کا انکار کرنے والوں پر غلبہ (سلطان) ہے۔\n**وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا** (اور کہو: حق آ گیا اور باطل مٹ گیا، بیشک باطل مٹنے والا ہی تھا)۔\n... اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب هجدهم» در معرفت علم متهجدین\n\nو آنچه از مسائل به آن مربوط می‌شود، و مقدار آن در مراتب علوم، و آنچه از آن علوم در هستی (الوجود) ظاهر می‌گردد.\n\nعلم تهجد، علم غیب است که او را\nدر منزل عین (مشاهده)، نه احساسی است و نه نظری.\nهمانا تنزل (نزول الهی) آن را به او می‌بخشد، و او را\nدر عینش دیوارهایی است که صورت‌ها بر آن بالا می‌روند.\nپس اگر خالقش او را به معراج فراخواند،\nدر میان نشانه‌های بلندی، دیوارهایی برایش آشکار می‌شود.\nپس هر منزلتی، منزلتی دیگر به او می‌بخشد،\nآنگاه که بیداری بر پلک‌هایش حاکم شود.\nاین حال او در شب است، تا زمانی که نخوابد،\nیا دیده‌اش در آفاق، سپیده‌دم را درنیابد.\nشکوفه‌های گل، بویی به تو نمی‌دهند،\nمگر آنکه سحرگاه با نسیم ملایم سخاوت کند.\nهمانا پادشاهان، هرچند مناصبشان بزرگ باشد،\nبا مردم عادی (سوقه) رازها و شب‌نشینی‌ها دارند.\n\n### [متهجد: او کیست؟ چه بهره‌ای از اسماء الهی دارد؟]\n\nبدان، خداوند تو را تأیید کند، که متهجدین اسم الهی خاصی ندارند که تهجد را به آنان ببخشد و ایشان را در آن استوار سازد، برخلاف کسی که تمام شب را به قیام می‌گذراند؛ زیرا قائم‌اللیل (کسی که تمام شب را بیدار است) اسم الهی دارد که او را به آن فرا می‌خواند و به حرکت درمی‌آورد. تهجد عبارت است از کسی که برمی‌خیزد و می‌خوابد، و برمی‌خیزد و می‌خوابد، و برمی‌خیزد. پس کسی که شب را این‌گونه در مناجات پروردگارش سپری نکند، متهجد نیست. خداوند متعال می‌فرماید: «وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ» (و پاره‌ای از شب را با آن [قرآن] به تهجد بپرداز، که این نافله‌ای برای توست) و می‌فرماید: «إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَى مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ» (همانا پروردگارت می‌داند که تو نزدیک به دو سوم شب و نصف آن و یک سوم آن را به قیام می‌پردازی).\n\n### [متهجد: پشتوانه او از اسماء الهی چیست؟]\n\nو او (متهجد) علمی خاص از جانب حق (الحق) دارد. با این حال، چون برای این حالت (تهجد) در اسماء الهی (الأسماء الإلهية) پشتوانه‌ای نیافتیم و نزدیک‌ترین نسبت به آن را جز اسم حق (الحق) ندیدیم، پس به اسم حق (الحق) استناد کرد و این اسم آن را پذیرفت. بنابراین، هر علمی که متهجد به دست می‌آورد، تنها از اسم حق (الحق) است.\n\nزیرا پیامبر (صلی الله علیه و آله و سلم) به کسی که تمام سال را روزه می‌گرفت و تمام شب را به قیام می‌گذراند، فرمود: «همانا نفس تو بر تو حقی دارد، و چشمت بر تو حقی دارد؛ پس روزه بگیر و افطار کن، و به قیام برخیز و بخواب.»\n\nپس برای او میان قیام و خواب جمع کرد تا حق نفس را به خاطر چشم ادا کند، و حق نفس را از جانب خداوند ادا کند. و حقوق ادا نمی‌شوند مگر به واسطه اسم حق (الحق) و از آن، نه از غیر آن. به همین دلیل، متهجدین به این اسم استناد کرده‌اند.\n\n### [متهجد: خصوصیت او چیست؟]\n\nسپس، برای متهجد امر دیگری است که هر کسی آن را نمی‌داند، و آن این است که ثمره مناجات تهجد را درو نمی‌کند و علوم آن را به دست نمی‌آورد، مگر کسی که نماز شب برای او نافله باشد. اما کسی که نماز فریضه‌اش ناقص است، آن نقص از نوافلش کامل می‌شود. پس اگر فرائض، نوافل بنده متهجد را در خود مستغرق سازند، دیگر برای او نافله‌ای باقی نمی‌ماند و او نه متهجد است و نه صاحب نافله. بنابراین، این شخص به حال نوافل، علوم آن و تجلیات (التجلی) آن دست نمی‌یابد. این را بدان.\n\n### [متهجد: در خواب و قیامش]\n\nپس خواب متهجد برای حق چشم اوست و قیامش برای حق پروردگارش. بنابراین، آنچه حق (الحق) از علم و تجلی (التجلی) در خوابش به او می‌بخشد، ثمره قیام اوست؛ و آنچه از نشاط و قوت و تجلی (التجلی) و علوم آن دو در قیامش به او می‌دهد، ثمره خواب اوست. و همین‌گونه است تمام اعمال بنده که بر او واجب شده است. پس علوم متهجدین مانند درهم تنیدن گیسو در هم می‌آمیزد، و این از علوم مورد عشق نفوس است، زیرا این‌گونه در هم می‌پیچد و از این درهم‌پیچیدگی، اسرار عالم بالا و پایین و اسماء دال بر افعال و تنزیه آشکار می‌شود. و این همان قول خداوند متعال است: «وَالْتَفَّتِ السَّاقُ بِالسَّاقِ» (و ساق به ساق در پیچد) یعنی امر دنیا با امر آخرت جمع شود، و در آنجا جز دنیا و آخرت نیست. و این همان مقام محمود است که تهجد آن را به بار می‌آورد. خداوند متعال می‌فرماید: «وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا» (و پاره‌ای از شب را با آن [قرآن] به تهجد بپرداز، که این نافله‌ای برای توست، باشد که پروردگارت تو را به مقام محمود برانگیزد). و «عسی» (باشد که) از جانب خداوند واجب است. و مقام محمود، مقامی است که عواقب ستایش از آن اوست، یعنی هر ستایشی به او باز می‌گردد.\n\n### [متهجد: مقدار علم او چقدر است؟]\n\nاما مقدار علم تهجد، بسیار گرانقدر است. و این بدان سبب است که چون اسم الهی‌ای نداشت که مانند سایر آثار به آن استناد کند، به طور کلی دانست که در آنجا امری وجود دارد که از صاحبان آثار و خود آثار پنهان مانده است.\n\nپس در جستجوی آن امر برآمد. نظر او را به این سمت هدایت کرد که کشف کند آیا اسماء الهی (الأسماء الإلهية) دارای اعیان (حقایق خارجی) هستند یا نسبت‌هایی بیش نیستند، تا ببیند بازگشت آثار به امری وجودی است یا عدمی. چون نظر کرد، دید که اسماء، اعیان موجود نیستند، بلکه نسبت‌هایی هستند. پس پشتوانه آثار را امری عدمی یافت. متهجد گفت: نهایت امر این است که بازگشت من به امری عدمی باشد. پس در آن تعمق کرد و خود را مولود قیام و خواب دید. خواب را بازگشت نفس به ذات خود و آنچه می‌طلبد دید، و قیام را حق خداوند بر خود دید. چون ذات او از این دو امر مرکب بود، به حق (الحق) از حیث ذات حق (الحق) نظر کرد. برای او آشکار شد که اگر حق (الحق) به ذات خود برای ذات خود منفرد باشد، عالَمی وجود نخواهد داشت؛ و اگر به عالَم توجه کند، عین عالَم به واسطه آن توجه ظاهر می‌شود. پس دید که تمام عالَم از آن توجهِ دارای نسبت‌های مختلف موجود شده است. و متهجد ذات خود را مرکب از نظر حق (الحق) به نفس خود بدون عالَم (که همان حالت خواب برای خفته است) و از نظر او به عالَم (که همان حالت قیام برای ادای حق حق (الحق) بر اوست) دید. پس دانست که سبب وجود عین او شریف‌ترین اسباب است، زیرا از یک جهت به ذات (الهی) استناد کرده که از نسبت‌های اسماء که عالَم را به سوی او می‌طلبند، عاری است. پس محقق شد که وجود او بزرگ‌ترین هستی (الوجود) و علم او والاترین علوم است، و مطلوبش که غرض او بود، حاصل شد. و سبب این امر، شکستگی و فقر او بود. پس در برآورده شدن حاجت خود از آن مقام، چنین متمثل شد:\n\nچه بسا شبی که سپیده‌اش نیامد،\nتا آنکه حاجتم برآورده شد.\nاز مقامی که عاشق آن بودم،\nبا حدیثی خوش‌خبر.\n\nو در مورد اسماء گفت:\nبرای اسم، مدلولی نیافتم،\nجز آنکه مفعول (اثر) بوده است.\nسپس حقیقت آن به ما بخشید،\nکه برای عقل، معقول باشد.\nپس از روی ادب آن را بر زبان آوردیم،\nو امر (حقیقت) را مجهول دانستیم.\n\nو مقدار علم او در میان علوم، به اندازه معلوم اوست که همان ذات (الهی) در میان معلومات است. پس علم تهجد به علم تمام اسماء الهی تعلق می‌گیرد، و سزاوارترین اسم برای او، اسم قیوم است که «لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ» (نه چرت او را می‌گیرد و نه خواب)، و این همان بنده در حال مناجاتش است. پس اسماء را به تفصیل می‌داند، یعنی هر اسمی که آمد، علم به اسرار وجودی و غیروجودی آن را بر اساس آنچه حقیقت آن اسم می‌بخشد، می‌داند. و از جمله علومی که به این حالت مربوط می‌شود، علم برزخ، علم تجلی الهی (التجلی الإلهي) در صورت‌ها، علم بازار بهشت، و علم تعبیر رؤیاست؛ نه خود رؤیا از جهت کسی که آن را می‌بیند، بلکه از جانب کسی که رؤیا برای او دیده می‌شود. چه بسا بیننده، همان کسی باشد که رؤیا را برای خود دیده است، و چه بسا دیگری آن را برای او ببیند. و تعبیرکننده آن کسی است که بهره‌ای از اجزای نبوت دارد، زیرا می‌داند که مقصود از آن صورت چیست و صاحب آن مقام کیست.\n\n### [متهجد: بهره او از مقام محمود]\n\nو بدان که مقام محمود که برای متهجد است، برای صاحبش دعای معینی دارد، و آن قول خداوند متعال به پیامبرش (صلی الله علیه و آله و سلم) است که او را به آن امر می‌کند: «وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ» (و بگو: پروردگارا، مرا با ورودی صدق وارد کن) یعنی به این مقام (محمود)، زیرا آن موقفی خاص محمد است که در آن خداوند را با ستایش‌هایی می‌ستاید که جز هنگامی که وارد آن مقام شود، نمی‌شناسد. و «وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ» (و مرا با خروجی صدق خارج ساز) یعنی اگر از آن به سوی مقامات و مواقف دیگر منتقل شد، عنایت الهی در خروجش همراه او باشد، همان‌گونه که در ورودش همراه او بود. و «وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا» (و از جانب خود برای من سلطانی یاری‌دهنده قرار ده) به خاطر کسانی که در آن منازعه می‌کنند؛ زیرا صاحب مقام شریف همواره مورد حسادت است. و چون نفوس به آن نمی‌رسند، باز می‌گردند و وجهی از وجوه قدح در آن را می‌جویند تا حال خود را که بر آن هستند، بزرگ شمارند و نقص از جانب این مقام شریف به ایشان نسبت داده نشود. پس صاحب این مقام، یاری را با حجت که همان سلطان (برهان) است، بر منکران شرف این مرتبه طلب کرد. و «وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا» (و بگو: حق (الحق) آمد و باطل نابود شد؛ همانا باطل نابودشدنی است)... و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}