{
  "id": 455,
  "title": {
    "ar": "الباب الخامس والخمسون وأربعمائة في معرفة منازلة من أقبلت عليه بظاهري لا يسعد أبدا ومن أقبلت عليه بباطني لا يشقى أبدا وبالعكس",
    "en": "Chapter Four Hundred and Fifty-Five: Concerning the knowledge of the station of him upon whom I turn with My Outward Aspect (ظاهري), who shall never attain felicity; and him upon whom I turn with My Inward Aspect (باطني), who shall never attain wretchedness; and the reverse.",
    "ur": "باب نمبر چار سو پچپن: ان منازل (منازلة) کی معرفت کے بیان میں جن کی طرف میں اپنے ظاہری پہلو (ظاهري) سے متوجہ ہوا تو وہ کبھی سعادت مند نہیں ہو گا، اور جس کی طرف میں اپنے باطنی پہلو (باطني) سے متوجہ ہوا تو وہ کبھی شقاوت مند نہیں ہو گا، اور اس کے برعکس۔",
    "fa": "باب چهارصد و پنجاه و پنجم: در معرفت منزلت کسی که با ظاهر خود بر او روی آورم، هرگز سعادتمند نمی‌شود، و کسی که با باطن خود بر او روی آورم، هرگز شقاوتمند نمی‌شود، و بالعکس."
  },
  "content": {
    "ar": "## «الباب الخامس والخمسون وأربعمائة في معرفة منازلة من أقبلت عليه بظاهري لا يسعد أبدا ومن أقبلت عليه بباطني لا يشقى أبدا وبالعكس»\n\n\n> الحكم للقدر المعلوم والنسب *** أمر تحققته ما الحكم للسبب‏\n> هذا بلال وخباب وأين هما *** من العمومة فالأحكام للنسب‏\n\n\n> فالله يجعلنا من ذا على حذر *** في غير جهد ولا كد ولا نصب‏\n\n\n> لو لا الشريعة عند العارفين بها *** ما كنت من يتقي مصارع النوب‏\n\n\n> يا رحمة سبقت يا رحمة شملت *** وما هما بمحل الخسر والعطب‏\n\n\n### [العذاب عذابان نفسي وهو الباطن وحسي وهو الظاهر]\n\n\nقال الله تعالى هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ تنبيها أنه الوجود كله فإن هذا تقسيمه فليس إلا هو والنعيم نعيمان نفسي وهو الباطن وحسي وهو الظاهر في النفس الحساسة والعذاب عذابان نفسي وهو الباطن وحسي وهو الظاهر والحال حالان حال سابق وهو الأول وحال لاحق وهو الآخر وما ثم إلا رحمة سابقة وغضب لاحق ثم رحمة شاملة سارية في الكل فهي لاحقة سابقة فيغضب ويرضى فيعذب رحمة لغضبه ليزول الغضب فانظر ما أحكم تعذيبه كيف أدرج الرحمة فيه لازالة الغضب حتى يزول حكمه فتشمل الرحمة بنفسها فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ فبرحمته عذب من عذب لأنه لو لا العذاب لتسرمد يكون الغضب وهو أشد على المغضوب من العذاب الواقع به لمن عقل ما أقول وإذا كان الأمر كما قررناه وهو كما ذكرناه فقد في الإقبال الظاهر سعادة ليسعد به المقبول عليه وقد يكون في الإقبال الظاهر شقاوة ليشقى به المقبول عليه وقد يكون في الإقبال الباطن مثل ما ذكرناه في الإقبال الظاهر والمقبول عليه غيب وشهادة وروح وصورة وحيوان وناطق فلا بد من النفس والحس أن ينفعلا لهذه الإقبالات وأحكام النسب بها يظهر حكم الحاكم في المحكوم عليه وقد ذكر الله أن الهوية العائدة عليه هي عين هذا الذي ذكرناه فلم يقع تصرف منه إلا فيه نبه على ذلك بقاتل نفسه وأن الجنة محرمة عليه فلا حجاب عليه فإنه ظاهر له لا يتمكن أن يستتر عنه هو وجعل ذلك مبادرة له لأنه ذكر أمرين من أول وآخر فقد يبادر الآخر فيكون له حكم الأولية ويكون للأول بالنسبة إلى هذا المبادر حكم الآخرية ولهذا جاءت العبارة التي‏\n\n\nذكرها الترجمان عن الله بادرني عبدي بنفسه حرمت عليه الجنة\n\n\nفلا يستره شي‏ء بعد هذا الكشف لأنه يعلم من سبق ومن لحق كما يعلم من خَلَقَ وهُوَ اللَّطِيفُ فلا يظهر الْخَبِيرُ لتحصيله العلم ذوقا الذي كسبه المعلوم فإن المعلوم متقدم بالرتبة على العلم وإن تساوقا في الذهن من كون المعلوم معلوما لا من كونه وجودا أو عدما فإنه المعطي العالم العلم فلا بد في الكون من سعادة وشقاء ولو ببرد الهواء وحره فما زاد فما يلائم المزاج كان سعادة وما لا يلائمه كان شقاء ثم تمشي بهذا الحكم على الغرض والكمال والشريعة وتحكم في ذلك كله حكمك بالملاءمة وعدمها فافهم فإني أريد الاختصار والتنبيه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "The judgment belongs to the known destiny (القدر المعلوم) and the relationships (النسب), / A matter I have verified; the judgment does not belong to the cause (السبب).\nHere are Bilal and Khabbab, and where are they / Compared to the paternal uncles? Thus, the rulings are for the relationship.\n\nMay Allah make us wary of this, / Without effort, nor toil, nor fatigue.\n\nWere it not for the Law (الشريعة) among those who possess Gnosis (العارفين), / I would not be among those who guard against the pitfalls of calamities.\n\nO Mercy that preceded! O Mercy that encompassed! / And neither of them is a place of loss or ruin.\n\n[Torment (العذاب) is two kinds: psychic (نفسي), which is the inward (الباطن), and sensory (حسي), which is the outward (الظاهر)]\n\nAllah the Exalted said: <<هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ>> (He is the First, the Last, the Outward, and the Inward), alerting us that He is the entirety of Existence (الوجود), for this is His division, and there is nothing but Him. And bliss (النعيم) is two kinds: psychic (نفسي), which is the inward (الباطن), and sensory (حسي), which is the outward (الظاهر) in the sensitive soul. And torment (العذاب) is two kinds: psychic, which is the inward, and sensory, which is the outward.\n\nAnd the state (الحال) is two kinds: a preceding state, which is the First (الأول), and a subsequent state, which is the Last (الآخر). And there is nothing there except a preceding Mercy (رحمة سابقة) and a subsequent Wrath (غضب لاحق). Then there is an encompassing Mercy (رحمة شاملة) flowing through the whole, which is both subsequent and preceding.\n\nSo He becomes wrathful and pleased. Thus, He torments out of mercy for His wrath, so that the wrath may cease. Look at how wise His tormenting is: how He incorporated Mercy into it for the removal of the Wrath, until its ruling ceases, and Mercy encompasses by itself. So, <<فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ>> (upon whom the word of torment is due), it is by His Mercy that He torments those He torments. This is because, were it not for the torment, the Wrath would be eternal, and that [eternal Wrath] is more severe upon the one subject to wrath than the actual torment inflicted upon him, for whoever understands what I am saying.\n\nAnd if the matter is as we have established it, and it is as we have mentioned, then in the outward turning (الإقبال الظاهر) there may be happiness (سعادة) by which the one turned toward is made happy, and there may be wretchedness (شقاوة) in the outward turning by which the one turned toward is made wretched. And there may be in the inward turning (الإقبال الباطن) the like of what we mentioned concerning the outward turning.\n\nAnd the one turned toward is Unseen (غيب) and Witnessed (شهادة), Spirit (روح) and Form (صورة), animal and rational. Thus, the soul (النفس) and the sense (الحس) must necessarily be affected by these turnings. And by the rulings of the relationships (النسب), the judgment of the Judge (الحاكم) upon the judged (المحكوم عليه) becomes manifest.\n\nAllah has mentioned that the Ipseity (الهوية) returning to Him is the very essence of what we have mentioned, and no disposition (تصرف) occurs from Him except within it. He alerted to this through the one who kills himself, and that Paradise is forbidden to him. Yet, there is no veil (حجاب) upon him, for He is manifest to him, and he cannot conceal himself from Him. And He made that a precedence (مبادرة) for him, because He mentioned two matters: the First (الأول) and the Last (الآخر). The Last may precede, and thus have the ruling of the Firstness, and the First, relative to this preceding one, may have the ruling of the Lastness. For this reason came the expression mentioned by the Interpreter (الترجمان) concerning Allah: \"My servant preceded Me with his soul, so I forbade Paradise to him.\"\n\nNothing conceals him after this Unveiling (الكشف), because He knows who preceded and who followed, just as He knows who created. And He is <<اللَّطِيفُ>> (The Subtle), so <<الْخَبِيرُ>> (The All-Aware) does not manifest for the acquisition of experiential Knowledge (العلم ذوقا) which the known object (المعلوم) earned. For the known object is prior in rank (الرتبة) to the Knowledge (العلم), even if they are simultaneous in the mind (الذهن) in terms of the known object being known, but not in terms of its being existence (وجود) or non-existence (عدم). For He is the Giver of Knowledge to the Knower.\n\nThus, there must necessarily be happiness (سعادة) and wretchedness (شقاء) in the Cosmos (الكون), even if only through the coldness and heat of the air. Whatever is excessive and suits the temperament (المزاج) is happiness, and whatever does not suit it is wretchedness. Then you proceed with this ruling concerning purpose, perfection (الكمال), and the Law (الشريعة), and you apply your judgment in all of that based on suitability and lack thereof. Understand this, for I intend brevity and alerting. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو پچپن: ان منازل کی معرفت کے بیان میں جن کی طرف میں اپنے ظاہر کے ساتھ متوجہ ہوتا ہوں وہ کبھی سعادت مند نہیں ہوتے، اور جن کی طرف میں اپنے باطن کے ساتھ متوجہ ہوتا ہوں وہ کبھی شقی نہیں ہوتے، اور اس کے برعکس بھی۔\n\nحکم تو قدر معلوم اور نسب کے لیے ہے\nیہ وہ امر ہے جسے میں نے متحقق کیا، حکم سبب کے لیے نہیں ہے\nیہ بلال اور خباب ہیں، اور وہ (قریش کے) چچاؤں کے مقابلے میں کہاں ہیں؟\nپس احکام نسب کے لیے ہیں\n\nپس اللہ ہمیں اس سے بچاؤ میں رکھے\nبغیر کسی کوشش، مشقت یا تھکاوٹ کے\n\nاگر عارفین کے نزدیک شریعت نہ ہوتی\nتو میں ان میں سے نہ ہوتا جو مصیبتوں کے ٹھکانوں سے بچتے ہیں\n\nاے وہ رحمت جو سبقت لے گئی، اے وہ رحمت جو محیط ہو گئی\nاور وہ دونوں (رحمتیں) خسارے اور ہلاکت کا مقام نہیں ہیں\n\n[عذاب دو طرح کے ہیں: نفسی (باطنی) اور حسی (ظاہری)]\n\nاللہ تعالیٰ نے فرمایا: \"هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ\" (وہی اول ہے اور آخر ہے اور ظاہر ہے اور باطن ہے)۔ یہ اس تنبیہ کے لیے ہے کہ وہ تمام الوجود (الوجود) ہے، کیونکہ یہ اس کی تقسیم ہے، پس اس کے سوا کوئی نہیں ہے۔ اور نعمت (النعيم) بھی دو طرح کی ہے: نفسی جو کہ باطن ہے، اور حسی جو کہ ظاہر ہے اور نفس حساسہ میں ظاہر ہوتی ہے۔ اور عذاب (العذاب) بھی دو طرح کا ہے: نفسی جو کہ باطن ہے، اور حسی جو کہ ظاہر ہے۔ اور حال بھی دو طرح کے ہیں: ایک حال سابق جو کہ الاول (الأول) ہے، اور ایک حال لاحق جو کہ الآخر (الآخر) ہے۔ اور وہاں صرف ایک رحمت سابقة (پہلے سے موجود رحمت) ہے اور ایک غضب لاحق (بعد میں آنے والا غضب)، پھر ایک رحمت شاملہ (محیط رحمت) ہے جو سب میں جاری و ساری ہے، پس وہ لاحق بھی ہے اور سابق بھی۔\n\nپس وہ غضب فرماتا ہے اور راضی ہوتا ہے، اور وہ اپنے غضب کی وجہ سے عذاب دیتا ہے تاکہ غضب زائل ہو جائے۔ پس دیکھو کہ اس کا عذاب دینا کتنا حکیمانہ ہے، اس نے کس طرح اس میں رحمت کو شامل کر دیا تاکہ غضب کو زائل کیا جا سکے، یہاں تک کہ اس کا حکم زائل ہو جائے اور رحمت خود ہی محیط ہو جائے۔ \"فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ\" (پس جس پر عذاب کا کلمہ ثابت ہو گیا)۔ پس اس نے اپنی رحمت کے سبب ہی عذاب دیا جسے عذاب دیا، کیونکہ اگر عذاب نہ ہوتا تو غضب ہمیشہ کے لیے باقی رہتا، اور یہ غضب اس عذاب سے زیادہ شدید ہے جو اس پر واقع ہوتا ہے، اس شخص کے لیے جو میری بات کو سمجھتا ہے۔\n\nاور جب معاملہ ایسا ہی ہے جیسا کہ ہم نے طے کیا ہے اور جیسا کہ ہم نے ذکر کیا ہے، تو بسا اوقات الإقبال الظاہر (ظاہری توجہ) میں سعادت ہوتی ہے تاکہ جس کی طرف توجہ کی گئی ہے وہ اس سے سعادت مند ہو جائے، اور بسا اوقات الإقبال الظاہر میں شقاوت (بدبختی) ہوتی ہے تاکہ جس کی طرف توجہ کی گئی ہے وہ اس سے شقی ہو جائے، اور بسا اوقات الإقبال الباطن (باطنی توجہ) میں بھی وہی ہوتا ہے جو ہم نے الإقبال الظاہر میں ذکر کیا۔ اور جس کی طرف توجہ کی گئی ہے وہ غیب (الغیب) اور شہود (الشہود)، روح (الروح) اور صورت، حیوان اور ناطق ہے۔ پس نفس اور حس کے لیے ضروری ہے کہ وہ ان توجہات سے متاثر ہوں، اور نسب (النسب) کے احکام کے ذریعے ہی حاکم کا حکم محکوم پر ظاہر ہوتا ہے۔\n\nاور اللہ نے ذکر کیا ہے کہ وہ ہویت (الہویۃ) جو اس کی طرف لوٹتی ہے، وہ بعینہٖ یہی ہے جو ہم نے ذکر کیا ہے۔ پس اس کی طرف سے کوئی تصرف واقع نہیں ہوتا مگر اسی میں۔ اس نے اس پر قاتل نفس (خود کو قتل کرنے والے) کے ذریعے تنبیہ کی ہے کہ جنت اس پر حرام ہے، پس اس پر کوئی حجاب نہیں ہے، کیونکہ وہ (حق) اس کے لیے ظاہر ہے، وہ اس سے چھپ نہیں سکتا۔ اور اس نے اسے اس کے لیے ایک پہل (مبادرت) بنا دیا، کیونکہ اس نے اول اور آخر کے دو امور کا ذکر کیا۔ پس بسا اوقات الآخر (الآخر) پہل کرتا ہے تو اس کے لیے الاولیۃ (الأولیۃ) کا حکم ہوتا ہے، اور الاول (الأول) کے لیے اس پہل کرنے والے کے مقابلے میں الآخریۃ (الآخریۃ) کا حکم ہوتا ہے۔ اور اسی لیے وہ عبارت آئی ہے جسے ترجمان نے اللہ کی طرف سے ذکر کیا: \"بادرني عبدي بنفسه حرمت عليه الجنة\" (میرے بندے نے اپنی جان کے ساتھ مجھ پر پہل کی، میں نے اس پر جنت حرام کر دی)۔\n\nاس کشف (الکشف) کے بعد کوئی چیز اسے نہیں چھپا سکتی، کیونکہ وہ جانتا ہے کہ کس نے سبقت کی اور کون پیچھے رہا، جیسا کہ وہ جانتا ہے جس نے تخلیق کی، \"وهُوَ اللَّطِيفُ الْخَبِيرُ\" (اور وہ لطیف ہے، باخبر ہے)۔ پس الخبیر (الخبیر) ظاہر نہیں ہوتا تاکہ وہ ذوقی علم حاصل کرے جسے معلوم (المعلوم) نے کمایا ہے، کیونکہ معلوم رتبے میں علم سے مقدم ہے، اگرچہ وہ ذہن میں معلوم ہونے کے اعتبار سے ہم آہنگ ہوں، نہ کہ وجود یا عدم ہونے کے اعتبار سے۔ پس وہی علم عطا کرنے والا عالم (العالم) ہے۔ لہٰذا کائنات میں سعادت اور شقاوت کا ہونا ضروری ہے، خواہ وہ ہوا کی ٹھنڈک اور گرمی ہی کی صورت میں کیوں نہ ہو۔ پس جو چیز مزاج کے موافق ہو وہ سعادت ہے، اور جو اس کے موافق نہ ہو وہ شقاوت ہے۔ پھر تم اسی حکم کو غرض، کمال اور شریعت پر جاری کرو، اور ان سب میں موافقت یا عدم موافقت کے ذریعے اپنا حکم لگاؤ۔ پس سمجھ لو، کیونکہ میں اختصار اور تنبیہ کا ارادہ رکھتا ہوں۔ \"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و پنجاه و پنجم در معرفت منازل کسانی که با ظاهر خود به ایشان روی آورده‌ام و هرگز سعادتمند نمی‌شوند، و کسانی که با باطن خود به ایشان روی آورده‌ام و هرگز شقاوتمند نمی‌شوند، و بالعکس.\n\nحکم از آنِ قَدَر معلوم و نَسَب است *** امری که آن را محقق ساختم، حکم از آنِ سبب نیست\nاین بلال و خباب هستند، و کجایند آن دو *** از عموزادگان؟ پس احکام از آنِ نَسَب است.\n\nپس خداوند ما را از این امر بر حذر دارد *** بدون هیچ کوشش، رنج و سختی.\n\nاگر شریعت نزد عارفان (العارفين) به آن نبود *** من از کسانی نبودم که از مصائب و بلاها دوری می‌جوید.\n\nای رحمتی که سبقت گرفتی، ای رحمتی که فراگیر شدی *** و آن دو (خسران و هلاکت) در جایگاه زیان و تباهی نیستند.\n\n[عذاب دو نوع است: نفسانی که باطن است و حسی که ظاهر است]\n\nخداوند متعال فرمود: هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ (اوست اول و آخر و ظاهر و باطن)؛ این تذکری است بر اینکه او تمام هستی (الوجود) است، زیرا این تقسیم‌بندی اوست و جز او چیزی نیست. و نعمت دو نوع است: نفسانی که باطن است و حسی که ظاهر است در نفس حساسه. و عذاب دو نوع است: نفسانی که باطن است و حسی که ظاهر است. و حال دو حال است: حال سابق که اول است و حال لاحق که آخر است. و در آنجا جز رحمت سابق و غضب لاحق نیست، سپس رحمتی فراگیر که در همه چیز جاری است؛ پس آن هم لاحق است و هم سابق. پس خشم می‌گیرد و راضی می‌شود، و عذاب می‌دهد به عنوان رحمتی برای غضبش تا غضب زائل شود. پس بنگر که عذاب دادنش چقدر حکیمانه است؛ چگونه رحمت را در آن گنجانده است تا غضب را از بین ببرد و حکمش زائل شود، و رحمت به خودی خود فراگیر گردد. پس فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ (پس هر کس که کلمه عذاب بر او محقق شد)، به واسطه رحمتش، کسی را که عذاب داد، عذاب داد؛ زیرا اگر عذاب نبود، غضب جاودانه می‌شد، و غضب بر مغضوب شدیدتر است از عذابی که بر او واقع می‌شود، برای کسی که سخن مرا درک کند. و چون امر چنان است که مقرر داشتیم و چنان است که ذکر کردیم، پس در روی آوردن (اقبال) ظاهر، سعادتی است تا مقبول‌علیه (کسی که به او روی آورده شده) به آن سعادتمند شود، و گاهی در روی آوردن ظاهر، شقاوتی است تا مقبول‌علیه به آن شقاوتمند شود. و گاهی در روی آوردن باطن نیز مانند آنچه در روی آوردن ظاهر ذکر کردیم، وجود دارد. و مقبول‌علیه، غیب و شهود، و روح و صورت، و حیوان و ناطق است. پس ناگزیر است که نفس و حس از این روی آوردن‌ها متأثر شوند. و به واسطه احکام نَسَب‌ها، حکم حاکم در محكوم‌علیه ظاهر می‌شود. و خداوند ذکر کرده است که هویت (الهوية) بازگشت‌کننده به او، عین همین چیزی است که ذکر کردیم. پس هیچ تصرفی از او واقع نشده مگر در آن. او به این امر با قاتل نفس خود هشدار داد و اینکه بهشت بر او حرام است، پس حجابی بر او نیست، زیرا او برایش ظاهر است و نمی‌تواند از او پنهان شود. و این را برای او مبادرت قرار داد، زیرا دو امر را ذکر کرد: اول و آخر. پس ممکن است آخر مبادرت کند و حکم اولیت را داشته باشد، و اول نسبت به این مبادرت‌کننده، حکم آخریت را داشته باشد. و به همین دلیل عبارتی که مترجم از جانب خداوند ذکر کرد، آمده است: «بنده‌ام با نفس خود بر من پیشی گرفت، بهشت را بر او حرام کردم.»\n\nپس هیچ چیز او را پس از این کشف (الکشف) نمی‌پوشاند، زیرا او می‌داند چه کسی سبقت گرفته و چه کسی عقب مانده است، همان‌طور که می‌داند چه کسی را خلق کرده است. و اوست اللَّطِيفُ (لطیف)، پس الْخَبِيرُ (خبیر) ظاهر نمی‌شود تا علم ذوقی را که معلوم کسب کرده است، به دست آورد. زیرا معلوم از نظر رتبه بر علم مقدم است، هرچند در ذهن از جهت معلوم بودن، نه از جهت وجود یا عدم بودن، با هم همراه باشند. پس اوست بخشنده علم به عالم. بنابراین در هستی (الکون) ناگزیر از سعادت و شقاوت هستیم، حتی با سردی و گرمی هوا. پس آنچه با مزاج سازگار باشد، سعادت است و آنچه سازگار نباشد، شقاوت است. سپس این حکم را بر غرض، کمال و شریعت جاری می‌کنی و در همه اینها حکم خود را بر اساس سازگاری و عدم سازگاری صادر می‌کنی. پس بفهم، زیرا من قصد اختصار و تذکر دارم. و خداوند يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}