{
  "id": 325,
  "title": {
    "ar": "الباب الخامس والعشرون وثلاثمائة في معرفة منزل القرآن من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Twenty-Five: Concerning the Gnosis (المعرفة) of the Station (المنزل) of the Qur'an within the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب تین سو پچیس: حضور محمدی سے قرآن کے مرتبہ کی معرفت کے بیان میں",
    "fa": "باب سیصد و بیست و پنجم در معرفت جایگاه قرآن از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الخامس والعشرون وثلاثمائة في معرفة منزل القرآن من الحضرة المحمدية»\n\n\n> الجمع معتبر في كل آونة *** والوتر في الجمع كالأعداد في الأحد\n\n\n> هذا الإله هو الأسماء أوترها *** تسع وتسعون لم تنقص ولم تزد\n\n\n> فالعين مجموع أسماء وليس لها *** وتر سوى ما ذكرناه من العدد\n\n\n> فليس ثم سوى فرد يعينه *** عين الكثير فلا تلوي على أحد\n\n\n> والله وتر فلا شي‏ء يكثره *** مع العلوم التي أعطاك في الرصد\n\n\n> فلا مؤثر غير الله في بشر *** والغير ما ثم فاقصد ساكن البلد\n\n\n> يعطيك خيرا بإحسان يجود به *** عليك فهو الذي إن شاء لم يجد\n\n\n### [أن كل ما سوى الله أرواح مطهرة منزهة]\n\n\nاعلم فهمك الله أن كل ما سوى الله أرواح مطهرة منزهة موجدها وخالقها وهي تنقسم إلى مكان وإلى متمكن والمكان‏\nينقسم إلى قسمين مكان يسمى سماء ومكان يسمى أرضا والمتمكن فيهما ينقسم إلى قسمين إلى متمكن فيه وإلى متمكن عليه فالمتمكن فيه يكون بحيث مكانه والمتمكن عليه لا يكون بحيث مكانه وهذا حصر كل ما سوى الله وكل ذلك أرواح في الحقيقة أجسام وجواهر في الحق المخلوق به وهذه الأرواح على مراتب في التنزيه تسمى مكانة وما من منزه لله تعالى إلا وتنزيهه على قدر مرتبته لأنه لا ينزه خالقه إلا من حيث هو إذ لا يعرف إلا نفسه فيثمر له ذلك التنزيه عند الله مكانة يتميز بها كل موجود عن غيره وهذا المنزل يحتوي على تنزيه الأرواح المتمكنة لا المكانية وسيرد منزل في هذه المنازل نذكر فيه تنزيه المكان والمتمكن معا فكان هذا المنزل يحتوي على نصف العالم من حيث ما هو منزه ثم إن الله تعالى عاد بالمكانة على هذا المنزه بأن كان الحق مجلاه فرأى نفسه ورتبته فسبح على قدر ما رأى فإذا هو نفسه لا غيره وذلك أن الحق أسدل بينه وبين عباده حجاب العزة فوقف التنزيه دونه فعلم إن الحق لا يليق به تنزيه خلقه وأن حجاب العزة أحمى وقهرها أغلب ثم رأى من سواه من العارفين بالله المنزهين بنعوت السلوب على مراتب وقد أقر الجميع منهم بأنهم كانوا غالطين في محل تنزيههم وأن تنزيههم ما خرج عنهم وذلك لحكمته التي سرت في خلقه فكان ذلك تنزيه الحكمة لا غيره ولو لا ستر حجاب العزة ما عرفوا ذلك ومن هذا الحجاب ظهر الكفر في العالم وصارت المعرفة خبرا بما وراء هذا الحجاب فظهر الايمان في العالم بين الستر والمؤمن فالكافر الذي هو الساتر أقرب من أجل الكفر فإن الستر يرى المستور به والمستور عنه وهو صفة الكافر والمؤمن دون هذا الستر فمقامه الحجاب قال تعالى وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ والايمان متعلقة الخبر والخبر من أقسام الكلام‏\n\n\n### [إن الله سبحانه أخرج أهل الستر من الغيب إلى الشهادة]\n\n\nثم إنه سبحانه أخرج أهل الستر من الغيب إلى الشهادة ليحصل له مقام الجمع بين الحالتين فينزهه باللسانين ويثبت له الصفتين ولم يكن في ظنه ما فعله الحق به بل كان يتخيل أن الغيب لا يكون في موطن شهادة لعلمه أن الغيب منيع الحمى لا يعلم ما فيه فيوصل إليه وإنما مقامه أن يكون مشعورا به من غير تعيين ما هو ذلك المشعور به وغفل عن كون الله يفعل ما يريد وإنه ما في حقه غيب وأن الغيب لا يصح أن يكون إلا إضافيا فلما بدا له من الله ما لم يكن في حسابه علم إن الأمور بيد الله وأنه ما ثم من يستحق حكما لنفسه بل هو الله الَّذِي أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ ولما علمت الأشياء أنه لا شي‏ء لها من ذاتها وإنها بحسب ما تقتضيه ذات موجدها وأن الأحوال تتجدد عليها بحسب ما تطلبه حقائق من استندت إليه وهو الله تعالى خافت حيث لم تقف على علم الله فيها في المستقبل فتركت جميع ما كانت تعتمد عليه في نفسها لما عند خالقها فسبحته تسبيحا جديدا من خلق جديد وعبرت من النظر إليها إلى النظر إلى من بيده ملكوت كل شي‏ء ولو لا هذا المقام الذي أقامها فيه وردها من قريب إليه لناداها من بعيد فكان المدى يطول عليها ويتعرض لها الآفات والصوارف في الطريق فإن المسافر وماله على قلة ثم إن الله لما حصل الأشياء في هذا المقام رفع لها علما من أعلام المعرفة أعطاها ذلك العلم إنها شق وإنها على النصف من الوجود وأن كمال الوجود بها ولولاها ما ظهر الكمال في الوجود والعلم فزهت وعظم شأنها عندها وما عرفت أي قسم صح لها من الوجود ثم ظهر ذلك لها في عبادة الصلاة حيث قسمها الحق نصفين بينه وبين عبده فزادت تيها فلما سمعت آخر الخبر موافقا لحالها الذي لم تشعر به في قوله فنصفها لي ولم يقيد وقال في نصف العبد ونصفها لعبدي ولعبدي ما سأل والسؤال مذلة وفقر وحاجة ومسكنة إلا أن العبد لاح له من خلف هذا الحجاب ما لم يكن يظنه وهو أنه في منزل يكون الحق متأخرا عنه مثل قوله والله من وَرائِهِمْ مُحِيطٌ وذلك لأنه في حكم الفرار إذا استقبله ما لا يطيق حمله فأخبره الله أنه من ورائه وهو الذي يستقبله فإن فر منه فإليه يفر من حيث لا يشعر كما يكون في منزل آخر أو لا له من قوله ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها وقد وصف نفسه بأنه الهادي والهادي هو الذي يكون إمام القوم ليريهم الطريق وهو قوله إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ ما كُنْتَ تَدْرِي ما الْكِتابُ ولا الْإِيمانُ فصارت الأشياء مع الحق عقبة فتقدم تعالى الأشياء ليهديها إلى ما فيه سعادتها وتأخر عنها ليحفظها ممن يغتالها وهو العدم فإن العدم\n\n\nيطلبها كما يطلبها الوجود وهي محل قابل للحكمين ليس في قوتها الامتناع إلا بلطف اللطيف ثم إن الله تعالى لما أطلعها على هذا حصل لها من العلم بجلال الله أسماء تسبحه بها وتحمده وتثني عليه بها لم تكن تعلم ذلك قبل هذا المشهد كما قال صَلَّى اللهُ عَليهِ وسَلَّم في المقام المحمود يوم القيامة فأحمده بمحامد لا أعلمها\nالآن يعطيه إياها ذلك المقام بالحصول فيه إلها ما يلهمه الله فيثني عليه بها وهكذا كل منزلة ومرتبة في العالم دنيا وآخرة إلى ما لا يتناهى له ثناء خاص في كل منزل منها فإذا سبحه ورثه ذلك الثناء علما آخر لم يكن عنده من علم الأذن الإلهي الذي خلق الله منه بيد عيسى الطير ومنه نفخ عيسى فيه فكان طيرا ومنه أبرأ الأكمه والأبرص وأحيا الموتى وهو علم شريف تحقق به أبو يزيد البسطامي وذو النون المصري فأما أبو يزيد فقتل نملة بغير قصد فلما علم بها نفخ فيها فقامت حية بإذن الله وأما ذو النون فجاءته العجوز التي أخذ التمساح ولدها فذهب به في النيل فدعا بالتمساح فألقاه إليها من جوفه حيا كما ألقى الحوت يونس فإذا كشف له عن هذا العلم أثنى عليه سبحانه بما ينبغي له من المحامد التي يطلبها هذا المقام ومن هنا يكون له الاستشراف على من خرج عن هذا المقام فيعلم حال الخارجين لأن هذا المنزل هو المنزل الجامع ولهذا سمي منزل القرآن فإذا نزل صاحب هذا المنزل من هذا المقام إلى الكون تعرض له العدو بأجناده وهو إبليس المعادي له بالطبع ولا سيما للبنين فإنه منافر من جميع الوجوه بخلاف معاداته لآدم فإنه جمع بينه وبين آدم اليبس فإن بين التراب والنار جامعا ولذلك الجامع صدقه لما أقسم له بالله أنه لنا صح وما صدقه الأبناء فإنه للأبناء ضد من جميع الوجوه وهو قوله في الأبناء أنه خلقهم من ماء وهو منافر للنار فكانت عداوة الأبناء أشد من عداوة الأب له وجعل الله هذا العدو محجوبا عن إدراك الأبصار وجعل له علامات في القلب من طريق الشرع يعرفه بها تقوم له مقام إدراك البصر فيتحفظ بتلك العلامات من إلقائه وأعان الله هذا الإنسان عليه بالملك الذي جعله مقابلا له غيبا لغيب فمهما لم يؤثر في ظاهر الإنسان وظهر عليه الملك بمساعدة النفس كان أجران للنفس أجرها وأجر المعين وهو الملك لأن الملك لا يقبل الجزاء ولا يزيد مقامه ولا ينقص وإن أثر في ظاهر الإنسان فإن الملك يغتم لذلك ويستغفر لهذا الإنسان وهو أعني الملك ليس بمحل لجزاء الغم فيعود ذلك الجزاء على الإنسان فهو في الحالتين رابح في الطاعة والمعصية والايمان يشد من الملك ولهذا يستغفر له الملك‏\n\n\n### [أن القرآن جامعا تجاذبته جميع الحقائق الإلهية فمنزلته الاعتدال‏]\n\n\nواعلم أن القرآن لما كان جامعا تجاذبته جميع الحقائق الإلهية والكونية على السواء فلم يكن فيه عوج ولا تحريف فمنزلته الاعتدال والاعتدال منزل حفظ بقاء الوجود على الموجود ما هو منزل الإيجاد لأن الإيجاد لا يكون إلا عن انحراف وميل ويسمى في حق الحق توجها إراديا وهو قوله إِذا أَرَدْناهُ ولما كان منزله الاعتدال كان له الديمومة والبقاء فله إبقاء التكوين وبقاء الكون فلو نزل عن منزله لنزل من الاعتدال إلى الانحراف وهو قوله ولَوْ أَنَّ قُرْآناً سُيِّرَتْ به الْجِبالُ وقوله لَوْ أَنْزَلْنا هذَا الْقُرْآنَ يعني عن منزله عَلى‏ جَبَلٍ لَرَأَيْتَهُ خاشِعاً مُتَصَدِّعاً يعني الجبل فلم يحفظ عليه صورته لأنه نزل عن منزله ولما كان هذا منزله وتجاذبته الحقائق على سواء كان من به أنزل عليه رَحْمَةً لِلْعالَمِينَ لأن الرحمة وَسِعَتْ كُلَّ شَيْ‏ءٍ فطلبها كل شي‏ء طلبا ذاتيا\n\n\nلما دعا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في القنوت على من دعا عليه عوتب في ذلك فقيل له وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ‏\n\n\nأي لترحمهم لأنك صاحب القرآن والقرآن ينطق بأني ما أرسلتك إلا رحمة وإنه ينطق بأن رَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ فهي بين منة ووجوب فمن عبادي من تسعهم بحكم الوجوب ومنهم من تسعهم بحكم المنة والأصل المنة والفضل والإنعام الإلهي إذ لم يكن الكون فيكون له استحقاق فما كان ظهوره إلا من عين المنة وكذلك الأمر الذي به استحق الرحمة كان من عين المنة فإذا نزل القرآن عن منزله فإنه كلامه وكلامه على نسبة واحدة لما يقبله الكلام من التقسيم فإنه ينزله وفيه حقيقة الاعتدال في النسب وهو جديد عند كل تال أبدا فلا يقبل نزوله إلا مناسبا له في الاعتدال فهو معرى عن الهوى ولهذا قيل في محمد صَلَّى اللهُ عَليهِ وسَلَّم وما يَنْطِقُ عَنِ الْهَوى‏ ونهى غيره من الرسل الخلفاء أن يتبع الهوى فلم ينزل في المرتبة منزلة من أخبر عنه أنه لا ينطق عن الهوى وما كل نال يحس بنزوله لشغل روحه بطبيعته فينزل عليه من خلف حجاب الطبع فلا يؤثر فيه التذاذا وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم في حق قوم من التالين إنهم يقرءون القرآن لا يجاوز حناجرهم‏\n\n\nفهذا قرآن منزل على الألسنة لا على الأفئدة وقال في الذوق نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ فذلك هو الذي يجد لنزوله عليه حلاوة لا يقدر قدرها تفوق كل لذة فإذا وجدها فذلك الذي نزل عليه القرآن الجديد الذي لا يبلى والفارق بين النزولين أن الذي ينزل القرآن على قلبه ينزل بالفهم فيعرف ما يقرأ وإن كان بغير لسانه ويعرف معاني ما يقرأ وإن كانت تلك الألفاظ لا يعرف معانيها في غير القرآن لأنها ليست بلغته‏\nويعرفها في تلاوته إذا كان ممن ينزل القرآن على قلبه عند التلاوة وإذا كان مقام القرآن ومنزله ما ذكرناه وجد كل موجود فيه ما يريد ولذلك كان يقول الشيخ أبو مدين لا يكون المريد مريدا حتى يجد في القرآن كل ما يريد وكل كلام لا يكون له هذا العموم فليس بقرآن ولما كان نزوله على القلب وهو صفة إلهية لا تفارق موصوفها لم يتمكن أن ينزل به غير من هو كلامه فذكر الحق أنه وسعه قلب عبده المؤمن فنزول القرآن في قلب المؤمن هو نزول الحق فيه فيكلم الحق هذا العبد من سره في سره وهو قولهم حدثني قلبي عن ربي من غير واسطة فالتالي إنما سمي تاليا لتتابع الكلام بعضه بعضا وتتابعه يقضي عليه بحر في الغاية وهما من والى فينزل من كذا إلى كذا ولما كان القلب من العالم الأعلى وكان اللسان من العالم الأنزل وكان الحق منزله قلب العبد وهو المتكلم وهو في القلب واحد العين والحروف من عالم اللسان ففصل اللسان الآيات وتلا بعضها بعضا فيسمى الإنسان تاليا من حيث لسانه فإنه المفصل لما أنزل مجملا والقرآن من الكتب والصحف المنزلة بمنزلة الإنسان من العالم فإنه مجموع الكتب والإنسان مجموع العالم فهما إخوان وأعني بذلك الإنسان الكامل وليس ذلك إلا من أنزل عليه القرآن من جميع جهاته ونسبه وما سواه من ورثته إنما أنزل عليه من بين كتفيه فاستقر في صدره عن ظهر غيب وهي الوراثة الكاملة حكي عن أبي يزيد أنه ما مات حتى استظهر القرآن وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الذي أوتي القرآن إن النبوة أدرجت بين جنبيه‏\n\n\nوهذا الفرق بين الأنبياء والأولياء الأتباع لكن من أدرجت النبوة بين جنبيه وجاءه القرآن عن ظهر غيب أعطى الرؤية من خلفه كما أعطيها من أمامه إذ كان القرآن لا ينزل إلا مواجهة فهو للنبي صَلَّى اللهُ عَليهِ وسَلَّم من وجهين وجه معتاد ووجه غير معتاد وهو للوارث من وجه غير معتاد فسمي ظهرا بحكم الأصل وهو وجه بحكم الفرع ولما ذقنا ذلك لم نر لأنفسنا تمييز جهة من غيرها وجاءنا بغتة فما عرفنا الأمر كيف هو إلا بعد ذلك فمن وقف مع القرآن من حيث هو قرآن كان ذا عين واحدة أحدية الجمع ومن وقف معه من حيث ما هو مجموع كان في حقه فرقانا فشاهد الظهر والبطن والحد والمطلع فقال لكل آية ظهر وبطن وحد ومطلع وذلك الآخر لا يقول بهذا والذوق مختلف ولما ذقنا هذا الأمر الآخر كان التنزل فرقانيا فقلنا هذا حلال وهذا حرام وهذا مباح وتنوعت المشارب واختلفت المذاهب وتميزت المراتب وظهرت الأسماء الإلهية والآثار الكونية وكثرت الأسماء والآلهة في العالم فعبدت الملائكة والكواكب والطبيعة والأركان والحيوانات والنبات والأحجار والأناسي والجن حتى إن الواحد لما جاء بالوحدانية قالوا أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ وفي الحقيقة ليس العجب ممن وحد وإنما العجب ممن كثر بلا دليل ولا برهان ولهذا قال ومن يَدْعُ مَعَ الله إِلهاً آخَرَ لا بُرْهانَ لَهُ به وهذه رحمة من الله بمن لاحت له شبهة في إثبات الكثرة فاعتقد أنها برهان بأن الله يتجاوز عنه فإنه بذل وسعه في النظر وما أعطته قوته غير ذلك فليس للمشركين عن نظر أرجى في عفو الله من هذه الآية وقد قلنا إنه ما في العالم أثر إلا وهو مستند إلى حقيقة إلهية فمن أين تعددت الآلهة وعبدت من الحقائق الإلهية فاعلم إن ذلك من الأسماء فإن الله لما وسع فيها فقال اعْبُدُوا الله وقال اتَّقُوا الله رَبَّكُمْ وقال اسْجُدُوا لِلرَّحْمنِ وقال ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا يعني الله أو الرحمن فَلَهُ الْأَسْماءُ الْحُسْنى‏ فزاد الأمر عندهم إبهاما أكثر مما كان فإنه لم يقل ادعوا الله أو ادعوا الرحمن أيا ما تدعوا فالعين واحدة وهذان اسمان لها هذا هو النص الذي يرفع الإشكال فما أبقى الله هذا الإشكال إلا رحمة بالمشركين أصحاب النظر الذي أشركوا عن شبهة وبقي الوعيد في حق المقلدين حيث أهلهم الله للنظر وما نظروا ولا فكروا ولا اعتبروا فإنه ما هو علم تقليد فالمخطئ مع النظر أولى وأعلى من الإصابة والمصيب مع التقليد إلا في ذات الحق فإنه لا ينبغي أن يتصرف مخلوق فيها بحكم النظر الفكري وإنما\n\n\nهو مع الخبر الإلهي فيما يخبر به عن نفسه لا يقاس عليه ولا يزيد ولا ينقص ولا يتأول ولا يقصد بذلك القول وجها معينا بل يعقل المعنى ويجهل النسبة ويرد العلم بالنسبة إلى علم الله فيها فمن نظر الأمر بمثل هذا النظر فقد أقام العذر لصاحبه وكان رَحْمَةً لِلْعالَمِينَ‏\n\n\n### [إن ليلة القدر ليلة النصف من شعبان‏]\n\n\nثم اعلم أن الله أنزل الكتاب فرقانا في ليلة القدر ليلة النصف من شعبان وأنزله قرآنا في شهر رمضان كل ذلك إلى السماء الدنيا ومن هناك نزل في ثلاث وعشرين سنة فرقانا نجوما ذا آيات وسور لتعلم المنازل وتتبين المراتب فمن نزوله إلى الأرض في شهر شعبان يتلى فرقانا ومن نزوله في شهر رمضان يتلى قرآنا فمنا من‏\nيتلوه به فذلك القرآن ومنا من يتلوه بنفسه فذلك الفرقان ولا يصح أن يتلى بهما في عين واحدة ولا حال واحدة فإذا كنت عنده كنت عندك وإذا كنت عندك لم تكن عنده لأن كل شَيْ‏ءٍ عِنْدَهُ بِمِقْدارٍ وهو ليس كذلك بل هو مع كل شي‏ء وعند من يذكره بالذكر لا غير فإنه جليس الذاكرين‏\n\n\nاعلم أن الله أنزل هذا القرآن حروفا منظومة من اثنين إلى خمسة أحرف متصلة ومفردة وجعله كلمات وآيات وسورا ونورا وهدى وضياء وشفاء ورحمة وذكرا وعربيا ومبينا وحقا وكتابا ومحكما ومتشابها ومفصلا ولكل اسم ونعت من هذه الأسماء معنى ليس للآخر وكله كلام الله ولما كان جامعا لهذه الحقائق وأمثالها استحق اسم القرآن فلنذكر مراتب بعض نعوته ليعلم أهل الله منزلته‏\n\n\nفمن ذلك كونه حروفا والمفهوم من هذا الاسم أمران الأمر الواحد المسمى قولا وكلاما ولفظا والأمر الآخر يسمى كتابة ورقما وخطا والقرآن يخط فله حروف الرقم وينطق به فله حروف اللفظ فلما ذا يرجع كونه حروفا منطوقا بها هل لكلام الله الذي هو صفته أو هل للمترجم عنه فاعلم إن الله قد أخبرنا نبيه صَلَّى اللهُ عَليهِ وسَلَّم أنه سبحانه يتجلى في القيامة في صور مختلفة فيعرف وينكر ومن كانت حقيقته تقبل التجلي في الصور فلا يبعد أن يكون الكلام بالحروف المتلفظ بها المسماة كلام الله لبعض تلك الصور كما يليق بجلاله فكما نقول تجلى في صورة كما يليق بجلاله كذلك نقول تكلم بصوت وحرف كما يليق بجلاله ونحملها محمل الفرح والضحك والعين والقدم واليد واليمين وغير ذلك مما ورد في الكتاب والسنة مما يجب الايمان به على المعنى المعقول من غير كيفية ولا تشبيه فإنه يقول لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فنفى إن يماثل مع عقل المعنى وجهل النسبة فإذا انتظمت الحروف سميت كلمة وإذا انتظمت الكلمات سميت آية وإذا انتظمت الآيات سميت سورة فلما وصف نفسه بأن له نفسا كما يليق بجلاله ووصف نفسه بالصوت والقول وقال فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله كان النفس المسمى صوتا وكان انقطاعه من الصوت حيث انقطع يسمى حرفا وكل ذلك معقول مما وقع الإخبار الإلهي به لنا مع نفي المماثلة والتشبيه كسائر الصفات ولما وصف نفسه بالصورة عرفنا معنى قوله إنه الظَّاهِرُ والْباطِنُ فالباطن للظاهر غيب والظاهر للباطن شهادة ووصف نفسه بأن له نفسا فهو خروجه من الغيب وظهور الحروف شهادة والحروف ظروف للمعاني التي هي أرواحها والتي وضعت للدلالة عليها بحكم التواطؤ وقال تعالى وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ وأبلغ من هذا الإفصاح من الله لعباده ما يكون فلا بد أن يفهم من هذه العبارات ما تدل عليه في ذلك اللسان بما وقع الإخبار به عن الكون فيعرف المعنى الذي يدل عليه ذلك الكلام وتعرف النسبة وما وقع الإخبار به عن الله يعرف المعنى الذي يدل عليه ذلك الكلام وتجهل النسبة لما أعطى الدليل العقلي والدليل الشرعي من نفي المماثلة فإذا تحققت ما قررناه تبينت أن كلام الله هو هذا المتلو المسموع المتلفظ به المسمى قرآنا وتوراة وزبورا وإنجيلا فحروفه تعين مراتب كلمه من حيث مفرداتها ثم للكلمة من حيث جمعيتها معنى ليس لآحاد حروف الكلمة فللكلمة أثر في نفس السامع لهذا سميت كلمة في اللسان العربي مشتقة من الكلم وهو الجرح وهو أثر في جسم المكلوم كذلك للكلمة أثر في نفس السامع أعطاه ذلك الأثر استعداد السمع لقبول الكلام بوساطة الفهم لا بد من ذلك فإذا انتظمت كلمتان فصاعدا سمي المجموع آية أي علامة على أمر لم يعط ذلك الأمر كل كلمة على انفرادها مثل الحروف مع الكلمة إذ قد تقرر أن للمجموع حكما لا يكون لمفردات ذلك المجموع فإذا انتظمت الآيات بالغا ما أراد المتكلم أن يبلغ بها سمي المجموع سورة معناها منزلة ظهرت عن مجموع هذه الآيات لم تكن الآيات تعطي تلك المنزلة على انفراد كل آية منها وليس القرآن سوى ما ذكرناه من سور وآيات وكلمات وحروف فهذا قد أعطيتك أمرا كليا في القرآن والمنازل تختلف فتختلف الآيات فتختلف الكلمات فيختلف نظم الحروف والقرآن كبير كثير لو ذهبنا نبين على التفصيل ما أومأنا إليه لم يف العمر به فوكلناك إلى نفسك لاستخراج ما فيه من الكنوز وهذا إذا جعلناه كلاما فإن أنزلناه كتابا فهو نظم حروف رقمية لانتظام كلمات لانتظام آيات لانتظام سور كل ذلك عن يمين كاتبة كما كان القول عن نفس رحماني فصار الأمر على مقدار واحد وإن اختلفت الأحوال لأن حال التلفظ ليس حال الكتابة وصفة اليد ليست صفة النفس فكونه‏\nكتابا كصورة الظاهر والشهادة وكونه كلاما كصورة الباطن والغيب فأنت بين كثيف ولطيف والحروف على كل وجه كثيف بالنسبة إلى ما يحمله من الدلالة على المعنى الموضوع له والمعنى قد يكون لطيفا وقد يكون كثيفا لكن الدلالة لطيفة على كل وجه وهي التي يحملها الحرف وهي روحه والروح ألطف من الصورة ثم إن الله قد جعل للقرآن سورة من سورة قلبا وجعل هذه السورة تعدل القرآن عشرة أوزان وجعل لآيات القرآن آية أعطاها السيادة على آي القرآن وجعل من سور هذا القرآن سورة تزن ثلثه ونصفه وربعه وذلك لما أعطته منزلة تلك السورة والكل كلامه فمن حيث هو كلامه لا تفاضل ومن حيث ما هو متكلم به وقع التفاضل لاختلاف النظم فاضرع إلى الله تعالى ليفهمك ما أومأنا إليه فإنه المنعم المحسان‏\n\n\nكون القرآن نورا بما فيه من الآيات التي تطرد الشبه المضلة مثل قوله تعالى لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا وقوله لا أُحِبُّ الْآفِلِينَ وقوله فَسْئَلُوهُمْ إِنْ كانُوا يَنْطِقُونَ وقوله فَأْتِ بِها من الْمَغْرِبِ وقوله إِذاً لَابْتَغَوْا إِلى‏ ذِي الْعَرْشِ سَبِيلًا وقوله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً وقوله فَأْتُوا بِسُورَةٍ من مِثْلِهِ وكل ما جاء في معرض الدلالة فهو من كونه نورا لأن النور هو المنفر الظلم وبه سمي نورا إذ كان النور النفور\n\n\nوأما كونه ضياء فلما فيه من الآيات الكاشفة للأمور والحقائق مثل قوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ وسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وقوله من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله وقوله أَنْبِئُونِي بِأَسْماءِ هؤُلاءِ وقوله لِما خَلَقْتُ بِيَدَيَّ وقوله وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله وقوله كُلٌّ من عِنْدِ الله وقوله فَأَلْهَمَها فُجُورَها وتَقْواها وما أشبه ذلك مما يدل على مجرى الحقائق ومثل قوله والله خَلَقَكُمْ وما تَعْمَلُونَ‏\n\n\nوأما كونه شفاء فكفاتحة الكتاب وآيات الأدعية كلها\n\n\nوأما كونه رحمة فلما فيه مما أوجبه على نفسه من الوعد لعباده بالخير والبشرى مثل قوله لا تَقْنَطُوا من رَحْمَةِ الله وقوله كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ وقوله ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ وكل آية رجاء\n\n\nوأما كونه هدى فكل آية محكمة وكل نص ورد في القرآن مما لا يدخله الاحتمال ولا يفهم منه إلا الظاهر بأول وهلة مثل قوله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ وقوله ولَكُمْ في الْقِصاصِ حَياةٌ وقوله من جاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثالِها ومن جاءَ بِالسَّيِّئَةِ فَلا يُجْزى‏ إِلَّا مِثْلَها وقوله فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله وأمثال هذه الآيات مما لا تحصى كثرة\n\n\nوأما كونه ذكرا فلما فيه من آيات الاعتبارات وقصص الأمم في إهلاكهم بكفرهم كقصة قوم نوح وعاد وثمود وقوم لوط وأصحاب الأيكة وأصحاب الرس‏\n\n\nوأما كونه عربيا فلما فيه من حسن النظم وبيان المحكم من المتشابه وتكرار القصص بتغيير ألفاظ من زيادة ونقصان مع توفية المعنى المطلوب في التعريف والإعلام مع إيجاز اللفظ مثل قوله يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ وقوله ما ضَرَبُوهُ لَكَ إِلَّا جَدَلًا وقوله يا أَرْضُ ابْلَعِي ماءَكِ ويا سَماءُ أَقْلِعِي وغِيضَ الْماءُ وقُضِيَ الْأَمْرُ واسْتَوَتْ عَلَى الْجُودِيِّ وقِيلَ بُعْداً لِلْقَوْمِ الظَّالِمِينَ وقوله وأَوْحَيْنا إِلى‏ أُمِّ مُوسى‏ أَنْ أَرْضِعِيهِ فَإِذا خِفْتِ عَلَيْهِ فَأَلْقِيهِ في الْيَمِّ ولا تَخافِي ولا تَحْزَنِي إِنَّا رَادُّوهُ إِلَيْكِ وجاعِلُوهُ من الْمُرْسَلِينَ كل ذلك في آية واحدة تحتوي على بشارتين وأمرين بعلم نافع وتبيين ببشرى من الله‏\n\n\nوأما كونه مبينا فبما أبان فيه من صفات أهل السعادة وأهل الشقاء ونعوت أهل الفلاح من غيرهم كقوله قَدْ أَفْلَحَ الْمُؤْمِنُونَ إلى آخر الآيات وقوله إِنَّ الله اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ وآيات الأحكام وكل آية أبان بها عن أمر ليعرف فلهذا سماه بهذه الأسماء كلها وجعله قرآنا أي ظاهرا جامعا لهذه المعاني كلها التي لا توجد إلا فيه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ كمل السفر الحادي والعشرون بكمال هذا الباب‏\n\n",
    "en": "## Chapter Three Hundred and Twenty-Five: Concerning the Knowledge of the Station of the Qur'an within the Muhammadan Presence (الحضرة المحمدية)\n\nMultiplicity (الجمع) is considered in every moment,\nAnd the Odd (al-Witr) in Multiplicity is like the numbers in the One (al-Ahad).\n\nThis God is the Names, He made them Odd (Witr),\nNinety-nine, neither decreasing nor increasing.\n\nThe Essence (al-'Ayn) is the totality of Names, and it has no\nOddness (Witr) other than the number we have mentioned.\n\nThere is nothing there except a Single One (Fard) whose Essence defines\nThe Essence of the Many, so do not turn to anyone else.\n\nAnd Allah is Odd (Witr), nothing makes Him multiple,\nAlong with the knowledges He granted you in observation.\n\nThere is no active agent (mu'aththir) other than Allah in humanity,\nAnd the 'other' is not there, so seek the Dweller of the Land.\n\nHe grants you goodness through benevolence He bestows\nUpon you, for He is the One who, if He wills, does not find [need].\n\n### [That everything other than Allah is purified, transcendent spirits]\n\nKnow, may Allah grant you understanding, that everything other than Allah consists of purified, transcendent spirits (أرواح مطهرة منزهة), which He originated and created. These are divided into Place (مكان) and Located Entity (متمكن).\n\nPlace is divided into two types: a place called heaven (سماء) and a place called earth (أرض). The Located Entity within them is divided into two types: an entity located *in* it, and an entity located *upon* it. The entity located *in* it exists according to the nature of its place, while the entity located *upon* it does not exist according to the nature of its place. This encompasses all that is other than Allah. All of this is, in reality, spirits (أرواح), which are bodies and substances (جواهر) in the Reality (al-Haqq) by which they are created.\n\nThese spirits exist on degrees (مراتب) of transcendence (tanzih), which are called station (makana). There is no one who transcends Allah, the Exalted, except that his transcendence is according to the measure of his rank, because he only transcends his Creator from the perspective of what he is, for he knows nothing but himself. This transcendence then yields for him a station (makana) with Allah, by which every existing thing is distinguished from another.\n\nThis station (manzil) contains the transcendence of the located spirits (الأرواح المتمكنة), not the locational ones. A station will follow in these stations where we shall mention the transcendence of the Place and the Located Entity together. Thus, this station contains half of the cosmos (al-'Alam) in terms of its transcendence.\n\nThen, Allah, the Exalted, returned the station (makana) to this transcendent one by making the Real (al-Haqq) his mirror (majla). So he saw himself and his rank, and he glorified [Allah] according to what he saw. Then he realized that it was himself and no other. This is because the Real drew the Veil of Might (حجاب العزة) between Himself and His servants, and transcendence stopped short of it. Thus, he knew that the transcendence of His creation is not befitting for the Real, and that the Veil of Might is more protective and its subjugation (qahr) is more dominant.\n\nThen he saw others among the Gnostics (al-'Arifin billah) who transcended [Allah] using the attributes of negation (nu'ut al-sulub) according to their ranks. All of them admitted that they had been mistaken in the locus of their transcendence, and that their transcendence had not departed from themselves. This was due to His Wisdom (hikma) that permeated His creation. Thus, that was the transcendence of Wisdom and nothing else. Were it not for the covering of the Veil of Might, they would not have known this.\n\nFrom this Veil, Unbelief (Kufr) appeared in the world, and Gnosis (Ma'rifa) became news of what is beyond this Veil. Thus, Faith (Iman) appeared in the world between the covering and the believer. The unbeliever (Kafir), who is the coverer (Sātir), is closer because of the covering, for the covering sees both what is veiled *by* it and what is veiled *from* it, and this is the attribute of the unbeliever. The believer is below this covering, so his station is the Veil. The Exalted said: <<وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ>> (And it is not for any human being that Allah should speak to him except by revelation or from behind a veil). Faith is related to the report (khabar), and the report is one of the categories of speech.\n\n### [That Allah, the Glorified, brought the people of the veil out of the Unseen into the Visible]\n\nThen, the Glorified brought the people of the veil out of the Unseen (al-Ghayb) into the Visible (al-Shahada) so that the station of Integration (al-Jam') between the two states might be achieved for him, allowing him to transcend [Allah] with both tongues and affirm both Attributes.\n\nIt was not in his expectation what the Real (al-Haqq) did with him. Rather, he imagined that the Unseen could not be in the domain of the Visible, due to his knowledge that the Unseen is a protected sanctuary, unknowable, and unreachable. Its station is only to be *felt* (mash'ur bihi) without specifying what that felt thing is. He was heedless of the fact that Allah does what He wills, and that there is no Unseen in relation to Him, and that the Unseen can only be relative (idafiyyan).\n\nWhen what was not in his reckoning appeared to him from Allah, he knew that all affairs are in Allah's hands, and that there is no one who deserves a ruling for himself. Rather, He is Allah, <<الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (Who gave each thing its creation).\n\nWhen things knew that they possess nothing of themselves, and that they exist according to what the essence of their Originator necessitates, and that states are renewed upon them according to what the realities of the One upon whom they rely—namely Allah, the Exalted—demand, they feared, since they did not stand upon Allah's knowledge concerning them in the future. So they abandoned everything they relied upon in themselves for what was with their Creator. Thus, they glorified Him with a new glorification (tasbihan jadidan) from a new creation. They passed from looking at themselves to looking at the One in whose hand is the dominion (malakut) of all things.\n\nWere it not for this station in which He established them, and His returning them to Himself from nearby, He would have called them from afar, and the distance would have been long for them, and afflictions and distractions would have befallen them on the path, for the traveler and his wealth are few.\n\nThen, when Allah established things in this station, He raised for them a banner of Gnosis (Ma'rifa). He granted them the knowledge that they are a half (shiq) and constitute half of Existence (al-Wujud), and that the perfection of Existence is through them, and without them, perfection would not have appeared in Existence and Knowledge. So they rejoiced and their status became great in their own eyes, though they did not know which portion of Existence was rightly theirs.\n\nThen this became manifest to them in the worship of the Prayer (Salat), where the Real divided it into two halves between Himself and His servant. So they increased in pride. But when they heard the end of the report, which corresponded to their state that they had not perceived, in His saying: \"And half of it is for Me,\" without qualification, and He said concerning the servant's half: \"And half of it is for My servant, and My servant shall have what he asked for.\" Asking (su'al) implies abasement (madhalla), poverty, need, and lowliness.\n\nHowever, what appeared to the servant from behind this veil was something he had not expected: that he is in a station where the Real is *behind* him, like His saying: <<وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ>> (And Allah encompasses them from behind). This is because he is in a state of flight (firar) when faced with what he cannot bear. So Allah informed him that He is behind him, and He is the one who faces him. If he flees from Him, he flees to Him unknowingly, just as he is in another station where He is before him, as in His saying: <<مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا>> (There is no creature but that He holds its forelock).\n\nHe described Himself as the Guide (al-Hadi), and the Guide is the one who leads the people to show them the way, which is His saying: <<إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ>> (Indeed, my Lord is on a straight path). <<مَا كُنْتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ>> (You did not know what the Book was or [what] faith was).\n\nThus, things became an obstacle for the Real. So He advanced before things to guide them to what contains their happiness, and He stayed behind them to protect them from whoever seeks to destroy them, which is Non-existence (al-'Adam). For Non-existence seeks them just as Existence seeks them, and they are a locus capable of both rulings, having no power to resist except by the subtlety of the Subtle One (al-Latif).\n\nThen, when Allah informed them of this, they acquired knowledge of Allah's Majesty (Jalal) and Names by which they glorify Him, praise Him, and laud Him, which they did not know before this witnessing (mashhad). As the Prophet, peace and blessings be upon him, said concerning the Praised Station (al-Maqam al-Mahmud) on the Day of Resurrection: \"I shall praise Him with praises I do not know now.\" That station grants him, by virtue of his presence in it, what Allah inspires him with, and he praises Him with those [praises].\n\nSimilarly, every station and rank in the world, both temporal and eternal, has a specific praise that is inexhaustible. When he glorifies Him, that praise bequeaths him another knowledge that he did not possess—the knowledge of the Divine Ear (علم الأذن الإلهي), from which Allah created the bird by the hand of Jesus, and from which Jesus breathed into it and it became a bird, and from which he healed the blind and the leper and raised the dead.\n\nThis is a noble knowledge realized by Abu Yazid al-Bistami and Dhu al-Nun al-Misri. As for Abu Yazid, he unintentionally killed an ant. When he realized it, he breathed into it, and it stood up alive by Allah's permission. As for Dhu al-Nun, an old woman came to him whose son had been taken by a crocodile in the Nile. He prayed for the crocodile, and it cast the boy out of its belly alive, just as the whale cast out Jonah.\n\nWhen this knowledge is unveiled to him, he praises the Glorified with the laudations befitting Him that this station demands. From here, he gains insight (istishraf) into those who have departed from this station, and he knows the state of those who have left, because this station is the Comprehensive Station (al-Manzil al-Jami'). For this reason, it is called the Station of the Qur'an (manzil al-Qur'an).\n\nWhen the possessor of this station descends from this rank to the phenomenal world (al-Kawn), the enemy attacks him with his armies, and that is Iblis, who is naturally hostile to him, especially to the descendants (al-Banin). Iblis is antithetical to them in all respects, unlike his enmity toward Adam, for the dryness (al-yabs) united him and Adam, as there is a common ground between dust and fire. Because of that common ground, Iblis was truthful when he swore by Allah to Adam that he was sincere. But he is not truthful to the descendants, for he is their opposite in all respects, as they were created from water, which is antithetical to fire. Thus, the enmity toward the descendants is more severe than the enmity toward their father.\n\nAllah made this enemy veiled from the perception of sight, but He gave him signs in the heart through the Sacred Law (Shar') by which he is known. These signs serve as a substitute for visual perception, allowing the human to guard against Iblis's suggestions.\n\nAllah aided this human with an Angel (Malak) whom He placed opposite Iblis, unseen to unseen (ghayban li-ghayb). Whenever [Iblis] fails to affect the exterior of the human, and the Angel prevails with the soul's assistance, the soul receives two rewards: its own reward and the reward of the helper, the Angel, because the Angel accepts no recompense, and his rank neither increases nor decreases. If [Iblis] affects the human's exterior, the Angel grieves for that and seeks forgiveness for this human. Since the Angel is not a locus for the recompense of grief, that recompense returns to the human. Thus, the human is profitable in both obedience and disobedience. Faith strengthens the Angel, and for this reason, the Angel seeks forgiveness for him.\n\n### [That the Qur'an is comprehensive, drawn by all Divine Realities, so its station is Equilibrium]\n\nKnow that since the Qur'an is comprehensive (jami'an), it is drawn equally by all Divine and Cosmic Realities (al-Haqa'iq al-Ilahiyya wa al-Kawniyya). Thus, it contains no crookedness or distortion. Its station is Equilibrium (al-I'tidal).\n\nEquilibrium is the station that preserves the subsistence (baqa') of existence upon the existent; it is not the station of Origination (al-Ijad), for origination only occurs through deviation (inhiraf) and inclination (mayl), which is called \"volitional turning\" (tawajjuhan iradiyyan) in relation to the Real, as in His saying: <<إِذَا أَرَدْنَاهُ>> (When We intend it).\n\nSince its station is Equilibrium, it possesses permanence (daymumah) and subsistence (baqa'). It maintains the subsistence of formation (takwin) and the subsistence of the cosmos (kawn). If it were to descend from its station, it would descend from Equilibrium to deviation, which is His saying: <<وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ>> (And if there were a Qur'an by which the mountains could be moved), and His saying: <<لَوْ أَنْزَلْنَا هَذَا الْقُرْآنَ>> (If We had sent down this Qur'an)—meaning, from its station—<<عَلَى جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا>> (upon a mountain, you would have seen it humbled and split apart)—meaning the mountain. It would not have preserved its form because it descended from its station.\n\nSince this is its station, and the Realities draw it equally, the one upon whom it was revealed was <<رَحْمَةً لِلْعَالَمِينَ>> (a mercy to the worlds), because Mercy (al-Rahma) <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompassed all things), and everything sought it by an essential seeking.\n\nWhen the Messenger of Allah, peace and blessings be upon him, prayed in the Qunut against those who opposed him, he was admonished for that, and it was said to him: <<وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ>> (And We sent you not but as a mercy to the worlds). That is, so that you may have mercy upon them, because you are the possessor of the Qur'an, and the Qur'an speaks, saying: \"I only sent you as a mercy,\" and it speaks, saying: <<وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ>> (My Mercy encompasses all things).\n\nMercy is thus between favor (minna) and obligation (wujub). Some of My servants are encompassed by the ruling of obligation, and some by the ruling of favor. The origin is favor, grace (fadl), and Divine beneficence (in'am), since the cosmos did not exist so as to have a right of entitlement. Its manifestation was only from the Essence of Favor. Likewise, the matter by which [the Prophet] deserved Mercy was from the Essence of Favor.\n\nIf the Qur'an descends from its station, it is His Word (Kalam), and His Word is of a single proportion (nisba wahida) in relation to the division that speech accepts. He reveals it, and in it is the reality of equilibrium in proportions. It is always new (jadid) for every reciter. It only accepts descent in a manner appropriate to its equilibrium. Thus, it is stripped of caprice (hawa). For this reason, it was said concerning Muhammad, peace and blessings be upon him: <<وَمَا يَنْطِقُ عَنِ الْهَوَى>> (Nor does he speak from [his own] desire). Other messengers and successors were forbidden from following caprice. Thus, he did not descend in rank to the level of those about whom it was reported that they do not speak from caprice.\n\nNot everyone who attains [the Qur'an] perceives its descent, due to the preoccupation of his spirit with its nature. So it descends upon him from behind the veil of nature, and it does not affect him with delight (iltidhadh). This is what the Prophet, peace and blessings be upon him, said concerning a group of reciters: \"They recite the Qur'an, but it does not pass beyond their throats.\"\n\nThis is a Qur'an revealed upon the tongues, not upon the hearts. But concerning the tasting (dhawq), He said: <<نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ>> (The Trustworthy Spirit descended with it upon your heart). That is the one who finds a sweetness in its descent upon him whose measure cannot be estimated, surpassing every delight. When he finds it, that is the one upon whom the new Qur'an, which never wears out, has descended.\n\nThe difference between the two descents is that the one upon whose heart the Qur'an descends receives it with understanding (fahm). He knows what he is reciting, even if it is not in his own language, and he knows the meanings of what he is reciting, even if those words do not carry those meanings outside the Qur'an because they are not in his dialect. He knows them in his recitation if he is one upon whom the Qur'an descends upon his heart during recitation.\n\nSince the station and rank of the Qur'an are as we have mentioned, every existent thing finds in it what it desires. For this reason, Shaykh Abu Madyan used to say: \"The seeker (Murid) is not a seeker until he finds in the Qur'an everything he desires.\" Any speech that does not possess this universality is not the Qur'an.\n\nSince its descent is upon the heart, which is a Divine Attribute (sifa ilahiyya) that does not depart from its possessor, no one can reveal it except the One whose Word it is. The Real mentioned that the heart of His believing servant encompasses Him. Thus, the descent of the Qur'an into the heart of the believer is the descent of the Real into it. The Real speaks to this servant from His secret into his secret. This is the meaning of their saying: \"My heart told me from my Lord\" without intermediary.\n\nThe reciter (al-Tali) is only called a reciter because the words follow one another consecutively. This consecutiveness necessitates a final letter, which is *min wali* (from following), meaning it descends from one thing to another. Since the heart is from the Higher World (al-'Alam al-A'la) and the tongue is from the Lower World (al-'Alam al-Anzal), and the Real's place of descent is the servant's heart—and He is the Speaker, and He is one in the heart—while the letters are from the world of the tongue, the tongue separated the verses (Ayat) and recited them consecutively. Thus, the human is called a reciter (Tali) by virtue of his tongue, for it is the one that details what was revealed in summary.\n\nThe Qur'an is to the revealed Books and Scrolls as the Human is to the Cosmos (al-'Alam), for it is the totality of the Books, and the Human is the totality of the Cosmos. They are brothers. By this, I mean the Perfect Human (الإنسان الكامل), and that is only the one upon whom the Qur'an was revealed from all its directions and proportions. As for his inheritors, it was only revealed upon them from behind their shoulders (min bayni katifayhi) and settled in their chest from behind the Unseen (zahr ghayb). This is the complete inheritance.\n\nIt is related that Abu Yazid did not die until he had memorized the Qur'an. The Messenger of Allah, peace and blessings be upon him, said concerning the one who was given the Qur'an that \"Prophethood has been folded between his sides.\"\n\nThis is the difference between the Prophets and the follower-saints (al-Awliya al-Atba'). However, the one between whose sides Prophethood was folded, and to whom the Qur'an came from behind the Unseen (zahr ghayb), was granted vision from behind him just as he was granted it from before him, since the Qur'an only descends face-to-face (muwajaha). Thus, for the Prophet, peace and blessings be upon him, it is from two faces: a customary face and a non-customary face. For the inheritor, it is from a non-customary face, so it is called the \"back\" (zahr) by virtue of the origin, and a \"face\" by virtue of the branch.\n\nWhen we tasted this, we did not see any distinction for ourselves between one direction and another. It came to us suddenly (baghtatan), and we did not know how the matter was until afterwards.\n\nWhoever stands with the Qur'an purely as *Qur'an* (Gathering) is possessed of a single eye of Unitive Integration (ahadiyyat al-Jam'). Whoever stands with it as a *Totality* (Majmu') finds it to be a Criterion (Furqan) in his regard. He witnesses the outer (zahr), the inner (batn), the limit (hadd), and the rising place (matla'). He says that every verse has an outer, an inner, a limit, and a rising place. The other one does not say this, for the tasting (dhawq) differs.\n\nWhen we tasted this other matter, the descent was discriminative (furqani), so we said: \"This is lawful (halal), and this is unlawful (haram), and this is permissible (mubah).\" The sources of drinking diversified, the schools of thought (madhahib) differed, the ranks were distinguished, and the Divine Names and Cosmic Effects appeared. Multiplicity (kathra) of names and deities increased in the world, so angels, stars, nature, elements, animals, plants, stones, humans, and jinn were worshipped.\n\nWhen the one [Prophet] came with Unity (Wahdaniyya), they said: <<أَجَعَلَ الْآلِهَةَ إِلَهًا وَاحِدًا إِنَّ هَذَا لَشَيْءٌ عُجَابٌ>> (Has he made the gods [into] one God? Indeed, this is a curious thing). In reality, the astonishment is not directed at the one who unified, but at the one who multiplied without evidence or proof. For this reason, He said: <<وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ>> (And whoever invokes besides Allah another deity for which he has no proof).\n\nThis is a mercy from Allah upon those for whom a doubt (shubha) arose in affirming multiplicity, and who believed that it was proof, for Allah will overlook them. This is because they exerted their utmost effort (badhalu wus'ahum) in speculation, and their power granted them nothing else. There is no greater hope for the polytheists who speculate (nazar) in Allah's forgiveness than this verse.\n\nWe have said that there is no effect in the cosmos except that it relies upon a Divine Reality. So, from where did the deities multiply and become worshipped from the Divine Realities? Know that this is from the Names (al-Asma'). When Allah expanded upon them, He said: <<اعْبُدُوا اللَّهَ>> (Worship Allah), and He said: <<اتَّقُوا اللَّهَ رَبَّكُمْ>> (Fear Allah, your Lord), and He said: <<اسْجُدُوا لِلرَّحْمَنِ>> (Prostrate to the Most Merciful), and He said: <<ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا>> (Call upon Allah or call upon the Most Merciful. Whichever you call), meaning Allah or the Most Merciful, <<فَلَهُ الْأَسْمَاءُ الْحُسْنَى>> (to Him belong the most beautiful Names).\n\nThis increased the ambiguity for them more than it was before, for He did not say: \"Call upon Allah or call upon the Most Merciful. Whichever you call, the Essence is one, and these are two Names for it.\" This is the text that would remove the difficulty. Allah only left this difficulty as a mercy for the polytheists who speculate (ashab al-nazar) and who associated partners due to a doubt.\n\nThe threat of punishment remains for the blind followers (al-muqallidin), since Allah made them capable of speculation, but they neither speculated, nor pondered, nor took heed. For it is not the knowledge of blind following. The one who errs with speculation is more worthy and higher than the one who is correct with blind following, *except* concerning the Essence (Dhat) of the Real. No creature should dispose of the Essence by the ruling of intellectual speculation. Rather, one must adhere to the Divine Report (al-Khabar al-Ilahi) concerning what He reports about Himself. One must not analogize upon it, nor add to it, nor subtract from it, nor interpret it, nor intend a specific face by that saying. Rather, one understands the meaning but ignores the proportion (jahl al-nisba), and refers the knowledge of the proportion back to Allah's knowledge concerning it. Whoever views the matter with such a perspective has established an excuse for his companion and was <<رَحْمَةً لِلْعَالَمِينَ>> (a mercy to the worlds).\n\n### [That the Night of Power is the Night of the Middle of Sha'ban]\n\nThen know that Allah revealed the Book as a Criterion (Furqan) on the Night of Power (Laylat al-Qadr), which is the Night of the Middle of Sha'ban (laylat al-nisf min Sha'ban). And He revealed it as a Recitation (Qur'an) in the month of Ramadan. All of that was to the Lower Heaven (al-Sama' al-Dunya). From there, it descended over twenty-three years as a Criterion, in portions (nujuman), containing verses (Ayat) and chapters (Suras), so that the stations might be known and the ranks clarified.\n\nFrom its descent to the earth in the month of Sha'ban, it is recited as a Criterion (Furqan). From its descent in the month of Ramadan, it is recited as a Recitation (Qur'an). Some of us recite it *by* Him (bihi)—that is the Qur'an. Some of us recite it *by* ourselves (bi-nafsihi)—that is the Criterion. It is not correct to recite it by both in one Essence or one state. If you are with Him, you are with yourself; and if you are with yourself, you are not with Him, because <<كُلُّ شَيْءٍ عِنْدَهُ بِمِقْدَارٍ>> (everything with Him is by measure), but He is not like that. Rather, He is with everything and with the one who remembers Him by remembrance and nothing else, for He is the Companion of those who remember Him (Jalis al-Dhakirin).\n\nKnow that Allah revealed this Qur'an as articulated letters (huruf manzuma), from two to five connected and separate letters. He made it words, verses, chapters, Light (Nur), Guidance (Huda), Radiance (Diya'), Healing (Shifa'), Mercy (Rahma), Reminder (Dhikr), Arabic (Arabi), Clear (Mubin), Truth (Haqq), Book (Kitab), Decisive (Muhkam), Allegorical (Mutashabih), and Detailed (Mufassal). Each of these names and attributes has a meaning that the others do not possess, yet all of it is the Word of Allah (Kalam Allah). Since it is comprehensive of these realities and their likes, it deserves the name Qur'an. Let us mention the ranks of some of its attributes so that the people of Allah may know its station.\n\nOne of these is its being Letters (Huruf). What is understood from this name are two matters: the first is called speech (qawl), word (kalam), and utterance (lafz); the second is called writing (kitaba), number (raqm), and script (khatt). The Qur'an is written, so it has the letters of inscription, and it is spoken, so it has the letters of utterance.\n\nWhy does its being articulated letters refer to the Word of Allah, which is His Attribute, or to the one who translates it? Know that our Prophet, peace and blessings be upon him, informed us that the Glorified discloses Himself (yatajalla) on the Day of Resurrection in different forms, so He is known and denied. Since His Reality accepts disclosure in forms, it is not far-fetched that the speech with articulated letters, called the Word of Allah, is part of those forms, as befits His Majesty (Jalal). Just as we say He discloses Himself in a form as befits His Majesty, so too we say He speaks with a sound and a letter as befits His Majesty. We interpret these in the same way we interpret joy, laughter, eye, foot, hand, and other things mentioned in the Book and the Sunnah, which must be believed in according to the understood meaning (al-ma'qul) without modality (kayfiyya) or similitude (tashbih). For He says: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). Thus, He negated similitude while affirming the understood meaning and ignoring the proportion (jahl al-nisba).\n\nWhen letters are arranged, they are called a Word (Kalima). When words are arranged, they are called a Verse (Aya). When verses are arranged, they are called a Chapter (Sura).\n\nSince He described Himself as having a Soul (Nafs) as befits His Majesty, and described Himself with sound and speech, and said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ>> (Then grant him protection until he hears the Word of Allah), the Soul is called sound, and its cessation from sound, where it ceases, is called a letter. All of this is understood from the Divine Report given to us, while negating similitude and comparison, like all other Attributes.\n\nWhen He described Himself with Form (Sura), we understood the meaning of His saying: <<هُوَ الظَّاهِرُ وَالْبَاطِنُ>> (He is the Manifest and the Hidden). The Hidden is the Unseen (Ghayb) for the Manifest, and the Manifest is the Visible (Shahada) for the Hidden. He described Himself as having a Soul (Nafs), which is His emergence from the Unseen. The manifestation of the letters is the Visible. The letters are vessels (zuruuf) for the meanings, which are their spirits, and which were established by convention (tawatu') to indicate them.\n\nThe Exalted said: <<وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ>> (And We did not send any messenger except with the language of his people to make [the message] clear for them). This is the clearest possible articulation from Allah to His servants. Therefore, one must understand from these expressions what they indicate in that language concerning what has been reported about the cosmos: one knows the meaning indicated by that speech and knows the proportion. But concerning what has been reported about Allah, one knows the meaning indicated by that speech but ignores the proportion, because the rational proof and the legal proof grant the negation of similitude.\n\nIf you realize what we have established, it becomes clear that the Word of Allah is this recited, heard, and uttered [text] called the Qur'an, the Torah, the Psalms, and the Gospel. Its letters define the ranks of its words in terms of their individual components. Then the Word, in its totality, has a meaning that the individual letters of the word do not possess. The Word has an effect on the soul of the listener. For this reason, it is called *kalima* in the Arabic language, derived from *al-kalm* (wounding/affecting), which is an effect on the body of the wounded. Likewise, the word has an effect on the soul of the listener, and that effect is granted by the readiness of the hearing to accept the speech through the mediation of understanding (fahm)—this is necessary.\n\nWhen two or more words are arranged, the totality is called a Verse (Aya), meaning a sign (alama) of a matter that individual words do not convey, just like the letters with the word. It has been established that the totality has a ruling that the individual components of that totality do not possess.\n\nWhen the verses are arranged, reaching whatever the Speaker intended them to reach, the totality is called a Chapter (Sura). Its meaning is a station (manzila) that appeared from the totality of these verses, which the verses did not convey individually. The Qur'an is nothing but what we have mentioned: chapters, verses, words, and letters.\n\nI have given you a universal principle concerning the Qur'an. The stations differ, so the verses differ, so the words differ, so the arrangement of the letters differs. The Qur'an is vast and abundant. If we were to detail what we have alluded to, life would not suffice. So we entrust you to yourself to extract the treasures within it.\n\nThis is if we consider it Speech (Kalam). If we consider it a Book (Kitab), it is the arrangement of numerical letters (huruf raqmiyya) for the arrangement of words, for the arrangement of verses, for the arrangement of chapters—all of this is from a writing hand (yamin katiba), just as the speech was from the Breath of the Merciful (Nafs Rahmani). Thus, the matter is of a single measure, even though the states differ, for the state of utterance is not the state of writing, and the attribute of the hand is not the attribute of the Soul.\n\nIts being a Book is like the form of the Manifest (al-Zahir) and the Visible (al-Shahada), and its being Speech is like the form of the Inner (al-Batin) and the Unseen (al-Ghayb). You are between the dense (kathif) and the subtle (latif). The letters, in every aspect, are dense relative to the meaning they carry, which is their spirit, and which was established to indicate them. The meaning may be subtle or dense, but the indication (dalala) is subtle in every aspect. It is what the letter carries, and it is its spirit, and the spirit is subtler than the form.\n\nFurthermore, Allah has made a chapter of the Qur'an its heart (Surat Yasin). He made this chapter equal to ten weights of the Qur'an. He made a verse of the Qur'an's verses its master (Ayat al-Kursi). He made chapters of this Qur'an that weigh a third, a half, and a quarter of it. This is due to the station that chapter granted. Yet, all of it is His Word. From the perspective that it is His Word, there is no preference. But from the perspective of how it is spoken, preference occurs due to the difference in arrangement. Therefore, supplicate to Allah, the Exalted, to grant you understanding of what we have alluded to, for He is the Benefactor, the Bestower of Goodness.\n\nThe Qur'an is Light (Nur) because of the verses it contains that repel misleading doubts (shubah), such as His saying, the Exalted: <<لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا>> (If there had been in them [the heavens and earth] gods besides Allah, they would have been ruined), and His saying: <<لَا أُحِبُّ الْآفِلِينَ>> (I do not love those that disappear), and His saying: <<فَاسْأَلُوهُمْ إِنْ كَانُوا يَنْطِقُونَ>> (So ask them, if they can speak), and His saying: <<فَأْتِ بِهَا مِنَ الْمَغْرِبِ>> (Then bring the sun from the west), and His saying: <<إِذًا لَابْتَغَوْا إِلَى ذِي الْعَرْشِ سَبِيلًا>> (Then they would have sought to the Lord of the Throne a way), and His saying: <<لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا>> (They would have found within it much contradiction), and His saying: <<فَأْتُوا بِسُورَةٍ مِنْ مِثْلِهِ>> (Then produce a chapter like it). Everything that comes in the context of evidence is part of its being Light, because Light is that which repels darkness (zulm), and for this reason, it is called Light, since Light is repulsion.\n\nAs for its being Radiance (Diya'), this is due to the verses that unveil matters and realities (al-haqa'iq), such as His saying: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [new] manifestation), and <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ>> (We will attend to you, O prominent beings), and His saying: <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ>> (Whoever obeys the Messenger has obeyed Allah), and His saying: <<أَنْبِئُونِي بِأَسْمَاءِ هَؤُلَاءِ>> (Inform Me of the names of these), and His saying: <<لِمَا خَلَقْتُ بِيَدَيَّ>> (To that which I created with My [two] hands), and His saying: <<وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ>> (And you do not will except that Allah wills), and His saying: <<كُلٌّ مِنْ عِنْدِ اللَّهِ>> (All is from Allah), and His saying: <<فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا>> (And inspired it [with discernment of] its wickedness and its righteousness), and similar verses that indicate the course of realities, such as His saying: <<وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do).\n\nAs for its being Healing (Shifa'), this is like the Opening Chapter of the Book (Fatihat al-Kitab) and all verses of supplication.\n\nAs for its being Mercy (Rahma), this is due to what He has obligated upon Himself concerning the promise of good and glad tidings to His servants, such as His saying: <<لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ>> (Do not despair of the mercy of Allah), and His saying: <<كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ>> (Your Lord has decreed upon Himself mercy), and His saying: <<وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ>> (And My mercy encompasses all things), and every verse of hope.\n\nAs for its being Guidance (Huda), this is every decisive verse (Muhkama) and every text (nass) mentioned in the Qur'an that does not admit possibility and is understood only by its apparent meaning at first glance, such as His saying: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me), and His saying: <<وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ>> (And there is for you in legal retribution [saving of] life), and His saying: <<مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى إِلَّا مِثْلَهَا>> (Whoever comes with a good deed will have ten times the like thereof, and whoever comes with an evil deed will not be recompensed except with the like of it), and His saying: <<فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ>> (But whoever pardons and makes reconciliation—his reward is due from Allah), and similar verses whose abundance cannot be enumerated.\n\nAs for its being a Reminder (Dhikr), this is due to the verses of admonition (i'tibar) and the stories of nations destroyed due to their disbelief, such as the story of the people of Noah, 'Ad, Thamud, the people of Lot, the dwellers of the wood (Aykah), and the dwellers of the well (al-Rass).\n\nAs for its being Arabic (Arabi), this is due to the beauty of its composition, the clarity of the decisive from the allegorical, and the repetition of stories with changes in wording—by addition or omission—while fulfilling the required meaning in definition and information, along with conciseness of expression. Examples include His saying: <<يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ>> (They think every shout is against them), and His saying: <<مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا>> (They did not present it to you except for argument), and His saying: <<يَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ وَقِيلَ بُعْدًا لِلْقَوْمِ الظَّالِمِينَ>> (O earth, swallow your water, and O sky, withhold [your rain]. And the water subsided, and the matter was concluded, and it rested on [Mount] Judi. And it was said, \"Away with the wrongdoing people\"), and His saying: <<وَأَوْحَيْنَا إِلَى أُمِّ مُوسَى أَنْ أَرْضِعِيهِ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ>> (And We inspired to the mother of Moses, \"Suckle him; but when you fear for him, cast him into the river and do not fear nor grieve. Indeed, We will return him to you and will make him one of the messengers\"). All of this is in a single verse containing two glad tidings and two commands with beneficial knowledge and clarification through a glad tiding from Allah.\n\nAs for its being Clear/Manifest (Mubin), this is due to what it clarifies concerning the attributes of the people of bliss and the people of misery, and the characteristics of the people of success from others, such as His saying: <<قَدْ أَفْلَحَ الْمُؤْمِنُونَ>> (The believers have certainly succeeded) to the end of the verses, and His saying: <<إِنَّ اللَّهَ اشْتَرَى مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ>> (Indeed, Allah has purchased from the believers their lives), and the verses of legal rulings (Ahkam), and every verse by which He clarifies a matter so that it may be known.\n\nFor this reason, He named it by all these names and made it Qur'an (Recitation/Gathering), meaning manifest and comprehensive of all these meanings, which are found only within it. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).\n\nThe Twenty-First Journey (al-Safar al-Hadi wa al-'Ishrun) is completed with the completion of this Chapter.",
    "ur": "باب نمبر تین سو پچیس: حقیقت محمدیہ (الحقیقۃ المحمدیۃ) میں قرآن کے مقام کی معرفت کے بیان میں\n\n> جمع (الجمع) ہر وقت معتبر ہے *** اور جمع میں وتر (الوتر) ایسا ہے جیسے اعداد میں احد (الأحد)\n>\n> یہ الٰہ ہی اسماء کو وتر (الوتر) کرنے والا ہے *** ننانوے ہیں، نہ کم ہوئے نہ زیادہ\n>\n> پس عین (العین) اسماء کا مجموعہ ہے اور اس کے لیے *** اس عدد کے سوا کوئی وتر (الوتر) نہیں جو ہم نے ذکر کیا\n>\n> پس وہاں فرد (فرد) کے سوا کچھ نہیں جو اسے معین کرتا ہے *** کثیر کی عین (عین الکثیر)، پس کسی ایک پر توجہ نہ دے\n>\n> اور اللہ وتر (الوتر) ہے، کوئی شے اسے کثیر نہیں کر سکتی *** ان علوم کے ساتھ جو اس نے تجھے رصد (مشاہدہ) میں عطا کیے\n>\n> پس انسان میں اللہ کے سوا کوئی مؤثر نہیں *** اور غیر وہاں ہے ہی نہیں، پس شہر کے مکین کا قصد کر\n>\n> وہ تجھے احسان کے ذریعے خیر عطا کرتا ہے جس کا وہ جود کرتا ہے *** تجھ پر، پس وہ وہی ہے جو اگر چاہے تو نہ پائے\n\n### [یہ کہ اللہ کے سوا ہر شے پاکیزہ اور منزہ ارواح ہیں]\n\nجان لے، اللہ تجھے سمجھ عطا کرے، کہ اللہ کے سوا ہر شے پاکیزہ اور منزہ ارواح ہیں جن کا موجد اور خالق وہی ہے، اور یہ ارواح مکان (مکان) اور متمکن (متمکن) میں تقسیم ہوتی ہیں۔ اور مکان (مکان) دو حصوں میں تقسیم ہوتا ہے: ایک مکان جسے سماء (آسمان) کہا جاتا ہے اور ایک مکان جسے ارض (زمین) کہا جاتا ہے۔ اور ان دونوں میں متمکن (متمکن) دو حصوں میں تقسیم ہوتا ہے: ایک وہ جو اس میں متمکن ہے اور ایک وہ جو اس پر متمکن ہے۔ پس جو اس میں متمکن ہے وہ اپنے مکان کی حیثیت سے ہوتا ہے، اور جو اس پر متمکن ہے وہ اپنے مکان کی حیثیت سے نہیں ہوتا۔ یہ اللہ کے سوا ہر شے کا احاطہ ہے۔ اور یہ سب حقیقت میں ارواح ہیں، اور حق (الحق) میں اجسام اور جواہر ہیں جن کے ذریعے مخلوق پیدا کی گئی۔ اور یہ ارواح تنزیہ (التنزیہ) میں مراتب پر ہیں جنہیں مقام (مکانۃ) کہا جاتا ہے۔ اور کوئی بھی اللہ تعالیٰ کی تنزیہ (التنزیہ) کرنے والا ایسا نہیں مگر اس کی تنزیہ اس کے مرتبے کے مطابق ہوتی ہے، کیونکہ وہ اپنے خالق کی تنزیہ صرف اسی حیثیت سے کرتا ہے جس حیثیت سے وہ خود ہے، کیونکہ وہ اپنے سوا کسی کو نہیں جانتا۔ پس یہ تنزیہ (التنزیہ) اسے اللہ کے ہاں ایک مقام (مکانۃ) عطا کرتا ہے جس کے ذریعے ہر موجود دوسرے سے ممتاز ہو جاتا ہے۔ اور یہ منزل متمکن (متمکن) ارواح کی تنزیہ پر مشتمل ہے نہ کہ مکانی (مکانیۃ) ارواح کی۔ اور ان منازل میں ایک منزل آئے گی جس میں ہم مکان (مکان) اور متمکن (متمکن) دونوں کی تنزیہ کا ذکر کریں گے۔ پس یہ منزل عالم کے نصف پر مشتمل تھی اس حیثیت سے کہ وہ منزہ ہے۔ پھر اللہ تعالیٰ نے اس منزہ پر مقام (مکانۃ) کے ساتھ رجوع کیا اس طرح کہ ذات حق (الحق) اس کا مجلیٰ (ظہور کی جگہ) بن گیا، پس اس نے اپنے آپ کو اور اپنے مرتبے کو دیکھا، اور اس نے اسی قدر تسبیح کی جس قدر اس نے دیکھا۔ پس وہ خود ہی تھا، کوئی اور نہیں۔ اور یہ اس لیے کہ ذات حق (الحق) نے اپنے اور اپنے بندوں کے درمیان عزت کا حجاب (حجاب العزۃ) ڈال دیا، پس تنزیہ (التنزیہ) اس کے پیچھے رک گئی۔ پس اسے معلوم ہوا کہ ذات حق (الحق) کے لیے اس کی مخلوق کی تنزیہ مناسب نہیں، اور یہ کہ عزت کا حجاب زیادہ حفاظت کرنے والا ہے اور اس کا قہر زیادہ غالب ہے۔ پھر اس نے اپنے سوا دوسرے عارفین باللہ کو دیکھا جو تنزیہ (التنزیہ) کرنے والے ہیں، سلب کی صفات کے ساتھ مراتب پر، اور ان سب نے اقرار کیا کہ وہ اپنی تنزیہ کی جگہ میں غلطی پر تھے، اور یہ کہ ان کی تنزیہ ان سے باہر نہیں نکلی۔ اور یہ اس حکمت کی وجہ سے تھا جو اس کی مخلوق میں سرایت کر گئی، پس وہ حکمت کی تنزیہ تھی، اور کچھ نہیں۔ اور اگر عزت کے حجاب (حجاب العزۃ) کا پردہ نہ ہوتا تو وہ یہ نہ جان پاتے۔ اور اسی حجاب سے عالم میں کفر ظاہر ہوا، اور معرفت (المعرفۃ) اس حجاب کے پیچھے کی خبر بن گئی، پس عالم میں ایمان (الایمان) پردے (الستر) اور مؤمن کے درمیان ظاہر ہوا۔ پس کافر جو کہ پردہ ڈالنے والا (الساتر) ہے، کفر کی وجہ سے زیادہ قریب ہے، کیونکہ پردہ ڈالنے والا اس شے کو بھی دیکھتا ہے جس پر پردہ ڈالا گیا ہے اور اس سے بھی جس سے پردہ ڈالا گیا ہے، اور یہ کافر کی صفت ہے۔ اور مؤمن اس پردے سے نیچے ہے، پس اس کا مقام حجاب ہے۔ اللہ تعالیٰ فرماتا ہے:\n**وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ**\n(اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے یا پردے کے پیچھے سے)۔\nاور ایمان (الایمان) خبر سے متعلق ہے، اور خبر کلام کی اقسام میں سے ہے۔\n\n### [یہ کہ اللہ سبحانہ نے اہل ستر کو غیب سے شہود کی طرف نکالا]\n\nپھر اس نے سبحانہ نے اہل ستر (اہل الستر) کو غیب (الغیب) سے شہود (الشہادۃ) کی طرف نکالا تاکہ اسے دونوں حالتوں کے درمیان جمع (الجمع) کا مقام حاصل ہو جائے، پس وہ دونوں زبانوں سے اس کی تنزیہ کرے اور اس کے لیے دونوں صفات ثابت کرے۔ اور اس کے گمان میں وہ نہ تھا جو ذات حق (الحق) نے اس کے ساتھ کیا، بلکہ وہ یہ خیال کرتا تھا کہ غیب (الغیب) شہود (الشہادۃ) کے مقام میں نہیں ہو سکتا، کیونکہ وہ جانتا تھا کہ غیب (الغیب) کی پناہ گاہ محفوظ ہے، جو اس میں ہے وہ معلوم نہیں ہو سکتا کہ اس تک پہنچا جا سکے، بلکہ اس کا مقام یہ ہے کہ اس کا شعور ہو مگر اس شعور شدہ شے کی تعیین نہ ہو۔ اور وہ اس بات سے غافل رہا کہ اللہ جو چاہتا ہے کرتا ہے، اور یہ کہ اس کے حق میں کوئی غیب (الغیب) نہیں، اور یہ کہ غیب (الغیب) کا ہونا صرف اضافی طور پر ہی صحیح ہے۔ پس جب اللہ کی طرف سے اس پر وہ ظاہر ہوا جو اس کے حساب میں نہ تھا، تو اسے معلوم ہوا کہ تمام امور اللہ کے ہاتھ میں ہیں، اور یہ کہ وہاں کوئی نہیں جو اپنے لیے کسی حکم کا مستحق ہو، بلکہ وہ اللہ ہے **الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ** (جس نے ہر چیز کو اس کی خلقت عطا کی)۔ اور جب اشیاء نے جان لیا کہ ان کے پاس اپنی ذات سے کچھ نہیں ہے، اور یہ کہ وہ اپنے موجد کی ذات کے تقاضے کے مطابق ہیں، اور یہ کہ احوال ان پر اس کے مطابق نئے ہوتے ہیں جس کا تقاضا اس کی حقائق کرتی ہیں جس کی طرف وہ منسوب ہیں، اور وہ اللہ تعالیٰ ہے، تو وہ خوفزدہ ہو گئیں کیونکہ وہ مستقبل میں ان کے بارے میں اللہ کے علم پر واقف نہ ہو سکیں۔ پس انہوں نے وہ سب کچھ چھوڑ دیا جس پر وہ اپنے نفس میں بھروسہ کرتی تھیں، اپنے خالق کے پاس جو کچھ ہے اس کے لیے۔ پس انہوں نے ایک نئی تخلیق سے ایک نئی تسبیح کی، اور اپنے آپ کو دیکھنے سے اس کی طرف دیکھنے کی طرف منتقل ہو گئیں جس کے ہاتھ میں ہر شے کی بادشاہت ہے۔ اور اگر یہ مقام نہ ہوتا جس میں اس نے انہیں کھڑا کیا اور انہیں قریب سے اپنی طرف نہ لوٹاتا، تو وہ انہیں دور سے پکارتا، پس ان کے لیے مدت طویل ہو جاتی اور راستے میں انہیں آفتیں اور رکاوٹیں پیش آتیں، کیونکہ مسافر اور اس کا مال قلت میں ہوتا ہے۔ پھر جب اللہ نے اشیاء کو اس مقام میں حاصل کر دیا، تو اس نے ان کے لیے معرفت (المعرفۃ) کے جھنڈوں میں سے ایک جھنڈا بلند کیا، اس علم نے انہیں عطا کیا کہ وہ ایک شق ہیں، اور وہ ہستی (الوجود) کے نصف پر ہیں، اور یہ کہ ہستی (الوجود) کا کمال ان کے ذریعے ہے، اور اگر وہ نہ ہوتیں تو ہستی (الوجود) اور علم میں کمال ظاہر نہ ہوتا۔ پس وہ نازاں ہوئیں اور ان کی شان ان کے نزدیک عظیم ہو گئی، اور انہیں معلوم نہ ہوا کہ ہستی (الوجود) کا کون سا حصہ ان کے لیے صحیح ہوا۔ پھر یہ بات ان پر نماز کی عبادت میں ظاہر ہوئی، جہاں ذات حق (الحق) نے اسے اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کیا۔ پس ان کا ناز اور بڑھ گیا۔ پھر جب انہوں نے آخری خبر سنی جو ان کے حال کے موافق تھی جس کا انہیں شعور نہ تھا، اس کے قول میں: \"پس اس کا نصف میرے لیے ہے\" اور اس نے کوئی قید نہیں لگائی، اور بندے کے نصف کے بارے میں فرمایا: \"اور اس کا نصف میرے بندے کے لیے ہے، اور میرے بندے کے لیے وہ ہے جو اس نے مانگا\"۔ اور سوال ذلت، فقر، حاجت اور مسکنت ہے، مگر یہ کہ بندے پر اس حجاب کے پیچھے سے وہ ظاہر ہوا جو وہ گمان نہیں کرتا تھا، اور وہ یہ کہ وہ ایسے مقام میں ہے جہاں ذات حق (الحق) اس سے پیچھے ہے، جیسا کہ اس کا قول ہے: **وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ** (اور اللہ انہیں ہر طرف سے گھیرے ہوئے ہے)۔ اور یہ اس لیے کہ وہ فرار کے حکم میں ہے جب اسے وہ چیز پیش آتی ہے جسے وہ اٹھانے کی طاقت نہیں رکھتا۔ پس اللہ نے اسے خبر دی کہ وہ اس کے پیچھے ہے، اور وہی ہے جو اسے پیش آتا ہے۔ پس اگر وہ اس سے بھاگتا ہے تو وہ اسی کی طرف بھاگتا ہے جہاں سے اسے شعور نہیں ہوتا، جیسا کہ وہ ایک دوسرے مقام میں ہوتا ہے جہاں اس کے لیے اس کے قول سے اولیت ہے: **مَا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا** (کوئی جاندار ایسا نہیں مگر وہ اس کی پیشانی پکڑے ہوئے ہے)۔ اور اس نے اپنی صفت بیان کی کہ وہ ہادی (ہدایت دینے والا) ہے، اور ہادی وہ ہوتا ہے جو قوم کا امام ہو تاکہ انہیں راستہ دکھائے، اور یہ اس کا قول ہے: **إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ** (بے شک میرا رب سیدھے راستے پر ہے)۔ **مَا كُنتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ** (تو نہیں جانتا تھا کہ کتاب کیا ہے اور نہ ایمان کیا ہے)۔ پس اشیاء ذات حق (الحق) کے ساتھ ایک رکاوٹ بن گئیں، پس اللہ تعالیٰ اشیاء سے آگے بڑھا تاکہ انہیں اس کی طرف ہدایت دے جس میں ان کی سعادت ہے، اور ان سے پیچھے ہٹا تاکہ انہیں اس سے محفوظ رکھے جو انہیں اچک لے، اور وہ عدم (العدم) ہے۔ کیونکہ عدم (العدم) انہیں طلب کرتا ہے جیسا کہ ہستی (الوجود) انہیں طلب کرتی ہے، اور وہ دونوں حکموں کو قبول کرنے کی جگہ ہیں، ان میں رکاوٹ کی طاقت نہیں مگر لطیف (اللطیف) کے لطف سے۔ پھر جب اللہ تعالیٰ نے انہیں اس پر مطلع کیا، تو انہیں اللہ کے جلال کا وہ علم حاصل ہوا جس سے وہ اس کی تسبیح کرتے ہیں اور اس کی حمد و ثنا کرتے ہیں، جو وہ اس مشہد سے پہلے نہیں جانتے تھے۔ جیسا کہ نبی اکرم ﷺ نے مقام محمود (المقام المحمود) کے بارے میں قیامت کے دن فرمایا:\n**\"فأحمده بمحامد لا أعلمها الآن يعطيه إياها ذلك المقام بالحصول فيه إلها ما يلهمه الله فيثني عليه بها\"**\n(پس میں اس کی ایسی حمد کروں گا جو میں اب نہیں جانتا، وہ مقام اسے اس میں حاصل ہونے سے عطا کرے گا، وہ الٰہ جو اسے الہام کرے گا، پس وہ ان کے ذریعے اس کی ثنا کرے گا)۔\nاور اسی طرح دنیا اور آخرت میں ہر منزل اور مرتبہ میں، جو لامتناہی ہے، اس میں ہر منزل میں اس کی خاص ثنا ہے۔ پس جب وہ اس کی تسبیح کرتا ہے، تو وہ ثنا اسے ایک اور علم وراثت میں دیتی ہے جو اس کے پاس نہ تھا، اور وہ اذن الٰہی (الأذن الإلہی) کا علم ہے جس سے اللہ نے عیسیٰ کے ہاتھ سے پرندہ پیدا کیا، اور اسی سے عیسیٰ نے اس میں پھونکا تو وہ پرندہ بن گیا، اور اسی سے اس نے مادر زاد اندھے اور کوڑھی کو شفا دی اور مردوں کو زندہ کیا۔ اور یہ ایک شریف علم ہے جسے ابو یزید بسطامی اور ذوالنون مصری نے متحقق کیا۔ پس ابو یزید نے غیر ارادی طور پر ایک چیونٹی کو مار ڈالا، جب اسے معلوم ہوا تو اس نے اس میں پھونکا تو وہ اللہ کے حکم سے زندہ ہو کر کھڑی ہو گئی۔ اور ذوالنون کے پاس وہ بڑھیا آئی جس کے بیٹے کو مگرمچھ لے گیا تھا اور اسے نیل میں لے گیا تھا، تو اس نے مگرمچھ کو پکارا تو اس نے اسے اپنے پیٹ سے زندہ نکال کر اس کے حوالے کر دیا، جیسا کہ مچھلی نے یونس کو نکالا تھا۔ پس جب اس پر یہ علم منکشف ہوتا ہے، تو وہ سبحانہ کی اس طرح حمد و ثنا کرتا ہے جو اس مقام کے لیے مناسب ہے، اور یہیں سے اسے ان لوگوں پر جھانکنے کا موقع ملتا ہے جو اس مقام سے باہر نکل گئے ہیں، پس وہ باہر نکلنے والوں کا حال جانتا ہے، کیونکہ یہ منزل جامع (الجامع) منزل ہے، اور اسی لیے اسے منزل قرآن (منزل القرآن) کہا گیا ہے۔ پس جب اس منزل کا مالک اس مقام سے کون (الکون) کی طرف اترتا ہے، تو دشمن اپنے لشکروں کے ساتھ اس کے سامنے آ جاتا ہے، اور وہ ابلیس ہے جو طبعاً اس کا دشمن ہے، خاص طور پر بیٹوں کے لیے، کیونکہ وہ تمام وجوہ سے مخالف ہے، برخلاف آدم سے اس کی دشمنی کے، کیونکہ اس نے آدم اور اپنے درمیان خشکی کو جمع کیا، کیونکہ مٹی اور آگ کے درمیان ایک جامع (جامع) ہے، اور اسی جامع کی وجہ سے اس نے اسے سچ مانا جب اس نے اللہ کی قسم کھا کر کہا کہ وہ اس کا خیر خواہ ہے، اور بیٹوں نے اسے سچ نہیں مانا، کیونکہ وہ بیٹوں کے لیے تمام وجوہ سے مخالف ہے، اور یہ اس کا قول ہے کہ بیٹوں کو پانی سے پیدا کیا گیا، اور پانی آگ کا مخالف ہے۔ پس بیٹوں کی دشمنی باپ کی دشمنی سے زیادہ شدید تھی۔ اور اللہ نے اس دشمن کو آنکھوں کے ادراک سے محجوب کر دیا، اور اس کے لیے شریعت کے ذریعے دل میں نشانیاں مقرر کیں جن سے وہ اسے پہچانتا ہے، جو اس کے لیے بصارت کے ادراک کا مقام رکھتی ہیں، پس وہ ان نشانیوں کے ذریعے اس کے القاء سے محفوظ رہتا ہے۔ اور اللہ نے اس انسان کی مدد اس فرشتے کے ذریعے کی جسے اس کے مقابلے میں غیب (الغیب) کے مقابلے میں غیب (الغیب) بنا دیا۔ پس جب تک وہ انسان کے ظاہر میں اثر انداز نہیں ہوتا اور فرشتہ نفس کی مدد سے اس پر غالب رہتا ہے، تو نفس کے لیے دو اجر ہوتے ہیں: اس کا اپنا اجر اور مددگار (فرشتے) کا اجر، کیونکہ فرشتہ بدلہ قبول نہیں کرتا اور نہ اس کا مقام بڑھتا ہے اور نہ گھٹتا ہے۔ اور اگر وہ انسان کے ظاہر میں اثر انداز ہوتا ہے، تو فرشتہ اس پر غمگین ہوتا ہے اور اس انسان کے لیے استغفار کرتا ہے، اور وہ (یعنی فرشتہ) غم کے بدلے کا محل نہیں ہے، پس وہ بدلہ انسان پر لوٹتا ہے۔ پس وہ دونوں حالتوں میں فائدہ میں ہے: اطاعت اور معصیت میں۔ اور ایمان (الایمان) فرشتے کو مضبوط کرتا ہے، اور اسی لیے فرشتہ اس کے لیے استغفار کرتا ہے۔\n\n### [یہ کہ قرآن جامع ہے جسے تمام حقائق الٰہیہ نے کھینچا، پس اس کا مقام اعتدال ہے]\n\nاور جان لے کہ جب قرآن جامع (جامع) تھا، تو تمام حقائق الٰہیہ (الحقائق الإلہیۃ) اور کونیہ (الکونیۃ) نے اسے برابر کھینچا، پس اس میں کوئی کجی یا تحریف نہ تھی۔ پس اس کا مقام اعتدال (الاعتدال) ہے۔ اور اعتدال (الاعتدال) ہستی (الوجود) کو موجود پر باقی رکھنے کا مقام ہے، نہ کہ ایجاد (الإیجاد) کا مقام، کیونکہ ایجاد (الإیجاد) صرف انحراف اور میلان سے ہوتی ہے، اور ذات حق (الحق) کے حق میں اسے ارادی توجہ (توجہ إرادی) کہا جاتا ہے، اور یہ اس کا قول ہے: **إِذَا أَرَدْنَاهُ** (جب ہم اس کا ارادہ کرتے ہیں)۔ اور جب اس کا مقام اعتدال (الاعتدال) تھا، تو اس کے لیے دوام اور بقا تھی، پس اس کے لیے تکوین (تکوین) اور کون (کون) کی بقا ہے۔ اور اگر وہ اپنے مقام سے نیچے اترتا، تو اعتدال (الاعتدال) سے انحراف کی طرف اترتا، اور یہ اس کا قول ہے: **وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ** (اور اگر کوئی ایسا قرآن ہوتا جس کے ذریعے پہاڑ چلائے جاتے)۔ اور اس کا قول: **لَوْ أَنزَلْنَا هَذَا الْقُرْآنَ** (اگر ہم اس قرآن کو نازل کرتے) یعنی اپنے مقام سے **عَلَى جَبَلٍ لَّرَأَيْتَهُ خَاشِعًا مُّتَصَدِّعًا** (پہاڑ پر، تو تو اسے دیکھتا کہ وہ جھک جاتا، پھٹ جاتا) یعنی پہاڑ، پس وہ اپنی صورت کو برقرار نہ رکھ پاتا کیونکہ وہ اپنے مقام سے نیچے اترا۔ اور جب یہ اس کا مقام تھا اور حقائق نے اسے برابر کھینچا، تو جس پر اسے نازل کیا گیا وہ **رَحْمَةً لِّلْعَالَمِينَ** (تمام جہانوں کے لیے رحمت) تھا، کیونکہ رحمت **وَسِعَتْ كُلَّ شَيْءٍ** (ہر چیز پر محیط ہے)، پس ہر شے نے اسے ذاتی طلب کے ساتھ طلب کیا۔\nجب رسول اللہ ﷺ نے قنوت میں ان لوگوں پر بددعا کی جن پر آپ نے بددعا کی تھی، تو آپ کو اس پر عتاب کیا گیا، اور کہا گیا: **وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ** (اور ہم نے آپ کو نہیں بھیجا مگر تمام جہانوں کے لیے رحمت بنا کر)۔\nیعنی تاکہ آپ ان پر رحم کریں، کیونکہ آپ صاحب قرآن ہیں، اور قرآن اس بات کی گواہی دیتا ہے کہ میں نے آپ کو صرف رحمت بنا کر بھیجا ہے، اور یہ کہ **رَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ** (میری رحمت ہر چیز پر محیط ہے)۔ پس یہ احسان اور وجوب کے درمیان ہے۔ پس میرے بندوں میں سے کچھ ایسے ہیں جنہیں وہ وجوب کے حکم سے گھیر لیتی ہے، اور کچھ ایسے ہیں جنہیں وہ احسان کے حکم سے گھیر لیتی ہے۔ اور اصل احسان، فضل اور انعام الٰہی ہے، کیونکہ کون (الکون) موجود نہ تھا کہ اس کا کوئی استحقاق ہوتا۔ پس اس کا ظہور صرف عین احسان (عین المنة) سے ہوا، اور اسی طرح وہ امر جس سے اس نے رحمت کا استحقاق حاصل کیا، وہ بھی عین احسان سے تھا۔ پس جب قرآن اپنے مقام سے نیچے اترتا ہے، تو وہ اس کا کلام ہے، اور اس کا کلام ایک ہی نسبت پر ہے اس تقسیم کے لحاظ سے جسے کلام قبول کرتا ہے۔ پس وہ اسے نازل کرتا ہے اور اس میں نسبتوں میں اعتدال (الاعتدال) کی حقیقت ہوتی ہے، اور یہ ہر تلاوت کرنے والے کے نزدیک ہمیشہ نیا ہوتا ہے۔ پس اس کا نزول صرف اسی کے مناسب ہوتا ہے جو اعتدال میں ہو۔ پس وہ خواہش (الھوی) سے پاک ہے۔ اور اسی لیے محمد ﷺ کے بارے میں کہا گیا: **وَمَا يَنطِقُ عَنِ الْهَوَىٰ** (اور وہ اپنی خواہش سے نہیں بولتے)۔ اور دوسرے رسولوں اور خلفاء کو خواہش کی پیروی سے منع کیا گیا۔ پس وہ اس مرتبے میں اس کے مقام تک نہیں اترا جس کے بارے میں خبر دی گئی کہ وہ خواہش سے نہیں بولتا۔ اور ہر کوئی اپنے نزول کو محسوس نہیں کرتا، کیونکہ اس کی روح اپنی طبیعت میں مشغول ہوتی ہے، پس وہ اس پر طبعی حجاب کے پیچھے سے نازل ہوتا ہے، پس وہ اس میں لذت کے طور پر اثر انداز نہیں ہوتا۔ اور یہ نبی اکرم ﷺ کا قول ہے ان تلاوت کرنے والوں کے حق میں:\n**\"إنهم يقرءون القرآن لا يجاوز حناجرهم\"**\n(وہ قرآن پڑھتے ہیں جو ان کے حلق سے نیچے نہیں اترتا)۔\nپس یہ قرآن زبانوں پر نازل ہوا ہے، دلوں پر نہیں۔ اور ذوق (الذوق) کے بارے میں فرمایا: **نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ** (اسے روح الامین نے آپ کے دل پر نازل کیا)۔ پس وہی ہے جو اس کے نزول کی ایسی مٹھاس پاتا ہے جس کی قدر نہیں کی جا سکتی، جو ہر لذت سے بڑھ کر ہے۔ پس جب وہ اسے پاتا ہے، تو وہی ہے جس پر نیا قرآن نازل ہوا جو کبھی پرانا نہیں ہوتا۔ اور دونوں نزولوں میں فرق یہ ہے کہ جس کے دل پر قرآن نازل ہوتا ہے، وہ فہم (الفہم) کے ساتھ نازل ہوتا ہے، پس وہ جانتا ہے کہ وہ کیا پڑھ رہا ہے، اگرچہ وہ اس کی زبان میں نہ ہو، اور وہ ان معانی کو جانتا ہے جو وہ پڑھ رہا ہے، اگرچہ وہ الفاظ قرآن کے علاوہ میں ان معانی کو نہ جانتا ہو، کیونکہ وہ اس کی زبان نہیں ہے۔\nاور وہ انہیں اپنی تلاوت میں جانتا ہے، اگر وہ ان لوگوں میں سے ہو جن پر تلاوت کے وقت قرآن دل پر نازل ہوتا ہے۔ اور جب قرآن کا مقام اور منزل وہ ہے جو ہم نے ذکر کیا، تو ہر موجود اس میں وہ پاتا ہے جو وہ چاہتا ہے۔ اور اسی لیے شیخ ابو مدین کہا کرتے تھے: \"مرید اس وقت تک مرید نہیں ہوتا جب تک وہ قرآن میں وہ سب کچھ نہ پا لے جو وہ چاہتا ہے\"۔ اور ہر کلام جس میں یہ عموم نہ ہو، وہ قرآن نہیں ہے۔ اور جب اس کا نزول دل پر ہوا، اور دل ایک صفت الٰہیہ ہے جو اپنے موصوف سے جدا نہیں ہوتی، تو اس پر اس کے کلام کے سوا کوئی اور نازل نہیں ہو سکتا تھا۔ پس ذات حق (الحق) نے ذکر کیا کہ اس کے مؤمن بندے کا دل اسے گھیر لیتا ہے۔ پس مؤمن کے دل میں قرآن کا نزول ذات حق (الحق) کا اس میں نزول ہے، پس ذات حق (الحق) اس بندے سے اس کے راز میں اس کے راز سے کلام کرتا ہے، اور یہ ان کا قول ہے: \"میرے دل نے میرے رب سے بلا واسطہ بیان کیا\"۔ پس تلاوت کرنے والے کو تالی (تالی) اس لیے کہا گیا کہ کلام ایک دوسرے کے پیچھے آتا ہے، اور اس کا تتابع اس پر غایت میں حر (حر) کا تقاضا کرتا ہے، اور وہ \"من والی\" (جس نے پیروی کی) سے ہے، پس وہ ایک چیز سے دوسری چیز کی طرف اترتا ہے۔ اور جب دل عالم اعلیٰ (العالم الأعلیٰ) سے تھا اور زبان عالم اسفل (العالم الأنزل) سے تھی، اور ذات حق (الحق) کا مقام بندے کا دل تھا، اور وہ متکلم ہے، اور وہ دل میں عین (العین) میں واحد ہے، اور حروف زبان کے عالم سے ہیں، پس زبان نے آیات کو الگ کیا اور ایک دوسرے کے پیچھے تلاوت کی، پس انسان کو اس کی زبان کی حیثیت سے تالی (تالی) کہا جاتا ہے، کیونکہ وہ اس چیز کو مفصل کرتا ہے جو مجمل نازل کی گئی تھی۔ اور قرآن نازل شدہ کتابوں اور صحیفوں میں عالم میں انسان کے مقام پر ہے، کیونکہ وہ کتابوں کا مجموعہ ہے اور انسان عالم کا مجموعہ ہے۔ پس وہ دونوں بھائی ہیں، اور میرا مطلب اس سے انسان کامل (الإنسان الکامل) ہے۔ اور یہ صرف اسی کے لیے ہے جس پر قرآن اس کی تمام جہات اور نسبتوں سے نازل ہوا، اور اس کے ورثاء میں سے جو اس کے سوا ہیں، ان پر صرف اس کے کندھوں کے درمیان سے نازل ہوا، پس وہ غیب (الغیب) کے پیچھے سے اس کے سینے میں ٹھہر گیا، اور یہ کامل وراثت ہے۔ ابو یزید کے بارے میں حکایت کی گئی ہے کہ وہ اس وقت تک نہیں مرے جب تک انہوں نے قرآن کو حفظ نہ کر لیا۔ اور رسول اللہ ﷺ نے اس شخص کے بارے میں فرمایا جسے قرآن دیا گیا:\n**\"إن النبوة أدرجت بين جنبيه\"**\n(بے شک نبوت اس کے پہلوؤں کے درمیان لپیٹ دی گئی ہے)۔\nاور یہ انبیاء اور پیروکار اولیاء کے درمیان فرق ہے۔ لیکن جس کے پہلوؤں کے درمیان نبوت لپیٹ دی گئی اور اسے قرآن غیب (الغیب) کے پیچھے سے آیا، اسے اپنے سامنے کی طرح اپنے پیچھے سے بھی رؤیت (دیکھنے کی صلاحیت) عطا کی گئی، کیونکہ قرآن صرف بالمشافہ (مواجہۃ) نازل ہوتا ہے۔ پس نبی ﷺ کے لیے یہ دو وجوہ سے ہے: ایک معتاد (عام) وجہ اور ایک غیر معتاد (غیر معمولی) وجہ۔ اور وارث کے لیے یہ غیر معتاد وجہ سے ہے، پس اسے اصل کے حکم سے ظہر (پیٹھ) کہا گیا، اور فرع کے حکم سے وجہ (چہرہ) کہا گیا۔ اور جب ہم نے اس کا ذوق (الذوق) چکھا، تو ہم نے اپنے لیے کسی ایک جہت کو دوسری سے ممتاز نہیں پایا، اور یہ ہمیں اچانک آیا، پس ہمیں معلوم نہ ہوا کہ معاملہ کیسا ہے مگر اس کے بعد۔ پس جو قرآن کے ساتھ اس حیثیت سے کھڑا ہوا کہ وہ قرآن (جمع کرنے والا) ہے، وہ جمع (الجمع) کی احدیت (أحدیۃ) والی ایک آنکھ والا تھا، اور جو اس کے ساتھ اس حیثیت سے کھڑا ہوا کہ وہ مجموعہ ہے، تو وہ اس کے حق میں فرقان (الفرقان) تھا، پس اس نے ظہر (پیٹھ)، بطن (پیٹ)، حد (حد) اور مطلع (مطلع) کا مشاہدہ کیا، اور کہا کہ ہر آیت کا ظہر، بطن، حد اور مطلع ہے۔ اور وہ دوسرا یہ نہیں کہتا، اور ذوق (الذوق) مختلف ہے۔ اور جب ہم نے اس دوسرے امر کا ذوق چکھا، تو نزول فرقانی (فرقان) تھا، پس ہم نے کہا کہ یہ حلال ہے اور یہ حرام ہے اور یہ مباح ہے، اور مشرب (پینے کی جگہیں) متنوع ہو گئے اور مذاہب مختلف ہو گئے اور مراتب ممتاز ہو گئے، اور اسماء الٰہیہ (الأسماء الإلہیۃ) اور آثار کونیہ (الآثار الکونیۃ) ظاہر ہو گئے، اور عالم میں اسماء اور الٰہ (معبود) کثرت سے ہو گئے، پس فرشتوں، ستاروں، طبیعت، ارکان، حیوانات، نباتات، پتھروں، انسانوں اور جنوں کی عبادت کی گئی، یہاں تک کہ جب ایک (رسول) وحدانیت (الوحدانیۃ) لے کر آیا تو انہوں نے کہا: **أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا إِنَّ هَذَا لَشَيْءٌ عُجَابٌ** (کیا اس نے تمام معبودوں کو ایک ہی معبود بنا دیا؟ بے شک یہ تو بڑی عجیب بات ہے)۔ اور حقیقت میں تعجب اس پر نہیں جو توحید بیان کرتا ہے، بلکہ تعجب اس پر ہے جو بغیر دلیل اور برہان کے کثرت بیان کرتا ہے۔ اور اسی لیے فرمایا: **وَمَن يَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ** (اور جو اللہ کے ساتھ کسی دوسرے معبود کو پکارتا ہے، اس کے پاس اس کی کوئی دلیل نہیں)۔ اور یہ اللہ کی طرف سے ان لوگوں پر رحمت ہے جن پر کثرت کے اثبات میں کوئی شبہہ لاحق ہوا، پس انہوں نے اعتقاد کیا کہ یہ برہان ہے، پس اللہ ان سے درگزر کرے گا، کیونکہ انہوں نے غور و فکر میں اپنی پوری کوشش کی اور ان کی قوت نے اس کے سوا کچھ نہیں دیا۔ پس نظر و فکر کرنے والے مشرکین کے لیے اللہ کی معافی میں اس آیت سے زیادہ امید افزا کوئی چیز نہیں۔ اور ہم نے کہا ہے کہ عالم میں کوئی اثر نہیں مگر وہ کسی حقیقت الٰہیہ (حقیقۃ إلہیۃ) سے منسوب ہے۔ پس الٰہی حقائق سے معبود کیسے متعدد ہو گئے اور ان کی عبادت کی گئی؟ پس جان لے کہ یہ اسماء (الأسماء) کی وجہ سے ہے۔ کیونکہ اللہ نے ان میں وسعت دی، پس فرمایا: **اعْبُدُوا اللَّهَ** (اللہ کی عبادت کرو)، اور فرمایا: **اتَّقُوا اللَّهَ رَبَّكُمْ** (اپنے رب اللہ سے ڈرو)، اور فرمایا: **وَاسْجُدُوا لِلرَّحْمَٰنِ** (اور رحمن کو سجدہ کرو)، اور فرمایا: **قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَٰنَ أَيًّا مَّا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ** (کہو: اللہ کو پکارو یا رحمن کو پکارو، تم جس نام سے بھی پکارو، تو اسی کے لیے بہترین نام ہیں)۔ پس یہ امر ان کے نزدیک پہلے سے زیادہ مبہم ہو گیا، کیونکہ اس نے یہ نہیں کہا کہ اللہ کو پکارو یا رحمن کو پکارو، تم جس نام سے بھی پکارو تو عین (العین) ایک ہے، اور یہ اس کے دو نام ہیں۔ یہ وہ نص ہے جو اشکال کو دور کرتی ہے۔ پس اللہ نے یہ اشکال صرف مشرکین پر رحمت کے طور پر باقی رکھا جو نظر و فکر والے ہیں جنہوں نے شبہہ کی بنا پر شرک کیا، اور وعید مقلدین کے حق میں باقی رہی، جہاں اللہ نے انہیں نظر و فکر کے اہل بنایا اور انہوں نے نظر و فکر نہیں کی اور نہ عبرت حاصل کی۔ کیونکہ یہ علم تقلید (تقلید) نہیں ہے۔ پس نظر و فکر کے ساتھ غلطی کرنے والا تقلید کے ساتھ درست ہونے والے سے زیادہ اولیٰ اور اعلیٰ ہے، مگر ذات حق (ذات الحق) میں، کیونکہ مخلوق کو اس میں فکری نظر کے حکم سے تصرف نہیں کرنا چاہیے، بلکہ\nوہ خبر الٰہی (الخبر الإلہی) کے ساتھ ہے اس میں جو وہ اپنے بارے میں خبر دیتا ہے، اس پر قیاس نہیں کیا جائے گا اور نہ اس میں اضافہ یا کمی کی جائے گی اور نہ اس کی تاویل کی جائے گی اور نہ اس قول سے کسی معین جہت کا قصد کیا جائے گا، بلکہ معنی کو سمجھا جائے گا اور نسبت سے ناواقف رہا جائے گا اور نسبت کا علم اللہ کے علم کی طرف لوٹایا جائے گا۔ پس جس نے اس امر کو اس طرح کی نظر سے دیکھا، تو اس نے اپنے ساتھی کے لیے عذر قائم کیا، اور وہ **رَحْمَةً لِّلْعَالَمِينَ** (تمام جہانوں کے لیے رحمت) تھا۔\n\n### [یہ کہ شب قدر نصف شعبان کی رات ہے]\n\nپھر جان لے کہ اللہ نے کتاب کو فرقان (فرقان) کے طور پر شب قدر (لیلۃ القدر) میں، جو نصف شعبان کی رات ہے، نازل کیا، اور اسے قرآن (قرآن) کے طور پر ماہ رمضان میں نازل کیا، یہ سب آسمان دنیا (السماء الدنیا) تک۔ اور وہاں سے یہ تئیس سالوں میں فرقان (فرقان) کے طور پر، ٹکڑوں میں، آیات اور سورتوں کے ساتھ نازل ہوا تاکہ منازل معلوم ہوں اور مراتب واضح ہوں۔ پس اس کے شعبان کے مہینے میں زمین پر نزول سے اسے فرقان (فرقان) کے طور پر تلاوت کیا جاتا ہے، اور اس کے رمضان کے مہینے میں نزول سے اسے قرآن (قرآن) کے طور پر تلاوت کیا جاتا ہے۔ پس ہم میں سے کچھ وہ ہیں جو اس کے ذریعے تلاوت کرتے ہیں، پس وہ قرآن (قرآن) ہے، اور ہم میں سے کچھ وہ ہیں جو اپنے نفس سے تلاوت کرتے ہیں، پس وہ فرقان (فرقان) ہے۔ اور ایک ہی عین (عین) میں اور ایک ہی حال میں دونوں کے ذریعے تلاوت کرنا صحیح نہیں ہے۔ پس جب تو اس کے پاس ہو گا تو تو اپنے پاس ہو گا، اور جب تو اپنے پاس ہو گا تو تو اس کے پاس نہیں ہو گا، کیونکہ **وَكُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ** (اور ہر چیز اس کے پاس ایک اندازے سے ہے)۔ اور وہ ایسا نہیں ہے، بلکہ وہ ہر شے کے ساتھ ہے اور اس کے پاس ہے جو اسے ذکر (الذکر) کے ساتھ یاد کرتا ہے، اور کچھ نہیں، کیونکہ وہ ذاکرین کا ہم نشین ہے۔\n\nجان لے کہ اللہ نے اس قرآن کو دو سے پانچ حروف تک کے منظوم حروف کے طور پر نازل کیا، جو متصل اور مفرد ہیں۔ اور اسے کلمات، آیات، سورتیں، نور، ہدایت، ضیاء، شفا، رحمت، ذکر، عربی، مبین، حق، کتاب، محکم اور متشابہ اور مفصل بنایا۔ اور ان اسماء میں سے ہر نام اور صفت کا ایک معنی ہے جو دوسرے کا نہیں ہے، اور یہ سب اللہ کا کلام ہے۔ اور جب یہ ان حقائق اور ان جیسی چیزوں کا جامع تھا، تو یہ قرآن (قرآن) کے نام کا مستحق ہوا۔ پس ہم اس کی بعض صفات کے مراتب کا ذکر کرتے ہیں تاکہ اہل اللہ اس کے مقام کو جانیں۔\n\nان میں سے اس کا حروف ہونا ہے۔ اور اس نام سے دو امور سمجھے جاتے ہیں: ایک امر جسے قول، کلام اور لفظ کہا جاتا ہے، اور دوسرا امر جسے کتابت، رقم اور خط کہا جاتا ہے۔ اور قرآن لکھا جاتا ہے، پس اس کے لیے رقم کے حروف ہیں، اور اسے بولا جاتا ہے، پس اس کے لیے لفظ کے حروف ہیں۔ پس اس کا منطوق حروف ہونا کس کی طرف لوٹتا ہے؟ کیا اللہ کے کلام کی طرف جو اس کی صفت ہے، یا اس کی طرف جس سے ترجمہ کیا گیا ہے؟ پس جان لے کہ اللہ نے ہمیں اپنے نبی ﷺ کے ذریعے خبر دی ہے کہ وہ سبحانہ قیامت کے دن مختلف صورتوں میں ظہور (التجلی) کرے گا، پس وہ پہچانا جائے گا اور انکار بھی کیا جائے گا۔ اور جس کی حقیقت صورتوں میں ظہور (التجلی) کو قبول کرتی ہے، تو یہ بعید نہیں کہ کلام ان حروف کے ساتھ ہو جن کا تلفظ کیا جاتا ہے اور جسے اللہ کا کلام کہا جاتا ہے، ان صورتوں میں سے بعض کے لیے، جیسا کہ اس کے جلال کے لائق ہے۔ پس جس طرح ہم کہتے ہیں کہ اس نے ایک صورت میں ظہور (التجلی) کیا جیسا کہ اس کے جلال کے لائق ہے، اسی طرح ہم کہتے ہیں کہ اس نے آواز اور حرف کے ساتھ کلام کیا جیسا کہ اس کے جلال کے لائق ہے۔ اور ہم اسے فرح (خوشی)، ضحک (ہنسنا)، عین (آنکھ)، قدم (پاؤں)، ید (ہاتھ)، یمین (دایاں ہاتھ) اور دیگر چیزوں پر محمول کرتے ہیں جو کتاب و سنت میں وارد ہوئی ہیں، جن پر ایمان لانا واجب ہے معقول معنی پر، بغیر کیفیت اور تشبیہ کے۔ کیونکہ وہ فرماتا ہے: **لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس کی مثل کوئی چیز نہیں)، پس اس نے مماثلت کی نفی کی مع معنی کو سمجھنے اور نسبت سے ناواقف رہنے کے۔ پس جب حروف منظم ہوتے ہیں تو انہیں کلمہ کہا جاتا ہے، اور جب کلمات منظم ہوتے ہیں تو انہیں آیت کہا جاتا ہے، اور جب آیات منظم ہوتی ہیں تو انہیں سورت کہا جاتا ہے۔ پس جب اس نے اپنی صفت بیان کی کہ اس کا نفس ہے جیسا کہ اس کے جلال کے لائق ہے، اور اپنی صفت آواز اور قول سے بیان کی، اور فرمایا: **فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ** (پس اسے پناہ دے تاکہ وہ اللہ کا کلام سن لے)، تو نفس کو آواز کہا گیا، اور آواز سے اس کا انقطاع جہاں وہ منقطع ہوتا ہے، اسے حرف کہا گیا۔ اور یہ سب کچھ معقول ہے اس سے جو الٰہی خبر ہمیں پہنچی ہے، مع مماثلت اور تشبیہ کی نفی کے، جیسے دیگر صفات۔ اور جب اس نے اپنی صفت صورت سے بیان کی، تو ہم نے اس کے قول کا معنی جانا کہ وہ **الظَّاهِرُ وَالْبَاطِنُ** (ظاہر اور باطن) ہے۔ پس باطن ظاہر کے لیے غیب (الغیب) ہے، اور ظاہر باطن کے لیے شہود (الشہود) ہے۔ اور اس نے اپنی صفت بیان کی کہ اس کا نفس ہے، پس یہ اس کا غیب (الغیب) سے نکلنا ہے، اور حروف کا ظہور شہود (الشہود) ہے۔ اور حروف ان معانی کے لیے ظروف ہیں جو ان کی ارواح ہیں، اور جو باہمی اتفاق کے حکم سے ان پر دلالت کے لیے وضع کیے گئے ہیں۔ اور اللہ تعالیٰ نے فرمایا: **وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ** (اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان کے ساتھ تاکہ وہ ان کے لیے واضح کرے)۔ اور اللہ کی طرف سے اپنے بندوں کے لیے اس وضاحت سے زیادہ بلیغ کوئی چیز نہیں۔ پس ان عبارات سے وہی سمجھنا ضروری ہے جس پر وہ اس زبان میں دلالت کرتی ہیں، اس کے مطابق جو کون (الکون) کے بارے میں خبر دی گئی ہے، پس اس کلام سے جس معنی پر دلالت ہوتی ہے وہ معلوم ہوتا ہے اور نسبت معلوم ہوتی ہے۔ اور جو اللہ کے بارے میں خبر دی گئی ہے، اس کلام سے جس معنی پر دلالت ہوتی ہے وہ معلوم ہوتا ہے اور نسبت سے ناواقف رہا جاتا ہے، کیونکہ عقلی دلیل اور شرعی دلیل نے مماثلت کی نفی کی ہے۔ پس جب تو نے اس بات کو متحقق کر لیا جو ہم نے مقرر کی، تو یہ واضح ہو گیا کہ اللہ کا کلام یہی تلاوت کیا جانے والا، سنا جانے والا، تلفظ کیا جانے والا ہے جسے قرآن، تورات، زبور اور انجیل کہا جاتا ہے۔ پس اس کے حروف اس کے کلمات کے مراتب کو ان کے مفردات کے لحاظ سے معین کرتے ہیں۔ پھر کلمہ کے لیے اس کی مجموعیت کے لحاظ سے ایک معنی ہے جو کلمہ کے انفرادی حروف کا نہیں ہے۔ پس کلمہ کا سننے والے کے نفس میں ایک اثر ہوتا ہے، اسی لیے اسے عربی زبان میں کلمہ کہا گیا ہے، جو کلم (زخم) سے مشتق ہے، اور وہ مجروح کے جسم میں ایک اثر ہے۔ اسی طرح کلمہ کا سننے والے کے نفس میں ایک اثر ہوتا ہے، وہ اثر اسے فہم (الفہم) کے واسطے سے کلام کو قبول کرنے کی سماعت کی استعداد سے عطا ہوتا ہے، یہ ضروری ہے۔ پس جب دو یا زیادہ کلمات منظم ہوتے ہیں، تو مجموعہ کو آیت (علامت) کہا جاتا ہے، یعنی ایک ایسے امر کی علامت جو ہر کلمہ نے انفرادی طور پر نہیں دیا، جیسے حروف کا کلمہ کے ساتھ معاملہ ہے، کیونکہ یہ مقرر ہو چکا ہے کہ مجموعہ کا ایک حکم ہوتا ہے جو اس مجموعہ کے مفردات کا نہیں ہوتا۔ پس جب آیات منظم ہوتی ہیں، جہاں تک متکلم انہیں پہنچانا چاہتا ہے، تو مجموعہ کو سورت کہا جاتا ہے، جس کا معنی ایک منزل ہے جو ان آیات کے مجموعہ سے ظاہر ہوئی، جو ہر آیت انفرادی طور پر نہیں دیتی تھی۔ اور قرآن ان سورتوں، آیات، کلمات اور حروف کے سوا کچھ نہیں جو ہم نے ذکر کیا۔ پس یہ میں نے تجھے قرآن کے بارے میں ایک کلی امر عطا کیا ہے۔ اور منازل مختلف ہوتی ہیں، پس آیات مختلف ہوتی ہیں، پس کلمات مختلف ہوتے ہیں، پس حروف کی ترتیب مختلف ہوتی ہے۔ اور قرآن بڑا اور کثیر ہے، اگر ہم اس کی تفصیل بیان کرنے لگیں جس کی طرف ہم نے اشارہ کیا ہے، تو عمر کافی نہ ہو گی۔ پس ہم نے تجھے تیرے نفس کے سپرد کیا ہے تاکہ تو اس میں سے خزانوں کو نکالے۔ اور یہ اگر ہم اسے کلام قرار دیتے ہیں۔ اور اگر ہم اسے کتاب کے طور پر نازل کریں، تو یہ رقمی حروف کی ترتیب ہے، کلمات کی ترتیب کے لیے، آیات کی ترتیب کے لیے، سورتوں کی ترتیب کے لیے۔ یہ سب ایک لکھنے والے دائیں ہاتھ سے ہے، جیسا کہ قول نفس رحمانی (نفس رحمانی) سے تھا۔ پس معاملہ ایک ہی مقدار پر ہو گیا، اگرچہ احوال مختلف ہیں، کیونکہ تلفظ کی حالت کتابت کی حالت نہیں ہے، اور ہاتھ کی صفت نفس کی صفت نہیں ہے۔ پس اس کا کتاب ہونا ظاہر اور شہود (الشہود) کی صورت کی طرح ہے، اور اس کا کلام ہونا باطن اور غیب (الغیب) کی صورت کی طرح ہے۔ پس تو کثیف اور لطیف کے درمیان ہے۔ اور حروف ہر صورت میں کثیف ہیں اس کے مقابلے میں جو وہ اس معنی پر دلالت کے لیے اٹھاتے ہیں جس کے لیے وہ وضع کیے گئے ہیں، اور معنی لطیف بھی ہو سکتا ہے اور کثیف بھی، لیکن دلالت ہر صورت میں لطیف ہے، اور وہی ہے جسے حرف اٹھاتا ہے، اور وہ اس کی روح ہے، اور روح صورت سے زیادہ لطیف ہے۔ پھر اللہ نے قرآن کے لیے سورتوں میں سے ایک سورت کو دل (قلب) بنایا، اور اس سورت کو قرآن کے دس اوزان کے برابر قرار دیا، اور قرآن کی آیات میں سے ایک آیت کو تمام آیات پر سیادت عطا کی، اور اس قرآن کی سورتوں میں سے ایک سورت کو اس کا تہائی، نصف اور چوتھائی وزن دیا، اور یہ اس مقام کی وجہ سے ہے جو اس سورت نے عطا کیا۔ اور سب اس کا کلام ہے۔ پس اس حیثیت سے کہ وہ اس کا کلام ہے، کوئی فضیلت نہیں، اور اس حیثیت سے کہ وہ اس کے ذریعے کلام کرتا ہے، ترتیب کے اختلاف کی وجہ سے فضیلت واقع ہوئی۔ پس اللہ تعالیٰ سے عاجزی کے ساتھ دعا کر کہ وہ تجھے وہ سمجھا دے جس کی طرف ہم نے اشارہ کیا ہے، کیونکہ وہی انعام کرنے والا، احسان کرنے والا ہے۔\n\nقرآن کا نور (نور) ہونا ان آیات کی وجہ سے ہے جو گمراہ کن شبہات کو دور کرتی ہیں، جیسے اس کا قول: **لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا** (اگر آسمانوں اور زمین میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں بگڑ جاتے)۔ اور اس کا قول: **لَا أُحِبُّ الْآفِلِينَ** (میں غروب ہونے والوں کو پسند نہیں کرتا)۔ اور اس کا قول: **فَاسْأَلُوهُمْ إِن كَانُوا يَنطِقُونَ** (پس ان سے پوچھو اگر وہ بول سکتے ہیں)۔ اور اس کا قول: **فَأْتِ بِهَا مِنَ الْمَغْرِبِ** (پس اسے مغرب سے لے آ)۔ اور اس کا قول: **إِذًا لَّابْتَغَوْا إِلَى ذِي الْعَرْشِ سَبِيلًا** (تب تو وہ عرش والے تک پہنچنے کا راستہ تلاش کرتے)۔ اور اس کا قول: **لَّوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا** (تو وہ اس میں بہت زیادہ اختلاف پاتے)۔ اور اس کا قول: **فَأْتُوا بِسُورَةٍ مِّن مِّثْلِهِ** (پس تم اس جیسی ایک سورت لے آؤ)۔ اور ہر وہ چیز جو دلالت کے معرض میں آئی ہے، وہ اس کے نور (نور) ہونے کی وجہ سے ہے، کیونکہ نور وہ ہے جو تاریکی کو بھگاتا ہے، اور اسی لیے اسے نور کہا گیا، کیونکہ نور نفور (بھاگنے والا) ہے۔\n\nاور اس کا ضیاء (ضیاء) ہونا ان آیات کی وجہ سے ہے جو امور اور حقائق کو منکشف کرتی ہیں، جیسے اس کا قول: **كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہے)۔ **سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ** (اے جن و انس، عنقریب ہم تمہاری طرف متوجہ ہوں گے)۔ اور اس کا قول: **مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ** (جس نے رسول کی اطاعت کی، اس نے اللہ کی اطاعت کی)۔ اور اس کا قول: **أَنبِئُونِي بِأَسْمَاءِ هَؤُلَاءِ** (مجھے ان کے نام بتاؤ)۔ اور اس کا قول: **لِمَا خَلَقْتُ بِيَدَيَّ** (جسے میں نے اپنے دونوں ہاتھوں سے پیدا کیا)۔ اور اس کا قول: **وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ** (اور تم نہیں چاہتے مگر یہ کہ اللہ چاہے)۔ اور اس کا قول: **كُلٌّ مِّنْ عِندِ اللَّهِ** (سب کچھ اللہ کی طرف سے ہے)۔ اور اس کا قول: **فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا** (پھر اسے اس کی بدکاری اور پرہیزگاری کا الہام کیا)۔ اور اس جیسی چیزیں جو حقائق کے بہاؤ پر دلالت کرتی ہیں، اور جیسے اس کا قول: **وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ** (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا)۔\n\nاور اس کا شفا (شفاء) ہونا، جیسے سورۃ فاتحہ اور تمام دعائیہ آیات۔\n\nاور اس کا رحمت (رحمۃ) ہونا، اس میں موجود ان چیزوں کی وجہ سے جو اس نے اپنے بندوں کے لیے خیر اور بشارت کے وعدے کے طور پر اپنے اوپر واجب کر لی ہیں، جیسے اس کا قول: **لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ** (اللہ کی رحمت سے مایوس نہ ہو)۔ اور اس کا قول: **كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ** (تمہارے رب نے اپنے اوپر رحمت لکھ لی ہے)۔ اور اس کا قول: **وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ** (اور میری رحمت ہر چیز پر محیط ہے)۔ اور ہر رجاء (امید) کی آیت۔\n\nاور اس کا ہدیٰ (ہدایت) ہونا، ہر محکم آیت اور ہر وہ نص جو قرآن میں وارد ہوئی ہے جس میں احتمال داخل نہیں ہوتا اور جس سے پہلی نظر میں صرف ظاہر ہی سمجھ میں آتا ہے، جیسے اس کا قول: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ** (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا)۔ اور اس کا قول: **وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ** (اور تمہارے لیے قصاص میں زندگی ہے)۔ اور اس کا قول: **مَن جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَمَن جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى إِلَّا مِثْلَهَا** (جو نیکی لائے گا تو اس کے لیے اس کے دس گنا ہے، اور جو برائی لائے گا تو اسے صرف اس کے برابر ہی بدلہ دیا جائے گا)۔ اور اس کا قول: **فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ** (پس جس نے معاف کر دیا اور صلح کر لی تو اس کا اجر اللہ پر ہے)۔ اور اس جیسی آیات جن کی کثرت کا شمار نہیں کیا جا سکتا۔\n\nاور اس کا ذکر (ذکر) ہونا، اس میں موجود عبرتوں کی آیات اور قوموں کے کفر کی وجہ سے ان کی ہلاکت کے قصوں کی وجہ سے، جیسے قوم نوح، عاد، ثمود، قوم لوط، اصحاب الایکہ اور اصحاب الرس کا قصہ۔\n\nاور اس کا عربی (عربی) ہونا، اس میں موجود حسن نظم، محکم اور متشابہ کا بیان، اور قصوں کا تکرار الفاظ میں کمی بیشی کے ساتھ، مع تعریف اور اطلاع میں مطلوبہ معنی کی تکمیل کے ساتھ، مع لفظ کی اختصار کے، جیسے اس کا قول: **يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ** (وہ ہر آواز کو اپنے خلاف سمجھتے ہیں)۔ اور اس کا قول: **مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا** (انہوں نے اسے تمہارے لیے صرف جھگڑے کے لیے بیان کیا)۔ اور اس کا قول: **يَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ وَقِيلَ بُعْدًا لِّلْقَوْمِ الظَّالِمِينَ** (اے زمین اپنا پانی نگل لے، اور اے آسمان تھم جا، اور پانی کم ہو گیا، اور کام تمام ہو گیا، اور وہ جودی پہاڑ پر ٹھہر گئی، اور کہا گیا کہ ظالم قوم کے لیے دوری ہو)۔ اور اس کا قول: **وَأَوْحَيْنَا إِلَى أُمِّ مُوسَى أَنْ أَرْضِعِيهِ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ** (اور ہم نے موسیٰ کی ماں کو وحی کی کہ اسے دودھ پلاؤ، پھر جب تمہیں اس پر خوف ہو تو اسے دریا میں ڈال دو، اور نہ ڈرو اور نہ غم کرو، بے شک ہم اسے تمہاری طرف لوٹانے والے ہیں اور اسے رسولوں میں سے بنانے والے ہیں)۔ یہ سب ایک ہی آیت میں ہے جو دو بشارتوں اور دو حکموں پر مشتمل ہے، ایک نفع بخش علم کے ساتھ اور اللہ کی طرف سے بشارت کے ساتھ وضاحت۔\n\nاور اس کا مبین (مبین) ہونا، اس میں اہل سعادت اور اہل شقاوت کی صفات اور اہل فلاح کی ان کے علاوہ سے صفات کی وضاحت کی وجہ سے، جیسے اس کا قول: **قَدْ أَفْلَحَ الْمُؤْمِنُونَ** (بے شک مؤمن کامیاب ہو گئے) آخر آیات تک۔ اور اس کا قول: **إِنَّ اللَّهَ اشْتَرَى مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ** (بے شک اللہ نے مؤمنوں سے ان کی جانیں خرید لی ہیں)۔ اور احکام کی آیات، اور ہر وہ آیت جس سے اس نے کسی امر کی وضاحت کی تاکہ وہ معلوم ہو جائے۔ پس اسی لیے اس نے اسے ان تمام ناموں سے موسوم کیا اور اسے قرآن (قرآن) بنایا، یعنی ظاہر، جو ان تمام معانی کا جامع ہے جو صرف اسی میں پائے جاتے ہیں۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔ اس باب کے مکمل ہونے کے ساتھ اکیسواں سفر مکمل ہوا۔",
    "fa": "باب سیصد و بیست و پنجم در معرفت جایگاه قرآن از حضرت محمدیه (الحضرة المحمدية).\n\nجمع در هر زمان معتبر است *** و وتر (فرد) در جمع مانند اعداد در احد است.\n\nاین اله، همان اسماء است که آن‌ها را فرد (وتر) ساخت *** نود و نه اسم که نه کم می‌شوند و نه زیاد.\n\nپس عین (ذات) مجموع اسماء است و برای آن *** فردی (وتری) جز آنچه از عدد ذکر کردیم، نیست.\n\nپس در آنجا جز فردی نیست که آن را تعیین کند *** عین کثیر است، پس به هیچ کس توجه مکن.\n\nو الله (حق) وتر (فرد) است، پس چیزی او را کثیر نمی‌کند *** همراه با علومی که در رصد به تو عطا کرد.\n\nپس در بشر، مؤثری جز خدا نیست *** و غیری در آنجا نیست، پس ساکن شهر (حق) را قصد کن.\n\nخیری به تو می‌بخشد با احسانی که جود می‌کند *** بر تو، پس او کسی است که اگر بخواهد، جود نمی‌کند.\n\n### [اینکه هر آنچه غیر خداست، ارواح مطهر و منزه هستند]\n\nبدان، خدا تو را بفهماند، که هر آنچه غیر خداست، ارواح مطهر و منزهی هستند که او موجد و خالق آن‌هاست. و این ارواح به مکان و متمکن تقسیم می‌شوند. مکان به دو بخش تقسیم می‌شود: مکانی که آسمان نامیده می‌شود و مکانی که زمین نامیده می‌شود. و متمکن در آن دو نیز به دو بخش تقسیم می‌شود: متمکن *در* آن و متمکن *بر* آن. متمکن *در* آن، به حسب مکانش وجود دارد، و متمکن *بر* آن، به حسب مکانش وجود ندارد. این حصر (شمارش کامل) هر آنچه غیر خداست می‌باشد. و همه این‌ها در حقیقت ارواح هستند، که در حقِ مخلوق به آن، اجسام و جواهرند. این ارواح بر مراتب در تنزیه (تنزيه) قرار دارند که \"مکانت\" نامیده می‌شود. و هیچ منزهی برای خدای تعالی نیست مگر آنکه تنزیه او به اندازه مرتبه‌اش است، زیرا او خالق خود را تنزیه نمی‌کند مگر از حیث خودش، چرا که جز خود را نمی‌شناسد. پس آن تنزیه برای او نزد خدا مکانتی به بار می‌آورد که هر موجودی به واسطه آن از غیر خود متمایز می‌شود. این منزل شامل تنزیه ارواح متمکن است، نه ارواح مکانی. و منزلی در این منازل خواهد آمد که در آن تنزیه مکان و متمکن را با هم ذکر خواهیم کرد. پس این منزل شامل نیمی از عالم است از حیث آنچه منزه است. سپس خدای تعالی این مکانت را به این منزه بازگرداند، به این صورت که حق (الحق) تجلی‌گاه (التجلی) او شد، پس خود و مرتبه‌اش را دید و به اندازه آنچه دید، تسبیح گفت. پس او خودِ اوست نه غیر او. و این بدان سبب است که حق (الحق) میان خود و بندگانش حجاب عزت را آویخت، پس تنزیه در مقابل آن ایستاد. پس دانست که تنزیه خلق، شایسته حق نیست و حجاب عزت، حمایت‌کننده‌تر و قهر آن غالب‌تر است. سپس دیگر عارفان به خدا را دید که با صفات سلب (صفات تنزیهی) در مراتب مختلف، تنزیه می‌کردند. و همه آن‌ها اقرار کردند که در محل تنزیه خود در اشتباه بوده‌اند و تنزیه آن‌ها از خودشان خارج نشده است. و این به سبب حکمت اوست که در خلقش جاری شده است. پس آن تنزیه، تنزیه حکمت بود و نه غیر آن. و اگر پرده حجاب عزت نبود، این را نمی‌دانستند. و از این حجاب بود که کفر در عالم ظاهر شد و معرفت (المعرفة) به خبری از ورای این حجاب تبدیل گشت. پس ایمان در عالم میان ستر (پوشش) و مؤمن ظاهر شد. پس کافر که همان ساتر (پوشاننده) است، به دلیل کفر نزدیک‌تر است، زیرا ستر، مستور (پوشیده شده) و مستور عنه (پوشیده شده از آن) را می‌بیند، و این صفت کافر است. و مؤمن پایین‌تر از این ستر است، پس مقام او حجاب است. خدای تعالی می‌فرماید: **«وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ»** (و هیچ بشری را نسزد که خدا با او سخن گوید مگر به وحی یا از پس پرده‌ای). و ایمان به خبر تعلق دارد و خبر از اقسام کلام است.\n\n### [اینکه خداوند سبحان اهل ستر را از غیب به شهود خارج کرد]\n\nسپس او سبحانه اهل ستر را از غیب به شهود (الشهود) خارج کرد تا مقام جمع میان دو حالت برای او حاصل شود، پس او را با دو زبان تنزیه کند و دو صفت را برای او ثابت نماید. و آنچه حق (الحق) با او انجام داد، در گمان او نبود، بلکه او تصور می‌کرد که غیب در موطن شهود (الشهود) نخواهد بود، زیرا می‌دانست که غیب، حریم ممنوعه‌ای است که آنچه در آن است دانسته نمی‌شود تا به آن دست یابند. و مقام آن تنها این است که بدون تعیین ماهیت آن مشعور به، احساس شود. و او از این غافل بود که خدا هر چه بخواهد انجام می‌دهد و در حق او غیبی وجود ندارد و غیب تنها می‌تواند اضافی باشد. پس هنگامی که از جانب خدا چیزی بر او آشکار شد که در حسابش نبود، دانست که امور به دست خداست و در آنجا کسی نیست که مستحق حکمی برای خود باشد، بلکه او خدایی است که **«الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ»** (به هر چیزی خلقتش را عطا کرد). و هنگامی که اشیاء دانستند که از ذات خود چیزی ندارند و وجودشان به حسب اقتضای ذات موجدشان است و احوال بر آن‌ها به حسب آنچه حقایقِ کسی که به او مستند شده‌اند (یعنی خدای تعالی) می‌طلبد، تجدید می‌شود، ترسیدند، زیرا بر علم خدا در مورد خود در آینده وقوف نداشتند. پس هر آنچه را که در خود به آن اعتماد می‌کردند، به خاطر آنچه نزد خالقشان بود، رها کردند و او را تسبیحی جدید از خلقی جدید گفتند و از نظر به خود به نظر به کسی که ملکوت هر چیز به دست اوست، عبور کردند. و اگر این مقامی که او را در آن اقامه کرد، نبود و او را از نزدیک به سوی خود بازنمی‌گرداند، از دور او را ندا می‌داد، پس مسافت بر او طولانی می‌شد و آفات و موانع در راه بر او عارض می‌گشت، زیرا مسافر و مال او در کمی است. سپس هنگامی که خدا اشیاء را در این مقام قرار داد، پرچمی از پرچم‌های معرفت (المعرفة) برای آن‌ها برافراشت و این علم را به آن‌ها عطا کرد که آن‌ها شق (نیمه) هستند و بر نصف هستی (الوجود) قرار دارند و کمال هستی (الوجود) به واسطه آن‌هاست و اگر آن‌ها نبودند، کمال در هستی و علم ظاهر نمی‌شد. پس به خود بالیدند و شأنشان نزد خودشان بزرگ شد، اما ندانستند که کدام بخش از هستی (الوجود) برای آن‌ها صحیح است. سپس این امر در عبادت نماز برای آن‌ها آشکار شد، آنجا که حق (الحق) آن را میان خود و بنده‌اش به دو نیم تقسیم کرد. پس بر تیه (سرگشتگی) آن‌ها افزوده شد. هنگامی که آخر خبر را موافق با حال خود شنیدند که به آن شعور نداشتند، در قول او: «فنصفها لي» (پس نیمی از آن برای من است) و آن را مقید نکرد، و در مورد نصف بنده گفت: «ونصفها لعبدي ولعبدي ما سأل» (و نیمی از آن برای بنده من است و برای بنده من است آنچه درخواست کند). و سؤال، ذلت و فقر و نیاز و مسکنت است، مگر آنکه از پشت این حجاب چیزی بر بنده آشکار شود که گمان نمی‌کرد، و آن این است که او در منزلی است که حق (الحق) از او متأخر است، مانند قول او: **«وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ»** (و خدا از پشت سرشان احاطه دارد). و این بدان سبب است که او در حکم فرار است، هنگامی که با چیزی مواجه می‌شود که توان حمل آن را ندارد. پس خدا به او خبر داد که او از ورای اوست و او کسی است که با او مواجه می‌شود. پس اگر از او فرار کند، به سوی او فرار می‌کند از جایی که شعور ندارد، همان‌گونه که در منزل دیگری برای او اولویت قائل شد از قول او: **«مَا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا»** (هیچ جنبنده‌ای نیست مگر آنکه او گیرنده ناصیه (پیشانی) آن است). و خود را به صفت هادی توصیف کرده است، و هادی کسی است که پیشوای قوم باشد تا راه را به آن‌ها نشان دهد، و این همان قول اوست: **«إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ»** (همانا پروردگار من بر راهی راست است) و **«مَا كُنتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ»** (تو نمی‌دانستی کتاب چیست و نه ایمان). پس اشیاء با حق (الحق) به منزله یک گردنه شدند. پس خدای تعالی از اشیاء پیش افتاد تا آن‌ها را به آنچه سعادتشان در آن است هدایت کند، و از آن‌ها عقب ماند تا آن‌ها را از کسی که قصد نابودی آن‌ها را دارد، حفظ کند، و آن همان عدم است. زیرا عدم،\nآن‌ها را می‌طلبد، همان‌گونه که هستی (الوجود) آن‌ها را می‌طلبد، و آن‌ها محلی هستند که پذیرای هر دو حکم می‌باشند و در توانشان نیست که امتناع ورزند مگر به لطف لطیف. سپس هنگامی که خدای تعالی آن‌ها را بر این امر آگاه ساخت، از علم به جلال خدا، اسمایی برای آن‌ها حاصل شد که با آن‌ها او را تسبیح می‌گویند و حمد و ثنا می‌کنند، که پیش از این مشهد آن را نمی‌دانستند، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در مورد مقام محمود در روز قیامت فرمود: «فأحمده بمحامد لا أعلمها الآن» (پس او را با ستایش‌هایی حمد می‌کنم که اکنون آن‌ها را نمی‌دانم). آن مقام، آن ستایش‌ها را به واسطه حضور در آن به او عطا می‌کند، و آنچه خدا به او الهام می‌کند، با آن او را ثنا می‌گوید. و همچنین هر منزلت و مرتبه‌ای در عالم، دنیا و آخرت، تا بی‌نهایت، در هر منزلی از آن‌ها ثنای خاصی دارد. پس هنگامی که او را تسبیح گفت، آن ثنا، علم دیگری را به او به ارث می‌دهد که پیش از آن نزد او نبوده است، از علم اذن الهی که خدا پرنده را با دست عیسی از آن خلق کرد و عیسی از آن در آن دمید و پرنده شد، و از آن کور مادرزاد و پیسی را شفا داد و مردگان را زنده کرد. و این علم شریفی است که ابویزید بسطامی و ذوالنون مصری به آن متحقق شدند. اما ابویزید، مورچه‌ای را ناخواسته کشت، پس هنگامی که متوجه شد، در آن دمید و به اذن خدا زنده برخاست. و اما ذوالنون، پیرزنی نزد او آمد که تمساح فرزندش را گرفته و در نیل برده بود. پس تمساح را فراخواند و او فرزند را زنده از شکم خود به سوی پیرزن انداخت، همان‌گونه که نهنگ یونس را انداخت. پس هنگامی که این علم بر او کشف (الکشف) شود، او سبحانه را با ستایش‌هایی که شایسته اوست و این مقام آن‌ها را می‌طلبد، ثنا می‌گوید. و از اینجاست که او بر کسانی که از این مقام خارج شده‌اند، اشراف پیدا می‌کند و حال خارج‌شدگان را می‌داند، زیرا این منزل، منزل جامع است و به همین دلیل منزل قرآن نامیده شده است. پس هنگامی که صاحب این منزل از این مقام به سوی کون (عالم خلق) فرود آید، دشمن با لشکریانش بر او عارض می‌شود، و آن ابلیس است که طبعاً با او دشمنی می‌کند، به ویژه با فرزندان آدم، زیرا او از هر جهت با آن‌ها منافر است، برخلاف دشمنی‌اش با آدم، زیرا میان او و آدم خشکی را جمع کرد، چرا که میان خاک و آتش جامعی وجود دارد. و به دلیل همان جامع بود که ابلیس او را تصدیق کرد هنگامی که به خدا سوگند خورد که او خیرخواه است، اما فرزندان آدم او را تصدیق نکردند، زیرا او از هر جهت ضد فرزندان است، و این همان قول او در مورد فرزندان است که آن‌ها را از آب آفریده است و آب با آتش منافر است. پس دشمنی با فرزندان شدیدتر از دشمنی با پدرشان بود. و خدا این دشمن را از درک دیدگان محجوب ساخت و برای او در قلب، از طریق شرع، نشانه‌هایی قرار داد که او را با آن‌ها می‌شناسد و آن نشانه‌ها برای او به منزله درک بصری است. پس با آن نشانه‌ها از القائات او خود را حفظ می‌کند. و خدا این انسان را با فرشته‌ای که او را مقابل او قرار داده است، یاری کرده است، غیبی در مقابل غیب. پس هرگاه در ظاهر انسان تأثیر نگذارد و فرشته با کمک نفس بر او غالب شود، برای نفس دو پاداش است: پاداش خودش و پاداش یاری‌دهنده که فرشته است، زیرا فرشته پاداش نمی‌پذیرد و مقامش نه زیاد می‌شود و نه کم. و اگر در ظاهر انسان تأثیر بگذارد، فرشته غمگین می‌شود و برای این انسان استغفار می‌کند. و او، یعنی فرشته، محل پاداش غم نیست، پس آن پاداش به انسان بازمی‌گردد. پس او در هر دو حالت، در طاعت و معصیت، سود می‌برد. و ایمان، فرشته را تقویت می‌کند و به همین دلیل فرشته برای او استغفار می‌کند.\n\n### [اینکه قرآن جامع است و همه حقایق الهی آن را به سوی خود کشیده‌اند، پس منزلت آن اعتدال است]\n\nو بدان که چون قرآن جامع بود، همه حقایق الهی و کونی به طور مساوی آن را به سوی خود کشیدند، پس در آن کجی و تحریفی نبود. پس منزلت آن، اعتدال است. و اعتدال، منزلتی است که بقای هستی (الوجود) را بر موجود حفظ می‌کند، نه منزل ایجاد، زیرا ایجاد تنها از انحراف و میل حاصل می‌شود و در حق حق (الحق)، توجه ارادی نامیده می‌شود، و این همان قول اوست: **«إِذَا أَرَدْنَاهُ»** (هنگامی که آن را اراده کنیم). و چون منزل آن اعتدال بود، برای آن دوام و بقا (البقاء) حاصل شد. پس ابقای تکوین و بقای کون (عالم خلق) از آن اوست. و اگر از منزلت خود فرود می‌آمد، از اعتدال به انحراف فرود می‌آمد، و این همان قول اوست: **«وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ»** (و اگر قرآنی بود که کوه‌ها به واسطه آن به حرکت درمی‌آمدند) و قول او: **«لَوْ أَنزَلْنَا هَذَا الْقُرْآنَ»** (اگر این قرآن را نازل می‌کردیم) یعنی از منزلتش **«عَلَى جَبَلٍ لَّرَأَيْتَهُ خَاشِعًا مُّتَصَدِّعًا»** (بر کوهی، آن را می‌دیدی که خاشع و متلاشی می‌شود) یعنی کوه، صورت خود را حفظ نمی‌کرد، زیرا از منزلت خود فرود آمده بود. و چون این منزلت او بود و حقایق به طور مساوی آن را به سوی خود کشیدند، کسی که قرآن بر او نازل شد، **«رَحْمَةً لِّلْعَالَمِينَ»** (رحمتی برای جهانیان) بود، زیرا رحمت **«وَسِعَتْ كُلَّ شَيْءٍ»** (همه چیز را فرا گرفته است). پس هر چیزی آن را به طور ذاتی طلب کرد.\nهنگامی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در قنوت بر کسانی که علیه آن‌ها دعا می‌کرد، عتاب شد و به او گفته شد: **«وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ»** (و تو را نفرستادیم مگر رحمتی برای جهانیان).\nیعنی تا به آن‌ها رحم کنی، زیرا تو صاحب قرآنی و قرآن نطق می‌کند که من تو را نفرستادم مگر رحمت، و نطق می‌کند که **«وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ»** (و رحمت من همه چیز را فرا گرفته است). پس این رحمت میان منّت و وجوب است. پس برخی از بندگان من کسانی هستند که رحمت به حکم وجوب آن‌ها را فرا می‌گیرد و برخی کسانی هستند که به حکم منّت آن‌ها را فرا می‌گیرد. و اصل، منّت و فضل و انعام الهی است، زیرا کون (عالم خلق) وجود نداشت تا استحقاقی داشته باشد. پس ظهور آن جز از عین منّت نبود. و همچنین امری که به واسطه آن استحقاق رحمت حاصل شد، از عین منّت بود. پس اگر قرآن از منزلت خود فرود آید، آن کلام اوست و کلام او بر یک نسبت است، به دلیل آنچه کلام از تقسیم می‌پذیرد. پس آن را نازل می‌کند و در آن حقیقت اعتدال در نسبت‌ها وجود دارد، و آن نزد هر تلاوت‌کننده‌ای همواره جدید است. پس نزول آن را نمی‌پذیرد مگر مناسب با آن در اعتدال. پس از هویٰ (میل نفسانی) مبرا است. و به همین دلیل در مورد محمد (صَلَّى اللهُ عَليهِ وسَلَّم) گفته شد: **«وَمَا يَنطِقُ عَنِ الْهَوَىٰ»** (و از روی هویٰ سخن نمی‌گوید). و دیگر رسولان و خلفا را از پیروی هویٰ نهی کرد. پس در مرتبه کسی که در مورد او خبر داده شده که از هویٰ سخن نمی‌گوید، فرود نیامد. و هر کس که به نزول آن حس نمی‌کند، به دلیل مشغول بودن روحش به طبیعت خود است. پس قرآن از پشت حجاب طبع بر او نازل می‌شود و در او لذتی ایجاد نمی‌کند. و این همان قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در حق گروهی از تلاوت‌کنندگان است که: «إنهم يقرءون القرآن لا يجاوز حناجرهم» (آنان قرآن می‌خوانند که از گلوهایشان فراتر نمی‌رود).\nپس این قرآنی است که بر زبان‌ها نازل شده، نه بر قلب‌ها. و در مورد ذوق (درک باطنی) فرمود: **«نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ»** (روح‌الامین آن را بر قلب تو نازل کرد). پس او کسی است که برای نزول آن بر خود، شیرینی‌ای می‌یابد که قدر آن را نمی‌تواند بداند و از هر لذتی برتر است. پس هنگامی که آن را یافت، او کسی است که قرآن جدیدی که کهنه نمی‌شود، بر او نازل شده است. و فرق میان دو نزول این است که کسی که قرآن بر قلبش نازل می‌شود، با فهم نازل می‌شود، پس می‌داند چه می‌خواند، اگرچه به زبان او نباشد، و معانی آنچه را می‌خواند می‌داند، اگرچه آن الفاظ در غیر قرآن معانی آن‌ها را نداند، زیرا به زبان او نیست.\nو در تلاوت خود، اگر از کسانی باشد که قرآن هنگام تلاوت بر قلبش نازل می‌شود، آن معانی را می‌شناسد. و چون مقام و منزلت قرآن همان بود که ذکر کردیم، هر موجودی در آن آنچه را می‌خواهد، می‌یابد. و به همین دلیل شیخ ابومدین می‌فرمود: «لا يكون المريد مريدا حتى يجد في القرآن كل ما يريد» (مرید، مرید نیست مگر آنکه در قرآن هر آنچه را می‌خواهد بیابد). و هر کلامی که این عمومیت را نداشته باشد، قرآن نیست. و چون نزول آن بر قلب است و قلب صفتی الهی است که از موصوف خود جدا نمی‌شود، کسی جز کسی که کلام اوست، نتوانست آن را نازل کند. پس حق (الحق) ذکر کرد که قلب بنده مؤمنش او را وسعت داده است. پس نزول قرآن در قلب مؤمن، نزول حق (الحق) در آن است. پس حق (الحق) با این بنده از سرّ او در سرّ او سخن می‌گوید، و این همان قول آن‌هاست: «حدثني قلبي عن ربي من غير واسطة» (قلبم از پروردگارم بدون واسطه برایم سخن گفت). و تالی (تلاوت‌کننده) از این جهت تالی نامیده شده که کلام پی در پی می‌آید و پی در پی آمدن آن، او را به سوی حرکتی در نهایت سوق می‌دهد، و آن از \"والی\" است، پس از این به آن فرود می‌آید. و چون قلب از عالم اعلی بود و زبان از عالم اسفل، و حق (الحق) منزلش قلب بنده بود و او متکلم است و در قلب، عین واحد است، و حروف از عالم زبان هستند، پس زبان آیات را تفصیل داد و برخی را پس از برخی تلاوت کرد. پس انسان از حیث زبانش تالی نامیده می‌شود، زیرا او تفصیل‌دهنده چیزی است که به صورت مجمل نازل شده است. و قرآن در میان کتب و صحیفه‌های نازل شده، به منزله انسان در عالم است، زیرا قرآن مجموع کتب است و انسان مجموع عالم. پس این دو برادرند. و منظورم از آن، انسان کامل (الإنسان الکامل) است. و این جز برای کسی نیست که قرآن از همه جهات و نسبت‌هایش بر او نازل شده است. و بر دیگر ورثه او، قرآن تنها از میان دو کتفشان نازل شده و در سینه‌شان از پشت غیب (ظهر غیب) مستقر گشته است، و این همان وراثت کامل است. از ابویزید حکایت شده که نمرد تا قرآن را از بر کرد. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در مورد کسی که قرآن به او داده شده، فرمود: «إن النبوة أدرجت بين جنبيه» (همانا نبوت میان دو پهلوی او پیچیده شده است).\nو این فرق میان انبیا و اولیای تابع است. اما کسی که نبوت میان دو پهلویش پیچیده شده و قرآن از پشت غیب (ظهر غیب) به او رسیده است، رؤیت از پشت سرش به او عطا شده، همان‌گونه که از پیش رویش عطا شده است، زیرا قرآن جز به صورت مواجهه نازل نمی‌شود. پس برای پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از دو جهت است: جهت معتاد و جهت غیر معتاد. و برای وارث از جهت غیر معتاد است. پس به حکم اصل، ظهر (پشت) نامیده شد و به حکم فرع، وجه (رو) نامیده شد. و هنگامی که ما آن را چشیدیم، برای خود تمایز جهتی از جهت دیگر ندیدیم و ناگهانی به ما رسید. پس امر را ندانستیم که چگونه است مگر پس از آن. پس کسی که با قرآن از حیث اینکه قرآن است توقف کند، صاحب عین واحده احدیت جمع است. و کسی که با آن از حیث اینکه مجموع است توقف کند، در حق او فرقان است. پس ظهر (پشت) و بطن (باطن) و حد و مطلع را مشاهده کرد و گفت: برای هر آیه ظهر و بطن و حد و مطلعی است. و آن دیگری (صاحب عین واحده) این را نمی‌گوید. و ذوق (درک باطنی) متفاوت است. و هنگامی که ما این امر دیگر را چشیدیم، تنزل، فرقانی بود. پس گفتیم: این حلال است و این حرام است و این مباح است. و مشرب‌ها متنوع شد و مذاهب مختلف گشت و مراتب متمایز شد و اسماء الهی و آثار کونی ظاهر گشت و اسماء و آلهه در عالم زیاد شد. پس فرشتگان و ستارگان و طبیعت و ارکان و حیوانات و نباتات و سنگ‌ها و انسان‌ها و جن عبادت شدند، تا جایی که هنگامی که واحد، وحدانیت را آورد، گفتند: **«أَجَعَلَ الْآلِهَةَ إِلَهًا وَاحِدًا إِنَّ هَذَا لَشَيْءٌ عُجَابٌ»** (آیا خدایان را یک خدا قرار داده است؟ همانا این چیزی شگفت‌آور است). و در حقیقت، شگفتی از کسی نیست که توحید کرد، بلکه شگفتی از کسی است که بدون دلیل و برهان تکثیر کرد. و به همین دلیل فرمود: **«وَمَن يَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ»** (و هر کس با خدا، خدای دیگری را بخواند که برهانی بر آن ندارد). و این رحمتی از خداست بر کسی که شبهه‌ای در اثبات کثرت برایش آشکار شده و اعتقاد کرده که آن برهان است، به این دلیل که خدا از او درمی‌گذرد، زیرا او نهایت تلاش خود را در نظر به کار برده و قوتش جز آن را به او نداده است. پس برای مشرکانِ اهل نظر، امیدی در عفو خدا بهتر از این آیه نیست. و ما گفتیم که در عالم هیچ اثری نیست مگر آنکه مستند به حقیقتی الهی است. پس از کجا آلهه متعدد شدند و از حقایق الهی عبادت شدند؟ پس بدان که این از اسماء است. زیرا خدا هنگامی که در آن‌ها وسعت داد، فرمود: **«اعْبُدُوا اللَّهَ»** (خدا را بپرستید) و فرمود: **«اتَّقُوا اللَّهَ رَبَّكُمْ»** (از خدا، پروردگارتان، پروا کنید) و فرمود: **«اسْجُدُوا لِلرَّحْمَنِ»** (برای رحمان سجده کنید) و فرمود: **«ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَّا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ»** (خدا را بخوانید یا رحمان را بخوانید، هر کدام را بخوانید، پس نیکوترین نام‌ها از آن اوست). پس امر نزد آن‌ها مبهم‌تر از آنچه بود، شد. زیرا نگفت: خدا را بخوانید یا رحمان را بخوانید، هر کدام را بخوانید، پس عین (ذات) یکی است و این دو اسم برای آن هستند. این همان نصّی است که اشکال را برطرف می‌کند. پس خدا این اشکال را باقی نگذاشت مگر رحمتی بر مشرکانِ اهل نظری که از روی شبهه شرک ورزیدند. و وعید در حق مقلدان باقی ماند، زیرا خدا آن‌ها را شایسته نظر قرار داد و آن‌ها نظر نکردند و تفکر ننمودند و عبرت نگرفتند. زیرا این علم تقلید نیست. پس کسی که با نظر خطا کند، اولی و بالاتر از کسی است که با تقلید به صواب رسد، مگر در ذات حق (الحق)، زیرا شایسته نیست که مخلوقی در آن به حکم نظر فکری تصرف کند، بلکه\nاو با خبر الهی است در آنچه خدا از خود خبر می‌دهد. بر او قیاس نمی‌شود و زیاد و کم نمی‌شود و تأویل نمی‌گردد و با آن قول، وجه معینی قصد نمی‌شود، بلکه معنی فهمیده می‌شود و نسبت مجهول می‌ماند و علم به نسبت به علم خدا در آن بازگردانده می‌شود. پس کسی که به این گونه به امر نظر کند، عذر را برای صاحبش اقامه کرده و **«رَحْمَةً لِّلْعَالَمِينَ»** (رحمتی برای جهانیان) بوده است.\n\n### [اینکه شب قدر، شب نیمه شعبان است]\n\nسپس بدان که خدا کتاب را به صورت فرقان (فرقان) در شب قدر، شب نیمه شعبان، نازل کرد و آن را به صورت قرآن (قرآن) در ماه رمضان نازل کرد. همه این‌ها به آسمان دنیا بود. و از آنجا در طول بیست و سه سال به صورت فرقان (فرقان)، به صورت نجوم (بخش بخش)، دارای آیات و سوره‌ها نازل شد تا منازل دانسته شود و مراتب آشکار گردد. پس از نزول آن به زمین در ماه شعبان، به صورت فرقان (فرقان) تلاوت می‌شود، و از نزول آن در ماه رمضان، به صورت قرآن (قرآن) تلاوت می‌شود. پس برخی از ما کسانی هستند که آن را *به واسطه* او تلاوت می‌کنند، پس آن قرآن (قرآن) است، و برخی از ما کسانی هستند که آن را *به واسطه خود* تلاوت می‌کنند، پس آن فرقان (فرقان) است. و صحیح نیست که در یک عین و یک حال با هر دو تلاوت شود. پس اگر نزد او باشی، نزد خودت هستی، و اگر نزد خودت باشی، نزد او نیستی، زیرا **«كُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ»** (و هر چیزی نزد او به اندازه‌ای است). و او این‌گونه نیست، بلکه او با هر چیزی است و نزد کسی است که او را با ذکر یاد می‌کند و نه غیر آن، زیرا او همنشین ذاکرین است.\nبدان که خدا این قرآن را به صورت حروفی منظم از دو تا پنج حرف متصل و منفرد نازل کرد و آن را کلمات و آیات و سوره‌ها و نور و هدایت و ضیاء و شفا و رحمت و ذکر و عربی و مبین و حق و کتاب و محکم و متشابه و مفصل قرار داد. و برای هر اسم و نعت از این اسماء، معنایی است که برای دیگری نیست، و همه آن کلام خداست. و چون جامع این حقایق و امثال آن‌ها بود، مستحق نام قرآن شد. پس مراتب برخی از نعت‌های آن را ذکر می‌کنیم تا اهل الله منزلت آن را بدانند.\nاز جمله آن، حرف بودن آن است. و مفهوم از این اسم دو امر است: امر اول که قول و کلام و لفظ نامیده می‌شود، و امر دیگر که کتابت و رقم و خط نامیده می‌شود. و قرآن نوشته می‌شود، پس حروف رقم را دارد، و به آن نطق می‌شود، پس حروف لفظ را دارد. پس چرا حرف بودن آن به صورت منطوق به آن بازمی‌گردد؟ آیا به کلام خدا که صفت اوست، یا به کسی که از او ترجمه شده است؟ پس بدان که پیامبر ما (صَلَّى اللهُ عَليهِ وسَلَّم) به ما خبر داده است که او سبحانه در قیامت در صورت‌های مختلف تجلی (التجلی) می‌کند، پس شناخته می‌شود و انکار می‌گردد. و کسی که حقیقتش پذیرای تجلی (التجلی) در صورت‌ها باشد، بعید نیست که کلام با حروف تلفظ شده که کلام خدا نامیده می‌شود، برای برخی از آن صورت‌ها باشد، آن‌گونه که شایسته جلال اوست. همان‌گونه که می‌گوییم: در صورتی تجلی (التجلی) کرد که شایسته جلال اوست، همچنین می‌گوییم: با صوت و حرف سخن گفت که شایسته جلال اوست. و ما آن را بر محمل فرح و خنده و چشم و قدم و دست و یمین و غیر آن از آنچه در کتاب و سنت آمده است، حمل می‌کنیم که ایمان به آن‌ها بر معنای معقول واجب است، بدون کیفیت و تشبیه، زیرا او می‌فرماید: **«لَيْسَ كَمِثْلِهِ شَيْءٌ»** (چیزی مانند او نیست). پس مماثلت را نفی کرد، همراه با فهم معنی و جهل به نسبت. پس هنگامی که حروف منظم شوند، کلمه نامیده می‌شوند، و هنگامی که کلمات منظم شوند، آیه نامیده می‌شوند، و هنگامی که آیات منظم شوند، سوره نامیده می‌شوند. پس هنگامی که خود را به داشتن نفس توصیف کرد، آن‌گونه که شایسته جلال اوست، و خود را به صوت و قول توصیف کرد و فرمود: **«فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ»** (پس او را پناه ده تا کلام خدا را بشنود)، آن نفس، صوت نامیده شد و انقطاع آن از صوت، جایی که قطع می‌شود، حرف نامیده شد. و همه این‌ها از آنچه خبر الهی به ما داده است، معقول است، همراه با نفی مماثلت و تشبیه، مانند سایر صفات. و هنگامی که خود را به صورت توصیف کرد، معنی قول او را دانستیم که او **«الظَّاهِرُ وَالْبَاطِنُ»** (ظاهر و باطن) است. پس باطن برای ظاهر غیب است و ظاهر برای باطن شهود (الشهود) است. و خود را به داشتن نفس توصیف کرد، پس آن خروج او از غیب است و ظهور حروف شهود (الشهود) است. و حروف، ظرف‌هایی برای معانی هستند که ارواح آن‌ها می‌باشند و برای دلالت بر آن‌ها به حکم تواطؤ (تفاهم) وضع شده‌اند. و خدای تعالی فرمود: **«وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ»** (و هیچ رسولی را نفرستادیم مگر به زبان قومش تا برای آن‌ها بیان کند). و بلیغ‌تر از این افصاح از جانب خدا برای بندگانش وجود ندارد. پس ناگزیر باید از این عبارات، آنچه را که در آن زبان بر آن دلالت می‌کند، فهمید، به واسطه آنچه خبر آن در مورد کون (عالم خلق) آمده است. پس معنایی که آن کلام بر آن دلالت می‌کند، شناخته می‌شود و نسبت شناخته می‌شود. و آنچه خبر آن در مورد خدا آمده است، معنایی که آن کلام بر آن دلالت می‌کند، شناخته می‌شود و نسبت مجهول می‌ماند، به دلیل آنچه دلیل عقلی و دلیل شرعی از نفی مماثلت عطا کرده است. پس اگر آنچه را مقرر کردیم، محقق ساختی، برایت آشکار می‌شود که کلام خدا همین است که تلاوت می‌شود و شنیده می‌شود و به آن تلفظ می‌شود و قرآن و تورات و زبور و انجیل نامیده می‌شود. پس حروف آن، مراتب کلمات آن را از حیث مفرداتشان تعیین می‌کنند. سپس کلمه از حیث جامعیتش معنایی دارد که آحاد حروف کلمه آن را ندارند. پس کلمه در نفس شنونده اثری دارد. به همین دلیل در زبان عربی کلمه نامیده شده است که از \"کلم\" (زخم) مشتق شده است، و آن اثری در جسم مجروح است. همچنین کلمه در نفس شنونده اثری دارد که استعداد سمع برای پذیرش کلام را به واسطه فهم به او داده است، و این ضروری است. پس هنگامی که دو کلمه یا بیشتر منظم شوند، مجموع، آیه نامیده می‌شود، یعنی نشانه‌ای بر امری که هر کلمه به تنهایی آن امر را نمی‌دهد، مانند حروف با کلمه. زیرا مقرر شده است که مجموع، حکمی دارد که مفردات آن مجموع ندارند. پس هنگامی که آیات منظم شوند، به هر اندازه‌ای که متکلم بخواهد با آن برساند، مجموع، سوره نامیده می‌شود. معنای آن، منزلتی است که از مجموع این آیات ظاهر شده است و آیات به تنهایی آن منزلت را نمی‌دادند. و قرآن جز آنچه ذکر کردیم از سوره‌ها و آیات و کلمات و حروف نیست. پس من امری کلی در مورد قرآن به تو دادم. و منازل مختلف است، پس آیات مختلف می‌شوند، پس کلمات مختلف می‌شوند، پس نظم حروف مختلف می‌شود. و قرآن بزرگ و کثیر است. اگر می‌خواستیم آنچه را به آن اشاره کردیم، به تفصیل بیان کنیم، عمر کفایت نمی‌کرد. پس تو را به خودت واگذار کردیم تا گنج‌های آن را استخراج کنی. و این هنگامی است که آن را کلام قرار دهیم. اما اگر آن را کتاب نازل کنیم، نظم حروف رقمی است برای انتظام کلمات، برای انتظام آیات، برای انتظام سوره‌ها. همه این‌ها از دست نویسنده است، همان‌گونه که قول از نفس رحمانی بود. پس امر بر یک اندازه شد، اگرچه احوال مختلف است، زیرا حال تلفظ، حال کتابت نیست و صفت دست، صفت نفس نیست. پس کتاب بودن آن مانند صورت ظاهر و شهود (الشهود) است و کلام بودن آن مانند صورت باطن و غیب است. پس تو میان کثیف و لطیف هستی. و حروف در هر صورت نسبت به آنچه از دلالت بر معنای وضع شده برای آن حمل می‌کنند، کثیف هستند. و معنی ممکن است لطیف باشد و ممکن است کثیف باشد، اما دلالت در هر صورت لطیف است و آن چیزی است که حرف آن را حمل می‌کند و روح آن است، و روح لطیف‌تر از صورت است. سپس خدا برای قرآن، سوره‌ای از سوره‌ها را قلب قرار داده است و این سوره را معادل ده وزن قرآن قرار داده است. و برای آیات قرآن، آیه‌ای قرار داده که سیادت بر آیات قرآن را به آن عطا کرده است. و از سوره‌های این قرآن، سوره‌ای قرار داده که یک سوم و نصف و ربع آن وزن دارد، و این به دلیل منزلتی است که آن سوره به آن عطا کرده است. و همه آن کلام اوست. پس از حیث اینکه کلام اوست، تفاضلی نیست، و از حیث اینکه به آن تکلم شده است، تفاضل به دلیل اختلاف نظم واقع شده است. پس به سوی خدای تعالی تضرع کن تا آنچه را به آن اشاره کردیم، به تو بفهماند، زیرا او نعمت‌دهنده و احسان‌کننده است.\nقرآن نور است به دلیل آیاتی که شبهات گمراه‌کننده را دور می‌کند، مانند قول خدای تعالی: **«لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا»** (اگر در آن دو (آسمان و زمین) خدایانی جز الله بودند، قطعاً تباه می‌شدند) و قول او: **«لَا أُحِبُّ الْآفِلِينَ»** (من غروب‌کنندگان را دوست ندارم) و قول او: **«فَاسْأَلُوهُمْ إِن كَانُوا يَنطِقُونَ»** (پس از آن‌ها بپرسید اگر سخن می‌گویند) و قول او: **«فَأْتِ بِهَا مِنَ الْمَغْرِبِ»** (پس آن را از مغرب بیاور) و قول او: **«إِذًا لَّابْتَغَوْا إِلَىٰ ذِي الْعَرْشِ سَبِيلًا»** (در آن صورت، قطعاً به سوی صاحب عرش راهی می‌جستند) و قول او: **«لَّوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا»** (قطعاً در آن اختلاف بسیاری می‌یافتند) و قول او: **«فَأْتُوا بِسُورَةٍ مِّن مِّثْلِهِ»** (پس سوره‌ای مانند آن بیاورید). و هر آنچه در معرض دلالت آمده است، از جهت نور بودن آن است، زیرا نور همان است که ظلمت را دور می‌کند و به همین دلیل نور نامیده شده است، زیرا نور، نفور (دورکننده) است.\nو اما ضیاء (روشنایی) بودن آن، به دلیل آیاتی است که امور و حقایق را کشف (الکشف) می‌کند، مانند قول او: **«كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ»** (هر روز او در کاری است) و **«سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ»** (به زودی به حساب شما می‌پردازیم، ای جن و انس) و قول او: **«مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ»** (هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است) و قول او: **«أَنبِئُونِي بِأَسْمَاءِ هَؤُلَاءِ»** (مرا از نام‌های این‌ها خبر دهید) و قول او: **«لِمَا خَلَقْتُ بِيَدَيَّ»** (برای چیزی که با دو دست خود آفریدم) و قول او: **«وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ»** (و شما نمی‌خواهید مگر آنکه خدا بخواهد) و قول او: **«كُلٌّ مِّنْ عِندِ اللَّهِ»** (همه از نزد خداست) و قول او: **«فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا»** (پس فجور و تقوای آن را به آن الهام کرد) و آنچه شبیه این‌هاست که بر جریان حقایق دلالت می‌کند، و مانند قول او: **«وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ»** (و خدا شما و آنچه را عمل می‌کنید، آفریده است).\nو اما شفا بودن آن، مانند فاتحة الکتاب و همه آیات دعاهاست.\nو اما رحمت بودن آن، به دلیل آنچه خدا بر خود واجب کرده است از وعده به بندگانش به خیر و بشارت، مانند قول او: **«لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ»** (از رحمت خدا ناامید نشوید) و قول او: **«كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ»** (پروردگارتان رحمت را بر خود واجب کرده است) و قول او: **«وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ»** (و رحمت من همه چیز را فرا گرفته است) و هر آیه رجاء (امید).\nو اما هدایت بودن آن، هر آیه محکمی است و هر نصّی که در قرآن آمده و احتمال در آن راه ندارد و جز ظاهر در وهله اول از آن فهمیده نمی‌شود، مانند قول او: **«وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ»** (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند) و قول او: **«وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ»** (و برای شما در قصاص، زندگی است) و قول او: **«مَن جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَمَن جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَىٰ إِلَّا مِثْلَهَا»** (هر کس کار نیکی بیاورد، ده برابر آن پاداش دارد، و هر کس کار بدی بیاورد، جز مانند آن جزا داده نمی‌شود) و قول او: **«فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ»** (پس هر کس عفو کند و اصلاح نماید، پاداش او بر خداست) و امثال این آیات که کثرت آن‌ها قابل شمارش نیست.\nو اما ذکر بودن آن، به دلیل آیاتی است که شامل عبرت‌ها و قصص امت‌ها در هلاکتشان به سبب کفرشان است، مانند داستان قوم نوح و عاد و ثمود و قوم لوط و اصحاب ایکه و اصحاب رس.\nو اما عربی بودن آن، به دلیل حسن نظم و بیان محکم از متشابه و تکرار قصص با تغییر الفاظ از جهت افزایش و کاهش، همراه با وفای به معنای مطلوب در تعریف و اعلام، با ایجاز لفظ، مانند قول او: **«يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ»** (هر فریادی را علیه خود می‌پندارند) و قول او: **«مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا»** (آن را برای تو نزدند مگر از روی جدال) و قول او: **«يَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ وَقِيلَ بُعْدًا لِّلْقَوْمِ الظَّالِمِينَ»** (ای زمین، آب خود را فرو بر، و ای آسمان، بازایست، و آب فرو رفت و کار به انجام رسید و کشتی بر کوه جودی قرار گرفت و گفته شد: دوری باد بر قوم ستمکاران) و قول او: **«وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ»** (و به مادر موسی وحی کردیم که او را شیر ده، پس هنگامی که بر او ترسیدی، او را در دریا بینداز و نترس و غمگین مباش، همانا ما او را به تو بازمی‌گردانیم و او را از رسولان قرار می‌دهیم). همه این‌ها در یک آیه است که شامل دو بشارت و دو امر با علم نافع و تبیین با بشارت از جانب خداست.\nو اما مبین (آشکارکننده) بودن آن، به دلیل آنچه در آن از صفات اهل سعادت و اهل شقاوت و نعت‌های اهل رستگاری از غیر آن‌ها آشکار کرده است، مانند قول او: **«قَدْ أَفْلَحَ الْمُؤْمِنُونَ»** (به راستی که مؤمنان رستگار شدند) تا آخر آیات، و قول او: **«إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ»** (همانا خدا از مؤمنان جان‌هایشان را خرید) و آیات احکام و هر آیه‌ای که با آن امری را آشکار کرده تا شناخته شود. به همین دلیل آن را به همه این اسماء نامیده و آن را قرآن (قرآن) قرار داده است، یعنی ظاهر و جامع همه این معانی که جز در آن یافت نمی‌شود. و **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خدا حق را می‌گوید و او راه را هدایت می‌کند). سفر بیست و یکم با کمال این باب به پایان رسید."
  },
  "page_count": 6
}