{
  "id": 225,
  "title": {
    "ar": "الباب الخامس والعشرون ومائتان في معرفة الزوائد",
    "en": "Chapter Two Hundred and Twenty-Five: Concerning the Knowledge of the Augmentations (الزوائد)",
    "ur": "باب نمبر دو سو پچیس: زوائد کی معرفت میں",
    "fa": "باب دویست و بیست و پنجم در معرفت زوائد"
  },
  "content": {
    "ar": "## «الباب الخامس والعشرون ومائتان في معرفة الزوائد»\n\n\n### [الزوائد زيادات الايمان بالغيب واليقين‏]\n\n\nاعلم أن الزوائد في اصطلاح الصوفية من أهل الله تعالى زيادات الايمان بالغيب واليقين‏\n\n\n> إذا ما أنزلت بالنور سورة *** يزيد المؤمنون بها سرورا\n\n\n> فعلم الغيب أنفس كل علم *** وكان العلم أجمعه حضورا\n\n\n> وإدراك الغيوب بلا دليل *** سوى الرحمن لا يعطي ثبورا\n\n\n> وما للغيب عند الحق عين *** ولو جلى لك الاسم الخبيرا\n\n\n> لقد حجب العباد وكل عقل *** بحتى نعلم الجلد الصبورا\n\n\nقال الله تعالى وإِذا ما أُنْزِلَتْ سُورَةٌ فَمِنْهُمْ من يَقُولُ أَيُّكُمْ زادَتْهُ هذِهِ إِيماناً فَأَمَّا الَّذِينَ آمَنُوا فَزادَتْهُمْ إِيماناً وهُمْ يَسْتَبْشِرُونَ وأَمَّا الَّذِينَ في قُلُوبِهِمْ مَرَضٌ فَزادَتْهُمْ رِجْساً إِلَى رِجْسِهِمْ فلا بد من الزوائد في الفريقين وهي الشئون التي الحق عليها وفيها في كل يوم أي في كل نفس الذي هو أصغر الأيام غير إن الزوائد التي اصطلح عليها أهل الله هي ما تعطي من ذلك سعادة خاصة وعلما بغيب يزيده يقينا مثل قوله رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتى‏ قالَ أَ ولَمْ تُؤْمِنْ قالَ بَلى‏ ولكِنْ لِيَطْمَئِنَّ قَلْبِي يقول بلى آمنت ولكن وجوه الأحياء كثيرة متنوعة كما كان وجود الخلق فمن الخلق من أوجدته عن كن‏\nومنهم من أوجدته بيدك ومنهم من أوجدته بيديك ومنهم من أوجدته ابتداء ومنهم من أوجدته عن خلق آخر فتنوع وجود الخلق وإحياء الخلق بعد الموت إنما هو وجود آخر في الآخرة فقد يتنوع وقد يتوحد فطلبت العلم بكيفية الأمر هل هو متنوع أو واحد فإن كان واحدا فأي واحد هو من هذه الأنواع فإذا أعلمتني به اطمأن قلبي وسكن بحصول ذلك الوجه والزيادة من العلم مما أمرت بها قال تعالى آمرا وقُلْ رَبِّ زِدْنِي عِلْماً فأحاله على الكيفية بالطيور الأربعة التي هي مثال الطبائع الأربع إخبارا بأن وجود الآخرة طبيعي يعني حشر الأجساد الطبيعية إذ كان ثم من يقول لا تحشر الأجسام وإنما تحشر النفوس بالموت إلى النفس الكلية مجردة عن الهياكل الطبيعية فأخبر الله إبراهيم أن الأمر ليس كما زعم هؤلاء فأحاله على أمر موجود عنده تصرف فيه أعلاما أن الطبائع لو لم تكن مشهودة معلومة مميزة عند الله لم تتميز فما أوجد العالم الطبيعي إلا من شي‏ء معلوم عنده مشهود له نافذ التصرف فيه فجمع بعضها إلى بعض فأظهر الجسم على هذا الشكل الخاص فأبان لإبراهيم بإحالته على الأطيار الأربعة وجود الأمر الذي فعله الحق في إيجاد الأجسام الطبيعية والعنصرية إذ ما ثم جسم إلا طبيعي أو عنصري فأجسام النشأة الآخرة في حق السعداء طبيعية وأجسام أهل النار عنصرية لا تُفَتَّحُ لَهُمْ أَبْوابُ السَّماءِ فلو فتحت خرجوا عن العناصر بالترقي وأما حشر الأرواح التي يريد أن يعقلها إبراهيم من هذه الدلالة التي أحاله الحق عليها في الطيور الأربعة فهي في الإلهيات كون العالم يفتقر في ظهوره إلى إله قادر على إيجاده عالم بتفاصيل أمره مريد إظهار عينه حي لثبوت هذه النسب التي لا تكون إلا لحي فهذه أربعة لا بد في الإلهيات منها فإن العالم لا يظهر إلا ممن له هذه الأربعة فهذه دلالة الطيور له عليه السلام في الإلهيات في العقول والأرواح وما ليس بجسم طبيعي كما هي دلالة على تربيع الطبيعة لإيجاد الأجسام الطبيعية والعنصرية ثم قوله فَصُرْهُنَّ أي ضمهن والضم جمع عن تفرقة وبضم بعضها إلى بعض ظهرت الأجسام ثُمَّ اجْعَلْ عَلى‏ كُلِّ جَبَلٍ وهو ما ذكرناه من الصفات الأربع الإلهيات وهي أجبل لشموخها وثبوتها فإن الجبال أوتاد ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْياً ولا يدعى إلا من يسمع وله عين ثابتة فأقام له الدعاء بها مقام قوله كن في قوله إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ فزاد يقينه طمأنينة بعلمه بالوجه الخاص من الوجوه الإمكانية ومن الزوائد واتَّقُوا الله ويُعَلِّمُكُمُ الله فتزيد علما لم يكن عندك بعلمك إياه الحق تعالى تشريفا منحك إياه التقوى فمن جعل الله وقاية حجبه الله عن رؤية الأسباب بنفسه فرأى الأشياء تصدر من الله وقد كان هذا العلم مغيبا عنك فأعطاك العلم به زيادة الايمان بالغيب الذي لو عرض على أغلب العقول لردته ببراهينها فهذه فائدة هذا الحال ومن الزوائد أن تعلم أن حكم الأعيان ليس نفس الأعيان وأن ظهور هذا الحكم في وجود الحق وينسب إلى العبد بنسبة صحيحة وينسب إلى الحق بنسبة صحيحة فزاد الحق من حيث الحكم حكما لم يكن عليه وزاد العين إضافة وجود إليه لم تكن يتصف به أزلا فانظر ما أعجب حكم الزوائد ولهذا عمت الفريقين فزادت السعيد إيمانا وزادت الشقي رجسا ومرضا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 225: On the Knowledge of the *Zawā'id* (Increments)\n\n### [The *Zawā'id* are Increments of Faith in the Unseen and Certainty]\n\nKnow that the *Zawā'id* (Increments), in the technical terminology (اصطلاح) of the Sufis (الصوفية) among the People of God (أهل الله), are the increases in faith (الايمان) in the Unseen (الغيب) and certainty (اليقين).\n\n> When a Sura is revealed with the Light,\n> The believers increase in joy through it.\n> For the knowledge of the Unseen is the most precious of all knowledge,\n> And all knowledge was a Presence (حضورا).\n> And the realization of the Unseen without a proof,\n> Save the All-Merciful, does not lead to destruction.\n> The Unseen has no fixed entity (عين) with The Real (الحق),\n> Even if the Name The All-Aware (الخبيرا) is manifested to you.\n> Indeed, He has veiled the servants and every intellect,\n> Until we know the patient skin.\n\nAllah the Exalted said: <<وَإِذَا مَا أُنْزِلَتْ سُورَةٌ فَمِنْهُمْ مَنْ يَقُولُ أَيُّكُمْ زَادَتْهُ هَذِهِ إِيمَانًا فَأَمَّا الَّذِينَ آمَنُوا فَزَادَتْهُمْ إِيمَانًا وَهُمْ يَسْتَبْشِرُونَ وَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَى رِجْسِهِمْ>> (And when a Sura is revealed, some of them say, \"Which of you has this increased in faith?\" As for those who believed, it increased them in faith, and they rejoice. But as for those in whose hearts is a disease, it added defilement to their defilement.) [Q 9:124-125].\n\nThus, the *Zawā'id* are necessary for both groups. They are the Divine Affairs (الشئون) upon which The Real (الحق) acts and in which He acts every day—that is, in every breath (نفس), which is the smallest of days. However, the *Zawā'id* that the People of God (أهل الله) have adopted as a technical term are those that grant a special felicity and knowledge of the Unseen that increases certainty.\n\nAn example is His saying: <<رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَىٰ قَالَ أَوَلَمْ تُؤْمِنْ قَالَ بَلَىٰ وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي>> (My Lord, show me how You give life to the dead. He said, \"Have you not believed?\" [Abraham] said, \"Yes, but that my heart may be assured.\") [Q 2:260].\n\nHe says: Yes, I believed, but the modes (وجوه) of giving life are many and varied, just as the existence of creation was varied. For among creation, there are those You brought into existence through *Kun* (Be!), and those You brought into existence with Your Hand, and those You brought into existence with Your two Hands, and those You brought into existence initially, and those You brought into existence from another creation. Thus, the existence of creation is varied. And the giving of life to creation after death is merely another existence in the Hereafter. It may be varied, or it may be unified. So, I sought knowledge of the *how* (كيفية) of the matter: Is it varied or unified? If it is unified, which one of these types is it? If You inform me of it, my heart will be assured and settled by the attainment of that specific mode. And the increase in knowledge is something You commanded, for He said, commanding: <<وَقُلْ رَبِّ زِدْنِي عِلْمًا>> (And say, \"My Lord, increase me in knowledge.\") [Q 20:114].\n\nHe referred him to the *how* (الكيفية) through the four birds, which are the example of the four natures (الطبائع الأربع), informing him that the existence of the Hereafter is natural—meaning, the resurrection of the natural bodies. This is because there were those who claimed that bodies would not be resurrected, but rather souls would be resurrected upon death into the Universal Soul (النفس الكلية), stripped of their natural structures (الهياكل الطبيعية).\n\nSo, Allah informed Abraham that the matter was not as these people claimed. He referred him to something existing with Him, in which He acts, indicating that if the natures were not witnessed, known, and distinguished by God, they would not be distinguishable. He only brought the natural world into existence from something known to Him, witnessed by Him, and subject to His effective disposal. He gathered some parts to others and manifested the body in this specific form.\n\nThus, by referring Abraham to the four birds, He made clear the existence of the matter that The Real (الحق) enacted in bringing into existence the natural (طبيعية) and elemental (عنصرية) bodies, for there is no body except that which is natural or elemental. The bodies of the Next Life (النشأة الآخرة) for the felicitous are natural, while the bodies of the people of the Fire are elemental: <<لَا تُفَتَّحُ لَهُمْ أَبْوَابُ السَّمَاءِ>> (The gates of the heaven will not be opened for them) [Q 7:40]. If they were opened, they would exit the elements through spiritual ascent (الترقي).\n\nAs for the resurrection of the spirits, which Abraham intended to grasp from this indication to which The Real referred him concerning the four birds, its meaning in the Divine Sciences (الإلهيات) is that the cosmos (العالم) requires, for its manifestation, a God who is Capable of bringing it into existence, Knowing of its details, Willing to manifest its fixed entity (عين), and Living, for the establishment of these relations which belong only to the Living. These are four necessities in the Divine Sciences, for the cosmos cannot manifest except from One who possesses these four. This is the indication of the birds to him, peace be upon him, concerning the Divine Sciences, regarding the intellects, the spirits, and that which is not a natural body, just as it is an indication of the fourfold nature (تربيع الطبيعة) for the creation of natural and elemental bodies.\n\nThen His saying: <<فَصُرْهُنَّ>> (Then incline them toward you) [Q 2:260]—meaning, gather them. Gathering (الضم) is the collection from dispersion. By gathering some parts to others, bodies appeared. Then: <<ثُمَّ اجْعَلْ عَلَىٰ كُلِّ جَبَلٍ>> (Then place upon every mountain) [Q 2:260]—and this refers to the four Divine Attributes (الصفات الإلهيات) we mentioned, which are \"mountains\" (أجبل) due to their loftiness and permanence, for mountains are pegs (أوتاد). Then: <<ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْيًا>> (Then call them; they will come to you in haste) [Q 2:260]. And only that which hears and has a fixed entity (عين ثابتة) is called. Thus, He established the calling upon them in the place of His command *Kun* (Be!) in His saying: <<إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَن نَّقُولَ لَهُ كُن فَيَكُونُ>> (Indeed, Our word to a thing when We intend it is only that We say to it, \"Be,\" and it is.) [Q 16:40].\n\nSo, his certainty increased in assurance by his knowledge of the specific mode among the possible modes.\n\nAnd among the *Zawā'id* is: <<وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ>> (And fear Allah; and Allah teaches you) [Q 2:282]. Thus, you increase in knowledge that you did not possess, through The Real (الحق) teaching it to you, as an honor granted to you by piety (التقوى). Whoever makes God his shield (وقاية), God veils him from seeing the secondary causes (الأسباب) by themselves, so he sees things issuing forth from God. This knowledge was previously hidden from you, but He granted you knowledge of it, which is an increase in faith in the Unseen (الغيب)—a knowledge that, if presented to most intellects, they would reject with their proofs. This is the benefit of this spiritual state (الحال).\n\nAnd among the *Zawā'id* is that you know that the ruling (حكم) of the Fixed Entities (الأعيان) is not the Fixed Entities themselves, and that the manifestation of this ruling occurs in the Existence (وجود) of The Real (الحق). It is correctly attributed to the servant and correctly attributed to The Real. Thus, The Real increases, in terms of the ruling, a ruling that was not upon Him, and the Entity (العين) increases an attribution of existence to itself that it did not possess eternally (أزلا). Look how wondrous is the ruling of the *Zawā'id*! For this reason, it encompasses both groups: it increases the felicitous in faith and increases the wretched in defilement and disease. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way.) [Q 33:4].",
    "ur": "باب نمبر دو سو پچیس: زوائد (اضافوں) کی معرفت میں\n\n### [زوائد، ایمان بالغیب اور یقین کی زیادتیاں ہیں]\n\nجان لو کہ اہلِ اللہ میں صوفیہ کی اصطلاح میں زوائد (اضافے) سے مراد ایمان بالغیب (الإيمان بالغيب) اور یقین (الیقین) کی زیادتیاں ہیں۔\n\n> جب نور کے ساتھ کوئی سورت نازل ہوتی ہے\n> تو اس سے مومنوں کی خوشی بڑھ جاتی ہے۔\n> پس علمِ غیب ہر علم سے زیادہ نفیس ہے\n> اور تمام علم حاضر (موجود) تھا۔\n> اور غیوب کا ادراک بغیر کسی دلیل کے\n> سوائے رحمن کے، کوئی ناکامی نہیں دیتا۔\n> اور ذات حق (الحق) کے نزدیک غیب کی کوئی عین (حقیقت) نہیں ہے\n> اگرچہ وہ تم پر اسم الخبیر (بڑی خبر رکھنے والا) کا ظہور (التجلی) کرے۔\n> یقیناً اس نے بندوں اور ہر عقل کو پردے میں رکھا\n> تاکہ ہم صبر کرنے والی جلد (ظاہر) کو جان لیں۔\n\nاللہ تعالیٰ نے فرمایا: **\"اور جب کوئی سورت نازل کی جاتی ہے تو ان میں سے بعض کہتے ہیں کہ اس سورت نے تم میں سے کس کے ایمان میں اضافہ کیا ہے؟ سو جو لوگ ایمان لائے ہیں تو اس نے ان کے ایمان میں اضافہ کیا ہے اور وہ خوش ہو رہے ہیں۔ اور جن کے دلوں میں بیماری ہے تو اس نے ان کی گندگی میں مزید گندگی کا اضافہ کر دیا ہے۔\"** (التوبہ: ۱۲۴-۱۲۵) پس دونوں فریقوں میں زوائد (اضافوں) کا ہونا ضروری ہے، اور یہ وہ شؤون (الشئون) ہیں جن پر اور جن میں ذات حق (الحق) ہر دن جلوہ گر ہوتا ہے، یعنی ہر سانس میں جو کہ دنوں میں سب سے چھوٹا دن ہے۔ مگر وہ زوائد جن پر اہلِ اللہ نے اصطلاح قائم کی ہے، وہ وہ ہیں جو اس سے خاص سعادت اور غیب کا ایسا علم عطا کرتی ہیں جو اس کے یقین (الیقین) میں اضافہ کر دے، جیسے کہ (حضرت ابراہیم علیہ السلام کا) یہ قول: **\"اے میرے رب! مجھے دکھا کہ تو مُردوں کو کیسے زندہ کرتا ہے؟ فرمایا: کیا تو ایمان نہیں لایا؟ عرض کیا: کیوں نہیں، لیکن تاکہ میرے دل کو اطمینان ہو جائے۔\"** (البقرہ: ۲۶۰)\n\nوہ کہتے ہیں کہ: ہاں میں ایمان لایا، لیکن زندہ کرنے کے طریقے بہت اور متنوع ہیں، جیسا کہ مخلوق کا وجود (الوجود) تھا۔ پس مخلوق میں سے کچھ وہ ہیں جنہیں تو نے 'کُن' (ہو جا) سے وجود بخشا، اور کچھ وہ جنہیں تو نے اپنے ہاتھ سے وجود بخشا، اور کچھ وہ جنہیں تو نے اپنے دونوں ہاتھوں سے وجود بخشا، اور کچھ وہ جنہیں تو نے ابتداءً وجود بخشا، اور کچھ وہ جنہیں تو نے کسی دوسری مخلوق سے وجود بخشا۔ پس مخلوق کے وجود (الوجود) میں تنوع ہے، اور موت کے بعد مخلوق کو زندہ کرنا درحقیقت آخرت میں ایک دوسرا وجود (الوجود) ہے۔ یہ متنوع بھی ہو سکتا ہے اور واحد بھی۔ پس میں نے اس امر کی کیفیت کا علم طلب کیا کہ آیا یہ متنوع ہے یا واحد؟ اور اگر یہ واحد ہے تو ان انواع میں سے کون سا واحد ہے؟ پس جب تو مجھے اس سے آگاہ کر دے گا تو میرا دل مطمئن ہو جائے گا اور اس خاص طریقے کے حصول سے سکون پا لے گا، اور یہ علم میں وہ اضافہ ہے جس کا تو نے مجھے حکم دیا ہے۔ اللہ تعالیٰ نے حکم دیتے ہوئے فرمایا: **\"اور کہو: اے میرے رب! میرے علم میں اضافہ فرما۔\"** (طٰہٰ: ۱۱۴)\n\nپس ذات حق (الحق) نے چار پرندوں کے ذریعے کیفیت کی طرف اشارہ کیا، جو چار طبائع (فطرتوں) کی مثال ہیں، یہ بتانے کے لیے کہ آخرت کا وجود (الوجود) طبعی (فطری) ہے۔ یعنی طبعی اجسام کا حشر۔ کیونکہ وہاں کچھ لوگ تھے جو کہتے تھے کہ اجسام کا حشر نہیں ہوگا، بلکہ موت کے ذریعے نفوس کو کلی نفس کی طرف حشر کیا جائے گا، جو طبعی ڈھانچوں سے پاک ہوں گے۔ پس اللہ نے ابراہیم (علیہ السلام) کو خبر دی کہ معاملہ ایسا نہیں ہے جیسا کہ ان لوگوں نے گمان کیا، اور انہیں ایک ایسے امر کی طرف متوجہ کیا جو اس کے پاس موجود ہے اور جس میں وہ تصرف کرتا ہے، یہ بتانے کے لیے کہ اگر طبائع اللہ کے نزدیک مشہود، معلوم اور ممتاز نہ ہوتیں تو وہ ممتاز نہ ہوتیں۔ پس اس نے عالمِ طبعی کو صرف ایک ایسی شے سے وجود (الوجود) بخشا جو اس کے نزدیک معلوم ہے، اس کے لیے مشہود ہے، اور جس میں اس کا تصرف نافذ ہے۔ پس اس نے ان میں سے بعض کو بعض کے ساتھ جمع کیا اور جسم کو اس خاص شکل پر ظاہر کیا۔ پس چار پرندوں کی طرف اشارہ کر کے ابراہیم (علیہ السلام) پر اس امر کا وجود (الوجود) واضح کر دیا جو ذات حق (الحق) نے طبعی اور عنصری اجسام کو وجود (الوجود) بخشنے میں کیا، کیونکہ کوئی جسم یا تو طبعی ہوتا ہے یا عنصری۔ پس نیک بختوں کے حق میں آخرت کی نشوونما کے اجسام طبعی ہوں گے، اور اہلِ نار کے اجسام عنصری ہوں گے، **\"ان کے لیے آسمان کے دروازے نہیں کھولے جائیں گے۔\"** (الاعراف: ۴۰) اگر وہ کھولے جاتے تو وہ ترقی کے ذریعے عناصر سے باہر نکل جاتے۔\n\nاور جہاں تک ارواح کے حشر کا تعلق ہے جسے ابراہیم (علیہ السلام) ان چار پرندوں کی دلالت سے سمجھنا چاہتے تھے جس کی طرف ذات حق (الحق) نے انہیں متوجہ کیا، تو الٰہیات (علم الٰہی) میں اس کا مطلب یہ ہے کہ عالم اپنے ظہور (التجلی) میں ایک ایسے معبود کا محتاج ہے جو اسے وجود (الوجود) بخشنے پر قادر ہو، اس کے تفصیلی امر کا عالم ہو، اس کی عین (حقیقت) کو ظاہر کرنے کا ارادہ رکھنے والا ہو، اور زندہ ہو تاکہ ان نسبتوں کا ثبوت ہو جو صرف زندہ کے لیے ہوتی ہیں۔ پس یہ چار چیزیں ہیں جو الٰہیات میں ضروری ہیں، کیونکہ عالم صرف اسی سے ظاہر ہو سکتا ہے جس میں یہ چاروں صفات ہوں۔ پس یہ چار پرندے ابراہیم (علیہ السلام) کے لیے الٰہیات میں عقول، ارواح اور ان چیزوں کے بارے میں دلالت ہیں جو طبعی جسم نہیں ہیں، جیسا کہ یہ طبعی اور عنصری اجسام کو وجود (الوجود) بخشنے کے لیے طبیعت کے چار حصوں میں تقسیم ہونے پر بھی دلالت کرتے ہیں۔\n\nپھر اس کا قول: **\"فَصُرْهُنَّ\"** (پس انہیں اپنے ساتھ ملا لو)، یعنی انہیں جمع کر لو۔ اور جمع کرنا تفریق کے بعد ہوتا ہے، اور بعض کو بعض کے ساتھ جمع کرنے سے اجسام ظاہر ہوئے۔ **\"ثُمَّ اجْعَلْ عَلى‏ كُلِّ جَبَلٍ\"** (پھر ہر پہاڑ پر رکھ دو)، اور یہ وہی چار الٰہی صفات ہیں جن کا ہم نے ذکر کیا، اور وہ اپنے شموخ اور ثبوت کی وجہ سے پہاڑ ہیں، کیونکہ پہاڑ میخیں (اوتاد) ہوتے ہیں۔ **\"ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْياً\"** (پھر انہیں پکارو، وہ تمہارے پاس دوڑتے ہوئے آئیں گی)، اور صرف اسی کو پکارا جاتا ہے جو سنتا ہو اور جس کی ایک ثابت عین (حقیقت) ہو۔ پس ذات حق (الحق) نے ان کے ذریعے پکار کو اپنے اس قول میں 'کُن' (ہو جا) کے مقام پر قائم کیا: **\"ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے کہ ہم اسے کہیں: 'ہو جا'، پس وہ ہو جاتی ہے۔\"** (النحل: ۴۰) پس اس کے یقین (الیقین) میں امکانی طریقوں میں سے خاص طریقے کے علم سے مزید اطمینان پیدا ہو گیا۔\n\nاور زوائد (اضافوں) میں سے یہ بھی ہے کہ: **\"اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے۔\"** (البقرہ: ۲۸۲) پس تمہارے علم میں اضافہ ہوتا ہے جو تمہارے پاس نہیں تھا، اس لیے کہ ذات حق (الحق) نے تمہیں تقویٰ عطا کر کے یہ علم تمہیں بطور شرف بخشا۔ پس جس نے اللہ کو ڈھال بنا لیا، اللہ اسے اسباب کو خود دیکھنے سے پردے میں رکھتا ہے، پس وہ چیزوں کو اللہ کی طرف سے صادر ہوتے ہوئے دیکھتا ہے۔ اور یہ علم تم سے پوشیدہ تھا، پس اس نے تمہیں اس کا علم عطا کیا، جو ایمان بالغیب (الإيمان بالغيب) میں اضافہ ہے، جسے اگر اکثر عقلوں پر پیش کیا جائے تو وہ اپنی دلیلوں سے اسے رد کر دیتے۔ پس یہ اس حال کا فائدہ ہے۔ اور زوائد میں سے یہ بھی ہے کہ تم جان لو کہ اعیان (حقائق) کا حکم خود اعیان نہیں ہے، اور یہ کہ اس حکم کا ظہور (التجلی) وجود حق (الوجود) میں ہوتا ہے، اور اس کی نسبت بندے کی طرف بھی صحیح نسبت سے ہوتی ہے اور ذات حق (الحق) کی طرف بھی صحیح نسبت سے ہوتی ہے۔ پس ذات حق (الحق) میں حکم کے لحاظ سے ایک ایسا حکم بڑھ گیا جو پہلے اس پر نہیں تھا، اور عین (حقیقت) میں وجود (الوجود) کا ایک ایسا اضافہ ہو گیا جس سے وہ ازل میں متصف نہیں تھا۔ پس دیکھو کہ زوائد کا حکم کتنا عجیب ہے، اور اسی وجہ سے یہ دونوں فریقوں پر محیط ہو گیا، پس نیک بخت کے ایمان میں اضافہ کیا اور بدبخت کی گندگی اور مرض میں اضافہ کیا۔ اور اللہ **\"حق کہتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے۔\"** (الاحزاب: ۴)",
    "fa": "«باب دویست و بیست و پنجم در معرفت زوائد (al-Zawā’id)»\n\n### [زوائد، افزایش‌های ایمان به غیب و یقین هستند]\n\nبدان که زوائد (al-Zawā’id) در اصطلاح صوفیه از اهل الله، افزایش‌های ایمان به غیب و یقین هستند.\n\n> چون سوره‌ای با نور نازل شود، *** مؤمنان به واسطه‌ی آن شادمانی‌شان افزون می‌گردد.\n> پس علم غیب شریف‌ترینِ هر علمی است، *** و همه‌ی علم، حضوری (ḥuḍūr) بود.\n> و درک غیوب بدون دلیلی *** جز رحمان، هلاکت نمی‌آورد.\n> و غیب نزد حق (al-Ḥaqq) عینی ندارد، *** اگرچه اسم خبیر (al-Khabīr) بر تو تجلی کند.\n> همانا بندگان و هر عقلی محجوب گشتند، *** تا آنکه پوست صبور را بشناسیم.\n\nحق (al-Ḥaqq) تعالی فرمود: «وَ إِذا ما أُنْزِلَتْ سُورَةٌ فَمِنْهُمْ من يَقُولُ أَيُّكُمْ زادَتْهُ هذِهِ إِيماناً فَأَمَّا الَّذِينَ آمَنُوا فَزادَتْهُمْ إِيماناً وهُمْ يَسْتَبْشِرُونَ وأَمَّا الَّذِينَ في قُلُوبِهِمْ مَرَضٌ فَزادَتْهُمْ رِجْساً إِلَى رِجْسِهِمْ» (و چون سوره‌ای نازل شود، برخی از آنان می‌گویند: این سوره ایمان کدام یک از شما را افزود؟ اما کسانی که ایمان آوردند، بر ایمانشان افزود و آنان شادمان می‌شوند. و اما کسانی که در دل‌هایشان مرضی است، پلیدی بر پلیدی‌شان افزود). پس زوائد (al-Zawā’id) در هر دو گروه ضروری است، و آن همان شئون (al-Shu’ūn) است که حق (al-Ḥaqq) هر روز بر آن و در آن است؛ یعنی در هر نَفَس که کوچک‌ترینِ روزهاست. جز اینکه زوائدی که اهل الله بر آن اصطلاح کرده‌اند، آن چیزی است که از این شئون، سعادتی خاص و علمی به غیب می‌بخشد که یقین او را می‌افزاید.\n\nمانند سخن او (ابراهیم): «رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتى‏ قالَ أَ ولَمْ تُؤْمِنْ قالَ بَلى‏ ولكِنْ لِيَطْمَئِنَّ قَلْبِي» (پروردگارا، به من نشان ده چگونه مردگان را زنده می‌کنی؟ فرمود: آیا ایمان نیاورده‌ای؟ گفت: آری، ولی برای آنکه قلبم آرام گیرد). می‌گوید: آری ایمان آوردم، اما وجوه زنده‌کردن‌ها بسیار و متنوع است، همان‌گونه که وجود (al-Wujūd) خلق متنوع بود. پس برخی از خلق را از «کُن» ایجاد کردی، و برخی را با دستت، و برخی را با دو دستت، و برخی را از ابتدا ایجاد کردی، و برخی را از خلقی دیگر به وجود آوردی. پس تنوع وجود (al-Wujūd) خلق و زنده‌کردن خلق پس از مرگ، همانا وجودی دیگر در آخرت است که ممکن است متنوع باشد یا واحد. پس من علم به کیفیت این امر را طلب کردم که آیا متنوع است یا واحد؟ و اگر واحد است، کدام یک از این انواع است؟ پس چون مرا به آن آگاه سازی، قلبم آرام گیرد و با حصول آن وجه، سکون یابد؛ و این افزایش علم از چیزهایی است که به آن امر فرمودی.\n\nحق (al-Ḥaqq) تعالی امرکنان فرمود: «وقُلْ رَبِّ زِدْنِي عِلْماً» (و بگو پروردگارا، علم مرا بیفزا). پس او را به کیفیت (چگونگی) با چهار پرنده ارجاع داد که مثال طبایع چهارگانه هستند؛ این خبر از آن می‌دهد که وجود (al-Wujūd) آخرت طبیعی است، یعنی حشر اجساد طبیعی. زیرا کسانی بودند که می‌گفتند اجسام محشور نمی‌شوند، بلکه نفوس پس از مرگ به سوی نفس کلی محشور می‌شوند در حالی که از هیاکل طبیعی مجرد گشته‌اند. پس خداوند به ابراهیم خبر داد که امر آن‌گونه نیست که اینان گمان کرده‌اند. پس او را به امری موجود نزد خود ارجاع داد که در آن تصرف کرد، تا اعلام کند که اگر طبایع نزد خداوند مشهود، معلوم و متمایز نبودند، متمایز نمی‌شدند. پس عالم طبیعی را ایجاد نکرد مگر از چیزی که نزد او معلوم و برای او مشهود است و تصرف او در آن نافذ است. پس برخی از آن‌ها را به برخی دیگر جمع کرد و جسم را بر این شکل خاص ظاهر ساخت. پس با ارجاع ابراهیم به پرندگان چهارگانه، وجود (al-Wujūd) امری را که حق (al-Ḥaqq) در ایجاد اجسام طبیعی و عنصری انجام داده است، برای او آشکار ساخت؛ زیرا هیچ جسمی نیست مگر طبیعی یا عنصری. پس اجسام نشأت آخرت در حق سعادتمندان طبیعی است و اجسام اهل آتش عنصری است: «لا تُفَتَّحُ لَهُمْ أَبْوابُ السَّماءِ» (درهای آسمان بر ایشان گشوده نمی‌شود). زیرا اگر گشوده می‌شد، با ترقی از عناصر خارج می‌شدند.\n\nو اما حشر ارواح که ابراهیم می‌خواست آن را از این دلالتی که حق (al-Ḥaqq) او را در پرندگان چهارگانه به آن ارجاع داد، درک کند؛ آن در الهیات (al-Ilāhiyyāt) این است که عالم در ظهور خود نیازمند به خدایی است که قادر بر ایجاد آن، عالم به جزئیات امر آن، مرید اظهار عین آن، و زنده (حی) باشد تا این نسبت‌ها که جز برای زنده ثابت نمی‌شود، ثابت گردد. پس این چهار صفت در الهیات (al-Ilāhiyyāt) ضروری است، زیرا عالم ظاهر نمی‌شود مگر از کسی که این چهار صفت را داراست. پس این دلالت پرندگان برای او (علیه السلام) در الهیات، در عقول و ارواح و آنچه جسم طبیعی نیست، می‌باشد؛ همان‌گونه که دلالت بر چهارگانه بودن طبیعت برای ایجاد اجسام طبیعی و عنصری است.\n\nسپس سخن او: «فَصُرْهُنَّ» (پس آن‌ها را پاره‌پاره کن/متمایل ساز) یعنی آن‌ها را به هم ضمیمه کن. و ضمیمه کردن، جمع کردن از تفرقه است، و با ضمیمه کردن برخی به برخی دیگر، اجسام ظاهر شدند. «ثُمَّ اجْعَلْ عَلى‏ كُلِّ جَبَلٍ» (سپس بر هر کوهی قرار ده) و آن همان صفات چهارگانه الهی است که ذکر کردیم، و آن‌ها به دلیل عظمت و ثبوتشان کوه هستند، زیرا کوه‌ها میخ‌های زمین‌اند. «ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْياً» (سپس آن‌ها را بخوان، شتابان نزد تو می‌آیند). و خوانده نمی‌شود مگر کسی که می‌شنود و عینی ثابت دارد. پس خواندن آن‌ها را برای او به جای سخن «کُن» (باش) قرار داد، در سخن خود: «إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ» (همانا سخن ما برای چیزی که اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود). پس یقین او با علم به وجه خاصی از وجوه امکانی، بر طمأنینه (آرامش)اش افزود.\n\nو از زوائد (al-Zawā’id) این است: «واتَّقُوا الله ويُعَلِّمُكُمُ الله» (و از خدا پروا کنید و خداوند به شما می‌آموزد). پس علم تو به حق (al-Ḥaqq) تعالی، علمی را که نزد تو نبود، می‌افزاید؛ این تشریفی است که تقوا (al-Taqwā) را به تو بخشیده است. پس هر کس خداوند را سپر خود قرار دهد، خداوند او را از دیدن اسباب به خودی خود محجوب می‌سازد، پس اشیاء را می‌بیند که از خداوند صادر می‌شوند. و این علم از تو پنهان بود، پس خداوند علم به آن را به تو داد که افزایش ایمان به غیب است؛ غیبی که اگر بر اغلب عقول عرضه می‌شد، آن را با براهین خود رد می‌کردند. پس این فایده‌ی این حال است.\n\nو از زوائد (al-Zawā’id) این است که بدانی حکم اعیان (al-A’yān) عین اعیان نیست، و ظهور این حکم در وجود (al-Wujūd) حق (al-Ḥaqq) است و به نسبت صحیحی به بنده و به نسبت صحیحی به حق (al-Ḥaqq) نسبت داده می‌شود. پس حق (al-Ḥaqq) از حیث حکم، حکمی را افزود که بر او نبود، و به عین (al-A’yn) اضافه‌ی وجودی را افزود که ازلاً به آن متصف نبود. پس بنگر که حکم زوائد (al-Zawā’id) چقدر شگفت‌انگیز است، و به همین دلیل هر دو گروه را فرا گرفت؛ پس بر ایمان سعادتمند افزود و بر پلیدی و مرض شقی افزود. و «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏» (و خداوند حق (al-Ḥaqq) را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}