{
  "id": 90,
  "title": {
    "ar": "الباب الموفي تسعين في معرفة الفرائض والسنن",
    "en": "Chapter Ninety: Concerning the Knowledge of the Obligatory Duties (al-Farā'iḍ) and the Recommended Practices (al-Sunan)",
    "ur": "نواسیواں باب فرائض اور سنن کی معرفت کے بیان میں",
    "fa": "باب نودم در معرفت فرائض و سنن"
  },
  "content": {
    "ar": "## (الباب الموفي تسعين في معرفة الفرائض والسنن)\n\n\n> إن الفرائض كالركائب والسنن *** مثل الطريق لها إلى غاياتها\n\n\n> فإذا قطعت الضرب كنت فريضة *** فتكون سمع الحق في آياتها\n\n\n> عكس النوافل فاعتبرها والتزم *** طرق الفضائل واسع في إثباتها\n\n\n### [الفرض العين الفرض الكفاية الفرض المشروط]\n\n\nالفرائض هي الأعمال أو التروك التي أوجبها الله تعالى على عباده وقطعها عليهم وأثم من لم يقم بها وهي على قسمين فرض عين وهو الذي لا يسقط عنه إذا عمله غيره وفرض كفاية وهو الذي يسقط عنه إذا قام به غيره وقد كان قبل قيام الغير به متعينا عليه وعلى ذلك الغير كالصلاة على الجنازة وغسل الميت والجهاد وثم فرض آخر يلوح بينهما له طرف إلى كل واحد منهما يخالف حكم الآخر مثل الحج المفروض إذا لم يستطع وهو إن كان غير مخاطب به إلا مع الاستطاعة فهو فرض متوقف على شرطه فإذا حج عنه وليه سقط عنه وكان له الأجر أجر الأداء وليس هذا في فرض الكفاية لوجود الأجر ولا في فرض الصلاة لعدم سقوطها عمن صليت عنه فلا يشبه فرض الصلاة ولا يشبه فرض الكفاية\n\n\n### [السنن قسمان: سنة أمر بها الرسول وسنة ابتدعها واحد من الأمة]\n\n\nوأما السنن فكل ما عدا ما تعين عمله وهو على قسمين سنة أمر بها وحرض عليها أو فعلها بنفسه وخير أمته في فعلها وسنة ابتدعها واحد من الأمة فاتبع فيها فله أجرها وأجر من عمل بها\n\n\n### [ثمرة عمل الفريضة في حياة المكلف‏]\n\n\nفالفرض إذا جاء به العبد موفى فقد وفى ما تستحقه الربوبية عليه من العبودة فينتج له عمل الفريضة أمرا هو أعلى من أن يكون الحق سمعه فإن كون الحق سمع العبد حال للعبد وحكم الفرض يحول بينه وبين هذه الحال وهو أن يكون سمعا للحق فيسمع الحق بالعبد وهو قوله جعت فلم تطعمني وأما هذه الحيلولة التي أعطاها الفرض من أن يكون الحق سمعه هي مقام محقق ثابت كما هو في نفس الأمر فيعرف عند ذلك العبد أن الحق هو لا هو وصاحب الحال يقول أنا\n\n\n### [السنة النبوية والسنن التي هي شرائع مستحسنة بعد رسول الله ص‏]\n\n\nوالسنن طرق الاقتداء وأعلاها الاقتداء بالحق حتى أكون في إطلاق أسمائه علي قريبا من التحقق بها لا من التخلق وأدناها في حق الولي الاقتداء بالذين قال الله فيهم أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ والعلماء ورثة الأنبياء وما ورثوا إلا العلم‏\n\n\nفالسنة النبوية عالية المقام وهي الجمعية على الدين وإقامته وأن لا يتفرق فيه فهي تعلو بمن يأتيها ويسلك فيها في الحضرات المحمدية إلى غاياتها في المعارف والأحوال والتجلي وأما السنن التي هي الشرائع المستحسنة بعد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو الاستحسان عند الفقهاء الذي قال فيه الشافعي رحمه الله من استحسن فقد شرع فأخذها الفقهاء منه على جهة الذم وهو رضي الله عنه نطق بحقيقة مشروعة له لم تفهم عنه فإنه كان من الأربعة الأوتاد وكان قيامه بعلم الشرع حجبه عن أهل زمانه ومن بعده روينا عن بعض الصالحين أنه لقي الخضر فقال له ما تقول في الشافعي فقال هو من الأوتاد فقال فما تقول في أحمد بن حنبل قال رجل صديق قال فما تقول في بشر الحافي قال ما ترك بعده مثله فهذه شهادة الخضر في الشافعي رحمه الله‏\n\n\n### [الشرع أباح البدعة الحسنة]\n\n\nولما صح عند الشافعي‏\n\n\nأن النبي صَلَّى اللهُ عَليهِ وسَلَّم قال من سن سنة حسنة فله أجرها وأجر من عمل بها ومن سن سنة سيئة\n\n\nالحديث فلا شك أن الشرع قد أباح له أن يسن سنة حسنة وهي من جملة ما ورث من الأنبياء وهي حسنة أي يستحسنها الحق منه وهو سنها فمن استحسن أي من سن سنة حسنة فقد شرع ويا عجبا من عدم فهم الناس كلام الشافعي في هذا وهم يثبتون حكم المجتهد وإن أخطأ\nفي نفس الأمر وقد أقره الشارع وهو حكم شرعي مقبول لا يحل لأحد من الحكام رده وقواعد الشرع وأصوله تحفظه وكالمصالح المرسلة في مذهب مالك‏\n\n\n### [الاختيارات الإلهية في الموجودات واختيارات الأكياس في المشروعات‏]\n\n\nولما قرر الشارع حكمها مجملا وأبان أن واضعها ومتبعيه فيها مأجورون ونهاية التابعين فيها إلى واضعها على قدره وقدر ما سن نبهتك بهذا أن تكون أوقاتك معمورة بالشرائع النبوية والسنن الأصلية فإن الكيس ينبغي أن لا يكون غاية عمله إلا نبوة أصلية لا فرعية إذ كان له الاختيار في الاختيار لما كانت الأمور في أنفسها تقبل الاختيار كما فعل سبحانه في جميع الموجودات فاختار من كل أمر في كل جنس أمرا ما كما اختيار من الأسماء الحسنى كلمة الله واختار من الناس الرسل واختار من العباد الملائكة واختار من الأفلاك العرش واختار من الأركان الماء واختار من الشهور رمضان واختار من العبادات الصوم واختار من القرون قرن النبي صَلَّى اللهُ عَليهِ وسَلَّم واختار من أيام الأسبوع يوم الجمعة واختار من الليالي ليلة القدر واختار من الأعمال الفرائض واختار من الأعداد التسعة والتسعين واختار من الديار الجنة واختار من أحوال السعادة في الجنة الرؤية واختار من الأحوال الرضي واختار من الأذكار لا إله إلا الله واختار من الكلام القرآن واختار من سور القرآن سورة يس واختار من آي القرآن آية الكرسي واختار من قصار المفصل قُلْ هُوَ الله أَحَدٌ واختار من أدعية الأزمنة دعاء يوم عرفة واختار من المراكب البراق واختار من الملائكة الروح واختار من الألوان البياض واختار من الأكوان الاجتماع واختار من الإنسان القلب واختار من الأحجار الحجر الأسود واختار من البيوت البيت المعمور واختار من الأشجار السدرة واختار من النساء مريم وآسية واختار من الرجال محمدا صَلَّى اللهُ عَليهِ وسَلَّم واختار من الكواكب الشمس واختار من الحركات الحركة المستقيمة واختار من النواميس الشريعة المنزلة واختار من البراهين البراهين الوجودية واختار من الصور الصور الآدمية لذلك أبرزها على الصورة الإلهية واختار من الأنوار ما يكون معه النظر واختار من النقيضين الإثبات ومن الضدين الوجود واختار الرحمة على الغضب واختار من أحوال أفعال الصلاة السجود ومن أقوالها ذكر الله ومن أصناف الإرادات النية فلها الحكم في قبول العمل ورده فإنه‏\n\n\nلكل امرئ ما نوى‏\n\n\nويلحق غير العامل بالعامل في الأجر وزيادة\n\n\n### [اختيار ذكر الله من بين أقوال الصلاة]\n\n\nوأما ذكر الله من أقوال الصلاة فإن ذكر الله منها أكبر ما فيها هكذا قال عز وجل إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ ولَذِكْرُ الله أَكْبَرُ فإن الصلاة مناجاة والذاكر جليسه الحق فإن ذكره به فهو تعالى لسانه‏\n\n\n### [اختيار السجود من بين أفعال الصلاة]\n\n\nوأما اختياره السجود في أفعال الصلاة فلما فيه من العصمة من الشيطان فإنه لا يفارقه في شي‏ء من أفعال الصلاة إلا في السجود خاصة لأنه خطيئته وعند السجود يبكي ويتأسف ويندم والندم توبة ولا بد من قبول ذلك القدر فهو يتوب عند كل سجدة وإن الله يحب كل مفتن تواب‏\n\n\nثم يعود إلى الإغواء عند الرفع من السجود هكذا\n\n\n### [اختيار الرحمة على الغضب‏]\n\n\nوأما اختياره الرحمة على الغضب فلأنها تفعل بالمنة وتفعل بالوجوب ووَسِعَتْ كُلَّ شَيْ‏ءٍ والغضب من الأشياء التي وسعته الرحمة فما ثم غضب خالص غير مشوب برحمة والرحمة لا يشوبها غضب ومن يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوى‏ فالغضب جعله يهوى فإذا هوى وهو السقوط وهو حكم الغضب لا غير فيسقط في الرحمة فتسعه وتتلقاه فلا يسقط إلا إليها وبالرحمة التي في الغضب سقط فهي التي جعلت الغضب يهوى به لتستلمه الرحمة الخالصة كالرحمة التي في الدواء الكرية فيشربه العليل على كراهة فيه رحمة خفية من أجلها استعمل الدواء الكرية في الوقت لتسلمه إلى العافية وهي الرحمة الخالصة ولهذا كان المال إلى الرحمة وحكمها وإن لم يخرجوا من النار فلهم فيها نعيم والله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ أ لا ترى إلى ما جعل الله في النار في الدنيا من المنافع والراحات ولو لم يكن إلا الكي بها لبعض العلل فإنه أقطع الأدوية ولقوته في أثره قدح في التوكل لأنه يقوم في الفعل مقام الشافي والمعافي فحكمت الغيرة على المكتوي بأنه غير متوكل‏\n\n\n### [اختيار الوجود من الضدين‏]\n\n\nوأما اختيار الوجود من الضدين فلأنه صفته فاختار للممكنات صفته ولا يصح إلا هذا فإن له الاقتدار والاقتدار لا يكون عنه إلا الوجود أ لا تراه لما قال إِنْ يَشَأْ يُذْهِبْكُمْ قال ويَأْتِ بِآخَرِينَ فأبى الاقتدار إلا الوجود وعلق الإرادة بالإعدام وله الاسم المانع والمنع عدم‏\n\n\n### [اختيار الإثبات على النفي‏]\n\n\nوأما اختياره الإثبات فهو عين الشي‏ء الذي يقول له كن لأنه في حال عدمه رجح له الإثبات على النفي حتى لا يزال ممكنا في‏\nحال عدمه وهي مسألة دقيقة في الترجيح في حال العدم وبذلك الافتقار الذاتي الذي في الممكن قبل الوجود إذا أراده الحق منه وأسرع إليه بحكم الإثبات الذي هو عليه‏\n\n\n### [النور المختار من بين الأنوار]\n\n\nوأما النور المختار من الأنوار فإن الأنوار حجب ولذلك‏\n\n\nقال في الأنوار الحجابية نور إني أراه‏\n\n\nثم وعد بالرؤية وهو نور فلا بد أن يكون النور الذي يظهر فيه لعباده مختارا من تلك الأنوار الحجابية كنور الأحدية والعزة والكبرياء والعظمة فهذه كلها ترفع عن البصر ويبقى حكمها في القلب فبرفعها تقع الرؤية للحق تعالى ويبقى حكمها في القلب ويفنى العبيد عن الرؤية ولو لا ذلك لشهدوا نفوسهم عند شهوده‏\n\n\n### [اختيار الصورة الآدمية]\n\n\nوأما اختياره الصورة الآدمية فلأنه خلق آدم على صورته فأطلق عليه جميع أسمائه الحسنى وبقوتها حمل الأمانة المعروضة وما أعطته هذه الحقيقة أن يردها كما أبت السموات والأرض والجبال حملها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً لو لم يحملها جَهُولًا لأن العلم بالله عين الجهل به العجز عن درك الإدراك إدراك فإنه إذا علم إن ثم ما لم يعلم فما علم وهو العلم بأن ثم ما لا يعلم وليس لعلمه متعلق إلا الجهل به‏\n\n\n### [اختيار البراهين الوجودية من البراهين الجدلية وغيرها]\n\n\nوأما اختياره البراهين الوجودية من البراهين الجدلية وغيرها فلما تعطيه من تمام العلم بثبوت الحق وإبطال حجة الخصم والبراهين الجدلية ليست لها هذه القوة فإنها تبطل حجة الخصم وقد لا تثبت حقا والبراهين السوفسطائية تنتج حيرة وهي أقرب إلى البراهين الوجودية في العلم الإلهي من وجه من البراهين الجدلية\n\n\n### [اختيار الشريعة المنزلة على النواميس الحكمية]\n\n\nوأما اختياره الشريعة المنزلة فلما لها من عموم التعلق بالدار الآخرة ومصالح الدنيا وليست النواميس الحكمية الموضوعة لمصالح الدنيا وبقاء الخير في عالم الدنيا لها حكم لتحكم على الله بالقرب الإلهي وقبول الأعمال ورفع الدرجات وإثبات الجنات ودار الشقاء لا يستقل بذلك كله إلا الشرع المنزل من عند الله وأما الذين ابتدعوا عبادات ورعوها حق رعايتها ابتغاء رضوان الله مما لم يكتبها الله عليهم فهم أصحاب شرع منزل من عند الله فسنوا فيه سننا حسنة مناسبة لما سنها الشرع بالشرع المنزل فيهم وأباح لهم أن يسنوا وأما النواميس الحكمية فما هي التي سنها هؤلاء ولهذا جعل لهم الأجر\n\n\n### [اختيار الحركة المستقيمة]\n\n\nوأما اختياره الحركة المستقيمة فإنه عَلى‏ صِراطٍ مُسْتَقِيمٍ كما قال عن نفسه واختص بها الإنسان الذي خلقه الله على صورة الحق وفيها يحشر السعيد يوم القيامة فهي له دنيا وآخرة فإن المجرمين يحشرون منكوسين وهي الحركة المنكوسة كما قال تعالى في حق المجرمين ولَوْ تَرى‏ إِذِ الْمُجْرِمُونَ ناكِسُوا رُؤُسِهِمْ عِنْدَ رَبِّهِمْ والحركة المعوجة الأفقية في البهائم فلم تصح الحركة المستقيمة إلا لمن خلقه الله على الصورة وذلك الإنسان الكامل الذي له هذه الصفة في الدنيا والآخرة ولهذا خص بها ذكر آدم لأنه من أهل السعادة التي تبقي عليه هذه الحركة المستقيمة ولهذا نعت بالخلافة\n\n\n### [اختيار الشمس‏]\n\n\nوأما اختياره الشمس فلما لها من الإمداد في جميع الكواكب المستنيرة علوا وسفلا ولهذا قال إبراهيم عليه السلام هذا أَكْبَرُ واختصت على المذهبين بالقلب من الكرة وهي السماء الرابعة وفيها إدريس عليه السلام والله قد ذكر أنه رفعه مَكاناً عَلِيًّا فعلو هذا المكان من كونه قلب الأفلاك فهو مكان عال بالمكانة وما فوقه وإن كان دونه فهو أعلى بالمسافة وبنسبته إلى رءوسنا وهو الذي أحدث الليل والنهار بطلوعه وغروبه الذي جعل الله لهما الغشيان وهو النكاح والإيلاج لظهور أعيان المولدات وما يحدث الله في الليل والنهار من المخلوقات عن هذا الإيلاج والغشيان وجعل لكل واحد من هذين الموجودين عن الحركة الشمسية الطلب الحثيث لإبراز أعيان الحوادث عن هذا الطلب‏\n\n\n### [اختياره محمد ص‏]\n\n\nوأما اختياره محمدا صَلَّى اللهُ عَليهِ وسَلَّم فلما اقتضاه مزاجه دون الأمزجة الإنسانية من الكمال والاعتدال إذ به شاهد نبوته وآدم بين الماء والطين وهو متفرق الأجزاء في المولدات العنصرية وهي مسألة دقيقة لا يعرفها إلا من عرف أخذ الذرية من ظهر آدم حين أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ ف قالُوا بَلى‏ وهي الفطرة التي ولد الناس عليها وإليها ينتهون وفي هذا الجمع‏\n\n\nقال الأرواح أجناد مجندة\n\n\nولما جمعهم جمعهم في حضرة التمثيل فما كان وجها لوجه هناك تعارفوا هنا وما وقع ظهر الظهر هناك تناكر هنا وما بينهما من وجه إلى ظهر وجانب وغير ذلك وفي هذا أقول‏\n\n\n> إن القلوب لأجناد مجندة *** في حضرة الجمع تبدو ثم تنصرف‏\n\n\n> فما تعارف منها فهو مؤتلف *** وما تناكر منها فهو مختلف‏\n\n\nوإن كل أحد يقر بهذه الشهادة في الآخرة ولا ينكر ولا يدعي لنفسه ربوبية يقول تعالى إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا من الَّذِينَ اتَّبَعُوا\nفكان صَلَّى اللهُ عَليهِ وسَلَّم أعظم مجلى إلا هي علم به علم الأولين والآخرين ومن الأولين علم آدم بالأسماء وأوتي محمد صَلَّى اللهُ عَليهِ وسَلَّم جوامع الكلم وكلمات الله لا تنفد وله السيادة التي لا تبعد على الناس يوم القيامة فيشفع في الشافعين أن يشفعوا من ملك ورسول ونبي وولي ومؤمن وله المقام المحمود في اليوم المشهود\n\n\n### [اختيار مريم وآسية]\n\n\nوأما اختياره مريم وآسية فهو إلحاقهما بالكمال الذي للرجال مع وجود الدرجة التي للرجال عليهن فإن تلك الدرجة وجودية فلا تزول‏\n\n\n### [اختيار السدرة]\n\n\nوأما اختياره السدرة فلأنها موضع انتهاء أعمال العباد وموضع الفضل وبظلها تستظل صور الأعمال وغشاها الله من الأنوار ما غشى ألا إن تلك الأنوار أنوار الأعمال فلا يستطيع أحد أن ينعتها وتلك الأنوار كما قلنا أنوار الأعمال تنبعث من صورها فتغشاها فلا يستطيع أحد أن ينعتها فإن النعت للأشياء تقييد وتمييز والأعمال تختلف ولها مراتب وأنوارها على قدر مراتبها فعال وأعلى ومضي‏ء وأضوأ ونعت العالي يناقض الأعلى ونعت المضي‏ء يقابل الأضوأ من حيث ما هو أضوأ فلا يتقيد بنعت لأنك إن قيدتها بنعت أبطله لك نقيضه فما وفيتها حقها في النعتية إذ لم تكن أنوار الأعمال على درجة واحدة وقد غشيتها هذه الأنوار وغطتها فلا يقدر أحد يصل إلى نعتها فهم وإن استظلوا بها فقد كسوها من ملابس الأنوار ما فضلت به جميع الأشجار وهي طعام وغاسول ونبقها كالقلال منه ترزق أرواح الشهداء\n\n\n### [اختيار البيت المعمور]\n\n\nوأما اختياره البيت المعمور فلأنه مخصوص بعمارة ملائكة يخلقون كل يوم من قطرات ماء نهر الحياة الواقعة من انتفاض الروح الأمين فإنه ينغمس في نهر الحياة كل يوم غمسة لأجل خلق هؤلاء الملائكة عمرة البيت المعمور وهم سبعون ألف ملك إذا خرجوا منه لا يعودون إليه أبدا وبقي السر في المكان الذي يعمرونه هؤلاء الملائكة وما ثم خلاء والعالم كله قد ملأ الخلأ فابحث عليه فإنه علم جليل يوقفك على علم استحالات الأعيان في الأعيان وتقلب الخلق في الأطوار فتعلم أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ لا على ما ليس بشي‏ء فإن لا شي‏ء لا يقبل الشيئية إذ لو قبلها ما كانت حقيقته لا شي‏ء ولا يخرج معلوم عن حقيقته فلا شي‏ء محكوم عليه بأنه لا شي‏ء أبدا وما هو شي‏ء فمحكوم عليه بأنه شي‏ء أبدا\n\n\n### [اختيار الحجر الأسود]\n\n\nوأما اختياره الحجر الأسود فلأنه أنزله ليقيمه مقام يمينه في البيعة الإلهية إذ لم يكن في المعارف والعبادات أعظم ملازمة لما عرف ولما تعبد به من العبادات فإنها فطرت على المعرفة والعبادة المحضة التي عجزت عنها حقيقة النبات والحيوان ولهذا ليس شي‏ء منه في الإنسان جملة واحدة فإن جميع ما في الإنسان يقبل النمو وهو للنبات كما إن الحيوان له التصرف في الجهات فكلما فارق موجود المعدن التبس بصورة الدعوى بحقيقته فهي منازعة خفية لا يشعر بها كل عالم وقد نبه على بعض ذلك سهل وما وفي الأمر فيها ما هو عليه فلا أدري هل علم واكتفى بما ذكر أو ما أطلعه الله في ذلك الوقت على أكثر مما ذكر والله أعلم فاختاره الله يمينا\n\n\n### [اختيار القلب من الإنسان‏]\n\n\nوأما اختياره من الإنسان القلب وهو الذي وسعه لأنه كل يوم في شأن واليوم قدر نفس المتنفس في الزمان الفرد وبه سمي قلبا لتقلبه أ لا تراه بين أصبعي الرحمن فما يقلبه إلا الرحمن ليس لغيره من الأسماء معه فيه دخول ولا يعطي الاسم الرحمن إلا ما في حقيقته فرحمته وَسِعَتْ كُلَّ شَيْ‏ءٍ فما من أمر تراه في تقلبه مما يؤدي إلى عناء وعذاب وشقاء إلا وفيه رحمة خفية لأنه بأصابع الرحمن يقلب فإن شاء أقامه وإن شاء أزاغه عن تلك الإقامة فهو ميل إضافي فمال القلب إلى الرحمة بحكم سلطان هذا الاسم الذي قلبه في الزيغ كما قلبه في الإقامة فهي بشرى من الله إلى عباده ف يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ وما ذكر سرفا من سرف فعم جميع حالات المسرفين في السرف لا تَقْنَطُوا من رَحْمَةِ الله فإن الذي أزاغكم أصبع الرحمن إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً وهو خبر لا يدخله النسخ فيجمع بين قوله هذا وبين قوله إِنَّ الله لا يَغْفِرُ أَنْ يُشْرَكَ به فيؤاخذ على الشرك ما شاء الله ثم يحكم عليه أصبع الرحمن فيئول إلى الرحمن وأمور أخر من الزيغ مما دون الشرك يغفر منها ما يغفر بعد العقوبة وهم أهل الكبائر الذين يخرجون من النار بالشفاعة بعد ما رجعوا حمما مع كونهم ليسوا بمشركين والايمان بذلك واجب ومنها ما يغفر ابتداء من غير عقوبة فلا بد من المال إلى الرحمة\n\n\n### [اختيار الاجتماع من الأكوان‏]\n\n\nوأما اختياره من الأكوان الاجتماع فإنه يعطي الافتراق بالتمييز في عين الجمع فلا بد من رب ومربوب ومن قادر ومقدور فالجمع مختار لا بد منه لما تعطيه حقائق الأسماء الإلهية من التعلق‏\n\n\n### [اختيار الأبيض من الألوان‏]\n\n\nوأما اختياره من الألوان البياض فلأن الملونات كلها تستحيل إليه ولا يستحيل إليها بل بياضيته كامنة فيه مستورة لحجاب اللون الذي يظهر في العين‏\nمن سواد وحمرة وصفرة وغير ذلك فمنه ما يكون لونا قائما بالمحل ومنه ما يكون لونا في ناظر العين وليس كذلك في نفس المتلون كسواد الجبال البيض على البعد فإذا جئتها رأيتها بيضا وقد كنت تحكم عليها بالسواد وأنت غالط في ذلك الحكم وصحيح في ظهور السواد به مصيب والكيفية في ذلك مجهولة وبهذه المثابة زرقة السماء إنما هي لنظر العين وإن كانت في نفسها على لون يخالف الزرقة\n\n\n### [اختيار الروح من الملائكة]\n\n\nوأما اختياره من الملائكة الروح لأنه المنفوخ فيه في كل صورة ملكية وفلكية وعنصرية ومادية وطبيعية وبها حياة الأشياء وهو الروح المضاف إليه وهو نفس الرحمن الذي يكون عنه الحياة والحياة نعيم والنعيم ملتذ به والالتذاذ بحسب المزاج كما قلنا في مزاج المقرور يتنعم بما به يتعذب المحرور فافهم ويكفيك تنبيه الشارع لو كنت تفهم بأن للنار أهلا هم أهلها وللجنة أهلا هم أهلها وذكر في أهل النار أنهم لا يموتون فيها ولا يحيون فهم يطلبون النعيم بالنار لوجود البرد وهذا من حكم المزاج‏\n\n\n### [اختيار البراق من المراكب‏]\n\n\nوأما اختياره البراق من المراكب لكونه مركب المعارج فجمع بين ذوات الأربع وذوات الجناح فهو علوي سفلي كبعض الحيوانات بري بحري‏\n\n\n### [اختيار دعاء يوم عرفة]\n\n\nوأما اختياره دعاء يوم عرفة فإنه دعاء في حال تجريد وذلة وخضوع في موطن معرفة ليوم زماني لما فيه من الجمع بين الليل والنهار\n\n\n### [اختيار قل هو الله أحد]\n\n\nوأما اختياره قُلْ هُوَ الله أَحَدٌ فلأنها مخصوصة به ليس فيها ذكر كون من الأكوان إلا أحدية كل أحد إنها لا تشبه أحديته تعالى خاصة وفي إتيانها في هذه السورة علم غريب لمن فتح الله به عليه فإنه افتتح السورة بأحديته وختمها بأحدية المخلوقين فاعلم أن الكائنات مرتبطة به ارتباط الآخر بالأول لا ارتباط الأول بالآخر فإن الآخر يطلب الأول والأول لا يطلب الآخر فهو الغني عن العالمين من ذاته ويطلب الآخر من مسمى الله المنعوت بالأحدية فهذا قد نبهتك على مأخذ هذا العلم الذي تحويه هذه السورة بالأحدية المتأخرة التي هي مع ارتباطها بالأول لا تماثلها لكونها تطلبه ولا يطلبها أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ\n\n\n### [اختيار آية الكرسي‏]\n\n\nوأما اختياره من الآي آية الكرسي الآيات العلامات ولا شي‏ء أدل على الشي‏ء من نفسه وهذه آية الكرسي كلها أسماؤه أو صفته لا يوجد ذلك في غيرها من الآيات فدل على نفسه بنفسه الله لا إِلهَ إِلَّا هُوَ فنفى وأثبت بضمير غائب على اسم حاضر له مسمى غيب الْحَيُّ صفة شرطية في وجود ما له من الأسماء الْقَيُّومُ على كل ما سواه بما كسب فإنه أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ لا تَأْخُذُهُ سِنَةٌ ولا نَوْمٌ صفة تنزيه عما يناقض حفظ العالم الذي لو لا قيوميته ما بقي لحظة واحدة الله الضمير يعود عليه وهو ضمير غيب ما في السَّماواتِ وما في الْأَرْضِ ملكا له وعبدا معين الحفظ لبقاء الحكم بالألوهة من ذَا الَّذِي يَشْفَعُ شفعية الوتر بالحكم عِنْدَهُ ضمير غيب إِلَّا بِإِذْنِهِ عدم الاستقلال بالحكم دونه فلا بد من إذنه إذ كان ثم شفيع أو شفعاء يَعْلَمُ ما في السَّماواتِ وما في الْأَرْضِ من الشفعاء والمشفوع فيهم يَعْلَمُ ما بَيْنَ أَيْدِيهِمْ وهو ما هم فيه وما خَلْفَهُمْ وهو ما يؤولون إليه ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ بالأشياء إِلَّا بِما شاءَ منها لا بكلها وَسِعَ كُرْسِيُّهُ علمه السَّماواتِ والْأَرْضَ العلو والسفل ولا يَؤُدُهُ يثقله حِفْظُهُما لأنه حفظ ذاتي معنوي وإمداد غيبي وخلق دائم في سفل وعلو وهُوَ ضمير غيب الْعَلِيُّ بغناه عن خلقه من ذاته الْعَظِيمُ في قلوب العارفين بجلاله فله الهيبة فيها فهي آية ذكر الله فيها ما بين اسم ظاهر ومضمر في ستة عشر موضعا من هذه الآية لا تجد ذلك في غيرها من الآيات منها خمسة أسماء ظاهرة الله الحي القيوم العلي العظيم ومنها تسعة ضميرها ظاهر فهي مضمرة في الظاهر ومنها اثنان مضمران في الباطن لا عين لها في الظاهر وهما ضمير العلم والمشيئة وكذلك علمه ومشيئته لا يعلمها إلا هو فلا يعلم أحد ما في علمه ولا ما في مشيئته إلا بعد ظهور المعلوم بوقوع المراد لا غير فلذلك لم يظهر الضمير فيها\n\n\n### [اختيار يس من القرآن‏]\n\n\nوأما اختياره يس من القرآن فلأنها قلب القرآن ومن قرأها كان كمن قرأ القرآن عشر مرات والقلب أشرف ما في الصورة الصادية كذلك السورة السينية وهي المنزلة ولها من الأبراج بيت شرف الشمس وهو برج الأولية زمان الربيع إقبال النش‏ء وظهور البدء وابتداء زينة عالم الطبيعة وتلطيف بخارات الأنفاس التي كثفها زمان الشتاء لبرودة الجو كان يعطي الجمد في البخارات الخارجة من المتنفسين عند ما تخرج يكثفها ثم يردها ما وهو ما تجد في يديك إذا تنفست فيه في زمان الشتاء من النداوة وله الشئون الإلهية التي لا يزال في كل نفس فيها جل جلاله‏\n\n\n### [اختيار القرآن من الكلام الإلهي‏]\n\n\nوأما اختياره من الكلام القرآن وهو الذي له صفة الجمع وفي الجمع عين الفرقان إذ الجمع دليل الكثرة\nوالكثرة آحاد فهي عين الافتراق في عين الجمع فهو الفرقان القرآن‏\n\n\n### [اختيار لا إله إلا الله من بين الأذكار]\n\n\nوأما اختياره لا إله إلا الله فإنه ذكر عم النفي والإثبات وليس ذلك لغيره من الأذكار\n\n\n### [اختيار الرضا من بين الأحوال‏]\n\n\nوأما اختياره الرضي من الأحوال فإنه آخر ما يكون من الحق لأهل السعادة من البشرى فلا بشرى بعدها فإنها بشرى تصحب الأبد كما ورد في الخبر وهي بشرى بعد رجوع الناس من الرؤية لا بل هي من الله لهم في الكثيب عند الرؤية في الزور الأعظم‏\n\n\n### [اختيار الجنة]\n\n\nوأما اختياره الجنة فإنها دار بقاء السعادة والنظر الساترة لأهلها عن كل مكروه يكون في الدار التي تقابلها وما يعطيه سلطان أسماء الانتقام‏\n\n\n### [اختيار الرؤية]\n\n\nوأما اختياره الرؤية فإنها غاية البصر فاللذة البصرية لا تشبهها لذة فإنها عين اليقين في المعبود\n\n\n### [اختيار العدد التسعة والتسعين من بين الأعداد]\n\n\nوأما اختياره من الأعداد التسعة والتسعين فلأنها وتر الأسماء الجامع بين الآحاد والعقد إن لله تسعة وتسعين اسما مائة إلا واحدا من أحصاها دخل الجنة بمجرد الإحصاء حفظا ولفظا وإحاطة فإن الله وتر يحب الوتر\n\n\n### [اختيار الفرائض‏]\n\n\nوأما اختياره الفرائض فلأن نتيجتها أن يكون العبد نعت الحق سمعه وبصره فإن حب النوافل يعطى أن يكون الحق سمع العبد وبصره والنفل لا يكون إلا في الدرجة النازلة عن الفرض فالفرض له الأولية ولا ينزل الحق إلى أن يكون سمعا للعبد كما قال بما يقتضيه من الجلال فلا بد أن ينزل الله بصفته وهو كون العبد صفة الحق للصورة التي خلق عليها فهي مقتطعة من الصورة الإلهية كما هي الرحم شجنة من الرحمن والفرض القطع فإذا أداه ظهر له في ذلك أنه صفة للحق فإذا تنفل كان صفة الحق له فتميز الفرض من النفل وكانت الدرجة العليا للفرض ولو لا ما أعطى الفرض ذلك‏\n\n\nما ثبت أن يقول جعت فلم تطعمني‏\n\n\nوأنا أشد شوقا إلى لقاء عبدي يريد إياي‏\n\n\nفإنه أقرب إلينا من حَبْلِ الْوَرِيدِ وما ترددت في شي‏ء أنا فاعله‏\n\n\nوأمثال هذا من الإخبارات الإلهية\n\n\n### [اختيار ليلة القدر من سائر الليالي‏]\n\n\nوأما اختياره ليلة القدر فإن الأمور لا تتميز إلا بأقدارها عند الحق والحق غيب فاختص القدر بالليلة لأن الليل ستر كما يستر الغيب‏\n\n\n### [اختيار يوم الجمعة من بين الأيام‏]\n\n\nوأما اختياره من الأيام يوم الجمعة لأن فيه ظهرت الصورتان وجعل الله ذلك اليوم للصور وهو الشهر الخامس لمسقط النطفة وهو يوم مؤنث له الزينة وتمام الخلق واختار الله فيه ساعة من ساعاته هي كالنكتة في المرآة وهو موضع صورة المتجلي من مرآة اليوم فيرى فيها نفسه وعلى الصورة الظاهرة بين المرآة والناظر فيها يقع الخطاب والتكليف وبها تحدث أسماء الإشارات من ذا وذان وتا وتان وأولاء وأسماء الضمائر مثل هو وهي وهما وهم وهن وك وك وكما وكم وكن وأنت وأنت وأنتما وأنتم وأنتن وياء ضمير المتكلم المؤثرة في آنيته إن لم تحفظها نون الوقاية ولا بد لها من تأثير إما في الآنية أو في نون الوقاية لا بد لها من ذلك ولهذا نون الوقاية له الفتوة والإيثار من عالم الحروف ولهذا سميت نون الوقاية فلها منزلة لكاف من قوله أعوذ بك ولنا فيها\n\n\n> نون الوقاية نون ليس يشبهها *** من الوجود سوى صوم وخلاق‏\n\n\n> له الفتوة والإيثار نشأته *** فما لنا غيره في اللفظ من واق‏\n\n\n> شطر الوجود له من نعت خالقه *** من المكانة فهو الدائم الباقي‏\n\n\n### [اختيار الثلاثة القرون على الترتيب‏]\n\n\nوأما اختياره الثلاثة القرون على الترتيب فإن الأول من ذلك لظهور كمال محمد صَلَّى اللهُ عَليهِ وسَلَّم غيبا وشهادة فسن الشريعة بنفسه ونسخ ما كان سنة نوابه بوجوده وقرر منه ما قرر وأقر الايمان بجميعه ما نسخ منه وما لم ينسخ وهذا هو القرن الأول ثم اثنان بعده والكل أهل فتح وظهور بمنزلة الثلاث الغرر من كل شهر يقول صَلَّى اللهُ عَليهِ وسَلَّم يغز وفئام من الناس فيقال هل فيكم من رأى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيقولون نعم فيفتح لهم وهذا هو القرن الأول ثم يغز وفئام من الناس فيقال هل فيكم من رأى من رأى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيقولون نعم فيفتح لهم وهذا هو القرن الثاني ثم يغز وفئام من الناس فيقال هل فيكم من رأى من رأى من رأى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيقولون نعم فيفتح لهم وهذا هو القرن الثالث وما زاد صَلَّى اللهُ عَليهِ وسَلَّم على هذا وذلك أنه ما ثم سوى الحضرة الإلهية وهي عبارة عن الذات والصفات والأفعال فهذا معنى خير القرون فبعناية القرن الأول فتح للجميع وهي ذات رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فأعطت قوة نوره وسلطان ظهوره الفتح الإلهي لمن رآه أو رأى من رآه أو رأى من رأى من رآه فهوقوله خير القرون قرني ثم الذين يلونهم ثم الذين يلونهم‏\n\n\nوإنما شبهناهم بالثلاث الغرر من الشهر وجعلنا زمان دعوته مشبهة بالشهر لأنهم اختلفوا في القرن ما قدره من الزمان فمن جملة أقوالهم أن القرن‏\nثلاثون سنة فلهذا أنزلنا الثلاثة القرون من زمان دعوته إلى يوم القيامة منزلة شهر وجعلنا الثلاثة القرون كالثلاث الغرر منه‏\n\n\n### [اختيار الصوم من بين العبادات‏]\n\n\nوأما اختياره الصوم‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم قال لشخص سأله عليك بالصوم فإنه لا مثل له‏\n\n\nفنفى المثلية عن الصوم فأشبه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وقال الصوم لي‏\n\n\nوجعل جميع العبادات كلها للإنسان إذ كان الصوم صفة تنزيه ولا ينبغي التنزيه إلا له تعالى‏\n\n\n### [اختيار رمضان من بين الشهور]\n\n\nوأما اختياره من الشهور شهر رمضان فلمشاركته في الاسم فإن رمضان من الأسماء الإلهية فتعينت له حرمة ما هي لسائر شهور السنة وجعله من الشهور القمرية حتى تعم بركته جميع شهور السنة فيظهر في كل شهر من شهور السنة فيحصل لكل يوم من أيام السنة حظ منه فإن أفضل الشهور عندنا شهر رمضان ثم شهر ربيع الأول ثم شهر رجب ثم شعبان ثم ذو الحجة ثم شوال ثم ذو القعدة ثم المحرم وإلى هنا انتهى علمي في فضيلة الشهور القمرية وأبهم على ترتيب الفضل فيما بقي من شهور السنة القمرية وذلك شهر صفر وربيع الآخر وجمادى الأولى وجمادى الآخرة ما عندي علم بترتيب الفضلية في هؤلاء أو هي متساوية في الفضل وهو الغالب على ظني فإنه أظهر ذلك وما تحققته فلم يتمكن لي أن أقول ما ليس لي به علم‏\n\n\n### [اختيار الماء من بين الأركان‏]\n\n\nوأما اختياره من الأركان ركن الماء لأنه من الماء جعل كل شي‏ء حي حتى العرش لما خلقه ما كان الأعلى الماء فسرت الحياة فيه منه فهو الركن الأعظم كما قال الحج عرفة وإن كان سبب الحياة أشياء معه ولكنه الركن الأعظم من تلك الأشياء\n\n\n### [اختيار العرش من بين الأفلاك‏]\n\n\nوأما اختياره من الأفلاك العرش لأن له الإحاطة بجميع الأجسام والله بِكُلِّ شَيْ‏ءٍ مُحِيطٌ وله الأولية في الأفلاك فما تحتها فهو الأول المحيط فاختاره للاستواء لما بين الصفتين فإن كان العرش الملك فأحرى أن يكون هو من غير اختيار لأنه ما ثم إلا الله وملكه وكل شي‏ء ما سواه ملكه وقد ورد تمييزه عن غيره فتعين أن يكون مختارا للأولية والإحاطة لأن السموات والأرض في جوف الكرسي كحلقة في فلاة والكرسي في جوف العرش كحلقة في فلاة\n\n\n### [اختيار الملائكة من العباد]\n\n\nواختار من العباد الملائكة فإنهم مخلوقون من النور فأجسامهم نورية بالأصالة فهم أقرب نسبة من سائر المخلوقات إلى النور الإلهي ولذلك‏\n\n\nكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يدعو أن يجعله الله نورا\n\n\nلما يعرف من ظلمة الطبيعة\n\n\n### [اختيار العماء من بين الأينيات‏]\n\n\nواختار من الأينيات العماء فكان له قبل خلق الخلق ومنه خلق الملائكة المهيمة فهيمها في جلاله ثم خلق الخلق فشغلهم هيمانهم في جلال جماله أن يروا سواه فهم الذين لا يعرفون أن الله خلق أحدا ما أشرفها من حالة فجعل العماء أينية له والعرش مستوي له والسماء الدنيا لنزوله والأرض لمعيته فهو معنا أينما كنا\n\n\n### [اختيار الرسل من بين الناس‏]\n\n\nواختار من الناس الرسل ليبلغوا عن الله ما هو الأمر عليه فإنه ما أخرجهم إلا للعلم به لأنه أحب أن يعرف فتعرف إليهم بالرسل بما بعثهم به من كتب وصحف فعرفوه معرفة ذاتية كما عرفوه بالعقول التي خلق لهم وأعطاها قوة النظر الفكري فعرفوه بالدلائل والبراهين معرفة وجودية سلبية لم يكن في قوة العقل في استقلاله أكثر من هذا ثم بعد ذلك جاءت الرسل من بعده بمعرفة ذاتية فعبد الخلق الإله الذي تعرف إليهم بشرعه إذ العقل لا يعطي عملا من الأعمال ولا قربة من القرب ولا صفة ذاتية ثبوتية للحق وما حظ العقل من الشرع مما يستقل به دليله إلا لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ على زيادة الكاف لا على إثباتها صفة فاختار الرسل لتبليغ ما لا يستقل العقل بإدراكه من العلم بذاته وبما يقرب إليه من الأعمال والتروك والنسب‏\n\n\n### [اختيار الاسم الله من بين الأسماء الحسنى‏]\n\n\nواختار من الأسماء الاسم الله فأقامه في الكلمات مقامه فهو الاسم الذي ينعت ولا ينعت به فجميع الأسماء نعته وهو لا يكون نعتا ولهذا يتكلف فيه الاشتقاق فهو اسم جامد علم موضوع للذات في عالم الكلمات والحروف لم يتسم به غيره جل وعلا فعصمه من الاشتراك كما دل أن لا يكون ثم إله غيره‏\n\n\n### [الاختيارات الإلهية دعوة للعقول إلى الاختيار الذي هو اعتبار واستبصار]\n\n\nفهذا قد ذكرنا من الاختيارات الإلهية ما يخرج مخرج التنبيه للعقول الغافلة عما دعيت إليه من الاعتبار والإستبصار ولم نستوف الأمر حده لأنا ما نعرف بطريق الإحاطة تفصيل ما خلق الله من الموجودات وإن كنا نقدر بما أقدرنا الله على حصر الموجودات فيدخل في ذلك كل شي‏ء ونحن ما تصدينا في هذا إلا لمعرفة آحاد ما اختاره واصطفاه من كل نوع نوع من المخلوقات المحصورة في الوجود القائمة بنفسها والمتحيزة وغير المتحيزة من القائمة بنفسها وغير القائمة بنفسها والنوع الذي لا يقبل التحيز إلا بالتبعية وما تألف من ذلك وما لم يتألف وانحصرت أقسام العالم والموجودات فيما ذكرناه‏\n\n\n### [ما يستقل به العقل في الاختيار وما هو فوق مستواه‏]\n\n\nوثم تفصيل نسبي يمكن أن يستقل به العقل وهي مفاضلة الأشياء بعضها على بعض بتميز مراتبها وانفعال بعضها على بعض وتأثير بعضها في بعض وتوقف بعضها على بعض ولكن مفاضلة القرب الإلهي بطريق العناية بهم لا بما تعطيه حقائقهم لا يكون‏\nذلك إلا بتعريف الله إيانا بما يعطيه في قلوبنا من علوم الإلهام أو بما يبلغنا من ذلك في الكتب المنزلة والإخبارات النبوية وأما طريق آخر غير ذلك فما هو ثم‏\n\n\n### [الدلالات العقلية والتعريفات الشرعية والعبادات الحقيقية]\n\n\nفالسنن الدلالات العقلية لأنها طرق والفرائض هي التعريفات الشرعية بما هو الحق تعالى عليه بالنسبة إليه وبالنسبة إلى خلقه فاعبدوا الله عباد الله على النعت الذي وصف به نفسه في كتابه أو على لسان ألسنة رسله من غير زيادة ولا نقصان ولا تأويل يؤدي إلى تطفيف أو رجحان بل سلم إليه جل جلاله ما وصف به نفسه وإن استحال أو تناقض فذلك لقصورنا وجهلنا بما هو الأمر عليه وقد وفينا ما أعطته القوة العقلية النظرية من العلم في وجوده وبصدق المبلغين عنه تعالى ما أنزله على عبيده قلنا القبول من غير اعتراض ولو تناقض الأمر واستحال فما هو للعقل مجهول بالذات كيف يدخله فيما يرجع إلى ذاته في وجوب أو جواز أو استحالة فلا يتعدى العقل حده ويسلم إليه سبحانه ما أنزله وعرفنا به مما هو عليه فإن الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ فلنا الايمان به وبما جاء من عنده على علمه في ذلك في كتاب وعلى لسان رسول والله يوفقنا للوقوف عند ذلك فإنه لا يهلك على الله إلا هالك انتهى الجزء الخامس والتسعون‏\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "Chapter Ninety: Concerning the Gnosis of the Obligatory Duties and the Supererogatory Acts\n\nIndeed, the obligatory duties (*al-fara'id*) are like riding beasts, and the supererogatory acts (*al-sunan*) / are the path leading them to their ultimate goals.\n\nIf you traverse the path, you become an obligatory duty (*farida*), / and thus you become the Hearing of the Real (*al-Haqq*) in its signs.\n\nThis is the opposite of the supererogatory acts (*al-nawafil*); so reflect upon them and adhere / to the paths of virtues, striving diligently to establish them.\n\n### [The Individual Obligation, the Communal Obligation, the Conditional Obligation]\n\nObligatory Duties (*al-fara'id*) are the acts or abstentions that God Almighty has made incumbent upon His servants, making them definitive, and punishing whoever fails to perform them. They are of two types: the Individual Obligation (*fard 'ayn*), which is not waived from the individual even if others perform it; and the Communal Obligation (*fard kifaya*), which is waived from the individual if others perform it. Before others perform it, it is incumbent upon him and upon those others, such as the funeral prayer, washing the dead, and *Jihad*. There is a third obligation that appears between these two, having a connection to each, yet differing in ruling from the other. An example is the obligatory Hajj if one is unable to perform it. Although one is not addressed by it except with the condition of ability (*istita'a*), it is an obligation dependent upon its condition. If his guardian performs Hajj on his behalf, it is waived from him, and he receives the reward for the performance. This is not the case with the Communal Obligation (*fard kifaya*) because of the existence of the reward [for the performer], nor is it like the obligatory prayer because it is not waived from the one on whose behalf it is prayed. Thus, it resembles neither the obligatory prayer nor the Communal Obligation.\n\n### [The Supererogatory Acts are Two Types: A Sunna Commanded by the Messenger and a Sunna Innovated by a Member of the Community]\n\nAs for the Supererogatory Acts (*al-sunan*), they are everything other than what is definitively incumbent. They are of two types: a *Sunna* commanded or encouraged by the Messenger, or one that he performed himself, giving his community the choice to perform it; and a *Sunna* innovated by one member of the Community (*Umma*) and subsequently followed. The innovator receives the reward for it and the reward of all who act upon it.\n\n### [The Fruit of Performing the Obligatory Duty in the Life of the Accountable Person]\n\nWhen the servant performs the Obligatory Duty (*al-fard*) completely, he has fulfilled what Lordship (*al-Rububiyya*) demands of him in terms of Servitude (*al-'Ubuda*). The performance of the Obligatory Duty then yields for him a matter higher than the Real being his hearing. For the Real being the servant's hearing is a spiritual state (*hal*) belonging to the servant, and the ruling of the Obligatory Duty prevents him from attaining this state. [The higher matter] is that he becomes the hearing of the Real, so the Real hears through the servant. This is exemplified by His saying: \"I was hungry, and you did not feed Me.\" As for this prevention (*haylula*) granted by the Obligatory Duty—preventing the Real from being his hearing—it is a verified and established station (*maqam*) as it is in reality. At that point, the servant knows that the Real is He, not himself. Whereas the possessor of the spiritual state (*sahib al-hal*) says, \"I am [He].\"\n\n### [The Prophetic Sunna and the Sunan that are Approved Legislations after the Messenger of God]\n\nThe Supererogatory Acts (*al-sunan*) are paths of emulation (*iqtida'*). The highest of these is the emulation of the Real (*al-Haqq*) Himself, such that in the application of His Names to me, I am close to the Realization (*tahaqquq*) of them, not merely the adoption of their character (*takhalluq*). The lowest level, for the saint (*wali*), is the emulation of those concerning whom God said: <<أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided, so follow their guidance). The scholars are the inheritors of the Prophets, and they inherited nothing but Knowledge (*al-'ilm*).\n\nThe Prophetic *Sunna* is of high station; it is the comprehensive adherence to the religion and its establishment, and the avoidance of division within it. It elevates the one who performs it and follows its path into the Muhammadan Presences (*al-Hadarat al-Muhammadiyya*) toward its goals in Gnosis (*al-ma'arif*), spiritual states (*al-ahwal*), and Theophany (*al-tajalli*). As for the *Sunan* which are approved legislations (*shara'i' mustahsana*) after the Messenger of God (peace and blessings be upon him)—this is the approval (*istihsan*) recognized by the jurists, concerning which al-Shafi'i (may God have mercy on him) said: \"Whoever approves [something] has legislated.\" The jurists took this statement from him as a form of censure. Yet, he (may God be pleased with him) spoke a reality that was legislated for him but was not understood by his contemporaries or those who came after him. He was one of the Four Pillars (*al-Awtad*), and his standing in the science of the Law (*'ilm al-Shar'*) veiled him from the people of his time and those who followed. We have narrated from some righteous people that one of them met al-Khidr and asked him, \"What do you say about al-Shafi'i?\" He replied, \"He is one of the Pillars (*al-Awtad*).\" He asked, \"What do you say about Ahmad ibn Hanbal?\" He replied, \"A truthful man (*siddiq*).\" He asked, \"What do you say about Bishr al-Hafi?\" He replied, \"None like him was left after him.\" This is the testimony of al-Khidr concerning al-Shafi'i (may God have mercy on him).\n\n### [The Law Permitted Good Innovation]\n\nSince it was established for al-Shafi'i that the Prophet (peace and blessings be upon him) said: \"Whoever institutes a good *Sunna* (*sanna sunnatan hasana*), he shall have its reward and the reward of whoever acts upon it, and whoever institutes a bad *Sunna*...\" (the rest of the Hadith), there is no doubt that the Law (*al-Shar'*) permitted him to institute a good *Sunna*. This is part of what he inherited from the Prophets, and it is \"good,\" meaning the Real approves of it from him, and he instituted it. Thus, \"Whoever approves [something]\"—that is, whoever institutes a good *Sunna*—\"has legislated.\" How astonishing is the lack of understanding among people regarding al-Shafi'i's statement on this matter, even though they affirm the ruling of the *mujtahid* (independent jurist) even if he errs in reality. The Lawgiver (*al-Shari'*) has confirmed it, and it is an acceptable legal ruling that no judge is permitted to reject. The principles and foundations of the Law uphold it, just like the Public Interests (*al-Masalih al-Mursala*) in the Maliki school.\n\n### [Divine Choices in Existing Things and the Choices of the Prudent in Prescribed Matters]\n\nSince the Lawgiver established its ruling generally and made clear that its institutor and those who follow him are rewarded, and that the ultimate destination of the followers is the institutor, according to his rank and the nature of what he instituted, I alert you by this to ensure that your times are filled with the Prophetic Laws (*al-shara'i' al-nabawiyya*) and the Original Supererogatory Acts (*al-sunan al-asliyya*). For the prudent person (*al-kayyis*) should not make the goal of his action anything but an Original Prophethood (*nubuwwa asliyya*), not a subsidiary one (*far'iyya*), since he has the choice in choosing, given that matters inherently accept choice, just as He (Exalted is He) did in all existing things (*al-mawjudat*). He chose a specific matter from every genus of things: He chose the word 'Allah' from the Beautiful Names (*al-Asma' al-Husna*). He chose the Messengers from mankind. He chose the Angels from the servants. He chose the Throne (*al-'Arsh*) from the celestial spheres (*al-aflak*). He chose Water from the elements (*al-arkan*). He chose Ramadan from the months. He chose Fasting from the acts of worship (*al-'ibadat*). He chose the Prophet's generation from the generations. He chose Friday from the days of the week. He chose the Night of Power (*Laylat al-Qadr*) from the nights. He chose the Obligatory Duties (*al-fara'id*) from the acts. He chose the number ninety-nine from the numbers. He chose Paradise (*al-Janna*) from the abodes. He chose the Vision (*al-Ru'ya*) from the states of bliss in Paradise. He chose Contentment (*al-Rida*) from the spiritual states (*al-ahwal*). He chose *La ilaha illa Allah* (There is no god but Allah) from the forms of remembrance (*al-adhkar*). He chose the Quran from speech. He chose Surah Ya Sin from the chapters of the Quran. He chose the Verse of the Throne (*Ayat al-Kursi*) from the verses of the Quran. He chose <<قُلْ هُوَ اللهُ أَحَدٌ>> (Say: He is Allah, the One) from the short chapters of the *Mufassal*. He chose the supplication of the Day of Arafah from the supplications of the seasons. He chose the Buraq from the mounts. He chose the Spirit (*al-Ruh*) from the Angels. He chose Whiteness (*al-Bayad*) from the colors. He chose Gathering (*al-Ijtima'*) from the existents (*al-akwan*). He chose the Heart (*al-Qalb*) from the human being. He chose the Black Stone (*al-Hajar al-Aswad*) from the stones. He chose the Frequented House (*al-Bayt al-Ma'mur*) from the houses. He chose the Lote Tree (*al-Sidra*) from the trees. He chose Mary and Asiya from women. He chose Muhammad (peace and blessings be upon him) from men. He chose the Sun from the planets. He chose the Straight Motion (*al-haraka al-mustaqima*) from the motions. He chose the Revealed Law (*al-Shari'a al-munazzala*) from the established norms (*al-nawamis*). He chose the Existential Proofs (*al-barahin al-wujudiyya*) from the proofs. He chose the Human Form (*al-suwar al-adamiyya*) from the forms, which is why He manifested it upon the Divine Form. He chose the Light (*al-anwar*) that accompanies vision (*al-nazar*). He chose Affirmation (*al-ithbat*) from the two opposites (*al-naqidhayn*). He chose Existence (*al-wujud*) from the two contraries (*al-diddain*). He chose Mercy (*al-Rahma*) over Wrath (*al-Ghadab*). He chose Prostration (*al-Sujud*) from the states of the acts of prayer. He chose the Remembrance of God (*dhikr Allah*) from the sayings of prayer. He chose Intention (*al-Niyya*) from the types of volitions, for it holds the ruling regarding the acceptance or rejection of the deed, for:\n\n\"Every person shall have what he intended.\"\n\nAnd the non-doer is joined with the doer in reward and increase.\n\n### [Choice of the Remembrance of God from the Sayings of Prayer]\n\nAs for the Remembrance of God (*dhikr Allah*) among the sayings of the prayer, the remembrance of God within it is the greatest thing in it, as He (Mighty and Majestic) said: <<إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ ولَذِكْرُ الله أَكْبَرُ>> (Indeed, the prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater). For the prayer is an intimate conversation (*munajat*), and the one who remembers God has the Real as his companion. If he remembers Him through Him, then He (Exalted is He) is his tongue.\n\n### [Choice of Prostration from the Acts of Prayer]\n\nAs for His choice of Prostration (*al-Sujud*) among the acts of prayer, it is due to the protection it offers from Satan, for Satan does not leave the worshipper in any of the acts of prayer except specifically in the Prostration, because Prostration was his error. During Prostration, he weeps, regrets, and repents, and regret is repentance. That measure [of repentance] must be accepted. Thus, he repents at every prostration, and God loves every afflicted penitent.\n\nThen he returns to temptation upon rising from the Prostration, and so on.\n\n### [Choice of Mercy over Wrath]\n\nAs for His choice of Mercy (*al-Rahma*) over Wrath (*al-Ghadab*), it is because Mercy acts by Grace (*minna*) and acts by Necessity (*wujub*), and <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (It encompasses all things). Wrath is among the things that Mercy encompasses. Thus, there is no pure Wrath unmixed with Mercy, while Mercy is not mixed with Wrath. And <<مَن يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوَى>> (Upon whom My Wrath descends, he has fallen). Wrath causes him to fall (*hawa*). When he falls—which is the descent, the ruling of Wrath and nothing else—he falls into Mercy, which encompasses him and receives him. He falls only toward Mercy, and it is by the Mercy contained within the Wrath that he fell. It is Mercy that caused the Wrath to cast him down so that pure Mercy might receive him, like the mercy found in a bitter medicine, which the sick person drinks with aversion. There is a hidden mercy in it, due to which the bitter medicine is used at the time, leading him to recovery, which is pure Mercy. This is why the ultimate outcome is Mercy and its ruling. Even if they do not leave the Fire, they will have bliss within it, and <<وَاللهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (And Allah is over all things competent). Do you not see the benefits and comforts God has placed in the Fire of this world, even if it were only cauterization for certain ailments? It is the most decisive of remedies, and due to the strength of its effect, it casts doubt upon reliance on God (*tawakkul*) because it takes the place of the Healer and the Restorer of Health. Thus, Divine Jealousy (*ghayra*) ruled that the one who seeks cauterization is not fully reliant [on God].\n\n### [Choice of Existence from the Two Contraries]\n\nAs for His choice of Existence (*al-wujud*) from the two contraries (*al-diddain*), it is because Existence is His Attribute (*sifa*). Thus, He chose His Attribute for the possibilities (*al-mumkinat*), and only this is correct. For He possesses Power (*al-Iqtidar*), and Power can only result in Existence. Do you not see that when He said: <<إِنْ يَشَأْ يُذْهِبْكُمْ>> (If He wills, He can do away with you), He then said: <<وَيَأْتِ بِآخَرِينَ>> (And bring others)? Power refused anything but Existence. He linked the Will (*al-Irada*) to non-existence (*al-i'dam*). He possesses the Name *al-Mani'* (The Preventer), and prevention is non-existence.\n\n### [Choice of Affirmation over Negation]\n\nAs for His choice of Affirmation (*al-Ithbat*), it is the very essence of the thing to which He says \"Be!\" (*kun*). For, in its state of non-existence (*'adam*), He preferred Affirmation over Negation for it, so that it remains a possibility (*mumkin*) even in its state of non-existence. This is a subtle issue concerning preference in the state of non-existence, and it is due to the Essential Need (*al-iftiqar al-dhati*) inherent in the possible thing before Existence, when the Real wills it and hastens to it with the ruling of Affirmation that is incumbent upon it.\n\n### [The Chosen Light from among the Lights]\n\nAs for the Chosen Light (*al-Nur*) from among the Lights, the Lights are veils (*hujub*). That is why He said concerning the Veiling Lights (*al-anwar al-hijabiyya*): \"Light, I see it.\"\n\nThen He promised the Vision (*al-Ru'ya*), and Vision is Light. Therefore, the Light in which He manifests to His servants must be chosen from those Veiling Lights, such as the Light of Oneness (*Nur al-Ahadiyya*), Glory (*al-'Izza*), Grandeur (*al-Kibriya'*), and Magnificence (*al-'Azama*). All of these are lifted from the sight, but their ruling remains in the heart. By their lifting, the Vision of the Real (Exalted is He) occurs, while their ruling remains in the heart, and the servants are annihilated (*fana*) from the Vision. Were it not so, they would witness their own selves when witnessing Him.\n\n### [Choice of the Human Form]\n\nAs for His choice of the Human Form (*al-Sura al-Adamiyya*), it is because He created Adam upon His Form (*sura*). Thus, He applied all His Beautiful Names to him, and by the power of these Names, he bore the Trust (*al-Amana*) that was offered. This Reality granted him the ability to bear it, unlike the heavens, the earth, and the mountains, which refused to bear it. <<وَحَمَلَهَا الْإِنْسَانُ إِنَّهُ كَانَ ظَلُومًا>> (And man carried it. Indeed, he was wrongdoing) had he not carried it, <<جَهُولًا>> (ignorant) because the Gnosis of God (*al-'ilm bi-Allah*) is the very essence of ignorance concerning Him. The realization that one is incapable of grasping the comprehension is itself comprehension. For if he knows that there is something he does not know, then he has not known it. This is the knowledge that there is something unknowable, and his knowledge has no object except ignorance concerning it.\n\n### [Choice of the Existential Proofs from the Dialectical and Other Proofs]\n\nAs for His choice of the Existential Proofs (*al-Barahin al-Wujudiyya*) over the Dialectical Proofs (*al-Barahin al-Jadaliyya*) and others, it is due to the complete knowledge they provide regarding the establishment of the Real (*thubut al-Haqq*) and the refutation of the opponent's argument. The Dialectical Proofs do not possess this strength; they refute the opponent's argument but may not establish a truth. The Sophistical Proofs (*al-Barahin al-Sufusta'iyya*) result in confusion, and in Divine Knowledge, they are closer to the Existential Proofs in one respect than the Dialectical Proofs.\n\n### [Choice of the Revealed Law over the Philosophical Norms]\n\nAs for His choice of the Revealed Law (*al-Shari'a al-Munazzala*), it is due to its comprehensive connection to the Hereafter and the interests of this world. The Philosophical Norms (*al-Nawamis al-Hikmiyya*) established for the interests of this world and the continuation of good in the mundane realm do not possess the authority to rule upon God regarding Divine Proximity, the acceptance of deeds, the elevation of ranks, the establishment of Gardens, or the abode of misery. Only the Law revealed from God is sufficient for all of this. As for those who innovated acts of worship and observed them properly, seeking God's pleasure, which God had not prescribed for them—they are the people of a Law revealed from God, and they instituted good *Sunan* within it, appropriate to what the Lawgiver instituted through the Revealed Law concerning them, and He permitted them to institute [such acts]. As for the Philosophical Norms, they are not what these people instituted. This is why they are granted the reward.\n\n### [Choice of the Straight Motion]\n\nAs for His choice of the Straight Motion (*al-Haraka al-Mustaqima*), it is because He is <<عَلَى صِرَاطٍ مُسْتَقِيمٍ>> (upon a Straight Path), as He said about Himself. He singled out the human being, whom He created upon the Form of the Real, with this motion. The blessed person will be resurrected in this motion on the Day of Resurrection; it is for him in this world and the next. For the criminals will be resurrected inverted, which is the Inverted Motion (*al-Haraka al-Mankusa*), as He (Exalted is He) said concerning the criminals: <<وَلَوْ تَرَى إِذِ الْمُجْرِمُونَ نَاكِسُوا رُؤُوسِهِمْ عِنْدَ رَبِّهِمْ>> (And if you could but see when the criminals are hanging their heads before their Lord). The crooked, horizontal motion belongs to the beasts. Thus, the Straight Motion is only proper for the one whom God created upon the Form—that is, the Perfect Human (*al-Insan al-Kamil*)—who possesses this attribute in this world and the Hereafter. This is why Adam was specifically mentioned, as he is among the people of bliss for whom this Straight Motion remains, and for this reason, he was described as the Caliph (*Khalifa*).\n\n### [Choice of the Sun]\n\nAs for His choice of the Sun, it is due to its provision of sustenance (*imdad*) to all the luminous planets, both high and low. This is why Abraham (peace be upon him) said: <<هَذَا أَكْبَرُ>> (This is greater). It is specifically located, according to both schools [of thought], in the heart of the sphere, which is the Fourth Heaven, where Idris (peace be upon him) resides. God mentioned that He raised him <<مَكَانًا عَلِيًّا>> (to a high place). The elevation of this place comes from its being the heart of the spheres, making it a high place by virtue of its status. What is above it, even if it is spatially lower [in relation to the sphere], is higher in distance and in relation to our heads. It is the Sun that brings about night and day through its rising and setting, for which God ordained the covering (*al-ghashayan*), which is the intercourse (*al-nikah*) and penetration (*al-ilaj*), leading to the manifestation of the essences of the generated things (*al-muwalladat*), and the creatures God brings forth in the night and day resulting from this penetration and covering. He made each of these two existents, resulting from the solar motion, pursue the other relentlessly, thereby manifesting the essences of contingent events (*al-hawadith*) through this pursuit.\n\n### [His Choice of Muhammad]\n\nAs for His choice of Muhammad (peace and blessings be upon him), it is due to the perfection and balance required by his temperament (*mizaj*) above all other human temperaments. Through this, he witnessed his prophethood while Adam was between water and clay. [His temperament] is differentiated in its parts within the elemental generated things (*al-muwalladat al-'unsuriyya*). This is a subtle issue known only to those who understand the extraction of the progeny (*al-dhurriyya*) from Adam's loins when <<أَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قَالُوا بَلَى>> (He made them testify concerning themselves, \"Am I not your Lord?\" They said, \"Yes\"). This is the primordial nature (*al-fitra*) upon which people are born and to which they return. Concerning this gathering, he said:\n\n\"Souls are mobilized armies.\"\n\nWhen He gathered them, He gathered them in the Presence of Representation (*Hadrat al-Tamthil*). Those who faced each other there became acquainted here, and those who turned their backs to each other there became estranged here, and similarly for those who were face-to-side, etc. Concerning this, I say:\n\n> Indeed, hearts are mobilized armies,\n> They appear in the Presence of Gathering, then they depart.\n> Those that recognized each other are harmonious,\n> And those that denied each other are discordant.\n\nEveryone will affirm this testimony in the Hereafter and will not deny it or claim Lordship for himself. He (Exalted is He) says: <<إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا مِنَ الَّذِينَ اتَّبَعُوا>> (When those who were followed disassociate themselves from those who followed).\n\nThus, he (peace and blessings be upon him) was the greatest Divine Manifestation (*majla ilahi*). Through him, the knowledge of the first and the last was known. From the knowledge of the first was Adam's knowledge of the Names. Muhammad (peace and blessings be upon him) was given the comprehensive words (*jawami' al-kalim*), and the Words of God are inexhaustible. He possesses the supremacy (*al-siyada*) that is not far from mankind on the Day of Resurrection, interceding for the intercessors—whether king, messenger, prophet, saint (*wali*), or believer—to intercede. He possesses the Praised Station (*al-Maqam al-Mahmud*) on the Witnessed Day.\n\n### [Choice of Mary and Asiya]\n\nAs for His choice of Mary and Asiya, it is to attach them to the perfection (*al-kamal*) belonging to men, despite the existence of the degree (*daraja*) that men hold above them, for that degree is existential (*wujudiyya*) and does not vanish.\n\n### [Choice of the Lote Tree]\n\nAs for His choice of the Lote Tree (*al-Sidra*), it is the place where the deeds of the servants terminate and the place of Grace (*al-Fadl*). The Forms of Deeds (*suwar al-a'mal*) take shelter in its shade. God covered it with Lights (*anwar*)—those Lights are the Lights of Deeds. No one can describe them. As we said, those Lights are the Lights of Deeds that emanate from their forms and cover the tree. No one can describe them, for description (*na't*) of things is a restriction and a distinction. Deeds differ and have levels (*maratib*), and their Lights are according to their levels: high, higher, luminous, and more luminous. Describing the high contradicts the higher, and describing the luminous opposes the more luminous, in terms of its being more luminous. Thus, it is not restricted by a description, for if you restrict it with one description, its opposite will invalidate it, and you will not have given it its due in description, since the Lights of Deeds are not of a single degree. These Lights have covered and concealed it. No one can reach its description. They, though they take shelter beneath it, have clothed it with garments of Lights, by which it is superior to all other trees. It is food and a washing agent, and its fruit (*nabiq*) is like large jars, from which the souls of the martyrs are provided sustenance.\n\n### [Choice of the Frequented House]\n\nAs for His choice of the Frequented House (*al-Bayt al-Ma'mur*), it is because it is specifically populated by angels who are created every day from the drops of water of the River of Life (*Nahr al-Hayat*) that fall from the shaking of the Trustworthy Spirit (*al-Ruh al-Amin*). He immerses himself in the River of Life once every day for the creation of these angels who populate the Frequented House. They are seventy thousand angels who, once they leave it, never return. The secret remains in the place these angels populate, and there is no void (*khala'*). The entire cosmos (*al-'alam*) has filled the void. Search for this, for it is a magnificent knowledge that will lead you to the knowledge of the Transmutations of Essences (*istihalat al-a'yan*) within Essences and the transformation of Creation (*al-khalq*) through the stages. Then you will know <<أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (That Allah is over all things competent), but not over what is not a thing. For 'no-thing' (*la shay'*) does not accept thing-ness (*shay'iyya*), because if it accepted it, its reality would not be 'no-thing.' A known thing never departs from its reality. Thus, 'no-thing' is ruled as 'no-thing' forever, and what is a thing is ruled as a thing forever.\n\n### [Choice of the Black Stone]\n\nAs for His choice of the Black Stone (*al-Hajar al-Aswad*), it is because He sent it down to establish it in the place of His Right Hand for the Divine Covenant (*al-Bay'a al-Ilahiyya*). For among the gnoses and acts of worship, there is nothing more adherent to what is known and what is worshipped than it. It was created upon pure Gnosis (*ma'rifa*) and pure Worship (*'ibada*), which the reality of plants and animals failed to achieve. This is why no part of it is found wholly in the human being. Everything in the human being accepts growth, which belongs to the plant kingdom, just as the animal possesses movement in directions. Whenever an existent departs from the mineral kingdom, it becomes mixed with the form of the claim to its reality. This is a subtle dispute that not every scholar perceives. Sahl drew attention to some of this, but he did not fulfill the matter as it truly is. I do not know whether he knew and was satisfied with what he mentioned, or whether God did not inform him of more than what he mentioned at that time. God knows best. Thus, God chose it as a Right Hand.\n\n### [Choice of the Heart from the Human Being]\n\nAs for His choice of the Heart (*al-Qalb*) from the human being, it is that which encompasses Him, because it is every day in a [new] affair (*sha'n*). The 'day' is the measure of the breather's breath in singular time (*al-zaman al-fard*). It is called *qalb* (heart) because of its turning over (*taqallub*). Do you not see that it is between the two fingers of the All-Merciful (*al-Rahman*)? Only the All-Merciful turns it over. None of the other Names has any entry with Him concerning it. The Name *al-Rahman* grants only what is in its reality, for His Mercy <<وَسِعَتْ كُلَّ شَيْءٍ>> (encompasses all things). There is no matter you see in its turning over that leads to distress, punishment, or misery, except that there is a hidden mercy within it, because it is turned over by the fingers of the All-Merciful. If He wills, He establishes it, and if He wills, He deviates it from that establishment. This deviation is relative. The heart inclines toward Mercy by the ruling of this Name that turns it over in deviation, just as it turns it over in establishment. This is good news from God to His servants: <<يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ>> (O My servants who have transgressed against themselves). He did not specify any transgression, thus encompassing all states of the transgressors in their transgression: <<لَا تَقْنَطُوا مِنْ رَحْمَةِ اللهِ>> (Do not despair of the Mercy of Allah). For the one who caused you to deviate is the finger of the All-Merciful. <<إِنَّ اللهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا>> (Indeed, Allah forgives all sins). This is a statement that cannot be abrogated. This statement is reconciled with His saying: <<إِنَّ اللهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ>> (Indeed, Allah does not forgive that association be made with Him). He holds accountable for association (*shirk*) as He wills, then the finger of the All-Merciful rules over him, and he returns to the All-Merciful. Other matters of deviation less than association are forgiven—some after punishment, and these are the people of major sins who exit the Fire through intercession after they have turned to charcoal, despite not being polytheists, and belief in this is obligatory. And some are forgiven initially without punishment. Thus, the ultimate outcome must be Mercy.\n\n### [Choice of Gathering from the Existents]\n\nAs for His choice of Gathering (*al-Ijtima'*) from the existents (*al-akwan*), it grants separation (*iftiraq*) through distinction (*tamyiz*) within the very essence of Gathering. There must be a Lord (*Rabb*) and a creature (*marbub*), a Powerful One (*Qadir*) and a determined one (*maqdur*). Thus, Gathering is chosen and necessary due to the connection required by the realities of the Divine Names.\n\n### [Choice of White from the Colors]\n\nAs for His choice of Whiteness (*al-Bayad*) from the colors, it is because all colors transform into it, but it does not transform into them. Rather, its whiteness is latent within it, concealed by the veil of the color that appears to the eye—such as black, red, yellow, and so on. Some of this is a color subsisting in the locus, and some is a color in the eye of the beholder, but not so in the essence of the colored object, such as the blackness of white mountains seen from afar. When you approach them, you see them as white, though you judged them to be black. You were mistaken in that judgment, yet correct in the appearance of blackness to you. The modality of this is unknown. Similarly, the blueness of the sky is only due to the eye's perception, even though its essence is a color different from blue.\n\n### [Choice of the Spirit from the Angels]\n\nAs for His choice of the Spirit (*al-Ruh*) from the Angels, it is because it is the element breathed into every angelic, celestial, elemental, material, and natural form. Through it, things have life. It is the Spirit attributed to Him, and it is the Breath of the All-Merciful (*Nafas al-Rahman*), from which life proceeds. Life is bliss (*na'im*), and bliss is enjoyed. Enjoyment is according to the temperament (*mizaj*), as we said: the person who feels cold finds bliss in what causes the person who feels hot to suffer. Understand this. The Lawgiver's warning should suffice you, if you understand, that the Fire has people who belong to it, and Paradise has people who belong to it. He mentioned concerning the people of the Fire that they neither die therein nor live. They seek bliss through the Fire due to the presence of coldness. This is due to the ruling of temperament.\n\n### [Choice of the Buraq from the Mounts]\n\nAs for His choice of the Buraq from the mounts, it is because it is the mount of the ascensions (*al-ma'arij*). It combines the characteristics of four-legged creatures and winged creatures; thus, it is celestial and terrestrial, like some animals that are both land and sea creatures.\n\n### [Choice of the Supplication of the Day of Arafah]\n\nAs for His choice of the supplication of the Day of Arafah, it is a supplication made in a state of spiritual detachment (*tajrid*), humility, and submission, in a place of gnosis (*ma'rifa*) for a temporal day, due to its combination of night and day.\n\n### [Choice of Qul Huwa Allah Ahad]\n\nAs for His choice of <<قُلْ هُوَ اللهُ أَحَدٌ>> (Say: He is Allah, the One), it is because it is specific to Him. It contains no mention of any existent (*kawn*) except the oneness (*ahadiyya*) of every single one, which does not resemble His Oneness (Exalted is He) specifically. The inclusion of this [created oneness] in this Surah contains a strange knowledge for whomever God opens it up. He began the Surah with His Oneness and concluded it with the oneness of the created beings. Know that the existents (*al-ka'inat*) are linked to Him by the link of the last to the first, not the link of the first to the last. For the last seeks the first, but the first does not seek the last. He is the Self-Sufficient (*al-Ghaniyy*) from the worlds by His Essence (*dhat*), and the last seeks Him through the designation *Allah*, described by Oneness (*al-Ahadiyya*). I have alerted you to the source of this knowledge contained in this Surah through the subsequent Oneness, which, despite its link to the First, does not resemble it, because it seeks Him, and He does not seek it: <<أَنْتُمُ الْفُقَرَاءُ إِلَى اللهِ وَاللهُ هُوَ الْغَنِيُّ الْحَمِيدُ>> (You are the needy toward Allah, while Allah is the Self-Sufficient, the Praiseworthy).\n\n### [Choice of Ayat al-Kursi]\n\nAs for His choice of the Verse of the Throne (*Ayat al-Kursi*) from the verses (*ayat*), the verses are signs (*'alamat*), and nothing indicates a thing better than the thing itself. This Verse of the Throne is entirely His Names or His Attributes. This is not found in any other verse. Thus, He indicated Himself by Himself: <<اللهُ لَا إِلَهَ إِلَّا هُوَ>> (Allah, there is no god but He)—He negated and affirmed using a pronoun of absence referring to a present Name with an absent referent. <<الْحَيُّ>> (The Ever-Living) is a conditional attribute for the existence of what belongs to Him of the Names. <<الْقَيُّومُ>> (The Sustainer) over everything other than Him by what it earns, for He <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (gave everything its creation). <<لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ>> (Neither slumber nor sleep overtakes Him)—an attribute of transcendence (*tanzih*) from what contradicts the preservation of the cosmos, which, were it not for His Sustaining, would not remain for a single moment. The pronoun in <<لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ>> (To Him belongs whatever is in the heavens and whatever is on the earth) refers back to Him, and it is a pronoun of absence, indicating His ownership and the determined preservation of the servant for the continuation of the ruling of Divinity (*al-Uluhiyya*). <<مَنْ ذَا الَّذِي يَشْفَعُ>> (Who is it that can intercede)—the intercession of the singular (*al-witr*) by the ruling <<عِنْدَهُ>> (with Him)—a pronoun of absence—indicating the lack of independence in ruling apart from Him. His permission is necessary, since there is an intercessor or intercessors. <<يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ>> (He knows what is before them)—which is the state they are in—<<وَمَا خَلْفَهُمْ>> (and what is behind them)—which is what they will return to. <<وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ>> (And they encompass not a thing of His knowledge) of things <<إِلَّا بِمَا شَاءَ>> (except for what He wills) of it, not all of it. <<وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ>> (His Kursi encompasses the heavens and the earth)—the high and the low. <<وَلَا يَئُودُهُ>> (And He is not wearied by) <<حِفْظُهُمَا>> (their preservation), because it is an essential, conceptual preservation, a hidden provision (*imdad ghaybi*), and a continuous creation in the low and the high. <<وَهُوَ>> (And He)—a pronoun of absence—<<الْعَلِيُّ>> (The Most High) by His self-sufficiency from His creation by His Essence. <<الْعَظِيمُ>> (The Magnificent) in the hearts of the Gnostics (*al-'arifin*) by His Majesty (*jalal*). Thus, He has awe (*hayba*) within them. It is a verse in which the remembrance of God is mentioned sixteen times, alternating between an explicit Name and a pronoun. You will not find this in any other verse. Five of these are explicit Names: Allah, The Ever-Living, The Sustainer, The Most High, The Magnificent. Nine of them are explicit pronouns, thus implicit in the explicit form. Two of them are implicit in the inner reality, having no explicit form: the pronoun of Knowledge (*al-'ilm*) and the Will (*al-Mashi'a*). Similarly, His Knowledge and His Will are known only to Him. No one knows what is in His Knowledge or what is in His Will except after the manifestation of the known thing through the occurrence of the willed thing, and nothing else. Therefore, the pronoun did not appear in them.\n\n### [Choice of Ya Sin from the Quran]\n\nAs for His choice of Ya Sin from the Quran, it is because it is the heart of the Quran. Whoever recites it is like one who has recited the Quran ten times. The heart is the noblest part of the human form (*al-sura al-sadiyya*). Similarly, the Surah of the Sin (*al-sura al-siniyya*) is the revealed one. It has, among the constellations, the house of the Sun's exaltation, which is the sign of primacy (*al-awwaliyya*), the time of spring, the flourishing of growth, the manifestation of creation's beginning, and the refinement of the vapors of breaths that the time of winter had condensed due to the coldness of the atmosphere. [Winter] used to cause freezing in the vapors exiting the breathers; when they exited, it condensed them, then returned them as water—which is the dampness you find on your hands when you breathe into them in winter. He possesses the Divine Affairs (*al-shu'un al-ilahiyya*) in which He remains in every breath, Glorious is His Majesty.\n\n### [Choice of the Quran from Divine Speech]\n\nAs for His choice of the Quran from Divine Speech (*al-Kalam al-Ilahi*), it is that which possesses the attribute of Gathering (*al-Jam'*). Within Gathering is the very essence of the Criterion (*al-Furqan*), for Gathering is the proof of Multiplicity (*al-Kathra*), and Multiplicity consists of units (*ahad*), which is the very essence of separation (*iftiraq*) within the very essence of Gathering. Thus, it is the Criterion, the Quran.\n\n### [Choice of La ilaha illa Allah from the Forms of Remembrance]\n\nAs for His choice of *La ilaha illa Allah* (There is no god but Allah), it is a remembrance that encompasses Negation (*al-Nafy*) and Affirmation (*al-Ithbat*), which is not the case for any other form of remembrance.\n\n### [Choice of Contentment from the Spiritual States]\n\nAs for His choice of Contentment (*al-Rida*) from the spiritual states (*al-ahwal*), it is the last thing that comes from the Real as good tidings (*bushra*) for the people of bliss. There are no good tidings after it, for it is a good tiding that accompanies eternity, as mentioned in the narration. It is a good tiding given by God to them on the Dune (*al-Kathib*) during the Vision (*al-Ru'ya*) at the Greatest Gathering (*al-Zawr al-A'zam*), not after the people return from the Vision.\n\n### [Choice of Paradise]\n\nAs for His choice of Paradise (*al-Janna*), it is the abode of the permanence of bliss and vision, shielding its inhabitants from every disliked thing that occurs in the abode opposite to it, and from what the authority of the Names of Retribution (*Asma' al-Intiqam*) dictates.\n\n### [Choice of Vision]\n\nAs for His choice of the Vision (*al-Ru'ya*), it is the ultimate goal of sight. Visual pleasure is unmatched by any other pleasure, for it is the certainty of conviction (*'ayn al-yaqin*) in the Worshipped One (*al-Ma'bud*).\n\n### [Choice of the Number Ninety-Nine from the Numbers]\n\nAs for His choice of the number ninety-nine from the numbers, it is because it is the odd number (*witr*) of the Names, combining the units (*al-ahad*) and the tens (*al-'aqd*). \"God has ninety-nine Names, one hundred minus one. Whoever enumerates them shall enter Paradise\" merely by enumeration—memorization, recitation, and comprehension. For God is Odd (*Witr*) and loves the odd number.\n\n### [Choice of the Obligatory Duties]\n\nAs for His choice of the Obligatory Duties (*al-fara'id*), their result is that the servant becomes the attribute of the Real: His hearing and His sight. For the love of the Supererogatory Acts (*al-nawafil*) grants that the Real becomes the servant's hearing and sight. The Supererogatory Act is only in a degree lower than the Obligatory Duty (*al-fard*). The Obligatory Duty has primacy. The Real does not descend to the level of being the servant's hearing, as required by His Majesty (*Jalal*). Rather, God must descend with His Attribute, which is the servant being the attribute of the Real, due to the Form upon which he was created. This [Form] is cut off from the Divine Form, just as the womb (*al-rahm*) is a branch (*shijna*) of the All-Merciful (*al-Rahman*). The Obligatory Duty (*al-fard*) is the cutting (*al-qat'*). When the servant performs it, it becomes manifest to him that he is an attribute of the Real. If he performs a Supererogatory Act, the Real becomes his attribute. Thus, the Obligatory Duty is distinguished from the Supererogatory Act, and the higher degree belongs to the Obligatory Duty. Were it not for what the Obligatory Duty grants, it would not be established that He says:\n\n\"I was hungry, and you did not feed Me.\"\n\n\"I am most eager to meet My servant who desires Me.\"\n\n\"He is nearer to Us than the jugular vein.\"\n\n\"I have not hesitated concerning anything I am about to do...\"\n\nAnd similar Divine communications.\n\n### [Choice of Laylat al-Qadr from the Other Nights]\n\nAs for His choice of the Night of Power (*Laylat al-Qadr*) from all other nights, it is because matters are only distinguished by their measures (*aqdar*) in the sight of the Real (*al-Haqq*). The Real is Unseen (*Ghayb*), so He specifically assigned the measure (*al-qadr*) to the night, because the night is a veil (*satr*), just as the Unseen is veiled.\n\n### [Choice of Friday from the Days]\n\nAs for His choice of Friday (*Yawm al-Jumu'a*) from the days, it is because the two Forms (*al-suratan*) appeared in it. God made that day for the forms. It is the fifth month for the dropping of the sperm. It is a feminine day, possessing adornment and the completion of creation. God chose within it an hour of its hours, which is like the dot (*al-nukta*) in the mirror. This is the place of the image of the Manifesting One (*al-Mutajalli*) in the mirror of the day, where He sees Himself. The address and the obligation (*al-taklif*) occur based on the Form that appears between the mirror and the viewer. Through it arise the demonstrative pronouns (*asma' al-isharat*)—such as *dha*, *dhan*, *ta*, *tan*, and *ula'*—and the personal pronouns (*asma' al-dama'ir*)—such as *huwa*, *hiya*, *huma*, *hum*, *hunna*, *ka*, *kuma*, *kum*, *kunna*, *anta*, *anti*, *antuma*, *antum*, *antunna*, and the *ya'* pronoun of the first person singular, which affects its subject (*aniyya*) unless the *Nun* of Protection (*Nun al-Wiqaya*) guards it. It must have an effect, either on the subject or on the *Nun* of Protection; it is necessary. For this reason, the *Nun* of Protection possesses spiritual chivalry (*futuwwa*) and altruism (*ithar*) from the world of letters. This is why it is called the *Nun* of Protection. It holds a status like the *Kaf* in His saying, \"I seek refuge in You (*a'udhu bi-ka*).\" Concerning it, I say:\n\n> The *Nun* of Protection is a *Nun* that nothing resembles\n> In Existence, save fasting and good character (*khalaq*).\n> Spiritual chivalry and altruism are its origin,\n> So we have no protector in the word other than it.\n> Half of Existence belongs to it, by the attribute of its Creator,\n> In status, thus it is the Permanent, the Abiding.\n\n### [Choice of the Three Generations in Order]\n\nAs for His choice of the three generations (*al-qurun*) in order, the first of these is due to the manifestation of the perfection of Muhammad (peace and blessings be upon him), both unseen and witnessed. He instituted the Law himself, abrogated what had been the *Sunna* of his deputies by his presence, confirmed what he confirmed, and affirmed belief in all of it—what was abrogated and what was not. This is the first generation. Then two generations followed him. All of them are people of spiritual opening (*fath*) and manifestation, holding the status of the three white blazes (*al-ghurar*) of every month. He (peace and blessings be upon him) said: \"A group of people will wage war, and it will be said, 'Is there among you anyone who saw the Messenger of God (peace and blessings be upon him)?' They will say, 'Yes,' and they will be granted victory (*fath*). This is the first generation. Then a group of people will wage war, and it will be said, 'Is there among you anyone who saw someone who saw the Messenger of God (peace and blessings be upon him)?' They will say, 'Yes,' and they will be granted victory. This is the second generation. Then a group of people will wage war, and it will be said, 'Is there among you anyone who saw someone who saw someone who saw the Messenger of God (peace and blessings be upon him)?' They will say, 'Yes,' and they will be granted victory. This is the third generation.\" He (peace and blessings be upon him) did not add more than this. This is because there is nothing besides the Divine Presence (*al-Hadra al-Ilahiyya*), which is an expression for the Essence (*al-Dhat*), the Attributes (*al-Sifat*), and the Acts (*al-Af'al*). This is the meaning of \"the best of generations.\" Through the providence of the first generation, the opening was granted to all. This is the Essence of the Messenger of God (peace and blessings be upon him), and the power of his light and the authority of his manifestation granted the Divine Opening (*al-Fath al-Ilahi*) to whoever saw him, or saw whoever saw him, or saw whoever saw whoever saw him. This is His saying: \"The best of generations is my generation, then those who follow them, then those who follow them.\"\n\nWe only likened them to the three white blazes of the month and likened the time of his call to a month because people differed on the measure of a generation (*qarn*) in time. Among their sayings is that a generation is thirty years. For this reason, we placed the three generations, from the time of his call until the Day of Resurrection, in the status of a month, and made the three generations like the three white blazes of it.\n\n### [Choice of Fasting from the Acts of Worship]\n\nAs for His choice of Fasting (*al-Sawm*) from the acts of worship:\n\nThe Prophet (peace and blessings be upon him) said to a person who asked him, \"Hold fast to fasting, for there is nothing like it.\"\n\nHe negated likeness (*mithliyya*) for fasting, thus resembling <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him). And He said, \"Fasting is for Me.\"\n\nHe made all other acts of worship for the human being, since fasting is an attribute of Transcendence (*tanzih*), and Transcendence is only fitting for Him (Exalted is He).\n\n### [Choice of Ramadan from the Months]\n\nAs for His choice of the month of Ramadan from the months, it is due to its participation in the Name, for Ramadan is one of the Divine Names. Thus, a sanctity was determined for it that does not belong to the rest of the months of the year. He made it one of the lunar months so that its blessing might encompass all the months of the year, manifesting in every month of the year, so that every day of the year receives a share of it. The best months, in our view, are Ramadan, then Rabi' al-Awwal, then Rajab, then Sha'ban, then Dhu al-Hijja, then Shawwal, then Dhu al-Qa'da, then Muharram. My knowledge concerning the virtue of the lunar months ends here. The order of virtue for the remaining lunar months—Safar, Rabi' al-Akhir, Jumada al-Ula, and Jumada al-Akhira—was left ambiguous to me. I do not have knowledge of the order of their virtue, or whether they are equal in virtue, which is what I predominantly suspect. He manifested that, but I did not verify it, so I cannot say what I do not have knowledge of. God knows best.\n\n### [Choice of Water from the Elements]\n\nAs for His choice of the element Water (*al-Ma'*) from the elements (*al-arkan*), it is because He made every living thing from water. Even the Throne (*al-'Arsh*), when He created it, was not above water. Life flowed into it from water, making it the Greatest Element (*al-Rukn al-A'zam*), just as He said, \"Hajj is Arafah.\" Although the cause of life involves other things alongside water, water is the Greatest Element among those things.\n\n### [Choice of the Throne from the Celestial Spheres]\n\nAs for His choice of the Throne (*al-'Arsh*) from the celestial spheres (*al-aflak*), it is because it encompasses all bodies, and <<وَاللهُ بِكُلِّ شَيْءٍ مُحِيطٌ>> (And Allah is encompassing of all things). It has primacy (*al-awwaliyya*) among the spheres, and what is beneath it. Thus, it is the First, the Encompassing. He chose it for the settling (*al-istiwa'*) due to the connection between the two attributes. If the Throne is the Kingdom (*al-Mulk*), then it is more fitting that it be chosen without choice, because there is nothing but God and His Kingdom, and everything other than Him is His Kingdom. However, a distinction of the Throne from others has been narrated, so it is determined to be chosen for its primacy and encompassing nature, because the heavens and the earth are within the *Kursi* (Footstool) like a ring in a desert, and the *Kursi* is within the Throne like a ring in a desert.\n\n### [Choice of the Angels from the Servants]\n\nHe chose the Angels from the servants, for they are created from Light (*Nur*). Their bodies are essentially luminous, making them closer in proportion than other creatures to the Divine Light (*al-Nur al-Ilahi*). For this reason,\n\nThe Messenger of God (peace and blessings be upon him) used to supplicate that God make him Light,\n\ndue to his knowledge of the darkness of nature (*zulmat al-tabi'a*).\n\n### [Choice of the Cloud/Mist from the Where-nesses]\n\nHe chose the Cloud (*al-'Ama'*) from the Where-nesses (*al-ayniyyat*), and He was in it before the creation of creation. From it, He created the Bewildered Angels (*al-Mala'ika al-Muhayyima*), who are bewildered in His Majesty (*Jalal*). Then He created creation, and their bewilderment in the Majesty of His Beauty (*Jalal Jamalihi*) preoccupied them from seeing anything other than Him. They are those who do not know that God created anyone else. What a noble state this is! Thus, He made the Cloud a Where-ness for Him, the Throne a place of settling for Him, the lowest heaven a place for His descent, and the earth for His accompaniment. He is with us wherever we are.\n\n### [Choice of the Messengers from Mankind]\n\nHe chose the Messengers (*al-Rusul*) from mankind to convey from God what the matter truly is. He only brought them forth for the sake of Gnosis of Him, because He loved to be known. He introduced Himself to them through the Messengers, by the books and scriptures He sent down with them. They knew Him with an essential gnosis (*ma'rifa dhatiyya*), just as they knew Him through the intellects (*al-'uqul*) He created for them and gave the power of speculative thought (*al-nazar al-fikri*). They knew Him through proofs and demonstrations with an existential, negative gnosis (*ma'rifa wujudiyya salbiyya*). The intellect, in its independence, could not achieve more than this. Then, the Messengers came afterward with essential gnosis. Thus, creation worshipped the God who introduced Himself to them through His Law (*shar'*) because the intellect does not provide any act of worship, any means of proximity (*qurba*), or any affirmative essential attribute (*sifa dhatiyya thubutiyya*) for the Real. The only share the intellect has in the Law, which its proof can independently establish, is <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like Him), with the addition of the *kaf* [in *ka-mithlihi*], not by affirming it as an attribute. Thus, He chose the Messengers to convey what the intellect cannot independently grasp of the knowledge of His Essence, and of the deeds, abstentions, and relationships that bring proximity to Him.\n\n### [Choice of the Name Allah from the Beautiful Names]\n\nHe chose the Name *Allah* from the Beautiful Names (*al-Asma' al-Husna*) and established it in the words in its proper place. It is the Name that is described but does not describe. All Names are its descriptions, but it is not a description. For this reason, derivation (*ishtiqaq*) is forced upon it. It is a static, proper noun (*'alam jamid*) designated for the Essence (*al-Dhat*) in the world of words and letters. No one else (Glorious and Exalted is He) is named by it. Thus, He protected it from being shared, just as He indicated that there is no god other than Him.\n\n### [The Divine Choices are a Call to the Intellects for Choice, which is Reflection and Insight]\n\nWe have mentioned these Divine Choices (*al-Ikhtiyarat al-Ilahiyya*) as an alert to the heedless intellects concerning what they are called to: reflection (*i'tibar*) and insight (*istibsar*). We have not exhausted the matter completely, for we do not know the details of what God created of existing things by way of comprehensive knowledge, even though we are able, by God's empowerment, to confine the existing things, which includes everything. We only intended here to know the individual things He chose and selected from every type of the limited creatures in Existence—those subsisting by themselves and those not subsisting by themselves, the localized and the non-localized, and the type that accepts localization only by dependence, and what is composed of these and what is not composed. The divisions of the cosmos and existing things are confined to what we have mentioned.\n\n### [What the Intellect Can Independently Choose and What is Beyond Its Level]\n\nThere is a relative detail that the intellect can independently establish: the preference of things over one another by distinguishing their levels (*maratib*), the influence of some upon others, the effect of some upon others, and the dependence of some upon others. However, the preference of Divine Proximity (*al-Qurb al-Ilahi*) through His Providence toward them, rather than what their realities dictate, can only be achieved by God informing us through the sciences of inspiration (*'ulum al-ilham*) He places in our hearts, or through what reaches us of this in the revealed books and Prophetic communications. There is no other way besides this.\n\n### [Intellectual Indications, Legal Definitions, and Essential Worship]\n\nThe Supererogatory Acts (*al-sunan*) are the intellectual indications (*al-dalalat al-'aqliyya*) because they are paths. The Obligatory Duties (*al-fara'id*) are the legal definitions (*al-ta'rifat al-shar'iyya*) concerning what the Real (Exalted is He) is, in relation to Himself and in relation to His creation. So worship God, O servants of God, according to the description He gave of Himself in His Book or upon the tongues of His Messengers, without addition or omission, and without interpretation (*ta'wil*) that leads to deficiency or excess. Rather, submit to Him (Glorious is His Majesty) what He described Himself with, even if it seems impossible or contradictory. That is due to our deficiency and ignorance of the true state of the matter. We have fulfilled what the speculative intellectual power grants of knowledge concerning His Existence and the truthfulness of those who convey from Him (Exalted is He) what He revealed to His servants. We say: Acceptance without objection, even if the matter contradicts or seems impossible. For what is essentially unknown to the intellect—how can it enter into what relates to His Essence concerning necessity, possibility, or impossibility? The intellect must not exceed its limit, and it must submit to Him (Exalted is He) what He revealed and informed us of concerning Himself. For God <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (Speaks the truth, and He guides to the way). We must believe in Him and in what came from Him, based on His knowledge of it, in a Book or upon the tongue of a Messenger. May God grant us success in adhering to that, for none perishes concerning God except the doomed. End of the Ninety-Fifth Part.\n\n(In the Name of God, the Most Compassionate, the Most Merciful)",
    "ur": "(باب نمبر نوے: فرائض اور سنن کی معرفت میں)\n\nبے شک فرائض (فرض) سواریوں کی مانند ہیں اور سنن (سنت) *** ان کے لیے ان کی منزلوں تک پہنچنے کا راستہ ہیں\n\nپس جب تو مسافت طے کر لے تو تو فریضہ بن جاتا ہے *** اور تو اس کی آیات میں ذات حق (الحق) کی سماعت بن جاتا ہے\n\nنوافل (نفل) اس کے برعکس ہیں، پس ان پر غور کر اور لازم پکڑ *** فضیلت کے راستوں کو اور ان کے اثبات میں کوشش کر\n\n### [فرض عین، فرض کفایہ، فرض مشروط]\n\nفرائض وہ اعمال یا تروک ہیں جنہیں اللہ تعالیٰ نے اپنے بندوں پر واجب کیا ہے اور ان کو لازم کر دیا ہے، اور جو ان کو ادا نہیں کرتا وہ گنہگار ہوتا ہے۔ یہ دو قسم کے ہیں: فرض عین (فرض عین) جو اس سے ساقط نہیں ہوتا اگرچہ کوئی دوسرا اسے کر لے، اور فرض کفایہ (فرض کفایہ) جو اس سے ساقط ہو جاتا ہے اگر کوئی دوسرا اسے انجام دے دے۔ اور یہ دوسرے کے انجام دینے سے پہلے اس پر اور اس دوسرے پر بھی متعین تھا، جیسے نماز جنازہ، میت کو غسل دینا اور جہاد۔ اور پھر ایک اور فرض ہے جو ان دونوں کے درمیان جھلکتا ہے، جس کا ایک پہلو ہر ایک کی طرف ہے لیکن اس کا حکم دوسرے سے مختلف ہے، جیسے فرض حج اگر وہ استطاعت نہ رکھتا ہو۔ اگرچہ وہ اس کا مکلف نہیں ہوتا مگر استطاعت کے ساتھ، لیکن یہ ایک ایسا فرض ہے جو اپنی شرط پر موقوف ہے۔ پس اگر اس کی طرف سے اس کا ولی حج کر لے تو وہ اس سے ساقط ہو جاتا ہے اور اسے ادائیگی کا اجر ملتا ہے۔ یہ حکم فرض کفایہ میں نہیں ہے کیونکہ وہاں اجر موجود ہوتا ہے، اور نہ ہی فرض نماز میں ہے کیونکہ یہ اس شخص سے ساقط نہیں ہوتی جس کی طرف سے نماز پڑھی گئی ہو، لہٰذا یہ نہ فرض نماز سے مشابہت رکھتا ہے اور نہ فرض کفایہ سے۔\n\n### [سنن کی دو اقسام: وہ سنت جس کا رسول نے حکم دیا اور وہ سنت جو امت کے کسی فرد نے ایجاد کی]\n\nاور جہاں تک سنن (السنن) کا تعلق ہے، تو وہ ہر وہ چیز ہے جو متعین عمل کے علاوہ ہے۔ اور یہ دو قسم کی ہیں: ایک وہ سنت جسے رسول نے حکم دیا اور اس کی ترغیب دی یا خود اسے انجام دیا اور اپنی امت کو اس کے کرنے میں اختیار دیا، اور دوسری وہ سنت جسے امت کے کسی فرد نے ایجاد کیا اور اس کی پیروی کی گئی، تو اسے اس کا اجر ملتا ہے اور ان لوگوں کا اجر بھی جو اس پر عمل کرتے ہیں۔\n\n### [مکلف کی زندگی میں فریضہ کے عمل کا ثمر]\n\nپس جب بندہ فریضہ کو مکمل طور پر ادا کرتا ہے، تو اس نے ربوبیت (الربوبۃ) کے اس حق کو پورا کر دیا جو اس پر عبودیت (العبودۃ) کی حیثیت سے واجب تھا۔ اس فریضہ کا عمل اس کے لیے ایک ایسا امر پیدا کرتا ہے جو اس سے بھی اعلیٰ ہے کہ ذات حق (الحق) اس کی سماعت بن جائے۔ کیونکہ ذات حق کا بندے کی سماعت بن جانا بندے کے لیے ایک حال ہے، اور فرض کا حکم اس حال کے درمیان حائل ہو جاتا ہے۔ وہ یہ ہے کہ بندہ ذات حق کی سماعت بن جائے، پس ذات حق بندے کے ذریعے سنتی ہے۔ اور یہی وہ قول ہے: \"میں بھوکا تھا تو تم نے مجھے کھانا نہیں کھلایا۔\" اور جہاں تک اس رکاوٹ کا تعلق ہے جو فرض نے دی ہے کہ ذات حق اس کی سماعت بن جائے، تو یہ ایک ثابت شدہ مقام ہے جیسا کہ امرِ نفس میں ہے۔ اس وقت بندہ جانتا ہے کہ ذات حق (الحق) وہی ہے، وہ (بندہ) نہیں ہے۔ جبکہ صاحبِ حال کہتا ہے: \"میں ہوں۔\"\n\n### [سنت نبویہ اور وہ سنن جو رسول اللہ صلی اللہ علیہ وسلم کے بعد مستحسن شرائع ہیں]\n\nاور سنن (السنن) اقتداء کے راستے ہیں، اور ان میں سب سے اعلیٰ ذات حق (الحق) کی اقتداء ہے، تاکہ میں اپنے اوپر اس کے اسماء کے اطلاق میں تحقق (تحقق) کے قریب ہو جاؤں نہ کہ تخلق (تخلق) کے۔ اور ولی کے حق میں سب سے ادنیٰ اقتداء ان لوگوں کی ہے جن کے بارے میں اللہ نے فرمایا: أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ (یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کیجیے)۔ اور علماء انبیاء کے وارث ہیں، اور انہوں نے صرف علم ہی وراثت میں پایا ہے۔\n\nپس سنت نبویہ (السنة النبویۃ) بلند مقام رکھتی ہے، اور وہ دین پر اجتماع اور اسے قائم کرنا ہے، اور اس میں تفرقہ نہ ڈالنا ہے۔ پس جو شخص اسے اختیار کرتا ہے اور اس پر چلتا ہے، وہ اسے معارف (معارف)، احوال اور ظہور الٰہی (التجلی) میں اس کی منزلوں تک حقیقت محمدیہ (الحقیقۃ المحمدیۃ) کی حضرات میں بلند کرتی ہے۔ اور جہاں تک ان سنن کا تعلق ہے جو رسول اللہ صلی اللہ علیہ وسلم کے بعد مستحسن شرائع ہیں، اور یہی فقہاء کے نزدیک استحسان ہے، جس کے بارے میں امام شافعی رحمہ اللہ نے فرمایا: \"جس نے استحسان کیا، اس نے شریعت سازی کی۔\" فقہاء نے اس قول کو ان سے مذمت کے طور پر لیا، حالانکہ وہ رضی اللہ عنہ ایک ایسی مشروع حقیقت کے ساتھ گویا ہوئے تھے جو ان سے سمجھی نہیں گئی۔ کیونکہ وہ چار اوتاد (اوتاد) میں سے تھے، اور شرعی علم کے ساتھ ان کا قیام ان کے زمانے کے لوگوں اور ان کے بعد والوں سے حجاب بن گیا۔ ہم نے بعض صالحین سے روایت کی ہے کہ وہ خضر علیہ السلام سے ملے اور ان سے پوچھا: \"آپ شافعی کے بارے میں کیا کہتے ہیں؟\" انہوں نے فرمایا: \"وہ اوتاد میں سے ہیں۔\" پوچھا: \"آپ احمد بن حنبل کے بارے میں کیا کہتے ہیں؟\" فرمایا: \"ایک صدیق (صدیق) شخص ہیں۔\" پوچھا: \"آپ بشر حافی کے بارے میں کیا کہتے ہیں؟\" فرمایا: \"ان کے بعد ان جیسا کوئی نہیں چھوڑا گیا۔\" پس یہ خضر علیہ السلام کی شافعی رحمہ اللہ کے حق میں گواہی ہے۔\n\n### [شریعت نے بدعت حسنہ کو جائز قرار دیا]\n\nاور جب شافعی کے نزدیک یہ صحیح ثابت ہوا کہ نبی صلی اللہ علیہ وسلم نے فرمایا: \"جس نے کوئی اچھی سنت (سنة حسنة) ایجاد کی تو اسے اس کا اجر ملے گا اور ان لوگوں کا اجر بھی جو اس پر عمل کریں گے، اور جس نے کوئی بری سنت (سنة سيئة) ایجاد کی...\" (بقیہ حدیث)، تو اس میں کوئی شک نہیں کہ شریعت نے اسے اجازت دی ہے کہ وہ کوئی اچھی سنت ایجاد کرے، اور یہ ان چیزوں میں سے ہے جو اسے انبیاء سے وراثت میں ملی ہیں۔ اور یہ اچھی ہے، یعنی ذات حق (الحق) اسے اس سے مستحسن قرار دیتی ہے، اور اس نے اسے ایجاد کیا۔ پس جس نے استحسان کیا، یعنی جس نے کوئی اچھی سنت ایجاد کی، تو اس نے شریعت سازی کی۔ اور لوگوں کے اس بارے میں امام شافعی کے کلام کو نہ سمجھنے پر تعجب ہے، حالانکہ وہ مجتہد کے حکم کو ثابت کرتے ہیں، اگرچہ وہ امرِ نفس میں غلطی کرے۔ اور شارع نے اسے برقرار رکھا ہے، اور یہ ایک شرعی حکم ہے جو مقبول ہے، اور کسی بھی حاکم کے لیے اسے رد کرنا جائز نہیں، اور شریعت کے قواعد اور اصول اس کی حفاظت کرتے ہیں، جیسے امام مالک کے مذہب میں مصالح مرسلہ (المصالح المرسلة)۔\n\n### [موجودات میں الٰہی اختیارات اور مشروع امور میں عقلمندوں کے اختیارات]\n\nاور جب شارع نے اس کے حکم کو اجمالی طور پر مقرر کر دیا اور یہ واضح کر دیا کہ اسے ایجاد کرنے والا اور اس کی پیروی کرنے والے اجر پانے والے ہیں، اور پیروی کرنے والوں کی انتہا اس کے ایجاد کرنے والے تک اس کے مرتبے اور اس کی ایجاد کردہ سنت کے مطابق ہے، تو میں نے اس کے ذریعے آپ کو متنبہ کیا ہے کہ آپ کے اوقات نبوی شرائع اور اصلی سنن سے آباد ہونے چاہییں۔ کیونکہ عقلمند (الکیس) کے عمل کی انتہا صرف اصلی نبوت ہونی چاہیے نہ کہ فرعی، جب کہ اسے اختیار میں اختیار حاصل تھا، کیونکہ امور اپنی ذات میں اختیار کو قبول کرتے ہیں، جیسا کہ اللہ سبحانہ نے تمام موجودات میں کیا ہے۔ پس اس نے ہر جنس میں سے ایک امر کو اختیار کیا، جیسے اس نے اسماء حسنیٰ میں سے \"اللہ\" کے کلمے کو اختیار کیا، اور لوگوں میں سے رسولوں کو اختیار کیا، اور بندوں میں سے فرشتوں کو اختیار کیا، اور افلاک میں سے عرش کو اختیار کیا، اور ارکان میں سے پانی کو اختیار کیا، اور مہینوں میں سے رمضان کو اختیار کیا، اور عبادات میں سے روزے کو اختیار کیا، اور زمانوں میں سے نبی صلی اللہ علیہ وسلم کے زمانے کو اختیار کیا، اور ہفتے کے دنوں میں سے جمعہ کے دن کو اختیار کیا، اور راتوں میں سے شب قدر کو اختیار کیا، اور اعمال میں سے فرائض (الفرائض) کو اختیار کیا، اور اعداد میں سے ننانوے کو اختیار کیا، اور گھروں میں سے جنت کو اختیار کیا، اور جنت میں سعادت کے احوال میں سے رؤیت (الرؤیۃ) کو اختیار کیا، اور احوال میں سے رضا (الرضی) کو اختیار کیا، اور اذکار میں سے لَا إِلَهَ إِلَّا الله کو اختیار کیا، اور کلام میں سے قرآن کو اختیار کیا، اور قرآن کی سورتوں میں سے سورۃ یٰس کو اختیار کیا، اور قرآن کی آیات میں سے آیۃ الکرسی کو اختیار کیا، اور قصار مفصل میں سے قُلْ هُوَ الله أَحَدٌ کو اختیار کیا، اور زمانوں کی دعاؤں میں سے یوم عرفہ کی دعا کو اختیار کیا، اور سواریوں میں سے براق کو اختیار کیا، اور فرشتوں میں سے روح (الروح) کو اختیار کیا، اور رنگوں میں سے سفیدی کو اختیار کیا، اور اکوان (کائنات) میں سے اجتماع کو اختیار کیا، اور انسان میں سے قلب (القلب) کو اختیار کیا، اور پتھروں میں سے حجر اسود کو اختیار کیا، اور گھروں میں سے بیت المعمور کو اختیار کیا، اور درختوں میں سے سدرہ (السدرۃ) کو اختیار کیا، اور عورتوں میں سے مریم اور آسیہ کو اختیار کیا، اور مردوں میں سے محمد صلی اللہ علیہ وسلم کو اختیار کیا، اور ستاروں میں سے سورج کو اختیار کیا، اور حرکات میں سے حرکت مستقیمہ (الحرکۃ المستقیمۃ) کو اختیار کیا، اور نوامیس (قوانین) میں سے نازل شدہ شریعت کو اختیار کیا، اور براہین (دلائل) میں سے براہین وجودیہ (البرہان الوجودیہ) کو اختیار کیا، اور صورتوں میں سے آدم کی صورت کو اختیار کیا، اسی لیے اسے الٰہی صورت پر ظاہر کیا، اور انوار میں سے وہ نور اختیار کیا جس کے ساتھ نظر ہوتی ہے، اور دو متضاد چیزوں میں سے اثبات کو اختیار کیا، اور دو مخالف چیزوں میں سے ہستی (الوجود) کو اختیار کیا، اور غضب پر رحمت کو اختیار کیا، اور نماز کے افعال کے احوال میں سے سجدے کو اختیار کیا، اور اس کے اقوال میں سے ذکر اللہ کو اختیار کیا، اور ارادوں کی اقسام میں سے نیت کو اختیار کیا، کیونکہ عمل کی قبولیت اور رد میں اسی کا حکم چلتا ہے، کیونکہ:\n\n\"لِكُلِّ امْرِئٍ مَا نَوَى\" (ہر شخص کے لیے وہی ہے جو اس نے نیت کی)۔\n\nاور غیر عامل بھی اجر میں عامل کے ساتھ شامل ہو جاتا ہے اور اس میں اضافہ ہوتا ہے۔\n\n### [نماز کے اقوال میں سے ذکر اللہ کا اختیار]\n\nاور جہاں تک نماز کے اقوال میں سے ذکر اللہ کا تعلق ہے، تو اس میں ذکر اللہ سب سے بڑا ہے، جیسا کہ اللہ عزوجل نے فرمایا: إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ ولَذِكْرُ الله أَكْبَرُ (بے شک نماز بے حیائی اور برائی سے روکتی ہے، اور یقیناً اللہ کا ذکر سب سے بڑا ہے)۔ کیونکہ نماز مناجات ہے، اور ذکر کرنے والا ذات حق (الحق) کا ہم نشین ہوتا ہے، پس اگر وہ اس کے ذریعے ذکر کرے تو وہ (اللہ تعالیٰ) اس کی زبان ہوتا ہے۔\n\n### [نماز کے افعال میں سے سجدے کا اختیار]\n\nاور جہاں تک نماز کے افعال میں سجدے کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ اس میں شیطان سے بچاؤ ہے، کیونکہ وہ نماز کے کسی بھی فعل میں اس سے جدا نہیں ہوتا سوائے سجدے کے، خاص طور پر اس لیے کہ یہ اس کی خطا ہے۔ اور سجدے کے وقت وہ روتا ہے، افسوس کرتا ہے اور نادم ہوتا ہے، اور ندامت توبہ ہے، اور اس قدر کی قبولیت لازمی ہے۔ پس وہ ہر سجدے کے وقت توبہ کرتا ہے، اور اللہ ہر آزمائش میں مبتلا ہونے والے، توبہ کرنے والے کو پسند کرتا ہے۔\n\nپھر وہ سجدے سے سر اٹھانے پر دوبارہ گمراہ کرنے کی طرف لوٹ آتا ہے۔\n\n### [غضب پر رحمت کا اختیار]\n\nاور جہاں تک غضب پر رحمت کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ رحمت احسان کے ذریعے بھی عمل کرتی ہے اور وجوب کے ذریعے بھی عمل کرتی ہے، اور وَسِعَتْ كُلَّ شَيْ‏ءٍ (اس نے ہر چیز کو گھیر رکھا ہے)۔ اور غضب ان چیزوں میں سے ہے جنہیں رحمت نے گھیر رکھا ہے۔ پس وہاں کوئی خالص غضب نہیں ہے جو رحمت سے آلودہ نہ ہو، جبکہ رحمت کو غضب آلودہ نہیں کرتا۔ اور مَنْ يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوى‏ (اور جس پر میرا غضب نازل ہوا، وہ گر گیا)۔ پس غضب نے اسے گرایا، اور جب وہ گرا، اور گرنا صرف غضب کا حکم ہے، تو وہ رحمت میں گرتا ہے، پس وہ اسے گھیر لیتی ہے اور اسے تھام لیتی ہے۔ پس وہ صرف اسی کی طرف گرتا ہے، اور غضب میں موجود رحمت کے ذریعے ہی وہ گرا۔ پس وہی ہے جس نے غضب کو اس کے ذریعے گرایا تاکہ خالص رحمت اسے سنبھال لے، جیسے ناگوار دوا میں موجود رحمت، جسے مریض ناگواری کے باوجود پیتا ہے، اس میں ایک پوشیدہ رحمت ہوتی ہے جس کی وجہ سے اس نے اس ناگوار دوا کو استعمال کیا تاکہ وہ اسے عافیت کی طرف لے جائے، اور یہی خالص رحمت ہے۔ اسی لیے انجام کار رحمت کی طرف ہے اور اسی کا حکم چلے گا، اگرچہ وہ آگ سے نہ بھی نکلیں، تو ان کے لیے اس میں نعمت ہوگی، اور اللہ عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ (ہر چیز پر قادر ہے)۔ کیا آپ نہیں دیکھتے کہ اللہ نے دنیا کی آگ میں کیا منافع اور راحتیں رکھی ہیں؟ اگرچہ وہ صرف بعض بیماریوں کے لیے داغنا ہی کیوں نہ ہو، کیونکہ یہ سب سے زیادہ فیصلہ کن دوا ہے، اور اپنے اثر میں قوت کی وجہ سے اس نے توکل میں قدح ڈالی، کیونکہ یہ فعل میں شفا دینے والے اور عافیت دینے والے کی جگہ لیتا ہے، پس غیرت نے داغ لگوانے والے پر یہ حکم لگایا کہ وہ متوکل نہیں ہے۔\n\n### [دو مخالف چیزوں میں سے ہستی کا اختیار]\n\nاور جہاں تک دو مخالف چیزوں میں سے ہستی (الوجود) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ یہ اس کی صفت ہے۔ پس اس نے ممکنات کے لیے اپنی صفت کو اختیار کیا، اور صرف یہی صحیح ہو سکتا ہے، کیونکہ اسے اقتدار حاصل ہے، اور اقتدار سے صرف ہستی (الوجود) ہی ظاہر ہو سکتی ہے۔ کیا آپ نہیں دیکھتے کہ جب اس نے فرمایا: إِنْ يَشَأْ يُذْهِبْكُمْ (اگر وہ چاہے تو تمہیں لے جائے)، تو ساتھ ہی فرمایا: ويَأْتِ بِآخَرِينَ (اور دوسروں کو لے آئے گا)۔ پس اقتدار نے ہستی (الوجود) کے سوا کسی چیز کو قبول نہیں کیا، اور ارادے کو معدوم کرنے کے ساتھ معلق کیا۔ اور اس کا اسم \"المانع\" (روکنے والا) ہے، اور روکنا عدم ہے۔\n\n### [نفی پر اثبات کا اختیار]\n\nاور جہاں تک اس کے اثبات کے اختیار کا تعلق ہے، تو یہ اس چیز کا عین ہے جسے وہ \"کن\" (ہو جا) کہتا ہے، کیونکہ اس کے عدم کی حالت میں اس نے اس کے لیے نفی پر اثبات کو ترجیح دی، یہاں تک کہ وہ اپنے عدم کی حالت میں بھی ممکن (ممکن) رہے۔ اور یہ عدم کی حالت میں ترجیح کا ایک دقیق مسئلہ ہے۔ اور اسی ذاتی افتقار (ذاتی محتاجی) کی وجہ سے جو ممکن میں ہستی (الوجود) سے پہلے موجود تھا، جب ذات حق (الحق) نے اسے چاہا اور اس کی طرف اثبات کے حکم کے ساتھ تیزی سے متوجہ ہوا جو اس پر ہے۔\n\n### [انوار میں سے منتخب نور]\n\nاور جہاں تک انوار میں سے منتخب نور کا تعلق ہے، تو انوار حجاب ہیں، اور اسی لیے:\n\nاس نے حجابی انوار کے بارے میں فرمایا: \"نور، میں اسے دیکھتا ہوں۔\"\n\nپھر اس نے رؤیت (دیدار) کا وعدہ کیا، اور وہ نور ہے۔ پس ضروری ہے کہ وہ نور جس میں وہ اپنے بندوں کے لیے ظاہر ہوتا ہے، ان حجابی انوار میں سے منتخب ہو، جیسے نورِ احدیت (نور الأحدیۃ)، عزت، کبریائی اور عظمت۔ یہ سب آنکھوں سے اٹھا لیے جاتے ہیں اور ان کا حکم قلب میں باقی رہتا ہے۔ پس ان کے اٹھائے جانے سے ذات حق (الحق) کا دیدار واقع ہوتا ہے، اور ان کا حکم قلب میں باقی رہتا ہے، اور بندے رؤیت (دیدار) سے فنا (فناء) ہو جاتے ہیں۔ اگر ایسا نہ ہوتا تو وہ اس کے شہود (الشہود) کے وقت اپنے نفوس کا بھی شہود کرتے۔\n\n### [آدمی کی صورت کا اختیار]\n\nاور جہاں تک آدمی کی صورت (الصورة الآدمیۃ) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ اس نے آدم کو اپنی صورت پر پیدا کیا، پس اس پر اپنے تمام اسماء حسنیٰ کا اطلاق کیا، اور ان کی قوت سے اس نے اس امانت کو اٹھایا جو پیش کی گئی تھی، اور اس حقیقت نے اسے یہ حق نہیں دیا کہ وہ اسے رد کر دے، جیسا کہ آسمانوں، زمین اور پہاڑوں نے اسے اٹھانے سے انکار کر دیا تھا، اور حَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً (اور اسے انسان نے اٹھا لیا، بے شک وہ بڑا ظالم تھا) اگر وہ اسے نہ اٹھاتا، جَهُولًا (بڑا جاہل تھا) کیونکہ اللہ کی معرفت (المعرفۃ) عین اس سے جہالت ہے۔ ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے۔ کیونکہ جب وہ جانتا ہے کہ وہاں کچھ ایسا ہے جو وہ نہیں جانتا، تو اس نے کچھ نہیں جانا، اور یہی وہ علم ہے کہ وہاں کچھ ایسا ہے جو نہیں جانا جا سکتا، اور اس کے علم کا تعلق صرف اس سے جہالت سے ہے۔\n\n### [جدلی اور دیگر براہین میں سے براہین وجودیہ کا اختیار]\n\nاور جہاں تک جدلی (جدلیۃ) اور دیگر براہین میں سے براہین وجودیہ (البرہان الوجودیہ) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ وہ ذات حق (الحق) کے ثبوت کے مکمل علم اور فریق مخالف کی دلیل کو باطل کرنے کا ذریعہ بنتے ہیں۔ اور براہین جدلیہ میں یہ قوت نہیں ہوتی، کیونکہ وہ فریق مخالف کی دلیل کو تو باطل کر دیتے ہیں لیکن ہو سکتا ہے کہ حق کو ثابت نہ کر سکیں۔ اور براہین سوفسطائیہ (سوفسطائیۃ) حیرت پیدا کرتے ہیں، اور وہ الٰہی علم میں براہین جدلیہ کے مقابلے میں ایک پہلو سے براہین وجودیہ کے زیادہ قریب ہیں۔\n\n### [حکمی قوانین پر نازل شدہ شریعت کا اختیار]\n\nاور جہاں تک نازل شدہ شریعت (الشریعة المنزلۃ) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ اس کا تعلق دار آخرت اور دنیاوی مصالح سے عام ہے۔ اور وہ حکمی قوانین (النوامیس الحکمیۃ) جو دنیاوی مصالح اور دنیا کے عالم میں خیر کے بقا کے لیے وضع کیے گئے ہیں، ان میں یہ حکم نہیں ہوتا کہ وہ الٰہی قرب، اعمال کی قبولیت، درجات کی بلندی، جنتوں کے اثبات اور دار شقاوت (بدبختی کا گھر) پر اللہ کے لیے حکم لگائیں۔ ان سب کا استقلال صرف اللہ کی طرف سے نازل شدہ شریعت ہی کر سکتی ہے۔ اور جہاں تک ان لوگوں کا تعلق ہے جنہوں نے ایسی عبادات ایجاد کیں اور ان کا حق ادا کیا، اللہ کی رضا کی تلاش میں، جو اللہ نے ان پر فرض نہیں کی تھیں، تو وہ اللہ کی طرف سے نازل شدہ شریعت کے حامل ہیں، پس انہوں نے اس میں ایسی اچھی سنن ایجاد کیں جو اس کے مناسب تھیں جو شریعت نے ان میں نازل شدہ شریعت کے ذریعے مقرر کیا، اور انہیں سنتیں ایجاد کرنے کی اجازت دی۔ اور جہاں تک حکمی قوانین کا تعلق ہے، تو وہ یہ نہیں ہیں جو ان لوگوں نے ایجاد کیے۔ اور اسی لیے ان کے لیے اجر مقرر کیا گیا۔\n\n### [حرکت مستقیمہ کا اختیار]\n\nاور جہاں تک حرکت مستقیمہ (الحرکۃ المستقیمۃ) کے اختیار کا تعلق ہے، تو وہ عَلى‏ صِراطٍ مُسْتَقِيمٍ (سیدھے راستے پر ہے) جیسا کہ اس نے اپنے بارے میں فرمایا، اور اس نے اسے انسان کے لیے خاص کیا جسے اللہ نے ذات حق (الحق) کی صورت پر پیدا کیا، اور اسی پر سعادت مند شخص قیامت کے دن اٹھایا جائے گا۔ پس یہ اس کے لیے دنیا اور آخرت ہے۔ کیونکہ مجرموں کو اوندھے منہ اٹھایا جائے گا، اور یہ حرکت منکوسہ (المنکوسۃ) ہے، جیسا کہ اللہ تعالیٰ نے مجرموں کے حق میں فرمایا: ولَوْ تَرى‏ إِذِ الْمُجْرِمُونَ ناكِسُوا رُؤُسِهِمْ عِنْدَ رَبِّهِمْ (اور کاش آپ دیکھتے جب مجرم اپنے رب کے پاس اپنے سر جھکائے ہوئے ہوں گے)۔ اور بہائم میں افقی ٹیڑھی حرکت ہوتی ہے۔ پس حرکت مستقیمہ صرف اسی کے لیے صحیح ہوئی جسے اللہ نے اپنی صورت پر پیدا کیا، اور وہ انسان کامل (الإنسان الکامل) ہے جسے دنیا اور آخرت میں یہ صفت حاصل ہے۔ اور اسی لیے آدم کا ذکر اس کے ساتھ خاص کیا گیا، کیونکہ وہ اہل سعادت میں سے ہیں جن پر یہ حرکت مستقیمہ باقی رہے گی، اور اسی لیے اسے خلافت سے موسوم کیا گیا۔\n\n### [سورج کا اختیار]\n\nاور جہاں تک سورج (الشمس) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ اسے تمام روشن ستاروں کو اوپر اور نیچے سے مدد فراہم کرنے کا ذریعہ بنایا گیا، اور اسی لیے ابراہیم علیہ السلام نے فرمایا: هذا أَكْبَرُ (یہ سب سے بڑا ہے)۔ اور یہ دونوں مذاہب میں کرہ کے قلب کے ساتھ خاص ہے، اور وہ چوتھا آسمان ہے، اور اس میں ادریس علیہ السلام ہیں، اور اللہ نے ذکر کیا کہ اس نے انہیں مَكاناً عَلِيًّا (بلند مقام) پر اٹھایا۔ پس اس مقام کی بلندی اس وجہ سے ہے کہ یہ افلاک کا قلب ہے، پس یہ مقام کے لحاظ سے بلند ہے، اور جو اس سے اوپر ہے، اگرچہ وہ اس سے کم ہے، لیکن وہ مسافت کے لحاظ سے بلند ہے۔ اور اس کی نسبت ہمارے سروں کی طرف ہے۔ اور یہی وہ ہے جس نے اپنے طلوع و غروب سے رات اور دن کو پیدا کیا، جس کے لیے اللہ نے غشیان (ڈھانپنا) مقرر کیا، اور وہ نکاح اور ایلاج ہے، تاکہ مولدات (پیدا ہونے والی چیزوں) کے اعیان ظاہر ہوں، اور جو کچھ اللہ رات اور دن میں اس ایلاج اور غشیان سے مخلوقات پیدا کرتا ہے۔ اور اس نے شمسی حرکت سے پیدا ہونے والی ان دونوں چیزوں میں سے ہر ایک کے لیے اعیان حوادث کو اس طلب کے ذریعے ظاہر کرنے کے لیے تیز طلب (الطلب الحثیث) مقرر کیا۔\n\n### [محمد صلی اللہ علیہ وسلم کا اختیار]\n\nاور جہاں تک محمد صلی اللہ علیہ وسلم کے اختیار کا تعلق ہے، تو یہ اس کمال اور اعتدال کی وجہ سے ہے جو ان کے مزاج کا تقاضا تھا، دیگر انسانی مزاجوں کے برعکس۔ کیونکہ اسی کے ذریعے انہوں نے اپنی نبوت کا مشاہدہ کیا، جبکہ آدم پانی اور مٹی کے درمیان تھے، اور وہ عنصری مولدات میں اجزاء کے لحاظ سے متفرق تھے۔ اور یہ ایک دقیق مسئلہ ہے جسے صرف وہی جانتا ہے جو آدم کی پشت سے ذریت (اولاد) کے نکالے جانے کو جانتا ہے جب اللہ نے أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ ف قالُوا بَلى‏ (انہیں ان کی جانوں پر گواہ بنایا: کیا میں تمہارا رب نہیں ہوں؟ تو انہوں نے کہا: کیوں نہیں)۔ اور یہی وہ فطرت ہے جس پر لوگ پیدا ہوئے اور اسی کی طرف لوٹیں گے۔ اور اس اجتماع کے بارے میں:\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: \"الأرواح جنود مجندة\" (روحیں جمع کیے ہوئے لشکر ہیں)۔\n\nاور جب اللہ نے انہیں جمع کیا، تو انہیں حضرۃ التمثيل (تمثیل کی حضوری) میں جمع کیا۔ پس جو وہاں آمنے سامنے تھے، وہ یہاں ایک دوسرے کو پہچان گئے، اور جو وہاں پشت بہ پشت تھے، وہ یہاں ایک دوسرے سے اجنبی ہو گئے، اور جو ان کے درمیان چہرے سے پشت اور پہلو وغیرہ کی نسبت سے تھے (وہ اسی نسبت سے یہاں ہیں۔) اور اس بارے میں میں کہتا ہوں:\n\n> إن القلوب لأجناد مجندة *** في حضرة الجمع تبدو ثم تنصرف‏\n> فما تعارف منها فهو مؤتلف *** وما تناكر منها فهو مختلف‏\n\nترجمہ: بے شک دل جمع کیے ہوئے لشکر ہیں *** جو حضرۃ الجمع میں ظاہر ہوتے ہیں پھر لوٹ جاتے ہیں\nپس جو ان میں سے ایک دوسرے کو پہچان گئے، وہ باہم الفت رکھتے ہیں *** اور جو ایک دوسرے سے اجنبی ہوئے، وہ باہم مختلف ہیں\n\nاور ہر کوئی آخرت میں اس گواہی کا اقرار کرے گا اور کوئی انکار نہیں کرے گا اور نہ ہی اپنے لیے ربوبیت کا دعویٰ کرے گا، اللہ تعالیٰ فرماتا ہے: إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا من الَّذِينَ اتَّبَعُوا (جب وہ لوگ جن کی پیروی کی گئی، ان لوگوں سے براءت کریں گے جنہوں نے پیروی کی)۔\n\nپس آپ صلی اللہ علیہ وسلم سب سے عظیم الٰہی ظہور (مجلی الٰہی) تھے، جس کے ذریعے انہیں اولین و آخرین کا علم دیا گیا۔ اور اولین میں سے آدم کا اسماء کا علم تھا، اور محمد صلی اللہ علیہ وسلم کو جوامع الکلم (جامع کلمات) عطا کیے گئے، اور اللہ کے کلمات ختم ہونے والے نہیں ہیں۔ اور قیامت کے دن لوگوں پر ان کی سیادت (سرداری) ہے جو دور نہیں، پس وہ شفاعت کرنے والوں کی شفاعت کریں گے، خواہ وہ بادشاہ ہوں، رسول ہوں، نبی ہوں، ولی ہوں یا مومن، اور ان کے لیے یوم مشہود (دیکھے جانے والے دن) میں مقام محمود (قابل تعریف مقام) ہے۔\n\n### [مریم اور آسیہ کا اختیار]\n\nاور جہاں تک مریم اور آسیہ کے اختیار کا تعلق ہے، تو یہ انہیں اس کمال کے ساتھ ملانا ہے جو مردوں کو حاصل ہے، اس درجے کے باوجود جو مردوں کو ان پر حاصل ہے، کیونکہ وہ درجہ وجودی ہے، لہٰذا وہ زائل نہیں ہوگا۔\n\n### [سدرہ کا اختیار]\n\nاور جہاں تک سدرہ (السدرۃ) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ یہ بندوں کے اعمال کے اختتام کی جگہ ہے اور فضل کی جگہ ہے۔ اور اس کے سائے تلے اعمال کی صورتیں سایہ حاصل کرتی ہیں، اور اللہ نے اسے ان انوار سے ڈھانپ دیا جو اس نے ڈھانپا۔ خبردار! وہ انوار اعمال کے انوار ہیں، پس کوئی بھی ان کی صفت بیان نہیں کر سکتا۔ اور وہ انوار، جیسا کہ ہم نے کہا، اعمال کے انوار ہیں جو ان کی صورتوں سے نکلتے ہیں اور اسے ڈھانپ لیتے ہیں، پس کوئی بھی ان کی صفت بیان نہیں کر سکتا۔ کیونکہ اشیاء کی صفت بیان کرنا انہیں مقید کرنا اور ممتاز کرنا ہے، اور اعمال مختلف ہیں اور ان کے مراتب ہیں، اور ان کے انوار ان کے مراتب کے مطابق ہیں: فعال، اعلیٰ، روشن اور زیادہ روشن۔ اور اعلیٰ کی صفت اعلیٰ کی صفت کے منافی ہے، اور روشن کی صفت زیادہ روشن کے مقابلے میں ہے، اس لحاظ سے کہ وہ زیادہ روشن ہے۔ پس وہ کسی صفت سے مقید نہیں ہو سکتے، کیونکہ اگر آپ انہیں کسی صفت سے مقید کریں گے تو اس کی نقیض اسے باطل کر دے گی، پس آپ نے انہیں صفت کے حق میں پورا نہیں کیا، کیونکہ اعمال کے انوار ایک ہی درجے پر نہیں ہیں۔ اور ان انوار نے اسے ڈھانپ لیا ہے اور چھپا لیا ہے، پس کوئی بھی اس کی صفت تک نہیں پہنچ سکتا۔ پس اگرچہ وہ اس کے سائے تلے ہیں، لیکن انہوں نے اسے انوار کے لباس سے ڈھانپ دیا ہے جس کی وجہ سے وہ تمام درختوں پر فضیلت رکھتی ہے۔ اور یہ کھانا، غسول (دھونے کی چیز) ہے، اور اس کے بیر مٹکوں کی طرح ہیں، جن سے شہداء کی روحوں کو رزق دیا جاتا ہے۔\n\n### [بیت المعمور کا اختیار]\n\nاور جہاں تک بیت المعمور (البيت المعمور) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ یہ ان فرشتوں کی آبادی کے لیے مخصوص ہے جو ہر روز نہر حیات کے پانی کے قطروں سے پیدا ہوتے ہیں جو روح الامین (جبرائیل) کے جھٹکنے سے گرتے ہیں۔ کیونکہ وہ ہر روز ایک غوطہ نہر حیات میں لگاتے ہیں تاکہ بیت المعمور کو آباد کرنے والے یہ فرشتے پیدا ہوں۔ اور وہ ستر ہزار فرشتے ہیں جو جب اس سے نکلتے ہیں تو کبھی واپس نہیں آتے۔ اور راز اس جگہ میں باقی رہا جسے یہ فرشتے آباد کرتے ہیں، اور وہاں کوئی خلا نہیں ہے، حالانکہ پورا عالم خلا سے بھرا ہوا ہے۔ پس اس کی تلاش کرو، کیونکہ یہ ایک عظیم علم ہے جو تمہیں اعیان (اشیاء کی حقیقتوں) کے اعیان میں استحالات (تبدیلیوں) کے علم پر اور خلق کے اطوار میں پلٹنے پر مطلع کرے گا، پس تم جان لو گے کہ أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ (بے شک اللہ ہر چیز پر قادر ہے)، نہ کہ اس پر جو کوئی چیز نہیں ہے، کیونکہ \"لا شیء\" (کوئی چیز نہیں) شیئیت (چیز ہونے) کو قبول نہیں کرتا، کیونکہ اگر وہ اسے قبول کرتا تو اس کی حقیقت \"لا شیء\" نہ ہوتی، اور کوئی معلوم اپنی حقیقت سے باہر نہیں نکلتا۔ پس \"لا شیء\" پر ہمیشہ کے لیے یہ حکم ہے کہ وہ \"لا شیء\" ہے، اور جو \"شیء\" (چیز) ہے، اس پر ہمیشہ کے لیے یہ حکم ہے کہ وہ \"شیء\" ہے۔\n\n### [حجر اسود کا اختیار]\n\nاور جہاں تک حجر اسود (الحجر الأسود) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ اللہ نے اسے نازل کیا تاکہ اسے بیعت الٰہیہ میں اپنے دائیں ہاتھ کے مقام پر قائم کرے، کیونکہ معارف (المعرفۃ) اور عبادات میں کوئی چیز اس سے زیادہ لازم نہیں ہے جو اس نے پہچانا اور جن عبادات کے ذریعے اس نے عبادت کی۔ کیونکہ یہ معرفت اور خالص عبودیت پر فطرت میں پیدا کیا گیا، جس سے نباتات اور حیوانات کی حقیقت عاجز رہی۔ اور اسی لیے انسان میں اس کا کوئی حصہ مکمل طور پر نہیں ہے۔ کیونکہ انسان میں ہر وہ چیز ہے جو نشوونما کو قبول کرتی ہے، اور یہ نباتات کے لیے ہے، جیسا کہ حیوان کو جہات میں تصرف حاصل ہے۔ پس جب بھی کوئی موجود معدن سے جدا ہوتا ہے، تو وہ اپنی حقیقت کے دعوے کی صورت سے ملبوس ہو جاتا ہے، اور یہ ایک پوشیدہ کشمکش ہے جسے ہر عالم محسوس نہیں کرتا۔ اور سہل نے اس میں سے بعض پر تنبیہ کی ہے، لیکن اس میں وہ امر پورا نہیں ہوا جو اس پر ہے۔ پس میں نہیں جانتا کہ آیا اسے علم تھا اور اس نے جو ذکر کیا اس پر اکتفا کیا، یا اللہ نے اسے اس وقت اس سے زیادہ پر مطلع نہیں کیا۔ واللہ اعلم۔ پس اللہ نے اسے دایاں ہاتھ اختیار کیا۔\n\n### [انسان میں سے قلب کا اختیار]\n\nاور جہاں تک انسان میں سے قلب (القلب) کے اختیار کا تعلق ہے، تو یہ وہ ہے جسے اس نے گھیر رکھا ہے، کیونکہ وہ ہر روز ایک نئی شان میں ہوتا ہے، اور \"یوم\" (دن) زمانے کے فرد میں سانس لینے والے کی سانس کی مقدار ہے۔ اور اسے قلب (قلب) اسی لیے کہا جاتا ہے کہ یہ پلٹتا رہتا ہے۔ کیا آپ نہیں دیکھتے کہ یہ رحمن کی دو انگلیوں کے درمیان ہے؟ پس اسے صرف رحمن ہی پلٹتا ہے، کسی دوسرے اسم کو اس میں دخل نہیں ہے۔ اور اسم رحمن صرف وہی عطا کرتا ہے جو اس کی حقیقت میں ہے، پس اس کی رحمت وَسِعَتْ كُلَّ شَيْ‏ءٍ (ہر چیز کو گھیر چکی ہے)۔ پس کوئی بھی امر جو آپ اس کے پلٹنے میں دیکھتے ہیں جو مشقت، عذاب اور بدبختی کی طرف لے جاتا ہے، اس میں ایک پوشیدہ رحمت ہوتی ہے، کیونکہ اسے رحمن کی انگلیوں سے پلٹا جاتا ہے۔ پس اگر وہ چاہے تو اسے قائم کر دے، اور اگر چاہے تو اسے اس قیام سے ہٹا دے۔ پس یہ ایک اضافی میلان ہے۔ پس قلب رحمت کی طرف مائل ہوا، اس اسم کے غلبے کے حکم سے جس نے اسے کجی میں پلٹا، جیسا کہ اسے قیام میں پلٹا۔ پس یہ اللہ کی طرف سے اپنے بندوں کے لیے ایک خوشخبری ہے: ف يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ (اے میرے بندو جنہوں نے اپنی جانوں پر زیادتی کی)۔ اور اس نے اسراف میں سے کسی اسراف کا ذکر نہیں کیا، پس اس نے اسراف کرنے والوں کے اسراف کی تمام حالتوں کو عام کر دیا: لا تَقْنَطُوا من رَحْمَةِ الله (اللہ کی رحمت سے مایوس نہ ہو)۔ کیونکہ جس نے تمہیں کجی میں ڈالا وہ رحمن کی انگلی ہے، إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً (بے شک اللہ تمام گناہوں کو بخش دیتا ہے)۔ اور یہ ایک خبر ہے جس میں نسخ داخل نہیں ہوتا۔ پس وہ اس قول کو اپنے اس قول کے ساتھ جمع کرتا ہے: إِنَّ الله لا يَغْفِرُ أَنْ يُشْرَكَ به (بے شک اللہ اس بات کو نہیں بخشتا کہ اس کے ساتھ شرک کیا جائے)۔ پس وہ شرک پر مواخذہ کرے گا جو اللہ چاہے، پھر اس پر رحمن کی انگلی کا حکم چلے گا، پس وہ رحمن کی طرف لوٹے گا۔ اور شرک سے کم کجی کے دیگر امور میں سے وہ بخش دیتا ہے جو سزا کے بعد بخشتا ہے، اور وہ کبیرہ گناہوں والے ہیں جو شفاعت کے بعد آگ سے نکلیں گے، جب وہ کوئلہ بن چکے ہوں گے، باوجود اس کے کہ وہ مشرک نہیں تھے، اور اس پر ایمان لانا واجب ہے۔ اور ان میں سے وہ بھی ہیں جنہیں بغیر سزا کے ابتداء میں ہی بخش دیا جاتا ہے۔ پس انجام کار رحمت کی طرف ہونا لازمی ہے۔\n\n### [اکوان میں سے اجتماع کا اختیار]\n\nاور جہاں تک اکوان (کائنات) میں سے اجتماع کے اختیار کا تعلق ہے، تو یہ جمع (اجتماع) کے عین میں تمیز کے ذریعے افتراق (جدائی) عطا کرتا ہے۔ پس رب اور مربوب (پرورش پانے والا) کا ہونا لازمی ہے، اور قادر اور مقدور (جس پر قدرت کی گئی) کا ہونا لازمی ہے۔ پس اجتماع منتخب ہے، جو الٰہی اسماء کی حقیقتوں کے تعلق کے تقاضے کی وجہ سے لازمی ہے۔\n\n### [رنگوں میں سے سفیدی کا اختیار]\n\nاور جہاں تک رنگوں میں سے سفیدی (البیاض) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ تمام رنگین چیزیں اسی کی طرف تبدیل ہو جاتی ہیں، اور وہ ان کی طرف تبدیل نہیں ہوتی، بلکہ اس کی سفیدی اس میں پوشیدہ ہے، جو اس رنگ کے حجاب سے چھپی ہوئی ہے جو آنکھ میں سیاہی، سرخی، زردی اور دیگر رنگوں کی صورت میں ظاہر ہوتا ہے۔ پس ان میں سے کچھ ایسے ہیں جو محل کے ساتھ قائم رنگ ہوتے ہیں، اور کچھ ایسے ہیں جو دیکھنے والی آنکھ میں رنگ ہوتے ہیں، اور متلون (رنگین چیز) کی ذات میں ایسا نہیں ہوتا، جیسے دور سے سفید پہاڑوں کی سیاہی۔ پس جب آپ ان کے پاس جائیں گے تو انہیں سفید دیکھیں گے، حالانکہ آپ ان پر سیاہی کا حکم لگا رہے تھے، اور آپ اس حکم میں غلطی پر ہیں، اور سیاہی کے ظاہر ہونے میں صحیح اور درست ہیں۔ اور اس کی کیفیت مجہول ہے۔ اور اسی طرح آسمان کی نیلاہٹ صرف آنکھ کے دیکھنے کی وجہ سے ہے، اگرچہ وہ اپنی ذات میں نیلے رنگ سے مختلف رنگ پر ہے۔\n\n### [فرشتوں میں سے روح کا اختیار]\n\nاور جہاں تک فرشتوں میں سے روح (الروح) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ یہ ہر ملکی، فلکی، عنصری، مادی اور طبعی صورت میں پھونکی جانے والی چیز ہے۔ اور اسی سے اشیاء کی زندگی ہے، اور یہی وہ روح ہے جو اس کی طرف منسوب ہے، اور یہی نفس رحمن ہے جس سے زندگی ہوتی ہے، اور زندگی نعمت ہے، اور نعمت سے لذت حاصل کی جاتی ہے، اور لذت مزاج کے مطابق ہوتی ہے، جیسا کہ ہم نے کہا کہ سرد مزاج والا اس چیز سے لذت حاصل کرتا ہے جس سے گرم مزاج والا عذاب پاتا ہے۔ پس سمجھو۔ اور شارع کا تنبیہ کرنا ہی تمہارے لیے کافی ہے، اگر تم سمجھتے ہو، کہ آگ کے لیے اہل ہیں جو اس کے اہل ہیں، اور جنت کے لیے اہل ہیں جو اس کے اہل ہیں۔ اور اہل نار کے بارے میں ذکر کیا کہ وہ اس میں نہ مریں گے اور نہ زندہ رہیں گے، پس وہ آگ کے ذریعے نعمت طلب کرتے ہیں، ٹھنڈک کے وجود کی وجہ سے۔ اور یہ مزاج کے حکم میں سے ہے۔\n\n### [سواریوں میں سے براق کا اختیار]\n\nاور جہاں تک سواریوں میں سے براق (البراق) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ یہ معراج کی سواری ہے، پس اس نے چار پاؤں والوں اور پروں والوں کو جمع کیا، پس یہ علوی (آسمانی) اور سفلی (زمینی) ہے، جیسے بعض حیوانات خشکی اور سمندر کے ہوتے ہیں۔\n\n### [یوم عرفہ کی دعا کا اختیار]\n\nاور جہاں تک یوم عرفہ کی دعا کے اختیار کا تعلق ہے، تو یہ تجرید (دنیا سے کٹ جانے)، ذلت اور عاجزی کی حالت میں ایک زمانی دن کی معرفت (المعرفۃ) کے مقام پر دعا ہے، کیونکہ اس میں رات اور دن کا اجتماع ہے۔\n\n### [قل ہو اللہ احد کا اختیار]\n\nاور جہاں تک قُلْ هُوَ الله أَحَدٌ کے اختیار کا تعلق ہے، تو یہ اس کے ساتھ مخصوص ہے، اس میں اکوان (کائنات) میں سے کسی کون کا ذکر نہیں ہے، سوائے ہر ایک کی احدیت (احدیۃ) کے، جو اس کی احدیت (الأحدیۃ) تعالیٰ سے مشابہت نہیں رکھتی۔ اور اس سورت میں اس کا آنا اس شخص کے لیے ایک عجیب علم ہے جس پر اللہ نے اسے کھولا ہے۔ کیونکہ اس نے سورت کا آغاز اپنی احدیت سے کیا اور اس کا اختتام مخلوقات کی احدیت پر کیا۔ پس جان لو کہ کائنات اس کے ساتھ آخر کا اول کے ساتھ تعلق کی طرح مربوط ہیں، نہ کہ اول کا آخر کے ساتھ تعلق۔ کیونکہ آخر اول کو طلب کرتا ہے، اور اول آخر کو طلب نہیں کرتا۔ پس وہ اپنی ذات سے عالمین سے بے نیاز ہے، اور آخر کو اسم اللہ سے طلب کرتا ہے جو احدیت (الأحدیۃ) سے موصوف ہے۔ پس میں نے تمہیں اس علم کے ماخذ پر متنبہ کیا ہے جو یہ سورت اپنے اندر رکھتی ہے، اس متاخر احدیت کے ذریعے جو اول کے ساتھ مربوط ہونے کے باوجود اس کی مماثلت نہیں رکھتی، کیونکہ وہ اسے طلب کرتی ہے اور وہ اسے طلب نہیں کرتا: أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ (تم سب اللہ کے محتاج ہو، اور اللہ ہی بے نیاز، قابل تعریف ہے)۔\n\n### [آیۃ الکرسی کا اختیار]\n\nاور جہاں تک آیات میں سے آیۃ الکرسی (آیۃ الکرسی) کے اختیار کا تعلق ہے، تو آیات نشانیاں ہیں، اور کوئی چیز اپنی ذات سے زیادہ کسی چیز کی دلیل نہیں ہوتی۔ اور یہ آیۃ الکرسی پوری کی پوری اس کے اسماء یا اس کی صفات ہیں، یہ کسی دوسری آیت میں نہیں پائی جاتی۔ پس اس نے اپنی ذات سے اپنی ذات پر دلالت کی: الله لا إِلهَ إِلَّا هُوَ (اللہ، اس کے سوا کوئی معبود نہیں)۔ پس اس نے نفی کی اور ایک حاضر اسم پر غائب ضمیر کے ساتھ اثبات کیا جس کا مسمیٰ غیب ہے۔ الْحَيُّ (زندہ) ایک شرطیہ صفت ہے اس کے اسماء کے وجود میں۔ الْقَيُّومُ (قائم رکھنے والا) ہر اس چیز پر جو اس کے سوا ہے، اس کے کسب کے ساتھ، کیونکہ اس نے أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ (ہر چیز کو اس کی تخلیق عطا کی)۔ لا تَأْخُذُهُ سِنَةٌ ولا نَوْمٌ (اسے نہ اونگھ آتی ہے اور نہ نیند)۔ یہ تنزیہ کی صفت ہے اس چیز سے جو عالم کی حفاظت کے منافی ہو، جو اگر اس کی قیومیت نہ ہوتی تو ایک لمحہ بھی باقی نہ رہتا۔ الله (اللہ) ضمیر اسی کی طرف لوٹتی ہے، اور یہ غیب کی ضمیر ہے۔ ما فِي السَّماواتِ وما فِي الْأَرْضِ (جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے)۔ یہ اس کی ملکیت اور بندہ ہے جو الوہیت کے حکم کے بقا کے لیے حفاظت میں معین ہے۔ مَنْ ذَا الَّذِي يَشْفَعُ (کون ہے جو شفاعت کرے)۔ یہ وتر کی شفاعت ہے حکم کے ساتھ: عِنْدَهُ (اس کے پاس) غیب کی ضمیر ہے۔ إِلَّا بِإِذْنِهِ (مگر اس کی اجازت سے)۔ اس کے بغیر حکم میں استقلال کا نہ ہونا، پس اس کی اجازت ضروری ہے، جب وہاں کوئی شفاعت کرنے والا یا شفاعت کرنے والے ہوں۔ يَعْلَمُ ما فِي السَّماواتِ وما فِي الْأَرْضِ (وہ جانتا ہے جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے)۔ شفاعت کرنے والوں اور جن کی شفاعت کی جائے گی، ان سب کو۔ يَعْلَمُ ما بَيْنَ أَيْدِيهِمْ (وہ جانتا ہے جو ان کے سامنے ہے) اور وہ وہ ہے جس میں وہ ہیں، وما خَلْفَهُمْ (اور جو ان کے پیچھے ہے) اور وہ وہ ہے جس کی طرف وہ لوٹیں گے۔ ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ (اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کر سکتے) اشیاء کے بارے میں، إِلَّا بِما شاءَ (مگر جتنا وہ چاہے) ان میں سے، نہ کہ سب کا۔ وَسِعَ كُرْسِيُّهُ (اس کی کرسی گھیر چکی ہے) اس کا علم السَّماواتِ والْأَرْضَ (آسمانوں اور زمین کو) بلندی اور پستی کو۔ ولا يَؤُدُهُ (اور اسے تھکاتی نہیں) يثقله (اسے بوجھل نہیں کرتی) حِفْظُهُما (ان دونوں کی حفاظت) کیونکہ یہ ذاتی معنوی حفاظت ہے اور غیبی مدد ہے اور بلندی اور پستی میں دائمی تخلیق ہے۔ وهُوَ (اور وہ) غیب کی ضمیر ہے۔ الْعَلِيُّ (بلند) اپنی ذات سے اپنی مخلوق سے بے نیازی کی وجہ سے۔ الْعَظِيمُ (عظیم) عارفین کے دلوں میں اپنے جلال کی وجہ سے۔ پس ان دلوں میں اس کی ہیبت ہے۔ پس یہ ایک ایسی آیت ہے جس میں اسم ظاہر اور مضمر کے درمیان سولہ مقامات پر اللہ کا ذکر کیا گیا ہے، جو آپ کو کسی دوسری آیت میں نہیں ملے گا۔ ان میں سے پانچ اسماء ظاہر ہیں: اللہ، الحی، القیوم، العلی، العظیم۔ اور ان میں سے نو ضمیریں ہیں جن کا ظاہر موجود ہے، پس وہ ظاہر میں مضمر ہیں۔ اور ان میں سے دو باطن میں مضمر ہیں جن کا ظاہر میں کوئی عین نہیں ہے، اور وہ علم اور مشیئت کی ضمیریں ہیں۔ اور اسی طرح اس کا علم اور اس کی مشیئت، اسے صرف وہی جانتا ہے۔ پس کوئی بھی اس کے علم میں کیا ہے اور اس کی مشیئت میں کیا ہے، اسے نہیں جانتا مگر معلوم کے ظاہر ہونے کے بعد، مراد کے واقع ہونے سے، اور بس۔ اسی لیے ان میں ضمیر ظاہر نہیں ہوئی۔\n\n### [قرآن میں سے یٰس کا اختیار]\n\nاور جہاں تک قرآن میں سے یٰس (یس) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ یہ قرآن کا قلب (دل) ہے، اور جس نے اسے پڑھا وہ ایسا ہے جیسے اس نے قرآن کو دس بار پڑھا۔ اور قلب صاد کی صورت میں سب سے زیادہ شرف والا ہے، اسی طرح سورت سینیہ (یٰس) بھی ہے، اور یہ نازل شدہ ہے۔ اور اس کے لیے بروج میں سے شرف الشمس کا گھر ہے، اور وہ برج اولیت ہے، یعنی موسم بہار، نشوونما کا آغاز، ابتداء کا ظہور، اور عالم طبیعت کی زینت کا آغاز، اور ان سانسوں کے بخارات کو لطیف کرنا جنہیں موسم سرما نے ماحول کی ٹھنڈک کی وجہ سے گاڑھا کر دیا تھا۔ وہ سانس لینے والوں سے نکلنے والے بخارات کو گاڑھا کر دیتا تھا، پھر انہیں واپس کر دیتا تھا، اور یہی وہ نمی ہے جو آپ سردیوں کے زمانے میں اپنے ہاتھوں میں پاتے ہیں جب آپ ان میں سانس لیتے ہیں۔ اور اس کے لیے الٰہی شؤون ہیں جن میں وہ ہر سانس میں رہتا ہے، جل جلالہ۔\n\n### [الٰہی کلام میں سے قرآن کا اختیار]\n\nاور جہاں تک الٰہی کلام میں سے قرآن (القرآن) کے اختیار کا تعلق ہے، تو یہ وہ ہے جسے جمع (اجتماع) کی صفت حاصل ہے، اور جمع میں عین فرقان (الفرقان) ہے۔ کیونکہ جمع کثرت کی دلیل ہے، اور کثرت آحاد (اکائیوں) ہے، پس یہ عین جمع میں عین افتراق ہے۔ پس یہ فرقان (الفرقان) قرآن ہے۔\n\n### [اذکار میں سے لا الہ الا اللہ کا اختیار]\n\nاور جہاں تک لَا إِلَهَ إِلَّا الله کے اختیار کا تعلق ہے، تو یہ وہ ذکر ہے جو نفی اور اثبات دونوں کو عام کرتا ہے، اور یہ بات کسی دوسرے ذکر کو حاصل نہیں ہے۔\n\n### [احوال میں سے رضا کا اختیار]\n\nاور جہاں تک احوال میں سے رضا (الرضی) کے اختیار کا تعلق ہے، تو یہ اہل سعادت کے لیے ذات حق (الحق) کی طرف سے آخری خوشخبری ہے، اس کے بعد کوئی خوشخبری نہیں ہے۔ کیونکہ یہ ایسی خوشخبری ہے جو ابد تک ساتھ رہتی ہے، جیسا کہ حدیث میں آیا ہے۔ اور یہ لوگوں کے رؤیت (دیدار) سے واپس آنے کے بعد کی خوشخبری نہیں، بلکہ یہ اللہ کی طرف سے ان کے لیے رؤیت کے وقت عظیم زیارت (الزور الأعظم) کے مقام پر ٹیلے پر ہے۔\n\n### [جنت کا اختیار]\n\nاور جہاں تک جنت (الجنۃ) کے اختیار کا تعلق ہے، تو یہ سعادت اور دیدار کا بقا کا گھر ہے، جو اس کے رہنے والوں کو ہر اس ناپسندیدہ چیز سے ڈھانپ لیتا ہے جو اس کے مقابل گھر میں ہوتی ہے، اور جو اسماء انتقام (انتقام کے اسماء) کا غلبہ عطا کرتا ہے۔\n\n### [رؤیت کا اختیار]\n\nاور جہاں تک رؤیت (الرؤیۃ) کے اختیار کا تعلق ہے، تو یہ بصارت کی انتہا ہے۔ پس بصری لذت کی کوئی لذت مشابہت نہیں رکھتی، کیونکہ یہ معبود میں عین الیقین ہے۔\n\n### [اعداد میں سے ننانوے کا اختیار]\n\nاور جہاں تک اعداد میں سے ننانوے (التسعة والتسعین) کے اختیار کا تعلق ہے، تو یہ اسماء کا وتر (طاق عدد) ہے جو آحاد (اکائیوں) اور عقد (دہائیوں) کو جمع کرتا ہے۔ \"بے شک اللہ کے ننانوے نام ہیں، سوائے ایک کے۔ جس نے انہیں احصاء کیا وہ جنت میں داخل ہو گیا۔\" صرف احصاء (شمار) کرنے سے، خواہ وہ حفظ، لفظ یا احاطہ (گھیرنے) کے لحاظ سے ہو۔ کیونکہ اللہ وتر ہے اور وتر کو پسند کرتا ہے۔\n\n### [فرائض کا اختیار]\n\nاور جہاں تک فرائض (الفرائض) کے اختیار کا تعلق ہے، تو ان کا نتیجہ یہ ہے کہ بندہ ذات حق (الحق) کی صفت بن جائے، اس کی سماعت اور بصارت۔ کیونکہ نوافل (النوافل) کی محبت یہ عطا کرتی ہے کہ ذات حق بندے کی سماعت اور بصارت بن جائے، اور نفل فرض سے نچلے درجے میں ہی ہوتا ہے۔ پس فرض کو اولیت حاصل ہے، اور ذات حق اس بات پر نہیں اترتی کہ وہ بندے کی سماعت بن جائے، جیسا کہ وہ جلال کے تقاضے سے فرماتا ہے۔ پس اللہ کا اپنی صفت کے ساتھ نازل ہونا ضروری ہے، اور وہ یہ ہے کہ بندہ اس صورت کے لیے ذات حق کی صفت بن جائے جس پر اسے پیدا کیا گیا، پس یہ الٰہی صورت سے کاٹا گیا ہے، جیسا کہ رحم رحمن سے ایک شاخ ہے۔ اور فرض قطع (کاٹنا) ہے۔ پس جب بندہ اسے ادا کرتا ہے، تو اس میں اس پر یہ ظاہر ہوتا ہے کہ وہ ذات حق کی صفت ہے، اور جب وہ نفل ادا کرتا ہے، تو ذات حق اس کی صفت ہوتی ہے۔ پس فرض نفل سے ممتاز ہو گیا، اور اعلیٰ درجہ فرض کو حاصل ہوا، اور اگر فرض یہ عطا نہ کرتا:\n\n\"یہ ثابت نہ ہوتا کہ وہ فرمائے: میں بھوکا تھا تو تم نے مجھے کھانا نہیں کھلایا\"۔\n\n\"اور میں اپنے بندے کی ملاقات کا سب سے زیادہ مشتاق ہوں جو مجھے چاہتا ہے\"۔\n\n\"بے شک وہ شہ رگ سے بھی زیادہ ہمارے قریب ہے\"۔\n\n\"اور میں نے کسی ایسے کام میں تردد نہیں کیا جسے میں کرنے والا ہوں\"۔\n\nاور اس طرح کی دیگر الٰہی خبریں۔\n\n### [تمام راتوں میں سے شب قدر کا اختیار]\n\nاور جہاں تک شب قدر (لیلۃ القدر) کے اختیار کا تعلق ہے، تو امور ذات حق (الحق) کے نزدیک ان کی مقداروں کے ذریعے ہی ممتاز ہوتے ہیں، اور ذات حق غیب ہے۔ پس اس نے قدر کو رات کے ساتھ خاص کیا، کیونکہ رات پردہ ہے، جیسا کہ غیب پردہ ہے۔\n\n### [دنوں میں سے جمعہ کے دن کا اختیار]\n\nاور جہاں تک دنوں میں سے جمعہ کے دن کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ اس میں دونوں صورتیں ظاہر ہوئیں، اور اللہ نے اس دن کو صورتوں کے لیے بنایا، اور یہ نطفے کے گرنے کا پانچواں مہینہ ہے۔ اور یہ ایک مؤنث دن ہے جسے زینت اور خلق کی تکمیل حاصل ہے۔ اور اللہ نے اس میں ایک ایسی گھڑی کو اختیار کیا جو آئینے میں ایک نقطے کی طرح ہے، اور یہ دن کے آئینے میں ظہور الٰہی (المتجلی) کی صورت کا مقام ہے، پس وہ اس میں اپنی ذات کو دیکھتا ہے۔ اور آئینے اور دیکھنے والے کے درمیان ظاہر ہونے والی صورت پر ہی خطاب اور تکلیف واقع ہوتی ہے، اور اسی سے اسماء اشارات (اشارہ کرنے والے اسماء) جیسے ذا، ذان، تا، تان، أولاء، اور اسماء ضمائر (ضمیریں) جیسے ہو، ہی، ہما، ہم، ہن، ک، کما، کم، کن، أنت، أنت، أنتما، أنتم، أنتن، اور متکلم کی ضمیر \"یاء\" جو اس کی انیت (میں ہونے) میں مؤثر ہوتی ہے اگر نون وقایہ (نون الوقایۃ) اس کی حفاظت نہ کرے۔ اور اس کے لیے لازمی ہے کہ وہ یا تو انیت میں یا نون وقایہ میں اثر کرے، یہ اس کے لیے ضروری ہے۔ اور اسی لیے نون وقایہ کو حروف کے عالم میں فتوّت (جوانمردی) اور ایثار حاصل ہے۔ اور اسی لیے اسے نون وقایہ کہا گیا، پس اسے \"أعوذ بک\" (میں تیری پناہ مانگتا ہوں) میں \"کاف\" کی طرح ایک منزلت حاصل ہے، اور ہمارے لیے اس میں یہ ہے:\n\n> نون الوقاية نون ليس يشبهها *** من الوجود سوى صوم وخلاق‏\n> له الفتوة والإيثار نشأته *** فما لنا غيره في اللفظ من واق‏\n> شطر الوجود له من نعت خالقه *** من المكانة فهو الدائم الباقي‏\n\nترجمہ: نون وقایہ ایک ایسا نون ہے جس کی مشابہت *** ہستی (الوجود) میں روزے اور اخلاق کے سوا کوئی نہیں\nفتوّت اور ایثار اس کی نشوونما ہے *** پس لفظ میں ہمارے لیے اس کے سوا کوئی محافظ نہیں\nہستی (الوجود) کا ایک حصہ اس کے خالق کی صفت سے اس کے لیے ہے *** مقام کے لحاظ سے، پس وہ دائمی اور باقی رہنے والا ہے\n\n### [تین زمانوں کا ترتیب سے اختیار]\n\nاور جہاں تک تین زمانوں (القرون) کو ترتیب سے اختیار کرنے کا تعلق ہے، تو ان میں سے پہلا محمد صلی اللہ علیہ وسلم کے کمال کا غیب اور شہود میں ظاہر ہونا ہے، پس انہوں نے خود شریعت کو جاری کیا اور اپنے وجود سے اپنے نائبین کی سنت کو منسوخ کیا، اور جو کچھ اس میں سے مقرر کیا اسے برقرار رکھا، اور اس کے تمام حصے پر ایمان کو برقرار رکھا، خواہ وہ منسوخ ہوا ہو یا نہ ہوا ہو۔ اور یہ پہلا زمانہ ہے۔ پھر اس کے بعد دو اور، اور وہ سب فتح اور ظہور کے اہل ہیں، ہر مہینے کی تین روشن راتوں کے مقام پر۔ آپ صلی اللہ علیہ وسلم فرماتے ہیں: \"ایک گروہ جہاد کرے گا، تو کہا جائے گا: کیا تم میں کوئی ایسا ہے جس نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ہو؟ تو وہ کہیں گے: ہاں۔ پس ان کے لیے فتح ہو جائے گی۔\" اور یہ پہلا زمانہ ہے۔ \"پھر ایک گروہ جہاد کرے گا، تو کہا جائے گا: کیا تم میں کوئی ایسا ہے جس نے اسے دیکھا ہو جس نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ہو؟ تو وہ کہیں گے: ہاں۔ پس ان کے لیے فتح ہو جائے گی۔\" اور یہ دوسرا زمانہ ہے۔ \"پھر ایک گروہ جہاد کرے گا، تو کہا جائے گا: کیا تم میں کوئی ایسا ہے جس نے اسے دیکھا ہو جس نے اسے دیکھا ہو جس نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ہو؟ تو وہ کہیں گے: ہاں۔ پس ان کے لیے فتح ہو جائے گی۔\" اور آپ صلی اللہ علیہ وسلم نے اس سے زیادہ اضافہ نہیں کیا۔ اور یہ اس لیے ہے کہ وہاں صرف حضرۃ الٰہیہ (الحضرۃ الإلہیۃ) ہے، اور وہ ذات، صفات اور افعال کا اظہار ہے۔ پس یہ \"بہترین زمانے\" کا معنی ہے۔ پس پہلے زمانے کی عنایت سے سب کے لیے فتح ہوئی، اور وہ رسول اللہ صلی اللہ علیہ وسلم کی ذات ہے، پس ان کے نور کی قوت اور ان کے ظہور کے غلبے نے اس شخص کے لیے الٰہی فتح عطا کی جس نے انہیں دیکھا، یا جس نے انہیں دیکھا جس نے انہیں دیکھا، یا جس نے انہیں دیکھا جس نے انہیں دیکھا جس نے انہیں دیکھا۔ پس یہ ان کا قول ہے: \"بہترین زمانے میرا زمانہ ہے، پھر وہ جو ان کے بعد ہیں، پھر وہ جو ان کے بعد ہیں۔\"\n\nاور ہم نے انہیں مہینے کی تین روشن راتوں سے تشبیہ دی اور ان کی دعوت کے زمانے کو مہینے سے تشبیہ دی، کیونکہ وہ زمانے کی مقدار میں اختلاف کرتے ہیں کہ وہ کتنا ہے۔ پس ان کے اقوال میں سے ایک یہ ہے کہ زمانہ تیس سال کا ہوتا ہے۔ اسی لیے ہم نے تین زمانوں کو ان کی دعوت کے زمانے سے لے کر قیامت کے دن تک مہینے کے مقام پر اتارا، اور تین زمانوں کو اس کی تین روشن راتوں کی طرح قرار دیا۔\n\n### [عبادات میں سے روزے کا اختیار]\n\nاور جہاں تک روزے (الصوم) کے اختیار کا تعلق ہے:\n\nنبی صلی اللہ علیہ وسلم نے ایک شخص سے فرمایا جس نے ان سے سوال کیا: \"تم پر روزہ لازم ہے، کیونکہ اس کی کوئی مثال نہیں ہے۔\"\n\nپس انہوں نے روزے سے مثلیت کی نفی کی، پس یہ لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں) سے مشابہت رکھتا ہے۔ اور فرمایا: \"روزہ میرے لیے ہے۔\"\n\nاور تمام عبادات کو انسان کے لیے قرار دیا، کیونکہ روزہ تنزیہ (پاکیزگی) کی صفت ہے، اور تنزیہ صرف اسی تعالیٰ کے لیے مناسب ہے۔\n\n### [مہینوں میں سے رمضان کا اختیار]\n\nاور جہاں تک مہینوں میں سے رمضان کے مہینے کا اختیار کا تعلق ہے، تو یہ اسم میں اس کی شرکت کی وجہ سے ہے، کیونکہ رمضان اسماء الٰہیہ (الأسماء الإلہیۃ) میں سے ہے۔ پس اس کے لیے وہ حرمت متعین ہوئی جو سال کے باقی مہینوں کے لیے نہیں ہے۔ اور اسے قمری مہینوں میں سے بنایا تاکہ اس کی برکت سال کے تمام مہینوں کو عام ہو، پس سال کے ہر مہینے میں اس کا ظہور ہو، اور سال کے ہر دن کو اس میں سے حصہ ملے۔ کیونکہ ہمارے نزدیک سب سے افضل مہینہ رمضان ہے، پھر ربیع الاول، پھر رجب، پھر شعبان، پھر ذوالحجہ، پھر شوال، پھر ذوالقعدہ، پھر محرم۔ اور یہاں تک قمری مہینوں کی فضیلت کے بارے میں میرا علم ختم ہو جاتا ہے۔ اور سال کے باقی قمری مہینوں کی فضیلت کی ترتیب مجھ پر مبہم کر دی گئی ہے، اور وہ صفر، ربیع الآخر، جمادی الاولیٰ اور جمادی الآخرہ ہیں۔ میرے پاس ان کی فضیلت کی ترتیب کا علم نہیں ہے، یا وہ فضیلت میں برابر ہیں، اور یہی میرا غالب گمان ہے، کیونکہ اس نے اسے ظاہر کیا، اور میں نے اس کی تحقیق نہیں کی، لہٰذا میرے لیے یہ کہنا ممکن نہیں جو میرے علم میں نہیں ہے۔\n\n### [ارکان میں سے پانی کا اختیار]\n\nاور جہاں تک ارکان میں سے پانی (الماء) کے رکن کا اختیار ہے، تو یہ اس لیے ہے کہ پانی سے ہر زندہ چیز کو بنایا گیا، یہاں تک کہ عرش بھی جب اسے پیدا کیا گیا تو وہ پانی سے اوپر نہیں تھا، پس زندگی اس میں اسی سے سرایت کر گئی۔ پس یہ سب سے بڑا رکن ہے، جیسا کہ فرمایا: \"حج عرفہ ہے۔\" اگرچہ زندگی کا سبب بننے والی چیزیں اس کے ساتھ ہیں، لیکن یہ ان چیزوں میں سب سے بڑا رکن ہے۔\n\n### [افلاک میں سے عرش کا اختیار]\n\nاور جہاں تک افلاک میں سے عرش (العرش) کے اختیار کا تعلق ہے، تو یہ اس لیے ہے کہ اسے تمام اجسام پر احاطہ حاصل ہے، اور اللہ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ (ہر چیز کو گھیرے ہوئے ہے)۔ اور اسے افلاک میں اولیت حاصل ہے، پس جو کچھ اس کے نیچے ہے، وہ اول اور محیط ہے۔ پس اس نے اسے استواء (قائم ہونے) کے لیے اختیار کیا، ان دونوں صفتوں کے درمیان تعلق کی وجہ سے۔ اور اگر عرش ملک (بادشاہت) ہے، تو یہ بغیر اختیار کے زیادہ حقدار ہے، کیونکہ وہاں اللہ اور اس کی ملکیت کے سوا کچھ نہیں ہے، اور اس کے سوا ہر چیز اس کی ملکیت ہے۔ اور اس کا دوسروں سے امتیاز وارد ہوا ہے، پس اولیت اور احاطہ کی وجہ سے اس کا منتخب ہونا متعین ہوا، کیونکہ آسمان اور زمین کرسی کے اندر ایک چٹیل میدان میں ایک حلقے کی طرح ہیں، اور کرسی عرش کے اندر ایک چٹیل میدان میں ایک حلقے کی طرح ہے۔\n\n### [بندوں میں سے فرشتوں کا اختیار]\n\nاور بندوں میں سے فرشتوں (الملائکۃ) کو اختیار کیا، کیونکہ وہ نور سے پیدا کیے گئے ہیں، پس ان کے اجسام اصالتاً نوری ہیں، پس وہ دیگر مخلوقات کے مقابلے میں نور الٰہی (النور الإلہی) سے زیادہ قریب نسبت رکھتے ہیں۔ اور اسی لیے:\n\nرسول اللہ صلی اللہ علیہ وسلم دعا کرتے تھے کہ اللہ انہیں نور بنا دے۔\n\nاس لیے کہ وہ طبیعت کی تاریکی کو جانتے تھے۔\n\n### [اینیات میں سے عماء کا اختیار]\n\nاور اینیات (کہاں ہونے کی حالتیں) میں سے عماء (العماء) کو اختیار کیا، پس وہ خلق کی تخلیق سے پہلے اس کے لیے تھا، اور اسی سے ملائکہ مہیمہ (حیران فرشتے) کو پیدا کیا گیا، پس اس نے انہیں اپنے جلال میں حیران کر دیا، پھر مخلوق کو پیدا کیا، پس ان کی اپنے جمال کے جلال میں حیرانی نے انہیں اس کے سوا کسی اور کو دیکھنے سے مشغول کر دیا۔ یہ وہ ہیں جو نہیں جانتے کہ اللہ نے کسی کو پیدا کیا ہے۔ کیا ہی شرف والا حال ہے! پس اس نے عماء کو اپنے لیے اینیت (کہاں ہونے کی حالت) بنایا، اور عرش اس کے لیے مستوی ہے، اور آسمان دنیا اس کے نزول کے لیے ہے، اور زمین اس کی معیت (ساتھ ہونے) کے لیے ہے، پس وہ ہمارے ساتھ ہے جہاں کہیں بھی ہم ہوں۔\n\n### [لوگوں میں سے رسولوں کا اختیار]\n\nاور لوگوں میں سے رسولوں (الرسل) کو اختیار کیا تاکہ وہ اللہ کی طرف سے اس امر کو پہنچائیں جس پر وہ ہے۔ کیونکہ اس نے انہیں صرف اپنے علم کے لیے ظاہر کیا، کیونکہ اس نے چاہا کہ وہ پہچانا جائے، پس اس نے رسولوں کے ذریعے ان سے تعارف کرایا، ان کتابوں اور صحیفوں کے ذریعے جو اس نے ان پر نازل کیں۔ پس انہوں نے اسے ذاتی معرفت (معرفۃ ذاتیۃ) سے پہچانا، جیسا کہ انہوں نے اسے ان عقلوں کے ذریعے پہچانا جو اس نے ان کے لیے پیدا کیں اور انہیں فکری نظر کی قوت عطا کی، پس انہوں نے اسے دلائل اور براہین کے ذریعے وجودی سلبی معرفت (معرفۃ وجودیۃ سلبیۃ) سے پہچانا۔ عقل کی اپنی استقلال میں اس سے زیادہ قوت نہیں تھی۔ پھر اس کے بعد رسول اس کے بعد ذاتی معرفت کے ساتھ آئے، پس مخلوق نے اس معبود کی عبادت کی جس نے ان سے اپنی شریعت کے ذریعے تعارف کرایا، کیونکہ عقل نہ تو کوئی عمل عطا کرتی ہے، نہ کوئی قربت، اور نہ ہی ذات حق (الحق) کے لیے کوئی ذاتی ثبوتی صفت۔ اور شریعت سے عقل کا حصہ، جس کی دلیل میں وہ خود مختار ہے، صرف لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں) ہے، کاف کے اضافے کے ساتھ، نہ کہ اس کے صفت کے طور پر اثبات کے ساتھ۔ پس اس نے رسولوں کو اختیار کیا تاکہ وہ اس علم کو پہنچائیں جسے عقل اپنی ذات کے بارے میں اور ان اعمال، تروک اور نسبتوں کے بارے میں ادراک کرنے میں خود مختار نہیں ہے جو اس کے قریب کرتے ہیں۔\n\n### [اسماء حسنیٰ میں سے اسم اللہ کا اختیار]\n\nاور اسماء حسنیٰ میں سے اسم اللہ (الاسم اللہ) کو اختیار کیا، پس اسے کلمات میں اس کے مقام پر قائم کیا۔ پس یہ وہ اسم ہے جس کی صفت بیان کی جاتی ہے لیکن اس سے صفت بیان نہیں کی جاتی۔ پس تمام اسماء اس کی صفت ہیں، اور وہ صفت نہیں بنتا۔ اور اسی لیے اس میں اشتقاق (ماخذ) میں تکلف کیا جاتا ہے۔ پس یہ ایک جامد اسم ہے، جو کلمات اور حروف کے عالم میں ذات کے لیے وضع کیا گیا علم ہے۔ اس کے سوا کسی اور نے اس سے نام نہیں رکھا، جل و علا۔ پس اس نے اسے اشتراک سے محفوظ رکھا، جیسا کہ اس نے دلالت کی کہ اس کے سوا کوئی معبود نہیں ہے۔\n\n### [الٰہی اختیارات عقلوں کو اختیار کی دعوت ہیں جو عبرت اور بصیرت ہے]\n\nپس ہم نے الٰہی اختیارات میں سے وہ ذکر کیا جو غافل عقلوں کو عبرت اور بصیرت کی طرف بلانے کے لیے تنبیہ کا ذریعہ بنتا ہے، اور ہم نے اس امر کو اس کی حد تک پورا نہیں کیا، کیونکہ ہم احاطہ کے طریقے سے ان تمام موجودات کی تفصیل نہیں جانتے جو اللہ نے پیدا کی ہیں، اگرچہ ہم اس پر قادر ہیں جس پر اللہ نے ہمیں موجودات کو محدود کرنے پر قادر کیا ہے، پس اس میں ہر چیز شامل ہے۔ اور ہم نے اس میں صرف ان چیزوں کی معرفت کے لیے کوشش کی ہے جنہیں اس نے ہر نوع میں سے منتخب اور چنا ہے، جو وجود میں محدود ہیں، جو اپنی ذات سے قائم ہیں اور جو متحیز (جگہ گھیرنے والی) ہیں اور غیر متحیز ہیں، جو اپنی ذات سے قائم ہیں اور جو اپنی ذات سے قائم نہیں ہیں، اور وہ نوع جو صرف تبعیت سے تحیز کو قبول کرتی ہے، اور جو کچھ ان سے مرکب ہوا اور جو مرکب نہیں ہوا، اور عالم اور موجودات کی اقسام ان چیزوں میں محدود ہو گئیں جو ہم نے ذکر کیں۔\n\n### [وہ جس میں عقل اختیار میں خود مختار ہے اور وہ جو اس کی سطح سے اوپر ہے]\n\nاور پھر ایک نسبی تفصیل ہے جس میں عقل خود مختار ہو سکتی ہے، اور وہ اشیاء کو ایک دوسرے پر فضیلت دینا ہے، ان کے مراتب کے امتیاز، ایک دوسرے پر ان کے انفعال، ایک دوسرے میں ان کے اثر، اور ایک دوسرے پر ان کے توقف کے ذریعے، لیکن الٰہی قرب کی فضیلت ان کی حقیقتوں کے تقاضے سے نہیں بلکہ ان پر عنایت کے ذریعے، یہ نہیں ہو سکتا۔\n\nیہ صرف اللہ کے ہمیں اس علم سے آگاہ کرنے سے ہو سکتا ہے جو وہ ہمارے دلوں میں الہام کے علوم سے ڈالتا ہے، یا اس کے ذریعے جو وہ نازل شدہ کتابوں اور نبوی خبروں میں ہم تک پہنچاتا ہے۔ اور اس کے علاوہ کوئی دوسرا راستہ نہیں ہے۔\n\n### [عقلی دلائل، شرعی تعریفات اور حقیقی عبادات]\n\nپس سنن (السنن) عقلی دلائل ہیں، کیونکہ وہ راستے ہیں، اور فرائض (الفرائض) شرعی تعریفات ہیں اس چیز کے بارے میں جس پر ذات حق (الحق) تعالیٰ ہے، اس کی نسبت سے اور اس کی مخلوق کی نسبت سے۔ پس اے اللہ کے بندو! اللہ کی عبادت کرو اس صفت پر جس سے اس نے اپنے آپ کو اپنی کتاب میں یا اپنے رسولوں کی زبانوں پر بیان کیا ہے، بغیر کسی زیادتی یا کمی کے، اور بغیر کسی تاویل کے جو کمی یا زیادتی کا باعث بنے۔ بلکہ اس کے سامنے سر تسلیم خم کرو، جل جلالہ، جو اس نے اپنے آپ کو بیان کیا ہے، اگرچہ وہ محال ہو یا متضاد، تو یہ ہماری کوتاہی اور جہالت کی وجہ سے ہے کہ امر کس پر ہے۔ اور ہم نے وہ پورا کیا جو نظری عقلی قوت نے اس کے وجود کے علم میں اور اس کی طرف سے پہنچانے والوں کی سچائی میں عطا کیا، ہم نے کہا کہ قبول ہے بغیر کسی اعتراض کے، اگرچہ امر متضاد ہو جائے اور محال ہو جائے، کیونکہ جو چیز عقل کے لیے بالذات مجہول ہے، وہ اسے اپنے ذات سے متعلق امور میں کیسے داخل کر سکتی ہے، خواہ وہ وجوب، جواز یا استحالت میں ہو؟ پس عقل اپنی حد سے تجاوز نہیں کرتی اور اس کے سامنے سر تسلیم خم کرتی ہے، سبحانہ، جو اس نے نازل کیا اور ہمیں اس کے بارے میں بتایا جس پر وہ ہے، کیونکہ اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ پس ہمارے لیے اس پر اور اس پر ایمان لانا ہے جو اس کی طرف سے اس کے علم میں کتاب میں اور رسول کی زبان پر آیا ہے۔ اور اللہ ہمیں اس پر قائم رہنے کی توفیق دے، کیونکہ اللہ پر صرف ہلاک ہونے والا ہی ہلاک ہوتا ہے۔ پچانوےواں حصہ ختم ہوا۔\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "همانا فرائض (الفرائض) همچون مرکب‌ها هستند و سنن (السنن) *** مانند راهی برای آن مرکب‌ها به سوی مقاصدشان.\nپس اگر مسیر را طی کنی، فریضه خواهی بود *** و گوش حق (الحق) در آیاتش خواهی شد.\nاین برعکس نوافل (النوافل) است، پس در آن تأمل کن و ملتزم باش *** به راه‌های فضیلت و در اثبات آن‌ها بکوش.\n\n### [فرض عین، فرض کفایه، فرض مشروط]\n\nفرائض (الفرائض) اعمال یا ترک‌هایی هستند که خداوند متعال بر بندگانش واجب کرده و آن‌ها را قطعی نموده است، و کسی که به آن‌ها عمل نکند گناهکار است. این فرائض بر دو قسم‌اند: فرض عین (فرض عين) که اگر دیگری آن را انجام دهد، از عهده شخص ساقط نمی‌شود؛ و فرض کفایه (فرض كفاية) که اگر دیگری آن را انجام دهد، از عهده شخص ساقط می‌شود. فرض کفایه پیش از انجام شدن توسط دیگری، بر شخص و بر آن دیگری متعین بوده است، مانند نماز میت، غسل میت و جهاد. و سپس فرض دیگری است که میان این دو می‌درخشد و یک طرفش به هر یک از آن دو است، اما حکمش با دیگری متفاوت است؛ مانند حج واجب (الحج المفروض) در صورتی که شخص استطاعت نداشته باشد. اگرچه او جز با استطاعت مخاطب به آن نیست، اما این فرض متوقف بر شرط خود است. پس اگر ولیّ او به نیابت از او حج کند، از او ساقط می‌شود و او اجر (پاداش) ادای آن را خواهد داشت. این حکم در فرض کفایه به دلیل وجود اجر (پاداش) و در فرض نماز به دلیل عدم سقوط آن از کسی که نماز برایش خوانده شده، وجود ندارد. پس نه شبیه فرض نماز است و نه شبیه فرض کفایه.\n\n### [سنن دو قسم‌اند: سنتی که پیامبر به آن امر کرده و سنتی که یکی از امت آن را ابداع کرده است]\n\nاما سنن (السنن)، هر چیزی است غیر از آنچه عملش متعین شده است. و آن بر دو قسم است: سنتی که پیامبر (ص) به آن امر کرده و تشویق نموده یا خود آن را انجام داده و امتش را در انجام آن مخیر ساخته است؛ و سنتی که یکی از امت آن را ابداع کرده و در آن از او پیروی شده است، پس او اجر آن و اجر کسانی که به آن عمل کرده‌اند را خواهد داشت.\n\n### [ثمره عمل فریضه در زندگی مکلف]\n\nپس اگر بنده فریضه (الفرض) را به طور کامل به جا آورد، آنچه را که ربوبیت (الربوبية) از او در عبودیت (العبودة) سزاوار است، ادا کرده است. در نتیجه، عمل فریضه امری را برای او به بار می‌آورد که بالاتر از آن است که حق (الحق) گوش او باشد. زیرا اینکه حق (الحق) گوش بنده باشد، حالی برای بنده است، و حکم فریضه میان او و این حال حائل می‌شود. و آن این است که بنده گوش حق (الحق) باشد، پس حق (الحق) به واسطه بنده می‌شنود، و این همان قول اوست: «گرسنه شدم و مرا طعام ندادی.» اما این حائل شدن که فریضه (الفرض) به آن اعطا شده است، یعنی اینکه حق (الحق) گوش او باشد، مقامی محقق و ثابت است، همان‌گونه که در نفس‌الامر است. در این هنگام، بنده می‌داند که حق (الحق) اوست نه خودش. در حالی که صاحب حال (صاحب الحال) می‌گوید: «من هستم.»\n\n### [سنت نبوی و سننی که پس از رسول خدا (ص) شرایع مستحسنه هستند]\n\nو سنن (السنن) راه‌های اقتدا هستند، و بالاترین آن‌ها اقتدا به حق (الحق) است تا در اطلاق نام‌های او بر من، به تحقق (التحقق) نزدیک باشم نه به تخلق (التخلق). و پایین‌ترین آن‌ها در حق ولیّ، اقتدا به کسانی است که خداوند درباره‌شان فرمود: **أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ** (آنان کسانی هستند که خداوند هدایتشان کرده، پس به هدایت آنان اقتدا کن). و علما وارثان انبیا هستند و جز علم (العلم) چیزی به ارث نبرده‌اند.\n\nپس سنت نبوی (السنة النبوية) مقامی والا دارد و آن جامعیت بر دین و اقامه آن است و اینکه در آن تفرقه ایجاد نشود. این سنت کسی را که به آن عمل کند و در آن سلوک نماید، در حضرات محمدیه (الحضرات المحمدية) به سوی غایاتش در معارف (المعارف)، احوال (الأحوال) و تجلی (التجلي) بالا می‌برد.\nاما سننی که شرایع مستحسنه (الشرائع المستحسنة) پس از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هستند، و آن همان استحسان نزد فقها است که شافعی (رحمه الله) درباره‌اش فرمود: «هر کس استحسان کند، تشریع کرده است.» فقها این سخن را از او به جهت ذم (نکوهش) گرفتند، در حالی که او (رضی الله عنه) به حقیقتی مشروع برای خود سخن گفته بود که از او فهمیده نشد. زیرا او از چهار اوتاد (الأوتاد) بود و قیام او به علم شرع، او را از اهل زمانش و پس از او محجوب ساخت. از برخی صالحان روایت کرده‌ایم که خضر را ملاقات کرد و به او گفت: درباره شافعی چه می‌گویی؟ گفت: او از اوتاد است. گفت: درباره احمد بن حنبل چه می‌گویی؟ گفت: مردی صدیق است. گفت: درباره بشر حافی چه می‌گویی؟ گفت: پس از خود مانندش را باقی نگذاشت. این شهادت خضر درباره شافعی (رحمه الله) است.\n\n### [شرع، بدعت حسنه را مباح دانسته است]\n\nو چون نزد شافعی صحیح بود که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «هر کس سنت حسنه‌ای را بنا نهد، اجر آن و اجر هر کس که به آن عمل کند را خواهد داشت، و هر کس سنت سیئه‌ای را بنا نهد...» (الحديث - ادامه حدیث)، شکی نیست که شرع به او اجازه داده است که سنت حسنه‌ای را بنا نهد، و این از جمله چیزهایی است که از انبیا به ارث برده است. و این حسنه است، یعنی حق (الحق) آن را از او نیکو می‌شمارد و او آن را بنا نهاده است. پس «هر کس استحسان کند»، یعنی هر کس سنت حسنه‌ای را بنا نهد، «تشریع کرده است». و شگفتا از عدم فهم مردم کلام شافعی را در این باره، در حالی که حکم مجتهد را حتی اگر در نفس‌الامر خطا کرده باشد، ثابت می‌دانند و شارع آن را تأیید کرده است. و این حکم شرعی مقبول است و برای هیچ حاکمی رد آن جایز نیست، و قواعد و اصول شرع از آن محافظت می‌کنند، مانند مصالح مرسله در مذهب مالک.\n\n### [اختیارات الهی در موجودات و اختیارات زیرکان در امور مشروع]\n\nو چون شارع حکم آن را به طور اجمالی مقرر داشت و بیان کرد که واضع آن و پیروانش در آن مأجورند، و نهایت تابعین در آن به واضع آن بر حسب قدر و منزلت او و آنچه بنا نهاده است می‌رسد، با این بیان تو را متوجه ساختم که اوقاتت را با شرایع نبوی و سنن اصلی آباد کنی. زیرا شایسته است که غایت عمل شخص زیرک (الکیس) جز نبوت اصلی نباشد نه فرعی، چرا که او در انتخاب، اختیار دارد، زیرا امور در نفس خود قابلیت اختیار را دارند، همان‌گونه که خداوند سبحان در تمام موجودات انجام داد. پس از هر امر در هر جنس، امری را برگزید؛ مانند انتخاب کلمه «الله» از میان اسماء الحسنی (الأسماء الحسنى)، و انتخاب رسولان از میان مردم، و انتخاب فرشتگان از میان بندگان، و انتخاب عرش از میان افلاک، و انتخاب آب از میان ارکان (عناصر)، و انتخاب رمضان از میان ماه‌ها، و انتخاب روزه از میان عبادات، و انتخاب قرن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از میان قرون، و انتخاب روز جمعه از میان روزهای هفته، و انتخاب شب قدر از میان شب‌ها، و انتخاب فرائض (الفرائض) از میان اعمال، و انتخاب نود و نه از میان اعداد، و انتخاب بهشت از میان دیار، و انتخاب رؤیت (الرؤية) از میان احوال سعادت در بهشت، و انتخاب رضایت (الرضي) از میان احوال، و انتخاب «لا إله إلا الله» از میان اذکار، و انتخاب قرآن از میان کلام، و انتخاب سوره «یس» از میان سوره‌های قرآن، و انتخاب آیة الکرسی از میان آیات قرآن، و انتخاب **قُلْ هُوَ الله أَحَدٌ** (بگو او خدای یکتاست) از میان سوره‌های کوتاه مفصل، و انتخاب دعای روز عرفه از میان دعاهای زمان‌ها، و انتخاب براق از میان مرکب‌ها، و انتخاب روح (الروح) از میان فرشتگان، و انتخاب سفیدی از میان رنگ‌ها، و انتخاب اجتماع از میان اکوان (هستی‌ها)، و انتخاب قلب از میان انسان، و انتخاب حجرالأسود از میان سنگ‌ها، و انتخاب بیت‌المعمور از میان خانه‌ها، و انتخاب سدره (درخت سدر) از میان درختان، و انتخاب مریم و آسیه از میان زنان، و انتخاب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) از میان مردان، و انتخاب خورشید از میان ستارگان، و انتخاب حرکت مستقیم از میان حرکات، و انتخاب شریعت نازل شده از میان نوامیس (قوانین)، و انتخاب براهین وجودی (البراهين الوجودية) از میان براهین، و انتخاب صور آدمیه (الصور الآدمية) از میان صور، به همین دلیل آن را بر صورت الهی آشکار ساخت، و انتخاب نوری که با آن نظر (دیدن) حاصل می‌شود از میان انوار، و انتخاب اثبات از میان دو نقیض، و انتخاب وجود از میان دو ضد، و انتخاب رحمت بر غضب، و انتخاب سجده از میان افعال نماز، و انتخاب ذکر خدا از میان اقوال نماز، و انتخاب نیت از میان انواع ارادات. پس نیت در قبول و رد عمل حکم دارد، زیرا:\n**لكل امرئ ما نوى** (برای هر کس همان است که نیت کرده است).\nو غیر عامل در اجر و پاداش به عامل ملحق می‌شود.\n\n### [انتخاب ذکر خدا از میان اقوال نماز]\n\nاما ذکر خدا از اقوال نماز، ذکر خدا در آن بزرگترین چیز است، چنانکه خداوند عز و جل فرمود: **إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ ولَذِكْرُ الله أَكْبَرُ** (همانا نماز از فحشا و منکر باز می‌دارد، و قطعاً ذکر خدا بزرگتر است). زیرا نماز مناجات است و ذاکر (ذکر کننده) همنشین حق (الحق) است. پس اگر حق (الحق) او را ذکر کند، او (تعالی) زبان اوست.\n\n### [انتخاب سجود از میان افعال نماز]\n\nاما انتخاب سجود (السجود) در افعال نماز، به دلیل عصمتی است که در آن از شیطان وجود دارد. زیرا شیطان در هیچ یک از افعال نماز از او جدا نمی‌شود مگر در سجود به طور خاص، چون سجود خطای او بود. و هنگام سجود، شیطان گریه می‌کند و تأسف می‌خورد و پشیمان می‌شود، و پشیمانی توبه است، و ناگزیر آن مقدار پذیرفته می‌شود. پس او در هر سجده توبه می‌کند، و خداوند هر فتنه‌گر توبه‌کننده‌ای را دوست دارد.\nسپس هنگام برخاستن از سجود، دوباره به اغواگری باز می‌گردد.\n\n### [انتخاب رحمت بر غضب]\n\nاما انتخاب رحمت (الرحمة) بر غضب (الغضب)، به این دلیل است که رحمت هم به منّت و هم به وجوب عمل می‌کند و **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (همه چیز را فرا گرفته است). و غضب از جمله چیزهایی است که رحمت آن را فرا گرفته است. پس غضب خالصی که آمیخته به رحمت نباشد، وجود ندارد، در حالی که رحمت با غضب آمیخته نمی‌شود. و **مَنْ يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوى‏** (هر کس غضب من بر او فرود آید، سقوط کرده است). پس غضب او را به سقوط واداشته است. و چون سقوط کند، که همان افتادن است و حکم غضب است و نه چیز دیگر، در رحمت سقوط می‌کند، و رحمت او را در بر می‌گیرد و او را می‌پذیرد. پس او جز به سوی رحمت سقوط نمی‌کند، و به واسطه رحمتی که در غضب است، سقوط کرده است. این همان رحمتی است که غضب را واداشته تا او را به سقوط بکشاند تا رحمت خالص او را تحویل بگیرد. مانند رحمتی که در داروی ناگوار است، که بیمار آن را با کراهت می‌نوشد، در آن رحمتی پنهان است که به خاطر آن، داروی ناگوار در آن زمان به کار برده شده تا او را به عافیت که همان رحمت خالص است، برساند. به همین دلیل، سرانجام امور به رحمت و حکم آن باز می‌گردد، و حتی اگر از آتش خارج نشوند، در آن برایشان نعمتی است، و **الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ** (خداوند بر هر چیزی تواناست). آیا نمی‌بینی که خداوند در آتش دنیا چه منافع و آسایش‌هایی قرار داده است؟ و اگر جز داغ کردن (الکی) برای برخی بیماری‌ها نبود، کافی بود، زیرا آن قاطع‌ترین داروهاست و به دلیل قوتش در اثرگذاری، در توکل خدشه وارد می‌کند، زیرا در فعل، جای شفا دهنده و عافیت دهنده را می‌گیرد. پس غیرت (الغيرة) حکم کرد که کسی که داغ می‌شود، متوکل نیست.\n\n### [انتخاب وجود از میان دو ضد]\n\nاما انتخاب وجود (الوجود) از میان دو ضد، به این دلیل است که وجود صفت اوست. پس صفت خود را برای ممکنات انتخاب کرد، و جز این صحیح نیست. زیرا او اقتدار (الاقتدار) دارد و از اقتدار جز وجود (الوجود) صادر نمی‌شود. آیا نمی‌بینی که وقتی فرمود: **إِنْ يَشَأْ يُذْهِبْكُمْ** (اگر بخواهد شما را می‌برد)، فرمود: **ويَأْتِ بِآخَرِينَ** (و دیگرانی را می‌آورد)؟ پس اقتدار جز وجود را نپذیرفت، در حالی که اراده را به اعدام (نیست کردن) معلق کرد، و او اسم «المانع» (بازدارنده) را دارد و منع همان عدم (نیستی) است.\n\n### [انتخاب اثبات بر نفی]\n\nاما انتخاب اثبات (الإثبات)، همان عین چیزی است که به آن می‌گوید: «باش» (کن). زیرا در حال عدمش، اثبات را بر نفی برای او ترجیح داد تا در حال عدمش همچنان ممکن (ممکن) باقی بماند. و این مسئله‌ای دقیق در ترجیح در حال عدم است. و به واسطه همین افتقار ذاتی (الافتقار الذاتي) که در ممکن پیش از وجود است، اگر حق (الحق) آن را اراده کند، با حکم اثبات که بر آن است، به سوی آن شتاب می‌گیرد.\n\n### [نور برگزیده از میان انوار]\n\nاما نور برگزیده از میان انوار، انوار حجاب‌ها هستند. به همین دلیل درباره انوار حجابی (الأنوار الحجابية) فرمود: «نوری است که آن را می‌بینم» (نور إني أراه).\nسپس وعده رؤیت (الرؤية) داد و آن نور است. پس ناگزیر نوری که حق (الحق) در آن برای بندگانش ظاهر می‌شود، از میان آن انوار حجابی برگزیده شده است، مانند نور احدیت (الأحدية)، عزت، کبریا و عظمت. همه این‌ها از بصر (چشم) برداشته می‌شوند و حکمشان در قلب باقی می‌ماند. پس با برداشته شدن آن‌ها، رؤیت حق تعالی واقع می‌شود و حکمشان در قلب باقی می‌ماند، و بندگان از رؤیت فانی می‌شوند. و اگر چنین نبود، هنگام شهود (الشهود) حق، نفس‌های خود را نیز شهود می‌کردند.\n\n### [انتخاب صورت آدمیه]\n\nاما انتخاب صورت آدمیه (الصورة الآدمية)، به این دلیل است که آدم را بر صورت خود آفرید. پس تمام اسماء الحسنی (الأسماء الحسنى) خود را بر او اطلاق کرد، و به قوت آن‌ها امانتی را که عرضه شده بود، حمل کرد. و این حقیقت به او اجازه نداد که آن را رد کند، همان‌گونه که آسمان‌ها و زمین و کوه‌ها از حمل آن سر باز زدند، و **وَحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً** (و انسان آن را حمل کرد، همانا او بسیار ستمکار بود) اگر آن را حمل نمی‌کرد، **جَهُولًا** (بسیار نادان بود). زیرا علم به خدا عین جهل به اوست. عجز از درک، خود درک است. زیرا وقتی بداند که چیزی هست که نمی‌داند، پس آنچه دانسته، همان علم به این است که چیزی هست که نمی‌داند، و علم او تعلقی ندارد جز جهل به آن.\n\n### [انتخاب براهین وجودی از براهین جدلی و غیره]\n\nاما انتخاب براهین وجودی (البراهين الوجودية) از براهین جدلی و غیره، به دلیل کمال علمی است که در اثبات ثبوت حق (الحق) و ابطال حجت خصم به دست می‌دهد. براهین جدلی (البراهين الجدلية) این قوت را ندارند، زیرا آن‌ها حجت خصم را باطل می‌کنند، اما ممکن است حقی را ثابت نکنند. و براهین سوفسطائیه (السوفسطائية) حیرت را نتیجه می‌دهند، و از جهتی در علم الهی به براهین وجودی نزدیک‌ترند تا براهین جدلی.\n\n### [انتخاب شریعت نازل شده بر نوامیس حکمیه]\n\nاما انتخاب شریعت نازل شده (الشريعة المنزلة)، به دلیل تعلق عام آن به سرای آخرت و مصالح دنیا است. در حالی که نوامیس حکمیه (النواميس الحكمية) که برای مصالح دنیا و بقای خیر در عالم دنیا وضع شده‌اند، حکمی ندارند که بتوانند بر خدا به قرب الهی (القرب الإلهي)، قبول اعمال، رفع درجات، و اثبات بهشت و سرای شقاوت حکم کنند. هیچ چیز جز شرع نازل شده از نزد خدا نمی‌تواند به تنهایی عهده‌دار همه این‌ها باشد.\nاما کسانی که عباداتی را ابداع کردند و حق رعایت آن‌ها را به جا آوردند، در طلب رضوان خدا، از اموری که خداوند بر آن‌ها ننوشته بود، آنان صاحبان شرعی هستند که از نزد خدا نازل شده است. پس در آن سنن حسنه‌ای را بنا نهادند که مناسب با سننی است که شرع به واسطه شرع نازل شده در حق آنان بنا نهاده است، و به آنان اجازه داده است که سنت بنا نهند. اما نوامیس حکمیه، آن‌هایی نیستند که این افراد بنا نهاده‌اند. و به همین دلیل برای آنان اجر قرار داده شده است.\n\n### [انتخاب حرکت مستقیم]\n\nاما انتخاب حرکت مستقیم (الحركة المستقيمة)، به این دلیل است که او **عَلى‏ صِراطٍ مُسْتَقِيمٍ** (بر راهی راست است)، چنانکه درباره خود فرمود. و این حرکت مخصوص انسانی است که خداوند او را بر صورت حق (الحق) آفریده است، و سعادتمند در روز قیامت بر این حرکت محشور می‌شود. پس این حرکت برای او دنیا و آخرت است. زیرا مجرمان واژگون محشور می‌شوند، و این همان حرکت واژگون (الحركة المنكوسة) است، چنانکه تعالی در حق مجرمان فرمود: **ولَوْ تَرى‏ إِذِ الْمُجْرِمُونَ ناكِسُوا رُؤُسِهِمْ عِنْدَ رَبِّهِمْ** (و اگر ببینی آنگاه که مجرمان سرهای خود را نزد پروردگارشان پایین انداخته‌اند). و حرکت کج افقی در چهارپایان است. پس حرکت مستقیم جز برای کسی که خداوند او را بر صورت آفریده، صحیح نیست، و آن همان انسان کامل (الإنسان الكامل) است که این صفت را در دنیا و آخرت دارد. و به همین دلیل، ذکر آدم به این صفت اختصاص داده شده است، زیرا او از اهل سعادتی است که این حرکت مستقیم بر او باقی می‌ماند، و به همین دلیل به خلافت توصیف شده است.\n\n### [انتخاب خورشید]\n\nاما انتخاب خورشید (الشمس)، به دلیل امدادرسانی آن به تمام ستارگان نورانی، چه بالا و چه پایین است. به همین دلیل ابراهیم (علیه السلام) فرمود: **هذا أَكْبَرُ** (این بزرگتر است). و خورشید در هر دو مذهب (بطلمیوسی و غیره) به قلب کره اختصاص یافته است، و آن آسمان چهارم است، و ادریس (علیه السلام) در آنجاست. و خداوند ذکر کرده است که او را به **مَكاناً عَلِيًّا** (جایگاهی بلند) بالا برد. پس بلندی این مکان به دلیل قلب افلاک بودن آن است، و مکانی است که به واسطه مکانت بلند است. و آنچه بالاتر از آن است، اگرچه از نظر مسافت پایین‌تر باشد، اما به نسبت به سرهای ما بالاتر است. و خورشید است که شب و روز را با طلوع و غروب خود ایجاد می‌کند، که خداوند برای آن‌ها غشیان (پوشاندن) قرار داده است، و آن همان نکاح و ایلاج (درآوردن) است برای ظهور اعیان مولدات (موجودات متولد شده) و آنچه خداوند در شب و روز از مخلوقات به واسطه این ایلاج و غشیان ایجاد می‌کند. و برای هر یک از این دو موجود که از حرکت خورشیدی حاصل می‌شوند، طلب حثیث (جستجوی سریع) قرار داده است تا اعیان حوادث را از این طلب آشکار سازد.\n\n### [انتخاب محمد (ص)]\n\nاما انتخاب محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، به دلیل کمال و اعتدالی است که مزاج او، برخلاف مزاج‌های انسانی دیگر، اقتضا می‌کرد. زیرا به واسطه او نبوتش را شهود کرد، در حالی که آدم میان آب و گل بود. و او (آدم) متفرق‌الاجزاء در مولدات عنصری بود. و این مسئله‌ای دقیق است که جز کسی که گرفتن ذریه از پشت آدم را هنگام **أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ ف قالُوا بَلى‏** (آیا من پروردگار شما نیستم؟ گفتند: بله) بداند، آن را نمی‌فهمد. و این همان فطرتی است که مردم بر آن متولد شده‌اند و به سوی آن باز می‌گردند. و در این جمع، پیامبر (ص) فرمود: **الأرواح أجناد مجندة** (ارواح لشکرهای آماده‌ای هستند).\nو چون خداوند آن‌ها را جمع کرد، در حضرت تمثیل (حضرة التمثيل) جمع کرد. پس آنچه در آنجا رو در رو بود، در اینجا با هم آشنا شدند، و آنچه در آنجا پشت به پشت بود، در اینجا با هم بیگانه شدند، و آنچه میان این دو بود، از رو به پشت و پهلو و غیره. و در این باره می‌گویم:\n> إن القلوب لأجناد مجندة *** في حضرة الجمع تبدو ثم تنصرف‏\n> فما تعارف منها فهو مؤتلف *** وما تناكر منها فهو مختلف‏\n(همانا قلب‌ها لشکرهای آماده‌ای هستند *** که در حضرت جمع ظاهر می‌شوند و سپس منصرف می‌گردند.\nپس آنچه از آن‌ها با هم آشنا شد، الفت می‌گیرد *** و آنچه از آن‌ها با هم بیگانه شد، اختلاف می‌یابد.)\nو همانا هر کس این شهادت را در آخرت اقرار می‌کند و انکار نمی‌کند و ادعای ربوبیت برای خود نمی‌کند. خداوند تعالی می‌فرماید: **إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا من الَّذِينَ اتَّبَعُوا** (آنگاه که کسانی که پیروی شده‌اند، از کسانی که پیروی کرده‌اند، بیزاری می‌جویند).\nپس او (صَلَّى اللهُ عَليهِ وسَلَّم) بزرگترین مجلای الهی (مجلى إلا هي) بود که به واسطه او علم اولین و آخرین دانسته شد. و از اولین، علم آدم به اسماء بود، و به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) جوامع الکلم (جوامع سخنان) داده شد، و کلمات خدا پایان نمی‌پذیرد. و او در روز قیامت سیادتی دارد که از مردم دور نیست، پس در حق شفاعت‌کنندگان شفاعت می‌کند، از پادشاه و رسول و نبی و ولی و مؤمن. و او مقام محمود (المقام المحمود) را در روز مشهود دارد.\n\n### [انتخاب مریم و آسیه]\n\nاما انتخاب مریم و آسیه، الحاق آن دو به کمالی است که برای مردان است، با وجود درجه‌ای که مردان بر آن‌ها دارند. زیرا آن درجه وجودی (وجودية) است و زائل نمی‌شود.\n\n### [انتخاب سدره]\n\nاما انتخاب سدره (السدرة)، به این دلیل است که محل پایان اعمال بندگان و محل فضل است، و صور اعمال در سایه آن سایه می‌افکنند. و خداوند آن را از انواری پوشانده است که پوشانده است. آگاه باش که آن انوار، انوار اعمال هستند، و هیچ کس نمی‌تواند آن‌ها را وصف کند. و آن انوار، همان‌گونه که گفتیم، انوار اعمال هستند که از صور آن‌ها ساطع می‌شوند و آن را می‌پوشانند. پس هیچ کس نمی‌تواند آن را وصف کند، زیرا وصف اشیا، تقیید و تمییز است، و اعمال متفاوتند و مراتب دارند، و انوار آن‌ها به اندازه مراتبشان است: فعال، بالاتر، درخشان، و درخشان‌تر. و وصف عالی با بالاتر مناقض است، و وصف درخشان با درخشان‌تر مقابله می‌کند، از آن جهت که درخشان‌تر است. پس با وصفی مقید نمی‌شود، زیرا اگر آن را با وصفی مقید کنی، نقیضش آن را باطل می‌کند. پس حق آن را در وصف ادا نکرده‌ای، زیرا انوار اعمال در یک درجه نیستند. و این انوار آن را پوشانده و در بر گرفته‌اند، پس هیچ کس نمی‌تواند به وصف آن دست یابد. پس اگرچه در زیر آن سایه می‌افکنند، اما آن را با جامه‌هایی از انوار پوشانده‌اند که بر تمام درختان برتری یافته است. و آن طعام و غسول است، و میوه‌اش (نبقها) مانند کوزه‌هاست، و ارواح شهدا از آن روزی می‌خورند.\n\n### [انتخاب بیت‌المعمور]\n\nاما انتخاب بیت‌المعمور (البيت المعمور)، به این دلیل است که مخصوص آبادانی فرشتگانی است که هر روز از قطرات آب نهر حیات (نهر الحياة) که از تکان خوردن روح‌الامین (الروح الأمين) می‌ریزد، خلق می‌شوند. زیرا او هر روز یک بار در نهر حیات غوطه می‌خورد تا این فرشتگان آباد کننده بیت‌المعمور خلق شوند. و آن‌ها هفتاد هزار فرشته هستند که وقتی از آن خارج می‌شوند، هرگز به آن باز نمی‌گردند. و راز در مکانی باقی ماند که این فرشتگان آن را آباد می‌کنند، و در آنجا هیچ خلأیی نیست، در حالی که تمام عالم خلأ را پر کرده است. پس در جستجوی آن باش، زیرا آن علمی بزرگ است که تو را بر علم استحالات اعیان در اعیان و دگرگونی خلق در اطوار (مراحل) آگاه می‌سازد. پس می‌دانی که **أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ** (همانا خداوند بر هر چیزی تواناست)، نه بر آنچه شیء نیست. زیرا «لا شیء» (هیچ چیز) شیئیت را نمی‌پذیرد، چرا که اگر می‌پذیرفت، حقیقتش «لا شیء» نبود. و معلوم از حقیقت خود خارج نمی‌شود. پس «لا شیء» همیشه محکوم به «لا شیء» است، و آنچه شیء است، همیشه محکوم به «شیء» است.\n\n### [انتخاب حجرالأسود]\n\nاما انتخاب حجرالأسود (الحجر الأسود)، به این دلیل است که آن را نازل کرد تا آن را به جای دست راست خود در بیعت الهی (البيعة الإلهية) قرار دهد. زیرا در میان معارف و عبادات، چیزی ملازم‌تر به آنچه شناخته شده و به آن عبادت شده، وجود ندارد. زیرا آن بر معرفت و عبادت محض فطرت یافته است، که حقیقت نبات و حیوان از آن عاجز است. و به همین دلیل، هیچ چیز از آن به طور کامل در انسان وجود ندارد. زیرا تمام آنچه در انسان است، قابلیت رشد دارد، و این برای نبات است، همان‌گونه که حیوان تصرف در جهات را دارد. پس هرگاه موجودی از معدن جدا شود، به صورت ادعای حقیقت خود ملبس می‌شود. و این نزاعی پنهان است که هر عالمی آن را درک نمی‌کند. و سهل (تستری) به برخی از این‌ها اشاره کرده است، اما امر در آن به طور کامل آن‌گونه که هست، ادا نشده است. پس نمی‌دانم آیا او می‌دانست و به آنچه ذکر کرد اکتفا نمود، یا خداوند در آن زمان او را بر بیشتر از آنچه ذکر کرد، مطلع نساخت. و خدا داناتر است. پس خداوند آن را به عنوان دست راست (یمین) انتخاب کرد.\n\n### [انتخاب قلب از انسان]\n\nاما انتخاب قلب (القلب) از انسان، همان چیزی است که حق (الحق) را در خود جای داد، زیرا هر روز در شأنی است، و «روز» به اندازه نفس کشیدن در زمان فرد است. و به همین دلیل قلب (قلب) نامیده شد، به خاطر تقلب (دگرگونی) آن. آیا نمی‌بینی که میان دو انگشت رحمان است؟ و جز رحمان آن را دگرگون نمی‌کند. هیچ اسم دیگری در این امر با او دخالت ندارد. و اسم رحمان جز آنچه در حقیقت اوست، نمی‌دهد، و رحمت او **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (همه چیز را فرا گرفته است). پس هیچ امری را در دگرگونی آن نمی‌بینی که به رنج و عذاب و شقاوت منجر شود، مگر اینکه در آن رحمتی پنهان است، زیرا با انگشتان رحمان دگرگون می‌شود. اگر بخواهد آن را برپا می‌دارد و اگر بخواهد آن را از آن برپایی منحرف می‌سازد. پس این یک میل اضافی است. قلب به حکم سلطنت این اسمی که آن را در انحراف دگرگون کرد، به رحمت متمایل شد، همان‌گونه که آن را در برپایی دگرگون کرد. پس این بشارتی از جانب خدا به بندگانش است: **يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ** (ای بندگان من که بر خود اسراف کرده‌اید). و هیچ اسرافی را ذکر نکرد، پس تمام حالات مسرفین در اسراف را شامل می‌شود: **لا تَقْنَطُوا من رَحْمَةِ الله** (از رحمت خدا ناامید نشوید). زیرا کسی که شما را منحرف ساخت، انگشت رحمان است. **إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً** (همانا خداوند همه گناهان را می‌آمرزد). و این خبری است که نسخ نمی‌پذیرد. پس این قول خود را با قول **إِنَّ الله لا يَغْفِرُ أَنْ يُشْرَكَ به** (همانا خداوند شرک به خود را نمی‌آمرزد) جمع می‌کند. پس بر شرک آنچه را که خدا بخواهد مؤاخذه می‌کند، سپس انگشت رحمان بر او حکم می‌کند و به رحمت باز می‌گردد. و امور دیگری از انحرافات که پایین‌تر از شرک هستند، برخی از آن‌ها پس از عقوبت آمرزیده می‌شوند، و آن‌ها اهل کبائری هستند که پس از آنکه به زغال تبدیل شدند، با شفاعت از آتش خارج می‌شوند، با وجود اینکه مشرک نیستند، و ایمان به این واجب است. و برخی از آن‌ها از ابتدا بدون عقوبت آمرزیده می‌شوند. پس ناگزیر سرانجام به رحمت باز می‌گردد.\n\n### [انتخاب اجتماع از اکوان]\n\nاما انتخاب اجتماع (الاجتماع) از اکوان (هستی‌ها)، به این دلیل است که افتراق را با تمییز در عین جمع می‌دهد. پس ناگزیر باید رب (پروردگار) و مربوب (پرورده شده) باشد، و قادر و مقدور. پس اجتماع انتخابی است که به دلیل آنچه حقایق اسماء الهی از تعلق اقتضا می‌کنند، ناگزیر است.\n\n### [انتخاب سفیدی از رنگ‌ها]\n\nاما انتخاب سفیدی (البياض) از رنگ‌ها، به این دلیل است که تمام رنگ‌ها به آن استحاله می‌یابند، اما سفیدی به آن‌ها استحاله نمی‌یابد. بلکه سفیدی آن در آن پنهان است و به واسطه حجاب رنگی که در چشم ظاهر می‌شود، پوشیده شده است، مانند سیاهی، قرمزی، زردی و غیره. پس برخی از آن‌ها رنگی هستند که قائم به محل (جسم) است، و برخی رنگی هستند که در چشم بیننده است و در نفس شیء رنگین چنین نیست، مانند سیاهی کوه‌های سفید از دور. وقتی به آن‌ها نزدیک شوی، آن‌ها را سفید می‌بینی، در حالی که تو بر آن‌ها حکم به سیاهی می‌کردی، و در آن حکم اشتباه می‌کردی، اما در ظهور سیاهی به واسطه آن، درست می‌گفتی و مصیب بودی. و کیفیت آن مجهول است. و به همین منوال، کبودی آسمان تنها برای نظر چشم است، اگرچه در نفس خود بر رنگی است که با کبودی متفاوت است.\n\n### [انتخاب روح از فرشتگان]\n\nاما انتخاب روح (الروح) از فرشتگان، به این دلیل است که اوست که در هر صورت ملکی، فلکی، عنصری، مادی و طبیعی دمیده می‌شود. و حیات اشیا به واسطه اوست. و او همان روح مضاف (الروح المضاف) است، و او نفس رحمان (نفس الرحمن) است که حیات از او حاصل می‌شود. و حیات نعمت است، و نعمت مورد التذاذ است، و التذاذ بر حسب مزاج است، همان‌گونه که گفتیم: مزاج کسی که سردی بر او غلبه کرده، از چیزی متنعم می‌شود که کسی که گرمی بر او غلبه کرده، از آن عذاب می‌کشد. پس بفهم. و تذکر شارع برای تو کافی است، اگر می‌فهمیدی، که آتش را اهلی است که اهل آن هستند، و بهشت را اهلی است که اهل آن هستند. و درباره اهل آتش ذکر کرد که در آن نمی‌میرند و زنده نمی‌شوند. پس آن‌ها نعیم را با آتش طلب می‌کنند، به دلیل وجود سردی. و این از حکم مزاج است.\n\n### [انتخاب براق از مرکب‌ها]\n\nاما انتخاب براق (البراق) از مرکب‌ها، به دلیل مرکب معراج بودن آن است. پس میان چهارپایان و بالداران جمع کرده است. پس او علوی (آسمانی) و سفلی (زمینی) است، مانند برخی حیوانات که هم خشکی و هم دریایی هستند.\n\n### [انتخاب دعای روز عرفه]\n\nاما انتخاب دعای روز عرفه، به این دلیل است که آن دعایی است در حال تجرید (تخلیه از غیر)، ذلت و خضوع در موطن معرفت (معرفة) برای یک روز زمانی، به دلیل جمع شدن شب و روز در آن.\n\n### [انتخاب قل هو الله أحد]\n\nاما انتخاب **قُلْ هُوَ الله أَحَدٌ** (بگو او خدای یکتاست)، به این دلیل است که مخصوص اوست. در آن ذکری از کونی از اکوان نیست، مگر احدیت (أحدية) هر احدی که شبیه احدیت تعالی نیست. و آمدن آن در این سوره، علم غریبی است برای کسی که خداوند آن را بر او گشوده است. زیرا سوره را با احدیت خود آغاز کرد و با احدیت مخلوقات ختم نمود. پس بدان که کائنات به او مرتبطند، ارتباط آخر به اول، نه ارتباط اول به آخر. زیرا آخر، اول را می‌طلبد و اول، آخر را نمی‌طلبد. پس او از ذات خود از عالمیان بی‌نیاز است، و آخر، او را از مسمای «الله» که به احدیت (الأحدية) توصیف شده است، می‌طلبد. پس با این بیان، تو را بر مأخذ این علمی که این سوره در بر دارد، آگاه ساختم، به واسطه احدیت متأخری که با وجود ارتباطش به اول، مماثل آن نیست، زیرا آن را می‌طلبد و او آن را نمی‌طلبد: **أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ** (شما نیازمند به خدا هستید و خداست که بی‌نیاز و ستوده است).\n\n### [انتخاب آیة الکرسی]\n\nاما انتخاب آیة الکرسی (آية الكرسي) از میان آیات، آیات همان نشانه‌ها هستند، و هیچ چیز دلالت‌کننده‌تر بر شیء از خود آن نیست. و این آیة الکرسی تماماً اسماء یا صفات اوست، و این در غیر آن از آیات یافت نمی‌شود. پس با خود بر خود دلالت کرد: **الله لا إِلهَ إِلَّا هُوَ** (خداوند، معبودی جز او نیست). پس نفی کرد و اثبات نمود با ضمیر غایب بر اسم حاضر که مسمای غیب دارد. **الْحَيُّ** (زنده) صفتی شرطی در وجود آنچه از اسماء برای اوست. **الْقَيُّومُ** (پاینده) بر هر آنچه غیر اوست به واسطه آنچه کسب کرده است، زیرا او **أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ** (به هر چیزی خلقتش را عطا کرد). **لا تَأْخُذُهُ سِنَةٌ ولا نَوْمٌ** (او را چرت و خواب نمی‌گیرد) صفت تنزیه عما يناقض حفظ العالم (از آنچه مناقض حفظ عالم است)، که اگر قیومیت او نبود، لحظه‌ای باقی نمی‌ماند. **الله** (خداوند) ضمیر به او باز می‌گردد و آن ضمیر غیب است. **ما في السَّماواتِ وما في الْأَرْضِ** (آنچه در آسمان‌ها و آنچه در زمین است) ملک او و بنده اوست که حفظش برای بقای حکم الوهیت معین شده است. **مَنْ ذَا الَّذِي يَشْفَعُ** (کیست آنکه شفاعت کند) شفاعت وتر (فرد) به حکم **عِنْدَهُ** (نزد او) ضمیر غیب است. **إِلَّا بِإِذْنِهِ** (مگر به اذن او) عدم استقلال در حکم بدون اوست. پس ناگزیر باید اذن او باشد، زیرا شفیع یا شفیعانی وجود دارند. **يَعْلَمُ ما في السَّماواتِ وما في الْأَرْضِ** (آنچه در آسمان‌ها و آنچه در زمین است را می‌داند) از شفاعت‌کنندگان و شفاعت‌شدگان. **يَعْلَمُ ما بَيْنَ أَيْدِيهِمْ** (آنچه پیش روی آن‌هاست را می‌داند) و آن همان چیزی است که در آن هستند. **وما خَلْفَهُمْ** (و آنچه پشت سر آن‌هاست) و آن همان چیزی است که به سوی آن باز می‌گردند. **ولا يُحِيطُونَ بِشَيْ‏ءٍ من عِلْمِهِ** (و به چیزی از علم او احاطه نمی‌یابند) به اشیا. **إِلَّا بِما شاءَ** (مگر به آنچه او بخواهد) از آن، نه به همه آن. **وَسِعَ كُرْسِيُّهُ** (کرسی او فرا گرفته است) علم او **السَّماواتِ والْأَرْضَ** (آسمان‌ها و زمین) علو و سفل را. **ولا يَؤُدُهُ** (و او را سنگین نمی‌کند) **حِفْظُهُما** (حفظ آن دو)، زیرا حفظی ذاتی و معنوی و امدادی غیبی و خلقی دائم در سفل و علو است. **وهُوَ** (و او) ضمیر غیب است. **الْعَلِيُّ** (بلند مرتبه) به واسطه بی‌نیازی‌اش از خلقش از ذات خود. **الْعَظِيمُ** (بزرگ) در قلوب عارفان (العارفين) به واسطه جلالش. پس هیبت او در آن‌هاست. این آیتی است که در آن ذکر خدا میان اسم ظاهر و مضمر در شانزده موضع از این آیه آمده است، و این را در غیر آن از آیات نمی‌یابی. پنج اسم ظاهر از آن‌ها: الله، الحي، القيوم، العلي، العظيم. و نُه ضمیر آن ظاهر است، پس در ظاهر مضمرند. و دو ضمیر در باطن مضمرند که در ظاهر عین ندارند، و آن‌ها ضمیر علم و مشیئت هستند. و همچنین علم و مشیئت او را جز او نمی‌داند. پس هیچ کس آنچه در علم اوست و آنچه در مشیئت اوست را نمی‌داند، مگر پس از ظهور معلوم با وقوع مراد، و نه چیز دیگر. به همین دلیل ضمیر در آن‌ها ظاهر نشده است.\n\n### [انتخاب سوره یس از قرآن]\n\nاما انتخاب سوره یس (يس) از قرآن، به این دلیل است که قلب قرآن است. و هر کس آن را بخواند، مانند کسی است که قرآن را ده بار خوانده است. و قلب شریف‌ترین چیز در صورت صاد (صاد) است، همچنین سوره سین (يس) که نازل شده است. و برای آن از برج‌ها، بیت شرف خورشید است، و آن برج اولیت (الأولية) است، زمان بهار، روی آوردن نشو و نما، ظهور آغاز، و شروع زینت عالم طبیعت، و لطیف شدن بخارات انفاس که زمان زمستان به دلیل سردی هوا آن‌ها را متراکم کرده بود. زمستان به بخارات خارج شده از نفس‌کشندگان هنگام خروج، تراکم می‌داد، سپس آن‌ها را باز می‌گرداند، و این همان رطوبتی است که در زمان زمستان هنگام تنفس در دستانت می‌یابی. و برای او شئون الهی (الشئون الإلهية) است که در هر نفس در آن‌هاست، جل جلاله.\n\n### [انتخاب قرآن از کلام الهی]\n\nاما انتخاب قرآن (القرآن) از کلام الهی، آن است که صفت جمع (الجمع) را دارد. و در جمع، عین فرقان (الفرقان) است. زیرا جمع دلیل کثرت است، و کثرت آحاد است، پس آن عین افتراق در عین جمع است. پس آن فرقان (الفرقان) و قرآن (القرآن) است.\n\n### [انتخاب لا إله إلا الله از میان اذکار]\n\nاما انتخاب **لا إله إلا الله** (هیچ معبودی جز خدا نیست)، به این دلیل است که ذکری است که نفی و اثبات را در بر گرفته است، و این برای غیر آن از اذکار نیست.\n\n### [انتخاب رضا از میان احوال]\n\nاما انتخاب رضایت (الرضي) از احوال، آخرین چیزی است که از حق (الحق) برای اهل سعادت از بشارت می‌رسد. پس از آن بشارتی نیست، زیرا آن بشارتی است که ابدیت را همراهی می‌کند، چنانکه در خبر آمده است. و آن بشارتی است پس از بازگشت مردم از رؤیت (الرؤية)، بلکه آن از جانب خدا برای آن‌ها در کثیب (تپه) هنگام رؤیت در زور اعظم (محل اجتماع بزرگ) است.\n\n### [انتخاب بهشت]\n\nاما انتخاب بهشت (الجنة)، زیرا آن سرای بقای سعادت و نظر (دیدن) است که اهلش را از هر مکروهی که در سرای مقابل آن باشد و آنچه سلطنت اسماء انتقام اقتضا می‌کند، می‌پوشاند.\n\n### [انتخاب رؤیت]\n\nاما انتخاب رؤیت (الرؤية)، زیرا آن غایت بصر (بینایی) است. پس لذت بصری شبیه هیچ لذتی نیست، زیرا آن عین الیقین (عین اليقين) در معبود است.\n\n### [انتخاب عدد نود و نه از میان اعداد]\n\nاما انتخاب عدد نود و نه (التسعة والتسعين) از میان اعداد، به این دلیل است که وتر (فرد) اسماء است که میان آحاد و عقد جمع می‌کند. «همانا برای خدا نود و نه اسم است، صد منهای یکی، هر کس آن‌ها را احصا کند، به بهشت می‌رود»، تنها به واسطه احصا، حفظ، تلفظ و احاطه. زیرا خداوند وتر (فرد) است و وتر را دوست دارد.\n\n### [انتخاب فرائض]\n\nاما انتخاب فرائض (الفرائض)، به این دلیل است که نتیجه آن این است که بنده، نعت (صفت) حق (الحق) باشد، یعنی گوش و چشم او. زیرا محبت نوافل (النوافل) این را می‌دهد که حق (الحق) گوش و چشم بنده باشد. و نفل (النفل) جز در درجه‌ای پایین‌تر از فرض نیست. پس فرض اولویت دارد. و حق (الحق) به دلیل آنچه جلالش اقتضا می‌کند، به این حد تنزل نمی‌کند که گوش بنده باشد. پس ناگزیر باید خداوند با صفت خود تنزل کند، و آن این است که بنده صفت حق (الحق) باشد، به واسطه صورتی که بر آن خلق شده است. پس این از صورت الهی بریده شده است، همان‌گونه که رحم شاخه‌ای از رحمان است. و فرض همان قطع (بریدن) است. پس اگر آن را ادا کند، در آن برای او ظاهر می‌شود که او صفت حق (الحق) است. و اگر نفل به جا آورد، حق (الحق) صفت اوست. پس فرض از نفل متمایز شد و درجه بالاتر برای فرض بود. و اگر فریضه این را نمی‌داد،\nثابت نمی‌شد که بگوید: **جعت فلم تطعمني** (گرسنه شدم و مرا طعام ندادی).\nو **أنا أشد شوقا إلى لقاء عبدي يريد إياي** (من مشتاق‌ترم به دیدار بنده‌ام که مرا می‌خواهد).\nو **فإنه أقرب إلينا من حَبْلِ الْوَرِيدِ** (و او به ما از رگ گردن نزدیک‌تر است).\nو **وما ترددت في شي‏ء أنا فاعله** (و در هیچ کاری که انجام می‌دهم، تردید نکردم).\nو امثال این‌ها از اخبارات الهی.\n\n### [انتخاب شب قدر از سایر شب‌ها]\n\nاما انتخاب شب قدر (ليلة القدر)، به این دلیل است که امور جز به اندازه‌های خود نزد حق (الحق) متمایز نمی‌شوند. و حق (الحق) غیب است. پس قدر را به شب اختصاص داد، زیرا شب پوشاننده است، همان‌گونه که غیب پوشانده می‌شود.\n\n### [انتخاب روز جمعه از میان روزها]\n\nاما انتخاب روز جمعه (يوم الجمعة) از میان روزها، به این دلیل است که در آن دو صورت (صورت الهی و صورت آدمیه) ظاهر شدند. و خداوند آن روز را برای صور قرار داد، و آن ماه پنجم برای سقوط نطفه است. و آن روزی مؤنث است که زینت و تمامیت خلقت را دارد. و خداوند در آن ساعتی از ساعاتش را انتخاب کرد که مانند نقطه‌ای در آینه است، و آن موضع صورت متجلی (المتجلي) از آینه روز است. پس خود را در آن می‌بیند. و خطاب و تکلیف بر صورتی که میان آینه و بیننده در آن ظاهر می‌شود، واقع می‌گردد. و به واسطه آن، اسماء اشاره مانند «ذا» (این)، «ذان» (آن دو)، «تا» (این مؤنث)، «تان» (آن دو مؤنث)، «أولاء» (اینان) و اسماء ضمایر مثل «هو» (او مذکر)، «هی» (او مؤنث)، «هما» (آن دو)، «هم» (ایشان مذکر)، «هن» (ایشان مؤنث)، «ک» (تو مذکر)، «ک» (تو مؤنث)، «کما» (شما دو نفر)، «کم» (شما جمع مذکر)، «کن» (شما جمع مؤنث)، «أنت» (تو مذکر)، «أنت» (تو مؤنث)، «أنتما» (شما دو نفر)، «أنتم» (شما جمع مذکر)، «أنتن» (شما جمع مؤنث) و «یاء» ضمیر متکلم که در «آنیت» (هویت) او تأثیر می‌گذارد، اگر نون وقایه (نون الوقاية) از آن محافظت نکند، حادث می‌شوند. و ناگزیر باید تأثیری داشته باشد، یا در آنیت یا در نون وقایه. و به همین دلیل نون وقایه از عالم حروف، فتوت (جوانمردی) و ایثار را دارد. و به همین دلیل نون وقایه نامیده شد. پس برای آن منزلتی است مانند «کاف» در قول او: «أعوذ بک» (به تو پناه می‌برم). و ما در این باره می‌گوییم:\n> نون الوقاية نون ليس يشبهها *** من الوجود سوى صوم وخلاق‏\n> له الفتوة والإيثار نشأته *** فما لنا غيره في اللفظ من واق‏\n> شطر الوجود له من نعت خالقه *** من المكانة فهو الدائم الباقي‏\n(نون وقایه، نونی است که شبیه آن نیست *** از هستی (الوجود) جز روزه و بهره‌ای نیکو.\nفتوت و ایثار، نشأت اوست *** پس در لفظ جز او نگهدارنده‌ای نداریم.\nنیمی از هستی (الوجود) از وصف خالقش برای اوست *** از نظر مکانت، پس او دائم و باقی است.)\n\n### [انتخاب سه قرن به ترتیب]\n\nاما انتخاب سه قرن (الثلاثة القرون) به ترتیب، به این دلیل است که قرن اول برای ظهور کمال محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در غیب و شهود بود. پس شریعت را خود بنا نهاد و آنچه سنت نوابش بود را با وجود خود نسخ کرد و آنچه را که مقرر کرد، تأیید نمود و ایمان به تمام آن را، چه نسخ شده و چه نسخ نشده، اقرار کرد. و این قرن اول است. سپس دو قرن بعد از او. و همه آن‌ها اهل فتح و ظهور هستند، به منزله سه شب اول ماه (الغرر) از هر ماه. پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «گروهی از مردم به جنگ می‌روند، پس گفته می‌شود: آیا در میان شما کسی هست که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را دیده باشد؟ می‌گویند: بله. پس برای آن‌ها فتح می‌شود. و این قرن اول است. سپس گروهی از مردم به جنگ می‌روند، پس گفته می‌شود: آیا در میان شما کسی هست که کسی را که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را دیده، دیده باشد؟ می‌گویند: بله. پس برای آن‌ها فتح می‌شود. و این قرن دوم است. سپس گروهی از مردم به جنگ می‌روند، پس گفته می‌شود: آیا در میان شما کسی هست که کسی را که کسی را که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را دیده، دیده باشد؟ می‌گویند: بله. پس برای آن‌ها فتح می‌شود. و این قرن سوم است.» و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بر این مقدار اضافه نکرد. و این به دلیل آن است که جز حضرت الهی (الحضرة الإلهية) وجود ندارد، و آن عبارت است از ذات، صفات و افعال. پس این معنای «بهترین قرون» است. و به واسطه عنایت قرن اول، برای همه فتح حاصل شد، و آن ذات رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است. پس قوت نور و سلطنت ظهور او، فتح الهی را به کسی که او را دید، یا کسی که او را دید را دید، یا کسی که کسی را که او را دید را دید، عطا کرد. پس این همان قول اوست: «بهترین قرون، قرن من است، سپس کسانی که به دنبال آن‌ها می‌آیند، سپس کسانی که به دنبال آن‌ها می‌آیند.»\nو ما آن‌ها را به سه شب اول ماه تشبیه کردیم و زمان دعوت او را شبیه ماه قرار دادیم، زیرا در مورد مقدار زمان قرن اختلاف کرده‌اند. از جمله اقوال آن‌ها این است که قرن سی سال است. به همین دلیل، سه قرن از زمان دعوت او تا روز قیامت را به منزله یک ماه قرار دادیم و سه قرن را مانند سه شب اول آن ماه قرار دادیم.\n\n### [انتخاب روزه از میان عبادات]\n\nاما انتخاب روزه (الصوم)،\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به شخصی که از او سؤال کرد، فرمود: **عليك بالصوم فإنه لا مثل له** (بر تو باد به روزه، زیرا هیچ مانندی برای آن نیست).\nپس نفی مثلیت از روزه کرد، و شبیه **لَيْسَ كَمِثْلِهِ شَيْءٌ** (هیچ چیز مانند او نیست) شد. و فرمود: **الصوم لي** (روزه برای من است).\nو تمام عبادات را برای انسان قرار داد، زیرا روزه صفت تنزیه (التنزيه) است و تنزیه جز برای او (تعالی) شایسته نیست.\n\n### [انتخاب رمضان از میان ماه‌ها]\n\nاما انتخاب ماه رمضان (شهر رمضان) از میان ماه‌ها، به دلیل مشارکت آن در اسم است. زیرا رمضان از اسماء الهی (الأسماء الإلهية) است. پس حرمتی برای آن معین شد که برای سایر ماه‌های سال نیست. و آن را از ماه‌های قمری قرار داد تا برکتش تمام ماه‌های سال را فرا گیرد، و در هر ماه از ماه‌های سال ظاهر شود، تا هر روز از روزهای سال بهره‌ای از آن داشته باشد. زیرا بهترین ماه‌ها نزد ما ماه رمضان است، سپس ماه ربیع‌الاول، سپس ماه رجب، سپس شعبان، سپس ذوالحجه، سپس شوال، سپس ذوالقعده، سپس محرم. و علم من در فضیلت ماه‌های قمری تا اینجا پایان می‌یابد. و ترتیب فضیلت در ماه‌های باقی‌مانده سال قمری، یعنی ماه صفر، ربیع‌الآخر، جمادی‌الاول و جمادی‌الآخر، بر من مبهم ماند. یا فضیلت آن‌ها مساوی است، و این بر گمان من غالب است. فإنه أظهر ذلك وما تحققته فلم يتمكن لي أن أقول ما ليس لي به علم (زیرا او آن را آشکار ساخت، اما من آن را محقق نساختم، پس نتوانستم چیزی را که به آن علم ندارم، بگویم).\n\n### [انتخاب آب از میان ارکان]\n\nاما انتخاب رکن آب (الماء) از میان ارکان (عناصر)، به این دلیل است که هر چیز زنده‌ای را از آب قرار داد، حتی عرش را. هنگامی که آن را آفرید، بالاتر از آب نبود. پس حیات در آن از آب جاری شد. پس آن رکن اعظم است، همان‌گونه که گفت: «حج عرفه است». اگرچه سبب حیات چیزهایی همراه آن است، اما آب رکن اعظم از آن چیزهاست.\n\n### [انتخاب عرش از میان افلاک]\n\nاما انتخاب عرش (العرش) از میان افلاک، به دلیل احاطه آن بر تمام اجسام است، و **الله بِكُلِّ شَيْ‏ءٍ مُحِيطٌ** (خداوند بر هر چیزی احاطه دارد). و برای آن اولویت در افلاک است. پس آنچه زیر آن است، او اول و محیط است. پس آن را برای استواء (استقرار) انتخاب کرد، به دلیل شباهت میان دو صفت. و اگر عرش همان مُلک (پادشاهی) باشد، سزاوارتر است که بدون انتخاب باشد، زیرا جز خدا و مُلک او وجود ندارد، و هر چیز غیر او مُلک اوست. اما تمایز آن از غیرش وارد شده است، پس متعین شد که به دلیل اولویت و احاطه انتخاب شده باشد. زیرا آسمان‌ها و زمین در جوف کرسی مانند حلقه‌ای در بیابان هستند، و کرسی در جوف عرش مانند حلقه‌ای در بیابان است.\n\n### [انتخاب فرشتگان از میان بندگان]\n\nو از میان بندگان، فرشتگان (الملائكة) را انتخاب کرد، زیرا آن‌ها از نور آفریده شده‌اند. پس اجسامشان اصالتاً نورانی است. پس نسبت آن‌ها به نور الهی (النور الإلهي) از سایر مخلوقات نزدیک‌تر است. و به همین دلیل،\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) دعا می‌کرد که خداوند او را نور قرار دهد،\nبه دلیل شناختی که از ظلمت طبیعت داشت.\n\n### [انتخاب عماء از میان أینیت‌ها (مکان‌ها)]\n\nو از میان أینیت‌ها (مکان‌ها)، عماء (ابر غلیظ) را انتخاب کرد. پس عماء پیش از خلق خلق برای او بود، و فرشتگان هائم (سرگردان) از آن خلق شدند. پس آن‌ها را در جلال خود سرگردان ساخت. سپس خلق را آفرید، و سرگردانی آن‌ها در جلال جمال او، آن‌ها را از دیدن غیر او مشغول ساخت. آن‌ها کسانی هستند که نمی‌دانند خداوند هیچ کس دیگری را آفریده است. چه حالت شریفی! پس عماء را أینیت (مکان) برای خود قرار داد، و عرش برای استواء (استقرار) اوست، و آسمان دنیا برای نزول اوست، و زمین برای معیت (همراهی) اوست. پس او با ماست هر کجا که باشیم.\n\n### [انتخاب رسولان از میان مردم]\n\nو از میان مردم، رسولان (الرسل) را انتخاب کرد تا آنچه را که امر بر آن است، از جانب خدا ابلاغ کنند. زیرا او آن‌ها را جز برای علم به خود خارج نکرد، چون دوست داشت که شناخته شود. پس به واسطه رسولان و کتاب‌ها و صحیفه‌هایی که به آن‌ها فرستاد، خود را به آن‌ها شناساند. پس او را معرفتی ذاتی (معرفة ذاتية) شناختند، همان‌گونه که او را با عقل‌هایی که برایشان آفرید و به آن‌ها قوت نظر فکری داد، شناختند. پس او را با دلایل و براهین، معرفتی وجودی سلبی (معرفة وجودية سلبية) شناختند. و عقل در استقلال خود بیش از این قوت نداشت. سپس رسولان پس از او با معرفتی ذاتی آمدند. پس خلق، خدایی را که به واسطه شرع خود به آن‌ها شناسانده بود، عبادت کردند. زیرا عقل هیچ عملی از اعمال، یا قربتی از قربات، یا صفت ذاتی ثبوتی برای حق (الحق) نمی‌دهد. و بهره عقل از شرع که دلیلش به تنهایی بر آن استقلال دارد، جز **لَيْسَ كَمِثْلِهِ شَيْءٌ** (هیچ چیز مانند او نیست) با اضافه کاف (کاف تشبیه) نیست، نه با اثبات آن به عنوان صفت. پس رسولان را برای ابلاغ آنچه عقل به تنهایی قادر به درک آن نیست، از علم به ذات او و آنچه از اعمال، ترک‌ها و نسبت‌ها که به او نزدیک می‌کند، انتخاب کرد.\n\n### [انتخاب اسم «الله» از میان اسماء الحسنی]\n\nو از میان اسماء الحسنی (الأسماء الحسنى)، اسم «الله» را انتخاب کرد. پس آن را در کلمات به جایگاه خود نشاند. پس آن اسمی است که به آن توصیف می‌شود، اما خود به چیزی توصیف نمی‌شود. پس تمام اسماء، وصف او هستند و او وصف نمی‌شود. و به همین دلیل در اشتقاق آن تکلف شده است. پس آن اسمی جامد و عَلَم است که برای ذات در عالم کلمات و حروف وضع شده است، و غیر او به آن نامیده نشده است، جل و علا. پس آن را از اشتراک حفظ کرد، همان‌گونه که دلالت کرد که جز او معبودی نیست.\n\n### [اختیارات الهی دعوتی برای عقل‌ها به سوی اختیاری است که همان عبرت‌گیری و بصیرت است]\n\nاین‌ها را از اختیارات الهی (الاختيارات الإلهية) ذکر کردیم که به منزله تنبیهی برای عقل‌های غافل از آنچه به آن دعوت شده‌اند، یعنی عبرت‌گیری (الاعتبار) و بصیرت (الإستبصار) است. و امر را به حد کمال نرساندیم، زیرا ما به طریق احاطه، تفصیل آنچه خداوند از موجودات آفریده است را نمی‌دانیم، اگرچه می‌توانیم به آنچه خداوند ما را بر آن قادر ساخته است، موجودات را محصور کنیم، و در آن هر چیزی داخل می‌شود. و ما در این بخش تنها به معرفت آحاد آنچه او از هر نوعی از مخلوقات محصور در وجود، قائم به نفس و غیر متحیز، و متحیز و غیر متحیز، و نوعی که جز به تبعیت تحیز نمی‌پذیرد، و آنچه از آن تألیف شده و آنچه تألیف نشده، انتخاب و برگزیده است، پرداختیم. و اقسام عالم و موجودات در آنچه ذکر کردیم، محصور شدند.\n\n### [آنچه عقل در اختیار به تنهایی قادر به آن است و آنچه فراتر از سطح اوست]\n\nو سپس تفصیلی نسبی وجود دارد که عقل می‌تواند به تنهایی آن را درک کند، و آن برتری دادن اشیا بر یکدیگر با تمایز مراتب آن‌ها، و انفعال برخی بر برخی دیگر، و تأثیر برخی در برخی دیگر، و توقف برخی بر برخی دیگر است. اما برتری دادن قرب الهی (القرب الإلهي) از طریق عنایت به آن‌ها، نه به واسطه آنچه حقایقشان اقتضا می‌کند، ممکن نیست.\nاین امر جز با شناساندن خدا به ما، از طریق علومی که در قلب‌هایمان الهام می‌کند، یا آنچه از آن در کتاب‌های نازل شده و اخبارات نبوی به ما می‌رساند، محقق نمی‌شود. و راه دیگری جز این وجود ندارد.\n\n### [دلالات عقلی، تعریفات شرعی و عبادات حقیقی]\n\nپس سنن (السنن) دلالات عقلی هستند، زیرا آن‌ها راه‌ها هستند. و فرائض (الفرائض) تعریفات شرعی هستند به آنچه حق تعالی (الحق تعالى) بر آن است، نسبت به خود و نسبت به خلقش. پس ای بندگان خدا، خدا را بر وصفی که خود را در کتابش یا بر زبان رسولانش وصف کرده است، عبادت کنید، بدون هیچ افزایش یا کاهشی، و بدون تأویلی که به کم‌فروشی یا ترجیح منجر شود. بلکه آنچه را که جل جلاله خود را به آن وصف کرده است، تسلیم کنید، حتی اگر محال یا متناقض باشد. زیرا این به دلیل قصور و جهل ما به آنچه امر بر آن است، می‌باشد. و ما آنچه را که قوت عقلی نظری از علم در وجود او و صدق ابلاغ‌کنندگان از جانب او تعالی، آنچه بر بندگانش نازل کرده است، به ما داده است، ادا کردیم. گفتیم: پذیرش بدون اعتراض، حتی اگر امر متناقض و محال باشد. زیرا آنچه برای عقل مجهول بالذات است، چگونه می‌تواند آن را در آنچه به ذات او باز می‌گردد، از وجوب یا جواز یا استحاله، دخالت دهد؟ پس عقل از حد خود تجاوز نمی‌کند و آنچه را که سبحانه نازل کرده و ما را به آن شناسانده است، تسلیم می‌کند. زیرا خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و او راه را هدایت می‌کند). پس بر ماست که به او و آنچه از نزد او آمده است، در علم او در کتاب و بر زبان رسول، ایمان بیاوریم. و خداوند ما را برای توقف در این حد موفق بدارد. زیرا جز هلاک شونده، بر خدا هلاک نمی‌شود. پایان جزء نود و پنجم.\n\nبه نام خداوند بخشنده مهربان."
  },
  "page_count": 8
}