{
  "id": 247,
  "title": {
    "ar": "الباب السابع والأربعون ومائتان في الصحو",
    "en": "Chapter Two Hundred and Forty-Seven, Concerning Sobriety (الصحو)",
    "ur": "باب دو سو سینتالیس: صحو (صحو) کے بیان میں",
    "fa": "باب دویست و چهل و هفتم در صحو (صحو)"
  },
  "content": {
    "ar": "## «الباب السابع والأربعون ومائتان في الصحو»\n\n\n> الصحو يأتي بعين العلم والأدب *** إن لم يكن صيلما للحكم والسبب‏\n\n\n> ووارد الصحو أقوى عند طائفة *** من وارد السكر إذ يغني عن الطرب‏\n\n\n> واللهو تحيا به كل النفوس وما *** في وارد الصحو من لهو ومن لعب‏\n\n\n> لذاك قواه أقوام وأضعفه *** قوم وعندي فحكم الوقت للنسب‏\n\n\n### [الصحو عند القوم رجوع إلى الإحساس بعد الغيبة بوارد قوي‏]\n\n\nاعلم أن الصحو عند القوم رجوع إلى الإحساس بعد الغيبة بوارد قوي واعلم أنهم قد جعلوا في حد السكر أنه وارد قوي وكذلك الصحو أنه وارد قوي وما قالوا إنه أقوى وذلك أن المحل الموصوف بالسكر والصحو لهذين الواردين مع استوائهما في القوة فيتمانعان بل وارد السكر أولى فإنه صاحب المحل فله المنع ولكن لا يتمكن لورود وارد على محل إلا بنسبة واستعداد من المحل يطلب بتلك النسبة أو الاستعداد ذلك الوارد المناسب وإن تساوت الواردات فإذا جاء الوارد وفي المحل غيره فوجد النسبة والاستعداد يطلبه حكم عليه وأزال عنه حكم الوارد الآخر الذي كان فيه لا لقوته وضعف الآخر بل للنسبة والاستعداد\n\n\n### [الصحو لا يمكن إلا بعد السكر]\n\n\nواعلم أنه لا يكون صحو في هذا الطريق إلا بعد سكر وأما قبل السكر فليس بصاح ولا هو صاحب صحو وإنما يقال فيه ليس بصاحب سكر بل يكون صاحب حضور أو بقاء وغير ذلك ثم اعلم أن صحو كل سكران بحسب سكره على ميزان صحيح فلا بد أن يأتي بعلم محقق استفاده في غيبة سكره فإن كان صحوه صيلما فما كان قط سكران سكر الطريق إذ العلم شرط في الصاحي من السكر هكذا هو طريق أهل الله لأن الجود الإلهي ما فيه بخل ولا في قدرته عجز فإذا صحا كتم ما ينبغي أن يكتم وأذاع ما ينبغي أن يذاع وقوله في حال صحوه مقبول لأنه شاهد عدل وقول السكران وإن كان شاهد عدل فإنه لا يقبل إذا ناقض قول الصاحي وإن كان حقا ولكن إذا قيل الحق في غير موطنه لم يقبل وربما عاد وباله على قائله مع كونه حقا إذ كل قول حق لا يكون محمودا عند الله وهذا معلوم مقرر في شرع الله في العموم والخصوص كالشبلي والحلاج فقال الشبلي شربت أنا والحلاج من كأس واحد فصحوت وسكر فعربد فحبس حتى قتل والحلاج في الخشبة مقطوع الأطراف قبل أن يموت فبلغه قول الشبلي فقال هكذا يزعم الشبلي لو شرب ما شربت لحل به مثل ما حل بي أو قال مثل قولي فقبلنا قول الشبلي ورجحناه على قول الحلاج لصحوه وسكر الحلاج فالصحو بالله والسكر بالله لا بد فيه من علم بالله وما لا يعطي علما فليس بصحو الطريق ولا سكره وقد تقدم تقسيم السكر فذلك التقسيم يرد على الصحو فإنه لكل سكر صحو إن لم يمت صاحب السكر في حال سكره فيكون صحوه في‏\nالبرزخ ومنهم من يبقى على سكره في البرزخ إلى البعث‏\n\n\n### [تقدم السكر الطبيعي أو العقلي على السكر الإلهي‏]\n\n\nواعلم أنه إن تقدم للعبد سكر طبيعي أو عقلي ثم أزالهما أو أحدهما السكر الإلهي فالسكر الإلهي صحو من هذا السكر الذي كان في المحل وإن لم يتقدم لصاحب السكر الإلهي في المحل سكر عقلي ولا طبيعي فليس سكره الإلهي بصحو بل هو حال سكر ورد عليه ومعنى الصحو أنه ينكشف له حق الله في الأمور التي استفادها في حال سكره فيعلم عند صحوه ما ينبغي أن يذاع منها في العموم والخصوص وما ينبغي أن يستر فإن كان قد أذاع منها في حال سكره شيئا فيعطيه الصحو أن يستغفر الله من ذلك وعذره مقبول وإنما يستغفر لأن السكران لا بد أن يبقى فيه من الإحساس ما يكون معه الطرب فلو لم يبق معه إحساس لكان مثل النائم يرتفع عنه القلم أي لا يلزمه الاستغفار وهذا الفرق بين السكران والمجنون وإن كان كل واحد منهما من أهل الإحساس فإن المجنون ارتفع عنه الحكم ولم يرتفع عن السكران ومن حاله الاستغفار مما ظهر منه ما هو مثل حال من لم يقع منه ما يوجب الاستغفار فإن الاستغفار عندنا في طريق الله يكون في مقامين المقام الواحد ما ذكرناه وهو أن يبدو منه ما ينبغي أن يكون مستورا فيجب عليه الاستغفار من ذلك وقد يقع الاستغفار ممن لم يبد منه شي‏ء يوجب الاستغفار فيستغفر من هذا مقامه أي يطلب أن يستره الله في كنف عنايته أن يحكم عليه حال من شأنه إذا لم يستره الله في كنف عنايته أن يبدو منه بحكم ذلك الحال ما ينبغي أن يستر وهذا هو المقام الثاني الذي لأهل الاستغفار فيبتدءون بطلب الستر من الله عن حكم حال يوجب عليهم الاعتذار من وقوعه وهذا هو استغفار الأكابر من الرجال المعصومين ولذلك ما سمع من نبي قط في حال نزول الوحي عليه كلام حتى يسرى عنه فإذا صحا حينئذ يخبر بما يجب ولهذا ما نقل عن نبي قط أنه ندم على ما قاله مما أوحي إليه فيه وأما ما كان عن نظر من غير وارد وحي فقد يمكن أن يرجع عن ذلك ويندم على ما جرى منه في ذلك وقد وقع منه مثل هذا في أسارى بدر وسوق الهدى في حجة الوداع وغير ذلك ولما كان في الصحو انكشاف لمراتب الأمور قدمناه في الفضيلة على السكر أي صاحبه مقبول الحكم لمعرفته بالمواطن وإن كان السكران صاحب حق أ لا ترى الصحو في السماء إذا أصحت أي زال غيمها وانكشفت لتعطي الشمس من حرارتها لما يخرج من الأرض من النبات وتسخين العالم لأن لها أثرا في ذلك كما أعطى الغيم ما في قوته من الرطوبة في الأرض لأجل ذلك النبات فأفاد حال السكر وحال الصحو في الطبيعة فإذا لم تقع فائدة عند السكران في الطريق ولا عند الصاحي منه فما هو من أهل الطريق بل يكون كالصحو الذي معه القحط المسمى صيلما وهو الذي أشرنا إليه في الأبيات في أول هذا الباب فصحو السكر كله أدب وعلم والناس فيه متفاضلون تفاضلهم في السكر\n\n\n> فكل سكر له احتكام *** وكل صحو له ثبات‏\n\n\n### [الصاحين إما أن يصحو بربه وإما بنفسه‏]\n\n\nواعلم أن من الصاحين من يصحو بربه ومنهم من يصحو بنفسه والصاحي بربه لا يخاطب في صحوه إلا ربه ولا يسمع إلا منه فلا يقع له عين إلا على ربه في جميع الموجودات وهو على أحد مقامين إما أن يكون يرى الحق من وراء حجاب الأشياء بطريق الإحاطة مثل قوله والله من وَرائِهِمْ مُحِيطٌ وإما أن يرى الحق عين الأشياء وهنا ينقسم رجال الله على قسمين قسم يرى الحق عين الأشياء في الأحكام والصور وقسم يرى الحق عين الأشياء من حيث ما هو قابل لحكم الصور وأحكامها لا من حيث عين الصور فإن الصور من جملة أحكام الأعيان الثابتة فتختلف أحوال رجال الله في صحوهم بالله وأما من صحا بنفسه فإنه لا يرى إلا أشكاله وأمثاله ويقول لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ خاصة ولا يعطي مقامه ولا حاله أن يتم الآية ذوقا وإن تلاها وهو قوله وهُوَ السَّمِيعُ الْبَصِيرُ وصاحب الذوق الأول يقول وهُوَ السَّمِيعُ الْبَصِيرُ ذوقا وتلاوة فيرى صاحب صحو النفس أن الحق في عزلة عنه كما يراه من جعله في قبلته إذا صلى ولا يراه أنه هو المصلي وهذا القدر من الإشارة في معرفة الصحو كاف والصحو والسكر من الألفاظ المحجورة المختصة بالأكوان فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Forty-Seven Concerning Sobriety (الصحو)\n\nSobriety comes with the essence of Knowledge (العلم) and proper Conduct (الأدب),\nUnless it is a barrenness (صيلما) devoid of judgment and cause.\n\nThe Influx (وارد) of Sobriety is stronger, according to one group,\nThan the Influx of Intoxication (السكر), for it dispenses with rapture.\n\nDiversion is what all souls live by, yet\nIn the Influx of Sobriety there is neither diversion nor play.\n\nFor this reason, some people strengthened it, while\nOthers weakened it; but for me, the ruling of the moment belongs to the Relation (النسب).\n\n### [Sobriety, according to the People, is the return to sensation after absence due to a powerful Influx]\n\nKnow that Sobriety (الصحو), according to the People (القوم), is the return to sensation/consciousness (الإحساس) after absence (الغيبة) due to a powerful Influx (وارد قوي). Know that they have defined Intoxication (السكر) as a powerful Influx, and likewise Sobriety as a powerful Influx, but they did not say that one is stronger than the other.\n\nThis is because the locus (المحل) described by Intoxication and Sobriety, having these two Influxes equal in strength, they would counteract each other. Rather, the Influx of Intoxication has priority, for it is the master of the locus, and thus has the power to prevent [the other]. However, no Influx can take hold of a locus except through a Relation (نسبة) and Receptivity (استعداد) within the locus, which, through that Relation or Receptivity, seeks that appropriate Influx, even if the Influxes are equal. Thus, when an Influx arrives while another is present in the locus, and it finds the Relation and Receptivity that seeks it, it takes command over the locus and removes the ruling of the other Influx that was present, not due to its own strength or the weakness of the other, but due to the Relation and Receptivity.\n\n### [Sobriety is not possible except after Intoxication]\n\nKnow that Sobriety (صحو) in this Path (الطريق) does not occur except after Intoxication (سكر). As for the state before Intoxication, one is not sober, nor is one the possessor of Sobriety. Rather, one is described as not being the possessor of Intoxication, but rather the possessor of Presence (حضور) or Subsistence (بقاء), or other such states.\n\nFurthermore, know that the Sobriety of every intoxicated person is commensurate with their Intoxication, according to a sound measure. It must necessarily bring with it verified Knowledge (علم محقق) that was gained during the absence (غيبة) of their Intoxication. If their Sobriety is barrenness (صيلما), then they were never truly intoxicated with the Intoxication of the Path, since Knowledge (العلم) is a prerequisite for the one who becomes sober from Intoxication. This is the way of the People of Allah (أهل الله).\n\nBecause Divine Generosity (الجود الإلهي) contains no stinginess, nor is there incapacity in His Power. When one becomes sober, one conceals what ought to be concealed and discloses what ought to be disclosed. Their speech in the state of Sobriety is accepted because they are a just witness (شاهد عدل). The speech of the intoxicated person, even if they are a just witness, is not accepted if it contradicts the speech of the sober person, even if it is the Truth (الحق). However, when the Truth is spoken in an inappropriate place (غير موطنه), it is not accepted, and its ill consequence may return upon the speaker, despite it being the Truth. This is because not every true statement is praiseworthy in the sight of Allah. This is a known and established principle in the Divine Law (شرع الله), both generally and specifically.\n\n[An example is] like al-Shibli and al-Hallaj. Al-Shibli said: \"Al-Hallaj and I drank from the same cup, but I became sober while he remained intoxicated and acted wildly, so he was imprisoned until he was killed.\" While al-Hallaj was on the cross, with his limbs severed before his death, the saying of al-Shibli reached him. He replied: \"Al-Shibli claims this? If he had drunk what I drank, the same fate would have befallen him as befell me,\" or he said, \"he would have spoken as I spoke.\" We accepted the statement of al-Shibli and preferred it over the statement of al-Hallaj due to al-Shibli's Sobriety and al-Hallaj's Intoxication.\n\nSobriety by Allah and Intoxication by Allah must necessarily involve Knowledge of Allah (علم بالله). That which does not yield Knowledge is neither the Sobriety of the Path nor its Intoxication. The classification of Intoxication has been previously discussed, and that classification applies to Sobriety, for every Intoxication has a Sobriety, unless the possessor of Intoxication dies while in that state, in which case their Sobriety occurs in the Isthmus (البرزخ). And among them are those who remain in their Intoxication in the Isthmus until the Resurrection (البعث).\n\n### [The precedence of natural or intellectual intoxication over Divine Intoxication]\n\nKnow that if a natural (طبيعي) or intellectual (عقلي) intoxication precedes for the servant, and then the Divine Intoxication (السكر الإلهي) removes both of them or one of them, then the Divine Intoxication is a Sobriety from that [prior] intoxication which was in the locus. But if neither intellectual nor natural intoxication preceded the possessor of Divine Intoxication in the locus, then their Divine Intoxication is not a Sobriety, but rather a state of Intoxication that has descended upon them.\n\nThe meaning of Sobriety is that the Reality of Allah (حق الله) is unveiled to the person concerning the matters they gained knowledge of during their state of Intoxication. Thus, upon becoming sober, they know what ought to be disclosed publicly and privately, and what ought to be concealed. If they disclosed anything from these matters during their state of Intoxication, Sobriety grants them the understanding that they must seek Allah’s forgiveness (الاستغفار) for that, and their excuse is accepted. They seek forgiveness only because the intoxicated person must retain some sensation (إحساس) that allows for rapture (الطرب). If no sensation remained, they would be like one asleep, from whom the Pen is lifted [meaning, they would not be obliged to seek forgiveness].\n\nThis is the difference between the intoxicated person and the madman (المجنون), even though both possess sensation. The ruling (الحكم) is lifted from the madman, but it is not lifted from the intoxicated person. The state of seeking forgiveness for what has appeared from them is similar to the state of one from whom nothing has occurred that necessitates seeking forgiveness. Forgiveness (الاستغفار), in our view on the Path of Allah, occurs in two stations (مقامين).\n\nThe first station is what we have mentioned: that something which ought to be concealed appears from them, and they must seek forgiveness for that. Forgiveness may also occur from one from whom nothing necessitating forgiveness has appeared. They seek forgiveness from this station, meaning they ask Allah to conceal them within the shelter of His Providence (كنف عنايته) from being governed by a state (حال) which, if Allah did not conceal them in the shelter of His Providence, would cause something that ought to be concealed to appear by the ruling of that state. This is the second station belonging to the people of forgiveness. They begin by seeking concealment (الستر) from Allah concerning the ruling of a state that would necessitate them offering an excuse for its occurrence. This is the seeking of forgiveness of the great ones (الأكابر) among the protected men (المعصومين).\n\nFor this reason, no speech was ever heard from a Prophet while the Revelation (الوحي) was descending upon him until the state was lifted from him. When he became sober (صحا) then, he would inform [people] of what was necessary. Therefore, it has never been reported that a Prophet regretted anything he said concerning what was revealed to him. However, regarding what came from personal consideration (نظر) without the Influx of Revelation, it is possible for him to retract that and regret what transpired from him concerning it. Such instances occurred regarding the prisoners of Badr, the driving of the sacrificial animals (سوق الهدى) during the Farewell Pilgrimage (حجة الوداع), and other matters.\n\nSince Sobriety involves the unveiling (انكشاف) of the levels of affairs (مراتب الأمور), we prioritize it in virtue over Intoxication, meaning that the judgment of the sober person is accepted due to their knowledge of the proper places (المواطن), even if the intoxicated person is a possessor of the Truth (صاحب حق). Do you not see Sobriety in the sky when it clears (أصحت)—meaning its clouds are removed and it is unveiled—to allow the sun to give of its heat for the vegetation emerging from the earth and for the warming of the cosmos (العالم), because the sun has an effect in that? Just as the cloud gave what was in its power of moisture to the earth for the sake of that vegetation. Thus, the state of Intoxication and the state of Sobriety are beneficial in nature.\n\nIf no benefit occurs for the intoxicated person on the Path, nor for the one who becomes sober from it, then they are not among the People of the Path. Rather, it is like the Sobriety accompanied by drought, called barrenness (صيلما), which we referred to in the couplets at the beginning of this chapter. The Sobriety following Intoxication is entirely proper conduct (أدب) and Knowledge (علم), and people vary in it just as they vary in Intoxication.\n\nFor every Intoxication there is a ruling,\nAnd for every Sobriety there is permanence.\n\n### [The sober ones either achieve Sobriety by their Lord or by themselves]\n\nKnow that among the sober ones, some achieve Sobriety by their Lord (بربه), and some achieve Sobriety by themselves (بنفسه). The one who is sober by their Lord addresses none but their Lord in their Sobriety, and hears only from Him. Their eye falls upon none but their Lord in all existing things (الموجودات). They are upon one of two stations (مقامين):\n\nEither they see The Real (الحق) from behind the veil of things, by way of encompassing, such as His saying: <<وَاللهُ مِن وَرَائِهِم مُّحِيطٌ>> (And Allah is encompassing them from behind), or they see The Real as the very essence of things (عين الأشياء).\n\nHere, the men of Allah (رجال الله) are divided into two groups: one group sees The Real as the very essence of things in their rulings (الأحكام) and forms (الصور); and another group sees The Real as the very essence of things insofar as He is the recipient of the ruling of the forms and their judgments, but not insofar as He is the essence of the forms themselves, for the forms are among the rulings of the Fixed Entities (الأعيان الثابتة). Thus, the states of the men of Allah differ in their Sobriety by Allah.\n\nAs for the one who is sober by themselves (بنفسه), they see only their own shapes and likenesses. They say specifically: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), but their station and state do not grant them the Direct Experience (ذوقا) to complete the verse, even if they recite it, which is His saying: <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (And He is the All-Hearing, the All-Seeing). The possessor of the first Direct Experience (صاحب الذوق الأول) says <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (And He is the All-Hearing, the All-Seeing) both by Direct Experience and recitation. The possessor of Sobriety by the self sees The Real in isolation from them, just as one sees Him who is placed in their direction of prayer (قبلته) when they pray, but does not see that He is the one praying.\n\nThis much indication concerning the knowledge of Sobriety is sufficient. Sobriety and Intoxication are among the restricted terms (الألفاظ المحجورة) specific to the created realms (الأكوان). Understand this. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب دو سو سینتالیس: صحو (Aṣ-Ṣaḥw) کے بیان میں\n\nصحو (Aṣ-Ṣaḥw) عین علم اور ادب کے ساتھ آتا ہے،\nاگر وہ حکم اور سبب کے لیے قحط (صیلم) نہ ہو۔\nاور صحو (Aṣ-Ṣaḥw) کا وارد (Al-Wārid) ایک گروہ کے نزدیک سکر (As-Sukr) کے وارد (Al-Wārid) سے زیادہ قوی ہے، کیونکہ وہ طرب (وجد) سے بے نیاز کر دیتا ہے۔\nاور لہو (دل بہلاوا) سے تمام نفوس زندہ ہوتے ہیں، جبکہ صحو (Aṣ-Ṣaḥw) کے وارد (Al-Wārid) میں کوئی لہو یا کھیل نہیں ہے۔\nاسی لیے کچھ لوگوں نے اسے قوی قرار دیا اور کچھ نے اسے کمزور، اور میرے نزدیک وقت کا حکم نسبت (An-Nisbah) کے لیے ہے۔\n\n[اہلِ طریقت کے نزدیک صحو (Aṣ-Ṣaḥw) ایک قوی وارد (Al-Wārid) کے ذریعے غیبت (Al-Ghaybah) کے بعد احساس (Al-Iḥsās) کی طرف لوٹنا ہے]\n\nجان لو کہ اہل طریقت کے نزدیک صحو (Aṣ-Ṣaḥw) ایک قوی وارد (Al-Wārid) کے ذریعے غیبت (Al-Ghaybah) کے بعد احساس (Al-Iḥsās) کی طرف لوٹنا ہے۔ اور جان لو کہ انہوں نے سکر (As-Sukr) کی تعریف میں اسے ایک قوی وارد (Al-Wārid) قرار دیا ہے، اور اسی طرح صحو (Aṣ-Ṣaḥw) کو بھی قوی وارد (Al-Wārid) قرار دیا ہے، لیکن انہوں نے یہ نہیں کہا کہ یہ زیادہ قوی ہے۔ اس کی وجہ یہ ہے کہ وہ محل (Al-Maḥall) جو سکر (As-Sukr) اور صحو (Aṣ-Ṣaḥw) سے موصوف ہوتا ہے، ان دونوں واردات (Al-Wāridāt) کے لیے، اگرچہ وہ قوت میں برابر ہوں، تو وہ ایک دوسرے کو روکتے ہیں۔ بلکہ سکر (As-Sukr) کا وارد (Al-Wārid) زیادہ حقدار ہے، کیونکہ وہ محل (Al-Maḥall) کا مالک ہے، لہٰذا اسے روکنے کا حق ہے۔ لیکن کسی وارد (Al-Wārid) کا کسی محل (Al-Maḥall) پر وارد ہونا ممکن نہیں ہوتا مگر محل (Al-Maḥall) کی طرف سے ایک نسبت (An-Nisbah) اور استعداد (Al-Isti'dād) کے ساتھ، جو اس نسبت (An-Nisbah) یا استعداد (Al-Isti'dād) کے ذریعے اس مناسب وارد (Al-Wārid) کا طالب ہو۔ اگرچہ واردات (Al-Wāridāt) برابر ہوں، جب کوئی وارد (Al-Wārid) آتا ہے اور محل (Al-Maḥall) میں اس کے علاوہ کوئی اور وارد (Al-Wārid) موجود ہو، اور وہ نسبت (An-Nisbah) اور استعداد (Al-Isti'dād) کو پاتا ہے جو اسے طلب کرتی ہے، تو وہ اس پر حکم لگاتا ہے اور دوسرے وارد (Al-Wārid) کے حکم کو جو اس میں تھا، زائل کر دیتا ہے۔ یہ اس کی قوت کی وجہ سے نہیں ہوتا اور نہ ہی دوسرے کی کمزوری کی وجہ سے، بلکہ نسبت (An-Nisbah) اور استعداد (Al-Isti'dād) کی وجہ سے ہوتا ہے۔\n\n[صحو (Aṣ-Ṣaḥw) سکر (As-Sukr) کے بعد ہی ممکن ہے]\n\nاور جان لو کہ اس طریق (طریقت) میں صحو (Aṣ-Ṣaḥw) سکر (As-Sukr) کے بعد ہی ہوتا ہے۔ سکر (As-Sukr) سے پہلے کی حالت میں وہ نہ تو صاحبِ صحو (Aṣ-Ṣaḥw) ہوتا ہے اور نہ ہی اسے صاحبِ صحو (Aṣ-Ṣaḥw) کہا جاتا ہے۔ بلکہ اس کے بارے میں یہ کہا جاتا ہے کہ وہ صاحبِ سکر (As-Sukr) نہیں ہے، بلکہ وہ صاحبِ حضور یا بقا (Al-Baqā') یا کوئی اور حال رکھتا ہے۔ پھر جان لو کہ ہر سکران (مست) کا صحو (Aṣ-Ṣaḥw) اس کے سکر (As-Sukr) کے مطابق ایک صحیح میزان پر ہوتا ہے۔ لہٰذا ضروری ہے کہ وہ ایک محقق علم (Al-'Ilm) لے کر آئے جو اس نے اپنے سکر (As-Sukr) کی غیبت (Al-Ghaybah) میں حاصل کیا تھا۔ اگر اس کا صحو (Aṣ-Ṣaḥw) قحط (صیلم) ہو، تو وہ کبھی بھی طریق (طریقت) کا سکران (مست) نہیں تھا، کیونکہ سکر (As-Sukr) سے صحو (Aṣ-Ṣaḥw) پانے والے کے لیے علم (Al-'Ilm) شرط ہے۔ اہل اللہ کا طریق (طریقت) ایسا ہی ہے، کیونکہ جودِ الٰہی میں کوئی بخل نہیں اور نہ ہی اس کی قدرت میں کوئی عجز ہے۔ جب وہ صحو (Aṣ-Ṣaḥw) پاتا ہے تو وہ اسے چھپاتا ہے جسے چھپانا ضروری ہے اور اسے ظاہر کرتا ہے جسے ظاہر کرنا ضروری ہے۔ اور صحو (Aṣ-Ṣaḥw) کی حالت میں اس کا قول مقبول ہوتا ہے کیونکہ وہ عادل گواہ ہے۔ اور سکران (مست) کا قول، اگرچہ وہ عادل گواہ ہو، لیکن اگر وہ صاحبِ صحو (Aṣ-Ṣaḥw) کے قول سے متصادم ہو تو قبول نہیں کیا جاتا، اگرچہ وہ حق ہی ہو۔ لیکن جب حق کو اس کے غیر محل (محل) میں کہا جائے تو وہ قبول نہیں ہوتا، اور بسا اوقات اس کے کہنے والے پر اس کا وبال لوٹ آتا ہے، باوجود اس کے کہ وہ حق ہو۔ کیونکہ ہر حق بات اللہ کے نزدیک محمود نہیں ہوتی۔ اور یہ بات شرعِ الٰہی میں عموم و خصوص کے ساتھ معلوم اور مقرر ہے، جیسے شبلی اور حلاج کا معاملہ۔ شبلی نے کہا: \"میں اور حلاج ایک ہی جام سے پیے، تو میں نے صحو (Aṣ-Ṣaḥw) پایا اور وہ سکر (As-Sukr) میں رہا، پس اس نے شور مچایا، تو اسے قید کر دیا گیا یہاں تک کہ وہ قتل ہو گیا۔\" اور حلاج تختہ دار پر تھا، مرنے سے پہلے اس کے اعضاء کاٹے جا چکے تھے، جب اسے شبلی کا قول پہنچا تو اس نے کہا: \"شبلی ایسا گمان کرتا ہے، اگر اس نے وہ پیا ہوتا جو میں نے پیا، تو اس پر بھی وہی گزرتا جو مجھ پر گزرا، یا اس نے بھی وہی کہا ہوتا جو میں نے کہا۔\" پس ہم نے شبلی کے قول کو قبول کیا اور اسے حلاج کے قول پر ترجیح دی، اس کے صحو (Aṣ-Ṣaḥw) اور حلاج کے سکر (As-Sukr) کی وجہ سے۔ پس صحو (Aṣ-Ṣaḥw) باللہ اور سکر (As-Sukr) باللہ میں علم باللہ کا ہونا ضروری ہے۔ اور جو حال علم (Al-'Ilm) نہ دے، وہ نہ تو طریق (طریقت) کا صحو (Aṣ-Ṣaḥw) ہے اور نہ ہی اس کا سکر (As-Sukr)۔ سکر (As-Sukr) کی تقسیم پہلے بیان ہو چکی ہے، اور وہی تقسیم صحو (Aṣ-Ṣaḥw) پر بھی لاگو ہوتی ہے، کیونکہ ہر سکر (As-Sukr) کے لیے صحو (Aṣ-Ṣaḥw) ہے، بشرطیکہ صاحبِ سکر (As-Sukr) اپنی سکر (As-Sukr) کی حالت میں فوت نہ ہو جائے، ورنہ اس کا صحو (Aṣ-Ṣaḥw) برزخ میں ہو گا، اور ان میں سے کچھ ایسے بھی ہیں جو برزخ میں بعث (دوبارہ اٹھائے جانے) تک اپنے سکر (As-Sukr) پر باقی رہیں گے۔\n\n[سکرِ طبعی یا سکرِ عقلی کا سکرِ الٰہی پر مقدم ہونا]\n\nاور جان لو کہ اگر بندے پر سکرِ طبعی یا سکرِ عقلی مقدم ہو، پھر سکرِ الٰہی ان دونوں کو یا ان میں سے کسی ایک کو زائل کر دے، تو یہ سکرِ الٰہی اس سکر (As-Sukr) سے صحو (Aṣ-Ṣaḥw) ہو گا جو محل (Al-Maḥall) میں تھا۔ اور اگر صاحبِ سکرِ الٰہی پر محل (Al-Maḥall) میں کوئی سکرِ عقلی یا طبعی مقدم نہ ہو، تو اس کا سکرِ الٰہی صحو (Aṣ-Ṣaḥw) نہیں ہو گا، بلکہ یہ ایک سکر (As-Sukr) کا حال ہو گا جو اس پر وارد ہوا ہے۔ اور صحو (Aṣ-Ṣaḥw) کا مطلب یہ ہے کہ اس کے لیے ان امور میں حق (Al-Ḥaqq) کا انکشاف ہو جائے جو اس نے اپنے سکر (As-Sukr) کی حالت میں حاصل کیے تھے، پس وہ اپنے صحو (Aṣ-Ṣaḥw) کے وقت جانتا ہے کہ ان میں سے کیا عموم و خصوص میں ظاہر کیا جانا چاہیے اور کیا چھپایا جانا چاہیے۔ اگر اس نے اپنے سکر (As-Sukr) کی حالت میں ان میں سے کچھ ظاہر کر دیا تھا، تو صحو (Aṣ-Ṣaḥw) اسے یہ توفیق دیتا ہے کہ وہ اس پر اللہ سے استغفار کرے۔ اور اس کا عذر مقبول ہے۔ وہ استغفار اس لیے کرتا ہے کہ سکران (مست) میں احساس (Al-Iḥsās) کا کچھ حصہ باقی رہنا ضروری ہے جس کے ساتھ طرب (وجد) ہوتا ہے۔ اگر اس میں احساس (Al-Iḥsās) باقی نہ رہتا تو وہ سونے والے کی طرح ہوتا جس سے قلم اٹھا لیا جاتا ہے، یعنی اس پر استغفار لازم نہیں ہوتا۔ اور یہی سکران (مست) اور مجنون کے درمیان فرق ہے، اگرچہ ان میں سے ہر ایک اہل احساس (Al-Iḥsās) میں سے ہے۔ مجنون سے حکم اٹھا لیا گیا ہے، جبکہ سکران (مست) سے نہیں اٹھایا گیا۔ اور اس کا حال یہ ہے کہ جو کچھ اس سے ظاہر ہوا ہے اس پر استغفار کرنا اس شخص کے حال کی طرح ہے جس سے کوئی ایسی چیز واقع نہیں ہوئی جو استغفار کو واجب کرے۔ کیونکہ ہمارے نزدیک طریقِ اللہ میں استغفار دو مقامات پر ہوتا ہے: پہلا مقام وہ ہے جو ہم نے ذکر کیا، یعنی اس سے ایسی چیز ظاہر ہو جائے جسے مستور (چھپا ہوا) ہونا چاہیے، تو اس پر اس سے استغفار کرنا واجب ہو جاتا ہے۔ اور کبھی استغفار اس شخص سے بھی واقع ہوتا ہے جس سے کوئی ایسی چیز ظاہر نہیں ہوئی جو استغفار کو واجب کرے۔ وہ اپنے اس مقام سے استغفار کرتا ہے، یعنی وہ یہ طلب کرتا ہے کہ اللہ اسے اپنی عنایت کے پردے میں چھپا لے کہ اس پر کوئی ایسا حال غالب نہ ہو جائے جس کی شان یہ ہو کہ اگر اللہ اسے اپنی عنایت کے پردے میں نہ چھپائے تو اس حال کے حکم سے اس سے وہ چیز ظاہر ہو جائے جسے چھپانا ضروری ہے۔ اور یہ اہل استغفار کا دوسرا مقام ہے۔ پس وہ اللہ سے ایسے حال کے حکم سے پردہ پوشی طلب کرنے سے ابتدا کرتے ہیں جو ان پر اس کے وقوع پر معذرت کو واجب کرے۔ اور یہ معصوم بزرگوں کا استغفار ہے۔ اسی لیے کسی نبی سے وحی کے نزول کی حالت میں کوئی کلام نہیں سنا گیا جب تک کہ وہ حال ان سے زائل نہ ہو جائے۔ جب وہ صحو (Aṣ-Ṣaḥw) پاتے ہیں، تب وہ اس چیز کی خبر دیتے ہیں جو واجب ہے۔ اور اسی لیے کسی نبی سے یہ منقول نہیں کہ انہوں نے اس بات پر نادم ہوئے ہوں جو انہوں نے وحی کے ذریعے کہی ہو۔ البتہ جو بات وحی کے وارد (Al-Wārid) کے بغیر محض نظر سے ہو، تو ممکن ہے کہ وہ اس سے رجوع کریں اور جو کچھ ان سے اس بارے میں سرزد ہوا اس پر نادم ہوں۔ اور ایسا ان سے بدر کے قیدیوں کے معاملے میں، اور حجۃ الوداع میں قربانی کے جانوروں کو ہانکنے کے معاملے میں، اور دیگر مواقع پر بھی واقع ہوا ہے۔ اور چونکہ صحو (Aṣ-Ṣaḥw) میں امور کے مراتب کا انکشاف ہوتا ہے، اس لیے ہم نے اسے سکر (As-Sukr) پر فضیلت میں مقدم رکھا، یعنی اس کا صاحب (صاحبِ صحو) اپنے مواطن (مقامات) کی معرفت (Al-Ma'rifah) کی وجہ سے مقبول الحکم ہوتا ہے، اگرچہ سکران (مست) بھی صاحبِ حق ہو۔ کیا تم آسمان میں صحو (Aṣ-Ṣaḥw) کو نہیں دیکھتے جب وہ صاف ہو جاتا ہے، یعنی اس کا بادل چھٹ جاتا ہے اور وہ کھل جاتا ہے تاکہ سورج اپنی حرارت سے زمین سے نکلنے والی نباتات کو دے اور عالم کو گرم کرے، کیونکہ اس میں اس کا اثر ہوتا ہے، جیسا کہ بادل نے اس نباتات کی خاطر زمین میں اپنی قوت میں موجود رطوبت دی۔ پس سکر (As-Sukr) کا حال اور صحو (Aṣ-Ṣaḥw) کا حال دونوں نے طبیعت میں فائدہ دیا۔ پس اگر طریق (طریقت) میں سکران (مست) کے پاس کوئی فائدہ نہ ہو اور نہ ہی صاحبِ صحو (Aṣ-Ṣaḥw) کے پاس، تو وہ اہل طریق (طریقت) میں سے نہیں ہے۔ بلکہ وہ اس صحو (Aṣ-Ṣaḥw) کی طرح ہو گا جس کے ساتھ قحط ہو، جسے صیلم کہا جاتا ہے، جس کی طرف ہم نے اس باب کے شروع میں اشعار میں اشارہ کیا تھا۔ پس سکر (As-Sukr) کا صحو (Aṣ-Ṣaḥw) مکمل طور پر ادب (Al-Adab) اور علم (Al-'Ilm) ہے، اور لوگ اس میں اسی طرح ایک دوسرے سے افضل ہیں جس طرح وہ سکر (As-Sukr) میں ایک دوسرے سے افضل ہیں۔\n\nپس ہر سکر (As-Sukr) کے لیے ایک حکم ہے،\nاور ہر صحو (Aṣ-Ṣaḥw) کے لیے ایک ثبات ہے۔\n\n[صاحی (صحو پانے والے) یا تو اپنے رب کے ذریعے صحو پاتے ہیں یا اپنے نفس کے ذریعے]\n\nاور جان لو کہ صحو (Aṣ-Ṣaḥw) پانے والوں میں سے کچھ وہ ہیں جو اپنے رب کے ذریعے صحو (Aṣ-Ṣaḥw) پاتے ہیں اور کچھ وہ ہیں جو اپنے نفس کے ذریعے صحو (Aṣ-Ṣaḥw) پاتے ہیں۔ جو اپنے رب کے ذریعے صحو (Aṣ-Ṣaḥw) پاتا ہے، وہ اپنے صحو (Aṣ-Ṣaḥw) میں صرف اپنے رب سے مخاطب ہوتا ہے اور صرف اسی سے سنتا ہے۔ پس تمام موجودات میں اس کی نظر صرف اپنے رب پر پڑتی ہے۔ اور وہ دو مقامات میں سے کسی ایک پر ہوتا ہے: یا تو وہ حق (Al-Ḥaqq) کو اشیاء کے پردے کے پیچھے سے احاطہ (گھیرنے) کے طریقے پر دیکھتا ہے، جیسا کہ اس کا قول ہے: **﴿وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ﴾** (اور اللہ انہیں ہر طرف سے گھیرے ہوئے ہے) [البروج: 20]۔ یا پھر وہ حق (Al-Ḥaqq) کو عین اشیاء دیکھتا ہے۔ اور یہاں اہل اللہ دو قسموں میں تقسیم ہو جاتے ہیں: ایک قسم وہ ہے جو حق (Al-Ḥaqq) کو احکام اور صورتوں میں عین اشیاء دیکھتی ہے، اور دوسری قسم وہ ہے جو حق (Al-Ḥaqq) کو عین اشیاء اس حیثیت سے دیکھتی ہے کہ وہ صورتوں اور ان کے احکام کو قبول کرنے والا ہے، نہ کہ عین صورتوں کی حیثیت سے، کیونکہ صورتیں اعیانِ ثابتہ (Al-A'yān ath-Thābitah) کے احکام میں سے ہیں۔ پس اللہ کے بندوں کے احوال ان کے صحو (Aṣ-Ṣaḥw) باللہ میں مختلف ہوتے ہیں۔ اور جو اپنے نفس کے ذریعے صحو (Aṣ-Ṣaḥw) پاتا ہے، وہ صرف اپنی شکلوں اور مثالوں کو دیکھتا ہے اور خاص طور پر **﴿لَيْسَ كَمِثْلِهِ شَيْءٌ﴾** (اس کی مثل کوئی چیز نہیں) کہتا ہے، اور اس کا مقام اور حال اسے یہ اجازت نہیں دیتا کہ وہ آیت کو ذوق (Adh-Dhauq) کے ساتھ مکمل کرے، اگرچہ وہ اسے تلاوت کرتا ہو، جو کہ اس کا قول ہے: **﴿وَهُوَ السَّمِيعُ الْبَصِيرُ﴾** (اور وہی سننے والا، دیکھنے والا ہے)۔ جبکہ پہلے ذوق (Adh-Dhauq) کا صاحب **﴿وَهُوَ السَّمِيعُ الْبَصِيرُ﴾** (اور وہی سننے والا، دیکھنے والا ہے) کو ذوق (Adh-Dhauq) اور تلاوت دونوں کے ساتھ کہتا ہے۔ پس صحو (Aṣ-Ṣaḥw) بالنفس کا صاحب یہ دیکھتا ہے کہ حق (Al-Ḥaqq) اس سے الگ تھلگ ہے، جیسا کہ وہ شخص دیکھتا ہے جو نماز پڑھتے وقت اسے اپنے قبلے میں رکھتا ہے، اور یہ نہیں دیکھتا کہ وہ خود ہی نماز پڑھنے والا ہے۔ اور صحو (Aṣ-Ṣaḥw) کی معرفت (Al-Ma'rifah) میں اشارے کی یہ مقدار کافی ہے۔ اور صحو (Aṣ-Ṣaḥw) اور سکر (As-Sukr) ان الفاظ میں سے ہیں جو اکوان (مخلوقات) کے ساتھ مخصوص اور محصور ہیں۔ پس سمجھ لو۔ اور اللہ حق (Al-Ḥaqq) فرماتا ہے اور وہی راہ دکھاتا ہے۔",
    "fa": "باب دویست و چهل و هفتم در صحو (Sobriety/Awakening)\n\nصحو با عین علم و ادب می‌آید، اگر صیلم (صیلم) حکم و سبب نباشد.\nو وارد (وارد) صحو نزد گروهی قوی‌تر از وارد سکر (سکر) است، زیرا از طرب (وجد) بی‌نیاز می‌کند.\nو لهو است که همه نفوس به آن زنده می‌شوند، در حالی که در وارد صحو نه لهوی هست و نه بازی‌ای.\nبه همین دلیل، اقوامی آن را تقویت کردند و اقوامی تضعیفش نمودند؛ اما نزد من، حکم وقت تابع نسبت (نسبت) است.\n\n### [صحو نزد اهل طریقت، بازگشت به احساس پس از غیبت به واسطه وارد قوی است]\n\nبدان که صحو (صحو) نزد اهل طریقت (القوم)، بازگشت به احساس (الإحساس) پس از غیبت (الغيبة) به واسطه یک وارد (وارد) قوی است. و بدان که آنان در تعریف سکر (سکر) گفته‌اند که آن یک وارد قوی است، و همچنین صحو نیز وارد قوی است، اما نگفته‌اند که یکی از دیگری قوی‌تر است. زیرا محلی که به سکر و صحو توصیف می‌شود، با وجود تساوی این دو وارد در قدرت، مانع یکدیگر می‌شوند؛ بلکه وارد سکر اولویت دارد، زیرا او صاحب محل است و حق منع دارد. اما هیچ واردی نمی‌تواند بر محلی وارد شود مگر به واسطه نسبت (النسبة) و استعدادی (الاستعداد) از جانب آن محل که به واسطه آن نسبت یا استعداد، آن وارد مناسب را طلب می‌کند. حتی اگر واردات مساوی باشند، هرگاه واردی بیاید و در محل، وارد دیگری باشد، اگر نسبت و استعدادی را بیابد که آن را می‌طلبد، بر آن حکم می‌راند و حکم وارد دیگری را که در آن بود، از بین می‌برد؛ نه به دلیل قوت آن و ضعف دیگری، بلکه به دلیل نسبت و استعداد.\n\n### [صحو جز پس از سکر ممکن نیست]\n\nو بدان که در این طریقت، صحو (صحو) جز پس از سکر (سکر) رخ نمی‌دهد. اما پیش از سکر، شخص نه صاحی (هوشیار) است و نه صاحب صحو؛ بلکه درباره او گفته می‌شود که صاحب سکر نیست، بلکه صاحب حضور یا بقا (البقاء) یا غیر آن است. سپس بدان که صحو هر سکرانی بر اساس سکر او و بر میزان صحیح است؛ پس ناگزیر باید با علم محققی بیاید که در غیبت سکر خود کسب کرده است. اگر صحو او صیلم (صیلم) باشد، هرگز سکرانِ سکرِ طریقت نبوده است، زیرا علم شرط صاحی شدن از سکر است. این چنین است طریقت اهل الله. زیرا در جود الهی بخل نیست و در قدرت او عجز راه ندارد. پس هرگاه صاحی شود، آنچه را که باید کتمان کند، کتمان می‌کند و آنچه را که باید آشکار سازد، آشکار می‌سازد. و سخن او در حال صحو پذیرفته است، زیرا او شاهد عادل است. و سخن سکران، اگرچه شاهد عادل باشد، پذیرفته نمی‌شود اگر با سخن صاحی در تناقض باشد، حتی اگر حق باشد. اما اگر حق در غیر جایگاه خود گفته شود، پذیرفته نمی‌شود و چه بسا وبال آن به گوینده‌اش بازگردد، با وجود اینکه حق است؛ زیرا هر سخن حقی نزد خداوند ستوده نیست. این امر در شریعت خداوند، در عموم و خصوص، معلوم و مقرر است. مانند شبلی و حلاج. شبلی گفت: من و حلاج از یک جام نوشیدیم، من صاحی شدم و او سکران شد و عربده کشید، پس زندانی شد تا کشته شد. حلاج در حالی که بر چوبه دار بود و اعضایش قطع شده بود، پیش از مرگش، سخن شبلی به او رسید. گفت: شبلی چنین می‌پندارد؛ اگر او آنچه را که من نوشیدم، می‌نوشید، همان بر سرش می‌آمد که بر سر من آمد، یا همان سخن مرا می‌گفت. پس ما سخن شبلی را پذیرفتیم و به دلیل صحو او و سکر حلاج، آن را بر سخن حلاج ترجیح دادیم. پس صحو به حق (الحق) و سکر به حق، ناگزیر باید همراه با علم به حق باشد. و آنچه علم ندهد، نه صحو طریقت است و نه سکر آن. تقسیم سکر پیش از این گذشت، و آن تقسیم بر صحو نیز وارد می‌شود؛ زیرا هر سکر را صحویی است، مگر اینکه صاحب سکر در حال سکر خود بمیرد، که در این صورت صحو او در برزخ خواهد بود. و برخی از آنان تا برزخ بر سکر خود باقی می‌مانند تا روز بعث.\n\n### [تقدم سکر طبیعی یا عقلی بر سکر الهی]\n\nو بدان که اگر سکر (سکر) طبیعی یا عقلی بر بنده پیشی گرفته باشد، سپس سکر الهی آن دو یا یکی از آن دو را از بین ببرد، سکر الهی، صحو (صحو) از آن سکر است که در محل وجود داشت. و اگر سکر عقلی یا طبیعی بر صاحب سکر الهی در محل پیشی نگرفته باشد، سکر الهی او صحو نیست، بلکه حال سکر است که بر او وارد شده است. و معنای صحو این است که حق (حق) خداوند در اموری که در حال سکر خود کسب کرده، بر او منکشف می‌شود. پس در هنگام صحو می‌داند که چه چیزی از آن امور باید در عموم و خصوص آشکار شود و چه چیزی باید پوشیده بماند. اگر در حال سکر خود چیزی از آن امور را آشکار کرده باشد، صحو به او این امکان را می‌دهد که از آن استغفار کند و عذرش پذیرفته است. و استغفار می‌کند، زیرا سکران ناگزیر باید مقداری از احساس (الإحساس) در او باقی بماند که طرب همراه آن باشد. اگر هیچ احساسی در او باقی نمانده بود، مانند شخص خوابیده بود که قلم از او برداشته می‌شود، یعنی استغفار بر او لازم نمی‌شد. این تفاوت بین سکران و مجنون است؛ اگرچه هر دوی آنها از اهل احساس هستند، اما حکم از مجنون برداشته شده و از سکران برداشته نشده است. و حال کسی که استغفار می‌کند از آنچه از او ظاهر شده، مانند حال کسی است که چیزی از او سر نزده که موجب استغفار شود. زیرا استغفار نزد ما در طریقت الله در دو مقام است: مقام اول همان است که ذکر کردیم، یعنی اینکه چیزی از او آشکار شود که باید پوشیده می‌ماند، پس استغفار از آن بر او واجب می‌شود. و گاهی استغفار از کسی سر می‌زند که چیزی از او آشکار نشده که موجب استغفار باشد؛ او از این مقام خود استغفار می‌کند، یعنی می‌خواهد که خداوند او را در پناه عنایت خود بپوشاند تا حالی بر او حکم نکند که اگر خداوند او را در پناه عنایت خود نپوشاند، به حکم آن حال، چیزی از او آشکار شود که باید پوشیده بماند. این مقام دوم اهل استغفار است؛ آنان با طلب پوشش از خداوند در برابر حکم حالی آغاز می‌کنند که وقوع آن، عذرخواهی را بر ایشان واجب می‌سازد. این استغفار بزرگان از مردان معصوم است. به همین دلیل، هرگز از هیچ پیامبری در حال نزول وحی سخنی شنیده نشد تا زمانی که آن حال از او برطرف می‌شد. پس هرگاه صاحی می‌شد، آنچه را که واجب بود، خبر می‌داد. و به همین دلیل، هرگز از هیچ پیامبری نقل نشده که از آنچه در مورد آن به او وحی شده بود، پشیمان شده باشد. اما آنچه از روی نظر شخصی و بدون وارد وحی بود، ممکن است از آن بازگردد و از آنچه از او سر زده، پشیمان شود. و مانند این در مورد اسیران بدر و سوق الهدی در حجة الوداع و غیر آن از او واقع شده است. و چون در صحو (صحو)، انکشاف مراتب امور وجود دارد، آن را در فضیلت بر سکر (سکر) مقدم داشتیم؛ یعنی حکم صاحب آن به دلیل معرفتش به جایگاه‌ها پذیرفته است، اگرچه سکران نیز صاحب حق باشد. آیا نمی‌بینی صحو را در آسمان، هنگامی که صاف می‌شود، یعنی ابری از آن برطرف می‌شود و منکشف می‌گردد تا خورشید از حرارت خود برای روییدن گیاهان از زمین و گرم کردن عالم ببخشد، زیرا در این امر تأثیر دارد؟ همان‌گونه که ابر آنچه را در قوت خود داشت از رطوبت به زمین داد برای آن گیاه. پس حال سکر و حال صحو در طبیعت فایده رساندند. اگر در سکران طریقت و نه در صاحیِ از آن، فایده‌ای حاصل نشود، او از اهل طریقت نیست، بلکه مانند صحویی است که همراه با قحطی است و صیلم (صیلم) نامیده می‌شود، که در ابیات ابتدای این باب به آن اشاره کردیم. پس صحوِ سکر، تماماً ادب و علم است و مردم در آن متفاضل‌اند، همان‌گونه که در سکر متفاضل‌اند.\n\nپس هر سکر را حکمی است، و هر صحو را ثباتی.\n\n### [صاحیان یا به واسطه پروردگارشان صاحی می‌شوند یا به واسطه نفسشان]\n\nو بدان که برخی از صاحیان (الصاحين) به واسطه پروردگارشان صاحی می‌شوند و برخی به واسطه نفس خود. صاحی به پروردگارش در صحو خود جز با پروردگارش سخن نمی‌گوید و جز از او نمی‌شنود. پس چشم او در تمام موجودات جز بر پروردگارش نمی‌افتد. و او بر یکی از دو مقام است: یا حق (الحق) را از پس حجاب اشیاء، از طریق احاطه می‌بیند، مانند این قول: **«وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ»** (و خداوند از پشت سرشان بر آنان احاطه دارد)؛ و یا حق را عین اشیاء می‌بیند. و در اینجا رجال الله (مردان خدا) به دو دسته تقسیم می‌شوند: دسته‌ای که حق را عین اشیاء در احکام و صور می‌بینند، و دسته‌ای که حق را عین اشیاء می‌بینند از آن جهت که پذیرای حکم صور و احکام آنهاست، نه از جهت عین صور؛ زیرا صور از جمله احکام اعیان ثابته هستند. پس احوال رجال الله در صحو (صحو) به حق متفاوت است. اما کسی که به نفس خود صاحی شده، جز اشکال و امثال خود را نمی‌بیند و به طور خاص می‌گوید: **«لَيْسَ كَمِثْلِهِ شَيْءٌ»** (چیزی مانند او نیست)؛ اما مقام و حال او اجازه نمی‌دهد که آیه را از روی ذوق (تجربه باطنی) کامل کند، اگرچه آن را تلاوت کند، و آن ادامه آیه است: **«وَهُوَ السَّمِيعُ الْبَصِيرُ»** (و او شنوای بیناست). و صاحب ذوق اول، **«وَهُوَ السَّمِيعُ الْبَصِيرُ»** را هم از روی ذوق و هم از روی تلاوت می‌گوید. صاحب صحو نفس می‌بیند که حق (الحق) در عزلت از اوست، همان‌گونه که کسی که او را در قبله خود قرار داده است، هنگام نماز می‌بیند، اما نمی‌بیند که او خود نمازگزار است. و این مقدار اشاره در معرفت صحو کافی است. و صحو (صحو) و سکر (سکر) از الفاظ محجوب و مختص به اکوان (موجودات) هستند، پس بفهم. و خداوند **«يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}