{
  "id": 212,
  "title": {
    "ar": "الباب الثاني عشر ومائتان في التلوين",
    "en": "Chapter Two Hundred and Twelve, On Fluctuation (التلوين)",
    "ur": "۲۱۲ واں باب تلوین کے بیان میں",
    "fa": "باب دویست و دوازدهم در تلوین (التلوين)"
  },
  "content": {
    "ar": "## «الباب الثاني عشر ومائتان في التلوين»\n\n\n> إن التلون من حال إلى حال *** دليل صدق على العالي من الحالي‏\n\n\nضد العاطل‏\n\n\n> فمن تحقق بالأنفاس يعرفه *** بالحال فيه كمثل الحال في الحال‏\n\n\n> فالفعل ماض وآت ثم بينهما *** فعل يسمى بفعل الآن والحال‏\n\n\nحال أهل النحو\n\n\n> فالحال زائلة والحال دائمة *** وهو الصحيح الذي قد قيل في الحال‏\n\n\nحال أهل النظر\n\n\n### [التلوين مقام ناقص وهو تلون العبد في أحواله‏]\n\n\nاعلم أن التلوين عند أكثر الجماعة مقام ناقص وهو تلون العبد في أحواله وأنشدوا في ذلك‏\n\n\n> كل يوم تتلون *** غير هذا بك أجمل‏\n\n\nإلى أن قال بعضهم علامة الحقيقة رفع التلوين بظهور الاستقامة فلو لم يزد بظهور الاستقامة لكان قد نبه على علم غامض محقق فلما زاد هذه اللفظة أفسد الأمر والتحق في حده بالقائلين بنقصه وقالت طائفة بل التلوين هو علامة على صاحبه بأنه متحقق محقق كامل إلهي وهو الذي أرتضيه وهو مذهبي وبه أقول وعلى قدر تمكنه في التلوين يكون كماله وبهذا نحد التمكين فنقول التمكين في التلوين هو التمكين فمن لم يتمكن لم يتلون الأمر عنده وآيته من كتاب الله كُلَّ يَوْمٍ هُوَ في شَأْنٍ فنكر وقالت هذه الطائفة في التلوين بزيادة لو سكتت عنها لكان أولى إذ ليس للتقييد بها تلك الفائدة وهو قولها لأن في التلوين إظهار قدرة القادر فيكشف منه العبد الغيرية وهذه الزيادة إجمالية تدل على ما ذهبنا إليه والتلوين نعت إلهي وكل نعت إلهي كمال إذ لا يتصور في ذلك الجناب نقص أصلا بوجه ولا نسبة وما تكمل المقامات والأمر إلا أن تكون من النعوت الإلهية فإن الكمال لله على الإطلاق وهو قوله في استشهادنا يَسْئَلُهُ من في السَّماواتِ والْأَرْضِ كُلَّ يَوْمٍ هُوَ في شَأْنٍ وليس التلوين غير هذا فيدخل في مذهبنا مذهب الجماعة\nفإنه أعم وأكبر إحاطة ولا يدخل مذهبنا في مذهبهم‏\n\n\n### [أن الشي‏ء لا يتكرر في الوجود]\n\n\nاعلم أنه من علم إن الاتساع الإلهي لا يقتضي أن يكون شي‏ء في الوجود مكررا علم إن التلوين هو الصحيح في الكون فإنه دليل على السعة الإلهية فمن لم يقف من نفسه ولا من غيره على اختلاف آثار الحق فيه في كل نفس فلا معرفة له بالله وما هو من أهل هذا المقام وهو من أهل الجهل بالله وبنفسه وبالعالم فليبك على نفسه فقد خسر حياته وما أورثهم هذا الجهل إلا التشابه فإن الفارق قد يخفى بحيث لا يشعر به فلا أقل أن يعلم أن ثم ما لا يشعر به فيكون عالما بأنه متلون في نفسه ولا يعرف فيما تلون ولا ما ورد عليه قال تعالى وأُتُوا به مُتَشابِهاً أي يشبه بعضه بعضا فيتخيل إن الثاني عين الأول وليس كذلك بل هو مثله والفارق بين المثلين في أشياء يعسر إدراكه بالمشاهدة إلا من شاهد الحق أو تحقق بمشاهدة الحرباء فلا دليل من الحيوانات على نعت الحق ب كُلَّ يَوْمٍ هُوَ في شَأْنٍ أدل من الحرباء فما في العالم صفة ولا حال تبقي زمانين ولا صورة تظهر مرتين والعلم يصحب الأول والآخر ف هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ فلون ووحد الهوية في الكثرة فمن لم يقدر على تقرير الوحدة في الكثرة جعل هذه الصفات نسبا وإضافات لوجوه مختلفة وهذا مذهب النظار وأما الطائفة فأقرت الهوية والوحدة وجعلت الوجه الذي هو منه أول هو عينه منه آخر وظاهر وباطن صرح بذلك أبو سعيد الخراز فرجال الله ما أثبتوا للحق إلا ما هم عليه ولا يثبت في الكون وفي جميع المخلوقات إلا ما هو الحق عليه فارتبط الكل بالكل وضرب الواحد في الواحد فلم يتضاعف بل هو عين ما ضرب وكذلك ما يضرب في الواحد أو يضرب الواحد فيه من واحد أو كثرة لا يتضاعف بل هو عين ما ضرب فهكذا الأمر فالتلوين ضرب الواحد في الكثرة فلا يظهر سوى عين تلك الكثرة المضروب فيها الواحد أو المضروبة في الواحد والحق واحد بلا شك وضرب الشي‏ء في الشي‏ء نسبته إليه ونحن كثيرون عن عين واحدة جلت وتعالت انتسبت إليها إيجادا وانتسبنا إليها وجودا فمن عرف نفسه خلقا وموجودا عرف الحق خالقا موجدا فإذا نظرت إلى أحدية العالم ضربت الواحد في الواحد وإذا نظرت إلى العالم ضربت الواحد في الكثير والعالم أثر أسمائه والأثر كما قدمنا صورة الاسم في اللوائح فما ضربت أحدية الحق إلا في صور أسمائه فما زلت عنه فلم يخرج بعد الضرب إلا هو والأسماء كثيرة كذا ورد الخبر الإلهي فيها من التسعة والتسعين فما فوقها مما يعلم ومما لا يعلم والعين واحدة والألوان مراتب والتلوين نسبة إليها فإن قلت واحد صدقت وإن قلت كثيرون صدقت فإن أسماء الله كثيرة لمعان مختلفة والله الهادي‏\n\n\n«بسم الله الرحمن الرحيم»\n\n",
    "en": "Chapter 212: Concerning Coloration (التلوين)\n\n> Indeed, the change of state (التلون) from one state (حال) to another\n> is a sign of truthfulness regarding the elevated aspect of the state.\n> It is the opposite of the idle one.\n\n> So whoever is realized through the moments (الأنفاس) knows it\n> by the state (الحال) within it, just like the state within the state.\n\n> The Act is past and future, and between them\n> is an Act called the Act of the Now and the State (الحال).\n\nThe State of the Grammarians\n\n> The state (الحال) is transient, and the state is permanent,\n> and this is the correct view that has been stated regarding the state.\n\nThe State of the Speculative Thinkers\n\n### [Coloration (التلوين) is an imperfect station, being the servant's change in his states]\n\nKnow that Coloration (التلوين), according to most of the community (الجماعة), is an imperfect station (مقام ناقص), being the servant's change in his states (أحواله). They recited concerning this:\n\n> Every day you change color,\n> something other than this is more beautiful for you.\n\nUntil some of them said that the sign of Reality (الحقيقة) is the removal of Coloration through the manifestation of Rectitude (الاستقامة). Had he not added \"through the manifestation of Rectitude,\" he would have drawn attention to a subtle, verified knowledge. But when he added this phrase, he corrupted the matter and joined, in his definition, those who assert its imperfection.\n\nAnother group said: Rather, Coloration is a sign of its possessor being a realized, verifying, Divine Perfect One (كامل إلهي). This is what I approve of, and it is my doctrine, and by it I speak. His perfection is commensurate with his establishment (تمكنه) in Coloration. By this, we define Establishment (التمكين), saying: Establishment in Coloration is true Establishment. Whoever is not established will not find the matter colored for him. The sign of this from the Book of Allah is: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is engaged in some affair), which is indefinite.\n\nThis group spoke concerning Coloration with an addition that, had they omitted it, would have been better, as restricting it does not yield that benefit. This is their saying: \"Because in Coloration is the manifestation of the power of the Powerful One (القادر), and through it the servant unveils Otherness (الغيرية).\" This addition is general and points to what we have adopted. Coloration is a Divine Attribute (نعت إلهي), and every Divine Attribute is Perfection (كمال), since imperfection is absolutely inconceivable in that Divine Presence (الجناب) in any way or relation. The stations (المقامات) and the matter are only perfected by being among the Divine Attributes. For Perfection belongs to Allah absolutely. This is confirmed by His saying, which we use as evidence: <<يَسْئَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (All those in the heavens and the earth ask Him. Every day He is engaged in some affair). Coloration is nothing other than this, so the doctrine of the community enters into our doctrine, for ours is more general and greater in scope, but our doctrine does not enter into theirs.\n\n### [That the Thing is Not Repeated in Existence]\n\nKnow that whoever understands that the Divine Vastness (الاتساع الإلهي) does not necessitate that anything in Existence (الوجود) be repeated, knows that Coloration (التلوين) is the truth in the Cosmos (الكون), for it is proof of the Divine Vastness. Whoever does not perceive in himself or in others the difference in the effects (آثار) of the Real (الحق) in every moment (نفس) has no Gnosis (معرفة) of Allah. He is not among the people of this station, but rather among the people of ignorance concerning Allah, himself, and the World (العالم). Let him weep for himself, for he has lost his life.\n\nThis ignorance was only inherited by them through Similarity (التشابه), for the distinguishing factor may be so subtle that one does not perceive it. At the very least, he should know that there is something he does not perceive, thus knowing that he is colored (متلون) in himself, even if he does not know in what he is colored or what has descended upon him. Allah the Exalted said: <<وَأُتُوا بِهِ مُتَشَابِهًا>> (And they were brought it in similarity) [Q. 2:25], meaning that parts resemble other parts, leading to the imagination that the second is the very essence of the first. This is not the case; rather, it is its like. The distinguishing factor between two likes lies in things whose perception is difficult through direct witnessing (المشاهدة), except for one who witnesses the Real or is realized through the witnessing of the chameleon (الحرباء). There is no proof among animals for the Divine Attribute of <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is engaged in some affair) more indicative than the chameleon. There is no attribute (صفة) or state (حال) in the World that remains for two moments, nor a form that appears twice.\n\nKnowledge accompanies the First and the Last, for <<هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ>> (He is the First and the Last, the Manifest and the Hidden) [Q. 57:3]. Thus, He colored and unified the Identity (الهوية) in Multiplicity (الكثرة). Whoever is unable to establish Unity (الوحدة) in Multiplicity makes these Attributes relations and additions corresponding to different aspects. This is the doctrine of the Speculative Thinkers (النظار). As for our group (الطائفة), they affirmed the Identity and the Unity, and made the aspect from which He is First to be precisely the aspect from which He is Last, Manifest, and Hidden. Abu Sa'id al-Kharraz explicitly stated this.\n\nThe Men of Allah (رجال الله) only affirm for the Real (الحق) what they themselves are upon, and nothing is established in the Cosmos (الكون) and in all creatures except what the Real is upon. Thus, the whole is linked to the whole, and the One is multiplied by the One, and it does not double, but remains the very essence of what was multiplied. Likewise, whatever is multiplied by the One, or the One is multiplied by it, whether it be one or multiplicity, it does not double, but remains the very essence of what was multiplied. This is the nature of the matter. Coloration is the multiplication of the One into Multiplicity, so nothing appears except the very essence of that Multiplicity into which the One is multiplied, or which is multiplied into the One. The Real is One without doubt, and the multiplication of a thing by a thing is its relation to it. We are many, originating from a Single Essence (عين واحدة), Glorified and Exalted is It. We are related to It by origination (إيجاد), and we are related to It by existence (وجود). Whoever knows himself as created (خلقاً) and existent (موجوداً) knows the Real as Creator (خالقاً) and Originator (موجداً).\n\nIf you look at the Oneness of the World (أحدية العالم), you multiply the One by the One. If you look at the World, you multiply the One by the Many. The World is the effect (أثر) of His Names (أسمائه). The effect, as we previously established, is the form of the Name in the Manifestations (اللوائح). The Oneness of the Real (أحدية الحق) was only multiplied into the forms of His Names, so He did not depart from it, and nothing emerged after the multiplication except Him. The Names are many, as the Divine Report states concerning them, from the ninety-nine and above, both what is known and what is unknown. The Essence (العين) is one, and the colors (الألوان) are levels (مراتب), and Coloration is a relation to them. If you say \"One,\" you speak truly, and if you say \"Many,\" you speak truly, for the Names of Allah are many, corresponding to different meanings. And Allah is the Guide.",
    "ur": "باب دو سو بارہ: تلوین (تبدیلیِ احوال) کے بیان میں\n\n> بے شک ایک حال سے دوسرے حال کی طرف تلوین (تبدیلی) ہونا، صاحبِ حال کے لیے اس کے بلند مرتبے کی سچی دلیل ہے۔\n\n(یہ) بے عمل کے برعکس ہے۔\n\n> پس جو شخص انفاس (لمحات) کے ذریعے متحقق ہوا، وہ اسے حال میں جانتا ہے، جیسے ایک حال میں دوسرے حال کا ہونا۔\n\n> پس فعل ماضی ہے اور آنے والا ہے، پھر ان دونوں کے درمیان ایک فعل ہے جسے فعلِ الآن (موجودہ لمحہ) اور فعلِ حال کہا جاتا ہے۔\n\nاہلِ نحو (گرامر) کا حال\n\n> پس حال زائل ہونے والا بھی ہے اور حال دائمی بھی ہے، اور یہی وہ صحیح بات ہے جو حال کے بارے میں کہی گئی ہے۔\n\nاہلِ نظر (فلسفیوں) کا حال\n\n### [تلوین ایک ناقص مقام ہے اور یہ بندے کا اپنے احوال میں متلون ہونا ہے]\n\nجان لو کہ اکثر جماعت کے نزدیک تلوین (تبدیلیِ احوال) ایک ناقص مقام ہے، اور یہ بندے کا اپنے احوال میں متلون (رنگ بدلنا) ہونا ہے۔ اور انہوں نے اس بارے میں یہ شعر پڑھا:\n\n> تو ہر روز رنگ بدلتا ہے، تیرے لیے اس کے علاوہ زیادہ خوبصورت ہے۔\n\nیہاں تک کہ ان میں سے بعض نے کہا کہ حقیقت کی علامت استقامت کے ظہور کے ذریعے تلوین کا ختم ہو جانا ہے۔ اگر وہ \"استقامت کے ظہور\" کا اضافہ نہ کرتا تو اس نے ایک گہرے محقق علم کی طرف متوجہ کیا ہوتا۔ لیکن جب اس نے یہ لفظ بڑھا دیا تو اس نے معاملے کو خراب کر دیا اور اپنی تعریف میں ان لوگوں کے ساتھ شامل ہو گیا جو اس کے ناقص ہونے کے قائل ہیں۔ اور ایک گروہ نے کہا: بلکہ تلوین (تبدیلیِ احوال) اپنے صاحب کے لیے اس بات کی علامت ہے کہ وہ متحقق، محقق، کامل اور الٰہی (انسان) ہے۔ اور یہی وہ رائے ہے جسے میں پسند کرتا ہوں، اور یہی میرا مسلک ہے، اور میں اسی کا قائل ہوں۔ اور تلوین میں اس کے تمکین (استحکام) کی مقدار کے مطابق ہی اس کا کمال ہوتا ہے۔ اور اسی سے ہم تمکین کی تعریف کرتے ہیں، پس ہم کہتے ہیں کہ تلوین میں تمکین ہی اصل تمکین ہے۔ پس جو شخص تمکن (استحکام) حاصل نہیں کرتا، اس کے نزدیک معاملہ متلون نہیں ہوتا۔ اور اس کی دلیل اللہ کی کتاب سے یہ آیت ہے: كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (وہ ہر دن ایک نئی شان میں ہوتا ہے)۔ پس اس نے (شان کو) نکرہ (غیر معین) بیان کیا۔ اور اس گروہ نے تلوین کے بارے میں ایک ایسا اضافہ کیا کہ اگر وہ اس پر خاموش رہتے تو بہتر ہوتا، کیونکہ اس قید سے وہ فائدہ حاصل نہیں ہوتا۔ اور وہ ان کا یہ قول ہے کہ: \"کیونکہ تلوین میں قادر کی قدرت کا اظہار ہوتا ہے، پس بندہ اس سے غیریت (الگ ہونے کا تصور) کو الکشف (کشف) کرتا ہے۔\" اور یہ اضافہ اجمالی ہے جو ہمارے مسلک کی طرف اشارہ کرتا ہے۔ اور تلوین ایک نعتِ الٰہیہ (صفتِ الٰہی) ہے، اور ہر نعتِ الٰہیہ کمال ہے، کیونکہ اس جناب (ذات حق) میں کسی بھی صورت یا نسبت سے نقص کا تصور ہی نہیں کیا جا سکتا۔ اور مقامات اور معاملہ مکمل نہیں ہوتے مگر یہ کہ وہ نعوت الٰہیہ میں سے ہوں۔ کیونکہ کمال مطلقاً اللہ ہی کے لیے ہے۔ اور ہمارے استدلال میں اس کا قول ہے: يَسْئَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (آسمانوں اور زمین میں جو کوئی بھی ہے، وہ اسی سے سوال کرتا ہے، وہ ہر دن ایک نئی شان میں ہوتا ہے)۔ اور تلوین اس کے علاوہ کچھ نہیں ہے۔ پس ہمارا مسلک جماعت کے مسلک کو اپنے اندر شامل کر لیتا ہے، کیونکہ ہمارا مسلک زیادہ عام اور احاطہ میں بڑا ہے، جبکہ ان کا مسلک ہمارے مسلک میں داخل نہیں ہوتا۔\n\n### [یہ کہ کوئی شے وجود (الوجود) میں مکرر نہیں ہوتی]\n\nجان لو کہ جس نے یہ جان لیا کہ اتساعِ الٰہی (الٰہی وسعت) اس بات کا تقاضا نہیں کرتی کہ وجود (الوجود) میں کوئی شے مکرر (دہرائی ہوئی) ہو، تو اس نے جان لیا کہ کائنات میں تلوین (تبدیلیِ احوال) ہی صحیح ہے۔ کیونکہ یہ وسعتِ الٰہیہ کی دلیل ہے۔ پس جو شخص اپنے آپ میں یا کسی اور میں ہر لمحے (نفس) الحق (ذات حق) کے آثار کے اختلاف پر واقف نہیں ہوتا، اسے اللہ کی کوئی المعرفۃ (معرفت) حاصل نہیں، اور وہ اس مقام کے اہل میں سے نہیں ہے۔ بلکہ وہ اللہ، اپنے نفس اور عالم سے جہالت رکھنے والوں میں سے ہے۔ پس اسے چاہیے کہ وہ اپنے اوپر روئے، کیونکہ اس نے اپنی زندگی کو خسارے میں ڈال دیا۔ اور اس جہالت نے انہیں تشابہ (یکسانیت کا وہم) کے سوا کچھ نہیں دیا۔ کیونکہ فرق کبھی اتنا پوشیدہ ہوتا ہے کہ اس کا شعور نہیں ہوتا۔ پس کم از کم اسے یہ معلوم ہونا چاہیے کہ وہاں کچھ ایسا ہے جس کا اسے شعور نہیں، تاکہ وہ یہ جاننے والا ہو کہ وہ اپنے نفس میں متلون (تبدیل) ہو رہا ہے، لیکن اسے یہ معلوم نہیں کہ وہ کس چیز میں متلون ہوا اور اس پر کیا وارد ہوا۔ اللہ تعالیٰ نے فرمایا: وَأُتُوا بِهِ مُتَشَابِهًا (اور انہیں وہ چیز دی جائے گی جو آپس میں ملتی جلتی ہوگی)۔ یعنی وہ ایک دوسرے سے مشابہت رکھتی ہے، پس یہ گمان کیا جاتا ہے کہ دوسری شے پہلی شے کی عین (حقیقت) ہے، حالانکہ ایسا نہیں ہے، بلکہ وہ اس کی مثل ہے۔ اور دو مثلوں کے درمیان فرق ایسی چیزوں میں ہوتا ہے جن کا ادراک مشاہدہ سے مشکل ہوتا ہے، سوائے اس کے جو الحق (ذات حق) کا الشہود (شہود) کرے، یا گرگٹ (حرباء) کے مشاہدے سے متحقق ہو۔ پس حیوانات میں سے کوئی بھی دلیل الحق (ذات حق) کی نعت (صفت) كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (وہ ہر دن ایک نئی شان میں ہوتا ہے) پر گرگٹ سے زیادہ دلالت کرنے والی نہیں ہے۔ پس عالم میں کوئی صفت یا حال ایسا نہیں جو دو لمحوں تک باقی رہے، اور نہ کوئی صورت ایسی ہے جو دو بار ظاہر ہو۔ اور علم اول اور آخر کے ساتھ ہے۔ پس هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ (وہی اول ہے اور وہی آخر ہے اور وہی ظاہر ہے اور وہی باطن ہے)۔ پس اس نے رنگ بدلا اور کثرت میں ہویت (ذات) کو واحد رکھا۔ پس جو شخص کثرت میں وحدت کو قائم کرنے پر قادر نہیں ہوا، اس نے ان صفات کو مختلف وجوہ کے لیے نسبتیں اور اضافات بنا دیا۔ اور یہ اہلِ نظر (فلسفیوں) کا مسلک ہے۔ لیکن (صوفیاء کی) جماعت نے ہویت (ذات) اور وحدت کو تسلیم کیا، اور اس وجہ کو جس سے وہ اول ہے، وہی وجہ قرار دیا جس سے وہ آخر، ظاہر اور باطن ہے۔ ابو سعید الخراز نے اس کی صراحت کی ہے۔ پس رجال اللہ (اللہ کے بندوں) نے الحق (ذات حق) کے لیے وہی ثابت کیا جو وہ خود ہیں۔ اور کائنات میں اور تمام مخلوقات میں وہی ثابت ہوتا ہے جو الحق (ذات حق) پر ہے۔ پس سب کا سب سے ربط قائم ہو گیا، اور واحد کو واحد میں ضرب دی گئی، تو وہ دوگنا نہیں ہوا، بلکہ وہ عین وہی ہے جسے ضرب دی گئی۔ اور اسی طرح جو چیز واحد میں ضرب دی جاتی ہے یا واحد اس میں ضرب دیا جاتا ہے، خواہ وہ واحد ہو یا کثرت، وہ دوگنا نہیں ہوتا، بلکہ وہ عین وہی ہے جسے ضرب دی گئی۔ پس معاملہ اسی طرح ہے۔ تلوین (تبدیلیِ احوال) واحد کو کثرت میں ضرب دینا ہے، پس اس کثرت کی عین (حقیقت) کے سوا کچھ ظاہر نہیں ہوتا جس میں واحد کو ضرب دی گئی یا جسے واحد میں ضرب دی گئی۔ اور الحق (ذات حق) بلاشبہ واحد ہے۔ اور کسی شے کو کسی شے میں ضرب دینا اس کی نسبت اس کی طرف کرنا ہے۔ اور ہم ایک ہی عین (حقیقت) سے کثیر ہیں جو جلیل اور بلند ہے۔ اس نے ایجاد کے لحاظ سے اپنی طرف نسبت کی اور ہم نے وجود (الوجود) کے لحاظ سے اس کی طرف نسبت کی۔ پس جس نے اپنے آپ کو خلق اور موجود کے طور پر پہچانا، اس نے الحق (ذات حق) کو خالق اور موجد کے طور پر پہچانا۔ پس جب تم عالم کی احدیت (یکتائی) کی طرف دیکھتے ہو تو تم واحد کو واحد میں ضرب دیتے ہو، اور جب تم عالم کی طرف دیکھتے ہو تو تم واحد کو کثیر میں ضرب دیتے ہو۔ اور عالم اس کے اسماء کا اثر ہے، اور اثر جیسا کہ ہم پہلے بیان کر چکے ہیں، لوائح (ظہورات) میں اسم کی صورت ہے۔ پس الحق (ذات حق) کی احدیت (یکتائی) کو اس کے اسماء کی صورتوں کے سوا کسی میں ضرب نہیں دی گئی، پس وہ اس سے زائل نہیں ہوا، اور ضرب کے بعد اس کے سوا کچھ ظاہر نہیں ہوا۔ اور اسماء کثیر ہیں، جیسا کہ ان کے بارے میں الٰہی خبر میں ننانوے اور اس سے اوپر کا ذکر آیا ہے، ان میں سے جو معلوم ہیں اور جو معلوم نہیں ہیں۔ اور عین (حقیقت) ایک ہے، اور رنگ مراتب ہیں، اور تلوین (تبدیلیِ احوال) ان کی طرف ایک نسبت ہے۔ پس اگر تم کہو کہ وہ واحد ہے تو تم نے سچ کہا، اور اگر تم کہو کہ وہ کثیر ہیں تو تم نے سچ کہا، کیونکہ اللہ کے اسماء کثیر ہیں لمعان مختلفہ (مختلف معانی) کے لیے۔ اور اللہ ہی ہدایت دینے والا ہے۔\n\nبسم اللہ الرحمن الرحیم",
    "fa": "«باب دویست و دوازدهم در تلوّن (التلوين)»\n\nهمانا تلوّن (التلوين) از حالی به حال دیگر،\nدلیل صدق است بر عالیِ صاحب حال.\n\n**ضد عاطل (بیکار)**\n\nپس هر که به نَفَس‌ها (دم‌ها) تحقق یابد، او را می‌شناسد،\nبه حال در او، همچون حال در حال.\n\nپس فعل، گذشته و آینده است، سپس میان آن دو،\nفعلی است که به فعل اکنون و حال نامیده می‌شود.\n\n**حال اهل نحو**\n\nپس حال (وضعیت) زوال‌پذیر است و حال (صفت) دائمی است،\nو این همان سخن صحیحی است که درباره حال گفته شده است.\n\n**حال اهل نظر**\n\n### [تلوّن (التلوين) مقامی ناقص است و آن تغییر حال بنده در احوالش است]\n\nبدان که تلوّن (التلوين) نزد بیشتر این جماعت، مقامی ناقص است و آن عبارت است از تغییر حال بنده در احوالش. و در این باره سروده‌اند:\n\nهر روز تلوّن می‌یابی،\nغیر از این برای تو زیباتر است.\n\nتا آنجا که برخی از آنان گفتند: نشانه حقیقت، برداشته شدن تلوّن (التلوين) با ظهور استقامت است. اگر او [آن شخص] عبارت «با ظهور استقامت» را اضافه نمی‌کرد، بر علمی غامض و محقق تنبیه کرده بود. اما چون این لفظ را افزود، امر را تباه ساخت و در تعریف خود به کسانی پیوست که قائل به نقص تلوّن هستند. و گروهی دیگر گفتند: بلکه تلوّن (التلوين) نشانه‌ای است بر صاحبش که او متحقق، محقق و کامل الهی است؛ و این همان چیزی است که من می‌پسندم و مذهب من است و به آن قائل هستم. و کمال او به اندازه تمکن (التمكين) او در تلوّن است. و با این تعریف، تمکین (التمكين) را تعریف می‌کنیم و می‌گوییم: تمکین در تلوّن، همان تمکین است. پس کسی که متمکن نباشد، امر نزد او تلوّن نمی‌یابد. و آیه آن از کتاب خدا این است: «كُلَّ يَوْمٍ هُوَ في شَأْنٍ» (هر روز او در کاری است) [الرحمن: ۲۹]، که به صورت نکره آمده است.\n\nو این گروه در تعریف تلوّن (التلوين) عبارتی افزودند که اگر از آن سکوت می‌کردند، بهتر بود؛ زیرا قید زدن با آن فایده‌ای ندارد. و آن سخنشان این است: «زیرا در تلوّن، اظهار قدرت قادر است و بنده از آن، غیریت را کشف می‌کند.» این افزوده‌ی اجمالی دلالت بر همان چیزی دارد که ما بدان معتقدیم. و تلوّن (التلوين) صفتی الهی است، و هر صفت الهی کمال است، زیرا در آن ساحت (جناب الهی) نقص به هیچ وجه و نسبتی تصور نمی‌شود. و مقامات و امر کامل نمی‌شوند مگر آنکه از صفات الهی باشند، زیرا کمال مطلق از آنِ حق (الحق) است. و شاهد ما بر این، سخن اوست: «يَسْئَلُهُ من في السَّماواتِ والْأَرْضِ كُلَّ يَوْمٍ هُوَ في شَأْنٍ» (هر که در آسمان‌ها و زمین است، از او درخواست می‌کند؛ هر روز او در کاری است) [الرحمن: ۲۹]. و تلوّن (التلوين) چیزی جز این نیست. پس مذهب این جماعت در مذهب ما داخل می‌شود، زیرا مذهب ما فراگیرتر و بزرگ‌تر است، اما مذهب ما در مذهب آنان داخل نمی‌شود.\n\n### [اینکه شیء در هستی (الوجود) تکرار نمی‌شود]\n\nبدان که هر کس بداند که گستردگی الهی اقتضا نمی‌کند که چیزی در هستی (الوجود) تکرار شود، می‌داند که تلوّن (التلوين) در کَوْن (هستی) صحیح است، زیرا تلوّن دلیل بر سعه‌ی الهی است. پس کسی که در هر نَفَس، بر اختلاف آثار حق (الحق) در خود یا در دیگری وقوف نیابد، او را معرفت (المعرفة) به خداوند نیست و از اهل این مقام نیست، بلکه از اهل جهل به خدا و به خود و به عالَم است. پس باید بر خود بگرید، زیرا زندگی‌اش را باخته است. و این جهل را چیزی جز تشابه برای آنان به ارث نگذاشته است، زیرا ممکن است تفاوت چنان پنهان باشد که شخص آن را درنیابد. پس دست‌کم باید بداند که چیزی هست که آن را درنمی‌یابد، در نتیجه عالم به این باشد که در نفس خود متلوّن است، اما نداند در چه چیزی متلوّن شده و چه چیزی بر او وارد گشته است. خداوند متعال می‌فرماید: «وَأُتُوا بِهِ مُتَشَابِهًا» (و آن را به صورت متشابه برایشان آوردند) [البقرة: ۲۵]؛ یعنی برخی شبیه برخی دیگر است، پس گمان می‌رود که دومی عین اولی است، در حالی که چنین نیست، بلکه مِثل آن است. و تفاوت میان این دو مِثل در اموری است که ادراک آن با مشاهده دشوار است، مگر برای کسی که حق (الحق) را مشاهده کرده باشد یا به مشاهده‌ی آفتاب‌پرست (حرباء) تحقق یافته باشد. پس هیچ دلیلی از میان حیوانات بر صفت حق (الحق) که «كُلَّ يَوْمٍ هُوَ في شَأْنٍ» (هر روز او در کاری است) [الرحمن: ۲۹] باشد، رساتر از آفتاب‌پرست نیست. پس در عالَم هیچ صفت و حالی نیست که دو زمان باقی بماند، و هیچ صورتی نیست که دو بار ظاهر شود. و علم، همراه اول و آخر است، پس «هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ» (اوست اول و آخر و ظاهر و باطن) [الحدید: ۳]. پس تلوّن (التلوين) یافت و هویت را در کثرت، واحد ساخت. پس کسی که نتواند وحدت را در کثرت تقریر کند، این صفات را نسبت‌ها و اضافاتی برای وجوه مختلف قرار می‌دهد، و این مذهب اهل نظر (النظار) است. اما این طایفه، هویت و وحدت را اقرار کردند و وجهی را که حق از آن اول است، عیناً همان وجهی قرار دادند که از آن آخر و ظاهر و باطن است. ابوسعید خرّاز به این امر تصریح کرده است. پس رجال الله جز آنچه خود بر آن هستند، برای حق (الحق) اثبات نکردند، و در کَوْن و در تمامی مخلوقات جز آنچه حق بر آن است، ثابت نمی‌شود. پس کل به کل مرتبط شد و واحد در واحد ضرب شد، اما مضاعف نگردید، بلکه عین همان چیزی است که در آن ضرب شد. و همچنین آنچه در واحد ضرب شود یا واحد در آن ضرب شود، چه واحد باشد و چه کثرت، مضاعف نمی‌شود، بلکه عین همان چیزی است که در آن ضرب شده است. پس امر چنین است. تلوّن (التلوين) ضرب واحد در کثرت است، پس جز عین آن کثرتی که واحد در آن ضرب شده یا در واحد ضرب شده، ظاهر نمی‌شود. و حق (الحق) بی‌شک واحد است. و ضرب شیء در شیء، نسبت دادن آن به آن است. و ما کثیرانی هستیم که از یک عین واحد که جلیل و متعالی است، نشأت گرفته‌ایم؛ او از جهت ایجاد به ما منتسب شد و ما از جهت وجود به او منتسب شدیم. پس هر کس نفس خود را به عنوان مخلوق و موجود بشناسد، حق (الحق) را به عنوان خالق و موجِد می‌شناسد. پس اگر به احدیت عالَم بنگری، واحد را در واحد ضرب کرده‌ای، و اگر به عالَم بنگری، واحد را در کثیر ضرب کرده‌ای. و عالَم اثر اسماء اوست، و اثر، همان‌طور که پیشتر گفتیم، صورت اسم در لوایح (تجلیات) است. پس احدیت حق (الحق) جز در صور اسماء او ضرب نشده است، پس از او زایل نشد، و پس از ضرب جز او خارج نشد. و اسماء کثیرند، چنانکه خبر الهی در مورد نود و نه اسم و بالاتر از آن، از آنچه معلوم است و آنچه معلوم نیست، وارد شده است. و عین (ذات) یکی است و الوان (رنگ‌ها) مراتب هستند و تلوّن (التلوين) نسبتی به آنهاست. اگر بگویی واحد است، راست گفته‌ای، و اگر بگویی کثیرند، راست گفته‌ای، زیرا اسماء خداوند برای معانی مختلف کثیرند. و خداوند هدایت‌گر است.\n\n«بسم الله الرحمن الرحیم»"
  },
  "page_count": 2
}