{
  "id": 148,
  "title": {
    "ar": "الباب الثامن والأربعون ومائة في معرفة مقام الفراسة وأسرارها",
    "en": "Chapter 148: Concerning the Knowledge of the Station of Spiritual Insight (الفراسة) and its Secrets",
    "ur": "باب ایک سو اڑتالیس: مقامِ فراست (الفراسة) اور اس کے اسرار کی معرفت میں",
    "fa": "باب صد و چهل و هشتم در معرفت مقام فراست و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثامن والأربعون ومائة في معرفة مقام الفراسة وأسرارها)\n\n\n> إن الفراسة نور النقل جاء به *** لفظ النبي الرسول المصطفى الهادي‏\n\n\n> رب الفراسة من كان الإله له *** عينا وسمعا وذاك الناشى‏ء الشادى‏\n\n\n> وما النهاية إلا أن يقوم به *** عكس القضية في غيب وإشهاد\n\n\n### [الفراسة نعت إلهى قهرى حكمها متعلق بالشاردين‏]\n\n\nالفراسة من الافتراس فهو نعت إلهي قهري حكمه في الشوارد خوفا من صاحب هذه الصفة والشرود سببه خوف طبيعي إما على النفس إن تفارق بدنها الذي ألفته وظهر سلطانها فيه وإما من حيث ما ينسب إليها من الذم الذي يطلقه عليها المفترس بالفراسة الطبيعية أو بالفراسة الإلهية فلهذا لا تتعلق إلا بالشاردين لأن الغالب على العالم الجهل بنفوسهم وسبب جهلهم التركيب فلو كانوا بسائط غير مركبين من العناصر لم يتصفوا بهذا الوصف‏\n\n\n### [المتفرس له علامات في التفرس فيه بتلك العلامات يستدل عليه وبها يهديه‏]\n\n\nفاعلم أن الفراسة إذا اتصف بها العبد له في المتفرس فيه علامات بتلك العلامات يستدل والعلامات منها طبيعية مزاجية وهي الفراسة الحكمية ومنها روحانية نفسية إيمانية وهي الفراسة الإلهية وهو نور إلهي في عين بصيرة المؤمن يعرف به إذ يكشف له ما وقع من المتفرس فيه أو ما يقع منه أو ما يؤول إليه أمره ففراسة المؤمن أعم تعلقا من الفراسة الطبيعية فإن الفراسة غاية ما تعطي من العلوم العلم بالأخلاق المذمومة والمحمودة وما يؤدي إلى العجلة في الأشياء والريث فيها والحركات البدنية كلها وسأورد في هذا الباب طرفا منهما أعني من الفراستين بعد تحقيق ماهيتهما\n\n\n### [الفراسة الإلهية تعطى ما تعطيه الفراسة الطبيعية وزيادة]\n\n\nوالفراسة الإلهية تتعلق بعلم ما تعطيه الفراسة الطبيعية وزيادة وهي إنها تعطي معرفة السعيد من الشقي ومعرفة الحركة من الإنسان المرضية عند الله من غير المرضية التي وقعت منه من غير حضور صاحب هذا النور فإذا حضر بين يديه بعد انقضاء زمان تلك الحركة وقد ترك ذلك العمل في العضو الذي كان منه ذلك العمل علامة لا يعرفها إلا صاحب الفراسة فيقول له فيها بحسب ما كانت الحركة من طاعة ومعصية كما اتفق لعثمان رضي الله عنه وذلك أنه دخل عليه رجل فعند ما وقعت عليه عينه قال يا سبحان الله ما بال رجال لا يغضون أبصارهم عن محارم الله وكان ذلك الرجل قد أرسل نظره فيما لا يحل له إما في نظره إلى عورة إنسان أو نظر في قعر بيت مسكون وما أشبه ذلك فقال له الرجل أ وحي بعد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقال لا ولكنها فراسة أ لم تسمع إلى‏\n\n\nقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم اتقوا فراسة المؤمن فإنه ينظر بنور الله‏\n\n\nوعند ما دخلت على رأيت ذلك في عينيك فهذا معنى قولنا إنها تترك علامة في العضو الذي كان منه ذلك العمل المحمود أو المذموم‏\n\n\n### [الفراسة الطبيعية ومعطياتها]\n\n\nوالفراسة الطبيعية تعطي معرفة المعتدل في جميع أفعاله وأقواله وحركاته وسكناته ومعرفة المنحرف في ذلك كله فيفرق بالنظر في أعضائه ونشأة كل عضو بين الأخرق والعاقل والذكي والفطن والفدم الغمر والشبق وغير الشبق والغضوب وغير الغضوب والخبيث وغير الخبيث والخداع المحتال والسليم المسلم والنزق وغير النزق وما أشبه هذا\n\n\n### [الفراسة الإيمانية نور في عين البصيرة كالنور لعين البصر]\n\n\nفاعلم أولا أن الفراسة الإيمانية وبها نبدأ أنها نور\nإلهي يعطاه المؤمن لعين البصيرة يكون كالنور لعين البصر وتكون العلامة في المتفرس فيه كنور الشمس الذي تظهر به المحسوسات للبصر فكما يفرق البصر بما فيه من النور وبما كشف له نور الشمس من المحسوسات فيعرف صغيرها من كبيرها وحسنها من قبيحها وأبيضها من أسودها من أحمرها من أصفرها ومتحركها من ساكنها وبعيدها من قريبها وعاليها من أسفلها كذلك نور الفراسة الإيمانية يعرف محمودها من مذمومها\n\n\n### [الحكمة في إضافة نور فراسة المؤمن إلى الله‏]\n\n\nوإنما أضيف نور الفراسة إلى الله الذي هو الاسم الجامع لأحكام الأسماء لأنه يكشف المحمود والمذموم وحركات السعادة في الدار الآخرة وحركات الشقاء إلى أن يبلغ بعضهم إذا رأى وطأة شخص في الأرض وهو أثره والشخص ليس بحاضر يقول هذا قدم سعيد وهذا قدم شقي مثل ما يفعله القائف الذي يتبع الأثر فيقول صاحب هذا الأثر أبيض مثلا أعور العين ويصف خلقته كأنه رآه وما طرأ عليه في خلقه من الأمور العوارض يرى ذلك كله في أثره من غير أن يرى شخصه ويحكم في الأنساب ويلحق الولد بأبيه إذا وقع الاختلاف فيه لعدم المناسبة في الشبه الظاهر المعتاد بين الآباء والأبناء\n\n\n### [الحركات الكوكبية وسباحتها في الأفلاك العلوية]\n\n\nفأضاف نور الفراسة إلى الله لأجل هذا فلو أضافها إلى الاسم الحميد مثلا لم ير صاحب هذا النور إلا المحمود السعيد خاصة وكذلك لو أضاف إلى أي اسم إلهي لكان بحسب ما تعطي حقيقة ذلك الاسم فلما أضاف ذلك النور إلى الله أدرك به الخيرات والشرور الواقعة في الدنيا والآخرة والمذام والمحامد ومكارم الأخلاق وسفسافها وما تعطيه الطبيعة وما تعطيه الروحانية ويفرق بهذا النور بين الأحكام الشرعية وهي خمسة أحكام ويعرف بهذا النور لمن استند صاحب تلك الحركة من الأسماء الإلهية ومن ينظر إليه من الأرواح العلوية وما له من الآيات من الحركات الكوكبية لأن الله ما جعل سباحتها في الأفلاك باطلا بل لأمور أودعها الله تعالى في المجموع فيها وفي حركاتها وفي قطعها في البروج المقدرة في الفلك الأقصى وهو قوله وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها فهي تؤدي في تلك السباحة ما أمنت عليه من الأمور التي يطلبها العالم العنصري‏\n\n\n### [الطبيعة خلقها الله دون النفس وفوق الهباء]\n\n\nواعلم أن الطبيعة التي خلقها الله تعالى دون النفس وفوق الهباء فلما أراد الله إيجاد الأجسام الطبيعية وما ثم عندنا إلا جسم طبيعي أو عنصري والعناصر أجسام طبيعية وإن تولد عنها أجساد أخر فكل ذلك من آثار الله فيما خلق الله الطبيعة عليها والطبيعة عبارة عن أمور أربعة إذا تألفت تألفا خاصا حدث عنه ما يناسب تلك الألفة بتقدير العزيز العليم فلذلك اختلفت أجسام العالم لاختلاف ذلك المزاج فأعطى كل جسم في العالم بحسب ما اقتضاه مزاجه‏\n\n\n### [خلق العناصر وهي الأركان الأربعة]\n\n\nوما زال الأمر ينزل إلى أن خلق الله العناصر وهي الأركان فضم الحرارة إلى اليبوسة على طريق خاص فكان من ذلك المزج ركن النار الذي يعبر عنه أيضا بعنصر النار ثم الهواء كذلك ثم الماء ثم التراب ثم جعل سبحانه يستحيل بعضها إلى بعض بوسائط وبغير وسائط فإذا تنافر العنصران من جميع الوجوه استحال إلى المناسب ثم استحال ذلك المناسب إلى المناسب إليه الآخر الأقرب الذي كان منافرا للمستحيل الأول فقبل الاستحالة إليه بوساطة هذا المناسب الأقرب من سخافة أو كثافة\n\n\n### [خلق الجسم الحيواني من أربع طبائع‏]\n\n\nثم خلق الله الجسم الحيواني من أربع طبائع وهما المرتان والدم والبلغم وجعل سبحانه في هذه الأخلاط قوى روحانية تظهر آثارها في الجسم المركب عنها فإن كانت هذه الأخلاط في الجسم الظاهر عنها على الاعتدال أو قريب من الاعتدال أعطت ما يعطيه الاعتدال من الأمور المستحسنة المحمودة والحركات الاقتصادية في الأمور وإن لم تكن فيه على الاعتدال أعطت بحسب ما انحرفت إليه وظهر في البدن سلطان الأقوى والأكثر من هذه الأخلاط فيطرأ على الجسم من ذلك علل وعلى النفس من ذلك أخلاق‏\n\n\n### [العلل البدنية والنفسية والروحانية وعلاجها]\n\n\nفالطبيب يداوي العلل بأن يزيد في الناقص من هذه الأخلاط وينقص من الزائد منها حتى يحصل الاعتدال والطبيب الإلهي يداوي الأخلاق ويسوس الأغراض النفسية بالذكرى والموعظة والتنبيه على معالي الأمور وما لمن قامت به من السعادة والمحمدة عند الله وعند الناس وعند الأرواح العلى فتتأيد بذلك النفس الناطقة وتكون لها هذه الذكرى كالمعينة على صلاح هذا المزاج المنحرف فتعين الطبيب المدبر لطبيعة هذا البدن وإصلاح ما اختل منه ولهذا بعض الأطباء يأمرون المرضى لأمراض خاصة باستعمال سماع الألحان المطربة والأماكن المستحسنة المتنوعة الأزهار وخرير المياه وتغاريد الطير كالبلبل وأمثاله كل ذلك طب روحاني يؤدي إلى صلاح المزاج يعين الطبيب عليه‏\nوثم علل أخر لا تحتمل الأصوات بل تصلح بنقيض ما ذكرناه وذلك كله بحسب الخلط الغالب الأقوى وضعف المناقض المقابل له‏\n\n\n### [العلل الأصلية التي في نفس المزاج والخلقة]\n\n\nوهذه العلل منها أصلية في نفس المزاج والخلقة مثل الجحوظة في العينين أو الغئورة المفرطة أو الأنف الدقيق جدا أو الغليظ جدا أو المتسع الثقب المنتفخ أو نقيضه أو البياض الشديد أو السواد الشديد أو الجعودة في الشعر أو السبوطة فيه الكثيرة أو الزرقة الشديدة في العين الفيروزجيه أو الكحولة الغائية وكذلك سائر الأعضاء في عدم الاعتدال وهو الانحراف من الاعتدال إلى أحد الميلين كما ذكرنا فإن خلق الإنسان يكون بحسب ما هي هذه الأعضاء عليه من اعتدال وانحراف‏\n\n\n### [الطبيب الإلهي من نبى أو وارث أو حكيم‏]\n\n\nفإذا جاء هذا الطبيب الإلهي وهو النبي أو الوارث أو الحكيم فيرى ما تقتضيه هذه النشأة التي انقادت إليه وجعلت زمامها في يديه ليربيها ويسعى في سعادتها ويردها إلى خلاف ما تقتضيه نشأته إن كان منحرفا بأن يبين لها مصارف ذلك الانحراف التي يحمدها الله ويكون فيها سعادة هذه النفس فإنه لا يتمكن له أن ينشاها نشأة أخرى فقد فرغ ربك من خلق ومن خلق ولم يبق بأيدينا إلا تبيين المصارف فالمعتدل النشأة إذا كان جاهلا بالأمور السعادية عند الله التي تحتاج إلى موقف وهو رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يسأل العلماء عن الأمور التي تعطي السعادة عند الله‏\n\n\n### [المعتدل النشأة والمنحرف ومكارم الأخلاق‏]\n\n\nوأما مكارم الأخلاق فلا يحتاج فيها إلى موقف فإن مزاج نشأته واعتدالها لا تعطيه إلا مكارم الأخلاق بل يحتاج إلى الموقف في بعض الأمور في استعمال الانحراف وهو في ذلك مكلف لما يكون في ذلك الانحراف من المصالح إما دنيا وإما آخرة وإما المجموع وأما المنحرف فتصدر منه مذام الأخلاق وسفسافها وطلب نفوذ الأغراض القائمة به ولا يبالي ما يؤول إليه أمره في نيلها فالطبيب السؤوس يستدرجه حالا بعد حال بتبيين المصارف كما ذكرناه‏\n\n\n### [كيف يسوس صاحب الفراسة الإيمانية المتفرس فيه‏]\n\n\nفإذا جاء صاحب الفراسة الإيمانية وكان عالما بما يكون فيه المصلحة لهذا المتفرس فيه ورأى منه حركة تؤدي إلى مذموم أو تكون تلك الحركة قد وقعت منه مذمومة ساسة حتى يتمكن منه إلى أن يسلم إليه نفسه ليتحكم فيها فإن كان منحرفا كان في سلوكه صاحب مجاهدة ورياضة وإن كان معتدلا كان في سلوكه طيب النفس ملتذا صاحب فرح وسرور تهون عليه الأمور الصعاب على غيره ولا تكلف عنده في شي‏ء من مكارم الأخلاق فإذا صفت نفسه وزكت ولحقت بالعالم المطهر ونظرت بالعين الإلهي وسمعت به وتحركت بقوته عرفت مصادر الأمور ومواردها وما تنبعث عنه وما تئول إليه فذلك المعبر عنه بالفراسة الإيمانية وهي موهبة من الله تعالى ينالها السليم الطبع وغير السليم‏\n\n\n### [أصل الاعتدال والانحراف في العالم الموجب لغلبة بعض الأصول على بعض‏]\n\n\nوأصل الاعتدال والانحراف في العالم وفي الموجب لغلبة بعض الأصول على بعضها التي لها الحكم في المركبات هي من آثار العلم الإلهي الذي منه يرحم الله من يشاء ويغفر ويعذب ويكره ويرضى ويغضب وأين الغضب من الرضي وأين العفو من الانتقام وأين السخط من الرضوان وكل ذلك جاءت به الأخبار الإلهية في الكتب المنزلة وعلمها أهل الكشف مشاهدة عين ولو لا ما وردت على ألسنة الأنبياء والرسل ونزلت بها الكتب من الله على أيديهم وأيدوا بالمعجزات ليثبت صدقهم عند الأجانب لأجل هذه الأمور الإلهية حتى تقبل منهم إذا وردوا بها فإن أدلة العقول تحيلها في الجناب الإلهي فلو نطق بها مشاهد لها مكاشف بها من غير تأييد آية تدل على صدقه جهل وطعن في نظره وأقيمت الدلالات العقلية على فساد عقله وفكره وحكم خياله عليه وأن الله لا ينبغي أن يوصف بهذه الأوصاف فهذا كان سبب نزولها على أيدي الرسل والكتب ليستريح إليها المشاهد ويأنس بكلامه إذا أتى بمثل هذا النوع‏\n\n\n### [لو لا شرف العلم ما شرفت الفراسة فالعلم أشرف الصفات وبه تحصل النجاة]\n\n\nفلأجل هذه الأمور وردت الشرائع ولأجل الأحكام التي لا توافق أغراض الرؤساء والمقدمين لو سمعوها من غير الرسول فلما أنسوا بها من الرسل وألفت النفوس أحكام النواميس الإلهية واستصحبتها هان على الملوك والرؤساء أن يتلمذوا للصالحين ويدخلوا نفوسهم تحت أحكامهم وإن شق عليهم فهم يرجحون علمهم بذلك على ما يدركونه من مشقة خلاف الغرض فإنه على هذا الشرط أدخل نفسه فحجته قائمة على نفسه فسبحان العليم الحكيم ولو لا شرف العلم ما شرفت الفراسة لأن الفراسة لو لا ما تعطي العلم ما شرفت ولا كان لها قدر فالعلم أشرف الصفات وبه تحصل النجاة إذا حكمه الإنسان على نفسه وتصرف في أموره بحسب حكمه رَبِّ زِدْنِي عِلْماً رَبِّ زِدْنِي عِلْماً رَبِّ زِدْنِي عِلْماً واستعملني له واجعله الحاكم علي والناظر إلي إذ أنت العلم والعالم والمعلوم لك لا لنا فأعطنا منه على قدرنا\n\n\n### [الفراسة المذكورة عند الحكماء]\n\n\nوأما الفراسة المذكورة عند الحكماء فأنا أذكر منها طرفا على ما أصلوه‏\nوما جربوه واختبروه ثم اعتباره في الصفات بما تقتضيه طريقنا في هذا الكتاب مختصرا كافيا إن شاء الله تعالى‏\n\n\n### [بدء خلق الإنسان المعتدل النشأة]\n\n\nاعلم أن الله تعالى إذا أراد أن يخلق إنسانا معتدل النشأة ليكون جميع حركاته وتصرفاته مستقيمة وفق الله الأب لما فيه صلاح مزاجه ووفق الأم أيضا لذلك فصلح المني من الذكر والأنثى وصلح مزاج الرحم واعتدلت فيه الأخلاط اعتدال القدر الذي به يكون صلاح النطفة ووقت الله لإنزال الماء في الرحم طالعا سعيدا بحركات فلكية جعلها الله علامة على الصلاح فيما يكون في ذلك من الكائنات فيجامع الرجل امرأته في طالع سعيد بمزاج معتدل فينزل الماء في رحم معتدل المزاج فيتلقاه الرحم ويوفق الله الأم ويرزقها الشهوة إلى كل غذاء يكون فيه صلاح مزاجها وما تتغذى به النطفة في الرحم فتقبل النطفة التصوير في مكان معتدل ومواد معتدلة وحركات فلكية مستقيمة\n\n\n### [السمات البدنية والنفسية للإنسان المعتدل النشأة]\n\n\nفتخرج النشأة وتقوم على أعدل صورة فتكون نشأة صاحبها معتدلة ليس بالطويل ولا بالقصير لين اللحم رطبة بين الغلظ والرقة أبيض مشربا بحمرة وصفرة معتدل الشعر طويله ليس بالسبط ولا الجعد القطط في شعره حمرة ليس بذاك السواد أسيل الوجه أعين عينه مائلة إلى الغور والسواد معتدل عظيم الرأس سائل الأكتاف في عنقه استواء معتدل اللبة ليس في وركه ولا صلبه لحم خفي الصوت صاف ما غلظ منه وما رق مما يستحب منه غلظة أو رقته في اعتدال طويل البنان للرقة سبط الكف قليل الكلام والصمت إلا عند الحاجة ميل طبائعه إلى الصفراء والسوداء في نظره فرح وسرور قليل الطمع في المال ليس يريد التحكم عليك ولا الرئاسة ليس بعجلان ولا بطي‏ء فهذا قالت الحكماء أعدل الخلقة وأحكمها وفيها خلق سيدنا محمد صَلَّى اللهُ عَليهِ وسَلَّم ليصح له الكمال في النشأة كما صح له الكمال في المرتبة فكان أكمل الناس من جميع الوجوه ظاهرا وباطنا\n\n\n### [دور الأم في تكوين النشأة الإنسانية]\n\n\nفإن اتفق أن يكون في الرحم اختلال مزاج فلا بد أن يؤثر ذلك الاختلال في نشأة الإنسان في الرحم في عضو من أعضائه أو في أكثر الأعضاء أو في أقلها بحسب ما تكون المادة في الوقت لذلك العضو من القوة الجاذبة التي تكون في النطفة فيخرج ذلك إما في كلية النشأة وإما في بعض أعضائها\n\n\n### [الملامح الظاهرية الدالة على الطبائع النفسية]\n\n\nفمن ذلك والله الموفق أن البياض الصادق مع الشقرة والزرقة الكثيرة دليل على القحة والخيانة والفسوق وخفة العقل فإن كان مع ذلك واسع الجبهة ضيق الذقن أزعر أوجن كثير الشعر على الرأس فقال أهل الفراسة من الحكماء إن التحفظ ممن هذه صفته كالتحفظ من الأفاعي القتالة فإن كان الشعر خشنا دل على الشجاعة وصحة الدماغ وإن كان لينا دل على الجبن وبرد الدماغ وقلة الفطنة وإن كان الشعر كثيرا على الكتفين والعنق دل على الحمق والجراءة وإن كثر على الصدر والبطن دل على وحشية الطبع وقلة الفهم وحب الجور والشقرة دليل على الجبن وكثرة الغضب وسرعته والتسلط والأسود من الشعر يدل على السكون الكثير في العقل والأناة وحب العدل والمتوسط بين هذين يدل على الاعتدال وإن كانت الجبهة منبسطة لا غضون فيها دل على الخصومة والشغب والرقاعة والصلف فإن كانت الجبهة متوسطة في النتو والسعة وكانت فيها غضون فهو صدوق محب فهم عالم يقظان مدبر حاذق ومن كان عظيم الأذنين فهو جاهل إلا أنه يكون حافظا ومن كان صغير الأذنين فهو سارق أحمق وإن كان الحاجب كثير الشعر دل على الغي وغث الكلام فإن امتد الحاجب إلى الصدغ فصاحبه تياه صلف ومن رق حاجبه فاعتدل في الطول والقصر وكانت سوداء فهو يقظان فإن كان العين أزرق فهي أردأ العيون وأردأ الزرق الغير وزجية فمن عظمت عيناه وجحظت فهو حسود وقح كسلان غير مأمون وإن كانت زرقاء كان أشد وقد يكون غاشا ومن كانت عيناه متوسطة مائلة إلى الغور والكحلة والسواد فهو يقظان فهم ثقة محب فإذا أخذت العين في طول البدن فصاحبها خبيث ومن كانت عينه جامدة قليلة الحركة كالبهيمة ميت النظر فهو جاهل غليظ الطبع ومن كان في عينه حركة بسرعة وحدة نظر فهو محتال لص غادر ومن كانت عينه حمراء فهو شجاع مقدام فإن كان حواليها نقط صفر فصاحبها أشر الناس وأرداهم وإن كان أنفه دقيقا فصاحبه نزق ومن كان أنفه يكاد يدخل في فمه فهو شجاع ومن كان أفطس فهو شبق ومن كان أنفه شديد الانتفاخ فهو غضوب وإذا كان غليظ الوسط مائلا إلى الفطوسة فهو كذوب مهذار وأعدل الأنوف ما طال غير طول فاحش ومن كان أنفه متوسط الغلظ وقناه‏\nغير فاحش فهو دليل على العقل والفهم ومن كان واسع الفم فهو شجاع ومن كان غليظ الشفتين فهو أحمق ومن كان متوسط الشفتين في الغلظ مع حمرة صادقة فهو معتدل ومن كانت أسنانه ملتوية أو ناتئة فهو خداع متحيل غير مأمون ومن كانت أسنانه منبسطة خفافا بينهما فلج فهو عاقل ثقة مأمون مدبر ومن كان لحم الوجه منه منتفخ الشدقين فهو جاهل غليظ الطبع ومن كان نحيف الوجه أصفر فهو ردى‏ء خبيث خداع شكس ومن طال وجهه فهو وقح ومن كانت أصداغه منتفخة وأوداجه ممتلئة فهو غضوب ومن نظرت إليه فاحمر وخجل وربما دمعت عيناه أو تبسم تبسما لا يريده فهو لك متودد محب فيك لك في نفسه مهابة وإن كان ذا صوت جهر دل على الشجاعة والمعتدل بين الكد والتأني والغلظ والرقة دل على العقل والتدبير والصدق وسرعة الكلام ورقته يدل على الكذب والقحة والجهل الغلظ في الصوت دليل على الغضب وسوء الخلق الغنة في الصوت دليلة على الحمق وقلة الفطنة وكبر النفس التحرك الكثير دليل على الصلف والهذر والخداع والوقار في الجلسة وتدارك اللفظ وتحريك اليد في فضول الكلام دليل على تمام العقل والتدبير وصحة العقل قصر العنق دليل على الخبث والمكر طول العنق ورقته دليل على الحمق والجبن والصياح فإن انضاف إليهما صغر الرأس فإنه يدل على الحمق والسخف غلظ العنق يدل على الجهل وكثرة الأكل اعتدال العنق في الطول والغلظ دليل على العقل والتدبير وخلوص المودة والثقة والصدق البطن الكبير يدل على الحمق والجهل والجبن لطافة البطن وضيق الصدر يدلان على جودة العقل وحسن الرأي عرض الكتفين والظهر يدلان على الشجاعة وخفة العقل انحناء الظهر يدل على الشكاسة والنزاقة استواء الظهر علامة محمودة بروز الكتفين دليل على سوء النية وقبح المذهب إذا طالت الذراعان حتى يبلغ الكف الركبة دل على الشجاعة والكرم ونبل النفس وإذا قصرت فصاحبها جبان محب في الشر الكف الطويلة مع الأصابع الطوال تدل على النفوذ في الصنائع وإحكام الأعمال وتدبير الرئاسة اللحم الغليظ في القدم يدل على الجهل وحب الجور القدم الصغير اللين يدل على الفجور رقة العقب تدل على الحسن غلظ العقب يدل على الشجاعة غلظ الساقين مع العرقوبين دليل على البله والقحة من كانت خطأه واسعة بطيئة فهو منجح في جميع أعماله مفكر في عواقبه والضد للضد\n\n\n### [الرياضة وإزالة العلم في إزالة كل صفة مذمومة]\n\n\nفهذا ما نقلته من أقوال الحكماء من أهل التجربة من العلماء بالطبيعة وهذه النعوت قد تكثر وتقل والحكم للغالب وقد تتساوى في الشخص فيدفع هذا حكم هذا بأن يكون في الشخص حكم أحدها بوجه في قضية خاصة وحكم أحدها بوجه آخر في قضية خاصة وبالجملة فإن الرياضة واستعمال العلم مؤثر في إزالة حكم كل صفة مذمومة مما ذكر ومن جرب وجد صحة ما قلناه فإن العادة طبيعة خامسة لها أثر في الطبيعة الأصلية هذا كله مجرب وصل محقق الاعتبار فيما ذكرناه من العلامات التي أعطت الطبيعة حكمها فيه وشهدت لها التجارب‏\n\n\n### [وصل الاعتبار فيما ذكرناه من العلامات التي أعطت الطبيعة حكمها فيه وشهدت لها التجارب‏]\n\n\n### [اللطيفة الإنسانية لها وجه إلى النور ووجه إلى الظلمة]\n\n\nفاعلم أن لطيفة الإنسان المدبرة جسده لما كان لها وجه إلى النور المحض الذي هو أبوها ووجه إلى الطبيعة وهي الظلمة المحضة التي هي أمها كانت النفس الناطقة وسطا بين النور والظلمة وسبب توسطها في المكانة لكونها مدبرة كالنفس الكلية التي بين العقل والهيولى الكل وهو جوهر مظلم والعقل نور خالص فكانت هذه النفس الناطقة كالبرزخ بين النور والظلمة تعطي كل ذي حق حقه فمتى غلب عليها أحد الطرفين كانت لما غلب عليها وإن لم يكن لها ميل إلى أحد الجانبين تلقت الأمور على الاعتدال وأنصفت وحكمت بالحق فلنذكر في هذا الوصل اعتبار ما مشى في علامات الفراسة في الجسد\n\n\n### [الاعتبار في البياض والسواد والطول والقصر واعتدال اللحم والشعر]\n\n\nفنقول أما البياض المفرط فاستفراغ الإنسان في النظر في عالم النور بحيث لا يبقى في استفراغه ما يدبر به عالم طبيعته كأبي عقال المغربي وأمثاله فيفسد سريعا قبل حصول الكمال وكذلك اعتبار السواد المفرط وهو استفراغه في عالم شهوته وطبيعته بحيث أن يحول بينه وبين النظر في علوم الأنوار وهي العلوم الإلهية فهذا مذموم الحال بلا خلاف فإذا كان وقتا ووقتا ووفى كل ذي حق حقه كما قال صَلَّى اللهُ عَليهِ وسَلَّم لي وقت لا يسعني فيه غير ربي فذلك الإمام العادل وأما اعتبار الطول والقصر فهو مدة إقامته في النظر في أحد العالمين فأما مدة ممتدة وهي الطول أو قليلة وهي القصر وينبغي من ذلك أن تكون المدة بقدر الحاجة وأما اعتدال اللحم في الرطوبة وبين الغلظ والرقة فهو اعتدال للإنسان‏\nفي البرزخيات بين المعنى والحس كاللحم بين العظم والجلد وأما اعتدال الشعر فهو إقامته بين البسط والقبض‏\n\n\n### [الاعتبار في كونه أسيل الوجه أعين جاحظ العينيين معتدل الرأس سائل الأكتاف مستوى العنق‏]\n\n\nوأما كونه أسيل الوجه فهي الطلاقة والبشاشة وأما كونه أعين فصحة النظر في الأمور وأما كون عينه مائلة إلى الغور والسواد فهو النظر في المغيبات واستخراج الأمور الخفية وأما الجحوظة فهو ميلة إلى استنباط العلوم من عالم الشهادة وهم أهل الاعتبار وأما اعتدال عظم الرأس فتوفير العقل وأما كونه سائل الأكتاف فاحتمال الأذى في الغيبة من غير أثر وأما استواء العنق فالاستشراف على الأشياء من غير ميل إليها\n\n\n### [الاعتبار في طول العنق وقصره وفي اعتدال اللبة وقلة اللحم وخفاء الصوت وصفائه وطول البنان‏]\n\n\nوأما الطول الزائد في العنق فهو الاستشراف على ما لا ينبغي مثل التجسس وأما القصر المفرط فهو التفريط فيما ينبغي أن يستشرف عليه وأما اعتدال اللبة فاستقامة العبارة بالوزن الذي تقع به المنفعة عند المخاطب وأما قلة اللحم في الورك والصلب فهو نظره في الأمور التي يتورك عليها ويعول عليها أن يخلصه إلى أحد الطرفين فإنه إن كانت برزخية قد تقدر به في غالب الأمر وأما كونه خفي الصوت فهو حفظ السر في موضع الجهر وأما صفاء الصوت فهو أن لا يزيد فيه شيئا وأما طول البنان فللطافة التناول وأما بسط الكف فرمى الدنيا من غير تعلق‏\n\n\n### [الاعتبار في قلة الكلام والضحك وميل الطبع إلى المرتين‏]\n\n\nوأما قلة الكلام والضحك فنظره إلى مواقع الحكمة فيتكلم ويضحك بقدر الحاجة وأما كون ميل طباعه إلى المرتين فهو أن يغلب عليه في الصفراء الجنوح إلى العالم العلوي وفي السوداء إلى العالم السفلي واستخراج ما أخفي فيه من قرة أعين مما تحجب الطبيعة أكثر العقول في النظر فيها لما يسبق في أذهانهم من ذم الطبيعة وأما كونه في نظره فرح وسرور فهو استجلاب نفوس الغير إليه بالمحبة وأما كونه قليل الطمع في المال فهو البعد عن كل ما يميل به إلى ما لا فائدة له فيه وأما كونه ليس يريد التحكم عليك ولا الرئاسة فهو شغله بكمال عبوديته لا به وأما كونه ليس بعجلان ولا بطي‏ء أي ليس بسريع الأخذ مع القدرة ولا عاجز\n\n\n### [مرجع أرباب الفراسة الحكمية والإيمانية في تقسيم الأمور إلى محمود ومذموم‏]\n\n\nوكذلك أيضا لما نظرنا إلى أرباب الفراسة الحكمية وجدناهم راجعين في ذلك إلى طرفين وواسطة وقسموا الأمور إلى محمود ومذموم أعني الأخلاق وجعلوا الخير كله في الوسط وجعلوا الانحراف في الطرفين فقالوا في الأبيض الشديد البياض والأشقر الأزرق ما سمعت من الذم وأنه غير محمود وكذلك الشديد السواد والرقيق الأنف جدا مذموم كل هذا والمعتدل بينهما الغير مائل إلى أحد الطرفين مثلا خارجا عن الحد هو المحمود على نحو ما تقدم فلما رأيناهم قد قصروها على ما ذكرنا نظرنا إلى ذلك في هذا العالم الإنساني أين ظهر الحسن والقبح فقلنا لا حسن يقع به المنزلة عند الله ولا قبح يقع باجتنابه الخير من الله إلا ما حسنه الشرع وقبحه فلما رأينا الحمد والذم على الفعل من جهة ما شرعا نظرنا كيف نجمع طرفين وواسطة لنجعل الطرفين مخالفا لحكم الوسط الذي هو محل الاعتدال‏\n\n\n### [الإنسان لا يخلو أن يكون واحدا من ثلاثة بالنظر إلى الشرع‏]\n\n\nفنقول لا يخلو الإنسان أن يكون واحدا من ثلاثة بالنظر إلى الشرع وهو إما أن يكون باطنيا محضا وهو القائل بتجريد التوحيد عندنا حالا وفعلا وهذا يؤدي إلى تعطيل أحكام الشرع كالباطنية والعدول عما أراد الشارع بها وكل ما يؤدي إلى هدم قاعدة دينية مشروعة فهو مذموم بالإطلاق عند كل مؤمن وإما أن يكون ظاهريا محضا متغلغلا متوغلا بحيث أن يؤديه ذلك إلى التجسيم والتشبيه فهذا أيضا مثل ذلك ملحق بالذم شرعا فأما أن يكون جاريا مع الشرع على فهم اللسان حيثما مشى الشارع مشى وحيثما وقف وقف قدما بقدم وهذه حالة الوسط وبه صحت محبة الحق له قال تعالى أن يقول نبيه فَاتَّبِعُونِي يُحْبِبْكُمُ الله ويَغْفِرْ لَكُمْ ذُنُوبَكُمْ فاتباع الشارع واقتفاء أثره يوجب محبة الله للعباد وصحة السعادة الدائمة فهذا وجه مقابلة النسختين فإن قال قائل هذا مجمل فكيف يعرف تفصيله فإنا إذا رأينا رجلا ساكنا يشهد الصلوات والجماعات وهو مع ذلك منافق مصر فنقول إن السكون وشهود الصلوات وشبه ذلك من عالم الشهادة وكونه كافرا بذلك في قلبه فهو من عالم الغيب ونحن إذا حصلت لنا الفراسة الذوقية الإيمانية كما ذكرناها وكما نتمها إن شاء الله تعالى حكمنا بكونه كافرا في نفوسنا وأبقينا ماله ودمه معصوما شرعا لظهور كلمة التوحيد فمعاملتنا له على هذا الحد وما كلفنا غير هذا\n\n\n### [العالم العلوي هو المحرك عالم الحس والشهادة]\n\n\nثم لتعلم وفقك الله أن العالم العلوي بالجملة هو المحرك عالم الحس والشهادة وتحت قهره حكمة من الله تعالى لا لنفسه استحق ذلك فعالم الشهادة لا يظهر فيه حكم حركة ولا سكون ولا أكل ولا شرب ولا كلام ولا صمت إلا عن عالم الغيب وذلك أن الحيوان لا يتحرك إلا عن قصد وإرادة وهما من عمل القلب والإرادة من عالم الغيب والتحرك وما شاكله من عالم الشهادة وعالم الشهادة كلما أدركناه بالحس عادة وعالم‏\nالغيب ما أدركناه بالخبر الشرعي أو النظر الفكري مما لا يظهر في الحس عادة\n\n\n### [عين البصيرة لإدراك عالم الغيب وعين البصر لإدراك عالم الشهادة]\n\n\nفنقول إن عالم الغيب يدرك بعين البصيرة كما إن عالم الشهادة يدرك بعين البصر وكما أن البصر لا يدرك عالم الشهادة ما عدا الظلمة ما لم يرتفع عنه حجاب الظلم أو ما أشبهه من الموانع فإذا ارتفعت الموانع وانبسطت الأنوار على المحسوسات واجتمع نور البصر والنور المظهر أدرك المبصر بالبصر المبصرات كذلك عين البصيرة حجابه الريون والشهوات وملاحظة الأغيار من العالم الطبيعي الكثيف إلى أمثال هذه الحجب فتحول بينه وبين إدراك الملكوت أعني عالم الغيب فإذا عمد الإنسان إلى مرآة قلبه وجلاها بالذكر وتلاوة القرآن فحصل له من ذلك نور ولله نور منبسط على جميع الموجودات يسمى نور الوجود فإذا اجتمع النوران فكشف المغيبات على ما هي عليه وعلى ما وقعت في الوجود غير أن بينهما لطيفة معنى فذلك أن الحس يحجبه الجدار والبعد المفرط والقرب المفرط وعين البصيرة ليس كذلك لا يحجبه شي‏ء إلا ما ذكرنا من الران والكن وأشباه ذلك إلا أنه أيضا ثم حجابا لطيفا أذكره‏\n\n\n### [النور المنبسط على الحضرات الوجودية وحظ المكاشف منها]\n\n\nوهو أن النور الذي ينبسط من حضرة الجود على عالم الغيب في الحضرات الوجودية لا يعمها كلها ولا ينبسط منه عليها في حق هذا المكاشف إلا على قدر ما يريد الله تعالى وذلك هو مقام الوحي دليلنا على ذلك لأنفسنا ذوقنا له ولغيرنا قوله قُلْ ... ما أَدْرِي ما يُفْعَلُ بِي ولا بِكُمْ إِنْ أَتَّبِعُ إِلَّا ما يُوحى‏ إِلَيَّ مع غاية الصفاء المحمدي وهو قوله أَوْ من وَراءِ حِجابٍ فمهما ظهر ممن حصل في هذا المقام شي‏ء من ذلك على ظاهره في حق شخص ما فتلك الفراسة وهي أعلى درجات المكاشفة وموضعها من كتاب الله إِنَّ في ذلِكَ لَآياتٍ لِلْمُتَوَسِّمِينَ من السمة وهي العلامة كما قلنا ولا يخطئ أبدا بخلاف الفراسة الحكمية\n\n\n### [حضرة السمات التي فيها صور بنى آدم وأحوالهم‏]\n\n\nوثم كشف آخر في الفراسة وذلك أن الله جعل في العالم حضرة السمات فيها صور بنى آدم وأحوالهم في أزمانهم إلى حين انفصالهم وهي مخبوءة عن جميع الخلائق العلوي والسفلي إلا عن القلم واللوح فإذا أراد الله اصطفاء عبد وأن يخصه بهذا المقام طهر قلبه وشرحه وجعل فيه سراجا منيرا من إيمانه خاصة يسرجه من الأسماء الإلهية الاسم المؤمن المهيمن وبيده هذه الحضرة وذلك السراج من حضرة الألوهة يأخذه الاسم المؤمن فإذا استنار القلب بذلك النور الإلهي وانتشر النور في زوايا قلبه مع نور عين البصيرة بحيث يحصل له إدراك المدركات على الكشف والمشاهدة لوجود هذه الأنوار فإذا حصل القلب على ما ذكرناه جعل في ساحة من ساحات هذا القلب تلك الحضرة التي ذكرناها فمن هناك يعرف حركات العالم وأسراره انتهى الجزء الثالث ومائة\n\n",
    "en": "## Chapter One Hundred and Forty-Eight: Concerning the Knowledge of the Station of Insight (الفراسة) and its Secrets\n\n> Insight is the light of transmission brought by\n> The word of the Prophet, the Messenger, the Chosen, the Guide.\n> The Lord of Insight is he for whom the Deity is\n> An eye and an ear, and that is the striving aspirant.\n> And the ultimate end is nothing but that there arises in him\n> The reversal of the decree, in the unseen (غيب) and in witnessing (إشهاد).\n\n### [Insight is a Divine, Compulsive Attribute whose ruling relates to the straying ones]\n\nInsight (الفراسة) derives from *iftirās* (preying/devouring). Thus, it is a Divine, compulsive Attribute (نعت إلهي قهري) whose ruling applies to those who stray (الشارِدِين), out of fear of the possessor of this quality. The cause of straying (الشرود) is a natural fear, either for the soul lest it depart from the body it has grown accustomed to and in which its sovereignty has appeared, or from the blame attributed to it by the one who preys upon it through natural physiognomy or Divine Insight. For this reason, it only relates to the straying ones, because the majority of the world is ignorant of their own souls, and the cause of their ignorance is composition (التركيب). If they were simple (بَسَائِط) and not composed of elements, they would not be characterized by this description.\n\n### [The one possessing Insight has signs in the one being observed; by those signs, he is guided and by them, he guides him]\n\nKnow that when the servant is characterized by Insight, he finds signs in the one being observed (المتفرس فيه); by those signs, he is guided. These signs are either natural and temperamental (مزاجية)—which is Judicial Physiognomy (الفراسة الحكمية)—or they are spiritual, psychic, and faith-based—which is Divine Insight (الفراسة الإلهية). This latter is a Divine light in the inner sight (عين بصيرة) of the believer, by which he knows, as it unveils (يكشف) to him what has occurred, what will occur, or what the ultimate outcome of the observed person’s affair will be. Thus, the believer’s Insight is more general in its scope than natural physiognomy. The utmost knowledge that physiognomy grants is knowledge of blameworthy and praiseworthy character traits, and what leads to haste or slowness in matters, and all bodily movements. I shall present in this chapter a portion of both types of Insight, after establishing their essential nature.\n\n### [Divine Insight grants what Natural Physiognomy grants, and more]\n\nDivine Insight (الفراسة الإلهية) relates to the knowledge granted by natural physiognomy, and more. It grants knowledge of the felicitous (السعيد) from the wretched (الشقي), and knowledge of the human action that is pleasing to Allah from the displeasing action that occurred without the presence of the possessor of this light. When the observed person appears before him after the time of that action has passed, and he has ceased that action, a sign remains in the limb from which the action originated—a sign known only to the possessor of Insight. He then informs the person about it, according to whether the action was an act of obedience or disobedience. This is what happened with Uthman (may Allah be pleased with him). A man entered upon him, and when Uthman’s eye fell upon him, he said: \"Glory be to Allah! What is wrong with men who do not lower their gaze from what Allah has forbidden?\" That man had indeed cast his gaze upon something unlawful, whether by looking at another person’s nakedness or peering into the depths of an inhabited house, or something similar. The man asked him, \"Is there revelation after the Messenger of Allah (peace and blessings be upon him)?\" Uthman replied, \"No, but it is Insight (فراسة). Did you not hear the saying of the Messenger of Allah (peace and blessings be upon him): 'Beware of the Insight of the believer, for he sees with the Light of Allah'?\" When you entered upon me, I saw that in your eyes. This is the meaning of our statement that the action, whether praiseworthy or blameworthy, leaves a sign in the limb from which it originated.\n\n### [Natural Physiognomy and its Grants]\n\nNatural Physiognomy (الفراسة الطبيعية) grants knowledge of the moderate (المعتدل) in all his acts, sayings, movements, and stillness, and knowledge of the deviant (المنحرف) in all of these. By observing his limbs and the development of each limb, it distinguishes between the clumsy and the intelligent, the sharp and the dull, the slow-witted and the ignorant, the lustful and the non-lustful, the angry and the non-angry, the malicious and the non-malicious, the deceitful schemer and the sound, submissive one, the volatile and the non-volatile, and similar characteristics.\n\n### [Faith-based Insight is a light in the inner sight, like light for the outer sight]\n\nKnow first that Faith-based Insight (الفراسة الإيمانية)—with which we begin—is a Divine light granted to the believer for the inner sight (عين البصيرة), acting like light for the outer sight (عين البصر). The sign in the observed person is like the light of the sun, by which sensible things (المحسوسات) become manifest to the sight. Just as the outer sight distinguishes, by virtue of the light within it and the light of the sun that unveils sensible things, knowing the small from the large, the beautiful from the ugly, the white from the black, the red from the yellow, the moving from the still, the far from the near, and the high from the low—so too does the light of Faith-based Insight know the praiseworthy from the blameworthy.\n\n### [The Wisdom in attributing the light of the believer's Insight to Allah]\n\nThe light of Insight is attributed to Allah, Who is the comprehensive Name (الاسم الجامع) for the rulings of all the Names, because it unveils both the praiseworthy and the blameworthy, and the movements leading to felicity in the Hereafter and the movements leading to wretchedness. It reaches the point where some of them, upon seeing the footprint of a person on the ground—even if the person is not present—say: \"This is the foot of a felicitous person, and this is the foot of a wretched person.\" This is similar to what the tracker (القائف) does, who follows a trace and says, \"The owner of this trace is white, for example, and one-eyed,\" describing his physical form as if he had seen him, and even describing accidental changes in his creation. He sees all of this in the trace without seeing the person himself. He also rules on lineages and attributes a child to his father when there is a dispute due to the lack of the usual apparent resemblance between fathers and sons.\n\n### [The Planetary Movements and their Swimming in the Celestial Spheres]\n\nThe light of Insight was attributed to Allah for this reason. If it were attributed to the Name *al-Hamīd* (The Praiseworthy), for example, the possessor of this light would only perceive the praiseworthy and the felicitous specifically. Likewise, if it were attributed to any Divine Name, it would be according to what the reality of that Name grants. But since this light was attributed to Allah, the possessor perceives both the good and the evil occurring in this world and the Hereafter, the blameworthy and the praiseworthy, noble character traits and their trivial counterparts, and what nature grants and what spirituality grants. By this light, he distinguishes between the five legal rulings (الأحكام الشرعية). By this light, he knows which Divine Names the possessor of that action relies upon, which celestial spirits (الأرواح العلوية) look upon him, and what signs he has from the planetary movements (الحركات الكوكبية). This is because Allah did not make their swimming in the spheres (الأفلاك) vainly, but for matters that Allah the Exalted deposited within their totality, their movements, and their passage through the predetermined constellations (البروج) in the outermost sphere. This is His saying: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command). Thus, in that swimming, they fulfill the matters entrusted to them that are sought by the elemental world (العالم العنصري).\n\n### [Nature, which Allah created below the Soul and above the Dust]\n\nKnow that Nature (الطبيعة), which Allah the Exalted created below the Soul (النفس) and above the Dust (الهباء), is where, when Allah willed the existence of natural bodies—and we only have natural or elemental bodies, and the elements are natural bodies, even if other bodies are generated from them—all of this is from the effects of Allah upon what He created Nature to be. Nature is an expression for four matters which, when compounded in a specific way, give rise to what suits that compound, by the decree of the All-Mighty, the All-Knowing. Therefore, the bodies of the world differ due to the difference in that temperament (المزاج), and every body in the world is granted according to what its temperament necessitated.\n\n### [The Creation of the Elements, which are the Four Pillars]\n\nThe matter continued to descend until Allah created the Elements (العناصر), which are the Pillars (الأركان). He combined heat with dryness in a specific manner, and from that mixture came the pillar of Fire, also expressed as the element of Fire. Then Air, likewise. Then Water. Then Earth. Then, Glory be to Him, He made some of them transform into others, through intermediaries and without intermediaries. If two elements were completely antagonistic, one would transform into the suitable element, and then that suitable element would transform into the other closest suitable element, which was antagonistic to the first transforming element. Thus, it accepts transformation into the latter through the mediation of this closest suitable element, whether through subtlety or density.\n\n### [The Creation of the Animal Body from Four Natures]\n\nThen Allah created the animal body from four natures (طبائع): the two Biles (المرتان), Blood (الدم), and Phlegm (البلغم). Glory be to Him, He placed spiritual powers (قوى روحانية) within these humors (الأخلاط) whose effects appear in the body composed of them. If these humors are in the body that manifests them in a state of moderation (الاعتدال) or close to moderation, they grant what moderation grants: desirable and praiseworthy matters, and economical movements in affairs. If they are not in a state of moderation, they grant according to the deviation, and the sovereignty of the strongest and most abundant of these humors appears in the body. This results in ailments (علل) affecting the body and character traits (أخلاق) affecting the soul.\n\n### [Bodily, Psychic, and Spiritual Ailments and their Treatment]\n\nThe physician treats the ailments by increasing the deficient humors and decreasing the excessive ones until moderation is achieved. The Divine Physician (الطبيب الإلهي) treats character traits and manages psychic desires (الأغراض النفسية) through remembrance (الذكرى), admonition (الموعظة), and drawing attention to noble matters and the felicity and praise that accrue to the one who possesses them, both with Allah, among people, and among the celestial spirits. The rational soul (النفس الناطقة) is thereby strengthened, and this remembrance acts as an aid in rectifying the deviant temperament (المزاج المنحرف). It assists the physician who manages the nature of this body and corrects what is deficient in it. This is why some physicians instruct patients with specific illnesses to listen to pleasant melodies, visit beautiful places with diverse flowers, listen to the murmur of water, and the singing of birds like the nightingale and its like. All of this is spiritual medicine (طب روحاني) that leads to the rectification of the temperament and assists the physician. There are other ailments that cannot tolerate sounds but are rectified by the opposite of what we mentioned. All of this depends on the dominant and strongest humor and the weakness of the opposing counterpart.\n\n### [The Original Ailments inherent in the Temperament and Constitution]\n\nThese ailments include those that are original, inherent in the temperament and constitution (الخلقة), such as excessive protrusion (الجحوظة) or excessive sinking (الغئورة) of the eyes, or a very thin nose, or a very thick one, or one with wide, inflated nostrils, or its opposite, or extreme whiteness, or extreme blackness, or excessive frizziness (الجعودة) or straightness (السبوطة) of the hair, or extreme blueness in the turquoise eye, or extreme blackness (الكحولة). Likewise, all other limbs that lack moderation, which is the deviation from moderation toward one of the two extremes, as we mentioned. For the creation of the human being is according to the state of these limbs, whether in moderation or deviation.\n\n### [The Divine Physician, whether Prophet, Heir, or Sage]\n\nWhen this Divine Physician—who is the Prophet, the Heir (الوارث), or the Sage (الحكيم)—comes, he sees what is necessitated by this constitution (النشأة) that has submitted to him and placed its reins in his hands, so that he may nurture it and strive for its felicity, and turn it away from what its constitution necessitates if it is deviant. He does this by clarifying the proper channels (مصارف) for that deviation, which Allah praises and in which the felicity of this soul lies. For he cannot create a new constitution for it; your Lord has finished the creation. All that remains in our hands is the clarification of the channels. The person of moderate constitution, if ignorant of the matters leading to felicity with Allah—which require a standing (موقف), namely the Messenger of Allah (peace and blessings be upon him)—asks the scholars about the matters that grant felicity with Allah.\n\n### [The Moderate and Deviant Constitutions and Noble Character Traits]\n\nAs for noble character traits (مكارم الأخلاق), they do not require a standing, for the temperament and moderation of his constitution grant him nothing but noble character traits. Rather, he requires a standing in certain matters regarding the utilization of deviation, and he is obligated in that, due to the benefits (المصالح) contained within that deviation, whether worldly, otherworldly, or both combined. As for the deviant person, blameworthy character traits and their trivial counterparts issue from him, and he seeks the fulfillment of his inherent desires, caring little about the outcome of attaining them. The managing Physician (الطبيب السؤوس) gradually guides him, state after state, by clarifying the proper channels, as we mentioned.\n\n### [How the Possessor of Faith-based Insight Manages the Observed Person]\n\nWhen the possessor of Faith-based Insight (الفراسة الإيمانية) comes, being knowledgeable of what constitutes the benefit (المصلحة) for the observed person, and he sees an action from him that leads to something blameworthy, or if that action has already occurred and was blameworthy, he manages him until he gains control over him, so that the person submits his soul to him to be governed. If the person was deviant, his spiritual journey (سلوكه) will involve striving (مجاهدة) and discipline (رياضة). If he was moderate, his spiritual journey will be pleasant, delightful, joyful, and happy. Difficult matters become easy for him, and he finds no burden in any noble character trait. When his soul is purified and refined, and joins the purified world (العالم المطهر), and he sees with the Divine Eye, hears with It, and moves by Its power, he knows the sources and destinations of affairs, what they originate from, and what they ultimately lead to. This is what is expressed as Faith-based Insight (الفراسة الإيمانية), and it is a gift (موهبة) from Allah the Exalted, attained by both the sound-natured and the unsound-natured.\n\n### [The Origin of Moderation and Deviation in the World, necessitating the dominance of some principles over others]\n\nThe origin of moderation and deviation in the world, and what necessitates the dominance of some principles over others—which hold sway over composite things—stems from the effects of Divine Knowledge (العلم الإلهي). From this Knowledge, Allah shows mercy to whom He wills, forgives, punishes, dislikes, is pleased, and is angry. Where is anger compared to pleasure? Where is pardon compared to vengeance? Where is wrath compared to satisfaction? All of this has been conveyed by Divine reports in the revealed Books, and the People of Unveiling (أهل الكشف) know it through direct witnessing (مشاهدة عين). Were it not for what came upon the tongues of the Prophets and Messengers, and what the Books descended with from Allah through their hands, and were they not supported by miracles to establish their truthfulness before strangers regarding these Divine matters, so that they would be accepted when they brought them—for the proofs of the intellect deem them impossible in the Divine Presence—if one who witnessed and was unveiled of these matters spoke of them without the support of a sign indicating his truthfulness, he would be deemed ignorant, his view would be challenged, rational proofs would be established for the corruption of his intellect and thought, and it would be ruled that his imagination (خيال) had overcome him, and that Allah should not be described by these attributes. This was the reason for their descent through the hands of the Messengers and the Books, so that the witnesser may find comfort and familiarity with the discourse when such matters are presented.\n\n### [Were it not for the nobility of Knowledge, Insight would not be noble; Knowledge is the noblest of Attributes, and through it salvation is attained]\n\nIt is for these matters that the Divine Laws (الشرائع) were revealed, and for the rulings that would not suit the desires of leaders and authorities if they heard them from someone other than the Messenger. But when they became familiar with them from the Messengers, and souls grew accustomed to the rulings of the Divine Laws (النواميس الإلهية) and adopted them, it became easy for kings and leaders to become students of the righteous and submit their souls to their rulings, even if it was difficult for them. They prioritize their knowledge of this over the hardship they experience in contradicting their desires, for they entered into this condition willingly, and their argument stands against themselves. Glory be to the All-Knowing, the All-Wise! Were it not for the nobility of Knowledge (العلم), Insight (الفراسة) would not be noble, because if Insight did not grant knowledge, it would not be noble nor have any value. Knowledge is the noblest of Attributes, and through it salvation is attained, provided the human being makes it the ruler over himself and manages his affairs according to its ruling: \"My Lord, increase me in Knowledge! My Lord, increase me in Knowledge! My Lord, increase me in Knowledge!\" And employ me for it, and make it the ruler over me and the observer of me, since You are the Knowledge, the Knower, and the Known, for You, not for us. So grant us from it according to our capacity.\n\n### [The Physiognomy mentioned by the Sages]\n\nAs for the Physiognomy mentioned by the Sages (الحكماء), I shall mention a portion of it, based on what they established, experienced, and tested, followed by its consideration (اعتبار) in relation to the attributes, according to the requirements of our path in this book, briefly and sufficiently, God willing.\n\n### [The Beginning of the Creation of the Human Being of Moderate Constitution]\n\nKnow that when Allah the Exalted wills to create a human being of moderate constitution (معتدل النشأة), so that all his movements and actions may be upright, He grants success to the father in what rectifies his temperament, and likewise grants success to the mother. Thus, the semen from the male and female is rectified, the temperament of the womb is rectified, and the humors within it are moderated to the degree necessary for the rectification of the drop (النطفة). Allah appoints a felicitous ascendant (طالعاً سعيداً) for the descent of the fluid into the womb, through celestial movements that Allah has made a sign of rectification in the beings that will result. The man copulates with his wife under a felicitous ascendant and with a moderate temperament, and the fluid descends into a womb of moderate temperament. The womb receives it, and Allah grants success to the mother and provides her with an appetite for every nourishment that rectifies her temperament and that nourishes the drop in the womb. The drop then accepts formation in a moderate place, with moderate materials, and upright celestial movements.\n\n### [The Bodily and Psychic Features of the Human Being of Moderate Constitution]\n\nThe constitution emerges and stands upon the most moderate form. The constitution of its possessor is moderate: neither tall nor short, soft-fleshed, moist, between thick and thin, white tinged with redness and yellowness, with moderate hair, long, neither excessively straight nor extremely frizzy (القطط), with redness in his hair, not excessively black. He has a smooth face (أسيل الوجه), large eyes (أعين), his eye tending toward sinking and blackness, moderately large head, sloping shoulders (سائل الأكتاف), his neck having moderate straightness, moderate chest (اللبة), with no excessive flesh on his hips or back, a subtle voice, clear, neither excessively thick nor thin in the parts where thickness or thinness is desirable, long fingers (طويل البنان) due to thinness, a smooth palm, little speech and silence except when necessary. His temperaments incline toward the yellow bile (الصفراء) and black bile (السوداء). There is joy and happiness in his gaze. He is not greedy for wealth, does not seek to dominate you or seek leadership, and is neither hasty nor slow. The Sages said that this is the most moderate and wisest creation, and it is the creation upon which our Master Muhammad (peace and blessings be upon him) was created, so that perfection in constitution might be sound for him, just as perfection in rank (المرتبة) was sound for him. Thus, he was the most perfect of people in all aspects, outwardly and inwardly.\n\n### [The Mother's Role in Forming the Human Constitution]\n\nIf there happens to be a disturbance in the temperament of the womb, that disturbance must affect the human constitution in the womb, either in one of his limbs, or in most limbs, or in the fewest, depending on the material present at that time for that limb, due to the attractive force (القوة الجاذبة) in the drop. This then manifests either in the entire constitution or in some of its limbs.\n\n### [The Apparent Features Indicating Psychic Natures]\n\nAmong these indications, and Allah is the Granter of Success: Extreme whiteness combined with blondness and excessive blueness indicates impudence (القحة), treachery, immorality (الفسوق), and lightness of mind. If, in addition, he has a wide forehead, a narrow chin, is sparse-haired (أزعر), has a sunken face (أوجن), and much hair on his head, the Sages of Physiognomy said that guarding against a person with these characteristics is like guarding against deadly vipers. If the hair is coarse, it indicates courage and a healthy brain. If it is soft, it indicates cowardice, a cold brain, and lack of shrewdness. If there is much hair on the shoulders and neck, it indicates foolishness and audacity. If it is abundant on the chest and abdomen, it indicates a savage nature, lack of understanding, and love of injustice. Blondness indicates cowardice, frequent and quick anger, and dominance. Black hair indicates much stillness in the intellect, deliberation, and love of justice. Hair that is moderate between these two indicates moderation. If the forehead is flat with no wrinkles, it indicates contentiousness, mischief, vulgarity, and arrogance. If the forehead is moderate in prominence and width and has wrinkles, he is truthful, loving, understanding, knowledgeable, vigilant, prudent, and skillful. Whoever has large ears is ignorant, though he may be a good memorizer. Whoever has small ears is a thief and a fool. If the eyebrow has much hair, it indicates error (الغي) and trivial speech. If the eyebrow extends to the temple, its possessor is arrogant and conceited. Whoever has thin eyebrows that are moderate in length and shortness and are black is vigilant. If the eye is blue, it is the worst of eyes, and the worst of blue eyes is the non-turquoise one. Whoever has large, protruding eyes is envious, impudent, lazy, and untrustworthy. If they are blue, he is even worse, and may be deceitful. Whoever has moderate eyes, tending toward sinking, blackness, and kohl-like appearance, is vigilant, understanding, trustworthy, and loving. If the eye is long in proportion to the body, its possessor is malicious. Whoever has a fixed eye, with little movement, like a beast, with a dead gaze, is ignorant and coarse-natured. Whoever has rapid eye movement and sharp sight is a schemer, a thief, and treacherous. Whoever has red eyes is brave and daring. If there are yellow spots around them, the possessor is the most wicked and worst of people. If his nose is thin, its possessor is volatile. Whoever has a nose that almost enters his mouth is brave. Whoever has a flat nose (أفطس) is lustful. Whoever has a severely inflated nose is angry. If it is thick in the middle, tending toward flatness, he is a lying chatterbox. The most moderate of noses is one that is long without being excessively so. Whoever has a nose of moderate thickness and a moderate bridge indicates intellect and understanding. Whoever has a wide mouth is brave. Whoever has thick lips is a fool. Whoever has moderate lips in thickness with true redness is moderate. Whoever has crooked or protruding teeth is deceitful, scheming, and untrustworthy. Whoever has flat, light teeth with gaps between them is intelligent, trustworthy, reliable, and prudent. Whoever has a face with inflated cheeks is ignorant and coarse-natured. Whoever has a thin, yellow face is wicked, malicious, deceitful, and quarrelsome. Whoever has a long face is impudent. Whoever has inflated temples and full jugular veins is angry. Whoever you look at and he blushes and is embarrassed, perhaps his eyes tear up or he smiles a smile he does not intend, he is affectionate toward you, loves you, and holds you in awe in his soul. If he has a loud voice, it indicates courage. The voice that is moderate between roughness and softness, and between thickness and thinness, indicates intellect, prudence, truthfulness, and speed of speech. Thinness of voice indicates lying, impudence, and ignorance. Thickness in the voice indicates anger and bad character. Nasality (الغنة) in the voice indicates foolishness and lack of shrewdness and arrogance. Excessive movement indicates arrogance, babbling, and deceit. Dignity in sitting, measured speech, and moving the hand only in necessary speech indicates complete intellect, prudence, and sound mind. Shortness of the neck indicates malice and cunning. Excessive length and thinness of the neck indicate foolishness, cowardice, and shouting. If smallness of the head is added to these, it indicates foolishness and triviality. Thickness of the neck indicates ignorance and excessive eating. Moderation of the neck in length and thickness indicates intellect, prudence, sincerity of affection, trustworthiness, and truthfulness. A large belly indicates foolishness, ignorance, and cowardice. Subtlety of the belly and narrowness of the chest indicate good intellect and sound judgment. Broad shoulders and back indicate courage and lightness of mind. Curvature of the back indicates quarrelsome nature and volatility. Straightness of the back is a praiseworthy sign. Protrusion of the shoulders indicates bad intention and ugly doctrine. If the arms are long enough for the hand to reach the knee, it indicates courage, generosity, and nobility of soul. If they are short, the possessor is a coward who loves evil. A long palm with long fingers indicates proficiency in crafts, mastery of works, and prudent leadership. Thick flesh on the foot indicates ignorance and love of injustice. A small, soft foot indicates immorality. Thinness of the heel indicates beauty. Thickness of the heel indicates courage. Thickness of the calves along with the Achilles tendons indicates simple-mindedness and impudence. Whoever takes wide, slow steps is successful in all his works and considers their consequences, and the opposite is true for the opposite.\n\n### [Spiritual Discipline and the Application of Knowledge in Removing Every Blameworthy Attribute]\n\nThis is what I have transmitted from the sayings of the Sages, the experienced scholars of nature. These descriptions may increase or decrease, and the ruling belongs to the dominant factor. They may also be equal in a person, in which case the ruling of one is countered by the ruling of the other, such that the ruling of one applies in a specific case, and the ruling of the other applies in another specific case. In general, spiritual discipline (الرياضة) and the application of Knowledge (العلم) are effective in removing the ruling of every blameworthy attribute mentioned. Whoever tests this will find the truth of what we have said, for habit (العادة) is a fifth nature that has an effect on the original nature. All of this is tested and confirmed by the consideration (اعتبار) of the signs we mentioned, to which nature granted its ruling and which experience testified to.\n\n### [The Human Subtle Essence has a Face toward Light and a Face toward Darkness]\n\nKnow that since the human subtle essence (اللطيفة الإنسانية) that governs his body has a face toward the pure Light (النور المحض), which is its father, and a face toward Nature (الطبيعة), which is the pure Darkness (الظلمة المحضة) and is its mother, the rational soul (النفس الناطقة) is a mean (وسط) between Light and Darkness. The reason for its intermediate position is that it is a governor, like the Universal Soul (النفس الكلية) which is between the Intellect (العقل)—which is pure Light—and the Universal Hyle (الهيولى الكل)—which is a dark substance. Thus, this rational soul is like the Isthmus (البرزخ) between Light and Darkness, giving every possessor of right his due. Whenever one of the two extremes dominates it, it belongs to the dominant side. If it has no inclination toward either side, it receives matters in moderation, acts justly, and rules by the Truth (الحق). Let us now mention in this section the consideration of what was discussed regarding the signs of physiognomy in the body.\n\n### [Consideration of Whiteness, Blackness, Tallness, Shortness, and the Moderation of Flesh and Hair]\n\nWe say: As for excessive whiteness, it is the human being’s exhaustion in contemplating the world of Light (عالم النور), such that nothing remains in his exhaustion to govern his world of nature, like Abu Uqal al-Maghribi and his likes, so he quickly corrupts before attaining perfection. Likewise is the consideration of excessive blackness, which is his exhaustion in the world of his desire and nature, such that it prevents him from contemplating the sciences of Lights, which are the Divine Sciences. This state is blameworthy without dispute. If it is time by time, and he gives every possessor of right his due, as the Prophet (peace and blessings be upon him) said: \"I have a time when nothing can contain me but my Lord,\" then that is the Just Imam (الإمام العادل). As for the consideration of tallness and shortness, it is the duration of his stay in contemplation of one of the two worlds: either an extended duration (tallness) or a short one (shortness). What is required is that the duration be commensurate with the need. As for the moderation of flesh in moisture, and between thickness and thinness, it is the human being’s moderation in the Isthmus-like states (البرزخيات) between meaning (المعنى) and sensation (الحس), just as flesh is between bone and skin. As for the moderation of hair, it is his persistence between expansion (البسط) and contraction (القبض).\n\n### [Consideration of having a Smooth Face, Large Eyes, Protruding Eyes, Moderate Head, Sloping Shoulders, and Straight Neck]\n\nAs for having a smooth face (أسيل الوجه), it is cheerfulness and pleasantness. As for having large eyes (أعين), it is the soundness of observation in affairs. As for his eye tending toward sinking and blackness, it is contemplation of the unseen (المغيبات) and the extraction of hidden matters. As for protrusion (الجحوظة), it is his inclination to derive knowledge from the world of witnessing (عالم الشهادة), and these are the people of consideration (أهل الاعتبار). As for the moderation of the size of the head, it is the abundance of intellect. As for having sloping shoulders (سائل الأكتاف), it is enduring harm in absence without being affected. As for the straightness of the neck, it is looking out over things from a distance without inclining toward them.\n\n### [Consideration of the Length and Shortness of the Neck, the Moderation of the Chest, the Scarcity of Flesh, the Subtlety and Clarity of the Voice, and the Length of the Fingers]\n\nAs for excessive length of the neck, it is looking out over what is inappropriate, such as spying. As for excessive shortness, it is negligence regarding what should be looked out over. As for the moderation of the chest (اللبة), it is the uprightness of expression with the measure that brings benefit to the interlocutor. As for the scarcity of flesh on the hips and back, it is his contemplation of the matters upon which he relies and depends, ensuring that it leads him to neither of the two extremes, for if they are Isthmus-like (برزخية), he may be determined by them in most cases. As for his subtle voice (خفي الصوت), it is the preservation of secrets in the place of disclosure. As for the clarity of the voice, it is not adding anything to it. As for the length of the fingers (طول البنان), it is the subtlety of handling. As for the smoothness of the palm, it is casting away the world without attachment.\n\n### [Consideration of Little Speech and Laughter, and the Temperament's Inclination toward the Two Biles]\n\nAs for little speech and laughter, it is his observation of the loci of wisdom, so he speaks and laughs only as much as needed. As for his temperament inclining toward the two Biles (المرتين), it is that in the yellow bile (الصفراء) he is dominated by the tendency toward the celestial world, and in the black bile (السوداء) toward the lower world, extracting the hidden delight (قرة أعين) concealed within it, which nature conceals from most intellects when contemplating it, due to the prior notion in their minds of blaming nature. As for the joy and happiness in his gaze, it is attracting the souls of others to him through love. As for his lack of greed for wealth, it is distance from everything that inclines him toward what is useless to him. As for his not seeking to dominate you or seek leadership, it is his preoccupation with the perfection of his servitude, not with you. As for his being neither hasty nor slow, it means he is neither quick to seize when capable nor incapable.\n\n### [The Reference Point for the Masters of Judicial and Faith-based Insight in Dividing Matters into Praiseworthy and Blameworthy]\n\nLikewise, when we looked at the masters of Judicial Physiognomy (الفراسة الحكمية), we found that they refer back to two extremes and a mean (واسطة) in this matter. They divided affairs—meaning character traits—into praiseworthy and blameworthy. They placed all goodness in the mean and placed deviation in the two extremes. Regarding extreme whiteness, blondness, and blueness, they spoke of blame, saying it is not praiseworthy, as you heard. Likewise, extreme blackness and a very thin nose are blameworthy. All of this, and the moderate state between them, which does not incline toward either extreme beyond the limit, is the praiseworthy state, as previously mentioned. When we saw that they restricted it to what they mentioned, we looked at this in the human world: where do beauty and ugliness appear? We said: There is no beauty that grants rank with Allah, nor ugliness whose avoidance brings good from Allah, except what the Divine Law (الشرع) has deemed beautiful or ugly. Since we saw that praise and blame for an action come from the perspective of what has been legislated, we considered how to combine the two extremes and the mean, so that the two extremes contradict the ruling of the mean, which is the locus of moderation.\n\n### [The Human Being is necessarily one of three types, viewed through the Divine Law]\n\nWe say that the human being is necessarily one of three types, viewed through the Divine Law: Either he is purely esoteric (باطنيا محضا), meaning he advocates for the absolute purification of Unity (التوحيد) in state and action, and this leads to the nullification of the rulings of the Divine Law, like the Esoterics (الباطنية), and turning away from what the Lawgiver intended. Everything that leads to the demolition of a prescribed religious foundation is absolutely blameworthy in the view of every believer. Or he is purely exoteric (ظاهريا محضا), deeply entrenched and immersed, such that it leads him to anthropomorphism (التجسيم) and similitude (التشبيه). This, too, is similar, and is legally attached to blame. Or he follows the Divine Law according to the understanding of the language, moving where the Lawgiver moved and stopping where He stopped, step by step. This is the state of the mean (الوسط), and by this, the love of the Real (الحق) for him is confirmed. Allah the Exalted said, commanding His Prophet: <<فَاتَّبِعُونِي يُحْبِبْكُمُ اللهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ>> (So follow me, [and] Allah will love you and forgive you your sins). Following the Lawgiver and tracing his footsteps necessitates Allah’s love for the servants and the soundness of eternal felicity. This is the way of comparing the two versions. If someone asks, \"This is general; how is its detail known?\" We say: If we see a man who is quiet, attends prayers and congregations, yet is a persistent hypocrite, we say that the stillness, attendance of prayers, and similar things belong to the world of witnessing (عالم الشهادة), while his being an infidel in his heart belongs to the world of the unseen (عالم الغيب). When we attain the experiential Faith-based Insight (الفراسة الذوقية الإيمانية), as we described and as we shall complete, God willing, we rule in our souls that he is an infidel, but we keep his property and blood legally inviolable due to the manifestation of the word of Unity (كلمة التوحيد). Our dealing with him is on this basis, and we are not obligated beyond this.\n\n### [The Celestial World is the Mover of the World of Sensation and Witnessing]\n\nThen know, may Allah grant you success, that the celestial world (العالم العلوي) generally is the mover of the world of sensation and witnessing (عالم الحس والشهادة), and it is under its compulsion by a wisdom from Allah the Exalted, not by its own right. No ruling of movement, stillness, eating, drinking, speech, or silence appears in the world of witnessing except from the world of the unseen (عالم الغيب). This is because the animal only moves through intention (قصد) and will (إرادة), and these are actions of the heart. Will belongs to the world of the unseen, while movement and its like belong to the world of witnessing. The world of witnessing is everything we perceive by sensation habitually, and the world of the unseen is what we perceive by legal report or intellectual contemplation, which does not habitually appear in sensation.\n\n### [The Inner Sight for Perceiving the World of the Unseen and the Outer Sight for Perceiving the World of Witnessing]\n\nWe say that the world of the unseen is perceived by the inner sight (عين البصيرة), just as the world of witnessing is perceived by the outer sight (عين البصر). Just as the outer sight cannot perceive the world of witnessing—excluding darkness—unless the veil of darkness or similar impediments is lifted from it, when the impediments are lifted and the lights are spread upon the sensible things, and the light of the sight and the manifesting light combine, the observer perceives the visible things with the sight. Likewise, the veil of the inner sight is rust (الريون), desires (الشهوات), and the observation of others (الأغيار) from the dense natural world, and similar veils. These prevent it from perceiving the Kingdom (الملكوت), meaning the world of the unseen. When the human being attends to the mirror of his heart and polishes it with remembrance (الذكر) and recitation of the Quran, a light results from this. And Allah has a light spread over all existing things, called the Light of Existence (نور الوجود). When the two lights combine, the unseen things are unveiled as they truly are and as they occurred in Existence. However, there is a subtle difference between them: sensation is veiled by a wall, excessive distance, and excessive proximity, but the inner sight is not so; nothing veils it except what we mentioned, such as rust (الران), concealment (الكن), and similar things. Yet, there is also a subtle veil that I shall mention.\n\n### [The Light Spread over the Existential Presences and the Portion of the Unveiled Person from It]\n\nThis subtle veil is that the light spread from the Presence of Generosity (حضرة الجود) over the world of the unseen in the Existential Presences (الحضرات الوجودية) does not encompass all of them, nor is it spread over them for this unveiled person (المكاشف) except according to what Allah the Exalted wills. That is the station of Revelation (الوحي). Our proof for this is our own experience (ذوقنا) and, for others, His saying: <<قُلْ مَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَى إِلَيَّ>> (Say: I do not know what will be done with me or with you; I only follow what is revealed to me), despite the utmost Muhammadan purity, and His saying: <<أَوْ مِنْ وَرَاءِ حِجَابٍ>> (Or from behind a veil). Whenever something of this nature appears from one who has attained this station, manifesting outwardly regarding a specific person, that is Insight (الفراسة), and it is the highest degree of Unveiling (المكاشفة). Its place in the Book of Allah is: <<إِنَّ فِي ذَلِكَ لَآيَاتٍ لِلْمُتَوَسِّمِينَ>> (Indeed, in that are signs for those who discern [al-mutawassimīn]), derived from *al-simah* (the mark or sign), as we said. It never errs, unlike Judicial Physiognomy (الفراسة الحكمية).\n\n### [The Presence of Marks, in which are the Forms and States of the Children of Adam]\n\nThere is another type of unveiling in Insight. This is that Allah has established in the world the Presence of Marks (حضرة السمات), in which are the forms of the children of Adam and their states throughout their lifetimes until their separation. This is hidden from all creatures, celestial and terrestrial, except from the Pen (القلم) and the Tablet (اللوح). When Allah wills to choose a servant and distinguish him with this station, He purifies his heart, expands it, and places within it a luminous lamp (سراجا منيرا) specifically from his faith, which He lights from the Divine Names: the Name *al-Mu’min* (The Giver of Security) and *al-Muhaymin* (The Guardian). This Presence is in the hand of the latter Name, and that lamp is from the Presence of Divinity (حضرة الألوهة), taken by the Name *al-Mu’min*. When the heart is illuminated by that Divine light, and the light spreads into the corners of his heart along with the light of the inner sight, such that he attains the perception of perceptibles through Unveiling and Witnessing due to the existence of these lights, then, when the heart has attained what we mentioned, He places that Presence we spoke of in one of the courtyards of this heart. From there, he knows the movements and secrets of the world.",
    "ur": "(باب ایک سو اڑتالیس: فراست (الفراسة) کے مقام اور اس کے اسرار کی معرفت میں)\n\nبے شک فراست (الفراسة) نقل کا نور ہے، جسے نبی، رسول، مصطفیٰ، ہادی کے لفظ نے لایا ہے۔\nفراست (الفراسة) کا رب وہ ہے جس کے لیے اللہ تعالیٰ آنکھ اور کان بن جاتا ہے، اور یہی وہ نشأت ہے جو گاتی ہے۔\nاور انتہا صرف یہ ہے کہ اس کے ذریعے غیب اور شہود (إشهاد) میں قضیے کا الٹ قائم ہو جائے۔\n\n[فراست (الفراسة) ایک قہری الٰہی صفت ہے جس کا حکم بھٹکنے والوں (الشاردين) سے متعلق ہے]\n\nفراست (الفراسة) کا تعلق افتراس (شکار کرنے) سے ہے، لہٰذا یہ ایک قہری الٰہی صفت (نعت إلهي قهري) ہے جس کا حکم بھٹکنے والوں (الشاردين) پر اس صفت کے مالک کے خوف سے متعلق ہوتا ہے۔ بھٹکنے (الشرود) کا سبب طبعی خوف ہے، یا تو اپنی جان پر کہ وہ اپنے بدن سے جدا ہو جائے جس سے اسے الفت ہے اور جس میں اس کا اقتدار ظاہر ہوا ہے، یا اس مذمت کے لحاظ سے جو اس پر طبعی فراست (الفراسة الطبيعية) یا الٰہی فراست (الفراسة الإلهية) کے ذریعے شکار کرنے والا (المفترس) عائد کرتا ہے۔ اسی لیے یہ صرف بھٹکنے والوں سے متعلق ہوتی ہے، کیونکہ دنیا پر اپنی جانوں سے جہالت غالب ہے، اور ان کی جہالت کا سبب ترکیب (التركيب) ہے۔ اگر وہ عناصر سے مرکب نہ ہوتے بلکہ بسیط (بسائط) ہوتے تو وہ اس وصف سے متصف نہ ہوتے۔\n\n[جس میں فراست کی جائے (المتفرس فيه) اس میں فراست کرنے والے کے لیے کچھ علامات ہوتی ہیں، جن سے وہ رہنمائی حاصل کرتا ہے اور جن کے ذریعے وہ اسے ہدایت دیتا ہے]\n\nجان لو کہ جب بندہ فراست (الفراسة) سے متصف ہوتا ہے، تو جس میں فراست کی جائے (المتفرس فيه) اس میں اس کے لیے کچھ علامات ہوتی ہیں جن سے وہ رہنمائی حاصل کرتا ہے۔ ان علامات میں سے کچھ طبعی مزاجی (طبيعية مزاجية) ہوتی ہیں، اور یہ حکمی فراست (الفراسة الحكمية) ہے۔ اور کچھ روحانی، نفسیاتی، ایمانی (روحانية نفسية إيمانية) ہوتی ہیں، اور یہ الٰہی فراست (الفراسة الإلهية) ہے۔ یہ مومن کی بصیرت (بصيرة) کی آنکھ میں ایک الٰہی نور (نور إلهي) ہوتا ہے جس کے ذریعے وہ جانتا ہے، کیونکہ اس کے لیے وہ چیز منکشف (کشف) ہو جاتی ہے جو اس شخص سے واقع ہوئی ہے، یا جو اس سے واقع ہو گی، یا جس کی طرف اس کا معاملہ لوٹے گا۔ مومن کی فراست (الفراسة) طبعی فراست (الفراسة الطبيعية) سے زیادہ عام تعلق رکھتی ہے۔ کیونکہ فراست (الفراسة) علوم میں سے زیادہ سے زیادہ یہ علم دیتی ہے کہ اخلاق (الأخلاق) مذموم ہیں یا محمود، اور وہ چیز جو کاموں میں جلد بازی یا سستی کی طرف لے جاتی ہے، اور تمام جسمانی حرکات۔ میں اس باب میں ان دونوں فراستوں (الفراستين) کا ایک حصہ ان کی حقیقت کی تحقیق کے بعد بیان کروں گا۔\n\n[الٰہی فراست (الفراسة الإلهية) وہ سب کچھ دیتی ہے جو طبعی فراست دیتی ہے، اور اس سے زیادہ بھی]\n\nالٰہی فراست (الفراسة الإلهية) کا تعلق اس علم سے ہے جو طبعی فراست (الفراسة الطبيعية) دیتی ہے، اور اس میں اضافہ بھی ہے۔ وہ یہ کہ یہ نیک بخت (السعيد) کو بد بخت (الشقي) سے پہچاننے کی معرفت (المعرفۃ) دیتی ہے، اور انسان کی اس حرکت کو پہچاننے کی معرفت دیتی ہے جو اللہ کے نزدیک پسندیدہ ہے، اس حرکت سے جو ناپسندیدہ ہے اور جو اس نور کے مالک کی غیر موجودگی میں اس سے واقع ہوئی ہے۔ جب وہ شخص اس حرکت کے زمانے کے گزر جانے کے بعد اس کے سامنے حاضر ہوتا ہے، اور اس نے اس عضو میں وہ عمل چھوڑ دیا ہے جس سے وہ عمل ہوا تھا، تو ایک علامت باقی رہ جاتی ہے جسے صرف فراست (الفراسة) کا مالک ہی جانتا ہے۔ چنانچہ وہ اسے اس حرکت کے مطابق بتاتا ہے کہ وہ اطاعت تھی یا معصیت، جیسا کہ حضرت عثمان رضی اللہ عنہ کے ساتھ پیش آیا۔ ایک شخص ان کے پاس داخل ہوا، تو جب ان کی نظر اس پر پڑی تو فرمایا: \"یا سبحان اللہ! کیا حال ہے ان لوگوں کا جو اپنی نگاہوں کو اللہ کی حرام کردہ چیزوں سے نہیں جھکاتے؟\" اور وہ شخص کسی ایسی چیز کو دیکھ چکا تھا جو اس کے لیے حلال نہیں تھی، خواہ وہ کسی انسان کے ستر کو دیکھنا ہو یا کسی آباد گھر کے اندر جھانکنا ہو، یا اس سے ملتی جلتی کوئی چیز۔ اس شخص نے ان سے کہا: \"کیا رسول اللہ صلی اللہ علیہ وسلم کے بعد بھی وحی آتی ہے؟\" تو انہوں نے فرمایا: \"نہیں، لیکن یہ فراست (الفراسة) ہے۔ کیا تم نے رسول اللہ صلی اللہ علیہ وسلم کا یہ قول نہیں سنا:\n**اتقوا فراسة المؤمن فإنه ينظر بنور الله**\n(مومن کی فراست (الفراسة) سے ڈرو، کیونکہ وہ اللہ کے نور سے دیکھتا ہے)\nاور جب تم میرے پاس داخل ہوئے تو میں نے وہ چیز تمہاری آنکھوں میں دیکھی۔ یہ ہمارے اس قول کا مطلب ہے کہ وہ اس عضو میں ایک علامت چھوڑ جاتی ہے جس سے وہ محمود یا مذموم عمل ہوا تھا۔\n\n[طبعی فراست (الفراسة الطبيعية) اور اس کے عطیات]\n\nطبعی فراست (الفراسة الطبيعية) اپنے تمام افعال، اقوال، حرکات اور سکنات میں معتدل (المعتدل) شخص کی معرفت دیتی ہے، اور ان سب میں منحرف (المنحرف) شخص کی معرفت بھی دیتی ہے۔ چنانچہ وہ اس کے اعضاء اور ہر عضو کی نشأت کو دیکھ کر اناڑی (الأخرق) اور عاقل (العاقل)، ذہین (الذكي) اور کند ذہن (الفدم الغمر)، شہوت پرست (الشبق) اور غیر شہوت پرست، غضبناک (الغضوب) اور غیر غضبناک، خبیث (الخبيث) اور غیر خبیث، دھوکہ باز (الخداع المحتال) اور سادہ لوح (السليم المسلم)، اور بے چین (النزق) اور غیر بے چین کے درمیان فرق کرتی ہے، اور اسی طرح کی دیگر چیزیں۔\n\n[ایمانی فراست (الفراسة الإيمانية) بصیرت (البصيرة) کی آنکھ میں نور ہے، جیسا کہ بصارت کی آنکھ کے لیے نور ہوتا ہے]\n\nسب سے پہلے یہ جان لو کہ ایمانی فراست (الفراسة الإيمانية)، جس سے ہم آغاز کر رہے ہیں، ایک الٰہی نور (نور إلهي) ہے جو مومن کو بصیرت (البصيرة) کی آنکھ کے لیے دیا جاتا ہے، جو بصارت (البصر) کی آنکھ کے لیے نور کی مانند ہوتا ہے۔ اور جس میں فراست کی جائے (المتفرس فيه) اس میں علامت سورج کے نور کی طرح ہوتی ہے جس سے محسوسات (المحسوسات) بصارت کے لیے ظاہر ہوتے ہیں۔ جس طرح بصارت اپنے اندر موجود نور کے ذریعے اور سورج کے نور کے ذریعے جو محسوسات کو منکشف کرتا ہے، فرق کرتی ہے اور ان کے چھوٹے کو بڑے سے، خوبصورت کو بدصورت سے، سفید کو سیاہ سے، سرخ کو پیلے سے، متحرک کو ساکن سے، دور کو قریب سے، اور اونچے کو نیچے سے پہچانتی ہے، اسی طرح ایمانی فراست (الفراسة الإيمانية) کا نور محمود کو مذموم سے پہچانتا ہے۔\n\n[مومن کی فراست (الفراسة) کے نور کو اللہ کی طرف منسوب کرنے میں حکمت]\n\nفراست (الفراسة) کے نور کو اللہ کی طرف منسوب کیا گیا ہے، جو اسماء کے احکام کے لیے جامع اسم ہے، کیونکہ یہ محمود اور مذموم کو، اور آخرت میں سعادت کی حرکات اور شقاوت کی حرکات کو منکشف کرتا ہے۔ یہاں تک کہ بعض لوگ جب کسی شخص کے زمین پر قدم کا نشان دیکھتے ہیں، جبکہ وہ شخص موجود نہیں ہوتا، تو کہتے ہیں کہ یہ نیک بخت (سعيد) کا قدم ہے اور یہ بد بخت (شقي) کا قدم ہے۔ جیسا کہ قائف (اثر کا پیچھا کرنے والا) کرتا ہے، جو کہتا ہے کہ اس نشان کا مالک مثلاً سفید رنگ کا ہے، کانا ہے، اور اس کی ساخت کو اس طرح بیان کرتا ہے گویا اس نے اسے دیکھا ہو۔ اور جو عارضی چیزیں اس کی تخلیق میں پیش آئی ہیں، وہ سب اس کے نشان میں دیکھتا ہے بغیر اس کے کہ اس شخص کو دیکھے۔ اور وہ نسبوں کے بارے میں حکم لگاتا ہے اور بچے کو اس کے باپ سے ملاتا ہے اگر ظاہری مشابہت کی کمی کی وجہ سے اختلاف ہو جو عام طور پر باپوں اور بیٹوں کے درمیان ہوتی ہے۔\n\n[کواکب کی حرکات اور افلاک علویہ میں ان کا تیرنا]\n\nچنانچہ فراست (الفراسة) کے نور کو اسی وجہ سے اللہ کی طرف منسوب کیا گیا۔ اگر اسے مثلاً اسم الحمید کی طرف منسوب کیا جاتا تو اس نور کا مالک صرف محمود اور نیک بخت کو ہی دیکھتا۔ اسی طرح اگر اسے کسی بھی الٰہی اسم کی طرف منسوب کیا جاتا تو وہ اس اسم کی حقیقت کے مطابق ہوتا۔ جب اس نور کو اللہ کی طرف منسوب کیا گیا تو اس کے ذریعے دنیا اور آخرت میں واقع ہونے والی خیرات اور شرور، مذمتیں اور تعریفیں، اور اخلاق (الأخلاق) کی خوبیاں اور ان کی پستی، اور جو کچھ طبیعت (الطبيعة) دیتی ہے اور جو کچھ روحانیت (الروحانية) دیتی ہے، سب کا ادراک کیا۔ اور یہ نور شرعی احکام (الأحكام الشرعية) کے درمیان فرق کرتا ہے، جو پانچ احکام ہیں۔ اور یہ نور اس بات کی معرفت دیتا ہے کہ اس حرکت کا مالک کس الٰہی اسم (الأسماء الإلهية) پر بھروسہ کرتا ہے، اور کون سی علوی ارواح (الأرواح العلوية) اس کی طرف دیکھتی ہیں، اور کواکب کی حرکات (الحركات الكوكبية) میں اس کے لیے کیا نشانیاں ہیں۔ کیونکہ اللہ نے ان کا افلاک میں تیرنا بے کار نہیں بنایا، بلکہ ان امور کے لیے جو اللہ تعالیٰ نے ان کے مجموعے میں، ان کی حرکات میں، اور فلک اقصیٰ میں مقرر کردہ برجوں (البروج المقدرة) میں ان کے قطع کرنے میں ودیعت کیے ہیں۔ اور یہ اللہ کا قول ہے: **وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا** (اور اس نے ہر آسمان میں اس کا حکم وحی کر دیا)۔ چنانچہ وہ اس تیراکی میں ان امور کو انجام دیتے ہیں جن کی ذمہ داری انہیں سونپی گئی ہے اور جن کی عنصری دنیا (العالم العنصري) کو ضرورت ہے۔\n\n[طبیعت (الطبيعة) کو اللہ نے نفس (النفس) سے نیچے اور ہباء (الهباء) سے اوپر پیدا کیا]\n\nجان لو کہ طبیعت (الطبيعة) جسے اللہ تعالیٰ نے پیدا کیا، وہ نفس (النفس) سے نیچے اور ہباء (الهباء) سے اوپر ہے۔ جب اللہ نے طبعی اجسام (الأجسام الطبيعية) کو وجود میں لانا چاہا، اور ہمارے نزدیک صرف طبعی یا عنصری جسم ہی ہے، اور عناصر طبعی اجسام ہیں، اگرچہ ان سے دوسرے اجسام پیدا ہوتے ہیں، تو یہ سب اللہ کے آثار ہیں اس طبیعت (الطبيعة) میں جسے اللہ نے پیدا کیا۔ اور طبیعت (الطبيعة) چار امور کا نام ہے جو جب ایک خاص طریقے سے ملتے ہیں تو اس الفت کے مناسب چیز پیدا ہوتی ہے، عزیز و علیم کے اندازے کے مطابق۔ اسی لیے دنیا کے اجسام اس مزاج (المزاج) کے اختلاف کی وجہ سے مختلف ہو گئے، چنانچہ ہر جسم کو اس کے مزاج کے تقاضے کے مطابق دنیا میں عطا کیا گیا۔\n\n[عناصر کی تخلیق، اور وہ چار ارکان ہیں]\n\nاور معاملہ اسی طرح نیچے اترتا رہا یہاں تک کہ اللہ نے عناصر (العناصر) کو پیدا کیا، اور وہ چار ارکان ہیں۔ چنانچہ اس نے حرارت کو خشکی کے ساتھ ایک خاص طریقے سے ملایا، تو اس آمیزش سے آگ کا رکن (ركن النار) بنا، جسے عنصر نار بھی کہتے ہیں۔ پھر اسی طرح ہوا، پھر پانی، پھر مٹی۔ پھر اللہ سبحانہ و تعالیٰ نے انہیں واسطوں سے اور بغیر واسطوں کے ایک دوسرے میں تبدیل کرنا شروع کیا۔ جب دو عنصر ہر لحاظ سے ایک دوسرے سے متنفر ہوتے ہیں تو وہ مناسب عنصر میں تبدیل ہو جاتے ہیں، پھر وہ مناسب عنصر دوسرے قریب ترین مناسب عنصر میں تبدیل ہو جاتا ہے جو پہلے تبدیل ہونے والے عنصر سے متنفر تھا، چنانچہ وہ اس قریب ترین مناسب عنصر کے واسطے سے، خواہ وہ ہلکا ہو یا گاڑھا، اس میں تبدیل ہونے کو قبول کرتا ہے۔\n\n[حیوانی جسم کی تخلیق چار طبائع سے]\n\nپھر اللہ نے حیوانی جسم کو چار طبائع سے پیدا کیا، اور وہ ہیں دو صفرا (المرتان)، خون (الدم) اور بلغم (البلغم)۔ اور اللہ سبحانہ و تعالیٰ نے ان اخلاط میں روحانی قوتیں (قوى روحانية) رکھیں جن کے آثار ان سے مرکب جسم میں ظاہر ہوتے ہیں۔ اگر یہ اخلاط اس جسم میں جو ان سے ظاہر ہوا ہے، اعتدال (الاعتدال) پر ہوں یا اعتدال کے قریب ہوں، تو وہ اعتدال کے عطیات دیتے ہیں، یعنی مستحسن اور محمود امور اور معاملات میں اقتصادی حرکات۔ اور اگر وہ اس میں اعتدال پر نہ ہوں تو وہ اس انحراف (الانحراف) کے مطابق عطیات دیتے ہیں جس کی طرف وہ مائل ہوئے، اور ان اخلاط میں سے سب سے قوی اور زیادہ کا اقتدار بدن میں ظاہر ہوتا ہے، جس سے جسم پر علتیں (علل) اور نفس پر اخلاق (أخلاق) طاری ہوتے ہیں۔\n\n[بدنی، نفسیاتی اور روحانی علتیں (العلل) اور ان کا علاج]\n\nچنانچہ طبیب (الطبيب) علتوں (العلل) کا علاج ان اخلاط میں کمی کو پورا کرنے اور زائد کو کم کرنے سے کرتا ہے تاکہ اعتدال (الاعتدال) حاصل ہو جائے۔ اور الٰہی طبیب (الطبيب الإلهي) اخلاق (الأخلاق) کا علاج کرتا ہے اور نفسانی اغراض (الأغراض النفسية) کی سیاست ذکر (الذكرى)، موعظت (الموعظة)، اور اعلیٰ امور کی طرف توجہ دلانے سے کرتا ہے، اور اس سعادت اور تعریف پر جو اس کے حامل کے لیے اللہ کے نزدیک، لوگوں کے نزدیک، اور علوی ارواح کے نزدیک ہے۔ اس سے نفس ناطقہ (النفس الناطقة) کو تقویت ملتی ہے اور یہ ذکر اس بگڑے ہوئے مزاج کی اصلاح میں مددگار ہوتا ہے، چنانچہ یہ بدن کی طبیعت کے مدبر طبیب کی مدد کرتا ہے اور اس میں جو خرابی آئی ہے اس کی اصلاح کرتا ہے۔ اسی لیے بعض اطباء خاص بیماریوں کے مریضوں کو خوش کن دھنیں (الألحان المطربة) سننے، خوبصورت اور مختلف پھولوں والی جگہوں، پانی کے بہنے کی آواز، اور بلبل جیسے پرندوں کے چہچہانے کے استعمال کا حکم دیتے ہیں۔ یہ سب روحانی طب (طب روحاني) ہے جو مزاج کی اصلاح کی طرف لے جاتا ہے اور طبیب کی مدد کرتا ہے۔ اور کچھ دوسری علتیں (علل) ہیں جو آوازوں کو برداشت نہیں کرتیں، بلکہ ان کی اصلاح اس کے برعکس چیزوں سے ہوتی ہے جو ہم نے ذکر کیں۔ اور یہ سب غالب اور قوی خلط اور اس کے مخالف کی کمزوری کے مطابق ہوتا ہے۔\n\n[وہ اصلی علتیں (العلل) جو مزاج اور خلقت میں موجود ہیں]\n\nاور یہ علتیں (العلل) مزاج اور خلقت میں اصلی ہوتی ہیں، جیسے آنکھوں کا باہر نکلنا (الجحوظة) یا حد سے زیادہ اندر دھنس جانا (الغئورة المفرطة)، یا بہت پتلی ناک یا بہت موٹی ناک، یا سوراخوں کا بہت کشادہ اور پھولا ہوا ہونا یا اس کے برعکس، یا شدید سفیدی یا شدید سیاہی، یا بالوں کا گھنگریالا ہونا (الجعودة) یا بہت زیادہ سیدھا ہونا (السبوطة)، یا فیروزی آنکھ میں شدید نیلا پن (الزرقة الشديدة)، یا انتہائی سرمگی پن (الكحولة الغائية)۔ اور اسی طرح باقی اعضاء میں عدم اعتدال (عدم الاعتدال) یعنی اعتدال سے کسی ایک طرف انحراف (الانحراف) جیسا کہ ہم نے ذکر کیا۔ کیونکہ انسان کی تخلیق ان اعضاء کے اعتدال (اعتدال) اور انحراف (انحراف) کے مطابق ہوتی ہے۔\n\n[الٰہی طبیب (الطبيب الإلهي) خواہ وہ نبی ہو، وارث ہو یا حکیم]\n\nچنانچہ جب یہ الٰہی طبیب (الطبيب الإلهي) آتا ہے، جو نبی ہو یا وارث ہو یا حکیم ہو، تو وہ دیکھتا ہے کہ یہ نشأت (النشأة) کیا تقاضا کرتی ہے، جو اس کے تابع ہو گئی ہے اور اس کی لگام اس کے ہاتھ میں دے دی گئی ہے تاکہ وہ اس کی تربیت کرے اور اس کی سعادت کے لیے کوشش کرے۔ اور اگر وہ منحرف (منحرف) ہو تو اسے اس انحراف (الانحراف) کے وہ مصارف (استعمالات) بتاتا ہے جن کی اللہ تعریف کرتا ہے اور جن میں اس نفس کی سعادت ہوتی ہے۔ کیونکہ اس کے لیے یہ ممکن نہیں کہ وہ اسے کوئی دوسری نشأت (نشأة أخرى) دے۔ تمہارا رب تخلیق سے فارغ ہو چکا ہے، اور ہمارے ہاتھ میں صرف مصارف (استعمالات) کی وضاحت باقی ہے۔ چنانچہ معتدل نشأت (المعتدل النشأة) والا شخص اگر اللہ کے نزدیک سعادت کے امور سے جاہل ہو، جن کے لیے ایک موقف (رہنما) کی ضرورت ہے، اور وہ رسول اللہ صلی اللہ علیہ وسلم ہیں، تو وہ علماء سے ان امور کے بارے میں پوچھتا ہے جو اللہ کے نزدیک سعادت دیتے ہیں۔\n\n[معتدل نشأت (المعتدل النشأة) والا، منحرف (المنحرف) اور مکارم اخلاق (مكارم الأخلاق)]\n\nاور جہاں تک مکارم اخلاق (مكارم الأخلاق) کا تعلق ہے، تو اس میں کسی موقف (رہنما) کی ضرورت نہیں، کیونکہ اس کی نشأت کا مزاج اور اس کا اعتدال صرف مکارم اخلاق ہی دیتا ہے۔ بلکہ اسے بعض امور میں انحراف (الانحراف) کے استعمال میں موقف کی ضرورت ہوتی ہے، اور وہ اس میں مکلف ہوتا ہے کیونکہ اس انحراف میں دنیاوی یا اخروی یا دونوں طرح کی مصلحتیں ہوتی ہیں۔ اور جہاں تک منحرف (المنحرف) کا تعلق ہے، تو اس سے مذموم اخلاق (مذام الأخلاق) اور ان کی پستی ظاہر ہوتی ہے، اور وہ اپنے اندر موجود اغراض کے نفاذ کا طالب ہوتا ہے اور انہیں حاصل کرنے میں اپنے انجام کی پرواہ نہیں کرتا۔ چنانچہ سیاست دان طبیب (الطبيب السؤوس) اسے حال در حال مصارف (المصارف) کی وضاحت کے ذریعے آہستہ آہستہ راہ راست پر لاتا ہے، جیسا کہ ہم نے ذکر کیا۔\n\n[ایمانی فراست (الفراسة الإيمانية) کا مالک جس میں فراست کی جائے (المتفرس فيه) اس کی سیاست (تربیت) کیسے کرتا ہے]\n\nچنانچہ جب ایمانی فراست (الفراسة الإيمانية) کا مالک آتا ہے، اور وہ اس شخص کے لیے مصلحت کو جانتا ہے جس میں فراست کی جائے (المتفرس فيه)، اور اس سے کوئی ایسی حرکت دیکھتا ہے جو مذموم کی طرف لے جاتی ہے یا وہ حرکت اس سے مذموم طور پر واقع ہو چکی ہے، تو وہ اس کی سیاست (تربیت) کرتا ہے یہاں تک کہ وہ اس پر قابو پا لیتا ہے اور وہ شخص اپنی جان اس کے حوالے کر دیتا ہے تاکہ وہ اس میں حکم چلائے۔ اگر وہ منحرف (منحرف) ہو تو اس کے سلوک میں مجاہدہ (مجاهدة) اور ریاضت (رياضة) ہوتی ہے۔ اور اگر وہ معتدل ہو تو اس کا سلوک خوشگوار، لذت بخش، خوشی اور مسرت والا ہوتا ہے، اس پر وہ مشکل امور آسان ہو جاتے ہیں جو دوسروں پر مشکل ہوتے ہیں، اور مکارم اخلاق (مكارم الأخلاق) میں سے کسی بھی چیز میں اسے کوئی مشقت نہیں ہوتی۔ جب اس کا نفس پاکیزہ ہو جاتا ہے اور عالم مطہر (العالم المطهر) سے جا ملتا ہے، اور الٰہی آنکھ سے دیکھتا ہے، اس سے سنتا ہے، اور اس کی قوت سے حرکت کرتا ہے، تو وہ امور کے مصادر اور ان کے نتائج کو جان لیتا ہے، اور یہ جانتا ہے کہ وہ کس چیز سے شروع ہوتے ہیں اور کس چیز پر ختم ہوتے ہیں۔ اسی کو ایمانی فراست (الفراسة الإيمانية) سے تعبیر کیا جاتا ہے، اور یہ اللہ تعالیٰ کی طرف سے ایک موہبت (موهبة) ہے جسے سلیم الطبع اور غیر سلیم الطبع دونوں حاصل کرتے ہیں۔\n\n[دنیا میں اعتدال (الاعتدال) اور انحراف (الانحراف) کی اصل، جو بعض اصولوں کے بعض پر غالب آنے کا سبب بنتی ہے]\n\nاور دنیا میں اعتدال (الاعتدال) اور انحراف (الانحراف) کی اصل، اور وہ چیز جو مرکبات میں بعض اصولوں کے بعض پر غالب آنے کا سبب بنتی ہے، الٰہی علم (العلم الإلهي) کے آثار میں سے ہے، جس سے اللہ جسے چاہتا ہے رحم کرتا ہے، بخشتا ہے، عذاب دیتا ہے، ناپسند کرتا ہے، راضی ہوتا ہے، اور غضبناک ہوتا ہے۔ اور غضب کہاں اور رضا کہاں، اور عفو کہاں اور انتقام کہاں، اور ناراضگی کہاں اور رضوان کہاں۔ اور یہ سب الٰہی خبروں میں نازل شدہ کتابوں میں آیا ہے، اور اہل کشف (الکشف) نے اسے مشاہدہ عین (مشاهدة عين) سے جانا ہے۔ اگر یہ امور انبیاء اور رسولوں کی زبانوں پر نہ آتے اور اللہ کی طرف سے ان کے ہاتھوں پر کتابیں نازل نہ ہوتیں، اور انہیں معجزات سے تائید نہ ملتی تاکہ اجنبیوں کے نزدیک ان کی سچائی ثابت ہو، تو ان الٰہی امور کی وجہ سے ان کی بات قبول نہ کی جاتی۔ کیونکہ عقل کے دلائل انہیں جناب الٰہی میں محال قرار دیتے ہیں۔ اگر کوئی مشاہدہ کرنے والا (مشاهد) یا مکاشف (مکاشف) ان باتوں کو کسی نشانی کی تائید کے بغیر بیان کرتا جو اس کی سچائی پر دلالت کرتی، تو اسے جاہل قرار دیا جاتا اور اس کی نظر پر طعن کیا جاتا، اور عقلی دلائل اس کی عقل اور فکر کے فساد پر قائم کیے جاتے، اور یہ حکم لگایا جاتا کہ اس کے خیال نے اس پر غلبہ پا لیا ہے، اور یہ کہ اللہ کو ان اوصاف سے متصف کرنا مناسب نہیں۔ چنانچہ رسولوں کے ہاتھوں اور کتابوں کے ذریعے ان کا نزول اسی وجہ سے ہوا تاکہ مشاہدہ کرنے والا (المشاهد) ان سے سکون حاصل کرے اور جب وہ اس قسم کی بات لائے تو اس کے کلام سے مانوس ہو۔\n\n[اگر علم (العلم) کی شرافت نہ ہوتی تو فراست (الفراسة) کی شرافت نہ ہوتی، پس علم اشرف الصفات ہے اور اسی سے نجات حاصل ہوتی ہے]\n\nچنانچہ انہی امور کی خاطر شریعتیں (الشرائع) نازل ہوئیں، اور ان احکام کی خاطر جو رؤساء اور پیشواؤں کی اغراض کے موافق نہیں ہوتے اگر وہ انہیں رسول کے علاوہ کسی اور سے سنتے۔ لیکن جب وہ رسولوں سے ان کے عادی ہو گئے اور نفوس الٰہی قوانین (النواميس الإلهية) کے احکام سے مانوس ہو گئے اور انہیں اپنا لیا، تو بادشاہوں اور رؤساء کے لیے صالحین کے شاگرد بننا اور اپنے نفوس کو ان کے احکام کے تحت لانا آسان ہو گیا، اگرچہ یہ ان پر شاق گزرتا ہو۔ چنانچہ وہ اس مشقت کے باوجود اپنے علم کو ترجیح دیتے ہیں جو انہیں اس کے خلاف کرنے سے حاصل ہوتی ہے۔ کیونکہ اس نے اسی شرط پر اپنے آپ کو داخل کیا ہے، لہٰذا اس کی حجت اس پر قائم ہے۔ پس سبحان العلیم الحکیم۔ اور اگر علم (العلم) کی شرافت نہ ہوتی تو فراست (الفراسة) کی شرافت نہ ہوتی، کیونکہ فراست (الفراسة) اگر علم نہ دیتی تو وہ شریف نہ ہوتی اور نہ اس کی کوئی قدر ہوتی۔ پس علم اشرف الصفات ہے اور اسی سے نجات (النجاة) حاصل ہوتی ہے، جب انسان اسے اپنے اوپر حاکم بنائے اور اس کے حکم کے مطابق اپنے معاملات میں تصرف کرے۔ **رَبِّ زِدْنِي عِلْماً، رَبِّ زِدْنِي عِلْماً، رَبِّ زِدْنِي عِلْماً** (اے میرے رب! میرے علم میں اضافہ فرما، اے میرے رب! میرے علم میں اضافہ فرما، اے میرے رب! میرے علم میں اضافہ فرما)۔ اور مجھے اس کے لیے استعمال فرما، اور اسے مجھ پر حاکم اور مجھ پر نگاہ رکھنے والا بنا، کیونکہ علم، عالم اور معلوم تو تیرے لیے ہے نہ کہ ہمارے لیے، پس ہمیں ہماری قدر کے مطابق اس میں سے عطا فرما۔\n\n[حکماء کے نزدیک مذکور فراست (الفراسة)]\n\nاور جہاں تک حکماء کے نزدیک مذکور فراست (الفراسة) کا تعلق ہے، تو میں ان کے اصولوں اور ان کے تجربات اور آزمائشوں کے مطابق اس کا ایک حصہ ذکر کروں گا، پھر اس کتاب میں اپنے طریقے کے مطابق اس کی علامات پر غور کروں گا، جو ان شاء اللہ مختصر اور کافی ہو گا۔\n\n[معتدل نشأت (المعتدل النشأة) والے انسان کی تخلیق کا آغاز]\n\nجان لو کہ جب اللہ تعالیٰ کسی معتدل نشأت (المعتدل النشأة) والے انسان کو پیدا کرنا چاہتا ہے تاکہ اس کی تمام حرکات اور تصرفات سیدھے ہوں، تو وہ باپ کو اس چیز کی توفیق دیتا ہے جس میں اس کے مزاج کی اصلاح ہو، اور ماں کو بھی اسی کی توفیق دیتا ہے۔ چنانچہ مرد اور عورت کا مادہ منویہ صالح ہوتا ہے، اور رحم کا مزاج صالح ہوتا ہے، اور اس میں اخلاط اس قدر اعتدال پر ہوتے ہیں جس سے نطفے کی اصلاح ہوتی ہے۔ اور اللہ تعالیٰ پانی کے رحم میں اترنے کے لیے ایک سعید طالع (طالعا سعيدا) کا وقت مقرر کرتا ہے، جو فلکی حرکات کے ذریعے ہوتا ہے جسے اللہ نے اس وقت ہونے والی مخلوقات میں صلاح کی علامت بنایا ہے۔ چنانچہ مرد اپنی بیوی سے معتدل مزاج کے ساتھ سعید طالع میں جماع کرتا ہے، تو پانی معتدل مزاج کے رحم میں اترتا ہے، اور رحم اسے قبول کرتا ہے۔ اور اللہ ماں کو توفیق دیتا ہے اور اسے ہر اس غذا کی خواہش عطا کرتا ہے جس میں اس کے مزاج کی اصلاح ہو اور جس سے رحم میں نطفہ غذا حاصل کرے۔ چنانچہ نطفہ معتدل جگہ، معتدل مواد اور سیدھی فلکی حرکات میں تصویر قبول کرتا ہے۔\n\n[معتدل نشأت (المعتدل النشأة) والے انسان کی بدنی اور نفسیاتی علامات]\n\nفتخرج النشأة وتقوم على أعدل صورة فتكون نشأة صاحبها معتدلة ليس بالطويل ولا بالقصير لين اللحم رطبة بين الغلظ والرقة أبيض مشربا بحمرة وصفرة معتدل الشعر طويله ليس بالسبط ولا الجعد القطط في شعره حمرة ليس بذاك السواد أسيل الوجه أعين عينه مائلة إلى الغور والسواد معتدل عظيم الرأس سائل الأكتاف في عنقه استواء معتدل اللبة ليس في وركه ولا صلبه لحم خفي الصوت صاف ما غلظ منه وما رق مما يستحب منه غلظة أو رقته في اعتدال طويل البنان للرقة سبط الكف قليل الكلام والصمت إلا عند الحاجة ميل طبائعه إلى الصفراء والسوداء في نظره فرح وسرور قليل الطمع في المال ليس يريد التحكم عليك ولا الرئاسة ليس بعجلان ولا بطي‏ء فهذا قالت الحكماء أعدل الخلقة وأحكمها وفيها خلق سيدنا محمد صَلَّى اللهُ عَليهِ وسَلَّم ليصح له الكمال في النشأة كما صح له الكمال في المرتبة فكان أكمل الناس من جميع الوجوه ظاهرا وباطنا\n\nچنانچہ نشأت (النشأة) نکلتی ہے اور سب سے زیادہ معتدل صورت پر قائم ہوتی ہے۔ چنانچہ اس کے مالک کی نشأت معتدل ہوتی ہے، نہ بہت لمبا نہ بہت چھوٹا، نرم گوشت والا، رطوبت میں اور موٹائی اور پتلے پن کے درمیان معتدل، سفید جس میں سرخی اور زردی ملی ہوئی ہو، معتدل بال، لمبے، نہ بہت سیدھے نہ بہت گھنگریالے، اس کے بالوں میں سرخی ہو، بہت زیادہ سیاہ نہ ہو، ہموار چہرے والا، بڑی آنکھوں والا، اس کی آنکھیں اندر دھنسنے اور سیاہی کی طرف مائل ہوں، معتدل، بڑا سر، ڈھلکے ہوئے کندھے، اس کی گردن میں سیدھا پن ہو، سینہ معتدل ہو، اس کے کولہے اور کمر پر گوشت کم ہو، آواز دھیمی اور صاف ہو، جو حصہ موٹا ہونا پسندیدہ ہے وہ موٹا ہو اور جو پتلا ہونا پسندیدہ ہے وہ پتلا ہو، اعتدال کے ساتھ، پتلے پن کی وجہ سے لمبی انگلیاں، ہتھیلی ہموار، کم بولنے والا اور خاموش رہنے والا مگر ضرورت کے وقت، اس کی طبائع صفرا (الصفراء) اور سوداء (السوداء) کی طرف مائل ہوں، اس کی نظر میں خوشی اور مسرت ہو، مال کا کم لالچی ہو، تم پر حکمرانی یا سرداری نہیں چاہتا، نہ جلد باز ہو نہ سست۔ حکماء نے کہا کہ یہ سب سے زیادہ معتدل اور محکم خلقت ہے، اور ہمارے آقا محمد صلی اللہ علیہ وسلم اسی میں پیدا ہوئے تاکہ نشأت میں ان کے لیے کمال صحیح ہو، جیسا کہ مرتبے میں ان کے لیے کمال صحیح ہوا، چنانچہ وہ تمام پہلوؤں سے، ظاہری اور باطنی طور پر، سب سے کامل انسان تھے۔\n\n[انسانی نشأت (النشأة) کی تشکیل میں ماں کا کردار]\n\nاگر رحم کے مزاج میں کوئی خرابی ہو جائے، تو اس خرابی کا اثر رحم میں انسان کی نشأت (النشأة) پر اس کے کسی عضو میں یا زیادہ تر اعضاء میں یا کم از کم اعضاء میں ضرور پڑتا ہے، اس مادہ کے مطابق جو اس وقت اس عضو کے لیے نطفے میں موجود قوت جاذبہ (القوة الجاذبة) سے ہوتا ہے۔ چنانچہ وہ خرابی یا تو پوری نشأت میں ظاہر ہوتی ہے یا اس کے بعض اعضاء میں۔\n\n[ظاہری خدوخال جو نفسیاتی طبائع پر دلالت کرتے ہیں]\n\nاور اللہ کی توفیق سے، ان میں سے یہ ہے کہ خالص سفیدی شقرت (سنہرے پن) اور بہت زیادہ نیلاہٹ (زرقة) کے ساتھ بے حیائی (القحة)، خیانت، فسق اور عقل کی کمی کی دلیل ہے۔ اگر اس کے ساتھ پیشانی چوڑی ہو، ٹھوڑی تنگ ہو، کم بالوں والا، گالوں پر گوشت ہو، سر پر بال زیادہ ہوں، تو حکماء میں سے اہل فراست (الفراسة) نے کہا کہ ایسے شخص سے بچنا ایسا ہی ہے جیسے زہریلے سانپوں سے بچنا۔ اگر بال سخت ہوں تو شجاعت اور دماغ کی صحت پر دلالت کرتے ہیں۔ اور اگر نرم ہوں تو بزدلی، دماغ کی سردی اور کم ذہانت پر دلالت کرتے ہیں۔ اور اگر کندھوں اور گردن پر بال زیادہ ہوں تو حماقت اور جرات پر دلالت کرتے ہیں۔ اور اگر سینے اور پیٹ پر زیادہ ہوں تو طبع کی وحشت، کم فہمی اور ظلم سے محبت پر دلالت کرتے ہیں۔ اور شقرت (سنہرا پن) بزدلی، زیادہ غصہ، اس کی تیزی اور تسلط کی دلیل ہے۔ اور بالوں کا سیاہ ہونا عقل میں زیادہ سکون، بردباری اور عدل سے محبت پر دلالت کرتا ہے۔ اور ان دونوں کے درمیان کا رنگ اعتدال پر دلالت کرتا ہے۔ اور اگر پیشانی ہموار ہو اور اس میں کوئی شکن نہ ہو تو جھگڑالو پن، شرارت، بے وقوفی اور تکبر پر دلالت کرتی ہے۔ اور اگر پیشانی ابھار اور کشادگی میں متوسط ہو اور اس میں شکنیں ہوں تو وہ سچا، محبت کرنے والا، سمجھدار، عالم، بیدار اور ماہر مدبر ہوتا ہے۔ اور جس کے کان بڑے ہوں وہ جاہل ہوتا ہے، مگر حافظہ اچھا ہوتا ہے۔ اور جس کے کان چھوٹے ہوں وہ چور اور احمق ہوتا ہے۔ اور اگر بھنویں زیادہ بالوں والی ہوں تو گمراہی اور بے ہودہ کلام پر دلالت کرتی ہیں۔ اور اگر بھنویں کنپٹی تک لمبی ہوں تو اس کا مالک متکبر اور مغرور ہوتا ہے۔ اور جس کی بھنویں پتلی ہوں اور لمبائی اور چھوٹائی میں معتدل ہوں اور سیاہ ہوں تو وہ بیدار ہوتا ہے۔ اور اگر آنکھ نیلی ہو تو وہ بدترین آنکھیں ہیں، اور فیروزی نیلاہٹ بدترین ہے۔ اور جس کی آنکھیں بڑی ہوں اور باہر نکلی ہوئی ہوں (جاحظت) تو وہ حسد کرنے والا، بے حیا، سست اور غیر محفوظ ہوتا ہے۔ اور اگر نیلی ہو تو زیادہ سخت ہوتا ہے، اور دھوکہ باز بھی ہو سکتا ہے۔ اور جس کی آنکھیں متوسط ہوں اور اندر دھنسنے اور سرمگی پن اور سیاہی کی طرف مائل ہوں تو وہ بیدار، سمجھدار، قابل اعتماد اور محبت کرنے والا ہوتا ہے۔ اور جب آنکھ بدن کی لمبائی میں ہو تو اس کا مالک خبیث ہوتا ہے۔ اور جس کی آنکھیں جانور کی طرح ساکن اور کم حرکت والی ہوں، نظر مردہ ہو، تو وہ جاہل اور غلیظ الطبع ہوتا ہے۔ اور جس کی آنکھ میں تیزی سے حرکت ہو اور نظر میں تیزی ہو تو وہ حیلہ گر، چور اور غدار ہوتا ہے۔ اور جس کی آنکھ سرخ ہو تو وہ بہادر اور دلیر ہوتا ہے۔ اور اگر اس کے ارد گرد پیلے نقطے ہوں تو اس کا مالک بدترین اور گھٹیا ترین لوگوں میں سے ہوتا ہے۔ اور جس کی ناک پتلی ہو تو اس کا مالک بے چین (نزق) ہوتا ہے۔ اور جس کی ناک تقریباً اس کے منہ میں داخل ہو جائے تو وہ بہادر ہوتا ہے۔ اور جس کی ناک چپٹی ہو (أفطس) تو وہ شہوت پرست ہوتا ہے۔ اور جس کی ناک بہت زیادہ پھولی ہوئی ہو تو وہ غضبناک ہوتا ہے۔ اور جب وہ بیچ میں موٹی ہو اور چپٹی ہونے کی طرف مائل ہو تو وہ جھوٹا اور بکواس کرنے والا ہوتا ہے۔ اور سب سے معتدل ناک وہ ہے جو غیر فاحش لمبائی والی ہو۔ اور جس کی ناک درمیانی موٹائی والی ہو اور اس کا پل (قناة) غیر فاحش ہو تو وہ عقل اور فہم کی دلیل ہے۔ اور جس کا منہ کشادہ ہو تو وہ بہادر ہوتا ہے۔ اور جس کے ہونٹ موٹے ہوں تو وہ احمق ہوتا ہے۔ اور جس کے ہونٹ موٹائی میں متوسط ہوں اور خالص سرخی کے ساتھ ہوں تو وہ معتدل ہوتا ہے۔ اور جس کے دانت ٹیڑھے ہوں یا باہر نکلے ہوئے ہوں تو وہ دھوکہ باز، حیلہ گر اور غیر محفوظ ہوتا ہے۔ اور جس کے دانت ہموار ہوں، ہلکے ہوں اور ان کے درمیان فاصلہ ہو تو وہ عاقل، قابل اعتماد، محفوظ اور مدبر ہوتا ہے۔ اور جس کے چہرے کا گوشت پھولا ہوا ہو اور گال بھرے ہوئے ہوں تو وہ جاہل اور غلیظ الطبع ہوتا ہے۔ اور جس کا چہرہ پتلا اور پیلا ہو تو وہ برا، خبیث، دھوکہ باز اور بد مزاج ہوتا ہے۔ اور جس کا چہرہ لمبا ہو تو وہ بے حیا ہوتا ہے۔ اور جس کی کنپٹیاں پھولی ہوئی ہوں اور گردن کی رگیں بھری ہوئی ہوں تو وہ غضبناک ہوتا ہے۔ اور جسے تم دیکھو اور وہ شرم سے سرخ ہو جائے، اور شاید اس کی آنکھوں میں آنسو آ جائیں یا وہ ایسی مسکراہٹ مسکرائے جو وہ نہیں چاہتا، تو وہ تم سے محبت کرنے والا اور تمہارے لیے مائل ہے، اور اس کے دل میں تمہاری ہیبت ہے۔ اور اگر اس کی آواز بلند ہو تو وہ شجاعت پر دلالت کرتی ہے۔ اور جو آواز سختی اور نرمی کے درمیان اور جلد بازی اور بردباری کے درمیان معتدل ہو، وہ عقل، تدبیر اور سچائی پر دلالت کرتی ہے۔ اور کلام کی تیزی اور اس کا پتلا پن جھوٹ، بے حیائی اور جہالت پر دلالت کرتا ہے۔ آواز میں موٹائی غصہ اور بد اخلاقی کی دلیل ہے۔ آواز میں گنگناہٹ حماقت اور کم ذہانت اور تکبر کی دلیل ہے۔ زیادہ حرکت تکبر، بکواس اور دھوکہ دہی کی دلیل ہے۔ اور بیٹھنے میں وقار، الفاظ کو سنبھال کر بولنا، اور فضول باتوں میں ہاتھ کی حرکت نہ کرنا، عقل کی پختگی، تدبیر اور عقل کی صحت کی دلیل ہے۔ گردن کا چھوٹا ہونا خباثت اور مکر کی دلیل ہے۔ گردن کا لمبا اور پتلا ہونا حماقت، بزدلی اور چیخنے چلانے کی دلیل ہے۔ اگر اس کے ساتھ سر چھوٹا ہو تو یہ حماقت اور بے وقوفی پر دلالت کرتا ہے۔ گردن کا موٹا ہونا جہالت اور زیادہ کھانے کی دلیل ہے۔ گردن کا لمبائی اور موٹائی میں اعتدال عقل، تدبیر، مخلص محبت، اعتماد اور سچائی کی دلیل ہے۔ بڑا پیٹ حماقت، جہالت اور بزدلی کی دلیل ہے۔ پیٹ کا پتلا ہونا اور سینے کا تنگ ہونا اچھی عقل اور اچھی رائے پر دلالت کرتا ہے۔ کندھوں اور کمر کا چوڑا ہونا شجاعت اور عقل کی تیزی پر دلالت کرتا ہے۔ کمر کا جھکا ہونا بد مزاجی اور بے چینی پر دلالت کرتا ہے۔ کمر کا سیدھا ہونا ایک محمود علامت ہے۔ کندھوں کا ابھرا ہونا بری نیت اور برے مذہب کی دلیل ہے۔ جب بازو اتنے لمبے ہوں کہ ہتھیلی گھٹنے تک پہنچ جائے تو یہ شجاعت، سخاوت اور نفس کی شرافت پر دلالت کرتا ہے۔ اور جب چھوٹے ہوں تو اس کا مالک بزدل اور شر سے محبت کرنے والا ہوتا ہے۔ لمبی ہتھیلی لمبی انگلیوں کے ساتھ صنعتوں میں نفوذ، کاموں کو مضبوط کرنے اور سرداری کی تدبیر پر دلالت کرتی ہے۔ پاؤں میں موٹا گوشت جہالت اور ظلم سے محبت پر دلالت کرتا ہے۔ چھوٹا، نرم پاؤں فجور پر دلالت کرتا ہے۔ ایڑی کا پتلا ہونا خوبصورتی پر دلالت کرتا ہے۔ ایڑی کا موٹا ہونا شجاعت پر دلالت کرتا ہے۔ پنڈلیوں کا موٹا ہونا ٹخنوں کے ساتھ سادگی اور بے حیائی پر دلالت کرتا ہے۔ جس کا قدم وسیع اور آہستہ ہو، وہ اپنے تمام کاموں میں کامیاب ہوتا ہے اور ان کے انجام پر غور کرنے والا ہوتا ہے۔ اور اس کا الٹ اس کے الٹ ہوتا ہے۔\n\n[ریاضت (الرياضة) اور علم (العلم) کا استعمال ہر مذموم صفت کو زائل کرنے میں]\n\nیہ وہ ہے جو میں نے حکماء (الحكماء) کے اقوال سے نقل کیا ہے جو طبعی علوم کے تجربہ کار علماء میں سے ہیں۔ اور یہ صفات کم یا زیادہ ہو سکتی ہیں، اور حکم غالب صفت کا ہوتا ہے۔ اور کبھی یہ شخص میں برابر ہو جاتی ہیں، تو ایک کا حکم دوسرے کے حکم کو دفع کر دیتا ہے، اس طرح کہ شخص میں ان میں سے ایک کا حکم کسی خاص قضیے میں ایک پہلو سے ہو، اور دوسرے کا حکم کسی دوسرے پہلو سے کسی خاص قضیے میں ہو۔ اور بالعموم، ریاضت (الرياضة) اور علم (العلم) کا استعمال ہر مذموم صفت کے حکم کو زائل کرنے میں مؤثر ہے۔ اور جس نے تجربہ کیا اس نے ہماری بات کی صحت پائی۔ کیونکہ عادت (العادة) ایک پانچویں طبیعت ہے جو اصلی طبیعت پر اثر انداز ہوتی ہے۔ یہ سب تجربہ شدہ اور محقق ہے اس اعتبار میں جو ہم نے ان علامات کے بارے میں ذکر کیا جن میں طبیعت نے اپنا حکم دیا اور تجربات نے اس کی گواہی دی۔\n\n[ان علامات پر غور و فکر کا تسلسل جن میں طبیعت نے اپنا حکم دیا اور تجربات نے اس کی گواہی دی]\n\n[انسانی لطیفہ (اللطيفة الإنسانية) کا ایک رخ نور (النور) کی طرف اور ایک رخ ظلمت (الظلمة) کی طرف ہے]\n\nجان لو کہ انسان کا لطیفہ (لطيفة الإنسان) جو اس کے جسم کی تدبیر کرتا ہے، چونکہ اس کا ایک رخ خالص نور (النور المحض) کی طرف ہے جو اس کا باپ ہے، اور ایک رخ طبیعت (الطبيعة) کی طرف ہے جو خالص ظلمت (الظلمة المحضة) ہے اور اس کی ماں ہے، اس لیے نفس ناطقہ (النفس الناطقة) نور اور ظلمت کے درمیان وسط میں ہے۔ اور اس کے وسط میں ہونے کا سبب یہ ہے کہ وہ مدبر ہے، جیسے نفس کلیہ (النفس الكلية) جو عقل (خالص نور) اور ہیولیٰ کل (جو ایک تاریک جوہر ہے) کے درمیان ہے۔ چنانچہ یہ نفس ناطقہ (النفس الناطقة) نور اور ظلمت کے درمیان برزخ (البرزخ) کی مانند ہے، جو ہر حقدار کو اس کا حق دیتا ہے۔ جب اس پر کوئی ایک طرف غالب آ جاتی ہے تو وہ اس کی ہو جاتی ہے جو اس پر غالب آیا۔ اور اگر اس کا کسی بھی طرف کوئی میلان نہ ہو تو وہ امور کو اعتدال (الاعتدال) پر قبول کرتا ہے، انصاف کرتا ہے اور حق کے ساتھ حکم دیتا ہے۔ اب ہم اس وصل میں جسم میں فراست (الفراسة) کی علامات پر غور کرتے ہیں۔\n\n[سفیدی، سیاہی، لمبائی، چھوٹائی، اور گوشت اور بالوں کے اعتدال پر غور]\n\nہم کہتے ہیں: جہاں تک حد سے زیادہ سفیدی کا تعلق ہے، تو یہ نور (النور) کی دنیا میں انسان کا اتنا زیادہ مشغول ہونا ہے کہ اس کے مشغول ہونے میں وہ چیز باقی نہیں رہتی جس سے وہ اپنی طبیعت (الطبيعة) کی دنیا کی تدبیر کر سکے، جیسے ابو عقال مغربی اور ان جیسے لوگ، چنانچہ وہ کمال حاصل ہونے سے پہلے ہی جلدی خراب ہو جاتا ہے۔ اور اسی طرح حد سے زیادہ سیاہی کا اعتبار ہے، اور وہ اس کی شہوت اور طبیعت کی دنیا میں مشغول ہونا ہے، اس طرح کہ وہ اسے انوار کے علوم (العلوم الإلهية) میں دیکھنے سے روکتا ہے۔ چنانچہ یہ بالاتفاق مذموم الحال ہے۔ اور اگر وہ وقت بہ وقت ہو اور ہر حقدار کو اس کا حق دے، جیسا کہ صلی اللہ علیہ وسلم نے فرمایا: \"میرے لیے ایک وقت ایسا ہوتا ہے جس میں میرے رب کے سوا کوئی نہیں سما سکتا\"، تو وہ امام عادل ہے۔ اور جہاں تک لمبائی اور چھوٹائی کا اعتبار ہے، تو یہ دونوں جہانوں میں سے کسی ایک میں اس کے قیام کی مدت ہے، یا تو ایک طویل مدت (لمبائی) یا ایک مختصر مدت (چھوٹائی)۔ اور اس سے یہ ہونا چاہیے کہ مدت ضرورت کے مطابق ہو۔ اور جہاں تک رطوبت میں اور موٹائی اور پتلے پن کے درمیان گوشت کے اعتدال کا تعلق ہے، تو یہ معنی (المعنى) اور حس (الحس) کے درمیان برزخیات (البرزخيات) میں انسان کا اعتدال ہے، جیسے گوشت ہڈی اور جلد کے درمیان ہے۔ اور جہاں تک بالوں کے اعتدال کا تعلق ہے، تو یہ بسط (پھیلاؤ) اور قبض (سکڑاؤ) کے درمیان اس کا قیام ہے۔\n\n[اس کے ہموار چہرے، بڑی آنکھوں، باہر نکلی ہوئی آنکھوں، معتدل سر، ڈھلکے ہوئے کندھوں اور سیدھی گردن پر غور]\n\nاور جہاں تک اس کے ہموار چہرے کا تعلق ہے، تو یہ کشادگی (الطلاقة) اور بشاشت (البشاشة) ہے۔ اور جہاں تک اس کے بڑی آنکھوں والے ہونے کا تعلق ہے، تو یہ امور میں نظر کی صحت ہے۔ اور جہاں تک اس کی آنکھ کے اندر دھنسنے اور سیاہی کی طرف مائل ہونے کا تعلق ہے، تو یہ مغیبات (المغيبات) میں دیکھنا اور پوشیدہ امور کو نکالنا ہے۔ اور جہاں تک آنکھوں کے باہر نکلنے (الجحوظة) کا تعلق ہے، تو یہ عالم شہود (عالم الشهادة) سے علوم کو اخذ کرنے کی طرف اس کا میلان ہے، اور یہ اہل اعتبار (اہل الاعتبار) ہیں۔ اور جہاں تک سر کی ہڈی کے اعتدال کا تعلق ہے، تو یہ عقل کی فراوانی (توفير العقل) ہے۔ اور جہاں تک اس کے ڈھلکے ہوئے کندھوں کا تعلق ہے، تو یہ غیبت میں بغیر کسی اثر کے اذیت کو برداشت کرنا ہے۔ اور جہاں تک گردن کے سیدھے ہونے کا تعلق ہے، تو یہ چیزوں پر جھکاؤ کے بغیر ان پر نگاہ ڈالنا ہے۔\n\n[گردن کی لمبائی اور چھوٹائی، سینے کے اعتدال، گوشت کی کمی، آواز کی دھیماہٹ اور صفائی، اور انگلیوں کی لمبائی پر غور]\n\nاور جہاں تک گردن کی زائد لمبائی کا تعلق ہے، تو یہ ان چیزوں پر نگاہ ڈالنا ہے جو مناسب نہیں، جیسے جاسوسی (التجسس)۔ اور جہاں تک حد سے زیادہ چھوٹائی کا تعلق ہے، تو یہ اس چیز میں کوتاہی کرنا ہے جس پر نگاہ ڈالنی چاہیے۔ اور جہاں تک سینے (اللبة) کے اعتدال کا تعلق ہے، تو یہ اس وزن کے ساتھ عبارت (العبارة) کی استقامت ہے جس سے مخاطب کو فائدہ پہنچے۔ اور جہاں تک کولہے اور کمر میں گوشت کی کمی کا تعلق ہے، تو یہ ان امور میں اس کی نظر ہے جن پر وہ بھروسہ کرتا ہے اور جن پر وہ اعتماد کرتا ہے کہ وہ اسے دونوں انتہاؤں میں سے کسی ایک سے نجات دلائیں گے، کیونکہ وہ غالب طور پر برزخی (برزخية) ہو سکتے ہیں۔ اور جہاں تک اس کی آواز کے دھیما ہونے کا تعلق ہے، تو یہ بلند آواز کی جگہ راز کو محفوظ رکھنا ہے۔ اور جہاں تک آواز کی صفائی کا تعلق ہے، تو یہ ہے کہ وہ اس میں کوئی چیز اضافہ نہ کرے۔ اور جہاں تک انگلیوں کی لمبائی کا تعلق ہے، تو یہ لینے میں لطافت (لطافة التناول) ہے۔ اور جہاں تک ہتھیلی کے ہموار ہونے کا تعلق ہے، تو یہ دنیا کو بغیر کسی تعلق کے پھینک دینا ہے۔\n\n[کم کلامی، کم ہنسی، اور طبیعت کا دو صفراؤں (المرتين) کی طرف میلان پر غور]\n\nاور جہاں تک کم کلامی اور کم ہنسی کا تعلق ہے، تو یہ حکمت کے مقامات (مواقع الحكمة) پر اس کی نظر ہے، چنانچہ وہ ضرورت کے مطابق بولتا اور ہنستا ہے۔ اور جہاں تک اس کی طبائع کا دو صفراؤں (المرتين) کی طرف میلان کا تعلق ہے، تو یہ ہے کہ اس پر صفرا (الصفراء) میں عالم علوی (العالم العلوي) کی طرف جھکاؤ غالب ہو، اور سوداء (السوداء) میں عالم سفلی (العالم السفلي) کی طرف جھکاؤ غالب ہو، اور اس میں پوشیدہ چیزوں کو نکالنا جو آنکھوں کی ٹھنڈک ہیں، جنہیں طبیعت اکثر عقلوں سے دیکھنے میں چھپا دیتی ہے، اس وجہ سے کہ ان کے ذہنوں میں طبیعت کی مذمت پہلے سے موجود ہوتی ہے۔ اور جہاں تک اس کی نظر میں خوشی اور مسرت کا تعلق ہے، تو یہ محبت کے ذریعے دوسروں کے نفوس کو اپنی طرف کھینچنا ہے۔ اور جہاں تک مال میں اس کے کم لالچی ہونے کا تعلق ہے، تو یہ ہر اس چیز سے دوری ہے جو اسے ایسی چیز کی طرف مائل کرے جس میں اس کے لیے کوئی فائدہ نہیں۔ اور جہاں تک اس کے تم پر حکمرانی یا سرداری نہ چاہنے کا تعلق ہے، تو یہ اس کا اپنی عبودیت (عبوديته) کے کمال میں مشغول ہونا ہے نہ کہ تمہاری سرداری میں۔ اور جہاں تک اس کے نہ جلد باز اور نہ سست ہونے کا تعلق ہے، یعنی وہ قدرت کے باوجود نہ تو لینے میں تیز ہو اور نہ ہی عاجز۔\n\n[حکمی اور ایمانی فراست (الفراسة) کے مالکوں کا امور کو محمود اور مذموم میں تقسیم کرنے کا مرجع]\n\nاسی طرح جب ہم نے حکمی فراست (الفراسة الحكمية) کے مالکوں کو دیکھا تو ہم نے پایا کہ وہ اس میں دو انتہاؤں اور ایک واسطے کی طرف رجوع کرتے ہیں، اور انہوں نے امور کو محمود اور مذموم میں تقسیم کیا، یعنی اخلاق (الأخلاق) کو۔ اور انہوں نے تمام خیر کو وسط میں رکھا، اور انحراف (الانحراف) کو دونوں انتہاؤں میں رکھا۔ چنانچہ انہوں نے شدید سفید، سنہرے اور نیلی آنکھوں والے کے بارے میں وہی مذمت کہی جو تم نے سنی، اور یہ کہ وہ محمود نہیں ہے۔ اور اسی طرح شدید سیاہ اور بہت پتلی ناک والا بھی مذموم ہے۔ یہ سب کچھ ہے، اور ان کے درمیان معتدل جو کسی بھی انتہا کی طرف مائل نہ ہو، وہ محمود ہے، جیسا کہ پہلے بیان ہوا۔ چنانچہ جب ہم نے دیکھا کہ انہوں نے اسے اسی پر محدود کر دیا ہے جو ہم نے ذکر کیا، تو ہم نے اس انسانی دنیا میں دیکھا کہ حسن اور قبح کہاں ظاہر ہوتا ہے۔ تو ہم نے کہا کہ اللہ کے نزدیک نہ کوئی حسن ہے جس سے مرتبہ حاصل ہو، اور نہ کوئی قبح ہے جس سے اللہ کی طرف سے خیر سے بچا جائے، مگر وہ جسے شریعت (الشرع) نے حسن قرار دیا اور جسے قبیح قرار دیا۔ چنانچہ جب ہم نے دیکھا کہ تعریف اور مذمت فعل پر شریعت کے لحاظ سے ہے، تو ہم نے غور کیا کہ ہم دو انتہاؤں اور ایک واسطے کو کیسے جمع کریں تاکہ دونوں انتہائیں وسط کے حکم کے مخالف ہوں، جو اعتدال (الاعتدال) کا مقام ہے۔\n\n[شریعت (الشرع) کے لحاظ سے انسان تین میں سے ایک حالت سے خالی نہیں ہوتا]\n\nہم کہتے ہیں کہ شریعت (الشرع) کے لحاظ سے انسان تین میں سے ایک حالت سے خالی نہیں ہوتا: یا تو وہ خالص باطنی (باطنيا محضا) ہو، اور وہ ہمارے نزدیک حال اور فعل میں توحید (التوحيد) کو مجرد کرنے کا قائل ہے، اور یہ شرعی احکام (أحكام الشرع) کو معطل کرنے کی طرف لے جاتا ہے، جیسے باطنیہ، اور شارع کی مراد سے ہٹ جانا۔ اور ہر وہ چیز جو کسی مشروع دینی بنیاد کو منہدم کرنے کی طرف لے جائے، وہ ہر مومن کے نزدیک مطلقاً مذموم (مذموم بالإطلاق) ہے۔ یا وہ خالص ظاہری (ظاهريا محضا) ہو، جو اتنا گہرا ہو جائے کہ وہ اسے تجسیم (التجسيم) اور تشبیہ (التشبيه) کی طرف لے جائے، تو یہ بھی اسی طرح شرعاً مذموم کے ساتھ ملحق ہے۔ یا وہ شریعت (الشرع) کے ساتھ زبان کی سمجھ کے مطابق چلنے والا ہو، جہاں شارع چلا وہ چلا اور جہاں وہ رکا وہ قدم بہ قدم رکا۔ اور یہ وسط کی حالت ہے، اور اسی سے حق کی محبت اس کے لیے صحیح ہوئی۔ اللہ تعالیٰ نے اپنے نبی سے فرمایا کہ وہ کہیں: **فَاتَّبِعُونِي يُحْبِبْكُمُ اللهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ** (پس تم میری پیروی کرو، اللہ تم سے محبت کرے گا اور تمہارے گناہ بخش دے گا)۔ چنانچہ شارع کی پیروی اور اس کے نقش قدم پر چلنا اللہ کی بندوں سے محبت اور دائمی سعادت کی صحت کو واجب کرتا ہے۔ یہ دونوں نسخوں کے مقابلے کا پہلو ہے۔ اگر کوئی کہنے والا کہے کہ یہ مجمل ہے، تو اس کی تفصیل کیسے معلوم ہو گی؟ ہم کہتے ہیں کہ اگر ہم کسی شخص کو خاموش دیکھیں جو نمازیں اور جماعتیں ادا کرتا ہے، اور اس کے باوجود وہ منافق (منافق) ہے اور اصرار کرنے والا ہے، تو ہم کہتے ہیں کہ خاموشی اور نمازوں میں حاضر ہونا اور اس جیسی چیزیں عالم شہود (عالم الشهادة) سے ہیں، اور اس کا دل میں کافر ہونا عالم غیب (عالم الغيب) سے ہے۔ اور جب ہمیں ذوقی ایمانی فراست (الفراسة الذوقية الإيمانية) حاصل ہو جائے، جیسا کہ ہم نے ذکر کیا اور جیسا کہ ہم ان شاء اللہ اسے مکمل کریں گے، تو ہم اپنے نفوس میں اس کے کافر ہونے کا حکم لگائیں گے، اور اس کے مال اور خون کو شرعاً معصوم رکھیں گے، کیونکہ کلمہ توحید کا ظہور ہے۔ چنانچہ ہمارا اس کے ساتھ معاملہ اسی حد پر ہے، اور ہمیں اس کے علاوہ کسی چیز کا مکلف نہیں کیا گیا۔\n\n[عالم علوی (العالم العلوي) ہی عالم حس اور شہود (الشهادة) کو حرکت دینے والا ہے]\n\nپھر جان لو، اللہ تمہیں توفیق دے، کہ عالم علوی (العالم العلوي) بالعموم عالم حس اور شہود (الشهادة) کو حرکت دینے والا ہے۔ اور یہ اللہ کی طرف سے ایک حکمت ہے، نہ کہ اس کے اپنے استحقاق کی وجہ سے۔ اور عالم شہود (عالم الشهادة) میں حرکت، سکون، کھانا، پینا، کلام یا خاموشی کا کوئی حکم ظاہر نہیں ہوتا مگر عالم غیب (عالم الغيب) سے۔ اور یہ اس طرح ہے کہ حیوان قصد (قصد) اور ارادے (إرادة) کے بغیر حرکت نہیں کرتا، اور یہ دونوں قلب (القلب) کا عمل ہیں۔ اور ارادہ عالم غیب (عالم الغيب) سے ہے، اور حرکت اور اس جیسی چیزیں عالم شہود (عالم الشهادة) سے ہیں۔ اور عالم شہود وہ ہے جسے ہم عادت کے مطابق حس سے ادراک کرتے ہیں، اور عالم غیب وہ ہے جسے ہم شرعی خبر یا فکری نظر سے ادراک کرتے ہیں، جو عادت کے مطابق حس میں ظاہر نہیں ہوتا۔\n\n[عالم غیب (عالم الغيب) کے ادراک کے لیے بصیرت (البصيرة) کی آنکھ اور عالم شہود (عالم الشهادة) کے ادراک کے لیے بصارت (البصر) کی آنکھ]\n\nہم کہتے ہیں کہ عالم غیب (عالم الغيب) کا ادراک بصیرت (البصيرة) کی آنکھ سے ہوتا ہے، جیسا کہ عالم شہود (عالم الشهادة) کا ادراک بصارت (البصر) کی آنکھ سے ہوتا ہے۔ اور جس طرح بصارت (البصر) عالم شہود کا ادراک نہیں کرتی، سوائے ظلمت کے، جب تک کہ اس سے ظلمت کا حجاب یا اس جیسی کوئی رکاوٹ دور نہ ہو جائے، اور جب رکاوٹیں دور ہو جاتی ہیں اور انوار محسوسات (المحسوسات) پر پھیل جاتے ہیں، اور بصارت کا نور اور ظاہر کرنے والا نور جمع ہو جاتا ہے، تو دیکھنے والا بصارت کے ذریعے دیکھی جانے والی چیزوں کا ادراک کرتا ہے۔ اسی طرح بصیرت (البصيرة) کی آنکھ کا حجاب زنگ (الريون)، شہوات (الشهوات)، اور کثیف طبعی دنیا (العالم الطبيعي الكثيف) سے اغیار کا ملاحظہ کرنا ہے، جو اس طرح کے حجابات ہیں۔ چنانچہ یہ اس کے اور ملکوت (یعنی عالم غیب) کے ادراک کے درمیان حائل ہو جاتے ہیں۔ جب انسان اپنے دل کے آئینے کا قصد کرتا ہے اور اسے ذکر (الذكر) اور تلاوت قرآن سے جلا دیتا ہے، تو اسے اس سے ایک نور حاصل ہوتا ہے۔ اور اللہ کا ایک نور ہے جو تمام موجودات پر پھیلا ہوا ہے جسے نور الوجود (نور الوجود) کہا جاتا ہے۔ جب دونوں نور جمع ہو جاتے ہیں تو مغیبات (پوشیدہ چیزیں) اسی طرح منکشف (کشف) ہو جاتی ہیں جس طرح وہ ہیں اور جس طرح وہ وجود میں واقع ہوئی ہیں۔ مگر ان دونوں کے درمیان ایک لطیف معنی کا فرق ہے، اور وہ یہ ہے کہ حس کو دیوار، حد سے زیادہ دوری اور حد سے زیادہ قربت روکتا ہے، جبکہ بصیرت (البصيرة) کی آنکھ ایسی نہیں ہے، اسے سوائے زنگ (الران) اور کن (پوشیدگی) اور اس جیسی چیزوں کے کوئی چیز نہیں روکتی۔ مگر اس کے باوجود ایک لطیف حجاب ہے جسے میں ذکر کرتا ہوں۔\n\n[وجود کی حضرات (الحضرات الوجودية) پر پھیلا ہوا نور اور مکاشف (المكاشف) کا اس میں حصہ]\n\nاور وہ یہ ہے کہ وہ نور جو حضرۃ الجود (حضرة الجود) سے عالم غیب (عالم الغيب) پر وجود کی حضرات (الحضرات الوجودية) میں پھیلا ہوا ہے، وہ ان سب کو محیط نہیں ہوتا، اور نہ ہی اس مکاشف (المكاشف) کے حق میں ان پر پھیلتا ہے مگر اس قدر جتنا اللہ تعالیٰ چاہتا ہے۔ اور یہی مقام وحی (مقام الوحي) ہے۔ ہماری دلیل ہمارے لیے ہمارا ذوق (ذوقنا) ہے، اور دوسروں کے لیے اللہ کا یہ قول ہے: **قُلْ مَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ** (کہہ دو کہ میں نہیں جانتا کہ میرے ساتھ کیا کیا جائے گا اور نہ تمہارے ساتھ، میں تو صرف اس کی پیروی کرتا ہوں جو میری طرف وحی کیا جاتا ہے)۔ یہ محمدی صفائی کی انتہا کے باوجود ہے، اور اللہ کا یہ قول: **أَوْ مِن وَرَاءِ حِجَابٍ** (یا پردے کے پیچھے سے)۔ چنانچہ جو کچھ بھی اس مقام کو حاصل کرنے والے سے ظاہر ہو، اور وہ کسی شخص کے حق میں اس کے ظاہر پر ظاہر ہو، تو وہ فراست (الفراسة) ہے، اور یہ مکاشفہ (المكاشفة) کا اعلیٰ ترین درجہ ہے۔ اور قرآن میں اس کا مقام یہ ہے: **إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّلْمُتَوَسِّمِينَ** (بے شک اس میں متوسمین (نشانات کو پہچاننے والوں) کے لیے نشانیاں ہیں)۔ یہ سمہ (السمة) یعنی علامت (العلامة) سے ہے، جیسا کہ ہم نے کہا۔ اور یہ کبھی غلطی نہیں کرتی، بخلاف حکمی فراست (الفراسة الحكمية) کے۔\n\n[علامات کی حضرۃ (حضرة السمات) جس میں بنی آدم کی صورتیں اور ان کے احوال ہیں]\n\nاور فراست (الفراسة) میں ایک اور کشف (الکشف) ہے، اور وہ یہ ہے کہ اللہ نے دنیا میں علامات کی ایک حضرۃ (حضرة السمات) بنائی ہے جس میں بنی آدم کی صورتیں اور ان کے احوال ان کے زمانے میں ان کے جدا ہونے تک موجود ہیں، اور یہ قلم (القلم) اور لوح (اللوح) کے علاوہ تمام علوی اور سفلی مخلوقات سے پوشیدہ ہے۔ جب اللہ کسی بندے کو چننا چاہتا ہے اور اسے اس مقام کے ساتھ خاص کرنا چاہتا ہے تو وہ اس کے دل کو پاک کرتا ہے اور اس میں اس کے ایمان سے ایک روشن چراغ (سراجا منيرا) رکھ دیتا ہے، جسے وہ الٰہی اسماء میں سے اسم المؤمن (المؤمن) اور المہیمن (المهيمن) سے روشن کرتا ہے۔ اور یہ چراغ حضرۃ الألوہۃ (حضرة الألوهة) سے ہوتا ہے جسے اسم المؤمن لیتا ہے۔ جب دل اس الٰہی نور سے روشن ہو جاتا ہے اور نور اس کے دل کے کونوں میں بصیرت (البصيرة) کی آنکھ کے نور کے ساتھ پھیل جاتا ہے، اس طرح کہ اسے ان انوار کے وجود کی وجہ سے کشف (الکشف) اور شہود (الشہود) پر مدرکات کا ادراک حاصل ہوتا ہے۔ جب دل اس حالت کو حاصل کر لیتا ہے جو ہم نے ذکر کی، تو اللہ اس دل کے صحنوں میں سے ایک میں وہ حضرۃ (حضرة السمات) رکھ دیتا ہے جس کا ہم نے ذکر کیا۔ چنانچہ وہ وہاں سے دنیا کی حرکات اور اس کے اسرار کو جانتا ہے۔ (ایک سو تینواں حصہ ختم ہوا)۔",
    "fa": "باب صد و چهل و هشتم در معرفت مقام فراست و اسرار آن\n\nفراست، نور نقل است که با آن *** کلام پیامبر، رسول برگزیده و هدایتگر آمد.\n\nصاحب فراست کسی است که خداوند برای او *** چشم و گوش باشد، و اوست که بالنده و آوازخوان است.\n\nو نهایت (فراست) جز این نیست که در او *** عکس قضیه در غیب و شهود (عالم غیب و عالم شهود) محقق شود.\n\n### [فراست، صفتی الهی و قهری است که حکم آن به گریزان‌ها (شاردین) تعلق دارد]\n\nفراست از ریشه افتراس (دریدن/شکار کردن) است، پس آن صفتی الهی و قهری است که حکم آن در مورد گریزان‌ها (الشوارد) جاری می‌شود، از ترس صاحب این صفت. و سبب گریز، ترسی طبیعی است؛ یا بر نفس که مبادا از بدنی که به آن خو گرفته و سلطنتش در آن آشکار شده، جدا شود، یا از جهت مذمتی که مفترس (شکارکننده) با فراست طبیعی یا با فراست الهی به او نسبت می‌دهد. به همین دلیل، فراست تنها به گریزان‌ها (الشاردین) تعلق می‌گیرد، زیرا جهل به نفوس خود بر بیشتر مردم غالب است و سبب جهلشان ترکیب (مرکب بودن) است. اگر بسیط بودند و از عناصر ترکیب نشده بودند، به این وصف (گریز) متصف نمی‌شدند.\n\n### [کسی که فراست دارد، در مورد کسی که در او فراست به کار می‌رود، نشانه‌هایی دارد که با آن نشانه‌ها استدلال می‌کند و به واسطه آن‌ها هدایت می‌شود]\n\nپس بدان که هرگاه بنده به فراست متصف شود، در مورد کسی که فراست در او به کار می‌رود، نشانه‌هایی دارد که با آن نشانه‌ها استدلال می‌کند. این نشانه‌ها برخی طبیعی و مزاجی هستند که همان فراست حکمیه است، و برخی روحانی، نفسی و ایمانی هستند که همان فراست الهیه است. و آن نوری الهی در چشم بصیرت مؤمن است که با آن می‌شناسد، زیرا آنچه از متفرس‌فیه (کسی که در او فراست به کار می‌رود) سر زده یا آنچه از او سر خواهد زد یا سرانجام کارش به کجا می‌انجامد، برای او کشف (الکشف) می‌شود. بنابراین، فراست مؤمن از نظر تعلق، عام‌تر از فراست طبیعی است. زیرا نهایت چیزی که فراست (طبیعی) از علوم می‌دهد، علم به اخلاق نکوهیده و ستوده و آنچه به شتاب در کارها یا درنگ در آن‌ها و تمام حرکات بدنی می‌انجامد، است. و من در این باب، بخشی از هر دو فراست را پس از تحقیق ماهیت آن‌ها، خواهم آورد.\n\n### [فراست الهیه آنچه را که فراست طبیعی می‌دهد، به علاوه چیزهایی بیشتر، عطا می‌کند]\n\nو فراست الهیه به علم آنچه فراست طبیعی می‌دهد، به علاوه چیزهایی بیشتر، تعلق می‌گیرد. و آن این است که معرفت سعید از شقی و معرفت حرکت مورد رضایت خداوند از حرکت ناپسندی که از انسان سر زده است، بدون حضور صاحب این نور، را عطا می‌کند. پس اگر پس از سپری شدن زمان آن حرکت، نزد او حاضر شود و آن عمل را ترک کرده باشد، در عضوی که آن عمل از آن سر زده بود، نشانه‌ای باقی می‌ماند که جز صاحب فراست آن را نمی‌شناسد. پس در مورد آن حرکت، بسته به اینکه طاعت بوده یا معصیت، به او می‌گوید. چنانکه برای عثمان (رضی الله عنه) اتفاق افتاد. مردی بر او وارد شد و همین که چشم عثمان به او افتاد، گفت: سبحان الله! چه شده است مردانی را که چشمان خود را از محارم خدا فرو نمی‌بندند؟ و آن مرد نگاه خود را به چیزی که برایش حلال نبود، انداخته بود؛ یا به عورت انسانی نگاه کرده بود یا به عمق خانه‌ای مسکونی یا مانند آن. مرد به او گفت: آیا پس از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) وحی‌ای هست؟ عثمان گفت: نه، بلکه فراست است. آیا نشنیدی سخن رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را که فرمود:\n\n«از فراست مؤمن بپرهیزید، زیرا او با نور خدا می‌نگرد.» (اتقوا فراسة المؤمن فإنه ينظر بنور الله)\n\nو هنگامی که بر من وارد شدی، آن را در چشمانت دیدم. این همان معنای سخن ماست که می‌گوییم آن (فراست) در عضوی که آن عمل ستوده یا نکوهیده از آن سر زده بود، نشانه‌ای بر جای می‌گذارد.\n\n### [فراست طبیعی و دستاوردهای آن]\n\nو فراست طبیعی، معرفت کسی را که در تمام افعال، اقوال، حرکات و سکناتش معتدل است، و معرفت کسی را که در همه این‌ها منحرف است، می‌دهد. پس با نگاه کردن به اعضای او و نشأت (آفرینش) هر عضو، میان نادان و عاقل، باهوش و زیرک، کندذهن و بی‌تجربه، شهوت‌ران و غیر شهوت‌ران، خشمگین و غیر خشمگین، خبیث و غیر خبیث، فریبکار و حیله‌گر، و سلیم و تسلیم، و سبک‌سر و غیر سبک‌سر و مانند این‌ها، تفاوت می‌گذارد.\n\n### [فراست ایمانی، نوری در چشم بصیرت است، مانند نور برای چشم بصر]\n\nپس ابتدا بدان که فراست ایمانی، که با آن آغاز می‌کنیم، نوری الهی است که به مؤمن برای چشم بصیرت (البصيرة) عطا می‌شود و مانند نور برای چشم بصر است. و نشانه در متفرس‌فیه (کسی که در او فراست به کار می‌رود) مانند نور خورشید است که محسوسات را برای بصر آشکار می‌سازد. همان‌گونه که بصر با نوری که در آن است و با نوری که خورشید از محسوسات برایش کشف کرده است، تفاوت می‌گذارد و کوچک را از بزرگ، زیبا را از زشت، سفید را از سیاه، قرمز را از زرد، متحرک را از ساکن، دور را از نزدیک، و بالا را از پایین می‌شناسد؛ نور فراست ایمانی نیز ستوده را از نکوهیده می‌شناسد.\n\n### [حکمت در نسبت دادن نور فراست مؤمن به خداوند]\n\nو نور فراست تنها به «الله» که اسم جامع احکام اسماء است، نسبت داده شده است، زیرا هم ستوده و هم نکوهیده را کشف می‌کند، و هم حرکات سعادت در سرای آخرت و هم حرکات شقاوت را. تا جایی که برخی از آنان، وقتی جای پای شخصی را بر زمین می‌بینند، در حالی که شخص حاضر نیست، می‌گویند: این قدم سعید است و این قدم شقی. مانند کاری که قائف (ردیاب) انجام می‌دهد که اثر را دنبال می‌کند و می‌گوید: صاحب این اثر مثلاً سفیدپوست و یک‌چشم است، و خلقت او را توصیف می‌کند، گویی او را دیده است. و آنچه از امور عارضی در خلقتش بر او عارض شده است، همه را در اثرش می‌بیند، بدون اینکه شخص او را ببیند. و در نسب‌ها حکم می‌کند و فرزند را به پدرش ملحق می‌سازد، اگر اختلافی در آن رخ دهد به دلیل نبود شباهت ظاهری معمول میان پدران و فرزندان.\n\n### [حرکات سیارات و شناور بودن آن‌ها در افلاک علوی]\n\nپس نور فراست را به خاطر همین به «الله» نسبت داد. اگر آن را مثلاً به اسم «حمید» نسبت می‌داد، صاحب این نور تنها امور ستوده و سعید را می‌دید. و همچنین اگر به هر اسم الهی دیگری نسبت می‌داد، بر اساس مقتضای حقیقت آن اسم می‌بود. پس چون این نور را به «الله» نسبت داد، خیرات و شرور واقع در دنیا و آخرت، و مذمت‌ها و ستایش‌ها، و مکارم اخلاق و سفساف (پستی‌های) آن، و آنچه طبیعت می‌دهد و آنچه روحانیت می‌دهد، را با آن درک می‌کند. و با این نور میان احکام شرعی که پنج حکم هستند، تفاوت می‌گذارد. و با این نور می‌شناسد که صاحب آن حرکت به کدام یک از اسماء الهی استناد کرده است و کدام یک از ارواح علوی به او نظر دارد، و چه آیاتی از حرکات سیارات (الکواکب) برای اوست. زیرا خداوند شناور بودن آن‌ها در افلاک را بیهوده قرار نداده است، بلکه برای اموری است که خداوند متعال در مجموع آن‌ها و در حرکاتشان و در قطع کردنشان در برج‌های مقدر در فلک اقصی به ودیعه نهاده است. و این همان سخن اوست: «و در هر آسمانی امر آن را وحی کرد.» (وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا). پس آن‌ها در آن شناوری، اموری را که بر آن امین شده‌اند و عالم عنصری طالب آن است، ادا می‌کنند.\n\n### [طبیعت را خداوند پایین‌تر از نفس و بالاتر از هباء (غبار) آفرید]\n\nو بدان که طبیعت را که خداوند متعال پایین‌تر از نفس و بالاتر از هباء (غبار) آفرید، هنگامی که خداوند اراده کرد اجسام طبیعی را ایجاد کند، و نزد ما جز جسم طبیعی یا عنصری نیست، و عناصر اجسام طبیعی هستند، اگرچه اجساد دیگری از آن‌ها متولد شوند، همه این‌ها از آثار خداوند در آنچه طبیعت را بر آن آفریده است، می‌باشد. و طبیعت عبارت است از چهار امر که اگر به تألیف خاصی با هم ترکیب شوند، آنچه مناسب آن الفت است، به تقدیر عزیز علیم، از آن پدید می‌آید. به همین دلیل، اجسام عالم به دلیل اختلاف آن مزاج، متفاوت شده‌اند. پس به هر جسمی در عالم، بر حسب اقتضای مزاجش، عطا شده است.\n\n### [آفرینش عناصر که همان ارکان چهارگانه هستند]\n\nو امر همچنان نازل شد تا اینکه خداوند عناصر را که همان ارکان چهارگانه هستند، آفرید. پس حرارت را به یبوست (خشکی) به طریق خاصی ضمیمه کرد و از آن آمیزش، رکن آتش پدید آمد که از آن به عنصر آتش نیز تعبیر می‌شود. سپس هوا، سپس آب، سپس خاک. سپس خداوند سبحان شروع کرد به اینکه برخی از آن‌ها به برخی دیگر استحاله یابند، با واسطه‌ها و بدون واسطه‌ها. پس اگر دو عنصر از همه جهات با هم تنافر داشتند، به مناسب استحاله می‌یافتند. سپس آن مناسب به مناسب دیگر نزدیک‌تر استحاله می‌یافت که با مستحیل اول منافر بود. پس استحاله به سوی آن را به واسطه این مناسب نزدیک‌تر، از جهت سبکی یا سنگینی، پذیرفت.\n\n### [آفرینش جسم حیوانی از چهار طبیعت]\n\nسپس خداوند جسم حیوانی را از چهار طبیعت آفرید که عبارتند از دو مره (صفرا و سودا)، خون و بلغم. و خداوند سبحان در این اخلاط، قوای روحانی قرار داد که آثارشان در جسم مرکب از آن‌ها ظاهر می‌شود. اگر این اخلاط در جسمی که از آن‌ها ظاهر شده، بر اعتدال یا نزدیک به اعتدال باشند، آنچه را که اعتدال از امور نیکو و ستوده و حرکات میانه‌رو در کارها می‌دهد، عطا می‌کنند. و اگر بر اعتدال نباشند، بر حسب انحرافی که به سوی آن متمایل شده‌اند، عطا می‌کنند و سلطنت قوی‌تر و بیشتر از این اخلاط در بدن ظاهر می‌شود. از این رو، بر جسم، بیماری‌ها و بر نفس، اخلاق عارض می‌شود.\n\n### [بیماری‌های بدنی، نفسی و روحانی و درمان آن‌ها]\n\nپس طبیب، بیماری‌ها را با افزودن به آنچه از این اخلاط کم است و کاستن از آنچه زیاد است، تا اعتدال حاصل شود، درمان می‌کند. و طبیب الهی، اخلاق را درمان می‌کند و اغراض نفسانی را با تذکر، موعظه و تنبیه بر امور عالی و آنچه برای کسی که به آن‌ها متصف شود از سعادت و ستایش نزد خدا و مردم و ارواح علوی هست، سیاست می‌کند. پس نفس ناطقه با این‌ها تأیید می‌شود و این تذکر برایش مانند یاری‌دهنده بر اصلاح این مزاج منحرف است. پس طبیب مدبر طبیعت این بدن را یاری می‌کند و آنچه از آن مختل شده است را اصلاح می‌نماید. به همین دلیل، برخی از پزشکان به بیماران مبتلا به بیماری‌های خاص، دستور می‌دهند که از شنیدن الحان طرب‌انگیز، مکان‌های نیکو با گل‌های متنوع، صدای آب روان و آواز پرندگانی مانند بلبل و امثال آن استفاده کنند. همه این‌ها طب روحانی است که به اصلاح مزاج می‌انجامد و طبیب را در این امر یاری می‌کند.\nو بیماری‌های دیگری نیز هستند که اصوات را تحمل نمی‌کنند، بلکه با نقیض آنچه ذکر کردیم، اصلاح می‌شوند. و همه این‌ها بر حسب خلط غالب و قوی‌تر و ضعف خلط متناقض مقابل آن است.\n\n### [بیماری‌های اصلی که در خود مزاج و خلقت هستند]\n\nو این بیماری‌ها برخی اصلی هستند که در خود مزاج و خلقت وجود دارند، مانند بیرون‌زدگی چشم‌ها (الجحوظة) یا فرورفتگی بیش از حد، یا بینی بسیار باریک یا بسیار درشت، یا سوراخ‌های گشاد و متورم یا نقیض آن، یا سفیدی شدید یا سیاهی شدید، یا مجعد بودن مو یا صافی بیش از حد آن، یا کبودی شدید در چشم فیروزه‌ای یا سیاهی مفرط. و همچنین سایر اعضا در عدم اعتدال، که همان انحراف از اعتدال به سوی یکی از دو میل است، چنانکه ذکر کردیم. زیرا خلقت انسان بر حسب وضع این اعضا از اعتدال و انحراف است.\n\n### [طبیب الهی که پیامبر یا وارث یا حکیم است]\n\nپس هرگاه این طبیب الهی که همان پیامبر یا وارث یا حکیم است، بیاید، آنچه را که این نشأت (آفرینش) اقتضا می‌کند و زمام خود را به دست او سپرده است تا او را تربیت کند و در سعادتش بکوشد، می‌بیند. و اگر منحرف باشد، او را به خلاف مقتضای نشأت خود باز می‌گرداند، به این صورت که مصارف آن انحراف را که خداوند آن را می‌ستاید و سعادت این نفس در آن است، برایش بیان می‌کند. زیرا او نمی‌تواند نشأت دیگری برایش ایجاد کند؛ پروردگارت از آفرینش و خلق فارغ شده است. و در دست ما جز بیان مصارف (نحوه استفاده) باقی نمانده است. پس کسی که نشأت معتدل دارد، اگر نسبت به امور سعادت‌بخش نزد خدا که نیاز به موضع‌گیری دارد، جاهل باشد، و آن موضع‌گیری رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است، از علما درباره اموری که سعادت نزد خدا را عطا می‌کند، سؤال می‌کند.\n\n### [معتدل النشأت و منحرف و مکارم اخلاق]\n\nاما در مورد مکارم اخلاق، نیازی به موضع‌گیری نیست، زیرا مزاج نشأت و اعتدال آن، جز مکارم اخلاق را به او نمی‌دهد. بلکه در برخی امور، در به کار بردن انحراف، نیاز به موضع‌گیری دارد، و او در آن مکلف است، به دلیل مصالحی که در آن انحراف وجود دارد، یا دنیوی یا اخروی یا هر دو. اما فرد منحرف، اخلاق نکوهیده و پستی‌های آن از او سر می‌زند و به دنبال نفوذ اغراض قائم به خود است و اهمیتی نمی‌دهد که سرانجام کارش در رسیدن به آن‌ها به کجا می‌انجامد. پس طبیب سیاست‌مدار، او را حال به حال با بیان مصارف، چنانکه ذکر کردیم، به تدریج هدایت می‌کند.\n\n### [چگونه صاحب فراست ایمانی، کسی را که در او فراست به کار می‌رود، سیاست می‌کند]\n\nپس هرگاه صاحب فراست ایمانی بیاید و عالم به آنچه مصلحت این متفرس‌فیه در آن است باشد، و از او حرکتی ببیند که به نکوهیده می‌انجامد یا آن حرکت نکوهیده از او سر زده باشد، او را سیاست می‌کند تا بر او مسلط شود و او نفس خود را به او تسلیم کند تا در آن حکم کند. اگر منحرف باشد، در سلوک خود صاحب مجاهده و ریاضت خواهد بود. و اگر معتدل باشد، در سلوک خود خوش‌نفس، لذت‌برنده، شاد و مسرور خواهد بود. امور دشوار بر دیگران، بر او آسان می‌شود و در هیچ یک از مکارم اخلاق، تکلفی نزد او نیست. پس هرگاه نفسش صافی و پاکیزه شود و به عالم مطهر ملحق گردد و با چشم الهی بنگرد و با آن بشنود و با قوت آن حرکت کند، منابع امور و مآخذ آن‌ها و آنچه از آن برمی‌خیزد و آنچه به آن می‌انجامد، را می‌شناسد. و این همان چیزی است که از آن به فراست ایمانی تعبیر می‌شود و آن موهبتی از جانب خداوند متعال است که هم سلیم‌الطبع و هم غیر سلیم آن را به دست می‌آورند.\n\n### [ریشه اعتدال و انحراف در عالم که موجب غلبه برخی اصول بر برخی دیگر می‌شود]\n\nو ریشه اعتدال و انحراف در عالم و در آنچه موجب غلبه برخی اصول بر برخی دیگر می‌شود که در مرکبات حکم دارند، از آثار علم الهی است که از آن، خداوند بر هر که بخواهد رحم می‌کند و می‌آمرزد و عذاب می‌دهد و ناخوش می‌دارد و راضی می‌شود و خشم می‌گیرد. و خشم کجا و رضایت کجا؟ و عفو کجا و انتقام کجا؟ و ناخشنودی کجا و رضوان کجا؟ و همه این‌ها در اخبار الهی در کتب نازل شده آمده است و اهل کشف (الکشف) آن را به مشاهده عین می‌دانند. و اگر نبود آنچه بر زبان انبیا و رسولان وارد شده و کتب از جانب خداوند بر دست آنان نازل گشته و با معجزات تأیید شده‌اند تا صدقشان نزد بیگانگان به خاطر این امور الهی ثابت شود و هرگاه آن‌ها را بیاورند، پذیرفته شوند، زیرا دلایل عقول آن‌ها را در ساحت الهی محال می‌داند؛ اگر کسی که آن را مشاهده کرده و برایش مکاشفه شده است، بدون تأیید آیتی که بر صدق او دلالت کند، به آن سخن می‌گفت، جاهل شمرده می‌شد و در نظرش طعن زده می‌شد و دلایل عقلی بر فساد عقل و فکرش اقامه می‌شد و حکم می‌شد که خیالش بر او غلبه کرده است و اینکه خداوند شایسته نیست که به این اوصاف توصیف شود. پس این بود سبب نزول آن‌ها بر دست رسولان و کتب، تا کسی که مشاهده می‌کند، به آن آرامش یابد و با کلام او انس گیرد، هرگاه چنین مطلبی را بیاورد.\n\n### [اگر شرف علم نبود، فراست شرافت نمی‌یافت؛ پس علم شریف‌ترین صفات است و با آن نجات حاصل می‌شود]\n\nپس به خاطر این امور، شرایع وارد شدند و به خاطر احکامی که با اغراض رؤسا و پیشوایان موافق نبود، اگر آن را از غیر رسول می‌شنیدند. اما چون از رسولان با آن انس گرفتند و نفوس به احکام نوامیس الهی خو گرفتند و آن را همراه خود داشتند، بر پادشاهان و رؤسا آسان شد که شاگرد صالحان شوند و نفوس خود را تحت احکام آنان درآورند، اگرچه بر آن‌ها دشوار باشد. پس آنان علم خود را به آن، بر مشقت مخالفت با غرضی که درک می‌کنند، ترجیح می‌دهند. زیرا او بر این شرط، نفس خود را وارد کرده است، پس حجت او بر خودش قائم است. پس منزه است خدای دانا و حکیم. و اگر شرف علم نبود، فراست شرافت نمی‌یافت، زیرا اگر فراست علم نمی‌داد، شرافت و قدری نداشت. پس علم شریف‌ترین صفات است و با آن نجات حاصل می‌شود، هرگاه انسان آن را بر نفس خود حاکم کند و در امور خود بر حسب حکم آن تصرف نماید: «پروردگارا، علم مرا زیاد کن، پروردگارا، علم مرا زیاد کن، پروردگارا، علم مرا زیاد کن.» (رَبِّ زِدْنِي عِلْماً) و مرا برای آن به کار گیر و آن را حاکم بر من و ناظر بر من قرار ده، زیرا تو علم و عالم و معلوم هستی، نه برای ما. پس از آن به اندازه ظرفیت ما به ما عطا کن.\n\n### [فراست ذکر شده نزد حکما]\n\nاما فراستی که نزد حکما ذکر شده است، من بخشی از آن را بر اساس آنچه آنان اصل قرار داده‌اند و تجربه و آزمایش کرده‌اند، ذکر می‌کنم. سپس اعتبار آن را در صفات، بر اساس روش ما در این کتاب، به صورت مختصر و کافی، ان‌شاءالله، بیان خواهم کرد.\n\n### [آغاز آفرینش انسان معتدل النشأت]\n\nبدان که خداوند متعال هرگاه بخواهد انسانی معتدل النشأت (معتدل آفرینش) بیافریند تا تمام حرکات و تصرفاتش مستقیم باشد، پدر را برای آنچه صلاح مزاج او در آن است، موفق می‌سازد و مادر را نیز برای آن موفق می‌سازد. پس منی از مرد و زن صالح می‌شود و مزاج رحم صالح می‌شود و اخلاط در آن به اندازه مقداری که صلاح نطفه با آن است، معتدل می‌گردد. و خداوند برای انزال آب (منی) در رحم، طالعی سعید را با حرکات فلکی تعیین می‌کند که خداوند آن‌ها را نشانه‌ای بر صلاح در آنچه از کائنات در آن خواهد بود، قرار داده است. پس مرد با همسرش در طالعی سعید و با مزاجی معتدل نزدیکی می‌کند و آب در رحمی با مزاج معتدل نازل می‌شود. رحم آن را می‌پذیرد و خداوند مادر را موفق می‌سازد و به او شهوت به هر غذایی که صلاح مزاج او و تغذیه نطفه در رحم در آن است، روزی می‌دهد. پس نطفه در مکانی معتدل، مواد معتدل و حرکات فلکی مستقیم، تصویر شدن را می‌پذیرد.\n\n### [نشانه‌های بدنی و نفسی انسان معتدل النشأت]\n\nپس نشأت (آفرینش) خارج می‌شود و بر عادلانه‌ترین صورت شکل می‌گیرد. پس نشأت صاحب آن معتدل است؛ نه بلندقامت است و نه کوتاه‌قامت، گوشتش نرم و رطوبتش میان درشتی و نازکی است، سفید متمایل به سرخی و زردی است، مویش معتدل و بلند است، نه بسیار صاف و نه بسیار مجعد و فرفری، در مویش سرخی است و نه آنچنان سیاه است، صورتش کشیده (اسیل الوجه) است، چشمانش درشت (أعین) و متمایل به فرورفتگی و سیاهی است، سرش معتدل و بزرگ است، شانه‌هایش افتاده (سائل الأکتاف) است، در گردنش استقامتی معتدل است، سینه‌اش معتدل است، در کفل و پشتش گوشت زیادی نیست، صدایش آهسته و صاف است، آنچه از آن درشت و آنچه نازک است، از آنچه درشتی یا نازکی آن پسندیده است، در اعتدال است، انگشتانش بلند است به دلیل نازکی، کف دستش صاف است، کم‌حرف و کم‌سکوت است مگر در هنگام نیاز، تمایل طبایعش به صفرا و سودا است، در نگاهش شادی و سرور است، کم‌طمع به مال است، نمی‌خواهد بر تو تسلط یابد و ریاست کند، نه شتاب‌زده است و نه کند. حکما گفته‌اند که این عادلانه‌ترین و محکم‌ترین خلقت است و خلقت سیدنا محمد (صَلَّى اللهُ عَليهِ وسَلَّم) بر این اساس بود تا کمال در نشأت برای او صحیح باشد، همان‌گونه که کمال در مرتبه برای او صحیح بود. پس او کامل‌ترین مردم از همه جهات، ظاهر و باطن، بود.\n\n### [نقش مادر در تکوین نشأت انسانی]\n\nپس اگر در رحم اختلال مزاجی رخ دهد، ناگزیر آن اختلال در نشأت انسان در رحم، در عضوی از اعضای او یا در بیشتر اعضا یا در کمتر آن‌ها، تأثیر می‌گذارد، بر حسب قوت جاذبه‌ای که در آن زمان برای آن عضو در نطفه وجود دارد. پس آن (اختلال) یا در کل نشأت یا در برخی از اعضای آن ظاهر می‌شود.\n\n### [ویژگی‌های ظاهری دال بر طبایع نفسی]\n\nاز جمله آن (نشانه‌ها)، و خداوند توفیق‌دهنده است، این است که سفیدی خالص همراه با سرخی و کبودی زیاد، دلیل بر بی‌شرمی، خیانت، فسق و سبکی عقل است. اگر همراه با آن، پیشانی پهن، چانه باریک، کم‌مو، گونه‌های برجسته و موی زیاد بر سر باشد، اهل فراست از حکما گفته‌اند که پرهیز از کسی که این صفت اوست، مانند پرهیز از افعی‌های کشنده است. اگر مو خشن باشد، دلیل بر شجاعت و سلامت مغز است. و اگر نرم باشد، دلیل بر ترسویی، سردی مغز و کم‌فطنتی است. و اگر مو بر شانه‌ها و گردن زیاد باشد، دلیل بر حماقت و گستاخی است. و اگر بر سینه و شکم زیاد باشد، دلیل بر وحشی بودن طبع، کم‌فهمی و دوست داشتن ستم است. سرخی مو (شقره) دلیل بر ترسویی، خشم زیاد و سرعت آن، و تسلط‌جویی است. و موی سیاه دلیل بر سکون زیاد در عقل، تأنی و دوست داشتن عدالت است. و موی متوسط میان این دو، دلیل بر اعتدال است. و اگر پیشانی باز باشد و چین و چروکی در آن نباشد، دلیل بر ستیزه‌جویی، آشوب، بی‌شرمی و خودپسندی است. و اگر پیشانی در برآمدگی و پهنا متوسط باشد و در آن چین و چروک باشد، او راستگو، دوست‌دار، فهمیده، دانا، بیدار و مدبر حاذق است. و کسی که گوش‌هایش بزرگ باشد، جاهل است، اما حافظه خوبی دارد. و کسی که گوش‌هایش کوچک باشد، دزد و احمق است. و اگر ابرو پرمو باشد، دلیل بر گمراهی و سخن بیهوده است. و اگر ابرو تا شقیقه امتداد یابد، صاحبش متکبر و خودپسند است. و کسی که ابرویش نازک و در طول و کوتاهی معتدل و سیاه باشد، بیدار است. و اگر چشم کبود باشد، بدترین چشم‌هاست و بدترین کبودی، کبودی غیر فیروزه‌ای است. و کسی که چشمانش بزرگ و بیرون‌زده باشد، حسود، بی‌شرم، تنبل و غیر قابل اعتماد است. و اگر کبود باشد، شدیدتر است و ممکن است فریبکار باشد. و کسی که چشمانش متوسط و متمایل به فرورفتگی، سرمه‌دانی و سیاهی باشد، بیدار، فهمیده، مورد اعتماد و دوست‌دار است. و اگر چشم در طول بدن کشیده شود، صاحبش خبیث است. و کسی که چشمش بی‌حرکت و کم‌جنبش باشد، مانند حیوانات، و نگاهش مرده باشد، جاهل و درشت‌طبع است. و کسی که در چشمش حرکت سریع و تیزی نگاه باشد، حیله‌گر، دزد و خیانتکار است. و کسی که چشمش سرخ باشد، شجاع و پیشگام است. و اگر اطراف آن نقطه‌های زرد باشد، صاحبش بدترین و پست‌ترین مردم است. و اگر بینی‌اش باریک باشد، صاحبش سبک‌سر است. و کسی که بینی‌اش نزدیک است که وارد دهانش شود، شجاع است. و کسی که بینی‌اش پهن (افطس) باشد، شهوت‌ران است. و کسی که بینی‌اش بسیار متورم باشد، خشمگین است. و اگر وسط آن درشت و متمایل به پهنی باشد، دروغگو و پرحرف است. و معتدل‌ترین بینی‌ها آن است که بلند باشد، بدون بلندی فاحش. و کسی که بینی‌اش متوسط در درشتی و مجرای آن غیر فاحش باشد، دلیل بر عقل و فهم است. و کسی که دهانش گشاد باشد، شجاع است. و کسی که لب‌هایش درشت باشد، احمق است. و کسی که لب‌هایش در درشتی متوسط و با سرخی خالص باشد، معتدل است. و کسی که دندان‌هایش کج یا بیرون‌زده باشد، فریبکار، حیله‌گر و غیر قابل اعتماد است. و کسی که دندان‌هایش صاف و سبک و میان آن‌ها فاصله باشد، عاقل، مورد اعتماد، امین و مدبر است. و کسی که گوشت صورتش متورم و گونه‌هایش برجسته باشد، جاهل و درشت‌طبع است. و کسی که صورتش لاغر و زرد باشد، بد، خبیث، فریبکار و بدخلق است. و کسی که صورتش بلند باشد، بی‌شرم است. و کسی که شقیقه‌هایش متورم و رگ‌های گردنش پر باشد، خشمگین است. و کسی که به او نگاه کنی و سرخ شود و خجل گردد و شاید چشمانش اشک‌آلود شود یا تبسمی کند که نمی‌خواهد، او نسبت به تو دوست و مهربان است و در نفسش از تو هیبتی دارد. و اگر صدایش بلند باشد، دلیل بر شجاعت است. و صدای معتدل میان خشونت و نرمی و درشتی و نازکی، دلیل بر عقل، تدبیر، صدق است. و سرعت کلام و نازکی آن، دلیل بر دروغ، بی‌شرمی و جهل است. درشتی صدا دلیل بر خشم و بدخلقی است. غنه (صدای تو دماغی) در صدا دلیل بر حماقت و کم‌فطنتی و خودبزرگ‌بینی است. حرکت زیاد دلیل بر خودپسندی، پرگویی و فریبکاری است. وقار در نشستن، تدارک لفظ (سنجیده سخن گفتن) و حرکت دادن دست در سخنان اضافی، دلیل بر کمال عقل، تدبیر و سلامت عقل است. کوتاهی گردن دلیل بر خباثت و مکر است. بلندی و نازکی گردن دلیل بر حماقت، ترسویی و فریاد زدن است. اگر کوچکی سر نیز به آن‌ها اضافه شود، دلیل بر حماقت و سبکی است. درشتی گردن دلیل بر جهل و پرخوری است. اعتدال گردن در بلندی و درشتی، دلیل بر عقل، تدبیر، خلوص مودت، اعتماد و صدق است. شکم بزرگ دلیل بر حماقت، جهل و ترسویی است. ظرافت شکم و تنگی سینه، دلیل بر نیکویی عقل و حسن رأی است. پهنای شانه‌ها و پشت، دلیل بر شجاعت و سبکی عقل است. خمیدگی پشت، دلیل بر بدخلقی و سبک‌سری است. استقامت پشت، نشانه‌ای ستوده است. بیرون‌زدگی شانه‌ها، دلیل بر سوء نیت و قبح مذهب است. اگر بازوان بلند باشد تا جایی که کف دست به زانو برسد، دلیل بر شجاعت، کرم و نجابت نفس است. و اگر کوتاه باشد، صاحبش ترسو و دوست‌دار شر است. کف دست بلند همراه با انگشتان بلند، دلیل بر نفوذ در صنایع، محکم کاری در اعمال و تدبیر ریاست است. گوشت درشت در پا، دلیل بر جهل و دوست داشتن ستم است. پای کوچک و نرم، دلیل بر فجور است. نازکی پاشنه، دلیل بر زیبایی است. درشتی پاشنه، دلیل بر شجاعت است. درشتی ساق‌ها همراه با عرقوب‌ها (تاندون آشیل)، دلیل بر بلاهت و بی‌شرمی است. کسی که گام‌هایش گشاد و آهسته باشد، در تمام کارهایش موفق و در عواقب آن اندیشه‌گر است. و نقیض آن برای نقیض آن است.\n\n### [ریاضت و به کار بردن علم در از بین بردن هر صفت نکوهیده]\n\nاین‌ها مطالبی است که از سخنان حکما از اهل تجربه و دانشمندان به طبیعت نقل کردم. این اوصاف ممکن است زیاد یا کم باشند و حکم از آنِ غالب است. و ممکن است در شخص برابر باشند، پس حکم یکی، حکم دیگری را دفع می‌کند، به این صورت که در شخص، حکم یکی از آن‌ها در یک قضیه خاص و حکم دیگری در قضیه خاص دیگری باشد. به طور کلی، ریاضت و به کار بردن علم مؤثر در از بین بردن حکم هر صفت نکوهیده‌ای است که ذکر شد. و هر کس تجربه کند، صحت آنچه گفتیم را می‌یابد، زیرا عادت، طبیعت پنجم است که در طبیعت اصلی اثر دارد. همه این‌ها تجربه شده و اعتبار آن در نشانه‌هایی که طبیعت حکم خود را در آن داده و تجربه‌ها بر آن گواهی داده‌اند، محقق شده است.\n\n### [فصل اعتبار در آنچه از نشانه‌ها ذکر کردیم که طبیعت حکم خود را در آن داده و تجربه‌ها بر آن گواهی داده‌اند]\n\n### [لطیفه انسانی یک وجه به سوی نور و یک وجه به سوی ظلمت دارد]\n\nپس بدان که لطیفه انسانی که مدبر جسد اوست، چون یک وجه به سوی نور محض که پدر اوست و یک وجه به سوی طبیعت که ظلمت محض و مادر اوست، داشت، نفس ناطقه واسطه‌ای میان نور و ظلمت بود. و سبب واسطه بودن آن در جایگاه، به دلیل مدبر بودن آن است، مانند نفس کلیه که میان عقل و هیولای کل است، که هیولا جوهری تاریک و عقل نوری خالص است. پس این نفس ناطقه مانند برزخ (البرزخ) میان نور و ظلمت است و حق هر صاحب حقی را می‌دهد. پس هرگاه یکی از دو طرف بر آن غلبه کند، تابع آن چیزی می‌شود که بر آن غلبه کرده است. و اگر تمایلی به هیچ یک از دو جانب نداشته باشد، امور را بر اعتدال دریافت می‌کند و انصاف می‌دهد و به حق حکم می‌کند. پس در این فصل، اعتبار آنچه در نشانه‌های فراست در جسد گذشت را ذکر می‌کنیم.\n\n### [اعتبار در سفیدی و سیاهی، بلندی و کوتاهی، و اعتدال گوشت و مو]\n\nپس می‌گوییم: اما سفیدی مفرط، به معنای استغراق انسان در نظر به عالم نور است، به طوری که در استغراقش چیزی برای تدبیر عالم طبیعتش باقی نماند، مانند ابوعقال مغربی و امثال او. پس پیش از حصول کمال، به سرعت فاسد می‌شود. و همچنین اعتبار سیاهی مفرط، که استغراق او در عالم شهوت و طبیعتش است، به طوری که میان او و نظر در علوم انوار که همان علوم الهی است، حائل شود. پس حال این شخص بدون اختلاف نکوهیده است. اما اگر گاهی و گاهی باشد و حق هر صاحب حقی را بدهد، چنانکه (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «مرا وقتی است که در آن جز پروردگارم نمی‌گنجد.» (لي وقت لا يسعني فيه غير ربي)، پس او امام عادل است. و اما اعتبار بلندی و کوتاهی، مدت اقامت او در نظر به یکی از دو عالم است؛ یا مدتی ممتد که همان بلندی است، یا اندک که همان کوتاهی است. و شایسته است که آن مدت به اندازه نیاز باشد. و اما اعتدال گوشت در رطوبت و میان درشتی و نازکی، اعتدال انسان در برزخیات (البرزخيات) میان معنا و حس است، مانند گوشت که میان استخوان و پوست است. و اما اعتدال مو، اقامت او میان بسط و قبض است.\n\n### [اعتبار در کشیدگی صورت، درشتی چشم، بیرون‌زدگی چشم‌ها، اعتدال سر، افتادگی شانه‌ها و استقامت گردن]\n\nو اما کشیدگی صورت (أسيل الوجه)، همان گشاده‌رویی و بشاشت است. و اما درشتی چشم (أعين)، سلامت نظر در امور است. و اما متمایل بودن چشم به فرورفتگی و سیاهی، نظر در مغیبات و استخراج امور پنهان است. و اما بیرون‌زدگی چشم‌ها (الجحوظة)، تمایل او به استنباط علوم از عالم شهود است، و آنان اهل اعتبارند. و اما اعتدال بزرگی سر، وفور عقل است. و اما افتادگی شانه‌ها (سائل الأکتاف)، تحمل آزار در غیاب بدون تأثیرپذیری است. و اما استقامت گردن، اشراف بر اشیا بدون تمایل به آن‌ها است.\n\n### [اعتبار در بلندی و کوتاهی گردن، اعتدال سینه، کم بودن گوشت، آهستگی و صافی صدا و بلندی انگشتان]\n\nو اما بلندی بیش از حد گردن، اشراف بر آنچه شایسته نیست، مانند تجسس است. و اما کوتاهی مفرط، کوتاهی کردن در آنچه شایسته است بر آن اشراف یابد. و اما اعتدال سینه (اللبة)، استقامت عبارت با وزنی است که منفعت برای مخاطب حاصل شود. و اما کم بودن گوشت در کفل و پشت، نظر او در اموری است که بر آن‌ها تکیه می‌کند و اعتماد دارد که او را به یکی از دو طرف خالص کند، زیرا اگر برزخی باشد، در غالب امر با آن تقدیر می‌شود. و اما آهسته بودن صدا (خفي الصوت)، حفظ سر در موضع آشکار است. و اما صافی صدا، این است که چیزی به آن اضافه نکند. و اما بلندی انگشتان (طول البنان)، ظرافت در تناول است. و اما باز بودن کف دست (بسط الکف)، رها کردن دنیا بدون تعلق است.\n\n### [اعتبار در کم‌گویی و کم‌خندی و تمایل طبع به دو مره (صفرا و سودا)]\n\nو اما کم‌گویی و کم‌خندی، نظر او به مواضع حکمت است، پس به اندازه نیاز سخن می‌گوید و می‌خندد. و اما تمایل طبایعش به دو مره (المرتین)، این است که در صفرا، تمایل به عالم علوی و در سودا، تمایل به عالم سفلی بر او غلبه کند و آنچه در آن پنهان شده است را استخراج کند، از آنچه مایه روشنی چشم است و طبیعت بیشتر عقول را از نظر در آن محجوب می‌سازد، به دلیل آنچه از نکوهش طبیعت در ذهنشان سبقت گرفته است. و اما اینکه در نگاهش شادی و سرور است، جلب نفوس دیگران به سوی خود با محبت است. و اما کم‌طمع بودن او به مال، دوری از هر چیزی است که او را به سوی آنچه فایده‌ای برایش ندارد، متمایل سازد. و اما اینکه نمی‌خواهد بر تو تسلط یابد و ریاست کند، مشغول بودن او به کمال عبودیت خود است، نه به تو. و اما اینکه نه شتاب‌زده است و نه کند، یعنی نه در گرفتن با وجود قدرت سریع است و نه عاجز.\n\n### [مرجع صاحبان فراست حکمیه و ایمانیه در تقسیم امور به ستوده و نکوهیده]\n\nهمچنین، هنگامی که به صاحبان فراست حکمیه نگریستیم، دیدیم که آنان در این امر به دو طرف و یک واسطه باز می‌گردند و امور را به ستوده و نکوهیده تقسیم کرده‌اند (منظورم اخلاق است). و تمام خیر را در وسط قرار داده‌اند و انحراف را در دو طرف. پس در مورد سفید بسیار سفید و سرخ و کبود، آنچه از نکوهش شنیدی، گفتند و اینکه ستوده نیست. و همچنین سیاه بسیار سیاه و بینی بسیار باریک نکوهیده است. همه این‌ها و معتدل میان آن‌ها که متمایل به یکی از دو طرف و خارج از حد نباشد، ستوده است، بر نحو آنچه گذشت. پس هنگامی که دیدیم آنان آن را به آنچه ذکر کردیم، محدود کرده‌اند، در این عالم انسانی نگریستیم که حسن و قبح کجا ظاهر می‌شود. پس گفتیم: هیچ حسنی که با آن منزلت نزد خدا حاصل شود و هیچ قبحی که با اجتناب از آن، خیر از جانب خدا حاصل شود، نیست، مگر آنچه شرع آن را نیکو شمرده و نکوهیده است. پس هنگامی که ستایش و نکوهش را از جهت تشریع دیدیم، نگریستیم که چگونه دو طرف و یک واسطه را جمع کنیم تا دو طرف را مخالف حکم وسط که محل اعتدال است، قرار دهیم.\n\n### [انسان از نظر شرع، ناگزیر یکی از سه حالت را دارد]\n\nپس می‌گوییم: انسان از نظر شرع، ناگزیر یکی از سه حالت را دارد: یا باطنی محض است، که نزد ما قائل به تجرید توحید (توحید محض) در حال و فعل است. و این به تعطیل احکام شرع می‌انجامد، مانند باطنیه، و عدول از آنچه شارع اراده کرده است. و هر آنچه به ویرانی قاعده دینی مشروع بینجامد، نزد هر مؤمنی مطلقاً نکوهیده است. و یا ظاهری محض است، که چنان در ظاهر غرق شده که این امر او را به تجسیم و تشبیه می‌کشاند. این نیز مانند آن است و شرعاً ملحق به نکوهش است. و یا با شرع بر اساس فهم زبان پیش می‌رود؛ هر جا شارع رفت، او می‌رود و هر جا ایستاد، او قدم به قدم می‌ایستد. و این حالت وسط است و با آن محبت حق (الحق) برای او صحیح شده است. خداوند متعال می‌فرماید که پیامبرش بگوید: «پس از من پیروی کنید تا خدا شما را دوست بدارد و گناهانتان را بیامرزد.» (فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ). پس پیروی از شارع و اقتفای اثر او، موجب محبت خداوند برای بندگان و صحت سعادت دائمی است. این وجه مقابله دو نسخه است. اگر کسی بگوید: این مجمل است، چگونه تفصیل آن شناخته می‌شود؟ ما اگر مردی ساکن را ببینیم که در نمازها و جماعت‌ها حاضر می‌شود و با این حال منافق و مصر است، می‌گوییم: سکون و حضور در نمازها و مانند آن از عالم شهود است، و کافر بودن او در قلبش از عالم غیب است. و ما اگر فراست ذوقی ایمانی را که ذکر کردیم و ان‌شاءالله آن را کامل خواهیم کرد، به دست آوریم، در نفس خود حکم به کافر بودن او می‌کنیم و مال و خون او را شرعاً معصوم نگه می‌داریم، به دلیل ظهور کلمه توحید. پس معامله ما با او بر این حد است و به غیر از این مکلف نشده‌ایم.\n\n### [عالم علوی، محرک عالم حس و شهود است]\n\nسپس، خداوند تو را موفق بدارد، بدان که عالم علوی به طور کلی، محرک عالم حس و شهود (الشهادة) است و تحت قهر آن، حکمتی از جانب خداوند است، نه اینکه خود مستحق آن باشد. پس در عالم شهود، حکم هیچ حرکت یا سکون، خوردن یا نوشیدن، سخن گفتن یا سکوت، ظاهر نمی‌شود، مگر از عالم غیب. و این بدان سبب است که حیوان حرکت نمی‌کند مگر از قصد و اراده، و این دو از عمل قلب هستند. و اراده از عالم غیب است و حرکت و مانند آن از عالم شهود. و عالم شهود هر چیزی است که معمولاً با حس درک می‌کنیم، و عالم غیب ما درک می‌کنیم با خبر شرعی یا نظر فکری درک می‌کنیم و معمولاً در حس ظاهر نمی‌شود.\n\n### [چشم بصیرت برای درک عالم غیب و چشم بصر برای درک عالم شهود]\n\nپس می‌گوییم: عالم غیب با چشم بصیرت (البصيرة) درک می‌شود، همان‌گونه که عالم شهود با چشم بصر درک می‌شود. و همان‌گونه که بصر، عالم شهود را جز در تاریکی درک نمی‌کند، مگر اینکه حجاب ظلمت یا موانع مشابه آن از او برداشته شود. پس هرگاه موانع برداشته شوند و انوار بر محسوسات گسترده شوند و نور بصر و نور آشکارکننده با هم جمع شوند، بیننده با بصر، دیدنی‌ها را درک می‌کند. همچنین حجاب چشم بصیرت، رین (زنگار)، شهوات و ملاحظه اغیار از عالم طبیعی کثیف تا امثال این حجاب‌ها است. پس این‌ها میان او و درک ملکوت، یعنی عالم غیب، حائل می‌شوند. پس هرگاه انسان قصد آینه قلب خود کند و آن را با ذکر و تلاوت قرآن جلا دهد، از آن نوری برایش حاصل می‌شود. و خداوند نوری دارد که بر تمام موجودات گسترده است و نور الوجود (نور هستی) نامیده می‌شود. پس هرگاه این دو نور با هم جمع شوند، مغیبات بر همان صورتی که هستند و بر همان صورتی که در هستی (الوجود) واقع شده‌اند، کشف می‌شوند. جز اینکه میان آن‌ها لطیفه‌ای از معنا وجود دارد؛ و آن این است که حس را دیوار و دوری مفرط و نزدیکی مفرط محجوب می‌سازد، اما چشم بصیرت چنین نیست و چیزی آن را محجوب نمی‌سازد، مگر آنچه از رین (زنگار)، کن (پوشش) و امثال آن ذکر کردیم. جز اینکه حجاب لطیف دیگری نیز هست که آن را ذکر می‌کنم.\n\n### [نور گسترده شده بر حضرات وجودی و بهره مکاشف از آن]\n\nو آن این است که نوری که از حضرة الجود (ساحت بخشش) بر عالم غیب در حضرات وجودی (الحضرات الوجودية) گسترده می‌شود، همه آن‌ها را فرا نمی‌گیرد و بر حسب آنچه خداوند متعال اراده کند، بر این مکاشف گسترده می‌شود. و این همان مقام وحی است. دلیل ما بر این، ذوق ما نسبت به خودمان است و برای دیگران، سخن اوست: «بگو: نمی‌دانم با من و با شما چه خواهد شد. من جز آنچه به من وحی می‌شود، پیروی نمی‌کنم.» (قُلْ ... مَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ) با وجود نهایت صفای محمدی. و سخن او: «یا از پشت حجاب.» (أَوْ مِنْ وَرَاءِ حِجَابٍ). پس هرگاه چیزی از این امر از کسی که در این مقام قرار گرفته است، بر ظاهرش در حق شخصی ظاهر شود، آن همان فراست است و بالاترین درجات مکاشفه (المکاشفة) است. و موضع آن در کتاب خدا: «همانا در این، نشانه‌هایی برای فراست‌مندان (المتوسمین) است.» (إِنَّ فِي ذَلِكَ لَآيَاتٍ لِلْمُتَوَسِّمِينَ)، از ریشه سمه (نشانه)، چنانکه گفتیم. و هرگز خطا نمی‌کند، برخلاف فراست حکمیه.\n\n### [حضرة السمات (ساحت نشانه‌ها) که در آن صورت‌های بنی آدم و احوالشان است]\n\nو کشف دیگری در فراست وجود دارد، و آن این است که خداوند در عالم، حضرة السمات (ساحت نشانه‌ها) را قرار داده است که در آن صورت‌های بنی آدم و احوالشان در زمان‌هایشان تا هنگام جدایی‌شان وجود دارد. و این از همه خلایق علوی و سفلی پنهان است، مگر از قلم و لوح. پس هرگاه خداوند اراده کند بنده‌ای را برگزیند و او را به این مقام اختصاص دهد، قلب او را پاک می‌کند و شرح می‌دهد و در آن چراغی نورانی از ایمان او به خصوص قرار می‌دهد که آن را از اسماء الهی، اسم «المؤمن المهیمن» روشن می‌سازد. و این حضرة (ساحت) در دست اوست. و آن چراغ از حضرة الألوهة (ساحت الوهیت) است که اسم «المؤمن» آن را می‌گیرد. پس هرگاه قلب با آن نور الهی روشن شود و نور در زوایای قلب او همراه با نور چشم بصیرت منتشر گردد، به طوری که درک‌کردنی‌ها را بر اساس کشف (الکشف) و شهود (الشهود) به دلیل وجود این انوار، درک کند. پس هرگاه قلب به آنچه ذکر کردیم، دست یابد، خداوند آن حضرة (ساحت) را که ذکر کردیم، در یکی از عرصه‌های این قلب قرار می‌دهد. پس از آنجا حرکات عالم و اسرار آن را می‌شناسد. پایان جزء صد و سوم."
  },
  "page_count": 7
}