{
  "id": 193,
  "title": {
    "ar": "الباب الثالث والتسعون ومائة في معرفة المقام",
    "en": "Chapter One Hundred and Ninety-Three: Concerning the Gnosis (المعرفة) of the Spiritual Station (المقام)",
    "ur": "ایک سو ترانوے واں باب، مقام کی معرفت میں",
    "fa": "باب صد و نود و سوم در معرفت مقام"
  },
  "content": {
    "ar": "## (الباب الثالث والتسعون ومائة في معرفة المقام)\n\n\n> إن المقام من الأعمال يكتسب *** له التعمل في التحصيل والطلب‏\n\n\n> به يكون كمال العارفين وما *** يردهم عنه لا ستر ولا حجب‏\n\n\n> له الدوام وما في الغيب من عجب *** الحكم فيه له والفصل والندب‏\n\n\n> هو النهاية والأحوال تابعة *** وما يجليه إلا الكد والنصب‏\n\n\n> إن الرسول من أجل الشكر قد ورمت *** أقدامه وعلاه الجهد والتعب‏\n\n\n### [أن المقامات وهي استيفاء الحقوق المرسومة شرعا على التمام‏]\n\n\nاعلم أن المقامات مكاسب وهي استيفاء الحقوق المرسومة شرعا على التمام فإذا قام العبد في الأوقات بما تعين عليه من‏\nالمعاملات وصنوف المجاهدات والرياضات التي أمره الشارع أن يقوم بها وعين نعوتها وأزمانها وما ينبغي لها وشروطها التمامية والكمالية الموجبة صحتها فحينئذ يكون صاحب مقام حيث أنشأ صورته كما أمر كما قيل له أَقِيمُوا الصَّلاةَ فأقاموا نشأتها صورة كاملة فخرجت طائرا ملكا روحا مقدسا فلم يكن له استقرار دون الحق ثم ينتقل هذا العبد إلى مقام آخر لينشتئ أيضا صورته وبهذا يكون العبد خلاقا هذا معنى المقام ولم يختلف أحد من أهل الله أنه ثابت غير زائل كما اختلفوا في الحال وليس الأمر عندنا على إطلاق ما قالوه بل يحتاج إلى تفصيل في ذلك وذلك لاختلاف حقائق المقامات فإنها ما هي على حقيقة واحدة فمن المقامات ما هو مشروط بشرط فإذا زال الشرط زال كالورع لا يكون إلا في المحظور أو المتشابه فإذا لم يوجد أحدهما أو كلاهما فلا ورع وكذلك الخوف والرجاء والتجريد الذي هو قطع الأسباب وهو ظاهر التوكل عند العامة ومن المقامات ما هو ثابت إلى الموت ويزول كالتوبة ومراعاة التكليفات المشرعة ومن المقامات ما يصحب العبد في الآخرة إلى أول دخول الجنة كبعض المقامات المشروطة من الخوف والرجاء ومن المقامات ما يدخل معه الجنة كمقام الأنس والبسط والظهور بصفات الجمال فالمقام هو ما يكون للعبد فيه إقامة وثبات وهو عنده لا يبرح فإن كان مشروطا وجاء شرطه أظهره ذلك الوقت لوجود شرطه فهو عنده معد فلذلك قيل فيه إنه ثابت لا أنه يستعمل في كل وقت فافهم‏\n\n",
    "en": "## Chapter One Hundred and Ninety-Three: Concerning the Knowledge of the Spiritual Station (المقام)\n\nThe Station (المقام) is acquired through deeds,\nFor it, effort is exerted in attainment and seeking.\n\nThrough it is the perfection of the Gnostics (العارفين),\nAnd nothing turns them away from it, neither veil nor barrier.\n\nIt possesses permanence, and what is in the Unseen (الغيب) is wondrous;\nThe ruling, the distinction, and the recommendation belong to it.\n\nIt is the ultimate goal, and the States (الأحوال) are subordinate;\nAnd nothing manifests it except toil and hardship.\n\nIndeed, the Messenger (ﷺ), for the sake of gratitude (الشكر), had\nHis feet swollen, and effort and fatigue overcame him.\n\n### [That the Spiritual Stations (المقامات) are the complete fulfillment of the rights prescribed by the Law (الشرع)]\n\nKnow that the Spiritual Stations (المقامات) are acquisitions (مكاسب), and they are the complete fulfillment of the rights prescribed by the Law (شرع). When the servant (العبد) stands in the appointed times fulfilling the duties incumbent upon him—from the dealings (المعاملات) and the various kinds of spiritual struggle (المجاهدات) and disciplines (الرياضات) which the Lawgiver (الشارع) commanded him to undertake, specifying their descriptions, their times, what is appropriate for them, and the conditions of perfection and completeness that necessitate their validity—then he becomes the possessor of a Station (صاحب مقام), having brought its form into existence exactly as commanded.\n\nJust as it was said to them, \"Establish the Prayer (الصلاة),\" and they established its origination as a complete form, so it emerged as a bird, an angel, a sanctified spirit, finding no rest except with The Real (الحق). Then this servant moves to another Station (مقام آخر) to likewise bring its form into existence. By this, the servant becomes a creator (خلاقا). This is the meaning of the Station (المقام).\n\nNone of the People of Allah (أهل الله) have disagreed that it [the Station] is fixed (ثابت) and non-perishing (غير زائل), unlike their disagreement concerning the Spiritual State (الحال). However, the matter, according to us, is not based on the absolute statement they made; rather, it requires detailed elaboration, due to the varying realities (حقائق) of the Stations, for they are not of a single reality.\n\nAmong the Stations are those conditioned by a prerequisite (مشروط بشرط); if the prerequisite ceases, the Station ceases. An example is scrupulousness (الورع), which only exists in relation to the forbidden (المحظور) or the ambiguous (المتشابه). If neither or both are present, there is no scrupulousness. The same applies to fear (الخوف), hope (الرجاء), and detachment (التجريد)—which is the cutting off of means (قطع الأسباب) and is the outward manifestation of reliance (التوكل) among the common folk.\n\nAnd among the Stations are those that are fixed until death and then cease, such as repentance (التوبة) and the observance of prescribed religious obligations (التكليفات المشرعة). And among the Stations are those that accompany the servant in the Hereafter (الآخرة) until the first entry into Paradise, such as some of the conditioned Stations like fear and hope. And among the Stations are those that enter Paradise with him, such as the Station of Intimacy (الأنس), Expansion (البسط), and Manifestation through the Attributes of Beauty (صفات الجمال).\n\nTherefore, the Station (المقام) is that in which the servant has residence (إقامة) and permanence (ثبات), and it remains with him, never departing. If it is conditioned, and its prerequisite appears, he manifests it at that time due to the existence of its prerequisite. Thus, it is prepared (معد) within him. For this reason, it is said to be fixed (ثابت), not that it is utilized at every moment. Understand this.",
    "ur": "## (باب ایک سو ترانوے: مقام کی معرفت میں)\n\nبے شک مقام (المقام) اعمال سے حاصل ہوتا ہے\nاس کے حصول اور طلب میں کوشش درکار ہے۔\n\nاسی سے عارفین (العارفين) کا کمال ہوتا ہے\nاور کوئی پردہ یا حجاب انہیں اس سے نہیں روکتا۔\n\nاس کے لیے دوام (الدوام) ہے اور غیب (الغيب) میں کوئی تعجب نہیں\nحکم، فیصلہ اور ترغیب اسی کے لیے ہے۔\n\nیہ انتہا ہے اور احوال (الأحوال) اس کے تابع ہیں\nاور اسے مشقت اور محنت کے سوا کوئی چیز ظاہر نہیں کرتی۔\n\nبے شک رسول (صلی اللہ علیہ وسلم) کے قدم شکر کے سبب سوج گئے تھے\nاور آپ پر مشقت اور تھکاوٹ غالب آ گئی تھی۔\n\n### [مقامات (المقامات) یہ ہیں کہ شرعی طور پر مقرر کردہ حقوق کو مکمل طور پر پورا کیا جائے]\n\nجان لیجیے کہ مقامات (المقامات) مکاسب ہیں، اور یہ شرعی طور پر مقرر کردہ حقوق کو مکمل طور پر پورا کرنا ہے۔ پس جب بندہ مقررہ اوقات میں ان معاملات، مختلف قسم کی مجاہدات (المجاهدات) اور ریاضات (الرياضات) کو پورا کرتا ہے جن کا شارع (الشارع) نے اسے حکم دیا ہے کہ وہ انہیں انجام دے، اور ان کی صفات، اوقات، ضروریات، اور ان کی صحت کو واجب کرنے والی تمام اور کمالی شرائط کو متعین کیا ہے، تو اس وقت وہ صاحبِ مقام (صاحب مقام) ہوتا ہے۔\n\nاس طرح کہ اس نے اس کی صورت کو ویسا ہی قائم کیا جیسا کہ اسے حکم دیا گیا تھا، جیسا کہ انہیں کہا گیا تھا: \"نماز قائم کرو (أَقِيمُوا الصَّلاةَ)\"، تو انہوں نے اس کی نشوونما کو ایک مکمل صورت میں قائم کیا، پس وہ ایک اڑنے والے فرشتے، ایک مقدس روح (روحاً مقدساً) کی صورت میں نکلی، اور اسے ذات حق (الحق) کے بغیر کوئی ٹھہراؤ نہ تھا۔ پھر یہ بندہ دوسرے مقام (المقام) کی طرف منتقل ہوتا ہے تاکہ وہ بھی اس کی صورت کو قائم کرے، اور اسی سے بندہ خلاق (خلاق) بن جاتا ہے۔ یہ مقام (المقام) کا مفہوم ہے۔\n\nاور اہلِ اللہ (أهل الله) میں سے کسی نے بھی اس بات پر اختلاف نہیں کیا کہ یہ ثابت ہے، زائل ہونے والا نہیں، جیسا کہ انہوں نے حال (الحال) کے بارے میں اختلاف کیا ہے۔ لیکن ہمارے نزدیک معاملہ اس مطلقیت پر نہیں ہے جو انہوں نے بیان کی ہے، بلکہ اس میں تفصیل کی ضرورت ہے، اور یہ مقامات (المقامات) کی حقیقتوں کے اختلاف کی وجہ سے ہے، کیونکہ وہ ایک ہی حقیقت پر نہیں ہیں۔\n\nپس مقامات (المقامات) میں سے کچھ ایسے ہیں جو کسی شرط کے ساتھ مشروط ہیں، لہٰذا جب شرط زائل ہو جاتی ہے تو وہ بھی زائل ہو جاتے ہیں، جیسے ورع (الورع) جو صرف ممنوع (المحظور) یا متشابہ (المتشابه) میں ہوتا ہے۔ پس اگر ان دونوں میں سے کوئی ایک یا دونوں نہ پائے جائیں تو ورع نہیں ہے۔ اور اسی طرح خوف (الخوف)، رجاء (الرجاء)، اور تجرید (التجريد) جو اسباب کو منقطع کرنا ہے، اور جو عام لوگوں کے نزدیک توکل (التوكل) کا ظاہری پہلو ہے۔\n\nاور مقامات (المقامات) میں سے کچھ ایسے ہیں جو موت تک ثابت رہتے ہیں اور پھر زائل ہو جاتے ہیں، جیسے توبہ (التوبة) اور شرعی ذمہ داریوں (التكليفات المشرعة) کی رعایت۔ اور مقامات (المقامات) میں سے کچھ ایسے ہیں جو آخرت میں جنت میں پہلے داخلے تک بندے کے ساتھ رہتے ہیں، جیسے خوف (الخوف) اور رجاء (الرجاء) کے بعض مشروط مقامات۔ اور مقامات (المقامات) میں سے کچھ ایسے ہیں جو اس کے ساتھ جنت میں داخل ہوتے ہیں، جیسے مقامِ اُنس (الأنس)، بسط (البسط)، اور صفاتِ جمال (صفات الجمال) کے ساتھ ظہور۔\n\nپس مقام (المقام) وہ ہے جس میں بندے کے لیے قیام اور ثبات ہوتا ہے، اور وہ اس کے پاس رہتا ہے، کبھی جدا نہیں ہوتا۔ پس اگر وہ مشروط ہو اور اس کی شرط آ جائے تو وہ اس وقت ظاہر ہو جاتا ہے کیونکہ اس کی شرط موجود ہے۔ لہٰذا وہ اس کے پاس تیار (معد) ہوتا ہے۔ اسی لیے اس کے بارے میں کہا گیا ہے کہ وہ ثابت ہے، نہ کہ وہ ہر وقت استعمال ہوتا ہے۔ پس سمجھ لو۔",
    "fa": "باب صد و نود و سوم در معرفت مقام (معرفت/عرفان)\n\nمقام از اعمال کسب می‌شود، و برای تحصیل و طلب آن، تلاش لازم است.\nبه واسطه آن، کمال عارفان حاصل می‌شود و هیچ پرده و حجابی آنان را از آن باز نمی‌دارد.\nدوام از آنِ اوست، و شگفتی‌هایی در غیب است؛ حکم و داوری و توصیه در آن برای اوست.\nاو نهایت است و احوال تابع‌اند، و جز رنج و سختی (کد و نصب) آن را آشکار نمی‌سازد.\nهمانا پیامبر (ص) به خاطر شکر، پاهایش ورم کرد و رنج و خستگی بر او غالب شد.\n\n[مقامات، عبارتند از استیفای کامل حقوقی که شرعاً مقرر شده‌اند]\n\nبدان که مقامات، کسب‌شدنی هستند و عبارتند از استیفای کامل حقوقی که شرعاً مقرر شده‌اند. پس هنگامی که بنده در اوقات، به آنچه از معاملات و انواع مجاهدات و ریاضت‌ها که شارع او را به انجام آنها امر کرده و اوصاف، زمان‌ها، لوازم و شروط تمامیت و کمالیِ موجب صحت آنها را تعیین نموده، قیام کند؛ در آن هنگام، صاحب مقام می‌شود. زیرا صورت آن را چنان که امر شده، ایجاد کرده است؛ چنان که به او گفته شد: «نماز را برپا دارید» (أَقِيمُوا الصَّلاةَ)، پس نشأت آن را به صورت کامل برپا داشتند و آن (صورت) به صورت پرنده‌ای ملکوتی، روحی مقدس خارج شد و برای آن، قراری جز نزد حق (الحق) نبود. سپس این بنده به مقام دیگری منتقل می‌شود تا صورت آن را نیز ایجاد کند. و به این ترتیب، بنده «خَلّاق» (آفریننده صورت‌ها) می‌شود. این معنای مقام است.\n\nهیچ یک از اهل الله (عرفا) در این که مقام ثابت و غیرزائل است، اختلاف نکرده‌اند، چنان که در مورد حال اختلاف کردند. اما امر نزد ما بر اطلاق آنچه آنان گفته‌اند نیست، بلکه نیاز به تفصیل در آن دارد؛ و این به دلیل اختلاف حقایق مقامات است، زیرا آنها بر یک حقیقت واحد نیستند.\n\nپس برخی از مقامات مشروط به شرطی هستند که اگر شرط زائل شود، مقام نیز زائل می‌شود؛ مانند ورع (پرهیزگاری) که جز در مورد حرام (محظور) یا مشتبه وجود ندارد. پس اگر یکی از آن دو یا هر دو یافت نشود، ورعی نیست. و همچنین خوف و رجاء و تجرید (تجريد) که همان قطع اسباب است و این ظاهر توکل نزد عامه است.\n\nو برخی از مقامات تا زمان مرگ ثابت هستند و سپس زائل می‌شوند، مانند توبه و مراعات تکالیف شرعی. و برخی از مقامات بنده را در آخرت تا اولین لحظه ورود به بهشت همراهی می‌کنند، مانند برخی از مقامات مشروط از قبیل خوف و رجاء. و برخی از مقامات با او وارد بهشت می‌شوند، مانند مقام اُنس و بسط و ظهور به صفات جمال.\n\nپس مقام آن چیزی است که بنده در آن اقامت و ثبات دارد و نزد اوست و ترک نمی‌شود. اگر مشروط باشد و شرطش فرا رسد، آن را در آن وقت به دلیل وجود شرطش آشکار می‌سازد. پس آن نزد او آماده است. به همین دلیل گفته شده که ثابت است، نه این که در هر وقت به کار رود. پس بفهم."
  },
  "page_count": 2
}