{
  "id": 102,
  "title": {
    "ar": "الباب الثاني ومائة في مقام الرجاء",
    "en": "Chapter One Hundred and Two: Concerning the Station of Hope (مقام الرجاء)",
    "ur": "باب ایک سو دو: مقام رجاء میں",
    "fa": "باب صد و دوم در مقام امید (الرجاء)"
  },
  "content": {
    "ar": "## (الباب الثاني ومائة في مقام الرجاء)\n\n\n> إن الرجاء كمثل الخوف في الحكم *** فاعزم عليه وكن منه على علم‏\n\n\n> إن الرجاء مقام ليس يعلمه *** إلا أولو العلم بالرحمن والفهم‏\n\n\n> يلتذ صاحبه في وقته فإذا *** يفوته كان مثل الخوف في الحكم‏\n\n\n> وإن ما أنت راجيه لفي عدم *** ولست من فقده المعلوم في عم‏\n\n\n### [الرجاء متعلقه ما ليس عنده وهو مقام مخوف‏]\n\n\nالرجاء متعلقة ما ليس عنده وهو مقام مخوف يحتاج صاحبه إلى أدب حاضر حاصل ومعرفة ثابتة لا يدخلها شبهة فإنه مقام عن جانب الطريق ما هو في نفس الطريق تحته مهواة بأدنى زلة يسقط صاحبه من الطريق وهو على طريق الحياة الدائمة التي بها بقاء العالم في النعيم والحال التي ينبغي أن يظهر سلطانه فيها عند الاحتضار وأما قبل ذلك فيساوي بين حكمه وبين حكم الخوف إن كان مؤمنا حقيقة\n\n\nقال الله تعالى أنا عند ظن عبدي بي فليظن بي خيرا\n\n\nوكذلك ينبغي أن يظن بنفسه شرا لا بربه إلا عند الموت فإنه يشتغل بربه في تلك الحال ويظن به خيرا ويعرض عن ظنه بنفسه جملة واحدة بخلاف حاله في دنياه‏\n\n\n### [الرجاء المطلوب من أهل الله هو ما يطلبه الوقت‏]\n\n\nوالرجاء المطلوب من أهل الله هو ما يطلبه وقته لأن المرجو معدوم في تلك الحال فيخاف على الراجي أن يفوته حكم الوقت فإذا كان متعلق رجائه ما يطلب الوقت فهو صاحب وقت ولا بد وما يرسم في ديوان من لم يتأدب مع وقته ثم إن وقته لا يخلو من أحد ثلاثة أمور إما أن يكون صاحب وقت مرضي فمتعلق رجائه ما يطلبه الوقت المرضى وإن كان غير مرضي أو لا مرضي ولا غير مرضي كالمباح فمتعلق رجائه إزالته عنه بما هو مرضي في النفس الثاني والزمان الذي يليه فمتى خرج عن هذا التعلق الخاص فليس هو الرجاء الذي هو مقام في الطريق‏\n\n\n### [الرجاء هو من المقامات المستصحبة دنيا وآخرة]\n\n\nوهو من المقامات المستصحبة في الدنيا والآخرة لا ينقطع لأن الإنسان حيث كان لا يزال صاحب قوت لأن الأمر لا يتناهى وكلامنا في الفائت المستأنف وأما الفائت الماضي فإنه لا يعود إذ لو عاد لتكرر أمر ما في الوجود ولا تكرار للتوسع الإلهي غير أنه إن كان الفائت الماضي مرضيا وهو لا يعود فحكم ذلك الفعل الفائت الماضي فهو إنما يجنيه في الآخرة ولو اتصف به في الدنيا فقد يتعلق الرجاء بتحصيل ما لو كان الفائت الماضي لم يفت حصل له فيحصل له مثل ذلك برجائه إن كان قد كان له وجود وانقضى أو عين ذلك المرجو إن كان لم يكن برجائه فإنه فائت مستأنف كان مهيا للفائت الماضي هذا غاية قوة الرجاء\n\n\n### [مثل الذي يفوته خير في الدنيا ويرى من له شي‏ء من ذلك‏]\n\n\nوقد قال صَلَّى اللهُ عَليهِ وسَلَّم في الذي يفوته خير الدنيا ويرى من له شي‏ء من ذلك الخير يعمل به في طاعة الله لو كان لي مثل هذا العامل من الخير لفعلت مثل ما فعل‏\n\n\nفهما في الأجر سواء فهذا قد فاته العمل وجنى ثمرته بالتمني وساوى من لم يفته العمل وربما أربى عليه لا بل أربى عليه فإن العامل مسئول لِيَسْئَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ وهذا غير مسئول لأنه ليس بعامل ولا يكون هذا إلا لمن لم يعطه الله أمنيته من الخير الذي تمنى العمل به فإن أعطاه ما تمناه من الخير فليس له هذا المقام ولا هذا الأجر وينتقل حكمه إلى ما يعمله فيما أعطاه الله من الخير ولا يبقى للتمني في الآخرة أثر فإن عمل به برا كان له وإن عمل غير ذلك‏\nكان في حكم المشيئة\n\n\n### [رجاء القوم في رحمة الله ورجاء العاصين‏]\n\n\nوليس رجاء القوم رجاء العاصين في رحمة الله ذلك رجاء آخر ما هو مقام وكلامنا في المقام والرجاء عند بعضهم مقام إلهي واستدلوا عليه بقوله في غير آية لَعَلَّ وعَسَى ولهذا جعلها علماء الرسوم من الله واجبة\n\n",
    "en": "Chapter One Hundred and Two: Concerning the Station of Hope (مقام الرجاء)\n\nIndeed, Hope is like Fear in its ruling,\nSo resolve upon it and be knowledgeable concerning it.\n\nIndeed, Hope is a station (مقام) that none knows\nSave those possessed of Knowledge (العلم) of the All-Merciful and understanding.\n\nIts possessor finds delight in his Moment (وقته),\nBut if it escapes him, it is like Fear in its ruling.\n\nAnd indeed, that which you hope for is in non-existence (عدم),\nAnd you are not blind to its known loss.\n\n### [Hope (الرجاء) is related to that which one does not possess, and it is a perilous station]\n\nHope (الرجاء) is related to that which one does not possess, and it is a perilous station (مقام مخوف). Its possessor requires present, attained discipline (أدب حاضر حاصل) and firm Gnosis (معرفة ثابتة) into which no doubt enters. For it is a station situated on the side of the Path, not within the Path itself. Beneath it is an abyss (مهواة) where the slightest slip causes its possessor to fall from the Path. Yet, it is upon the path of Perpetual Life (الحياة الدائمة) by which the World (العالم) subsists in bliss, and it is the state whose sovereignty ought to manifest at the time of death (الاحتضار). As for before that, its ruling is equal to the ruling of Fear (الخوف), provided one is truly a believer.\n\nAllah the Exalted said: \"I am as My servant thinks of Me, so let him think good of Me.\"\n\nLikewise, one ought to think evil of oneself, but not of one's Lord, except at the time of death. For in that state, one is preoccupied with one's Lord, thinking good of Him, and turning away entirely from thinking of oneself. This is contrary to one's state in the world.\n\n### [The Hope (الرجاء) required of the People of Allah (أهل الله) is that which the Moment (الوقت) demands]\n\nThe Hope (الرجاء) required of the People of Allah (أهل الله) is that which their Moment (وقته) demands, because the object of hope is non-existent in that state. Thus, there is fear for the hopeful person that the ruling of the Moment might escape him. If the object of his hope is what the Moment demands, then he is necessarily a master of the Moment (صاحب وقت), and he is not recorded in the register of those who lack discipline concerning their Moment. Furthermore, his Moment is not devoid of one of three matters: either he is the master of an acceptable Moment (وقت مرضي), in which case the object of his hope is what the acceptable Moment demands; or it is unacceptable (غير مرضي), or neither acceptable nor unacceptable, such as the permissible (المباح). In these latter cases, the object of his hope is its removal by means of what is acceptable (مرضي) in the second self and the time that follows it. Whenever he departs from this specific relation, it is not the Hope (الرجاء) that constitutes a station (مقام) on the Path.\n\n### [Hope (الرجاء) is among the stations (المقامات) that accompany one in this world and the Hereafter]\n\nIt is among the stations (المقامات) that accompany one in this world and the Hereafter (الآخرة); it is not cut off, because wherever the human being is, he remains the possessor of strength (صاحب قوت), for the matter is endless. Our discussion concerns the Missed Future (الفائت المستأنف). As for the Missed Past (الفائت الماضي), it does not return, for if it returned, a matter would be repeated in Existence (الوجود), and there is no repetition due to the Divine Expansion (التوسع الإلهي). However, if the Missed Past was acceptable (مرضيا) and it does not return, the ruling of that missed past action is what he reaps in the Hereafter (الآخرة), even if he was characterized by it in the world. Hope may thus relate to the attainment of that which, had the Missed Past not been missed, would have been attained by him. He attains the like of that through his hope, if it had an existence and passed away, or the very essence (عين) of that hoped-for thing, if it had not existed through his hope, for it is a Missed Future (فائت مستأنف) that was prepared for the Missed Past. This is the ultimate strength of Hope.\n\n### [The example of one who misses a good deed in the world and sees someone who possesses some of that good]\n\nThe Prophet, peace and blessings be upon him, said concerning the one who misses a good deed in the world and sees someone who possesses some of that good and acts upon it in obedience to Allah: \"If I had the like of this worker of good, I would do the same as he did.\" They are equal in reward. Thus, this person missed the action but reaped its fruit through aspiration (التمني), and he equaled the one who did not miss the action. Perhaps he even surpassed him. Nay, rather, he surpassed him, for the worker is questioned: <<لِيَسْئَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ>> (That He may question the truthful concerning their truthfulness), while this one is not questioned because he is not a worker. This only occurs for the one whom Allah did not grant his aspiration (أمنيته) for the good deed he wished to perform. If Allah grants him the good he aspired to, he does not have this station (مقام) or this reward, and his ruling shifts to what he actually performs of the good Allah granted him. Aspiration (التمني) will have no effect in the Hereafter. If he acts upon it righteously, it is for him; and if he acts otherwise, it falls under the ruling of the Divine Will (المشيئة).\n\n### [The Hope of the People (القوم) in Allah’s Mercy and the Hope of the Sinners]\n\nThe Hope (رجاء) of the People [of Allah] (القوم) is not the hope of the sinners in Allah’s Mercy. That is another kind of hope, which is not a station (مقام), and our discussion concerns the station. Hope (الرجاء), according to some of them, is a Divine Station (مقام إلهي). They cite as evidence His saying in several verses, *la‘alla* (perhaps) and *‘asā* (it may be). For this reason, the scholars of external rulings (علماء الرسوم) have deemed these terms, when used by Allah, to imply obligation.",
    "ur": "(باب ایک سو دو: مقام رجاء کے بیان میں)\n\nبیشک رجاء (الرجاء) حکم میں خوف (الخوف) کی مانند ہے، پس اس پر عزم کر اور اس کا علم رکھ۔\nبیشک رجاء (الرجاء) ایک ایسا مقام (المقام) ہے جسے نہیں جانتے مگر وہ جو رحمن کا علم اور فہم رکھتے ہیں۔\nاس کا صاحب اپنے وقت (الوقت) میں لذت پاتا ہے، لیکن جب وہ فوت ہو جائے تو وہ حکم میں خوف (الخوف) کی مانند ہو جاتا ہے۔\nاور بیشک جس چیز کی تو امید رکھتا ہے وہ عدم میں ہے، اور تو اس معلوم فقدان سے اندھا نہیں ہے۔\n\n### [رجاء کا تعلق اس چیز سے ہے جو اس کے پاس نہیں ہے، اور یہ ایک خوفناک مقام ہے]\n\nرجاء (الرجاء) کا تعلق اس چیز سے ہے جو اس کے پاس نہیں ہے، اور یہ ایک خوفناک مقام (المقام) ہے جس کے صاحب کو حاضر ادب اور ثابت معرفت (المعرفۃ) کی ضرورت ہوتی ہے جس میں کوئی شبہ داخل نہ ہو۔ کیونکہ یہ مقام راستے کے کنارے پر ہے، یہ خود راستے میں نہیں ہے۔ اس کے نیچے ایک گہری کھائی ہے، معمولی سی لغزش پر اس کا صاحب راستے سے گر جاتا ہے۔ حالانکہ یہ دائمی زندگی کے راستے پر ہے جس کے ذریعے عالم کی بقا نعمت میں ہے، اور یہ وہ حال ہے جس میں اس کا اقتدار نزع کی حالت (الاحتضار) میں ظاہر ہونا چاہیے۔ اس سے پہلے، اگر وہ حقیقی مومن ہے تو اس کا حکم خوف (الخوف) کے حکم کے برابر ہے۔\n\nاللہ تعالیٰ نے فرمایا: \"میں اپنے بندے کے گمان (الظن) کے پاس ہوتا ہوں، پس وہ مجھ سے اچھا گمان رکھے۔\" (قال الله تعالى أنا عند ظن عبدي بي فليظن بي خيرا)\n\nاور اسی طرح اسے چاہیے کہ وہ اپنے رب کے بارے میں نہیں بلکہ اپنے نفس کے بارے میں برا گمان رکھے، سوائے موت کے وقت کے۔ کیونکہ اس حال میں وہ اپنے رب کے ساتھ مشغول ہوتا ہے اور اس سے اچھا گمان رکھتا ہے، اور اپنے نفس کے بارے میں گمان سے یکسر اعراض کرتا ہے، برخلاف اس کی دنیاوی حالت کے۔\n\n### [اہل اللہ سے مطلوب رجاء وہ ہے جو وقت (الوقت) کا تقاضا ہو]\n\nاور اہل اللہ سے مطلوب رجاء (الرجاء) وہ ہے جو اس کا وقت (الوقت) طلب کرے۔ کیونکہ جس کی امید کی جا رہی ہے وہ اس حال میں معدوم ہوتا ہے، لہٰذا راجی پر خوف ہوتا ہے کہ کہیں وقت (الوقت) کا حکم اس سے فوت نہ ہو جائے۔ پس جب اس کے رجاء کا تعلق اس چیز سے ہو جو وقت (الوقت) کا تقاضا ہے، تو وہ لازماً صاحب وقت (صاحب وقت) ہے۔ اور جو شخص اپنے وقت (الوقت) کے ساتھ ادب اختیار نہیں کرتا، وہ دیوان میں درج نہیں ہوتا۔ پھر اس کا وقت تین چیزوں میں سے کسی ایک سے خالی نہیں ہوتا: یا تو وہ وقت مرضی ہو، تو اس کے رجاء کا تعلق اس چیز سے ہوگا جو مرضی وقت طلب کرتا ہے۔ اور اگر وہ غیر مرضی ہو، یا نہ مرضی ہو اور نہ غیر مرضی ہو جیسے کہ مباح، تو اس کے رجاء کا تعلق اس چیز کو زائل کرنے سے ہوگا جو دوسرے نفس اور اس کے بعد آنے والے زمانے میں مرضی ہو۔ پس جب وہ اس خاص تعلق سے باہر نکل جائے تو وہ وہ رجاء نہیں ہے جو راستے میں ایک مقام (المقام) ہے۔\n\n### [رجاء ان مقامات (المقامات) میں سے ہے جو دنیا اور آخرت میں ساتھ رہتے ہیں]\n\nاور یہ ان مقامات (المقامات) میں سے ہے جو دنیا اور آخرت میں ساتھ رہتے ہیں، یہ منقطع نہیں ہوتا، کیونکہ انسان جہاں بھی ہو، وہ ہمیشہ صاحب قوت رہتا ہے، کیونکہ معاملہ لامتناہی ہے۔ اور ہماری گفتگو فوت شدہ اور نئے شروع ہونے والے (مستأنف) کے بارے میں ہے۔ جہاں تک فوت شدہ ماضی کا تعلق ہے، تو وہ واپس نہیں آتا، کیونکہ اگر وہ واپس آتا تو وجود (الوجود) میں کسی چیز کا تکرار ہوتا، اور الٰہی وسعت کی وجہ سے کوئی تکرار نہیں ہے۔ تاہم، اگر فوت شدہ ماضی مرضی تھا اور وہ واپس نہیں آتا، تو اس فوت شدہ ماضی کے فعل کا حکم یہ ہے کہ وہ اسے آخرت میں حاصل کرے گا، اگرچہ اس نے دنیا میں اس سے صفت اختیار کی ہو۔ پس رجاء کا تعلق ایسی چیز کے حصول سے ہو سکتا ہے کہ اگر فوت شدہ ماضی فوت نہ ہوتا تو اسے حاصل ہو جاتا، تو وہ اسے اپنے رجاء کے ذریعے حاصل کر لیتا ہے، اگر اس کا وجود تھا اور وہ ختم ہو گیا، یا عین وہی مرجو حاصل ہو جاتا ہے اگر وہ اس کے رجاء کے ذریعے نہیں تھا، کیونکہ وہ ایک نیا شروع ہونے والا (مستأنف) ہے جو فوت شدہ ماضی کے لیے تیار کیا گیا تھا۔ یہ رجاء کی قوت کی انتہا ہے۔\n\n### [اس شخص کی مثال جسے دنیا میں کوئی بھلائی فوت ہو جائے اور وہ کسی ایسے شخص کو دیکھے جسے وہ بھلائی حاصل ہو]\n\nاور نبی اکرم صَلَّى اللهُ عَليهِ وسَلَّم نے اس شخص کے بارے میں فرمایا جسے دنیا کی بھلائی فوت ہو جائے اور وہ کسی ایسے شخص کو دیکھے جسے وہ بھلائی حاصل ہو اور وہ اسے اللہ کی اطاعت میں استعمال کر رہا ہو: \"کاش میرے پاس بھی اس عامل کی طرح بھلائی ہوتی تو میں بھی وہی کرتا جو اس نے کیا۔\" (لو كان لي مثل هذا العامل من الخير لفعلت مثل ما فعل)\n\nپس وہ دونوں اجر میں برابر ہیں۔ اس شخص سے عمل فوت ہو گیا لیکن اس نے تمنا کے ذریعے اس کا پھل حاصل کر لیا، اور وہ اس شخص کے برابر ہو گیا جس سے عمل فوت نہیں ہوا، اور شاید اس سے بڑھ بھی گیا۔ بلکہ یقیناً اس سے بڑھ گیا، کیونکہ عامل سے سوال کیا جائے گا: \"تاکہ وہ سچوں سے ان کی سچائی کے بارے میں سوال کرے\" (لِيَسْئَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ)، اور اس شخص سے سوال نہیں کیا جائے گا کیونکہ وہ عامل نہیں ہے۔ اور یہ صرف اس شخص کے لیے ہوگا جسے اللہ نے وہ بھلائی نہ دی ہو جس کے عمل کی اس نے تمنا کی تھی۔ اگر اللہ اسے وہ بھلائی دے دے جس کی اس نے تمنا کی تھی، تو اسے یہ مقام (المقام) اور یہ اجر حاصل نہیں ہوگا، اور اس کا حکم اس عمل کی طرف منتقل ہو جائے گا جو وہ اس بھلائی میں کرے گا جو اللہ نے اسے دی ہے، اور آخرت میں تمنا کا کوئی اثر باقی نہیں رہے گا۔ پس اگر اس نے اس کے ساتھ نیکی کی تو وہ اس کے لیے ہوگی، اور اگر اس نے اس کے علاوہ کوئی عمل کیا تو وہ مشیئت (ارادہ الٰہی) کے حکم میں ہوگا۔\n\n### [قوم (صوفیاء) کا رجاء (الرجاء) اللہ کی رحمت میں اور گناہگاروں کا رجاء]\n\nاور قوم (صوفیاء) کا رجاء (الرجاء) گناہگاروں کے رجاء (الرجاء) کی طرح نہیں ہے جو اللہ کی رحمت میں ہوتا ہے۔ وہ ایک دوسرا رجاء ہے جو مقام (المقام) نہیں ہے، اور ہماری گفتگو مقام (المقام) کے بارے میں ہے۔ اور بعض کے نزدیک رجاء (الرجاء) ایک الٰہی مقام (المقام) ہے، اور انہوں نے اس پر اللہ کے کئی آیات میں \"لَعَلَّ\" (شاید) اور \"عَسَى\" (امید ہے) کے استعمال سے استدلال کیا ہے۔ اسی لیے علماء رسوم نے اسے اللہ کی طرف سے واجب قرار دیا ہے۔",
    "fa": "باب صد و دوم در مقام رجاء (Rajāʾ)\n\nرجاء (Rajāʾ) در حکم مانند خوف (Khawf) است،\nپس بر آن عزم کن و از آن آگاه باش.\n\nرجاء (Rajāʾ) مقامی است که آن را نمی‌داند،\nمگر صاحبان علم به رحمان و فهم.\n\nصاحبش در وقت خود از آن لذت می‌برد، اما اگر\nاز دستش برود، در حکم مانند خوف (Khawf) است.\n\nو آنچه تو به آن امید داری در نیستی (عدم) است،\nو تو از فقدان معلوم آن در کوری (عمى) نیستی.\n\n### [رجاء (Rajāʾ) به چیزی تعلق دارد که نزد سالک نیست و آن مقامی بیمناک است]\n\nرجاء (Rajāʾ) به چیزی تعلق دارد که نزد سالک نیست و آن مقامی بیمناک است که صاحبش نیازمند ادب حاضر و حاصل و معرفت (Ma‘rifa) ثابتی است که شبهه‌ای در آن راه نیابد. زیرا این مقام در کنار راه است، نه در خود راه؛ زیر آن پرتگاهی است که با کوچک‌ترین لغزشی، صاحبش از راه سقوط می‌کند. این مقام بر طریق حیات دائمی است که بقای عالم در نعمت به واسطه آن است، و نیز حالتی است که شایسته است سلطنت آن هنگام احتضار (Iḥtiḍār) آشکار شود. اما پیش از آن، اگر مؤمن حقیقی باشد، حکم آن با حکم خوف (Khawf) برابر است.\n\nخداوند متعال فرموده است: «من نزد گمان بنده خود هستم، پس باید به من گمان نیک برد.»\n\nو همچنین شایسته است که به خود گمان بد برد، نه به پروردگارش، مگر هنگام مرگ. زیرا در آن حال به پروردگارش مشغول می‌شود و به او گمان نیک می‌برد و از گمان خود به خویشتن یکسره روی می‌گرداند، برخلاف حال او در دنیایش.\n\n### [رجاء (Rajāʾ) مطلوب از اهل الله، آن چیزی است که وقت (Waqt) آن را می‌طلبد]\n\nو رجاء (Rajāʾ) مطلوب از اهل الله، آن چیزی است که وقت (Waqt) او آن را می‌طلبد، زیرا مرجوّی (آنچه به آن امید بسته شده) در آن حال معدوم است. پس بیم آن می‌رود که حکم وقت (Waqt) از راجی (امیدوار) فوت شود. بنابراین، اگر متعلق رجاء (Rajāʾ) او چیزی باشد که وقت (Waqt) آن را می‌طلبد، او ناگزیر صاحب وقت است و در دیوان کسی که با وقت خود ادب نورزیده، ثبت نمی‌شود. سپس، وقت او از یکی از سه حالت خارج نیست: یا صاحب وقت مرضی (پسندیده) است، در این صورت متعلق رجاء (Rajāʾ) او چیزی است که وقت مرضی می‌طلبد؛ و اگر وقت غیر مرضی یا نه مرضی و نه غیر مرضی باشد، مانند مباح، متعلق رجاء (Rajāʾ) او از بین بردن آن است به واسطه آنچه در نفس دوم و زمان پس از آن مرضی است. پس هرگاه از این تعلق خاص خارج شود، آن رجاء (Rajāʾ) مقامی در طریق نیست.\n\n### [رجاء (Rajāʾ) از مقاماتی است که در دنیا و آخرت همراه سالک است]\n\nو رجاء (Rajāʾ) از مقاماتی است که در دنیا و آخرت همراه سالک است و قطع نمی‌شود، زیرا انسان هر کجا که باشد، همواره صاحب قوت است، چرا که امر پایان نمی‌پذیرد. سخن ما درباره امر فوت شده‌ای است که از نو آغاز می‌شود (مستأنف). اما امر فوت شده گذشته باز نمی‌گردد، زیرا اگر باز می‌گشت، امری در هستی (al-Wujūd) تکرار می‌شد، در حالی که برای توسعه الهی تکراری وجود ندارد. با این حال، اگر امر فوت شده گذشته مرضی (پسندیده) بوده و باز نمی‌گردد، حکم آن فعل فوت شده گذشته را تنها در آخرت درو می‌کند، هرچند در دنیا به آن متصف شده باشد. پس ممکن است رجاء (Rajāʾ) به دست آوردن چیزی تعلق گیرد که اگر امر فوت شده گذشته از دست نرفته بود، برای او حاصل می‌شد؛ و به واسطه رجاء (Rajāʾ) خود، مانند آن را به دست می‌آورد، اگر آن امر وجود داشته و سپری شده باشد، یا عین همان مرجوّی را به دست می‌آورد اگر به واسطه رجاء (Rajāʾ) او نبوده باشد، زیرا آن یک امر فوت شده مستأنف است که برای امر فوت شده گذشته مهیا شده بود. این نهایت قدرت رجاء (Rajāʾ) است.\n\n### [مثال کسی که خیری در دنیا از دستش می‌رود و کسی را می‌بیند که چیزی از آن خیر را دارد]\n\nو پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره کسی که خیر دنیا از دستش می‌رود و کسی را می‌بیند که چیزی از آن خیر را دارد و آن را در طاعت خداوند انجام می‌دهد، فرمود: «اگر من نیز مانند این عامل، خیری داشتم، همانند آنچه او انجام داد، انجام می‌دادم.»\n\nپس آن دو در پاداش برابرند. این شخص عمل از دستش رفته، اما ثمره آن را با آرزو (تمنّی) درو کرده و با کسی که عمل از دستش نرفته برابر شده است، و شاید بر او فزونی یابد، بلکه بر او فزونی می‌یابد. زیرا عامل مورد سؤال قرار می‌گیرد: **لِيَسْئَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ** (تا از راستگویان درباره صدقشان بپرسد) [الأحزاب: ۸]. و این شخص مورد سؤال نیست، زیرا عامل نیست. و این مقام و پاداش تنها برای کسی است که خداوند آرزوی او را در مورد خیری که آرزوی انجامش را داشت، به او نداده باشد. اما اگر آنچه را آرزو کرده بود به او بدهد، این مقام و این پاداش برای او نیست و حکم او به آنچه در آن خیرِ اعطا شده توسط خداوند انجام می‌دهد، منتقل می‌شود و برای آرزو (تمنّی) در آخرت اثری باقی نمی‌ماند. پس اگر با آن نیکی کند، برای اوست، و اگر غیر از آن عمل کند، در حکم مشیّت (اراده الهی) خواهد بود.\n\n### [رجاء (Rajāʾ) اهل سلوک در رحمت خداوند و رجاء (Rajāʾ) گناهکاران]\n\nو رجاء (Rajāʾ) اهل سلوک، رجاء (Rajāʾ) گناهکاران در رحمت خداوند نیست؛ آن رجاء (Rajāʾ) دیگری است که مقام نیست، و سخن ما درباره مقام است. و رجاء (Rajāʾ) نزد برخی از ایشان مقامی الهی است و برای اثبات آن به فرموده خداوند در آیات متعدد استدلال کرده‌اند: **لَعَلَّ** (شاید) و **عَسَى** (امید است). به همین دلیل، علمای رسوم (شریعت) این کلمات را از جانب خداوند واجب‌الوقوع دانسته‌اند."
  },
  "page_count": 2
}