{
  "id": 277,
  "title": {
    "ar": "الباب السابع والسبعون ومائتان في معرفة منزل التكذيب والبخل وأسراره من المقام الموسوي",
    "en": "Chapter Two Hundred and Seventy-Seven: Concerning the Knowledge (معرفة) of the Station (منزل) of Denial (التكذيب) and Stinginess (البخل), and its Secrets (أسرار), derived from the Mosaic Station (المقام الموسوي).",
    "ur": "باب دو سو ستتر (۲۷۷) تکذیب اور بخل کی منزل کی معرفت اور اس کے اسرار کے بیان میں، جو مقام موسوی سے متعلق ہے۔",
    "fa": "باب دویست و هفتاد و هفتم در معرفت منزل تکذیب و بخل و اسرار آن از مقام موسوی."
  },
  "content": {
    "ar": "## «الباب السابع والسبعون ومائتان في معرفة منزل التكذيب والبخل وأسراره من المقام الموسوي»\n\n\n> العلم علمان علم الدين في الصور *** الظاهرات من الأرواح في البشر\n\n\n> وعلم حق بتحقيق يؤيده *** ما أودع الله في الآيات والسور\n\n\n> من كل ناظرة بالعين ناضرة *** فاللام ناظرة بالفاء في خبر\n\n\n> هذي منازل أنوار سباعية *** الخمس تخنس دون الشمس والقمر\n\n\n> منها ليظهر ما في الغيب من عجب *** فكل منزلة تسعى على قدر\n\n\n> إن الصفات التي جاء الكتاب بها *** تقدست على مجال العقل والفكر\n\n\n> وكيف يدرك من لا شي‏ء يشبهه *** من يأخذ العلم عن حس وعن نظر\n> فالعلم بالله عين الجهل فيه به *** والجهل بالله عين العلم فاعتبر\n\n\n> وليس في الكون معلوم سواه فما *** تقول يا أيها المغلوب عن حصر\n\n\n> إن الظهور إذا جاز الحدود خفا *** كذلك الأمر فانظر فيه وافتكر\n\n\n### [أن الايمان له نور يكشف به ما وقع الإخبار به‏]\n\n\nاعلم أيها الولي الحميم نور الله بصيرتك أن العلم بالجزاء عن نور الايمان لا عن نور العقل فإن ارتباط الجزاء بالأعمال في الدنيا والآخرة لا يعلم إلا من طريق الايمان والكشف فأما تسميتنا إياه علما أعني علم الايمان وإن كان عين التصديق بخبر المخبر فمثل هذا لا يكون علما لزواله لو رجع المخبر عنه تقديرا وحينئذ فله وجهان الواحد أن المؤمن يجده ضرورة في نفسه لو رام الانفكاك عنه لم يقدر على ذلك فهو عنده من العلوم الضرورية عند كل عقل عنده الايمان والوجه الآخر أن الايمان له نور يكشف به ما وقع الإخبار به كما يكشف المدلول العقل بالنظر الصحيح في الدليل الشاد بل أكمل لأن العقل إن لم يستند في دليله وبرهانه إلى العلوم الضرورية في ذلك وإلا فليس ببرهان عنده ولا هو علم وعلم الايمان علم ضروري وهو مستند العقل في الحق المطلوب فالإنسان إذا سئل عن الجزاء من جهة علمه النظري لم يقل إنه جزاء وإنما اقتضت الحركة الفلكية وجود هذه الواقعة في عالم الكون والفساد بحسب القابل لها منه واتفق أيضا أنه كان قبل ذلك حركة أخرى اقتضت لهذا القابل من عالم الكون والفساد وجود أمر ما ظهر منه فنوسب بين الواقعتين الأولى والثانية بأمر عرضي أو أمر وضعي مقرر في نفوس العامة فسموا الواقعة الآخرة جزاء للواقعة الأولى لمن قامت به ليس غير ذلك فما يدرك تلك الرابطة إلا أهل الكشف الإلهي وإن أدركها أهل النظر العقلي لأنه قد يدرك الرابطة من كونها فعلا لا من كونها جزاء ولا سبيل إلى رفع ذلك جملة واحدة وأهل الكلام من علماء النظر يجوزون رفعها بنور عقولهم وصدقوا فإن نور العقل لا يتعدى قوته فيما يعطيه ونور الايمان فوق ذلك يعطي أيضا بحسب قوته وما جعل الله فيه مما لا يدركه العقل معرى عن الشرط فإن العقل يقول إن كان سبق العلم به فلا بد منه عقلا فأدخل الشرط والايمان ليس كذلك فإنه عن كشف محقق لا مرية فيه ثم إن طائفة من العقلاء الذين ذكرناهم وهي التي أثبتت الفعل ولم تصدق أنه جزاء أنكروا ذلك دنيا وآخرة فأما دنيا فلما ذكرناه وأما آخرة فانقسموا في ذلك قسمين فطائفة منهم أثبتوا الآخرة على وجه يخالف وجه الايمان وهم الذين أنكروا الإعادة في الأجسام الطبيعية وطائفة نفت الآخرة جملة واحدة فأحرى الجزاء فأما الطائفة التي أثبتت الآخرة وأنكرت الجزاء فما أنكرت إلا الجزاء الحسي من نعيم الجنان وجعلت الجزاء الروحاني كون الأرواح لما فارقت تدبير أجسادها وتخلصت من أسر الطبيعة وكانت في هذه المدة قد اكتسبت من الأخلاق الكريمة والعلوم الإلهية والروحانية هيأة حسنة ألحقتها بالرتبة الملكية فلما انفصلت عن الطبيعة انفصالا يسمى الموت التحقت بالملائكة ودام لها ذلك مؤبدا فكان ذلك الدوام لها في هذه الرتبة الملكية ثمرة جنتها مما حصلته في حال سجنها في تدبير جسمها الطبيعي فذلك المسمى جزاء في الشرع وما ثم غيره وأهل الايمان بالله وما جاء من عنده وهم أصحابنا وأهل الكشف منا أيضا الذين عملوا بنور الايمان قد جمعنا مع هؤلاء فيما ذكروه من الجزاء الروحاني للنفوس التعليمية وانفردنا عنهم بالإعادة في الأجسام الطبيعية على مزاج مخصوص يقتضي لها البقاء في دار الكرامة والجزاء الحسي من اللباس والزينة والأكل والشرب والنكاح ورفع الخبائث من منزل الجنان كالأمور المستقذرة طبعا والأرواح النتنة طبعا وذلك في حال السعداء وأما في حال الأشقياء فالإعادة أيضا لهم في الأجساد الطبيعية ولكن على مزاج يقارب مزاج الدنيا في الذهاب والزوال بالعلل المنضجة للجلود المذهبة لأعيانها وإيجاد غيرها مع بقاء العين المعذبة بذلك فليست تشبه إعادة الأشقياء إعادة السعداء وإن اشتركا في الإعادة فمرض الأشقياء في دار الشقاء زمانة مؤبدة إلى غير نهاية مدة أعمارهم التي لا انقضاء لها كالزمانة التي كانت للزمني في الدنيا مدة أعمارهم وتعلم كل طائفة من هؤلاء أن بعض الذي هم فيه جَزاءً بِما كانُوا يَعْمَلُونَ وإنما قلنا بالبعض لأن الجنان ثلاث جنة جزاء العمل وجنة ميراث وهي التي كان يستحقها المشرك لو آمن وجنة اختصاص غير هاتين ولا أدري جنة الاختصاص هل تعم أم هي لخصائص من عباد الله والذين ما عملوا خيرا قط مشروعا فلهم جنة الميراث ولا أدري هل لهم جنة اختصاص أم لا كما قلنا وأما جنة الأعمال‏\nالمشروعة من كونها مشروعة لا من كونها موجودة فليس لهم فيها نصيب فإنهم قد يكون منهم من فيه مكارم الأخلاق ولكن لم يعمل بها من كونها مشروعة فإذا تقرر ما ذكرناه‏\n\n\n### [الذين لم يؤمنوا بعلم الجزاء يحرمون من العلم الوهبي‏]\n\n\nفاعلم أن الطائفة التي لم يحصل لها الايمان بعلم الجزاء يحرمون من العلوم الموهوبة قبول كل علم لا يقوم لهم فيه من نفوسهم ميزان من عمل عملوه فإذا جاءهم الفتح في خلواتهم وسطعت عليهم الأنوار الإلهية بالعلوم المقدسة عن الشوب القادح ينظرون ما كانوا عليه من الأعمال وما كانوا عليه من الاستعداد التعملي فيأخذون من تلك العلوم قدر ما أعطتهم موازينهم ويقولون هذا من عِنْدِ الله وما لم يدخل لهم في موازينهم من هذه العلوم دفعوا بها وهذا من أعجب الأمور الإلهية في حق هذه الطائفة أنها غير قائلة بعلم الجزاء ولا تأخذ من العلوم إلا ما أعطتها موازينهم من الأعمال والاستعدادات التعملية وهذا نقيض ما بنى عليه الأمر عند أهل الطريق وهذا كشف خاص خص به أمثالنا لله الحمد على ذلك وأما نحن ومن جرى مجرانا من أهل الطريق فلا نرمي بشي‏ء مما يرد علينا من ذلك ولا ندفع به جملة واحدة سواء اقتضاه عملنا واستعدادنا التعملي أو لم يقتضه فإن الاقتضاء غير لازم عندنا في كل شي‏ء بل أوجد الله ما يريد في أي محل يريد ولو نور الله بصائر هذه الطائفة التي ذكرناها لرأت واتعظت بحالها فإنها لا تصدق بالجزاء ولا تقبل من العلوم إلا ما أعطاه ميزان الجزاء من نفوسهم وهم لا يشعرون وهو موضع حيرة كما إنا لا نرمي أيضا بشي‏ء مما أعطانا الله على يد واسطة مذمومة كانت تلك الواسطة أو محمودة كما فعل سليمان عليه السلام أو بارتفاع الوسائط سواء كان ذلك منهيا عنه أو مأمورا به فإن الله قد أعطانا من القوة وعلم السياسة بحيث نعلم كيف نأخذ وإذا أخذنا كيف نتصرف به وفيه وفي أي محل نتصرف به وهذا مخصوص بأهل السماع من الحق دائما وهو طريقنا وعليه عمل أكابرنا ويحتاج إلى علم وافر وعقل حاضر ومشاهدة دائمة وعين لا تقبل النوم ولا تعرفه وتتحقق بذلك تحقيقا يسرى معها حسا وفي حال نومها خيالا وفي حال فنائها وغيبتها تحققا وهو مقام عزيز مخصوص بالإفراد منا وعلم الأنبياء أكثره من هذه العلوم التي ليس لها مستند ولهذا كانت النبوة اختصاصا من الله لا يعمل ولا بتعمل ونحن ورثنا هذا المقام من عين المنة فحصلنا من العلوم التي لا مستند لها يطلبها ما عدا النبوة كثيرا تعرفها أسرارنا دون نفوسنا فلذلك لا يظهر علينا منها شي‏ء فإنه لا تعلق لها بالكون قال تعالى أَ لَمْ يَجِدْكَ يَتِيماً فَآوى‏ ووَجَدَكَ ضَالًّا فَهَدى‏ ووَجَدَكَ عائِلًا فَأَغْنى‏ فاختلف أصحابنا في هذه الأحوال الثلاثة وما يشبهها هل هي استعدادات لما حصل من الإيواء والهدى والغني أم ليست استعدادا ومنا من قال لا يكون استعداد إلا عن تعمل فيه وهم الأكثرون ومنهم من قال الاستعداد من أهل لتحصيل أمر ما سواء كان عن تعمل أو غير تعمل فالخلاف لفظي وهو الخلاف الذي ينسب إلى أهل هذه الطريقة وقد يكون الاستعداد معلوما للشخص الذي هو صاحبه إنه استعداد وقد لا يكون والتحقيق في ذلك ما نذكره وذلك أن حقيقة الاستعداد ما هو الطلب أن يكون معد الأمر ما عظيم من الله يحصل له فهذا يسمى تعملا لأنه استفعال مثل استخراج واستطلاق واسترسال وأما كونه معدا لما حصل له فلا بد أن يكون في نفسه على ذلك لا بجعل جاعل وأخفاه العدم الممكن والعدم المحال فلو لا إن العدم الممكن هو معد في نفسه لقبول أثر المرجح ما كان له الترجيح إلى أحد الجانبين في وقت وترجيح الجانب الآخر في وقت آخر والعدم المحال لو لا ما هو في نفسه معد لعدم قبول ما يضاد ما هو عليه في نفسه لقبله وكذلك من ثبت له الوجوب الوجودي لذاته فهذا تحقيق المسألة في الاستعداد والفرق بينه وبين الإعداد والإعداد لا بد منه وجودي وعدمي ولا وجودي ولا عدمي كالنسب فهذا الفصل من هذا المنزل قد استوفيناه وبقي من فصوله ما نذكره وذلك معرفة العلم الذي يطلبه الفقير بافتقاره ومسكنته ما هو وإذا حصل هل يقع له به الغني أم لا وهل إلى ذلك طريقة معلومة لقوم أم لا وهل العالمون بها يتعين عليهم إن يحرضوا الناس على سلوكها أم لا\n\n\n### [الافتقار في كل ما سوى الله أمر ذاتي‏]\n\n\nفاعلم إن الافتقار في كل ما سوى الله أمر ذاتي لا يمكن الانفكاك عنه ذوقا وعلما صحيحا إلا أنه تختلف مقاصده في تعيين ما يفتقر إليه هذا الفقير وما هو المعنى الذي يفتقر إليه فيه‏\n\n\n### [إن الفقر والمسكنة صفة ذاتية]\n\n\nفاعلم إن الفقر والمسكنة لما ثبت في العلم أنها صفة ذاتية كان متعلقها الذي افتقرت فيه طلبها استمرار كونها واستمرار النعيم لها على أكمل الوجوه بحيث إنه لا يتخلله النقيض فأهل هذه الطريقة لم يروا ذلك حالا وعقدا إلا من الله تعالى فافتقروا إليه في ذلك دون غيره سبحانه‏\nولا يصح الافتقار لهم إليه في وجودهم لأنهم موجودون وإنما كان ذلك الافتقار منهم لوجودهم في حال عدمهم فلهذا أوجدهم فمتعلق الافتقار أبدا إنما هو العدم ليوجده لهم إذ بيده إيجاد ذلك وأما غيرنا فرأوا ذلك من الله عقدا لا حالا وهم المسلمون الأكثرون عالمهم وجاهلهم ومن الناس من يرى ذلك من الله أصلا لا عقدا ولا حالا وهم القائلون بالعلل والمعلولات وهم أبعد الطوائف من الله ومن الناس من لا يرى ذلك من الله لا أصلا ولا عقدا ولا حالا وهم المعطلة وما من طائفة مما ذكرنا إلا وتجد الافتقار من ذاتها ومن المحال أن يقع الغني من الله لأحد من هؤلاء الطوائف على الإطلاق أبدا ولكن قد يقع لهم الغني المقيد دائما لا ينفكون عنه وأما فرض الطريق إليه فهو ذاتي أيضا من حيث هو طريق وإنما الذي يتعلق به الاكتساب سلوك خاص في هذا الطريق لمن يفتقر إليه وإذا كان السلوك بهذه المثابة تعين التحريض عليه وتبيينه لمن جهله فمن عدل عن تبيينه لمن يستحقه وهو عالم به فهو صاحب حرمان وخذلان وقد نبه عليه السلام على مرتبة من مراتب ذلك‏\n\n\nبقوله صلى الله عليه وسلم من سئل عن علم فكتمه ألجمه الله بلجام من نار\n\n\nوالسؤال قد يكون لفظا وحالا والمسئول عنه الذي تعلق به الوعيد لا بد أن يكون واجبا عليه السؤال عنه فلا بد أن يجب على العالم الجواب عنه وسؤالات الافتقار كلها بهذه المثابة قال الله تعالى يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله ففي هذا الخطاب تسمية الله بكل اسم هو لمن يفتقر إليه فيما يفتقر إليه فيه وهو من باب الغيرة الإلهية حتى لا يفتقر إلى غيره والشرف فيه إلى العالم بذلك وفي هذا الخطاب هجاء للناس حيث لم يعرفوا ذلك إلا بعد التعريف الإلهي في الخطاب الشرعي على ألسنة الرسل عليهم السلام ومع هذا أنكر ذلك خلق كثير وخصوه بأمور معينة يفتقر إليه فيها لا في كل الأمور من اللوازم التابعة للوجود التي تعرض مع الآنات للخلق وكان ينبغي لنا لو كنا متحققين بفهم هذه الآية أن نبكي بدل الدموع دما حيث جهلنا هذا الأمر من نفوسنا إلى أن وقع به التعريف الإلهي فكيف حال من أنكره وتأوله وخصصه فهذا قد بينا نبذة من الفصل الثاني المتعلق بهذا المنزل وأما الفصل الثالث من فصول هذا المنزل فاعلم إن الله تعالى قد عرف عباده أن له حضرات معينة لأمور دعاهم إلى طلب دخولها وتحصيلها منه وجعلهم فقراء إليها فمن الناس من قبلها ومن الناس من ردها جهلا بها فمنها حضرة المشاهدة وهي على منازل مختلفة وإن عمتها حضرة واحدة فمنهم من يشهده في الأشياء ومنهم قبلها ومنهم بعدها ومنهم معها ومنهم من يشهده عينها على اختلاف مقامات كثيرة فيها يعلمها أهل طريق الله أصحاب الذوق والشرب ومنها حضرة المكالمة ومنها حضرة الكلام ومنها حضرة السماع ومنها حضرة التعليم ومنها حضرة التكوين وغير ذلك فإنها كثيرة لا يتسع هذا التصنيف لذكرها فحضرة المكالمة من خصائص هذا المنزل فمن عدل عنها فقد حرم ما يتضمنه من المعارف الإلهية والالتذاذ بالمحادثة الربانية وكان ممن قيل فيه ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ ومن الرَّحْمنِ على حسب التجلي مُحْدَثٍ إِلَّا كانُوا عَنْهُ مُعْرِضِينَ وهي طائفة معينة وأخرى اسْتَمَعُوهُ وهُمْ يَلْعَبُونَ فأهل طريقنا لم يشتغلوا عند ورود هذا الكلام بما يلهيهم عما يتضمنه من الفوائد فإن اقتضى جوابا أجابوا ربهم وإن اقتضى غير ذلك بادروا إلى فعل ما يقتضيه ذلك الخطاب وهم يسارقون النظر في تلك الحالة إلى المتكلم لتقر أعينهم بذلك كما تنعمت نفوسهم من حيث السماع غير أنهم لا يتحققون بالنظر في هذه الحال لمعرفتهم بأن مراد الحق فيهم فيها الفهم عنه فيما يكلمهم به فيخافون من النظر مع شوقهم أن يفنيهم عن الذي طولبوا به من الفهم فيكونون ممن آثروا حظوظ نفوسهم على ما أراده الحق منهم فهم في كلا الحالين عبيد فقراء غير أن الأدب في كل حضرة من هذه الحضرات الوفاء بما تستحقه الحضرة التي يقام العبد فيها ولمطلوبه حضرة أخرى هي غير هذه فلا يستعجل فيحرم وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ أَوْ يُرْسِلَ رَسُولًا ينوب عنه في الكلام وهو الترجمان قال تعالى فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله يريد على لسان الترجمان الذي هو رسول الله صلى الله عليه وسلم فسمعت بعض الشيوخ يقول ما دام في بشريته فالكلام له من وراء حجاب ولكن إذا خرج عن بشريته ارتفع الحجاب وهذا الشيخ هو عبد العزيز بن أبي بكر المهدوي المعروف بابن الكرة سمعته منه بمنزلة بتونس رحمه الله فأصاب فيه وأخطأ فأما إصابته فإثباته وتقريره للكلام من وراء الحجاب وإنه لم يجمع بينه وبين‏\nالمشاهدة وأما خطؤه فقوله ارتفع الحجاب ولم يقيد وإنما يقال ارتفع حجاب بشريته ولا شك أن خلف حجاب بشريته حجبا أخر فقد يرتفع حجاب البشرية ويقع الكلام من الله لهذا العبد خلف حجاب آخر أعلاها من الحجب وأقربها إلى الله وأبعدها من المخلوق المظاهر الإلهية التي يقع فيها التجلي إذا كانت محدودة معتادة المشاهدة كظهور الملك في صورة رجل فيكلمه على الاعتدال للعادة والحد وقد تجلى له وقد سد الأفق فغشي عليه لعدم المعتاد وإن وجد الحد فكيف بمن لم ير حدا ولا اعتاد فقد تكون المظاهر غير محدودة ولا معتادة وقد تكون محدودة لا معتادة وقد تكون محدودة معتادة وتختلف أحوال المشاهدين في كل حضرة منها فمن عدل عن حضرة المكالمة فقد لحق بأهل الخسران وإن سعد ولكن بعد شقاء عظيم وإن من الناس من أصحاب الدعاوي في هذه الطريقة الذين قال الله فيهم وقَدْ خابَ من دَسَّاها حين أَفْلَحَ من زَكَّاها فيزعمون أنهم يكلمون الله في خلقه ويسمعون منه في خلقه وهو في نفسه مع نفسه ما عنده خبر من ربه لأنه لا يعرفه ولا يعرف كيف يسمع منه ولا ما يسمع منه فأصحاب الدعاوي في هذه الطريقة كالمنافقين في المسلمين فإنهم شاركوهم في الصورة الظاهرة وبانوا بالبواطن فهم معهم لا معه فَوَيْلٌ لِلَّذِينَ يَكْتُبُونَ الْكِتابَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هذا من عِنْدِ الله وهو والله من عنده ولكن من غير الوجه الذي يزعمون ولهذا شقوا بما قالوه وإن كانوا لا يعتقدونه وسعد الآخر بقوله إنه من عند الله واعتقاده ذلك على غير الوجه الذي يعطي الشقاء فالقول واحد والحكم مختلف فسبحان من أخفى علمه عن قوم وأطلع عليه آخرين لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ ولا يكون الأمر إلا هكذا فإنه هكذا وقع ولا يقع إلا ما علم أنه يقع كذا فإنه في نفس الأمر كذا لا يجوز خلافه وهنا عقدة لا يحلها إلا الكشف الاختصاصي لا تحلها العبارة وإذا فهمت هذا\n\n\n### [التعاون على البر والتقوى‏]\n\n\nفاعلم أنه من آخر فصول هذا المنزل التعاون عَلَى الْبِرِّ والتَّقْوى‏ فإنه يكون عنه علم شريف يتعلق بمعرفة الأسباب الموضوعة في العالم وإن رفعها عينا لا يصح إذا كان السبب علة فإن لم يكن علة فقد يصح رفع عينه مع بقاء لازمه لكن لا من حيث هو لازم له بل من حيث عين اللازم فهو لما هو لازم له على الطريقة المختصة لا يرتفع وهو من حيث عينه وإن كان لازما لغيره فيكون أثره لعينه فيوجد حكمه لعينه ففي الأسباب التي ترفع ويوجد اللازم يفعل لعينه كالغذاء المعتاد على الطريقة المختصة به يلازمه الشبع بالأكل منه وقد يكون الشبع من غير غذاء ولا أكل ومثل السبب العلي وجود اتصاف الذات بكونها شابعة لوجود الشبع فلو رفعت الشبع ارتفع كونه شابعا فمن الأسباب ما يصح رفعها وما لا يصح وتقرير الكل في مكانه وعلى حده على ما قرره واضعه هو الأولى بالأكابر وينفصلون عن العامة بالاعتماد فلا اعتماد للأكابر في شي‏ء من الأشياء إذا وصفوا بالاعتماد إلا على الله فمن منع وجود الأسباب فقد منع ما قرر الحق وجوده فيلحق به الذم عند الطائفة العالية وهو نقص في المقام كمال في الحال محمود في السلوك مذموم في الغاية والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 277: Concerning the Knowledge of the Station of Denial and Avarice and its Secrets from the Mosaic Station\n\nKnowledge is of two kinds: the knowledge of religion in the forms\nManifested from the spirits in humanity.\n\nAnd the knowledge of the Real (علم حق), confirmed by verification, is supported by\nWhat Allah has deposited in the signs (آيات) and chapters (سور).\n\nFrom every beholder with a fresh eye,\nSo the *Lām* beholds with the *Fāʾ* in the report.\n\nThese are stations of septenary lights,\nFive of which hide beneath the sun and the moon.\n\nFrom them, what is wondrous in the Unseen (الغيب) is made manifest,\nFor every station strives according to its measure.\n\nIndeed, the Attributes (الصفات) brought by the Book\nAre sanctified beyond the scope of the Intellect (العقل) and thought (الفكر).\n\nAnd how can he who takes knowledge from sensation and speculation\nComprehend Him Whom nothing resembles?\n\nThus, Knowledge (العلم) of Allah is the very essence of ignorance concerning Him,\nAnd ignorance of Allah is the very essence of Knowledge (العلم), so reflect.\n\nAnd there is no known thing in the Cosmos (الكون) other than Him, so what\nDo you say, O you who are overwhelmed beyond enumeration?\n\nIndeed, manifestation, when it exceeds limits, becomes hidden;\nSuch is the matter, so look into it and reflect.\n\n### That Faith has a light by which what has been reported is unveiled\n\nKnow, O intimate friend (ولي حميم)—may Allah illuminate your insight—that the Knowledge (العلم) of Recompense (الجزاء) comes from the light of Faith (الإيمان), not from the light of the Intellect (العقل). For the connection of Recompense to deeds in this world and the Hereafter is known only through the path of Faith and Unveiling (الكشف). As for our naming it \"Knowledge\"—meaning the knowledge of Faith—even though it is the very essence of affirming the report of the Reporter, such a thing would not be knowledge if the reported matter were hypothetically reversed, as it would vanish.\n\nTherefore, it has two aspects: First, the believer finds it as a necessity within himself; if he sought to detach himself from it, he would be unable to do so. Thus, it is among the necessary sciences (العلوم الضرورية) for every intellect that possesses Faith. The second aspect is that Faith has a light by which what has been reported is unveiled, just as the rational indication is unveiled by sound contemplation of the supporting proof—indeed, it is more complete. This is because if the Intellect does not rely in its proof and demonstration upon the necessary sciences in that matter, then it is neither a demonstration nor knowledge in its view. The knowledge of Faith, however, is a necessary science (علم ضروري), and it is the Intellect's foundation concerning the sought-after Truth (الحق).\n\nIf a person is asked about Recompense from the perspective of his speculative knowledge (علمه النظري), he would not say that it is Recompense. Rather, he would say that the celestial movement necessitated the existence of this event in the world of generation and corruption (عالم الكون والفساد) according to the recipient's capacity within it. It also happened that a previous movement necessitated the existence of a certain matter for this recipient in the world of generation and corruption, from which the event manifested. A relationship was then established between the first and second events by an accidental matter or a conventional matter established in the minds of the common people, so they called the latter event a Recompense for the former event for the one who performed it, and nothing more.\n\nOnly the people of Divine Unveiling (الكشف الإلهي) truly grasp that connection, even if the people of rational speculation (النظر العقلي) grasp it, because they may grasp the connection as an *act* (فعل) but not as *recompense* (جزاء). There is no way to entirely dismiss this. The theologians (أهل الكلام) among the speculative scholars permit the removal of this connection by the light of their intellects, and they are truthful, for the light of the Intellect does not exceed the power of what it grants. But the light of Faith is above that; it also grants according to its power and what Allah has placed within it, which the Intellect cannot grasp without condition. For the Intellect says: \"If prior Knowledge (العلم) preceded it, then it must necessarily occur rationally,\" thus introducing a condition. Faith is not like that, for it arises from verified Unveiling (كشف محقق) about which there is no doubt.\n\nFurthermore, a faction of the rationalists we mentioned—the one that affirmed the act but did not affirm that it was Recompense—denied this both in this world and the Hereafter. As for this world, it is for the reason we mentioned. As for the Hereafter, they divided into two groups: one group affirmed the Hereafter in a manner that contradicts the way of Faith, and these are the ones who denied the return in natural bodies (الإعادة في الأجسام الطبيعية). The other group denied the Hereafter entirely, and thus, Recompense is even more unlikely for them.\n\nAs for the group that affirmed the Hereafter but denied Recompense, they only denied the sensory Recompense (الجزاء الحسي) of the bliss of the Gardens (الجنان). They made the spiritual Recompense (الجزاء الروحاني) the state of the souls when they departed the governance of their bodies and were freed from the bondage of nature. If, during that period, they had acquired noble character and Divine and spiritual sciences (العلوم الإلهية والروحانية), they attained a good disposition that joined them to the angelic rank (الرتبة الملكية). When they separated from nature—a separation called death—they joined the angels, and that state endured for them eternally. This permanence in the angelic rank was the fruit they harvested from what they acquired during their imprisonment in the governance of their natural body. This is what is called Recompense in the Sacred Law (الشرع), and there is nothing else there [in their view].\n\nThe people of Faith in Allah and what came from Him—who are our companions and the people of Unveiling (أهل الكشف) among us who acted by the light of Faith—we agree with these philosophers regarding the spiritual Recompense for the learned souls. However, we differ from them regarding the return in natural bodies (الأجساد الطبيعية) upon a specific temperament (مزاج مخصوص) that necessitates their subsistence (البقاء) in the Abode of Generosity (دار الكرامة), and the sensory Recompense, including clothing, adornment, eating, drinking, marriage, and the removal of impurities from the station of the Gardens, such as things naturally repulsive and naturally foul odors. This is the state of the felicitous (السعداء).\n\nAs for the state of the wretched (الأشقياء), they are also returned to natural bodies, but upon a temperament that resembles the temperament of this world in decay and dissolution due to ailments that ripen the skins and cause their essences (أعيانها) to vanish, while creating others, yet the essence being tormented remains. Thus, the return of the wretched does not resemble the return of the felicitous, even though they share in the return. The illness of the wretched in the Abode of Wretchedness is an eternal infirmity (زمانة مؤبدة) without end, like the infirmity that afflicted the chronically ill in this world during the span of their lives.\n\nEvery group among these knows that some of what they are in is <<جَزاءً بِما كانُوا يَعْمَلُونَ>> (a recompense for what they used to do). We only said \"some\" because the Gardens are three: the Garden of Recompense for deeds, the Garden of Inheritance (which the polytheist would have deserved had he believed), and the Garden of Special Favor (جنة اختصاص), which is distinct from the other two. I do not know if the Garden of Special Favor is general or reserved for the elite among Allah’s servants. Those who never performed any prescribed good deed whatsoever have the Garden of Inheritance, and I do not know if they have the Garden of Special Favor or not, as we said. As for the Garden of prescribed deeds—by virtue of their being prescribed, not by virtue of their existence—they have no share in it. For some of them may possess noble character, but they did not act upon it by virtue of its being prescribed.\n\nIf what we have mentioned is established,\n\n### Those who do not believe in the knowledge of Recompense are deprived of Gifted Knowledge\n\nKnow that the group which has not attained Faith (الإيمان) in the knowledge of Recompense (علم الجزاء) is deprived of Gifted Knowledge (العلوم الموهوبة)—the acceptance of any knowledge for which they do not possess a balance (ميزان) within their souls derived from a deed they performed. When the spiritual opening (الفتح) comes to them in their retreats, and the Divine Lights shine upon them with sacred knowledge free from damaging impurity, they look at the deeds they performed and the acquired preparedness (الاستعداد التعملي) they possessed. They take from that knowledge only what their balances grant them, saying, \"This is from Allah.\" But they reject whatever of this knowledge does not enter their balances. This is one of the most wondrous Divine matters concerning this group: they do not affirm the knowledge of Recompense, yet they only accept knowledge that their balance of deeds and acquired preparedness grants them. This contradicts the foundation upon which the matter is built among the people of the Path (أهل الطريق).\n\nThis is a special unveiling (كشف خاص) granted specifically to people like us. Praise be to Allah for that. As for us and those who follow our path, we do not reject anything that comes to us from that, nor do we push it away entirely, whether it was necessitated by our deeds and acquired preparedness or not. For necessity (الاقتضاء) is not binding upon us in everything; rather, Allah brings into existence what He wills in any locus He wills.\n\nIf Allah were to illuminate the insights of this group we mentioned, they would see and take heed of their own condition, for they do not affirm Recompense, yet they accept only the knowledge granted by the balance of Recompense from their own souls, without realizing it. This is a source of confusion.\n\nSimilarly, we do not reject anything that Allah grants us through a mediator (واسطة), whether that mediator is blameworthy or praiseworthy, as Solomon (Sulayman), peace be upon him, did, or by the removal of mediators entirely, whether that is forbidden or commanded. For Allah has granted us such strength and knowledge of governance that we know how to take, and once taken, how to dispose of it and where to dispose of it. This is specific to the people who constantly hear from the Real (أهل السماع من الحق), and it is our path, upon which our elders acted. It requires abundant knowledge, a present intellect, constant witnessing (مشاهدة دائمة), and an eye that neither accepts nor knows sleep, realizing this realization (تحقيقاً) sensually, imaginatively (خيالاً) during sleep, and through verification during their annihilation (فنائها) and absence (غيبتها). It is a precious station (مقام عزيز) specific to the Solitaries (الإفراد) among us.\n\nMost of the knowledge of the Prophets is from these sciences that have no foundation (مستند) [in acquired effort]. This is why Prophethood is a special favor (اختصاص) from Allah; it is neither earned nor acquired. We inherited this station from the very essence of Divine Favor (عين المنة), so we attained much knowledge that has no foundation sought by acquisition, apart from Prophethood. Our secrets know this knowledge, but our souls do not, which is why nothing of it appears upon us, for it has no connection to the Cosmos (الكون).\n\nAllah the Exalted said: <<أَ لَمْ يَجِدْكَ يَتِيماً فَآوى‏ ووَجَدَكَ ضَالًّا فَهَدى‏ ووَجَدَكَ عائِلًا فَأَغْنى‏>> (Did He not find you an orphan and shelter you? And He found you astray and guided you? And He found you needy and enriched you?). Our companions differed regarding these three states and similar ones: Are they preparedness (استعدادات) for the shelter, guidance, and enrichment that occurred, or are they not preparedness? Some of us said that preparedness only comes from acquired effort (تعمل), and they are the majority. Others said that preparedness is the inherent capacity of a thing to attain a certain matter, whether through acquired effort or not. Thus, the disagreement is merely verbal, which is the type of disagreement attributed to the people of this path.\n\nPreparedness may be known to the person who possesses it as preparedness, or it may not. The verification of this is what we shall mention: The reality of preparedness (حقيقة الاستعداد) is the seeking to be made ready for a great matter from Allah that will be attained by him. This is called acquired effort (تعمل) because it is a seeking of action, like seeking extraction (استخراج) or seeking release (استطلاق). As for his being inherently ready for what he attained, this must be within his essence (في نفسه), not by the making of a maker, and it was concealed by possible non-existence (العدم الممكن) and impossible non-existence (العدم المحال). If possible non-existence were not inherently ready to accept the effect of the determinant (المرجح), it would not have been determined toward one side at one time and the other side at another time. And if impossible non-existence were not inherently ready to reject what contradicts its own essence, it would accept it. Likewise, for the one for whom necessary Being (الوجودي) is established by his Essence (لذاته). This is the verification of the issue of preparedness (الاستعداد) and the difference between it and making ready (الإعداد). Making ready is necessary, whether existential, non-existential, or neither existential nor non-existential, like relations (النسب).\n\nWe have completed this section of this station. What remains of its sections is the knowledge of what knowledge the poor one (الفقير) seeks through his neediness (افتقاره) and destitution (مسكنته), and whether, once attained, it leads to enrichment (الغني) for him or not, and whether there is a known path to it for some people or not, and whether those who know it are obliged to urge people to follow it or not.\n\n### Neediness in everything other than Allah is an essential matter\n\nKnow that Neediness (الافتقار) in everything other than Allah is an essential matter (أمر ذاتي) from which separation is impossible, whether through direct experience (ذوقاً) or sound knowledge, although its objectives differ in specifying what this poor one is needy of and what is the meaning in which he is needy.\n\n### Poverty and Destitution are essential attributes\n\nKnow that since poverty (الفقر) and destitution (المسكنة) are established in Knowledge (العلم) as essential attributes (صفة ذاتية), their object of neediness is their seeking the continuation of their Being (استمرار كونها) and the continuation of bliss (النعيم) for them in the most complete manner, such that no opposite intervenes. The people of this path (أهل هذه الطريقة) have not seen this achieved, whether as a state (حالاً) or a conviction (عقداً), except through Allah the Exalted. Thus, they are needy of Him in this regard, to the exclusion of all others, glory be to Him.\n\nIt is not correct for them to be needy of Him for their existence now, because they already exist. Rather, that neediness was for their existence during their state of non-existence (عدمهم), which is why He brought them into existence. Thus, the object of neediness is always non-existence, so that He may bring it into existence for them, since the power to bring that into existence is in His Hand.\n\nAs for others, they saw this coming from Allah as a conviction but not a state, and these are the majority of Muslims, both learned and ignorant. Among people are those who see this coming from Allah as a principle (أصلاً), but neither a conviction nor a state, and these are the causalists (القائلون بالعلل والمعلولات), who are the farthest groups from Allah. And among people are those who do not see this coming from Allah at all—neither as a principle, a conviction, nor a state—and these are the deniers (المعطلة).\n\nThere is no group among those we mentioned that does not find neediness arising from its own essence (ذاتها). It is impossible for absolute enrichment (الغني المطلق) from Allah to occur for any of these groups eternally. However, restricted enrichment (الغني المقيد) may occur for them constantly, from which they never separate.\n\nAs for the فرض (imposition) of the path to it, it is also essential (ذاتي) insofar as it is a path. What relates to acquisition is a specific conduct (سلوك خاص) within this path for the one who is needy of it. If the conduct is of this nature, then urging others toward it and clarifying it for those who are ignorant of it becomes mandatory. Whoever refrains from clarifying it to one who deserves it, while knowing it, is one who suffers deprivation and abandonment.\n\nThe Prophet, peace and blessings be upon him, drew attention to one of the degrees of this when he said:\n\"Whoever is asked about knowledge and conceals it, Allah will bridle him with a bridle of fire.\"\n\nThe asking may be verbal or by state (حالاً). The matter asked about, to which the threat is attached, must be something that is obligatory for the asker to ask about, and thus, it must be obligatory for the knower to answer. All questions arising from neediness (سؤالات الافتقار) are of this nature.\n\nAllah the Exalted said: <<يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله>> (O humanity, you are the needy ones toward Allah). In this address, Allah names everything that belongs to the one who is needy of Him in the matter in which he is needy. This is from the category of Divine Jealousy (الغيرة الإلهية), so that one does not become needy of other than Him. The honor in this belongs to the one who knows it. In this address, there is a censure of humanity for not knowing this until the Divine definition occurred in the legal address (الخطاب الشرعي) upon the tongues of the Messengers, peace be upon them. Despite this, many people denied it, restricting it to specific matters in which one is needy of Him, but not in all matters of the necessary consequences (اللوازم) that follow existence and occur with moments for creation.\n\nIt would be fitting for us, if we truly understood this verse, to weep blood instead of tears, since we were ignorant of this matter concerning our own souls until the Divine definition occurred. What, then, is the state of one who denies it, interprets it figuratively, and restricts it?\n\nWe have thus clarified a summary of the second section related to this station. As for the third section of this station, know that Allah the Exalted has made known to His servants that He has specific Presences (حضرات معينة) for matters which He has called them to seek entry into and attainment of from Him, making them needy of them. Some people accepted them, and some rejected them out of ignorance.\n\nAmong these is the Presence of Witnessing (حضرة المشاهدة), which has different degrees, even though one Presence encompasses them all. Some witness Him in things, some before them, some after them, and some with them. Some witness Him as the very essence of things, according to many different stations within it, known only to the people of Allah’s path, the people of direct experience (الذوق) and spiritual drinking (الشرب).\n\nAmong them are the Presence of Conversation (حضرة المكالمة), the Presence of Speech (حضرة الكلام), the Presence of Hearing (حضرة السماع), the Presence of Teaching (حضرة التعليم), and the Presence of Origination (حضرة التكوين), and others, for they are numerous and this composition is not spacious enough to mention them all.\n\nThe Presence of Conversation (حضرة المكالمة) is specific to this station. Whoever turns away from it is deprived of the Divine Gnosis (المعارف الإلهية) it contains and the delight of the Lordly discourse (المحادثة الربانية). Such a person is among those concerning whom it was said: <<مَا يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ>> (No reminder comes to them from their Lord)—and from the All-Merciful (الرَّحْمنِ) according to the Theophany (التجلي)—<<مُحْدَثٍ إِلَّا كَانُوا عَنْهُ مُعْرِضِينَ>> (as a novelty, but they turn away from it). This is one specific group. Another group <<اسْتَمَعُوهُ وهُمْ يَلْعَبُونَ>> (listened to it while they were playing).\n\nThe people of our path, when this Speech arrives, do not occupy themselves with what distracts them from the benefits it contains. If it requires a response, they respond to their Lord. If it requires something else, they hasten to perform what that address necessitates. In that state, they steal glances at the Speaker so that their eyes may be comforted by it, just as their souls are delighted by the hearing. However, they do not fully realize the gazing in this state, due to their knowledge that the intention of the Real (الحق) for them in it is to understand what He speaks to them. They fear that gazing, despite their longing, might annihilate them from what they were commanded to understand, thus making them among those who preferred the fortunes of their souls over what the Real desired from them. In both states, they are poor servants. However, the proper etiquette in each of these Presences is to fulfill what the Presence in which the servant is established requires. If his objective is another Presence, he should not rush, lest he be deprived.\n\n<<وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ مِنْ وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا>> (It is not for any human being that Allah should speak to him except by revelation, or from behind a veil, or by sending a messenger) who acts on His behalf in speech, who is the interpreter (الترجمان). Allah the Exalted said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله>> (Then grant him protection until he hears the Speech of Allah), meaning upon the tongue of the interpreter, who is the Messenger of Allah, peace and blessings be upon him.\n\nI heard one of the Shaykhs say: \"As long as he is in his humanity (بشريته), the speech is from behind a veil, but when he departs from his humanity, the veil is lifted.\" This Shaykh is Abd al-Aziz ibn Abi Bakr al-Mahdawi, known as Ibn al-Kura. I heard this from him in a station in Tunis, may Allah have mercy on him. He was correct in part and mistaken in part. His correctness lies in his affirmation and establishment of the Speech from behind a veil and that it is not combined with Witnessing (المشاهدة). His mistake lies in his saying that the veil is lifted without qualification. Rather, one should say that the *veil of his humanity* is lifted. There is no doubt that behind the veil of his humanity are other veils. The veil of humanity may be lifted, and the Speech from Allah may occur for this servant from behind another veil, the highest of the veils and the closest to Allah, and the farthest from the created being: the Divine Manifestations (المظاهر الإلهية) in which the Theophany (التجلي) occurs, if they are limited and accustomed to being witnessed, such as the appearance of the Angel in the form of a man, speaking to him according to the moderation of custom and limit. He may have a Theophany (تجلى له) that fills the horizon, causing him to faint due to the lack of custom, even if the limit exists. What then of one who sees neither limit nor custom? The Manifestations may be unlimited and unaccustomed, or limited and unaccustomed, or limited and accustomed. The states of the witnesses differ in each Presence.\n\nWhoever turns away from the Presence of Conversation has joined the people of loss, even if he is felicitous, but only after great wretchedness.\n\nIndeed, among the people of claims in this path, concerning whom Allah said: <<وقَدْ خابَ من دَسَّاها>> (And he has failed who corrupts it), when <<أَفْلَحَ من زَكَّاها>> (he has succeeded who purifies it), they claim that they speak to Allah in His creation and hear from Him in His creation, while he is in himself, with himself, having no news from his Lord, because he does not know Him, nor does he know how to hear from Him, nor what he hears from Him. The people of claims in this path are like the hypocrites among the Muslims: they share the outward form but are distinguished by their inner realities. They are with them, not with Him. <<فَوَيْلٌ لِلَّذِينَ يَكْتُبُونَ الْكِتابَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هذا من عِنْدِ الله>> (Woe to those who write the Book with their hands and then say, \"This is from Allah\"). By Allah, it is from Him, but not in the manner they claim. This is why they are wretched by what they said, even if they do not believe it. The other person is felicitous by saying that it is from Allah and believing it, but not in the manner that leads to wretchedness. The statement is one, but the ruling is different. Glory be to Him Who concealed His Knowledge from some people and revealed it to others! <<لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the All-Mighty, the All-Wise). The matter can only be thus, for it occurred thus, and nothing occurs except what He knew would occur thus, for it is thus in reality, and its opposite is impossible. Here is a knot that only specialized Unveiling (الكشف الاختصاصي) can untie; expression cannot untie it.\n\nIf you have understood this,\n\n### Cooperation in Righteousness and Piety\n\nKnow that among the final sections of this station is cooperation <<عَلَى الْبِرِّ والتَّقْوى‏>> (in righteousness and piety). This leads to noble knowledge related to the understanding of the established causes (الأسباب الموضوعة) in the world. The removal of their essence (عيناً) is not valid if the cause is a necessary condition (علة). If it is not a necessary condition, the removal of its essence may be valid while its necessary consequence (لازمه) remains, but not by virtue of its being a consequence of the cause, but by virtue of the essence of the consequence itself. Thus, insofar as it is a consequence of the cause according to the specialized method, it is not removed. But insofar as it is an essence, even if it is a consequence of something else, its effect is due to its essence, and its ruling is found due to its essence.\n\nIn the case of causes that are removed while the consequence is found, the consequence acts by its own essence. For example, customary food (الغذاء المعتاد) according to its specialized method is necessarily followed by satiety (الشبع) upon eating it. Yet, satiety may occur without food or eating. An example of a necessary cause (السبب العلي) is the existence of the Essence (الذات) being described as satiated due to the existence of satiety. If you removed satiety, the state of being satiated would be removed.\n\nThus, some causes are valid to remove, and some are not. Establishing everything in its proper place and according to its limit, as established by its Establisher, is most appropriate for the elite (الأكابر). They are distinguished from the common people by reliance (الاعتماد). The elite rely on nothing among things, if they are described as relying, except upon Allah. Whoever denies the existence of causes has denied what the Real (الحق) has established. This incurs blame from the elevated group (الطائفة العالية). It is a deficiency in the Station (المقام), but perfection in the State (الحال); praiseworthy in the spiritual journey (السلوك), but blameworthy in the ultimate Goal (الغاية). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (says the Truth, and He guides to the way).",
    "ur": "باب دو سو ستترواں: منزل تکذیب (جھٹلانے) اور بخل کی معرفت میں اور اس کے اسرار جو مقام موسوی سے متعلق ہیں۔\n\nعلم دو طرح کا ہے: ایک علم دین جو بشر میں ارواح کی ظاہری صورتوں میں ہے۔\nاور ایک علم حق ہے جو تحقیق سے مؤید ہوتا ہے، جسے اللہ نے آیات اور سورتوں میں ودیعت کیا ہے۔\nہر اس آنکھ سے جو دیکھتی ہے اور چمکتی ہے، پس لام (ل) خبر میں فا (ف) کے ساتھ دیکھتا ہے۔\nیہ سات انوار کی منازل ہیں، پانچ سورج اور چاند کے بغیر چھپ جاتی ہیں۔\nان میں سے تاکہ وہ ظاہر ہو جو غیب میں عجائبات میں سے ہے، پس ہر منزل ایک تقدیر پر چلتی ہے۔\nبے شک وہ صفات جنہیں کتاب (قرآن) لائی ہے، وہ عقل اور فکر کی رسائی سے پاک ہیں۔\nاور وہ کیسے ادراک کر سکتا ہے جس کی کوئی شے مشابہ نہیں، وہ جو علم کو حس اور نظر سے حاصل کرتا ہے۔\nپس اللہ کا علم اس میں عین جہل ہے، اور اللہ کا جہل عین علم ہے، پس غور کر۔\nاور کائنات میں اس کے سوا کوئی معلوم نہیں، تو اے احاطہ کرنے سے مغلوب! تو کیا کہتا ہے؟\nبے شک ظہور جب حدود سے تجاوز کرتا ہے تو چھپ جاتا ہے، معاملہ بھی ایسا ہی ہے، پس اس میں دیکھ اور فکر کر۔\n\n### [بے شک ایمان کے لیے ایک نور ہے جس سے وہ چیز منکشف ہوتی ہے جس کی خبر دی گئی ہے]\n\nجان لے اے ولی حمیم! اللہ تیری بصیرت کو منور کرے، کہ جزا کا علم (علم الجزاء) نورِ ایمان (نور الایمان) سے حاصل ہوتا ہے نہ کہ نورِ عقل سے۔ کیونکہ دنیا اور آخرت میں اعمال کا جزا کے ساتھ تعلق صرف ایمان (الایمان) اور کشف (الکشف) کے ذریعے ہی معلوم ہو سکتا ہے۔ جہاں تک ہمارے اسے علم کہنے کا تعلق ہے، یعنی علمِ ایمان، اگرچہ یہ خبر دینے والے کی خبر کی عین تصدیق ہے، لیکن ایسی چیز علم نہیں ہو سکتی کیونکہ اگر مخبر عنہ (جس کی خبر دی گئی) کو فرضی طور پر واپس کر دیا جائے تو یہ زائل ہو جائے گی۔ اس کے دو پہلو ہیں۔ پہلا یہ کہ مؤمن اسے اپنے نفس میں ایک لازمی امر (ضرورۃ) پاتا ہے، اگر وہ اس سے الگ ہونا چاہے تو نہیں کر سکتا۔ پس یہ اس کے نزدیک ہر اس عقل کے لیے علوم ضروریہ میں سے ہے جس میں ایمان موجود ہے۔ دوسرا پہلو یہ ہے کہ ایمان (الایمان) کے لیے ایک نور ہے جس سے وہ چیز منکشف ہوتی ہے جس کی خبر دی گئی ہے، جیسا کہ صحیح دلیل میں غور و فکر سے عقلی مدلول منکشف ہوتا ہے، بلکہ یہ اس سے بھی کامل ہے۔ کیونکہ اگر عقل اپنی دلیل اور برہان میں علوم ضروریہ پر انحصار نہ کرے تو وہ اس کے نزدیک نہ برہان ہے اور نہ علم۔ اور علمِ ایمان ایک علم ضروری ہے، اور یہی مطلوبہ حق میں عقل کا مستند ہے۔ پس جب انسان سے اس کے نظری علم کی رو سے جزا کے بارے میں پوچھا جاتا ہے تو وہ یہ نہیں کہتا کہ یہ جزا ہے، بلکہ وہ کہتا ہے کہ فلکی حرکت نے عالم کون و فساد میں اس واقعے کے وجود کا تقاضا کیا، اس کے قابل کے مطابق۔ اور یہ بھی اتفاق ہوا کہ اس سے پہلے ایک اور حرکت تھی جس نے عالم کون و فساد کے اس قابل کے لیے کسی امر کے وجود کا تقاضا کیا جو اس سے ظاہر ہوا، پھر پہلی اور دوسری واقعے کے درمیان ایک عرضی امر یا ایک وضاحتی امر کے ذریعے نسبت قائم کی گئی جو عوام کے نفوس میں مقرر ہے، تو انہوں نے بعد والے واقعے کو پہلے واقعے کی جزا قرار دیا صرف اس شخص کے لیے جس سے وہ صادر ہوا، اس کے علاوہ کچھ نہیں۔ پس اس تعلق کا ادراک صرف اہل کشف الٰہی (أهل الکشف الإلهي) ہی کرتے ہیں، اگرچہ اہل نظر عقلی بھی اس کا ادراک کرتے ہیں، لیکن وہ اس تعلق کا ادراک فعل ہونے کی حیثیت سے کرتے ہیں نہ کہ جزا ہونے کی حیثیت سے۔ اور اس کو یکسر ختم کرنے کی کوئی سبیل نہیں۔ اور اہل کلام جو علماء نظر ہیں، وہ اپنے عقل کے نور سے اس کے ختم ہونے کو جائز سمجھتے ہیں، اور انہوں نے سچ کہا، کیونکہ نورِ عقل اپنی قوت سے جو کچھ دیتا ہے اس سے تجاوز نہیں کرتا، اور نورِ ایمان (نور الایمان) اس سے بالاتر ہے، وہ بھی اپنی قوت کے مطابق دیتا ہے اور اس کے مطابق جو اللہ نے اس میں رکھا ہے، جو شرط سے عاری ہو کر عقل ادراک نہیں کر سکتی۔ کیونکہ عقل کہتی ہے کہ اگر اس کا علم پہلے سے موجود تھا تو عقلی طور پر اس کا ہونا ضروری ہے، پس اس نے شرط داخل کر دی۔ اور ایمان (الایمان) ایسا نہیں ہے، کیونکہ یہ ایک محقق کشف (کشف محقق) سے حاصل ہوتا ہے جس میں کوئی شک نہیں۔ پھر عقلاء کی ایک جماعت جن کا ہم نے ذکر کیا، وہ جنہوں نے فعل کو ثابت کیا لیکن یہ تصدیق نہیں کی کہ وہ جزا ہے، انہوں نے دنیا اور آخرت میں اس کا انکار کیا۔ دنیا میں تو اس وجہ سے جس کا ہم نے ذکر کیا، اور آخرت میں وہ اس بارے میں دو حصوں میں تقسیم ہو گئے۔ ایک گروہ نے آخرت کو اس طریقے پر ثابت کیا جو ایمان کے طریقے سے مختلف ہے، اور یہ وہ لوگ ہیں جنہوں نے طبیعی اجسام میں اعادہ (دوبارہ لوٹائے جانے) کا انکار کیا۔ اور ایک گروہ نے آخرت کا یکسر انکار کر دیا، تو جزا کا انکار تو بدرجہ اولیٰ ہے۔ جہاں تک اس گروہ کا تعلق ہے جس نے آخرت کو ثابت کیا اور جزا کا انکار کیا، تو انہوں نے صرف جنات کی نعمتوں کی حسی جزا کا انکار کیا، اور جزا کو روحانی قرار دیا کہ جب ارواح اپنے اجسام کی تدبیر سے جدا ہوئیں اور طبیعت کی قید سے آزاد ہوئیں، اور اس مدت میں انہوں نے عمدہ اخلاق اور علوم الٰہیہ و روحانی سے ایک اچھی ہیئت حاصل کر لی تھی جس نے انہیں ملکی رتبے سے ملحق کر دیا، پس جب وہ طبیعت سے جدا ہوئیں، جسے موت کہا جاتا ہے، تو وہ فرشتوں سے ملحق ہو گئیں اور یہ ان کے لیے ہمیشہ کے لیے قائم ہو گیا۔ پس اس ملکی رتبے میں ان کا یہ دوام اس ثمرہ کا نتیجہ تھا جو انہوں نے اپنے طبیعی جسم کی تدبیر میں قید ہونے کی حالت میں حاصل کیا تھا، اور شریعت میں اسی کو جزا کہا جاتا ہے اور اس کے سوا کچھ نہیں۔ اور اللہ پر اور اس کی طرف سے آئی ہوئی چیزوں پر ایمان رکھنے والے، اور ہمارے اصحاب اور ہم میں سے اہل کشف (أهل الکشف) بھی، جنہوں نے نورِ ایمان (نور الایمان) کے ساتھ عمل کیا، ہم ان کے ساتھ روحانی جزا کے بارے میں متفق ہیں جو تعلیمی نفوس کے لیے ہے، اور ہم ان سے طبیعی اجسام میں اعادہ (دوبارہ لوٹائے جانے) کے معاملے میں منفرد ہیں، ایک مخصوص مزاج پر جو انہیں دارِ کرامت میں بقا کا تقاضا کرتا ہے، اور حسی جزا جیسے لباس، زینت، کھانا، پینا، نکاح، اور جنات کی منزل سے خبائث کا رفع، جیسے طبعاً ناپسندیدہ امور اور طبعاً بدبودار ارواح۔ اور یہ سب سعادت مندوں کی حالت میں ہے۔ اور جہاں تک بدبختوں کی حالت کا تعلق ہے، تو ان کے لیے بھی طبیعی اجساد میں اعادہ ہے، لیکن ایک ایسے مزاج پر جو دنیا کے مزاج کے قریب ہے، زوال اور فنا کے لحاظ سے، ان بیماریوں کے ذریعے جو جلدوں کو پکا دیتی ہیں اور ان کی حقیقت کو ختم کر دیتی ہیں، اور ان کی جگہ دوسری جلدیں پیدا کر دیتی ہیں، جبکہ عذاب پانے والی ذات باقی رہتی ہے۔ پس بدبختوں کا اعادہ سعادت مندوں کے اعادہ سے مشابہ نہیں ہے، اگرچہ وہ اعادہ میں شریک ہیں۔ پس دارِ شقاوت میں بدبختوں کی بیماری دائمی معذوری ہے، ان کی عمروں کی مدت تک جو کبھی ختم نہیں ہو گی، جیسا کہ دنیا میں معذوروں کی معذوری ان کی عمروں کی مدت تک تھی۔ اور ان میں سے ہر گروہ جانتا ہے کہ جو کچھ وہ اس میں ہیں، وہ **جَزاءً بِما كانُوا يَعْمَلُونَ** (بدلہ ہے اس کا جو وہ کرتے تھے)۔ اور ہم نے \"بعض\" اس لیے کہا کہ جنات تین ہیں: جنتِ جزا (عمل کا بدلہ)، جنتِ میراث (وہ جو مشرک کو ایمان لانے پر ملتی)، اور جنتِ اختصاص (ان دونوں کے علاوہ)۔ اور میں نہیں جانتا کہ جنتِ اختصاص عام ہے یا اللہ کے خاص بندوں کے لیے ہے۔ اور وہ لوگ جنہوں نے کبھی کوئی مشروع نیکی نہیں کی، ان کے لیے جنتِ میراث ہے، اور میں نہیں جانتا کہ ان کے لیے جنتِ اختصاص ہے یا نہیں، جیسا کہ ہم نے کہا۔ اور جہاں تک مشروع اعمال کی جنت کا تعلق ہے، اس حیثیت سے کہ وہ مشروع ہیں نہ کہ اس حیثیت سے کہ وہ موجود ہیں، تو ان کا اس میں کوئی حصہ نہیں، کیونکہ ان میں سے بعض میں مکارمِ اخلاق ہو سکتے ہیں، لیکن انہوں نے انہیں مشروع ہونے کی حیثیت سے عمل میں نہیں لایا۔ پس جب یہ بات مقرر ہو گئی جس کا ہم نے ذکر کیا۔\n\n### [وہ لوگ جو علمِ جزا پر ایمان نہیں لائے، وہ علمِ وہبی سے محروم رہتے ہیں]\n\nتو جان لے کہ وہ گروہ جسے علمِ جزا (علم الجزاء) پر ایمان حاصل نہیں ہوا، وہ علومِ موہوبہ (العلوم الموهوبة) سے محروم رہتے ہیں، ہر اس علم کے قبول سے جس کے لیے ان کے نفوس میں ان کے کیے ہوئے عمل کا کوئی میزان قائم نہ ہو۔ پس جب ان پر ان کی خلوتوں میں فتح آتی ہے اور ان پر آلودگی سے پاک علومِ مقدسہ کے ساتھ انوارِ الٰہیہ کا ظہور ہوتا ہے، تو وہ اپنے اعمال اور اپنے تعملی استعداد (الاستعداد التعملي) کو دیکھتے ہیں، اور ان علوم میں سے اتنا ہی لیتے ہیں جتنا ان کے میزان نے انہیں دیا، اور کہتے ہیں کہ یہ **مِنْ عِنْدِ الله** (اللہ کی طرف سے) ہے۔ اور جو ان علوم میں سے ان کے میزان میں داخل نہیں ہوتا، وہ اسے رد کر دیتے ہیں۔ اور یہ اس گروہ کے حق میں عجیب ترین الٰہی امور میں سے ہے کہ وہ علمِ جزا کے قائل نہیں، اور علوم میں سے صرف وہی لیتے ہیں جو ان کے اعمال اور تعملی استعدادات کے میزان نے انہیں دیا ہے۔ اور یہ اس کے برعکس ہے جس پر اہل طریق (أهل الطريق) کے ہاں معاملہ قائم ہے۔ اور یہ ایک کشفِ خاص (کشف خاص) ہے جو ہم جیسے لوگوں کے لیے مخصوص کیا گیا ہے، اللہ کا شکر ہے اس پر۔ اور جہاں تک ہمارا اور ہمارے راستے پر چلنے والوں کا تعلق ہے، تو ہم اس میں سے جو کچھ ہم پر وارد ہوتا ہے، اسے یکسر رد نہیں کرتے اور نہ ہی اسے دفع کرتے ہیں، خواہ وہ ہمارے عمل اور تعملی استعداد کا تقاضا ہو یا نہ ہو۔ کیونکہ ہمارے نزدیک ہر چیز میں تقاضا لازم نہیں، بلکہ اللہ جو چاہتا ہے اسے کسی بھی محل میں وجود بخشتا ہے۔ اور اگر اس گروہ کی بصیرتوں کو اللہ منور کر دیتا جس کا ہم نے ذکر کیا، تو وہ دیکھتے اور اپنے حال سے نصیحت حاصل کرتے، کیونکہ وہ جزا کی تصدیق نہیں کرتے اور علوم میں سے صرف وہی قبول کرتے ہیں جو ان کے نفوس میں جزا کے میزان نے دیا ہے، اور وہ اس کا شعور نہیں رکھتے۔ اور یہ مقامِ حیرت ہے۔ جیسا کہ ہم بھی کسی ایسی چیز کو رد نہیں کرتے جو اللہ نے ہمیں کسی مذموم یا محمود واسطے کے ذریعے عطا کی ہو، جیسا کہ سلیمان علیہ السلام نے کیا، یا واسطوں کے اٹھ جانے سے، خواہ وہ ممنوع ہو یا مامور بہ۔ کیونکہ اللہ نے ہمیں اتنی قوت اور علمِ سیاست عطا کیا ہے کہ ہم جانتے ہیں کہ کیسے لینا ہے، اور جب ہم لے لیں تو کیسے اس میں اور اس کے ذریعے تصرف کرنا ہے، اور کس محل میں تصرف کرنا ہے۔ اور یہ ہمیشہ حق سے سماع (السماع من الحق) کرنے والوں کے لیے مخصوص ہے، اور یہی ہمارا طریقہ ہے اور ہمارے اکابر اسی پر عمل کرتے ہیں۔ اور اس کے لیے وافر علم، حاضر عقل، دائمی مشاہدہ (مشاهدة دائمة)، اور ایسی آنکھ کی ضرورت ہے جو نیند کو قبول نہ کرے اور نہ اسے پہچانے، اور اس کی ایسی تحقیق ہو جو حسی طور پر، اور نیند کی حالت میں خیالی طور پر، اور فنا (الفناء) اور غیبت کی حالت میں تحقیقی طور پر جاری رہے۔ اور یہ ایک عزیز مقام ہے جو ہم میں سے افراد (الأفراد) کے لیے مخصوص ہے۔ اور انبیاء کا اکثر علم ان علوم میں سے ہے جن کا کوئی مستند نہیں ہوتا، اور اسی لیے نبوت اللہ کی طرف سے ایک اختصاص (اختصاص) تھی جو نہ عمل سے حاصل ہوتی ہے اور نہ تعامل سے۔ اور ہم نے یہ مقام عینِ منت سے ورثے میں پایا، پس ہم نے نبوت کے علاوہ ان علوم میں سے بہت کچھ حاصل کیا جن کا کوئی مستند نہیں ہوتا، جنہیں ہمارے اسرار جانتے ہیں نہ کہ ہمارے نفوس۔ اس لیے ان میں سے کوئی چیز ہم پر ظاہر نہیں ہوتی، کیونکہ ان کا تعلق کون (الکون) سے نہیں ہے۔ اللہ تعالیٰ فرماتا ہے: **أَ لَمْ يَجِدْكَ يَتِيماً فَآوى‏** (کیا اس نے تمہیں یتیم نہیں پایا، پھر ٹھکانہ دیا؟) اور **وَجَدَكَ ضَالًّا فَهَدى‏** (اور تمہیں بھٹکا ہوا پایا، پھر ہدایت دی؟) اور **وَجَدَكَ عائِلًا فَأَغْنى‏** (اور تمہیں محتاج پایا، پھر غنی کر دیا؟)۔ پس ہمارے اصحاب نے ان تینوں احوال اور ان جیسی دیگر احوال کے بارے میں اختلاف کیا کہ کیا یہ ٹھکانہ ملنے، ہدایت اور غنی کے حصول کے لیے استعدادات (استعدادات) تھیں یا نہیں؟ اور ہم میں سے بعض نے کہا کہ استعداد صرف تعملی (عمل کے ذریعے) ہی ہو سکتی ہے، اور یہ اکثریت کا قول ہے۔ اور بعض نے کہا کہ استعداد کسی امر کے حصول کے لیے اہل ہونا ہے، خواہ وہ تعملی ہو یا غیر تعملی۔ پس یہ اختلاف لفظی ہے، اور یہی وہ اختلاف ہے جو اس طریقے کے اہل کی طرف منسوب کیا جاتا ہے۔ اور ہو سکتا ہے کہ استعداد اس شخص کو معلوم ہو جو اس کا صاحب ہے کہ یہ استعداد ہے، اور ہو سکتا ہے کہ معلوم نہ ہو۔ اور اس کی تحقیق وہ ہے جو ہم ذکر کرتے ہیں: وہ یہ کہ استعداد کی حقیقت وہ طلب ہے کہ وہ کسی عظیم امر کے لیے تیار ہو جو اللہ کی طرف سے اسے حاصل ہو، پس اسے تعمّل (تعمل) کہا جاتا ہے، کیونکہ یہ استفعال ہے، جیسے استخراج (نکالنا)، استطلاق (آزاد کرنا)، اور استرسال (ڈھیل دینا)۔ اور جہاں تک اس کے لیے تیار ہونے کا تعلق ہے جو اسے حاصل ہوا، تو ضروری ہے کہ وہ اپنے نفس میں اس پر ہو، نہ کہ کسی بنانے والے کے بنانے سے۔ اور ممکن عدم (العدم الممكن) اور محال عدم (العدم المحال) نے اسے چھپا رکھا تھا۔ اگر ممکن عدم اپنے نفس میں مرجح (ترجیح دینے والے) کے اثر کو قبول کرنے کے لیے تیار نہ ہوتا، تو ایک وقت میں ایک جانب اور دوسرے وقت میں دوسری جانب کو ترجیح نہ ملتی۔ اور محال عدم، اگر وہ اپنے نفس میں اس چیز کو قبول نہ کرنے کے لیے تیار نہ ہوتا جو اس کے اپنے نفس میں موجود کے متضاد ہے، تو وہ اسے قبول کر لیتا۔ اور اسی طرح وہ جس کے لیے اس کی ذات کے لیے وجوبِ وجودی (الوجوب الوجودي) ثابت ہے۔ پس یہ استعداد کے مسئلے کی تحقیق ہے، اور اس کے اور اعداد (تیاری) کے درمیان فرق ہے۔ اور اعداد (الإعداد) وجودی اور عدمی دونوں طرح سے ضروری ہے، اور نہ وجودی اور نہ عدمی، جیسے نسبتیں۔ پس ہم نے اس منزل کے اس فصل کو مکمل کر لیا ہے، اور اس کے باقی فصول وہ ہیں جن کا ہم ذکر کریں گے، اور وہ یہ ہے کہ وہ علم کیا ہے جسے فقیر اپنے فقر اور مسکنت کے ذریعے طلب کرتا ہے، اور جب وہ حاصل ہو جائے تو کیا اسے اس سے غنی (الغني) حاصل ہوتا ہے یا نہیں، اور کیا اس کے لیے کسی قوم کے لیے کوئی معلوم طریقہ ہے یا نہیں، اور کیا اس کے جاننے والوں پر لازم ہے کہ وہ لوگوں کو اس پر چلنے کی ترغیب دیں یا نہیں۔\n\n### [اللہ کے سوا ہر چیز میں احتیاج (الافتقار) ایک ذاتی امر ہے]\n\nپس جان لے کہ اللہ کے سوا ہر چیز میں احتیاج (الافتقار) ایک ذاتی امر (أمر ذاتي) ہے، جس سے ذوقاً اور صحیح علم کے ذریعے الگ ہونا ممکن نہیں، مگر اس کے مقاصد میں اختلاف ہوتا ہے کہ یہ فقیر کس چیز کا محتاج ہے اور وہ کون سا معنی ہے جس میں وہ محتاج ہے۔\n\n### [بے شک فقر اور مسکنت ایک ذاتی صفت ہے]\n\nپس جان لے کہ جب علم میں فقر (الفقر) اور مسکنت (المسکنة) کا ذاتی صفت ہونا ثابت ہو گیا، تو اس کا متعلق جس میں وہ محتاج ہوئی، وہ اس کے وجود کے استمرار اور اس کے لیے نعمت کے استمرار کا طلب کرنا ہے، کامل ترین طریقوں پر، اس طرح کہ اس میں نقیض کا دخل نہ ہو۔ پس اس طریقے کے اہل نے اسے حالاً اور عقداً صرف اللہ تعالیٰ کی طرف سے ہی دیکھا، لہٰذا انہوں نے اس میں صرف اسی کی طرف احتیاج کی، نہ کہ اس کے سوا کسی اور کی۔\nاور ان کے لیے اپنے وجود میں اس کی طرف احتیاج صحیح نہیں، کیونکہ وہ موجود ہیں۔ بلکہ ان کی یہ احتیاج ان کے عدم کی حالت میں ان کے وجود کے لیے تھی، اسی لیے اس نے انہیں وجود بخشا۔ پس احتیاج کا متعلق ہمیشہ عدم ہی ہوتا ہے تاکہ وہ اسے ان کے لیے وجود بخشے، کیونکہ اس کا وجود بخشنا اسی کے ہاتھ میں ہے۔ اور جہاں تک ہمارے علاوہ دوسروں کا تعلق ہے، تو انہوں نے اسے اللہ کی طرف سے عقداً دیکھا نہ کہ حالاً، اور یہ اکثر مسلمان ہیں، ان کے عالم اور جاہل۔ اور لوگوں میں سے بعض وہ ہیں جو اسے اللہ کی طرف سے اصلاً دیکھتے ہیں، نہ عقداً اور نہ حالاً، اور یہ علل و معلولات کے قائل ہیں، اور یہ اللہ سے سب سے دور گروہ ہے۔ اور لوگوں میں سے بعض وہ ہیں جو اسے اللہ کی طرف سے نہ اصلاً، نہ عقداً، اور نہ حالاً دیکھتے ہیں، اور یہ معطلہ (المعطلة) ہیں۔ اور ان مذکورہ گروہوں میں سے کوئی بھی ایسا نہیں جو اپنی ذات سے احتیاج نہ پائے۔ اور ان گروہوں میں سے کسی کو بھی مطلقاً اللہ کی طرف سے غنی (الغني) حاصل ہونا محال ہے۔ لیکن انہیں ہمیشہ مقید غنی حاصل ہو سکتا ہے جس سے وہ الگ نہیں ہو سکتے۔ اور جہاں تک اس کی طرف جانے والے راستے کا فرض ہے، تو وہ بھی ذاتی ہے، اس حیثیت سے کہ وہ راستہ ہے۔ اور جو چیز کسب سے متعلق ہے، وہ اس راستے میں ایک خاص سلوک ہے اس شخص کے لیے جو اس کا محتاج ہے۔ اور جب سلوک اس مرتبے کا ہو، تو اس پر ترغیب دینا اور اسے نہ جاننے والے کے لیے واضح کرنا لازم ہو جاتا ہے۔ پس جو شخص اس کے مستحق کے لیے اسے واضح کرنے سے گریز کرتا ہے، جبکہ وہ اسے جانتا ہے، تو وہ محرومی اور رسوائی کا مالک ہے۔ اور نبی اکرم صلی اللہ علیہ وسلم نے اس کے ایک مرتبے پر تنبیہ فرمائی ہے۔\n\nآپ صلی اللہ علیہ وسلم کے اس قول سے: **من سئل عن علم فكتمه ألجمه الله بلجام من نار** (جس سے کسی علم کے بارے میں پوچھا گیا اور اس نے اسے چھپایا، تو اللہ اسے آگ کی لگام ڈالے گا)۔\n\nاور سوال لفظی بھی ہو سکتا ہے اور حالی بھی۔ اور جس چیز کے بارے میں پوچھا گیا ہے اور جس پر وعید کا تعلق ہے، ضروری ہے کہ اس پر سوال کرنا واجب ہو، لہٰذا عالم پر اس کا جواب دینا واجب ہونا ضروری ہے۔ اور احتیاج کے سوالات (سؤالات الافتقار) سب اسی مرتبے کے ہیں۔ اللہ تعالیٰ فرماتا ہے: **يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله** (اے لوگو! تم اللہ کے محتاج ہو)۔ پس اس خطاب میں اللہ نے ہر اس نام سے پکارا ہے جو اس شخص کے لیے ہے جو اس چیز میں اس کا محتاج ہے جس میں وہ محتاج ہے۔ اور یہ غیرتِ الٰہیہ (الغيرة الإلهية) کے باب سے ہے تاکہ وہ اس کے سوا کسی اور کا محتاج نہ ہو۔ اور اس میں شرف اس شخص کے لیے ہے جو اسے جانتا ہے۔ اور اس خطاب میں لوگوں کی ہجو ہے کہ انہوں نے اس امر کو نہیں جانا مگر الٰہی تعریف کے بعد جو شرعی خطاب میں رسولوں علیہم السلام کی زبانوں پر واقع ہوئی۔ اس کے باوجود بہت سے لوگوں نے اس کا انکار کیا اور اسے مخصوص امور تک محدود کر دیا جن میں وہ اس کے محتاج ہیں، نہ کہ وجود کے تمام لوازم میں جو مخلوق کے لیے آنات (لمحات) کے ساتھ پیش آتے ہیں۔ اور اگر ہم اس آیت کے فہم کی حقیقت کو سمجھتے تو ہمیں آنسوؤں کی جگہ خون رونا چاہیے تھا، کہ ہم نے اپنے نفوس کے اس امر کو اس وقت تک نہیں جانا جب تک کہ الٰہی تعریف واقع نہیں ہوئی۔ تو اس شخص کا کیا حال ہو گا جس نے اس کا انکار کیا، اس کی تاویل کی اور اسے مخصوص کر دیا؟ پس ہم نے اس منزل سے متعلق دوسرے فصل کا ایک حصہ بیان کر دیا ہے۔ اور جہاں تک اس منزل کے تیسرے فصل کا تعلق ہے، تو جان لے کہ اللہ تعالیٰ نے اپنے بندوں کو یہ پہچان کرائی ہے کہ اس کی مخصوص حضرات (حضرات معينة) ہیں ان امور کے لیے جن کے حصول اور ان میں داخل ہونے کی طلب کے لیے اس نے انہیں بلایا ہے، اور انہیں ان کا محتاج بنایا ہے۔ پس لوگوں میں سے بعض نے اسے قبول کیا اور بعض نے اسے جہالت کی وجہ سے رد کر دیا۔ ان میں سے ایک حضرۃ المشاہدہ (حضرة المشاهدة) ہے، جو مختلف منازل پر ہے، اگرچہ وہ ایک ہی حضرۃ میں شامل ہے۔ پس ان میں سے بعض وہ ہیں جو اسے اشیاء میں دیکھتے ہیں، اور بعض ان سے پہلے، اور بعض ان کے بعد، اور بعض ان کے ساتھ۔ اور بعض وہ ہیں جو اسے عینِ اشیاء دیکھتے ہیں، جس میں بہت سے مقامات کا اختلاف ہے، جنہیں اہل طریقِ اللہ، اصحابِ ذوق و شرب جانتے ہیں۔ اور ان میں سے حضرۃ المکالمہ (حضرة المكالمة) ہے، اور ان میں سے حضرۃ الکلام (حضرة الكلام) ہے، اور ان میں سے حضرۃ السماع (حضرة السماع) ہے، اور ان میں سے حضرۃ التعلیم (حضرة التعليم) ہے، اور ان میں سے حضرۃ التکوین (حضرة التكوين) ہے، اور دیگر بھی، کیونکہ وہ بہت زیادہ ہیں اور یہ تصنیف ان کے ذکر کے لیے کافی نہیں۔ پس حضرۃ المکالمہ (حضرة المكالمة) اس منزل کی خصوصیات میں سے ہے۔ پس جو اس سے گریز کرتا ہے، وہ ان الٰہی معارف اور ربانی گفتگو کے لذت سے محروم ہو جاتا ہے جو اس میں شامل ہیں۔ اور وہ ان لوگوں میں سے ہو جاتا ہے جن کے بارے میں کہا گیا: **ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ** (ان کے رب کی طرف سے کوئی نصیحت نہیں آتی) اور **ومن الرَّحْمنِ** (اور رحمن کی طرف سے) ظہور الٰہی (التجلی) کے مطابق **مُحْدَثٍ إِلَّا كانُوا عَنْهُ مُعْرِضِينَ** (نئی نصیحت مگر وہ اس سے منہ موڑنے والے ہوتے ہیں)۔ اور یہ ایک مخصوص گروہ ہے۔ اور دوسرا گروہ وہ ہے جو **اسْتَمَعُوهُ وهُمْ يَلْعَبُونَ** (اسے سنتے ہیں اور وہ کھیل رہے ہوتے ہیں)۔ پس ہمارے طریقے کے اہل اس کلام کے وارد ہونے پر اس چیز میں مشغول نہیں ہوتے جو انہیں ان فوائد سے غافل کر دے جو اس میں شامل ہیں۔ اگر وہ جواب کا تقاضا کرے تو وہ اپنے رب کو جواب دیتے ہیں، اور اگر وہ اس کے علاوہ کسی چیز کا تقاضا کرے تو وہ اس خطاب کے تقاضے کو پورا کرنے میں جلدی کرتے ہیں۔ اور وہ اس حالت میں متکلم کی طرف چوری چھپے دیکھتے ہیں تاکہ ان کی آنکھیں اس سے ٹھنڈی ہوں، جیسا کہ ان کے نفوس سماع کی وجہ سے لذت پاتے ہیں۔ تاہم، وہ اس حال میں نظر کی حقیقت کو نہیں پاتے، کیونکہ وہ جانتے ہیں کہ اس میں ذات حق (الحق) کا ان سے مراد یہ ہے کہ وہ اس سے سمجھیں جو وہ ان سے کلام کر رہا ہے۔ پس وہ شوق کے باوجود نظر سے ڈرتے ہیں کہ کہیں وہ انہیں اس چیز سے فنا (الفناء) نہ کر دے جس کا ان سے فہم کے ذریعے مطالبہ کیا گیا ہے، تو وہ ان لوگوں میں شامل ہو جائیں گے جنہوں نے اپنے نفوس کے حصوں کو اس چیز پر ترجیح دی جو ذات حق (الحق) نے ان سے ارادہ کیا تھا۔ پس وہ دونوں حالتوں میں فقیر بندے ہیں۔ لیکن ان میں سے ہر حضرۃ میں ادب یہ ہے کہ اس حضرۃ کا حق ادا کیا جائے جس میں بندہ کھڑا ہے۔ اور اس کے مطلوب کے لیے ایک دوسری حضرۃ ہے جو اس سے مختلف ہے، پس وہ جلدی نہ کرے کہ محروم ہو جائے۔ اور **وَما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ أَوْ يُرْسِلَ رَسُولًا** (اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے، یا پردے کے پیچھے سے، یا وہ کوئی رسول بھیجے) جو کلام میں اس کا نائب ہو، اور وہ ترجمان (الترجمان) ہے۔ اللہ تعالیٰ فرماتا ہے: **فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله** (پس اسے پناہ دو تاکہ وہ اللہ کا کلام سنے)۔ مراد ترجمان کی زبان سے جو رسول اللہ صلی اللہ علیہ وسلم ہیں۔ میں نے بعض شیوخ کو سنا ہے کہ وہ کہتے تھے: جب تک وہ اپنی بشریت میں ہے، تو کلام اس کے لیے پردے کے پیچھے سے ہوتا ہے، لیکن جب وہ اپنی بشریت سے نکل جاتا ہے تو پردہ اٹھ جاتا ہے۔ اور یہ شیخ عبد العزیز بن ابی بکر المہداوی ہیں جو ابن الکرہ کے نام سے مشہور تھے، میں نے انہیں تیونس میں ایک منزل پر سنا، اللہ ان پر رحم کرے۔ پس انہوں نے اس میں درست بھی کہا اور غلطی بھی کی۔ جہاں تک ان کی درستی کا تعلق ہے، تو وہ پردے کے پیچھے سے کلام کے اثبات اور اس کے اقرار میں ہے، اور یہ کہ انہوں نے اسے مشاہدہ (المشاهدة) کے ساتھ جمع نہیں کیا۔ اور جہاں تک ان کی غلطی کا تعلق ہے، تو ان کا یہ قول ہے کہ پردہ اٹھ جاتا ہے، اور انہوں نے قید نہیں لگائی۔ بلکہ یہ کہا جائے گا کہ اس کی بشریت کا پردہ اٹھ جاتا ہے۔ اور اس میں کوئی شک نہیں کہ اس کی بشریت کے پردے کے پیچھے دوسرے پردے بھی ہیں۔ پس ہو سکتا ہے کہ بشریت کا پردہ اٹھ جائے اور اللہ کی طرف سے اس بندے کے لیے کسی دوسرے پردے کے پیچھے سے کلام واقع ہو، جو پردوں میں سب سے اعلیٰ اور اللہ سے سب سے قریب ہو، اور مخلوق سے سب سے دور ہو۔ الٰہی مظاہر (المظاهر الإلهية) جن میں ظہور الٰہی (التجلی) واقع ہوتا ہے، اگر وہ محدود اور مشاہدے میں معتاد ہوں، جیسے فرشتے کا آدمی کی صورت میں ظاہر ہونا اور اس سے معمول کے مطابق کلام کرنا۔ اور ہو سکتا ہے کہ اس پر ظہور الٰہی (التجلی) ہو اور افق بند ہو جائے، تو وہ بے ہوش ہو جائے، غیر معتاد ہونے کی وجہ سے، اگرچہ حد موجود ہو۔ تو اس کا کیا حال ہو گا جس نے نہ کوئی حد دیکھی اور نہ کوئی عادت پائی؟ پس ہو سکتا ہے کہ مظاہر غیر محدود اور غیر معتاد ہوں، اور ہو سکتا ہے کہ محدود ہوں لیکن غیر معتاد، اور ہو سکتا ہے کہ محدود اور معتاد ہوں۔ اور ہر حضرۃ میں مشاہدہ کرنے والوں کے احوال مختلف ہوتے ہیں۔ پس جو حضرۃ المکالمہ (حضرة المكالمة) سے گریز کرتا ہے، وہ اہل خسران (أهل الخسران) سے ملحق ہو جاتا ہے، اگرچہ وہ سعادت مند ہو، لیکن ایک عظیم شقاوت کے بعد۔ اور بے شک اس طریقے کے دعویداروں میں سے بعض وہ ہیں جن کے بارے میں اللہ نے فرمایا: **وقَدْ خابَ من دَسَّاها** (اور وہ ناکام ہوا جس نے اسے دبا دیا) جب کہ **أَفْلَحَ من زَكَّاها** (وہ کامیاب ہوا جس نے اسے پاک کیا)۔ پس وہ یہ دعویٰ کرتے ہیں کہ وہ اللہ سے اس کی مخلوق میں کلام کرتے ہیں اور اس سے اس کی مخلوق میں سنتے ہیں، جبکہ وہ خود اپنے نفس کے ساتھ ہے، اسے اپنے رب کی کوئی خبر نہیں، کیونکہ وہ اسے نہیں پہچانتا اور نہ یہ جانتا ہے کہ اس سے کیسے سننا ہے اور نہ یہ کہ وہ کیا سنتا ہے۔ پس اس طریقے کے دعویدار مسلمانوں میں منافقین کی طرح ہیں، کیونکہ وہ ظاہری صورت میں ان کے ساتھ شریک ہیں اور باطن میں الگ ہیں۔ پس وہ ان کے ساتھ ہیں، نہ کہ اس کے ساتھ۔ **فَوَيْلٌ لِلَّذِينَ يَكْتُبُونَ الْكِتابَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هذا من عِنْدِ الله** (پس ہلاکت ہے ان لوگوں کے لیے جو کتاب اپنے ہاتھوں سے لکھتے ہیں، پھر کہتے ہیں کہ یہ اللہ کی طرف سے ہے)۔ اور اللہ کی قسم، وہ اس کی طرف سے ہے، لیکن اس طریقے سے نہیں جس کا وہ دعویٰ کرتے ہیں۔ اور اسی لیے وہ اپنے کہے کی وجہ سے بدبخت ہوئے، اگرچہ وہ اس کا اعتقاد نہیں رکھتے۔ اور دوسرا شخص اپنے اس قول سے سعادت مند ہوا کہ یہ اللہ کی طرف سے ہے، اور اس کا اعتقاد اس طریقے پر ہے جو شقاوت نہیں دیتا۔ پس قول ایک ہے اور حکم مختلف ہے۔ پس پاک ہے وہ ذات جس نے اپنا علم ایک قوم سے چھپا دیا اور دوسروں پر ظاہر کر دیا، **لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ** (اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے)۔ اور معاملہ ایسا ہی ہونا چاہیے، کیونکہ یہ اسی طرح واقع ہوا ہے، اور وہی واقع ہوتا ہے جو اس نے جانا کہ اسی طرح واقع ہو گا، کیونکہ وہ نفس الامر میں ایسا ہی ہے، اس کے خلاف جائز نہیں۔ اور یہاں ایک گرہ ہے جسے صرف کشفِ اختصاصی (الکشف الاختصاصي) ہی کھول سکتا ہے، عبارت اسے نہیں کھول سکتی۔ اور جب تم یہ سمجھ گئے ہو۔\n\n### [نیکی اور تقویٰ پر تعاون]\n\nتو جان لے کہ اس منزل کے آخری فصول میں سے نیکی اور تقویٰ پر تعاون (التعاون عَلَى الْبِرِّ والتَّقْوى‏) ہے۔ کیونکہ اس سے ایک شریف علم متعلق ہوتا ہے جو عالم میں مقرر کردہ اسباب (الأسباب) کی معرفت سے متعلق ہے، اور یہ کہ ان کا عیناً رفع صحیح نہیں ہے اگر سبب علت ہو۔ اور اگر وہ علت نہ ہو تو اس کے عین کا رفع صحیح ہو سکتا ہے، جبکہ اس کا لازم باقی رہے، لیکن اس حیثیت سے نہیں کہ وہ اس کا لازم ہے، بلکہ عینِ لازم کی حیثیت سے۔ پس وہ اس کے لیے لازم ہونے کی حیثیت سے، مخصوص طریقے پر، رفع نہیں ہوتا۔ اور وہ اپنی عین کی حیثیت سے، اگرچہ وہ کسی اور کا لازم ہو، تو اس کا اثر اس کی عین کے لیے ہوتا ہے، پس اس کا حکم اس کی عین کے لیے پایا جاتا ہے۔ پس ان اسباب میں جو رفع ہو جاتے ہیں اور لازم پایا جاتا ہے، وہ اپنی عین کے لیے فعل کرتا ہے، جیسے مخصوص طریقے پر معتاد غذا، اس سے کھانے سے سیری لازم آتی ہے۔ اور ہو سکتا ہے کہ سیری بغیر غذا اور بغیر کھانے کے بھی ہو۔ اور سببِ علّی کی مثال ذات کا سیر ہونے کی صفت سے متصف ہونا ہے، سیری کے وجود کی وجہ سے۔ پس اگر تم سیری کو رفع کر دو تو اس کا سیر ہونا رفع ہو جائے گا۔ پس اسباب میں سے بعض وہ ہیں جن کا رفع صحیح ہے اور بعض وہ ہیں جن کا صحیح نہیں۔ اور سب کی اپنی جگہ پر اور اپنی حد پر، جیسا کہ اس کے مقرر کرنے والے نے مقرر کیا ہے، اس کی تقریر اکابر کے لیے زیادہ اولیٰ ہے۔ اور وہ اعتماد (الاعتماد) کے ذریعے عوام سے الگ ہوتے ہیں۔ پس اکابر کا کسی بھی چیز میں کوئی اعتماد نہیں ہوتا، جب انہیں اعتماد سے موصوف کیا جائے، مگر صرف اللہ پر۔ پس جو اسباب کے وجود کو منع کرتا ہے، اس نے اس چیز کو منع کیا جسے ذات حق (الحق) نے مقرر کیا ہے۔ پس وہ عالی گروہ کے نزدیک مذمت کا مستحق ہوتا ہے۔ اور یہ مقام میں نقص ہے، حال میں کمال ہے، سلوک میں محمود ہے، اور غایت میں مذموم ہے۔ اور **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و هفتاد و هفتم در معرفت منزل تکذیب و بخل و اسرار آن از مقام موسوی\n\nعلم دو گونه است: علم دین در صورت‌های *** آشکار از ارواح در میان بشر\n\nو علم حق (الحق) که با تحقیق تأیید می‌شود *** آنچه خداوند در آیات و سوره‌ها به ودیعه نهاده است\n\nاز هر بیننده‌ای با چشم بینا و شاداب *** پس لام (اللام) بیننده است با فاء (الفاء) در خبر\n\nاین‌ها منازل انوار هفت‌گانه هستند *** که پنج تای آن‌ها زیر خورشید و ماه پنهان می‌شوند\n\nتا از آن‌ها آنچه در غیب (الغیب) شگفت است آشکار شود *** پس هر منزلی به اندازه (قدر) خود می‌کوشد\n\nهمانا صفاتی که کتاب (قرآن) با آن‌ها آمده است *** از قلمرو عقل (العقل) و فکر (الفکر) فراتر و مقدس‌اند\n\nو چگونه درک کند کسی که چیزی شبیه او نیست *** کسی که علم را از حس و نظر (استدلال) می‌گیرد\n\nپس علم به خدا عین جهل (الجهل) به اوست *** و جهل به خدا عین علم (العلم) است، پس عبرت گیر\n\nو در هستی (الکون) معلومی جز او نیست، پس چه می‌گویی *** ای کسی که از احاطه (حصر) ناتوان و مغلوبی\n\nهمانا ظهور (الظهور) چون از حدود بگذرد، پنهان می‌شود *** امر نیز چنین است، پس در آن بنگر و بیندیش\n\n### [اینکه ایمان نوری دارد که با آن آنچه خبر داده شده است، کشف می‌شود]\n\nبدان ای ولیّ صمیمی، خداوند بصیرت تو را نورانی گرداند، که علم به جزا (پاداش و کیفر) از نور ایمان (نور الإيمان) حاصل می‌شود نه از نور عقل (نور العقل). زیرا ارتباط جزا با اعمال در دنیا و آخرت جز از طریق ایمان و کشف (الکشف) دانسته نمی‌شود. اما اینکه ما آن را علم می‌نامیم، یعنی علم ایمان، اگرچه عین تصدیق (التصدیق) به خبرِ خبردهنده است، چنین چیزی علم نخواهد بود، زیرا اگر خبردهنده به فرض از خبر خود بازگردد، آن علم زائل می‌شود. در این صورت، این علم دو وجه دارد: وجه اول اینکه مؤمن آن را به صورت ضروری در نفس خود می‌یابد؛ اگر بخواهد از آن جدا شود، قادر نخواهد بود. پس این علم نزد هر عاقلی که ایمان دارد، از علوم ضروریه (العلوم الضرورية) است. وجه دیگر اینکه ایمان نوری دارد که با آن، آنچه خبر داده شده است، کشف می‌شود، همان‌گونه که مدلول عقلی با نظر صحیح در دلیل محکم کشف می‌گردد، بلکه کامل‌تر است. زیرا اگر عقل در دلیل و برهان خود به علوم ضروریه در آن زمینه استناد نکند، نزد او برهان نیست و علم هم نیست. و علم ایمان، علمی ضروری است و مستند عقل در حق مطلوب است. پس اگر از انسان درباره جزا از جهت علم نظری‌اش سؤال شود، نمی‌گوید که آن جزا است، بلکه می‌گوید حرکت فلکی وجود این واقعه را در عالم کون و فساد (عالم الکون والفساد) بر حسب قابلیت پذیرنده آن اقتضا کرده است. و همچنین اتفاق افتاده که پیش از آن حرکت دیگری بوده که برای این پذیرنده از عالم کون و فساد، وجود امری را اقتضا کرده که از آن ظاهر شده است. پس بین دو واقعه اول و دوم، به واسطه امری عرضی یا امری وضعی که در نفوس عوام مقرر شده است، نسبتی برقرار شده و واقعه آخر را جزای واقعه اول برای کسی که آن را انجام داده، نامیده‌اند و نه غیر آن. پس این رابطه را جز اهل کشف الهی (الکشف الإلهي) درک نمی‌کنند، اگرچه اهل نظر عقلی نیز آن را درک کنند، زیرا ممکن است رابطه را از حیث فعل بودن درک کنند نه از حیث جزا بودن. و راهی برای رفع کلی این امر وجود ندارد. و متکلمان از علمای نظر، رفع آن را به نور عقول خود جایز می‌دانند و راست گفته‌اند، زیرا نور عقل از حد توان خود در آنچه می‌دهد فراتر نمی‌رود، و نور ایمان بالاتر از آن است و نیز بر حسب توان خود و آنچه خداوند در آن قرار داده است، بدون شرط، عطا می‌کند. زیرا عقل می‌گوید: اگر علم به آن سبقت گرفته باشد، پس عقلاً باید واقع شود؛ پس شرط را وارد می‌کند. اما ایمان چنین نیست، زیرا از کشف محقق و بی‌شک و تردید حاصل می‌شود. سپس گروهی از عقلا که ذکر کردیم، و همان کسانی هستند که فعل را اثبات کردند اما تصدیق نکردند که جزا است، آن را در دنیا و آخرت انکار کردند. اما در دنیا به دلیل آنچه ذکر کردیم، و اما در آخرت به دو دسته تقسیم شدند: گروهی از آن‌ها آخرت را به صورتی که مخالف وجه ایمان است اثبات کردند، و آن‌ها کسانی هستند که اعاده در اجسام طبیعی را انکار کردند. و گروهی آخرت را به کلی نفی کردند، پس جزا به طریق اولی نفی می‌شود. اما گروهی که آخرت را اثبات کردند و جزا را انکار کردند، جزای حسی از نعمت‌های بهشت را انکار کردند و جزا را روحانی دانستند؛ به این صورت که ارواح هنگامی که تدبیر اجساد خود را ترک می‌کنند و از اسارت طبیعت رها می‌شوند، و در این مدت اخلاق کریمه و علوم الهی و روحانی کسب کرده‌اند، هیئتی نیکو به دست آورده‌اند که آن‌ها را به مرتبه ملکی ملحق می‌سازد. پس هنگامی که از طبیعت جدا می‌شوند، جدایی که مرگ نامیده می‌شود، به ملائکه می‌پیوندند و این امر برای آن‌ها جاودانه می‌ماند. پس این دوام در این مرتبه ملکی، ثمره‌ای است که از آنچه در حال زندانی بودن در تدبیر جسم طبیعی خود به دست آورده‌اند، چیده‌اند. و این همان چیزی است که در شرع جزا نامیده می‌شود و غیر از آن چیزی نیست. و اهل ایمان به خدا و آنچه از جانب او آمده است، و آن‌ها اصحاب ما و اهل کشف (الکشف) از ما نیز هستند که به نور ایمان عمل کرده‌اند، ما با این گروه در آنچه درباره جزای روحانی برای نفوس تعلیمی ذکر کردند، مشترک هستیم و در اعاده در اجسام طبیعی بر مزاجی مخصوص که بقا را در سرای کرامت برای آن‌ها اقتضا می‌کند، و جزای حسی از لباس و زینت و خوردن و نوشیدن و نکاح و رفع خبائث از منزل‌های بهشت، مانند امور ناپسند طبعی و ارواح بدبو طبعی، از آن‌ها جدا هستیم. این در حال سعادتمندان است. و اما در حال اشقیا (بدبختان)، اعاده نیز برای آن‌ها در اجساد طبیعی است، اما بر مزاجی که به مزاج دنیا در زوال و فنا نزدیک است، با علل پزنده پوست‌ها که عین آن‌ها را از بین می‌برد و غیر آن را ایجاد می‌کند، با بقای عین معذب به آن. پس اعاده اشقیا شبیه اعاده سعادتمندان نیست، اگرچه در اعاده مشترک باشند. پس بیماری اشقیا در سرای شقاوت، زمین‌گیری جاودانه تا بی‌نهایت مدت عمرشان است که پایانی ندارد، مانند زمین‌گیری که برای زمین‌گیران در دنیا در مدت عمرشان بود. و هر گروهی از این‌ها می‌دانند که بخشی از آنچه در آن هستند، **جَزاءً بِما كانُوا يَعْمَلُونَ** (پاداشی است در برابر آنچه انجام می‌دادند) [قرآن]. و ما گفتیم «بخشی» زیرا بهشت‌ها سه گونه‌اند: بهشت جزا (پاداش) عمل، بهشت میراث که اگر مشرک ایمان می‌آورد مستحق آن می‌شد، و بهشت اختصاص که غیر از این دو است. و نمی‌دانم آیا بهشت اختصاص عمومی است یا مخصوص بندگان خاص خداست. و کسانی که هرگز عمل مشروعی انجام نداده‌اند، بهشت میراث برای آن‌هاست و نمی‌دانم آیا بهشت اختصاص نیز دارند یا خیر، همان‌طور که گفتیم. اما بهشت اعمال مشروع، از حیث مشروع بودنشان نه از حیث موجود بودنشان، نصیبی برای آن‌ها در آن نیست. زیرا ممکن است در میان آن‌ها کسانی باشند که دارای مکارم اخلاق هستند، اما به آن‌ها عمل نکرده‌اند از حیث مشروع بودنشان. پس چون آنچه ذکر کردیم مقرر شد،\n\n### [کسانی که به علم جزا ایمان نیاورده‌اند، از علم وهبی محروم می‌شوند]\n\nپس بدان که گروهی که ایمان به علم جزا (پاداش و کیفر) برایشان حاصل نشده است، از علوم موهوبه (العلوم الموهوبة) محروم می‌شوند، یعنی پذیرش هر علمی که در آن از اعمالی که انجام داده‌اند، میزانی در نفوسشان اقامه نشود. پس هنگامی که فتح (الفتح) در خلوت‌هایشان برایشان حاصل می‌شود و انوار الهی با علوم مقدس از آلودگی‌های زیان‌آور بر آن‌ها می‌تابد، به اعمالی که انجام داده‌اند و به استعداد تعملی (الاستعداد التعملي) که داشته‌اند، می‌نگرند و از آن علوم به اندازه‌ای که میزان‌هایشان به آن‌ها داده است، می‌گیرند و می‌گویند: این از **عِنْدِ الله** (نزد خدا) است. و آنچه از این علوم در میزان‌هایشان وارد نشده است، آن را دفع می‌کنند. و این از شگفت‌انگیزترین امور الهی در حق این گروه است که قائل به علم جزا نیستند و از علوم جز آنچه میزان‌هایشان از اعمال و استعدادات تعملی به آن‌ها داده است، نمی‌پذیرند. و این نقیض چیزی است که امر نزد اهل طریقت بر آن بنا شده است. و این کشفی خاص است که امثال ما به آن اختصاص یافته‌اند، و حمد از آن خداست بر این امر. اما ما و کسانی که در طریق ما هستند، هیچ‌یک از آنچه بر ما وارد می‌شود را رد نمی‌کنیم و به کلی دفع نمی‌کنیم، چه عمل و استعداد تعملی ما آن را اقتضا کند یا نکند. زیرا اقتضا نزد ما در هر چیزی لازم نیست، بلکه خداوند آنچه را می‌خواهد در هر محلی که می‌خواهد ایجاد می‌کند. و اگر خداوند بصیرت این گروهی که ذکر کردیم را نورانی می‌ساخت، حال خود را می‌دیدند و پند می‌گرفتند، زیرا آن‌ها جزا را تصدیق نمی‌کنند و از علوم جز آنچه میزان جزا از نفوسشان به آن‌ها داده است، نمی‌پذیرند و خودشان نمی‌دانند. و این جای حیرت است. همان‌گونه که ما نیز هیچ‌یک از آنچه خداوند به دست واسطه‌ای مذموم یا محمود به ما عطا کرده است، رد نمی‌کنیم، مانند آنچه سلیمان (علیه السلام) انجام داد، یا با ارتفاع واسطه‌ها، چه آن امر نهی شده باشد یا امر شده. زیرا خداوند به ما چنان قدرتی و علم سیاستی عطا کرده است که می‌دانیم چگونه بگیریم و هنگامی که گرفتیم، چگونه و در چه محلی آن را تصرف کنیم. و این مخصوص اهل سماع (شنیدن) از حق (الحق) به طور دائم است و این راه ماست و بزرگان ما بر آن عمل کرده‌اند. و به علم فراوان، عقل حاضر، مشاهده دائمی، و چشمی که خواب را نمی‌پذیرد و نمی‌شناسد، نیاز دارد. و به تحقق به آن، تحققی که در حال حس با او جاری باشد، و در حال خوابش به صورت خیال، و در حال فنا (الفناء) و غیبتش به صورت تحقق. و این مقامی عزیز است که مخصوص افراد (الأفراد) از ماست. و بیشتر علم انبیا از این علوم است که مستندی ندارند، و به همین دلیل نبوت اختصاصی از جانب خدا بود که نه با عمل و نه با تکلف به دست می‌آید. و ما این مقام را از عین منّت به ارث بردیم، پس از علومی که مستندی برای طلب آن‌ها نیست، به جز نبوت، بسیاری را به دست آوردیم که اسرار ما آن‌ها را می‌شناسند نه نفوس ما. به همین دلیل چیزی از آن‌ها بر ما ظاهر نمی‌شود، زیرا تعلقی به کون (الکون) ندارند. خداوند متعال می‌فرماید: **أَ لَمْ يَجِدْكَ يَتِيماً فَآوى‏** (آیا تو را یتیم نیافت و پناه داد؟) و **وَجَدَكَ ضَالًّا فَهَدى‏** (و تو را گمراه یافت و هدایت کرد؟) و **وَجَدَكَ عائِلًا فَأَغْنى‏** (و تو را نیازمند یافت و بی‌نیاز کرد؟) [ضحی: ۶-۸]. پس اصحاب ما در این سه حال و آنچه شبیه آن‌هاست اختلاف کردند که آیا این‌ها استعدادهایی برای آنچه از پناه دادن و هدایت و بی‌نیازی حاصل شد، بودند یا نه؟ و برخی از ما گفتند که استعداد جز از طریق تعمّل (کوشش) در آن حاصل نمی‌شود و آن‌ها اکثریت هستند. و برخی گفتند که استعداد ازلی است برای تحصیل امری، چه از طریق تعمّل باشد یا غیر تعمّل. پس اختلاف لفظی است و این همان اختلافی است که به اهل این طریقت نسبت داده می‌شود. و ممکن است استعداد برای شخصی که صاحب آن است، معلوم باشد که استعداد است و ممکن است معلوم نباشد. و تحقیق در این باره همان است که ذکر می‌کنیم: و آن این است که حقیقت استعداد، همان طلب است که شخص برای امر عظیمی از جانب خدا که برایش حاصل می‌شود، آماده باشد. پس این تعمّل نامیده می‌شود، زیرا استفعال است، مانند استخراج (بیرون کشیدن) و استطلاق (رها شدن) و استرسال (جاری شدن). اما اینکه او برای آنچه برایش حاصل شده، آماده باشد، باید در نفس خود بر آن باشد، نه به جعل جاعل. و عدم ممکن و عدم محال آن را پنهان کرده است. اگر عدم ممکن در نفس خود آماده پذیرش اثر مرجّح نبود، در یک زمان ترجیح به یکی از دو جانب و در زمان دیگر ترجیح جانب دیگر برای آن حاصل نمی‌شد. و اگر عدم محال در نفس خود آماده عدم پذیرش آنچه متضاد با آن است نبود، آن را می‌پذیرفت. و همچنین کسی که وجوب وجودی برای ذاتش ثابت است. پس این تحقیق مسئله در استعداد است و فرق بین آن و إعداد (آماده‌سازی). و إعداد (الإعداد) باید وجودی و عدمی باشد، و نه وجودی و نه عدمی، مانند نسبت‌ها. پس این فصل از این منزل را به طور کامل بیان کردیم و از فصول آن آنچه باقی مانده است را ذکر می‌کنیم، و آن معرفت علمی است که فقیر با فقر و مسکنت خود آن را می‌طلبد، که چیست؟ و اگر حاصل شد، آیا با آن بی‌نیازی برای او حاصل می‌شود یا خیر؟ و آیا برای قومی راه معلومی به سوی آن هست یا خیر؟ و آیا بر عالمانی که به آن آگاهند واجب است که مردم را به سلوک آن ترغیب کنند یا خیر؟\n\n### [نیازمندی (افتقار) در هر آنچه غیر خداست، امری ذاتی است]\n\nپس بدان که افتقار (الافتقار) در هر آنچه غیر خداست، امری ذاتی (أمر ذاتي) است که از نظر ذوق و علم صحیح، امکان جدایی از آن نیست، جز اینکه مقاصد آن در تعیین آنچه این فقیر به آن نیازمند است و معنایی که در آن نیازمند است، متفاوت است.\n\n### [فقر و مسکنت صفتی ذاتی است]\n\nپس بدان که چون فقر (الفقر) و مسکنت (المسکنة) در علم ثابت شد که صفتی ذاتیه (صفة ذاتية) است، متعلق آن که در آن نیازمند شده، طلب استمرار وجود خود و استمرار نعمت برای خود به کامل‌ترین وجه است، به طوری که نقیض در آن راه نیابد. پس اهل این طریقت، این را نه حالاً و نه عقداً جز از خداوند متعال ندیدند. پس در این امر به او نیازمند شدند نه به غیر او، سبحانه.\nو افتقار آن‌ها به او در وجودشان صحیح نیست، زیرا آن‌ها موجودند. بلکه این افتقار از آن‌ها برای وجودشان در حال عدمشان بود، به همین دلیل او آن‌ها را موجود ساخت. پس متعلق افتقار همیشه عدم است تا خداوند آن را برایشان ایجاد کند، زیرا ایجاد آن به دست اوست. اما غیر ما، این را از خدا عقداً دیدند نه حالاً، و آن‌ها مسلمانان اکثریت هستند، عالم و جاهلشان. و از مردم کسانی هستند که این را از خدا اصلی می‌بینند نه عقداً و نه حالاً، و آن‌ها قائلان به علل و معلولات هستند و دورترین گروه‌ها از خدا می‌باشند. و از مردم کسانی هستند که این را از خدا نه اصلی، نه عقداً و نه حالاً می‌بینند، و آن‌ها معطله (منکران صفات) هستند. و هیچ گروهی از آنچه ذکر کردیم نیست مگر اینکه افتقار را از ذات خود می‌یابد. و محال است که بی‌نیازی مطلق از جانب خدا برای هیچ‌یک از این گروه‌ها هرگز حاصل شود، اما ممکن است بی‌نیازی مقید برای آن‌ها همیشه حاصل شود که از آن جدا نمی‌شوند. و اما فرض راه به سوی آن، نیز ذاتی است از حیث اینکه راه است. و تنها چیزی که اکتساب به آن تعلق می‌گیرد، سلوک خاصی در این راه است برای کسی که به آن نیازمند است. و چون سلوک به این مرتبه باشد، ترغیب به آن و بیان آن برای کسی که جاهل است، واجب می‌شود. پس کسی که از بیان آن برای کسی که مستحق آن است، روی گرداند، در حالی که به آن عالم است، صاحب حرمان و خذلان است. و پیامبر (علیه السلام) به مرتبه‌ای از مراتب آن تنبیه فرموده است:\nبا این قول خود (صلی الله علیه و سلم): **مَنْ سُئِلَ عَنْ عِلْمٍ فَكَتَمَهُ أَلْجَمَهُ اللهُ بِلِجَامٍ مِنْ نَارٍ** (هر کس از علمی سؤال شود و آن را کتمان کند، خداوند در روز قیامت دهنه آتشین بر او می‌زند).\nو سؤال ممکن است لفظی یا حالی باشد. و مسئول‌عنه که وعید به آن تعلق گرفته است، باید سؤال از آن بر او واجب باشد. پس باید جواب دادن به آن بر عالم واجب باشد. و سؤالات افتقار همگی به این مرتبه هستند. خداوند متعال می‌فرماید: **يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله** (ای مردم، شما نیازمندان به سوی خدا هستید) [فاطر: ۱۵]. در این خطاب، خداوند هر اسمی را که برای کسی است که در آنچه به آن نیازمند است، به او نیازمند می‌شود، نام می‌برد. و این از باب غیرت الهی است تا به غیر او نیازمند نشود. و شرف در آن برای کسی است که به آن عالم است. و در این خطاب، هجو (سرزنش) برای مردم است، زیرا این امر را نشناختند مگر پس از تعریف الهی در خطاب شرعی بر زبان رسولان (علیهم السلام). با این حال، بسیاری از مردم آن را انکار کردند و آن را به امور معینی که در آن به او نیازمند می‌شوند، اختصاص دادند، نه در همه امور از لوازم تابع وجود که با آنات (لحظات) برای خلق عارض می‌شود. و شایسته بود اگر ما به فهم این آیه متحقق بودیم، به جای اشک، خون می‌گریستیم، زیرا این امر را از نفوس خود ندانستیم تا اینکه تعریف الهی به آن واقع شد. پس حال کسی که آن را انکار کرد و تأویل نمود و تخصیص داد، چگونه است؟ پس ما خلاصه‌ای از فصل دوم مربوط به این منزل را بیان کردیم. و اما فصل سوم از فصول این منزل، پس بدان که خداوند متعال به بندگان خود شناسانده است که برای او حضرات معینی برای اموری وجود دارد که آن‌ها را به طلب ورود به آن‌ها و تحصیل آن‌ها از او فراخوانده و آن‌ها را نیازمند به آن‌ها قرار داده است. پس برخی از مردم آن را پذیرفتند و برخی به دلیل جهل به آن، آن را رد کردند. از جمله آن‌ها، حضرت مشاهده (حضرة المشاهدة) است که بر منازل مختلفی است، اگرچه یک حضرت واحد آن‌ها را در بر می‌گیرد. پس برخی او را در اشیا مشاهده می‌کنند، و برخی قبل از اشیا، و برخی بعد از آن‌ها، و برخی همراه آن‌ها، و برخی او را عین آن‌ها مشاهده می‌کنند، بر اختلاف مقامات بسیاری که در آن است و اهل طریق خدا، صاحبان ذوق و شرب، آن را می‌دانند. و از جمله آن‌ها، حضرت مکالمه (حضرة المکالمة)، حضرت کلام (حضرة الکلام)، حضرت سماع (حضرة السماع)، حضرت تعلیم (حضرة التعلیم)، حضرت تکوین (حضرة التکوین) و غیره است، زیرا آن‌ها بسیارند و این تألیف گنجایش ذکر آن‌ها را ندارد. پس حضرت مکالمه از خصائص این منزل است. پس کسی که از آن روی گرداند، از معارف الهی و التذاذ به محادثه ربانی که در بر دارد، محروم شده است. و از کسانی بوده که درباره‌شان گفته شده است: **ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ** (هیچ تذکری از پروردگارشان به آن‌ها نمی‌رسد) و از رحمان (الرحمن) بر حسب تجلی (التجلی) **مُحْدَثٍ إِلَّا كانُوا عَنْهُ مُعْرِضِينَ** (نوپدیدی مگر اینکه از آن روی‌گردان بودند) [شعراء: ۵]. و این یک گروه معین است. و گروه دیگر **اسْتَمَعُوهُ وهُمْ يَلْعَبُونَ** (آن را شنیدند در حالی که بازی می‌کردند) [انبیاء: ۲]. پس اهل طریقت ما هنگام ورود این کلام، به آنچه آن‌ها را از فوایدی که در بر دارد، مشغول نمی‌کند. اگر جواب خواست، پروردگارشان را جواب می‌دهند، و اگر غیر آن خواست، به انجام آنچه آن خطاب اقتضا می‌کند، مبادرت می‌ورزند. و در آن حال، دزدانه به متکلم نگاه می‌کنند تا چشمانشان به آن روشن شود، همان‌گونه که نفوسشان از حیث سماع متنعم شده است. جز اینکه در این حال به نظر (مشاهده) متحقق نمی‌شوند، زیرا می‌دانند که مراد حق (الحق) در آن حال، فهمیدن از اوست در آنچه با آن‌ها سخن می‌گوید. پس از نظر کردن، با وجود شوقشان، می‌ترسند که آن‌ها را از آنچه به آن مکلف شده‌اند، یعنی فهمیدن، فانی سازد. در این صورت، از کسانی خواهند بود که بهره‌های نفس خود را بر آنچه حق از آن‌ها خواسته است، ترجیح داده‌اند. پس آن‌ها در هر دو حال، بندگان فقیر هستند. جز اینکه ادب در هر یک از این حضرات، وفای به چیزی است که آن حضرت که بنده در آن اقامه شده، مستحق آن است. و مطلوب او حضرت دیگری است که غیر از این است، پس عجله نمی‌کند تا محروم شود. و **وَما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ مِنْ وَراءِ حِجابٍ أَوْ يُرْسِلَ رَسُولًا** (و برای هیچ بشری نیست که خداوند با او سخن بگوید مگر از طریق وحی یا از پشت حجاب یا رسولی بفرستد) [شوری: ۵۱] که از جانب او در کلام نیابت کند و او ترجمان است. خداوند متعال می‌فرماید: **فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله** (پس او را پناه ده تا کلام خدا را بشنود) [توبه: ۶]، یعنی بر زبان ترجمان که رسول خدا (صلی الله علیه و سلم) است. شنیدم که یکی از شیوخ می‌گفت: تا زمانی که در بشریت خود است، کلام برای او از پشت حجاب است، اما هنگامی که از بشریت خود خارج شود، حجاب برداشته می‌شود. و این شیخ، عبدالعزیز بن ابی بکر مهدوی معروف به ابن الکره است که این را از او در منزلی در تونس شنیدم، رحمت خدا بر او باد. پس در آن هم درست گفت و هم خطا کرد. اما درستی او، اثبات و تقریر کلام از پشت حجاب است و اینکه مشاهده و کلام را با هم جمع نکرده است. و اما خطای او، قولش است که حجاب برداشته می‌شود و آن را مقید نکرد. بلکه باید گفت حجاب بشریت او برداشته می‌شود. و شکی نیست که پشت حجاب بشریت او، حجاب‌های دیگری نیز هست. پس ممکن است حجاب بشریت برداشته شود و کلام از جانب خدا برای این بنده از پشت حجاب دیگری واقع شود که بالاترین حجاب‌ها و نزدیک‌ترین آن‌ها به خدا و دورترین آن‌ها از مخلوق است. مظاهر الهی که تجلی (التجلی) در آن‌ها واقع می‌شود، اگر محدود و معتاد به مشاهده باشند، مانند ظهور فرشته در صورت مردی که با او بر اعتدال عادت و حد سخن می‌گوید. و گاهی بر او تجلی کرده و افق را پر کرده است، پس از شدت آن غش کرده است، به دلیل عدم اعتیاد، اگرچه حد وجود داشته است. پس حال کسی که نه حدی دیده و نه عادتی داشته، چگونه است؟ پس ممکن است مظاهر غیر محدود و غیر معتاد باشند، و ممکن است محدود و غیر معتاد باشند، و ممکن است محدود و معتاد باشند. و احوال مشاهده‌کنندگان در هر یک از این حضرات متفاوت است. پس کسی که از حضرت مکالمه روی گرداند، به اهل خسران پیوسته است، اگرچه سعادتمند باشد، اما پس از شقاوت عظیم. و همانا از مردم کسانی هستند از صاحبان ادعاوی در این طریقت که خداوند درباره آن‌ها فرموده است: **وقَدْ خابَ من دَسَّاها** (و هر که آن را آلوده ساخت، زیان دید) [شمس: ۱۰]، هنگامی که **أَفْلَحَ من زَكَّاها** (هر که آن را تزکیه کرد، رستگار شد) [شمس: ۹]. پس گمان می‌کنند که با خدا در خلقش سخن می‌گویند و از او در خلقش می‌شنوند، در حالی که او در نفس خود با نفس خود است و خبری از پروردگارش ندارد، زیرا او را نمی‌شناسد و نمی‌داند چگونه از او می‌شنود و چه می‌شنود. پس صاحبان ادعا در این طریقت مانند منافقان در میان مسلمانان هستند، زیرا در صورت ظاهری با آن‌ها شریک شده‌اند و با بواطن خود جدا شده‌اند. پس آن‌ها با مردم هستند نه با حق. **فَوَيْلٌ لِلَّذِينَ يَكْتُبُونَ الْكِتابَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هذا من عِنْدِ الله** (پس وای بر کسانی که کتاب را با دست‌های خود می‌نویسند، سپس می‌گویند این از نزد خداست) [بقره: ۷۹]. و به خدا سوگند که آن از نزد اوست، اما نه از آن وجهی که گمان می‌کنند. و به همین دلیل با آنچه گفتند، شقی شدند، اگرچه به آن اعتقاد نداشتند. و دیگری با قولش که آن از نزد خداست و اعتقادش به آن بر غیر وجهی که شقاوت می‌دهد، سعادتمند شد. پس قول یکی است و حکم متفاوت. پس منزه است کسی که علم خود را از قومی پنهان کرد و بر دیگران آشکار ساخت. **لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ** (هیچ معبودی جز او نیست، عزیز و حکیم است) [آل عمران: ۶]. و امر جز این نخواهد بود، زیرا این‌گونه واقع شده است و جز آنچه علم داشته که واقع می‌شود، واقع نمی‌شود، زیرا در نفس الامر چنین است و خلاف آن جایز نیست. و در اینجا گرهی است که جز کشف اختصاصی آن را نمی‌گشاید و عبارت آن را حل نمی‌کند. و چون این را فهمیدی،\n\n### [همکاری بر نیکی و پرهیزگاری]\n\nپس بدان که از آخرین فصول این منزل، همکاری **عَلَى الْبِرِّ والتَّقْوى‏** (بر نیکی و پرهیزگاری) [مائده: ۲] است. زیرا از آن علمی شریف حاصل می‌شود که به معرفت اسباب (الأسباب) وضع شده در عالم مربوط است. و اینکه رفع عین آن‌ها صحیح نیست، اگر سبب، علت (العلة) باشد. اما اگر علت نباشد، ممکن است رفع عین آن صحیح باشد با بقای لازمه آن، اما نه از حیث اینکه لازمه آن است، بلکه از حیث عین لازمه. پس آن لازمه، از حیث اینکه لازمه آن است بر طریق مختص، رفع نمی‌شود. و آن از حیث عین خود، اگرچه لازمه غیر خود باشد، اثرش برای عینش است، پس حکم آن برای عینش یافت می‌شود. پس در اسبابی که رفع می‌شوند و لازمه یافت می‌شود، فعل برای عین آن است، مانند غذای معتاد بر طریق مختص به آن که سیری با خوردن آن ملازم است. و ممکن است سیری از غیر غذا و خوردن باشد. و مانند سبب علّی، وجود متصف شدن ذات به سیر بودن به دلیل وجود سیری است. پس اگر سیری را رفع کنی، سیر بودن آن رفع می‌شود. پس از اسباب، آن است که رفع آن‌ها صحیح است و آن است که صحیح نیست. و تقریر همه آن‌ها در جای خود و بر حد خود، بر آنچه واضع آن مقرر کرده است، برای اکابر اولی‌تر است. و آن‌ها با اعتماد از عوام جدا می‌شوند. پس اکابر در هیچ‌یک از اشیا، اگر به اعتماد توصیف شوند، جز بر خدا اعتماد ندارند. پس کسی که وجود اسباب را منع کند، آنچه را که حق وجود آن را مقرر کرده، منع کرده است. پس نزد گروه عالی، مذمت به او می‌رسد. و این نقص در مقام، کمال در حال، ستوده در سلوک، و مذموم در غایت است. و **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند) [احزاب: ۴]."
  },
  "page_count": 5
}