{
  "id": 560,
  "title": {
    "ar": "الباب الموفي ستين وخمسمائة في وصية حكمية ينتفع بها المريد السالك والواصل ومن وقف عليها إن شاء الله تعالى",
    "en": "Chapter Five Hundred and Sixty: Concerning a Sagely Injunction (وصية حكمية) by which benefit is gained by the traversing aspirant (المريد السالك), the accomplished one (الواصل), and whoever studies it, if God Almighty wills.",
    "ur": "باب نمبر پانچ سو ساٹھ: ایک حکیمانہ وصیت کے بیان میں جس سے مرید سالک، واصل، اور ہر وہ شخص فائدہ اٹھائے گا جو اس پر مطلع ہو، اگر اللہ تعالیٰ نے چاہا۔",
    "fa": "باب پانصد و شصتم در وصیتی حکیمانه که سالک مرید و واصل و هر کس که بر آن آگاه شود، ان‌شاءالله، از آن بهره‌مند می‌گردد."
  },
  "content": {
    "ar": "## (الباب الموفي ستين وخمسمائة في وصية حكمية ينتفع بها المريد السالك والواصل ومن وقف عليها إن شاء الله تعالى)\n\n\n> وصى الإله وأوصت رسله فلذا *** كان التأسي بهم من أفضل العمل‏\n\n\n> لو لا الوصية كان الخلق في عمه *** وبالوصية دار الملك في الدول‏\n\n\n> فاعمل عليها ولا تهمل طريقتها *** إن الوصية حكم الله في الأزل‏\n\n\n> ذكرت قوما بما أوصى الإله به *** وليس إحداث أمر في الوصية لي‏\n\n\n> فلم يكن غير ما قالوه أو شرعوا *** من السلوك بهم في أقوم السبل‏\n> فهدى أحمد عين الدين أجمعه *** وملة المصطفى من أنور الملل‏\n\n\n> لم تطمس العين بل أعطته قوتها *** حتى يقيم الذي فيه من الميل‏\n\n\n> وخذ بسرك عنه من مراكزه *** علوا إلى القمر العالي إلى زحل‏\n\n\n> إلى الثوابت لا تنزل بساحتها *** وانهض إلى الدرج العالي من الحمل‏\n\n\n> ومنه للقدم الكرسي ثم إلى *** العرش المحيط إلى الأشكال والمثل‏\n\n\n> إلى الطبيعة للنفس النزيهة للعقل *** المقيد بالأعراض والعلل‏\n\n\n> إلى العماء الذي ما فوقه نفس *** منه إلى المنزل المنعوت بالأزل‏\n\n\n> وانظر إلى الجبل الراسي على الجبل *** وقد رآه فلم يبرح ولم يزل‏\n\n\n> لو لا العلو الذي في السفل ما سفلت *** وجوهنا تطلب المري بالمقل‏\n\n\n> لذلكم شرع الله السجود لنا *** فنشهد الحق في علو وفي سفل‏\n\n\n> هذي وصيتنا إن كنت ذا نظر *** فإنها حيلة من أحسن الحيل‏\n\n\n> ترى بها كل معلوم بصورته *** على حقيقة ما هو لا على البدل‏\n\n\n> حتى ترى المنظر الأعلى وليس له *** سواك مجلى فلا تبرح ولا تزل‏\n\n\n> فإن دعاك إلى عين شربها *** فلا تجبه وكن منه على وجل‏\n\n\n> إنا إناث لما فينا يولده *** فلنحمد الله ما في الكون من رجل‏\n\n\n> إن الرجال الذين العرف عينهم *** هم الإناث وهم نفسي وهم أملي‏\n\n\nوصية قال الله تعالى في الوصية العامة\n\n\nشَرَعَ لَكُمْ من الدِّينِ ما وَصَّى به نُوحاً والَّذِي أَوْحَيْنا إِلَيْكَ وما وَصَّيْنا به إِبْراهِيمَ ومُوسى‏ وعِيسى‏ أَنْ أَقِيمُوا الدِّينَ ولا تَتَفَرَّقُوا فِيهِ فأمر الحق بإقامة الدين وهو شرع الوقت في كل زمان وملة وأن يجتمع عليه ولا يتفرق فيه‏\n\n\nفإن يد الله مع الجماعة وإنما يأكل الذئب القاصية\n\n\nوهي البعيدة التي شردت وانفردت عما هي الجماعة عليه وحكمة ذلك أن الله لا يعقل إلها إلا من حيث أسماؤه الحسنى لا من حيث هو معرى عن هذه الأسماء الحسنى فلا بد من توحيد عينه وكثرة أسمائه وبالمجموع هو الإله فيد الله وهي القوة مع الجماعة أوصى حكيم أولاده عند موته وكانوا جماعة فقال لهم ائتوني بعصي فجمعها وقال لهم اكسروها وهي مجموعة فلم يقدروا على ذلك ثم فرقا فقال لهم خذوا واحدة واحدة فاكسروها فكسروها فقال لهم هكذا أنتم بعدي لن تغلبوا ما اجتمعتم فإذا تفرقتم تمكن منكم عدوكم فأبادكم وكذلك القائمون بالدين إذا اجتمعوا على إقامة الدين ولم يتفرقوا فيه لم يقهرهم عدو وكذلك الإنسان في نفسه إذا اجتمع في نفسه على إقامة دين الله لم يغلبه شيطان من الإنس ولا من الجن بما يوسوس به إليه مع مساعدة الايمان والملك بلمته له وصية إذا عصيت الله تعالى بموضع فلا تبرح من ذلك الموضع حتى تعمل فيه طاعة وتقيم فيه عبادة فكما يشهد عليك إن استشهد يشهد لك وحينئذ تنتزح عنه وكذلك ثوبك إن عصيت الله فيه فكن كما ذكرته لك اعبد الله فيه وكذلك ما يفارقك منك من قص شارب وحلق عانة وقص أظفار وتسريح شعر وتنقية وسخ لا يفارقك شي‏ء من ذلك من بدنك إلا وأنت على طهارة وذكر الله عز وجل فإنه يسأل عنك كيف تركك وأقل عبادة تقدر عليها عند هذا كله إن تدعو الله في أن يتوب عليك عن أمره تعالى حتى تكون مؤديا واجبا في امتثالك أمر الله وهو قوله وقالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ فأمرك أن تدعوه ثم قال في هذه الآية إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبادَتِي يعني هنا بالعبادة الدعاء أي من يستكبر عن الذلة إلي والمسكنة فإن الدعاء سماه عبادة والعبادة ذلة وخضوع ومسكنة سَيَدْخُلُونَ جَهَنَّمَ داخِرِينَ أي أذلاء فإذا فعلوا ما أمروا به جازاهم الله بدخول الجنة أعزاء ولقد دخلت يوما الحمام لغسل طرا علي سحرا فلقيت فيه نجم الدين أبا المعالي ابن اللهيب وكان صاحبي‏\nفاستدعى بالحلاق يحلق رأسه فصحت به يا أبا المعالي فقال لي من فوره قبل أن أتكلم إني على طهارة قد فهمت عنك فتعجبت من حضوره وسرعة فهمه ومراعاته الموطن وقرائن الأحوال وما يعرفه مني في ذلك فقلت له بارك الله فيك والله ما صحت بك إلا لتكون على طهارة وذكر عند مفارقة شعرك فدعا لي ثم حلق رأسه ومثل هذا قد أغفله الناس بل يقولون إذا عصيت الله في موضع فتحول عنه لأنهم يخافون عليك إن تذكرك البقعة بالمعصية فتستحليها فتزيد ذنبا إلى ذنب فما ذكروا ذلك إلا شفقة ولكن فاتهم علم كبير فأطع الله فيه وحينئذ تتحول عنه فتجمع بين ما قالوه وبين ما وصيتك به وكلما ذكرت خطيئة أتيتها فتب عنها عقيب ذكرك إياها واستغفر الله منها واذكر الله عندها بحسب ما كانت تلك المعصية\n\n\nفإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول اتبع السيئة الحسنة تمحها\n\n\nوقال تعالى إِنَّ الْحَسَناتِ يُذْهِبْنَ السَّيِّئاتِ ولكن يكون لك ميزان في ذلك تعرف به مناسبات السيئات والحسنات التي تزنها\n\n\nوصية حسن الظن بربك على كل حال‏\n\n\nولا تسي‏ء الظن به فإنك لا تدري هل أنت على آخر أنفاسك في كل نفس يخرج منك فتموت فتلقى الله على حسن ظن به لا على سوء ظن فإنك لا تدري لعل الله يقبضك في ذلك النفس الخارج إليه ودع عنك ما قال من قال بسوء الظن في حياتك وحسن الظن بالله عند موتك وهذا عند العلماء بالله مجهول فإنهم مع الله بأنفاسهم وفيه من الفائدة والعلم بالله إنك وفيت في ذلك الحق حقه فإن من حق الله عليك الايمان بقوله ونُنْشِئَكُمْ في ما لا تَعْلَمُونَ فلعل الله ينشئك في النفس الذي تظن أنه يأتيك نشأة الموت والانقلاب إليه وأنت على سوء ظن بربك فتلقاه على ذلك وقد ثبت عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيما رواه عن ربه أنه عز وجل يقول أنا عند ظن عبدي بي فليظن بي خيرا\n\n\nوما خص وقتا من وقت واجعل ظنك بالله علما بأنه يعفو ويغفر ويتجاوز وليكن داعيك الإلهي إلى هذا الظن قوله تعالى يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله فنهاك وما نهاك عنه يجب عليك الانتهاء عنه ثم أخبر وخبره صدق لا يدخله نسخ فإنه لو دخله نسخ لكان كذبا والكذب على الله محال فقال إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً وما خص ذنبا من ذنب وأكدها بقوله جَمِيعاً ثم تمم فقال إِنَّهُ هُوَ فجاء بالضمير الذي يعود عليه الْغَفُورُ الرَّحِيمُ من كونه سبقت رحمته غضبه وكذلك قال الَّذِينَ أَسْرَفُوا ولم يعين إسرافا من إسراف وجاء بالاسم الناقص الذي يعم كل مسرف ثم إضافة العباد إليه لأنهم عباده كما قال الحق عن العبد الصالح عيسى عليه السلام إنه قال إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ فأضافهم إليه تعالى وكفى شرفا شرف الإضافة إلى الله تعالى‏\n\n\nوصية عليكم بذكر الله في السر والعلن‏\n\n\nوفي أنفسكم وفي الملإ فإن الله يقول فَاذْكُرُونِي أَذْكُرْكُمْ فجعل جواب الذكر من العبد الذكر من الله وأي ضراء على العبد أضر من الذنب وكان يقول صَلَّى اللهُ عَليهِ وسَلَّم في حال الضراء الحمد لله على كل حال وفي حال السراء الحمد لله المنعم المفضل‏\n\n\nفإنك إذا أشعرت قلبك ذكر الله دائما في كل حال لا بد أن يستنير قلبك بنور الذكر فيرزقك ذلك النور الكشف فإنه بالنور يقع الكشف للأشياء وإذا جاء الكشف جاء الحياء يصحبه دليلك على ذلك استحياؤك من جارك وممن ترى له حقا وقدرا ولا شك أن الايمان يعطيك تعظيم الحق عندك وكلامنا إنما هو مع المؤمنين ووصيتنا إنما هي لكل مسلم مؤمن بالله وبما جاء من عنده‏\n\n\nوالله يقول في الخبر المأثور الصحيح عنه الحديث وفيه وأنا معه يعني مع العبد حين يذكرني إن ذكرني في نفسه ذكرته في نفسي وإن ذكرني في ملأ ذكرته في ملأ خير منهم‏\n\n\nوقال تعالى والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ وأكبر الذكر ذكر الله على كل حال وصية ثابر على إتيان جميع القرب جهد الاستطاعة في كل زمان وحال بما يخاطبك به الحق بلسان ذلك الزمان ولسان ذلك الحال فإنك إن كنت مؤمنا فلن تخلص لك معصية أبدا من غير أن تخالطها طاعة فإنك مؤمن بها إنها معصية فإن أضفت إلى هذا التخليط استغفار أو توبة فطاعة على طاعة وقربة إلى قربة فيقوي جزء الطاعة التي خلط به العمل السيئ والايمان من أقوى القرب وأعظمها عند الله فإنه الأساس الذي أنبنى عليه جميع القرب ومن الايمان حكمك على الله بما حكم به على نفسه‏\n\n\nفي الخبر الذي صح عنه تعالى الذي ذكر فيه وإن تقرب مني شبرا تقربت منه ذراعا وإن تقرب إلي ذراعا تقربت منه باعا وإن أتاني يمشي أتيته هرولة\n\n\nوسبب هذا التضعيف من الله والأقل من العبد والأضعف فإن العبد لا بد له أن يتثبت من أجل النية بالقربة إلى الله في الفعل وأنه‏\nي مأمور بأن يزن أفعاله بميزان الشرع فلا بد من التثبط فيه وإن أسرع ووصف بالسرعة فإنما سرعته في إقامة الميزان في فعله ذلك لا في نفس الفعل فإن إقامة الميزان به تصح المعاملة وقرب الله لا يحتاج إلى ميزان فإن ميزان الحق الموضوع الذي بيده هو الميزان الذي وزنت أنت به ذلك الفعل الذي تطلب به القربة إلى الله فلا بد من هذا نعته أن يكون في قربه منك أقوى وأكثر من قربك منه فوصف نفسه بأنه يقرب منك في قربك منه ضعف ما قربت منه مثلا بمثل لأنك على الصورة خلقت وأقل خلافة لك خلافتك على ذاتك فأنت خليفته في أرض بدنك ورعيتك جوارحك وقواك الظاهرة والباطنة فعين قربه منك قربك منه وزيادة وهي ما قال من الذراع والباع والهرولة والشبر إلى الشبر ذراع والذراع إلى الذراع باع والمشي إذا ضاعفته هرولة فهو في الأول الذي هو قربك منه وهو في الآخر الذي هو قربه منك ف هُوَ الْأَوَّلُ والْآخِرُ وهذا هو القرب المناسب فإن القرب الإلهي من جميع الخلق غير هذا وهو قوله ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ فما أريد هنا ذلك القرب وإنما أريد القرب الذي هو جزاء قرب العبد من الله وليس للعبد قرب من الله إلا بالإيمان بما جاء من عند الله بعد الايمان بالله وبالمبلغ عن الله‏\n\n\nألزم نفسك الحديث بعمل الخير وإن لم تفعل ومهما حدثت نفسك بشر فاعزم على ترك ذلك لله إلا أن يغلبك القدر السابق والقضاء اللاحق فإن الله إذا لم يقض عليك بإتيان ذلك الشي‏ء الذي حدثت به نفسك كتبه لك حسنة وقد ثبت عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عن ربه عز وجل إنه يقول إذا تحدث عبدي بأن يعمل حسنة فأنا أكتبها له حسنة ما لم يعملها\n\n\nوكلمة ما هنا ظرفية فكل زمان يمر عليه في الحديث بعمل هذه الحسنة وإن لم يعملها فإن الله يكتبها له حسنة واحدة في كل زمان يصحبه الحديث بها فيه بلغت تلك الأزمنة من العدد ما بلغت فله بكل زمان حديث حسنة ولهذا قال ما لم يعملها ثم‏\n\n\nقال تعالى فإذا عملها فأنا أكتبها له بعشر أمثالها\n\n\nومن هنا فرض العشر فيما سقت السماء إن علمت فإن كانت من الحسنات المتعدية التي لها بقاء فإن الأجر يتجدد عليها ما بقيت إلى يوم القيامة كالصدقة الجارية مثل الأوقاف والعلم الذي يبثه في الناس والسنة الحسنة وأمثال ذلك ثم تمم نعمه على عباده‏\n\n\nفقال تعالى وإذا تحدث بأن يعمل سيئة فأنا أغفرها له ما لم يعملها\n\n\nوما هنا ظرفية كما كانت في الحسنة سواء والحكم كالحكم في الحديث والجزاء بالغا ما بلغ‏\n\n\nثم قال فإذا عملها فأنا أكتبها له بمثلها\n\n\nفجعل العدل في السيئة والفضل في الحسنة وهو قوله لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ وهو الفضل وهو ما زاد على المثل ثم أخبر تعالى عن الملائكة أنها تقول بحكم الأصل عليها الذي نطقها في حق أبينا آدم بقولها أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ فما ذكرت إلا مساوينا وما تعرضت للحسن من ذلك فإن الملأ الأعلى تغلب عليه الغيرة على جناب الله أن يهتضم وعلمت من هذه النشأة العنصرية أنها لا بد أن تخالف ربها لما هي عليه من حقيقتها وذلك عندها بالذوق من ذاتها وإنما هي في نشأتنا أظهر ولو لا إن الملائكة في نشأتها على صورة نشأتنا ما ذكر الله عنهم أنهم يَخْتَصِمُونَ والخصام ما يكون إلا مع الأضداد وما ذكر الله عن الملائكة في حقنا أنهم يقولون ذاك عبدك يريد أن يعمل حسنة فانظر قوة هذا الأصل ما أحكمه لمن نظر ومن هنا تعلم فضل الإنسان إذا ذكر خيرا في أحد وسكت عن شره أين تكون درجته مع القصد الجميل من الملائكة فيما ذكروه ولكن نبهتك على ما نبهتك عليه من ذلك لتعرف نشأتهم وما جبلوا عليه ف كُلٌّ يَعْمَلُ عَلى‏ شاكِلَتِهِ كما\n\n\nقال تعالى وأخبر أن الملائكة تقول ذاك عبدك فلان يريد أن يعمل سيئة وهو أبصر به فقال ارقبوه فإن عملها فاكتبوها له بمثلها وإن تركها فاكتبوها له حسنة إنه إنما تركها من جرائي‏\n\n\nأي من أجلي فالملائكة المذكورة هنا هم الذين قال الله لنا فيهم إِنَّ عَلَيْكُمْ لَحافِظِينَ كِراماً كاتِبِينَ فالمرتبة والتولية أعطتهم أن يتكلموا بما تكلموا به فلهم كتابة الحسن من غير تعريف بما تقدم الله إليهم به في ذلك ويتكلمون في السيئة لما يعلمونه من فضل الله وتجاوزه ولو لا ما تكلموا في ذلك ما عرفنا ما هو الأمر فيه عند الله مثل ما يقولونه في مجالس الذكر في الشخص الذي يأتيها إلى حاجته لا لأجل الذكر فأطلق الله للجميع المغفرة وقال هم القوم لا يشقى جليسهم فلو لا سؤالهم وتعريفهم بهم ما عرفنا حكم الله فيهم فكلامهم عليه السلام تعليم ورحمة وإن كان ظاهرة كما يسبق إلى الأفهام القاصرة مع الأصل الذي نبهناك عليه‏\nوقد قال الله في الحسنة والسيئة من جاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثالِها وأزيد ومن جاءَ بِالسَّيِّئَةِ فَلا يُجْزى‏ إِلَّا مِثْلَها وأغفر بعد الجزاء لقوم وقبل الجزاء لقوم آخرين فلا بد من المغفرة لكل مسرف على نفسه وإن لم يتب فمن تحقق بهذه الوصية عرف النسبة بين النشأة الإنسانية والملكية وأن الأصل واحد كما أن ربنا واحد وله الأسماء المتقابلة فكان الوجود على صورة الأسماء\n\n\n(وصية) ثابر على كلمة الإسلام‏\n\n\nوهي قولك لا إله إلا الله فإنها أفضل الأذكار بما تحوي عليه من زيادة علم وقال صَلَّى اللهُ عَليهِ وسَلَّم أفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله‏\n\n\nفهي كلمة جمعت بين النفي والإثبات والقسمة منحصرة فلا يعرف ما يحوي عليه هذه الكلمة إلا من عرف وزنها وما تزن كما ورد في الخبر الذي نذكره في الدلالة عليها فاعلم أنها كلمة توحيد والتوحيد لا يماثله شي‏ء إذ لو ماثله شي‏ء ما كان واحد أو لكان اثنين فصاعدا فما ثم ما يزنه فإنه ما يزنه إلا المعادل والمماثل وما ثم مماثل ولا معادل فذلك هو المانع الذي منع لا إله إلا الله أن تدخل الميزان فإن العامة من العلماء يرون أن الشرك الذي هو يقابل التوحيد لا يصح وجود القول به من العبد مع وجود التوحيد فالإنسان إما مشرك وإما موحد فلا يزن التوحيد إلا الشرك فلا يجتمعان في ميزان وعندنا إنما لم يدخل في الميزان لما ورد في الخبر لمن فهمه واعتبره وهو خبر صحيح عن الله يقول الله لو أن السموات السبع وعامرهن غيري والأرضين السبع وعامرهن غيري في كفة ولا إله إلا الله في كفة مالت بهن لا إله إلا الله فما ذكر إلا السموات والأرض لأن الميزان ليس له موضع إلا ما تحت مقعر فلك الكواكب الثابتة من السدرة المنتهى التي ينتهي إليها أعمال العباد ولهذه الأعمال وضع الميزان فلا تتعدى الميزان الموضع الذي لا يتعداه الأعمال ثم قال وعامرهن غيري وما لها عامر إلا الله فالخبير تكفيه الإشارة وفي لسان العموم من علماء الرسوم يعني بالغير الشريك الذي أثبته المشرك لو كان له اشتراك في الخلق لكانت لا إله إلا الله تميل به في الميزان لأن لا إله إلا الله الأقوى على كل حال لكون المشرك يرجح جانب الله تعالى على جانب الذي أشرك به فقال فيهم إنهم قالوا ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فإذا رفع ميزان الوجود لا ميزان التوحيد دخلت لا إله إلا الله فيه وقد تدخل في ميزان توحيد العظمة وهو توحيد المشركين فتزنه لا إله إلا الله وتميل به فإنه إذا لم يكن العامر غير الله فلا تميل وعينه ما ذكره إنما هو الله قال أين تميل وما ثم إلا واحد في الكفتين وأما صاحب السجلات فما مالت الكفة إلا بالبطاقة لأنها هي التي حواها الميزان من كون لا إله إلا الله يلفظ بها قائلها فكتبها الملك فهي لا إله إلا الله المكتوبة المخلوقة في النطق ولو وضعت لكل أحد ما دخل النار من تلفظ بتوحيد وإنما أراد الله أن يرى فضلها أهل الموقف في صاحب السجلات ولا يراها ولا توضع إلا بعد دخول من شاء الله من الموحدين النار فإذا لم يبق في الموقف موحد قد قضى الله عليه أن يدخل النار ثم بعد ذلك يخرج بالشفاعة أو بالعناية الإلهية عند ذلك يؤتى بصاحب السجلات ولم يبق في الموقف إلا من يدخل الجنة ممن لا حظ له في النار وهو آخر من يوزن له من الخلق فإن لا إله إلا الله له البدء والختام وقد يكون عين بدئها ختامها كصاحب السجلات‏\n\n\n### [إن الله وضع في العموم أفضل الأشياء وأعمها منفعة]\n\n\nثم اعلم أن الله ما وضع في العموم إلا أفضل الأشياء وأعمها منفعة وأثقلها وزنا لأنه يماثل بها أضدادا كثيرة فلا بد أن يكون في ذلك الموضوع في العامة من القوة ما يقابل به كل ضد وهذا لا يتفطن له كل عارف من أهل الله إلا الأنبياء الذين شرعوا للناس ما شرعوا ولا شك أنه‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم أفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله‏\n\n\nوقد قال ما أشارت إلى فضله من ادعى الخصوص من الذكر بكلمة الله الله وهو هو ولا شك أنه من جملة الأقوال التي لا إله إلا الله أفضل منها عند العلماء بالله فعليك يا ولي بالذكر الثابت في العموم فإنه الذكر الأقوى وله النور الأضوى والمكانة الزلفى ولا يشعر بذلك إلا من لزمه وعمل به حتى أحكمه فإن الله ما وسع رحمته إلا للشمول وبلوغ المأمول وما من أحد إلا وهو يطلب النجاة وإن جهل طريقها فمن نفى بلا إله عينه أثبت بإلا الله كونه فتنفى عينك حكما لا علما وتوجب كون الحق حكما وعلما والإله من له جميع الأسماء وليست إلا لعين واحدة وهي مسمى الله عامر السموات والأرض الذي بيده ميزان الرفع والخفض فعليك بلزوم هذا الذكر الذي قرن الله به وبالعلم به السعادة فعم‏\n\n\nوإياك ومعاداة أهل لا إله إلا الله فإن لها من الله الولاية العامة فهم أولياء الله وإن أخطئوا وجاءوا بقراب الأرض خطايا لا يشركون بالله لقيهم الله بمثلها مغفرة ومن‏\nثبتت ولايته فقد حرمت محاربته ومن حارب الله فقد ذكر الله جزاءه في الدنيا والآخرة وكل من لم يطلعك الله على عداوته لله فلا تتخذه عدوا وأقل أحوالك إذا جهلته أن تهمل أمره فإذا تحققت أنه عدو لله وليس إلا المشرك فتبرأ منه كما فعل إبراهيم الخليل عليه السلام في حق أبيه آزر قال الله عز وجل فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ هذا ميزانك يقول الله تعالى لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ كما فعل إبراهيم الخليل أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ ومتى لا تعلم ذلك فلا تعاد عباد الله بالإمكان ولا بما ظهر على اللسان والذي ينبغي لك أن تكره فعله لا عينه والعدو لله إنما تكره عينه ففرق بين من تكره عينه وهو عدو الله وبين من تكره فعله وهو المؤمن أو من تجهل خاتمته ممن ليس بمسلم في الوقت واحذر\n\n\nقوله تعالى في الصحيح من عادى لي وليا فقد آذنته بالحرب‏\n\n\nفإنه إذا جهل أمره وعاداه فما وفى حق الحق في خلقه فإنه ما يدري علم الله فيه وما بينه الله له حتى يتبرأ منه ويتخذه عدوا وإذا علم حاله الظاهر وإن كان عدوا لله في نفس الأمر وأنت لا تعلم فواله لإقامة حق الله ولا تعاده فإن الاسم الإلهي الظاهر يخاصمك عند الله فلا تجعل لله عليك حجة فتهلك فإن فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ فعامل عباد الله بالشفقة والرحمة كما إن الله يرزقهم على كفرهم وشركهم مع علمه بهم وما رزقهم إلا لعلمه بأن الذي هم فيه ما هم فيه بهم بل وهم فيه بهم لما قد ذكرناه بلسان العموم فإن الله خالِقُ كُلِّ شَيْ‏ءٍ وكفرهم وشركهم مخلوق فيهم وبلسان الخصوص ما ظهر حكم في موجود إلا بما هو عليه في حال العدم في ثبوته الذي علمه الله منه فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ على كل أحد مهما وقع نزاع ومحاجة فيسلم الأمر إليه واعلم أنك على ما كنت عليه وعم برحمتك وشفقتك جميع الحيوان والمخلوقين ولا تقل هذا نبات وجماد ما عندهم خبر نعم عندهم أخبار أنت ما عندك خبر فاترك الوجود على ما هو عليه وارحمه برحمة موجدة في وجوده ولا تنظر فيه من حيث ما يقام فيه في الوقت حَتَّى يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُوا وتَعْلَمَ الْكاذِبِينَ فيتعين عليك عند ذلك أن تتخذهم أعداء لأمر الله لك بذلك حيث نهاك أن تتخذ عدوه وليا تلقي إليه بالمودة فإن اضطرك ضعف يقين إلى مداراتهم فدارهم من غير أن تلقي إليهم بمودة ولكن مسالمة لدفع الشر عنك ففوض الأمر إليه واعتمد في كل حال عليه إلى أن تلقاه‏\n\n\nوعليك بملازمة ما افترضه الله عليك على الوجه الذي أمرك أن تقوم فيه فإذا أكملت نشأة فرائضك وإكمالها فرض عليك حينئذ تتفرغ ما بين الفرضين لنوافل الخيرات كانت ما كانت ولا تحقر شيئا من عملك فإن الله ما احتقره حين خلقه وأوجده فإن الله ما كلفك بأمر إلا وله بذلك الأمر اعتناء وعناية حتى كلفك به مع كونك في الرتبة أعظم عنده فإنك محل لوجود ما كلفك به إذ كان التكليف لا يتعلق إلا بأفعال المكلفين فيتعلق بالمكلف من حيث فعله لا من حيث عينه‏\n\n\n### [إن العبد إذا ثابر على أداء الفرائض فإنه تقرب إلى الله بأحب الأمور المقربة إليه‏]\n\n\nواعلم إنك إذا ثابرت على أداء الفرائض فإنك تقربت إلى الله بأحب الأمور المقربة إليه وإذا كنت صاحب هذه الصفة كنت سمع الحق وبصره فلا يسمع إلا بك ولا يبصر إلا بك فيد الحق يدك إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله يَدُ الله فَوْقَ أَيْدِيهِمْ وأيديهم من حيث ما هي يد الله هي فوق أيديهم من حيث ما هي أيديهم فإنها المبايعة اسم فاعل والفاعل هو الله فأيديهم يد الله فبأيديهم بايع تعالى وهم المبايعون والأسباب كلها يد الحق التي لها الاقتدار على إيجاد المسببات وهذه هي المحبة العظمى التي ما ورد فيها نص جلي كما ورد في النوافل فإن للمثابرة على النوافل حبا إلهيا منصوصا عليه يكون الحق سمع العبد وبصره كما كان الأمر بالعكس في حب أداء الفرائض ففي الفرض عبودية الاضطرار وهي الأصلية وفي الفرع وهو النفل عبودية الاختيار فالحق فيها سمعك وبصرك ويسمى نفلا لأنه زائد كما أنك بالأصالة زائد في الوجود إذ كان الله ولا أنت ثم كنت فزاد الوجود الحادث فأنت نفل في وجود الحق فلا بد لك من عمل يسمى نفلا هو أصلك ولا بد من عمل يسمى فرضا وهو أصل الوجود وهو وجود الحق ففي أداء الفرض أنت له وفي النفل أنت لك وحبه إياك من حيث ما أنت له أعظم وأشد من حبه إياك من حيث ما أنت لك وقد ورد في الخبر الصحيح عن الله تعالى ما تقرب إلى عبد بشي‏ء أحب إلي مما افترضته عليه وما يزال العبد يتقرب إلي بالنوافل حتى أحببته فكنت سمعه الذي به يسمع وبصره الذي به يبصر ويده التي يبطش ورجله التي بها يمشي ولئن سألني‏\nلأعطينه ولئن استعاذ بي لأعيذنه وما ترددت عن شي‏ء أنا فاعله ترددي عن نفس عبدي المؤمن يكره الموت وأنا أكره مساءته‏\n\n\nفانظر إلى ما تنتجه محبة الله فثابر على أداء ما يصح به وجود هذه المحبة الإلهية ولا يصح نفل إلا بعد تكملة الفرض وفي النفل عينه فروض ونوافل فبما فيه من الفروض تكمل الفرائض‏\n\n\nورد في الصحيح أنه يقول تعالى انظروا في صلاة عبدي أتمها أم نقصها فإن كانت تامة كتبت له تامة وإن كان انتقص منها شيئا قال انظروا هل لعبدي من تطوع فإن كان له تطوع قال الله أكملوا لعبدي فريضته من تطوعه‏\n\n\nثم تؤخذ الأعمال على ذاكم وليست النوافل إلا ما لها أصل في الفرائض وما لا أصل له في فرض فذلك إنشاء عيادة مستقلة يسميها علماء الرسوم بدعة قال الله تعالى ورَهْبانِيَّةً ابْتَدَعُوها وسماها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم سنة حسنة والذي سنها له أجرها وأجر من عمل بها إلى يوم القيامة من غير أن ينقص من أجورهم شيئا\n\n\nولما لم يكن في قوة النفل أن يسد مسد الفرض جعل في نفس النفل فروضا لتجبر الفرائض بالفرائض كصلاة النافلة بحكم الأصل ثم إنها تشتمل على فرائض من ذكر وركوع وسجود مع كونها في الأصل نافلة وهذه الأقوال والأفعال فرائض فيها\n\n\nوعليك بمراعاة أقوالك كما تراعي أعمالك فإن أقوالك من جملة عملك ولهذا قال بعض العلماء من عد كلامه من عمله قل كلامه‏\n\n\n### [أن الله عند لسان كل قائل‏]\n\n\nواعلم أن الله راعي أقوال عباده وأن الله عند لسان كل قائل فما نهاك الله عنه إن تتلفظ به فلا تتلفظ به وإن لم تعتقده فإن الله سائلك عنه روينا أن الملك لا يكتب على العبد ما يعمله حتى يتكلم به قال تعالى ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ يريد الملك الذي يحصي عليك أقوالك يقول تعالى إِنَّ عَلَيْكُمْ لَحافِظِينَ كِراماً كاتِبِينَ يَعْلَمُونَ ما تَفْعَلُونَ وأقوالك من أفعالك انظر في قوله تعالى ولا تَقُولُوا لِمَنْ يُقْتَلُ في سَبِيلِ الله أَمْواتٌ فنهاك عن القول فإنه كذب الله من قال مثل هذا القول فإن الله قال فيهم إنهم أحياء أ لا ترى إلى قوله تعالى حيث يقول ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله أَمْواتاً بَلْ أَحْياءٌ عِنْدَ رَبِّهِمْ وقال لا يُحِبُّ الله الْجَهْرَ بِالسُّوءِ من الْقَوْلِ وقال لا خَيْرَ في كَثِيرٍ من نَجْواهُمْ وهو القول فإذا تكلمت فتكلم بميزان ما شرع الله لك أن تتكلم به وكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يمزح ولا يقول إلا حقا\n\n\nفعليك بقول الحق الذي يرضى الله فما كل حق يقال يرضى الله فإن النميمة حق والغيبة حق وهي لا ترضي الله وقد نهيت أن تغتاب وإن تنم بأحد ومن مراعاة الله الأقوال‏\n\n\nما رويناه في صحيح مسلم عن الله تعالى لما مطرت السماء قال عز وجل أصبح من عبادي مؤمن بي وكافر فمن قال مطرنا بنوء كذا وكذا فهو كافر بي مؤمن بالكوكب وأما من قال مطرنا بفضل الله ورحمته فذلك مؤمن بي كافر بالكوكب‏\n\n\nفراعى أقوال القائلين وكان أبو هريرة يقول إذا مطرت السماء مطرنا بنوء الفتح ثم يتلو ما يَفْتَحِ الله لِلنَّاسِ من رَحْمَةٍ فَلا مُمْسِكَ لَها ولو كنت تعتقد أن الله هو الذي وضع الأسباب ونصبها وأجرى العادة عندنا بأنه يفعل الأشياء عندها لا بها ومع هذا كله لا تقل ما نهاك الله عنه أن تقوله وتتلفظ به فإنه كما نهاك عن أمور نهاك عن القول وإن كان حقا وانظر ما أحكم قول الله عز وجل في قوله مؤمن بي كافر بالكوكب وكافر بي مؤمن بالكوكب فإنه مهما قال بفضل الله فقد ستر الكوكب حيث لم ينطق باسمه ومن قال بالكوكب فقد ستر الله وإن اعتقد أنه الفاعل منزل المطر ولكن لم يتلفظ باسمه فجاء تعالى بلفظ الكفر الذي هو الستر فإياك والاستمطار بالأنواء أن تتلفظ به فأحرى إن تعتقده فإن اعتقادك إن كنت مؤمنا أن الله نصبها أدلة عادية وكل دليل عادي يجوز خرق العادة فيه فاحذر من غوائل العادات ولا تصرفنك عن حدود الله التي حد لك فلا تتعداها فإن الله ما حدها حتى راعاها وذلك في كل شي‏ء\n\n\nورد في الخبر الصحيح أن الرجل يتكلم بالكلمة من سخط الله ما يظن أن تبلغ ما بلغت فيهوي بها في النار سبعين حريفا وإن الرجل ليتكلم بالكلمة من رضوان الله ما يظن أن تبلغ ما بلغت فيرفع بها في عليين‏\n\n\nفلا تنطق إلا بما يرضى الله لا بما يسخط الله عليك وذلك لا يتمكن لك إلا بمعرفة ما حده لك في نطقك وهذا باب أغفله الناس‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهل يكب الناس على مناخرهم في النار إلا حصائد ألسنتهم‏\n\n\nوقال الحكيم لا شي‏ء أحق بسجن من لسان وقد جعله الله خلف بابين الشفتين والأسنان ومع هذا يكثر الفضول ويفتح الأبواب‏\nوإياك أن تصور صورة بيدك من شأنها أن يكون لها روح فإن ذلك أمر يهونه الناس على أنفسهم وهُوَ عِنْدَ الله عَظِيمٌ‏\n\n\nفالمصورون أشد الناس عذابا يوم القيامة يقال للمصور يوم القيامة أحي ما خلقت أو انفخ فيها روحا وليس بنافخ‏\n\n\nوقد ورد في الصحيح عن الله تعالى أنه قال ومن أظلم ممن ذهب يخلق خلقا كخلقي فليخلقوا ذرة أو ليخلقوا حبة أو ليخلقوا شعيرة\n\n\nوإن العبد إذا راعى هذا القدر وتركه لما ورد عن الله فيه ولم يزاحم الربوبية في تصوير شي‏ء لا من حيوان ولا من غير حيوان فإنه يطلع على حياة كل صورة في العالم فيراه كله حيوانا ناطقا يسبح بحمد الله وإذا سامح نفسه في تصوير النبات وما ليس له روح في الشاهد في نظر البصر في المعتاد فلا يطلع على مثل هذا الكشف أبدا فإنه في نفس الأمر لكل صورة من العالم روح أخذ الله بأبصارنا عن إدراك حياة ما يقول عنه إنه ليس بحيوان وفي الآخرة يتكشف الأمر في العموم ولهذا سماها بالدار الحيوان فما ترى فيها شيئا إلا حيا ناطقا بخلاف حالك في الدنيا كما\n\n\nروى في الصحيح أن الحصى سبح في كف رسول الله ص‏\n\n\nفجعل الناس خرق العادة في تسبيح الحصى وأخطئوا وإنما خرق العادة في سمع السامعين ذلك فإنه لم يزل مسبحا كما أخبر الله إلا أن يسبح بتسبيح خاص أو هيأة في النطق خاصة لم يكن الحصى قبل ذلك يسبح به ولا على تلك الكيفية فحينئذ يكون خرق العادة في الحصى لا في سمع السامع والذي في سمع السامع كونه سمع نطق من لم تجر العادة أن يسمعه‏\n\n\nوعليك يا أخي بعيادة المرضى لما فيها من الاعتبار والذكرى فإن الله خلق الإنسان من ضَعْفٍ فينبهك النظر إليه في عيادتك على أصلك لتفتقر إلى الله في قوة يقويك بها على طاعته وأن الله عند عبده إذا مرض أ لا ترى إلى المريض ما له استغاثة إلا بالله ولا ذكر إلا الله فلا يزال الحق بلسانه منطوقا به وفي قلبه التجاء إليه فالمريض لا يزال مع الله أي مريض كان ولو تطبب وتناول الأسباب المعتادة لوجود الشفاء عندها ومع ذلك فلا يغفل عن الله وذلك لحضور الله عنده وإن الله يوم القيامة يقول يا ابن آدم مرضت فلم تعدني قال يا رب كيف أعودك أو أنت رب العالمين قال أ ما علمت أن عبدي فلانا مرض فلم تعده أ ما أنك لو عدته لوجدتني عنده الحديث‏\n\n\nوهو صحيح فقوله لوجدتني عنده هو ذكر المريض ربه في سره وعلانيته وكذلك إذا استطعمك أحد من خلق الله أو استسقاك فأطعمه واسقه إذا كنت موجدا لذلك فإنه لو لم يكن لك من الشرف والمنزلة إلا إن هذا المستطعم والمستسقي قد أنزلك منزلة الحق الذي يطعم عباده ويسقيهم وهذا نظر قل من يعتبره انظر إلى السائل إذا سأل ويرفع صوته يقول بالله أعطني فما نطقه الله إلا باسمه في هذه الحال وما رفع صوته إلا ليسمعك أنت حتى تعطيه فقد سماك بالاسم الله والتجأ إليك برفع الصوت التجائه إلى الله ومن أنزلك منزلة سيده فينبغي لك أن لا تحرمه وتبادر إلى إعطائه ما سالك فيه فإن‏\n\n\nفي هذا الحديث الذي سقناه آنفا في مرض العبد إن الله يقول يا ابن آدم استطعمتك فلم تطعمني قال يا رب كيف أطعمك وأنت رب العالمين قال أ ما علمت إن عبدي فلانا استطعمك فلم تطعمه أ ما لو أطعمته لوجدت ذلك عندي يا ابن آدم استسقيتك فلم تسقني قال يا رب كيف أسقيك وأنت رب العالمين قال أ ما علمت إن عبدي فلانا استسقاك فلم تسقه أما لو سقيته لوجدت ذلك عندي خرج هذا الحديث مسلم عن محمد بن حاتم عن بهز عن حماد بن سلمة عن ثابت عن أبي رافع عن أبي هريرة قال قال رسول الله ص‏\n\n\nفأنزل الله نفسه في هذا الخبر منزلة عبده فالعبد الحاضر مع الله الذاكر الله في كل حال في مثل هذه الحال يرى الحق أنه الذي استطعمه واستسقاه فيبادر لما طلب الحق منه فإنه لا يدري يوم القيامة لعله يقام في حال هذا الشخص الذي استطعمه واستسقاه من الحاجة فيكافئه الله على ذلك وهو قوله لوجدت ذلك عندي أي تلك الطعمة والشربة كنت أرفعها لك وأربيها حتى تجي‏ء يوم القيامة فاردها عليك أحسن وأطيب وأعظم مما كانت فإن لم تكن لك همة أن ترى هذا الذي استسقاك قد أنزلك منزلة من بيده قضاء حاجته إذ جعلك الله خليفة عنه فلا أقل أن تقضي حاجة هذا السائل بنية التجارة طلبا للريح وتضاعف الحسنة فكيف إذا وقفت على مثل هذا الخبر ورأيت أن الله هو الذي سألك ما أنت مستخلف فيه فإن الكل لله وقد أمرك بالإنفاق مما استخلفك فيه فقال وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ وعظم الأجر فيه إذا أنفقت فلا ترد سائلا ولو بكلمة طيبة وألقه طلق الوجه‏\nمسرورا به فإنك إنما تلقى الله وكان الحسين أو الحسن عليه السلام إذا سأله السائل سارع إليه بالعطاء ويقول أهلا والله وسهلا بحامل زادي إلى الآخرة\n\n\nلأنه رآه قد حمل عنه فكان له مثل الراحلة لأن الإنسان إذا أنعم الله عليه نعمة ولم يحمل فضلها غيره فإنه يأتي بها يوم القيامة وهو حاملها حتى يسأل عنها فلهذا\n\n\nكان الحسن يقول إن السائل حامل زاده إلى الآخرة فيرفع عنه مئونة الحمل‏\n\n\nوإياكم ومظالم العباد فإن الظلم ظلمات يوم القيامة وظلم العباد إن تمنعهم حقوقهم التي أوجب الله عليك أداءها إليهم وقد يكون ذلك بالحال فيما تراه عليه من الاضطرار وأنت قادر واجد لسد خلته ودفع ضرورته فيتعين عليك أن تعلم أن له بحاله حقا في مالك فإن الله ما أطلعك عليه إلا لتدفع إليه حقه وإلا فأنت مسئول فإن لم يكن لك قدرة بما تسد خلته‏\n\n\n### [إن الله يريد من العبد أن تعينه بكلمة طيبة عند من تعلم أنه يسد خلته‏]\n\n\nفاعلم إن الله ما أطلعك على حاله سدى فاعلم أنه يريد منك أن تعينه بكلمة طيبة عند من تعلم أنه يسد خلته فإن لم تعمل فلا أقل من دعوة تدعو له ولا يكون هذا إلا بعد بذل‏\n\n\nالمجهود والياس حتى لا يبقى عندك إلا الدعاء ومهما غفلت عن هذا القدر فأنت من جملة من ظلم صاحب هذا الحال هذا كله إن مات ذلك المحتاج من تلك الحاجة فإن لم يمت وسد خلته غيرك من المؤمنين فقد أسقط أخوك عنك هذه المطالبة من حيث لا يشعر فإن المؤمن أخو المؤمن لا يسلمه وإن لم ينو المعطي ذلك ولكن هكذا هو في نفس الأمر وكذا يقبله الله فإذا أعطيت أنت سائلا بالحال ضرورته فانو في ذلك أن تنوب عن أخيك المؤمن الأول الذي حرمه وتجعل ذلك منه إيثارا لجنابك عليه بذلك الخير الذي أبقاه من أجلك حتى تصيبه إذ لو أعطاه اقتنع بما أعطاه ولم تكن تجد أنت ذلك الخير فبهذه النية عطاء العارفين أصحاب الضرورات السائلين بأحوالهم وأقوالهم وأَمَّا السَّائِلَ فَلا تَنْهَرْ وسواء كان ذلك في القوت المحسوس أو المعنوي فإن العلم من هذا الباب والإفادة فإن الضال يطلب الهداية والجائع يطلب الإطعام والعاري يطلب الكسوة التي تقيه برد الهواء وحره وتستر عورته والجاني العالم بأنك قادر على مؤاخذته يطلب منك العفو عن جنايته فاهد الجيران وأطعم الجائع واسق الظمآن واكس العريان واعلم إنك فقير لما يفتقر إليك فيه والله غَنِيٌّ عَنِ الْعالَمِينَ ومع هذا يجيب دعاءهم ويقضي حوائجهم ويسألهم أن يسألوه في دفع المضار عنهم وإيصال المنافع إليهم فأنت أولى أن تعامل عباد الله بمثل هذا لحاجتك إلى الله في هذه الأمور\n\n\nخرج مسلم في الصحيح عن عبد الله بن عبد الرحمن بن بهرام الدارمي عن مروان بن محمد الدمشقي عن سعيد بن عبد العزيز عن ربيعة بن يزيد عن أبي إدريس الخولاني عن أبي ذر عن النبي صَلَّى اللهُ عَليهِ وسَلَّم فيما روى عن الله تبارك وتعالى أنه قال يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا يا عبادي كلكم ضال إلا من هديته فاستهدوني أهدكم يا عبادي كلكم جائع إلا من أطعمته فاستطعموني أطعمكم يا عبادي كلكم عار إلا من كسوته فاستكسوني أكسكم يا عبادي أنتم تخطئون بالليل والنهار وأنا اغفر الذنوب جميعا فاستغفروني أغفر لكم‏\n\n\nوالحق تعالى يعطيكم هذا كله من غير سؤال منك إياه فيه ولكن مع هذا أمرك أن تسأله فيعطيك إجابة لسؤالك ليريك عنايته بك حيث قبل سؤالك وهذه منزلة أخرى زائدة على ما أعطاك وإذا كان سؤالك عن أمره وقد علم منك أنك تسأله ولا بد من ضرورة أصل ما خلقت عليه من الحاجة والسؤال لتكون في سؤالك مؤديا أمرا واجبا فتجزى جزاء من امتثل أمر الله فتزيد خيرا إلى خير فما أمرك إلا رحمة بك وإيصال خير إليك ولينبهك على إن حاجتك إليه لا إلى غيره فإنه ما خلقك إلا لعبادته أي لتذل له فالذي أوصيك به الوقوف عند أوامر الحق ونواهيه والفهم عنه في ذلك حتى تكون من العلماء بما أراده الحق منك في أمره ونهيه إياك ومن لم يسأل ربه فقد بخله هذا في حق العموم فإن فرطت فيما أوصيتك به فلا تلومن إلا نفسك فإنك إن كنت جاهلا فقد علمتك وإن كنت ناسيا ونافلا فقد نبهتك وذكرتك فإن كنت مؤمنا فإن الذكرى تنفعك فإني قد امتثلت أمر الله بما ذكرتك به وانتفاعك بالذكرى شاهد لك بالإيمان قال الله عز وجل في حقي وفي حقك وذَكِّرْ فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ فإن لم تنفعك الذكرى فاتهم نفسك في إيمانك فإن الله صادق وقد أخبر بأن الذكرى تنفع المؤمنين ومن تمام هذا الخبر الإلهي الذي أوردناه بعد قوله اغفر لكم أن قال يا عبادي إنكم لن تبلغوا ضري فتضروني ولن تبلغوا نفعي فتنفعوني‏\n\n\nومعلوم أنه سبحانه لا يتضرر ولا ينتفع فإنه الغني عن العالمين ولكن لما أنزل‏\nنفسه منزلة عبده فيما ذكرناه من الاستطعام والاستسقاء نبهنا بالعجز عن بلوغ الغاية في ضر العباد له أو في نفعهم فمن المحال بلوغ الغاية في ذلك ولكون الله قد قال في حق قوم بِأَنَّهُمُ اتَّبَعُوا ما أَسْخَطَ الله وهو في الظاهر ضرر نزه نفسه عن ذلك وكذلك من فعل فعلا يرضي الله به ويفرحه كالتائب في فرح الله بتوبة عبده فكان هذا الخبر كالدواء لما يطرأ من المرض من ذلك في بعض النفوس الضعيفة في العلم بالله التي لا علم لها بما يعطيه قوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\n\n\nثم من تمام هذا الخبر قوله يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد ما زاد ذلك في ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد ما نقص ذلك من ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا دخل في البحر\n\n\nوهذا كله دواء لما ذكرناه من أمراض النفوس الضعيفة فاستعمل يا ولي هذه الأدوية يقول الله إنما هي أعمالكم أحصيها لكم ثم أو فيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه ومن سأل عن حاجة فقد ذل ومن ذل لغير الله فقد ضل وظلم نفسه ولم يسلك بها طريق هداها وهذه وصيتي إياك فألزمها ونصيحتي فأعلمها وما زال الله تعالى يوصي عباده في كتابه وعلى ألسنة رسله فكل من أوصاك بما في استعماله سعادتك فهو رسول من الله إليك فاشكره عند ربك‏\n\n\nإذا رأيت عالما لم يستعمله علمه فاستعمل أنت علمك في أدبك معه حتى توفي العالم حقه من حيث ما هو عالم ولا تحجب عن ذلك بحاله السيئ فإن له عند الله درجة علمه فإن الإنسان يحشر يوم القيامة مع من أحب ومن تأدب مع صفة إلهية كسيها يوم القيامة وحشر فيها وعليك بالقيام بكل ما تعلم أن الله يحبه منك فتبادر إليه فإنك إذا تحليت به على طريق التحبب إليه تعالى أحبك وإذا أحبك أسعدك بالعلم به وبتجليه وبدار كرامته فينعمك في بلائك والذي يحبه تعالى أمور كثيرة اذكر منها ما تيسر على جهة الوصية والنصيحة فمن ذلك التجمل لله فإنه عبادة مستقلة ولا سيما في عبادة الصلاة فإنك مأمور به قال الله تعالى يا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وقال في معرض الإنكار قُلْ من حَرَّمَ زِينَةَ الله الَّتِي أَخْرَجَ لِعِبادِهِ والطَّيِّباتِ من الرِّزْقِ قُلْ هِيَ لِلَّذِينَ آمَنُوا في الْحَياةِ الدُّنْيا خالِصَةً يَوْمَ الْقِيامَةِ كَذلِكَ نُفَصِّلُ الْآياتِ لِقَوْمٍ يَعْلَمُونَ وأكثر من هذا البيان في مثل هذا في القرآن فلا يكون ولا فرق بين زينة الله وزينة الحياة الدنيا إلا بالقصد والنية وإنما عين الزينة هي هي ما هي أمر آخر فالنية روح الأمور وإنما لامرئ ما نوى فالهجرة من حيث ما كانت هجرة واحدة العين فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه وكذلك ورد في الصحيح في بيعة الإمام في الثلاثة الذين لا يُكَلِّمُهُمُ الله يَوْمَ الْقِيامَةِ ولا يُزَكِّيهِمْ ولَهُمْ عَذابٌ أَلِيمٌ وفيه ورجل بايع أما ما لا يبايعه إلا لدنيا فإن أعطاه منها وفى وإن لم يعطه منها لم يف فالأعمال بالنيات وهي أحد أركان بيت الإسلام وورد في الصحيح في مسلم أن رجلا قال لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم يا رسول الله إني أحب أن يكون نعلي حسنا وثوبي حسنا فقال له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن الله جميل يحب الجمال‏\n\n\nوقال إن الله أولى من يتجمل له‏\n\n\n(و من هذا الباب) كون الله تعالى لم يبعث إليه جبريل في أكثر نزوله عليه إلا في صورة دحية وكان أجمل أهل زمانه وبلغ من أثر جماله في الخلق أنه لما قدم المدينة واستقبله الناس ما رأته امرأة حامل إلا ألقت ما في بطنها فكان الحق يقول يبشر نبيه صَلَّى اللهُ عَليهِ وسَلَّم بإنزال جبريل عليه في صورة دحية يا محمد ما بيني وبينك إلا صورة الجمال يخبره تعالى بما له في نفسه سبحانه بالحال فمن فاته التجمل لله كما قلناه فقد فاته من الله هذا الحب الخاص المعين وإذا فاته هذا الحب الخاص المعين فاته من الله ما ينتجه من علم وتجل وكرامة في دار السعادة ومنزلة في كثيب الرؤية وشهود معنوي علمي روحي في هذه الدار الدنيا في سلوكه ومشاهده ولكن كما قلنا ينوي بذلك التجمل لله لا للزينة والفخر بعرض الدنيا والزهو والعجب والبطر على غيره (و من ذلك)\n\n\nالرجوع إلى الله عند الفتنة\n\n\nفإن الله يحب كل مفتن تواب كذا قال رسول الله ص‏\n\n\nقال الله عز وجل خَلَقَ الْمَوْتَ والْحَياةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا والبلاء والفتنة بمعنى واحد وليس إلا الاختبار لما هو الإنسان عليه من الدعوى‏\nإِنْ هِيَ إِلَّا فِتْنَتُكَ أي اختبارك تُضِلُّ بِها من تَشاءُ أي تحيره وتَهْدِي بها من تَشاءُ أي تبين له طريق نجاته فيها\n\n\n(و أعظم الفتن) النساء والمال والولد والجاه‏\n\n\nهذه الأربعة إذا ابتلى الله بها عبدا من عباده أو بواحد منها وقام فيها مقام الحق في نصبها له ورجع إلى الله فيها ولم يقف معها من حيث عينها وأخذها نعمة إلهية أنعم الله عليه بها فردته إليه تعالى وإقامته في مقام حق الشكر الذي‏\n\n\nأمر الله نبيه عليه السلام موسى به فقال له يا موسى اشكرني حق الشكر قال موسى يا رب وما حق الشكر قال له يا موسى إذا رأيت النعمة منى فذلك حق الشكر ذكره ابن ماجة في سننه عن رسول الله ص‏\n\n\nولما غفر الله لنبيه محمد صَلَّى اللهُ عَليهِ وسَلَّم ما تقدم من ذنبه وما تأخر وبشره ذلك بقوله تعالى لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ قام حتى تورمت قدماه شكر الله تعالى على ذلك فما فتر ولا جنح إلى الراحة ولما قيل له في ذلك وسئل في الرفق بنفسه قال صَلَّى اللهُ عَليهِ وسَلَّم أ فلا أكون عبدا شكورا وذلك لما سمع الله يقول إن الله يحب الشاكرين‏\n\n\nفإن لم يقم في مقام شكر المنعم فاته من الله هذا الحب الخاص بهذا المقام الذي لا يناله من الله إلا الشكور فإن الله يقول وقَلِيلٌ من عِبادِيَ الشَّكُورُ وإذا فاته فاته ما له من العلم بالله والتجلي والنعيم الخاص به في دار الكرامة وكثيب الرؤية يوم الزور الأعظم فإنه لكل حب إلهي من صفة خاصة علم وتجل ونعيم ومنزلة لا بد من ذلك يمتاز بها صاحب تلك الصفة من غيره‏\n\n\n(فأما فتنة النساء)\n\n\nفصورة رجوعه إلى الله في محبتهن بأن يرى أن الكل أحب بعضه وحن إليه فما أحب سوى نفسه لأن المرأة في الأصل خلقت من الرجل من ضلعه القصيري فينزلها من نفسه منزلة الصورة التي خلق الله الإنسان الكامل عليها وهي صورة الحق فجعلها الحق مجلى له وإذا كان الشي‏ء مجلى للناظر فلا يرى الناظر في تلك الصورة إلا نفسه فإذا رأى في هذه المرأة نفسه اشتد حبه فيها وميلة إليها لأنها صورته وقد تبين لك أن صورته صورة الحق التي أوجده عليها فما رأى إلا الحق ولكن بشهوة حب والتذاذ وصلة يفنى فيها فناء حق بحب صدق وقابلها بذاته مقابلة المثلية ولذلك فنى فيها فما من جزء فيه إلا وهو فيها والمحبة قد سرت في جميع أجزائه فتعلق كله بها فلذلك فنى في مثله الفناء الكلي بخلاف حبه غير مثله فاتحد بمحبوبه إلى أن قال‏\n\n\nأنا من أهوى ومن أهوى أنا\n\n\nوقال الآخر في هذا المقام أنا الله فإذا أحببت مثلك شخصا هذا الحب ردك إلى الله شهودك فيه هذا الرد فأنت ممن أحبه الله وكانت هذه الفتنة فتنة أعطتك المهداة وأما الطريقة الأخرى في حب النساء فإنهن محال الانفعال والتكوين لظهور أعيان الأمثال في كل نوع ولا شك أن الله ما أحب أعيان العالم في حال عدم العالم إلا لكون تلك الأعيان محل الانفعال فلما توجه عليها من كونه مريدا قال لها كن فكانت فظهر ملكه بها في الوجود وأعطت تلك الأعيان لله حقه في الوهته فكان إلها فعبدته تعالى بجميع الأسماء بالحال سواء علمت تلك الأسماء أو لم تعلمها فما بقي اسم لله إلا والعبد قد قام فيه بصورته وحاله وإن لم يعلم نتيجة ذلك الاسم وهو الذي‏\n\n\nقال فيه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في دعائه بأسماء الله أو استأثرت به في علم غيبك أو علمته أحدا من خلقك‏\n\n\nيعني من أسمائه أن يعرف عينه حتى يفصله من غيره علما فإن كثيرا من الأمور في الإنسان بالصورة والحال ولا يعلم بها ويعلم الله منه أن ذلك فيه فإذا أحب المرأة لما ذكرناه فقد رده حبها إلى الله تعالى فكانت نعمة الفتنة في حقه فأحبه الله برجعته إليه تعالى في حبه إياها وأما تعلقه بامرأة خاصة في ذلك دون غيرها وإن كانت هذه الحقائق التي ذكرناها سارية في كل امرأة فذلك لمناسبة روحانية بين هذين الشخصين في أصل النشأة والمزاج الطبيعي والنظر الروحي فمنه ما يجري إلى أجل مسمى ومنه ما يجري إلى غير أجل بل أجله الموت والتعلق لا يزول كحب النبي صَلَّى اللهُ عَليهِ وسَلَّم عائشة فإنه كان يحبها أكثر من حبه جميع نسائه وحبه أبا بكر أيضا وهو أبوها فهذه المناسبات الثواني هي التي تعين الأشخاص والسبب الأول هو ما ذكرناه ولذلك الحب المطلق والسماع المطلق والرؤية المطلقة التي يكون عليها بعض عباد الله ما تختص بشخص في العالم دون شخص فكل حاضر عنده له محبوب وبه مشغول ومع هذا لا بد من ميل خاص لبعض الأشخاص لمناسبة خاصة مع هذا الإطلاق لا بد من ذلك فإن نشأة العالم تعطي في آحاده هذا لا بد من تقييد والكامل من يجمع بين التقييد والإطلاق فالإطلاق مثل‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم حبب إلي من دنياكم ثلاث النساء وما خص امرأة من امرأة\n\n\nومثل التقييد\n\n\nما روى من حبه عائشة أكثر\nمن سائر نسائه‏\n\n\nلنسبة إلهية روحانية قيدته بها دون غيرها مع كونه يحب النساء فهذا قد ذكرنا من الركن الواحد ما فيه كفاية لمن فهم‏\n\n\nوأما الركن الثاني من بيت الفتن وهو الجاه المعبر عنه بالرياسة\n\n\nيقول فيه الطائفة التي لا علم لها منهم آخر ما يخرج من قلوب الصديقين حب الرئاسة فالعارفون من أصحاب هذا القول ما يقولون ذلك على ما تفهمه العامة من أهل الطريق منهم وإنما ذلك على ما نبينه من مقصود الكمل من أهل الله بذلك وذلك أن في نفس الإنسان أمورا كثيرة خبأها الله فيه وهو الذي يُخْرِجُ الْخَبْ‏ءَ في السَّماواتِ والْأَرْضِ ويَعْلَمُ ما تُخْفُونَ وما تُعْلِنُونَ أي ما ظهر منكم وما خفي مما لا تعلمونه منكم فيكم فلا يزال الحق يخرج لعبده من نفسه مما أخفاه فيها ما لم يكن يعرف أن ذلك في نفسه كالشخص الذي يرى منه الطبيب من المرض ما لا يعرفه العليل من نفسه كذلك ما خبأه الله في نفوس الخلق أ لا تراه‏\n\n\nيقول صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nوما كل أحد يعرف نفسه مع أن نفسه عينه لا غير ذلك فلا يزال الحق يخرج للإنسان من نفسه ما خبأه فيها فيشهده فيعلم من نفسه عند ذلك ما لم يكن يعلمه قبل ذلك فقالت الطائفة الكثيرة آخر ما يخرج من قلوب الصديقين حب الرئاسة فيظهر لهم إذا خرج فيحبون الرئاسة بحب غير حب العامة لها فإنهم يحبونها من كونهم على ما قال الله فيهم إنه سمعهم وبصرهم وذكر جميع قواهم وأعضاءهم فإذا كانوا بهذه المثابة فما أحبوا الرئاسة إلا بالله إذ التقدم لله على العالم فإنهم عبيده وما كان الرئيس إلا بالمرءوس وجودا وتقديرا فحبه للمرءوس أشد الحب لأنه المثبت له الرئاسة فلا أحب من الملك في ملكه لأن ملكه المثبت له كونه ملكا فهذا معنى آخر ما يخرج من قلوب الصديقين حب الرئاسة لهم فيرونه ويشهدونه ذوقا لا أنه يخرج من قلوبهم فلا يحبون الرئاسة فإنهم إن لم يحبوها فما حصل لهم العلم بها ذوقا وهي الصورة التي خلقهم الله عليها في‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إن الله خلق آدم على صورته‏\n\n\nفي بعض تأويلات هذا الخبر ومحتملاته فاعلم ذلك والجاه إمضاء الكلمة ولا أمضى كلمة من قوله إِذا أَرادَ شَيْئاً أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ فأعظم الجاه من كان جاهه بالله فيرى هذا العبد مع بقاء عينه فيعلم عند ذلك أنه المثل الذي لا يماثل فإنه عبد رب والله عز وجل رب لا عبد فله الجمعية وللحق الانفراد\n\n\n(و أما الركن الثالث) وهو المال‏\n\n\nوما سمي المال بهذا الاسم إلا لكونه يمال إليه طبعا فاختبر الله به عباده حيث جعل تيسير بعض الأمور بوجوده وعلق القلوب بمحبة صاحب المال وتعظيمه ولو كان بخيلا فإن العيون تنظر إليه بعين التعظيم لتوهم النفوس باستغنائه عنهم لما عنده من المال وربما يكون صاحب المال أشد الناس فقرا إليهم في نفسه ولا يجد في نفسه الاكتفاء ولا القناعة بما عنده فهو يطلب الزيادة مما بيده ولما رأى العالم ميل القلوب إلى رب المال لأجل المال أحبوا المال فطلب العارفون وجها إلهيا يحبون به المال إذ ولا بد من حبه وهنا موضع الفتنة والابتلاء التي لها الضلالة والمهداة فأما العارفون فنظروا إلى أمور إلهية منها قوله تعالى وأَقْرِضُوا الله قَرْضاً حَسَناً فما خاطب إلا أصحاب الجدة فأحبوا المال ليكونوا من أهل هذا الخطاب فيلتذوا بسماعه حيث كانوا فإذا أقرضوه رأوا أن الصدقة تقع بيد الرحمن فحصل لهم بالمال وإعطائه مناولة الحق منهم ذلك فكانت لهم وصلة المناولة وقد شرف الله آدم بقوله لِما خَلَقْتُ بِيَدَيَّ فمن يعطيه عن سؤاله القرض أتم في الالتذاذ بالشرف ممن خلقه بيده فلو لا المال ما سمعوا ولا كانوا أهلا لهذا الخطاب الإلهي ولا حصل لهم بالقرض هذا التناول الرباني فإن ذلك يعم الوصلة مع الله فاختبرهم الله بالمال ثم اختبرهم بالسؤال منه وأنزل الحق نفسه منزلة السائلين من عباده أهل الحاجة أهل الثروة منهم والمال بقوله في‏\n\n\nالحديث المتقدم في هذا الباب يا عبدي استطعمتك فلم تطعمني واستسقيتك فلم تسقني‏\n\n\nفكان لهم بهذا النظر حب المال فتنة مهداة إلى مثل هذا وأما فتنة الولد فلكونه سر أبيه وقطعة من كبده وألصق الأشياء به فحبه حب الشي‏ء نفسه ولا شي‏ء أحب إلى الشي‏ء من نفسه فاختبره الله بنفسه في صورة خارجة عنه سماه ولدا ليرى هل يحجبه النظر إليه عما كلفه الحق من إقامة الحقوق عليه‏\n\n\nيقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في حق ابنته فاطمة ومكانتها من قلبه المكانة التي لا تجهل لو أن فاطمة بنت محمد سرقت قطعت يدها\n\n\nوجلد عمر بن الخطاب ابنه في الزنا فمات ونفسه بذاك طيبة وجاد ماعز بنفسه والمرأة في إقامة الحد عليهما الذي فيه إتلاف نفوسهما وقال في توبتهما رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وأي توبة أعظم من أن جادت بنفسها\n\n\nوالجود بإقامة الحق المكروه‏",
    "en": "Chapter Five Hundred and Sixty (560): Concerning a Sagacious Injunction (وصية حكمية) by which the Aspirant (المريد), the Seeker (السالك), the Attained (الواصل), and anyone who comes upon it, may benefit, if God wills.\n\nThe God (الإله) has enjoined, and His Messengers have enjoined; therefore,\nEmulating them is among the best of deeds.\n\nWere it not for the injunction, Creation (الخلق) would be in blindness;\nAnd by the injunction, sovereignty (الملك) revolves through the ages.\n\nSo act upon it, and do not neglect its path,\nFor the injunction is the decree of Allah in pre-eternity (الأزل).\n\nI have reminded a people of what the God has enjoined,\nAnd there is no innovation of command in this injunction from me.\n\nFor there was nothing other than what they said or legislated\nRegarding the spiritual journey (السلوك) through them upon the most upright paths.\nThus, Ahmad guided the very essence (عين) of the entire Religion,\nAnd the creed of the Chosen One (المصطفى) is among the most luminous of creeds.\n\nThe Essence (العين) was not obscured; rather, it gave him its strength,\nSo that he might rectify the deviation (الميل) that was within it.\n\nTake with your secret (سرّك) from him, starting from its centers,\nAscending high to the lofty Moon, up to Saturn (زحل).\n\nTo the Fixed Stars (الثوابت)—do not descend into their domain—\nAnd rise up to the high degree of Aries (الحمل).\n\nAnd from there to the Footstool (الكرسي), then to\nThe encompassing Throne (العرش), to the Forms (الأشكال) and the Archetypes (المثل).\n\nTo Nature (الطبيعة), to the Immaculate Soul (النفس النزيهة), to the Intellect (العقل)\nBound by accidents (الأعراض) and causes (العلل).\n\nTo the Cloud (العماء) above which there is no Soul (نفس),\nFrom there to the Station (المنزل) described as Pre-eternity (الأزل).\n\nAnd look upon the mountain firmly set upon the mountain,\nWhich saw Him, and neither departed nor ceased to be.\n\nWere it not for the loftiness (العلو) that is in the lowliness (السفل), our faces would not\nDescend, seeking the vision (المري) with the eyes.\n\nFor that reason, Allah legislated prostration (السجود) for us,\nSo that we may witness The Real (الحق) in loftiness and in lowliness.\n\nThis is our injunction, if you possess insight (نظر),\nFor it is a stratagem (حيلة) among the best of stratagems.\n\nBy it, you see every known thing (معلوم) in its form,\nAccording to its true reality (حقيقة), not as a substitute.\n\nUntil you see the Highest View (المنظر الأعلى), and it has\nNo manifestation (مجلى) other than you; so do not depart and do not cease to be.\n\nIf He calls you to the spring (عين) of its drinking,\nDo not answer Him, and remain in awe (وجل) of it.\n\nWe are females (إناث) for what is born within us;\nSo let us praise Allah, for there is no male (رجل) in the Cosmos (الكون).\n\nIndeed, the men (الرجال) whose gnosis (العرف) is their essence (عينهم)\nAre the females (الإناث); they are my soul and my hope.\n\n***\n\n### Injunction: Allah Almighty said concerning the general injunction:\n\n<<He has ordained for you of the religion what He enjoined upon Noah and that which We have revealed to you, and what We enjoined upon Abraham and Moses and Jesus—to establish the Religion and not be divided therein.>>\n\nThus, The Real (الحق) commanded the establishment of the Religion, which is the law of the time (شرع الوقت) in every era and creed, and that people should unite upon it and not be divided therein.\n\nFor the Hand of Allah is with the community (الجماعة), and the wolf only eats the straying one (القاصية).\n\nThat is the distant one who has strayed and separated herself from what the community is upon. The wisdom of this is that Allah is not conceived of as a God (إلها) except through His Beautiful Names (أسماؤه الحسنى), not from the perspective of being stripped bare of these Beautiful Names. Thus, there must be the Unity (توحيد) of His Essence (عينه) and the Multiplicity (كثرة) of His Names. By the totality, He is the God. Therefore, the Hand of Allah, which is the Power (القوة), is with the community. A wise man enjoined his children upon his death, and they were a group. He told them, \"Bring me some sticks.\" So they gathered them and he told them, \"Break them while they are bundled.\" They were unable to do so. Then he separated them and told them, \"Take them one by one and break them.\" They broke them. He said to them, \"This is how you will be after me: you will not be overcome as long as you are united. But if you become divided, your enemy will gain power over you and destroy you.\"\n\nLikewise, those who uphold the Religion, if they unite upon establishing the Religion and do not divide therein, their enemy will not conquer them. Similarly, the human being (الإنسان) within himself, if he unites his soul upon establishing the religion of Allah, no devil from mankind or jinn will overcome him through the whispers they cast upon him, especially with the aid of faith (الإيمان) and the angel's assistance.\n\n***\n\n### Injunction:\n\nIf you disobey Allah Almighty in a place, do not leave that place until you perform an act of obedience (طاعة) therein and establish an act of worship (عبادة) therein. For just as it will bear witness against you if called upon, it will also bear witness for you. Only then should you depart from it.\n\nLikewise, concerning your garment: if you disobey Allah while wearing it, be as I have mentioned to you—worship Allah while wearing it. Similarly, regarding what separates from you, such as trimming the mustache, shaving the pubic hair, clipping the nails, combing the hair, and cleaning dirt: nothing of that should leave your body except when you are in a state of ritual purity (طهارة) and remembrance of Allah (ذكر الله) Almighty, for it will be asked about you, how you left it. The least act of worship you can perform during all this is to supplicate to Allah to accept your repentance (توبة) concerning His command, so that you fulfill an obligation (واجبا) by complying with Allah’s command, which is His saying: <<And your Lord said, ‘Call upon Me; I will respond to you.’>>\n\nHe commanded you to supplicate to Him, then He said in this verse: <<Indeed, those who disdain My worship (عِبادَتِي)>>—meaning here by 'worship' (العبادة) is supplication (الدعاء)—that is, whoever disdains humility (الذلة) and lowliness (المسكنة) toward Me, for He named supplication as worship, and worship is humility, submission, and lowliness—<<will enter Hell in humiliation (داخِرِينَ)>>—meaning, abased. But if they perform what they were commanded, Allah will reward them by entering Paradise honorably.\n\nOne day, I entered the bathhouse for a ritual wash that became necessary for me at dawn. I met Najm al-Din Abu al-Ma'ali ibn al-Lahib there, who was my companion. He called for the barber to shave his head. I shouted to him, \"O Abu al-Ma'ali!\" He immediately replied, before I could speak, \"I am in a state of purity (طهارة); I understood you.\" I was astonished by his presence of mind, the swiftness of his understanding, his observance of the situation, the circumstantial evidence, and what he knew of my practice in that regard. I said to him, \"May Allah bless you! By Allah, I only shouted to you so that you would be in a state of purity and remembrance (ذكر) when your hair separated from you.\" He supplicated for me, and then shaved his head.\n\nPeople have neglected this practice; rather, they say, \"If you disobey Allah in a place, move away from it,\" because they fear that the location might remind you of the disobedience, causing you to find it sweet, thus adding sin upon sin. They only mentioned this out of compassion (شفقة), but they missed a great knowledge (علم كبير). So, obey Allah in that place, and only then move away from it. Thus, you combine what they said with what I have enjoined upon you.\n\nWhenever you recall a transgression you committed, repent immediately upon recalling it, seek Allah's forgiveness for it, and remember Allah (اذكر الله) in relation to it, according to the nature of that disobedience.\n\nFor the Messenger of Allah, peace and blessings be upon him, said: \"Follow up a bad deed with a good deed, and it will erase it.\"\n\nAnd Allah Almighty said: <<Indeed, good deeds do away with bad deeds.>> But you must have a balance (ميزان) in this, by which you know the correspondences between the bad deeds and the good deeds that weigh them down.\n\n***\n\n### Injunction:\n\nMaintain a good opinion (حسن الظن) of your Lord in every state, and do not hold a bad opinion of Him. For you do not know whether you are on your last breath (أنفاسك) with every breath that leaves you, so that you die and meet Allah while having a good opinion of Him, not a bad opinion. For you do not know; perhaps Allah will seize you in that outgoing breath, and you will be holding a bad opinion of your Lord, and thus meet Him upon that state.\n\nIt is authentically established from the Messenger of Allah, peace and blessings be upon him, in what he narrated from his Lord, that He Almighty says: \"I am as My servant thinks of Me, so let him think good of Me.\"\n\nHe did not specify one time over another. Make your opinion of Allah a certainty (علما) that He pardons, forgives, and overlooks. Let your Divine caller (الداعي الإلهي) to this opinion be His saying, Almighty: <<O My servants who have transgressed against themselves, do not despair of the mercy of Allah.>>\n\nHe forbade you, and what He forbids, you must cease from. Then He gave news, and His news is truth (صدق) that cannot be abrogated (نسخ), for if abrogation entered it, it would be a lie, and lying about Allah is impossible. So He said: <<Indeed, Allah forgives all sins (جَمِيعاً)>>. He did not specify one sin over another, and He emphasized it with His saying, *all*. Then He completed it by saying: <<Indeed, it is He (إِنَّهُ هُوَ)>>—bringing the pronoun that refers back to Him—<<the Forgiving, the Merciful (الْغَفُورُ الرَّحِيمُ)>>, due to the fact that His Mercy preceded His Wrath. Likewise, He said, *those who have transgressed* (الَّذِينَ أَسْرَفُوا), and He did not specify one transgression over another, but brought the indefinite noun that encompasses every transgressor. Then He added the servants (العباد) to Himself because they are His servants, just as The Real (الحق) said concerning the righteous servant Jesus, peace be upon him, that he said: <<If You punish them, they are Your servants (عِبادُكَ)>>. Thus, He attributed them to Himself Almighty, and the honor of attribution to Allah Almighty is sufficient honor.\n\n***\n\n### Injunction:\n\nHold fast to the remembrance of Allah (ذكر الله) in secret and in public, within yourselves and in assembly (الملإ), for Allah says: <<So remember Me; I will remember you.>> Thus, He made the response to the servant's remembrance the remembrance from Allah.\n\nAnd what hardship (ضراء) upon the servant is more harmful than sin? The Prophet, peace and blessings be upon him, used to say in times of hardship: \"Praise be to Allah in every state,\" and in times of ease: \"Praise be to Allah, the Bestower, the Gracious.\"\n\nFor if you make your heart constantly aware of the remembrance of Allah in every state, your heart will inevitably be illuminated by the light of remembrance (نور الذكر). That light will then grant you Unveiling (الكشف), for it is by light that the unveiling of things occurs. And when Unveiling comes, modesty (الحياء) accompanies it. Your proof of this is your modesty before your neighbor and before anyone whom you recognize as having a right and status. There is no doubt that faith (الإيمان) grants you the magnification of The Real (تعظيم الحق) within you. Our discourse is only with the believers, and our injunction is only for every Muslim who believes in Allah and in what came from Him.\n\nAnd Allah says in the authentic, transmitted report (الخبر المأثور الصحيح) concerning Him, the Hadith, which includes: \"And I am with him\"—meaning with the servant—\"when he remembers Me. If he remembers Me within himself, I remember him within Myself. And if he remembers Me in an assembly (ملأ), I remember him in an assembly better than theirs.\"\n\nAnd Allah Almighty said: <<And the men who remember Allah often and the women who remember [Him] (والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ)>>. The greatest remembrance is the remembrance of Allah in every state.\n\n***\n\n### Injunction:\n\nPersevere in performing all acts of proximity (القرب) to the best of your ability, in every time and state, according to what The Real addresses you with through the tongue of that time and the tongue of that state.\n\nFor if you are a believer (مؤمنا), no act of disobedience (معصية) will ever be pure for you without being mixed with an act of obedience (طاعة), because you believe that it is disobedience. If you add seeking forgiveness (استغفار) or repentance (توبة) to this mixture, then it is obedience upon obedience and proximity upon proximity. Thus, the part of obedience mixed with the bad deed is strengthened. Faith is among the strongest and greatest acts of proximity (القرب) with Allah, for it is the foundation upon which all acts of proximity are built. Part of faith is your judgment concerning Allah according to what He has judged concerning Himself.\n\nIn the authentic report concerning Him Almighty, in which He mentioned: \"If he draws near to Me by a span, I draw near to him by a cubit. If he draws near to Me by a cubit, I draw near to him by an arm's length. If he comes to Me walking, I come to him running (هرولة).\"\n\nThe reason for this multiplication (التضعيف) from Allah, and the lesser amount from the servant, is that the servant must proceed cautiously due to the intention (النية) of drawing near to Allah through the action, and he is commanded to weigh his actions by the balance of the Law (ميزان الشرع). Thus, caution is necessary, even if he is quick and described by speed; his speed is only in establishing the balance for that action, not in the action itself. For establishing the balance validates the transaction. Allah's proximity does not require a balance, for the established Balance of The Real (ميزان الحق) which is in His Hand is the very balance by which you weighed that action through which you seek proximity to Allah. Therefore, His attribute must be that His proximity to you is stronger and greater than your proximity to Him. He described Himself as drawing near to you in your proximity to Him by double what you drew near, measure for measure, because you were created upon the Form (الصورة). The least of your vicegerency (خلافة) is your vicegerency over your own self (ذاتك). You are His vicegerent in the land of your body, and your subjects are your limbs and your manifest and hidden powers. Thus, the essence (عين) of His proximity to you is your proximity to Him plus an increase, which is what He mentioned: the cubit, the arm's length, and the running. A span to a span is a cubit, and a cubit to a cubit is an arm's length, and walking, when doubled, is running. So He is in the first (your proximity to Him), and He is in the last (His proximity to you). Thus, <<He is the First and the Last (هُوَ الْأَوَّلُ والْآخِرُ)>>.\n\nThis is the appropriate proximity. The Divine proximity (القرب الإلهي) to all creation is different from this, which is His saying: <<And We are nearer to him than [his] jugular vein (حَبْلِ الْوَرِيدِ)>>. That proximity is not what is intended here. Rather, what is intended is the proximity that is the reward for the servant's proximity to Allah. And the servant has no proximity to Allah except through faith in what came from Allah, after faith in Allah and in the one who conveyed from Allah.\n\n***\n\n### Injunction:\n\nObligate yourself to contemplate (الحديث) good deeds, even if you do not perform them. And whenever your soul contemplates evil, resolve to abandon it for the sake of Allah, unless the preceding Destiny (القدر السابق) and the subsequent Decree (القضاء اللاحق) overcome you. For if Allah does not decree that you perform that thing which your soul contemplated, He writes it down for you as a good deed (حسنة).\n\nIt is authentically established from the Messenger of Allah, peace and blessings be upon him, from his Lord Almighty, that He says: \"If My servant contemplates performing a good deed, I write it down for him as one good deed, as long as he does not perform it.\"\n\nThe word *mā* (ما) here denotes duration (ظرفية). Thus, every moment that passes while he contemplates performing this good deed, even if he does not perform it, Allah writes it down for him as one good deed for every moment during which he maintains the contemplation, no matter how numerous those moments become. For him, every moment of contemplation is a good deed. This is why He said, *as long as he does not perform it*. Then Allah Almighty said: <<But if he performs it, I write it down for him as ten times its like.>>\n\nFrom this comes the obligation of the tenfold reward for what the heavens watered, if you know. If the good deeds are transitive (متعدية) and enduring, the reward is renewed for them as long as they remain until the Day of Resurrection, such as ongoing charity (الصدقة الجارية), like endowments (الأوقاف), the knowledge disseminated among people, the good precedent (السنة الحسنة), and similar things.\n\nThen He perfected His favors upon His servants, and He Almighty said: <<And if he contemplates performing a bad deed, I forgive it for him, as long as he does not perform it.>> The *mā* here denotes duration, just as it did for the good deed, and the ruling is the same concerning the contemplation and the reward, no matter how long it lasts.\n\nThen He said: <<But if he performs it, I write it down for him as its like.>> Thus, He established justice (العدل) for the bad deed and grace (الفضل) for the good deed, which is His saying: <<For those who have done good is the best [reward] (الْحُسْنى‏) and increase (وزِيادَةٌ)>>. The increase is the grace, which is what exceeds the like.\n\nThen Allah Almighty informed us that the angels speak according to the original decree upon them, which made them utter concerning our father Adam, their saying: <<Will You place upon it one who causes corruption therein and sheds blood?>> They mentioned only our faults and did not address the good aspects of it. For the Highest Assembly (الملأ الأعلى) is dominated by jealousy (الغيرة) for the Majesty of Allah, lest it be diminished. They knew, from this elemental creation (النشأة العنصرية), that it must disobey its Lord due to the reality upon which it exists, and this knowledge they possess by tasting (الذوق) from their own essence (ذاتها). This is only more manifest in our creation. Were it not that the angels in their creation are upon the form of our creation, Allah would not have mentioned that they <<dispute (يَخْتَصِمُونَ)>>, and dispute only occurs between opposites.\n\nAllah did not mention that the angels say concerning us, \"That is Your servant who intends to perform a good deed.\" Look at the strength of this principle, how sound it is for the one who reflects! From this, you learn the virtue of the human being (الإنسان) when he mentions the good in someone and remains silent about their evil—where his rank stands compared to the beautiful intention of the angels in what they mentioned. However, I alerted you to what I alerted you to so that you may know their creation and what they were molded upon, for <<Each acts according to his manner (كُلٌّ يَعْمَلُ عَلى‏ شاكِلَتِهِ)>>, as Allah Almighty said. He informed us that the angels say, \"That is Your servant, so-and-lan, who intends to perform a bad deed,\" and He is more seeing of him, so He said, \"Watch him. If he performs it, write it down for him as its like. But if he abandons it, write it down for him as a good deed, for he only abandoned it *for My sake* (من جرائي).\"\n\nThe angels mentioned here are those about whom Allah said to us: <<And indeed, [appointed] over you are guardians (لَحافِظِينَ), noble scribes (كِراماً كاتِبِينَ).>> Their rank and authority allowed them to speak as they did. They record the good without being informed of what Allah had previously commanded them concerning it, and they speak concerning the bad deed because they know Allah's grace and forbearance. Were it not for their speaking about this, we would not have known the ruling concerning it with Allah, such as what they say in the assemblies of remembrance (مجالس الذكر) concerning the person who attends them for his own need, not for the sake of remembrance. Allah granted forgiveness to everyone and said, \"They are the people whose companion shall not be wretched.\" Were it not for their questioning and their informing about them, we would not have known Allah's ruling concerning them. Thus, their speech, peace be upon them, is instruction and mercy, even if its apparent meaning, along with the principle we alerted you to, might lead to deficient understandings.\n\nAllah said concerning the good deed and the bad deed: <<Whoever comes with a good deed will have ten times its like (عَشْرُ أَمْثالِها)>>—and I increase—<<and whoever comes with a bad deed will not be recompensed except with its like (إِلَّا مِثْلَها)>>—and I forgive after the recompense for some people, and before the recompense for others. Thus, forgiveness is inevitable for every transgressor (مسرف) against himself, even if he does not repent. Whoever realizes this injunction knows the relationship between the human creation (النشأة الإنسانية) and the angelic creation (الملكية), and that the Origin (الأصل) is one, just as our Lord is One and possesses the contrasting Names (الأسماء المتقابلة). Thus, Existence (الوجود) came to be upon the Form of the Names.\n\n***\n\n### Injunction:\n\nPersevere in the Word of Islam (كلمة الإسلام), which is your saying, *Lā ilāha illā Allāh* (There is no god but Allah), for it is the best of remembrances (الأذكار) due to the increase of knowledge (زيادة علم) it contains. The Prophet, peace and blessings be upon him, said: \"The best thing I and the Prophets before me have said is *Lā ilāha illā Allāh*.\"\n\nIt is a word that combines negation (النفي) and affirmation (الإثبات), and the division is restricted. No one knows what this word contains except he who knows its weight and what it weighs, as mentioned in the report we shall cite concerning its indication. Know that it is the word of Unity (توحيد), and Unity is not comparable to anything, for if anything were comparable to it, it would not be One, or it would be two or more. Thus, there is nothing that weighs it, for only the equivalent and the like can weigh it, and there is no like or equivalent. That is the impediment that prevented *Lā ilāha illā Allāh* from entering the Balance (الميزان).\n\nThe common scholars (العامة من العلماء) hold that polytheism (الشرك), which opposes Unity, cannot coexist in the servant's utterance alongside Unity. Thus, the human being is either a polytheist (مشرك) or a Unitarian (موحد). Therefore, only polytheism can weigh Unity, and they cannot be combined in a balance. In our view, it did not enter the Balance because of what is mentioned in the authentic report from Allah, for the one who understands and reflects upon it. Allah says: \"If the seven heavens and their inhabitants other than Me, and the seven earths and their inhabitants other than Me, were placed in one pan, and *Lā ilāha illā Allāh* were placed in the other pan, *Lā ilāha illā Allāh* would outweigh them.\"\n\nHe mentioned only the heavens and the earth because the Balance has no place except beneath the concave sphere of the Fixed Stars, from the Lote Tree of the Utmost Boundary (السدرة المنتهى), where the deeds of the servants terminate. The Balance was established for these deeds, so the Balance does not exceed the place that the deeds do not exceed. Then He said, *and their inhabitants other than Me*. Yet, they have no inhabitant except Allah. For the expert, the allusion is sufficient. In the language of the common scholars of the outward Law (علماء الرسوم), *other* means the partner (الشريك) that the polytheist affirms. If that partner had a share in creation, *Lā ilāha illā Allāh* would outweigh it in the Balance, because *Lā ilāha illā Allāh* is the stronger in every case, given that the polytheist favors the side of Allah Almighty over the side of what he associates with Him. Concerning them, He said that they said: <<We only worship them that they may bring us nearer to Allah in proximity (زُلْفى‏)>>. If the Balance of Existence (ميزان الوجود) is raised—not the Balance of Unity (ميزان التوحيد)—then *Lā ilāha illā Allāh* enters it. It may also enter the Balance of the Unity of Magnification, which is the polytheists' unity, and *Lā ilāha illā Allāh* weighs it and outweighs it. For if the Inhabitant is none other than Allah, it does not outweigh. The essence of what He mentioned is only Allah. He said, \"Where would it outweigh, when there is only One in both pans?\"\n\nAs for the Man of the Scrolls (صاحب السجلات), the pan only tipped because of the card (البطاقة), for it was the card that the Balance contained, since *Lā ilāha illā Allāh* is uttered by its speaker, and the angel wrote it down. Thus, it is the written *Lā ilāha illā Allāh*, created in the utterance. If it were placed for everyone who uttered Unity, no one would enter the Fire. Allah only wished for the people of the Standing (الموقف) to see its virtue in the Man of the Scrolls. It is not seen or placed until after those Unitarians whom Allah willed to enter the Fire have entered, and then they exit by intercession (الشفاعة) or Divine Providence (العناية الإلهية). When no Unitarian remains in the Standing whom Allah decreed to enter the Fire, then the Man of the Scrolls is brought forward, and only those who will enter Paradise, having no share in the Fire, remain in the Standing. He is the last of creation for whom the weighing is performed. For *Lā ilāha illā Allāh* has the Beginning and the End, and sometimes the essence of its beginning is its end, like the Man of the Scrolls.\n\n### [Indeed, Allah placed the best and most universally beneficial things in the general sphere]\n\nThen know that Allah only placed the best things, the most universally beneficial, and the heaviest in weight in the general sphere (العموم), because He compares many opposites with them. Therefore, what is placed in the general sphere must possess the strength to counter every opposite. Not every Gnostic (عارف) among the People of Allah realizes this, except the Prophets who legislated for people what they legislated. There is no doubt that he, peace and blessings be upon him, said: \"The best thing I and the Prophets before me have said is *Lā ilāha illā Allāh*.\"\n\nHe spoke of what indicated its virtue, even though some who claim exclusivity in remembrance (الذكر) use the words *Allah, Allah* or *Huwa, Huwa* (He, He). There is no doubt that these are among the utterances of which *Lā ilāha illā Allāh* is superior, according to the scholars of Allah. So, O friend (ولي), hold fast to the remembrance established in the general sphere, for it is the strongest remembrance, possesses the brightest light (النور الأضوى), and the nearest station (المكانة الزلفى). No one perceives this except he who adheres to it and acts upon it until he masters it. For Allah only expanded His Mercy for the sake of comprehensiveness (الشمول) and the attainment of hope (بلوغ المأمول). There is no one who does not seek salvation, even if he is ignorant of its path.\n\nWhoever negates his essence (عينه) with *Lā ilāha* (There is no god) affirms his existence (كونه) with *illā Allāh* (but Allah). Thus, you negate your essence by decree (حكما), not by knowledge (علما), and you affirm the existence of The Real (كون الحق) by decree and by knowledge. The God (الإله) is He who possesses all the Names, and they belong only to a single Essence (عين واحدة), which is the Named, Allah, the Inhabitant of the heavens and the earth, in whose Hand is the Balance of Raising and Lowering. Therefore, you must adhere to this remembrance, with which Allah has coupled happiness (السعادة) and the knowledge of it, thus making it universal.\n\nBeware of showing enmity (معاداة) toward the People of *Lā ilāha illā Allāh*, for they possess the general guardianship (الولاية العامة) from Allah. They are the friends of Allah (أولياء الله), even if they err and come with sins nearly filling the earth, provided they do not associate partners with Allah; Allah will meet them with forgiveness of the like amount.\n\nWhoever's guardianship (ولاية) is established, fighting him is forbidden. And whoever fights Allah, Allah has mentioned his recompense in this world and the Hereafter. Anyone whose enmity toward Allah has not been revealed to you by Allah, do not take him as an enemy. The least you can do if you are ignorant of his state is to disregard his affair. But if you ascertain that he is an enemy of Allah—and that is only the polytheist (المشرك)—then disavow him, just as Abraham the Intimate (الخليل), peace be upon him, did concerning his father Azar. Allah Almighty said: <<But when it became clear to him that he was an enemy of Allah, he disassociated himself from him.>>\n\nThis is your balance. Allah Almighty says: <<You will not find a people who believe in Allah and the Last Day loving those who oppose Allah and His Messenger, even if they were their fathers>>—as Abraham the Intimate did—<<or their sons or their brothers or their kindred.>> Whenever you do not know this, do not show enmity toward the servants of Allah, neither potentially nor by what appears on the tongue. What you should dislike is his action, not his essence (عينه). The enemy of Allah is the one whose essence you dislike. So, differentiate between the one whose essence you dislike, who is the enemy of Allah, and the one whose action you dislike, who is the believer or one whose end you do not know, who is not a Muslim at the moment.\n\nAnd beware of His saying in the authentic Hadith: \"Whoever shows enmity to a friend (ولي) of Mine, I declare war upon him.\"\n\nFor if one is ignorant of his affair and shows enmity toward him, he has not fulfilled the right of The Real (حق الحق) concerning His creation. He does not know Allah's knowledge concerning him, nor has Allah revealed it to him, so that he might disavow him and take him as an enemy. If you know his apparent state, even if he is an enemy of Allah in reality and you do not know it, then befriend him (واله) to establish the right of Allah, and do not show enmity toward him. For the manifest Divine Name (الاسم الإلهي الظاهر) will dispute with you before Allah. Do not give Allah a conclusive argument (حجة) against you, lest you perish, for <<To Allah belongs the conclusive argument (الْحُجَّةُ الْبالِغَةُ)>>.\n\nDeal with the servants of Allah with compassion (الشفقة) and mercy (الرحمة), just as Allah provides for them despite their disbelief and polytheism, knowing their state. He only provided for them because of His knowledge that what they are in is not due to them, but rather they are in it due to them, as we mentioned in the language of the general sphere: <<Indeed, Allah is the Creator of all things (خالِقُ كُلِّ شَيْ‏ءٍ)>>, and their disbelief and polytheism are created within them. And in the language of the specific sphere: no ruling has appeared in an existent thing except according to what it was in the state of non-existence, in its fixed essence (ثبوته) which Allah knew of it. Thus, <<To Allah belongs the conclusive argument>> against everyone, whenever dispute or contention occurs, so submit the matter to Him.\n\nKnow that you are upon what you were upon. Extend your mercy and compassion to all animals and created beings. Do not say, \"This is a plant or an inanimate object; they have no awareness.\" Yes, they have awareness; it is you who lack awareness. Leave Existence (الوجود) as it is, and show mercy to it with a mercy that is inherent in its existence. Do not look at it from the perspective of what is established in it at the moment, <<until those who spoke the truth become clear to you and you know the liars (الْكاذِبِينَ)>>. At that point, it becomes incumbent upon you to take them as enemies, because Allah commanded you to do so, having forbidden you from taking His enemy as a friend (وليا) to whom you extend affection. If weakness of certainty (ضعف يقين) compels you to placate them, then placate them without extending affection, but merely as a peaceful measure to ward off evil from yourself. So, entrust the matter to Him and rely upon Him in every state until you meet Him.\n\n***\n\nYou must adhere strictly to what Allah has obligated upon you (افترضه الله عليك) in the manner He commanded you to perform it. When you complete the structure of your obligations (نشأة فرائضك)—and completing them is an obligation upon you—then you dedicate the time between the two obligations to supererogatory acts (نوافل الخيرات), whatever they may be. Do not belittle any of your deeds, for Allah did not belittle it when He created and brought it into existence. Allah only charged you with a command because He has concern and care for that command, even though you are greater in rank with Him. For you are the locus for the existence of what He charged you with, since the charging (التكليف) relates only to the actions of the charged ones, relating to the charged one from the perspective of his action, not from the perspective of his essence (عينه).\n\n### [Indeed, when the servant perseveres in performing the obligations, he draws near to Allah through the most beloved matters that bring proximity to Him]\n\nKnow that if you persevere in performing the obligations (الفرائض), you draw near to Allah through the most beloved matters that bring proximity to Him. If you possess this attribute, you become the hearing of The Real (سمع الحق) and His sight. He hears only through you and sees only through you. Thus, the Hand of The Real is your hand: <<Indeed, those who pledge allegiance to you are only pledging allegiance to Allah. The Hand of Allah is over their hands (يَدُ الله فَوْقَ أَيْدِيهِمْ)>>. Their hands, insofar as they are the Hand of Allah, are above their hands insofar as they are their own hands. For the pledging of allegiance (المبايعة) is an active participle, and the Agent (الفاعل) is Allah. Thus, their hands are the Hand of Allah. Through their hands, He Almighty pledged allegiance, and they are the ones pledging allegiance. All secondary causes (الأسباب) are the Hand of The Real, which possesses the power to bring about the effects (المسببات). This is the greatest love (المحبة العظمى), concerning which there is no explicit text as there is concerning the supererogatory acts (النوافل). For perseverance in supererogatory acts results in a Divine love (حبا إلهيا) explicitly stated, whereby The Real becomes the servant's hearing and sight, just as the matter was reversed in the love for performing obligations.\n\nIn the obligation (الفرض) is the servitude of necessity (عبودية الاضطرار), which is the original servitude. In the branch, which is the supererogatory act (النفل), is the servitude of choice (عبودية الاختيار). In it, The Real is your hearing and your sight. It is called *nafl* (supererogatory) because it is an addition, just as you are fundamentally an addition to Existence (الوجود), since Allah was, and you were not, and then you came to be, and contingent existence (الوجود الحادث) was added. Thus, you are a supererogatory addition (*nafl*) in the Existence of The Real. You must have a deed called *nafl*, which is your origin, and you must have a deed called *fard* (obligation), which is the Origin of Existence, which is the Existence of The Real (وجود الحق). In performing the obligation, you are for Him; and in the supererogatory act, you are for yourself. And His love for you, insofar as you are for Him, is greater and more intense than His love for you, insofar as you are for yourself.\n\nIt is mentioned in the authentic report from Allah Almighty: \"My servant does not draw near to Me with anything more beloved to Me than what I have obligated upon him. And My servant continues to draw near to Me through supererogatory acts until I love him. When I love him, I am his hearing with which he hears, his sight with which he sees, his hand with which he strikes, and his foot with which he walks. If he asks Me, I shall surely give him, and if he seeks refuge in Me, I shall surely grant him refuge. I have not hesitated concerning anything I am about to do as I hesitate concerning the soul of My believing servant; he dislikes death, and I dislike causing him distress.\"\n\nLook at what the love of Allah produces! So, persevere in performing what validates the existence of this Divine love. A supererogatory act is not valid until the obligation is completed. And within the supererogatory act itself are obligations and supererogatory acts. It is by the obligations within it that the primary obligations are completed.\n\nIt is mentioned in the authentic Hadith that He Almighty says: \"Look at My servant's prayer. Did he complete it or fall short?\" If it was complete, it is written for him as complete. If he fell short in anything, He says, \"Look, does My servant have any voluntary (تطوع) acts?\" If he has voluntary acts, Allah says, \"Complete My servant's obligation (فريضة) from his voluntary acts.\"\n\nThen deeds are taken upon that basis. Supererogatory acts are only those that have an origin in the obligations. That which has no origin in an obligation is the establishment of an independent worship, which the scholars of the outward Law (علماء الرسوم) call innovation (*bid'a*). Allah Almighty said: <<And monasticism (ورَهْبانِيَّةً) which they innovated (ابْتَدَعُوها)>>. Yet the Messenger of Allah, peace and blessings be upon him, called it a good precedent (*sunna ḥasana*). The one who establishes it receives its reward and the reward of everyone who acts upon it until the Day of Resurrection, without diminishing any of their rewards.\n\nSince the supererogatory act does not have the power to fill the place of the obligation, obligations were placed within the supererogatory act itself, so that obligations might be compensated by obligations, such as the supererogatory prayer (صلاة النافلة) by original decree. Furthermore, it includes obligations such as remembrance, bowing, and prostration, even though it is originally supererogatory. These sayings and actions within it are obligations.\n\n***\n\nYou must observe your sayings just as you observe your actions, for your sayings are part of your actions. For this reason, some scholars said: \"Whoever counts his speech as part of his action, his speech will be little.\"\n\n### [That Allah is present at the tongue of every speaker]\n\nKnow that Allah observes the sayings of His servants, and that Allah is present at the tongue of every speaker. What Allah has forbidden you to utter, do not utter it, even if you do not believe it, for Allah will question you about it. We have narrated that the angel does not write down what the servant does until he speaks it. Allah Almighty said: <<Not a word does he utter but there is a watcher by him ready [to record] (رَقِيبٌ عَتِيدٌ)>>—meaning the angel who records your sayings against you. He Almighty says: <<And indeed, [appointed] over you are guardians, noble scribes (كِراماً كاتِبِينَ), who know what you do (يَعْلَمُونَ ما تَفْعَلُونَ)>>. And your sayings are part of your actions.\n\nLook at His saying, Almighty: <<And do not say about those who are killed in the way of Allah that they are dead (أَمْواتٌ)>>. He forbade you from the saying, for whoever says such a thing has contradicted Allah, for Allah said concerning them that they are alive. Do you not see His saying, Almighty, where He says: <<And never think of those who have been killed in the cause of Allah as dead. Rather, they are alive with their Lord (أَحْياءٌ عِنْدَ رَبِّهِمْ)>>. And He said: <<Allah does not like the public mention of evil speech (الْجَهْرَ بِالسُّوءِ من الْقَوْلِ)>>. And He said: <<There is no good in much of their secret conversation (نَجْواهُمْ)>>, which is speech. So, when you speak, speak according to the balance of what Allah has legislated for you to speak. The Messenger of Allah, peace and blessings be upon him, used to joke but would only speak the truth.\n\nYou must speak the truth (الحق) that pleases Allah. Not every truth that is spoken pleases Allah. For slander (النميمة) is true, and backbiting (الغيبة) is true, yet they do not please Allah, and you have been forbidden from backbiting or slandering anyone.\n\nAmong Allah's observance of sayings is what we narrated in *Sahih Muslim* from Allah Almighty, when the sky rained. He Almighty said: \"Some of My servants woke up believing in Me and disbelieving, and some woke up disbelieving in Me and believing. Whoever said, 'We were given rain by the rising of such-and-such star (بنوء كذا وكذا),' he is a disbeliever in Me, a believer in the star. And whoever said, 'We were given rain by the grace and mercy of Allah,' that one is a believer in Me, a disbeliever in the star.\"\n\nThus, He observed the sayings of the speakers. Abu Hurayrah used to say when the sky rained, \"We were given rain by the rising of the Fath star,\" then he would recite: <<Whatever Allah grants to people of mercy, none can withhold it (ما يَفْتَحِ الله لِلنَّاسِ من رَحْمَةٍ فَلا مُمْسِكَ لَها)>>. Even if you believe that Allah is the One who established and set up the secondary causes (الأسباب) and instituted the custom (العادة) among us that He performs things *at* them, not *by* them, despite all this, do not say what Allah has forbidden you to say or utter. For just as He forbade you from certain actions, He forbade you from certain speech, even if it is true. Look at how wise the saying of Allah Almighty is in His statement: *believer in Me, disbeliever in the star*, and *disbeliever in Me, believer in the star*. For whenever one speaks of the grace of Allah, he has covered (ستر) the star by not uttering its name. And whoever speaks of the star has covered Allah, even if he believes that He is the Doer, the Sender of the rain, but he did not utter His Name. Thus, He Almighty used the word *kufr* (disbelief), which means *covering*. So, beware of uttering the phrase \"seeking rain by the stars\" (الاستمطار بالأنواء), let alone believing in it. For your belief, if you are a believer, is that Allah established them as customary signs (أدلة عادية), and every customary sign is subject to the possibility of the custom being broken (خرق العادة). So, beware of the pitfalls of customs, and let them not divert you from the limits of Allah (حدود الله) that He set for you. Do not transgress them, for Allah only set them because He observed them, and this applies to everything.\n\nIt is mentioned in the authentic report that a man speaks a word that incurs the wrath of Allah, not thinking it would reach what it reached, and he falls with it into the Fire for seventy autumns. And a man speaks a word that incurs the pleasure of Allah, not thinking it would reach what it reached, and he is raised by it into the highest heavens (*Illiyyin*).\n\nSo, do not utter anything except what pleases Allah, not what incurs Allah's wrath upon you. This is only possible for you by knowing the limits He set for you in your utterance. This is a door that people have neglected. The Messenger of Allah, peace and blessings be upon him, said: \"Will people be thrown onto their faces in the Fire except for the harvests of their tongues?\" And the wise man said: \"Nothing is more deserving of imprisonment than the tongue.\" Yet Allah placed it behind two doors—the lips and the teeth—and despite this, it often indulges in excess and opens the doors.\n\n***\n\nBeware of making an image (صورة) with your hand that is capable of having a soul (روح), for that is a matter people take lightly, but <<it is great with Allah (هُوَ عِنْدَ الله عَظِيمٌ)>>. The image-makers (المصورون) will receive the severest punishment on the Day of Resurrection. It will be said to the image-maker on the Day of Resurrection, \"Give life to what you created,\" or \"Breathe a soul into it,\" and he will not be able to breathe.\n\nIt is mentioned in the authentic Hadith from Allah Almighty that He said: \"And who is more unjust than one who goes to create a creation like My creation? Let them create an atom, or let them create a grain, or let them create a barleycorn.\"\n\nIf the servant observes this limit and abandons image-making due to what has been reported from Allah concerning it, and does not compete with Lordship (الربوبية) in depicting anything, whether animal or non-animal, he will gain insight into the life of every form (صورة) in the World (العالم). He will see all of it as a speaking animal (حيوانا ناطقا) glorifying the praise of Allah. But if he allows himself to depict plants or what has no soul in the visible realm, according to customary sight, he will never gain such Unveiling (الكشف). For, in reality, every form in the World has a soul, but Allah has veiled our eyes from perceiving the life of what we call non-animal. In the Hereafter, the matter will be unveiled universally, which is why He named it the Abode of the Living (الدار الحيوان). You will not see anything there except that it is alive and speaking, contrary to your state in this world. As was narrated in the authentic Hadith, the pebbles glorified Allah in the palm of the Messenger of Allah, peace be upon him. People considered the glorification of the pebbles to be the breaking of custom (خرق العادة) and erred. Rather, the breaking of custom was in the hearing of the listeners. For the pebbles never ceased glorifying, as Allah informed, unless they glorified with a specific glorification or a specific manner of utterance that the pebbles had not used before, or in that specific manner. In that case, the breaking of custom would be in the pebbles, not in the hearing of the listener. What occurred in the hearing of the listener was that he heard the speech of something whose speech is not customarily heard.\n\n***\n\nO my brother, you must visit the sick (عيادة المرضى) because of the reflection (الاعتبار) and reminder (الذكرى) it contains. For Allah created the human being from <<weakness (ضَعْفٍ)>>. Looking at him during your visit alerts you to your origin, so that you may feel need for Allah to grant you strength by which you can obey Him, and that Allah is with His servant when he is sick. Do you not see that the sick person has no recourse except to Allah and no remembrance except Allah? The Real (الحق) is constantly uttered by his tongue, and his heart constantly seeks refuge in Him. The sick person remains with Allah, whatever his illness, even if he seeks medical treatment and takes the customary means for the occurrence of healing. Despite that, he does not neglect Allah, and that is due to the presence of Allah with him.\n\nAnd Allah will say on the Day of Resurrection: \"O son of Adam, I was sick, and you did not visit Me.\" He will say, \"O Lord, how could I visit You, when You are the Lord of the Worlds?\" He will say, \"Did you not know that My servant so-and-so was sick, and you did not visit him? Did you not know that if you had visited him, you would have found Me with him?\" The Hadith is authentic.\n\nHis saying, *you would have found Me with him*, refers to the sick person's remembrance of his Lord in secret and in public.\n\nLikewise, if one of Allah's creation asks you for food (استطعمك) or drink (استسقاك), feed him and give him drink if you possess the means. For if you had no honor or status other than that this person asking for food or drink has placed you in the station of The Real (منزلة الحق), who feeds His servants and gives them drink, that would be enough. This is an insight few reflect upon. Look at the beggar when he asks and raises his voice, saying, \"By Allah, give me!\" Allah only made him utter His Name in this state, and he only raised his voice so that you might hear him and give him. He has named you with the Name Allah and sought refuge in you by raising his voice, just as he seeks refuge in Allah. Whoever places you in the station of his Master, you should not deprive him, but hasten to give him what he asked for.\n\nFor in this Hadith we cited earlier concerning the servant's sickness, Allah says: \"O son of Adam, I asked you for food, and you did not feed Me.\" He will say, \"O Lord, how could I feed You, when You are the Lord of the Worlds?\" He will say, \"Did you not know that My servant so-and-so asked you for food, and you did not feed him? Did you not know that if you had fed him, you would have found that with Me? O son of Adam, I asked you for drink, and you did not give Me drink.\" He will say, \"O Lord, how could I give You drink, when You are the Lord of the Worlds?\" He will say, \"Did you not know that My servant so-and-so asked you for drink, and you did not give him drink? Did you not know that if you had given him drink, you would have found that with Me?\" This Hadith was transmitted by Muslim from Muhammad ibn Hatim, from Bahz, from Hammad ibn Salamah, from Thabit, from Abu Rafi', from Abu Hurayrah, who said that the Messenger of Allah, peace be upon him, said.\n\nThus, Allah placed Himself in this report in the station of His servant. The servant who is present with Allah, remembering Allah in every state, sees The Real (الحق) in such a situation as the One who asked him for food and drink. So, he hastens to provide what The Real requested of him. For he does not know; perhaps on the Day of Resurrection, he will be placed in the state of need of this person who asked him for food and drink, and Allah will reward him for that. This is His saying, *you would have found that with Me*—meaning, that food and drink I would raise and nurture for you until you come on the Day of Resurrection, and I will return it to you better, purer, and greater than it was.\n\nIf you do not have the aspiration to see that the one who asked you for drink has placed you in the station of the One in whose Hand is the fulfillment of his need, since Allah made you His vicegerent (خليفة) over him, then the least you can do is fulfill the need of this beggar with the intention of trade, seeking profit and the multiplication of the good deed. How much more so when you come upon such a report and see that it is Allah who asked you for what you are made a vicegerent over, for everything belongs to Allah! He commanded you to spend from what He made you vicegerent over, saying: <<And spend from that over which He has made you successors (مُسْتَخْلَفِينَ فِيهِ)>>. He magnified the reward for spending. So, do not turn away a beggar, even if only with a kind word, and meet him with a cheerful face, delighted by him, for you are only meeting Allah.\n\nAl-Husayn or Al-Hasan, peace be upon them, when asked by a beggar, would hasten to give him and say, \"Welcome, by Allah, to the carrier of my provision to the Hereafter!\" because he saw that the beggar had carried the burden away from him. The beggar was like a riding beast for him, because if Allah bestows a favor upon a person and no one else carries the surplus of it, he will come with it on the Day of Resurrection carrying it himself until he is questioned about it. For this reason, Al-Hasan used to say that the beggar is the carrier of his provision to the Hereafter, thus lifting the burden of carrying from him.\n\n***\n\nBeware of injustices against the servants (مظالم العباد), for injustice (الظلم) is darknesses on the Day of Resurrection. Injustice against the servants is withholding their rights that Allah has obligated you to render to them. This may occur through the state (بالحال), in the necessity (الاضطرار) you see him in, while you are capable and possess the means to fill his need (خلته) and repel his necessity. It becomes incumbent upon you to know that his state grants him a right in your wealth, for Allah only made you aware of him so that you might render his right to him; otherwise, you are accountable. If you do not have the means to fill his need,\n\n### [Indeed, Allah desires the servant to assist him with a kind word before one whom he knows can fill his need]\n\nKnow that Allah did not make you aware of his state in vain. Know that He desires you to assist him with a kind word before one whom you know can fill his need. If you cannot act, the least you can do is offer a supplication (دعوة) for him. This should only occur after exhausting your effort and despairing, until nothing remains with you except supplication. Whenever you neglect this much, you are among those who have wronged the person in this state.\n\nThis applies if that needy person dies from that need. But if he does not die and someone else among the believers fills his need, then your brother has dropped this claim against you without realizing it. For the believer is the brother of the believer; he does not abandon him, even if the giver did not intend that. But this is how it is in reality, and this is how Allah accepts it.\n\nSo, if you give a beggar, whose necessity is evident in his state, what he needs, intend thereby to act as a deputy for your first believing brother who deprived him, and consider that act of deprivation as an act of preference (إيثارا) on his part toward your station, concerning that good deed which he preserved for your sake so that you might attain it. For if he had given him, the beggar would have been satisfied with what he was given, and you would not have found that good deed. With this intention, the giving of the Gnostics (العارفين) is performed—those who attend to necessities, whether requested by state or by word. <<And as for the petitioner (السَّائِلَ), do not repel him (فَلا تَنْهَرْ)>>.\n\nThis applies whether the provision is sensory or spiritual. Knowledge (العلم) and benefit fall under this category. The misguided seeks guidance, the hungry seeks food, the naked seeks clothing that protects him from the cold and heat of the air and covers his nakedness, and the offender who knows you are capable of punishing him seeks your pardon for his offense. So, guide the neighbors, feed the hungry, give drink to the thirsty, and clothe the naked. Know that you are poor (فقير) in relation to what others need from you, and Allah <<is free of need of the worlds (غَنِيٌّ عَنِ الْعالَمِينَ)>>. Yet, despite this, He answers their supplications, fulfills their needs, and asks them to ask Him to repel harm from them and deliver benefits to them. You are more deserving of treating the servants of Allah in this manner, due to your own need for Allah in these matters.\n\nMuslim transmitted in his *Sahih* from Abdullah ibn Abd al-Rahman ibn Bahram al-Darimi, from Marwan ibn Muhammad al-Dimashqi, from Sa'id ibn Abd al-Aziz, from Rabi'ah ibn Yazid, from Abu Idris al-Khawlani, from Abu Dharr, from the Prophet, peace and blessings be upon him, in what he narrated from Allah, Blessed and Exalted, that He said: \"O My servants, I have forbidden injustice (الظلم) for Myself and made it forbidden among you, so do not commit injustice against one another. O My servants, all of you are astray except for those whom I guide, so seek guidance from Me, and I will guide you. O My servants, all of you are hungry except for those whom I feed, so seek food from Me, and I will feed you. O My servants, all of you are naked except for those whom I clothe, so seek clothing from Me, and I will clothe you. O My servants, you sin by night and by day, and I forgive all sins, so seek forgiveness from Me, and I will forgive you.\"\n\nThe Real Almighty grants you all of this without your asking Him for it. However, despite this, He commanded you to ask Him, so that He grants you a response to your request, showing you His care for you by accepting your request. This is another station, an addition to what He already granted you. Since your asking is by His command, and He knew that you would ask Him, and that the necessity of the origin upon which you were created—need and asking—is inevitable, your asking becomes the fulfillment of an obligatory command (أمرا واجبا). Thus, you are rewarded with the recompense of one who complied with Allah's command, adding good upon good. He only commanded you out of mercy for you and to deliver good to you, and to alert you that your need is for Him, not for anyone else. For He only created you for His worship (عبادته), meaning, so that you may humble yourself to Him.\n\nWhat I enjoin upon you is to stand firm by the commands and prohibitions of The Real (أوامر الحق ونواهيه) and to understand from Him concerning them, so that you may be among those who know what The Real intended from you in His command and prohibition. Beware of the one who does not ask his Lord, for he has deemed Him stingy—this applies to the general sphere. If you fall short in what I have enjoined upon you, then blame no one but yourself. For if you were ignorant, I have taught you; and if you were forgetful or negligent, I have alerted and reminded you. If you are a believer, the reminder (الذكرى) will benefit you. I have complied with Allah's command by reminding you, and your benefit from the reminder is a witness to your faith. Allah Almighty said concerning me and concerning you: <<And remind, for indeed, the reminder benefits the believers (الْمُؤْمِنِينَ)>>. If the reminder does not benefit you, then question your own faith, for Allah is truthful, and He informed us that the reminder benefits the believers.\n\nFurthermore, part of the completion of this Divine report, which we cited after His saying, *I will forgive you*, is that He said: \"O My servants, you will never reach My harm so as to harm Me, nor will you reach My benefit so as to benefit Me.\" It is known that He, Glory be to Him, is neither harmed nor benefited, for He is the One free of need of the worlds. However, when He placed Himself in the station of His servant, as we mentioned concerning asking for food and drink, He alerted us to the inability of the servants to reach the ultimate extent of harming Him or benefiting Him. It is impossible to reach the ultimate extent in that, and because Allah said concerning a people: <<because they followed what angered Allah (بِأَنَّهُمُ اتَّبَعُوا ما أَسْخَطَ الله)>>, which is outwardly harm, He purified Himself from that. Likewise, concerning one who performs an action that pleases Allah and makes Him rejoice, such as the penitent in Allah's rejoicing over the repentance of His servant. Thus, this report serves as a remedy for the sickness that arises from this in some souls weak in the knowledge of Allah, who lack the knowledge conveyed by His saying: <<There is nothing like unto Him (لَيْسَ كَمِثْلِهِ شَيْءٌ)>>.\n\nFurthermore, part of the completion of this report is His saying: \"O My servants, if the first of you and the last of you, mankind and jinn, were upon the heart of the most pious man among you, that would not increase My Dominion (ملكي) by anything. O My servants, if the first of you and the last of you, mankind and jinn, were upon the heart of the most wicked man among you, that would not decrease My Dominion by anything. O My servants, if the first of you and the last of you, mankind and jinn, were to stand on a single plain and ask Me, and I gave every person what he asked, that would not decrease what I have except as much as a needle decreases the sea when it enters it.\" All of this is a remedy for the sicknesses of the weak souls that we mentioned. So, O friend (ولي), use these remedies. Allah says: \"These are only your deeds, which I record for you, and then I will recompense you for them fully. So, whoever finds good, let him praise Allah, and whoever finds otherwise, let him blame no one but himself.\" Whoever asks for a need has humbled himself, and whoever humbles himself to other than Allah has gone astray, wronged his soul, and not taken the path of its guidance. This is my injunction to you, so adhere to it, and my advice, so know it. Allah Almighty has never ceased enjoining His servants in His Book and upon the tongues of His Messengers. Therefore, anyone who enjoins upon you that which contains your happiness in its practice is a messenger from Allah to you, so thank him before your Lord.\n\nIf you see a scholar whose knowledge does not benefit him, then you must employ your knowledge in your proper conduct (adab) toward him, so that you fulfill the scholar's due right insofar as he is a scholar. Do not be veiled from this by his poor state, for he has a degree with Allah corresponding to his knowledge. Indeed, on the Day of Resurrection, a person will be gathered with those he loved. And whoever observes proper conduct (adab) toward a Divine Attribute will be clothed in it on the Day of Resurrection and gathered within it.\n\nIt is incumbent upon you to perform everything you know that Allah loves from you, so hasten to it. For if you adorn yourself with it, seeking thereby to become beloved by Him, the Exalted, He will love you. And if He loves you, He will grant you felicity through the Knowledge (al-ʿIlm) of Him, through His Self-disclosure (tajallī), and through the Abode of His Generosity (Dār Karāma), thus granting you bliss even within your trial (balā’).\n\nThe things that the Exalted loves are many. I shall mention those that are easily accessible, by way of counsel and advice. Among these is beautification (al-tajammul) for the sake of Allah, for it is an independent act of worship, especially in the worship of prayer (al-ṣalāt), for you are commanded to do so. Allah, the Exalted, said: <<يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ>> (O Children of Adam, take your adornment at every place of prostration). And He said, in the context of denunciation: <<قُلْ مَنْ حَرَّمَ زِينَةَ اللهِ الَّتِي أَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِ قُلْ هِيَ لِلَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا خَالِصَةً يَوْمَ الْقِيَامَةِ كَذَلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ>> (Say: Who has forbidden the adornment of Allah which He has produced for His servants and the good things of provision? Say: They are for those who believed during the worldly life, [but] exclusively for them on the Day of Resurrection. Thus do We detail the verses for a people who know).\n\nThere is much more of this clarification regarding such matters in the Quran. There is no difference between the adornment of Allah and the adornment of the worldly life except through the intention (qaṣd) and the purpose (niyya). The essence of the adornment itself is the same; it is not another thing. Intention (al-Niyya) is the spirit of all matters, and indeed, a person receives only what he intended. Thus, the emigration (al-Hijra), insofar as it was a single, identical emigration, [is judged by its intent]. So, whoever emigrated for the sake of Allah and His Messenger, his emigration is to Allah and His Messenger. And whoever emigrated for the sake of worldly gain or a woman he wished to marry, his emigration is to that for which he emigrated.\n\nLikewise, it is mentioned in the *Ṣaḥīḥ* collection concerning the pledge of allegiance (bayʿa) to the Imam, regarding the three whom Allah will not speak to on the Day of Resurrection, nor purify them, and for whom there will be a painful punishment: <<وَلَهُمْ عَذَابٌ أَلِيمٌ>> (and for whom there will be a painful punishment). Among them is a man who gives allegiance to the Imam only for worldly gain: if the Imam gives him something from it, he fulfills his pledge, but if he does not give him anything, he does not fulfill it. Thus, deeds are judged by intentions (al-Aʿmāl bi’l-Niyyāt), and intention is one of the pillars of the House of Islam.\n\nIt is reported in *Ṣaḥīḥ Muslim* that a man said to the Messenger of Allah (may Allah bless him and grant him peace): \"O Messenger of Allah, I love that my sandals be beautiful and my clothes be beautiful.\" The Messenger of Allah (may Allah bless him and grant him peace) said to him: \"Indeed, Allah is Beautiful (Jamīl) and loves beauty (Jamāl).\" And he said: \"Indeed, Allah is the most worthy of those for whom one should beautify oneself.\"\n\n(And from this category) is the fact that Allah, the Exalted, did not send Gabriel (Jibrīl) to him in most of his descents except in the form of Diḥya [al-Kalbī], who was the most handsome man of his time. The effect of his beauty upon creation was such that when he arrived in Medina and people came out to meet him, no pregnant woman saw him but that she miscarried what was in her womb. Thus, The Real (al-Ḥaqq) was saying, announcing the descent of Gabriel upon His Prophet (may Allah bless him and grant him peace) in the form of Diḥya: \"O Muhammad, there is nothing between Me and you except the form of beauty.\" The Exalted thereby informs him of what belongs to Him, Glory be to Him, in His Essence (dhāt) by the state (bi’l-ḥāl).\n\nTherefore, whoever misses beautifying himself for Allah, as we have stated, has missed this specific, designated love from Allah. And if he misses this specific, designated love, he misses what it produces from Allah: Knowledge (ʿilm), Self-disclosure (tajallī), and generosity (karāma) in the Abode of Felicity (Dār al-Saʿāda), a station upon the Dune of Vision (Kathīb al-Ru’ya), and a spiritual, cognitive, and essential Witnessing (shuhūd maʿnawī ʿilmī rūḥī) in this worldly abode during his spiritual journey (sulūk) and his unveilings (mashāhid).\n\nHowever, as we said, he must intend by this beautification (al-tajammul) to be for Allah, not for mere adornment, nor for pride in the fleeting goods of the world, nor for vanity, self-admiration (ʿujb), or arrogance (baṭar) toward others. (And from that is) turning back to Allah (al-Rujūʿ ilā Allāh) during the trial (al-Fitna). For Allah loves every person tried who is repentant (tawwāb), as the Messenger of Allah (may Allah bless him and grant him peace) said.\n\nAllah, the Mighty and Majestic, said: <<خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا>> (He created death and life that He might test you [as to] which of you is best in deed). Trial (al-Balā’) and temptation (al-Fitna) are synonymous; they are nothing but the testing of what a person claims to be. <<إِنْ هِيَ إِلَّا فِتْنَتُكَ>> (It is nothing but Your trial), meaning Your testing. <<تُضِلُّ بِهَا مَنْ تَشَاءُ>> (You lead astray thereby whom You will), meaning You cause him confusion, <<وَتَهْدِي بِهَا مَنْ تَشَاءُ>> (and You guide thereby whom You will), meaning You make clear to him the path of his salvation within it.\n\n(And the greatest trials) are women, wealth, children, and status (al-Jāh).\n\nIf Allah tests a servant with these four, or with one of them, and the servant stands within them in the station of The Real (maqām al-Ḥaqq) in their establishment for him, and turns back to Allah concerning them, not stopping at their essence (ʿayn) itself, but taking them as a Divine favor (niʿma ilāhiyya) with which Allah has blessed him, so that they return him to the Exalted, and establish him in the station of the true right of gratitude (ḥaqq al-shukr)—which Allah commanded His Prophet Moses (peace be upon him) to observe, saying to him: \"O Moses, thank Me with the true right of gratitude.\" Moses said: \"O Lord, what is the true right of gratitude?\" He said to him: \"O Moses, when you see the favor as coming from Me, that is the true right of gratitude.\" Ibn Majah mentioned this in his *Sunan* from the Messenger of Allah (may Allah bless him and grant him peace).\n\nWhen Allah forgave His Prophet Muhammad (may Allah bless him and grant him peace) what had preceded of his sin and what was delayed, and gave him the glad tidings of this with His saying, the Exalted: <<لِيَغْفِرَ لَكَ اللهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ>> (That Allah may forgive you what preceded of your sin and what was delayed), he stood [in prayer] until his feet swelled, thanking Allah, the Exalted, for that. He neither slackened nor inclined toward rest. When he was questioned about this and asked to be gentle with himself, he (may Allah bless him and grant him peace) said: \"Should I not be a grateful servant (ʿabdan shakūran)?\" This was because he heard Allah saying: \"Indeed, Allah loves the grateful (al-shākirīn).\"\n\nIf he does not stand in the station of gratitude (shukr) toward the Benefactor, he misses this specific love from Allah associated with this station, which none attains from Allah except the truly grateful (al-Shakūr). For Allah says: <<وَقَلِيلٌ مِنْ عِبَادِيَ الشَّكُورُ>> (And few of My servants are truly grateful). If he misses it, he misses what is reserved for him of the Knowledge (ʿilm) of Allah, the Self-disclosure (tajallī), and the specific bliss (naʿīm) in the Abode of Generosity (Dār al-Karāma) and the Dune of Vision (Kathīb al-Ru’ya) on the Day of the Greatest Gathering (Yawm al-Zūr al-Aʿẓam). For every Divine love stemming from a specific Attribute, there is necessarily a corresponding Knowledge, Self-disclosure, bliss, and station (manzila) by which the possessor of that Attribute is distinguished from others.\n\n(As for the trial of women), the form of turning back to Allah (al-Rujūʿ ilā Allāh) in loving them is that one sees that the whole loves its part and yearns for it, so he loves nothing but himself. This is because woman was originally created from man, from his shortest rib. Thus, he places her in the position of the Form (ṣūra) upon which Allah created the Perfect Human (al-Insān al-Kāmil), which is the Form of The Real (ṣūrat al-Ḥaqq). The Real (al-Ḥaqq) made her a locus of manifestation (majlā) for Him. When a thing is a locus of manifestation for the observer, the observer sees nothing in that form but himself. When he sees himself in this woman, his love for her and his inclination toward her intensify because she is his form. It has already been made clear to you that his form is the Form of The Real upon which He brought him into existence. Thus, he sees nothing but The Real, but with the desire of love, the pleasure of connection, and a union (waṣla) in which he undergoes true annihilation (fanā’ ḥaqq) through sincere love. He confronts her with his Essence (dhāt) in a confrontation of similitude (mumāthiliyya). For this reason, he is annihilated (fanā) in her, such that there is no part of him that is not in her, and love has permeated all his parts, so his entirety is attached to her. Therefore, he undergoes complete annihilation (al-fanā’ al-kullī) in his like, unlike his love for something other than his like. He becomes united with his beloved until he says:\n\n\"I am the one I love, and the one I love is I.\"\n\nAnd another said in this station: \"I am Allah.\" If you love a person who is your like with this love, your witnessing (shuhūd) of this return in him brings you back to Allah. Thus, you are among those whom Allah loves, and this trial (fitna) was a trial that granted you guidance (al-mahdāh). As for the other way of loving women, it is that they are the loci of receptivity (maḥāll al-infiʿāl) and formation (al-takwīn) for the manifestation of the essences of similitudes (aʿyān al-amthāl) in every species. There is no doubt that Allah only loved the Fixed Entities (al-Aʿyān al-Thābita) of the world in the state of the world’s non-existence because those Entities were loci of receptivity. When He turned toward them, by virtue of His being the Willer (Murīd), He said to them, \"Be,\" and they were. His Dominion (mulk) appeared through them in Existence (al-Wujūd). Those Entities gave Allah His due right in His Divinity (Ulūhiyya), so He was a God (Ilāh), and they worshipped Him, the Exalted, through all the Names (al-Asmā’) by their state (bi’l-ḥāl), whether they knew those Names or not. There remains no Name of Allah but that the servant has stood within it by his form and his state, even if he does not know the result of that Name—which is what the Messenger of Allah (may Allah bless him and grant him peace) referred to in his supplication concerning the Names of Allah: \"or that You have kept hidden in Your knowledge of the Unseen, or that You have taught to any of Your creation.\" He means that one of His Names is known by its essence (ʿayn) so that it is distinguished from others by knowledge. For many matters exist in a person by form and state, yet he does not know them, but Allah knows that they are in him. Therefore, if he loves a woman for what we have mentioned, his love for her has returned him to Allah, the Exalted. Thus, the trial was a blessing (niʿma) in his regard, and Allah loved him because of his return to the Exalted in his love for her.\n\nAs for his attachment to a specific woman rather than others, even though these Realities (Ḥaqā’iq) we mentioned are inherent in every woman, this is due to a spiritual affinity (munāsaba rūḥāniyya) between these two individuals in the origin of their creation (nash’a), their natural temperament, and their spiritual vision. Some of this affinity lasts for a specified term, and some lasts indefinitely, its term being death, and the attachment does not cease—like the Prophet’s (may Allah bless him and grant him peace) love for ʿĀ’isha, for he loved her more than all his other wives, and he also loved Abū Bakr, who was her father. These secondary affinities are what specify individuals, while the primary cause is what we mentioned. Therefore, the absolute love, absolute hearing, and absolute vision that some of Allah’s servants possess are not restricted to one person in the world over another. Every present being is beloved to him and occupies him. Nevertheless, there must be a specific inclination toward certain individuals due to a special affinity, even with this absolute state; this is necessary. For the creation (nash’a) of the world necessitates this restriction in its particulars. The Perfect One (al-Kāmil) is he who combines restriction (taqyīd) and absolute freedom (iṭlāq). The absolute state is like the saying of the Prophet (may Allah bless him and grant him peace): \"Three things from your world have been made beloved to me: women,\" without specifying one woman over another. And the restriction is like what is narrated of his greater love for ʿĀ’isha than for the rest of his wives, due to a Divine, spiritual relationship that restricted him to her rather than others, despite his general love for women. We have thus mentioned enough concerning this one pillar [of trial] for whoever understands.\n\n(As for the second pillar of the house of trials, which is status (al-Jāh), expressed as authority/leadership (al-Riyāsa)), the group among them who lack Knowledge (ʿilm) say concerning it: \"The last thing to leave the hearts of the truthful (al-Ṣiddīqīn) is the love of authority.\" However, the Gnostics (al-ʿĀrifūn) who hold this saying do not mean by it what the common people among the spiritual travelers (ahl al-ṭarīq) understand. Rather, it is understood according to the intention of the Perfect Ones (al-Kummal) among the people of Allah, which we shall clarify. This is because there are many matters that Allah has hidden within the human soul (nafs), and He is the One <<يُخْرِجُ الْخَبْءَ فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ>> (Who brings forth the hidden [things] in the heavens and the earth and knows what you conceal and what you declare)—meaning what has appeared from you and what is hidden within you that you do not know about yourselves. The Real (al-Ḥaqq) continuously brings forth for His servant from his own soul what He has hidden within it, things the servant did not know were in his soul—just as a physician sees a disease in a person that the patient himself does not know he has. Likewise is what Allah has hidden in the souls of creation. Do you not see that he (may Allah bless him and grant him peace) says: \"Whoever knows his soul (nafs) knows his Lord\"? Not everyone knows his soul, even though his soul is his very essence (ʿayn) and nothing else. The Real (al-Ḥaqq) continuously brings forth for the person from his soul what He has hidden in it, so the person witnesses it and thereby knows things about himself that he did not know before. Thus, the large group said: \"The last thing to leave the hearts of the truthful is the love of authority.\" It appears to them when it emerges, and they love authority with a love different from the common people's love for it. They love it because they are in the state about which Allah said that He is their hearing and their sight, mentioning all their faculties and limbs. If they are in this rank, they only love authority through Allah, since precedence belongs to Allah over the world, for they are His servants. The leader (al-Ra’īs) only exists through the led (al-Mar’ūs), both in existence (wujūd) and in estimation (taqdīr). His love for the led is the most intense love, because they are what establish his authority. Thus, nothing is more beloved to the King than his kingdom, because his kingdom establishes his being a King. This is the meaning of \"The last thing to leave the hearts of the truthful is the love of authority\" for them: they see it and witness it by direct experience (dhawq), not that it leaves their hearts so that they do not love authority. For if they did not love it, they would not attain the Knowledge (ʿilm) of it by direct experience, and it is the Form upon which Allah created them, according to his saying (may Allah bless him and grant him peace): \"Indeed, Allah created Adam upon His Form,\" in some interpretations and possibilities of this report. Know this. Status (al-Jāh) is the execution of the Word (al-Kalima), and there is no Word more executed than His saying: <<إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ>> (When He intends a thing, His command is only that He says to it, \"Be,\" and it is). The greatest status belongs to him whose status is through Allah. This servant sees [the execution of the Word] while his essence (ʿayn) remains, and he knows then that he is the similitude (al-Mathal) that is not likened, for he is a servant of a Lord, and Allah, the Mighty and Majestic, is a Lord, not a servant. Thus, the servant possesses comprehensiveness (al-Jamʿiyya), while The Real (al-Ḥaqq) possesses singularity (al-Infirād).\n\n(As for the third pillar), which is wealth (al-Māl). Wealth was only named by this name because people naturally incline (yumāl) toward it. Allah tested His servants with it by making the facilitation of certain matters dependent on its existence, and by attaching hearts to the love and veneration of the wealthy person, even if he is stingy. Eyes look upon him with veneration because souls imagine that he is independent of them due to the wealth he possesses. Yet, the wealthy person may be the poorest of people toward them in his own soul, finding neither sufficiency nor contentment with what he has, and thus seeking increase in what is in his hand. When the Gnostic (al-ʿālim) saw the inclination of hearts toward the possessor of wealth because of the wealth, they loved wealth. The Gnostics (al-ʿĀrifūn) sought a Divine aspect (wajh ilāhī) by which they could love wealth, since its love is inevitable. Here is the place of trial (fitna) and testing (ibtilā’) which leads to misguidance or guidance (al-mahdāh). As for the Gnostics, they looked at Divine matters, among them His saying, the Exalted: <<وَأَقْرِضُوا اللهَ قَرْضًا حَسَنًا>> (And lend to Allah a goodly loan). He addressed none but those who possess means (aṣḥāb al-jidda). So, they loved wealth in order to be among the people of this address, thereby taking pleasure in hearing it wherever they were. When they lend it, they see that charity falls into the Hand of the All-Merciful (al-Raḥmān). Thus, through wealth and its giving, they attained the direct handing over (munāwala) of that [charity] from The Real (al-Ḥaqq). This became for them a connection (waṣla) of direct handing over. Allah honored Adam by His saying: <<لِمَا خَلَقْتُ بِيَدَيَّ>> (for what I created with My two Hands). So, the one who gives to Him when He asks for a loan is more complete in the pleasure of honor than the one He created with His Hand. Were it not for wealth, they would not have heard this Divine address, nor would they have been worthy of it, nor would they have attained this Lordly reception (tanāwul rabbānī) through the loan, for that encompasses connection (al-waṣla) with Allah. Allah tested them with wealth, then tested them by asking from them, and The Real (al-Ḥaqq) lowered Himself to the station of the needy beggars among His servants—the people of need—from the wealthy among them and the possessors of wealth, by His saying in the previously mentioned Hadith in this chapter: \"O My servant, I asked you for food, but you did not feed Me, and I asked you for drink, but you did not give Me to drink.\" Thus, through this perspective, their love for wealth was a trial that guided them (fitna mahdāh) to such a state.\n\nAs for the trial of children (al-Walad), it is because the child is the secret (sirr) of his father, a piece of his liver, and the closest of things to him. Loving him is loving oneself, and nothing is more beloved to a thing than itself. So, Allah tested him with himself in a form external to him, which He named a child, to see whether looking at the child would veil him from what The Real (al-Ḥaqq) has obligated upon him concerning the establishment of rights (iqāmat al-ḥuqūq) upon him. The Messenger of Allah (may Allah bless him and grant him peace) said concerning his daughter Fāṭima and her station in his heart—a station that is not unknown: \"If Fāṭima, daughter of Muhammad, were to steal, I would cut off her hand.\" And ʿUmar ibn al-Khaṭṭāb flogged his son for fornication until he died, yet his soul was content with that. Māʿiz sacrificed his soul, and the woman [who confessed adultery] sacrificed hers, in the establishment of the prescribed punishment (al-ḥadd) upon them, which involved the destruction of their souls. The Messenger of Allah (may Allah bless him and grant him peace) said concerning their repentance: \"And what repentance is greater than that they sacrificed their souls?\" And sacrifice (al-Jūd) is in the establishment of the disliked right.",
    "ur": "(پانچ سو ساٹھواں باب: ایک حکمی وصیت کے بیان میں جس سے مرید سالک (المريد السالك) اور واصل (الواصل) اور ہر وہ شخص جو اس پر مطلع ہو، ان شاء اللہ فائدہ اٹھائے گا)\n\nاللہ نے وصیت کی اور اس کے رسولوں نے وصیت کی، اسی لیے\nان کی پیروی بہترین عمل ہے۔\n\nاگر وصیت نہ ہوتی تو مخلوق گمراہی میں رہتی،\nاور وصیت ہی سے بادشاہت ریاستوں میں گردش کرتی ہے۔\n\nپس اس پر عمل کرو اور اس کے طریقے کو نظر انداز نہ کرو،\nبے شک وصیت ازل (الأزل) میں اللہ کا حکم ہے۔\n\nمیں نے ان لوگوں کو یاد کیا جنہیں اللہ نے وصیت کی،\nاور وصیت میں کوئی نئی بات لانا میرا کام نہیں۔\n\nپس وہ وہی تھا جو انہوں نے کہا یا شریعت بنائی،\nان کے ذریعے سیدھے راستوں میں سلوک (السلوك) کرنا۔\nاحمد (ﷺ) نے پورے دین کی اصل (عين الدين) کی رہنمائی کی،\nاور ملت مصطفیٰ (ﷺ) تمام ملتوں میں سب سے زیادہ روشن ہے۔\n\nاصل (العين) مٹائی نہیں گئی بلکہ اسے اپنی قوت دی گئی،\nتاکہ وہ اس جھکاؤ کو درست کر سکے جو اس میں ہے۔\n\nاور اپنے باطن (سر) کے ذریعے اس سے اس کے مراکز سے\nبلندی کی طرف لے جاؤ، بلند قمر سے زحل تک۔\n\nستاروں کے ثابت مداروں (الثوابت) تک، ان کے میدان میں نہ اترو،\nاور حمل کے بلند درجے کی طرف اٹھو۔\n\nاور وہاں سے کرسی (الكرسي) کے قدم تک، پھر\nعرش محیط (العرش المحيط) تک، اشکال اور مثالوں تک۔\n\nطبیعت (الطبيعة) تک، نفس نزہیہ (النفس النزيهة) تک، اس عقل (العقل) تک\nجو عوارض اور علتوں سے مقید ہے۔\n\nعماء (العماء) تک، جس کے اوپر کوئی نفس نہیں،\nوہاں سے اس منزل تک جسے ازل (الأزل) سے موسوم کیا گیا ہے۔\n\nاور اس پہاڑ کو دیکھو جو پہاڑ پر مضبوطی سے جما ہوا ہے،\nاور اس نے اسے دیکھا تو وہ نہ ہٹا اور نہ زائل ہوا۔\n\nاگر پستی (السفل) میں بلندی (العلو) نہ ہوتی تو ہمارے چہرے\nآنکھوں سے دیدار (المري) طلب کرتے ہوئے پست نہ ہوتے۔\n\nاسی لیے اللہ نے ہمارے لیے سجدہ مشروع کیا،\nتاکہ ہم ذات حق (الحق) کا شہود (الشهود) بلندی اور پستی دونوں میں کریں۔\n\nیہ ہماری وصیت ہے اگر تم صاحب نظر ہو،\nکیونکہ یہ بہترین تدبیروں میں سے ایک تدبیر ہے۔\n\nتم اس کے ذریعے ہر معلوم چیز کو اس کی صورت میں دیکھو گے،\nاس کی حقیقی ماہیت پر، نہ کہ بدل پر۔\n\nیہاں تک کہ تم اعلیٰ منظر کو دیکھو، اور تمہارے سوا اس کے لیے\nکوئی جلوہ گاہ نہیں، پس نہ ہٹو اور نہ زائل ہو۔\n\nپس اگر وہ تمہیں اس چشمے کی طرف بلائے جس کا پانی پیا جاتا ہے،\nتو اس کی بات نہ مانو اور اس سے خوفزدہ رہو۔\n\nہم مونث ہیں کیونکہ جو کچھ ہم میں ہے وہ اسے جنم دیتا ہے،\nپس ہم اللہ کی حمد کرتے ہیں کہ کائنات میں کوئی مرد نہیں۔\n\nبے شک وہ مرد جن کی اصل معرفت (المعرفۃ) ہے،\nوہی مونث ہیں، اور وہی میرا نفس اور میری امید ہیں۔\n\n**وصیت: اللہ تعالیٰ نے عام وصیت کے بارے میں فرمایا**\n\n**شَرَعَ لَكُمْ من الدِّينِ ما وَصَّى به نُوحاً والَّذِي أَوْحَيْنا إِلَيْكَ وما وَصَّيْنا به إِبْراهِيمَ ومُوسى‏ وعِيسى‏ أَنْ أَقِيمُوا الدِّينَ ولا تَتَفَرَّقُوا فِيهِ** (اللہ نے تمہارے لیے دین کا وہی راستہ مقرر کیا جس کی وصیت اس نے نوح کو کی تھی، اور جو ہم نے تمہاری طرف وحی کی، اور جس کی وصیت ہم نے ابراہیم، موسیٰ اور عیسیٰ کو کی تھی، کہ دین کو قائم کرو اور اس میں تفرقہ نہ ڈالو)۔\n\nپس ذات حق (الحق) نے دین کو قائم کرنے کا حکم دیا، اور وہ ہر زمانے اور ملت میں وقت کی شریعت ہے، اور یہ کہ اس پر جمع ہو جاؤ اور اس میں تفرقہ نہ ڈالو۔ کیونکہ اللہ کا ہاتھ جماعت کے ساتھ ہے، اور بھیڑیا صرف دور بھٹکی ہوئی کو کھاتا ہے۔ اور وہ دور بھٹکی ہوئی وہ ہے جو جماعت سے بھاگ گئی اور الگ ہو گئی جس پر جماعت قائم ہے۔ اور اس کی حکمت یہ ہے کہ اللہ کو معبود (إلها) صرف اس کی اسماء حسنیٰ (أسماؤه الحسنى) کے لحاظ سے ہی سمجھا جا سکتا ہے، نہ کہ اس لحاظ سے کہ وہ ان اسماء حسنیٰ سے معریٰ ہو۔ لہٰذا اس کی ذات (عينه) کی توحید اور اس کے اسماء کی کثرت دونوں ضروری ہیں، اور مجموعی طور پر وہی معبود (الإله) ہے۔ پس اللہ کا ہاتھ، یعنی قوت، جماعت کے ساتھ ہے۔ ایک حکیم نے مرتے وقت اپنے بیٹوں کو وصیت کی، اور وہ ایک جماعت تھے۔ اس نے ان سے کہا کہ میرے پاس لاٹھیاں لاؤ۔ جب وہ جمع ہو گئیں تو اس نے ان سے کہا کہ انہیں اکٹھا توڑو، تو وہ ایسا نہ کر سکے۔ پھر اس نے انہیں الگ الگ کر دیا اور کہا کہ ایک ایک کر کے توڑو، تو انہوں نے توڑ دیا۔ اس نے ان سے کہا: میرے بعد تمہاری یہی حالت ہے، جب تک تم متحد رہو گے تم پر کوئی غالب نہیں آ سکے گا، لیکن جب تم منتشر ہو جاؤ گے تو تمہارا دشمن تم پر قابو پا لے گا اور تمہیں تباہ کر دے گا۔ اسی طرح دین پر قائم رہنے والے جب دین کو قائم کرنے پر متفق ہو جائیں اور اس میں تفرقہ نہ ڈالیں تو ان پر کوئی دشمن غالب نہیں آ سکتا۔ اور اسی طرح انسان اپنے نفس میں جب اللہ کے دین کو قائم کرنے پر متفق ہو جائے تو کوئی شیطان، خواہ وہ جنوں میں سے ہو یا انسانوں میں سے، اپنے وسوسوں کے ذریعے اس پر غالب نہیں آ سکتا، بشرطیکہ ایمان (الايمان) اور فرشتہ اس کی مدد کرے۔\n\n**وصیت:** جب تم کسی جگہ اللہ کی نافرمانی کرو تو اس جگہ سے اس وقت تک نہ ہٹو جب تک کہ تم وہاں کوئی اطاعت کا کام نہ کر لو اور کوئی عبادت قائم نہ کر لو۔ تاکہ جس طرح وہ جگہ تمہارے خلاف گواہی دے گی اگر گواہی طلب کی گئی، اسی طرح وہ تمہارے حق میں بھی گواہی دے۔ تب تم وہاں سے ہٹ سکتے ہو۔ اسی طرح تمہارا لباس، اگر تم نے اس میں اللہ کی نافرمانی کی ہے، تو وہی کرو جو میں نے تمہیں بتایا ہے۔ اس میں اللہ کی عبادت کرو۔ اور اسی طرح جو کچھ تم سے جدا ہوتا ہے، جیسے مونچھیں کاٹنا، زیر ناف بال صاف کرنا، ناخن کاٹنا، بال سنوارنا، اور میل کچیل صاف کرنا، ان میں سے کوئی بھی چیز تمہارے بدن سے جدا نہ ہو مگر اس حال میں کہ تم طہارت اور اللہ عزوجل کے ذکر (الذكر) پر ہو۔ کیونکہ وہ تم سے پوچھے گا کہ تم نے اسے کس حال میں چھوڑا۔ اور اس سب کے باوجود کم از کم عبادت جو تم کر سکتے ہو وہ یہ ہے کہ تم اللہ سے دعا کرو کہ وہ تمہیں اپنے حکم کی تعمیل میں توبہ کی توفیق دے، تاکہ تم اللہ کے حکم کی تعمیل میں ایک واجب ادا کرنے والے بن جاؤ، اور وہ اس کا یہ فرمان ہے: **وقالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ** (اور تمہارے رب نے فرمایا: مجھے پکارو، میں تمہاری دعا قبول کروں گا)۔ پس اس نے تمہیں دعا کرنے کا حکم دیا، پھر اسی آیت میں فرمایا: **إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبادَتِي** (بے شک جو لوگ میری عبادت سے تکبر کرتے ہیں)۔ یہاں عبادت سے مراد دعا ہے، یعنی جو میری طرف ذلت اور مسکنت اختیار کرنے سے تکبر کرتا ہے، کیونکہ اس نے دعا کو عبادت کہا ہے، اور عبادت ذلت، عضوع اور مسکنت ہے۔ **سَيَدْخُلُونَ جَهَنَّمَ داخِرِينَ** (وہ عنقریب ذلیل ہو کر جہنم میں داخل ہوں گے)۔ یعنی ذلیل ہو کر۔ پس جب وہ وہ کام کریں گے جس کا انہیں حکم دیا گیا ہے، تو اللہ انہیں عزت کے ساتھ جنت میں داخل کر کے جزا دے گا۔ میں ایک دن سحری کے وقت غسل کے لیے حمام میں داخل ہوا، تو وہاں نجم الدین ابو المعالی ابن اللھیب سے ملاقات ہوئی، جو میرے دوست تھے۔ انہوں نے حجام کو سر مونڈنے کے لیے بلایا۔ میں نے انہیں آواز دی: یا ابا المعالی! انہوں نے میرے بولنے سے پہلے ہی فوراً کہا: میں طہارت پر ہوں۔ میں تمہاری بات سمجھ گیا ہوں۔ مجھے ان کی حاضری، ان کی تیز فہمی، موقع کی نزاکت، حالات کے قرائن، اور جو کچھ وہ مجھ سے اس بارے میں جانتے تھے، اس پر تعجب ہوا۔ میں نے کہا: اللہ تمہیں برکت دے! اللہ کی قسم، میں نے تمہیں صرف اس لیے آواز دی تھی کہ تم اپنے بال جدا کرتے وقت طہارت اور ذکر (الذكر) پر رہو۔ انہوں نے میرے لیے دعا کی، پھر اپنا سر منڈوایا۔ لوگ اس طرح کی چیزوں سے غافل رہتے ہیں، بلکہ وہ کہتے ہیں کہ جب تم کسی جگہ اللہ کی نافرمانی کرو تو وہاں سے ہٹ جاؤ، کیونکہ وہ ڈرتے ہیں کہ کہیں وہ جگہ تمہیں اس گناہ کی یاد نہ دلائے اور تم اسے لذیذ سمجھ کر گناہ پر گناہ نہ کر بیٹھو۔ انہوں نے یہ بات صرف شفقت کی وجہ سے کہی، لیکن وہ ایک بڑے علم سے محروم رہ گئے۔ پس تم اس جگہ اللہ کی اطاعت کرو، اور تب وہاں سے ہٹ جاؤ۔ اس طرح تم ان کی بات اور میری وصیت دونوں کو جمع کر لو گے۔ اور جب بھی تمہیں کوئی خطا یاد آئے جو تم نے کی تھی، تو اسے یاد کرنے کے فوراً بعد اس سے توبہ کرو، اور اللہ سے اس کی مغفرت طلب کرو، اور اس معصیت کی نوعیت کے مطابق اللہ کا ذکر کرو۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: **اتبع السيئة الحسنة تمحها** (برائی کے بعد نیکی کرو، وہ اسے مٹا دے گی)۔ اور اللہ تعالیٰ فرماتا ہے: **إِنَّ الْحَسَناتِ يُذْهِبْنَ السَّيِّئاتِ** (بے شک نیکیاں برائیوں کو دور کر دیتی ہیں)۔ لیکن تمہارے پاس اس کے لیے ایک میزان ہونا چاہیے جس سے تم ان برائیوں اور نیکیوں کی مناسبت کو جان سکو جن کا تم وزن کر رہے ہو۔\n\n**وصیت: ہر حال میں اپنے رب کے ساتھ حسن ظن رکھو**\n\nاور اس کے ساتھ بدگمانی نہ کرو، کیونکہ تم نہیں جانتے کہ تمہاری ہر نکلنے والی سانس تمہاری آخری سانس ہے یا نہیں، اور تم مر جاؤ اور اللہ سے حسن ظن کے ساتھ ملو، نہ کہ بدگمانی کے ساتھ۔ کیونکہ تم نہیں جانتے، ہو سکتا ہے اللہ تمہیں اسی سانس میں قبض کر لے جو اس کی طرف نکل رہی ہے۔ اور اس شخص کی بات چھوڑ دو جس نے کہا کہ زندگی میں بدگمانی رکھو اور موت کے وقت اللہ سے حسن ظن رکھو۔ یہ بات اللہ والوں کے نزدیک نامعلوم ہے۔ کیونکہ وہ اپنی سانسوں کے ساتھ اللہ کے ساتھ ہوتے ہیں۔ اور اس میں اللہ کے بارے میں یہ فائدہ اور علم ہے کہ تم نے اس میں ذات حق (الحق) کا حق ادا کیا۔ کیونکہ تم پر اللہ کا حق یہ ہے کہ تم اس کے اس قول پر ایمان لاؤ: **وَنُنْشِئَكُمْ في ما لا تَعْلَمُونَ** (اور ہم تمہیں اس صورت میں پیدا کریں گے جسے تم نہیں جانتے)۔ پس ہو سکتا ہے اللہ تمہیں اسی سانس میں موت اور اس کی طرف پلٹنے کی نشأة (پیدائش) دے دے جسے تم آنے والا سمجھتے ہو، اور تم اپنے رب کے ساتھ بدگمانی کی حالت میں اس سے ملو۔ اور رسول اللہ صلی اللہ علیہ وسلم سے اپنے رب عزوجل سے روایت کردہ حدیث میں ثابت ہے کہ وہ فرماتا ہے: **أنا عند ظن عبدي بي فليظن بي خيرا** (میں اپنے بندے کے گمان کے مطابق ہوتا ہوں، پس وہ مجھ سے اچھا گمان رکھے)۔ اور اس نے کسی وقت کو دوسرے وقت سے خاص نہیں کیا۔ اور اللہ کے بارے میں اپنے گمان کو اس علم پر مبنی رکھو کہ وہ معاف کرنے والا، بخشنے والا اور درگزر کرنے والا ہے۔ اور اس گمان کی طرف تمہارا الٰہی داعی اس کا یہ فرمان ہونا چاہیے: **يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله** (اے میرے وہ بندو جنہوں نے اپنی جانوں پر زیادتی کی، اللہ کی رحمت سے مایوس نہ ہو)۔ پس اس نے تمہیں منع کیا، اور جس چیز سے اس نے تمہیں منع کیا ہے، اس سے باز رہنا تم پر واجب ہے۔ پھر اس نے خبر دی، اور اس کی خبر سچی ہے جس میں نسخ داخل نہیں ہو سکتا، کیونکہ اگر اس میں نسخ داخل ہوتا تو وہ جھوٹ ہوتا، اور اللہ پر جھوٹ محال ہے۔ پس اس نے فرمایا: **إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً** (بے شک اللہ تمام گناہوں کو بخش دیتا ہے)۔ اور اس نے کسی گناہ کو خاص نہیں کیا، اور اپنے قول **جَمِيعاً** (تمام) سے اس کی تاکید کی۔ پھر اسے مکمل کرتے ہوئے فرمایا: **إِنَّهُ هُوَ** (بے شک وہی ہے)۔ پس اس نے ضمیر لایا جو اس کی طرف لوٹتی ہے: **الْغَفُورُ الرَّحِيمُ** (بخشنے والا، نہایت رحم کرنے والا)۔ اس لیے کہ اس کی رحمت اس کے غضب پر سبقت لے گئی ہے۔ اور اسی طرح اس نے فرمایا: **الَّذِينَ أَسْرَفُوا** (جنہوں نے زیادتی کی) اور کسی خاص زیادتی کو متعین نہیں کیا، اور ایسا اسم ناقص لایا جو ہر زیادتی کرنے والے کو شامل ہے۔ پھر اس نے بندوں کو اپنی طرف منسوب کیا کیونکہ وہ اس کے بندے ہیں، جیسا کہ ذات حق (الحق) نے صالح بندے عیسیٰ علیہ السلام کے بارے میں فرمایا کہ انہوں نے کہا: **إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ** (اگر تو انہیں عذاب دے تو وہ تیرے بندے ہیں)۔ پس اس نے انہیں اپنی طرف منسوب کیا، اور اللہ تعالیٰ کی طرف نسبت کا شرف ہی کافی ہے۔\n\n**وصیت:** تم پر لازم ہے کہ تم پوشیدہ اور کھلے عام اللہ کا ذکر (الذكر) کرو، اور اپنے نفوس میں اور مجمع میں بھی، کیونکہ اللہ فرماتا ہے: **فَاذْكُرُونِي أَذْكُرْكُمْ** (پس تم مجھے یاد کرو، میں تمہیں یاد کروں گا)۔ پس اس نے بندے کے ذکر کا جواب اللہ کی طرف سے ذکر کو قرار دیا۔ اور بندے پر گناہ سے زیادہ نقصان دہ کون سی مصیبت ہو سکتی ہے؟ رسول اللہ صلی اللہ علیہ وسلم مصیبت کی حالت میں فرمایا کرتے تھے: **الحمد لله على كل حال** (ہر حال میں اللہ کے لیے حمد ہے)۔ اور خوشحالی کی حالت میں: **الحمد لله المنعم المفضل** (اللہ کے لیے حمد ہے جو نعمت دینے والا اور فضل کرنے والا ہے)۔ اگر تم اپنے دل کو ہر حال میں ہمیشہ اللہ کے ذکر (الذكر) سے معمور رکھو گے تو تمہارا دل ذکر کے نور سے ضرور منور ہو جائے گا، اور وہ نور تمہیں کشف (الکشف) عطا کرے گا، کیونکہ چیزوں کا کشف (الکشف) نور کے ذریعے ہی ہوتا ہے۔ اور جب کشف (الکشف) آ جاتا ہے تو اس کے ساتھ حیا بھی آ جاتی ہے۔ اس کی دلیل تمہارا اپنے پڑوسی سے اور اس شخص سے حیا کرنا ہے جس کا تم حق اور قدر و منزلت سمجھتے ہو۔ اور اس میں کوئی شک نہیں کہ ایمان تمہیں ذات حق (الحق) کی تعظیم عطا کرتا ہے۔ اور ہماری گفتگو صرف مومنوں کے ساتھ ہے، اور ہماری وصیت ہر اس مسلمان مومن کے لیے ہے جو اللہ پر اور اس کی طرف سے آئی ہوئی چیزوں پر ایمان رکھتا ہے۔ اور اللہ صحیح ماثور خبر میں فرماتا ہے، اور اس میں ہے: **وأنا معه** (اور میں اس کے ساتھ ہوتا ہوں) یعنی بندے کے ساتھ جب وہ مجھے یاد کرتا ہے۔ **إن ذكرني في نفسه ذكرته في نفسي وإن ذكرني في ملأ ذكرته في ملأ خير منهم** (اگر وہ مجھے اپنے نفس میں یاد کرتا ہے تو میں اسے اپنے نفس میں یاد کرتا ہوں، اور اگر وہ مجھے کسی مجمع میں یاد کرتا ہے تو میں اسے ان سے بہتر مجمع میں یاد کرتا ہوں)۔ اور اللہ تعالیٰ فرماتا ہے: **والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ** (اور کثرت سے اللہ کا ذکر کرنے والے مرد اور ذکر کرنے والی عورتیں)۔ اور سب سے بڑا ذکر ہر حال میں اللہ کا ذکر ہے۔\n\n**وصیت:** ہر زمانے اور ہر حال میں، جس زبان سے اور جس حال سے ذات حق (الحق) تمہیں مخاطب کرے، اپنی استطاعت کے مطابق تمام قربتوں کو حاصل کرنے میں ثابت قدم رہو۔ کیونکہ اگر تم مومن ہو تو کوئی بھی معصیت تمہیں کبھی بھی خالص نہیں ملے گی، بلکہ اس میں ضرور کوئی اطاعت شامل ہو گی، کیونکہ تم اس پر ایمان رکھتے ہو کہ وہ معصیت ہے۔ اگر تم اس ملاوٹ کے ساتھ استغفار یا توبہ بھی شامل کر لو، تو یہ اطاعت پر اطاعت اور قربت پر قربت ہو گی۔ پس وہ اطاعت کا جزو جو برے عمل کے ساتھ ملا ہوا ہے، مضبوط ہو جائے گا۔ اور ایمان (الايمان) اللہ کے نزدیک سب سے قوی اور عظیم قربتوں میں سے ہے، کیونکہ یہ وہ بنیاد ہے جس پر تمام قربتیں قائم ہیں۔ اور ایمان میں سے یہ بھی ہے کہ تم اللہ پر وہی حکم لگاؤ جو اس نے خود پر لگایا ہے۔ اس صحیح خبر میں جو اس سے ثابت ہے، جس میں اس نے ذکر کیا: **وإن تقرب مني شبرا تقربت منه ذراعا وإن تقرب إلي ذراعا تقربت منه باعا وإن أتاني يمشي أتيته هرولة** (اگر وہ ایک بالشت میرے قریب آتا ہے تو میں ایک ہاتھ اس کے قریب آتا ہوں، اور اگر وہ ایک ہاتھ میرے قریب آتا ہے تو میں ایک باں (دونوں بازو پھیلا کر) اس کے قریب آتا ہوں، اور اگر وہ چل کر میرے پاس آتا ہے تو میں دوڑ کر اس کے پاس آتا ہوں)۔ اور اللہ کی طرف سے اس تضعیف (بڑھانے) اور بندے کی طرف سے کمی اور ضعف کی وجہ یہ ہے کہ بندے کے لیے ضروری ہے کہ وہ فعل میں اللہ کی قربت کی نیت کے ساتھ ثابت قدم رہے، اور اسے حکم دیا گیا ہے کہ وہ اپنے افعال کو شریعت کے میزان سے تولے، لہٰذا اس میں تثبت (ثابت قدمی) ضروری ہے، اگرچہ وہ جلدی کرے اور اسے جلدی سے موسوم کیا جائے، تو اس کی جلدی اس فعل میں میزان قائم کرنے میں ہوتی ہے، نہ کہ خود فعل میں۔ کیونکہ میزان قائم کرنے سے ہی معاملہ درست ہوتا ہے۔ اور اللہ کی قربت کو میزان کی ضرورت نہیں، کیونکہ ذات حق (الحق) کا رکھا ہوا میزان جو اس کے ہاتھ میں ہے، وہی میزان ہے جس سے تم نے اس فعل کو تولا جس سے تم اللہ کی قربت چاہتے ہو۔ لہٰذا اس کی صفت یہ ہونی چاہیے کہ وہ تمہارے قریب آنے میں تمہارے قریب آنے سے زیادہ قوی اور زیادہ ہو۔ پس اس نے خود کو اس طرح بیان کیا کہ وہ تمہارے قریب آنے میں تمہارے قریب آنے سے دوگنا قریب آتا ہے، مثال کے طور پر، کیونکہ تم اس کی صورت پر پیدا کیے گئے ہو، اور تمہاری کم از کم خلافت تمہاری اپنی ذات پر تمہاری خلافت ہے۔ پس تم اپنے بدن کی زمین میں اس کے خلیفہ ہو، اور تمہاری رعایا تمہارے ظاہری اور باطنی اعضاء اور قوتیں ہیں۔ پس اس کا تمہارے قریب آنا تمہارے اس کے قریب آنے کے عین مطابق ہے، اور اس میں اضافہ بھی ہے، جو اس نے ذراع، باع اور ہرولہ (دوڑنے) سے بیان کیا۔ بالشت کے مقابلے میں ہاتھ، اور ہاتھ کے مقابلے میں باں، اور چلنے کو دوگنا کر دیا جائے تو وہ دوڑنا ہے۔ پس وہ پہلے میں ہے جو تمہارا اس کے قریب آنا ہے، اور وہ آخر میں ہے جو اس کا تمہارے قریب آنا ہے۔ پس **هُوَ الْأَوَّلُ والْآخِرُ** (وہی اول ہے اور وہی آخر ہے)۔ اور یہ مناسب قربت ہے۔ کیونکہ تمام مخلوق سے الٰہی قربت اس سے مختلف ہے، اور وہ اس کا یہ قول ہے: **ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ** (اور ہم اس کی شہ رگ سے بھی زیادہ قریب ہیں)۔ پس یہاں اس قربت کا ارادہ نہیں ہے، بلکہ اس قربت کا ارادہ ہے جو بندے کی اللہ سے قربت کا بدلہ ہے۔ اور بندے کے لیے اللہ سے کوئی قربت نہیں مگر اللہ پر ایمان لانے کے بعد، اور اس چیز پر ایمان لانے کے بعد جو اللہ کی طرف سے آئی، اور اللہ کی طرف سے پہنچانے والے پر ایمان لانے کے بعد۔\n\nاپنے نفس کو نیکی کے کام کرنے کی بات کرنے پر مجبور کرو، اگرچہ تم وہ کام نہ کرو۔ اور جب بھی تمہارا نفس کسی برائی کی بات کرے تو اسے اللہ کے لیے چھوڑنے کا پختہ ارادہ کر لو، مگر یہ کہ سابقہ تقدیر اور لاحق قضا تم پر غالب آ جائے۔ کیونکہ جب اللہ تم پر اس چیز کے کرنے کی قضا نہیں کرتا جس کی تمہارے نفس نے بات کی تھی، تو وہ اسے تمہارے لیے نیکی لکھ دیتا ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم سے اپنے رب عزوجل سے ثابت ہے کہ وہ فرماتا ہے: **إذا تحدث عبدي بأن يعمل حسنة فأنا أكتبها له حسنة ما لم يعملها** (جب میرا بندہ نیکی کرنے کی بات کرتا ہے، تو میں اسے ایک نیکی لکھ دیتا ہوں جب تک کہ وہ اسے نہ کرے)۔ اور یہاں **ما** (جب تک) ظرفیہ ہے، پس ہر وہ وقت جو اس نیکی کے کرنے کی بات کرتے ہوئے گزرتا ہے، اگرچہ وہ اسے نہ کرے، تو اللہ اسے ہر اس وقت میں ایک نیکی لکھ دیتا ہے جس میں وہ اس کی بات کرتا ہے، خواہ وہ اوقات کتنے ہی کیوں نہ ہوں۔ پس اسے ہر وقت کی بات پر ایک نیکی ملتی ہے۔ اسی لیے اس نے فرمایا: **ما لم يعملها** (جب تک کہ وہ اسے نہ کرے)۔ پھر اللہ تعالیٰ نے فرمایا: **فإذا عملها فأنا أكتبها له بعشر أمثالها** (پس جب وہ اسے کر لیتا ہے تو میں اسے دس گنا لکھتا ہوں)۔ اور اسی سے دس گنا کا فرض ہونا ہے اس چیز میں جو آسمان سے سیراب ہو، اگر تم جانتے ہو۔ اور اگر وہ متعدی نیکیاں ہوں جو باقی رہنے والی ہیں، تو ان کا اجر قیامت تک جاری رہتا ہے، جیسے صدقہ جاریہ، اوقاف، اور وہ علم جو لوگوں میں پھیلایا جاتا ہے، اور اچھی سنت، اور اس طرح کی مثالیں۔ پھر اس نے اپنے بندوں پر اپنی نعمتیں مکمل کیں۔ پس اللہ تعالیٰ نے فرمایا: **وإذا تحدث بأن يعمل سيئة فأنا أغفرها له ما لم يعملها** (اور جب وہ برائی کرنے کی بات کرتا ہے، تو میں اسے بخش دیتا ہوں جب تک کہ وہ اسے نہ کرے)۔ اور یہاں **ما** (جب تک) ظرفیہ ہے، جیسا کہ نیکی میں تھا، اور حکم بھی بات کرنے اور جزا میں وہی ہے، خواہ وہ کتنا ہی ہو۔ پھر فرمایا: **فإذا عملها فأنا أكتبها له بمثلها** (پس جب وہ اسے کر لیتا ہے تو میں اسے اس کے برابر لکھتا ہوں)۔ پس اس نے برائی میں عدل اور نیکی میں فضل رکھا، اور یہی اس کا قول ہے: **لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ** (جنہوں نے نیکی کی ان کے لیے بھلائی ہے اور اضافہ بھی)۔ اور اضافہ وہی فضل ہے جو مثل سے زیادہ ہے۔ پھر اللہ تعالیٰ نے خبر دی کہ فرشتے اپنے اس اصل حکم کے مطابق کہتے ہیں جو انہیں ہمارے باپ آدم کے حق میں بولنے پر مجبور کرتا ہے، ان کے اس قول سے: **أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ** (کیا تو اس میں ایسے لوگوں کو پیدا کرے گا جو اس میں فساد پھیلائیں گے اور خون بہائیں گے؟)۔ پس انہوں نے صرف ہماری برائیوں کا ذکر کیا، اور نوبیوں کا ذکر نہیں کیا۔ کیونکہ ملأ اعلیٰ (فرشتوں) پر اللہ کی جناب پر غیرت غالب رہتی ہے کہ اس کی حق تلفی ہو۔ اور انہوں نے اس عنصری نشأة (پیدائش) سے جان لیا کہ وہ اپنے رب کی مخالفت ضرور کرے گی، کیونکہ وہ اپنی حقیقت پر قائم ہے۔ اور یہ ان کے نزدیک اپنے ذوق سے ہے۔ اور یہ ہماری نشأة میں زیادہ ظاہر ہے۔ اور اگر فرشتے اپنی نشأة میں ہماری نشأة کی صورت پر نہ ہوتے تو اللہ ان کے بارے میں یہ ذکر نہ کرتا کہ وہ **يَخْتَصِمُونَ** (جھگڑتے ہیں)، اور جھگڑا صرف ضدوں کے ساتھ ہوتا ہے۔ اور اللہ نے فرشتوں کے بارے میں ہمارے حق میں یہ ذکر نہیں کیا کہ وہ کہتے ہیں: یہ تیرا بندہ نیکی کرنا چاہتا ہے۔ پس دیکھو اس اصل کی قوت کتنی محکم ہے اس شخص کے لیے جو غور کرے۔ اور اسی سے تم انسان کی فضیلت کو جان سکتے ہو جب وہ کسی کے بارے میں خیر کا ذکر کرے اور اس کی برائی سے خاموش رہے، تو اس کا درجہ فرشتوں کے اس خوبصورت ارادے کے ساتھ کہاں ہو گا جو انہوں نے ذکر کیا۔ لیکن میں نے تمہیں اس چیز پر متنبہ کیا جس پر میں نے تمہیں متنبہ کیا، تاکہ تم ان کی نشأة اور جس پر وہ جبلت کیے گئے ہیں اسے جان سکو۔ پس **كُلٌّ يَعْمَلُ عَلى‏ شاكِلَتِهِ** (ہر کوئی اپنی ساخت کے مطابق عمل کرتا ہے) جیسا کہ اللہ تعالیٰ نے فرمایا۔ اور اس نے خبر دی کہ فرشتے کہتے ہیں: یہ تیرا فلاں بندہ برائی کرنا چاہتا ہے، اور وہ اسے زیادہ دیکھتا ہے۔ پس اس نے فرمایا: **ارقبوه فإن عملها فاكتبوها له بمثلها وإن تركها فاكتبوها له حسنة إنه إنما تركها من جرائي** (اس کی نگرانی کرو، اگر وہ اسے کر لے تو اس کے لیے اس کے برابر لکھو، اور اگر وہ اسے چھوڑ دے تو اس کے لیے ایک نیکی لکھو، کیونکہ اس نے اسے میری وجہ سے چھوڑا ہے)۔ یعنی میری خاطر۔ پس یہاں جن فرشتوں کا ذکر کیا گیا ہے، وہ وہی ہیں جن کے بارے میں اللہ نے ہمیں فرمایا: **إِنَّ عَلَيْكُمْ لَحافِظِينَ كِراماً كاتِبِينَ** (بے شک تم پر نگہبان ہیں، معزز لکھنے والے)۔ پس ان کے مرتبے اور ذمہ داری نے انہیں یہ حق دیا کہ وہ وہ بات کریں جو انہوں نے کی۔ پس انہیں نیکی لکھنے کا حق ہے، بغیر اس کے کہ وہ اس چیز کی تعریف کریں جو اللہ نے انہیں اس بارے میں پہلے سے بتا دی تھی۔ اور وہ برائی کے بارے میں اس لیے بات کرتے ہیں کہ وہ اللہ کے فضل اور درگزر کو جانتے ہیں۔ اور اگر وہ اس بارے میں بات نہ کرتے تو ہم نہ جان پاتے کہ اللہ کے نزدیک اس کا کیا حکم ہے۔ جیسا کہ وہ ذکر کی مجالس میں اس شخص کے بارے میں کہتے ہیں جو اپنی ضرورت کے لیے آتا ہے، نہ کہ ذکر کی خاطر۔ پس اللہ نے سب کے لیے مغفرت عام کر دی اور فرمایا: **هم القوم لا يشقى جليسهم** (وہ ایسی قوم ہیں جن کا ہم نشین محروم نہیں رہتا)۔ پس اگر ان کے سوال اور ان کے تعارف کے ذریعے ہمیں ان کے بارے میں اللہ کا حکم معلوم نہ ہوتا۔ پس ان کا کلام (علیہم السلام) تعلیم اور رحمت ہے، اگرچہ اس کا ظاہر ایسا ہو جیسا کہ قاصر فہموں کو اس اصل کے ساتھ جو ہم نے تمہیں بتایا ہے، پہلے سے معلوم ہوتا ہے۔ اور اللہ نے نیکی اور برائی کے بارے میں فرمایا: **من جاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثالِها** (جو شخص نیکی لے کر آئے گا تو اس کے لیے اس کے دس گنا ہے) اور میں اس سے زیادہ بھی دوں گا۔ **ومَن جاءَ بِالسَّيِّئَةِ فَلا يُجْزى‏ إِلَّا مِثْلَها** (اور جو شخص برائی لے کر آئے گا تو اسے صرف اس کے برابر ہی بدلہ دیا جائے گا)۔ اور میں ایک قوم کو جزا کے بعد اور دوسری قوم کو جزا سے پہلے بخش دوں گا۔ پس ہر اس شخص کے لیے مغفرت ضروری ہے جس نے اپنی جان پر زیادتی کی، اگرچہ وہ توبہ نہ کرے۔ پس جو شخص اس وصیت کو حاصل کر لے گا، وہ انسانی اور ملکی نشأة (پیدائش) کے درمیان نسبت کو جان لے گا، اور یہ کہ اصل ایک ہے، جیسا کہ ہمارا رب ایک ہے، اور اس کے لیے متقابل اسماء ہیں۔ پس ہستی (الوجود) اسماء کی صورت پر ہے۔\n\n**(وصیت): کلمہ اسلام پر ثابت قدم رہو**\n\nاور وہ تمہارا قول **لا إله إلا الله** (اللہ کے سوا کوئی معبود نہیں) ہے۔ کیونکہ یہ سب سے افضل ذکر ہے، اس علم کی زیادتی کی وجہ سے جو یہ اپنے اندر رکھتا ہے۔ اور صلی اللہ علیہ وسلم نے فرمایا: **أفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله** (سب سے افضل بات جو میں نے اور مجھ سے پہلے نبیوں نے کہی، وہ لا إله إلا الله ہے)۔ پس یہ وہ کلمہ ہے جس نے نفی اور اثبات کو جمع کیا، اور تقسیم محدود ہے۔ پس اس کلمے میں جو کچھ ہے اسے وہی جانتا ہے جو اس کا وزن اور اس کی قدر جانتا ہے، جیسا کہ اس خبر میں آیا ہے جسے ہم اس کی دلالت میں ذکر کریں گے۔ پس جان لو کہ یہ کلمہ توحید (التوحيد) ہے، اور توحید کی کوئی چیز مماثل نہیں، کیونکہ اگر کوئی چیز اس کی مماثل ہوتی تو وہ ایک نہ ہوتا، یا دو یا اس سے زیادہ ہوتا۔ پس کوئی چیز نہیں جو اس کا وزن کر سکے، کیونکہ اس کا وزن صرف وہی کر سکتا ہے جو اس کے برابر اور مماثل ہو، اور کوئی مماثل اور برابر نہیں ہے۔ پس یہی وہ رکاوٹ ہے جس نے **لا إله إلا الله** کو میزان میں داخل ہونے سے روکا۔ کیونکہ عام علماء کا خیال ہے کہ شرک (الشرك) جو توحید (التوحيد) کے مقابل ہے، بندے کی طرف سے توحید کے وجود کے ساتھ اس کے قول کا وجود درست نہیں ہے۔ پس انسان یا تو مشرک ہے یا موحد۔ پس توحید کا وزن صرف شرک ہی کر سکتا ہے، اور وہ دونوں ایک میزان میں جمع نہیں ہو سکتے۔ اور ہمارے نزدیک، یہ میزان میں اس لیے داخل نہیں ہوا جیسا کہ اس خبر میں آیا ہے جو اسے سمجھنے والے اور غور کرنے والے کے لیے ہے۔ اور یہ اللہ کی طرف سے ایک صحیح خبر ہے، اللہ فرماتا ہے: **لو أن السموات السبع وعامرهن غيري والأرضين السبع وعامرهن غيري في كفة ولا إله إلا الله في كفة مالت بهن لا إله إلا الله** (اگر ساتوں آسمان اور ان کے آباد کرنے والے میرے سوا، اور ساتوں زمینیں اور ان کے آباد کرنے والے میرے سوا، ایک پلڑے میں ہوں، اور لا إله إلا الله دوسرے پلڑے میں ہو، تو لا إله إلا الله ان سب پر بھاری ہو جائے گا)۔ پس اس نے صرف آسمانوں اور زمین کا ذکر کیا، کیونکہ میزان کی جگہ صرف مقعر فلک کواکب ثابتہ کے نیچے سدرۃ المنتہیٰ تک ہے، جہاں بندوں کے اعمال ختم ہوتے ہیں۔ اور ان اعمال کے لیے میزان رکھا گیا ہے۔ پس میزان اس جگہ سے تجاوز نہیں کرتا جہاں سے اعمال تجاوز نہیں کرتے۔ پھر فرمایا: **وعامرهن غيري** (اور ان کے آباد کرنے والے میرے سوا)۔ حالانکہ ان کا آباد کرنے والا اللہ کے سوا کوئی نہیں ہے۔ پس باخبر کے لیے اشارہ کافی ہے۔ اور عام علماء رسوم کی زبان میں، غیر سے مراد وہ شریک ہے جسے مشرک نے ثابت کیا، اگر اس کی تخلیق میں کوئی شراکت ہوتی، تو **لا إله إلا الله** اس پر میزان میں بھاری ہو جاتا، کیونکہ **لا إله إلا الله** ہر حال میں زیادہ قوی ہے، اس لیے کہ مشرک اللہ تعالیٰ کے پہلو کو اس پہلو پر ترجیح دیتا ہے جس کے ساتھ اس نے شرک کیا۔ پس اس نے ان کے بارے میں فرمایا کہ وہ کہتے ہیں: **ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏** (ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں)۔ پس جب ہستی (الوجود) کا میزان اٹھا لیا جائے گا، نہ کہ توحید کا میزان، تو **لا إله إلا الله** اس میں داخل ہو جائے گا۔ اور یہ عظمت کی توحید کے میزان میں بھی داخل ہو سکتا ہے، جو مشرکین کی توحید ہے، تو **لا إله إلا الله** اس کا وزن کرے گا اور اس پر بھاری ہو جائے گا۔ کیونکہ جب آباد کرنے والا اللہ کے سوا کوئی نہیں ہے، تو وہ بھاری نہیں ہو گا، اور اس کی ذات وہی ہے جس کا اس نے ذکر کیا، وہ صرف اللہ ہے۔ اس نے کہا: کہاں بھاری ہو گا، حالانکہ دونوں پلڑوں میں صرف ایک ہی ہے۔ اور جہاں تک صحیفوں والے شخص کا تعلق ہے، تو پلڑا صرف بطاقہ (کاغذ کے ٹکڑے) سے بھاری ہوا، کیونکہ وہی میزان میں سما سکتا تھا، اس لحاظ سے کہ **لا إله إلا الله** کہنے والے کی زبان سے ادا ہوتا ہے، تو فرشتے نے اسے لکھ لیا۔ پس وہ لکھی ہوئی **لا إله إلا الله** ہے جو نطق میں مخلوق ہے۔ اور اگر یہ ہر ایک کے لیے رکھ دی جاتی تو توحید کا تلفظ کرنے والا کوئی بھی جہنم میں داخل نہ ہوتا۔ اور اللہ نے صرف یہ چاہا کہ اہل موقف (میدان حشر میں موجود لوگ) صحیفوں والے شخص میں اس کی فضیلت دیکھیں، اور وہ اسے نہیں دیکھیں گے اور نہ ہی یہ رکھی جائے گی مگر اس کے بعد جب اللہ چاہے گا کہ موحدین میں سے جو جہنم میں داخل ہوں گے، وہ داخل ہو جائیں۔ پس جب میدان حشر میں کوئی موحد باقی نہیں رہے گا جس کے بارے میں اللہ نے فیصلہ کیا ہو کہ وہ جہنم میں داخل ہو گا، پھر اس کے بعد شفاعت یا الٰہی عنایت سے نکلے گا، تب صحیفوں والے شخص کو لایا جائے گا، اور میدان حشر میں صرف وہی باقی ہوں گے جو جنت میں داخل ہوں گے اور جن کا جہنم میں کوئی حصہ نہیں ہو گا، اور وہ مخلوق میں سے آخری شخص ہو گا جس کے لیے وزن کیا جائے گا۔ کیونکہ **لا إله إلا الله** کے لیے ابتدا اور انتہا ہے، اور ہو سکتا ہے کہ اس کی ابتدا ہی اس کی انتہا ہو، جیسے صحیفوں والے شخص کا معاملہ ہے۔\n\n### [بے شک اللہ نے عام لوگوں کے لیے بہترین چیزیں اور سب سے زیادہ نفع بخش رکھی ہیں]\n\nپھر جان لو کہ اللہ نے عام لوگوں کے لیے صرف بہترین چیزیں، سب سے زیادہ نفع بخش اور وزن میں سب سے زیادہ بھاری چیزیں رکھی ہیں، کیونکہ وہ ان کے ذریعے بہت سی ضدوں کا مقابلہ کرتا ہے۔ لہٰذا ضروری ہے کہ جو چیز عام لوگوں کے لیے رکھی گئی ہے، اس میں اتنی قوت ہو کہ وہ ہر ضد کا مقابلہ کر سکے۔ اور اس بات کو اللہ کے اہل میں سے ہر عارف نہیں سمجھتا، سوائے ان انبیاء کے جنہوں نے لوگوں کے لیے شریعت بنائی۔ اور اس میں کوئی شک نہیں کہ صلی اللہ علیہ وسلم نے فرمایا: **أفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله** (سب سے افضل بات جو میں نے اور مجھ سے پہلے نبیوں نے کہی، وہ لا إله إلا الله ہے)۔ اور اس نے اس فضیلت کی طرف اشارہ کیا جس کا دعویٰ بعض لوگ ذکر کے لیے **الله الله** اور **هو هو** جیسے کلمات کے ساتھ کرتے ہیں۔ اور اس میں کوئی شک نہیں کہ یہ ان اقوال میں سے ہیں جن سے **لا إله إلا الله** اللہ والوں کے نزدیک افضل ہے۔ پس اے ولی! تم پر لازم ہے کہ عام لوگوں میں ثابت شدہ ذکر کو لازم پکڑو، کیونکہ وہ سب سے قوی ذکر ہے، اس کا نور سب سے زیادہ روشن ہے، اور اس کا مقام سب سے بلند ہے۔ اور اس بات کو وہی محسوس کرتا ہے جو اسے لازم پکڑتا ہے اور اس پر عمل کرتا ہے یہاں تک کہ اسے محکم کر لیتا ہے۔ کیونکہ اللہ نے اپنی رحمت کو صرف شمولیت اور مطلوب کے حصول کے لیے وسیع کیا ہے۔ اور کوئی بھی ایسا نہیں جو نجات نہ چاہتا ہو، اگرچہ وہ اس کا راستہ نہ جانتا ہو۔ پس جس نے **لا إله** سے اپنی ذات (عينه) کی نفی کی، اس نے **إلا الله** سے اس کے وجود (كونه) کو ثابت کیا۔ پس تم اپنی ذات کی نفی حکماً کرو گے نہ کہ علماً، اور ذات حق (الحق) کے وجود کو حکماً اور علماً واجب کرو گے۔ اور معبود (الإله) وہ ہے جس کے لیے تمام اسماء ہیں، اور وہ صرف ایک ہی ذات کے لیے ہیں، اور وہ اللہ کا مسمیٰ ہے، جو آسمانوں اور زمین کا آباد کرنے والا ہے، جس کے ہاتھ میں رفع اور خفض کا میزان ہے۔ پس تم پر لازم ہے کہ اس ذکر کو لازم پکڑو جس کے ساتھ اللہ نے اور اس کے علم کے ساتھ سعادت کو جوڑ دیا ہے، پس یہ عام ہے۔ اور **لا إله إلا الله** کہنے والوں سے دشمنی کرنے سے بچو، کیونکہ ان کے لیے اللہ کی طرف سے عام ولایت (الولاية العامة) ہے۔ پس وہ اللہ کے ولی ہیں، اگرچہ وہ غلطی کریں اور زمین بھر گناہ لے کر آئیں، بشرطیکہ وہ اللہ کے ساتھ شرک نہ کریں، تو اللہ ان سے اتنی ہی مغفرت کے ساتھ ملے گا۔ اور جس کی ولایت (ولايته) ثابت ہو گئی، اس سے لڑنا حرام ہو گیا۔ اور جس نے اللہ سے لڑائی کی، تو اللہ نے دنیا اور آخرت میں اس کی جزا کا ذکر کیا ہے۔ اور جس شخص کی اللہ نے تمہیں اللہ سے دشمنی پر مطلع نہیں کیا، اسے اپنا دشمن نہ بناؤ۔ اور تمہاری کم از کم حالت یہ ہے کہ جب تم اسے نہ جانو تو اس کے معاملے کو نظر انداز کر دو۔ اور جب تمہیں یقین ہو جائے کہ وہ اللہ کا دشمن ہے، اور وہ صرف مشرک ہی ہو سکتا ہے، تو اس سے بیزاری اختیار کرو، جیسا کہ ابراہیم خلیل علیہ السلام نے اپنے والد آزر کے حق میں کیا۔ اللہ عزوجل نے فرمایا: **فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ** (پس جب ان پر واضح ہو گیا کہ وہ اللہ کا دشمن ہے تو انہوں نے اس سے بیزاری اختیار کر لی)۔ یہ تمہارا میزان ہے۔ اللہ تعالیٰ فرماتا ہے: **لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ** (تم ایسی قوم نہیں پاؤ گے جو اللہ اور یوم آخرت پر ایمان رکھتی ہو، کہ وہ ان لوگوں سے دوستی رکھیں جو اللہ اور اس کے رسول کی مخالفت کرتے ہیں، اگرچہ وہ ان کے باپ ہوں) جیسا کہ ابراہیم خلیل نے کیا، **أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ** (یا ان کے بیٹے ہوں یا ان کے بھائی ہوں یا ان کا قبیلہ ہو)۔ اور جب تک تم یہ نہ جانو، تو اللہ کے بندوں سے ممکنہ طور پر یا زبان سے دشمنی نہ کرو۔ اور جو چیز تمہیں ناپسند ہونی چاہیے وہ ان کا فعل ہے نہ کہ ان کی ذات (عينه)۔ اور اللہ کے دشمن کی ذات سے تمہیں نفرت ہونی چاہیے۔ پس فرق کرو اس شخص میں جس کی ذات سے تمہیں نفرت ہے، اور وہ اللہ کا دشمن ہے، اور اس شخص میں جس کے فعل سے تمہیں نفرت ہے، اور وہ مومن ہے یا وہ شخص جس کا انجام تم نہیں جانتے اور وہ اس وقت مسلمان نہیں ہے۔ اور اس کے اس قول سے بچو جو صحیح حدیث میں ہے: **من عادى لي وليا فقد آذنته بالحرب** (جس نے میرے کسی ولی سے دشمنی کی، تو میں نے اسے جنگ کا اعلان کر دیا)۔ کیونکہ اگر وہ اس کے معاملے سے ناواقف ہو کر اس سے دشمنی کرتا ہے، تو اس نے اپنی مخلوق میں ذات حق (الحق) کا حق ادا نہیں کیا۔ کیونکہ وہ نہیں جانتا کہ اللہ کا علم اس کے بارے میں کیا ہے، اور اللہ نے اسے اس پر مطلع نہیں کیا کہ وہ اس سے بیزاری اختیار کرے اور اسے دشمن سمجھے۔ اور اگر وہ اس کے ظاہری حال کو جانتا ہے، اگرچہ وہ حقیقت میں اللہ کا دشمن ہو اور تم نہ جانتے ہو، تو اللہ کے حق کو قائم رکھنے کے لیے اس سے دوستی رکھو اور اس سے دشمنی نہ کرو۔ کیونکہ ظاہر الٰہی اسم (الاسم الإلهي الظاهر) قیامت کے دن تم سے جھگڑا کرے گا۔ پس اللہ کے لیے اپنے خلاف کوئی حجت نہ بناؤ، ورنہ تم ہلاک ہو جاؤ گے۔ کیونکہ **فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ** (پس اللہ ہی کے لیے کامل حجت ہے)۔ پس اللہ کے بندوں کے ساتھ شفقت اور رحمت کا معاملہ کرو، جیسا کہ اللہ انہیں ان کے کفر اور شرک کے باوجود رزق دیتا ہے، حالانکہ وہ انہیں جانتا ہے۔ اور اس نے انہیں رزق صرف اس لیے دیا کہ وہ جانتا ہے کہ جس حالت میں وہ ہیں، وہ ان کی وجہ سے نہیں ہے، بلکہ وہ اس میں ان کی وجہ سے ہیں، جیسا کہ ہم نے عام زبان میں ذکر کیا ہے، کیونکہ اللہ **خالِقُ كُلِّ شَيْ‏ءٍ** (ہر چیز کا خالق ہے)۔ اور ان کا کفر اور شرک ان میں مخلوق ہے۔ اور خاص زبان میں، کسی موجود میں کوئی حکم ظاہر نہیں ہوا مگر اس کے مطابق جو وہ عدم کی حالت میں اپنے ثبوت میں تھا، جسے اللہ نے اس سے جانا۔ پس **فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ** (پس اللہ ہی کے لیے کامل حجت ہے) ہر ایک پر، جب بھی کوئی تنازع اور حجت واقع ہو۔ پس معاملہ اسی کے سپرد کر دو۔ اور جان لو کہ تم اسی پر ہو جس پر تم تھے، اور اپنی رحمت اور شفقت کو تمام حیوانات اور مخلوقات پر عام کرو۔ اور یہ نہ کہو کہ یہ نباتات اور جمادات ہیں، انہیں کوئی خبر نہیں۔ ہاں، انہیں خبریں ہیں، تمہیں خبر نہیں۔ پس ہستی (الوجود) کو اسی حال پر چھوڑ دو جس پر وہ ہے، اور اس پر اس رحمت کے ساتھ رحم کرو جو اس کی ہستی میں موجود ہے۔ اور اس میں اس لحاظ سے نہ دیکھو کہ اس وقت اس میں کیا قائم ہے، **حَتَّى يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُوا وتَعْلَمَ الْكاذِبِينَ** (یہاں تک کہ تمہارے لیے وہ لوگ واضح ہو جائیں جنہوں نے سچ کہا اور تم جھوٹوں کو جان لو)۔ پس اس وقت تم پر لازم ہو جائے گا کہ تم انہیں اللہ کے حکم سے دشمن بناؤ، کیونکہ اس نے تمہیں منع کیا ہے کہ تم اس کے دشمن کو دوست بناؤ اور ان کی طرف محبت کا اظہار کرو۔ پس اگر تمہارے یقین کی کمزوری تمہیں ان سے مدارات کرنے پر مجبور کرے، تو ان سے مدارات کرو، لیکن ان کی طرف محبت کا اظہار کیے بغیر، بلکہ صرف اپنے سے شر کو دور کرنے کے لیے صلح رکھو۔ پس معاملہ اسی کے سپرد کر دو اور ہر حال میں اسی پر بھروسہ رکھو یہاں تک کہ تم اس سے ملو۔\n\nاور تم پر لازم ہے کہ تم ان فرائض (الفرائض) کو لازم پکڑو جو اللہ نے تم پر اس طریقے پر فرض کیے ہیں جس پر اس نے تمہیں قائم رہنے کا حکم دیا ہے۔ پس جب تم اپنے فرائض کی نشأة (پیدائش) کو مکمل کر لو، اور ان کا مکمل کرنا تم پر فرض ہے، تب تم دو فرائض کے درمیان کے وقت کو نفلی نیکیوں کے لیے فارغ کرو، خواہ وہ کچھ بھی ہوں۔ اور اپنے کسی بھی عمل کو حقیر نہ سمجھو، کیونکہ اللہ نے اسے حقیر نہیں سمجھا جب اس نے اسے پیدا کیا اور وجود بخشا۔ کیونکہ اللہ نے تمہیں کسی کام کا مکلف نہیں کیا مگر اس کام کے ساتھ اس کی توجہ اور عنایت ہے، یہاں تک کہ اس نے تمہیں اس کا مکلف کیا حالانکہ تم اس کے نزدیک مرتبے میں زیادہ عظیم ہو۔ کیونکہ تم اس چیز کے وجود کی جگہ ہو جس کا اس نے تمہیں مکلف کیا، کیونکہ تکلیف صرف مکلفین کے افعال سے متعلق ہوتی ہے۔ پس یہ مکلف سے اس کے فعل کے لحاظ سے متعلق ہوتی ہے، نہ کہ اس کی ذات (عينه) کے لحاظ سے۔\n\n### [بے شک بندہ جب فرائض کی ادائیگی پر ثابت قدم رہتا ہے تو وہ اللہ کے قریب ترین امور کے ذریعے اس کے قریب ہوتا ہے]\n\nاور جان لو کہ جب تم فرائض (الفرائض) کی ادائیگی پر ثابت قدم رہتے ہو، تو تم اللہ کے قریب ترین امور کے ذریعے اس کے قریب ہوتے ہو۔ اور جب تم اس صفت کے حامل ہو جاتے ہو، تو تم ذات حق (الحق) کی سماعت اور اس کی بصارت بن جاتے ہو، پس وہ تمہارے بغیر نہیں سنتا اور تمہارے بغیر نہیں دیکھتا۔ پس ذات حق (الحق) کا ہاتھ تمہارا ہاتھ ہے۔ **إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله يَدُ الله فَوْقَ أَيْدِيهِمْ** (بے شک جو لوگ آپ سے بیعت کرتے ہیں، وہ درحقیقت اللہ سے بیعت کرتے ہیں، اللہ کا ہاتھ ان کے ہاتھوں کے اوپر ہے)۔ اور ان کے ہاتھ، اس لحاظ سے کہ وہ اللہ کا ہاتھ ہیں، ان کے ہاتھوں کے اوپر ہیں، اس لحاظ سے کہ وہ ان کے اپنے ہاتھ ہیں۔ کیونکہ بیعت اسم فاعل ہے، اور فاعل اللہ ہے۔ پس ان کے ہاتھ اللہ کا ہاتھ ہیں، پس اس نے ان کے ہاتھوں سے بیعت کی، اور وہ بیعت کرنے والے ہیں۔ اور تمام اسباب ذات حق (الحق) کا ہاتھ ہیں جنہیں مسببات کو وجود بخشنے پر قدرت حاصل ہے۔ اور یہ وہ محبت عظمیٰ ہے جس کے بارے میں کوئی واضح نص نہیں آئی جیسا کہ نوافل (النوافل) کے بارے میں آئی ہے۔ کیونکہ نوافل پر ثابت قدمی کے لیے ایک الٰہی محبت منصوص ہے، جس میں ذات حق (الحق) بندے کی سماعت اور بصارت بن جاتا ہے، جیسا کہ فرائض کی ادائیگی کی محبت میں معاملہ اس کے برعکس تھا۔ پس فرض میں اضطراری بندگی (عبودية الاضطرار) ہے، اور وہ اصلی ہے۔ اور فرع، یعنی نفل (النفل) میں اختیاری بندگی (عبودية الاختيار) ہے۔ پس اس میں ذات حق (الحق) تمہاری سماعت اور بصارت ہے۔ اور اسے نفل (النفل) کہا جاتا ہے کیونکہ یہ زائد ہے، جیسا کہ تم اصالتاً ہستی (الوجود) میں زائد ہو، کیونکہ اللہ تھا اور تم نہیں تھے، پھر تم ہوئے، تو حادث ہستی میں اضافہ ہوا۔ پس تم ذات حق (الحق) کی ہستی میں نفل ہو۔ لہٰذا تمہارے لیے ضروری ہے کہ ایک ایسا عمل ہو جسے نفل کہا جائے، اور وہ تمہاری اصل ہے۔ اور ایک ایسا عمل ہو جسے فرض کہا جائے، اور وہ ہستی (الوجود) کی اصل ہے، اور وہ ذات حق (الحق) کی ہستی ہے۔ پس فرض کی ادائیگی میں تم اس کے لیے ہو، اور نفل میں تم اپنے لیے ہو۔ اور اس کی تم سے محبت اس لحاظ سے کہ تم اس کے لیے ہو، اس کی تم سے محبت سے زیادہ عظیم اور شدید ہے اس لحاظ سے کہ تم اپنے لیے ہو۔ اور اللہ تعالیٰ سے صحیح خبر میں آیا ہے: **ما تقرب إلى عبد بشي‏ء أحب إلي مما افترضته عليه وما يزال العبد يتقرب إلي بالنوافل حتى أحببته فكنت سمعه الذي به يسمع وبصره الذي به يبصر ويده التي يبطش ورجله التي بها يمشي ولئن سألني لأعطينه ولئن استعاذ بي لأعيذنه وما ترددت عن شي‏ء أنا فاعله ترددي عن نفس عبدي المؤمن يكره الموت وأنا أكره مساءته** (میرا بندہ کسی چیز کے ذریعے میرا قرب حاصل نہیں کرتا جو مجھے اس سے زیادہ محبوب ہو جو میں نے اس پر فرض کیا ہے۔ اور میرا بندہ نوافل (النوافل) کے ذریعے میرا قرب حاصل کرتا رہتا ہے یہاں تک کہ میں اس سے محبت کرنے لگتا ہوں، پس میں اس کی سماعت بن جاتا ہوں جس سے وہ سنتا ہے، اور اس کی بصارت جس سے وہ دیکھتا ہے، اور اس کا ہاتھ جس سے وہ پکڑتا ہے، اور اس کا پاؤں جس سے وہ چلتا ہے۔ اور اگر وہ مجھ سے سوال کرے گا تو میں اسے ضرور دوں گا، اور اگر وہ مجھ سے پناہ مانگے گا تو میں اسے ضرور پناہ دوں گا۔ اور میں نے کسی کام کے کرنے میں اتنا تردد نہیں کیا جتنا اپنے مومن بندے کی جان کے بارے میں کرتا ہوں، وہ موت کو ناپسند کرتا ہے اور میں اسے تکلیف دینا ناپسند کرتا ہوں)۔ پس دیکھو کہ اللہ کی محبت کیا نتیجہ دیتی ہے۔ پس تم ان امور کی ادائیگی پر ثابت قدم رہو جن سے اس الٰہی محبت کا وجود درست ہوتا ہے۔ اور فرض کی تکمیل کے بغیر کوئی نفل درست نہیں ہوتا۔ اور نفل میں بھی فرائض اور نوافل ہوتے ہیں۔ پس اس میں جو فرائض ہیں، ان سے فرائض مکمل ہوتے ہیں۔ صحیح حدیث میں آیا ہے کہ وہ (اللہ تعالیٰ) فرماتا ہے: **انظروا في صلاة عبدي أتمها أم نقصها فإن كانت تامة كتبت له تامة وإن كان انتقص منها شيئا قال انظروا هل لعبدي من تطوع فإن كان له تطوع قال الله أكملوا لعبدي فريضته من تطوعه** (میرے بندے کی نماز کو دیکھو، کیا اس نے اسے مکمل کیا یا اس میں کمی کی؟ اگر وہ مکمل ہو تو اس کے لیے مکمل لکھی جاتی ہے۔ اور اگر اس میں کچھ کمی ہو تو وہ فرماتا ہے: دیکھو کیا میرے بندے کے لیے کوئی نفل ہے؟ اگر اس کے لیے نفل ہو تو اللہ فرماتا ہے: میرے بندے کے فرض کو اس کے نفل سے مکمل کر دو)۔ پھر اعمال کو اسی طرح لیا جاتا ہے۔ اور نوافل (النوافل) صرف وہی ہیں جن کی فرائض (الفرائض) میں کوئی اصل ہو۔ اور جس کی فرض میں کوئی اصل نہ ہو، تو وہ ایک مستقل عبادت کی ایجاد ہے جسے علماء رسوم بدعت کہتے ہیں۔ اللہ تعالیٰ نے فرمایا: **ورَهْبانِيَّةً ابْتَدَعُوها** (اور رہبانیت جو انہوں نے خود ایجاد کر لی)۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اسے سنت حسنہ (اچھی سنت) کہا۔ اور جس نے اسے جاری کیا، اسے اس کا اور قیامت تک اس پر عمل کرنے والوں کا اجر ملے گا، بغیر اس کے کہ ان کے اجر میں کوئی کمی ہو۔ اور چونکہ نفل میں فرض کی جگہ لینے کی قوت نہیں تھی، اس لیے نفل میں ہی فرائض رکھے گئے تاکہ فرائض کو فرائض سے پورا کیا جا سکے، جیسے نفلی نماز اصل حکم کے مطابق، پھر وہ ذکر، رکوع اور سجدہ جیسے فرائض پر مشتمل ہوتی ہے، حالانکہ وہ اصل میں نفل ہے۔ اور یہ اقوال اور افعال اس میں فرائض ہیں۔ اور تم پر لازم ہے کہ تم اپنے اقوال کا خیال رکھو جیسا کہ تم اپنے اعمال کا خیال رکھتے ہو، کیونکہ تمہارے اقوال تمہارے اعمال میں شامل ہیں۔ اسی لیے بعض علماء نے کہا: جس نے اپنی بات کو اپنے عمل میں شمار کیا، اس کی بات کم ہو گئی۔\n\n### [بے شک اللہ ہر بات کرنے والے کی زبان کے پاس ہے]\n\nاور جان لو کہ اللہ اپنے بندوں کے اقوال کا خیال رکھتا ہے، اور اللہ ہر بات کرنے والے کی زبان کے پاس ہے۔ پس جس چیز کے تلفظ سے اللہ نے تمہیں منع کیا ہے، اس کا تلفظ نہ کرو، اگرچہ تم اس کا اعتقاد نہ رکھتے ہو۔ کیونکہ اللہ تم سے اس کے بارے میں سوال کرے گا۔ ہم سے روایت کیا گیا ہے کہ فرشتہ بندے پر وہ نہیں لکھتا جو وہ کرتا ہے جب تک کہ وہ اسے بول نہ دے۔ اللہ تعالیٰ فرماتا ہے: **ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ** (وہ کوئی بات نہیں کہتا مگر اس کے پاس ایک نگہبان تیار بیٹھا ہوتا ہے)۔ اس سے مراد وہ فرشتہ ہے جو تمہارے اقوال کو شمار کرتا ہے۔ اللہ تعالیٰ فرماتا ہے: **إِنَّ عَلَيْكُمْ لَحافِظِينَ كِراماً كاتِبِينَ يَعْلَمُونَ ما تَفْعَلُونَ** (بے شک تم پر نگہبان ہیں، معزز لکھنے والے، جو کچھ تم کرتے ہو وہ جانتے ہیں)۔ اور تمہارے اقوال تمہارے افعال میں سے ہیں۔ اللہ تعالیٰ کے اس قول پر غور کرو: **ولا تَقُولُوا لِمَنْ يُقْتَلُ في سَبِيلِ الله أَمْواتٌ** (اور جو اللہ کی راہ میں مارے جائیں انہیں مردہ نہ کہو)۔ پس اس نے تمہیں قول سے منع کیا۔ کیونکہ اللہ نے اس شخص کو جھٹلایا جس نے ایسی بات کہی۔ کیونکہ اللہ نے ان کے بارے میں فرمایا کہ وہ زندہ ہیں۔ کیا تم اللہ کے اس قول پر غور نہیں کرتے جہاں وہ فرماتا ہے: **ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله أَمْواتاً بَلْ أَحْياءٌ عِنْدَ رَبِّهِمْ** (اور جو لوگ اللہ کی راہ میں مارے گئے انہیں ہرگز مردہ نہ سمجھو، بلکہ وہ زندہ ہیں اپنے رب کے پاس)۔ اور فرمایا: **لا يُحِبُّ الله الْجَهْرَ بِالسُّوءِ من الْقَوْلِ** (اللہ بری بات کا کھلے عام کہنا پسند نہیں کرتا)۔ اور فرمایا: **لا خَيْرَ في كَثِيرٍ من نَجْواهُمْ** (ان کی اکثر سرگوشیوں میں کوئی بھلائی نہیں)۔ اور یہ قول ہے۔ پس جب تم بات کرو تو اس میزان کے مطابق بات کرو جو اللہ نے تمہارے لیے بات کرنے کے لیے مشروع کیا ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم مذاق بھی کرتے تھے تو صرف حق بات کہتے تھے۔ پس تم پر لازم ہے کہ تم حق بات کہو جس سے اللہ راضی ہو۔ کیونکہ ہر حق بات جو کہی جائے، اللہ اس سے راضی نہیں ہوتا۔ کیونکہ چغلی (النميمة) حق ہے اور غیبت (الغيبة) حق ہے، لیکن وہ اللہ کو راضی نہیں کرتیں۔ اور تمہیں غیبت کرنے اور کسی کی چغلی کرنے سے منع کیا گیا ہے۔ اور اللہ کے اقوال کا خیال رکھنے میں سے وہ ہے جو ہم نے صحیح مسلم میں اللہ تعالیٰ سے روایت کیا ہے کہ جب آسمان سے بارش ہوئی تو عزوجل نے فرمایا: **أصبح من عبادي مؤمن بي وكافر فمن قال مطرنا بنوء كذا وكذا فهو كافر بي مؤمن بالكوكب وأما من قال مطرنا بفضل الله ورحمته فذلك مؤمن بي كافر بالكوكب** (میرے بندوں میں سے کچھ نے مجھ پر ایمان لانے والے اور کچھ نے کفر کرنے والے کی حالت میں صبح کی۔ پس جس نے کہا کہ ہم پر فلاں ستارے کی وجہ سے بارش ہوئی، تو وہ میرا کافر اور ستارے پر ایمان لانے والا ہے۔ اور جس نے کہا کہ ہم پر اللہ کے فضل اور رحمت سے بارش ہوئی، تو وہ میرا مومن اور ستارے کا کافر ہے)۔ پس اس نے بات کرنے والوں کے اقوال کا خیال رکھا۔ اور ابو ہریرہ رضی اللہ عنہ جب بارش ہوتی تو کہتے: ہم پر نوء الفتح (فتح کے ستارے) سے بارش ہوئی، پھر یہ آیت پڑھتے: **ما يَفْتَحِ الله لِلنَّاسِ من رَحْمَةٍ فَلا مُمْسِكَ لَها** (جو رحمت اللہ لوگوں کے لیے کھول دے، اسے کوئی روکنے والا نہیں)۔ اور اگر تم یہ اعتقاد رکھتے ہو کہ اللہ ہی نے اسباب کو رکھا اور انہیں نصب کیا، اور ہمارے ہاں یہ عادت جاری کی کہ وہ چیزوں کو ان کے پاس کرتا ہے نہ کہ ان کے ذریعے، اور اس سب کے باوجود، وہ بات نہ کہو جس سے اللہ نے تمہیں منع کیا ہے کہ تم اسے کہو اور اس کا تلفظ کرو۔ کیونکہ جس طرح اس نے تمہیں بعض امور سے منع کیا ہے، اسی طرح اس نے تمہیں قول سے بھی منع کیا ہے، اگرچہ وہ حق ہو۔ اور اللہ عزوجل کے اس قول کی پختگی پر غور کرو: **مؤمن بي كافر بالكوكب وكافر بي مؤمن بالكوكب** (میرا مومن، ستارے کا کافر، اور میرا کافر، ستارے کا مومن)۔ کیونکہ جب بھی اس نے اللہ کے فضل سے کہا، تو اس نے ستارے کو چھپا دیا جہاں اس نے اس کا نام نہیں لیا۔ اور جس نے ستارے سے کہا، تو اس نے اللہ کو چھپا دیا، اگرچہ وہ یہ اعتقاد رکھتا ہو کہ وہی فاعل ہے اور بارش برسانے والا ہے، لیکن اس نے اس کے نام کا تلفظ نہیں کیا۔ پس اللہ تعالیٰ کفر (الستر) کے لفظ کے ساتھ آیا جو چھپانا ہے۔ پس تم ستاروں کے ذریعے بارش طلب کرنے سے بچو کہ تم اس کا تلفظ کرو، اور اس سے زیادہ یہ کہ تم اس کا اعتقاد رکھو۔ کیونکہ اگر تم مومن ہو تو تمہارا اعتقاد یہ ہے کہ اللہ نے انہیں عادتاً دلائل کے طور پر نصب کیا ہے، اور ہر عادتی دلیل میں عادت کا ٹوٹنا جائز ہے۔ پس تم عادات کے فتنوں سے بچو، اور وہ تمہیں اللہ کی حدود سے نہ پھیر دیں جو اس نے تمہارے لیے مقرر کی ہیں، پس تم ان سے تجاوز نہ کرو۔ کیونکہ اللہ نے انہیں مقرر نہیں کیا مگر اس لیے کہ وہ ان کا خیال رکھتا ہے، اور یہ ہر چیز میں ہے۔ صحیح خبر میں آیا ہے کہ: **إن الرجل يتكلم بالكلمة من سخط الله ما يظن أن تبلغ ما بلغت فيهوي بها في النار سبعين حريفا وإن الرجل ليتكلم بالكلمة من رضوان الله ما يظن أن تبلغ ما بلغت فيرفع بها في عليين** (بے شک آدمی اللہ کی ناراضگی کی کوئی ایسی بات کہتا ہے جس کے بارے میں وہ نہیں سوچتا کہ وہ وہاں تک پہنچے گی جہاں تک وہ پہنچی، تو وہ اس کی وجہ سے ستر سال جہنم میں گرتا ہے۔ اور بے شک آدمی اللہ کی رضا کی کوئی ایسی بات کہتا ہے جس کے بارے میں وہ نہیں سوچتا کہ وہ وہاں تک پہنچے گی جہاں تک وہ پہنچی، تو وہ اس کی وجہ سے علیین میں بلند کر دیا جاتا ہے)۔ پس تم صرف وہی بات کہو جس سے اللہ راضی ہو، نہ کہ وہ جس سے اللہ تم پر ناراض ہو۔ اور یہ تمہیں اس وقت تک حاصل نہیں ہو سکتا جب تک کہ تم یہ نہ جان لو کہ اس نے تمہارے نطق (بولنے) میں کیا حد مقرر کی ہے۔ اور یہ ایک ایسا باب ہے جسے لوگوں نے نظر انداز کر دیا ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: **وهل يكب الناس على مناخرهم في النار إلا حصائد ألسنتهم** (اور کیا لوگوں کو ان کے چہروں کے بل جہنم میں ان کی زبانوں کی کٹائی کے سوا کوئی چیز گرائے گی؟) اور حکیم نے کہا: زبان سے زیادہ قید کیے جانے کا کوئی حقدار نہیں۔ اور اللہ نے اسے دو دروازوں کے پیچھے رکھا ہے: ہونٹ اور دانت۔ اس کے باوجود فضول گوئی زیادہ ہوتی ہے اور دروازے کھل جاتے ہیں۔\n\nاور تم اپنے ہاتھ سے ایسی تصویر بنانے سے بچو جس میں روح ڈالنے کی صلاحیت ہو، کیونکہ یہ ایک ایسا معاملہ ہے جسے لوگ اپنے لیے آسان سمجھتے ہیں، حالانکہ **وَهُوَ عِنْدَ الله عَظِيمٌ** (اور وہ اللہ کے نزدیک بہت بڑا ہے)۔ پس مصور لوگ قیامت کے دن سب سے زیادہ سخت عذاب میں ہوں گے۔ مصور سے قیامت کے دن کہا جائے گا: جو تم نے پیدا کیا اسے زندہ کرو، یا اس میں روح پھونکو، حالانکہ وہ پھونکنے والا نہیں ہو گا۔ اور اللہ تعالیٰ سے صحیح حدیث میں آیا ہے کہ اس نے فرمایا: **ومن أظلم ممن ذهب يخلق خلقا كخلقي فليخلقوا ذرة أو ليخلقوا حبة أو ليخلقوا شعيرة** (اور اس شخص سے زیادہ ظالم کون ہو گا جو میری مخلوق کی طرح کوئی مخلوق بنانے چلا؟ پس انہیں چاہیے کہ وہ ایک ذرہ پیدا کریں، یا ایک دانہ پیدا کریں، یا ایک جو پیدا کریں)۔ اور جب بندہ اس حد کا خیال رکھتا ہے اور اسے اللہ کی طرف سے آئی ہوئی بات کی وجہ سے چھوڑ دیتا ہے، اور کسی بھی چیز کی تصویر کشی میں ربوبیت (الربوبية) کے ساتھ مقابلہ نہیں کرتا، خواہ وہ حیوان ہو یا غیر حیوان، تو وہ عالم کی ہر صورت کی زندگی پر مطلع ہو جاتا ہے، اور وہ اسے ایک زندہ، بولنے والا حیوان دیکھتا ہے جو اللہ کی حمد بیان کر رہا ہے۔ اور اگر وہ اپنے نفس کو نباتات اور ان چیزوں کی تصویر کشی میں رعایت دیتا ہے جن میں ظاہری طور پر بصارت کے نزدیک روح نہیں ہوتی، تو وہ کبھی بھی اس طرح کے کشف (الکشف) پر مطلع نہیں ہو گا۔ کیونکہ حقیقت میں عالم کی ہر صورت کے لیے ایک روح ہے، اللہ نے ہماری آنکھوں کو اس چیز کی زندگی کے ادراک سے روک رکھا ہے جسے وہ حیوان نہیں کہتے۔ اور آخرت میں یہ معاملہ عام طور پر ظاہر ہو جائے گا، اسی لیے اس نے اسے دار الحیوان (زندہ گھر) کہا۔ پس تم وہاں کوئی چیز نہیں دیکھو گے مگر زندہ اور بولنے والی، برخلاف تمہاری دنیا کی حالت کے۔ جیسا کہ صحیح حدیث میں روایت ہے کہ **الحصى سبح في كف رسول الله ص** (کنکریوں نے رسول اللہ صلی اللہ علیہ وسلم کی ہتھیلی میں تسبیح کی)۔ پس لوگوں نے کنکریوں کی تسبیح کو خرق عادت (عادت کا ٹوٹنا) قرار دیا اور غلطی کی، بلکہ خرق عادت سننے والوں کی سماعت میں ہوا، کیونکہ وہ ہمیشہ سے تسبیح کر رہی تھیں۔ مگر یہ کہ وہ کسی خاص تسبیح یا نطق کی خاص ہیئت کے ساتھ تسبیح کریں جو کنکریوں نے اس سے پہلے نہ کی ہو اور نہ اس کیفیت پر، تب خرق عادت کنکریوں میں ہو گا نہ کہ سننے والے کی سماعت میں۔ اور سننے والے کی سماعت میں خرق عادت یہ ہے کہ اس نے اس چیز کا نطق سنا جسے سننے کی عادت نہیں تھی۔\n\nاور اے میرے بھائی! تم پر لازم ہے کہ تم بیماروں کی عیادت کرو، کیونکہ اس میں عبرت اور نصیحت ہے۔ کیونکہ اللہ نے انسان کو **ضَعْفٍ** (کمزوری) سے پیدا کیا ہے۔ پس تمہاری عیادت میں اس پر نظر ڈالنا تمہیں تمہاری اصل کی طرف متنبہ کرتا ہے، تاکہ تم اللہ سے اس قوت کے لیے محتاج ہو جاؤ جس سے وہ تمہیں اپنی اطاعت پر قوی کرے۔ اور یہ کہ اللہ اپنے بندے کے پاس ہوتا ہے جب وہ بیمار ہوتا ہے۔ کیا تم بیمار کو نہیں دیکھتے کہ وہ صرف اللہ سے فریاد کرتا ہے اور صرف اللہ کا ذکر (الذكر) کرتا ہے؟ پس ذات حق (الحق) ہمیشہ اس کی زبان پر بولا جاتا ہے اور اس کے دل میں اسی کی طرف التجا ہوتی ہے۔ پس بیمار ہمیشہ اللہ کے ساتھ ہوتا ہے، خواہ وہ کوئی بھی بیمار ہو، اگرچہ وہ علاج کرے اور شفا کے لیے اسباب کو اختیار کرے، اس کے باوجود وہ اللہ سے غافل نہیں ہوتا، اور یہ اس لیے کہ اللہ اس کے پاس حاضر ہوتا ہے۔ اور اللہ قیامت کے دن فرمائے گا: **يا ابن آدم مرضت فلم تعدني قال يا رب كيف أعودك أو أنت رب العالمين قال أ ما علمت أن عبدي فلانا مرض فلم تعده أ ما أنك لو عدته لوجدتني عنده** (اے ابن آدم! میں بیمار ہوا تو تو نے میری عیادت نہیں کی۔ وہ کہے گا: اے رب! میں تیری عیادت کیسے کرتا حالانکہ تو رب العالمین ہے؟ اللہ فرمائے گا: کیا تو نہیں جانتا کہ میرا فلاں بندہ بیمار ہوا تو تو نے اس کی عیادت نہیں کی؟ کیا تو نہیں جانتا کہ اگر تو اس کی عیادت کرتا تو مجھے اس کے پاس پاتا)۔ اور یہ حدیث صحیح ہے۔ پس اس کا قول **لوجدتني عنده** (تو مجھے اس کے پاس پاتا) سے مراد بیمار کا اپنے رب کا ذکر (الذكر) پوشیدہ اور کھلے عام کرنا ہے۔ اور اسی طرح جب اللہ کی مخلوق میں سے کوئی تم سے کھانا مانگے یا پانی مانگے، تو اسے کھانا کھلاؤ اور پانی پلاؤ، اگر تم اس کی استطاعت رکھتے ہو۔ کیونکہ اگر تمہیں کوئی شرف اور منزلت نہ ملتی مگر یہ کہ اس کھانا مانگنے والے اور پانی مانگنے والے نے تمہیں ذات حق (الحق) کے مقام پر اتارا ہے جو اپنے بندوں کو کھلاتا اور پلاتا ہے، تو یہی کافی ہے۔ اور یہ ایک ایسا نقطہ نظر ہے جس پر کم لوگ غور کرتے ہیں۔ اس سائل کو دیکھو جب وہ سوال کرتا ہے اور اپنی آواز بلند کرتا ہے، کہتا ہے: اللہ کے واسطے مجھے دو۔ پس اللہ نے اسے اس حال میں اپنے نام کے سوا کسی اور نام سے بولنے نہیں دیا۔ اور اس نے اپنی آواز بلند نہیں کی مگر اس لیے کہ تم اسے سنو تاکہ تم اسے دو۔ پس اس نے تمہیں اللہ کے نام سے پکارا اور آواز بلند کر کے تمہاری طرف التجا کی، جیسا کہ وہ اللہ کی طرف التجا کرتا ہے۔ اور جس نے تمہیں اپنے آقا کے مقام پر اتارا، تو تمہیں چاہیے کہ تم اسے محروم نہ کرو اور جو کچھ اس نے تم سے مانگا ہے، اسے دینے میں جلدی کرو۔ کیونکہ اس حدیث میں جو ہم نے ابھی بیان کی ہے، بندے کی بیماری کے بارے میں، اللہ فرماتا ہے: **يا ابن آدم استطعمتك فلم تطعمني قال يا رب كيف أطعمك وأنت رب العالمين قال أ ما علمت إن عبدي فلانا استطعمك فلم تطعمه أ ما لو أطعمته لوجدت ذلك عندي يا ابن آدم استسقيتك فلم تسقني قال يا رب كيف أسقيك وأنت رب العالمين قال أ ما علمت إن عبدي فلانا استسقاك فلم تسقه أما لو سقيته لوجدت ذلك عندي** (اے ابن آدم! میں نے تجھ سے کھانا مانگا تو تو نے مجھے نہیں کھلایا۔ وہ کہے گا: اے رب! میں تجھے کیسے کھلاتا حالانکہ تو رب العالمین ہے؟ اللہ فرمائے گا: کیا تو نہیں جانتا کہ میرے فلاں بندے نے تجھ سے کھانا مانگا تو تو نے اسے نہیں کھلایا؟ کیا تو نہیں جانتا کہ اگر تو اسے کھلاتا تو مجھے وہ اپنے پاس پاتا۔ اے ابن آدم! میں نے تجھ سے پانی مانگا تو تو نے مجھے نہیں پلایا۔ وہ کہے گا: اے رب! میں تجھے کیسے پلاتا حالانکہ تو رب العالمین ہے؟ اللہ فرمائے گا: کیا تو نہیں جانتا کہ میرے فلاں بندے نے تجھ سے پانی مانگا تو تو نے اسے نہیں پلایا؟ کیا تو نہیں جانتا کہ اگر تو اسے پلاتا تو مجھے وہ اپنے پاس پاتا)۔ اس حدیث کو مسلم نے محمد بن حاتم، بہز، حماد بن سلمہ، ثابت، ابو رافع، اور ابو ہریرہ رضی اللہ عنہ سے روایت کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا۔ پس اللہ نے اس خبر میں خود کو اپنے بندے کے مقام پر اتارا ہے۔ پس وہ بندہ جو ہر حال میں اللہ کے ساتھ حاضر اور اللہ کا ذکر (الذكر) کرنے والا ہے، ایسی حالت میں ذات حق (الحق) کو دیکھتا ہے کہ وہی ہے جس نے اس سے کھانا اور پانی مانگا، پس وہ جلدی کرتا ہے جو ذات حق (الحق) نے اس سے طلب کیا۔ کیونکہ وہ نہیں جانتا کہ قیامت کے دن شاید اسے اس شخص کی حالت میں کھڑا کیا جائے جس نے اس سے ضرورت کے وقت کھانا اور پانی مانگا تھا، تو اللہ اسے اس کا بدلہ دے گا۔ اور یہی اس کا قول ہے: **لوجدت ذلك عندي** (تو مجھے وہ اپنے پاس پاتا)۔ یعنی وہ کھانا اور پانی میں تمہارے لیے اٹھا کر رکھتا اور اس کی پرورش کرتا یہاں تک کہ تم قیامت کے دن آؤ، تو میں اسے تمہیں اس سے بہتر، پاکیزہ اور عظیم صورت میں واپس کروں گا۔ پس اگر تمہاری یہ ہمت نہیں ہے کہ تم اس شخص کو دیکھو جس نے تم سے پانی مانگا، کہ اس نے تمہیں اس کے مقام پر اتارا ہے جس کے ہاتھ میں اس کی حاجت پوری کرنا ہے، کیونکہ اللہ نے تمہیں اپنا خلیفہ بنایا ہے، تو کم از کم یہ کرو کہ تم اس سائل کی حاجت کو تجارت کی نیت سے پوری کرو، تاکہ نفع اور نیکی میں اضافہ ہو۔ پس جب تم اس طرح کی خبر پر مطلع ہو جاؤ اور دیکھو کہ اللہ ہی ہے جس نے تم سے وہ چیز مانگی ہے جس میں تم خلیفہ بنائے گئے ہو، کیونکہ سب کچھ اللہ کا ہے، اور اس نے تمہیں اس چیز میں خرچ کرنے کا حکم دیا ہے جس میں اس نے تمہیں خلیفہ بنایا ہے، پس اس نے فرمایا: **وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ** (اور اس میں سے خرچ کرو جس میں اس نے تمہیں خلیفہ بنایا ہے)۔ اور اس میں خرچ کرنے پر بڑا اجر رکھا ہے۔ پس کسی سائل کو خالی ہاتھ نہ لوٹاؤ، اگرچہ ایک اچھی بات سے ہی سہی، اور اس سے کشادہ روئی اور خوشی کے ساتھ ملو۔ کیونکہ تم درحقیقت اللہ سے مل رہے ہو۔ اور حسین یا حسن علیہ السلام جب کوئی سائل ان سے سوال کرتا تو وہ جلدی سے اسے عطا کرتے اور کہتے: خوش آمدید، اللہ کی قسم! میرے زادِ آخرت کو اٹھانے والے۔ کیونکہ انہوں نے اسے دیکھا کہ وہ ان کا بوجھ اٹھا رہا ہے، پس وہ ان کے لیے سواری کی طرح تھا۔ کیونکہ جب اللہ کسی بندے کو کوئی نعمت دیتا ہے اور کوئی دوسرا اس کے فضل کو نہیں اٹھاتا، تو وہ اسے قیامت کے دن اٹھائے ہوئے آئے گا یہاں تک کہ اس کے بارے میں سوال کیا جائے۔ اسی لیے حسن کہا کرتے تھے کہ سائل آخرت کے لیے اس کا زاد اٹھانے والا ہے، پس وہ اس سے بوجھ کی مشقت کو دور کر دیتا ہے۔\n\nاور تم بندوں کے مظالم سے بچو، کیونکہ ظلم قیامت کے دن اندھیرے ہیں۔ اور بندوں پر ظلم یہ ہے کہ تم ان کے وہ حقوق روک لو جو اللہ نے تم پر ان کی طرف ادا کرنا واجب کیے ہیں۔ اور یہ حال کے ذریعے بھی ہو سکتا ہے، جب تم اسے اضطرار کی حالت میں دیکھو اور تم اس کی کمی کو پورا کرنے اور اس کی ضرورت کو دور کرنے پر قادر اور موجود ہو۔ پس تم پر لازم ہے کہ تم جان لو کہ اس کا تمہارے مال میں اس کے حال کی وجہ سے حق ہے، کیونکہ اللہ نے تمہیں اس پر مطلع نہیں کیا مگر اس لیے کہ تم اسے اس کا حق ادا کرو، ورنہ تم سے سوال کیا جائے گا۔\n\n### [بے شک اللہ بندے سے چاہتا ہے کہ وہ کسی اچھی بات سے اس کی مدد کرے جس کے بارے میں وہ جانتا ہے کہ وہ اس کی کمی کو پورا کر سکتا ہے]\n\nپس اگر تمہارے پاس اس کی کمی کو پورا کرنے کی قدرت نہیں ہے، تو جان لو کہ اللہ نے تمہیں اس کے حال پر بے مقصد مطلع نہیں کیا، پس جان لو کہ وہ تم سے چاہتا ہے کہ تم اس کی مدد کسی اچھی بات سے اس شخص کے پاس کرو جس کے بارے میں تم جانتے ہو کہ وہ اس کی کمی کو پورا کر سکتا ہے۔ اور اگر تم یہ بھی نہ کر سکو، تو کم از کم اس کے لیے دعا کرو۔ اور یہ سب کچھ کوشش کرنے اور مایوس ہونے کے بعد ہی ہو گا، یہاں تک کہ تمہارے پاس دعا کے سوا کچھ نہ بچے گا۔ اور جب بھی تم اس قدر سے غافل ہوئے، تو تم اس حال والے پر ظلم کرنے والوں میں سے ہو۔ یہ سب اس صورت میں ہے جب وہ محتاج اس حاجت کی وجہ سے مر جائے۔ اور اگر وہ نہ مرے اور تمہارے علاوہ کسی دوسرے مومن نے اس کی کمی پوری کر دی، تو تمہارے بھائی نے تمہاری طرف سے یہ مطالبہ ساقط کر دیا، حالانکہ اسے اس کا شعور بھی نہیں۔ کیونکہ مومن مومن کا بھائی ہے، وہ اسے تنہا نہیں چھوڑتا، اگرچہ دینے والے نے یہ نیت نہ کی ہو، لیکن حقیقت میں ایسا ہی ہے، اور اللہ اسے اسی طرح قبول کرتا ہے۔ پس جب تم کسی سائل کو اس کے حال کی ضرورت کے مطابق کچھ دو، تو اس میں یہ نیت کرو کہ تم اپنے پہلے مومن بھائی کی طرف سے نیابت کر رہے ہو جس نے اسے محروم کیا تھا، اور تم اسے اپنے لیے ایثار بناؤ اس بھلائی کے ذریعے جو اس نے تمہاری خاطر باقی رکھی یہاں تک کہ تم اسے حاصل کر لو۔ پس اس نیت کے ساتھ عارفین ان ضرورت مندوں کو عطا کرتے ہیں جو اپنے حال اور اقوال سے سوال کرتے ہیں۔ **وأَمَّا السَّائِلَ فَلا تَنْهَرْ** (اور سائل کو مت جھڑکو)۔ اور یہ خواہ محسوس قوت میں ہو یا معنوی میں۔ کیونکہ علم بھی اسی باب سے ہے اور فائدہ پہنچانا بھی۔ کیونکہ گمراہ ہدایت طلب کرتا ہے، بھوکا کھانا طلب کرتا ہے، اور ننگا لباس طلب کرتا ہے جو اسے ہوا کی سردی اور گرمی سے بچائے اور اس کی شرمگاہ کو ڈھانپے۔ اور وہ مجرم جو جانتا ہے کہ تم اسے پکڑنے پر قادر ہو، وہ تم سے اپنے جرم کی معافی طلب کرتا ہے۔ پس پڑوسیوں کی رہنمائی کرو، بھوکے کو کھانا کھلاؤ، پیاسے کو پانی پلاؤ، ننگے کو لباس پہناؤ، اور جان لو کہ تم اس چیز کے محتاج ہو جس میں وہ تمہارے محتاج ہیں۔ اور اللہ **غَنِيٌّ عَنِ الْعالَمِينَ** (تمام جہانوں سے بے نیاز ہے)۔ اس کے باوجود وہ ان کی دعا قبول کرتا ہے اور ان کی حاجتیں پوری کرتا ہے، اور ان سے کہتا ہے کہ وہ اس سے اپنے سے نقصانات کو دور کرنے اور فوائد کو پہنچانے کے لیے سوال کریں۔ پس تم زیادہ حقدار ہو کہ تم اللہ کے بندوں کے ساتھ ایسا ہی معاملہ کرو، کیونکہ تمہیں ان امور میں اللہ کی حاجت ہے۔ مسلم نے صحیح میں عبداللہ بن عبدالرحمن بن بہرام الدارمی، مروان بن محمد الدمشقی، سعید بن عبدالعزیز، ربیعہ بن یزید، ابو ادریس الخولانی، اور ابو ذر رضی اللہ عنہ سے روایت کیا ہے کہ نبی صلی اللہ علیہ وسلم نے اللہ تبارک و تعالیٰ سے روایت کرتے ہوئے فرمایا: **يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا يا عبادي كلكم ضال إلا من هديته فاستهدوني أهدكم يا عبادي كلكم جائع إلا من أطعمته فاستطعموني أطعمكم يا عبادي كلكم عار إلا من كسوته فاستكسوني أكسكم يا عبادي أنتم تخطئون بالليل والنهار وأنا اغفر الذنوب جميعا فاستغفروني أغفر لكم** (اے میرے بندو! میں نے ظلم کو اپنے اوپر حرام کر دیا ہے اور اسے تمہارے درمیان بھی حرام قرار دیا ہے، پس ایک دوسرے پر ظلم نہ کرو۔ اے میرے بندو! تم سب گمراہ ہو سوائے اس کے جسے میں ہدایت دوں، پس مجھ سے ہدایت مانگو، میں تمہیں ہدایت دوں گا۔ اے میرے بندو! تم سب بھوکے ہو سوائے اس کے جسے میں کھلاؤں، پس مجھ سے کھانا مانگو، میں تمہیں کھلاؤں گا۔ اے میرے بندو! تم سب ننگے ہو سوائے اس کے جسے میں لباس پہناؤں، پس مجھ سے لباس مانگو، میں تمہیں لباس پہناؤں گا۔ اے میرے بندو! تم دن رات غلطیاں کرتے ہو اور میں تمام گناہوں کو بخش دیتا ہوں، پس مجھ سے مغفرت طلب کرو، میں تمہیں بخش دوں گا)۔ اور ذات حق (الحق) تمہیں یہ سب کچھ تمہارے سوال کیے بغیر بھی عطا کرتا ہے، لیکن اس کے باوجود اس نے تمہیں حکم دیا کہ تم اس سے سوال کرو، تو وہ تمہیں تمہارے سوال کے جواب میں عطا کرتا ہے تاکہ وہ تمہیں اپنی عنایت دکھائے جہاں اس نے تمہارا سوال قبول کیا۔ اور یہ ایک اور درجہ ہے جو اس نے تمہیں عطا کیا ہے اس سے زیادہ ہے۔ اور جب تمہارا سوال اس کے حکم سے ہو، اور وہ تم سے جانتا ہے کہ تم سوال کرو گے، اور تمہاری اصل ضرورت جو تم پر پیدا کی گئی ہے، وہ حاجت اور سوال ہے، تاکہ تم اپنے سوال میں ایک واجب حکم ادا کرنے والے بن جاؤ، تو تمہیں اس شخص کی جزا ملے گی جس نے اللہ کے حکم کی تعمیل کی، پس تم نیکی پر نیکی کا اضافہ کرو گے۔ پس اس نے تمہیں حکم نہیں دیا مگر تم پر رحمت کرتے ہوئے اور تمہاری طرف بھلائی پہنچاتے ہوئے، اور تمہیں اس بات پر متنبہ کرنے کے لیے کہ تمہاری حاجت اسی کی طرف ہے نہ کہ کسی اور کی طرف۔ کیونکہ اس نے تمہیں صرف اپنی عبادت کے لیے پیدا کیا ہے، یعنی تاکہ تم اس کے لیے ذلت اختیار کرو۔ پس جس کی میں تمہیں وصیت کرتا ہوں وہ ذات حق (الحق) کے اوامر اور نواہی پر ٹھہرنا اور اس بارے میں اس سے سمجھ حاصل کرنا ہے، تاکہ تم ان علماء میں سے ہو جاؤ جو یہ جانتے ہیں کہ اللہ نے تمہیں اپنے حکم اور نہی میں کیا ارادہ کیا ہے۔ اور جو اپنے رب سے سوال نہیں کرتا، اس نے اسے بخیل سمجھا۔ یہ عام لوگوں کے حق میں ہے۔ پس اگر تم نے اس چیز میں کوتاہی کی جس کی میں نے تمہیں وصیت کی ہے، تو اپنے آپ کو ہی ملامت کرنا۔ کیونکہ اگر تم جاہل تھے تو میں نے تمہیں سکھا دیا، اور اگر تم بھولنے والے اور غافل تھے تو میں نے تمہیں متنبہ کر دیا اور یاد دلایا۔ پس اگر تم مومن ہو تو نصیحت تمہیں فائدہ دے گی۔ کیونکہ میں نے تمہیں یاد دلا کر اللہ کے حکم کی تعمیل کی ہے، اور تمہارا نصیحت سے فائدہ اٹھانا تمہارے ایمان کی گواہی ہے۔ اللہ عزوجل نے میرے حق میں اور تمہارے حق میں فرمایا: **وذَكِّرْ فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ** (اور نصیحت کرو، کیونکہ نصیحت مومنوں کو فائدہ دیتی ہے)۔ پس اگر نصیحت تمہیں فائدہ نہ دے تو اپنے ایمان پر شک کرو، کیونکہ اللہ سچا ہے اور اس نے خبر دی ہے کہ نصیحت مومنوں کو فائدہ دیتی ہے۔ اور اس الٰہی خبر کی تکمیل جو ہم نے **اغفر لكم** (میں تمہیں بخش دوں گا) کے بعد بیان کی، یہ ہے کہ اس نے فرمایا: **يا عبادي إنكم لن تبلغوا ضري فتضروني ولن تبلغوا نفعي فتنفعوني** (اے میرے بندو! تم مجھے نقصان پہنچانے کی حد تک نہیں پہنچ سکتے کہ مجھے نقصان پہنچاؤ، اور نہ ہی تم مجھے نفع پہنچانے کی حد تک پہنچ سکتے کہ مجھے نفع پہنچاؤ)۔ اور یہ معلوم ہے کہ وہ سبحانہ و تعالیٰ نہ نقصان اٹھاتا ہے اور نہ نفع حاصل کرتا ہے، کیونکہ وہ تمام جہانوں سے بے نیاز ہے۔ لیکن جب اس نے خود کو اپنے بندے کے مقام پر اتارا جیسا کہ ہم نے کھانا اور پانی مانگنے میں ذکر کیا، تو اس نے ہمیں اس بات پر متنبہ کیا کہ بندوں کے لیے اسے نقصان پہنچانے یا نفع پہنچانے کی انتہا تک پہنچنا ناممکن ہے۔ اور یہ ناممکن ہے کہ اس کی انتہا تک پہنچا جائے۔ اور چونکہ اللہ نے ایک قوم کے حق میں فرمایا: **بِأَنَّهُمُ اتَّبَعُوا ما أَسْخَطَ الله** (اس لیے کہ انہوں نے اس چیز کی پیروی کی جس سے اللہ ناراض ہوا) اور یہ ظاہر میں نقصان ہے، تو اس نے خود کو اس سے پاک قرار دیا۔ اور اسی طرح جس نے کوئی ایسا فعل کیا جس سے اللہ راضی ہوتا ہے اور خوش ہوتا ہے، جیسے توبہ کرنے والے کی توبہ پر اللہ کا خوش ہونا۔ پس یہ خبر اس بیماری کے لیے دوا کی طرح تھی جو اللہ کے علم میں کمزور بعض نفوس میں پیدا ہوتی ہے، جنہیں اس بات کا علم نہیں ہوتا جو اس کا قول **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (اس کی مثال کوئی چیز نہیں) عطا کرتا ہے۔ پھر اس خبر کی تکمیل میں اس کا قول ہے: **يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد ما زاد ذلك في ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد ما نقص ذلك من ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا دخل في البحر** (اے میرے بندو! اگر تمہارے اول و آخر، تمہارے انسان اور جن، سب ایک ہی شخص کے سب سے زیادہ متقی دل پر ہوں، تو یہ میری بادشاہت میں کچھ بھی اضافہ نہیں کرے گا۔ اے میرے بندو! اگر تمہارے اول و آخر، تمہارے انسان اور جن، سب ایک ہی شخص کے سب سے زیادہ فاجر دل پر ہوں، تو یہ میری بادشاہت میں کچھ بھی کمی نہیں کرے گا۔ اے میرے بندو! اگر تمہارے اول و آخر، تمہارے انسان اور جن، سب ایک ہی میدان میں کھڑے ہو جائیں اور مجھ سے سوال کریں، اور میں ہر انسان کو اس کا سوال دے دوں، تو یہ میرے پاس جو کچھ ہے اس میں سے کچھ بھی کم نہیں کرے گا مگر اتنا جتنا سوئی سمندر میں داخل ہونے سے کم کرتی ہے)۔ اور یہ سب ان کمزور نفوس کی بیماریوں کے لیے دوا ہے جن کا ہم نے ذکر کیا۔ پس اے ولی! ان دواؤں کو استعمال کرو۔ اللہ فرماتا ہے: **إنما هي أعمالكم أحصيها لكم ثم أو فيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه** (یہ تمہارے ہی اعمال ہیں جنہیں میں تمہارے لیے شمار کرتا ہوں، پھر تمہیں ان کا پورا پورا بدلہ دوں گا۔ پس جس نے بھلائی پائی تو اسے اللہ کی حمد کرنی چاہیے، اور جس نے اس کے علاوہ کچھ پایا تو اسے اپنے آپ کو ہی ملامت کرنی چاہیے)۔ اور جس نے کسی حاجت کے لیے سوال کیا تو وہ ذلیل ہوا، اور جس نے اللہ کے علاوہ کسی اور کے لیے ذلت اختیار کی تو وہ گمراہ ہوا اور اس نے اپنے نفس پر ظلم کیا اور اسے ہدایت کے راستے پر نہیں چلایا۔ اور یہ میری وصیت ہے تمہارے لیے، پس اسے لازم پکڑو، اور میری نصیحت ہے، پس اسے جان لو۔ اور اللہ تعالیٰ ہمیشہ اپنی کتاب میں اور اپنے رسولوں کی زبانوں پر اپنے بندوں کو وصیت کرتا رہا ہے۔ پس جو بھی تمہیں ایسی چیز کی وصیت کرے جس کے استعمال میں تمہاری سعادت ہو، تو وہ اللہ کی طرف سے تمہاری طرف ایک رسول ہے، پس اپنے رب کے پاس اس کا شکر ادا کرو۔\n\nاگر آپ کسی ایسے عالم کو دیکھیں جس نے اپنے علم پر عمل نہیں کیا، تو آپ اپنا علم اس کے ساتھ اپنے ادب میں استعمال کریں تاکہ آپ اس عالم کا حق ادا کر سکیں جس حیثیت سے وہ عالم ہے، اور اس کے برے حال کی وجہ سے اس سے پردہ نہ کریں، کیونکہ اس کے علم کی وجہ سے اللہ کے ہاں اس کا ایک درجہ ہے۔ بے شک انسان قیامت کے دن اس کے ساتھ اٹھایا جائے گا جس سے اس نے محبت کی، اور جس نے کسی صفتِ الٰہیہ کے ساتھ ادب اختیار کیا، اسے قیامت کے دن وہی صفت پہنائی جائے گی اور اسی میں اٹھایا جائے گا۔\n\nآپ پر لازم ہے کہ ہر اس چیز کو بجا لائیں جس کے بارے میں آپ جانتے ہیں کہ اللہ اسے آپ سے پسند کرتا ہے، لہٰذا اس کی طرف تیزی سے بڑھیں، کیونکہ جب آپ اس کے ذریعے اللہ تعالیٰ سے محبت کے راستے پر آراستہ ہوں گے تو وہ آپ سے محبت کرے گا، اور جب وہ آپ سے محبت کرے گا تو آپ کو اپنی معرفت (المعرفۃ)، اپنے ظہور الٰہی (التجلی) اور اپنی دارِ کرامت کے ذریعے سعادت مند بنائے گا، پس وہ آپ کو آپ کی آزمائش میں بھی نعمتیں عطا کرے گا۔\n\nاور جن چیزوں کو اللہ تعالیٰ پسند کرتا ہے وہ بہت زیادہ ہیں، میں ان میں سے کچھ کا ذکر نصیحت اور وصیت کے طور پر کرتا ہوں جو آسان ہوں۔\n\nان میں سے ایک اللہ کے لیے خوبصورتی اختیار کرنا (التجمل للہ) ہے، کیونکہ یہ ایک مستقل عبادت ہے، خاص طور پر نماز کی عبادت میں، کیونکہ آپ کو اس کا حکم دیا گیا ہے۔ اللہ تعالیٰ نے فرمایا:\n**يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ**\n(اے آدم کی اولاد! ہر مسجد کے پاس اپنی زینت اختیار کرو)۔\n\nاور انکار کے انداز میں فرمایا:\n**قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِ قُلْ هِيَ لِلَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا خَالِصَةً يَوْمَ الْقِيَامَةِ كَذَلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ**\n(کہو: کس نے حرام کی ہے اللہ کی وہ زینت جو اس نے اپنے بندوں کے لیے نکالی اور رزق کی پاکیزہ چیزیں؟ کہو: وہ دنیا کی زندگی میں ایمان والوں کے لیے ہیں، اور قیامت کے دن خالصتاً انہی کے لیے ہوں گی۔ اسی طرح ہم آیات کو ان لوگوں کے لیے کھول کر بیان کرتے ہیں جو علم رکھتے ہیں)۔\n\nاور اس طرح کے بیان قرآن میں اس سے بھی زیادہ ہیں۔ پس اللہ کی زینت اور دنیا کی زندگی کی زینت میں کوئی فرق نہیں ہے مگر صرف قصد اور نیت کا۔ زینت کا عین (حقیقت) وہی ہے، کوئی دوسری چیز نہیں ہے۔ پس نیت ہی امور کی روح ہے، اور بے شک ہر شخص کے لیے وہی ہے جو اس نے نیت کی۔ پس ہجرت، جس حیثیت سے وہ ایک ہی ہجرت تھی، تو جس کی ہجرت اللہ اور اس کے رسول کی طرف تھی، تو اس کی ہجرت اللہ اور اس کے رسول کی طرف ہوئی، اور جس کی ہجرت دنیا حاصل کرنے یا کسی عورت سے شادی کرنے کے لیے تھی، تو اس کی ہجرت اسی کی طرف ہوئی جس کی طرف اس نے ہجرت کی۔\n\nاسی طرح صحیح حدیث میں امام کی بیعت کے بارے میں ان تین لوگوں کے بارے میں آیا ہے جن سے اللہ قیامت کے دن بات نہیں کرے گا، اور نہ انہیں پاک کرے گا، اور ان کے لیے دردناک عذاب ہو گا، اور ان میں ایک شخص وہ ہے جس نے امام کی بیعت کی، اور وہ صرف دنیا کے لیے بیعت کرتا ہے، اگر امام اسے دنیا میں سے کچھ دے تو وہ وفا کرتا ہے، اور اگر نہ دے تو وہ وفا نہیں کرتا۔ پس اعمال کا دار و مدار نیتوں پر ہے، اور یہ اسلام کے گھر کے ارکان میں سے ایک ہے۔\n\nاور صحیح مسلم میں آیا ہے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: \"یا رسول اللہ! میں پسند کرتا ہوں کہ میری جوتی اچھی ہو اور میرا لباس اچھا ہو۔\" تو رسول اللہ صلی اللہ علیہ وسلم نے اسے فرمایا:\n**إن الله جميل يحب الجمال**\n(بے شک اللہ جمیل ہے اور جمال کو پسند کرتا ہے)۔\n\nاور آپ صلی اللہ علیہ وسلم نے فرمایا:\n**إن الله أولى من يتجمل له**\n(بے شک اللہ سب سے زیادہ حقدار ہے کہ اس کے لیے خوبصورتی اختیار کی جائے)۔\n\n(اور اسی باب میں سے ہے) کہ اللہ تعالیٰ نے جبرائیل کو آپ صلی اللہ علیہ وسلم پر اکثر نزول کے وقت دحیہ کلبی کی صورت میں بھیجا، اور وہ اپنے زمانے کے سب سے خوبصورت شخص تھے۔ اور ان کے جمال کا مخلوق پر اثر اس حد تک پہنچا کہ جب وہ مدینہ آئے اور لوگوں نے ان کا استقبال کیا، تو کسی حاملہ عورت نے انہیں نہیں دیکھا مگر اس نے اپنے پیٹ کا حمل گرا دیا۔ پس ذات حق (الحق) اپنے نبی صلی اللہ علیہ وسلم کو جبرائیل کے دحیہ کی صورت میں نازل ہونے کی بشارت دیتے ہوئے گویا یہ فرما رہی تھی: \"اے محمد! میرے اور تمہارے درمیان جمال کی صورت کے سوا کچھ نہیں ہے۔\" اللہ تعالیٰ آپ کو اپنے نفس سبحانہ کے حال کے بارے میں خبر دے رہا ہے۔\n\nپس جس نے اللہ کے لیے خوبصورتی اختیار کرنے سے محروم رہا جیسا کہ ہم نے کہا، تو وہ اللہ کی طرف سے اس خاص اور معین محبت سے محروم رہا۔ اور جب وہ اس خاص اور معین محبت سے محروم رہا، تو وہ اللہ کی طرف سے اس علم، ظہور الٰہی (التجلی) اور دارِ سعادت میں کرامت سے محروم رہا جو اس محبت کا نتیجہ ہے، اور میدانِ رؤیت (کثیب الرؤیۃ) میں منزلت سے، اور اس دنیا میں اپنے سلوک اور مشاہدات میں معنوی، علمی، روحانی شہود (الشہود) سے محروم رہا۔ لیکن جیسا کہ ہم نے کہا، وہ اس خوبصورتی سے اللہ کے لیے نیت کرے، نہ کہ دنیا کی نمائش، فخر، غرور، عجب اور دوسروں پر تکبر کے لیے۔\n\n(اور ان میں سے ہے)\nفتنہ کے وقت اللہ کی طرف رجوع کرنا\n\nکیونکہ اللہ ہر آزمائش زدہ توبہ کرنے والے سے محبت کرتا ہے، رسول اللہ صلی اللہ علیہ وسلم نے ایسا ہی فرمایا ہے۔\n\nاللہ عزوجل نے فرمایا:\n**خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا**\n(اس نے موت اور زندگی کو پیدا کیا تاکہ تمہیں آزمائے کہ تم میں سے کون عمل میں سب سے بہتر ہے)۔\n\nاور بلاء (آزمائش) اور فتنہ کا معنی ایک ہی ہے، اور وہ صرف اس دعوے کی جانچ ہے جس پر انسان قائم ہے۔\n**إِنْ هِيَ إِلَّا فِتْنَتُكَ**\n(یہ نہیں ہے مگر تیری آزمائش) یعنی تیرا امتحان،\n**تُضِلُّ بِهَا مَنْ تَشَاءُ**\n(تو اس کے ذریعے جسے چاہے گمراہ کر دے) یعنی اسے حیران کر دے،\n**وَتَهْدِي بِهَا مَنْ تَشَاءُ**\n(اور اس کے ذریعے جسے چاہے ہدایت دے) یعنی اس میں اس کے نجات کا راستہ واضح کر دے۔\n\n(اور سب سے بڑے فتنے) عورتیں، مال، اولاد اور جاہ (عزت و مرتبہ) ہیں۔\n\nیہ چار چیزیں ہیں، جب اللہ کسی بندے کو ان میں سے کسی ایک یا سب سے آزمائے، اور وہ ان میں اس حق کے مقام پر قائم رہے جو اللہ نے اس کے لیے مقرر کیا ہے، اور ان میں اللہ کی طرف رجوع کرے، اور ان کی عین (حقیقت) کے ساتھ نہ ٹھہر جائے، اور انہیں ایک نعمتِ الٰہیہ سمجھے جو اللہ نے اسے عطا کی ہے، اور وہ نعمت اسے اللہ تعالیٰ کی طرف لوٹا دے، اور اسے شکر کے حق کے مقام پر قائم کرے، جس کا\n\nاللہ نے اپنے نبی موسیٰ علیہ السلام کو حکم دیا تھا، پس ان سے فرمایا: \"اے موسیٰ! میرا حق شکر ادا کر۔\" موسیٰ نے عرض کیا: \"اے رب! حق شکر کیا ہے؟\" اللہ نے ان سے فرمایا: \"اے موسیٰ! جب تو نعمت کو میری طرف سے دیکھے، تو یہی حق شکر ہے۔\" اسے ابن ماجہ نے اپنی سنن میں رسول اللہ صلی اللہ علیہ وسلم سے ذکر کیا ہے۔\n\nاور جب اللہ نے اپنے نبی محمد صلی اللہ علیہ وسلم کے اگلے پچھلے گناہ معاف فرما دیے، اور اس کی بشارت انہیں اللہ تعالیٰ کے اس قول سے دی:\n**لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ**\n(تاکہ اللہ تمہارے اگلے پچھلے گناہ معاف کر دے) تو آپ صلی اللہ علیہ وسلم کھڑے رہے یہاں تک کہ آپ کے قدم مبارک سوج گئے، آپ نے اس پر اللہ تعالیٰ کا شکر ادا کیا، پس آپ نے سستی نہیں کی اور نہ ہی راحت کی طرف مائل ہوئے۔ اور جب آپ سے اس بارے میں کہا گیا اور اپنے نفس پر نرمی کرنے کے بارے میں پوچھا گیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا:\n**أفلا أكون عبداً شكوراً**\n(کیا میں شکر گزار بندہ نہ بنوں؟) اور یہ اس لیے تھا کہ آپ نے اللہ کو یہ فرماتے ہوئے سنا: \"بے شک اللہ شکر گزاروں سے محبت کرتا ہے۔\"\n\nپس اگر وہ انعام دینے والے کے شکر کے مقام پر قائم نہ ہوا، تو وہ اللہ کی طرف سے اس خاص محبت سے محروم رہا جو اس مقام کے ساتھ خاص ہے، جسے اللہ کی طرف سے صرف شکر گزار ہی حاصل کرتا ہے، کیونکہ اللہ فرماتا ہے:\n**وَقَلِيلٌ مِنْ عِبَادِيَ الشَّكُورُ**\n(اور میرے بندوں میں سے بہت کم شکر گزار ہیں)۔ اور جب وہ اس سے محروم رہا، تو وہ اس علم باللہ، ظہور الٰہی (التجلی)، دارِ کرامت میں خاص نعمت اور یوم الزور الاعظم (قیامت کا دن) میں میدانِ رؤیت (کثیب الرؤیۃ) میں منزلت سے محروم رہا جو اس کے لیے مقرر ہے۔ کیونکہ ہر صفتِ خاصہ کی الٰہی محبت کے لیے ایک علم، ایک ظہور، ایک نعمت اور ایک منزلت ہوتی ہے، یہ ضروری ہے، جس سے اس صفت کا حامل دوسرے سے ممتاز ہوتا ہے۔\n\n(جہاں تک عورتوں کے فتنہ کا تعلق ہے)\n\nتو ان کی محبت میں اللہ کی طرف رجوع کرنے کی صورت یہ ہے کہ وہ یہ دیکھے کہ ہر ایک نے دوسرے سے محبت کی اور اس کی طرف مائل ہوا، پس اس نے اپنے نفس کے سوا کسی سے محبت نہیں کی، کیونکہ عورت اصل میں مرد سے اس کی چھوٹی پسلی سے پیدا کی گئی ہے۔ پس وہ اسے اپنے نفس سے اس صورت کا درجہ دیتا ہے جس پر اللہ نے انسان کامل (الإنسان الکامل) کو پیدا کیا ہے، اور وہ ذات حق (الحق) کی صورت ہے۔ پس ذات حق (الحق) نے اسے اپنے لیے ایک مظہر (مجلی) بنایا۔ اور جب کوئی چیز دیکھنے والے کے لیے مظہر ہو، تو دیکھنے والا اس صورت میں اپنے نفس کے سوا کچھ نہیں دیکھتا۔ پس جب وہ اس عورت میں اپنے نفس کو دیکھتا ہے، تو اس کی محبت اس میں شدید ہو جاتی ہے اور اس کا میلان اس کی طرف بڑھ جاتا ہے، کیونکہ وہ اس کی صورت ہے۔ اور آپ پر واضح ہو چکا ہے کہ اس کی صورت ذات حق (الحق) کی وہ صورت ہے جس پر اس نے اسے وجود بخشا، پس اس نے ذات حق (الحق) کے سوا کچھ نہیں دیکھا، لیکن محبت کی شہوت، لذتِ وصل اور تعلق کے ساتھ، جس میں وہ سچی محبت کے ساتھ حق فنا (فناء حق) ہو جاتا ہے، اور اس کا مقابلہ اپنی ذات سے مماثلت کے طور پر کرتا ہے۔ اسی لیے وہ اس میں فنا ہو گیا، پس اس کا کوئی جزو نہیں مگر وہ اس میں موجود ہے، اور محبت اس کے تمام اجزاء میں سرایت کر چکی ہے، پس وہ مکمل طور پر اس سے وابستہ ہو گیا، اسی لیے وہ اپنے مثل میں کلی فنا (الفناء الکلی) ہو گیا، برخلاف اس کے کہ وہ اپنے غیر مثل سے محبت کرے۔ یہاں تک کہ اس نے کہا:\n\n**أنا من أهوى ومن أهوى أنا**\n(میں وہ ہوں جس سے میں محبت کرتا ہوں، اور جس سے میں محبت کرتا ہوں وہ میں ہوں)۔\n\nاور دوسرے نے اس مقام پر کہا: \"میں اللہ ہوں۔\" پس جب آپ اپنے مثل کسی شخص سے یہ محبت کرتے ہیں، تو اس میں آپ کا شہود (الشہود) آپ کو اللہ کی طرف لوٹا دیتا ہے۔ پس آپ ان لوگوں میں سے ہیں جن سے اللہ نے محبت کی، اور یہ فتنہ ایک ایسا فتنہ تھا جس نے آپ کو ہدایت (المهداة) عطا کی۔\n\nاور عورتوں کی محبت کا دوسرا طریقہ یہ ہے کہ وہ ہر نوع میں امثال کے اعیان کے ظہور کے لیے انفعال (قبولیت) اور تخلیق کا محل ہیں۔ اور اس میں کوئی شک نہیں کہ اللہ نے عالم کے اعیان سے عالم کے عدم کی حالت میں صرف اس لیے محبت کی کہ وہ اعیان انفعال کا محل تھے۔ پس جب اس نے ارادہ کرنے والا ہونے کی حیثیت سے ان کی طرف توجہ کی، تو ان سے کہا: \"ہو جا\"، تو وہ ہو گئیں، پس ان کے ذریعے اس کی بادشاہت وجود میں ظاہر ہوئی، اور ان اعیان نے اللہ کو اس کی الوہیت کا حق دیا، پس وہ الٰہ ہوا، تو انہوں نے حال کے اعتبار سے تمام اسماء کے ذریعے اس کی عبادت کی، خواہ وہ ان اسماء کو جانتے ہوں یا نہ جانتے ہوں۔ پس اللہ کا کوئی اسم باقی نہیں رہا مگر بندہ اپنی صورت اور حال کے ساتھ اس میں قائم ہے، اگرچہ وہ اس اسم کا نتیجہ نہ جانتا ہو۔ اور یہی وہ ہے\n\nجس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے اللہ کے اسماء کے بارے میں اپنی دعا میں فرمایا:\n**أو استأثرت به في علم غيبك أو علمته أحداً من خلقك**\n(یا جسے تو نے اپنے علم غیب میں محفوظ رکھا، یا اپنی مخلوق میں سے کسی کو سکھایا)۔\n\nیعنی اس کے اسماء میں سے کہ وہ اس کی عین (حقیقت) کو پہچانے یہاں تک کہ اسے علم کے ذریعے دوسرے سے ممتاز کرے۔ کیونکہ انسان میں بہت سے امور صورت اور حال کے اعتبار سے ہوتے ہیں اور وہ انہیں نہیں جانتا، اور اللہ اس سے جانتا ہے کہ وہ اس میں موجود ہیں۔ پس جب اس نے عورت سے اس وجہ سے محبت کی جو ہم نے ذکر کی، تو اس کی محبت نے اسے اللہ تعالیٰ کی طرف لوٹا دیا، پس یہ فتنہ اس کے حق میں نعمتِ ہدایت بن گیا، تو اللہ نے اس سے محبت کی اس کے اس محبت میں اللہ تعالیٰ کی طرف رجوع کرنے کی وجہ سے۔\n\nاور جہاں تک اس کا کسی خاص عورت سے تعلق ہے، نہ کہ کسی دوسری سے، اگرچہ یہ حقائق جو ہم نے ذکر کیے ہیں ہر عورت میں جاری ہیں، تو یہ ان دونوں شخصوں کے درمیان اصل نشأت، طبعی مزاج اور روحانی نظر میں روحانی مناسبت کی وجہ سے ہے۔ پس ان میں سے کچھ ایک مقررہ مدت تک جاری رہتے ہیں، اور کچھ غیر مقررہ مدت تک، بلکہ ان کی مدت موت ہے اور تعلق زائل نہیں ہوتا، جیسے نبی صلی اللہ علیہ وسلم کی عائشہ رضی اللہ عنہا سے محبت، کیونکہ آپ ان سے اپنی تمام بیویوں سے زیادہ محبت کرتے تھے، اور آپ ان کے والد ابوبکر سے بھی محبت کرتے تھے۔ پس یہ ثانوی مناسبتیں ہی ہیں جو اشخاص کو متعین کرتی ہیں، اور پہلی وجہ وہی ہے جو ہم نے ذکر کی۔ اسی لیے مطلق محبت، مطلق سماع اور مطلق رؤیت جو اللہ کے بعض بندوں کو حاصل ہوتی ہے، وہ عالم میں کسی ایک شخص کے ساتھ خاص نہیں ہوتی۔ پس ہر حاضر ان کے نزدیک محبوب ہے اور وہ اس میں مشغول ہیں، اس کے باوجود اس اطلاق کے ساتھ بعض اشخاص کے لیے خاص مناسبت کی وجہ سے ایک خاص میلان ضروری ہے۔ کیونکہ عالم کی نشأت اپنے افراد میں اس تقیید کو ضروری بناتی ہے۔ اور کامل وہ ہے جو تقیید اور اطلاق کو جمع کرے۔\n\nپس اطلاق کی مثال\nنبی صلی اللہ علیہ وسلم کا یہ قول ہے:\n**حبب إلي من دنياكم ثلاث النساء**\n(تمہاری دنیا میں سے تین چیزیں میرے لیے محبوب بنائی گئیں: عورتیں) اور آپ نے کسی عورت کو خاص نہیں کیا۔\n\nاور تقیید کی مثال\nوہ روایت ہے جس میں آپ کی عائشہ سے محبت کا ذکر ہے\nاپنی تمام بیویوں سے زیادہ،\n\nایک روحانی الٰہی نسبت کی وجہ سے جس نے انہیں دوسروں کے مقابلے میں ان کے ساتھ مقید کر دیا، اس کے باوجود کہ آپ عورتوں سے محبت کرتے تھے۔ پس ہم نے فتنوں کے گھر کے ایک رکن کے بارے میں اتنا ذکر کر دیا ہے جو سمجھنے والے کے لیے کافی ہے۔\n\nاور جہاں تک فتنوں کے گھر کے دوسرے رکن کا تعلق ہے، جو جاہ (عزت و مرتبہ) ہے جسے ریاست (سرداری) سے تعبیر کیا جاتا ہے،\n\nتو وہ گروہ جو علم نہیں رکھتا، ان میں سے بعض کہتے ہیں کہ صدیقین کے دلوں سے سب سے آخر میں نکلنے والی چیز ریاست کی محبت ہے۔ پس اس قول کے عارفین اس معنی میں یہ بات نہیں کہتے جس طرح عام اہل طریق اسے سمجھتے ہیں، بلکہ یہ اس معنی میں ہے جسے ہم اہل اللہ کے کاملین کے مقصد کے طور پر واضح کریں گے۔ اور وہ یہ ہے کہ انسان کے نفس میں بہت سے امور ہیں جنہیں اللہ نے اس میں چھپا رکھا ہے، اور وہی ہے جو\n**يُخْرِجُ الْخَبْءَ فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ**\n(جو آسمانوں اور زمین میں چھپی ہوئی چیزوں کو نکالتا ہے، اور جو تم چھپاتے ہو اور جو تم ظاہر کرتے ہو، سب جانتا ہے)۔ یعنی جو تم میں سے ظاہر ہوا اور جو تم میں چھپا ہوا ہے جسے تم خود بھی نہیں جانتے۔ پس ذات حق (الحق) اپنے بندے کے لیے اس کے نفس میں سے وہ چیزیں نکالتا رہتا ہے جو اس نے اس میں چھپا رکھی تھیں، جنہیں وہ نہیں جانتا تھا کہ وہ اس کے نفس میں ہیں۔ جیسے ایک شخص جس میں ڈاکٹر وہ بیماری دیکھتا ہے جسے مریض اپنے نفس میں نہیں جانتا، اسی طرح وہ چیزیں جو اللہ نے مخلوق کے نفوس میں چھپا رکھی ہیں۔ کیا آپ نہیں دیکھتے کہ\n\nآپ صلی اللہ علیہ وسلم فرماتے ہیں:\n**من عرف نفسه عرف ربه**\n(جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا)۔\n\nاور ہر کوئی اپنے نفس کو نہیں پہچانتا، حالانکہ اس کا نفس اس کی عین (حقیقت) ہے، اس کے سوا کچھ نہیں۔ پس ذات حق (الحق) انسان کے لیے اس کے نفس میں سے وہ چیزیں نکالتا رہتا ہے جو اس نے اس میں چھپا رکھی تھیں، پس وہ ان کا شہود (الشہود) کرتا ہے، اور اس وقت اپنے نفس کے بارے میں وہ جانتا ہے جو اس سے پہلے نہیں جانتا تھا۔ پس کثیر گروہ نے کہا کہ صدیقین کے دلوں سے سب سے آخر میں نکلنے والی چیز ریاست کی محبت ہے۔ پس جب وہ نکلتی ہے تو انہیں ظاہر ہوتی ہے، اور وہ ریاست سے محبت کرتے ہیں، لیکن ان کی محبت عام لوگوں کی محبت سے مختلف ہوتی ہے۔ کیونکہ وہ اس حیثیت سے اس سے محبت کرتے ہیں کہ وہ اس پر ہیں جو اللہ نے ان کے بارے میں فرمایا کہ وہ ان کی سماعت، ان کی بصارت ہے، اور ان کی تمام قوتوں اور اعضاء کا ذکر کیا۔ پس جب وہ اس مقام پر ہوں، تو انہوں نے ریاست سے محبت صرف اللہ کے ذریعے کی، کیونکہ عالم پر تقدم (آگے ہونا) اللہ کے لیے ہے، کیونکہ وہ اس کے بندے ہیں۔ اور رئیس (سربراہ) مرؤوس (ماتحت) کے بغیر وجوداً اور تقدیراً نہیں ہوتا۔ پس اس کی مرؤوس سے محبت شدید ترین محبت ہوتی ہے، کیونکہ وہی اس کے لیے ریاست کو ثابت کرنے والا ہے۔ پس بادشاہ کو اپنی بادشاہت سے زیادہ کوئی چیز محبوب نہیں، کیونکہ اس کی بادشاہت ہی اس کے بادشاہ ہونے کو ثابت کرتی ہے۔ پس یہ اس قول کا دوسرا معنی ہے کہ صدیقین کے دلوں سے سب سے آخر میں ریاست کی محبت نکلتی ہے، پس وہ اسے دیکھتے ہیں اور ذوقاً اس کا شہود کرتے ہیں، نہ کہ یہ ان کے دلوں سے نکل جاتی ہے اور وہ ریاست سے محبت نہیں کرتے۔ کیونکہ اگر وہ اس سے محبت نہ کریں تو انہیں ذوقاً اس کا علم حاصل نہیں ہو گا، اور یہ وہ صورت ہے جس پر اللہ نے انہیں پیدا کیا ہے\n\nآپ صلی اللہ علیہ وسلم کے اس قول میں:\n**إن الله خلق آدم على صورته**\n(بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا) اس خبر کی بعض تاویلات اور احتمالات میں۔ پس یہ جان لیں۔\n\nاور جاہ (عزت و مرتبہ) کلمہ کا نافذ ہونا ہے، اور اس سے زیادہ نافذ کلمہ کوئی نہیں:\n**إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ**\n(جب وہ کسی چیز کا ارادہ کرتا ہے تو اسے کہتا ہے: ہو جا، تو وہ ہو جاتی ہے)۔ پس سب سے بڑا جاہ اس کا ہے جس کا جاہ اللہ کے ذریعے ہو، پس یہ بندہ اپنی عین (حقیقت) کے باقی رہنے کے ساتھ یہ دیکھتا ہے، اور اس وقت جانتا ہے کہ وہ وہ مثل ہے جس کی کوئی مثال نہیں، کیونکہ وہ عبد رب ہے، اور اللہ عزوجل رب ہے عبد نہیں، پس اس کے لیے جامعیت ہے اور ذات حق (الحق) کے لیے انفرادیت ہے۔\n\n(اور جہاں تک تیسرے رکن کا تعلق ہے) جو مال ہے،\n\nاور مال کو یہ نام صرف اس لیے دیا گیا کہ طبیعت اس کی طرف مائل ہوتی ہے (یمال إلیہ)۔ پس اللہ نے اس کے ذریعے اپنے بندوں کو آزمایا، جہاں اس نے بعض امور کی آسانی کو اس کے وجود سے جوڑ دیا، اور دلوں کو مالدار کی محبت اور تعظیم سے وابستہ کر دیا، خواہ وہ بخیل ہی کیوں نہ ہو۔ کیونکہ آنکھیں اسے تعظیم کی نظر سے دیکھتی ہیں، اس وہم کی وجہ سے کہ نفوس اس سے بے نیاز ہیں کیونکہ اس کے پاس مال ہے۔ اور بسا اوقات مالدار شخص اپنے نفس میں ان کا سب سے زیادہ محتاج ہوتا ہے، اور وہ اپنے پاس موجود چیز سے اکتفاء اور قناعت نہیں پاتا، پس وہ اپنے ہاتھ میں موجود چیز میں اضافہ چاہتا ہے۔\n\nاور جب عالم نے دلوں کا مالدار کی طرف مال کی وجہ سے میلان دیکھا، تو انہوں نے مال سے محبت کی۔ پس عارفین نے ایک الٰہی وجہ تلاش کی جس کے ذریعے وہ مال سے محبت کریں، کیونکہ اس سے محبت کرنا ناگزیر ہے۔ اور یہیں فتنہ اور ابتلاء کا مقام ہے جس میں گمراہی اور ہدایت (المهداة) ہے۔\n\nجہاں تک عارفین کا تعلق ہے، تو انہوں نے الٰہی امور کی طرف دیکھا، جن میں سے ایک اللہ تعالیٰ کا یہ قول ہے:\n**وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا**\n(اور اللہ کو اچھا قرض دو)۔ پس اس نے صرف مالداروں کو مخاطب کیا۔ پس انہوں نے مال سے محبت کی تاکہ وہ اس خطاب کے اہل ہوں، اور اسے سن کر لذت محسوس کریں جہاں بھی وہ ہوں۔ پس جب وہ اسے قرض دیتے ہیں، تو وہ دیکھتے ہیں کہ صدقہ رحمن کے ہاتھ میں پڑتا ہے، پس انہیں مال کے ذریعے اور اسے دینے کے ذریعے ذات حق (الحق) کی طرف سے اس کا تناول (قبولیت) حاصل ہوا، پس ان کے لیے تناول کا وصل حاصل ہوا۔ اور اللہ نے آدم کو اپنے اس قول سے شرف بخشا:\n**لِمَا خَلَقْتُ بِيَدَيَّ**\n(جسے میں نے اپنے دونوں ہاتھوں سے پیدا کیا)۔ پس جو شخص اس کے قرض کے سوال پر اسے دیتا ہے، وہ اس شخص سے زیادہ شرف کی لذت میں کامل ہے جسے اس نے اپنے ہاتھ سے پیدا کیا۔ پس اگر مال نہ ہوتا تو وہ نہ سنتے اور نہ ہی اس الٰہی خطاب کے اہل ہوتے، اور نہ ہی انہیں قرض کے ذریعے یہ ربانی تناول حاصل ہوتا، کیونکہ یہ اللہ کے ساتھ وصل کو عام کرتا ہے۔ پس اللہ نے انہیں مال سے آزمایا، پھر ان سے سوال کرنے سے آزمایا، اور ذات حق (الحق) نے اپنے آپ کو اپنے بندوں میں سے حاجت مند سائلوں کے مقام پر اتارا، جو ان میں سے مالدار اور صاحب ثروت ہیں، اپنے اس قول سے\n\nجو اس باب میں پہلے گزری حدیث میں ہے:\n**يا عبدي استطعمتك فلم تطعمني واستسقيتك فلم تسقني**\n(اے میرے بندے! میں نے تجھ سے کھانا مانگا تو نے مجھے نہ کھلایا، اور میں نے تجھ سے پانی مانگا تو نے مجھے نہ پلایا)۔\n\nپس اس نظر کے ذریعے ان کے لیے مال کی محبت ایک فتنہِ ہدایت (فتنة مهداة) بن گئی جو انہیں اس طرح کے مقام کی طرف لے گئی۔\n\nاور جہاں تک اولاد کے فتنہ کا تعلق ہے، تو یہ اس لیے ہے کہ وہ اپنے باپ کا راز، اس کے جگر کا ٹکڑا اور اس سے سب سے زیادہ جڑی ہوئی چیز ہے۔ پس اس کی محبت خود چیز کی محبت ہے، اور چیز کو اپنے نفس سے زیادہ کوئی چیز محبوب نہیں۔ پس اللہ نے اسے اس کے نفس کے ذریعے آزمایا ایک ایسی صورت میں جو اس سے باہر ہے، جسے اس نے بیٹا نام دیا، تاکہ یہ دیکھے کہ کیا اس کی طرف نظر اسے ان حقوق کو قائم کرنے سے روکتی ہے جن کا حق نے اس پر فرض کیا ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے اپنی بیٹی فاطمہ کے حق میں اور ان کے دل میں ان کے مقام کے بارے میں، جو مقام کسی سے پوشیدہ نہیں، فرمایا:\n**لو أن فاطمة بنت محمد سرقت لقطعت يدها**\n(اگر فاطمہ بنت محمد بھی چوری کرتیں تو میں ان کا ہاتھ کاٹ دیتا)۔\n\nاور عمر بن خطاب نے اپنے بیٹے کو زنا کی حد لگائی، تو وہ مر گیا، اور ان کا نفس اس پر مطمئن تھا۔ اور ماعز نے اپنی جان دی، اور عورت نے بھی ان پر حد قائم کرنے میں، جس میں ان کی جانوں کا تلف ہونا تھا، اپنی جان دی۔ اور رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں کی توبہ کے بارے میں فرمایا:\n**وأي توبة أعظم من أن جادت بنفسها**\n(اور کون سی توبہ اس سے بڑی ہو سکتی ہے کہ اس نے اپنی جان دے دی)۔\n\nاور ناپسندیدہ حق کو قائم کرنے میں سخاوت کرنا۔",
    "fa": "(باب پانصد و شصتم در وصیتی حکمی که سالک مرید و واصل و هر کس که بر آن آگاه شود، به اذن خداوند متعال، از آن بهره می‌برد)\n\nخداوند وصیت کرد و رسولانش وصیت کردند، از این رو\nپیروی از ایشان از بهترین اعمال است.\n\nاگر وصیت نبود، خلق در کوری و سرگشتگی بودند\nو با وصیت، مُلک در میان دولت‌ها جریان یافت.\n\nپس بر آن عمل کن و راه و روش آن را مهمل مگذار\nهمانا وصیت، حکم خداوند در ازل است.\n\nاقوامی را به آنچه خداوند بدان وصیت کرده بود، یاد کردم\nو در این وصیت، نوآوری‌ای از جانب من نیست.\n\nپس چیزی جز آنچه گفتند یا تشریع کردند، نبود\nاز سلوک به واسطه‌ی ایشان در استوارترین راه‌ها.\n\nپس هدایت احمد (ص) عین تمام دین است\nو آیین مصطفی (ص) از نورانی‌ترین آیین‌هاست.\n\nچشم (بصیرت) کور نشد، بلکه قوت خود را به او داد\nتا آنچه از انحراف در اوست، برپا دارد.\n\nو با سرّ خود از او، از مراکزش، بگیر\nبه سوی بلندی تا ماه بلند و تا زحل.\n\nبه سوی ستارگان ثابت، در ساحت آن‌ها فرود میا\nو برخیز به سوی درجه‌ی بلند از برج حمل.\n\nو از آنجا به قدم کرسی و سپس به\nعرش محیط، به سوی اشکال و مثال‌ها.\n\nبه سوی طبیعت، به سوی نفس پاک، به سوی عقل\nکه مقید به اعراض و علل است.\n\nبه سوی عماء (فضای ابهام الهی) که هیچ نفسی بالاتر از آن نیست\nاز آنجا به سوی منزلی که به ازل وصف شده است.\n\nو بنگر به کوه استوار بر کوه\nکه آن را دید و از جای نجنبید و زایل نشد.\n\nاگر علوّی که در سفل (پستی) است نبود، چهره‌های ما پست نمی‌شد\nکه با دیدگان، طلب دیدن (حق) کند.\n\nبه همین دلیل خداوند سجده را برای ما تشریع کرد\nتا حق (الحق) را در بلندی و پستی شهود (الشهود) کنیم.\n\nاین وصیت ماست اگر صاحب نظر باشی\nزیرا که آن حیله‌ای از بهترین حیله‌هاست.\n\nبا آن هر معلومی را در صورتش می‌بینی\nبر حقیقت آنچه هست، نه بر جایگزینی.\n\nتا آنکه منظر اعلی را ببینی و برای آن\nجز تو مَجلا (محل تجلی) نیست، پس از جای مرو و زایل مشو.\n\nپس اگر تو را به سوی چشمه‌ی نوشیدنی‌اش فراخواند\nاجابتش مکن و از آن بر حذر باش.\n\nما زنانیم، زیرا آنچه در ماست، او (حق) آن را می‌زاید\nپس خدا را سپاس گوییم که در هستی (الوجود) هیچ مردی نیست.\n\nهمانا مردانی که عرفان (المعرفة) عین آن‌هاست\nخود زنانند و آن‌ها نفس من و آرزوی من هستند.\n\nوصیتی که خداوند متعال در وصیت عمومی فرموده است: «شَرَعَ لَكُمْ من الدِّينِ ما وَصَّى به نُوحاً والَّذِي أَوْحَيْنا إِلَيْكَ وما وَصَّيْنا به إِبْراهِيمَ ومُوسى‏ وعِيسى‏ أَنْ أَقِيمُوا الدِّينَ ولا تَتَفَرَّقُوا فِيهِ» (از دین، آنچه را که به نوح وصیت کرده بود، برای شما تشریع کرد و آنچه را که به تو وحی کردیم و آنچه را که به ابراهیم و موسی و عیسی وصیت کردیم، این بود که دین را برپا دارید و در آن تفرقه نکنید). پس حق (الحق) به برپاداشتن دین امر فرمود، و آن شریعت زمان در هر عصر و آیینی است، و اینکه بر آن اجتماع کنند و در آن تفرقه نکنند.\n\nزیرا «دست خدا با جماعت است» و گرگ تنها گوسفند دورافتاده را می‌خورد، و آن همان دورافتاده‌ای است که از آنچه جماعت بر آن است، رمیده و جدا شده است. و حکمت این امر آن است که خداوند جز از حیث اسماء الحسنی (نام‌های نیکویش) به عنوان معبود درک نمی‌شود، نه از حیثی که از این اسماء الحسنی عاری باشد. پس ناگزیر است که عین او توحید (یکتایی) شود و نام‌هایش کثرت یابد، و با این مجموع، او معبود است. پس دست خدا که همان قوت است، با جماعت است. حکیمی هنگام مرگ به فرزندانش که جماعتی بودند، وصیت کرد و به آن‌ها گفت: برایم چوب‌هایی بیاورید. آن‌ها را جمع کرد و گفت: در حالی که جمع هستند، آن‌ها را بشکنید. نتوانستند. سپس آن‌ها را جدا کرد و گفت: یکی یکی بردارید و بشکنید. شکستند. پس به آن‌ها گفت: شما نیز پس از من چنین خواهید بود؛ تا زمانی که متحد باشید، مغلوب نخواهید شد، اما اگر متفرق شوید، دشمنتان بر شما مسلط شده و شما را نابود خواهد کرد. و همچنین کسانی که به دین قیام می‌کنند، اگر بر برپاداشتن دین اجتماع کنند و در آن تفرقه نکنند، دشمنی بر آن‌ها چیره نخواهد شد. و همچنین انسان در نفس خود، اگر در درون خود بر اقامه‌ی دین خدا اجتماع کند، هیچ شیطانی از انس و جن با وسوسه‌هایش بر او غلبه نخواهد کرد، به همراه یاری ایمان و فرشته‌ای که او را همراهی می‌کند.\n\nوصیتی دیگر: اگر در مکانی خداوند متعال را معصیت کردی، از آن مکان دور مشو تا زمانی که در آن طاعتی انجام دهی و عبادتی برپا داری. پس همان‌گونه که اگر شهادت بخواهد، علیه تو شهادت می‌دهد، برای تو نیز شهادت خواهد داد. آنگاه از آنجا دور شو. و همچنین لباست، اگر در آن خدا را معصیت کردی، همان‌گونه باش که برایت ذکر کردم؛ در آن خدا را عبادت کن. و همچنین آنچه از تو جدا می‌شود، مانند کوتاه کردن سبیل، تراشیدن موی زهار، گرفتن ناخن، شانه کردن مو و پاک کردن چرک، هیچ‌یک از این‌ها از بدنت جدا نشود مگر آنکه بر طهارت و ذکر خداوند عز و جل باشی، زیرا از تو سؤال می‌شود که چگونه تو را ترک کرده است. و کمترین عبادتی که در کنار همه‌ی این‌ها می‌توانی انجام دهی، این است که از خداوند بخواهی که به امر او بر تو توبه کند، تا در امتثال امر خداوند، واجبی را ادا کرده باشی، و آن فرموده‌ی اوست: «وقالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ» (و پروردگارتان فرمود: مرا بخوانید تا شما را اجابت کنم). پس به تو امر کرد که او را بخوانی، سپس در همین آیه فرمود: «إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبادَتِي» (همانا کسانی که از عبادت من تکبر می‌ورزند). منظور از عبادت در اینجا دعا است، یعنی کسی که از خواری و مسکنت در برابر من تکبر ورزد، زیرا دعا را عبادت نامیده است و عبادت همان خواری، خضوع و مسکنت است. «سَيَدْخُلُونَ جَهَنَّمَ داخِرِينَ» (به زودی با خواری وارد جهنم خواهند شد)، یعنی با ذلت. پس اگر آنچه را که به آن امر شده‌اند انجام دهند، خداوند پاداش آن‌ها را با ورود به بهشت در حالی که عزیز هستند، خواهد داد. روزی برای غسل به حمام رفتم که سحرگاه بر من عارض شد. در آنجا نجم‌الدین ابوالمعالی ابن اللهیب را دیدم که از دوستانم بود. او سلمانی را خواست تا سرش را بتراشد. بر او فریاد زدم: ای اباالمعالی! او بی‌درنگ، پیش از آنکه من سخنی بگویم، گفت: من بر طهارت هستم، منظورت را فهمیدم. من از حضور ذهن و سرعت فهم او و رعایت مکان و قرائن احوال و آنچه از من می‌دانست، در شگفت شدم. به او گفتم: خداوند به تو برکت دهد. به خدا سوگند، بر تو فریاد نزدم مگر برای اینکه هنگام جدا شدن مویت بر طهارت و ذکر باشی. پس او برایم دعا کرد و سپس سرش را تراشید. و مردم از چنین امری غفلت کرده‌اند، بلکه می‌گویند: اگر در مکانی خدا را معصیت کردی، از آنجا دور شو، زیرا می‌ترسند که آن مکان معصیت را به یادت آورد و آن را شیرین یابی و گناهی بر گناه بیفزایی. آن‌ها این را نگفتند مگر از روی شفقت، اما علم بزرگی از دستشان رفته است. پس در آن مکان خدا را اطاعت کن و آنگاه از آنجا دور شو، تا میان آنچه آن‌ها گفتند و آنچه من به تو وصیت کردم، جمع کنی. و هرگاه خطایی را که مرتکب شده‌ای به یاد آوردی، بلافاصله پس از یادآوری، از آن توبه کن و از خداوند برای آن آمرزش بخواه و در آن هنگام، خداوند را به اندازه‌ی آن معصیت ذکر کن.\n\nزیرا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «پشت سر گناه، کار نیک انجام بده تا آن را محو کند.» و خداوند متعال می‌فرماید: «إِنَّ الْحَسَناتِ يُذْهِبْنَ السَّيِّئاتِ» (همانا نیکی‌ها، بدی‌ها را از بین می‌برند). اما باید در این زمینه میزانی داشته باشی که با آن تناسب گناهان و نیکی‌هایی را که وزن می‌کنی، بشناسی.\n\nوصیتی دیگر: در هر حال نسبت به پروردگارت حسن ظن داشته باش (حسن الظن) و به او سوء ظن مبر، زیرا نمی‌دانی آیا در هر نفسی که از تو خارج می‌شود، بر آخرین نفس‌هایت هستی یا نه، پس بمیری و خدا را با حسن ظن ملاقات کنی، نه با سوء ظن. زیرا نمی‌دانی، شاید خداوند تو را در همان نفسی که به سوی او خارج می‌شود، قبض روح کند و تو بر سوء ظن به پروردگارت باشی و او را بر آن حال ملاقات کنی. و آنچه را که برخی گفته‌اند که در زندگی‌ات سوء ظن داشته باش و هنگام مرگ حسن ظن، رها کن. این نزد علمای بالله (آگاهان به خدا) ناشناخته است، زیرا آن‌ها با هر نفس خود با خدا هستند. و در این امر، فایده و علم به خداوندی است که تو حق او را به طور کامل ادا کرده‌ای، زیرا از حق خداوند بر تو، ایمان به این فرموده‌ی اوست: «ونُنْشِئَكُمْ في ما لا تَعْلَمُونَ» (و شما را در آنچه نمی‌دانید، ایجاد می‌کنیم). پس شاید خداوند تو را در همان نفسی که گمان می‌کنی می‌آید، به نشأت مرگ و بازگشت به سوی او ایجاد کند، در حالی که بر سوء ظن به پروردگارت هستی و او را بر آن حال ملاقات کنی. و از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در آنچه از پروردگارش روایت کرده، ثابت شده است که او عز و جل می‌فرماید: «من نزد گمان بنده‌ام به خود هستم، پس باید به من گمان نیک برد.» و هیچ زمانی را از زمان دیگر استثنا نکرده است. و گمان خود به خدا را به علم تبدیل کن که او عفو می‌کند، می‌آمرزد و درمی‌گذرد. و باید دعوت‌کننده‌ی الهی تو به این گمان، فرموده‌ی خداوند متعال باشد: «يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ لا تَقْنَطُوا من رَحْمَةِ الله» (ای بندگان من که بر خود اسراف کرده‌اید، از رحمت خدا ناامید نشوید). پس تو را نهی کرده است، و آنچه تو را از آن نهی کرده، بر تو واجب است که از آن بازایستی. سپس خبر داده است و خبر او صدق است و نسخ در آن راه ندارد، زیرا اگر نسخ در آن راه می‌یافت، دروغ می‌بود و دروغ بر خداوند محال است. پس فرمود: «إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً» (همانا خداوند همه‌ی گناهان را می‌آمرزد). و هیچ گناهی را از گناه دیگر استثنا نکرده و آن را با فرموده‌ی «جَمِيعاً» تأکید کرده است. سپس کامل کرد و فرمود: «إِنَّهُ هُوَ» (همانا اوست)، و ضمیری را آورد که به او بازمی‌گردد: «الْغَفُورُ الرَّحِيمُ» (آمرزنده و مهربان)، از آن جهت که رحمتش بر غضبش پیشی گرفته است. و همچنین فرمود: «الَّذِينَ أَسْرَفُوا» (کسانی که اسراف کردند) و اسرافی را از اسرافی معین نکرد، و با اسم ناقصی آمد که هر اسراف‌کننده‌ای را شامل می‌شود. سپس بندگان را به خود اضافه کرد، زیرا آن‌ها بندگان او هستند، چنانکه حق (الحق) از بنده‌ی صالح، عیسی علیه السلام، نقل می‌کند که فرمود: «إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ» (اگر آن‌ها را عذاب کنی، همانا آن‌ها بندگان تو هستند). پس آن‌ها را به خود متعال اضافه کرد، و شرافت انتساب به خداوند متعال، به تنهایی کافی است.\n\nوصیتی دیگر: بر شما باد به ذکر (یاد) خداوند در نهان و آشکار، در درون خود و در جمع. زیرا خداوند می‌فرماید: «فَاذْكُرُونِي أَذْكُرْكُمْ» (مرا یاد کنید تا شما را یاد کنم). پس پاسخ ذکر از سوی بنده را، ذکر از سوی خداوند قرار داد. و چه زیانی برای بنده زیان‌بارتر از گناه است؟ و او (صَلَّى اللهُ عَليهِ وسَلَّم) در حال سختی می‌فرمود: «الحمد لله على كل حال» (سپاس خدا را در هر حال) و در حال آسایش: «الحمد لله المنعم المفضل» (سپاس خدا را که نعمت‌بخش و فضل‌دهنده است). زیرا اگر قلب خود را همواره در هر حالی به ذکر (یاد) خداوند آگاه سازی، ناگزیر قلبت به نور ذکر روشن می‌شود و آن نور، کشف (الکشف) را روزی تو می‌سازد، زیرا کشف اشیاء به واسطه‌ی نور رخ می‌دهد. و هنگامی که کشف (الکشف) آمد، حیا نیز همراه آن می‌آید. دلیل تو بر این امر، حیای تو از همسایه‌ات و از کسی است که برای او حق و منزلتی قائل هستی. و شکی نیست که ایمان، تعظیم حق (الحق) را نزد تو به ارمغان می‌آورد. و سخن ما تنها با مؤمنان است و وصیت ما تنها برای هر مسلمان مؤمنی است که به خدا و آنچه از جانب او آمده، ایمان دارد. و خداوند در حدیث صحیح مأثور از او می‌فرماید: «و من با او هستم»، یعنی با بنده، هنگامی که مرا یاد می‌کند. «اگر مرا در نفس خود یاد کند، او را در نفس خود یاد می‌کنم، و اگر مرا در جمعی یاد کند، او را در جمعی بهتر از آن‌ها یاد می‌کنم.» و خداوند متعال می‌فرماید: «والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ» (و مردان و زنانی که خدا را بسیار یاد می‌کنند). و بزرگترین ذکر، ذکر خداوند در هر حال است.\n\nوصیتی دیگر: بر انجام همه‌ی قربات (اعمال مقرب) به اندازه‌ی توان در هر زمان و حالی که حق (الحق) با زبان آن زمان و زبان آن حال تو را مخاطب قرار می‌دهد، مداومت کن. زیرا اگر مؤمن باشی، هرگز معصیتی برای تو خالص نمی‌شود مگر آنکه طاعتی با آن آمیخته باشد، چرا که تو ایمان داری که آن معصیت است. اگر به این آمیختگی، استغفار یا توبه اضافه کنی، طاعتی بر طاعت و قربی بر قرب افزوده می‌شود و جزء طاعتی که عمل بد با آن آمیخته شده، تقویت می‌گردد. و ایمان از قوی‌ترین و بزرگترین قربات نزد خداوند است، زیرا آن اساسی است که همه‌ی قربات بر آن بنا شده است. و از جمله‌ی ایمان، حکم تو بر خداوند است به آنچه او بر خود حکم کرده است. در حدیث صحیحی که از او تعالی روایت شده و در آن ذکر کرده است: «اگر بنده‌ام یک وجب به من نزدیک شود، من یک ذراع به او نزدیک می‌شوم، و اگر یک ذراع به من نزدیک شود، من یک باع (دو ذراع) به او نزدیک می‌شوم، و اگر با راه رفتن به سوی من آید، من با شتاب (هروله) به سوی او می‌آیم.» و سبب این تضعیف (چند برابر کردن) از جانب خداوند و کمتر بودن و ضعیف‌تر بودن از جانب بنده، این است که بنده ناگزیر است به خاطر نیت قربت به خداوند در عمل، تثبّت (تأمل) کند و مأمور است که اعمال خود را با ترازوی شرع بسنجد. پس ناگزیر است که در آن درنگ کند، و اگرچه سریع باشد و به سرعت وصف شود، سرعت او تنها در برپاداشتن میزان در آن عمل است، نه در خود عمل؛ زیرا با برپاداشتن میزان است که معامله صحیح می‌شود. و قرب خداوند نیازی به میزان ندارد، زیرا میزان حق (الحق) که در دست او نهاده شده، همان میزانی است که تو با آن، عملی را که به واسطه‌ی آن طلب قربت به خداوند می‌کنی، وزن کرده‌ای. پس ناگزیر است که وصف او چنین باشد که در قربش به تو، قوی‌تر و بیشتر از قرب تو به او باشد. پس خود را وصف کرد که در قرب تو به او، دو برابر آنچه تو به او نزدیک شدی، به تو نزدیک می‌شود، به صورت مثال به مثال. زیرا تو بر صورت (الهی) خلق شده‌ای و کمترین خلافت تو، خلافت بر ذات خودت است. پس تو خلیفه‌ی او در زمین بدنت هستی و رعیت تو، جوارح و قوای ظاهری و باطنی تو هستند. پس عین قرب او به تو، قرب تو به اوست به همراه زیادت، و آن همان است که فرمود: ذراع و باع و هروله. و شبر (وجب) تا شبر، ذراع است، و ذراع تا ذراع، باع است، و راه رفتن اگر دو برابر شود، هروله است. پس او در اول است که قرب تو به اوست، و او در آخر است که قرب او به توست. پس «هُوَ الْأَوَّلُ والْآخِرُ» (او اول و آخر است). و این همان قرب مناسب است، زیرا قرب الهی به همه‌ی خلق غیر از این است، و آن فرموده‌ی اوست: «ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ» (و ما از رگ گردن به او نزدیک‌تریم). پس در اینجا آن قرب مورد نظر نیست، بلکه منظور قربی است که جزای قرب بنده به خداوند است. و بنده قربی به خداوند ندارد مگر با ایمان به آنچه از جانب خداوند آمده، پس از ایمان به خداوند و به ابلاغ‌کننده‌ی از جانب خداوند.\n\nنفس خود را ملزم کن که از انجام کار خیر سخن بگوید، حتی اگر آن را انجام ندهی. و هرگاه نفس تو از شری سخن گفت، عزم کن که آن را به خاطر خدا ترک کنی، مگر آنکه تقدیر سابق و قضای لاحق بر تو غلبه کند. زیرا اگر خداوند بر تو قضای انجام آن چیزی را که نفس تو از آن سخن گفته، نکرده باشد، آن را برای تو حسنه می‌نویسد. و از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از پروردگارش عز و جل ثابت شده است که می‌فرماید: «هرگاه بنده‌ام در دل خود سخن از انجام کار نیکی بگوید، من آن را برای او حسنه می‌نویسم، تا زمانی که آن را انجام نداده است.» و کلمه‌ی «ما» در اینجا ظرفیه است (دلالت بر زمان دارد). پس هر زمانی که بر او می‌گذرد در حالی که از انجام این حسنه سخن می‌گوید، حتی اگر آن را انجام ندهد، خداوند آن را برای او یک حسنه می‌نویسد در هر زمانی که سخن گفتن از آن همراه اوست، هر چقدر هم که تعداد آن زمان‌ها زیاد باشد. پس برای او در هر زمان سخن گفتن، یک حسنه است. و به همین دلیل فرمود: «تا زمانی که آن را انجام نداده است.» سپس خداوند متعال فرمود: «فإذا عملها فأنا أكتبها له بعشر أمثالها» (پس اگر آن را انجام دهد، من آن را برای او ده برابر می‌نویسم). و از اینجا ده برابر شدن در آنچه آسمان آبیاری کرده، واجب شده است، اگر بدانی. و اگر از نیکی‌های متعدی باشد که بقا دارد، پاداش آن تا روز قیامت، مادامی که باقی است، تجدید می‌شود، مانند صدقه‌ی جاریه، وقف‌ها، و علمی که در میان مردم منتشر می‌کند، و سنت نیکو و امثال آن. سپس نعمت‌های خود را بر بندگانش کامل کرد و خداوند متعال فرمود: «وإذا تحدث بأن يعمل سيئة فأنا أغفرها له ما لم يعملها» (و اگر در دل خود سخن از انجام کار بدی بگوید، من او را می‌آمرزم، تا زمانی که آن را انجام نداده است). و «ما» در اینجا ظرفیه است، همانند آنچه در حسنه بود، و حکم آن مانند حکم در سخن گفتن و پاداش است، هر چقدر هم که طول بکشد. سپس فرمود: «فإذا عملها فأنا أكتبها له بمثلها» (پس اگر آن را انجام دهد، من آن را برای او به اندازه‌ی خودش می‌نویسم). پس عدل را در گناه و فضل را در نیکی قرار داد، و آن فرموده‌ی اوست: «لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ» (برای کسانی که نیکی کردند، نیکی و زیادت است)، و زیادت همان فضل است که بر مثل (برابر) افزوده می‌شود. سپس خداوند متعال خبر داد که فرشتگان به حکم اصلی که بر آن‌ها حاکم است و آن‌ها را در حق پدرمان آدم به سخن آورد، می‌گویند: «أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ» (آیا در آن کسی را قرار می‌دهی که در آن فساد کند و خون‌ها بریزد؟). پس آن‌ها جز بدی‌های ما را ذکر نکردند و متعرض نیکی‌های آن نشدند. زیرا بر ملأ اعلی، غیرت بر ساحت خداوند غلبه دارد که مبادا مورد اهانت قرار گیرد. و آن‌ها از این نشأت عنصری دانستند که ناگزیر است با پروردگارش مخالفت کند، به دلیل حقیقتی که بر آن است، و این نزد آن‌ها با ذوق از ذات خودشان است، و تنها در نشأت ما آشکارتر است. و اگر فرشتگان در نشأت خود بر صورت نشأت ما نبودند، خداوند از آن‌ها ذکر نمی‌کرد که «يَخْتَصِمُونَ» (با هم خصومت می‌کنند)، و خصومت جز با اضداد (مخالفان) رخ نمی‌دهد. و خداوند از فرشتگان در حق ما ذکر نکرد که می‌گویند: «آن بنده‌ی توست که می‌خواهد کار نیکی انجام دهد.» پس بنگر که این اصل برای کسی که نظر کند، چقدر محکم است. و از اینجا فضیلت انسان را می‌فهمی، هنگامی که خیری را در کسی ذکر کند و از شر او سکوت نماید، درجه‌ی او در مقایسه با قصد نیکوی فرشتگان در آنچه ذکر کردند، کجاست. اما تو را بر آنچه لازم بود آگاه کردم تا نشأت آن‌ها و آنچه بر آن سرشته شده‌اند را بشناسی. پس «كُلٌّ يَعْمَلُ عَلى‏ شاكِلَتِهِ» (هر کس بر اساس ساختار خود عمل می‌کند)، چنانکه خداوند متعال فرمود و خبر داد که فرشتگان می‌گویند: «آن بنده‌ی تو فلان است که می‌خواهد کار بدی انجام دهد»، و او (خداوند) به او بیناتر است، پس فرمود: «مراقب او باشید، اگر آن را انجام داد، به اندازه‌ی خودش برایش بنویسید، و اگر آن را ترک کرد، برایش حسنه بنویسید، زیرا او آن را به خاطر من ترک کرده است.» یعنی به خاطر من. پس فرشتگانی که در اینجا ذکر شدند، همان‌هایی هستند که خداوند درباره‌ی آن‌ها به ما فرمود: «إِنَّ عَلَيْكُمْ لَحافِظِينَ كِراماً كاتِبِينَ» (همانا بر شما نگهبانانی هستند، بزرگوار و نویسنده). پس مرتبه و ولایت به آن‌ها اجازه داد که آنچه را گفتند، بگویند. پس آن‌ها نوشتن نیکی را بدون آگاهی از آنچه خداوند پیشتر به آن‌ها در این باره فرموده، دارند، و درباره‌ی بدی سخن می‌گویند به دلیل آنچه از فضل و گذشت خداوند می‌دانند. و اگر آن‌ها در این باره سخن نمی‌گفتند، ما نمی‌دانستیم که حکم آن نزد خداوند چیست، مانند آنچه در مجالس ذکر درباره‌ی شخصی می‌گویند که برای حاجتی به آنجا می‌آید، نه به خاطر ذکر. پس خداوند مغفرت را برای همه جاری کرد و فرمود: «آن‌ها قومی هستند که همنشینشان بدبخت نمی‌شود.» پس اگر سؤال آن‌ها و معرفی آن‌ها نبود، ما حکم خداوند را درباره‌ی آن‌ها نمی‌دانستیم. بنابراین، سخن آن‌ها (فرشتگان) تعلیم و رحمت است، اگرچه ظاهر آن، همان‌گونه که به اذهان قاصر می‌رسد، با اصلی که تو را بر آن آگاه کردیم، متفاوت باشد. و خداوند درباره‌ی نیکی و بدی فرموده است: «من جاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثالِها» (هر کس کار نیکی بیاورد، برای او ده برابر آن است) و بیشتر. «ومن جاءَ بِالسَّيِّئَةِ فَلا يُجْزى‏ إِلَّا مِثْلَها» (و هر کس کار بدی بیاورد، جز به اندازه‌ی آن مجازات نمی‌شود) و پس از مجازات برای قومی و پیش از مجازات برای قومی دیگر می‌آمرزم. پس ناگزیر است که هر اسراف‌کننده‌ای بر نفس خود، آمرزیده شود، حتی اگر توبه نکند. پس هر کس که به این وصیت تحقق یابد، نسبت میان نشأت انسانی و ملکی (فرشتگی) را می‌شناسد و می‌داند که اصل یکی است، همان‌گونه که پروردگار ما یکی است و نام‌های متقابل دارد، پس هستی (الوجود) بر صورت اسماء بود.\n\n(وصیتی دیگر): بر کلمه‌ی اسلام، یعنی گفتار تو «لا إله إلا الله» (هیچ معبودی جز الله نیست)، مداومت کن، زیرا آن بهترین اذکار است به دلیل افزایش علمی که در بر دارد. و او (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «أفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله» (بهترین چیزی که من و پیامبران پیش از من گفتیم، لا إله إلا الله است). پس این کلمه‌ای است که نفی و اثبات را جمع کرده و تقسیم آن منحصر است. و آنچه این کلمه در بر دارد را نمی‌شناسد مگر کسی که وزن آن و آنچه را که می‌سنجد، بشناسد، چنانکه در حدیثی که در دلالت بر آن ذکر می‌کنیم، آمده است. پس بدان که آن کلمه‌ی توحید است، و توحید (یکتایی) را چیزی همانند نیست، زیرا اگر چیزی همانند آن بود، واحد نبود یا دو یا بیشتر می‌شد. پس چیزی نیست که آن را بسنجد، زیرا آن را جز معادل و مماثل نمی‌سنجد، و مماثل و معادلی وجود ندارد. پس این همان مانعی است که «لا إله إلا الله» را از ورود به میزان (ترازو) بازداشت. زیرا عامه‌ی علما بر این باورند که شرک که در مقابل توحید است، وجود گفتار آن از بنده، با وجود توحید صحیح نیست. پس انسان یا مشرک است یا موحد. بنابراین، توحید را جز شرک نمی‌سنجد، و این دو در یک میزان جمع نمی‌شوند. و نزد ما، به دلیل آنچه در حدیث آمده، وارد میزان نشد، برای کسی که آن را بفهمد و اعتبار کند. و آن حدیث صحیحی از خداوند است که می‌فرماید: «لو أن السموات السبع وعامرهن غيري والأرضين السبع وعامرهن غيري في كفة ولا إله إلا الله في كفة مالت بهن لا إله إلا الله» (اگر آسمان‌های هفت‌گانه و آبادکنندگان آن‌ها غیر از من، و زمین‌های هفت‌گانه و آبادکنندگان آن‌ها غیر از من، در یک کفه باشند و لا إله إلا الله در کفه‌ی دیگر، لا إله إلا الله بر آن‌ها سنگینی خواهد کرد). پس جز آسمان‌ها و زمین را ذکر نکرد، زیرا میزان (ترازو) جایی ندارد مگر زیر مقعر فلک کواکب ثابت، از سدرة المنتهی که اعمال بندگان به آنجا ختم می‌شود. و میزان برای همین اعمال وضع شده است، پس میزان از موضعی که اعمال از آن فراتر نمی‌روند، فراتر نمی‌رود. سپس فرمود: «و آبادکنندگان آن‌ها غیر از من.» و حال آنکه آبادکننده‌ای جز خداوند برای آن‌ها نیست. پس برای آگاه، اشاره کافی است. و در زبان عموم علمای رسوم (ظاهر)، منظور از «غیر»، شریکی است که مشرک آن را اثبات کرده است. اگر برای او در خلق، مشارکتی بود، «لا إله إلا الله» در میزان بر آن سنگینی می‌کرد، زیرا «لا إله إلا الله» در هر حال قوی‌تر است، به دلیل اینکه مشرک، جانب خداوند متعال را بر جانبی که به او شرک ورزیده، ترجیح می‌دهد. پس درباره‌ی آن‌ها فرمود که گفتند: «ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏» (ما آن‌ها را عبادت نمی‌کنیم مگر برای اینکه ما را به خداوند نزدیک گردانند). پس اگر میزان هستی (الوجود) برپا شود، نه میزان توحید، «لا إله إلا الله» در آن وارد می‌شود. و ممکن است در میزان توحید عظمت که توحید مشرکان است، وارد شود و «لا إله إلا الله» آن را بسنجد و بر آن سنگینی کند. زیرا اگر آبادکننده غیر از خدا نباشد، سنگینی نمی‌کند. و عین آنچه ذکر کرده، تنها خداوند است. گفت: کجا سنگینی کند، در حالی که در دو کفه جز یکی نیست؟ و اما صاحب سجلات (نامه‌های اعمال)، کفه تنها با آن کارت (بطاقه) سنگینی کرد، زیرا آن همان چیزی بود که میزان آن را در بر گرفت، از آن جهت که گوینده‌ی «لا إله إلا الله» آن را بر زبان آورد و فرشته آن را نوشت. پس آن، «لا إله إلا الله» مکتوب و مخلوق در نطق است. و اگر برای هر کسی گذاشته می‌شد، هیچ‌کس از کسانی که توحید را بر زبان آورده‌اند، وارد آتش نمی‌شد. و خداوند تنها خواست که اهل موقف (محشر) فضیلت آن را در مورد صاحب سجلات ببینند. و آن دیده نمی‌شود و گذاشته نمی‌شود مگر پس از ورود هر موحدی که خداوند بخواهد به آتش. پس هنگامی که هیچ موحدی در موقف باقی نماند که خداوند بر او قضا کرده باشد که وارد آتش شود و سپس با شفاعت یا عنایت الهی خارج گردد، در آن هنگام صاحب سجلات آورده می‌شود، و در موقف جز کسی که وارد بهشت می‌شود و بهره‌ای در آتش ندارد، باقی نمانده است. و او آخرین کسی است که اعمالش از میان خلق وزن می‌شود، زیرا «لا إله إلا الله» آغاز و انجام دارد، و ممکن است عین آغاز آن، انجام آن باشد، مانند صاحب سجلات.\n\n### [همانا خداوند در عموم، بهترین و پرمنفعت‌ترین چیزها را قرار داده است]\n\nسپس بدان که خداوند در عموم جز بهترین چیزها و پرمنفعت‌ترین و سنگین‌ترین آن‌ها را قرار نداده است، زیرا با آن با اضداد بسیاری مقابله می‌کند. پس ناگزیر است که در آنچه در عموم قرار داده شده، از قوّتی باشد که با هر ضدی مقابله کند. و هر عارفی از اهل الله به این نکته پی نمی‌برد، مگر پیامبرانی که برای مردم آنچه را تشریع کردند، تشریع نمودند. و شکی نیست که او (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «أفضل ما قلته أنا والنبيون من قبلي لا إله إلا الله» (بهترین چیزی که من و پیامبران پیش از من گفتیم، لا إله إلا الله است). و او (صَلَّى اللهُ عَليهِ وسَلَّم) آنچه را که مدعیان ذکر خاص با کلمه‌ی «الله الله» و «هو هو» به فضیلت آن اشاره کردند، فرمود. و شکی نیست که آن (لا إله إلا الله) از جمله‌ی اقوالی است که نزد علمای بالله (آگاهان به خدا)، از آن‌ها بهتر است. پس ای ولی، بر تو باد به ذکر (یاد) ثابتی که در عموم است، زیرا آن قوی‌ترین ذکر است و نورانی‌ترین نور و جایگاه قرب (زلفی) از آن اوست. و کسی به این امر پی نمی‌برد مگر کسی که آن را ملازمت کند و بدان عمل نماید تا آن را محکم سازد. زیرا خداوند رحمت خود را گسترش نداد مگر برای شمول و رسیدن به آرزو. و هیچ‌کس نیست مگر آنکه طالب نجات است، حتی اگر راه آن را نداند. پس هر کس که با «لا إله» عین خود را نفی کند، با «إلا الله» هستی (کون) خود را اثبات کرده است. پس عین تو از نظر حکم نفی می‌شود نه از نظر علم، و هستی حق (الحق) را از نظر حکم و علم واجب می‌سازی. و معبود کسی است که همه‌ی اسماء از آن اوست و این اسماء جز برای یک عین نیست، و آن مسمای «الله» است، آبادکننده‌ی آسمان‌ها و زمین که میزان بالا بردن و پایین آوردن در دست اوست. پس بر تو باد به ملازمت این ذکری که خداوند سعادت را به آن و به علم به آن پیوند داده و آن را فراگیر ساخته است.\n\nو بر حذر باش از دشمنی با اهل «لا إله إلا الله»، زیرا برای آن‌ها از جانب خداوند ولایت عامه است. پس آن‌ها اولیاء (دوستان) خدا هستند، حتی اگر خطا کنند و با گناهانی به اندازه‌ی زمین بیایند، در حالی که به خدا شرک نورزیده‌اند، خداوند با همان مقدار، مغفرت را به استقبال آن‌ها می‌آورد. و هر کس ولایتش ثابت شد، جنگیدن با او حرام است. و هر کس با خدا بجنگد، خداوند جزای او را در دنیا و آخرت ذکر کرده است. و هر کس که خداوند تو را بر دشمنی او با خدا آگاه نکرده است، او را دشمن مگیر. و کمترین حالت تو هنگامی که او را نشناسی، این است که امر او را رها کنی. پس اگر یقین یافتی که او دشمن خداست، و او جز مشرک نیست، از او بیزاری جوی، چنانکه ابراهیم خلیل علیه السلام در حق پدرش آزر انجام داد. خداوند عز و جل فرمود: «فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ» (پس هنگامی که برای او آشکار شد که او دشمن خداست، از او بیزاری جست). این میزان توست. خداوند متعال می‌فرماید: «لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ» (قومی را که به خدا و روز آخرت ایمان دارند، نمی‌یابی که با کسانی که با خدا و رسولش دشمنی کرده‌اند، دوستی کنند، حتی اگر پدرانشان یا پسرانشان یا برادرانشان یا خویشاوندانشان باشند)، چنانکه ابراهیم خلیل انجام داد. و هرگاه این را ندانی، با بندگان خدا نه در عمل و نه با آنچه بر زبان آشکار می‌شود، دشمنی مکن. و آنچه شایسته‌ی توست، این است که فعل او را ناپسند بداری، نه عین او را. و دشمن خدا کسی است که عین او را ناپسند می‌داری. پس فرق بگذار میان کسی که عین او را ناپسند می‌داری (که دشمن خداست) و کسی که فعل او را ناپسند می‌داری (که مؤمن است یا کسی که عاقبتش را نمی‌دانی و در حال حاضر مسلمان نیست). و از فرموده‌ی خداوند متعال در حدیث صحیح بر حذر باش: «من عادى لي وليا فقد آذنته بالحرب» (هر کس با ولیّ من دشمنی کند، من به او اعلام جنگ کرده‌ام). زیرا اگر امر کسی را نداند و با او دشمنی کند، حق حق (الحق) را در خلقش ادا نکرده است، چرا که علم خداوند درباره‌ی او را نمی‌داند و خداوند چیزی را برای او آشکار نکرده است تا از او بیزاری جوید و او را دشمن بگیرد. و اگر حال ظاهر او را بدانی، حتی اگر در واقع دشمن خدا باشد و تو ندانی، به خاطر برپاداشتن حق خداوند با او دوستی کن و با او دشمنی مکن، زیرا اسم الهی ظاهر نزد خداوند با تو مخاصمه خواهد کرد. پس برای خداوند حجتی بر خود قرار مده که هلاک شوی. زیرا «فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ» (پس حجت رسا از آن خداست). پس با بندگان خدا با شفقت و رحمت رفتار کن، همان‌گونه که خداوند با وجود علم به کفر و شرک آن‌ها، به ایشان روزی می‌دهد. و به آن‌ها روزی نداد مگر به دلیل علمش به اینکه آنچه در آن هستند، به واسطه‌ی خودشان نیست، بلکه آن‌ها در آن هستند به واسطه‌ی خودشان، به دلیل آنچه با زبان عموم ذکر کردیم، زیرا خداوند «خالِقُ كُلِّ شَيْ‏ءٍ» (آفریننده‌ی هر چیز) است و کفر و شرک آن‌ها در آن‌ها آفریده شده است. و با زبان خصوص (اهل عرفان)، هیچ حکمی در موجودی ظاهر نشد مگر به آنچه در حال عدم در ثبوتش بوده که خداوند آن را از او می‌دانسته است. پس «فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ» (حجت رسا از آن خداست) بر هر کسی، هرگاه نزاع و محاجه‌ای رخ دهد، پس امر را به او تسلیم کن. و بدان که تو بر همان حالتی هستی که بودی. و رحمت و شفقت خود را شامل همه‌ی حیوانات و مخلوقات کن. و مگو که این گیاه و جماد است و خبری ندارند. خیر، آن‌ها خبرهایی دارند که تو از آن بی‌خبری. پس هستی (الوجود) را بر آنچه هست رها کن و به رحمتی که در وجودش موجود است، بر او رحم کن. و به آن از حیث آنچه در زمان حاضر در آن برپا می‌شود، نگاه مکن، «حَتَّى يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُوا وتَعْلَمَ الْكاذِبِينَ» (تا کسانی که راست گفتند برای تو آشکار شوند و دروغگویان را بشناسی). در آن هنگام بر تو واجب می‌شود که آن‌ها را دشمن بگیری، به دلیل امر خداوند به تو در این باره، آنجا که تو را نهی کرده است که دشمن او را دوست بگیری و به او محبت کنی. پس اگر ضعف یقین تو را مجبور به مدارا با آن‌ها کرد، با آن‌ها مدارا کن، اما نه با ابراز محبت، بلکه از روی مسالمت برای دفع شر از خودت. پس امر را به او واگذار کن و در هر حال بر او اعتماد کن تا زمانی که او را ملاقات کنی.\n\nو بر تو باد به ملازمت آنچه خداوند بر تو واجب کرده است، به همان صورتی که به تو امر کرده که در آن قیام کنی. پس هنگامی که نشأت فرائض خود را کامل کردی، و کامل کردن آن بر تو واجب است، آنگاه در فاصله‌ی میان دو فرض، به نوافل (اعمال مستحب) خیرات، هر چه که باشند، بپرداز. و هیچ‌یک از اعمال خود را کوچک مشمار، زیرا خداوند هنگامی که آن را خلق کرد و به وجود آورد، آن را کوچک نشمرد. همانا خداوند تو را به امری مکلف نکرد مگر آنکه به آن امر توجه و عنایت داشته است، تا جایی که تو را به آن مکلف کرد، با وجود اینکه تو در رتبه نزد او بزرگتری. زیرا تو محل وجود آنچه به آن مکلف شده‌ای هستی، چرا که تکلیف تنها به افعال مکلفین تعلق می‌گیرد، پس به مکلف از حیث فعلش تعلق می‌گیرد، نه از حیث عینش.\n\n### [همانا بنده اگر بر ادای فرائض مداومت کند، به واسطه‌ی محبوب‌ترین امور مقرب به خداوند، به او نزدیک شده است]\n\nو بدان که اگر بر ادای فرائض مداومت کنی، به واسطه‌ی محبوب‌ترین امور مقرب به خداوند، به او نزدیک شده‌ای. و اگر صاحب این صفت باشی، گوش حق (الحق) و چشم او خواهی بود، پس جز به واسطه‌ی تو نمی‌شنود و جز به واسطه‌ی تو نمی‌بیند. پس دست حق، دست توست. «إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله يَدُ الله فَوْقَ أَيْدِيهِمْ» (همانا کسانی که با تو بیعت می‌کنند، در حقیقت با خدا بیعت می‌کنند، دست خدا بالای دست‌های آن‌هاست). و دست‌های آن‌ها از آن حیث که دست خداست، بالاتر از دست‌های آن‌هاست از آن حیث که دست‌های خودشان است. زیرا مبایعه اسم فاعل است و فاعل، خداوند است. پس دست‌های آن‌ها دست خداست. پس خداوند متعال با دست‌های آن‌ها بیعت کرد و آن‌ها بیعت‌کنندگان هستند. و همه‌ی اسباب، دست حق (الحق) هستند که قدرت بر ایجاد مسببات دارند. و این همان محبت عظمی است که نص صریحی درباره‌ی آن نیامده، چنانکه در نوافل آمده است. زیرا برای مداومت بر نوافل، محبتی الهی وجود دارد که بر آن تصریح شده است و حق (الحق) گوش و چشم بنده می‌شود، همان‌گونه که در محبت ادای فرائض، امر برعکس بود. پس در فرض، عبودیت اضطرار است که همان عبودیت اصلی است، و در فرع که همان نفل (مستحب) است، عبودیت اختیار است. پس حق (الحق) در آن گوش و چشم توست. و نفل نامیده می‌شود زیرا زائد است، همان‌گونه که تو در اصل در هستی (الوجود) زائد هستی، زیرا خداوند بود و تو نبودی، سپس تو بودی و هستی حادث زیاد شد. پس تو در وجود حق (الحق) نفل هستی. پس ناگزیر به عملی نیاز داری که نفل نامیده شود و آن اصل توست، و ناگزیر به عملی نیاز داری که فرض نامیده شود و آن اصل هستی (الوجود) است که همان وجود حق است. پس در ادای فرض، تو برای او هستی، و در نفل، تو برای خودت هستی. و محبت او به تو از آن حیث که تو برای او هستی، بزرگتر و شدیدتر است از محبت او به تو از آن حیث که تو برای خودت هستی. و در حدیث صحیح از خداوند متعال وارد شده است: «بنده به چیزی محبوب‌تر نزد من از آنچه بر او واجب کرده‌ام، به من نزدیک نشده است. و بنده پیوسته با نوافل به من نزدیک می‌شود تا آنکه او را دوست بدارم. پس گوش او می‌شوم که با آن می‌شنود، و چشم او که با آن می‌بیند، و دست او که با آن می‌گیرد، و پای او که با آن راه می‌رود. و اگر از من درخواست کند، به او عطا می‌کنم، و اگر به من پناه جوید، او را پناه می‌دهم. و در هیچ کاری که فاعل آن هستم، تردید نکرده‌ام، مانند تردیدم در مورد جان بنده‌ی مؤمنم که مرگ را ناخوش می‌دارد و من ناخوشایند بودن او را ناخوش می‌دارم.» پس بنگر به آنچه محبت خداوند به بار می‌آورد. پس بر ادای آنچه وجود این محبت الهی با آن صحیح می‌شود، مداومت کن. و نفل صحیح نیست مگر پس از کامل کردن فرض. و در خود نفل نیز فرائض و نوافلی وجود دارد، پس با فرائضی که در آن است، فرائض کامل می‌شوند. در حدیث صحیح وارد شده است که او تعالی می‌فرماید: «به نماز بنده‌ام بنگرید، آیا آن را کامل انجام داده یا ناقص؟ اگر کامل بود، برایش کامل نوشته می‌شود. و اگر چیزی از آن کم بود، می‌فرماید: بنگرید آیا بنده‌ام عمل مستحبی (تطوع) دارد؟ اگر تطوع داشت، خداوند می‌فرماید: فریضه‌ی بنده‌ام را از تطوع او کامل کنید.» سپس اعمال بر این اساس گرفته می‌شود. و نوافل نیستند مگر آنچه در فرائض اصلی دارند. و آنچه در فرض اصلی ندارد، آن ایجاد عبادتی مستقل است که علمای رسوم (ظاهر) آن را بدعت می‌نامند. خداوند متعال فرمود: «ورَهْبانِيَّةً ابْتَدَعُوها» (و رهبانیتی که خود ابداع کردند). و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را سنت حسنه نامید. و کسی که آن را سنت قرار دهد، پاداش آن و پاداش هر کس که تا روز قیامت بدان عمل کند را دارد، بدون آنکه از پاداش آن‌ها چیزی کاسته شود. و چون در قوت نفل نبود که جای فرض را بگیرد، در خود نفل، فرائضی قرار داد تا فرائض با فرائض جبران شوند، مانند نماز نافله به حکم اصل. سپس آن نافله شامل فرائضی از ذکر و رکوع و سجود است، با وجود اینکه در اصل نافله است. و این اقوال و افعال در آن فرائض هستند.\n\nو بر تو باد به رعایت گفتار خود، همان‌گونه که اعمال خود را رعایت می‌کنی، زیرا گفتار تو از جمله‌ی عمل توست. و به همین دلیل برخی از علما گفته‌اند: «هر کس کلام خود را از عمل خود بشمارد، کلامش کم می‌شود.»\n\n### [همانا خداوند نزد زبان هر گوینده‌ای است]\n\nو بدان که خداوند مراقب گفتار بندگانش است و خداوند نزد زبان هر گوینده‌ای است. پس آنچه خداوند تو را از تلفظ آن نهی کرده است، آن را بر زبان میاور، حتی اگر به آن اعتقاد نداشته باشی، زیرا خداوند از تو درباره‌ی آن سؤال خواهد کرد. روایت کرده‌ایم که فرشته آنچه را که بنده انجام می‌دهد، نمی‌نویسد تا زمانی که آن را بر زبان آورد. خداوند متعال می‌فرماید: «ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ» (هیچ سخنی بر زبان نمی‌آورد مگر آنکه نزد او نگهبانی آماده است). منظور فرشته‌ای است که گفتار تو را ثبت می‌کند. خداوند متعال می‌فرماید: «إِنَّ عَلَيْكُمْ لَحافِظِينَ كِراماً كاتِبِينَ يَعْلَمُونَ ما تَفْعَلُونَ» (همانا بر شما نگهبانانی هستند، بزرگوار و نویسنده، که آنچه را انجام می‌دهید می‌دانند). و گفتار تو از افعال توست. به فرموده‌ی خداوند متعال بنگر: «ولا تَقُولُوا لِمَنْ يُقْتَلُ في سَبِيلِ الله أَمْواتٌ» (و به کسانی که در راه خدا کشته می‌شوند، مردگان نگویید). پس تو را از این گفتار نهی کرد، زیرا هر کس چنین سخنی بگوید، خداوند او را تکذیب کرده است، چرا که خداوند درباره‌ی آن‌ها فرموده است که زنده‌اند. آیا به فرموده‌ی خداوند متعال نمی‌نگری آنجا که می‌فرماید: «ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله أَمْواتاً بَلْ أَحْياءٌ عِنْدَ رَبِّهِمْ» (و گمان مبر کسانی که در راه خدا کشته شدند، مردگانند، بلکه زنده‌اند و نزد پروردگارشان روزی می‌خورند). و فرمود: «لا يُحِبُّ الله الْجَهْرَ بِالسُّوءِ من الْقَوْلِ» (خداوند بلند گفتن سخن بد را دوست ندارد). و فرمود: «لا خَيْرَ في كَثِيرٍ من نَجْواهُمْ» (در بسیاری از نجواهای آن‌ها خیری نیست)، و آن همان گفتار است. پس هرگاه سخن گفتی، با میزان آنچه خداوند برای تو تشریع کرده که با آن سخن بگویی، سخن بگو. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) شوخی می‌کرد و جز حق نمی‌گفت. پس بر تو باد به گفتن حقی که خداوند را راضی می‌کند. زیرا هر حقی که گفته شود، خداوند را راضی نمی‌کند. همانا سخن‌چینی (نمیمه) حق است و غیبت حق است، اما خداوند را راضی نمی‌کند. و تو نهی شده‌ای که غیبت کنی یا سخن‌چینی کسی را بکنی. و از جمله‌ی رعایت خداوند نسبت به گفتار، آنچه در صحیح مسلم از خداوند متعال روایت کرده‌ایم، هنگامی که آسمان بارید، عز و جل فرمود: «برخی از بندگان من مؤمن به من و کافر شدند. پس هر کس بگوید: به واسطه‌ی نَوء (ستاره‌ی باران‌زا) فلان و فلان باران بر ما بارید، او کافر به من و مؤمن به ستاره است. و اما کسی که بگوید: به فضل و رحمت خدا بر ما باران بارید، او مؤمن به من و کافر به ستاره است.» پس گفتار گویندگان را رعایت کرد. و ابوهریره می‌گفت: هنگامی که آسمان باران می‌بارید، «به واسطه‌ی نَوء فتح بر ما باران بارید»، سپس این آیه را تلاوت می‌کرد: «ما يَفْتَحِ الله لِلنَّاسِ من رَحْمَةٍ فَلا مُمْسِكَ لَها» (آنچه خداوند از رحمت برای مردم بگشاید، بازدارنده‌ای برای آن نیست). و حتی اگر اعتقاد داشته باشی که خداوند همان کسی است که اسباب را وضع کرده و برپا داشته و عادت را نزد ما جاری کرده است که اشیاء را نزد آن‌ها انجام می‌دهد نه به واسطه‌ی آن‌ها، با این همه، آنچه خداوند تو را از گفتن و تلفظ آن نهی کرده است، مگو. زیرا همان‌گونه که تو را از اموری نهی کرده، تو را از گفتار نیز نهی کرده است، حتی اگر حق باشد. و بنگر که فرموده‌ی خداوند عز و جل چقدر محکم است در فرموده‌اش: «مؤمن به من، کافر به ستاره» و «کافر به من، مؤمن به ستاره». زیرا هرگاه کسی به فضل خدا بگوید، ستاره را پوشانده است، چرا که نام آن را بر زبان نیاورده است. و هر کس به ستاره بگوید، خداوند را پوشانده است، حتی اگر اعتقاد داشته باشد که او فاعل و نازل‌کننده‌ی باران است، اما نام او را بر زبان نیاورده است. پس خداوند متعال لفظ کفر را آورد که همان پوشاندن (ستر) است. پس بر حذر باش از طلب باران با نَوءها که آن را بر زبان آوری، چه رسد به اینکه به آن اعتقاد داشته باشی. زیرا اعتقاد تو، اگر مؤمن باشی، این است که خداوند آن‌ها را به عنوان دلایل عادی قرار داده است، و در هر دلیل عادی، خرق عادت (شکستن قانون) جایز است. پس از فریب‌های عادات بر حذر باش و تو را از حدود خداوند که برایت تعیین کرده، منحرف نسازد، پس از آن‌ها تجاوز مکن، زیرا خداوند آن‌ها را تعیین نکرد مگر آنکه آن‌ها را رعایت کرده است، و این در هر چیزی صادق است. در حدیث صحیح وارد شده است که: «همانا مردی سخنی از خشم خداوند می‌گوید، در حالی که گمان نمی‌کند به آنجا برسد که رسیده است، و به واسطه‌ی آن هفتاد خریف (سال) در آتش سقوط می‌کند. و همانا مردی سخنی از رضوان خداوند می‌گوید، در حالی که گمان نمی‌کند به آنجا برسد که رسیده است، و به واسطه‌ی آن در علیین بالا برده می‌شود.» پس سخن مگو مگر به آنچه خداوند را راضی می‌کند، نه به آنچه خشم خداوند را بر تو می‌آورد. و این برای تو میسر نمی‌شود مگر با شناخت آنچه خداوند در گفتار تو برایت حد گذاشته است. و این بابی است که مردم از آن غفلت کرده‌اند. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «آیا مردم را بر صورت‌هایشان در آتش می‌اندازد مگر دروکرده‌های زبان‌هایشان؟» و حکیم گفت: «هیچ چیز سزاوارتر به زندان از زبان نیست.» و خداوند آن را پشت دو در (لب‌ها و دندان‌ها) قرار داده است، با این حال، فضولی می‌کند و درها را می‌گشاید.\n\nو بر حذر باش از اینکه با دست خود تصویری بسازی که شأن آن داشتن روح باشد، زیرا این امری است که مردم آن را بر خود آسان می‌گیرند، در حالی که «هُوَ عِنْدَ الله عَظِيمٌ» (و آن نزد خداوند بزرگ است). پس تصویرگران (مصوران) سخت‌ترین عذاب را در روز قیامت دارند. به تصویرگر در روز قیامت گفته می‌شود: «آنچه را خلق کردی زنده کن» یا «در آن روح بدم»، در حالی که او دمنده نیست. و در حدیث صحیح از خداوند متعال وارد شده است که فرمود: «ومن أظلم ممن ذهب يخلق خلقا كخلقي فليخلقوا ذرة أو ليخلقوا حبة أو ليخلقوا شعيرة» (و کیست ستمکارتر از کسی که به خلق کردنی مانند خلق من می‌پردازد؟ پس باید یک ذره یا یک دانه یا یک جو بیافرینند). و همانا بنده اگر این مقدار را رعایت کند و آن را به خاطر آنچه از خداوند در این باره وارد شده، ترک کند و با ربوبیت در تصویر هیچ چیز، نه حیوان و نه غیر حیوان، مزاحمت نکند، بر حیات هر صورتی در عالم آگاه می‌شود و همه‌ی آن را حیوان ناطقی می‌بیند که به حمد خداوند تسبیح می‌گوید. و اگر به خود اجازه دهد که تصویر گیاه و آنچه در ظاهر و در نظر بیننده و در عرف، روح ندارد را بسازد، هرگز بر چنین کشفی (الکشف) آگاه نمی‌شود. زیرا در واقع امر، برای هر صورتی از عالم روحی است که خداوند دیدگان ما را از درک حیات آنچه می‌گوییم حیوان نیست، بازداشته است. و در آخرت، این امر به طور عمومی آشکار می‌شود و به همین دلیل آن را «دار الحیوان» (سرای حیات) نامیده است. پس در آن چیزی نمی‌بینی مگر زنده و ناطق، برخلاف حال تو در دنیا. چنانکه در حدیث صحیح روایت شده است که: «سنگریزه در کف رسول خدا (ص) تسبیح گفت.» پس مردم خرق عادت (شکستن قانون) را در تسبیح سنگریزه قرار دادند و خطا کردند. بلکه خرق عادت در شنیدن شنوندگان آن بود، زیرا سنگریزه همواره تسبیح می‌گفته است، چنانکه خداوند خبر داده است، مگر آنکه با تسبیح خاص یا هیئت خاصی در نطق تسبیح گفته باشد که سنگریزه پیش از آن با آن تسبیح نمی‌گفته و بر آن کیفیت نبوده است. در این صورت، خرق عادت در سنگریزه است، نه در گوش شنونده. و آنچه در گوش شنونده است، این است که نطق کسی را شنیده که عادت بر شنیدن آن نبوده است.\n\nو ای برادر من، بر تو باد به عیادت بیماران، زیرا در آن عبرت و یادآوری است. همانا خداوند انسان را از «ضَعْفٍ» (ضعف) آفریده است. پس نگاه کردن به او در عیادتت، تو را بر اصل خودت آگاه می‌سازد تا در طلب قوّتی که خداوند با آن تو را بر طاعتش یاری دهد، به او نیازمند شوی. و اینکه خداوند نزد بنده‌اش است هنگامی که بیمار می‌شود. آیا نمی‌نگری که بیمار جز به خداوند استغاثه نمی‌کند و جز خداوند را ذکر نمی‌گوید؟ پس حق (الحق) پیوسته بر زبان او جاری است و در قلبش پناه بردن به اوست. پس بیمار همواره با خداست، هر بیماری که باشد، حتی اگر به طبابت بپردازد و اسباب معمول برای یافتن شفا را به کار گیرد. با این حال، از خداوند غافل نمی‌شود، و این به دلیل حضور خداوند نزد اوست. و همانا خداوند در روز قیامت می‌فرماید: «یا ابن آدم مرضت فلم تعدني» (ای فرزند آدم، بیمار شدم و مرا عیادت نکردی). می‌گوید: «یا رب كيف أعودك أو أنت رب العالمين» (پروردگارا، چگونه تو را عیادت کنم در حالی که تو پروردگار جهانیانی؟) می‌فرماید: «أ ما علمت أن عبدي فلانا مرض فلم تعده أ ما أنك لو عدته لوجدتني عنده» (آیا ندانستی که بنده‌ام فلان بیمار شد و او را عیادت نکردی؟ آیا اگر او را عیادت می‌کردی، مرا نزد او می‌یافتی؟) (حدیث). و این حدیث صحیح است. پس فرموده‌ی او: «مرا نزد او می‌یافتی»، همان ذکر پروردگار توسط بیمار در نهان و آشکار است. و همچنین اگر یکی از خلق خدا از تو طلب طعام یا طلب آب کرد، به او طعام و آب بده، اگر توانایی آن را داشتی. زیرا اگر برای تو از شرافت و منزلت جز این نبود که این طلب‌کننده‌ی طعام و آب، تو را به منزلت حق (الحق) که بندگانش را طعام می‌دهد و سیراب می‌کند، قرار داده است، کافی بود. و این نظری است که کمتر کسی به آن توجه می‌کند. به سائل بنگر هنگامی که سؤال می‌کند و صدایش را بلند می‌کند و می‌گوید: «تو را به خدا می‌دهم.» خداوند او را در این حال جز به نام خود به سخن نیاورده است. و صدایش را بلند نکرد مگر برای اینکه تو بشنوی تا به او عطا کنی. پس او تو را به نام «الله» نامیده و با بلند کردن صدا به تو پناه آورده، همانند پناه بردنش به خداوند. و کسی که تو را به منزلت سرور خود قرار داده است، شایسته است که او را محروم نکنی و برای عطا کردن آنچه از تو خواسته، بشتابی. زیرا در این حدیثی که اندکی پیش درباره‌ی بیماری بنده آوردیم، خداوند می‌فرماید: «یا ابن آدم استطعمتك فلم تطعمني» (ای فرزند آدم، از تو طعام خواستم و مرا طعام ندادی.) گفت: «یا رب كيف أطعمك وأنت رب العالمين» (پروردگارا، چگونه تو را طعام دهم در حالی که تو پروردگار جهانیانی؟) فرمود: «أ ما علمت إن عبدي فلانا استطعمك فلم تطعمه أ ما لو أطعمته لوجدت ذلك عندي يا ابن آدم استسقيتك فلم تسقني» (آیا ندانستی که بنده‌ام فلان از تو طعام خواست و او را طعام ندادی؟ آیا اگر او را طعام می‌دادی، آن را نزد من می‌یافتی؟ ای فرزند آدم، از تو آب خواستم و مرا آب ندادی.) گفت: «یا رب كيف أسقيك وأنت رب العالمين» (پروردگارا، چگونه تو را آب دهم در حالی که تو پروردگار جهانیانی؟) فرمود: «أ ما علمت إن عبدي فلانا استقاك فلم تسقه أما لو سقيته لوجدت ذلك عندي» (آیا ندانستی که بنده‌ام فلان از تو آب خواست و او را آب ندادی؟ آیا اگر او را آب می‌دادی، آن را نزد من می‌یافتی؟) این حدیث را مسلم از محمد بن حاتم، از بهز، از حماد بن سلمه، از ثابت، از ابی رافع، از ابوهریره روایت کرده است که گفت: رسول خدا (ص) فرمود. پس خداوند در این خبر، خود را به منزلت بنده‌اش قرار داد. پس بنده‌ای که در هر حال با خدا حاضر و ذاکر (یادکننده) خداست، در چنین حالی حق (الحق) را می‌بیند که اوست که از او طعام و آب خواسته است، پس به آنچه حق از او طلب کرده، می‌شتابد. زیرا او نمی‌داند که شاید در روز قیامت به دلیل نیازی که این شخص طلب‌کننده‌ی طعام و آب داشته، در جایگاه او قرار گیرد و خداوند او را بر آن مکافات دهد. و آن همان فرموده‌ی اوست: «آن را نزد من می‌یافتی»، یعنی آن طعام و نوشیدنی را برای تو بالا می‌بردم و پرورش می‌دادم تا روز قیامت بیایی و آن را بهتر و پاکیزه‌تر و بزرگتر از آنچه بود، به تو بازگردانم. پس اگر همت آن را نداشتی که این طلب‌کننده‌ی آب را ببینی که تو را به منزلت کسی که قضاء حاجت در دست اوست، قرار داده است، زیرا خداوند تو را خلیفه‌ی خود قرار داده است، دست کم حاجت این سائل را با نیت تجارت و طلب سود و چند برابر شدن حسنه برآورده کن. پس چگونه خواهد بود اگر بر چنین خبری آگاه شوی و ببینی که خداوند همان کسی است که از تو آنچه را که در آن خلیفه هستی، خواسته است؟ زیرا همه چیز از آن خداست و به تو امر کرده است که از آنچه تو را در آن خلیفه قرار داده، انفاق کنی. پس فرمود: «وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ» (و از آنچه شما را در آن جانشین قرار داده، انفاق کنید). و پاداش آن بزرگ است اگر انفاق کنی. پس سائل را رد مکن، حتی با کلمه‌ای نیکو، و با روی گشاده و شادمان با او ملاقات کن، زیرا تو تنها با خداوند ملاقات می‌کنی. و حسین یا حسن علیه السلام، هنگامی که سائلی از او سؤال می‌کرد، به سرعت به او عطا می‌کرد و می‌گفت: «خوش آمدی به حامل توشه‌ی من به سوی آخرت.» زیرا او را دید که بار را از دوش او برداشته است، پس برای او مانند مرکب بود. زیرا انسان اگر خداوند نعمتی به او عطا کند و دیگری فضل آن را حمل نکند، در روز قیامت در حالی که آن را حمل می‌کند، می‌آید تا از آن سؤال شود. به همین دلیل، حسن می‌گفت: «همانا سائل، حامل توشه‌ی او به سوی آخرت است و زحمت حمل را از او برمی‌دارد.»\n\nو بر حذر باشید از مظالم بندگان، زیرا ظلم، تاریکی‌هایی در روز قیامت است. و ظلم به بندگان این است که حقوق آن‌ها را که خداوند ادای آن را بر تو واجب کرده است، از آن‌ها بازداری. و گاهی این ظلم به واسطه‌ی حال (نیاز) است، در آنچه از اضطرار بر او می‌بینی، در حالی که تو قادر و واجد هستی که نیاز او را برطرف کنی و ضرورتش را دفع نمایی. پس بر تو واجب است که بدانی او به واسطه‌ی حالش، حقی در مال تو دارد، زیرا خداوند تو را بر او آگاه نساخت مگر برای اینکه حق او را به او بپردازی، وگرنه تو مسئول هستی.\n\n### [همانا خداوند از بنده می‌خواهد که او را با کلمه‌ای نیکو نزد کسی که می‌دانی نیاز او را برطرف می‌کند، یاری رساند]\n\nپس اگر توانایی نداشتی که نیاز او را برطرف کنی، بدان که خداوند تو را بیهوده بر حال او آگاه نساخته است. پس بدان که او از تو می‌خواهد که او را با کلمه‌ای نیکو نزد کسی که می‌دانی نیاز او را برطرف می‌کند، یاری رسانی. اگر این کار را نکردی، دست کم دعایی برای او بکن. و این کار انجام نمی‌شود مگر پس از بذل نهایت تلاش و ناامیدی، تا جایی که نزد تو جز دعا باقی نماند. و هرگاه از این مقدار غفلت کنی، تو از جمله‌ی کسانی هستی که به صاحب این حال ظلم کرده‌اند. این همه در صورتی است که آن نیازمند از آن نیاز بمیرد. اما اگر نمیرد و دیگری از مؤمنان نیاز او را برطرف کند، برادر تو این مطالبه را از تو ساقط کرده است، در حالی که خود نمی‌داند. زیرا مؤمن برادر مؤمن است و او را تسلیم نمی‌کند، حتی اگر عطا کننده چنین نیتی نداشته باشد، اما در واقع امر چنین است و خداوند نیز آن را چنین می‌پذیرد. پس اگر تو به سائل نیازمند، ضرورتش را عطا کردی، در آن نیت کن که از جانب برادر مؤمن اولی که او را محروم کرد، نیابت کنی، و آن را از جانب او ایثار برای جناب تو قرار دهی، به واسطه‌ی آن خیری که به خاطر تو باقی گذاشت تا تو به آن برسی. زیرا اگر او عطا می‌کرد، سائل به آنچه به او داده شده بود، قانع می‌شد و تو آن خیر را نمی‌یافتی. پس با این نیت، عطای عارفان صاحبان ضروریات است که با احوال و اقوال خود سؤال می‌کنند. و «وأَمَّا السَّائِلَ فَلا تَنْهَرْ» (و اما سائل را از خود مران). و فرقی نمی‌کند که این در قوت محسوس باشد یا معنوی. زیرا علم و افاده (فایده رساندن) از این باب است. همانا گمراه، هدایت می‌طلبد، و گرسنه، طعام می‌طلبد، و برهنه، لباسی می‌طلبد که او را از سرمای هوا و گرمای آن حفظ کند و عورتش را بپوشاند، و گناهکاری که می‌داند تو بر مؤاخذه‌ی او قادری، از تو عفو از گناهش را می‌طلبد. پس همسایگان را هدایت کن، و گرسنه را طعام ده، و تشنه را آب ده، و برهنه را بپوشان. و بدان که تو نسبت به آنچه در آن به تو نیازمند می‌شوند، فقیر هستی، و خداوند «غَنِيٌّ عَنِ الْعالَمِينَ» (بی‌نیاز از جهانیان) است. با این حال، دعای آن‌ها را اجابت می‌کند و حوائجشان را برآورده می‌سازد و از آن‌ها می‌خواهد که از او بخواهند تا ضررها را از آن‌ها دفع کند و منافع را به آن‌ها برساند. پس تو سزاوارتری که با بندگان خدا چنین رفتار کنی، به دلیل نیازت به خداوند در این امور. مسلم در صحیح خود از عبدالله بن عبدالرحمن بن بهرام دارمی، از مروان بن محمد دمشقی، از سعید بن عبدالعزیز، از ربیعة بن یزید، از ابی ادریس خولانی، از ابی ذر، از پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در آنچه از خداوند تبارک و تعالی روایت کرده، آورده است که فرمود: «یا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا يا عبادي كلكم ضال إلا من هديته فاستهدوني أهدكم يا عبادي كلكم جائع إلا من أطعمته فاستطعموني أطعمكم يا عبادي كلكم عار إلا من كسوته فاستكسوني أكسكم يا عبادي أنتم تخطئون بالليل والنهار وأنا اغفر الذنوب جميعا فاستغفروني أغفر لكم» (ای بندگان من، همانا من ظلم را بر خود حرام کردم و آن را میان شما نیز حرام قرار دادم، پس به یکدیگر ظلم نکنید. ای بندگان من، همه‌ی شما گمراهید مگر کسی که من او را هدایت کنم، پس از من هدایت بخواهید تا شما را هدایت کنم. ای بندگان من، همه‌ی شما گرسنه‌اید مگر کسی که من او را طعام دهم، پس از من طعام بخواهید تا شما را طعام دهم. ای بندگان من، همه‌ی شما برهنه‌اید مگر کسی که من او را بپوشانم، پس از من پوشش بخواهید تا شما را بپوشانم. ای بندگان من، شما شب و روز خطا می‌کنید و من همه‌ی گناهان را می‌آمرزم، پس از من آمرزش بخواهید تا شما را بیامرزم). و حق (الحق) تعالی همه‌ی این‌ها را بدون سؤال تو در آن به تو عطا می‌کند، اما با این حال، به تو امر کرده است که از او بخواهی تا در پاسخ به سؤال تو، به تو عطا کند، تا عنایت خود را به تو نشان دهد، آنجا که سؤال تو را پذیرفته است. و این منزلتی دیگر است که بر آنچه به تو عطا کرده، افزوده می‌شود. و چون سؤال تو از امر اوست، و او از تو می‌دانسته است که سؤال خواهی کرد و ناگزیر از ضرورت اصلی هستی که بر آن خلق شده‌ای (یعنی نیاز و سؤال)، تا در سؤال خود، امری واجب را ادا کرده باشی و جزای کسی را بگیری که امر خداوند را امتثال کرده است، پس خیری بر خیر می‌افزایی. پس تو را امر نکرد مگر از روی رحمت به تو و رساندن خیر به تو، و برای اینکه تو را آگاه سازد که نیاز تو به اوست نه به دیگری. زیرا تو را خلق نکرد مگر برای عبادتش، یعنی برای اینکه در برابر او ذلیل باشی. پس آنچه به تو وصیت می‌کنم، ایستادن در برابر اوامر و نواهی حق (الحق) و فهمیدن از او در این باره است، تا از علمایی باشی که آنچه را حق در امر و نهی خود از تو خواسته، می‌دانند. بر حذر باش از کسی که از پروردگارش سؤال نکند، زیرا او را بخیل دانسته است. این در حق عموم است. پس اگر در آنچه به تو وصیت کردم کوتاهی کردی، جز خودت را ملامت مکن. زیرا اگر جاهل بودی، تو را تعلیم دادم، و اگر فراموشکار و غافل بودی، تو را آگاه کردم و یادآوری نمودم. پس اگر مؤمن باشی، همانا یادآوری به تو سود می‌رساند، زیرا من امر خداوند را با آنچه تو را بدان یادآوری کردم، امتثال نمودم. و بهره‌مندی تو از یادآوری، شاهدی بر ایمان توست. خداوند عز و جل در حق من و در حق تو فرمود: «وذَكِّرْ فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ» (و یادآوری کن، زیرا یادآوری مؤمنان را سود می‌رساند). پس اگر یادآوری به تو سود نرساند، خودت را در ایمانت متهم کن، زیرا خداوند راستگوست و خبر داده است که یادآوری مؤمنان را سود می‌رساند. و از تمامیت این خبر الهی که پس از فرموده‌ی «شما را بیامرزم» آوردیم، این است که فرمود: «ای بندگان من، شما هرگز به زیان من نمی‌رسید که به من زیان رسانید، و هرگز به نفع من نمی‌رسید که به من نفع رسانید.» و معلوم است که او سبحانه نه زیان می‌بیند و نه نفع می‌برد، زیرا او بی‌نیاز از جهانیان است. اما هنگامی که خود را به منزلت بنده‌اش قرار داد، در آنچه از طلب طعام و آب ذکر کردیم، ما را به عجز از رسیدن به نهایت در زیان رساندن بندگان به او یا نفع رساندن آن‌ها آگاه ساخت. پس رسیدن به نهایت در آن محال است. و به دلیل اینکه خداوند در حق قومی فرموده است: «بِأَنَّهُمُ اتَّبَعُوا ما أَسْخَطَ الله» (زیرا از آنچه خداوند را به خشم آورد، پیروی کردند)، و این در ظاهر ضرر است، خود را از آن منزه ساخت. و همچنین کسی که عملی انجام دهد که خداوند را با آن راضی کند و او را شاد سازد، مانند توبه‌کننده در شادی خداوند به توبه‌ی بنده‌اش. پس این خبر مانند دارویی بود برای بیماری‌ای که از این امر در برخی نفوس ضعیف در علم به خدا عارض می‌شود، کسانی که علمی به آنچه فرموده‌ی «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست) می‌دهد، ندارند. سپس از تمامیت این خبر، فرموده‌ی اوست: «ای بندگان من، اگر اولین و آخرین شما و انسان‌ها و جنیان شما بر پرهیزگارترین قلب یک مرد باشید، این چیزی بر مُلک من نمی‌افزاید. ای بندگان من، اگر اولین و آخرین شما و انسان‌ها و جنیان شما بر فاجرترین قلب یک مرد باشید، این چیزی از مُلک من نمی‌کاهد. ای بندگان من، اگر اولین و آخرین شما و انسان‌ها و جنیان شما در یک سرزمین بایستند و از من سؤال کنند و من خواسته‌ی هر انسانی را به او عطا کنم، این از آنچه نزد من است، کم نمی‌کند مگر به اندازه‌ای که سوزن هنگامی که وارد دریا می‌شود، از آن کم می‌کند.» و همه‌ی این‌ها دارویی است برای آنچه از بیماری‌های نفوس ضعیف ذکر کردیم. پس ای ولی، این داروها را به کار ببر. خداوند می‌فرماید: «همانا این‌ها اعمال شماست که برای شما احصاء می‌کنم، سپس پاداش آن را به طور کامل به شما می‌دهم. پس هر کس خیری یافت، باید خدا را سپاس گوید، و هر کس غیر از آن یافت، جز خود را ملامت نکند.» و هر کس برای حاجتی سؤال کند، ذلیل شده است. و هر کس برای غیر خدا ذلیل شود، گمراه شده و به خود ظلم کرده و نفس خود را به راه هدایتش نبرده است. و این وصیت من به توست، پس آن را لازم بدار، و این نصیحت من است، پس آن را بدان. و خداوند متعال همواره بندگانش را در کتاب خود و بر زبان رسولانش وصیت کرده است. پس هر کس تو را به چیزی وصیت کند که در به کار بستن آن سعادت توست، او رسولی از جانب خداوند به سوی توست، پس او را نزد پروردگارت شکر کن.\n\nاگر عالمی را دیدی که علمش را به کار نبسته است، تو علم خود را در ادب ورزیدن با او به کار ببند تا حق عالم را از آن جهت که عالم است ادا کنی، و حالت بد او تو را از این کار باز ندارد؛ زیرا او نزد خداوند درجه علمش را دارد. انسان در روز قیامت با کسی محشور می‌شود که او را دوست داشته است، و هر کس با صفتی الهی ادب ورزد، در روز قیامت آن صفت را می‌پوشد و در آن محشور می‌شود. بر تو باد که به هر آنچه می‌دانی خداوند از تو دوست می‌دارد، قیام کنی و به سوی آن بشتابی؛ زیرا اگر با آن آراسته شوی، از طریق اظهار دوستی به سوی او تعالی، او تو را دوست خواهد داشت، و چون تو را دوست بدارد، تو را به علم به خودش و به تجلی (التجلی) و به سرای کرامت خود سعادتمند می‌سازد، و در بلای تو به تو نعمت می‌بخشد. آنچه او تعالی دوست می‌دارد امور بسیاری است که من آنچه میسر است را به عنوان وصیت و نصیحت ذکر می‌کنم.\n\nاز جمله آن امور، آراستگی برای خداست (التجمل لله)؛ زیرا این خود عبادتی مستقل است، به ویژه در عبادت نماز، که به آن امر شده‌ای. خداوند تعالی می‌فرماید: **«يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ»** (ای فرزندان آدم، زینت خود را در هر مسجدی برگیرید). و در مقام انکار می‌فرماید: **«قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِ قُلْ هِيَ لِلَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا خَالِصَةً يَوْمَ الْقِيَامَةِ كَذَلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ»** (بگو: چه کسی زینت‌های خدا را که برای بندگانش پدید آورده و روزی‌های پاکیزه را حرام کرده است؟ بگو: اینها در زندگی دنیا برای کسانی است که ایمان آورده‌اند و در روز قیامت خالص برای آنان است. این‌گونه آیات را برای گروهی که می‌دانند، تفصیل می‌دهیم). و بیان بیشتر از این در قرآن در این باره فراوان است. هیچ تفاوتی میان زینت خدا و زینت زندگی دنیا نیست مگر به قصد و نیت. در واقع، عین زینت همان است و چیز دیگری نیست. نیت روح امور است، و **«إِنَّمَا لِامْرِئٍ مَا نَوَى»** (همانا برای هر کس همان است که نیت کرده). پس هجرت، از آن جهت که عیناً یک هجرت است، اگر هجرت کسی به سوی خدا و رسولش باشد، هجرتش به سوی خدا و رسولش است، و اگر هجرتش برای دنیایی باشد که به آن برسد یا زنی که با او ازدواج کند، هجرتش به سوی همان چیزی است که به خاطرش هجرت کرده است.\n\nهمچنین در حدیث صحیح در بیعت با امام، درباره سه نفری که خداوند در روز قیامت با آنان سخن نمی‌گوید و پاکشان نمی‌سازد و عذابی دردناک دارند، آمده است: «و مردی که با امامی بیعت می‌کند و او را بیعت نمی‌کند مگر برای دنیایی؛ اگر از آن به او بدهد، وفا می‌کند و اگر به او ندهد، وفا نمی‌کند.» پس اعمال به نیت‌هاست و نیت یکی از ارکان خانه اسلام است. در صحیح مسلم آمده است که مردی به رسول خدا (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) گفت: «ای رسول خدا، من دوست دارم که کفشم زیبا باشد و لباسم زیبا باشد.» رسول خدا (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) به او فرمود: **«إِنَّ اللَّهَ جَمِيلٌ يُحِبُّ الْجَمَالَ»** (همانا خداوند زیباست و زیبایی را دوست دارد).\n\nو فرمود: **«إِنَّ اللَّهَ أَوْلَى مَنْ يُتَجَمَّلُ لَهُ»** (همانا خداوند سزاوارترین کسی است که برای او آراستگی شود).\n\n(و از این باب است) اینکه خداوند تعالی جبرئیل را در بیشتر نزول‌هایش بر پیامبر (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) جز در صورت دحیه (دحية) نفرستاد، و او زیباترین فرد زمان خود بود. و تأثیر جمال او بر مردم به حدی بود که وقتی به مدینه آمد و مردم به استقبالش رفتند، هیچ زن حامله‌ای او را ندید مگر اینکه آنچه در شکم داشت سقط کرد. پس حق (الحق) به پیامبرش (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) با نزول جبرئیل در صورت دحیه بشارت می‌دهد و می‌گوید: «ای محمد، میان من و تو جز صورت جمال نیست.» خداوند تعالی او را از آنچه در ذات خود دارد، سبحانه، به حال آگاه می‌سازد. پس هر کس که آراستگی برای خدا را، آن‌گونه که گفتیم، از دست بدهد، این محبت خاص و معین را از دست داده است، و اگر این محبت خاص و معین را از دست بدهد، آنچه از علم و تجلی (التجلی) و کرامت در سرای سعادت و منزلت در تپه رؤیت (کثیب الرؤیة) و شهود (الشهود) معنوی، علمی و روحی در این سرای دنیا در سلوک و مشاهداتش از خدا حاصل می‌شود را از دست داده است. اما همان‌طور که گفتیم، باید با این آراستگی، نیت برای خدا باشد، نه برای زینت و فخر به متاع دنیا و خودنمایی و عجب و تکبر بر دیگران.\n\n(و از جمله آن امور) بازگشت به سوی خدا هنگام فتنه است.\n\nزیرا خداوند هر فتنه‌زده توبه‌کننده‌ای را دوست دارد، چنانکه رسول خدا (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) فرمود.\n\nخداوند عز و جل می‌فرماید: **«خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا»** (مرگ و زندگی را آفرید تا شما را بیازماید که کدام‌یک نیکوکارتر هستید). و بلاء و فتنه به یک معنا هستند و چیزی جز آزمون برای آنچه انسان بر آن ادعا دارد، نیست. **«إِنْ هِيَ إِلَّا فِتْنَتُكَ»** (این جز آزمون تو نیست) یعنی اختبار تو، **«تُضِلُّ بِهَا مَنْ تَشَاءُ»** (هر که را بخواهی با آن گمراه می‌کنی) یعنی او را متحیر می‌سازی، و **«وَتَهْدِي بِهَا مَنْ تَشَاءُ»** (و هر که را بخواهی با آن هدایت می‌کنی) یعنی راه نجاتش را در آن برایش آشکار می‌سازی.\n\n(و بزرگترین فتنه‌ها) زنان، مال، فرزند و جاه هستند.\n\nاین چهار مورد، اگر خداوند بنده‌ای از بندگانش را به آن‌ها یا به یکی از آن‌ها مبتلا سازد و او در آن‌ها مقام حق (الحق) را در نصب آن‌ها برای خود به جای آورد و در آن‌ها به سوی خدا بازگردد و با عین آن‌ها توقف نکند، بلکه آن‌ها را نعمتی الهی ببیند که خداوند به او ارزانی داشته و او را به سوی او تعالی بازگردانده است، و او را در مقام حق شکر که خداوند پیامبرش موسی (علیه السلام) را به آن امر کرد، قرار دهد.\n\nخداوند به موسی فرمود: «ای موسی، مرا حق شکر، شکر کن.» موسی گفت: «پروردگارا، حق شکر چیست؟» خداوند به او فرمود: «ای موسی، وقتی نعمت را از من دیدی، این حق شکر است.» این را ابن ماجه در سنن خود از رسول خدا (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) ذکر کرده است.\n\nو هنگامی که خداوند گناهان گذشته و آینده پیامبرش محمد (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) را بخشید و او را با این سخن تعالی بشارت داد: **«لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ»** (تا خداوند گناه گذشته و آینده تو را ببخشد)، او به شکرانه آن برخاست تا پاهایش ورم کرد. او از شکرگزاری خدا سست نشد و به آسایش متمایل نگردید. و هنگامی که در این باره به او گفته شد و از او خواسته شد که با خود مدارا کند، (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) فرمود: «آیا بنده شکرگزاری نباشم؟» و این به دلیل شنیدن سخن خداوند بود که می‌فرماید: **«إِنَّ اللَّهَ يُحِبُّ الشَّاكِرِينَ»** (همانا خداوند شکرگزاران را دوست دارد).\n\nاگر در مقام شکر منعم قرار نگیرد، این محبت خاص الهی را که به این مقام تعلق دارد، از دست می‌دهد، محبتی که جز شکرگزار به آن نمی‌رسد؛ زیرا خداوند می‌فرماید: **«وَقَلِيلٌ مِنْ عِبَادِيَ الشَّكُورُ»** (و اندکی از بندگان من شکرگزارند). و اگر آن را از دست بدهد، آنچه از علم به خدا و تجلی (التجلی) و نعمت خاص در سرای کرامت و تپه رؤیت (کثیب الرؤیة) در روز دیدار بزرگ برای اوست، از دست می‌دهد؛ زیرا برای هر محبت الهی ناشی از صفتی خاص، علم و تجلی و نعمت و منزلتی وجود دارد که صاحب آن صفت را از دیگران متمایز می‌سازد.\n\n(اما فتنه زنان)\n\nصورت بازگشت او به سوی خدا در محبت آن‌ها این است که ببیند همه، یکدیگر را دوست دارند و به سوی هم میل می‌کنند، پس او جز نفس خود را دوست نداشته است؛ زیرا زن در اصل از مرد، از دنده کوتاهش، آفریده شده است. پس او را در نفس خود به منزله صورتی قرار می‌دهد که خداوند انسان کامل (الإنسان الکامل) را بر آن آفریده است، و آن صورت حق (الحق) است. پس حق (الحق) او را مظهر (مجلی) برای خود قرار داده است. و هنگامی که چیزی مظهر برای بیننده باشد، بیننده در آن صورت جز نفس خود را نمی‌بیند. پس هنگامی که در این زن نفس خود را ببیند، محبتش به او و میلش به او شدید می‌شود؛ زیرا او صورت اوست. و برای تو روشن شد که صورت او، صورت حق (الحق) است که او را بر آن ایجاد کرده است. پس او جز حق (الحق) را ندیده است، اما با شهوت محبت و لذت و وصلی که در آن فانی می‌شود، فنای (الفناء) حقیقی با محبتی صادقانه. و با ذات خود با او مقابله مثلیت کرده است، و به همین دلیل در او فانی شده است. هیچ جزئی در او نیست مگر اینکه در آن زن است، و محبت در تمام اجزای او جریان یافته است. پس تمام وجودش به او تعلق یافته است، و به همین دلیل در مثل خود فنای کلی یافته است، برخلاف محبتش به غیر مثل خود. پس با محبوبش متحد شد تا آنجا که گفت:\n\n**أنا من أهوى ومن أهوى أنا**\n(من آن کسی هستم که دوستش دارم و آن کسی که دوستش دارم من هستم)\n\nو دیگری در این مقام گفت: **«أنا الله»** (من خدا هستم). پس اگر مثل خود را با این محبت دوست داشته باشی، شهود تو در او، تو را به سوی خدا باز می‌گرداند. پس تو از کسانی هستی که خداوند او را دوست داشته و این فتنه، فتنه‌ای بوده که هدایت را به تو بخشیده است.\n\nاما روش دیگر در محبت زنان این است که آن‌ها محل انفعال و تکوین برای ظهور اعیان امثال در هر نوع هستند. و شکی نیست که خداوند اعیان عالم را در حال عدم عالم دوست نداشت مگر به دلیل اینکه آن اعیان محل انفعال بودند. پس هنگامی که از جهت اراده‌کننده بودن خود به آن‌ها توجه کرد، به آن‌ها گفت: **«كُنْ»** (باش)، پس بودند. و مُلک او به واسطه آن‌ها در هستی (الوجود) ظاهر شد، و آن اعیان حق (الحق) را در الوهیتش به خدا دادند، پس او اله بود. و او تعالی را با تمام اسماء، به حال، عبادت کردند، چه آن اسماء را می‌دانستند یا نمی‌دانستند. پس هیچ اسمی برای خدا باقی نماند مگر اینکه بنده با صورت و حال خود در آن قیام کرده است، هرچند نتیجه آن اسم را نداند. و این همان است که\n\nرسول خدا (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) در دعای خود به اسماء الله فرمود: «یا آن را در علم غیب خود مستأثر داشته‌ای یا آن را به یکی از مخلوقاتت آموخته‌ای.»\n\nیعنی از اسماء اوست که عین آن را بشناسد تا آن را از غیرش به علم جدا کند؛ زیرا بسیاری از امور در انسان به صورت و حال وجود دارد و او از آن‌ها آگاه نیست، اما خداوند می‌داند که آن در اوست. پس اگر زن را به دلیل آنچه ذکر کردیم دوست بدارد، محبت او، او را به سوی خداوند تعالی بازگردانده است. پس این فتنه در حق او نعمتی هدایت‌بخش بوده است، و خداوند او را به دلیل بازگشتش به سوی او تعالی در محبتش به آن زن، دوست داشته است.\n\nاما تعلق او به زن خاصی در این میان، بدون دیگران، با وجود اینکه این حقایق که ذکر کردیم در هر زنی جاری است، به دلیل مناسبت روحانی میان این دو شخص در اصل نشأت و مزاج طبیعی و نظر روحی است. برخی از این تعلقات تا اجل معین ادامه می‌یابد و برخی تا غیر اجل، بلکه اجل آن مرگ است و تعلق از بین نمی‌رود، مانند محبت پیامبر (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) به عایشه، که او را بیشتر از همه زنانش دوست می‌داشت، و همچنین محبتش به ابوبکر که پدر او بود. پس این مناسبت‌های ثانوی هستند که اشخاص را معین می‌کنند، و سبب اول همان است که ذکر کردیم. به همین دلیل، محبت مطلق و سماع مطلق و رؤیت مطلق که برخی از بندگان خدا بر آن هستند، به شخص خاصی در عالم اختصاص نمی‌یابد. هر حاضری نزد او محبوب اوست و به او مشغول است. با این حال، ناگزیر از میل خاص به برخی اشخاص به دلیل مناسبت خاصی همراه با این اطلاق است. این امر ضروری است؛ زیرا نشأت عالم در آحاد خود این را ایجاب می‌کند. ناگزیر از تقیید است، و کامل کسی است که میان تقیید و اطلاق جمع کند. اطلاق مانند\n\nسخن پیامبر (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) است که فرمود: «از دنیای شما سه چیز برای من دوست‌داشتنی شد: زنان...» و زن خاصی را از زن دیگری جدا نکرد.\n\nو تقیید مانند\n\nآنچه روایت شده از محبت بیشتر او به عایشه نسبت به سایر زنانش.\n\nبه دلیل نسبت الهی روحانی که او را به او مقید کرده است، با وجود اینکه زنان را دوست می‌داشت. پس ما از یک رکن به اندازه‌ای که برای فهمنده کافی باشد، ذکر کردیم.\n\n(و اما رکن دوم) از خانه فتنه‌ها که جاه است و از آن به ریاست تعبیر می‌شود.\n\nگروهی که علم ندارند، درباره آن می‌گویند: «آخرین چیزی که از قلب‌های صدیقان خارج می‌شود، حب ریاست است.» عارفان از میان پیروان این قول، آن را به گونه‌ای که عوام اهل طریقت می‌فهمند، نمی‌گویند، بلکه منظور آن‌ها همان است که ما از مقصود کاملان اهل الله بیان می‌کنیم. و آن این است که در نفس انسان امور بسیاری وجود دارد که خداوند آن‌ها را در او پنهان کرده است، و اوست که **«يُخْرِجُ الْخَبْءَ فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ»** (آنچه را که در آسمان‌ها و زمین پنهان است بیرون می‌آورد و آنچه را پنهان می‌کنید و آنچه را آشکار می‌سازید می‌داند)، یعنی آنچه از شما ظاهر شده و آنچه پنهان مانده و شما از وجود آن در خودتان آگاه نیستید. پس حق (الحق) پیوسته از نفس بنده خود، آنچه را در آن پنهان کرده است، بیرون می‌آورد، چیزی که او نمی‌دانست در نفسش وجود دارد، مانند کسی که پزشک بیماری‌ای را در او می‌بیند که بیمار از وجود آن در خود آگاه نیست. همچنین آنچه خداوند در نفوس خلق پنهان کرده است. آیا نمی‌بینی که\n\n(صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) می‌فرماید: **«مَنْ عَرَفَ نَفْسَهُ عَرَفَ رَبَّهُ»** (هر کس نفس خود را بشناسد، پروردگارش را شناخته است).\n\nو هر کسی نفس خود را نمی‌شناسد، با اینکه نفس او عین اوست و غیر آن نیست. پس حق (الحق) پیوسته از نفس انسان آنچه را در آن پنهان کرده است، بیرون می‌آورد و او آن را مشاهده می‌کند، و در آن هنگام از نفس خود چیزی را می‌داند که پیش از آن نمی‌دانست. پس گروه کثیری گفتند: «آخرین چیزی که از قلب‌های صدیقان خارج می‌شود، حب ریاست است.» پس هنگامی که این حب خارج می‌شود، برای آن‌ها ظاهر می‌شود و آن‌ها ریاست را دوست می‌دارند، اما با محبتی غیر از محبت عوام به آن؛ زیرا آن‌ها ریاست را از آن جهت دوست می‌دارند که بر آنچه خداوند درباره آن‌ها فرموده است، هستند، که او گوش و چشم آن‌هاست و تمام قوای آن‌ها و اعضایشان را ذکر کرده است. پس هنگامی که در این مرتبه باشند، ریاست را دوست نمی‌دارند مگر به واسطه خدا، زیرا تقدم برای خدا بر عالم است، چرا که آن‌ها بندگان او هستند. و رئیس جز با مرئوس، وجوداً و تقدیراً، وجود ندارد. پس محبت او به مرئوس شدیدترین محبت است، زیرا مرئوس است که ریاست را برای او تثبیت می‌کند. پس او هیچ چیز را در مُلک خود بیشتر از مُلک دوست نمی‌دارد، زیرا مُلک اوست که پادشاه بودن او را تثبیت می‌کند. پس این معنای «آخرین چیزی که از قلب‌های صدیقان خارج می‌شود، حب ریاست است» برای آن‌هاست. پس آن را می‌بینند و با ذوق مشاهده می‌کنند، نه اینکه از قلب‌هایشان خارج شود و ریاست را دوست نداشته باشند؛ زیرا اگر آن را دوست نداشته باشند، علم به آن را با ذوق حاصل نکرده‌اند، و آن صورتی است که خداوند آن‌ها را بر آن آفریده است، در\n\nسخن (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم): **«إِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ»** (همانا خداوند آدم را بر صورت خود آفرید)، در برخی از تأویلات و احتمالات این خبر. پس این را بدان. و جاه، اجرای کلمه است، و هیچ کلمه‌ای نافذتر از سخن او نیست که **«إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ»** (هرگاه چیزی را اراده کند، کافی است که به آن بگوید: باش، پس می‌شود). پس بزرگترین جاه از آن کسی است که جاهش به خدا باشد. پس این بنده با بقای عین خود این را می‌بیند و در آن هنگام می‌داند که او مثلی است که مماثل ندارد، زیرا او بنده پروردگار است و خداوند عز و جل پروردگار است نه بنده. پس جامعیت برای اوست و انفراد برای حق (الحق).\n\n(و اما رکن سوم) که مال است.\n\nمال به این نام نامیده نشده مگر به دلیل اینکه طبعاً به سوی آن میل می‌شود. پس خداوند بندگانش را با آن آزمود، زیرا تسهیل برخی امور را به وجود آن قرار داد و قلب‌ها را به محبت صاحب مال و تعظیم او وابسته کرد، حتی اگر بخیل باشد؛ زیرا چشم‌ها با دیده تعظیم به او می‌نگرند، به دلیل توهم نفوس به بی‌نیازی او از آن‌ها به واسطه مالی که دارد. و چه بسا صاحب مال در نفس خود فقیرترین مردم به آن‌ها باشد و در نفس خود کفایت و قناعت به آنچه دارد را نیابد، پس او طلب زیادت از آنچه در دست دارد می‌کند. و هنگامی که عالم میل قلب‌ها را به سوی صاحب مال به خاطر مال دید، مال را دوست داشتند. پس عارفان وجهی الهی را جستند که با آن مال را دوست بدارند، زیرا ناگزیر از محبت آن هستند. و اینجا جایگاه فتنه و ابتلایی است که گمراهی و هدایت در آن است.\n\nاما عارفان به امور الهی نظر کردند، از جمله سخن خداوند تعالی: **«وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا»** (و به خدا قرض نیکو دهید). و او جز با صاحبان ثروت سخن نگفته است. پس مال را دوست داشتند تا از اهل این خطاب باشند و از شنیدن آن لذت ببرند. پس هنگامی که به او قرض می‌دهند، می‌بینند که صدقه در دست رحمان قرار می‌گیرد. پس به واسطه مال و دادن آن، این مناوله حق (الحق) از جانب آن‌ها برایشان حاصل شد. پس برای آن‌ها وصله مناوله بود. و خداوند آدم را با سخن خود گرامی داشت: **«لِمَا خَلَقْتُ بِيَدَيَّ»** (به خاطر آنچه با دو دست خود آفریدم). پس کسی که به درخواست قرض او، به او می‌دهد، در لذت بردن از شرف کامل‌تر است از کسی که او را با دست خود آفریده است. اگر مال نبود، این خطاب الهی را نمی‌شنیدند و اهل آن نبودند و این تناول ربانی به واسطه قرض برایشان حاصل نمی‌شد؛ زیرا این امر وصله با خدا را فراگیر می‌کند. پس خداوند آن‌ها را با مال آزمود، سپس آن‌ها را با درخواست از خود آزمود و حق (الحق) خود را به منزله سائلان از بندگانش، اهل حاجت، از میان اهل ثروت و مال، قرار داد، با سخن خود در\n\nحدیثی که در این باب گذشت: «ای بنده من، از تو غذا خواستم، به من غذا ندادی، و از تو آب خواستم، به من آب ندادی.»\n\nپس با این نظر، محبت مال برای آن‌ها فتنه‌ای هدایت‌بخش به سوی چنین امری بود.\n\n(و اما فتنه فرزند) به دلیل اینکه او راز پدر و پاره‌ای از جگر او و چسبیده‌ترین چیزها به اوست. پس محبت او، محبت خود شیء است، و هیچ چیز نزد شیء محبوب‌تر از نفس او نیست. پس خداوند او را با نفس خود در صورتی خارج از او آزمود و او را فرزند نامید تا ببیند آیا نظر به او، او را از آنچه حق (الحق) او را به آن مکلف کرده است، یعنی اقامه حقوق بر او، باز می‌دارد یا خیر.\n\nرسول خدا (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) درباره دخترش فاطمه و جایگاه او در قلبش، جایگاهی که نادیده گرفته نمی‌شود، می‌فرماید: «اگر فاطمه دختر محمد دزدی می‌کرد، دستش را قطع می‌کردم.»\n\nو عمر بن خطاب پسرش را به دلیل زنا شلاق زد و او مرد، در حالی که نفسش به آن راضی بود. و ماعز و زن در اجرای حد بر آن‌ها که در آن تلف شدن جانشان بود، جان خود را فدا کردند. و رسول خدا (صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم) درباره توبه آن‌ها فرمود: «و چه توبه‌ای بزرگتر از اینکه جان خود را فدا کردند.»\n\nو بخشش با اقامه حق ناخوشایند است."
  },
  "page_count": 12
}