{
  "id": 94,
  "title": {
    "ar": "الباب الرابع والتسعون في ترك الزهد",
    "en": "Chapter Ninety-Four: On the Abandonment of Asceticism (ترك الزهد)",
    "ur": "چورانوےواں باب: زہد (الزهد) کو ترک کرنے کے بیان میں",
    "fa": "باب نود و چهارم در ترک زهد"
  },
  "content": {
    "ar": "### [الباب الرابع والتسعون في ترك الزهد]\n\n\n> الزهد ترك وترك الترك معلوم *** بأنه مسك ما في الكف مقبوض‏\n\n\n> الأرض قبضته وهو الغني فأين *** الترك فهو محال فيك مفروض‏\n\n\n> لا ينعم الحق بالنعما فأنت لها *** وقد زهدت فهذا اللفظ تعريض‏\n\n\n> فالزهد ليس له في العلم مرتبة *** وتركه عند أهل الجمع مفروض‏\n\n\n### [ترك الزهد هو عين رجوعك إلى ما زهدت فيه‏]\n\n\nاعلم أن ترك الترك إمساك والزهد ترك وترك الزهد ترك الترك فهو عين رجوعك إلى ما زهدت فيه لأن العلم الحق ردك إليه والحال يطلبه فما له حقيقة في باطن الأمر لكن له حكم ما في الظاهر فيصح هذا القدر منه وبقي هل يقع الإمساك الذي هو ترك الزهد عن رغبة في الممسوك أو لا عن رغبة فاختلفت أحوال الناس فيه‏\n\n\n### [اختلاف أحوال الناس في ترك الزهد]\n\n\nفمن أمسك لا عن رغبة فهو زاهد أمين على إمساك حقوق الغير حتى يؤديها إلى أربابها في الأوقات المقدرة المقررة وقد يكون عن كشف وعلم صحيح بأعيان أصحابها وقد لا يكون غير أنه لا يتناول منها شيئا في حق نفسه إذ كان بهذه المثابة ومن أمسك عن رغبة في الممسوك وهم رجلان الواحد راجع عن مقام الزهد بلا شك لمرض قام به في نفسه فهذا ليس بشي‏ء والرجل الآخر وهم الأنبياء والكمل من الأولياء فأمسكوا باطلاع عرفاني أنتج لهم أمرا عشقه بما في الإمساك من المعرفة والتحلي بالكمال لا عن بخل وضعف يقين‏\n\n\nأرسل الله على أيوب رجل جراد من ذهب فسقط عليه فأخذ يجمعه في ثوبه فأوحى الله إليه أ لم أكن أغنيتك عن هذا فقال لا غنى لي عن خيرك‏\n\n\nفانظر ما أعطته معرفته‏\n\n\n### [ما زهد من زهد إلا لطلب الأكثر فزهد في الأقل‏]\n\n\nوما زهد من زهد إلا لطلب الأكثر فزهد في الأقل قُلْ مَتاعُ الدُّنْيا قَلِيلٌ فأين الزهد فما تركوا الدنيا إلا حذرا أن يزرأهم في الآخرة فهذا عين الطمع والرغبة فيما يتخيل فيه أنه زهد وهذا هو مقام ترك الزهد وأما حاله فالزهد في الدنيا ولهذا لا يثبت‏",
    "en": "### Chapter Ninety-Four: On the Abandonment of Renunciation\n\nRenunciation is abandonment, and the abandonment of abandonment is known\nTo be the holding of what is grasped in the hand.\n\nThe Earth is His grasp, and He is the Self-Sufficient. So where\nIs abandonment? It is impossible for you, yet it is imposed.\n\nThe Real does not enjoy the blessing, but you are for it,\nAnd you have renounced—this word is merely an allusion.\n\nThus, renunciation (الزهد) has no station (مرتبة) in [Divine] Knowledge (العلم),\nAnd its abandonment is obligatory for the People of Unification (أهل الجمع).\n\n### The Abandonment of Renunciation is the very return to that which you renounced\n\nKnow that the abandonment of abandonment (ترك الترك) is retention (إمساك). Renunciation (الزهد) is abandonment (ترك). The abandonment of renunciation (ترك الزهد) is the abandonment of abandonment. Therefore, it is the very return to that which you renounced, because True Knowledge (العلم الحق) returns you to it, and the spiritual state (الحال) demands it. It has no reality (حقيقة) in the inner dimension (باطن الأمر), but it has a ruling (حكم) in the outer dimension (الظاهر). Thus, this much of it is valid. The question remains: Does the retention (الإمساك), which is the abandonment of renunciation, occur out of desire (رغبة) for what is retained, or without desire? The states of people differ regarding this.\n\n### The Difference in People's States Regarding the Abandonment of Renunciation\n\nWhoever retains without desire is an ascetic (زاهد) who is trustworthy (أمين) regarding the retention of the rights of others, until he delivers them to their owners at the appointed and established times. This may be based on an unveiling (كشف) and sound knowledge (علم صحيح) of the identities (أعيان) of their owners, or it may not be. However, he does not take anything from it for himself, since he is in this station.\n\nAs for those who retain out of desire for what is retained, they are two types of men. The first is one who has undoubtedly retreated from the station of renunciation due to an ailment that arose within his soul; this one is nothing [of spiritual value]. The second type are the Prophets (الأنبياء) and the Perfected Saints (الكمل من الأولياء). They retained based on a gnostic insight (اطلاع عرفاني) that produced for them a matter they loved, due to the Gnosis (المعرفة) and the adornment with Perfection (التحلي بالكمال) inherent in the retention, not out of avarice or weakness of certainty.\n\nAllah sent upon Ayyub (Job) a swarm of golden locusts, which fell upon him. He began gathering them into his garment. Allah revealed to him: \"Did I not make you independent of this?\" He replied: \"I have no independence from Your bounty.\"\n\nLook at what his gnosis granted him.\n\n### No one renounced except in pursuit of the greater, so he renounced the lesser\n\nNo one renounced except in pursuit of the greater, so he renounced the lesser. <<قُلْ مَتاعُ الدُّنْيا قَلِيلٌ>> (Say: The enjoyment of the world is little). So where is the renunciation? They only abandoned the world (الدنيا) out of caution that it might diminish their portion in the Hereafter (الآخرة). This is the very essence of greed and desire for that which they imagine to be renunciation. This is the station (مقام) of the abandonment of renunciation (ترك الزهد). As for its spiritual state (حاله), it is renunciation of the world, and this is why it is not stable.",
    "ur": "### [باب چورانوے: ترکِ زہد کے بیان میں]\n\nزہد ترک ہے، اور ترک کا ترک معلوم ہے۔\nکہ یہ اس چیز کا امساک ہے جو ہاتھ میں پکڑی ہوئی ہے۔\n\nزمین اس کی گرفت میں ہے، اور وہ الغنی (بے نیاز) ہے، تو ترک کہاں ہے؟\nپس یہ (ترک) تم میں ایک محال فرض کیا گیا ہے۔\n\nالحق (ذات حق) نعمتوں سے لطف اندوز نہیں ہوتا، تم ان کے لیے ہو،\nاور تم نے زہد کیا، تو یہ لفظ (زہد) ایک طعنہ ہے۔\n\nپس زہد کی علم میں کوئی مرتبت نہیں،\nاور اہل الجمع کے نزدیک اس کا ترک کرنا فرض ہے۔\n\n### [ترک زہد تمہارا عین اس چیز کی طرف لوٹنا ہے جس سے تم نے زہد کیا تھا]\n\nجان لو کہ ترک کا ترک کرنا امساک (روکنا) ہے، اور زہد ترک ہے۔ اور زہد کا ترک کرنا، ترک کا ترک کرنا ہے۔ پس یہ عین تمہارا اس چیز کی طرف لوٹنا ہے جس سے تم نے زہد کیا تھا، کیونکہ العلم الحق (حقیقی علم) نے تمہیں اس کی طرف لوٹا دیا ہے اور حال اس کا متقاضی ہے۔ پس باطنِ امر میں اس کی کوئی حقیقت نہیں، لیکن ظاہر میں اس کا حکم (اثر) ہے۔ لہٰذا اس قدر (ظاہری حکم) اس سے درست ہے۔ اور یہ سوال باقی رہا کہ کیا امساک جو کہ ترکِ زہد ہے، وہ ممسوک (جسے روکا گیا) میں رغبت کی وجہ سے واقع ہوتا ہے یا بغیر رغبت کے؟ پس اس بارے میں لوگوں کے احوال مختلف ہو گئے۔\n\n### [ترک زہد میں لوگوں کے احوال کا اختلاف]\n\nپس جس نے بغیر رغبت کے امساک کیا، وہ زاہد ہے جو دوسروں کے حقوق کو روکے رکھنے پر امین ہے، تاکہ وہ انہیں مقررہ اوقات میں ان کے مالکوں تک پہنچا دے۔ اور یہ (امساک) کبھی ان کے مالکوں کی حقیقتوں کے بارے میں الکشف (کشف) اور صحیح علم کی بنا پر ہوتا ہے، اور کبھی نہیں ہوتا۔ مگر یہ کہ وہ اس میں سے اپنے حق میں کچھ نہیں لیتا، جب وہ اس مرتبے پر ہو۔ اور جس نے ممسوک میں رغبت کی وجہ سے امساک کیا، وہ دو طرح کے لوگ ہیں۔ پہلا وہ جو اپنے نفس میں پیدا ہونے والی بیماری کی وجہ سے مقامِ زہد سے بلا شک لوٹ آیا، پس یہ کوئی حیثیت نہیں رکھتا۔ اور دوسرا شخص وہ ہیں جو انبیاء اور اولیاء میں سے کاملین ہیں، پس انہوں نے ایک عرفانی اطلاع (آگاہی) کے ساتھ امساک کیا جس نے ان کے لیے ایک ایسا امر پیدا کیا جس سے انہوں نے عشق کیا، اس لیے کہ امساک میں المعرفۃ (معرفت) اور کمال سے آراستہ ہونا شامل ہے، نہ کہ بخل اور ضعفِ یقین کی وجہ سے۔\n\nاللہ تعالیٰ نے ایوب (علیہ السلام) پر سونے کی ٹڈیوں کا ایک جھنڈ بھیجا جو ان پر گرا، تو انہوں نے اسے اپنے کپڑے میں جمع کرنا شروع کر دیا۔ اللہ نے ان کی طرف وحی کی: \"کیا میں نے تمہیں اس سے بے نیاز نہیں کر دیا تھا؟\" انہوں نے عرض کیا: \"مجھے آپ کے خیر (بھلائی) سے کوئی بے نیازی نہیں ہے۔\" پس دیکھو کہ ان کی المعرفۃ (معرفت) نے انہیں کیا عطا کیا۔\n\n### [جس نے بھی زہد کیا، اس نے زیادہ کی طلب میں کیا، پس اس نے کم میں زہد کیا]\n\nاور جس نے بھی زہد کیا، اس نے زیادہ کی طلب میں کیا، پس اس نے کم میں زہد کیا۔ (قرآن مجید میں ہے):\n**قُلْ مَتاعُ الدُّنْيا قَلِيلٌ** (کہہ دیجیے کہ دنیا کا فائدہ بہت تھوڑا ہے) [النساء: 77]\nتو زہد کہاں ہے؟ انہوں نے دنیا کو صرف اس احتیاط کی وجہ سے ترک کیا کہ کہیں وہ آخرت میں انہیں نقصان نہ پہنچا دے۔ پس یہ عین طمع اور رغبت ہے اس چیز میں جسے وہ زہد سمجھتے ہیں۔ اور یہی ترکِ زہد کا مقام ہے۔ لیکن اس کا حال دنیا میں زہد کرنا ہے، اور اسی لیے یہ (زہد) قائم نہیں رہتا۔",
    "fa": "[باب نود و چهارم در ترک زهد]\n\nزهد، ترک است؛ و ترکِ ترک معلوم است *** که آن، نگه داشتنِ چیزی است که در کف گرفته شده است.\n\nزمین در قبضه اوست و او غنی (الغني) است؛ پس ترک کجاست؟ *** این امری محال است که بر تو تحمیل شده است.\n\nحق (الحق) از نعمت‌ها بهره‌مند نمی‌شود، اما تو از آن‌ها بهره‌مندی. *** و تو زهد ورزیده‌ای؛ پس این لفظ (زهد) کنایه است.\n\nپس زهد در علم (العلم) مرتبه‌ای ندارد، *** و ترک آن نزد اهل جمع (أهل الجمع) واجب است.\n\n[ترک زهد، عین بازگشت تو به چیزی است که از آن زهد ورزیدی]\n\nبدان که ترکِ ترک، نگه داشتن است، و زهد، ترک است؛ و ترک زهد، ترکِ ترک است. پس آن عین بازگشت تو به چیزی است که از آن زهد ورزیده‌ای، زیرا علم حق (العلم الحق) تو را به آن بازگردانده است و حال (الحال) آن را می‌طلبد. پس زهد در باطن امر حقیقتی ندارد، اما در ظاهر حکمی دارد؛ بنابراین این مقدار از آن صحیح است. و باقی می‌ماند این سؤال که آیا این نگه داشتن (الإمساك) که همان ترک زهد است، از روی رغبت به آنچه نگه داشته شده است واقع می‌شود یا بدون رغبت؟ در این باره احوال مردم متفاوت است.\n\n[اختلاف احوال مردم در ترک زهد]\n\nپس کسی که بدون رغبت نگه می‌دارد، او زاهدی امین است بر نگه داشتن حقوق دیگران تا آن را در زمان‌های مقرر و تعیین شده به صاحبانش ادا کند. و این نگه داشتن گاهی از روی کشف (الکشف) و علم صحیح به عین صاحبان آن حقوق است و گاهی چنین نیست؛ جز اینکه او چیزی از آن را برای حق خود برنمی‌دارد، زیرا در این مرتبه قرار دارد. و اما کسی که از روی رغبت به آنچه نگه داشته شده است، امساک می‌کند، دو دسته‌اند: یکی کسی است که بدون شک از مقام زهد بازگشته است به دلیل مرضی که در نفس او پدید آمده است؛ پس این شخص ارزشی ندارد. و دسته دیگر، انبیا و کاملان از اولیا هستند؛ آنان به واسطه اطلاعی عرفانی (عرفاني) امساک کردند که برایشان امری را به وجود آورد که آن را دوست داشتند، به دلیل معرفت (المعرفة) و آراسته شدن به کمالی که در این نگه داشتن وجود دارد، نه از روی بخل و ضعف یقین.\n\nخداوند بر ایوب (علیه السلام) دسته‌ای ملخ از طلا فرستاد که بر او فرود آمدند. ایوب شروع به جمع کردن آن‌ها در جامه‌اش کرد. خداوند به او وحی کرد: آیا تو را از این بی‌نیاز نکرده بودم؟ ایوب پاسخ داد: من از خیر تو بی‌نیاز نیستم. پس بنگر که معرفت (المعرفة) او چه چیزی به وی بخشید.\n\n[هیچ کس زهد نورزید مگر برای طلب بیشتر، پس در کمتر زهد ورزید]\n\nو هیچ کس زهد نورزید مگر برای طلب بیشتر، پس در کمتر زهد ورزید. [بگو: بهره دنیا اندک است] (قُلْ مَتاعُ الدُّنْيا قَلِيلٌ). پس زهد کجاست؟ آنان دنیا را ترک نکردند مگر از بیم آنکه در آخرت به آن‌ها زیان رساند. پس این عین طمع و رغبت است در چیزی که گمان می‌شود زهد است. و این همان مقام ترک زهد (ترك الزهد) است، اما حال (الحال) او زهد در دنیاست و به همین دلیل پایدار نمی‌ماند."
  },
  "page_count": 1
}