{
  "id": 358,
  "title": {
    "ar": "الباب الثامن والخمسون وثلاثمائة في معرفة منزل ثلاثة أسرار مختلفة الأنوار والقرار والإبدار وصحيح الأخبار",
    "en": "Chapter Three Hundred and Fifty-Eight: Concerning the Gnosis (معرفة) of the Station (منزل) of Three Secrets (أسرار) whose Lights (أنوار), Stability (قرار), and Full Manifestation (إبدار) Differ, and the Soundness of the Reports (الأخبار).",
    "ur": "باب تین سو اٹھاون: تین اسرار کی منزل کی معرفت کے بیان میں جن کے انوار، قرار، اور ابدار مختلف ہیں، اور صحیح اخبار کا بیان۔",
    "fa": "باب سیصد و پنجاه و هشتم در معرفت منزل سه سرّ که نورها، قرارها، ابدارها (ظهورها) و اخبار صحیحشان متفاوت است."
  },
  "content": {
    "ar": "## «الباب الثامن والخمسون وثلاثمائة في معرفة منزل ثلاثة أسرار مختلفة الأنوار والقرار والإبدار وصحيح الأخبار»\n\n\n> إن المقادير أوزان منظمة *** تأتي بها ظلل من فوقها ظلل‏\n\n\n> من الغمام ومن غير الغمام يرى *** عند التنزل في إعجازها كلل‏\n\n\n> تحوي على كل معنى ليس يظهره *** إلا الخطابة والأشعار والمثل‏\n\n\n> فمنه ما هو محمود فمرتفع *** ومنه ما هو مذموم فمنسفل‏\n\n\n> ومن ينازعني فيما أفوه به *** فالناس كلهم أعداء ما جهلوا\n\n\n### [أن النفس الناطقة سعيدة في الدنيا والآخرة]\n\n\nاعلم أسعدنا الله وإياك بسعادة الأبد أن النفس الناطقة سعيدة في الدنيا والآخرة لا حظ لها في الشقاء لأنها ليست من عالم الشقاء إلا أن الله أركبها هذا المركب البدني المعبر عنه بالنفس الحيوانية فهي لها كالدابة وهي كالراكب عليها وليس للنفس‏\nالناطقة في هذا المركب الحيواني إلا المشي بها على الطريق المستقيم الذي عينه لها الحق فإن أجابت النفس الحيوانية لذلك فهي المركب الذلول المرتاض وإن أبت فهي الدابة الجموح كلما أراد الراكب أن يردها إلى الطريق حرنت عليه وجمحت وأخذت يمينا وشمالا لقوة رأسها وسوء تركيب مزاجها فالنفس الحيوانية ما تقصد المخالفة ولا تأتي المعصية انتهاكا لحرمة الشريعة وإنما تجري بحسب طبعها لأنها غير عالمة بالشرع واتفق أنها على مزاج لا يوافق راكبها على ما يريد منها والنفس الناطقة لا يتمكن لها المخالفة لأنها من عالم العصمة والأرواح الطاهرة فإذا وقع العقاب يوم القيامة فإنما يقع على النفس الحيوانية كما يضرب الراكب دابته إذا جمحت وخرجت عن الطريق الذي يريد صاحبها أن يمشي بها عليه أ لا ترى الحدود في الزنا والسرقة والمحاربة والافتراء إنما محلها النفس الحيوانية البدنية وهي التي تحس بألم القتل وقطع اليد وضرب الظهر فقامت الحدود على الجسم وقام الألم بالنفس الحساسة الحيوانية التي يجتمع فيها جميع الحيوان المحس للآلام فلا فرق بين محل العذاب من الإنسان وبين جميع الحيوان في الدنيا والآخرة والنفس الناطقة على شرفها مع عالمها في سعادتها الدائمة\n\n\nأ لا ترى إلى النبي صَلَّى اللهُ عَليهِ وسَلَّم قد قام لجنازة يهودي فقيل له إنها جنازة يهودي فقال صَلَّى اللهُ عَليهِ وسَلَّم أ ليست نفسا\n\n\nفما علل بغير ذاتها فقام إجلالا لها وتعظيما لشرفها ومكانتها وكيف لا يكون لها الشرف وهي منفوخة من روح الله فهي من العالم الأشرف الملكي الروحاني عالم الطهارة فلا فرق بين النفس الناطقة مع هذه النفس البدنية الحيوانية وبين الراكب على الدابة في الصورة فأما جموح وإما ذلول فقد بان لك أن النفس الناطقة ما عصت وإنما النفس الحيوانية ما ساعدتها على ما طلبت منها وإن النفس الحيوانية ما خوطبت بالتكليف فتتصف بطاعة أو معصية فاتفق إن كانت جموحا اقتضاه طبعها لمزاج خاص فاعلم ذلك وإن لله يعم برحمته الجميع فإن رحمة الله سبقت غضبه لما تجاريا إلى الإنسان‏\n\n\n### [أن الجود الإلهي لا يزال يمتن على الأعيان بالإيجاد]\n\n\nواعلم أن الله تعالى لم يزل ناظرا إلى أعيان الأشياء الممكنة في حال عدمها وأن الجود الإلهي لا يزال يمتن عليها بالإيجاد على ما سبق العلم به من تقدم بعضها على بعض في الوجود بالإيجاد ولما كان ما به بقاء عين الجوهر الكل لا يتمكن إلا بقيام بعض الممكنات به مما لا يقوم بنفسه منها لم يزل الحفظ الإلهي يحفظ عليها بقاءها به وهي في ذاتها لا تقبل البقاء إلا زمان وجودها فلا يزال الجود الإلهي يوجد لهذا الجوهر الكل الذي فتح الله\n\n\nفيه صور العالم ما به بقاؤه من الممكنات الشرطية فلا يزال الله خالقا على الدوام حافظا له على الدوام وكذلك سبحانه وتعالى لو لا أنه أسرى بسر الحياة في الموجودات ما كانت ناطقة ولو لا سريان العلم فيها ما كانت ناطقة بالثناء على الله موجدها ولهذا قال وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ فأتى بلفظ النكرة وما خص شيئا ثابتا من شي‏ء موجود لأنها قبلت شيئية الوجود على الحال التي كانت عليها في شيئية الثبوت وقد أعلمنا الله أنه خاطبها في حال عدمها وإنها امتثلت أمره عند توجه الخطاب فبادرت إلى امتثال ما أمرها به فلو لا أنها منعوتة في حال عدمها بالنعوت التي لها في حال وجودها ما وصفها الحق بما وصفها به من ذلك وهو الصادق المخبر بحقائق الأشياء على ما هي عليه فما ظهرت أعيان الموجودات إلا بالحال التي كانت عليها في حال العدم فما استفادت إلا الوجود من حيث أعيانها ومن حيث ما به بقاؤها فكل ما هي عليه الأعيان القائمة بأنفسها ذاتي لها وإن تغيرت عليها الأعراض بالأمثال والأضداد إلا إن حكمها في حال عدمها ليس حكمها في حال وجودها من حيث أمر ما وذلك لأن حكمها في حال عدمها ذاتي لها ليس للحق فيها حكم ولو كان لم يكن لها العدم صفة ذاتية فلا تزال الممكنات في حال عدمها ناظرة إلى الحق بما هي عليه من الأحوال لا يتبدل عليها حال حتى تتصف بالوجود فتتغير عليها الأحوال للعدم الذي يسرع إلى ما به بقاء العين وليست كذلك في حال العدم فإنه لا يتغير عليها شي‏ء في حال العدم بل الأمر الذي هي عليه في نفسها ثابت إذ لو زال لم تزل إلا إلى الوجود ولا يزول إلى الوجود إلا إذا اتصف العين القائم به هذا الممكن الخاص بالوجود فالأمر بين وجود وعدم في أعيان ثابتة على أحوال خاصة فإذا حققت هذا الذي أبرزناه إليك علمت الخلق والخالق وما ينبغي للخلق أن تكون عليه من الحكم وما ينبغي للخالق أن يوصف به فإنه ليس كمثله شي‏ء وكُلَّ يَوْمٍ هُوَ في شَأْنٍ فلا يشبهه شي‏ء ثابت ولا شي‏ء موجود وما وقفت على ما وقفت عليه من هذا العلم الذي أداني شهوده وحكمه إلى البقاء معه وإلى أن الزهد في الأشياء لا يقع إلا من الجهل القائم بهذا الزاهد وهو عدم العلم ومن الغطاء الحجابي الذي على عينه وهو عدم‏\nالكشف والشهود لما ذكرناه فإذا علم أو شاهد أن العالم كله ناطق بتسبيح خالقه والثناء عليه وهو في حال الشهود له كيف يتمكن له الزهد فيمن هذه صفته وعينه وذاته وصفاته من جملة العالم وقد أشهده الله وأراه آياته في الآفاق وهي ما خرج عنه وفي نفسه وهي ما هو عليه فلو خرج عن غيره ما خرج عن نفسه فمن خرج عن العالم وعن نفسه فقد خرج عن الحق ومن خرج عن الحق فقد خرج عن الإمكان والتحق بالمحال ومن حقيقته الإمكان لا يلحق بالمحال إذن فدعواه بأنه خرج عن كل ما سوى الله جهل محض وإنما ذلك انتقال أحوال لا يشعر بها لجهله فيخيل له جهله أن العالم بمعزل عن الله والله بمعزل عن العالم فيطلب الفرار إليه فهذا فرار وهمي وسبب ذلك عدم الذوق للأشياء وكونه سمع في التلاوة فَفِرُّوا إِلَى الله وهو صحيح إلا إن هذا الفار بهذه المثابة لم يجعل باله إلى ما ذكر الله في الآية التي أتبعها هذه الآية وهي قوله ولا تَجْعَلُوا مَعَ الله إِلهاً آخَرَ فلو عرف هذا التتميم عرف قوله فَفِرُّوا إِلَى الله إنه الفرار من الجهل إلى العلم وأن الأمر واحد أحدي وأن الذي كان يتوهمه أمرا وجوديا من نسبة الألوهة لهذا الذي اتخذه إلها محال عدمي لا ممكن ولا واجب فهذا معنى الفرار المأمور به فإليه من حيث نسبة الألوهة إليه يكون الفرار فافهم وأما الفرار الثاني المتلو فقوله عن موسى عليه السلام فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ لما علم إن الله وضع الأسباب وجعل لها أثرا في العالم بما يوافق الأغراض وبما لا يوافقها وبما يلائم الطبع وبما لا يلائمه وخلق الحيوان على مزاج يقبل به الألم واللذة بخلاف النبات والجماد فإنهما وإن اتصفا بالحياة عند أهل الكشف فإنهما على مزاج لا يقبل اللذة والألم ووقع من موسى عليه السلام ما وقع من قتل القبطي ففر إلى النجاة التي يمكن أن تحصل له بالفرار فرأى إن الفرار من الأسباب الإلهية الموضوعة في بعض المواطن لوجود النجاة فهو فرار طبيعي لأنه ذكر أن الخوف من السبب جعله يفر لكنه معرى عن التعريف بما ذكرناه من الوضع الإلهي فلم يوف النظر العقلي حقه فإن هذا كان قبل نبوته ومعرفته بما يريده الحق به فلما فر خوفا من فرعون تلقاه الحق بالنجاة وجمع بينه وبين رسول من رسله وهو شعيب عليه السلام ثم أعطاه النبوة والحكم الذي خاطب الله به القبط وبنى إسرائيل إن يكونوا عليه وأرسله بذلك إلى من خاف منه فكان ذلك الإرسال كالعقوبة لما لحقه من الخوف من السبب الموضوع ولم يوف السبب الموضوع حقه أعني النظر العقلي فكان ينبهه في الفرار أنه خوف من الله إذ لا قدرة مؤثرة للممكن في إيصال خير أو شر إلى ممكن آخر وإن ذلك كله بيد الله فجاءه بالرسالة والحكم من عند الله وأمنه بما أعطاه الله من العلم بما يؤول إليه أمره مع فرعون وآله وأراه إذ كلمه ما أراه من قلب العصا حية وإنما قلنا عقوبة كان ذلك الإرسال إلى فرعون وإن الخوف معه باق منه لقوله تعالى له ولأخيه حين قالا إِنَّنا نَخافُ أَنْ يَفْرُطَ عَلَيْنا أَوْ أَنْ يَطْغى‏ فقال الله لا تَخافا إِنَّنِي مَعَكُما أَسْمَعُ وأَرى‏ وقال لهما فَقُولا لَهُ قَوْلًا لَيِّناً لَعَلَّهُ يَتَذَكَّرُ ما نسي مما كان قد علم من امتناننا عليه أَوْ يَخْشى‏ يقول أو يخاف مما يعرفه من أخذنا وبطشنا الشديد بمن قال مثل مقالته ممن تقدمه وحصل عنده العلم به وهذا مثل قوله تعالى لنبينا صَلَّى اللهُ عَليهِ وسَلَّم وجادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ وقوله تعالى فَبِما رَحْمَةٍ من الله لِنْتَ لَهُمْ ولَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا من حَوْلِكَ فَاعْفُ عَنْهُمْ واسْتَغْفِرْ لَهُمْ وشاوِرْهُمْ في الْأَمْرِ فهذا جدال في الله لين مأمور به وتعطف والترجي من الله إذا ورد واقع بلا شك ولهذا قال العلماء إن كلمة عسى من الله واجبة وقد ترجى من فرعون التذكر والخشية فلا بد أن يتذكر فرعون ذلك في نفسه وأن يخشى ولكن لم يظهر من ذلك شيئا على ظاهره وإن كان قد حكم التذكر والخشية على باطنه ولذلك لم يبطش بموسى ولا بأخيه في المجلس فإنه صاحب السلطان والقهر في‏\n\n\nذلك الوقت فما منعه إلا ما قام به من التذكر والخشية من الحق ومانع آخر فلم يكن هناك إذ لو كان هناك مانع آخر ظاهر يلجأ إليه موسى عليه السلام ما قال إِنَّنا نَخافُ أَنْ يَفْرُطَ عَلَيْنا أَوْ أَنْ يَطْغى‏ لعدم التكافؤ في القوة الظاهرة فأيده بما أوصاهما به من القول باللين فكانت هذه المخاطبة من جنود الله قابل بها جنود باطن فرعون فهزمهم بإذن الله فتذكر وخشي لما انهزم جيشه الذي كان يتقوى به فذل في نفسه فشغلته تلك الذلة والمعرفة عن إن يحكم بقوة ظاهرة فلم يبطش بهما في ذلك المجلس فهذه فائدة العلم فإن العلم إذا لم يتمر لصاحبه ما تعطيه حقيقته فما ثم علم أصلا ولا ذلك عالم وقد تقدم الكلام في مثل هذا فيما مضى من المنازل فالناس يأخذون بهذا الفرار الموسوي ولا يعرفون حقيقة ما أخذوا به ولا\nنظروا في ذلك هذا النظر الذي ذكرناه وإذا علمت هذا\n\n\n### [أن الله ما خلق الإنسان عالما بكل شي‏ء]\n\n\nفاعلم أيضا أن الله ما خلق الإنسان عالما بكل شي‏ء بل أمر نبيه صَلَّى اللهُ عَليهِ وسَلَّم أن يطلب منه تعالى مزيد علم إذ قال له وقُلْ رَبِّ زِدْنِي عِلْماً فهو في كل حال يستفيد من العلم ما به سعادته وكماله فالذي فطر عليه العالم والإنسان من العلم العلم بوجود الله والعلم بفقر المحدث إليه فإذا كان هذا فلا بد لكل من هذه صفته أن يفر إلى الله لمشاهدة فقره وما يعطيه حكم الفقر من الألم للنفس ليغنيه من انقطع إليه فربما يزيل عنه ألم الفقر بما به تقع اللذة له وهو الغني بالله وهو مطلب لا يصح حصوله أصلا لأنه لو استغنى أحد بالله لاستغنى عن الله والاستغناء عن الله محال فالاستغناء بالله محال لكن الله يعطيه أمرا ما من الأمور التي يحدثها الله فيه عند هذا الطلب يغنيه به ويزيل عنه ما يجده من اللذة ألم ذلك الفقر المعين لا يزيل عنه ألم الفقر الكلي الذي لا يمكن زواله عن الممكن لأن الفقر له وصف ذاتي لا في حال عدم ولا في حال وجود ولهذا لم يجعل في نفس الممكن إلا ما إذا أعطاه ذلك وجد عنده لذة مزيلة ألم الطلب ثم يحدث له طلب آخر لأمر آخر أو لبقاء ذلك الحاصل له على الدوام دنيا وآخرة فلا بد لمن هذه حاله من تخل وفرار عن الأمور الشاغلة له عن هذا الأمر حتى يكشف الله عن بصيرته وبصره فيشاهد الأمر على ما هو عليه فيعلم عند ذلك كيف يطلب وممن يطلب ومن يطلب وأمثال هذا ويعلم معنى قوله إِنَّ الله هُوَ الْغَنِيُّ الْحَمِيدُ أي المثنى عليه بالغنى وتدبر قوله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ لأنه يستحيل عليه إن يعبد نفسه ولما قلناه أتى بالحميد لأن صفة الغني لا شي‏ء أعلى منها وهي صفة ذاتية للحق تعالى فافهم الإشارة فالعبارة هنا حرام وإذا تقرر هذا علمت كون رسول الله صَلَّى اللهُ عَليهِ وسَلَّم كان يخلو بغار حرا ليتحنث فيه ويفر من مشاهدة الناس لما كان يجده في نفسه من الحرج والضيق في مشاهدتهم فلو نظر إلى وجه الحق فيهم ما فر منهم ولا كان يخلو بنفسه وما زال على هذه الحال حتى فجئه الحق فرجع إلى الخلق ولم يزل فيهم فإنه لم يزل في غار حرا مع نفسه فما زال إلا من بعض الناس لا من كل الناس فافهم فلا بد لكل طالب ربه أن يخلو بنفسه مع ربه في سره لأن الله ما جعل للإنسان ظاهرا وباطنا إلا ليخلو مع الله في باطنه ويشاهده في ظاهره في أسبابه بعد أن ينظر إليه في باطنه حتى يميزه في عين الأسباب وإلا فلا يعرفه أبدا فما يرجع من يرجع إلى الخلوة مع الله في باطنه إلا لأجل هذا فباطن الإنسان بيت خلوته لو عقل عن الله فلما علمت في أول الأمر إن الشأن على ما ذكرته تجردت عن هيكلي هذا تجردا علميا حاليا لجهلي بمكانة الحق من هذا الهيكل وعدم علمي بأن لله وجها خاصا في كل شي‏ء فلما صرت عن هذا الهيكل أجنبيا نظرت إليه كأنه سبجة سوداء مظلم الأقطار لم أر فيه من النور شيئا فسألت عن هذه الظلمة من أين لحقت فقيل لي هذه ظلمة الطبيعة فإن الظلمات ثلاث تراكم بعضها على بعض حتى إذا أخرج أحد يده لم يكد يراها فأحرى إن لا يراها فنفى مقاربة الرؤية فكيف الرؤية فالظلمة حجاب إلهي يحجب عن وجود الحق فقلت ما هذه الظلمات الثلاث فقيل لي الظلمة الأولى المشهودة لك ظلمة الطبيعة فهي الطبقة الأولى التي تلي بصرك ثم إن هذه الطبيعة ما وجدت إلا في المرتبة الثالثة ففوقها ظلمة السبب الحادث الممكن التي وجدت عنها فهي وجود محدث عن محدث وهي النفس فهي الظلمة الثانية فاشتد ظلام الطبيعة وتضاعف بظلمة النفس فأشهدت النفس فرأيت ظلمة فوق ظلمة ثم قيل لي فوق هذه الظلمة الثانية ظلمة ثالثة وهي السبب الذي وجدت عنه هذه النفس وهو العقل الأول فكشف لي عنه فرأيت ظلاما متراكما بعضه فوق بعض فقلت أ فلهذا سبب آخر وجد عنه فقيل لي لا بل هذا أوجده الحق لا عند سبب فقلت فما باله مظلما فقيل لي هذه الظلمة له ذاتية وهي ظلمة\n\n\nإمكانه يستمدها من ظلمة الغيب الذي لا يقع عليه شهود كما يقع على المغيب فيه إذا ظهر منه وفارقه وصار شهادة فعن هذه الظلمات الثلاث كان الإنسان من حيث‏\n\n\nهو جسم حيواني في بطن أمه في ظلمات ثلاث ظلمة الرحم وظلمة المشيمة وظلمة البطن فإذا ولد اندرجت ظلمته فيه فكان ظاهره نورا وباطنه ظلمة فلا يتمكن له المشي في ظلمة باطنه إلا بسراج العلم إن لم يكن له هذا السراج فإنه لا يهتدي فيها فلما رأيت هيكلي وظلمته علمت أنه لو لم يكن له نور بوجه ما ما صح نظري إليه ولا إدراكي إياه فسألت عن النور الذي أعده لتعلق رؤيتى به فقيل لي نور الوجود به رأيته فنظرت إلي من حيث إني رائي لتلك الظلمة فرأيت ظلها ينبسط علي وما رأيت نوري يزيلها فتعجبت فقيل لي لا يزول عنك ظلام إمكانك فإنه نعت ذاتي لك فإنك لست‏\nبواجب الوجود لذاتك فقلت فمن لي بنور لا ظلمة فيه قيل لي لا تجده أبدا فقلت إذا فلا أشاهد موجدي أبدا فإنه النور المحض والوجود الخالص فقيل لي لا تشاهده أبدا إلا منك ولهذا لا تراه أبدا في صورة واحدة فلا تحيط به علما فلا يتحلى ولا يشهد كما يشهد نفسه فإنه غني عن العالمين فما يستدل عليه إلا به فلا يعرف إلا من طريق الكشف والشهود على حد ما ذكرناه وأما بالأدلة النظرية فلا يعلم إلا حكمه لا عينه فلهذا يحكم العقل بدليله على ما يستلزمه هذا الموجود الواجب الوجود مما يفتقر الممكن إليه فيه فهذا القدر يدل عليه ويعطيه الشهود رتبة فوق هذا تذاق ولا تنقال ولا تنحكى فلما أشهدني الله ذاتي وأشهدني هيكلي أشهدني بعد هذا نسبة العالم كله إلي وتوجهه علي في إيجاد عيني فرأيت تقدمه علي وآثاره في وعلمت انفعالي عنه وأنه لولاه ما كان لي وجود عيني فذللت في نفسي حيث أنا تحت قهر ممكن مثلي وعلمت عند ذلك أني من القليل الذين يعلمون أن خلق السموات وهي الأسباب العلوية لوجودي والأرض وهي الأسباب السفلية لوجودي أكبر من خلق الناس قدرا لأن لها نسبة الفاعلية وللناس نسبة الانفعال فأدركني انكسار يكاد أن يؤيسني عن مشاهدة الحق من حيث ما تشهده هذه الأسباب التي لها علي في القدر شفوف الفاعلات فلما حصل عندي ذلك الانكسار قيل لي هذه الأسباب وإن كان لها هذا القدر عليك في المرتبة فيما ظهر فاعلم إنك العين المقصودة فما وجدت هذه الأسباب إلا بسببك لتظهر أنت فما كانت مطلوبة لأنفسها فإن الله لما أحب أن يعرف لم يمكن أن يعرفه إلا من هو على صورته وما أوجد الله على صورته أحدا إلا الإنسان الكامل لا الإنسان الحيوان فإذا حصل حصلت المعرفة المطلوبة فأوجد ما أوجد من الأسباب لظهور عين الإنسان الكامل فاعلم ذلك فجبر هذا التعريف الإلهي انكساري وعلمت أني من الكمل وأني لست بإنسان حيوان فقط فشكرت الله على هذه المنة فلما أشهدني نسبة العالم إلي ونسبتي إلى العالم وميزت بين المرتبتين وعلمت إن العالم كله لو لا أنا ما وجد وأنه بوجودي صح المقصود من العلم الحادث بالله والوجود الحادث الذي هو على صورة الوجود القديم وعلمت إن العلم بالله المحدث الذي هو على صورة العلم بالله القديم لا يتمكن أن يكون إلا لمن هو في خلقه على الصورة وليس غير الإنسان الكامل ولهذا سمي كاملا وأنه روح العالم والعالم المسخر له علوه وسفله وإن الإنسان الحيواني من جملة العالم المسخر له وإنه يشبه الإنسان الكامل في الصورة الظاهرة لا في الباطن من حيث الرتبة كما يشبه القرد الإنسان في جميع أعضائه الظاهرة فتأمل درجة الإنسان الحيوان من درجة الإنسان الكامل‏\n\n\n### [إن الإنسان على استعداد قبول الكمال‏]\n\n\nواعلم من أي الأناسي أنت فإنك على استعداد قبول الكمال لو عقلت ولهذا تعين التنبيه والإعلام من العالم فلو لم تكن على استعداد يقبل الكمال لم يصح التنبيه ولكان التعريف بذلك عبثا وباطلا فلا تلومن إلا نفسك في عدم القبول لما دعيت إليه فإن الداعي ما دعا إلا على بصيرة ليلحقك بذاته في البصيرة فإذا علمت هذا وأشهدك الحق نسبة العالم إليك بقي عليك إن تعلم نسبة الحق إليك ونسبتك إليه فأوقفني الحق على نسبة الأسماء الإلهية إلي لتحصل لي الصورة المقصودة فتنطلق على جميع الأسماء الإلهية التي تنطلق عليه تعالى لا يفوتني منها اسم بوجه من الوجوه‏\n\n\n### [إن الاسم يدل على المسمى بحكم المطابقة]\n\n\nفاعلم إن الاسم لما كان يدل على المسمى بحكم المطابقة فلا يفهم منه غير مسماه كان عينه في صورة أخرى تسمى اسما فالاسم اسم له ولمسماه وأراد الله سبحانه أن يعرف كما قررناه بالمعرفة الحادثة لتكمل مراتب المعرفة ويكمل الوجود بوجود المحدث ولا يمكن أن يعرف الشي‏ء إلا نفسه أو مثله فلا بد أن يكون الموجود الحادث الذي يوجده الله للعلم به على صورة موجدة حتى يكون كالمثل له فإن الإنسان الكامل حقيقة واحدة ولو كان بالشخص ما كان مما زاد على الواحد فهو عين واحدة وقال فيه ليس كمثله شي‏ء فجعله مثلا ونفى أن يماثل فلما نصبه في الوجود مثلا تجارت إليه الأسماء الإلهية بحكم المطابقة من حيث ما هي الأسماء ذات صور وحروف لفظية ورقمية كما إن الإنسان ذو صورة جسمية فكانت هذه الأسماء الإلهية على هذا الإنسان الكامل أشد مطابقة منها على المسمى الله ولما كان المثل عن مثله متميزا بأمر ما لا يتمكن أن يكون ذلك الأمر إلا له ولا يكون لمثله كان الأمر في الأسماء التي يتميز المثل عن مثله به ولا يشاركه فيه من جانب الحق الاسم الله فعين ما اختص به المثل عن مثله وكان للمثل الآخر الاسم الإنسان الكامل الخليفة مما اختص به هذا المثل الكوني وأسماء الحق الباقية مركبة\nمن روح وصورة فمن حيث صورتها تدل بحكم المطابقة على الإنسان ومن حيث روحها ومعناها تدل بحكم المطابقة على الله ولنا حالة وله حالة والأسماء تتبع تلك الأحوال فلنا التجريد عن الصور متى شئنا فالذي لنا من ذاتنا الصور ولكن من حقيقة ذاتنا أيضا التجرد عنها متى شئنا فتتبعنا الأسماء في حال تجريدنا من حيث أرواحها المجردة عن صورها وله التباس بالصور وهو بالذات غير صورة وبالذات أيضا يقبل التجلي لنا في الصور فتتبعه الأسماء عينها من حيث صورها إذا لبس الصورة متى شاء فالأمر بيننا وبينه على السواء مع الفرقان الموجود المحقق بأنه الخالق ونحن المخلوقون وهو الله وأنا الإنسان الخليفة فيشركنا في الخلافة لتحقق الصورة فإنه أمرنا أن تتخذه وكيلا والوكالة خلافة فالمختص به الذي يتميز به عني الاسم الله صورة ومعنى فإذا تجلى في الصورة انطلق عليه بحكم المطابقة صورة الاسم الله وإذا بقي على ما هو عليه من غير تقييد بصورة انطلق عليه روح الاسم الله وكذلك الإنسان هذا الاسم هو الذي يميزه عنه وله حالة البقاء على ما هي ذاته عليه من الصورة وله التجريد ولو لم يكن في العالم من هو على صورة الحق ما حصل المقصود من العلم بالحق أعني العلم الحادث في‏\n\n\nقوله كنت كنزا لم أعرف فأحببت إن أعرف فخلقت الخلق وتعرفت إليهم فعرفوني‏\n\n\nفجعل نفسه كنزا والكنز لا يكون إلا مكتنزا في شي‏ء فلم يكن كنز الحق نفسه إلا في صورة الإنسان الكامل في شيئيته وثبوته هناك كان الحق مكنوزا فلما كسا الحق الإنسان ثوب شيئية الوجود ظهر الكنز بظهوره فعرفه الإنسان الكامل بوجوده وعلم أنه كان مكنوزا فيه في شيئية ثبوته وهو لا يشعر به فهذا قد أعلمتك بنسبة الأسماء إليه قال تعالى وعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها ولفظة كل تقتضي الإحاطة والعموم وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في دعائه ربه اللهم إني أسألك بكل اسم سميت به نفسك‏\n\n\nفهذه إضافة حقيقية وهي إضافة الشي‏ء إلى نفسه لما ذكر لفظين مختلفين صحت الإضافة كحق اليقين وعلم اليقين والعين واحدة وهي لفظة النفس وكاف الخطاب وإنما قلنا هذا من أجل أصحاب اللسان حيث قالوا من طريق الأدلة إن الشي‏ء لا يضاف إلى نفسه وهو قول صحيح غير إن الإضافة هنا وقعت في الصورة والصورة صورتان فجاز إن تضاف الصورة الواحدة إلى الأخرى وهي النفس وكاف الخطاب وكحق اليقين وعلم اليقين وعين اليقين والوجه الآخر أن تكون النفس نفس الإنسان الكامل القابلة لجميع الأسماء الإلهية والكونية فإن الأسماء الكونية أيضا تدل بحكم المطابقة عليه إلا ما يختص به منها المحدث كالغنى لله والفقر للإنسان بل للعالم كله فتكون النفس هنا مضافة إلى كاف الخطاب وهو الحق وتكون إضافة ملك وتشريف واستحقاق فإضافة الملك كمثل مال زيد وإضافة تشريف كمثل عبد الملك وخديمه وإضافة الاستحقاق كسرج الدابة وباب البيت وهذه كلها سائغة في قوله نفسك إذا عني بها الإنسان مثل قول عيسى عليه السلام ولا أَعْلَمُ ما في نَفْسِكَ يعني بهذه النفس هنا نفس عيسى أضافها إلى الحق كما هي في نفس الأمر وهو أتم في الثناء على الله والتبري مما نسب إليه وقرر عليه واستفهم عنه من قوله أَ أَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وأُمِّي إِلهَيْنِ من دُونِ الله فقال له أنت تَعْلَمُ ما في نَفْسِي ولا أعلم ما فيها إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ فإنه ما يكون فيها إلا ما تجعله أنت فكيف يستفهم من لَهُ الْخَلْقُ والْأَمْرُ ولم يقل له ما قلت إني إله لعلمه بأنه خليفة وإنسان كامل وأن الأسماء الإلهية له فقال له ما قُلْتُ لَهُمْ إِلَّا ما أَمَرْتَنِي به ما زدت على ذلك شيئا وإذا قال القائل ما أمر به أن يقوله لم يلزم أن يقول كل ما هو عليه فإنه ما أمر أن يقوله وقد خرج عن العهدة بما بلغ وقال صَلَّى اللهُ عَليهِ وسَلَّم أو علمته أحدا من خلقك أو استأثرت به في علم غيبك‏\n\n\nفذكر أنه تعالى استأثر بشي‏ء في علم غيبه مما لا يعلمه إلا هو وليس إلا ما يمكن أن يكون للإنسان الكامل لكن الله تعالى استأثر به في علم غيبه ما لا يعلمه إلا هو فعلم من الإنسان مما هو عليه ما لا يعلمه الإنسان الكامل من نفسه فهو غيب الحق لأنه المثل فاجتمع قول محمد صَلَّى اللهُ عَليهِ وسَلَّم وقول عيسى عليه السلام في أمر واحد وهو قوله ولا أَعْلَمُ ما في نَفْسِكَ وقول محمد صَلَّى اللهُ عَليهِ وسَلَّم أو استأثرت به في علم غيبك‏\n\n\nفالإنسان الكامل محل الأسماء كلها التي في قوته قبولها وما ليس في قوته قبولها فلا يتمكن له قبولها فليس ذلك من الأسماء التي يقال فيها إنه نقص عنها كالاسماء التي يختص بها الإنسان ولا يجوز أن تطلق على الله‏\nولا يقال إن الله قد نقصه هذا الاسم أن يطلق عليه فمعنى الأسماء كلها كل اسم في حقيقة هذا المسمى أن يقبله فاعلم ذلك فمن علم نسبة الأسماء الإلهية إلى الإنسان كيف هي ونسبة الأسماء الكونية إلى الله كيف هي علم مرتبة الإنسان وتميزه عن العالم كله وشرفه بما هو عليه من الجمعية كالمتفنن صاحب الذوق في كل علم وقد يكون صاحب علم ما أكمل منه في ذلك العلم مع المشاركة فهو أفضل منه في وجه خاص وهذا أفضل منه بالجمعية كما نقول بالمفاضلة في النقص فنقول في البليد إنه حمار ومعلوم قطعا إن الحمار أفضل من الإنسان في البلادة فإنه أبلد منه وكذلك الملك مع الإنسان الملك أفضل منه في الطاعة وقد شهد الله له بذلك وذلك لتعريه عن لباس البشرية فلا يعصي الله ما أمره لأنه ما هو على حقائق متضادة تجذبه في أوقات وتغفله وتنسيه عما دعي إليه كما يوجد ذلك في النشأة العنصرية والإنسان نشأة عنصرية تطلبه حقائق متجاذبة بالفعل صاحب غفلة ونسيان يؤمر وينهى فيتصور منه المخالفة والموافقة فالملك أشد موافقة لله من الإنسان لما تعطيه نشأته ونشأة الإنسان قال تعالى في الملك لا يَعْصُونَ الله ما أَمَرَهُمْ وقال في الخليفة الذي علمهم الأسماء وعَصى‏ آدَمُ رَبَّهُ فَغَوى‏ فوصفه بالمعصية فالملك أفضل في الموافقة لأمر الله والخليفة الإنسان اعلم بالأسماء الإلهية لأن الخليفة إن لم يظهر بما يستحقه من استخلفه حتى يطاع ويعصى وإلا فليس بخليفة فهو أتم في الجمعية وأفضل والملك أفضل في وجه خاص أو وجهين لكن ما له فضل الجمع والصورة لا تكون إلا بالمجموع وإلا فليست بصورة مثلية ولا يقدح في الصورة وكمالها ما تمتاز به الصورة على مثلها فإنه لا بد من ذلك ولو لا ذلك لم تكن الصورة مثلا بل هي عينها ومعلوم أن الأمر ليس كذلك وهذا المنزل يتسع الكلام فيه يكاد إلى غير نهاية فلنقتصر على ما ذكرناه ولنذكر بعض ما يتضمنه من العلوم كما تقدم فمن ذلك علم الرسوم الطامسة ومراتبها وحصرها في الحقائق التي انحصرت فيها وفيه علم من رد أمره فكاد إن يقتل نفسه وهو دليل على الضيق والحرج وهل هذا من كمال الإنسان أم لا فإن الله وصف نفسه بالغضب والانتقام فهذا الإنسان لما لم يتمكن له من قوته إن يجد على من يرسل غضبه بالانتقام منه أراد أن يرسله على نفسه فيقتل نفسه فهو ناقص كامل فأعطاه الله الصبر على حمل الأذى فقاوم به ما يجده الطبع من الغيظ على من يرد كلمته وأمره ويريد مقاومته وفيه علم التسكين ووجود الفرح بالمستند إليه إذا تنزل له في الخطاب على سبيل الرفق به لما يجده وهو أن يخاطبه بما يعرفه به في نفسه في الأمر الذي غاظه فيريه من هو أكبر منه قد أغيظ فيجد لذلك عزا في نفسه ولهذا قال الله تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم نَقُصُّ عَلَيْكَ من أَنْباءِ الرُّسُلِ ما نُثَبِّتُ به فُؤادَكَ وفيه علم كل من جنى فعلى نفسه يجني فإن الأعمال لا تضاف إلا إلى عاملها وإن أضيفت إلى غير عاملها فقد غصبتها حقها وفيه علم الإستبصار وفيه علم الأمزجة فيعلم منه ما يضر زيدا ينفع عمرا وما هو دواء لخالد هو داء لحسن وفيه علم نداء الحق واختلافه مع أحدية النداء وفيه علم آداب جواب المنادي وفيه علم الاستنزال باللطف وفيه علم الجبر وفيه علم التقرير الكوني ونزول الأعلى إلى مخاطبة الأدنى باللطف مع قهره بالصورة فما المانع له من ذلك هل هو قهر خفي من حيث لا يشعر به أو هو عن رحمة هو عليها مجعولة أو جبلية وفيه علم تنبيه العالم على اكتساب معالي الأمور بإظهار أسبابها لمن لا يعرفها وفيه علم أسباب الحيرة عن جواب السائلين إذا كان السؤال مما لا يتصور عليه الجواب المطابق الذي يطلبه السائل في سؤاله وهل كل سؤال يقتضي جوابا أم لا والسؤال عين الجواب من حيث أحدية الكلام والواحد لا يقع فيه التفصيل ولا الانقسام والسؤال ما هو عين الجواب والكلام أحدي العين فأين محل الانقسام وفيه علم الجدل مع العلم من المجادل أنه مبطل وأن خصمه على الحق فلما ذا يبقى على جدله وقد بان له الحق في نفسه فهل له‏\n\n\nوجه ما لي الحق أو هو باطل من جميع الوجوه وإذا كان باطلا من جميع الوجوه فالباطل عدم والعدم لا يقاوم الوجود فإن لا شي‏ء لا يكون أقوى من الشي‏ء وفيه علم ما تنتجه المساعدة وفيه علم الزجر والتخويف والرضاء بالقضاء والمقضي معا للقوة التي تكون في الراضي وما ينبغي أن يرضى به من المقضي وما لا ينبغي أن يرضى به من ذلك وفيه علم ما يؤثره الاستناد إلى الكثرة من القوة في نفس المستند وإن خاب فقد يرزق الواحد من القوة ما يزيد على‏\nقوة الكثير فلا يقاومه الكثير وفيه علم تأثير الكون في الكون هل يفتقر إلى أمر إلهي أو إلى العلم أو منه ما يكون عن علم ومنه ما يكون عن أمر إلهي ومراتب الخلق في ذلك وفيه علم سرد الأخبار وما فائدتها الزائدة على تأنيس النفوس بها فإن النفوس تستحلي الأحاديث بطبعها وفيه علم تفاضل العالم في العلم وفيه علم ما ينبغي أن يضاف إلى الحق من الأمور وما لا ينبغي وإن كان له وفيه علم عزة النفس أن يلحق بها المذام مع كونها متصفة بها فما الذي يحجبها حتى تتصف بالمذام ولا تحب أن توصف بها وفيه علم مفاضلة النفوس بعضها بعضا على الإطلاق وفيه علم سبب دوام النعم وعدم دوام نقيضه بها وفيه علم المدد ولما ذا يرجع انتهاؤها فيما يوصف منها بالانتهاء هل هو للفعل الموجود فيها أو هل هو لأمر آخر وفيه علم تقاسيم الزمان إلى أزمنة وهو عين واحدة وفيه علم طلب الأعمال الجزاء وإن تنزه العاملون عنها وفيه علم من أعلى منزلة هل المتنزه عن طلب الأعواض أو طالب الأعواض وفيه علم بدء الرسالة في العالم ما سببه وهل في العالم من خرج عن التكليف أم لا وفيه علم ما يتميز به العالي من الأسفل هل بنفسه أو بأمر نسبي والأشرف منهما وفيه علم اختلاف الآيات لاختلاف الأعصار والأحوال وأين ذلك من العلم الإلهي وفيه علم دخول الواسع في الضيق من غير إن يتسع الضيق أو يضيق الواسع وفيه علم الفرق بين الإناث والذكور في كل صنف صنف وفيه علم من يصح عليه اسم الأخوة ممن لا يصح ومراتب الأخوة وفيه علم الموازنات الإلهية والموضوعة وفيه علم السبب الذي يقوم بالإنسان حتى يعمى قلبه عن طريق الحق مع علمه بالإمكان وهو من أعجب الأشياء مثل قول من قال اللَّهُمَّ إِنْ كانَ هذا هُوَ الْحَقَّ من عِنْدِكَ فَأَمْطِرْ عَلَيْنا حِجارَةً من السَّماءِ مع علمهم بأن ذلك ممكن ولم يوفقهم الله أن يقولوا تب علينا أو أسعدنا وفيه علم مراتب الوحي الإلهي في الإنسان وفيه علم الدلالة التي لا يمكن ردها وفيه علم الفرقان بين النظم والمنظوم والنثر والمنثور وهو علم المقيد والمطلق وفيه علم التقلب من حال إلى حال ومن منزل إلى منزل وفيه علم تنزل الأرواح النارية من أين تنزل وعلى من تنزل وأين محلها وما ينبغي أن ينسب إليها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## The Three Hundred and Fifty-Eighth Chapter: Concerning the Knowledge of the Station of Three Secrets of Differing Lights, Stability, Manifestation, and Sound Reports\n\nThe Divine Measures (المقادير) are organized weights,\nBrought forth by shadows, above which are shadows,\nFrom the clouds and from that which is not cloud,\nSeen in their miraculous nature when they descend, veiled.\nThey encompass every meaning that is not revealed\nExcept through rhetoric, poetry, and parables.\nSome of it is praiseworthy, thus ascending,\nAnd some of it is blameworthy, thus descending.\nAnd whoever disputes with me concerning what I utter,\nAll people are enemies of what they do not know.\n\n### [That the Rational Soul is Felicitous in This World and the Hereafter]\n\nKnow—may Allah grant us and you eternal felicity—that the Rational Soul (النفس الناطقة) is felicitous in this world and the Hereafter. It has no share in wretchedness, for it is not of the realm of wretchedness. However, Allah mounted it upon this bodily vehicle, which is referred to as the Animal Soul (النفس الحيوانية). The latter is like a mount for the former, and the Rational Soul is like the rider upon it.\n\nThe Rational Soul has no purpose in this animal vehicle other than to ride it upon the Straight Path (الصراط المستقيم) designated for it by The Real (الحق). If the Animal Soul complies with this, it is the docile, well-trained mount. But if it refuses, it is the refractory beast; whenever the rider attempts to turn it back to the path, it balks and bolts, turning right and left due to its stubbornness and the poor composition of its temperament (مزاجها).\n\nThe Animal Soul does not intend opposition, nor does it commit disobedience out of violation of the sanctity of the Divine Law (الشريعة). Rather, it proceeds according to its nature (طبعها), for it is unaware of the Law. It happens to be upon a temperament that does not agree with what its rider desires of it.\n\nThe Rational Soul (النفس الناطقة) is incapable of opposition because it belongs to the realm of infallibility (عالم العصمة) and the pure spirits (الأرواح الطاهرة). Therefore, when punishment occurs on the Day of Resurrection, it falls only upon the Animal Soul, just as a rider strikes his mount when it bolts and deviates from the path upon which its owner wishes to travel.\n\nDo you not see that the prescribed punishments (الحدود) for fornication, theft, highway robbery, and slander are applied only to the physical Animal Soul? It is the one that feels the pain of execution, the cutting of the hand, and the lashing of the back. Thus, the prescribed punishments are established upon the body, and the pain is borne by the sensitive Animal Soul (النفس الحساسة الحيوانية), which is the locus where all animals experience pain. There is no difference between the locus of torment in man and that in all animals, in this world or the Hereafter. The Rational Soul, due to its nobility and its realm, remains in its perpetual felicity (سعادتها الدائمة).\n\nDo you not recall that the Prophet, peace and blessings be upon him, stood up for the funeral procession of a Jew? When he was told it was the funeral of a Jew, he said, \"Is it not a soul (نفس)?\" He did not give any reason other than its essence (ذاتها), standing up in reverence for it and in exaltation of its nobility and station. How could it not possess nobility when it is breathed from the Spirit of Allah? It belongs to the nobler, angelic, spiritual realm (العالم الأشرف الملكي الروحاني), the realm of purity.\n\nThus, there is no difference between the Rational Soul with this physical Animal Soul and a rider upon a mount in form: either refractory or docile. It has become clear to you that the Rational Soul has not disobeyed; rather, the Animal Soul has not assisted it in what it requested. Furthermore, the Animal Soul was not addressed by the Divine Mandate (التكليف) so as to be described by obedience or disobedience. It simply happens that if it is refractory, this is necessitated by its nature due to a specific temperament. Know this, and know that Allah encompasses all with His Mercy, for the Mercy of Allah preceded His Wrath when they both flowed toward man.\n\n### [That Divine Generosity Continually Bestows Existence upon the Fixed Entities]\n\nKnow that Allah the Exalted has continuously looked upon the essences of possible things (أعيان الأشياء الممكنة) in their state of non-existence (عدم). Divine Generosity (الجود الإلهي) continually bestows existence (الإيجاد) upon them according to what His prior Knowledge (العلم) determined regarding the precedence of some over others in existence through creation.\n\nSince the subsistence of the Universal Substance (الجوهر الكل)—in which Allah opened the forms of the world—cannot be maintained except by the support of certain possibles that cannot subsist by themselves, Divine Preservation (الحفظ الإلهي) continuously preserves their subsistence through it. Yet, in their own essence, they do not accept subsistence except for the duration of their existence. Thus, Divine Generosity continuously brings into existence for this Universal Substance the conditional possibles (الممكنات الشرطية) by which its subsistence is maintained. Therefore, Allah is continuously Creator (خالقا على الدوام) and continuously Preserver (حافظا له على الدوام).\n\nLikewise, were it not that He, Glory be to Him, caused the secret of life (سر الحياة) to flow through all existing things, they would not be articulate. And were it not for the flow of Knowledge (العلم) within them, they would not be articulate in praising Allah, their Originator. For this reason, He said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing but glorifies Him with praise). He used the indefinite term (\"a thing\") and did not specify any fixed thing (شيئا ثابتا) from any existing thing (شي‏ء موجود), because they accepted the *thingness* (شيئية) of existence in the state they were in regarding the *thingness* of immutability (شيئية الثبوت).\n\nAllah has informed us that He addressed them in their state of non-existence, and they complied with His command when the address was directed to them, rushing to fulfill what He commanded. Were they not described in their state of non-existence by the attributes they possess in their state of existence, The Real would not have described them as He did, for He is the Truthful One who reports the realities of things as they are.\n\nThe essences of existing things (أعيان الموجودات) only appeared in the state they were in during non-existence. They gained nothing except existence, in terms of their essences, and the means by which their subsistence is maintained. Everything that the self-subsisting essences are, is essential to them, even if accidents (الأعراض) change upon them through similarities and opposites.\n\nHowever, their ruling (حكمها) in the state of non-existence is not their ruling in the state of existence in one particular respect. This is because their ruling in the state of non-existence is essential to them, and The Real has no ruling over them in that state. If He did, non-existence would not be an essential attribute for them.\n\nThe possibles (الممكنات) in their state of non-existence continuously look toward The Real according to the states they are upon, and no state changes upon them until they are qualified by existence. Then, the states change upon them due to the non-existence that quickly overtakes the means by which the essence subsists. This is not the case in the state of non-existence, for nothing changes upon them in that state. Rather, the matter they are upon in themselves is fixed, for if it were to cease, it would only cease into existence. And it only ceases into existence when the particular essence (العين القائم به) upon which this specific possible subsists is qualified by existence.\n\nThus, the matter lies between existence and non-existence in Fixed Entities (أعيان ثابتة) upon specific states. If you verify this which we have brought forth to you, you will know the creation (الخلق) and the Creator (الخالق), and what rulings are appropriate for the creation, and what attributes are appropriate for the Creator, for <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), and <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in a [new] manifestation). Nothing fixed (ثابت) or existing (موجود) resembles Him.\n\nI would not have arrived at this knowledge—the witnessing and ruling of which led me to Subsistence (البقاء) with Him—had I not realized that asceticism (الزهد) in things arises only from the ignorance (الجهل) inherent in the ascetic, which is the absence of Knowledge (العلم), and from the veiling cover (الغطاء الحجابي) over his eye, which is the absence of Unveiling (الكشف) and Witnessing (الشهود) of what we have mentioned.\n\nIf one knows or witnesses that the entire cosmos (العالم كله) is articulate in glorifying its Creator and praising Him, and he is in a state of witnessing Him, how can he possibly practice asceticism regarding that whose description and essence and self and attributes are part of the cosmos? Allah has shown him His signs in the horizons (الآفاق)—which is what is external to him—and in himself (نفسه)—which is what he is upon. If he were to depart from what is external to him, he would not depart from himself. Whoever departs from the world and from himself has departed from The Real (الحق). And whoever departs from The Real has departed from possibility (الإمكان) and joined the impossible (المحال). Since his reality is possibility, he cannot join the impossible.\n\nTherefore, his claim that he has departed from everything other than Allah is pure ignorance. That is merely a transition of states (انتقال أحوال) that he does not perceive due to his ignorance. His ignorance makes him imagine that the world is separate from Allah and Allah is separate from the world, so he seeks flight (الفرار) to Him. This is an imaginary flight.\n\nThe cause of this is the absence of direct experience (الذوق) of things, and his having heard the recitation: <<فَفِرُّوا إِلَى اللهِ>> (So flee to Allah). This is true, but this fugitive did not pay attention to what Allah mentioned in the verse that followed this one, which is His saying: <<وَلَا تَجْعَلُوا مَعَ اللهِ إِلَهاً آخَرَ>> (And do not set up with Allah another god). If he had known this completion, he would have understood His saying, \"So flee to Allah,\" to mean the flight from ignorance to Knowledge, and that the matter is One and Unique (واحد أحدي), and that what he used to imagine as an existent matter—the attribution of divinity (الألوهة) to that which he took as a god—is an impossible non-existent (محال عدمي), neither possible nor necessary. This is the meaning of the commanded flight. The flight is *to* Him, away from the attribution of divinity to anything else. Understand this.\n\nAs for the second type of flight mentioned, it is the saying of Moses, peace be upon him: <<فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ>> (So I fled from you when I feared you). This occurred because he knew that Allah established causes (الأسباب) and gave them an effect in the world, whether agreeing with purposes or not, and whether conforming to nature or not. He created the animal upon a temperament that accepts pain and pleasure, unlike plants and inanimate objects, which, although they possess life according to the people of Unveiling (أهل الكشف), are upon a temperament that does not accept pleasure and pain.\n\nWhat happened to Moses—the killing of the Copt—occurred, so he fled seeking the salvation that could be achieved through flight. He saw that flight was one of the Divine Causes established in certain situations for the attainment of salvation. Thus, it was a natural flight, for he mentioned that fear of the cause made him flee. However, this flight was devoid of the realization of the Divine establishment of causes that we mentioned. He did not give the intellectual consideration (النظر العقلي) its due right, for this was before his prophethood and his knowledge of what The Real desired of him.\n\nWhen he fled out of fear of Pharaoh, The Real met him with salvation and brought him together with one of His Messengers, Shu'ayb, peace be upon him. Then He granted him prophethood and the ruling (الحكم) with which Allah addressed the Copts and the Children of Israel, and He sent him with that to the very one he had feared. That sending was like a punishment for the fear he experienced regarding the established cause, as he did not give the established cause its due right—meaning, intellectual consideration. This consideration should have alerted him during his flight that his fear was ultimately of Allah, since no possible thing has effective power to deliver good or evil to another possible thing; all of that is in the Hand of Allah.\n\nSo, He came to him with the Message and the Ruling from Allah and secured him with the Knowledge Allah gave him concerning the outcome of his affair with Pharaoh and his people. When He spoke to him, He showed him the turning of the staff into a serpent. We said that the sending to Pharaoh was a punishment because the fear remained with him, as evidenced by His saying to him and his brother when they said: <<إِنَّنَا نَخَافُ أَنْ يَفْرُطَ عَلَيْنَا أَوْ أَنْ يَطْغَىٰ>> (Indeed, we fear that he may hasten [punishment] upon us or that he may transgress). Allah said: <<لَا تَخَافَا إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ>> (Fear not. Indeed, I am with you both; I hear and I see). And He said to them: <<فَقُولَا لَهُ قَوْلًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ>> (So speak to him with gentle speech, perhaps he may remember) what he had forgotten concerning Our favor upon him, <<أَوْ يَخْشَىٰ>> (or fear), meaning, or fear what he knows of Our seizing and severe grip upon those who spoke like him among those who preceded him, of which he had knowledge.\n\nThis is similar to the saying of Allah to our Prophet, peace and blessings be upon him: <<وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ>> (And argue with them in a way that is best). And His saying: <<فَبِمَا رَحْمَةٍ مِنَ اللَّهِ لِنْتَ لَهُمْ وَلَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا مِنْ حَوْلِكَ فَاعْفُ عَنْهُمْ وَاسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِي الْأَمْرِ>> (So by mercy from Allah, you were lenient with them. And had you been rude [or] harsh in heart, they would have disbanded from about you. So pardon them and ask forgiveness for them and consult them in the matter).\n\nThis is a gentle argument concerning Allah, commanded, and a compassion. The hope (الترجي) from Allah, when it occurs, is without doubt a reality. For this reason, scholars say that the word *‘asā* (perhaps/may) from Allah is obligatory [to occur]. Since He hoped that Pharaoh would remember and fear, Pharaoh must have remembered that in his inner self and feared, but he did not manifest anything of that outwardly, even though remembrance and fear ruled his inner being. That is why he did not strike Moses or his brother in that assembly, for he was the possessor of authority and power at that time. Nothing prevented him except the remembrance and fear of The Real that arose within him, and another impediment. If there had been another manifest impediment that Moses could rely upon, he would not have said, \"Indeed, we fear that he may hasten [punishment] upon us or that he may transgress,\" due to the lack of parity in manifest strength.\n\nThus, He supported him with the gentle speech He commanded them to use. This address was one of the soldiers of Allah, with which He confronted the soldiers of Pharaoh’s inner being. He defeated them by the permission of Allah, so Pharaoh remembered and feared when his army, by which he gained strength, was defeated. He became humbled within himself, and that humility and gnosis (المعرفة) preoccupied him from exercising manifest power, so he did not strike them in that assembly. This is the benefit of Knowledge (العلم). If Knowledge does not yield to its possessor what its reality dictates, then there is no knowledge at all, nor is that person a knower. We have previously discussed this in past stations.\n\nPeople adopt this Mosaic flight (الفرار الموسوي) but do not know the reality of what they have adopted, nor have they considered it with the perspective we have mentioned.\n\nIf you know this,\n\n### [That Allah Did Not Create Man Knowing Everything]\n\nKnow also that Allah did not create man knowing everything. Rather, He commanded His Prophet, peace and blessings be upon him, to ask Him for an increase in knowledge, as He said to him: <<وَقُلْ رَبِّ زِدْنِي عِلْماً>> (And say, \"My Lord, increase me in knowledge\"). Thus, in every state, he gains knowledge that contributes to his felicity and perfection.\n\nThe knowledge upon which the cosmos and man were created is the knowledge of the existence of Allah and the knowledge of the created being’s poverty (فقر المحدث) toward Him. Since this is the case, everyone with this attribute must flee to Allah to witness his poverty and the pain (الألم) that the ruling of poverty inflicts upon the soul, so that He may enrich him who turns to Him.\n\nPerhaps He removes the pain of poverty by that through which pleasure occurs for him, which is sufficiency in Allah (الغني بالله). This is a goal whose attainment is fundamentally impossible, because if anyone were sufficient in Allah, he would be independent *of* Allah, and independence of Allah is impossible. Therefore, sufficiency *in* Allah is impossible. However, Allah grants him a certain matter among the matters that Allah creates within him upon this request, by which He enriches him and removes the pain of that specific poverty he finds. He does not remove the pain of the universal poverty (الفقر الكلي) which cannot be removed from the possible being (الممكن), because poverty is an essential attribute (وصف ذاتي) for him, neither in the state of non-existence nor in the state of existence.\n\nFor this reason, He only placed within the soul of the possible being that which, when granted, causes him to find a pleasure that removes the pain of the request. Then, another request arises for another matter, or for the permanence of that which he has attained, perpetually in this world and the Hereafter.\n\nTherefore, whoever is in this state must withdraw and flee (تخل وفرار) from the matters that distract him from this affair until Allah unveils his insight (بصيرته) and his sight, so that he witnesses the matter as it truly is. He then knows how to ask, from whom to ask, and who is asking, and similar matters. He knows the meaning of His saying: <<إِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ>> (Indeed, Allah is the Self-Sufficient, the Praiseworthy), meaning, the One praised for His Self-Sufficiency.\n\nPonder His saying: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me). This is because it is impossible for Him to worship Himself. And because of what we have said, He used the term *al-Hamīd* (the Praiseworthy), because the attribute of Self-Sufficiency (الغني) is the highest, and it is an essential attribute of The Real, the Exalted. Understand the allusion, for expression here is forbidden.\n\nIf this is established, you know that the Messenger of Allah, peace and blessings be upon him, used to seclude himself in the Cave of Hira (غار حرا) to devote himself to worship and to flee from witnessing people, due to the distress (الحرج والضيق) he found in his soul when observing them. Had he looked at the Face of The Real (وجه الحق) in them, he would not have fled from them nor secluded himself. He remained in this state until The Real suddenly came upon him, whereupon he returned to the creation and remained among them. He only departed from *some* people in the Cave of Hira, not from *all* people. Understand this.\n\nEvery seeker of his Lord must seclude himself with his Lord in his secret (سره), because Allah only gave man an outer (ظاهرا) and an inner (باطنا) so that he may be alone with Allah in his inner being and witness Him in his outer being through His causes (أسبابه), after looking to Him in his inner being, until he distinguishes Him in the very essence of the causes. Otherwise, he will never know Him.\n\nWhoever returns to seclusion with Allah in his inner being does so only for this reason. The inner being of man is his house of seclusion (بيت خلوته), if he understands from Allah.\n\nWhen I knew at the beginning that the matter was as I described, I stripped myself of this physical structure (هيكلي) — a stripping that was both cognitive and experiential (علميا حاليا) — due to my ignorance of the station of The Real in this structure and my lack of knowledge that Allah has a specific Face (وجها خاصا) in everything. When I became a stranger to this structure, I looked at it as if it were a black, dark cloud (سبجة سوداء), dark in its corners, and I saw no light in it.\n\nI asked where this darkness came from, and I was told: \"This is the darkness of Nature (ظلمة الطبيعة).\" The darknesses are three, piled one upon the other, so that <<إِذَا أَخْرَجَ يَدَهُ لَمْ يَكَدْ يَرَاهَا>> (If one puts out his hand, he can hardly see it). How much less can he see it? He negated the proximity of seeing, so how can seeing itself occur? Darkness is a Divine Veil (حجاب إلهي) that veils the existence of The Real.\n\nI asked, \"What are these three darknesses?\" I was told: \"The first darkness you witness is the darkness of Nature (الطبيعة). It is the first layer next to your sight. Then, this Nature only came into existence in the third level (المرتبة الثالثة). Above it is the darkness of the contingent, created cause (ظلمة السبب الحادث الممكن) from which it came into existence, which is a created existence from a created thing—and that is the Soul (النفس). This is the second darkness.\"\n\nThe darkness of Nature intensified and doubled with the darkness of the Soul. I witnessed the Soul and saw darkness above darkness. Then I was told: \"Above this second darkness is a third darkness, which is the cause from which this Soul came into existence—and that is the First Intellect (العقل الأول).\"\n\nThis was unveiled to me, and I saw darkness piled one above the other. I asked, \"Does this have another cause from which it came into existence?\" I was told: \"No, The Real brought this into existence without a cause.\" I asked, \"Then why is it dark?\" I was told: \"This darkness is essential to it (ذاتية), and it is the darkness of its possibility (ظلمة إمكانه). It draws this darkness from the darkness of the Unseen (ظلمة الغيب) upon which no witnessing falls, unlike that which is concealed within it when it emerges from it and separates, becoming witnessed (شهادة).\"\n\nIt is from these three darknesses that man, in terms of his animal body (جسم حيواني), was in his mother's womb, in three darknesses: the darkness of the womb, the darkness of the placenta, and the darkness of the belly. When he is born, his darkness is incorporated within him, so his outer being is light and his inner being is darkness. He cannot walk in the darkness of his inner being except by the lamp of Knowledge (سراج العلم). If he does not have this lamp, he is not guided within it.\n\nWhen I saw my structure and its darkness, I knew that if it did not possess light in some respect, my looking at it and my perception of it would not be valid. I asked about the light that was prepared for my vision to attach to it. I was told: \"The light of Being (نور الوجود). By it you saw it.\"\n\nI looked at myself from the perspective of being the viewer of that darkness, and I saw its shadow spreading over me, but I did not see my light removing it. I was astonished. I was told: \"The darkness of your possibility (ظلام إمكانك) will never leave you, for it is an essential attribute for you, as you are not Necessary of Being (واجب الوجود) by your essence.\"\n\nI said, \"Then who will grant me a light that has no darkness in it?\" I was told: \"You will never find it.\" I said, \"Then I shall never witness my Originator, for He is Pure Light (النور المحض) and Pure Being (الوجود الخالص).\" I was told: \"You will never witness Him except from yourself. For this reason, you will never see Him in one form, nor will you encompass Him with knowledge. He does not manifest (يتحلى) nor is He witnessed as He witnesses Himself, for He is independent of the worlds. He is only inferred by Himself, and He is only known through Unveiling and Witnessing (الكشف والشهود) according to the limit we have mentioned. As for theoretical proofs (الأدلة النظرية), only His ruling (حكمه) is known, not His essence (عينه).\"\n\nTherefore, the intellect rules by its proof upon what this Necessary Existent entails, which the possible being needs from Him. This much is indicated by proof. Witnessing grants a rank above this, which is tasted but cannot be spoken or narrated.\n\nWhen Allah made me witness my essence (ذاتي) and my structure (هيكلي), He then made me witness the relationship of the entire cosmos to me and its orientation toward me in bringing my essence into existence. I saw its precedence over me and its effects in me, and I knew my passivity (انفعالي) from it, and that were it not for the cosmos, my essential existence would not have been.\n\nI felt humbled within myself, being under the compulsion of a possible being like myself. I then knew that I am one of the few who know that the creation of the heavens (which are the higher causes for my existence) and the earth (which are the lower causes for my existence) is greater in rank than the creation of mankind, because they possess the relationship of agency (الفاعلية) and mankind possesses the relationship of passivity (الانفعال).\n\nA brokenness (انكسار) overtook me, almost causing me to despair of witnessing The Real through these causes, which have the superiority of agents over me in rank. When that brokenness occurred within me, I was told: \"Although these causes have this rank over you in the manifest order, know that you are the intended essence (العين المقصودة). These causes only came into existence because of you, so that you might appear. They were not sought for themselves. When Allah loved to be known, it was impossible for Him to be known except by one who is upon His Form (صورته). And Allah did not bring anyone into existence upon His Form except the Perfect Human (الإنسان الكامل), not the Animal Human (الإنسان الحيوان). When he is attained, the desired gnosis (المعرفة المطلوبة) is attained. Thus, He brought into existence what He brought forth of causes for the manifestation of the essence of the Perfect Human. Know this.\"\n\nThis Divine definition repaired my brokenness, and I knew that I am one of the perfect ones (الكمل) and that I am not merely an Animal Human. I thanked Allah for this favor.\n\nWhen He made me witness the relationship of the cosmos to me and my relationship to the cosmos, and I distinguished between the two ranks, I knew that were it not for me, the entire cosmos would not have existed, and that through my existence, the purpose of created knowledge (العلم الحادث) of Allah and created Being (الوجود الحادث)—which is upon the Form of Ancient Being (الوجود القديم)—was validated. I knew that created knowledge of Allah, which is upon the Form of Ancient Knowledge of Allah, can only belong to one whose creation is upon the Form, and that is none other than the Perfect Human. For this reason, he is called Perfect, and he is the Spirit of the World (روح العالم), and the world, high and low, is subjugated to him. The Animal Human is part of the subjugated world, and he resembles the Perfect Human in outward form, but not in the inner being, in terms of rank, just as the ape resembles man in all its outward limbs. Reflect upon the degree of the Animal Human compared to the degree of the Perfect Human.\n\n### [That Man Has the Readiness to Accept Perfection]\n\nKnow from which of mankind you are, for you have the readiness to accept perfection (استعداد قبول الكمال), if you would but understand. For this reason, the admonition and information from the knower (العالم) is necessary. If you did not have the readiness to accept perfection, the admonition would not be valid, and the definition of it would be futile and vain. Therefore, blame no one but yourself for not accepting what you are called to, for the caller only calls with insight (بصيرة) to join you to his essence in insight.\n\nIf you know this, and The Real has made you witness the relationship of the cosmos to you, it remains for you to know the relationship of The Real to you and your relationship to Him. The Real informed me of the relationship of the Divine Names (الأسماء الإلهية) to me, so that the intended Form (الصورة المقصودة) might be attained, and all the Divine Names that apply to Him, the Exalted, might apply to me, without a single Name escaping me in any respect.\n\n### [That the Name Indicates the Named by Correspondence]\n\nKnow that since the Name (الاسم) indicates the Named (المسمى) by the ruling of correspondence (بحكم المطابقة), and nothing other than its Named is understood from it, the Name is the Named in another form, called a name. Thus, the Name is a name for itself and for its Named.\n\nAllah, Glory be to Him, desired to be known, as we established, by created knowledge (المعرفة الحادثة), so that the levels of gnosis might be completed and Being might be completed by the existence of the created being. A thing cannot be known except by itself or by its like. Therefore, the created existent (الموجود الحادث) that Allah brings into existence for the purpose of knowing Him must be upon the Form of its Originator, so that it is like a similitude (المثل) for Him.\n\nThe Perfect Human is one reality (حقيقة واحدة), even if he is more than one in person. He is one essence. And concerning Him, He said: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), making Him a similitude (مثلا) and negating that He be likened. When He established him in existence as a similitude, the Divine Names flowed toward him by the ruling of correspondence, in terms of the Names being essences with verbal and numerical forms and letters, just as man possesses a physical form. These Divine Names corresponded more strongly to this Perfect Human than they did to the Named, Allah.\n\nSince the similitude is distinguished from its like by a certain matter that can only belong to it and not to its like, the matter in the Names by which the similitude is distinguished from its like, and in which the other does not share, is, on the side of The Real, the Name *Allah*. The very thing by which the similitude is distinguished from its like, and which belongs to the other similitude, is the Name *The Perfect Human, the Caliph* (الإنسان الكامل الخليفة), which is specific to this cosmic similitude.\n\nThe remaining Names of The Real are composed of spirit (روح) and form (صورة). In terms of their form, they indicate man by the ruling of correspondence. In terms of their spirit and meaning, they indicate Allah by the ruling of correspondence.\n\nWe have a state, and He has a state. The Names follow those states. We have the ability to strip ourselves of forms whenever we wish. What belongs to us by our essence is the forms, but also, by the reality of our essence, the ability to strip ourselves of them whenever we wish. Thus, the Names follow us in our state of stripping, in terms of their spirits stripped of their forms.\n\nHe has the capacity to be clothed in forms, yet He is essentially without form. He also essentially accepts Theophany (التجلي) to us in forms. Thus, the Names follow Him exactly in terms of their forms when He clothes Himself in a form whenever He wishes. The matter between us and Him is equal, with the existing, verified distinction that He is the Creator and we are the created, and He is Allah and I am the Human Caliph.\n\nHe shares the Caliphate with us due to the realization of the Form, for He commanded us to take Him as a Trustee (وكيلا), and trusteeship is a form of caliphate.\n\nThe Name *Allah*, in form and meaning, is specific to Him and distinguishes Him from me. If He manifests in a form, the form of the Name *Allah* applies to Him by the ruling of correspondence. If He remains upon what He is, without restriction to a form, the spirit of the Name *Allah* applies to Him. Likewise, the Name *Man* is what distinguishes him from Him. Man has the state of remaining upon the form that is his essence, and he has the capacity for stripping.\n\nIf there were no one in the world upon the Form of The Real, the purpose of knowing The Real would not have been achieved—meaning the created knowledge—in His saying: \"I was a hidden treasure (كنزا لم أعرف) and I loved to be known, so I created the creation and introduced Myself to them, and they knew Me.\"\n\nHe made Himself a Treasure, and a treasure is only treasured within something. The Treasure of The Real was only treasured in the form of the Perfect Human, in his thingness and immutability (شيئيته وثبوته). There The Real was treasured. When The Real clothed man in the garment of the thingness of existence, the Treasure appeared with his appearance. The Perfect Human knew Him through his existence and knew that He had been treasured within him in the thingness of his immutability, though he was unaware of it.\n\nI have informed you of the relationship of the Names to him. The Exalted said: <<وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا>> (And He taught Adam all the Names). The word \"all\" (كل) necessitates encompassing and universality. The Messenger of Allah, peace and blessings be upon him, said in his supplication to his Lord: \"O Allah, I ask You by every Name You have named Yourself with (بكل اسم سميت به نفسك).\"\n\nThis is a real attribution (إضافة حقيقية), which is the attribution of a thing to itself. Since two different words were mentioned, the attribution is valid, like \"the certainty of certainty\" (حق اليقين) and \"the knowledge of certainty\" (علم اليقين), while the essence is one, which is the word *al-nafs* (self) and the second person pronoun *kāf* (You). We say this for the sake of the linguists who argue, based on proofs, that a thing cannot be attributed to itself. While that statement is correct, the attribution here occurred in the form, and the forms are two, so it is permissible for one form to be attributed to the other, namely *al-nafs* and the pronoun *kāf*, and *haqq al-yaqīn*, *‘ilm al-yaqīn*, and *‘ayn al-yaqīn*.\n\nThe other interpretation is that the *nafs* (self) is the soul of the Perfect Human, which accepts all Divine and cosmic Names, for the cosmic Names also indicate him by correspondence, except for those specific to the created being, such as Self-Sufficiency for Allah and poverty for man—indeed, for the entire cosmos. In this case, the *nafs* is attributed to the pronoun *kāf* (The Real), and the attribution is one of possession, honor, and entitlement. Attribution of possession is like \"Zayd's wealth.\" Attribution of honor is like \"the servant of the King\" and \"his attendant.\" Attribution of entitlement is like \"the saddle of the mount\" and \"the door of the house.\" All of these are permissible in His saying \"Your self\" (نفسك) if it refers to man, similar to the saying of Jesus, peace be upon him: <<وَلَا أَعْلَمُ مَا فِي نَفْسِكَ>> (And I do not know what is within Your self). He means by this *nafs* here the self of Jesus, attributing it to The Real, as it is in reality. This is more complete in praising Allah and disavowing what was attributed to him and questioned about: <<أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَٰهَيْنِ مِنْ دُونِ اللَّهِ>> (Did you say to the people, 'Take me and my mother as two gods besides Allah'?). He replied: <<تَعْلَمُ مَا فِي نَفْسِي وَلَا أَعْلَمُ مَا فِي نَفْسِكَ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ>> (You know what is within my self, but I do not know what is within Your self. Indeed, it is You who is the Knower of the unseen). For nothing is within it except what You place there. How can the One to whom belongs the creation and the command be questioned?\n\nHe did not say to Him, \"I did not say I am a god,\" because He knew that he was a Caliph and a Perfect Human, and that the Divine Names belonged to him. So he said to Him: <<مَا قُلْتُ لَهُمْ إِلَّا مَا أَمَرْتَنِي بِهِ>> (I said to them nothing except what You commanded me to say). I did not add anything to that. When a speaker says what he was commanded to say, it does not necessitate that he says everything that he is upon, for he was not commanded to say it. He was absolved of responsibility by conveying the message.\n\nThe Prophet, peace and blessings be upon him, said in his supplication: \"Or that You have taught it to any of Your creation, or that You have kept it exclusively in Your knowledge of the Unseen (علم غيبك).\" He mentioned that the Exalted kept something exclusively in His knowledge of the Unseen, which none but He knows. This is nothing other than what is possible for the Perfect Human to possess, but Allah kept it exclusively in His knowledge of the Unseen, which none but He knows. Thus, Allah knows something about man's reality that the Perfect Human does not know about himself. This is the Unseen of The Real, because he is the similitude.\n\nThus, the saying of Muhammad, peace and blessings be upon him, and the saying of Jesus, peace be upon him, converge on one matter: Jesus' saying, \"And I do not know what is within Your self,\" and Muhammad's saying, \"Or that You have kept it exclusively in Your knowledge of the Unseen.\"\n\nThe Perfect Human is the locus of all Names that he has the potential to accept. What he does not have the potential to accept, he cannot accept. Those Names are not considered a deficiency for him, such as the Names specific to man that cannot be applied to Allah. We do not say that Allah is deficient because this Name cannot be applied to Him. The meaning of \"all the Names\" is every Name that, by the reality of this Named, he is capable of accepting. Know this.\n\nWhoever knows how the relationship of the Divine Names to man is, and how the relationship of the cosmic Names to Allah is, knows the rank of man and his distinction from the entire cosmos, and his nobility due to the comprehensiveness (الجمعية) he possesses, like a connoisseur who is skilled in every science. Yet, the possessor of a specific science may be more perfect than him in that science, despite the sharing. The latter is superior in a specific aspect, while the former is superior in comprehensiveness.\n\nWe speak similarly regarding deficiency. We say of the dullard that he is a donkey, and it is certainly known that the donkey is superior to man in dullness, for it is duller than him. Likewise, the angel (الملك) is superior to man in obedience. Allah has testified to this, due to the angel's being stripped of the garment of humanity. He does not disobey Allah in what He commands him, because he is not upon contradictory realities that pull him in different directions at times, causing him to be heedless and forgetful of what he was called to, as occurs in the elemental constitution (النشأة العنصرية).\n\nMan is an elemental constitution, sought by conflicting realities, actively prone to heedlessness and forgetfulness. He is commanded and forbidden, so opposition and compliance are conceivable from him. The angel is more compliant with the command of Allah than man, due to what his constitution dictates, and what the constitution of man dictates. Allah the Exalted said concerning the angels: <<لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ>> (They do not disobey Allah in what He commands them). And He said concerning the Caliph, whom He taught the Names: <<وَعَصَىٰ آدَمُ رَبَّهُ فَغَوَىٰ>> (And Adam disobeyed his Lord and erred). Thus, He described him with disobedience.\n\nThe angel is superior in compliance with the command of Allah, while the human Caliph is more knowledgeable of the Divine Names. This is because the Caliph must manifest what is due to him from the One who appointed him, so that he is both obeyed and disobeyed; otherwise, he is not a Caliph. Thus, he is more complete in comprehensiveness and superior. The angel is superior in one or two specific aspects, but he does not possess the virtue of comprehensiveness. The Form is only achieved by the totality; otherwise, it is not a perfect similitude (صورة مثلية). The perfection of the Form is not impaired by what distinguishes the Form from its like, for that is necessary. Were it not for that, the Form would not be a similitude, but the very essence, and it is known that the matter is not so.\n\nThis station allows for discourse that is almost endless. Therefore, let us confine ourselves to what we have mentioned and mention some of the sciences it contains, as previously stated.\n\nAmong these are: the science of effaced traces (الرسوم الطامسة) and their levels, and their confinement within the realities in which they are confined. It contains the science of one whose command was rejected, causing him to almost kill himself, which is evidence of distress and constraint, and whether this is part of man's perfection or not. Since Allah described Himself with Wrath and Vengeance, this man, being unable by his own power to direct his wrath in vengeance against the one who rejected his word and command, wished to direct it against himself by killing himself. Thus, he is deficient yet perfect. Allah granted him patience to bear the harm, by which he resisted the rage that nature finds against one who rejects his word and seeks to resist him.\n\nIt contains the science of consolation (التسكين) and the finding of joy in the One relied upon, when He descends to him in address with gentleness, due to what he finds. This is by addressing him with what He knows about him regarding the matter that angered him, showing him one greater than himself who was angered, so he finds honor in himself for that. For this reason, Allah the Exalted said to His Prophet, peace and blessings be upon him: <<نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ>> (And We relate to you, [O Muhammad], some news of the messengers by which We make firm your heart).\n\nIt contains the science that whoever commits a crime, commits it against himself, for deeds are only attributed to their doer. If they are attributed to someone other than the doer, their right has been usurped.\n\nIt contains the science of insight (الإستبصار). It contains the science of temperaments (الأمزجة), from which one knows that what harms Zayd benefits ‘Amr, and what is medicine for Khalid is poison for Hasan.\n\nIt contains the science of the call of The Real (نداء الحق) and its variation despite the oneness of the call. It contains the science of the manners of answering the caller. It contains the science of gentle descent (الاستنزال باللطف). It contains the science of restoration (الجبر). It contains the science of cosmic affirmation (التقرير الكوني) and the descent of the higher to address the lower with gentleness, despite His overpowering them in form. What prevents Him from that? Is it a hidden compulsion of which He is unaware, or is it out of a Mercy that is established upon Him or inherent in Him?\n\nIt contains the science of alerting the knower to acquire noble matters by revealing their causes to those who do not know them. It contains the science of the causes of confusion (الحيرة) in answering questioners, when the question is one for which the corresponding answer sought by the questioner cannot be conceived. And whether every question necessitates an answer or not. And whether the question is the very essence of the answer, due to the oneness of speech (أحدية الكلام), and the One does not admit of detail or division. And where is the locus of division when the question is not the essence of the answer, and the speech is one in essence?\n\nIt contains the science of argumentation (الجدل), even when the arguer knows that he is wrong and his opponent is right. Why does he persist in his argument when the truth has become clear to him inwardly? Does he have any justification for The Real, or is he wrong in all respects? If he is wrong in all respects, then falsehood is non-existence, and non-existence cannot resist existence, for nothing cannot be stronger than something.\n\nIt contains the science of what assistance produces. It contains the science of deterrence and intimidation, and the acceptance of the Decree (القضاء) and the Predetermined (المقضي) simultaneously, due to the strength in the acceptor, and what should be accepted of the Predetermined and what should not.\n\nIt contains the science of the effect of relying on multiplicity (الكثرة) in strengthening the soul of the reliant, even if he fails. Sometimes, the single person is granted a strength that exceeds the strength of the many, so the many cannot resist him.\n\nIt contains the science of the effect of one existent upon another: whether it requires a Divine Command, or Knowledge, or whether some of it is from Knowledge and some from a Divine Command, and the ranks of creation in that.\n\nIt contains the science of narrating reports and their benefit beyond merely comforting souls, for souls naturally find pleasure in stories.\n\nIt contains the science of the superiority of the knower over the world in knowledge. It contains the science of what matters should be attributed to The Real and what should not, even if they belong to Him.\n\nIt contains the science of the soul's honor (عزة النفس) in not having blameworthy things attributed to it, despite its being qualified by them. What veils it so that it is qualified by blameworthy things yet does not wish to be described by them?\n\nIt contains the science of the absolute superiority of some souls over others. It contains the science of the reason for the permanence of blessings and the non-permanence of their opposite.\n\nIt contains the science of spiritual sustenance (المدد) and why their termination, when described as such, returns to the act existing within them, or whether it is due to another matter.\n\nIt contains the science of the divisions of time into periods, while it is one essence. It contains the science of the seeking of recompense by deeds, even if the doers are purified from seeking them. It contains the science of who is of a higher station: the one purified from seeking rewards or the one who seeks rewards.\n\nIt contains the science of the beginning of the Message in the world and its cause, and whether there is anyone in the world who has departed from the Divine Mandate (التكليف) or not.\n\nIt contains the science of what distinguishes the high from the low: whether it is by itself or by a relative matter, and which of the two is nobler. It contains the science of the variation of signs (الآيات) due to the variation of ages and states, and where that stands in relation to Divine Knowledge.\n\nIt contains the science of the entry of the vast into the narrow without the narrow becoming vast or the vast becoming narrow. It contains the science of the difference between females and males in every category.\n\nIt contains the science of who is correctly named a brother and who is not, and the ranks of brotherhood. It contains the science of Divine and established balances (الموازنات).\n\nIt contains the science of the cause that arises in man so that his heart is blinded to the path of The Real, despite his knowledge of possibility. This is one of the most astonishing things, such as the saying of those who said: <<اللَّهُمَّ إِنْ كَانَ هَٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ>> (O Allah, if this is indeed the truth from You, then rain down upon us stones from the sky), despite their knowledge that this was possible. Yet, Allah did not grant them success to say, \"Forgive us,\" or \"Grant us felicity.\"\n\nIt contains the science of the levels of Divine Revelation (الوحي الإلهي) in man. It contains the science of the indication that cannot be rejected. It contains the science of the distinction between verse and poetry (النظم والمنظوم) and prose and written text (النثر والمنثور), which is the science of the restricted and the absolute.\n\nIt contains the science of transition from one state to another and from one station to another. It contains the science of the descent of the fiery spirits (الأرواح النارية): from where they descend, upon whom they descend, and where their locus is, and what should be attributed to them.\n\n<<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو اٹھاون: تین مختلف انوار، ٹھہراؤ، ظاہر ہونے اور صحیح خبروں کے اسرار کے مقام کی معرفت میں\n\n> بے شک مقادیر (تقدیریں) منظم اوزان ہیں\n> جو ان بادلوں سے آتی ہیں جن کے اوپر اور بادل ہیں\n> اور بادل کے بغیر بھی وہ نظر آتی ہیں\n> جب وہ اپنے اعجاز میں نزول کرتی ہیں تو ہر ایک کو تھکاوٹ محسوس ہوتی ہے\n> وہ ہر اس معنی کو اپنے اندر سموئے ہوئے ہیں جسے ظاہر نہیں کرتا\n> مگر خطابت، اشعار اور مثالیں\n> پس ان میں سے کچھ محمود (قابل تعریف) ہیں جو بلند ہوتے ہیں\n> اور کچھ مذموم (قابل ملامت) ہیں جو پست ہوتے ہیں\n> اور جو کوئی اس بات پر مجھ سے جھگڑا کرے جو میں کہتا ہوں\n> تو تمام لوگ اس چیز کے دشمن ہوتے ہیں جس سے وہ ناواقف ہوں\n\n[کہ ناطق نفس (النفس الناطقة) دنیا اور آخرت میں سعید (خوش بخت) ہے]\n\nاللہ ہمیں اور آپ کو ہمیشہ کی سعادت (سعادة الأبد) سے خوش بخت کرے، جان لو کہ ناطق نفس (النفس الناطقة) دنیا اور آخرت میں سعید ہے، اسے شقاوت (بدبختی) میں کوئی حصہ نہیں کیونکہ وہ شقاوت کے عالم سے نہیں ہے۔ مگر یہ کہ اللہ نے اسے اس بدنی مرکب پر سوار کیا ہے جسے حیوانی نفس (النفس الحيوانية) سے تعبیر کیا جاتا ہے۔ یہ اس کے لیے چوپائے کی مانند ہے اور وہ اس پر سوار کی مانند ہے۔ ناطق نفس (النفس الناطقة) کے لیے اس حیوانی مرکب میں صرف یہی ہے کہ وہ اسے اس صراط مستقیم پر چلائے جو ذات حق (الحق) نے اس کے لیے مقرر کیا ہے۔ اگر حیوانی نفس (النفس الحيوانية) اس پر لبیک کہے تو وہ فرمانبردار اور تربیت یافتہ سواری ہے، اور اگر انکار کرے تو وہ سرکش چوپایہ ہے۔ جب بھی سوار اسے راستے پر لانا چاہتا ہے، وہ اس پر اڑ جاتی ہے اور سرکشی کرتی ہے، اپنی سر کی قوت اور مزاج کی خرابی کی وجہ سے دائیں بائیں بھاگتی ہے۔ حیوانی نفس (النفس الحيوانية) مخالفت کا ارادہ نہیں کرتی اور نہ ہی شریعت کی حرمت کو پامال کرنے کے لیے معصیت کا ارتکاب کرتی ہے، بلکہ وہ اپنے طبع کے مطابق چلتی ہے کیونکہ وہ شرع سے ناواقف ہے۔ اور اتفاق سے اس کا مزاج ایسا ہے جو اس کے سوار کے مطلوبہ امر کے موافق نہیں ہے۔ ناطق نفس (النفس الناطقة) کے لیے مخالفت ممکن نہیں کیونکہ وہ عصمت (العصمة) اور طاہر ارواح کے عالم سے ہے۔ پس جب قیامت کے دن سزا واقع ہوگی تو وہ صرف حیوانی نفس (النفس الحيوانية) پر واقع ہوگی، جیسے سوار اپنے چوپائے کو مارتا ہے جب وہ سرکشی کرے اور اس راستے سے ہٹ جائے جس پر اس کا مالک اسے چلانا چاہتا ہے۔ کیا تم نہیں دیکھتے کہ زنا، چوری، محاربہ (جنگ) اور بہتان کی حدود صرف حیوانی، بدنی نفس (النفس الحيوانية) پر لاگو ہوتی ہیں؟ اور یہی وہ ہے جو قتل، ہاتھ کاٹنے اور پیٹھ پر کوڑے مارنے کے درد کو محسوس کرتی ہے۔ پس حدود جسم پر قائم ہوئیں اور درد اس حسی حیوانی نفس (النفس الحيوانية) کو پہنچا جس میں تمام حیوانات کے درد محسوس کرنے کی صلاحیت جمع ہے۔ لہٰذا انسان میں عذاب کی جگہ اور تمام حیوانات میں دنیا اور آخرت میں کوئی فرق نہیں ہے۔ اور ناطق نفس (النفس الناطقة) اپنے عالم کے ساتھ اپنی دائمی سعادت میں اپنے شرف پر قائم ہے۔\n\nکیا تم نبی اکرم صلی اللہ علیہ وسلم کو نہیں دیکھتے کہ آپ ایک یہودی کے جنازے کے لیے کھڑے ہوئے؟ آپ سے کہا گیا کہ یہ تو ایک یہودی کا جنازہ ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"أ ليست نفسا\" (کیا وہ ایک نفس نہیں ہے؟)۔ آپ نے اس کی ذات کے علاوہ کسی اور چیز سے تعلیل نہیں کی، پس آپ اس کی تعظیم اور اس کے شرف و مقام کی وجہ سے کھڑے ہوئے۔ اور اسے شرف کیوں نہ ہو جبکہ وہ روح اللہ سے پھونکی گئی ہے؟ پس وہ اشرف ملکی روحانی عالم (العالم الأشرف الملكي الروحاني) یعنی طہارت کے عالم سے ہے۔ لہٰذا اس بدنی حیوانی نفس (النفس الحيوانية) کے ساتھ ناطق نفس (النفس الناطقة) میں اور چوپائے پر سوار شخص میں ظاہری صورت کے لحاظ سے کوئی فرق نہیں ہے، یا تو وہ سرکش ہے یا فرمانبردار۔ پس تم پر واضح ہو گیا کہ ناطق نفس (النفس الناطقة) نے نافرمانی نہیں کی، بلکہ حیوانی نفس (النفس الحيوانية) نے اس کے مطلوبہ امر میں اس کا ساتھ نہیں دیا۔ اور حیوانی نفس (النفس الحيوانية) کو مکلف نہیں بنایا گیا کہ وہ اطاعت یا معصیت سے متصف ہو، بلکہ اتفاق سے اگر وہ سرکش ہے تو یہ اس کے خاص مزاج کے طبع کا تقاضا ہے۔ پس یہ جان لو، اور یہ بھی کہ اللہ اپنی رحمت سے سب کو شامل کرتا ہے، کیونکہ جب رحمت اور غضب انسان کی طرف دوڑے تو اللہ کی رحمت اس کے غضب پر سبقت لے گئی۔\n\n[کہ جود الٰہی (الجود الإلهي) اعیان (الأعيان) پر ایجاد (الإيجاد) کے ذریعے احسان کرتا رہتا ہے]\n\nاور جان لو کہ اللہ تعالیٰ عدم (العدم) کی حالت میں ممکنہ اشیاء کے اعیان (أعيان الأشياء الممكنة) پر ہمیشہ نظر رکھتا ہے، اور جود الٰہی (الجود الإلهي) ان پر ایجاد (الإيجاد) کے ذریعے احسان کرتا رہتا ہے، جیسا کہ علم ازلی میں ان کے وجود میں ایک دوسرے پر سبقت لے جانے کا فیصلہ ہو چکا تھا۔ اور چونکہ کل جوہر (الجوهر الكل) کے عین کا بقا ممکن نہیں جب تک کہ بعض ممکنات اس کے ساتھ قائم نہ ہوں جو بذات خود قائم نہیں ہو سکتے، اس لیے حفظ الٰہی (الحفظ الإلهي) ہمیشہ ان کے بقا کو اس کے ذریعے محفوظ رکھتا ہے۔ اور وہ اپنی ذات میں بقا کو قبول نہیں کرتے مگر اپنے وجود کے زمانے تک۔ پس جود الٰہی (الجود الإلهي) ہمیشہ اس کل جوہر (الجوهر الكل) کے لیے، جس میں اللہ نے عالم کی صورتیں کھولی ہیں، وہ شرطی ممکنات (الممكنات الشرطية) پیدا کرتا رہتا ہے جن سے اس کا بقا ہے۔ پس اللہ ہمیشہ خالق (خالق) اور ہمیشہ حافظ (حافظ) ہے۔ اسی طرح، اگر اللہ سبحانہ و تعالیٰ نے موجودات میں سرِ حیات (سر الحياة) کو جاری نہ کیا ہوتا تو وہ ناطق نہ ہوتیں، اور اگر ان میں علم کا سرایت نہ ہوتا تو وہ اپنے موجد اللہ کی ثنا میں ناطق نہ ہوتیں۔ اسی لیے فرمایا: \"وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ\" (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ یہاں نکرہ (غیر معین) کا لفظ استعمال کیا، اور کسی ثابت چیز کو کسی موجود چیز سے خاص نہیں کیا، کیونکہ انہوں نے اس حال پر وجود کی شیئیت (شیئية الوجود) کو قبول کیا جس پر وہ ثبوت کی شیئیت (شيئية الثبوت) میں تھیں۔ اور اللہ نے ہمیں خبر دی ہے کہ اس نے ان سے ان کے عدم کی حالت میں خطاب کیا، اور خطاب متوجہ ہونے پر انہوں نے اس کے حکم کی تعمیل کی، اور جس کا انہیں حکم دیا گیا تھا اس کی تعمیل میں جلدی کی۔ اگر وہ عدم کی حالت میں ان صفات سے متصف نہ ہوتیں جو ان کے وجود کی حالت میں ہیں، تو ذات حق (الحق) انہیں ان صفات سے متصف نہ کرتا جن سے اس نے انہیں متصف کیا ہے، اور وہ حقائق اشیاء کو جیسا کہ وہ ہیں، بیان کرنے والا سچا ہے۔ پس موجودات کے اعیان (أعيان الموجودات) اسی حال میں ظاہر ہوئے جس پر وہ عدم کی حالت میں تھے۔ انہوں نے صرف وجود سے فائدہ اٹھایا، اپنے اعیان کے لحاظ سے اور اس لحاظ سے جس سے ان کا بقا ہے۔ پس وہ اعیان جو بذات خود قائم ہیں، ان کی ہر حالت ان کے لیے ذاتی ہے، اگرچہ ان پر اعراض (Accidents) مثالوں اور اضداد کے ذریعے بدلتے رہیں۔ مگر ان کا حکم ان کے عدم کی حالت میں ان کے وجود کی حالت جیسا نہیں ہے، کسی ایک امر کے لحاظ سے۔ اور وہ اس لیے کہ ان کا حکم ان کے عدم کی حالت میں ان کے لیے ذاتی ہے، ذات حق (الحق) کا اس میں کوئی حکم نہیں ہے۔ اگر ہوتا تو عدم ان کے لیے ذاتی صفت نہ ہوتا۔ پس ممکنات (الممكنات) اپنی عدم کی حالت میں ان احوال کے ساتھ ذات حق (الحق) کی طرف دیکھتی رہتی ہیں جن پر وہ ہیں، ان پر کوئی حال نہیں بدلتا، یہاں تک کہ وہ وجود سے متصف ہو جائیں۔ تب ان پر احوال بدل جاتے ہیں، اس عدم کی وجہ سے جو عین کے بقا کے سبب کی طرف تیزی سے آتا ہے۔ اور عدم کی حالت میں ایسا نہیں ہوتا، کیونکہ عدم کی حالت میں ان پر کوئی چیز نہیں بدلتی، بلکہ وہ امر جس پر وہ اپنی ذات میں ہیں، ثابت رہتا ہے، کیونکہ اگر وہ زائل ہو جائے تو وہ صرف وجود کی طرف زائل ہو گا، اور وہ وجود کی طرف زائل نہیں ہوتا مگر جب وہ عین جو اس خاص ممکن کے ساتھ قائم ہے، وجود سے متصف ہو جائے۔ پس امر وجود اور عدم کے درمیان ہے، جو خاص احوال پر ثابت اعیان (أعيان ثابتة) میں ہیں۔ جب تم اس بات کی تحقیق کر لو جو ہم نے تمہارے سامنے بیان کی ہے، تو تم خالق اور مخلوق کو جان لو گے، اور یہ بھی کہ مخلوق کے لیے کیا حکم ہونا چاہیے اور خالق کے لیے کیا وصف ہونا چاہیے۔ کیونکہ \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثل کوئی چیز نہیں) اور \"كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ\" (وہ ہر دن ایک نئی شان میں ہے)۔ پس نہ کوئی ثابت چیز اس سے مشابہت رکھتی ہے اور نہ کوئی موجود چیز۔ اور میں اس علم پر نہیں پہنچا جس پر میں پہنچا ہوں، جس کے شہود (الشهود) اور حکم نے مجھے اس کے ساتھ بقا (البقاء) کی طرف رہنمائی کی، اور اس بات کی طرف کہ اشیاء سے زہد (دنیا سے بے رغبتی) صرف اس جہل سے واقع ہوتا ہے جو اس زاہد کے ساتھ قائم ہے، اور وہ علم کا نہ ہونا ہے، اور اس حجابی پردے سے جو اس کی آنکھ پر ہے، اور وہ کشف (الکشف) اور شہود (الشهود) کا نہ ہونا ہے، جیسا کہ ہم نے ذکر کیا۔ پس جب وہ جان لے یا شہود کر لے کہ سارا عالم اپنے خالق کی تسبیح اور ثنا میں ناطق ہے، اور وہ اس کے شہود (الشهود) کی حالت میں ہے، تو وہ اس ذات سے کیسے زہد کر سکتا ہے جس کی یہ صفت ہے، جبکہ اس کی عین، ذات اور صفات بھی عالم کے مجموعے میں سے ہیں؟ اور اللہ نے اسے آفاق میں اپنی نشانیاں دکھائیں، جو اس سے باہر ہیں، اور اس کے نفس میں، جو اس کی اپنی حالت ہے۔ پس اگر وہ اپنے غیر سے باہر نکل جائے تو اپنے نفس سے باہر نہیں نکل سکتا۔ پس جو عالم اور اپنے نفس سے باہر نکل گیا، وہ ذات حق (الحق) سے باہر نکل گیا، اور جو ذات حق (الحق) سے باہر نکل گیا، وہ امکان (الإمكان) سے باہر نکل گیا اور محال (ناممکن) سے جا ملا۔ اور جس کی حقیقت امکان (الإمكان) ہو، وہ محال سے نہیں مل سکتا۔ لہٰذا اس کا یہ دعویٰ کہ وہ اللہ کے سوا ہر چیز سے باہر نکل گیا ہے، محض جہالت ہے۔ بلکہ یہ احوال کا انتقال ہے جسے وہ اپنی جہالت کی وجہ سے محسوس نہیں کرتا، تو اس کی جہالت اسے یہ خیال دلاتی ہے کہ عالم اللہ سے الگ ہے اور اللہ عالم سے الگ ہے، اور وہ اس کی طرف فرار (بھاگنا) چاہتا ہے۔ پس یہ ایک وہمی فرار ہے، اور اس کا سبب اشیاء کے ذوق کا نہ ہونا ہے، اور یہ کہ اس نے تلاوت میں سنا: \"فَفِرُّوا إِلَى اللَّهِ\" (پس اللہ کی طرف بھاگو)۔ اور یہ بات صحیح ہے، مگر اس مرتبے کے بھاگنے والے نے اس آیت پر توجہ نہیں دی جو اللہ نے اس آیت کے بعد ذکر کی، اور وہ اس کا قول ہے: \"وَلَا تَجْعَلُوا مَعَ اللَّهِ إِلَهًا آخَرَ\" (اور اللہ کے ساتھ کوئی دوسرا معبود نہ ٹھہراؤ)۔ اگر وہ اس تتمیم کو جان لیتا تو وہ اس قول کا معنی جان لیتا: \"فَفِرُّوا إِلَى اللَّهِ\" کہ یہ جہالت سے علم کی طرف فرار ہے، اور یہ کہ امر واحد احدی ہے، اور وہ جسے وہ وجودی امر گمان کرتا تھا، اس کے لیے الوہیت کی نسبت سے جسے اس نے معبود بنا رکھا تھا، وہ ایک عدمی محال ہے، نہ ممکن ہے اور نہ واجب۔ پس یہ فرار کا وہ معنی ہے جس کا حکم دیا گیا ہے۔ پس اس کی طرف الوہیت کی نسبت کے لحاظ سے فرار ہوتا ہے۔ پس سمجھو۔ اور دوسرا فرار جو تلاوت کیا گیا ہے، وہ موسیٰ علیہ السلام کا قول ہے: \"فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ\" (پس میں تم سے بھاگا جب مجھے تمہارا خوف ہوا)۔ جب انہوں نے جان لیا کہ اللہ نے اسباب (الأسباب) کو مقرر کیا ہے اور انہیں عالم میں اثر دیا ہے، جو اغراض کے موافق بھی ہوتا ہے اور ناموافق بھی، اور جو طبع کے موافق بھی ہوتا ہے اور ناموافق بھی۔ اور حیوان کو ایسے مزاج پر پیدا کیا جو درد اور لذت کو قبول کرتا ہے، بخلاف نباتات اور جمادات کے۔ اگرچہ وہ اہل کشف (أهل الكشف) کے نزدیک حیات سے متصف ہیں، مگر وہ ایسے مزاج پر ہیں جو لذت اور درد کو قبول نہیں کرتا۔ اور موسیٰ علیہ السلام سے جو قبطی کے قتل کا واقعہ ہوا، تو وہ اس نجات کی طرف بھاگے جو فرار سے حاصل ہو سکتی تھی۔ پس انہوں نے دیکھا کہ بعض مقامات پر نجات کے وجود کے لیے مقرر کردہ الٰہی اسباب سے فرار کرنا ایک طبعی فرار ہے۔ کیونکہ انہوں نے ذکر کیا کہ سبب کا خوف انہیں بھاگنے پر مجبور کر رہا تھا، لیکن وہ اس تعریف سے خالی تھا جو ہم نے الٰہی وضع کے بارے میں ذکر کی ہے۔ پس انہوں نے عقلی نظر کا حق ادا نہیں کیا، کیونکہ یہ ان کی نبوت اور ذات حق (الحق) کے ارادے کی معرفت سے پہلے کا واقعہ تھا۔ جب وہ فرعون کے خوف سے بھاگے تو ذات حق (الحق) نے انہیں نجات سے نوازا اور انہیں اپنے رسولوں میں سے ایک، یعنی شعیب علیہ السلام، سے ملا دیا۔ پھر انہیں نبوت اور وہ حکم عطا کیا جس کے ذریعے اللہ نے قبطیوں اور بنی اسرائیل کو مخاطب کیا کہ وہ اس پر قائم رہیں، اور انہیں اس کی طرف بھیجا جس سے وہ ڈرتے تھے۔ پس یہ بھیجنا ایک طرح کی سزا تھی، اس خوف کی وجہ سے جو انہیں مقرر کردہ سبب سے لاحق ہوا تھا، اور انہوں نے مقرر کردہ سبب کا حق ادا نہیں کیا تھا، یعنی عقلی نظر کا۔ پس فرار میں انہیں یہ تنبیہ کرنی چاہیے تھی کہ یہ خوف اللہ سے ہے، کیونکہ ممکن (الممكن) میں کسی دوسرے ممکن تک خیر یا شر پہنچانے کی کوئی مؤثر قدرت نہیں ہے، اور یہ سب اللہ کے ہاتھ میں ہے۔ پس اللہ نے انہیں رسالت اور حکم عطا کیا، اور انہیں اس علم سے امن دیا جو اللہ نے انہیں فرعون اور اس کے خاندان کے ساتھ ان کے انجام کے بارے میں دیا، اور جب اس نے ان سے کلام کیا تو انہیں دکھایا جو دکھایا، یعنی لاٹھی کا سانپ بن جانا۔ اور ہم نے یہ اس لیے کہا کہ فرعون کی طرف بھیجنا ایک سزا تھی، اور یہ کہ خوف ان کے ساتھ باقی تھا، کیونکہ اللہ تعالیٰ نے انہیں اور ان کے بھائی کو فرمایا جب انہوں نے کہا: \"إِنَّنَا نَخَافُ أَنْ يَفْرُطَ عَلَيْنَا أَوْ أَنْ يَطْغَىٰ\" (بے شک ہم ڈرتے ہیں کہ وہ ہم پر زیادتی کرے گا یا سرکشی کرے گا)۔ تو اللہ نے فرمایا: \"لَا تَخَافَا إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ\" (تم دونوں ڈرو نہیں، بے شک میں تمہارے ساتھ ہوں، سنتا اور دیکھتا ہوں)۔ اور ان دونوں سے فرمایا: \"فَقُولَا لَهُ قَوْلًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ\" (پس تم دونوں اس سے نرم بات کہو، شاید وہ نصیحت حاصل کرے) جو وہ ہمارے احسان کے بارے میں جانتا تھا، \"أَوْ يَخْشَىٰ\" (یا ڈر جائے)۔ یعنی یا وہ اس چیز سے ڈر جائے جسے وہ جانتا ہے کہ ہم نے اس سے پہلے اس جیسی بات کہنے والوں کو کس طرح پکڑا اور سخت گرفت کی، اور اس کا علم اس کے پاس موجود ہے۔ اور یہ ہمارے نبی صلی اللہ علیہ وسلم کے لیے اللہ تعالیٰ کے اس قول کی طرح ہے: \"وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ\" (اور ان سے اس طریقے سے بحث کرو جو سب سے بہتر ہو)۔ اور اللہ تعالیٰ کا یہ قول: \"فَبِمَا رَحْمَةٍ مِنَ اللَّهِ لِنْتَ لَهُمْ وَلَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا مِنْ حَوْلِكَ فَاعْفُ عَنْهُمْ وَاسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِي الْأَمْرِ\" (پس اللہ کی رحمت کے سبب تم ان کے لیے نرم ہو گئے، اور اگر تم سخت مزاج اور سخت دل ہوتے تو وہ تمہارے ارد گرد سے منتشر ہو جاتے، پس انہیں معاف کر دو اور ان کے لیے مغفرت طلب کرو اور معاملے میں ان سے مشورہ کرو)۔ پس یہ اللہ کے بارے میں نرم جدال ہے جس کا حکم دیا گیا ہے، اور شفقت ہے۔ اور اللہ کی طرف سے ترجی (امید) جب وارد ہو تو بلا شک واقع ہوتی ہے۔ اسی لیے علماء نے کہا ہے کہ اللہ کی طرف سے \"عسیٰ\" (شاید) کا کلمہ واجب الوقوع ہوتا ہے۔ اور فرعون سے تذکر (نصیحت حاصل کرنے) اور خشیت (ڈرنے) کی امید کی گئی، تو فرعون نے یقیناً اپنے نفس میں اس کا تذکر کیا اور ڈرا، لیکن اس نے ظاہری طور پر کچھ ظاہر نہیں کیا، اگرچہ تذکر اور خشیت نے اس کے باطن پر حکم کیا تھا۔ اسی لیے اس نے اس مجلس میں موسیٰ اور ان کے بھائی پر ہاتھ نہیں اٹھایا، کیونکہ وہ اس وقت سلطان اور قہر کا مالک تھا۔ پس اسے صرف اس تذکر اور ذات حق (الحق) سے خشیت نے روکا جو اس کے اندر قائم ہو گئی تھی، اور ایک اور مانع نے۔ اگر وہاں کوئی دوسرا ظاہری مانع ہوتا جس کی طرف موسیٰ علیہ السلام پناہ لیتے، تو وہ یہ نہ کہتے: \"إِنَّنَا نَخَافُ أَنْ يَفْرُطَ عَلَيْنَا أَوْ أَنْ يَطْغَىٰ\" کیونکہ ظاہری قوت میں کوئی برابری نہیں تھی۔ پس اللہ نے ان کی تائید اس نرم بات کی وصیت سے کی جو انہیں کہی گئی تھی، تو یہ مخاطبت اللہ کے لشکروں میں سے تھی جس نے فرعون کے باطن کے لشکروں کا مقابلہ کیا، اور اللہ کے حکم سے انہیں شکست دی، تو اس نے تذکر کیا اور ڈرا، جب اس کا وہ لشکر شکست کھا گیا جس سے وہ قوت حاصل کرتا تھا۔ پس وہ اپنے نفس میں ذلیل ہوا، اور اس ذلت اور معرفت نے اسے ظاہری قوت سے حکم کرنے سے مشغول کر دیا، تو اس نے اس مجلس میں ان پر ہاتھ نہیں اٹھایا۔ پس یہ علم کا فائدہ ہے۔ کیونکہ اگر علم اپنے صاحب کے لیے وہ چیز نہ لائے جو اس کی حقیقت عطا کرتی ہے، تو وہاں سرے سے کوئی علم نہیں ہے، اور نہ ہی وہ عالم ہے۔ اور اس جیسی بات پہلے بھی منازل میں گزر چکی ہے۔ پس لوگ اس موسوی فرار کو اختیار کرتے ہیں اور اس کی حقیقت کو نہیں جانتے جس کو انہوں نے اختیار کیا، اور نہ ہی انہوں نے اس پر وہ نظر ڈالی جو ہم نے ذکر کی۔ اور جب تم یہ جان چکے ہو۔\n\n[کہ اللہ نے انسان کو ہر چیز کا عالم بنا کر پیدا نہیں کیا]\n\nتو یہ بھی جان لو کہ اللہ نے انسان کو ہر چیز کا عالم بنا کر پیدا نہیں کیا، بلکہ اس نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا کہ وہ اس سے مزید علم طلب کریں، جب اس نے ان سے فرمایا: \"وَقُلْ رَبِّ زِدْنِي عِلْمًا\" (اور کہو: اے میرے رب! میرے علم میں اضافہ فرما)۔ پس وہ ہر حال میں اس علم سے فائدہ اٹھاتا ہے جس سے اس کی سعادت اور کمال ہے۔ پس وہ علم جس پر عالم اور انسان کو فطرت دی گئی ہے، وہ اللہ کے وجود کا علم اور محدث (پیدا کی گئی چیز) کا اس کی محتاجی کا علم ہے۔ جب یہ حال ہے، تو ہر وہ شخص جس کی یہ صفت ہے، اس کے لیے ضروری ہے کہ وہ اللہ کی طرف فرار کرے تاکہ وہ اپنے فقر (محتاجی) کا مشاہدہ کرے اور وہ درد جو فقر کے حکم سے نفس کو پہنچتا ہے، تاکہ وہ اسے غنی کر دے جو اس کی طرف متوجہ ہوا ہے۔ پس بسا اوقات وہ اس سے فقر کا درد اس چیز سے زائل کر دیتا ہے جس سے اسے لذت حاصل ہوتی ہے، اور وہ اللہ کے ساتھ غنی ہونا ہے۔ اور یہ ایسا مطلوب ہے جس کا حصول سرے سے صحیح نہیں، کیونکہ اگر کوئی اللہ کے ساتھ غنی ہو جائے تو وہ اللہ سے بے نیاز ہو جائے گا، اور اللہ سے بے نیاز ہونا محال ہے۔ پس اللہ کے ساتھ غنی ہونا محال ہے، لیکن اللہ اسے اس طلب کے وقت کوئی ایسا امر عطا کرتا ہے جو وہ اس میں پیدا کرتا ہے، جس سے وہ اسے غنی کر دیتا ہے اور اس خاص فقر کے درد کی لذت کو زائل کر دیتا ہے، نہ کہ اس کلی فقر کے درد کو جو ممکن (الممكن) سے زائل نہیں ہو سکتا، کیونکہ فقر اس کے لیے ذاتی وصف ہے، نہ عدم کی حالت میں اور نہ وجود کی حالت میں۔ اسی لیے ممکن کے نفس میں صرف وہی چیز رکھی گئی ہے کہ جب اللہ اسے وہ عطا کرتا ہے تو وہ طلب کے درد کو زائل کرنے والی لذت پاتا ہے۔ پھر اس کے لیے کسی دوسرے امر کی یا اس حاصل شدہ چیز کے دنیا و آخرت میں ہمیشہ باقی رہنے کی ایک اور طلب پیدا ہوتی ہے۔ پس جس کا یہ حال ہو، اس کے لیے ضروری ہے کہ وہ ان مشغول کرنے والی چیزوں سے علیحدگی اور فرار اختیار کرے جو اسے اس امر سے روکتی ہیں، یہاں تک کہ اللہ اس کی بصیرت اور بصارت سے پردہ ہٹا دے، تو وہ امر کا مشاہدہ اسی طرح کرے جیسا کہ وہ ہے۔ تب وہ جان لے گا کہ کیسے طلب کرے، کس سے طلب کرے، اور کون طلب کرتا ہے، اور اس جیسی چیزیں۔ اور وہ اس قول کا معنی جان لے گا: \"إِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ\" (بے شک اللہ ہی غنی ہے، قابل تعریف ہے) یعنی غنی ہونے کی وجہ سے جس کی ثنا کی جاتی ہے۔ اور اس قول پر غور کرو: \"وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ\" (اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں)۔ کیونکہ اس کے لیے یہ محال ہے کہ وہ اپنی عبادت کرے۔ اور جو ہم نے کہا، اسی لیے \"الحمید\" (قابل تعریف) کا لفظ لایا گیا، کیونکہ غنی (الغني) کی صفت سے اعلیٰ کوئی صفت نہیں ہے، اور یہ ذات حق (الحق) کے لیے ذاتی صفت ہے۔ پس اشارے کو سمجھو، کیونکہ یہاں عبارت حرام ہے۔ اور جب یہ بات ثابت ہو گئی، تو تم نے جان لیا کہ رسول اللہ صلی اللہ علیہ وسلم غار حرا میں کیوں خلوت اختیار کرتے تھے تاکہ وہاں عبادت کریں اور لوگوں کے مشاہدے سے فرار کریں، اس تنگی اور حرج کی وجہ سے جو انہیں ان کے مشاہدے میں اپنے نفس میں محسوس ہوتا تھا۔ اگر وہ ان میں ذات حق (الحق) کا چہرہ دیکھتے تو ان سے فرار نہ کرتے اور نہ ہی اپنے نفس کے ساتھ خلوت اختیار کرتے۔ اور وہ اسی حال پر رہے یہاں تک کہ ذات حق (الحق) نے اچانک ان سے ملاقات کی، تو وہ مخلوق کی طرف واپس لوٹے اور ہمیشہ ان میں رہے۔ کیونکہ وہ غار حرا میں اپنے نفس کے ساتھ خلوت میں تھے، پس وہ صرف بعض لوگوں سے دور ہوئے، نہ کہ تمام لوگوں سے۔ پس سمجھو۔ پس ہر طالب حق کے لیے ضروری ہے کہ وہ اپنے رب کے ساتھ اپنے باطن میں خلوت اختیار کرے، کیونکہ اللہ نے انسان کے لیے ظاہر اور باطن صرف اس لیے نہیں بنایا کہ وہ اپنے باطن میں اللہ کے ساتھ خلوت کرے اور اپنے ظاہر میں اس کے اسباب میں اس کا مشاہدہ کرے، اس کے بعد کہ وہ اپنے باطن میں اس کی طرف نظر کرے۔ یہاں تک کہ وہ اسے عین اسباب میں ممتاز کر لے، ورنہ وہ اسے کبھی نہیں پہچانے گا۔ پس جو کوئی اپنے باطن میں اللہ کے ساتھ خلوت کی طرف لوٹتا ہے، وہ صرف اسی مقصد کے لیے لوٹتا ہے۔ پس انسان کا باطن اس کی خلوت کا گھر ہے، اگر وہ اللہ کی طرف سے عقل کرے۔ پس جب میں نے شروع میں جان لیا کہ معاملہ وہی ہے جو میں نے ذکر کیا، تو میں اپنے اس ڈھانچے (ہیکل) سے علمی اور حالی تجرد اختیار کر گیا، اس ڈھانچے میں ذات حق (الحق) کے مقام سے اپنی جہالت کی وجہ سے، اور اس علم کے نہ ہونے کی وجہ سے کہ اللہ کا ہر چیز میں ایک خاص چہرہ ہے۔ پس جب میں اس ڈھانچے سے اجنبی ہو گیا، تو میں نے اسے ایک سیاہ سبجہ (تسبیح) کی طرح دیکھا جس کے اطراف تاریک تھے، میں نے اس میں کوئی نور نہیں دیکھا۔ پس میں نے اس تاریکی کے بارے میں پوچھا کہ یہ کہاں سے آئی؟ تو مجھے کہا گیا: یہ طبیعت کی تاریکی ہے، کیونکہ تاریکیاں تین ہیں جو ایک دوسرے پر جمع ہو گئی ہیں، یہاں تک کہ اگر کوئی اپنا ہاتھ نکالے تو اسے دیکھ نہیں پائے گا، تو پھر کیسے دیکھے گا؟ پس رؤیت (دیکھنے) کی قربت کی نفی کی گئی، تو رؤیت کیسے ہو سکتی ہے؟ پس تاریکی ایک الٰہی حجاب ہے جو ذات حق (الحق) کے وجود سے پردہ ڈالتا ہے۔ پس میں نے پوچھا: یہ تین تاریکیاں کیا ہیں؟ تو مجھے کہا گیا: پہلی تاریکی جو تمہیں نظر آ رہی ہے، وہ طبیعت کی تاریکی ہے، پس یہ پہلی تہہ ہے جو تمہاری بصارت کے قریب ہے۔ پھر یہ طبیعت صرف تیسرے مرتبے میں موجود ہوئی، پس اس کے اوپر حادث ممکن سبب کی تاریکی ہے جس سے یہ وجود میں آئی، اور وہ محدث سے پیدا ہونے والا وجود ہے، اور وہ نفس (النفس) ہے، پس یہ دوسری تاریکی ہے۔ پس طبیعت کی تاریکی نفس کی تاریکی سے شدید اور دوگنی ہو گئی، تو میں نے نفس کا مشاہدہ کیا اور ایک تاریکی کے اوپر دوسری تاریکی دیکھی۔ پھر مجھے کہا گیا: اس دوسری تاریکی کے اوپر ایک تیسری تاریکی ہے، اور وہ وہ سبب ہے جس سے یہ نفس وجود میں آیا، اور وہ عقل اول (العقل الأول) ہے۔ پس میرے لیے اس سے پردہ ہٹایا گیا، تو میں نے ایک تاریکی دیکھی جو ایک دوسرے کے اوپر جمع تھی۔ پس میں نے کہا: کیا اس کا کوئی اور سبب ہے جس سے یہ وجود میں آیا؟ تو مجھے کہا گیا: نہیں، بلکہ اسے ذات حق (الحق) نے بغیر کسی سبب کے پیدا کیا۔ پس میں نے کہا: تو یہ تاریک کیوں ہے؟ تو مجھے کہا گیا: یہ تاریکی اس کے لیے ذاتی ہے، اور یہ اس کے امکان (إمكانه) کی تاریکی ہے، جو اسے غیب (الغيب) کی تاریکی سے حاصل ہوتی ہے جس پر شہود (الشهود) واقع نہیں ہوتا، جیسا کہ اس چیز پر واقع ہوتا ہے جو اس میں غائب ہے جب وہ اس سے ظاہر ہو کر الگ ہو جائے اور شہادت (مشاہدہ) بن جائے۔ پس ان تین تاریکیوں سے انسان تھا، اس لحاظ سے کہ وہ اپنی ماں کے پیٹ میں حیوانی جسم (جسم حيواني) تھا، تین تاریکیوں میں: رحم کی تاریکی، مشیمہ (جھلی) کی تاریکی، اور پیٹ کی تاریکی۔ پس جب وہ پیدا ہوتا ہے تو اس کی تاریکی اس میں شامل ہو جاتی ہے، پس اس کا ظاہر نور ہوتا ہے اور اس کا باطن تاریکی۔ پس وہ اپنے باطن کی تاریکی میں صرف علم کے چراغ سے چل سکتا ہے، اگر اس کے پاس یہ چراغ نہ ہو تو وہ اس میں ہدایت نہیں پا سکتا۔ پس جب میں نے اپنے ڈھانچے اور اس کی تاریکی کو دیکھا، تو میں نے جان لیا کہ اگر اس میں کسی نہ کسی طرح کا نور نہ ہوتا، تو میرا اس کی طرف دیکھنا اور اسے سمجھنا صحیح نہ ہوتا۔ پس میں نے اس نور کے بارے میں پوچھا جو اس نے میری رؤیت کے تعلق کے لیے تیار کیا تھا، تو مجھے کہا گیا: وجود کا نور (نور الوجود)، اسی سے تم نے اسے دیکھا۔ پس میں نے اپنی طرف سے دیکھا، اس لحاظ سے کہ میں اس تاریکی کو دیکھنے والا ہوں، تو میں نے دیکھا کہ اس کا سایہ مجھ پر پھیل رہا ہے، اور میں نے اپنا نور اسے زائل کرتے ہوئے نہیں دیکھا۔ پس میں حیران ہوا۔ تو مجھے کہا گیا: تمہارے امکان (إمكانك) کی تاریکی تم سے زائل نہیں ہوگی، کیونکہ یہ تمہارے لیے ذاتی صفت ہے، کیونکہ تم اپنی ذات کے لیے واجب الوجود نہیں ہو۔ پس میں نے کہا: تو مجھے وہ نور کہاں سے ملے گا جس میں تاریکی نہ ہو؟ کہا گیا: تم اسے کبھی نہیں پاؤ گے۔ پس میں نے کہا: تو پھر میں اپنے موجد کا مشاہدہ کبھی نہیں کروں گا، کیونکہ وہ نور محض اور وجود خالص ہے۔ تو مجھے کہا گیا: تم اس کا مشاہدہ کبھی نہیں کرو گے مگر اپنی طرف سے۔ اور اسی لیے تم اسے کبھی ایک صورت میں نہیں دیکھو گے، پس تم اس کا علم سے احاطہ نہیں کر سکتے، اور نہ ہی وہ تجلی (التجلی) کرتا ہے اور نہ ہی اس کا شہود ہوتا ہے جیسا کہ وہ خود اپنا شہود کرتا ہے، کیونکہ وہ عالمین سے بے نیاز ہے۔ پس اس پر صرف اسی کے ذریعے استدلال کیا جاتا ہے، پس وہ صرف کشف (الکشف) اور شہود (الشهود) کے طریقے سے پہچانا جاتا ہے، اس حد تک جو ہم نے ذکر کی۔ اور نظری دلائل سے صرف اس کا حکم معلوم ہوتا ہے، نہ کہ اس کی عین۔ اسی لیے عقل اپنے دلیل سے اس چیز پر حکم کرتی ہے جو اس واجب الوجود (الواجب الوجود) موجود کو لازم ہے، جس میں ممکن (الممكن) اس کا محتاج ہے۔ پس یہ مقدار اس پر دلالت کرتی ہے، اور شہود (الشهود) اس سے اوپر کا ایک مرتبہ عطا کرتا ہے جس کا ذوق حاصل ہوتا ہے لیکن اسے بیان نہیں کیا جا سکتا اور نہ ہی اس کی حکایت کی جا سکتی ہے۔ پس جب اللہ نے مجھے میری ذات کا مشاہدہ کرایا اور میرے ڈھانچے کا مشاہدہ کرایا، تو اس کے بعد مجھے پورے عالم کی نسبت مجھ سے اور میرے عین کے ایجاد میں مجھ پر اس کے توجہ کا مشاہدہ کرایا۔ پس میں نے اس کی مجھ پر تقدم اور مجھ میں اس کے آثار کو دیکھا، اور میں نے اس سے اپنا انفعال (متاثر ہونا) جان لیا، اور یہ کہ اگر وہ نہ ہوتا تو میرا کوئی وجود نہ ہوتا۔ پس میں اپنے نفس میں ذلیل ہوا، جہاں میں اپنے جیسے ممکن کے قہر کے نیچے ہوں۔ اور میں نے اس وقت جان لیا کہ میں ان قلیل لوگوں میں سے ہوں جو یہ جانتے ہیں کہ آسمانوں کی تخلیق، جو میرے وجود کے لیے علوی اسباب ہیں، اور زمین کی تخلیق، جو میرے وجود کے لیے سفلی اسباب ہیں، لوگوں کی تخلیق سے قدر میں بڑی ہے، کیونکہ ان کے لیے فاعلیت کی نسبت ہے اور لوگوں کے لیے انفعال (متاثر ہونے) کی نسبت ہے۔ پس مجھ پر ایک ایسا انکسار طاری ہوا جو مجھے ذات حق (الحق) کے مشاہدے سے مایوس کرنے کے قریب تھا، اس لحاظ سے کہ ان اسباب کا مشاہدہ کروں جنہیں مجھ پر فاعلات (فاعل ہونے والی چیزوں) کی قدر میں برتری حاصل ہے۔ پس جب مجھے وہ انکسار حاصل ہوا، تو مجھے کہا گیا: یہ اسباب، اگرچہ ظاہری مرتبے میں تم پر یہ قدر رکھتے ہیں، مگر جان لو کہ تم ہی مقصود عین ہو، پس یہ اسباب صرف تمہاری وجہ سے موجود ہوئے تاکہ تم ظاہر ہو جاؤ۔ پس وہ اپنے لیے مطلوب نہیں تھے۔ کیونکہ جب اللہ نے چاہا کہ وہ پہچانا جائے، تو اسے صرف وہی پہچان سکتا تھا جو اس کی صورت پر ہو۔ اور اللہ نے انسان کامل (الإنسان الکامل) کے سوا کسی کو اپنی صورت پر پیدا نہیں کیا، نہ کہ حیوانی انسان کو۔ پس جب وہ حاصل ہوا، تو مطلوبہ معرفت (المعرفۃ) حاصل ہو گئی، پس اس نے جو اسباب پیدا کیے، وہ انسان کامل (الإنسان الکامل) کے عین کے ظہور کے لیے تھے۔ پس یہ جان لو۔ پس اس الٰہی تعریف نے میرے انکسار کو جوڑ دیا، اور میں نے جان لیا کہ میں کاملین میں سے ہوں اور میں صرف حیوانی انسان نہیں ہوں۔ پس میں نے اس نعمت پر اللہ کا شکر ادا کیا۔ پس جب اس نے مجھے عالم کی نسبت مجھ سے اور میری نسبت عالم سے مشاہدہ کرائی، اور میں نے دونوں مرتبوں میں تمیز کی، اور جان لیا کہ اگر میں نہ ہوتا تو سارا عالم موجود نہ ہوتا، اور یہ کہ میرے وجود سے اللہ کے بارے میں حادث علم (العلم الحادث) اور حادث وجود (الوجود الحادث) کا مقصد صحیح ہوا جو وجود قدیم کی صورت پر ہے۔ اور میں نے جان لیا کہ اللہ کے بارے میں محدث علم (العلم المحدث) جو اللہ کے بارے میں قدیم علم کی صورت پر ہے، صرف اسی کے لیے ممکن ہے جو اپنی تخلیق میں اس صورت پر ہو، اور وہ انسان کامل (الإنسان الکامل) کے سوا کوئی نہیں ہے۔ اور اسی لیے اسے کامل کہا گیا، اور یہ کہ وہ عالم کی روح ہے، اور عالم اس کے لیے مسخر ہے، اس کا علوی اور سفلی حصہ۔ اور حیوانی انسان (الإنسان الحيواني) اس مسخر عالم کے مجموعے میں سے ہے، اور وہ انسان کامل (الإنسان الکامل) سے ظاہری صورت میں مشابہت رکھتا ہے، نہ کہ باطن میں مرتبے کے لحاظ سے، جیسے بندر انسان سے اپنے تمام ظاہری اعضاء میں مشابہت رکھتا ہے۔ پس حیوانی انسان کے درجے پر انسان کامل کے درجے کا غور کرو۔\n\n[بے شک انسان کمال (الکمال) قبول کرنے کی استعداد رکھتا ہے]\n\nاور جان لو کہ تم کن انسانوں میں سے ہو، کیونکہ اگر تم عقل کرو تو تم کمال (الکمال) قبول کرنے کی استعداد رکھتے ہو۔ اور اسی لیے عالم کی طرف سے تنبیہ اور اطلاع ضروری ہے۔ اگر تم کمال قبول کرنے کی استعداد نہ رکھتے تو تنبیہ صحیح نہ ہوتی اور اس سے تعریف کرنا عبث اور باطل ہوتا۔ پس تم قبول نہ کرنے پر اپنے نفس کے سوا کسی کو ملامت نہ کرو جس کی طرف تمہیں بلایا گیا ہے، کیونکہ بلانے والے نے صرف بصیرت پر بلایا ہے تاکہ وہ تمہیں بصیرت میں اپنی ذات سے ملا دے۔ پس جب تم یہ جان لو اور ذات حق (الحق) تمہیں عالم کی نسبت تم سے مشاہدہ کرا دے، تو اب تم پر باقی ہے کہ تم ذات حق (الحق) کی نسبت تم سے اور تمہاری نسبت اس سے جانو۔ پس ذات حق (الحق) نے مجھے الٰہی اسماء (الأسماء الإلهية) کی نسبت مجھ سے واقف کرایا تاکہ مجھے مقصود صورت حاصل ہو جائے، تو وہ تمام الٰہی اسماء جو اس پر (اللہ پر) لاگو ہوتے ہیں، مجھ پر بھی لاگو ہوں، ان میں سے کوئی اسم کسی بھی صورت میں مجھ سے فوت نہ ہو۔\n\n[بے شک اسم مسمیٰ پر مطابقت (المطابقة) کے حکم سے دلالت کرتا ہے]\n\nپس جان لو کہ جب اسم مسمیٰ (جس کا نام لیا گیا) پر مطابقت (المطابقة) کے حکم سے دلالت کرتا ہے، تو اس سے اس کے مسمیٰ کے علاوہ کچھ نہیں سمجھا جاتا، پس وہ ایک دوسری صورت میں اس کی عین ہے جسے اسم کہا جاتا ہے۔ پس اسم اس کا اور اس کے مسمیٰ کا نام ہے۔ اور اللہ سبحانہ نے چاہا کہ وہ پہچانا جائے جیسا کہ ہم نے حادث معرفت (المعرفۃ الحادثة) سے مقرر کیا، تاکہ معرفت کے مراتب مکمل ہوں اور وجود محدث (المحدث) کے وجود سے مکمل ہو جائے۔ اور کوئی چیز صرف اپنے آپ کو یا اپنی مثل کو پہچان سکتی ہے۔ پس ضروری ہے کہ وہ موجود حادث جسے اللہ اپنے علم کے لیے پیدا کرتا ہے، اپنے موجد کی صورت پر ہو، یہاں تک کہ وہ اس کے لیے مثل (مثال) کی طرح ہو۔ کیونکہ انسان کامل (الإنسان الکامل) ایک ہی حقیقت ہے، اگرچہ وہ شخص کے لحاظ سے ایک سے زیادہ ہو، تو وہ ایک ہی عین ہے۔ اور اس کے بارے میں فرمایا: \"لَيْسَ كَمِثْلِهِ شَيْءٌ\" (اس کی مثل کوئی چیز نہیں)، پس اسے مثل بنایا اور مماثلت کی نفی کی۔ پس جب اسے وجود میں مثل کے طور پر کھڑا کیا گیا، تو الٰہی اسماء (الأسماء الإلهية) مطابقت (المطابقة) کے حکم سے اس کی طرف دوڑے، اس لحاظ سے کہ اسماء ذات صور اور لفظی و رقمی حروف رکھتے ہیں، جیسا کہ انسان جسمانی صورت رکھتا ہے۔ پس یہ الٰہی اسماء اس انسان کامل (الإنسان الکامل) پر مسمیٰ (اللہ) سے زیادہ مطابقت رکھتے تھے۔ اور چونکہ مثل اپنے مثل سے کسی ایسے امر سے ممتاز ہوتا ہے جو صرف اسی کے لیے ہو اور اس کا مثل اس میں شریک نہ ہو، تو ذات حق (الحق) کی طرف سے وہ اسم جس سے مثل اپنے مثل سے ممتاز ہوتا ہے اور اس میں شریک نہیں ہوتا، وہ اسم \"اللہ\" ہے۔ پس وہ عین جس سے مثل اپنے مثل سے خاص ہوا، وہ اسم \"اللہ\" تھا، اور دوسرے مثل کے لیے وہ اسم \"انسان کامل خلیفہ\" (الإنسان الکامل الخليفة) تھا، جو اس کونی مثل (المثل الکوني) کے ساتھ خاص ہے۔ اور ذات حق (الحق) کے باقی اسماء روح اور صورت سے مرکب ہیں۔ پس اپنی صورت کے لحاظ سے وہ مطابقت (المطابقة) کے حکم سے انسان پر دلالت کرتے ہیں، اور اپنی روح اور معنی کے لحاظ سے وہ مطابقت (المطابقة) کے حکم سے اللہ پر دلالت کرتے ہیں۔ اور ہماری ایک حالت ہے اور اس کی ایک حالت ہے، اور اسماء ان احوال کی پیروی کرتے ہیں۔ پس ہمارے لیے جب ہم چاہیں صورتوں سے تجرید (علیحدگی) ہے۔ پس جو ہماری ذات سے ہے وہ صورتیں ہیں، لیکن ہماری ذات کی حقیقت سے یہ بھی ہے کہ جب ہم چاہیں ان سے تجرد اختیار کر لیں۔ پس اسماء ہماری پیروی کرتے ہیں ہماری تجرید کی حالت میں، اپنی ان روحوں کے لحاظ سے جو اپنی صورتوں سے مجرد ہیں۔ اور اس کے لیے صورتوں سے التباس (مل جانا) ہے، اور وہ بالذات غیر صورت ہے، اور بالذات بھی وہ صورتوں میں ہمارے لیے تجلی (التجلی) قبول کرتا ہے۔ پس اسماء اس کی پیروی کرتے ہیں، عین اس کی صورتوں کے لحاظ سے جب وہ جب چاہے صورت اختیار کرے۔ پس ہمارے اور اس کے درمیان معاملہ برابر ہے، اس موجود محقق فرقان کے ساتھ کہ وہ خالق ہے اور ہم مخلوق ہیں، وہ اللہ ہے اور میں انسان خلیفہ ہوں۔ پس وہ ہمیں خلافت (الخلافة) میں شریک کرتا ہے، صورت کے متحقق ہونے کی وجہ سے، کیونکہ اس نے ہمیں حکم دیا کہ ہم اسے وکیل بنائیں، اور وکالت خلافت ہے۔ پس وہ چیز جو اس کے ساتھ خاص ہے اور جس سے وہ مجھ سے ممتاز ہوتا ہے، وہ اسم \"اللہ\" ہے، صورت اور معنی کے لحاظ سے۔ پس جب وہ صورت میں تجلی (التجلی) کرتا ہے، تو اسم \"اللہ\" کی صورت مطابقت (المطابقة) کے حکم سے اس پر لاگو ہوتی ہے، اور جب وہ کسی صورت کی قید کے بغیر اپنی حالت پر باقی رہتا ہے، تو اسم \"اللہ\" کی روح اس پر لاگو ہوتی ہے۔ اسی طرح انسان، یہ اسم ہی ہے جو اسے اس سے ممتاز کرتا ہے۔ اور اس کے لیے اپنی ذات کی صورت پر باقی رہنے کی حالت ہے، اور اس کے لیے تجرید بھی ہے۔ اور اگر عالم میں کوئی ایسا نہ ہوتا جو ذات حق (الحق) کی صورت پر ہو، تو ذات حق (الحق) کے علم کا مقصود حاصل نہ ہوتا، یعنی وہ حادث علم جو اس کے قول میں ہے: \"میں ایک چھپا ہوا خزانہ تھا، میں نے چاہا کہ پہچانا جاؤں، پس میں نے مخلوق کو پیدا کیا اور ان سے اپنا تعارف کرایا، تو انہوں نے مجھے پہچانا۔\" پس اس نے اپنے آپ کو خزانہ بنایا، اور خزانہ صرف کسی چیز میں چھپا ہوا ہوتا ہے۔ پس ذات حق (الحق) کا خزانہ صرف انسان کامل (الإنسان الکامل) کی صورت میں تھا، اس کی شیئیت اور ثبوت میں، وہاں ذات حق (الحق) چھپا ہوا تھا۔ پس جب ذات حق (الحق) نے انسان کو وجود کی شیئیت کا لباس پہنایا، تو خزانہ اس کے ظاہر ہونے سے ظاہر ہوا، پس انسان کامل (الإنسان الکامل) نے اپنے وجود سے اسے پہچانا، اور جان لیا کہ وہ اس کے ثبوت کی شیئیت میں اس میں چھپا ہوا تھا، اور وہ اسے محسوس نہیں کرتا تھا۔ پس میں نے تمہیں اسماء کی نسبت اس سے آگاہ کر دیا۔ اللہ تعالیٰ نے فرمایا: \"وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا\" (اور اس نے آدم کو تمام اسماء سکھا دیے)۔ اور لفظ \"کل\" (سب) احاطہ اور عموم کا تقاضا کرتا ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اپنے رب سے دعا میں فرمایا: \"اللهم إني أسألك بكل اسم سميت به نفسك\" (اے اللہ! میں تجھ سے تیرے ہر اس نام کے واسطے سے سوال کرتا ہوں جو تو نے اپنا نام رکھا)۔ پس یہ ایک حقیقی اضافت ہے، اور یہ چیز کی اضافت اپنی ذات کی طرف ہے، جب دو مختلف الفاظ ذکر کیے گئے تو اضافت صحیح ہو گئی، جیسے حق الیقین (حق اليقين) اور علم الیقین (علم اليقين)، اور عین ایک ہی ہے، اور وہ لفظ \"نفس\" اور کاف خطاب ہے۔ اور ہم نے یہ اس لیے کہا کہ اہل لسان (زبان کے ماہرین) نے دلائل کے ذریعے کہا ہے کہ چیز کی اضافت اپنی ذات کی طرف نہیں ہوتی، اور یہ قول صحیح ہے، مگر یہاں اضافت صورت میں واقع ہوئی ہے، اور صورتیں دو ہیں، پس ایک صورت کی اضافت دوسری کی طرف جائز ہو گئی، اور وہ نفس اور کاف خطاب ہے، اور حق الیقین، علم الیقین اور عین الیقین کی طرح ہے۔ اور دوسرا پہلو یہ ہے کہ نفس سے مراد انسان کامل (الإنسان الکامل) کا نفس ہو جو تمام الٰہی اور کونی اسماء کو قبول کرنے والا ہے، کیونکہ کونی اسماء بھی مطابقت (المطابقة) کے حکم سے اس پر دلالت کرتے ہیں، سوائے ان کے جو محدث (پیدا کی گئی چیز) کے ساتھ خاص ہیں، جیسے اللہ کے لیے غنی ہونا اور انسان کے لیے، بلکہ پورے عالم کے لیے، فقر (محتاجی)۔ پس یہاں نفس کی اضافت کاف خطاب کی طرف ہے جو ذات حق (الحق) ہے، اور یہ ملکیت، تشریف (عزت) اور استحقاق کی اضافت ہو گی۔ پس ملکیت کی اضافت جیسے زید کا مال، اور تشریف کی اضافت جیسے عبد الملک اور اس کا خادم، اور استحقاق کی اضافت جیسے چوپائے کی زین اور گھر کا دروازہ۔ اور یہ سب اس کے قول \"نفسك\" (تیرا نفس) میں جائز ہیں، اگر اس سے انسان مراد ہو، جیسے عیسیٰ علیہ السلام کا قول: \"وَلَا أَعْلَمُ مَا فِي نَفْسِكَ\" (اور میں نہیں جانتا جو تیرے نفس میں ہے)۔ یہاں اس نفس سے مراد عیسیٰ کا نفس ہے، جسے انہوں نے ذات حق (الحق) کی طرف منسوب کیا جیسا کہ وہ اصل میں ہے، اور یہ اللہ کی ثنا اور اس چیز سے براءت میں زیادہ مکمل ہے جو ان کی طرف منسوب کی گئی اور جس پر انہیں مقرر کیا گیا اور جس کے بارے میں ان سے پوچھا گیا، ان کے اس قول سے: \"أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَهَيْنِ مِنْ دُونِ اللَّهِ\" (کیا تم نے لوگوں سے کہا تھا کہ مجھے اور میری ماں کو اللہ کے سوا دو معبود بنا لو؟) تو انہوں نے فرمایا: \"تَعْلَمُ مَا فِي نَفْسِي وَلَا أَعْلَمُ مَا فِيهَا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ\" (تو جانتا ہے جو میرے نفس میں ہے اور میں نہیں جانتا جو تیرے نفس میں ہے، بے شک تو ہی غیبوں کا جاننے والا ہے)۔ کیونکہ اس میں وہی ہو سکتا ہے جو تو اس میں رکھے۔ پس اس سے کیسے پوچھا جائے جس کے لیے \"الْخَلْقُ وَالْأَمْرُ\" (تخلیق اور حکم) ہے؟ اور اس نے یہ نہیں کہا کہ میں نے یہ نہیں کہا کہ میں معبود ہوں، کیونکہ وہ جانتے تھے کہ وہ خلیفہ اور انسان کامل (الإنسان الکامل) ہیں اور الٰہی اسماء ان کے لیے ہیں۔ پس انہوں نے فرمایا: \"مَا قُلْتُ لَهُمْ إِلَّا مَا أَمَرْتَنِي بِهِ\" (میں نے ان سے صرف وہی کہا جس کا تو نے مجھے حکم دیا)۔ میں نے اس پر کوئی اضافہ نہیں کیا۔ اور جب کہنے والا وہ کہے جس کا اسے حکم دیا گیا ہے، تو یہ ضروری نہیں کہ وہ ہر وہ چیز کہے جو اس پر ہے، کیونکہ اسے وہ کہنے کا حکم نہیں دیا گیا تھا۔ اور اس نے تبلیغ کر کے ذمہ داری پوری کر دی۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا: \"أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ غَيْبِكَ\" (یا تو نے اسے اپنی مخلوق میں سے کسی کو سکھایا ہو یا اسے اپنے علم غیب میں خاص کر لیا ہو)۔ پس انہوں نے ذکر کیا کہ اللہ تعالیٰ نے اپنے علم غیب میں کسی چیز کو خاص کر لیا ہے جسے صرف وہی جانتا ہے، اور وہ صرف وہی ہو سکتا ہے جو انسان کامل (الإنسان الکامل) کے لیے ممکن ہو، لیکن اللہ تعالیٰ نے اسے اپنے علم غیب میں خاص کر لیا ہے جسے صرف وہی جانتا ہے۔ پس انسان کے بارے میں وہ علم جو اس پر ہے، وہ انسان کامل (الإنسان الکامل) اپنے نفس کے بارے میں نہیں جانتا۔ پس وہ ذات حق (الحق) کا غیب ہے، کیونکہ وہ مثل ہے۔ پس محمد صلی اللہ علیہ وسلم کا قول اور عیسیٰ علیہ السلام کا قول ایک ہی امر میں جمع ہو گیا، اور وہ ان کا قول ہے: \"وَلَا أَعْلَمُ مَا فِي نَفْسِكَ\" اور محمد صلی اللہ علیہ وسلم کا قول: \"أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ غَيْبِكَ\"۔ پس انسان کامل (الإنسان الکامل) تمام اسماء کا محل ہے جنہیں قبول کرنے کی اس میں قوت ہے، اور جو اس میں قبول کرنے کی قوت نہیں ہے، وہ اسے قبول نہیں کر سکتا۔ پس وہ ان اسماء میں سے نہیں ہے جن کے بارے میں کہا جائے کہ وہ ان سے ناقص ہے، جیسے وہ اسماء جو انسان کے ساتھ خاص ہیں اور اللہ پر لاگو نہیں ہو سکتے، اور یہ نہیں کہا جائے گا کہ اللہ اس اسم کے اطلاق سے ناقص ہے۔ پس \"تمام اسماء\" کا معنی یہ ہے کہ ہر وہ اسم جو اس مسمیٰ کی حقیقت میں ہے، وہ اسے قبول کرے۔ پس یہ جان لو۔ پس جس نے الٰہی اسماء کی نسبت انسان سے اور کونی اسماء کی نسبت اللہ سے جان لی، وہ انسان کے مرتبے کو جان لے گا اور پورے عالم سے اس کے امتیاز اور اس کے شرف کو جان لے گا، اس جامعیت کی وجہ سے جو اس میں ہے، جیسے ہر علم میں ذوق رکھنے والا ماہر۔ اور بسا اوقات کسی خاص علم کا مالک اس علم میں اس سے زیادہ کامل ہوتا ہے، باوجود اس کے کہ وہ شریک ہوتا ہے۔ پس وہ ایک خاص پہلو سے اس سے افضل ہوتا ہے، اور یہ جامعیت (الجمعية) کے لحاظ سے افضل ہوتا ہے۔ جیسا کہ ہم نقص میں فضیلت کے بارے میں کہتے ہیں، تو ہم کند ذہن کو گدھا کہتے ہیں، اور یہ قطعی طور پر معلوم ہے کہ گدھا کند ذہنی میں انسان سے افضل ہے، کیونکہ وہ اس سے زیادہ کند ہے۔ اسی طرح فرشتہ انسان سے اطاعت میں افضل ہے، اور اللہ نے اس کی گواہی دی ہے، اور یہ اس کی بشری لباس سے عاری ہونے کی وجہ سے ہے، پس وہ اللہ کی نافرمانی نہیں کرتا جس کا اسے حکم دیا گیا ہے، کیونکہ وہ متضاد حقائق پر نہیں ہے جو اسے اوقات میں کھینچتی ہیں اور اسے اس چیز سے غافل اور بھلا دیتی ہیں جس کی طرف اسے بلایا گیا ہے، جیسا کہ عنصری نشأت میں پایا جاتا ہے۔ اور انسان ایک عنصری نشأت ہے جسے متجاذب حقائق بالفعل طلب کرتی ہیں، وہ غفلت اور نسیان کا مالک ہے، اسے حکم دیا جاتا ہے اور منع کیا جاتا ہے، پس اس سے مخالفت اور موافقت کا تصور کیا جاتا ہے۔ پس فرشتہ اللہ کی موافقت میں انسان سے زیادہ شدید ہے، اس نشأت کی وجہ سے جو اسے اور انسان کی نشأت کو عطا کی گئی ہے۔ اللہ تعالیٰ نے فرشتے کے بارے میں فرمایا: \"لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ\" (وہ اللہ کی نافرمانی نہیں کرتے جس کا اس نے انہیں حکم دیا)۔ اور خلیفہ کے بارے میں، جسے اس نے اسماء سکھائے، فرمایا: \"وَعَصَىٰ آدَمُ رَبَّهُ فَغَوَىٰ\" (اور آدم نے اپنے رب کی نافرمانی کی اور گمراہ ہو گیا)۔ پس اسے معصیت سے متصف کیا۔ پس فرشتہ اللہ کے حکم کی موافقت میں افضل ہے، اور خلیفہ انسان الٰہی اسماء کا زیادہ جاننے والا ہے، کیونکہ خلیفہ اگر اس چیز کے ساتھ ظاہر نہ ہو جس کا اس کا خلیفہ بنانے والا مستحق ہے، یہاں تک کہ اس کی اطاعت بھی کی جائے اور نافرمانی بھی، ورنہ وہ خلیفہ نہیں ہے۔ پس وہ جامعیت (الجمعية) میں زیادہ مکمل اور افضل ہے، اور فرشتہ ایک خاص پہلو یا دو پہلوؤں سے افضل ہے۔ لیکن اس کے پاس جمع اور صورت کی فضیلت نہیں ہے، اور صورت صرف مجموعے سے ہوتی ہے، ورنہ وہ مثالی صورت نہیں ہے۔ اور صورت اور اس کے کمال میں وہ چیز نقص پیدا نہیں کرتی جس سے صورت اپنے مثل پر ممتاز ہوتی ہے، کیونکہ یہ ضروری ہے، اور اگر ایسا نہ ہوتا تو صورت مثل نہ ہوتی بلکہ عین وہی ہوتی، اور یہ معلوم ہے کہ معاملہ ایسا نہیں ہے۔ اور اس مقام میں کلام تقریباً لامتناہی حد تک پھیل سکتا ہے۔ پس ہم اسی پر اکتفا کرتے ہیں جو ہم نے ذکر کیا، اور ہم ان علوم میں سے کچھ ذکر کرتے ہیں جو اس میں شامل ہیں، جیسا کہ پہلے گزر چکا ہے۔ پس ان میں سے ایک علم الرسوم الطامسہ (مٹ جانے والے نقوش کا علم) اور ان کے مراتب اور ان حقائق میں ان کا انحصار ہے جن میں وہ محصور ہیں۔ اور اس میں اس شخص کا علم ہے جس کا حکم رد کر دیا گیا تو وہ اپنے آپ کو قتل کرنے کے قریب ہو گیا، اور یہ تنگی اور حرج کی دلیل ہے۔ اور کیا یہ انسان کے کمال میں سے ہے یا نہیں؟ کیونکہ اللہ نے اپنے آپ کو غضب اور انتقام سے موصوف کیا ہے۔ پس یہ انسان، جب اس کے لیے اپنی قوت سے یہ ممکن نہ ہوا کہ وہ اس پر اپنا غضب بھیجے جس سے وہ انتقام لینا چاہتا ہے، تو اس نے چاہا کہ وہ اسے اپنے نفس پر بھیجے اور اپنے آپ کو قتل کر دے۔ پس وہ ناقص کامل ہے۔ پس اللہ نے اسے اذیت برداشت کرنے پر صبر عطا کیا، تو اس نے اس چیز کا مقابلہ کیا جو طبع کو اس شخص پر غیظ سے محسوس ہوتی ہے جو اس کی بات اور حکم کو رد کرتا ہے اور اس کا مقابلہ کرنا چاہتا ہے۔ اور اس میں تسکین کا علم ہے، اور اس پر خوشی کا وجود جس پر بھروسہ کیا جاتا ہے، جب وہ اس کے ساتھ نرمی کے طریقے پر خطاب میں نازل ہوتا ہے، اس چیز کی وجہ سے جو وہ محسوس کرتا ہے، اور وہ یہ ہے کہ وہ اسے اس چیز سے مخاطب کرے جسے وہ اپنے نفس میں جانتا ہے، اس امر میں جس نے اسے غصہ دلایا، تو وہ اسے دکھاتا ہے کہ اس سے بڑا بھی غصہ دلایا گیا ہے، تو وہ اپنے نفس میں اس کے لیے عزت محسوس کرتا ہے۔ اور اسی لیے اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا: \"نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ\" (ہم آپ پر رسولوں کی خبروں میں سے وہ بیان کرتے ہیں جس سے ہم آپ کے دل کو مضبوط کریں)۔ اور اس میں ہر اس شخص کا علم ہے جس نے کوئی جرم کیا تو وہ اپنے نفس پر ہی جرم کرتا ہے، کیونکہ اعمال صرف اپنے عامل کی طرف منسوب ہوتے ہیں، اور اگر وہ غیر عامل کی طرف منسوب کیے جائیں تو تم نے ان کا حق غصب کر لیا۔ اور اس میں استبصار (بصیرت حاصل کرنے) کا علم ہے۔ اور اس میں امزجہ (مزاجوں) کا علم ہے، پس اس سے معلوم ہوتا ہے کہ جو چیز زید کو نقصان دیتی ہے وہ عمرو کو فائدہ دیتی ہے، اور جو خالد کے لیے دوا ہے وہ حسن کے لیے بیماری ہے۔ اور اس میں ذات حق (الحق) کی ندا کا علم ہے اور ندا کی احدیت (یکتائی) کے ساتھ اس کا اختلاف۔ اور اس میں منادی (پکارنے والے) کے جواب کے آداب کا علم ہے۔ اور اس میں لطف کے ذریعے استنزال (نزول طلب کرنے) کا علم ہے۔ اور اس میں جبر (مجبوری) کا علم ہے۔ اور اس میں کونی تقریر (کائناتی بیان) کا علم ہے، اور اعلیٰ کا ادنیٰ سے لطف کے ساتھ مخاطب ہونے کے لیے نزول، باوجود اس کے کہ وہ صورت میں اس پر قاہر ہے۔ پس اسے اس سے کیا چیز روکتی ہے؟ کیا یہ کوئی پوشیدہ قہر ہے جہاں سے وہ محسوس نہیں کرتا، یا یہ اس رحمت کی وجہ سے ہے جو اس پر مقرر یا جبلی ہے؟ اور اس میں عالم کو اعلیٰ امور کے حصول پر تنبیہ کرنے کا علم ہے، ان کے اسباب کو اس شخص کے لیے ظاہر کر کے جو انہیں نہیں جانتا۔ اور اس میں سائلین کے جواب سے حیرت کے اسباب کا علم ہے، جب سوال ایسا ہو جس پر سائل کے سوال کے مطابق جواب کا تصور نہ ہو سکے۔ اور کیا ہر سوال جواب کا تقاضا کرتا ہے یا نہیں؟ اور سوال عین جواب ہے، کلام کی احدیت (یکتائی) کے لحاظ سے، اور واحد میں تفصیل اور تقسیم واقع نہیں ہوتی۔ اور سوال عین جواب نہیں ہے، اور کلام احدی العین ہے، تو تقسیم کی جگہ کہاں ہے؟ اور اس میں جدل (بحث) کا علم ہے، باوجود اس کے کہ بحث کرنے والا جانتا ہے کہ وہ باطل پر ہے اور اس کا فریق حق پر ہے۔ تو وہ اپنی بحث پر کیوں قائم رہتا ہے جبکہ حق اس کے نفس میں واضح ہو چکا ہے؟ پس کیا اس کے لیے کوئی ایسا پہلو ہے جو حق کے لیے ہو، یا وہ تمام پہلوؤں سے باطل ہے؟ اور اگر وہ تمام پہلوؤں سے باطل ہے، تو باطل عدم ہے، اور عدم وجود کا مقابلہ نہیں کر سکتا، کیونکہ لاشے (کچھ نہیں) شے (چیز) سے زیادہ قوی نہیں ہو سکتا۔ اور اس میں مدد (مساعدہ) کے نتائج کا علم ہے۔ اور اس میں ڈانٹنے اور ڈرانے کا علم ہے، اور قضا اور مقضی (فیصلہ اور جس کا فیصلہ کیا گیا) دونوں پر راضی ہونے کا علم، اس قوت کی وجہ سے جو راضی ہونے والے میں ہوتی ہے۔ اور یہ کہ مقضی میں سے کس چیز پر راضی ہونا چاہیے اور کس پر نہیں راضی ہونا چاہیے۔ اور اس میں کثرت پر بھروسہ کرنے کے اثر کا علم ہے، اس قوت میں جو بھروسہ کرنے والے کے نفس میں ہوتی ہے، اور اگر وہ ناکام ہو جائے، تو بسا اوقات ایک شخص کو اتنی قوت عطا کی جاتی ہے جو کثیر کی قوت سے زیادہ ہوتی ہے، تو کثیر اس کا مقابلہ نہیں کر سکتا۔ اور اس میں کون (وجود) کا کون میں اثر کا علم ہے، کیا یہ کسی الٰہی امر کا محتاج ہے یا علم کا، یا ان میں سے کچھ علم سے ہوتا ہے اور کچھ الٰہی امر سے، اور اس میں مخلوق کے مراتب کا علم ہے۔ اور اس میں خبروں کو بیان کرنے کا علم ہے، اور ان کا وہ زائد فائدہ کیا ہے جو نفوس کو ان سے مانوس کرنے کے علاوہ ہے، کیونکہ نفوس اپنی طبع کے مطابق باتوں کو میٹھا سمجھتی ہیں۔ اور اس میں علم میں عالم کی فضیلت کا علم ہے۔ اور اس میں ان امور کا علم ہے جنہیں ذات حق (الحق) کی طرف منسوب کرنا چاہیے اور جنہیں نہیں کرنا چاہیے، اگرچہ وہ اس کے لیے ہوں۔ اور اس میں نفس کی عزت کا علم ہے کہ اس کے ساتھ مذموم صفات کو لاحق کیا جائے، باوجود اس کے کہ وہ ان سے متصف ہے، تو اسے کیا چیز پردہ ڈالتی ہے کہ وہ مذموم صفات سے متصف ہو اور یہ پسند نہ کرے کہ اسے ان سے موصوف کیا جائے۔ اور اس میں نفوس کی ایک دوسرے پر مطلقاً فضیلت کا علم ہے۔ اور اس میں نعمتوں کے دوام اور اس کے برعکس کے عدم دوام کا سبب کا علم ہے۔ اور اس میں مدد (المدد) کا علم ہے، اور کیوں ان کا اختتام اس چیز کی طرف لوٹتا ہے جسے اختتام سے موصوف کیا جاتا ہے، کیا یہ ان میں موجود فعل کی وجہ سے ہے یا کسی دوسرے امر کی وجہ سے؟ اور اس میں زمانے کی تقسیم کا علم ہے، حالانکہ وہ ایک ہی عین ہے۔ اور اس میں اعمال کا بدلہ طلب کرنے کا علم ہے، اگرچہ عمل کرنے والے اس سے پاک ہوں۔ اور اس میں کس کا مرتبہ اعلیٰ ہے، کیا وہ جو عوض طلب کرنے سے پاک ہے یا عوض طلب کرنے والا؟ اور اس میں عالم میں رسالت کے آغاز کا سبب کا علم ہے، اور کیا عالم میں کوئی ایسا ہے جو تکلیف (شرعی ذمہ داری) سے باہر ہو گیا ہو یا نہیں؟ اور اس میں اعلیٰ کا ادنیٰ سے کس چیز سے امتیاز ہوتا ہے، کیا اپنی ذات سے یا کسی نسبی امر سے، اور ان دونوں میں سے اشرف کون ہے؟ اور اس میں حالات اور زمانوں کے اختلاف کی وجہ سے آیات کے اختلاف کا علم ہے، اور اس کا الٰہی علم سے کیا تعلق ہے؟ اور اس میں وسیع کا تنگی میں داخل ہونے کا علم ہے، بغیر اس کے کہ تنگی وسیع ہو یا وسیع تنگ ہو جائے۔ اور اس میں ہر صنف میں مذکر اور مؤنث کے درمیان فرق کا علم ہے۔ اور اس میں اس شخص کا علم ہے جس پر اخوت (بھائی چارہ) کا نام صحیح ہوتا ہے اور جس پر نہیں ہوتا، اور اخوت کے مراتب کا علم ہے۔ اور اس میں الٰہی اور مقرر کردہ موازنات (توازن) کا علم ہے۔ اور اس میں اس سبب کا علم ہے جو انسان کے ساتھ قائم ہوتا ہے یہاں تک کہ اس کا دل ذات حق (الحق) کے راستے سے اندھا ہو جاتا ہے، باوجود اس کے کہ وہ امکان (الإمكان) کو جانتا ہے، اور یہ عجیب ترین چیزوں میں سے ہے، جیسے اس شخص کا قول جس نے کہا: \"اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ\" (اے اللہ! اگر یہ تیری طرف سے حق ہے تو ہم پر آسمان سے پتھر برسا)۔ باوجود اس کے کہ وہ جانتے تھے کہ یہ ممکن ہے، اور اللہ نے انہیں یہ کہنے کی توفیق نہیں دی کہ ہم پر توبہ قبول فرما یا ہمیں سعادت بخش۔ اور اس میں انسان میں الٰہی وحی کے مراتب کا علم ہے۔ اور اس میں اس دلالت کا علم ہے جسے رد نہیں کیا جا سکتا۔ اور اس میں نظم اور منظوم اور نثر اور منثور کے درمیان فرق کا علم ہے، اور یہ مقید اور مطلق کا علم ہے۔ اور اس میں ایک حال سے دوسرے حال اور ایک منزل سے دوسری منزل میں پلٹنے کا علم ہے۔ اور اس میں ناری ارواح (الأرواح النارية) کے نزول کا علم ہے کہ وہ کہاں سے نازل ہوتی ہیں، اور کس پر نازل ہوتی ہیں، اور ان کا محل کہاں ہے، اور ان کی طرف کیا منسوب کرنا چاہیے؟ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و پنجاه و هشتم در معرفت منزل سه سرّ که انوار، قرار، ابدار (ظهور) و اخبار صحیح آن‌ها متفاوت است.\n\nهمانا مقادیر، وزن‌هایی منظم‌اند (إن المقادير أوزان منظمة) *** که سایه‌هایی از بالای آن‌ها سایه‌هایی دیگر می‌آورد (تأتي بها ظلل من فوقها ظلل‏).\nاز ابر و از غیر ابر دیده می‌شود (من الغمام ومن غير الغمام يرى) *** هنگام تنزل در اعجاز آن‌ها، خستگی (کلل) است (عند التنزل في إعجازها كلل‏).\nدر برگیرنده هر معنایی است که آشکار نمی‌شود (تحوي على كل معنى ليس يظهره) *** مگر با خطابه، اشعار و مَثَل‌ها (إلا الخطابة والأشعار والمثل‏).\nپس برخی از آن ستوده است و بالا می‌رود (فمنه ما هو محمود فمرتفع) *** و برخی از آن نکوهیده است و فرود می‌آید (ومنه ما هو مذموم فمنسفل‏).\nو هر کس در آنچه بر زبان می‌آورم با من نزاع کند (ومن ينازعني فيما أفوه به) *** همه مردم دشمن چیزی هستند که نمی‌دانند (فالناس كلهم أعداء ما جهلوا).\n\n### [اینکه نفس ناطقه (النفس الناطقة) در دنیا و آخرت سعادتمند است]\n\nبدان، خداوند ما و تو را به سعادت ابدی رسانَد، که نفس ناطقه (النفس الناطقة) در دنیا و آخرت سعادتمند است و بهره‌ای از شقاوت ندارد، زیرا از عالم شقاوت نیست. مگر اینکه خداوند آن را بر این مرکب بدنی سوار کرده است که از آن به نفس حیوانی (النفس الحيوانية) تعبیر می‌شود؛ پس نفس ناطقه برای آن مانند سوارکار است و نفس حیوانی مانند مرکب. نفس ناطقه در این مرکب حیوانی وظیفه‌ای جز حرکت دادن آن در راه مستقیمی که حق (الحق) برایش تعیین کرده، ندارد. اگر نفس حیوانی اجابت کند، آن مرکبی رام و تربیت شده است؛ و اگر سرپیچی کند، آن دابه‌ای سرکش است که هرگاه سوارکار بخواهد آن را به راه بازگرداند، لجاجت کرده و سرکشی می‌کند و به دلیل قدرت سر و سوء ترکیب مزاجش، به راست و چپ می‌رود. نفس حیوانی قصد مخالفت ندارد و مرتکب معصیت نمی‌شود تا حرمت شریعت را بشکند، بلکه بر اساس طبع خود عمل می‌کند، زیرا به شریعت عالم نیست و اتفاقاً بر مزاجی است که با آنچه سوارکار از آن می‌خواهد، موافق نیست. نفس ناطقه (النفس الناطقة) نمی‌تواند مرتکب مخالفت شود، زیرا از عالم عصمت و ارواح طاهره است. پس اگر روز قیامت عقابی واقع شود، تنها بر نفس حیوانی واقع می‌شود، همان‌گونه که سوارکار، دابه‌اش را اگر سرکشی کند و از راهی که صاحبش می‌خواهد برود، خارج شود، می‌زند. آیا نمی‌بینی که حدود (مجازات‌ها) در زنا، سرقت، محاربه و افترا، تنها محلشان نفس حیوانی بدنی است؟ و این نفس است که درد قتل، قطع دست و ضربه بر پشت را حس می‌کند. پس حدود بر جسم اقامه شد و درد بر نفس حساس حیوانی که تمام حیوانات حس‌کننده درد در آن جمع می‌شوند، وارد گشت. بنابراین، هیچ تفاوتی بین محل عذاب در انسان و تمام حیوانات در دنیا و آخرت نیست، در حالی که نفس ناطقه (النفس الناطقة) با عالم خود در سعادت دائمی‌اش بر شرف و بزرگی است.\n\nآیا نمی‌بینی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) برای جنازه یک یهودی برخاست؟ به او گفته شد که این جنازه یک یهودی است. پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «آیا او یک نفس نیست؟» (أ ليست نفسا).\n\nپس به چیزی جز ذات آن تعلیل نکرد و برای بزرگداشت و تعظیم شرف و جایگاه آن برخاست. چگونه شرف نداشته باشد در حالی که از روح خدا دمیده شده است؟ پس او از عالم اشرف، ملکی، روحانی و عالم طهارت است. بنابراین، تفاوتی بین نفس ناطقه (النفس الناطقة) با این نفس بدنی حیوانی و سوارکار بر دابه در ظاهر نیست؛ یا سرکش است یا رام. پس برای تو آشکار شد که نفس ناطقه (النفس الناطقة) عصیان نکرده است، بلکه نفس حیوانی (النفس الحيوانية) او را در آنچه خواسته، یاری نکرده است. و نفس حیوانی مورد خطاب تکلیف قرار نگرفته تا به طاعت یا معصیت متصف شود. اتفاقاً اگر سرکش باشد، این اقتضای طبع او به دلیل مزاج خاص است. پس این را بدان. و همانا خداوند رحمتش همه را فرا می‌گیرد، زیرا رحمت خدا بر غضبش پیشی گرفت، هنگامی که هر دو به سوی انسان جاری شدند.\n\n### [اینکه جود الهی پیوسته بر اعیان (الأعيان) با ایجاد منت می‌نهد]\n\nو بدان که خداوند متعال پیوسته به اعیان (الأعيان) ممکنات در حال عدمشان نظر داشته است و جود الهی (الجود الإلهي) پیوسته بر آن‌ها با ایجاد (الإيجاد) منت می‌نهد، بر اساس آنچه علم از پیش به تقدم برخی بر برخی دیگر در هستی (الوجود) با ایجاد، سبقت گرفته است. و چون آنچه بقای جوهر کل (الجوهر الكل) به آن است، ممکن نیست مگر به قیام برخی ممکنات به آن، از آنچه به خودی خود قائم نیست، حفظ الهی پیوسته بقای آن‌ها را به واسطه آن حفظ می‌کند. در حالی که آن‌ها در ذات خود بقا را نمی‌پذیرند مگر در زمان وجودشان. پس جود الهی (الجود الإلهي) پیوسته برای این جوهر کل که خداوند صورت‌های عالم را در آن گشوده است، آنچه بقای آن به واسطه ممکنات شرطی است، ایجاد می‌کند. پس خداوند پیوسته خالق و پیوسته حافظ آن است. و همچنین، اگر نه این بود که سبحانه و تعالی سرّ حیات را در موجودات جاری ساخت، ناطق نمی‌شدند. و اگر نه جریان علم در آن‌ها بود، به ثنای خداوند، ایجادکننده‌شان، ناطق نمی‌شدند. به همین دلیل فرمود: «و هیچ چیز نیست مگر اینکه با ستایش او تسبیح می‌گوید» (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ). پس لفظ نکره (شیء) را آورد و چیزی ثابت را از چیزی موجود تخصیص نداد، زیرا آن‌ها شیئیت هستی (شيئية الوجود) را بر همان حالی که در شیئیت ثبوت (شيئية الثبوت) بودند، پذیرفتند. و خداوند ما را آگاه ساخت که در حال عدمشان با آن‌ها سخن گفته است و آن‌ها امر او را هنگام توجه خطاب امتثال کردند و به سرعت به اجرای آنچه به آن‌ها امر شده بود، پرداختند. اگر نه این بود که در حال عدمشان به صفاتی که در حال وجود دارند، متصف بودند، حق (الحق) آن‌ها را به آنچه وصف کرده، وصف نمی‌کرد، و اوست صادق و خبردهنده به حقایق اشیا بر همان‌گونه که هستند. پس اعیان موجودات ظاهر نشدند مگر به همان حالی که در حال عدم بودند. پس چیزی جز هستی (الوجود) را از حیث اعیانشان و از حیث آنچه بقایشان به آن است، کسب نکردند. پس هر آنچه اعیان قائم به خود بر آن هستند، ذاتی آن‌هاست، اگرچه اعراض با امثال و اضداد بر آن‌ها تغییر کند. جز اینکه حکم آن‌ها در حال عدمشان، حکم آن‌ها در حال وجودشان نیست، از حیث امری خاص. و آن این است که حکم آن‌ها در حال عدمشان ذاتی آن‌هاست و حق (الحق) در آن حکمی ندارد، و اگر حکمی داشت، عدم صفت ذاتی آن‌ها نمی‌بود. پس ممکنات در حال عدمشان پیوسته به حق (الحق) نظر دارند، به همان احوالی که بر آن هستند و هیچ حالی بر آن‌ها تغییر نمی‌کند تا اینکه به هستی (الوجود) متصف شوند. در این صورت احوال بر آن‌ها تغییر می‌کند به دلیل عدمی که به آنچه بقای عین به آن است، سرعت می‌گیرد. و در حال عدم چنین نیست، زیرا هیچ چیز در حال عدم بر آن‌ها تغییر نمی‌کند، بلکه امری که در نفس خود بر آن هستند، ثابت است؛ زیرا اگر زائل شود، تنها به سوی هستی (الوجود) زائل می‌شود، و به سوی هستی زائل نمی‌شود مگر زمانی که عین قائم به این ممکن خاص، به هستی متصف شود. پس امر بین هستی و عدم در اعیان ثابته (أعيان ثابتة) بر احوال خاص است. اگر این را که برایت آشکار ساختیم، محقق سازی، خلق و خالق را خواهی شناخت و خواهی دانست که چه حکمی برای خلق شایسته است و چه وصفی برای خالق شایسته است. زیرا «هیچ چیز مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ) و «او هر روز در کاری است» (كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ). پس نه شیء ثابت و نه شیء موجودی شبیه او نیست. و من بر آنچه از این علم واقف شدم که شهود و حکم آن مرا به بقا با او رساند، و به اینکه زهد در اشیا واقع نمی‌شود مگر از جهل قائم به این زاهد که همان عدم علم است، و از پوشش حجابی که بر چشم اوست که همان عدم کشف (الکشف) و شهود (الشهود) آنچه ذکر کردیم، پی بردم. پس اگر بداند یا شهود کند که تمام عالم به تسبیح خالق خود و ثنای او ناطق است، و او در حال شهود اوست، چگونه می‌تواند زهد در کسی داشته باشد که این صفت اوست، در حالی که عین و ذات و صفات او جزئی از عالم است؟ و خداوند او را شاهد قرار داده و آیات خود را در آفاق (آنچه از او خارج است) و در نفس او (آنچه بر آن است) به او نشان داده است. پس اگر از غیر خود خارج شود، از نفس خود خارج نشده است. پس هر کس از عالم و از نفس خود خارج شود، از حق (الحق) خارج شده است. و هر کس از حق خارج شود، از امکان خارج شده و به محال پیوسته است. و کسی که حقیقتش امکان است، به محال نمی‌پیوندد. بنابراین، ادعای او مبنی بر خروج از هر آنچه غیر خداست، جهل محض است. و این تنها انتقال احوال است که به دلیل جهلش آن را درک نمی‌کند، و جهلش به او خیال می‌کند که عالم از خدا جداست و خدا از عالم جداست، پس می‌خواهد به سوی او فرار کند. این فرار وهمی است و سبب آن عدم ذوق اشیا و شنیدن این آیه در تلاوت است: «پس به سوی خدا بگریزید» (فَفِرُّوا إِلَى الله). و این صحیح است، جز اینکه این فرارکننده در این مرتبه، به آنچه خداوند در آیه‌ای که به دنبال این آیه آورده، توجه نکرده است، و آن قول اوست: «و با خدا معبود دیگری قرار ندهید» (وَلَا تَجْعَلُوا مَعَ اللهِ إِلَهًا آخَرَ). اگر این تتمیم را می‌شناخت، معنای قول او «پس به سوی خدا بگریزید» (فَفِرُّوا إِلَى الله) را می‌فهمید که فرار از جهل به سوی علم است و اینکه امر واحد و احدی است و آنچه را که امری وجودی از نسبت الوهیت برای آنکه او را معبود گرفته بود، توهم می‌کرد، محالی عدمی است، نه ممکن و نه واجب. پس این معنای فرار مأمور به است. پس فرار به سوی او از حیث نسبت الوهیت به آن (معبود باطل) است. پس بفهم. و اما فرار دوم که تلاوت می‌شود، قول موسی (علیه السلام) است: «پس هنگامی که از شما ترسیدم، از شما گریختم» (فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ). زیرا می‌دانست که خداوند اسباب را قرار داده و برای آن‌ها در عالم اثری نهاده است، به آنچه با اغراض موافق است و آنچه موافق نیست، و آنچه با طبع سازگار است و آنچه سازگار نیست. و حیوان را بر مزاجی آفرید که درد و لذت را می‌پذیرد، برخلاف نبات و جماد که اگرچه نزد اهل کشف (الکشف) به حیات متصف هستند، اما بر مزاجی نیستند که لذت و درد را بپذیرند. و آنچه از موسی (علیه السلام) واقع شد، قتل قبطی بود. پس برای نجاتی که ممکن بود با فرار به دست آورد، گریخت. او دید که فرار از اسباب الهی که در برخی مواطن برای وجود نجات قرار داده شده‌اند، فراری طبیعی است، زیرا ذکر کرد که ترس از سبب او را وادار به فرار کرد، اما این فرار از تعریف به آنچه از وضع الهی ذکر کردیم، عاری بود. پس حق نظر عقلی را ادا نکرد، زیرا این قبل از نبوت او و معرفت او به آنچه حق (الحق) از او می‌خواهد، بود. پس هنگامی که از ترس فرعون گریخت، حق (الحق) با نجات با او روبرو شد و او را با رسولی از رسولانش، یعنی شعیب (علیه السلام)، جمع کرد. سپس به او نبوت و حکمی را داد که خداوند با آن قبطیان و بنی اسرائیل را مخاطب ساخت که بر آن باشند، و او را با آن به سوی کسی که از او می‌ترسید، فرستاد. پس آن ارسال، مانند عقوبتی بود برای ترسی که از سبب موضوع به او رسیده بود و حق سبب موضوع را ادا نکرد، یعنی نظر عقلی. پس در فرار به او هشدار می‌داد که این ترس از خداست، زیرا ممکن (الممكن) قدرت مؤثری در رساندن خیر یا شر به ممکن دیگری ندارد و همه این‌ها به دست خداست. پس رسالت و حکم از نزد خدا به او رسید و او را با علمی که خداوند به او داد، در مورد عاقبت کارش با فرعون و خاندانش، ایمن ساخت. و هنگامی که با او سخن گفت، آنچه را که از تبدیل عصا به مار به او نشان داد، به او نشان داد. و ما گفتیم که آن ارسال به سوی فرعون عقوبت بود، زیرا ترس از او با موسی باقی بود، به دلیل قول خداوند به او و برادرش هنگامی که گفتند: «ما می‌ترسیم که بر ما پیشی گیرد یا طغیان کند» (إِنَّنا نَخافُ أَنْ يَفْرُطَ عَلَيْنا أَوْ أَنْ يَطْغى‏). خداوند فرمود: «نترسید، همانا من با شما هستم، می‌شنوم و می‌بینم» (لَا تَخَافَا إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى). و به آن دو فرمود: «پس با او سخنی نرم بگویید، شاید متذکر شود» (فَقُولَا لَهُ قَوْلًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ) آنچه را که از منت ما بر او می‌دانست، فراموش کرده است، «یا بترسد» (أَوْ يَخْشَى). یعنی یا از گرفتن و مجازات شدید ما بترسد، که آن را در مورد کسانی که مانند او سخن گفتند و پیش از او بودند، می‌شناسد و علم آن نزد او حاصل است. و این مانند قول خداوند متعال به پیامبر ما (صَلَّى اللهُ عَليهِ وسَلَّم) است: «و با آن‌ها به نیکوترین وجه مجادله کن» (وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ). و قول خداوند متعال: «پس به سبب رحمتی از جانب خدا، با آن‌ها نرم شدی، و اگر خشن و سخت‌دل بودی، از اطراف تو پراکنده می‌شدند. پس از آن‌ها درگذر و برایشان آمرزش بخواه و در کار با آن‌ها مشورت کن» (فَبِمَا رَحْمَةٍ مِنَ اللهِ لِنْتَ لَهُمْ وَلَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا مِنْ حَوْلِكَ فَاعْفُ عَنْهُمْ وَاسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِي الْأَمْرِ). پس این مجادله‌ای نرم در راه خداست که به آن امر شده است و عطوفت و امیدواری از جانب خداست که اگر واقع شود، بدون شک است. به همین دلیل علما گفته‌اند که کلمه «عسی» (شاید) از جانب خدا واجب است. و خداوند امید تذکر و خشیت را از فرعون داشت. پس فرعون ناگزیر در نفس خود آن را متذکر شد و ترسید، اما چیزی از آن را در ظاهر خود آشکار نکرد، اگرچه تذکر و خشیت بر باطن او حکم راند. به همین دلیل در آن مجلس به موسی و برادرش آسیبی نرساند، زیرا او در آن زمان صاحب قدرت و قهر بود. پس چیزی او را باز نداشت مگر تذکر و خشیتی که از حق (الحق) در او پدید آمد و مانع دیگری. زیرا اگر مانع ظاهری دیگری وجود داشت که موسی (علیه السلام) به آن پناه می‌برد، نمی‌گفت: «ما می‌ترسیم که بر ما پیشی گیرد یا طغیان کند» (إِنَّنا نَخافُ أَنْ يَفْرُطَ عَلَيْنا أَوْ أَنْ يَطْغى‏)، به دلیل عدم تکافؤ در قدرت ظاهری. پس خداوند او را با آنچه به آن دو توصیه کرده بود، یعنی سخن نرم، تأیید کرد. پس این خطاب از جنود خدا بود که با جنود باطن فرعون مقابله کرد و به اذن خدا آن‌ها را شکست داد. پس فرعون متذکر شد و ترسید، زیرا لشکری که به آن قوی بود، شکست خورد. پس در نفس خود خوار شد و آن خواری و معرفت او را از حکم کردن با قدرت ظاهری باز داشت. پس در آن مجلس به آن دو آسیبی نرساند. این فایده علم است. زیرا اگر علم آنچه را که حقیقتش می‌دهد، برای صاحبش به ثمر نرساند، اصلاً علمی در کار نیست و او عالم نیست. و سخن در مورد مانند این در منازل گذشته پیش رفت. پس مردم این فرار موسوی را می‌گیرند و حقیقت آنچه را که گرفته‌اند نمی‌دانند و در آن به این نظری که ذکر کردیم، نظر نکرده‌اند. و اگر این را دانستی...\n\n### [اینکه خداوند انسان را عالم به همه چیز نیافرید]\n\nپس این را نیز بدان که خداوند انسان را عالم به همه چیز نیافرید، بلکه به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) امر کرد که از او تعالی طلب علم بیشتر کند، آنجا که به او فرمود: «و بگو پروردگارا، علم مرا زیاد کن» (وَقُلْ رَبِّ زِدْنِي عِلْمًا). پس او در هر حالی از علم آنچه سعادت و کمالش به آن است، بهره می‌برد. آنچه عالم و انسان بر آن سرشته شده‌اند، علم به وجود خدا و علم به فقر مخلوق (المحدث) به اوست. پس اگر چنین است، برای هر کس که این صفت اوست، ناگزیر است که به سوی خدا فرار کند تا فقر خود را مشاهده کند و آنچه حکم فقر از درد برای نفس می‌دهد، تا او را از کسی که به او پناه برده است، بی‌نیاز سازد. پس چه بسا درد فقر را با آنچه لذت برای او واقع می‌شود، از او دور کند، و آن غنا به خداست. و این مطلبی است که اصلاً حصولش صحیح نیست، زیرا اگر کسی به خدا بی‌نیاز شود، از خدا بی‌نیاز شده است، و بی‌نیازی از خدا محال است. پس بی‌نیازی به خدا محال است. اما خداوند امری را از اموری که در او هنگام این طلب ایجاد می‌کند، به او می‌دهد که با آن او را بی‌نیاز می‌سازد و درد آن فقر معین را از او دور می‌کند، نه اینکه درد فقر کلی را که زوالش از ممکن (الممكن) محال است، از او دور کند. زیرا فقر وصف ذاتی اوست، نه در حال عدم و نه در حال وجود. به همین دلیل در نفس ممکن (الممكن) چیزی قرار نداد مگر آنچه اگر به او داده شود، نزد خود لذتی را بیابد که درد طلب را از بین می‌برد. سپس طلب دیگری برای امر دیگری یا برای بقای آن حاصل شده به طور دائم در دنیا و آخرت، برای او ایجاد می‌شود. پس برای کسی که حالش چنین است، ناگزیر است که از امور بازدارنده از این امر، کناره‌گیری و فرار کند تا خداوند از بصیرت و بصر او پرده بردارد و امر را بر همان‌گونه که هست، مشاهده کند. در آن هنگام می‌داند که چگونه طلب کند و از چه کسی طلب کند و چه کسی را طلب کند و امثال این‌ها. و معنای قول او را می‌داند: «همانا خداوند بی‌نیاز ستوده است» (إِنَّ اللهَ هُوَ الْغَنِيُّ الْحَمِيدُ)، یعنی ستایش شده به غنا. و در قول او تدبر کن: «و جن و انس را نیافریدم مگر برای اینکه مرا عبادت کنند» (وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ)، زیرا عبادت نفس بر او محال است. و به دلیل آنچه گفتیم، «حمید» (ستوده) را آورد، زیرا صفت غنی (بی‌نیازی) هیچ چیز بالاتر از آن نیست و آن صفتی ذاتی برای حق تعالی است. پس اشاره را بفهم، زیرا عبارت در اینجا حرام است. و اگر این مقرر شد، دانستی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در غار حرا خلوت می‌کرد تا در آن به عبادت بپردازد و از مشاهده مردم فرار کند، به دلیل حرج و تنگی که در مشاهده آن‌ها در نفس خود می‌یافت. اگر به وجه حق (الحق) در آن‌ها نظر می‌کرد، از آن‌ها فرار نمی‌کرد و با خود خلوت نمی‌کرد. و پیوسته بر این حال بود تا اینکه حق (الحق) ناگهان به او رسید. پس به سوی خلق بازگشت و پیوسته در میان آن‌ها بود. زیرا او در غار حرا با نفس خود خلوت می‌کرد، پس تنها از برخی مردم دور شد، نه از همه مردم. پس بفهم. پس برای هر طالب پروردگارش لازم است که با نفس خود و با پروردگارش در سرّ خود خلوت کند، زیرا خداوند برای انسان ظاهر و باطن قرار نداد مگر برای اینکه در باطن خود با خدا خلوت کند و او را در ظاهر خود در اسبابش مشاهده کند، پس از آنکه در باطن خود به او نظر کند تا او را در عین اسباب تمییز دهد، وگرنه هرگز او را نمی‌شناسد. پس کسی که به خلوت با خدا در باطن خود باز می‌گردد، تنها به خاطر این است. پس باطن انسان خانه خلوت اوست، اگر از خدا تعقل کند. پس هنگامی که در آغاز دانستم که شأن بر همان‌گونه است که ذکر کردم، از این هیکل خود تجردی علمی و حالی یافتم، به دلیل جهلم به جایگاه حق (الحق) از این هیکل و عدم علمم به اینکه خداوند در هر چیزی وجه خاصی دارد. پس هنگامی که از این هیکل بیگانه شدم، به آن نگاه کردم، گویی یک سبجه (توده) سیاه و تاریک‌گوشه است و هیچ نوری در آن ندیدم. پس از این ظلمت پرسیدم که از کجا به آن رسیده است؟ به من گفته شد: این ظلمت طبیعت است. زیرا ظلمت‌ها سه تا هستند که برخی بر برخی دیگر انباشته شده‌اند، تا جایی که اگر کسی دست خود را بیرون آورد، به سختی آن را می‌بیند، پس چگونه آن را ببیند؟ پس ظلمت، حجاب الهی است که از وجود حق (الحق) حجاب می‌شود. گفتم: این ظلمت‌های سه‌گانه چیست؟ به من گفته شد: ظلمت اولی که برای تو مشهود است، ظلمت طبیعت است. پس آن طبقه اولی است که به بصر تو نزدیک است. سپس این طبیعت یافت نشد مگر در مرتبه سوم. پس بالای آن ظلمت سبب حادث ممکن است که طبیعت از آن یافت شده است، و آن وجودی است که از محدثی دیگر ایجاد شده است، و آن نفس است. پس آن ظلمت دوم است. پس تاریکی طبیعت با ظلمت نفس شدیدتر و مضاعف شد. پس نفس را مشاهده کردم و ظلمتی بالای ظلمت دیدم. سپس به من گفته شد: بالای این ظلمت دوم، ظلمت سومی است و آن سببی است که این نفس از آن یافت شده است، و آن عقل اول است. پس برای من از آن پرده برداشته شد و تاریکی انباشته‌ای را دیدم که برخی بالای برخی دیگر بود. گفتم: آیا برای این سبب دیگری وجود دارد که از آن یافت شده باشد؟ به من گفته شد: نه، بلکه این را حق (الحق) بدون سبب ایجاد کرده است. گفتم: پس چرا تاریک است؟ به من گفته شد: این ظلمت برای آن ذاتی است و آن ظلمت امکان (إمكانه) آن است که آن را از ظلمت غیب (الغيب) که شهود بر آن واقع نمی‌شود، می‌گیرد، همان‌گونه که بر آنچه در آن غایب است، هنگامی که از آن ظاهر شود و جدا گردد و شهادت شود، واقع می‌شود. پس انسان از حیث اینکه جسم حیوانی است، در بطن مادرش در این سه ظلمت بود: ظلمت رحم، ظلمت مشیمه و ظلمت شکم. پس هنگامی که متولد شد، ظلمتش در او ادغام شد. پس ظاهرش نور و باطنش ظلمت بود. پس حرکت در ظلمت باطنش برای او ممکن نیست مگر با چراغ علم. اگر این چراغ را نداشته باشد، در آن هدایت نمی‌شود. پس هنگامی که هیکل خود و ظلمت آن را دیدم، دانستم که اگر به وجهی نوری برای آن نبود، نظر من به آن و ادراک من از آن صحیح نمی‌بود. پس از نوری که برای تعلق رؤیت من به آن آماده شده بود، پرسیدم. به من گفته شد: نور هستی (الوجود). با آن او را دیدم. پس به خود از حیث اینکه بیننده آن ظلمت هستم، نگاه کردم و دیدم که سایه‌اش بر من گسترده می‌شود و ندیدم که نور من آن را از بین ببرد. پس تعجب کردم. به من گفته شد: تاریکی امکان (إمکانک) از تو زائل نمی‌شود، زیرا آن نعت ذاتی توست، چرا که تو واجب الوجود (واجب الوجود) به ذات خود نیستی. گفتم: پس چه کسی نوری را که در آن ظلمت نیست، برای من می‌آورد؟ گفته شد: هرگز آن را نخواهی یافت. گفتم: پس هرگز ایجادکننده خود را مشاهده نخواهم کرد، زیرا او نور محض و هستی (الوجود) خالص است. به من گفته شد: هرگز او را مشاهده نخواهی کرد مگر از جانب خودت. به همین دلیل هرگز او را در یک صورت نمی‌بینی. پس علم تو به او احاطه نمی‌یابد. پس او تجلی (التجلی) نمی‌کند و شهود نمی‌شود، همان‌گونه که نفس خود را شهود می‌کند، زیرا او از عالمیان بی‌نیاز است. پس به او استدلال نمی‌شود مگر به واسطه خودش. پس او شناخته نمی‌شود مگر از طریق کشف (الکشف) و شهود (الشهود) بر همان حدی که ذکر کردیم. و اما با ادله نظری، تنها حکم او شناخته می‌شود، نه عین او. به همین دلیل عقل با دلیل خود بر آنچه این موجود واجب الوجود (الواجب الوجود) مستلزم آن است، از آنچه ممکن (الممكن) در آن به او نیازمند است، حکم می‌کند. پس این مقدار بر او دلالت می‌کند و شهود مرتبه‌ای بالاتر از این را می‌دهد که چشیده می‌شود و قابل بیان و حکایت نیست. پس هنگامی که خداوند ذاتم را به شهودم رساند و هیکلم را به شهودم رساند، پس از این، نسبت تمام عالم را به من و توجه آن را بر من در ایجاد عینم به شهودم رساند. پس تقدم آن را بر خود و آثار آن را در خود دیدم و انفعال خود را از آن دانستم و اینکه اگر آن نبود، وجود عینی برای من نبود. پس در نفس خود خوار شدم، زیرا تحت قهر ممکنی مانند خود هستم. و در آن هنگام دانستم که من از اندک کسانی هستم که می‌دانند آفرینش آسمان‌ها (که اسباب علوی برای وجود من هستند) و زمین (که اسباب سفلی برای وجود من هستند) از آفرینش مردم بزرگتر است، زیرا آن‌ها نسبت فاعلیت دارند و مردم نسبت انفعال. پس شکستی مرا در برگرفت که نزدیک بود مرا از مشاهده حق (الحق) ناامید سازد، از حیث آنچه این اسباب که در قدر بر من برتری فاعلیت دارند، شهود می‌کنند. پس هنگامی که آن شکست برایم حاصل شد، به من گفته شد: این اسباب، اگرچه این قدر را بر تو در مرتبه ظاهر دارند، بدان که تو عین مقصود هستی. پس این اسباب یافت نشدند مگر به سبب تو، تا تو ظاهر شوی. پس آن‌ها برای خودشان مطلوب نبودند. زیرا خداوند هنگامی که دوست داشت شناخته شود، ممکن نبود که او را بشناسد مگر کسی که بر صورت اوست. و خداوند کسی را بر صورت خود نیافرید مگر انسان کامل (الإنسان الکامل)، نه انسان حیوانی. پس هنگامی که او حاصل شد، معرفت مطلوب حاصل شد. پس آنچه را که از اسباب آفرید، برای ظهور عین انسان کامل (الإنسان الکامل) بود. پس این را بدان. پس این تعریف الهی شکست مرا جبران کرد و دانستم که من از کاملان هستم و تنها انسان حیوانی نیستم. پس خداوند را بر این منت شکر کردم. پس هنگامی که نسبت عالم را به من و نسبت مرا به عالم به شهودم رساند و بین دو مرتبه تمییز دادم و دانستم که اگر من نبودم، تمام عالم یافت نمی‌شد و اینکه با وجود من، مقصود از علم حادث به خدا و وجود حادث که بر صورت وجود قدیم است، صحیح شد. و دانستم که علم حادث به خدا که بر صورت علم قدیم به خداست، ممکن نیست مگر برای کسی که در خلقتش بر صورت است، و آن کسی جز انسان کامل (الإنسان الکامل) نیست. به همین دلیل کامل نامیده شد و او روح عالم است و عالم، اعلا و اسفلش، مسخر اوست. و انسان حیوانی جزئی از عالم مسخر اوست و در صورت ظاهری شبیه انسان کامل است، نه در باطن از حیث مرتبه، همان‌گونه که میمون در تمام اعضای ظاهری خود شبیه انسان است. پس در درجه انسان حیوانی از درجه انسان کامل (الإنسان الکامل) تأمل کن.\n\n### [همانا انسان بر استعداد پذیرش کمال است]\n\nو بدان که تو از کدام انسان‌ها هستی، زیرا اگر تعقل کنی، بر استعداد پذیرش کمال هستی. به همین دلیل تنبیه و آگاه‌سازی از جانب عالم تعیین شده است. اگر بر استعداد پذیرش کمال نبودی، تنبیه صحیح نمی‌بود و تعریف به آن عبث و باطل می‌شد. پس در عدم پذیرش آنچه به آن دعوت شده‌ای، جز نفس خود را ملامت نکن، زیرا دعوت‌کننده جز بر بصیرت دعوت نکرده است تا تو را در بصیرت به ذات خود ملحق سازد. پس هنگامی که این را دانستی و حق (الحق) نسبت عالم را به تو به شهودت رساند، بر تو باقی می‌ماند که نسبت حق (الحق) را به خود و نسبت خود را به او بدانی. پس حق (الحق) مرا بر نسبت اسماء الهی به من واقف ساخت تا صورت مقصود برایم حاصل شود و بر تمام اسماء الهی که بر او تعالی اطلاق می‌شود، اطلاق شوم و هیچ اسمی از آن‌ها به هیچ وجه از من فوت نشود.\n\n### [همانا اسم به حکم مطابقت بر مسمی دلالت می‌کند]\n\nپس بدان که چون اسم به حکم مطابقت بر مسمی دلالت می‌کند، و از آن جز مسمای آن فهمیده نمی‌شود، پس آن عین مسمی در صورتی دیگر است که اسم نامیده می‌شود. پس اسم، اسم برای او و برای مسمای اوست. و خداوند سبحانه خواست که شناخته شود، همان‌گونه که مقرر کردیم، با معرفت حادث، تا مراتب معرفت کامل شود و هستی (الوجود) با وجود مخلوق (المحدث) کامل شود. و ممکن نیست که شیء شناخته شود مگر توسط خودش یا مثلش. پس ناگزیر است که موجود حادثی که خداوند آن را برای علم به خود ایجاد می‌کند، بر صورت ایجادکننده‌اش باشد تا مانند مثل برای او باشد. همانا انسان کامل (الإنسان الکامل) یک حقیقت واحد است، اگرچه به شخص بیش از یکی باشد. پس او عین واحد است. و در مورد او فرمود: «هیچ چیز مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ). پس او را مَثَل قرار داد و مماثلت را نفی کرد. پس هنگامی که او را در هستی (الوجود) به عنوان مَثَل نصب کرد، اسماء الهی به حکم مطابقت به سوی او جاری شدند، از حیث اینکه اسماء دارای صورت‌ها و حروف لفظی و رقمی هستند، همان‌گونه که انسان دارای صورت جسمی است. پس این اسماء الهی بر این انسان کامل (الإنسان الکامل) مطابقت شدیدتری دارند تا بر مسمای «الله». و چون مَثَل از مَثَل خود به واسطه امری متمایز است که ممکن نیست آن امر جز برای او باشد و برای مثلش نباشد، آن امر در اسمائی که مَثَل از مَثَل خود به واسطه آن متمایز می‌شود و دیگری در آن شریک نیست، از جانب حق (الحق)، اسم «الله» است. پس عین آنچه مَثَل به واسطه آن از مَثَل خود اختصاص یافت، و برای مَثَل دیگر اسم «انسان کامل خلیفه» بود، از آنچه این مَثَل کونی به آن اختصاص یافت. و اسماء باقی‌مانده حق (الحق) مرکب از روح و صورت هستند. پس از حیث صورتشان به حکم مطابقت بر انسان دلالت می‌کنند و از حیث روح و معنایشان به حکم مطابقت بر خدا دلالت می‌کنند. و ما حالی داریم و او حالی دارد، و اسماء تابع آن احوال هستند. ما هرگاه بخواهیم، تجرید از صورت‌ها را داریم. پس آنچه از ذات ماست، صورت‌هاست، اما از حقیقت ذات ما نیز تجرد از آن‌هاست هرگاه بخواهیم. پس اسماء در حال تجرید ما، از حیث ارواح مجرد از صورت‌هایشان، از ما تبعیت می‌کنند. و او التباس به صورت‌ها دارد، در حالی که به ذات خود غیر صورت است و به ذات خود نیز پذیرای تجلی (التجلی) برای ما در صورت‌هاست. پس اسماء عیناً از حیث صورت‌هایشان از او تبعیت می‌کنند، هرگاه بخواهد صورت را بپوشد. پس امر بین ما و او مساوی است، با فرقان موجود محقق که او خالق است و ما مخلوقیم، و او الله است و من انسان خلیفه. پس او ما را در خلافت شریک می‌سازد تا صورت محقق شود، زیرا به ما امر کرده است که او را وکیل بگیریم و وکالت خلافت است. پس آنچه به او اختصاص دارد و به واسطه آن از من متمایز می‌شود، اسم «الله» است، صورت و معنا. پس هنگامی که در صورت تجلی (التجلی) کند، اسم «الله» به حکم مطابقت صورت بر او اطلاق می‌شود. و هنگامی که بر همان‌گونه که هست، بدون تقیید به صورت باقی بماند، روح اسم «الله» بر او اطلاق می‌شود. و همچنین انسان، این اسم است که او را از او متمایز می‌سازد. و او حالت بقا بر همان‌گونه که ذاتش بر آن است، از صورت را دارد و تجرید را نیز دارد. و اگر در عالم کسی نبود که بر صورت حق (الحق) باشد، مقصود از علم به حق (الحق) حاصل نمی‌شد، یعنی علم حادث در قول او: «من گنجی پنهان بودم، دوست داشتم شناخته شوم، پس خلق را آفریدم و خود را به آن‌ها شناساندم، پس مرا شناختند».\n\nپس خود را گنج قرار داد و گنج جز در چیزی پنهان نمی‌شود. پس گنج حق (الحق) خود را پنهان نکرد مگر در صورت انسان کامل (الإنسان الکامل) در شیئیت و ثبوتش. حق (الحق) در آنجا پنهان بود. پس هنگامی که حق (الحق) لباس شیئیت هستی (شيئية الوجود) را بر انسان پوشاند، گنج با ظهور او ظاهر شد. پس انسان کامل (الإنسان الکامل) او را با وجود خود شناخت و دانست که او در شیئیت ثبوتش در او پنهان بوده است، در حالی که او از آن بی‌خبر بود. این را در مورد نسبت اسماء به او به تو گفتم. خداوند متعال فرمود: «و تمام اسماء را به آدم آموخت» (وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا). و لفظ «کل» (همه) اقتضای احاطه و عموم دارد. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در دعای خود به پروردگارش فرمود: «اللهم إنی أسألک بکل اسم سمیت به نفسک» (بار خدایا، من از تو می‌خواهم به حق هر اسمی که خود را به آن نامیدی).\n\nاین یک اضافه حقیقی است و آن اضافه شیء به نفس خود است. چون دو لفظ مختلف ذکر شده، اضافه صحیح است، مانند «حق الیقین» و «علم الیقین»، در حالی که عین یکی است و آن لفظ «نفس» و کاف خطاب است. و ما این را به خاطر اصحاب لسان گفتیم، آنجا که از طریق ادله گفتند که شیء به نفس خود اضافه نمی‌شود، و این قول صحیحی است، جز اینکه اضافه در اینجا در صورت واقع شده است و صورت دو صورت است. پس جایز است که صورت واحد به دیگری اضافه شود، و آن نفس و کاف خطاب است، و مانند حق الیقین و علم الیقین و عین الیقین. و وجه دیگر این است که نفس، نفس انسان کامل (الإنسان الکامل) باشد که پذیرای تمام اسماء الهی و کونی است، زیرا اسماء کونی نیز به حکم مطابقت بر او دلالت می‌کنند، مگر آنچه که محدث به آن اختصاص دارد، مانند غنا برای خدا و فقر برای انسان، بلکه برای تمام عالم. پس نفس در اینجا به کاف خطاب که حق (الحق) است، اضافه شده است و اضافه ملک و تشریف و استحقاق است. اضافه ملک مانند «مال زید» و اضافه تشریف مانند «عبد الملک» و «خدمتکار او» و اضافه استحقاق مانند «زین اسب» و «در خانه». و همه این‌ها در قول «نفسک» (نفس خودت) جایز است، اگر منظور از آن انسان باشد، مانند قول عیسی (علیه السلام): «و آنچه در نفس توست نمی‌دانم» (وَلَا أَعْلَمُ مَا فِي نَفْسِكَ). یعنی منظور از این نفس در اینجا، نفس عیسی است که آن را به حق (الحق) اضافه کرده است، همان‌گونه که در نفس الامر است. و این در ثنای بر خدا و تبرّی از آنچه به او نسبت داده شده و بر او مقرر گشته و از آن استفهام شده است، کامل‌تر است، از قول او: «آیا تو به مردم گفتی که من و مادرم را دو معبود به جای خدا بگیرید؟» (أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّي إِلَهَيْنِ مِنْ دُونِ اللهِ). پس به او گفت: «تو می‌دانی آنچه در نفس من است و من نمی‌دانم آنچه در آن است. همانا تو خودت دانای غیب‌هایی» (أَنْتَ تَعْلَمُ مَا فِي نَفْسِي وَلَا أَعْلَمُ مَا فِيهَا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ). زیرا در آن چیزی نیست مگر آنچه تو قرار دهی. پس چگونه از کسی که «خلق و امر از آن اوست» (لَهُ الْخَلْقُ وَالْأَمْرُ) استفهام می‌شود؟ و به او نگفت که من نگفتم که من معبود هستم، زیرا می‌دانست که او خلیفه و انسان کامل (الإنسان الکامل) است و اسماء الهی برای اوست. پس به او گفت: «من به آن‌ها نگفتم مگر آنچه را که به من امر کردی» (مَا قُلْتُ لَهُمْ إِلَّا مَا أَمَرْتَنِي بِهِ). من چیزی بر آن اضافه نکردم. و هنگامی که گوینده آنچه را که به او امر شده است بگوید، لازم نیست که هر آنچه بر آن است بگوید، زیرا به او امر نشده است که آن را بگوید. و با ابلاغ، از عهده خارج شده است. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «یا آن را به یکی از خلق خود آموختی یا آن را در علم غیب خود برای خودت اختصاص دادی».\n\nپس ذکر کرد که او تعالی چیزی را در علم غیب خود اختصاص داده است که جز او نمی‌داند، و آن چیزی نیست جز آنچه می‌تواند برای انسان کامل (الإنسان الکامل) باشد، اما خداوند تعالی آن را در علم غیب خود اختصاص داده است که جز او نمی‌داند. پس از انسان آنچه را که بر آن است، می‌داند که انسان کامل (الإنسان الکامل) از نفس خود نمی‌داند. پس آن غیب حق (الحق) است، زیرا او مَثَل است. پس قول محمد (صَلَّى اللهُ عَليهِ وسَلَّم) و قول عیسی (علیه السلام) در یک امر جمع شد، و آن قول اوست: «و آنچه در نفس توست نمی‌دانم» (وَلَا أَعْلَمُ مَا فِي نَفْسِكَ) و قول محمد (صَلَّى اللهُ عَليهِ وسَلَّم): «یا آن را در علم غیب خود اختصاص دادی».\n\nپس انسان کامل (الإنسان الکامل) محل تمام اسمائی است که در قوه پذیرش اوست. و آنچه در قوه پذیرش او نیست، نمی‌تواند آن را بپذیرد. پس آن از اسمائی نیست که گفته شود او از آن ناقص است، مانند اسمائی که مختص به انسان است و جایز نیست که بر خدا اطلاق شود. و گفته نمی‌شود که خداوند از اینکه این اسم بر او اطلاق شود، ناقص است. پس معنای «تمام اسماء» این است که هر اسمی که در حقیقت این مسمی است، آن را بپذیرد. پس این را بدان. پس هر کس نسبت اسماء الهی به انسان را چگونه است و نسبت اسماء کونی به خدا را چگونه است، بداند، مرتبه انسان و تمایز او از تمام عالم و شرف او را به واسطه جامعیتش می‌داند، مانند متفنن صاحب ذوق در هر علمی. و چه بسا صاحب علم خاصی در آن علم از او کامل‌تر باشد، با وجود مشارکت. پس او در وجه خاصی برتر است و این (انسان کامل) به واسطه جامعیت برتر است. همان‌گونه که در نقص به برتری قائل می‌شویم، پس می‌گوییم در مورد کندذهن که او الاغ است. و قطعاً معلوم است که الاغ در کندذهنی از انسان برتر است، زیرا از او کندذهن‌تر است. و همچنین فرشته با انسان. فرشته در طاعت از او برتر است. و خداوند به این برای او شهادت داده است، و آن به دلیل عاری بودن او از لباس بشریت است. پس او از آنچه خداوند به او امر کرده، عصیان نمی‌کند، زیرا او بر حقایق متضادی نیست که او را در اوقاتی جذب کند و او را غافل سازد و آنچه به آن دعوت شده است را از یادش ببرد، همان‌گونه که در نشئه عنصری یافت می‌شود. و انسان نشئه عنصری است که حقایق متجاذب بالفعل او را می‌طلبند، صاحب غفلت و نسیان است، امر و نهی می‌شود، پس مخالفت و موافقت از او تصور می‌شود. پس فرشته در موافقت با امر خدا از انسان شدیدتر است، به دلیل آنچه نشئه او و نشئه انسان می‌دهد. خداوند متعال در مورد فرشته فرمود: «از آنچه خدا به آن‌ها امر کرده، عصیان نمی‌کنند» (لَا يَعْصُونَ اللهَ مَا أَمَرَهُمْ). و در مورد خلیفه‌ای که اسماء را به آن‌ها آموخت، فرمود: «و آدم پروردگارش را عصیان کرد و گمراه شد» (وَعَصَى آدَمُ رَبَّهُ فَغَوَى). پس او را به معصیت وصف کرد. پس فرشته در موافقت با امر خدا برتر است و خلیفه انسان به اسماء الهی داناتر است، زیرا خلیفه اگر به آنچه کسی که او را خلیفه کرده است، مستحق آن است، ظاهر نشود تا اطاعت و عصیان شود، پس خلیفه نیست. پس او در جامعیت کامل‌تر و برتر است و فرشته در یک وجه خاص یا دو وجه برتر است، اما فضیلت جمع و صورت را ندارد. و صورت جز با مجموع حاصل نمی‌شود، وگرنه صورت مثلی نیست. و آنچه صورت به واسطه آن بر مثل خود امتیاز می‌یابد، در کمال صورت قدحی وارد نمی‌کند، زیرا این لازم است. و اگر این نبود، صورت مَثَل نمی‌بود، بلکه عین آن می‌بود. و معلوم است که امر چنین نیست. و این منزل، سخن در آن گسترش می‌یابد و نزدیک است که به بی‌نهایت برسد. پس به آنچه ذکر کردیم، اکتفا می‌کنیم و برخی از علومی را که در بر می‌گیرد، همان‌گونه که پیش رفت، ذکر می‌کنیم. از جمله آن، علم رسوم محو شده و مراتب آن‌ها و حصر آن‌ها در حقایقی است که در آن‌ها محصور شده‌اند. و در آن علم کسی است که امرش رد شد و نزدیک بود که خود را بکشد، و این دلیل بر تنگی و حرج است. و آیا این از کمال انسان است یا نه؟ زیرا خداوند خود را به غضب و انتقام وصف کرده است. پس این انسان هنگامی که نتوانست با قدرت خود بر کسی که غضبش را با انتقام از او می‌فرستد، غلبه کند، خواست آن را بر نفس خود بفرستد و خود را بکشد. پس او ناقص کامل است. پس خداوند به او صبر بر تحمل آزار داد. پس با آن با آنچه طبع از خشم بر کسی که کلام و امر او را رد می‌کند و می‌خواهد با او مقابله کند، می‌یابد، مقاومت کرد. و در آن علم تسکین و وجود فرح به مستند به اوست، هنگامی که در خطاب بر سبیل رفق با او تنزل کند، به دلیل آنچه می‌یابد. و آن این است که او را با آنچه در نفس خود در امری که او را خشمگین کرده است، می‌شناسد، مخاطب سازد. پس به او نشان می‌دهد که کسی بزرگتر از او خشمگین شده است. پس برای آن در نفس خود عزتی می‌یابد. به همین دلیل خداوند متعال به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «ما از اخبار رسولان بر تو حکایت می‌کنیم تا دلت را به آن ثابت گردانیم» (نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ). و در آن علم هر کسی است که جنایتی کند، تنها بر نفس خود جنایت می‌کند، زیرا اعمال جز به عامل خود اضافه نمی‌شوند. و اگر به غیر عامل خود اضافه شوند، حق آن را غصب کرده‌اند. و در آن علم استبصار است. و در آن علم مزاج‌هاست. پس از آن دانسته می‌شود که آنچه به زید ضرر می‌رساند، به عمرو نفع می‌رساند و آنچه برای خالد دواست، برای حسن درد است. و در آن علم ندای حق (الحق) و اختلاف آن با احدیت نداست. و در آن علم آداب جواب منادی است. و در آن علم استنزال با لطف است. و در آن علم جبر است. و در آن علم تقریر کونی و نزول بالاتر به خطاب پایین‌تر با لطف، با وجود قهر او به صورت است. پس مانع او از این چیست؟ آیا قهری پنهان است که از آن بی‌خبر است یا از رحمتی است که بر آن قرار داده شده یا جبلی است؟ و در آن علم تنبیه عالم بر کسب امور عالی با آشکار ساختن اسباب آن‌ها برای کسی است که آن‌ها را نمی‌شناسد. و در آن علم اسباب حیرت از جواب سؤال‌کنندگان است، هنگامی که سؤال از چیزهایی باشد که جواب مطابق با آنچه سائل در سؤال خود می‌طلبد، بر آن تصور نمی‌شود. و آیا هر سؤالی مقتضی جواب است یا نه؟ و سؤال عین جواب است از حیث احدیت کلام، و در واحد تفصیل و تقسیم واقع نمی‌شود. و سؤال عین جواب نیست و کلام احدی العین است، پس محل تقسیم کجاست؟ و در آن علم جدل است، با علم مجادله‌کننده به اینکه او باطل است و خصمش بر حق است. پس چرا بر جدل خود باقی می‌ماند در حالی که حق در نفس او آشکار شده است؟ آیا برای او وجهی است که حق (الحق) برای اوست یا از تمام وجوه باطل است؟ و اگر از تمام وجوه باطل باشد، باطل عدم است و عدم با هستی (الوجود) مقاومت نمی‌کند، زیرا هیچ چیز از شیء قوی‌تر نیست. و در آن علم آنچه مساعدت نتیجه می‌دهد، است. و در آن علم زجر و ترساندن و رضایت به قضا و مقضی با هم است، به دلیل قوه‌ای که در راضی است. و آنچه شایسته است که به آن از مقضی راضی شود و آنچه شایسته نیست که به آن راضی شود. و در آن علم آنچه استناد به کثرت از قوت در نفس مستند تأثیر می‌گذارد، است. و اگر ناامید شود، چه بسا به فردی از قوت داده شود که از قوت کثیر بیشتر است، پس کثیر با او مقاومت نمی‌کند. و در آن علم تأثیر کون در کون است. آیا به امر الهی یا به علم نیازمند است یا برخی از آن از علم است و برخی از آن از امر الهی؟ و مراتب خلق در آن. و در آن علم سرد اخبار و فایده اضافی آن بر انس دادن نفوس به آن‌هاست، زیرا نفوس به طبع خود احادیث را شیرین می‌یابند. و در آن علم برتری عالم در علم است. و در آن علم آنچه شایسته است که به حق (الحق) از امور اضافه شود و آنچه شایسته نیست، اگرچه برای او باشد. و در آن علم عزت نفس است که مذمت‌ها به آن ملحق شود، با وجود اینکه به آن‌ها متصف است. پس چه چیزی آن را حجاب می‌کند تا به مذمت‌ها متصف شود و دوست نداشته باشد که به آن‌ها وصف شود؟ و در آن علم برتری نفوس بر یکدیگر به طور مطلق است. و در آن علم سبب دوام نعمت‌ها و عدم دوام نقیض آن است. و در آن علم مدد است. و چرا انتهای آن‌ها در آنچه به انتها وصف می‌شود، به کجا باز می‌گردد؟ آیا به فعل موجود در آن‌هاست یا به امر دیگری؟ و در آن علم تقسیمات زمان به زمان‌هاست، در حالی که عین واحد است. و در آن علم طلب پاداش اعمال است، اگرچه عاملان از آن منزه باشند. و در آن علم این است که چه کسی منزلت بالاتری دارد؟ آیا کسی که از طلب عوض‌ها منزه است یا طالب عوض‌ها؟ و در آن علم آغاز رسالت در عالم و سبب آن است. و آیا در عالم کسی هست که از تکلیف خارج شده باشد یا نه؟ و در آن علم این است که عالی از پایین‌تر به چه چیزی متمایز می‌شود؟ آیا به نفس خود یا به امر نسبی؟ و کدام یک از آن‌ها شریف‌تر است؟ و در آن علم اختلاف آیات به دلیل اختلاف اعصار و احوال است. و این کجا از علم الهی است؟ و در آن علم ورود وسیع در تنگ است، بدون اینکه تنگ وسیع شود یا وسیع تنگ شود. و در آن علم فرق بین اناث و ذکور در هر صنفی است. و در آن علم من یصح علیه اسم الأخوة ممن لا یصح و مراتب اخوت است. و در آن علم موازنات الهی و موضوعه است. و در آن علم سببی است که در انسان پدید می‌آید تا قلبش از راه حق (الحق) کور شود، با وجود علمش به امکان. و این از عجیب‌ترین چیزهاست، مانند قول کسی که گفت: «بار خدایا، اگر این حق (الحق) از جانب توست، پس بر ما از آسمان سنگ بباران» (اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ)، با وجود علمشان به اینکه این ممکن است و خداوند آن‌ها را توفیق نداد که بگویند: بر ما توبه کن یا ما را سعادتمند ساز. و در آن علم مراتب وحی الهی در انسان است. و در آن علم دلالتی است که رد آن ممکن نیست. و در آن علم فرقان بین نظم و منظوم و نثر و منثور است، و آن علم مقید و مطلق است. و در آن علم تقلب از حالی به حال و از منزلی به منزل است. و در آن علم تنزل ارواح ناری است. از کجا تنزل می‌کنند و بر چه کسی تنزل می‌کنند و محل آن‌ها کجاست و چه چیزی شایسته است که به آن‌ها نسبت داده شود؟ «و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 8
}