{
  "id": 25,
  "title": {
    "ar": "الباب الخامس والعشرون في معرفة وتد مخصوص معمر",
    "en": "Chapter Twenty-Five: Concerning the Gnosis of a Specific, Enduring Pillar (Watad)",
    "ur": "پچیسواں باب: ایک مخصوص اور آباد میخ (وتد) کی معرفت میں",
    "fa": "باب بیست و پنجم در معرفت وتد (وتد) مخصوص و آبادان (معمر)"
  },
  "content": {
    "ar": "## «الباب الخامس والعشرون» في معرفة وتد مخصوص معمر\n\n\nوأسرار الأقطاب المختصين بأربعة أصناف من العلوم وسر المنزل والمنازل ومن دخله من العالم‏\n\n\n> إن الأمور لها حد ومطلع *** من بعد ظهر وبطن فيه تجتمع‏\n\n\n> في الواحد العين سر ليس يعلمه *** إلا مراتب أعداد بها تقع‏\n\n\n> هو الذي أبرز الأعداد أجمعها *** وهو الذي ما له في العد متسع‏\n\n\n> مجاله ضيق رحب فصورته *** كناظر في مراء حين ينطبع‏\n\n\n> فما تكثر إذ أعطت مراتبه *** تكثرا فهو بالتنزيه يمتنع‏\n\n\n> كذلك الحق إن حققت صورته *** بنفسه وبكم تعلو وتتضع‏\n### [الخضر في حياة المؤلف‏]\n\n\nاعلم أيها الولي الحميم أيدك الله أن هذا الوتد هو خضر صاحب موسى عليه السلام أطال الله عمره إلى الآن وقد رأينا من رآه واتفق لنا في شأنه أمر عجيب وذلك أن شيخنا أبا العباس العريبي رحمه الله جرت بيني وبينه مسألة في حق شخص كان قد بشر بظهوره رسول الله صلى الله عليه وسلم فقال لي هو فلان ابن فلان وسمي لي شخصا أعرفه باسمه وما رأيته ولكن رأيت ابن عمته فربما توقفت فيه ولم آخذ بالقبول أعني قوله فيه لكونى على بصيرة في أمره ولا شك أن الشيخ رجع سهمه عليه فتأذى في باطنه ولم أشعر بذلك فإني كنت في بداية أمري فانصرفت عنه إلى منزلي فكنت في الطريق فلقيني شخص لا أعرفه فسلم علي ابتداء سلام محب مشفق وقال لي يا محمد صدق الشيخ أبا العباس فيما ذكر لك عن فلان وسمي لنا الشخص الذي ذكره أبو العباس العريبي فقلت له نعم وعلمت ما أراد ورجعت من حيني إلى الشيخ لأعرفه بما جرى فعند ما دخلت عليه قال لي يا أبا عبد الله أحتاج معك إذا ذكرت لك مسألة يقف خاطرك عن قبولها إلى الخضر يتعرض إليك يقول لك صدق فلانا فيما ذكره لك ومن أين يتفق لك هذا في كل مسألة تسمعها مني فتتوقف فقلت إن باب التوبة مفتوح فقال وقبول التوبة واقع فعلمت إن ذلك الرجل كان الخضر ولا شك أني استفهمت الشيخ عنه أ هو هو قال نعم هو الخضر ثم اتفق لي مرة أخرى أني كنت بمرسى تونس بالحفرة في مركب في البحر فأخذني وجع في بطني وأهل المركب قد ناموا فقمت إلى جانب السفينة وتطلعت إلى البحر فرأيت شخصا على بعد في ضوء القمر وكانت ليلة البدر وهو يأتي على وجه الماء حتى وصل إلي فوقف معي ورفع قدمه الواحدة واعتمد على الأخرى فرأيت باطنها وما أصابها بلل ثم اعتمد عليها ورفع الأخرى فكانت كذلك ثم تكلم معي بكلام كان عنده ثم سلم وانصرف يطلب المنارة محرسا على شاطئ البحر على تل بيننا وبينه مسافة تزيد على ميلين فقطع تلك المسافة في خطوتين أو ثلاثة فسمعت صوته وهو على ظهر المنارة يسبح الله تعالى وربما مشى إلى شيخنا جراح بن خميس الكتاني وكان من سادات القوم مرابطا بمرسى عيدون وكنت جئت من عنده بالأمس من ليلتي تلك فلما جئت المدينة لقيت رجلا صالحا فقال لي كيف كانت ليلتك البارحة في المركب مع الخضر ما قال لك وما قلت له فلما كان بعد ذلك التأريخ خرجت إلى السياحة بساحل البحر المحيط ومعي رجل ينكر خرق العوائد للصالحين فدخلت مسجدا خرابا منقطعا لأصلي فيه أنا وصاحبي صلاة الظهر فإذا بجماعة من السائحين المنقطعين دخلوا علينا يريدون ما نريده من الصلاة في ذلك المسجد وفيهم ذلك الرجل الذي كلمني على البحر الذي قيل لي إنه الخضر وفيهم رجل كبير القد أكبر منه منزلة وكان بيني وبين ذلك الرجل اجتماع قبل ذلك ومودة فقمت فسلمت عليه فسلم علي وفرح بي وتقدم بنا يصلي فلما فرغنا من الصلاة خرج الإمام وخرجت خلفه وهو يريد باب المسجد وكان الباب في الجانب الغربي يشرف على البحر المحيط بموضع يسمى بكة فقمت أ تحدث معه على باب المسجد وإذا بذلك الرجل الذي قلت إنه الخضر قد أخذ حصيرا صغيرا كان في محراب المسجد فبسطه في الهواء على قدر علو سبعة أذرع من الأرض ووقف على الحصير في الهواء ينتقل فقلت لصاحبي أما تنظر إلى هذا وما فعل فقال لي سر إليه وسله فتركت صاحبي واقفا وجئت إليه فلما فرغ من صلاته سلمت عليه وأنشدته لنفسي‏\n\n\n> شغل المحب عن الهواء يسره *** في حب من خلق الهواء وسخره‏\n\n\n> العارفون عقولهم معقولة *** عن كل كون ترتضيه مطهره‏\n\n\n> فهمو لديه مكرمون وفي الورى *** أحوالهم مجهولة ومسترة\n\n\nفقال لي يا فلان ما فعلت ما رأيت إلا في حق هذا المنكر وأشار إلى صاحبي الذي كان ينكر خرق العوائد وهو قاعد في صحن المسجد ينظر إليه ليعلم أن الله يفعل ما يشاء مع من يشاء فرددت وجهي إلى المنكر وقلت له ما تقول فقال ما بعد العين ما يقال ثم رجعت إلى صاحبي وهو ينتظرني بباب المسجد فتحدثت معه ساعة وقلت له من هذا الرجل الذي صلى‏\n\n\nفي الهواء وما ذكرت له ما اتفق لي معه قبل ذلك فقال لي هذا الخضر فسكت وانصرفت الجماعة وانصرفنا نريد روطة موضع مقصود يقصده الصلحاء من المنقطعين وهو بمقربة من بشكنصار على ساحل البحر المحيط فهذا ما جرى لنا مع هذا الوتد نفعنا الله برؤيته وله من العلم اللدني ومن الرحمة بالعالم ما يليق بمن هو على رتبته وقد أثنى الله عليه‏\n\n\n### [خرقة الخضر]\n\n\nواجتمع به‏\nرجل من شيوخنا وهو علي بن عبد الله بن جامع من أصحاب علي المتوكل وأبي عبد الله قضيب البان كان يسكن بالمقلى خارج الموصل في بستان له وكان الخضر قد ألبسه الخرقة بحضور قضيب البان وألبسنيها الشيخ بالموضع الذي ألبسه فيه الخضر من بستانه وبصورة الحال التي جرت له معه في إلباسه إياها وقد كنت لبست خرقة الخضر بطريق أبعد من هذا من يد صاحبنا تقي الدين عبد الرحمن بن علي بن ميمون بن أب التوزري ولبسها هو من يد صدر الدين شيخ الشيوخ بالديار المصرية وهو ابن حمويه وكان جده قد لبسها من يد الخضر ومن ذلك الوقت قلت بلباس الخرقة وألبستها الناس لما رأيت الخضر قد اعتبرها وكنت قبل ذلك لا أقول بالخرقة المعروفة الآن فإن الخرقة عندنا إنما هي عبارة عن الصحبة والأدب والتخلق ولهذا لا يوجد لباسها متصلا برسول الله صلى الله عليه وسلم ولكن توجد صحبة وأدبا وهو المعبر عنه بلباس التقوى فجرت عادة أصحاب الأحوال إذا رأوا أحدا من أصحابهم عنده نقص في أمر ما وأرادوا أن يكملوا له حاله يتحد به هذا الشيخ فإذا اتحد به أخذ ذلك الثوب الذي عليه في حال ذلك الحال ونزعه وأفرغه على الرجل الذي يريد تكملة حاله فيسري فيه ذلك الحال فيكمل له ذلك فذلك هو اللباس المعروف عندنا والمنقول عن المحققين من شيوخنا\n\n\n### [مراتب رجال الله في فهم مراتب القرآن‏]\n\n\nثم اعلم أن رجال الله على أربع مراتب رجال لهم الظاهر ورجال لهم الباطن ورجال لهم الحد ورجال لهم المطلع فإن الله سبحانه لما أغلق دون الخلق باب النبوة والرسالة أبقى لهم باب الفهم عن الله فيما أوحى به إلى نبيه صلى الله عليه وسلم في كتابه العزيز وكان علي بن أبي طالب رضي الله عنه يقول إن الوحي قد انقطع بعد رسول الله صلى الله عليه وسلم وما بقي بأيدينا إلا أن يرزق الله عبدا فهما في هذا القرآن‏\n\n\nوقد أجمع أصحابنا أهل الكشف على صحة خبر\n\n\nعن النبي صلى الله عليه وسلم أنه قال في آي القرآن إنه ما من آية إلا ولها ظاهر وباطن وحد ومطلع‏\n\n\nولكل مرتبة من هذه المراتب رجال ولكل طائفة من هؤلاء الطوائف قطب وعلى ذلك القطب يدور فلك ذلك الكشف دخلت على شيخنا أبي محمد عبد الله الشكاز من أهل باغة بأغرناطة سنة خمس وتسعين وخمسمائة وهو من أكبر من لقيته في هذا الطريق لم أر في طريقه مثله في الاجتهاد فقال لي الرجال أربعة رِجالٌ صَدَقُوا ما عاهَدُوا الله عَلَيْهِ وهم رجال الظاهر ورِجالٌ لا تُلْهِيهِمْ تِجارَةٌ ولا بَيْعٌ عَنْ ذِكْرِ الله وهم رجال الباطن جلساء الحق تعالى ولهم المشورة ورجال الأعراف وهم رجال الحد قال الله تعالى وعَلَى الْأَعْرافِ رِجالٌ أهل الشم والتمييز والسراح عن الأوصاف فلا صفة لهم كان منهم أبو يزيد البسطامي ورجال إذا دعاهم الحق إليه يأتونه رجالا لسرعة الإجابة لا يركبون وأَذِّنْ في النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجالًا وهم رجال المطلع فرجال الظاهر هم الذين لهم التصرف في عالم الملك والشهادة وهم الذين كان يشير إليهم الشيخ محمد بن قائد الأواني وهو المقام الذي تركه الشيخ العاقل أبو السعود بن الشبل البغدادي أدبا مع الله أخبرني أبو البدر التماشكي البغدادي رحمه الله قال لما اجتمع محمد بن قائد الأواني وكان من الأفراد بأبي السعود هذا قال له يا أبا السعود إن الله قسم المملكة بيني وبينك فلم لا تتصرف فيها كما أتصرف أنا فقال له أبو السعود يا ابن قائد وهبتك سهمي نحن تركنا الحق يتصرف لنا وهو قوله تعالى فَاتَّخِذْهُ وَكِيلًا فامتثل أمر الله فقال لي أبو البدر قال لي أبو السعود إني أعطيت التصرف في العالم منذ خمس عشرة سنة من تاريخ قوله فتركته وما ظهر علي منه شي‏ء وأما رجال الباطن فهم الذين لهم التصرف في عالم الغيب والملكوت فيستنزلون الأرواح العلوية بهممهم فيما يريدونه وأعني أرواح الكواكب لا أرواح الملائكة وإنما كان ذلك لمانع إلهي قوي يقتضيه مقام الأملاك أخبر الله به في قول جبريل عليه السلام لمحمد صلى الله عليه وسلم فقال وما نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ ومن كان تنزله بأمر ربه لا تؤثر فيه الخاصية ولا ينزل بها نعم أرواح الكواكب تستنزل بالأسماء والبخورات وأشباه ذلك لأنه تنزل معنوي ولمن يشاهد فيه صورا خيالي فإن ذات الكواكب لا تبرح من السماء مكانها ولكن قد جعل الله لمطارح شعاعاتها في عالم الكون والفساد تأثيرات معتادة عند العارفين بذلك كالري عند شرب الماء والشبع عند الأكل ونبات الحبة عند دخول الفصل بنزول المطر والصحو حكمة أودعها العليم الحكيم جل وعز فيفتح لهؤلاء الرجال في باطن الكتب المنزلة والصحف المطهرة وكلام العالم كله ونظم الحروف والأسماء من جهة معانيها ما لا يكون لغيرهم اختصاصا إلهيا وأما رجال الحد فهم الذين لهم التصرف في عالم الأرواح النارية عالم البرزخ‏\nوالجبروت فإنه تحت الجبر أ لا تراه مقهورا تحت سلطان ذوات الأذناب وهم طائفة منهم من الشهب الثواقب فما قهرهم إلا بجنسهم فعند هؤلاء الرجال استنزال أرواحها وإحضارها وهم رجال الأعراف والأعراف سور حاجز بين الجنة والنار برزخ باطنه فيه الرحمة وظاهره من قبله العذاب فهو حد بين دار السعداء ودار الأشقياء دار أهل الرؤية ودار الحجاب وهؤلاء الرجال أسعد الناس بمعرفة هذا السور ولهم شهود الخطوط المتوهمة بين كل نقيضين مثل قوله بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ فلا يتعدون الحدود وهم رجال الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فلهم في كل حضرة دخول واستشراف وهم العارفون بالصفات التي يقع بها الامتياز لكل موجود عن غيره من الموجودات العقلية والحسية وأما رجال المطلع فهم الذين لهم التصرف في الأسماء الإلهية فيستنزلون بها منها ما شاء الله وهذا ليس لغيرهم ويستنزلون بها كل ما هو تحت تصريف الرجال الثلاثة رجال الحد والباطن والظاهر وهم أعظم الرجال وهم الملامية هذا في قوتهم وما يظهر عليهم من ذلك شي‏ء منهم أبو السعود وغيره فهم والعامة في ظهور العجز وظاهر العوائد سواء وكان لأبي السعود في هؤلاء الرجال تميز بل كان من أكبرهم وسمعه أبو البدر على ما حدثنا مشافهة يقول إن من رجال الله من يتكلم على الخاطر وما هو مع الخاطر أي لا علم له بصاحبه ولا يقصد التعريف به ولما وصف لنا عمر البزاز وأبو البدر وغيرهما حال هذا الشيخ رأيناه يجري مع أحوال هذا الصنف العالي من رجال الله قال لي أبو البدر كان كثيرا ما ينشد بيتا لم نسمع منه غيره وهو\n\n\n> وأثبت في مستنقع الموت رجله *** وقال لها من دون أخمصك الحشر\n\n\nوكان يقول ما هو إلا الصلوات الخمس وانتظار الموت وتحت هذا الكلام علم كبير وكان يقول الرجل مع الله تعالى كساعي الطير فم مشغول وقدم تسعى وهذا كله أكبر حالات الرجال مع الله إذ الكبير من الرجال من يعامل كل موطن بما يستحقه وموطن هذه الدنيا لا يمكن أن يعامله المحقق إلا بما ذكره هذا الشيخ فإذا ظهر في هذه الدار من رجل خلاف هذه المعاملة علم إن ثم نفسا ولا بد إلا أن يكون مأمورا بما ظهر منه وهم الرسل والأنبياء عليهم السلام وقد يكون بعض الورثة لهم أمر في وقت بذلك وهو مكر خفي فإنه انفصال عن مقام العبودية التي خلق الإنسان لها\n\n\n### [سر المنازل أو تجليات الحق في الصور]\n\n\nوأما سر المنزل والمنازل فهو ظهور الحق بالتجلي في صور كل ما سواه فلو لا تجليه لكل شي‏ء ما ظهرت شيئية ذلك الشي‏ء قال تعالى إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فقوله إِذا أَرَدْناهُ هو التوجه الإلهي لإيجاد ذلك الشي‏ء ثم قال أَنْ نَقُولَ لَهُ كُنْ فنفس سماع ذلك الشي‏ء خطاب الحق تكون ذلك الشي‏ء فهو بمنزلة سريان الواحد في منازل العدد فتظهر الأعداد إلى ما لا يتناهى بوجود الواحد في هذه المنازل ولو لا وجود عينه فيها ما ظهرت أعيان الأعداد ولا كان لها اسم ولو ظهر الواحد باسمه في هذه المنزلة ما ظهر لذلك العدد عين فلا تجتمع عينه واسمه معا أبدا فيقال اثنان ثلاثة أربعة خمسة إلى ما لا يتناهى وكل ما أسقطت واحدا من عدد معين زال اسم ذلك العدد وزالت حقيقته فالواحد بذاته يحفظ وجود أعيان الأعداد وباسمه يعدمها كذلك إذا قلت القديم فنى المحدث وإذا قلت الله فنى العالم وإذا أخليت العالم من حفظ الله لم يكن للعالم وجود وفنى وإذا سرى حفظ الله في العالم بقي العالم موجودا فبظهوره وتجليه يكون العالم باقيا وعلى هذه الطريقة أصحابنا وهي طريقة النبوة والمتكلمون من الأشاعرة أيضا عليها وهم القائلون بانعدام الأعراض لأنفسها وبهذا يصح افتقار العالم إلى الله في بقائه في كل نفس ولا يزال الله خلاقا على الدوام وغيرهم من أهل النظر لا يصح لهم هذا المقام وأخبرني جماعة من أهل النظر من علماء الرسوم أن طائفة من الحكماء عثروا على هذا ورأيته مذهبا لابن السيد البطليوسي في كتاب ألفه في هذا الفن والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Twenty-Five: Concerning the Knowledge of a Specific, Long-Lived Peg (Watad), the Secrets of the Poles (Aqtab) Specialized in Four Categories of Knowledge, and the Secret of the Dwelling (Manzil) and the Dwellings (Manazil), and Who Among Creation Enters Them\n\n> Indeed, affairs have a limit (hadd) and an origin (matla'),\n> After a manifest (zahr) and a hidden (batn) in which they gather.\n\n> In the One Essence (al-Wahid al-'Ayn) is a secret known only\n> By the degrees (maratib) of numbers through which it occurs.\n\n> He is the One Who brought forth all the numbers,\n> And He is the One for Whom there is no scope in counting.\n\n> His domain is narrow, yet vast; His image\n> Is like a viewer in a mirror when it is imprinted.\n\n> He does not multiply when His degrees grant\n> Multiplicity, for He is prevented by Transcendence (Tanzih).\n\n> Likewise is the Real (al-Haqq), if you verify His image,\n> Through Himself and through you, He rises and descends.\n\n### [Al-Khidr in the Author's Life]\n\nKnow, O intimate friend (wali), may God strengthen you, that this Peg (Watad) is Al-Khidr, the companion of Moses (peace be upon him). May God prolong his life until now. We have seen those who saw him, and a wondrous matter occurred to us concerning him.\n\nThis happened when a question arose between me and our Shaykh, Abu al-Abbas al-'Uraybi (may God have mercy on him), concerning a person whose appearance the Messenger of God (peace and blessings be upon him) had announced. He told me, \"He is so-and-so, the son of so-and-so,\" naming a person I knew by name but had never seen, though I had seen his cousin. I perhaps paused regarding this and did not accept his statement, because I had insight into the matter. There is no doubt that the Shaykh’s arrow returned upon him, and he was inwardly distressed, though I did not perceive this, as I was at the beginning of my path.\n\nI departed from him to my dwelling. While on the road, I met a person I did not know. He greeted me with the spontaneous greeting of a loving, compassionate friend and said to me, \"O Muhammad, Abu al-Abbas spoke the truth regarding what he told you about so-and-so,\" naming the person Abu al-Abbas al-'Uraybi had mentioned. I replied, \"Yes,\" and understood what he intended. I immediately returned to the Shaykh to inform him of what had transpired.\n\nWhen I entered upon him, he said to me, \"O Abu Abd Allah, if I mention an issue to you that your heart hesitates to accept, I will need Al-Khidr to intervene and tell you, 'So-and-so spoke the truth in what he told you.' How can this happen to you regarding every issue you hear from me that causes you to pause?\" I said, \"The door of repentance is open.\" He replied, \"And the acceptance of repentance is realized.\" I then knew that the man was Al-Khidr. Without doubt, I asked the Shaykh if he was indeed him. He said, \"Yes, he is Al-Khidr.\"\n\nThen, another time, I was at the port of Tunis, in the harbor, aboard a ship at sea. I was seized by a stomach ailment, and the ship's crew were asleep. I went to the side of the vessel and looked out at the sea. I saw a person in the distance in the moonlight—it was the night of the full moon—coming across the surface of the water until he reached me. He stood with me, lifted one foot, and rested on the other. I saw the sole of his foot, and it was untouched by wetness. Then he rested on that foot and lifted the other, and it was likewise. He then spoke to me words that were with him, greeted me, and departed, heading toward the lighthouse, a guard post on the seashore situated on a hill. The distance between us and it was more than two miles, yet he covered that distance in two or three steps. I heard his voice while he was atop the lighthouse, glorifying God Almighty.\n\nPerhaps he walked to our Shaykh Jarrah ibn Khamis al-Kittani, who was one of the masters of the folk, residing as a spiritual warrior (murabit) at the port of 'Aydun. I had come from him the previous night. When I arrived in the city, I met a righteous man who asked me, \"How was your night yesterday on the ship with Al-Khidr? What did he say to you, and what did you say to him?\"\n\nAfter that date, I went out traveling along the coast of the Atlantic Ocean (al-Bahr al-Muhit), accompanied by a man who denied the breaking of customary laws (kharq al-'awa'id) by the righteous. I entered a ruined, isolated mosque to pray the noon prayer (Salat al-Dhuhr) with my companion. Suddenly, a group of isolated travelers (sa'ihin) entered, intending the same prayer in that mosque. Among them was the man who had spoken to me on the sea, who I was told was Al-Khidr, and among them was an older man, greater in rank than him. I had previously met this older man, and we shared affection. I stood and greeted him; he returned the greeting, rejoiced at seeing me, and led us in prayer. When we finished the prayer, the Imam left, and I followed him. He was heading toward the mosque door, which was on the western side overlooking the Atlantic Ocean, in a place called Bakka. I stood talking with him at the mosque door. Suddenly, that man whom I identified as Al-Khidr took a small mat (hasir) that was in the prayer niche (mihrab) of the mosque and spread it in the air, about seven cubits above the ground. He stood on the mat, moving in the air. I said to my companion, \"Do you not look at this and what he has done?\" He said to me, \"Go to him and ask him.\"\n\nI left my companion standing and went to him. When he finished his prayer, I greeted him and recited a poem of my own composition:\n\n> The lover's concern is diverted from passion,\n> In the love of the One Who created and subdued passion.\n\n> The Gnostics (Al-'Arifun)—their intellects are restrained\n> From every existence they might approve, being purified.\n\n> Thus, they are honored in His presence, but among mankind,\n> Their states are unknown and concealed.\n\nHe said to me, \"O so-and-so, I only did what you saw for the sake of this denier,\" and he pointed to my companion, who denied the breaking of customary laws and was sitting in the courtyard of the mosque watching him, so that he might know that God does what He wills with whom He wills. I turned my face to the denier and asked him, \"What do you say?\" He replied, \"After seeing with the eye, there is nothing left to say.\"\n\nThen I returned to my companion, who was waiting for me at the mosque door. I spoke with him for an hour and asked him, \"Who is this man who prayed in the air?\" I did not mention to him what had previously occurred between us. He said to me, \"This is Al-Khidr.\" I remained silent. The group departed, and we departed, heading toward Rawta, a desired location sought out by the righteous isolated ones, near Bashkinshar on the coast of the Atlantic Ocean. This is what transpired between us and this Peg (Watad). May God benefit us through seeing him. He possesses the Divinely-imparted Knowledge (Al-'Ilm al-Ladunni) and the mercy toward the world (al-'alam) befitting one of his rank. God has praised him.\n\n### [The Cloak (Khirqa) of Al-Khidr]\n\nA man from among our Shaykhs, Ali ibn Abd Allah ibn Jami', a companion of Ali al-Mutawakkil and Abu Abd Allah Qadib al-Ban, met with him. This man used to reside in al-Maqla outside Mosul in his garden. Al-Khidr had invested him with the Cloak (Khirqa) in the presence of Qadib al-Ban. This Shaykh invested me with it in the same place in his garden where Al-Khidr had invested him, and in the same manner that occurred between them during the investiture.\n\nI had previously worn the Cloak of Al-Khidr through a more distant path, from the hand of our companion Taqi al-Din Abd al-Rahman ibn Ali ibn Maymun ibn Ab al-Tawzari. He had worn it from the hand of Sadr al-Din, the Shaykh of Shaykhs in the Egyptian lands, who was Ibn Hamawayh. His grandfather had worn it from the hand of Al-Khidr. From that time, I began to speak of wearing the Cloak and invested others with it, because I saw that Al-Khidr considered it important. Before that, I did not accept the Cloak as it is currently known, for the Cloak (Khirqa) in our view is merely an expression of Companionship (Suhba), Proper Conduct (Adab), and the acquisition of Moral Character (Takhalluq). This is why its wearing is not found connected directly to the Messenger of God (peace and blessings be upon him), but Companionship and Proper Conduct are found, which is what is expressed by the \"garment of piety\" (libas al-taqwa). It became the custom of the people of spiritual states (ashab al-ahwal) that if they saw one of their companions lacking in some matter and wished to perfect his state for him, the Shaykh would unite with him. When he united with him, he would take the garment he was wearing in the state of that spiritual condition, remove it, and pour it over the man whose state he wished to perfect. That spiritual state would then flow into him, perfecting it for him. That is the garment known to us and transmitted from the realized masters (muhaqqiqin) among our Shaykhs.\n\n### [The Ranks of the Men of God in Understanding the Levels of the Quran]\n\nKnow then that the Men of God (Rijal Allah) are of four ranks: Men who possess the Manifest (Zahir), Men who possess the Hidden (Batin), Men who possess the Limit (Hadd), and Men who possess the Origin (Matla'). Since God Almighty closed the door of Prophethood (Nubuwwa) and Messengership (Risala) to creation, He left open for them the door of Understanding (Fahm) from God regarding what He revealed to His Prophet (peace and blessings be upon him) in His Glorious Book.\n\nAli ibn Abi Talib (may God be pleased with him) used to say, \"Revelation (Wahy) has ceased after the Messenger of God (peace and blessings be upon him), and nothing remains in our hands except that God grants a servant understanding of this Quran.\" Our companions, the People of Unveiling (Ahl al-Kashf), have agreed upon the authenticity of the report from the Prophet (peace and blessings be upon him) that he said concerning the verses of the Quran: \"There is no verse except that it has a manifest (zahir), a hidden (batin), a limit (hadd), and an origin (matla').\"\n\nFor each of these ranks, there are Men, and for each of these groups, there is a Pole (Qutb), and the sphere of that Unveiling revolves around that Pole. I entered upon our Shaykh Abu Muhammad Abd Allah al-Shakkaz, from the people of Bagha in Granada, in the year 595 AH. He was one of the greatest I met on this path; I saw none like him in spiritual striving. He said to me, \"The Men are four:\n\n1.  Men who were true to what they covenanted with God (Rijal Sadaqu ma 'ahadu Allaha 'alayhi) [Q. 33:23]—these are the Men of the Manifest (Zahir).\n2.  Men whom neither commerce nor selling distracts from the remembrance of God (Rijal la tulhihim tijaratun wa la bay'un 'an dhikri Allahi) [Q. 24:37]—these are the Men of the Hidden (Batin), the intimate companions of the Real (al-Haqq) Almighty, and they possess consultation (al-mashura).\n3.  The Men of the Heights (Rijal al-A'raf)—these are the Men of the Limit (Hadd). God Almighty said: <<وَعَلَى الْأَعْرافِ رِجالٌ>> (And on the Heights are men) [Q. 7:46]. They are the people of scenting, distinguishing, and release from descriptions (awsaf); they have no attribute. Abu Yazid al-Bastami was among them.\n4.  Men who, when the Real calls them to Him, come to Him on foot (rijalan) due to the swiftness of their response, not riding [Q. 22:27]—these are the Men of the Origin (Matla').\"\n\nThe Men of the Manifest (Zahir) are those who possess disposal (tasarruf) in the world of Dominion (Malak) and Witnessing (Shahada). They are the ones to whom Shaykh Muhammad ibn Qa'id al-Awani used to refer, and this is the station that the wise Shaykh Abu al-Su'ud ibn al-Shibl al-Baghdadi abandoned out of proper conduct (adab) with God. Abu al-Badr al-Tamashki al-Baghdadi (may God have mercy on him) informed me, saying: When Muhammad ibn Qa'id al-Awani, who was one of the unique individuals (al-afrad), met with this Abu al-Su'ud, he said to him, \"O Abu al-Su'ud, God has divided the Kingdom (al-Mamlaka) between you and me. Why do you not exercise disposal in it as I do?\" Abu al-Su'ud replied, \"O Ibn Qa'id, I have gifted you my share. We have left the Real (al-Haqq) to exercise disposal for us,\" referring to His saying: <<فَاتَّخِذْهُ وَكِيلًا>> (So take Him as a Trustee) [Q. 73:9]. Thus, he complied with God's command. Abu al-Badr told me that Abu al-Su'ud said to him, \"I was granted disposal in the world fifteen years ago from the date of that saying, but I abandoned it, and nothing of it has appeared through me.\"\n\nAs for the Men of the Hidden (Batin), they are those who possess disposal in the world of the Unseen (Ghayb) and the Kingdom (Malakut). They summon the celestial spirits (al-arwah al-'ulwiyya) through their spiritual resolve (himam) for whatever they desire—and I mean the spirits of the stars, not the spirits of the angels. This is due to a strong Divine impediment necessitated by the station of the angels, which God informed us of in the saying of Gabriel (peace be upon him) to Muhammad (peace and blessings be upon him): <<وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ>> (And we do not descend except by the command of your Lord) [Q. 19:64]. One whose descent is by the command of his Lord is not affected by specific properties (al-khassiyya) and does not descend by them. Yes, the spirits of the stars are summoned by the Divine Names (al-Asma'), incenses (bukhūrāt), and similar means, because their descent is conceptual (ma'nawi), and for those who witness them, they appear as imaginary forms (suwar khayaliyya). The essence (dhat) of the stars never leaves its place in the heaven. However, God has placed in the trajectories of their rays in the world of Generation and Corruption (al-Kawn wa al-Fasad) effects that are customary among those who know them, such as thirst when drinking water, satiety when eating, and the growth of the seed when the season arrives with the descent of rain or clear weather—a wisdom deposited by the All-Knowing, the Wise, exalted and majestic is He. For these Men, the inner meaning (batin) of the revealed Books, the purified Scrolls, the speech of the entire world, and the arrangement of letters and Names is opened up through their meanings, in a way that is not granted to others, as a Divine specialization.\n\nAs for the Men of the Limit (Hadd), they are those who possess disposal in the world of the fiery spirits (al-arwah al-nariyya)—the world of the Isthmus (Barzakh) and the Compulsion (Jabarut). It is under compulsion (jabr); do you not see it subdued under the authority of the possessors of tails (dhawat al-adhnab), who are a group of the piercing meteors (al-shuhub al-thawaqib)? They are only subdued by their own kind. These Men possess the ability to summon and bring forth their spirits. They are the Men of the Heights (A'raf). The Heights (A'raf) is a barrier wall between Paradise and the Fire, an Isthmus (Barzakh) whose interior contains mercy and whose exterior, facing it, contains punishment. It is a limit (hadd) between the abode of the fortunate and the abode of the wretched, the abode of the People of Vision (Ahl al-Ru'ya) and the abode of the Veil (Hijab). These Men are the happiest people in knowing this wall. They witness the imaginary lines (al-khutut al-mutawahhama) between every two opposites, such as His saying: <<بَيْنَهُما بَرْزَخٌ لَا يَبْغِيانِ>> (Between them is an Isthmus [Barzakh]; they do not transgress) [Q. 55:20]. Thus, they do not transgress the limits. They are the Men of the Mercy that <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompassed all things) [Q. 7:156]. They have entry and insight into every Divine Presence (Hadra). They are the Gnostics (Al-'Arifun) of the Attributes (Sifat) by which every existent thing is distinguished from every other existent thing, whether intellectual or sensory.\n\nAs for the Men of the Origin (Matla'), they are those who possess disposal in the Divine Names (al-Asma' al-Ilahiyya), summoning from them whatever God wills. This is not granted to others. They also summon through them everything that is under the disposal of the three other Men: the Men of the Limit, the Hidden, and the Manifest. They are the greatest of the Men, and they are the Malamiyya (People of Blame). This is in their power, yet nothing of it appears through them. Abu al-Su'ud and others are among them. They and the common people are equal in the appearance of incapacity and the outward customary laws. Abu al-Su'ud had distinction among these Men; indeed, he was one of the greatest of them. Abu al-Badr heard him, as he narrated to us orally, saying: \"Among the Men of God are those who speak based on the passing thought (khatir), yet they are not with the thought,\" meaning they have no knowledge of its owner and do not intend to introduce themselves through it. When Umar al-Bazzaz, Abu al-Badr, and others described the state of this Shaykh to us, we saw that he aligned with the states of this high class of the Men of God. Abu al-Badr told me that he often recited only one verse of poetry that we heard from him:\n\n> He planted his foot firmly in the swamp of death,\n> And said to it, \"The Resurrection is just below your sole.\"\n\nHe used to say, \"It is nothing but the five prayers and waiting for death.\" Underneath this statement lies great knowledge. He also used to say, \"The Man with God Almighty is like the bird catcher: a busy heart and a foot that strives.\" All of this represents the highest states of the Men with God, for the great man among the Men is he who treats every station according to what it deserves. The station of this world cannot be treated by the realized master (al-muhaqqiq) except as this Shaykh mentioned. If a man exhibits behavior contrary to this treatment in this abode, it is known that there is ego (nafs) involved, unless he is commanded to manifest what appeared from him—and these are the Messengers and Prophets (peace be upon them). Some of the inheritors (al-waratha) may be commanded to do so at times, but this is a subtle deception (makr khafi), for it is a separation from the station of servitude ('ubudiyya) for which humanity was created.\n\n### [The Secret of the Dwelling (Manzil) or the Theophanies of the Real in Forms]\n\nAs for the secret of the Dwelling (Manzil) and the Dwellings (Manazil), it is the appearance of the Real (al-Haqq) through Theophany (Tajalli) in the forms of everything other than Him. Were it not for His Theophany to everything, the 'thingness' (shay'iyya) of that thing would not have appeared. God Almighty said: <<إِنَّما قَوْلُنا لِشَيْءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ>> (Indeed, Our word to a thing, when We intend it, is only that We say to it, \"Be!\") [Q. 16:40]. His saying <<إِذا أَرَدْناهُ>> (when We intend it) is the Divine attention (al-tawajjuh al-ilahi) toward the existence of that thing. Then He said <<أَنْ نَقُولَ لَهُ كُنْ>> (that We say to it, \"Be!\"). The very hearing of the Real's address by that thing constitutes the formation of that thing.\n\nThis is analogous to the permeation of the One (al-Wahid) through the stations (manazil) of number, whereby numbers appear infinitely through the existence of the One in these stations. Were it not for the existence of its Essence ('ayn) within them, the essences (a'yan) of the numbers would not have appeared, nor would they have a name. Yet, if the One appeared by its name in that station, the essence of that number would not appear. Thus, its Essence and its Name never gather together. So, one says: two, three, four, five, and so on infinitely. Every time you subtract one from a specific number, the name of that number vanishes, and its reality vanishes. The One, by its Essence (dhat), preserves the existence of the essences of the numbers, but by its Name, it annihilates them.\n\nLikewise, when you say \"The Eternal\" (al-Qadim), the originated (al-muhdath) is annihilated. When you say \"Allah,\" the world ('alam) is annihilated. If you empty the world of God's preservation (hifz Allah), the world would have no existence and would be annihilated. If God's preservation permeates the world, the world remains existent. Thus, through His appearance and His Theophany (Tajalli), the world remains subsistent (baqiyan). Our companions follow this method, which is the method of Prophethood. The theologians (mutakallimun) of the Ash'aris are also upon it; they are the ones who assert the self-annihilation of accidents (a'rad) [in every instant]. By this, the world's need for God in its subsistence (baqa') in every breath is validated, and God remains perpetually Creative (Khallaq). Others among the people of speculation (ahl al-nazar) cannot validate this station. A group of the people of speculation among the scholars of external knowledge (ulama' al-rusum) informed me that a faction of the philosophers (hukama') stumbled upon this, and I saw it as the doctrine of Ibn al-Sayyid al-Batliyusi in a book he authored on this subject. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And God speaks the Truth, and He guides to the Way) [Q. 33:4].",
    "ur": "باب پچیسواں: ایک مخصوص معمر وتد (Wated) کی معرفت، اور ان اقطاب (Aqṭāb) کے اسرار جو چار قسم کے علوم کے ساتھ مختص ہیں، اور سرِ منزل و منازل، اور ان میں داخل ہونے والے عالم کی معرفت میں۔\n\nبے شک امور کی ایک حد اور ایک مطلع ہے، جو ظاہر اور باطن کے بعد اس میں جمع ہوتے ہیں۔\nواحد عین (Al-Wāḥid al-‘Ayn) میں ایک راز ہے جسے کوئی نہیں جانتا، سوائے اعداد کے مراتب کے جن کے ذریعے وہ واقع ہوتا ہے۔\nوہی ہے جس نے تمام اعداد کو ظاہر کیا، اور وہی ہے جس کے لیے گنتی میں کوئی گنجائش نہیں۔\nاس کا میدان تنگ بھی ہے اور وسیع بھی، سو اس کی صورت ایسی ہے جیسے کوئی دیکھنے والا آئینے میں جب وہ منعکس ہوتا ہے۔\nپس جب اس کے مراتب کثرت دیتے ہیں تو وہ کثیر نہیں ہوتا، کیونکہ وہ تنزیہ (Tanzīh) کے ذریعے کثرت سے ممتنع ہے۔\nاسی طرح ذات حق (Al-Ḥaqq) ہے، اگر تم اس کی صورت کو پہچان لو، تو وہ اپنے آپ سے اور تم سے بلند بھی ہوتا ہے اور پست بھی۔\n\n### [مصنف کی زندگی میں خضر]\n\nاے میرے پیارے ولی! اللہ آپ کی تائید کرے، جان لیجیے کہ یہ وتد (Wated) حضرت خضر ہیں جو حضرت موسیٰ علیہ السلام کے ساتھی تھے، اللہ نے ان کی عمر اب تک دراز کی ہے۔ ہم نے ان لوگوں کو دیکھا ہے جنہوں نے انہیں دیکھا، اور ان کے معاملے میں ہمارے ساتھ ایک عجیب واقعہ پیش آیا۔ وہ یہ کہ ہمارے شیخ ابو العباس العریبی رحمۃ اللہ علیہ کے اور میرے درمیان ایک ایسے شخص کے بارے میں مسئلہ زیر بحث آیا جس کے ظہور کی بشارت رسول اللہ صلی اللہ علیہ وسلم نے دی تھی۔ انہوں نے مجھ سے کہا کہ وہ فلاں ابن فلاں ہے، اور انہوں نے مجھے ایک ایسے شخص کا نام بتایا جسے میں نام سے جانتا تھا لیکن میں نے اسے دیکھا نہیں تھا، البتہ میں نے اس کے خالہ زاد بھائی کو دیکھا تھا۔ شاید میں نے اس پر توقف کیا اور ان کی بات کو قبول نہ کیا، کیونکہ میں اس کے معاملے میں بصیرت رکھتا تھا۔ اور بلاشبہ شیخ کا تیر ان پر ہی پلٹا، چنانچہ وہ باطنی طور پر تکلیف میں آئے، اور مجھے اس کا احساس نہیں ہوا کیونکہ میں اپنے ابتدائی دور میں تھا۔ میں ان کے پاس سے اپنے گھر کی طرف چلا گیا۔ میں راستے میں تھا کہ مجھے ایک شخص ملا جسے میں نہیں جانتا تھا۔ اس نے ایک شفیق محب کی طرح سلام میں پہل کی اور مجھ سے کہا: اے محمد! شیخ ابو العباس نے فلاں کے بارے میں جو کچھ تم سے کہا ہے، اس میں انہوں نے سچ کہا ہے۔ اور انہوں نے وہی شخص نام لے کر بتایا جس کا ذکر ابو العباس العریبی نے کیا تھا۔ میں نے کہا: جی ہاں، اور میں سمجھ گیا کہ وہ کیا چاہتے تھے۔ میں فوراً شیخ کے پاس واپس گیا تاکہ انہیں اس واقعے سے آگاہ کروں۔ جب میں ان کے پاس داخل ہوا تو انہوں نے مجھ سے کہا: اے ابو عبداللہ! جب میں تم سے کوئی مسئلہ بیان کرتا ہوں اور تمہارا دل اسے قبول کرنے سے رک جاتا ہے، تو مجھے تمہارے ساتھ خضر کی ضرورت پڑتی ہے کہ وہ تمہارے سامنے آ کر کہیں کہ فلاں نے جو کچھ تم سے کہا ہے، اس میں سچ کہا ہے۔ اور یہ تمہیں ہر اس مسئلے میں کیسے میسر آ سکتا ہے جو تم مجھ سے سنو اور توقف کرو؟ میں نے کہا: توبہ کا دروازہ کھلا ہے۔ انہوں نے فرمایا: اور توبہ کا قبول ہونا واقع ہے۔ تب میں جان گیا کہ وہ شخص خضر تھے، اور بلاشبہ میں نے شیخ سے پوچھا کہ کیا وہ وہی تھے؟ انہوں نے فرمایا: ہاں، وہ خضر تھے۔\n\nپھر ایک اور مرتبہ میرے ساتھ یہ واقعہ پیش آیا کہ میں تونس کی بندرگاہ پر الحفرہ کے مقام پر سمندر میں ایک کشتی میں تھا۔ مجھے پیٹ میں درد ہوا اور کشتی والے سو چکے تھے۔ میں جہاز کے کنارے پر کھڑا ہوا اور سمندر کی طرف دیکھا۔ میں نے چاند کی روشنی میں ایک شخص کو دور سے دیکھا، وہ چودھویں کی رات تھی، اور وہ پانی کی سطح پر چلتا ہوا میری طرف آ رہا تھا یہاں تک کہ وہ میرے پاس پہنچ گیا۔ وہ میرے ساتھ کھڑا ہوا اور اپنا ایک پاؤں اٹھایا اور دوسرے پر سہارا لیا۔ میں نے اس کے تلوے کو دیکھا اور اسے کوئی نمی نہیں لگی تھی۔ پھر اس نے اس پر سہارا لیا اور دوسرا پاؤں اٹھایا تو وہ بھی اسی طرح تھا۔ پھر اس نے مجھ سے کچھ باتیں کیں جو اس کے پاس تھیں، پھر سلام کیا اور چلا گیا، وہ ساحل سمندر پر ایک ٹیلے پر واقع مینار کی طرف جا رہا تھا جو ایک پہرے کی جگہ تھی۔ ہمارے اور اس کے درمیان دو میل سے زیادہ کا فاصلہ تھا، مگر اس نے وہ فاصلہ دو یا تین قدموں میں طے کر لیا۔ میں نے اس کی آواز سنی جب وہ مینار کی چھت پر تھا اور اللہ تعالیٰ کی تسبیح کر رہا تھا۔\n\nاور شاید وہ ہمارے شیخ جراح بن خمیس الکتانی کے پاس گئے ہوں، جو قوم کے سرداروں میں سے تھے اور مرسیٰ عیدون میں قیام پذیر تھے۔ میں اس رات سے ایک دن پہلے ہی ان کے پاس سے آیا تھا۔ جب میں شہر پہنچا تو ایک نیک آدمی سے ملا، اس نے مجھ سے پوچھا: کل رات کشتی میں خضر کے ساتھ تمہاری رات کیسی گزری؟ انہوں نے تم سے کیا کہا اور تم نے انہیں کیا جواب دیا؟ اس تاریخ کے بعد میں بحر محیط کے ساحل پر سیاحت کے لیے نکلا، اور میرے ساتھ ایک ایسا شخص تھا جو صالحین کے خرقِ عادات (معجزات) کا انکار کرتا تھا۔ میں اور میرا ساتھی ظہر کی نماز پڑھنے کے لیے ایک ویران اور الگ تھلگ مسجد میں داخل ہوئے۔ اچانک سیاحت کرنے والے منقطعین کی ایک جماعت ہم پر داخل ہوئی، وہ بھی اسی مسجد میں نماز پڑھنا چاہتے تھے جو ہم چاہتے تھے۔ ان میں وہ شخص بھی تھا جس نے مجھ سے سمندر پر بات کی تھی اور جس کے بارے میں مجھے بتایا گیا تھا کہ وہ خضر ہیں۔ اور ان میں ایک بزرگ شخص بھی تھا جو ان سے مرتبے میں بڑا تھا۔ اس بزرگ شخص سے میری پہلے ملاقات اور محبت تھی۔ میں کھڑا ہوا اور انہیں سلام کیا، انہوں نے مجھے سلام کیا اور مجھ سے مل کر خوش ہوئے اور ہمیں نماز پڑھانے کے لیے آگے بڑھے۔ جب ہم نماز سے فارغ ہوئے تو امام باہر نکلے اور میں ان کے پیچھے نکلا، وہ مسجد کے دروازے کی طرف جا رہے تھے، اور دروازہ مغربی جانب تھا جو بحر محیط پر بکہ نامی جگہ پر نظر آتا تھا۔ میں دروازے پر ان سے بات کرنے لگا۔ اچانک وہ شخص جسے میں نے خضر کہا تھا، اس نے مسجد کے محراب میں پڑی ایک چھوٹی چٹائی لی اور اسے زمین سے تقریباً سات ہاتھ کی بلندی پر ہوا میں بچھا دیا اور ہوا میں اس چٹائی پر کھڑے ہو کر حرکت کرنے لگا۔ میں نے اپنے ساتھی سے کہا: کیا تم اس کو اور اس کے فعل کو نہیں دیکھتے؟ اس نے مجھ سے کہا: اس کے پاس جاؤ اور اس سے پوچھو۔ میں نے اپنے ساتھی کو کھڑا چھوڑا اور ان کے پاس آیا۔ جب وہ اپنی نماز سے فارغ ہوئے تو میں نے انہیں سلام کیا اور اپنے اشعار سنائے:\n\nمحب کو ہوا سے اس کا راز مشغول رکھتا ہے،\nاس ذات کی محبت میں جس نے ہوا کو پیدا کیا اور مسخر کیا۔\nعارفین (Al-Ārifūn) کی عقلیں ہر اس وجود سے بندھی ہوئی ہیں\nجسے وہ پاکیزہ سمجھتے ہیں۔\nپس وہ اس کے ہاں مکرم ہیں، اور مخلوق میں\nان کے احوال نامعلوم اور پوشیدہ ہیں۔\n\nانہوں نے مجھ سے کہا: اے فلاں! تم نے جو کچھ دیکھا ہے، میں نے وہ صرف اس منکر کے حق میں کیا ہے، اور انہوں نے میرے اس ساتھی کی طرف اشارہ کیا جو خرقِ عادات کا انکار کرتا تھا، اور وہ مسجد کے صحن میں بیٹھا انہیں دیکھ رہا تھا، تاکہ وہ جان لے کہ اللہ جو چاہتا ہے جس کے ساتھ چاہتا ہے کرتا ہے۔ میں نے منکر کی طرف رخ کیا اور اس سے پوچھا: تم کیا کہتے ہو؟ اس نے کہا: آنکھ سے دیکھنے کے بعد کہنے کی کوئی گنجائش نہیں۔ پھر میں اپنے ساتھی کے پاس واپس آیا جو مسجد کے دروازے پر میرا انتظار کر رہا تھا۔ میں نے اس سے کچھ دیر بات کی اور اس سے پوچھا: یہ شخص کون ہے جس نے ہوا میں نماز پڑھی؟ اور میں نے اسے وہ واقعہ نہیں بتایا جو اس سے پہلے میرے ساتھ پیش آیا تھا۔ اس نے مجھ سے کہا: یہ خضر ہیں۔ میں خاموش ہو گیا اور جماعت چلی گئی، اور ہم بھی روطہ کی طرف روانہ ہوئے، جو ایک مقصود جگہ ہے جہاں سے منقطع صالحین جاتے ہیں، اور یہ بحر محیط کے ساحل پر بشکنصار کے قریب ہے۔ یہ وہ واقعات ہیں جو ہمارے ساتھ اس وتد (Wated) کے ساتھ پیش آئے، اللہ ہمیں ان کے دیدار سے نفع دے۔ ان کے پاس علم لدنی (Al-Ilm al-Ladunī) اور عالم پر ایسی رحمت ہے جو ان کے مرتبے کے لائق ہے، اور اللہ نے ان کی تعریف کی ہے۔\n\n### [خضر کی خرقه]\n\nاور ہمارے شیوخ میں سے ایک شخص ان سے ملے، وہ علی بن عبداللہ بن جامع تھے، جو علی المتوکل اور ابو عبداللہ قضیب البان کے اصحاب میں سے تھے۔ وہ موصل کے باہر المقلیٰ میں اپنے ایک باغ میں رہتے تھے۔ خضر نے قضیب البان کی موجودگی میں انہیں خرقه (Khirqa - صوفیانہ چادر) پہنائی تھی۔ اور شیخ نے مجھے اسی جگہ پر خرقه پہنائی جہاں خضر نے انہیں اپنے باغ میں پہنائی تھی، اور اسی کیفیت کے ساتھ جو انہیں خضر کے ساتھ پیش آئی تھی۔\n\nاور میں نے اس سے بھی دور کے طریقے سے خضر کی خرقه (Khirqa) اپنے ساتھی تقی الدین عبدالرحمن بن علی بن میمون بن اب التوزری کے ہاتھ سے پہنی تھی۔ اور انہوں نے اسے مصر کے صدر الدین شیخ الشیوخ، جو ابن حمویہ تھے، کے ہاتھ سے پہنا تھا۔ اور ان کے دادا نے اسے خضر کے ہاتھ سے پہنا تھا۔ اس وقت سے میں نے خرقه پہننے کی بات کی اور لوگوں کو پہنائی، جب میں نے دیکھا کہ خضر نے اسے معتبر جانا ہے۔ اس سے پہلے میں موجودہ معروف خرقه کا قائل نہیں تھا۔ کیونکہ ہمارے نزدیک خرقه (Khirqa) صرف صحبت، ادب اور اخلاق کی علامت ہے۔ اسی لیے اس کا لباس رسول اللہ صلی اللہ علیہ وسلم سے متصل نہیں ملتا، لیکن صحبت اور ادب ملتا ہے، جسے لباس تقویٰ (Libās al-Taqwā) سے تعبیر کیا جاتا ہے۔ چنانچہ اہل احوال (Ahl al-Aḥwāl) کی یہ عادت رہی ہے کہ جب وہ اپنے کسی ساتھی میں کسی معاملے میں کوئی کمی دیکھتے ہیں اور اس کے حال کو مکمل کرنا چاہتے ہیں تو وہ شیخ اس سے متحد ہو جاتا ہے۔ جب وہ اس سے متحد ہو جاتا ہے تو وہ اس لباس کو جو اس حال کی حالت میں اس پر ہوتا ہے، اتارتا ہے اور اس شخص پر ڈال دیتا ہے جس کے حال کو مکمل کرنا مقصود ہوتا ہے۔ پس وہ حال اس میں سرایت کر جاتا ہے اور اس کا حال مکمل ہو جاتا ہے۔ یہی وہ لباس ہے جو ہمارے نزدیک معروف ہے اور ہمارے محقق شیوخ سے منقول ہے۔\n\n### [قرآن کے مراتب کو سمجھنے میں رجال اللہ کے مراتب]\n\nپھر جان لیجیے کہ رجال اللہ (Rijāl Allāh - اللہ کے بندے) چار مراتب پر ہیں: وہ رجال جن کے لیے ظاہر ہے، وہ رجال جن کے لیے باطن ہے، وہ رجال جن کے لیے حد ہے، اور وہ رجال جن کے لیے مطلع ہے۔ جب اللہ سبحانہ نے مخلوق پر نبوت اور رسالت کا دروازہ بند کر دیا تو ان کے لیے اللہ کی طرف سے اس وحی کو سمجھنے کا دروازہ باقی رکھا جو اس نے اپنے نبی صلی اللہ علیہ وسلم پر اپنی عزیز کتاب میں نازل فرمائی۔\n\nاور علی بن ابی طالب رضی اللہ عنہ فرمایا کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کے بعد وحی منقطع ہو چکی ہے، اور ہمارے ہاتھوں میں اب صرف یہ باقی ہے کہ اللہ کسی بندے کو اس قرآن میں فہم عطا کرے۔ اور ہمارے اصحاب اہل کشف (Ahl al-Kashf) کا اس حدیث کی صحت پر اجماع ہے کہ نبی صلی اللہ علیہ وسلم نے قرآن کی آیات کے بارے میں فرمایا: \"کوئی ایسی آیت نہیں مگر اس کا ظاہر (Ẓāhir) اور باطن (Bāṭin)، حد (Ḥadd) اور مطلع (Maṭla‘) ہے۔\"\n\nاور ان مراتب میں سے ہر ایک کے لیے رجال ہیں، اور ان گروہوں میں سے ہر ایک کے لیے ایک قطب (Quṭb) ہے، اور اس کشف (Kashf) کا فلک اسی قطب کے گرد گھومتا ہے۔ میں اپنے شیخ ابو محمد عبداللہ الشکاز کے پاس گیا، جو غرناطہ کے باغه سے تھے، سنہ ۵۹۵ھ میں۔ وہ ان بزرگوں میں سے تھے جن سے میں اس راستے میں ملا، میں نے ان جیسا مجاہدہ کرنے والا نہیں دیکھا۔ انہوں نے مجھ سے کہا: رجال چار ہیں:\n\n۱. **رِجالٌ صَدَقُوا ما عاهَدُوا الله عَلَيْهِ** (وہ مرد جنہوں نے اللہ سے کیے ہوئے عہد کو سچ کر دکھایا) اور یہ رجال الظاہر (Rijāl al-Ẓāhir - ظاہر کے رجال) ہیں۔\n۲. **رِجالٌ لا تُلْهِيهِمْ تِجارَةٌ ولا بَيْعٌ عَنْ ذِكْرِ الله** (وہ مرد جنہیں تجارت اور خرید و فروخت اللہ کے ذکر سے غافل نہیں کرتی) اور یہ رجال الباطن (Rijāl al-Bāṭin - باطن کے رجال) ہیں، جو ذات حق (Al-Ḥaqq) کے ہم نشین ہیں اور انہیں مشورہ دیا جاتا ہے۔\n۳. **رجال الأعراف** (رجال الاعراف) اور یہ رجال الحد (Rijāl al-Ḥadd - حد کے رجال) ہیں۔ اللہ تعالیٰ نے فرمایا: **وَعَلَى الْأَعْرافِ رِجالٌ** (اور اعراف پر کچھ مرد ہوں گے)۔ یہ سونگھنے، تمیز کرنے اور اوصاف سے آزاد ہونے والے ہیں، ان کی کوئی صفت نہیں ہوتی۔ ان میں سے ابو یزید بسطامی تھے۔\n۴. وہ رجال کہ جب ذات حق (Al-Ḥaqq) انہیں اپنی طرف بلاتا ہے تو وہ تیزی سے جواب دینے کی وجہ سے پیدل آتے ہیں، سوار نہیں ہوتے: **وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجالًا** (اور لوگوں میں حج کا اعلان کر دو، وہ تمہارے پاس پیدل آئیں گے)۔ اور یہ رجال المطلع (Rijāl al-Maṭla‘ - مطلع کے رجال) ہیں۔\n\nرجال الظاہر (Rijāl al-Ẓāhir) وہ ہیں جنہیں عالم ملک (Al-Mulk - مادی دنیا) اور شہادت (ظاہر) میں تصرف حاصل ہے۔ یہ وہی ہیں جن کی طرف شیخ محمد بن قائد الاوانی اشارہ کرتے تھے، اور یہ وہ مقام ہے جسے عاقل شیخ ابو السعود بن الشبل البغدادی نے اللہ کے ساتھ ادب کی وجہ سے چھوڑ دیا تھا۔ ابو البدر التماشکی البغدادی رحمۃ اللہ علیہ نے مجھے خبر دی، انہوں نے کہا: جب محمد بن قائد الاوانی، جو افراد (Afrād) میں سے تھے، ابو السعود سے ملے تو انہوں نے ان سے کہا: اے ابو السعود! اللہ نے سلطنت میرے اور تمہارے درمیان تقسیم کر دی ہے، تم اس میں تصرف کیوں نہیں کرتے جیسا کہ میں کرتا ہوں؟ ابو السعود نے انہیں جواب دیا: اے ابن قائد! میں نے اپنا حصہ تمہیں ہبہ کر دیا۔ ہم نے ذات حق (Al-Ḥaqq) کو چھوڑ دیا ہے کہ وہ ہمارے لیے تصرف کرے، اور یہی اللہ تعالیٰ کا قول ہے: **فَاتَّخِذْهُ وَكِيلًا** (پس اسی کو کارساز بنا لو)۔ چنانچہ انہوں نے اللہ کے حکم کی تعمیل کی۔ ابو البدر نے مجھے بتایا کہ ابو السعود نے مجھ سے کہا: مجھے پندرہ سال پہلے عالم میں تصرف کی طاقت دی گئی تھی، لیکن میں نے اسے چھوڑ دیا اور مجھ پر اس میں سے کچھ بھی ظاہر نہیں ہوا۔\n\nاور رجال الباطن (Rijāl al-Bāṭin) وہ ہیں جنہیں عالم غیب (Al-Ghayb) اور ملکوت (Al-Malakūt) میں تصرف حاصل ہے۔ وہ اپنی ہمتوں کے ذریعے علوی ارواح کو اپنی مرضی کے مطابق نازل کرتے ہیں۔ اور میری مراد کواکب کی ارواح ہیں، نہ کہ فرشتوں کی ارواح۔ یہ اس لیے ہے کہ ایک قوی الٰہی رکاوٹ ہے جو املاک (فرشتوں) کے مقام کا تقاضا کرتی ہے، جس کی خبر اللہ نے جبرائیل علیہ السلام کے قول میں محمد صلی اللہ علیہ وسلم کو دی، چنانچہ انہوں نے فرمایا: **وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ** (اور ہم نہیں اترتے مگر آپ کے رب کے حکم سے)۔ اور جس کا نزول اپنے رب کے حکم سے ہو، اس پر خاصیت اثر انداز نہیں ہوتی اور نہ ہی وہ اس کے ذریعے نازل ہوتا ہے۔ ہاں، کواکب کی ارواح اسماء، بخورات اور اسی طرح کی چیزوں کے ذریعے نازل کی جاتی ہیں، کیونکہ یہ ایک معنوی نزول ہے، اور اس شخص کے لیے جو اس میں خیالی صورتیں دیکھتا ہے۔ کیونکہ کواکب کی ذات آسمان میں اپنی جگہ سے نہیں ہٹتی، لیکن اللہ نے عالم کون و فساد (Al-Kawn wal-Fasād) میں ان کی شعاعوں کے گرنے کی جگہوں کے لیے ایسے اثرات مقرر کیے ہیں جو اس کے عارفین کے نزدیک معمول ہیں، جیسے پانی پینے سے سیرابی، کھانے سے شکم سیری، اور موسم کے آنے پر بارش کے نزول سے دانے کا اگنا اور موسم کا صاف ہونا۔ یہ وہ حکمت ہے جو علیم و حکیم (Al-Alīm al-Ḥakīm) نے ان میں ودیعت کی ہے۔ ان رجال کے لیے نازل شدہ کتابوں، پاکیزہ صحیفوں، اور تمام عالم کے کلام کے باطن میں، اور حروف اور اسماء کی معنوی جہت سے وہ کچھ کھول دیا جاتا ہے جو کسی اور کے لیے نہیں ہوتا، یہ ایک الٰہی اختصاص ہے۔\n\nاور رجال الحد (Rijāl al-Ḥadd) وہ ہیں جنہیں عالم ارواح ناریہ (آتشی ارواح کا عالم)، عالم برزخ (Al-Barzakh) اور جبروت (Al-Jabarūt) میں تصرف حاصل ہے۔ یہ جبر کے تحت ہے، کیا تم نہیں دیکھتے کہ یہ دم دار ستاروں کے تسلط کے تحت مغلوب ہے، اور وہ ان میں سے شہاب ثاقب (ٹوٹنے والے ستارے) کا ایک گروہ ہیں۔ انہیں ان کی جنس کے سوا کسی نے مغلوب نہیں کیا۔ ان رجال کے پاس ان کی ارواح کو نازل کرنے اور حاضر کرنے کی طاقت ہے۔ یہ رجال الاعراف (Rijāl al-A‘rāf) ہیں۔ اور اعراف جنت اور دوزخ کے درمیان ایک رکاوٹ والی دیوار ہے، ایک برزخ (Barzakh) ہے جس کے باطن میں رحمت ہے اور جس کے ظاہر کی طرف سے عذاب ہے۔ پس یہ نیک بختوں کے گھر اور بدبختوں کے گھر، اہل رؤیت کے گھر اور اہل حجاب کے گھر کے درمیان ایک حد ہے۔ یہ رجال اس دیوار کی معرفت میں سب سے زیادہ خوش نصیب ہیں۔ اور انہیں ہر دو متضاد چیزوں کے درمیان کھینچی گئی موہوم لکیروں کا شہود (Shuhūd) حاصل ہے، جیسے اللہ کا قول: **بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ** (ان دونوں کے درمیان ایک پردہ ہے کہ وہ تجاوز نہیں کرتے)۔ پس وہ حدود سے تجاوز نہیں کرتے۔ اور یہ اس رحمت کے رجال ہیں جو **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (ہر چیز پر محیط ہے)۔ پس انہیں ہر حضور (Ḥaḍra) میں داخلہ اور جھانکنے کا موقع ملتا ہے۔ اور یہ ان صفات کے عارف ہیں جن کے ذریعے ہر موجود کو دوسرے عقلی اور حسی موجودات سے امتیاز حاصل ہوتا ہے۔\n\nاور رجال المطلع (Rijāl al-Maṭla‘) وہ ہیں جنہیں اسماء الٰہیہ (Divine Names) میں تصرف حاصل ہے، پس وہ ان کے ذریعے ان سے وہ کچھ نازل کرتے ہیں جو اللہ چاہتا ہے، اور یہ کسی اور کے لیے نہیں ہے۔ اور وہ ان کے ذریعے ہر اس چیز کو نازل کرتے ہیں جو تینوں رجال (رجال الحد، الباطن، اور الظاہر) کے تصرف کے تحت ہے۔ یہ سب سے عظیم رجال ہیں اور یہ ملامیہ (Malamiyya) ہیں۔ یہ ان کی قوت ہے، لیکن ان پر اس میں سے کچھ بھی ظاہر نہیں ہوتا۔ ان میں سے ابو السعود اور دیگر شامل ہیں۔ پس وہ اور عام لوگ عجز کے ظاہر ہونے اور ظاہری عادات میں برابر ہیں۔\n\nاور ابو السعود کو ان رجال میں امتیاز حاصل تھا، بلکہ وہ ان میں سب سے بڑے تھے۔ ابو البدر نے ہمیں زبانی بتایا کہ انہوں نے ابو السعود کو یہ کہتے ہوئے سنا کہ اللہ کے بعض رجال ایسے ہیں جو دل میں آنے والے خیال پر بات کرتے ہیں، لیکن وہ خیال کے ساتھ نہیں ہوتے، یعنی انہیں اس کے صاحب کا علم نہیں ہوتا اور نہ ہی وہ اس کے ذریعے تعارف کرانا چاہتے ہیں۔ جب عمر البزاز اور ابو البدر وغیرہ نے ہمیں اس شیخ کا حال بیان کیا تو ہم نے دیکھا کہ وہ رجال اللہ کے اس اعلیٰ طبقے کے احوال کے مطابق چلتے ہیں۔ ابو البدر نے مجھ سے کہا کہ وہ اکثر ایک شعر پڑھا کرتے تھے جو ہم نے ان سے اس کے سوا نہیں سنا:\n\nاور اس نے موت کے دلدل میں اپنا پاؤں جما دیا،\nاور اس سے کہا: تیرے تلوے کے نیچے حشر ہے۔\n\nاور وہ کہا کرتے تھے: یہ صرف پانچ نمازیں اور موت کا انتظار ہے۔ اور اس کلام کے نیچے ایک بڑا علم ہے۔ اور وہ کہا کرتے تھے: اللہ تعالیٰ کے ساتھ مرد کی مثال پرندے کا شکار کرنے والے کی طرح ہے، منہ مشغول ہے اور پاؤں دوڑ رہا ہے۔ یہ سب اللہ کے ساتھ رجال کے سب سے بڑے احوال ہیں، کیونکہ رجال میں بڑا وہی ہے جو ہر مقام کے ساتھ اس کے لائق معاملہ کرے۔ اور اس دنیا کے مقام کے ساتھ محقق (Al-Muḥaqqiq) اس کے سوا کوئی معاملہ نہیں کر سکتا جو اس شیخ نے ذکر کیا۔ پس اگر اس دنیا میں کسی شخص سے اس معاملے کے خلاف کوئی چیز ظاہر ہو تو جان لو کہ وہاں نفس (Nafs) ضرور ہے، سوائے اس کے کہ اسے اس ظاہر ہونے والی چیز کا حکم دیا گیا ہو، اور وہ رسول اور انبیاء علیہم السلام ہیں۔ اور بعض ورثاء کو کسی وقت اس کا حکم ہو سکتا ہے، اور یہ ایک پوشیدہ مکر (Makr Khafī) ہے، کیونکہ یہ مقام عبودیت (Maqām al-‘Ubūdiyya) سے علیحدگی ہے جس کے لیے انسان کو پیدا کیا گیا ہے۔\n\n### [سر المنازل یا صور میں ذات حق کے ظہور الٰہی]\n\nاور سرِ منزل و منازل (Manāzil) یہ ہے کہ ذات حق (Al-Ḥaqq) کا ظہور الٰہی (Al-Tajallī) کے ذریعے ہر اس چیز کی صورتوں میں ہونا جو اس کے سوا ہے۔ اگر ہر چیز کے لیے اس کا ظہور الٰہی (Al-Tajallī) نہ ہوتا تو اس چیز کی شیئیت (چیز ہونا) ظاہر نہ ہوتی۔ اللہ تعالیٰ نے فرمایا: **إِنَّما قَوْلُنا لِشَيْءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ** (ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے کہ ہم اسے کہتے ہیں: ہو جا)۔ پس اس کا قول **إِذا أَرَدْناهُ** (جب ہم اس کا ارادہ کرتے ہیں) اس چیز کو وجود میں لانے کے لیے الٰہی توجہ ہے۔ پھر فرمایا: **أَنْ نَقُولَ لَهُ كُنْ** (کہ ہم اسے کہتے ہیں: ہو جا)۔ پس اس چیز کا ذات حق (Al-Ḥaqq) کے خطاب کو سننا ہی اس چیز کا وجود بن جاتا ہے۔\n\nپس یہ اس طرح ہے جیسے عدد کے منازل میں واحد (ایک) کا سرایت کرنا، چنانچہ ان منازل میں واحد کے وجود سے اعداد لامتناہی طور پر ظاہر ہوتے ہیں۔ اگر ان میں اس کی عین (ذات) کا وجود نہ ہوتا تو اعداد کی اعیان (حقیقتیں) ظاہر نہ ہوتیں اور نہ ہی ان کا کوئی نام ہوتا۔ اور اگر واحد اپنے نام کے ساتھ اس منزل میں ظاہر ہوتا تو اس عدد کی عین ظاہر نہ ہوتی۔ پس اس کی عین اور اس کا نام کبھی بھی ایک ساتھ جمع نہیں ہوتے۔ چنانچہ کہا جاتا ہے: دو، تین، چار، پانچ، لامتناہی تک۔ اور جب بھی تم کسی مخصوص عدد سے ایک کو گرا دو گے تو اس عدد کا نام اور اس کی حقیقت زائل ہو جائے گی۔ پس واحد اپنی ذات کے ذریعے اعداد کی اعیان کے وجود کو محفوظ رکھتا ہے اور اپنے نام کے ذریعے انہیں معدوم کر دیتا ہے۔ اسی طرح جب تم قدیم (Al-Qadīm) کہتے ہو تو محدث (Al-Muḥdath - مخلوق) فنا (Al-Fanā’) ہو جاتا ہے، اور جب تم اللہ کہتے ہو تو عالم فنا ہو جاتا ہے۔ اور اگر تم عالم کو اللہ کی حفاظت سے خالی کر دو تو عالم کا کوئی وجود نہیں رہے گا اور وہ فنا ہو جائے گا۔ اور جب اللہ کی حفاظت عالم میں سرایت کرتی ہے تو عالم موجود رہتا ہے۔ پس اس کے ظہور اور ظہور الٰہی (Al-Tajallī) سے عالم باقی (Al-Baqā’) رہتا ہے۔\n\nاور ہمارے اصحاب اسی طریقے پر ہیں، اور یہ طریقہ نبوت ہے۔ اشاعرہ متکلمین بھی اسی پر ہیں، اور وہ اعراض (Accidents) کے خود بخود معدوم ہو جانے کے قائل ہیں۔ اور اسی سے ہر سانس میں عالم کا اپنے بقا (Al-Baqā’) کے لیے اللہ کا محتاج ہونا درست ثابت ہوتا ہے، اور اللہ ہمیشہ خالق (خلاق) رہتا ہے۔ اور اہل نظر میں سے دوسروں کے لیے یہ مقام درست نہیں ہے۔ اور اہل نظر کے علماء رسوم کی ایک جماعت نے مجھے خبر دی کہ حکماء کا ایک گروہ اس پر مطلع ہوا ہے، اور میں نے اسے ابن السید البطلیوسی کا مذہب بھی دیکھا ہے، جو انہوں نے اس فن پر لکھی گئی ایک کتاب میں بیان کیا ہے۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب بیست و پنجم» در معرفت وتد (Watad) مخصوصی که عمر طولانی یافته است، و اسرار اقطاب (Aqtāb) مختص به چهار صنف از علوم، و راز منزل (Manzil) و منازل (Manāzil) و کسانی از عالَم که به آن وارد شده‌اند.\n\n> همانا امور را حدی و مطلعی است\n>\n> که پس از ظاهر و باطن در آن جمع می‌شوند\n>\n> در واحدِ عین (al-Wāḥid al-‘Ayn) رازی است که آن را نمی‌داند\n>\n> مگر مراتب اعدادی که به واسطه آن واقع می‌شوند\n>\n> اوست که همه اعداد را آشکار ساخت\n>\n> و اوست که در شمارش، گنجایشی ندارد\n>\n> میدان او تنگ و گشاده است، پس صورت او\n>\n> مانند بیننده‌ای است در آینه، هنگامی که نقش می‌بندد\n>\n> پس چون مراتبش کثرت بخشید، کثیر نشد\n>\n> زیرا او به تنزیه (Tanzīh) از کثرت منع شده است\n>\n> همچنین حق (al-Ḥaqq)، اگر صورتش را محقق سازی\n>\n> به ذات خود و به واسطه شما بالا می‌رود و فرو می‌آید\n\n### [خضر در زندگی مؤلف]\n\nای ولیّ صمیمی که خداوند تو را تأیید کرده است، بدان که این وتد (Watad) همان خضر، یار موسی علیه السلام است که خداوند عمرش را تا کنون طولانی گردانیده است. ما کسانی را دیده‌ایم که او را دیده‌اند و در مورد او واقعه‌ای شگفت‌انگیز برای ما رخ داد. این واقعه از این قرار است که بین من و شیخمان ابوالعباس العریبی (رحمه الله) درباره شخصی که رسول خدا (صلی الله علیه و سلم) به ظهور او بشارت داده بود، بحثی درگرفت. او به من گفت: «او فلان پسر فلان است» و نام شخصی را برد که من او را به اسم می‌شناختم اما ندیده بودم، بلکه پسر عمه‌اش را دیده بودم. شاید من در مورد او توقف کردم و سخن او را نپذیرفتم، زیرا در مورد آن شخص بصیرتی داشتم. شکی نیست که تیر شیخ به خودش بازگشت و در باطن آزرده شد، اما من متوجه نشدم، زیرا در ابتدای کار خود بودم. از نزد او به منزل خود بازگشتم. در راه، شخصی را دیدم که او را نمی‌شناختم. او با سلامی از سر محبت و شفقت به من سلام کرد و گفت: «ای محمد، شیخ ابوالعباس در مورد فلانی که برایت ذکر کرد، راست گفته است.» و نام همان شخصی را برد که ابوالعباس العریبی ذکر کرده بود. من گفتم: «بله» و دانستم که او چه می‌خواهد. همان لحظه به نزد شیخ بازگشتم تا او را از آنچه رخ داده بود آگاه سازم. هنگامی که بر او وارد شدم، گفت: «ای اباعبدالله، اگر مسئله‌ای را برایت ذکر کنم و خاطر تو از پذیرش آن باز ایستد، نیاز است که خضر به تو روی آورد و بگوید: فلانی در آنچه برایت ذکر کرده، راست گفته است. چگونه ممکن است این اتفاق در هر مسئله‌ای که از من می‌شنوی و در آن توقف می‌کنی، برایت رخ دهد؟» گفتم: «همانا باب توبه باز است.» او گفت: «و پذیرش توبه واقع شده است.» پس دانستم که آن مرد، خضر بوده است. شکی نیست که از شیخ پرسیدم آیا او خضر بود؟ گفت: «بله، او خضر است.»\n\nسپس بار دیگر برایم اتفاق افتاد که در بندر تونس، در حفره‌ای، در کشتی‌ای در دریا بودم. درد شکم مرا گرفت و اهل کشتی خوابیده بودند. برخاستم و به کنار کشتی رفتم و به دریا نگریستم. شخصی را از دور در نور ماه دیدم، آن شب شب بدر (ماه کامل) بود. او بر روی آب می‌آمد تا به من رسید. کنار من ایستاد و یک پایش را بلند کرد و بر دیگری تکیه داد. من کف پایش را دیدم که هیچ تری به آن نرسیده بود. سپس بر آن تکیه داد و پای دیگر را بلند کرد که آن نیز چنین بود. سپس با من سخنانی گفت که نزد او بود، سپس سلام کرد و رفت و به سمت فانوس دریایی که نگهبان ساحل بود و بر روی تپه‌ای قرار داشت، حرکت کرد. بین ما و آنجا مسافتی بیش از دو میل بود، اما او آن مسافت را در دو یا سه گام طی کرد. صدای او را شنیدم که بر بالای فانوس دریایی، خداوند متعال را تسبیح می‌گفت.\n\nشاید او به نزد شیخ ما جراح بن خمیس الکتانی رفته بود که از سادات قوم و مرابط (عابد مقیم) در بندر عیدون بود و من شب قبل از آن از نزد او آمده بودم. هنگامی که به شهر آمدم، مرد صالحی را دیدم که به من گفت: «شب گذشته‌ات در کشتی با خضر چگونه بود؟ او به تو چه گفت و تو به او چه گفتی؟»\n\nپس از آن تاریخ، برای سیاحت به ساحل اقیانوس اطلس رفتم. مردی با من بود که خرق عادات (شکستن قوانین طبیعت) توسط صالحان را انکار می‌کرد. من و همراهم وارد مسجدی مخروبه و دورافتاده شدیم تا نماز ظهر را در آن بخوانیم. ناگهان جماعتی از سیاحان دورافتاده وارد شدند که قصد ما را در نماز خواندن در آن مسجد داشتند. در میان آنان همان مردی بود که در دریا با من سخن گفته بود و به من گفته شده بود که او خضر است. و در میان آنان مردی بزرگ‌تر از او در مقام بود. من پیش از آن با آن مرد ملاقات و مودت داشتم. برخاستم و به او سلام کردم. او نیز سلام کرد و از دیدن من شاد شد و جلو ایستاد و با ما نماز خواند. هنگامی که از نماز فارغ شدیم، امام خارج شد و من پشت سر او خارج شدم. او به سمت در مسجد می‌رفت. درِ مسجد در سمت غربی بود و مشرف به اقیانوس اطلس در محلی به نام «بکّه» بود. من ایستادم و با او بر در مسجد سخن می‌گفتم. ناگهان آن مردی که گفتم خضر است، حصیری کوچک را که در محراب مسجد بود، برداشت و آن را در هوا به ارتفاع هفت ذراع از زمین پهن کرد و بر روی حصیر در هوا ایستاد و حرکت می‌کرد. به همراهم گفتم: «آیا به این و کاری که انجام داد نمی‌نگری؟» او به من گفت: «نزد او برو و از او بپرس.» من همراهم را ایستاده رها کردم و نزد او رفتم. هنگامی که از نماز خود فارغ شد، به او سلام کردم و این ابیات را که از خودم بود، برایش خواندم:\n\n> دلدادگان از هوا (هوس) به رازی مشغولند\n>\n> در عشق کسی که هوا (فضا) را آفرید و مسخر ساخت\n>\n> عقول عارفان از هر کونی که آن را بپسندند، معقول و پاک است\n>\n> پس آنان نزد او گرامی داشته شده‌اند و در میان مردم\n>\n> احوالشان مجهول و پوشیده است\n\nاو به من گفت: «ای فلان، من کاری را که دیدی انجام ندادم مگر به خاطر این منکر.» و به همراهم اشاره کرد که خرق عادات را انکار می‌کرد و در صحن مسجد نشسته بود و به او می‌نگریست تا بداند که خداوند با هر کس که بخواهد، هر چه بخواهد انجام می‌دهد. روی خود را به سوی منکر برگرداندم و گفتم: «چه می‌گویی؟» گفت: «پس از دیدن با چشم، دیگر سخنی برای گفتن نیست.» سپس به نزد همراهم بازگشتم که بر در مسجد منتظر من بود. ساعتی با او سخن گفتم و از او پرسیدم: «این مردی که در هوا نماز خواند کیست؟» و آنچه را که پیش از این با او برایم اتفاق افتاده بود، ذکر نکردم. او گفت: «این خضر است.» من سکوت کردم. جماعت رفتند و ما نیز رفتیم و قصد «روطه» را کردیم، محلی که صالحان دورافتاده قصد آنجا را می‌کنند و در نزدیکی «بشکنصار» در ساحل اقیانوس اطلس است. این بود آنچه برای ما با این وتد (Watad) رخ داد. خداوند ما را به دیدن او بهره‌مند سازد. او از علم لَدُنّی (al-‘Ilm al-Ladunnī) و رحمت نسبت به عالَم، آنچه را که شایسته رتبه اوست، داراست و خداوند او را ستوده است.\n\n### [خرقه خضر]\n\nمردی از شیوخ ما به نام علی بن عبدالله بن جامع، از اصحاب علی المتوکل و ابوعبدالله قضیب البان، با او ملاقات کرد. او در «المقلی» در خارج موصل در باغ خود سکونت داشت. خضر در حضور قضیب البان، خرقه (Khirqa) را به او پوشانده بود. شیخ نیز در همان محلی از باغش که خضر خرقه را به او پوشانده بود، و به همان صورتی که برای او رخ داده بود، خرقه را به من پوشاند. من پیش از این نیز خرقه خضر را از طریق دورتری، از دست دوستمان تقی‌الدین عبدالرحمن بن علی بن میمون بن اب التوزری پوشیده بودم. او نیز آن را از دست صدرالدین، شیخ الشیوخ در دیار مصر، که ابن حمویه بود، پوشیده بود و جد او آن را از دست خضر پوشیده بود.\n\nاز آن زمان به بعد، به پوشیدن خرقه روی آوردم و آن را به مردم پوشاندم، زیرا دیدم که خضر آن را معتبر شمرده است. پیش از آن، خرقه معروف کنونی را قبول نداشتم، زیرا خرقه نزد ما تنها عبارت است از صحبت (Ṣuḥba)، ادب و تخلق (Takhalluq). به همین دلیل، پوشیدن آن به صورت متصل به رسول خدا (صلی الله علیه و سلم) یافت نمی‌شود، بلکه صحبت و ادب یافت می‌شود که همان تعبیر «لباس تقوا» است.\n\nعادت اصحاب احوال (Aṣḥāb al-Aḥwāl) بر این جاری شده است که هرگاه در یکی از یاران خود نقصی در امری ببینند و بخواهند حال او را کامل کنند، آن شیخ با او متحد می‌شود. هنگامی که با او متحد شد، آن جامه‌ای را که در حال آن بر تن دارد، برمی‌دارد و بر مردی که می‌خواهد حالش کامل شود، می‌پوشاند. پس آن حال در او جاری می‌شود و برایش کامل می‌گردد. این همان لباسی است که نزد ما معروف است و از محققین شیوخ ما نقل شده است.\n\n### [مراتب رجال الله در فهم مراتب قرآن]\n\nسپس بدان که رجال الله (مردان خدا) بر چهار مرتبه‌اند: مردانی که ظاهر را دارند، مردانی که باطن را دارند، مردانی که حد (Ḥadd) را دارند، و مردانی که مطلع (Maṭla‘) را دارند.\n\nهنگامی که خداوند سبحان باب نبوت و رسالت را بر خلق بست، باب فهم از جانب خدا را در آنچه به پیامبرش (صلی الله علیه و سلم) در کتاب عزیزش وحی کرده بود، برای آنان باقی گذاشت. علی بن ابی طالب (رضی الله عنه) می‌فرمود: «همانا وحی پس از رسول خدا (صلی الله علیه و سلم) قطع شده است و در دست ما باقی نمانده است مگر اینکه خداوند به بنده‌ای در این قرآن فهمی روزی کند.»\n\nاصحاب ما، اهل کشف (Ahl al-Kashf)، بر صحت خبری از پیامبر (صلی الله علیه و سلم) اجماع دارند که در مورد آیات قرآن فرمود: «ما من آية إلا ولها ظاهر وباطن وحد ومطلع» (هیچ آیه‌ای نیست مگر آنکه ظاهری و باطنی و حدی و مطلعی دارد).\n\nو برای هر یک از این مراتب، مردانی هستند و برای هر یک از این طوایف، قطبی است که فلک آن کشف (Kashf) بر مدار آن قطب می‌چرخد.\n\nدر سال ۵۹۵ هجری قمری بر شیخمان ابومحمد عبدالله الشکاز، از اهل باغه در غرناطه، وارد شدم. او از بزرگترین کسانی بود که در این طریق ملاقات کردم و در اجتهاد، نظیر او را ندیدم. او به من گفت: «مردان چهار دسته‌اند:\n\n۱.  **رِجالٌ صَدَقُوا ما عاهَدُوا الله عَلَيْهِ** (مردانی که به آنچه با خدا پیمان بستند، صادق بودند) و آنان رجال الظاهر (مردان ظاهر) هستند.\n۲.  **رِجالٌ لا تُلْهِيهِمْ تِجارَةٌ ولا بَيْعٌ عَنْ ذِكْرِ الله** (مردانی که تجارت و خرید و فروش آنان را از یاد خدا باز نمی‌دارد) و آنان رجال الباطن (مردان باطن) هستند که همنشینان حق تعالی هستند و مشورت با آنان است.\n3.  **رجال الأعراف** (مردان اعراف) و آنان رجال الحد (مردان حد) هستند. خداوند متعال فرمود: **وعَلَى الْأَعْرافِ رِجالٌ** (و بر اعراف مردانی هستند). آنان اهل شمّ (بو کشیدن)، تمییز (تشخیص) و رهایی از اوصاف هستند، پس وصفی ندارند. ابویزید بسطامی از آنان بود.\n4.  **مردانی که هرگاه حق آنان را به سوی خود بخواند، مردانه می‌آیند** (رجالا) به دلیل سرعت اجابت، و سوار نمی‌شوند: **وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجالًا** (و در میان مردم برای حج بانگ بزن تا مردانه نزد تو آیند) و آنان رجال المطلع (مردان مطلع) هستند.\n\n**رجال الظاهر** کسانی هستند که در عالم مُلک (جهان محسوس) و شهادت تصرف دارند. آنان کسانی هستند که شیخ محمد بن قائد الأوانی به آنان اشاره می‌کرد. این همان مقامی است که شیخ عاقل ابوالسعود بن الشبل البغدادی از روی ادب با خدا آن را ترک کرد. ابوالبدر التماشکی البغدادی (رحمه الله) به من خبر داد و گفت: هنگامی که محمد بن قائد الأوانی که از افراد (Afrād) بود، با ابوالسعود ملاقات کرد، به او گفت: «ای ابوالسعود، خداوند مُلک را بین من و تو تقسیم کرده است، چرا تو در آن تصرف نمی‌کنی، همان‌گونه که من تصرف می‌کنم؟» ابوالسعود به او گفت: «ای ابن قائد، سهم خود را به تو بخشیدم. ما حق را رها کردیم تا او برای ما تصرف کند.» و این همان قول خداوند متعال است: **فَاتَّخِذْهُ وَكِيلًا** (پس او را وکیل خود بگیر). پس امر خدا را امتثال کرد. ابوالبدر به من گفت: ابوالسعود به من گفت: «تصرف در عالَم از پانزده سال پیش به من داده شده است، اما من آن را ترک کردم و چیزی از آن بر من ظاهر نشد.»\n\nاما **رجال الباطن** کسانی هستند که در عالم غیب و ملکوت تصرف دارند. آنان ارواح علوی را با همت‌های خود در آنچه می‌خواهند، فرود می‌آورند. منظورم ارواح کواکب (ارواح ستارگان) است، نه ارواح ملائکه. این به دلیل مانع الهی قوی است که مقام املاک (فرشتگان) اقتضای آن را دارد. خداوند در قول جبرئیل علیه السلام به محمد (صلی الله علیه و سلم) از آن خبر داده است که فرمود: **وَما نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ** (و ما فرود نمی‌آییم مگر به فرمان پروردگارت). و کسی که فرود آمدنش به فرمان پروردگارش باشد، خاصیت در او تأثیر نمی‌کند و با آن فرود نمی‌آید. بله، ارواح کواکب با اسماء و بخورات و امثال آن فرود آورده می‌شوند، زیرا این فرود آمدن معنوی است و برای کسی است که در آن صور خیالی را مشاهده می‌کند. زیرا ذات کواکب از جایگاه خود در آسمان جدا نمی‌شود، اما خداوند برای محل‌های تابش شعاع‌های آن‌ها در عالم کون و فساد، تأثیراتی قرار داده است که نزد عارفان به آن، تأثیراتی معتاد است؛ مانند سیراب شدن هنگام نوشیدن آب، و سیر شدن هنگام خوردن غذا، و روییدن دانه هنگام فرارسیدن فصل با نزول باران و صاف شدن هوا. این حکمتی است که خدای دانا و حکیم (جل و عز) در آن به ودیعه نهاده است. برای این مردان در باطن کتب نازل شده و صحیفه‌های مطهر و تمام سخنان عالَم و نظم حروف و اسماء، از جهت معانی آن‌ها، آنچه برای دیگران نیست، به صورت اختصاصی الهی گشوده می‌شود.\n\nاما **رجال الحد** کسانی هستند که در عالم ارواح ناری، عالم برزخ (Barzakh) و جبروت (Jabarūt) تصرف دارند. زیرا این عالم تحت جبر است. آیا نمی‌بینی که تحت سلطه ذوات الأذناب (صاحبان دنباله‌ها) مقهور است؟ و آنان طایفه‌ای از شهاب‌های ثاقب هستند. پس چیزی جز جنس خودشان آنان را مقهور نکرده است. نزد این مردان است که ارواح آن‌ها فرود آورده و احضار می‌شوند. آنان رجال الأعراف (مردان اعراف) هستند. اعراف دیواری حائل بین بهشت و جهنم است، برزخی که باطن آن رحمت و ظاهرش از سوی عذاب است. پس آن حدّی است بین سرای سعادتمندان و سرای شقاوتمندان، سرای اهل رؤیت و سرای حجاب. این مردان سعادتمندترین مردم به معرفت این دیوار هستند و شهود خطوط موهوم بین هر دو نقیض را دارند، مانند قول خداوند: **بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ** (بین آن دو برزخی است که تجاوز نمی‌کنند). پس آنان از حدود تجاوز نمی‌کنند. آنان رجال رحمتی هستند که **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (همه چیز را فرا گرفته است). پس برای آنان در هر حضرتی دخول و اشراف است. آنان عارفان به صفاتی هستند که به واسطه آن‌ها تمایز هر موجودی از دیگر موجودات عقلی و حسی رخ می‌دهد.\n\nاما **رجال المطلع** کسانی هستند که در اسماء الهی تصرف دارند و به واسطه آن‌ها آنچه را که خداوند بخواهد، فرود می‌آورند. این برای غیر آنان نیست. و به واسطه آن‌ها هر آنچه را که تحت تصرف رجال سه‌گانه (رجال الحد، الباطن و الظاهر) است، فرود می‌آورند. آنان بزرگترین مردان هستند و آنان ملامیه (Malāmiyya) هستند. این در قوت آنان است، اما چیزی از آن بر آنان ظاهر نمی‌شود. ابوالسعود و دیگران از آنان هستند. پس آنان و عوام در ظهور عجز و ظاهر عادات یکسان هستند. ابوالسعود در میان این مردان تمایزی داشت، بلکه از بزرگترین آنان بود. ابوالبدر، همان‌گونه که برای ما مشافهه نقل کرد، از او شنید که می‌گفت: «همانا از رجال الله کسانی هستند که بر خاطر (Khāṭir) سخن می‌گویند، در حالی که با صاحب خاطر نیستند، یعنی علمی به صاحب آن ندارند و قصد معرفی او را ندارند.» هنگامی که عمر البزاز و ابوالبدر و دیگران حال این شیخ را برای ما وصف کردند، دیدیم که او با احوال این صنف عالی از رجال الله جاری است. ابوالبدر به من گفت: او بسیار این بیت را می‌خواند و ما غیر از آن از او نشنیدیم:\n\n> و پای خود را در گودال مرگ استوار ساخت\n>\n> و به آن گفت: حشر (برخاستن) پیش از کف پای توست\n\nو می‌گفت: «چیزی جز نمازهای پنج‌گانه و انتظار مرگ نیست.» و زیر این سخن، علم بزرگی نهفته است. و می‌گفت: «مرد با خداوند متعال مانند کسی است که به دنبال پرنده می‌دود؛ دلی مشغول و پایی که می‌شتابد.» و این همه، بزرگترین حالات مردان با خداست، زیرا بزرگِ مردان کسی است که با هر موطنی به آنچه شایسته آن است، رفتار کند. و موطن این دنیا را محقق نمی‌تواند معامله کند مگر به آنچه این شیخ ذکر کرده است. پس اگر در این دنیا از مردی خلاف این معامله ظاهر شود، دانسته می‌شود که در آن نفسی وجود دارد و چاره‌ای نیست، مگر اینکه به آنچه از او ظاهر شده، مأمور باشد، و آنان رسولان و انبیا (علیهم السلام) هستند. و ممکن است برخی از ورثه آنان در زمانی به آن امر شوند، و این مکر خفی (Makar Khafī) است، زیرا آن جدایی از مقام عبودیت است که انسان برای آن خلق شده است.\n\n### [راز منازل یا تجلیات حق در صور]\n\nاما راز منزل (Manzil) و منازل (Manāzil)، ظهور حق (al-Ḥaqq) به واسطه تجلی (Tajallī) در صور هر آنچه غیر اوست، می‌باشد. اگر تجلی او برای هر چیزی نبود، شیئیت (چیزی بودن) آن چیز ظاهر نمی‌شد. خداوند متعال می‌فرماید: **إِنَّما قَوْلُنا لِشَيْءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ** (همانا سخن ما برای چیزی که اراده‌اش کنیم این است که به آن بگوییم: باش). پس قول او **إِذا أَرَدْناهُ** (هنگامی که اراده‌اش کنیم)، همان توجه الهی برای ایجاد آن چیز است. سپس فرمود: **أَنْ نَقُولَ لَهُ كُنْ** (اینکه به آن بگوییم: باش). پس نفس شنیدن خطاب حق توسط آن چیز، همان تکوّن (ایجاد) آن چیز است.\n\nاین به منزله سریان واحد (الواحد) در منازل عدد است. پس اعداد تا بی‌نهایت به واسطه وجود واحد در این منازل ظاهر می‌شوند. اگر وجود عین (ذات) واحد در آن‌ها نبود، اعیان اعداد ظاهر نمی‌شدند و نامی نداشتند. و اگر واحد با نام خود در این منزل ظاهر می‌شد، برای آن عدد عینی ظاهر نمی‌شد. پس عین و نام آن هرگز با هم جمع نمی‌شوند. گفته می‌شود: دو، سه، چهار، پنج، تا بی‌نهایت. و هرگاه یک واحد را از عدد معینی ساقط کنی، نام آن عدد و حقیقت آن زائل می‌شود.\n\nپس واحد به ذات خود، وجود اعیان اعداد را حفظ می‌کند و به نام خود، آن‌ها را معدوم می‌سازد. همچنین، اگر بگویی «قدیم»، مُحدَث (مخلوق) فانی می‌شود؛ و اگر بگویی «الله»، عالَم فانی می‌شود. و اگر عالَم را از حفظ الهی خالی کنی، عالَم وجودی نخواهد داشت و فانی می‌شود. و اگر حفظ الهی در عالَم سریان یابد، عالَم موجود باقی می‌ماند. پس به واسطه ظهور و تجلی (Tajallī) اوست که عالَم باقی است.\n\nاصحاب ما بر این روش هستند و این روش نبوت است. متکلمان اشاعره نیز بر این روش هستند و آنان کسانی هستند که قائل به انعدام (نیست شدن) اعراض به خودی خود هستند. و به این واسطه است که افتقار عالَم به خداوند در بقای خود در هر نَفَس، صحیح می‌شود و خداوند پیوسته خالق است. دیگر اهل نظر، این مقام برایشان صحیح نیست. جماعتی از اهل نظر از علمای رسوم به من خبر دادند که طایفه‌ای از حکما بر این امر دست یافته‌اند. و من آن را مذهب ابن السید البطلیوسی در کتابی که در این فن تألیف کرده، دیده‌ام. **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 4
}