{
  "id": 408,
  "title": {
    "ar": "الباب الثامن وأربعمائة في معرفة منازلة يوم السبت حل عنك مئزر الجد الذي شددته فقد فرغ العالم مني وفرغت منه",
    "en": "Chapter Four Hundred and Eight: Concerning the Knowledge of the Spiritual Station (منازلة) of the Day of Saturday. Untie from yourself the apron of earnestness (الجد) that you have tightened, for the World (العالم) has finished with me, and I have finished with it.",
    "ur": "باب چار سو آٹھ: ہفتہ کے دن کی منزل (منازلۃ) کی معرفت کے بیان میں۔ اپنے آپ سے وہ محنت (الجد) کا تہبند کھول دو جسے تم نے کس کر باندھا ہے، کیونکہ عالم مجھ سے فارغ ہو چکا ہے اور میں اس سے فارغ ہو چکا ہوں۔",
    "fa": "باب چهارصد و هشتم در معرفت (المعرفة) منزل (منازلة) روز شنبه: ازار (مئزر) کوشش (الجد) را که محکم بسته‌ای، از خود باز کن؛ زیرا عالم از من فارغ گشته و من نیز از آن فارغ شده‌ام."
  },
  "content": {
    "ar": "## «الباب الثامن وأربعمائة في معرفة منازلة يوم السبت حل عنك مئزر الجد الذي شددته فقد فرغ العالم مني وفرغت منه»\n\n\n> فرغنا من الأجناس فالخلق خلقنا *** وقد بقيت أشخاصها تتكون‏\n\n\n> مدى الجود والأنفاس فالأمر دائم *** إلى غير غايات له تتعين‏\n\n\n> هو الغاية القصوى فليست نهاية *** سواه فهذا حقه المتيقن‏\n\n\n> أنا البدء لا عود تراه لأنه *** هو الواسع المختار بي فتبينوا\n\n\n> أنا أول بالقصد فالكون كوننا *** وآخر موجود أنا يتيقن‏\n\n\n> كلوا طيبات الرزق من كل جانب *** فمن أجلنا بانوا ولله كونوا\n\n\n### [خلق العالم في ستة أيام‏]\n\n\nقال الله تعالى إِذْ يَعْدُونَ في السَّبْتِ فنقول من باب الإشارة لا من باب التفسير يتجاوزون بالراحة حدها وبها سمي السبت سبتا فإن الله خلق العالم في ستة أيام بدأ به يوم الأحد وفرغ منه يوم الجمعة وما مسه من لغوب ولم يعي بخلقه الخلق فلما كان يوم السابع من الأسبوع وفرغ من العالم كان يشبه المستريح الذي مسه اللغوب فاستلقى ووضع إحدى رجليه على الأخرى وقال أنا الملك كذا ورد في الأخبار النبوية فسمي يوم السبت يريد يوم الراحة وهو يوم الأبد ففيه تتكون أشخاص كل نوع دنيا وآخرة فما هي إلا سبعة أيام لكل يوم وال ولاة الله فانتهى الأمر إلى يوم السبت فولى الله أمره واليا له الإمساك والثبوت فله إمساك الصور في الهباء فنهار هذا اليوم الذي هو يوم الأبد لأهل الجنان وليله لأهل النار فلا مساء لنهاره ولا صبح لليله وما رأينا أحدا اعتبر هذا اليوم إلا السبتي محمد بن هارون الرشيد أمير\nالمؤمنين وذلك أني كنت يوم الجمعة بعد صلاة الجمعة بمكة قد دخلت الطواف فرأيت رجلا حسن الهيئة له هيبة ووقار وهو يطوف بالبيت أمامي فصرفت نظري إليه عسى أعرفه فما عرفته في المجاورين ولم أر عليه علامة قادم من سفر لما كان عليه من الغضاضة والنضارة فرأيته يمر بين الرجلين المتلاصقين في الطواف ويعبر بينهما ولا يفصل بينهما ولا يشعران به فجعلت أتتبع بأقدامي مواضع وطئت أقدامه ما يرفع قدما إلا وضعت قدمي في موضع قدمه وذهني إليه وبصري معه لئلا يفوتني فكنت أمر بالرجلين المتلاصقين اللذين يمر هو بينهما فأجوزهما في أثره كما يجوزهما ولا أفصل بينهما فتعجبت من ذلك فلما أكمل أسبوعه وأراد الخروج مسكته وسلمت عليه فرد علي السلام وتبسم لي وأنا لا أصرف نظري عنه مخافة أن يفوتني فإني ما شككت فيه أنه روح تجسد وعلمت أن البصر يقيده فقلت له إني أعلم أنك روح متجسد فقال لي صدقت فقلت له فمن أنت يرحمك الله فقال أنا السبتي بن هارون الرشيد فقلت له أريد أن أسألك عن حال كنت عليه في أيام حياتك في الدنيا قال قل قلت بلغني أنك ما سميت السبتي إلا لكونك كنت تحترف كل سبت بقدر ما تأكله في بقية الأسبوع فقال الذي بلغك صحيح كذلك كان الأمر فقلت له فلم خصصت يوم السبت دون غيره من الأيام أيام الأسبوع فقال نعم ما سألت ثم قال لي بلغني أن الله ابتدأ خلق العالم يوم الأحد وفرغ منه يوم الجمعة فلما كان يوم السبت استلقى ووضع إحدى رجليه على الأخرى وقال أنا الملك هذا بلغني في الأخبار وأنا في الحياة الدنيا فقلت والله لأعملن على هذا فتفرغت لعبادة الله من يوم الأحد إلى آخر الستة الأيام لا أشتغل بشي‏ء إلا بعبادته تعالى وأقول إنه تعالى كما اعتنى بنا في هذه الأيام الستة فإني أتفرغ إلى عبادته فيها ولا أمزجها بشغل نفسي فإذا كان يوم السبت أتفرغ لنفسي وأتحصل لها ما يقوتها في باقي الأسبوع كما روينا من إلقاء إحدى رجليه على الأخرى وقوله أنا الملك الحديث وفتح الله لي في ذلك فقلت له من كان قطب الزمان في وقتك فقال أنا ولا فخر قلت له كذلك وقع لي التعريف قال صدقك من عرفك ثم قال لي عن أمرك يريد المفارقة قلت له ذلك إليك فسلم على سلام محب وانصرف وكان بعض أصحابي والجماعة في انتظاري لكونهم كانوا يشتغلون علي بإحياء علوم الدين للغزالي رحمه الله فأما فرغت من ركعتي الطواف وجئت إليهم قال لي بعضهم وهو نبيل بن خزر بن خزرون السبتي رأيناك تكلم رجلا غريبا حسن الوجه وسيما لا نعرفه في المجاورين من كان ومتى جاء فسكت ولم أخبرهم بشي‏ء من شأنه إلا بعض إخواني فإني أخبرتهم بقصته فتعجبوا لذلك‏\n\n\n### [أن الفراغ الإلهي إنما كان من الأجناس في الستة الأيام‏]\n\n\nواعلم أيدنا الله وإياك أن الفراغ الإلهي إنما كان من الأجناس في الستة الأيام وأما أشخاص الأنواع فلا فبقي الفراغ بالأزمان لا عن الأشخاص وهو قوله تعالى سَنَفْرُغُ لَكُمْ من الشئون الذي قال فيها كُلَّ يَوْمٍ هُوَ في شَأْنٍ في هذه الدنيا فيفرغ لنا منا وتنتقل الشئون إلى البرزخ والدار الآخرة فلا يزال الأمر من فراغ إلى فراغ إلى أن يصل أوان عموم الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فلا يقع بعد ذلك فراغ يحده حال ولا يميزه بل وجود مستمر ووجود ثابت مستقر إلى غير نهاية في الدارين دار الجنة ودار النار هكذا هو الأمر في نفسه ففراغه من العالم هذا القدر الذي ذكرته آنفا وفراغ العالم منه من حيث الدلالة عليه لا غير وأما الوهب من العلم به فلا يزال دائما لكن من غير طلب في الآخرة مقالي لكن التجلي دائم والقبول دائم فالعلم متجدد الظهور لي على الدوام والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Eight: Concerning the Knowledge of the Stations of the Day of Saturday—Untie from yourself the apron of seriousness that you tightened, for the World has finished with me, and I have finished with it.\n\nWe have finished with the genera, so Creation is our creation,\nAnd their individuals remain, continually forming.\n\nThroughout the extent of bounty and breaths, the Command is perpetual,\nTo non-specific ends that are determined for it.\n\nHe is the ultimate Goal, so there is no end\nOther than Him, and this is His certain right.\n\nI am the Beginning; you see no return, because\nHe is the Vast, the Chosen One through me, so understand clearly.\n\nI am the First by intention, so the Cosmos is our cosmos,\nAnd the Last Existing One, I am, it is certain.\n\nEat the good things of provision from every side,\nFor because of us they became manifest, and be for Allah.\n\n### [The Creation of the World in Six Days]\n\nAllah the Exalted said: <<إِذْ يَعْدُونَ في السَّبْتِ>> (when they transgressed in the matter of the Sabbath). We say, from the perspective of symbolic allusion (الإشارة), not from the perspective of exegesis (التفسير), that they exceed the limit of rest. And by this, the Sabbath (السبت) was named Sabbath. For Allah created the World in six days, beginning on Sunday and finishing on Friday. No weariness (لغوب) touched Him, nor was He fatigued by the creation of creatures. When the seventh day of the week arrived, and He had finished with the World, He resembled the rested one whom weariness had touched, so He reclined, placed one leg over the other, and said, \"I am the King.\" This is how it is reported in the Prophetic Narrations (الأخبار النبوية). So the Day of Saturday (يوم السبت) was named, meaning the Day of Rest, which is the Day of Eternity (يوم الأبد). In it, the individuals (أشخاص) of every species, both in this world and the Hereafter, are formed.\n\nThey are but seven days, and for each day, there is a governor (وال) among the Friends of Allah (ولاة الله). The Command concluded with the Day of Saturday, and Allah appointed over its affair a governor who possesses retention (الإمساك) and stability (الثبوت). Thus, he holds the forms (الصور) within the Dust/Hylé (الهباء). The daytime of this day, which is the Day of Eternity (يوم الأبد), belongs to the People of Paradise, and its night belongs to the People of the Fire. So there is no evening for its day, nor morning for its night.\n\nWe have not seen anyone who gave consideration to this day except al-Sabti Muhammad ibn Harun al-Rashid, the Commander of the Faithful. This is because I was in Mecca on a Friday after the Friday prayer, having entered the circumambulation (الطواف). I saw a man of handsome appearance, possessing awe and dignity (هيبة ووقار), circumambulating the House ahead of me. I turned my gaze toward him, hoping to recognize him, but I did not know him among the residents (المجاورين), nor did I see upon him the sign of one arriving from a journey, due to the freshness and radiance he possessed. I saw him pass between two men who were pressed together during the circumambulation; he crossed between them without separating them, and they did not perceive him.\n\nI began to follow with my feet the places where his feet trod; he would not lift a foot but that I placed my foot in the exact spot of his foot, my mind focused on him and my sight fixed upon him lest he escape me. I would pass through the two men pressed together, between whom he passed, and I would cross them in his wake just as he crossed them, without separating them. I was astonished by this.\n\nWhen he completed his seven circuits and intended to leave, I held him and greeted him. He returned my greeting and smiled at me, while I did not avert my gaze from him for fear that he would escape me. For I had no doubt that he was a spirit (روح) embodied, and I knew that sight binds him. I said to him, \"I know that you are an embodied spirit.\" He said to me, \"You have spoken truly.\" I said to him, \"Then who are you, may Allah have mercy on you?\" He replied, \"I am al-Sabti, the son of Harun al-Rashid.\"\n\nI said to him, \"I wish to ask you about a state you maintained during your life in the world.\" He said, \"Ask.\" I said, \"It reached me that you were only named al-Sabti because you used to earn your livelihood every Saturday, enough to sustain you for the rest of the week.\" He said, \"What reached you is correct; that is how the matter was.\"\n\nI said to him, \"Why did you specify the Day of Saturday, excluding the other days of the week?\" He said, \"That is an excellent question.\" Then he said to me, \"It reached me that Allah began the creation of the World on Sunday and finished it on Friday. When the Day of Saturday arrived, He reclined, placed one leg over the other, and said, 'I am the King.' This reached me through the Narrations while I was in the life of this world. I said, 'By Allah, I shall act upon this.' So I devoted myself entirely to the worship of Allah from Sunday until the end of the six days, occupying myself with nothing except His worship, the Exalted. And I said that just as He, the Exalted, attended to us during these six days, I would devote myself entirely to His worship during them and not mix it with any personal occupation. Then, when the Day of Saturday came, I would devote myself to my own needs and acquire what would sustain me for the rest of the week, just as we narrated concerning His placing one leg over the other and His saying, 'I am the King'—the Hadith. And Allah granted me an opening (فتح) in that matter.\"\n\nI asked him, \"Who was the Axis of the Time (قطب الزمان) in your era?\" He replied, \"I was, and I say this without boasting.\" I said to him, \"That is how the recognition (التعريف) occurred to me.\" He said, \"He who recognized you spoke truly.\" Then he said to me, \"Concerning your affair,\" meaning he wished to depart. I said to him, \"That is up to you.\" He greeted me with the greeting of a lover and departed.\n\nSome of my companions and the group were waiting for me, as they were studying *Ihya' Ulum al-Din* [The Revival of the Religious Sciences] by al-Ghazali, may Allah have mercy on him, under my instruction. When I finished the two cycles of the circumambulation and came to them, one of them, who was Nabil ibn Khazr ibn Khazrun al-Sabti, said to me, \"We saw you speaking to a stranger, handsome of face and distinguished, whom we do not know among the residents. Who was he, and when did he arrive?\" I remained silent and did not inform them of anything concerning his affair, except for some of my brethren, to whom I related his story, and they were astonished by it.\n\n### [That the Divine Completion was only concerning the Genera during the Six Days]\n\nKnow—may Allah support us and you—that the Divine Completion (الفراغ الإلهي) was only concerning the genera (الأجناس) during the six days, but not concerning the individuals (أشخاص) of the species. Thus, the completion remains tied to the times, not concerning the individuals. This is His saying, the Exalted: <<سَنَفْرُغُ لَكُمْ>> (We shall attend to you) concerning the affairs (الشئون) about which He said: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in a state of affair) in this world. So He attends to us from us, and the affairs transfer to the Isthmus (البرزخ) and the Abode of the Hereafter.\n\nThe Command continues from completion to completion until the time arrives for the universality of Mercy, which <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompasses all things). After that, there will be no completion defined or distinguished by a state, but rather a continuous Existence (وجود مستمر) and a stable, settled Existence (وجود ثابت مستقر) without end in the two abodes: the Abode of Paradise and the Abode of the Fire. This is how the matter is in itself.\n\nSo His completion concerning the World is this measure which I mentioned just now, and the World's completion concerning Him is only in terms of the indication (الدلالة) toward Him, nothing else. As for the gift of Knowledge (العلم) concerning Him, it remains perpetual, though without my verbal request in the Hereafter. However, the Theophany (التجلي) is perpetual, and the acceptance is perpetual, so Knowledge is constantly renewed in its manifestation to me. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو آٹھ: یوم السبت (ہفتہ) کی منزلوں کی معرفت میں۔ اپنے اوپر سے وہ سنجیدگی کا تہبند کھول دو جسے تم نے کس رکھا ہے، کیونکہ عالم مجھ سے فارغ ہو چکا ہے اور میں عالم سے فارغ ہو چکا ہوں۔\n\n> ہم اجناس (جنسوں) سے فارغ ہو چکے ہیں، پس مخلوق ہماری ہی تخلیق ہے،\n> اور ان کی اشخاص (انفرادی صورتیں) ابھی تک تشکیل پا رہی ہیں۔\n\n> سخاوت اور سانسوں کی حد تک، پس امر (حکم) ہمیشہ قائم ہے،\n> ایسی غایتوں (مقاصد) کی طرف جن کا تعین نہیں کیا جا سکتا۔\n\n> وہ (الحق) ہی غایتِ قصویٰ (آخری مقصد) ہے، اس کے سوا کوئی انتہا نہیں،\n> پس یہ اس کا یقینی حق ہے۔\n\n> میں ہی آغاز ہوں، تم کوئی واپسی نہیں دیکھو گے، کیونکہ\n> وہ (الحق) ہی الواسع (وسعت والا) ہے جو میرے ذریعے اختیار کرتا ہے، پس تم غور کرو۔\n\n> میں ہی قصد کے اعتبار سے اول ہوں، پس کائنات ہماری کائنات ہے،\n> اور میں ہی آخری موجود ہوں، یہ یقینی ہے۔\n\n> ہر طرف سے رزق کی پاکیزہ چیزیں کھاؤ،\n> کیونکہ وہ ہماری خاطر ظاہر ہوئے، اور اللہ کے لیے ہو جاؤ۔\n\n### [عالم کی تخلیق چھ دنوں میں]\n\nاللہ تعالیٰ نے فرمایا: **إِذْ يَعْدُونَ في السَّبْتِ** (جب وہ ہفتے کے دن حد سے تجاوز کرنے لگے)۔ ہم اشارے کے باب سے کہتے ہیں، نہ کہ تفسیر کے باب سے، کہ وہ راحت میں اپنی حد سے تجاوز کرتے ہیں۔ اسی وجہ سے السبت (ہفتہ) کو سبت کہا گیا، کیونکہ اللہ نے عالم کو چھ دنوں میں تخلیق کیا، اس کی ابتدا اتوار کے دن کی اور جمعہ کے دن اس سے فارغ ہو گیا، اور اسے کوئی لغوب (تھکاوٹ) لاحق نہیں ہوئی اور نہ ہی وہ مخلوق کی تخلیق سے عاجز ہوا۔ جب ہفتے کا ساتواں دن آیا اور وہ عالم سے فارغ ہو چکا تھا، تو وہ اس آرام کرنے والے کی مانند تھا جسے لغوب (تھکاوٹ) لاحق ہوئی ہو، پس وہ لیٹ گیا اور ایک ٹانگ دوسری پر رکھ لی اور کہا: \"میں بادشاہ ہوں\"۔ یہ بات اخبارِ نبویہ میں وارد ہوئی ہے۔ پس اس دن کا نام السبت (ہفتہ) رکھا گیا، یعنی آرام کا دن، اور یہ یوم الأبد (ابد کا دن) ہے۔ اسی دن ہر نوع کی اشخاص (انفرادی صورتیں) دنیا اور آخرت میں تشکیل پاتی ہیں۔ یہ صرف سات دن ہیں، اور ہر دن کے لیے اللہ کے والی (حکمران) ہیں۔ جب معاملہ یوم السبت (ہفتہ) تک پہنچا، تو اللہ نے اس کا امر ایک ایسے والی کے سپرد کیا جس کے لیے امساک (روکنا) اور ثبوت (ثابت رکھنا) ہے۔ پس اس کے لیے ضروری ہے کہ وہ صور (صورتوں) کو الہباء (غبارِ ازلی) میں روکے رکھے۔ یہ دن، جو کہ یوم الأبد (ابد کا دن) ہے، اس کا دن کا حصہ اہل جنت کے لیے ہے اور اس کی رات اہل نار کے لیے ہے۔ اس کے دن کی کوئی شام نہیں اور اس کی رات کی کوئی صبح نہیں۔ ہم نے کسی کو نہیں دیکھا جس نے اس دن کا اعتبار کیا ہو سوائے السبتي محمد بن ہارون الرشید امیر المؤمنین کے۔\n\nاور یہ اس طرح ہوا کہ میں جمعہ کے دن نماز جمعہ کے بعد مکہ میں طواف کے لیے داخل ہوا، تو میں نے ایک خوبصورت ہیئت والا شخص دیکھا جس میں رعب اور وقار تھا، وہ میرے آگے بیت اللہ کا طواف کر رہا تھا۔ میں نے اس کی طرف نظر کی کہ شاید میں اسے پہچان لوں، لیکن میں نے اسے مجاورین میں نہیں پہچانا، اور نہ ہی اس پر سفر سے آنے والے کی کوئی علامت دیکھی، کیونکہ وہ تروتازہ اور شاداب تھا۔ میں نے اسے دیکھا کہ وہ طواف میں دو ملے ہوئے آدمیوں کے درمیان سے گزر جاتا ہے اور ان کے بیچ سے نکل جاتا ہے، نہ انہیں جدا کرتا ہے اور نہ ہی انہیں اس کا احساس ہوتا ہے۔ میں نے اپنے قدموں سے اس کے قدموں کے نشانات کی پیروی شروع کر دی، وہ قدم نہیں اٹھاتا تھا مگر میں اپنا قدم اس کے قدم کی جگہ رکھ دیتا تھا، میرا ذہن اس کی طرف تھا اور میری نظر اس کے ساتھ تھی تاکہ وہ مجھ سے چھوٹ نہ جائے۔ پس میں بھی ان دو ملے ہوئے آدمیوں کے درمیان سے گزر جاتا جن کے بیچ سے وہ گزرا تھا، اور میں اس کے پیچھے ان کے درمیان سے اسی طرح نکل جاتا جیسے وہ نکلا تھا اور انہیں جدا نہیں کرتا تھا۔ مجھے اس پر تعجب ہوا۔ جب اس نے اپنا ایک ہفتہ (طواف کا چکر) مکمل کیا اور باہر نکلنا چاہا تو میں نے اسے پکڑ لیا اور سلام کیا، اس نے مجھے سلام کا جواب دیا اور میرے لیے مسکرایا۔ میں نے اپنی نظر اس سے نہیں ہٹائی اس خوف سے کہ وہ مجھ سے چھوٹ نہ جائے، کیونکہ مجھے اس میں کوئی شک نہیں تھا کہ وہ ایک روح ہے جو متجسد (جسمانی صورت اختیار) ہوئی ہے۔ میں جانتا تھا کہ بصر (نظر) اسے مقید کر لیتی ہے۔ میں نے اس سے کہا: \"میں جانتا ہوں کہ آپ ایک متجسد روح ہیں\"۔ اس نے کہا: \"تم نے سچ کہا\"۔ میں نے کہا: \"اللہ آپ پر رحم کرے، آپ کون ہیں؟\" اس نے کہا: \"میں السبتي بن ہارون الرشید ہوں\"۔ میں نے کہا: \"میں آپ سے اس حال کے بارے میں پوچھنا چاہتا ہوں جس پر آپ دنیا میں اپنی زندگی کے دنوں میں قائم تھے\"۔ اس نے کہا: \"پوچھو\"۔ میں نے کہا: \"مجھے یہ بات پہنچی ہے کہ آپ کو السبتي (ہفتہ والا) صرف اس لیے کہا جاتا تھا کہ آپ ہر ہفتے کے دن اتنا ہی کماتے تھے جتنا آپ باقی ہفتے میں کھاتے تھے\"۔ اس نے کہا: \"جو بات آپ کو پہنچی ہے وہ صحیح ہے، معاملہ ایسا ہی تھا\"۔ میں نے کہا: \"تو آپ نے ہفتے کے دنوں میں سے صرف ہفتے کے دن کو ہی کیوں خاص کیا؟\" اس نے کہا: \"ہاں، تم نے اچھا سوال کیا\"۔ پھر اس نے مجھ سے کہا: \"مجھے یہ بات پہنچی تھی کہ اللہ نے عالم کی تخلیق اتوار کے دن شروع کی اور جمعہ کے دن اس سے فارغ ہو گیا، اور جب ہفتے کا دن آیا تو وہ لیٹ گیا اور ایک ٹانگ دوسری پر رکھ لی اور کہا: 'میں بادشاہ ہوں'۔ یہ بات مجھے دنیا کی زندگی میں اخبار (احادیث) میں پہنچی تھی۔ تو میں نے کہا: 'اللہ کی قسم! میں اسی پر عمل کروں گا'۔ پس میں اتوار کے دن سے لے کر چھ دنوں کے آخر تک اللہ کی عبادت کے لیے فارغ ہو جاتا تھا، کسی چیز میں مشغول نہیں ہوتا تھا سوائے اس کی عبادت کے، اور میں کہتا تھا کہ جس طرح اللہ تعالیٰ نے ان چھ دنوں میں ہماری دیکھ بھال کی، اسی طرح میں ان میں اس کی عبادت کے لیے فارغ ہو جاؤں گا اور اسے اپنے نفس کے کام میں نہیں ملاؤں گا۔ اور جب ہفتے کا دن آتا تھا تو میں اپنے نفس کے لیے فارغ ہو جاتا تھا اور اس کے لیے وہ چیز حاصل کرتا تھا جو اسے باقی ہفتے میں قوت دے، جیسا کہ ہم نے اس کے ایک ٹانگ دوسری پر رکھنے اور 'میں بادشاہ ہوں' کہنے والی حدیث سے روایت کیا ہے۔ اور اللہ نے میرے لیے اس میں کشادگی (فتح) عطا فرمائی\"۔ میں نے اس سے کہا: \"آپ کے زمانے میں قطب الزمان کون تھا؟\" اس نے کہا: \"میں تھا، اور اس میں کوئی فخر نہیں\"۔ میں نے کہا: \"مجھے بھی اسی طرح کا تعارف حاصل ہوا ہے\"۔ اس نے کہا: \"جس نے آپ کو پہچانا اس نے سچ کہا\"۔ پھر اس نے مجھ سے مفارقت (جدا ہونے) کا ارادہ کرتے ہوئے میرے معاملے کے بارے میں پوچھا۔ میں نے اس سے کہا: \"یہ آپ پر منحصر ہے\"۔ پس اس نے ایک محب کی طرح سلام کیا اور چلا گیا۔ میرے کچھ ساتھی اور جماعت میرا انتظار کر رہے تھے کیونکہ وہ مجھ پر امام غزالی رحمۃ اللہ علیہ کی کتاب *احیاء علوم الدین* کا مطالعہ کر رہے تھے۔ جب میں طواف کی دو رکعتوں سے فارغ ہو کر ان کے پاس آیا، تو ان میں سے ایک نے، جو نبیل بن خزر بن خزرون تھا، مجھ سے کہا: \"ہم نے آپ کو ایک اجنبی، خوبصورت چہرے والے، وجیہ شخص سے بات کرتے دیکھا جسے ہم مجاورین میں نہیں جانتے۔ وہ کون تھا اور کب آیا؟\" میں خاموش رہا اور ان کے معاملے میں کچھ نہیں بتایا، سوائے اپنے بعض بھائیوں کے، جنہیں میں نے اس کا قصہ سنایا تو وہ اس پر حیران ہوئے۔\n\n### [کہ فراغِ الٰہی چھ دنوں میں صرف اجناس (جنسوں) سے ہوا تھا]\n\nاور جان لو، اللہ ہمیں اور تمہیں تائید عطا فرمائے، کہ فراغِ الٰہی (الٰہی فراغت) چھ دنوں میں صرف اجناس (جنسوں) سے ہوا تھا، لیکن انواع کی اشخاص (انفرادی صورتوں) سے نہیں۔ پس فراغت زمانوں کے ساتھ باقی رہی، اشخاص سے نہیں۔ اور یہی اللہ تعالیٰ کا قول ہے: **سَنَفْرُغُ لَكُمْ** (عنقریب ہم تمہاری طرف متوجہ ہوں گے) ان شؤون (معاملات) سے جن کے بارے میں اس نے فرمایا: **كُلَّ يَوْمٍ هُوَ في شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہوتا ہے)۔ اس دنیا میں وہ ہم سے ہمارے لیے فارغ ہوتا ہے، اور شؤون (معاملات) برزخ اور دارِ آخرت کی طرف منتقل ہو جاتے ہیں۔ پس معاملہ ایک فراغت سے دوسری فراغت کی طرف مسلسل جاری رہے گا، یہاں تک کہ اس رحمت کے عموم کا وقت آ جائے جو **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (ہر چیز پر محیط ہے)۔ اس کے بعد کوئی ایسی فراغت واقع نہیں ہو گی جسے کوئی حال محدود کرے یا ممتاز کرے، بلکہ ایک مسلسل الوجود (ہستی) اور ایک ثابت و مستقر الوجود (ہستی) ہو گا جو دونوں جہانوں، دارِ جنت اور دارِ نار، میں لامتناہی طور پر جاری رہے گا۔ معاملہ اپنی اصل میں ایسا ہی ہے۔ پس عالم سے اس کی فراغت اتنی ہی ہے جتنی میں نے ابھی ذکر کی، اور عالم کی اس سے فراغت صرف اس پر دلالت کے لحاظ سے ہے، اور کچھ نہیں۔ لیکن اس کے علم سے جو وہب (عطا) ہے، وہ ہمیشہ جاری رہے گا، اگرچہ آخرت میں میرا قول بلا طلب ہو گا، لیکن التجلی (ظہور الٰہی) دائمی ہے اور قبول دائمی ہے، پس علم میرے لیے ہمیشہ تجددِ ظہور (نئے سرے سے ظاہر ہونا) رکھتا ہے۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و هشتم در معرفت منزل روز شنبه: از خود بگشا لنگر جدیت (تلاش) را که محکم بسته‌ای، زیرا عالم از من فارغ شد و من از آن فارغ شدم.\n\nما از اجناس فارغ شدیم، پس خلق، خلق ماست؛ و اشخاص (افراد) آن‌ها باقی مانده‌اند که در حال تکوّن (شکل‌گیری) هستند.\n\nتا نهایت جود و دم‌ها (نفس‌ها)، پس امر (کار) دائمی است؛ تا غایاتی که برای آن تعیین نمی‌شوند.\n\nاو (الحق) غایت قصوی (نهایت دور) است، پس جز او نهایتی نیست؛ این حق یقینی اوست.\n\nمن آغازم، بازگشتی نمی‌بینی، زیرا او (الحق) واسع و مختار است به واسطه من، پس درک کنید.\n\nمن به قصد، اوّلم، پس کائنات، کائنات ماست؛ و آخرین موجود، منم، که یقین می‌شود.\n\nاز روزی‌های پاکیزه از هر سو بخورید؛ زیرا به خاطر ما آشکار شدند و برای خداوند باشید.\n\n### آفرینش عالم در شش روز\n\nخداوند متعال می‌فرماید: «آنگاه که در روز شنبه تجاوز می‌کردند» (إِذْ يَعْدُونَ في السَّبْتِ). ما از باب اشاره نه از باب تفسیر می‌گوییم که آنان با آسایش از حد آن تجاوز می‌کنند و به همین دلیل شنبه (السبت) نامیده شد. زیرا خداوند عالم را در شش روز آفرید؛ آن را روز یکشنبه آغاز کرد و روز جمعه از آن فارغ شد، و هیچ خستگی (لغوب) به او نرسید و از آفرینش خلق درمانده نشد. چون روز هفتم هفته فرا رسید و از عالم فارغ شد، شبیه به استراحت‌کننده‌ای بود که خستگی به او رسیده باشد، پس دراز کشید و یکی از پاهای خود را بر دیگری نهاد و فرمود: «من پادشاهم.» این‌گونه در اخبار نبوی وارد شده است. پس روز شنبه نامیده شد، یعنی روز آسایش، و آن روز ابدیت (يوم الأبد) است. در آن روز، اشخاص هر نوعی در دنیا و آخرت شکل می‌گیرند.\n\nو این‌ها جز هفت روز نیستند که برای هر روز، والیانی از اولیای خداوند وجود دارند. امر به روز شنبه منتهی شد، پس خداوند امر آن را به والی‌ای سپرد که نگهداری و ثبات (الإمساك والثبوت) از آن اوست. پس اوست که صور را در هباء (غبار کیهانی) نگه می‌دارد. روز این روز که روز ابدیت (يوم الأبد) است، برای اهل بهشت و شب آن برای اهل آتش است؛ نه غروبی برای روزش هست و نه صبحی برای شبش. ما ندیدیم کسی این روز را در نظر بگیرد مگر السبتي، محمد بن هارون الرشید، امیرالمؤمنین. این بدان سبب بود که من روز جمعه پس از نماز جمعه در مکه بودم و وارد طواف شدم. مردی خوش‌سیما، با هیبت و وقار دیدم که پیشاپیش من خانه را طواف می‌کرد. نگاهم را به او دوختم شاید او را بشناسم، اما او را در میان مجاوران نشناختم و به دلیل تازگی و شادابی که داشت، نشانه مسافری که تازه از سفر آمده باشد، بر او ندیدم. دیدم که از میان دو مردی که در طواف به هم چسبیده بودند، عبور می‌کرد و از بین آن‌ها می‌گذشت، بدون اینکه آن‌ها را از هم جدا کند یا متوجه او شوند. شروع کردم به دنبال کردن جای قدم‌های او؛ هیچ قدمی را برنمی‌داشت مگر اینکه پایم را در جای قدم او می‌گذاشتم، و ذهنم متوجه او و چشمم همراه او بود تا مبادا از دستم برود. من نیز از میان آن دو مرد چسبیده به هم که او از میانشان می‌گذشت، عبور می‌کردم و در پی او می‌گذشتم، همان‌طور که او می‌گذشت، و آن‌ها را از هم جدا نمی‌کردم. از این کار در شگفت شدم. هنگامی که هفت دور خود را کامل کرد و خواست خارج شود، او را گرفتم و سلام کردم. او سلام مرا پاسخ داد و به من لبخند زد، در حالی که من چشم از او برنمی‌داشتم از ترس اینکه از دستم برود، زیرا شک نداشتم که او روحی است که جسم یافته (روح تجسد) و دانستم که بصر (دیدن) او را مقید می‌کند. به او گفتم: «من می‌دانم که تو روحی متجسد هستی.» او گفت: «راست گفتی.» گفتم: «رحمت خدا بر تو باد، تو کیستی؟» گفت: «من السبتي، پسر هارون الرشید هستم.» گفتم: «می‌خواهم از حالتی که در ایام زندگی دنیوی‌ات داشتی، بپرسم.» گفت: «بپرس.» گفتم: «به من رسیده است که تو را السبتي نامیدند، مگر به این دلیل که هر شنبه به اندازه‌ای کار می‌کردی که در بقیه هفته بخوری؟» گفت: «آنچه به تو رسیده صحیح است، امر چنین بود.» گفتم: «چرا روز شنبه را به جای دیگر روزهای هفته اختصاص دادی؟» گفت: «چه سؤال خوبی پرسیدی.» سپس به من گفت: «به من رسیده بود که خداوند آفرینش عالم را روز یکشنبه آغاز کرد و روز جمعه از آن فارغ شد، و چون روز شنبه شد، دراز کشید و یکی از پاهای خود را بر دیگری نهاد و فرمود: من پادشاهم. این خبر در اخبار به من رسیده بود در حالی که در زندگی دنیا بودم. با خود گفتم: به خدا سوگند، بر اساس این عمل خواهم کرد. پس از روز یکشنبه تا پایان شش روز، خود را وقف عبادت خداوند کردم و به هیچ کاری جز عبادت او مشغول نشدم و می‌گفتم: همان‌طور که خداوند متعال در این شش روز به ما توجه کرد، من نیز خود را در آن‌ها وقف عبادت او می‌کنم و آن را با کار شخصی درهم نمی‌آمیزم. اما چون روز شنبه فرا رسد، خود را وقف خویش می‌کنم و آنچه را که قوت من در باقی هفته است، برای خود فراهم می‌آورم، همان‌طور که روایت کردیم از نهادن یکی از پاهایش بر دیگری و گفتن: من پادشاهم (الحدیث).» و خداوند در این کار بر من گشایش داد. به او گفتم: «قطب زمان در وقت تو چه کسی بود؟» گفت: «من بودم، و فخری نیست.» گفتم: «تعریف (شناخت) برای من نیز چنین واقع شد.» گفت: «کسی که تو را شناخت، راست گفت.» سپس درباره امر من (اجازه مفارقت) از من پرسید. گفتم: «آن به اختیار توست.» او با سلامی از روی محبت سلام کرد و رفت. برخی از یاران و جماعت در انتظار من بودند، زیرا مشغول مطالعه احیاء علوم الدین غزالی (رحمه الله) برای من بودند. هنگامی که از دو رکعت طواف فارغ شدم و نزد آن‌ها آمدم، یکی از آن‌ها که نبیل بن خزر بن خزرون بود، به من گفت: «ای السبتي، دیدیم که با مردی غریب، خوش‌رو و خوش‌سیما صحبت می‌کردی که او را در میان مجاوران نمی‌شناسیم. او که بود و کی آمد؟» من سکوت کردم و چیزی از حال او به آن‌ها نگفتم، مگر به برخی از برادرانم که داستان او را برایشان بازگو کردم و آن‌ها از این امر در شگفت شدند.\n\n### اینکه فراغت الهی تنها از اجناس در شش روز بود\n\nو بدان، خداوند ما و تو را تأیید کند، که فراغت الهی (الفراغ الإلهي) تنها از اجناس (کلیات) در شش روز بود، اما از اشخاص انواع (جزئیات) نه. پس فراغت به واسطه زمان‌ها باقی ماند، نه از اشخاص. و این همان قول خداوند متعال است: «به زودی به شما خواهیم پرداخت» (سَنَفْرُغُ لَكُمْ) از شؤون، که در آن فرمود: «هر روز او در کاری است» (كُلَّ يَوْمٍ هُوَ في شَأْنٍ) در این دنیا. پس او از ما برای ما فارغ می‌شود و شؤون به برزخ و سرای آخرت منتقل می‌گردند. امر پیوسته از فراغی به فراغ دیگر می‌رود تا زمانی که هنگام عموم رحمت فرا رسد، «رحمتی که همه چیز را در بر گرفته است» (وَسِعَتْ كُلَّ شَيْ‏ءٍ). پس از آن، فراغی واقع نمی‌شود که حالی آن را محدود کند یا متمایز سازد، بلکه وجودی مستمر و وجودی ثابت و پایدار تا بی‌نهایت در دو سرا، سرای بهشت و سرای آتش، خواهد بود. امر در ذات خود چنین است. پس فراغت او از عالم، همین مقداری است که پیش‌تر ذکر کردم، و فراغت عالم از او، تنها از جهت دلالت بر اوست و نه غیر آن. اما بخشش (الوهب) علم به او، پیوسته دائمی است، هرچند در آخرت سخن من از روی طلب نیست، بلکه تجلی (التجلی) دائمی است و پذیرش دائمی است. پس علم پیوسته برای من در حال تجدد ظهور است و خداوند «حق را می‌گوید و او راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}