{
  "id": 91,
  "title": {
    "ar": "الباب الحادي والتسعون في معرفة الورع وأسراره",
    "en": "The Ninety-First Chapter, Concerning the Knowledge of Scrupulous Piety (الورع) and its Mysteries.",
    "ur": "اکانوےواں باب، ورع (پرہیزگاری) اور اس کے اسرار کی معرفت میں",
    "fa": "باب نود و یکم در معرفت ورع (الورع) و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الحادي والتسعون في معرفة الورع وأسراره)\n\n\n> ورع الطريقة في اجتناب محارم *** مهما أتتك وما له وجهان‏\n\n\n> فإذا أتاك مخلصا لجلاله *** وتركته ورعا فمن نقصان‏\n\n\n> لما جهلت الأمر قلت بعكسه *** وتبين النقصان في الايمان‏\n\n\n### [الورع: لغة وشرعا]\n\n\nالورع الاجتناب وهو في الشرع اجتناب الحرام والشبه لا اجتناب الحلال‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم دع ما يريبك إلى ما لا يريبك‏\n\n\nفي هذا الباب وهذا عين ما قلناه وهذا الحديث من جوامع الكلم وفصل الخطاب وقال بعضهم ما رأيت أسهل علي من الورع كل ما حاك له شي‏ء في نفسي تركته عملا بهذا الحديث‏\n\n\n### [الحرام بالنص العبد مأمور باجتنابه‏]\n\n\nفأما الحرام النص فمأمور باجتنابه لأنه ممنوع تناوله في حق من منع منه لا في عين الممنوع فإن ذلك الممنوع بعينه قد أبيح لغيره لكون ذلك الغير على صفة ليست فيمن منع منه أباحته له تلك الصفة بإباحة الشارع فلهذا قلنا لا في عين الممنوع فإنه ما حرم شي‏ء لعينه جملة واحدة ولهذا قال تعالى إِلَّا ما اضْطُرِرْتُمْ إِلَيْهِ فعلمنا أن الحكم بالمنع وغيره مبناه على حال المكلف وفي مواضع على اسم الممنوع فإن تغير الاسم لتغير قام بالمحرم تغير الحكم على المكلف في تناوله إما بجهة الإباحة أو الوجوب وكذلك إن تغير حال المكلف الذي خوطب بالمنع من ذلك الشي‏ء واجتنابه لأجل تلك الحال فإنه يرتفع عنه هذا الحكم ولا بد وإذا كان الأمر على هذا الحد فما ثم عين محرمة لعينها\n\n\n### [الشبهة لها وجه إلى الحرام ووجه إلى الحل على السواء]\n\n\nوأما اجتناب الشبهة فالشبهة هي التي لها وجه إلى الحرام ووجه إلى الحل على السواء من غير تغليب فليس اجتنابها بأولى من تناولها ولا تناولها بأولى من اجتنابها فالورع يترك تناولها ترجيحا لجانب الحرمة في ذلك وغير الورع لا يترك ذلك فبينهما هذا القدر وأما ترك ما لا شبهة فيه فذلك الحلال المحض فإن تركه أعني ترك الفضل منه لأنه لا يصح إلا ترك الفضل منه فذلك الترك زهد لا ورع فإن الزهد في الحرام والشبهة ورع والترك في الحلال الفاضل زهد وأما غير الفاضل وهو الذي تدعو إليه الحاجة فالزهد فيه معصية وما بقي إلا توقيت الحاجة إلى ذلك وما حد الفاضل منه الذي يصح فيه الزهد فنذكر ذلك في باب الزهد إن شاء الله‏\n\n\n### [الورع من المقامات المشروطة ويستصحب العبد ما دام مكلفا]\n\n\nوالورع من المقامات المشروطة ويستصحب العبد ما دام مكلفا ولا يتعين استعماله إلا عند وجود شرطه وهو عام في جميع تصرفات المكلف ما هو مخصوص بشي‏ء من أعماله دون شي‏ء بل له السريان في جميع الأعضاء المكلفة في حركاتها وسكونها وما ينسب إليها من عمل وترك‏\n\n\n### [الشبهات تكون في العلوم النظرية لا في المعاني والأسرار عند العارفين‏]\n\n\nوقد قيل إن للورع حكما في الأسرار والأرواح وليس ذلك بصحيح في الورع المشروع فإن الشبهة في المعاني والمعارف والأسرار مستحيلة عند العارفين وإنما تكون الشبهات في العلوم النظرية الحاصلة بالأدلة العقلية فأولئك يجب عليهم الورع في النظر الفكري حتى يخلصوه من النظر المحرم كالنظر في الذات الإلهية ويخلصوه من الشبهة كالنظر لله أو للسمعة فيخفي على بعض‏\nالنفوس ذلك لشرف العلم فيتخيل أنه يطلبه لله وهو يطلبه للدنيا أو لغير الله فيجتنب نية ذلك الطلب لا يجتنب العلم فإن طلب العلم ليس بمحرم عليه فمتعلق التحريم تلك النية الفاسدة\n\n\n### [الكون كله شبهة فإنك لا تعرف منه إلا أنت‏]\n\n\nوهنا نظر هل تقدح تلك النية في فضل طلب العلم أو يبقى طلب العلم على فضله يعطي حقيقة سعادته في الآخرة وتكون العقوبة على مجرد النية في ذلك وهو الذي نعتمد عليه في باب تحقيق الموازنة الإلهية فمن قال الكون كله شبهة وبه نقول فليس ذلك كما يتوهمه السامع وإنما الصورة الرحمانية أدتنا إلى هذا القول ومثل ذلك لا يتورع فيه ولا يجتنب فإنك لا تعرف منه إلا أنت فإن انتقلت عنك فقد جهلت ذاتك ومن أوجدك فإنه‏\n\n\nقال من عرف نفسه عرف ربه‏\n\n\nفالورع في هذه الشبهة محال بل ينبغي أن تتناول من حيث إنها شبهة فذلك محلها الذي يحلها فإنها لا تخلص لأحد الطرفين أبدا وهذا بحر هلك فيه أكثر العقول وأكثر العارفين إلا من رحم الله وركب سفينة نوح نجاته‏\n\n\n### [الورع اجتناب كل عمل وترك لا يكون لله على الحد المشروع‏]\n\n\nوالجامع لباب الورع أن تجتنب في ظاهرك وباطنك وجميع أعمال أعضائك المكلفة كل عمل وترك لا يكون لله على الحد المشروع فيه المخلص له الذي لا شبهة تضره ولا تقدح فيه فهذا اللام الذي في لله هي الرابطة لهذا الباب وكل مقام في طريق الله تعالى فهو مكتسب ثابت وكل حال فهو موهوب غير مكتسب غير ثابت إنما هو مثل بارق برق فإذا برق إما يزول لنقيضه وإما أن تتوالى أمثاله فإن توالت أمثاله فصاحبه خاسر\n\n\n### [كل مقام هو إما إلهى أو رباني أو رحماني‏]\n\n\nوكل مقام فأما إلهي أو رباني أو رحماني غير هذه الثلاث الحضرات لا يكون وهي تعم جميع الحضرات وعليها يدور الوجود وبها تنزلت الكتب وإليها ترتقي المعارج والمهيمن عليها ثلاثة أسماء إلهية الله والرب والرحمن من حكم اسم ما من الأسماء الإلهية ينعت به في ذلك الوقت أحد هذه الأسماء الثلاثة ويكون حكمه بحسب مقام هذا العبد المحكوم عليه المؤثر فيه من حيث ما هو مسلم أو مؤمن أو محسن وآثاره في عالم ملك العبد أو في عالم جبروته أو في عالم ملكوته وعمله فيه إما بحكم الإطلاق وهو العمل الذاتي وإما بحكم التقييد وهو عمل الصفة وحكمه بعمل الصفة إما بصفة تنزيه وسلب وإما بصفة فعل هذا هو الضابط للمقامات وأحوالها سواء عرفه السالك أو لم يعرفه فإنه لا يخلو من هذه الأحكام كل كون لكنه لا يعرف ذلك كل أحد\n\n\n### [الجانب الإلهي في مقام الورع‏]\n\n\nفأقول إن الورع له مقام ولمقامه حال وهو مشروط كما ذكرنا وينتهي بانتهاء التكليف فأما مقام الورع فهو التقييد بصفة التنزيه لأن حقيقته الاجتناب وهو إلا هي وصاحبه مجهول لا يعرف وحاله أن يكون صاحب علامة في نفسه أو في المتورع فيه والاسم الله ينظر إليه دائما فينظر إليه في عالم ملكه من حيث ما هو مسلم فيؤثر في أفعاله وكلما ظهر على جوارحه فيجتنب كل ما يقدح في حصول هذا المقام وينظر إليه في عالم جبروته من حيث ما هو مؤمن فيؤثر فيه فلا تكذب له رؤيا جملة واحدة ويجتنب في خياله كما يجتنب في ظاهره لأن الخيال تابع للحس ولهذا إذا احتلم المريد برؤيا عاقبه شيخه أ لا ترى أنه ما احتلم نبي قط ولا ينبغي له ذلك ولا العارفون بالله ذوقا فإن الاحتلام برؤيا في النوم أو في التصور في اليقظة فإنما هو من بقية طبيعية في خياله وهو كذب فإنه يظن أنه في الحس الظاهر وقد قلنا إن الورع يجتنب الكذب فلو اجتنبه في الحس لأثر في خياله فإذا رأيتم صاحب مقام الورع يغتسل من نوم فذلك لماء خرج منه وهو نائم لضعف الأعضاء الباطنة وهو مرض طرأ في مزاجه لا عن رؤيا أصلا لا في حلال ولا في حرام وأما إذا نظر إليه في عالم ملكوته فأثره فيه اجتناب التأويل فيما يرد عليه من المخاطبات الإلهية والتجلي الإلهي إذا كان كل ذلك في السور فلا يعبر ما رآه ولا يتأول ما خوطب به فإنه كله إلهي وكل إلهي مجهول كما أن الورعين مجهولون لأنه اجتناب وترك ولا يتميز الأمر من خارج إلا بالفعل فإن نطق الورع بما ينبغي أن يجتنب ذلك الأمر ولأجله اجتنبه فقد أخل بمقام الورع فإن مقامه أن يكون مجهولا وقد عرف بأنه ورع فزال عنه حكم مقامه بل ما كان قط في مقام الورع وورعه في اجتنابه معلول فلا يسلم له‏\n\n\n### [الجانب الرباني والرحمانى في مقام الورع‏]\n\n\nوأما الرباني والرحماني فعلى هذا المجرى سواء فخذه واعمل عليه ترى عجبا فقل أن تجده في غير هذا الكتاب فإن أكثر الناس بل ربما كلهم ما أبانوا عن هذه المقامات والأحوال بما يعطيه تفصيل الوجود وإن كانوا يعرفونها فإنهم اتكلوا في ذلك على أن السالك إذا دخل وصدق في التوجه أبينت له الأمور على ما هي عليه فيعرف حاله‏\n\n",
    "en": "## (Chapter Ninety-One: On the Gnosis of Scrupulousness and its Secrets)\n\nThe Scrupulousness (ورع) of the Path lies in avoiding prohibitions,\nWhenever they come to you, and they have no two faces.\n\nBut if it comes to you sincerely for His Majesty,\nAnd you abandon it out of scrupulousness, then that is a deficiency.\n\nBecause you were ignorant of the matter, you spoke the opposite,\nAnd the deficiency became manifest in your faith.\n\n### [Scrupulousness (الورع): Linguistically and Legally]\n\nScrupulousness (الورع) is avoidance. In the Sacred Law (الشرع), it is the avoidance of the forbidden (الحرام) and the doubtful (الشبه), but not the avoidance of the permissible (الحلال).\n\nThe Prophet, peace and blessings be upon him, said: \"Leave that which causes you doubt for that which causes you no doubt.\"\n\nThis is the essence of what we have stated in this chapter. This Hadith is among the comprehensive sayings (جوامع الكلم) and decisive speech (فصل الخطاب). Some have said: \"I have never seen anything easier for me than scrupulousness (الورع). Everything that caused hesitation in my soul, I abandoned, acting upon this Hadith.\"\n\n### [The Explicitly Forbidden: The Servant is Commanded to Avoid It]\n\nAs for the explicitly forbidden (الحرام النص), one is commanded to avoid it because its consumption is prohibited for the one who is forbidden from it, but not due to the essence (عين) of the prohibited thing itself. For that very prohibited thing may be made permissible for another person, because that other person possesses a quality not present in the one who was forbidden, and that quality makes it permissible for him through the permission of the Lawgiver (الشارع). This is why we said: \"not due to the essence of the prohibited thing,\" for nothing is forbidden absolutely due to its essence alone.\n\nFor this reason, the Almighty said: <<إِلَّا ما اضْطُرِرْتُمْ إِلَيْهِ>> (Except that to which you are compelled). Thus, we know that the ruling of prohibition or otherwise is based on the state (حال) of the legally responsible person (المكلف), and in some instances, on the name of the prohibited thing. If the name changes due to a change that occurred in the forbidden object, the ruling concerning its consumption changes for the legally responsible person, either toward permissibility or obligation. Likewise, if the state of the legally responsible person—who was addressed with the prohibition and avoidance of that thing due to that state—changes, then this ruling must necessarily be lifted from him. Since the matter is thus, there is no essence (عين) that is forbidden purely for its own sake.\n\n### [The Doubtful Matter Has an Equal Aspect toward the Forbidden and the Permissible]\n\nAs for avoiding the doubtful matter (الشبهة), the doubtful matter is that which has an aspect toward the forbidden (الحرام) and an aspect toward the permissible (الحل) equally, without one side prevailing. Therefore, avoiding it is no more preferable than consuming it, nor is consuming it more preferable than avoiding it. The scrupulous person (الورع) abandons its consumption, giving preference to the side of prohibition in that matter, while the non-scrupulous person does not abandon it. This is the difference between them.\n\nAs for abandoning that which contains no doubt, that is the purely permissible (الحلال المحض). If one abandons it—meaning, abandoning the surplus of it, because only the surplus can properly be abandoned—then that abandonment is asceticism (زهد), not scrupulousness (ورع). For asceticism concerning the forbidden and the doubtful is scrupulousness, but abandonment of the surplus permissible is asceticism. As for the non-surplus permissible, which is that necessitated by need, asceticism concerning it is disobedience (معصية). What remains is determining the timing of that need and defining the limit of the surplus in which asceticism is valid. We shall mention that in the chapter on Asceticism, God willing.\n\n### [Scrupulousness is Among the Conditional Stations and Accompanies the Servant as Long as He is Legally Responsible]\n\nScrupulousness (الورع) is among the conditional Stations (المقامات المشروطة) and accompanies the servant (العبد) as long as he is legally responsible (مكلف). Its application is only determined upon the existence of its condition. It is general across all actions of the legally responsible person; it is not specific to one type of action over another. Rather, it permeates all responsible limbs, in their movements and their stillness, and in whatever action or abandonment is attributed to them.\n\n### [Doubtful Matters Occur in Theoretical Sciences, Not in Meanings and Secrets According to the Gnostics]\n\nIt has been said that scrupulousness (الورع) has a ruling concerning secrets (الأسرار) and spirits (الأرواح), but this is not correct regarding the prescribed scrupulousness (الورع المشروع). For doubt (الشبهة) concerning meanings (المعاني), gnosis (المعارف), and secrets is impossible according to the Gnostics (العارفين). Doubtful matters only occur in the theoretical sciences (العلوم النظرية) obtained through rational proofs (الأدلة العقلية).\n\nFor those people, scrupulousness is obligatory in intellectual contemplation (النظر الفكري) so that they purify it from forbidden contemplation, such as contemplating the Divine Essence (الذات الإلهية), and purify it from doubt, such as contemplating for God or for reputation (السمعة). This may be hidden from some souls due to the nobility of knowledge, so they imagine they seek it for God when they are seeking it for the world or for other than God. Thus, they must avoid the intention (نية) behind that seeking, not the knowledge itself, for seeking knowledge is not forbidden to them. The object of prohibition is that corrupt intention.\n\n### [The Entire Cosmos is a Doubtful Matter, for You Know Nothing of It Except Yourself]\n\nHere, there is a consideration: Does that intention invalidate the merit of seeking knowledge, or does the seeking of knowledge retain its merit, granting the reality of its felicity in the Hereafter, with the punishment being solely for the intention involved? This is what we rely upon in the chapter on the realization of the Divine Balance (الموازنة الإلهية).\n\nAs for those who say the entire cosmos (الكون كله) is a doubtful matter (شبهة)—and we agree with this—it is not as the listener might imagine. Rather, the Merciful Form (الصورة الرحمانية) led us to this statement. And such a matter should not be treated with scrupulousness (يتورع فيه) or avoided, for you know nothing of it except yourself. If you move away from it, you have become ignorant of your own essence (ذاتك) and of the One who brought you into existence, for He said: \"Whoever knows himself knows his Lord.\"\n\nTherefore, scrupulousness concerning this doubtful matter is impossible (محال). Rather, it should be approached precisely because it is a doubtful matter, for that is the place that makes it permissible, as it never settles definitively on either of the two sides. This is an ocean in which most intellects and most Gnostics have perished, save those upon whom God has mercy and who board the Ark of Noah, which is their salvation.\n\n### [Scrupulousness is the Avoidance of Every Action and Abandonment that is Not for God According to the Prescribed Limit]\n\nThe comprehensive definition for the chapter on Scrupulousness (الورع) is that you avoid, in your outward and inward being, and in all the actions of your responsible limbs, every action and abandonment that is not *for God* (لله) according to the prescribed limit (الحد المشروع), purified for Him, such that no doubt (شبهة) harms it or invalidates it. This *lam* (L) in *li-Llah* (for God) is the link for this chapter.\n\nEvery Station (مقام) on the path of God Almighty is acquired and permanent (ثابت). Every State (حال) is bestowed, not acquired, and not permanent. It is merely like a flash of lightning (بارق برق). When it flashes, it either vanishes due to its opposite, or its likenesses follow one after another. If its likenesses follow one another, its possessor is a loser.\n\n### [Every Station is Either Divine, Lordly, or Merciful]\n\nEvery Station (مقام) is either Divine (إلهي), Lordly (رباني), or Merciful (رحماني). It cannot be outside these three Presences (الحضرات). They encompass all Presences, upon them Existence (الوجود) revolves, through them the Scriptures were revealed, and to them the ascensions (المعارج) rise. The three Divine Names (الأسماء الإلهية) that dominate them are *Allah*, *al-Rabb* (The Lord), and *al-Rahman* (The Merciful).\n\nThe ruling of any Divine Name is described at that time by one of these three Names. Its effect is according to the Station of the servant (العبد) upon whom the ruling is passed, influencing him based on whether he is a Muslim, a Believer (مؤمن), or an Excellent Doer (محسن). Its effects manifest in the servant’s world of Dominion (ملك), or in his world of Power (جبروت), or in his world of Sovereignty (ملكوت). His action within it is either by the ruling of absolute freedom (الإطلاق), which is the essential act (العمل الذاتي), or by the ruling of restriction (التقييد), which is the act of the Attribute (عمل الصفة). The ruling of the act of the Attribute is either by an Attribute of transcendence and negation (تنزيه وسلب) or by an Attribute of action (فعل). This is the regulator (الضابط) for the Stations and their States, whether the seeker (السالك) knows it or not, for every existence (كون) is subject to these rulings, though not everyone knows this.\n\n### [The Divine Aspect in the Station of Scrupulousness]\n\nI say, therefore, that Scrupulousness (الورع) has a Station (مقام) and its Station has a State (حال). It is conditional, as we mentioned, and it ends when legal responsibility (التكليف) ends. The Station of Scrupulousness is restriction by the Attribute of Transcendence (صفة التنزيه), because its reality is avoidance (الاجتناب), and it is Divine (إلهي). Its possessor is unknown and unrecognized. Its State is that he possesses a sign (علامة) either within himself or in the matter concerning which he is scrupulous.\n\nThe Name *Allah* looks upon him constantly. It looks upon him in his world of Dominion (ملك) insofar as he is a Muslim, influencing his actions and everything that appears on his limbs. Thus, he avoids everything that might invalidate the attainment of this Station.\n\nIt looks upon him in his world of Power (جبروت) insofar as he is a Believer (مؤمن), influencing him such that his vision (رؤيا) is never false, absolutely. He avoids things in his Imagination (خيال) just as he avoids them outwardly, because the Imagination is subordinate to the senses. For this reason, if a novice (مريد) has a wet dream (احتلم برؤيا), his Shaykh punishes him. Do you not see that no Prophet ever had a wet dream, nor is it fitting for them, nor for the Gnostics (العارفون بالله) by direct tasting (ذوقا)?\n\nFor a wet dream, whether through a vision in sleep or through imagination (التصور) while awake, is merely a natural residue in his Imagination, and it is a falsehood. He imagines that he is in the manifest sense. We have stated that the scrupulous person avoids falsehood. If he avoided it in the senses, it would affect his Imagination. Therefore, if you see the possessor of the Station of Scrupulousness performing the major ablution (يغتسل) after sleep, it is due to fluid that exited him while sleeping due to the weakness of the inner organs—a sickness that occurred in his temperament—and not due to any vision whatsoever, neither permissible nor forbidden.\n\nAs for when the Name *Allah* looks upon him in his world of Sovereignty (ملكوت), its effect upon him is the avoidance of interpretation (التأويل) concerning the Divine addresses (المخاطبات الإلهية) and the Divine Theophany (التجلي الإلهي) that come to him, provided all of that is in forms (الصور). He does not interpret what he sees, nor does he allegorize what he is addressed with, for all of it is Divine (إلهي), and everything Divine is unknown (مجهول), just as the scrupulous people (الورعين) are unknown. This is because scrupulousness is avoidance and abandonment, and the matter is not distinguished outwardly except by action.\n\nIf the scrupulous person speaks about the matter that should be avoided, and states that he avoided it for that reason, he has violated the Station of Scrupulousness (مقام الورع). For his Station requires him to be unknown (مجهولا). If he becomes known as scrupulous, the ruling of his Station is removed from him. Indeed, he was never truly in the Station of Scrupulousness, and his scrupulousness in avoidance is flawed (معلول) and will not be preserved for him.\n\n### [The Lordly and Merciful Aspects in the Station of Scrupulousness]\n\nAs for the Lordly (الرباني) and the Merciful (الرحماني) aspects, they follow this same course exactly. Take this and act upon it, and you will see wonders. Rarely will you find it outside this book. For most people—indeed, perhaps all of them—have not clarified these Stations (المقامات) and States (الأحوال) according to the detailed exposition that Existence (الوجود) provides. Even if they know them, they relied in this matter on the fact that when the seeker (السالك) enters and is sincere in his turning (التوجه), matters will be clarified for him as they truly are, and he will know his State.",
    "ur": "## (باب نمبر اکیانوے: ورع (اجتناب) اور اس کے اسرار کی معرفت میں)\n\nطریقت کا ورع (الورع) حرام چیزوں سے بچنے میں ہے،\nجب بھی وہ تمہارے سامنے آئیں، اور اس کے دو رُخ نہیں ہیں۔\nپس اگر وہ (حرام) تمہارے پاس اس کے جلال کے لیے خالص ہو کر آئے،\nاور تم اسے ورع (الورع) کی وجہ سے چھوڑ دو، تو یہ کمی ہے۔\nجب تم نے معاملے کو نہ جانا تو تم نے اس کے برعکس کہا،\nاور یہ کمی ایمان میں ظاہر ہو گئی۔\n\n### [ورع: لغوی اور شرعی تعریف]\n\nورع (الورع) اجتناب (الاجتناب) کو کہتے ہیں۔ اور شرع میں یہ حرام (الحرام) اور شبہہ (الشبه) سے اجتناب ہے، حلال (الحلال) سے اجتناب نہیں۔\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n**\"دع ما يريبك إلى ما لا يريبك\"**\n(اس چیز کو چھوڑ دو جو تمہیں شک میں ڈالے، اس چیز کی طرف جو تمہیں شک میں نہ ڈالے)۔\nیہ اس باب میں ہے اور یہی عین وہ بات ہے جو ہم نے کہی۔ یہ حدیث جوامع الکلم (جامع کلمات) اور فصل الخطاب (فیصلہ کن بات) میں سے ہے۔ بعض نے کہا: \"میں نے اپنے لیے ورع (الورع) سے زیادہ آسان کوئی چیز نہیں دیکھی۔ جو بھی چیز میرے دل میں کھٹکتی ہے، میں اس حدیث پر عمل کرتے ہوئے اسے چھوڑ دیتا ہوں۔\"\n\n### [نص سے ثابت شدہ حرام، بندہ اس سے اجتناب کا مامور ہے]\n\nجہاں تک نص سے ثابت شدہ حرام (الحرام النص) کا تعلق ہے، تو بندہ اس سے اجتناب کا مامور ہے، کیونکہ اس کا استعمال اس شخص کے حق میں ممنوع ہے جسے اس سے منع کیا گیا ہے، نہ کہ عین ممنوع چیز میں۔ اس لیے کہ عین وہی ممنوع چیز کسی دوسرے کے لیے مباح کر دی گئی ہے، کیونکہ وہ دوسرا شخص ایسی صفت پر ہے جو اس شخص میں نہیں جسے منع کیا گیا تھا، اور شارع کی اباحت کے ذریعے اس صفت نے اسے مباح کر دیا۔ اسی لیے ہم نے کہا کہ \"عین ممنوع چیز میں نہیں\"۔ کیونکہ کوئی بھی چیز اپنی ذات کی وجہ سے کلی طور پر حرام نہیں کی گئی۔ اسی لیے اللہ تعالیٰ نے فرمایا:\n**\"إِلَّا ما اضْطُرِرْتُمْ إِلَيْهِ\"**\n(مگر جس کی طرف تم مجبور ہو جاؤ)۔\nپس ہم نے جان لیا کہ ممانعت اور دیگر احکام کی بنیاد مکلف (ذمہ دار شخص) کی حالت پر ہے، اور بعض مقامات پر ممنوع چیز کے نام پر بھی ہے۔ اگر نام میں تبدیلی واقع ہو جائے، اس تبدیلی کی وجہ سے جو حرام چیز میں واقع ہوئی ہے، تو مکلف پر اس کے استعمال کا حکم بھی بدل جاتا ہے، یا تو اباحت (جائز ہونے) کی جہت سے یا وجوب (لازم ہونے) کی جہت سے۔ اسی طرح اگر مکلف کی حالت بدل جائے جسے اس چیز سے منع کیا گیا تھا اور اس حالت کی وجہ سے اس سے اجتناب کا حکم دیا گیا تھا، تو یہ حکم اس سے لازماً اٹھ جائے گا۔ اور جب معاملہ اس حد پر ہو، تو پھر کوئی بھی چیز اپنی ذات کی وجہ سے حرام نہیں ہے۔\n\n### [شبہہ کا ایک رُخ حرام کی طرف اور ایک رُخ حلال کی طرف برابر ہوتا ہے]\n\nجہاں تک شبہہ (الشبهۃ) سے اجتناب کا تعلق ہے، تو شبہہ وہ ہے جس کا ایک رُخ حرام کی طرف ہو اور ایک رُخ حلال کی طرف، بغیر کسی ترجیح کے، برابر ہو۔ پس اس سے اجتناب کرنا اس کے استعمال سے زیادہ بہتر نہیں، اور نہ ہی اس کا استعمال اس سے اجتناب سے زیادہ بہتر ہے۔ پس ورع (الورع) والا شخص اس کے استعمال کو چھوڑ دیتا ہے، اس میں حرمت کے پہلو کو ترجیح دیتے ہوئے، اور غیر ورع والا شخص اسے نہیں چھوڑتا۔ پس ان دونوں کے درمیان یہ فرق ہے۔\nاور جہاں تک ایسی چیز کو چھوڑنے کا تعلق ہے جس میں کوئی شبہہ نہ ہو، تو وہ خالص حلال (الحلال المحض) ہے۔ اگر اسے چھوڑا جائے—یعنی اس میں سے زائد (فضل) کو چھوڑا جائے، کیونکہ صرف زائد کو ہی چھوڑنا صحیح ہے—تو یہ ترک زہد (الزہد) ہے، ورع (الورع) نہیں۔ کیونکہ حرام اور شبہہ میں زہد (الزہد) ورع ہے، اور حلال میں زائد کو چھوڑنا زہد ہے۔ اور جہاں تک غیر زائد کا تعلق ہے، یعنی وہ جس کی طرف ضرورت (حاجۃ) بلاتی ہے، تو اس میں زہد (الزہد) معصیت ہے۔ اب صرف اس کی ضرورت کی حد بندی باقی رہ گئی ہے اور یہ کہ اس میں سے زائد کی حد کیا ہے جس میں زہد صحیح ہو سکتا ہے۔ ہم ان شاء اللہ اس کا ذکر باب الزہد میں کریں گے۔\n\n### [ورع مشروط مقامات میں سے ہے اور بندہ جب تک مکلف ہے اسے لازم رہتا ہے]\n\nورع (الورع) مشروط مقامات (المقامات المشروطة) میں سے ہے اور بندہ جب تک مکلف (مکلف) ہے اسے لازم رہتا ہے۔ اور اس کا استعمال متعین نہیں ہوتا مگر جب اس کی شرط موجود ہو۔ اور یہ مکلف کے تمام تصرفات میں عام ہے، یہ اس کے کسی ایک عمل کے ساتھ مخصوص نہیں ہے، بلکہ اسے تمام مکلف اعضاء کی حرکات و سکنات اور ان سے منسوب عمل اور ترک میں سرایت حاصل ہے۔\n\n### [شبہات نظری علوم میں ہوتی ہیں، نہ کہ عارفین کے نزدیک معانی اور اسرار میں]\n\nیہ بھی کہا گیا ہے کہ ورع (الورع) کا ایک حکم اسرار (الأسرار) اور ارواح میں بھی ہے۔ لیکن یہ مشروع ورع (الورع المشروع) میں صحیح نہیں ہے۔ کیونکہ عارفین (العارفین) کے نزدیک معانی، معارف (المعارف) اور اسرار میں شبہہ (الشبهۃ) محال ہے۔ شبہات صرف ان نظری علوم (العلوم النظریۃ) میں ہوتی ہیں جو عقلی دلائل سے حاصل ہوتے ہیں۔ پس ان لوگوں پر فکری نظر (النظر الفکری) میں ورع (الورع) واجب ہے تاکہ وہ اسے حرام نظر سے پاک کر لیں، جیسے ذات الٰہیہ (الذات الإلهية) میں نظر کرنا، اور اسے شبہہ سے پاک کر لیں، جیسے اللہ کے لیے یا شہرت کے لیے نظر کرنا۔ پس یہ بعض نفوس پر علم کی شرافت کی وجہ سے پوشیدہ رہ جاتا ہے، اور وہ گمان کرتا ہے کہ وہ اسے اللہ کے لیے طلب کر رہا ہے، حالانکہ وہ اسے دنیا کے لیے یا غیر اللہ کے لیے طلب کر رہا ہوتا ہے۔ پس وہ اس طلب کی نیت سے اجتناب کرتا ہے، نہ کہ علم سے اجتناب کرتا ہے، کیونکہ علم کا طلب کرنا اس پر حرام نہیں ہے۔ پس تحریم کا تعلق اس فاسد نیت سے ہے۔\n\n### [ساری کائنات شبہہ ہے، کیونکہ تم اس میں سے صرف اپنے آپ کو جانتے ہو]\n\nیہاں ایک نظر (نظر) ہے کہ کیا یہ نیت طلب علم کی فضیلت میں نقص پیدا کرتی ہے، یا طلب علم اپنی فضیلت پر قائم رہتا ہے اور آخرت میں اپنی حقیقی سعادت دیتا ہے، اور سزا صرف اس نیت پر ہوتی ہے؟ اور یہی وہ بات ہے جس پر ہم باب تحقیق الموازنۃ الإلهیۃ (الٰہی توازن کی تحقیق کا باب) میں اعتماد کرتے ہیں۔\nپس جس نے کہا کہ ساری کائنات شبہہ (شبهة) ہے، اور ہم بھی یہی کہتے ہیں، تو یہ ویسا نہیں ہے جیسا سننے والا گمان کرتا ہے۔ بلکہ صورۃ الرحمانیۃ (رحمانی صورت) نے ہمیں اس قول کی طرف رہنمائی کی ہے۔ اور ایسی چیز میں ورع (الورع) نہیں کیا جاتا اور نہ ہی اس سے اجتناب کیا جاتا ہے، کیونکہ تم اس میں سے صرف اپنے آپ کو جانتے ہو۔ اگر تم اپنے آپ سے منتقل ہو گئے تو تم نے اپنی ذات اور اپنے خالق کو نہیں جانا، کیونکہ اس نے فرمایا:\n**\"من عرف نفسه عرف ربه\"**\n(جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا)۔\nپس اس شبہہ (الشبهۃ) میں ورع (الورع) محال ہے، بلکہ اسے اس حیثیت سے استعمال کرنا چاہیے کہ یہ شبہہ ہے، کیونکہ یہی اس کا وہ مقام ہے جو اسے حلال کرتا ہے۔ کیونکہ یہ کبھی بھی کسی ایک طرف کے لیے خالص نہیں ہوتی۔ اور یہ ایک ایسا سمندر ہے جس میں اکثر عقلیں اور اکثر عارفین (العارفین) ہلاک ہو گئے، سوائے ان کے جن پر اللہ نے رحم کیا اور جو نوح کی کشتیِ نجات پر سوار ہوئے۔\n\n### [ورع ہر اس عمل اور ترک سے اجتناب ہے جو مشروع حد پر اللہ کے لیے نہ ہو]\n\nباب ورع (الورع) کا جامع یہ ہے کہ تم اپنے ظاہر اور باطن میں اور اپنے تمام مکلف اعضاء کے تمام اعمال میں ہر اس عمل اور ترک سے اجتناب کرو جو مشروع حد پر اللہ کے لیے نہ ہو، اس کے لیے خالص نہ ہو، جس میں کوئی شبہہ اسے نقصان نہ پہنچائے اور نہ ہی اس میں نقص پیدا کرے۔ پس یہ \"للہ\" میں جو لام ہے، یہی اس باب کا رابطہ ہے۔\nاور اللہ تعالیٰ کی راہ میں ہر مقام (مقام) کسبی (حاصل کیا ہوا) اور ثابت ہوتا ہے، اور ہر حال (حال) موہوب (عطا کیا گیا)، غیر کسبی اور غیر ثابت ہوتا ہے۔ یہ صرف بجلی کی چمک کی طرح ہوتا ہے۔ جب وہ چمکتی ہے تو یا تو اپنے مخالف کی وجہ سے زائل ہو جاتی ہے، یا اس کی مثالیں پے در پے آتی ہیں۔ اگر اس کی مثالیں پے در پے آئیں تو اس کا صاحب خسارے میں ہے۔\n\n### [ہر مقام یا تو الٰہی ہے یا ربانی یا رحمانی]\n\nاور ہر مقام (مقام) یا تو الٰہی (إلهي) ہوتا ہے یا ربانی (رباني) یا رحمانی (رحماني)۔ ان تینوں حضرات (حضرات) کے علاوہ کوئی نہیں ہوتا۔ اور یہ تمام حضرات کو شامل کرتے ہیں، اور ان پر الوجود (ہستی) کا مدار ہے، اور ان کے ذریعے کتابیں نازل ہوئیں، اور ان کی طرف معراجیں بلند ہوتی ہیں۔ اور ان پر تین الٰہی اسماء (أسماء إلهية) حاکم ہیں: اللہ، الرب، اور الرحمن۔\nان الٰہی اسماء میں سے جس اسم کا حکم اس وقت ہوتا ہے، ان تینوں اسماء میں سے کسی ایک کے ساتھ اس کی صفت بیان کی جاتی ہے، اور اس کا حکم اس بندے کے مقام کے مطابق ہوتا ہے جس پر حکم لگایا گیا ہے اور جو اس پر اثر انداز ہو رہا ہے، اس حیثیت سے کہ وہ مسلم ہے یا مؤمن ہے یا محسن ہے۔ اور اس کے اثرات بندے کے عالم ملک (عالم ملک) میں ہوتے ہیں یا عالم جبروت (عالم جبروت) میں یا عالم ملکوت (عالم ملکوت) میں۔ اور اس میں اس کا عمل یا تو اطلاق کے حکم سے ہوتا ہے، جو کہ ذاتی عمل ہے، یا تقیید کے حکم سے ہوتا ہے، جو کہ صفاتی عمل ہے۔ اور صفاتی عمل کا حکم یا تو تنزیہ (پاکیزگی) اور سلب (نفی) کی صفت سے ہوتا ہے، یا فعل (عمل) کی صفت سے۔\nمقامات اور ان کے احوال کا یہی ضابطہ ہے، خواہ سالک اسے جانے یا نہ جانے۔ کیونکہ ہر وجود (کون) ان احکام سے خالی نہیں ہوتا، لیکن ہر کوئی اسے نہیں جانتا۔\n\n### [مقام ورع میں الٰہی پہلو]\n\nپس میں کہتا ہوں کہ ورع (الورع) کا ایک مقام (مقام) ہے اور اس کے مقام کا ایک حال (حال) ہے۔ اور یہ مشروط ہے جیسا کہ ہم نے ذکر کیا، اور تکلیف (تکلیف) کے ختم ہونے پر ختم ہو جاتا ہے۔\nجہاں تک مقام ورع (مقام الورع) کا تعلق ہے، تو وہ صفت تنزیہ (صفۃ التنزيه) کے ساتھ مقید ہونا ہے، کیونکہ اس کی حقیقت اجتناب (اجتناب) ہے۔ اور یہ الٰہی (إلهي) ہے، اور اس کا صاحب مجہول (نامعلوم) ہوتا ہے، اسے کوئی نہیں جانتا۔\nاور اس کا حال (حال) یہ ہے کہ وہ اپنی ذات میں یا جس چیز میں ورع کر رہا ہے اس میں کوئی علامت رکھتا ہو۔ اور اسم اللہ (الاسم الله) ہمیشہ اس پر نظر رکھتا ہے، پس وہ اس پر اس کے عالم ملک (عالم ملک) میں اس حیثیت سے نظر رکھتا ہے کہ وہ مسلم ہے، پس یہ اس کے افعال پر اثر انداز ہوتا ہے اور ہر اس چیز پر جو اس کے اعضاء پر ظاہر ہوتی ہے، پس وہ ہر اس چیز سے اجتناب کرتا ہے جو اس مقام کے حصول میں نقص پیدا کرے۔\nاور وہ اس پر اس کے عالم جبروت (عالم جبروت) میں اس حیثیت سے نظر رکھتا ہے کہ وہ مؤمن ہے، پس یہ اس پر اثر انداز ہوتا ہے، تو اس کا کوئی خواب بالکل جھوٹا نہیں ہوتا۔ اور وہ اپنے خیال (خیال) میں بھی اجتناب کرتا ہے جیسا کہ اپنے ظاہر میں اجتناب کرتا ہے، کیونکہ خیال حس (حس) کا تابع ہے۔ اسی لیے جب مرید کو خواب میں احتلام ہوتا ہے تو اس کا شیخ اسے سزا دیتا ہے۔ کیا تم نہیں دیکھتے کہ کسی نبی کو کبھی احتلام نہیں ہوا اور نہ ہی ان کے لیے یہ مناسب ہے، اور نہ ہی ذوق کے ساتھ اللہ کے عارفین (العارفون باللہ) کے لیے۔ کیونکہ خواب میں یا بیداری میں تصور میں احتلام ہونا، یہ اس کے خیال میں باقی ماندہ طبعی اثرات کی وجہ سے ہوتا ہے، اور یہ جھوٹ ہے، کیونکہ وہ گمان کرتا ہے کہ وہ ظاہر حس میں ہے۔ اور ہم نے کہا کہ ورع (الورع) جھوٹ سے اجتناب کرتا ہے۔ پس اگر وہ حس میں اجتناب کرتا تو یہ اس کے خیال پر اثر انداز ہوتا۔\nپس جب تم مقام ورع (مقام الورع) کے صاحب کو نیند سے غسل کرتے ہوئے دیکھو، تو یہ اس پانی کی وجہ سے ہے جو اس سے نیند میں نکلا ہے، جو باطنی اعضاء کی کمزوری کی وجہ سے ہے، اور یہ اس کے مزاج میں پیدا ہونے والی ایک بیماری ہے، نہ کہ کسی خواب کی وجہ سے، نہ حلال میں اور نہ حرام میں۔\nاور جب وہ اس پر اس کے عالم ملکوت (عالم ملکوت) میں نظر رکھتا ہے، تو اس کا اثر اس میں یہ ہوتا ہے کہ وہ الٰہی مخاطبات اور التجلی (ظہور الٰہی) میں جو کچھ اس پر وارد ہوتا ہے، اس کی تاویل (تأویل) سے اجتناب کرتا ہے، جب یہ سب صورتوں میں ہو۔ پس وہ نہ تو اس کی تعبیر کرتا ہے جو اس نے دیکھا اور نہ ہی اس کی تاویل کرتا ہے جس سے اسے مخاطب کیا گیا، کیونکہ یہ سب الٰہی (إلهي) ہے، اور ہر الٰہی چیز مجہول (نامعلوم) ہے، جیسا کہ ورع کرنے والے مجہول ہوتے ہیں۔ کیونکہ یہ اجتناب اور ترک ہے، اور معاملہ باہر سے صرف فعل کے ذریعے ہی ممتاز ہوتا ہے۔\nپس اگر ورع (الورع) والا شخص اس چیز کے بارے میں بات کرے جس سے اجتناب کرنا چاہیے اور اسی وجہ سے اس نے اجتناب کیا، تو اس نے مقام ورع (مقام الورع) میں نقص پیدا کر دیا، کیونکہ اس کا مقام یہ ہے کہ وہ مجہول ہو، اور وہ اس بات سے معروف ہو گیا کہ وہ ورع والا ہے، پس اس کے مقام کا حکم زائل ہو گیا۔ بلکہ وہ کبھی بھی مقام ورع میں تھا ہی نہیں، اور اس کا اجتناب معلول (علت والا) ہے، پس وہ اس کے لیے سالم نہیں رہتا۔\n\n### [مقام ورع میں ربانی اور رحمانی پہلو]\n\nاور ربانی (رباني) اور رحمانی (رحماني) پہلو بھی اسی نہج پر ہیں، پس اسے لو اور اس پر عمل کرو، تم عجائبات دیکھو گے۔ تم اسے اس کتاب کے علاوہ کہیں اور کم ہی پاؤ گے، کیونکہ اکثر لوگ، بلکہ شاید وہ سب، ان مقامات اور احوال کو اس طرح بیان نہیں کر سکے جس طرح تفصیل الوجود (ہستی کی تفصیل) اسے دیتی ہے، اگرچہ وہ انہیں جانتے ہیں۔ کیونکہ انہوں نے اس بات پر بھروسہ کیا کہ جب سالک داخل ہو گا اور توجہ میں سچا ہو گا تو معاملات اس پر اسی طرح واضح ہو جائیں گے جیسے وہ ہیں، اور وہ اپنے حال کو جان لے گا۔",
    "fa": "باب نود و یکم در معرفت ورع (Wara') و اسرار آن\n\nورع (Wara') طریقت در پرهیز از محارم است *** هرگاه که به تو روی آورند، و آن را دو وجه نیست.\nپس اگر (حلال) مخلصانه برای جلال او به تو روی آورد *** و تو آن را از روی ورع (Wara') ترک کنی، این از نقصان است.\nچون امر را ندانستی، خلاف آن گفتی *** و نقصان در ایمان آشکار شد.\n\n### [ورع (Wara'): لغت و شرعاً]\n\nورع (Wara') در لغت به معنای پرهیز است، و در شرع پرهیز از حرام و شبهات است، نه پرهیز از حلال.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «دع ما يريبك إلى ما لا يريبك» (آنچه تو را به شک می‌اندازد رها کن و به آنچه تو را به شک نمی‌اندازد روی آور.)\n\nاین (حدیث) در این باب، عین همان چیزی است که ما گفتیم. این حدیث از جوامع الکلم (جوامع الكلم) و فصل الخطاب است. و برخی گفته‌اند: «چیزی آسان‌تر از ورع (Wara') برایم ندیدم؛ هرگاه چیزی در نفسم خلجان ایجاد کرد، آن را به عمل به این حدیث ترک کردم.»\n\n### [حرام صریح: بنده مأمور به اجتناب از آن است]\n\nاما حرامِ صریح، بنده مأمور به اجتناب (اجتناب) از آن است، زیرا تناول آن در حق کسی که از آن منع شده، ممنوع است؛ نه در ذاتِ ممنوع. چرا که همان ممنوع بعینه ممکن است برای دیگری مباح باشد، به دلیل اینکه آن دیگری دارای صفتی است که در شخص منع‌شده نیست، و آن صفت به واسطه اباحه شارع، آن را برایش حلال کرده است. به همین دلیل گفتیم: «نه در ذات ممنوع»، زیرا هیچ چیزی به طور کلی و یکجا به خاطر ذاتش حرام نشده است. و به همین دلیل خداوند متعال فرمود: «إِلَّا ما اضْطُرِرْتُمْ إِلَيْهِ» (مگر آنچه به آن ناچار شدید). پس دانستیم که حکم به منع و غیر آن، مبتنی بر حال مکلف است، و در مواردی مبتنی بر نام ممنوع. اگر نام به دلیل تغییری که در محرم رخ داده، تغییر کند، حکم بر مکلف در تناول آن نیز تغییر می‌کند، یا از جهت اباحه یا وجوب. همچنین اگر حال مکلفی که مورد خطاب منع از آن شیء و اجتناب از آن به خاطر آن حال قرار گرفته، تغییر کند، این حکم قطعاً از او برداشته می‌شود. و چون امر بدین حد است، پس هیچ ذاتی به خاطر ذاتش حرام نیست.\n\n### [شبهه وجهی به حرام و وجهی به حلال دارد، به طور مساوی]\n\nو اما اجتناب (اجتناب) از شبهه؛ شبهه آن است که وجهی به حرام و وجهی به حلال دارد، به طور مساوی و بدون ترجیح. پس نه اجتناب از آن بر تناولش اولویت دارد و نه تناولش بر اجتنابش. شخص ورع (Wara') تناول آن را ترک می‌کند تا جانب حرمت را ترجیح دهد، و غیر ورع آن را ترک نمی‌کند. تفاوت میان آن دو همین مقدار است. اما ترک آنچه شبهه‌ای در آن نیست، آن حلال محض است. اگر آن را ترک کند – منظورم ترک فضل آن است، زیرا جز ترک فضل آن صحیح نیست – آن ترک، زهد است نه ورع (Wara'). زیرا زهد در حرام و شبهه، ورع است؛ و ترک در حلال فاضل، زهد است. اما غیر فاضل، یعنی آنچه نیاز به آن می‌خواند، زهد در آن معصیت است. و تنها تعیین وقت نیاز به آن و حد فاضلی که زهد در آن صحیح است باقی می‌ماند، که ان‌شاءالله آن را در باب زهد ذکر خواهیم کرد.\n\n### [ورع (Wara') از مقامات (مقامات) مشروط است و تا زمانی که بنده مکلف است، او را همراهی می‌کند]\n\nو ورع (Wara') از مقامات (مقامات) مشروط است و تا زمانی که بنده مکلف است، او را همراهی می‌کند. و استعمال آن واجب نمی‌شود مگر هنگام وجود شرطش. و این (ورع) در تمامی تصرفات مکلف عام است و به عمل خاصی از اعمال او اختصاص ندارد، بلکه در تمامی اعضای مکلف، در حرکات و سکناتشان، و آنچه از عمل و ترک به آن‌ها نسبت داده می‌شود، جریان دارد.\n\n### [شبهات در علوم نظری رخ می‌دهند، نه در معانی و اسرار نزد عارفان (العارفين)]\n\nو گفته شده است که ورع (Wara') در اسرار و ارواح نیز حکمی دارد، اما این در ورع (Wara') مشروع صحیح نیست. زیرا شبهه در معانی، معارف (المعرفة) و اسرار نزد عارفان (العارفين) محال است. شبهات تنها در علوم نظری که با ادله عقلی حاصل می‌شوند، رخ می‌دهند. پس بر آنان واجب است که در نظر فکری ورع (Wara') داشته باشند تا آن را از نظر حرام، مانند نظر در ذات الهی، خالص سازند؛ و آن را از شبهه خالص سازند، مانند نظر برای خدا یا برای شهرت. این امر بر برخی نفوس به دلیل شرافت علم پنهان می‌ماند، پس خیال می‌کند که آن را برای خدا می‌طلبد در حالی که آن را برای دنیا یا برای غیر خدا می‌طلبد. پس باید از نیت آن طلب اجتناب کند، نه از خود علم؛ زیرا طلب علم بر او حرام نیست. پس متعلق تحریم، آن نیت فاسد است.\n\n### [کل هستی (الوجود) شبهه است، زیرا تو از آن جز خودت را نمی‌شناسی]\n\nو در اینجا این نظر مطرح است که آیا آن نیت، به فضل طلب علم خدشه وارد می‌کند یا طلب علم بر فضل خود باقی می‌ماند و حقیقت سعادتش را در آخرت می‌دهد و عقوبت تنها بر نیت محض در آن است؟ این همان چیزی است که ما در باب تحقیق موازنه الهی بر آن تکیه می‌کنیم. پس کسی که می‌گوید: «کل هستی (الوجود) شبهه است»، و ما نیز به آن قائل هستیم، این آن‌گونه نیست که شنونده توهم می‌کند، بلکه این صورت رحمانیه (الصورة الرحمانية) است که ما را به این قول رهنمون شده است. و در چنین چیزی ورع (Wara') و اجتناب (اجتناب) روا نیست، زیرا تو از آن جز خودت را نمی‌شناسی. اگر از تو منتقل شود، ذات خود و کسی که تو را ایجاد کرده است، نشناخته‌ای.\n\n(پیامبر) فرمود: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت.)\n\nپس ورع (Wara') در این شبهه محال است، بلکه شایسته است که آن را از آن جهت که شبهه است، تناول کنی؛ زیرا آن جایگاه حلال بودن آن است. چرا که هرگز به یکی از دو طرف (حلال یا حرام) خالص نمی‌شود. و این دریایی است که بیشتر عقل‌ها و بیشتر عارفان (العارفين) در آن هلاک شدند، مگر کسی که خداوند به او رحم کرد و بر کشتی نجات نوح سوار شد.\n\n### [ورع (Wara') اجتناب (اجتناب) از هر عمل و ترکی است که بر حد مشروع برای خدا نباشد]\n\nو جامع باب ورع (Wara') این است که در ظاهر و باطن خود و تمامی اعمال اعضای مکلف خود، از هر عمل و ترکی که برای خدا نباشد، بر حد مشروع و مخلصانه که شبهه‌ای به آن ضرر نرساند و در آن خدشه وارد نکند، اجتناب (اجتناب) کنی. این «لام» در «لله» (برای خدا) پیونددهنده این باب است. و هر مقام (مقام) در راه خداوند متعال، اکتسابی و ثابت است؛ و هر حال، موهوبی، غیر اکتسابی و غیر ثابت است. حال مانند درخشش برقی است که وقتی می‌درخشد، یا به ضد خود زایل می‌شود، یا امثال آن پی در پی می‌آیند. اگر امثال آن پی در پی آیند، صاحبش زیانکار است.\n\n### [هر مقام (مقام) یا الهی است یا ربانی یا رحمانی]\n\nو هر مقام (مقام) یا الهی است یا ربانی یا رحمانی. غیر از این سه حضرت (حضرات) وجود ندارد، و این‌ها تمامی حضرات را در بر می‌گیرند. هستی (الوجود) بر محور آن‌ها می‌گردد، کتب به واسطه آن‌ها نازل شده‌اند و معارج به سوی آن‌ها صعود می‌کنند. و مهیمن بر آن‌ها سه اسم الهی است: الله، الرب و الرحمن. هر اسمی از اسماء الهی که در آن زمان حکم کند، یکی از این سه اسم به آن وصف می‌شود، و حکم آن بر حسب مقام (مقام) این بنده محکوم علیه و تأثیرگذار در اوست، از آن جهت که او مسلمان یا مؤمن یا محسن است. و آثار آن در عالم مُلک بنده یا در عالم جبروت او یا در عالم ملکوت اوست. و عمل او در آن یا به حکم اطلاق است که همان عمل ذاتی است، یا به حکم تقیید است که همان عمل صفتی است. و حکم آن به عمل صفتی یا به صفت تنزیه و سلب است یا به صفت فعل. این ضابط مقامات (مقامات) و احوال آن‌هاست، چه سالک (السالك) آن را بشناسد یا نشناسد؛ زیرا هیچ کونی از این احکام خالی نیست، اما همه کس آن را نمی‌شناسد.\n\n### [جنبه الهی در مقام ورع (Wara')]\n\nپس می‌گویم که ورع (Wara') دارای مقام (مقام) است و مقامش دارای حال است، و همان‌طور که ذکر کردیم مشروط است و با پایان یافتن تکلیف پایان می‌یابد. اما مقام ورع (Wara')، تقیید به صفت تنزیه است، زیرا حقیقت آن اجتناب (اجتناب) است و الهی است. و صاحب آن مجهول است و شناخته نمی‌شود. و حال او این است که صاحب علامتی در نفس خود یا در آنچه از آن ورع می‌ورزد، باشد. و اسم «الله» همیشه به او نظر می‌کند. پس در عالم مُلک او از آن جهت که مسلمان است به او نظر می‌شود و در افعال او تأثیر می‌گذارد، و هر آنچه بر جوارحش ظاهر شود، از هر آنچه که به حصول این مقام (مقام) خدشه وارد کند، اجتناب (اجتناب) می‌کند. و در عالم جبروت او از آن جهت که مؤمن است به او نظر می‌شود و در او تأثیر می‌گذارد، پس رؤیای او هرگز دروغ نمی‌شود. و در خیال خود اجتناب می‌کند، همان‌طور که در ظاهر خود اجتناب می‌کند، زیرا خیال تابع حس است. به همین دلیل اگر مرید به واسطه رؤیایی محتلم شود، شیخ او را عقوبت می‌کند. آیا نمی‌بینی که هیچ پیامبری هرگز محتلم نشد و شایسته او نیست، و نه عارفان (العارفين) بالله از روی ذوق. زیرا احتلام به واسطه رؤیا در خواب یا تصور در بیداری، تنها از بقایای طبیعی در خیال اوست و دروغ است، زیرا گمان می‌کند که در حس ظاهر است. و ما گفتیم که ورع (Wara') از دروغ اجتناب می‌کند. پس اگر در حس از آن اجتناب می‌کرد، در خیالش تأثیر می‌گذاشت. پس اگر دیدید صاحب مقام ورع (Wara') از خواب غسل می‌کند، آن به دلیل آبی است که در خواب از او خارج شده، به سبب ضعف اعضای باطنی، و آن مرضی است که در مزاجش عارض شده، نه به دلیل رؤیا، نه در حلال و نه در حرام. و اما اگر در عالم ملکوت او به او نظر شود، اثر آن در او اجتناب از تأویل در مورد مخاطبات الهی و تجلی الهی (التجلی الإلهي) است، اگر همه آن در صور باشد. پس آنچه را دیده تعبیر نمی‌کند و آنچه را مورد خطاب قرار گرفته تأویل نمی‌کند، زیرا همه آن الهی است. و هر امر الهی مجهول است، همان‌طور که ورع‌کنندگان مجهول هستند، زیرا ورع اجتناب و ترک است. و امر از خارج جز با فعل متمایز نمی‌شود. اگر شخص ورع به آنچه باید از آن اجتناب شود سخن بگوید و به خاطر آن اجتناب کرده، به مقام ورع (Wara') خلل وارد کرده است، زیرا مقام او این است که مجهول باشد، در حالی که او به عنوان ورع شناخته شده است، پس حکم مقامش از او زایل شده است. بلکه او هرگز در مقام ورع نبوده و ورع او در اجتنابش معلول است و برای او سالم نمی‌ماند.\n\n### [جنبه ربانی و رحمانی در مقام ورع (Wara')]\n\nو اما جنبه ربانی و رحمانی، دقیقاً بر همین مجراست. پس آن را بگیر و بر اساس آن عمل کن تا شگفتی‌ها ببینی. به ندرت آن را در غیر این کتاب خواهی یافت، زیرا بیشتر مردم، بلکه شاید همه آن‌ها، این مقامات (مقامات) و احوال را آن‌گونه که تفصیل هستی (الوجود) اقتضا می‌کند، آشکار نکرده‌اند. اگرچه آن‌ها را می‌شناسند، اما در این باره بر این تکیه کرده‌اند که سالک (السالك) هرگاه وارد شود و در توجه صادق باشد، امور آن‌گونه که هستند برایش آشکار می‌شود و حال خود را می‌شناسد."
  },
  "page_count": 2
}