{
  "id": 143,
  "title": {
    "ar": "الباب الثالث والأربعون ومائة في معرفة مقام ترك الذكر",
    "en": "Chapter One Hundred and Forty-Third, Concerning the Gnosis of the Station (مقام) of Relinquishing Remembrance (الذكر)",
    "ur": "ایک سو تینتالیسواں باب: ترکِ ذکر کے مقام کی معرفت میں",
    "fa": "باب صد و چهل و سوم در معرفت مقام ترک ذکر"
  },
  "content": {
    "ar": "## (الباب الثالث والأربعون ومائة في معرفة مقام ترك الذكر)\n\n\n> لا يترك الذكر إلا من يشاهده *** وليس يشهده من ليس يذكره‏\n\n\n> فقد تحيرت في أمري وفيه فأين *** الحق بينهما عينا فأوثره‏\n\n\n> ما إن ذكرتك إلا قام لي علم *** فحين أبصره في الحين يستره‏\n\n\n> فلا أزال مع الأحوال أشهده *** ولا أزال مع الأنفاس أذكره‏\n\n\n> ولا يزال لدى الأعيان يشهدني *** ولا يزال مع الأسماء يظهر هو\n\n\n### [هو الهوية وضمير الغائب‏]\n\n\nلا يكتب هنا هو إلا بالواو لتعرف الهوية لا أنه ضمير\n\n\n### [الإطلاق تقييد ولا فائدة للتقييد إلا التمييز]\n\n\nاعلم وفقك الله أن الذكر أفضل من تركه فإن تركه إنما يكون عن شهود والشهود لا يصح أن يكون مطلقا والذكر له الإطلاق ولكن الذكر الذي ذكرناه لا الذكر بالتسبيح والتهليل وغيره من الذكر المقيد فلو كان ترك الذكر لا عن شهود كنا ننظر هل كان سبب تركه مما يقتضي الإطلاق فتحكم فيه بالتساوي والأحوال مقيدة بلا شك وإن كان الإطلاق تقييدا لأنه قد تميز عن المقيد وسرى في المقيدات كيف ما قلت وبنفس ما تميز فقد تقيد بما نميز به فالإطلاق تقييد وأعظم ما يقال فيه إنه مجهول لا يعرف فما خرج بهذا الوصف عن التقييد لأنه قد تميز عن المعلوم‏\n\n\n### [التقييد حاكم لكنه متفاضل أعلاه تقييد في إطلاق‏]\n\n\nفعلى كل حال ما ثم إلا مقيد وما ثم في ما لا ثم إلا مقيد فالعدم هو ما لا ثم وهو متميز عن الوجود والوجود متميز عن العدم فما ثم معلوم ولا مجهول إلا وهو متميز فالتقييد له الحكم وما بقي إلا تقييد متفاضل أعلاه تقييد في إطلاق وهو ذكر الله والجهل به والحيرة فيه‏\n\n\n### [فضل الوجود يعطى الذكر وأنس الشهود ينسيه‏]\n\n\n> وترك الذكر أولى بالشهود *** فذكر الله أولى بالوجود\n\n\n> فكن إن شئت في جود الشهود *** وكن إن شئت في فضل الوجود\n\n",
    "en": "## Chapter One Hundred and Forty-Three: On the Gnosis of the Station of Abandoning Remembrance\n\n> No one abandons remembrance except he who witnesses Him,\n> And no one witnesses Him who does not remember Him.\n> So I am bewildered in my affair and in Him; where is\n> The Truth (الحق) between the two, essentially, so that I may prefer it?\n> I never remembered You except that a knowledge arose for me,\n> But when I perceive it, immediately He conceals it.\n> So I cease not to witness Him with the spiritual states (الأحوال),\n> And I cease not to remember Him with the breaths (الأنفاس).\n> And He ceases not to witness me through the Fixed Entities (الأعيان),\n> And He ceases not to manifest Himself (هو) through the Names (الأسماء).\n\n### [Huwa (He): The Identity (الهوية) and the Pronoun of the Absent]\n\nHere, *Huwa* [He] is written only with the *wāw* [the letter 'W'] so that the Identity (الهوية) may be known, and not merely as a pronoun.\n\n### [Absolute Unrestrictedness (الإطلاق) is Restriction (تقييد), and the Only Benefit of Restriction is Differentiation (التمييز)]\n\nKnow—may Allah grant you success—that remembrance (الذكر) is superior to abandoning it, for abandoning it only occurs through witnessing (شهود), and witnessing cannot be absolutely unrestricted (مطلقا). Remembrance, however, possesses absolute unrestrictedness (الإطلاق). But this is the remembrance we have mentioned [the essential, non-verbal remembrance], not the remembrance through glorification (tasbīḥ), affirmation (tahlīl), or other forms of restricted remembrance (الذكر المقيد).\n\nIf the abandonment of remembrance were not due to witnessing, we would examine whether the cause of its abandonment necessitated absolute unrestrictedness, in which case we would judge them to be equal. The spiritual states (الأحوال) are undoubtedly restricted, even though absolute unrestrictedness is itself a restriction, because it has been differentiated from the restricted and flows through the restricted things, however you describe it. By the very thing through which it is differentiated, it has become restricted by that which differentiates it. Thus, absolute unrestrictedness is restriction. The greatest thing that can be said about it is that it is unknown (مجهول) and cannot be known. Yet, even by this description, it has not escaped restriction, because it has been differentiated from the known (المعلوم).\n\n### [Restriction (التقييد) is the Governor, but it is Graduated; Its Highest Level is Restriction within Absolute Unrestrictedness]\n\nIn any case, there is nothing there except the restricted (مقيد), and there is nothing in that which is not there except the restricted. Non-existence (العدم) is that which is not there, and it is differentiated from Existence (الوجود), and Existence is differentiated from Non-existence. Thus, there is nothing known or unknown except that it is differentiated. Therefore, restriction (التقييد) holds the governance. What remains is only graduated restriction, the highest of which is restriction within absolute unrestrictedness, and that is the remembrance of Allah, the ignorance concerning Him, and the bewilderment regarding Him.\n\n### [The Bounty of Existence (فضل الوجود) Grants Remembrance, and the Intimacy of Witnessing (أنس الشهود) Causes One to Forget It]\n\n> And abandoning remembrance is more fitting for witnessing,\n> But the remembrance of Allah is more fitting for Existence (الوجود).\n> So be, if you wish, in the generosity of witnessing,\n> And be, if you wish, in the bounty of Existence.",
    "ur": "باب ایک سو تینتالیس: ترکِ ذکر (الذکر) کے مقام کی معرفت میں\n\nذکر (الذکر) کو وہی ترک کرتا ہے جو اس کا شہود (الشہود) کرتا ہے، اور جو اسے یاد نہیں کرتا وہ اس کا شہود نہیں کرتا۔\n\nپس میں اپنے اور اس کے معاملے میں حیران ہوں، تو ان دونوں کے درمیان عین الحق (الحق) کہاں ہے تاکہ میں اسے ترجیح دوں؟\n\nمیں نے آپ کا ذکر نہیں کیا مگر میرے لیے ایک علم قائم ہو گیا، پھر جب میں اسے دیکھتا ہوں تو وہ فوراً اسے چھپا دیتا ہے۔\n\nپس میں ہمیشہ احوال کے ساتھ اس کا شہود (الشہود) کرتا رہتا ہوں، اور ہمیشہ سانسوں کے ساتھ اس کا ذکر (الذکر) کرتا رہتا ہوں۔\n\nاور وہ ہمیشہ اعیان کے نزدیک میرا شہود کرتا رہتا ہے، اور ہمیشہ اسماء کے ساتھ وہ (ہو) ظاہر ہوتا رہتا ہے۔\n\n(ہو الہویۃ اور ضمیر غائب)\nیہاں \"ہو\" صرف واؤ کے ساتھ لکھا جاتا ہے تاکہ ہویت (الہویۃ) کی پہچان ہو، نہ کہ یہ ضمیر ہے۔\n\n(اطلاق تقیید ہے اور تقیید کا فائدہ تمیز کے سوا کچھ نہیں)\nاللہ آپ کو توفیق دے، جان لیجیے کہ ذکر (الذکر) اس کے ترک سے افضل ہے، کیونکہ اس کا ترک صرف شہود (الشہود) کی بنا پر ہوتا ہے، اور شہود کا مطلق (الإطلاق) ہونا درست نہیں، جبکہ ذکر کے لیے اطلاق ہے۔ لیکن یہ وہ ذکر ہے جس کا ہم نے ذکر کیا ہے، نہ کہ وہ ذکر جو تسبیح، تہلیل اور دیگر مقید (المقید) اذکار سے ہوتا ہے۔ اگر ترکِ ذکر شہود کے بغیر ہوتا، تو ہم دیکھتے کہ کیا اس کے ترک کا سبب ان چیزوں میں سے تھا جو اطلاق (الإطلاق) کا تقاضا کرتی ہیں، تاکہ ہم اس میں برابری کا حکم لگاتے؟ اور احوال بلاشبہ مقید (مقیدۃ) ہیں، اگرچہ اطلاق (الإطلاق) بھی ایک تقیید (التقييد) ہے، کیونکہ وہ مقید سے ممتاز ہو چکا ہے اور مقیدات میں سرایت کر چکا ہے، جیسا کہ میں نے کہا۔ اور جس چیز سے وہ ممتاز ہوا ہے، اسی سے وہ مقید ہو گیا ہے جس سے ہم اسے ممتاز کرتے ہیں۔ پس اطلاق بھی تقیید ہے۔ اور اس کے بارے میں سب سے بڑی بات یہ کہی جاتی ہے کہ وہ مجہول ہے، جسے جانا نہیں جا سکتا۔ پس وہ اس وصف کے ساتھ تقیید (التقييد) سے باہر نہیں نکلا، کیونکہ وہ معلوم سے ممتاز ہو چکا ہے۔\n\n(تقیید حاکم ہے لیکن وہ متفاضل ہے، اس کا اعلیٰ درجہ اطلاق میں تقیید ہے)\nپس بہر حال، وہاں مقید (مقید) کے سوا کچھ نہیں ہے، اور جو کچھ \"وہاں نہیں\" ہے، اس میں بھی مقید کے سوا کچھ نہیں ہے۔ پس عدم (العدم) وہ ہے جو \"وہاں نہیں\" ہے، اور وہ وجود (الوجود) سے ممتاز ہے، اور وجود عدم سے ممتاز ہے۔ پس وہاں کوئی معلوم یا مجہول نہیں ہے مگر یہ کہ وہ ممتاز ہے۔ لہٰذا تقیید (التقييد) ہی حاکم ہے۔ اور باقی صرف متفاضل تقیید ہے، جس کا اعلیٰ درجہ اطلاق (الإطلاق) میں تقیید ہے، اور وہ اللہ کا ذکر (الذکر)، اس کے بارے میں جہل، اور اس میں حیرت ہے۔\n\n(فضلِ وجود ذکر عطا کرتا ہے اور انسِ شہود اسے بھلا دیتا ہے)\nاور ترکِ ذکر (الذکر) شہود (الشہود) کے لیے زیادہ اولیٰ ہے، پس اللہ کا ذکر وجود (الوجود) کے لیے زیادہ اولیٰ ہے۔\n\nپس اگر تم چاہو تو جودِ شہود میں ہو جاؤ، اور اگر تم چاہو تو فضلِ وجود (الوجود) میں ہو جاؤ۔",
    "fa": "(باب صد و چهل و سوم در معرفت مقام ترک ذکر)\n\n> لا يترك الذكر إلا من يشاهده *** وليس يشهده من ليس يذكره‏\nذکر را ترک نمی‌کند مگر کسی که او را مشاهده کند *** و کسی که او را ذکر نمی‌کند، او را مشاهده نمی‌کند.\n\n> فقد تحيرت في أمري وفيه فأين *** الحق بينهما عينا فأوثره‏\nپس در کار خود و در او (الحق) متحیر مانده‌ام، پس حق در میان آن دو کجاست *** تا آن را به عین (حقیقت) برگزینم؟\n\n> ما إن ذكرتك إلا قام لي علم *** فحين أبصره في الحين يستره‏\nتو را ذکر نکردم مگر آنکه دانشی برایم برخاست *** و چون آن را ببینم، در همان لحظه آن را می‌پوشاند.\n\n> فلا أزال مع الأحوال أشهده *** ولا أزال مع الأنفاس أذكره‏\nپس پیوسته با احوال (أحوال) او را شهود می‌کنم *** و پیوسته با هر نفس او را ذکر می‌کنم.\n\n> ولا يزال لدى الأعيان يشهدني *** ولا يزال مع الأسماء يظهر هو\nو پیوسته نزد اعیان (أعيان) مرا مشاهده می‌کند *** و پیوسته با اسماء (أسماء) او (هو) ظاهر می‌شود.\n\n[هو (هو) همان هویت (هوية) و ضمیر غایب است]\n\nدر اینجا \"هو\" جز با واو نوشته نمی‌شود تا هویت (هوية) شناخته شود، نه اینکه صرفاً ضمیر باشد.\n\n[اطلاق (الإطلاق) خود تقیید (تقييد) است و فایده‌ای برای تقیید جز تمییز (التمييز) نیست]\n\nبدان، خداوند تو را توفیق دهد، که ذکر (الذکر) برتر از ترک آن است؛ زیرا ترک آن تنها از طریق شهود (الشهود) حاصل می‌شود، و شهود صحیح نیست که مطلق (مطلق) باشد، در حالی که ذکر دارای اطلاق (الإطلاق) است. اما ذکری که ما از آن سخن می‌گوییم، نه ذکر به تسبیح و تهلیل و سایر اذکار مقید (مقید). اگر ترک ذکر ناشی از شهود نبود، بررسی می‌کردیم که آیا سبب ترک آن چیزی است که مقتضی اطلاق باشد، تا در آن حکم به تساوی کنیم. احوال (الأحوال) بدون شک مقید هستند، هرچند که اطلاق خود تقیید (تقييد) است؛ زیرا از مقید متمایز شده و در مقیدات جریان یافته است، هر طور که بگویی. و به همان چیزی که متمایز شده، مقید گشته است به آنچه با آن تمییز می‌دهیم. پس اطلاق، تقیید است. و بزرگترین چیزی که درباره آن گفته می‌شود این است که مجهول است و شناخته نمی‌شود؛ اما با این وصف از تقیید خارج نشده است، زیرا از معلوم متمایز گشته است.\n\n[تقیید (التقييد) حاکم است، اما دارای مراتب است که بالاترین آن تقیید در اطلاق (إطلاق) است]\n\nپس در هر حال، در آنجا جز مقید (مقید) نیست، و در آنچه آنجا نیست (عدم)، جز مقید نیست. پس عدم (العدم) همان چیزی است که آنجا نیست و از وجود (الوجود) متمایز است، و وجود از عدم متمایز است. پس هیچ معلوم و مجهولی نیست مگر آنکه متمایز است. بنابراین، حکم از آنِ تقیید است، و جز تقیید متفاضل (دارای مراتب) باقی نمانده است که بالاترین آن تقیید در اطلاق است، و آن ذکر خدا و جهل به او و حیرت (الحيرة) در اوست.\n\n[فضل وجود (الوجود) ذکر را می‌بخشد و اُنس شهود (الشهود) آن را از یاد می‌برد]\n\n> وترك الذكر أولى بالشهود *** فذكر الله أولى بالوجود\nو ترک ذکر به شهود (الشهود) سزاوارتر است *** پس ذکر خدا به وجود (الوجود) سزاوارتر است.\n\n> فكن إن شئت في جود الشهود *** وكن إن شئت في فضل الوجود\nپس اگر خواهی در بخشش شهود (الشهود) باش *** و اگر خواهی در فضل وجود (الوجود) باش."
  },
  "page_count": 1
}