{
  "id": 181,
  "title": {
    "ar": "الباب الأحد والثمانون ومائة في معرفة مقام احترام الشيوخ",
    "en": "Chapter One Hundred and Eighty-One: Concerning the Knowledge (معرفة) of the Station (مقام) of Reverence for the Spiritual Masters.",
    "ur": "باب ایک سو اکیاسی: شیوخ کے احترام کے مقام کی معرفت میں",
    "fa": "باب صد و هشتاد و یکم در معرفت مقام احترام شیوخ"
  },
  "content": {
    "ar": "## (الباب الأحد والثمانون ومائة في معرفة مقام احترام الشيوخ)\n\n\n> ما حرمة الشيخ إلا حرمة الله *** فقم بها أدبا لله بالله‏\n\n\n> هم الأدلاء والقربى تؤيدهم *** على الدلالة تأييدا على الله‏\n\n\n> الوارثون هم للرسل أجمعهم *** فما حديثهم إلا عن الله‏\n\n\n> كالأنبياء تراهم في محاربهم *** لا يسألون من الله سوى الله‏\n\n\n> فإن بدا منهم حال تولهم *** عن الشريعة فاتركهم مع الله‏\n\n\n> لا تتبعهم ولا تسلك لهم أثرا *** فإنهم طلقاء الله في الله‏\n\n\n> لا تقتدي بالذي زالت شريعته *** عنه ولو جاء بالإنباء عن الله‏\n\n\nولما رأينا في هذا الزمان جهل المريدين بمراتب شيوخهم قلنا في ذلك‏\n> جهلت مقادير الشيوخ *** أهل المشاهد والرسوخ‏\n\n\n> واستنزلت ألفاظهم *** جهلا وكان لها الشموخ‏\n\n\n### [العلماء بالله بمنزلة الطبيب من العالم‏]\n\n\nالشيوخ نواب الحق في العالم كالرسل عليه السلام في زمانهم بل هم الورثة الذين ورثوا علم الشرائع عن الأنبياء عليه السلام غير أنهم لا يشرعون فلهم رضي الله عنهم حفظ الشريعة في العموم ما لهم التشريع ولهم حفظ القلوب ومراعاة الآداب في الخصوص هم من العلماء بالله بمنزلة الطبيب من العالم بعلم الطبيعة فالطبيب لا يعرف الطبيعة إلا بما هي مدبرة للبدن الإنساني خاصة والعالم بعلم الطبيعة يعرفها مطلقا وإن لم يكن طبيبا وقد يجمع الشيخ بين الأمرين ولكن حظ الشيخوخة من العلم بالله أن يعرف من الناس موارد حركاتهم ومصادرها والعلم بالخواطر مذمومها ومحمودها وموضع اللبس الداخل فيها من ظهور الخاطر المذموم في صورة المحمود ويعرف الأنفاس والنظرة ويعرف ما لهما وما يحويان عليه من الخير الذي يرضى الله ومن الشر الذي يسخط الله ويعرف العلل والأدوية ويعرف الأزمنة والسن والأمكنة والأغذية وما يصلح المزاج وما يفسده والفرق بين الكشف الحقيقي والكشف الخيالي ويعلم التجلي الإلهي ويعلم التربية وانتقال المريد من الطفولة إلى الشباب إلى الكهولة ويعلم متى يترك التحكم في طبيعة المريد ويتحكم في عقله ومتى يصدق المريد خواطره ويعلم ما للنفس من الأحكام وما للشيطان من الأحكام وما تحت قدرة الشيطان ويعلم الحجب التي تعصم الإنسان من إلقاء الشياطين في قلبه ويعلم ما تكنه نفس المريد مما لا يشعر به المريد ويفرق للمريد إذا فتح عليه في باطنه بين الفتح الروحاني وبين الفتح الإلهي ويعلم بالشم أهل الطريق الذين يصلحون له من الذين لا يصلحون ويعلم التحلية التي يحلي بها نفوس المريدين الذين هم عرائس الحق وهم له كالماشطة للعروس تزينها فهم أدباء الله عالمون بآداب الحضرة وما تستحقه من الحرمة\n\n\n### [إن الشيخ عبارة عمن جمع جميع ما يحتاج إليه المريد السالك في حال تربيته وسلوكه‏]\n\n\nوالجامع لمقام الشيخوخة إن الشيخ عبارة عمن جمع جميع ما يحتاج إليه المريد السالك في حال تربيته وسلوكه وكشفه إلى أن ينتهي إلى الأهلية للشيخوخة وجميع ما يحتاج إليه المريد إذا مرض خاطره وقلبه بشبهة وقعت له لا يعرف صحتها من سقمها كما وقع لسهل في سجود القلب وكما وقع لشيخنا حين قيل له أنت عيسى بن مريم فيداويه الشيخ بما ينبغي وكذلك إذا ابتلي من يخرج ليسمع من الحق من خارج لا من نفسه بمحرم يؤمر بفعله أو ينهى عن واجب فيكون الشيخ عارفا بتخليصه من ذلك حتى لا يجري عليه لسان ذنب مع صحة المقام الذي هو فيه فهم أطباء دين الله فمهما نقصهم شي‏ء مما يحتاجون إليه في التربية فلا يحل له أن يقعد على منصة الشيخوخة فإنه يفسد أكثر مما يصلح ويفتن كالمتطبب يعل الصحيح ويقتل المريض فإذا انتهى إلى هذا الحد فهو شيخ في طريق الله يجب على كل مريد حرمته والقيام بخدمته والوقوف عند مراسمه لا يكتم عنه شيئا مما يعلم أن الله يعلمه منه يخدمه ما دامت له حرمة عنده فإن سقطت حرمته من قلبه فلا يقعد عنده ساعة واحدة فإنه لا ينتفع به ويتضرر فإن الصحبة إنما تقع المنفعة فيها بالحرمة فمتى ما رجعت الحرمة له في قلبه حينئذ يخدمه وينتفع به فإن الشيوخ على حالين شيوخ عارفون بالكتاب والسنة قائلون بها في ظواهرهم متحققون بها في سرائرهم يراعون حدود الله ويوفون بعهد الله قائمون بمراسم الشريعة لا يتأولون في الورع آخذون بالاحتياط مجانبون لأهل التخليط مشفقون على الأمة لا يمقتون أحدا من العصاة يحبون ما أحب الله ويبغضون ما أبغض الله ببغض الله لا تأخذهم في الله لومة لائم يَأْمُرُونَ بِالْمَعْرُوفِ ويَنْهَوْنَ عَنِ الْمُنْكَرِ المجمع عليه يُسارِعُونَ في الْخَيْراتِ ويعفون عن الناس يوقرون الكبير ويرحمون الصغير ويميطون الأذى عن طريق الله وطريق الناس يدعون في الخير بالأوجب فالأوجب يؤدون الحقوق إلى أهلها يبرون إخوانهم بل الناس أجمعهم لا يقتصرون بالجود على معارفهم جودهم مطلق الكبير لهم أب والمثل لهم أخ وكفؤ والصغير لهم ابن وجميع الخلق لهم عائلة يتفقدون حوائجهم إن أطاعوا رأوا الحق موفقهم في طاعتهم إياه وإن عصوا سارعوا بالتوبة والحياء من الله ولاموا نفوسهم على ما صدر منهم ولا يهربون في معاصيهم إلى القضاء والقدر فإنه سوء أدب مع الله هينون لينون ذوو مقة رُحَماءُ بَيْنَهُمْ تَراهُمْ رُكَّعاً سُجَّداً في نظرهم رحمة لعباد الله كأنهم يبكون الهم عليهم أغلب من الفرح لما يعطيه موطن‏\nالتكليف فمثل هؤلاء هم الذين يقتدي بهم ويجب احترامهم وهم الذين إذا رؤوا ذكر الله وطائفة أخرى من الشيوخ أصحاب أحوال عندهم تبديد ليس لهم في الظاهر ذلك التحفظ تسلم لهم أحوالهم ولا يصحبون ولو ظهر عليهم من خرق العوائد ما عسى إن يظهر لا يعول عليه مع وجود سوء أدب مع الشرع فإنه لا طريق لنا إلى الله إلا ما شرعه فمن قال بأن ثم طريقا إلى الله خلاف ما شرع فقوله زور فلا يقتدى بشيخ لا أدب له وإن كان صادقا في حاله ولكن يحترم‏\n\n\n### [أن حرمة الحق في حرمة الشيخ وعقوقه في عقوقه‏]\n\n\nواعلم أن حرمة الحق في حرمة الشيخ وعقوقه في عقوقه هم حجاب الحق الحافظون أحوال القلوب على المريدين فمن صحب شيخا ممن يقتدي به ولم يحترمه فعقوبته فقدان وجود الحق في قلبه والغفلة عن الله وسوء الأدب عليه يدخل عليه في كلامه ويزاحمه في رتبته فإن وجود الحق إنما يكون للادباء والباب دون غير الأدباء مغلق ولا حرمان أعظم على المريد من عدم احترام الشيوخ قال بعض أهل الله في مجالس أهل الله من قعد معهم في مجالسهم وخالفهم في شي‏ء مما يتحققون به في أحوالهم نزع الله نور الايمان من قلبه فالجلوس معهم خطر وجليسهم على خطر واختلف أصحابنا في حق المريد مع شيخ آخر خلاف شيخه هل حاله معه من جانب الحق مثل شيخه أم لا فكلهم قالوا بوجوب حرمته عليه ولا بد هذا موضع إجماعهم وما عدا هذا فمنهم من قال حاله معه على السواء من حاله مع\n\n\nشيخه ومنهم من فصل وقال لا تكون الصورة واحدة إلا بعد أن يعلم المريد أن ذلك الشيخ الآخر ممن يقتدي به في الطريق وأما إذا لم يعرف ذلك فلا ولهذا وجه وللآخر وجه‏\n\n\nالنبي صَلَّى اللهُ عَليهِ وسَلَّم يقول للمرأة إنما الصبر عند الصدمة الأولى وكانت قد جهلت أنه رسول الله ص‏\n\n\nوالمريد لا يقصد إلا الحق فإذا ظهر مقصوده حيث ظهر قال به وأخذه فإن الرجال إنما يعرفون بالحق لا يعرف الحق بهم والأصل إنه كما لم يكن وجود العالم بين الهين ولا المكلف بين رسولين مختلفي الشرائع ولا امرأة بين زوجين كذلك لا يكون المريد بين شيخين إذا كان مريد تربية فإن كانت صحبة بلا تربية فلا يبالي بصحبة الشيوخ كلهم لأنه ليس تحت حكمهم وهذه الصحبة تسمى صحبة البركة غير أنه لا يجي‏ء منه رجل في طريق الله فالحرمة أصل في الفلاح‏\n\n",
    "en": "## Chapter One Hundred and Eighty-One: Concerning the Knowledge of the Station of Respecting the Spiritual Masters\n\n> The sanctity of the Master is none other than the sanctity of Allah, *** so uphold it as proper conduct (adab) for Allah, by Allah.\n> They are the guides, and proximity (to the Divine) supports them *** in their guidance, a support resting upon Allah.\n> They are the inheritors of all the Messengers, *** so their discourse is only concerning Allah.\n> You see them like the Prophets in their sanctuaries, *** asking nothing from Allah except Allah Himself.\n> But if a state (hal) appears from them that turns them *** away from the Sacred Law (Shari'a), then leave them to Allah.\n> Do not follow them, nor tread in their footsteps, *** for they are the freed ones of Allah, in Allah.\n> Do not take as an example one whose Sacred Law has departed *** from him, even if he brings tidings concerning Allah.\n\nSince we have observed in this time the ignorance of the disciples (muridin) regarding the levels (maratib) of their Masters, we have spoken concerning that:\n\n> The measures of the Masters have been ignored, *** those people of witnessing (mushahadat) and deep establishment (rusukh).\n> And their words have been brought low *** out of ignorance, though they possessed loftiness.\n\n### [Scholars of Allah are in the Position of the Physician to the Scientist]\n\nThe Masters (Shuyukh) are the deputies of The Real (Al-Haqq) in the world, just as the Messengers, peace be upon them, were in their time. Rather, they are the inheritors who inherited the knowledge of the Sacred Laws (Shara'i') from the Prophets, peace be upon them, except that they do not legislate. Thus, may Allah be pleased with them, they are responsible for preserving the Sacred Law in general, but not for legislation. They are responsible for preserving hearts and observing proper conduct (adab) in particular.\n\nThey, the Scholars of Allah (Al-Ulama bi-Allah), are in the position of the physician to the scientist who studies nature. The physician knows nature only as it governs the human body specifically, while the scientist of nature knows it absolutely, even if he is not a physician. The Master may combine both aspects, but the specific portion of the Master's knowledge of Allah is that he knows the sources and origins of people's movements, the praiseworthy and blameworthy passing thoughts (khawatir), and the point of confusion that enters them when a blameworthy thought appears in the form of a praiseworthy one. He knows the breaths and the gaze, and what they contain of good that pleases Allah and evil that angers Allah. He knows the ailments and the remedies, the times, the ages, the places, the foods, what improves the temperament and what corrupts it, and the difference between true unveiling (kashf haqiqi) and imaginary unveiling (kashf khayali). He knows the Divine Self-disclosure (al-tajalli al-ilahi). He knows the spiritual training (tarbiyya) and the transition of the disciple from childhood to youth to maturity. He knows when to cease controlling the disciple's nature and control his intellect, and when the disciple should trust his passing thoughts. He knows the rulings belonging to the soul (nafs) and the rulings belonging to Satan, and what is under Satan's power. He knows the veils that protect the human from the whisperings of the devils in his heart. He knows what the disciple's soul conceals that the disciple himself is unaware of. He distinguishes for the disciple, when his inner being is opened, between spiritual opening (fath ruhani) and Divine opening (fath ilahi). He knows, by scent, which people of the Path are suitable for it and which are not. He knows the adornment (tahliya) with which he adorns the souls of the disciples, who are the brides of The Real (Al-Haqq). He is to them as the beautician is to the bride, adorning her. Thus, they are the cultured ones of Allah, knowledgeable of the proper conduct (adab) of the Divine Presence (al-Hadra) and the respect (hurma) it deserves.\n\n### [The Master is Defined as One Who Has Gathered Everything the Traveling Disciple Needs During His Training and Journey]\n\nThe comprehensive definition of the station of Mastership (Shaykhukha) is that the Master is one who has gathered everything the traveling disciple (murid salik) needs during his spiritual training (tarbiyya), his journeying (suluk), and his unveiling (kashf), until he reaches the eligibility for Mastership himself. This includes everything the disciple needs if his passing thought (khatir) or heart falls ill due to a doubt whose soundness or sickness he cannot discern—as happened to Sahl concerning the prostration of the heart, and as happened to our Master when he was told, \"You are Jesus son of Mary.\" The Master then treats him with what is appropriate.\n\nLikewise, if one who goes out to hear from The Real from outside himself, not from his own soul, is afflicted by a forbidden act he is commanded to perform, or is forbidden from an obligatory act, the Master must be knowledgeable of how to deliver him from that, so that no tongue of sin runs against him, despite the soundness of the station (maqam) he is in. They are the physicians of Allah's religion.\n\nTherefore, if they lack anything required for spiritual training, it is not permissible for them to sit upon the platform of Mastership, for they will cause more corruption than reform, and they will cause temptation, like the quack physician who makes the healthy sick and kills the patient.\n\nWhen a person reaches this level, he is a Master on the Path of Allah. It is obligatory upon every disciple to respect him, to perform service for him, and to abide by his instructions. The disciple must conceal nothing from him that he knows Allah knows about him. He serves him as long as he holds respect for him. If respect for the Master falls from his heart, he should not remain with him for a single hour, for he will not benefit and will only be harmed. Benefit in companionship (suhba) occurs only through respect (hurma). When respect returns to his heart, he may then serve him and benefit from him.\n\nThe Masters are of two types:\n\n1.  Masters who are Gnostics (Arifun) of the Book and the Sunnah, who speak by them outwardly and are realized by them inwardly. They observe the limits of Allah and fulfill the covenant of Allah, upholding the rites of the Sacred Law (Shari'a). They do not resort to esoteric interpretation (ta'wil) in matters of piety (wara'), taking the path of caution (ihtiyat), avoiding those who mix truth with falsehood (ahl al-takhliṭ), and showing compassion for the Community (Ummah). They do not despise any of the disobedient. They love what Allah loves and hate what Allah hates, hating by Allah's hatred. They are not deterred by the blame of any blamer in the cause of Allah. They <<يَأْمُرُونَ بِالْمَعْرُوفِ>> (enjoin the right) and <<يَنْهَوْنَ عَنِ الْمُنْكَرِ>> (forbid the wrong) upon which there is consensus. They <<يُسارِعُونَ في الْخَيْراتِ>> (hasten to good deeds) and forgive people. They honor the elder and show mercy to the young. They remove harm from the path of Allah and the path of people. They call to good in order of priority, fulfilling rights to those who are due them. They are kind to their brethren—indeed, to all people. They do not restrict their generosity to those they know; their generosity is absolute. The elder among people is like a father to them, the peer is like a brother and equal, and the young is like a son. All creation is their family. They look after their needs. If people obey, they see The Real (Al-Haqq) granting them success in their obedience to Him. If people disobey, they hasten to repentance and shame before Allah, blaming their own souls for what occurred from them. They do not flee to Divine Decree (Qada wa Qadar) in their acts of disobedience, for that is poor conduct (su' al-adab) with Allah. They are gentle, soft, loving, <<رُحَماءُ بَيْنَهُمْ تَراهُمْ رُكَّعاً سُجَّداً>> (merciful among themselves; you see them bowing and prostrating). In their view, mercy for the servants of Allah prevails, as if the worry for them is greater than the joy of what the realm of obligation (taklif) grants. Such are those who should be taken as examples, and whose respect is obligatory. They are those who, when seen, Allah is remembered.\n\n2.  Another group of Masters are people of spiritual states (ashab ahwal) who possess a scattering (tabdid) and do not maintain that outward self-restraint. Their states are accepted for them, but they should not be accompanied, even if extraordinary breaches of custom (kharq al-'awa'id) appear from them, for such things should not be relied upon when there is poor conduct toward the Sacred Law. We have no path to Allah except that which He has legislated. Whoever claims that there is a path to Allah contrary to what has been legislated, his claim is false. Therefore, one should not take as an example a Master who lacks proper conduct (adab), even if he is truthful in his state, but he must still be respected.\n\n### [That the Sanctity of The Real is in the Sanctity of the Master, and Disobedience to Him is in Disobedience to the Master]\n\nKnow that the sanctity of The Real (Hurmat al-Haqq) is in the sanctity of the Master, and disobedience to Him (Uquq) is in disobedience to the Master. They are the veils (hujjab) of The Real who preserve the states of the hearts for the disciples.\n\nWhoever accompanies a Master who is exemplary (one who is followed) and does not respect him, his punishment is the loss of the presence of The Real (Wujud al-Haqq) in his heart, heedlessness (ghafla) of Allah, and poor conduct toward Him. This enters upon him in his speech and causes him to compete with the Master in his rank. The presence of The Real is only granted to those of proper conduct (adab); the door is closed to those who lack it. There is no greater deprivation for the disciple than the lack of respect for the Masters.\n\nSome of the People of Allah said concerning the gatherings of the People of Allah: whoever sits with them in their gatherings and contradicts them in anything they are realized by in their states, Allah removes the light of faith from his heart. Sitting with them is dangerous, and their companion is in danger.\n\nOur companions differed regarding the right of the disciple toward another Master, other than his own Master: is his state with him, from the side of The Real, the same as with his own Master, or not? All of them agreed on the necessity of respecting him—this is the point of their consensus. As for what is beyond this, some said his state with him is equal to his state with his own Master. Others differentiated, saying the situation is not the same unless the disciple knows that the other Master is one who is taken as an example on the Path. If he does not know this, then it is not the same. There is validity to both views.\n\nThe Prophet, peace and blessings be upon him, said to the woman, \"Patience is only at the first shock,\" and she had been ignorant that he was the Messenger of Allah, peace be upon him.\n\nThe disciple intends nothing but The Real (Al-Haqq). If his intended goal appears, wherever it appears, he accepts it and takes it. Men are known by The Real; The Real is not known by men.\n\nThe fundamental principle is that just as the existence of the world cannot be between two deities, nor the obligated person between two Messengers with differing Sacred Laws, nor a woman between two husbands, likewise the disciple cannot be between two Masters if he is a disciple undergoing spiritual training (murid tarbiyya). If the companionship is without training, then he need not worry about accompanying all the Masters, because he is not under their rule. This companionship is called companionship for blessing (suhbat al-baraka), but a true man on the Path of Allah will not emerge from it. Respect (al-hurma) is the foundation of success.",
    "ur": "**(باب ۱۸۱: شیوخ کے احترام کے مقام کی معرفت میں)**\n\nشیخ کی حرمت ذات حق کی حرمت کے سوا کچھ نہیں،\nپس اللہ کے لیے، اللہ کے واسطے، ادب کے ساتھ اس پر قائم رہو۔\n\nوہ رہبر ہیں اور قربت (الٰہی) ان کی تائید کرتی ہے،\nرہنمائی پر، اللہ کی طرف سے تائید کے ساتھ۔\n\nوہ تمام رسولوں کے وارث ہیں،\nپس ان کی گفتگو ذات حق کے سوا کسی اور کے بارے میں نہیں ہوتی۔\n\nتم انہیں ان کی عبادت گاہوں میں انبیاء کی مانند دیکھو گے،\nوہ اللہ سے اللہ کے سوا کچھ نہیں مانگتے۔\n\nاگر ان سے کوئی ایسا حال ظاہر ہو جو انہیں شریعت سے پھیر دے،\nتو انہیں ذات حق کے ساتھ چھوڑ دو۔\n\nان کی پیروی نہ کرو اور نہ ان کے نقش قدم پر چلو،\nکیونکہ وہ ذات حق میں اللہ کے آزاد کردہ ہیں۔\n\nاس شخص کی اقتدا نہ کرو جس سے اس کی شریعت زائل ہو گئی ہو،\nخواہ وہ ذات حق کی طرف سے خبریں ہی کیوں نہ لائے۔\n\nاور جب ہم نے اس زمانے میں مریدین کی طرف سے اپنے شیوخ کے مراتب سے ناواقفیت دیکھی تو ہم نے اس بارے میں کہا:\n\nشیوخ کی قدریں، جو مشاہدات اور رسوخ والے ہیں، جانی نہیں گئیں،\nاور ان کے الفاظ کو جہالت کی بنا پر کم سمجھا گیا، حالانکہ ان میں بلندی تھی۔\n\n### [اللہ کے عارفین (العلماء بالله) کی حیثیت عالم کے لیے طبیب کی سی ہے]\n\nشیوخ عالم میں ذات حق (الحق) کے نائب ہیں، جیسے کہ رسول (علیہم السلام) اپنے زمانے میں تھے۔ بلکہ وہ ایسے وارث ہیں جنہوں نے انبیاء (علیہم السلام) سے شرائع کا علم ورثے میں پایا، سوائے اس کے کہ وہ خود شریعت سازی نہیں کرتے۔ پس ان کے لیے (رضی اللہ عنہم) عمومی طور پر شریعت کی حفاظت ہے، نہ کہ تشریع (قانون سازی)۔ اور ان کے لیے خاص طور پر دلوں کی حفاظت اور آداب کی رعایت ہے۔ وہ اللہ کے عارفین (العلماء بالله) میں اس عالم کے لیے طبیب کی حیثیت رکھتے ہیں جو علمِ طبیعت کا ماہر ہو۔ طبیب طبیعت کو صرف اس لحاظ سے جانتا ہے کہ وہ خاص طور پر انسانی بدن کو کیسے منظم کرتی ہے، جبکہ علمِ طبیعت کا عالم اسے مطلق طور پر جانتا ہے، خواہ وہ طبیب نہ بھی ہو۔ شیخ دونوں امور کو جمع کر سکتا ہے، لیکن شیخوخت کا حصہ علمِ باللہ سے یہ ہے کہ وہ لوگوں کی حرکات کے سرچشموں اور ان کے مصادر کو جانتا ہے۔ اور وہ خواطر (خیالات) کو جانتا ہے، ان کے مذموم اور محمود ہونے کو، اور اس التباس کی جگہ کو جو ان میں داخل ہوتا ہے، یعنی مذموم خاطر کا محمود کی صورت میں ظاہر ہونا۔ اور وہ سانسوں اور نگاہوں کو جانتا ہے، اور یہ جانتا ہے کہ ان میں کیا ہے اور وہ کون سی بھلائی رکھتی ہیں جس سے اللہ راضی ہوتا ہے، اور کون سی برائی جس سے اللہ ناراض ہوتا ہے۔ اور وہ بیماریوں اور دواؤں کو جانتا ہے، اور وہ زمانوں، عمروں، جگہوں، غذاؤں کو جانتا ہے، اور یہ بھی جانتا ہے کہ مزاج کو کیا چیز درست کرتی ہے اور کیا بگاڑتی ہے۔ اور وہ حقیقی کشف (الکشف الحقيقي) اور خیالی کشف (الکشف الخيالي) کے درمیان فرق کو جانتا ہے۔ اور وہ ظہور الٰہی (التجلی الإلهي) کو جانتا ہے، اور وہ تربیت کو جانتا ہے، اور مرید کا بچپن سے جوانی اور پھر ادھیڑ عمری کی طرف منتقل ہونا جانتا ہے۔ اور وہ جانتا ہے کہ کب مرید کی طبیعت پر قابو پانا چھوڑ کر اس کی عقل پر قابو پانا ہے، اور کب مرید اپنے خواطر کی تصدیق کرے۔ اور وہ جانتا ہے کہ نفس کے کیا احکام ہیں اور شیطان کے کیا احکام ہیں، اور کیا چیز شیطان کی قدرت کے تحت ہے۔ اور وہ ان پردوں کو جانتا ہے جو انسان کو شیاطین کے دل میں القاء کرنے سے بچاتے ہیں۔ اور وہ جانتا ہے کہ مرید کے نفس میں کیا پوشیدہ ہے جس سے مرید خود بھی واقف نہیں ہوتا۔ اور جب مرید پر اس کے باطن میں فتح (کشف) ہوتی ہے تو وہ مرید کے لیے روحانی فتح (الفتح الروحاني) اور الٰہی فتح (الفتح الإلهي) کے درمیان فرق کرتا ہے۔ اور وہ سونگھ کر (بالشم) اہلِ طریق کو جانتا ہے کہ کون اس کے لیے موزوں ہیں اور کون نہیں۔ اور وہ اس آرائش (التحلية) کو جانتا ہے جس سے وہ مریدین کے نفوس کو آراستہ کرتے ہیں جو ذات حق (الحق) کی دلہنیں ہیں، اور وہ ان کے لیے دلہن کو سجانے والی ماشطہ کی مانند ہیں، پس وہ اللہ کے ادیب ہیں، جو بارگاہِ الٰہی (الحضرة) کے آداب اور اس کے مستحق احترام سے واقف ہیں۔\n\n### [شیخ اس شخص کا نام ہے جو وہ سب کچھ جمع کر لے جس کی مرید سالک کو اپنی تربیت اور سلوک کی حالت میں ضرورت ہوتی ہے]\n\nاور مقامِ شیخوخت کو جامع شخص یہ ہے کہ شیخ اس شخص کا نام ہے جو وہ سب کچھ جمع کر لے جس کی مرید سالک (المريد السالك) کو اپنی تربیت (تربيته)، سلوک (سلوكه) اور کشف (كشفه) کی حالت میں ضرورت ہوتی ہے، یہاں تک کہ وہ شیخوخت کی اہلیت تک پہنچ جائے۔ اور وہ سب کچھ بھی جو مرید کو اس وقت درکار ہو جب اس کا خاطر اور دل کسی شبہ کی وجہ سے بیمار ہو جائے جس کی صحت یا سقم (بیماری) کو وہ نہ جانتا ہو، جیسا کہ سہل کو قلب کے سجدے کے معاملے میں پیش آیا، اور جیسا کہ ہمارے شیخ کو اس وقت پیش آیا جب ان سے کہا گیا کہ تم عیسیٰ ابن مریم ہو۔ پس شیخ اس کا علاج اس طریقے سے کرتا ہے جو مناسب ہو۔ اسی طرح اگر کوئی شخص جو باہر سے (اپنے نفس سے نہیں) ذات حق کی طرف سے سننے کے لیے نکلتا ہے، کسی حرام کام میں مبتلا ہو جائے جس کے کرنے کا اسے حکم دیا جائے، یا کسی واجب سے منع کیا جائے، تو شیخ اسے اس سے نجات دلانے کا عارف ہوتا ہے، تاکہ اس کے مقام کی صحت کے باوجود اس پر گناہ کا الزام نہ لگے۔ پس وہ اللہ کے دین کے طبیب ہیں۔ لہٰذا، اگر ان میں تربیت کے لیے درکار کسی چیز کی کمی ہو، تو ان کے لیے شیخوخت کے منصب پر بیٹھنا جائز نہیں، کیونکہ وہ اصلاح سے زیادہ فساد پھیلائے گا اور فتنہ ڈالے گا، جیسے کہ نیم حکیم جو تندرست کو بیمار کر دیتا ہے اور مریض کو مار ڈالتا ہے۔ پس جب وہ اس حد تک پہنچ جائے تو وہ اللہ کے راستے کا شیخ ہے، جس پر ہر مرید کے لیے اس کی حرمت کرنا، اس کی خدمت کرنا اور اس کے طریقوں پر قائم رہنا واجب ہے۔ وہ اس سے کوئی ایسی چیز نہیں چھپاتا جس کے بارے میں وہ جانتا ہو کہ اللہ اسے اس کے بارے میں جانتا ہے۔ وہ اس کی خدمت کرتا ہے جب تک اس کے دل میں اس کی حرمت باقی رہے۔ اگر اس کے دل سے اس کی حرمت ختم ہو جائے تو وہ ایک گھڑی بھی اس کے پاس نہ بیٹھے، کیونکہ اسے اس سے کوئی فائدہ نہیں ہوگا بلکہ نقصان ہوگا۔ صحبت میں فائدہ صرف حرمت کے ذریعے ہی حاصل ہوتا ہے۔ پس جب اس کے دل میں اس کی حرمت واپس آ جائے، تب وہ اس کی خدمت کرے اور اس سے فائدہ اٹھائے۔\n\nشیوخ دو حالتوں پر ہوتے ہیں:\n\n۱. ایسے شیوخ جو کتاب و سنت کے عارف ہیں، اپنے ظاہر میں ان پر عمل پیرا ہیں، اور اپنے باطن میں ان کے ساتھ متحقق ہیں۔ وہ اللہ کی حدود کی رعایت کرتے ہیں اور اللہ کے عہد کو پورا کرتے ہیں۔ وہ شریعت کے طریقوں پر قائم رہتے ہیں، ورع (پرہیزگاری) میں تاویل نہیں کرتے، احتیاط کو اختیار کرتے ہیں، اہل تخلیط (گڑبڑ کرنے والوں) سے دور رہتے ہیں، امت پر شفقت کرتے ہیں، کسی بھی گناہ گار سے نفرت نہیں کرتے۔ وہ اس سے محبت کرتے ہیں جس سے اللہ محبت کرتا ہے اور اس سے بغض رکھتے ہیں جس سے اللہ بغض رکھتا ہے، اور یہ بغض اللہ کے لیے ہوتا ہے۔ اللہ کے معاملے میں انہیں کسی ملامت کرنے والے کی ملامت کا خوف نہیں ہوتا۔ وہ نیکی کا حکم دیتے ہیں اور متفقہ برائی سے منع کرتے ہیں۔ وہ نیکیوں میں تیزی کرتے ہیں اور لوگوں کو معاف کرتے ہیں۔ وہ بڑے کی تعظیم کرتے ہیں اور چھوٹے پر رحم کرتے ہیں۔ وہ اللہ کے راستے اور لوگوں کے راستے سے تکلیف دہ چیز کو ہٹاتے ہیں۔ وہ خیر کے لیے زیادہ واجب سے کم واجب کی طرف دعوت دیتے ہیں۔ وہ حقوق کو ان کے اہل تک پہنچاتے ہیں۔ وہ اپنے بھائیوں بلکہ تمام لوگوں کے ساتھ نیکی کرتے ہیں۔ وہ اپنی سخاوت کو صرف اپنے جاننے والوں تک محدود نہیں رکھتے، ان کی سخاوت مطلق ہوتی ہے۔ بڑا ان کے لیے باپ ہے، ہم عمر ان کے لیے بھائی اور ہم پلہ ہے، اور چھوٹا ان کے لیے بیٹا ہے۔ اور تمام مخلوق ان کے لیے ایک خاندان ہے۔ وہ ان کی ضروریات کا خیال رکھتے ہیں۔ اگر وہ اطاعت کریں تو وہ ذات حق کو ان کی اطاعت میں توفیق دینے والا دیکھتے ہیں۔ اور اگر وہ نافرمانی کریں تو وہ توبہ اور اللہ سے حیا کرنے میں جلدی کرتے ہیں، اور جو کچھ ان سے سرزد ہوا اس پر اپنے نفس کو ملامت کرتے ہیں۔ اور وہ اپنی نافرمانیوں میں قضا و قدر کی طرف نہیں بھاگتے، کیونکہ یہ اللہ کے ساتھ سوءِ ادب ہے۔ وہ نرم خو، ملنسار، محبت والے ہوتے ہیں۔ وہ آپس میں رحم دل ہوتے ہیں۔ تم انہیں رکوع کرنے والا، سجدہ کرنے والا دیکھو گے۔ ان کی نظر میں اللہ کے بندوں کے لیے رحمت ہوتی ہے، گویا وہ ان کی پریشانیوں پر رو رہے ہیں۔ ان پر غم، اس خوشی سے زیادہ غالب ہوتا ہے جو انہیں مقامِ تکلیف (دنیا) عطا کرتا ہے۔ ایسے ہی لوگ ہیں جن کی اقتدا کی جاتی ہے اور جن کا احترام واجب ہے۔ اور یہ وہ لوگ ہیں جنہیں دیکھ کر اللہ یاد آ جاتا ہے۔\n\n۲. شیوخ کا دوسرا گروہ وہ ہے جو اصحابِ احوال ہیں، جن کے پاس تبدید (انتشار) ہوتا ہے، ان کے ظاہر میں وہ تحفظ نہیں ہوتا۔ ان کے احوال ان کے لیے محفوظ رہتے ہیں، لیکن ان کی صحبت اختیار نہیں کی جاتی، خواہ ان سے خلافِ عادت (خرق العوائد) کوئی بھی چیز ظاہر ہو، اس پر بھروسہ نہیں کیا جاتا اگر شریعت کے ساتھ سوءِ ادب موجود ہو۔ کیونکہ اللہ تک پہنچنے کا ہمارا کوئی راستہ نہیں سوائے اس کے جو اس نے مشروع کیا ہے۔ پس جو یہ کہے کہ اللہ تک پہنچنے کا کوئی راستہ اس کے مشروع کردہ راستے کے خلاف ہے، تو اس کا قول جھوٹ ہے۔ لہٰذا، ایسے شیخ کی اقتدا نہیں کی جائے گی جس میں ادب نہ ہو، اگرچہ وہ اپنے حال میں سچا ہی کیوں نہ ہو، لیکن اس کا احترام کیا جائے گا۔\n\n### [شیخ کی حرمت میں ذات حق کی حرمت ہے اور اس کی نافرمانی میں ذات حق کی نافرمانی ہے]\n\nاور جان لو کہ شیخ کی حرمت میں ذات حق (الحق) کی حرمت ہے اور اس کی نافرمانی (عقوقه) میں ذات حق کی نافرمانی ہے۔ وہ ذات حق کے پردے ہیں جو مریدین کے دلوں کے احوال کی حفاظت کرتے ہیں۔ پس جس نے کسی ایسے شیخ کی صحبت اختیار کی جس کی اقتدا کی جاتی ہے اور اس کا احترام نہ کیا، تو اس کی سزا یہ ہے کہ اس کے دل میں ذات حق کا وجود ختم ہو جائے گا، اور وہ اللہ سے غافل ہو جائے گا، اور اس پر سوءِ ادب داخل ہو جائے گا، جو اس کی گفتگو میں ظاہر ہوگا اور وہ اس کے مرتبے میں مداخلت کرے گا۔ کیونکہ ذات حق کا وجود صرف باادب لوگوں کے لیے ہوتا ہے، اور بے ادب لوگوں کے لیے دروازہ بند ہے۔ اور مرید کے لیے شیوخ کا احترام نہ کرنے سے بڑھ کر کوئی محرومی نہیں۔ بعض اہلِ اللہ نے اہلِ اللہ کی مجالس کے بارے میں کہا ہے کہ جو شخص ان کی مجالس میں بیٹھا اور ان کے احوال میں جس چیز پر وہ متحقق ہیں، اس میں ان کی مخالفت کی، تو اللہ اس کے دل سے ایمان کا نور نکال لیتا ہے۔ پس ان کے ساتھ بیٹھنا خطرناک ہے اور ان کا ہم نشین خطرے میں ہے۔\n\nہمارے اصحاب میں اس بارے میں اختلاف ہوا ہے کہ کیا مرید کا اپنے شیخ کے علاوہ کسی دوسرے شیخ کے ساتھ معاملہ ذات حق کی طرف سے ویسا ہی ہے جیسا کہ اس کے اپنے شیخ کے ساتھ ہے یا نہیں؟ ان سب نے اس پر اس کی حرمت کے واجب ہونے کا قول کیا ہے، اور یہ ضروری ہے۔ یہ ان کا اجماع کا مقام ہے۔ اس کے علاوہ، بعض نے کہا کہ اس کا معاملہ دوسرے شیخ کے ساتھ بھی اس کے اپنے شیخ کے ساتھ معاملے کے برابر ہے۔ اور بعض نے تفصیل بیان کی اور کہا کہ صورت حال ایک جیسی نہیں ہوگی، مگر اس کے بعد جب مرید یہ جان لے کہ وہ دوسرا شیخ بھی طریق میں اقتدا کے لائق ہے۔ اور اگر وہ یہ نہ جانے تو نہیں۔ اس کی بھی ایک وجہ ہے اور دوسرے قول کی بھی ایک وجہ ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے ایک عورت سے فرمایا:\n**\"إِنَّمَا الصَّبْرُ عِنْدَ الصَّدْمَةِ الْأُولَى\"**\n(صبر تو پہلی چوٹ پر ہوتا ہے۔)\nحالانکہ وہ عورت اس وقت یہ نہیں جانتی تھی کہ آپ صلی اللہ علیہ وسلم اللہ کے رسول ہیں۔\n\nمرید کا مقصد صرف ذات حق (الحق) ہوتا ہے۔ پس جب اس کا مقصود جہاں بھی ظاہر ہو، وہ اسے قبول کرتا ہے اور لے لیتا ہے۔ کیونکہ مردوں کو ذات حق کے ذریعے پہچانا جاتا ہے، ذات حق کو ان کے ذریعے نہیں پہچانا جاتا۔ اور اصل یہ ہے کہ جس طرح عالم کا وجود دو معبودوں کے درمیان نہیں ہو سکتا، اور نہ ہی مکلف دو مختلف شرائع والے رسولوں کے درمیان ہو سکتا ہے، اور نہ ہی عورت دو شوہروں کے درمیان ہو سکتی ہے، اسی طرح مرید بھی دو شیوخ کے درمیان نہیں ہو سکتا، اگر وہ تربیت کا مرید ہو۔ لیکن اگر صحبت بغیر تربیت کے ہو، تو اسے تمام شیوخ کی صحبت سے کوئی پرواہ نہیں، کیونکہ وہ ان کے حکم کے تحت نہیں ہے۔ اس صحبت کو صحبتِ برکت کہا جاتا ہے، تاہم اس سے اللہ کے راستے میں کوئی مرد (کامل) پیدا نہیں ہوتا۔ پس فلاح (کامیابی) میں حرمت (احترام) اصل ہے۔",
    "fa": "باب صد و هشتاد و یکم در معرفت مقام احترام شیوخ\n\nحرمت شیخ چیزی جز حرمت حق (الله) نیست؛\nپس به پاس ادب برای حق (الله)، به حق (بالله)، به آن قیام کن.\n\nآنان راهنمایانند و خویشاوندی (معنوی) آنان را\nبر راهنمایی، تأییدی از جانب حق (الله) است.\n\nآنان وارثان تمامی پیامبرانند؛\nپس سخنشان جز از حق (الله) نیست.\n\nآنان را همچون پیامبران در محراب‌هایشان می‌بینی؛\nاز حق (الله) جز حق (الله) نمی‌خواهند.\n\nاگر حالی از آنان پدیدار شد که از شریعت روی گردانده‌اند،\nآنان را با حق (الله) واگذار.\n\nاز آنان پیروی مکن و راهشان را مپوی،\nزیرا آنان آزادشدگان حق (الله) در حق (الله) هستند.\n\nبه کسی که شریعت از او زائل شده است، اقتدا مکن،\nحتی اگر از حق (الله) خبر آورد.\n\nو چون در این زمان، نادانی مریدان نسبت به مراتب شیوخشان را دیدیم، در این باره گفتیم:\n\nقدر و منزلت شیوخ،\nاهل مشاهد (شهود) و رسوخ (استواری) نادیده گرفته شد.\n\nو سخنانشان از روی نادانی پایین آورده شد،\nدر حالی که شأن والایی داشت.\n\n### [عالمان به حق (العلماء بالله) به منزله طبیب نسبت به عالم (به علم طبیعت) هستند]\n\nشیوخ، نائبان حق (الحق) در عالم هستند، همچون پیامبران (علیهم السلام) در زمان خودشان. بلکه آنان وارثانی هستند که علم شرایع را از انبیا (علیهم السلام) به ارث برده‌اند، با این تفاوت که خود تشریع نمی‌کنند. پس برای آنان (رضی الله عنهم) حفظ شریعت در عموم است، نه تشریع. و در خصوص، حفظ قلوب و رعایت آداب بر عهده آنان است.\n\nآنان از میان عالمان به حق (العلماء بالله)، به منزله طبیب نسبت به عالم به علم طبیعت هستند. طبیب طبیعت را نمی‌شناسد مگر از آن جهت که مدبر بدن انسانی است، به طور خاص؛ در حالی که عالم به علم طبیعت، آن را به طور مطلق می‌شناسد، هرچند طبیب نباشد. چه بسا شیخ هر دو امر را جمع کند. اما بهره مقام شیخوخیت از علم به حق (العلم بالله) این است که منابع و مصادر حرکات مردم را بشناسد، و به خواطر (خطورات ذهنی) مذموم و محمود و موضع اشتباهی که در آن وارد می‌شود (مانند ظهور خاطر مذموم در صورت محمود) آگاه باشد.\n\nو انفاس و نگاه را می‌شناسد، و می‌داند که این دو چه خیری را که حق (الله) از آن راضی است و چه شری را که حق (الله) از آن خشمگین است، در بر دارند. و علل و داروها را می‌شناسد، و زمان‌ها، سنین، مکان‌ها، غذاها، آنچه مزاج را اصلاح می‌کند و آنچه آن را فاسد می‌سازد، و فرق میان کشف (الکشف) حقیقی و کشف (الکشف) خیالی را می‌داند. و تجلی الهی (التجلی الإلهي) را می‌داند، و تربیت و انتقال مرید از کودکی به جوانی و سپس به میانسالی را می‌داند.\n\nو می‌داند چه زمانی باید کنترل طبیعت مرید را رها کند و عقل او را کنترل نماید، و چه زمانی مرید خواطر خود را تصدیق کند. و احکام نفس و احکام شیطان و آنچه تحت قدرت شیطان است را می‌داند. و حجاب‌هایی که انسان را از القائات شیاطین در قلبش حفظ می‌کند، می‌شناسد. و آنچه را که نفس مرید پنهان می‌دارد و مرید خود از آن آگاه نیست، می‌داند. و هنگامی که در باطن مرید فتحی (گشایشی) حاصل می‌شود، میان فتح روحانی و فتح الهی (الفتح الإلهي) برای او فرق می‌گذارد. و با شمّ (بویایی معنوی) اهل طریقت را که برای این راه شایسته‌اند از کسانی که شایسته نیستند، می‌شناسد. و تحلیه‌ای (آراستنی) را که با آن نفوس مریدان را که عروسان حق (الحق) هستند، می‌آراید، می‌داند. و شیوخ برای مریدان همچون آرایشگر برای عروس هستند که او را می‌آراید. پس آنان ادیبان حق (الله) هستند که به آداب حضرت (الحضرة) و آنچه از حرمت سزاوار آن است، آگاهند.\n\n### [شیخ عبارت است از کسی که تمام آنچه را که مرید سالک در حال تربیت و سلوک خود نیاز دارد، جمع کرده باشد]\n\nو جامع مقام شیخوخیت این است که شیخ عبارت است از کسی که تمام آنچه را که مرید سالک در حال تربیت، سلوک و کشف (الکشف) خود نیاز دارد، تا زمانی که به اهلیت شیخوخیت برسد، جمع کرده باشد. و نیز تمام آنچه را که مرید بدان نیاز دارد، هنگامی که خاطر و قلبش به شبهه‌ای بیمار شود که صحت و سقم آن را نمی‌داند، مانند آنچه برای سهل در سجود قلب رخ داد، و مانند آنچه برای شیخ ما رخ داد هنگامی که به او گفته شد: «تو عیسی بن مریم هستی»؛ پس شیخ او را به آنچه شایسته است، مداوا می‌کند.\n\nو همچنین اگر کسی که برای شنیدن از حق (الحق) از خارج (نه از نفس خود) بیرون می‌آید، به حرامی مبتلا شود که به انجام آن امر می‌شود یا از واجبی نهی می‌گردد، شیخ باید به رهایی او از آن آگاه باشد تا با وجود صحت مقامی که در آن است، زبان گناه بر او جاری نشود. پس آنان طبیبان دین حق (الله) هستند. هرگاه چیزی از آنچه در تربیت بدان نیاز دارند، در آنان ناقص باشد، نشستن بر مسند شیخوخیت برای او حلال نیست؛ زیرا او بیشتر از آنکه اصلاح کند، فساد می‌آورد و فتنه ایجاد می‌کند، مانند کسی که ادعای طبابت دارد و فرد سالم را بیمار می‌کند و بیمار را می‌کشد.\n\nپس هرگاه به این حد رسید، او شیخی در راه حق (الله) است که بر هر مریدی واجب است حرمت او را نگه دارد، به خدمتش قیام کند و در برابر آداب و رسوم او توقف نماید. چیزی را که می‌داند حق (الله) از او می‌داند، از شیخ پنهان نکند. تا زمانی که حرمتی برای او در نزد مرید وجود دارد، به او خدمت کند. اما اگر حرمتش از قلب مرید افتاد، حتی یک ساعت هم نزد او ننشیند، زیرا سودی نمی‌برد و زیان می‌بیند. چرا که منفعت در مصاحبت تنها با حرمت حاصل می‌شود. هرگاه حرمت شیخ به قلب مرید بازگشت، آنگاه به او خدمت کند و از او بهره ببرد.\n\nشیوخ بر دو دسته‌اند: شیوخی که عارف به کتاب و سنت هستند، در ظاهر به آن عمل می‌کنند و در باطن به آن متحقق شده‌اند. حدود حق (الله) را رعایت می‌کنند و به عهد حق (الله) وفا می‌نمایند. به آداب شریعت قیام می‌کنند و در ورع تأویل نمی‌کنند. احتیاط را پیشه می‌سازند، از اهل خلط و درهم‌آمیزی دوری می‌جویند. بر امت دلسوزند و هیچ یک از گناهکاران را دشمن نمی‌دارند. آنچه را حق (الله) دوست دارد، دوست می‌دارند و آنچه را حق (الله) دشمن می‌دارد، به واسطه بغض حق (الله) دشمن می‌دارند. در راه حق (الله) از سرزنش هیچ سرزنش‌کننده‌ای نمی‌هراسند. **يَأْمُرُونَ بِالْمَعْرُوفِ ويَنْهَوْنَ عَنِ الْمُنْكَرِ** (به معروف امر می‌کنند و از منکر نهی می‌نمایند) مورد اجماع، **يُسارِعُونَ في الْخَيْراتِ** (در خیرات شتاب می‌ورزند) و مردم را می‌بخشند. بزرگ را احترام می‌گذارند و بر کوچک ترحم می‌کنند. آزار را از راه حق (الله) و راه مردم برطرف می‌سازند. در خیر به واجب‌تر و سپس واجب‌تر دعوت می‌کنند. حقوق را به اهلش می‌رسانند. به برادرانشان، بلکه به همه مردم نیکی می‌کنند. در بخشش تنها به آشنایان خود اکتفا نمی‌کنند؛ جودشان مطلق است. بزرگ برایشان پدر است، هم‌سن برایشان برادر و همتاست، و کوچک برایشان فرزند است. و همه خلق برایشان خانواده‌ای هستند که نیازهایشان را پیگیری می‌کنند.\n\nاگر اطاعت کنند، حق (الحق) را موفق‌کننده خود در اطاعت از او می‌بینند. و اگر معصیت کنند، به توبه و حیا از حق (الله) شتاب می‌ورزند و نفس خود را به خاطر آنچه از ایشان سر زده است، سرزنش می‌کنند. و در معاصی خود به قضا و قدر پناه نمی‌برند، زیرا این سوء ادب با حق (الله) است. آنان نرم‌خو، مهربان و دوست‌داشتنی هستند. **رُحَماءُ بَيْنَهُمْ تَراهُمْ رُكَّعاً سُجَّداً** (در میان خود مهربانند، آنان را در حال رکوع و سجود می‌بینی). در نظرشان رحمتی برای بندگان حق (الله) است، گویی که گریه می‌کنند. اندوه بر آنان غالب‌تر از شادی است، به خاطر آنچه موطن تکلیف به همراه دارد.\n\nپس چنین کسانی هستند که باید به آنان اقتدا کرد و احترامشان واجب است، و آنان کسانی هستند که هرگاه دیده شوند، حق (الله) به یاد آورده می‌شود. و دسته دیگری از شیوخ، صاحبان احوالی هستند که در آنان تبدید (پراکندگی) وجود دارد و در ظاهر آن تحفظ (پایبندی) را ندارند. احوالشان برایشان محفوظ است، اما نباید با آنان مصاحبت کرد. و اگرچه خرق عادات (شکستن عادات) از آنان ظاهر شود، با وجود سوء ادب نسبت به شرع، نباید بر آن تکیه کرد. زیرا ما را به سوی حق (الله) راهی نیست مگر آنچه او تشریع کرده است. پس هر کس بگوید راهی به سوی حق (الله) جز آنچه تشریع شده، وجود دارد، سخنش باطل است. بنابراین، به شیخی که ادب ندارد، اقتدا نمی‌شود، هرچند در حال خود صادق باشد، اما احترامش واجب است.\n\n### [حرمت حق (الحق) در حرمت شیخ است و عاق شدن حق (الحق) در عاق شدن شیخ است]\n\nو بدان که حرمت حق (الحق) در حرمت شیخ است و عاق شدن حق (الحق) در عاق شدن شیخ است. آنان حجاب‌های حق (الحق) هستند که احوال قلوب را بر مریدان حفظ می‌کنند. پس هر کس با شیخی که به او اقتدا می‌شود، مصاحبت کند و احترامش را نگه ندارد، مجازاتش فقدان وجود حق (الحق) در قلبش، غفلت از حق (الله) و سوء ادب است که در کلامش وارد می‌شود و در رتبه شیخ با او رقابت می‌کند.\n\nزیرا وجود حق (الحق) تنها برای ادیبان است و درِ آن برای غیر ادیبان بسته است. و هیچ محرومیتی برای مرید بزرگتر از عدم احترام شیوخ نیست. برخی از اهل حق (أهل الله) درباره مجالس اهل حق (أهل الله) گفته‌اند: هر کس در مجالس آنان بنشیند و در چیزی از آنچه آنان به آن در احوالشان متحقق شده‌اند، با ایشان مخالفت کند، حق (الله) نور ایمان را از قلبش برمی‌کشد. پس نشستن با آنان خطرناک است و همنشینشان در خطر است.\n\nاصحاب ما در مورد حق مرید نسبت به شیخ دیگری غیر از شیخ خودش اختلاف کرده‌اند که آیا حال او با آن شیخ از جانب حق (الحق) مانند حالش با شیخ خودش است یا خیر. اما همگی بر وجوب حرمت آن شیخ بر مرید اتفاق نظر دارند و این موضع اجماع آنان است. و غیر از این، برخی از آنان گفته‌اند که حال مرید با آن شیخ دیگر، با حالش با شیخ خودش برابر است. و برخی تفصیل داده و گفته‌اند: این صورت یکی نیست مگر پس از آنکه مرید بداند آن شیخ دیگر از کسانی است که در طریقت به او اقتدا می‌شود. اما اگر این را نداند، چنین نیست. و این نظر وجهی دارد و آن نظر دیگر نیز وجهی دارد.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به آن زن فرمود: «صبر تنها در هنگام ضربه اول است» (إنما الصبر عند الصدمة الأولى). و آن زن نادان بود که او رسول حق (الله) است.\n\nو مرید جز حق (الحق) را قصد نمی‌کند. پس هرگاه مقصودش هر جا که ظاهر شد، آن را پذیرفته و اخذ می‌کند. زیرا مردان با حق (الحق) شناخته می‌شوند، نه اینکه حق (الحق) با آنان شناخته شود. و اصل این است که همان‌گونه که وجود عالم میان دو حق (اله) نیست، و مکلف میان دو رسول با شرایع مختلف نیست، و زن میان دو شوهر نیست؛ همچنین مرید نیز میان دو شیخ قرار نمی‌گیرد، اگر مرید تربیت باشد. اما اگر مصاحبت بدون تربیت باشد، با مصاحبت همه شیوخ باکی نیست، زیرا تحت حکم آنان نیست. این مصاحبت، مصاحبت برکت نامیده می‌شود، با این حال از آن، مردی در راه حق (الله) بیرون نمی‌آید. پس حرمت، اصل در رستگاری است."
  },
  "page_count": 3
}