{
  "id": 162,
  "title": {
    "ar": "الباب الثاني والستون ومائة في معرفة الفقر وأسراره",
    "en": "Chapter One Hundred and Sixty-Two: Concerning the Gnosis (معرفة) of Spiritual Poverty (الفقر) and its Mysteries.",
    "ur": "ایک سو باسٹھواں باب: فقر (الفقر) کی معرفت اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و شصت و دوم در معرفت فقر و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثاني والستون ومائة في معرفة الفقر وأسراره)\n> الفقر أمر يعم الكون أجمعه *** عينا وحكما ولكن ليس ينطلق‏\n\n\n> إلا على ممكن أسماء خالقه *** تبغيه فهي لهذا الأمر تستبق‏\n\n\n> إن القوي بالاستعداد قوته *** مثل الضعيف ففي الأحكام تتفق‏\n\n\n> إن الحقائق تجري في ميادنها *** وكل حق له في نفسه طلق‏\n\n\n> إن الفقير الذي استولت خصاصته *** عليه في كل شي‏ء ثوبه خلق‏\n\n\n> في كل حال من الأحوال تبصره *** كأنه طبق من فوقه طبق‏\n\n\n> وليس يمنعه عن عين موجدة *** على طريقته الآفات والعلق‏\n\n\n(و من ذلك)\n\n\n> الفقر حكم ولكن ليس يدركه *** إلا الذي جل عن أهل وعن ولد\n\n\n> الفقر حكم يعم الكون أجمعه *** ولا أحاشي من الأعيان من أحد\n\n\n> لأنها كلها بالذات تطلبه *** والفقر يطلبها بالذات في البلد\n\n\n> فكلها عدد لأنها عدد *** والكل شفع سوى المدعو بالأحد\n\n\n> وما سواه من الأعيان فهو كما *** قلناه كالواهب المحسان والصمد\n\n\n> سبحانه جل أن يحظى به أحد *** فلا يولد في عقل وفي جسد\n\n\n### [أيها الناس أنتم الفقراء إلى الله‏]\n\n\nقال الله تعالى يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ يعني بأسمائه كما نحن فقراء إلى أسمائه ولذلك أتى بالاسم الجامع للأسماء الإلهية حقيقة سره لَقَدْ سَمِعَ الله قَوْلَ الَّذِينَ قالُوا إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ فلو اتصفوا اتصفوا بحقيقة سَنَكْتُبُ ما قالُوا سببه وأَقْرِضُوا الله نزاهته قَرْضاً حَسَناً بيانه ودليله الإحسان أن تعبد الله كأنك تراه جزاؤه وما يَفْعَلُوا من خَيْرٍ فَلَنْ يُكْفَرُوهُ وباب الفقر ليس فيه ازدحام لاتساعه وعموم حكمه والفقر صفة مهجورة وما يخلو عنها أحد وهي في كل فقير بحسب ما تعطيه حقيقته وهي ألذ ما ينالها العارف فإنها تدخله على الحق ويقبله الحق لأنه دعاه بها والدعاء طلب وتقرب منها أختها وهي الذلة قال أبو يزيد قال لي الحق تقرب إلي بما ليس لي الذلة والافتقار فذله وحجبه فهاتان صفتان في اللسان نعتان للممكنات ليس لواجب الوجود منهما نعت في اللسان تعالى الله حجاب مسدل وباب مقفل مفتاحه معلق عليه يراه البصير ولا يحس به الأعمى قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ وفي هذه الآية أعني آية قوله أَنْتُمُ الْفُقَراءُ إِلَى الله تسمى الحق لنا باسم كل ما يفتقر إليه غيرة منه أن يفتقر إلى غيره فالفقير هو الذي يفتقر إلى كل شي‏ء ولا يفتقر إليه شي‏ء وهذا هو العبد المحض عند المحققين فتكون حاله في شيئية وجوده كحاله في شيئية عدمه دواء نافع لداء عضال قوله وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً قضية في عين قضية عامة أَ ولا يَذْكُرُ الْإِنْسانُ أَنَّا خَلَقْناهُ من قَبْلُ ولَمْ يَكُ شَيْئاً تنبيه على شرف الرتبة هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ من الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً مع وجود عينه لأن الحين الدهري أتى عليه فالفقر احتياج ذاتي من غير تعيين حاجة لجهله بالأصلح له ومن أسماء الله المانع وهو قد أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ حتى الغرض لما خلقه فينا أعطاه خلقه فلإنزال أصحاب أغراض فما يمنع إلا للمصلحة كما يملي لقوم لِيَزْدادُوا إِثْماً فقد أعطاهم الإثم كما أعطى الإثم خلقه فالحق لا يتقيد إنعامه والقوابل تقبل بحسب استعداداتها فمنعه عطاء لعلمه بالمصالح لذلك حكي عن بعضهم أنه سئل عن الفقير ما هو فقال من ليست له إلى الله حاجة يعني على التعيين ونبه أن الاحتياج له ذاتي والله قد أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فقد أعطاك ما فيه المصلحة لك لو علمت فما بقي لصاحب هذا المقام ما يسأل الله فيه وما شرع السؤال إلا لمن ليس له هذا الشهود ورآه يسأل الأغيار فغار فشرع له أن يسأله ولما سبق في علمه أنه يخلق قوما ويخلق فيهم السؤال إلى الأغيار ويحجبهم عن العلم به أنه المسئول في كل عين مسئولة يفتقر إليها من جماد ونبات وحيوان وملك وغير ذلك من المخلوقات أخبرنا أن الناس فقراء إلى الله أي هو المسئول على الحقيقة فإنه بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ فالفقر إلى الله هو الأصل فالعلماء بالله هم الذين يحفظون أحوالهم‏\n\n\n### (وصل) [الغني بالله‏]\n\n\nالغني بالله فقير إليه فالنسبة بلفظ الفقر إلى الله أولى من النسبة بالغنى لأن الغني نعت ذاتي يرفع المناسبة بين ذات الحق والخلق‏\nوكل طلب فيوذن بمناسبة فإن الحاصل لا يبتغى فلا يكون الطلب إلا في شي‏ء ليس عند الطالب في حال الطلب ولهذا لا يتعلق إلا بالعدم الذي هو عين المعدوم وقد يكون ذلك المطلوب في عين موجودة ولا عين موجودة ما في الكون إلا طالب فما في الكون إلا فقير لما طلب ويتميز الفقر عن سائر الصفات بأمر لا يكون لغيره وهو أنه صفة للمعدوم والموجود وكل صفة وجودية من شرطها أن تقوم بالموجود أ لا ترى الممكن في حال عدمه يفتقر إلى المرجح فإذا وجد افتقر أيضا إلى استمرار الوجود له وحفظه عليه فلا يزال فقيرا ذا فقر في حال وجوده وفي حال عدمه فهو أعم المقامات حكما فالذي يكتسب من هذه الصفة إضافة خاصة وهي الفقر إلى الله لا إلى غيره وبه يثنى عليه وهو الذي يسعده ويقربه إلى الله ويشركه في هذه الإضافة كل وصف جبل عليه الإنسان مثل البخل والحرص والشرة والحسد وغير ذلك تشرف وتعلو بالإضافة والمصرف وتتضع وتسفل بالإضافة والمصرف لا فقر أعظم من فقر الملوك لأنه مفتقر إلى مشاغلي وإلى كل ما يصح له به الملك وهو فقير إلى ملكه الذي يبقى عليه اسم الملك قيل للسلطان صلاح الدين يوسف ابن أيوب رحمه الله سنة إحدى وثمانين وخمسمائة لما ذكر أبو القمح المنجم أن ريحا عظيمة في هذه السنة تكون لا تمر على شي‏ء إِلَّا جَعَلَتْهُ كَالرَّمِيمِ فأشار عليه بعض جلسائه أن يتخذ في الأرض سربا يكون فيه ليلة هبوب تلك الريح فقال ويهلك الناس قيل له نعم فقال إذا هلك الناس فعلى من أكون ملكا أو سلطانا لا خير في الحياة بعد ذهاب الملك دعني أموت ملكا والله لا فعلت فانظر ما أحسن هذا فكل موجود إضافي متحقق بالفقر وإن لم يشعر بذلك وإن وجده فلا يعلم أن ذلك هو المسمى فقرا وإذا كان حكمه هذا فالفقر إلى الله تعالى الذي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ ثابت وموجود ولذلك الإشارة بقوله تعالى سَنَكْتُبُ ما قالُوا أي سنوجبه أي سيعلمون أن الفقر نعت واجب لا يشكون فيه وجوبا ذاتيا من أجل قولهم ونَحْنُ أَغْنِياءُ لأنهم انحجبوا عما هو الأمر عليه من فقرهم ولذلك كانوا كافرين فستروا ما هم به عالمون ذوقا من أنفسهم لا يقدرون على إنكاره وإن باهتوا فالحال يكذبهم فقالوا نَحْنُ أَغْنِياءُ وليسوا بأغنياء وقالوا إِنَّ الله فَقِيرٌ وليس بفقير من حيث ذاته فإنه غَنِيٌّ عَنِ الْعالَمِينَ وقد تقدم في مواضع من هذا الكتاب معنى قوله فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ وإنه ليس مثل قوله والله هُوَ الْغَنِيُّ ولا مثل قوله والله الْغَنِيُّ وأَنْتُمُ الْفُقَراءُ فإذا علمت إن الفقر بهذه المثابة فالزم استحضاره في كل نفس وعلى كل حال وعلق فقرك بالله مطلقا من غير تعيين فهو أولى بك وإن لم تقدر على تحصيل عدم التعيين فلا أقل إن تعلقه بالله تعالى مع التعيين‏\n\n\nأوحى الله تعالى إلى موسى يا موسى لا تجعل غيري موضع حاجتك وسلني حتى الملح تلقيه في عجينك‏\n\n\nهذا تعليم الله نبيه موسى عليه السلام ولقد رأيته سبحانه وتعالى في النوم فقال لي وكلني في أمورك فوكلته فما رأيت إلا عصمة محضة لله الحمد على ذلك جعلنا الله تعالى من الفقراء إليه به فإن الفقر إليه تعالى به هو عين الغني لأنه الغني وأنت به فقير فأنت الغني به عن العالمين فاعلم ذلك‏\n\n",
    "en": "## Chapter One Hundred and Sixty-Two: Concerning the Gnosis of Neediness (الفقر) and its Secrets\n\n> Neediness is a matter that encompasses the entire Cosmos,\n> Both essentially (عينًا) and by ruling (حكمًا), but it is not applied,\n> Except to the contingent being (ممكن) whose Creator’s Names\n> Seek it, and thus hasten toward this matter.\n> Indeed, the strong one, whose strength lies in his preparedness,\n> Is like the weak one; they are equal in the rulings.\n> Indeed, the Realities (الحقائق) run in their fields,\n> And every truth (حق) has freedom within itself.\n> The needy one (الفقير) is he whose destitution has overcome him\n> In everything; his garment is worn out.\n> In every state of affairs, you see him\n> As if he were a layer upon a layer.\n> And neither afflictions nor attachments prevent him\n> From the essential reality that brings him into existence according to his way.\n\n(And from that)\n\n> Neediness is a ruling, but none grasps it\n> Save He who is exalted above family and offspring.\n> Neediness is a ruling that encompasses the entire Cosmos,\n> And I exclude none of the Fixed Entities (الأعيان) from it.\n> Because all of them seek it essentially (بالذات),\n> And Neediness seeks them essentially in the realm.\n> For all of them are number because they are counted,\n> And all are paired save the One called The Single (الأحد).\n> And what is other than Him among the Fixed Entities is, as\n> We said, like the Giver, the Benefactor, and the Eternally Besought (الصمد).\n> Glory be to Him! He is too exalted for anyone to attain Him,\n> So He is not born in intellect or in body.\n\n### [O Mankind, You Are the Needy toward Allah]\n\nAllah the Exalted said: <<O mankind, you are the needy (الْفُقَراءُ) toward Allah, and Allah is the Self-Sufficient (الْغَنِيُّ), the Praiseworthy (الْحَمِيدُ)>>. Meaning, by His Names, just as we are needy toward His Names. For this reason, He brought the Name that encompasses the Divine Names, which is the reality of His secret. <<Indeed, Allah has heard the saying of those who said, 'Indeed, Allah is poor, and we are rich'>>. Had they been characterized [by truth], they would have been characterized by the reality of <<We will record what they said>> (which is the cause of their state), and <<Lend to Allah>> (which is His transcendence), <<a good loan>> (which is its clarification and proof). The proof is *al-Ihsan* (spiritual excellence): that you worship Allah as if you see Him. Its reward is <<And whatever good they do, they will never be denied it>>.\n\nThe door of Neediness (الفقر) has no crowding due to its vastness and the universality of its ruling. Neediness is an abandoned attribute, yet no one is devoid of it. It exists in every needy person according to what his reality grants him. It is the sweetest thing attained by the Gnostic (العارف), for it introduces him to The Real (الحق), and The Real accepts him because He called him by it. Supplication is seeking and drawing near. Its sister is Humility (الذلة).\n\nAbu Yazid said: The Real said to me, \"Draw near to Me with that which is not Mine: Humility and Neediness (الافتقار).\" So, He humbled him and veiled him. These two attributes, Humility and Neediness, are linguistically descriptions of contingent beings (الممكنات). The Necessary Existent (واجب الوجود) has no such description linguistically. Exalted is Allah! He is a drawn curtain and a locked door whose key hangs upon it. The insightful one (البصير) sees it, but the blind one does not perceive it. <<Say: Are those who know equal to those who do not know? Only those of understanding (أُولُوا الْأَلْبابِ) will remember>>.\n\nIn this verse—I mean the verse where He says <<You are the needy toward Allah>>—The Real named Himself for us with the name of everything that is needed, out of jealousy that we should be needy toward anything other than Him. Thus, the needy one (الفقير) is he who is needy toward everything, yet nothing is needy toward him. This is the Pure Servant (العبد المحض) according to the verifiers (المحققين). His state in the 'thingness' of his existence is like his state in the 'thingness' of his non-existence.\n\nAn effective medicine for a chronic disease is His saying: <<And I had created you before, when you were nothing>>—a specific case within a general case. <<Does man not remember that We created him before, when he was nothing?>> This is an alert to the nobility of the rank. <<Has there not come upon man a period of time when he was not a thing mentioned?>>—even though his essence existed, because the eternal time had come upon him.\n\nNeediness, therefore, is essential dependence (احتياج ذاتي) without specifying a need, due to the servant's ignorance of what is most beneficial for him. One of Allah's Names is The Withholder (المانع). Yet, He has <<given every thing its creation (خَلْقَهُ)>>—even the purpose that He created within us, He gave it its creation. So, for the descent of those who have purposes, He only withholds for the sake of benefit, just as He grants respite to a people <<that they may increase in sin (إِثْماً)>>. Thus, He has given them sin, just as He gave sin its creation. The Real does not restrict His bestowal, but the recipients accept according to their preparedness (استعداداتها). Therefore, His withholding is a giving, due to His knowledge of what is beneficial.\n\nFor this reason, it was narrated that one of them was asked, \"What is the needy one?\" He replied, \"He who has no need of Allah\"—meaning, no specific need. He was alerting that his dependence is essential. Allah has <<given every thing its creation>>, so He has given you what contains benefit for you, if only you knew. Thus, the possessor of this station (المقام) has nothing left to ask Allah for.\n\nSupplication was only legislated for those who lack this Witnessing (الشهود). When He saw them asking others, He became jealous, so He legislated for them to ask Him. And since it preceded in His Knowledge that He would create a people and create within them the tendency to ask others, and veil them from the knowledge that He is the One asked in every specific entity that is needed—whether mineral, plant, animal, angel, or other creatures—He informed us that mankind is needy toward Allah. That is, He is the One truly asked, for <<in His Hand is the dominion (مَلَكُوتُ) of everything>>. Therefore, Neediness toward Allah is the origin, and the scholars of Allah (العلماء بالله) are those who preserve their states.\n\n### A Section: The Richness in Allah (الغني بالله)\n\nThe one who is rich in Allah is needy toward Him. Therefore, attribution using the term Neediness (الفقر) toward Allah is more appropriate than attribution using Richness (الغنى), because Richness is an essential attribute (نعت ذاتي) that removes the suitability between the Essence (الذات) of The Real and creation (الخلق).\n\nEvery seeking implies a suitability, for what is already attained is not sought. Seeking only occurs for something that the seeker does not possess at the time of seeking. Therefore, it relates only to non-existence (العدم), which is the essence of the non-existent thing. That which is sought may exist in a specific entity, but there is no existing entity in the Cosmos except a seeker. Thus, there is no one in the Cosmos except one who is needy for what he seeks.\n\nNeediness is distinguished from all other attributes by a matter unique to it: it is an attribute of both the non-existent and the existent. Every existential attribute requires that it subsist in an existent thing. Do you not see that the contingent being (الممكن) in its state of non-existence is needy toward the determinant (المرجح)? And when it exists, it is also needy toward the continuation of its existence and its preservation upon it. Thus, it remains needy, possessing neediness both in its state of existence and in its state of non-existence. Therefore, it is the most universal of the spiritual stations (المقامات) in its ruling.\n\nThe one who acquires a special addition (إضافة خاصة) from this attribute—which is Neediness toward Allah and not toward anything else—is praised by it, and it is what makes him happy and brings him near to Allah. Every description inherent in man, such as stinginess, greed, gluttony, and envy, shares in this addition. These attributes are honored and elevated by the addition [to Allah] and the expenditure [in His way], and they are debased and lowered by the addition [to the self] and the expenditure [for the self].\n\nThere is no neediness greater than the neediness of kings, because the king is needy toward his subjects and toward everything by which his kingship is validated. He is needy toward his kingdom, which preserves for him the name of \"King.\" It was said to Sultan Salah al-Din Yusuf ibn Ayyub (may Allah have mercy on him) in the year 581 AH (1185 CE), when Abu al-Qamh the astrologer mentioned that a great wind would occur that year which would pass over nothing <<except that it would render it like crumbled dust (كَالرَّمِيمِ)>>. Some of his companions advised him to take refuge in an underground tunnel on the night that wind was due to blow. He asked, \"And will the people perish?\" He was told, \"Yes.\" He said, \"If the people perish, over whom shall I be king or sultan? There is no good in life after the loss of kingship. Let me die a king. By Allah, I will not do it.\" Look how excellent this is!\n\nEvery relative existent (موجود إضافي) is realized by Neediness, even if he does not perceive it. And even if he finds it, he does not know that this is what is called Neediness. If this is its ruling, then Neediness toward Allah the Exalted, <<in Whose Hand is the dominion of everything>>, is established and existent. This is why the verse <<We will record what they said>> is an indication—meaning, We will make it obligatory [upon them]. That is, they will know that Neediness is an obligatory description (نعت واجب) about which they will not doubt, an essential obligation, because of their saying <<and we are rich>>. This is because they were veiled from the reality of their own neediness. For this reason, they were disbelievers, for they concealed what they knew by direct experience within themselves, which they could not deny, even if they argued. Their state belies them. They said <<we are rich>> when they are not rich, and they said <<Indeed, Allah is poor>> when He is not poor in terms of His Essence (ذاته), for He is <<Self-Sufficient above the worlds>>.\n\nThe meaning of His saying <<Indeed, Allah is Self-Sufficient above the worlds>> has been discussed in previous places in this book, and that it is not the same as His saying <<And Allah is the Self-Sufficient>> nor His saying <<And Allah is the Self-Sufficient, and you are the needy>>. If you know that Neediness is of this stature, then adhere to its presence in every breath and in every state. Attach your neediness to Allah absolutely (مطلقا), without specifying a need, for that is more appropriate for you. If you cannot achieve the absence of specification, then at least attach it to Allah the Exalted, even with specification.\n\nAllah the Exalted revealed to Moses: \"O Moses, do not make anyone other than Me the object of your need. Ask Me, even for the salt you put in your dough.\"\n\nThis is Allah's teaching to His Prophet Moses (peace be upon him). I saw Him, glory and exalted is He, in a dream, and He said to me, \"Appoint Me as your agent (وكلني) in your affairs.\" So I appointed Him. I have seen nothing but pure preservation (عصمة محضة). Praise be to Allah for that. May Allah the Exalted make us among those who are needy toward Him, by Him. For Neediness toward Him, by Him, is the very essence of Richness, because He is the Self-Sufficient, and you are needy by Him. Thus, you are rich by Him, independent of the worlds. Know this.",
    "ur": "(باب ایک سو باسٹھ: فقر (فقر) اور اس کے اسرار کی معرفت (معرفت) میں)\n\n> الفقر أمر يعم الكون أجمعه *** عينا وحكما ولكن ليس ينطلق‏\n> فقر (فقر) ایک ایسا امر ہے جو پوری کائنات (کون) کو محیط ہے، *** اعیان (عین) اور حکم کے اعتبار سے، لیکن یہ لاگو نہیں ہوتا\n> إلا على ممكن أسماء خالقه *** تبغيه فهي لهذا الأمر تستبق‏\n> مگر صرف ممکن (ممکن) پر، جسے اس کے خالق کے اسماء *** طلب کرتے ہیں اور اسی امر کی طرف سبقت کرتے ہیں۔\n> إن القوي بالاستعداد قوته *** مثل الضعيف ففي الأحكام تتفق‏\n> بے شک وہ قوی جس کی قوت اس کے استعداد (استعداد) سے ہے *** وہ ضعیف کی مانند ہے، پس وہ احکام میں متفق ہیں۔\n> إن الحقائق تجري في ميادنها *** وكل حق له في نفسه طلق‏\n> بے شک حقائق اپنے میدانوں میں جاری ہیں *** اور ہر حق اپنی ذات میں آزاد ہے۔\n> إن الفقير الذي استولت خصاصته *** عليه في كل شي‏ء ثوبه خلق‏\n> بے شک وہ فقیر (فقیر) جس پر اس کی حاجت غالب آ چکی ہے *** ہر شے میں، اس کا لباس بوسیدہ ہے۔\n> في كل حال من الأحوال تبصره *** كأنه طبق من فوقه طبق‏\n> ہر حال میں تم اسے دیکھتے ہو *** گویا وہ ایک تہہ ہے جس کے اوپر دوسری تہہ ہے۔\n> وليس يمنعه عن عين موجدة *** على طريقته الآفات والعلق‏\n> اور آفات اور تعلقات اسے اس کے طریقے پر *** کسی موجود عین (عین موجدہ) سے نہیں روکتے۔\n\n(اور اسی میں سے ہے)\n\n> الفقر حكم ولكن ليس يدركه *** إلا الذي جل عن أهل وعن ولد\n> فقر (فقر) ایک حکم ہے لیکن اسے کوئی نہیں پا سکتا *** سوائے اس کے جو اہل و اولاد سے پاک ہے۔\n> الفقر حكم يعم الكون أجمعه *** ولا أحاشي من الأعيان من أحد\n> فقر (فقر) ایک حکم ہے جو پوری کائنات (کون) کو محیط ہے *** اور میں اعیان (اعیان) میں سے کسی کو مستثنیٰ نہیں کرتا۔\n> لأنها كلها بالذات تطلبه *** والفقر يطلبها بالذات في البلد\n> کیونکہ وہ سب ذات (ذات) کے اعتبار سے اسے طلب کرتے ہیں *** اور فقر (فقر) ذات (ذات) کے اعتبار سے انہیں اس مقام پر طلب کرتا ہے۔\n> فكلها عدد لأنها عدد *** والكل شفع سوى المدعو بالأحد\n> پس وہ سب عدد ہیں کیونکہ وہ گنتی میں ہیں *** اور سب جفت ہیں سوائے اس کے جسے الاحد (الأحد) کہا جاتا ہے۔\n> وما سواه من الأعيان فهو كما *** قلناه كالواهب المحسان والصمد\n> اور اس کے سوا جو بھی اعیان (اعیان) ہیں، وہ ایسے ہی ہیں جیسے *** ہم نے کہا: الواہب (الواہب)، المحسان (المحسان)، اور الصمد (الصمد) کی مانند۔\n> سبحانه جل أن يحظى به أحد *** فلا يولد في عقل وفي جسد\n> وہ پاک ہے، وہ اس سے بلند ہے کہ کوئی اسے پا سکے *** پس وہ نہ عقل میں پیدا ہوتا ہے اور نہ جسم میں۔\n\n### [اے لوگو! تم اللہ کے محتاج ہو]\n\nاللہ تعالیٰ نے فرمایا: **يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ** (اے لوگو! تم اللہ کے محتاج ہو اور اللہ ہی بے نیاز، لائقِ حمد ہے)۔ یعنی اپنے اسماء (اسماء) کے ذریعے، جس طرح ہم اس کے اسماء (اسماء) کے محتاج ہیں۔ اسی لیے اس نے اسماء الٰہیہ کے جامع اسم کو اس کے راز کی حقیقت کے ساتھ لایا: **لَقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ** (یقیناً اللہ نے ان لوگوں کی بات سن لی جنہوں نے کہا کہ اللہ محتاج ہے اور ہم بے نیاز ہیں)۔ اگر وہ متصف ہوتے تو اس حقیقت سے متصف ہوتے: **سَنَكْتُبُ مَا قَالُوا** (ہم لکھ لیں گے جو انہوں نے کہا) اس کا سبب ہے، اور **أَقْرِضُوا اللَّهَ** (اللہ کو قرض دو) اس کی نزاہت ہے، **قَرْضًا حَسَنًا** (اچھا قرض) اس کا بیان ہے، اور اس کی دلیل احسان (الإحسان) ہے کہ تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو، اس کا بدلہ یہ ہے: **وَمَا يَفْعَلُوا مِنْ خَيْرٍ فَلَنْ يُكْفَرُوهُ** (اور وہ جو بھی بھلائی کریں گے، اس کی ناقدری نہیں کی جائے گی)۔\n\nاور فقر (فقر) کے دروازے پر اس کی وسعت اور حکم کے عموم کی وجہ سے کوئی بھیڑ نہیں ہے۔ فقر (فقر) ایک ایسی صفت ہے جسے ترک کر دیا گیا ہے، حالانکہ کوئی بھی اس سے خالی نہیں ہے۔ اور یہ ہر فقیر (فقیر) میں اس کی حقیقت کے عطا کردہ کے مطابق ہوتی ہے۔ یہ وہ لذیذ ترین شے ہے جسے عارف (العارف) حاصل کرتا ہے، کیونکہ یہ اسے ذات حق (الحق) تک پہنچاتی ہے اور ذات حق (الحق) اسے قبول فرماتا ہے کیونکہ اس نے اسے اسی کے ذریعے پکارا ہے۔ اور دعا طلب اور قربت ہے۔ اس کی بہن ذلت (الذلة) ہے۔ ابو یزید (بسطامی) نے کہا: ذات حق (الحق) نے مجھ سے فرمایا: میرے قریب آؤ اس چیز کے ذریعے جو میرے لیے نہیں ہے، یعنی ذلت (الذلة) اور افتقار (الافتقار)۔ پس اس نے اسے ذلیل کیا اور اسے حجاب میں رکھا۔ پس یہ دونوں صفات زبان میں ممکنات (الممکنات) کی نعتیں ہیں، واجب الوجود (واجب الوجود) کے لیے ان میں سے کوئی نعت زبان میں نہیں ہے۔ اللہ تعالیٰ بلند ہے، وہ ایک لٹکا ہوا حجاب (حجاب مسدل) اور ایک مقفل دروازہ ہے جس کی چابی اس پر لٹکی ہوئی ہے، جسے بصیر دیکھتا ہے اور نابینا محسوس نہیں کرتا۔ **قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ** (کہہ دیجیے: کیا وہ لوگ جو علم رکھتے ہیں اور وہ لوگ جو علم نہیں رکھتے برابر ہو سکتے ہیں؟ نصیحت تو صرف عقل والے ہی حاصل کرتے ہیں)۔\n\nاور اس آیت میں، یعنی اس کے قول **أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ** (تم اللہ کے محتاج ہو) کی آیت میں، ذات حق (الحق) نے ہمیں ہر اس شے کے نام سے موسوم کیا جس کی طرف وہ محتاج ہوتا ہے، یہ اس کی غیرت کی وجہ سے ہے کہ وہ کسی اور کا محتاج ہو۔ پس فقیر (الفقیر) وہ ہے جو ہر شے کا محتاج ہو اور کوئی شے اس کی محتاج نہ ہو۔ محققین کے نزدیک یہی خالص عبد (العبد المحض) ہے۔ پس اس کی حالت اس کے وجود کی شیئیت میں ویسی ہی ہوتی ہے جیسی اس کے عدم کی شیئیت میں۔ یہ ایک لاعلاج بیماری کا مؤثر علاج ہے۔ اس کا قول: **وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا** (حالانکہ میں نے تجھے اس سے پہلے پیدا کیا تھا اور تو کچھ بھی نہ تھا) ایک عام قضیے میں ایک خاص قضیہ ہے۔ **أَوَلَا يَذْكُرُ الْإِنْسَانُ أَنَّا خَلَقْنَاهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْئًا** (کیا انسان یاد نہیں کرتا کہ ہم نے اسے اس سے پہلے پیدا کیا تھا جبکہ وہ کچھ بھی نہ تھا؟) یہ رتبے کی شرافت پر تنبیہ ہے۔ **هَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا** (کیا انسان پر زمانے میں ایک ایسا وقت بھی آیا ہے جب وہ کوئی قابل ذکر چیز نہ تھا؟) باوجود اس کے کہ اس کا عین (عین) موجود تھا، کیونکہ زمانے کا وقت اس پر آ چکا تھا۔\n\nپس فقر (فقر) ذاتی احتیاج (احتیاج ذاتی) ہے بغیر کسی حاجت کے تعین کے، کیونکہ وہ اپنے لیے اصلح (بہتر) سے ناواقف ہے۔ اور اللہ کے اسماء (اسماء) میں سے ایک المانع (المانع) ہے، حالانکہ اس نے **أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ** (ہر چیز کو اس کی ساخت عطا کی) ہے، یہاں تک کہ غرض کو بھی جب اس نے اسے ہم میں پیدا کیا تو اس کی ساخت عطا کی۔ پس اغراض (مقاصد) والوں کو نازل کرنے کے لیے، وہ صرف مصلحت کی خاطر منع کرتا ہے، جیسا کہ وہ ایک قوم کو مہلت دیتا ہے **لِيَزْدَادُوا إِثْمًا** (تاکہ وہ مزید گناہ میں بڑھ جائیں)، پس اس نے انہیں گناہ عطا کیا جس طرح اس نے گناہ کو اس کی ساخت عطا کی۔ پس ذات حق (الحق) کا انعام مقید نہیں ہوتا، اور قابل (القوابل) اپنے استعدادات (استعدادات) کے مطابق قبول کرتے ہیں۔ پس اس کا منع کرنا بھی عطا ہے، کیونکہ وہ مصالح کو جانتا ہے۔ اسی لیے بعض سے حکایت کی گئی ہے کہ ان سے فقیر (الفقیر) کے بارے میں پوچھا گیا کہ وہ کیا ہے؟ تو انہوں نے کہا: وہ جسے اللہ سے کوئی حاجت نہ ہو، یعنی تعین کے ساتھ۔ اور تنبیہ کی کہ اس کی احتیاج ذاتی (ذاتی) ہے۔ اور اللہ نے **أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ** (ہر چیز کو اس کی ساخت عطا کی) ہے، پس اس نے تمہیں وہ عطا کر دیا جس میں تمہارے لیے مصلحت ہے، اگر تم جان لو۔ پس اس مقام والے کے لیے کچھ باقی نہیں رہتا کہ وہ اللہ سے اس میں سوال کرے۔ اور سوال صرف اس کے لیے مشروع کیا گیا ہے جسے یہ شہود (الشہود) حاصل نہیں ہے، اور جب اس نے اسے اغیار (دوسروں) سے سوال کرتے دیکھا تو غیرت کھائی، پس اس کے لیے مشروع کیا کہ وہ اسی سے سوال کرے۔ اور جب اس کے علم میں یہ بات پہلے سے تھی کہ وہ ایک قوم کو پیدا کرے گا اور ان میں اغیار سے سوال کرنے کی خواہش پیدا کرے گا، اور انہیں اس علم سے حجاب میں رکھے گا کہ وہی ہر مطلوبہ عین (عین مسئولة) میں مسئول (جس سے سوال کیا جاتا ہے) ہے، جس کی طرف جمادات، نباتات، حیوانات، فرشتے اور دیگر مخلوقات میں سے ہر کوئی محتاج ہے، تو اس نے ہمیں خبر دی کہ لوگ اللہ کے محتاج ہیں، یعنی حقیقت میں وہی مسئول (مسئول) ہے، کیونکہ **بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ** (ہر چیز کا ملکوت اسی کے ہاتھ میں ہے)۔ پس اللہ کی طرف فقر (فقر) ہی اصل ہے، اور اللہ والے علماء (العلماء باللہ) ہی اپنی احوال کی حفاظت کرتے ہیں۔\n\n### (فصل) [اللہ کے ذریعے غنی (الغنی باللہ)]\n\nاللہ کے ذریعے غنی (الغنی باللہ) بھی اسی کا فقیر (فقیر) ہے۔ پس اللہ کی طرف فقر (فقر) کے لفظ سے نسبت کرنا غنی (غنی) سے نسبت کرنے سے زیادہ اولیٰ ہے، کیونکہ غنی (الغنی) ایک ذاتی نعت ہے جو ذات حق (ذات الحق) اور خلق کے درمیان مناسبت کو ختم کر دیتی ہے۔\n\nاور ہر طلب (طلب) مناسبت کی اجازت دیتی ہے، کیونکہ جو چیز حاصل ہو وہ طلب نہیں کی جاتی۔ پس طلب صرف اسی شے میں ہوتی ہے جو طالب کے پاس طلب کی حالت میں موجود نہ ہو۔ اسی لیے یہ صرف عدم (العدم) سے متعلق ہوتی ہے جو کہ عین معدوم (عین المعدوم) ہے۔ اور ہو سکتا ہے کہ وہ مطلوب کسی موجود عین (عین موجودة) میں ہو، اور کائنات (کون) میں کوئی موجود عین (عین موجودة) نہیں ہے مگر طالب۔ پس کائنات (کون) میں کوئی نہیں مگر وہ جو مطلوب کا فقیر (فقیر) ہے۔ اور فقر (فقر) دیگر صفات سے ایک ایسے امر کے ذریعے ممتاز ہوتا ہے جو کسی اور کے لیے نہیں ہوتا، اور وہ یہ ہے کہ یہ معدوم (المعدوم) اور موجود (الموجود) دونوں کی صفت ہے۔ اور ہر وجودی صفت کی شرط یہ ہے کہ وہ موجود کے ساتھ قائم ہو۔ کیا تم نہیں دیکھتے کہ ممکن (الممکن) اپنی عدم کی حالت میں مرجح (ترجیح دینے والے) کا محتاج ہوتا ہے؟ اور جب وہ موجود ہو جاتا ہے تو وہ اپنے لیے وجود کے تسلسل اور اس کی حفاظت کا بھی محتاج ہوتا ہے۔ پس وہ اپنی وجود کی حالت میں اور اپنی عدم کی حالت میں ہمیشہ فقیر (فقیر) ہی رہتا ہے۔ پس یہ حکم کے لحاظ سے مقامات (المقامات) میں سب سے زیادہ عام ہے۔\n\nپس جو شخص اس صفت سے ایک خاص نسبت حاصل کرتا ہے، اور وہ ہے اللہ کی طرف فقر (فقر) نہ کہ کسی اور کی طرف، اسی کے ذریعے اس کی تعریف کی جاتی ہے، اور یہی وہ چیز ہے جو اسے سعادت مند بناتی ہے اور اللہ کے قریب کرتی ہے۔ اور اس نسبت میں ہر وہ وصف شریک ہوتا ہے جس پر انسان جبلت کیا گیا ہے، جیسے بخل، حرص، شرہ (لالچ)، حسد اور دیگر۔ یہ نسبت اور مصرف کے ذریعے شرف حاصل کرتے اور بلند ہوتے ہیں، اور نسبت اور مصرف کے ذریعے پست اور نیچ ہوتے ہیں۔ بادشاہوں کے فقر (فقر) سے بڑا کوئی فقر (فقر) نہیں، کیونکہ وہ اپنے معاملات کو چلانے والوں کا محتاج ہوتا ہے اور ہر اس چیز کا محتاج ہوتا ہے جس سے اس کی بادشاہت درست رہتی ہے، اور وہ اپنی بادشاہت کا فقیر (فقیر) ہوتا ہے جو اس پر بادشاہ کا نام باقی رکھتی ہے۔\n\nسلطان صلاح الدین یوسف ابن ایوب رحمہ اللہ سے ۵۸۱ھ میں کہا گیا، جب منجم ابو القمح نے ذکر کیا کہ اس سال ایک زبردست آندھی آئے گی جو کسی چیز پر سے نہیں گزرے گی مگر اسے **إِلَّا جَعَلَتْهُ كَالرَّمِيمِ** (بوسیدہ ہڈیوں کی طرح) کر دے گی۔ تو ان کے بعض ہم نشینوں نے انہیں مشورہ دیا کہ وہ زمین میں ایک سرنگ بنا لیں اور اس آندھی کے چلنے کی رات اس میں رہیں۔ انہوں نے پوچھا: \"اور کیا لوگ ہلاک ہو جائیں گے؟\" انہیں کہا گیا: \"ہاں۔\" تو انہوں نے فرمایا: \"جب لوگ ہلاک ہو جائیں گے تو میں کس پر بادشاہ یا سلطان رہوں گا؟ بادشاہت کے ختم ہونے کے بعد زندگی میں کوئی بھلائی نہیں۔ مجھے بادشاہ کی حیثیت سے مرنے دو۔ اللہ کی قسم! میں ایسا نہیں کروں گا۔\" پس دیکھو یہ کتنا عمدہ ہے۔\n\nپس ہر اضافی موجود فقر (فقر) کے ساتھ متحقق ہے، اگرچہ وہ اس کا شعور نہ رکھے، اور اگر وہ اسے پا بھی لے تو یہ نہیں جانتا کہ اسی کا نام فقر (فقر) ہے۔ اور جب اس کا حکم یہ ہے تو اللہ تعالیٰ کی طرف فقر (فقر) جو **بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ** (ہر چیز کا ملکوت جس کے ہاتھ میں ہے) ثابت اور موجود ہے۔ اور اسی کی طرف اللہ تعالیٰ کے اس قول میں اشارہ ہے: **سَنَكْتُبُ مَا قَالُوا** (ہم لکھ لیں گے جو انہوں نے کہا)، یعنی ہم اسے واجب کر دیں گے، یعنی وہ جان لیں گے کہ فقر (فقر) ایک واجب نعت ہے جس میں وہ شک نہیں کریں گے، یہ ان کے اس قول کی وجہ سے ذاتی وجوب ہے: **وَنَحْنُ أَغْنِيَاءُ** (اور ہم بے نیاز ہیں)، کیونکہ وہ اپنے فقر (فقر) کی حقیقت سے پردے میں رہے جس پر امر قائم ہے۔ اسی لیے وہ کافر (کافرین) تھے، پس انہوں نے اس چیز کو چھپایا جسے وہ اپنے اندرونی ذوق سے جانتے تھے اور اس کا انکار نہیں کر سکتے تھے، اگرچہ انہوں نے مباہلہ کیا، لیکن حال انہیں جھٹلاتا ہے۔ پس انہوں نے کہا: **نَحْنُ أَغْنِيَاءُ** (ہم بے نیاز ہیں)، حالانکہ وہ بے نیاز نہیں ہیں، اور انہوں نے کہا: **إِنَّ اللَّهَ فَقِيرٌ** (بے شک اللہ محتاج ہے)، حالانکہ وہ اپنی ذات (ذات) کے لحاظ سے فقیر (فقیر) نہیں ہے، کیونکہ وہ **غَنِيٌّ عَنِ الْعَالَمِينَ** (تمام جہانوں سے بے نیاز) ہے۔ اور اس کتاب میں کئی مقامات پر اس کے قول **فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ** (پس بے شک اللہ تمام جہانوں سے بے نیاز ہے) کا معنی گزر چکا ہے، اور یہ کہ یہ اس کے قول **وَاللَّهُ هُوَ الْغَنِيُّ** (اور اللہ ہی بے نیاز ہے) اور اس کے قول **وَاللَّهُ الْغَنِيُّ وَأَنْتُمُ الْفُقَرَاءُ** (اور اللہ بے نیاز ہے اور تم محتاج ہو) کی طرح نہیں ہے۔ پس جب تم جان لو کہ فقر (فقر) اس مرتبے کا ہے، تو ہر سانس میں اور ہر حال میں اسے حاضر رکھنا لازم کر لو، اور اپنے فقر (فقر) کو مطلقاً اللہ سے وابستہ رکھو بغیر کسی تعین کے، یہ تمہارے لیے زیادہ اولیٰ ہے۔ اور اگر تم عدم تعین کو حاصل کرنے پر قادر نہ ہو تو کم از کم اسے تعین کے ساتھ اللہ تعالیٰ سے وابستہ رکھو۔\n\nاللہ تعالیٰ نے موسیٰ (علیہ السلام) کی طرف وحی کی: \"اے موسیٰ! میرے سوا کسی اور کو اپنی حاجت کی جگہ نہ بناؤ، اور مجھ سے سوال کرو، یہاں تک کہ وہ نمک بھی جو تم اپنے آٹے میں ڈالتے ہو۔\"\n\nیہ اللہ کا اپنے نبی موسیٰ (علیہ السلام) کو تعلیم دینا ہے۔ اور میں نے اسے (اللہ سبحانہ و تعالیٰ کو) خواب میں دیکھا تو اس نے مجھ سے فرمایا: \"اپنے معاملات میں مجھے وکیل بناؤ۔\" پس میں نے اسے وکیل بنا لیا، تو میں نے صرف خالص عصمت ہی دیکھی۔ اس پر اللہ کا شکر ہے۔ اللہ تعالیٰ ہمیں ان لوگوں میں شامل کرے جو اس کے ذریعے اس کے فقیر (فقیر) ہیں۔ کیونکہ اس کے ذریعے اس کی طرف فقر (فقر) ہی عین غنی (الغنی) ہے، اس لیے کہ وہ غنی (الغنی) ہے اور تم اس کے ذریعے فقیر (فقیر) ہو، پس تم اس کے ذریعے تمام جہانوں سے غنی (غنی) ہو۔ یہ جان لو۔",
    "fa": "(باب صد و شصت و دوم در معرفت فقر و اسرار آن)\n\nفقر امری است که تمام هستی را در بر می‌گیرد *** چه در عین و چه در حکم، اما اطلاق نمی‌شود\n\nمگر بر ممکنی که اسماء خالقش *** آن را می‌طلبند و برای این امر سبقت می‌گیرند\n\nهمانا قوی به واسطه استعدادش، قوتش *** مانند ضعیف است، پس در احکام با هم متفق‌اند\n\nهمانا حقایق در میدان‌های خود جاری‌اند *** و هر حقی در ذات خود رها و آزاد است\n\nهمانا فقیری که نیازمندی‌اش چیره شده *** بر او در هر چیز، جامه‌اش کهنه است\n\nدر هر حالی از احوال او را می‌بینی *** گویی که طبقه‌ای است و طبقه‌ای دیگر بر روی آن\n\nو آفات و وابستگی‌ها او را از عینِ ایجادکننده *** بر طریقه‌اش باز نمی‌دارند.\n\n(و از آن جمله است)\n\nفقر حکمی است، اما درکش نمی‌کند *** مگر آنکه از اهل و فرزند برتر است\n\nفقر حکمی است که تمام هستی را فرا می‌گیرد *** و هیچ یک از اعیان (الأعيان) را استثنا نمی‌کنم\n\nزیرا همه آنها ذاتاً فقر را می‌طلبند *** و فقر نیز ذاتاً آنها را در این عالم می‌طلبد\n\nپس همه آنها عددند، زیرا متعددند *** و همه جفت‌اند، جز آنکه به احد خوانده می‌شود\n\nو آنچه غیر او از اعیان است، همان‌گونه که *** گفتیم، مانند بخشنده، نیکوکار و صمد است\n\nپاک است او، برتر از آنکه کسی به او دست یابد *** پس نه در عقل و نه در جسد متولد نمی‌شود.\n\n### [ای مردم، شما نیازمندان به سوی خدا هستید]\n\nخداوند متعال فرمود: «يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ» (ای مردم، شما نیازمندان (الفقراء) به سوی خدا هستید و خداوند همان بی‌نیاز ستوده (الغني الحميد) است.) (فاطر: ۱۵). یعنی به واسطه اسمائش، همان‌گونه که ما به اسمائش فقیر هستیم. به همین دلیل اسم جامع برای حقایق اسرار اسماء الهی را آورد: «لَقَدْ سَمِعَ الله قَوْلَ الَّذِينَ قالُوا إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ» (به راستی خداوند سخن کسانی را که گفتند: «خداوند فقیر است و ما بی‌نیازیم» شنید.) (آل عمران: ۱۸۱).\n\nاگر متصف می‌شدند، به حقیقت «سَنَكْتُبُ ما قالُوا» (آنچه را گفتند خواهیم نوشت) (آل عمران: ۱۸۱) متصف می‌شدند که سبب آن است، و «أَقْرِضُوا الله» (به خدا قرض دهید) که نزاهت آن است، و «قَرْضاً حَسَناً» (قرض نیکو) که بیان و دلیل آن است، و احسان (الإحسان) که این است که خدا را چنان بپرستی که گویی او را می‌بینی، جزای آن است، و «وما يَفْعَلُوا من خَيْرٍ فَلَنْ يُكْفَرُوهُ» (هر کار خیری انجام دهند، هرگز کفران نمی‌شود.) (آل عمران: ۱۱۵).\n\nو درِ فقر به دلیل وسعت و عمومیت حکمش، ازدحامی ندارد. فقر صفتی است که از آن دوری شده، در حالی که هیچ کس از آن خالی نیست. و این صفت در هر فقیری به اندازه آنچه حقیقتش عطا می‌کند، وجود دارد. و این لذیذترین چیزی است که عارف (العارف) به آن دست می‌یابد، زیرا او را بر حق (الحق) وارد می‌کند و حق او را می‌پذیرد، چون او را با آن (فقر) خوانده است. و دعا، طلب و تقرب است. خواهر فقر، ذلت (الذلة) است.\n\nابویزید گفت: حق (الحق) به من فرمود: «به من تقرب جوی با آنچه از آنِ من نیست: ذلت (الذلة) و افتقار (الافتقار).» پس او را خوار ساخت و محجوب نمود. این دو صفت در زبان، نعت ممکنات هستند و برای واجب الوجود (واجب الوجود) هیچ نعتی از آنها در زبان نیست. خداوند برتر است. حجابی آویخته و دری قفل شده که کلیدش بر آن آویزان است؛ بینا آن را می‌بیند و کور آن را حس نمی‌کند. «قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ» (بگو: آیا کسانی که می‌دانند و کسانی که نمی‌دانند برابرند؟ تنها خردمندان (أُولُوا الْأَلْبابِ) پند می‌گیرند.) (زمر: ۹).\n\nو در این آیه، یعنی آیه «أَنْتُمُ الْفُقَراءُ إِلَى الله» (شما نیازمندان به سوی خدا هستید)، حق (الحق) ما را به نام هر آنچه به آن نیازمندیم نامیده است، از روی غیرت الهی که مبادا به غیر او نیازمند شویم. پس فقیر کسی است که به هر چیزی نیازمند است و هیچ چیز به او نیازمند نیست. و این همان بنده محض (العبد المحض) نزد محققان است. پس حال او در شیئیت وجودش مانند حال او در شیئیت عدمش است؛ دارویی سودمند برای دردی مزمن. سخن او: «وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً» (و تو را پیش از این آفریدم، در حالی که چیزی نبودی.) (مریم: ۹). این قضیه‌ای است در عین قضیه‌ای عام: «أَ ولا يَذْكُرُ الْإِنْسانُ أَنَّا خَلَقْناهُ من قَبْلُ ولَمْ يَكُ شَيْئاً» (آیا انسان به یاد نمی‌آورد که ما او را پیش از این آفریدیم، در حالی که چیزی نبود؟) (مریم: ۶۷). این تنبیهی است بر شرف مرتبه: «هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ من الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً» (آیا بر انسان زمانی از روزگار نگذشت که چیزی درخور ذکر نبود؟) (انسان: ۱) با وجود عینش، زیرا زمان دهر بر او گذشته است.\n\nپس فقر، احتیاج ذاتی است بدون تعیین حاجت، به دلیل جهل او به آنچه برایش اصلح است. و از اسماء خداوند، «المانع» (بازدارنده) است، در حالی که او «أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ» (به هر چیزی آفرینش (خلق) آن را عطا کرده است) (طه: ۵۰)، حتی غرض را، هنگامی که آن را در ما آفرید، آفرینش آن را به آن عطا کرد. پس برای فرود آوردن صاحبان اغراض، منع نمی‌کند مگر به خاطر مصلحت، همان‌گونه که به قومی مهلت می‌دهد «لِيَزْدادُوا إِثْماً» (تا بر گناه خود بیفزایند) (آل عمران: ۱۷۸). پس گناه را به آنها عطا کرده، همان‌گونه که آفرینش گناه را به آن عطا کرده است. پس انعام حق (الحق) محدود نمی‌شود و قابل‌ها بر اساس استعدادهایشان می‌پذیرند. پس منع او، عطایی است به دلیل علمش به مصالح. به همین دلیل از برخی حکایت شده که از او درباره فقیر پرسیدند، گفت: «کسی که به طور معین حاجتی به خدا ندارد.» و متذکر شد که احتیاج او ذاتی است. و خداوند «به هر چیزی آفرینش (خلق) آن را عطا کرده است»، پس آنچه مصلحت تو در آن است را به تو عطا کرده، اگر می‌دانستی. بنابراین برای صاحب این مقام چیزی باقی نمی‌ماند که از خدا بخواهد.\n\nو سؤال (درخواست) تشریع نشد مگر برای کسی که این شهود (الشهود) را ندارد. و چون دید که او از اغیار (غیر خدا) سؤال می‌کند، غیرت ورزید و برای او تشریع کرد که از خودش سؤال کند. و چون در علم ازلی او سبقت گرفته بود که اقوامی را می‌آفریند و در آنها سؤال از اغیار را می‌آفریند و آنها را از این علم که او مسئول حقیقی در هر عین مسئولی است که به آن نیازمندند، از جماد و نبات و حیوان و ملک و دیگر مخلوقات، محجوب می‌سازد، به ما خبر داد که مردم فقیر (الفقراء) به سوی خدا هستند، یعنی او مسئول حقیقی است، زیرا «بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ» (ملکوت هر چیزی به دست اوست.) (مؤمنون: ۸۸). پس فقر به سوی خدا اصل است. پس عالمان به خدا کسانی هستند که احوال خود را حفظ می‌کنند.\n\n### (وصل) [غنی به واسطه خدا]\n\nغنی به واسطه خدا (الغني بالله) فقیر به سوی اوست. پس نسبت دادن با لفظ فقر به خدا، اولی‌تر از نسبت دادن با غنا (بی‌نیازی) است، زیرا غنا (الغني) نعت ذاتی است که مناسبت میان ذات حق (الحق) و خلق را از میان برمی‌دارد.\n\nو هر طلبی، نشان‌دهنده مناسبتی است، زیرا آنچه حاصل است طلب نمی‌شود. پس طلب تنها در چیزی است که در حال طلب نزد طالب نیست. به همین دلیل، طلب تنها به عدم (نیستی) که عین معدوم است، تعلق می‌گیرد. و ممکن است آن مطلوب در عین موجودی باشد. و هیچ عین موجودی در هستی نیست مگر طالب. پس در هستی هیچ کس نیست مگر فقیری که آنچه را طلب کرده است.\n\nو فقر از سایر صفات به امری متمایز می‌شود که برای غیر آن نیست، و آن این است که فقر صفتی برای معدوم و موجود است. در حالی که شرط هر صفت وجودی این است که به موجود قائم باشد. آیا نمی‌بینی که ممکن (الممکن) در حال عدمش به مرجّح نیازمند است، و هنگامی که موجود شد، باز هم به استمرار وجود و حفظ آن بر خود نیازمند است؟ پس او پیوسته فقیر و صاحب فقر است، چه در حال وجودش و چه در حال عدمش. پس فقر از نظر حکم، عام‌ترین مقامات است.\n\nپس کسی که از این صفت، اضافه‌ای خاص کسب می‌کند، و آن فقر به سوی خداست نه به سوی غیر او، به واسطه آن ستایش می‌شود و این همان چیزی است که او را سعادتمند می‌سازد و به خدا نزدیک می‌کند. و هر وصفی که انسان بر آن سرشته شده، مانند بخل، حرص، شره (طمع شدید) و حسد و غیره، در این اضافه شریک است. این صفات به واسطه اضافه و مصرف (جهت‌گیری) شرافت می‌یابند و بالا می‌روند، و به واسطه اضافه و مصرف پست می‌شوند و فرو می‌افتند.\n\nهیچ فقری بزرگ‌تر از فقر پادشاهان نیست، زیرا او به مشغله‌هایش و به هر آنچه که پادشاهی‌اش با آن صحیح می‌شود، نیازمند است، و او به مُلک خود که نام پادشاهی را بر او باقی می‌گذارد، فقیر است. در سال پانصد و هشتاد و یکم (۵۸۱ق) به سلطان صلاح‌الدین یوسف بن ایوب (رحمه الله) گفته شد، هنگامی که ابوالقمح منجم ذکر کرد که در این سال بادی عظیم خواهد وزید که بر هیچ چیز نمی‌گذرد «إِلَّا جَعَلَتْهُ كَالرَّمِيمِ» (مگر آنکه آن را مانند استخوان‌های پوسیده می‌سازد) (ذاریات: ۴۲). برخی از همنشینانش به او اشاره کردند که در زمین پناهگاهی بسازد تا شب وزیدن آن باد در آن باشد. او گفت: «و مردم هلاک می‌شوند؟» به او گفته شد: «بله.» او گفت: «اگر مردم هلاک شوند، من بر چه کسی پادشاه یا سلطان باشم؟ خیری در زندگی پس از رفتن مُلک نیست. بگذارید پادشاه بمیرم. به خدا سوگند، این کار را نمی‌کنم.» پس بنگر که این چقدر نیکوست.\n\nپس هر موجود اضافی، به فقر متحقق است، اگرچه آن را درک نکند، و اگر آن را بیابد، نمی‌داند که آن همان چیزی است که فقر نامیده می‌شود. و چون حکم فقر این است، پس فقر به سوی خداوند متعال که «بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ» (ملکوت هر چیزی به دست اوست)، ثابت و موجود است. و اشاره به همین است در سخن خداوند متعال: «سَنَكْتُبُ ما قالُوا» (آنچه را گفتند خواهیم نوشت)، یعنی آن را واجب خواهیم ساخت، یعنی خواهند دانست که فقر نعتی واجب است که در آن شک نمی‌کنند، وجوبی ذاتی، به خاطر سخنشان که «ونَحْنُ أَغْنِياءُ» (و ما بی‌نیازیم)، زیرا آنها از آنچه امر بر آن است، یعنی فقرشان، محجوب شدند. به همین دلیل کافر بودند، پس آنچه را که با ذوق از خودشان می‌دانستند و قادر به انکارش نبودند، پوشاندند، اگرچه لاف زدند، اما حالشان آنها را تکذیب می‌کند. پس گفتند: «ما بی‌نیازیم»، در حالی که بی‌نیاز نیستند، و گفتند: «إِنَّ الله فَقِيرٌ» (خداوند فقیر است)، در حالی که از حیث ذاتش فقیر نیست، زیرا او «غَنِيٌّ عَنِ الْعالَمِينَ» (بی‌نیاز از جهانیان است.) (آل عمران: ۹۷).\n\nو پیش از این در مواضعی از این کتاب، معنای سخن او: «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (پس همانا خداوند بی‌نیاز از جهانیان است) بیان شده است، و اینکه این سخن مانند سخن او: «والله هُوَ الْغَنِيُّ» (و خداوند همان بی‌نیاز است) و مانند سخن او: «والله الْغَنِيُّ وأَنْتُمُ الْفُقَراءُ» (و خداوند بی‌نیاز است و شما نیازمندان هستید) نیست. پس اگر دانستی که فقر به این مرتبه است، ملازمت کن به حاضر داشتن آن در هر نفس و در هر حال، و فقر خود را به خدا به طور مطلق و بدون تعیین معلق کن، که این برای تو اولی‌تر است. و اگر نمی‌توانی به عدم تعیین دست یابی، دست کم آن را با تعیین به خداوند متعال معلق کن.\n\nخداوند متعال به موسی وحی کرد: «یا موسى لا تجعل غيري موضع حاجتك وسلني حتى الملح تلقيه في عجينك» (ای موسی، غیر مرا جایگاه حاجت خود قرار مده و از من بخواه، حتی نمکی را که در خمیرت می‌اندازی.)\n\nاین تعلیم خداوند به پیامبرش موسی (علیه السلام) است. و من او را (خداوند سبحان و متعال) در خواب دیدم، پس به من فرمود: «مرا در امور خود وکیل کن.» پس او را وکیل کردم و جز عصمت محض ندیدم. سپاس از آنِ خداست بر این امر. خداوند متعال ما را از فقیران به سوی خود به واسطه خودش قرار دهد، زیرا فقر به سوی او (تعالی) به واسطه خودش، عین غنا (بی‌نیازی) است، چون او غنی (الغني) است و تو به واسطه او فقیر هستی، پس تو به واسطه او از جهانیان بی‌نیاز هستی. این را بدان."
  },
  "page_count": 3
}