{
  "id": 253,
  "title": {
    "ar": "الباب الثالث والخمسون ومائتان في معرفة الإثبات وهو أحكام العادات وإثبات المواصلات",
    "en": "Chapter Two Hundred and Fifty-Third, concerning the Gnosis of Affirmation (الإثبات), which is the Rulings of Customary Practices (العادات) and the Affirmation of Connections (المواصلات).",
    "ur": "باب دو سو تریپن (۲۵۳): اثبات کی معرفت میں، اور وہ عادات کے احکام اور مواصلات کا اثبات ہے۔",
    "fa": "باب دویست و پنجاه و سوم: در معرفت اثبات، و آن عبارت است از احکام عادات و اثبات مواصلات"
  },
  "content": {
    "ar": "## «الباب الثالث والخمسون ومائتان في معرفة الإثبات وهو أحكام العادات وإثبات المواصلات»\n\n\n> إلى حضرة الإثبات أعملت همتي *** من المحو لما أن دعاني إمامها\n\n\n> فلما أتينا حضرة لم نزل بها *** بهاد وحاد خلفها وأمامها\n\n\n> إلى أن تراءت بين سلع وحاجر *** وقد ساقها شوقا إلى غرامها\n\n\n### [الإثبات هو الأمر المقرر الذي عليه جميع العالم‏]\n\n\nالإثبات هو الأمر المقرر الذي عليه جميع العالم فمن طلب من غير نبي أو مشد لنبي رفع حكم العوائد فقد أساء الأدب وجهل وأما هذا الذي يسمونه خرق عادة هو عادة إذ كان ثبوت خرق العادة عادة فما محوت العادات إلا بإثباتها غير أن صاحب الإثبات لا بد أن تكون له وصلة بالحق ولهذا يثبت أحكام العادات فإن صاحبه وضعها ومن شرط الصحبة الموافقة فكيف يصحبه ويكون مواصلا له ويحكم عليه بإزالة ما يرى الحكمة في ثبوته ولا سيما وقد علم صاحب هذا المقام أن الله حكيم عليم بما يجريه ويثبته فيثبت ما أثبته صاحبه وإن لم يفعل وطلب غير ذلك فهو منازع ومن نازعك فما هو بصاحب لك ولا أنت بصاحب له إن نازعته وكان إلى العناد أقرب فصاحب الإثبات دائم المواصلة مع الحق فإنه يثبت أحكام العادات لأنه يشهده فيها فلا يمكن له مع هذا أن يطلب رفع أحكامها ولا محوها فهذا مقام الإثبات على غاية الإيجاز والبيان والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Fifty-Three: Concerning the Knowledge of Affirmation (الإثبات), which is the Rulings of Customary Habits and the Affirmation of Connections (إثبات المواصلات)\n\n> To the Divine Presence of Affirmation (الإثبات) I directed my spiritual resolve,\n> Away from Annihilation (المحو), when its Imam called me.\n>\n> And when we came to a Presence, we did not cease to be there,\n> With a guide and a driver, behind it and before it.\n>\n> Until it appeared between Sal‘ and Hajir,\n> And longing drove it toward its passionate love.\n\n### [Affirmation (الإثبات) is the Established Matter upon which the Entire Cosmos Rests]\n\nAffirmation (الإثبات) is the established matter upon which the entire cosmos rests. Therefore, whoever seeks the lifting of the ruling of customary habits (أحكام العادات) from anyone other than a Prophet or one who supports a Prophet, has behaved improperly and is ignorant. As for that which they call the breaking of custom (*kharq ‘āda*), it is itself a custom, since the establishment of the breaking of custom is a custom. Thus, I did not efface the customary habits except by affirming them.\n\nHowever, the possessor of Affirmation (*ṣāḥib al-ithbāt*) must necessarily have a connection (*waṣla*) with the Real (الحق), and for this reason, he affirms the rulings of customary habits. For his Companion [the Real] established them, and the condition of companionship (*ṣuḥba*) is agreement (*muwāfaqa*). How can he be His companion and be connected to Him, yet rule against Him by seeking the removal of that which He sees wisdom in establishing? Especially since the possessor of this station (*maqām*) knows that Allah is Wise (*Ḥakīm*) and All-Knowing (*‘Alīm*) concerning what He executes and establishes.\n\nThus, he affirms what his Companion has affirmed. If he does not do so and seeks otherwise, then he is a contender. And whoever disputes with you is not a companion to you, nor are you a companion to him if you dispute with him, and he is closer to obstinacy.\n\nTherefore, the possessor of Affirmation is in perpetual connection (*muwāṣala*) with the Real, for he affirms the rulings of customary habits because he witnesses Him [the Real] within them. With this understanding, it is impossible for him to seek the lifting of their rulings or their effacement.\n\nThis, then, is the station of Affirmation, presented with the utmost brevity and clarity. And Allah says the Truth, and He guides the way.",
    "ur": "باب نمبر دو سو ترپن: الإثبات (اثبات) کی معرفت میں، جو عادات کے احکام اور مواصلات (مواصلات) کے اثبات پر مشتمل ہے۔\n\nمیں نے اپنی ہمت کو حضرۃ الإثبات (اثبات کی بارگاہ) کی طرف لگایا\nمحو (مٹانے) سے، جب اس کے امام نے مجھے بلایا۔\nجب ہم اس بارگاہ میں آئے تو ہم وہاں سے نہیں ہٹے\nاس کے پیچھے اور آگے رہبر اور ہانکنے والا موجود تھا۔\nیہاں تک کہ وہ سلع اور حاجر کے درمیان نظر آئی\nاور شوق اسے اس کے عشق کی طرف لے گیا۔\n\n### [الإثبات (اثبات) وہ مقرر شدہ امر ہے جس پر تمام عالم قائم ہے]\n\nالإثبات (اثبات) وہ مقرر شدہ امر ہے جس پر تمام عالم قائم ہے۔ پس جس نے کسی نبی یا نبی کے معاون کے علاوہ کسی اور سے عوائد (عادات) کے حکم کو اٹھانے کا مطالبہ کیا، تو اس نے بے ادبی کی اور جہالت کا مظاہرہ کیا۔ اور یہ جسے وہ خرق عادت (عادت کا ٹوٹنا) کہتے ہیں، وہ بھی ایک عادت ہی ہے، کیونکہ خرق عادت (عادت کا ٹوٹنا) کا ثابت ہونا بھی ایک عادت ہے۔ پس میں نے عادات کو مٹایا نہیں مگر ان کے الإثبات (اثبات) کے ذریعے۔\n\nمگر یہ کہ صاحب الإثبات (اثبات والا) کے لیے ضروری ہے کہ اس کی الحق (ذات حق) کے ساتھ وصلہ (تعلق) ہو۔ اور اسی وجہ سے وہ عادات کے احکام کو ثابت کرتا ہے، کیونکہ اس کے صاحب (مالک) نے ہی انہیں وضع کیا ہے۔ اور صحبت (رفاقت) کی شرط موافقت ہے۔ تو وہ اس کا ساتھی کیسے ہو سکتا ہے اور اس کے ساتھ مواصل (متصل) کیسے ہو سکتا ہے، جبکہ وہ اس پر اس چیز کو زائل کرنے کا حکم لگائے جس کے ثبوت میں وہ (الحق) حکمت دیکھتا ہے؟ خاص طور پر جب کہ اس مقام کا صاحب یہ جانتا ہے کہ اللہ تعالیٰ حکیم (حکمت والا) اور علیم (جاننے والا) ہے اس چیز کے بارے میں جسے وہ جاری کرتا اور ثابت کرتا ہے۔ پس وہ اسی چیز کو ثابت کرتا ہے جسے اس کے صاحب نے ثابت کیا۔ اور اگر وہ ایسا نہ کرے اور اس کے علاوہ کسی اور چیز کا مطالبہ کرے تو وہ جھگڑنے والا ہے۔ اور جس نے تم سے جھگڑا کیا، تو نہ وہ تمہارا ساتھی ہے اور نہ تم اس کے ساتھی ہو اگر تم نے اس سے جھگڑا کیا، اور وہ عناد (ضد) کے زیادہ قریب تھا۔\n\nپس صاحب الإثبات (اثبات والا) الحق (ذات حق) کے ساتھ دائمی المواصلۃ (مواصلت) میں رہتا ہے۔ کیونکہ وہ عادات کے احکام کو ثابت کرتا ہے، اس لیے کہ وہ ان میں الحق (ذات حق) کا الشہود (شہود) کرتا ہے۔ لہٰذا اس کے لیے اس کے ساتھ یہ ممکن نہیں کہ وہ ان کے احکام کو اٹھانے یا انہیں محو (مٹانے) کا مطالبہ کرے۔ پس یہ الإثبات (اثبات) کا مقام ہے جو نہایت اختصار اور وضاحت کے ساتھ بیان کیا گیا ہے۔\n\nاور اللہ الحق (سچ) فرماتا ہے اور وہی سیدھے راستے کی طرف ہدایت دیتا ہے۔",
    "fa": "باب دویست و پنجاه و سوم در معرفت اثبات (الإثبات)، و آن عبارت است از احکام عادات و اثبات مواصلات (المواصلات).\n\nهمت خود را از محو (المحو) به سوی حضرت اثبات (الإثبات) به کار انداختم، آنگاه که امامش مرا فراخواند.\n\nو چون به آن حضرت رسیدیم، پیوسته در آن بودیم، با راهنمایی و راندنی که پشت و پیش آن بود.\n\nتا آنکه میان سلع و حاجر نمایان شد، و آن را از سر شوق به سوی عشقش (غرامها) راند.\n\n### [اثبات (الإثبات) همان امر مقرر و ثابتی است که تمام عالم بر آن است]\n\nاثبات (الإثبات) همان امر مقرر و ثابتی است که تمام عالم بر آن است. پس هر کس جز پیامبر یا تقویت‌کننده پیامبر، خواهان برداشته شدن حکم عادات (العوائد) باشد، بی‌ادبی کرده و جاهل است. و اما آنچه آن را خرق عادت (خرق عادة) می‌نامند، خود عادتی است؛ زیرا ثبوت خرق عادت، خود عادتی است. پس من عادات را محو (المحو) نکردم مگر به اثبات (الإثبات) آنها.\n\nجز اینکه صاحب اثبات (صاحب الإثبات) ناگزیر باید وصلتی با حق (الحق) داشته باشد، و به همین دلیل است که احکام عادات را ثابت می‌دارد؛ زیرا صاحب او (حق) آنها را وضع کرده است. و از شرط‌های مصاحبت (الصحبة)، موافقت (الموافقة) است. پس چگونه می‌تواند مصاحب او باشد و با او در مواصلت (المواصلة) باشد، در حالی که بر او حکم کند که آنچه را حکمت در ثبوتش می‌بیند، از بین ببرد؟ به ویژه آنکه صاحب این مقام (مقام) می‌داند که خداوند حکیم و داناست به آنچه جاری می‌سازد و ثابت می‌دارد. پس آنچه را صاحبش (حق) ثابت کرده، او نیز ثابت می‌دارد. و اگر چنین نکند و غیر آن را طلب کند، پس او منازع (منازع) است. و هر کس با تو منازعه کند، نه او مصاحب توست و نه تو مصاحب اویی، اگر با او منازعه کنی و او به عناد (العناد) نزدیک‌تر باشد.\n\nپس صاحب اثبات (صاحب الإثبات) پیوسته در مواصلت (المواصلة) با حق (الحق) است، زیرا او احکام عادات را ثابت می‌دارد، چون حق را در آنها شهود (الشهود) می‌کند. با این حال، برای او ممکن نیست که خواهان برداشته شدن احکام آنها یا محو (المحو) آنها باشد. پس این است مقام اثبات (مقام الإثبات) در نهایت ایجاز و بیان. و خداوند حق را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 1
}