{
  "id": 229,
  "title": {
    "ar": "الباب التاسع والعشرون ومائتان في حال الهمة",
    "en": "Chapter Two Hundred and Twenty-Nine: Concerning the State of Concentrated Will (الهمة)",
    "ur": "۲۲۹ واں باب: ہمت (الہمۃ) کے حال کے بیان میں",
    "fa": "باب دویست و بیست و نهم در بیان حال همت."
  },
  "content": {
    "ar": "## «الباب التاسع والعشرون ومائتان في حال الهمة»\n\n\n> إذا كنت في همة فاتئد *** فإن الوجود لها مستعد\n\n\n> ولا تفتحن بها مغلقا *** ولا تك ممن بها يستبد\n\n\n> ولا تركنن إليها وكن *** كما أنت في باطن المعتقد\n\n\n### [إن الله هو الفاعل للأشياء]\n\n\nنريد بباطن المعتقد كون الله هو الفاعل للأشياء لا أثر فيها لهمة مخلوق ولا لسبب ظاهر ولا باطن لعلمه بأن الأسباب إنما جعلها لله ابتلاء ليتميز من يقف عندها ممن لا يرى وقوع الفعل إلا بها ممن لا يرى ذلك ويرى الفعل لله من ورائها عندها لا بها اعلم أن الهمة يطلقها القوم بإزاء تجريد القلب للمنى ويطلقونها بإزاء أول صدق المريد ويطلقونها بإزاء جمع الهمم بصفاء الإلهام فيقولون الهمة على ثلاث مراتب همة تنبه وهمة إرادة وهمة حقيقة فاعلم إن همة التنبه هي تيقظ القلب لما تعطيه حقيقة الإنسان مما يتعلق به التمني سواء كان محالا أو ممكنا فهي تجرد القلب للمنى فتجعله هذه الهمة أن ينظر فيما يتمناه ما حكمه فيكون بحسب ما يعطيه العلم بحكمه فإن أعطاه الرجوع عن ذلك رجع وإن أعطاه العزيمة فيه عزم فيحتاج صاحب هذه الهمة إلى علم ما تمناه وأما همة الإرادة وهي أول صدق المريد فهي همة جمعية لا يقوم لها شي‏ء وهذه الهمة توجد كثيرا في قوم يسمون بإفريقية العزابية يقتلون بها من يشاءون فإن النفس إذا اجتمعت أثرت في أجرام العالم وأحواله ولا يعتاض عليها شي‏ء حتى أدى من علم ذلك ممن ليس عنده كشف ولا قوة إيمان أن الآيات الظاهرة في العالم على أيدي بعض الناس إنما ذلك راجع إلى هذه الهمة ولها من القوة بحيث أن لها إذا قامت بالمريد أثرا في الشيوخ الكمل فيتصرفون فيهم بها وقد يفتح على الشيخ في علم ليس عنده ولا هو مراد به بهمة هذا المريد الذي يرى أن ذلك عند هذا الشيخ فيحصل ذلك العلم في الوقت للشيخ بحكم العرض ليوصله إلى هذا الطالب صاحب الهمة إذ لا يقبله إلا منه وذلك لأن هذا المريد جمع همته على هذا الشيخ في هذه المسألة والحكايات في ذلك مشهورات مذكورة وأثر هذه الهمة في الإلهيات‏\n\n\nقول الله تعالى أنا عند ظن عبدي بي فليظن بي خيرا\n\n\nفمن جمع همته على ربه إنه لا يغفر الذنب إلا هو وأن رحمته وَسِعَتْ كُلَّ شَيْ‏ءٍ كان مرحوما بلا شك ولا ريب قال تعالى وذلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْداكُمْ فَأَصْبَحْتُمْ من الْخاسِرِينَ لأنهم ظنوا أن الله لا يعلم كثيرا مما يعملون فلهذا قلنا إنه لا بد من علم‏\nما تتعلق به هذه الهمة فإن تعلقت بمحال لم يقع وعاد وبالها على صاحبها فأثر في نفسه بهمته وإن تعلقت بما ليس بمحال وقع ولا بد وهنا من هذه الطائفة تعلقت بالمحال وهو نفي العلم عن الله ببعض أعمال العباد فعذبهم الله بأعمالهم فظنهم أرداهم وهذه مسألة لا يمكننا أن أو فيها حقها لاتساعها وما يدخل فيها مما لا ينبغي أن يقال ولا يذاع غير أن لها النفوذ حيث وجدت فإذا لم تجتمع ودخلها خلل فليس لها هذا الحكم فلو إن هؤلاء الذين ظنوا بربهم أنه لا يعلم كثيرا مما يعملون يظنون أن الله لا يؤاخذ على الجريمة لما هو عليه من الصفح والتجاوز وتحجبهم جمعيتهم على هذا عن بطشه تعالى وشديد عقابه لم يؤاخذهم فإن ظنهم أنما تعلق بممكن وأما همة الحقيقة التي هي جمع الهمم بصفاء الإلهام فتلك همم الشيوخ الأكابر من أهل الله الذين جمعوا هممهم على الحق وصيروها واحدة لاحدية المتعلق هربا من الكثرة وطلبا لتوحيد الكثرة أو للتوحيد فإن العارفين أنفوا من الكثرة لا من أحديتها في الصفات كانت أو في النسب أو في الأسماء وهم متميزون في ذلك أي هم على طبقات مختلفة وإن الله يعاملهم بحسب ما هم عليه لا يردهم عن ذلك إذ لكل مقام وجه إلى الحق وإنما يفعل ذلك ليتميز الكثير الاختصاص بالله الذي اصطنعه الله لنفسه من عباد الله عن غيره من العبيد فإن الله أنزل العالم بحسب المراتب لتعمير المراتب فلو لم يقع التفاضل في العالم لكان بعض المراتب معطلا غير عامر وما في الوجود شي‏ء معطل بل هو معمور كله فلا بد لكل مرتبة من عامر يكون حكمه بحسب مرتبته ولذلك فضل العالم بعضه بعضا وأصله في الإلهيات الأسماء الإلهية أين إحاطة العالم من إحاطة المريد من إحاطة القادر فتميز العالم عن المريد والمريد عن القادر بمرتبة المتعلق فالعالم أعم إحاطة فقد زاد وفضل على المريد والقادر بشي‏ء لا يكون للمريد ولا للقادر من حيث إنه مريد وقادر فإنه يعلم نفسه تعالى ولا يتصف بالقدرة على نفسه ولا بالإرادة لوجوده إذ من حقيقة الإرادة أن لا تتعلق إلا بمعدوم والله موجود ومن شأن القدرة أن لا تتعلق إلا بممكن أو واجب بالغير وهو واجب الوجود لنفسه فمن هناك ظهر التفاضل في العالم لتفاضل المراتب فلا بد من تفاضل العامرين لها فلا بد من التفاضل في العالم إذ هو العامر لها الظاهر بها وهذا مما لا يدرك كشفا بل إدراكه بصفاء الإلهام فيكشف المكاشف عمارة المراتب بكشفه للعامرين لها ولا يعلم التفاضل إلا بصفاء الإلهام الإلهي فقد نبهناك على معرفة الهمة بكلام مبسوط في إيجاز فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 229: Concerning the State of Spiritual Resolve (الهمة)\n\n> If you possess Spiritual Resolve (همة), proceed with deliberation,\n> For Existence (الوجود) is ready for it.\n\n> Do not use it to open what is sealed,\n> And do not be among those who are self-willed through it.\n\n> Do not rely upon it, but be\n> As you are in the inner core of your conviction (المعتقد).\n\n### [Indeed, Allah is the Agent of all Things]\n\nBy the inner core of conviction, we mean that Allah is the Agent of all things, and that there is no effect in them due to the Spiritual Resolve (همة) of a creature, nor to any apparent or hidden cause. This is because He knows that He only established the causes as a trial, so that those who stop at them may be distinguished from those who do not see the occurrence of the act except through them, and from those who do not see that, but see the act belonging to Allah, behind them, at them, but not by them.\n\nKnow that the people [Sufis] use the term *al-Himma* [Spiritual Resolve] in relation to the heart's dedication to desires, and they use it in relation to the first sincerity of the seeker (*al-Murid*), and they use it in relation to the gathering of resolves through the purity of Inspiration (*al-Ilham*). Thus, they say that Spiritual Resolve is of three Levels (المراتب): the *Himma* of Awakening (تنبه), the *Himma* of Will (إرادة), and the *Himma* of Reality (حقيقة).\n\nKnow that the *Himma* of Awakening is the heart's vigilance regarding what the human reality affords concerning that which is desired, whether it is impossible (*muhal*) or possible (*mumkin*). It is the heart's dedication to desires, and this *Himma* causes the heart to examine the ruling concerning what it desires, and the result is according to what the knowledge of its ruling dictates. If [knowledge] dictates withdrawal from that, he withdraws; and if it dictates resolve concerning it, he resolves. Thus, the possessor of this *Himma* requires knowledge of what he desires.\n\nAs for the *Himma* of Will, which is the first sincerity of the seeker, it is a concentrated *Himma* (جمعية) that nothing can withstand. This *Himma* is often found among a group in Ifriqiya called the 'Azzabiyya, who kill whomever they wish with it. For when the soul is concentrated, it affects the bodies and states of the World (العالم), and nothing can resist it. This has led those who know this, but who lack Unveiling (*Kashf*) or strength of faith, to conclude that the manifest signs appearing in the World at the hands of certain people are merely attributable to this *Himma*.\n\nIt possesses such power that when it resides in the seeker, it affects the Perfect Shaykhs, who then act through it. A Shaykh may even be granted an opening in a knowledge he does not possess, nor was it intended for him, due to the *Himma* of this seeker who believes that knowledge resides with that Shaykh. That knowledge then occurs instantaneously for the Shaykh by way of presentation, so that he may convey it to this student, the possessor of the *Himma*, since the student will only accept it from him. This is because the seeker concentrated his *Himma* upon this Shaykh regarding this specific matter. The stories concerning this are well-known and recorded.\n\nThe effect of this *Himma* in Divine Matters (*al-Ilahiyyat*) is the saying of Allah the Exalted: \"I am as My servant thinks of Me, so let him think well of Me.\"\n\nWhoever concentrates his *Himma* upon his Lord, believing that none forgives sins but Him, and that His Mercy <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompasses all things), will undoubtedly and certainly be shown mercy. The Exalted said: <<وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ>> (And that was your thought which you thought about your Lord; it has ruined you, and you have become among the losers) [Q 41:23]. This is because they thought that Allah did not know much of what they were doing. For this reason, we said that knowledge is indispensable: knowledge of that to which this *Himma* relates. If it relates to the impossible, it will not occur, and its ill consequence will return upon its possessor, affecting his own soul through his *Himma*. But if it relates to what is not impossible, it will certainly occur.\n\nHere, some of this group related their *Himma* to the impossible, which was the denial of Allah's Knowledge concerning some of the servants' deeds. Thus, Allah punished them for their deeds, and their thought ruined them. This is a matter whose full scope we cannot cover due to its vastness and what it includes that should not be spoken or divulged, except that [the *Himma*] has efficacy wherever it is found. If it is not concentrated, and defect enters it, it does not possess this ruling. If those who thought concerning their Lord that He did not know much of what they were doing had instead thought that Allah would not hold them accountable for the transgression, due to His nature of forgiveness and overlooking, and if their concentration (*Jam'iyya*) upon this thought shielded them from His mighty grasp and severe punishment, He would not have held them accountable, for their thought would then have related to a possible thing (*mumkin*).\n\nAs for the *Himma* of Reality (حقيقة), which is the gathering of resolves through the purity of Inspiration (*Ilham*), these are the resolves of the great Shaykhs among the People of Allah (*Ahl Allah*), who concentrated their resolves upon The Real (*al-Haqq*) and made them one, due to the Oneness (*Ahadiyya*) of the object of relation, fleeing from Multiplicity (*al-Kathra*) and seeking the unification of Multiplicity or seeking Unity (*al-Tawhid*). For the Gnostics (*al-Arifin*) recoil from Multiplicity, but not from its Oneness, whether that be in the Attributes (*al-Sifat*), the relations (*al-Nisab*), or the Names (*al-Asma*). They are distinguished in this, meaning they are on different levels (*Tabaqat*).\n\nAnd Allah deals with them according to their state; He does not turn them away from it, for every spiritual station (*Maqam*) has a face turned toward The Real. He only does this so that the one who has great specialization with Allah—whom Allah has chosen for Himself among the servants of Allah—may be distinguished from others among the servants. For Allah brought down the World according to the Levels (المراتب) in order to populate the Levels. If differentiation (*al-Tafadul*) did not occur in the World, some Levels would be idle and unpopulated. There is nothing idle in Existence (الوجود); rather, it is all populated. Thus, every Level must have a resident whose ruling is according to his Level.\n\nFor this reason, the World favors one part over another, and its origin in Divine Matters lies in the Divine Names (*al-Asma al-Ilahiyya*). Where is the comprehensiveness of the All-Knowing (*al-Alim*) compared to the comprehensiveness of the Willing (*al-Murid*) compared to the comprehensiveness of the Powerful (*al-Qadir*)? Thus, the All-Knowing is distinguished from the Willing, and the Willing from the Powerful, by the level of the object of relation. The All-Knowing is more comprehensive in scope; thus, it has surpassed and excelled the Willing and the Powerful by something that does not belong to the Willing or the Powerful, insofar as they are Willing and Powerful. For He knows Himself, the Exalted, but is not characterized by Power over Himself, nor by Will for His own Existence, since the reality of Will is that it only relates to what is non-existent, and Allah is Existent. And the nature of Power is that it only relates to what is possible or what is necessary by another, while He is the Necessary Existent by Himself.\n\nFrom this, differentiation appeared in the World due to the differentiation of the Levels, and thus the residents who populate them must also be differentiated. Therefore, differentiation in the World is necessary, as it is the resident of the Levels and manifests through them. This is something that is not grasped by Unveiling (*Kashf*), but its grasp is through the purity of Inspiration (*Ilham*). Thus, the one who receives Unveiling reveals the population of the Levels by his unveiling of their residents, but the differentiation is only known through the purity of Divine Inspiration.\n\nWe have thus alerted you to the knowledge of Spiritual Resolve (*al-Himma*) in an expansive yet concise discourse, so understand. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way) [Q 33:4].",
    "ur": "باب نمبر دو سو انتیس: عزیمت (الہمۃ) کے حال میں\n\nجب تو عزیمت (الہمۃ) میں ہو تو ٹھہر جا،\nکیونکہ ہستی (الوجود) اس کے لیے تیار ہے۔\nاس کے ذریعے کوئی بند دروازہ نہ کھول،\nاور نہ ہی ان میں سے ہو جو اس میں خودسری کرتے ہیں۔\nاور اس پر بھروسہ نہ کر، بلکہ ہو جا\nجیسا کہ تو باطنِ عقیدہ میں ہے۔\n\n### [بے شک اللہ ہی اشیاء کا فاعل ہے]\n\nباطنِ عقیدہ سے ہماری مراد یہ ہے کہ اللہ ہی اشیاء کا فاعل ہے، جس میں کسی مخلوق کی عزیمت (الہمۃ) کا کوئی اثر نہیں، نہ کسی ظاہری سبب کا اور نہ کسی باطنی سبب کا۔ یہ اس لیے کہ اللہ جانتا ہے کہ اس نے اسباب کو صرف آزمائش کے لیے بنایا ہے تاکہ ان لوگوں میں تمیز ہو جائے جو ان اسباب پر رک جاتے ہیں، ان لوگوں سے جو فعل کا وقوع صرف ان اسباب کے ذریعے دیکھتے ہیں، اور ان لوگوں سے جو یہ نہیں دیکھتے بلکہ فعل کو ان اسباب کے پیچھے، ان کے پاس، اللہ کے لیے دیکھتے ہیں نہ کہ ان اسباب کے ذریعے۔ جان لو کہ اہلِ تصوف عزیمت (الہمۃ) کا اطلاق قلب کو آرزوؤں کے لیے خالص کرنے کے معنی میں کرتے ہیں، اور اس کا اطلاق مرید کی پہلی سچائی کے معنی میں کرتے ہیں، اور اس کا اطلاق صفائے الہام کے ساتھ عزائم کو جمع کرنے کے معنی میں کرتے ہیں۔ چنانچہ وہ کہتے ہیں کہ عزیمت (الہمۃ) کے تین مراتب ہیں: عزیمتِ تنبہ (بیداری کی عزیمت)، عزیمتِ ارادہ (ارادے کی عزیمت)، اور عزیمتِ حقیقت (حقیقت کی عزیمت)۔\n\nپس جان لو کہ عزیمتِ تنبہ (ہمۃ التنبه) قلب کی وہ بیداری ہے جو حقیقتِ انسان کے تقاضوں کے مطابق ہوتی ہے، جس کا تعلق تمنا سے ہوتا ہے، خواہ وہ ناممکن ہو یا ممکن۔ یہ قلب کو آرزوؤں کے لیے خالص کر دیتی ہے۔ یہ عزیمت (الہمۃ) اسے اس قابل بناتی ہے کہ وہ اپنی تمنا کے حکم کو دیکھے، اور پھر اس کے حکم کے علم کے مطابق عمل کرے۔ اگر علم اسے اس سے باز رہنے کا حکم دے تو وہ باز آ جاتا ہے، اور اگر اس میں پختگی کا حکم دے تو وہ پختہ ارادہ کر لیتا ہے۔ لہٰذا، اس عزیمت (الہمۃ) کے حامل کو اپنی تمنا کے علم کی ضرورت ہوتی ہے۔\n\nاور جہاں تک عزیمتِ ارادہ (ہمۃ الإرادة) کا تعلق ہے، جو مرید کی پہلی سچائی ہے، تو یہ ایک جامع عزیمت ہے جس کے سامنے کوئی چیز ٹھہر نہیں سکتی۔ یہ عزیمت (الہمۃ) افریقہ میں ایک قوم میں کثرت سے پائی جاتی ہے جسے عزابیہ کہا جاتا ہے، جو اس کے ذریعے جسے چاہتے ہیں قتل کر دیتے ہیں۔ کیونکہ جب نفس مجتمع ہو جاتا ہے تو وہ عالم کے اجسام اور اس کے احوال پر اثر انداز ہوتا ہے اور کوئی چیز اس کا مقابلہ نہیں کر سکتی۔ یہاں تک کہ جن لوگوں کے پاس کشف (الکشف) یا قوتِ ایمان نہیں ہے، ان میں سے جو اس علم کو جانتے ہیں، وہ یہ نتیجہ نکالتے ہیں کہ بعض لوگوں کے ہاتھوں پر عالم میں جو ظاہری نشانیاں (آیات) ظاہر ہوتی ہیں، وہ درحقیقت اسی عزیمت (الہمۃ) کی طرف لوٹتی ہیں۔\n\nاور اس میں اتنی قوت ہوتی ہے کہ جب یہ مرید کے ساتھ قائم ہو جاتی ہے تو کامل شیوخ پر بھی اثر انداز ہوتی ہے، اور وہ اس کے ذریعے ان میں تصرف کرتے ہیں۔ بسا اوقات کسی شیخ پر ایسا علم منکشف ہو جاتا ہے جو اس کے پاس نہیں ہوتا اور نہ ہی وہ اس کا ارادہ رکھتا ہوتا ہے، مگر اس مرید کی عزیمت (الہمۃ) کی وجہ سے جو یہ دیکھتا ہے کہ یہ علم اس شیخ کے پاس موجود ہے، تو وہ علم اسی وقت شیخ کو عارضی طور پر حاصل ہو جاتا ہے تاکہ وہ اسے اس طالبِ عزیمت (الہمۃ) تک پہنچا دے، کیونکہ وہ اسے صرف اسی شیخ سے قبول کر سکتا ہے۔ اور یہ اس لیے ہوتا ہے کہ اس مرید نے اس مسئلے میں اپنی عزیمت (الہمۃ) کو اس شیخ پر مرکوز کر دیا تھا۔\n\nاور اس بارے میں حکایات مشہور و مذکور ہیں۔ اور الٰہیات میں اس عزیمت (الہمۃ) کا اثر یہ ہے:\nاللہ تعالیٰ کا فرمان ہے: \"میں اپنے بندے کے گمان کے پاس ہوتا ہوں، پس وہ مجھ سے اچھا گمان کرے۔\"\n\nپس جس نے اپنی عزیمت (الہمۃ) کو اپنے رب پر اس طرح جمع کر لیا کہ اس کے سوا کوئی گناہ معاف نہیں کرتا اور یہ کہ اس کی رحمت وَسِعَتْ كُلَّ شَيْ‏ءٍ (ہر چیز پر محیط ہے)، تو وہ بلاشبہ و بلا ریب رحم کیا جائے گا۔ اللہ تعالیٰ نے فرمایا: وَذلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْداكُمْ فَأَصْبَحْتُمْ من الْخاسِرِينَ (اور یہ تمہارا وہ گمان ہے جو تم نے اپنے رب کے ساتھ کیا، جس نے تمہیں ہلاک کر دیا، پس تم خسارہ پانے والوں میں سے ہو گئے)۔ یہ اس لیے کہ انہوں نے گمان کیا کہ اللہ ان کے بہت سے اعمال کو نہیں جانتا۔ اسی لیے ہم نے کہا کہ اس علم کا ہونا ضروری ہے جس سے یہ عزیمت (الہمۃ) متعلق ہو۔ اگر یہ کسی ناممکن چیز سے متعلق ہو جائے تو وہ واقع نہیں ہوتی اور اس کا وبال اس کے صاحب پر لوٹ آتا ہے، اور وہ اپنی عزیمت (الہمۃ) کے ذریعے اپنے نفس پر اثر انداز ہوتا ہے۔ اور اگر یہ کسی ایسی چیز سے متعلق ہو جو ناممکن نہیں تو وہ ضرور واقع ہوتی ہے۔\n\nاور یہاں اس گروہ میں سے بعض نے ناممکن چیز سے تعلق قائم کیا، اور وہ یہ ہے کہ اللہ سے بندوں کے بعض اعمال کے علم کی نفی کرنا۔ پس اللہ نے انہیں ان کے اعمال کی وجہ سے عذاب دیا، اور ان کے گمان نے انہیں ہلاک کر دیا۔ یہ ایک ایسا مسئلہ ہے جس کا حق ہم اس کی وسعت اور اس میں شامل ہونے والی ان چیزوں کی وجہ سے ادا نہیں کر سکتے جن کا بیان کرنا اور پھیلانا مناسب نہیں۔ تاہم، جہاں بھی یہ عزیمت (الہمۃ) پائی جاتی ہے، اس میں نفوذ ہوتا ہے۔ لیکن اگر یہ مجتمع نہ ہو اور اس میں کوئی خلل آ جائے تو اس کا یہ حکم نہیں ہوتا۔ اگر یہ لوگ جنہوں نے اپنے رب کے بارے میں یہ گمان کیا کہ وہ ان کے بہت سے اعمال کو نہیں جانتا، یہ گمان کرتے کہ اللہ جرم پر مواخذہ نہیں کرے گا، اس کی صفتِ عفو و درگزر کی بنا پر، اور اس پر ان کی جمعیت انہیں اللہ کے سخت عذاب اور گرفت سے بچا لیتی، تو وہ ان کا مواخذہ نہ کرتا، کیونکہ ان کا گمان ممکن سے متعلق ہوتا۔\n\nاور جہاں تک عزیمتِ حقیقت (ہمۃ الحقيقة) کا تعلق ہے، جو صفائے الہام کے ساتھ عزائم کو جمع کرنا ہے، تو یہ اہلِ اللہ کے اکابر شیوخ کی عزائم ہیں، جنہوں نے اپنی عزائم کو ذات حق (الحق) پر جمع کیا اور انہیں متعلق کی احدیت کے لیے ایک بنا دیا، کثرت سے بھاگتے ہوئے اور کثرت کی توحید یا مطلق توحید کی طلب میں۔ کیونکہ عارفین کثرت سے نفرت کرتے ہیں، نہ کہ صفات میں، یا نسبتوں میں، یا اسماء میں اس کی احدیت سے۔ اور وہ اس میں ممتاز ہیں، یعنی وہ مختلف طبقات پر ہیں۔ اور اللہ ان کے ساتھ ان کے حال کے مطابق معاملہ کرتا ہے، انہیں اس سے نہیں روکتا، کیونکہ ہر مقام کا ذات حق (الحق) کی طرف ایک رُخ ہوتا ہے۔\n\nاور اللہ یہ سب اس لیے کرتا ہے تاکہ وہ بندے جو اللہ کے ساتھ زیادہ اختصاص رکھتے ہیں اور جنہیں اللہ نے اپنے لیے چن لیا ہے، وہ دوسرے بندوں سے ممتاز ہو جائیں۔ بے شک اللہ نے عالم کو مراتب کے مطابق نازل کیا تاکہ مراتب کو آباد کیا جا سکے۔ اگر عالم میں تفاضل (درجات کا فرق) نہ ہوتا تو بعض مراتب معطل اور غیر آباد رہ جاتے۔ اور ہستی (الوجود) میں کوئی چیز معطل نہیں ہے، بلکہ وہ سب آباد ہے۔ لہٰذا، ہر مرتبے کے لیے ایک آباد کرنے والا ضروری ہے جس کا حکم اس کے مرتبے کے مطابق ہو۔ اسی لیے عالم نے ایک دوسرے کو فضیلت دی ہے، اور اس کی اصل الٰہیات میں اسماءِ الٰہیہ ہیں۔\n\nعالم (جاننے والے) کے احاطے کا، مرید (ارادہ کرنے والے) کے احاطے سے، اور قادر (قدرت رکھنے والے) کے احاطے سے کیا مقابلہ؟ پس عالم، مرید سے اور مرید، قادر سے متعلق کی مرتبت کے لحاظ سے ممتاز ہوا۔ عالم (جاننے والا) کا احاطہ سب سے زیادہ عام ہے، چنانچہ اس نے مرید اور قادر پر ایک ایسی چیز کے ذریعے زیادتی اور فضیلت حاصل کی جو مرید اور قادر کو حاصل نہیں ہوتی، اس حیثیت سے کہ وہ مرید اور قادر ہیں۔ کیونکہ وہ (اللہ) اپنی ذات کو جانتا ہے، اور اپنی ذات پر قدرت کی صفت سے متصف نہیں ہوتا، نہ ہی اپنے وجود کے لیے ارادے سے۔ کیونکہ ارادے کی حقیقت یہ ہے کہ وہ صرف معدوم سے متعلق ہو، اور اللہ موجود ہے۔ اور قدرت کا خاصہ یہ ہے کہ وہ صرف ممکن یا واجب بالغیر سے متعلق ہو، جبکہ وہ (اللہ) واجب الوجود لنفسہ ہے۔ اسی وجہ سے عالم میں مراتب کے تفاضل کی وجہ سے تفاضل ظاہر ہوا، لہٰذا ان مراتب کو آباد کرنے والوں میں تفاضل ضروری ہے۔ پس عالم میں تفاضل ناگزیر ہے، کیونکہ وہ ان مراتب کو آباد کرنے والا اور ان کے ذریعے ظاہر ہونے والا ہے۔\n\nاور یہ وہ چیز ہے جو کشف (الکشف) کے ذریعے ادراک نہیں کی جا سکتی، بلکہ اس کا ادراک صفائے الہام کے ذریعے ہوتا ہے۔ پس مکاشف ان مراتب کو آباد کرنے والوں کے کشف (الکشف) کے ذریعے مراتب کی آبادی کو منکشف کرتا ہے۔ اور تفاضل کا علم صرف صفائے الہامِ الٰہی کے ذریعے ہی ہوتا ہے۔ پس ہم نے تمہیں عزیمت (الہمۃ) کی معرفت پر اختصار کے ساتھ ایک مبسوط کلام میں متنبہ کر دیا ہے۔ پس سمجھو، اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "## باب دویست و بیست و نهم در حال همت (همة)\n\nاگر در حال همت (همة) بودی، درنگ کن *** زیرا که هستی (الوجود) برای آن آماده است\n\nو با آن هیچ بسته‌ای را مگشا *** و از کسانی مباش که با آن استبداد می‌ورزند\n\nو بر آن تکیه مکن، و باش *** چنان که تو در باطن معتقد (اعتقاد) هستی\n\n### [همانا خداوند فاعل اشیا است]\n\nمنظور ما از باطن معتقد، این است که خداوند فاعل اشیا است و در آن هیچ اثری برای همت (همة) مخلوق، یا برای سبب ظاهری یا باطنی نیست؛ زیرا او می‌داند که اسباب را خداوند تنها برای ابتلا قرار داده است تا کسی که نزد آن‌ها توقف می‌کند، از کسی که وقوع فعل را جز به واسطه آن‌ها نمی‌بیند، و از کسی که این را نمی‌بیند و فعل را از ورای آن‌ها، نزد آن‌ها، اما نه به واسطه آن‌ها، از آنِ خداوند می‌داند، متمایز شود.\n\nبدان که این قوم [صوفیان] همت (همة) را در برابر تجرید قلب برای آرزوها به کار می‌برند، و آن را در برابر اولین صدق مرید (مريد) به کار می‌برند، و آن را در برابر جمع شدن همت‌ها (همم) با صفای الهام (الإلهام) به کار می‌برند. پس می‌گویند همت (همة) بر سه مرتبه است: همت تنبه (تنبه)، همت اراده (إرادة)، و همت حقیقت (حقيقة).\n\nپس بدان که همت تنبه، بیداری قلب است نسبت به آنچه حقیقت انسان به او می‌دهد و آرزو به آن تعلق می‌گیرد، خواه محال باشد یا ممکن. پس این همت، قلب را برای آرزوها مجرد می‌سازد و آن را وامی‌دارد که در آنچه آرزو می‌کند، حکم آن را بنگرد، و عمل بر اساس چیزی باشد که علم به حکم آن به او می‌دهد. اگر [علم] به او بازگشت از آن را داد، باز می‌گردد، و اگر به او عزم بر آن را داد، عزم می‌کند. پس صاحب این همت نیازمند علم به چیزی است که آرزو کرده است.\n\nاما همت اراده (إرادة)، که اولین صدق مرید (مريد) است، همتی جمعی است که هیچ چیز در برابر آن تاب نمی‌آورد. این همت در میان قومی در آفریقا که عزابیه نامیده می‌شوند، بسیار یافت می‌شود؛ آن‌ها با این همت هر که را بخواهند می‌کشند. زیرا نفس هنگامی که متمرکز شود، در اجرام عالم و احوال آن تأثیر می‌گذارد و هیچ چیز نمی‌تواند جایگزین آن شود. تا جایی که کسانی که این را می‌دانند، اما کشف (الکشف) یا نیروی ایمان ندارند، به این نتیجه رسیده‌اند که آیات ظاهری که در عالم بر دست برخی افراد پدیدار می‌شود، تنها به این همت بازمی‌گردد. این همت چنان قدرتی دارد که اگر در مرید (مريد) پدید آید، در شیوخ کامل (الکمل) نیز تأثیر می‌گذارد و مریدان با آن در شیوخ تصرف می‌کنند. چه بسا که بر شیخ در علمی که نزد او نیست و مقصود او هم نیست، به همت این مرید که گمان می‌کند آن علم نزد این شیخ است، فتحی (گشایشی) حاصل شود. پس آن علم در همان لحظه برای شیخ به حکم عَرَض (عارض) حاصل می‌شود تا آن را به این طالب صاحب همت برساند، زیرا او آن را جز از شیخ نمی‌پذیرد. این بدان سبب است که این مرید همت خود را در این مسئله بر این شیخ متمرکز کرده است. حکایات در این باره مشهور و مذکور است.\n\nو اثر این همت در الهیات، سخن خداوند متعال است: «أنا عند ظن عبدي بي فليظن بي خيرا» (من نزد گمان بنده خود به من هستم، پس باید به من گمان نیک برد).\n\nپس هر کس همت خود را بر پروردگارش متمرکز کند که جز او گناه را نمی‌آمرزد و رحمتش «وَسِعَتْ كُلَّ شَيْ‏ءٍ» (همه چیز را فرا گرفته است)، بدون شک و تردید مورد رحمت قرار خواهد گرفت. خداوند متعال می‌فرماید: «وَذلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْداكُمْ فَأَصْبَحْتُمْ مِنَ الْخاسِرِينَ» (و این گمان شما بود که درباره پروردگارتان بردید، شما را به هلاکت رساند و از زیانکاران شدید). زیرا آن‌ها گمان کردند که خداوند بسیاری از کارهایشان را نمی‌داند. به همین دلیل گفتیم که علم به آنچه این همت به آن تعلق می‌گیرد، ضروری است.\n\nاگر [همت] به محال (آنچه ناممکن است) تعلق گیرد، واقع نمی‌شود و وبال آن به صاحبش باز می‌گردد و با همت خود در نفس خویش تأثیر می‌گذارد. و اگر به آنچه محال نیست تعلق گیرد، حتماً واقع می‌شود. در اینجا، گروهی از این طایفه همت خود را به محال تعلق دادند، که همان نفی علم از خداوند نسبت به برخی اعمال بندگان است. پس خداوند آن‌ها را به سبب اعمالشان عذاب داد و گمانشان آن‌ها را به هلاکت رساند. این مسئله‌ای است که به دلیل گستردگی و آنچه در آن وارد می‌شود و شایسته گفتن و فاش شدن نیست، نمی‌توانیم حق آن را ادا کنیم، جز اینکه هر جا یافت شود، نفوذ دارد.\n\nپس اگر [همت] متمرکز نشود و خللی در آن وارد شود، این حکم را ندارد. اگر این کسانی که درباره پروردگارشان گمان کردند که بسیاری از کارهایشان را نمی‌داند، گمان می‌کردند که خداوند به دلیل صفت صفح و گذشتش، بر جرم مؤاخذه نمی‌کند، و تمرکزشان بر این گمان، آن‌ها را از قهر و عقاب شدید خداوند می‌پوشاند، خداوند آن‌ها را مؤاخذه نمی‌کرد، زیرا گمانشان به امری ممکن تعلق گرفته بود.\n\nاما همت حقیقت (حقيقة) که جمع شدن همت‌ها (همم) با صفای الهام (الإلهام) است، آن همت شیوخ بزرگ از اهل الله است که همت‌های خود را بر الحق (خداوند) متمرکز کرده و آن را به دلیل احدیت (أحدية) متعلق، یکی ساخته‌اند، در حال فرار از کثرت (الکثرة) و طلب توحید کثرت یا توحید محض. زیرا عارفان (العارفين) از کثرت بیزارند، نه از احدیت آن، خواه در صفات باشد یا در نسبت‌ها یا در اسماء. و آن‌ها در این امر متمایز هستند، یعنی بر طبقات مختلفی قرار دارند.\n\nو خداوند با آن‌ها بر حسب آنچه هستند رفتار می‌کند و آن‌ها را از آن باز نمی‌گرداند، زیرا هر مقام (مقَام) وجهی به سوی الحق (خداوند) دارد. و خداوند این کار را می‌کند تا کسی که اختصاص بیشتری به خداوند دارد و خداوند او را برای خود از میان بندگانش برگزیده، از دیگر بندگان متمایز شود. زیرا خداوند عالم را بر حسب مراتب نازل کرده است تا مراتب را آباد سازد. اگر تفاضل (برتری) در عالم واقع نمی‌شد، برخی مراتب معطل و غیرآباد می‌ماندند. و در هستی (الوجود) هیچ چیز معطلی نیست، بلکه همه آن آباد است. پس هر مرتبه‌ای نیازمند آبادکننده‌ای است که حکم او بر حسب مرتبه‌اش باشد. به همین دلیل، عالم برخی از اجزای خود را بر برخی دیگر برتری داده است و اصل آن در الهیات، اسماء الهی است.\n\nکجا احاطه عالم (دانا) با احاطه مرید (اراده‌کننده) و احاطه قادر (توانا) قابل مقایسه است؟ پس عالم از مرید و مرید از قادر به واسطه مرتبه متعلق متمایز می‌شود. عالم احاطه‌اش عام‌تر است و بر مرید و قادر به چیزی فزونی و برتری یافته که برای مرید و قادر، از آن جهت که مرید و قادر هستند، وجود ندارد. زیرا او (خداوند) خود را می‌داند، اما به قدرت بر خود و اراده برای وجود خود متصف نمی‌شود، چرا که از حقیقت اراده (إرادة) این است که جز به معدوم (آنچه نیست) تعلق نگیرد، و خداوند موجود (موجود) است. و از شأن قدرت (قدرة) این است که جز به ممکن یا واجب بالغیر تعلق نگیرد، در حالی که او واجب الوجود لنفسه است.\n\nاز آنجا تفاضل در عالم به دلیل تفاضل مراتب ظاهر شد. پس ناگزیر باید تفاضلی در آبادکنندگان آن‌ها باشد، و بنابراین تفاضل در عالم ضروری است، زیرا عالم آبادکننده مراتب و ظاهرشونده به واسطه آن‌ها است. این امری است که با کشف (الکشف) درک نمی‌شود، بلکه درک آن با صفای الهام (الإلهام) است. پس مکاشف، آبادانی مراتب را با کشف خود از آبادکنندگان آن‌ها آشکار می‌سازد، و تفاضل جز با صفای الهام الهی دانسته نمی‌شود.\n\nما شما را به معرفت همت (همة) با کلامی مبسوط در عین ایجاز آگاه ساختیم. پس بفهم. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}