{
  "id": 224,
  "title": {
    "ar": "الباب الرابع والعشرون ومائتان في معرفة عين التحكم",
    "en": "Chapter Two Hundred and Twenty-Four, Concerning the Gnosis of the Essence of Dominion.",
    "ur": "باب دو سو چوبیسواں: عین التحكم (عين التحكم) کی معرفت میں",
    "fa": "باب دویست و بیست و چهارم در معرفت عین التحكم (عین التحكم)"
  },
  "content": {
    "ar": "## «الباب الرابع والعشرون ومائتان في معرفة عين التحكم»\n\n\nعين التحكم عند القوم التصرف لإظهار الخصوصية بلسان الانبساط في الدعاء وهذا ضرب من الشطح وقريب منه لما يتوهم من دخول النفس فيه إلا أن يكون عن أمر إلهي فلا مؤاخذة على صاحبه فيه‏\n\n\n> مهما تحكم عارف في خلقه *** عن غير أمر فالرعونة قائمه‏\n\n\n> ترك التحكم نعت كل محقق *** لزم الحياء ولو أتته راغمه‏\n\n\n> ما للرجال الصم أعيان الورى *** المصطفين له نفوس حاكمة\n\n\n> بل هم عبيد لم يزالوا خشعا *** في كل حال فالشهادة دائمة\n\n\n> إن التحكم في الحجاب مقامه *** خلف الستور المرسلات المظلمة\n\n\nفإذا كان عن أمر إلهي بتعريف فالإنسان فيه عبد ممتثل أمر سيده بطريق الوجوب فإن عرض عليه عين التحكم من غير أمر عرض الأمانة وقبله فليس هناك بل مرتبته مرتبته في قبول الأمانة المعروضة التي قال الله فيمن حملها إِنَّهُ كانَ ظَلُوماً جَهُولًا ظلوما لنفسه جهولا بقدر ما تحمل لأنه جهل ما في علم الله فيه هل هو مما يؤدي الأمانة إلى أهلها أم لا فعين التحكم مخصوص بالرسل في إظهار المعجزات والتحدي بها عن الأمر الإلهي فإنهم مرسلون بالدلالات على أنهم رسل الله‏\nفهم مخبرون بالحال أنهم المصطفون الأخيار لا بالقصد ثم قد يقع منهم بعد ثبوت الرسالة قول خارج عن مقتضى الدلالة ولا يكون منهم إلا عن أمر إلهي يؤذن ذلك القول بمرتبة القائل عند الله مثل‏\n\n\nقوله صلى الله عليه وسلم أنا سيد الناس يوم القيامة\n\n\nفلما كان في قوة هذا اللفظ إظهار الخصوصية عند الله ومن هو مشغول بالله ما عنده فراغ لمثل هذا ومن شغل أهل الله بالله امتثال أمر الله فأخبر عليه السلام حين عم‏\n\n\nفقال ولا فخر\n\n\nأي ما قصدت الفخر أي هكذا أمرت أن أعرفكم فإن العارف كيف يفتخر والمعرفة تمنعه ومشاهدة الحق تشغله ولا يظهر مثل هذا ممن ليس بمأمور به إلا عن رعونة نفس أو فناء لغلبة حال يستغفر الله من ذلك إذا فارقه ذلك الحال الذي أفناه وقد يظهر مثل هذا من صاحب الغيرة خاصة وهو مذهب شيخنا أبي مدين وقد ظهر منه مثل ذلك من باب الغيرة فلا يدل على إظهار الخصوصية وذلك بأن يرى الإنسان دعوة الرسل ترد ويتوقف في تصديقها ولا سيما عند من ينفي النبوة التي نثبتها فيقوم هذا العبد مقام وجود الرسول فيدعي ما يدعيه الرسول من إقامة الدلالة على صدق الرسول في رسالته نيابة عنه فيأتي بالأمر المعجز على طريق التحدي للرسول لا لنفسه فيظهر منه ذلك وهذا لا يدل على مقام الخصوصية عند الله فهو خارج عن عين التحكم وليس بخارج من حيث ما هو تحكيم لكنه خارج من حيث ما هو تحكيم خاص وقد يكون عين التحكيم في رجل يكون له مقام الإدلال مع الحق ويكون عنده تعريف إلهي بمقامه المعلوم كالملائكة في قوله تعالى عنهم وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ وإِنَّا لَنَحْنُ الصَّافُّونَ وإِنَّا لَنَحْنُ الْمُسَبِّحُونَ فأثنوا على أنفسهم بعد معرفتهم وتعريفهم بمقامهم فلا ينقصهم هذا الثناء ولا يحط مرتبتهم وإذا لم يؤثر عين التحكيم في المقام فلا بأس به وتركه أعلى لأنه على كل حال فراغ وما وقع مثل هذا من جبريل إلا لكونه معلما رسول الله صلوات الله عليهما والمعلم ينبه التلميذ بمرتبته لتعلو همته ليلحق بمعلمه ومنهم من يبلغ في التحكيم أن يقسم على الله في أمر فيبر الحق قسمه ومع هذا يستغفر الله فلو لا إن فيه رائحة ما استغفر والحكايات في التحكيم عن الصالحين كثيرة ولا سيما ما يحكى عن عبد القادر الجيلي رحمه الله كان ببغداد أدركناه بالسن وكالذي سجد وحلف أن لا يرفع رأسه من سجدته حتى ينزل الغيث فأبر الله قسمه وكالذي وقف على رأس بئر وقد عطش ولم يكن له حبل ولا ركوة فقال لئن لم تسقني لأغضبن ففاض الماء على فم البئر فسئل على من تغضب فقال على نفسي فامنعها الماء\n\n\n### [التحكم عند ابن العربي‏]\n\n\nوأما عين التحكيم عندنا فأمر هين في شهود المعرفة فإن التحكيم للظاهر في المظهر فما تحكم إلا من له التحكم فمهما ظهر الظاهر به دل على إن استعداد المظهر أعطى هذا فيفرق بينه وبين ما يعطيه مظهر آخر من عدم التحكيم وهذه طريقة انفردنا بإظهارها في الوجود لأنها تقرب على أهل الله مأخذ الأمور ولا تستعظم شيئا مما ظهر فإنه ما ظهر إلا ممن له الْأَمْرُ من قَبْلُ ومن بَعْدُ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 224: Concerning the Knowledge of the Essence of Control\n\nThe Essence of Control (عين التحكم), according to the People [of Sufism], is the spiritual disposition used to manifest special privilege through the language of spiritual intimacy (الانبساط) in supplication. This is a type of theopathic utterance (شطح) and is close to it, due to the suspicion that the ego (النفس) may intrude upon it, unless it proceeds from a Divine command, in which case there is no blame upon the one who manifests it.\n\n> If a Gnostic (عارف) exercises Control over creation\n> Without command, then arrogance (الرعونة) is present.\n> Abandoning Control is the characteristic of every Verifier (محقق),\n> Who adheres to modesty (الحياء), even if [Control] comes to him willingly.\n> The silent Men (الرجال الصم), the essences (أعيان) of creation, the chosen ones,\n> Do not possess commanding souls (نفوس حاكمة).\n> Rather, they are servants who remain humble (خشعا)\n> In every state, for the Witnessing (الشهادة) is perpetual.\n> Indeed, the station of Control is in the Veil (الحجاب),\n> Behind the dark, drawn curtains.\n\nIf it proceeds from a Divine command (أمر إلهي) through a disclosure (تعريف), then the human being in this act is a servant (عبد) fulfilling the command of his Master by way of obligation. If the Essence of Control is offered to him without command—the offering of the Trust (الأمانة)—and he accepts it, he is not [blameless] in that case. Rather, his rank is the rank of one who accepts the offered Trust, concerning whom Allah said: <<إِنَّهُ كَانَ ظَلُومًا جَهُولًا>> (Indeed, he was ever unjust [ظلوما] and ignorant [جهولا]). Unjust to himself, ignorant of the measure of what he bore, because he was ignorant of what was in Allah’s Knowledge concerning him: whether he was one who would render the Trust to its rightful owners or not.\n\nThus, the Essence of Control is specific to the Messengers (الرسل) in manifesting miracles (المعجزات) and challenging [others] with them, based on the Divine command, for they are sent with proofs (الدلالات) that they are the Messengers of Allah.\n\nThey are informers of the state (الحال)—that they are the chosen, the good ones—not by intention (القصد). Then, after the establishment of their Messengership (الرسالة), a saying may issue from them that is outside the requirement of the proof, and it does not issue from them except by a Divine command which announces the rank of the speaker before Allah, such as his saying (peace and blessings be upon him): \"I am the Master of mankind on the Day of Resurrection.\"\n\nSince the power of this utterance implies the manifestation of special privilege (الخصوصية) before Allah, and one who is occupied with Allah has no leisure for such a thing—and the occupation of the People of Allah (أهل الله) with Allah is the fulfillment of Allah’s command—the Prophet (peace be upon him) informed [us] when he generalized, saying: \"And no boast (ولا فخر).\" Meaning: \"I did not intend boasting.\" That is, \"I was commanded to inform you thus.\" For how can the Gnostic (العارف) boast, when Gnosis (المعرفة) prevents him, and the witnessing of the Real (مشاهدة الحق) occupies him?\n\nSuch a thing does not appear from one who is not commanded to do so, except due to the arrogance of the ego (رعونة نفس) or due to annihilation (فناء) caused by the overwhelming force of a spiritual state (حال), for which he seeks Allah’s forgiveness when that state which annihilated him departs.\n\nSuch a thing may also appear specifically from the possessor of zeal/spiritual jealousy (الغيرة), and this is the doctrine (مذهب) of our Shaykh Abu Madyan. Such an act appeared from him out of zeal, and thus it does not indicate the manifestation of special privilege. This occurs when a person sees the call of the Messengers being rejected and people hesitating to affirm it, especially among those who deny the Prophethood (النبوة) that we affirm. This servant then stands in the place of the Messenger’s existence, claiming what the Messenger claims, namely, the establishment of proof for the truthfulness of the Messenger in his message, acting as his deputy (نيابة عنه). He performs the miraculous act by way of challenge *for* the Messenger, not for himself, and thus it appears from him. This does not indicate the station of special privilege before Allah. Thus, it is outside the Essence of Control, though it is not outside [the category of] Control itself, but it is outside [the category of] *special* Control.\n\nThe Essence of Control may reside in a man who possesses the station of intimacy/confidence (مقام الإدلال) with the Real (الحق), and who has a Divine disclosure (تعريف إلهي) concerning his known station, like the angels, concerning whom Allah the Exalted said: <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ>> (And there is none of us but has a known station), and <<وَإِنَّا لَنَحْنُ الصَّافُّونَ>> (And indeed, we are the ones who arrange the ranks), and <<وَإِنَّا لَنَحْنُ الْمُسَبِّحُونَ>> (And indeed, we are the ones who glorify [Allah]). They praised themselves after knowing and being informed of their station, and this praise does not diminish them nor lower their rank.\n\nIf the Essence of Control does not affect the [spiritual] station, there is no harm in it. However, abandoning it is superior, because in any case, it is a distraction. Such a thing did not occur from Gabriel except because he was teaching the Messenger of Allah (peace and blessings be upon them both). The teacher alerts the student to his rank so that his aspiration (همته) may rise, enabling him to catch up with his teacher.\n\nAmong them are those who reach such a degree of Control that they swear an oath upon Allah concerning a matter, and the Real fulfills their oath. Yet, despite this, they seek Allah’s forgiveness. If there were not some trace [of ego] in it, they would not seek forgiveness. The anecdotes concerning Control from the righteous (الصالحين) are numerous, especially what is related about Abdul Qadir al-Jilani (may Allah have mercy on him), who was in Baghdad—we reached him by age. And like the one who prostrated and swore not to raise his head from his prostration until the rain fell, and Allah fulfilled his oath. And like the one who stood at the edge of a well, being thirsty, and having neither rope nor bucket, and said: \"If you do not give me drink, I shall surely become angry.\" The water then overflowed the mouth of the well. He was asked, \"At whom would you become angry?\" He replied, \"At myself, for preventing it from the water.\"\n\n### [Control according to Ibn Arabi]\n\nAs for the Essence of Control (عين التحكيم) according to us, it is a simple matter in the witnessing of Gnosis (المعرفة), for Control belongs to the Manifestor (الظاهر) within the locus of manifestation (المظهر). None exercises Control except the one who possesses Control. Whenever the Manifestor appears through it, this indicates that the preparedness (استعداد) of the locus of manifestation granted this [ability]. Thus, a distinction is made between this [locus] and what another locus of manifestation grants, which is the absence of Control.\n\nThis is a method (طريقة) that we have uniquely manifested in Existence (الوجود), because it simplifies the understanding of matters for the People of Allah, and one does not regard anything that appears as great, for it only appeared from the One to whom belongs the command before and after. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر دو سو چوبیس: عین التحكم (عین التحکم) کی معرفت میں\n\nسالکین (القوم) کے نزدیک عین التحكم (عین التحکم) سے مراد دعا میں انبساط (آزادی) کی زبان سے خصوصیت کا اظہار کرنے کے لیے تصرف (اختیار) کرنا ہے۔ یہ شطح (الشطح) کی ایک قسم ہے اور اس کے قریب ہے، کیونکہ اس میں نفس کے داخل ہونے کا وہم ہوتا ہے، مگر یہ کہ اگر یہ امرِ الٰہی سے ہو تو اس کے مرتکب پر کوئی گرفت نہیں ہے۔\n\n> جب بھی کوئی عارف اپنی مخلوق میں تحکم (التحکم) کرے، بغیر کسی حکم کے، تو رعونت (تکبر) قائم ہے۔\n> تحکم (التحکم) کو ترک کرنا ہر محقق کی صفت ہے، جس نے حیا کو لازم پکڑا، اگرچہ وہ اسے مجبوراً حاصل ہو۔\n> ان خاموش مردوں (رجال الصم) کے لیے کیا ہے جو مخلوق کی آنکھیں ہیں، جنہیں ذات حق (الحق) نے چنا ہے، ان کے پاس حاکم نفس نہیں ہوتے۔\n> بلکہ وہ ایسے بندے ہیں جو ہر حال میں ہمیشہ خشوع (عاجزی) میں رہتے ہیں، پس شہود (الشہود) دائمی ہے۔\n> بے شک تحکم (التحکم) کا مقام حجاب میں ہے، ان تاریک اور لٹکے ہوئے پردوں کے پیچھے ہے۔\n\nپس اگر یہ (تحکم) کسی الٰہی حکم کے ذریعے تعریف کے ساتھ ہو، تو انسان اس میں اپنے آقا کے حکم کی تعمیل کرنے والا واجب الاطاعت بندہ ہوتا ہے۔ لیکن اگر اس پر عین التحكم (عین التحکم) بغیر کسی حکم کے پیش کیا جائے، تو یہ امانت کے پیش کیے جانے اور اسے قبول کرنے جیسا ہے، اور وہ (تحکم کرنے والا) اس مقام پر نہیں ہوتا، بلکہ اس کا مرتبہ وہی ہوتا ہے جو امانتِ معروضہ کو قبول کرنے والے کا ہے، جس کے بارے میں اللہ تعالیٰ نے فرمایا ہے: **إِنَّهُ كانَ ظَلُوماً جَهُولًا** (بے شک وہ بڑا ظالم اور بڑا جاہل تھا) [الاحزاب: 72]۔ وہ اپنی جان پر ظلم کرنے والا ہے، اور اس بوجھ کی مقدار سے جاہل ہے جو اس نے اٹھایا، کیونکہ وہ اس بات سے جاہل رہا کہ اللہ کے علم میں اس کے بارے میں کیا ہے، آیا وہ امانت کو اس کے اہل تک پہنچانے والوں میں سے ہے یا نہیں؟ پس عین التحكم (عین التحکم) خاص طور پر رسولوں کے لیے ہے کہ وہ الٰہی حکم سے معجزات کا اظہار کریں اور ان کے ذریعے تحدی (چیلنج) کریں۔ کیونکہ وہ اس بات کی دلیلوں کے ساتھ بھیجے گئے ہیں کہ وہ اللہ کے رسول ہیں۔\n\nپس وہ (رسول) حال کے ذریعے خبر دینے والے ہوتے ہیں کہ وہ چنے ہوئے نیک لوگ ہیں، نہ کہ قصد (ارادے) سے۔ پھر رسالت کے ثابت ہونے کے بعد کبھی ان سے ایسا قول صادر ہوتا ہے جو دلالت کے تقاضے سے باہر ہوتا ہے، اور یہ ان سے صرف الٰہی حکم سے ہی صادر ہوتا ہے، جو کہنے والے کے اللہ کے ہاں مرتبے کی خبر دیتا ہے، جیسے:\n\nآپ صلی اللہ علیہ وسلم کا یہ فرمان: \"میں قیامت کے دن لوگوں کا سردار ہوں گا\" (أنا سيد الناس يوم القيامة)۔\n\nچونکہ اس لفظ کی قوت میں اللہ کے ہاں خصوصیت کا اظہار تھا، اور جو شخص اللہ میں مشغول ہو اس کے پاس ایسی باتوں کے لیے فرصت نہیں ہوتی، اور اہل اللہ کا اللہ میں مشغول ہونا اللہ کے حکم کی تعمیل کرنا ہے، اس لیے آپ صلی اللہ علیہ وسلم نے جب یہ بات عام کی تو خبر دی اور فرمایا: \"اور کوئی فخر نہیں\" (ولا فخر)۔ یعنی میرا مقصد فخر کرنا نہیں تھا، بلکہ مجھے حکم دیا گیا تھا کہ میں تمہیں اس سے آگاہ کروں۔ کیونکہ عارف کیسے فخر کر سکتا ہے؟ معرفت (المعرفۃ) اسے اس سے روکتی ہے اور ذات حق (الحق) کا مشاہدہ اسے مشغول رکھتا ہے۔ جو شخص اس کا مامور نہ ہو، اس سے ایسی بات صرف نفس کی رعونت یا کسی حال کے غلبے کی وجہ سے فنا (الفناء) کی حالت میں ظاہر ہوتی ہے، اور جب وہ حال جو اسے فنا کر چکا تھا، اس سے جدا ہوتا ہے تو وہ اس سے استغفار کرتا ہے۔\n\nاور کبھی یہ بات خاص طور پر صاحبِ غیرت سے ظاہر ہوتی ہے، اور یہ ہمارے شیخ ابو مدین کا مسلک ہے۔ ان سے ایسی بات غیرت کے باب سے ظاہر ہوئی، لہٰذا یہ خصوصیت کے اظہار پر دلالت نہیں کرتی۔ یہ اس طرح ہوتا ہے کہ انسان دیکھتا ہے کہ رسولوں کی دعوت کو رد کیا جا رہا ہے اور لوگ اس کی تصدیق میں توقف کر رہے ہیں، خاص طور پر ان لوگوں کے ہاں جو اس نبوت کا انکار کرتے ہیں جسے ہم ثابت کرتے ہیں۔ تو یہ بندہ رسول کے وجود کے مقام پر کھڑا ہو جاتا ہے اور اس چیز کا دعویٰ کرتا ہے جس کا دعویٰ رسول کرتے ہیں، یعنی رسول کی رسالت کی سچائی پر دلیل قائم کرنا، ان کی نیابت میں۔ پس وہ رسول کے لیے تحدی (چیلنج) کے طور پر معجزانہ امر لاتا ہے، نہ کہ اپنے لیے۔ اور یہ اس سے ظاہر ہوتا ہے۔ یہ اللہ کے ہاں مقامِ خصوصیت پر دلالت نہیں کرتا، لہٰذا یہ عین التحكم (عین التحکم) سے خارج ہے۔ اگرچہ یہ تحکم (التحکم) ہونے کے لحاظ سے خارج نہیں ہے، لیکن خاص تحکم ہونے کے لحاظ سے خارج ہے۔\n\nاور عین التحكم (عین التحکم) کسی ایسے شخص میں بھی ہو سکتا ہے جسے ذات حق (الحق) کے ساتھ ناز و ادا کا مقام حاصل ہو، اور اسے اپنے معلوم مقام کی الٰہی تعریف حاصل ہو، جیسے فرشتوں کے بارے میں اللہ تعالیٰ کا فرمان ہے: **وَمَا مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ** (اور ہم میں سے کوئی ایسا نہیں جس کا کوئی مقام معلوم نہ ہو) [الصافات: 164]، **وَإِنَّا لَنَحْنُ الصَّافُّونَ** (اور بے شک ہم ہی صفیں باندھنے والے ہیں) [الصافات: 165]، **وَإِنَّا لَنَحْنُ الْمُسَبِّحُونَ** (اور بے شک ہم ہی تسبیح کرنے والے ہیں) [الصافات: 166]۔ پس انہوں نے اپنے مقام کی معرفت (المعرفۃ) اور تعریف کے بعد اپنی تعریف کی، تو یہ تعریف نہ ان کے مقام کو کم کرتی ہے اور نہ ہی ان کے مرتبے کو گھٹاتی ہے۔ اور جب عین التحكم (عین التحکم) مقام پر اثر انداز نہ ہو تو اس میں کوئی حرج نہیں، لیکن اسے ترک کرنا افضل ہے، کیونکہ یہ بہر حال ایک فراغت (مشغولیت سے ہٹنا) ہے۔ اور جبرائیل علیہ السلام سے ایسی بات صرف اس لیے صادر ہوئی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے معلم تھے، اور معلم شاگرد کو اس کے مرتبے سے آگاہ کرتا ہے تاکہ اس کی ہمت بلند ہو اور وہ اپنے معلم سے جا ملے۔\n\nاور ان میں سے بعض تحکم (التحکم) میں اس حد تک پہنچ جاتے ہیں کہ کسی معاملے میں اللہ پر قسم کھاتے ہیں، اور ذات حق (الحق) ان کی قسم کو پورا کر دیتا ہے، اس کے باوجود وہ استغفار کرتے ہیں۔ اگر اس میں کوئی (نفسانی) بو نہ ہوتی تو وہ استغفار نہ کرتے۔ صالحین سے تحکم (التحکم) کے بارے میں بہت سی حکایات ہیں، خاص طور پر جو شیخ عبدالقادر جیلانی رحمۃ اللہ علیہ کے بارے میں بیان کی جاتی ہیں، جو بغداد میں تھے اور ہم نے انہیں عمر کے لحاظ سے پایا۔ جیسے اس شخص کا واقعہ جس نے سجدہ کیا اور قسم کھائی کہ وہ اپنے سجدے سے سر نہیں اٹھائے گا جب تک بارش نہ برسے، تو اللہ نے اس کی قسم پوری کر دی۔ اور جیسے اس شخص کا واقعہ جو ایک کنویں کے کنارے کھڑا تھا اور اسے پیاس لگی تھی، اور اس کے پاس نہ رسی تھی اور نہ ڈول، تو اس نے کہا: \"اگر تو مجھے پانی نہیں پلائے گا تو میں غصہ کروں گا!\" تو پانی کنویں کے منہ تک ابل آیا۔ جب اس سے پوچھا گیا کہ تم کس پر غصہ کرو گے؟ تو اس نے کہا: \"اپنے نفس پر، تاکہ میں اسے پانی سے محروم کر دوں۔\"\n\n### [ابن عربی کے نزدیک تحکم (التحکم)]\n\nاور جہاں تک ہمارے نزدیک عین التحکیم (عین التحکیم) کا تعلق ہے، تو یہ معرفت (المعرفۃ) کے شہود (الشہود) میں ایک معمولی امر ہے۔ کیونکہ تحکیم (التحکیم) مظہر (المظہر) میں ظاہر (الظاہر) کے لیے ہے۔ پس تحکم (التحکم) صرف وہی کرتا ہے جو تحکم (التحکم) کا مالک ہے۔ لہٰذا جب بھی ظاہر (الظاہر) اس کے ذریعے ظاہر ہوتا ہے، تو یہ اس بات پر دلالت کرتا ہے کہ مظہر (المظہر) کے استعداد نے یہ عطا کیا ہے۔ اور اس میں اور اس چیز میں فرق کیا جاتا ہے جو کوئی دوسرا مظہر (المظہر) عدمِ تحکیم (التحکیم) سے عطا کرتا ہے۔ یہ وہ طریقہ ہے جسے ہم نے ہستی (الوجود) میں ظاہر کرنے میں انفرادیت حاصل کی ہے، کیونکہ یہ اہل اللہ کے لیے امور کے ماخذ کو قریب کر دیتا ہے، اور وہ کسی بھی ظاہر ہونے والی چیز کو عظیم نہیں سمجھتے، کیونکہ وہ صرف اسی سے ظاہر ہوئی ہے جس کے لیے: **الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ** (پہلے اور بعد میں حکم اسی کا ہے) [الروم: 4]۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "«باب دویست و بیست و چهارم در معرفت عین فرمانروایی (عين التحكم)»\n\nعین فرمانروایی (عين التحكم) نزد اهل طریقت (القوم)، عبارت است از تصرف برای آشکار ساختن خصوصیت (ویژگی خاص) با زبان گشاده‌دستی در دعا. این نوعی از شطح (الشطح) است و به آن نزدیک است، زیرا گمان می‌رود که نفس در آن دخالت کرده است؛ مگر آنکه به امر الهی باشد، که در این صورت صاحب آن مورد مؤاخذه قرار نمی‌گیرد.\n\n> هرگاه عارفی در خلق خود فرمانروایی کند،\n>\n> بدون امر [الهی]، سبکسری (الرعونة) پابرجاست.\n>\n> ترک فرمانروایی، صفت هر محققی است\n>\n> که حیا را لازم گرفته، حتی اگر [فرمانروایی] به اجبار به او روی آورد.\n>\n> مردان خاموش، که سرآمد مردمان و برگزیدگان اویند،\n>\n> نفس‌های فرمانروا ندارند.\n>\n> بلکه آنان بندگانی هستند که پیوسته خاشع‌اند؛\n>\n> در هر حالی، شهود (الشهادة) دائمی است.\n>\n> همانا جایگاه فرمانروایی (التحكم) در حجاب است،\n>\n> پشت پرده‌های آویخته و تاریک.\n\nپس اگر [فرمانروایی] به امر الهی و با تعریف [و آگاهی] باشد، انسان در آن بنده و مجری امر مولای خود از طریق وجوب است. اما اگر عین فرمانروایی (عين التحكم) بدون امر به او عرضه شود و او آن را به عنوان امانت بپذیرد، [مرتبه او] در آنجا نیست، بلکه مرتبه‌اش همان مرتبه پذیرش امانت عرضه شده است که خداوند درباره حاملان آن فرمود: **إِنَّهُ كانَ ظَلُوماً جَهُولًا** (همانا او بسیار ستمکار و نادان بود). ستمکار بر نفس خود، نادان به قدر آنچه حمل کرده است؛ زیرا او جاهل است به آنچه در علم خدا درباره اوست که آیا امانت را به اهلش می‌رساند یا خیر. بنابراین، عین فرمانروایی (عين التحكم) مخصوص رسولان است در آشکار ساختن معجزات و تحدی به واسطه آنها، به امر الهی؛ زیرا آنان با دلایلی فرستاده شده‌اند که نشان می‌دهد رسولان خدا هستند.\n\nپس آنان از روی حال خبر می‌دهند که برگزیدگان و نیکان هستند، نه از روی قصد. سپس ممکن است پس از اثبات رسالت، سخنی از ایشان صادر شود که خارج از مقتضای دلالت باشد و این سخن جز به امر الهی از آنان صادر نمی‌شود؛ سخنی که به مرتبه گوینده نزد خداوند آگاهی می‌دهد، مانند:\n\nسخن پیامبر (صلی الله علیه و سلم): «أنا سيد الناس يوم القيامة» (من سرور مردم در روز قیامت هستم).\n\nاز آنجا که در قدرت این لفظ، آشکار ساختن خصوصیت نزد خداوند است، و کسی که مشغول به حق (الحق) است، فراغتی برای چنین امری ندارد، و کار اهل الله (اهل حق) امتثال امر خداست، پس پیامبر (علیه السلام) هنگامی که [این سخن را] عمومیت داد، خبر داد و فرمود: «ولا فخر» (و فخری در کار نیست). یعنی قصد فخر نداشتم؛ بلکه این‌گونه مأمور شدم که شما را آگاه سازم. زیرا عارف چگونه فخر می‌فروشد در حالی که معرفت (المعرفة) او را باز می‌دارد و مشاهده حق (الحق) او را مشغول می‌سازد؟ و چنین امری از کسی که مأمور به آن نیست، جز از روی سبکسری نفس (رعونة نفس) یا فنا (الفناء) به دلیل غلبه حال، ظاهر نمی‌شود؛ و هنگامی که آن حالی که او را فانی ساخته، از او جدا شود، از آن استغفار می‌کند. و گاهی چنین امری به ویژه از صاحب غیرت ظاهر می‌شود، و این مذهب شیخ ما ابومدین است. و از او نیز چنین چیزی از باب غیرت ظاهر شد و دلالتی بر اظهار خصوصیت ندارد. این بدان صورت است که انسان ببیند دعوت رسولان رد می‌شود و در تصدیق آن تردید می‌کنند، به ویژه نزد کسانی که نبوتی را که ما اثبات می‌کنیم، نفی می‌کنند. در این حالت، این بنده به جای وجود رسول می‌ایستد و آنچه را رسول ادعا می‌کند، از باب اقامه دلیل بر صدق رسول در رسالتش، به نیابت از او ادعا می‌کند. پس امر معجز را از طریق تحدی برای رسول، نه برای خودش، می‌آورد و این از او ظاهر می‌شود. این [عمل] دلالت بر مقام خصوصیت نزد خداوند ندارد؛ بنابراین خارج از عین فرمانروایی (عين التحكم) است. و از آن جهت که تحکیم (فرمانروایی) است، خارج نیست، اما از آن جهت که تحکیم خاص است، خارج است.\n\nو گاهی عین فرمانروایی (عين التحكيم) در مردی است که مقام ناز و دلال (الإدلال) با حق (الحق) دارد و نزد او تعریفی الهی از مقام معلومش وجود دارد، مانند فرشتگان در سخن خداوند درباره آنان: **وَما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ** (و هیچ یک از ما نیست مگر آنکه برای او مقامی معلوم است) و **وَإِنَّا لَنَحْنُ الصَّافُّونَ** (و همانا ما صف‌بستگانیم) و **وَإِنَّا لَنَحْنُ الْمُسَبِّحُونَ** (و همانا ما تسبیح‌کنندگانیم). پس آنان پس از معرفت (المعرفة) و آگاهی یافتن به مقامشان، خود را ستودند. این ستایش نه از مقامشان می‌کاهد و نه مرتبه‌شان را پایین می‌آورد. و اگر عین فرمانروایی (عين التحكيم) در مقام تأثیر نگذارد، اشکالی ندارد، اما ترک آن بالاتر است، زیرا در هر حال نوعی فراغت [از حق] است. و چنین امری از جبرئیل واقع نشد مگر به دلیل اینکه او معلم رسول خدا (صلوات الله علیهما) بود؛ و معلم شاگرد را به مرتبه‌اش آگاه می‌سازد تا همتش بالا رود و به معلم خود برسد. و برخی از آنان در تحکیم (فرمانروایی) به جایی می‌رسند که بر خداوند در امری سوگند یاد می‌کنند و حق (الحق) سوگند او را محقق می‌سازد، با این حال استغفار می‌کند. اگر در آن بویی [از نفس] نبود، استغفار نمی‌کرد. حکایات درباره تحکیم (التحكيم) از صالحان بسیار است، به ویژه آنچه درباره عبدالقادر گیلانی (رحمه الله) حکایت می‌شود که در بغداد بود و ما او را به سن درک کردیم؛ مانند کسی که سجده کرد و سوگند خورد که سر از سجده برندارد تا باران ببارد، و خداوند سوگندش را محقق ساخت. و مانند کسی که بر سر چاهی ایستاد و تشنه بود و طناب و دلو نداشت، پس گفت: اگر مرا سیراب نکنی، خشمگین خواهم شد. پس آب بر لبه چاه سرازیر شد. از او پرسیدند: بر چه کسی خشمگین می‌شوی؟ گفت: بر نفس خود، تا او را از آب محروم سازم.\n\n### [فرمانروایی (التحكم) نزد ابن عربی]\n\nو اما عین فرمانروایی (عين التحكيم) نزد ما، امری آسان در شهود معرفت (المعرفة) است؛ زیرا فرمانروایی (التحكيم) از آنِ ظاهر در مظهر است. پس فرمانروایی نمی‌کند مگر کسی که فرمانروایی از آن اوست. هرگاه ظاهر به واسطه آن [فرمانروایی] آشکار شود، دلالت بر این دارد که استعداد مظهر، این [فرمانروایی] را عطا کرده است. پس [این حالت] با آنچه مظهر دیگری از عدم فرمانروایی عطا می‌کند، تفاوت می‌یابد. این روشی است که ما در آشکار ساختن آن در هستی (الوجود) منحصر به فرد بوده‌ایم، زیرا مأخذ امور را بر اهل الله (اهل حق) نزدیک می‌سازد و هیچ چیز از آنچه ظاهر شده را بزرگ نمی‌شمارد؛ زیرا ظاهر نشده مگر از کسی که **الْأَمْرُ** (فرمان) از پیش و پس از آن، از آن اوست. و خداوند **الْحَقَّ** (حق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 2
}