{
  "id": 316,
  "title": {
    "ar": "الباب السادس عشر وثلاثمائة في معرفة منزل الصفات القائمة المنقوشة بالقلم الإلهي في اللوح المحفوظ الإنساني من الحضرة الإجمالية الموسوية والمحمدية وهما من أسنى الحضرات",
    "en": "Chapter Three Hundred and Sixteen: Concerning the Gnosis (معرفة) of the Station (منزل) of the Subsisting Attributes (الصفات القائمة) Inscribed by the Divine Pen (القلم الإلهي) upon the Human Preserved Tablet (اللوح المحفوظ الإنساني), derived from the Comprehensive Presence (الحضرة الإجمالية) of Moses and the Muhammadan Reality, which are among the most Sublime Presences.",
    "ur": "باب تین سو سولہ: صفاتِ قائمہ کے مقام کی معرفت (المعرفۃ) میں، جو قلم الٰہی (القلم الإلهي) کے ذریعے انسانی لوح محفوظ (اللوح المحفوظ الإنساني) میں نقش کی گئی ہیں، موسوی اور محمدی اجمالی حضرت (الحضرة الإجمالية) سے، اور یہ دونوں اعلیٰ ترین حضرات (الحضرات) میں سے ہیں۔",
    "fa": "باب سیصد و شانزدهم در معرفت (معرفة) منزل صفات پابرجا (الصفات القائمة) که با قلم الهی (القلم الإلهي) در لوح محفوظ انسانی (اللوح المحفوظ الإنساني) نقش بسته‌اند، از حضرت اجمالیه (الحضرة الإجمالية) موسوی و محمدی؛ و این دو از والاترین حضرات (الحضرات) هستند."
  },
  "content": {
    "ar": "## «الباب السادس عشر وثلاثمائة في معرفة منزل الصفات القائمة المنقوشة بالقلم الإلهي في اللوح المحفوظ الإنساني من الحضرة الإجمالية الموسوية والمحمدية وهما من أسنى الحضرات»\n\n\n> سر الدواة والقلم *** علم الحدوث والقدم‏\n\n\n> وذاك مخصوص بمن *** نودي بعبدي فقدم‏\n\n\n> لحضرة من ذاته *** كان له فيها قدم‏\n\n\n> وكان من قولهم له *** في رتبة العلم قدم‏\n\n\n> وجاء يسعى راكبا *** وماشيا على قدم‏\n\n\n> وكان قد مازجهم *** مزاج لحم مع دم‏\n\n\n> وألحق الكون إذا *** أشهده الحق العدم‏\n\n\n> فسره في كونه *** كمثله حين عدم‏\n\n\n> ولم يكن في وقته *** صاحب أقدام تذم‏\n\n\n> فشرط كل تائب *** عزم صحيح وندم‏\n\n\n> لما أتى حضرته *** جاء بذل وخدم‏\n\n\n> وعند ما أبصره *** عينا على العرش حزم‏\n> فجادت العين له *** إذ كان من بعض الخدم‏\n\n\n> وعند ما يخرج من *** مقامه ذاك خدم‏\n\n\n### [أسرى رسول الله بجسمه‏]\n\n\nاعلم أيدك الله أيها الولي الحميم والصفي الكريم نور الله بصيرتك أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لما كان خلقه القرآن وتخلق بالأسماء وكان الله سبحانه ذكر في كتابه العزيز أنه تعالى اسْتَوى‏ عَلَى الْعَرْشِ على طريق التمدح والثناء على نفسه إذ كان العرش أعظم الأجسام فجعل لنبيه صَلَّى اللهُ عَليهِ وسَلَّم من هذا الاستواء نسبة على طريق التمدح والثناء عليه به حيث كان أعلى مقام ينتهي إليه من أسرى به من الرسل وذلك يدل أنه أسرى به صَلَّى اللهُ عَليهِ وسَلَّم بجسمه ولو كان الإسراء به رؤيا لما كان الإسراء ولا الوصول إلى هذا المقام تمدحا ولا وقع من الإعراب في حقه إنكار على ذلك لأن الرؤيا يصل الإنسان فيها إلى مرتبة رؤية الله تعالى وهي أشرف الحالات وفي الرؤيا ما لها ذلك الموقع من النفوس إذ كل إنسان بل الحيوان له قوة الرؤيا فقال صَلَّى اللهُ عَليهِ وسَلَّم عن نفسه على طريق التمدح لكونه جاء بحرف الغاية وهو حتى فذكر أنه أسرى به حتى ظهر لمستوي يسمع فيه صريف الأقلام وهو قوله تعالى لِنُرِيَهُ من آياتِنا إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ فالضمير في أنه هو يعود على محمد صَلَّى اللهُ عَليهِ وسَلَّم فإنه أسرى به فرأى الآيات وسمع صريف الأقلام فكان يرى الآيات ويسمع منها ما حظه السماع وهو الصوت فإنه عبر عنه بالصريف والصريف الصوت قال النابغة\n\n\nله صريف صريف القعو بالمسد\n\n\nفدل أنه بقي له من الملكوت قوة ما لم يصل إليه بجسمه من حيث هو راء ولكن من حيث هو سميع فوصل إلى سماع أصوات الأقلام وهي تجري بما يحدث الله في العالم من الأحكام وهذه الأقلام رتبتها دون رتبة القلم الأعلى ودون اللوح المحفوظ فإن الذي كتبه القلم الأعلى لا يتبدل وسمي اللوح بالمحفوظ من المحو فلا يمحي ما كتب فيه وهذه الأقلام تكتب في ألواح المحو والإثبات وهو قوله تعالى يَمْحُوا الله ما يَشاءُ ويُثْبِتُ ومن هذه الألواح تتنزل الشرائع والصحف والكتب على الرسل صلوات الله عليهم وسلامه ولهذا يدخل في الشرائع النسخ ويدخل في الشرع الواحد النسخ في الحكم وهو عبارة عن انتهاء مدة الحكم لا على البدا فإن ذلك يستحيل على الله وإلى هنا كان يتردد صَلَّى اللهُ عَليهِ وسَلَّم في شأن الصلوات الخمسين بين موسى وبين ربه إلى هذا الحد كان منتهاه فيمحو الله عن أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم ما شاء من تلك الصلوات التي كتبها في هذه الألواح إلى أن أثبت منها هذه الخمسة وأثبت لمصليها أجر الخمسين وأوحى إليه أنه لا يبدل القول لديه فما رجع بعد ذلك من موسى في شأن هذا الأمر ومن هذه الكتابة ثُمَّ قَضى‏ أَجَلًا وأَجَلٌ مُسَمًّى ومن هذه الألواح وصف نفسه سبحانه بأنه تعالى يتردد في نفسه في قبضه نسمة المؤمن بالموت وهو قد قضى عليه ومن هذه الحقيقة الإلهية التي كني عنها بالتردد الإلهي يكون سريانها في التردد الكوني في الأمور والحيرة فيها وهو إذا وجد الإنسان أن نفسه تتردد في فعل أمر ما هل يفعله أو لا يفعله وما تزال على تلك الحال حتى يكون أحد الأمور التي ترددت فيها فيكون ويقع ذلك الأمر الواحد ويزول التردد فذلك الأمر الواقع هو الذي ثبتت في اللوح من تلك الأمور المتردد فيها وذلك أن القلم الكاتب في لوح المحو يكتب أمرا ما وهو زمان الخاطر الذي يخطر للعبد فيه فعل ذلك الأمر ثم تمحى تلك الكتابة يمحوها الله فيزول ذلك الخاطر من ذلك الشخص لأنه ما ثم رقيقة من هذا اللوح تمتد إلى نفس هذا الشخص في عالم الغيب فإن الرقائق إلى النفوس من هذه الألواح تحدث بحدوث الكتابة وتنقطع بمحوها فإذا أبصر القلم موضعها من اللوح ممحوا كتب غيرها مما يتعلق بذلك الأمر من الفعل أو الترك فيمتد من تلك الكتابة رقيقة إلى نفس ذلك الشخص الذي كتب هذا من أجله فيخطر لهذا الشخص ذلك الخاطر الذي هو نقيض الأول فإن أراد الحق إثباته لم يمحه فإذا ثبت بقيت رقيقة متعلقة بقلب هذا الشخص وثبتت فيفعل ذلك الشخص ذلك الأمر أو يتركه بحسب ما ثبت في اللوح فإذا فعله أو ثبت على تركه وانقضى فعله محاه الحق من كونه محكوما بفعله وأثبته صورة عمل حسن أو قبيح على قدر ما يكون ثم إن القلم يكتب أمرا آخر هكذا الأمر دائما وهذه الأقلام هذه مرتبتها والموكل بالمحو ملك كريم على الله تعالى هو الذي يمحو على‏\n\n\nحسب ما يأمره به الحق تعالى والإملاء على ذلك الملك والأقلام من الصفة الإلهية التي كنى عنها في الوحي المنزل على رسوله بالتردد ولو لا هذه الحقيقة الإلهية ما اختلف أمران في العالم ولا حار\nأحد في أمر ولا تردد فيه وكانت الأمور كلها حتما مقضيا كما إن هذا التردد الذي يجده الناس في نفوسهم حتم مقضي وجوده فيهم إذ كان العالم محفوظا بالحقائق وعدد هذه الأقلام التي يجري على حكم كتابتها الليل والنهار ثلاثمائة قلم وستون قلما على عدد درج الفلك فكل قلم له من الله علم خاص ليس لغيره ومن ذلك القلم ينزل العلم إلى درجة معينة من درجات الفلك فإذا نزل في تلك الدرجة ما نزل من الكواكب التي تقطعها بالسير من الثمانية الأفلاك تأخذ من تلك الدرجة من العلم المودع من ذلك القلم بقدر ما تعطيه قوة روحانية ذلك الكوكب فتحرك بذلك فلكها فيبلغ الأثر إلى الأركان فتقبل من ذلك الأثر بحسب استعداد ذلك الركن ثم يسرى ذلك الأثر من الأركان في المولدات فيحدث فيها ما شاء الله بحسب ما قبلته من الزيادة والنقصان في جسم ذلك المولد أو في قواه وفي روحه وفي علمه وجهله ونسيانه وغفلته وحضوره وتذكره ويقظته كل ذلك بتقدير العزيز العليم وتحدث الأيام بحركة الفلك الكبير ويتعين الليل والنهار في اليوم بحكم الحركة الكبيرة اليومية على حركة فلك الشمس فإنها تحت حوطته وجعل الأرض كثيفة لا تنفذها أنوار الشمس لوجود الليل الذي هو ظل الأرض ولهذا يكبر النهار في أماكن ويصغر وكذلك يكبر الليل ويصغر وبه تقع الزيادة عندنا بالليل والنهار وبهذا الليل والنهار الموجودين في المعمور من الأرض بهما تعد أيام الأفلاك وأيام الرب وكل يوم ذكر وهو قوله تعالى وإِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ يعني من أيامنا هذه المعلومة ونحن نعلم قطعا إن الأماكن التي يكون فيها النهار من ستة أشهر والليل كذلك إن ذلك يوم واحد في حق ذلك الموضع فيوم ذلك الموضع ثلاثمائة يوم وستون يوما مما نعده فقد أنبأتك بمكانة هذه الأقلام التي سمع صوت كتابتها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من العلم الإلهي ومن يمدها وإلى أي حقيقة إلهية مستندها وما أثرها في العالم العلوي من الأملاك والكواكب والأفلاك وما أثرها في العناصر والمولدات وهو كشف عجيب يحوي على أسرار غريبة من أحكام هذه الأقلام تكون جميع التأثيرات في العالم دائما ولا بد لها أن تكتب وتثبت انتثار الكواكب وانحلال هذه الأجرام الفلكية وخراب هذه الدار الدنياوية وانتقال العمارة في حق السعداء إلى الجنان العلية التي أرضها سطح الفلك الثامن وجهنم إلى أسفل سافلين وهي دار الأشقياء وقد ذكرنا ذلك في هذا الكتاب في باب الجنة وفي باب النار وأما القلم الأعلى فأثبت في اللوح المحفوظ كل شي‏ء يجري من هذه الأقلام من محو وإثبات ففي اللوح المحفوظ إثبات المحو في هذه الألواح وإثبات الإثبات ومحو الإثبات عند وقوع الحكم وإنشاء أمر آخر فهو لوح مقدس عن المحو فهو الذي يمده القلم الإلهي باختلاف الأمور وعواقبها مفصلة مسطرة بتقدير العزيز العليم ولقلوب الأولياء من طريق الكشف الإلهي الحقيقي في التمثيل من هذه الأقلام كشف صحيح كما مثلت الجنة لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم في عرض الحائط وإنما قلنا إن ذلك الممثل حقيقة مع كونه ممثلا\n\n\nلقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أ رأيتمونى حين تقدمت أردت أن أقطف منها قطفا لو أخرجته لأكلتم منه ما بقيت الدنيا\n\n\nولما مثلت له النار تأخر عن قبلته لئلا يصيبه من لهبها ورأى فيها ابن لحي وصاحب المحجن وصاحبة الهرة وكان ذلك في صلاة كسوف الشمس وقد قال صَلَّى اللهُ عَليهِ وسَلَّم إن الله في قبلة المصلي‏\n\n\nوقد رأى الجنة والنار في قبلته كما إن الحائط في قبلته‏\n\n\n### [أن لله تعالى أسماء تختص بالجنة وأهلها]\n\n\nواعلم أن لله تعالى أسماء تختص بالجنة وأهلها وأن لله تعالى أسماء تختص بالنار وأهلها وأن الحق يناجيه المصلي من حيث أسماؤه لا من حيث ذاته إذ كانت ذاته تتعالى عن الحد والمقدار والتقييد فاعلم بما نبهتك عليه إن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما زال الحق يناجيه في قبلته وفي صلاته وما أخرجه مشاهدة الجنان والنار ومن فيها وحركته بالتقدم والتأخر عن كونه مصليا ظاهرا وباطنا وإنما أخبر النبي صَلَّى اللهُ عَليهِ وسَلَّم بهذا كله في حال الصلاة أعلاما لنا بما يخطر لنا في صلاتنا من مشاهدة أمورنا من بيع وشراء وأخذ وعطاء وتصريف خواطر المصلي في الأكوان المتجلية له في باطنه في حال صلاته وقد قال عمر عن نفسه إنه كان يجهز الجيش وهو في صلاته فكان خبر النبي صَلَّى اللهُ عَليهِ وسَلَّم لنا بما شاهده في صلاته إن ذلك لا يقدح في الصلاة المشروعة لنا كما يعتقده بعض عامة الفقهاء ممن لا علم له بالأمور وربما بعض الصالحين يتخيلون أن هذا كله مما يبطل الصلاة ويخرج الإنسان عن الحضور مع الحق ما الأمر على ذلك بل كل ما يشاهده المصلي في صلاته من الأكوان هو حق‏\nوهو من الصلاة لمن عقل ما المراد بالصلاة وكما لم يقدح في صلاته ما تشاهده عينه من المحسوسات التي في قبلته التي ظهرت لبصره بوجودها وذواتها من العوالم وحركاتهم ولا يخرجه ذلك عن كونه مصليا بلا خلاف ويكره للمصلي أن يغمض عينيه في صلاته فكذلك أيضا ما يتجلى لعين بصيرته وقلبه من مثل الخواطر وصور الأمور التي تعرض له في باطنه وهي من عند الله وعين بصيرته مفتوح مثل عين حسه فكل صورة ممثلة تجلى له الحق بها في باطنه كما تجلى له في المحسوسات في ظاهره فلا بد أن يدركها بعين بصيرته وقلبه كما أدرك صور المحسوسات ببصره وكما أنه لم يخرجه ذلك عن كونه مصليا على حد ما شرع له مع استقباله القبلة بوجهه كذلك لا يخرجه ما شاهده في باطنه من صور الأكوان عن كونه مصليا على حد ما شرع له مع استقباله ربه وذلك الاستقبال هو المعبر عنه بالنية المطلوبة منه عند الشروع في تلك العبادة فمن لا علم له بالأمور يقدح هذا عنده فإن احتج‏\n\n\nأحد بقوله صَلَّى اللهُ عَليهِ وسَلَّم في الركعتين اللتين يصليهما العبد عقيب الوضوء لا يحدث نفسه فيهما بشي‏ء فليس بحجة وما فهم ما أراده رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وما حقق نظره في لفظه بما ذا قيده صَلَّى اللهُ عَليهِ وسَلَّم فإنه قيده بالحديث مع نفسه وهذه الصور التي يرى المصلي نفسه فيها إنما يشاهدها بعين قلبه وما تعرض الشارع إلا لمن يحدث لا لمن يبصر لأنه ليس في قوته إن يغمض عين قلبه عما تجلى له الحق من الصور ثم قيد الحديث منه مع نفسه فإن تحدث مع ربه أو مع الصورة التي تتجلى له في صلاته فإن ذلك لا يقدح في صلاته وقد كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في صلاته إذا مر في تلاوته بآية استغفار استغفر وبآية رغبة سأل الله في نيل ما تدل عليه‏\n\n\nوما أخرجه شي‏ء من ذلك عن كونه مصليا ولا حدثت له نية أخرى تخرجه عن صلاته كما لم يتحول في ظاهره إلى جهة أخرى غير جهة قبلته فما دام المصلي لم يتحول عن قبلته بوجهه ولا أحدث نية خروج عن صلاته فصلاته صحيحة مقبولة ذلك من فضل الله على عباده ورحمته بهم وما كل إنسان يعلم خطاب الحق عباده وما أراده منهم وأما الحديث المروي عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيما يقبل من الصلاة عشرها إلى أن وصل إلى نصفها إلى ما عقل منها فلم يصح ولو صح لما قدح فيما ذكرناه‏\n\n\n### [علم الإجمال وعلم التفصيل‏]\n\n\nواعلم أن هذا المنزل منزل عظيم جليل القدر له بالنبي صَلَّى اللهُ عَليهِ وسَلَّم اختصاص عظيم وهذا القدر الذي ذكرنا منه فيه غنية لمن نظر واستبصر فلنذكر ما يحوي عليه من العلوم فإن أبواب الكتاب كثيرة ويطول الكلام فيها مع كثرتها فيتعذر تحصيله على من يريده فاعلم أنه يحوي على علم الإجمال وهل في علم الله إجمال أو لا يعلم الأشياء إلا على التفصيل وهي غير متناهية ويحوي على علم التفصيل ويحوي على العلم الذي بين الإجمال والتفصيل وهو علم غريب لا يعرفه القليل من العلماء بالله فكيف الكثير وفيه علم الدواوين وترتيبها وفيه علم الأجور والمستحقين لها مع كونهم عبيدا ولم سمي العبد أجيرا فإنه مشعر بأن له نسبة إلى نسبة الفعل الصادر منه إليه فتكون الإجارة من تلك النسبة ومنها طلب العون على خدمة سيده ومن أية جهة تعين الفرض عليه ابتداء قبل الأجرة والأجير لا يفترض عليه إلا حتى يؤجر نفسه والعبد فرض عليه طاعة سيده والإنسان هنا مع الحق على حالين حالة عبودية وحالة إجارة فمن كونه عبدا يكون مكلفا بالفرض كالصلاة المفروضة والزكاة وجميع الفرائض ولا أجر له عليها جملة واحدة في أداء فرضه بل له ما يمتن به عليه سيده من النعم التي هي أفضل من الأجور لا على جهة الأجر ثم إن الله تعالى ندبه إلى عبادته في أمور ليست عليه فرضا فعلى تلك الأعمال المندوب إليها فرضت الأجور فإن تقرب العبد بها إلى سيده أعطاه إجارته عليها وإن لم يتقرب لم يطلب بها ولا عوتب عليها فمن هنا كان العبد حكمه حكم الأجنبي في الإجارة فالفرض له الجزاء الذي يقابله فإنه العهد الذي بين الله وعباده والنوافل لها الأجور وهي‏\n\n\nقوله تعالى ولا يزال العبد يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت له سمعا وبصرا\n\n\nالحديث فالنافلة أنتجت له المحبة الإلهية ليكون الحق سمعه وبصره والمحبة الإلهية هي التي أنزلته من الحق منزلة أن يكون الحق سمعه وبصره والعلة في ذلك أن المتنفل عبد اختيار كالأجير فإذا اختار الإنسان أن يكون عبد الله لا عبد هواه فقد آثر الله على هواه وهو في الفرائض عبد اضطرار لا عبد اختيار فتلك العبودية أوجبت عليه خدمة سيده فيما افترضه عليه فبين الإنسان في عبوديته الاضطرارية وبين عبوديته الاختيار ما بين الأجير والعبد المملوك فالعبد الأصلي ما له على سيده استحقاق إلا ما لا بد منه يأكل‏\nمن سيده ويلبس من سيده ويقوم بواجبات مقامه فلا يزال في دار سيده ليلا ونهارا لا يبرح إلا إذا وجهه في شغله فهو في الدنيا مع الله وفي القيامة مع الله وفي الجنة مع الله فإنها جميعها ملك سيده فيتصرف فيها تصرف الملاك والأجير ماله سوى ما عين له من الأجرة منها نفقته وكسوته وماله دخول على حرم سيده ومؤجره ولا الاطلاع على أسراره ولا تصرف في ملكه إلا بقدر ما استوجر عليه فإذا انقضت مدة إجارته وأخذ أجرته فارق مؤجره واشتغل بأهله وليس له من هذا الوجه حقيقة ولا نسبة تطلب من استأجره إلا أن يمن عليه رب المال بأن يبعث خلفه ويجالسه ويخلع عليه فذلك من باب المنة وقد ارتفعت عنه في الدار الآخرة عبودية الاختيار فإن تفطنت فقد نبهتك على مقام جليل تعرف منه من أي مقام قالت الأنبياء مع كونهم عبيدا مخلصين له لم يملكهم هوى أنفسهم ولا أحد من خلق الله ومع هذا قالوا إِنْ أَجْرِيَ إِلَّا عَلَى الله فيعلم إن ذلك راجع إلى دخولهم تحت حكم الأسماء الإلهية فمن هناك وقعت الإجارة فهم في الاضطرار والحقيقة عبيد الذات وهم لها ملك وصارت الأسماء الإلهية تطلبهم لظهور آثارها فيهم فلهم الاختيار في الدخول تحت أي اسم إلهي شاءوا وقد علمت الأسماء الإلهية ذلك فعينت لهم الأسماء الإلهية الأجور يطلب كل اسم إلهي من هذا العبد الذاتي أن يؤثره على غيره من الأسماء الإلهية بخدمته فيقول له ادخل تحت أمري وأنا أعطيك كذا وكذا فلا يزال في خدمة ذلك الاسم حتى يناديه السيد من حيث عبودية الذات فيترك كل اسم إلهي ويقوم لدعوة سيده فإذا فعل ما أمره به حينئذ رجع إلى أي اسم شاء ولهذا يتنفل الإنسان ويتعبد بما شاء حتى يسمع إقامة الصلاة المفروضة فتحرم عليه كل نافلة ويبادر إلى أداء فرض سيده ومالكه فإذا فرغ دخل في أي نافلة شاء فهو في التشبيه في هذه المسألة كعبد لسيده أولاد كثيرة فهو مع سيده بحكم عبودية الاضطرار إذا أمره سيده لم يشتغل بغير أمره وإذا فرغ من أداء ذلك طلب أولاد سيده منه أن يسخروه فلا بد أن يعينوا له ما يرغبه في خدمتهم وكل ولد يحب أن يأخذه لخدمته في وقت فراغه من شغل سيده فيتنافسون في أجره ليستخلصوه إليهم فهو مخير مع أي ولد يخدم في ذلك الوقت فالإنسان هو العبد والسيد هو الله والأولاد سائر الأسماء الإلهية فإذا رأى هذا العبد ملهوفا فأغاثه فيعلم أنه تحت تسخير الاسم المغيث فيكون له من المغيث ما عين له في ذلك من الأجر وإذا رأى ضعيفا في نفسه فتلطف به كان تحت تسخير الاسم اللطيف وكذلك ما بقي من الأسماء فتحقق يا ولي كيف تخدم ربك وسيدك وكن على علم صحيح في نفسك وفي سيدك تكن من العلماء الراسخين في العلم الحكماء الإلهيين وتفز بالدرجة القصوى والمكانة العليا مع الرسل والأنبياء ويحوي أيضا هذا المنزل على علم التخلق بالأسماء الإلهية كلها وأعني بالكل ما وصل إلينا العلم بها وعلم التمييز وأين يناله العبد وتقدير الزمان الذي بينه وبين الوصول إليه وعلم التفاضل الإلهي بين الله وبين عباده في مثل قوله أَحْسَنُ الْخالِقِينَ وأَرْحَمُ الرَّاحِمِينَ ما الوجه الذي جمعهم حتى كان الحق في ذلك الوجه أكمل ولا مفاضلة بين الله وخلقه إذ كان السيد هو الذي لا يكاثر ولا يفاضل والكل عبيد له ولا مفاضلة بين السيد وعبده من حيث هو عبد بل السيد له الفضل أجمعه وعلم مراتب أهل التصديق أهل التكذيب من مراتب أهل الكفر والشرك وغيرهم وعلم التمني أي اسم إلهي يطلبه وعلم الصفات التي يكرهها السيد من العبد وما السبب الموجب للعبد حتى يدخل فيما يكرهه سيده هل من حقيقة هو عليها تطلب ذلك أو هو راجع إلى القضاء والقدر خاصة وعلم القلوب وعلم العلامات وعلم الإصرار وبما يتعلق وقد بيناه في كتاب إيجاز البيان في الترجمة عن القرآن في قوله تعالى في آل عمران ولَمْ يُصِرُّوا عَلى‏ ما فَعَلُوا فانظره هناك وعلم الجزاء الدنياوي والأخراوي وقد بيناه في التفسير لنا في فاتحة الكتاب في قوله تعالى مالِكِ يَوْمِ الدِّينِ وعلم التقوى وعلم الفرقان وعلم القرآن وعلم الشدائد والأهوال ولما ذا ترجع وكون أيام الدجال من سنة وشهر وجمعة وسائر أيامه كالأيام المعهودة هل ذلك راجع إلى شدة الفجاة فإن الهم بولد كبير أو بصغر كلما دام واستصحبه الإنسان هان عليه ما يجد حتى إن المعاقب بالضرب ما يحس به إلا في أول ما يقع به مقدارا قليلا ثم لما يتخدر موضع الضرب فلا يحس به وعلم الانفراد بالحق لأهل الشقاء ما فائدته ولما ذا يرجع وعلم المكر والخداع والكيد والاستدراج والفرق بين هذه المراتب وأصحابها وعلم الصبر وعلم عقوبة من لم يصبر ومتى يكون صابرا وعلم العناية وعلم الاجتباء وعلم منازل الصالحين وهو علم غريب شريف ما رأيت من العارفين من‏\nيعرفه إلا الأنبياء خاصة فالحمد لله الذي من علينا بمعرفته وما رأينا ذلك إلا بكون الله امتن علينا بالاحترام التام لرسله عليه السلام وشرائعه المنزلة وعلم الصلاح يختص بهم فمكنني الله من جنى ثمرته فقد نبهتك على الطريق الموصلة إلى علم الصلاح الذي أغفل الناس طريقه وجعلوه في الطبقة الرابعة وأخذوا الطريق خطا مستقيما وطريق الحق ليس كذلك وإنما هو مستقيم الاستدارة فإن القوم جهلوا معنى الاستقامة في الأشياء ما هي فالاستقامة الدائرة أن تكون دائرة صحيحة بحيث أن يكون كل خط يخرج من النقطة إلى المحيط منها مساويا لصاحبه وسائر الخطوط كما إن الاستقامة في الشكل المربع والمثلث أن يكون متساوى الأضلاع بتساوي الزوايا كما إن الاستقامة في الشكل المثلث المتساوي الساقين أن يكون متساوى الساقين فكل شي‏ء لم يخرج عما وضع له فهي استقامته وعلم العين وعلم الفرق بين المعجزة والكرامة والسحر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Sixteen: Concerning the Knowledge of the Station of the Established Attributes (الصفات القائمة) Inscribed by the Divine Pen (القلم الإلهي) upon the Human Preserved Tablet (اللوح المحفوظ الإنساني), derived from the Comprehensive Presences (الحضرات) of Moses and Muhammad, which are among the Most Sublime Presences.\n\nThe secret of the Inkwell and the Pen,\nIs the knowledge of origination (الحدوث) and eternity (القدم).\n\nAnd that is specific to him\nWho was called, \"My servant, come forward.\"\n\nTo the Presence whose Essence\nHe had a precedence (قدم) within it.\n\nAnd it was said to him\n\"In the rank of Knowledge, you have precedence.\"\n\nAnd he came striving, riding\nAnd walking on foot.\n\nAnd he had mingled with them\nA mingling of flesh with blood.\n\nAnd he joined the Cosmos when\nThe Real (الحق) made him witness non-existence.\n\nSo his secret in his existence\nIs like his likeness when he was non-existent.\n\nAnd he was not in his time\nOne possessing blameworthy steps.\n\nFor the condition of every penitent\nIs true resolve and remorse.\n\nWhen he came to His Presence\nHe came with humility and service.\n\nAnd when He beheld him\nAn eye upon the Throne, He resolved.\n\nSo the Eye bestowed upon him\nSince he was one of the servants.\n\nAnd when he departs from\nThat station, he serves.\n\n### [The Messenger of Allah was transported with his body]\n\nKnow, may Allah aid you, O intimate friend (الولي الحميم) and noble chosen one (الصفي الكريم), may Allah illuminate your inner sight, that when the Messenger of Allah (PBUH) had the Quran as his character and was characterized by the Names (الأسماء), and Allah, the Glorious, mentioned in His Mighty Book that He established Himself upon the Throne (اسْتَوى‏ عَلَى الْعَرْشِ) as a way of praising and commending Himself—since the Throne is the greatest of bodies—He granted His Prophet (PBUH) a relationship to this establishment as a form of praise and commendation upon him, as it was the highest station reached by any Messenger transported (أسرى به).\n\nThis indicates that he (PBUH) was transported with his body (بجسمه). If the transportation had been merely a dream (رؤيا), neither the journey nor the arrival at this station would have been a source of praise, nor would the disbelievers have denied it in his regard, because in a dream, a person can reach the rank of seeing Allah the Exalted, which is the most noble of states. Dreams do not hold such significance for souls, as every human, indeed every animal, possesses the power of dreaming.\n\nThe Prophet (PBUH) spoke of himself as a form of praise, using the particle of culmination (*hatta* / حتى), mentioning that he was transported *until* he appeared to one who was established (مستوي) and heard the screeching of the Pens (صريف الأقلام). This is His saying: <<لِنُرِيَهُ مِنْ آيَاتِنَا إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ>> (That We might show him some of Our signs. Indeed, He is the All-Hearing, the All-Seeing). The pronoun *He* (هو) in <<إِنَّهُ هُوَ>> refers to Muhammad (PBUH). He was transported, so he saw the signs and heard the screeching of the Pens. He saw the signs and heard from them what was his portion of hearing—the sound, which is expressed by *sarif* (screeching). *Sarif* is sound, as Al-Nābighah said:\n\nIt has a screeching like the screeching of the bucket-rope against the well-pulley.\n\nThis indicates that a power remained for him in the spiritual realm (الملكوت) that he did not reach with his body *as a seer*, but *as a hearer*. He reached the hearing of the sounds of the Pens as they wrote down the decrees (الأحكام) that Allah brings into existence in the world (العالم).\n\nThe rank of these Pens is below the rank of the Supreme Pen (القلم الأعلى) and below the Preserved Tablet (اللوح المحفوظ). What the Supreme Pen writes is immutable. The Tablet is called *Mahfuz* (Preserved) because it is protected from erasure (المحو), so what is written in it is not erased.\n\nThese Pens write upon the Tablets of Erasure and Affirmation (ألواح المحو والإثبات), which is referenced in His saying: <<يَمْحُوا اللهُ مَا يَشَاءُ وَيُثْبِتُ>> (Allah erases what He wills and affirms). From these Tablets, the Divine Laws (الشرائع), scriptures (الصحف), and Books (الكتب) descend upon the Messengers, peace and blessings of Allah be upon them. This is why abrogation (النسخ) occurs in the Divine Laws, and abrogation of a ruling occurs within a single Law. This signifies the end of the ruling's duration, not a change in Allah's initial knowledge, for that is impossible for Allah.\n\nIt was to this limit that the Prophet (PBUH) went back and forth between Moses and his Lord concerning the fifty prayers. This was the limit of his ascent. Allah erased from the *Ummah* of Muhammad (PBUH) what He willed of those prayers that were written in these Tablets, until He affirmed these five, and affirmed for those who pray them the reward of fifty. He revealed to him that the Word would not be changed with Him, so he did not return to Moses after that concerning this matter.\n\nFrom this writing also comes: <<ثُمَّ قَضَى أَجَلًا وَأَجَلٌ مُسَمًّى>> (Then He decreed a term and a specified term). And from these Tablets, He, the Glorious, describes Himself as hesitating (يتردد) regarding taking the soul of the believer by death, even though He has decreed it.\n\nFrom this Divine Reality, symbolized by the Divine Hesitation (التردد الإلهي), comes its flow into the cosmic hesitation (التردد الكوني) in affairs and the confusion (الحيرة) regarding them. This occurs when a person finds his soul hesitating about whether to perform an action or not, remaining in that state until one of the hesitated actions occurs, and the hesitation vanishes. That action which occurs is the one that was affirmed in the Tablet from among the hesitated matters.\n\nThis is because the Pen writing on the Tablet of Erasure writes an action—this corresponds to the moment the thought (الخاطر) of that action occurs to the servant. Then that writing is erased by Allah, and the thought vanishes from that person, because the subtle connection (*raqīqah*) from this Tablet extending to the soul of that person in the unseen world (عالم الغيب) ceases. The subtle connections to the souls from these Tablets arise when the writing occurs and are severed when it is erased.\n\nIf the Pen sees the place on the Tablet erased, it writes something else related to that matter, whether action or omission. A subtle connection extends from this writing to the soul of the person for whom it was written, and a counter-thought occurs to that person. If the Real (الحق) wills its affirmation, He does not erase it. If it is affirmed, the subtle connection remains attached to the heart of this person and is established. That person then performs or omits that action according to what was affirmed in the Tablet. When he performs it or remains firm in omitting it, and the action is concluded, the Real erases it from being a decreed action and affirms it as a form of good or bad deed, according to its nature. Then the Pen writes another matter, and the process is perpetual.\n\nThe rank of these Pens is as described. The one entrusted with erasure is a noble Angel (ملك كريم) before Allah, who erases according to the command of the Real. The dictation to that Angel and the Pens comes from the Divine Attribute symbolized in the revealed scripture by Hesitation (التردد). Were it not for this Divine Reality, no two matters in the world would differ, nor would anyone be confused or hesitate about an affair. All matters would be absolutely decreed (حتماً مقضياً). Yet, this hesitation that people find in their souls is itself a decreed necessity (حتم مقضي) for their existence, as the world is preserved by the Realities (الحقائق).\n\nThe number of these Pens whose writing governs night and day is three hundred and sixty, corresponding to the degrees of the celestial sphere (درج الفلك). Each Pen has a specific knowledge from Allah that no other possesses. From that Pen, knowledge descends to a specific degree of the celestial sphere. When the stars (الكواكب) traversing that degree from the eight spheres descend into it, they take from the knowledge deposited by that Pen according to the spiritual power of that star. This moves their sphere, and the effect reaches the Elements (الأركان). The Elements accept that effect according to the readiness of that Element. The effect then flows from the Elements into the Generated Beings (المولدات), causing whatever Allah wills to occur in them, according to the increase or decrease they accepted in their body, powers, spirit, knowledge, ignorance, forgetfulness, heedlessness, presence, remembrance, and wakefulness—all by the decree of the All-Mighty, the All-Knowing.\n\nDays are generated by the movement of the Great Sphere. Night and day are determined within the day by the daily great movement relative to the movement of the sphere of the Sun, which is under its protection. The Earth was made dense so that the Sun's light would not penetrate it, allowing for the existence of night, which is the Earth's shadow. This is why the day is longer in some places and shorter in others, and likewise for the night. This is how the increase in our night and day occurs. By these nights and days existing in the inhabited parts of the Earth, the days of the spheres and the days of the Lord are counted. Every day mentioned is His saying: <<وَإِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ>> (Indeed, a day with your Lord is like a thousand years of those which you count)—meaning, of our known days. We know definitively that places where the day lasts six months and the night likewise, that is one single day for that location. The day of that location is three hundred and sixty days of what we count.\n\nI have informed you of the station of these Pens whose writing sound the Messenger of Allah (PBUH) heard, concerning Divine Knowledge, what sustains them, the Divine Reality upon which they rely, and their effect on the celestial world (العالم العلوي) of angels, stars, and spheres, and their effect on the elements and generated beings. This is a marvelous unveiling (كشف عجيب) containing strange secrets regarding the decrees of these Pens, which cause all effects in the world perpetually. They must write and affirm the scattering of the stars, the dissolution of these celestial bodies, the ruin of this worldly abode, and the transfer of habitation for the fortunate to the lofty Gardens (الجنان العلية) whose ground is the surface of the Eighth Sphere, and Hell (جهنم) to the lowest of the low (أسفل سافلين), which is the abode of the wretched. We have mentioned this in the chapter on Paradise and the chapter on Hell in this book.\n\nAs for the Supreme Pen (القلم الأعلى), it affirmed in the Preserved Tablet (اللوح المحفوظ) everything that proceeds from these other Pens, including erasure and affirmation. Thus, the Preserved Tablet contains the affirmation of erasure in these Tablets, the affirmation of affirmation, and the erasure of affirmation when the decree occurs and another matter is initiated. It is a Tablet sanctified from erasure. It is the one sustained by the Divine Pen (القلم الإلهي) with the details of differing matters and their outcomes, meticulously inscribed by the decree of the All-Mighty, the All-Knowing.\n\nThe hearts of the Saints (الأولياء) receive a true unveiling (كشف صحيح) of these Pens through genuine Divine Unveiling (الكشف الإلهي الحقيقي) in the form of similitude (التمثيل), just as Paradise was presented to the Messenger of Allah (PBUH) on the surface of the wall. We say that what was presented was a reality (حقيقة) despite being a similitude, because of the Messenger of Allah’s saying: \"Did you see me when I stepped forward, intending to pluck a cluster of grapes from it? Had I brought it out, you would have eaten from it as long as the world remained.\"\n\nAnd when Hell was presented to him, he stepped back from his prayer direction (قبلته) lest its flame touch him. He saw Ibn Luhayy, the man with the hooked staff (صاحب المحجن), and the woman with the cat inside it. This occurred during the solar eclipse prayer (صلاة كسوف الشمس). The Prophet (PBUH) said, \"Indeed, Allah is in the direction of the worshipper's prayer.\"\n\nHe saw Paradise and Hell in his prayer direction, just as the wall was in his prayer direction.\n\n### [That Allah has Names specific to Paradise and its people]\n\nKnow that Allah has Names specific to Paradise and its people, and Names specific to Hell and its people. The Real (الحق) is addressed intimately by the worshipper (المصلي) through His Names, not through His Essence (الذات), since His Essence transcends limitation, measure, and restriction.\n\nKnow, based on what I have alerted you to, that the Messenger of Allah (PBUH) was continuously addressed intimately by the Real in his prayer direction and during his prayer. The witnessing (مشاهدة) of the Gardens and the Fire and those within them, and his movement forward and backward, did not remove him from being a worshipper, outwardly and inwardly.\n\nThe Prophet (PBUH) only informed us of all this during the prayer to teach us about the matters that occur to us during our own prayers—such as witnessing our affairs of buying, selling, giving, and taking, and the flow of the worshipper's thoughts (خواطر) concerning the universes (الأكوان) disclosed to him inwardly during his prayer. Umar (RA) said of himself that he used to equip the army while he was in prayer.\n\nThe Prophet's account of what he witnessed in his prayer shows us that such occurrences do not invalidate the prescribed prayer (الصلاة المشروعة), contrary to the belief of some common jurists (الفقهاء) who lack knowledge of these matters, and perhaps some pious individuals who imagine that all this invalidates the prayer and removes the person from presence with the Real. The matter is not so. Rather, everything the worshipper witnesses in his prayer from the universes is real (حق) and is part of the prayer for those who understand the meaning of prayer.\n\nJust as the worshipper is not invalidated by what his eye witnesses of the sensibles (المحسوسات) in his prayer direction—which appeared to his sight due to their existence and essences from the worlds and their movements—and this does not remove him from being a worshipper, without dispute (and it is disliked for the worshipper to close his eyes in prayer); likewise, what is disclosed to the eye of his inner sight (بصيرته) and heart, such as thoughts (الخواطر) and images of affairs that appear inwardly, which are from Allah, and his inner eye is open like his physical eye. Every represented image (صورة ممثلة) through which the Real discloses Himself to him inwardly, just as He discloses Himself in the sensibles outwardly, must be perceived by the eye of his inner sight and heart, just as he perceives the images of the sensibles with his physical sight.\n\nAnd just as this outward perception did not remove him from being a worshipper according to what was prescribed for him, along with facing the *Qibla* with his face, likewise, what he witnessed inwardly of the images of the universes does not remove him from being a worshipper according to what was prescribed for him, along with facing his Lord. That facing is what is expressed by the intention (النية) required of him when commencing the worship.\n\nThose who lack knowledge of these matters consider this invalidating. If someone argues using the Prophet's saying concerning the two *rak'ahs* a servant prays after ablution, that he should not speak to himself (لا يحدث نفسه) during them, this is not a valid argument. They have not understood what the Messenger of Allah intended, nor have they accurately examined the word by which the Prophet qualified it. He qualified it by *speaking with himself*. These images the worshipper sees himself in are witnessed by the eye of his heart. The Lawgiver only addressed the one who *speaks*, not the one who *sees*, because it is not within his power to close the eye of his heart from the images through which the Real discloses Himself to him. Furthermore, he qualified the speech as being *with himself*. If he speaks with his Lord or with the image disclosed to him in his prayer, that does not invalidate his prayer.\n\nThe Messenger of Allah (PBUH), when reciting a verse of seeking forgiveness in his prayer, would seek forgiveness, and when reciting a verse of desire, he would ask Allah for what it indicated.\n\nNone of that removed him from being a worshipper, nor did a new intention arise that would remove him from his prayer, just as he did not turn outwardly to a direction other than his *Qibla*. As long as the worshipper does not turn his face away from his *Qibla* and does not form an intention to leave the prayer, his prayer is sound and accepted. This is from Allah's grace upon His servants and His mercy toward them. Not everyone knows the address of the Real to His servants and what He intends from them. As for the *hadith* narrated from the Messenger of Allah (PBUH) concerning the acceptance of prayer—from a tenth up to a half, according to what was understood from it—it is not sound. Even if it were sound, it would not invalidate what we have mentioned.\n\n### [The Knowledge of Comprehension and the Knowledge of Detail]\n\nKnow that this station (منزل) is great and glorious, having a profound connection (اختصاص عظيم) with the Prophet (PBUH). What we have mentioned so far is sufficient for those who reflect and gain insight. Let us mention the sciences it contains, for the chapters of the book are numerous, and lengthy discussion makes attainment difficult for those who seek it.\n\nKnow that it contains the Knowledge of Comprehension (علم الإجمال)—and whether there is comprehension in Allah's Knowledge, or if He only knows things in detail, though they are infinite. It contains the Knowledge of Detail (علم التفصيل). It contains the Knowledge that lies between Comprehension and Detail—a strange science known only to a few Gnostics (العلماء بالله), let alone the many.\n\nIt contains the science of the Registers (الدواوين) and their arrangement. It contains the science of Rewards (الأجور) and those who deserve them, despite being servants (*abīd*). Why is the servant called a hired worker (*ajīr*)? This implies a relationship to the action originating from him. The hiring (الإجارة) stems from that relationship, and from it comes the request for aid in serving his Master. From which aspect is the obligation (الفرض) determined for him initially, before the wage? A hired worker is only obligated after hiring himself out. The servant is obligated to obey his Master.\n\nMan stands with the Real in two states: the state of servitude (عبودية) and the state of hiring (إجارة). By virtue of being a servant, he is obligated by the compulsory duties (الفرائض) like prescribed prayer, *Zakat*, and all obligations. He receives no wage (أجر) whatsoever for performing his obligation. Rather, he receives the favors (النعم) bestowed upon him by his Master, which are superior to wages, but not on the basis of a wage.\n\nThen, Allah encourages him to worship Him through matters that are not compulsory (ليست عليه فرضا). Wages are prescribed for these supererogatory acts (الأعمال المندوب إليها). If the servant draws near to his Master through them, He gives him his wage for them. If he does not draw near, he is neither sought after nor blamed for them. From this perspective, the servant's ruling is like that of a stranger in hiring. The obligatory duties receive the recompense (الجزاء) that corresponds to them, for they are the covenant between Allah and His servants. The supererogatory acts receive the wages, which is His saying: \"My servant continues to draw near to Me with supererogatory deeds (النوافل) until I love him. When I love him, I am his hearing and his sight...\" (Hadith Qudsi).\n\nThe supererogatory act produces Divine Love (المحبة الإلهية) for him, so that the Real becomes his hearing and sight. Divine Love is what elevates him in relation to the Real to the station where the Real becomes his hearing and sight. The reason for this is that the one who performs supererogatory acts is a servant of choice (عبد اختيار), like a hired worker. If a person chooses to be the servant of Allah and not the servant of his own desire (هواه), he has preferred Allah over his desire. In obligatory duties, he is a servant of compulsion (عبد اضطرار), not a servant of choice. That servitude necessitates serving his Master in what He has obligated upon him.\n\nThe difference between man in his compulsory servitude and his chosen servitude is the difference between a hired worker and a possessed slave (العبد المملوك). The original slave has no entitlement from his Master except what is necessary: he eats and dresses from his Master, and performs the duties of his station. He remains in his Master's house night and day, never leaving unless directed to a task. He is with Allah in this world, with Allah in the Resurrection, and with Allah in Paradise, for all of it belongs to his Master, who disposes of it as an owner.\n\nThe hired worker has only the specified wage, which includes his sustenance and clothing. He is not permitted to enter the Master's private quarters or be privy to His secrets, nor dispose of His property except to the extent for which he was hired. When his term of hiring ends and he takes his wage, he leaves his employer and attends to his own family. From this perspective, he has no reality or relationship that demands anything from the one who hired him, unless the Lord of the wealth favors him by sending for him, sitting with him, and bestowing a robe of honor upon him—that is an act of grace (منة). The servitude of choice (عبودية الاختيار) is lifted from him in the Hereafter.\n\nIf you have understood this, I have alerted you to a sublime station from which you can understand why the Prophets, despite being sincere servants (عبيد مخلصين) whom neither their own desires nor any creature of Allah owned, still said: <<إِنْ أَجْرِيَ إِلَّا عَلَى اللهِ>> (My reward is only upon Allah). This shows that their statement relates to their entering under the rule of the Divine Names (الأسماء الإلهية). From there, the hiring occurred. In compulsion and reality, they are servants of the Essence (عبيد الذات) and are His property. The Divine Names sought them out for the manifestation of their effects in them. They have the choice to enter under whichever Divine Name they wish.\n\nThe Divine Names knew this, so they specified wages for them. Each Divine Name asks this essential servant (العبد الذاتي) to prefer it over the other Divine Names by serving it, saying: \"Enter under My command, and I will give you such and such.\" He remains in the service of that Name until the Master calls him by virtue of the servitude of the Essence (عبودية الذات). He then abandons every Divine Name and responds to the call of his Master. When he has performed what He commanded, he returns to whichever Name he wishes.\n\nThis is why a person performs supererogatory acts and worships as he wills until he hears the call to the obligatory prayer (إقامة الصلاة المفروضة). Every supererogatory act becomes forbidden to him, and he rushes to perform the obligation of his Master and Owner. When he finishes, he enters into any supererogatory act he wishes.\n\nIn this matter, the analogy is like a slave whose Master has many children. He is with his Master by the rule of compulsory servitude. If his Master commands him, he does not engage in anything else. When he finishes that duty, the Master's children ask him to serve them. They must specify what will make him desire their service. Each child loves to take him for their service during his free time from the Master's work, so they compete for his wage to secure him for themselves. He is free to serve whichever child he chooses during that time.\n\nMan is the servant, Allah is the Master (السيد), and the children are the rest of the Divine Names (الأسماء الإلهية). If this servant sees someone distressed and helps him, he knows he is under the influence of the Name *Al-Mughīth* (The Helper), and he receives from *Al-Mughīth* the wage specified for that. If he sees someone weak in spirit and treats him kindly, he is under the influence of the Name *Al-Latīf* (The Subtle). Likewise for the remaining Names.\n\nRealize, O Wali (ولي), how you serve your Lord and Master. Possess true knowledge concerning yourself and your Master, and you will be among the scholars firmly rooted in knowledge (الراسخين في العلم) and the Divine Sages (الحكماء الإلهيين), attaining the highest degree and the loftiest station alongside the Messengers and Prophets.\n\nThis station also contains: the science of being characterized by all the Divine Names (التخلق بالأسماء الإلهية)—meaning all those we have knowledge of. The science of Distinction (علم التمييز), where the servant attains it, and the estimation of the time between him and its attainment. The science of Divine Preference (علم التفاضل الإلهي) between Allah and His servants, such as in His saying: <<أَحْسَنُ الْخَالِقِينَ>> (The Best of Creators) and <<أَرْحَمُ الرَّاحِمِينَ>> (The Most Merciful of the Merciful). What is the aspect that unites them such that the Real is more perfect in that aspect? There is no comparison (مفاضلة) between Allah and His creation, since the Master is the one who is not competed with or compared, and all are His servants. There is no comparison between the Master and His servant *qua* servant; rather, the Master possesses all excellence.\n\nThe science of the ranks of the people of affirmation (أهل التصديق) and the people of denial (أهل التكذيب), distinct from the ranks of the people of disbelief (الكفر) and polytheism (الشرك), and others. The science of Wishing (علم التمني)—which Divine Name seeks it. The science of the Attributes (الصفات) disliked by the Master in the servant, and the compelling reason for the servant to engage in what his Master dislikes—does it stem from a reality inherent in him that demands it, or is it solely due to Divine Decree and Destiny (القضاء والقدر)?\n\nThe science of Hearts (علم القلوب). The science of Signs (علم العلامات). The science of Persistence in Sin (علم الإصرار) and what it relates to. We have explained this in the book *Ījāz al-Bayān fī al-Tarjamah ‘an al-Qur’ān* concerning His saying in Al Imran: <<وَلَمْ يُصِرُّوا عَلَى مَا فَعَلُوا>> (And they did not persist in what they had done)—refer to it there. The science of Worldly and Hereafter Recompense (علم الجزاء الدنياوي والأخراوي). We have explained this in our commentary on the opening chapter of the Book concerning His saying: <<مَالِكِ يَوْمِ الدِّينِ>> (Sovereign of the Day of Recompense).\n\nThe science of Piety (علم التقوى). The science of the Criterion (علم الفرقان). The science of the Quran (علم القرآن). The science of Hardships and Terrors (علم الشدائد والأهوال) and their origin. The nature of the days of the Dajjal (Antichrist)—a year, a month, a week, and the rest of his days being like ordinary days. Does this relate to the intensity of the suddenness (الفجاة)? For worry over a great or small child, the longer it lasts and the more a person accompanies it, the easier the suffering becomes. Even one punished by beating only feels it intensely at the beginning for a short time, then the struck area becomes numb and he no longer feels it.\n\nThe science of Isolation with the Real (علم الانفراد بالحق) for the people of wretchedness (أهل الشقاء)—what is its benefit and origin? The science of Cunning (المكر), Deception (الخداع), Plotting (الكيد), and Gradual Enticement (الاستدراج), and the difference between these levels and their practitioners. The science of Patience (علم الصبر) and the punishment of those who are not patient, and when one is considered patient. The science of Divine Care (علم العناية). The science of Divine Selection (علم الاجتباء).\n\nThe science of the Stations of the Righteous (علم منازل الصالحين)—a strange and noble science that I have not seen any Gnostic know except the Prophets specifically. Praise be to Allah who favored us with its knowledge. We only saw this because Allah favored us with complete reverence for His Messengers (PBUH) and the revealed laws. The science of Righteousness (علم الصلاح) is specific to them, and Allah enabled me to gather its fruit. I have alerted you to the path leading to the science of Righteousness, whose path people neglected, placing it in the fourth category, and taking the path as a straight line. The path of the Real is not like that; rather, it is straight in its circularity (مستقيم الاستدارة).\n\nPeople were ignorant of the meaning of straightness in things. Circular straightness means being a perfect circle such that every line drawn from the center point to the circumference is equal to the others. Likewise, straightness in a square or triangle means having equal sides and equal angles. Straightness in an isosceles triangle means having two equal sides. Everything that does not deviate from what it was established for is its straightness.\n\nThe science of the Eye (علم العين). The science of the difference between a Miracle (المعجزة), a Spiritual Favor (الكرامة), and Sorcery (السحر). <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو سولہ: صفات قائمہ کی منزل کی معرفت میں جو قلم الٰہی کے ذریعے لوح محفوظ انسانی پر نقش کی گئی ہیں، حضرتِ اجمالیہ موسویہ اور محمدیہ سے، اور یہ دونوں اعلیٰ ترین حضرات (حضرات) میں سے ہیں۔\n\nسیاہی اور قلم کا راز،\nحدوث (حدوث) اور قدم (قدم) کا علم ہے۔\n\nاور یہ اس شخص کے لیے مخصوص ہے جسے پکارا گیا: \"اے میرے بندے، آگے بڑھ!\"\n\nاس ذات کی بارگاہ (حضرة) کے لیے، جس میں اس کا قدم (قدم) تھا۔\n\nاور ان کا قول تھا کہ علم کے مرتبے میں اس کا قدم (قدم) ہے۔\n\nاور وہ سوار ہو کر اور پیدل چل کر آیا۔\n\nاور وہ ان کے ساتھ گوشت اور خون کی طرح گھل مل گیا تھا۔\n\nاور جب حق (الحق) نے اسے عدم (العدم) کا مشاہدہ کرایا تو اس نے کائنات کو عدم سے ملا دیا۔\n\nپس اس کا راز اس کے وجود میں ایسا ہی ہے جیسا کہ اس کے عدم میں تھا۔\n\nاور وہ اپنے وقت میں قابلِ مذمت قدموں کا مالک نہ تھا۔\n\nپس ہر توبہ کرنے والے کی شرط سچا عزم اور ندامت ہے۔\n\nجب وہ اس کی بارگاہ میں آیا تو عاجزی اور خدمت لے کر آیا۔\n\nاور جب اس نے اسے عرش پر آنکھوں سے دیکھا تو مضبوط ہو گیا۔\n\nپس آنکھ نے اس کے لیے سخاوت کی، کیونکہ وہ خادموں میں سے تھا۔\n\nاور جب وہ اس مقام سے نکلتا ہے تو خدمت کرتا ہے۔\n\n### [رسول اللہ صلی اللہ علیہ وسلم کا جسم کے ساتھ معراج کرنا]\n\nجان لو، اللہ تمہاری مدد کرے، اے قریبی ولی (الولي) اور معزز برگزیدہ ہستی، اللہ تمہاری بصیرت کو منور کرے، کہ جب رسول اللہ صلی اللہ علیہ وسلم کا خلق قرآن تھا اور آپ نے اسماء (الأسماء) کے ساتھ تخلق (تخلق) اختیار کیا، اور اللہ سبحانہ نے اپنی کتاب عزیز میں ذکر فرمایا کہ وہ عرش پر مستوی (اسْتَوى‏ عَلَى الْعَرْشِ) ہوا، یہ اپنی تعریف اور ثنا کے طور پر تھا، کیونکہ عرش تمام اجسام میں سب سے بڑا ہے۔ پس اللہ نے اپنے نبی صلی اللہ علیہ وسلم کے لیے اس استواء سے ایک نسبت قائم کی، جو آپ کی تعریف اور ثنا کے طور پر تھی، کیونکہ یہ سب سے اعلیٰ مقام تھا جہاں تک معراج کرنے والے رسولوں میں سے کوئی پہنچ سکتا تھا۔ اور یہ اس بات کی دلیل ہے کہ آپ صلی اللہ علیہ وسلم کو جسم کے ساتھ معراج کرایا گیا، اور اگر معراج خواب (رؤیا) ہوتا تو نہ تو یہ معراج اور نہ ہی اس مقام تک پہنچنا تعریف کا باعث ہوتا، اور نہ ہی اس پر اعراب کی طرف سے کوئی انکار واقع ہوتا۔ کیونکہ خواب میں انسان اللہ تعالیٰ کے دیدار کے مرتبے تک پہنچ جاتا ہے، اور یہ اشرف ترین حالتوں میں سے ہے۔ لیکن خواب کا نفوس میں وہ مقام نہیں ہوتا، کیونکہ ہر انسان بلکہ ہر حیوان میں خواب دیکھنے کی قوت ہوتی ہے۔ پس آپ صلی اللہ علیہ وسلم نے اپنی تعریف کے طور پر اپنے بارے میں فرمایا، کیونکہ آپ حرفِ غایت یعنی \"حتیٰ\" کے ساتھ آئے، تو آپ نے ذکر فرمایا کہ آپ کو معراج کرایا گیا یہاں تک کہ آپ ایک ایسے مستوی (سطح) پر ظاہر ہوئے جہاں آپ نے قلموں کی سرسراہٹ سنی۔ اور یہ اللہ تعالیٰ کا قول ہے: \"تاکہ ہم اسے اپنی کچھ نشانیاں دکھائیں، بے شک وہ ہی سننے والا، دیکھنے والا ہے\" (لِنُرِيَهُ من آياتِنا إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ)۔ پس \"إِنَّهُ هُوَ\" میں ضمیر محمد صلی اللہ علیہ وسلم کی طرف لوٹتی ہے، کیونکہ آپ کو معراج کرایا گیا تو آپ نے نشانیاں دیکھیں اور قلموں کی سرسراہٹ سنی۔ پس آپ نشانیاں دیکھتے تھے اور ان میں سے وہ حصہ سنتے تھے جو سننے کا حصہ تھا، یعنی آواز، کیونکہ اسے \"صریف\" (سرسراہٹ) سے تعبیر کیا گیا ہے۔ اور صریف آواز کو کہتے ہیں۔ نابغہ نے کہا ہے:\n\n> له صريف صريف القعو بالمسد\n>\n> اس کی سرسراہٹ ایسی ہے جیسے رسی کے ساتھ ڈول کی سرسراہٹ ہو۔\n\nپس اس سے یہ ظاہر ہوا کہ ملکوت (الملکوت) میں آپ کے لیے ایک ایسی قوت باقی تھی جہاں آپ اپنے جسم کے ساتھ نہیں پہنچے، اس حیثیت سے کہ آپ دیکھنے والے تھے، بلکہ اس حیثیت سے کہ آپ سننے والے تھے۔ پس آپ نے قلموں کی آوازیں سنیں جو ان احکام کو جاری کر رہی تھیں جنہیں اللہ تعالیٰ عالم میں پیدا کرتا ہے۔ اور ان قلموں کا مرتبہ قلم اعلیٰ (القلم الأعلى) اور لوح محفوظ (اللوح المحفوظ) کے مرتبے سے کم ہے۔ کیونکہ جو کچھ قلم اعلیٰ نے لکھا ہے وہ تبدیل نہیں ہوتا، اور لوح کو محفوظ (المحفوظ) اسی لیے کہا گیا ہے کہ وہ محو (مٹانے) سے محفوظ ہے، پس جو کچھ اس میں لکھا گیا وہ مٹایا نہیں جاتا۔ اور یہ قلمیں الواح محو و اثبات (ألواح المحو والإثبات) میں لکھتی ہیں، اور یہ اللہ تعالیٰ کا قول ہے: \"اللہ جو چاہتا ہے مٹا دیتا ہے اور جو چاہتا ہے ثابت کر دیتا ہے\" (يَمْحُوا الله ما يَشاءُ ويُثْبِتُ)۔ اور انہی الواح سے شرائع، صحیفے اور کتابیں رسولوں پر نازل ہوتی ہیں، اللہ کا درود و سلام ہو ان پر۔ اور اسی وجہ سے شرائع میں نسخ (منسوخ ہونا) داخل ہوتا ہے، اور ایک ہی شریعت میں حکم کا نسخ داخل ہوتا ہے، جو کہ حکم کی مدت کے اختتام کا اظہار ہے نہ کہ ابتدا کا، کیونکہ یہ اللہ پر محال ہے۔ اور یہیں تک آپ صلی اللہ علیہ وسلم پچاس نمازوں کے معاملے میں موسیٰ علیہ السلام اور اپنے رب کے درمیان تردد (تردد) فرما رہے تھے، یہیں تک آپ کی انتہا تھی۔ پس اللہ تعالیٰ نے امت محمدیہ صلی اللہ علیہ وسلم سے ان نمازوں میں سے جو چاہا مٹا دیا جو ان الواح میں لکھی گئی تھیں، یہاں تک کہ ان میں سے یہ پانچ نمازیں ثابت کر دیں، اور ان کے پڑھنے والے کے لیے پچاس کا اجر ثابت کر دیا، اور آپ کی طرف وحی کی کہ اس کے ہاں بات بدلی نہیں جاتی۔ پس اس کے بعد آپ موسیٰ علیہ السلام کے پاس اس معاملے میں واپس نہیں گئے۔ اور اسی کتابت میں سے ہے: \"پھر اس نے ایک مدت مقرر کی اور ایک مقررہ مدت ہے\" (ثُمَّ قَضى‏ أَجَلًا وأَجَلٌ مُسَمًّى)۔ اور انہی الواح میں سے ہے کہ اللہ سبحانہ نے اپنے آپ کو اس طرح بیان فرمایا کہ وہ مومن کی روح کو موت کے ذریعے قبض کرنے میں اپنے نفس میں تردد (تردد) فرماتا ہے، حالانکہ وہ اس پر فیصلہ کر چکا ہے۔ اور اسی حقیقت الٰہیہ (الحقيقة الإلهية) سے، جسے تردد الٰہی سے تعبیر کیا گیا ہے، کونیاتی امور میں تردد اور ان میں حیرت کا سرایت کرنا ہوتا ہے۔ اور یہ اس وقت ہوتا ہے جب انسان اپنے نفس میں کسی کام کے کرنے یا نہ کرنے میں تردد پاتا ہے، اور وہ اسی حال پر رہتا ہے یہاں تک کہ ان امور میں سے کوئی ایک واقع ہو جاتا ہے، اور وہ ایک امر واقع ہو جاتا ہے اور تردد زائل ہو جاتا ہے۔ پس وہ واقع ہونے والا امر وہی ہے جو لوح میں ان متردد امور میں سے ثابت تھا۔ اور یہ اس طرح ہے کہ لوح محو میں لکھنے والا قلم کوئی امر لکھتا ہے، اور یہ وہ وقت ہوتا ہے جب بندے کے دل میں اس کام کو کرنے کا خیال (خاطر) آتا ہے، پھر وہ کتابت مٹا دی جاتی ہے، اللہ اسے مٹا دیتا ہے، تو وہ خیال اس شخص کے دل سے زائل ہو جاتا ہے، کیونکہ اس لوح سے کوئی رقیقہ (لطیف پردہ) اس شخص کے نفس تک عالم غیب (عالم الغيب) میں نہیں پہنچتا۔ کیونکہ نفوس تک ان الواح سے رقیقے کتابت کے وجود سے پیدا ہوتے ہیں اور مٹائے جانے سے منقطع ہو جاتے ہیں۔ پس جب قلم لوح میں اس جگہ کو مٹا ہوا دیکھتا ہے تو اس سے متعلق کوئی دوسرا امر لکھتا ہے، خواہ وہ فعل ہو یا ترک، تو اس کتابت سے ایک رقیقہ اس شخص کے نفس تک پہنچتا ہے جس کے لیے یہ لکھا گیا تھا، تو اس شخص کو وہ خیال آتا ہے جو پہلے کے برعکس ہوتا ہے۔ اگر حق (الحق) اس کو ثابت کرنا چاہے تو اسے نہیں مٹاتا۔ پس جب وہ ثابت ہو جاتا ہے تو ایک رقیقہ اس شخص کے دل سے متعلق رہتا ہے اور ثابت ہو جاتا ہے، تو وہ شخص اس کام کو کرتا ہے یا اسے ترک کرتا ہے، جیسا کہ لوح میں ثابت ہوا ہے۔ پس جب وہ اسے کر لیتا ہے یا اس کے ترک پر ثابت رہتا ہے اور اس کا فعل ختم ہو جاتا ہے، تو حق اسے اس کے فعل کے حکم سے مٹا دیتا ہے اور اسے ایک اچھے یا برے عمل کی صورت میں ثابت کر دیتا ہے، جیسا کہ وہ ہو۔ پھر قلم کوئی دوسرا امر لکھتا ہے، اور یہ معاملہ ہمیشہ جاری رہتا ہے۔ اور ان قلموں کا یہی مرتبہ ہے۔ اور محو پر مقرر کردہ ایک معزز فرشتہ ہے جو اللہ تعالیٰ کے ہاں مکرم ہے، جو حق تعالیٰ کے حکم کے مطابق مٹاتا ہے۔ اور اس فرشتے اور قلموں پر املاء اس صفت الٰہیہ سے ہوتی ہے جسے رسول پر نازل ہونے والی وحی میں تردد (التردد) سے تعبیر کیا گیا ہے۔ اور اگر یہ حقیقت الٰہیہ (الحقيقة الإلهية) نہ ہوتی تو عالم میں دو امور میں اختلاف نہ ہوتا، اور نہ ہی کوئی کسی معاملے میں حیران ہوتا اور نہ ہی تردد کرتا، اور تمام امور حتمی طور پر طے شدہ ہوتے۔ جیسا کہ یہ تردد جو لوگ اپنے نفوس میں پاتے ہیں، ان میں اس کا وجود حتمی طور پر طے شدہ ہے، کیونکہ عالم حقائق (الحقائق) کے ذریعے محفوظ ہے۔ اور ان قلموں کی تعداد جن کے حکم پر رات اور دن جاری ہوتے ہیں، تین سو ساٹھ قلم ہیں، جو فلک کے درجوں کی تعداد کے مطابق ہیں۔ پس ہر قلم کے لیے اللہ کی طرف سے ایک خاص علم ہے جو کسی دوسرے کے لیے نہیں ہے۔ اور اس قلم سے علم فلک کے ایک مخصوص درجے میں نازل ہوتا ہے۔ پس جب اس درجے میں وہ کچھ نازل ہوتا ہے جو آٹھ افلاک میں سے گزرنے والے کواکب کے ذریعے طے ہوتا ہے، تو وہ کواکب اس درجے سے، جو اس قلم سے ودیعت کردہ علم ہے، اتنا حصہ لیتے ہیں جتنا اس کوکب کی روحانی قوت اسے دیتی ہے، پس وہ اس کے ذریعے اپنے فلک کو حرکت دیتے ہیں، تو اثر ارکان (عناصر) تک پہنچتا ہے، اور وہ ارکان اس اثر کو اپنے استعداد کے مطابق قبول کرتے ہیں۔ پھر وہ اثر ارکان سے مولدات (پیدا ہونے والی چیزوں) میں سرایت کرتا ہے، تو ان میں اللہ جو چاہتا ہے پیدا کرتا ہے، اس قبولیت کے مطابق جو اس مولود کے جسم یا اس کی قوتوں، اس کی روح، اس کے علم، جہل، نسیان، غفلت، حضور، تذکر اور بیداری میں کمی یا زیادتی کی صورت میں ہوتی ہے۔ یہ سب عزیز و علیم (العزیز العلیم) کی تقدیر سے ہوتا ہے۔ اور ایام بڑے فلک کی حرکت سے پیدا ہوتے ہیں، اور رات اور دن کا تعین روزانہ کی بڑی حرکت کے حکم سے فلک شمس کی حرکت پر ہوتا ہے، کیونکہ وہ اس کے احاطے میں ہے۔ اور زمین کو کثیف بنایا گیا تاکہ سورج کی روشنی اس میں سے نہ گزرے، رات کے وجود کی وجہ سے جو زمین کا سایہ ہے۔ اور اسی وجہ سے بعض جگہوں پر دن بڑا ہوتا ہے اور چھوٹا بھی ہوتا ہے، اور اسی طرح رات بھی بڑی اور چھوٹی ہوتی ہے۔ اور اسی سے ہمارے ہاں رات اور دن میں اضافہ ہوتا ہے۔ اور زمین کے آباد حصے میں موجود اسی رات اور دن سے افلاک کے دن اور رب کے دن شمار کیے جاتے ہیں۔ اور ہر دن کا ذکر ہے، اور یہ اللہ تعالیٰ کا قول ہے: \"اور بے شک تمہارے رب کے ہاں ایک دن تمہارے شمار کے مطابق ہزار سال جیسا ہے\" (وَإِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ)۔ یعنی ہمارے ان معلوم دنوں میں سے۔ اور ہم یقیناً جانتے ہیں کہ وہ جگہیں جہاں چھ ماہ کا دن ہوتا ہے اور اسی طرح چھ ماہ کی رات ہوتی ہے، وہ اس جگہ کے حق میں ایک ہی دن ہوتا ہے۔ پس اس جگہ کا دن ہمارے شمار کے مطابق تین سو ساٹھ دن ہوتا ہے۔ پس میں نے تمہیں ان قلموں کی منزلت سے آگاہ کر دیا جن کی کتابت کی آواز رسول اللہ صلی اللہ علیہ وسلم نے سنی، اور یہ کہ وہ علم الٰہی (العلم الإلهي) سے ہیں، اور کون انہیں مدد دیتا ہے، اور ان کا سہارا کس حقیقت الٰہیہ پر ہے، اور عالم علوی میں فرشتوں، کواکب اور افلاک پر ان کا کیا اثر ہے، اور عناصر اور مولدات پر ان کا کیا اثر ہے۔ اور یہ ایک عجیب کشف (الکشف) ہے جو ان قلموں کے احکام کے عجیب اسرار پر مشتمل ہے، جن سے عالم میں ہمیشہ تمام تاثیرات ہوتی رہتی ہیں۔ اور ان کے لیے ضروری ہے کہ وہ کواکب کے بکھرنے، ان فلکی اجسام کے ٹوٹنے، اس دنیاوی گھر کی تباہی، اور سعادت مندوں کے لیے عمارت کی منتقلی کو اعلیٰ جنتوں کی طرف لکھیں اور ثابت کریں، جن کی زمین آٹھویں فلک کی سطح ہے، اور جہنم اسفل سافلین (سب سے نچلے درجے) میں ہے، جو بدبختوں کا گھر ہے۔ اور ہم نے اس کا ذکر اس کتاب میں باب جنت اور باب جہنم میں کیا ہے۔ اور جہاں تک قلم اعلیٰ (القلم الأعلى) کا تعلق ہے، تو اس نے لوح محفوظ (اللوح المحفوظ) میں ہر وہ چیز ثابت کر دی جو ان قلموں سے محو اور اثبات کی صورت میں جاری ہوتی ہے۔ پس لوح محفوظ میں ان الواح میں محو کا اثبات ہے، اور اثبات کا اثبات ہے، اور حکم کے واقع ہونے پر اثبات کا محو اور کسی دوسرے امر کا ایجاد ہے۔ پس وہ لوح محو سے پاک ہے۔ وہی ہے جسے قلم الٰہی امور کے اختلاف اور ان کے انجام کے ساتھ مدد دیتا ہے، جو عزیز و علیم (العزیز العلیم) کی تقدیر سے مفصل اور مسطر ہیں۔ اور اولیاء کے قلوب کے لیے حقیقی کشف الٰہی (الکشف الإلهي الحقيقي) کے ذریعے ان قلموں کی تمثیل میں صحیح کشف ہوتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کے لیے جنت کی تمثیل دیوار کے سامنے کی گئی تھی۔ اور ہم نے یہ اس لیے کہا کہ وہ متمثل حقیقت تھی، باوجود اس کے کہ وہ متمثل تھی، رسول اللہ صلی اللہ علیہ وسلم کے اس قول کی وجہ سے: \"کیا تم نے مجھے دیکھا جب میں آگے بڑھا اور میں نے چاہا کہ اس میں سے ایک خوشہ توڑ لوں، اگر میں اسے نکال لاتا تو تم دنیا کے باقی رہنے تک اس میں سے کھاتے رہتے۔\"\n\nاور جب آپ کے لیے جہنم کی تمثیل کی گئی تو آپ اپنی قبلہ کی طرف سے پیچھے ہٹ گئے تاکہ اس کے شعلے آپ کو نہ لگیں۔ اور آپ نے اس میں ابن لُحَی، صاحب محجن (ٹیڑھی لاٹھی والا)، اور بلی والی عورت کو دیکھا۔ اور یہ سورج گرہن کی نماز میں ہوا تھا۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا ہے: \"بے شک اللہ نمازی کے قبلہ میں ہوتا ہے۔\" اور آپ نے جنت اور جہنم کو اپنے قبلہ میں دیکھا، جیسا کہ دیوار آپ کے قبلہ میں تھی۔\n\n### [بے شک اللہ تعالیٰ کے کچھ اسماء ہیں جو جنت اور اس کے باسیوں کے ساتھ خاص ہیں]\n\nاور جان لو کہ اللہ تعالیٰ کے کچھ اسماء ہیں جو جنت اور اس کے باسیوں کے ساتھ خاص ہیں، اور اللہ تعالیٰ کے کچھ اسماء ہیں جو جہنم اور اس کے باسیوں کے ساتھ خاص ہیں۔ اور نمازی حق (الحق) سے اس کے اسماء (الأسماء) کے ذریعے مناجات کرتا ہے نہ کہ اس کی ذات (الذات) کے ذریعے، کیونکہ اس کی ذات حد، مقدار اور تقیید سے بلند ہے۔ پس جو کچھ میں نے تمہیں آگاہ کیا ہے اس سے جان لو کہ رسول اللہ صلی اللہ علیہ وسلم سے حق اپنی قبلہ کی طرف اور اپنی نماز میں مناجات کرتا رہا، اور جنتوں اور جہنم اور ان میں موجود لوگوں کا مشاہدہ اور آپ کا آگے بڑھنا اور پیچھے ہٹنا آپ کو ظاہری اور باطنی طور پر نمازی ہونے سے خارج نہیں کرتا۔ اور نبی صلی اللہ علیہ وسلم نے نماز کی حالت میں یہ سب کچھ ہمیں اس لیے بتایا تاکہ ہمیں آگاہ کریں کہ ہماری نماز میں جو کچھ ہمارے معاملات، خرید و فروخت، لین دین، اور نمازی کے باطن میں اس کی نماز کی حالت میں تجلی (التجلی) پانے والے اکوان (کائناتوں) میں اس کے خواطر (خیالات) کا تصرف ہوتا ہے، وہ کیا ہے۔ اور عمر رضی اللہ عنہ نے اپنے بارے میں فرمایا کہ وہ اپنی نماز میں لشکر کو تیار کرتے تھے۔ پس نبی صلی اللہ علیہ وسلم کا ہمیں اپنی نماز میں مشاہدہ کی گئی چیزوں کے بارے میں بتانا اس بات کی دلیل ہے کہ یہ ہماری مشروع نماز میں کوئی نقص پیدا نہیں کرتا، جیسا کہ بعض عام فقہاء جو امور کا علم نہیں رکھتے، وہ اعتقاد رکھتے ہیں۔ اور بسا اوقات بعض صالحین یہ خیال کرتے ہیں کہ یہ سب نماز کو باطل کر دیتا ہے اور انسان کو حق کے ساتھ حضور (حضور) سے خارج کر دیتا ہے۔ معاملہ ایسا نہیں ہے، بلکہ جو کچھ نمازی اپنی نماز میں اکوان (الأکوان) کا مشاہدہ کرتا ہے وہ حق ہے، اور یہ نماز کا حصہ ہے اس شخص کے لیے جو نماز کے مقصد کو سمجھتا ہے۔ اور جس طرح اس کی آنکھ کا قبلہ میں موجود محسوسات کا مشاہدہ، جو اس کی بصارت کے لیے اپنے وجود اور ذوات کے ساتھ ظاہر ہوئے، اور ان عوالم اور ان کی حرکات نے اس کی نماز میں کوئی نقص پیدا نہیں کیا، اور یہ اسے نمازی ہونے سے خارج نہیں کرتا، اس پر کوئی اختلاف نہیں ہے، اور نمازی کے لیے اپنی آنکھیں بند کرنا مکروہ ہے، اسی طرح وہ چیزیں بھی جو اس کی بصیرت اور قلب کی آنکھ پر تجلی پاتی ہیں، جیسے خواطر (الخواطر) اور امور کی صورتیں جو اس کے باطن میں پیش آتی ہیں، اور وہ اللہ کی طرف سے ہوتی ہیں، اور اس کی بصیرت کی آنکھ اس کی حسی آنکھ کی طرح کھلی ہوتی ہے۔ پس ہر متمثل صورت جس کے ذریعے حق اس کے باطن میں تجلی فرماتا ہے، جیسا کہ وہ اس کے ظاہر میں محسوسات میں تجلی فرماتا ہے، تو اسے اپنی بصیرت اور قلب کی آنکھ سے ضرور ادراک کرنا چاہیے، جیسا کہ اس نے محسوسات کی صورتوں کو اپنی بصارت سے ادراک کیا۔ اور جس طرح یہ چیز اسے اس حد تک نمازی ہونے سے خارج نہیں کرتی جو اس کے لیے مشروع کی گئی ہے، اپنے چہرے کے ساتھ قبلہ کا استقبال کرنے کے باوجود، اسی طرح اس کے باطن میں اکوان کی صورتوں کا مشاہدہ بھی اسے اس حد تک نمازی ہونے سے خارج نہیں کرتا جو اس کے لیے مشروع کی گئی ہے، اپنے رب کا استقبال کرنے کے باوجود۔ اور یہ استقبال ہی وہ ہے جسے اس عبادت کے شروع میں مطلوبہ نیت (النیۃ) سے تعبیر کیا جاتا ہے۔ پس جو شخص امور کا علم نہیں رکھتا، وہ اسے نقص سمجھتا ہے۔ اگر کوئی شخص اس حدیث سے دلیل پکڑے جو آپ صلی اللہ علیہ وسلم نے وضو کے بعد پڑھی جانے والی دو رکعتوں کے بارے میں فرمائی کہ بندہ ان میں اپنے نفس سے کوئی بات نہ کرے، تو یہ دلیل نہیں ہے، اور اس نے یہ نہیں سمجھا کہ رسول اللہ صلی اللہ علیہ وسلم کا کیا ارادہ تھا، اور نہ ہی اس نے آپ صلی اللہ علیہ وسلم کے لفظ پر غور کیا کہ آپ نے اسے کس چیز سے مقید کیا ہے۔ کیونکہ آپ نے اسے اپنے نفس سے بات کرنے سے مقید کیا ہے۔ اور یہ صورتیں جن میں نمازی اپنے آپ کو دیکھتا ہے، وہ صرف اپنے قلب کی آنکھ سے ان کا مشاہدہ کرتا ہے، اور شارع نے صرف اس شخص کو مخاطب کیا ہے جو بات کرتا ہے نہ کہ اس شخص کو جو دیکھتا ہے، کیونکہ اس کی طاقت میں نہیں ہے کہ وہ اپنے قلب کی آنکھ کو ان صورتوں سے بند کر لے جن سے حق نے اس پر تجلی فرمائی ہے۔ پھر آپ نے اس کے اپنے نفس سے بات کرنے کو مقید کیا ہے۔ پس اگر وہ اپنے رب سے یا اس صورت سے بات کرے جو اس پر اس کی نماز میں تجلی پاتی ہے، تو یہ اس کی نماز میں نقص پیدا نہیں کرتا۔ اور رسول اللہ صلی اللہ علیہ وسلم اپنی نماز میں جب تلاوت میں استغفار کی آیت سے گزرتے تو استغفار کرتے، اور جب رغبت کی آیت سے گزرتے تو اللہ سے اس کے حصول کی دعا کرتے جس پر وہ دلالت کرتی تھی۔ اور ان میں سے کسی چیز نے بھی آپ کو نمازی ہونے سے خارج نہیں کیا، اور نہ ہی آپ کے لیے کوئی دوسری نیت پیدا ہوئی جو آپ کو نماز سے خارج کر دے، جیسا کہ آپ ظاہری طور پر اپنے قبلہ کی سمت کے علاوہ کسی دوسری سمت کی طرف نہیں مڑے۔ پس جب تک نمازی اپنے چہرے کے ساتھ قبلہ سے نہیں ہٹتا اور نماز سے نکلنے کی نیت نہیں کرتا، اس کی نماز صحیح اور مقبول ہے۔ یہ اللہ کا اپنے بندوں پر فضل اور ان پر رحمت ہے۔ اور ہر انسان حق کے اپنے بندوں سے خطاب اور ان سے اس کے ارادے کو نہیں جانتا۔ اور جہاں تک رسول اللہ صلی اللہ علیہ وسلم سے مروی اس حدیث کا تعلق ہے کہ نماز میں سے اس کا دسواں حصہ قبول ہوتا ہے، یہاں تک کہ وہ اس کے نصف تک پہنچ جاتا ہے، اس حد تک جو اس نے عقل سے ادا کی، تو یہ صحیح نہیں ہے، اور اگر یہ صحیح بھی ہوتا تو بھی اس میں کوئی نقص پیدا نہ کرتا جو ہم نے ذکر کیا ہے۔\n\n### [علم اجمال اور علم تفصیل]\n\nاور جان لو کہ یہ منزل ایک عظیم اور جلیل القدر منزل ہے، جسے نبی صلی اللہ علیہ وسلم کے ساتھ خاص نسبت حاصل ہے۔ اور جو کچھ ہم نے اس میں سے ذکر کیا ہے، وہ غور و فکر کرنے والے اور بصیرت رکھنے والے کے لیے کافی ہے۔ پس ہم ان علوم کا ذکر کرتے ہیں جو یہ منزل اپنے اندر رکھتی ہے، کیونکہ کتاب کے ابواب بہت زیادہ ہیں اور ان کی کثرت کے ساتھ کلام طویل ہو جائے گا، تو جو اسے حاصل کرنا چاہے گا اس کے لیے مشکل ہو جائے گا۔ پس جان لو کہ یہ علم اجمال (علم الإجمال) پر مشتمل ہے، اور کیا اللہ کے علم میں اجمال ہے یا وہ چیزوں کو صرف تفصیل (التفصيل) کے ساتھ جانتا ہے، حالانکہ وہ غیر متناہی ہیں؟ اور یہ علم تفصیل (علم التفصيل) پر مشتمل ہے، اور یہ اس علم پر مشتمل ہے جو اجمال اور تفصیل کے درمیان ہے، اور یہ ایک عجیب علم ہے جسے اللہ کے بارے میں جاننے والے علماء میں سے بہت کم لوگ جانتے ہیں، تو کثرت کا کیا حال ہو گا؟ اور اس میں دواوین (دفاتر) اور ان کی ترتیب کا علم ہے، اور اس میں اجرتوں اور ان کے مستحقین کا علم ہے، باوجود اس کے کہ وہ بندے ہیں، اور بندے کو اجیر (مزدور) کیوں کہا گیا؟ کیونکہ یہ اس بات کا اشارہ ہے کہ اس کا ایک نسبت ہے اس فعل کی نسبت سے جو اس سے صادر ہوتا ہے، تو اجارہ (اجرت) اس نسبت سے ہوتی ہے۔ اور اس میں اپنے آقا کی خدمت پر مدد طلب کرنا شامل ہے، اور کس جہت سے اس پر اجرت سے پہلے فرض عائد ہوا؟ حالانکہ اجیر پر فرض عائد نہیں ہوتا جب تک کہ وہ خود کو اجرت پر نہ دے۔ اور بندے پر اپنے آقا کی اطاعت فرض ہے۔ اور انسان یہاں حق (الحق) کے ساتھ دو حالتوں میں ہے: ایک حالت عبودیت (عبودية) کی اور ایک حالت اجارہ (اجارہ) کی۔ پس بندہ ہونے کی حیثیت سے وہ فرض کا مکلف ہے، جیسے فرض نماز، زکوٰۃ اور تمام فرائض، اور اسے اپنے فرض کی ادائیگی پر یکمشت کوئی اجرت نہیں ملتی، بلکہ اسے وہ نعمتیں ملتی ہیں جو اس کا آقا اس پر احسان کے طور پر کرتا ہے، جو اجرتوں سے افضل ہیں، نہ کہ اجرت کے طور پر۔ پھر اللہ تعالیٰ نے اسے ان امور میں اپنی عبادت کی طرف بلایا جو اس پر فرض نہیں ہیں، پس ان مستحب اعمال پر اجرتیں فرض کی گئیں، اگر بندہ ان کے ذریعے اپنے آقا کا قرب حاصل کرے تو وہ اسے ان پر اس کی اجرت دیتا ہے، اور اگر وہ قرب حاصل نہ کرے تو نہ اس کا مطالبہ کیا جاتا ہے اور نہ ہی اس پر ملامت کی جاتی ہے۔ پس یہاں سے بندے کا حکم اجارہ میں اجنبی کا حکم ہو گیا۔ پس فرض کے لیے وہ جزا ہے جو اس کے مقابل ہے، کیونکہ وہ اللہ اور اس کے بندوں کے درمیان عہد ہے۔ اور نوافل کے لیے اجرتیں ہیں، اور وہ اللہ تعالیٰ کا قول ہے: \"اور میرا بندہ نوافل کے ذریعے میرا قرب حاصل کرتا رہتا ہے یہاں تک کہ میں اس سے محبت کرنے لگتا ہوں، پس جب میں اس سے محبت کرتا ہوں تو میں اس کا کان اور اس کی آنکھ بن جاتا ہوں\" (حدیث قدسی)۔ پس نفل نے اس کے لیے محبت الٰہیہ (المحبة الإلهية) پیدا کی تاکہ حق اس کا کان اور اس کی آنکھ بن جائے، اور محبت الٰہیہ ہی ہے جس نے اسے حق سے اس مقام پر اتارا کہ حق اس کا کان اور اس کی آنکھ بن جائے۔ اور اس کی وجہ یہ ہے کہ نفل ادا کرنے والا اجیر کی طرح عبدِ اختیار (عبد اختيار) ہے۔ پس جب انسان یہ اختیار کرتا ہے کہ وہ اللہ کا بندہ بنے نہ کہ اپنی خواہش کا بندہ، تو اس نے اللہ کو اپنی خواہش پر ترجیح دی۔ اور وہ فرائض میں عبدِ اضطرار (عبد اضطرار) ہے نہ کہ عبدِ اختیار۔ پس وہ عبودیت اس پر اپنے آقا کی خدمت کو فرض کرتی ہے جو اس نے اس پر فرض کیا ہے۔ پس انسان کی عبودیت اضطراریہ اور اس کی عبودیت اختیاریہ کے درمیان وہی فرق ہے جو اجیر اور مملوک غلام کے درمیان ہے۔ پس اصلی غلام کا اپنے آقا پر کوئی حق نہیں سوائے اس کے جو ناگزیر ہے، وہ اپنے آقا سے کھاتا ہے، اپنے آقا سے پہنتا ہے، اور اپنے مقام کے واجبات کو پورا کرتا ہے، اور وہ رات دن اپنے آقا کے گھر میں رہتا ہے، وہ وہاں سے نہیں نکلتا مگر جب آقا اسے کسی کام کے لیے بھیجے۔ پس وہ دنیا میں اللہ کے ساتھ ہے، اور قیامت میں اللہ کے ساتھ ہے، اور جنت میں اللہ کے ساتھ ہے، کیونکہ یہ سب اس کے آقا کی ملکیت ہے، وہ اس میں مالکوں کی طرح تصرف کرتا ہے۔ اور اجیر کے لیے صرف وہی ہے جو اس کے لیے اجرت مقرر کی گئی ہے، جس میں اس کا خرچہ اور لباس شامل ہے، اور اسے اپنے آقا اور اجرت دینے والے کے حرم میں داخل ہونے یا اس کے اسرار پر مطلع ہونے یا اس کی ملکیت میں تصرف کرنے کا حق نہیں ہے، مگر صرف اس حد تک جس پر اسے اجرت دی گئی ہے۔ پس جب اس کی اجرت کی مدت ختم ہو جاتی ہے اور وہ اپنی اجرت لے لیتا ہے تو وہ اپنے اجرت دینے والے سے جدا ہو جاتا ہے اور اپنے اہل و عیال کے کام میں لگ جاتا ہے۔ اور اس پہلو سے اس کا کوئی حق یا نسبت نہیں ہے کہ وہ اپنے اجرت دینے والے سے مطالبہ کرے، سوائے اس کے کہ رب المال اس پر احسان کرے کہ اسے بلائے، اپنے پاس بٹھائے اور اسے خلعت پہنائے۔ پس یہ احسان کے باب سے ہے۔ اور آخرت کے گھر میں اس سے عبودیت اختیار (عبودية الاختيار) اٹھا لی گئی ہے۔ اگر تم نے غور کیا تو میں نے تمہیں ایک جلیل القدر مقام سے آگاہ کیا ہے جس سے تم جان سکتے ہو کہ انبیاء نے کس مقام سے کہا، باوجود اس کے کہ وہ مخلص بندے تھے، جن پر ان کی نفسانی خواہشات یا اللہ کی مخلوق میں سے کسی کا قبضہ نہیں تھا، اور اس کے باوجود انہوں نے کہا: \"میری اجرت تو صرف اللہ کے ذمہ ہے\" (إِنْ أَجْرِيَ إِلَّا عَلَى الله)۔ پس یہ معلوم ہوتا ہے کہ یہ ان کے اسماء الٰہیہ (الأسماء الإلهية) کے حکم کے تحت داخل ہونے کی طرف لوٹتا ہے۔ پس وہاں سے اجارہ واقع ہوا۔ پس وہ اضطرار اور حقیقت میں ذات (الذات) کے بندے ہیں، اور وہ اس کی ملکیت ہیں۔ اور اسماء الٰہیہ ان سے مطالبہ کرنے لگے تاکہ ان کے آثار ان میں ظاہر ہوں۔ پس انہیں اختیار ہے کہ وہ جس اسم الٰہی کے تحت چاہیں داخل ہوں۔ اور اسماء الٰہیہ نے یہ جان لیا، پس اسماء الٰہیہ نے ان کے لیے اجرتیں مقرر کر دیں۔ ہر اسم الٰہی اس عبد ذاتی (العبد الذاتي) سے مطالبہ کرتا ہے کہ وہ اپنی خدمت کے ذریعے اسے دوسرے اسماء الٰہیہ پر ترجیح دے، اور اسے کہتا ہے: \"میرے حکم کے تحت داخل ہو جاؤ اور میں تمہیں یہ اور یہ دوں گا۔\" پس وہ اس اسم کی خدمت میں رہتا ہے یہاں تک کہ آقا اسے عبودیت ذات (عبودية الذات) کی حیثیت سے پکارتا ہے، تو وہ ہر اسم الٰہی کو چھوڑ دیتا ہے اور اپنے آقا کی دعوت پر کھڑا ہو جاتا ہے۔ پس جب وہ وہ کام کر لیتا ہے جس کا اسے حکم دیا گیا تھا، تب وہ جس اسم کی طرف چاہے واپس چلا جاتا ہے۔ اور اسی وجہ سے انسان نفل ادا کرتا ہے اور جو چاہے عبادت کرتا ہے یہاں تک کہ فرض نماز کی اقامت سنتا ہے، تو اس پر ہر نفل حرام ہو جاتا ہے اور وہ اپنے آقا اور مالک کے فرض کی ادائیگی کی طرف لپکتا ہے۔ پس جب وہ فارغ ہو جاتا ہے تو جس نفل میں چاہے داخل ہو جاتا ہے۔ پس اس مسئلے میں اس کی مثال اس غلام کی سی ہے جس کے آقا کے بہت سے بیٹے ہوں۔ پس وہ اپنے آقا کے ساتھ عبودیت اضطرار کے حکم سے ہے، جب اس کا آقا اسے حکم دیتا ہے تو وہ اس کے حکم کے علاوہ کسی اور کام میں مشغول نہیں ہوتا۔ اور جب وہ اس کی ادائیگی سے فارغ ہو جاتا ہے تو اس کے آقا کے بیٹے اس سے مطالبہ کرتے ہیں کہ وہ انہیں مسخر کرے۔ پس ان کے لیے ضروری ہے کہ وہ اسے اس چیز کا تعین کریں جو اسے ان کی خدمت میں رغبت دلائے، اور ہر بیٹا چاہتا ہے کہ وہ اسے اپنے آقا کے کام سے فراغت کے وقت اپنی خدمت کے لیے لے لے، پس وہ اس کی اجرت میں مقابلہ کرتے ہیں تاکہ اسے اپنے لیے مخصوص کر لیں۔ پس اسے اختیار ہے کہ وہ اس وقت کس بیٹے کی خدمت کرے۔ پس انسان عبد ہے، اور آقا اللہ ہے، اور بیٹے باقی اسماء الٰہیہ ہیں۔ پس جب یہ بندہ کسی پریشان حال کو دیکھتا ہے اور اس کی مدد کرتا ہے، تو وہ جانتا ہے کہ وہ اسم المغیث (المغيث) کی تسخیر کے تحت ہے، پس اسے مغیث کی طرف سے وہ اجرت ملتی ہے جو اس کے لیے اس میں مقرر کی گئی ہے۔ اور جب وہ کسی کو اپنے نفس میں کمزور دیکھتا ہے اور اس سے نرمی کرتا ہے، تو وہ اسم اللطیف (اللطيف) کی تسخیر کے تحت ہوتا ہے۔ اور اسی طرح باقی اسماء کا معاملہ ہے۔ پس اے ولی (الولي)، تحقیق کرو کہ تم اپنے رب اور آقا کی خدمت کیسے کرتے ہو، اور اپنے نفس اور اپنے آقا کے بارے میں صحیح علم پر رہو، تاکہ تم علم میں راسخ علماء اور الٰہی حکماء میں سے ہو جاؤ، اور رسولوں اور انبیاء کے ساتھ اعلیٰ ترین درجے اور بلند مقام کو حاصل کرو۔ اور یہ منزل تمام اسماء الٰہیہ کے ساتھ تخلق (تخلق) کے علم پر بھی مشتمل ہے، اور میرا مطلب \"تمام\" سے وہ ہے جس کا علم ہم تک پہنچا ہے۔ اور تمییز (امتیاز) کا علم، اور بندہ اسے کہاں حاصل کرتا ہے، اور اس کے اور اس تک پہنچنے کے درمیان کے وقت کا اندازہ۔ اور اللہ اور اس کے بندوں کے درمیان الٰہی تفاضل (التفاضل الإلهي) کا علم، جیسے اس کا قول: \"بہترین خالق\" (أَحْسَنُ الْخالِقِينَ) اور \"سب سے زیادہ رحم کرنے والا\" (أَرْحَمُ الرَّاحِمِينَ)۔ وہ کون سا پہلو ہے جس نے انہیں جمع کیا یہاں تک کہ حق اس پہلو میں اکمل تھا؟ اور اللہ اور اس کی مخلوق کے درمیان کوئی تفاضل نہیں ہے، کیونکہ آقا وہ ہے جس سے مقابلہ نہیں کیا جاتا اور نہ ہی تفاضل کیا جاتا، اور سب اس کے بندے ہیں۔ اور آقا اور اس کے بندے کے درمیان، اس حیثیت سے کہ وہ بندہ ہے، کوئی تفاضل نہیں، بلکہ آقا کے لیے تمام فضل ہے۔ اور تصدیق کرنے والوں کے مراتب کا علم، اور جھٹلانے والوں کے مراتب کا علم، کفر اور شرک والوں کے مراتب سے۔ اور تمنا کا علم کہ وہ کس اسم الٰہی کا طالب ہے۔ اور ان صفات کا علم جنہیں آقا بندے سے ناپسند کرتا ہے، اور بندے کے لیے وہ کون سا سبب ہے جو اسے اس چیز میں داخل ہونے پر مجبور کرتا ہے جسے اس کا آقا ناپسند کرتا ہے؟ کیا یہ اس حقیقت کی وجہ سے ہے جس پر وہ قائم ہے اور وہ اس کا تقاضا کرتی ہے، یا وہ خاص طور پر قضا و قدر (القضاء والقدر) کی طرف لوٹتا ہے؟ اور قلوب (القلوب) کا علم، اور علامات کا علم، اور اصرار (ضد) کا علم اور اس کا تعلق کس چیز سے ہے۔ اور ہم نے اسے اپنی کتاب *ایجاز البیان فی الترجمۃ عن القرآن* میں سورۃ آل عمران میں اللہ تعالیٰ کے قول: \"اور انہوں نے اپنے کیے پر اصرار نہیں کیا\" (وَلَمْ يُصِرُّوا عَلى‏ ما فَعَلُوا) کی تفسیر میں بیان کیا ہے، پس اسے وہاں دیکھو۔ اور دنیاوی اور اخروی جزا کا علم۔ اور ہم نے اسے اپنی تفسیر میں سورۃ فاتحہ میں اللہ تعالیٰ کے قول: \"روز جزا کا مالک\" (مالِكِ يَوْمِ الدِّينِ) میں بیان کیا ہے۔ اور تقویٰ (التقوى) کا علم، اور فرقان (الفرقان) کا علم، اور قرآن (القرآن) کا علم، اور سختیوں اور ہولناکیوں کا علم، اور وہ کس طرف لوٹتی ہیں۔ اور دجال کے ایام کا ایک سال، ایک مہینہ، ایک جمعہ اور اس کے باقی ایام کا معمول کے دنوں کی طرح ہونا، کیا یہ اچانک شدت کی طرف لوٹتا ہے؟ کیونکہ بڑے یا چھوٹے بچے کی فکر جب تک انسان کے ساتھ رہتی ہے اور وہ اسے اپنائے رکھتا ہے، تو جو کچھ وہ محسوس کرتا ہے وہ اس پر آسان ہو جاتا ہے، یہاں تک کہ جسے مار کی سزا دی جاتی ہے، وہ اسے صرف پہلی ضرب لگنے پر تھوڑی مقدار میں محسوس کرتا ہے، پھر جب مار کی جگہ سن ہو جاتی ہے تو وہ اسے محسوس نہیں کرتا۔ اور بدبختوں کے لیے حق کے ساتھ انفرادیت (الانفراد بالحق) کا علم، اس کا کیا فائدہ ہے اور وہ کس طرف لوٹتا ہے؟ اور مکر، دھوکہ، کید اور استدراج کا علم، اور ان مراتب اور ان کے حاملین کے درمیان فرق۔ اور صبر (الصبر) کا علم، اور صبر نہ کرنے والے کی سزا کا علم، اور کب وہ صابر ہوتا ہے۔ اور عنایت (العناية) کا علم، اور اجتباء (چن لینے) کا علم، اور صالحین کی منازل کا علم، اور یہ ایک عجیب اور شریف علم ہے، میں نے عارفین میں سے کسی کو نہیں دیکھا جو اسے جانتا ہو سوائے انبیاء کے خاص طور پر۔ پس تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں اس کی معرفت سے نوازا۔ اور ہم نے یہ صرف اس وجہ سے دیکھا کہ اللہ نے ہم پر اپنے رسولوں علیہم السلام اور ان کی نازل کردہ شرائع کے مکمل احترام کے ذریعے احسان فرمایا۔ اور صلاح (الصلاح) کا علم ان کے ساتھ خاص ہے، پس اللہ نے مجھے اس کا پھل چننے کی توفیق دی۔ پس میں نے تمہیں علم صلاح تک پہنچنے والے راستے سے آگاہ کر دیا، جس کے راستے کو لوگوں نے نظر انداز کر دیا اور اسے چوتھے طبقے میں رکھ دیا، اور راستے کو سیدھی لکیر سمجھ لیا، حالانکہ حق کا راستہ ایسا نہیں ہے، بلکہ وہ استداره (دائرہ) کی طرح سیدھا ہے۔ کیونکہ لوگوں نے اشیاء میں استقامت (سیدھا پن) کے معنی کو نہیں جانا کہ وہ کیا ہے۔ پس دائرہ کی استقامت یہ ہے کہ وہ ایک صحیح دائرہ ہو، اس طرح کہ نقطہ سے محیط کی طرف نکلنے والی ہر لکیر اپنے ساتھی اور باقی تمام لکیروں کے برابر ہو۔ جیسا کہ مربع اور مثلث کی شکل میں استقامت یہ ہے کہ وہ زاویوں کی برابری کے ساتھ برابر اضلاع والا ہو۔ جیسا کہ متساوی الساقین مثلث کی شکل میں استقامت یہ ہے کہ اس کے دونوں ساق برابر ہوں۔ پس ہر وہ چیز جو اس سے باہر نہ نکلے جس کے لیے اسے وضع کیا گیا ہے، وہی اس کی استقامت ہے۔ اور عین (العین) کا علم، اور معجزہ، کرامت اور سحر کے درمیان فرق کا علم۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب سیصد و شانزدهم در معرفت منزل صفات پابرجا که با قلم الهی (القلم الإلهي) در لوح محفوظ انسانی (اللوح المحفوظ الإنساني) نقش بسته‌اند، از حضرت اجمالی موسوی و محمدی، و این دو از والاترین حضرات هستند.\n\nراز دوات و قلم،\nعلم حدوث (پدید آمدن) و قدم (ازلی بودن) است.\n\nو آن مخصوص کسی است که\nندا داده شد: «ای بنده من، پس پیش آی.»\n\nبه محضر کسی که ذاتش،\nدر آنجا قدمت (پیشینگی) داشت.\n\nو از سخن آنان به او این بود که:\n«در مرتبه علم، قدمت داری.»\n\nو شتابان آمد، سواره\nو پیاده بر قدم.\n\nو با آنان آمیخته بود،\nآمیختگی گوشت با خون.\n\nو هستی را ملحق ساخت، هنگامی که\nحق (الحق) نیستی را به او شهود داد.\n\nپس راز او در هستی‌اش،\nمانند اوست هنگامی که نیست شد.\n\nو در زمان خود،\nصاحب قدم‌هایی نبود که نکوهیده شوند.\n\nپس شرط هر توبه‌کننده‌ای،\nعزم درست و پشیمانی است.\n\nهنگامی که به محضر او آمد،\nبا فروتنی و خدمت آمد.\n\nو هنگامی که او را دید،\nچشمی بر عرش (العرش)، استوار شد.\n\nپس آن چشم به او بخشش کرد،\nزیرا او از جمله خادمان بود.\n\nو هنگامی که از\nآن مقام خارج می‌شود، خدمت می‌کند.\n\n### [اسرای رسول خدا با جسمش]\n\nبدان، خداوند تو را تأیید کند، ای ولیّ صمیمی و برگزیده گرامی، خداوند بصیرت تو را نورانی گرداند، که چون اخلاق رسول خدا (صلی الله علیه و سلم) قرآن بود و به اسماء الهی متخلق شده بود، و خداوند سبحان در کتاب عزیزش ذکر کرده است که او تعالی بر عرش استوا (اسْتَوى‏ عَلَى الْعَرْشِ) نمود، از باب مدح و ثنا بر خویشتن، زیرا عرش (العرش) بزرگترین اجسام است؛ پس برای پیامبرش (صلی الله علیه و سلم) از این استوا، نسبتی قرار داد به طریق مدح و ثنا بر او، چرا که این بالاترین مقامی بود که هر رسولی که به معراج برده شده بود، به آن می‌رسید. و این دلالت می‌کند که اسراء (معراج) او (صلی الله علیه و سلم) با جسمش بوده است. اگر اسراء رؤیا بود، نه اسراء و نه رسیدن به این مقام، مدح و ستایشی محسوب نمی‌شد، و هیچ انکاری از سوی اعراب در حق او واقع نمی‌گشت؛ زیرا انسان در رؤیا به مرتبه رؤیت خداوند تعالی می‌رسد که شریف‌ترین حالات است، و رؤیا آن جایگاه را در نفوس ندارد، چرا که هر انسانی، بلکه هر حیوانی، قوه رؤیا دارد. پس او (صلی الله علیه و سلم) از باب مدح، درباره خود فرمود، به دلیل آوردن حرف غایت (حتی)، و ذکر کرد که به معراج برده شد تا جایی که بر مستوایی ظاهر شد که در آن صدای قلم‌ها را می‌شنید. و این همان قول خداوند تعالی است: «تا برخی از آیات خود را به او نشان دهیم. همانا او شنوا و بیناست.» (لِنُرِيَهُ من آياتِنا إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ). ضمیر در «همانا او» (أنه هو) به محمد (صلی الله علیه و سلم) بازمی‌گردد. زیرا او به معراج برده شد و آیات را دید و صدای قلم‌ها را شنید. پس او آیات را می‌دید و از آن‌ها آنچه را که سهم شنیدن بود، یعنی صدا، می‌شنید. زیرا با واژه صریف (صدا) از آن تعبیر شده است. صریف همان صداست. نابغه می‌گوید:\n\nله صريف صريف القعو بالمسد\n(او را صریفی است، صریف دلو با طناب.)\n\nپس دلالت کرد بر اینکه برای او از ملکوت، نیرویی باقی ماند که با جسمش به آن نرسید، از آن حیث که بیننده بود، بلکه از آن حیث که شنونده بود. پس به شنیدن صدای قلم‌ها رسید، در حالی که آن‌ها احکامی را که خداوند در عالم پدید می‌آورد، جاری می‌ساختند. مرتبه این قلم‌ها پایین‌تر از مرتبه قلم اعلی (القلم الأعلى) و پایین‌تر از لوح محفوظ (اللوح المحفوظ) است. زیرا آنچه قلم اعلی نوشته است، تغییر نمی‌کند، و لوح به دلیل محفوظ بودن از محو، لوح محفوظ نامیده شده است، پس آنچه در آن نوشته شده، پاک نمی‌شود. اما این قلم‌ها در الواح محو و اثبات می‌نویسند، و این همان قول خداوند تعالی است: «خداوند آنچه را بخواهد محو می‌کند و آنچه را بخواهد ثابت می‌دارد.» (يَمْحُوا الله ما يَشاءُ ويُثْبِتُ). و از این الواح است که شرایع، صحیفه‌ها و کتاب‌ها بر رسولان (صلوات الله علیهم و سلامه) نازل می‌شود. به همین دلیل است که نسخ (لغو شدن حکم) در شرایع وارد می‌شود، و در یک شریعت واحد، نسخ در حکم وارد می‌شود، که عبارت است از پایان یافتن مدت حکم، نه بر اساس بداء (تغییر رأی الهی)، زیرا این امر بر خداوند محال است. و تا همین حد بود که پیامبر (صلی الله علیه و سلم) در مورد نمازهای پنجاه‌گانه بین موسی و پروردگارش در تردد بود، و این حد، منتهای او بود. پس خداوند آنچه را از آن نمازها که در این الواح نوشته شده بود، برای امت محمد (صلی الله علیه و سلم) محو کرد تا اینکه این پنج نماز را تثبیت نمود و برای نمازگزار آن، پاداش پنجاه نماز را ثابت کرد و به او وحی نمود که «سخن نزد من تبدیل نمی‌شود» (لا يبدل القول لديه). پس از آن، دیگر در مورد این امر نزد موسی بازنگشت. و از همین کتابت است: «سپس اجلی را مقرر داشت و اجلی معین نزد اوست.» (ثُمَّ قَضى‏ أَجَلًا وأَجَلٌ مُسَمًّى). و از همین الواح است که خداوند سبحان خود را وصف می‌کند به اینکه در قبض روح مؤمن به مرگ، در نفس خود تردد می‌کند، در حالی که آن را بر او مقدر کرده است. و از این حقیقت الهی که با «تردد الهی» از آن کنایه شده است، جریان آن در تردد کیهانی در امور و حیرت در آن‌ها حاصل می‌شود. و این زمانی است که انسان در انجام کاری در نفس خود تردد می‌یابد که آیا آن را انجام دهد یا نه، و پیوسته بر آن حال می‌ماند تا اینکه یکی از اموری که در آن تردد داشته، واقع شود و آن امر واحد رخ دهد و تردد از بین برود. پس آن امر واقع شده، همان است که در لوح از میان آن امور متردد، ثابت شده بود. و این بدان سبب است که قلم کاتب در لوح محو، امری را می‌نویسد، و آن زمانِ خاطری است که انجام آن کار به ذهن بنده خطور می‌کند. سپس آن نوشته محو می‌شود و خداوند آن را پاک می‌کند، و آن خاطر از آن شخص زایل می‌گردد، زیرا دیگر رقیقه (لطیفه‌ای) از این لوح به نفس آن شخص در عالم غیب امتداد نمی‌یابد. زیرا رقایق (لطایف) به سوی نفوس از این الواح، با حدوث کتابت پدید می‌آیند و با محو شدن آن قطع می‌شوند. پس هنگامی که قلم جایگاه آن را در لوح محو شده ببیند، چیز دیگری را می‌نویسد که مربوط به آن امر است، از فعل یا ترک. پس از آن نوشته، رقیقه‌ای به نفس آن شخص که این برای او نوشته شده، امتداد می‌یابد، و آن خاطر که نقیض اولی است، به ذهن این شخص خطور می‌کند. اگر حق (الحق) اراده تثبیت آن را داشته باشد، آن را محو نمی‌کند. پس اگر ثابت شد، رقیقه‌ای متصل به قلب این شخص باقی می‌ماند و تثبیت می‌شود، و آن شخص آن کار را انجام می‌دهد یا آن را ترک می‌کند، بر حسب آنچه در لوح ثابت شده است. پس هنگامی که آن را انجام داد یا بر ترک آن ثابت ماند و فعلش پایان یافت، حق (الحق) آن را از حکم فعل محو می‌کند و آن را به صورت عمل نیک یا بد، به اندازه‌ای که هست، تثبیت می‌نماید. سپس قلم امر دیگری را می‌نویسد، و امر همیشه این‌گونه است. و این قلم‌ها، این مرتبه آن‌هاست. و موکل به محو، فرشته‌ای گرامی نزد خداوند تعالی است که بر اساس آنچه حق تعالی به او امر می‌کند، محو می‌نماید. و املای بر آن فرشته و قلم‌ها، از صفت الهی است که در وحی نازل شده بر رسولش، با «تردد» از آن کنایه شده است. و اگر این حقیقت الهی نبود، دو امر در عالم با هم اختلاف نمی‌کردند و هیچ کس در امری متحیر نمی‌شد و در آن تردد نمی‌یافت، و همه امور حتمی و مقدر بودند. همان‌طور که این ترددی که مردم در نفوس خود می‌یابند، وجودش در آن‌ها حتمی و مقدر است، زیرا عالم با حقایق محفوظ شده است. و تعداد این قلم‌ها که شب و روز بر اساس حکم کتابت آن‌ها جاری می‌شود، سیصد و شصت قلم است، به تعداد درجات فلک. پس هر قلمی از جانب خداوند علم خاصی دارد که برای دیگری نیست. و از آن قلم، علم به درجه معینی از درجات فلک نازل می‌شود. پس هنگامی که در آن درجه، آنچه از ستارگانی که با سیر خود از هشت فلک آن را قطع می‌کنند، نازل شود، به اندازه نیروی روحانی آن ستاره، از آن درجه از علم که توسط آن قلم سپرده شده، برمی‌گیرد. پس فلک خود را با آن به حرکت درمی‌آورد و اثر به ارکان (عناصر) می‌رسد. پس ارکان به حسب استعداد خود، آن اثر را می‌پذیرند. سپس آن اثر از ارکان در موالید (موجودات متولد شده) جریان می‌یابد و در آن‌ها آنچه را خداوند بخواهد، بر حسب آنچه از افزایش و کاهش در جسم آن مولود یا در قوای آن، در روحش، در علم و جهلش، فراموشی و غفلتش، حضور و تذکرش و بیداری‌اش پذیرفته است، پدید می‌آید. همه این‌ها به تقدیر خدای عزیز و داناست. و روزها با حرکت فلک بزرگ پدید می‌آیند، و شب و روز در روز، به حکم حرکت بزرگ روزانه بر حرکت فلک خورشید معین می‌شود، زیرا خورشید تحت احاطه آن است. و زمین را کثیف قرار داد تا انوار خورشید در آن نفوذ نکند، به دلیل وجود شب که سایه زمین است. و به همین دلیل است که روز در مکان‌هایی بزرگ و در مکان‌هایی کوچک می‌شود، و همچنین شب بزرگ و کوچک می‌شود. و به واسطه آن، افزایش شب و روز نزد ما رخ می‌دهد. و با این شب و روز موجود در مناطق مسکونی زمین، روزهای افلاک و روزهای پروردگار شمرده می‌شود. و هر روزی که ذکر شده، همان قول خداوند تعالی است: «و همانا یک روز نزد پروردگار تو، مانند هزار سال است از آنچه شما می‌شمارید.» (إِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ) یعنی از روزهای معلوم ما. و ما قطعاً می‌دانیم که مکان‌هایی که در آن‌ها روز شش ماه و شب نیز شش ماه است، آن یک روز واحد در حق آن موضع است. پس روز آن موضع، سیصد و شصت روز از آنچه ما می‌شماریم، می‌باشد. پس من تو را از جایگاه این قلم‌ها که رسول خدا (صلی الله علیه و سلم) صدای کتابت آن‌ها را شنید، از علم الهی و اینکه چه کسی به آن‌ها مدد می‌رساند، و به کدام حقیقت الهی مستند هستند، و اثر آن‌ها در عالم علوی از فرشتگان، ستارگان و افلاک، و اثر آن‌ها در عناصر و موالید، آگاه ساختم. و این کشفی (الکشف) شگفت‌انگیز است که اسرار غریبی از احکام این قلم‌ها را در بر می‌گیرد که تمام تأثیرات در عالم همیشه به واسطه آن‌هاست، و ناگزیرند که پراکندگی ستارگان، انحلال این اجرام فلکی، و خرابی این سرای دنیوی، و انتقال آبادانی در حق سعادتمندان به بهشت‌های برین که سطح آن فلک هشتم است، و جهنم به اسفل سافلین که سرای بدبختان است، را بنویسند و ثابت کنند. و ما این را در این کتاب در باب بهشت و باب آتش ذکر کرده‌ایم. اما قلم اعلی (القلم الأعلى)، هر آنچه را که از محو و اثبات از این قلم‌ها جاری می‌شود، در لوح محفوظ (اللوح المحفوظ) ثبت کرده است. پس در لوح محفوظ، تثبیت محو در این الواح، و تثبیت اثبات، و محو اثبات هنگام وقوع حکم و ایجاد امر دیگر، وجود دارد. پس آن لوحی است که از محو مقدس است. و آن همان است که قلم الهی با اختلاف امور و عواقب آن‌ها، به تفصیل و مسطور، به تقدیر خدای عزیز و دانا، به آن مدد می‌رساند. و برای قلوب اولیاء از طریق کشف الهی حقیقی (الکشف الإلهي الحقيقي) در تمثیل این قلم‌ها، کشف صحیحی وجود دارد، همان‌طور که بهشت برای رسول خدا (صلی الله علیه و سلم) در عرض دیوار تمثیل شد. و ما گفتیم که آن ممثل، با وجود ممثل بودن، حقیقت است، به دلیل قول رسول خدا (صلی الله علیه و سلم): «آیا مرا دیدید هنگامی که پیش رفتم و خواستم خوشه‌ای از آن بچینم؟ اگر آن را بیرون می‌آوردم، تا دنیا باقی بود از آن می‌خوردید.» و هنگامی که آتش برای او تمثیل شد، از قبله خود عقب رفت تا مبادا شعله آن به او برسد، و در آن ابن لُحَی و صاحب مِحْجَن و صاحب گربه را دید. و این در نماز کسوف خورشید بود. و پیامبر (صلی الله علیه و سلم) فرمود: «همانا خداوند در قبله نمازگزار است.» و او بهشت و آتش را در قبله خود دید، همان‌طور که دیوار در قبله اوست.\n\n### [اینکه خداوند تعالی اسمایی دارد که مختص بهشت و اهل آن است]\n\nو بدان که خداوند تعالی اسمایی دارد که مختص بهشت و اهل آن است، و اسمایی دارد که مختص آتش و اهل آن است. و نمازگزار از حیث اسماء خداوند، نه از حیث ذات او، با حق (الحق) مناجات می‌کند، زیرا ذات او از حد و مقدار و تقیید برتر است. پس با آنچه تو را بدان آگاه ساختم، بدان که رسول خدا (صلی الله علیه و سلم) پیوسته حق (الحق) در قبله و در نمازش با او مناجات می‌کرد، و مشاهده بهشت‌ها و آتش و کسانی که در آن‌ها هستند، و حرکت او به جلو و عقب، او را از نمازگزار بودن، چه در ظاهر و چه در باطن، خارج نساخت. و پیامبر (صلی الله علیه و سلم) همه این‌ها را در حال نماز به ما خبر داد تا ما را آگاه سازد به آنچه در نمازمان از مشاهده امورمان، مانند خرید و فروش و گرفتن و دادن، و تصرف خواطر نمازگزار در اکوان (عوالم) که در باطن او در حال نماز تجلی می‌یابند، به ذهنمان خطور می‌کند. و عمر درباره خود گفت که او در حال نماز، لشکر را تجهیز می‌کرد. پس خبر پیامبر (صلی الله علیه و سلم) به ما درباره آنچه در نمازش مشاهده کرد، این است که آن مشاهدات به نماز مشروع ما لطمه‌ای نمی‌زند، برخلاف اعتقاد برخی از فقهای عامی که به امور آگاهی ندارند، و شاید برخی از صالحان نیز تصور کنند که همه این‌ها نماز را باطل می‌کند و انسان را از حضور با حق (الحق) خارج می‌سازد. امر چنین نیست، بلکه هر آنچه نمازگزار در نمازش از اکوان مشاهده می‌کند، حق است و برای کسی که مراد از نماز را بفهمد، جزئی از نماز است. و همان‌طور که آنچه چشم او از محسوسات در قبله‌اش می‌بیند، که با وجود و ذات خود از عوالم و حرکاتشان بر بصیرت او ظاهر شده‌اند، به نمازش لطمه‌ای نمی‌زند و او را از نمازگزار بودن خارج نمی‌کند، و در این اختلافی نیست، و مکروه است که نمازگزار چشمان خود را در نماز ببندد؛ همچنین آنچه برای چشم بصیرت و قلب او تجلی می‌یابد، مانند خواطر و صور اموری که در باطن او عارض می‌شوند و از جانب خداوند هستند، و چشم بصیرت او مانند چشم حسّی‌اش باز است. پس هر صورت ممثلی که حق (الحق) با آن در باطن او تجلی کند، همان‌طور که در محسوسات در ظاهرش تجلی کرده است، ناگزیر باید آن را با چشم بصیرت و قلب خود درک کند، همان‌طور که صور محسوسات را با بصر خود درک کرد. و همان‌طور که آن مشاهدات او را از نمازگزار بودن بر اساس آنچه برایش تشریع شده، با استقبال قبله با صورتش، خارج نساخت؛ همچنین آنچه در باطن خود از صور اکوان مشاهده کرده، او را از نمازگزار بودن بر اساس آنچه برایش تشریع شده، با استقبال پروردگارش، خارج نمی‌کند. و آن استقبال همان است که با نیت (النیة) مطلوب از او هنگام شروع در آن عبادت، تعبیر می‌شود. پس کسی که به امور آگاهی ندارد، این امر نزد او لطمه‌زننده به نماز است. اگر کسی به قول پیامبر (صلی الله علیه و سلم) در مورد دو رکعتی که بنده پس از وضو می‌خواند و در آن با نفس خود سخن نمی‌گوید، استدلال کند، این حجت نیست. زیرا او نفهمیده است که رسول خدا (صلی الله علیه و سلم) چه اراده کرده و در لفظ خود دقت نکرده است که پیامبر (صلی الله علیه و سلم) آن را به چه چیزی مقید کرده است. او آن را به «سخن گفتن با نفس خود» مقید کرده است. و این صورتی که نمازگزار خود را در آن می‌بیند، تنها با چشم قلبش مشاهده می‌کند. و شارع (قانون‌گذار) تنها متعرض کسی شده که سخن می‌گوید، نه کسی که می‌بیند، زیرا در توان او نیست که چشم قلبش را از صورتی که حق (الحق) با آن بر او تجلی کرده، ببندد. سپس سخن گفتن را به «با نفس خود» مقید کرده است. پس اگر با پروردگارش یا با صورتی که در نمازش بر او تجلی کرده، سخن بگوید، این به نمازش لطمه‌ای نمی‌زند. و رسول خدا (صلی الله علیه و سلم) در نمازش، هنگامی که در تلاوتش به آیه استغفار می‌رسید، استغفار می‌کرد، و به آیه رغبت، از خداوند درخواست می‌کرد که به آنچه آن آیه دلالت دارد، دست یابد. و هیچ یک از این‌ها او را از نمازگزار بودن خارج نساخت و نیت دیگری که او را از نمازش خارج کند، برایش پدید نیامد، همان‌طور که در ظاهرش به جهتی غیر از جهت قبله‌اش روی نگرداند. پس تا زمانی که نمازگزار با صورتش از قبله‌اش روی نگردانده و نیت خروج از نمازش را نکرده باشد، نمازش صحیح و مقبول است. این از فضل خداوند بر بندگانش و رحمت او به آن‌هاست. و هر انسانی از خطاب حق (الحق) به بندگانش و آنچه از آن‌ها اراده کرده، آگاه نیست. و اما حدیث روایت شده از رسول خدا (صلی الله علیه و سلم) درباره اینکه از نماز، یک‌دهم آن تا نصف آن، تا آنچه از آن فهمیده شده، پذیرفته می‌شود، صحیح نیست، و اگر هم صحیح بود، به آنچه ما ذکر کردیم، لطمه‌ای نمی‌زد.\n\n### [علم اجمال و علم تفصیل]\n\nو بدان که این منزل، منزلی عظیم و جلیل‌القدر است و اختصاص بزرگی به پیامبر (صلی الله علیه و سلم) دارد. و این مقداری که از آن ذکر کردیم، برای کسی که نظر کند و بصیرت یابد، کفایت می‌کند. پس علوم موجود در آن را ذکر می‌کنیم، زیرا ابواب کتاب بسیار است و سخن در آن‌ها با کثرتشان به درازا می‌کشد و تحصیل آن برای طالب دشوار می‌شود. پس بدان که این منزل شامل علم اجمال (علم الإجمال) است، و اینکه آیا در علم خداوند اجمالی وجود دارد یا اشیاء را جز به تفصیل نمی‌داند، در حالی که آن‌ها نامتناهی هستند. و شامل علم تفصیل (علم التفصيل) است، و شامل علمی است که بین اجمال و تفصیل قرار دارد، و آن علم غریبی است که جز اندکی از عالمان به خدا آن را نمی‌شناسند، پس چگونه کثیران آن را بشناسند؟ و در آن علم دیوان‌ها و ترتیب آن‌هاست. و در آن علم پاداش‌ها (الأجور) و مستحقین آن‌هاست، با وجود اینکه بنده هستند. و چرا بنده، اجیر نامیده شده است؟ زیرا این مشعر بر آن است که او نسبتی به نسبت فعلی که از او صادر می‌شود به سوی او دارد. پس اجاره از آن نسبت حاصل می‌شود. و از آن جمله، طلب یاری بر خدمت مولای خود است. و از کدام جهت، تکلیف (فرض) بر او ابتدا قبل از اجرت معین شده است؟ در حالی که بر اجیر تکلیف نمی‌شود مگر تا زمانی که خود را اجاره دهد. و بر بنده، اطاعت مولای خود فرض شده است. و انسان در اینجا با حق (الحق) بر دو حال است: حالت عبودیت و حالت اجاره. از حیث بنده بودن، مکلف به فرض است، مانند نماز واجب، زکات و تمام فرایض، و در انجام فرض خود، به طور کلی اجری ندارد، بلکه برای او نعمتی است که مولایش بر او منت می‌گذارد و آن بهتر از اجرت‌هاست، نه از باب اجرت. سپس خداوند تعالی او را به عبادت خود در اموری که بر او فرض نیست، ترغیب کرده است. پس بر آن اعمال مستحب، اجرت‌ها فرض شده است. اگر بنده با آن‌ها به مولای خود تقرب جوید، اجرت آن را به او می‌دهد، و اگر تقرب نجوید، آن را از او نمی‌خواهند و مورد عتاب قرار نمی‌گیرد. از این رو، حکم بنده در اجاره، حکم بیگانه است. پس برای فرض، جزایی است که مقابل آن قرار می‌گیرد، زیرا آن عهدی است که بین خدا و بندگانش است. و برای نوافل، اجرت‌هاست، و آن قول خداوند تعالی است: «و بنده پیوسته با نوافل به من تقرب می‌جوید تا او را دوست بدارم، پس چون او را دوست بدارم، گوش و چشم او می‌شوم.» (ولا يزال العبد يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت له سمعا وبصرا) [حدیث قدسی] پس نافله، محبت الهی را برای او به ارمغان آورد تا حق (الحق) گوش و چشم او باشد. و محبت الهی است که او را از حق (الحق) به منزلتی رسانده که حق (الحق) گوش و چشم او باشد. و علت آن این است که متنفّل (انجام‌دهنده نافله)، بنده اختیار است، مانند اجیر. پس اگر انسان اختیار کند که بنده خدا باشد نه بنده هوای نفس خود، خدا را بر هوای نفس خود ترجیح داده است. در حالی که در فرایض، بنده اضطرار است نه بنده اختیار. پس آن عبودیت، خدمت مولایش را در آنچه بر او فرض کرده، واجب ساخته است. پس بین انسان در عبودیت اضطراری‌اش و عبودیت اختیاری‌اش، همان تفاوتی است که بین اجیر و بنده مملوک وجود دارد. بنده اصلی بر مولای خود استحقاقی ندارد جز آنچه ناگزیر است: از مولای خود می‌خورد و از مولای خود می‌پوشد و به واجبات مقام خود عمل می‌کند. پس شب و روز در خانه مولای خود است و جز زمانی که او را به کاری بفرستد، خارج نمی‌شود. پس او در دنیا با خداست، در قیامت با خداست و در بهشت با خداست، زیرا همه این‌ها ملک مولای اوست و او در آن‌ها تصرف مالکان را دارد. اما اجیر، جز آنچه برای او از اجرت معین شده، چیزی ندارد، که شامل نفقه و پوشاک اوست، و حق ورود به حریم مولا و اجاره‌دهنده خود را ندارد، و نه اطلاع بر اسرار او، و نه تصرف در ملک او، مگر به اندازه‌ای که برای آن اجیر شده است. پس هنگامی که مدت اجاره‌اش به پایان رسید و اجرت خود را گرفت، از اجاره‌دهنده خود جدا می‌شود و به کار خود مشغول می‌شود. و از این جهت، حقیقتی و نسبتی ندارد که از کسی که او را اجیر کرده، چیزی طلب کند، مگر اینکه صاحب مال بر او منت گذارد و کسی را به دنبال او بفرستد و با او همنشین شود و به او خلعت دهد. و این از باب منت است. و در سرای آخرت، عبودیت اختیار از او برداشته شده است. اگر متوجه شدی، تو را به مقام والایی آگاه ساختم که از آن می‌فهمی پیامبران از چه مقامی گفتند، با وجود اینکه بندگان مخلص او بودند و هوای نفسشان و هیچ یک از خلق خدا مالک آن‌ها نبود، و با این حال گفتند: «پاداش من جز بر عهده خدا نیست.» (إِنْ أَجْرِيَ إِلَّا عَلَى الله). پس دانسته می‌شود که این امر به داخل شدن آن‌ها تحت حکم اسماء الهیه بازمی‌گردد. پس از آنجا اجاره واقع شده است. آن‌ها در اضطرار و حقیقت، بندگان ذات هستند و مالک آن هستند، و اسماء الهی آن‌ها را برای ظهور آثارشان در آن‌ها طلب کردند. پس آن‌ها اختیار دارند که تحت هر اسم الهی که بخواهند، وارد شوند. و اسماء الهی این را دانستند، پس اسماء الهی اجرت‌ها را برای آن‌ها معین کردند. هر اسم الهی از این بنده ذاتی می‌خواهد که او را بر دیگر اسماء الهی با خدمتش ترجیح دهد و به او می‌گوید: «تحت امر من درآی و من به تو فلان و فلان می‌دهم.» پس او پیوسته در خدمت آن اسم است تا اینکه مولا از حیث عبودیت ذات، او را ندا دهد. پس او هر اسم الهی را ترک می‌کند و به دعوت مولای خود پاسخ می‌دهد. پس هنگامی که آنچه را مولایش به او امر کرده، انجام داد، آنگاه به هر اسمی که بخواهد بازمی‌گردد. و به همین دلیل است که انسان نافله می‌خواند و به هر عبادتی که بخواهد می‌پردازد تا اینکه اقامه نماز واجب را بشنود، پس هر نافله‌ای بر او حرام می‌شود و به سوی ادای فرض مولا و مالک خود می‌شتابد. پس هنگامی که فارغ شد، وارد هر نافله‌ای که بخواهد می‌شود. او در این مسئله، مانند بنده یک مولاست که فرزندان زیادی دارد. او با مولای خود به حکم عبودیت اضطرار است؛ اگر مولایش به او امر کند، به غیر امر او مشغول نمی‌شود. و هنگامی که از ادای آن فارغ شد، فرزندان مولایش از او می‌خواهند که او را به کار گیرند. پس ناگزیر باید آنچه را که او را به خدمتشان ترغیب می‌کند، برای او معین کنند. و هر فرزندی دوست دارد که او را برای خدمت خود در وقت فراغت از کار مولایش بگیرد. پس در اجرت او با هم رقابت می‌کنند تا او را برای خود خالص کنند. پس او مختار است که در آن وقت، با کدام فرزند خدمت کند. پس انسان همان بنده است و مولا همان خداست و فرزندان، سایر اسماء الهی هستند. پس اگر این بنده، درمانده‌ای را دید و به او کمک کرد، می‌داند که تحت تسخیر اسم «المغیث» (فریادرس) است، پس از «المغیث» همان اجری را که برای او در آن معین شده، خواهد داشت. و اگر ضعیفی را در نفس خود دید و با او مهربانی کرد، تحت تسخیر اسم «اللطیف» (مهربان) بود. و همچنین سایر اسماء. پس ای ولیّ، دریاب که چگونه پروردگار و مولای خود را خدمت می‌کنی، و بر علم صحیح در مورد خود و مولای خود باش تا از عالمان راسخ در علم و حکیمان الهی باشی و به درجه قصوی و جایگاه والا با رسولان و پیامبران دست یابی. و این منزل همچنین شامل علم تخلق به همه اسماء الهی است، و منظورم از «همه»، آنهایی است که علم آن‌ها به ما رسیده است. و علم تمییز (تشخیص) و اینکه بنده چه زمانی به آن می‌رسد و تخمین زمانی که بین او و رسیدن به آن است. و علم تفاضل الهی بین خدا و بندگانش، مانند قول او: «بهترین آفرینندگان» (أَحْسَنُ الْخالِقِينَ) و «مهربان‌ترین مهربانان» (أَرْحَمُ الرَّاحِمِينَ). وجهی که آن‌ها را جمع کرده چیست تا حق (الحق) در آن وجه کامل‌تر باشد؟ و هیچ تفاضلی بین خدا و خلقش نیست، زیرا مولا کسی است که با او رقابت نمی‌شود و تفاضل داده نمی‌شود، و همه بندگان او هستند. و تفاضلی بین مولا و بنده او از حیث بنده بودن نیست، بلکه فضل تماماً از آن مولاست. و علم مراتب اهل تصدیق و اهل تکذیب از مراتب اهل کفر و شرک و غیره. و علم تمنی (آرزو) که کدام اسم الهی آن را می‌طلبد. و علم صفاتی که مولا از بنده ناپسند می‌دارد، و سبب موجب برای بنده چیست که وارد آنچه مولایش ناپسند می‌دارد، می‌شود؟ آیا از حقیقتی است که او بر آن است و آن را می‌طلبد، یا صرفاً به قضا و قدر بازمی‌گردد؟ و علم قلوب، و علم علامات، و علم اصرار (پافشاری) و آنچه به آن مربوط است. و ما آن را در کتاب *ایجاز البیان فی الترجمة عن القرآن* در قول خداوند تعالی در آل عمران بیان کرده‌ایم: «و بر آنچه انجام داده‌اند اصرار نورزند.» (ولَمْ يُصِرُّوا عَلى‏ ما فَعَلُوا) پس آن را در آنجا ببین. و علم جزای دنیوی و اخروی. و ما آن را در تفسیر خود در فاتحة الکتاب در قول خداوند تعالی: «مالک روز جزا» (مالِكِ يَوْمِ الدِّينِ) بیان کرده‌ایم. و علم تقوا، و علم فرقان، و علم قرآن، و علم شدائد و اهوال، و اینکه چرا بازمی‌گردند. و اینکه روزهای دجال، از سال و ماه و هفته و سایر روزهایش مانند روزهای معمول است، آیا این به شدت غافلگیری بازمی‌گردد؟ زیرا اندوه به خاطر فرزند بزرگ یا کوچک، هر چه بیشتر دوام یابد و انسان آن را همراه داشته باشد، آنچه می‌یابد بر او آسان می‌شود، تا جایی که کسی که با ضربه مجازات می‌شود، آن را حس نمی‌کند مگر در ابتدای وقوع آن به مقدار کمی، سپس محل ضربه بی‌حس می‌شود و آن را حس نمی‌کند. و علم انفراد به حق (الحق) برای اهل شقاوت، فایده‌اش چیست و چرا بازمی‌گردد؟ و علم مکر، خدعه، کید و استدراج، و فرق بین این مراتب و صاحبان آن‌ها. و علم صبر، و علم عقوبت کسی که صبر نمی‌کند، و اینکه چه زمانی صابر است. و علم عنایت، و علم اجتباء (برگزیدن). و علم منازل صالحین، و آن علم غریب و شریفی است که من هیچ یک از عارفان را ندیدم که آن را بشناسد، مگر انبیاء به طور خاص. پس سپاس خدایی را که با معرفت آن بر ما منت نهاد. و ما این را ندیدیم مگر به واسطه منت خداوند بر ما با احترام کامل به رسولانش (علیهم السلام) و شرایع نازل شده‌اش. و علم صلاح که مختص آن‌هاست. پس خداوند مرا قادر ساخت تا میوه آن را بچینم. پس من تو را به راهی که به علم صلاح می‌رساند، آگاه ساختم، علمی که مردم راه آن را غفلت کردند و آن را در طبقه چهارم قرار دادند و راه را مستقیم گرفتند، در حالی که راه حق (الحق) چنین نیست، بلکه استقامت آن دایره‌ای است. زیرا قوم معنای استقامت در اشیاء را ندانستند که چیست. پس استقامت دایره‌ای آن است که دایره‌ای صحیح باشد به طوری که هر خطی که از نقطه به محیط آن خارج می‌شود، با خطوط دیگر مساوی باشد. همان‌طور که استقامت در شکل مربع و مثلث، مساوی بودن اضلاع با مساوی بودن زوایاست. و همان‌طور که استقامت در شکل مثلث متساوی‌الساقین، مساوی بودن دو ساق آن است. پس هر چیزی که از آنچه برای آن وضع شده خارج نشود، استقامت آن است. و علم عین (العین) و علم فرق بین معجزه و کرامت و سحر. و خداوند حق (الحق) می‌گوید و او راه را هدایت می‌کند. (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 6
}