{
  "id": 432,
  "title": {
    "ar": "الباب الثاني والثلاثون وأربعمائة في معرفة منازلة ما ارتديت بشي‏ء إلا بك فاعرف قدرك وذا عجب شي‏ء لا يعرف نفسه",
    "en": "Chapter Four Hundred and Thirty-Two: Concerning the Gnosis (معرفة) of the Spiritual Station (منازلة): \"I was not adorned with anything save through You, so know your rank.\" And this is a marvel: a thing that does not know itself.",
    "ur": "باب چار سو بتیس: اس منزل کی معرفت (المعرفۃ) کے بیان میں کہ میں نے تیرے سوا کسی شے کو نہیں اوڑھا، پس اپنی قدر کو پہچان۔ اور یہ ایک عجیب شے ہے جو خود کو نہیں پہچانتی۔",
    "fa": "باب چهارصد و سی و دوم در معرفت منزلتی که به هیچ چیز جز تو آراسته نشدم، پس قدر خود را بشناس، و این شگفتی چیزی است که خود را نمی‌شناسد"
  },
  "content": {
    "ar": "## «الباب الثاني والثلاثون وأربعمائة في معرفة منازلة ما ارتديت بشي‏ء إلا بك فاعرف قدرك وذا عجب شي‏ء لا يعرف نفسه»\n\n\n> إن الرداء الذي لم يدر لابسه *** هو الرداء الذي الرحمن لابسه‏\n\n\n> به تزين عند العالمين من الأرواح *** والملأ القلبي حارسه‏\n\n\n> فإن بدت منه أخلاق تحيد به *** عن الهدى فرسول الله سائسه‏\n\n\n### [إن العبد هو كبرياء الحق وعظمته‏]\n\n\nقال الله تعالى من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله وقال إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله وقال تعالى في الخبر عنه وسعني قلب عبدي المؤمن‏\n\n\nفالأمر حق ظاهره صورة خلق فهو من وراء ما بدا كما إن المرتدي من وراء ردائه فالعبد هو كبرياء الحق وعظمته فإنه‏\n\n\nقال الكبرياء ردائي‏\n\n\nولهذا كان المخلوق محل عظمة الله لأن العظمة صفة في المعظم لا في المعظم ولو كانت في المعظم لما تعوذ منه من لا يعرفه قال الله لأبي يزيد لما خلع عليه أسماءه أخرج إلى عبادي بصورتي فمن رآك رآني فلما خطا خطوة غشى عليه فقال ردوا على حبيبي فإنه لا صبر له عني فمن عرف نفسه عرف الله ومن عرف الله لم يعرف نفسه والعلم بالله تعالى جهلك بك والعلم بك علمك بالله فإنك منه كما قال جَمِيعاً مِنْهُ ما هو منك وليس إلا معرفة المنزلة والقدر إِنَّا أَنْزَلْناهُ في لَيْلَةِ الْقَدْرِ نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ فأنت ليلة القدر لأنك من طبيعة وحق فشهد لك بعظم القدر قبل نزول القرآن عليك وأنت خير من ألف شهر أي خير من الكل لأنه منتهى العدد البسيط الذي يقع فيه التركيب إلى ما لا يتناهى كذلك ما يخلق الله لا يتناهى دائما فإنه خالق على الدوام وجاء بالشهر لشهرة ذلك في كل شهر من الألف ليلة القدر لا بد من ذلك فإن خير الشهور ما كان فيه ليلة القدر فهي خير من ألف شهر فيه ليلة القدر فهي جامعة لكل أمر فهي العامة في جميع الموجودات فالعبد في هذه المنازلة حافظ محفوظ حافظ من حيث إنه يحفظ المرتدي به غيرة وصونا ومحفوظ من حيث إن المرتدي يحتاط عليه لئلا يضيع فإنه معرض للضياع فإنه مخلوق فلا بد له من حافظ هذا جزاء دوري فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Thirty-Two: Concerning the Knowledge of the Station of \"I was not Clothed in Anything Except by You,\" so Know Your Worth. And this is Strange: A Thing That Does Not Know Itself.\n\nIndeed, the Robe whose wearer is unknown,\nIt is the Robe that the All-Merciful wears.\n\nBy it, He is adorned among the worlds of spirits,\nAnd the assembly of the heart (الملأ القلبي) guards it.\n\nIf qualities appear from it that turn it away\nFrom guidance, then the Messenger of Allah is its guide.\n\n### [Indeed, the Servant is the Grandeur and Magnificence of the Real]\n\nAllah the Exalted said: <<Whoever obeys the Messenger has obeyed Allah>>. And He said: <<Indeed, those who pledge allegiance to you are only pledging allegiance to Allah>>. And the Exalted said in the report concerning Him: \"My believing servant's heart encompasses Me.\"\n\nThus, the matter is the Real (الحق), whose outward appearance is the form of creation (صورة خلق). So He is behind what has appeared, just as the wearer is behind his robe. Therefore, the servant (العبد) is the Grandeur (كبرياء) and Magnificence (عظمة) of the Real (الحق). For He said: \"Grandeur is My Robe.\"\n\nFor this reason, the created being (المخلوق) is the locus (محل) of Allah’s Magnificence, because Magnificence is an attribute (صفة) in the one who is magnified, not in the one who magnifies. And if it were in the one who magnifies, then the one who does not know Him would not seek refuge from it.\n\nAllah said to Abu Yazid (al-Bistami) when He bestowed His Names upon him: \"Go out to My servants in My form. Whoever sees you sees Me.\" When he took one step, he fainted. So He said, \"Bring My beloved back to Me, for he has no patience to be separated from Me.\"\n\nThus, whoever knows himself knows Allah. And whoever knows Allah does not know himself. The Knowledge (العلم) of Allah the Exalted is your ignorance of yourself, and the knowledge of yourself is your knowledge of Allah. For you are from Him, as He said: <<All of it is from Him>>. It is not from you. And it is nothing but the knowledge of the station (المنزلة) and the worth (القدر).\n\n<<Indeed, We sent it down during the Night of Worth (Laylat al-Qadr)>>. <<The Trustworthy Spirit (الروح الأمين) descended with it upon your heart>>. So you are the Night of Worth (ليلة القدر), because you are of the nature of the Real (الحق). Thus, He bore witness to your great worth (عظم القدر) before the Qur'an descended upon you. And you are better than a thousand months—meaning, better than the totality—because it is the limit of the simple number upon which composition occurs, extending to the infinite. Likewise, what Allah creates is perpetually infinite, for He is the Creator continuously. The month (شهر) was mentioned due to the fame of that (Night of Worth) in every month of the thousand. The Night of Worth (ليلة القدر) is necessary for that. For the best of months is that which contains the Night of Worth. So it is better than a thousand months in which the Night of Worth occurs. Thus, it is comprehensive of every matter; it is the universal principle (العامة) in all existing things (الموجودات).\n\nThe servant (العبد) in this station (منازلة) is a guardian (حافظ) and guarded (محفوظ). A guardian inasmuch as he preserves the One who wears him (المرتدي به) out of protective zeal and safeguarding. And guarded inasmuch as the Wearer (المرتدي) takes precautions concerning him lest he be lost. For he is exposed to loss, since he is created (مخلوق), he must necessarily have a guardian. This is a cyclical recompense (جزاء دوري), so understand! <<And Allah speaks the Truth, and He guides to the Way>>.",
    "ur": "باب نمبر ۴۳۲: اس منزلت کی معرفت میں کہ میں نے آپ کے سوا کسی چیز کو بطور ردا (چادر) نہیں اوڑھا، پس اپنی قدر پہچان، اور یہ ایک عجیب بات ہے کہ کوئی شے خود کو نہ پہچانے۔\n\nبے شک وہ ردا جسے اوڑھنے والا نہیں جانتا، وہی ردا ہے جسے رحمن (الرحمن) اوڑھتا ہے۔\n\nاسی کے ذریعے وہ ارواح کے عالمین کے نزدیک مزین ہوتا ہے، اور ملأ قلبی (باطنی مجلس) اس کی نگہبان ہے۔\n\nپس اگر اس سے ایسے اخلاق ظاہر ہوں جو اسے ہدایت سے ہٹا دیں، تو رسول اللہ ﷺ اس کے نگہبان (سائس) ہیں۔\n\n[بے شک بندہ ہی کبریاء الحق (ذات حق کی کبریائی) اور عظمتہ (اس کی عظمت) ہے]\n\nاللہ تعالیٰ نے فرمایا:\n> مَن يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله\n> (جس نے رسول کی اطاعت کی، اس نے درحقیقت اللہ کی اطاعت کی)\n\nاور فرمایا:\n> إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله\n> (بے شک جو لوگ آپ سے بیعت کرتے ہیں، وہ درحقیقت اللہ سے بیعت کرتے ہیں)\n\nاور اللہ تعالیٰ نے اس (بندے) کے بارے میں خبر دیتے ہوئے فرمایا:\n> وسعني قلب عبدي المؤمن\n> (میرے مومن بندے کا دل میری وسعت رکھتا ہے)\n\nپس یہ امر (حقیقت) حق (الحق) ہے جس کا ظاہر خلق (مخلوق) کی صورت ہے۔ لہٰذا وہ اس کے پیچھے ہے جو ظاہر ہوا، جیسا کہ ردا اوڑھنے والا اپنی ردا کے پیچھے ہوتا ہے۔ پس بندہ ہی کبریاء الحق (ذات حق کی کبریائی) اور عظمتہ (اس کی عظمت) ہے۔ کیونکہ اس (اللہ) نے فرمایا:\n> الكبرياء ردائي\n> (کبریائی میری ردا ہے)\n\nاسی لیے مخلوق اللہ کی عظمت کا محل (جائے ظہور) ہے، کیونکہ عظمت (العظمة) اس شخص میں ایک صفت ہے جو عظمت بیان کرتا ہے (المعظم)، نہ کہ اس ذات میں جس کی عظمت بیان کی جاتی ہے (المعظم)۔ اگر یہ (عظمت) اس ذات میں ہوتی جس کی عظمت بیان کی جاتی ہے، تو جو اسے نہیں جانتا وہ اس سے پناہ نہ مانگتا۔ اللہ نے ابو یزید (بسطامی) سے فرمایا جب اس نے اس پر اپنے اسماء (صفات) کا خلعہ پہنایا: \"میری صورت میں میرے بندوں کی طرف نکل جا، پس جس نے تجھے دیکھا اس نے مجھے دیکھا۔\" جب اس نے ایک قدم اٹھایا تو وہ بے ہوش ہو گیا، پس اللہ نے فرمایا: \"میرے حبیب کو مجھ پر واپس لاؤ، کیونکہ اسے مجھ سے دور رہنے کا صبر نہیں ہے۔\" پس جس نے اپنے نفس کو پہچانا اس نے اللہ کو پہچانا، اور جس نے اللہ کو پہچانا اس نے اپنے نفس کو نہ پہچانا۔ اور اللہ تعالیٰ کی معرفت (المعرفۃ) یہ ہے کہ تم اپنے آپ سے جاہل ہو جاؤ، اور تمہاری معرفت یہ ہے کہ تم اللہ کو جان لو۔ کیونکہ تم اسی سے ہو، جیسا کہ اس نے فرمایا:\n> جَمِيعاً مِنْهُ\n> (سب کچھ اسی کی طرف سے ہے)\n\nجو کچھ تمہاری طرف سے نہیں ہے، اور یہ صرف منزلت (المنزلۃ) اور قدر (القدر) کی معرفت (المعرفۃ) ہے۔\n> إِنَّا أَنْزَلْناهُ في لَيْلَةِ الْقَدْرِ\n> (بے شک ہم نے اسے شب قدر میں نازل کیا)\n> نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ\n> (اسے روح الامین نے آپ کے قلب پر نازل کیا)\n\nپس تم ہی شب قدر ہو، کیونکہ تم طبیعت اور حق (الحق) سے ہو۔ پس اس نے قرآن کے تم پر نازل ہونے سے پہلے ہی تمہاری عظیم قدر (القدر) کی گواہی دی۔ اور تم ہزار مہینوں سے بہتر ہو، یعنی تم سب سے بہتر ہو، کیونکہ یہ (ہزار) سادہ عدد کی انتہا ہے جس میں ترکیب واقع ہوتی ہے اور جو لامتناہی تک پہنچتی ہے۔ اسی طرح جو کچھ اللہ خلق کرتا ہے وہ ہمیشہ لامتناہی ہوتا ہے، کیونکہ وہ ہمیشہ خالق ہے۔ اور وہ مہینے (الشہر) کو لایا تاکہ اس (شب قدر) کی شہرت ہزار کے ہر مہینے میں ہو، یہ ضروری ہے۔ پس بہترین مہینے وہ ہیں جن میں شب قدر ہو، اور وہ ہزار مہینوں سے بہتر ہے جن میں شب قدر ہو۔ پس وہ ہر امر کی جامع ہے، لہٰذا وہ تمام موجودات (الموجودات) میں عام ہے۔\n\nپس بندہ اس منزلت (المنازلۃ) میں حافظ (حفاظت کرنے والا) بھی ہے اور محفوظ (حفاظت کیا گیا) بھی ہے۔ حافظ اس لحاظ سے کہ وہ غیرت اور حفاظت کی بنا پر اس (ذات حق) کی حفاظت کرتا ہے جس نے اسے اوڑھا ہے۔ اور محفوظ اس لحاظ سے کہ اوڑھنے والا (ذات حق) اس پر احتیاط برتتا ہے تاکہ وہ ضائع نہ ہو جائے، کیونکہ وہ ضائع ہونے کے خطرے میں ہے، اس لیے کہ وہ مخلوق ہے، لہٰذا اس کے لیے ایک حافظ (حفاظت کرنے والا) ہونا ضروری ہے۔ یہ ایک دورانی (چکر دار) جزا ہے، پس سمجھو۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راہ دکھاتا ہے۔",
    "fa": "باب چهارصد و سی و دوم در معرفت منزلت [اینکه] به چیزی جز تو ردا نپوشیدم، پس قدر خود را بشناس، و این شگفتیِ چیزی است که خود را نمی‌شناسد.\n\nهمانا ردایی که پوشنده‌اش آن را درک نکرد،\nهمان ردایی است که رحمان آن را پوشیده است.\n\nبا آن، در نزد عالمیان از ارواح، زینت می‌یابد،\nو ملأ قلبی (الملأ القلبي) نگهبان آن است.\n\nپس اگر از او اخلاقی آشکار شود که او را\nاز هدایت منحرف سازد، رسول خدا (ص) سیاستمدار و مدبر اوست.\n\n### [همانا بنده، کبریا و عظمت حق است]\n\nخداوند متعال فرمود: «مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله» (هر کس از پیامبر اطاعت کند، قطعاً از خدا اطاعت کرده است). و فرمود: «إِنَّ الَّذِينَ يُبايِعُونَكَ إِنَّما يُبايِعُونَ الله» (همانا کسانی که با تو بیعت می‌کنند، در حقیقت با خدا بیعت می‌کنند). و در خبر قدسی درباره خود فرمود: «وسعني قلب عبدي المؤمن» (قلب بنده مؤمنم مرا در خود جای داد).\n\nپس امر، حق (الحق) است که ظاهرش صورت خلق است. بنابراین، او (حق) ورای آن چیزی است که آشکار شده، همان‌گونه که رداپوش (المرتدي) ورای ردای خود است. پس بنده، کبریا و عظمت حق (الحق) است، زیرا او [حق] فرمود:\n\nفرمود: «الکبریاء ردائي» (کبریا ردای من است).\n\nو به همین دلیل، مخلوق محل عظمت خداست؛ زیرا عظمت صفتی است در کسی که تعظیم می‌شود (المعظم)، نه در کسی که تعظیم می‌کند (المعظم). و اگر عظمت در تعظیم‌کننده بود، کسی که آن را نمی‌شناسد، از آن پناه نمی‌برد. خداوند به ابویزید (بسطامی) هنگامی که اسماء خود را بر او پوشاند، فرمود: «به سوی بندگانم با صورت من خارج شو، پس هر کس تو را ببیند، مرا دیده است.» هنگامی که ابویزید قدمی برداشت، بیهوش شد. پس [خداوند] فرمود: «محبوبم را به من بازگردانید، زیرا او تاب دوری از مرا ندارد.»\n\nپس هر کس خود را شناخت، خدا را شناخت، و هر کس خدا را شناخت، خود را نشناخت. و علم به خداوند متعال، جهل تو به خودت است؛ و علم به تو، علم تو به خداست. زیرا تو از اویی، چنانکه فرمود: «جَمِيعاً مِنْهُ» (همه از اوست). آنچه از توست، نیست مگر معرفت منزلت و قدر.\n\n«إِنَّا أَنْزَلْناهُ في لَيْلَةِ الْقَدْرِ» (ما آن را در شب قدر نازل کردیم). «نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ» (روح‌الامین آن را بر قلب تو نازل کرد). پس تو لیلة القدر (شب قدر) هستی، زیرا تو از طبیعت و حق (الحق) هستی. پس [حق] برای تو به عظمت قدر شهادت داد، پیش از آنکه قرآن بر تو نازل شود. و تو بهتر از هزار ماه هستی، یعنی بهتر از کل هستی، زیرا تو منتهای عدد بسیطی هستی که ترکیب در آن تا بی‌نهایت واقع می‌شود.\n\nهمچنین، آنچه خداوند خلق می‌کند، پیوسته پایان نمی‌پذیرد، زیرا او دائماً خالق است. و ماه (الشهر) را به دلیل شهرت آن در هر ماه از آن هزار [ماه] آورد. لیلة القدر (شب قدر) ناگزیر از این است، زیرا بهترین ماه‌ها ماهی است که لیلة القدر در آن باشد. پس آن (لیلة القدر) بهتر از هزار ماهی است که لیلة القدر در آن است. پس آن جامع هر امر است و در تمامی موجودات عمومیت دارد.\n\nپس بنده در این منزلت، حافظ و محفوظ است. حافظ است از آن جهت که رداپوش (المرتدي) را به دلیل غیرت و صیانت حفظ می‌کند، و محفوظ است از آن جهت که رداپوش بر او احتیاط می‌کند تا ضایع نشود، زیرا او در معرض ضایع شدن است، چرا که مخلوق است و ناگزیر به حافظ نیاز دارد. این یک جزای دورانی است، پس بفهم. و «الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 1
}