{
  "id": 146,
  "title": {
    "ar": "الباب السادس والأربعون ومائة في معرفة مقام الفتوة وأسراره",
    "en": "Chapter One Hundred and Forty-Six: Concerning the Gnosis (معرفة) of the Spiritual Station (مقام) of *Futuwwa* and its Mysteries.",
    "ur": "باب ایک سو چھیالیسواں: مقام فتوہ (الفتوة) کی معرفت اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و چهل و ششم در معرفت مقام فتوّت (الفتوة) و اسرار آن."
  },
  "content": {
    "ar": "## (الباب السادس والأربعون ومائة في معرفة مقام الفتوة وأسراره)\n\n\nاعلم أيدك الله‏\n\n\n> أن الفتوة ما ينفك صاحبها *** مقدما عند رب الناس والناس‏\n\n\n> إن الفتى من له الإيثار تحلية *** فحيث كان فمحمول على الرأس‏\n\n\n> ما أن تزلزله الأهواء بقوتها *** لكونه ثابتا كالشامخ الراسي‏\n\n\n> لا حزن يحكمه لا خوف يشغله *** عن المكارم حال الحرب والبأس‏\n\n\n> انظر إلى كسره الأصنام منفردا *** بلا معين فذاك اللين القاسي‏\n\n\n### [الفتوة نعت إلهي من طريق المعنى لا من طريق اللفظ]\n\n\nالفتوة نعت إلهي من طريق المعنى وليس له سبحانه من لفظها اسم إلهي يسمى به كما ثبت شرعا ودليل عقل أنه له الغني عن العالم على الإطلاق فبالشرع قوله تعالى فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ ودليل العقل لو لم يكن وجوده واجبا لنفسه مع اتصافه بالوجود لكان ممكنا لأنه متصف بالوجود ولو كان ممكنا لافتقر إلى المرجح في وجوده فلم يكن يصح له اسم الغني‏\nعلى الإطلاق ولو افتقر بنوع ما فليس بغني مطلق ولكان من جملة العالم فيكون علامة تدل على مرجحه فهو غني على الإطلاق ومن له هذا الغني ثم أوجد العالم فما أوجده لافتقاره إليه وإنما أوجد العالم للعالم إيثارا له على انفراده بالوجود وهذا هو عين الفتوة\n\n\n### [صورة الفتوة في خلق الله العالم‏]\n\n\nومن الفتوة الإلهية الخبران القرآني والنبوي فأما القرآن فقوله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ وصورة الفتوة هنا إنه خلقهم لينعمهم بالوجود ويخرجهم من شر العدم ويمكنهم من التخلق بالأسماء الإلهية ويجعل منهم خلفا وهذا كله إيثار لهم على انفراده بكل ما استخلفهم فيه ثم علم إن الامتنان يقدح في النعمة عند المنعم عليه فستر ذلك إيثارا لهم بقوله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فأظهر أنه خلقهم من أجله لا من أجلهم‏\n\n\n### [خلق الأشياء من أجل الإنسان وخلق الإنسان من أجل الرحمن‏]\n\n\nوفي الخبر النبوي الموسوي أنه تعالى خلق الأشياء من أجلنا وخلقنا من أجله‏\n\n\nوستر بهذا قوله وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ليفهم الجميع بإعلامه أنهم يسبحون بحمده حتى لا نشم فيه رائحة الامتنان ففي الخبر الموسوي حكم الفتوة أنه خلق الأشياء من أجلنا إيثارا لنا على انفراده بالوجود كما خلقنا وقوله وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ غطاء حتى لا يشم فيه رائحة المنة مثل قوله في حقنا إِلَّا لِيَعْبُدُونِ سواء\n\n\n### [اثبات الأعيان الثابتة التي ذهبت إليها المعتزلة]\n\n\nوأما الخبر النبوي الثاني من الخبرين فما\n\n\nروى عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عن الله سبحانه أنه قال كنت كنزا لم أعرف فأحببت إن أعرف فخلقت الخلق وتعرفت إليهم فعرفوني‏\n\n\nففي قوله كنت كنزا إثبات الأعيان الثابتة التي ذهبت إليها المعتزلة وهي قوله إِنَّما قَوْلُنا لِشَيْ‏ءٍ\n\n\n### [المحبة لا تتعلق إلا بمعدوم‏]\n\n\nفهذا الخبر من الفتوة كيف كنى عن نفسه أنه أحب أن يعرف ومن هذه صفته غطى على ما يجب له من الغني المطلق لأن المحبة لا تتعلق إلا بمعدوم وقد يكون ذلك المعدوم في معدوم أو في موجود فإن كان في معدوم فلا بد أيضا من وجوده حتى يظهر فيه ما أحب إيجاده وإن كان في موجود فأظهر فيه ما أحببته فلا بد أن يكون ما ذكره سترا على الغني المطلق وإيثار الجناب هذا المحبوب حيث تعلق به من له الغني فيورثه عزة في نفسه حيث كان مقصودا لمن له صفة الغني‏\n\n\n### [سبب الوجود هو ظهور الكمال الوجودي والعلمي‏]\n\n\nوكان سبب الوجود إن الوجود والعلم طلبا بالحال من الله كمال مرتبتهما في التقسيم العقلي فأوجدهما منة لظهور الكمال الوجودي والعلمي هذا أصله منة منه فأعرض عن هذا ونسب وجود العالم لمحبته أن يعرف حتى لا يشم منه كمال الوجود والعلم رائحة المنة أيضا كما ذكر في القرآن سواء وإذا كان الحق قد نزل مع عباده في مكارم الأخلاق التي هي الفتوة إلى هذا الحد فالعبد أولى بهذه الصفة أن يتخلق بها\n\n\n### [الفتوة إظهار المنن والآلاء وستر العطاء والاستعلاء]\n\n\nفالفتوة على الحقيقة إظهار الآلاء والمنن وستر المنة والامتنان كما قال لا تُبْطِلُوا صَدَقاتِكُمْ بِالْمَنِّ والْأَذى‏ تخلقا إلهيا فإنه سبحانه تصدق علينا بالوجود والمعرفة به وما من علينا بذلك وأما قوله بَلِ الله يَمُنُّ عَلَيْكُمْ معناه أنه لو من لكان المن لله لما منوا عليه صَلَّى اللهُ عَليهِ وسَلَّم بالإسلام قال الله تعالى يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا قال الله لمحمد صَلَّى اللهُ عَليهِ وسَلَّم قُلْ لا تَمُنُّوا عَلَيَّ إِسْلامَكُمْ ثم آثر محمدا صَلَّى اللهُ عَليهِ وسَلَّم على نفسه سبحانه حتى لا يجعل له نعتا فيما أجرى عليه لسان ذم فقال له قل لهم بَلِ الله يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ لِلْإِيمانِ ولو شاء لقال بل أنا أمن عليكم إن هداكم الله بي للإيمان الذي رزقكم بتوحيده وأسعدكم به فما جعله تعالى محلا للمن هذا من الفتوة الإلهية التي لا يشعر بها\n\n\n### [حكم الفتوة موجود في الحق وإطلاقها عليه لم يرد في الشرع‏]\n\n\nفحكمها موجود في الحق وإطلاقها لم يرد لا في كتاب ولا سنة كما يعلم قطعا أنه لا فرق بين قولنا علمت الشي‏ء وعرفته وأنا عالم بالشي‏ء أو عارف ومع هذا ورد إطلاق اسم العالم والعليم والعلام عليه تعالى وما ورد إطلاق الاسم العارف عليه فما يلزم من الأمر الذي لله\n\n\nمنه حكم أن يطلق عليه منه اسم فأسماؤه من حيث إطلاقها عليه موقوفة على ورودها منه فلا يسمى إلا بما سمي به نفسه وإن علم فيه مدلول ذلك الاسم فالتوقيف في الإطلاق أولى‏\n\n\n### [الفتوة والشطح‏]\n\n\nوما فعل هذا سبحانه كله إلا ليعلم الخلق الأدب معه إذا وقد علم إن من أهل الله من له شطحات ليتأدبوا فلا يشطحوا فإن الشطح نقص بالإنسان لأنه يلحق نفسه فيه بالرتبة الإلهية ويخرج عن حقيقته فيلحقه الشطح بالجهل بالله وبنفسه وقد وقع من الأكابر ولا أسميهم لأنه صفة نقص وأما رعاع الناس فلا كلام لنا معهم فإنهم رعاع بالنظر إلى هؤلاء السادة وإذا وقع مثل هذا من السادة فعليهم يقع العتب منا وقد يشطح أيضا الأدنى على الأعلى كمثل الشطحات على مراتب الأنبياء وهي أعظم عند الله في المؤاخذة من شطحهم على الله فإن مرتبة الإله تكذبهم بالحال وعند السامع وأما شطحتهم على الأنبياء فموضع شبهة يمكن أن تقبل الصحة في نفس الأمر فيغتر بها السامع الحسن الظن به الذي‏\nلا معرفة عنده بمراتب أصناف الخلق عند الله فيغار الله لذلك حيث هو حق للغير وما يؤثر من الضلالة في الناس فيؤاخذ صاحب الشطحة بها ولا سيما إن ظهرت منه في حال صحو\n\n\n### [العالم المكمل بالله هو الذي يحمى نفسه بأن يجعل عليها حجة لله‏]\n\n\nوكذلك من الشطحات المنقولة عن السادة رؤية فضيلة جنسهم من البشر على الملائكة جهلا منهم وهم مسئولون مؤاخذون بذلك عند الله والعالم بالله المكمل هو الذي يحمي نفسه أن يجعل لله عليه حجة بوجه من الوجوه ومن أراد أن يسلم من ذلك فليقف عند الأمر والنهي وليرتقب الموت ويلزم الصمت إلا عن ذكر الله من القرآن خاصة فمن فعل ذلك فلم يدع للخير مطلبا ولا من الشر مهربا وقد استبرأ لنفسه وأعطى كل ذي حق حقه كما أعطى الله كُلَّ شَيْ‏ءٍ خَلْقَهُ وهذا هو العاقل مقصود الحق من العالم وما فوق هذه المرتبة مرتبة لمخلوق أصلا\n\n\n### [الفتى من لا يتفتى على الخلق إلا بصفة حق أو أمر حق‏]\n\n\nهذا قد مشى من الفتوة طرف صالح في حكمها في الجناب الإلهي وإذا كان الحق يا ولي مع غناه وماله من صفات الجلال ونعوت الكمال قد أريتك ما له من هذه النسبة في إيثاره إياك فأنت أولى بهذه الصفة أن تتصف بها في حقه خاصة لا في حق الخلق كما اتصف هو بها في حق الخلق هذا هو عمدتها فينا فالفتى من لا يراعي الخلق ولا يتفتى عليهم فإن التفتي عليهم إنما هو لله كما ذكرنا فيكون هذا العبد يطلب التفتي على جانب الحق إيثارا له على الخلق فلا يتفتى على الخلق إلا بصفة حق أو أمر حق فيكون الحق المتفتي لا هذا العبد هكذا هو التخلق بالفتوة وإلا فلا إذ كان من المحال أن تسري الفتوة من الفتى في إيثار الغير من غير تأذى الغير لأن الأغراض مختلفة والأهواء متقابلة رياحها زوابع غير لواقح بل هي عقيم تدمر ولا توجد فما من حالة يرضاها زيد منك إلا ويسخطها عمرو\n\n\n### [أصل الفتوة أن تخرج عن حظ نفسك إيثارا لحظ غيرك‏]\n\n\nفإذا كان الأمر هكذا فاترك الخلق بجانب إن أردت تحصيل هذا المقام وارجع إلى الله في أصل الفتوة فإن أصلها أن تخرج عن حظ نفسك إيثار الحظ غيرك لا تخرج عن حظ غيرك إيثارا لحظ غيرك فهذا ليس من الفتوة ولو كانت الفتوة هذا ما صح لها وجود فإذا تعارضت الأمور فرجح جانب الحق وزل عن حظك لما يستحقه جلاله إذ قد عاملك بصفة الفتوة مع غناه فأنت مع فقرك أحوج إلى ذلك ومن إيثارك إياه أنه إن طلب منك أن تطلب منه أجرا على ما تفتيت به عليه فمن الفتوة أن تطلب الأجر فإن امتثالك أمره خروجك عن حظك فيحصل لك حظك بترك حظك مع تحقيق الوصف بالفتوة إبراهيم عليه السلام جاد بنفسه على النار إيثار التوحيد ربه فإن كان ذلك عن أمر إلهي فهو أعظم في لفتوة وإن لم يكن عن أمر إلهي فهو فتى على كل حال فإنه من آثر أمر ربه على هوى نفسه فهو الفتى‏\n\n\n### [حقيقة الفتوة إيثار العلم المشروع على هوى النفس المطبوع‏]\n\n\nفحقيقة الفتوة أن يؤثر الإنسان العلم المشروع الوارد من الله على السنة الرسل على هوى نفسه وعلى أدلة عقله وما حكم به فكره ونظره إذا خالف علم الشارع المقرر له هذا هو الفتى فيكون بين يدي العلم المشروع كالميت بين يدي الغاسل ولا ينبغي أن يقال هنا يكون بين يدي الحق كالميت بين يدي الغاسل فإنه غلط ومزلة قدم فإن الشرع قيدك فقف عند تقييده فما أوجب عليك مما هو له أن تنسبه إلى نفسك أو إلى مخلوق من المخلوقات سوى الله فمن الفتوة أن تنسبه إلى ذلك لا إلى الله حقيقة كما أمرك وإن دلك على خلاف ذلك عقلك فارم به وكن مع العلم المشروع وما أوجب أن تنسبه إليه سبحانه فانسبه إليه تعالى وما خيرك فيه فإن شئت أن تقف ولا تعين وإن شئت نظرت بما يتعلق بالمخير فيه من حمد فانسبه إليه وما تعلق به من ذم فانسبه إليه وما تعلق به من ذم فانسبه إلى نفسك أدبا مع الله فإن الأدب عبارة عن جماع الخير فما زلت عن مقام الفتوة\n\n\n### [الفتوة تخيير للعبد من الله واختيار من العبد لمولاه‏]\n\n\nكان الشيخ أبو مدين رحمه الله إذا جاءه مأكول طيب أكله وإذا جاءه مأكول خشن أكله وإذا جاع وجاءه نقد علم إن الله قد خيره إذ لو أراد أن يطعمه أي صنف شاء من المأكولات جاء به إليه فيقول هذا النقد ثمن المأكول جاء به الله للتخيير والاختيار فينظر في ذلك الوقت ما هو الأحب إلى الله من المأكولات بالنظر إلى صلاح المزاج للعبادة لا إلى الفرض النفسي واتباع الشهوة فإن وافقه كل مأكول حينئذ يرجع إلى موطن الدنيا وما ينبغي أن يعامل به من الزهد في ملذوذاتها مع صلاح المزاج الذي يقوم بصلاحه العبادة المشروعة فيعدل بحكم الموطن إلى شظف العيش الذي تكرهه النفس لعدم اللذة به ويكتفي بلذة الحاجة فإنه يتناوله عند الضرورة فإن لذة الضرورة ما فوقها لذة لأن الطبع يطلبها وإذا حصل للطبع طلبه التذ به‏\n\n\n### [لا تحليل ولا تحريم بعد انقطاع الرسالة مع خاتم النبيين‏]\n\n\nفالفتى هو من ذكرناه ويسرى فعله وتصرفه في الجماد والنبات والحيوان وفي كل موجود ولكن على ميزان العلم المشروع وإن ورد عليه أمر إلهي فيما يظهر له يحل له ما ثبت تحريمه في نفس الأمر من الشرع المحمدي فقد لبس فيه فيتركه ويرجع إلى حكم‏\nالشرع الثابت فإنه قد ثبت عند أهل الكشف بأجمعهم أنه لا تحليل ولا تحريم ولا شي‏ء من أحكام الشرع لأحد بعد انقطاع الرسالة والنبوة من أهل الله فلا يعول عليه صاحب ذلك ويعلم قطعا أنه هوى نفسي إذ كان ذلك الأمر المحلل أو المحرم في نفس الأمر هذا شرطه ولا يمنع التعريف الإلهي لأهل الله بصحة الحكم المشروع في غير المتواتر بالمنصوص عليه وأما في المتواتر المنصوص إذا ورد التعريف بخلافه فلا يعول عليه هذا لا خلاف فيه عند أهل الله من أهل الكشف والوجود\n\n\n### [من يطرأ عليهم التلبيس في أحوالهم ولا يشعرون بمكر الله الخفي بهم‏]\n\n\nفإنه من المنتمين إلى الله من يطرأ عليهم التلبيس في أحوالهم من حيث لا يشعرون وهو مكر خفي وكيد متين إلهي واستدراج من حيث لا يشعرون فإياك أن ترمي ميزان الشرع من يدك في العلم الرسمي والمبادرة لما حكم به وإن فهمت منه خلاف ما يفهمه الناس مما يحول بينك وبين إمضاء ظاهر الحكم به فلا تعول عليه فإنه مكر نفسي بصورة إلهية من حيث لا تشعر وقد وقعنا بقوم صادقين من أهل الله ممن التبس عليهم هذا المقام ويرجحون كشفهم وما طهر لهم في فهمهم مما يبطل ذلك الحكم المقرر فيعتمدون عليه في حق نفوسهم ويسلمون ذلك الحكم المقرر في الظاهر للغير وهذا ليس بشي‏ء عندنا ولا عند أهل الله وكل من عول عليه فقد خلط وخرج عن الانتظام في سلك أهل الله ولحق بِالْأَخْسَرِينَ أَعْمالًا الَّذِينَ ضَلَّ سَعْيُهُمْ في الْحَياةِ الدُّنْيا وهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعاً\n\n\n### [من يظن أنه في الحاصل وهو في الفائت‏]\n\n\nوربما يبقى صاحب هذا الكشف على العمل بظاهر ذلك الحكم ولا يعتقده في حق نفسه فيعمله تقريرا للظاهر ويقول ما أعطى من نفسي لهذا الأمر المشروع إلا ظاهري فإني قد أطلعت على سره فحكمه على سرى خلاف حكمه في ظاهري فلا يعتقده في سره عند العمل به فمن عمل على هذا منه فقد حَبِطَ عَمَلُهُ وهُوَ في الْآخِرَةِ من الْخاسِرِينَ فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ وخرج عن أن يكون من أهل الله ولحق بمن اتَّخَذَ إِلهَهُ هَواهُ وأَضَلَّهُ الله عَلى‏ عِلْمٍ فهو يظن أنه في الحاصل وهو في الفائت فتحفظوا يا إخواننا من غوائل هذا المقام ومكر هذا الكشف فقد نصحتكم ونصحت هذه الطائفة ووفيت بالأمر الواجب علي فيه فمن لم يعلم الفتوة كما ذكرناها فما علمها\n\n",
    "en": "(Chapter 146: Concerning the Knowledge of the Station of Spiritual Chivalry [al-Futūwa] and its Secrets)\n\nKnow, may Allah support you:\n\n> Spiritual Chivalry [al-Futūwa] is that whose possessor is never absent,\n> Esteemed by the Lord of mankind and by mankind.\n\n> The Chivalrous One [al-Fatā] is he whose adornment is Altruism [al-Īthār],\n> Wherever he may be, he is carried upon the head (held in high esteem).\n\n> Desires, with all their strength, cannot shake him,\n> For he is firm, like the towering, rooted mountain.\n\n> No sorrow governs him, no fear distracts him,\n> From noble deeds, even in times of war and distress.\n\n> Look at his breaking of the idols, alone,\n> Without an assistant—that is the gentle severity.\n\n### [Spiritual Chivalry is a Divine Attribute by way of meaning, not by way of word]\n\nSpiritual Chivalry [al-Futūwa] is a Divine Attribute (na‘t ilāhī) by way of meaning, though He, glory be to Him, does not have a Divine Name (ism ilāhī) derived from its word by which He is named, as is established by the Sacred Law [al-Shar‘] and by rational proof: that He is absolutely Independent [al-Ghanī] of the cosmos. The proof from the Sacred Law is His saying, the Exalted: <<فَإِنَّ اللهَ غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is Independent of the worlds). The rational proof is that if His Existence [Wujūd] were not necessary for His Essence (wājib li-nafsihi) while being characterized by Existence, He would be contingent (mumkin). If He were contingent, He would require a determinant (murajjih) for His existence, and thus the Name The Absolutely Independent [al-Ghanī] would not be valid for Him. If He were dependent in any way whatsoever, He would not be absolutely Independent, but would be part of the cosmos, serving as a sign pointing to His determinant. Therefore, He is absolutely Independent. When He possesses this Independence [al-Ghanī] and then brings the world into existence, He does not create it out of need for it. Rather, He creates the world for the world, giving it preference [īthār] over His solitude in Being [Wujūd]. This is the very essence of Spiritual Chivalry [al-Futūwa].\n\n### [The form of Spiritual Chivalry in Allah’s creation of the world]\n\nAmong the Divine Spiritual Chivalry [al-Futūwa al-Ilāhiyya] are the two reports, the Quranic and the Prophetic. As for the Quranic, it is His saying: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me). The form of Spiritual Chivalry [al-Futūwa] here is that He created them to bestow upon them the blessing of Existence, to bring them out of the evil of non-existence, to enable them to be characterized by the Divine Names (al-Asmā’ al-Ilāhiyya), and to establish successors (khulafā’) from among them. All of this is Altruism [īthār] toward them, preferring them over His solitude in all that He made them successors over. Then He knew that the sense of Obligation [al-Minna] detracts from the blessing in the eyes of the recipient, so He concealed that Altruism [īthār] by His saying: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>>. Thus, He made it appear that He created them for His sake, not for their sake.\n\n### [The creation of things for the sake of man, and the creation of man for the sake of the All-Merciful]\n\nIn the Prophetic (Mūsawī) report, it is stated that He, the Exalted, created things for our sake and created us for His sake.\n\nHe concealed by this His saying: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing except that it glorifies Him with praise), so that everyone understands, through His informing them that they glorify Him with praise, that we do not perceive in it the scent of Obligation [al-Minna]. Thus, in the Mūsawī report, the ruling of Spiritual Chivalry [al-Futūwa] is that He created things for our sake, giving us preference [īthār] over His solitude in Being, just as He created us. And His saying <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> is a covering, so that the scent of Obligation [al-Minna] is not perceived in it, just like His saying concerning us: <<إِلَّا لِيَعْبُدُونِ>> (except to worship Me).\n\n### [Establishing the Fixed Entities which the Mu‘tazila affirmed]\n\nAs for the second of the two Prophetic reports, it is what was narrated from the Messenger of Allah (peace and blessings be upon him) from Allah, the Glorified, that He said: \"I was a hidden treasure, and I loved to be known, so I created the creation and made Myself known to them, and they knew Me.\"\n\nIn His saying, \"I was a hidden treasure,\" there is the affirmation of the Fixed Entities [al-A‘yān al-Thābita] which the Mu‘tazila affirmed, and which is His saying: <<إِنَّمَا قَوْلُنَا لِشَيْءٍ>> (Indeed, Our word to a thing...).\n\n### [Love is only related to what is non-existent]\n\nThis report is an act of Spiritual Chivalry [al-Futūwa]. How did He allude to Himself as loving to be known? One whose attribute is this has covered up what is necessarily due to Him of Absolute Independence [al-Ghanī al-Mutlaq], because love is only related to what is non-existent (ma‘dūm). That non-existent thing may be within a non-existent or within an existent. If it is in a non-existent, then its existence is still necessary so that what He loved to bring into existence may manifest in it. If it is in an existent, then what He loved has manifested in it. Therefore, what He mentioned must be a covering for His Absolute Independence and an Altruism [īthār] toward this beloved presence (janāb) to which the One possessing Independence relates, thereby granting it honor in itself, since it was the object of intention for the One possessing the attribute of Independence.\n\n### [The cause of Existence is the manifestation of Existential and Cognitive Perfection]\n\nThe cause of Existence [Wujūd] was that Existence and Knowledge [al-‘Ilm] sought, by their state, the perfection of their respective levels in the rational division (al-taqsīm al-‘aqlī) from Allah. So, He brought them into existence as a favor (minna) for the manifestation of Existential Perfection (al-kamāl al-wujūdī) and Cognitive Perfection (al-kamāl al-‘ilmī). This origin is a favor from Him. Yet, He turned away from this and attributed the existence of the world to His love to be known, so that the perfection of Existence and Knowledge would not perceive the scent of Obligation [al-Minna] either, just as mentioned in the Quran. If The Real [al-Haqq] has descended with His servants in noble character traits, which constitute Spiritual Chivalry [al-Futūwa], to this extent, then the servant is even more deserving of being characterized by this attribute.\n\n### [Spiritual Chivalry is the manifestation of favors and blessings, and the concealment of the sense of Obligation and superiority]\n\nSpiritual Chivalry [al-Futūwa], in reality, is the manifestation of blessings (al-ālā’) and favors (al-minan), while concealing the sense of Obligation [al-Minna] and the act of conferring a favor (al-imtinān). This is a Divine characterization (takhalluq ilāhī), as He said: <<لَا تُبْطِلُوا صَدَقَاتِكُمْ بِالْمَنِّ وَالْأَذَى>> (Do not invalidate your charities with obligation [al-mann] and injury). For He, glory be to Him, bestowed upon us the charity of Existence and Gnosis [al-Ma‘rifa] of Him, yet He did not confer a sense of Obligation upon us for that. As for His saying: <<بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ>> (Rather, Allah confers favor upon you), its meaning is that if a favor were to be conferred, the Obligation [al-Mann] belongs to Allah, in response to their conferring a favor upon the Prophet (peace and blessings be upon him) by accepting Islam. Allah the Exalted said: <<يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا>> (They consider it a favor to you that they have submitted). Allah said to Muhammad (peace and blessings be upon him): <<قُلْ لَا تَمُنُّوا عَلَيَّ إِسْلَامَكُمْ>> (Say: Do not confer your submission upon me as a favor). Then He gave preference [īthār] to Muhammad (peace and blessings be upon him) over Himself, glory be to Him, so that He would not assign to Himself an attribute in what He caused their tongue to utter in blame. So He said to him: Tell them: <<بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ>> (Rather, Allah confers favor upon you that He has guided you to faith). Had He wished, He could have said: Rather, I confer favor upon you that Allah has guided you through Me to the faith which He provided you through His Oneness [Tawhīd] and made you happy by it. But He, the Exalted, did not make Himself the locus of Obligation [al-Mann]. This is part of the Divine Spiritual Chivalry [al-Futūwa al-Ilāhiyya] which is often unnoticed.\n\n### [The ruling of Spiritual Chivalry exists in The Real, but its application to Him is not found in the Sacred Law]\n\nThe ruling (hukm) of Spiritual Chivalry [al-Futūwa] exists in The Real [al-Haqq], but its application (itlāq) has not been mentioned in the Book or the Sunna. Just as it is known definitively that there is no difference between our saying, \"I knew the thing\" (al-shay’) and \"I had Gnosis of it\" (al-ma‘rifa), and \"I am knowing of the thing\" (‘ālim) or \"I have Gnosis\" (‘ārif), yet the application of the Name The Knowing (‘Ālim), The All-Knowing (‘Alīm), and The Knower of the Unseen (‘Allām) has been mentioned for Him, the Exalted, but the application of the Name The Gnostic (‘Ārif) has not. Thus, it is not necessary that an attribute whose ruling belongs to Allah must have a Name derived from it applied to Him. His Names, in terms of their application to Him, are restricted to what has been transmitted from Him. He is only named by what He named Himself, even if the meaning implied by that Name is known to exist in Him. Therefore, restriction (tawqīf) in application is more appropriate.\n\n### [Spiritual Chivalry and Ecstatic Utterance]\n\nHe, glory be to Him, did all this only so that creation might learn proper conduct (adab) with Him. And since it is known that among the People of Allah (Ahl Allāh) there are those who have ecstatic utterances (shataḥāt), they should learn proper conduct so as not to utter them. For the ecstatic utterance is a deficiency in the human being because he thereby attaches himself to the Divine Level (al-rutba al-ilāhiyya) and departs from his own reality, thus the ecstatic utterance attaches him to ignorance of Allah and of himself. It has occurred among the great masters (akābir), and I will not name them, because it is an attribute of deficiency. As for the common people (ru‘ā‘ al-nās), we have no discussion with them, for they are commoners compared to these masters (sāda). If such a thing occurs from the masters, the blame falls upon them from us. The lower may also utter ecstatic statements against the higher, such as ecstatic utterances concerning the levels of the Prophets. These are greater in accountability before Allah than their ecstatic utterances concerning Allah, for the Divine Level refutes them immediately and in the hearing of the listener. But their ecstatic utterances against the Prophets are a source of ambiguity (shubha) that might be accepted as true in reality, and the listener who has good opinion of them, but lacks Gnosis [Ma‘rifa] of the levels of the various types of creation before Allah, may be deceived by it. Allah is jealous for that, since it is the right of another, and because of the misguidance it causes among people, the author of the ecstatic utterance is held accountable for it, especially if it manifests from him in a state of sobriety (sahw).\n\n### [The perfected Gnostic of Allah is he who protects himself from giving Allah a proof against him]\n\nLikewise, among the ecstatic utterances transmitted from the masters is the view of the superiority of their human species over the angels, due to their ignorance. They will be questioned and held accountable for this before Allah. The Gnostic of Allah (al-‘ālim bi-Allāh), the perfected one (al-mukammal), is he who protects himself from giving Allah a proof (hujja) against him in any way whatsoever. Whoever wishes to be safe from that should adhere strictly to the command and prohibition, anticipate death, and maintain silence except for the remembrance of Allah, specifically from the Quran. Whoever does this has left no good sought and no evil escaped. He has cleared himself and given every possessor of a right his due, just as Allah gave <<كُلَّ شَيْءٍ خَلْقَهُ>> (everything its creation). This is the rational person (‘āqil), the object of The Real’s intention for the cosmos. There is no level above this level for any created being whatsoever.\n\n### [The Chivalrous One is he who does not display Spiritual Chivalry toward creation except through a Divine Attribute or a Divine Command]\n\nThis has covered a good portion of the ruling of Spiritual Chivalry [al-Futūwa] concerning the Divine Presence (al-Janāb al-Ilāhī). O friend, if The Real, despite His Independence and His attributes of Majesty (Jalāl) and perfections of Excellence (Kamāl), has shown you His share in this quality by giving you preference [īthār], then you are more deserving of being characterized by this attribute, specifically concerning His right, not concerning the right of creation, just as He characterized Himself with it concerning the right of creation. This is the foundation of Spiritual Chivalry [al-Futūwa] in us. The Chivalrous One [al-Fatā] is he who does not observe creation and does not display Spiritual Chivalry toward them, for displaying Spiritual Chivalry toward them belongs only to Allah, as we mentioned. Thus, this servant seeks to display Spiritual Chivalry toward the side of The Real, giving Him preference [īthār] over creation. He does not display Spiritual Chivalry toward creation except through a Divine Attribute (sifat haqq) or a Divine Command (amr haqq). Thus, The Real is the one displaying Spiritual Chivalry, not this servant. This is how one is characterized by Spiritual Chivalry [al-Futūwa]; otherwise, it is not so. For it is impossible for Spiritual Chivalry to flow from the Chivalrous One [al-Fatā] in preferring others without the other being harmed, because intentions are diverse and desires are opposed, their winds being whirlwinds that do not fertilize, but are barren, destroying rather than creating. There is no state that Zayd is pleased with from you except that ‘Amr is displeased with it.\n\n### [The essence of Spiritual Chivalry is that you abandon your own portion, preferring the portion of another]\n\nSince the matter is thus, leave creation aside if you wish to attain this station, and return to Allah regarding the essence of Spiritual Chivalry [al-Futūwa]. For its essence is that you abandon your own portion (hazz nafsika), preferring the portion of another (hazz ghayrika). You do not abandon the portion of another, preferring the portion of another; that is not Spiritual Chivalry. If Spiritual Chivalry were that, it would not be valid. Therefore, when matters conflict, prioritize the side of The Real and relinquish your portion for what His Majesty deserves, since He dealt with you with the attribute of Spiritual Chivalry despite His Independence. You, with your poverty, are more in need of that. Part of your Altruism [īthār] toward Him is that if He asks you to seek a reward from Him for the Spiritual Chivalry you displayed toward Him, then it is an act of Spiritual Chivalry to seek the reward. For your compliance with His command is your abandonment of your portion, and thus you attain your portion by abandoning your portion, while realizing the description of Spiritual Chivalry. Abraham (peace be upon him) sacrificed himself to the fire, preferring the Oneness [Tawhīd] of his Lord. If that was by Divine Command, it is greater in Spiritual Chivalry. If it was not by Divine Command, he is still a Chivalrous One [fatā] in any case, for whoever prefers the command of his Lord over the desire of his soul is the Chivalrous One.\n\n### [The reality of Spiritual Chivalry is preferring the Revealed Knowledge over the innate desire of the soul]\n\nThe reality of Spiritual Chivalry [al-Futūwa] is that a person prefers the Revealed Knowledge (al-‘ilm al-mashrū‘) transmitted from Allah upon the tongues of the Messengers, over the desire of his soul (hawā nafsih), and over the proofs of his intellect and the judgment of his thought and speculation, if it contradicts the established knowledge of the Lawgiver (al-Shāri‘). This is the Chivalrous One [al-Fatā]. He should be before the Revealed Knowledge like the corpse before the washer. It should not be said here that he is before The Real [al-Haqq] like the corpse before the washer, for that is an error and a slippery slope. For the Sacred Law [al-Shar‘] has restricted you, so stop at its restriction. Whatever it obligates you to attribute to yourself or to a creature other than Allah, it is an act of Spiritual Chivalry [al-Futūwa] to attribute it to that, and not truly to Allah, as He commanded you. Even if your intellect guides you to the contrary, cast it aside and adhere to the Revealed Knowledge. Whatever it obligates you to attribute to Him, the Glorified, attribute it to Him, the Exalted. And whatever He gives you a choice in: if you wish, you may stop and not specify; and if you wish, you may look at what relates to the matter of choice concerning praise, and attribute it to Him, and what relates to it concerning blame, attribute it to yourself, out of proper conduct (adab) with Allah. For proper conduct is the sum total of all good. Thus, you will not deviate from the station of Spiritual Chivalry [al-Futūwa].\n\n### [Spiritual Chivalry is a choice given to the servant by Allah, and a choice made by the servant for his Master]\n\nShaykh Abū Madyan (may Allah have mercy on him) used to eat fine food when it came to him, and coarse food when it came to him. If he was hungry and received money (naqd), he knew that Allah had given him a choice, for if He had wished to feed him any kind of food, He would have brought it to him. So he would say, \"This money is the price of food; Allah brought it for choice and selection.\" He would then consider what food was most beloved to Allah at that time, based on the suitability of the temperament for worship, not based on the soul’s desire or the pursuit of lust. If all food suited him, he would then return to the domain of the world and how it should be treated with asceticism (zuhd) regarding its pleasures, while maintaining the soundness of temperament necessary for prescribed worship. He would then, by the ruling of the domain, incline toward the hardship of life (shazaf al-‘aysh) which the soul dislikes due to the absence of pleasure, and content himself with the pleasure of necessity, for he consumes it out of need. The pleasure of necessity is unsurpassed, because nature seeks it, and when nature obtains what it seeks, it finds pleasure in it.\n\n### [No permission or prohibition after the cessation of the Message with the Seal of the Prophets]\n\nThe Chivalrous One [al-Fatā] is the one we have described, and his action and disposition flow through the inanimate, the plant, the animal, and every existent thing, but according to the measure of the Revealed Knowledge [al-‘Ilm al-Mashrū‘]. If a Divine Command (amr ilāhī) appears to him, seemingly permitting what is definitively prohibited in the reality of the Muhammadan Sacred Law [al-Shar‘ al-Muhammadi], he has been subject to delusion (talbīs) in this matter, so he must abandon it and return to the ruling of the established Sacred Law. For it is established among all the People of Unveiling [Ahl al-Kashf] that there is no permission (tahlīl) or prohibition (tahrīm), nor any ruling of the Sacred Law, for anyone among the People of Allah (Ahl Allāh) after the cessation of the Message (Risāla) and Prophethood (Nubūwa) with the Seal of the Prophets. Therefore, the one experiencing this should not rely upon it, and must know definitively that it is a desire of the soul (hawā nafsī), since that matter, whether permitted or prohibited, is subject to this condition in reality. However, this does not prevent the Divine Gnosis [al-Ta‘rīf al-Ilāhī] for the People of Allah regarding the validity of the prescribed ruling in matters that are not transmitted by consensus (mutawātir) concerning the explicit text (al-mansūs ‘alayh). But if the Gnosis comes contrary to the explicitly stated consensus (al-mutawātir al-mansūs), one must not rely upon it. There is no disagreement on this among the People of Allah who possess Unveiling [al-Kashf] and Being [al-Wujūd].\n\n### [Those upon whom delusion descends in their states, and they are unaware of Allah’s subtle cunning toward them]\n\nIndeed, among those who affiliate themselves with Allah are those upon whom delusion (talbīs) descends in their states without them realizing it. This is subtle cunning (makr khafī), a strong Divine plot (kayd matīn ilāhī), and a gradual enticement (istidrāj) without their awareness. Beware of casting the scale of the Sacred Law [al-Shar‘] from your hand regarding formal knowledge (al-‘ilm al-rasmī) and hasten to what it rules. Even if you understand from it something contrary to what people understand, which prevents you from executing the apparent ruling, do not rely upon it. For it is a cunning of the soul (makr nafsī) in a Divine form, without your realizing it. We have encountered sincere people among the People of Allah who were deluded in this station. They prioritize their Unveiling [Kashf] and what manifested to them in their understanding, which invalidates that established ruling. They rely upon it for themselves, while conceding that established ruling outwardly to others. This is nothing in our view, nor in the view of the People of Allah. Everyone who relies upon it has mixed things up and departed from the order of the People of Allah, joining <<الْأَخْسَرِينَ أَعْمَالًا * الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا>> (those whose deeds are the greatest losers, those whose effort is lost in the worldly life, while they think that they are doing good work).\n\n### [He who thinks he is in the attained, while he is in the missed]\n\nPerhaps the possessor of this Unveiling [Kashf] continues to act according to the apparent ruling, but does not believe in it for himself. He performs it as an affirmation of the outward form, saying, \"Only my outward self is given to this Revealed Command, for I have been informed of its secret, and its ruling upon my secret is contrary to its ruling upon my outward self.\" Thus, he does not believe in it inwardly while acting upon it. Whoever acts upon this basis has had <<حَبِطَ عَمَلُهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ * فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ>> (his work rendered void, and he will be among the losers in the Hereafter; their trade did not profit them, nor were they guided). He has departed from being one of the People of Allah and joined those who <<اتَّخَذَ إِلَهَهُ هَوَاهُ وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ>> (take his own desire as his god, and whom Allah has led astray knowingly). He thinks he is in the attained (al-hāsil) while he is in the missed (al-fā’it). So, beware, O our brothers, of the pitfalls of this station and the cunning of this Unveiling [Kashf]. I have advised you and advised this group, and I have fulfilled the duty incumbent upon me concerning it. Whoever does not know Spiritual Chivalry [al-Futūwa] as we have mentioned it, has not known it.",
    "ur": "(باب ایک سو چھیالیس: مقام فتوّت اور اس کے اسرار کی معرفت میں)\n\nجان لو، اللہ تمہاری مدد کرے:\n\n> فتوّت (الفتوة) والا شخص ہمیشہ *** ربِ ناس اور لوگوں کے نزدیک مقدم رہتا ہے\n>\n> فتیٰ (جوانمرد) وہ ہے جس کی زینت ایثار (الإيثار) ہو *** وہ جہاں بھی ہو، سر پر اٹھایا جاتا ہے\n>\n> خواہشات اپنی قوت سے اسے متزلزل نہیں کر سکتیں *** کیونکہ وہ بلند و بالا پہاڑ کی طرح ثابت قدم ہے\n>\n> نہ غم اس پر غالب آتا ہے نہ خوف اسے روکتا ہے *** جنگ اور سختی کے وقت بھی مکارم سے\n>\n> دیکھو، اس نے تنہا، بغیر کسی مددگار کے، بتوں کو توڑا *** یہی وہ نرمی ہے جو سختی میں بدل جاتی ہے\n\n### [فتوّت (الفتوة) معنی کے اعتبار سے ایک الٰہی صفت ہے، لفظ کے اعتبار سے نہیں]\n\nفتوّت (الفتوة) معنی کے اعتبار سے ایک الٰہی صفت ہے، نہ کہ لفظ کے اعتبار سے، اور اس (ذات حق) کے لیے اس لفظ سے کوئی الٰہی نام نہیں ہے جس سے اسے پکارا جائے، جیسا کہ شرعاً اور عقلی دلیل سے ثابت ہے کہ وہ مطلقاً عالم سے بے نیاز (غنی) ہے۔ شرعی دلیل اللہ تعالیٰ کا یہ قول ہے:\n> **فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ** (بے شک اللہ تمام جہانوں سے بے نیاز ہے)۔\n\nاور عقلی دلیل یہ ہے کہ اگر اس کا وجود اپنی ذات کے لیے واجب نہ ہوتا، باوجود اس کے کہ وہ وجود سے متصف ہے، تو وہ ممکن ہوتا، کیونکہ وہ وجود سے متصف ہے۔ اور اگر وہ ممکن ہوتا تو اپنے وجود میں کسی مرجح (ترجیح دینے والے) کا محتاج ہوتا، لہٰذا اس کے لیے مطلق غنی (الغني المطلق) کا نام صحیح نہ ہوتا۔ اور اگر وہ کسی بھی نوع کی محتاجی رکھتا تو وہ غنی مطلق نہ ہوتا، اور وہ عالم کے زمرے میں شامل ہو جاتا، اور وہ اپنے مرجح کی علامت بن جاتا۔ پس وہ مطلقاً غنی ہے۔ اور جس کے پاس یہ غنی (الغني) ہو، پھر وہ عالم کو وجود بخشے، تو اس نے اسے اپنی محتاجی کی وجہ سے وجود نہیں بخشا، بلکہ اس نے عالم کو عالم کے لیے وجود بخشا، اپنے وجود میں انفرادیت پر اسے ایثار (الإيثار) دیتے ہوئے، اور یہی عین فتوّت (الفتوة) ہے۔\n\n### [اللہ کے عالم کو تخلیق کرنے میں فتوّت (الفتوة) کی صورت]\n\nاور الٰہی فتوّت (الفتوة) میں قرآنی اور نبوی دونوں خبریں شامل ہیں۔ قرآنی خبر اللہ تعالیٰ کا یہ قول ہے:\n> **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ** (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا ہے)۔\n\nاور یہاں فتوّت (الفتوة) کی صورت یہ ہے کہ اس نے انہیں وجود کی نعمت سے نوازنے کے لیے پیدا کیا، اور انہیں عدم کے شر سے نکالا، اور انہیں الٰہی اسماء سے متخلق ہونے کا موقع دیا، اور ان میں سے خلیفہ بنایا۔ یہ سب کچھ اپنے وجود میں انفرادیت پر انہیں ایثار (الإيثار) دینا ہے، ان تمام چیزوں میں جن میں انہیں خلیفہ بنایا۔ پھر اسے معلوم تھا کہ احسان جتانا (الامتنان) منعم علیہ کے نزدیک نعمت میں نقص پیدا کرتا ہے، لہٰذا اس نے ان پر ایثار (الإيثار) کرتے ہوئے اسے اپنے اس قول سے چھپا لیا:\n> **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ** (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا ہے)۔\n\nپس اس نے ظاہر کیا کہ اس نے انہیں اپنی خاطر پیدا کیا ہے نہ کہ ان کی خاطر۔\n\n### [اشیاء کی تخلیق انسان کی خاطر اور انسان کی تخلیق رحمن کی خاطر]\n\nاور موسوی نبوی خبر میں ہے کہ اللہ تعالیٰ نے اشیاء کو ہماری خاطر پیدا کیا اور ہمیں اپنی خاطر پیدا کیا۔\n\nاور اس نے اپنے اس قول کو اس سے چھپا لیا:\n> **وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ** (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔\n\nتاکہ سب کو اس کے اعلان سے یہ سمجھ آ جائے کہ وہ اس کی حمد کے ساتھ تسبیح کرتے ہیں، تاکہ ہم اس میں احسان جتانے (المنة) کی بو بھی نہ سونگھیں۔ پس موسوی خبر میں فتوّت (الفتوة) کا حکم یہ ہے کہ اس نے اشیاء کو ہماری خاطر پیدا کیا، اپنے وجود میں انفرادیت پر ہمیں ایثار (الإيثار) دیتے ہوئے، جیسا کہ اس نے ہمیں پیدا کیا۔ اور اس کا قول: **وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ** (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے) ایک پردہ ہے تاکہ اس میں احسان جتانے (المنة) کی بو نہ آئے، بالکل اسی طرح جیسے ہمارے حق میں اس کا قول: **إِلَّا لِيَعْبُدُونِ** (مگر وہ میری عبادت کریں)۔\n\n### [اعیان ثابتہ (الأعيان الثابتة) کا اثبات جس کی طرف معتزلہ گئے ہیں]\n\nاور دو خبروں میں سے دوسری نبوی خبر وہ ہے جو رسول اللہ صلی اللہ علیہ وسلم سے اللہ سبحانہ و تعالیٰ کے بارے میں روایت کی گئی ہے کہ اس نے فرمایا:\n> **\"كنت كنزا لم أعرف فأحببت إن أعرف فخلقت الخلق وتعرفت إليهم فعرفوني\"** (میں ایک چھپا ہوا خزانہ تھا، میں نے چاہا کہ پہچانا جاؤں، پس میں نے مخلوق کو پیدا کیا اور ان سے اپنا تعارف کرایا تو انہوں نے مجھے پہچانا)۔\n\nاس کے قول \"میں ایک چھپا ہوا خزانہ تھا\" میں اعیان ثابتہ (الأعيان الثابتة) کا اثبات ہے جس کی طرف معتزلہ گئے ہیں، اور وہ اس کا قول ہے:\n> **إِنَّما قَوْلُنا لِشَيْ‏ءٍ** (ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا بس یہی ہوتا ہے)۔\n\n### [محبت کا تعلق صرف معدوم سے ہوتا ہے]\n\nیہ خبر فتوّت (الفتوة) میں سے ہے، کیسے اس نے اپنی ذات سے کنایہ کیا کہ اس نے پہچانا جانا پسند کیا؟ اور جس کی یہ صفت ہو، اس نے اپنے لیے واجب غنی مطلق (الغني المطلق) پر پردہ ڈال دیا۔ کیونکہ محبت کا تعلق صرف معدوم سے ہوتا ہے۔ اور وہ معدوم، معدوم میں بھی ہو سکتا ہے یا موجود میں بھی۔ اگر وہ معدوم میں ہو، تو اس کا وجود بھی ضروری ہے تاکہ اس میں وہ چیز ظاہر ہو جسے وہ وجود دینا پسند کرتا ہے۔ اور اگر وہ موجود میں ہو، تو اس نے اس میں وہ چیز ظاہر کی جسے اس نے پسند کیا۔ پس جو کچھ اس نے ذکر کیا، وہ غنی مطلق (الغني المطلق) پر پردہ ڈالنا اور اس محبوب ذات پر ایثار (الإيثار) کرنا ضروری ہے، جس سے وہ ذات متعلق ہوئی جو غنی (الغني) کی صفت رکھتی ہے۔ پس یہ اسے اپنی ذات میں عزت بخشتا ہے، کیونکہ وہ اس ذات کا مقصود ہے جو غنی کی صفت رکھتی ہے۔\n\n### [وجود کا سبب وجودی اور علمی کمال کا ظہور ہے]\n\nاور وجود کا سبب یہ تھا کہ وجود اور علم نے اللہ سے حال کے ذریعے عقلی تقسیم میں اپنے مرتبے کے کمال کا مطالبہ کیا، پس اس نے انہیں وجود بخشا، یہ ایک احسان تھا تاکہ وجودی اور علمی کمال ظاہر ہو۔ یہ اصل میں اس کی طرف سے ایک احسان (منة) ہے۔ پس اس نے اس سے اعراض کیا اور عالم کے وجود کو اپنی پہچانے جانے کی محبت کی طرف منسوب کیا، تاکہ وجود اور علم کا کمال بھی احسان (المنة) کی بو نہ سونگھے، جیسا کہ قرآن میں ذکر کیا گیا ہے۔ اور جب ذات حق (الحق) اپنے بندوں کے ساتھ مکارم اخلاق میں، جو کہ فتوّت (الفتوة) ہے، اس حد تک اتر آیا ہے، تو بندہ اس صفت سے متخلق ہونے کا زیادہ حقدار ہے، تاکہ وہ اس سے متخلق ہو۔\n\n### [فتوّت (الفتوة) نعمتوں اور احسانات کا اظہار اور عطا اور برتری کو چھپانا ہے]\n\nپس فتوّت (الفتوة) حقیقت میں نعمتوں اور احسانات (الآلاء والمنن) کا اظہار کرنا اور احسان جتانے (المنة) اور برتری کو چھپانا ہے، جیسا کہ اس نے فرمایا:\n> **لَا تُبْطِلُوا صَدَقَاتِكُمْ بِالْمَنِّ وَالْأَذَىٰ** (اپنے صدقات کو احسان جتا کر اور تکلیف دے کر باطل نہ کرو)۔\n\nیہ ایک الٰہی تخلق ہے۔ کیونکہ اس (سبحانہ) نے ہمیں وجود اور اپنی معرفت (المعرفۃ) کا صدقہ دیا، اور اس پر ہم پر احسان نہیں جتایا۔ اور اس کے قول:\n> **بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ** (بلکہ اللہ تم پر احسان کرتا ہے)۔\n\nکا مطلب یہ ہے کہ اگر وہ احسان جتاتا تو احسان اللہ کے لیے ہوتا، جب انہوں نے محمد صلی اللہ علیہ وسلم پر اسلام لانے کا احسان جتایا۔ اللہ تعالیٰ نے فرمایا:\n> **يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا** (وہ آپ پر احسان جتاتے ہیں کہ وہ اسلام لے آئے)۔\n\nاللہ نے محمد صلی اللہ علیہ وسلم سے فرمایا:\n> **قُلْ لَا تَمُنُّوا عَلَيَّ إِسْلَامَكُمْ** (کہہ دیجیے کہ مجھ پر اپنے اسلام کا احسان نہ جتاؤ)۔\n\nپھر اس نے محمد صلی اللہ علیہ وسلم کو اپنی ذات پر ایثار (الإيثار) دیا، یہاں تک کہ اس نے اس پر کوئی صفت مقرر نہیں کی جس پر اس نے زبانِ مذمت جاری کی، پس اس نے ان سے کہا کہ انہیں کہو:\n> **بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ** (بلکہ اللہ تم پر احسان کرتا ہے کہ اس نے تمہیں ایمان کی ہدایت دی)۔\n\nاور اگر وہ چاہتا تو کہتا: بلکہ میں تم پر احسان کرتا ہوں کہ اللہ نے تمہیں میرے ذریعے ایمان کی ہدایت دی جو اس نے تمہیں اپنی توحید کے ذریعے عطا کیا اور تمہیں اس سے سعادت مند بنایا۔ پس اس نے اسے احسان جتانے (المن) کا محل نہیں بنایا۔ یہ اس الٰہی فتوّت (الفتوة) میں سے ہے جس کا شعور نہیں ہوتا۔\n\n### [فتوّت (الفتوة) کا حکم ذات حق (الحق) میں موجود ہے، لیکن اس کا اطلاق شرع میں وارد نہیں ہوا]\n\nپس اس کا حکم ذات حق (الحق) میں موجود ہے، لیکن اس کا اطلاق نہ کتاب میں وارد ہوا ہے اور نہ سنت میں۔ جیسا کہ قطعی طور پر معلوم ہے کہ ہمارے اس قول میں کوئی فرق نہیں ہے کہ \"میں نے چیز کو جانا (علمت)\" اور \"میں نے اسے پہچانا (عرفته)\"، اور \"میں چیز کا عالم ہوں (عالم)\" یا \"عارف ہوں (عارف)\"۔ اس کے باوجود، اس پر اسم \"العالم\"، \"العلیم\" اور \"العلام\" کا اطلاق وارد ہوا ہے، لیکن اسم \"العارف\" کا اطلاق اس پر وارد نہیں ہوا۔ پس یہ ضروری نہیں کہ جس امر کا حکم اللہ کے لیے ہو، اس سے کوئی نام اس پر مطلقاً استعمال کیا جائے۔ اس کے اسماء، جہاں تک ان کے اطلاق کا تعلق ہے، ان کے اس کی طرف سے وارد ہونے پر موقوف ہیں۔ پس اسے صرف اسی نام سے پکارا جائے گا جس سے اس نے خود کو پکارا ہے، اگرچہ اس نام کا مدلول اس میں معلوم ہو۔ پس اطلاق میں توقیف (شرعی نص پر رک جانا) زیادہ بہتر ہے۔\n\n### [فتوّت (الفتوة) اور شطح (Shath)]\n\nاور اس (سبحانہ) نے یہ سب کچھ صرف اس لیے کیا تاکہ مخلوق اس کے ساتھ ادب سیکھے۔ اور جب یہ معلوم ہو گیا کہ اہل اللہ میں سے کچھ ایسے ہیں جن سے شطحات (شطح) سرزد ہوتی ہیں، تو انہیں چاہیے کہ وہ مؤدب رہیں اور شطح نہ کریں۔ کیونکہ شطح (الشطح) انسان میں نقص ہے، کیونکہ وہ اس میں خود کو الٰہی مرتبے کے ساتھ جوڑ دیتا ہے اور اپنی حقیقت سے باہر نکل جاتا ہے، پس شطح اسے اللہ اور اپنی ذات سے جہالت میں مبتلا کر دیتا ہے۔ اور یہ اکابر سے بھی واقع ہوا ہے، اور میں ان کا نام نہیں لوں گا کیونکہ یہ نقص کی صفت ہے۔ اور جہاں تک عام لوگوں کا تعلق ہے، تو ہمارا ان سے کوئی کلام نہیں، کیونکہ وہ ان سادات کے مقابلے میں عام ہیں۔ اور جب ایسا معاملہ سادات سے واقع ہو تو ہماری طرف سے ان پر عتاب ہوتا ہے۔ اور کبھی ادنیٰ بھی اعلیٰ پر شطح کرتا ہے، جیسے انبیاء کے مراتب پر شطحات، اور یہ اللہ کے نزدیک ان کے اللہ پر شطح کرنے سے زیادہ بڑی مؤاخذہ کی جگہ ہے۔ کیونکہ الٰہ کا مرتبہ انہیں حال اور سامع کے نزدیک جھٹلا دیتا ہے۔ لیکن انبیاء پر ان کا شطح شبہ کی جگہ ہے، جو نفس الامر میں صحت کو قبول کر سکتا ہے، پس وہ سامع جو ان کے بارے میں حسن ظن رکھتا ہے اور جسے اللہ کے نزدیک مخلوق کی اقسام کے مراتب کی معرفت (المعرفۃ) نہیں ہے، وہ دھوکہ کھا جاتا ہے۔ پس اللہ اس پر غیرت کھاتا ہے، کیونکہ وہ حق دوسرے کا ہے، اور جو گمراہی لوگوں میں اثر انداز ہوتی ہے، اس پر شطح کرنے والے سے مؤاخذہ کیا جاتا ہے، خاص طور پر اگر وہ حالت صحو (ہوش) میں ظاہر ہو۔\n\n### [اللہ کے ذریعے کامل ہونے والا عالم وہ ہے جو خود کو اس بات سے بچاتا ہے کہ اللہ کے لیے اس پر کوئی حجت قائم ہو]\n\nاور سادات سے منقول شطحات میں سے یہ بھی ہے کہ وہ فرشتوں پر اپنی نوعِ بشر کی فضیلت کو دیکھتے ہیں، جو ان کی جہالت کی وجہ سے ہے، اور وہ اللہ کے نزدیک اس پر جواب دہ اور مؤاخذہ کیے جانے والے ہیں۔ اور اللہ کے ذریعے کامل ہونے والا عالم (العالم المكمل) وہ ہے جو خود کو اس بات سے بچاتا ہے کہ کسی بھی صورت میں اللہ کے لیے اس پر کوئی حجت قائم ہو۔ اور جو شخص اس سے محفوظ رہنا چاہتا ہے، اسے چاہیے کہ وہ امر اور نہی پر ٹھہر جائے، اور موت کا انتظار کرے، اور خاموشی اختیار کرے، سوائے اللہ کے ذکر کے، خاص طور پر قرآن سے۔ پس جس نے ایسا کیا، اس نے نہ خیر کے لیے کوئی مطالبہ چھوڑا اور نہ شر سے کوئی فرار کی جگہ۔ اور اس نے اپنی ذات کو بری کر لیا اور ہر حقدار کو اس کا حق دیا، جیسا کہ اللہ نے **كُلَّ شَيْءٍ خَلْقَهُ** (ہر چیز کو اس کی تخلیق) عطا کی۔ اور یہی عاقل ہے، جو عالم سے ذات حق (الحق) کا مقصود ہے۔ اور اس مرتبے سے اوپر مخلوق کے لیے کوئی مرتبہ نہیں ہے۔\n\n### [فتیٰ (الفتى) وہ ہے جو مخلوق پر فتوّت (الفتوة) کا اظہار نہ کرے مگر حق کی صفت یا حق کے حکم کے ساتھ]\n\nاے ولی! فتوّت (الفتوة) کے حکم میں الٰہی جناب میں ایک اچھا حصہ گزر چکا ہے۔ اور جب ذات حق (الحق)، اپنی بے نیازی اور صفات جلال اور نعوت کمال کے باوجود، تمہیں دکھا چکا ہے کہ اس نے تمہارے ایثار (الإيثار) میں کیا نسبت رکھی ہے، تو تم اس صفت سے متصف ہونے کے زیادہ حقدار ہو، خاص طور پر اس کے حق میں، نہ کہ مخلوق کے حق میں، جیسا کہ اس نے مخلوق کے حق میں اس سے خود کو متصف کیا۔ یہ ہم میں فتوّت (الفتوة) کا ستون ہے۔ پس فتیٰ (الفتى) وہ ہے جو مخلوق کی پرواہ نہ کرے اور نہ ان پر فتوّت (الفتوة) کا اظہار کرے۔ کیونکہ ان پر فتوّت کا اظہار صرف اللہ کے لیے ہے، جیسا کہ ہم نے ذکر کیا۔ پس یہ بندہ ذات حق (الحق) کے پہلو پر فتوّت کا طالب ہو گا، مخلوق پر اسے ایثار (الإيثار) دیتے ہوئے، پس وہ مخلوق پر فتوّت کا اظہار نہیں کرے گا مگر حق کی صفت یا حق کے حکم کے ساتھ۔ پس فتوّت کا اظہار کرنے والا ذات حق (الحق) ہو گا نہ کہ یہ بندہ۔ فتوّت (الفتوة) سے متخلق ہونا اسی طرح ہے، ورنہ نہیں۔ کیونکہ یہ محال ہے کہ فتوّت فتیٰ (الفتى) سے غیر کے ایثار (الإيثار) میں سرایت کرے بغیر اس کے کہ غیر کو تکلیف پہنچے، کیونکہ اغراض مختلف ہیں اور خواہشات (الأهواء) کی ہوائیں ایک دوسرے کے مقابل ہیں، وہ گرد و غبار ہیں جو بار آور نہیں ہوتیں، بلکہ وہ بانجھ ہیں جو تباہ کرتی ہیں اور وجود نہیں بخشتی ہیں۔ پس کوئی ایسی حالت نہیں ہے جسے زید تم سے راضی ہو، مگر عمرو اس سے ناراض ہو گا۔\n\n### [فتوّت (الفتوة) کی اصل یہ ہے کہ تم اپنے نفس کے حصے سے نکل جاؤ، دوسرے کے حصے کو ایثار (الإيثار) دیتے ہوئے]\n\nپس جب معاملہ ایسا ہے، تو اگر تم اس مقام کو حاصل کرنا چاہتے ہو تو مخلوق کو ایک طرف چھوڑ دو اور فتوّت (الفتوة) کی اصل میں اللہ کی طرف رجوع کرو۔ کیونکہ اس کی اصل یہ ہے کہ تم اپنے نفس کے حصے سے نکل جاؤ، دوسرے کے حصے کو ایثار (الإيثار) دیتے ہوئے، نہ کہ تم دوسرے کے حصے سے نکل جاؤ، دوسرے کے حصے کو ایثار دیتے ہوئے۔ یہ فتوّت (الفتوة) میں سے نہیں ہے، اور اگر فتوّت یہ ہوتی تو اس کا وجود صحیح نہ ہوتا۔ پس جب معاملات میں تعارض ہو تو ذات حق (الحق) کے پہلو کو ترجیح دو اور اپنے حصے سے ہٹ جاؤ، اس جلال کے مستحق ہونے کی وجہ سے، کیونکہ اس نے اپنی بے نیازی کے باوجود تمہارے ساتھ فتوّت (الفتوة) کی صفت سے معاملہ کیا۔ پس تم اپنی فقر (محتاجی) کے ساتھ اس کے زیادہ محتاج ہو۔ اور تمہارے ایثار (الإيثار) میں سے یہ ہے کہ اگر وہ تم سے مطالبہ کرے کہ تم اس پر فتوّت (الفتوة) کے اظہار پر اجر طلب کرو، تو فتوّت میں سے یہ ہے کہ تم اجر طلب کرو۔ کیونکہ اس کے حکم کی تعمیل تمہارے اپنے حصے سے نکلنا ہے، پس تمہیں اپنا حصہ اپنے حصے کو چھوڑنے سے حاصل ہو گا، ساتھ ہی فتوّت (الفتوة) کی صفت کی تحقیق بھی ہو گی۔ ابراہیم علیہ السلام نے اپنی جان کو آگ پر قربان کر دیا، اپنے رب کی توحید کو ایثار (الإيثار) دیتے ہوئے۔ پس اگر یہ کسی الٰہی حکم سے تھا تو یہ فتوّت (الفتوة) میں اور بھی عظیم ہے، اور اگر الٰہی حکم سے نہیں تھا تو وہ بہرحال فتیٰ (الفتى) ہے۔ کیونکہ جس نے اپنے رب کے حکم کو اپنی نفسانی خواہش پر ایثار (الإيثار) دیا، وہی فتیٰ ہے۔\n\n### [فتوّت (الفتوة) کی حقیقت یہ ہے کہ مشروع علم کو نفس کی طبعی خواہش پر ایثار (الإيثار) دیا جائے]\n\nپس فتوّت (الفتوة) کی حقیقت یہ ہے کہ انسان رسولوں کی سنتوں پر اللہ کی طرف سے وارد ہونے والے مشروع علم کو اپنی نفسانی خواہش اور اپنی عقل کی دلیلوں پر اور اس حکم پر جو اس کی فکر اور نظر نے دیا ہو، ایثار (الإيثار) دے، جب وہ مقررہ شریعت کے علم کے خلاف ہو۔ یہی فتیٰ (الفتى) ہے۔ پس وہ مشروع علم کے سامنے غسال کے سامنے میت کی طرح ہو گا۔ اور یہاں یہ نہیں کہا جانا چاہیے کہ وہ ذات حق (الحق) کے سامنے غسال کے سامنے میت کی طرح ہو گا، کیونکہ یہ غلطی اور قدم پھسلنے کی جگہ ہے۔ کیونکہ شریعت نے تمہیں مقید کیا ہے، پس تم اس کی قید پر ٹھہر جاؤ۔ پس جو کچھ اس نے تم پر واجب کیا ہے کہ تم اسے اپنی ذات یا اللہ کے سوا کسی مخلوق کی طرف منسوب کرو، تو فتوّت (الفتوة) میں سے یہ ہے کہ تم اسے حقیقت میں اسی کی طرف منسوب کرو نہ کہ اللہ کی طرف، جیسا کہ اس نے تمہیں حکم دیا ہے۔ اور اگر تمہاری عقل تمہیں اس کے خلاف رہنمائی کرے تو اسے پھینک دو اور مشروع علم کے ساتھ رہو۔ اور جو کچھ اس نے تم پر واجب کیا ہے کہ تم اسے اس (سبحانہ) کی طرف منسوب کرو، تو اسے اسی کی طرف منسوب کرو۔ اور جس میں اس نے تمہیں اختیار دیا ہے، تو اگر تم چاہو تو ٹھہر جاؤ اور کوئی تعین نہ کرو، اور اگر تم چاہو تو اس میں غور کرو جو اس اختیاری امر سے متعلق ہے، جیسے حمد، تو اسے اس کی طرف منسوب کرو، اور جو اس سے متعلق ہے جیسے مذمت، تو اسے اپنی ذات کی طرف منسوب کرو، اللہ کے ساتھ ادب (الأدب) کرتے ہوئے۔ کیونکہ ادب (الأدب) تمام خیر کا مجموعہ ہے۔ پس تم مقام فتوّت (الفتوة) سے نہیں ہٹے ہو۔\n\n### [فتوّت (الفتوة) اللہ کی طرف سے بندے کو اختیار دینا اور بندے کا اپنے مولیٰ کے لیے انتخاب کرنا ہے]\n\nشیخ ابو مدین رحمۃ اللہ علیہ جب ان کے پاس کوئی عمدہ کھانا آتا تو وہ اسے کھا لیتے، اور جب کوئی سادہ کھانا آتا تو اسے بھی کھا لیتے۔ اور جب وہ بھوکے ہوتے اور ان کے پاس نقد رقم آتی، تو وہ جان لیتے کہ اللہ نے انہیں اختیار دیا ہے، کیونکہ اگر وہ چاہتے کہ انہیں کوئی بھی قسم کا کھانا کھلائیں تو وہ اسے ان کے پاس لے آتے۔ پس وہ کہتے کہ یہ نقد رقم کھانے کی قیمت ہے، جسے اللہ نے اختیار (تخییر) اور انتخاب (اختیار) کے لیے بھیجا ہے۔ پس وہ اس وقت دیکھتے کہ کھانے میں سے اللہ کو کیا زیادہ محبوب ہے، عبادت کے لیے مزاج کی درستی کے لحاظ سے، نہ کہ نفسانی فرض اور شہوت کی پیروی کے لحاظ سے۔ پس اگر اس وقت ہر کھانا ان کے موافق ہوتا، تو وہ دنیا کے مقام کی طرف رجوع کرتے اور اس کے ساتھ کیا معاملہ کرنا چاہیے، یعنی اس کی لذتوں میں زہد اختیار کرنا، ساتھ ہی مزاج کی درستی بھی ہو، جس کی درستی سے مشروع عبادت قائم ہوتی ہے۔ پس وہ مقام کے حکم کے مطابق سخت زندگی کی طرف مائل ہوتے، جسے نفس لذت نہ ہونے کی وجہ سے ناپسند کرتا ہے، اور وہ صرف ضرورت کی لذت پر اکتفا کرتے، کیونکہ وہ اسے ضرورت کے وقت کھاتے ہیں۔ کیونکہ ضرورت کی لذت سے بڑھ کر کوئی لذت نہیں، کیونکہ طبع اسے طلب کرتی ہے، اور جب طبع کو اس کی طلب حاصل ہو جاتی ہے تو وہ اس سے لذت حاصل کرتی ہے۔\n\n### [خاتم النبیین کے ساتھ رسالت کے منقطع ہونے کے بعد کوئی تحلیل (حلال کرنا) اور تحریم (حرام کرنا) نہیں ہے]\n\nپس فتیٰ (الفتى) وہی ہے جس کا ہم نے ذکر کیا، اور اس کا فعل اور تصرف جمادات، نباتات، حیوانات اور ہر موجود میں جاری ہوتا ہے، لیکن مشروع علم کے میزان پر۔ اور اگر اس پر کوئی الٰہی امر وارد ہو، جو اسے ظاہر ہو، جو اس کے لیے اس چیز کو حلال کر دے جس کی حرمت محمدی شریعت میں نفس الامر میں ثابت ہو چکی ہے، تو اس نے اس میں التباس (لبس) کیا ہے۔ پس وہ اسے چھوڑ دے اور ثابت شدہ شرعی حکم کی طرف رجوع کرے۔ کیونکہ اہل کشف (الکشف) کے نزدیک بالاتفاق یہ ثابت ہے کہ خاتم النبیین کے ساتھ رسالت اور نبوت کے منقطع ہونے کے بعد اہل اللہ میں سے کسی کے لیے کوئی تحلیل (حلال کرنا) یا تحریم (حرام کرنا) یا شرعی احکام میں سے کوئی چیز نہیں ہے۔ پس اس کا حامل اس پر بھروسہ نہ کرے اور قطعی طور پر جان لے کہ یہ نفسانی خواہش ہے، کیونکہ وہ حلال یا حرام کیا گیا امر نفس الامر میں یہی شرط رکھتا ہے۔ اور یہ اہل اللہ کے لیے الٰہی تعریف (التعریف الإلهي) کو نہیں روکتا کہ وہ غیر متواتر میں مشروع حکم کی صحت کو منصوص علیہ کے ساتھ جانیں۔ لیکن متواتر منصوص میں، اگر اس کے خلاف تعریف وارد ہو، تو اس پر بھروسہ نہیں کیا جائے گا۔ اہل اللہ میں سے اہل کشف (الکشف) اور الوجود (الوجود) کے نزدیک اس میں کوئی اختلاف نہیں ہے۔\n\n### [وہ لوگ جن پر ان کے احوال میں التباس (لبس) طاری ہوتا ہے اور وہ اللہ کی خفیہ تدبیر (مکر) سے بے خبر رہتے ہیں]\n\nکیونکہ اللہ سے نسبت رکھنے والوں میں سے کچھ ایسے ہیں جن پر ان کے احوال میں التباس (لبس) طاری ہوتا ہے، جہاں سے انہیں شعور نہیں ہوتا، اور یہ ایک خفیہ تدبیر (مکر خفی) اور مضبوط الٰہی چال (کید متین) ہے، اور استدراج ہے جہاں سے انہیں شعور نہیں ہوتا۔ پس خبردار! تم شرعی میزان کو اپنے ہاتھ سے نہ پھینک دینا، رسمی علم میں اور اس حکم کو نافذ کرنے میں جو اس نے دیا ہے، اگرچہ تم اس سے وہ معنی سمجھو جو لوگ نہیں سمجھتے، جو تمہارے اور اس کے ظاہری حکم کو نافذ کرنے کے درمیان حائل ہو، تو اس پر بھروسہ نہ کرنا۔ کیونکہ یہ نفسانی تدبیر (مکر نفسی) ہے جو الٰہی صورت میں ہے، جہاں سے تمہیں شعور نہیں ہوتا۔ اور ہم نے اہل اللہ میں سے کچھ سچے لوگوں کو پایا ہے جن پر یہ مقام مشتبہ ہو گیا، اور وہ اپنے کشف (الکشف) کو اور اس کو جو ان کی سمجھ میں ظاہر ہوا، ترجیح دیتے ہیں، جو اس مقررہ حکم کو باطل کرتا ہے، پس وہ اپنے نفوس کے حق میں اس پر بھروسہ کرتے ہیں اور اس مقررہ حکم کو ظاہر میں دوسروں کے لیے تسلیم کرتے ہیں۔ اور یہ ہمارے نزدیک اور اہل اللہ کے نزدیک کوئی چیز نہیں ہے۔ اور جس نے بھی اس پر بھروسہ کیا، اس نے گڑبڑ کی اور اہل اللہ کے زمرے میں شامل ہونے سے نکل گیا اور ان لوگوں سے جا ملا جو **الْأَخْسَرِينَ أَعْمَالًا** (اعمال میں سب سے زیادہ خسارہ پانے والے ہیں)، **الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا** (جن کی کوشش دنیا کی زندگی میں گم ہو گئی اور وہ سمجھتے ہیں کہ وہ اچھا کام کر رہے ہیں)۔\n\n### [وہ جو گمان کرتا ہے کہ وہ حاصل میں ہے جبکہ وہ فوت شدہ میں ہے]\n\nاور بسا اوقات اس کشف (الکشف) کا حامل اس حکم کے ظاہر پر عمل کرتا رہتا ہے اور اپنے نفس کے حق میں اس کا اعتقاد نہیں رکھتا، پس وہ ظاہر کو برقرار رکھنے کے لیے اس پر عمل کرتا ہے اور کہتا ہے کہ میں نے اپنے نفس سے اس مشروع امر کے لیے صرف اپنا ظاہر دیا ہے، کیونکہ میں اس کے راز سے مطلع ہو چکا ہوں، پس اس کا حکم میرے راز پر میرے ظاہر کے حکم کے خلاف ہے۔ پس وہ عمل کرتے وقت اپنے راز میں اس کا اعتقاد نہیں رکھتا۔ پس جس نے بھی اس طرح عمل کیا، **فَقَدْ حَبِطَ عَمَلُهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ** (تو اس کا عمل ضائع ہو گیا اور وہ آخرت میں خسارہ پانے والوں میں سے ہے)، **فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ** (پس ان کی تجارت نے کوئی نفع نہیں کمایا اور وہ ہدایت یافتہ نہیں تھے)۔ اور وہ اہل اللہ میں سے ہونے سے نکل گیا اور ان لوگوں سے جا ملا جنہوں نے **اتَّخَذَ إِلَٰهَهُ هَوَاهُ وَأَضَلَّهُ اللَّهُ عَلَىٰ عِلْمٍ** (اپنی خواہش کو اپنا معبود بنا لیا اور اللہ نے اسے علم کے باوجود گمراہ کر دیا)۔ پس وہ گمان کرتا ہے کہ وہ حاصل میں ہے جبکہ وہ فوت شدہ میں ہے۔ پس اے ہمارے بھائیو! اس مقام کی آفتوں اور اس کشف (الکشف) کی تدبیر (مکر) سے بچو۔ میں نے تمہیں اور اس گروہ کو نصیحت کی ہے اور جو امر مجھ پر واجب تھا اسے پورا کیا ہے۔ پس جس نے فتوّت (الفتوة) کو اس طرح نہیں جانا جیسا کہ ہم نے ذکر کیا، تو اس نے اسے نہیں جانا۔",
    "fa": "(باب صد و چهل و ششم در معرفت مقام فتوّت و اسرار آن)\n\nبدان، خداوند تو را یاری کند:\n\n> فتوّت آن است که صاحبش هرگز *** نزد پروردگار و مردم، پیشرو باشد\n> جوانمرد (الفتى) کسی است که ایثار زیور اوست *** پس هر جا که باشد، بر سرها حمل می‌شود\n> هوس‌ها با قدرت خود او را متزلزل نمی‌کنند *** زیرا او ثابت و استوار چون کوه پابرجاست\n> نه اندوهی بر او حکم می‌راند و نه ترسی او را مشغول می‌سازد *** از مکارم اخلاق در هنگام جنگ و سختی\n> بنگر به شکستن بت‌ها توسط او در تنهایی *** بدون یاور؛ این است آن نرمیِ سخت (اللين القاسي)\n\n### [فتوّت (الفتوة) صفتی الهی است از طریق معنا، نه از طریق لفظ]\n\nفتوّت (الفتوة) صفتی الهی است از طریق معنا، و برای او سبحانه از لفظ آن، اسم الهی‌ای نیست که بدان نامیده شود. چنانکه شرع و دلیل عقل ثابت کرده است که او غنی مطلق (الغني عن العالم على الإطلاق) از عالمیان است. از طریق شرع، این سخن خداوند متعال است: «همانا خداوند از جهانیان بی‌نیاز است.» (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ). و دلیل عقل این است که اگر هستی (الوجود) او واجب بالذات نبود، با وجود اتصافش به هستی، ممکن بود؛ زیرا او متصف به هستی است. و اگر ممکن بود، نیازمند مرجّح در هستی خود می‌شد، پس نام غنی مطلق (الغني على الإطلاق) برای او صحیح نبود. و اگر به نوعی نیازمند بود، غنی مطلق نبود و در زمره عالَم قرار می‌گرفت، در نتیجه نشانه‌ای می‌شد که بر مرجّح خود دلالت کند. پس او غنی مطلق است. و کسی که این غنا را دارد، سپس عالَم را ایجاد کرد، آن را به دلیل نیاز خود به آن ایجاد نکرد، بلکه عالَم را برای عالَم ایجاد کرد، از باب ایثار آن بر انفراد خود به هستی (الوجود). و این عین فتوّت (الفتوة) است.\n\n### [صورت فتوّت (الفتوة) در خلق خداوند عالَم را]\n\nو از فتوّت (الفتوة) الهی، دو خبر قرآنی و نبوی است. اما قرآن، سخن اوست: «و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند.» (وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ). و صورت فتوّت در اینجا این است که آنان را آفرید تا به هستی (الوجود) نعمت دهد و از شرّ عدم خارج سازد و آنان را قادر سازد تا به اخلاق اسماء الهی متخلّق شوند و از آنان خلیفه‌ای قرار دهد. و این همه ایثار برای آنان است بر انفراد او به هر آنچه آنان را در آن خلیفه ساخت. سپس دانست که منّت نهادن، نعمت را نزد نعمت‌گیرنده خدشه‌دار می‌کند، پس آن را از باب ایثار برای آنان با این سخن پوشاند: «و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند.» (وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ). پس آشکار ساخت که آنان را به خاطر خود آفریده، نه به خاطر ایشان.\n\n### [خلق اشیاء به خاطر انسان و خلق انسان به خاطر رحمان]\n\nو در خبر نبوی موسوی (مربوط به حضرت موسی) آمده است که خداوند متعال اشیاء را به خاطر ما آفرید و ما را به خاطر خود آفرید.\n\nو با این، سخن خود را پوشاند: «و هیچ چیز نیست مگر آنکه با ستایش او تسبیح می‌گوید.» (وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ) تا همگان با آگاه ساختن او بفهمند که آنان با ستایش او تسبیح می‌گویند، تا بوی منّت در آن استشمام نکنیم. پس در خبر موسوی، حکم فتوّت (الفتوة) این است که اشیاء را به خاطر ما آفرید، از باب ایثار ما بر انفراد او به هستی (الوجود)، همان‌گونه که ما را آفرید. و سخن او: «و هیچ چیز نیست مگر آنکه با ستایش او تسبیح می‌گوید.» (وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ) پوششی است تا بوی منّت در آن استشمام نشود، درست مانند سخن او در حق ما: «مگر برای آنکه مرا بپرستند.» (إِلَّا لِيَعْبُدُونِ).\n\n### [اثبات اعیان ثابته (الأعيان الثابتة) که معتزله بدان قائل شدند]\n\nو اما خبر نبوی دوم از آن دو خبر، روایتی است از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از خداوند سبحانه که فرمود: «گنجی پنهان بودم که شناخته نشده بودم، پس دوست داشتم که شناخته شوم، پس خلق را آفریدم و خود را به آنان شناساندم، پس مرا شناختند.»\n\nپس در سخن او: «گنجی پنهان بودم» اثبات اعیان ثابته (الأعيان الثابتة) است که معتزله بدان قائل شده‌اند، و آن سخن اوست: «همانا سخن ما برای چیزی...» (إِنَّما قَوْلُنا لِشَيْ‏ءٍ).\n\n### [محبّت جز به معدوم (غیر موجود) تعلق نمی‌گیرد]\n\nاین خبر از فتوّت (الفتوة) است؛ چگونه از خود کنایه آورد که دوست داشت شناخته شود؟ و کسی که صفتش چنین است، بر آنچه از غنای مطلق (الغني المطلق) برای او واجب است، پوشش نهاد؛ زیرا محبّت جز به معدوم (غیر موجود) تعلق نمی‌گیرد. و آن معدوم ممکن است در معدوم یا در موجود باشد. اگر در معدوم باشد، باز هم هستی (الوجود) آن ضروری است تا آنچه دوست داشت ایجاد شود، در آن ظاهر گردد. و اگر در موجود باشد، آنچه را دوست داشتی در آن ظاهر کردی. پس آنچه ذکر کرد، ناگزیر پوششی است بر غنای مطلق و ایثار این جناب محبوب است، آنجا که کسی که غنا از آن اوست، به آن تعلق گرفت. پس به آن (محبوب) عزتی در نفس خود می‌بخشد، زیرا مقصود کسی قرار گرفته که صفت غنا از آن اوست.\n\n### [سبب هستی (الوجود) ظهور کمال وجودی و علمی است]\n\nو سبب هستی (الوجود) این بود که هستی (الوجود) و علم، با حال از خداوند، کمال مرتبه خود را در تقسیم عقلی طلب کردند. پس خداوند آن دو را از باب منّت برای ظهور کمال وجودی و علمی ایجاد کرد. این اصل آن، منّتی از جانب اوست. پس از این روی گرداند و هستی عالَم را به محبّت خود برای شناخته شدن نسبت داد، تا کمال هستی (الوجود) و علم نیز بوی منّت را استشمام نکند، همان‌گونه که در قرآن ذکر شد. و چون حق (الحق) با بندگان خود در مکارم اخلاق که همان فتوّت (الفتوة) است، تا این حد نزول کرده است، پس بنده سزاوارتر است که به این صفت متخلّق شود.\n\n### [فتوّت (الفتوة) آشکار ساختن نعمت‌ها و پوشاندن منّت و برتری است]\n\nپس فتوّت (الفتوة) در حقیقت، آشکار ساختن نعمت‌ها (الآلاء) و بخشش‌ها (المنن) و پوشاندن منّت و امتنان است، چنانکه فرمود: «صدقات خود را با منّت و آزار باطل نسازید.» (لا تُبْطِلُوا صَدَقاتِكُمْ بِالْمَنِّ والْأَذى‏)؛ این تخلق الهی است. زیرا او سبحانه بر ما با هستی (الوجود) و معرفت (المعرفة) به خود صدقه داد و بر ما منّت ننهاد. و اما سخن او: «بلکه خداوند بر شما منّت می‌نهد.» (بَلِ الله يَمُنُّ عَلَيْكُمْ) معنایش این است که اگر منّتی بود، منّت از آنِ خدا بود، هنگامی که آنان بر پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به واسطه اسلام آوردنشان منّت نهادند. خداوند متعال فرمود: «بر تو منّت می‌نهند که اسلام آورده‌اند.» (يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا). خداوند به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «بگو بر من به اسلام آوردنتان منّت نگذارید.» (قُلْ لا تَمُنُّوا عَلَيَّ إِسْلامَكُمْ). سپس محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را بر خود سبحانه ایثار کرد تا در آنچه بر زبان ذمّ جاری ساخت، صفتی برای خود قرار ندهد، پس به او فرمود: به آنان بگو: «بلکه خداوند بر شما منّت می‌نهد که شما را به ایمان هدایت کرد.» (بَلِ الله يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ لِلْإِيمانِ). و اگر می‌خواست، می‌فرمود: بلکه من بر شما منّت می‌نهم که خداوند شما را به واسطه من به ایمانی که با توحیدش روزی شما کرد و شما را بدان سعادتمند ساخت، هدایت کرد. پس خداوند او را محل منّت قرار نداد. این از فتوّت (الفتوة) الهی است که کسی آن را درک نمی‌کند.\n\n### [حکم فتوّت (الفتوة) در حق (الحق) موجود است و اطلاق آن بر او در شرع نیامده است]\n\nپس حکم آن در حق (الحق) موجود است، اما اطلاق آن نه در کتاب و نه در سنّت وارد نشده است. چنانکه قطعاً دانسته می‌شود که فرقی بین سخن ما: «چیزی را دانستم و آن را شناختم» و «من به چیزی عالم یا عارف هستم» وجود ندارد. با این حال، اطلاق اسم عالم، علیم و علّام بر او تعالی وارد شده است، اما اطلاق اسم عارف بر او وارد نشده است. پس لازم نیست امری که حکمی از آن برای خداست، اسمی از آن بر او اطلاق شود. پس اسماء او از حیث اطلاق بر او، موقوف بر ورود آنها از جانب اوست. پس جز به آنچه خود را بدان نامیده، نامیده نمی‌شود، اگرچه مدلول آن اسم در او دانسته شود. پس توقیف در اطلاق (پایبندی به آنچه وارد شده) سزاوارتر است.\n\n### [فتوّت (الفتوة) و شطح (الشطح)]\n\nو خداوند سبحانه این همه را انجام نداد مگر برای آنکه خلق ادب با او را بیاموزند. زیرا دانسته شده است که برخی از اهل الله شطحیات (سخنان غریب و مدعیانه) دارند تا ادب بیاموزند و شطح نگویند. زیرا شطح (الشطح) نقص در انسان است، چون در آن خود را به مرتبه الهی ملحق می‌سازد و از حقیقت خود خارج می‌شود، پس شطح او را به جهل به خدا و به نفس خود ملحق می‌سازد. و این از بزرگان رخ داده است و من نام نمی‌برم، زیرا آن صفت نقص است. و اما عوام مردم، ما با آنان سخنی نداریم، زیرا آنان در مقایسه با این سادات، عوام هستند. و اگر چنین چیزی از سادات رخ دهد، عتاب از جانب ما بر آنان واقع می‌شود. و همچنین ممکن است فرد پایین‌تر بر فرد بالاتر شطح گوید، مانند شطحیات بر مراتب انبیاء، که نزد خدا در مؤاخذه بزرگتر است از شطح آنان بر خدا. زیرا مرتبه الهی آنان را با حال و نزد شنونده تکذیب می‌کند. اما شطح آنان بر انبیاء، محل شبهه است و ممکن است در نفس‌الامر پذیرفته شود، پس شنونده خوش‌گمان که معرفتی (المعرفة) به مراتب اصناف خلق نزد خدا ندارد، فریب می‌خورد. و خداوند به خاطر آن غیرت می‌ورزد، زیرا آن حق دیگری است، و آنچه از گمراهی در مردم تأثیر می‌گذارد، صاحب شطح به خاطر آن مؤاخذه می‌شود، به ویژه اگر در حال صحو (هوشیاری) از او ظاهر شود.\n\n### [عالم بالله (العالم بالله) کامل کسی است که خود را حفظ می‌کند از اینکه حجتی برای خدا بر خود قرار دهد]\n\nو همچنین از شطحیات (الشطحات) نقل شده از سادات، دیدن فضیلت جنس خودشان از بشر بر ملائکه است، از روی جهل آنان، و آنان نزد خدا مسئول و مؤاخذه خواهند شد. و عالم بالله (العالم بالله) کامل کسی است که خود را حفظ می‌کند از اینکه حجتی برای خدا بر خود قرار دهد. و هر کس می‌خواهد از آن سالم بماند، باید نزد امر و نهی توقف کند و مرگ را انتظار کشد و سکوت را پیشه سازد، مگر از ذکر خدا به ویژه از قرآن. پس هر کس چنین کند، هیچ مطلوبی برای خیر و هیچ گریزگاهی از شر باقی نگذاشته است. و خود را مبرا ساخته و حق هر صاحب حقی را داده است، چنانکه خداوند «به هر چیزی خلقتش را عطا کرد.» (كُلَّ شَيْ‏ءٍ خَلْقَهُ). و این همان عاقل است که مقصود حق (الحق) از عالَم است. و مرتبه‌ای بالاتر از این مرتبه برای مخلوق اصلاً وجود ندارد.\n\n### [جوانمرد (الفتى) کسی است که بر خلق فتوّت (الفتوة) نمی‌ورزد مگر با صفتی از حق یا امری از حق]\n\nاین مقدار شایسته‌ای از فتوّت (الفتوة) در حکم آن در جناب الهی طی شد. ای ولیّ من، اگر حق (الحق) با وجود غنا و صفات جلال و نُعوت کمالی که دارد، این نسبت را در ایثار تو به تو نشان داد، پس تو سزاوارتر به این صفت هستی که بدان متصف شوی، به ویژه در حق او، نه در حق خلق، چنانکه او در حق خلق بدان متصف شد. این اساس فتوّت در ماست. پس جوانمرد (الفتى) کسی است که مراعات خلق را نمی‌کند و بر آنان فتوّت نمی‌ورزد؛ زیرا فتوّت ورزیدن بر آنان تنها برای خداست، چنانکه ذکر کردیم. پس این بنده در پی فتوّت ورزیدن بر جانب حق (الحق) است، از باب ایثار او بر خلق. پس بر خلق فتوّت نمی‌ورزد مگر با صفتی از حق یا امری از حق. در نتیجه، حق است که فتوّت می‌ورزد، نه این بنده. تخلق به فتوّت (الفتوة) این‌گونه است، وگرنه محال است که فتوّت از جوانمرد در ایثار غیر، بدون آزار غیر جاری شود؛ زیرا اغراض متفاوت و هواها متقابل‌اند. بادهای آنها گردبادهایی هستند که بارور نمی‌کنند، بلکه عقیم‌اند، ویران می‌کنند و ایجاد نمی‌کنند. پس هیچ حالتی نیست که زید از تو راضی باشد، مگر اینکه عمرو از آن خشمگین شود.\n\n### [اصل فتوّت (الفتوة) این است که از بهره نفس خود خارج شوی، از باب ایثار بهره غیر خود]\n\nپس اگر امر چنین است، اگر می‌خواهی این مقام را به دست آوری، خلق را کنار بگذار و در اصل فتوّت (الفتوة) به خدا بازگرد. زیرا اصل آن این است که از بهره نفس خود خارج شوی، از باب ایثار بهره غیر خود، نه اینکه از بهره غیر خود خارج شوی، از باب ایثار بهره غیر دیگر. این از فتوّت نیست. و اگر فتوّت این بود، هستی (الوجود) آن صحیح نبود. پس هرگاه امور متعارض شدند، جانب حق (الحق) را ترجیح ده و از بهره خود به خاطر آنچه جلال او سزاوار است، دست بردار؛ زیرا او با وجود غنایش، با صفت فتوّت با تو رفتار کرده است. پس تو با فقر خود، به آن نیازمندتری. و از ایثار تو نسبت به او این است که اگر از تو خواست که در قبال فتوّتی که بر او ورزیده‌ای، مزدی از او بخواهی، از فتوّت است که مزد را بخواهی؛ زیرا امتثال امر او، خروج تو از بهره خود است. پس بهره‌ات با ترک بهره‌ات، همراه با تحقق وصف فتوّت، به دست می‌آید. ابراهیم علیه السلام جان خود را بر آتش بخشید، از باب ایثار توحید پروردگارش. اگر این کار به امر الهی بود، در فتوّت عظیم‌تر است، و اگر به امر الهی نبود، در هر حال جوانمرد (فتى) است؛ زیرا هر کس امر پروردگارش را بر هوای نفس خود ایثار کند، او جوانمرد است.\n\n### [حقیقت فتوّت (الفتوة) ایثار علم مشروع (العلم المشروع) بر هوای نفس سرشته شده است]\n\nپس حقیقت فتوّت (الفتوة) این است که انسان علم مشروع (العلم المشروع) وارد شده از جانب خدا بر زبان رسولان را بر هوای نفس خود و بر ادله عقل خود و آنچه فکر و نظرش حکم کرده است، ایثار کند، هرگاه با علم مقرر شده شارع مخالفت کند. این است جوانمرد (الفتى). پس او در برابر علم مشروع (العلم المشروع) مانند مرده در دست غسّال است. و شایسته نیست که در اینجا گفته شود: «در برابر حق (الحق) مانند مرده در دست غسّال است»، زیرا این اشتباه و لغزشگاه است. زیرا شرع تو را مقید کرده است، پس نزد قید آن توقف کن. آنچه را که از آنِ اوست و بر تو واجب کرده که آن را به خود یا به مخلوقی غیر از خدا نسبت دهی، از فتوّت است که آن را به همان نسبت دهی، نه به خدا، چنانکه به تو امر کرده است. و اگر عقلت تو را بر خلاف آن دلالت کرد، آن را دور انداز و با علم مشروع (العلم المشروع) باش. و آنچه را واجب کرده که به او سبحانه نسبت دهی، به او تعالی نسبت ده. و آنچه تو را در آن مخیّر کرده است، اگر خواستی توقف کن و تعیین نکن، و اگر خواستی، به آنچه از ستایش مربوط به امر مخیّر است، بنگر و آن را به او نسبت ده، و آنچه از نکوهش مربوط به آن است، از باب ادب با خدا، به خود نسبت ده؛ زیرا ادب عبارت از جامع خیر است. پس از مقام فتوّت (الفتوة) منحرف نشده‌ای.\n\n### [فتوّت (الفتوة) تخییر بنده از جانب خدا و اختیار بنده برای مولای خود است]\n\nشیخ ابومدین (رحمه الله) هرگاه خوراکی نیکو برایش می‌آمد، می‌خورد و هرگاه خوراکی خشن می‌آمد، می‌خورد. و هرگاه گرسنه می‌شد و پولی (نقد) برایش می‌آمد، می‌دانست که خداوند او را مخیّر کرده است؛ زیرا اگر می‌خواست هر نوع خوراکی را که می‌خواهد به او بخوراند، آن را برایش می‌آورد. پس می‌گفت: این پول، بهای خوراکی است که خدا برای تخییر و اختیار آورده است. پس در آن هنگام می‌نگریست که کدام یک از خوراکی‌ها نزد خدا محبوب‌تر است، با توجه به صلاح مزاج برای عبادت، نه به فرض نفسانی و پیروی از شهوت. پس اگر در آن هنگام هر خوراکی با او موافق بود، به موطن دنیا و آنچه شایسته است با آن رفتار شود، یعنی زهد در لذت‌های آن، همراه با صلاح مزاجی که عبادت مشروع با صلاح آن برپا می‌شود، باز می‌گشت. پس به حکم موطن، به سختی معیشت که نفس به دلیل نبود لذت از آن کراهت دارد، عدول می‌کرد و به لذت حاجت اکتفا می‌نمود؛ زیرا آن را در هنگام ضرورت تناول می‌کند. پس لذت ضرورت، لذتی بالاتر از آن نیست، زیرا طبع آن را می‌طلبد و هرگاه طبع به مطلوب خود دست یابد، از آن لذت می‌برد.\n\n### [پس از انقطاع رسالت با خاتم پیامبران، هیچ تحلیل و تحریمی وجود ندارد]\n\nپس جوانمرد (الفتى) کسی است که ذکر کردیم و فعل و تصرف او در جماد، نبات، حیوان و در هر موجودی جاری می‌شود، اما بر میزان علم مشروع (العلم المشروع). و اگر امری الهی بر او وارد شود که در ظاهر برای او چیزی را حلال کند که حرمت آن در نفس‌الامر از شرع محمدی ثابت شده است، پس در آن دچار تلبیس (اشتباه) شده است. پس آن را ترک می‌کند و به حکم شرع ثابت باز می‌گردد. زیرا نزد همه اهل کشف (أهل الکشف) ثابت شده است که پس از انقطاع رسالت و نبوت، هیچ تحلیل و تحریم و هیچ حکمی از احکام شرع برای هیچ یک از اهل الله وجود ندارد. پس صاحب آن نباید بر آن اعتماد کند و قطعاً بداند که آن هوای نفسانی است؛ زیرا آن امر حلال یا حرام در نفس‌الامر، این شرط را دارد. و تعریف الهی برای اهل الله، صحت حکم مشروع در غیر متواترِ منصوص را منع نمی‌کند. اما در متواتر منصوص، اگر تعریف (کشف) بر خلاف آن وارد شود، نباید بر آن اعتماد کرد. این امر نزد اهل الله از اهل کشف (أهل الکشف) و شهود (الوجود) اختلافی ندارد.\n\n### [کسانی که تلبیس (فریب) در احوالشان بر آنان عارض می‌شود و از مکر پنهان خدا بی‌خبرند]\n\nزیرا از کسانی که خود را به خدا منتسب می‌کنند، کسانی هستند که تلبیس (فریب) در احوالشان بر آنان عارض می‌شود، در حالی که نمی‌دانند. و این مکر پنهان و کید محکم الهی و استدراج است، در حالی که متوجه نیستند. پس بپرهیز از اینکه میزان شرع را در علم رسمی از دست خود بیندازی و در اجرای آنچه حکم کرده است، شتاب کن. و اگر از آن چیزی خلاف آنچه مردم می‌فهمند، درک کردی که مانع اجرای ظاهر حکم می‌شود، بر آن اعتماد نکن؛ زیرا آن مکر نفسانی در صورت الهی است، در حالی که تو نمی‌دانی. و ما با گروهی از صادقان اهل الله برخورد کرده‌ایم که این مقام بر آنان مشتبه شده است و کشف (الکشف) خود و آنچه در فهمشان برایشان ظاهر شده و آن حکم مقرر را باطل می‌کند، ترجیح می‌دهند. پس در حق خود بر آن اعتماد می‌کنند و آن حکم مقرر را در ظاهر برای دیگران تسلیم می‌کنند. و این نزد ما و نزد اهل الله ارزشی ندارد. و هر کس بر آن اعتماد کند، آمیزش کرده و از انتظام در سلک اهل الله خارج شده و به «زیانکارترین مردم در عمل» (الْأَخْسَرِينَ أَعْمالًا) پیوسته است؛ «آنان که تلاششان در زندگی دنیا گم شد، در حالی که گمان می‌کردند کار نیک انجام می‌دهند.» (الَّذِينَ ضَلَّ سَعْيُهُمْ في الْحَياةِ الدُّنْيا وهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعاً).\n\n### [کسی که گمان می‌کند در حال وصول است، در حالی که در حال فوت است]\n\nو چه بسا صاحب این کشف (الکشف) بر عمل به ظاهر آن حکم باقی بماند، اما در حق خود آن را اعتقاد نداشته باشد. پس آن را برای تأیید ظاهر انجام می‌دهد و می‌گوید: من از نفس خود برای این امر مشروع (الأمر المشروع) جز ظاهر خود را نداده‌ام؛ زیرا من بر سرّ آن مطلع شده‌ام، پس حکم آن بر سرّ من خلاف حکم آن در ظاهر من است. پس در سرّ خود هنگام عمل به آن، اعتقادی به آن ندارد. پس هر کس از آنان بر این اساس عمل کند، «عملش تباه شده و او در آخرت از زیانکاران است.» (حَبِطَ عَمَلُهُ وهُوَ في الْآخِرَةِ من الْخاسِرِينَ). «پس تجارتشان سودی نکرد و هدایت‌یافته نبودند.» (فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ). و از اهل الله بودن خارج شده و به کسانی پیوسته که «هوای نفس خود را معبود خویش گرفته‌اند و خداوند او را با وجود علم گمراه کرده است.» (اتَّخَذَ إِلهَهُ هَواهُ وأَضَلَّهُ الله عَلى‏ عِلْمٍ). پس او گمان می‌کند که در حال وصول (الحاصل) است، در حالی که در حال فوت (الفائت) است. پس ای برادران ما، از فریب‌های این مقام و مکر این کشف (الکشف) بر حذر باشید. همانا شما را و این طایفه را نصیحت کردم و به امر واجبی که بر عهده‌ام بود، وفا نمودم. پس هر کس فتوّت (الفتوة) را آن‌گونه که ذکر کردیم، نداند، آن را نشناخته است."
  },
  "page_count": 4
}