{
  "id": 478,
  "title": {
    "ar": "الباب الثامن والسبعون وأربعمائة في معرفة حال قطب كان منزله إِنْ تَكُ مِثْقالَ حَبَّةٍ من خَرْدَلٍ فَتَكُنْ في صَخْرَةٍ أَوْ في السَّماواتِ أَوْ في الْأَرْضِ يَأْتِ بِهَا الله إِنَّ الله لَطِيفٌ خَبِيرٌ",
    "en": "Chapter Four Hundred and Seventy-Eight: Concerning the Knowledge of the State of a Pole (قطب) whose Station (منزله) is defined by: <<If there be the weight of a mustard seed, and it be in a rock, or in the heavens, or in the earth, Allah will bring it forth. Indeed, Allah is Subtle (لطيف), All-Aware (خبير)>>.",
    "ur": "باب چار سو اٹھتر (۴۷۸) اس قطب (Qutb) کے حال (Hāl) کی معرفت (Ma'rifah) میں جس کا منزل (Manzil) یہ تھا:\n\"اگر وہ (عمل) رائی کے دانے کے برابر بھی ہو، پھر وہ کسی چٹان میں ہو یا آسمانوں میں یا زمین میں، اللہ اسے لے آئے گا۔ بے شک اللہ بڑا باریک بین (لطیف) اور باخبر (خبیر) ہے۔\"\n(إِنْ تَكُ مِثْقالَ حَبَّةٍ من خَرْدَلٍ فَتَكُنْ فِي صَخْرَةٍ أَوْ فِي السَّماواتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا الله إِنَّ الله لَطِيفٌ خَبِيرٌ)",
    "fa": "باب چهارصد و هفتاد و هشتم (۴۷۸) در معرفت (معرفة) حال قطبی (قطب) که منزل او این است: «اگر [عمل] به اندازه سنگینی دانه خردلی باشد و در تخته‌سنگی یا در آسمان‌ها یا در زمین قرار گیرد، خداوند آن را می‌آورد. همانا خداوند لطیف (لطيف) و آگاه (خبير) است.» (إِنْ تَكُ مِثْقالَ حَبَّةٍ من خَرْدَلٍ فَتَكُنْ في صَخْرَةٍ أَوْ في السَّماواتِ أَوْ في الْأَرْضِ يَأْتِ بِهَا الله إِنَّ الله لَطِيفٌ خَبِيرٌ)"
  },
  "content": {
    "ar": "## «الباب الثامن والسبعون وأربعمائة في معرفة حال قطب كان منزله إِنْ تَكُ مِثْقالَ حَبَّةٍ من خَرْدَلٍ فَتَكُنْ في صَخْرَةٍ أَوْ في السَّماواتِ أَوْ في الْأَرْضِ يَأْتِ بِهَا الله إِنَّ الله لَطِيفٌ خَبِيرٌ»\n\n\n> الرزق يأتي به الرزاق ليس له *** اسم سواه ولا عين ولا أثر\n\n\n> ولا تقولن في الوهاب إن له *** حكما عليه فهذا ليس يعتبر\n\n\n> فإنه واجب والوهب ليس له *** حكم الوجوب وفيه العبد يختبر\n\n\n### [ما المراد ببقية الله‏]\n\n\nبَقِيَّتُ الله خَيْرٌ لَكُمْ ما أحل لك تناوله من الشي‏ء الذي يقوم به أودك لتقوم به في طاعة ربك وإنما سماه بقية لأنه بالأصالة خلق لك ما في الْأَرْضِ جَمِيعاً فكنت مطلق التصريف في ذلك تأخذ ما تريد وتترك ما تريد ثم في ثاني حال حجر عليك بعض ما كان أطلق فيه تصرفك وأبقى لك من ذلك ما شاء أن يبقيه لك فذلك بقية الله وإنما جعلها خيرا لك لأنه علم من بعض عباده أن نفوسهم تعمي عن هذه البقية بما يعطيهم الأصل فيتصرفون بحكم الأصل فقال لهم البقية التي أبقى الله خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ أي مصدقين بأني خلقت لَكُمْ ما في الْأَرْضِ جَمِيعاً فإن صدقتموني في هذا صدقتموني فيما أبقيت لكم من ذلكم وإن فصلتم بين الأمرين فآمنتم ببعض وكفرتم ببعض لم تكونوا مؤمنين ثم إنكم لن تنالوا من ذلك مع جمعكم إياه وانكبابكم عليه إلا ما قدرته لكم وخسرتموني وسواء عليكم تعرضتم لتحصيل ما ضمنته لكم أو أعرضتم عنه لا بد لي أن أوصله إليكم فإني أطلبكم به كما أطلبكم بآجالكم وما ذلك من كرامتكم علي ولا من إهانتكم فإني أرزق البر والفاجر والمكلف وغير المكلف وأميت البر والفاجر والمكلف وغير المكلف وإنما عنايتي إن أوصل إليك من البقية لا من غيرها في مثل هذا تظهر عنايتي بالشخص الموصل إليه ذلك فإنه لن تموت نفس حتى تستكمل رزقها كما أ لن تموت نفس حتى يأتيها أجلها المسمى وسواء كان الرزق قليلا أو كثيرا وليس رزقك إلا ما تقوم به نشأتك وتدوم به قوتك وحياتك ليس رزقك ما جمعت وادخرت فقد يكون ذلك لك ولغيرك لكن حسابه عليك إذا كنت جامعه وكاسبه فلا تكسب إلا ما يقوتك ويقوت من كلفك الله السعي عليه لا غير وما زاد على ذلك مما فتحت به عليك فأوصله إنعاما منك إلى من شئت ممن تعلم منه أنه يستعمله في طاعتي فإن جهلت فأوصله فإنك لن تخيب من فائدته من كونك منعما بما سميته ملكا لك فأنت فيه كرب النعمة وليس غيري فأنت نائبي والنائب بصورة من استخلفه وقدر زقت النبات والحيوان والطائع والعاصي فكن أنت كذلك وتحرى الطائع جهد استطاعتك فإن ذلك أوفر لحظك وأعلى وفي حقك أولى وأثنى‏\n\n\n### [إن الله خلق للعبد ما تنعم به وتحيى به‏]\n\n\nواعلم أنه كما خلقت لك ما تحيي به ذاتك وتنعم به نفسك اعتناء بك فقد خلقت لك أيضا ما إذا تصرفت فيه أحييت به أسمائي ونعمت به نفوسهم وتكون أنت الآتي بذلك إليهم كما أنا الآتي برزقك إليك حيث كنت وكان رزقك فإني أعلم موضعك ومقرك وأعلم عين رزقك وأنت لا تعلمه حتى تأكله أو أعلمك به على التعيين فإذا تغذيت به وسرى في ذاتك حينئذ تعلم أنه رزقك كذلك علمتك فعلمت ما تستحقه الأسماء الحسنى من الرزق الذي تقوم به حياتها ونشأتها وأعطيتك علم ذلك وعينه وجعلتك الآتي به إليهم وكما طلبت منك الشكر على ما جئتك به من الرزق كذلك تطلب أنت الشكر على ما أتيت به من أسمائي وإذا شكرتك أسمائي فإنا شكرتك فسعدت سعادة لم يسعد مثلها إلا من عمل مثل هذا العمل وأسمائي لا بد أن يصل إليها ذلك من العالم ولكن لا يشكر أسمائي إلا من قصدها بذلك اعتناء منه بجانبها لا من جاء بها غافلا عنها إن ذلك لها هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ لا والله كما لا يستوي الَّذِينَ اجْتَرَحُوا السَّيِّئاتِ ب كَالَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ في مَحْياهُمْ ومَماتُهُمْ ساءَ ما يَحْكُمُونَ أي ساء من يحكم بذلك ثم أفصل وأقول قول لقمان لابنه فَتَكُنْ في صَخْرَةٍ أي عند ذي قلب قاس لا شفقة له على خلق الله قال تعالى ثُمَّ قَسَتْ قُلُوبُكُمْ من بَعْدِ ذلِكَ فَهِيَ كَالْحِجارَةِ أَوْ أَشَدُّ قَسْوَةً\nوقوله أَوْ أَشَدُّ قَسْوَةً فإن الحجر لا يقدر أن يمتنع عن تأثيرك فيه بالمعول والقلب يمتنع عن أثرك فيه بلا شك فإنه لا سلطان لك عليه فلهذا كان القلب أشد قسوة أي أعظم امتناعا وأحمى وإن أحسنت في ظاهره فلا يلزم أن يلين قلبه إليك فذلك إليه وحكي أن بعض الناس كسر حجرا صلدا يابسا فرأى في وسط ذلك الحجر تجويفا فيه دودة في فمها ورقة خضراء تأكلها وروى في النبوة الأولى أن لله تعالى تحت الأرض صخرة صماء في جوف تلك الصخرة حيوان لا منفذ له في الصخرة وإن الله قد جعل له فيها غذاء وهو يسبح الله ويقول سبحان من لا ينساني على بعد مكاني‏\n\n\nيعني من الموضع الذي تأتي منه الأرزاق لا على بعد مكانها من الله فإن نسبة الله إلى خلقه من حيث القرب بسكون الراء نسبة واحدة ومن حيث القرب بفتح الراء نسبة مختلفة فاعلم ذلك أو في السموات بما أودع الله في سباحة الكواكب في أفلاكها من التأثيرات في الأركان لخلق أرزاق العالم أو الأمطار أيضا فإن السماء في لسان العرب المطر قال الشاعر\n\n\nإذا سقط السماء بأرض قوم‏\n\n\nيعني بالسماء هنا المطر وقوله أو في الأرض بما فيها من القبول والتكوين للأرزاق فإنها محل ظهور الأرزاق كالأم محل ظهور الولد الذي للأب فيه أيضا أثر بما ألقاه من الماء في الرحم سواء كان مقصودا له ذلك أو لم يكن كذلك الكوكب يسبح في الفلك وعن سباحته يكون ما يكون في الأركان الأمهات من الأمور الموجبة للولادة وسواء كان ذلك مقصودا للكوكب أو لم يكن بحسب ما يعلمه الله عز وجل مما أوحى به في كل سماء من الأمر الإلهي الذي لا يعلمه إلا من أوحى به إليه فأينما كانت مثقال هذه الحبة من الخردل لقلتها بل لخفائها يأت بها الله نبه بهذا التعريف لتأتيه أنت بما كلفك إن تأتيه به فإنك ترجوه فيما تأتيه به ولا يرجوك فيما أتاك به فإنه غَنِيٌّ عَنِ الْعالَمِينَ وأنت من الفقراء إليه فإتيانك إليه بما كلفك الإتيان به آكد في حقك إن تأتي به لافتقارك وحاجتك لما يحصل لك من المنفعة بذلك إِنَّ الله لَطِيفٌ أي هو أخفى أن يعلم ويوصل إليه أي إلى العلم به من حبة الخردل خَبِيرٌ للطفه بمكان من يطلب تلك الخردلة منه لما له من الحرص على دفع ألم الفقر عنه فإن الحيوان ما يطلب الرزق إلا لدفع الآلام لا غير فلو لم يحس بالألم لما تصور منه طلب شي‏ء من ذلك فليس نفعه سوى دفع ألمه بذلك وهو الركن الأعظم ولو لا إن حكم الجنة في أنه نفس حصول الشهوة نفس حصول المشتهي بحيث لو تأخرت عنه إلى الزمان الثاني الذي يلي زمان حصول الشهوة لكان ذا ألم لفقد المشتهي زمان الشهوة كالدنيا فإنه لا بد أن يتأخر حصول المشتهي عن زمان الشهوة فلا بد من الألم فإذا حصل المشتهي فأعظم لالتذاذ به اندفاع ذلك الألم فافهم هذا وحققه فإنه ينفعك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Seventy-Eight: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<O my son, indeed if it should be the weight of a mustard seed and it be in a rock or [anywhere] in the heavens or in the earth, Allah will bring it forth. Indeed, Allah is Subtle (لطيف) and All-Aware (خبير)>>.\n\nSustenance (الرزق) is brought forth by the Provider (الرزاق); there is no name for it other than Him, nor essence (عين), nor trace (أثر).\n\nAnd do not say concerning the Bestower (الوهاب) that He has a ruling upon it, for this is not considered.\n\nFor He is Necessary (واجب), but the bestowal (الوهب) does not have the ruling of necessity (حكم الوجوب), and in this, the servant is tested.\n\n### [What is meant by the Remnant of Allah?]\n\nThe Remnant of Allah (بَقِيَّتُ الله) is better for you. [This refers to] that which He has made lawful for you to consume, which sustains your life so that you may stand in obedience to your Lord. He only named it a remnant because, originally (بالأصالة), He created for you <<all that is in the earth>> (ما في الْأَرْضِ جَمِيعاً). Thus, you had absolute disposal (مطلق التصريف) over it, taking what you wished and leaving what you wished. Then, in a second state, He restricted you from some of what your disposal had been absolute over, and He left for you of that what He willed to leave for you; that is the Remnant of Allah (بقية الله).\n\nHe only made it better for you because He knew that the souls of some of His servants would be blinded to this remnant by what the origin gives them, causing them to act according to the ruling of the origin. So He said to them: The remnant that Allah has left is <<better for you, if you are believers>> (خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ)—that is, affirmers—that I created for you <<all that is in the earth>>. If you affirm Me in this, you will affirm Me in what I have left for you of that. But if you separate the two matters, believing in some and disbelieving in some, you are not believers.\n\nFurthermore, you will not attain from that [sustenance], despite your accumulation of it and your devotion to it, except what I have decreed for you, and you have lost Me. It is the same whether you strive to acquire what I have guaranteed for you or turn away from it. I must deliver it to you, for I seek you out with it just as I seek you out with your appointed times (آجالكم). This is neither due to your honor in My sight nor your disgrace, for I provide sustenance to the righteous and the wicked, the responsible (المكلف) and the non-responsible. And I cause the righteous and the wicked, the responsible and the non-responsible, to die.\n\nMy concern is only that I deliver to you from the Remnant (البقية), not from anything else. In a case like this, My care (عنايتي) for the person to whom that is delivered becomes apparent, for no soul shall die until it has completed its sustenance (رزقها), just as no soul shall die until its appointed time comes to it. Whether the sustenance is little or much, it is the same.\n\nYour sustenance is only that by which your constitution is maintained and your strength and life endure. Your sustenance is not what you have gathered and stored. That may belong to you and to others, but its reckoning is upon you if you are the one who gathered and earned it. Therefore, earn only what sustains you and sustains those whom Allah has obligated you to strive for, and no more. Whatever exceeds that, which I have opened up for you, deliver it as a bounty (إنعاما) from yourself to whomever you wish, provided you know that they will use it in My obedience. If you are ignorant [of how they will use it], still deliver it, for you will not miss the benefit of being a bestower of what you called your possession (ملكا لك). Thus, in this matter, you are like the Lord of the Bounty, and there is none other than Me. So you are My deputy (نائبي), and the deputy is in the image of the one who appointed him. I have provided sustenance to the plant, the animal, the obedient, and the disobedient; so be you likewise. And strive to seek out the obedient to the best of your ability, for that is the most abundant and highest portion for you, and in your right, it is more fitting and praiseworthy.\n\n### [Indeed, Allah created for the servant that by which he is blessed and lives]\n\nKnow that just as I created for you that by which your essence (ذاتك) is brought to life and your soul is blessed, out of care for you, I have also created for you that which, when you dispose of it, you bring My Names (أسمائي) to life and bless their souls. And you become the one who brings that to them, just as I am the one who brings your sustenance to you, wherever you are and wherever your sustenance is. For I know your location and dwelling, and I know the essence (عين) of your sustenance, while you do not know it until you eat it, or until I inform you of it specifically. When you are nourished by it and it flows through your essence, only then do you know that it is your sustenance.\n\nLikewise, I taught you, so you knew what the Beautiful Names (الأسماء الحسنى) deserve of the sustenance by which their life and constitution are maintained. And I gave you the knowledge of that and its essence, and I made you the one who brings it to them. Just as I requested gratitude (الشكر) from you for the sustenance I brought you, so too do you request gratitude for what you brought forth from My Names. And if My Names thank you, then I have thanked you. And you have attained a felicity (سعادة) that none has attained the like of, except one who performed a similar deed.\n\nMy Names must necessarily receive that from the world (العالم), but only he who intends them with that, out of care for their aspect, will thank My Names—not he who brings it forth heedless of them, thinking that it is for them [themselves]. <<Are those who know equal to those who do not know?>> No, by Allah, just as those who commit evil deeds <<الَّذِينَ اجْتَرَحُوا السَّيِّئاتِ>> are not equal to those who believe and do righteous deeds <<كَالَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ>> in their life and their death. <<Evil is the judgment they make>>—meaning, evil is the one who judges thus.\n\nThen I elaborate and mention the saying of Luqman to his son: \"and it be in a rock\" <<فَتَكُنْ في صَخْرَةٍ>>. Meaning, [it is] with one who has a hard heart (قلب قاس), having no compassion for Allah’s creation (خلق الله). Allah the Exalted said: <<Then your hearts became hardened after that, being like stones or even harder in hardness>>. And His saying, \"or even harder in hardness\" <<أَوْ أَشَدُّ قَسْوَةً>>, is because the stone cannot prevent your influence upon it with a pickaxe, but the heart undoubtedly prevents your influence upon it, for you have no authority over it. For this reason, the heart is harder in hardness—that is, greater in resistance and protection. Even if you treat him well outwardly, it is not necessary that his heart soften toward you, for that is up to him.\n\nIt is related that a certain person broke a hard, dry stone and saw in the middle of that stone a cavity containing a worm with a green leaf in its mouth, which it was eating. It was narrated in the First Prophethood (النبوة الأولى) that Allah the Exalted has a solid rock (صخرة صماء) beneath the earth, and inside that rock is a creature for which there is no opening in the rock. And Allah has placed sustenance for it therein, and it glorifies Allah, saying: \"Glory be to Him Who does not forget me despite the remoteness of my place.\"\n\n[Remoteness] meaning, from the place whence sustenance comes, not remoteness of its place from Allah. For the relationship of Allah to His creation, in terms of proximity (قُرْب, with a quiescent *ra*), is a single relationship, but in terms of nearness (قَرَب, with a fatha on the *ra*), it is a different relationship, so know that.\n\nOr \"in the heavens\" <<أَوْ في السَّماواتِ>> refers to what Allah has deposited in the swimming of the stars in their orbits (أفلاكها) of influences upon the elements (الأركان) for the creation of the sustenance of the world (العالم). Or it refers to the rains, for *al-sama'* (السماء, heaven/sky) in the language of the Arabs means rain. A poet said:\n\n> When the heaven falls upon the land of a people\n\nMeaning here by *al-sama'* is the rain.\n\nAnd His saying \"or in the earth\" <<أَوْ في الْأَرْضِ>> refers to what it contains of receptivity and formation (التكوين) for sustenance, for the earth is the place where sustenance appears, just as the mother is the place where the child appears, in which the father also has an effect through the water he casts into the womb, whether that was intended by him or not. Likewise, the star swims in the orbit, and from its swimming comes what occurs in the elemental mothers of matters necessitating birth, whether that was intended by the star or not, according to what Allah Almighty knows of what He revealed in every heaven of the Divine Command (الأمر الإلهي), which none knows except those to whom He revealed it.\n\nSo wherever the weight of this mustard seed is, due to its smallness, or rather, its hiddenness (خفائها), Allah will bring it forth. He drew attention through this definition so that you may bring to Him what He obligated you to bring. For you hope in Him concerning what you bring to Him, but He does not hope in you concerning what He brought to you, for He is <<Self-Sufficient above the worlds>> (غَنِيٌّ عَنِ الْعالَمِينَ), and you are among those who are poor (فقراء) toward Him. Therefore, your bringing to Him what He obligated you to bring is more confirmed in your right that you should bring it, due to your poverty and need for the benefit you gain thereby.\n\n<<Indeed, Allah is Subtle (لطيف)>>—meaning, He is more hidden from being known and reached (i.e., reached in knowledge) than the mustard seed. <<All-Aware (خَبِيرٌ)>>—due to His subtlety regarding the place of the one who seeks that mustard seed from Him, because of the seeker's eagerness to repel the pain of poverty from himself. For the creature only seeks sustenance to repel pain, nothing else. If he did not feel pain, it would be inconceivable for him to seek anything of that. So his benefit is nothing but the repulsion of his pain by means of that [sustenance], and that is the greatest pillar.\n\nWere it not that the ruling of Paradise (الجنة) is that the attainment of the desired object (المشتهي) is the very attainment of the desire (الشهوة), such that if it were delayed until the second moment following the moment of desire, the person would experience pain due to the loss of the desired object during the time of desire, just like the world. For in the world, the attainment of the desired object must necessarily be delayed beyond the moment of desire, so pain is inevitable. When the desired object is attained, the greatest pleasure derived from it is the repulsion of that pain. Understand this and verify it, for it will benefit you. And Allah <<says the truth, and He guides to the way>>.",
    "ur": "باب نمبر چار سو اٹھہتر، اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اگر وہ (عمل) رائی کے دانے کے برابر بھی ہو، پھر وہ کسی چٹان میں ہو یا آسمانوں میں یا زمین میں، اللہ اسے لے آئے گا، بے شک اللہ لطیف (باریک بین) ہے، باخبر ہے۔\" (لقمان: ۱۶)\n\n> رزق کو رزاق ہی لاتا ہے، اس کے لیے\n> نہ اس کے سوا کوئی نام ہے، نہ کوئی عین (حقیقت) اور نہ کوئی اثر۔\n> اور وہاب (بخشنے والے) کے بارے میں یہ مت کہنا کہ اس پر کوئی\n> حکم ہے، کیونکہ یہ قابلِ اعتبار نہیں ہے۔\n> پس وہ (رزق) واجب ہے، لیکن بخشش (الوہب) کے لیے\n> وجوب کا حکم نہیں ہے، اور اسی میں بندے کی آزمائش ہوتی ہے۔\n\n### [بقیۃ اللہ (اللہ کی باقی ماندہ چیز) سے کیا مراد ہے؟]\n\nبقیۃ اللہ (بَقِيَّتُ الله خَيْرٌ لَكُمْ) تمہارے لیے بہتر ہے۔ یہ وہ چیز ہے جسے تمہارے لیے حلال کیا گیا ہے کہ تم اسے استعمال کرو جس سے تمہاری ضرورت پوری ہو تاکہ تم اس کے ذریعے اپنے رب کی اطاعت میں قائم رہو۔ اسے بقیہ (باقی ماندہ) اس لیے کہا گیا کہ اصل میں اللہ نے تمہارے لیے وہ سب کچھ پیدا کیا جو زمین میں ہے (مَا فِي الْأَرْضِ جَمِيعاً)، چنانچہ تمہیں اس میں مکمل تصرف (التصريف) حاصل تھا، تم جو چاہتے لیتے اور جو چاہتے چھوڑ دیتے۔ پھر دوسری حالت میں، اس نے تم پر بعض چیزوں میں تصرف کو محدود کر دیا جس میں پہلے تمہیں آزادی دی گئی تھی، اور اس میں سے جو کچھ وہ تمہارے لیے باقی رکھنا چاہتا تھا، باقی رکھا۔ پس یہی بقیۃ اللہ (اللہ کی باقی ماندہ چیز) ہے۔ اور اسے تمہارے لیے بہتر اس لیے بنایا کہ اس نے اپنے بعض بندوں کے بارے میں جان لیا کہ ان کے نفوس اس بقیہ سے اندھے ہو جاتے ہیں، کیونکہ انہیں اصل (پہلے والی آزادی) دی گئی تھی، لہٰذا وہ اصل کے حکم کے مطابق تصرف کرتے ہیں۔ پس اللہ نے ان سے فرمایا: \"جو بقیہ اللہ نے تمہارے لیے باقی رکھا ہے وہ تمہارے لیے بہتر ہے اگر تم ایمان لانے والے ہو (خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ)\"۔ یعنی اگر تم اس بات کی تصدیق کرتے ہو کہ میں نے تمہارے لیے وہ سب کچھ پیدا کیا جو زمین میں ہے (خَلَقْتُ لَكُمْ مَا فِي الْأَرْضِ جَمِيعاً)، تو اگر تم اس میں میری تصدیق کرتے ہو تو تم اس میں بھی میری تصدیق کرو گے جو میں نے تمہارے لیے باقی رکھا ہے۔ اور اگر تم نے دونوں معاملات میں فرق کیا، پس بعض پر ایمان لائے اور بعض کا انکار کیا، تو تم مومن نہیں ہو گے۔\n\nپھر یہ کہ تم اسے جمع کرنے اور اس پر جھک جانے کے باوجود بھی اس میں سے صرف وہی حاصل کر سکو گے جو میں نے تمہارے لیے مقدر کر دیا ہے، اور تم مجھے کھو دو گے۔ تمہارے لیے برابر ہے کہ تم اس چیز کو حاصل کرنے کی کوشش کرو جس کی میں نے ضمانت دی ہے یا اس سے اعراض کرو، مجھے لازماً اسے تم تک پہنچانا ہے۔ کیونکہ میں تمہیں اس کے ذریعے تلاش کرتا ہوں جیسے میں تمہیں تمہاری مقررہ مدتوں (آجال) کے ذریعے تلاش کرتا ہوں۔ اور یہ نہ تو میرے نزدیک تمہاری عزت کی وجہ سے ہے اور نہ تمہاری توہین کی وجہ سے، کیونکہ میں نیک اور فاجر، مکلف اور غیر مکلف سب کو رزق دیتا ہوں، اور نیک اور فاجر، مکلف اور غیر مکلف سب کو موت دیتا ہوں۔ میری توجہ صرف اس بات پر ہے کہ میں تمہیں بقیہ (باقی ماندہ چیز) میں سے پہنچاؤں، نہ کہ کسی اور چیز میں سے۔ ایسے ہی موقع پر اس شخص کے ساتھ میری عنایت ظاہر ہوتی ہے جسے یہ چیز پہنچائی جاتی ہے، کیونکہ کوئی بھی جان اس وقت تک نہیں مرے گی جب تک کہ وہ اپنا رزق پورا نہ کر لے، جیسے کوئی بھی جان اس وقت تک نہیں مرے گی جب تک کہ اس کی مقررہ مدت (اجل) نہ آ جائے۔\n\nاور رزق خواہ کم ہو یا زیادہ، تمہارا رزق صرف وہی ہے جس سے تمہاری نشوونما قائم رہتی ہے اور تمہاری قوت اور زندگی برقرار رہتی ہے۔ تمہارا رزق وہ نہیں جو تم نے جمع کیا اور ذخیرہ کیا، کیونکہ وہ تمہارے لیے بھی ہو سکتا ہے اور دوسروں کے لیے بھی، لیکن اگر تم اسے جمع کرنے والے اور کمانے والے ہو تو اس کا حساب تم پر ہے۔ لہٰذا صرف وہی کماؤ جو تمہیں اور ان لوگوں کو قوت دے جن کے لیے اللہ نے تمہیں کوشش کرنے کا مکلف بنایا ہے، بس۔ اور جو کچھ اس سے زیادہ ہو جو میں نے تم پر کھول دیا ہے، تو اسے اپنی طرف سے انعام کے طور پر جسے چاہو پہنچا دو، ان لوگوں میں سے جن کے بارے میں تم جانتے ہو کہ وہ اسے میری اطاعت میں استعمال کریں گے۔ اور اگر تم نہ جانو تو بھی اسے پہنچا دو، کیونکہ تم اس فائدے سے محروم نہیں ہو گے کہ تم اس چیز کے ذریعے انعام دینے والے بن گئے جسے تم نے اپنی ملکیت کا نام دیا ہے۔ پس تم اس میں نعمت کے رب (مالک) کی طرح ہو، اور میرے سوا کوئی رب نہیں، لہٰذا تم میرے نائب ہو۔ اور نائب اسی کی صورت پر ہوتا ہے جو اسے خلیفہ بناتا ہے۔ اور میں نے نباتات، حیوانات، اطاعت گزار اور نافرمان سب کو رزق دیا ہے۔ پس تم بھی ایسے ہی بنو، اور اپنی استطاعت بھر اطاعت گزاروں کی جستجو کرو، کیونکہ یہ تمہارے حصے کے لیے زیادہ وافر اور بلند ہے، اور تمہارے حق میں زیادہ اولیٰ اور قابلِ تعریف ہے۔\n\n### [بے شک اللہ نے بندے کے لیے وہ چیز پیدا کی جس سے وہ نعمت حاصل کرتا ہے اور زندہ رہتا ہے]\n\nاور جان لو کہ جس طرح میں نے تمہاری ذات کو زندہ رکھنے اور تمہارے نفس کو نعمت دینے کے لیے تمہاری دیکھ بھال کرتے ہوئے چیزیں پیدا کیں، اسی طرح میں نے تمہارے لیے وہ چیز بھی پیدا کی ہے کہ جب تم اس میں تصرف کرو تو اس کے ذریعے میرے اسماء (اسماء حسنیٰ) کو زندہ کرو اور ان کے نفوس کو نعمت دو۔ اور تم ہی وہ ہو جو یہ چیز ان تک پہنچاتے ہو، جیسے میں تمہارا رزق تم تک پہنچاتا ہوں جہاں تم ہو اور جہاں تمہارا رزق ہے۔ کیونکہ میں تمہاری جگہ اور تمہارے ٹھکانے کو جانتا ہوں، اور میں تمہارے رزق کی عین (حقیقت) کو جانتا ہوں، جبکہ تم اسے نہیں جانتے جب تک کہ تم اسے کھا نہ لو یا میں تمہیں اس کے بارے میں خاص طور پر بتا نہ دوں۔ پس جب تم اس سے غذا حاصل کر لیتے ہو اور وہ تمہاری ذات میں سرایت کر جاتا ہے، تب تم جانتے ہو کہ یہ تمہارا رزق ہے۔ اسی طرح میں نے تمہیں سکھایا، پس تم نے جان لیا کہ اسماء حسنیٰ کس رزق کے مستحق ہیں جس سے ان کی زندگی اور نشوونما قائم رہتی ہے، اور میں نے تمہیں اس کا علم اور اس کی عین (حقیقت) عطا کی، اور تمہیں وہ بنا دیا جو یہ چیز ان تک پہنچاتا ہے۔ اور جس طرح میں نے تم سے اس رزق پر شکر ادا کرنے کا مطالبہ کیا جو میں تمہارے پاس لایا، اسی طرح تم بھی ان چیزوں پر شکر کا مطالبہ کرو جو تم میرے اسماء (اسماء حسنیٰ) کی طرف لائے ہو۔\n\nاور جب میرے اسماء (اسماء حسنیٰ) تمہارا شکر ادا کرتے ہیں، تو درحقیقت میں تمہارا شکر ادا کرتا ہوں، پس تم ایسی سعادت حاصل کرتے ہو جس جیسی سعادت صرف اسی نے حاصل کی جس نے ایسا عمل کیا۔ اور میرے اسماء تک یہ چیز عالم (الوجود) سے لازماً پہنچتی ہے، لیکن میرے اسماء کا شکر صرف وہی ادا کرتا ہے جو ان کی طرف توجہ کرتے ہوئے ان کی جانب کی دیکھ بھال کے ارادے سے یہ چیز لاتا ہے، نہ کہ وہ جو اس سے غافل ہو کر لاتا ہے۔ بے شک یہ ان کے لیے ہے۔ \"کیا وہ لوگ جو علم رکھتے ہیں اور وہ لوگ جو علم نہیں رکھتے برابر ہو سکتے ہیں؟\" (هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ) نہیں، اللہ کی قسم! جیسے وہ لوگ برابر نہیں ہو سکتے \"جنہوں نے برے اعمال کیے (اجْتَرَحُوا السَّيِّئاتِ) ان لوگوں کے ساتھ جو ایمان لائے اور نیک اعمال کیے، ان کی زندگی اور ان کی موت میں۔ کتنا برا ہے جو وہ فیصلہ کرتے ہیں\" (كَالَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ فِي مَحْياهُمْ ومَماتُهُمْ ساءَ ما يَحْكُمُونَ)۔ یعنی کتنا برا ہے وہ جو ایسا فیصلہ کرتا ہے۔ پھر میں تفصیل بیان کرتا ہوں اور لقمان کا اپنے بیٹے سے قول بیان کرتا ہوں: \"پھر وہ کسی چٹان میں ہو (فَتَكُنْ فِي صَخْرَةٍ)\" یعنی ایسے شخص کے پاس ہو جس کا دل سخت ہو اور اسے اللہ کی مخلوق پر کوئی شفقت نہ ہو۔ اللہ تعالیٰ فرماتا ہے: \"پھر اس کے بعد تمہارے دل سخت ہو گئے، پس وہ پتھروں کی طرح ہیں یا سختی میں اس سے بھی زیادہ\" (ثُمَّ قَسَتْ قُلُوبُكُمْ مِنْ بَعْدِ ذلِكَ فَهِيَ كَالْحِجارَةِ أَوْ أَشَدُّ قَسْوَةً)۔\n\nاور اس کا قول \"یا سختی میں اس سے بھی زیادہ (أَوْ أَشَدُّ قَسْوَةً)\"، کیونکہ پتھر کلہاڑی کے ذریعے تمہارے اثر انداز ہونے سے رک نہیں سکتا، جبکہ دل تمہارے اثر سے بلاشبہ رک جاتا ہے، کیونکہ تمہیں اس پر کوئی اختیار حاصل نہیں۔ اسی لیے دل زیادہ سخت تھا، یعنی رکاوٹ میں زیادہ بڑا اور زیادہ محفوظ۔ اور اگر تم اس کے ظاہر میں احسان بھی کرو تو یہ ضروری نہیں کہ اس کا دل تمہاری طرف نرم ہو جائے، یہ اس کے اختیار میں ہے۔ اور حکایت بیان کی گئی ہے کہ ایک شخص نے ایک سخت اور خشک پتھر توڑا تو اس نے اس پتھر کے بیچ میں ایک کھوکھلا حصہ دیکھا جس میں ایک کیڑا تھا اور اس کے منہ میں ایک سبز پتا تھا جسے وہ کھا رہا تھا۔ اور پہلی نبوت میں روایت کیا گیا ہے کہ اللہ تعالیٰ کے لیے زمین کے نیچے ایک ٹھوس چٹان ہے، اس چٹان کے اندر ایک جاندار ہے جس کے لیے چٹان میں کوئی راستہ نہیں، اور اللہ نے اس کے لیے اس میں غذا بنا دی ہے، اور وہ اللہ کی تسبیح کرتا ہے اور کہتا ہے: \"پاک ہے وہ ذات جو مجھے میرے مقام کی دوری کے باوجود نہیں بھولتی۔\"\n\nیعنی اس جگہ سے دوری جہاں سے رزق آتا ہے، نہ کہ اللہ سے اس کے مقام کی دوری، کیونکہ اللہ کی اپنے مخلوق سے نسبت، قرب (قُرب - راء کے سکون کے ساتھ) کے لحاظ سے ایک ہی ہے، اور قرب (قَرَب - راء کے فتحہ کے ساتھ) کے لحاظ سے مختلف ہے۔ پس یہ جان لو۔ \"یا آسمانوں میں (أَوْ فِي السَّماواتِ)\"، اس کے ذریعے جو اللہ نے ستاروں کے اپنے مداروں میں تیرنے میں، عالم کے رزق کی تخلیق کے لیے ارکان (عناصر) میں اثرات ودیعت کیے ہیں۔ یا بارشیں بھی، کیونکہ عربی زبان میں سماء (السماء) کا مطلب بارش بھی ہے۔ شاعر نے کہا:\n\n> جب کسی قوم کی زمین پر سماء (بارش) برستی ہے۔\n\nیہاں سماء سے مراد بارش ہے۔ اور اس کا قول \"یا زمین میں (أَوْ فِي الْأَرْضِ)\"، اس قبولیت اور رزق کی تشکیل کی وجہ سے جو اس میں موجود ہے، کیونکہ یہ رزق کے ظہور کی جگہ ہے، جیسے ماں بچے کے ظہور کی جگہ ہے، جس میں باپ کا بھی اثر ہوتا ہے اس پانی کے ذریعے جو اس نے رحم میں ڈالا، خواہ اس کا ارادہ ہو یا نہ ہو۔ اسی طرح ستارہ فلک میں تیرتا ہے اور اس کے تیرنے سے ارکانِ امہات (مادی عناصر) میں وہ امور پیدا ہوتے ہیں جو ولادت کا سبب بنتے ہیں، خواہ ستارے کا ارادہ ہو یا نہ ہو، یہ اس کے مطابق ہوتا ہے جو اللہ عزوجل جانتا ہے، جو اس نے ہر آسمان میں الٰہی امر کے ذریعے وحی کیا ہے، جسے صرف وہی جانتا ہے جس پر اس نے وحی کی ہو۔\n\nپس جہاں کہیں بھی رائی کے اس دانے کا وزن ہو، اس کی قلت بلکہ اس کے پوشیدہ ہونے کی وجہ سے، اللہ اسے لے آتا ہے۔ اس تعریف کے ذریعے اس نے تمہیں متنبہ کیا ہے تاکہ تم بھی وہ چیز لے کر آؤ جس کا لانا اس نے تم پر فرض کیا ہے، کیونکہ تم اس سے امید رکھتے ہو اس چیز میں جو تم اس کے پاس لاتے ہو، جبکہ وہ تم سے امید نہیں رکھتا اس چیز میں جو وہ تمہیں دیتا ہے، کیونکہ وہ تمام جہانوں سے بے نیاز ہے (غَنِيٌّ عَنِ الْعالَمِينَ)، اور تم اس کے محتاجوں میں سے ہو۔ پس تمہارا اس کے پاس وہ چیز لانا جس کا لانا اس نے تم پر فرض کیا ہے، تمہارے حق میں زیادہ ضروری ہے، تاکہ تم اسے اپنی محتاجی اور ضرورت کی وجہ سے لاؤ، اس فائدے کے لیے جو تمہیں اس سے حاصل ہوتا ہے۔ \"بے شک اللہ لطیف (باریک بین) ہے\" (إِنَّ الله لَطِيفٌ)، یعنی وہ رائی کے دانے سے بھی زیادہ پوشیدہ ہے کہ اسے جانا جائے اور اس تک پہنچا جائے، یعنی اس کے علم تک۔ \"خبیر (باخبر) ہے\" (خَبِيرٌ)، اپنی لطافت کی وجہ سے اس شخص کے مقام سے باخبر ہے جو اس سے وہ رائی کا دانہ طلب کرتا ہے، کیونکہ اسے اپنے سے فقر کے درد کو دور کرنے کی حرص ہوتی ہے۔ بے شک جاندار رزق صرف درد کو دور کرنے کے لیے طلب کرتا ہے، اور کچھ نہیں۔ اگر اسے درد محسوس نہ ہو تو اس سے کسی چیز کا طلب کرنا متصور نہیں ہو سکتا۔ پس اس کا فائدہ صرف اس درد کو دور کرنا ہے، اور یہی سب سے بڑا رکن ہے۔ اور اگر جنت کا حکم یہ نہ ہوتا کہ شہوت کا حصول ہی عین مشتہی (مطلوبہ چیز) کا حصول ہے، اس طرح کہ اگر وہ شہوت کے حصول کے وقت سے اگلے وقت تک بھی تاخیر سے ملے تو وہ مشتہی کے فقدان کی وجہ سے درد میں مبتلا ہو جائے گا، جیسا کہ دنیا میں ہوتا ہے، کیونکہ دنیا میں مشتہی کا حصول شہوت کے وقت سے لازماً تاخیر سے ہوتا ہے، لہٰذا درد لازمی ہے۔ پس جب مشتہی حاصل ہوتا ہے تو اس سے سب سے بڑی لذت اس درد کا دور ہو جانا ہے۔ پس اس بات کو سمجھو اور اس کی تحقیق کرو، کیونکہ یہ تمہیں فائدہ دے گا۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و هفتاد و هشتم در معرفت حال قطبی که منزل او این آیه بود: «اگر [عمل] به اندازه سنگینی دانه خردلی باشد و در تخته‌سنگی یا در آسمان‌ها یا در زمین قرار گیرد، خداوند آن را می‌آورد. همانا خداوند لطیف و آگاه است.» (إِنْ تَكُ مِثْقالَ حَبَّةٍ من خَرْدَلٍ فَتَكُنْ في صَخْرَةٍ أَوْ في السَّماواتِ أَوْ في الْأَرْضِ يَأْتِ بِهَا الله إِنَّ الله لَطِيفٌ خَبِيرٌ)\n\nروزی را روزی‌دهنده (الرزاق) می‌آورد، او را\nنه نامی جز اوست و نه عین و اثری\n\nو درباره وهاب (بخشنده) مگوی که او را\nحکمی بر اوست، که این پذیرفته نیست\n\nزیرا او واجب است و بخشش (الوهب) را\nحکم وجوب نیست و بنده در آن آزموده می‌شود\n\n### [مراد از باقی‌مانده خدا چیست؟]\n\n«باقی‌مانده خدا برای شما بهتر است» (بَقِيَّتُ الله خَيْرٌ لَكُمْ) [هود: ۸۶]؛ یعنی آنچه خداوند برای تو حلال کرده تا از آن استفاده کنی و نیازت را برطرف سازد تا بتوانی در طاعت پروردگارت قیام کنی. و آن را «باقی‌مانده» نامید، زیرا در اصل، خداوند «آنچه در زمین است، همه را برای شما آفرید» (ما في الْأَرْضِ جَمِيعاً) [بقره: ۲۹]، پس تو در آن مطلق‌التصرف بودی؛ هر چه می‌خواستی برمی‌داشتی و هر چه می‌خواستی رها می‌کردی. سپس در مرحله دوم، برخی از آنچه تصرف تو در آن آزاد بود، بر تو ممنوع ساخت و از آن، آنچه را که خواست برایت باقی گذاشت. این همان «باقی‌مانده خدا» است. و آن را برای تو بهتر قرار داد، زیرا می‌دانست که نفوس برخی از بندگانش به دلیل آنچه در اصل به آن‌ها داده شده، از این باقی‌مانده کور می‌شوند و بر اساس حکم اصل تصرف می‌کنند. پس به آن‌ها فرمود: «باقی‌مانده‌ای که خدا برای شما باقی گذاشته، بهتر است برای شما، اگر مؤمن باشید» (الْبَقِيَّةُ الَّتِي أَبْقَى الله خَيْرٌ لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ) [هود: ۸۶]؛ یعنی اگر تصدیق‌کننده باشید که من «آنچه در زمین است، همه را برای شما آفریدم» (لَكُمْ ما في الْأَرْضِ جَمِيعاً). اگر مرا در این امر تصدیق کنید، در آنچه از آن برای شما باقی گذاشته‌ام نیز تصدیقم خواهید کرد. اما اگر میان این دو امر جدایی افکنید و به برخی ایمان آورید و به برخی کفر ورزید، مؤمن نخواهید بود. سپس، شما از آن [روزی]، با وجود جمع‌آوری و روی آوردن شدید به آن، جز آنچه برایتان مقدر کرده‌ام، به دست نخواهید آورد و مرا از دست خواهید داد. و برای شما فرقی نمی‌کند که برای به دست آوردن آنچه برایتان تضمین کرده‌ام تلاش کنید یا از آن روی بگردانید؛ من ناگزیرم آن را به شما برسانم. زیرا من آن را از شما می‌طلبم، همان‌گونه که اجل‌هایتان را از شما می‌طلبم. و این نه از کرامت شما نزد من است و نه از اهانت شما؛ زیرا من نیکوکار و بدکار، مکلف و غیر مکلف را روزی می‌دهم، و نیکوکار و بدکار، مکلف و غیر مکلف را می‌میرانم. و توجه من تنها به این است که از آن باقی‌مانده (البقية) به تو برسانم، نه از غیر آن. در چنین مواردی است که عنایت من به شخصی که این [روزی] به او می‌رسد، آشکار می‌شود؛ زیرا هیچ نفسی نمی‌میرد مگر آنکه روزی خود را کامل دریافت کند، همان‌گونه که هیچ نفسی نمی‌میرد مگر آنکه اجل نام‌گذاری شده‌اش فرا رسد. و فرقی نمی‌کند که روزی کم باشد یا زیاد. روزی تو تنها چیزی است که هستی تو با آن برپا می‌شود و قوت و حیات تو با آن دوام می‌یابد. روزی تو آن چیزی نیست که جمع کرده و ذخیره نموده‌ای؛ زیرا ممکن است آن برای تو و برای دیگری باشد، اما حساب آن بر عهده توست اگر جمع‌کننده و کسب‌کننده آن باشی. پس کسب نکن مگر آنچه تو را و کسانی را که خداوند تو را مکلف به تلاش برای آن‌ها کرده است، قوت دهد و نه بیشتر. و آنچه بر آن افزوده شود و خداوند بر تو گشوده است، آن را به عنوان انعام از جانب خود به هر کس که می‌خواهی برسان؛ از کسانی که می‌دانی آن را در طاعت من به کار می‌برد. و اگر [کسی را که در طاعت به کار می‌برد] نشناختی، باز هم آن را برسان؛ زیرا از فایده آن محروم نخواهی شد، به این دلیل که تو انعام‌کننده هستی با آنچه آن را ملک خود نامیده‌ای. پس تو در آن، پروردگار نعمت هستی و غیر من نیستی. تو نایب من هستی، و نایب به صورت کسی است که او را جانشین کرده است. و من گیاه و حیوان و مطیع و عاصی را روزی داده‌ام، پس تو نیز چنین باش و تا حد توان خود، مطیع را جستجو کن، زیرا این بهره تو را فراوان‌تر و بالاتر می‌سازد و در حق تو شایسته‌تر و ستوده‌تر است.\n\n### [همانا خداوند برای بنده آنچه را که با آن متنعم می‌شود و زنده می‌ماند، آفریده است]\n\nو بدان که همان‌گونه که من برای تو آنچه را که ذاتت با آن زنده می‌شود و نفست با آن متنعم می‌گردد، از روی عنایت به تو آفریدم، همچنین برای تو چیزی آفریدم که اگر در آن تصرف کنی، نام‌های مرا با آن زنده می‌کنی و نفوس آن‌ها را متنعم می‌سازی. و تو آورنده آن به سوی ایشان خواهی بود، همان‌گونه که من آورنده روزی تو به سوی تو هستم، هر جا که باشی و روزی‌ات هر چه باشد. زیرا من جایگاه و قرارگاه تو را می‌دانم و عین روزی تو را می‌دانم، در حالی که تو آن را نمی‌دانی تا زمانی که آن را بخوری یا من آن را به طور مشخص به تو اعلام کنم. پس هنگامی که از آن تغذیه کردی و در ذاتت جریان یافت، آنگاه می‌دانی که آن روزی تو بوده است. به همین ترتیب، تو را تعلیم دادم و دانستی که اسماء حسنی چه روزی‌ای را که حیات و نشأت آن‌ها با آن برپا می‌شود، مستحق هستند، و علم و عین آن را به تو دادم و تو را آورنده آن به سوی ایشان قرار دادم. و همان‌گونه که از تو شکر بر آنچه از روزی برایت آوردم، طلب کردم، تو نیز شکر بر آنچه از نام‌های من آورده‌ای، طلب می‌کنی. و هنگامی که نام‌های من تو را شکر کنند، در حقیقت من تو را شکر کرده‌ام، پس به سعادتی دست می‌یابی که جز کسی که چنین عملی انجام داده، به آن دست نیافته است. و ناگزیر است که آن [روزی] از عالم به نام‌های من برسد، اما نام‌های مرا شکر نمی‌کند مگر کسی که با قصد و از روی عنایت به جانب آن‌ها، آن را بیاورد، نه کسی که غافل از آن‌ها آن را بیاورد. همانا این [روزی] برای آن‌هاست. «آیا کسانی که می‌دانند و کسانی که نمی‌دانند برابرند؟» (هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ) [زمر: ۹] نه، به خدا سوگند. همان‌گونه که «کسانی که مرتکب بدی‌ها شدند، با کسانی که ایمان آوردند و کارهای شایسته انجام دادند، در زندگی و مرگشان برابر نیستند. چه بد قضاوتی می‌کنند» (الَّذِينَ اجْتَرَحُوا السَّيِّئاتِ كَالَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ في مَحْياهُمْ ومَماتُهُمْ ساءَ ما يَحْكُمُونَ) [جاثیه: ۲۱]؛ یعنی بد است کسی که چنین حکمی می‌کند. سپس تفصیل می‌دهم و می‌گویم: سخن لقمان به پسرش: «و در تخته‌سنگی قرار گیرد» (فَتَكُنْ في صَخْرَةٍ) [لقمان: ۱۶]؛ یعنی نزد کسی که قلبی سخت دارد و بر خلق خدا شفقت ندارد. خداوند متعال می‌فرماید: «سپس دل‌های شما بعد از آن سخت شد، پس مانند سنگ‌ها یا سخت‌تر از آن است» (ثُمَّ قَسَتْ قُلُوبُكُمْ من بَعْدِ ذلِكَ فَهِيَ كَالْحِجارَةِ أَوْ أَشَدُّ قَسْوَةً) [بقره: ۷۴]. و سخن او که «یا سخت‌تر از آن» (أَوْ أَشَدُّ قَسْوَةً)؛ زیرا سنگ نمی‌تواند از تأثیر تیشه تو در آن امتناع ورزد، اما قلب بدون شک از تأثیر تو در آن امتناع می‌ورزد، چرا که تو بر آن سلطه‌ای نداری. به همین دلیل قلب سخت‌تر است، یعنی از نظر امتناع بزرگ‌تر و محافظت‌شده‌تر است. و اگر در ظاهر به او احسان کنی، لازم نیست که قلبش نسبت به تو نرم شود، زیرا این امر به خود او بستگی دارد. و حکایت شده است که شخصی سنگی سخت و خشک را شکست و در وسط آن سنگ، حفره‌ای دید که در آن کرمی بود و در دهانش برگ سبزی داشت که آن را می‌خورد. و در نبوت اولیه روایت شده است که خداوند متعال در زیر زمین تخته‌سنگی سخت و توپر دارد و در درون آن سنگ، حیوانی است که هیچ راه خروجی در سنگ ندارد و خداوند برای او در آنجا غذایی قرار داده است و او خدا را تسبیح می‌گوید و می‌گوید: «پاک است کسی که مرا با وجود دوری جایگاهم فراموش نمی‌کند.» یعنی [دوری] از موضعی که روزی‌ها از آن می‌آید، نه دوری جایگاهش از خدا؛ زیرا نسبت خداوند به خلقش از حیث قُرب (نزدیکی با سکون راء) نسبتی واحد است، و از حیث قَرَب (نزدیکی با فتح راء) نسبتی متفاوت است. پس این را بدان. یا «در آسمان‌ها» (أَوْ في السَّماواتِ)؛ به واسطه آنچه خداوند در گردش ستارگان در افلاکشان از تأثیرات در ارکان برای خلق روزی‌های عالم یا باران‌ها نیز به ودیعه نهاده است. زیرا «سماء» (آسمان) در زبان عرب به معنای باران است. شاعر می‌گوید:\n\nآنگاه که آسمان بر زمین قومی فرود آید\n\nمنظور از «سماء» در اینجا باران است. و سخن او که «یا در زمین» (أَوْ في الْأَرْضِ)؛ به واسطه آنچه در آن از پذیرش و تکوین روزی‌ها وجود دارد. زیرا زمین محل ظهور روزی‌هاست، همانند مادر که محل ظهور فرزند است، که پدر نیز در آن اثر دارد به واسطه آبی که در رحم افکنده است، چه آن را قصد کرده باشد و چه نکرده باشد. همچنین ستاره در فلک می‌گردد و از گردش آن، آنچه در ارکان مادران از امور موجب ولادت است، پدید می‌آید. و فرقی نمی‌کند که آن [تأثیر] مقصود ستاره باشد یا نباشد، بر اساس آنچه خداوند عز و جل می‌داند و در هر آسمانی از امر الهی وحی کرده است که جز کسی که به او وحی شده، آن را نمی‌داند. پس هر کجا که سنگینی این دانه خردل باشد، به دلیل کمی آن، بلکه به دلیل پنهان بودنش، «خداوند آن را می‌آورد» (يَأْتِ بِهَا الله). با این تعریف، آگاه ساخت تا تو آنچه را که مکلف به آوردن آن هستی، به سوی او بیاوری؛ زیرا تو در آنچه به سوی او می‌آوری، به او امید داری، اما او در آنچه به تو داده است، به تو امید ندارد. همانا او «از جهانیان بی‌نیاز است» (غَنِيٌّ عَنِ الْعالَمِينَ) [آل عمران: ۹۷] و تو از نیازمندان به او هستی. پس آوردن تو به سوی او، آنچه را که مکلف به آوردن آن هستی، در حق تو مؤکدتر است که آن را بیاوری، به دلیل فقر و نیازت به منفعتی که از آن حاصل می‌شود. «همانا خداوند لطیف است» (إِنَّ الله لَطِيفٌ)؛ یعنی او پنهان‌تر از آن است که دانسته شود و به او (یعنی به علم او) دسترسی پیدا شود، حتی از دانه خردل. «آگاه است» (خَبِيرٌ)؛ به دلیل لطفش به جایگاه کسی که آن دانه خردل را از او می‌طلبد، به خاطر حرص او بر دفع درد فقر از خود. زیرا حیوان روزی را نمی‌طلبد مگر برای دفع دردها و نه چیز دیگر. اگر درد را احساس نمی‌کرد، تصور نمی‌شد که چیزی از آن را طلب کند. پس منفعت آن جز دفع دردش به واسطه آن نیست، و این رکن اعظم است. و اگر حکم بهشت این نبود که نفسِ حاصل شدن شهوت، همان نفسِ حاصل شدن مشتهی (آنچه مورد اشتهاست) است، به طوری که اگر [حصول مشتهی] از آن به زمان دومی که پس از زمان حصول شهوت است، تأخیر می‌افتاد، در زمان شهوت به دلیل فقدان مشتهی، دچار درد می‌شد، مانند دنیا که ناگزیر است حصول مشتهی از زمان شهوت تأخیر یابد، پس ناگزیر درد وجود دارد. اما هنگامی که مشتهی حاصل می‌شود، بزرگ‌ترین لذت، دفع شدن آن درد است. پس این را بفهم و محقق ساز، که برای تو سودمند است. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ) [احزاب: ۴]."
  },
  "page_count": 2
}