{
  "id": 512,
  "title": {
    "ar": "الباب الثاني عشر وخمسمائة في معرفة حال قطب كان منزله كُلَّما نَضِجَتْ جُلُودُهُمْ بَدَّلْناهُمْ جُلُوداً غَيْرَها",
    "en": "Chapter Five Hundred and Twelve: Concerning the knowledge of the state of a Pole (قطب) whose station was [that of] <<Every time their skins are roasted, We shall replace them with other skins>>.",
    "ur": "باب پانچ سو بارہ: قطب (قطب) کے حال کی معرفت (معرفۃ) کے بیان میں جس کا مقام یہ تھا: \"جب بھی ان کی کھالیں پک جائیں گی (جل جائیں گی)، ہم انہیں دوسری کھالوں سے بدل دیں گے\" (كُلَّما نَضِجَتْ جُلُودُهُمْ بَدَّلْناهُمْ جُلُوداً غَيْرَها)۔",
    "fa": "باب پانصد و دوازدهم در معرفت حال قطبی که منزل او این آیه بود: «هرگاه پوست‌هایشان پخته شود، پوست‌هایی غیر از آن را جایگزینشان می‌کنیم» (كُلَّما نَضِجَتْ جُلُودُهُمْ بَدَّلْناهُمْ جُلُوداً غَيْرَها)."
  },
  "content": {
    "ar": "## (الباب الثاني عشر وخمسمائة في معرفة حال قطب كان منزله كُلَّما نَضِجَتْ جُلُودُهُمْ بَدَّلْناهُمْ جُلُوداً غَيْرَها)\n\n\n> كلما أنضج اللهيب جلودا *** بدل الله للعذاب جلودا\n\n\n> أبدا ينتهي القضاء إليه *** أورث القوم في الجحيم خلودا\n\n\n> جعل الله منهم وعليهم *** عند ما ينقضي السؤال شهودا\n\n\n> فإذا أدت الشهادة فيهم *** ملكوا الفوز والنعيم الجديدا\n\n\n### [شهادة الأعضاء والجلود على صاحبه‏]\n\n\nيقول الله تعالى إخبارا عنهم وقالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا قالُوا أَنْطَقَنَا الله أي بالشهادة عليكم لأنهم شهداء عدول مقبولون القول عند الله وكانوا في الدنيا غير راضين بما كانت النفس الناطقة الحيوانية تصرفهم فيه زمان حكمها وإمارتها عليهم وعلى جميع جوارحهم من سمع وبصر ولسان ويد وبطن وفرج ورجل وقلب وإنما سميت الجلود بهذا الاسم لما هي عليه من الجلادة لأنها تلتقي بذاتها جميع المكاره من جراحة وضرب وحرق وحر وبرد وفيها الإحساس وهي مجن النفس الحيوانية لتلقى هذه المشاق فما في الإنسان أشد جلادة من جلده ولهذا\nغشاه الله به فنضجه سبب في عذاب النفس المكلفة والجلد متنعم في ذلك العذاب المحسوس قال بعض المحبين‏\n\n\n> فهل سمعتم بصب *** سليم طرف سقيم‏\n\n\n> منعم بعذاب *** معذب بنعيم‏\n\n\nهذا الهجير هو هجير الخائفين من مكر الله يزجرون به نفوسهم الأمارة بالسوء عسى تنزجر ويأبى الخرق إلا اتساعا وسبب ذلك ما ذكر الله عن نفسه من اختيار مشيئته بين المغفرة والعذاب فهو غير قاطع بأحد الأمرين ثم إنه يرى الأسماء الإلهية تتقابل في حقه ثم يرى أسماء الفضل تترجح عددا وقوة على أسماء العدل والانتقام ويرى أن التقابل بين هذه الأسماء إنما يقع بميدان الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فجرأهم ذلك على ما ارتكبوه من المخالفات وتعدوه من الحدود وانتهكوه من المحارم فلو قطعوا بالمؤاخذة على ما صدر منهم إن ماتوا عن غير توبة كما ذهبت إليه طائفة ما فعلوا ما لا يرضى سيدهم ثم رأوا أنهم في عذاب الحياة الدنيا لا يصبرون تحت حكمه وينفرون منه طبعا ولا يقبلونه إلا جبرا فيجعله الخائف لنفسه موعظة وذكرى فإن كان قوي الايمان غير متبحر في التأويل خائضا في بحر الظاهر لا يصرفه للمعاني الباطنة صارف انتفع بالذكرى وإن لم تقم به هذه النعوت وأمثالها وتأول تردى وأردى من اتبعه وكان من الذين اتَّبَعُوا أَهْواءَهُمْ وكان أمر من هذه صفته فرطا فينتج له هذا الذكر من الأحوال العصمة ومن الأسماء الإلهية الاسم الظاهر والأول ومن المعارف معرفة الشهود وقبول الحق صور التجلي الظاهرة ويتحقق بالتقوى كل التحقق فيعلم العلم المجهول الذي لا يصل إليه كل أحد وهو العلم بسرائر المحسوسات والحواس والإحساس والمحس وإنما جهله الأكثرون لما نقوله وذلك أن النفوس مجبولة على حب إدراك المغيبات واستخراج الكنوز وحل الرموز وفتح المغاليق والبحث عن خفيات الأمور ودقائق الحكم ولا ترفع بالظاهر رأسا فإن ذلك عندها في زعمها أبين من فلق الصبح فالنهار عندها لا يخفى على أحد فصاحب هذا الهجير يبدو له من العلم\n\n\nفي هذه الظواهر ما لا يخطر بخاطر أحد أن ذلك الذي أدركه صاحب الكشف لهذا العلم يحمله ظاهر ذلك الأمر ولا صورته فإذا نبه عليه صاحب هذا العلم والكشف عند ذلك يعظم قدره وتظهر حكمته وكثرة خيره ويعلم عند ذلك أنه ما كان يحسبه هَيِّناً وهُوَ عِنْدَ الله عَظِيمٌ وهذا كله من الاسم الإلهي الظاهر الذي له التقدم في الأمور والخير كله إنما هو في الأوائل إلا ترى أن الخاطر الأول هو الإلهي الصادق الذي لا يخطئ أبدا فله العصمة والمضاء وفيه يظهر القدر والقضاء وكذلك النظرة الأولى والمسموع الأول والحركة الأولى وهو الذي يعطي علوم الزجر للزاجر وهي لا تخطي أبدا بل الصحة تصحبها فالأوائل هي الظواهر السوابق وكل ما جاء بعد الخاطر الأول فهو حديث نفس يجي‏ء على أثره فللخاطر الأول التمهيد والتوطئة وهي الظواهر تعطي العقول التشوق إلى ما وراءها فالفطن المصيب النحرير لا يزول عن الأمر الظاهر الأول الذي ورد عليه حتى يستوفي جميع حقائقه وما تعطيه صورته ويقف على خفيات غيوبه فإذا حصله وقبله علما حينئذ ينتقل إلى ما يرد عليه في أثره الذي هو باطن فإن جهل الظاهر كان بالباطن أجهل فإنه الدليل عليه وإن فرط في تحصيل الأول كان في تحصيل الآخر أشد تفريطا لأن من الحرص على تحصيل العلم بالخاطر الآخر تحصيل الأول فأول الأمر خوف والرجاء يتلوه فإن تقدمه الرجاء فقد فاته الخوف فإن الماضي لا يسترجع فالتقدم للخوف وقد فاته وذهب عنه ومن له برده والرجاء في المحل قد منعه سلطانه فالمؤمن من تساوى خوفه ورجاؤه بحيث إنه لا يفضل واحد صاحبه عنده لأنه استعمل كل شي‏ء في محله وأول نش‏ء الإنسان ضعف ولضعفه يتقدمه الخوف على نفسه ثم تكون له القوة بعد هذا الضعف فيأتيه الرجاء بقوته فإنه يتقوى نظره في العلوم والتأويلات فيعظم رجاؤه في جناب الحق ولكن العاقل لا يتعدى به موطنه فإذا خطر له من قوة الرجاء ما يوجب استعمال الخوف عند العاقل العارف عزل الرجاء عن الانفراد بالحكم وأشرك معه الخوف فذلك المؤمن فلا يزال كذلك إلى أن تكمل ذاته الكمال الذي ينتهي إليه أولياء الله في الورث النبوي في هذا الزمان المحمدي الذي أغلق فيه باب نبوة التشريع ورسالته وبقي باب حكم‏\n\n\nالاختصاص بالعلوم الإلهية والأسرار مفتوحا يدخل عليه أهل الله وأول داخل عليه أهل هذا الذكر جعلنا الله ممن استوى خوفه ورجاؤه في الحياة الدنيا إلى حين موته عند الاحتضار فيغلب رجاؤه على خوفه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "## Chapter 512: Concerning the Gnosis of the State of a Pole Whose Station is Defined by the Verse: <<WHENEVER THEIR SKINS ARE ROASTED THROUGH, WE SHALL CHANGE THEM FOR FRESH SKINS>> (Qur'an 4:56)\n\n> Whenever the blaze ripens the skins,\n> Allah changes the skins for the torment.\n\n> Eternally the Decree reaches Him,\n> Causing the people to inherit everlastingness in the Hellfire.\n\n> Allah makes witnesses from them and against them,\n> When the questioning is finished.\n\n> And when the testimony is rendered concerning them,\n> They possess the triumph and the new bliss.\n\n### The Testimony of the Limbs and Skins Against Their Possessor\n\nAllah Almighty speaks, informing about them: <<And they will say to their skins, 'Why did you testify against us?' They will say, 'Allah made us speak'>> (Qur'an 41:21). That is, by testifying against you, because they are just witnesses (شهداء عدول) whose word is accepted by Allah.\n\nIn the world (الدنيا), they were displeased with what the animal rational soul (النفس الناطقة الحيوانية) directed them to do during the time of its rule and authority over them and over all their limbs (جوارحهم): hearing, sight, tongue, hand, belly, private parts, leg, and heart.\n\nThe skins (الجلود) were only named by this name because of the toughness (الجلادة) they possess, for they encounter by their very nature all adversities (المكاره): wounds, blows, burning, heat, and cold. Sensation (الإحساس) resides within them, and they are the shield (مجن) of the animal soul (النفس الحيوانية) for receiving these hardships. There is nothing in the human being tougher (أشد جلادة) than his skin, and for this reason, Allah covered him with it. Thus, its ripening (نضجه) is a cause for the torment (عذاب) of the responsible soul (النفس المكلفة), while the skin itself is in bliss (متنعم) within that perceived torment. A certain lover said:\n\n> Have you ever heard of a lover\n> Whose eye is sound, yet sick?\n\n> In bliss through torment,\n> Tormented by bliss?\n\nThis intense heat (الهجير) is the heat of those who fear the cunning (مكر) of Allah. They use it to restrain their souls that command evil (نفوسهم الأمارة بالسوء), hoping they might be restrained, but the tear refuses anything but widening.\n\nThe reason for this is what Allah mentioned about Himself concerning the choice of His Will (مشيئته) between forgiveness (المغفرة) and torment (العذاب); thus, He is not decisive regarding either of the two matters. Furthermore, the seeker sees the Divine Names (الأسماء الإلهية) opposing one another concerning him, and then he sees the Names of Grace (أسماء الفضل) outweighing the Names of Justice (العدل) and Vengeance (الانتقام) in number and strength. He sees that the opposition between these Names occurs only within the field of Mercy (الرحمة), which <<encompasses all things>> (Qur'an 7:156).\n\nThis emboldens them regarding the transgressions (المخالفات) they committed, the limits (الحدود) they overstepped, and the sacred prohibitions (المحارم) they violated. If they were certain of being held accountable for what proceeded from them should they die without repentance, as one group (طائفة) holds, they would not have done what displeases their Master. Then they see that they cannot endure the torment (عذاب) of the worldly life (الحياة الدنيا) under its rule; they naturally flee from it and only accept it under compulsion.\n\nThe fearful one (الخائف) makes this a warning (موعظة) and a reminder (ذكرى) for himself. If he is strong in faith (قوي الايمان), not deeply versed in esoteric interpretation (التأويل), and immersed in the sea of the Exoteric (الظاهر), with nothing diverting him toward the Esoteric meanings (المعاني الباطنة), he benefits from the reminder. But if these characteristics and their like are not established in him, and he resorts to esoteric interpretation (تأول), he falls into ruin (تردى) and ruins those who follow him, becoming one of those <<who follow their own desires>> (Qur'an 4:135), and the affair of one whose description is this is loss (فرطا).\n\nThis remembrance (الذكر) yields for him, among the spiritual states (الأحوال), infallibility (العصمة); and among the Divine Names (الأسماء الإلهية), the Name The Manifest (الظاهر) and The First (الأول); and among the gnoses (المعارف), the gnosis of Witnessing (الشهود) and the acceptance of the Real (الحق) of the forms of the manifest Theophany (التجلي الظاهرة). He realizes piety (التقوى) completely, and thus knows the unknown knowledge (العلم المجهول) that not everyone reaches: the knowledge of the secrets (سرائر) of the sensibles (المحسوسات), the senses (الحواس), sensation (الإحساس), and the sensed (المحس).\n\nThe majority are ignorant of this knowledge for the reason we shall mention: souls (النفوس) are naturally inclined to love perceiving the unseen (المغيبات), extracting treasures (الكنوز), solving riddles (حل الرموز), opening locks (فتح المغاليق), and searching for hidden matters (خفيات الأمور) and subtle wisdoms (دقائق الحكم). They pay no heed to the Exoteric (الظاهر), for in their estimation, it is clearer than the break of dawn; the day, in their view, is hidden from no one.\n\nThe possessor of this intense heat (صاحب هذا الهجير) has revealed to him, concerning these manifest things (الظواهر), a knowledge that would not occur to anyone's mind—that the Exoteric aspect (ظاهر ذلك الأمر), and not merely its form (صورته), carries the knowledge that the possessor of Unveiling (الكشف) has attained. When the possessor of this knowledge and Unveiling draws attention to it, his worth is magnified, his wisdom (حكمته) becomes apparent, and his abundant goodness (كثرة خيره) is revealed. It is then known that what he used to consider trivial (هَيِّناً) <<is, in the sight of Allah, tremendous>> (Qur'an 24:15).\n\nAll of this stems from the Divine Name The Manifest (الظاهر), which has precedence in matters, and all goodness (الخير) resides only in the beginnings (الأوائل). Do you not see that the first thought (الخاطر الأول) is the truthful Divine one (الإلهي الصادق) that never errs? It possesses infallibility (العصمة) and effectiveness, and in it, Destiny (القدر) and Decree (القضاء) become manifest. Likewise, the first glance, the first thing heard, and the first movement. It is this that grants the sciences of restraint (علوم الزجر) to the restrainer, and they never err; rather, correctness accompanies them. Thus, the beginnings (الأوائل) are the preceding Exoteric aspects (الظواهر السوابق). Everything that comes after the first thought (الخاطر الأول) is a suggestion of the soul (حديث نفس) that follows in its wake. The first thought provides the preparation (التمهيد) and the groundwork (التوطئة), and these Exoteric aspects (الظواهر) cause the intellects (العقول) to yearn for what lies beyond them.\n\nThe astute, correct, and brilliant person (الفطن المصيب النحرير) does not depart from the first manifest matter (الأمر الظاهر الأول) that came upon him until he has exhausted all its realities (حقائقه) and what its form yields, and until he stands upon the hidden aspects of its unseen (خفيات غيوبه). When he has attained it and accepted it as knowledge (علما), he then moves on to what comes upon him in its wake, which is the Esoteric (باطن). If he is ignorant of the Exoteric (الظاهر), he will be even more ignorant of the Esoteric (الباطن), for the former is the guide to the latter. If he neglects the attainment of the first, he will be even more neglectful in attaining the last, because the eagerness to attain knowledge of the latter thought necessitates the attainment of the first.\n\nThe beginning of the matter is fear (خوف), and hope (الرجاء) follows it. If hope precedes it, then fear has been missed, for the past cannot be retrieved. Precedence belongs to fear, and it has been missed and gone from him. And whoever has his coolness (برده) and hope in the proper place, its authority prevents him (from imbalance).\n\nThe believer (المؤمن) is he whose fear and hope are equal, such that neither one is preferred over the other in his view, because he has employed everything in its proper station (محله). The first stage of human development (نش‏ء الإنسان) is weakness (ضعف), and due to his weakness, fear for himself precedes him. Then, after this weakness, strength comes to him, and hope (الرجاء) comes to him with its strength. For his contemplation of the sciences (العلوم) and esoteric interpretations (التأويلات) is strengthened, and thus his hope in the Divine Presence (جناب الحق) becomes great. However, the intelligent person (العاقل) does not allow it to exceed its proper station (موطنه). So, if a thought of the strength of hope occurs to him—a thought that necessitates the employment of fear in the view of the intelligent Gnostic (العاقل العارف)—he isolates hope from ruling alone and associates fear with it. That is the believer.\n\nHe remains in this state until his Essence (ذاته) achieves the perfection (الكمال) reached by the Friends of Allah (أولياء الله) through the prophetic inheritance (الورث النبوي) in this Muhammadan era (الزمان المحمدي), in which the door of legislative prophecy (نبوة التشريع) and messengership (رسالته) has been closed, but the door of the rule of specialization (حكم الاختصاص) in Divine Sciences (العلوم الإلهية) and Secrets (الأسرار) remains open. The People of Allah (أهل الله) enter through it, and the first to enter are the People of this Remembrance (أهل هذا الذكر).\n\nMay Allah make us among those whose fear and hope are balanced in the worldly life (الحياة الدنيا) until the time of death (الاحتضار), when his hope overcomes his fear. <<And Allah speaks the Truth, and He guides to the way>> (Qur'an 33:4).",
    "ur": "## (باب نمبر ۵۱۲: اس قطب کے حال کی معرفت میں جس کا ٹھکانہ یہ تھا کہ \"جب بھی ان کی کھالیں پک جائیں گی، ہم انہیں دوسری کھالوں سے بدل دیں گے\")\n\n> جب بھی شعلہ کھالوں کو پکا دے گا\n> اللہ عذاب کے لیے کھالیں بدل دے گا\n\n> ہمیشہ قضا اسی کی طرف منتہی ہوتی ہے\n> اس نے قوم کو جہنم میں ہمیشگی کی وراثت دی\n\n> اللہ نے ان میں سے اور ان پر گواہ مقرر کیے\n> جب سوال ختم ہو جائے گا\n\n> پس جب وہ ان کے حق میں گواہی دیں گے\n> وہ کامیابی اور نئی نعمت کے مالک بن جائیں گے\n\n### [اپنے مالک پر اعضاء اور کھالوں کی گواہی]\n\nاللہ تعالیٰ ان کے بارے میں خبر دیتے ہوئے فرماتا ہے:\n**\"اور وہ اپنی کھالوں سے کہیں گے کہ تم نے ہمارے خلاف کیوں گواہی دی؟ وہ کہیں گے کہ ہمیں اللہ نے گویائی دی\" (قَالُوا أَنْطَقَنَا الله)** یعنی تم پر گواہی دینے کے لیے، کیونکہ وہ اللہ کے نزدیک عادل اور مقبول القول گواہ ہیں۔ وہ دنیا میں اس بات پر راضی نہیں تھے کہ حیوانی ناطق نفس (النفس الناطقة الحیوانیۃ) انہیں اپنے حکم اور امارت کے دوران کس چیز میں مصروف رکھتا تھا، جو اس نفس کی ان پر اور ان کے تمام اعضاء پر تھی، جیسے سماعت، بصارت، زبان، ہاتھ، پیٹ، شرمگاہ اور پاؤں اور قلب۔\n\nکھالوں کو یہ نام اس لیے دیا گیا کہ وہ جلادت (سختی/مضبوطی) کی حامل ہوتی ہیں، کیونکہ وہ اپنی ذات سے تمام مصائب جیسے زخم، مار، جلن، گرمی اور سردی کا سامنا کرتی ہیں۔ ان میں احساس ہوتا ہے اور یہ حیوانی نفس (النفس الحیوانیۃ) کی ڈھال ہیں تاکہ ان مشقتوں کو برداشت کریں۔ انسان میں اس کی کھال سے زیادہ سخت کوئی چیز نہیں ہے۔ اسی لیے اللہ نے اسے اس سے ڈھانپ دیا۔ پس اس کا پکنا مکلف نفس کے لیے عذاب کا سبب ہے، جبکہ کھال اس محسوس عذاب میں نعمت حاصل کر رہی ہوتی ہے۔ بعض محبین نے کہا ہے:\n\n> کیا تم نے کسی ایسے عاشق کے بارے میں سنا ہے\n> جو سلیم الطرف (آنکھ کا صحیح) مگر سقیم (بیمار) ہو؟\n\n> عذاب سے منعم (نعمت یافتہ)\n> اور نعمت سے معذب (عذاب دیا گیا) ہو؟\n\nیہ ہجیر (دوپہر کی شدید گرمی) اللہ کے مکر سے ڈرنے والوں کی ہجیر ہے، جس سے وہ اپنے نفس امارہ بالسوء کو جھڑکتے ہیں، شاید وہ باز آ جائے، لیکن حماقت وسعت کے سوا کچھ نہیں مانتی۔ اس کا سبب وہ ہے جو اللہ نے اپنے بارے میں ذکر کیا ہے کہ وہ مغفرت اور عذاب کے درمیان اپنی مشیئت (اختیار) کا انتخاب کرتا ہے۔ پس وہ دونوں میں سے کسی ایک پر قطعی فیصلہ نہیں کرتا۔ پھر وہ دیکھتا ہے کہ الٰہی اسماء (الأسماء الإلهیۃ) اس کے حق میں ایک دوسرے کے مقابل آتے ہیں، پھر وہ دیکھتا ہے کہ فضل کے اسماء (أسماء الفضل) عدد اور قوت میں عدل اور انتقام کے اسماء پر غالب آ جاتے ہیں، اور وہ دیکھتا ہے کہ ان اسماء کے درمیان تقابل صرف رحمت کے میدان میں واقع ہوتا ہے جو **\"ہر چیز پر محیط ہے\" (وَسِعَتْ كُلَّ شَيْ‏ءٍ)**۔\n\nاس چیز نے انہیں ان خلاف ورزیوں پر جری کر دیا جو انہوں نے کیں، ان حدود کو پار کیا اور ان محرمات کی بے حرمتی کی جو انہوں نے کی۔ اگر وہ اس بات پر یقین رکھتے کہ اگر وہ توبہ کے بغیر مر گئے تو ان کے صادر ہونے والے اعمال پر ان سے مؤاخذہ کیا جائے گا، جیسا کہ ایک گروہ کا خیال ہے، تو وہ ایسا کام نہ کرتے جس سے ان کا آقا راضی نہ ہو۔ پھر انہوں نے دیکھا کہ وہ دنیا کی زندگی کے عذاب میں اس کے حکم کے تحت صبر نہیں کرتے اور طبعاً اس سے نفرت کرتے ہیں اور اسے صرف جبر کے تحت قبول کرتے ہیں۔\n\nپس خوف زدہ شخص اسے اپنے لیے نصیحت اور یاد دہانی بنا لیتا ہے۔ اگر وہ قوی الایمان ہو، تاویل میں گہرائی میں نہ گیا ہو، ظاہر کے سمندر میں غوطہ زن ہو اور کوئی چیز اسے باطنی معانی کی طرف نہ پھیرے، تو وہ اس یاد دہانی سے فائدہ اٹھاتا ہے۔ اور اگر وہ ان اوصاف اور ان جیسی چیزوں پر قائم نہ ہو اور تاویل کرے تو وہ خود بھی ہلاک ہوتا ہے اور اپنے پیروکاروں کو بھی ہلاک کرتا ہے، اور ان لوگوں میں شامل ہو جاتا ہے جنہوں نے **\"اپنی خواہشات کی پیروی کی\" (اتَّبَعُوا أَهْواءَهُمْ)**، اور جس شخص کی یہ صفت ہو اس کا معاملہ فرط (حد سے تجاوز) ہوتا ہے۔\n\nیہ ذکر اس کے لیے احوال میں عصمت پیدا کرتا ہے، اور الٰہی اسماء میں اسم الظاہر (ظاہر) اور الأول (اول) پیدا کرتا ہے، اور معارف میں معرفۃ الشہود (شہود کی معرفت) اور حق کا ظاہری تجلی (التجلی) کی صورتوں کو قبول کرنا پیدا کرتا ہے۔ اور وہ تقویٰ (التقویٰ) کے ساتھ مکمل طور پر متحقق ہوتا ہے، پس وہ اس مجہول علم کو جانتا ہے جس تک ہر کوئی نہیں پہنچ سکتا، اور وہ محسوسات، حواس، احساس اور محسوس کے اسرار کا علم ہے۔ اکثر لوگ اس سے اس لیے ناواقف رہے جو ہم بیان کرتے ہیں، اور وہ یہ ہے کہ نفوس غیبی چیزوں کو جاننے، خزانوں کو نکالنے، رموز کو حل کرنے، تالوں کو کھولنے، اور پوشیدہ امور اور حکمتوں کی باریکیوں کی تلاش کی محبت پر جبلت کیے گئے ہیں۔ اور وہ ظاہر کو کوئی اہمیت نہیں دیتے، کیونکہ ان کے گمان میں وہ صبح کے پھٹنے سے بھی زیادہ واضح ہے۔ پس دن ان کے نزدیک کسی پر پوشیدہ نہیں ہے۔\n\nپس اس ہجیر کا مالک ان ظواہر میں سے ایسا علم حاصل کرتا ہے جو کسی کے وہم و گمان میں بھی نہیں ہوتا کہ یہ وہ علم ہے جسے صاحب کشف (الکشف) نے حاصل کیا ہے، اور اس علم کو اس امر کا ظاہر اور نہ ہی اس کی صورت اٹھاتی ہے۔ پس جب صاحب یہ علم اور کشف اس پر متنبہ کرتا ہے، تو اس وقت اس کی قدر و منزلت بڑھ جاتی ہے، اور اس کی حکمت اور کثرت خیر ظاہر ہوتی ہے، اور وہ اس وقت جانتا ہے کہ وہ جسے **\"ہلکا سمجھتا تھا، حالانکہ وہ اللہ کے نزدیک عظیم تھا\" (هَيِّناً وهُوَ عِنْدَ الله عَظِيمٌ)**۔\n\nیہ سب اسم الٰہی الظاہر (ظاہر) کی طرف سے ہے، جسے امور میں تقدم حاصل ہے، اور تمام خیر اوائل میں ہی ہے۔ کیا تم نہیں دیکھتے کہ پہلا خاطر (خیال) ہی الٰہی اور سچا ہوتا ہے جو کبھی غلطی نہیں کرتا؟ پس اس کے لیے عصمت اور نفاذ ہے، اور اسی میں قدر اور قضا ظاہر ہوتی ہے۔ اسی طرح پہلی نظر، پہلی سنی ہوئی چیز اور پہلی حرکت۔ اور یہی وہ ہے جو زجر کرنے والے کو زجر کے علوم عطا کرتا ہے، اور وہ کبھی غلطی نہیں کرتے، بلکہ صحت ان کے ساتھ رہتی ہے۔ پس اوائل ہی ظواہر سابقہ ہیں۔ اور جو کچھ پہلے خاطر کے بعد آتا ہے وہ نفس کی بات ہوتی ہے جو اس کے پیچھے آتی ہے۔\n\nپس پہلے خاطر کے لیے تمہید اور توطئہ (آسان بنانا) ہے، اور یہ ظواہر عقلوں کو اس کے پیچھے کی چیزوں کی طرف شوق دلاتی ہیں۔ پس ذہین، درست رائے رکھنے والا اور ماہر شخص اس پہلے ظاہری امر سے نہیں ہٹتا جو اس پر وارد ہوا ہے، یہاں تک کہ وہ اس کی تمام حقائق اور جو کچھ اس کی صورت عطا کرتی ہے اسے پورا کر لے، اور اس کے پوشیدہ غیوب پر واقف ہو جائے۔ پس جب وہ اسے حاصل کر لیتا ہے اور اسے علم کے طور پر قبول کر لیتا ہے، تب وہ اس چیز کی طرف منتقل ہوتا ہے جو اس کے پیچھے اس پر وارد ہوتی ہے، جو کہ باطن ہے۔\n\nاگر وہ ظاہر سے ناواقف رہا تو وہ باطن سے زیادہ ناواقف ہو گا، کیونکہ ظاہر ہی باطن کی دلیل ہے۔ اور اگر اس نے پہلے کو حاصل کرنے میں کوتاہی کی تو وہ آخر کو حاصل کرنے میں زیادہ کوتاہی کرے گا، کیونکہ دوسرے خاطر کے علم کو حاصل کرنے کی حرص میں پہلے کا حصول بھی شامل ہے۔\n\nپس امر کی ابتدا خوف ہے اور رجاء (امید) اس کے پیچھے آتی ہے۔ اگر رجاء اس سے پہلے آ گئی تو خوف اس سے فوت ہو گیا، کیونکہ ماضی کو واپس نہیں لایا جا سکتا۔ پس تقدم خوف کے لیے ہے، اور وہ اس سے فوت ہو گیا اور چلا گیا۔ اور جس کے لیے اس کی ٹھنڈک ہے، اور رجاء نے اس جگہ پر اپنے غلبے سے اسے روک دیا ہے۔ پس مؤمن وہ ہے جس کا خوف اور رجاء برابر ہو، اس طرح کہ ایک دوسرے پر فضیلت نہ رکھتا ہو، کیونکہ اس نے ہر چیز کو اس کے مقام پر استعمال کیا۔\n\nاور انسان کی پہلی نشوونما ضعف ہے، اور اس کے ضعف کی وجہ سے خوف اس کے نفس پر مقدم ہوتا ہے۔ پھر اس ضعف کے بعد اسے قوت حاصل ہوتی ہے، تو رجاء اپنی قوت کے ساتھ اس کے پاس آتی ہے۔ پس علوم اور تاویلات میں اس کی نظر قوی ہوتی ہے، تو جناب حق میں اس کی رجاء عظیم ہو جاتی ہے۔ لیکن عاقل اسے اس کے مقام سے تجاوز نہیں کرنے دیتا۔ پس جب اسے رجاء کی قوت سے ایسا خیال آتا ہے جو عاقل عارف کے نزدیک خوف کے استعمال کو واجب کرتا ہے، تو وہ رجاء کو حکم میں انفرادیت سے معزول کر دیتا ہے اور خوف کو اس کے ساتھ شریک کر لیتا ہے۔ پس یہی مؤمن ہے۔\n\nوہ اسی طرح رہتا ہے یہاں تک کہ اس کی ذات اس کمال کو پہنچ جاتی ہے جس پر اولیاء اللہ (أولیاء الله) اس محمدی زمانے میں نبوی وراثت میں منتہی ہوتے ہیں، جس میں نبوت تشریع اور رسالت کا دروازہ بند کر دیا گیا، لیکن علوم الٰہیہ (العلوم الإلهیۃ) اور اسرار کے ساتھ اختصاص کے حکم کا دروازہ کھلا رہا، جس پر اہل اللہ داخل ہوتے ہیں۔ اور سب سے پہلے داخل ہونے والے اہل یہ ذکر ہیں۔ اللہ ہمیں ان لوگوں میں شامل کرے جن کا خوف اور رجاء دنیا کی زندگی میں برابر رہا، یہاں تک کہ موت کے وقت احتضار کے وقت اس کی رجاء اس کے خوف پر غالب آ جائے۔ اور **\"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)**۔",
    "fa": "باب پانصد و دوازدهم در شناخت حال قطبی که منزل او این آیه بود: «هرگاه پوست‌هایشان پخته شود، پوست‌هایی غیر از آن را جایگزینشان می‌کنیم» (كُلَّما نَضِجَتْ جُلُودُهُمْ بَدَّلْناهُمْ جُلُوداً غَيْرَها).\n\nهرگاه که شعله، پوست‌ها را پخته سازد (أنضج اللهيب جلودا)\nخداوند برای عذاب، پوست‌هایی دیگر جایگزین کند (بدل الله للعذاب جلودا)\nقضا (القضاء) همواره به سوی او منتهی می‌شود\nو قوم را در دوزخ جاودانگی (خلودا) بخشیده است\nخداوند از میان ایشان و بر علیه ایشان\nهنگامی که پرسش پایان یابد، شاهدانی (شهودا) قرار داده است\nپس چون شهادت (الشهادة) در حق ایشان ادا شود\nمالک رستگاری و نعمت جدید گردند.\n\n### [شهادت اعضا و پوست‌ها بر صاحب خود]\n\nخداوند متعال در خبر دادن از ایشان می‌فرماید: «و به پوست‌های خود می‌گویند: چرا بر ضد ما شهادت دادید؟ می‌گویند: خدایی که هر چیزی را به سخن درآورد، ما را به سخن درآورد» (وقالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنا قالُوا أَنْطَقَنَا الله). یعنی به شهادت دادن بر علیه شما، زیرا آن‌ها شاهدانی عادل و مقبول‌القول نزد حق (الحق) هستند. و در دنیا از آنچه نفس ناطقه حیوانی (النفس الناطقة الحيوانية) در زمان حکمرانی و فرمانروایی‌اش بر آن‌ها و بر تمامی جوارحشان از گوش و چشم و زبان و دست و شکم و فرج و پا و قلب تصرف می‌کرد، راضی نبودند. پوست‌ها به این نام (جلود) نامیده شدند به سبب سرسختی و مقاومت (الجلادة) که دارند، زیرا به ذات خود با تمامی ناگواری‌ها از زخم و ضرب و سوختگی و گرما و سرما مواجه می‌شوند و در آن‌ها حس وجود دارد. و پوست سپر نفس حیوانی است تا این سختی‌ها را دریافت کند. پس در انسان چیزی سرسخت‌تر (أشد جلادة) از پوستش نیست و به همین دلیل خداوند آن را پوشش او قرار داد. بنابراین، پخته شدن پوست سبب عذاب نفس مکلف است، در حالی که خود پوست در آن عذاب محسوس متنعم است. برخی از محبان گفته‌اند:\n\nآیا شنیده‌اید از عاشقی (صب)\nکه طرفش سالم و بیمار است؟ (سليم طرف سقيم)\nبه عذابی متنعم است (منعم بعذاب)\nو به نعمتی معذب؟ (معذب بنعيم)\n\nاین گرمای شدید (هجیر) گرمای شدید کسانی است که از مکر حق (الحق) می‌ترسند و با آن نفس اماره به سوء خود را نهیب می‌زنند، شاید که باز ایستد؛ اما نادانی جز به گسترش تن نمی‌دهد. و سبب آن چیزی است که خداوند از خود ذکر کرده است، یعنی اختیار مشیتش میان مغفرت و عذاب. پس او به یکی از این دو امر قطعیت نداده است. سپس سالک می‌بیند که اسماء الهی در حق او متقابل می‌شوند، آنگاه می‌بیند که اسماء فضل از نظر تعداد و قدرت بر اسماء عدل و انتقام برتری دارند. و می‌بیند که تقابل میان این اسماء تنها در میدان رحمتی رخ می‌دهد که «همه چیز را فرا گرفته است» (وَسِعَتْ كُلَّ شَيْ‏ءٍ). این امر آن‌ها را بر ارتکاب مخالفت‌ها و تجاوز از حدود و هتک محارم جسور ساخت. اگر آن‌ها به مؤاخذه شدن بر آنچه از ایشان سر زده است، در صورتی که بدون توبه بمیرند، قطعیت داشتند (چنانکه گروهی بر این عقیده‌اند)، کاری را که مولایشان نمی‌پسندید، انجام نمی‌دادند. سپس می‌بینند که در عذاب زندگی دنیا بر حکم آن صبر نمی‌کنند و طبعاً از آن می‌گریزند و جز به اجبار آن را نمی‌پذیرند. پس شخص خائف آن را برای نفس خود موعظه و تذکر قرار می‌دهد. اگر ایمانش قوی باشد و در تأویل تعمق نکرده باشد و در دریای ظاهر غوطه‌ور باشد و هیچ عاملی او را به معانی باطنی منصرف نکند، از این تذکر بهره می‌برد. اما اگر این صفات و امثال آن در او نباشد و تأویل کند، خود هلاک می‌شود و هر که از او پیروی کند را نیز به هلاکت می‌اندازد و از کسانی خواهد بود که «از هوس‌های خود پیروی کردند» (اتَّبَعُوا أَهْواءَهُمْ)، و کار کسی که چنین صفتی دارد، تباهی (فرطا) است. این ذکر برای او از میان احوال، عصمت را به بار می‌آورد و از اسماء الهی، اسم الظاهر و الأول را، و از معارف، معرفت شهود (الشهود) و پذیرش حق (الحق) صور تجلی (التجلی) ظاهری را. و به تقوا به تمام معنا متحقق می‌شود و علم مجهولی را می‌آموزد که هر کسی به آن دست نمی‌یابد، و آن علم به اسرار محسوسات و حواس و احساس و محسوس است. و اگر اکثر مردم از آن جاهلند، به دلیل چیزی است که ما می‌گوییم: و آن این است که نفوس بر دوست داشتن درک غیب‌ها، استخراج گنج‌ها، حل رمزها، گشودن قفل‌ها و جستجو از امور پنهان و دقایق حکمت سرشته شده‌اند و به ظاهر توجهی نمی‌کنند، زیرا در گمان آن‌ها، ظاهر روشن‌تر از سپیده صبح است و روز نزد آن‌ها بر کسی پوشیده نیست. پس برای صاحب این گرمای شدید (هجیر)، از علم در این ظواهر چیزی آشکار می‌شود که به خاطر هیچ کس خطور نمی‌کند که آن علمی که صاحب کشف (الکشف) به آن دست یافته است، ظاهر آن امر یا صورتش حامل آن باشد.\n\nپس هنگامی که صاحب این علم و کشف (الکشف) بر آن آگاه شود، قدر او بزرگ می‌شود و حکمت و کثرت خیرش آشکار می‌گردد و در آن هنگام می‌داند که آنچه آن را «آسان و ناچیز می‌پنداشت، نزد خدا بزرگ است» (هَيِّناً وهُوَ عِنْدَ الله عَظِيمٌ). و این همه از اسم الهی الظاهر است که تقدم در امور از آن اوست، و تمام خیر در اوائل است. آیا نمی‌بینی که خاطر اول (الخاطر الأول) همان الهام صادق الهی است که هرگز خطا نمی‌کند؟ پس عصمت و نفوذ از آن اوست و قدر و قضا در آن آشکار می‌شود. و همچنین است نظر اول، و مسموع اول، و حرکت اول. و اوست که علوم زجر را به زجرکننده می‌دهد و آن‌ها هرگز خطا نمی‌کنند، بلکه صحت همراه آن‌هاست. پس اوائل همان ظواهر پیشتاز هستند. و هر آنچه پس از خاطر اول می‌آید، حدیث نفس است که به دنبال آن می‌آید. پس تمهید و زمینه‌سازی از آن خاطر اول است، و این ظواهرند که عقول را به آنچه ورای آن‌هاست مشتاق می‌سازند. پس شخص زیرک، درستکار و ماهر از امر ظاهر اولی که بر او وارد شده است، دست نمی‌کشد تا زمانی که تمامی حقایق آن و آنچه صورتش اقتضا می‌کند را استیفا کند و بر پنهانی‌های غیب آن وقوف یابد. پس هنگامی که آن را به دست آورد و به عنوان علم پذیرفت، آنگاه به آنچه در پی آن می‌آید و باطن است، منتقل می‌شود. اگر ظاهر را نشناسد، نسبت به باطن جاهل‌تر خواهد بود، زیرا ظاهر راهنمای باطن است. و اگر در تحصیل اول کوتاهی کند، در تحصیل آخر کوتاهی بیشتری خواهد کرد، زیرا حرص بر تحصیل علم به خاطر آخر، مستلزم تحصیل خاطر اول است. پس آغاز کار خوف است و رجاء (امید) به دنبال آن می‌آید. اگر رجاء بر آن پیشی گیرد، خوف از دست رفته است، زیرا گذشته بازگردانده نمی‌شود. پس تقدم از آن خوف است، در حالی که از او فوت شده و رفته است. و کسی که رجاء در محل خود بر او غلبه کند، سلطنت خوف او را منع کرده است. پس مؤمن کسی است که خوف و رجاء او برابر باشد، به طوری که هیچ یک بر دیگری برتری نداشته باشد، زیرا او هر چیزی را در جایگاه خود به کار برده است. و اولین نشو و نمای انسان ضعف است و به دلیل ضعفش، خوف بر نفسش بر او پیشی می‌گیرد. سپس پس از این ضعف، برای او قوت حاصل می‌شود و رجاء با قوتش به سراغ او می‌آید، زیرا نظر او در علوم و تأویلات قوی می‌شود و رجاء او در جناب حق (الحق) بزرگ می‌گردد. اما عاقل آن را از جایگاهش فراتر نمی‌برد. پس اگر از قوت رجاء چیزی به او خطور کند که نزد عاقل عارف، استعمال خوف را واجب سازد، رجاء را از انفراد در حکم کنار می‌گذارد و خوف را با آن شریک می‌سازد. این شخص همان مؤمن است. و پیوسته چنین خواهد بود تا زمانی که ذات او به کمالی برسد که اولیاء الله در وراثت نبوی در این زمان محمدی به آن منتهی می‌شوند؛ زمانی که باب نبوت تشریع و رسالت بسته شد، اما باب حکم اختصاص به علوم الهی و اسرار باز ماند و اهل الله از آن وارد می‌شوند. و اولین کسانی که وارد آن می‌شوند، اهل این ذکر هستند. خداوند ما را از کسانی قرار دهد که خوف و رجاءشان در زندگی دنیا برابر باشد تا هنگام مرگ در احتضار، که در آن زمان رجاءشان بر خوفشان غلبه کند. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}