{
  "id": 251,
  "title": {
    "ar": "الباب الأحد والخمسون ومائتان في عدم الري",
    "en": "Chapter Two Hundred and Fifty-One, Concerning the Absence of Quenching.",
    "ur": "باب دو سو اکاون، عدمِ سیرابی (عدم الري) کے بیان میں",
    "fa": "باب دویست و پنجاه و یکم در عدم سیراب شدن (الري)"
  },
  "content": {
    "ar": "## «الباب الأحد والخمسون ومائتان في عدم الري»\n\n\nوقال به قوم‏\n\n\n> عدم الري دليل واضح *** أن أحكام التناهي لا تكون‏\n\n\n> قال بالري رجال غلطوا *** ورأوا أن الذي قيل يهون‏\n\n\n> وهم لو عرفوا مقداره *** ورأوا ما يقتضي كن فيكون‏\n\n\n> لم يقولوا مثل هذا وأتوا *** للذي أنكره يعتذرون‏\n\n\n### [إنا مأمورون بطلب الزيادة في العلم‏]\n\n\nأمر الله تعالى نبيه أن يقول رَبِّ زِدْنِي عِلْماً ومن طلب الزيادة فما ارتوى وما أمره إلى وقت معين ولا حد محدود بل أطلق فطلب الزيادة والعطاء دنيا وآخرة\n\n\nيقول النبي صلى الله عليه وسلم في شأن يوم القيامة فأحمده يعني إذا طلب الشفاعة بمحامد يعلمنيها الله لا أعلمها الآن‏\n\n\nفالله لا يزال خلاقا إلى غير نهاية فينا فالعلوم إلى غير نهاية وليس غرض القوم من العلم إلا ما يتعلق بالله كشفا ودلالة وكلمات الله لا تنفد وهي أعيان موجوداته فلا يزال طالب العلم عطشانا أبدا لا رى له فإن الاستعداد الذي يكون عليه يطلب علما يحصله فإذا حصل أعطاه ذلك العلم استعداد العلم آخر كوني أو إلهي فإذا علم بما حصل له أن ثم أمرا يطلبه استعداده الذي حدث له بالعلم الحاصل عن الاستعداد الأول يعطش إلى تحصيل ذلك العلم فطالب العلم كشارب ماء البحر كلما ازداد شربا ازداد عطشا والتكوين لا ينقطع فالمعلومات لا تنقطع فالعلوم لا تنقطع فأين الري فما قال به إلا من جهل ما يخلق فيه على الدوام والاستمرار ومن لا علم له بنفسه لا علم له بربه قال بعض العارفين النفس بحر لا ساحل له يشير إلى عدم النهاية وكلما دخل في الوجود أو اتصف بالوجود فهو متناه وما لم يدخل في الوجود فلا نهاية له وليس إلا الممكنات فلا يصح أن يعلم إلا محدث فإن المعلوم لم يكن ثم كان ثم يكون آخر أيضا فلو اتصف المعلوم بالوجود لتناهى واكتفى به فلا تعلم من الله إلا ما يكون منه ويوجده فيك إما إلهاما أو كشفا عن حدوث تحل وهذا كله معلوم محدث فلا علم لأحد إلا بمحدث ممكن مثله والممكنات لا تتناهى لأنها غير داخلة في الوجود دفعة واحدة بل توجد مع الآنات فلا يعلم الله إلا الله ولا يعلم الكون المحدث إلا محدثا مثله يكونه الحق فيه قال تعالى ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ وهو كلامه وحدث فيهم فتعلق علمهم به فما تعلق إلا بمحدث وذلك الذي يتخيله من لا علم له من أنه علم الله فلا صحة له لأنه لا يعلم الشي‏ء إلا بصفته النفسية الثبوتية وعلمنا بهذا محال فعلمنا بالله محال فسبحان من لا يعلم إلا بأنه لا يعلم فالعالم بالله لا يتعدى رتبته ويعلم ما يعلم أنه ممن لا يعلم والله يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ‏\n\n",
    "en": "## The Chapter Concerning the Absence of Satiation (عدم الري)\n\nAnd some people affirmed it [satiation].\n\n> The absence of satiation is a clear proof\n> That the rulings of finitude cannot apply.\n\n> Men who spoke of satiation erred,\n> And they thought that what was said was trivial.\n\n> If they had known its measure,\n> And seen what the command \"Be, and it is\" (كن فيكون) necessitates,\n\n> They would not have said such a thing,\n> And they would come apologizing to the one who denied it.\n\n### [We are Commanded to Seek Increase in Knowledge]\n\nAllah the Exalted commanded His Prophet to say: <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge). And whoever seeks increase has not been satiated. His command was not restricted to a specific time or a limited boundary, but was absolute. Thus, the seeking of increase and bestowal continues in this world and the Hereafter.\n\nThe Prophet, peace and blessings be upon him, said concerning the Day of Resurrection: \"Then I praise Him\"—meaning, when he seeks intercession—\"with praises that Allah will teach me, which I do not know now.\"\n\nAllah remains a Creator (خلاقا) without end concerning us, so the sciences (العلوم) are without end. The aim of the people [of Gnosis] regarding knowledge is only that which relates to Allah, whether through unveiling (كشفا) or indication (دلالة). And the Words of Allah are inexhaustible, and they are the Fixed Entities (أعيان موجوداته) of His existents. Therefore, the seeker of knowledge remains eternally thirsty, never achieving satiation (لا رى له).\n\nFor the preparedness (الاستعداد) upon which he exists seeks a knowledge that he attains. When he attains it, that knowledge grants him the preparedness for another knowledge, whether cosmic (كوني) or divine (إلهي). When he knows, through what he has attained, that there is yet another matter sought by the preparedness that arose in him from the knowledge gained from the first preparedness, he thirsts for the attainment of that knowledge. Thus, the seeker of knowledge is like one who drinks seawater: the more he drinks, the thirstier he becomes.\n\nAnd creation (التكوين) does not cease, so the objects of knowledge (المعلومات) do not cease, and thus the sciences (العلوم) do not cease. Where, then, is satiation? No one asserts it except one who is ignorant of what is continuously and perpetually being created within him. And whoever has no knowledge of his own self has no knowledge of his Lord.\n\nSome of the Gnostics (العارفين) said: \"The self (النفس) is a sea without a shore,\" referring to the absence of an end. Everything that enters into Existence (الوجود) or is characterized by Existence is finite (متناه). And that which has not entered into Existence has no end, and this is none other than the Possibles (الممكنات).\n\nTherefore, it is only the originated (محدث) that can be known, for the object of knowledge (المعلوم) was not, then it was, and then another will be. If the object of knowledge were characterized by [absolute] Being (الوجود), it would be finite, and one would be satisfied with it.\n\nThus, you only know of Allah that which comes from Him and which He brings into existence in you, either as inspiration (إلهاما) or as an unveiling (كشفا) concerning an originated matter that descends. And all of this is originated knowledge (معلوم محدث). Therefore, no one has knowledge except of an originated possible (ممكن) like himself. And the Possibles (الممكنات) are inexhaustible because they do not enter into Existence all at once, but rather come into existence with the moments (الآنات).\n\nTherefore, none knows Allah but Allah, and none knows the originated cosmos (الكون المحدث) except an originated being like it, which The Real (الحق) brings into existence within it. The Exalted said: <<مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ>> (No remembrance comes to them from their Lord except it is newly originated). This is His speech, and it originated within them, so their knowledge became attached to it. Thus, it is attached only to an originated thing (محدث).\n\nAnd that which the ignorant person imagines to be the knowledge of Allah is invalid, because a thing is only known by its essential, affirmative attribute (صفته النفسية الثبوتية), and our knowledge of this is impossible. Therefore, our knowledge of Allah is impossible. Glory be to Him who is only known by the fact that He is not known. Thus, the Gnostic (العالم بالله) does not exceed his own level (رتبته) and knows what he knows, knowing that he is among those who do not know. <<وَاللَّهُ يَهْدِي مَن يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ>> (And Allah guides whom He wills to a straight path).",
    "ur": "باب نمبر دو سو اکاون: سیرابی (عدم الري) کا نہ ہونا\n\nاور ایک گروہ نے اس کی تائید کی ہے۔\n\n> سیرابی کا نہ ہونا ایک واضح دلیل ہے،\n> کہ محدودیت (التناهي) کے احکام لاگو نہیں ہوتے۔\n\n> سیرابی کا قول کرنے والے لوگ غلطی پر تھے،\n> اور انہوں نے سمجھا کہ جو کچھ کہا گیا وہ آسان ہے۔\n\n> اور اگر وہ اس کی قدر و منزلت جانتے،\n> اور دیکھتے کہ \"کن فیکون\" (ہو جا، پس وہ ہو جاتا ہے) کیا تقاضا کرتا ہے۔\n\n> تو وہ ایسی بات نہ کہتے، اور جس چیز کا انہوں نے انکار کیا تھا،\n> اس کے لیے معذرت کرتے۔\n\n### [ہمیں علم میں اضافے کے طلب کا حکم دیا گیا ہے]\n\nاللہ تعالیٰ نے اپنے نبی کو حکم دیا کہ وہ کہیں: \"رَبِّ زِدْنِي عِلْماً\" (اے میرے رب! میرے علم میں اضافہ فرما)۔ اور جس نے اضافے کی طلب کی، وہ سیراب نہیں ہوا، اور یہ حکم کسی مخصوص وقت یا محدود حد تک نہیں دیا گیا، بلکہ اسے مطلق رکھا گیا، لہٰذا اضافے اور عطا کی طلب دنیا اور آخرت دونوں میں جاری ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم قیامت کے دن کے بارے میں فرماتے ہیں: \"فأحمده\" (پس میں اس کی حمد کروں گا)، یعنی جب آپ شفاعت طلب کریں گے تو ان تعریفوں کے ذریعے جو اللہ مجھے سکھائے گا، جنہیں میں ابھی نہیں جانتا۔\n\nپس اللہ تعالیٰ ہم میں ہمیشہ کے لیے خالق (خلاق) ہے، لہٰذا علوم کی کوئی انتہا نہیں۔ اور اس گروہ کا علم سے مقصد صرف وہ ہے جو ذات حق (الحق) سے متعلق ہو، خواہ وہ کشف (الکشف) کے ذریعے ہو یا دلالت کے ذریعے۔ اور اللہ کے کلمات ختم نہیں ہوتے، اور وہ اس کی موجودات کی حقیقتیں ہیں۔ پس طالب علم ہمیشہ پیاسا رہتا ہے، اسے کبھی سیرابی حاصل نہیں ہوتی۔\n\nکیونکہ جس استعداد پر وہ ہوتا ہے، وہ ایک علم کا تقاضا کرتی ہے جسے وہ حاصل کرتا ہے۔ جب وہ حاصل ہو جاتا ہے، تو وہ علم اسے کسی دوسرے کونی یا الٰہی علم کی استعداد عطا کرتا ہے۔ پس جب وہ اس حاصل شدہ علم سے جانتا ہے کہ کوئی اور امر ہے جس کا تقاضا اس کی نئی استعداد کر رہی ہے جو اسے پہلے علم کے حصول سے حاصل ہوئی تھی، تو وہ اس علم کے حصول کے لیے پیاسا ہو جاتا ہے۔ پس طالب علم سمندر کا پانی پینے والے کی مانند ہے، جتنا وہ زیادہ پیتا ہے، اتنا ہی اس کی پیاس بڑھتی ہے۔ اور تخلیق (التكوين) کا سلسلہ منقطع نہیں ہوتا، لہٰذا معلومات منقطع نہیں ہوتیں، پس علوم منقطع نہیں ہوتے۔ تو سیرابی کہاں ہے؟ پس سیرابی کا قول صرف اسی نے کیا جس نے اس چیز سے لاعلمی برتی جو اس میں ہمیشہ اور مسلسل تخلیق کی جا رہی ہے۔ اور جسے اپنی ذات کا علم نہیں، اسے اپنے رب کا علم نہیں۔\n\nبعض عارفین نے کہا ہے: \"نفس ایک ایسا سمندر ہے جس کا کوئی ساحل نہیں\"، یہ عدمِ انتہا کی طرف اشارہ ہے۔ اور جو کچھ بھی ہستی (الوجود) میں داخل ہوا یا ہستی (الوجود) سے متصف ہوا، وہ محدود (متناہ) ہے۔ اور جو ہستی (الوجود) میں داخل نہیں ہوا، اس کی کوئی انتہا نہیں، اور وہ صرف ممکنات ہیں۔ لہٰذا یہ درست نہیں کہ علم صرف حادث (محدث) کا ہو، کیونکہ معلوم پہلے نہیں تھا، پھر ہوا، اور پھر کوئی دوسرا بھی ہو گا۔ پس اگر معلوم ہستی (الوجود) سے متصف ہو جاتا تو وہ محدود ہو جاتا اور اس پر اکتفا کر لیا جاتا۔\n\nپس تم اللہ کی طرف سے صرف وہی جانتے ہو جو اس کی طرف سے ہوتا ہے اور جسے وہ تم میں موجود کرتا ہے، خواہ وہ الہام کے ذریعے ہو یا کسی حادث (حدوث) کے کشف (الکشف) کے ذریعے جو تم میں حلول کرتا ہے۔ اور یہ سب کچھ معلومِ حادث (محدث) ہے۔ لہٰذا کسی کو بھی علم نہیں ہوتا مگر اپنے جیسے ممکنِ حادث (محدث) کا۔ اور ممکنات کی کوئی انتہا نہیں، کیونکہ وہ ایک ہی وقت میں ہستی (الوجود) میں داخل نہیں ہوتیں، بلکہ لمحہ بہ لمحہ موجود ہوتی ہیں۔ پس اللہ کو صرف اللہ ہی جانتا ہے، اور کائناتِ حادث (الکون المحدث) کو صرف اس کے جیسا حادث (محدث) ہی جانتا ہے جسے ذات حق (الحق) اس میں تخلیق کرتا ہے۔\n\nاللہ تعالیٰ فرماتا ہے: \"مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ\" (ان کے رب کی طرف سے ان کے پاس کوئی نئی نصیحت نہیں آتی)۔ اور یہ اس کا کلام ہے جو ان میں حادث ہوا، پس ان کا علم اس سے متعلق ہوا، اور وہ صرف ایک حادث (محدث) سے متعلق ہوا۔ اور وہ شخص جو علم نہیں رکھتا، جو یہ گمان کرتا ہے کہ یہ اللہ کا علم ہے، تو یہ درست نہیں۔ کیونکہ کسی شے کو صرف اس کی ذاتی ثبوتی صفت کے ذریعے ہی جانا جا سکتا ہے، اور ہمارا اس کے ذریعے علم حاصل کرنا محال ہے، لہٰذا ہمارا اللہ کا علم حاصل کرنا محال ہے۔ پس پاک ہے وہ ذات جسے صرف اسی طرح جانا جاتا ہے کہ اسے جانا نہیں جا سکتا۔ پس اللہ کو جاننے والا (العالم بالله) اپنے مرتبے سے تجاوز نہیں کرتا، اور وہ جانتا ہے کہ جو کچھ وہ جانتا ہے وہ ان چیزوں میں سے ہے جنہیں جانا نہیں جا سکتا۔ اور \"وَاللَّهُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ\" (اور اللہ جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے)۔",
    "fa": "باب دویست و پنجاه و یکم در باب عدم سیرابی (عدم الري)\n\nو گروهی به آن قائل شدند.\n\n> عدم سیرابی دلیلی آشکار است *** که احکام پایان‌پذیری (تناهی) وجود ندارند.\n> مردانی که قائل به سیرابی شدند، خطا کردند *** و گمان بردند آنچه گفته شده آسان است.\n> و اگر قدر آن را می‌دانستند *** و آنچه را که مقتضای «کُن فَیَکون» است می‌دیدند،\n> چنین سخنی نمی‌گفتند و می‌آمدند *** تا از آنچه انکار کرده‌اند، عذرخواهی کنند.\n\n### [ما مأمور به طلب فزونی در علم هستیم]\n\nخداوند متعال پیامبرش را امر فرمود که بگوید: رَبِّ زِدْنِي عِلْماً (پروردگارا، علم مرا بیفزای). و کسی که طلب فزونی کند، سیراب نشده است. و امر او به وقت معین یا حد محدودی مقید نشد، بلکه مطلق گذاشته شد؛ پس طلب فزونی و بخشش در دنیا و آخرت ادامه دارد.\n\nپیامبر (صلی الله علیه و سلم) در شأن روز قیامت می‌فرماید: «فأحمده» (پس او را ستایش می‌کنم)؛ یعنی هنگامی که شفاعت می‌طلبد، با ستایش‌هایی که خداوند به او می‌آموزد و اکنون آن‌ها را نمی‌داند.\n\nپس خداوند پیوسته و تا بی‌نهایت در ما آفریننده (خلاق) است، لذا علوم نیز تا بی‌نهایت ادامه دارند. و مقصود این قوم از علم، تنها آن چیزی است که به حق (الحق) از طریق کشف (الکشف) و دلالت مربوط می‌شود. و کلمات خداوند پایان نمی‌پذیرند، و آن‌ها همان اعیان موجودات او هستند. پس طالب علم همواره تشنه است و هرگز سیرابی (ری) برای او نیست. زیرا استعدادی که شخص بر آن است، علمی را می‌طلبد تا آن را به دست آورد. و چون آن علم حاصل شود، آن علم به او استعداد علم دیگری را می‌دهد، خواه آن علم کونی باشد یا الهی. پس هنگامی که با آنچه به دست آورده است، می‌داند که امری وجود دارد که استعداد جدیدش که به واسطه علم حاصل از استعداد اول پدید آمده، آن را می‌طلبد، تشنه تحصیل آن علم می‌شود. پس طالب علم مانند نوشنده آب دریاست؛ هرچه بیشتر بنوشد، تشنگی‌اش بیشتر می‌شود. و تکوین (آفرینش) قطع نمی‌شود، پس معلومات قطع نمی‌شوند، پس علوم قطع نمی‌شوند. پس سیرابی کجاست؟\n\nپس کسی قائل به آن (سیرابی) نشده است مگر کسی که نسبت به آنچه پیوسته و مستمر در او خلق می‌شود، جاهل باشد. و کسی که به نفس خود علم ندارد، به پروردگارش نیز علم ندارد. برخی از عارفان (العارفین) گفته‌اند: «نفس دریایی است که ساحلی ندارد»، که اشاره به عدم نهایت دارد.\n\nو هر آنچه وارد هستی (الوجود) شده یا به هستی متصف گشته، متناهی است. و آنچه وارد هستی نشده، بی‌نهایت است، و آن چیزی جز ممکنات نیست. پس صحیح نیست که جز مُحدَث (نوپدید) دانسته شود. زیرا معلوم (آنچه دانسته می‌شود) نبوده، سپس بوده، و سپس چیز دیگری نیز خواهد بود. اگر معلوم به هستی (الوجود) متصف می‌شد، متناهی می‌گشت و به آن اکتفا می‌شد. پس از خداوند نمی‌دانی مگر آنچه از او صادر می‌شود و آن را در تو ایجاد می‌کند، خواه به صورت الهام باشد یا کشف (الکشف) از حدوثی که در تو فرود می‌آید. و این همه معلومی مُحدَث است. پس هیچ کس علمی ندارد مگر به مُحدَث ممکنی مانند خودش. و ممکنات پایان نمی‌پذیرند، زیرا یکباره وارد هستی (الوجود) نمی‌شوند، بلکه همراه با آنات (لحظات) موجود می‌شوند.\n\nپس خداوند را جز خداوند نمی‌داند، و کون مُحدَث (جهان نوپدید) را جز مُحدَثی مانند خودش که حق (الحق) آن را در او ایجاد می‌کند، نمی‌داند. خداوند متعال می‌فرماید: ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ (هیچ یادآوری نوپدیدی از پروردگارشان به سوی آنان نمی‌آید). و آن کلام اوست و در ایشان پدید آمده است، پس علمشان به آن تعلق گرفته است، و این تعلق جز به مُحدَث نبوده است. و آنچه کسی که علم ندارد، تخیل می‌کند که آن علم خداوند است، صحت ندارد؛ زیرا شیء دانسته نمی‌شود مگر به صفت نفسانی ثبوتی‌اش، و علم ما به این محال است، پس علم ما به خداوند محال است. پس منزه است کسی که دانسته نمی‌شود مگر به اینکه دانسته نمی‌شود. پس عارف (العالم) به خداوند از مرتبه خود تجاوز نمی‌کند و می‌داند آنچه را که می‌داند، از کسی است که دانسته نمی‌شود. و وَاللَّهُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ (و خداوند هر که را بخواهد به راه راست هدایت می‌کند)."
  },
  "page_count": 1
}