{
  "id": 541,
  "title": {
    "ar": "الباب الأحد والأربعون وخمسمائة في معرفة حال قطب كان منزله ومن يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذاباً كَبِيراً",
    "en": "Chapter 541: Concerning the Knowledge of the State of a Pole (قطب) whose Station was: <<وَمَن يَظْلِمْ مِنكُمْ نُذِقْهُ عَذَابًا كَبِيرًا>> (And whoever among you commits injustice, We shall make him taste a great punishment).",
    "ur": "باب پانچ سو اکتالیس: ایک قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور تم میں سے جو کوئی ظلم کرے گا، ہم اسے بڑا عذاب چکھائیں گے\" (وَمَن يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذَاباً كَبِيراً)۔",
    "fa": "باب پانصد و چهل و یکم در معرفت حال قطبی که منزلگاهش این آیه بود: «و هر کس از شما ستم کند، عذابی بزرگ به او می‌چشانیم» (وَمَن يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذاباً كَبِيراً)."
  },
  "content": {
    "ar": "## «الباب الأحد والأربعون وخمسمائة في معرفة حال قطب كان منزله ومن يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذاباً كَبِيراً»\n\n\n> نصرة الله لنفس الظالم *** نصرة ليس لها من خاذل‏\n> فإذا ما ظلم الغير له *** حكم ما شاء بحكم فاصل‏\n\n\n> وحقوق الله أولى وكذا *** حق نفسي بعدها للعاقل‏\n\n\n> ثم حق الغير في رتبته *** آخرا عند العليم الفاضل‏\n\n\n> وعذاب الظلم ذوق فاحذروا *** منه في العاجل أو في الآجل‏\n\n\n> وعلوم الذوق ما يجهلها *** من يرى أحكامها في العاجل‏\n\n\n### [إن من حقيقة الممكن العجز]\n\n\nأيدنا الله وإياك بروح القدس أن الظلم هنا هو الظلم الذي جاء في قوله تعالى الَّذِينَ آمَنُوا ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ وليس إلا الظلم الذي قال فيه لقمان لابنه لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ كذا فسره رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فمن التزم هذا الذكر بهذه الآية أقامه الحق مقامه في العالم وقلده أمر عباده ولو بلغ العبد ما عسى إن يبلغ لا يزال خلقا ومن حقيقة الممكن العجز فلا بد من القصور في رتبة التصريف ذوقا فلا بد أن يحصل له من العذاب النفسي ذوق كبير لأنه ليس في قوته إن يرضي العالم فإن الله ما أرضاهم ولله الاتساع الذي لا يمكن أن يكون للعبد ولو اتسع الخليفة ما اتسع فإن ضيق الطبيعة لا بد أن يحكم عليه فيضيق عن السعة الإلهية فيتعذب بقدر ما ذاق العذاب الكبير هذا وهو وال من عند الله بأمر الله قال تعالى في حق الكامل ولَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ يعني في حق الله وتكذيبه فهذا هو العذاب الكبير الذي ذاقه وظلمه المذكور في هذا الذكر إنما كان لكونه قبل الولاية عن العرض الإلهي فهو مع الأمر يضيق ولا يسمى ظالما ومع العرض يكون ظالما ويذوق العذاب الكبير إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ وأي أمانة أعظم من النيابة عن الحق في عباده فلا يصرفهم إلا بالحق فلا بد من الحضور الدائم ومن مراقبة التصريف فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها أي خفن أن لا يقمن بحقها فاستبرأن لأنفسهن وحَمَلَهَا الْإِنْسانُ عرضا أيضا لما وجد في نفسه من قوة الصورة التي خلق عليها إِنَّهُ كانَ ظَلُوماً لنفسه وهو قوله ومن يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذاباً كَبِيراً فإذا ظلم نفسه بقبول النيابة المعروضة عليه أذاقه الله ما قال الله لأبي يزيد أخرج إلى عبادي بصورتي يعني خليفة فمن رآك رآني فلما خطا عنه خطوة غشى عليه فقال الحق ردوا على حبيبي فلا صبر له عني فالنيابة مع الأمر يكون فيها الحرج وضيق الصدر فكيف بالعرض فمن زهد في الخلافة المعروضة فمن هذا الذكر زهد وتركها ولم يقبلها وأشفق منها ومن قبلها من أصحاب هذا الذكر فبتأويل دخل لهم في أول الدخول في هذا الذكر وهو لفظة العذاب فإنه من العذوبة وهي التلذذ بالأمر وهو قول أبي يزيد في بعض أحواله‏\n\n\n> وكل مآربي قد نلت منها *** سوى ملذوذ وجدي بالعذاب‏\n\n\nولم يقل بالآلام وإنما قال بالعذاب لما فيه من العذوبة وهي اللذة باللذة أي أنه يلتذ باللذة لا أنه يلتذ بالأشياء وهذا مثل ما يقوله أهل النظر في العلم إن بالعلم يعلم العلم وبالرؤية ترى الرؤية في مذهب المتكلمين وكذلك تدرك اللذة باللذة فاعلم ذلك فإنه باب غريب في الذكر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 541: On knowing the state of a Pole whose station was: <<And whoever among you commits injustice, We shall make him taste a great punishment>>\n\n> Allah's support for the soul of the wrongdoer\n> Is a support that has no abandoner.\n> So when others commit injustice against him,\n> He judges as He wills with a decisive judgment.\n\n> And the rights of Allah are foremost, and likewise\n> The right of my own soul comes next for the intelligent one.\n\n> Then the right of others is in its rank,\n> Last, according to the Knowing, Excellent One.\n\n> And the punishment of injustice is a tasting (ذوق), so beware\n> Of it, whether in this world or the Hereafter.\n\n> And the sciences of tasting (ذوق) are not unknown\n> To him who sees their rulings in this world.\n\n### [Indeed, incapacity is part of the reality of the contingent being]\n\nMay Allah support us and you with the Holy Spirit. The injustice (الظلم) referred to here is the injustice mentioned in His exalted saying: <<الَّذِينَ آمَنُوا ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ>> (Those who believe and do not mix their faith with injustice). And it is none other than the injustice about which Luqman said to his son: <<لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ>> (Do not associate partners with Allah. Indeed, polytheism is a great injustice). This is how the Messenger of Allah, peace and blessings be upon him, interpreted it.\n\nWhoever adheres to this invocation (الذكر) with this verse, The Real (الحق) establishes him in his station in the world and entrusts him with the affairs of His servants. Yet, no matter what degree the servant may reach, he remains a creature (خلق). And incapacity (العجز) is part of the reality of the contingent being (الممكن). Therefore, there must inevitably be deficiency (القصور) in the degree of administration (التصريف) through tasting (ذوق). Thus, he must necessarily experience a great tasting (ذوق كبير) of spiritual punishment (العذاب النفسي), because it is not within his power to satisfy the world, for Allah Himself has not satisfied them.\n\nAnd to Allah belongs the vastness (الاتساع) that cannot possibly belong to the servant. Even if the Caliph (الخليفة) expands, he cannot encompass everything, for the narrowness of nature (ضيق الطبيعة) must inevitably govern him, causing him to fall short of the Divine Vastness (السعة الإلهية). Thus, he suffers punishment commensurate with the great punishment (العذاب الكبير) he has tasted. This is the case even though he is a governor appointed by Allah, by Allah's command.\n\nAllah the Exalted said concerning the Perfect Human (الكامل): <<ولَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ>> (And We certainly know that your breast is constrained by what they say)—meaning regarding Allah and their denial of Him. This is the great punishment that he tasted. His injustice mentioned in this invocation was only due to his acceptance of the vicegerency (الولاية) based on the Divine Offer (العرض الإلهي). When acting by Divine Command (الأمر), his breast is constrained but he is not called unjust. But when acting based on the Offer, he becomes unjust and tastes the great punishment.\n\n<<إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ>> (Indeed, We offered the Trust (الأمانة) to the heavens and the earth and the mountains). And what trust is greater than acting as the deputy (النيابة) of The Real (الحق) over His servants? He administers them only by The Real, necessitating permanent presence (الحضور الدائم) and constant vigilance over the administration (التصريف). <<فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها>> (But they refused to bear it and were afraid of it)—meaning they feared they would not fulfill its due right, so they sought acquittal for themselves. <<وحَمَلَهَا الْإِنْسانُ>> (And the human being carried it), also by way of offer, because of the strength of the form upon which he was created that he found within himself. <<إِنَّهُ كانَ ظَلُوماً>> (Indeed, he was unjust) to his own soul. This is the meaning of His saying: <<ومن يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذاباً كَبِيراً>> (And whoever among you commits injustice, We shall make him taste a great punishment).\n\nSo when he commits injustice against his soul by accepting the deputyship offered to him, Allah makes him taste what Allah said to Abu Yazid: \"Go out to My servants in My form\"—meaning as a Caliph (خليفة)—\"so whoever sees you sees Me.\" When Abu Yazid took one step away from Him, he fainted. The Real then said, \"Bring My beloved back to Me, for he has no patience to be away from Me.\"\n\nTherefore, deputyship when accompanied by Command involves constraint (الحرج) and narrowness of the breast (ضيق الصدر); how much more so when it is by Offer? Whoever renounced the offered Caliphate did so based on this invocation, abandoning and refusing it, and fearing it. As for those who accepted it among the people of this invocation, it was due to an interpretation (تأويل) that entered their minds at the beginning of their engagement with this invocation, specifically the word *al-ʿadhāb* (العذاب). For *al-ʿadhāb* derives from *al-ʿudhūbah* (العذوبة), which is sweetness, meaning the enjoyment (التلذذ) of the Command. This is the saying of Abu Yazid in some of his states:\n\n> And all my desires I have attained from them,\n> Except the sweetness of my ecstasy (وجد) in punishment (العذاب).\n\nHe did not say \"in pains,\" but rather \"in punishment,\" because of the sweetness (*al-ʿudhūbah*) contained within it, which is pleasure in pleasure (اللذة باللذة). That is, he takes pleasure in the pleasure itself, not in the things [that cause pleasure]. This is similar to what the people of speculative thought (أهل النظر) say regarding Knowledge (العلم): that by Knowledge, Knowledge is known, and by Vision, Vision is seen, according to the doctrine of the theologians (المتكلمين). Likewise, pleasure is perceived by pleasure. Know this, for it is a strange chapter concerning the invocation. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر پانچ سو اکتالیس: اس قطب کے حال کی معرفت میں جس کی منزل یہ تھی: \"اور تم میں سے جو کوئی ظلم کرے گا، ہم اسے بڑا عذاب چکھائیں گے\" (وَمَنْ يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذَابًا كَبِيرًا)\n\nظالم کی جان کے لیے اللہ کی مدد\nایسی مدد ہے جسے کوئی چھوڑنے والا نہیں\nاور جب وہ کسی دوسرے پر ظلم کرتا ہے\nتو وہ فیصلہ کن حکم سے جو چاہے حکم دیتا ہے\n\nاور اللہ کے حقوق سب سے اولیٰ ہیں، اور اسی طرح\nعاقل کے لیے اس کے بعد میری جان کا حق ہے\nپھر دوسروں کا حق ان کے مرتبے میں ہے\nجو علیم و فاضل (جاننے والے اور فضیلت والے) کے نزدیک سب سے آخر میں ہے\n\nاور ظلم کا عذاب ایک ذوق (ذائقہ) ہے، سو اس سے بچو\nدنیا میں یا آخرت میں\nاور ذوق (ذائقہ) کے علوم سے وہ جاہل نہیں ہوتا\nجو دنیا میں ہی اس کے احکام دیکھ لیتا ہے\n\n[بے شک ممکن (مخلوق) کی حقیقت میں عجز شامل ہے]\n\nاللہ ہمیں اور آپ کو روح القدس کے ذریعے تائید عطا فرمائے۔ یہاں ظلم سے مراد وہ ظلم ہے جو اللہ تعالیٰ کے اس فرمان میں آیا ہے: \"وہ لوگ جو ایمان لائے اور اپنے ایمان کو ظلم کے ساتھ آلودہ نہیں کیا\" (الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ)۔ اور یہ صرف وہی ظلم ہے جو لقمان نے اپنے بیٹے سے کہا تھا: \"اللہ کے ساتھ شرک نہ کرنا، بے شک شرک بہت بڑا ظلم ہے\" (لَا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ)۔ رسول اللہ صلی اللہ علیہ وسلم نے بھی اس کی یہی تفسیر فرمائی ہے۔ پس جو شخص اس آیت کے ساتھ اس ذکر کو لازم پکڑتا ہے، الحق (ذات حق) اسے عالم میں اس کے مقام پر فائز کر دیتا ہے اور اسے اپنے بندوں کے معاملات کا قلادہ پہنا دیتا ہے۔ اور اگرچہ بندہ جو کچھ بھی حاصل کرنا چاہے، وہ پھر بھی مخلوق ہی رہتا ہے، اور ممکن (مخلوق) کی حقیقت میں عجز شامل ہے۔ لہٰذا، تصرف (تصریف) کے مرتبے میں ذوقاً (ذائقے کے اعتبار سے) کمی کا ہونا لازمی ہے۔ پس اسے نفسانی عذاب کا ایک بڑا ذوق (ذائقہ) ضرور حاصل ہوتا ہے، کیونکہ اس کی طاقت میں نہیں ہے کہ وہ تمام عالم کو راضی کر سکے۔\n\nکیونکہ اللہ نے انہیں راضی نہیں کیا، اور اللہ کے لیے وہ وسعت ہے جو بندے کے لیے ممکن نہیں ہو سکتی۔ اگرچہ خلیفہ کتنی ہی وسعت حاصل کر لے، طبیعت کی تنگی اس پر ضرور غالب آئے گی، اور وہ وسعت الٰہیہ سے تنگ ہو جائے گا۔ پس وہ اسی قدر عذاب پائے گا جس قدر اس نے بڑا عذاب چکھا (ذاق العذاب الکبیر)۔ یہ اس حال میں ہے کہ وہ اللہ کے حکم سے اللہ کی طرف سے والی (حکمران) ہے۔ اللہ تعالیٰ نے (الإنسان الکامل) کامل کے حق میں فرمایا: \"اور ہم یقیناً جانتے ہیں کہ جو کچھ وہ کہتے ہیں اس سے آپ کا سینہ تنگ ہوتا ہے\" (وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ)۔ یعنی اللہ کے حق میں اور اس کی تکذیب کے بارے میں۔ پس یہی وہ بڑا عذاب ہے جو اس نے چکھا (ذاقہ)۔ اور اس ذکر میں مذکور اس کا ظلم صرف اس وجہ سے تھا کہ اس نے ولایت کو عرض الٰہی (الٰہی پیشکش) کے طور پر قبول کیا۔ پس وہ امر (حکم) کے ساتھ تنگ ہوتا ہے لیکن ظالم نہیں کہلاتا، اور عرض (پیشکش) کے ساتھ ظالم ہوتا ہے اور بڑا عذاب چکھتا ہے۔\n\n\"بے شک ہم نے امانت کو آسمانوں، زمین اور پہاڑوں پر پیش کیا\" (إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ)۔ اور کون سی امانت اس سے بڑی ہو سکتی ہے کہ بندوں میں الحق (ذات حق) کی نیابت کی جائے؟ پس وہ ان پر صرف الحق (حق) کے ساتھ ہی تصرف (تصریف) کرتا ہے۔ لہٰذا، دائمی حضور اور تصرف کی نگرانی لازمی ہے۔ \"تو انہوں نے اسے اٹھانے سے انکار کر دیا اور اس سے ڈر گئے\" (فَأَبَيْنَ أَنْ يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا)۔ یعنی انہیں خوف ہوا کہ وہ اس کا حق ادا نہیں کر پائیں گے، لہٰذا انہوں نے اپنی جانوں کو بری کر لیا۔ اور \"اسے انسان نے اٹھا لیا\" (وَحَمَلَهَا الْإِنْسَانُ)۔ یہ بھی عرضاً (پیشکش کے طور پر) تھا، جب اس نے اپنے اندر اس صورت کی قوت پائی جس پر وہ خلق کیا گیا تھا۔ \"بے شک وہ اپنی جان پر بڑا ظلم کرنے والا تھا\" (إِنَّهُ كَانَ ظَلُومًا)۔ اور یہی اس کا قول ہے: \"اور تم میں سے جو کوئی ظلم کرے گا، ہم اسے بڑا عذاب چکھائیں گے\" (وَمَنْ يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذَابًا كَبِيرًا)۔ پس جب اس نے اپنے اوپر پیش کی گئی نیابت کو قبول کر کے اپنی جان پر ظلم کیا، تو اللہ نے اسے وہی چکھایا جو اللہ نے بایزید بسطامی سے فرمایا تھا: \"میری صورت میں میرے بندوں کے پاس جاؤ، یعنی خلیفہ بن کر، پس جو تمہیں دیکھے گا وہ مجھے دیکھے گا۔\" جب انہوں نے اس سے ایک قدم آگے بڑھایا تو ان پر غشی طاری ہو گئی، تو الحق (ذات حق) نے فرمایا: \"میرے حبیب کو واپس لاؤ، اسے مجھ سے دوری پر صبر نہیں ہے۔\"\n\nپس نیابت جب امر (حکم) کے ساتھ ہو تو اس میں بھی تنگی اور سینے کی گھٹن ہوتی ہے، تو عرض (پیشکش) کے ساتھ کیسی ہوگی؟ پس جس نے پیش کی گئی خلافت (نیابت) سے زہد اختیار کیا، تو اس نے اسی ذکر کی وجہ سے زہد کیا، اسے چھوڑ دیا اور قبول نہیں کیا، اور اس سے ڈر گیا۔ اور جس نے اس ذکر کے اصحاب میں سے اسے قبول کیا، تو یہ ایک تاویل کی وجہ سے تھا جو انہیں اس ذکر میں داخل ہوتے وقت حاصل ہوئی، اور وہ لفظ \"عذاب\" ہے، کیونکہ یہ \"عذوبۃ\" (شیرینی، مٹھاس) سے ہے، اور یہ امر (حکم) سے لذت حاصل کرنا ہے۔ اور یہ بایزید بسطامی کا قول ہے ان کے بعض احوال میں:\n\nمیں نے اپنی تمام مرادیں حاصل کر لیں\nسوائے عذاب کے ساتھ اپنے وجد کی لذت کے\n\nاور انہوں نے \"آلام\" (تکلیفیں) نہیں کہا، بلکہ \"عذاب\" کہا، کیونکہ اس میں عذوبۃ (شیرینی) شامل ہے، اور وہ لذت کے ساتھ لذت حاصل کرنا ہے۔ یعنی وہ لذت سے لذت حاصل کرتا ہے نہ کہ اشیاء سے لذت حاصل کرتا ہے۔ اور یہ اس کی مثال ہے جو اہل نظر علم کے بارے میں کہتے ہیں کہ علم کے ذریعے علم کو جانا جاتا ہے، اور متکلمین کے مذہب میں رؤیت (دیکھنے) کے ذریعے رؤیت کو دیکھا جاتا ہے۔ اسی طرح لذت کو لذت کے ذریعے ادراک کیا جاتا ہے۔ پس یہ جان لو، کیونکہ یہ ذکر میں ایک عجیب باب ہے، اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و چهل و یکم در معرفت حال قطبی که منزل او این آیه بود: «و هر کس از شما ستم کند، عذابی بزرگ به او می‌چشانیم.» (وَمَن يَظْلِم مِّنكُمْ نُذِقْهُ عَذَابًا كَبِيرًا)\n\nیاری خداوند برای نفس ستمکار\nیاری‌ای است که هیچ خوارکننده‌ای ندارد.\nو هرگاه دیگری بر او ستم کند،\nبه حکم قاطع، هر چه بخواهد حکم می‌کند.\n\nو حقوق خداوند اولویت دارد، و همچنین\nحق نفس من پس از آن برای خردمند.\n\nسپس حق دیگری در مرتبه خود،\nدر آخر نزد دانای برتر.\n\nو عذاب ستم، چشیدنی (ذوق) است، پس برحذر باشید\nاز آن در این دنیا (عاجل) یا در آخرت (آجل).\n\nو علوم ذوق را نادان نمی‌شمارد\nکسی که احکام آن را در این دنیا می‌بیند.\n\n### [همانا از حقیقت ممکن، عجز است]\n\nخداوند ما و شما را به روح القدس تأیید کند که ستم در اینجا همان ستمی است که در این فرموده خداوند متعال آمده است: «آنان که ایمان آوردند و ایمان خود را به ستمی نیالودند.» (الَّذِينَ آمَنُوا ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ) و آن ستم نیست مگر ستمی که لقمان به پسرش گفت: «به خدا شرک نورز، همانا شرک ستمی بزرگ است.» (لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ) رسول خدا (صلی الله علیه و سلم) نیز آن را چنین تفسیر کرده است. پس هر کس به این ذکر با این آیه ملتزم شود، حق (الحق) او را در جهان به مقام خود برپا می‌دارد و امر بندگانش را به او می‌سپارد. و اگرچه بنده به هر مقامی برسد، باز هم مخلوق است و از حقیقت ممکن (الممکن)، عجز است. پس ناگزیر در مرتبه تدبیر (التصريف) از روی ذوق (ذوق) قصوری خواهد داشت. بنابراین، ناچار عذاب نفسانی بزرگی را از روی ذوق (ذوق) تجربه خواهد کرد، زیرا در توان او نیست که جهانیان را راضی کند. زیرا خداوند آنان را راضی نکرده است، و وسعتی که برای خداوند است، ممکن نیست برای بنده باشد. و اگرچه خلیفه به هر اندازه وسعت یابد، تنگی طبیعت ناگزیر بر او حکم می‌راند و از وسعت الهی تنگ می‌آید، پس به اندازه آنچه از عذاب بزرگ چشیده است، معذب می‌شود.\n\nاین در حالی است که او والی‌ای از جانب خداوند و به امر اوست. خداوند متعال در حق انسان کامل (الكامل) می‌فرماید: «و به تحقیق می‌دانیم که سینه تو به سبب آنچه می‌گویند تنگ می‌شود.» (وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ) یعنی در حق خداوند و تکذیب او. پس این همان عذاب بزرگی است که او چشیده است. و ستم او که در این ذکر آمده است، تنها به این دلیل بود که ولایت را از طریق عرضه الهی (العرض الإلهي) پذیرفت. پس با امر (الهی) دچار تنگی می‌شود و ظالم نامیده نمی‌شود، اما با عرضه (الهی) ظالم می‌شود و عذاب بزرگ را می‌چشد. «ما امانت را بر آسمان‌ها و زمین و کوه‌ها عرضه کردیم.» (إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ) و چه امانتی بزرگ‌تر از نیابت از حق (النيابة عن الحق) در میان بندگانش؟ پس او بندگان را جز به حق تدبیر نمی‌کند، و ناگزیر باید حضور دائم و مراقبت بر تدبیر (التصريف) داشته باشد. «پس از حمل آن سر باز زدند و از آن ترسیدند.» (فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها) یعنی ترسیدند که نتوانند حق آن را به جا آورند، پس خود را مبرا ساختند. «و انسان آن را حمل کرد» (وَحَمَلَهَا الْإِنْسانُ)؛ این پذیرش نیز از طریق عرضه (عرضاً) بود، زیرا در نفس خود نیروی صورتی را که بر آن خلق شده بود، یافت. «همانا او بسیار ستمکار (ظلوم) است» (إِنَّهُ كانَ ظَلُوماً) نسبت به نفس خود. و این همان فرموده است: «و هر کس از شما ستم کند، عذابی بزرگ به او می‌چشانیم.» (وَمَن يَظْلِم مِّنكُمْ نُذِقْهُ عَذَابًا كَبِيرًا)\n\nپس هرگاه با پذیرش نیابتی که بر او عرضه شده است، به نفس خود ستم کند، خداوند آنچه را که به ابویزید فرمود، به او می‌چشاند: «به صورت من نزد بندگانم برو» یعنی به عنوان خلیفه، «پس هر کس تو را ببیند، مرا دیده است.» فلما ابویزید یک گام از حق دور شد، بیهوش گشت. پس حق (الحق) فرمود: «محبوبم را بازگردانید، زیرا او صبر دوری از مرا ندارد.» پس نیابت همراه با امر (الهی) نیز سختی (الحرج) و تنگی سینه (ضيق الصدر) دارد، حال چگونه خواهد بود اگر با عرضه (الهی) باشد؟ پس هر کس که نسبت به خلافت عرضه شده زهد ورزید، از همین ذکر زهد ورزید و آن را ترک کرد و نپذیرفت و از آن ترسید. و کسانی از اصحاب این ذکر که آن را پذیرفتند، به تأویلی (تأويل) بود که در ابتدای ورود به این ذکر برایشان حاصل شد، و آن لفظ «عذاب» است. زیرا عذاب (العذاب) از عذوبت (العذوبة) به معنای لذت بردن از امر (الهی) است. و این همان سخن ابویزید در برخی احوالش است:\n\nو به همه آرزوهایم رسیدم،\nجز لذت وجد (وجد) من به عذاب.\n\nو نگفت «به آلام» (دردها)، بلکه گفت «به عذاب» (العذاب)، به دلیل آنچه در آن از عذوبت (العذوبة) وجود دارد، که همان لذت بردن از لذت است. یعنی او از لذت، لذت می‌برد، نه اینکه از اشیاء لذت ببرد. و این مانند چیزی است که اهل نظر (أهل النظر) در علم می‌گویند که علم به وسیله علم دانسته می‌شود، و در مذهب متکلمین، رؤیت به وسیله رؤیت دیده می‌شود. و همچنین لذت به وسیله لذت درک می‌شود. پس این را بدان، زیرا بابی غریب در این ذکر است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}