{
  "id": 64,
  "title": {
    "ar": "الباب الرابع والستون في معرفة القيامة ومنازلها وكيفية البعث",
    "en": "Chapter Sixty-Four: Concerning the Gnosis (المعرفة) of the Resurrection (القيامة), its Stations (منازل), and the Manner of the Raising (البعث).",
    "ur": "چونسٹھواں باب: قیامت (القیامۃ) کی معرفت (المعرفۃ)، اس کے منازل، اور بعث (البعث) کی کیفیت کے بیان میں۔",
    "fa": "باب شصت و چهارم در معرفت قیامت و منازل آن و چگونگی برانگیختن (بعث)"
  },
  "content": {
    "ar": "## (الباب الرابع والستون في معرفة القيامة ومنازلها وكيفية البعث)\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> يوم المعارج من خَمْسِينَ أَلْفَ سَنَةٍ *** يطير عن كل نوام به وسنه‏\n\n\n> والأرض من حذر عليه ساهرة *** لا تأخذنها لما يقضي الإله سنه‏\n\n\n> فكن غريبا ولا تركن لطائفة *** من الخوارج أهل الألسن اللسنه‏\n\n\n> وإن رأيت امرأ يسعى لمفسدة *** فخذ على يده تجزى به حسنة\n\n\n> ولتعتصم حذرا بالكهف من رجل *** تريك فتنته يوما كمثل سنه‏\n\n\n> قد مد خطوته في غير طاعته *** ولم يزل في هواه خالعا رسنه‏\n\n\n### [معنى يوم القيامة]\n\n\nاعلم أنه إنما سمي هذا اليوم يوم القيامة لقيام الناس فيه من قبورهم لرب العالمين في النشأة الآخرة التي ذكرناها في البرزخ في الباب الذي قبل هذا الباب ولقيامهم أيضا إذا جاء الحق للفصل والقضاء والْمَلَكُ صَفًّا صَفًّا قال الله تعالى يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعالَمِينَ أي من أجل رب العالمين حين يأتي وجاء بالاسم الرب إذ كان الرب المالك فله صفة\nالقهر وله صفة الرحمة ولم يأت بالاسم الرحمن لأنه لا بد من الغضب في ذلك اليوم كما سيرد في هذا الباب ولا بد من الحساب والإتيان بجهنم والموازين وهذه كلها ليست من صفات الرحمة المطلقة التي يطلبها الاسم الرحمن غير أنه سبحانه أتى باسم إلهي تكون الرحمة فيه أغلب وهو الاسم الرب فإنه من الإصلاح والتربية فتقوى ما في المالك والسيد من فضل الرحمة على ما فيه من صفة القهر فتسبق رحمته غضبه ويكثر التجاوز عن سيئات أكثر الناس‏\n\n\n### [ظواهر القيامة ومشاهدها]\n\n\nفأول ما أبين وأقول ما قال الله في ذلك اليوم من امتداد الأرض وقبض السماء وسقوطها على الأرض ومجي‏ء الملائكة ومجي‏ء الرب في ذلك اليوم وأين يكون الخلق حين تمد الأرض وتبدل صورتها وتجي‏ء جهنم وما يكون من شأنها ثم أسوق حديث مواقف القيامة في خَمْسِينَ أَلْفَ سَنَةٍ وحديث الشفاعة اعلم يا أخي أن الناس إذا قاموا من قبورهم على ما سنورده إن شاء الله وأراد الله أن يبدل الأرض غير الأرض وتمد الأرض بإذن الله ويكون الجسر دون الظلمة فيكون الخلق عليه عند ما يبدل الله الأرض كيف يشاء إما بالصورة وإما بأرض أخرى ما نيم عليها تسمى الساهرة فيمدها سبحانه مد الأديم يقول تعالى وإِذَا الْأَرْضُ مُدَّتْ ويزيد في سعتها ما شاء أضعاف ما كانت من أحد وعشرين جزءا إلى تسعة وتسعين جزءا حتى لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً ثم إنه سبحانه يقبض السماء إليه فيطويها بيمينه كَطَيِّ السِّجِلِّ لِلْكُتُبِ ثم يرميها على الأرض التي مدها واهية وهو قوله وانْشَقَّتِ السَّماءُ فَهِيَ يَوْمَئِذٍ واهِيَةٌ ويرد الخلق إلى الأرض التي مدها فيقفون منتظرين ما يصنع الله بهم فإذا وهت السماء نزلت ملائكتها على أرجائها فيرى أهل الأرض خلقا عظيما أضعاف ما هم عليه عددا فيتخيلون إن الله نزل فيهم لما يرون من عظم المملكة مما لم يشاهدوه من قبل فيقولون أ فيكم ربنا فتقول الملائكة سبحان ربنا ليس فينا وهو آت فتصطف الملائكة صفا مستديرا على نواحي الأرض محيطين بالعالم الإنس والجن وهؤلاء هم عمار السماء الدنيا ثم ينزل أهل السماء الثانية بعد ما يقبضها الله أيضا ويرمي بكوكبها في النار وهو المسمى كاتبا وهم أكثر عددا من السماء الأولى فتقول الخلائق أ فيكم ربنا فتفزع الملائكة من قولهم فيقولون سبحان ربنا ليس هو فينا وهو آت فيفعلون فعل الأولين من الملائكة يصطفون خلفهم صفا ثانيا مستديرا ثم ينزل أهل السماء الثالثة ويرمي بكوكبها المسمى الزهرة في النار ويقبضها الله بيمينه فتقول الخلائق أ فيكم ربنا فتقول الملائكة سبحان ربنا ليس هو فينا وهو آت فلا يزال الأمر هكذا سماء بعد سماء حتى ينزل أهل السماء السابعة فيرون خلقا أكثر من جميع من نزل فتقول الخلائق أ فيكم ربنا فتقول الملائكة سُبْحانَ رَبِّنا قد جاء ربنا وإِنْ كانَ وَعْدُ رَبِّنا لَمَفْعُولًا\n\n\n### [نزول الرب في ظلل من الغمام‏]\n\n\nفيأتي الله في ظُلَلٍ من الْغَمامِ والْمَلائِكَةُ وعلى المجنة اليسرى جهنم ويكون إتيانه إتيان الملك فإنه يقول ملك (مالِكِ) يَوْمِ الدِّينِ وهو ذلك اليوم فسمي بالملك ويصطف الملائكة عليهم السلام سبعة صفوف محيطة بالخلائق فإذا أبصر الناس جهنم لها فوران وتغيظ على الجبابرة المتكبرين فيفرون الخلق بأجمعهم منها لعظيم ما يرونه خوفا وفزعا وهو الفزع الأكبر إلا الطائفة التي لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ وتَتَلَقَّاهُمُ الْمَلائِكَةُ هذا يَوْمُكُمُ الَّذِي كُنْتُمْ تُوعَدُونَ فهم الآمنون مع النبيين على أنفسهم غير إن النبيين تفزع على أممها للشفقة التي جبلهم الله عليها للخلق فيقولون في ذلك اليوم سلم سلم وكان الله قد أمر أن تنصب للآمنين من خلقه منابر من نور متفاضلة بحسب منازلهم في الموقف فيجلسون عليها آمنين مبشرين وذلك قبل مجي‏ء الرب تعالى فإذا فر الناس خوفا من جهنم وفرقا لعظيم ما يرون من الهول في ذلك اليوم يجدون الملائكة صفوفا لا يتجاوزونهم فتطردهم الملائكة وزعة الملك الحق سبحانه وتعالى إلى المحشر وتناديهم أنبياؤهم ارجعوا ارجعوا فينادي بعضهم بعضا فهو قول الله تعالى فيما يقول رسول الله صلى الله عليه وسلم إِنِّي أَخافُ عَلَيْكُمْ يَوْمَ التَّنادِ يَوْمَ تُوَلُّونَ مُدْبِرِينَ ما لَكُمْ من الله من عاصِمٍ والرسل تقول اللهم سلم سلم ويخافون أشد الخوف على أممهم والأمم يخافون على أنفسهم والمطهرون المحفوظون الذين ما تدنست بواطنهم بالشبه المضلة ولا ظواهرهم أيضا بالمخالفات الشرعية آمنون بغبطهم النبيون في الذي هم عليه من الأمن لما هم النبيون عليه من الخوف على أممهم‏\n\n\n### [نداءات الحق الثلاث يوم الموقف‏]\n\n\nفينادي مناد من قبل الله يسمعه أهل الموقف لا يدرون أو لا أدري هل ذلك نداء الحق سبحانه بنفسه أو نداء عن أمره سبحانه يقول في ذلك النداء يا أهل الموقف ستعلمون اليوم من أصحاب الكرم فإنه قال لنا يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ تعليما له‏\nوتنبيها ليقول كرمك ولقد سمعت شيخنا الشنختة يقول يوما وهو يبكي يا قوم لا تفعلوا بكرمه أخرجنا ولم نكن شيئا وعلمنا ما لم نكن نعلم وامتن علينا ابتداء بالإيمان به وبكتبه ورسله ونحن لا نعقل أ فتراه يعذبنا بعد أن عقلنا وآمنا حاشى كرمه سبحانه من ذلك فأبكاني بكاء فرح وبكى الحاضرون ثم نرجع ونقول فيقول الحق في ذلك النداء أين الذين كانت تَتَجافى‏ جُنُوبُهُمْ عَنِ الْمَضاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفاً وطَمَعاً ومِمَّا رَزَقْناهُمْ يُنْفِقُونَ فيؤتى بهم إلى الجنة ثم يسمعون من قبل الحق نداء ثانيا لا أدري هل ذلك نداء الحق بنفسه أو نداء عن أمر الحق أين الذين كانوا لا تُلْهِيهِمْ تِجارَةٌ ولا بَيْعٌ عَنْ ذِكْرِ الله وإِقامِ الصَّلاةِ وإِيتاءِ الزَّكاةِ يَخافُونَ يَوْماً تَتَقَلَّبُ فِيهِ الْقُلُوبُ والْأَبْصارُ لِيَجْزِيَهُمُ الله أَحْسَنَ ما عَمِلُوا ويَزِيدَهُمْ من فَضْلِهِ وتلك الزيادة كما قلنا من جنات الاختصاص فيؤمر بهم إلى الجنة ثم يسمعون نداء ثالثا لا أدري هل هو نداء الحق بنفسه أو نداء عن أمر الحق يا أهل الموقف ستعلمون اليوم من أصحاب الكرم أين الذين صَدَقُوا ما عاهَدُوا الله عَلَيْهِ لِيَجْزِيَ الله الصَّادِقِينَ بِصِدْقِهِمْ فيؤمر بهم إلى الجنة\n\n\n### [العنق المستشرف من النار ونداءاته الثلاث يوم الموقف‏]\n\n\nفبعد هذا النداء يخرج عنق من النار فإذا أشرف على الخلائق وله عينان ولسان فصيح يقول يا أهل الموقف إني وكلت منكم بثلاث كما كان النداء الأول ثلاث مرات لثلاث طوائف من أهل السعادة وهذا كله قبل الحساب والناس وقوف قد ألجمهم العرق واشتد الخوف وتصدعت القلوب لهول المطلع فيقول ذلك العنق المستشرف من النار عليهم إني وكلت بكل جبار عنيد فيلقطهم من بين الصفوف كما يلقط الطائر حب السمسم فإذا لم يترك أحدا منهم في الموقف نادى نداء ثانيا يا أهل الموقف إني وكلت بمن آذى الله ورسوله فيلقطهم كما يلقط الطائر حب السمسم من بين الخلائق فإذا لم يترك منهم أحد نادى ثالثة يا أهل الموقف إني وكلت بمن ذهب يخلق كخلق الله فيلقط أهل التصاوير وهم الذين يصورون صورا في الكنائس لتعبد تلك الصور والذين يصورون الأصنام وهو قوله تعالى أَ تَعْبُدُونَ ما تَنْحِتُونَ فكانوا ينحتون لهم الأخشاب والأحجار ليعبدوها من دون الله فهؤلاء هم المصورون فيلقطهم من بين الصفوف كما يلقط الطير حب السمسم فإذا أخذهم الله عن آخرهم بقي الناس وفيهم المصورون الذين لا يقصدون بتصويرهم ما قصدها أولئك من عباداتها حتى يسألوا عنها لينفخوا فيها أرواحا تحيا بها وليسوا بنافخين كما\n\n\nورد في الخبر في المصورين فيقفون ما شاء الله ينتظرون ما فعل الله بهم والعرق قد ألجمهم‏\n\n\n### [مواقف القيامة الخمسون‏]\n\n\nفحدثنا شيخنا القصار بمكة سنة تسع وتسعين وخمسمائة تجاه الركن اليماني من الكعبة المعظمة وهو يونس ابن يحيى بن الحسين بن أبي البركات الهاشمي العباسي من لفظه وأنا أسمع قال حدثنا أبو الفضل محمد بن عمر بن يوسف الارموي قال حدثنا أبو بكر محمد بن علي بن محمد بن موسى بن جعفر المعروف بابن الخياط المغربي قال قرئ على أبي سهل محمود بن عمر بن إسحاق العكبري وأنا أسمع قيل له حدثكم رضي الله عنكم أبو بكر محمد بن الحسن النقاش فقال نعم حدثنا أبو بكر قال حدثنا أبو بكر أحمد بن الحسين بن علي الطبري المروزي قال حدثنا محمد بن حميد الرازي أبو عبد الله قال حدثنا سلمة بن صالح قال أنا القاسم بن الحكم عن سلام الطويل عن غياث بن المسيب عن عبد الرحمن بن غنم وزيد بن وهب عن عبد الله بن مسعود قال كنت جالسا عند علي بن أبي طالب رضي الله عنه وعنده عبد الله بن عباس رضي الله عنه وحوله عدة من أصحاب رسول الله صلى الله عليه وسلم فقال علي رضي الله عنه قال رسول الله صلى الله عليه وسلم إن في القيامة لخمسين موقفا كل موقف منها ألف سنة فأول موقف إذا خرج الناس من قبورهم يقومون على أبواب قبورهم ألف سنة عراة حفاة جياعا عطاشا فمن خرج من قبره مؤمنا بربه مؤمنا بنبيه مؤمنا بجنته وناره مؤمنا بالبعث والقيامة مؤمنا بالقضاء والقدر خيره وشره مصدقا بما جاء به محمد صلى الله عليه وسلم من عند ربه نجا وفاز وغنم وسعد ومن شك في شي‏ء من هذا بقي في جوعه وعطشه وغمه وكربه ألف سنة حتى يقضي الله فيه بما يشاء\n\n\n### [السوق إلى سرادقات الحساب العشرة]\n\n\nثم يساقون من ذلك المقام إلى المحشر فيقفون على أرجلهم ألف عام في سرادقات النيران في حر الشمس والنار عن أيمانهم والنار عن شمائلهم والنار من بين أيديهم والنار من خلفهم والشمس من فوق رءوسهم ولا ظل إلا ظل العرش فمن لقي الله تبارك وتعالى شاهدا له بالإخلاص مقرا بنبيه صلى الله عليه وسلم بريئا من الشرك ومن السحر وبريئا من إهراق دماء المسلمين ناصحا لله ولرسوله محبا لمن أطاع الله ورسوله مبغضا لمن عصى الله ورسوله استظل تحت ظل عرش‏\nالرحمن ونجا من غمه ومن حاد عن ذلك ووقع في شي‏ء من هذه الذنوب بكلمة واحدة أو تغير قلبه أو شك في شي‏ء من دينه بقي ألف سنة في الحر والهم والعذاب حتى يقضي الله فيه بما يشاء\n\n\n### [السوق إلى النور والظلمة]\n\n\nثم يساق الخلق إلى النور والظلمة فيقيمون في تلك الظلمة ألف عام فمن لقي الله تبارك وتعالى لم يشرك به شيئا ولم يدخل في قلبه شي‏ء من النفاق ولم يشك في شي‏ء من أمر دينه وأعطى الحق من نفسه وقال الحق وأنصف الناس من نفسه وأطاع الله في السر والعلانية ورضي بقضاء الله وقنع بما أعطاه الله خرج من الظلمة إلى النور في مقدار طرفة العين مبيضا وجهه قد نجا من الغموم كلها ومن خالف في شي‏ء منها بقي في الغم والهم ألف سنة ثم خرج منها مسودا وجهه وهو في مشيئة الله يفعل به ما يشاء\n\n\n### [السوق إلى سرادقات الحساب العشرة]\n\n\nثم يساق الخلق إلى سرادقات الحساب وهي عشر سرادقات يقفون في كل سرادق منها ألف سنة فيسأل ابن آدم عند أول سرادق منها عن المحارم فإن لم يكن وقع في شي‏ء منها جاز إلى السرادق الثاني فيسأل عن الأهواء فإن كان نجا منها جاز إلى السرادق الثالث فيسأل عن عقوق الوالدين فإن لم يكن عاقا جاز إلى السرادق الرابع فيسأل عن حقوق من فوض الله إليه أمورهم وعن تعليمهم القرآن وعن أمر دينهم وتأديبهم فإن كان قد فعل جاز إلى السرادق الخامس فيسأل عما ملكت يمينه فإن كان محسنا إليهم جاز إلى السرادق السادس فيسأل عن حق قرابته فإن كان قد أدى حقوقهم جاز إلى السرادق السابع فيسأل عن صلة الرحم فإن كان وصولا لرحمه جاز إلى السرادق الثامن فيسأل عن الحسد فإن كان لم يكن حاسدا جاز إلى السرادق التاسع فيسأل عن المكر فإن لم يكن مكر بأحد جاز إلى السرادق العاشر فيسأل عن الخديعة فإن لم يكن خدع أحدا نجا ونزل في ظل عرش الله تعالى قارة عينه فرحا قلبه ضاحكا فوه وإن كان قد وقع في شي‏ء من هذه الخصال بقي في كل موقف منها ألف عام جائعا عطشانا حزنا مغموما مهموما لا ينفعه شفاعة شافع‏\n\n\n### [المحشر ومواقفه الخمسة عشر]\n\n\nثم يحشرون إلى أخذ كتبهم بإيمانهم وشمائلهم فيحبسون عند ذلك في خمسة عشر موقفا كل موقف منها ألف سنة فيسألون في أول موقف منها عن الصدقات وما فرض الله عليهم في أموالهم فمن أداها كاملة جاز إلى الموقف الثاني فيسأل عن قول الحق والعفو عن الناس فمن عفا عفا الله عنه وجاز إلى الموقف الثالث فيسأل عن الأمر بالمعروف فإن كان آمرا بالمعروف جاز إلى الموقف الرابع فيسأل عن النهي عن المنكر فإن كان ناهيا عن المنكر جاز إلى الموقف الخامس فيسأل عن حسن الخلق فإن كان حسن الخلق جاز إلى الموقف السادس فيسأل عن الحب في الله والبغض في الله فإن كان محبا في الله مبغضا في الله جاز إلى الموقف السابع فيسأل عن مال الحرام فإن لم يكن أخذ شيئا جاز إلى الموقف الثامن فيسأل عن شرب الخمر فإن لم يكن شرب من الخمر شيئا جاز إلى الموقف التاسع فيسأل عن الفروج الحرام فإن لم يكن أتاها جاز إلى الموقف العاشر فيسأل عن قول الزور فإن لم يكن قاله جاز إلى الموقف الحادي عشر فيسأل عن الايمان الكاذبة فإن لم يكن حلفها جاز إلى الموقف الثاني عشر فيسأل عن أكل الربا فإن لم يكن أكله جاز إلى الموقف الثالث عشر فيسأل عن قذف المحصنات فإن لم يكن قذف المحصنات أو افترى على أحد جاز إلى الموقف الرابع عشر فيسأل عن شهادة الزور فإن لم يكن شهدها جاز إلى الموقف الخامس عشر فيسأل عن البهتان فإن لم يكن بهت مسلما مر فنزل تحت لواء الحمد وأعطى كتابه بيمينه ونجا من غم الكتاب وهو له وحوسب حِساباً يَسِيراً وإن كان قد وقع في شي‏ء من هذه الذنوب ثم خرج من الدنيا غير تائب من ذلك بقي في كل موقف من هذه الخمسة عشر موقفا ألف سنة في الغم والهول والهم والحزن والجوع والعطش حتى يقضي الله عز وجل فيه بما يشاء\n\n\n### [أخذ الكتب بالأيمان والشمائل وقراءتها]\n\n\nثم يقام الناس في قراءة كتبهم ألف عام فمن كان سخيا قد قدم ماله ليوم فقره وحاجته وفاقته قرأ كتابه وهون عليه قراءته وكسي من ثياب الجنة وتوج من تيجان الجنة وأقعد تحت ظل عرش الرحمن آمنا مطمئنا وإن كان بخيلا لم يقدم ماله ليوم فقره وفاقته أعطى كِتابَهُ بِشِمالِهِ ويقطع له من مقطعات النيران يقاوم على رءوس الخلائق ألف عام في الجوع والعطش والعرى والهم والغم والحزن والفضيحة حتى يقضي الله عز وجل فيه بما يشاء\n\n\n### [الحشر إلى الميزان‏]\n\n\nثم يحشر الناس إلى الميزان فيقومون عند الميزان ألف عام فمن رجح ميزانه بحسناته فاز ونجا في طرفة عين ومن خف ميزانه من حسناته وثقلت سيئاته حبس عند الميزان ألف عام في الغم والهم والحزن والعذاب والجوع والعطش حتى يقضي الله فيه بما يشاء\n\n\n### [الوقوف بين يدي الله في اثني عشر موقفا]\n\n\nثم يدعي بالخلق إلى الموقف بين يدي الله في اثني عشر موقفا كل موقف منها مقدار ألف عام فيسأل في أول موقف عن عتق الرقاب‏\nفإن كان أعتق رقبة أعتق الله رقبته من النار وجاز إلى الموقف الثاني فيسأل عن القرآن وحقه وقراءته فإن جاء بذلك تاما جاز إلى الموقف الثالث فيسأل عن الجهاد فإن كان جاهد في سبيل الله محتسبا جاز إلى الموقف الرابع فيسأل عن الغيبة فإن لم يكن اغتاب جاز إلى الموقف الخامس فيسأل عن النميمة فإن لم يكن نماما جاز إلى الموقف السادس فيسأل عن الكذب فإن لم يكن كذابا جاز إلى الموقف السابع فيسأل عن طلب العلم فإن كان طلب العلم وعمل به جاز إلى الموقف الثامن فيسأل عن العجب فإن لم يكن معجبا بنفسه في دينه ودنياه أو في شي‏ء من عمله جاز إلى الموقف التاسع فيسأل عن التكبر فإن لم يكن تكبر على أحد جاز إلى الموقف العاشر فيسأل عن القنوط من رحمة الله فإن لم يكن قنط من رحمة الله جاز إلى الموقف الحادي عشر فيسأل عن الأمن من مكر الله فإن لم يكن أمن من مكر الله جاز إلى الموقف الثاني عشر فيسأل عن حق جاره فإن كان أدى حق جاره أقيم بين يدي الله تعالى قريرا عينه فرحا قلبه مبيضا وجهه كاسيا ضاحكا مستبشرا فيرحب به ربه ويبشره برضاه عنه فيفرح عند ذلك فرحا لا يعلمه أحد إلا الله فإن لم يأت بواحدة منهن تامة ومات غير تائب حبس عند كل موقف ألف عام حتى يقضي الله عز وجل فيه بما يشاء\n\n\n### [الصراط المضروبة عليه الجسور على جهنم‏]\n\n\nثم يؤمر بالخلائق إلى الصراط فينتهون إلى الصراط وقد ضربت عليه الجسور على جهنم أدق من الشعر وأحد من السيف وقد غابت الجسور في جهنم مقدار أربعين ألف عام ولهيب جهنم بجانبها يلتهب وعليها حسك وكلاليب وخطاطيف وهي سبعة جسور يحشر العباد كلهم عليها وعلى كل جسر منها عقبة مسيرة ثلاثة آلاف عام ألف عام صعود وألف عام استواء وألف عام هبوط وذلك قول الله عز وجل إِنَّ رَبَّكَ لَبِالْمِرْصادِ يعني على تلك الجسور وملائكة يرصدون الخلق عليها ليسأل العبد عن الايمان بالله فإن جاء به مؤمنا مخلصا لا شك فيه ولا زيغ جاز إلى الجسر الثاني فيسأل عن الصلاة فإن جاء بها تامة جاز إلى الجسر الثالث فيسأل عن الزكاة فإن جاء بها تامة جاز إلى الجسر الرابع فيسأل عن الصيام فإن جاء به تاما جاز إلى الجسر الخامس فيسأل عن حجة الإسلام فإن جاء بها تامة جاز إلى الجسر السادس فيسأل عن الطهر فإن جاء به تاما جاز إلى الجسر السابع فيسأل عن المظالم فإن كان لم يظلم أحدا جاز إلى الجنة وإن كان قصر في واحدة منهن حبس على كل جسر منها ألف سنة حتى يقضي الله عز وجل فيه بما يشاء وذكر الحديث إلى آخره‏\n\n\nوسيأتي بقية الحديث إن شاء الله في باب الجنة فإنه يختص بالجنة ولم نذكر النشأة الأخرى التي يحشر فيها الإنسان في باب البرزخ لأنها نشأة محسوسة غير خيالية والقيامة أمر محقق موجود حسي مثل ما هو الإنسان في الدنيا فلذلك أخرنا ذكرها إلى هذا الباب‏\n\n\n### (وصل) [في الحشر والنشر]\n\n\n### [اختلاف الناس في الإعادة من المؤمنين‏]\n\n\nاعلم أن الناس اختلفوا في الإعادة من المؤمنين القائلين بحشر الأجسام ولم نتعرض لمذهب من يحمل الإعادة والنشأة لآخرة على أمور عقلية غير محسوسة فإن ذلك على خلاف ما هو الأمر عليه لأنه جهل إن ثم نشأتين نشأة الأجسام ونشأة الأرواح وهي النشأة المعنوية فأثبتوا المعنوية ولم يثبتوا المحسوسة ونحن نقول بما قاله هذا المخالف من إثبات النشأة الروحانية المعنوية لا بما خالف فيه وأن عين موت الإنسان هو قيامته لكن القيامة الصغرى‏\n\n\nفإن النبي صلى الله عليه وسلم يقول من مات فقد قامت قيامته‏\n\n\nوإن الحشر جمع النفوس الجزئية إلى النفس الكلية هذا كله أقول به كما يقول المخالف وإلى هنا ينتهي حديثه في القيامة ويختلف في ذلك بعينه من يقول بالتناسخ ومن لا يقول به وكلهم عقلاء أصحاب نظر ويحتجون في ذلك كله بظواهر آيات من الكتاب وأخبار من السنة إن أوردناها وتكلمنا عليها طال الباب في الخوض معهم في تحقيق ما قالوه وما منهم من نحل نحلة في ذلك إلا وله وجه حق صحيح وإن القائل به فهم بعض مراد الشارع ونقصه علم ما فهمه غيره من إثبات الحشر المحسوس في الأجسام المحسوسة والميزان المحسوس والصراط المحسوس والنار والجنة المحسوستان كل ذلك حق وأعظم في القدرة\n\n\n### [علم الطبيعة لا ينفي بقاء الأجسام الطبيعة إلى غير مدة متناهية]\n\n\nوفي علم الطبيعة بقاء الأجسام الطبيعية في الدارين إلى غير مدة متناهية بل مستمرة الوجود وأن الناس ما عرفوا من أمر الطبيعة إلا قدر ما أطلعهم الحق عليه من ذلك مما ظهر لهم في مدد حركات الأفلاك والكواكب السبعة ولهذا جعلوا العمر الطبيعي مائة وعشرين سنة الذي اقتضاه هذا الحكم فإذا زاد الإنسان على هذه المدة وقع في العمر المجهول وإن كان من الطبيعة ولم يخرج عنها ولكن ليس في قوة علمه أن يقطع عليه بوقت مخصوص فكما زاد على العمر الطبيعي سنة وأكثر جاز أن يزيد على ذلك آلافا من السنين وجاز\nأن يمتد عمره دائما ولو لا أن الشرع عرف بانقضاء مدة هذه الدار وأن كل نفس ذائقة الموت وعرف بالإعادة وعرف بالدار الآخرة وعرف بأن الإقامة فيها في النشأة الآخرة إلى غير نهاية ما عرفنا ذلك وما خرجنا في كل حال من موت وإقامة وبعث أخروي ونشأة أخرى وجنان ونعيم ونار وعذاب بأكل محسوس وشرب محسوس ونكاح محسوس ولباس على المجرى الطبيعي فعلم الله أوسع وأتم والجمع بين العقل والحس والعقول والمحسوس أعظم في القدرة وأتم في الكمال الإلهي ليستمر له سبحانه في كل صنف من الممكنات حكم عالم الغيب والشهادة ويثبت حكم الاسم الظاهر والباطن في كل صنف‏\n\n\n### [المعاد- اى الحشر- هو جسماني وروحاني‏]\n\n\nفإن فهمت فقد وفقت وتعلم أن العلم الذي أطلع عليه النبيون والمؤمنون من قبل الحق أعم تعلقا من علم المنفردين بما تقتضيه العقول مجردة عن الفيض الإلهي فالأولى بكل ناصح نفسه الرجوع إلى ما قالته الأنبياء والرسل على الوجهين المعقول والمحسوس إذ لا دليل للعقل يحيل ما جاءت به الشرائع على تأويل مثبتي المحسوس من ذلك والمعقول فالإمكان باق حكمه والمرجح موجود فبما ذا يحيل وما أحسن قول القائل‏\n\n\n> زعم المنجم والطبيب كلاهما *** لا تبعث الأجسام قلت إليكما\n\n\n> إن صح قولكما فلست بخاسر *** أو صح قولي فالخسار عليكما\n\n\nفقوله فالخسار عليكما يريد حيث لم يؤمنوا بظاهر ما جاءتهم به الرسل عليهم السلام وقوله فلست بخاسر فإني مؤمن أيضا بالأمور المعنوية المعقولة مثلكم وزدنا عليكم بأمر آخر لم تؤمنوا أنتم به ولم يرد القائل به أنه يشك بقوله إن صح وإنما ذلك على مذهبك أيها المخاطب وهذا يستعمل مثله كثيرا فتدبر كلامي هذا وألزم الايمان نفسك تربح وتسعد إن شاء الله تعالى‏\n\n\n### [كيفية الإعادة- المعاد- والحشر والنشر]\n\n\nوبعد أن تقرر هذا فاعلم إن الخلاف الذي وقع بين المؤمنين القائلين في ذلك بالحس والمحسوس إنما هو راجع إلى كيفية الإعادة فمنهم من ذهب إلى أن الإعادة تكون في الناس مثل ما بدأهم بنكاح وتناسل وابتداء خلق من طين ونفخ كما جرى من خلق آدم وحواء وسائر البنين من نكاح واجتماع إلى آخر مولود في العالم البشرى الإنساني وكل ذلك في زمان صغير ومدة قصيرة على حسب ما يقدره الحق تعالى هكذا زعم الشيخ أبو القاسم بن قسي في خلع النعلين له في قوله تعالى كَما بَدَأَكُمْ تَعُودُونَ فلا أدري هل هو مذهبه أو هل قصد شرح المتكلم به وهو خلف الله الذي جاء بذلك الكلام وكان من الأميين ومنهم من قال بالخبر المروي إن السماء تمطر مطرا شبه المني تمخض به الأرض فتنشأ منه النشأة الآخرة وأما قوله تعالى عندنا كَما بَدَأَكُمْ تَعُودُونَ هو قوله ولَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولى‏ فَلَوْ لا تَذَكَّرُونَ وقوله كَما بَدَأْنا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْداً عَلَيْنا وقد علمنا إن النشأة الأولى أوجدها الله تعالى على غير مثال سبق فهكذا النشأة الآخرة يوجدها الله تعالى على غير مثال سبق مع كونها محسوسة بلا شك وقد ذكر رسول الله صلى الله عليه وسلم من صفة نشأة أهل الجنة والنار ما يخالف ما هي عليه هذه النشأة الدنيا فعلمنا إن ذلك راجع إلى عدم مثال سابق ينشئها عليه وهو أعظم في القدرة وأما قوله وهُوَ أَهْوَنُ عَلَيْهِ فلا يقدح فيما قلنا فإنه لو كانت النشأة الأولى عن اختراع فكر وتدبر ونظر إلى أن خلق أمرا فكانت إعادته إلى أن يخلق خلقا آخر مما يقارب ذلك ويزيد عليه أقرب للاختراع والاستحضار في حق من يستفيد الأمور بفكره والله منزه عن ذلك ومتعال عنه علوا كبيرا فهو الذي يفيد العالم ولا يستفيد ولا يتجدد له علم بشي‏ء بل هو عالم بتفصيل ما لا يتناهى بعلم كلي فعلم التفصيل في عين الإجمال وهكذا ينبغي لجلاله أن يكون‏\n\n\n### [عجب الذنب ما تقوم عليه النشأة الانسانية وهو لا يبلى‏]\n\n\nفينشئ الله النشأة الآخرة على عجب الذنب الذي يبقى من هذه النشأة الدنيا وهو أصلها فعليه تركب النشأة الآخرة فأما أبو حامد فرأى إن العجب المذكور في الخبر أنه النفس وعليها تنشأ النشأة الآخرة وقال غيره مثل أبي زيد الرقراقي هو جوهر فرد يبقى من هذه النشأة الدنيا لا يتغير عليه تنشأ النشأة الأخرى وكل ذلك محتمل ولا يقدح في شي‏ء من الأصول بل كلها توجيهات معقولة يحتمل كل توجيه منها أن يكون مقصودا والذي وقع لي به الكشف الذي لا أشك فيه إن المراد بعجب الذنب هو ما تقوم عليه النشأة وهو لا يبلى أي لا يقبل البلى‏\n\n\n### [النفختان واشتعال الصور البرزخية بأرواحها]\n\n\nفإذا أنشأ الله النشأة الآخرة وسواها وعدلها وإن كانت هي الجواهر بأعيانها فإن الذوات الخارجة إلى الوجود من العدم لا تنعدم أعيانها بعد وجودها ولكن تختلف فيها الصور بالامتزاجات والامتزاجات التي تعطي هذه الصور أعراض تعرض لها بتقدير العزيز العليم فإذا تهيأت هذه الصور\nكانت كالحشيش المحرق وهو الاستعداد لقبول الأرواح كاستعداد الحشيش بالنارية التي فيه لقبول الاشتعال والصور البرزخية كالسرج مشتعلة بالأرواح التي فيها فينفخ إسرافيل نفخة واحدة فتمر تلك النفخة على تلك الصور البرزخية فتطفئها وتمر النفخة التي تليها وهي الأخرى إلى الصورة المستعدة للاشتعال وهي النشأة الأخرى فتشتعل بأرواحها فَإِذا هُمْ قِيامٌ يَنْظُرُونَ فتقوم تلك الصور أحياء ناطقة بما ينطقها الله به فمن ناطق بالحمد لله ومن ناطق يقول من بَعَثَنا من مَرْقَدِنا ومن ناطق يقول سبحان من أحيانا بعد ما أماتنا وإِلَيْهِ النُّشُورُ وكل ناطق ينطق بحسب علمه وما كان عليه ونسي حاله في البرزخ ويتخيل أن ذلك الذي كان فيه منام كما تخيله المستيقظ وقد كان حين مات وانتقل إلى البرزخ كان كالمستيقظ هناك وأن الحياة الدنيا كانت له كالمنام‏\n\n\n### [أمر الدنيا منام في منام والدار الآخرة هي الحيوان‏]\n\n\nوفي الآخرة يعتقد في أمر الدنيا والبرزخ أنه منام في منام وأن اليقظة الصحيحة هي التي هو عليها في الدار الآخرة وهو في ذلك الحال يقول إن الإنسان في الدنيا كان في منام ثم انتقل بالموت إلى البرزخ فكان في ذلك بمنزلة من يرى في المنام أنه استيقظ من النوم ثم بعد ذلك في النشأة الآخرة هي اليقظة التي لا نوم فيها ولا نوم بعدها لأهل السعادة لكن لأهل النار وفيها راحتهم كما قدمنا وقال رسول الله صلى الله عليه وسلم الناس نيام فإذا ماتوا انتبهوا\n\n\nفالدنيا بالنسبة إلى البرزخ نوم ومنام فإن البرزخ أقرب إلى الأمر الحق فهو أولى باليقظة والبرزخ بالنظر إلى النشأة الأخرى يوم القيامة منام فاعلم ذلك‏\n\n\n### [الشفاعة العظمى الأولين والآخرين‏]\n\n\nفإذا قام الناس ومدت الأرض وانْشَقَّتِ السَّماءُ وانكدرت النجوم وكورت الشمس وخَسَفَ الْقَمَرُ وحشر الوحوش وسجرت البحار وزوجت النفوس بأبدانها ونزلت الملائكة عَلى‏ أَرْجائِها أعني أرجاء السموات وأتى ربنا في ظُلَلٍ من الْغَمامِ ونادى المنادي يا أهل السعادة فأخذ منهم الثلاث الطوائف الذين ذكرناهم وخرج العنق من النار فقبض الثلاث لطوائف الذين ذكرناهم وماج الناس واشتد الحر وألجم الناس العرق وعظم الخطب وجل الأمر وكان البهت فَلا تَسْمَعُ إِلَّا هَمْساً وجي‏ء بجهنم وطال الوقوف بالناس ولم يعلموا ما يريد الحق بهم‏\n\n\nفقال رسول الله صلى الله عليه وسلم فيقول الناس بعضهم لبعض تعالوا ننطلق إلى أبينا آدم فنسأله أن يسأل الله لنا أن يريحنا مما نحن فيه فقد طال وقوفنا فيأتون إلى آدم فيطلبون منه ذلك فيقول آدم إن الله قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وذكر خطيئته فيستحي من ربه أن يسأله فيأتون إلى نوح بمثل ذلك فيقول لهم مثل ما قال آدم ويذكر دعوته على قومه وقوله ولا يَلِدُوا إِلَّا فاجِراً كَفَّاراً فموضع المؤاخذة عليه قوله ولا يَلِدُوا إِلَّا فاجِراً كَفَّاراً لا نفس دعائه عليهم من كونه دعاء ثم يأتون إلى إبراهيم عليه السلام بمثل ذلك فيقولون له مثل مقالتهم لمن تقدم فيقول كما قال من تقدم ويذكر كذباته الثلاث ثم يأتون إلى موسى وعيسى ويقولون لكل واحد من الرسل مثل ما قالوه لآدم فيجيبونهم مثل جواب آدم فيأتون إلى محمد صلى الله عليه وسلم وهو سيد الناس يوم القيامة فيقولون له مثل ما قالوا للأنبياء فيقول محمد صلى الله عليه وسلم أنا لها وهو المقام المحمود الذي وعده الله به يوم القيامة فيأتي ويسجد ويحمد الله بمحامد يلهمه الله تعالى إياها في ذلك الوقت لم يكن بعلمها قبل ذلك ثم يشفع إلى ربه أن يفتح باب الشفاعة للخلق فيفتح الله ذلك الباب فيأذن في الشفاعة للملائكة والرسل والأنبياء والمؤمنين‏\n\n\nفبهذا يكون سيد الناس يوم القيامة فإنه شفع عند الله أن تشفع الملائكة والرسل‏\n\n\n### [سيد الناس يوم القيامة]\n\n\nومع هذا تأدب صلى الله عليه وسلم وقال أنا سيد الناس‏\n\n\nولم يقل سيد الخلائق فتدخل الملائكة في ذلك مع ظهور سلطانه في ذلك اليوم على الجميع وذلك أنه صلى الله عليه وسلم جمع له بين مقامات الأنبياء عليهم السلام كلهم ولم يكن ظهر له على الملائكة ما ظهر لآدم عليه السلام عليهم من اختصاصه يعلم الأسماء كلها فإذا كان في ذلك اليوم افتقر إليه الجميع من الملائكة والناس من آدم فمن دونه في فتح باب الشفاعة وإظهار ما له من الجاه عند الله إذ كان القهر الإلهي والجبروت الأعظم قد أخرس الجميع وكان هذا المقام مثل مقام آدم عليه السلام وأعظم في يوم اشتدت الحاجة فيه مع ما ذكر من الغضب الإلهي الذي تجلى فيه الحق في ذلك اليوم ولم تظهر مثل هذه الصفة فيما جرى من قضية آدم فدل بالمجموع على عظيم قدره صلى الله عليه وسلم حيث أقدم مع هذه الصفة الغضبية الإلهية على مناجاة الحق فيما سأل فيه‏\n\n\n### [تجلى الحق يوم القيامة في أدنى صورة]\n\n\nفأجابه الحق سبحانه فعلقت الموازين ونشرت الصحف ونصب الصراط وبدي‏ء بالشفاعة فأول ما شفعت الملائكة\nثم النبيون ثم المؤمنون وبقي أرحم الراحمين وهنا تفصيل عظيم يطول الكلام فيه فإنه مقام عظيم غير أن الحق يتحلى في ذلك اليوم فيقول لتتبع كل أمة ما كانت تعبد حتى تبقي هذه الأمة وفيها منافقوها فيتجلى لهم الحق في أدنى صورة من الصور التي كان تجلى لهم فيها قبل ذلك فيقول أنا ربكم فيقولون نعوذ بالله منك ها نحن منتظرون حتى يأتينا ربنا فيقول لهم جل وتعالى هل بينكم وبينه علامة تعرفونه بها فيقولون نعم فيتحول لهم في الصورة التي عرفوه فيها بتلك العلامة فيقولون أنت ربنا فيأمرهم بالسجود فلا يبقى من كان يسجد لله إلا سجد ومن كان يسجد إنقاء ورياء جعل الله ظهره طبقة نحاس كلما أراد أن يسجد خر على قفاه وذلك قوله يَوْمَ يُكْشَفُ عَنْ ساقٍ ويُدْعَوْنَ إِلَى السُّجُودِ فَلا يَسْتَطِيعُونَ ... وقَدْ كانُوا يُدْعَوْنَ إِلَى السُّجُودِ وهُمْ سالِمُونَ يعني في الدنيا والساق التي كشفت لهم عبارة عن أمر عظيم من أهوال يوم القيامة تقول العرب كشفت الحرب عن ساقها إذا اشتد الحرب وعظم أمرها وكذلك الْتَفَّتِ السَّاقُ بِالسَّاقِ أي دخلت الأهوال والأمور العظام بعضها في بعض يوم القيامة\n\n\n### [التوحيد العقلي والتوحيد الشرعي ودخول الجنة]\n\n\nفإذا وقعت الشفاعة ولم يبق في النار مؤمن شرعي أصلا ولا من عمل عملا مشروعا من حيث ما هو مشروع بلسان نبي ولو كان مِثْقالَ حَبَّةٍ من خَرْدَلٍ فما فوق ذلك في الصغر إلا خرج بشفاعة النبيين والمؤمنين وبقي أهل التوحيد الذين علموا التوحيد بالأدلة العقلية ولم يشركوا بالله شيئا ولا آمنوا إيمانا شرعيا ولم يعملوا خيرا قط من حيث ما اتبعوا فيه نبيا من الأنبياء فلم يكن عندهم ذرة من إيمان فما دونها فيخرجهم أرحم الراحمين وما عملوا خيرا قط يعني مشروعا من حيث ما هو مشروع ولا خير أعظم من الايمان وما عملوه وهذا\n\n\nحديث عثمان بن عفان في الصحيح لمسلم بن الحجاج قال رسول الله صلى الله عليه وسلم من مات وهو يعلم ولم يقل يؤمن أنه لا إله إلا الله دخل الجنة\n\n\nولا قال يقول بل أفرد العلم ففي هؤلاء تسبق عناية الله في النار فإن النار بذاتها لا تقبل تخليد موحد لله بأي وجه كان وأتم وجوهه الايمان عن علم فجمع بين العلم والايمان فإن قلت فإن إبليس يعلم أن الله واحد قلنا صدقت ولكنه أول من سن الشرك فعليه إثم المشركين وإثمهم إنهم لا يخرجون من النار هذا إذا ثبت أنه مات موحدا وما يدريك لعله مات مشركا لشبهة طرأت عليه في نظره وقد تقدم الكلام على هذه المسألة فيما مضى من الأبواب فإبليس ليس بخارج من النار فالله يعلم أي ذلك كان وهنا علوم كثيرة وفيها طول يخرجنا عن المقصود من الاختصار إيرادها ولكن مع هذا فلا بد أن نذكر نبذة من كل موطن مشهور من مواطن القيامة كالعرض وأخذ الكتب والميزان والصراط والأعراف وذبح الموت والمأدبة التي تكون في ميدان الجنة فهذه سبعة مواطن لا غير وهي أمهات للسبعة الأبواب التي للنار والسبعة الأبواب التي للجنة فإن الباب الثامن هو لجنة الرؤية وهو الباب المغلق الذي في النار وهو باب الحجاب فلا يفتح أبدا فإن أهل النار محجوبون عن ربهم‏\n\n\n### [وصل الموطن السبعة الأمهات يوم القيامة]\n\n\n### [الموطن‏] الأول وهو العرض‏\n\n\nقد ورد في الخبر أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم سئل عن قوله تعالى فَسَوْفَ يُحاسَبُ حِساباً يَسِيراً فقال ذلك العرض يا عائشة من نوقش الحساب عذب‏\n\n\nوهو مثل عرض الجيش أعني عرض الأعمال لا لأنها زي أهل الموقف والله الملك ف يُعْرَفُ الْمُجْرِمُونَ بِسِيماهُمْ كما يعرف الأجناد هنا بزيهم‏\n\n\n### [الموطن‏] الثاني الكتب‏\n\n\nقال تعالى اقْرَأْ كِتابَكَ كَفى‏ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيباً وقال فَأَمَّا من أُوتِيَ كِتابَهُ بِيَمِينِهِ وهو المؤمن السعيد وأَمَّا من أُوتِيَ كِتابَهُ بِشِمالِهِ وهو المنافق فإن الكافر لا كتاب له فالمنافق سلب عنه الايمان وما أخذ منه الإسلام فقيل في المنافق إِنَّهُ كانَ لا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ فيدخل فيه المعطل والمشرك والمتكبر على الله ولم يتعرض للإسلام فإن المنافق ينقاد ظاهرا ليحفظ ماله وأهله ودمه ويكون في باطنه واحدا من هؤلاء الثلاثة وإنما قلنا إن هذه الآية تعم الثلاثة فإن قوله لا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ معناه لا يصدق بالله والذين لا يصدقون بالله هم طائفتان طائفة لا تصدق بوجود الله وهم المعطلة وطائفة لا تصدق بتوحيد الله وهم المشركون وقوله العظيم في هذه الآية يدخل فيها المتكبر على الله فإنه لو اعتقد عظمة الله التي يستحقها من يسمى بالله لم يتكبر عليه وهؤلاء الثلاثة مع هذا المنافق الذي تميز عنهم بخصوص وصف هم أهل النار الذين هم أهلها وأَمَّا من أُوتِيَ كِتابَهُ وَراءَ ظَهْرِهِ فهم الذين أوتوا الكتاب فَنَبَذُوهُ وَراءَ ظُهُورِهِمْ واشْتَرَوْا به ثَمَناً قَلِيلًا فإذا كان يوم القيامة قيل له خذه من وراء ظهرك أي من الموضع الذي نبذته فيه في حياتك الدنيا فهو كتابهم المنزل عليهم لا كتاب‏\nالأعمال فإنه حين نبذه وراء ظهره ظَنَّ أَنْ لَنْ يَحُورَ أي تيقن قال الشاعر\n\n\nفقلت لهم ظنوا بألفي مدجج‏\n\n\nورد في الصحيح يقول الله له يوم القيامة أ ظننت أنك ملاقي‏\n\n\nوقال تعالى وذلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْداكُمْ‏\n\n\n### [الموطن‏] الثالث الموازين‏\n\n\nفتوضع الموازين لوزن الأعمال فيجعل فيها الكتب بما عملوا وآخر ما يوضع في الميزان قول الإنسان الحمد لله ولهذا\n\n\nقال صلى الله عليه وسلم الحمد لله تملأ الميزان‏\n\n\nفإنه يلقى في الميزان جميع أعمال العباد إلا كلمة لا إله إلا الله فيبقى من ملئه تحميدة فتجعل فيمتلئ بها فإن كفة ميزان كل أحد بقدر عمله من غير زيادة ولا نقصان وكل ذكر وعمل يدخل الميزان إلا لا إله إلا الله كما قلنا وسبب ذلك أن كل عمل خير له مقابل من ضده فيجعل هذا الخير في موازنته ولا يقابل لا إله إلا الله إلا الشرك ولا يجتمع توحيد وشرك في ميزان أحد لأنه إن قال لا إله إلا الله معتقدا لها فما أشرك وإن أشرك فما اعتقد لا إله إلا الله فلما لم يصح الجمع بينهما لم يكن لكلمة لا إله إلا الله من يعادلها في الكفة الأخرى ولا يرجحها شي‏ء فلهذا لا تدخل الميزان وأما المشركون فَلا نُقِيمُ لَهُمْ يَوْمَ الْقِيامَةِ وَزْناً أي لا قدر لهم ولا يوزن لهم عمل ولا من هو من أمثالهم ممن كذب بلقاء الله وكفر بآياته فإن أعمال خير المشرك محبوطة فلا يكون لشرهم ما يوازنه فَلا نُقِيمُ لَهُمْ يَوْمَ الْقِيامَةِ وَزْناً وأما صاحب السجلات فإنه شخص لم يعمل خير قط إلا أنه تلفظ يوما بكلمة لا إله إلا الله مخلصا فتوضع له في مقابلة التسعة والتسعين سجلا من أعمال الشر كل سجل منها كما بين المغرب والمشرق وذلك لأنه ما له عمل خير غيرها فترجح كفنها بالجميع وتطيش السجلات فيتعجب من ذلك ولا يدخل الموازين إلا أعمال الجوارح شرها وخيرها السمع والبصر واللسان واليد والبطن والفرج والرجل وأما الأعمال الباطنة فلا تدخل الميزان المحسوس لكن يقام فيها العدل وهو الميزان الحكمي المعنوي محسوس لمحسوس ومعنى لمعنى يقابل كل شي‏ء بمثله فلهذا توزن الأعمال من حيث ما هي مكتوبة\n\n\n### [الموطن‏] الرابع الصراط\n\n\nوهو الصراط المشروع الذي كان هنا معنى ينصب هنالك حسا محسوسا يقول الله لنا وأَنَّ هذا صِراطِي مُسْتَقِيماً فَاتَّبِعُوهُ ولا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ ولما تلا رسول الله صلى الله عليه وسلم هذه الآية خط خطا وخط عن جنبتيه خوطا هكذا\n\n\nوهذا هو صراط التوحيد ولوازمه وحقوقه‏\n\n\nقال رسول الله صلى الله عليه وسلم أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحق الإسلام وحسابهم على الله‏\n\n\nأراد بقوله وحسابهم على الله أنه لا يعلم أنهم قالوها معتقدين لها إلا الله فالمشرك لا قدم له على صراط التوحيد وله قدم على صراط الوجود والمعطل لا قدم له على صراط الوجود فالمشرك ما وحد الله هنا فهو من الموقف إلى النار مع المعطلة ومن هو من أهل النار الذين هم أهلها إلا المنافقين فلا بد لهم أن ينظروا إلى الجنة وفيها من النعيم فيطمعون فذلك نصيبهم من نعيم الجنان ثم يصرفون إلى النار وهذا من عدل الله فقوبلوا بأعمالهم والطائفة التي لا تخلد في النار إنما تمسك وتسأل وتعذب على الصراط والصراط على متن جهنم غائب فيها والكلاليب التي فيه بها يمسكهم الله عليه ولما كان الصراط في النار وما ثم طريق إلى الجنة إلا عليه قال تعالى وإِنْ مِنْكُمْ إِلَّا وارِدُها كانَ عَلى‏ رَبِّكَ حَتْماً مَقْضِيًّا ومن عرف معنى هذا القول عرف مكان جهنم ما هو ولو قاله النبي صلى الله عليه وسلم لما سئل عنه لقلته فما سكت عنه وقال في الجواب في علم الله إلا بأمر إلهي فإنه ما يَنْطِقُ عَنِ الْهَوى‏ وما هو من أمور الدنيا فسكوتنا عنه هو الأدب وقد أتى في صفة الصراط أنه أدق من الشعر وأحد من السيف وكذا هو علم الشريعة في الدنيا لا يعلم وجه الحق في المسألة عند الله ولا من هو المصيب من المجتهدين بعينه ولذلك تعبدنا بغلبات الظنون بعد بذل المجهود في طلب الدليل لا في المتواتر ولا في خبر الواحد الصحيح المعلوم فإن المتواتر وإن أفاد العلم فإن العلم المستفاد من التواتر إنما هو عين هذا اللفظ أو العلم إن رسول الله صلى الله عليه وسلم قاله أو عمل به ومطلوبنا بالعلم ما يفهم من ذلك القول والعمل حتى يحكم في المسألة على القطع وهذا لا يوصل إليه إلا بالنص الصريح المتواتر وهذا لا يوجد إلا نادرا مثل قوله تعالى تِلْكَ عَشَرَةٌ كامِلَةٌ في كونها عشرة خاصة فحكمها بالشرع أحد من السيف وأدق من الشعر في الدنيا فالمصيب للحكم واحد لا بعينه والكل مصيب للأجر فالشرع هنا هو الصراط المستقيم ولا يزال في كل ركعة من الصلاة يقول اهْدِنَا الصِّراطَ الْمُسْتَقِيمَ فهو أحد من السيف وأدق من الشعر فظهوره في الآخرة محسوس أبين وأوضح من ظهوره في الدنيا إلا لمن دعا إلى الله على‏\nبصيرة كالرسول وأتباعه فألحقهم الله بدرجة الأنبياء في الدعاء إِلَى الله عَلى‏ بَصِيرَةٍ أي على علم وكشف وقد ورد في خبر أن الصراط يظهر يوم القيامة متنه للابصار على قدر نور المارين عليه فيكون دقيقا في حق قوم وعريضا في حق آخرين‏\n\n\nيصدق هذا الخبر قوله تعالى نُورُهُمْ يَسْعى‏ بَيْنَ أَيْدِيهِمْ وبِأَيْمانِهِمْ والسعي مشي وما ثم طريق إلا الصراط وإنما قال بِأَيْمانِهِمْ لأن المؤمن في الآخرة لا شمال له كما أن أهل النار لا يمين لهم هذا بعض أحوال ما يكون على الصراط وأما الكلاليب والخطاطيف والحسك كما ذكرنا هي من صور أعمال بنى آدم تمسكهم أعمالهم تلك على الصراط فلا ينتهضون إلى الجنة ولا يقعون في النار حتى تدركهم الشفاعة والعناية الإلهية كما قررنا فمن تجاوز هنا تجاوز الله عنه هناك ومن أنظر معسرا أنظره الله ومن عفا عفا الله عنه ومن استقصى حقه هنا من عباده استقصى الله حقه منه هناك ومن شدد على هذه الأمة شدد الله عليه وإنما هي أعمالكم ترد عليكم فالتزموا مكارم الأخلاق‏\n\n\nفإن الله غدا يعاملكم بما عاملتم به عباده كان ما كان وكانوا ما كانوا\n\n\n### [الموطن‏] الخامس الأعراف‏\n\n\nوأما الأعراف فسور بين الجنة والنار باطِنُهُ فِيهِ الرَّحْمَةُ وهو ما يلي الجنة منه وظاهِرُهُ من قِبَلِهِ الْعَذابُ وهو ما يلي النار منه يكون عليه من تساوت كفتا ميزانه فهم ينظرون إلى النار وينظرون إلى الجنة وما لهم رجحان بما يدخلهم أحد الدارين فإذا دعوا إلى السجود وهو الذي يبقى يوم القيامة من التكليف فيسجدون فيرجح ميزان حسناتهم فيدخلون الجنة وقد كانوا ينظرون إلى النار بما لهم من السيئات وينظرون إلى الجنة بما لهم من الحسنات ويرون رحمة الله فيطمعون وسبب طمعهم أيضا إنهم من أهل لا إله إلا الله ولا يرونها في ميزانهم ويعلمون إِنَّ الله لا يَظْلِمُ مِثْقالَ ذَرَّةٍ ولو جاءت ذرة لإحدى الكفتين لرجحت بها لأنهما في غاية الاعتدال فيطمعون في كرم الله وعدله وأنه لا بد أن يكون لكلمة لا إله إلا الله عناية بصاحبها يظهر لها أثر عليهم يقول عز وجل فيهم وعَلَى الْأَعْرافِ رِجالٌ يَعْرِفُونَ كُلًّا بِسِيماهُمْ ونادَوْا أَصْحابَ الْجَنَّةِ أَنْ سَلامٌ عَلَيْكُمْ لَمْ يَدْخُلُوها وهُمْ يَطْمَعُونَ كما نادوا أيضا إِذا صُرِفَتْ أَبْصارُهُمْ تِلْقاءَ أَصْحابِ النَّارِ قالُوا رَبَّنا لا تَجْعَلْنا مَعَ الْقَوْمِ الظَّالِمِينَ والظلم هنا الشرك لا غير\n\n\n### [الموطن‏] السادس ذبح الموت‏\n\n\nالموت وإن كان نسبة\n\n\nفإن الله يظهره يوم القيامة في صورة كبش أملح وينادي يا أهل الجنة فيشرئبون وينادي يا أهل النار فيشرئبون وليس في النار في ذلك الوقت إلا أهلها الذين هم أهلها فيقال للفريقين أ تعرفون هذا وهو بين الجنة والنار فيقولون هو الموت ويأتي يحيى عليه السلام وبيده الشفرة فيضجعه ويذبحه وينادي مناديا أهل الجنة خلود فلا موت ويا أهل النار خلود فلا موت‏\n\n\nوذلك هو يَوْمَ الْحَسْرَةِ فأما أهل الجنة إذا رأوا الموت سروا برؤيته سرورا عظيما ويقولون له بارك الله لنا فيك لقد خلصتنا من نكد الدنيا وكنت خير وارد علينا وخير تحفة أهداها الحق إلينا\n\n\nفإن النبي صلى الله عليه وسلم يقول الموت تحفة المؤمن‏\n\n\nوأما أهل النار إذا أبصروه يفرقون منه ويقولون له لقد كنت شر وارد علينا حلت بيننا وبين ما كنا فيه من الخير والدعة ثم يقولون له عسى تميتنا فنستريح مما نحن فيه وإنما سمي يوم الحسرة لأنه حسر للجميع أي ظهر عن صفة الخلود الدائم للطائفتين ثم تغلق أبواب النار غلقا لا فتح بعده وتنطبق النار على أهلها ويدخل بعضها في بعض ليعظم انضغاط أهلها فيها ويرجع أسفلها أعلاها وأعلاها أسفلها وترى الناس والشياطين فيها كقطع اللحم في القدر إذ كان تحتها النار العظيمة تغلي كَغَلْيِ الْحَمِيمِ فتدور بمن فيها علوا وسفلا كُلَّما خَبَتْ زِدْناهُمْ سَعِيراً بتبديل الجلود\n\n\n### [الموطن‏] السابع المأدبة\n\n\nوهي مأدبة الملك لأهل الجنة وفي ذلك الوقت يجتمع أهل النار في مندبة فأهل الجنة في المأدب وأهل النار في المنادب وطعامهم في تلك المأدبة زيادة كبد النون وأرض الميدان درمكة بيضاء مثل القرصة ويخرج من الثور الطحال لأهل النار فيأكل أهل الجنة من زيادة كبد النون وهو حيوان بحري مائي فهو من عنصر الحياة المناسبة للجنة والكبد بيت الدم وهو بيت الحياة والحياة حارة رطبة وبخار ذلك الدم هو النفس المعبر عنه بالروح الحيواني الذي به حياة البدن فهو بشارة لأهل الجنة ببقاء الحياة عليهم وأما الطحال في جسم الحيوان فهو بيت الأوساخ فإن فيه تجتمع أوساخ البدن وهو ما يعطيه الكبد من الدم الفاسد فيعطي لأهل النار يأكلونه وهو من الثور والثور حيوان ترابي طبعه البرد واليبس وجهنم على صورة الجاموس والطحال من الثور لغذاء أهل النار أشد مناسبة فبما في الطحال من الدمية لا يموت أهل النار وبما فيه من أوساخ البدن‏\nومن الدم الفاسد المؤلم لا يحيون ولا ينعمون فيورثهم أكله سقما ومرضا ثم يدخل أهل الجنة الجنة ف ما هُمْ مِنْها بِمُخْرَجِينَ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الثامن والعشرون‏\n\n",
    "en": "Chapter Sixty-Four: Concerning the Knowledge of the Resurrection, its Stations, and the Manner of the Raising\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.\n\n> The Day of Ascents, lasting fifty thousand years, / Flies away from every sleeper who is heedless of it.\n>\n> And the earth, in fear of it, remains vigilant, / May the slumber of the Divine not overtake it when the God decrees.\n>\n> So be a stranger, and do not incline toward a faction / Of the Khawarij, the people of stinging tongues.\n>\n> And if you see a man striving for corruption, / Restrain his hand, and you will be rewarded with a good deed.\n>\n> And hold fast, in caution, to the Cave (al-Kahf) from a man / Whose trial shows you a day like a year.\n\n### The Meaning of the Day of Resurrection (Yawm al-Qiyama)\n\nKnow that this Day is only called the Day of Resurrection (Yawm al-Qiyama) because people stand up (yaqūm) from their graves for the Lord of the Worlds in the Final Creation (al-Nash'a al-Akhira), which we mentioned in the chapter preceding this one concerning the Isthmus (Barzakh). It is also named so because they stand when The Real (Al-Haqq) comes for separation and judgment, <<وَالْمَلَكُ صَفًّا صَفًّا>> (and the angels are rank upon rank). Allah the Exalted said: <<يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعالَمِينَ>> (The Day when mankind will stand before the Lord of the Worlds), meaning, for the sake of the Lord of the Worlds, when He comes. He used the Name *Al-Rabb* (The Lord) because the Lord is the Sovereign (Al-Malik), possessing the Attribute of Compulsion (Qahr) and the Attribute of Mercy (Rahma). He did not use the Name *Al-Rahman* (The All-Merciful) because there must be Wrath on that Day, as will be mentioned in this chapter. There must also be Reckoning, the bringing forth of Hell (Jahannam), and the Balances (Mawazin), and these are not characteristics of the Absolute Mercy demanded by the Name *Al-Rahman*. However, He, Glory be to Him, used a Divine Name in which Mercy is predominant, which is the Name *Al-Rabb*, for it implies reform and nurturing (الإصلاح والتربية). Thus, the abundance of Mercy inherent in the Sovereign and Master prevails over the Attribute of Compulsion, and His Mercy precedes His Wrath, and the overlooking of the misdeeds of most people increases.\n\n### The Manifestations and Scenes of the Resurrection\n\nThe first thing I shall clarify and state is what Allah said concerning that Day: the stretching out of the earth, the folding up of the heaven and its falling upon the earth, the coming of the angels, and the coming of the Lord on that Day. I will also discuss where creation will be when the earth is stretched and its form is changed, and when Hell is brought forth and what its affair will be. Then I shall relate the account of the stations (Mawāqif) of the Resurrection, lasting <<خَمْسِينَ أَلْفَ سَنَةٍ>> (fifty thousand years), and the account of the Intercession (Shafa'a).\n\nKnow, my brother, that when people rise from their graves, as we shall relate, if Allah wills, and Allah desires to replace the earth with another earth, the earth will be stretched out by Allah’s permission. The Bridge (Jisr) will be placed beneath the darkness, and creation will be upon it when Allah changes the earth as He wills, either by changing its form or by replacing it with another earth upon which no one has slept, called *Al-Sāhira* (The Vigilant). He, Glory be to Him, stretches it out like the stretching of a hide. Allah the Exalted says: <<وَإِذَا الْأَرْضُ مُدَّتْ>> (And when the earth is stretched out). He increases its breadth as He wills, multiplying what it was from twenty-one parts up to ninety-nine parts, until you see in it <<عِوَجاً وَلا أَمْتاً>> (no crookedness or unevenness).\n\nThen He, Glory be to Him, folds the heaven unto Himself, rolling it up with His Right Hand <<كَطَيِّ السِّجِلِّ لِلْكُتُبِ>> (as the folding of a written scroll). Then He casts it upon the earth that He stretched out, frail and weak. This is His saying: <<وَانْشَقَّتِ السَّمَاءُ فَهِيَ يَوْمَئِذٍ وَاهِيَةٌ>> (And the heaven is split, and on that Day it is frail). He returns creation to the earth that He stretched out, and they stand, waiting for what Allah will do with them.\n\nWhen the heaven becomes frail, its angels descend upon its edges (arjā’ihā). The people of the earth see a vast creation, many times their own number. They imagine that Allah has descended among them due to the magnitude of the Kingdom they witness, which they had never seen before. They ask, \"Is our Lord among you?\" The angels reply, \"Glory be to our Lord! He is not among us, but He is coming.\" The angels then form a circular rank around the edges of the earth, encompassing the world of humans and jinn. These are the inhabitants of the lowest heaven.\n\nThen the inhabitants of the second heaven descend after Allah has also folded it up and cast its star—called *Kātib* (The Writer)—into the Fire. They are greater in number than the first heaven. The creatures ask, \"Is our Lord among you?\" The angels are terrified by their question and say, \"Glory be to our Lord! He is not among us, but He is coming.\" They do as the first angels did, forming a second circular rank behind them.\n\nThen the inhabitants of the third heaven descend, and its star—called *Al-Zuhra* (Venus)—is cast into the Fire, and Allah folds it up with His Right Hand. The creatures ask, \"Is our Lord among you?\" The angels reply, \"Glory be to our Lord! He is not among us, but He is coming.\" This continues, heaven after heaven, until the inhabitants of the seventh heaven descend. They see a creation greater than all those who descended before. The creatures ask, \"Is our Lord among you?\" The angels reply, <<سُبْحَانَ رَبِّنَا قَدْ جَاءَ رَبُّنَا وَإِنْ كَانَ وَعْدُ رَبِّنَا لَمَفْعُولًا>> (Glory be to our Lord! Our Lord has indeed come, and the promise of our Lord was certainly to be fulfilled).\n\n### The Descent of the Lord in Canopies of Clouds\n\nThen Allah comes <<فِي ظُلَلٍ مِنَ الْغَمَامِ وَالْمَلَائِكَةُ>> (in canopies of clouds, and the angels). On His left flank is Hell (Jahannam). His coming is the coming of the Sovereign, for He says, <<مَالِكِ يَوْمِ الدِّينِ>> (Sovereign of the Day of Recompense), and that is that Day. He is thus named by the Kingly Name (Al-Malik).\n\nThe angels, peace be upon them, form seven ranks surrounding creation. When people see Hell boiling and raging against the arrogant tyrants, all creation flees from it due to the magnitude of what they see, in fear and terror. This is the Great Terror (al-Faza' al-Akbar), except for the group whom <<لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ وَتَتَلَقَّاهُمُ الْمَلَائِكَةُ هَذَا يَوْمُكُمُ الَّذِي كُنْتُمْ تُوعَدُونَ>> (The Great Terror will not grieve them, and the angels will meet them, [saying], \"This is your Day which you were promised\"). They are the secure ones, along with the Prophets, concerning themselves. However, the Prophets are terrified for their communities due to the compassion with which Allah created them for creation, and they say on that Day, \"Safety! Safety!\"\n\nAllah had commanded that pulpits of light be erected for His secure creation, varying according to their stations in the Standing (Mawqif). They sit upon them, secure and receiving glad tidings, and this is before the coming of the Lord the Exalted.\n\nWhen people flee in fear of Hell and terror at the magnitude of the horror they see on that Day, they find the angels in ranks, whom they cannot pass. The angels, the wardens (waza'at) of The Real, Glory be to Him, drive them toward the Gathering (Mahshar). Their Prophets call out to them, \"Return! Return!\" and they call out to one another. This is Allah’s saying, as related by the Messenger of Allah (PBUH): <<إِنِّي أَخَافُ عَلَيْكُمْ يَوْمَ التَّنَادِ يَوْمَ تُوَلُّونَ مُدْبِرِينَ مَا لَكُمْ مِنَ اللَّهِ مِنْ عَاصِمٍ>> (Indeed, I fear for you the Day of Calling Out, the Day you will turn your backs in retreat, with no protector for you against Allah). The Messengers say, \"O Allah, grant safety! Grant safety!\" They fear the utmost fear for their communities, and the communities fear for themselves. The purified and protected ones, whose inner beings were not defiled by misleading doubts nor their outer beings by legal transgressions, are secure. The Prophets envy them for the security they possess, due to the fear the Prophets hold for their communities.\n\n### The Three Calls of The Real on the Day of Standing\n\nThen a caller from Allah calls out, heard by the people of the Standing. I do not know whether this is the call of The Real, Glory be to Him, Himself, or a call by His command. In that call, He says: \"O people of the Standing! Today you shall know who the people of generosity (Ahl al-Karam) are.\" For He said to man, <<يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ>> (O man, what has deluded you concerning your Generous Lord?), teaching him and alerting him to say, \"Your generosity (Karam).\"\n\nI once heard our Shaykh, Al-Shanukhta, weeping and saying, \"O people, do not act upon His generosity! He brought us forth when we were nothing, and taught us what we did not know, and favored us initially with faith in Him, His Books, and His Messengers, while we were yet unreasoning. Do you think He will punish us after we have reasoned and believed? Far be it from His generosity, Glory be to Him, to do that!\" This made me weep tears of joy, and those present wept too.\n\nThen we return and say: The Real says in that call, \"Where are those whose <<تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ>> (sides forsake their beds, who call upon their Lord in fear and hope, and who spend from what We have provided them)?\" They are brought to Paradise.\n\nThen they hear a second call from The Real. I do not know whether this is the call of The Real Himself or a call by His command: \"Where are those whom <<لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ يَخَافُونَ يَوْمًا تَتَقَلَّبُ فِيهِ الْقُلُوبُ وَالْأَبْصَارُ لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا عَمِلُوا وَيَزِيدَهُمْ مِنْ فَضْلِهِ>> (neither commerce nor selling distracts from the remembrance of Allah and the establishment of prayer and the giving of zakat, fearing a Day when hearts and eyes will turn about, that Allah may reward them with the best of what they did and increase them from His bounty)?\" That increase, as we said, is from the Gardens of Special Distinction. They are commanded to enter Paradise.\n\nThen they hear a third call. I do not know whether it is the call of The Real Himself or a call by His command: \"O people of the Standing! Today you shall know who the people of generosity are. Where are those who <<صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ لِيَجْزِيَ اللَّهُ الصَّادِقِينَ بِصِدْقِهِمْ>> (were true to what they promised Allah, that Allah may reward the truthful for their truthfulness)?\" They are commanded to enter Paradise.\n\n### The Neck Emerging from the Fire and its Three Calls on the Day of Standing\n\nAfter this call, a neck emerges from the Fire. When it overlooks creation, it has two eyes and an eloquent tongue. It says, \"O people of the Standing! I have been entrusted with three groups from among you,\" just as the first call was three times for three groups of the people of felicity. All this occurs before the Reckoning, while people are standing, choked by sweat, their fear intense, and their hearts shattered by the horror of the onset.\n\nThat neck emerging from the Fire says to them, \"I have been entrusted with every arrogant tyrant (jabbār 'anīd).\" It picks them out from the ranks just as a bird picks up sesame seeds. When it has left none of them in the Standing, it calls out a second time, \"O people of the Standing! I have been entrusted with those who harmed Allah and His Messenger.\" It picks them out just as a bird picks up sesame seeds from among creation.\n\nWhen none of them remain, it calls out a third time, \"O people of the Standing! I have been entrusted with those who attempted to create like the creation of Allah.\" It picks out the people of images (Ahl al-Tasāwīr)—those who make images in churches to be worshipped, and those who sculpt idols. This is His saying: <<أَتَعْبُدُونَ مَا تَنْحِتُونَ>> (Do you worship that which you carve?). They used to carve wood and stone for them to worship instead of Allah. These are the image makers. It picks them out from the ranks just as a bird picks up sesame seeds.\n\nWhen Allah has taken the last of them, the people remain, including those image makers who did not intend by their imaging what the others intended—that they be worshipped—until they are questioned about them and commanded to breathe spirits into them to bring them to life, but they are not breathers, as mentioned in the tradition concerning image makers. They stand for as long as Allah wills, waiting for what Allah will do with them, choked by sweat.\n\n### The Fifty Stations of the Resurrection\n\nOur Shaykh Al-Qassār narrated to us in Mecca in the year 599 AH, facing the Yemeni Corner of the Holy Kaaba—he was Yūnus ibn Yahyā ibn al-Husayn ibn Abī al-Barakāt al-Hāshimī al-'Abbāsī—from his own words, while I listened. He said: Abū al-Fadl Muhammad ibn 'Umar ibn Yūsuf al-Armawī narrated to us, who said: Abū Bakr Muhammad ibn 'Alī ibn Muhammad ibn Mūsā ibn Ja'far, known as Ibn al-Khayyāt al-Maghribī, narrated to us, who said: It was read to Abū Sahl Mahmūd ibn 'Umar ibn Ishāq al-'Ukbarī, while I listened, that he was asked: Did Abū Bakr Muhammad ibn al-Hasan al-Naqqāsh narrate to you, may Allah be pleased with you? He said: Yes. Abū Bakr said: Abū Bakr Ahmad ibn al-Husayn ibn 'Alī al-Tabarī al-Marwazī narrated to us, who said: Muhammad ibn Humayd al-Rāzī Abū 'Abd Allāh narrated to us, who said: Salama ibn Sālih narrated to us, who said: Al-Qāsim ibn al-Hakam narrated to us, from Salām al-Tawīl, from Ghiyāth ibn al-Musayyib, from 'Abd al-Rahmān ibn Ghanm and Zayd ibn Wahb, from 'Abd Allāh ibn Mas'ūd, who said:\n\nI was sitting with 'Alī ibn Abī Tālib, may Allah be pleased with him, and 'Abd Allāh ibn 'Abbās, may Allah be pleased with him, was with him, surrounded by a number of the Companions of the Messenger of Allah (PBUH). 'Alī, may Allah be pleased with him, said: The Messenger of Allah (PBUH) said: \"Indeed, in the Resurrection there are fifty stations (Mawāqif), each station lasting one thousand years.\n\nThe first station, when people emerge from their graves, they stand at the doors of their graves for one thousand years, naked, barefoot, hungry, and thirsty. Whoever emerges from his grave believing in his Lord, believing in his Prophet, believing in His Paradise and His Fire, believing in the Raising (Ba'th) and the Resurrection (Qiyama), believing in the Divine Decree (Qadā') and Destiny (Qadar), its good and its evil, and confirming what Muhammad (PBUH) brought from his Lord, he is saved, victorious, successful, and happy. Whoever doubts anything of this remains in his hunger, thirst, distress, and anguish for one thousand years until Allah decrees concerning him what He wills.\"\n\n### The Driving to the Ten Pavilions of Reckoning\n\nThen they are driven from that station to the Gathering (Mahshar). They stand on their feet for one thousand years in the pavilions (Surādiqāt) of the Fires, in the heat of the sun, with fire on their right, fire on their left, fire in front of them, and fire behind them, and the sun above their heads. There is no shade except the shade of the Throne. Whoever meets Allah, the Blessed and Exalted, bearing witness to Him with sincerity (Ikhlās), affirming His Prophet (PBUH), free from polytheism (Shirk) and magic, free from shedding the blood of Muslims, sincere to Allah and His Messenger, loving those who obey Allah and His Messenger, and hating those who disobey Allah and His Messenger, he will be shaded under the shade of the Throne of the All-Merciful and saved from his distress. Whoever deviates from this and falls into any of these sins, even by a single word, or whose heart changes, or who doubts anything of his religion, remains for one thousand years in heat, anxiety, and torment until Allah decrees concerning him what He wills.\n\n### The Driving to the Light and the Darkness\n\nThen creation is driven to the Light and the Darkness. They remain in that darkness for one thousand years. Whoever meets Allah, the Blessed and Exalted, having associated nothing with Him, having allowed no hypocrisy (Nifāq) into his heart, having no doubt about any matter of his religion, having given The Real (Al-Haqq) its due from himself, having spoken the truth, having been just to people, having obeyed Allah in secret and in public, having been content with Allah’s decree, and having been satisfied with what Allah gave him, he emerges from the darkness into the Light in the blink of an eye, his face brightened, saved from all distress. Whoever deviates in any of these matters remains in distress and anxiety for one thousand years, then emerges with his face blackened, and he is subject to Allah’s will, who does with him what He wills.\n\n### The Driving to the Ten Pavilions of Reckoning\n\nThen creation is driven to the pavilions of the Reckoning (Hisāb), which are ten pavilions. They stand in each pavilion for one thousand years.\n\nIn the first pavilion, the son of Adam is questioned about forbidden acts (Mahārim). If he did not fall into any of them, he passes to the second pavilion. He is questioned about whims (Ahwā'). If he was saved from them, he passes to the third pavilion. He is questioned about disobedience to parents ('Uqūq al-Wālidayn). If he was not disobedient, he passes to the fourth pavilion. He is questioned about the rights of those whose affairs Allah entrusted to him, about teaching them the Quran, and about their religious instruction and discipline. If he fulfilled this, he passes to the fifth pavilion. He is questioned about those whom his right hand possessed (slaves/servants). If he was kind to them, he passes to the sixth pavilion. He is questioned about the rights of his kin. If he fulfilled their rights, he passes to the seventh pavilion. He is questioned about maintaining ties of kinship (Silat al-Rahim). If he maintained his kinship ties, he passes to the eighth pavilion. He is questioned about envy (Hasad). If he was not envious, he passes to the ninth pavilion. He is questioned about deceit (Makr). If he did not deceive anyone, he passes to the tenth pavilion. He is questioned about fraud (Khadi'a). If he did not defraud anyone, he is saved and descends under the shade of Allah’s Throne, his eye content, his heart joyful, his mouth smiling.\n\nIf he fell into any of these traits, he remains in each station for one thousand years, hungry, thirsty, sorrowful, distressed, and anxious, and the intercession of no intercessor benefits him.\n\n### The Gathering and its Fifteen Stations\n\nThen they are gathered for the taking of their books (of deeds) by their right and left hands. They are detained at this point in fifteen stations, each station lasting one thousand years.\n\nIn the first station, they are questioned about charity (Sadaqāt) and what Allah obligated upon them in their wealth. If he paid it fully, he passes to the second station. He is questioned about speaking the truth and forgiving people. If he forgave, Allah forgives him, and he passes to the third station. He is questioned about enjoining the good (Amr bi'l-Ma'rūf). If he enjoined the good, he passes to the fourth station. He is questioned about forbidding the wrong (Nahy 'an al-Munkar). If he forbade the wrong, he passes to the fifth station. He is questioned about good character (Husn al-Khuluq). If he had good character, he passes to the sixth station. He is questioned about love for Allah’s sake and hate for Allah’s sake. If he loved and hated for Allah’s sake, he passes to the seventh station. He is questioned about unlawful wealth (Māl al-Harām). If he took nothing unlawful, he passes to the eighth station. He is questioned about drinking wine (Khamr). If he did not drink any wine, he passes to the ninth station. He is questioned about unlawful sexual acts (Furūj al-Harām). If he did not commit them, he passes to the tenth station. He is questioned about false speech (Qawl al-Zūr). If he did not speak falsely, he passes to the eleventh station. He is questioned about false oaths (Aymān al-Kādhiba). If he did not swear them, he passes to the twelfth station. He is questioned about consuming usury (Ribā). If he did not consume it, he passes to the thirteenth station. He is questioned about slandering chaste women (Qadhf al-Muhsanāt). If he did not slander chaste women or defame anyone, he passes to the fourteenth station. He is questioned about false testimony (Shahādat al-Zūr). If he did not bear it, he passes to the fifteenth station. He is questioned about slander (Buhtān). If he did not slander a Muslim, he passes and descends under the Banner of Praise (Liwā' al-Hamd), is given his book in his right hand, is saved from the distress of the book, and is reckoned with <<حِسَابًا يَسِيرًا>> (an easy reckoning).\n\nIf he fell into any of these sins and died without repenting from them, he remains in each of these fifteen stations for one thousand years in distress, horror, anxiety, sorrow, hunger, and thirst until Allah, the Mighty and Majestic, decrees concerning him what He wills.\n\n### Taking the Books by the Right and Left Hands and Reading Them\n\nThen people are made to stand for the reading of their books for one thousand years. Whoever was generous (Sakhī) and had sent forth his wealth for his day of poverty, need, and destitution, he reads his book, and its reading is made easy for him. He is clothed in the garments of Paradise, crowned with the crowns of Paradise, and seated under the shade of the Throne of the All-Merciful, secure and tranquil.\n\nIf he was miserly (Bakhīl) and did not send forth his wealth for his day of poverty and destitution, he is given <<كِتَابَهُ بِشِمَالِهِ>> (his book in his left hand). Garments of fire are cut out for him, and he stands before creation for one thousand years in hunger, thirst, nakedness, anxiety, distress, sorrow, and disgrace until Allah, the Mighty and Majestic, decrees concerning him what He wills.\n\n### The Gathering to the Balance\n\nThen people are gathered to the Balance (Mīzān). They stand at the Balance for one thousand years. Whoever’s scale is heavy with his good deeds is victorious and saved in the blink of an eye. Whoever’s scale is light of good deeds and whose evil deeds are heavy is detained at the Balance for one thousand years in distress, anxiety, sorrow, torment, hunger, and thirst until Allah decrees concerning him what He wills.\n\n### Standing Before Allah in Twelve Stations\n\nThen creation is summoned to the Standing before Allah in twelve stations, each station lasting about one thousand years.\n\nIn the first station, he is questioned about freeing slaves ('Itq al-Riqāb). If he freed a slave, Allah frees his neck from the Fire, and he passes to the second station. He is questioned about the Quran, its rights, and its recitation. If he fulfilled this completely, he passes to the third station. He is questioned about Jihad. If he strove in the way of Allah sincerely, he passes to the fourth station. He is questioned about backbiting (Ghiba). If he did not backbite, he passes to the fifth station. He is questioned about tale-bearing (Namīma). If he was not a tale-bearer, he passes to the sixth station. He is questioned about lying. If he was not a liar, he passes to the seventh station. He is questioned about seeking knowledge. If he sought knowledge and acted upon it, he passes to the eighth station. He is questioned about self-admiration ('Ujb). If he was not self-admiring in his religion, his worldly affairs, or any of his deeds, he passes to the ninth station. He is questioned about arrogance (Takabbur). If he was not arrogant toward anyone, he passes to the tenth station. He is questioned about despairing of Allah’s Mercy (Qunūt). If he did not despair of Allah’s Mercy, he passes to the eleventh station. He is questioned about feeling safe from Allah’s plan (Amn min Makr Allah). If he did not feel safe from Allah’s plan, he passes to the twelfth station. He is questioned about the rights of his neighbor. If he fulfilled the rights of his neighbor, he is established before Allah, his eye content, his heart joyful, his face bright, clothed, smiling, and rejoicing. His Lord welcomes him and gives him glad tidings of His pleasure with him. He rejoices with a joy known only to Allah.\n\nIf he did not fulfill one of these completely and died without repenting, he is detained at every station for one thousand years until Allah, the Mighty and Majestic, decrees concerning him what He wills.\n\n### The Bridge (Sirat) Stretched Over Hell with its Crossings\n\nThen creation is commanded to proceed to the Bridge (Sirāt). They reach the Bridge, and crossings (Jusūr) have been stretched over Hell, finer than a hair and sharper than a sword. The crossings are submerged in Hell for a distance of forty thousand years, and the flames of Hell blaze beside them. Upon it are hooks, grappling irons, and snares.\n\nThere are seven crossings. All servants are gathered upon them. On each crossing is an obstacle (Uqba) the distance of three thousand years: one thousand years ascending, one thousand years level, and one thousand years descending. This is the meaning of Allah’s saying, <<إِنَّ رَبَّكَ لَبِالْمِرْصَادِ>> (Indeed, your Lord is in observation), meaning, upon those crossings.\n\nAngels observe creation upon them. The servant is questioned about belief in Allah (Iman bi'llah). If he comes with it, sincere, without doubt or deviation, he passes to the second crossing. He is questioned about Prayer (Salāt). If he comes with it complete, he passes to the third crossing. He is questioned about Zakat. If he comes with it complete, he passes to the fourth crossing. He is questioned about Fasting (Siyām). If he comes with it complete, he passes to the fifth crossing. He is questioned about the Pilgrimage (Hajj al-Islām). If he comes with it complete, he passes to the sixth crossing. He is questioned about Purity (Tuhur). If he comes with it complete, he passes to the seventh crossing. He is questioned about Grievances (Mazālim). If he did not wrong anyone, he passes to Paradise.\n\nIf he fell short in any one of these, he is detained at each crossing for one thousand years until Allah, the Mighty and Majestic, decrees concerning him what He wills. The narration continues to its end.\n\nThe rest of the narration will come, if Allah wills, in the chapter on Paradise, as it pertains specifically to Paradise. We did not mention the Final Creation (al-Nash'a al-Akhira) in the chapter on the Isthmus (Barzakh) because it is a sensible creation (nash'a mahsūsa), not imaginary (khayāliyya). The Resurrection is a verified, existing, sensible matter, just as man is in the world. Therefore, we delayed mentioning it until this chapter.\n\n### Continuation: Concerning the Gathering and the Spreading (Al-Hashr wa'l-Nashr)\n\n### The Disagreement Among Believers Regarding the Return\n\nKnow that people among the believers who affirm the gathering of bodies have differed concerning the Return (al-I'āda). We shall not address the doctrine of those who interpret the Return and the Final Creation as purely intellectual matters (umūr 'aqliyya) that are not sensible, for that contradicts the reality of the matter. This is because they are ignorant that there are two creations: the creation of bodies and the creation of spirits, which is the spiritual creation (al-Nash'a al-Ma'nawiyya). They affirmed the spiritual but denied the sensible.\n\nWe affirm what this opponent affirms regarding the spiritual, intelligible creation, but not what he denies. We agree that the very death of man is his resurrection, but the Minor Resurrection (al-Qiyāma al-Sughrā).\n\nFor the Prophet (PBUH) said: \"Whoever dies, his resurrection has occurred.\"\n\nAnd that the Gathering (al-Hashr) is the collection of the partial souls to the Universal Soul. I affirm all of this, just as the opponent affirms. His discussion of the Resurrection ends here.\n\nThose who affirm transmigration (Tanāsukh) and those who deny it differ on this very point. All of them are rational people of contemplation, and they argue for their positions using the apparent meanings of verses from the Book and narrations from the Sunnah. If we were to cite them and discuss them, this chapter would become lengthy by engaging with them in verifying what they have said.\n\nYet, none of them has adopted a doctrine in this matter without having a sound aspect of truth. The one who holds it has understood part of the Lawgiver’s intent, but lacks the knowledge understood by others: the affirmation of the sensible gathering in sensible bodies, the sensible Balance (Mīzān), the sensible Bridge (Sirāt), and the sensible Fire and Paradise. All of this is true and demonstrates greater Power.\n\n### Natural Science Does Not Negate the Indefinite Persistence of Natural Bodies\n\nIn natural science ('Ilm al-Tabī'a), the persistence of natural bodies in the two abodes (this world and the next) is indefinite, indeed, their existence is continuous. People have only known about the affair of nature what The Real has disclosed to them, which has manifested to them during the periods of the movements of the spheres and the seven planets. For this reason, they established the natural lifespan (al-'Umr al-Tabī'ī) as one hundred and twenty years, which this ruling necessitated. If a person exceeds this period, he enters the unknown lifespan, even though it is still within nature and has not departed from it, but it is not within the power of their knowledge to determine a specific time for it. Just as he exceeds the natural lifespan by a year or more, it is possible for him to exceed it by thousands of years, and it is possible for his life to extend perpetually.\n\nWere it not that the Divine Law (Shar') informed us of the termination of the period of this abode, and that every soul shall taste death, and informed us of the Return (al-I'āda), and informed us of the Next Abode, and informed us that the residence therein in the Final Creation is without end—we would not have known this. In every state—of death, residence, the final raising, the other creation, Gardens and bliss, Fire and torment—we do not depart from the natural course, with sensible eating, sensible drinking, sensible marriage, and sensible clothing.\n\nAllah’s Knowledge is broader and more complete. The combination of the intellect and the sensible, the intelligible and the sensible, demonstrates greater Power and is more perfect in Divine Perfection, so that His rule, Glory be to Him, over every category of possibilities, continues to encompass the realm of the Unseen (Ghayb) and the Witnessed (Shahāda), and the rule of the Names The Manifest (Al-Zāhir) and The Hidden (Al-Bātin) is established in every category.\n\n### The Return (Al-Ma'ād)—i.e., the Gathering—is Corporeal and Spiritual\n\nIf you understand this, you have been guided, and you will know that the knowledge disclosed to the Prophets and the believers by The Real is more comprehensive in its scope than the knowledge of those who rely solely on what pure intellects, devoid of Divine Effusion, necessitate.\n\nThe best course for everyone who advises himself is to return to what the Prophets and Messengers said, encompassing both the intelligible and the sensible aspects. For there is no intellectual proof that invalidates what the Divine Laws brought concerning the affirmation of the sensible and the intelligible aspects of the Return. The possibility (Imkān) remains, and the preponderant factor (al-Murajjih) exists. By what, then, can it be invalidated?\n\nHow excellent is the saying of the poet:\n\n> The astrologer and the physician both claimed / That bodies are not raised. I said: Away with you!\n>\n> If your claim is true, I have lost nothing; / But if my claim is true, the loss is yours.\n\nHis saying, \"the loss is yours,\" means where they did not believe in the apparent meaning of what the Messengers, peace be upon them, brought. His saying, \"I have lost nothing,\" means that I also believe in the spiritual, intelligible matters like you, and we have added to that another matter in which you do not believe. The one who said this did not intend to express doubt by saying \"If true,\" but rather, he spoke according to your doctrine, O addressed one. Such usage is common. Reflect upon my words and commit yourself to faith, and you shall profit and be happy, if Allah wills.\n\n### The Manner of the Return (Al-Ma'ād), the Gathering, and the Spreading\n\nAfter this is established, know that the disagreement that occurred among the believers who affirm the sensible and the physically perceived in this matter relates only to the *manner* of the Return.\n\nSome held that the Return will occur among people just as their beginning occurred: through marriage, procreation, and an initial creation from clay and breathing of the spirit, as happened with the creation of Adam and Eve and all subsequent children through marriage and union until the last human born in the world. All this occurs in a small time and a short period, according to what The Real, the Exalted, decrees. This is what Shaykh Abū al-Qāsim ibn Qasī claimed in his *Khal' al-Na'layn* regarding Allah’s saying: <<كَمَا بَدَأَكُمْ تَعُودُونَ>> (As He originated you, you will return). I do not know if this is his doctrine or if he intended to explain the speaker of that statement, who was the successor of Allah (Khalīfat Allāh) who brought that speech and was one of the unlettered.\n\nOthers held the view based on the narrated tradition that the sky will rain a rain resembling semen, with which the earth will be churned, and from it the Final Creation will arise.\n\nAs for His saying, <<كَمَا بَدَأَكُمْ تَعُودُونَ>> (As He originated you, you will return), in our view, it refers to His saying: <<وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى فَلَوْلَا تَذَكَّرُونَ>> (And you had already known the first creation, so will you not remember?) and His saying: <<كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا>> (As We began the first creation, We will repeat it. [That is] a promise binding upon Us). We know that Allah the Exalted brought the First Creation into existence without a prior example (على غير مثال سبق). Likewise, the Final Creation will be brought into existence by Allah the Exalted without a prior example, despite its being sensible without doubt. The Messenger of Allah (PBUH) mentioned descriptions of the creation of the people of Paradise and the Fire that differ from the state of this worldly creation. Thus, we know that this refers to the absence of a prior example upon which He creates it, and this demonstrates greater Power.\n\nAs for His saying, <<وَهُوَ أَهْوَنُ عَلَيْهِ>> (And it is easier for Him), this does not invalidate what we have said. For if the First Creation had resulted from the invention of thought, deliberation, and consideration, then its repetition—to create another creation that resembles it or exceeds it—would be closer to invention and recall for one who gains knowledge through his thought. But Allah is far removed and exalted above that. He is the one who grants knowledge to the world, not the one who gains knowledge, and no knowledge is renewed for Him. Rather, He is Knower of the details of what is endless through a comprehensive knowledge ('Ilm Kullī). Thus, the knowledge of detail is in the very essence of the comprehensive. This is how His Majesty ought to be.\n\n### The Coccyx (Ajb al-Dhanab) is that upon which the Human Creation is Established, and it Does Not Decay\n\nAllah creates the Final Creation upon the coccyx (عجب الذنب), which remains from this worldly creation and is its origin. The Final Creation is structured upon it.\n\nAbū Hāmid, however, held that the coccyx mentioned in the tradition is the soul (Nafs), and the Final Creation arises upon it. Others, like Abū Zayd al-Raqrāqī, said it is a single, individual substance (jawhar fard) that remains from this worldly creation and does not change, and the other creation arises upon it. All of this is possible and does not invalidate any of the fundamental principles; rather, they are all rational interpretations, and each interpretation may be the intended meaning.\n\nWhat was revealed to me through Unveiling (Kashf), about which I have no doubt, is that the intent of the coccyx (عجب الذنب) is that upon which the Creation is established, and it does not decay—meaning, it does not accept decay.\n\n### The Two Blasts and the Ignition of the Barzakh Forms by their Spirits\n\nWhen Allah creates the Final Creation, perfecting and balancing it—even though they are the substances (jawāhir) themselves—the essences (a'yān) that emerge into existence from non-existence do not cease to exist after their existence. However, the forms within them change due to mixtures, and the mixtures that give rise to these forms are accidents that occur to them by the decree of the Almighty, the All-Knowing.\n\nWhen these forms are prepared, they are like burnt grass (Hishīsh Muhraq)—this is the readiness to accept the spirits, just as grass is ready, due to the fire within it, to accept ignition. The forms of the Isthmus (al-Suwar al-Barzakhiyya) are like lamps lit by the spirits within them.\n\nIsrāfīl blows a single blast, and that blast passes over those Barzakh forms, extinguishing them. The blast that follows it—the second one—passes to the form ready for ignition, which is the Final Creation (al-Nash'a al-Akhira), and it ignites with its spirits. <<فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ>> (And suddenly they are standing, looking on). Those forms stand up, alive and speaking what Allah makes them speak. Some speak with praise to Allah, some say, <<مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا>> (Who has resurrected us from our sleeping place?), and some say, \"Glory be to Him who brought us to life after He caused us to die, and to Him is the Raising (al-Nushūr).\" Every speaker speaks according to his knowledge and his state, having forgotten his condition in the Barzakh. He imagines that what he was in was a sleep, just as the awakened person imagines. Yet, when he died and moved to the Barzakh, he was like one awakened there, and the worldly life was like a sleep for him.\n\n### The Affair of the World is a Dream within a Dream, and the Next Abode is the Life\n\nIn the Next Life, he believes that the affair of the world and the Barzakh was a dream within a dream, and that the true wakefulness is the state he is in in the Next Abode. In that state, he says that man in the world was in a sleep, then he moved by death to the Barzakh, where he was like one who sees in a dream that he has woken up from sleep. After that, the Final Creation is the wakefulness in which there is no sleep, nor sleep after it for the people of felicity. However, for the people of the Fire, there is rest in it, as we mentioned previously.\n\nThe Messenger of Allah (PBUH) said: \"Mankind are asleep, and when they die, they awaken.\"\n\nThe world, relative to the Barzakh, is sleep and a dream, for the Barzakh is closer to the true affair and is therefore more deserving of being called wakefulness. But the Barzakh, when viewed in relation to the Final Creation on the Day of Resurrection, is a dream. Know this.\n\n### The Greatest Intercession for the First and the Last\n\nWhen people stand, and the earth is stretched out, and <<انْشَقَّتِ السَّمَاءُ>> (the heaven is split), and the stars fall, and the sun is wrapped up, and <<خَسَفَ الْقَمَرُ>> (the moon is eclipsed), and the wild beasts are gathered, and the seas are set ablaze, and souls are paired with their bodies, and the angels descend <<عَلَى أَرْجَائِهَا>> (upon its edges)—meaning the edges of the heavens—and our Lord comes <<فِي ظُلَلٍ مِنَ الْغَمَامِ>> (in canopies of clouds), and the caller calls out, \"O people of felicity!\" and the three groups we mentioned are taken from them, and the Neck emerges from the Fire and seizes the three groups we mentioned, and people surge, and the heat intensifies, and sweat chokes the people, and the matter is grave, and the affair is momentous, and there is astonishment, <<فَلَا تَسْمَعُ إِلَّا هَمْسًا>> (so you hear nothing but a whisper), and Hell is brought, and the standing is prolonged for the people, and they do not know what The Real intends for them.\n\nThe Messenger of Allah (PBUH) said: \"The people will say to one another, 'Let us go to our father Adam and ask him to ask Allah for us to relieve us from what we are in, for our standing has been prolonged.' They come to Adam and ask him for this. Adam says, 'Indeed, Allah is angry today with a wrath He has never been angry with before, nor will He be angry with after it.'\" He mentions his sin and is ashamed before his Lord to ask Him.\n\nThey come to Noah with the same request. He tells them the same as Adam and mentions his prayer against his people and his saying, <<وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا>> (And they will not give birth except to wicked, ungrateful ones). The point of accountability upon him is his saying, <<وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا>>, not the mere fact of his prayer against them.\n\nThen they come to Abraham, peace be upon him, with the same request. He says to them what those before him said, and mentions his three lies.\n\nThen they come to Moses and Jesus, and they say to each of the Messengers what they said to Adam, and they reply with Adam’s answer.\n\nThen they come to Muhammad (PBUH), who is the Master of Mankind on the Day of Resurrection. They say to him what they said to the Prophets. Muhammad (PBUH) says, \"I am for it.\" This is the Praised Station (al-Maqām al-Mahmūd) that Allah promised him on the Day of Resurrection. He comes and prostrates and praises Allah with praises that Allah inspires him with at that time, which he did not know before. Then he intercedes with his Lord to open the door of intercession for creation. Allah opens that door and permits intercession for the angels, the Messengers, the Prophets, and the believers.\n\nBy this, he becomes the Master of Mankind on the Day of Resurrection, for he interceded with Allah that the angels and Messengers might intercede.\n\n### The Master of Mankind on the Day of Resurrection\n\nDespite this, he (PBUH) maintained propriety and said, \"I am the Master of Mankind,\" and did not say \"Master of all Creation\" (Sayyid al-Khalā'iq), thereby including the angels in that statement, despite the manifestation of his authority over everyone on that Day. This is because he (PBUH) was granted the stations of all the Prophets, peace be upon them, combined. However, the authority over the angels that appeared for Adam, peace be upon him, through his exclusive knowledge of all the Names, had not appeared for him.\n\nThus, on that Day, everyone—including the angels and mankind, from Adam downwards—is in need of him to open the door of intercession and to manifest the high status he holds with Allah, since the Divine Compulsion (al-Qahr al-Ilāhī) and the Greatest Majesty (al-Jabarūt al-A'zam) had silenced everyone. This station is like the station of Adam, peace be upon him, and greater, on a day when the need is intense, coupled with the mention of the Divine Wrath (al-Ghadab al-Ilāhī) in which The Real manifests on that Day. Such an attribute did not manifest in the affair of Adam. The totality of these events indicates his immense status (PBUH), as he stepped forward to supplicate The Real concerning the request despite this Attribute of Divine Wrath.\n\n### The Theophany of The Real on the Day of Resurrection in the Lowest Form\n\nThe Real, Glory be to Him, answers him. The Balances are set up, the scrolls are spread, the Bridge is erected, and intercession begins. The angels intercede first, then the Prophets, then the believers. And the Most Merciful of the Merciful remains.\n\nHere there is a great detail that would prolong the discussion, for it is a momentous station. However, The Real manifests on that Day and says that every nation should follow what they used to worship, until only this nation remains, including its hypocrites. The Real manifests to them in the lowest form of the forms in which He had manifested to them before. He says, \"I am your Lord.\" They say, \"We seek refuge in Allah from you. We are waiting until our Lord comes to us.\" He, Glorified and Exalted, says to them, \"Is there a sign between you and Him by which you recognize Him?\" They say, \"Yes.\" He transforms for them into the form in which they recognized Him by that sign. They say, \"You are our Lord.\"\n\nHe commands them to prostrate. No one who used to prostrate to Allah remains but that he prostrates. But whoever used to prostrate out of hypocrisy and show (Riyā') has his back made into a layer of copper; whenever he tries to prostrate, he falls backward onto his nape. This is His saying: <<يَوْمَ يُكْشَفُ عَنْ سَاقٍ وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ ... وَقَدْ كَانُوا يُدْعَوْنَ إِلَى السُّجُودِ وَهُمْ سَالِمُونَ>> (The Day the Shin will be uncovered, and they will be invited to prostration but will not be able... And they had been invited to prostration while they were sound)—meaning, in the world.\n\nThe Shin (Sāq) that is uncovered for them is an expression for a great matter of the horrors of the Day of Resurrection. The Arabs say, \"The war uncovered its shin,\" when the war intensified and its affair became momentous. Likewise, <<الْتَفَّتِ السَّاقُ بِالسَّاقِ>> (And the leg is joined with the leg) means that the horrors and momentous affairs entered into one another on the Day of Resurrection.\n\n### Intellectual Monotheism and Legal Monotheism and Entry into Paradise\n\nWhen intercession has taken place, and no legal believer (Mu'min Shar'ī) remains in the Fire at all, nor anyone who performed a prescribed deed (Amal Mashrū') as prescribed by the tongue of a Prophet, even if it was <<مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ>> (the weight of a mustard seed) or smaller, but that he has emerged through the intercession of the Prophets and believers—there remain the people of Monotheism (Ahl al-Tawhīd) who knew Monotheism through rational proofs ('Adilla al-'Aqliyya) and did not associate anything with Allah, but who did not believe with legal faith (Īmān Shar'ī) and never performed any good deed at all by following a Prophet. They did not possess an atom of faith or less.\n\nThese are the ones whom the Most Merciful of the Merciful brings out. His saying, \"And they never performed any good deed at all,\" means a prescribed deed, as prescribed by law. And there is no greater good deed than faith (Īmān), which they did not perform.\n\nThis is the Hadith of 'Uthmān ibn 'Affān in *Sahīh Muslim ibn al-Hajjāj*: The Messenger of Allah (PBUH) said: \"Whoever dies while he *knows* (and he did not say *believes*) that there is no god but Allah, enters Paradise.\"\n\nHe did not say *says*, but singled out *knowledge* ('Ilm). It is for these people that Allah’s providence precedes in the Fire, for the Fire itself does not accept the eternal dwelling of a monotheist (Muwahhid) in any form whatsoever. The most perfect form of this is faith based on knowledge, combining knowledge and faith.\n\nIf you say, \"But Iblīs knows that Allah is One,\" we say, \"You speak truly, but he was the first to institute polytheism (Shirk), so he bears the sin of the polytheists, and their sin is that they do not leave the Fire.\" This is if it is established that he died a monotheist. But how do you know? Perhaps he died a polytheist due to a doubt that occurred to him in his contemplation. We have previously discussed this issue in past chapters. Iblīs is not leaving the Fire. Allah knows which of these was the case.\n\nHere there is much knowledge, and its inclusion would be lengthy and take us away from the goal of brevity. Nevertheless, we must mention a summary of every famous station (Mawṭin) of the Resurrection, such as the Presentation ('Ard), the Taking of the Books, the Balance (Mīzān), the Bridge (Sirāt), the Heights (A'rāf), the Slaughter of Death (Dhabh al-Mawt), and the Feast (Ma'duba) that takes place in the field of Paradise. These are seven stations and no more. They are the mothers (Ummāhāt) of the seven gates of the Fire and the seven gates of Paradise. The eighth gate is the Gate of Vision (Jannat al-Ru'ya), which is the closed gate in the Fire—the Gate of the Veil (Bāb al-Hijāb)—which will never be opened, for the people of the Fire are veiled from their Lord.\n\n### Continuation: The Seven Primary Stations on the Day of Resurrection\n\n### The First Station: The Presentation (Al-'Ard)\n\nIt is narrated in the tradition that the Messenger of Allah (PBUH) was asked about Allah’s saying: <<فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا>> (He will soon be reckoned with an easy reckoning). He said: \"That is the Presentation, O 'Ā'isha. Whoever is questioned in detail about the reckoning will be tormented.\"\n\nIt is like the presentation of an army—meaning, the presentation of deeds—not because they are the attire of the people of the Standing. Allah is the Sovereign, so <<يُعْرَفُ الْمُجْرِمُونَ بِسِيمَاهُمْ>> (the criminals will be known by their marks), just as soldiers here are known by their uniform.\n\n### The Second Station: The Books (Al-Kutub)\n\nAllah the Exalted said: <<اقْرَأْ كِتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا>> (Read your book. Sufficient is yourself against you this Day as a reckoner). And He said: <<فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ>> (As for he who is given his book in his right hand), who is the fortunate believer, and <<وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِشِمَالِهِ>> (But as for he who is given his book in his left hand), who is the hypocrite (Munāfiq). The disbeliever (Kāfir) has no book [of deeds]. The hypocrite was stripped of faith but not of Islam.\n\nIt is said concerning the hypocrite: <<إِنَّهُ كَانَ لَا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ>> (Indeed, he did not believe in Allah, the Magnificent). This includes the atheist (Mu'attil), the polytheist (Mushrik), and the one arrogant toward Allah. It does not address Islam, for the hypocrite outwardly submits to protect his wealth, family, and blood, while inwardly he is one of these three. We say that this verse encompasses the three because His saying <<لَا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ>> means he does not affirm Allah. Those who do not affirm Allah are two groups: a group that does not affirm the existence of Allah (the atheists), and a group that does not affirm the Oneness of Allah (the polytheists). His saying *Al-Azīm* (The Magnificent) in this verse includes the one arrogant toward Allah, for if he believed in the Magnificence of Allah that is due to the one named Allah, he would not be arrogant toward Him. These three, along with the hypocrite who is distinguished from them by a specific description, are the people of the Fire who belong there.\n\nAs for <<وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ>> (But as for he who is given his book behind his back), these are those who were given the Scripture (Kitāb), but <<فَنَبَذُوهُ وَرَاءَ ظُهُورِهِمْ وَاشْتَرَوْا بِهِ ثَمَنًا قَلِيلًا>> (cast it behind their backs and exchanged it for a small price). When the Day of Resurrection comes, it will be said to him, \"Take it from behind your back,\" meaning from the place where you cast it in your worldly life. This is their revealed Scripture, not the book of deeds. When he cast it behind his back, <<ظَنَّ أَنْ لَنْ يَحُورَ>> (he thought that he would never return), meaning he was certain. The poet said:\n\n> I said to them, \"Be certain of two thousand armored men.\"\n\nIt is mentioned in the *Sahīh* that Allah says to him on the Day of Resurrection, \"Did you think that you would meet Me?\"\n\nAnd Allah the Exalted said: <<وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ>> (And that was your assumption which you assumed about your Lord. It has ruined you).\n\n### The Third Station: The Balances (Al-Mawāzīn)\n\nThe Balances are set up to weigh the deeds. The scrolls containing what they did are placed in them. The last thing placed in the Balance is a person’s saying, *Al-Hamdulillah* (Praise be to Allah). For this reason,\n\nThe Prophet (PBUH) said: \"Praise be to Allah fills the Balance.\"\n\nAll the deeds of the servants are cast into the Balance except the phrase *Lā ilāha illā Allāh* (There is no god but Allah). A single utterance of praise (Tahmīda) remains to fill it, and when it is placed, the Balance is filled by it. The scale of every person is commensurate with his deeds, without increase or decrease. Every remembrance and deed enters the Balance except *Lā ilāha illā Allāh*, as we said.\n\nThe reason for this is that every good deed has an opposite counterpart. This good deed is placed in its balance. But *Lā ilāha illā Allāh* is only countered by polytheism (Shirk). Monotheism and polytheism cannot coexist in anyone’s Balance, because if he says *Lā ilāha illā Allāh* believing in it, he has not committed polytheism; and if he commits polytheism, he has not believed in *Lā ilāha illā Allāh*. Since it is impossible for them to be combined, the phrase *Lā ilāha illā Allāh* has nothing to counterbalance it in the other scale, and nothing outweighs it. Therefore, it does not enter the Balance.\n\nAs for the polytheists, <<فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا>> (We will not assign to them on the Day of Resurrection any weight), meaning they have no value, and no deed will be weighed for them, nor for those like them who denied the meeting with Allah and disbelieved in His signs. The good deeds of the polytheist are nullified, so their evil deeds have nothing to counterbalance them. <<فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا>>.\n\nAs for the person of the Scrolls (Sijillāt), he is a person who never performed any good deed at all, except that one day he uttered the phrase *Lā ilāha illā Allāh* sincerely. It is placed for him opposite ninety-nine scrolls of evil deeds, each scroll being as vast as the distance between the East and the West. This is because he has no other good deed. His scale outweighs all the scrolls, and the scrolls fly up. People are astonished by this.\n\nOnly the deeds of the physical limbs (Jawārih)—their good and evil: hearing, sight, tongue, hand, stomach, private parts, and leg—enter the sensible Balance. As for the inner deeds, they do not enter the sensible Balance, but justice is established for them in the judicial, metaphysical Balance (al-Mīzān al-Hukmī al-Ma'nawī), where the sensible is countered by the sensible, and the spiritual by the spiritual. Everything is countered by its like. Therefore, deeds are weighed in terms of how they are written.\n\n### The Fourth Station: The Bridge (Al-Sirāt)\n\nThis is the prescribed Path (Sirāt) which was a spiritual meaning here, but will be erected there as a sensible, physical reality. Allah says to us: <<وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ>> (And indeed, this is My path, straight, so follow it and do not follow [other] ways, for they will separate you from His way). When the Messenger of Allah (PBUH) recited this verse, he drew a line and drew lines on its sides, thus:\n\n[Diagram implied: a straight line with lines branching off]\n\nThis is the path of Monotheism (Tawhīd), its requirements, and its rights.\n\nThe Messenger of Allah (PBUH) said: \"I have been commanded to fight people until they say, 'There is no god but Allah.' If they say it, they have protected their blood and wealth from me, except by the right of Islam, and their reckoning is with Allah.\"\n\n[The rest of the Hadith will follow in the chapter on Paradise.]\n\nHe intended by His saying, \"and their reckoning is upon Allah,\" that none knows whether they spoke it believing in it except Allah. Thus, the polytheist (المشرك) has no footing (قدم) upon the Bridge of Unity (صراط التوحيد), but he does have a footing upon the Bridge of Existence (صراط الوجود). The denier (المعطل) has no footing upon the Bridge of Existence. The polytheist did not affirm Allah's Unity here [in this life], so he proceeds from the Station [of Judgment] to the Fire along with the deniers. Who are the people of the Fire who truly belong there, except the hypocrites (المنافقين)? They must look upon Paradise and the bliss within it, and thus they covet it. That is their portion of the bliss of the Gardens, and then they are turned away to the Fire. This is part of Allah’s Justice, for they are recompensed according to their deeds.\n\nThe group that is not eternally abiding in the Fire is held, questioned, and tormented upon the Bridge (الصراط). The Bridge is situated over the surface of Hell (جهنم), submerged within it, and the hooks (الكلاليب) upon it are what Allah uses to hold them there. Since the Bridge is in the Fire, and there is no path to Paradise except across it, Allah the Exalted said: <<وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا>> (And there is none of you except that he will reach it. This is upon your Lord an inevitability decreed) [Q. 19:71]. Whoever understands the meaning of this saying knows the true location of Hell. Had the Prophet (PBUH) stated it when he was asked about it, I would have stated it. He only remained silent about it and said, in response, \"It is in the Knowledge of Allah,\" by a Divine command, for <<وَمَا يَنْطِقُ عَنِ الْهَوَى>> (nor does he speak from [his own] inclination) [Q. 53:3]. Since this is not a matter of this world, our silence concerning it is proper etiquette (الأدب).\n\nIt has been reported concerning the description of the Bridge that it is finer than a hair and sharper than a sword. Likewise is the science of the Sacred Law (الشريعة) in this world: one does not know the exact face of the Truth (وجه الحق) in a given legal issue as it is with Allah, nor precisely which of the jurists (المجتهدين) is correct. For this reason, we are obligated to follow the preponderance of probability (غلبات الظنون) after exerting effort in seeking the evidence, except in cases of widely transmitted reports (المتواتر) or known, sound solitary reports (خبر الواحد الصحيح المعلوم). Although the widely transmitted report provides certainty (العلم), the certainty derived from it is only the certainty that the Prophet (PBUH) spoke or acted upon that specific wording. What we seek through knowledge (العلم) is the understanding derived from that saying or action, so that one may rule on the issue with absolute certainty (القطع). This certainty is only reached through an explicit, widely transmitted text (النص الصريح المتواتر), which is rarely found, such as His saying, the Exalted: <<تِلْكَ عَشَرَةٌ كَامِلَةٌ>> (That is ten complete) [Q. 2:196], specifically concerning the number ten. Thus, the ruling of the Sacred Law is sharper than a sword and finer than a hair in this world. The one who is correct in the ruling is one, though not specifically identified, yet all are correct in receiving the reward. The Sacred Law here is the Straight Path (الصراط المستقيم). One continuously says in every unit (ركعة) of the prayer: <<اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ>> (Guide us to the Straight Path) [Q. 1:6]. It is sharper than a sword and finer than a hair. Its manifestation in the Hereafter is a tangible reality, clearer and more evident than its manifestation in this world, except for those who call to Allah upon insight (بصيرة), like the Messenger and his followers. Allah joins them to the rank of the Prophets in calling <<إِلَى اللَّهِ عَلَى بَصِيرَةٍ>> (to Allah upon insight), meaning upon knowledge (علم) and unveiling (كشف).\n\nIt has been reported in a narration that the surface of the Bridge appears on the Day of Resurrection to the eyes according to the measure of the light (نور) of those passing over it. Thus, it is narrow for some people and wide for others. This narration is confirmed by His saying, the Exalted: <<نُورُهُمْ يَسْعَى بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ>> (Their light will proceed before them and on their right) [Q. 66:8]. The proceeding (السعي) is walking, and there is no path there except the Bridge. He only mentioned \"on their right\" (بِأَيْمَانِهِمْ) because the believer in the Hereafter has no left side, just as the people of the Fire have no right side. This is some of the description of what occurs on the Bridge.\n\nAs for the hooks (الكلاليب), grappling irons (الخطاطيف), and thorns (الحسك), as we mentioned, they are the forms of the deeds of the children of Adam. Their deeds hold them upon the Bridge, so they neither advance toward Paradise nor fall into the Fire until intercession (الشفاعة) and Divine Providence (العناية الإلهية) reach them, as we have established. Whoever overlooks [the faults of others] here, Allah will overlook his faults there. Whoever grants respite to one in difficulty, Allah will grant him respite. Whoever pardons, Allah will pardon him. Whoever insists on receiving his full right from His servants here, Allah will insist on receiving His full right from him there. Whoever is harsh toward this Community (الأمة), Allah will be harsh toward him. Indeed, these are your deeds returned to you, so adhere to noble character (مكارم الأخلاق). For tomorrow, Allah will deal with you according to how you dealt with His servants, whatever happened and whoever they were.\n\n**The Fifth Station: Al-A'raf (The Heights)**\n\nAs for Al-A'raf, it is a wall (سور) between Paradise and the Fire. <<بَاطِنُهُ فِيهِ الرَّحْمَةُ>> (Its interior contains mercy) [Q. 57:13], which is the side facing Paradise, and <<وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ>> (and its exterior, before it, is torment) [Q. 57:13], which is the side facing the Fire. Those whose scales of deeds are equally balanced stand upon it. They look toward the Fire and they look toward Paradise, having no preponderance that would admit them to either abode. When they are called to prostrate (السجود)—which is the only remaining obligation (تكليف) on the Day of Resurrection—they prostrate, and their scale of good deeds (حسناتهم) tips, so they enter Paradise. They had been looking toward the Fire because of their evil deeds (سيئات) and looking toward Paradise because of their good deeds, and they see Allah’s Mercy, so they covet it. The reason for their coveting is also that they are among the people of \"There is no god but Allah\" (لا إله إلا الله), yet they do not see it in their scale. They know that <<إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ>> (Indeed, Allah wrongs not even the weight of an atom) [Q. 4:40]. If an atom had been added to either scale, it would have tipped it, because they are in a state of perfect equilibrium. Thus, they covet Allah’s Generosity and Justice, knowing that the phrase *la ilaha illa Allah* must necessarily have a special providence (عناية) for its speaker, the effect of which must manifest upon them.\n\nThe Mighty and Majestic says concerning them: <<وَعَلَى الْأَعْرَافِ رِجَالٌ يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ وَنَادَوْا أَصْحَابَ الْجَنَّةِ أَنْ سَلَامٌ عَلَيْكُمْ لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ>> (And on the Heights will be men who recognize all by their marks. And they will call to the companions of Paradise, \"Peace be upon you.\" They have not entered it, but they long [for it]) [Q. 7:46]. Likewise, they call out when <<إِذَا صُرِفَتْ أَبْصَارُهُمْ تِلْقَاءَ أَصْحَابِ النَّارِ قَالُوا رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ>> (their eyes are turned toward the companions of the Fire, they say, \"Our Lord, do not place us with the wrongdoing people\") [Q. 7:47]. The wrongdoing (الظلم) here is polytheism (الشرك) and nothing else.\n\n**The Sixth Station: The Slaughter of Death**\n\nAlthough Death (الموت) is a relative concept (نسبة), Allah will manifest it on the Day of Resurrection in the form of a speckled ram (كبش أملح). A caller will cry out, \"O people of Paradise!\" and they will crane their necks. And a caller will cry out, \"O people of the Fire!\" and they will crane their necks. At that time, only those who truly belong to the Fire will be in it. It will be said to both groups, \"Do you recognize this?\"—and it will be standing between Paradise and the Fire. They will say, \"It is Death.\" Then John (Yahya), peace be upon him, will come with a knife in his hand, lay it down, and slaughter it. A caller will then proclaim: \"O people of Paradise, Eternity (خلود) with no death! And O people of the Fire, Eternity with no death!\" That is the Day of Regret (يَوْمَ الْحَسْرَةِ).\n\nAs for the people of Paradise, when they see Death, they rejoice greatly at its sight and say to it, \"May Allah bless you for us! You have delivered us from the misery of the world, and you were the best arrival for us and the best gift (تحفة) The Real (الحق) presented to us.\" For the Prophet (PBUH) said: \"Death is the gift of the believer.\" As for the people of the Fire, when they see it, they are terrified of it and say to it, \"You were the worst arrival for us, for you stood between us and the goodness and tranquility we were in.\" Then they say to it, \"Perhaps you will kill us so we may rest from what we are in.\"\n\nIt is only called the Day of Regret (يوم الحسرة) because it reveals (حسر) to all the quality of permanent Eternity (الخلود الدائم) for both groups. Then the gates of the Fire are sealed with a sealing after which there is no opening. The Fire collapses upon its inhabitants, and parts of it enter into other parts to intensify the compression (انضغاط) of its people within it. Its bottom returns to its top, and its top to its bottom. You will see the humans and the devils within it like pieces of meat in a pot, since beneath it is the mighty Fire, boiling <<كَغْلِي الْحَمِيمِ>> (like the boiling of scalding water) [Q. 44:46]. It rotates those within it, high and low. <<كُلَّمَا خَبَتْ زِدْنَاهُمْ سَعِيرًا>> (Whenever it subsides, We will increase them in [the blaze of] fire) [Q. 17:97] by replacing their skins.\n\n**The Seventh Station: The Feast**\n\nThis is the King’s feast (مأدبة) for the people of Paradise. At that time, the people of the Fire gather in a place of lamentation (مندبة). Thus, the people of Paradise are at the feast (مأدب), and the people of the Fire are in lamentation (منادب). Their food at that feast is the excess of the liver of the Nun (whale/fish). The ground of the gathering place is white *durmaka* (fine flour) like a flat loaf. The spleen (الطحال) of the Ox (الثور) is brought forth for the people of the Fire.\n\nThe people of Paradise eat from the excess of the liver of the Nun, which is a marine, aquatic creature, belonging to the element of life (عنصر الحياة) appropriate for Paradise. The liver is the house of blood, and it is the house of life. Life is hot and moist. The vapor of that blood is the soul (النفس), expressed as the animal spirit (الروح الحيواني) by which the body lives. This is a glad tiding for the people of Paradise concerning the permanence of their life.\n\nAs for the spleen (الطحال) in the animal body, it is the house of impurities (الأوساخ), for the body’s impurities gather in it, specifically the corrupted blood that the liver gives off. This is given to the people of the Fire to eat. It comes from the Ox (الثور), which is a terrestrial animal whose nature is cold and dry. Hell (جهنم) is in the form of a buffalo (جاموس). The spleen of the Ox is thus most appropriate as nourishment for the people of the Fire. Due to the bloodiness (الدمية) in the spleen, the people of the Fire do not die, but due to the impurities of the body and the painful corrupted blood within it, they neither live nor enjoy bliss. Eating it bequeaths them sickness and illness.\n\nThen the people of Paradise enter Paradise, <<مَا هُمْ مِنْهَا بِمُخْرَجِينَ>> (and they will not be removed from it) [Q. 15:48]. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way) [Q. 33:4].\n\nEnd of the Twenty-Eighth Part.",
    "ur": "## (چونسٹھواں باب: قیامت، اس کے مقامات اور بعث (دوبارہ اٹھائے جانے) کی کیفیت کی معرفت میں)\n\n(بسم الله الرحمن الرحيم)\n\n> معراج کا دن پچاس ہزار سال کا ہے *** ہر سونے والے اور اس کے دانت سے اڑ جاتا ہے\n> اور زمین اس کے خوف سے جاگ رہی ہے *** اللہ جو فیصلہ کرے گا، نیند اسے نہیں لے گی\n> پس اجنبی بن جا اور کسی گروہ پر بھروسہ نہ کر *** جو خارجی ہیں، تیز زبانوں والے\n> اور اگر تو کسی شخص کو فساد کے لیے دوڑتا دیکھے *** تو اس کا ہاتھ پکڑ لے، تجھے اس کی نیکی کا بدلہ ملے گا\n> اور کسی ایسے شخص سے بچنے کے لیے غار (کہف) میں پناہ لے *** جس کا فتنہ تجھے ایک دن سال کی طرح دکھائے\n> جس نے اپنے قدم کو اللہ کی اطاعت کے علاوہ بڑھایا *** اور ہمیشہ اپنی خواہش میں اپنی لگام کھولے رکھی۔\n\n### [یوم القیامہ کا معنی]\n\nجان لو کہ اس دن کو یوم القیامہ (قیامت کا دن) اس لیے کہا گیا ہے کہ اس میں لوگ اپنی قبروں سے رب العالمین کے لیے اٹھیں گے، اس دوسری نشأت (النشأة الآخرة) میں جس کا ذکر ہم نے اس باب سے پہلے برزخ (البرزخ) کے باب میں کیا ہے۔ اور اس لیے بھی کہ وہ کھڑے ہوں گے جب الحق (ذات حق) فیصلے اور قضا کے لیے آئے گا اور فرشتے صف در صف (الْمَلَكُ صَفًّا صَفًّا) ہوں گے۔ اللہ تعالیٰ فرماتا ہے: يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعالَمِينَ (جس دن لوگ رب العالمین کے لیے کھڑے ہوں گے)۔ یعنی رب العالمین کی خاطر، جب وہ آئے گا۔ اور یہاں اسم 'الرب' (رب) لایا گیا ہے کیونکہ رب ہی مالک ہوتا ہے، پس اس میں قہر (القهر) کی صفت بھی ہے اور رحمت (الرحمة) کی صفت بھی۔ اسم 'الرحمن' (رحمن) نہیں لایا گیا کیونکہ اس دن غضب کا ہونا ضروری ہے جیسا کہ اس باب میں آگے آئے گا، اور حساب، جہنم اور میزان (ترازو) کا لایا جانا بھی ضروری ہے، اور یہ سب مطلق رحمت کی صفات میں سے نہیں ہیں جن کا تقاضا اسم 'الرحمن' کرتا ہے۔ تاہم، اس نے سبحانہ و تعالیٰ نے ایک ایسا الٰہی نام استعمال کیا جس میں رحمت غالب ہے، اور وہ اسم 'الرب' ہے، کیونکہ یہ اصلاح اور تربیت (التربية) سے متعلق ہے۔ پس مالک اور آقا میں موجود رحمت کا فضل اس میں موجود قہر کی صفت پر غالب آ جاتا ہے، اور اس کی رحمت اس کے غضب پر سبقت لے جاتی ہے، اور اکثر لوگوں کی برائیوں سے درگزر زیادہ ہو جاتا ہے۔\n\n### [قیامت کے ظواہر اور مشاہد]\n\nپس سب سے پہلے میں وہ بیان کروں گا جو اللہ نے اس دن کے بارے میں فرمایا ہے، یعنی زمین کا پھیل جانا، آسمان کا لپیٹ لیا جانا اور زمین پر گر جانا، فرشتوں کا آنا، اور اس دن رب کا آنا، اور جب زمین پھیلا دی جائے گی اور اس کی صورت بدل دی جائے گی تو مخلوق کہاں ہو گی، اور جہنم کا آنا اور اس کا معاملہ کیا ہو گا، پھر میں پچاس ہزار سال (خَمْسِينَ أَلْفَ سَنَةٍ) کے قیام کے مقامات اور شفاعت کی حدیث بیان کروں گا۔ اے میرے بھائی! جان لو کہ جب لوگ اپنی قبروں سے اٹھیں گے جیسا کہ ہم ان شاء اللہ بیان کریں گے، اور اللہ ارادہ کرے گا کہ زمین کو دوسری زمین سے بدل دے اور زمین کو اللہ کے اذن سے پھیلا دیا جائے، اور پل صراط تاریکی کے نیچے ہو گا، تو مخلوق اس پر ہو گی جب اللہ زمین کو اپنی مرضی کے مطابق بدل دے گا، یا تو صورت کے اعتبار سے یا کسی دوسری زمین سے جس پر کوئی سویا نہ ہو، جسے الساھرۃ (جاگتی زمین) کہا جاتا ہے۔ پس وہ سبحانہ و تعالیٰ اسے چمڑے کی طرح پھیلا دے گا۔ اللہ تعالیٰ فرماتا ہے: وإِذَا الْأَرْضُ مُدَّتْ (اور جب زمین پھیلا دی جائے گی)۔ اور وہ اس کی وسعت میں جتنا چاہے گا اضافہ کر دے گا، اکیس حصوں سے لے کر ننانوے حصوں تک، یہاں تک کہ تو اس میں کوئی کجی اور بلندی نہیں دیکھے گا (لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً)۔ پھر وہ سبحانہ و تعالیٰ آسمان کو اپنی طرف لپیٹ لے گا، اور اسے اپنے دائیں ہاتھ سے لپیٹ دے گا جیسے طومار کو کتابوں کے لیے لپیٹا جاتا ہے (كَطَيِّ السِّجِلِّ لِلْكُتُبِ)۔ پھر اسے اس زمین پر پھینک دے گا جسے اس نے پھیلا دیا ہے، اور وہ کمزور ہو گا، اور یہی اس کا قول ہے: وانْشَقَّتِ السَّماءُ فَهِيَ يَوْمَئِذٍ واهِيَةٌ (اور آسمان پھٹ جائے گا، پس وہ اس دن کمزور ہو گا)۔ اور وہ مخلوق کو اس زمین کی طرف لوٹا دے گا جسے اس نے پھیلا دیا ہے، پس وہ کھڑے ہو کر انتظار کریں گے کہ اللہ ان کے ساتھ کیا کرتا ہے۔ جب آسمان کمزور ہو جائے گا تو اس کے فرشتے اس کے کناروں پر اتریں گے، پس اہل زمین ایک عظیم مخلوق دیکھیں گے جو تعداد میں ان سے کئی گنا زیادہ ہو گی، تو وہ گمان کریں گے کہ اللہ ان میں اتر آیا ہے، کیونکہ وہ سلطنت کی ایسی عظمت دیکھیں گے جو انہوں نے پہلے کبھی نہیں دیکھی تھی۔ پس وہ کہیں گے: کیا تم میں ہمارا رب ہے؟ تو فرشتے کہیں گے: ہمارا رب پاک ہے، وہ ہم میں نہیں ہے، اور وہ آنے والا ہے۔ پس وہ فرشتے زمین کے اطراف پر دائرے کی شکل میں صف باندھ لیں گے، جو جنوں اور انسانوں کی دنیا کو گھیرے ہوئے ہوں گے، اور یہ پہلے آسمان کے آباد کرنے والے ہیں۔ پھر دوسرے آسمان والے اتریں گے، جب اللہ اسے بھی لپیٹ لے گا اور اس کے ستارے کو آگ میں پھینک دے گا، جسے کاتب کہا جاتا ہے، اور وہ پہلے آسمان والوں سے تعداد میں زیادہ ہوں گے۔ تو مخلوق کہے گی: کیا تم میں ہمارا رب ہے؟ تو فرشتے ان کے قول سے گھبرا جائیں گے اور کہیں گے: ہمارا رب پاک ہے، وہ ہم میں نہیں ہے، اور وہ آنے والا ہے۔ پس وہ پہلے فرشتوں کی طرح کریں گے، ان کے پیچھے دوسری صف میں دائرے کی شکل میں کھڑے ہو جائیں گے۔ پھر تیسرے آسمان والے اتریں گے اور اس کے ستارے کو، جسے زہرہ کہا جاتا ہے، آگ میں پھینک دیا جائے گا، اور اللہ اسے اپنے دائیں ہاتھ سے لپیٹ لے گا۔ تو مخلوق کہے گی: کیا تم میں ہمارا رب ہے؟ تو فرشتے کہیں گے: ہمارا رب پاک ہے، وہ ہم میں نہیں ہے، اور وہ آنے والا ہے۔ اور یہ معاملہ اسی طرح آسمان در آسمان چلتا رہے گا، یہاں تک کہ ساتویں آسمان والے اتریں گے، اور وہ ان سب سے زیادہ مخلوق دیکھیں گے جو اتر چکے ہیں۔ تو مخلوق کہے گی: کیا تم میں ہمارا رب ہے؟ تو فرشتے کہیں گے: سُبْحانَ رَبِّنا قَدْ جاءَ رَبُّنا وإِنْ كانَ وَعْدُ رَبِّنا لَمَفْعُولًا (ہمارا رب پاک ہے، ہمارا رب آ گیا ہے، اور ہمارے رب کا وعدہ ضرور پورا ہونے والا تھا)۔\n\n### [رب کا بادلوں کے سائے میں نزول]\n\nپس اللہ بادلوں کے سائے (ظُلَلٍ من الْغَمامِ) اور فرشتوں (والْمَلائِكَةُ) کے ساتھ آئے گا، اور بائیں جانب جہنم ہو گی۔ اور اس کا آنا بادشاہ کا آنا ہو گا، کیونکہ وہ فرماتا ہے: مالِكِ يَوْمِ الدِّينِ (روز جزا کا مالک)، اور وہ یہی دن ہے۔ پس اسے بادشاہ کے نام سے موسوم کیا گیا۔ اور فرشتے سات صفیں بنا کر مخلوق کو گھیرے ہوئے کھڑے ہوں گے۔ جب لوگ جہنم کو دیکھیں گے کہ وہ جوش مار رہی ہے اور متکبر جابروں پر غصہ کر رہی ہے، تو تمام مخلوق اس سے بھاگے گی، اس عظیم ہولناکی کے خوف اور گھبراہٹ کی وجہ سے جسے وہ دیکھیں گے، اور یہی الفزع الأكبر (سب سے بڑا خوف) ہے، سوائے اس گروہ کے جسے سب سے بڑا خوف غمگین نہیں کرے گا (لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ) اور فرشتے ان کا استقبال کریں گے: یہ تمہارا وہ دن ہے جس کا تم سے وعدہ کیا جاتا تھا (تَتَلَقَّاهُمُ الْمَلائِكَةُ هذا يَوْمُكُمُ الَّذِي كُنْتُمْ تُوعَدُونَ)۔ پس وہ انبیاء کے ساتھ اپنی جانوں کے لیے محفوظ ہوں گے، سوائے اس کے کہ انبیاء اپنی امتوں کے لیے گھبراہٹ میں ہوں گے، اس شفقت کی وجہ سے جس پر اللہ نے انہیں مخلوق کے لیے پیدا کیا ہے۔ پس وہ اس دن کہیں گے: سلامتی ہو، سلامتی ہو۔ اور اللہ نے حکم دیا ہو گا کہ اپنی محفوظ مخلوق کے لیے نور کے منبر نصب کیے جائیں، جو میدان میں ان کے مقامات کے مطابق مختلف ہوں گے، پس وہ ان پر امن و سکون سے بیٹھیں گے اور انہیں بشارت دی جائے گی، اور یہ سب رب تعالیٰ کے آنے سے پہلے ہو گا۔ پس جب لوگ جہنم کے خوف سے اور اس دن کی عظیم ہولناکی دیکھ کر بھاگیں گے، تو وہ فرشتوں کو صفوں میں پائیں گے جن سے وہ آگے نہیں بڑھ سکیں گے۔ پس فرشتے، جو الحق سبحانہ و تعالیٰ کے بادشاہی کے نگران ہیں، انہیں محشر کی طرف دھکیلیں گے، اور ان کے انبیاء انہیں پکاریں گے: واپس آؤ، واپس آؤ۔ پس وہ ایک دوسرے کو پکاریں گے، اور یہی اللہ تعالیٰ کا قول ہے جو رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: إِنِّي أَخافُ عَلَيْكُمْ يَوْمَ التَّنادِ يَوْمَ تُوَلُّونَ مُدْبِرِينَ ما لَكُمْ من الله من عاصِمٍ (میں تم پر پکار کے دن سے ڈرتا ہوں، جس دن تم پیٹھ پھیر کر بھاگو گے، تمہارے لیے اللہ سے کوئی بچانے والا نہ ہو گا)۔ اور رسول کہیں گے: اے اللہ! سلامتی دے، سلامتی دے۔ اور وہ اپنی امتوں کے لیے شدید خوف زدہ ہوں گے، اور امتیں اپنی جانوں کے لیے خوف زدہ ہوں گی۔ اور وہ پاکیزہ اور محفوظ لوگ جن کے باطن گمراہ کن شبہات سے اور جن کے ظاہر شرعی خلاف ورزیوں سے آلودہ نہیں ہوئے، وہ امن میں ہوں گے، اور انبیاء ان پر رشک کریں گے، کیونکہ انبیاء اپنی امتوں کے خوف کی وجہ سے جس حال میں ہوں گے، یہ لوگ اس سے امن میں ہوں گے۔\n\n### [موقف کے دن الحق کی تین پکاریں]\n\nپس اللہ کی طرف سے ایک پکارنے والا پکارے گا جسے میدان میں موجود تمام لوگ سنیں گے، مجھے نہیں معلوم کہ یہ الحق سبحانہ و تعالیٰ کی اپنی پکار ہو گی یا اس کے حکم سے پکار ہو گی، وہ اس پکار میں کہے گا: اے اہل موقف! آج تم جان لو گے کہ کرم والے کون ہیں۔ کیونکہ اس نے ہمیں تعلیم دیتے ہوئے اور متنبہ کرتے ہوئے فرمایا تھا: يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ (اے انسان! تجھے تیرے رب کریم کے بارے میں کس چیز نے دھوکے میں ڈالا؟) تاکہ وہ کہے کہ تیرے کرم نے۔ اور میں نے اپنے شیخ الشنختہ کو ایک دن روتے ہوئے سنا، وہ کہہ رہے تھے: اے لوگو! اس کے کرم کے ساتھ ایسا نہ کرو۔ اس نے ہمیں نکالا جبکہ ہم کچھ نہ تھے، اور ہمیں وہ سکھایا جو ہم نہیں جانتے تھے، اور اس نے ابتداءً ہم پر اپنے، اپنی کتابوں اور اپنے رسولوں پر ایمان لانے کا احسان کیا، جبکہ ہم عقل نہیں رکھتے تھے۔ کیا تم سمجھتے ہو کہ جب ہم نے عقل حاصل کر لی اور ایمان لے آئے تو وہ ہمیں عذاب دے گا؟ اس کے کرم سے یہ بعید ہے۔ پس اس بات نے مجھے خوشی کا رونا رلایا اور حاضرین بھی رو پڑے۔ پھر ہم واپس آتے ہیں اور کہتے ہیں: پس الحق اس پکار میں فرمائے گا: کہاں ہیں وہ لوگ جن کے پہلو بستروں سے دور رہتے تھے (تَتَجافى‏ جُنُوبُهُمْ عَنِ الْمَضاجِعِ)؟ وہ اپنے رب کو خوف اور طمع سے پکارتے تھے اور جو کچھ ہم نے انہیں دیا تھا وہ خرچ کرتے تھے (يَدْعُونَ رَبَّهُمْ خَوْفاً وطَمَعاً ومِمَّا رَزَقْناهُمْ يُنْفِقُونَ)۔ پس انہیں جنت کی طرف لایا جائے گا۔ پھر وہ الحق کی طرف سے دوسری پکار سنیں گے، مجھے نہیں معلوم کہ یہ الحق کی اپنی پکار ہو گی یا الحق کے حکم سے پکار ہو گی: کہاں ہیں وہ لوگ جنہیں تجارت اور خرید و فروخت اللہ کے ذکر، نماز قائم کرنے اور زکوٰۃ ادا کرنے سے غافل نہیں کرتی تھی (لا تُلْهِيهِمْ تِجارَةٌ ولا بَيْعٌ عَنْ ذِكْرِ الله وإِقامِ الصَّلاةِ وإِيتاءِ الزَّكاةِ)؟ وہ اس دن سے ڈرتے تھے جس میں دل اور آنکھیں الٹ جائیں گی (يَخافُونَ يَوْماً تَتَقَلَّبُ فِيهِ الْقُلُوبُ والْأَبْصارُ)، تاکہ اللہ انہیں ان کے بہترین اعمال کا بدلہ دے اور اپنے فضل سے مزید عطا کرے (لِيَجْزِيَهُمُ الله أَحْسَنَ ما عَمِلُوا ويَزِيدَهُمْ من فَضْلِهِ)۔ اور یہ زیادتی، جیسا کہ ہم نے کہا، جنات الاختصاص (خاص جنتوں) میں سے ہے۔ پس انہیں جنت کی طرف جانے کا حکم دیا جائے گا۔ پھر وہ تیسری پکار سنیں گے، مجھے نہیں معلوم کہ یہ الحق کی اپنی پکار ہو گی یا الحق کے حکم سے پکار ہو گی: اے اہل موقف! آج تم جان لو گے کہ کرم والے کون ہیں۔ کہاں ہیں وہ لوگ جنہوں نے اس عہد کو سچ کر دکھایا جو انہوں نے اللہ سے کیا تھا (صَدَقُوا ما عاهَدُوا الله عَلَيْهِ)، تاکہ اللہ سچوں کو ان کی سچائی کا بدلہ دے (لِيَجْزِيَ الله الصَّادِقِينَ بِصِدْقِهِمْ)۔ پس انہیں جنت کی طرف جانے کا حکم دیا جائے گا۔\n\n### [آگ سے نکلنے والی گردن اور موقف کے دن اس کی تین پکاریں]\n\nاس پکار کے بعد جہنم سے ایک گردن (عنق) نکلے گی، جب وہ مخلوق پر جھانکے گی تو اس کی دو آنکھیں اور ایک فصیح زبان ہو گی، وہ کہے گی: اے اہل موقف! مجھے تم میں سے تین کے لیے مقرر کیا گیا ہے۔ جیسا کہ پہلی پکار تین بار تھی، تین گروہوں کے لیے جو اہل سعادت میں سے تھے، اور یہ سب حساب سے پہلے ہو گا، اور لوگ کھڑے ہوں گے، پسینہ انہیں لگام ڈال چکا ہو گا، خوف شدید ہو گا، اور دل ہولناکی کی وجہ سے پھٹ رہے ہوں گے۔ پس جہنم سے نکلنے والی وہ گردن ان پر جھانک کر کہے گی: مجھے ہر جبار عنید (سرکش ظالم) کے لیے مقرر کیا گیا ہے۔ پس وہ انہیں صفوں کے درمیان سے چن لے گی جیسے پرندہ تل کے دانے چنتا ہے۔ جب وہ ان میں سے کسی کو میدان میں نہیں چھوڑے گی، تو دوسری پکار لگائے گی: اے اہل موقف! مجھے اس کے لیے مقرر کیا گیا ہے جس نے اللہ اور اس کے رسول کو تکلیف دی۔ پس وہ انہیں مخلوق کے درمیان سے چن لے گی جیسے پرندہ تل کے دانے چنتا ہے۔ جب ان میں سے کوئی باقی نہیں رہے گا، تو تیسری بار پکارے گی: اے اہل موقف! مجھے اس کے لیے مقرر کیا گیا ہے جو اللہ کی تخلیق کی طرح تخلیق کرنے چلا تھا۔ پس وہ تصویریں بنانے والوں کو چن لے گی، اور وہ وہ لوگ ہیں جو گرجوں میں تصویریں بناتے تھے تاکہ ان کی عبادت کی جائے، اور وہ جو بت تراشتے تھے، اور یہی اللہ تعالیٰ کا قول ہے: أَ تَعْبُدُونَ ما تَنْحِتُونَ (کیا تم ان چیزوں کی عبادت کرتے ہو جنہیں تم خود تراشتے ہو؟) پس وہ ان کے لیے لکڑیوں اور پتھروں کو تراشتے تھے تاکہ وہ اللہ کے سوا ان کی عبادت کریں۔ پس یہ ہیں مصور (تصویریں بنانے والے)، وہ انہیں صفوں کے درمیان سے چن لے گی جیسے پرندہ تل کے دانے چنتا ہے۔ جب اللہ ان سب کو لے لے گا، تو باقی لوگ رہ جائیں گے، اور ان میں وہ مصور بھی ہوں گے جن کا مقصد اپنی تصویروں سے وہ نہیں تھا جو ان لوگوں کا تھا کہ ان کی عبادت کی جائے، یہاں تک کہ ان سے سوال کیا جائے گا کہ وہ ان میں روح پھونکیں تاکہ وہ زندہ ہو جائیں، اور وہ پھونکنے والے نہیں ہوں گے، جیسا کہ خبر میں مصوروں کے بارے میں آیا ہے۔ پس وہ کھڑے رہیں گے جب تک اللہ چاہے گا، انتظار کرتے ہوئے کہ اللہ ان کے ساتھ کیا کرتا ہے، اور پسینہ انہیں لگام ڈال چکا ہو گا۔\n\n### [قیامت کے پچاس مقامات]\n\nپس ہمیں ہمارے شیخ القصار نے مکہ میں، سن پانچ سو ننانوے میں، کعبہ معظمہ کے رکن یمانی کے سامنے، جو یونس بن یحییٰ بن الحسین بن ابی البرکات الہاشمی العباسی تھے، اپنی زبان سے بیان کیا، اور میں سن رہا تھا، انہوں نے کہا: ہمیں ابو الفضل محمد بن عمر بن یوسف الارموی نے بیان کیا، انہوں نے کہا: ہمیں ابو بکر محمد بن علی بن محمد بن موسیٰ بن جعفر المعروف بابن الخیاط المغربی نے بیان کیا، انہوں نے کہا: ابو سہل محمود بن عمر بن اسحاق العکبری پر پڑھا گیا اور میں سن رہا تھا، ان سے کہا گیا: کیا آپ کو رضی اللہ عنکم ابو بکر محمد بن الحسن النقاش نے بیان کیا؟ انہوں نے کہا: ہاں، ہمیں ابو بکر نے بیان کیا، انہوں نے کہا: ہمیں ابو بکر احمد بن الحسین بن علی الطبری المروزی نے بیان کیا، انہوں نے کہا: ہمیں محمد بن حمید الرازی ابو عبد اللہ نے بیان کیا، انہوں نے کہا: ہمیں سلمہ بن صالح نے بیان کیا، انہوں نے کہا: ہمیں القاسم بن الحکم نے سلام الطویل سے، انہوں نے غیاث بن المسیب سے، انہوں نے عبد الرحمن بن غنم اور زید بن وہب سے، انہوں نے عبد اللہ بن مسعود سے روایت کی، انہوں نے کہا: میں علی بن ابی طالب رضی اللہ عنہ کے پاس بیٹھا تھا، اور ان کے پاس عبد اللہ بن عباس رضی اللہ عنہما اور ان کے گرد رسول اللہ صلی اللہ علیہ وسلم کے کئی صحابہ تھے۔ پس علی رضی اللہ عنہ نے فرمایا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"قیامت میں پچاس موقف (مقامات) ہوں گے، ان میں سے ہر موقف ایک ہزار سال کا ہو گا۔ پس پہلا موقف جب لوگ اپنی قبروں سے نکلیں گے، تو وہ اپنی قبروں کے دروازوں پر ایک ہزار سال تک ننگے، پیاسے، بھوکے، پیاسے کھڑے رہیں گے۔ پس جو شخص اپنی قبر سے اپنے رب پر ایمان لاتے ہوئے، اپنے نبی پر ایمان لاتے ہوئے، اپنی جنت اور دوزخ پر ایمان لاتے ہوئے، بعث (دوبارہ اٹھائے جانے) اور قیامت پر ایمان لاتے ہوئے، قضا و قدر کے خیر و شر پر ایمان لاتے ہوئے، اور جو کچھ محمد صلی اللہ علیہ وسلم اپنے رب کی طرف سے لائے اس کی تصدیق کرتے ہوئے نکلا، وہ نجات پا گیا، کامیاب ہو گیا، غنیمت حاصل کر لی اور سعادت مند ہو گیا۔ اور جس نے ان میں سے کسی چیز میں شک کیا، وہ ایک ہزار سال تک اپنی بھوک، پیاس، غم اور کرب میں رہے گا، یہاں تک کہ اللہ اس کے بارے میں جو چاہے فیصلہ کرے۔\"\n\n### [دس حساب کے خیموں کی طرف ہانکنا]\n\nپھر انہیں اس مقام سے محشر کی طرف ہانکا جائے گا، پس وہ ایک ہزار سال تک اپنے پیروں پر کھڑے رہیں گے، آگ کے خیموں میں، سورج کی گرمی میں، اور آگ ان کے دائیں، بائیں، آگے اور پیچھے سے ہو گی، اور سورج ان کے سروں کے اوپر ہو گا، اور عرش کے سائے کے سوا کوئی سایہ نہیں ہو گا۔ پس جو شخص اللہ تبارک و تعالیٰ سے اخلاص کی گواہی دیتے ہوئے، اس کے نبی صلی اللہ علیہ وسلم کا اقرار کرتے ہوئے، شرک اور جادو سے بری ہوتے ہوئے، مسلمانوں کا خون بہانے سے بری ہوتے ہوئے، اللہ اور اس کے رسول کے لیے خیر خواہ ہوتے ہوئے، اللہ اور اس کے رسول کی اطاعت کرنے والوں سے محبت کرتے ہوئے، اور اللہ اور اس کے رسول کی نافرمانی کرنے والوں سے بغض رکھتے ہوئے ملا، وہ عرش رحمن کے سائے تلے سایہ حاصل کرے گا اور اپنے غم سے نجات پا جائے گا۔ اور جو اس سے ہٹ گیا اور ان گناہوں میں سے کسی ایک کلمے سے بھی پڑ گیا، یا اس کا دل بدل گیا، یا اس نے اپنے دین کی کسی چیز میں شک کیا، وہ ایک ہزار سال تک گرمی، پریشانی اور عذاب میں رہے گا، یہاں تک کہ اللہ اس کے بارے میں جو چاہے فیصلہ کرے۔\n\n### [نور اور تاریکی کی طرف ہانکنا]\n\nپھر مخلوق کو نور اور تاریکی کی طرف ہانکا جائے گا، پس وہ اس تاریکی میں ایک ہزار سال تک قیام کریں گے۔ پس جو شخص اللہ تبارک و تعالیٰ سے اس حال میں ملا کہ اس نے اس کے ساتھ کسی چیز کو شریک نہیں کیا، اور اس کے دل میں نفاق کی کوئی چیز داخل نہیں ہوئی، اور اس نے اپنے دین کے کسی معاملے میں شک نہیں کیا، اور اس نے اپنے نفس سے حق دیا، اور حق بات کہی، اور لوگوں کے ساتھ اپنے نفس سے انصاف کیا، اور خفیہ اور اعلانیہ طور پر اللہ کی اطاعت کی، اور اللہ کے فیصلے پر راضی رہا، اور جو کچھ اللہ نے اسے دیا اس پر قناعت کی، وہ پلک جھپکنے میں تاریکی سے نور کی طرف نکل جائے گا، اس کا چہرہ روشن ہو گا، اور وہ تمام غموں سے نجات پا چکا ہو گا۔ اور جس نے ان میں سے کسی چیز میں خلاف ورزی کی، وہ ایک ہزار سال تک غم اور پریشانی میں رہے گا، پھر اس سے نکلے گا، اس کا چہرہ سیاہ ہو گا، اور وہ اللہ کی مشیت میں ہو گا، وہ اس کے ساتھ جو چاہے گا کرے گا۔\n\n### [دس حساب کے خیموں کی طرف ہانکنا]\n\nپھر مخلوق کو حساب کے خیموں کی طرف ہانکا جائے گا، اور وہ دس خیمے ہیں، وہ ان میں سے ہر خیمے میں ایک ہزار سال تک کھڑے رہیں گے۔ پس ابن آدم سے پہلے خیمے میں محارم (حرام چیزوں) کے بارے میں سوال کیا جائے گا۔ پس اگر وہ ان میں سے کسی میں نہیں پڑا ہو گا، تو دوسرے خیمے کی طرف گزر جائے گا، پس اس سے خواہشات (الأهواء) کے بارے میں سوال کیا جائے گا، پس اگر وہ ان سے بچ گیا ہو گا، تو تیسرے خیمے کی طرف گزر جائے گا، پس اس سے والدین کی نافرمانی (عقوق الوالدين) کے بارے میں سوال کیا جائے گا، پس اگر وہ نافرمان نہیں ہو گا، تو چوتھے خیمے کی طرف گزر جائے گا، پس اس سے ان لوگوں کے حقوق کے بارے میں سوال کیا جائے گا جن کے معاملات اللہ نے اس کے سپرد کیے تھے، اور انہیں قرآن کی تعلیم دینے اور ان کے دین کے معاملے اور ان کی تربیت کے بارے میں سوال کیا جائے گا، پس اگر اس نے یہ سب کیا ہو گا، تو پانچویں خیمے کی طرف گزر جائے گا، پس اس سے اس کے غلاموں کے بارے میں سوال کیا جائے گا، پس اگر وہ ان کے ساتھ احسان کرنے والا ہو گا، تو چھٹے خیمے کی طرف گزر جائے گا، پس اس سے اس کے رشتہ داروں کے حق کے بارے میں سوال کیا جائے گا، پس اگر اس نے ان کے حقوق ادا کیے ہوں گے، تو ساتویں خیمے کی طرف گزر جائے گا، پس اس سے صلہ رحمی (صلة الرحم) کے بارے میں سوال کیا جائے گا، پس اگر وہ صلہ رحمی کرنے والا ہو گا، تو آٹھویں خیمے کی طرف گزر جائے گا، پس اس سے حسد کے بارے میں سوال کیا جائے گا، پس اگر وہ حسد کرنے والا نہیں ہو گا، تو نویں خیمے کی طرف گزر جائے گا، پس اس سے مکر (دھوکہ) کے بارے میں سوال کیا جائے گا، پس اگر اس نے کسی کے ساتھ مکر نہیں کیا ہو گا، تو دسویں خیمے کی طرف گزر جائے گا، پس اس سے فریب (الخديعة) کے بارے میں سوال کیا جائے گا، پس اگر اس نے کسی کو فریب نہیں دیا ہو گا، تو وہ نجات پا جائے گا اور اللہ تعالیٰ کے عرش کے سائے میں اترے گا، اس کی آنکھیں ٹھنڈی ہوں گی، اس کا دل خوش ہو گا، اور اس کا منہ ہنستا ہو گا۔ اور اگر وہ ان خصلتوں میں سے کسی میں پڑ گیا ہو گا، تو وہ ان میں سے ہر موقف میں ایک ہزار سال تک بھوکا، پیاسا، غمگین، پریشان اور فکر مند رہے گا، اور کسی شفاعت کرنے والے کی شفاعت اسے فائدہ نہیں دے گی۔\n\n### [محشر اور اس کے پندرہ مقامات]\n\nپھر انہیں ان کی کتابیں دائیں اور بائیں ہاتھ میں لینے کے لیے جمع کیا جائے گا، پس انہیں اس وقت پندرہ مقامات پر روکا جائے گا، ان میں سے ہر موقف ایک ہزار سال کا ہو گا۔ پس ان سے پہلے موقف میں صدقات اور ان کے مالوں میں اللہ کے فرض کردہ حقوق کے بارے میں سوال کیا جائے گا، پس جس نے انہیں مکمل طور پر ادا کیا ہو گا، وہ دوسرے موقف کی طرف گزر جائے گا، پس اس سے حق بات کہنے اور لوگوں کو معاف کرنے کے بارے میں سوال کیا جائے گا، پس جس نے معاف کیا ہو گا، اللہ اسے معاف کر دے گا اور وہ تیسرے موقف کی طرف گزر جائے گا، پس اس سے نیکی کا حکم دینے (الأمر بالمعروف) کے بارے میں سوال کیا جائے گا، پس اگر وہ نیکی کا حکم دینے والا ہو گا، تو چوتھے موقف کی طرف گزر جائے گا، پس اس سے برائی سے روکنے (النهي عن المنكر) کے بارے میں سوال کیا جائے گا، پس اگر وہ برائی سے روکنے والا ہو گا، تو پانچویں موقف کی طرف گزر جائے گا، پس اس سے حسن خلق (اچھے اخلاق) کے بارے میں سوال کیا جائے گا، پس اگر وہ اچھے اخلاق والا ہو گا، تو چھٹے موقف کی طرف گزر جائے گا، پس اس سے اللہ کے لیے محبت اور اللہ کے لیے بغض کے بارے میں سوال کیا جائے گا، پس اگر وہ اللہ کے لیے محبت کرنے والا اور اللہ کے لیے بغض رکھنے والا ہو گا، تو ساتویں موقف کی طرف گزر جائے گا، پس اس سے حرام مال کے بارے میں سوال کیا جائے گا، پس اگر اس نے کچھ نہیں لیا ہو گا، تو آٹھویں موقف کی طرف گزر جائے گا، پس اس سے شراب پینے کے بارے میں سوال کیا جائے گا، پس اگر اس نے شراب نہیں پی ہو گی، تو نویں موقف کی طرف گزر جائے گا، پس اس سے حرام شرمگاہوں کے بارے میں سوال کیا جائے گا، پس اگر وہ ان کے پاس نہیں گیا ہو گا، تو دسویں موقف کی طرف گزر جائے گا، پس اس سے جھوٹی بات (قول الزور) کے بارے میں سوال کیا جائے گا، پس اگر اس نے وہ نہیں کہی ہو گی، تو گیارہویں موقف کی طرف گزر جائے گا، پس اس سے جھوٹی قسموں کے بارے میں سوال کیا جائے گا، پس اگر اس نے وہ نہیں کھائی ہوں گی، تو بارہویں موقف کی طرف گزر جائے گا، پس اس سے سود کھانے کے بارے میں سوال کیا جائے گا، پس اگر اس نے سود نہیں کھایا ہو گا، تو تیرہویں موقف کی طرف گزر جائے گا، پس اس سے پاکدامن عورتوں پر تہمت لگانے (قذف المحصنات) کے بارے میں سوال کیا جائے گا، پس اگر اس نے پاکدامن عورتوں پر تہمت نہیں لگائی ہو گی یا کسی پر بہتان نہیں لگایا ہو گا، تو چودہویں موقف کی طرف گزر جائے گا، پس اس سے جھوٹی گواہی کے بارے میں سوال کیا جائے گا، پس اگر اس نے وہ نہیں دی ہو گی، تو پندرہویں موقف کی طرف گزر جائے گا، پس اس سے بہتان (بہتان) کے بارے میں سوال کیا جائے گا، پس اگر اس نے کسی مسلمان پر بہتان نہیں لگایا ہو گا، تو وہ لواء الحمد (حمد کے جھنڈے) کے نیچے اترے گا اور اس کی کتاب اس کے دائیں ہاتھ میں دی جائے گی، اور وہ کتاب کے غم سے نجات پا جائے گا، اور وہ اس کے لیے ہو گی، اور اس کا حساب آسان حساب (حِساباً يَسِيراً) ہو گا۔ اور اگر وہ ان گناہوں میں سے کسی میں پڑ گیا ہو گا اور دنیا سے توبہ کیے بغیر نکلا ہو گا، تو وہ ان پندرہ مقامات میں سے ہر ایک میں ایک ہزار سال تک غم، ہول، پریشانی، دکھ، بھوک اور پیاس میں رہے گا، یہاں تک کہ اللہ عز و جل اس کے بارے میں جو چاہے فیصلہ کرے۔\n\n### [کتابوں کا دائیں اور بائیں ہاتھ میں لیا جانا اور ان کا پڑھا جانا]\n\nپھر لوگوں کو ان کی کتابیں پڑھنے کے لیے ایک ہزار سال تک کھڑا کیا جائے گا۔ پس جو شخص سخی ہو گا اور اس نے اپنے مال کو اپنی فقر، حاجت اور ضرورت کے دن کے لیے آگے بھیجا ہو گا، وہ اپنی کتاب پڑھے گا اور اس پر اس کا پڑھنا آسان کر دیا جائے گا، اور اسے جنت کے لباس پہنائے جائیں گے، اور جنت کے تاج پہنائے جائیں گے، اور وہ عرش رحمن کے سائے تلے امن و اطمینان سے بیٹھے گا۔ اور اگر وہ بخیل ہو گا اور اس نے اپنے مال کو اپنی فقر اور ضرورت کے دن کے لیے آگے نہیں بھیجا ہو گا، تو اسے اس کی کتاب اس کے بائیں ہاتھ میں دی جائے گی (كِتابَهُ بِشِمالِهِ)، اور اس کے لیے آگ کے ٹکڑے کاٹے جائیں گے، وہ ایک ہزار سال تک مخلوق کے سروں پر بھوک، پیاس، ننگے پن، پریشانی، غم اور رسوائی میں کھڑا رہے گا، یہاں تک کہ اللہ عز و جل اس کے بارے میں جو چاہے فیصلہ کرے۔\n\n### [میزان کی طرف حشر]\n\nپھر لوگوں کو میزان (ترازو) کی طرف جمع کیا جائے گا، پس وہ میزان کے پاس ایک ہزار سال تک کھڑے رہیں گے۔ پس جس کا میزان اس کی نیکیوں سے بھاری ہو گا، وہ پلک جھپکنے میں کامیاب ہو جائے گا اور نجات پا جائے گا۔ اور جس کا میزان اس کی نیکیوں سے ہلکا ہو گا اور اس کی برائیاں بھاری ہوں گی، وہ میزان کے پاس ایک ہزار سال تک غم، پریشانی، دکھ، عذاب، بھوک اور پیاس میں روکا رہے گا، یہاں تک کہ اللہ اس کے بارے میں جو چاہے فیصلہ کرے۔\n\n### [اللہ کے سامنے بارہ مقامات پر کھڑا ہونا]\n\nپھر مخلوق کو اللہ کے سامنے کھڑا ہونے کے لیے بلایا جائے گا، بارہ مقامات پر، ان میں سے ہر موقف ایک ہزار سال کی مقدار کا ہو گا۔ پس پہلے موقف میں اس سے گردنیں آزاد کرنے (عتق الرقاب) کے بارے میں سوال کیا جائے گا، پس اگر اس نے کوئی گردن آزاد کی ہو گی، تو اللہ اس کی گردن کو آگ سے آزاد کر دے گا اور وہ دوسرے موقف کی طرف گزر جائے گا، پس اس سے قرآن اور اس کے حق اور اس کی تلاوت کے بارے میں سوال کیا جائے گا، پس اگر وہ اسے مکمل طور پر لایا ہو گا، تو تیسرے موقف کی طرف گزر جائے گا، پس اس سے جہاد کے بارے میں سوال کیا جائے گا، پس اگر اس نے اللہ کی راہ میں اخلاص کے ساتھ جہاد کیا ہو گا، تو چوتھے موقف کی طرف گزر جائے گا، پس اس سے غیبت (پیٹھ پیچھے برائی) کے بارے میں سوال کیا جائے گا، پس اگر اس نے غیبت نہیں کی ہو گی، تو پانچویں موقف کی طرف گزر جائے گا، پس اس سے چغلی (نمیمہ) کے بارے میں سوال کیا جائے گا، پس اگر وہ چغل خور نہیں ہو گا، تو چھٹے موقف کی طرف گزر جائے گا، پس اس سے جھوٹ کے بارے میں سوال کیا جائے گا، پس اگر وہ جھوٹا نہیں ہو گا، تو ساتویں موقف کی طرف گزر جائے گا، پس اس سے علم طلب کرنے کے بارے میں سوال کیا جائے گا، پس اگر اس نے علم طلب کیا ہو گا اور اس پر عمل کیا ہو گا، تو آٹھویں موقف کی طرف گزر جائے گا، پس اس سے عجب (خود پسندی) کے بارے میں سوال کیا جائے گا، پس اگر وہ اپنے دین و دنیا میں یا اپنے کسی عمل میں خود پسند نہیں ہو گا، تو نویں موقف کی طرف گزر جائے گا، پس اس سے تکبر (غرور) کے بارے میں سوال کیا جائے گا، پس اگر اس نے کسی پر تکبر نہیں کیا ہو گا، تو دسویں موقف کی طرف گزر جائے گا، پس اس سے اللہ کی رحمت سے مایوسی (قنوط) کے بارے میں سوال کیا جائے گا، پس اگر وہ اللہ کی رحمت سے مایوس نہیں ہوا ہو گا، تو گیارہویں موقف کی طرف گزر جائے گا، پس اس سے اللہ کی خفیہ تدبیر (مکر اللہ) سے بے خوفی کے بارے میں سوال کیا جائے گا، پس اگر وہ اللہ کی خفیہ تدبیر سے بے خوف نہیں ہوا ہو گا، تو بارہویں موقف کی طرف گزر جائے گا، پس اس سے اپنے پڑوسی کے حق کے بارے میں سوال کیا جائے گا، پس اگر اس نے اپنے پڑوسی کا حق ادا کیا ہو گا، تو اسے اللہ تعالیٰ کے سامنے کھڑا کیا جائے گا، اس کی آنکھیں ٹھنڈی ہوں گی، اس کا دل خوش ہو گا، اس کا چہرہ روشن ہو گا، وہ لباس پہنے ہوئے، ہنستا ہوا، خوش ہو گا۔ پس اس کا رب اسے خوش آمدید کہے گا اور اسے اپنی رضا کی بشارت دے گا، پس وہ اس وقت ایسی خوشی محسوس کرے گا جسے اللہ کے سوا کوئی نہیں جانتا۔ اور اگر وہ ان میں سے کسی ایک کو بھی مکمل طور پر نہیں لایا ہو گا اور توبہ کیے بغیر مر گیا ہو گا، تو وہ ہر موقف پر ایک ہزار سال تک روکا رہے گا، یہاں تک کہ اللہ عز و جل اس کے بارے میں جو چاہے فیصلہ کرے۔\n\n### [پل صراط جس پر جہنم کے اوپر پل بنائے گئے ہیں]\n\nپھر مخلوق کو صراط (پل صراط) کی طرف جانے کا حکم دیا جائے گا، پس وہ صراط پر پہنچیں گے، اور اس پر جہنم کے اوپر پل بنائے گئے ہوں گے، جو بال سے زیادہ باریک اور تلوار سے زیادہ تیز ہوں گے، اور پل جہنم میں چالیس ہزار سال کی مقدار تک غائب ہوں گے، اور جہنم کے شعلے اس کے پہلو میں بھڑک رہے ہوں گے، اور اس پر کانٹے، ہک اور خطاطیف (کانٹے دار آلات) ہوں گے۔ اور وہ سات پل ہوں گے، تمام بندے ان پر جمع کیے جائیں گے، اور ان میں سے ہر پل پر ایک گھاٹی ہو گی جس کی مسافت تین ہزار سال ہو گی، ایک ہزار سال چڑھائی، ایک ہزار سال ہمواری، اور ایک ہزار سال اترائی۔ اور یہی اللہ عز و جل کا قول ہے: إِنَّ رَبَّكَ لَبِالْمِرْصادِ (بے شک تیرا رب گھات میں ہے)، یعنی ان پلوں پر۔ اور فرشتے مخلوق کو ان پر گھات لگائے ہوئے ہوں گے، تاکہ بندے سے اللہ پر ایمان کے بارے میں سوال کیا جائے، پس اگر وہ اس پر ایمان لانے والا، مخلص، جس میں کوئی شک یا کجی نہ ہو، لایا ہو گا، تو دوسرے پل کی طرف گزر جائے گا، پس اس سے نماز کے بارے میں سوال کیا جائے گا، پس اگر وہ اسے مکمل طور پر لایا ہو گا، تو تیسرے پل کی طرف گزر جائے گا، پس اس سے زکوٰۃ کے بارے میں سوال کیا جائے گا، پس اگر وہ اسے مکمل طور پر لایا ہو گا، تو چوتھے پل کی طرف گزر جائے گا، پس اس سے روزے کے بارے میں سوال کیا جائے گا، پس اگر وہ اسے مکمل طور پر لایا ہو گا، تو پانچویں پل کی طرف گزر جائے گا، پس اس سے حج اسلام کے بارے میں سوال کیا جائے گا، پس اگر وہ اسے مکمل طور پر لایا ہو گا، تو چھٹے پل کی طرف گزر جائے گا، پس اس سے طہارت (پاکیزگی) کے بارے میں سوال کیا جائے گا، پس اگر وہ اسے مکمل طور پر لایا ہو گا، تو ساتویں پل کی طرف گزر جائے گا، پس اس سے مظالم (حقوق العباد) کے بارے میں سوال کیا جائے گا، پس اگر اس نے کسی پر ظلم نہیں کیا ہو گا، تو جنت کی طرف گزر جائے گا۔ اور اگر اس نے ان میں سے کسی ایک میں بھی کمی کی ہو گی، تو وہ ان میں سے ہر پل پر ایک ہزار سال تک روکا رہے گا، یہاں تک کہ اللہ عز و جل اس کے بارے میں جو چاہے فیصلہ کرے۔ اور حدیث آخر تک ذکر کی گئی۔\n\nاور حدیث کا بقیہ حصہ ان شاء اللہ جنت کے باب میں آئے گا، کیونکہ وہ جنت سے متعلق ہے۔ اور ہم نے برزخ کے باب میں اس دوسری نشأت کا ذکر نہیں کیا جس میں انسان کو جمع کیا جائے گا، کیونکہ وہ ایک محسوس نشأت ہے، خیالی نہیں، اور قیامت ایک یقینی، موجود، حسی معاملہ ہے، جیسا کہ انسان دنیا میں ہے۔ اس لیے ہم نے اس کا ذکر اس باب تک مؤخر کر دیا۔\n\n### (وصل) [حشر اور نشر کے بارے میں]\n\n### [مؤمنوں میں اعادہ کے بارے میں اختلاف]\n\nجان لو کہ اعادہ (دوبارہ پیدا کرنے) کے بارے میں مؤمنوں میں اختلاف ہوا ہے جو اجسام کے حشر کے قائل ہیں۔ اور ہم نے ان لوگوں کے مذہب کا ذکر نہیں کیا جو اعادہ اور دوسری نشأت کو غیر محسوس عقلی امور پر محمول کرتے ہیں، کیونکہ یہ اس کے خلاف ہے جو حقیقت میں ہے۔ یہ اس بات سے لاعلمی ہے کہ وہاں دو نشأتیں ہیں: اجسام کی نشأت اور ارواح کی نشأت، اور یہی معنوی نشأت ہے۔ پس انہوں نے معنوی کو تو ثابت کیا لیکن محسوس کو ثابت نہیں کیا۔ اور ہم اس بات کے قائل ہیں جو اس مخالف نے روحانی معنوی نشأت کے اثبات میں کہی ہے، نہ کہ اس کے خلاف جو اس نے کہا۔ اور انسان کی موت ہی اس کی قیامت صغریٰ (چھوٹی قیامت) ہے۔\n\nکیونکہ نبی صلی اللہ علیہ وسلم فرماتے ہیں:\n> من مات فقد قامت قيامته (جو مر گیا اس کی قیامت قائم ہو گئی)۔\n\nاور حشر (جمع کرنا) جزوی نفوس کو کلی نفس کی طرف جمع کرنا ہے۔ یہ سب میں کہتا ہوں جیسا کہ مخالف کہتا ہے، اور یہاں تک اس کی قیامت کے بارے میں بات ختم ہوتی ہے۔ اور اس میں بھی اختلاف ہے جو تناسخ (آواگون) کا قائل ہے اور جو اس کا قائل نہیں ہے، اور وہ سب عقلمند اور صاحب نظر ہیں۔ اور وہ اس سب میں کتاب کی آیات اور سنت کی خبروں کے ظواہر سے دلیل پکڑتے ہیں۔ اگر ہم انہیں بیان کریں اور ان پر بات کریں تو باب ان کے ساتھ ان کے قول کی تحقیق میں الجھنے سے طویل ہو جائے گا۔ اور ان میں سے جس نے بھی اس میں کوئی مسلک اختیار کیا ہے، اس کے لیے ایک صحیح حق کا پہلو ہے، اور اس کا قائل شارع کی مراد کے کچھ حصے کو سمجھا ہے، اور اسے اس علم کی کمی ہے جو دوسرے نے محسوس اجسام میں محسوس حشر، محسوس میزان، محسوس صراط، اور محسوس آگ اور جنت کے اثبات سے سمجھا ہے۔ یہ سب حق ہے اور قدرت میں عظیم تر ہے۔\n\n### [علم طبیعت اس بات کی نفی نہیں کرتا کہ طبعی اجسام غیر متناہی مدت تک باقی رہیں]\n\nاور علم طبیعت میں طبعی اجسام کا دونوں جہانوں میں غیر متناہی مدت تک باقی رہنا ہے، بلکہ ان کا وجود مسلسل ہے۔ اور لوگوں نے طبیعت کے معاملے میں صرف اتنا ہی جانا ہے جتنا الحق نے انہیں اس میں سے مطلع کیا ہے جو انہیں افلاک اور سات ستاروں کی حرکت کی مدتوں میں ظاہر ہوا ہے۔ اور اسی لیے انہوں نے طبعی عمر کو ایک سو بیس سال مقرر کیا ہے جو اس حکم کا تقاضا تھا۔ پس جب انسان اس مدت سے زیادہ ہو جاتا ہے تو وہ مجہول عمر میں داخل ہو جاتا ہے، اگرچہ وہ طبیعت میں ہی رہتا ہے اور اس سے باہر نہیں نکلتا، لیکن اس کے علم کی طاقت میں نہیں ہے کہ وہ اس کے لیے کوئی مخصوص وقت مقرر کرے۔ پس جس طرح وہ طبعی عمر سے ایک سال یا زیادہ بڑھ گیا، اسی طرح جائز ہے کہ وہ اس سے ہزاروں سال زیادہ ہو جائے، اور جائز ہے کہ اس کی عمر ہمیشہ کے لیے بڑھ جائے۔ اور اگر شریعت نے اس دنیا کی مدت کے ختم ہونے، اور ہر نفس کے موت کا ذائقہ چکھنے، اور اعادہ (دوبارہ پیدا کرنے)، اور آخرت کے گھر، اور اس میں دوسری نشأت میں غیر متناہی قیام کے بارے میں نہ بتایا ہوتا، تو ہم یہ نہ جانتے۔ اور ہم ہر حال میں، موت، قیام، اخروی بعث، دوسری نشأت، اور جنتوں اور نعمتوں، اور آگ اور عذاب سے، محسوس کھانے، محسوس پینے، محسوس نکاح اور محسوس لباس کے ساتھ طبعی طریقے پر باہر نہیں نکلتے۔ پس اللہ کا علم زیادہ وسیع اور کامل ہے، اور عقل اور حس، اور عقول اور محسوسات کے درمیان جمع کرنا قدرت میں عظیم تر اور الٰہی کمال میں مکمل تر ہے، تاکہ اس کے لیے ممکنات کی ہر صنف میں عالم الغیب اور الشہادۃ (غیب اور حاضر) کا حکم جاری رہے، اور ہر صنف میں اسم الظاہر اور الباطن کا حکم ثابت ہو۔\n\n### [معاد (یعنی حشر) جسمانی اور روحانی ہے]\n\nپس اگر تو سمجھ گیا تو تو کامیاب ہو گیا، اور تو جان لے گا کہ وہ علم جس پر انبیاء اور مؤمنین کو الحق کی طرف سے مطلع کیا گیا ہے، اس علم سے زیادہ عام تعلق رکھتا ہے جو صرف عقلی دلائل پر انحصار کرنے والوں کا ہے جو الٰہی فیض (الفيض الإلهي) سے خالی ہیں۔ پس ہر اس شخص کے لیے جو اپنے نفس کا خیر خواہ ہے، بہتر ہے کہ وہ اس کی طرف رجوع کرے جو انبیاء اور رسول لائے ہیں، عقلی اور حسی دونوں پہلوؤں سے، کیونکہ عقل کے پاس کوئی دلیل نہیں ہے جو ان چیزوں کو باطل کر دے جو شرائع لائی ہیں، ان لوگوں کی تاویل پر جو محسوس اور معقول دونوں کو ثابت کرتے ہیں۔ پس امکان کا حکم باقی ہے اور مرجح (ترجیح دینے والا) موجود ہے۔ پس وہ کس چیز سے باطل کرے گا؟ اور کیا خوب کہا ہے کہنے والے نے:\n\n> نجومی اور طبیب دونوں نے گمان کیا *** کہ اجسام دوبارہ نہیں اٹھائے جائیں گے، میں نے کہا: تم دونوں کی طرف\n> اگر تمہارا قول صحیح ہے تو میں نقصان اٹھانے والا نہیں *** اور اگر میرا قول صحیح ہے تو نقصان تم پر ہے\n\nاس کا قول \"نقصان تم پر ہے\" سے مراد یہ ہے کہ انہوں نے ان ظاہری چیزوں پر ایمان نہیں لایا جو رسول ان کے پاس لائے تھے۔ اور اس کا قول \"میں نقصان اٹھانے والا نہیں\" سے مراد یہ ہے کہ میں بھی تمہاری طرح معنوی معقول امور پر ایمان رکھتا ہوں، اور ہم نے تم پر ایک اور چیز کا اضافہ کیا ہے جس پر تم ایمان نہیں لائے۔ اور اس کے کہنے والے نے اپنے قول \"اگر صحیح ہے\" سے شک کا ارادہ نہیں کیا، بلکہ یہ اے مخاطب! تیرے مذہب کے مطابق ہے۔ اور اس طرح کا استعمال کثرت سے ہوتا ہے۔ پس میری اس بات پر غور کر اور اپنے آپ کو ایمان کا پابند کر، تو ان شاء اللہ نفع پائے گا اور سعادت مند ہو گا۔\n\n### [اعادہ (معاد) اور حشر و نشر کی کیفیت]\n\nاور اس کے مقرر ہونے کے بعد، جان لو کہ مؤمنوں کے درمیان جو حس اور محسوس کے قائل ہیں، اختلاف صرف اعادہ کی کیفیت میں ہوا ہے۔ پس ان میں سے بعض اس طرف گئے ہیں کہ اعادہ لوگوں میں اسی طرح ہو گا جیسے اس نے انہیں شروع کیا تھا، نکاح اور تناسل کے ذریعے، اور مٹی سے تخلیق کی ابتداء اور پھونکنے کے ذریعے، جیسا کہ آدم اور حوا کی تخلیق اور تمام بیٹوں کا نکاح اور اجتماع سے لے کر انسانی دنیا کے آخری بچے تک ہوا، اور یہ سب ایک چھوٹے سے وقت اور مختصر مدت میں ہو گا، جیسا کہ الحق تعالیٰ مقدر کرے گا۔ شیخ ابو القاسم ابن قسی نے اپنی کتاب \"خلع النعلین\" میں اللہ تعالیٰ کے قول كَما بَدَأَكُمْ تَعُودُونَ (جیسے اس نے تمہیں شروع کیا، تم لوٹو گے) کے بارے میں یہی گمان کیا ہے۔ پس مجھے نہیں معلوم کہ یہ ان کا مذہب ہے یا انہوں نے اس بات کرنے والے کی وضاحت کا ارادہ کیا ہے، اور وہ خلف اللہ تھے جو یہ بات لائے تھے اور امیوں میں سے تھے۔ اور بعض نے مروی حدیث کے مطابق کہا کہ آسمان منی کی طرح بارش برسائے گا، جس سے زمین گوندھی جائے گی اور اس سے دوسری نشأت پیدا ہو گی۔ اور ہمارے نزدیک اللہ تعالیٰ کا قول كَما بَدَأَكُمْ تَعُودُونَ (جیسے اس نے تمہیں شروع کیا، تم لوٹو گے) اس کے اس قول کی طرح ہے: ولَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولى‏ فَلَوْ لا تَذَكَّرُونَ (اور تم پہلی نشأت کو جان چکے ہو، پس تم کیوں نہیں نصیحت حاصل کرتے؟) اور اس کا قول: كَما بَدَأْنا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْداً عَلَيْنا (جیسے ہم نے پہلی تخلیق شروع کی تھی، ہم اسے دوبارہ لوٹائیں گے، یہ ہم پر وعدہ ہے)۔ اور ہم جانتے ہیں کہ اللہ تعالیٰ نے پہلی نشأت کو بغیر کسی سابقہ مثال کے وجود بخشا، پس اسی طرح دوسری نشأت کو بھی اللہ تعالیٰ بغیر کسی سابقہ مثال کے وجود بخشے گا، باوجود اس کے کہ وہ بلاشبہ محسوس ہو گی۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اہل جنت اور اہل جہنم کی نشأت کی ایسی صفات بیان کی ہیں جو اس دنیاوی نشأت کے خلاف ہیں۔ پس ہم نے جان لیا کہ یہ اس بات کی طرف لوٹتا ہے کہ اس کے لیے کوئی سابقہ مثال نہیں ہو گی جس پر وہ اسے پیدا کرے گا، اور یہ قدرت میں عظیم تر ہے۔ اور اس کا قول وهُوَ أَهْوَنُ عَلَيْهِ (اور وہ اس پر زیادہ آسان ہے) ہمارے قول کو نقصان نہیں پہنچاتا، کیونکہ اگر پہلی نشأت کسی فکر، تدبر اور نظر کی ایجاد سے ہوتی، یہاں تک کہ اس نے ایک چیز کو پیدا کیا، تو اس کا اعادہ اس کے لیے آسان ہوتا کہ وہ ایک اور مخلوق پیدا کرے جو اس کے قریب ہو اور اس سے زیادہ ہو، ایجاد اور حاضر کرنے کے حق میں اس شخص کے لیے جو اپنی فکر سے چیزوں کو حاصل کرتا ہے۔ اور اللہ اس سے پاک اور بہت بلند ہے، وہ وہ ہے جو عالم کو فائدہ دیتا ہے اور خود فائدہ نہیں اٹھاتا، اور اس کے لیے کسی چیز کا علم نیا نہیں ہوتا، بلکہ وہ کلی علم کے ساتھ ان چیزوں کی تفصیل کو جانتا ہے جو غیر متناہی ہیں، پس تفصیل کا علم عین اجمال میں ہے۔ اور اس کی جلالت کے لیے ایسا ہی ہونا چاہیے۔\n\n### [عجب الذنب جس پر انسانی نشأت قائم ہوتی ہے اور وہ بوسیدہ نہیں ہوتا]\n\nپس اللہ دوسری نشأت کو عجب الذنب (عجب الذنب) پر پیدا کرے گا جو اس دنیاوی نشأت سے باقی رہتا ہے، اور وہ اس کی اصل ہے۔ پس اسی پر دوسری نشأت مرکب ہو گی۔ البتہ ابو حامد نے دیکھا کہ حدیث میں مذکور عجب الذنب نفس ہے، اور اسی پر دوسری نشأت پیدا ہو گی۔ اور دوسرے نے کہا، جیسے ابو زید الرقراقی، کہ وہ ایک جوہر فرد ہے جو اس دنیاوی نشأت سے باقی رہتا ہے اور تبدیل نہیں ہوتا، اسی پر دوسری نشأت پیدا ہو گی۔ اور یہ سب ممکن ہے اور اصول میں سے کسی کو نقصان نہیں پہنچاتا، بلکہ یہ سب معقول توجیہات ہیں، اور ہر توجیہ کا مقصود ہونا ممکن ہے۔ اور جو کچھ مجھ پر کشف (الکشف) کے ذریعے ظاہر ہوا ہے جس میں مجھے کوئی شک نہیں، وہ یہ ہے کہ عجب الذنب سے مراد وہ ہے جس پر نشأت قائم ہوتی ہے، اور وہ بوسیدہ نہیں ہوتا (لا يبلى)، یعنی وہ بوسیدگی کو قبول نہیں کرتا۔\n\n### [دو نفخے اور ارواح کے ساتھ برزخی صورتوں کا بھڑک اٹھنا]\n\nپس جب اللہ دوسری نشأت کو پیدا کرے گا، اسے برابر اور درست کرے گا، اگرچہ وہ بعینہٖ وہی جوہر ہوں گے، کیونکہ عدم سے وجود میں آنے والی ذاتیں اپنے وجود کے بعد فنا نہیں ہوتیں، لیکن ان میں صورتیں امتزاجات کے ذریعے مختلف ہوتی ہیں، اور یہ امتزاجات جو ان صورتوں کو دیتے ہیں وہ ایسے عوارض ہیں جو عزیز و علیم کے تقدیر سے ان پر عارض ہوتے ہیں۔ پس جب یہ صورتیں تیار ہو جائیں گی، تو وہ جلی ہوئی گھاس کی طرح ہوں گی، اور یہ ارواح کو قبول کرنے کی تیاری ہے، جیسے گھاس میں موجود ناریت کا بھڑک اٹھنے کو قبول کرنے کی تیاری۔ اور برزخی صورتیں (الصور البرزخية) چراغوں کی طرح ہیں جو ان میں موجود ارواح سے روشن ہیں۔ پس اسرافیل ایک نفخہ پھونکے گا، پس وہ نفخہ ان برزخی صورتوں پر سے گزرے گا اور انہیں بجھا دے گا، اور اس کے بعد والا نفخہ، جو دوسرا ہے، بھڑک اٹھنے کے لیے تیار صورت (دوسری نشأت) کی طرف گزرے گا، پس وہ اپنی ارواح سے بھڑک اٹھے گی، فَإِذا هُمْ قِيامٌ يَنْظُرُونَ (پس اچانک وہ کھڑے ہو کر دیکھ رہے ہوں گے)۔ پس وہ صورتیں زندہ اور بولنے والی کھڑی ہوں گی، اس چیز کے ساتھ جو اللہ انہیں بولنے کا حکم دے گا، پس کوئی الحمد للہ بولنے والا ہو گا، اور کوئی کہے گا: من بَعَثَنا من مَرْقَدِنا (کس نے ہمیں ہماری خواب گاہ سے اٹھایا؟)، اور کوئی کہے گا: پاک ہے وہ جس نے ہمیں مارنے کے بعد زندہ کیا، وإِلَيْهِ النُّشُورُ (اور اسی کی طرف اٹھنا ہے)۔ اور ہر بولنے والا اپنے علم اور اپنے حال کے مطابق بولے گا، اور وہ برزخ میں اپنے حال کو بھول جائے گا اور گمان کرے گا کہ وہ جو کچھ اس میں تھا وہ ایک خواب تھا، جیسا کہ جاگنے والا گمان کرتا ہے، حالانکہ جب وہ مرا اور برزخ کی طرف منتقل ہوا تو وہاں جاگنے والے کی طرح تھا، اور دنیاوی زندگی اس کے لیے خواب کی طرح تھی۔\n\n### [دنیا کا معاملہ خواب میں خواب ہے اور دار آخرت ہی حیوان (حقیقی زندگی) ہے]\n\nاور آخرت میں وہ دنیا اور برزخ کے معاملے کو خواب میں خواب سمجھے گا، اور یہ کہ صحیح بیداری وہی ہے جس پر وہ دار آخرت میں ہے، اور وہ اس حال میں کہے گا کہ انسان دنیا میں خواب میں تھا، پھر موت کے ذریعے برزخ میں منتقل ہوا، پس وہ اس میں اس شخص کی طرح تھا جو خواب میں دیکھتا ہے کہ وہ نیند سے بیدار ہو گیا ہے، پھر اس کے بعد دوسری نشأت میں وہ بیداری ہے جس میں کوئی نیند نہیں اور اہل سعادت کے لیے اس کے بعد کوئی نیند نہیں، لیکن اہل نار کے لیے اس میں راحت ہے جیسا کہ ہم پہلے بیان کر چکے ہیں۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n> الناس نيام فإذا ماتوا انتبهوا (لوگ سوئے ہوئے ہیں، پس جب وہ مرتے ہیں تو جاگ جاتے ہیں)۔\n\nپس دنیا برزخ کے مقابلے میں نیند اور خواب ہے، کیونکہ برزخ الحق کے معاملے کے زیادہ قریب ہے، پس وہ بیداری کا زیادہ حقدار ہے۔ اور برزخ، یوم القیامہ کی دوسری نشأت کے مقابلے میں، خواب ہے۔ پس یہ جان لو۔\n\n### [اولین و آخرین کے لیے شفاعت کبریٰ]\n\nپس جب لوگ کھڑے ہوں گے، اور زمین پھیلا دی جائے گی، اور آسمان پھٹ جائے گا (وانْشَقَّتِ السَّماءُ)، اور ستارے بکھر جائیں گے، اور سورج لپیٹ لیا جائے گا، اور چاند گہن میں چلا جائے گا، اور وحشی جانور جمع کیے جائیں گے، اور سمندر بھڑکا دیے جائیں گے، اور نفوس اپنے اجسام کے ساتھ جوڑے جائیں گے، اور فرشتے اس کے کناروں پر (عَلى‏ أَرْجائِها) یعنی آسمانوں کے کناروں پر اتریں گے، اور ہمارا رب بادلوں کے سائے (ظُلَلٍ من الْغَمامِ) میں آئے گا، اور پکارنے والا پکارے گا: اے اہل سعادت! پس ان میں سے وہ تین گروہ لے لیے جائیں گے جن کا ہم نے ذکر کیا، اور جہنم سے گردن نکلے گی، پس وہ ان تین گروہوں کو پکڑ لے گی جن کا ہم نے ذکر کیا، اور لوگ ہلچل میں ہوں گے، اور گرمی شدید ہو گی، اور پسینہ لوگوں کو لگام ڈال چکا ہو گا، اور معاملہ عظیم ہو گا، اور دہشت ہو گی، فَلا تَسْمَعُ إِلَّا هَمْساً (پس تو ہلکی آواز کے سوا کچھ نہیں سنے گا)، اور جہنم لائی جائے گی، اور لوگوں کا قیام طویل ہو جائے گا، اور وہ نہیں جانیں گے کہ الحق ان کے ساتھ کیا چاہتا ہے۔\n\nپس رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"پس لوگ ایک دوسرے سے کہیں گے: آؤ، ہم اپنے باپ آدم کے پاس چلیں اور ان سے درخواست کریں کہ وہ ہمارے لیے اللہ سے سوال کریں کہ وہ ہمیں اس حال سے راحت دے جس میں ہم ہیں، کیونکہ ہمارا قیام طویل ہو گیا ہے۔ پس وہ آدم کے پاس آئیں گے اور ان سے یہ درخواست کریں گے، تو آدم کہیں گے: آج اللہ نے ایسا غضب کیا ہے کہ اس سے پہلے ایسا غضب نہیں کیا اور نہ اس کے بعد ایسا غضب کرے گا، اور وہ اپنی خطا کا ذکر کریں گے، اور اپنے رب سے سوال کرنے میں شرم محسوس کریں گے۔ پس وہ نوح کے پاس اسی طرح آئیں گے، تو وہ انہیں وہی کہیں گے جو آدم نے کہا، اور وہ اپنی قوم کے خلاف اپنی دعا کا ذکر کریں گے، اور ان کا قول: ولا يَلِدُوا إِلَّا فاجِراً كَفَّاراً (اور وہ صرف فاجر اور کافر ہی پیدا کریں گے)۔ پس ان پر مواخذہ کا مقام ان کا قول ولا يَلِدُوا إِلَّا فاجِراً كَفَّاراً ہے، نہ کہ ان کی دعا کا نفس۔ پھر وہ ابراہیم علیہ السلام کے پاس اسی طرح آئیں گے، اور انہیں وہی کہیں گے جو انہوں نے پہلے والوں سے کہا، تو وہ وہی کہیں گے جو پہلے والوں نے کہا، اور وہ اپنے تین جھوٹوں کا ذکر کریں گے۔ پھر وہ موسیٰ اور عیسیٰ کے پاس آئیں گے، اور ہر رسول سے وہی کہیں گے جو انہوں نے آدم سے کہا، تو وہ انہیں آدم جیسا جواب دیں گے۔ پس وہ محمد صلی اللہ علیہ وسلم کے پاس آئیں گے، اور وہ یوم القیامہ لوگوں کے سردار ہوں گے، پس وہ ان سے وہی کہیں گے جو انہوں نے انبیاء سے کہا، تو محمد صلی اللہ علیہ وسلم کہیں گے: میں اس کے لیے ہوں (أنا لها)، اور یہی وہ مقام محمود (المقام المحمود) ہے جس کا اللہ نے ان سے یوم القیامہ وعدہ کیا ہے۔ پس وہ آئیں گے اور سجدہ کریں گے اور اللہ کی ایسی تعریفیں کریں گے جو اللہ تعالیٰ اس وقت انہیں الہام کرے گا، جن کا علم انہیں اس سے پہلے نہیں تھا۔ پھر وہ اپنے رب سے شفاعت کریں گے کہ وہ مخلوق کے لیے شفاعت کا دروازہ کھول دے، پس اللہ وہ دروازہ کھول دے گا، اور فرشتوں، رسولوں، انبیاء اور مؤمنین کے لیے شفاعت کی اجازت دے گا۔\"\n\nپس اسی وجہ سے وہ یوم القیامہ لوگوں کے سردار ہوں گے، کیونکہ انہوں نے اللہ کے حضور شفاعت کی کہ فرشتے اور رسول شفاعت کریں۔\n\n### [یوم القیامہ لوگوں کے سردار]\n\nاس کے باوجود، انہوں نے صلی اللہ علیہ وسلم نے ادب اختیار کیا اور کہا: \"میں لوگوں کا سردار ہوں\" (أنا سيد الناس)، اور یہ نہیں کہا کہ \"مخلوقات کا سردار\" (سيد الخلائق)، حالانکہ فرشتے بھی اس میں شامل ہیں، اس دن سب پر ان کی سلطنت کے ظاہر ہونے کے باوجود۔ اور یہ اس لیے کہ ان کے لیے صلی اللہ علیہ وسلم تمام انبیاء کے مقامات کو جمع کر دیا گیا، اور ان پر فرشتوں کے مقابلے میں وہ ظاہر نہیں ہوا جو آدم علیہ السلام پر ان کے لیے تمام اسماء کے علم کی خصوصیت سے ظاہر ہوا تھا۔ پس جب اس دن سب کو ان کی ضرورت ہو گی، فرشتوں اور آدم سے لے کر ان کے نیچے تک کے لوگوں کو، شفاعت کا دروازہ کھولنے اور اللہ کے ہاں ان کی وجاہت کو ظاہر کرنے میں، کیونکہ الٰہی قہر اور سب سے بڑی جبروت نے سب کو خاموش کر دیا ہو گا، اور یہ مقام آدم علیہ السلام کے مقام کی طرح اور اس سے بھی عظیم تر ہو گا، اس دن جب شدید ضرورت ہو گی، اس الٰہی غضب کے ساتھ جس میں الحق نے اس دن تجلی (التجلی) فرمائی، اور آدم کے معاملے میں ایسی صفت ظاہر نہیں ہوئی تھی۔ پس مجموعی طور پر یہ ان کے عظیم مرتبے پر دلالت کرتا ہے، صلی اللہ علیہ وسلم، کہ انہوں نے اس غضبی الٰہی صفت کے باوجود الحق سے مناجات کرنے میں پہل کی۔\n\n### [یوم القیامہ الحق کی ادنیٰ صورت میں تجلی]\n\nپس الحق سبحانہ و تعالیٰ نے ان کا جواب دیا، پس میزانیں لٹکائی گئیں، اور صحیفے کھولے گئے، اور صراط نصب کیا گیا، اور شفاعت شروع کی گئی۔ پس سب سے پہلے فرشتوں نے شفاعت کی، پھر نبیوں نے، پھر مؤمنوں نے، اور ارحم الراحمین (سب سے زیادہ رحم کرنے والا) باقی رہا۔ اور یہاں ایک عظیم تفصیل ہے جس میں بات طویل ہو جائے گی، کیونکہ یہ ایک عظیم مقام ہے۔ تاہم، الحق اس دن تجلی فرمائے گا اور کہے گا کہ ہر امت اس کی پیروی کرے جس کی وہ عبادت کرتی تھی، یہاں تک کہ یہ امت باقی رہ جائے گی اور اس میں اس کے منافق بھی ہوں گے۔ پس الحق ان کے لیے ان صورتوں میں سے ایک ادنیٰ صورت میں تجلی فرمائے گا جس میں اس نے انہیں اس سے پہلے تجلی فرمائی تھی، پس وہ کہے گا: میں تمہارا رب ہوں۔ تو وہ کہیں گے: ہم تجھ سے اللہ کی پناہ مانگتے ہیں، ہم انتظار کر رہے ہیں یہاں تک کہ ہمارا رب ہمارے پاس آئے۔ پس وہ جل و تعالیٰ ان سے کہے گا: کیا تمہارے اور اس کے درمیان کوئی علامت ہے جس سے تم اسے پہچانتے ہو؟ تو وہ کہیں گے: ہاں۔ پس وہ ان کے لیے اس صورت میں بدل جائے گا جس میں انہوں نے اسے اس علامت کے ساتھ پہچانا تھا، تو وہ کہیں گے: تو ہمارا رب ہے۔ پس وہ انہیں سجدہ کرنے کا حکم دے گا، پس جو شخص اللہ کے لیے سجدہ کرتا تھا وہ سجدہ کرے گا، اور جو شخص ریاکاری اور دکھاوے کے لیے سجدہ کرتا تھا، اللہ اس کی کمر کو تانبے کی تہہ بنا دے گا، جب بھی وہ سجدہ کرنا چاہے گا، وہ اپنی پشت پر گر جائے گا۔ اور یہی اس کا قول ہے: يَوْمَ يُكْشَفُ عَنْ ساقٍ ويُدْعَوْنَ إِلَى السُّجُودِ فَلا يَسْتَطِيعُونَ ... وقَدْ كانُوا يُدْعَوْنَ إِلَى السُّجُودِ وهُمْ سالِمُونَ (جس دن پنڈلی کھولی جائے گی اور انہیں سجدے کے لیے بلایا جائے گا، تو وہ سجدہ نہ کر سکیں گے... حالانکہ انہیں سجدے کے لیے بلایا جاتا تھا جب وہ صحیح سالم تھے) یعنی دنیا میں۔ اور جو پنڈلی ان کے لیے کھولی گئی، وہ یوم القیامہ کی ہولناکیوں میں سے ایک عظیم معاملے سے کنایہ ہے، عرب کہتے ہیں: جنگ نے اپنی پنڈلی کھول دی، جب جنگ شدید ہو جائے اور اس کا معاملہ عظیم ہو جائے۔ اور اسی طرح الْتَفَّتِ السَّاقُ بِالسَّاقِ (پنڈلی سے پنڈلی لپٹ جائے گی) یعنی یوم القیامہ میں ہولناکیاں اور عظیم امور ایک دوسرے میں داخل ہو جائیں گے۔\n\n### [توحید عقلی اور توحید شرعی اور جنت میں داخلہ]\n\nپس جب شفاعت ہو جائے گی اور جہنم میں کوئی شرعی مؤمن باقی نہیں رہے گا، اور نہ ہی کوئی ایسا شخص جس نے کسی نبی کی زبان سے مشروع عمل کیا ہو، اگرچہ وہ رائی کے دانے کے برابر (مِثْقالَ حَبَّةٍ من خَرْدَلٍ) یا اس سے بھی چھوٹا ہو، مگر وہ انبیاء اور مؤمنین کی شفاعت سے نکل جائے گا، اور اہل توحید (موحدین) باقی رہیں گے جنہوں نے عقلی دلائل سے توحید کو جانا تھا اور اللہ کے ساتھ کسی چیز کو شریک نہیں کیا تھا، اور شرعی ایمان نہیں لائے تھے، اور انہوں نے کوئی نیک عمل نہیں کیا تھا جس میں انہوں نے کسی نبی کی پیروی کی ہو، پس ان کے پاس ایمان کا ایک ذرہ بھی نہیں ہو گا، تو انہیں ارحم الراحمین نکالے گا۔ اور ان کا قول \"انہوں نے کوئی نیک عمل نہیں کیا\" سے مراد شرعی عمل ہے، اس حیثیت سے کہ وہ مشروع ہے، اور ایمان سے بڑھ کر کوئی نیکی نہیں ہے، اور انہوں نے وہ نہیں کیا تھا۔ اور یہ عثمان بن عفان کی حدیث ہے جو صحیح مسلم میں ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n> من مات وهو يعلم ولم يقل يؤمن أنه لا إله إلا الله دخل الجنة (جو شخص مر گیا اور وہ جانتا تھا—اور یہ نہیں کہا کہ ایمان رکھتا تھا—کہ اللہ کے سوا کوئی معبود نہیں، وہ جنت میں داخل ہو گیا)۔\n\nاور یہ نہیں کہا کہ \"کہتا ہے\" بلکہ صرف علم کو بیان کیا۔ پس ان لوگوں میں اللہ کی عنایت آگ میں سبقت لے جائے گی، کیونکہ آگ اپنی ذات میں کسی بھی صورت میں موحد (توحید پرست) کو ہمیشہ کے لیے قبول نہیں کرتی، اور اس کی سب سے کامل صورت علم کے ساتھ ایمان ہے۔ پس اس نے علم اور ایمان کو جمع کیا۔ اگر تو کہے کہ ابلیس جانتا ہے کہ اللہ ایک ہے، تو ہم کہیں گے: تو نے سچ کہا، لیکن وہ پہلا شخص ہے جس نے شرک کی بنیاد ڈالی، پس اس پر مشرکوں کا گناہ ہے، اور ان کا گناہ یہ ہے کہ وہ آگ سے نہیں نکلیں گے۔ یہ اس صورت میں ہے جب یہ ثابت ہو کہ وہ موحد مر گیا، اور تجھے کیا معلوم، شاید وہ اپنے نظر میں کسی شبہ کی وجہ سے مشرک مر گیا ہو۔ اور اس مسئلے پر بات پہلے ابواب میں گزر چکی ہے۔ پس ابلیس آگ سے نکلنے والا نہیں ہے۔ پس اللہ جانتا ہے کہ ان میں سے کون سا معاملہ تھا۔ اور یہاں بہت سے علوم ہیں، اور انہیں بیان کرنے میں طوالت ہے جو ہمیں اختصار کے مقصد سے باہر لے جائے گی، لیکن اس کے باوجود، ہمیں قیامت کے مشہور مقامات میں سے ہر ایک کا ایک مختصر ذکر کرنا ضروری ہے، جیسے العرض (پیشی)، کتابوں کا لیا جانا، المیزان (ترازو)، الصراط (پل صراط)، الأعراف (اعراف)، ذبح الموت (موت کا ذبح کیا جانا)، اور المأدبة (دعوت) جو جنت کے میدان میں ہو گی۔ پس یہ صرف سات مقامات ہیں، اور یہ جہنم کے سات دروازوں اور جنت کے سات دروازوں کی مائیں ہیں۔ کیونکہ آٹھواں دروازہ رؤیت (دیدار) کی جنت کا ہے، اور وہ جہنم میں بند دروازہ ہے، اور وہ حجاب کا دروازہ ہے، پس وہ کبھی نہیں کھلے گا، کیونکہ اہل نار اپنے رب سے محجوب (پردے میں) ہوں گے۔\n\n### [قیامت کے سات بنیادی مقامات کا وصل]\n\n### [پہلا مقام: العرض (پیشی)]\n\nخبر میں آیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے اللہ تعالیٰ کے قول فَسَوْفَ يُحاسَبُ حِساباً يَسِيراً (پس عنقریب اس سے آسان حساب لیا جائے گا) کے بارے میں سوال کیا گیا، تو آپ نے فرمایا:\n> ذلك العرض يا عائشة من نوقش الحساب عذب (اے عائشہ! وہ عرض (پیشی) ہے، جس سے حساب میں سختی کی گئی وہ عذاب دیا گیا)۔\n\nاور یہ فوج کی پیشی کی طرح ہے، یعنی اعمال کی پیشی، نہ کہ اہل موقف کا لباس۔ اور اللہ ہی بادشاہ ہے، پس يُعْرَفُ الْمُجْرِمُونَ بِسِيماهُمْ (مجرم اپنی نشانیوں سے پہچانے جائیں گے)، جیسا کہ یہاں فوجی اپنے لباس سے پہچانے جاتے ہیں۔\n\n### [دوسرا مقام: الكتب (کتابیں)]\n\nاللہ تعالیٰ فرماتا ہے: اقْرَأْ كِتابَكَ كَفى‏ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيباً (اپنی کتاب پڑھ لے، آج تو خود ہی اپنا محاسب کافی ہے)۔ اور فرمایا: فَأَمَّا من أُوتِيَ كِتابَهُ بِيَمِينِهِ (پس جس کو اس کی کتاب دائیں ہاتھ میں دی گئی)، اور وہ مؤمن سعید ہے، اور أَمَّا من أُوتِيَ كِتابَهُ بِشِمالِهِ (اور جس کو اس کی کتاب بائیں ہاتھ میں دی گئی)، اور وہ منافق ہے، کیونکہ کافر کی کوئی کتاب نہیں ہو گی۔ پس منافق سے ایمان چھین لیا گیا اور اس سے اسلام نہیں لیا گیا، پس منافق کے بارے میں کہا گیا: إِنَّهُ كانَ لا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ (بے شک وہ اللہ عظیم پر ایمان نہیں لاتا تھا)، پس اس میں معطل (منکر خدا)، مشرک اور اللہ پر تکبر کرنے والا شامل ہے۔ اور اسلام کا ذکر نہیں کیا گیا، کیونکہ منافق ظاہری طور پر اطاعت کرتا ہے تاکہ وہ اپنا مال، اہل و عیال اور خون محفوظ رکھ سکے، اور اس کا باطن ان تینوں میں سے کسی ایک کا ہو گا۔ اور ہم نے یہ اس لیے کہا کہ یہ آیت ان تینوں کو شامل ہے، کیونکہ اس کا قول لا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ (اللہ عظیم پر ایمان نہیں لاتا) کا مطلب ہے کہ وہ اللہ کی تصدیق نہیں کرتا۔ اور جو لوگ اللہ کی تصدیق نہیں کرتے وہ دو گروہ ہیں: ایک گروہ جو اللہ کے وجود کی تصدیق نہیں کرتا، اور وہ معطلہ ہیں، اور ایک گروہ جو اللہ کی توحید کی تصدیق نہیں کرتا، اور وہ مشرک ہیں۔ اور اس آیت میں 'العظيم' (عظیم) کا قول اللہ پر تکبر کرنے والے کو شامل کرتا ہے، کیونکہ اگر وہ اللہ کی اس عظمت کا اعتقاد رکھتا جس کا حقدار وہ ہے جسے اللہ کہا جاتا ہے، تو وہ اس پر تکبر نہ کرتا۔ اور یہ تینوں، اس منافق کے ساتھ جو اپنی خاص صفت سے ان سے ممتاز ہے، اہل نار ہیں جو اس کے اہل ہیں۔ اور أَمَّا من أُوتِيَ كِتابَهُ وَراءَ ظَهْرِهِ (اور جس کو اس کی کتاب اس کی پیٹھ کے پیچھے سے دی گئی)، وہ وہ لوگ ہیں جنہیں کتاب دی گئی، فَنَبَذُوهُ وَراءَ ظُهُورِهِمْ (پس انہوں نے اسے اپنی پیٹھ کے پیچھے پھینک دیا) اور اس کے بدلے تھوڑی قیمت خریدی (واشْتَرَوْا به ثَمَناً قَلِيلًا)۔ پس جب یوم القیامہ ہو گا تو اسے کہا جائے گا: اسے اپنی پیٹھ کے پیچھے سے لے لو، یعنی اس جگہ سے جہاں تم نے اسے اپنی دنیاوی زندگی میں پھینکا تھا۔ پس یہ ان کی وہ کتاب ہے جو ان پر نازل ہوئی تھی، نہ کہ اعمال کی کتاب۔ کیونکہ جب اس نے اسے اپنی پیٹھ کے پیچھے پھینکا، تو ظَنَّ أَنْ لَنْ يَحُورَ (اس نے گمان کیا کہ وہ کبھی لوٹ کر نہیں آئے گا)، یعنی اسے یقین تھا۔ شاعر نے کہا:\n\n> فقلت لهم ظنوا بألفي مدجج\n(پس میں نے ان سے کہا کہ دو ہزار زرہ پوشوں کا گمان کرو)\n\nصحیح حدیث میں آیا ہے کہ اللہ اسے یوم القیامہ کہے گا: \"کیا تو نے گمان کیا تھا کہ تو مجھ سے ملنے والا ہے؟\"\nاور اللہ تعالیٰ فرماتا ہے: وذلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْداكُمْ (اور یہ تمہارا وہ گمان تھا جو تم نے اپنے رب کے بارے میں کیا، جس نے تمہیں ہلاک کر دیا)۔\n\n### [تیسرا مقام: الموازین (ترازو)]\n\nپس اعمال کو تولنے کے لیے میزانیں رکھی جائیں گی، پس ان میں وہ کتابیں رکھی جائیں گی جن میں انہوں نے عمل کیا، اور آخری چیز جو میزان میں رکھی جائے گی وہ انسان کا قول \"الحمد للہ\" ہے۔ اور اسی لیے\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n> الحمد لله تملأ الميزان (الحمد للہ میزان کو بھر دیتا ہے)۔\n\nکیونکہ میزان میں بندوں کے تمام اعمال ڈالے جائیں گے سوائے کلمہ لا إله إلا الله کے، پس اس کے بھرنے سے ایک تحمید (الحمد للہ) باقی رہ جائے گی، پس وہ رکھی جائے گی اور اس سے بھر جائے گی۔ کیونکہ ہر ایک کے میزان کا پلڑا اس کے عمل کے مطابق ہو گا، بغیر کسی کمی یا زیادتی کے۔ اور ہر ذکر اور عمل میزان میں داخل ہو گا سوائے لا إله إلا الله کے، جیسا کہ ہم نے کہا۔ اور اس کی وجہ یہ ہے کہ ہر نیک عمل کا اس کے مخالف سے مقابلہ ہوتا ہے، پس یہ نیکی اس کے مقابلے میں رکھی جاتی ہے۔ اور لا إله إلا الله کا مقابلہ صرف شرک سے ہوتا ہے، اور کسی کے میزان میں توحید اور شرک جمع نہیں ہو سکتے، کیونکہ اگر اس نے لا إله إلا الله کہا ہے اور اس کا اعتقاد رکھتا ہے تو اس نے شرک نہیں کیا، اور اگر اس نے شرک کیا ہے تو اس نے لا إله إلا الله کا اعتقاد نہیں رکھا۔ پس جب ان دونوں کا جمع ہونا صحیح نہیں ہوا، تو کلمہ لا إله إلا الله کے لیے دوسرے پلڑے میں کوئی چیز نہیں ہو گی جو اس کے برابر ہو، اور کوئی چیز اسے بھاری نہیں کر سکتی۔ اس لیے یہ میزان میں داخل نہیں ہوتا۔ اور مشرکوں کے بارے میں، فَلا نُقِيمُ لَهُمْ يَوْمَ الْقِيامَةِ وَزْناً (پس ہم ان کے لیے یوم القیامہ کوئی وزن قائم نہیں کریں گے)، یعنی ان کی کوئی قدر نہیں ہو گی، اور نہ ہی ان کے لیے کوئی عمل تولا جائے گا، اور نہ ہی ان جیسے لوگوں کے لیے جنہوں نے اللہ سے ملاقات کو جھٹلایا اور اس کی آیات کا کفر کیا۔ کیونکہ مشرک کی نیکیاں ضائع ہو جاتی ہیں، پس ان کی برائیوں کے مقابلے میں کوئی چیز نہیں ہو گی جو ان کا وزن کرے۔ فَلا نُقِيمُ لَهُمْ يَوْمَ الْقِيامَةِ وَزْناً (پس ہم ان کے لیے یوم القیامہ کوئی وزن قائم نہیں کریں گے)۔ اور صاحب السجلات (صحیفوں والا) وہ شخص ہے جس نے کبھی کوئی نیکی نہیں کی، سوائے اس کے کہ اس نے ایک دن اخلاص کے ساتھ کلمہ لا إله إلا الله کہا، پس وہ اس کے لیے ننانوے صحیفوں کے مقابلے میں رکھا جائے گا جو برے اعمال کے ہوں گے، ان میں سے ہر صحیفہ مشرق و مغرب کے درمیان جتنا ہو گا، اور یہ اس لیے کہ اس کے پاس اس کے سوا کوئی نیک عمل نہیں تھا۔ پس اس کا پلڑا سب پر بھاری ہو جائے گا اور صحیفے ہلکے ہو جائیں گے، اور اس پر تعجب کیا جائے گا۔ اور میزان میں صرف ظاہری اعضاء کے اعمال داخل ہوں گے، ان کی برائی اور بھلائی، یعنی کان، آنکھ، زبان، ہاتھ، پیٹ، شرمگاہ اور پاؤں۔ اور باطنی اعمال میزان محسوس میں داخل نہیں ہوں گے، لیکن ان میں عدل قائم کیا جائے گا، اور وہ حکمی معنوی میزان ہو گا، محسوس کے لیے محسوس اور معنی کے لیے معنی، ہر چیز کا اس کے مثل سے مقابلہ کیا جائے گا۔ اس لیے اعمال کو اس حیثیت سے تولا جائے گا کہ وہ لکھے ہوئے ہیں۔\n\n### [چوتھا مقام: الصراط (پل صراط)]\n\nاور وہ مشروع صراط ہے جو یہاں معنی تھا، وہاں حس کے ساتھ محسوس طور پر نصب کیا جائے گا۔ اللہ ہمیں فرماتا ہے: وأَنَّ هذا صِراطِي مُسْتَقِيماً فَاتَّبِعُوهُ ولا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ (اور یہ میرا سیدھا راستہ ہے، پس اس کی پیروی کرو اور دوسرے راستوں کی پیروی نہ کرو، ورنہ وہ تمہیں اس کے راستے سے بھٹکا دیں گے)۔ اور جب رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت تلاوت کی، تو آپ نے ایک خط کھینچا اور اس کے دونوں اطراف میں خطوط کھینچے، اور یہی توحید کا صراط ہے اور اس کے لوازمات اور حقوق ہیں۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n> أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحق الإسلام وحسابهم على الله (مجھے حکم دیا گیا ہے کہ میں لوگوں سے لڑوں یہاں تک کہ وہ لا إله إلا الله کہیں، پس جب وہ یہ کہہ دیں تو انہوں نے مجھ سے اپنے خون اور مال محفوظ کر لیے، سوائے حق اسلام کے، اور ان کا حساب اللہ پر ہے)۔\n\nاس کے قول \"اور ان کا حساب اللہ پر ہے\" سے مراد یہ ہے کہ اللہ کے سوا کوئی نہیں جانتا کہ انہوں نے یہ بات اعتقاد کے ساتھ کہی یا نہیں۔ پس مشرک کا قدم صراطِ توحید پر نہیں ہے، لیکن اس کا قدم صراطِ ہستی (الوجود) پر ہے۔ اور معطل (منکرِ خدا) کا قدم صراطِ ہستی (الوجود) پر نہیں ہے۔ پس مشرک نے یہاں اللہ کی توحید بیان نہیں کی، لہٰذا وہ معطلہ کے ساتھ میدانِ حشر سے دوزخ کی طرف جائے گا۔ اور جو لوگ دوزخ کے پکے اہل ہیں، ان میں سے سوائے منافقین کے (کوئی جنت کو نہیں دیکھے گا)۔ منافقین کے لیے ضروری ہے کہ وہ جنت کی طرف دیکھیں اور اس میں موجود نعمتوں کو دیکھ کر طمع کریں، پس یہ جنت کی نعمتوں میں سے ان کا حصہ ہے، پھر انہیں دوزخ کی طرف پھیر دیا جائے گا۔ اور یہ اللہ کے عدل (العدل) میں سے ہے، کیونکہ انہیں ان کے اعمال کا بدلہ دیا گیا۔\n\nاور وہ گروہ جو دوزخ میں ہمیشہ نہیں رہے گا، اسے صراط (الصراط) پر روکا جائے گا، سوال کیا جائے گا اور عذاب دیا جائے گا۔ اور صراط (الصراط) دوزخ کی پشت پر ہے اور اس میں غائب ہے۔ اور اس میں جو کانٹے (کلالیب) ہیں، ان کے ذریعے اللہ انہیں اس پر روکے گا۔ اور چونکہ صراط (الصراط) دوزخ میں ہے اور جنت کی طرف اس کے سوا کوئی راستہ نہیں ہے، اس لیے اللہ تعالیٰ نے فرمایا: \"اور تم میں سے کوئی نہیں مگر اس پر وارد ہونے والا ہے، یہ تیرے رب پر لازم کیا ہوا فیصلہ ہے\" (وَإِنْ مِنْكُمْ إِلَّا وارِدُها كانَ عَلى‏ رَبِّكَ حَتْماً مَقْضِيًّا)۔ اور جس نے اس قول کا معنی جان لیا، اس نے جان لیا کہ دوزخ کا مقام کیا ہے۔ اگر نبی اکرم صلی اللہ علیہ وسلم نے اس کے بارے میں پوچھے جانے پر کچھ فرمایا ہوتا تو میں بھی کہہ دیتا، لیکن آپ صلی اللہ علیہ وسلم نے اس کے بارے میں خاموشی اختیار کی اور جواب میں \"اللہ کے علم میں ہے\" فرمایا، مگر یہ خاموشی کسی الٰہی حکم کے تحت تھی، کیونکہ آپ صلی اللہ علیہ وسلم خواہش سے کلام نہیں کرتے (مَا يَنْطِقُ عَنِ الْهَوىٰ)۔ اور یہ دنیاوی معاملات میں سے نہیں ہے، لہٰذا ہمارا اس سے خاموش رہنا ہی ادب ہے۔\n\nاور صراط (الصراط) کی صفت میں آیا ہے کہ وہ بال سے زیادہ باریک اور تلوار سے زیادہ تیز ہے۔ اور اسی طرح دنیا میں علمِ شریعت بھی ہے۔ اللہ کے نزدیک کسی مسئلے میں حق کا چہرہ معلوم نہیں ہوتا، اور نہ ہی مجتہدین میں سے کون عین حق پر ہے، یہ معلوم ہوتا ہے۔ اسی لیے ہمیں دلیل کی تلاش میں پوری کوشش کرنے کے بعد غلبۂ ظن پر عمل کرنے کا پابند کیا گیا ہے، نہ کہ متواتر یا صحیح معلوم خبرِ واحد پر۔ کیونکہ متواتر اگرچہ علم کا فائدہ دیتا ہے، لیکن تواتر سے حاصل ہونے والا علم صرف اس لفظ کا عین ہونا یا یہ علم ہونا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے کہا یا اس پر عمل کیا۔ اور علم سے ہماری مطلوبہ چیز وہ ہے جو اس قول اور عمل سے سمجھی جائے، تاکہ مسئلے میں قطعی حکم لگایا جا سکے۔ اور یہ صرف نصِ صریح متواتر سے ہی حاصل ہو سکتا ہے، اور یہ بہت کم پایا جاتا ہے، جیسے اللہ تعالیٰ کا یہ قول: \"یہ پورے دس ہیں\" (تِلْكَ عَشَرَةٌ كامِلَةٌ)۔ اس کے دس ہونے کے خاص حکم میں، شریعت کا حکم دنیا میں تلوار سے زیادہ تیز اور بال سے زیادہ باریک ہے۔ پس حکم کو درست پانے والا ایک ہی ہے، لیکن وہ متعین نہیں ہے، اور سب اجر پانے والے ہیں۔ پس شریعت یہاں صراطِ مستقیم (الصراط المستقيم) ہے۔ اور نماز کی ہر رکعت میں بندہ کہتا رہتا ہے: \"ہمیں سیدھے راستے کی ہدایت دے\" (اهْدِنَا الصِّراطَ الْمُسْتَقِيمَ)۔ پس یہ تلوار سے زیادہ تیز اور بال سے زیادہ باریک ہے۔ آخرت میں اس کا ظہور محسوس طور پر دنیا کے ظہور سے زیادہ واضح اور روشن ہو گا، سوائے ان لوگوں کے جنہوں نے بصیرت (بصيرة) کے ساتھ اللہ کی طرف دعوت دی، جیسے رسول اور ان کے پیروکار۔ پس اللہ نے انہیں بصیرت (بصيرة) کے ساتھ اللہ کی طرف دعوت دینے میں انبیاء کے درجے کے ساتھ ملحق کر دیا، یعنی علم اور کشف (الکشف) کے ساتھ۔ اور ایک روایت میں آیا ہے کہ قیامت کے دن صراط (الصراط) کی پشت گزرنے والوں کے نور کی مقدار کے مطابق آنکھوں کے سامنے ظاہر ہو گی، چنانچہ وہ ایک قوم کے حق میں باریک ہو گا اور دوسری قوم کے حق میں چوڑا ہو گا۔\n\nاس خبر کی تصدیق اللہ تعالیٰ کا یہ قول کرتا ہے: \"ان کا نور ان کے آگے اور ان کے دائیں دوڑ رہا ہو گا\" (نُورُهُمْ يَسْعىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمانِهِمْ)۔ اور سعی (دوڑنا) چلنا ہے، اور وہاں صراط (الصراط) کے سوا کوئی راستہ نہیں ہے۔ اور اللہ نے \"اور ان کے دائیں\" (وَبِأَيْمانِهِمْ) اس لیے فرمایا کہ آخرت میں مومن کا کوئی بایاں (شمال) نہیں ہو گا، جیسا کہ اہل دوزخ کا کوئی دایاں (یمین) نہیں ہو گا۔ یہ صراط (الصراط) پر ہونے والے کچھ احوال ہیں۔ اور جہاں تک کانٹوں (کلالیب)، ہکوں (خطاطیف) اور خاردار چیزوں کا تعلق ہے، جیسا کہ ہم نے ذکر کیا، وہ بنی آدم کے اعمال کی صورتیں ہیں، ان کے وہ اعمال انہیں صراط (الصراط) پر روکے رکھیں گے، پس وہ نہ جنت کی طرف بڑھ سکیں گے اور نہ دوزخ میں گریں گے، یہاں تک کہ شفاعت اور عنایتِ الٰہی انہیں آ لے۔ جیسا کہ ہم نے طے کیا ہے: پس جس نے یہاں (دنیا میں) درگزر کیا، اللہ وہاں اس سے درگزر کرے گا۔ اور جس نے کسی تنگ دست کو مہلت دی، اللہ اسے مہلت دے گا۔ اور جس نے معاف کیا، اللہ اسے معاف کرے گا۔ اور جس نے یہاں اپنے بندوں سے اپنا حق پورا وصول کیا، اللہ وہاں اس سے اپنا حق پورا وصول کرے گا۔ اور جس نے اس امت پر سختی کی، اللہ اس پر سختی کرے گا۔ یہ درحقیقت تمہارے اعمال ہیں جو تم پر لوٹائے جائیں گے، لہٰذا اخلاقِ حسنہ کو لازم پکڑو۔\n\nکیونکہ کل اللہ تمہارے ساتھ وہی معاملہ کرے گا جو تم نے اس کے بندوں کے ساتھ کیا، خواہ وہ جو بھی تھے اور جیسے بھی تھے۔\n\n***\n\n### پانچواں مقام: اعراف (الأعراف)\n\nاور اعراف (الأعراف) جنت اور دوزخ کے درمیان ایک دیوار ہے، \"جس کا باطن رحمت ہے\" (باطِنُهُ فِيهِ الرَّحْمَةُ)، اور یہ وہ حصہ ہے جو جنت کی طرف ہے۔ اور \"اس کا ظاہر عذاب کی طرف ہے\" (وَظاهِرُهُ مِنْ قِبَلِهِ الْعَذابُ)، اور یہ وہ حصہ ہے جو دوزخ کی طرف ہے۔ اس پر وہ لوگ ہوں گے جن کے میزان کے دونوں پلڑے برابر ہوں گے۔ پس وہ دوزخ کی طرف بھی دیکھیں گے اور جنت کی طرف بھی دیکھیں گے، اور ان کے پاس کوئی ایسی فوقیت نہیں ہو گی جو انہیں دونوں گھروں میں سے کسی ایک میں داخل کر دے۔ پھر جب انہیں سجدہ کرنے کے لیے بلایا جائے گا—اور یہ وہ آخری تکلیف ہے جو قیامت کے دن باقی رہے گی—تو وہ سجدہ کریں گے، پس ان کی نیکیوں کا پلڑا بھاری ہو جائے گا اور وہ جنت میں داخل ہو جائیں گے۔ وہ اپنی برائیوں کی وجہ سے دوزخ کی طرف دیکھ رہے تھے اور اپنی نیکیوں کی وجہ سے جنت کی طرف دیکھ رہے تھے، اور وہ اللہ کی رحمت کو دیکھ کر طمع کر رہے تھے۔ ان کی طمع کا سبب یہ بھی ہے کہ وہ \"لا الٰہ الا اللہ\" کہنے والوں میں سے ہیں، اور اگرچہ وہ اسے اپنے میزان میں نہیں دیکھتے، لیکن وہ جانتے ہیں کہ \"بے شک اللہ ذرہ برابر بھی ظلم نہیں کرتا\" (إِنَّ اللهَ لا يَظْلِمُ مِثْقالَ ذَرَّةٍ)۔ اور اگر ایک ذرہ بھی دونوں پلڑوں میں سے کسی ایک کی طرف آ جائے تو وہ اسے بھاری کر دے گا، کیونکہ وہ دونوں انتہائی اعتدال پر ہیں۔ پس وہ اللہ کے کرم اور اس کے عدل (العدل) کی طمع کرتے ہیں، اور یہ کہ کلمہ \"لا الٰہ الا اللہ\" کی اپنے کہنے والے کے لیے ضرور کوئی عنایت ہو گی جس کا اثر ان پر ظاہر ہو گا۔ اللہ عزوجل ان کے بارے میں فرماتا ہے: \"اور اعراف (الأعراف) پر کچھ لوگ ہوں گے جو ہر ایک کو ان کی نشانیوں سے پہچانیں گے، اور وہ جنت والوں کو پکاریں گے کہ تم پر سلامتی ہو، وہ اس میں داخل نہیں ہوئے ہوں گے اور وہ طمع کر رہے ہوں گے\" (وَعَلَى الْأَعْرافِ رِجالٌ يَعْرِفُونَ كُلًّا بِسِيماهُمْ وَنادَوْا أَصْحابَ الْجَنَّةِ أَنْ سَلامٌ عَلَيْكُمْ لَمْ يَدْخُلُوها وَهُمْ يَطْمَعُونَ)۔ جیسا کہ وہ یہ بھی پکاریں گے جب ان کی نگاہیں دوزخ والوں کی طرف پھیری جائیں گی: \"وہ کہیں گے، اے ہمارے رب! ہمیں ظالم قوم کے ساتھ نہ کر\" (إِذا صُرِفَتْ أَبْصارُهُمْ تِلْقاءَ أَصْحابِ النَّارِ قالُوا رَبَّنا لا تَجْعَلْنا مَعَ الْقَوْمِ الظَّالِمِينَ)۔ اور یہاں ظلم سے مراد صرف شرک ہے۔\n\n***\n\n### چھٹا مقام: موت کا ذبح ہونا (ذبح الموت)\n\nاگرچہ موت ایک نسبت ہے، لیکن اللہ اسے قیامت کے دن ایک چتکبرے مینڈھے کی صورت میں ظاہر کرے گا۔ اور پکارا جائے گا: اے جنت والو! تو وہ گردنیں اٹھا کر دیکھیں گے۔ اور پکارا جائے گا: اے دوزخ والو! تو وہ گردنیں اٹھا کر دیکھیں گے۔ اور اس وقت دوزخ میں صرف وہی لوگ ہوں گے جو اس کے پکے اہل ہیں۔ پھر دونوں فریقوں سے پوچھا جائے گا، جبکہ وہ جنت اور دوزخ کے درمیان ہو گا: کیا تم اسے پہچانتے ہو؟ تو وہ کہیں گے: یہ موت ہے۔ اور یحییٰ علیہ السلام آئیں گے اور ان کے ہاتھ میں چھری ہو گی، پس وہ اسے لٹائیں گے اور ذبح کر دیں گے۔ اور ایک منادی پکارے گا: اے جنت والو! ہمیشہ رہنا ہے، اب کوئی موت نہیں! اور اے دوزخ والو! ہمیشہ رہنا ہے، اب کوئی موت نہیں!\n\nاور یہی یومِ حسرت (حسرت کا دن) ہے۔ جہاں تک جنت والوں کا تعلق ہے، جب وہ موت کو دیکھیں گے تو بہت زیادہ خوش ہوں گے اور اس سے کہیں گے: اللہ نے ہمارے لیے تجھ میں برکت دی، تو نے ہمیں دنیا کی پریشانیوں سے نجات دلائی، اور تو ہم پر آنے والا بہترین مہمان تھا اور بہترین تحفہ تھا جو ذات حق (الحق) نے ہمیں بھیجا۔ کیونکہ نبی اکرم صلی اللہ علیہ وسلم فرماتے ہیں: \"موت مومن کا تحفہ ہے\" (الموت تحفة المؤمن)۔\n\nاور جہاں تک دوزخ والوں کا تعلق ہے، جب وہ اسے دیکھیں گے تو اس سے خوف کھائیں گے اور کہیں گے: تو ہم پر آنے والا بدترین مہمان تھا، تو نے ہمارے اور اس خیر و راحت کے درمیان رکاوٹ ڈال دی جس میں ہم تھے۔ پھر وہ اس سے کہیں گے: کاش تو ہمیں مار دیتا تاکہ ہم اس تکلیف سے راحت پاتے جس میں ہم ہیں۔ اور اسے یومِ حسرت اس لیے کہا گیا کہ یہ سب کے لیے حسرت کا دن ہے، یعنی دونوں گروہوں کے لیے دائمی خلود (ہمیشگی) کی صفت ظاہر ہو گئی۔ پھر دوزخ کے دروازے ایسے بند کر دیے جائیں گے کہ اس کے بعد کوئی کھلنا نہیں ہو گا، اور دوزخ اپنے اہل پر منطبق ہو جائے گی اور اس کا بعض حصہ بعض میں داخل ہو جائے گا تاکہ اس کے اہل کا دباؤ بڑھ جائے، اور اس کا نچلا حصہ اوپر اور اوپر والا حصہ نیچے ہو جائے گا۔ اور تم لوگوں اور شیطانوں کو اس میں ہنڈیا میں گوشت کے ٹکڑوں کی طرح دیکھو گے، کیونکہ اس کے نیچے عظیم آگ ہو گی جو \"کھولتے ہوئے پانی کی طرح جوش مار رہی ہو گی\" (كَغَلْيِ الْحَمِيمِ)۔ پس وہ اپنے اندر موجود لوگوں کو اوپر نیچے گھمائے گی، \"جب بھی وہ بجھنے لگے گی، ہم ان کے لیے مزید بھڑکائیں گے\" (كُلَّما خَبَتْ زِدْناهُمْ سَعِيراً) کھالوں کی تبدیلی کے ساتھ۔\n\n***\n\n### ساتواں مقام: ضیافت (المأدبة)\n\nیہ بادشاہ (ذات حق) کی جنت والوں کے لیے ضیافت (المأدبة) ہے۔ اور اسی وقت دوزخ والے نوحہ گاہ (مندبہ) میں جمع ہوں گے۔ پس جنت والے ضیافت میں ہوں گے اور دوزخ والے نوحہ گاہوں میں۔ اس ضیافت میں ان کا کھانا مچھلی کے جگر کا زائد حصہ ہو گا، اور میدان کی زمین روٹی کی طرح سفید میدہ ہو گی۔ اور دوزخ والوں کے لیے بیل سے تلی (طحال) نکالی جائے گی۔\n\nپس جنت والے مچھلی (نون) کے جگر کا زائد حصہ کھائیں گے، اور یہ ایک سمندری، آبی حیوان ہے، لہٰذا یہ حیات کے اس عنصر سے ہے جو جنت کے لیے مناسب ہے۔ اور جگر خون کا گھر ہے، اور یہ زندگی کا گھر ہے۔ اور زندگی گرم اور مرطوب ہوتی ہے۔ اور اس خون کا بخار ہی نفس ہے جسے روحِ حیوانی سے تعبیر کیا جاتا ہے جس سے بدن کی زندگی قائم ہے۔ پس یہ جنت والوں کے لیے ان کی زندگی کے باقی رہنے کی بشارت ہے۔\n\nاور جہاں تک حیوان کے جسم میں تلی (الطحال) کا تعلق ہے، تو یہ گندگیوں کا گھر ہے، کیونکہ اس میں بدن کی گندگیاں جمع ہوتی ہیں، اور یہ وہ فاسد خون ہے جو جگر اسے دیتا ہے۔ پس یہ دوزخ والوں کو کھانے کے لیے دی جائے گی۔ اور یہ بیل سے ہو گی، اور بیل ایک خاکی حیوان ہے جس کی طبیعت سرد اور خشک ہے۔ اور دوزخ بھینس کی صورت پر ہے۔ اور بیل کی تلی (الطحال) دوزخ والوں کی غذا کے لیے زیادہ مناسب ہے۔ پس تلی میں موجود خون کی وجہ سے دوزخ والے مریں گے نہیں، اور اس میں موجود بدن کی گندگیوں اور فاسد خون کی وجہ سے جو تکلیف دہ ہے، وہ نہ زندہ رہیں گے اور نہ ہی نعمت پائیں گے۔ پس اس کا کھانا انہیں بیماری اور مرض دے گا۔\n\nپھر جنت والے جنت میں داخل ہوں گے، \"وہ اس سے نکالے جانے والے نہیں ہوں گے\" (مَا هُمْ مِنْها بِمُخْرَجِينَ)۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔\n\nاٹھائیسواں حصہ مکمل ہوا۔",
    "fa": "باب شصت و چهارم در معرفت قیامت و منازل آن و چگونگی برانگیختن (بعث).\n\nبه نام خداوند بخشنده مهربان\n\nروز معراج‌ها (یوم المعارج) پنجاه هزار سال است،\nکه از هر خفته‌ای با خواب و چرتش می‌پرد.\nو زمین از بیم آن بیدار است،\nو خوابی او را نمی‌گیرد به خاطر آنچه حق (الحق) حکم می‌کند.\nپس غریب باش و به گروهی تکیه مکن،\nاز خوارج، که اهل زبان‌های نیش‌دارند.\nو اگر مردی را دیدی که برای فساد می‌کوشد،\nدستش را بگیر تا به آن پاداش نیکو داده شوی.\nو از روی احتیاط به غار (کهف) پناه ببر از مردی،\nکه فتنه‌اش روزی را مانند یک سال به تو نشان می‌دهد.\nگامش را در غیر طاعت حق (الحق) دراز کرده است،\nو پیوسته در هوای نفس خود، لگام گسیخته است.\n\n[معنای روز قیامت]\n\nبدان که این روز، روز قیامت نامیده شد به دلیل برخاستن مردم در آن از گورهایشان برای پروردگار جهانیان در نشأه (النشأة) آخرت که آن را در باب پیش از این باب، در برزخ ذکر کردیم؛ و همچنین به دلیل ایستادنشان هنگامی که حق (الحق) برای فصل و قضاوت می‌آید و فرشتگان صف در صف (صَفًّا صَفًّا) می‌آیند. خداوند متعال می‌فرماید: يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعالَمِينَ (روزی که مردم برای پروردگار جهانیان برمی‌خیزند). یعنی به خاطر پروردگار جهانیان، هنگامی که او می‌آید. و نام «رب» (پروردگار) را آورد، زیرا رب (الرب) مالک است، پس صفت قهر و صفت رحمت را دارد. و نام «الرحمن» (بخشنده مطلق) را نیاورد، زیرا در آن روز ناگزیر از غضب است، چنانکه در این باب خواهد آمد، و ناگزیر از حساب و آوردن جهنم و میزان‌ها است، و این‌ها همه از صفات رحمت مطلق نیست که اسم «الرحمن» آن را می‌طلبد. با این حال، او سبحانه نام الهی‌ای را آورد که رحمت در آن غالب‌تر است، و آن اسم «رب» (الرب) است، زیرا از اصلاح و تربیت می‌آید، پس فضل رحمت موجود در مالک و سرور، بر صفت قهر او غلبه می‌کند و رحمتش بر غضبش پیشی می‌گیرد و گذشت از بدی‌های بیشتر مردم فراوان می‌شود.\n\n[ظواهر و صحنه‌های قیامت]\n\nپس اولین چیزی که بیان می‌کنم و می‌گویم، آن است که خداوند درباره آن روز فرموده است: از کشیده شدن زمین، و درهم پیچیده شدن آسمان و سقوط آن بر زمین، و آمدن فرشتگان، و آمدن رب (الرب) در آن روز، و اینکه خلق در آن هنگام که زمین کشیده می‌شود و صورتش دگرگون می‌گردد و جهنم می‌آید، کجا خواهند بود و حال آن چگونه خواهد بود. سپس حدیث مواقف قیامت در خَمْسِينَ أَلْفَ سَنَةٍ (پنجاه هزار سال) و حدیث شفاعت را می‌آورم. ای برادر من، بدان که مردم هنگامی که از گورهایشان برمی‌خیزند، چنانکه ان‌شاءالله خواهیم آورد، و خداوند اراده می‌کند که زمین را به زمینی دیگر تبدیل کند و زمین به اذن خدا کشیده می‌شود و پل (صراط) زیر تاریکی قرار می‌گیرد، پس خلق بر روی آن خواهند بود هنگامی که خداوند زمین را هرگونه که بخواهد تبدیل می‌کند، یا با تغییر صورت آن و یا با زمینی دیگر که بر آن خوابیده نشده است و «ساهره» نامیده می‌شود. پس او سبحانه آن را مانند پوست کشیده شده دراز می‌کند. خداوند متعال می‌فرماید: وإِذَا الْأَرْضُ مُدَّتْ (و هنگامی که زمین کشیده شود). و وسعت آن را هر اندازه که بخواهد، چندین برابر آنچه بود، از بیست و یک جزء تا نود و نه جزء، افزایش می‌دهد تا آنجا که لَا تَرَى فِيهَا عِوَجًا وَلَا أَمْتًا (هیچ کجی و پستی در آن نمی‌بینی). سپس او سبحانه آسمان را به سوی خود قبض می‌کند و آن را با دست راست خود درهم می‌پیچد، كَطَيِّ السِّجِلِّ لِلْكُتُبِ (مانند درهم پیچیدن طومار برای نوشته‌ها). سپس آن را بر زمینی که کشیده است، در حالی که سست و فروریخته است، می‌اندازد، و این همان قول اوست: وَانْشَقَّتِ السَّمَاءُ فَهِيَ يَوْمَئِذٍ وَاهِيَةٌ (و آسمان شکافته شود و در آن روز سست و فروریخته باشد). و خلق را به زمینی که کشیده است بازمی‌گرداند، پس می‌ایستند و منتظرند که خداوند با آنان چه می‌کند. هنگامی که آسمان سست شد، فرشتگانش بر اطراف آن فرود می‌آیند، پس اهل زمین خلقی عظیم را می‌بینند که چندین برابر خودشان از نظر تعداد هستند. پس گمان می‌کنند که خداوند در میان آنان فرود آمده است، به دلیل عظمت ملکوت (مملکت) که مشاهده می‌کنند و پیش از آن ندیده‌اند. پس می‌گویند: آیا پروردگار ما در میان شماست؟ فرشتگان می‌گویند: پروردگار ما منزه است، او در میان ما نیست و در حال آمدن است. پس فرشتگان صف می‌کشند، صفی دایره‌وار بر اطراف زمین، که عالم انس و جن را احاطه می‌کنند. و اینان ساکنان آسمان دنیا هستند. سپس اهل آسمان دوم فرود می‌آیند، پس از آنکه خداوند آن را نیز قبض می‌کند و ستاره‌اش را که «کاتب» نامیده می‌شود، در آتش می‌اندازد. و آنان از نظر تعداد بیشتر از آسمان اول هستند. پس خلایق می‌گویند: آیا پروردگار ما در میان شماست؟ فرشتگان از سخن آنان به فزع می‌افتند و می‌گویند: پروردگار ما منزه است، او در میان ما نیست و در حال آمدن است. پس همان کار فرشتگان اول را انجام می‌دهند و پشت سر آنان صف دوم را دایره‌وار می‌کشند. سپس اهل آسمان سوم فرود می‌آیند و ستاره‌اش که «زهره» نامیده می‌شود، در آتش انداخته می‌شود و خداوند آن را با دست راست خود قبض می‌کند. خلایق می‌گویند: آیا پروردگار ما در میان شماست؟ فرشتگان می‌گویند: پروردگار ما منزه است، او در میان ما نیست و در حال آمدن است. و این امر آسمان به آسمان ادامه می‌یابد تا اینکه اهل آسمان هفتم فرود می‌آیند. پس خلقی را می‌بینند که از همه کسانی که فرود آمده‌اند بیشترند. خلایق می‌گویند: آیا پروردگار ما در میان شماست؟ فرشتگان می‌گویند: سُبْحانَ رَبِّنا (پروردگار ما منزه است)، پروردگار ما آمده است و إِنْ كَانَ وَعْدُ رَبِّنَا لَمَفْعُولًا (وعده پروردگار ما قطعاً انجام شدنی است).\n\n[نزول رب (الرب) در سایه‌هایی از ابر]\n\nپس خداوند در ظُلَلٍ مِنَ الْغَمَامِ (سایه‌هایی از ابر) و الْمَلَائِكَةُ (فرشتگان) می‌آید، و جهنم بر سمت چپ عرش قرار دارد. و آمدن او آمدن پادشاه است، زیرا می‌فرماید: مَالِكِ يَوْمِ الدِّينِ (مالک روز جزا)، و آن روز، همین روز است. پس به «ملک» (پادشاه) نامیده شد. و فرشتگان علیهم السلام هفت صف می‌کشند که خلایق را احاطه کرده‌اند. هنگامی که مردم جهنم را می‌بینند که جوشش و خشم بر جباران متکبر دارد، همه خلایق از آن فرار می‌کنند، به دلیل عظمت آنچه می‌بینند، از ترس و وحشت، و آن همان فزع اکبر (وحشت بزرگ) است، مگر گروهی که لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ (وحشت بزرگ آنان را اندوهگین نمی‌سازد) و تَتَلَقَّاهُمُ الْمَلَائِكَةُ هَذَا يَوْمُكُمُ الَّذِي كُنْتُمْ تُوعَدُونَ (و فرشتگان به استقبالشان می‌آیند که این همان روزی است که به شما وعده داده می‌شد). پس آنان همراه با پیامبران بر خود ایمن هستند، جز اینکه پیامبران به دلیل شفقت و مهری که خداوند بر خلقت آنان سرشته است، بر امت‌های خود به فزع می‌افتند و در آن روز می‌گویند: «سالم، سالم» (خدایا نجات ده، نجات ده). و خداوند امر کرده بود که برای بندگان ایمن خود، منبرهایی از نور برپا شود که بر حسب منازلشان در موقف (محل توقف) متفاوت است، پس بر آن‌ها می‌نشینند، ایمن و بشارت داده شده، و این پیش از آمدن خداوند متعال است. هنگامی که مردم از ترس جهنم و وحشت از عظمت هول آن روز فرار می‌کنند، فرشتگان را صف در صف می‌یابند که از آنان نمی‌گذرند. پس فرشتگان، که نگهبانان ملک حق (الحق) سبحانه و تعالی هستند، آنان را به سوی محشر می‌رانند. و پیامبرانشان آنان را ندا می‌دهند: «بازگردید، بازگردید». پس برخی از آنان برخی دیگر را ندا می‌دهند، و این همان قول خداوند متعال است در آنچه رسول خدا (صلی الله علیه و سلم) می‌فرماید: إِنِّي أَخَافُ عَلَيْكُمْ يَوْمَ التَّنَادِ (من بر شما از روز ندا دادن می‌ترسم)، يَوْمَ تُوَلُّونَ مُدْبِرِينَ مَا لَكُمْ مِنَ اللَّهِ مِنْ عَاصِمٍ (روزی که پشت‌کنان روی می‌گردانید و هیچ نگهدارنده‌ای در برابر خدا ندارید). و رسولان می‌گویند: «اللهم سلم سلم» (خدایا نجات ده، نجات ده) و بر امت‌های خود شدیدترین ترس را دارند، و امت‌ها بر خود می‌ترسند. و پاکان و محفوظان، که باطنشان به شبهات گمراه‌کننده و ظاهرشان نیز به مخالفت‌های شرعی آلوده نشده است، ایمن هستند و پیامبران به حال آنان غبطه می‌خورند، به دلیل امنیتی که دارند، در مقابل ترسی که پیامبران بر امت‌های خود دارند.\n\n[سه ندای حق (الحق) در روز موقف]\n\nپس منادی‌ای از جانب خداوند ندا می‌دهد که اهل موقف آن را می‌شنوند. نمی‌دانم آیا آن ندای حق (الحق) سبحانه به ذات خود است یا ندایی از امر او سبحانه. در آن ندا می‌گوید: ای اهل موقف، امروز خواهید دانست که صاحبان کرم چه کسانی هستند. زیرا او به ما فرمود: يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ (ای انسان، چه چیز تو را به پروردگار کریمت مغرور ساخت؟)، تا او را تعلیم دهد و آگاه سازد که بگوید: کرم تو. و من شنیدم که شیخ ما شنخته روزی در حالی که می‌گریست، می‌گفت: ای قوم، با کرم او چنین نکنید. ما را بیرون آورد در حالی که چیزی نبودیم، و آنچه را نمی‌دانستیم به ما آموخت، و از ابتدا بر ما منت نهاد به ایمان به خود و کتاب‌ها و رسولانش، در حالی که ما تعقل نمی‌کردیم. آیا گمان می‌کنید پس از آنکه تعقل کردیم و ایمان آوردیم، ما را عذاب می‌دهد؟ حاشا از کرم او سبحانه از این کار. پس مرا به گریه شادی انداخت و حاضران نیز گریستند. سپس بازمی‌گردیم و می‌گوییم: پس حق (الحق) در آن ندا می‌گوید: کجایند کسانی که تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ (پهلوهایشان از بسترها دور می‌شد)، يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ (پروردگارشان را با ترس و طمع می‌خواندند و از آنچه روزی‌شان داده بودیم انفاق می‌کردند)؟ پس آنان را به سوی بهشت می‌آورند. سپس از جانب حق (الحق) ندای دومی می‌شنوند. نمی‌دانم آیا آن ندای حق (الحق) به ذات خود است یا ندایی از امر حق (الحق): کجایند کسانی که لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ يَخَافُونَ يَوْمًا تَتَقَلَّبُ فِيهِ الْقُلُوبُ وَالْأَبْصَارُ (تجارت و خرید و فروشی آنان را از یاد خدا و برپاداشتن نماز و دادن زکات بازنمی‌داشت، از روزی می‌ترسیدند که دل‌ها و دیده‌ها در آن دگرگون می‌شود)، لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا عَمِلُوا وَيَزِيدَهُمْ مِنْ فَضْلِهِ (تا خداوند آنان را به بهترین آنچه عمل کرده‌اند پاداش دهد و از فضل خود بر آنان بیفزاید). و آن افزایش، چنانکه گفتیم، از باغ‌های اختصاص (جنات الاختصاص) است. پس به سوی بهشت امر می‌شوند. سپس ندای سومی می‌شنوند. نمی‌دانم آیا آن ندای حق (الحق) به ذات خود است یا ندایی از امر حق (الحق): ای اهل موقف، امروز خواهید دانست که صاحبان کرم چه کسانی هستند. کجایند کسانی که صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ (به آنچه با خدا عهد بستند، صادقانه وفا کردند)، لِيَجْزِيَ اللَّهُ الصَّادِقِينَ بِصِدْقِهِمْ (تا خداوند صادقان را به سبب صدقشان پاداش دهد)؟ پس به سوی بهشت امر می‌شوند.\n\n[گردنی که از آتش سر برمی‌آورد و سه ندای آن در روز موقف]\n\nپس از این ندا، گردنی از آتش بیرون می‌آید. هنگامی که بر خلایق سر برآورد، دو چشم و زبانی فصیح دارد که می‌گوید: ای اهل موقف، من از میان شما به سه گروه موکل شده‌ام، همان‌گونه که ندای اول سه بار برای سه گروه از اهل سعادت بود. و این همه پیش از حساب است، در حالی که مردم ایستاده‌اند و عرق آنان را لگام زده و ترس شدید شده و دل‌ها از هول آن صحنه شکافته شده است. پس آن گردن سر برآورده از آتش به آنان می‌گوید: من به هر جبار سرکش موکل شده‌ام. پس آنان را از میان صفوف برمی‌چیند، همان‌گونه که پرنده دانه کنجد را برمی‌چیند. هنگامی که هیچ یک از آنان را در موقف باقی نگذاشت، ندای دومی می‌دهد: ای اهل موقف، من به کسی که خدا و رسولش را آزار داده، موکل شده‌ام. پس آنان را از میان خلایق برمی‌چیند، همان‌گونه که پرنده دانه کنجد را برمی‌چیند. هنگامی که هیچ یک از آنان باقی نماند، ندای سومی می‌دهد: ای اهل موقف، من به کسی که به خلق کردن مانند خلق خدا پرداخته، موکل شده‌ام. پس اهل تصاویر را برمی‌چیند، و آنان کسانی هستند که تصاویری را در کلیساها می‌سازند تا آن تصاویر پرستیده شوند، و کسانی که بت‌ها را می‌سازند، و این همان قول خداوند متعال است: أَ تَعْبُدُونَ مَا تَنْحِتُونَ (آیا آنچه را می‌تراشید، می‌پرستید؟). پس آنان چوب‌ها و سنگ‌ها را برایشان می‌تراشیدند تا آن‌ها را به جای خدا بپرستند. پس اینان همان مصوران هستند. پس آنان را از میان صفوف برمی‌چیند، همان‌گونه که پرنده دانه کنجد را برمی‌چیند. هنگامی که خداوند همه آنان را گرفت، مردم باقی می‌مانند، و در میانشان مصورانی هستند که قصدشان از تصویرسازی، آن پرستشی نبوده که آن گروه قصد داشتند، تا از آنان خواسته شود که در آن‌ها روح بدمند تا زنده شوند، و آنان دمنده نیستند، چنانکه در خبر درباره مصوران آمده است. پس تا هر زمان که خدا بخواهد می‌ایستند و منتظرند که خداوند با آنان چه می‌کند، در حالی که عرق آنان را لگام زده است.\n\n[پنجاه موقف قیامت]\n\nشیخ ما قصار در مکه، سال پانصد و نود و نه، روبروی رکن یمانی کعبه معظمه، که او یونس بن یحیی بن الحسین بن ابی البرکات الهاشمی العباسی است، برای ما از لفظ خود حدیث گفت و من می‌شنیدم. گفت: ابوالفضل محمد بن عمر بن یوسف ارموی برای ما حدیث گفت. گفت: ابوبکر محمد بن علی بن محمد بن موسی بن جعفر، معروف به ابن الخیاط مغربی، برای ما حدیث گفت. گفت: بر ابوسهل محمود بن عمر بن اسحاق عکبری خوانده شد و من می‌شنیدم. به او گفته شد: آیا ابوبکر محمد بن الحسن نقاش برای شما حدیث گفت؟ گفت: بله. ابوبکر گفت: ابوبکر احمد بن الحسین بن علی طبری مروزی برای ما حدیث گفت. گفت: محمد بن حمید رازی ابوعبدالله برای ما حدیث گفت. گفت: سلمه بن صالح گفت: قاسم بن حکم از سلام طویل از غیاث بن مسیب از عبدالرحمن بن غنم و زید بن وهب از عبدالله بن مسعود گفت: نزد علی بن ابی طالب (رضی الله عنه) نشسته بودم و عبدالله بن عباس (رضی الله عنه) نزد او بود و عده‌ای از اصحاب رسول خدا (صلی الله علیه و سلم) اطراف او بودند. پس علی (رضی الله عنه) گفت: رسول خدا (صلی الله علیه و سلم) فرمود: «در قیامت پنجاه موقف است که هر موقفی از آن‌ها هزار سال است. اولین موقف هنگامی است که مردم از گورهایشان خارج می‌شوند، هزار سال بر در گورهایشان می‌ایستند، برهنه، پابرهنه، گرسنه و تشنه. پس هر کس که از گور خود خارج شود در حالی که به پروردگارش، به پیامبرش، به بهشت و دوزخش، به بعث و قیامت، و به قضا و قدر، خیر و شرش، ایمان داشته باشد و آنچه محمد (صلی الله علیه و سلم) از جانب پروردگارش آورده تصدیق کند، نجات یافته، رستگار شده، بهره‌مند گشته و سعادتمند شده است. و هر کس در چیزی از این‌ها شک کند، هزار سال در گرسنگی، تشنگی، اندوه و سختی خود باقی می‌ماند تا خداوند درباره او هر چه بخواهد حکم کند.»\n\n[رانده شدن به سوی ده سرادق (سراپرده) حساب]\n\nسپس از آن مقام به سوی محشر رانده می‌شوند، پس هزار سال بر پاهای خود در سرادق‌های آتش می‌ایستند، در گرمای خورشید، و آتش از سمت راستشان، و آتش از سمت چپشان، و آتش از پیش رویشان، و آتش از پشت سرشان، و خورشید بالای سرشان است، و هیچ سایه‌ای جز سایه عرش نیست. پس هر کس خداوند تبارک و تعالی را ملاقات کند در حالی که برای او به اخلاص شهادت داده، به پیامبرش (صلی الله علیه و سلم) اقرار کرده، از شرک و سحر مبرا باشد، و از ریختن خون مسلمانان مبرا باشد، و خیرخواه خدا و رسولش باشد، و دوستدار کسی باشد که خدا و رسولش را اطاعت کرده، و دشمن کسی باشد که خدا و رسولش را نافرمانی کرده، زیر سایه عرش رحمان سایه می‌گیرد و از اندوه خود نجات می‌یابد. و هر کس از این منحرف شود و در چیزی از این گناهان با یک کلمه بیفتد، یا قلبش تغییر کند، یا در چیزی از دینش شک کند، هزار سال در گرما و غم و عذاب باقی می‌ماند تا خداوند درباره او هر چه بخواهد حکم کند.\n\n[رانده شدن به سوی نور و تاریکی]\n\nسپس خلق به سوی نور و تاریکی رانده می‌شوند و هزار سال در آن تاریکی می‌مانند. پس هر کس خداوند تبارک و تعالی را ملاقات کند در حالی که چیزی را شریک او قرار نداده باشد و چیزی از نفاق وارد قلبش نشده باشد و در چیزی از امر دینش شک نکرده باشد و حق را از جانب خود ادا کرده باشد و حق گفته باشد و با مردم از جانب خود به انصاف رفتار کرده باشد و در نهان و آشکار خدا را اطاعت کرده باشد و به قضای خدا راضی باشد و به آنچه خدا به او داده قناعت کرده باشد، در یک چشم بر هم زدن از تاریکی به سوی نور خارج می‌شود، در حالی که چهره‌اش سفید شده و از همه غم‌ها نجات یافته است. و هر کس در چیزی از این‌ها مخالفت کند، هزار سال در غم و اندوه باقی می‌ماند، سپس با چهره‌ای سیاه از آن خارج می‌شود و در مشیت خداست که با او هر چه بخواهد انجام دهد.\n\n[رانده شدن به سوی ده سرادق (سراپرده) حساب]\n\nسپس خلق به سوی سرادق‌های حساب رانده می‌شوند، و آن‌ها ده سرادق هستند. در هر سرادق هزار سال می‌ایستند. در اولین سرادق از محارم (کارهای حرام) از فرزند آدم سؤال می‌شود. اگر در چیزی از آن‌ها واقع نشده باشد، به سرادق دوم می‌گذرد. در آنجا از هواهای نفسانی سؤال می‌شود. اگر از آن‌ها نجات یافته باشد، به سرادق سوم می‌گذرد. در آنجا از عاق والدین (نافرمانی از پدر و مادر) سؤال می‌شود. اگر عاق نبوده باشد، به سرادق چهارم می‌گذرد. در آنجا از حقوق کسانی که خداوند امورشان را به او سپرده است، و از تعلیم قرآن به آنان، و از امر دینشان و تأدیبشان سؤال می‌شود. اگر این کارها را انجام داده باشد، به سرادق پنجم می‌گذرد. در آنجا از آنچه مالک شده است (بردگان و زیردستان) سؤال می‌شود. اگر به آنان احسان کرده باشد، به سرادق ششم می‌گذرد. در آنجا از حق خویشاوندانش سؤال می‌شود. اگر حقوق آنان را ادا کرده باشد، به سرادق هفتم می‌گذرد. در آنجا از صله رحم سؤال می‌شود. اگر صله‌کننده رحم خود بوده باشد، به سرادق هشتم می‌گذرد. در آنجا از حسد سؤال می‌شود. اگر حسود نبوده باشد، به سرادق نهم می‌گذرد. در آنجا از مکر سؤال می‌شود. اگر به کسی مکر نکرده باشد، به سرادق دهم می‌گذرد. در آنجا از فریب سؤال می‌شود. اگر کسی را فریب نداده باشد، نجات می‌یابد و زیر سایه عرش خداوند متعال فرود می‌آید، چشمش روشن، قلبش شاد و دهانش خندان است. و اگر در چیزی از این خصلت‌ها واقع شده باشد، در هر موقف از آن‌ها هزار سال باقی می‌ماند، گرسنه، تشنه، غمگین، اندوهگین و مهموم، و شفاعت هیچ شفاعت‌کننده‌ای به او سودی نمی‌رساند.\n\n[محشر و پانزده موقف آن]\n\nسپس برای گرفتن نامه‌های اعمالشان با دست راست و چپ محشور می‌شوند. پس در آنجا در پانزده موقف بازداشته می‌شوند که هر موقفی از آن‌ها هزار سال است. در اولین موقف از صدقات و آنچه خداوند بر آنان در اموالشان واجب کرده است، سؤال می‌شود. پس هر کس آن‌ها را کامل ادا کرده باشد، به موقف دوم می‌گذرد. در آنجا از گفتن حق و عفو از مردم سؤال می‌شود. پس هر کس عفو کند، خداوند از او عفو می‌کند و به موقف سوم می‌گذرد. در آنجا از امر به معروف سؤال می‌شود. اگر امرکننده به معروف بوده باشد، به موقف چهارم می‌گذرد. در آنجا از نهی از منکر سؤال می‌شود. اگر نهی‌کننده از منکر بوده باشد، به موقف پنجم می‌گذرد. در آنجا از حسن خلق سؤال می‌شود. اگر خوش‌خلق بوده باشد، به موقف ششم می‌گذرد. در آنجا از حب فی الله و بغض فی الله (دوست داشتن برای خدا و دشمن داشتن برای خدا) سؤال می‌شود. اگر دوستدار برای خدا و دشمن‌دار برای خدا بوده باشد، به موقف هفتم می‌گذرد. در آنجا از مال حرام سؤال می‌شود. اگر چیزی از آن نگرفته باشد، به موقف هشتم می‌گذرد. در آنجا از نوشیدن خمر (شراب) سؤال می‌شود. اگر چیزی از خمر ننوشیده باشد، به موقف نهم می‌گذرد. در آنجا از فروج حرام (روابط جنسی حرام) سؤال می‌شود. اگر مرتکب آن‌ها نشده باشد، به موقف دهم می‌گذرد. در آنجا از قول زور (سخن باطل) سؤال می‌شود. اگر آن را نگفته باشد، به موقف یازدهم می‌گذرد. در آنجا از سوگندهای دروغ سؤال می‌شود. اگر آن‌ها را نخورده باشد، به موقف دوازدهم می‌گذرد. در آنجا از خوردن ربا سؤال می‌شود. اگر آن را نخورده باشد، به موقف سیزدهم می‌گذرد. در آنجا از قذف محصنات (تهمت زدن به زنان پاکدامن) سؤال می‌شود. اگر به زنان پاکدامن تهمت نزده باشد یا به کسی افترا نبسته باشد، به موقف چهاردهم می‌گذرد. در آنجا از شهادت زور (شهادت دروغ) سؤال می‌شود. اگر آن را نداده باشد، به موقف پانزدهم می‌گذرد. در آنجا از بهتان سؤال می‌شود. اگر به مسلمانی بهتان نزده باشد، می‌گذرد و زیر پرچم حمد فرود می‌آید و نامه اعمالش با دست راست به او داده می‌شود و از غم نامه اعمال که برای اوست، نجات می‌یابد و حِسَابًا يَسِيرًا (حسابی آسان) از او گرفته می‌شود. و اگر در چیزی از این گناهان واقع شده باشد و بدون توبه از دنیا رفته باشد، در هر موقف از این پانزده موقف، هزار سال در غم و هول و اندوه و حزن و گرسنگی و تشنگی باقی می‌ماند تا خداوند عز و جل درباره او هر چه بخواهد حکم کند.\n\n[گرفتن نامه‌های اعمال با دست راست و چپ و خواندن آن‌ها]\n\nسپس مردم برای خواندن نامه‌های اعمالشان هزار سال می‌ایستند. پس هر کس که سخاوتمند بوده و مال خود را برای روز فقر و نیاز و تنگدستی‌اش پیش فرستاده باشد، نامه اعمالش را می‌خواند و خواندن آن بر او آسان می‌شود و از جامه‌های بهشت پوشیده می‌شود و تاج‌های بهشت بر سرش گذاشته می‌شود و زیر سایه عرش رحمان می‌نشیند، ایمن و مطمئن. و اگر بخیل بوده و مال خود را برای روز فقر و تنگدستی‌اش پیش نفرستاده باشد، كِتَابَهُ بِشِمَالِهِ (نامه اعمالش با دست چپ) به او داده می‌شود و از قطعات آتش برای او بریده می‌شود و هزار سال بر سر خلایق در گرسنگی و تشنگی و برهنگی و غم و اندوه و حزن و رسوایی می‌ایستد تا خداوند عز و جل درباره او هر چه بخواهد حکم کند.\n\n[محشور شدن به سوی میزان (ترازو)]\n\nسپس مردم به سوی میزان محشور می‌شوند و هزار سال نزد میزان می‌ایستند. پس هر کس که کفه میزانش با حسناتش سنگین شود، در یک چشم بر هم زدن رستگار و نجات یافته است. و هر کس که کفه میزانش از حسنات سبک شود و سیئاتش سنگین گردد، هزار سال نزد میزان در غم و اندوه و حزن و عذاب و گرسنگی و تشنگی بازداشته می‌شود تا خداوند درباره او هر چه بخواهد حکم کند.\n\n[ایستادن در برابر خداوند در دوازده موقف]\n\nسپس خلق به سوی موقف در برابر خداوند در دوازده موقف فراخوانده می‌شوند که هر موقفی از آن‌ها به اندازه هزار سال است. در اولین موقف از آزاد کردن بردگان سؤال می‌شود. اگر برده‌ای آزاد کرده باشد، خداوند گردن او را از آتش آزاد می‌کند و به موقف دوم می‌گذرد. در آنجا از قرآن و حق آن و قرائت آن سؤال می‌شود. اگر آن را کامل آورده باشد، به موقف سوم می‌گذرد. در آنجا از جهاد سؤال می‌شود. اگر در راه خدا با احتساب (برای رضای خدا) جهاد کرده باشد، به موقف چهارم می‌گذرد. در آنجا از غیبت سؤال می‌شود. اگر غیبت نکرده باشد، به موقف پنجم می‌گذرد. در آنجا از نمامی (سخن‌چینی) سؤال می‌شود. اگر سخن‌چین نبوده باشد، به موقف ششم می‌گذرد. در آنجا از دروغ سؤال می‌شود. اگر دروغگو نبوده باشد، به موقف هفتم می‌گذرد. در آنجا از طلب علم سؤال می‌شود. اگر علم طلب کرده و به آن عمل کرده باشد، به موقف هشتم می‌گذرد. در آنجا از عجب (خودپسندی) سؤال می‌شود. اگر در دین و دنیای خود یا در چیزی از عملش خودپسند نبوده باشد، به موقف نهم می‌گذرد. در آنجا از تکبر سؤال می‌شود. اگر بر کسی تکبر نکرده باشد، به موقف دهم می‌گذرد. در آنجا از ناامیدی از رحمت خدا سؤال می‌شود. اگر از رحمت خدا ناامید نشده باشد، به موقف یازدهم می‌گذرد. در آنجا از ایمنی از مکر خدا سؤال می‌شود. اگر از مکر خدا ایمن نشده باشد، به موقف دوازدهم می‌گذرد. در آنجا از حق همسایه‌اش سؤال می‌شود. اگر حق همسایه‌اش را ادا کرده باشد، در برابر خداوند متعال برپا داشته می‌شود، چشمش روشن، قلبش شاد، چهره‌اش سفید، پوشیده، خندان و شادمان. پس پروردگارش به او خوشامد می‌گوید و او را به رضایت خود بشارت می‌دهد. پس در آن هنگام چنان شاد می‌شود که هیچ کس جز خدا نمی‌داند. و اگر یکی از آن‌ها را کامل نیاورده باشد و بدون توبه مرده باشد، در هر موقف هزار سال بازداشته می‌شود تا خداوند عز و جل درباره او هر چه بخواهد حکم کند.\n\n[صراطی که پل‌ها بر روی جهنم بر آن زده شده است]\n\nسپس خلایق به سوی صراط امر می‌شوند. پس به صراط می‌رسند، در حالی که پل‌هایی بر روی جهنم بر آن زده شده است، که از مو باریک‌تر و از شمشیر تیزتر است. و پل‌ها به اندازه چهل هزار سال در جهنم فرو رفته‌اند و شعله جهنم در کنار آن زبانه می‌کشد. و بر آن خارهای بزرگ و قلاب‌ها و چنگک‌ها قرار دارد. و آن هفت پل است. همه بندگان بر روی آن محشور می‌شوند و بر هر پل از آن‌ها گردنه‌ای است به مسافت سه هزار سال: هزار سال سربالایی، هزار سال همواری، و هزار سال سرازیری. و این همان قول خداوند عز و جل است: إِنَّ رَبَّكَ لَبِالْمِرْصَادِ (همانا پروردگار تو در کمینگاه است)، یعنی بر روی آن پل‌ها. و فرشتگانی هستند که خلایق را بر روی آن رصد می‌کنند تا از بنده درباره ایمان به خدا سؤال شود. اگر آن را مؤمنانه و مخلصانه، بدون شک و انحراف، آورده باشد، به پل دوم می‌گذرد. در آنجا از نماز سؤال می‌شود. اگر آن را کامل آورده باشد، به پل سوم می‌گذرد. در آنجا از زکات سؤال می‌شود. اگر آن را کامل آورده باشد، به پل چهارم می‌گذرد. در آنجا از روزه سؤال می‌شود. اگر آن را کامل آورده باشد، به پل پنجم می‌گذرد. در آنجا از حج اسلام سؤال می‌شود. اگر آن را کامل آورده باشد، به پل ششم می‌گذرد. در آنجا از طهارت (پاکیزگی) سؤال می‌شود. اگر آن را کامل آورده باشد، به پل هفتم می‌گذرد. در آنجا از مظالم (حقوق مردم) سؤال می‌شود. اگر به کسی ظلم نکرده باشد، به سوی بهشت می‌گذرد. و اگر در یکی از آن‌ها کوتاهی کرده باشد، در هر پل از آن‌ها هزار سال بازداشته می‌شود تا خداوند عز و جل درباره او هر چه بخواهد حکم کند. و حدیث تا آخرش ذکر شد.\n\nو بقیه حدیث ان‌شاءالله در باب بهشت خواهد آمد، زیرا به بهشت اختصاص دارد. و ما نشأه (النشأة) دیگری را که انسان در آن محشور می‌شود، در باب برزخ ذکر نکردیم، زیرا آن نشأه‌ای محسوس است و خیالی نیست، و قیامت امری محقق، موجود و حسی است، همانند حال انسان در دنیا. به همین دلیل ذکر آن را به این باب موکول کردیم.\n\n[وصل] [در حشر و نشر]\n\n[اختلاف مردم در اعاده (بازگشت) از میان مؤمنان]\n\nبدان که مردم در مورد اعاده (بازگشت) از میان مؤمنانی که قائل به حشر اجسام هستند، اختلاف کرده‌اند. و ما به مذهب کسانی که اعاده و نشأه (النشأة) آخرت را بر امور عقلی غیر محسوس حمل می‌کنند، نمی‌پردازیم، زیرا این خلاف واقعیت امر است. چرا که او ندانسته است که دو نشأه (النشأة) وجود دارد: نشأه اجسام و نشأه ارواح، که همان نشأه معنوی است. پس آنان نشأه معنوی را اثبات کردند و نشأه محسوس را اثبات نکردند. و ما به آنچه این مخالف گفته است، یعنی اثبات نشأه روحانی معنوی، قائل هستیم، نه به آنچه در آن مخالفت کرده است. و اینکه عین مرگ انسان، قیامت اوست، اما قیامت صغری.\n\nزیرا پیامبر (صلی الله علیه و سلم) می‌فرماید: «مَنْ مَاتَ فَقَدْ قَامَتْ قِيَامَتُهُ» (هر کس بمیرد، قیامت او برپا شده است).\n\nو اینکه حشر، جمع شدن نفوس جزئی به سوی نفس کلی است. من به همه این‌ها قائل هستم، همان‌گونه که مخالف می‌گوید. و سخن او در مورد قیامت تا اینجا پایان می‌یابد. و در همین مورد، کسانی که قائل به تناسخ هستند و کسانی که قائل نیستند، اختلاف می‌کنند. و همه آن‌ها عاقل و اهل نظر هستند و در این باره به ظواهر آیاتی از کتاب و اخباری از سنت استدلال می‌کنند. اگر آن‌ها را بیاوریم و درباره‌شان سخن بگوییم، باب در خوض با آنان برای تحقیق آنچه گفته‌اند، طولانی می‌شود. و هیچ یک از آنان نحل (عقیده‌ای) را در این باره نپذیرفته است، مگر اینکه وجه حقی صحیح دارد، و قائل به آن، بخشی از مراد شارع را فهمیده است و علم آنچه را که دیگری فهمیده است، یعنی اثبات حشر محسوس در اجسام محسوس، و میزان محسوس، و صراط محسوس، و آتش و بهشت محسوس، کم دارد. همه این‌ها حق است و در قدرت (الهی) عظیم‌تر است.\n\n[علم طبیعت، بقای اجسام طبیعی را تا مدت نامتناهی نفی نمی‌کند]\n\nو در علم طبیعت، بقای اجسام طبیعی در دو سرا (دنیا و آخرت) تا مدت نامتناهی، بلکه وجودی مستمر، وجود دارد. و مردم از امر طبیعت نشناخته‌اند مگر به اندازه‌ای که حق (الحق) آنان را بر آن آگاه ساخته است، از آنچه در مدت حرکات افلاک و کواکب هفت‌گانه برایشان آشکار شده است. و به همین دلیل، عمر طبیعی را صد و بیست سال قرار دادند که این حکم آن را اقتضا کرده است. پس اگر انسان از این مدت فراتر رود، وارد عمر مجهول می‌شود، هرچند که از طبیعت است و از آن خارج نشده است، اما در توان علم او نیست که وقت مشخصی را برای آن تعیین کند. پس همان‌گونه که از عمر طبیعی یک سال و بیشتر فراتر رفت، جایز است که هزاران سال بر آن بیفزاید و جایز است که عمرش دائماً امتداد یابد. و اگر شرع، ما را به پایان مدت این دنیا و اینکه هر نفسی چشنده مرگ است، و به اعاده (بازگشت) و به دار آخرت، و به اینکه اقامت در آن در نشأه (النشأة) آخرت تا بی‌نهایت است، آگاه نساخته بود، ما این را نمی‌دانستیم. و ما در هر حال، از مرگ و اقامت و بعث اخروی و نشأه (النشأة) دیگر و بهشت‌ها و نعمت و آتش و عذاب با خوردن محسوس و نوشیدن محسوس و نکاح محسوس و لباس بر مجرای طبیعی خارج نمی‌شویم. پس علم خدا وسیع‌تر و کامل‌تر است و جمع بین عقل و حس و عقول و محسوسات در قدرت (الهی) عظیم‌تر و در کمال الهی کامل‌تر است تا حکم عالم غیب و شهود برای او سبحانه در هر صنفی از ممکنات مستمر باشد و حکم اسم ظاهر و باطن در هر صنف ثابت شود.\n\n[معاد - یعنی حشر - جسمانی و روحانی است]\n\nپس اگر فهمیدی، موفق شده‌ای و می‌دانی که علمی که پیامبران و مؤمنان از جانب حق (الحق) بر آن آگاه شده‌اند، تعلق عام‌تری دارد تا علم کسانی که تنها به آنچه عقول مجرد از فیض الهی اقتضا می‌کنند، اکتفا کرده‌اند. پس برای هر خیرخواه نفس خود، بهتر است که به آنچه انبیا و رسولان گفته‌اند، بر هر دو وجه معقول و محسوس، بازگردد. زیرا هیچ دلیلی برای عقل وجود ندارد که آنچه شرایع آورده‌اند را بر تأویل اثبات‌کنندگان محسوس و معقول، محال بداند. پس حکم امکان باقی است و مرجح موجود است. پس به چه چیزی محال می‌داند؟ و چه نیکو گفته است گوینده:\n\nزعم المنجم والطبيب كلاهما *** لا تبعث الأجسام قلت إليكما\nإن صح قولكما فلست بخاسر *** أو صح قولي فالخسار عليكما\n\nمنجم و طبیب هر دو گمان کردند *** که اجسام برانگیخته نمی‌شوند، گفتم: به سوی شما (می‌آیم).\nاگر سخن شما درست باشد، من زیانکار نیستم *** و اگر سخن من درست باشد، زیان بر شماست.\n\nو قول او «فالخسار عليكما» (زیان بر شماست) به این دلیل است که به ظاهر آنچه رسولان علیهم السلام برایشان آورده‌اند، ایمان نیاورده‌اند. و قول او «فلست بخاسر» (من زیانکار نیستم) به این دلیل است که من نیز مانند شما به امور معنوی معقول ایمان دارم و امری دیگر را بر شما افزوده‌ام که شما به آن ایمان نیاورده‌اید. و گوینده قصد نداشته است که با قول خود «إن صح» (اگر درست باشد) شک کند، بلکه این بر مذهب تو ای مخاطب است. و این‌گونه تعابیر زیاد به کار می‌رود. پس در این سخن من تدبر کن و ایمان را بر خود لازم بدار تا ان‌شاءالله سود ببری و سعادتمند شوی.\n\n[چگونگی اعاده - معاد - و حشر و نشر]\n\nو پس از آنکه این مقرر شد، بدان که اختلافی که میان مؤمنان قائل به حس و محسوس در این باره رخ داده است، تنها به چگونگی اعاده (بازگشت) برمی‌گردد. پس برخی از آنان بر این رفته‌اند که اعاده در مردم مانند آغاز خلقتشان خواهد بود، با نکاح و تناسل و آغاز خلقت از گِل و دمیدن، همان‌گونه که در خلقت آدم و حوا و سایر فرزندان از نکاح و اجتماع تا آخرین مولود در عالم بشری انسانی رخ داد. و همه این‌ها در زمانی کوچک و مدتی کوتاه خواهد بود، بر حسب آنچه حق (الحق) تعالی مقدر می‌کند. شیخ ابوالقاسم بن قسی در کتاب *خلع النعلین* خود چنین پنداشته است، در مورد قول خداوند متعال: كَمَا بَدَأَكُمْ تَعُودُونَ (همان‌گونه که شما را آغاز کرد، بازمی‌گردید). پس نمی‌دانم آیا این مذهب اوست یا قصد شرح سخن‌گوی آن را داشته است، که او خلف خدا بود که آن سخن را آورد و از امّیون بود. و برخی گفته‌اند که بر اساس خبر روایت شده، آسمان بارانی شبیه منی می‌باراند که زمین با آن خمیر می‌شود و نشأه (النشأة) آخرت از آن برمی‌خیزد. اما قول خداوند متعال نزد ما: كَمَا بَدَأَكُمْ تَعُودُونَ، همان قول اوست: وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى فَلَوْلَا تَذَكَّرُونَ (و قطعاً نشأه اول را دانستید، پس چرا متذکر نمی‌شوید؟) و قول او: كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا (همان‌گونه که اولین خلق را آغاز کردیم، آن را بازمی‌گردانیم، وعده‌ای بر عهده ما). و ما دانستیم که خداوند متعال نشأه اول را بدون مثال قبلی ایجاد کرد. پس نشأه آخرت نیز همین‌گونه است، خداوند متعال آن را بدون مثال قبلی ایجاد می‌کند، با وجود اینکه بدون شک محسوس است. و رسول خدا (صلی الله علیه و سلم) از صفت نشأه اهل بهشت و دوزخ چیزی را ذکر کرده است که با آنچه این نشأه دنیا بر آن است، متفاوت است. پس دانستیم که این به عدم وجود مثال قبلی برمی‌گردد که نشأه را بر آن ایجاد کند، و این در قدرت (الهی) عظیم‌تر است. و اما قول او: وَهُوَ أَهْوَنُ عَلَيْهِ (و آن بر او آسان‌تر است)، به آنچه گفتیم خدشه‌ای وارد نمی‌کند. زیرا اگر نشأه اول از اختراع فکر و تدبر و نظر بود، اعاده آن به این صورت که خلقی دیگر را بیافریند که به آن نزدیک باشد و بر آن بیفزاید، برای کسی که امور را با فکر خود به دست می‌آورد، به اختراع و احضار نزدیک‌تر بود. و خداوند از این منزه و متعالی است، تعالی بزرگی. اوست که به عالم افاضه می‌کند و از آن استفاده نمی‌کند و علم جدیدی برای او حاصل نمی‌شود، بلکه او به تفصیل آنچه نامتناهی است، با علم کلی عالم است. پس علم تفصیل در عین اجمال است. و شایسته جلال اوست که چنین باشد.\n\n[عجب الذنب (دنبالچه) که نشأه انسانی بر آن استوار است و کهنه نمی‌شود]\n\nپس خداوند نشأه آخرت را بر عجب الذنب (دنبالچه) که از این نشأه دنیا باقی می‌ماند و اصل آن است، ایجاد می‌کند. پس نشأه آخرت بر آن ترکیب می‌شود. اما ابوحامد (غزالی) دیده است که عجب الذنب مذکور در خبر، همان نفس است و نشأه آخرت بر آن برمی‌خیزد. و دیگری مانند ابوزید رقراقی گفته است که آن جوهر فردی است که از این نشأه دنیا باقی می‌ماند و تغییر نمی‌کند و نشأه دیگر بر آن برمی‌خیزد. و همه این‌ها محتمل است و به هیچ یک از اصول خدشه وارد نمی‌کند، بلکه همه آن‌ها توجیهات معقولی هستند که هر توجیهی از آن‌ها احتمال دارد که مقصود باشد. و آنچه با کشف (الکشف) برای من حاصل شد که در آن شک ندارم، این است که مراد از عجب الذنب، همان چیزی است که نشأه بر آن استوار است و کهنه نمی‌شود، یعنی فساد نمی‌پذیرد.\n\n[دو نفخه و شعله‌ور شدن صور برزخی با ارواحشان]\n\nپس هنگامی که خداوند نشأه آخرت را ایجاد کرد و آن را تسویه و تعدیل نمود، هرچند که آن‌ها عیناً همان جواهر هستند، زیرا ذات‌هایی که از عدم به وجود آمده‌اند، عینیتشان پس از وجود از بین نمی‌رود، بلکه صور در آن‌ها به واسطه امتزاج‌ها متفاوت می‌شوند. و امتزاج‌هایی که این صور را می‌دهند، اعراضی هستند که به تقدیر عزیز علیم بر آن‌ها عارض می‌شوند. پس هنگامی که این صور آماده شدند، مانند گیاه خشک شده‌ای هستند که آماده پذیرش ارواح است، مانند آمادگی گیاه با ناریتی که در آن است برای پذیرش شعله‌ور شدن. و صور برزخی مانند چراغ‌هایی هستند که با ارواحی که در آن‌هاست، شعله‌ورند. پس اسرافیل یک نفخه می‌دمد، و آن نفخه بر آن صور برزخی می‌گذرد و آن‌ها را خاموش می‌کند. و نفخه بعدی، که نفخه دیگر است، بر صورت آماده برای شعله‌ور شدن، که همان نشأه آخرت است، می‌گذرد، پس با ارواحشان شعله‌ور می‌شوند. فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ (پس ناگهان آنان ایستاده‌اند و می‌نگرند). پس آن صور زنده و گویا برمی‌خیزند به آنچه خداوند آنان را به آن گویا می‌سازد. پس برخی به حمد خدا گویا هستند و برخی می‌گویند: مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا (چه کسی ما را از خوابگاهمان برانگیخت؟) و برخی می‌گویند: منزه است کسی که ما را پس از آنکه میراند، زنده کرد و إِلَيْهِ النُّشُورُ (و بازگشت به سوی اوست). و هر گوینده‌ای بر حسب علم خود و آنچه بر آن بوده است، سخن می‌گوید و حال خود را در برزخ فراموش می‌کند و گمان می‌کند که آنچه در آن بوده، خواب بوده است، همان‌گونه که بیدار شده گمان می‌کند. در حالی که او هنگامی که مرد و به برزخ منتقل شد، در آنجا مانند بیدار بود و زندگی دنیا برای او مانند خواب بود.\n\n[امر دنیا خواب در خواب است و سرای آخرت همان حیات است]\n\nو در آخرت، امر دنیا و برزخ را خواب در خواب می‌داند و اینکه بیداری صحیح همان است که او در دار آخرت بر آن است. و او در آن حال می‌گوید که انسان در دنیا در خواب بود، سپس با مرگ به برزخ منتقل شد، پس در آنجا به منزله کسی بود که در خواب می‌بیند که از خواب بیدار شده است. سپس پس از آن، نشأه (النشأة) آخرت، بیداری‌ای است که در آن خوابی نیست و پس از آن نیز برای اهل سعادت خوابی نیست، اما برای اهل آتش در آن راحتی است، چنانکه پیشتر گفتیم. و رسول خدا (صلی الله علیه و سلم) فرمود: «النَّاسُ نِيَامٌ فَإِذَا مَاتُوا انْتَبَهُوا» (مردم خوابند، پس هنگامی که بمیرند، بیدار می‌شوند).\n\nپس دنیا نسبت به برزخ، خواب و منام است، زیرا برزخ به امر حق (الحق) نزدیک‌تر است، پس به بیداری سزاوارتر است. و برزخ نسبت به نشأه (النشأة) دیگر، یعنی روز قیامت، خواب است. پس این را بدان.\n\n[شفاعت عظمی (بزرگ) اولین و آخرین]\n\nپس هنگامی که مردم برخاستند و زمین کشیده شد و انْشَقَّتِ السَّمَاءُ (آسمان شکافته شد) و ستارگان تیره شدند و خورشید درهم پیچیده شد و خَسَفَ الْقَمَرُ (ماه گرفته شد) و وحوش محشور شدند و دریاها شعله‌ور گشتند و نفوس با بدن‌هایشان جفت شدند و فرشتگان عَلَى أَرْجَائِهَا (بر اطراف آن)، یعنی اطراف آسمان‌ها، فرود آمدند و پروردگار ما در ظُلَلٍ مِنَ الْغَمَامِ (سایه‌هایی از ابر) آمد و منادی ندا داد: ای اهل سعادت، و سه گروهی که ذکر کردیم از آنان گرفته شدند و گردن از آتش بیرون آمد و سه گروهی که ذکر کردیم را قبض کرد و مردم به موج افتادند و گرما شدید شد و عرق مردم را لگام زد و کار بزرگ شد و امر عظیم گشت و بهت فرا رسید، فَلَا تَسْمَعُ إِلَّا هَمْسًا (پس نمی‌شنوی مگر زمزمه‌ای)، و جهنم آورده شد و ایستادن مردم طولانی شد و ندانستند که حق (الحق) با آنان چه می‌خواهد بکند.\n\nپس رسول خدا (صلی الله علیه و سلم) فرمود: «مردم به یکدیگر می‌گویند: بیایید نزد پدرمان آدم برویم و از او بخواهیم که از خدا برای ما بخواهد تا ما را از آنچه در آن هستیم راحت کند، زیرا ایستادن ما طولانی شده است.» پس نزد آدم می‌آیند و این را از او می‌خواهند. آدم می‌گوید: «امروز خداوند چنان غضب کرده است که پیش از این مانند آن غضب نکرده و پس از این نیز مانند آن غضب نخواهد کرد.» و خطای خود را ذکر می‌کند و از پروردگارش شرم می‌کند که از او بخواهد. پس نزد نوح می‌آیند و همین را می‌خواهند. او نیز مانند آدم به آنان می‌گوید و دعای خود را بر قومش و قول خود را ذکر می‌کند: وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا (و جز فاجر و کافر نزاید). پس محل مؤاخذه بر او، قول اوست: وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا، نه نفس دعای او بر آنان از جهت دعا بودن. سپس نزد ابراهیم علیه السلام می‌آیند و همین را می‌گویند. پس مانند کسانی که پیش از او بودند، به آنان پاسخ می‌دهد و سه دروغ خود را ذکر می‌کند. سپس نزد موسی و عیسی می‌آیند و به هر یک از رسولان همان را می‌گویند که به آدم گفتند. پس مانند جواب آدم به آنان پاسخ می‌دهند. پس نزد محمد (صلی الله علیه و سلم) می‌آیند، و او سید مردم در روز قیامت است. پس به او همان را می‌گویند که به پیامبران گفتند. محمد (صلی الله علیه و سلم) می‌گوید: «من برای آن هستم.» و آن همان مقام محمود (المقام المحمود) است که خداوند در روز قیامت به او وعده داده است. پس می‌آید و سجده می‌کند و خدا را با ستایش‌هایی حمد می‌کند که خداوند در آن وقت به او الهام می‌کند و پیش از آن به آن‌ها علم نداشته است. سپس نزد پروردگارش شفاعت می‌کند که باب شفاعت را برای خلق بگشاید. پس خداوند آن باب را می‌گشاید و به فرشتگان و رسولان و پیامبران و مؤمنان اجازه شفاعت می‌دهد.\n\nپس به این دلیل، او سید مردم در روز قیامت است، زیرا نزد خدا شفاعت کرد که فرشتگان و رسولان شفاعت کنند.\n\n[سرور مردم در روز قیامت]\n\nبا این حال، او (صلی الله علیه و سلم) ادب ورزید و گفت: «من سید مردم هستم» و نگفت «سید خلایق»، تا فرشتگان در آن داخل شوند، با وجود ظهور سلطنت او در آن روز بر همگان. و این بدان دلیل است که مقامات همه پیامبران علیهم السلام برای او جمع شده است، و آنچه برای آدم علیه السلام بر فرشتگان ظاهر شد، یعنی اختصاص او به علم همه اسماء، برای او بر فرشتگان ظاهر نشده بود. پس هنگامی که در آن روز، همه از فرشتگان و مردم، از آدم و پایین‌تر، به او نیازمند شدند در گشودن باب شفاعت و آشکار شدن جاه او نزد خدا، زیرا قهر الهی و جبروت اعظم همه را خاموش کرده بود، و این مقام مانند مقام آدم علیه السلام و عظیم‌تر بود در روزی که نیاز شدید بود، با وجود ذکر غضب الهی که حق (الحق) در آن روز در آن تجلی (التجلی) کرد و چنین صفتی در قضیه آدم رخ نداده بود. پس این مجموعه دلالت بر عظمت قدر او (صلی الله علیه و سلم) دارد، زیرا با وجود این صفت غضبی الهی، بر مناجات حق (الحق) در آنچه درخواست کرد، اقدام نمود.\n\n[تجلی حق (الحق) در روز قیامت در پایین‌ترین صورت]\n\nپس حق (الحق) سبحانه به او پاسخ داد. پس میزان‌ها آویخته شد و نامه‌های اعمال منتشر گشت و صراط نصب شد و شفاعت آغاز گردید. پس اولین کسانی که شفاعت کردند، فرشتگان بودند، سپس پیامبران، سپس مؤمنان. و ارحم الراحمین (مهربان‌ترین مهربانان) باقی ماند. و در اینجا تفصیل عظیمی است که سخن در آن طولانی می‌شود، زیرا مقام عظیمی است. اما حق (الحق) در آن روز تجلی (التجلی) می‌کند و می‌گوید: «هر امتی آنچه را می‌پرستید، دنبال کند.» تا اینکه این امت باقی می‌ماند و منافقانش در میان آن هستند. پس حق (الحق) برای آنان در پایین‌ترین صورتی از صور که پیش از آن برایشان تجلی کرده بود، تجلی می‌کند. پس می‌گوید: «من پروردگار شما هستم.» آنان می‌گویند: «به خدا از تو پناه می‌بریم. ما منتظریم تا پروردگارمان بیاید.» پس جل و تعالی به آنان می‌گوید: «آیا میان شما و او علامتی هست که او را با آن بشناسید؟» می‌گویند: «بله.» پس برای آنان به صورتی که او را با آن علامت شناخته‌اند، تبدیل می‌شود. پس می‌گویند: «تو پروردگار ما هستی.» پس به آنان امر می‌کند که سجده کنند. پس هیچ کس که برای خدا سجده می‌کرده است، باقی نمی‌ماند مگر اینکه سجده می‌کند. و هر کس که از روی ریا و خودنمایی سجده می‌کرده است، خداوند پشت او را لایه‌ای از مس قرار می‌دهد که هرگاه بخواهد سجده کند، بر پشت خود می‌افتد. و این همان قول اوست: يَوْمَ يُكْشَفُ عَنْ سَاقٍ وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ (روزی که ساق (امر عظیم) آشکار می‌شود و به سجده فراخوانده می‌شوند، پس نمی‌توانند)... وَقَدْ كَانُوا يُدْعَوْنَ إِلَى السُّجُودِ وَهُمْ سَالِمُونَ (در حالی که در دنیا به سجده فراخوانده می‌شدند و سالم بودند). و ساق (الساق) که برای آنان آشکار شد، تعبیری است از امر عظیمی از هول‌های روز قیامت. عرب می‌گوید: «جنگ ساق خود را آشکار کرد» هنگامی که جنگ شدید شود و امر آن عظیم گردد. و همچنین الْتَفَّتِ السَّاقُ بِالسَّاقِ (ساق به ساق پیچیده شد)، یعنی هول‌ها و امور عظیم روز قیامت در هم داخل شدند.\n\n[توحید عقلی و توحید شرعی و ورود به بهشت]\n\nپس هنگامی که شفاعت واقع شد و هیچ مؤمن شرعی‌ای اصلاً در آتش باقی نماند، و نه کسی که عملی مشروع را از حیث مشروع بودن آن به زبان پیامبری انجام داده باشد، حتی اگر مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ (به اندازه وزن دانه خردلی) یا کوچک‌تر از آن باشد، مگر اینکه با شفاعت پیامبران و مؤمنان خارج می‌شود. و اهل توحید (التوحید) باقی می‌مانند، کسانی که توحید را با دلایل عقلی دانستند و چیزی را شریک خدا قرار ندادند و ایمان شرعی نیاوردند و هیچ کار خیری را از حیث پیروی از پیامبری انجام ندادند. پس نزد آنان ذره‌ای ایمان و کمتر از آن نبود. پس ارحم الراحمین (مهربان‌ترین مهربانان) آنان را خارج می‌کند. و «هیچ کار خیری انجام ندادند» یعنی کار مشروعی از حیث مشروع بودن آن، و هیچ خیری عظیم‌تر از ایمان نیست و آنان آن را انجام ندادند. و این حدیث عثمان بن عفان در صحیح مسلم بن حجاج است که رسول خدا (صلی الله علیه و سلم) فرمود: «مَنْ مَاتَ وَهُوَ يَعْلَمُ» (هر کس بمیرد در حالی که می‌داند) - و نگفت «ایمان دارد» - «أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ» (که هیچ معبودی جز خدا نیست، وارد بهشت می‌شود).\n\nو نگفت «می‌گوید»، بلکه علم را به تنهایی ذکر کرد. پس در مورد اینان، عنایت خدا در آتش پیشی می‌گیرد. زیرا آتش به ذات خود، تخلید موحد خدا را به هیچ وجهی نمی‌پذیرد، و کامل‌ترین وجوه آن، ایمان از روی علم است، پس علم و ایمان را جمع کرده است. اگر بگویی: ابلیس می‌داند که خدا واحد است. می‌گوییم: راست گفتی، اما او اولین کسی است که شرک را سنت نهاد، پس گناه مشرکان بر عهده اوست و گناه آنان این است که از آتش خارج نمی‌شوند. این در صورتی است که ثابت شود او موحد مرده است. و تو چه می‌دانی؟ شاید او به دلیل شبهه‌ای که در نظرش عارض شده، مشرک مرده باشد. و سخن درباره این مسئله در باب‌های گذشته گذشت. پس ابلیس از آتش خارج نمی‌شود. و خداوند می‌داند که کدام یک از این‌ها بوده است. و در اینجا علوم بسیاری است و ذکر آن‌ها طولانی می‌شود و ما را از مقصود اختصار خارج می‌کند. اما با این حال، ناگزیر باید چکیده‌ای از هر موطن مشهور از مواطن قیامت را ذکر کنیم، مانند عرض (ارائه اعمال)، گرفتن نامه‌های اعمال، میزان، صراط، اعراف، ذبح مرگ، و مأدبه (سفره) که در میدان بهشت خواهد بود. پس این‌ها هفت موطن هستند و نه بیشتر، و آن‌ها مادران هفت بابی هستند که برای آتش و هفت بابی که برای بهشت است. زیرا باب هشتم، باب بهشت رؤیت (دیدار) است و آن همان باب بسته‌ای است که در آتش است و آن باب حجاب است و هرگز گشوده نمی‌شود، زیرا اهل آتش محجوب از پروردگارشان هستند.\n\n[وصل: هفت موطن مادر در روز قیامت]\n\n[موطن اول: عرض (ارائه اعمال)]\n\nدر خبر آمده است که از رسول خدا (صلی الله علیه و سلم) درباره قول خداوند متعال: فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا (پس به زودی حسابی آسان از او گرفته می‌شود) سؤال شد. فرمود: «آن عرض (ارائه اعمال) است ای عایشه. هر کس در حسابش مناقشه شود، عذاب می‌بیند.»\n\nو آن مانند عرض (سان دیدن) لشکر است، یعنی ارائه اعمال، نه به دلیل اینکه لباس اهل موقف باشد. و خداوند پادشاه است، پس يُعْرَفُ الْمُجْرِمُونَ بِسِيمَاهُمْ (مجرمان با نشانه‌هایشان شناخته می‌شوند)، همان‌گونه که سربازان در اینجا با لباسشان شناخته می‌شوند.\n\n[موطن دوم: نامه‌های اعمال]\n\nخداوند متعال می‌فرماید: اقْرَأْ كِتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا (نامه اعمالت را بخوان، امروز خودت برای حسابرسی خود کافی هستی). و فرمود: فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ (اما کسی که نامه اعمالش به دست راستش داده شود)، و او مؤمن سعادتمند است، و أَمَّا مَنْ أُوتِيَ كِتَابَهُ بِشِمَالِهِ (و اما کسی که نامه اعمالش به دست چپش داده شود)، و او منافق است. زیرا کافر نامه اعمالی ندارد. منافق ایمان از او سلب شده است، اما اسلام از او گرفته نشده است. پس درباره منافق گفته شد: إِنَّهُ كَانَ لَا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ (او به خداوند بزرگ ایمان نمی‌آورد). پس معطل (منکر وجود خدا)، مشرک و متکبر بر خدا در آن داخل می‌شوند. و به اسلام نپرداخت، زیرا منافق ظاهراً تسلیم می‌شود تا مال و خانواده و خون خود را حفظ کند، در حالی که در باطن یکی از این سه گروه است. و ما گفتیم که این آیه هر سه را شامل می‌شود، زیرا قول او: لَا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ به معنای تصدیق نکردن خداست. و کسانی که خدا را تصدیق نمی‌کنند، دو گروهند: گروهی که وجود خدا را تصدیق نمی‌کنند و آن‌ها معطله هستند، و گروهی که توحید خدا را تصدیق نمی‌کنند و آن‌ها مشرکان هستند. و قول او «العظیم» در این آیه، متکبر بر خدا را نیز شامل می‌شود، زیرا اگر عظمت خدا را که شایسته کسی است که «الله» نامیده می‌شود، باور می‌داشت، بر او تکبر نمی‌کرد. و این سه گروه، به همراه این منافق که با وصف خاصی از آنان متمایز شده است، اهل آتش هستند که اهل آنند. و أَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ (و اما کسی که نامه اعمالش از پشت سرش به او داده شود)، آنان کسانی هستند که کتاب (آسمانی) به آنان داده شد، فَنَبَذُوهُ وَرَاءَ ظُهُورِهِمْ وَاشْتَرَوْا بِهِ ثَمَنًا قَلِيلًا (پس آن را پشت سر خود انداختند و به بهای اندکی فروختند). پس هنگامی که روز قیامت شود، به او گفته می‌شود: آن را از پشت سرت بگیر، یعنی از همان جایی که در زندگی دنیوی‌ات آن را انداختی. پس آن کتاب نازل شده بر آنان است، نه نامه اعمال. زیرا هنگامی که آن را پشت سر خود انداخت، ظَنَّ أَنْ لَنْ يَحُورَ (گمان کرد که هرگز بازنمی‌گردد)، یعنی یقین کرد. شاعر می‌گوید:\n\nفقلت لهم ظنوا بألفي مدجج\n\nدر صحیح آمده است که خداوند در روز قیامت به او می‌گوید: «آیا گمان کردی که مرا ملاقات می‌کنی؟»\n\nو خداوند متعال می‌فرماید: وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ (و این گمان شما بود که درباره پروردگارتان بردید و شما را هلاک کرد).\n\n[موطن سوم: میزان‌ها (ترازوها)]\n\nپس میزان‌ها برای وزن کردن اعمال گذاشته می‌شود. پس نامه‌های اعمال در آن‌ها قرار داده می‌شود. و آخرین چیزی که در میزان گذاشته می‌شود، گفتن انسان «الحمد لله» (ستایش از آن خداست) است. و به همین دلیل:\n\nپیامبر (صلی الله علیه و سلم) فرمود: «الْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ» (الحمد لله میزان را پر می‌کند).\n\nزیرا همه اعمال بندگان در میزان انداخته می‌شود، مگر کلمه «لا إله إلا الله» (هیچ معبودی جز خدا نیست). پس از پر شدن آن، یک تحمید (الحمد لله) باقی می‌ماند. پس آن را قرار می‌دهند و میزان با آن پر می‌شود. زیرا کفه میزان هر کس به اندازه عمل اوست، بدون کم و کاست. و هر ذکر و عملی وارد میزان می‌شود، مگر «لا إله إلا الله»، چنانکه گفتیم. و دلیل آن این است که هر عمل خیری، مقابلی از ضد خود دارد، پس این خیر در موازنه آن قرار داده می‌شود. اما «لا إله إلا الله» را جز شرک مقابلی نیست، و توحید و شرک در میزان هیچ کس جمع نمی‌شوند. زیرا اگر «لا إله إلا الله» را با اعتقاد به آن بگوید، شرک نورزیده است، و اگر شرک ورزد، به «لا إله إلا الله» اعتقاد نداشته است. پس چون جمع شدن این دو صحیح نیست، کلمه «لا إله إلا الله» چیزی ندارد که در کفه دیگر با آن برابر باشد و چیزی آن را سنگین‌تر نمی‌کند. به همین دلیل وارد میزان نمی‌شود. و اما مشرکان: فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا (پس در روز قیامت برای آنان وزنی برپا نمی‌کنیم)، یعنی قدر و ارزشی ندارند و عملی برایشان وزن نمی‌شود، و نه برای امثال آنان که لقای خدا را تکذیب کردند و به آیات او کفر ورزیدند. زیرا اعمال خیر مشرک باطل است، پس شر آنان چیزی ندارد که با آن موازنه شود. فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا. و اما صاحب سجلات (نامه‌های اعمال)، او کسی است که هرگز کار خیری انجام نداده است، جز اینکه روزی کلمه «لا إله إلا الله» را با اخلاص بر زبان آورده است. پس آن در مقابل نود و نه سجل از اعمال شر او قرار داده می‌شود، که هر سجل به اندازه فاصله مغرب و مشرق است. و این بدان دلیل است که او عمل خیر دیگری جز آن نداشته است. پس کفه آن با همه آن‌ها سنگین می‌شود و سجلات سبک می‌شوند. پس از این تعجب می‌شود. و تنها اعمال جوارح، شر و خیر آن‌ها، یعنی گوش، چشم، زبان، دست، شکم، فرج و پا، وارد میزان می‌شوند. اما اعمال باطنی وارد میزان محسوس نمی‌شوند، بلکه در آنجا عدل برپا می‌شود، و آن میزان حکمی معنوی است، محسوس برای محسوس و معنی برای معنی، که هر چیزی با مثل خود مقابله می‌شود. به همین دلیل اعمال از حیث مکتوب بودنشان وزن می‌شوند.\n\n[موطن چهارم: صراط]\n\nو آن صراط مشروعی است که در اینجا معنایی بود و در آنجا به صورت حسی محسوس نصب می‌شود. خداوند به ما می‌گوید: وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ (و این راه مستقیم من است، پس از آن پیروی کنید و از راه‌های دیگر پیروی نکنید که شما را از راه او پراکنده می‌سازد). و هنگامی که رسول خدا (صلی الله علیه و سلم) این آیه را تلاوت کرد، خطی کشید و در دو طرف آن خطوطی کشید.\n\nو این همان صراط توحید (التوحید) و لوازم و حقوق آن است.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالُوهَا عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّ الْإِسْلَامِ وَحِسَابُهُمْ عَلَى اللَّهِ» (به من امر شده است که با مردم بجنگم تا بگویند: لا إله إلا الله. پس هنگامی که آن را گفتند، خون و اموال خود را از من حفظ کرده‌اند، مگر به حق اسلام، و حسابشان با خداست).\n\nمنظور او از این سخن که «حسابشان با خداست» این است که جز خدا کسی نمی‌داند که آیا آنان این سخن را از روی اعتقاد گفته‌اند یا خیر. پس مشرک بر صراط توحید (التوحيد) قدمی ندارد، اما بر صراط هستی (الوجود) قدم دارد. و معطّل (منکر صفات الهی) بر صراط هستی (الوجود) قدمی ندارد. پس مشرک در اینجا خدا را یگانه ندانسته است، بنابراین او از محل توقف (موقف) تا آتش با معطّله همراه است. و چه کسی از اهل آتش است که سزاوار آن باشد جز منافقان؟ پس ناگزیرند که به بهشت و نعمت‌های آن بنگرند و طمع ورزند؛ این سهم آنان از نعمت‌های بهشت است، سپس به سوی آتش بازگردانده می‌شوند. و این از عدل حق (الحق) است، زیرا با اعمالشان مقابله شده است. و گروهی که در آتش جاودانه نمی‌مانند، تنها بر صراط (الصراط) متوقف می‌شوند، مورد سؤال قرار می‌گیرند و عذاب می‌بینند.\n\nو صراط (الصراط) بر روی جهنم قرار دارد و در آن پنهان است، و قلاب‌هایی (الكلاليب) که در آن است، خداوند به وسیله آن‌ها ایشان را بر صراط نگه می‌دارد. و چون صراط (الصراط) در آتش است و هیچ راهی به سوی بهشت جز از طریق آن نیست، خداوند متعال می‌فرماید: **«و هیچ یک از شما نیست مگر آنکه وارد آن می‌شود؛ این بر پروردگار تو حکمی حتمی و قطعی است»** (وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا). و هر کس معنای این سخن را بداند، جایگاه جهنم را خواهد شناخت. اگر پیامبر (صلی الله علیه و سلم) هنگامی که از او سؤال شد، آن را بیان می‌کرد، من نیز می‌گفتم. اما او سکوت نکرد و در پاسخ، آن را در علم خدا قرار داد، مگر به امر الهی؛ زیرا او **«از روی هوس سخن نمی‌گوید»** (مَا يَنْطِقُ عَنِ الْهَوَى). و چون این از امور دنیا نیست، سکوت ما در مورد آن ادب است.\n\nو در وصف صراط (الصراط) آمده است که از مو باریک‌تر و از شمشیر تیزتر است. و علم شریعت در دنیا نیز چنین است. وجه حق (الحق) در مسئله نزد خدا و اینکه کدام مجتهد به طور مشخص به صواب رسیده است، معلوم نیست. و به همین دلیل، پس از بذل تلاش در طلب دلیل، به غلبه ظنون (گمان‌های غالب) تعبّد یافته‌ایم. نه در متواتر و نه در خبر واحد صحیح معلوم؛ زیرا متواتر اگرچه افاده علم می‌کند، اما علمی که از تواتر به دست می‌آید، تنها عین همین لفظ است یا علم به اینکه رسول خدا (صلی الله علیه و سلم) آن را گفته یا انجام داده است. و مطلوب ما از علم، آن چیزی است که از آن قول و عمل فهمیده می‌شود تا بتوان در مسئله به طور قطعی حکم کرد. و این جز با نص صریح متواتر به دست نمی‌آید، و این نیز جز به ندرت یافت نمی‌شود، مانند سخن خداوند متعال: **«آن ده کامل است»** (تِلْكَ عَشَرَةٌ كَامِلَةٌ) در اینکه به طور خاص ده عدد است. پس حکم آن به شرع در دنیا از شمشیر تیزتر و از مو باریک‌تر است. کسی که به حکم صواب رسیده، یک نفر است اما مشخص نیست، و همه به اجر رسیده‌اند. پس شریعت در اینجا همان صراط مستقیم (الصراط المستقيم) است، و پیوسته در هر رکعت نماز می‌گوید: **«ما را به راه راست هدایت کن»** (اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ). پس آن از شمشیر تیزتر و از مو باریک‌تر است. ظهور آن در آخرت محسوس‌تر، آشکارتر و واضح‌تر از ظهورش در دنیاست، مگر برای کسی که بر بصیرت (بصيرة) به سوی حق (الحق) دعوت کرده باشد، مانند رسول و پیروانش. پس خداوند آنان را در دعوت **«به سوی خدا بر بصیرت»** (إِلَى اللَّهِ عَلَى بَصِيرَةٍ) یعنی بر علم و کشف (الکشف)، به درجه انبیا ملحق ساخته است.\n\nو در خبری آمده است که صراط (الصراط) در روز قیامت، سطح آن برای دیدگان به اندازه نور عبورکنندگان بر آن ظاهر می‌شود؛ پس برای گروهی باریک و برای گروهی دیگر پهن خواهد بود.\n\nاین خبر را سخن خداوند متعال تأیید می‌کند: **«نورشان پیشاپیش و در سمت راستشان می‌شتابد»** (نُورُهُمْ يَسْعَى بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ). و شتافتن (السعي) همان راه رفتن است، و راهی جز صراط (الصراط) در آنجا نیست. و اینکه فرمود: **«و در سمت راستشان»** (بِأَيْمَانِهِمْ) به این دلیل است که مؤمن در آخرت سمتی چپ ندارد، همان‌طور که اهل آتش سمتی راست ندارند.\n\nاین برخی از احوالاتی است که بر صراط (الصراط) رخ می‌دهد. و اما قلاب‌ها (الكلاليب)، چنگک‌ها (الخطاطيف) و خارهایی که ذکر کردیم، آن‌ها از صورت‌های اعمال بنی‌آدم هستند. اعمالشان آنان را بر صراط (الصراط) نگه می‌دارد، نه به سوی بهشت می‌روند و نه در آتش می‌افتند، تا اینکه شفاعت و عنایت الهی به آن‌ها برسد، همان‌طور که مقرر کردیم. پس هر کس در اینجا گذشت کند، خداوند در آنجا از او گذشت می‌کند؛ و هر کس به تنگدست مهلت دهد، خداوند به او مهلت می‌دهد؛ و هر کس عفو کند، خداوند او را عفو می‌کند؛ و هر کس در اینجا حق خود را از بندگانش به طور کامل بستاند، خداوند در آنجا حق خود را از او به طور کامل می‌ستاند؛ و هر کس بر این امت سخت بگیرد، خداوند بر او سخت می‌گیرد. این‌ها تنها اعمال شماست که به سوی شما باز می‌گردد، پس به مکارم اخلاق پایبند باشید.\n\nزیرا خداوند فردا با شما همان‌گونه رفتار می‌کند که شما با بندگانش رفتار کرده‌اید، هر چه بوده و هر که بوده‌اند.\n\n### [مکان] پنجم: اعراف (الأعراف)\n\nو اما اعراف (الأعراف)، دیواری است میان بهشت و آتش که **«باطن آن رحمت است»** (بَاطِنُهُ فِيهِ الرَّحْمَةُ)، و آن سمتی است که رو به بهشت دارد، و **«ظاهر آن از سوی عذاب است»** (وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ)، و آن سمتی است که رو به آتش دارد. بر آن کسانی قرار می‌گیرند که کفه ترازوی اعمالشان برابر شده است. آنان به آتش می‌نگرند و به بهشت نیز می‌نگرند، و هیچ رجحانی ندارند که آنان را وارد یکی از دو سرا کند. پس هنگامی که به سجده فراخوانده می‌شوند – و این تنها تکلیف باقی‌مانده در روز قیامت است – سجده می‌کنند و کفه حسناتشان سنگین‌تر می‌شود و وارد بهشت می‌گردند. وقد كانوا ينظرون إلى النار بما لهم من السيئات وينظرون إلى الجنة بما لهم من الحسنات ويرون رحمة الله فيطمعون. آنان به دلیل گناهانی که دارند به آتش می‌نگرند و به دلیل حسناتشان به بهشت می‌نگرند و رحمت حق (الحق) را می‌بینند و طمع می‌ورزند. و سبب دیگر طمعشان این است که آنان از اهل «لا إله إلا الله» هستند و آن را در ترازوی خود نمی‌بینند و می‌دانند که **«خداوند به اندازه سنگینی ذره‌ای ستم نمی‌کند»** (إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ). و اگر ذره‌ای به یکی از دو کفه می‌آمد، آن کفه سنگین‌تر می‌شد، زیرا هر دو کفه در نهایت اعتدال هستند. پس به کرم و عدل حق (الحق) طمع می‌ورزند و اینکه ناگزیر کلمه «لا إله إلا الله» باید عنایتی به صاحب خود داشته باشد که اثر آن بر ایشان ظاهر شود. خداوند عز و جل درباره آنان می‌فرماید: **«و بر اعراف (الأعراف) مردانی هستند که هر یک را از سیمایشان می‌شناسند، و اهل بهشت را ندا می‌دهند که سلام بر شما باد! آنان وارد بهشت نشده‌اند، در حالی که طمع دارند»** (وَعَلَى الْأَعْرَافِ رِجَالٌ يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ وَنَادَوْا أَصْحَابَ الْجَنَّةِ أَنْ سَلَامٌ عَلَيْكُمْ لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ). همچنین هنگامی که **«چشمانشان به سوی اهل آتش گردانده می‌شود، می‌گویند: پروردگارا، ما را با گروه ستمکاران قرار مده»** (إِذَا صُرِفَتْ أَبْصَارُهُمْ تِلْقَاءَ أَصْحَابِ النَّارِ قَالُوا رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ). و ستم (الظلم) در اینجا فقط شرک است و نه چیز دیگر.\n\n### [مکان] ششم: ذبح مرگ\n\nمرگ (الموت) اگرچه یک نسبت است، اما خداوند آن را در روز قیامت به صورت قوچی ابلق (سفید و سیاه) ظاهر می‌سازد. و ندا می‌دهد: ای اهل بهشت! پس گردن می‌کشند. و ندا می‌دهد: ای اهل آتش! پس گردن می‌کشند. و در آن هنگام جز اهل آتش که سزاوار آن هستند، کسی در آن نیست. پس به هر دو گروه گفته می‌شود: آیا این را می‌شناسید؟ و آن قوچ میان بهشت و آتش است. می‌گویند: او مرگ (الموت) است. و یحیی (علیه السلام) می‌آید و کارد در دست دارد، پس آن را می‌خواباند و ذبح می‌کند. و ندا دهنده‌ای ندا می‌دهد: ای اهل بهشت، جاودانگی است و مرگی نیست! و ای اهل آتش، جاودانگی است و مرگی نیست!\n\nو آن همان **«روز حسرت»** (يَوْمَ الْحَسْرَةِ) است. اما اهل بهشت، هنگامی که مرگ (الموت) را می‌بینند، از دیدن آن بسیار شاد می‌شوند و به آن می‌گویند: خداوند تو را برای ما مبارک گرداند! تو ما را از رنج دنیا رهانیدی و بهترین واردی بودی که بر ما آمدی و بهترین تحفه‌ای که حق (الحق) به ما هدیه داد. زیرا پیامبر (صلی الله علیه و سلم) می‌فرماید: **«مرگ تحفه مؤمن است»** (الموت تحفة المؤمن). و اما اهل آتش، هنگامی که آن را می‌بینند، از آن می‌ترسند و به آن می‌گویند: تو بدترین واردی بودی که بر ما آمدی و میان ما و خیری که در آن بودیم جدایی افکندی. سپس به آن می‌گویند: کاش ما را می‌میراندی تا از آنچه در آن هستیم آسوده شویم. و روز حسرت نامیده شد، زیرا برای همگان حسر (کشف و آشکارسازی) است، یعنی صفت جاودانگی دائم برای هر دو گروه آشکار می‌شود. سپس درهای آتش چنان بسته می‌شود که دیگر گشودنی در پی آن نیست. و آتش بر اهلش منطبق می‌شود و بعضی از آن در بعضی دیگر فرو می‌رود تا فشار بر اهل آن در درونش عظیم گردد. و پایین آن بالا و بالای آن پایین می‌گردد. و مردم و شیاطین را در آن مانند تکه‌های گوشت در دیگ می‌بینی، زیرا آتش عظیمی زیر آن است که **«مانند جوشش آب بسیار داغ می‌جوشد»** (كَغْلِيِ الْحَمِيمِ). پس اهل آن را بالا و پایین می‌گرداند. **«هرگاه فرو نشیند، شعله آن را برایشان بیشتر می‌کنیم»** (كُلَّمَا خَبَتْ زِدْنَاهُمْ سَعِيرًا) با تبدیل پوست‌ها.\n\n### [مکان] هفتم: مأدبه (ضیافت)\n\nو آن ضیافت پادشاه برای اهل بهشت است. و در آن هنگام، اهل آتش در نوحه‌سرایی (مندبه) جمع می‌شوند. پس اهل بهشت در ضیافت و اهل آتش در نوحه‌سرایی هستند. و غذای آنان در آن ضیافت، جگر اضافی ماهی نون است، و زمین میدان، آرد سفید نرمی مانند قرص نان است. و برای اهل آتش طحال گاو بیرون آورده می‌شود. اهل بهشت از جگر اضافی ماهی نون می‌خورند، و آن حیوانی دریایی و آبی است، پس از عنصر حیات مناسب با بهشت است. و جگر خانه خون است و خانه حیات، و حیات گرم و مرطوب است. و بخار آن خون همان نفس است که به روح حیوانی تعبیر می‌شود و حیات بدن به آن است. پس این بشارتی است برای اهل بهشت به بقای حیات بر ایشان. و اما طحال در بدن حیوان، خانه کثیفی‌هاست، زیرا کثیفی‌های بدن در آن جمع می‌شود و آن همان خون فاسدی است که جگر به آن می‌دهد. پس به اهل آتش داده می‌شود تا بخورند. و آن از گاو است، و گاو حیوانی خاکی است که طبعش سردی و خشکی است. و جهنم به صورت گاومیش است، و طحال گاو برای غذای اهل آتش مناسبت بیشتری دارد. پس به دلیل خونی که در طحال است، اهل آتش نمی‌میرند، و به دلیل کثیفی‌های بدن و خون فاسد دردناکی که در آن است، زنده نمی‌شوند و متنعم نمی‌گردند. پس خوردن آن برایشان بیماری و درد به ارث می‌آورد. سپس اهل بهشت وارد بهشت می‌شوند، پس **«آنان از آنجا بیرون شدنی نیستند»** (مَا هُمْ مِنْهَا بِمُخْرَجِينَ). و **«خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند»** (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).\n\nجزء بیست و هشتم به پایان رسید."
  },
  "page_count": 11
}