{
  "id": 270,
  "title": {
    "ar": "الباب السبعون ومائتان في معرفة منزل القطب والإمامين من المناجاة المحمدية",
    "en": "Chapter Two Hundred and Seventy: On Knowing the Station (منزل) of the Pole (القطب) and the Two Imams (الإمامين) from the Muhammadan Intimate Discourse (المناجاة المحمدية).",
    "ur": "باب دو سو ستر: قطب (القطب) اور دو اماموں (الإمامين) کے مقام کی معرفت (المعرفۃ) کے بیان میں، جو مناجات محمدیہ (المناجاة المحمدية) سے متعلق ہے۔",
    "fa": "باب دویست و هفتادم در معرفت منزل قطب و دو امام از مناجات محمدیه"
  },
  "content": {
    "ar": "## «الباب السبعون ومائتان في معرفة منزل القطب والإمامين من المناجاة المحمدية»\n\n\n> منزلة القطب والإمامة *** منزلة ما لها علامة\n\n\n> يملكها واحد تعالى *** عن صفة السير والإقامة\n\n\n> يعلوه في لونه اصفرار *** في أيمن الخد منه شامة\n\n\n> خفية ما لها نتو *** أيده الله بالسلامة\n\n\n> توجه الله بالمعالي *** في عالم الأمر في القيامة\n\n\nاعلم أيدك الله بروح منه أن ممن تحقق بهذا المنزل من الأنبياء صلوات الله عليهم أربعة محمد وإبراهيم وإسماعيل وإسحاق عليهم السلام ومن الأولياء اثنان وهما الحسن والحسين سبطا رسول الله صلى الله عليه وسلم وإن كان لمن عدا هؤلاء المذكورين منه شرب معلوم على قدر مرتبته من الإمامة\n\n\n### [إن الأقطاب يسمون بالعبودية]\n\n\nفاعلم إن الأقطاب والصالحين إذا سموا بأسماء معلومة لا يدعون هناك إلا بالعبودية إلى الاسم الذي يتولاهم قال تعالى وأَنَّهُ لَمَّا قامَ عَبْدُ الله يَدْعُوهُ فسماه عبد الله وإن كان أبوه قد سماه محمدا وأحمد فالقطب أبدا مختص بهذا الاسم الجامع فهو عبد الله هناك ثم إنهم يفضل بعضهم بعضا مع اجتماعهم في هذا الاسم الذي يطلبه المقام فيختص بعضهم باسم ما غير هذا الاسم من باقي الأسماء الإلهية فيضاف إليه وينادي في غير مقام القطبية كموسى صلى الله عليه وسلم اسمه عبد الشكور وداود عليه السلام اسمه الخاص به عبد الملك ومحمد صلى الله عليه وسلم اسمه عبد الجامع وما من قطب إلا وله اسم يخصه زائد على الاسم العام الذي له الذي هو عبد الله سواء كان القطب نبيا في زمان النبوة المقطوع بها أو وليا في زمان شريعة محمد صلى الله عليه وسلم وكذلك الإمامان لكل واحد منهما اسم يخصه ينادى به كل إمام في وقته هناك فالإمام الأيسر عبد الملك والإمام الأيمن عبد ربه وهما للقطب الوزيران فكان أبو بكر رضي الله عنه عبد الملك وكان عمر رضي الله عنه عبد ربه في زمان رسول الله صلى الله عليه وسلم إلى أن مات صلى الله عليه وسلم فسمى أبو بكر عبد الله وسمي عمر عبد الملك وسمي الإمام الذي ورث مقام عمر عبد ربه ولا يزال الأمر على ذلك إلى يوم القيامة وكان الحسن والحسين رضي الله عنهما أمكن الناس في هذا المقام من غيرهما ممن اتصف به وجرت السنة الإلهية في القطب إذا ولي المقام أن يقوم في مجلس من مجالس القربة والتمكين وينصب له فيه تخت عظيم لو نظر إلى بهائه الخلق لطاشت عقولهم فيقعد عليه ويقف بين يديه الإمامان اللذان قد جعلهما الله له ويمد يده للمبايعة الإلهية والاستخلاف وتؤمر الأرواح الملكية والجن والبشر الروحاني بمبايعته واحدا بعد واحد فإنه جل جناب الحق أن يكون مصدرا لكل وارد وأن يرد عليه إلا واحد بعد واحد فكل روح يبايعه في ذلك المقام يسأله أعني يسأل الروح القطب عن مسألة من المسائل فيجيبه أمام الحاضرين ليعرفوا منزلته من العلم فيعرفون في ذلك الوقت أي اسم إلهي يختص به وقد أفردنا لهذه المبايعة كتابا كبيرا سميناه مبايعة القطب‏\nفي حضرة القرب وذكرنا فيه معاني مسائل كثيرة مما سئل عنها فأجاب ولا تبايعه إلا الأرواح المطهرة المقربة ولا يسأله من الأرواح المبايعة من الملائكة والجن والبشر إلا أرواح الأقطاب الذين درجوا خاصة فذكرنا في ذلك الكتاب سؤالاتهم وجوابه عليها موفى وهكذا هي حالة كل قطب يبايع في زمانه فلنذكر في هذا الباب من بعض أحواله العامة لكل قطب دون الأحوال الخاصة به ليعلم الواقف على كتابي هذا صاحب الذوق المشاهد إياه أنا ما عدلنا في كتابنا هذا عن الطريقة التي لا يجهلها كل عارف من أهل هذا الشأن فلو ذكرنا الحال الخاص به ربما كان يقول هذه دعوى فلنبدأ أولا بحال الإمام الأقصى ثم الإمام الأدنى ثم القطب فأما الإمام الأقصى وهو عبد ربه فإن حاله البكاء شفقة على العالم لما يراهم عليه من المخالفات وينظر إلى توجه الأسماء الإلهية التي تقتضي العقاب والأخذ ولا يتجلى له من الأسماء الإلهية ما تقتضيه المخالفات من العفو والتجاوز فلهذا يكثر بكاؤه فلا يزال داعيا لعباد الله رحيما بهم سائلا الله سبحانه أن يسلك بهم طريق الموافقات ولقد عاينت في بعض سياحاتي هذا الإمام فما رأيت ممن رأيت من الصالحين أشد خوفا منه على عباد الله ولا أعظم رحمة فقلت له لم لا تأخذك الغيرة لله فقال إني لا أريد أن يغار لله من أجلي ولكن أريد أن يسأل الله من أجلي ليرحمني ويتجاوز فلا أحب لعباد الله إلا ما أحبه لنفسي ولا ينبغي للصادق مع الله أن يتصور في صورة حال لا يعطيه مقامه ولهذا الإمام قوة سلطان على الشياطين الملازمين أهل الخير والصلاح ليصرفوهم عن طريقهم فإذا وقع نظر الشيطان على هذا الإمام وهو عند بعض الصالحين يحتال كيف يصرفه عن طريقته يذوب كما يذوب الرصاص في النار فيناديه الإمام باسمه عسى يسلم فيدبرها ربا فلا يزال ذلك الصالح محفوظا من إلقاء هذا الصنف من الشياطين إليه ما يخرجه عن صلاحه ما دام هذا الإمام حاضرا ناظرا إليه وإن كان ذلك الصالح لا يعرفه ولا يعرف ما جرى وقد عاينا هذا الطائفة فيدفع الله عن عباده بهذا الإمام الشرور التي تختص بالصالحين من عباده خاصة عناية منه بهم ومن خاصية هذا الإمام التصديق بكل خبر مخبر به عن الله سواء كان ذلك المخبر صادقا في أخباره أو مفتريا فإن هذا الإمام يصدقه لكونه ناظرا إلى الاسم الإلهي الذي يتولى هذا المخبر في أخباره فإن كان صادقا فإخباره عن كشف محقق فيستوي هو والإمام في ذلك وإن لم يكن له كشف وأخبر عما وقع عنده وهو لا يدري من أوقعه ويقصد الكذب فإن هذا الإمام يصدقه في أخباره والمخبر معاقب من الله محروم بقصده الكذب وهو في نفس الأمر ليس كذلك فوبال قصده عاد عليه فعذب إن آخذه الله بذلك ومن أحوال هذا الإمام أن يسأل دائما الانتقال إلى مقام المشاهدة من الأحوال ومقام الصلاح من المقامات وله اطلاع دائم إلى الجنان وإنما خصه الله بهذا الاطلاع إبقاء عليه فيقابل ما هو عليه من البكاء والحزن المؤدي إلى القنوط بما يراه ويطلعه الله عليه من سرور الجنان ونعيم أهله فيه ويعاين اشتياق أهله إليه وانتظارهم لقدومه فيكون ذلك سببا لاعتداله ومقام هذا الإمام الإحسان الأول وهوقول جبريل عليه السلام لرسول الله عليه الصلاة والسلام ما الإحسان وجوابه صلى الله عليه وسلم الإحسان أن تعبد الله كأنك تراه‏\n\n\nوالذي بعده ليس لهذا الإمام وبيد هذا الإمام مصالح العالم وما ينتفعون به وهو يربي الأفراد ويغذيهم بالمعارف الإلهية ويقسم المعارف على أهلها بميزان محقق على قدر ما يرى فيه صلاح ذلك العارف لتحيا بتلك المعرفة نفسه وله السيادة على الثقلين والحكم والتصرف فيهما بما تعطيه المصلحة لهم ومن خصائص هذا الإمام الإقامة على كل ما يحصل له من الأحوال والمقامات وليس ذلك لكل أحد فما يتصف بحال فينتقل عنه ولا بمقام وغير هذا الإمام إذا انتقل إلى مقام أو حال حكم عليه سلطان ذلك المقام والحال وغيبه عما انتقل عنه وهذا الإمام ليس كذلك فإن المقام الذي انتقل عنه محفوظ عليه لا يغيب عنه قوة إلهية خصه الله بها ولروحه من الأجنحة مائتا جناح وأربعة أجنحة أي جناح نشر منها طار به حيث شاء وله قدم في المرتبة الثالثة والأولى ويدعى في بعض الأحايين بالبر الرحيم وكانت بدايته من المرتبة الثالثة ونهايته إلى المرتبة الأولى فكان طريقته من غايته إلى بدايته بخلاف السلوك المعروف فرجع القهقري بقطع المقامات والدرجات والمنازل فمن نهايته إلى بدايته تسعة عشر منزلا فيها منزل البداية والنهاية فتم منزل درجاته مائة واثنتان وعشرة وتسعون وعشرون وثلاثة وأربعة وثلاثون وخمسة وأربعون وستة وخمسون وسبعة وستون وثمانية\nوسبعون وثمانون وتسعة ومائتان ولما كانت المراتب أربعا لا زائد عليها وكل مرتبة تقتضي أمورا لا نهاية لها من علوم وأسرار وأحوال فالمرتبة الأولى إيمان والثانية ولاية والثالثة نبوة والرابعة رسالة والرسالة والنبوة وإن انقطعت في هذه الأمة بحكم التشريع فما انقطع الميراث منهما فمنهم من يرث نبوة ومنهم من يرث رسالة ونبوة معا وإذ قد ذكرنا ما لهذا الإمام الأقصى فلنذكر ما للإمام الأدنى وهو عبد الملك فنقول والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ إن لهذا الإمام من جهة روحانيته من الأجنحة تسعين جناحا أي جناح نشر منها طار به حيث شاء وكانت بدايته ونهايته في المرتبة الثانية ليس له قدم في باقي المراتب الثلاثة فلم يكن له منازل ولا درجات ولا مقامات يقطعها ولهذا الإمام الشدة والقهر وله التصرف بجميع الأسماء الإلهية التي تستدعي الكون مثل الخالق والرازق والملك والبارئ على بعض وجوهه وغير ذلك وليس له تصرف بأسماء التنزيه بخلاف الإمام الذي تقدم ذكره ويلجأ إليه في الشدائد والنوازل الكبار فيفرجها الله على يده فإن الله قد جعل له عليها سلطانا وله الكرم وليس له الإيثار لنزاهته عن الحاجة إلى ما يقع به الإيثار وله الإنعام على الخلق من حيث لا يشعرون ولقد أنعم على هذا ببشارة بشرني بها وكنت لا أعرفها في حالي وكانت حالي فأوقفني عليها ونهاني عن الانتماء إلى من لقيت من الشيوخ وقال لي لا تنتم إلا لله فليس لأحد ممن لقيته عليك يد مما أنت فيه بل الله تولاك بعنايته فاذكر فصل من لقيت إن شئت ولا تنتسب إليهم وانتسب إلى ربك وكان حال هذا الإمام مثل حالي سواء لم يكن لأحد ممن لقيه عليه يد في طريق الله إلا لله هكذا نقل لي الثقة عندي عنه وأخبرني الإمام بذلك عن نفسه عند اجتماعي به في مشهد برزخي اجتمعت به فيه لله الحمد والمنة على ذلك وولاة أمور الخلق راجعون إلى هذا الإمام فيولي ويعزل ويدفع الله به الشرور وله سلطان قوي على الأرواح النارية من الشياطين المبعودين من رحمة الله ويجتمع مع الإمام الأول الأقصى في درجة واحدة من خمس درجات وينفرد عنه الإمام الأقصى بأربع درجات وقد ذكرنا من أحواله في جزء لنا في معرفة القطب والإمامين ما فيه كفاية فلنقتصر على ما قد ذكرناه رغبة في الاختصار وإذ قد ذكرنا من أحوال الإمامين هذا القدر فلنذكر أيضا من حديث القطب ما تقع به الكفاية في هذه العجالة إن شاء الله فأما القطب وهو عبد الله وهو عبد الجامع فهو المنعوت بجميع الأسماء تخلقا وتحققا وهو مرآة الحق ومجلى النعوت المقدسة ومجلى المظاهر الإلهية وصاحب الوقت وعين الزمان وسر القدر وله علم دهر الدهور الغالب عليه الخفاء محفوظ في خزائن الغيرة ملتحف بأردية الصون لا تعتريه شبهة ولا يخطر له خاطر يناقض مقامه كثير النكاح راغب فيه محب للنساء يوفي الطبيعة حقها على الحد المشروع له ويوفي\n\n\nالروحانية حقها على الحد الإلهي يضع الموازين ويتصرف على المقدار المعين الوقت له ما هو للوقت هو لله لا لغيره حاله العبودية والافتقار يقبح القبيح ويحسن الحسن يحب الجمال المقيد في الزينة والأشخاص تأتيه الأرواح في أحسن الصور يذوب عشقا يغار لله ويغضب لله لا تتقيد له المظاهر الإلهية بالتدبير بل له الإطلاق فيها فتظهر له في تدبير المدبر روحانيته من البشر المحسوس من خلف حجاب الشهادة والغيب لا يرى من الأشياء إلا وجه الحق فيها يضع الأسباب ويقيمها ويدل عليها ويجري بحكمها ينزل إليها حتى تحكم عليه وتؤثر فيه لا يكون فيه ربانية بوجه من الوجوه مصاحب لهذا الحال دائما إن كان صاحب دنيا وثروة تصرف فيها تصرف عبد في مال سيد كريم وإن لم يكن له دنيا وكان على ما يفتح له لم تستشرف له نفس بل يقصد بنفسه عند الحاجة إلى بعض ما تحتاج إليه طبيعته بيت صديق ممن يعرفه يعرض عليه ما تحتاج إليه طبيعته كالشفيع لها عنده فيتناول لها منه قدر ما تحتاج إليه وينصرف لا يجلس عن حاجته إلا من ضرورة فإذا لم يجب لجأ إلى الله في حاجة طبيعته لأنه مسئول عنها لكونه واليا\n\n\nعليها ثم ينتظر الإجابة من الله فيما سأله فإن شاء أعطاه ما سأل عاجلا أو آجلا فمرتبته الإلحاح في السؤال والشفاعة في حق طبيعته بخلاف أصحاب الأحوال فإن الأشياء تتكون عن همتهم وطرحهم الأسباب عن نفوسهم فهم ربانيون والقطب منزه عن الحال ثابت في العلم مشهود فيه فيتصرف به فإن أطلعه الحق على ما يكون أخبر بذلك على جهة الافتقار والمنة لله لا على جهة الافتخار لا تطوي له أرض ولا يمشي في هواء ولا على ماء ولا يأكل من غير سبب ولا يطرأ عليه شي‏ء مما ذكرناه من خرق العوائد وما تعطيه الأحوال إلا نادرا لأمر يراه الحق فيفعله لا يكون ذلك مطلوبا\nللقطب بجوع اضطرارا لا اختيارا ويصبر عن النكاح كذلك لعدم الطول يعلم من تجلى النكاح ما يحرضه على طلبه والتعشق به فإنه لا يتحقق له ولا لغيره من العارفين عبوديته أكثر مما يتحقق له في النكاح لا في أكل ولا في شرب ولا في لباس لدفع مضرة ولا يرغب في النكاح للنسل بل لمجرد الشهوة وإحضار التناسل في نفسه لأمر مشروع والتناسل في ذلك للأمر الطبيعي لحفظ بقاء النوع في هذه الدار فإن نكاح صاحب هذا المقام كنكاح أهل الجنة لمجرد الشهوة إذ هو التجلي الأعظم الذي خفي عن الثقلين إلا من اختصه الله به من عباده وعلى هذا يجري نكاح البهائم لمجرد الشهوة لكن غاب عن هذه الحقيقة كثير من العارفين فإنه من الأسرار التي لا يقف عليها إلا القليل من أهل العناية ولو لم يكن فيه من الشرف التام الدال على ما تستحقه العبودية من الضعف إلا ما يجد فيه من قهر اللذة المفنية له عن قوته ودعواه فهو قهر لذيذ إذ القهر مناف للالتذاذ به في حق المقهور لأن اللذة في القهر من خصائص القاهر لا من خصائص المقهور إلا في هذا الفعل خاصة وقد غاب الناس عن هذا الشرف وجعلوه شهوة حيوانية نزهوا نفوسهم عنها مع كونهم سموها بأشرف الأسماء وهو قولهم حيوانية أي هي من خصائص الحيوان وأي شرف أعظم من الحياة فما اعتقدوه قبحا في حقهم هو عين المدح عند العارف المكمل هذا مضى بسبيله وأما حب القطب الجمال المقيد المندرج في الجمال المطلق فذلك لقربه في المناسبة إلى الجمال فلا يحتاج فيه إلى غور بعيد وقوة يشق بها حجاب قبح الطبع إلى إدراك الجمال الإلهي المودع في ذلك القبح فالجمال المقيد يعطيه بأول وهلة مقصوده حتى يتفرغ إلى أمر آخر آكد عليه من مقاومة القبح الطبيعي لإدراك الجمال المطلق إذا لا نفاس عزيزة في دار التكليف ويريد أن لا يكون له نفس إلا وقد تلقاه بأحسن أدب وصرفه بأحسن خلعة وزينة وقد غاب عن هذا القدر من المعرفة جماعة من العارفين وأنفت نفوسهم من ذلك لمشاركة أهل الأغراض من العامة فيه وما علموا إن هذا الرجل له مشاهدة الجمال المطلق في الجمال المقيد وفي غيره بخلاف العامة\n\n\n### [إن الأقطاب هم رجال الكمل‏]\n\n\nواعلم أن القطب هو الرجل الكامل الذي قد حصل الأربعة الدنانير الذي كل دينار منها خمسة وعشرون قيراطا وبها توزن الرجال فمنهم ربع رجل ونصف وثمن وسدس ونصف سدس وثلاثة أرباع ورجل كامل فالدينار الواحد للمؤمن الكامل والدينار الثاني للولي الخاص والدينار الثالث للنبوتين والدينار الرابع للرسالتين أعني الأصلية بحكم الأبوة والوراثة بحكم البنوة فمن حصل الثاني كان له الأول ومن حصل الثالث كان له الثاني والأول ومن حصل الرابع حصل الكل والقطب من الرجال الكمل وإنما قلنا من الرجال الكمل من أجل الأفراد فإنهم مكملون ومن أحوال القطب تقرير العادات والجري عليها ولا يظهر عليه خرق عادة دائما كما يظهر على صاحب الحال ولا يكون خرق العادة مقصودا له بل تظهر منه ولا تظهر عنه إذ لا اختيار له في ذلك كما قال العارف أبو السعود بن الشبل في الرجل يتكلم على الخاطر وما هو مع الخاطر فيكون في حقه بحكم الاتفاق الوجودي وفي حق الله بحكم الإرادة والقصد فقد بينا بحمد الله الضروري الخاص من أحوال القطب وبينا رتبته لمن جهلها وأن الرجولية ليست فيما يتخيله الجهال من عامة الطريق بطريق الله فينحجبون بالحال عما يقتضيه العلم والمقام فيقولون كل علم لا يكون بالحال فليس بشي‏ء فقل له لا تقل ذلك يا أخي فإنه خلاف الأمر وإنما الصحيح أن تقول كل علم لا يكون عن ذوق فليس بعلم أهل الله فأراك لا تفرق بين الحال والذوق وما ثم علم قط إلا عن ذوق لا يكون غير هذا والمتمكن في العبودة لا حال له البتة يخرجه عن عبودته فلو لم يكن في الأحوال من النقص إلا أنها تخرج العبد عن مقامه إلى ما لا يستحقه ولا هو حق له حتى أنه لو مات في حال الحال لمات صاحب نقص وحشر صاحب نقص فليست الأحوال من مطالب الرجال لكن الأذواق مطالبهم وهي لهم لما يحصل لهم فيها من العلوم بمنزلة الأدلة لأصحاب النظر فيها فالله يجعلنا ممن فهم ففهم عن الله مراده والله يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ وفي هذا الباب من العلوم علم ما يستند إليه من الحضرة الإلهية وعلم نسبة بنى آدم إلى الله من أسماء مخصوصة وعلم ما يتقى ويحذر من العالم الروحاني وعلم رجعة العالم الروحاني من أين وإلى أين وعلم الصدور البشري‏\n\n",
    "en": "Chapter Two Hundred and Seventy: Concerning the Knowledge of the Station of the Pole and the Two Imams, from the Muhammadan Intimate Discourse\n\nThe Station of the Pole and the Imamate\nIs a station that bears no outward sign.\n\nIt is possessed by a single one, exalted\nBeyond the description of journeying (sayr) or dwelling (iqama).\n\nA yellowness overcomes his complexion,\nAnd on his right cheek is a mole (shama).\n\nIt is hidden, having no prominence;\nMay Allah support him with safety (salama).\n\nAllah directs him toward the highest matters\nIn the World of Command (ʿālam al-Amr) on the Day of Resurrection.\n\nKnow—may Allah support you with a spirit from Him—that among the Prophets (peace be upon them) who realized this station are four: Muhammad, Abraham, Ishmael, and Isaac (upon them be peace). And among the Friends of God (Awliya’) are two: Al-Hasan and Al-Husayn, the grandsons of the Messenger of Allah (may Allah bless him and grant him peace). Although those besides these mentioned have a known share (shurb) of it, according to their degree (martaba) of Imamate.\n\n### [The Poles are named by Servitude]\n\nKnow that when the Poles (Aqtāb) and the righteous are named with known names, they are only called there by the name of Servitude (al-ʿUbūdiyya) to the Name that governs them. Allah the Exalted said: <<وَأَنَّهُ لَمَّا قامَ عَبْدُ الله يَدْعُوهُ>> (And that when the servant of Allah stood up calling upon Him). Thus, He named him the Servant of Allah (ʿAbd Allāh), even though his father had named him Muhammad and Ahmad. The Pole is always distinguished by this Comprehensive Name (al-Ism al-Jāmiʿ); he is the Servant of Allah (ʿAbd Allāh) in that station. Furthermore, they excel one another even while sharing this Name required by the Station. Thus, some of them are distinguished by a specific name other than this Name, from the remaining Divine Names, and are attributed to it and called by it in a station other than the Pole’s station (Qutbiyya). For example, Moses (peace be upon him) is named the Servant of the Thankful (ʿAbd ash-Shakūr), and David (peace be upon him) has his specific name, the Servant of the King (ʿAbd al-Malik). Muhammad (peace be upon him) is named the Servant of the Comprehensive (ʿAbd al-Jāmiʿ). There is no Pole who does not have a specific name unique to him, in addition to the general name he holds, which is the Servant of Allah (ʿAbd Allāh), whether the Pole is a Prophet during the period of definitive Prophethood or a Saint (Walī) during the time of the Law (Sharīʿa) of Muhammad (peace be upon him).\n\nLikewise, the two Imams (al-Imāmān) each have a specific name by which each Imam is called in his time in that station. The Left Imam is the Servant of the King (ʿAbd al-Malik), and the Right Imam is the Servant of his Lord (ʿAbd Rabbih). They are the two viziers to the Pole. Thus, Abu Bakr (may Allah be pleased with him) was ʿAbd al-Malik, and ʿUmar (may Allah be pleased with him) was ʿAbd Rabbih during the time of the Messenger of Allah (peace be upon him) until he died (peace be upon him). Then Abu Bakr was named ʿAbd Allāh, and ʿUmar was named ʿAbd al-Malik, and the Imam who inherited the station of ʿUmar was named ʿAbd Rabbih. The matter remains thus until the Day of Resurrection. Al-Hasan and Al-Husayn (may Allah be pleased with them) were the most established people in this station, more so than others who were characterized by it.\n\nThe Divine Custom (Sunna) dictates that when the Pole assumes the Station, he stands in a session of Proximity (Qurba) and Empowerment (Tamkīn), and a magnificent throne is set up for him therein. If creation were to look upon its splendor, their minds would be scattered. He sits upon it, and the two Imams whom God has appointed for him stand before him. He extends his hand for the Divine Pledge of Allegiance (Bayʿa) and the succession (Istikhlāf). The angelic spirits, the jinn, and the spiritual humans are commanded to pledge allegiance to him, one after the other. For the Majesty of the Real (Jalāl Janāb al-Ḥaqq) is too exalted to be the source for every arrival, and too exalted for anyone to approach Him except one after the other. Every spirit that pledges allegiance to him in that station asks him—meaning the spirit asks the Pole—a question concerning one of the matters, and he answers before those present so that they may know his station of Knowledge (ʿIlm). They thus recognize at that time which Divine Name is specific to him.\n\nWe have dedicated a large book to this Pledge of Allegiance, which we named *The Pledge of Allegiance of the Pole in the Presence of Proximity* (Mubāyaʿat al-Quṭb fī Ḥaḍrat al-Qurb). In it, we mentioned the meanings of many questions he was asked and to which he replied. Only the purified, near spirits pledge allegiance to him. And among the pledging spirits—whether angels, jinn, or humans—only the spirits of the Poles who have passed away specifically ask him questions. We mentioned their questions and his complete answers in that book. This is the state of every Pole who receives the pledge in his time.\n\nLet us mention in this chapter some of his general states (aḥwāl) common to every Pole, rather than his specific states, so that the reader of this book—the one possessing the witnessing taste (dhawq al-mushāhid)—may know that we have not deviated in this book from the method known to every Gnostic (ʿārif) of this discipline. If we were to mention his specific state, someone might say, \"This is a claim.\" Let us begin first with the state of the Farther Imam (al-Imām al-Aqṣā), then the Nearer Imam (al-Imām al-Adnā), and then the Pole.\n\nAs for the Farther Imam, who is the Servant of his Lord (ʿAbd Rabbih), his state is weeping out of compassion for the world, seeing the transgressions they commit. He observes the orientation of the Divine Names that necessitate punishment and retribution, yet the Divine Names that necessitate pardon and forgiveness for these transgressions are not disclosed (yatajallā) to him. For this reason, his weeping is frequent. He constantly supplicates for the servants of Allah, is merciful toward them, and asks Allah the Exalted to guide them onto the path of conformity (muwāfaqāt). I witnessed this Imam during some of my spiritual journeys (siyāḥāt), and I have not seen among the righteous I met anyone more fearful for the servants of Allah or possessing greater mercy. I asked him, \"Why does zeal (ghīra) for Allah not overcome you?\" He replied, \"I do not wish that zeal for Allah be shown on my account, but rather that Allah be asked on my account, so that He may have mercy on me and forgive. I only desire for the servants of Allah what I desire for myself. It is not fitting for the truthful one with Allah to assume the form of a state (ḥāl) that his station (maqām) does not grant him.\"\n\nThis Imam possesses a powerful dominion over the devils who cling to the people of goodness and righteousness to divert them from their path. If the devil’s gaze falls upon this Imam while he is near one of the righteous, plotting how to divert him from his way, the devil melts like lead in fire. The Imam calls him by his name, hoping he might submit, and manages him as a Lord (Rabban). That righteous person remains protected from the suggestions of this type of devil that would lead him away from his righteousness, as long as this Imam is present and observing him, even if that righteous person does not know him or what transpired. We have witnessed this group. Through this Imam, Allah repels the evils specific to His righteous servants, as a special providence (ʿināya) from Him toward them.\n\nA specific characteristic of this Imam is the affirmation (taṣdīq) of every piece of news reported about Allah, whether the reporter is truthful in his news or an imposter. This Imam affirms him because he is looking at the Divine Name that governs this reporter in his news. If the reporter is truthful, his news comes from verified unveiling (kashf muḥaqqaq), and thus he and the Imam are equal in that. If he has no unveiling and reports what occurred to him—though he does not know who caused it—and intends to lie, this Imam still affirms his news. The reporter, however, is punished by Allah and deprived due to his intention to lie, even though the matter itself is not false. Thus, the evil consequence of his intention returns upon him, and he is tormented if Allah holds him accountable for it.\n\nAmong the states of this Imam is that he constantly asks for transition to the station of Witnessing (Mushāhada) from the states (aḥwāl), and the station of Righteousness (Ṣalāḥ) from the stations (maqāmāt). He has a constant view (iṭṭilāʿ) of the Gardens (Jannān). Allah has specifically granted him this view to sustain him, so that what he experiences of weeping and sorrow—which could lead to despair (qunūṭ)—is counterbalanced by what he sees and what Allah discloses to him of the joy of the Gardens and the bliss of its inhabitants. He witnesses the longing of its inhabitants for him and their anticipation of his arrival. This serves as the cause of his equilibrium.\n\nThe station of this Imam is the First Excellence (al-Iḥsān al-Awwal), which is Gabriel’s saying to the Messenger of Allah (peace and blessings be upon him), \"What is Excellence (al-Iḥsān)?\" and his reply (peace be upon him), \"Excellence is that you worship Allah as if you see Him.\"\n\nWhat follows this is not for this Imam. In the hands of this Imam are the interests (maṣāliḥ) of the world and what benefits them. He nurtures the Individuals (Afrād) and feeds them with Divine Gnosis (Maʿārif Ilāhiyya). He distributes gnosis to its people with a verified balance, according to what he sees as beneficial for that Gnostic, so that his soul may live by that gnosis. He holds sovereignty over the two weighty ones (mankind and jinn) and has authority and disposal over them according to what is beneficial for them.\n\nAmong the specific characteristics of this Imam is dwelling (iqāma) upon every state (ḥāl) and station (maqām) he attains. This is not granted to everyone. He does not transition away from a state he is characterized by, nor from a station. When others besides this Imam transition to a station or state, the dominion of that station or state governs him and obscures him from what he transitioned from. This Imam is not like that; the station he transitioned from is preserved for him, and he is not obscured from it—a Divine power Allah has specifically granted him.\n\nHis spirit possesses two hundred and four wings. Whichever wing he spreads, he flies with it wherever he wills. He has a foot in the Third and the First Levels (Marātib). He is sometimes called the Compassionate, Merciful (al-Barr ar-Raḥīm). His beginning was from the Third Level, and his end was at the First Level. Thus, his path was from his goal (nihāya) back to his beginning (bidāya), contrary to the known spiritual journey (sulūk). He returned backward, traversing the stations (maqāmāt), degrees (darajāt), and stages (manāzil). From his end to his beginning are nineteen stages, including the stage of the beginning and the end. Thus, the total stages of his degrees are one hundred and two, ninety, twenty, three, thirty-four, forty-five, fifty-six, sixty-seven, seventy-eight, eighty-nine, and two hundred.\n\nSince the Levels (Marātib) are four, no more, and each Level necessitates endless matters of knowledge, secrets, and states: the First Level is Faith (Īmān), the Second is Sainthood (Wilāya), the Third is Prophethood (Nubuwwa), and the Fourth is Messengership (Risāla). Although Messengership and Prophethood have been cut off in this Community by the ruling of the Law (Tashrīʿ), the inheritance from them has not ceased. Among them are those who inherit Prophethood, and among them are those who inherit both Messengership and Prophethood.\n\nSince we have mentioned what belongs to this Farther Imam, let us mention what belongs to the Nearer Imam, who is the Servant of the King (ʿAbd al-Malik). We say: <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\nThis Imam, by virtue of his spirituality (rūḥāniyya), possesses ninety wings. Whichever wing he spreads, he flies with it wherever he wills. His beginning and his end were in the Second Level; he has no foot in the remaining three Levels. Therefore, he has no stages (manāzil), degrees (darajāt), or stations (maqāmāt) to traverse.\n\nThis Imam possesses severity (shidda) and subjugation (qahr). He has disposal (taṣarruf) through all the Divine Names that necessitate creation (kawn), such as the Creator (al-Khāliq), the Provider (ar-Rāziq), the King (al-Malik), and the Maker (al-Bāriʾ) in some of its aspects, and others. He does not have disposal through the Names of Transcendence (Tanzīh), unlike the Imam mentioned previously.\n\nHe is sought out during severe hardships and major calamities, and Allah relieves them through his hand, for Allah has granted him authority over them. He possesses generosity (karam), but not altruism (īthār), due to his transcendence (nuzāha) from needing what altruism entails. He bestows favors upon creation without their awareness.\n\nIndeed, he bestowed a favor upon me with a glad tiding (bishāra) he gave me. I was unaware of it in my state (ḥāl), but it was my state, and he made me aware of it. He forbade me from attributing myself to any of the Shaykhs I had met, saying to me: \"Do not attribute yourself except to Allah. None of those you met has any hand over you concerning what you possess; rather, Allah has taken charge of you with His providence (ʿināya). Mention the favor of those you met if you wish, but do not affiliate yourself with them; affiliate yourself with your Lord.\"\n\nThe state of this Imam was exactly like my state; none of those he met had any hand over him on the path of Allah, save Allah. This is what a trustworthy source conveyed to me about him, and the Imam informed me of this about himself when I met him in a Barzakhī witnessing (mashhad barzakhī). Praise and favor be to Allah for that.\n\nThe rulers of creation refer back to this Imam; he appoints and dismisses, and Allah repels evils through him. He has strong authority over the fiery spirits of the devils (shayāṭīn) who are far removed from Allah’s mercy.\n\nHe meets with the First, Farther Imam in one degree out of five degrees, while the Farther Imam is unique in the remaining four degrees. We have mentioned enough of his states in a separate section of ours concerning the knowledge of the Pole and the Two Imams. We shall restrict ourselves to what we have mentioned here, desiring brevity.\n\nSince we have mentioned this much concerning the states of the two Imams, let us also mention enough of the account of the Pole (Qutb) for this brief summary, if Allah wills.\n\nAs for the Pole, who is the Servant of Allah (ʿAbd Allāh) and the Servant of the Comprehensive (ʿAbd al-Jāmiʿ), he is characterized by all the Names, both in moral character (takhalluq) and realization (taḥaqquq). He is the mirror of the Real (Mirʾāt al-Ḥaqq), the locus of manifestation (majlā) for the sanctified Attributes (Nuʿūt), and the locus of manifestation for the Divine Manifestations (Maẓāhir Ilāhiyya). He is the Master of the Moment (Ṣāḥib al-Waqt), the Eye of Time (ʿAyn az-Zamān), and the Secret of Destiny (Sirr al-Qadar).\n\nHe possesses the knowledge of the Age of Ages (Dahr ad-Duhūr), which is predominantly hidden, preserved in the treasuries of Zeal (Ghīra), wrapped in the robes of Preservation (Ṣawn). No ambiguity (shubha) assails him, nor does a thought (khāṭir) contrary to his station occur to him.\n\nHe is frequent in marriage, desirous of it, and loves women. He fulfills the right of nature (ṭabīʿa) according to the limit prescribed for him, and he fulfills the right of spirituality (rūḥāniyya) according to the Divine limit. He establishes the balances and acts according to the measure determined for the moment (waqt). What belongs to the moment belongs to him; he belongs to Allah, not to anyone else. His state is Servitude (ʿUbūdiyya) and Need (Iftiqār). He deems the ugly ugly and the beautiful beautiful. He loves restricted beauty (al-jamāl al-muqayyad) in adornment and persons. Spirits come to him in the most beautiful forms, and he melts with love (ʿishq). He shows zeal for Allah and becomes angry for Allah.\n\nThe Divine Manifestations (Maẓāhir Ilāhiyya) are not restricted for him by management (tadbīr); rather, he has absolute freedom (iṭlāq) in them. Thus, his spirituality manifests to him in the management of the manager, from the sensible human being, from behind the veil of the visible (shahāda) and the unseen (ghayb).\n\nHe sees nothing in things except the Face of the Real (Wajh al-Ḥaqq) in them. He establishes the causes (asbāb), maintains them, points to them, and acts according to their ruling. He descends to them until they rule over him and affect him.\n\nHe does not possess Lordship (Rubūbiyya) in any aspect whatsoever. He is constantly accompanied by this state. If he is a man of the world and wealth, he disposes of it with the disposition of a servant over the property of a generous master. If he has no worldly possessions and relies on what is opened up to him, his soul does not yearn for anything. Rather, when his nature requires something, he goes personally to the house of a friend who knows him, presenting what his nature needs, acting as an intercessor for his nature with that friend. He takes from it only what his nature requires and departs. He only sits down for his need out of necessity. If he is not answered, he resorts to Allah concerning the need of his nature, because he is responsible for it, being its governor.\n\nThen he awaits the answer from Allah regarding what he asked. If He wills, He gives him what he asked for, immediately or later. His rank is persistence in asking (ilḥāḥ) and intercession (shafāʿa) on behalf of his nature, unlike the people of states (aṣḥāb al-aḥwāl), for things come into being through their spiritual resolve (himma) and their rejection of causes (asbāb) from their souls; they are Lords (Rabbāniyyūn).\n\nThe Pole is transcendent (munazzah) from the State (al-Ḥāl), established in Knowledge (al-ʿIlm), and witnessed therein, and he acts through it. If the Real informs him of what will be, he reports it out of need (iftiqār) and gratitude to Allah, not out of boasting.\n\nThe earth is not folded up for him, nor does he walk in the air or on water, nor does he eat without a cause. None of the aforementioned breaches of custom (kharq al-ʿawāʾid) or effects granted by the states occur to him, except rarely, for a matter the Real sees fit to enact. This is not sought by the Pole due to hunger, but out of necessity, not choice.\n\nHe likewise abstains from marriage due to lack of means (ṭawl). He knows from the Theophany (tajallī) of marriage what incites him to seek it and be passionately devoted to it. For his Servitude (ʿUbūdiyya) is not realized for him or for any other Gnostic more fully than it is realized in marriage—not in eating, drinking, or wearing clothes to repel harm. He does not desire marriage for procreation (nasl), but purely for pleasure (shahwa) and the presence of procreation within himself for a lawful purpose. Procreation in that context is for the natural purpose of preserving the survival of the species in this abode.\n\nFor the marriage of the possessor of this station is like the marriage of the people of Paradise, purely for pleasure, since it is the Greatest Theophany (at-Tajallī al-Aʿẓam) that has been hidden from the two weighty ones (mankind and jinn), except for those whom Allah has specifically chosen among His servants. The marriage of animals proceeds upon this basis—purely for pleasure—but many Gnostics have been veiled from this Reality, for it is one of the secrets known only to a few people of Divine Providence (ʿInāya).\n\nIf there were no perfect honor in it—indicating the weakness required by Servitude—except what he finds therein of the subjugation (qahr) of pleasure, which annihilates him from his strength and his claim, it is a delightful subjugation. Subjugation is contrary to finding pleasure in it for the subjugated, because pleasure in subjugation is a characteristic specific to the Subjugator, not the subjugated, except in this specific act. People have been veiled from this honor and have deemed it an animalistic desire (shahwa ḥayawāniyya), from which they purify their souls, even though they have named it with the most honorable of names, saying \"animalistic\" (ḥayawāniyya), meaning it is a characteristic specific to the living (ḥayawān). What honor is greater than Life (Ḥayāt)? Thus, what they considered ugly concerning themselves is the very essence of praise according to the perfected Gnostic.\n\nThis matter has passed. As for the Pole’s love for restricted beauty (al-jamāl al-muqayyad) contained within Absolute Beauty (al-jamāl al-muṭlaq), this is due to its proximity in suitability to Beauty. He does not need deep contemplation (ghawr baʿīd) or strength to tear through the veil of natural ugliness (qubḥ aṭ-ṭabʿ) to perceive the Divine Beauty deposited in that ugliness. Restricted beauty grants him his objective at the first glance, so that he may dedicate himself to another matter that is more urgent for him than resisting natural ugliness to perceive Absolute Beauty, since precious breaths are few in the Abode of Responsibility (Dār at-Taklīf). He desires that every soul he meets should receive him with the best manners and and be sent off with the finest robe and adornment. A group of Gnostics have been veiled from this degree of knowledge, and their souls have disdained it due to the common people of worldly aims sharing in it. They did not know that this man witnesses Absolute Beauty in restricted beauty and in everything else, unlike the common people.\n\n### [The Poles are the Perfect Men]\n\nKnow that the Pole is the Perfect Man (al-Rajul al-Kāmil) who has acquired the four dinars, each dinar being twenty-five carats (qīrāṭ), by which men are weighed. Among them are a quarter-man, a half-man, an eighth, a sixth, a half-sixth, three-quarters, and a Perfect Man. The first dinar is for the Perfect Believer (al-Mu’min al-Kāmil). The second dinar is for the Special Saint (al-Walī al-Khāṣṣ). The third dinar is for the two Prophethoods (an-Nubuwwatayn). The fourth dinar is for the two Messengerships (ar-Risālatayn)—meaning the original one by virtue of fatherhood (ubūwa) and the inherited one by virtue of sonship (bunūwa). Whoever acquires the second acquires the first. Whoever acquires the third acquires the second and the first. And whoever acquires the fourth acquires the whole. The Pole is one of the Perfect Men (ar-Rijāl al-Kummal). We say \"one of the Perfect Men\" because of the Individuals (Afrād), for they are also perfected.\n\nAmong the states of the Pole is the confirmation and adherence to customs (al-ʿawādāt). The breach of custom (kharq ʿāda) does not constantly appear upon him, as it does upon the possessor of the State (Ṣāḥib al-Ḥāl). Nor is the breach of custom intended by him; rather, it appears *from* him, but not *by* him, as he has no choice in that. As the Gnostic Abu Saʿūd ibn ash-Shibl said concerning the man who speaks according to the passing thought (khāṭir) and is not with the thought, it occurs in his case by the ruling of existential coincidence (ittifāq wujūdī), and in the case of Allah by the ruling of Will and Intention.\n\nWe have, by the praise of Allah, clarified the specific necessities of the Pole’s states and clarified his rank for those who were ignorant of it, and that true Manhood (Rujūliyya) is not what the ignorant among the common people of the Path imagine, whereby they are veiled by the State (al-Ḥāl) from what Knowledge (al-ʿIlm) and the Station (al-Maqām) necessitate. They say, \"Any knowledge that is not accompanied by a State is nothing.\" Say to him: \"Do not say that, my brother, for it is contrary to the truth. The correct thing to say is: 'Any knowledge that is not derived from Taste (dhawq) is not the knowledge of the People of Allah.'\" I see that you do not distinguish between the State (al-Ḥāl) and the Taste (adh-Dhawq). There is absolutely no knowledge except through Taste; it cannot be otherwise.\n\nThe one established in Servitude (al-ʿUbūda) has absolutely no State (ḥāl) that removes him from his Servitude. If the States had no other defect than that they remove the servant from his station to what he does not deserve and what is not his right—to the extent that if he were to die in the state of the State, he would die as a possessor of deficiency and be resurrected as a possessor of deficiency—then the States are not among the demands of the Men (Rijāl). Rather, the Tastes (Adhwāq) are their demands, and they serve them as proofs (adilla) serve the people of contemplation, due to the knowledge they acquire therein. May Allah make us among those who understood and thus understood His intention. <<وَالله يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ>> (And Allah guides whom He wills to a straight path).\n\nIn this chapter, there is knowledge of what the Pole relies upon from the Divine Presence (al-Ḥaḍra al-Ilāhiyya), knowledge of the relationship of the children of Adam to Allah through specific Names, knowledge of what is to be guarded against and avoided in the spiritual world (al-ʿālam ar-rūḥānī), knowledge of the return of the spiritual world—from where and to where—and knowledge of human emanation (aṣ-ṣudūr al-basharī).",
    "ur": "باب نمبر دو سو ستر (۲۷۰): محمدی مناجات سے قطب (Qutb) اور دو اماموں کے منزل کی معرفت میں\n\nقطب (Qutb) اور امامت کا یہ منزل (منزلة القطب والإمامة)\nایسا منزل ہے جس کی کوئی ظاہری علامت نہیں (منزلة ما لها علامة)\n\nاس کا مالک ایک ہی ہوتا ہے جو بلند ہے (يملكها واحد تعالى)\nسیر (سفر) اور اقامت (ٹھہرنے) کی صفت سے (عن صفة السير والإقامة)\n\nاس کے رنگ پر زردی غالب ہوتی ہے (يعلوه في لونه اصفرار)\nاس کے دائیں رخسار پر ایک تل (شامة) ہوتا ہے (في أيمن الخد منه شامة)\n\nجو پوشیدہ ہوتا ہے اور ابھرا ہوا نہیں ہوتا (خفية ما لها نتو)\nاللہ تعالیٰ نے اسے سلامتی کے ساتھ تائید بخشی ہے (أيده الله بالسلامة)\n\nاللہ نے اسے قیامت کے دن عالمِ امر (عالم الأمر) میں (توجه الله بالمعالي)\nبلندیوں کے ساتھ متوجہ کیا ہے (في عالم الأمر في القيامة)\n\nجان لو، اللہ تعالیٰ اپنی روح سے تمہاری تائید کرے، کہ انبیاء علیہم الصلوٰۃ والسلام میں سے جن چار ہستیوں نے اس منزل (منزل) کو حاصل کیا، وہ محمد، ابراہیم، اسماعیل اور اسحاق علیہم السلام ہیں۔ اور اولیاء میں سے دو ہستیاں ہیں، جو رسول اللہ صلی اللہ علیہ وسلم کے نواسے حسن اور حسین ہیں۔ اگرچہ ان مذکورہ ہستیوں کے علاوہ بھی ہر ایک کو اس میں سے اس کے مرتبہ امامت کے مطابق معلوم حصہ (شرب معلوم) ملتا ہے۔\n\n### [بے شک اقطاب (الأقطاب) کو عبودیت (العبودية) کے نام سے پکارا جاتا ہے]\n\nپس جان لو کہ جب اقطاب (الأقطاب) اور صالحین کو معلوم اسماء سے موسوم کیا جاتا ہے، تو انہیں وہاں صرف اس اسم کے ساتھ عبودیت (العبودية) کے ذریعے پکارا جاتا ہے جو ان کا متولی ہوتا ہے۔ اللہ تعالیٰ فرماتا ہے: **\"اور جب اللہ کا بندہ اسے پکارنے کے لیے کھڑا ہوا\" (وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ)**۔ پس اللہ نے اسے عبداللہ (اللہ کا بندہ) نام دیا، اگرچہ اس کے والد نے اسے محمد اور احمد نام دیا تھا۔ قطب (Qutb) ہمیشہ اس اسم جامع (الاسم الجامع) کے ساتھ مختص ہوتا ہے، لہٰذا وہ وہاں عبداللہ ہوتا ہے۔ پھر وہ اس اسم میں جمع ہونے کے باوجود، جس کا تقاضا مقام (مقام) کرتا ہے، ایک دوسرے پر فضیلت رکھتے ہیں۔ چنانچہ بعض اقطاب اس اسم کے علاوہ دیگر اسماء الٰہیہ (الأسماء الإلهية) میں سے کسی خاص اسم کے ساتھ مختص ہو جاتے ہیں، اور وہ اسم ان کے ساتھ منسوب ہو جاتا ہے اور انہیں مقام قطبیت (مقام القطبية) کے علاوہ کسی اور مقام پر اس نام سے پکارا جاتا ہے۔ جیسے موسیٰ علیہ السلام کا نام عبد الشکور ہے، اور داؤد علیہ السلام کا خاص نام عبد الملک ہے، اور محمد صلی اللہ علیہ وسلم کا نام عبد الجامع ہے۔ کوئی قطب (Qutb) ایسا نہیں جس کا کوئی خاص نام نہ ہو جو اس کے عام نام عبداللہ سے زائد ہو۔ خواہ وہ قطب (Qutb) نبوت کے منقطع دور میں نبی ہو یا شریعت محمدیہ صلی اللہ علیہ وسلم کے دور میں ولی۔\n\nاسی طرح دونوں اماموں (الإمامان) میں سے ہر ایک کا ایک خاص نام ہوتا ہے جس سے اسے اس کے وقت میں وہاں پکارا جاتا ہے۔ پس امام اَیسر (بائیں طرف والا) عبد الملک ہے اور امام اَیمن (دائیں طرف والا) عبد ربہ ہے۔ یہ دونوں قطب (Qutb) کے وزیر ہوتے ہیں۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں، آپ کی وفات تک، ابو بکر رضی اللہ عنہ عبد الملک تھے اور عمر رضی اللہ عنہ عبد ربہ تھے۔ جب آپ صلی اللہ علیہ وسلم کی وفات ہوئی تو ابو بکر کو عبداللہ نام دیا گیا، اور عمر کو عبد الملک نام دیا گیا، اور وہ امام جس نے عمر کا مقام (مقام) وراثت میں پایا، اسے عبد ربہ نام دیا گیا۔ اور یہ سلسلہ قیامت تک اسی طرح جاری رہے گا۔ حسن اور حسین رضی اللہ عنہما اس مقام (مقام) میں ان دیگر لوگوں کے مقابلے میں زیادہ مضبوط تھے جو اس سے متصف ہوئے۔\n\nاور قطب (Qutb) کے لیے سنت الٰہیہ یہ جاری ہے کہ جب وہ مقام (مقام) کا والی بنتا ہے تو وہ قربت (القربة) اور تمکین (التمكين) کی مجالس میں سے کسی مجلس میں کھڑا ہوتا ہے، اور اس کے لیے ایک عظیم تخت نصب کیا جاتا ہے کہ اگر مخلوق اس کی شان و شوکت کو دیکھ لے تو ان کی عقلیں گم ہو جائیں۔ وہ اس پر بیٹھتا ہے اور وہ دونوں امام جنہیں اللہ نے اس کے لیے مقرر کیا ہے، اس کے سامنے کھڑے ہوتے ہیں۔ وہ بیعت الٰہیہ (المبايعة الإلهية) اور استخلاف کے لیے اپنا ہاتھ بڑھاتا ہے، اور ملکی ارواح، جن اور روحانی بشر کو یکے بعد دیگرے اس کی بیعت کا حکم دیا جاتا ہے۔ کیونکہ ذات حق (الحق) کی جناب اس سے بلند ہے کہ وہ ہر وارد ہونے والے کا مصدر ہو، اور اس پر یکے بعد دیگرے کے علاوہ کوئی وارد ہو۔ پس ہر روح جو اس مقام (مقام) پر اس کی بیعت کرتی ہے، وہ اس سے سوال کرتی ہے—یعنی وہ روح قطب (Qutb) سے مسائل میں سے کوئی ایک مسئلہ پوچھتی ہے—تو وہ حاضرین کے سامنے جواب دیتا ہے تاکہ وہ علم میں اس کے منزل (منزل) کو جان سکیں، اور اس وقت وہ جان لیتے ہیں کہ وہ کس اسم الٰہی (اسم إلهي) کے ساتھ مختص ہے۔ ہم نے اس بیعت کے لیے ایک بڑی کتاب مخصوص کی ہے جسے ہم نے \"حضرۃ القرب میں قطب (Qutb) کی بیعت\" نام دیا ہے، اور اس میں بہت سے مسائل کے معانی کا ذکر کیا ہے جو اس سے پوچھے گئے اور اس نے جواب دیے۔ اس کی بیعت صرف مطہر اور مقرب ارواح ہی کرتی ہیں، اور بیعت کرنے والی ارواح میں سے ملائکہ، جن اور بشر میں سے صرف ان اقطاب (الأقطاب) کی ارواح ہی سوال کرتی ہیں جو گزر چکے ہیں۔ پس ہم نے اس کتاب میں ان کے سوالات اور ان کے مکمل جوابات کا ذکر کیا ہے۔ اور ہر قطب (Qutb) کی حالت یہی ہوتی ہے جو اپنے زمانے میں بیعت کرتا ہے۔\n\nپس ہم اس باب میں ہر قطب (Qutb) کے بعض عام احوال کا ذکر کریں گے نہ کہ اس کے خاص احوال کا، تاکہ میری اس کتاب پر مطلع ہونے والا صاحب ذوق (الذوق) اور مشاہدہ کرنے والا جان لے کہ ہم نے اپنی اس کتاب میں اس طریقے سے انحراف نہیں کیا جسے اس شان کے ہر عارف (عارف) سے کوئی بھی ناواقف نہیں ہے۔ اگر ہم اس کے خاص حال (حال) کا ذکر کرتے تو شاید کوئی کہنے لگتا کہ یہ دعویٰ ہے۔ پس ہم پہلے امام اَقصٰی (الإمام الأقصى) کے حال سے شروع کرتے ہیں، پھر امام اَدنیٰ (الإمام الأدنى) کے حال سے، اور پھر قطب (Qutb) کے حال سے۔\n\nجہاں تک امام اَقصٰی (الإمام الأقصى) کا تعلق ہے، جو عبد ربہ ہے، تو اس کا حال (حال) دنیا پر شفقت کی وجہ سے رونا ہے، جب وہ انہیں نافرمانیوں میں مبتلا دیکھتا ہے اور ان اسماء الٰہیہ (الأسماء الإلهية) کے توجہ کو دیکھتا ہے جو سزا اور گرفت کا تقاضا کرتے ہیں۔ اور اس پر اسماء الٰہیہ (الأسماء الإلهية) میں سے وہ ظہور (تجلی) نہیں ہوتا جو ان نافرمانیوں کے باوجود عفو اور درگزر کا تقاضا کرے۔ اسی لیے اس کا رونا زیادہ ہوتا ہے۔ وہ ہمیشہ اللہ کے بندوں کے لیے دعا گو رہتا ہے، ان پر رحم کرتا ہے، اور اللہ سبحانہ و تعالیٰ سے سوال کرتا ہے کہ وہ انہیں موافقت کے راستے پر چلائے۔ میں نے اپنی بعض روحانی سیاحتوں (سیاحات) میں اس امام کا مشاہدہ کیا ہے، تو میں نے صالحین میں سے کسی کو بھی اللہ کے بندوں پر اس سے زیادہ خوف کھانے والا اور اس سے زیادہ رحم کرنے والا نہیں دیکھا۔ میں نے اس سے پوچھا: \"آپ کو اللہ کے لیے غیرت کیوں نہیں آتی؟\" تو اس نے کہا: \"میں یہ نہیں چاہتا کہ میری خاطر اللہ کے لیے غیرت کھائی جائے، بلکہ میں یہ چاہتا ہوں کہ میری خاطر اللہ سے سوال کیا جائے تاکہ وہ مجھ پر رحم کرے اور درگزر کرے۔ پس میں اللہ کے بندوں کے لیے وہی پسند کرتا ہوں جو اپنے لیے پسند کرتا ہوں۔ اور اللہ کے ساتھ سچے شخص کے لیے یہ مناسب نہیں کہ وہ اپنے آپ کو ایسے حال (حال) کی صورت میں تصور کرے جو اس کے مقام (مقام) کے لائق نہ ہو۔\"\n\nاور اس امام کے پاس ان شیاطین پر زبردست قوتِ سلطنت ہے جو اہل خیر و صلاح کے ساتھ لگے رہتے ہیں تاکہ انہیں ان کے راستے سے ہٹا دیں۔ جب شیطان کی نظر اس امام پر پڑتی ہے، جبکہ وہ کسی صالح شخص کے پاس ہوتا ہے اور یہ تدبیر کر رہا ہوتا ہے کہ اسے اس کے طریقے سے کیسے ہٹائے، تو وہ اس طرح پگھل جاتا ہے جیسے آگ میں سیسہ پگھلتا ہے۔ پھر امام اسے اس کے نام سے پکارتا ہے، شاید وہ سلامتی حاصل کر لے۔ پس وہ اسے ربانی تدبیر سے چلاتا ہے۔ اور وہ صالح شخص اس قسم کے شیاطین کے القاء سے ہمیشہ محفوظ رہتا ہے جو اسے اس کی صلاح سے نکالنے کی کوشش کرتے ہیں، جب تک یہ امام حاضر ہو اور اسے دیکھ رہا ہو، اگرچہ وہ صالح شخص اسے نہ جانتا ہو اور نہ ہی جانتا ہو کہ کیا ہوا ہے۔ ہم نے اس گروہ کا مشاہدہ کیا ہے۔ پس اللہ تعالیٰ اپنے بندوں سے ان شرور کو اس امام کے ذریعے دور کرتا ہے جو خاص طور پر اس کے صالح بندوں کے ساتھ مخصوص ہوتے ہیں، یہ اس کی طرف سے ان پر خاص عنایت ہوتی ہے۔\n\nاور اس امام کی خاصیت میں سے یہ ہے کہ وہ اللہ کی طرف سے دی گئی ہر خبر کی تصدیق کرتا ہے، خواہ وہ خبر دینے والا اپنی خبر میں سچا ہو یا جھوٹا ہو۔ کیونکہ یہ امام اس کی تصدیق اس لیے کرتا ہے کہ وہ اس اسم الٰہی (الاسم الإلهي) کو دیکھ رہا ہوتا ہے جو اس خبر دینے والے کی خبروں میں اس کا متولی ہوتا ہے۔ اگر وہ سچا ہے تو اس کی خبر کشف محقق (کشف محقق) سے ہوتی ہے، اور اس میں وہ اور امام برابر ہوتے ہیں۔ اور اگر اسے کشف (کشف) حاصل نہ ہو اور وہ کسی ایسی چیز کی خبر دے جو اس کے پاس واقع ہوئی ہو، اور وہ نہیں جانتا کہ اسے کس نے واقع کیا، اور وہ جھوٹ بولنے کا ارادہ رکھتا ہو، تب بھی یہ امام اس کی خبروں کی تصدیق کرتا ہے، جبکہ خبر دینے والا اپنے جھوٹ کے ارادے کی وجہ سے اللہ کی طرف سے سزا یافتہ اور محروم ہوتا ہے، حالانکہ حقیقت میں وہ خبر جھوٹی نہیں ہوتی۔ پس اس کے ارادے کا وبال اسی پر لوٹتا ہے، اور اگر اللہ اسے اس پر پکڑے تو اسے عذاب دیا جاتا ہے۔\n\nاور اس امام کے احوال (الأحوال) میں سے یہ ہے کہ وہ ہمیشہ احوال (الأحوال) میں سے مقامِ مشاہدہ (مقام المشاهدة) اور مقامات (المقامات) میں سے مقامِ صلاح کی طرف منتقل ہونے کا سوال کرتا ہے۔ اور اسے جنتوں پر دائمی اطلاع حاصل ہوتی ہے۔ اللہ نے اسے یہ اطلاع صرف اس پر شفقت کرتے ہوئے خاص کی ہے، تاکہ وہ اپنے رونے اور غم کو، جو اسے مایوسی کی طرف لے جا سکتا ہے، اس کے ذریعے متوازن کر سکے جو وہ دیکھتا ہے اور جس پر اللہ اسے مطلع کرتا ہے، یعنی جنتوں کی خوشی اور ان کے مکینوں کی نعمتیں، اور وہ ان کے شوق اور اس کے آنے کے انتظار کا مشاہدہ کرتا ہے، جو اس کے اعتدال کا سبب بنتا ہے۔\n\nاور اس امام کا مقام (مقام) احسانِ اوّل ہے، اور وہ جبرائیل علیہ السلام کا رسول اللہ صلی اللہ علیہ وسلم سے سوال ہے کہ احسان کیا ہے؟ اور آپ صلی اللہ علیہ وسلم کا جواب ہے: **\"احسان یہ ہے کہ تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو\"**۔ اور جو اس کے بعد ہے وہ اس امام کے لیے نہیں ہے۔\n\nاور اس امام کے ہاتھ میں دنیا کے مصالح اور وہ چیزیں ہیں جن سے وہ فائدہ اٹھاتے ہیں۔ وہ افراد کی تربیت کرتا ہے اور انہیں معارف الٰہیہ (المعارف الإلهية) سے غذا دیتا ہے، اور معارف کو ان کے اہل پر ایک محقق میزان کے ساتھ تقسیم کرتا ہے، اس مقدار کے مطابق جس میں وہ اس عارف (عارف) کی بہتری دیکھتا ہے، تاکہ اس معرفت (معرفۃ) سے اس کی روح زندہ ہو جائے۔ اسے جن و انس (ثقلین) پر سیادت حاصل ہے اور وہ ان میں مصلحت کے مطابق حکم اور تصرف کرتا ہے۔\n\nاور اس امام کی خصوصیات میں سے یہ ہے کہ وہ ہر اس حال (حال) اور مقام (مقام) پر قائم رہتا ہے جو اسے حاصل ہوتا ہے، اور یہ ہر کسی کے لیے نہیں ہے۔ پس وہ کسی حال (حال) سے متصف ہو کر اس سے منتقل نہیں ہوتا، اور نہ ہی کسی مقام (مقام) سے۔ اس امام کے علاوہ جب کوئی دوسرے مقام (مقام) یا حال (حال) کی طرف منتقل ہوتا ہے تو اس مقام اور حال کا سلطان اس پر حکم چلاتا ہے اور اسے اس چیز سے غائب کر دیتا ہے جس سے وہ منتقل ہوا تھا، لیکن یہ امام ایسا نہیں ہے۔ کیونکہ جس مقام (مقام) سے وہ منتقل ہوا ہے وہ اس کے لیے محفوظ رہتا ہے، اور وہ اس سے غائب نہیں ہوتا، یہ ایک الٰہی قوت ہے جو اللہ نے اسے خاص طور پر عطا کی ہے۔\n\nاور اس کی روح کے لیے دو سو چار (۲۰۴) پر (جناح) ہیں، ان میں سے جو بھی پر وہ کھولتا ہے، وہ اس کے ذریعے جہاں چاہتا ہے پرواز کرتا ہے۔ اور اس کا قدم تیسرے اور پہلے مرتبہ (مرتبہ) میں ہے۔ اور بعض اوقات اسے \"البر الرحیم\" (نیک اور رحم کرنے والا) کے نام سے پکارا جاتا ہے۔ اس کی ابتدا تیسرے مرتبہ (مرتبہ) سے ہوئی اور اس کی انتہا پہلے مرتبہ پر ہوئی، پس اس کا طریقہ اپنی انتہا سے اپنی ابتدا کی طرف تھا، جو معروف سلوک کے برعکس ہے۔ اس نے مقامات (المقامات)، درجات اور منازل (المنازل) کو طے کرتے ہوئے پیچھے کی طرف رجوع کیا۔ پس اس کی انتہا سے اس کی ابتدا تک انیس (۱۹) منزلیں ہیں، جن میں ابتدا اور انتہا کی منزل بھی شامل ہے۔ پس اس کے درجات کی منزلیں مکمل ہو کر دو سو نوے (۲۹۰) ہو گئیں [۱۰۰، ۱۲، ۹۰، ۲۰، ۳، ۳۴، ۴۵، ۵۶، ۶۷، ۷۸، ۸۰، ۹، ۲۰۰]۔ اور چونکہ مراتب چار ہیں اور ان سے زیادہ نہیں، اور ہر مرتبہ علوم، اسرار اور احوال (أحوال) میں سے لامتناہی امور کا تقاضا کرتا ہے، تو پہلا مرتبہ ایمان ہے، دوسرا ولایت (ولایۃ)، تیسرا نبوت (نبوۃ)، اور چوتھا رسالت (رسالۃ) ہے۔ اور اگرچہ اس امت میں تشریع کے حکم سے رسالت (رسالۃ) اور نبوت (نبوۃ) منقطع ہو چکی ہے، لیکن ان کی وراثت منقطع نہیں ہوئی ہے۔ پس ان میں سے بعض نبوت (نبوۃ) کے وارث ہوتے ہیں، اور بعض رسالت (رسالۃ) اور نبوت (نبوۃ) دونوں کے وارث ہوتے ہیں۔\n\nاور چونکہ ہم نے امام اَقصٰی (الإمام الأقصى) کے لیے جو کچھ ہے وہ ذکر کر دیا ہے، تو اب ہم امام اَدنیٰ (الإمام الأدنى) کا ذکر کرتے ہیں، جو عبد الملک ہے۔ پس ہم کہتے ہیں: **\"اور اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)**۔ اس امام کے لیے اس کی روحانیت کی طرف سے نوے (۹۰) پر (جناح) ہیں، ان میں سے جو بھی پر وہ کھولتا ہے، وہ اس کے ذریعے جہاں چاہتا ہے پرواز کرتا ہے۔ اس کی ابتدا اور انتہا دوسرے مرتبہ (مرتبہ) میں تھی، باقی تین مراتب میں اس کا کوئی قدم نہیں ہے۔ پس اس کے لیے کوئی منازل (منازل)، درجات یا مقامات (مقامات) نہیں ہیں جنہیں وہ طے کرے۔ اس امام کے لیے سختی اور قہر ہے، اور اسے ان تمام اسماء الٰہیہ (الأسماء الإلهية) کے ذریعے تصرف حاصل ہے جو کائنات کا تقاضا کرتے ہیں، جیسے الخالق، الرازق، الملک، اور البارئ (بعض وجوہ سے) اور دیگر۔ اور اسے اسماء التنزیہ (تنزیہ کے اسماء) کے ذریعے تصرف حاصل نہیں ہے، برخلاف اس امام کے جس کا ذکر پہلے ہو چکا ہے۔ بڑی سختیوں اور مصیبتوں میں اسی کی طرف رجوع کیا جاتا ہے، تو اللہ اس کے ہاتھ پر انہیں دور کر دیتا ہے، کیونکہ اللہ نے اسے ان پر سلطنت عطا کی ہے۔ اسے کرم حاصل ہے، لیکن ایثار (دوسروں کو ترجیح دینا) حاصل نہیں ہے، کیونکہ وہ اس چیز کی حاجت سے پاک ہے جس کے ذریعے ایثار واقع ہوتا ہے۔ اور وہ مخلوق پر اس طرح انعام کرتا ہے کہ انہیں شعور بھی نہیں ہوتا۔\n\nاور اس نے مجھ پر ایک بشارت کے ذریعے انعام کیا جس کی اس نے مجھے خوشخبری دی، اور میں اسے اپنے حال (حال) میں نہیں جانتا تھا، حالانکہ وہ میرا حال تھا۔ پس اس نے مجھے اس پر مطلع کیا اور مجھے ان شیوخ سے نسبت رکھنے سے منع کیا جن سے میں ملا تھا، اور مجھ سے کہا: \"صرف اللہ سے نسبت رکھو۔ تم جس حال میں ہو، اس میں تم سے ملنے والے کسی بھی شخص کا کوئی ہاتھ نہیں ہے، بلکہ اللہ نے اپنی عنایت سے تمہاری سرپرستی کی ہے۔ اگر تم چاہو تو جن سے ملے ہو ان کی فضیلت بیان کرو، لیکن ان کی طرف نسبت نہ کرو، بلکہ اپنے رب کی طرف نسبت کرو۔\" اور اس امام کا حال (حال) بھی میرے حال جیسا ہی تھا، یعنی اللہ کے راستے میں اس سے ملنے والے کسی بھی شخص کا اس پر کوئی ہاتھ نہیں تھا، سوائے اللہ کے۔ یہ بات میرے نزدیک قابل اعتماد شخص نے اس کی طرف سے مجھے نقل کی، اور امام نے خود بھی مجھے اس کے بارے میں بتایا جب میں ایک برزخی مشہد (مشہد برزخي) میں اس سے ملا تھا، جس میں اللہ کے لیے حمد اور احسان ہے۔\n\nاور مخلوق کے امور کے والی اسی امام کی طرف رجوع کرتے ہیں، پس وہ مقرر کرتا ہے اور معزول کرتا ہے، اور اللہ اس کے ذریعے شرور کو دور کرتا ہے۔ اسے اللہ کی رحمت سے دور کیے گئے شیاطین کی ناری ارواح پر قوی سلطنت حاصل ہے۔ اور وہ پہلے امام اَقصٰی (الإمام الأقصى) کے ساتھ پانچ درجات میں سے ایک درجہ میں شریک ہوتا ہے، اور امام اَقصٰی (الإمام الأقصى) اس سے چار درجات میں منفرد ہوتا ہے۔ ہم نے اس کے احوال (أحوال) کا ذکر اپنی ایک کتاب میں کیا ہے جو \"قطب (Qutb) اور دو اماموں کی معرفت\" کے بارے میں ہے، جس میں کافی معلومات ہیں۔ پس ہم اختصار کی خواہش میں اسی پر اکتفا کرتے ہیں جو ہم نے ذکر کیا ہے۔\n\nاور چونکہ ہم نے دونوں اماموں (الإمامين) کے احوال (أحوال) کا اتنا حصہ ذکر کر دیا ہے، تو اب ہم قطب (Qutb) کے بارے میں بھی اتنا ذکر کرتے ہیں جو اس عجلت میں کافی ہو، ان شاء اللہ۔\n\nجہاں تک قطب (Qutb) کا تعلق ہے، جو عبداللہ ہے اور عبد الجامع بھی ہے، تو وہ وہ ہستی ہے جو اخلاق اور تحقق کے لحاظ سے تمام اسماء کے ساتھ متصف ہے۔ وہ ذات حق (الحق) کا آئینہ ہے، مقدس صفات کا مظہر (مجلی)، اور مظاہر الٰہیہ (المظاهر الإلهية) کا ظہور گاہ ہے۔ وہ صاحب الوقت (وقت کا مالک)، زمانے کی آنکھ، اور تقدیر کا راز ہے۔ اسے دہر الدہور (زمانوں کے زمانے) کا علم حاصل ہے، جس پر پوشیدگی غالب رہتی ہے، جو غیرت کے خزانوں میں محفوظ ہے، اور حفاظت کی چادروں میں لپٹا ہوا ہے۔ اسے کوئی شبہ لاحق نہیں ہوتا اور نہ ہی کوئی ایسا خیال اس کے دل میں آتا ہے جو اس کے مقام (مقام) کے منافی ہو۔ وہ کثرت سے نکاح کرنے والا، اس میں رغبت رکھنے والا، اور عورتوں سے محبت کرنے والا ہوتا ہے۔ وہ اپنی طبیعت کا حق اس حد تک پورا کرتا ہے جو اس کے لیے مشروع ہے، اور روحانیت کا حق اس حد تک پورا کرتا ہے جو الٰہی حد ہے۔ وہ میزانیں قائم کرتا ہے اور مقررہ مقدار کے مطابق تصرف کرتا ہے۔ وقت کے لیے جو کچھ ہے، وہ اس کے لیے ہے، اور وہ اللہ کے لیے ہے، کسی اور کے لیے نہیں۔ اس کا حال (حال) عبودیت (العبودية) اور افتقار (محتاجی) ہے۔ وہ قبیح کو قبیح اور حسن کو حسن قرار دیتا ہے۔ وہ زینت اور اشخاص میں مقید جمال سے محبت کرتا ہے۔ ارواح اس کے پاس بہترین صورتوں میں آتی ہیں، اور وہ عشق میں گھل جاتا ہے۔ وہ اللہ کے لیے غیرت کھاتا ہے اور اللہ کے لیے غضبناک ہوتا ہے۔ اس کے لیے مظاہر الٰہیہ (المظاهر الإلهية) تدبیر کے ساتھ مقید نہیں ہوتے، بلکہ اسے ان میں مطلق آزادی حاصل ہوتی ہے۔ پس وہ اسے مدبر کی تدبیر میں، محسوس بشر کی روحانیت میں، حجابِ شہادت اور غیب کے پیچھے سے ظاہر ہوتے ہیں۔ وہ اشیاء میں صرف ذات حق (الحق) کا چہرہ دیکھتا ہے۔ وہ اسباب کو قائم کرتا ہے، ان کی نشاندہی کرتا ہے، اور ان کے حکم کے مطابق چلتا ہے۔ وہ ان کی طرف اترتا ہے یہاں تک کہ وہ اس پر حکم چلائیں اور اس پر اثر انداز ہوں۔ اس میں کسی بھی صورت میں ربانیت نہیں ہوتی، اور وہ ہمیشہ اس حال (حال) کا مصاحب رہتا ہے۔\n\nاگر وہ دنیا اور دولت کا مالک ہو تو وہ اس میں ایک کریم آقا کے مال میں غلام کی طرح تصرف کرتا ہے۔ اور اگر اس کے پاس دنیا نہ ہو اور وہ اس پر ہو جو اس پر کھولا جاتا ہے، تو اس کا نفس کسی چیز کی طرف جھکتا نہیں، بلکہ جب اسے اپنی طبیعت کی کسی ضرورت کی حاجت ہوتی ہے تو وہ خود ہی کسی ایسے دوست کے گھر جاتا ہے جو اسے جانتا ہو، اور اس پر اپنی طبیعت کی ضرورت پیش کرتا ہے، گویا وہ اس کے پاس اس کی شفاعت کر رہا ہو۔ پس وہ اس میں سے اتنی مقدار لے لیتا ہے جتنی اس کی طبیعت کو ضرورت ہوتی ہے اور واپس چلا جاتا ہے۔ وہ اپنی حاجت کے لیے صرف ضرورت کے تحت ہی بیٹھتا ہے۔ اگر اسے جواب نہ ملے تو وہ اپنی طبیعت کی حاجت کے لیے اللہ کی طرف رجوع کرتا ہے، کیونکہ وہ اس کا والی ہونے کی وجہ سے اس کا ذمہ دار ہے۔ پھر وہ اللہ کی طرف سے اس چیز کے جواب کا انتظار کرتا ہے جو اس نے مانگی ہے۔ اگر اللہ چاہے تو اسے وہ چیز فوراً یا بعد میں عطا کر دیتا ہے۔ پس اس کا مرتبہ (مرتبہ) سوال میں اصرار کرنا اور اپنی طبیعت کے حق میں شفاعت کرنا ہے۔ یہ اصحابِ احوال (أصحاب الأحوال) کے برعکس ہے، کیونکہ اشیاء ان کی ہمت سے اور ان کے اسباب کو اپنے نفوس سے دور کرنے سے وجود میں آتی ہیں، پس وہ ربانی ہوتے ہیں۔ جبکہ قطب (Qutb) حال (حال) سے پاک ہوتا ہے، وہ علم میں ثابت ہوتا ہے اور اس میں مشہود (شہود) ہوتا ہے، پس وہ اس کے ذریعے تصرف کرتا ہے۔ اگر ذات حق (الحق) اسے کسی ہونے والی چیز پر مطلع کرتا ہے تو وہ اس کی خبر افتقار (محتاجی) اور اللہ کے احسان کے طور پر دیتا ہے، نہ کہ فخر کے طور پر۔\n\nاس کے لیے زمین لپیٹی نہیں جاتی، نہ وہ ہوا میں چلتا ہے اور نہ پانی پر، اور نہ ہی وہ بغیر سبب کے کھاتا ہے۔ اور خرقِ عادات (عادات کو توڑنا) میں سے کوئی بھی چیز جو احوال (الأحوال) عطا کرتے ہیں، اس پر وارد نہیں ہوتی، مگر شاذ و نادر ہی کسی ایسے امر کے لیے جسے ذات حق (الحق) دیکھتا ہے اور اسے انجام دیتا ہے۔ یہ قطب (Qutb) کے لیے مطلوب نہیں ہوتا، بھوک کی وجہ سے اضطراراً، نہ کہ اختیاراً۔ اور اسی طرح وہ نکاح سے بھی صبر کرتا ہے اگر اس کے پاس استطاعت نہ ہو۔ وہ نکاح کے ظہور (تجلی) سے وہ کچھ جانتا ہے جو اسے اس کے طلب کرنے اور اس سے عشق کرنے پر ابھارتا ہے، کیونکہ اس کے لیے اور دیگر عارفین (العارفين) کے لیے اس کی عبودیت (عبوديتہ) اتنی زیادہ کسی اور چیز میں متحقق نہیں ہوتی جتنی نکاح میں ہوتی ہے، نہ کھانے میں، نہ پینے میں، اور نہ ہی کسی نقصان کو دور کرنے کے لیے لباس میں۔ اور وہ نکاح میں نسل کے لیے رغبت نہیں رکھتا، بلکہ محض شہوت کے لیے اور ایک مشروع امر کے لیے اپنے نفس میں تناسل کو حاضر کرنے کے لیے رغبت رکھتا ہے۔ اور اس میں تناسل نوع کی بقا کو اس دنیا میں محفوظ رکھنے کے لیے ایک فطری امر کے طور پر ہوتا ہے۔ پس اس مقام (مقام) کے مالک کا نکاح جنتیوں کے نکاح کی طرح محض شہوت کے لیے ہوتا ہے، کیونکہ یہ وہ ظہور اعظم (التجلي الأعظم) ہے جو جن و انس (ثقلین) سے پوشیدہ رہا، سوائے ان کے جنہیں اللہ نے اپنے بندوں میں سے خاص کیا۔ اور اسی پر چوپایوں کا نکاح بھی محض شہوت کے لیے جاری ہوتا ہے، لیکن بہت سے عارفین (العارفين) اس حقیقت سے غافل رہے، کیونکہ یہ ان اسرار میں سے ہے جن پر اہل عنایت میں سے صرف قلیل ہی واقف ہوتے ہیں۔\n\nاور اگر اس میں عبودیت (العبودية) کے ضعف کے تقاضے پر دلالت کرنے والی کامل شرافت میں سے کچھ نہ ہوتا، سوائے اس کے کہ وہ اس میں لذت کے قہر کو پاتا ہے جو اسے اس کی قوت اور دعوے سے فنا کر دیتا ہے، تو یہ ایک لذیذ قہر ہے۔ کیونکہ قہر مقہور کے حق میں اس سے لذت حاصل کرنے کے منافی ہے، اس لیے کہ قہر میں لذت قاہر کی خصوصیات میں سے ہے نہ کہ مقہور کی خصوصیات میں سے، سوائے اس خاص فعل کے۔ اور لوگ اس شرافت سے غافل رہے اور اسے حیوانی شہوت قرار دیا، اور اپنے نفوس کو اس سے پاک قرار دیا، حالانکہ انہوں نے اسے اشرف ترین نام سے موسوم کیا، یعنی ان کا قول \"حیوانیت\" (حیوانية)، یعنی یہ حیوان کی خصوصیات میں سے ہے۔ اور زندگی (حیات) سے بڑھ کر کون سی شرافت ہو سکتی ہے؟ پس جسے انہوں نے اپنے حق میں قباحت سمجھا، وہ عارف کامل (العارف المكمل) کے نزدیک عین تعریف ہے۔ یہ بات اپنے راستے پر چلی گئی۔\n\nاور جہاں تک قطب (Qutb) کی مقید جمال سے محبت کا تعلق ہے جو جمال مطلق (الجمال المطلق) میں شامل ہے، تو یہ جمال سے مناسبت میں اس کے قرب کی وجہ سے ہے، پس اسے اس میں کسی گہری غور و فکر اور قوت کی ضرورت نہیں پڑتی جس سے وہ طبعی قباحت کے حجاب کو چاک کر کے اس قباحت میں ودیعت کردہ جمال الٰہی (الجمال الإلهي) کا ادراک کرے۔ پس مقید جمال اسے پہلی ہی نظر میں اس کا مقصود عطا کر دیتا ہے، تاکہ وہ کسی دوسرے امر کی طرف متوجہ ہو سکے جو اس پر طبعی قباحت کا مقابلہ کرنے سے زیادہ اہم ہے تاکہ جمال مطلق (الجمال المطلق) کا ادراک ہو، کیونکہ دارِ تکلیف میں نفوس عزیز ہوتے ہیں۔ اور وہ یہ چاہتا ہے کہ اس کا کوئی نفس نہ ہو مگر یہ کہ اس نے اسے بہترین ادب سے حاصل کیا ہو اور بہترین خلعت اور زینت سے اسے رخصت کیا ہو۔ عارفین (العارفين) کی ایک جماعت اس قدر معرفت (معرفۃ) سے غافل رہی، اور ان کے نفوس نے اس سے نفرت کی کیونکہ اس میں عام لوگوں کی اغراض کی شرکت ہوتی ہے، حالانکہ وہ نہیں جانتے تھے کہ یہ شخص مقید جمال میں اور اس کے علاوہ میں بھی جمال مطلق (الجمال المطلق) کا مشاہدہ کرتا ہے، برخلاف عام لوگوں کے۔\n\n### [بے شک اقطاب (الأقطاب) ہی کامل مرد ہیں]\n\nاور جان لو کہ قطب (Qutb) وہ انسان کامل (الإنسان الکامل) ہے جس نے چار دینار حاصل کر لیے ہیں، جن میں سے ہر دینار پچیس قیراط کا ہے، اور انہی سے مردوں کو تولا جاتا ہے۔ پس ان میں سے چوتھائی مرد، آدھا، آٹھواں، چھٹا، آدھا چھٹا، تین چوتھائی اور کامل مرد ہوتے ہیں۔ پہلا دینار کامل مومن کے لیے ہے، دوسرا دینار خاص ولی (ولی) کے لیے ہے، تیسرا دینار دونوں نبوتوں کے لیے ہے، اور چوتھا دینار دونوں رسالتوں کے لیے ہے، یعنی ابوت کے حکم سے اصلی رسالت اور بنوت کے حکم سے وراثتی رسالت۔ پس جس نے دوسرا دینار حاصل کیا، اسے پہلا بھی حاصل ہو گیا، اور جس نے تیسرا حاصل کیا، اسے دوسرا اور پہلا بھی حاصل ہو گیا، اور جس نے چوتھا حاصل کیا، اسے سب کچھ حاصل ہو گیا۔ اور قطب (Qutb) کامل مردوں میں سے ہے۔ اور ہم نے اسے کامل مردوں میں سے اس لیے کہا کیونکہ افراد (الأفراد) بھی کامل ہوتے ہیں اور وہ مکمل کرنے والے ہوتے ہیں۔\n\nاور قطب (Qutb) کے احوال (أحوال) میں سے یہ ہے کہ وہ عادات کو برقرار رکھتا ہے اور ان پر چلتا ہے، اور اس پر ہمیشہ خرقِ عادت (عادت کو توڑنا) ظاہر نہیں ہوتا جیسا کہ صاحبِ حال (صاحب الحال) پر ظاہر ہوتا ہے۔ اور خرقِ عادت اس کا مقصود نہیں ہوتا، بلکہ وہ اس سے ظاہر ہوتی ہے نہ کہ اس کے ذریعے، کیونکہ اس میں اسے کوئی اختیار نہیں ہوتا۔ جیسا کہ عارف (عارف) ابو السعود بن الشبل نے اس شخص کے بارے میں کہا جو خاطر (دل میں آنے والا خیال) پر بات کرتا ہے اور جو خاطر کے ساتھ ہوتا ہے، تو اس کے حق میں یہ وجودی اتفاق کے حکم سے ہوتا ہے، اور اللہ کے حق میں ارادے اور قصد کے حکم سے ہوتا ہے۔ پس ہم نے اللہ کی حمد کے ساتھ قطب (Qutb) کے خاص ضروری احوال (أحوال) کو بیان کر دیا ہے، اور اس کے مرتبہ (مرتبہ) کو ان لوگوں کے لیے بیان کر دیا ہے جو اسے نہیں جانتے، اور یہ کہ رجولیت (مردانگی) وہ نہیں ہے جو عام جہال طریقت کے لوگ اللہ کے راستے میں گمان کرتے ہیں، پس وہ حال (حال) کے ذریعے اس چیز سے پردہ میں رہ جاتے ہیں جس کا تقاضا علم اور مقام (مقام) کرتے ہیں۔ اور وہ کہتے ہیں کہ ہر وہ علم جو حال (حال) سے نہ ہو، وہ کوئی چیز نہیں ہے۔ تو تم ان سے کہو: \"اے میرے بھائی! ایسا مت کہو، کیونکہ یہ امر کے خلاف ہے۔\" بلکہ صحیح بات یہ ہے کہ تم کہو: \"ہر وہ علم جو ذوق (ذوق) سے نہ ہو، وہ اہل اللہ کا علم نہیں ہے۔\" میں دیکھتا ہوں کہ تم حال (حال) اور ذوق (ذوق) میں فرق نہیں کرتے، حالانکہ کوئی علم ذوق (ذوق) کے بغیر نہیں ہوتا، اس کے علاوہ کچھ نہیں ہو سکتا۔ اور عبودیت (العبودية) میں متمکن شخص کے لیے کوئی حال (حال) نہیں ہوتا جو اسے اس کی عبودیت سے نکال دے۔ اگر احوال (الأحوال) میں کوئی نقص نہ ہوتا، سوائے اس کے کہ وہ بندے کو اس کے مقام (مقام) سے نکال کر ایسی چیز کی طرف لے جاتے ہیں جس کا وہ مستحق نہیں اور نہ ہی وہ اس کا حق ہے، یہاں تک کہ اگر وہ حال (حال) کی حالت میں مر جائے تو وہ ناقص حالت میں مرے گا اور ناقص حالت میں اٹھایا جائے گا۔ پس احوال (الأحوال) مردوں کے مطالبات میں سے نہیں ہیں، لیکن اذواق (ذوق) ان کے مطالبات ہیں، اور وہ ان کے لیے ان علوم کی حیثیت رکھتے ہیں جو انہیں ان میں حاصل ہوتے ہیں، جیسے اہل نظر کے لیے دلائل ہوتے ہیں۔ پس اللہ ہمیں ان لوگوں میں شامل کرے جنہوں نے سمجھا اور اللہ کی مراد کو سمجھا۔ **\"اور اللہ جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے\" (وَاللَّهُ يَهْدِي مَن يَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيمٍ)**۔ اور اس باب کے علوم میں وہ علم شامل ہے جس پر حضرۃ الٰہیہ (الحضرة الإلهية) سے بھروسہ کیا جاتا ہے، اور مخصوص اسماء سے بنی آدم کی اللہ کی طرف نسبت کا علم، اور روحانی دنیا سے بچنے اور ڈرنے کا علم، اور روحانی دنیا کی واپسی کا علم کہ کہاں سے اور کہاں تک، اور بشری سینوں کا علم۔",
    "fa": "«باب دویست و هفتادم در معرفت منزل قطب و دو امام از مناجات محمدیه»\n\n> مقام قطب و امامت، مقامی است که نشانه‌ای ندارد.\n> آن را یکتایی مالک است که از صفت سیر و اقامت برتر است.\n> در رنگ او زردی غالب است، و در گونه راستش خالی است،\n> پنهان است و برآمدگی ندارد، خداوند او را به سلامت تأیید کرده است.\n> خداوند او را در عالم امر در قیامت به معالی (بلندی‌ها) متوجه ساخته است.\n\nبدان، خداوند تو را با روحی از جانب خود تأیید کند، که از پیامبرانی که به این منزل (منزلت) متحقق شده‌اند، چهار نفر هستند: محمد، ابراهیم، اسماعیل و اسحاق (علیهم السلام). و از اولیا دو نفر هستند که حسن و حسین، دو سبط (نواده) رسول خدا (صلی الله علیه و سلم) می‌باشند. اگرچه برای غیر از این افراد مذکور نیز نصیب معلومی (شرب معلوم) از آن، به اندازه مرتبه‌شان از امامت، وجود دارد.\n\n### [قطب‌ها به عبودیت نامیده می‌شوند]\n\nپس بدان که قطب‌ها و صالحان، هنگامی که به نام‌های معلومی نامیده می‌شوند، در آنجا جز به عبودیت (بندگی) نسبت به اسمی که متولی آن‌هاست، خوانده نمی‌شوند. خداوند متعال می‌فرماید: «وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ» (و هنگامی که بنده خدا برخاست تا او را بخواند). پس او را عبد الله (بنده خدا) نامید، اگرچه پدرش او را محمد و احمد نامیده بود. بنابراین، قطب همیشه مختص به این اسم جامع است و در آنجا او عبد الله است. سپس، با وجود اجتماعشان در این اسمی که مقام آن را می‌طلبد، برخی بر برخی دیگر برتری می‌یابند. پس برخی از آن‌ها به اسمی غیر از این اسم، از میان باقی اسماء الهی، اختصاص می‌یابند و به آن اضافه شده و در غیر مقام قطبیت (مقام القطبية) با آن خوانده می‌شوند؛ مانند موسی (صلی الله علیه و سلم) که نامش عبد الشکور است، و داوود (علیه السلام) که نام خاص او عبد الملک است، و محمد (صلی الله علیه و سلم) که نامش عبد الجامع است. هیچ قطبی نیست مگر اینکه اسمی مخصوص به خود دارد که بر اسم عام او که عبد الله است، افزوده می‌شود؛ خواه آن قطب در زمان نبوت قطعی، پیامبر باشد یا در زمان شریعت محمد (صلی الله علیه و سلم)، ولی باشد. همچنین، دو امام نیز هر یک نامی مخصوص به خود دارند که هر امام در وقت خود در آنجا با آن خوانده می‌شود. امام چپ (الأیسر) عبد الملک است و امام راست (الأیمن) عبد ربه است، و این دو وزیران قطب هستند. پس ابوبکر (رضی الله عنه) در زمان رسول خدا (صلی الله علیه و سلم) تا هنگام وفات ایشان، عبد الملک بود و عمر (رضی الله عنه) عبد ربه بود. پس از آن، ابوبکر عبد الله نامیده شد و عمر عبد الملک نامیده شد، و امامی که مقام عمر را به ارث برد، عبد ربه نامیده شد. و این امر تا روز قیامت بر همین منوال خواهد بود. حسن و حسین (رضی الله عنهما) از دیگر کسانی که به این مقام متصف شدند، در آن استوارتر بودند. سنت الهی (السنة الإلهية) بر این جاری شده است که قطب، هنگامی که متولی مقام می‌شود، در مجلسی از مجالس قرب و تمکین (القربة والتمكين) قیام کند و تختی عظیم برای او نصب شود که اگر خلق به شکوه آن بنگرند، عقل‌هایشان پریشان شود. پس بر آن می‌نشیند و دو امامی که خداوند برای او قرار داده است، در برابرش می‌ایستند. او دست خود را برای بیعت الهی (المبايعة الإلهية) و استخلاف (جانشینی) دراز می‌کند و ارواح ملکیه (الأرواح الملكية)، جن و بشر روحانی مأمور می‌شوند که یکی پس از دیگری با او بیعت کنند. زیرا ساحت حق (الحق) والاتر از آن است که منبع هر واردی باشد و جز یکی پس از دیگری بر او وارد شوند. پس هر روحی که در آن مقام با او بیعت می‌کند، از او می‌پرسد—یعنی آن روح از قطب درباره مسئله‌ای سؤال می‌کند—و او در برابر حاضران پاسخ می‌دهد تا منزلت او را از نظر علم بشناسند و در آن وقت بدانند که کدام اسم الهی مخصوص اوست. ما برای این بیعت، کتاب بزرگی را اختصاص داده‌ایم که آن را «مبایعة القطب في حضرة القرب (بیعت قطب در حضرت قرب)» نامیده‌ایم و در آن معانی مسائل بسیاری را که از او پرسیده شده و پاسخ داده است، ذکر کرده‌ایم. و جز ارواح مطهر مقرب (الأرواح المطهرة المقربة) با او بیعت نمی‌کنند، و از میان ارواح بیعت‌کننده از فرشتگان، جن و بشر، فقط ارواح قطب‌هایی که درگذشته‌اند، از او سؤال می‌کنند. ما در آن کتاب سؤالات آن‌ها و پاسخ کامل او را ذکر کرده‌ایم. و حال هر قطبی که در زمان خود بیعت می‌کند، این‌گونه است. پس در این باب، برخی از احوال عمومی او را که برای هر قطبی مشترک است، نه احوال خاص او، ذکر می‌کنیم تا کسی که بر این کتاب من وقوف می‌یابد و صاحب ذوق مشاهده‌گر (الذوق المشاهد) آن است، بداند که ما در این کتاب از روشی که هر عارفی از اهل این شأن آن را می‌شناسد، عدول نکرده‌ایم. زیرا اگر حال خاص او را ذکر می‌کردیم، شاید می‌گفت این ادعاست. پس ابتدا با حال امام اقصی (دورتر)، سپس امام ادنی (نزدیک‌تر) و سپس قطب آغاز می‌کنیم. اما امام اقصی که عبد ربه است، حال او گریه از سر شفقت بر عالَم است، به دلیل مخالفت‌هایی که از آن‌ها می‌بیند و به توجه اسماء الهی (الأسماء الإلهية) که مقتضی عقاب و مؤاخذه هستند، می‌نگرد. و از اسماء الهی، آنچه را که مخالفت‌ها مقتضی آن است، یعنی عفو و گذشت، بر او تجلی (التجلی) نمی‌کند. به همین دلیل گریه او زیاد است. پس پیوسته برای بندگان خدا دعا می‌کند و به آن‌ها رحم می‌آورد و از خداوند سبحان می‌خواهد که آن‌ها را به راه موافقات (همراهی با امر الهی) رهنمون سازد. و من در برخی از سیاحت‌هایم این امام را مشاهده کردم و در میان صالحانی که دیدم، کسی را ندیدم که ترسش بر بندگان خدا شدیدتر و رحمتش عظیم‌تر از او باشد. به او گفتم: چرا غیرت برای خدا تو را فرا نمی‌گیرد؟ گفت: من نمی‌خواهم که به خاطر من برای خدا غیرت ورزیده شود، بلکه می‌خواهم که به خاطر من از خدا درخواست شود تا بر من رحم کند و بگذرد. پس برای بندگان خدا جز آنچه برای خود دوست دارم، نمی‌خواهم. و شایسته نیست که صادق با خدا، خود را در صورت حالی تصور کند که مقامش آن را اقتضا نمی‌کند. و این امام قدرت سلطه (سلطان) بر شیاطینی دارد که ملازم اهل خیر و صلاح هستند تا آن‌ها را از راهشان منحرف سازند. هنگامی که چشم شیطان بر این امام می‌افتد، در حالی که نزد یکی از صالحان است و حیله می‌کند که چگونه او را از راهش باز دارد، ذوب می‌شود، همان‌گونه که سرب در آتش ذوب می‌شود. پس امام او را به نامش ندا می‌دهد، شاید که سالم بماند، و او را به عنوان پروردگار تدبیر می‌کند. پس آن صالح پیوسته از القائات این صنف از شیاطین که او را از صلاحش خارج سازد، محفوظ می‌ماند، مادامی که این امام حاضر و ناظر بر او باشد، اگرچه آن صالح او را نشناسد و نداند چه اتفاقی افتاده است. ما این طایفه را مشاهده کرده‌ایم. پس خداوند به واسطه این امام، شروری را که مخصوص صالحان از بندگان اوست، به طور خاص و از روی عنایت به آن‌ها، از بندگانش دفع می‌کند. و از ویژگی‌های این امام، تصدیق هر خبری است که از جانب خدا داده می‌شود، خواه آن خبردهنده در اخبارش صادق باشد یا افتراکننده (مفتريا). زیرا این امام او را تصدیق می‌کند، به این دلیل که ناظر به اسم الهی است که متولی این خبردهنده در اخبار اوست. اگر صادق باشد، خبر او از کشف محقق است و در این صورت او و امام برابرند. و اگر کشف نداشته باشد و از آنچه نزد او واقع شده خبر دهد، در حالی که نمی‌داند چه کسی آن را واقع ساخته و قصد دروغ دارد، این امام اخبار او را تصدیق می‌کند، در حالی که خبردهنده به دلیل قصد دروغش، از جانب خدا معاقب و محروم است، و در واقع امر، خبر او چنین نیست. پس وبال قصدش به خودش بازگشته و اگر خداوند او را مؤاخذه کند، عذاب می‌بیند. و از احوال این امام این است که همیشه درخواست انتقال به مقام مشاهده از احوال و مقام صلاح از مقامات را دارد. و او دائماً به بهشت‌ها (الجنان) اطلاع دارد. خداوند او را به این اطلاع اختصاص داده است تا او را حفظ کند؛ پس آنچه را که بر او از گریه و حزن که منجر به ناامیدی (القنوط) می‌شود، عارض می‌گردد، با آنچه از سرور بهشت‌ها و نعمت اهل آن می‌بیند و خداوند او را بر آن مطلع می‌سازد، مقابله می‌کند. و اشتیاق اهل بهشت به او و انتظارشان برای آمدنش را مشاهده می‌کند، و این سبب اعتدال او می‌شود. و مقام این امام، احسان اول (الإحسان) است، و آن همان سخن جبرئیل (علیه السلام) به رسول خدا (علیه الصلاة و السلام) است که: احسان چیست؟ و پاسخ پیامبر (صلی الله علیه و سلم) این بود: «الإحسان أن تعبد الله كأنك تراه» (احسان آن است که خدا را چنان بپرستی که گویی او را می‌بینی).\n\nو آنچه پس از آن است، برای این امام نیست. و مصالح عالم و آنچه مردم از آن بهره می‌برند، در دست این امام است. او افراد را تربیت می‌کند و با معارف الهی (المعارف الإلهية) تغذیه می‌نماید و معارف را بر اهلش با ترازویی محقق تقسیم می‌کند، به اندازه‌ای که صلاح آن عارف را در آن می‌بیند تا جانش با آن معرفت زنده شود. او سروری بر ثقلین (جن و انس) و حکم و تصرف در آن‌ها را بر اساس آنچه مصلحتشان اقتضا می‌کند، داراست. و از ویژگی‌های این امام، استواری بر هر حال و مقامی است که برایش حاصل می‌شود، و این برای هر کسی نیست. پس به حالی متصف نمی‌شود که از آن منتقل گردد، و نه به مقامی. در حالی که غیر از این امام، اگر به مقام یا حالی منتقل شود، سلطان آن مقام و حال بر او حکم می‌راند و او را از آنچه از آن منتقل شده است، غایب می‌سازد. اما این امام چنین نیست، زیرا مقامی که از آن منتقل شده، برای او محفوظ است و به واسطه نیروی الهی که خداوند به او اختصاص داده، از آن غایب نمی‌شود. و برای روح او دویست و چهار بال (جناح) است؛ هر بالی را که بگشاید، با آن به هر کجا که بخواهد پرواز می‌کند. و او در مرتبه سوم و اول قدم دارد و در برخی اوقات به «البر الرحیم (نیکوکار مهربان)» خوانده می‌شود. آغاز او از مرتبه سوم و پایانش به مرتبه اول بود. پس روش او از غایتش به سوى آغازش بود، برخلاف سلوک شناخته‌شده. او با پیمودن مقامات، درجات و منازل، به عقب بازگشت (رجع القهقري). از پایانش تا آغازش نوزده منزل است که منزل آغاز و پایان در آن است. پس منازل درجات او کامل شد: صد و دوازده، نود و ده، بیست، سی و سه، چهل و چهار، پنجاه و پنج، شصت و شش، هفتاد و هفت، هشتاد و هشت، نود و نه، و دویست. و از آنجا که مراتب چهار تا هستند و افزون بر آن نیست، و هر مرتبه‌ای مقتضی اموری بی‌نهایت از علوم، اسرار و احوال است: مرتبه اول ایمان، دوم ولایت، سوم نبوت و چهارم رسالت است. و رسالت و نبوت، اگرچه در این امت به حکم تشریع قطع شده‌اند، اما میراث از آن‌ها قطع نشده است. پس برخی از آن‌ها نبوت را به ارث می‌برند و برخی رسالت و نبوت را با هم به ارث می‌برند. و اکنون که آنچه برای این امام اقصی است را ذکر کردیم، آنچه برای امام ادنی که عبد الملک است را ذکر می‌کنیم و می‌گوییم: «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند).\n\nاین امام از جهت روحانیت خود نود بال (جناح) دارد؛ هر بالی را که بگشاید، با آن به هر کجا که بخواهد پرواز می‌کند. آغاز و پایان او در مرتبه دوم بود و در باقی مراتب سه‌گانه قدمی ندارد. پس برای او منازل، درجات و مقاماتی برای پیمودن وجود نداشت. این امام دارای شدت و قهر است و تصرف به تمامی اسماء الهی که مقتضی کَون (هستی) هستند، مانند الخالق (آفریننده)، الرازق (روزی‌دهنده)، الملک (پادشاه) و البارئ (پدیدآورنده) در برخی وجوه آن و غیره، برای اوست. اما برخلاف امامی که پیش‌تر ذکر شد، او تصرفی در اسماء تنزیه (اسماء منزه کننده خداوند) ندارد. در سختی‌ها و حوادث بزرگ به او پناه برده می‌شود و خداوند آن‌ها را به دست او می‌گشاید، زیرا خداوند بر آن‌ها سلطه‌ای برای او قرار داده است. او دارای کرم است، اما ایثار (الإيثار) ندارد، زیرا از نیاز به آنچه ایثار با آن واقع می‌شود، منزه است. و او بر خلق از جایی که نمی‌دانند، انعام می‌کند. و او بر من با بشارتی انعام کرد که مرا به آن مژده داد، در حالی که من در حال خود آن را نمی‌شناختم و آن حال من بود. پس مرا بر آن آگاه ساخت و از انتساب (الانتماء) به شیوخی که ملاقات کرده بودم، نهی کرد و به من گفت: جز به خدا منتسب مشو. هیچ‌یک از کسانی که ملاقات کرده‌ای، در آنچه تو در آن هستی، بر تو دستی ندارند، بلکه خداوند با عنایت خود متولی تو شده است. اگر خواستی، فضیلت کسانی را که ملاقات کرده‌ای، ذکر کن، اما به آن‌ها منتسب مشو و به پروردگارت منتسب شو. و حال این امام نیز دقیقاً مانند حال من بود؛ هیچ‌یک از کسانی که او را ملاقات کرده بودند، در راه خدا بر او دستی نداشتند، جز خدا. این‌گونه فرد مورد اعتماد نزد من، از او نقل کرد. و امام نیز خود در هنگام ملاقات من با او در یک مشهد برزخی که در آن با او جمع شدم، این را به من خبر داد. حمد و منت بر خداوند به خاطر آن. و متولیان امور خلق به این امام رجوع می‌کنند؛ او نصب می‌کند و عزل می‌نماید و خداوند شرور را به واسطه او دفع می‌کند. و او سلطه‌ای قوی بر ارواح ناریه (آتشین) از شیاطین دور شده از رحمت خدا دارد. و او با امام اول (اقصی) در یک درجه از پنج درجه مشترک است و امام اقصی در چهار درجه از او منفرد است. ما از احوال او در جزئی از کتابمان به نام «معرفة القطب والإمامين (معرفت قطب و دو امام)» به اندازه کافی ذکر کرده‌ایم. پس به آنچه ذکر کردیم، به دلیل میل به اختصار، بسنده می‌کنیم. و اکنون که این مقدار از احوال دو امام را ذکر کردیم، به ذکر بخشی از سخن قطب می‌پردازیم که در این شتاب‌زدگی کفایت کند، ان شاء الله.\n\nاما قطب که عبد الله و عبد الجامع (بنده جامع) است، کسی است که به تمامی اسماء، از نظر تخلق و تحقق، وصف شده است. او آینه حق (الحق) و مظهر صفات مقدس و مظهر تجلیات (المظاهر) الهی است. او صاحب الوقت (صاحب زمان)، چشم زمان و راز قدر است. او علم دهر الدهور (دهر دهرها) را داراست که خفا بر آن غالب است، در خزانه‌های غیرت محفوظ است و در جامه‌های صیانت (حفاظت) پیچیده شده است. هیچ شبهه‌ای بر او عارض نمی‌شود و هیچ خاطری که مناقض مقام او باشد، به ذهنش خطور نمی‌کند. او بسیار نکاح می‌کند، به آن راغب است و دوستدار زنان است. حق طبیعت را بر حد مشروع آن ادا می‌کند و حق روحانیت را بر حد الهی ادا می‌نماید. او میزان‌ها را وضع می‌کند و بر اساس مقدار معین تصرف می‌نماید. وقت برای اوست، آنچه برای وقت است، برای خداست نه برای غیر او. حال او عبودیت (العبودية) و افتقار (الافتقار) است. زشتی را زشت می‌شمارد و زیبایی را نیکو می‌داند. جمال مقید (محدود) در زینت و اشخاص را دوست دارد. ارواح در زیباترین صورت‌ها نزد او می‌آیند و او از عشق ذوب می‌شود. برای خدا غیرت می‌ورزد و برای خدا خشمگین می‌شود. تجلیات (المظاهر) الهی برای او به تدبیر مقید نمی‌شوند، بلکه او در آن‌ها اطلاق دارد. پس روحانیت او از بشر محسوس، در تدبیر مدبّر، از پشت حجاب شهود و غیب بر او ظاهر می‌شود. او از اشیاء جز وجه حق (الحق) در آن‌ها را نمی‌بیند. اسباب را وضع می‌کند، آن‌ها را برپا می‌دارد، بر آن‌ها دلالت می‌کند و به حکم آن‌ها جاری می‌شود. به سوی آن‌ها فرود می‌آید تا بر او حکم کنند و در او تأثیر بگذارند. در او به هیچ وجه ربوبیت (ربانية) وجود ندارد و همیشه ملازم این حال است. اگر صاحب دنیا و ثروت باشد، در آن تصرف می‌کند، تصرف بنده‌ای در مال مولای کریم. و اگر دنیا نداشته باشد و بر آنچه بر او گشوده می‌شود باشد، نفسش به چیزی چشم نمی‌دوزد، بلکه هنگام نیاز به برخی از آنچه طبیعتش بدان محتاج است، خود به خانه دوستی از کسانی که او را می‌شناسند، می‌رود و نیاز طبیعتش را بر او عرضه می‌کند، مانند شفاعت‌کننده برای طبیعتش نزد او. پس به اندازه نیاز طبیعتش از آن برمی‌دارد و بازمی‌گردد. جز از روی ضرورت برای حاجتش نمی‌نشیند. پس اگر اجابت نشد، برای نیاز طبیعتش به خدا پناه می‌برد، زیرا او مسئول آن است، چون والی بر آن است. سپس منتظر اجابت خدا در آنچه سؤال کرده می‌ماند؛ اگر بخواهد، آنچه را خواسته است، زود یا دیر به او می‌دهد. پس مرتبه او اصرار در سؤال (الإلحاح في السؤال) و شفاعت در حق طبیعتش است. برخلاف اصحاب احوال (أصحاب الأحوال)، که اشیاء از همت آن‌ها و کنار گذاشتن اسباب از نفسشان تکوّن می‌یابد؛ پس آن‌ها ربانی هستند. اما قطب از حال منزه است، در علم ثابت و در آن مشهود است و به واسطه آن تصرف می‌کند. اگر حق (الحق) او را بر آنچه واقع می‌شود مطلع سازد، از روی افتقار و منت‌گذاری برای خدا خبر می‌دهد، نه از روی افتخار. زمین برای او درنوردیده نمی‌شود، در هوا و بر روی آب راه نمی‌رود، و بدون سبب نمی‌خورد، و هیچ‌یک از آنچه ذکر کردیم از خرق عادات (خرق العوائد) و آنچه احوال اقتضا می‌کند، بر او عارض نمی‌شود، مگر به ندرت برای امری که حق آن را می‌بیند و انجام می‌دهد. این امر برای قطب مطلوب نیست، مگر از روی گرسنگی اضطراری، نه اختیاری. و همچنین از نکاح صبر می‌کند به دلیل عدم توانایی (مالی). او از تجلی نکاح (التجلی) چیزی را می‌داند که او را بر طلب و عشق‌ورزی به آن ترغیب می‌کند، زیرا عبودیت (بندگی) برای او و برای هیچ‌یک از عارفان دیگر، بیشتر از آنچه در نکاح برایش محقق می‌شود، محقق نمی‌گردد؛ نه در خوردن، نه در نوشیدن و نه در پوشیدن برای دفع ضرر. و او به نکاح برای نسل‌زایی رغبت ندارد، بلکه صرفاً برای شهوت و حاضر ساختن تناسل در نفس خود برای امری مشروع است. و تناسل در آن برای امر طبیعی جهت حفظ بقای نوع در این دنیاست. زیرا نکاح صاحب این مقام مانند نکاح اهل بهشت است، صرفاً برای شهوت، چرا که آن (نکاح) تجلی اعظم (التجلي الأعظم) است که از جن و انس پنهان مانده، مگر از بندگانی که خداوند آن‌ها را به آن اختصاص داده است. و نکاح چهارپایان نیز بر همین اساس، صرفاً برای شهوت، جاری است. اما بسیاری از عارفان از این حقیقت غافل مانده‌اند، زیرا این از اسراری است که جز اندکی از اهل عنایت بر آن وقوف نمی‌یابند. و اگر در آن (نکاح) شرف کاملی که دال بر ضعف شایسته عبودیت است، وجود نداشت، جز آنچه در آن از قهر لذت می‌یابد که او را از قوت و ادعایش فانی می‌سازد، کافی بود. پس این قهر، لذت‌بخش است، زیرا قهر در حق مقهور (مغلوب) با التذاذ منافات دارد، چون لذت در قهر از ویژگی‌های قاهر است نه از ویژگی‌های مقهور، مگر در این فعل خاص. و مردم از این شرف غافل مانده‌اند و آن را شهوت حیوانی دانسته‌اند و نفس خود را از آن منزه شمرده‌اند، با وجود اینکه آن را به شریف‌ترین نام‌ها نامیده‌اند و آن سخنشان است که «حیوانی» است، یعنی از ویژگی‌های حیوان است. و چه شرفی عظیم‌تر از حیات (حیوان بودن) است؟ پس آنچه را که در حق خود زشت پنداشته‌اند، نزد عارف کامل، عین مدح است. این مطلب به راه خود رفت. اما دوست داشتن قطب نسبت به جمال مقید (الجمال المقيد) که در جمال مطلق (الجمال المطلق) مندرج است، به دلیل نزدیکی آن در مناسبت به جمال است. پس در آن نیازی به غور عمیق و نیرویی که با آن حجاب زشتی طبع را بشکافد تا جمال الهی نهفته در آن زشتی را درک کند، ندارد. پس جمال مقید در همان نگاه اول مقصود او را به او می‌دهد تا برای امر دیگری که بر او مؤکدتر است، فارغ شود؛ امری که مهم‌تر از مقاومت با زشتی طبیعی برای درک جمال مطلق است، زیرا در سرای تکلیف (دار التكليف) نفوس عزیز و گرانبها هستند. و او می‌خواهد که هیچ نفسی برای او نباشد، مگر اینکه با بهترین ادب او را ملاقات کرده و با بهترین خلعت و زینت او را بازگردانده باشد. گروهی از عارفان از این مقدار معرفت غافل مانده‌اند و نفسشان از آن ابا کرده است، به دلیل مشارکت اهل اغراض از عوام در آن. در حالی که ندانسته‌اند که این مرد، جمال مطلق را در جمال مقید و در غیر آن مشاهده می‌کند، برخلاف عوام.\n\n### [قطب‌ها مردان کامل هستند]\n\nو بدان که قطب، همان انسان کامل (الرجل الكامل) است که چهار دینار را به دست آورده است، که هر دینار آن بیست و پنج قیراط است و مردان با آن سنجیده می‌شوند. پس برخی ربع مرد، و برخی نصف، و برخی یک هشتم، و برخی یک ششم، و برخی نصف یک ششم، و برخی سه چهارم، و برخی مرد کامل هستند. دینار اول برای مؤمن کامل است، دینار دوم برای ولی خاص است، دینار سوم برای دو نبوت است، و دینار چهارم برای دو رسالت است؛ منظورم رسالت اصلی به حکم ابوت و رسالت وراثتی به حکم بنوت است. پس هر کس دوم را به دست آورد، اول را نیز دارد، و هر کس سوم را به دست آورد، دوم و اول را نیز دارد، و هر کس چهارم را به دست آورد، همه را به دست آورده است. و قطب از مردان کامل است. و ما از این جهت گفتیم «از مردان کامل» به خاطر افراد (الأفراد)، زیرا آن‌ها نیز کامل‌کنندگان هستند. و از احوال قطب، تأیید عادات و جاری شدن بر آن‌هاست. خرق عادت (خرق العادة) به طور دائم بر او ظاهر نمی‌شود، آن‌گونه که بر صاحب حال ظاهر می‌شود. و خرق عادت برای او مقصود نیست، بلکه از او ظاهر می‌شود نه به واسطه او، زیرا او در آن اختیاری ندارد. همان‌گونه که عارف ابوالسعود بن الشبل درباره مردی که بر اساس خاطر (الهام) سخن می‌گوید و آنچه همراه خاطر است، گفته است: در حق او به حکم اتفاق وجودی است و در حق خدا به حکم اراده و قصد. پس به حمد خدا، ما ضروریات خاص از احوال قطب را بیان کردیم و مرتبه او را برای کسی که آن را نمی‌شناسد، روشن ساختیم، و اینکه مردانگی (الرجولية) در آنچه جاهلان از عوام راه خدا تصور می‌کنند، نیست. پس آن‌ها به واسطه حال، از آنچه علم و مقام اقتضا می‌کند، محجوب می‌مانند و می‌گویند: هر علمی که با حال نباشد، ارزشی ندارد. پس به او بگو: ای برادر، چنین مگو، زیرا این خلاف امر است. بلکه صحیح آن است که بگویی: هر علمی که از ذوق (الذوق) نباشد، علم اهل الله نیست. می‌بینم که تو میان حال و ذوق فرق نمی‌گذاری. و هیچ علمی نیست مگر از ذوق، و غیر از این نمی‌تواند باشد. و کسی که در عبودیت (العبودة) متمکن (استوار) است، هیچ حالی ندارد که او را از عبودیتش خارج سازد. اگر در احوال نقصی جز این نبود که بنده را از مقامش به سوی آنچه شایسته او نیست و حق او نیست، خارج می‌سازد، کافی بود؛ تا جایی که اگر در حالِ حال بمیرد، صاحب نقص مرده است و صاحب نقص محشور می‌شود. پس احوال از خواسته‌های مردان (الرجال) نیست، بلکه اذواق (ذوق‌ها) خواسته‌های آن‌هاست، و اذواق برای آن‌ها به منزله دلایل برای صاحبان نظر در علوم است که در آن برایشان حاصل می‌شود. پس خداوند ما را از کسانی قرار دهد که فهمیدند و مراد خدا را دریافتند. «وَاللَّهُ يَهْدِي مَن يَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيمٍ» (و خداوند هر که را بخواهد به راه راست هدایت می‌کند). و در این باب از علوم، علم آنچه از حضرت الهی به آن استناد می‌شود، و علم نسبت بنی آدم به خدا از اسماء مخصوص، و علم آنچه باید از عالم روحانی پرهیز و حذر شود، و علم بازگشت عالم روحانی از کجا و به کجا، و علم صدور بشری وجود دارد."
  },
  "page_count": 4
}