{
  "id": 109,
  "title": {
    "ar": "الباب التاسع ومائة",
    "en": "Chapter One Hundred and Nine",
    "ur": "باب ایک سو نو",
    "fa": "باب صد و نهم"
  },
  "content": {
    "ar": "## (الباب التاسع ومائة)\n\n\nفي معرفة الفرق بين الشهوة والإرادة وبين شهوة الدنيا وشهوة الجنة والفرق بين اللذة والشهوة ومعرفة مقام من يشتهي ويشتهي ومن لا يشتهي ولا يشتهي ومن يشتهي ولا يشتهي ومن يشتهي ولا يشتهي‏\n\n\n> رب الإرادة سيد متحكم *** تجري أمور الكائنات بوفقه‏\n\n\n> والاشتهاء من الطبيعة أصله *** فمن اشتهى فالطبع مالك رقة\n\n\n> لا يفرحن أبدا عبيد طبيعة *** في ملكه في المنزلين بعتقه‏\n\n\n> والالتذاذ تقسمت أحكامه *** في كل موجود بطالع أفقه‏\n\n\n> فتراه والأعيان تطلب حقها *** يعطي لكل منه واجب حقه‏\n\n\n> يعطي الجزيل وما له ملك سوى *** ما أودع الملك الجواد بحقه‏\n\n\n> الوهب يأتيه بكل فضيلة *** تبدو عليه بخلقه وبخلقه‏\n\n\n> فعطاؤه الممزوج يشهد أنه *** فيما يجود عطاءه من صدقه‏\n\n\n> أما العبيد فرزقهم معبودهم *** فالكل إن حققت عابد رزقه‏\n\n\n### [المتمكن الكامل والعابد من أهل الله‏]\n\n\nاعلم أيدك الله أن المتمكن الكامل والعابد أيضا من أهل الله صاحب المقام يشتهي ويشتهي لكماله فيعطي كل ذي حق حقه فإنه يشاهد جمعيته ففيه من كل شي‏ء حقيقة\n\n\n### [صاحب الحال صاحب فناء]\n\n\nوصاحب الحال صاحب فناء لا يشتهي ولا يشتهي لأنه لا يشهد سوى الحق بعين الحق في حال فناء عن رؤية نفسه فلا يشتهي لأن الحق لا يوصف بالشهوة ولا يشتهي لأنه مجهول لا يعرف غير ربه لا تعرف الأكوان ولا نفسه لغيبته بربه عن الكل فهو غيب لا يشتهي لأن العلم بالمشتهى من لوازم هذا الحكم‏\n\n\n### [الزاهد والمخلط]\n\n\nوالزاهد لا يشتهي ويشتهي فإن النعم له خلقت فهو يراها حجبا موضوعة فينفر منها فلا يشتهيها وهي تشتهيه لعلمها بأنها خلقت له فيتناولها الزاهد جودا منه عليها وإيثارا إذا كان صاحب مقام والمخلط الكاذب الذي يعصي الله بنعمه يشتهي ولا يشتهي فيشتهي لغلبة الطبع عليه ولا يشتهي لأن النعم إنما تشتهي من تراه يقوم بحقها وهو شكر المنعم على ما أنعم الله به عليه‏\n\n\n### [الشهوة إرادة طبيعية مقيدة]\n\n\nثم اعلم أن الشهوة إرادة طبيعية مقيدة والإرادة صفة إلهية روحانية طبيعية متعلقها لا يزال معدوما وهي أعم تعلقا من الشهوة فإن كل حقيقة منهما تتعلق بالمناسب والمناسب ما يشركها في الأصل فلا تتعلق الشهوة إلا بنيل أمر طبيعي فإن وجد الإنسان ميلا إلى غير أمر طبيعي كميله إلى إدراك المعاني والأرواح العلوية والكمال ورؤية الحق والعلم به فلا يخلو عند هذا الميل أما أن يميل إلى ذلك كله بطريق الالتذاذ عن تخيل صوري فذلك تعلق الشهوة وميلها لأجل الصورة فإن الخيال إذا جسد ما ليس بجسد فذلك من فعل الطبيعة وإن تعلق ذلك الميل بغير هذا التخيل الحاصل بل يبقى المعاني والأرواح والكمال على حاله من التجرد عن التقييد وضبط الخيال له بالتخيل فذلك ميل الإرادة لا ميل الشهوة لأن الشهوة لا مدخل لها في المعاني المجردة\n\n\n### [متعلق الإرادة ومحلها ومتعلق الشهوة ومحلها]\n\n\nفالإرادة تتعلق بكل مراد للنفس والعقل‏\nكان ذلك المراد محبوبا أو غير محبوب والشهوة لا تتعلق إلا بما للنفس في نيله لذة خاصة ومحل الشهوة النفس الحيوانية ومحل الإرادة النفس الناطقة والشهوة تتقدم اللذة بالمشتهى في الوجود ولها لذة متخيلة تتعلق بتصور وجود المشتهي فتلك اللذة مقارنة لها في الوجود فتوجد في النفس قبل حصول المشتهي واللذة مقارنة لوجود حصول المشتهي في ملك المشتهي فتزول شهوة التحصيل وتبقي اللذة فليس عين الشهوة عين اللذة لفنائه بحصول المشتهي وبقاء اللذة\n\n\n### [الشهوة واللذة]\n\n\nغير إن الطبع يحدث له أو يظهر له عن كمون غيب إلهي شهوة أخرى تتعلق ببقاء المشتهي دائما لا تنقطع فهذه شهوة لا لذة لها فإن البقاء دائما غير حاصل مطلقا فلا يتناهى الأمر ولا يوجد البقاء فإن جدد البقاء بزمان مخصوص ومقدار معين فذلك البقاء المشتهي يكون للشهوة لذة بحصوله موجودا فاللذة مقارنة لحصول المشتهي خاصة لا تتأخر عنه ولا تتقدمه بوجود عين ووجود خيال‏\n\n\n### [شهوة الدنيا وشهوة الجنة]\n\n\nوأما شهوة الدنيا فلا تقع لها لذة إلا بالمحسوس الكائن وشهوة الجنة يقع لها اللذة بالمحسوس وبالمعقول على صورة ما يقع بالمحسوس من وجود الأثر البرزخى عند نيل المشتهي المعقول سواء ولا أعني بالجنة أن هذه الشهوة التي هذا حكمها لا توجد إلا في الجنة المعلومة في العموم إنما أعني حيث وجد هذا الحكم لهذه الشهوة الذي ذكرناه فهو شهوة الجنة سواء وجد في الدنيا أو وجد في الجنة وإنما أضفناها إلى الجنة لأنها تكون فيها لكل أحد من أهل الجنة وفي الدنيا لا تقع إلا لآحاد من العارفين‏\n\n\n### [نسب الشهوة ومقاماتها وأسرارها]\n\n\nوالشهوة لها نسبة واحدة إلى عالم الملك ونسبتان إلى عالم الملكوت ولها مقامات وأسرار وهي الدرجات بقدر ما لحروف اسم الشهوة من العدد بالجمل الكبير بالتعريف وهو الشهوة وبالتنكير وهو شهوة وبالاتصال بكلام فتعود هاء السكت تاء فلها عدد التاء وعدد الهاء في حال التنكير والتعريف فاجمع الأعداد بعضها إلى بعض فما اجتمع لك من ذلك فهو قدر درجات ما يناله صاحب ذلك المقام ولا يعتبر فيه إلا اللفظ العربي القرشي فإنه لغة أهل الجنة سواء كان أصلا وهو البناء أو فرعا وهو الإعراب وغير العربي والمعرب لا يلتفت إليه‏\n\n\n### [لكل موجود من اسمه نصيب‏]\n\n\nوكذلك تعمل في كل اسم مقام وهو قولهم لكل إنسان من اسمه نصيب ومعناه لكل موجود من اسمه نصيب ولهذا جاءت أسماء النعوت فلا تطلب إلا أصحابها وهي زور على من تطلق عليه وليست له وهذا من أصعب المسائل فإن الاسم إطلاق إلهي فلا بد من نصيب منه لذلك المسمى غير أنه يخفى في حال مسمى ما ويظهر في آخر ومدرك ذلك عزيز وعلى هذا الحد الإرادة\n\n\n### [المريد والمشتهى والمسلم المؤمن المحسن‏]\n\n\nفالمريد إلهي رباني رحماني والمشتهي رباني رحماني خاصة والمسلم المؤمن المحسن هو المريد وصاحب الشهوة مسلم نصف مؤمن نصف محسن لأنه مع الإحسان المقيد بالتشبيه‏\n\n",
    "en": "(Chapter One Hundred and Nine)\n\nOn knowing the difference between Desire (الشهوة) and Will (الإرادة), and between the desire for the world (شهوة الدنيا) and the desire for Paradise (شهوة الجنة), and the difference between Pleasure (اللذة) and Desire (الشهوة), and knowing the station (مقام) of him who desires and is desired, and him who neither desires nor is desired, and him who desires but is not desired, and him who does not desire but is desired.\n\n> The Lord of Will (الإرادة) is a controlling Master,\n> By whose accord the affairs of the existent things proceed.\n> And desiring (الاشتهاء) has its origin in nature (الطبيعة);\n> So whoever desires, nature owns his tenderness.\n> Let the slaves of nature never rejoice\n> In their freedom within His dominion in the two abodes.\n> And the rulings of enjoyment (الالتذاذ) are distributed\n> In every existent thing according to the rising star of its horizon.\n> So you see Him, while the essences (الأعيان) seek their due,\n> Giving to each of them its necessary right.\n> He gives generously, and He possesses no dominion except\n> What the Generous King (الملك الجواد) has deposited by His right.\n> The Gift (الوهب) comes to him with every virtue,\n> Which appears upon him through his creation and his character.\n> His mingled giving testifies that\n> His generosity in His bestowal stems from His truthfulness.\n> As for the servants (العبيد), their provision is their object of worship;\n> For truly, if you verify the matter, everyone is a worshipper of his provision.\n\n### [The Perfect Master (المتمكن الكامل) and the Worshipper from the People of Allah (أهل الله)]\n\nKnow, may Allah support you, that the Perfect Master (المتمكن الكامل) and also the Worshipper from the People of Allah (أهل الله), the possessor of the Station (المقام), desires and is desired (يشتهي ويشتهي) due to his perfection. Thus, he gives every possessor of a right its due, for he witnesses his comprehensiveness (جمعية), and in him is a reality (حقيقة) from everything.\n\n### [The Possessor of the State (صاحب الحال), the Possessor of Annihilation (صاحب فناء)]\n\nThe Possessor of the State (صاحب الحال), the Possessor of Annihilation (صاحب فناء), neither desires nor is desired (لا يشتهي ولا يشتهي). This is because he witnesses nothing but The Real (الحق) with the eye of The Real, in a state of annihilation (فناء) from seeing himself. He does not desire because The Real is not described by desire (الشهوة). And he is not desired because he is unknown; he knows none other than his Lord. The cosmos (الأكوان) and even his own self are unknown to him due to his absence (غيبته) with his Lord from everything. He is an absence (غيب). He is not desired because knowledge of the desired object (المشتهى) is a necessary condition of this ruling.\n\n### [The Ascetic (الزاهد) and the Confused/Mixed One (المخلط)]\n\nThe Ascetic (الزاهد) does not desire but is desired (لا يشتهي ويشتهي). For the blessings (النعم) were created for him, yet he sees them as veils (حجبا) placed before him, so he shuns them and does not desire them. However, they desire him, knowing that they were created for him. The Ascetic then takes them out of generosity (جودا) toward them and preference (إيثارا), provided he is a possessor of a Station (مقام). The lying, Confused One (المخلط) who disobeys Allah through His blessings desires but is not desired (يشتهي ولا يشتهي). He desires due to the dominance of nature (الطبع) over him. He is not desired because the blessings only desire him whom they see fulfilling their right, which is thanking the Benefactor for what Allah has bestowed upon him.\n\n### [Desire (الشهوة) is a Restricted Natural Will (إرادة طبيعية مقيدة)]\n\nThen know that Desire (الشهوة) is a restricted natural will (إرادة طبيعية مقيدة). Will (الإرادة) is a Divine, spiritual, natural Attribute (صفة إلهية روحانية طبيعية) whose object of relation (متعلقها) is perpetually non-existent, and it is broader in its relation than Desire. For every reality (حقيقة) of the two relates to what is appropriate (المناسب), and what is appropriate is that which shares its origin. Desire, therefore, only relates to the attainment of a natural matter. If a person finds an inclination toward something other than a natural matter—such as his inclination toward the perception of meanings (المعاني), the celestial spirits (الأرواح العلوية), perfection (الكمال), the vision of The Real (رؤية الحق), and the knowledge of Him—this inclination must fall into one of two categories: Either he inclines toward all of that by way of enjoyment (الالتذاذ) through formal imagination (تخيل صوري); this is the relation of Desire and its inclination is for the sake of the form, for when the Imagination (الخيال) embodies what is not a body, that is an act of nature (الطبيعة). Or, that inclination relates to something other than this resulting imagination, but rather the meanings, spirits, and perfection remain in their state of being stripped of restriction and the Imagination’s control over them through imagining; this is the inclination of Will (الإرادة), not the inclination of Desire, because Desire has no entry into the abstract meanings (المعاني المجردة).\n\n### [The Object and Locus of Will (الإرادة) and the Object and Locus of Desire (الشهوة)]\n\nWill (الإرادة) relates to everything willed by the soul (النفس) and the intellect (العقل), whether that willed object is beloved or not beloved. Desire (الشهوة) relates only to that in the attainment of which the soul finds a specific pleasure (لذة خاصة). The locus (محل) of Desire is the animal soul (النفس الحيوانية), and the locus of Will is the rational soul (النفس الناطقة). Desire precedes the pleasure of the desired object (المشتهى) in existence. Desire has an imagined pleasure (لذة متخيلة) related to the conception of the existence of the desired object. That pleasure is concomitant with Desire in existence, so it is found in the soul before the desired object is attained. Pleasure (اللذة) is concomitant with the actual attainment of the desired object in the possession of the desirer. Thus, the desire for acquisition vanishes, but the pleasure remains. Therefore, the essence of Desire is not the essence of Pleasure, due to the annihilation (فنائه) of the former upon the attainment of the desired object and the subsistence (بقاء) of the latter.\n\n### [Desire (الشهوة) and Pleasure (اللذة)]\n\nHowever, nature (الطبع) generates for itself, or there appears to it from a hidden Divine latency (كمون غيب إلهي), another desire that relates to the perpetual, uninterrupted subsistence (بقاء) of the desired object. This is a desire that has no pleasure (لذة), for perpetual subsistence is absolutely unattainable. Thus, the matter is never concluded, and subsistence is not found. If subsistence is renewed for a specific time (زمان مخصوص) and a determined measure (مقدار معين), then that desired subsistence grants the Desire pleasure upon its actual existence. Thus, Pleasure is specifically concomitant with the attainment of the desired object; it neither lags behind it nor precedes it, whether by actual existence (وجود عين) or imagined existence (وجود خيال).\n\n### [The Desire for the World (شهوة الدنيا) and the Desire for Paradise (شهوة الجنة)]\n\nAs for the desire for the world (شهوة الدنيا), pleasure (لذة) only occurs for it through the existent sensible object (المحسوس الكائن). The desire for Paradise (شهوة الجنة) finds pleasure through the sensible and the intelligible (المعقول), in the form of what occurs through the sensible, such as the existence of the intermediate effect (الأثر البرزخى) upon attaining the intelligible desired object, equally. I do not mean by Paradise (الجنة) that this desire, which has this ruling, is found only in the generally known Paradise. Rather, I mean that wherever this ruling for this desire that we have mentioned is found, it is the desire for Paradise, whether it is found in the world (الدنيا) or found in Paradise. We only attribute it to Paradise because it is found there for everyone among the people of Paradise, whereas in the world, it occurs only for a few individuals among the Gnostics (العارفين).\n\n### [The Relations, Stations, and Secrets of Desire (الشهوة)]\n\nDesire (الشهوة) has one relation (نسبة) to the World of Dominion (عالم الملك) and two relations to the World of Sovereignty (عالم الملكوت). It has stations (مقامات) and secrets (أسرار), which are degrees (الدرجات) corresponding to the numerical value (العدد) of the letters of the name *al-shahwa* (الشهوة) according to the greater abjad system (الجمل الكبير), both when defined (بالتعريف)—*al-shahwa*—and when indefinite (بالتنكير)—*shahwa*. And when connected to speech, the silent *hā’* (هاء السكت) reverts to a *tā’* (تاء). Thus, it has the number of the *tā’* and the number of the *hā’* in the indefinite and definite states. Gather these numbers together, and the sum you obtain is the measure of the degrees attained by the possessor of that station. Only the Qurayshi Arabic pronunciation is considered in this, for it is the language of the people of Paradise, whether it is the root (الأصل), which is the structure (البناء), or the branch (الفرع), which is the inflection (الإعراب). Non-Arabic and Arabized words are not given attention.\n\n### [Every Existent Thing Has a Share of Its Name]\n\nYou should proceed similarly with every name of a station (مقام). This relates to their saying, \"Every human has a share (نصيب) of his name,\" the meaning of which is that every existent thing (موجود) has a share of its name. This is why the names of descriptions (أسماء النعوت) only seek their rightful possessors; they are a falsehood (زور) when applied to someone who does not possess them. This is one of the most difficult issues, for the Name (الاسم) is a Divine designation (إطلاق إلهي), and thus the named entity (المسمى) must necessarily have a share of it. However, this share may be hidden in the case of one named entity and manifest in another. The perception of this is rare. Will (الإرادة) follows this same principle.\n\n### [The Willer (المريد), the Desirer (المشتهى), and the Muslim, Believer, Doer of Good (المسلم المؤمن المحسن)]\n\nThe Willer (المريد) is Divine (إلهي), Lordly (رباني), and Merciful (رحماني). The Desirer (المشتهى) is Lordly and Merciful specifically. The Muslim, the Believer (المؤمن), the Doer of Good (المحسن) is the Willer. The possessor of Desire (صاحب الشهوة) is a Muslim, half-Believer, half-Doer of Good, because he is associated with the doing of good (الإحسان) that is restricted by similitude (التشبيه).",
    "ur": "(باب ایک سو نو)\n\nشہوت (الشهوة) اور ارادہ (الإرادة) کے درمیان فرق، اور شہوت دنیا اور شہوت جنت کے درمیان فرق، اور لذت (اللذة) اور شہوت کے درمیان فرق کی معرفت میں، اور اس شخص کے مقام کی معرفت میں جو چاہتا بھی ہے اور چاہا بھی جاتا ہے، اور جو نہ چاہتا ہے اور نہ چاہا جاتا ہے، اور جو چاہتا ہے مگر چاہا نہیں جاتا، اور جو چاہا جاتا ہے مگر چاہتا نہیں ہے۔\n\n> رب الإرادة سيد متحكم *** تجري أمور الكائنات بوفقه‏\n>\n> ارادہ (الإرادة) کا رب ایک حاکم آقا ہے،\n>\n> کائنات کے معاملات اسی کی موافقت سے جاری ہوتے ہیں۔\n>\n> والاشتهاء من الطبيعة أصله *** فمن اشتهى فالطبع مالك رقه\n>\n> اور اشتہا (الاشتهاء) کی اصل طبع (الطبيعة) سے ہے،\n>\n> پس جس نے چاہا، تو طبع اس کی ملکیت کا مالک ہے۔\n>\n> لا يفرحن أبدا عبيد طبيعة *** في ملكه في المنزلين بعتقه‏\n>\n> طبع کے غلام کبھی خوش نہ ہوں،\n>\n> اس کی ملکیت میں دونوں منزلوں (دنیا و آخرت) میں اس کی آزادی سے۔\n>\n> والالتذاذ تقسمت أحكامه *** في كل موجود بطالع أفقه‏\n>\n> اور التذاذ (لذت حاصل کرنا) کے احکام تقسیم ہو چکے ہیں،\n>\n> ہر موجود میں اس کے افق کے طلوع کے مطابق۔\n>\n> فتراه والأعيان تطلب حقها *** يعطي لكل منه واجب حقه‏\n>\n> تو تم اسے دیکھتے ہو کہ جب اعیان (حقائق) اپنا حق طلب کرتے ہیں،\n>\n> تو وہ ان میں سے ہر ایک کو اس کا واجب حق عطا کرتا ہے۔\n>\n> يعطي الجزيل وما له ملك سوى *** ما أودع الملك الجواد بحقه‏\n>\n> وہ بہت زیادہ عطا کرتا ہے، اور اس کے پاس کوئی ملکیت نہیں سوائے،\n>\n> اس کے جو بادشاہ جواد (اللہ) نے اپنے حق کے ساتھ اس میں ودیعت کر رکھا ہے۔\n>\n> الوهب يأتيه بكل فضيلة *** تبدو عليه بخلقه وبخلقه‏\n>\n> یہ بخشش (الوهب) اس کے پاس ہر فضیلت کے ساتھ آتی ہے،\n>\n> جو اس پر اس کی خلقت (خلق) اور اس کے اخلاق (خلق) کے ذریعے ظاہر ہوتی ہے۔\n>\n> فعطاؤه الممزوج يشهد أنه *** فيما يجود عطاءه من صدقه‏\n>\n> پس اس کا ملا جلا عطیہ گواہی دیتا ہے کہ،\n>\n> جو کچھ وہ عطا کرتا ہے، اس میں اس کے صدق (سچائی) کی جھلک ہے۔\n>\n> أما العبيد فرزقهم معبودهم *** فالكل إن حققت عابد رزقه‏\n>\n> رہے غلام، تو ان کا رزق ہی ان کا معبود ہے،\n>\n> پس اگر تم تحقیق کرو تو ہر کوئی اپنے رزق کا عابد ہے۔\n\n### [متمکن کامل اور اہل اللہ میں سے عابد]\n\nجان لو، اللہ تمہاری تائید کرے، کہ متمکن کامل (المتمكن الكامل) اور اہل اللہ میں سے عابد، جو صاحب مقام ہے، وہ چاہتا بھی ہے اور چاہا بھی جاتا ہے، اپنے کمال کی وجہ سے۔ پس وہ ہر حقدار کو اس کا حق دیتا ہے۔ کیونکہ وہ اپنی جامعیت (جمعیتہ) کا مشاہدہ کرتا ہے، لہٰذا اس میں ہر شے کی حقیقت موجود ہے۔\n\n### [صاحب حال، صاحب فنا]\n\nاور صاحب حال (صاحب الحال) جو صاحب فنا (فناء) ہے، وہ نہ چاہتا ہے اور نہ چاہا جاتا ہے۔ کیونکہ وہ ذات حق (الحق) کے سوا کسی کا مشاہدہ نہیں کرتا، حق کی آنکھ سے، اس حال میں کہ وہ اپنے آپ کو دیکھنے سے فنا (فناء) ہو چکا ہوتا ہے۔ پس وہ نہیں چاہتا، کیونکہ ذات حق (الحق) کو شہوت (الشهوة) سے متصف نہیں کیا جاتا۔ اور وہ چاہا بھی نہیں جاتا، کیونکہ وہ مجہول ہے، اپنے رب کے سوا کسی کو نہیں جانتا۔ نہ وہ کائنات کو جانتا ہے اور نہ ہی اپنے نفس کو، کیونکہ وہ اپنے رب کے ساتھ سب سے غائب ہے۔ پس وہ غیب ہے، اور چاہا نہیں جاتا، کیونکہ مشتہی (جسے چاہا جائے) کا علم اس حکم کے لوازم میں سے ہے۔\n\n### [زاہد اور مخلط]\n\nاور زاہد (الزاهد) نہیں چاہتا مگر چاہا جاتا ہے۔ کیونکہ نعمتیں اسی کے لیے پیدا کی گئی ہیں۔ پس وہ انہیں رکھے ہوئے حجابوں کی طرح دیکھتا ہے اور ان سے نفرت کرتا ہے، لہٰذا وہ انہیں نہیں چاہتا۔ جبکہ وہ نعمتیں اسے چاہتی ہیں، کیونکہ وہ جانتی ہیں کہ وہ اسی کے لیے پیدا کی گئی ہیں۔ پس زاہد انہیں اپنی طرف سے ان پر جود و کرم کرتے ہوئے اور ایثار کرتے ہوئے قبول کرتا ہے، اگر وہ صاحب مقام ہو۔ اور مخلط کاذب (المخلط الكاذب) جو اللہ کی نعمتوں کے ذریعے اس کی نافرمانی کرتا ہے، وہ چاہتا ہے مگر چاہا نہیں جاتا۔ پس وہ چاہتا ہے کیونکہ طبع (الطبع) اس پر غالب آ چکی ہے، اور چاہا نہیں جاتا کیونکہ نعمتیں صرف اسے چاہتی ہیں جو ان کا حق ادا کرتا ہے، اور وہ ہے منعم (نعمت دینے والے) کا شکر ادا کرنا اس پر جو اللہ نے اسے انعام کیا۔\n\n### [شہوت ایک مقید طبعی ارادہ ہے]\n\nپھر جان لو کہ شہوت (الشهوة) ایک مقید طبعی ارادہ (إرادة طبيعية مقيدة) ہے۔ اور ارادہ (الإرادة) ایک الٰہی، روحانی، طبعی صفت ہے جس کا متعلق ہمیشہ معدوم رہتا ہے، اور یہ شہوت (الشهوة) سے تعلق کے لحاظ سے زیادہ عام ہے۔ کیونکہ ان دونوں میں سے ہر حقیقت مناسب شے سے متعلق ہوتی ہے، اور مناسب وہ ہے جو اس کے ساتھ اصل میں شریک ہو۔ پس شہوت صرف کسی طبعی امر کے حصول سے متعلق ہوتی ہے۔ اگر انسان کسی غیر طبعی امر کی طرف میلان پائے، جیسے مجرد معانی (المعاني)، علوی ارواح، کمال، ذات حق (الحق) کا دیدار اور اس کا علم حاصل کرنے کی طرف اس کا میلان، تو اس میلان کے وقت یہ صورت خالی نہیں ہوگی: یا تو وہ ان سب کی طرف صوری تخیل کے ذریعے التذاذ (لذت حاصل کرنے) کے طریقے سے مائل ہو، تو یہ شہوت (الشهوة) کا تعلق اور صورت کی خاطر اس کا میلان ہے۔ کیونکہ جب خیال کسی غیر جسم کو جسمانی شکل دے دیتا ہے تو یہ طبع (الطبيعة) کا فعل ہے۔ اور اگر یہ میلان اس حاصل شدہ تخیل کے بغیر متعلق ہو، بلکہ معانی، ارواح اور کمال اپنی تجرد کی حالت پر باقی رہیں، قید سے آزاد ہوں اور خیال انہیں تخیل کے ذریعے ضبط نہ کرے، تو یہ ارادہ (الإرادة) کا میلان ہے نہ کہ شہوت کا میلان، کیونکہ شہوت کا مجرد معانی (المعاني المجردة) میں کوئی دخل نہیں۔\n\n### [ارادہ کا متعلق اور محل اور شہوت کا متعلق اور محل]\n\nپس ارادہ (الإرادة) نفس اور عقل کے ہر مراد سے متعلق ہوتا ہے، خواہ وہ مراد محبوب ہو یا غیر محبوب۔ اور شہوت (الشهوة) صرف اس شے سے متعلق ہوتی ہے جس کے حصول میں نفس کے لیے خاص لذت ہو۔ اور شہوت کا محل نفس حیوانی (النفس الحيوانية) ہے، اور ارادہ کا محل نفس ناطقہ (النفس الناطقة) ہے۔ شہوت وجود میں مشتہی (جسے چاہا جائے) کی لذت سے پہلے ہوتی ہے، اور اس کے لیے ایک متخیلہ لذت ہوتی ہے جو مشتہی کے وجود کے تصور سے متعلق ہوتی ہے۔ پس وہ لذت وجود میں اس کے ساتھ ملی ہوئی ہوتی ہے، اور مشتہی کے حاصل ہونے سے پہلے نفس میں پائی جاتی ہے۔ اور لذت مشتہی کی ملکیت میں اس کے حصول کے وجود کے ساتھ ملی ہوئی ہوتی ہے۔ پس حصول کی شہوت زائل ہو جاتی ہے اور لذت باقی رہتی ہے۔ لہٰذا شہوت کا عین، لذت کا عین نہیں ہے، کیونکہ شہوت مشتہی کے حصول سے فنا ہو جاتی ہے اور لذت باقی رہتی ہے۔\n\n### [شہوت اور لذت]\n\nمگر یہ کہ طبع (الطبع) کے لیے ایک اور شہوت پیدا ہوتی ہے یا غیب الٰہی کے پوشیدہ ہونے سے ظاہر ہوتی ہے، جو مشتہی کے ہمیشہ باقی رہنے سے متعلق ہوتی ہے اور منقطع نہیں ہوتی۔ پس یہ ایسی شہوت ہے جس کی کوئی لذت نہیں، کیونکہ ہمیشہ کی بقا (البقاء) مطلقاً حاصل نہیں ہوتی، لہٰذا معاملہ ختم نہیں ہوتا اور بقا (البقاء) پائی نہیں جاتی۔ لیکن اگر بقا کو کسی مخصوص وقت اور معین مقدار کے ساتھ تجدید کیا جائے، تو اس مشتہی بقا کے حاصل ہونے سے شہوت کے لیے لذت ہوتی ہے۔ پس لذت خاص طور پر مشتہی کے حصول کے ساتھ ملی ہوئی ہوتی ہے، نہ تو وہ اس سے تاخیر کرتی ہے اور نہ ہی عین وجود یا خیالی وجود کے ذریعے اس سے سبقت لے جاتی ہے۔\n\n### [شہوت دنیا اور شہوت جنت]\n\nاور جہاں تک شہوت دنیا کا تعلق ہے، تو اس کے لیے لذت صرف موجود محسوسات کے ذریعے حاصل ہوتی ہے۔ اور شہوت جنت (شهوة الجنة) کے لیے لذت محسوسات اور معقولات دونوں کے ذریعے حاصل ہوتی ہے، اس صورت میں جو محسوسات کے ذریعے حاصل ہوتی ہے، یعنی معقول مشتہی کے حصول کے وقت برزخی اثر کا وجود برابر ہوتا ہے۔ اور جنت (الجنة) سے میرا مطلب یہ نہیں کہ یہ شہوت جس کا یہ حکم ہے، صرف عام طور پر معلوم جنت میں ہی پائی جاتی ہے۔ بلکہ میرا مطلب یہ ہے کہ جہاں بھی اس شہوت کا یہ حکم پایا جائے جو ہم نے ذکر کیا ہے، تو وہ شہوت جنت ہے، خواہ وہ دنیا میں پائی جائے یا جنت میں۔ اور ہم نے اسے جنت کی طرف اس لیے منسوب کیا ہے کیونکہ یہ اہل جنت میں سے ہر ایک کے لیے وہاں موجود ہوگی، جبکہ دنیا میں یہ صرف عارفین (العارفين) کے چند افراد کو ہی حاصل ہوتی ہے۔\n\n### [شہوت کی نسبتیں، مقامات اور اسرار]\n\nاور شہوت (الشهوة) کی عالم ملک (عالم الملك) سے ایک نسبت ہے، اور عالم ملکوت (عالم الملكوت) سے دو نسبتیں ہیں۔ اور اس کے مقامات اور اسرار ہیں، اور یہ درجات ہیں، اس عدد کے مطابق جو شہوت (الشهوة) کے نام کے حروف کو جمل کبیر (الجمل الكبير) کے حساب سے حاصل ہوتا ہے، تعریف کے ساتھ (یعنی \"الشهوة\") اور تنکیر کے ساتھ (یعنی \"شهوة\")۔ اور کلام کے ساتھ متصل ہونے کی صورت میں ہائے سکت (هاء السكت) تاء میں بدل جاتی ہے، تو اس کے لیے تاء کا عدد اور تنکیر و تعریف کی حالت میں ہاء کا عدد ہوتا ہے۔ پس ان اعداد کو آپس میں جمع کرو، تو جو کچھ تمہیں حاصل ہو، وہ اس مقام کے صاحب کے حاصل کردہ درجات کی مقدار ہے۔ اور اس میں صرف عربی قریشی لفظ ہی معتبر ہے، کیونکہ یہ اہل جنت کی زبان ہے، خواہ وہ اصل (بناء) ہو یا فرع (اعراب)۔ غیر عربی اور معرب (عربیائے گئے الفاظ) کی طرف التفات نہیں کیا جائے گا۔\n\n### [ہر موجود کو اس کے نام سے حصہ ملتا ہے]\n\nاور اسی طرح تم ہر اسم مقام میں عمل کرو گے۔ اور یہی ان کا قول ہے کہ \"ہر انسان کو اس کے نام سے حصہ ملتا ہے\"، اور اس کا معنی ہے کہ \"ہر موجود کو اس کے نام سے حصہ ملتا ہے\"۔ اور اسی لیے صفاتی نام (أسماء النعوت) آئے ہیں، پس وہ صرف اپنے اصحاب کو ہی طلب کرتے ہیں، اور یہ ان لوگوں پر جھوٹ (زور) ہیں جن پر یہ بولے جاتے ہیں مگر وہ ان کے مستحق نہیں ہوتے۔ اور یہ مشکل ترین مسائل میں سے ہے، کیونکہ اسم ایک الٰہی اطلاق ہے، لہٰذا اس مسمیٰ کے لیے اس میں سے ایک حصہ ہونا ضروری ہے۔ مگر یہ کہ وہ کسی مسمیٰ کی حالت میں پوشیدہ رہتا ہے اور کسی دوسری حالت میں ظاہر ہوتا ہے، اور اس کا ادراک کرنا مشکل ہے۔ اور اسی حد پر ارادہ (الإرادة) بھی ہے۔\n\n### [مرید، مشتہی اور مسلم مومن محسن]\n\nپس مرید (المريد) الٰہی، ربانی، رحمانی ہے۔ اور مشتہی (المشتهي) خاص طور پر ربانی، رحمانی ہے۔ اور مسلم، مومن، محسن (المسلم المؤمن المحسن) ہی مرید (المريد) ہے۔ اور صاحب شہوت (صاحب الشهوة) مسلم ہے، نصف مومن، نصف محسن ہے، کیونکہ وہ احسان کے ساتھ ہے جو تشبیہ (التشبيه) کے ساتھ مقید ہے۔",
    "fa": "(باب صد و نهم)\n\nدر معرفت فرق میان شهوت (al-Shahwa) و اراده (al-Irāda)، و میان شهوت دنیا و شهوت بهشت، و فرق میان لذت (al-Ladhdha) و شهوت، و معرفت مقام کسی که می‌خواهد و خواسته می‌شود، و کسی که نمی‌خواهد و خواسته نمی‌شود، و کسی که می‌خواهد و خواسته نمی‌شود، و کسی که نمی‌خواهد و خواسته می‌شود.\n\n> رب الإرادة سيد متحكم *** تجري أمور الكائنات بوفقه‏\n> پروردگار اراده، سروری است حاکم، که امور کائنات مطابق خواست او جاری می‌شود.\n\n> والاشتهاء من الطبيعة أصله *** فمن اشتهى فالطبع مالك رقه\n> و اشتها از طبیعت است ریشه‌اش، پس هر که مشتاق شد، طبع مالک بندگی اوست.\n\n> لا يفرحن أبدا عبيد طبيعة *** في ملكه في المنزلين بعتقه‏\n> بندگان طبیعت هرگز شادمان نشوند، در ملک او (طبیعت)، در هر دو منزل (دنیا و آخرت)، به آزادی‌اش.\n\n> والالتذاذ تقسمت أحكامه *** في كل موجود بطالع أفقه‏\n> و التذاذ (لذت بردن)، احکامش تقسیم شده است، در هر موجودی به طالع افقش.\n\n> فتراه والأعيان تطلب حقها *** يعطي لكل منه واجب حقه‏\n> پس او را می‌بینی که در حالی که اعیان (حقایق ثابت) حق خود را می‌طلبند، به هر یک از آن‌ها حق واجبش را می‌دهد.\n\n> يعطي الجزيل وما له ملك سوى *** ما أودع الملك الجواد بحقه‏\n> بخشنده را عطا می‌کند، و او را ملکی نیست جز آنچه که ملک جواد (بخشنده) به حق در او به ودیعه نهاده است.\n\n> الوهب يأتيه بكل فضيلة *** تبدو عليه بخلقه وبخلقه‏\n> بخشایش با هر فضیلتی به او می‌آید، که بر او آشکار می‌شود، به آفرینش و اخلاقش.\n\n> فعطاؤه الممزوج يشهد أنه *** فيما يجود عطاءه من صدقه‏\n> پس عطای آمیخته او گواهی می‌دهد که، در آنچه می‌بخشد، عطایش از صدق اوست.\n\n> أما العبيد فرزقهم معبودهم *** فالكل إن حققت عابد رزقه‏\n> اما بندگان، روزی‌شان معبودشان است، پس اگر حقیقت را دریابی، همه پرستنده روزی خود هستند.\n\n### (متمکن کامل و عابد از اهل الله)\n\nبدان، خداوند تو را تأیید کند، که متمکن کامل (al-Mutamakkin al-Kāmil) و همچنین عابد از اهل الله (اهل الله) که صاحب مقام است، هم می‌خواهد و هم خواسته می‌شود به سبب کمالش. پس حق هر صاحب حقی را به او می‌دهد، زیرا او جامعیت خود را مشاهده می‌کند و در او از هر چیزی حقیقتی وجود دارد.\n\n### (صاحب حال، صاحب فنا)\n\nو صاحب حال (Ṣāḥib al-Ḥāl)، صاحب فنا (al-Fanā’) نه می‌خواهد و نه خواسته می‌شود، زیرا او جز حق (al-Ḥaqq) را با چشم حق مشاهده نمی‌کند، در حال فنا (al-Fanā’) از رؤیت خود. پس او نمی‌خواهد، زیرا حق (al-Ḥaqq) به شهوت وصف نمی‌شود. و خواسته نمی‌شود، زیرا او مجهولی است که جز پروردگارش را نمی‌شناسد؛ نه اکوان (هستی‌ها) را می‌شناسد و نه خود را، به دلیل غیبتش به واسطه پروردگارش از همه چیز. پس او غیبی است که نمی‌خواهد، زیرا علم به مشتهی (آنچه خواسته می‌شود) از لوازم این حکم است.\n\n### (زاهد و مخلط)\n\nو زاهد (al-Zāhid) نمی‌خواهد ولی خواسته می‌شود. زیرا نعمت‌ها برای او خلق شده‌اند، اما او آن‌ها را حجاب‌هایی می‌بیند که قرار داده شده‌اند، پس از آن‌ها دوری می‌کند و آن‌ها را نمی‌خواهد. در حالی که نعمت‌ها او را می‌خواهند، زیرا می‌دانند که برای او خلق شده‌اند. پس زاهد آن‌ها را از روی جود و ایثار نسبت به آن‌ها برمی‌گیرد، اگر صاحب مقام باشد. و مخلط (al-Mukhalliṭ) دروغگو که با نعمت‌های خداوند معصیت می‌کند، می‌خواهد ولی خواسته نمی‌شود. پس می‌خواهد به دلیل غلبه طبع (al-Ṭab‘) بر او، و خواسته نمی‌شود، زیرا نعمت‌ها تنها کسی را می‌خواهند که حق آن‌ها را به جا آورد، و آن شکر منعم (نعمت‌دهنده) بر آنچه خداوند به او انعام کرده است، می‌باشد.\n\n### (شهوت، اراده‌ای طبیعی و مقید است)\n\nسپس بدان که شهوت (al-Shahwa) اراده‌ای طبیعی و مقید است، و اراده (al-Irāda) صفتی الهی، روحانی و طبیعی است که متعلق آن همواره معدوم است. و تعلق آن از شهوت عام‌تر است. زیرا هر حقیقتی از این دو به آنچه مناسب است تعلق می‌گیرد، و مناسب آن است که در اصل با آن شریک باشد. پس شهوت تنها به دست آوردن امری طبیعی تعلق می‌گیرد. اگر انسان میلی به غیر از امر طبیعی در خود بیابد، مانند میلش به درک معانی و ارواح علوی و کمال و رؤیت حق (al-Ḥaqq) و علم به او، در این میل خالی از دو حالت نیست: یا به همه این‌ها از طریق التذاذ (لذت بردن) ناشی از تخیل صوری میل می‌کند، که این تعلق شهوت و میل آن به خاطر صورت است؛ زیرا اگر خیال، چیزی را که جسم نیست، جسمانی کند، این از فعل طبیعت است. و اگر آن میل به غیر از این تخیل حاصل شده تعلق گیرد، بلکه معانی و ارواح و کمال بر حال تجرد خود از تقیید و ضبط خیال به واسطه تخیل باقی بمانند، این میل اراده (al-Irāda) است نه میل شهوت (al-Shahwa)، زیرا شهوت را در معانی مجرد مدخلی نیست.\n\n### (متعلق اراده و محل آن، و متعلق شهوت و محل آن)\n\nپس اراده (al-Irāda) به هر مرادی برای نفس و عقل تعلق می‌گیرد، خواه آن مراد محبوب باشد یا غیر محبوب. و شهوت (al-Shahwa) تنها به آنچه نفس در به دست آوردن آن لذتی خاص دارد، تعلق می‌گیرد. و محل شهوت، نفس حیوانی (al-Nafs al-Ḥayawāniyya) است، و محل اراده، نفس ناطقه (al-Nafs al-Nāṭiqa) است. شهوت در هستی (al-Wujūd) بر لذت به مشتهی (آنچه خواسته می‌شود) تقدم دارد، و برای آن لذتی متخیل وجود دارد که به تصور وجود مشتهی تعلق می‌گیرد. پس آن لذت با آن در هستی (al-Wujūd) مقارن است و در نفس پیش از حصول مشتهی یافت می‌شود. و لذت (al-Ladhdha) مقارن با وجود حصول مشتهی در ملک مشتهی است. پس شهوت تحصیل زائل می‌شود و لذت باقی می‌ماند. بنابراین، عین شهوت، عین لذت نیست، به دلیل فنای (al-Fanā’) شهوت با حصول مشتهی و بقای لذت.\n\n### (شهوت و لذت)\n\nجز اینکه طبع (al-Ṭab‘) برایش شهوت دیگری ایجاد می‌کند یا از کمون غیب الهی برایش آشکار می‌شود که به بقای دائمی مشتهی تعلق دارد و قطع نمی‌شود. پس این شهوتی است که لذتی برای آن نیست، زیرا بقای دائمی به طور مطلق حاصل نمی‌شود، پس امر پایان نمی‌پذیرد و بقا یافت نمی‌شود. اما اگر بقا به زمانی مخصوص و مقداری معین تجدید شود، آن بقای مشتهی برای شهوت لذتی خواهد داشت به واسطه حصول موجود آن. پس لذت (al-Ladhdha) به طور خاص مقارن با حصول مشتهی است و نه از آن تأخیر می‌یابد و نه بر آن تقدم می‌جوید، نه با وجود عین و نه با وجود خیال.\n\n### (شهوت دنیا و شهوت بهشت)\n\nاما شهوت دنیا، لذتی برای آن حاصل نمی‌شود مگر با محسوس موجود. و شهوت بهشت، لذت برای آن حاصل می‌شود هم با محسوس و هم با معقول (al-Ma‘qūl)، به صورتی که با محسوس حاصل می‌شود، از وجود اثر برزخی هنگام نیل به مشتهی معقول (al-Ma‘qūl) به طور یکسان. و منظورم از بهشت این نیست که این شهوت که حکمش چنین است، تنها در بهشت معلوم در عموم یافت می‌شود، بلکه منظورم این است که هر جا این حکم برای این شهوت که ذکر کردیم یافت شود، آن شهوت بهشت است، خواه در دنیا یافت شود یا در بهشت. و ما آن را به بهشت نسبت دادیم، زیرا در آنجا برای هر یک از اهل بهشت وجود دارد، در حالی که در دنیا تنها برای افراد معدودی از عارفان (al-Ārifīn) رخ می‌دهد.\n\n### (نسبت‌های شهوت و مقامات و اسرار آن)\n\nو شهوت (al-Shahwa) یک نسبت به عالم مُلک دارد و دو نسبت به عالم ملکوت. و برای آن مقامات و اسراری است که درجات آن به اندازه عدد حروف اسم شهوت در حساب جمل کبیر است، چه با تعریف (الشهوة) و چه با تنکیر (شهوة)، و چه با اتصال به کلام که هاء سکت به تاء تبدیل می‌شود. پس عدد تاء و عدد هاء را در حال تنکیر و تعریف دارد. پس اعداد را با هم جمع کن، و آنچه از آن حاصل شود، قدر درجات چیزی است که صاحب آن مقام به دست می‌آورد. و در این محاسبه تنها لفظ عربی قریشی معتبر است، زیرا آن زبان اهل بهشت است، خواه اصل باشد (بنا) یا فرع باشد (اعراب). و به غیر عربی و معرب توجهی نمی‌شود.\n\n### (هر موجودی از نام خود نصیبی دارد)\n\nو همچنین در هر اسم مقامی عمل می‌کنی، و این همان قول آن‌هاست که: «هر انسانی از نام خود نصیبی دارد»، و معنای آن این است که «هر موجودی از نام خود نصیبی دارد». و به همین دلیل است که اسامی صفات آمده‌اند و جز صاحبان خود را نمی‌طلبند، و بر کسی که بر او اطلاق می‌شود و آن صفت را ندارد، دروغ است. و این از دشوارترین مسائل است، زیرا اسم، اطلاقی الهی است، پس ناگزیر باید نصیبی از آن برای آن مسمی وجود داشته باشد، جز اینکه در حالتی از مسمایی پنهان می‌شود و در حالتی دیگر آشکار می‌گردد، و درک این امر دشوار است. و اراده (al-Irāda) نیز بر همین حد است.\n\n### (مرید و مشتهی و مسلمان مؤمن محسن)\n\nپس مرید (al-Murīd) الهی، ربانی، رحمانی است. و مشتهی (al-Mushtahā) به طور خاص ربانی، رحمانی است. و مسلمان مؤمن محسن، همان مرید است. و صاحب شهوت، مسلمانی است که نیمی مؤمن و نیمی محسن است، زیرا او با احسان مقید به تشبیه همراه است."
  },
  "page_count": 2
}