{
  "id": 278,
  "title": {
    "ar": "الباب الثامن والسبعون ومائتان في معرفة منزل الألفة وأسراره من المقام الموسوي والمحمدي",
    "en": "Chapter Two Hundred and Seventy-Eighth: Concerning the Gnosis (معرفة) of the Station (منزل) of Affinity (الألفة) and its Secrets, derived from the Mosaic (الموسوي) and Muhammadan (المحمدي) Stations (المقام).",
    "ur": "باب دو سو اٹھہتر (۲۷۸): منزلِ الفت (الألفة) اور اس کے اسرار کی معرفت کے بیان میں جو مقامِ موسوی اور محمدی سے متعلق ہیں۔",
    "fa": "باب دویست و هفتاد و هشتم در معرفت منزل اُلفت و اسرار آن از مقام موسوی و محمدی."
  },
  "content": {
    "ar": "## «الباب الثامن والسبعون ومائتان في معرفة منزل الألفة وأسراره من المقام الموسوي والمحمدي»\n\n\n> منزل الألفة لا يدخله *** غير موجود على صورته‏\n\n\n> فتراه عند ما تبصره *** نازلا فيه على سورته‏\n\n\n> حاكما فيه بما يعلمه *** جاريا فيه على سيرته‏\n\n\n> فاصطفاه الحق مرآة له *** فلهذا زاد في سورته‏\n\n\n> فنهاه الله أعلاما له *** أن ذاك النهي من غيرته‏\n\n\n> عند ما حجر ما كان له *** مطلقا نزه عن حيرته‏\n\n\n> أكل المنهي عنه فبدت *** رتبة الأكل في عورته‏\n\n\n> فدرى حين رآها إنها *** زلة جاءته من جيرته‏\n\n\n### [الألفة بين الإثنين لا يكون إلا لمناسبة بينهما]\n\n\nلا يتألف اثنان إلا لمناسبة بينهما فمنزل الألفة هي النسبة الجامعة بين الحق والخلق وهي الصورة التي خلق عليها الإنسان ولذلك لم يدع أحد من خلق الله الألوهية إلا الإنسان ومن سواه ادعيت فيه وما ادعاها قال فرعون أَنَا رَبُّكُمُ الْأَعْلى‏\nوما في الخلق من يملك سوى الإنسان وما سوى الإنسان من ملك وغيره لا يملك شيئا يقول تعالى في إثبات الملك للإنسان أَوْ ما مَلَكَتْ أَيْمانُكُمْ وما ثم موجود من يقر له بالعبودية إلا الإنسان فيقال هذا عبد فلان ولهذا شرع الله له العتق ورغبة فيه وجعل له ولاء العبد المعتق إذا مات عن غير وارث كما إن الورث لله من عباده قال تعالى إِنَّا نَحْنُ نَرِثُ الْأَرْضَ ومن عَلَيْها وما ثم موجود يقبل التسمية بجميع الأسماء الإلهية إلا الإنسان وقد ندب إلى التخلق بها ولهذا أعطى الخلافة والنيابة وعلم الأسماء كلها وكان آخر نشأة في العالم جامعة لحقائق العالم مما اختص الله بها ملكه كله وصورته ومن نشأته أيضا الطبيعية القائمة من الأربع الطبائع مع القوة الناطقة التي اختص بها في طبيعته دون غيره مما خلق من الطبيعة كالصورة الإلهية القائمة على أربع الذي لا يعطي\n\n\nالدليل العقلي غيرها وهي الحياة والعلم والقدرة والإرادة فبهذه صح إيجاد العالم له وكان هو إلها بها إذ لو جرد عن هذه النسب لما كان إلها للعالم وهو المثل المقرر في القرآن الذي لا يماثل في قوله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ أي ليس مثل مثله شي‏ء فأثبت المثلية له بالإنسان تنزيها له تعالى أي إذا كان المثل المفروض لا يماثل فهو تعالى أبعد وأنزه أن يماثل وفي السنة خلق آدم على صورته ونفى بهذه الآية أن يماثل هذا المثل وجعل له غيبا وشهادة ولما كان الإنسان بهذه المثابة كانت الألفة بينه وبين ربه فأحبه وأحبه ولهذا\n\n\nورد أن السماء والأرض يعني العلو والسفل ما وسعه ووسعه قلب المؤمن التقى الورع‏\n\n\nوهذا من صفة الإنسان لا من صفة الملك هذا وإن شورك الإنسان في كل ما ذكرناه إلا إن الإنسان امتاز عن الكل بالمجموع وبالصورة فاعلم هذا فلا تصح العبودية المحضة التي لا يشوبها ربوبية أصلا إلا للإنسان الكامل وحده ولا تصح ربوبية أصلا لا تشوبها عبودة بوجه من الوجوه إلا لله تعالى فالإنسان على صورة الحق من التنزيه والتقديس عن الشوب في حقيقته فهو المألوه المطلق والحق سبحانه هو الإله المطلق وأعني بهذا كله الإنسان الكامل وما ينفصل الإنسان الكامل عن غير الكامل إلا برقيقة واحدة وهي أن لا يشوب عبوديته ربوبية أصلا ولما كان للإنسان الكامل هذا المنصب العالي كان العين المقصودة من العالم وحده وظهر هذا الكمال في آدم عليه السلام في قوله تعالى وعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها فأكدها بالكل وهي لفظة تقتضي الإحاطة فشهد له الحق بذلك كما ظهر هذا الكمال في محمد صلى الله عليه وسلم أيضا\n\n\nبقوله فعلمت علم الأولين والآخرين‏\n\n\nفدخل علم آدم في علمه فإنه من الأولين وما جاء بالآخرين إلا لرفع الاحتمال الواقع عند السامع إذا لم يعرف ما أشرنا إليه من ذلك وهو صلى الله عليه وسلم قد أوتي جوامع الكلم بشهادته لنفسه واختلف أصحابنا في أي المقامين أعلى من شهد له الحق أو من شهد لنفسه بالحق كيحيى وعيسى عليهما السلام فأما مذهبنا في ذلك فإن الشاهد لنفسه الصادق في شهادته أتم وأعلى وأحق لأنه ما شهد لنفسه إلا عن ذوق محقق بكماله فيما شهد لنفسه به مرتفعة شهادته تلك عن الاحتمال في الحال فقد فضل على من شهد له برفع الاحتمال والذوق المحقق فهذا المقام أعلى وليس من شأن المنصف الأديب العالم بطريق الله أن يتكلم في تفاضل الرجال وإن علم ذلك فيمنعه الأدب فلهذا قلنا الأديب وإنما يتكلم في تفاضل المقامات فيخرج عن العهدة في ذلك ويسلم له الحال عن المطالبة فيه إذ كانت المقامات ليس لها طلب وكان الطلب للموصوفين بها فالأديب حاله ما ذكرناه وهذا الذي ذكرناه كله يشهده من حصل في هذا المنزل وله من الحروف ألفة اللام بالألف وهو أول حرف مركب من الحروف فوحده الشكل فلم يعرف الألف من اللام فالحق بالمفردات فكأنهما حرف واحد لما تعذر الانفصال ولم يتميز شكل اللام فيه من شكل الألف فلم يدركه البصر فإن قيل إن السمع يدركه بقوله لا فليعلم إن اللام تحتمل الحركة والألف لا تحتمل الحركة فلم يتمكن النطق بالألف فينطق باللام مشبعة الحركة لظهور الألف ليعلم أنه أراد لام الألف لا لام غيره من الحروف حتى يرقمه الراقم على صورته الخاصة به فلا تمتاز الألف من اللام لتمكن الألفة كذلك الإنسان إذا كان الحق سمعه وبصره كما ورد في الخبر يرتبط بالحق ارتباط اللام بالألف ولهذا تقدم في حروف شهادة التوحيد في لفظة لا إله إلا الله فنفى بحرف الألفة ألوهة كل إله أثبته الجاهل المشرك لغير الله فنفى ذلك بحرف يتضمن العبد والرب فإنه يتضمن مدلول اللام والألف كما\n\n\nقال عليه السلام آمنت بهذا أنا وأبو بكر وعمر\n\n\nفشركهما معه بنفسه في الايمان ولم يكونا حاضرين أو كانا\nفناب عنهما فلما شهد الحق لنفسه بالتوحيد شهد عنه وعن عبده بذلك فأتى بحرف لام ألف ولهذا سمي لام ألف ولم يقل لام الألف بالتعريف فسمي باسم الحرفين لئلا يتخيل السامع إذا جاء به معرفا إنه أراد الإضافة وما أراد هذا الحرف المعين فجرى مجرى رام‏هرمز وبعلبك ولم يجر مجرى عبد الله وعبد الرحمن ولهذا اختلف في موضع الإعراب من بعلبك ورام‏هرمز وبلال‏آباد ولم يختلف في موضع الإعراب من عبد الله وعبد الرحمن لأن المسمى بذلك قصد به الإضافة ولا بد فمن أجرى هذه الأسماء مجرى الاسم المضاف جعل محل الإعراب آخر الاسم الأول ومن أجراه مجرى زيد جعل محل الإعراب آخر الاسم الثاني كذلك وقع الاختلاف في حرف لام ألف إذا وقع في الخط في تعيين أي فخذ من هذا الحرف هو اللام وأي فخذ هو الألف واختلفت مراعاة الناس في ذلك فمن قاس الخط على اللفظ كان اللام عنده الذي يبتدئ به الكاتب سواء كان الفخذ المتقدم في الترتيب أو المتأخر ومن لم يحمله على النطق به بقي على الخلاف وجعل له التخيير في ذلك فيجعل أي شي‏ء أراد اللام من الفخذين وأي شي‏ء أراد الألف إذ كان كل واحد منهما على صورة الآخر للالتفاف الذي أخرج اللام عن حقيقته كذلك الإنسان الكامل والحق في الصورة التي تنزلت منزلة الالتفاف فإن نسبت الفعل إلى قدرة العبد كان لذلك وجه في الإخبار الإلهي وإن نسبت الفعل إلى الله كان لذلك وجه في الإخبار الإلهي وأما الأدلة العقلية فقد تعارضت عند العقلاء وإن كانت غير متعارضة في نفس الأمر ولكن عسر وتعذر على العقلاء تمييز الدليل من الشبهة وكذلك في الإخبار الإلهي يتعذر وكذلك في حقيقة العبد متعذر لتعلق الأمر به فلا يؤمر إلا من له قدرة على فعل ما يؤمر به وتمكن من ترك ما ينهى عنه فيعسر نفي الفعل عن المكلف الذي هو العبد لارتفاع حكمة الخطاب في ذلك والإخبار الآخر والوجه الآخر العقلي يعطي أن الفعل المنسوب إلى العبد إنما هو لله فقد تعارضا خبرا وعقلا وهذا موضع الحيرة وسبب وقوع الخلاف في هذه المسألة بين العقلاء في نظرهم في أدلتهم وبين أهل الأخبار في أدلتهم ولا يعرف ذلك إلا أهل الكشف خاصة من أهل الله وكون الإنسان على الصورة يطلب وجود الفعل له والتكليف يؤيده والحس يشهد له فهو أقوى في الدلالة ولا يقدح فيه رجوع كل ذلك إلى الله بحكم الأصل فإنه لا ينافي هذا التقرير ولهذا ضعفت حجة القائلين بالكسب لا من كونهم قالوا بالكسب فإن هؤلاء أيضا يقولون به لأنه خبر شرعي وأمر عقلي يعلمه الإنسان من نفسه وإنما تضعف حجتهم في نفيهم الأثر عن القدرة الحادثة وبعد أن علمت هذا الفصل من منزل الألفة فلنشرع فيما يرجع إلى تحقيقه في غير هذا النمط مما يتضمنه على جهة الإفصاح عنه‏\n\n\n### [أن الألفة منزل من منازل الأبدال‏]\n\n\nفاعلم إن هذا المنزل هو منزل سفر الأبدال السبعة المجتمعين المتألفين مع القبض الذي هم عليه بعضهم عن بعض وإنكار بعضهم على بعض مع وجود الصفاء فيما بينهم ولهم سفران في باب المعرفة سفر منهم إلى الإله في مظاهره وسفر آخر منهم أيضا إلى الذات فسفرهم إلى الإله من ربوبيتهم وسفرهم إلى الذات من ذواتهم فإذا أرادوا السفر إلى الذات قصدوا اليمن وإذا أرادوا السفر إلى الإله قصدوا الشام وبلاد الشمال وأي جهة قصدوا فإن استعدادهم على السواء في القدر الذي يحتاجون إليه وإن تنوع فإن الأغذية تتنوع بتنوع الجهات فلا يؤخذ من الزاد إلى كل جهة إلا ما يصلح مزاج المسافر إلى تلك الجهة لئلا يحول بينه وبين مقصده مرض للأهواء المختلفة في الجهات وأثرها في المزاج فلا بد أن يختلف الاستعداد على إن إقامتهم قليلة في السفرين ويعودون إلى مواطنهم فإذا قصدوا اليمن لم يقيموا فيه سوى أربعة وعشرين يوما يحصلون فيها مرادهم ويرجعون إلى سنة أخرى وإذا قصدوا الشمال لم يقيموا فيه إلا ستة أيام يحصلون فيها مرادهم ويرجعون إلى سنة أخرى وسفرهم روحاني لا جسماني فأما العلوم التي يستفيدونها في سفرهم إلى اليمن فعلوم الاصطلام وعلم السبحات من وراء الحجب علم ذوق وأما العلوم التي يستفيدونها في سفرهم إلى الشمال فعلوم زيادات اليقين بما يتجلى لهم وعلم العبودية والقبض وما تنتجه الخلوات علم ذوق وموطنهم الذي يستقرون فيه مكة فإن التنزل في روحانيتها أتم التنزل لأنها كما قال تعالى أُمَّ الْقُرى‏ وقال يُجْبى‏ إِلَيْهِ ثَمَراتُ كُلِّ شَيْ‏ءٍ فعم وقال فيه رِزْقاً من لَدُنَّا فما أضافه إلى غيره فهي علوم وهب تحيا بها أرواحهم ولم يقل ذلك في غير مكة ولا تحصل هذه العلوم التي أشرنا إليها إلا لمن‏\nكان حاله الذلة والافتقار ومقامه الجلال والقبض والهيبة والخوف فإذا كانت أوصاف العبد ما ذكرناه منحه الله العزة والغني في حاله والجمال والبسط والأنس به والرجاء في غيره لا في نفسه فإنه في حق نفسه من ربه في أمان لأنه قد بشر كما قال لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وبشارة الحق حق لا يدخلها نسخ فيؤمن بوجودها المكر ولكن إذا كان نصا وفي هذا المنزل ذوق عجيب لا يكون في غيره وهو أنه إذا كنت في حال من الأحوال فإن الحق يهبك في تلك الحال علما من ذلك الحال لا تخرج عنه مثل الذي ينتقل من العلم بالشي‏ء إلى معاينة ذلك الشي‏ء فلم يحصل له إلا مزيد وضوح في عين واحدة كذلك هذا المنزل وهو منزل منه يعلم الجمع بين الضدين وهو وجود الضد في عين ضده وهذا العلم أقوى علم تعلم به الوحدانية لأنه يشاهد حالا لا يمكن أن يجهله إن عين الضد هو بنفسه عين ضده فيدرك الأحدية في الكثرة لا على طريقة أصحاب العدد فإن تلك طريقة متوهمة وهذا علم مشهود محقق وممن تبرز في هذا المنزل المبارك أبو سعيد الخراز من المتقدمين وكنت أسمع ذلك عنه حتى دخلته بنفسي وحصل لي ما حصل فعرفت أنه الحق وأن الناس في إنكارهم ذلك على حق فإنهم ينكرونه عقلا وليس في قوة العقل من حيث نظره أكثر من هذا ومن أعطى ما في وسعه من حيث ما تقتضيه تلك الجهة فقد وفي الأمر حقه وهذا الذي استقر عليه قدمنا وثبت فلا ننكر على مدع ما يدعيه إلا الإنكار الذي أمرنا به فننكره شرعا وهذا الإنكار حقيقة أيضا لا نشهد إلا هيأة يجب الإنكار بها وفيها كما أنكرنا ذلك عقلا فللشرع قوة لا يتعدى بها ما تعطيه حقيقتها كما فعلنا في العقل وللذوق قوة نعاملها به أيضا كما عاملنا سائر ما نسب إليه القوي بحسب قوته فنحن مع الوقت فننكر مع العقل ما ينكره العقل لأن وقتنا العقل ولا ننكره كشفا ولا شرعا وننكر مع الشرع ما ينكره الشرع لأن وقتنا الشرع ولا ننكره كشفا ولا عقلا وأما الكشف فلا ينكر شيئا بل يقرر كل شي‏ء في رتبته فمن كان وقته الكشف أنكر عليه ولم ينكر هو على أحد ومن كان وقته العقل أنكر وأنكر عليه ومن كان وقته الشرع أنكر وأنكر عليه فاعلم ذلك‏\n\n\n### [ان الهو من حقيقته أنه لا يتحصل ولا يشاهد أبدا]\n\n\nواعلم أن لهذا المنزل حالا لا يكون لغيره وهو أنه يعطي تحصيل هوية الأسماء الإلهية وهذا خلاف ما تعطيه حقيقة الهو فإن الهو من حقيقته أنه لا يتحصل ولا يشاهد أبدا إلا في هذا المشهد والمنزل فإن عين الظاهر فيه هو بنفسه عين الباطن غير أن هوية الحق لا تدخل في هذا المنزل وإنما قلنا ذلك في هوية الأسماء الإلهية من كون هويتها لا من أنانيتها\n\n\n### [تحصيل علم الأدلة والعلامات من الرسل ص‏]\n\n\nواعلم أن هذا المنزل إذا دخلته تجتمع فيه مع جماعة من الرسل صلوات الله عليهم فتستفيد من ذوقهم الخاص بهم علوما لم تكن عندك فتكون لك كشفا كما كانت لهم ذوقا فيحصل لك منهم علم الأدلة والعلامات فلا يخفى عليك شي‏ء في الأرض ولا في السماء إذا تجلى لك إلا تميزه وتعرفه حين يجهله غيرك ممن لم يحصل في هذا المنزل وهو علم كشف لأنك تشهده بالعلامة لا تراه من نفسك لأنه ليس بذوق لك ويحصل لك منهم علم القدم وهو علم عزيز به يكون ثباتك على ما يحصل لك من الأسرار والعلوم بعد انفصالك عن الحضرات التي يحصل لك فيها ما يحصل من العلم والأسرار فكثير من الناس من نسي ما شاهده فإذا حصل له هذا العلم من هذا النبي يثبت فيه ثبات الأنبياء ويحصل لك منهم أيضا علم الشرائع في العالم ومن أين مأخذها وكيف أخذت ولما ذا اختلفت في بعض الأحكام وفيما ذا اتفقت واجتمعت حتى إن صاحب هذا الكشف لو لم يكن مؤيدا في كشفه لأدعى النبوة ولكن الله أيد أولياءه وعصمهم عن الغلط في دعوى ما ليس لهم لخروجهم عن حظوظ نفوسهم عند الخلق لكنهم لا يخرجون عن حظوظها عند الحق ولا يصح أن يطلب الحق للحق وإنما يطلب للحظ فإن فائدة الطلب التحصيل للمطلوب والحق لا يحصل لأحد فلا يصح أن يكون مطلوبا لعالم فلم يبق إلا الحظ ومن هذا العلم يداوي العشاق إذا أفرطت فيهم المحبة من هذه الحضرة يستخرج لهم دواء الراحة مما هم فيه من العذاب الذي يعطيه العشق من القلق والكمد والانزعاج ويحصل من مشاهدة هؤلاء الأنبياء أيضا علم ما يحتاج إليه نواب الحق في عباده من الرحمة والقهر والشدة واللين وما يعاملون به الخلق وما يعاملون به الحق وما يعاملون به أنفسهم إذا كانوا نوابا فيستفيد هذا كله وإن لم يحصل له درجة النيابة في العامة ولكنه نائب الله في عالمه الخاص به الذي هو نفسه وأهله وولده إن كان ذا أهل وولد ويحصل له منهم السر الذي به يحيي الجاهل من موت جهله وما يحيي الله به الموتى فإنه راجع إلى منزل الألفة لأن الحياة\nللشي‏ء إنما تكون لتألفها به ونظرها إليه من اسمه الحي الذي ليس عن تأليف ويحصل أيضا علم الخلق التام في قوله مُخَلَّقَةٍ ولا يحصل له في هذا المنزل علم غير المخلقة وإنما يحصل ذلك لمن حصل من منزل آخر وفي هذا المنزل يعلم من هؤلاء الأنبياء العلم التصوري وهو العلم بالمفردات التي لم تتركب ومن هذا المنزل تلبس المعاني الصور فيصور المسائل العالم في نفسه ثم يبرزها إلى المتعلمين في أحسن صورة وهي المخلقة فإن أخطأ فمن غير هذا المنزل ومن هذا المنزل يعلم سبب العشق الحاصل في العاشق ما هو وما الرابطة بين العاشق والمعشوق حتى التف به على الاختصاص دون غيره ولما ذا يراه في عينه أجمل ممن هو أجمل منه في علمه ولما ذا يكون تحت سلطان المعشوق وإن كان عبده ولما ذا ينتقل الحكم على السيد للعبد إذا كان معشوقا له فيكون تحت أمره ونهيه لا يقدر في نفسه أن يتصور مخالفته فيما يأمره به عبده وكيف انتقلت السيادة إليه وانتقلت العبودية إلى الآخر السيد ظاهرة الحكم بالتصرف فيه ولما ذا يتخيل أنه يراه أعظم عنده من نفسه وأن سعادته في عبوديته وذلته بين يديه مع أنه يحب الرئاسة بالطبع ولما ذا أثر في طبعه وتتبين له قوة الأرواح على الطبع وأن العشق روحاني فرده إلى ما تقتضيه حقيقة الروح فإن الروح لا رياسة عنده في نفسه ولا يقبل الوصف بها ويعلم هل ينقسم العشق إلى طبع وروح أو هو من خصائص الروح أو هو من خصائص الطبع لوجوده من الحيوان والنبات ويعلم لما ذا كان العشق من الإنسان لجارية أو غلام بحيث أن يفنى فيه ويكون بهذه المثابة التي ذكرناها ولا يستفرغ هذا الاستفراغ في حب من ليس بإنسان من ذهب وفضة وعقار وعروض وغير ذلك وهو علم شريف ولما ذا يستفرغ مثل هذا الاستفراغ في محبة الحق وحده دون ما ذكرناه ويعلم هل محبته للحق جزئية أم كلية ومعنى ذلك أنه هل أحبه بكله من حيث طبعه وروحه أو من حيث روحه فقط لأن الحب الطبيعي لا يليق أن يتعلق من المحب بذلك الجناب وهل لذلك الجناب مظهر يمكن أن يتعلق به الحب الطبيعي أم لا كل ذلك من خصائص علم هذا المنزل ومما يستفيد من علوم هذا المنزل علم الزمان ولما ذا يرجع هل لأمر وجودي أو لأمر عدمي وهل الليل والنهار زمان أو دليل على إن ثم زمانا وهل حدث الليل والنهار في زمان ومن هذا المنزل يعلم ترتيب الهياكل الموضوعة لاستنزال الأرواح وصورها وأشكالها وبنائها وما ينقش عليها وما ينفعل عنها وكم مدتها بعد معرفته هل لها مدة أم لا ويعلم علم الحروف والنجوم من حيث خصائصها وطبائعها وتأثيراتها التي فطرها الله عليها وفيمن تؤثر وبما ذا تحتجب عن تأثيرها وإذا قيدت بما ذا يطلق من قيدته عن تقييدها وإذا أطلق بما ذا يقيد من إطلاقه ويعلم من هذا المنزل ما أردناه بقولنا\n\n\n> الحق ما بين مجهول ومعروف *** فالناس ما بين متروك ومألوف‏\n\n\n> والشأن ما بين وصاف وموصوف *** فالحال ما بين مقبول ومصروف‏\n\n\nفهذا بعض ما يحويه هذا المنزل وهو كثير والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Seventy-Eight: Concerning the Knowledge of the Station of Intimacy (منزل الألفة) and its Secrets, from the Mosaic (Mūsawī) and Muhammadan (Muḥammadī) Stations.\n\n> The Station of Intimacy (الألفة) is not entered\n> Except by one existing upon His Form.\n> You see him, when you perceive him,\n> Descending into it according to his chapter (sūrah).\n> Ruling within it by what he knows,\n> Proceeding within it according to his conduct (sīrah).\n> The Real (الحق) chose him as a mirror for Himself,\n> And for this reason, He increased his chapter (sūrah).\n> Then Allah forbade him, as signs for him,\n> That this prohibition stemmed from His jealousy (ghayrah).\n> When He restricted what was absolutely his,\n> He was purified from his confusion.\n> He ate of the forbidden thing, and the rank of eating\n> Appeared in his nakedness.\n> So he knew, when he saw it, that it was\n> A slip that came to him from his neighbor (jīrah).\n\n### [Intimacy between two things only occurs due to a suitability between them]\n\nTwo things do not achieve intimacy (الألفة) unless there is a suitability (munāsabah) between them. The Station of Intimacy (منزل الألفة) is the comprehensive relationship (al-nisbah al-jāmi‘ah) between the Real (الحق) and Creation (الخلق), and it is the Form (al-ṣūrah) upon which the human being was created. For this reason, no creature of Allah has claimed divinity (al-ulūhiyyah) except the human being; others have had it claimed *for* them, but they did not claim it themselves. Pharaoh said: <<أَنَا رَبُّكُمُ الْأَعْلى‏>> (I am your Lord, the Most High).\n\nThere is none among creation who possesses ownership (mulk) except the human being; what is other than the human being, whether angel or otherwise, possesses nothing. The Exalted says, confirming ownership for the human being: <<أَوْ ما مَلَكَتْ أَيْمانُكُمْ>> (Or what your right hands possess). Furthermore, there is no existing thing that acknowledges servitude (‘ubūdiyyah) except the human being, so it is said: \"This is the servant of so-and-so.\" For this reason, Allah legislated emancipation for him and encouraged it, and established for him the clientage (walā’) of the freed slave if he dies without an heir, just as the inheritance belongs to Allah from His servants. The Exalted says: <<إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا>> (Indeed, We are the ones who will inherit the earth and whoever is upon it). Furthermore, there is no existing thing that accepts being named by all the Divine Names (الأسماء الإلهية) except the human being. He has been encouraged to acquire the moral character (al-takhalluq) of these Names. For this reason, he was granted the Vicegerency (khilāfah) and Representation (niyābah), and was taught all the Names. He was the final manifestation (nash’ah) in the cosmos, encompassing the realities of the cosmos, including all that Allah specifically designated for His dominion and His Form (ṣūrah). Also part of his manifestation is his natural constitution, composed of the four natures, along with the rational faculty (al-quwwah al-nāṭiqah) with which he was uniquely endowed in his nature, unlike other things created from nature. This is like the Divine Form (al-ṣūrah al-ilāhiyyah) which stands upon four pillars, which rational proof (al-dalīl al-‘aqlī) yields nothing else: Life (al-ḥayāh), Knowledge (al-‘ilm), Power (al-qudrah), and Will (al-irādah). By these, the creation of the world for him was validated, and he was a god (ilāh) by means of them. For if he were stripped of these relationships (nisab), he would not be a god for the world. This is the established similitude (al-mathal) in the Quran, which is unmatched, in His saying, the Exalted: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him)—meaning, there is nothing like unto His similitude. Thus, He established similitude for Himself through the human being, in order to declare His transcendence (tanzīh), meaning: if the supposed similitude is unmatched, then the Exalted is even further removed and more transcendent from being matched. And in the Sunnah: \"Adam was created upon His Form (ṣūrah).\" By this verse, He negated that this similitude should be matched, and He established for him the Unseen (ghayb) and the Witnessed (shahādah). Since the human being holds this rank, intimacy (الألفة) exists between him and his Lord, so He loved him, and he loved Him. For this reason, it is reported that the heavens and the earth—meaning the high and the low—did not contain Him, but the heart of the pious, God-fearing believer contained Him. This is a characteristic of the human being, not of the angel. Although the human being shares in everything we have mentioned, he is distinguished from all others by the totality (al-majmū‘) and by the Form (al-ṣūrah). Know this. Therefore, pure servitude (‘ubūdiyyah), which is absolutely untainted by Lordship (rubūbiyyah), is only valid for the Perfect Human (الإنسان الكامل) alone. And absolutely pure Lordship, which is untainted by servitude in any respect, is only valid for Allah the Exalted. Thus, the human being is upon the Form of the Real (الحق) in terms of transcendence (tanzīh) and sanctification (taqdīs) from admixture in his reality. He is the absolute object of worship (al-ma’lūh al-muṭlaq), and the Real, glory be to Him, is the absolute God (al-ilāh al-muṭlaq). By all this, I mean the Perfect Human (الإنسان الكامل). The Perfect Human is separated from the non-perfect human by only one subtle point (raqīqah): that his servitude is absolutely untainted by Lordship. Since the Perfect Human holds this high rank, he alone is the intended essence (al-‘ayn al-maqṣūdah) of the cosmos. This perfection appeared in Adam, peace be upon him, in His saying, the Exalted: <<وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا>> (And He taught Adam all the Names). He emphasized it with \"all\" (kullahā), a word that implies comprehensiveness, and the Real bore witness to this for him. This perfection also appeared in Muhammad, may Allah bless him and grant him peace, by his saying: \"So I knew the knowledge of the first and the last.\" Thus, the knowledge of Adam entered into his knowledge, for Adam is among the first. He only mentioned \"the last\" to remove the ambiguity that might occur to the listener if he did not know what we have indicated concerning this matter. He, may Allah bless him and grant him peace, was granted the comprehensive words (jawāmi‘ al-kalim) by his own testimony for himself. Our companions differed as to which of the two stations is higher: the one for whom the Real bears witness, or the one who bears witness for himself by the Real, such as John (Yaḥyā) and Jesus (‘Īsā), peace be upon them. As for our doctrine concerning this, the one who bears witness for himself, being truthful in his testimony, is more complete, higher, and more deserving. This is because he only bore witness for himself based on a verified direct experience (dhawq muḥaqqaq) of his perfection in that to which he bore witness for himself. His testimony is elevated above any possibility of ambiguity in the spiritual state (ḥāl). Thus, he is superior to the one for whom testimony is borne, due to the removal of ambiguity and the verified direct experience. This station is higher. However, it is not the way of the just, courteous scholar knowledgeable of the path of Allah to speak about the superiority of men, even if he knows it; courtesy (adab) prevents him. For this reason, we say that the courteous person only speaks about the superiority of the stations (maqāmāt), thereby absolving himself of responsibility in the matter. And his spiritual state is safe from being challenged regarding it, since the stations themselves are not sought, but rather the people described by them are sought. The state of the courteous person is as we have mentioned. All that we have mentioned is witnessed by whoever attains this Station. For him, among the letters, is the intimacy (ألفة) of the Lām (ل) with the Alif (ا), which is the first composite letter among the letters. The form unified them, so the Alif is not distinguished from the Lām; thus, it is joined to the single letters, as if they were one letter, because separation is impossible. The shape of the Lām is not distinguished from the shape of the Alif within it, so the sight does not perceive the difference. If it is said that hearing perceives it by the utterance *lā* (لا), then know that the Lām accepts vocalization (ḥarakah), but the Alif does not. Thus, the Alif cannot be pronounced, so the Lām is pronounced with a saturated vocalization for the manifestation of the Alif, so that it is known that he intended the Lām-Alif (لا) and not the Lām of any other letter, until the writer inscribes it upon its specific form. The Alif is not distinguished from the Lām due to the establishment of intimacy (الألفة). Likewise, the human being, when the Real (الحق) is his hearing and sight, as reported in the tradition (khabar), is connected to the Real like the connection of the Lām to the Alif. For this reason, it precedes the letters of the testimony of Unity (tawḥīd) in the phrase *Lā ilāha illā Allāh* (There is no god but Allah). By the letter of Intimacy (ḥarf al-ulfa), He negated the divinity (ulūhah) of every god that the ignorant polytheist affirmed for other than Allah. He negated this by a letter that encompasses the servant and the Lord. For it encompasses the signification of the Lām and the Alif, just as he, peace be upon him, said: \"I and Abu Bakr and Umar believed in this.\" Thus, he included them with himself in the belief, even if they were not present, or if they were, he acted as their deputy. When the Real bore witness to Unity for Himself, He bore witness to it on His own behalf and on behalf of His servant. Thus, He brought the letter Lām-Alif (لا). For this reason, it is named Lām-Alif, and not *al-Lām al-Alif* (the Lām-Alif) with the definite article. It was named by the name of the two letters so that the listener, if it came defined, would not imagine that the speaker intended an annexation (iḍāfah) and not this specific letter. Thus, it follows the pattern of Rāmhurmuz and Ba‘labakk, and not the pattern of ‘Abd Allāh (Servant of Allah) and ‘Abd al-Raḥmān (Servant of the Merciful). For this reason, there is disagreement regarding the place of grammatical inflection (i‘rāb) in Ba‘labakk, Rāmhurmuz, and Bilālābād, but no disagreement in ‘Abd Allāh and ‘Abd al-Raḥmān. This is because the one named by the latter intended annexation necessarily. So, whoever treats these names like an annexed noun places the point of inflection at the end of the first noun. And whoever treats it like Zayd places the point of inflection at the end of the second noun. Likewise, disagreement occurs regarding the letter Lām-Alif when written, in determining which branch (fakhdh) of this letter is the Lām and which branch is the Alif. People's considerations regarding this differ. Whoever measures the script against the pronunciation considers the Lām to be the one with which the scribe begins, whether that branch is the one preceding in order or the one following. Whoever does not base it on pronunciation remains in disagreement, and he is given the choice in this, so he may designate whichever of the two branches he wishes as the Lām and whichever he wishes as the Alif, since each of them is in the form of the other due to the intertwining (al-iltifāf) that removed the Lām from its reality. Likewise, the Perfect Human (الإنسان الكامل) and the Real (الحق) are in the Form that has descended to the level of intertwining. If you attribute the act to the power of the servant, there is a basis for that in the Divine communication (al-ikhbār al-ilāhī). And if you attribute the act to Allah, there is a basis for that in the Divine communication. As for the rational proofs (al-adillah al-‘aqliyyah), they contradict each other according to the rationalists, even though they are not contradictory in reality (fī nafs al-amr). However, it is difficult and impossible for rationalists to distinguish the proof from the sophism (shubhah). Likewise, it is impossible in the Divine communication, and likewise, it is impossible in the reality of the servant, due to the command being related to him. For only he who has the power to perform what he is commanded and the ability to abandon what he is forbidden is commanded. Thus, it is difficult to negate the act from the accountable one (al-mukallaf), who is the servant, because the wisdom of the address (ḥikmat al-khiṭāb) would be removed in that case. The other communication and the other rational perspective indicate that the act attributed to the servant belongs only to Allah. Thus, they contradict, both textually and rationally. This is the place of confusion (al-ḥīrah) and the reason for the disagreement on this issue among rationalists regarding their proofs and among the people of tradition regarding their proofs. Only the People of Unveiling (ahl al-kashf) among the People of Allah know this specifically. The fact that the human being is upon the Form (al-ṣūrah) demands the existence of the act for him; the accountability (al-taklīf) supports this, and sensation (al-ḥiss) testifies to it. This is the strongest indication. The return of all this to Allah by virtue of the Origin (al-aṣl) does not invalidate this, for it does not contradict this affirmation. For this reason, the argument of those who affirm acquisition (al-kasb) is weak—not because they affirmed acquisition, for these people (Sufis) also affirm it, because it is a legal communication (khabar shar‘ī) and a rational matter that the human being knows from himself. Rather, their argument is weak in their negation of the effect (al-athar) from the originated power (al-qudrah al-ḥādithah). Now that you have learned this section concerning the Station of Intimacy (منزل الألفة), let us proceed to what relates to its verification in a different style, encompassing its contents by way of clarification.\n\n### [That Intimacy is a Station of the Substitutes (al-Abdāl)]\n\nKnow that this Station is the station of the journey (safar) of the seven Substitutes (al-Abdāl), who are gathered and intimate (mut’allifīn), despite the spiritual contraction (al-qabḍ) they experience, some regarding others, and the denial some hold toward others, while purity (al-ṣafā’) exists between them. They have two journeys in the domain of Gnosis (al-ma‘rifah): one journey is to the God (al-Ilāh) in His manifestations (maẓāhir), and another journey is also to the Essence (al-Dhāt). Their journey to the God is from their Lordship (rubūbiyyah), and their journey to the Essence is from their own essences (dhawātihim). If they intend the journey to the Essence, they head for Yemen. If they intend the journey to the God, they head for Syria (al-Shām) and the northern lands. Whichever direction they intend, their preparedness is equal in the measure they require, even if it varies. For provisions (al-aghthiyah) vary with the variation of directions. Only the provision that suits the temperament (mizāj) of the traveler to that direction is taken, lest illness, due to the differing inclinations (ahwā’) in those directions and their effect on the temperament, obstruct him from his goal. Thus, the preparedness must differ, although their stay in both journeys is short, and they return to their homelands. If they head for Yemen, they do not stay there for more than twenty-four days, during which they achieve their purpose and return for another year. If they head for the North, they do not stay there for more than six days, during which they achieve their purpose and return for another year. Their journey is spiritual (rūḥānī), not physical (jismānī). As for the sciences they benefit from in their journey to Yemen, they are the sciences of rapture (al-iṣṭilām) and the science of the Glories (al-subuḥāt) from behind the veils—a science of direct experience (dhawq). As for the sciences they benefit from in their journey to the North, they are the sciences of the increase of certainty (yaqīn) through what is disclosed (yatajallā) to them, and the science of servitude (‘ubūdiyyah), contraction (al-qabḍ), and what spiritual retreats (al-khalawāt) produce—a science of direct experience. Their homeland where they settle is Mecca, for the descent (al-tanazzul) into its spirituality is the most complete descent. Because it is, as the Exalted said: <<أُمَّ الْقُرَى>> (The Mother of Cities), and He said: <<يُجْبَى إِلَيْهِ ثَمَرَاتُ كُلِّ شَيْءٍ>> (The fruits of all things are gathered to it), making it general. And He said concerning it: <<رِزْقًا مِنْ لَدُنَّا>> (A provision from Our presence). He did not attribute it to anything else. These are sciences of divine gift (wahb) by which their spirits are revived, and He did not say this concerning any place other than Mecca. These sciences we have indicated are only attained by one whose spiritual state (ḥāl) is humility (al-dhillah) and destitution (al-iftiqār), and whose station (maqām) is Majesty (al-jalāl), Contraction (al-qabḍ), Awe (al-haybah), and Fear (al-khawf). If the servant’s descriptions are as we have mentioned, Allah grants him might (‘izzah) and richness (ghinā) in his state, and Beauty (al-jamāl), Expansion (al-basṭ), Intimacy (al-uns) with Him, and hope in others, but not in himself. For regarding himself, he is safe from his Lord because he has been given glad tidings, as He said: <<لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا>> (For them are glad tidings in the life of this world). And the glad tidings of the Real (الحق) are true; abrogation (naskh) does not enter them, so one is safe from the possibility of cunning (al-makr) regarding their existence, provided it is a clear text (naṣṣ). In this Station, there is a wondrous direct experience (dhawq) that is not found elsewhere: if you are in any spiritual state, the Real grants you a knowledge derived from that state, from which you do not depart. This is like one who moves from knowing a thing to witnessing that thing directly; he gains nothing but increased clarity regarding a single essence (‘ayn wāḥidah). Likewise, this Station is the station from which the combination of two opposites is known: the existence of the opposite in the very essence of its opposite. This knowledge is the strongest knowledge by which Unity (al-waḥdāniyyah) is learned, because he witnesses a state that he cannot possibly ignore: that the essence of the opposite is, in itself, the essence of its opposite. Thus, he perceives the Oneness (al-aḥadiyyah) within the Multiplicity (al-kathrah), not according to the method of the people of number, for that is an imagined method, but this is a witnessed, verified knowledge. Among those who excelled in this blessed Station was Abū Sa‘īd al-Kharrāz, one of the early masters. I used to hear this about him until I entered it myself and attained what I attained. Then I knew that it was the Real, and that people were right in their denial of it. For they deny it rationally, and the power of the intellect, from the perspective of its speculation, cannot achieve more than this. Whoever gives what is within his capacity, according to what that perspective demands, has fulfilled the matter its due right. This is what our footing has settled upon and become firm. We do not deny a claimant what he claims, except for the denial we have been commanded to make, so we deny it legally (shar‘an). This denial is also a reality (ḥaqīqah); we only witness the form (hay’ah) by which and in which denial is necessary. Just as we denied it rationally, the Law (al-shar‘) has a power by which it does not transgress what its reality yields, just as we did with the intellect. And direct experience (al-dhawq) has a power, and we treat it accordingly, just as we treat all other things to which power is attributed, according to its power. Thus, we are with the moment (al-waqt). We deny with the intellect what the intellect denies, because our moment is the intellect, and we do not deny it by Unveiling (kashf) or by Law (shar‘). And we deny with the Law what the Law denies, because our moment is the Law, and we do not deny it by Unveiling or by intellect. As for Unveiling (al-kashf), it denies nothing; rather, it affirms everything in its proper level (rutbah). So, whoever's moment is Unveiling is denied by others, but he denies no one. Whoever's moment is the intellect denies and is denied. And whoever's moment is the Law denies and is denied. Know this.\n\n### [That the He (Huwa) is, by its reality, never attained or witnessed]\n\nKnow that this Station has a spiritual state (ḥāl) that no other possesses: it grants the attainment of the Ipseity (huwiyyah) of the Divine Names (الأسماء الإلهية). This contradicts what the reality of the He (Huwa) yields, for the He, by its reality, is never attained or witnessed, except in this specific witnessing (mashhad) and Station. For the essence (‘ayn) of the Manifest (al-Ẓāhir) in it is, in itself, the essence of the Hidden (al-Bāṭin). However, the Ipseity of the Real (huwiyyat al-Ḥaqq) does not enter this Station. We only stated this regarding the Ipseity of the Divine Names from the perspective of their Ipseity, not from their I-ness (anāniyyah).\n\n### [Attaining the Knowledge of Proofs and Signs from the Messengers]\n\nKnow that when you enter this Station, you gather within it with a group of Messengers, may the blessings of Allah be upon them. You benefit from their specific direct experience (dhawq) sciences that you did not possess, which become Unveiling (kashf) for you, just as they were direct experience for them. From them, you attain the science of proofs (al-adillah) and signs (al-‘alāmāt). Nothing in the earth or the heaven, when disclosed (tajallā) to you, remains hidden from you; you distinguish it and know it, while others who have not attained this Station remain ignorant of it. This is a science of Unveiling (kashf) because you witness it by the sign; you do not see it from yourself, because it is not a direct experience (dhawq) for you. You also attain from them the science of Eternity (al-qidam), which is a precious science. By it, your stability is secured regarding the secrets and sciences you attain after separating from the Presences (al-Ḥaḍarāt) in which you attained that knowledge and those secrets. Many people forget what they have witnessed. But when they attain this science from this Prophet, they become stable in it with the stability of the Prophets. You also attain from them the science of the Divine Laws (al-sharā’i‘) in the world: where their source is, how they were taken, why they differed in some rulings, and in what they agreed and converged. The possessor of this Unveiling (kashf), were he not divinely supported in his unveiling, would claim Prophethood. But Allah supports His friends (awliyā’) and protects them from the error of claiming what is not theirs, because they have abandoned the portions of their souls (ḥuẓūẓ nufūsihim) regarding creation. However, they do not abandon their portions regarding the Real (al-Ḥaqq). It is not valid to seek the Real for the sake of the Real; rather, He is sought for the sake of one's portion (al-ḥaẓẓ). For the benefit of seeking is the attainment of the sought object, and the Real is not attained by anyone, so it is not valid for Him to be the sought object of a knower. Thus, nothing remains but the portion. From this science, lovers (‘ushshāq) are treated when love (al-maḥabbah) becomes excessive in them. From this Presence (al-Ḥaḍrah), the medicine of rest is extracted for them from the torment that passion (al-‘ishq) brings: anxiety (al-qalaq), grief (al-kamad), and agitation (al-inzi‘āj). Also attained from witnessing these Prophets is the knowledge of what the deputies (nuwwāb) of the Real need in dealing with His servants: mercy (al-raḥmah), subjugation (al-qahr), severity (al-shiddah), and gentleness (al-līn). And how they deal with creation, how they deal with the Real, and how they deal with themselves when they are deputies. He benefits from all this, even if he has not attained the degree of general deputyship. Rather, he is Allah’s deputy in his own private world, which is himself, his family, and his children, if he has a family and children. He also attains from them the secret by which the ignorant person is revived from the death of his ignorance, and by which Allah revives the dead. This returns to the Station of Intimacy (منزل الألفة), because life for a thing only occurs through its intimacy (ta’alluf) with it and its regard for it, derived from His Name, the Living (al-Ḥayy), which is not based on composition (ta’līf). Also attained is the science of complete creation (al-khalq al-tāmm) in His saying: <<مُخَلَّقَةٍ>> (perfectly formed). He does not attain the science of the unformed (ghayr al-mukhallaqah) in this Station. That is only attained by one who has attained another Station. In this Station, he learns from these Prophets the conceptual science (al-‘ilm al-taṣawwurī), which is the knowledge of the single entities (al-mufradāt) that have not been compounded. From this Station, meanings (al-ma‘ānī) put on forms (al-ṣuwar). He conceptualizes the world’s issues within himself, then presents them to the learners in the most beautiful form, which is the perfectly formed (al-mukhallaqah). If he errs, it is from outside this Station. From this Station, he learns the cause of the passion (al-‘ishq) that occurs in the lover (‘āshiq): what it is, and what the bond (al-rābiṭah) is between the lover and the beloved (ma‘shūq), such that he is intertwined with him specifically, to the exclusion of others. Why he sees him in his eye as more beautiful than one who is more beautiful than him in his knowledge. Why he is under the authority (sulṭān) of the beloved, even if the beloved is his servant. Why the ruling authority (al-ḥukm) transfers from the master (al-sayyid) to the servant if the servant is his beloved, such that the master is under the servant’s command and prohibition, unable even to conceive of disobeying what his servant commands him. How the mastery (al-siyādah) transferred to the servant, and the servitude (‘ubūdiyyah) transferred to the other, the master, whose authority to dispose of the servant is apparent. Why he imagines that he sees the beloved as greater to him than himself, and that his happiness lies in his servitude and humiliation before him, even though he naturally loves leadership (al-ri’āsah). Why this affected his nature, and the power of the spirits (al-arwāḥ) over nature becomes clear to him, and that passion (al-‘ishq) is spiritual (rūḥānī), thus referring it back to what the reality of the spirit demands. For the spirit has no leadership in itself and does not accept being described by it. He learns whether passion is divided into natural and spiritual, or whether it is a characteristic exclusive to the spirit, or exclusive to nature, given its existence in animals and plants. He learns why the passion of a human being for a girl or a boy reaches the point of annihilation (fanā’) in them and attains the rank we mentioned, yet this outpouring is not expended in the love of non-humans, such as gold, silver, real estate, goods, and other things. This is a noble science. And why such an outpouring is expended solely in the love of the Real (al-Ḥaqq), excluding what we have mentioned. He learns whether his love for the Real is partial or total, meaning: did he love Him with his totality, from the perspective of his nature and spirit, or only from the perspective of his spirit? Because natural love is not fitting to be attached by the lover to that Divine Presence (janāb). And whether that Divine Presence has a manifestation (maẓhar) to which natural love can be attached or not. All this is among the specific sciences of this Station. Among the sciences benefited from in this Station is the science of Time (al-zamān): why it returns, whether due to an existent matter (amr wujūdī) or a non-existent matter (‘adamī). And whether night and day are time, or merely evidence that time exists, and whether night and day occurred within time. From this Station, he learns the arrangement of the temples (al-hayākil) established for the descent of spirits (al-arwāḥ), their forms, shapes, and construction, what is inscribed upon them, what is affected by them, and their duration, after knowing whether they have a duration or not. He learns the science of Letters (al-ḥurūf) and Stars (al-nujūm) from the perspective of their specific characteristics, natures, and the influences (ta’thīrāt) upon which Allah created them. Upon whom they influence, by what they are veiled from their influence, and when they are bound, by what their bondage is released from their binding, and when they are released, by what their release is bound. And he learns from this Station what we intended by our saying:\n\n> The Real (الحق) is between the unknown and the known,\n> And people are between the abandoned and the intimate (ma’lūf).\n> The affair (al-sha’n) is between the describer and the described,\n> And the spiritual state (al-ḥāl) is between the accepted and the rejected.\n\nThis is some of what this Station contains, and it is much. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو اٹھہتر: منزلِ اُلفت کی معرفت اور اس کے اسرار، مقامِ موسوی اور محمدی کے حوالے سے\n\nمنزلِ اُلفت میں داخل نہیں ہوتا،\nمگر وہ جو اس کی صورت پر موجود ہو۔\n\nپس جب تو اسے دیکھے گا، تو اسے پائے گا،\nکہ وہ اس میں اپنی سورت (شکل/ہیئت) پر نازل ہو رہا ہے۔\n\nاس میں اس چیز کے ساتھ حکم چلا رہا ہے جو وہ جانتا ہے،\nاور اس میں اپنی سیرت پر جاری ہے۔\n\nپس ذات حق (الحق) نے اسے اپنے لیے آئینہ چن لیا،\nاسی لیے اس کی سورت (شکل) میں اضافہ کر دیا۔\n\nپھر اللہ نے اسے بطور علامت منع فرمایا،\nکہ یہ ممانعت اس کی غیرت کی وجہ سے تھی۔\n\nجب اس نے اس چیز کو روکا جو اس کے لیے تھی،\nتو وہ مطلقاً اپنی حیرت سے پاک ہو گیا۔\n\nاس نے ممنوعہ چیز کھا لی، تو کھانے کا مرتبہ،\nاس کی شرمگاہ میں ظاہر ہو گیا۔\n\nپس جب اس نے اسے دیکھا تو جان لیا،\nکہ یہ لغزش اسے اس کے پڑوس سے پہنچی ہے۔\n\n### [دو چیزوں میں اُلفت تبھی ہوتی ہے جب ان کے درمیان کوئی مناسبت ہو]\n\nدو چیزوں میں اُلفت تبھی ہوتی ہے جب ان کے درمیان کوئی مناسبت ہو۔ پس منزلِ اُلفت وہ نسبتِ جامعہ ہے جو ذات حق (الحق) اور خلق کے درمیان ہے، اور یہی وہ صورت ہے جس پر انسان کو پیدا کیا گیا۔ اسی لیے اللہ کی مخلوق میں سے کسی نے بھی الوہیت کا دعویٰ نہیں کیا سوائے انسان کے، اور اس کے علاوہ کسی اور میں یہ دعویٰ کیا گیا مگر اس نے خود نہیں کیا۔ فرعون نے کہا: \"أَنَا رَبُّكُمُ الْأَعْلى‏\" (میں تمہارا سب سے بڑا رب ہوں)۔\n\nمخلوق میں کوئی بھی ملکیت نہیں رکھتا سوائے انسان کے۔ اور انسان کے علاوہ جو بھی ہے، خواہ وہ فرشتہ ہو یا کوئی اور، وہ کسی چیز کا مالک نہیں ہے۔ اللہ تعالیٰ انسان کے لیے ملکیت ثابت کرتے ہوئے فرماتا ہے: \"أَوْ ما مَلَكَتْ أَيْمانُكُمْ\" (یا جو تمہارے داہنے ہاتھ کے مالک ہوئے)۔\n\nاور کوئی موجود ایسا نہیں جو بندگی (العبودية) کا اقرار کرے سوائے انسان کے۔ اسی لیے کہا جاتا ہے کہ یہ فلاں کا غلام ہے۔ اسی وجہ سے اللہ نے اس کے لیے آزادی (عتق) کو مشروع کیا اور اس کی ترغیب دی، اور آزاد کردہ غلام کے لیے ولاء (وراثت کا حق) مقرر کیا اگر وہ بغیر وارث کے مر جائے۔ جیسا کہ اپنے بندوں کی وراثت اللہ کے لیے ہے، اللہ تعالیٰ فرماتا ہے: \"إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا\" (بیشک ہم ہی زمین اور جو کچھ اس پر ہے، اس کے وارث ہوں گے)۔\n\nاور کوئی موجود ایسا نہیں جو تمام الٰہی اسماء سے موسوم ہونے کو قبول کرے سوائے انسان کے۔ اور اسے ان اسماء سے متخلق ہونے کی ترغیب دی گئی ہے۔ اسی لیے اسے خلافت اور نیابت عطا کی گئی، اور اسے تمام اسماء کا علم سکھایا گیا۔ اور وہ عالم میں آخری نشأت ہے جو عالم کی تمام حقائق کو جامع ہے، جن کے ساتھ اللہ نے اپنی پوری ملکیت اور اپنی صورت کو خاص کیا۔ اور اس کی نشأت میں چار طبائع سے قائم ہونے والی طبعی نشأت بھی شامل ہے، ساتھ ہی قوتِ ناطقہ بھی، جس کے ساتھ اسے اپنی طبیعت میں خاص کیا گیا، برخلاف ان مخلوقات کے جو طبیعت سے پیدا کی گئیں، جیسے کہ الٰہی صورت جو چار چیزوں پر قائم ہے، جن کے علاوہ عقل کوئی دلیل نہیں دیتی، اور وہ ہیں: حیات، علم، قدرت، اور ارادہ۔\n\nانہی کی وجہ سے عالم کا اس کے لیے وجود میں آنا درست ہوا، اور وہ ان کے ذریعے الٰہ بنا۔ اگر وہ ان نسبتوں سے خالی ہوتا تو عالم کا الٰہ نہ ہوتا۔ اور یہ وہ مثال ہے جو قرآن میں مقرر کی گئی ہے، جو کسی سے مماثلت نہیں رکھتی، جیسا کہ اللہ تعالیٰ کا فرمان ہے: \"لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\" (اس کی مثال جیسا کوئی نہیں)۔ یعنی اس کی مثال کی مثال جیسا کوئی نہیں ہے۔ پس اس نے انسان کے ذریعے اپنے لیے مثلیت ثابت کی، تاکہ اسے پاکیزہ قرار دے۔ یعنی جب فرض کی گئی مثال ہی مماثلت نہیں رکھتی، تو وہ ذات حق (الحق) مماثلت سے اور بھی زیادہ دور اور پاک ہے۔ اور سنت میں ہے کہ \"آدم کو اس کی صورت پر پیدا کیا گیا\"۔ اور اس آیت کے ذریعے اس مثال کی مماثلت کی نفی کی گئی، اور اس کے لیے غیب اور شہادت مقرر کی گئی۔\n\nجب انسان اس مرتبے پر فائز ہوا، تو اس کے اور اس کے رب کے درمیان اُلفت قائم ہوئی، پس اس نے اسے چاہا اور اس نے اسے چاہا۔ اسی لیے یہ روایت آئی ہے کہ آسمان اور زمین (یعنی علو اور سفل) اس میں سما نہ سکے، مگر متقی اور پرہیزگار مومن کا دل اس میں سما گیا۔\n\nیہ انسان کی صفت ہے، فرشتہ کی صفت نہیں۔ اگرچہ انسان کو ان تمام چیزوں میں شریک کیا گیا جن کا ہم نے ذکر کیا، لیکن انسان مجموعی طور پر اور صورت کے لحاظ سے سب سے ممتاز ہے۔ پس یہ جان لو۔ پس خالص بندگی (العبودية المحضة) جس میں ربوبیت کی آمیزش بالکل نہ ہو، صرف انسان کامل (الإنسان الکامل) کے لیے ہی درست ہے۔ اور خالص ربوبیت جو کسی بھی صورت میں بندگی سے آلودہ نہ ہو، صرف اللہ تعالیٰ کے لیے ہی درست ہے۔\n\nپس انسان ذات حق (الحق) کی صورت پر ہے، اپنی حقیقت میں آمیزش سے پاکیزگی اور تقدیس کے لحاظ سے۔ پس وہ مطلق مألوہ (جس سے اُلفت کی جائے) ہے، اور ذات حق (الحق) مطلق الٰہ ہے۔ اور ان سب سے میری مراد انسان کامل (الإنسان الکامل) ہے۔ اور انسان کامل غیر کامل سے صرف ایک لطیف فرق کی وجہ سے جدا ہوتا ہے، اور وہ یہ ہے کہ اس کی بندگی میں ربوبیت کی آمیزش بالکل نہ ہو۔\n\nاور جب انسان کامل (الإنسان الکامل) کو یہ بلند منصب حاصل ہوا، تو وہ اکیلا ہی عالم کا مقصودِ عین بنا۔ اور یہ کمال آدم علیہ السلام میں اللہ تعالیٰ کے اس فرمان میں ظاہر ہوا: \"وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا\" (اور آدم کو تمام نام سکھا دیے)۔ پس اس نے \"کلہا\" (تمام) کے لفظ سے اس کی تاکید کی، جو احاطہ کا تقاضا کرتا ہے۔ پس ذات حق (الحق) نے اس کے لیے اس کی گواہی دی۔ جیسا کہ یہ کمال محمد صلی اللہ علیہ وسلم میں بھی ظاہر ہوا، آپ کے اس قول سے: \"پس میں نے اولین اور آخرین کا علم جان لیا۔\"\n\nپس آدم کا علم آپ کے علم میں داخل ہو گیا، کیونکہ وہ اولین میں سے ہیں۔ اور آپ نے آخرین کا ذکر صرف اس احتمال کو دور کرنے کے لیے کیا جو سننے والے کو ہو سکتا ہے اگر وہ اس چیز کو نہ جانے جس کی طرف ہم نے اشارہ کیا ہے۔ اور آپ صلی اللہ علیہ وسلم کو جوامع الکلم عطا کیے گئے، جیسا کہ آپ نے خود گواہی دی۔\n\nہمارے اصحاب میں اختلاف ہے کہ ان دو مقامات میں سے کون سا اعلیٰ ہے: جسے ذات حق (الحق) نے گواہی دی، یا جس نے خود ذات حق (الحق) کے ساتھ گواہی دی، جیسے یحییٰ اور عیسیٰ علیہما السلام؟ ہمارا مسلک اس بارے میں یہ ہے کہ جو شخص اپنے لیے گواہی دیتا ہے اور اپنی گواہی میں سچا ہے، وہ زیادہ کامل، اعلیٰ اور حقدار ہے۔ کیونکہ اس نے اپنے لیے گواہی نہیں دی مگر ایک محقق ذوق کے ذریعے، اپنے کمال کے ساتھ اس چیز میں جس کی اس نے اپنے لیے گواہی دی۔ اس کی وہ گواہی حال میں احتمال سے بلند ہے۔ پس وہ اس شخص سے افضل ٹھہرا جسے احتمال کے رفع اور محقق ذوق کے ذریعے گواہی دی گئی۔\n\nپس یہ مقام اعلیٰ ہے۔ اور منصف، ادیب، اور اللہ کے راستے کو جاننے والے کا یہ شیوہ نہیں کہ وہ مردوں کی فضیلت میں کلام کرے، اگرچہ وہ اسے جانتا ہو، مگر ادب اسے روکتا ہے۔ اسی لیے ہم نے کہا کہ ادیب صرف مقامات کی فضیلت میں کلام کرتا ہے، تاکہ وہ اس ذمہ داری سے بری ہو جائے، اور اس کا حال اس مطالبے سے محفوظ رہے، کیونکہ مقامات کا کوئی مطالبہ نہیں ہوتا، بلکہ مطالبہ ان سے ہوتا ہے جو ان سے متصف ہوں۔ پس ادیب کا حال وہی ہے جو ہم نے ذکر کیا۔\n\nاور یہ سب کچھ جو ہم نے ذکر کیا، وہ شخص اس کا مشاہدہ کرتا ہے جو اس منزل میں داخل ہو چکا ہو۔ اور حروف میں سے اس کے لیے لام کی الف کے ساتھ اُلفت (ألفة) ہے۔ اور یہ حروف میں سے پہلا مرکب حرف ہے۔ پس شکل نے اسے واحد کر دیا، یہاں تک کہ الف کو لام سے پہچانا نہ جا سکا۔ پس ذات حق (الحق) مفردات کے ساتھ ہے، گویا وہ دونوں ایک ہی حرف ہیں، کیونکہ ان کا جدا ہونا مشکل ہے، اور لام کی شکل الف کی شکل سے ممتاز نہیں ہوتی، لہٰذا آنکھ اسے نہیں پہچان سکتی۔ اگر کہا جائے کہ کان اسے \"لا\" کہنے سے پہچان لیتی ہے، تو جان لو کہ لام حرکت کو قبول کرتا ہے اور الف حرکت کو قبول نہیں کرتا۔ پس الف کا تلفظ ممکن نہیں ہوتا، لہٰذا لام کو حرکت کے ساتھ مشبع کر کے بولا جاتا ہے تاکہ الف کا ظہور ہو، تاکہ یہ معلوم ہو جائے کہ اس سے مراد لام الف ہے، نہ کہ حروف میں سے کوئی دوسرا لام۔ یہاں تک کہ لکھنے والا اسے اس کی خاص صورت پر لکھتا ہے، تو اُلفت کے کمال کی وجہ سے الف لام سے ممتاز نہیں ہوتا۔\n\nاسی طرح انسان جب ذات حق (الحق) اس کی سماعت اور بصارت بن جاتا ہے، جیسا کہ حدیث میں آیا ہے، تو وہ ذات حق (الحق) سے لام کا الف کے ساتھ جڑنے کی طرح جڑ جاتا ہے۔ اسی لیے یہ توحید کی شہادت کے حروف میں لفظ \"لا إله إلا الله\" میں مقدم ہوا۔ پس اُلفت کے حرف کے ذریعے ہر اس الٰہ کی الوہیت کی نفی کی گئی جسے جاہل مشرک نے اللہ کے علاوہ کسی اور کے لیے ثابت کیا تھا۔ پس اس نے اس کی نفی ایک ایسے حرف سے کی جو بندے اور رب دونوں کو شامل ہے، کیونکہ یہ لام اور الف کے مدلول کو شامل ہے۔\n\nجیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا: \"میں، اور ابوبکر، اور عمر اس پر ایمان لائے۔\"\n\nپس آپ نے ایمان میں ان دونوں کو اپنے ساتھ شریک کیا، حالانکہ وہ دونوں حاضر نہیں تھے یا اگر حاضر تھے تو آپ نے ان کی نیابت کی۔ پس جب ذات حق (الحق) نے اپنے لیے توحید کی گواہی دی، تو اس نے اپنی طرف سے اور اپنے بندے کی طرف سے اس کی گواہی دی۔ پس وہ لام الف کا حرف لایا۔ اسی لیے اسے \"لام الف\" کہا گیا اور تعریف کے ساتھ \"لام الألف\" نہیں کہا گیا۔ پس اسے دونوں حروف کے نام سے موسوم کیا گیا، تاکہ سننے والا جب اسے معرفہ کے ساتھ سنے تو یہ گمان نہ کرے کہ اس سے مراد اضافہ (اضافت) ہے، حالانکہ اس سے مراد یہ معین حرف ہے۔\n\nپس یہ رام ہرمز اور بعلبک کے زمرے میں آیا، اور عبد اللہ اور عبد الرحمن کے زمرے میں نہیں آیا۔ اسی لیے بعلبک اور رام ہرمز اور بلال آباد کے اعراب کی جگہ میں اختلاف ہوا، جبکہ عبد اللہ اور عبد الرحمن کے اعراب کی جگہ میں اختلاف نہیں ہوا، کیونکہ ان ناموں سے موسوم کرنے والے کا مقصد لازمی طور پر اضافت تھا۔ پس جس نے ان اسماء کو اسم مضاف کے زمرے میں رکھا، اس نے اعراب کی جگہ پہلے اسم کا آخر قرار دیا، اور جس نے اسے زید کے زمرے میں رکھا، اس نے اعراب کی جگہ دوسرے اسم کا آخر قرار دیا۔\n\nاسی طرح حرف لام الف میں بھی اختلاف واقع ہوا جب وہ خط میں واقع ہوتا ہے کہ اس حرف کا کون سا حصہ لام ہے اور کون سا حصہ الف ہے۔ اور لوگوں کی رعایتیں اس بارے میں مختلف ہوئیں۔ پس جس نے خط کو لفظ پر قیاس کیا، اس کے نزدیک لام وہ ہے جس سے کاتب ابتدا کرتا ہے، خواہ وہ حصہ ترتیب میں مقدم ہو یا مؤخر۔ اور جس نے اسے اس کے تلفظ پر محمول نہیں کیا، وہ اختلاف پر باقی رہا، اور اس کے لیے اس میں اختیار رکھا گیا کہ وہ دونوں حصوں میں سے جسے چاہے لام قرار دے اور جسے چاہے الف قرار دے، کیونکہ التفاف کی وجہ سے ہر ایک دوسرے کی صورت پر ہے، جس نے لام کو اس کی حقیقت سے نکال دیا۔\n\nاسی طرح انسان کامل (الإنسان الکامل) اور ذات حق (الحق) اس صورت میں ہیں جو التفاف کے مرتبے پر نازل ہوئی ہے۔ اگر تو فعل کو بندے کی قدرت کی طرف منسوب کرے، تو الٰہی خبر میں اس کی ایک جہت ہے۔ اور اگر تو فعل کو اللہ کی طرف منسوب کرے، تو الٰہی خبر میں اس کی بھی ایک جہت ہے۔\n\nجہاں تک عقلی دلائل کا تعلق ہے، تو وہ عقلاء کے نزدیک متعارض ہو گئے ہیں، اگرچہ وہ نفس الامر میں متعارض نہیں ہیں، لیکن عقلاء کے لیے دلیل کو شبہ سے ممتاز کرنا مشکل اور ناممکن ہو گیا۔ اسی طرح الٰہی خبر میں بھی مشکل ہے، اور اسی طرح بندے کی حقیقت میں بھی مشکل ہے، کیونکہ امر کا تعلق اس سے ہے۔ پس حکم صرف اسی کو دیا جاتا ہے جو اس فعل کو کرنے کی قدرت رکھتا ہو جس کا اسے حکم دیا گیا ہے، اور اس چیز کو چھوڑنے کی قدرت رکھتا ہو جس سے اسے منع کیا گیا ہے۔ پس مکلف (جو کہ بندہ ہے) سے فعل کی نفی کرنا مشکل ہے، کیونکہ اس صورت میں خطاب کی حکمت ختم ہو جاتی ہے۔ اور دوسری خبر اور دوسری عقلی جہت یہ بتاتی ہے کہ بندے کی طرف منسوب فعل درحقیقت اللہ ہی کا ہے۔ پس خبر اور عقل دونوں میں تعارض ہو گیا۔\n\nاور یہ حیرت کی جگہ ہے، اور عقلاء کے درمیان ان کے دلائل پر غور کرنے میں اور اہل اخبار کے درمیان ان کے دلائل میں اس مسئلے میں اختلاف واقع ہونے کا سبب ہے۔ اور یہ صرف اہل اللہ میں سے اہل کشف (الکشف) ہی جانتے ہیں۔ اور انسان کا صورت پر ہونا اس کے لیے فعل کے وجود کا تقاضا کرتا ہے، اور تکلیف اس کی تائید کرتی ہے، اور حس اس کی گواہی دیتی ہے۔ پس یہ دلالت میں زیادہ قوی ہے۔ اور اس میں یہ بات کوئی نقص پیدا نہیں کرتی کہ اصل کے حکم کے مطابق یہ سب کچھ اللہ کی طرف لوٹتا ہے، کیونکہ یہ اس تقرر کے منافی نہیں ہے۔\n\nاسی لیے کسب کے قائلین کی دلیل کمزور پڑ گئی، نہ اس وجہ سے کہ انہوں نے کسب کا قول کیا، کیونکہ یہ لوگ بھی اس کے قائل ہیں، اس لیے کہ یہ ایک شرعی خبر اور عقلی امر ہے جسے انسان اپنے نفس سے جانتا ہے۔ بلکہ ان کی دلیل اس وجہ سے کمزور پڑتی ہے کہ وہ حادث قدرت سے اثر کی نفی کرتے ہیں۔\n\nاور جب تو نے منزلِ اُلفت کے اس فصل کو جان لیا، تو اب ہم اس کے تحقق سے متعلق دوسرے انداز میں بات شروع کرتے ہیں، جو اسے مزید وضاحت کے ساتھ شامل کرتا ہے۔\n\n### [اُلفت ابدال کی منازل میں سے ایک منزل ہے]\n\nجان لو کہ یہ منزل ابدالِ سبعہ (سات ابدال) کے سفر کی منزل ہے، جو باہم جمع اور متألف (اُلفت رکھنے والے) ہیں، باوجود اس قبض کے جو ان میں سے بعض کو بعض سے ہوتا ہے، اور بعض کا بعض پر انکار ہوتا ہے، مگر ان کے درمیان صفائی موجود ہوتی ہے۔ ان کے معرفت (المعرفۃ) کے باب میں دو سفر ہوتے ہیں: ایک سفر ان کا الٰہ کی طرف اس کے مظاہر میں ہوتا ہے، اور دوسرا سفر ان کا ذات کی طرف ہوتا ہے۔\n\nپس الٰہ کی طرف ان کا سفر ان کی ربوبیت کی طرف سے ہوتا ہے، اور ذات کی طرف ان کا سفر ان کی اپنی ذاتوں کی طرف سے ہوتا ہے۔ جب وہ ذات کی طرف سفر کا ارادہ کرتے ہیں تو یمن کا قصد کرتے ہیں، اور جب وہ الٰہ کی طرف سفر کا ارادہ کرتے ہیں تو شام اور شمالی علاقوں کا قصد کرتے ہیں۔ اور وہ جس بھی سمت کا قصد کریں، ان کی استعداد اس مقدار میں برابر ہوتی ہے جس کی انہیں ضرورت ہوتی ہے۔ اگرچہ خوراکیں سمتوں کے تنوع سے متنوع ہوتی ہیں، لیکن ہر سمت کے لیے زادِ راہ میں سے صرف وہی لیا جاتا ہے جو اس سمت کے مسافر کے مزاج کے لیے موزوں ہو، تاکہ سمتوں میں مختلف خواہشات اور ان کا مزاج پر اثر کسی بیماری کی وجہ سے ان کے اور ان کے مقصد کے درمیان رکاوٹ نہ بنے۔\n\nضروری ہے کہ استعداد مختلف ہو، اگرچہ ان کا قیام دونوں سفروں میں کم ہوتا ہے اور وہ اپنے وطن واپس آ جاتے ہیں۔ جب وہ یمن کا قصد کرتے ہیں تو اس میں چوبیس دن سے زیادہ قیام نہیں کرتے، جس میں وہ اپنا مقصد حاصل کرتے ہیں اور اگلے سال واپس آ جاتے ہیں۔ اور جب وہ شمال کا قصد کرتے ہیں تو اس میں صرف چھ دن قیام کرتے ہیں، جس میں وہ اپنا مقصد حاصل کرتے ہیں اور اگلے سال واپس آ جاتے ہیں۔ اور ان کا سفر روحانی ہوتا ہے، جسمانی نہیں۔\n\nجہاں تک ان علوم کا تعلق ہے جو وہ یمن کے سفر میں حاصل کرتے ہیں، تو وہ اصطلام (محویت) کے علوم ہیں، اور پردوں کے پیچھے سے سبحات (جلال کے انوار) کا علم، جو علمِ ذوق ہے۔ اور جہاں تک ان علوم کا تعلق ہے جو وہ شمال کے سفر میں حاصل کرتے ہیں، تو وہ ان چیزوں کے ذریعے یقین میں اضافے کے علوم ہیں جو ان پر متجلی ہوتی ہیں، اور عبودیت، قبض، اور خلوتوں کے نتائج کا علم، جو علمِ ذوق ہے۔\n\nاور ان کا مستقر (قیام گاہ) مکہ ہے، کیونکہ اس کی روحانیت میں تنزل سب سے کامل تنزل ہے، کیونکہ اللہ تعالیٰ نے فرمایا: \"أُمُّ الْقُرَىٰ\" (بستیوں کی ماں)۔ اور فرمایا: \"يُجْبَىٰ إِلَيْهِ ثَمَرَاتُ كُلِّ شَيْءٍ\" (اس کی طرف ہر چیز کے پھل کھینچے چلے آتے ہیں)۔ پس اس نے عمومیت بیان کی۔ اور اس کے بارے میں فرمایا: \"رِزْقًا مِّن لَّدُنَّا\" (ہمارے پاس سے رزق)۔ پس اس نے اسے کسی اور کی طرف منسوب نہیں کیا۔ پس یہ وہبی علوم ہیں جن سے ان کی روحیں زندہ ہوتی ہیں۔ اور یہ بات مکہ کے علاوہ کسی اور کے بارے میں نہیں کہی گئی۔\n\nاور یہ علوم جن کی طرف ہم نے اشارہ کیا ہے، صرف اسی کو حاصل ہوتے ہیں جس کا حال ذلت اور فقر ہو، اور جس کا مقام جلال، قبض، ہیبت اور خوف ہو۔ جب بندے کی صفات وہ ہوں جو ہم نے ذکر کیں، تو اللہ اسے اس کے حال میں عزت اور غنا، اور جمال، بسط، اس سے اُنس، اور دوسروں میں رجاء (امید) عطا کرتا ہے، نہ کہ اپنے نفس میں۔ کیونکہ وہ اپنے رب کے حق میں امان میں ہے، کیونکہ اسے بشارت دی گئی ہے، جیسا کہ فرمایا: \"لَهُمُ الْبُشْرَىٰ فِي الْحَيَاةِ الدُّنْيَا\" (ان کے لیے دنیا کی زندگی میں بشارت ہے)۔ اور ذات حق (الحق) کی بشارت حق ہے، جس میں نسخ داخل نہیں ہوتا، لہٰذا اس کے وجود میں مکر کا خوف نہیں ہوتا، لیکن جب وہ نص ہو۔\n\nاور اس منزل میں ایک عجیب ذوق ہے جو کسی اور میں نہیں ہوتا، اور وہ یہ ہے کہ اگر تو کسی بھی حال میں ہو، تو ذات حق (الحق) تجھے اس حال کا علم عطا کرتا ہے، جس سے تو باہر نہیں نکلتا، جیسے کوئی شخص کسی چیز کے علم سے اس کے مشاہدے کی طرف منتقل ہو جائے، تو اسے صرف ایک ہی چیز میں مزید وضاحت حاصل ہوتی ہے۔ اسی طرح یہ منزل ہے، اور یہ وہ منزل ہے جہاں سے دو ضدوں کے درمیان جمع ہونے کا علم حاصل ہوتا ہے، اور وہ ہے ضد کا وجود عینِ ضد میں۔\n\nاور یہ علم وحدانیت کو جاننے کا سب سے قوی علم ہے، کیونکہ وہ ایک ایسے حال کا مشاہدہ کرتا ہے جسے وہ جہالت میں نہیں ڈال سکتا کہ عینِ ضد ہی بذاتِ خود عینِ ضد ہے۔ پس وہ کثرت میں احدیت کو پاتا ہے، نہ کہ اہل عدد کے طریقے پر، کیونکہ وہ طریقہ وہمی ہے، اور یہ علم مشہود اور محقق ہے۔ اور متقدمین میں سے جو اس مبارک منزل میں نمایاں ہوئے، وہ ابو سعید الخراز ہیں۔ میں ان کے بارے میں سنتا تھا، یہاں تک کہ میں خود اس میں داخل ہوا اور مجھے وہ حاصل ہوا جو حاصل ہوا، تو میں نے جان لیا کہ یہ حق ہے، اور یہ کہ لوگ اس کے انکار میں حق پر ہیں، کیونکہ وہ عقلی طور پر اس کا انکار کرتے ہیں، اور عقل کی قوت میں اس کے نظر کے لحاظ سے اس سے زیادہ کچھ نہیں ہے۔\n\nاور جس نے اپنی وسعت کے مطابق وہ کچھ دیا جو اس جہت کا تقاضا تھا، تو اس نے امر کا حق ادا کر دیا۔ اور یہ وہ ہے جس پر ہمارا قدم جما اور ثابت ہوا ہے۔ پس ہم کسی مدعی کے دعوے پر انکار نہیں کرتے، سوائے اس انکار کے جس کا ہمیں حکم دیا گیا ہے، پس ہم شرعی طور پر اس کا انکار کرتے ہیں۔ اور یہ انکار بھی حقیقت ہے، ہم صرف ایک ایسی ہیئت کا مشاہدہ کرتے ہیں جس میں اور جس پر انکار واجب ہے۔ جیسا کہ ہم نے عقلی طور پر اس کا انکار کیا۔\n\nپس شریعت کے لیے ایک قوت ہے جس سے وہ تجاوز نہیں کرتی جو اس کی حقیقت عطا کرتی ہے، جیسا کہ ہم نے عقل کے ساتھ کیا۔ اور ذوق کے لیے ایک قوت ہے جس کے ساتھ ہم اس سے بھی معاملہ کرتے ہیں، جیسا کہ ہم نے دیگر منسوب قوتوں کے ساتھ ان کی قوت کے مطابق معاملہ کیا۔ پس ہم وقت کے ساتھ ہیں: ہم عقل کے ساتھ اس چیز کا انکار کرتے ہیں جس کا عقل انکار کرتی ہے، کیونکہ ہمارا وقت عقل ہے، اور ہم کشف (الکشف) یا شرع کے ذریعے اس کا انکار نہیں کرتے۔ اور ہم شرع کے ساتھ اس چیز کا انکار کرتے ہیں جس کا شرع انکار کرتا ہے، کیونکہ ہمارا وقت شرع ہے، اور ہم کشف (الکشف) یا عقل کے ذریعے اس کا انکار نہیں کرتے۔ جہاں تک کشف (الکشف) کا تعلق ہے، تو وہ کسی چیز کا انکار نہیں کرتا، بلکہ ہر چیز کو اس کے مرتبے میں مقرر کرتا ہے۔ پس جس کا وقت کشف (الکشف) ہو، اس پر انکار کیا جائے گا، اور وہ کسی پر انکار نہیں کرے گا۔ اور جس کا وقت عقل ہو، وہ انکار کرے گا اور اس پر انکار کیا جائے گا۔ اور جس کا وقت شرع ہو، وہ انکار کرے گا اور اس پر انکار کیا جائے گا۔ پس یہ جان لو۔\n\n### [ہو کی حقیقت یہ ہے کہ وہ کبھی حاصل نہیں ہوتا اور نہ ہی کبھی مشاہدہ کیا جاتا]\n\nاور جان لو کہ اس منزل کے لیے ایک ایسا حال ہے جو کسی اور کے لیے نہیں ہوتا، اور وہ یہ ہے کہ یہ الٰہی اسماء کی ہویت (Identity) کا حصول عطا کرتا ہے۔ اور یہ اس کے خلاف ہے جو \"ہو\" (الهو) کی حقیقت عطا کرتی ہے، کیونکہ \"ہو\" (الهو) کی حقیقت یہ ہے کہ وہ کبھی حاصل نہیں ہوتا اور نہ ہی کبھی مشاہدہ کیا جاتا، سوائے اس مشہد اور منزل کے۔ کیونکہ اس میں ظاہر کا عین ہی بذاتِ خود باطن کا عین ہوتا ہے۔ مگر ذات حق (الحق) کی ہویت اس منزل میں داخل نہیں ہوتی۔ اور ہم نے یہ بات الٰہی اسماء کی ہویت کے بارے میں کہی ہے، ان کی ہویت ہونے کے لحاظ سے، نہ کہ ان کی انانیت (میں ہونے) کے لحاظ سے۔\n\n### [رسولوں سے دلائل اور علامات کا علم حاصل کرنا]\n\nاور جان لو کہ جب تو اس منزل میں داخل ہوتا ہے، تو تو رسولوں کی ایک جماعت (صلوات اللہ علیہم) کے ساتھ جمع ہوتا ہے، اور ان کے خاص ذوق سے ایسے علوم حاصل کرتا ہے جو تیرے پاس نہیں تھے، پس وہ تیرے لیے کشف (الکشف) بن جاتے ہیں، جیسا کہ وہ ان کے لیے ذوق تھے۔ پس تجھے ان سے دلائل اور علامات کا علم حاصل ہوتا ہے۔ جب تجھ پر تجلی ہو گی تو زمین یا آسمان میں کوئی چیز تجھ پر مخفی نہیں رہے گی، مگر تو اسے ممتاز کرے گا اور پہچانے گا، جبکہ دوسرے لوگ جو اس منزل میں داخل نہیں ہوئے، اسے نہیں جانیں گے۔ اور یہ علمِ کشف (الکشف) ہے، کیونکہ تو اس کا مشاہدہ علامت کے ذریعے کرتا ہے، نہ کہ اپنے نفس سے دیکھتا ہے، کیونکہ یہ تیرے لیے ذوق نہیں ہے۔\n\nاور تجھے ان سے علمِ قدم (قدیم ہونے کا علم) بھی حاصل ہوتا ہے، اور یہ ایک عزیز علم ہے، جس کے ذریعے تو ان اسرار اور علوم پر ثابت قدم رہتا ہے جو تجھے ان حضرات سے جدا ہونے کے بعد حاصل ہوتے ہیں جن میں تجھے علم اور اسرار حاصل ہوئے تھے۔ پس بہت سے لوگ ایسے ہیں جو اپنے مشاہدے کو بھول جاتے ہیں۔ لیکن جب اسے یہ علم اس نبی سے حاصل ہوتا ہے، تو وہ اس میں انبیاء کی طرح ثابت قدم رہتا ہے۔\n\nاور تجھے ان سے عالم میں شرائع کا علم بھی حاصل ہوتا ہے، کہ ان کا ماخذ کہاں سے ہے، اور وہ کیسے لی گئیں، اور بعض احکام میں کیوں اختلاف ہوا، اور کن چیزوں میں اتفاق اور اجتماع ہوا۔ یہاں تک کہ اگر اس کشف (الکشف) کے مالک کو تائید حاصل نہ ہوتی، تو وہ نبوت کا دعویٰ کر بیٹھتا۔ لیکن اللہ نے اپنے اولیاء کی تائید کی اور انہیں اس چیز کے دعوے میں غلطی سے محفوظ رکھا جو ان کے لیے نہیں تھی، کیونکہ وہ مخلوق کے سامنے اپنے نفس کے حصوں سے باہر نکل چکے ہوتے ہیں، لیکن وہ ذات حق (الحق) کے سامنے ان کے حصوں سے باہر نہیں نکلتے۔\n\nاور حق کو حق کے لیے طلب کرنا درست نہیں، بلکہ اسے حظ (حصہ/فائدہ) کے لیے طلب کیا جاتا ہے۔ کیونکہ طلب کا فائدہ مطلوب کا حصول ہے۔ اور ذات حق (الحق) کسی کے لیے حاصل نہیں ہوتا، لہٰذا وہ کسی عالم کے لیے مطلوب نہیں ہو سکتا۔ پس صرف حظ ہی باقی رہا۔ اور اسی علم سے عشاق کا علاج کیا جاتا ہے، جب ان میں محبت حد سے بڑھ جاتی ہے۔ اس حضرت سے ان کے لیے راحت کی دوا نکالی جاتی ہے، اس عذاب سے جو عشق قلق، غم اور بے چینی کی صورت میں دیتا ہے۔\n\nاور ان انبیاء کے مشاہدے سے یہ علم بھی حاصل ہوتا ہے کہ ذات حق (الحق) کے نائبین کو اپنے بندوں میں کس چیز کی ضرورت ہوتی ہے، جیسے رحمت، قہر، سختی، اور نرمی۔ اور وہ مخلوق کے ساتھ کیسا معاملہ کرتے ہیں، اور ذات حق (الحق) کے ساتھ کیسا معاملہ کرتے ہیں، اور اپنے نفسوں کے ساتھ کیسا معاملہ کرتے ہیں جب وہ نائبین ہوتے ہیں۔ پس وہ یہ سب کچھ حاصل کرتا ہے، اگرچہ اسے عام نیابت کا درجہ حاصل نہ ہو، لیکن وہ اپنے خاص عالم میں اللہ کا نائب ہوتا ہے، جو اس کا اپنا نفس، اس کے اہل اور اس کی اولاد ہے، اگر وہ اہل اور اولاد والا ہو۔\n\nاور اسے ان سے وہ راز بھی حاصل ہوتا ہے جس کے ذریعے وہ جاہل کو اس کی جہالت کی موت سے زندہ کرتا ہے، اور جس کے ذریعے اللہ مردوں کو زندہ کرتا ہے۔ کیونکہ یہ منزلِ اُلفت کی طرف لوٹتا ہے، اس لیے کہ کسی چیز کے لیے زندگی اُلفت کی وجہ سے ہوتی ہے، اور اس کا اس کی طرف دیکھنا اس کے نام \"الحی\" (زندہ) سے ہوتا ہے، جو کسی تالیف سے نہیں ہے۔\n\nاور اسے خلقِ تام (کامل تخلیق) کا علم بھی حاصل ہوتا ہے، جیسا کہ اللہ کے قول \"مُخَلَّقَةٍ\" (پوری بنائی ہوئی) میں ہے۔ اور اسے اس منزل میں غیرِ مُخَلَّقہ (نامکمل تخلیق) کا علم حاصل نہیں ہوتا، بلکہ وہ کسی دوسری منزل میں حاصل ہوتا ہے۔\n\nاور اس منزل میں ان انبیاء سے علمِ تصوری حاصل ہوتا ہے، جو مفردات کا علم ہے جو مرکب نہیں ہوئے۔ اور اسی منزل سے معانی صورتیں اختیار کرتے ہیں، پس عالم کے مسائل کو اپنے نفس میں صورت دیتے ہیں، پھر انہیں بہترین صورت میں متعلمین کے سامنے پیش کرتے ہیں، اور وہ \"مُخَلَّقَةٍ\" (پوری بنائی ہوئی) ہے۔ اگر وہ غلطی کرے تو وہ اس منزل سے باہر کی وجہ سے ہے۔\n\nاور اسی منزل سے عاشق میں پیدا ہونے والے عشق کا سبب معلوم ہوتا ہے کہ وہ کیا ہے، اور عاشق و معشوق کے درمیان کیا ربط ہے کہ وہ خاص طور پر اس سے لپٹ گیا، نہ کہ کسی اور سے۔ اور کیوں وہ اسے اپنی آنکھ میں اس سے زیادہ خوبصورت دیکھتا ہے جو اس کے علم میں اس سے زیادہ خوبصورت ہے۔ اور کیوں وہ معشوق کے زیرِ تسلط ہوتا ہے، اگرچہ وہ اس کا غلام ہو۔ اور کیوں حکم آقا سے غلام کی طرف منتقل ہو جاتا ہے اگر وہ اس کا معشوق ہو، تو وہ اس کے امر و نہی کے تحت ہوتا ہے، اور اپنے نفس میں اس کی مخالفت کا تصور بھی نہیں کر سکتا جو اس کا غلام اسے حکم دیتا ہے۔ اور کیسے سیادت اس کی طرف منتقل ہو گئی اور بندگی دوسرے آقا کی طرف منتقل ہو گئی، جو اس میں تصرف کے حکم میں ظاہر ہے۔ اور کیوں وہ یہ خیال کرتا ہے کہ وہ اسے اپنے نزدیک اپنے نفس سے زیادہ عظیم دیکھتا ہے، اور یہ کہ اس کی سعادت اس کی بندگی اور اس کے سامنے ذلت میں ہے، حالانکہ وہ طبعاً سرداری کو پسند کرتا ہے۔ اور کیوں اس کی طبیعت پر اثر ہوا، اور اس پر روحوں کی طبیعت پر قوت واضح ہوتی ہے، اور یہ کہ عشق روحانی ہے، پس اس نے اسے روح کی حقیقت کے تقاضے کی طرف لوٹا دیا، کیونکہ روح کے نزدیک اپنے نفس میں کوئی سرداری نہیں ہے اور نہ ہی وہ اس صفت کو قبول کرتی ہے۔\n\nاور یہ بھی معلوم ہوتا ہے کہ کیا عشق طبعی اور روحانی میں تقسیم ہوتا ہے، یا یہ روح کی خصوصیات میں سے ہے، یا حیوان اور نبات میں اس کے وجود کی وجہ سے یہ طبع کی خصوصیات میں سے ہے۔ اور کیوں انسان کا عشق کسی لونڈی یا غلام کے لیے ایسا ہوتا ہے کہ وہ اس میں فنا ہو جاتا ہے اور اس مرتبے پر فائز ہوتا ہے جو ہم نے ذکر کیا، اور وہ اس طرح کا استغراق سونے، چاندی، جائیداد، اور دیگر سامان میں نہیں کرتا جو انسان نہیں ہیں۔ اور یہ ایک شریف علم ہے۔ اور کیوں وہ اس طرح کا استغراق صرف ذات حق (الحق) کی محبت میں کرتا ہے، نہ کہ ان چیزوں میں جن کا ہم نے ذکر کیا۔ اور یہ بھی معلوم ہوتا ہے کہ کیا ذات حق (الحق) سے اس کی محبت جزوی ہے یا کلی؟ اور اس کا مطلب یہ ہے کہ کیا اس نے اس سے اپنی پوری ذات کے لحاظ سے محبت کی، اپنی طبیعت اور روح کے لحاظ سے، یا صرف اپنی روح کے لحاظ سے؟ کیونکہ طبعی محبت اس جناب سے متعلق ہونا مناسب نہیں ہے۔ اور کیا اس جناب کے لیے کوئی ایسا مظہر ہے جس سے طبعی محبت متعلق ہو سکے یا نہیں؟ یہ سب اس منزل کے علم کی خصوصیات میں سے ہے۔\n\nاور اس منزل کے علوم میں سے جو فائدہ حاصل ہوتا ہے، وہ علمِ زمان (وقت) ہے، اور یہ کیوں لوٹتا ہے؟ کیا کسی وجودی امر کی وجہ سے یا کسی عدمی امر کی وجہ سے؟ اور کیا رات اور دن زمان ہیں یا اس بات کی دلیل ہیں کہ وہاں زمان موجود ہے؟ اور کیا رات اور دن کسی زمان میں پیدا ہوئے؟\n\nاور اسی منزل سے ارواح کو نازل کرنے کے لیے بنائے گئے ہیکلوں کی ترتیب، ان کی صورتیں، شکلیں، اور ان کی بناوٹ، اور ان پر کیا نقش کیا جاتا ہے، اور ان سے کیا اثر ہوتا ہے، اور ان کی مدت کتنی ہے، یہ جاننے کے بعد کہ کیا ان کی کوئی مدت ہے یا نہیں، معلوم ہوتا ہے۔ اور حروف اور ستاروں کا علم ان کی خصوصیات، طبائع، اور ان کے اثرات کے لحاظ سے معلوم ہوتا ہے جن پر اللہ نے انہیں پیدا کیا ہے، اور وہ کس پر اثر انداز ہوتے ہیں، اور کس چیز سے ان کے اثر سے پردہ کیا جاتا ہے، اور جب انہیں مقید کیا جائے تو کس چیز سے ان کی قید کو کھولا جاتا ہے، اور جب انہیں آزاد کیا جائے تو کس چیز سے ان کی آزادی کو مقید کیا جاتا ہے۔\n\nاور اسی منزل سے وہ بات معلوم ہوتی ہے جو ہم نے اپنے اس قول سے مراد لی:\n\nذات حق (الحق) مجہول اور معروف کے درمیان ہے،\nپس لوگ متروک اور مألوف (جس سے اُلفت کی جائے) کے درمیان ہیں۔\nاور شان واصف اور موصوف کے درمیان ہے،\nپس حال مقبول اور مصروف (رد کیا گیا) کے درمیان ہے۔\n\nپس یہ ان چیزوں میں سے کچھ ہے جو یہ منزل اپنے اندر رکھتی ہے، اور یہ بہت زیادہ ہے۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "«باب دویست و هفتاد و هشتم در معرفت منزل الفت و اسرار آن از مقام موسوی و محمدی»\n\nبه منزل الفت وارد نمی‌شود، جز موجودی که بر صورت اوست.\nپس او را می‌بینی، هنگامی که به او می‌نگری، در آن (منزل) بر سورت (صورت/سیرت) خود فرود آمده است.\nدر آن حکم می‌کند به آنچه می‌داند، و در آن بر سیرت خود جاری است.\nپس حق (الحق) او را آینه‌ای برای خود برگزید، و به همین دلیل بر سورت (صورت/سیرت) او افزود.\nپس خداوند او را به عنوان نشانه‌هایی نهی کرد، که آن نهی از غیرت اوست.\nهنگامی که آنچه را که مطلقاً برای او بود، منع کرد، از حیرت خود منزه شد.\nاز آنچه نهی شده بود خورد، پس مرتبه خوردن در عورت او آشکار شد.\nپس هنگامی که آن را دید، دانست که آن لغزشی است که از همسایگی (قرب) او به وی رسیده است.\n\n### [الفت میان دو چیز جز به مناسبتی میان آن دو حاصل نمی‌شود]\n\nهیچ دو موجودی با هم الفت نمی‌گیرند مگر به مناسبتی که میان آن‌ها باشد. پس منزل الفت، همان نسبت جامعی است که میان حق (الحق) و خلق وجود دارد، و آن همان صورتی است که انسان بر آن آفریده شده است. به همین دلیل، هیچ‌یک از مخلوقات خداوند جز انسان ادعای الوهیت نکرده است، و در غیر او ادعا شده اما او خود ادعا نکرده است. فرعون گفت: أَنَا رَبُّكُمُ الْأَعْلى‏ (من پروردگار برتر شما هستم).\n\nو در میان خلق، هیچ‌کس جز انسان مالک نیست، و غیر انسان از ملک و غیره چیزی را مالک نیست. خدای تعالی در اثبات ملکیت برای انسان می‌فرماید: أَوْ ما مَلَكَتْ أَيْمانُكُمْ (یا آنچه مالک شده‌اند دست‌های شما). و هیچ موجودی نیست که به عبودیت برای دیگری اقرار کند مگر انسان؛ از این رو گفته می‌شود: این بنده فلان است. و به همین دلیل خداوند برای او عتق (آزادی) را تشریع کرد و به آن ترغیب نمود، و برای بنده آزاد شده، در صورت مرگ بدون وارث، ولاء (حق میراث) قرار داد، همان‌گونه که میراث بندگان از آنِ خداست. خدای تعالی می‌فرماید: إِنَّا نَحْنُ نَرِثُ الْأَرْضَ ومَنْ عَلَيْها (همانا ما خود زمین و هر که بر آن است را به ارث می‌بریم).\n\nو هیچ موجودی نیست که پذیرای نام‌گذاری به تمامی اسماء الهی باشد مگر انسان. و به تخلق به این اسماء ترغیب شده است. به همین دلیل، خلافت و نیابت به او داده شد و تمامی اسماء به او تعلیم داده شد. و او آخرین نشأت در عالم بود که جامع حقایق عالم بود، از آنچه خداوند به ملک و صورت خود اختصاص داده است. و همچنین از نشأت طبیعی او که از طبایع چهارگانه برپا شده است، همراه با نیروی ناطقه که در طبیعت خود، برخلاف سایر مخلوقات طبیعی، به آن اختصاص یافته است؛ مانند صورت الهی که بر چهار اصل استوار است و دلیل عقلی جز آن‌ها را نمی‌دهد، و آن چهار اصل عبارتند از: حیات، علم، قدرت و اراده. پس به واسطه این‌ها، ایجاد عالم برای او صحیح بود و او به واسطه این‌ها اله (معبود) بود؛ زیرا اگر از این نسبت‌ها مجرد می‌شد، اله عالم نبود. و این همان مَثَل مقرر در قرآن است که در قول خدای تعالی: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست) بی‌مانند است. یعنی: چیزی مانند مَثَلِ او نیست. پس با اثبات مثلیت برای او به واسطه انسان، خداوند را تنزیه می‌کند؛ یعنی اگر مَثَلِ فرض شده بی‌مانند باشد، پس خدای تعالی از مماثلت دورتر و منزه‌تر است. و در سنت آمده است: «خلق آدم على صورته» (آدم بر صورت او آفریده شد). و با این آیه، مماثلت این مَثَل نفی شده است. و برای او غیب و شهود (الشهود) قرار داده شد. و چون انسان در این مرتبه بود، الفت میان او و پروردگارش برقرار شد، پس او را دوست داشت و (خداوند نیز) او را دوست داشت. و به همین دلیل\n\nوارد شده است که آسمان و زمین (یعنی علو و سفل) او را در بر نگرفتند، اما قلب مؤمن پرهیزکار و باتقوا او را در بر گرفت.\n\nو این از صفات انسان است نه از صفات مَلَک (فرشته). اگرچه انسان در هر آنچه ذکر کردیم با دیگران شریک است، اما انسان به واسطه مجموع (حقایق) و به واسطه صورت، از همه متمایز شده است. پس این را بدان.\n\nبنابراین، عبودیت محض که هیچ شائبه ربوبیت در آن نباشد، جز برای انسان کامل (الإنسان الکامل) به تنهایی صحیح نیست. و ربوبیت محض که هیچ شائبه عبودیت در آن نباشد، جز برای خدای تعالی صحیح نیست. پس انسان در صورت حق (الحق) از تنزیه و تقدیس از شائبه در حقیقت خود برخوردار است. او مألوه مطلق (معبود مطلق) است و حق سبحانه (الحق) اله مطلق است. و منظور من از این همه، انسان کامل (الإنسان الکامل) است. و انسان کامل (الإنسان الکامل) از غیر کامل جدا نمی‌شود مگر به یک نکته ظریف، و آن این است که عبودیت او هیچ شائبه ربوبیت نداشته باشد.\n\nو چون انسان کامل (الإنسان الکامل) این منصب عالی را داشت، او به تنهایی عین مقصود از عالم بود. و این کمال در آدم (علیه السلام) در قول خدای تعالی: وعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها (و تمامی اسماء را به آدم آموخت) آشکار شد. پس آن را با لفظ «کل» تأکید کرد که لفظی است مقتضی احاطه. پس حق (الحق) به این امر برای او شهادت داد. همان‌گونه که این کمال در محمد (صلی الله علیه وسلم) نیز آشکار شد\n\nبه قول او: «فعلمت علم الأولين والآخرين» (پس علم اولین و آخرین را دانستم).\n\nپس علم آدم در علم او داخل شد، زیرا او از اولین است. و ذکر «آخرین» جز برای رفع احتمالی که نزد شنونده واقع می‌شود، نیامده است، اگر آنچه را که ما به آن اشاره کردیم نداند. و او (صلی الله علیه وسلم) به شهادت خود برای خویش، جوامع الکلم (جامعیت کلمات) به او عطا شده بود.\n\nو اصحاب ما اختلاف کرده‌اند که کدام یک از دو مقام بالاتر است: آنکه حق (الحق) برای او شهادت دهد، یا آنکه خود به حق (الحق) برای خویش شهادت دهد، مانند یحیی و عیسی (علیهما السلام). اما مذهب ما در این باره این است که شاهدی که برای خود شهادت می‌دهد و در شهادتش صادق است، کامل‌تر، والاتر و سزاوارتر است؛ زیرا او برای خود شهادت نداده مگر از ذوق محقق به کمال خود در آنچه برای خویش شهادت داده است، و آن شهادت از احتمال در حال مرتفع است. پس او بر کسی که برایش شهادت داده شده، به واسطه رفع احتمال و ذوق محقق، برتری یافته است. پس این مقام بالاتر است.\n\nو شأن منصف ادیب و عالم به طریق خدا این نیست که در تفاضل مردان سخن بگوید، اگرچه آن را بداند، زیرا ادب او را باز می‌دارد. به همین دلیل گفتیم: ادیب تنها در تفاضل مقامات سخن می‌گوید، تا از عهده این امر خارج شود و حال برای او از مطالبه در آن سالم بماند، زیرا مقامات مطالبه‌ای ندارند و مطالبه برای موصوفین به آن‌هاست. پس حال ادیب همان است که ذکر کردیم.\n\nو تمامی آنچه ذکر کردیم را کسی مشاهده می‌کند که در این منزل قرار گرفته باشد. و از حروف، الفت لام با الف برای او حاصل است. و آن اولین حرف مرکب از حروف است که شکل آن را واحد کرده است، به طوری که الف از لام شناخته نمی‌شود. پس حق (الحق) با مفردات است، و گویی آن دو یک حرف هستند، زیرا جدایی آن‌ها دشوار است و شکل لام در آن از شکل الف متمایز نمی‌شود، پس چشم آن را درک نمی‌کند.\n\nاگر گفته شود که گوش آن را با گفتن «لا» درک می‌کند، باید دانست که لام احتمال حرکت دارد و الف احتمال حرکت ندارد. پس تلفظ الف ممکن نیست، بلکه لام با اشباع حرکت تلفظ می‌شود تا الف ظاهر شود، تا دانسته شود که منظور او لام الف است نه لام غیر آن از حروف، تا کاتب آن را بر صورت خاص خود رقم زند. پس الف از لام متمایز نمی‌شود به دلیل تمکن الفت.\n\nهمچنین انسان، هنگامی که حق (الحق) گوش و چشم او باشد، چنانکه در خبر آمده است، با حق (الحق) مرتبط می‌شود، مانند ارتباط لام با الف. و به همین دلیل در حروف شهادت توحید در لفظ «لا إله إلا الله» (هیچ معبودی جز الله نیست) مقدم شده است. پس با حرف الفت، الوهیت هر معبودی را که جاهل مشرک برای غیر خدا اثبات کرده است، نفی نمود. پس آن را با حرفی نفی کرد که متضمن عبد و رب است، زیرا متضمن مدلول لام و الف است، چنانکه\n\nپیامبر (علیه السلام) فرمود: «آمنت بهذا أنا وأبو بكر وعمر» (من و ابوبکر و عمر به این ایمان آوردیم).\n\nپس آن دو را با خود در ایمان شریک کرد، در حالی که حاضر نبودند یا اگر حاضر بودند، از جانب آن دو نیابت کرد. پس هنگامی که حق (الحق) برای خود به توحید شهادت داد، از جانب خود و از جانب بنده خود به آن شهادت داد. پس حرف لام الف را آورد. و به همین دلیل «لام الف» نامیده شد و «لام الألف» با تعریف گفته نشد. پس به نام دو حرف نامیده شد تا شنونده اگر آن را معرفه آورد، خیال نکند که منظور او اضافه است، در حالی که منظور او این حرف معین است. پس مانند «رام‌هرمز» و «بعلبک» جاری شد و مانند «عبد الله» و «عبد الرحمن» جاری نشد.\n\nو به همین دلیل در موضع اعراب «بعلبک» و «رام‌هرمز» و «بلال‌آباد» اختلاف شده است، اما در موضع اعراب «عبد الله» و «عبد الرحمن» اختلافی نیست، زیرا مقصود از نام‌گذاری به این‌ها، اضافه است و چاره‌ای از آن نیست. پس هر کس این اسماء را مانند اسم مضاف جاری کند، محل اعراب را آخر اسم اول قرار می‌دهد، و هر کس آن را مانند «زید» جاری کند، محل اعراب را آخر اسم دوم قرار می‌دهد.\n\nهمچنین اختلاف در حرف لام الف، هنگامی که در خط واقع می‌شود، در تعیین اینکه کدام فخذ (شاخه) از این حرف، لام است و کدام فخذ، الف است، واقع شده است. و مراعات مردم در این باره مختلف است. پس کسی که خط را بر لفظ قیاس کند، لام نزد او آن است که کاتب با آن شروع می‌کند، خواه فخذ مقدم در ترتیب باشد یا متأخر. و کسی که آن را بر نطق حمل نکند، بر خلاف باقی می‌ماند و برای او اختیار قرار می‌دهد که هر کدام از دو فخذ را که خواست، لام قرار دهد و هر کدام را که خواست، الف، زیرا هر یک از آن دو به دلیل التفافی که لام را از حقیقت خود خارج کرده است، بر صورت دیگری است.\n\nهمچنین انسان کامل (الإنسان الکامل) و حق (الحق) در صورتی که به منزله التفاف تنزل یافته است. اگر فعل را به قدرت بنده نسبت دهی، در اخبار الهی وجهی دارد، و اگر فعل را به خدا نسبت دهی، در اخبار الهی وجهی دارد.\n\nاما ادله عقلیه نزد عقلا متعارض شده‌اند، اگرچه در نفس الامر متعارض نیستند، اما تمییز دلیل از شبهه بر عقلا دشوار و محال شده است. و همچنین در اخبار الهی دشوار است. و همچنین در حقیقت بنده دشوار است، زیرا امر به او تعلق می‌گیرد. پس امر نمی‌شود مگر کسی که قدرت بر انجام آنچه به آن امر شده دارد و امکان ترک آنچه از آن نهی شده دارد. پس نفی فعل از مکلف که بنده است، دشوار است، زیرا حکمت خطاب در آن مرتفع می‌شود. و اخبار دیگر و وجه عقلی دیگر این را می‌رساند که فعلی که به بنده نسبت داده می‌شود، تنها از آن خداست. پس خبر و عقل با هم تعارض کرده‌اند. و این موضع حیرت و سبب وقوع اختلاف در این مسئله میان عقلا در نظرشان در ادله‌شان و میان اهل اخبار در ادله‌شان است. و این را جز اهل کشف (الکشف) خاص از اهل الله نمی‌دانند.\n\nو بودن انسان بر صورت، وجود فعل را برای او می‌طلبد و تکلیف آن را تأیید می‌کند و حس به آن شهادت می‌دهد. پس در دلالت قوی‌تر است. و بازگشت همه این‌ها به خدا به حکم اصل، در آن خللی وارد نمی‌کند، زیرا منافی این تقریر نیست. و به همین دلیل، حجت قائلین به کسب ضعیف شده است، نه از این جهت که قائل به کسب شده‌اند، زیرا اینان نیز به آن قائلند، چون خبری شرعی و امری عقلی است که انسان از خود می‌داند، بلکه حجتشان در نفی اثر از قدرت حادثه ضعیف می‌شود. و پس از آنکه این فصل از منزل الفت را دانستی، به آنچه به تحقیق آن در غیر این سبک باز می‌گردد و آن را به جهت آشکار ساختن در بر می‌گیرد، بپردازیم.\n\n### [اینکه الفت منزلی از منازل ابدال است]\n\nپس بدان که این منزل، منزل سفر ابدال (الأبدال) هفت‌گانه است که با هم جمع و مألوف شده‌اند، با وجود قبض (گرفتگی) که بر آن‌هاست، برخی نسبت به برخی دیگر، و انکار برخی بر برخی دیگر، همراه با وجود صفا در میان آن‌ها.\n\nو آن‌ها دو سفر در باب معرفت (المعرفة) دارند: سفری از آن‌ها به سوی اله در مظاهرش، و سفر دیگری از آن‌ها نیز به سوی ذات. پس سفرشان به سوی اله از ربوبیت آن‌هاست و سفرشان به سوی ذات از ذوات آن‌هاست.\n\nپس هرگاه اراده سفر به سوی ذات کنند، قصد یمن می‌کنند، و هرگاه اراده سفر به سوی اله کنند، قصد شام و بلاد شمال می‌کنند. و هر جهتی را که قصد کنند، استعدادشان در حدی که نیاز دارند، یکسان است. و اگرچه متنوع باشد، زیرا اغذیه با تنوع جهات متنوع می‌شوند. پس از توشه به هر جهتی برده نمی‌شود مگر آنچه مزاج مسافر به آن جهت را اصلاح کند، تا مبادا بیماری ناشی از هواهای مختلف در جهات و تأثیر آن در مزاج، میان او و مقصودش حائل شود. پس ناگزیر است که استعداد متفاوت باشد.\n\nبا این حال، اقامت آن‌ها در دو سفر کم است و به موطن‌های خود باز می‌گردند. پس هرگاه قصد یمن کنند، بیش از بیست و چهار روز در آن اقامت نمی‌کنند و در آن مراد خود را حاصل می‌کنند و به سال دیگر باز می‌گردند. و هرگاه قصد شمال کنند، بیش از شش روز در آن اقامت نمی‌کنند و در آن مراد خود را حاصل می‌کنند و به سال دیگر باز می‌گردند. و سفر آن‌ها روحانی است نه جسمانی.\n\nاما علومی که در سفر خود به یمن کسب می‌کنند، علوم اصطلام (غرق شدن) و علم سبحات (انوار جلال) از ورای حجاب‌هاست؛ علم ذوقی. و اما علومی که در سفر خود به شمال کسب می‌کنند، علوم افزایش یقین به واسطه آنچه بر آن‌ها تجلی (التجلی) می‌کند، و علم عبودیت و قبض و آنچه خلوت‌ها نتیجه می‌دهند؛ علم ذوقی.\n\nو موطن آن‌ها که در آن مستقر می‌شوند، مکه است؛ زیرا تنزل در روحانیت آن، کامل‌ترین تنزل است، چون همان‌گونه که خدای تعالی فرمود: أُمَّ الْقُرى‏ (مادر شهرها) و فرمود: يُجْبى‏ إِلَيْهِ ثَمَراتُ كُلِّ شَيْ‏ءٍ (ثمرات هر چیزی به سوی آن گرد آورده می‌شود) و عمومیت داد. و در آن فرمود: رِزْقاً مِنْ لَدُنَّا (رزقی از جانب ما). پس آن را به غیر خود اضافه نکرد. پس این‌ها علوم وهبی هستند که ارواح آن‌ها با آن‌ها زنده می‌شوند. و این را در غیر مکه نفرموده است.\n\nو این علومی که به آن‌ها اشاره کردیم، جز برای کسی که حالش ذلت و افتقار و مقامش جلال و قبض و هیبت و خوف باشد، حاصل نمی‌شود. پس هرگاه اوصاف بنده این باشد که ذکر کردیم، خداوند در حالش به او عزت و غنا، و جمال و بسط و انس به خود و رجاء (امید) در غیر خود (نه در نفس خود) عطا می‌کند. زیرا او در حق نفس خود از پروردگارش در امان است، چون بشارت داده شده است، چنانکه فرمود: لَهُمُ الْبُشْرى‏ فِي الْحَياةِ الدُّنْيا (برای آن‌ها در زندگی دنیا بشارت است). و بشارت حق (الحق) حق است و نسخ در آن راه ندارد، پس به وجود مکر (مکر الهی) ایمان می‌آورد، اما اگر نص باشد.\n\nو در این منزل، ذوق عجیبی است که در غیر آن نیست، و آن این است که اگر در حالی از احوال باشی، حق (الحق) در آن حال، علمی از آن حال به تو می‌بخشد که از آن خارج نمی‌شوی؛ مانند کسی که از علم به چیزی به معاینه آن چیز منتقل می‌شود، و جز وضوح بیشتر در یک عین برای او حاصل نمی‌شود. همچنین این منزل.\n\nو این منزلی است که از آن، جمع میان دو ضد دانسته می‌شود، و آن وجود ضد در عین ضد خود است. و این علم، قوی‌ترین علمی است که با آن وحدانیت دانسته می‌شود، زیرا حالی را مشاهده می‌کند که ممکن نیست آن را نادیده بگیرد، که عین ضد، خود عین ضد اوست. پس احدیت را در کثرت درک می‌کند، نه بر روش اصحاب عدد، زیرا آن روشی متوهم است، و این علمی مشهود و محقق است.\n\nو از کسانی که در این منزل مبارک برجسته شدند، ابوسعید خراز از متقدمین است. و من این را از او می‌شنیدم تا اینکه خودم وارد آن شدم و آنچه برایم حاصل شد، حاصل شد. پس دانستم که آن حق (الحق) است و مردم در انکارشان بر حق‌اند، زیرا آن را عقلاً انکار می‌کنند، و در توان عقل از حیث نظرش بیش از این نیست. و کسی که آنچه در توانش است را از حیث مقتضای آن جهت عطا کند، حق امر را ادا کرده است.\n\nو این همان چیزی است که قدم ما بر آن استوار و ثابت شده است. پس ما بر مدعی آنچه ادعا می‌کند، انکار نمی‌کنیم، مگر انکاری که به آن امر شده‌ایم، پس آن را شرعاً انکار می‌کنیم. و این انکار نیز حقیقتی است؛ ما جز هیئتی را که انکار در آن و با آن واجب است، مشاهده نمی‌کنیم. همان‌گونه که آن را عقلاً انکار کردیم.\n\nو برای شرع نیرویی است که از آنچه حقیقتش اقتضا می‌کند، تجاوز نمی‌کند، همان‌گونه که در عقل انجام دادیم. و برای ذوق نیز نیرویی است که با آن با آن رفتار می‌کنیم، همان‌گونه که با سایر آنچه قوا به آن نسبت داده شده‌اند، بر حسب نیروی آن رفتار کردیم. پس ما با وقت هستیم. پس با عقل، آنچه را که عقل انکار می‌کند، انکار می‌کنیم، زیرا وقت ما عقل است، و آن را کشفاً (الکشف) و شرعاً انکار نمی‌کنیم. و با شرع، آنچه را که شرع انکار می‌کند، انکار می‌کنیم، زیرا وقت ما شرع است، و آن را کشفاً (الکشف) و عقلاً انکار نمی‌کنیم.\n\nاما کشف (الکشف) چیزی را انکار نمی‌کند، بلکه هر چیزی را در مرتبه خود مقرر می‌دارد. پس کسی که وقتش کشف (الکشف) باشد، بر او انکار می‌شود و او بر کسی انکار نمی‌کند. و کسی که وقتش عقل باشد، انکار می‌کند و بر او انکار می‌شود. و کسی که وقتش شرع باشد، انکار می‌کند و بر او انکار می‌شود. پس این را بدان.\n\n### [اینکه «هو» از حقیقتش این است که هرگز حاصل نمی‌شود و مشاهده نمی‌گردد]\n\nو بدان که این منزل، حالی دارد که برای غیر آن نیست، و آن این است که تحصیل هویت اسماء الهی را عطا می‌کند. و این خلاف چیزی است که حقیقت «هو» اقتضا می‌کند؛ زیرا «هو» از حقیقتش این است که هرگز حاصل نمی‌شود و مشاهده نمی‌گردد، مگر در این مشهد و منزل. زیرا عین ظاهر در آن، خود عین باطن است. جز اینکه هویت حق (الحق) وارد این منزل نمی‌شود، و ما این را در هویت اسماء الهی گفتیم، از جهت هویت آن‌ها نه از جهت انانیت آن‌ها.\n\n### [تحصیل علم ادله و علامات از پیامبران (صلی الله علیهم)]\n\nو بدان که هرگاه وارد این منزل شوی، در آن با گروهی از پیامبران (صلوات الله علیهم) ملاقات می‌کنی و از ذوق خاص آن‌ها علومی را کسب می‌کنی که نزد تو نبوده است. پس آن علوم برای تو کشف (الکشف) می‌شود، همان‌گونه که برای آن‌ها ذوق بود. پس از آن‌ها علم ادله و علامات برای تو حاصل می‌شود. پس هیچ چیزی در زمین و آسمان بر تو پوشیده نمی‌ماند، هرگاه بر تو تجلی (التجلی) کند، مگر اینکه آن را تمییز دهی و بشناسی، در حالی که دیگران که در این منزل قرار نگرفته‌اند، آن را نمی‌شناسند. و این علم کشف (الکشف) است، زیرا آن را با علامت مشاهده می‌کنی، نه اینکه آن را از خود ببینی، چون ذوق تو نیست.\n\nو از آن‌ها علم قدم برای تو حاصل می‌شود، و آن علمی عزیز است که به واسطه آن، ثبات تو بر اسرار و علومی که پس از جدایی از حضراتی که در آن‌ها علم و اسرار برایت حاصل می‌شود، به دست می‌آید. زیرا بسیاری از مردم آنچه را مشاهده کرده‌اند، فراموش می‌کنند. پس هرگاه این علم از این پیامبر برای او حاصل شود، ثبات انبیاء در آن برایش ثابت می‌شود.\n\nو از آن‌ها همچنین علم شرایع در عالم برای تو حاصل می‌شود، و اینکه مأخذ آن‌ها از کجاست و چگونه گرفته شده‌اند و چرا در برخی احکام اختلاف کرده‌اند و در چه چیزهایی اتفاق و اجتماع کرده‌اند. تا جایی که اگر صاحب این کشف (الکشف) مؤید در کشفش نبود، ادعای نبوت می‌کرد. اما خداوند اولیای خود را تأیید کرده و آن‌ها را از غلط در ادعای آنچه برایشان نیست، معصوم داشته است، به دلیل خروجشان از حظوظ نفسانی نزد خلق. اما آن‌ها از حظوظ نفسانی نزد حق (الحق) خارج نمی‌شوند.\n\nو صحیح نیست که حق (الحق) برای حق (الحق) طلب شود، بلکه برای حظ (بهره) طلب می‌شود. زیرا فایده طلب، تحصیل مطلوب است، و حق (الحق) برای هیچ‌کس حاصل نمی‌شود. پس صحیح نیست که مطلوب عالم باشد. پس جز حظ باقی نمی‌ماند.\n\nو از این علم، عاشقان درمان می‌شوند، هنگامی که محبت در آن‌ها افراط کند. از این حضرت، داروی راحتی برای آن‌ها استخراج می‌شود، از عذابی که عشق از بی‌قراری، اندوه و پریشانی به آن‌ها می‌دهد.\n\nو از مشاهده این پیامبران، همچنین علم آنچه نائبان حق (الحق) در میان بندگانش به آن نیاز دارند، از رحمت و قهر و شدت و نرمی، و آنچه با خلق رفتار می‌کنند، و آنچه با حق (الحق) رفتار می‌کنند، و آنچه با خودشان رفتار می‌کنند، هنگامی که نایب باشند، حاصل می‌شود. و این همه را کسب می‌کند، اگرچه درجه نیابت در عامه برای او حاصل نشود، اما او نایب خدا در عالم خاص خود است که همان نفس او، خانواده و فرزندان اوست، اگر صاحب خانواده و فرزند باشد.\n\nو از آن‌ها سری برای او حاصل می‌شود که به واسطه آن، جاهل را از مرگ جهلش زنده می‌کند، و آنچه خداوند مردگان را با آن زنده می‌کند، زیرا آن به منزل الفت باز می‌گردد، چون حیات برای شیء تنها به دلیل الفت گرفتن آن با آن و نظر کردن آن به آن از اسم «الحی» (زنده) است که از تألیف نیست.\n\nو همچنین علم خلق تام در قول: مُخَلَّقَةٍ (آفریده شده) حاصل می‌شود. و در این منزل، علم غیر مخلقه برای او حاصل نمی‌شود، بلکه آن برای کسی حاصل می‌شود که از منزل دیگری حاصل شده باشد.\n\nو در این منزل، از این پیامبران، علم تصوری دانسته می‌شود، و آن علم به مفرداتی است که ترکیب نشده‌اند. و از این منزل، معانی، صورت می‌پوشند. پس مسائل عالم را در نفس خود صورت می‌دهد، سپس آن‌ها را به زیباترین صورت (که همان مخلقه است) برای متعلمین آشکار می‌سازد. و اگر خطا کند، از غیر این منزل است.\n\nو از این منزل، سبب عشقی که در عاشق حاصل می‌شود، دانسته می‌شود که چیست، و رابطه میان عاشق و معشوق چیست که به واسطه آن، به طور اختصاصی به او ملتف شده است و نه به غیر او. و چرا او را در چشم خود زیباتر از کسی می‌بیند که در علم او زیباتر است. و چرا تحت سلطه معشوق است، اگرچه بنده او باشد. و چرا حکم بر سید به بنده منتقل می‌شود، اگر معشوق او باشد، به طوری که تحت امر و نهی او قرار می‌گیرد و در نفس خود نمی‌تواند تصور مخالفت با آنچه بنده به او امر می‌کند، داشته باشد. و چگونه سیادت به او منتقل شده و عبودیت به دیگری (سید) منتقل شده است، در حالی که حکم تصرف در او آشکار است.\n\nو چرا خیال می‌کند که او را نزد خود بزرگ‌تر از نفس خود می‌بیند و سعادتش در عبودیت و ذلتش در برابر اوست، با اینکه طبعاً ریاست را دوست دارد. و چرا در طبع او تأثیر گذاشته است. و نیروی ارواح بر طبع برای او آشکار می‌شود، و اینکه عشق روحانی است. پس آن را به آنچه حقیقت روح اقتضا می‌کند، باز می‌گرداند؛ زیرا روح در نفس خود ریاست ندارد و وصف به آن را نمی‌پذیرد.\n\nو دانسته می‌شود که آیا عشق به طبع و روح تقسیم می‌شود، یا از ویژگی‌های روح است، یا از ویژگی‌های طبع است، به دلیل وجود آن در حیوان و نبات.\n\nو دانسته می‌شود که چرا عشق انسان به کنیز یا غلامی به حدی است که در او فانی می‌شود و به این مرتبه‌ای که ذکر کردیم می‌رسد، اما این استغراق در محبت کسی که انسان نیست، مانند طلا و نقره و ملک و کالا و غیره، حاصل نمی‌شود. و این علمی شریف است.\n\nو چرا چنین استغراقی تنها در محبت حق (الحق) حاصل می‌شود و نه در آنچه ذکر کردیم. و دانسته می‌شود که آیا محبت او به حق (الحق) جزئی است یا کلی. و معنای آن این است که آیا او را با تمام وجودش از حیث طبع و روحش دوست داشته است یا فقط از حیث روحش؟ زیرا حب طبیعی شایسته نیست که از محب به آن جناب تعلق گیرد. و آیا برای آن جناب مظهری وجود دارد که حب طبیعی بتواند به آن تعلق گیرد یا خیر؟ همه این‌ها از ویژگی‌های علم این منزل است.\n\nو از علومی که از این منزل کسب می‌شود، علم زمان است. و چرا باز می‌گردد؟ آیا به دلیل امری وجودی است یا امری عدمی؟ و آیا شب و روز زمان هستند یا دلیلی بر وجود زمان؟ و آیا شب و روز در زمان حادث شده‌اند؟\n\nو از این منزل، ترتیب هیاکل (ساختارهای) وضع شده برای فرود آوردن ارواح، و صورت‌ها و شکل‌ها و بنای آن‌ها، و آنچه بر آن‌ها نقش می‌شود، و آنچه از آن‌ها منفعل می‌شود، و مدت آن‌ها پس از دانستن اینکه آیا مدتی دارند یا خیر، دانسته می‌شود.\n\nو علم حروف و نجوم از حیث ویژگی‌ها، طبایع و تأثیراتشان که خداوند آن‌ها را بر آن سرشته است، و اینکه در چه کسی تأثیر می‌گذارند، و با چه چیزی از تأثیرشان محجوب می‌شوند، و اگر مقید شوند، با چه چیزی از قیدشان آزاد می‌شوند، و اگر آزاد شوند، با چه چیزی از آزادی‌شان مقید می‌شوند، دانسته می‌شود.\n\nو از این منزل، آنچه را که با قول خود اراده کردیم، دانسته می‌شود:\n\nحق (الحق) میان مجهول و معروف است، پس مردم میان متروک و مألوف (انس گرفته) هستند.\nو شأن میان وصف‌کننده و وصف‌شده است، پس حال میان مقبول و مصروف (رد شده) است.\n\nپس این بخشی از آن چیزی است که این منزل در بر می‌گیرد و بسیار است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}