{
  "id": 553,
  "title": {
    "ar": "الباب الثالث والخمسون وخمسمائة في معرفة حال قطب كان منزله والله من وَرائِهِمْ مُحِيطٌ",
    "en": "Chapter Five Hundred and Fifty-Three: Concerning the Gnosis (معرفة) of the State of a Pole (قطب) Whose Station Was: \"And Allah encompasses them from behind\" (<<وَاللهُ مِنْ وَرَائِهِمْ مُحِيطٌ>>)",
    "ur": "پانچ سو ترپنواں باب: ایک قطب (قطب) کے حال کی معرفت (معرفت) کے بیان میں، جس کا مقام یہ تھا: \"اور اللہ انہیں ہر طرف سے گھیرے ہوئے ہے\" (وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ)۔",
    "fa": "باب پانصد و پنجاه و سوم در معرفت حال قطبی (قطب) که منزل او این بود: وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ (و خداوند از ورای ایشان احاطه‌کننده است)."
  },
  "content": {
    "ar": "## «الباب الثالث والخمسون وخمسمائة في معرفة حال قطب كان منزله والله من وَرائِهِمْ مُحِيطٌ»\n\n\n> إن الإحاطة للرحمن تحديد *** مع الوراء ويقضي فيه تجريد\n\n\n> فمن تجرد عن أكتاف نشأته *** لم يقض في عقله لله تحديد\n\n\n> الله أنزه أن يقضى عليه بما *** يرده لجلال الله تحميد\n\n\n> كماله من وجوه الكون أجمعه *** تسبيح حمد وتهليل وتمجيد\n\n\n### [إن الحق عين الوجود]\n\n\nقال الله تعالى وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ لما كان الحق عين الوجود لذلك اتصف بالإحاطة بالعالم وإنما جعل الله الإحاطة بالوراء للحفظ الإلهي وذلك لما جعل له عينين وجعلهما في وجهه الذي هو الإمام منه والجنبات وكل ذلك كان الواقع المسمى عادة ولم يكن للوراء سبب يقع به الحفظ لهذا المذكور فحفظه الله بذاته ولم يجعل له سببا يحفظه به سواه فحصلت نشأة الإنسان بين إمامه وإمام الحق فما قابلة كان شهادة وما كان وراءه كان غيبا له فهو من أمامه محفوظ بنفسه ومن خلفه محفوظ بربه وليس وراء الله مرمى ولو لم يكن الحق من ورائهم محيطا لاخذ الإنسان من ورائه فآمن مما يحذره واعتمد على حفظه بما شاهده من إمامه فحصل له الأمان من إمامه غيبا وشهادة وحصل له الأمان من ورائه إيمانا فإن أخذه الله من أي ناحية أخذه من مأمنه وكَذلِكَ أَخْذُ رَبِّكَ إِذا أَخَذَ الْقُرى‏ وهِيَ ظالِمَةٌ أخذها من ورائها وأما الإحاطة العامة فهي الأخذ الكلي وهو قوله والله مُحِيطٌ بِالْكافِرِينَ من غير تقييد بجهة خاصة لكن هو أخذ بتقييد صفة وهو الكفر وليس سوى الستر فأشبه الوراء لأنه لا يدركه الإنسان فما رأينا أخذ الإحاطة يكون عن شهود أينما ورد فإذا أخذ الله من أخذ من أوليائه لا يأخذه إلا من ورائه لئلا يفجأه فهو يأخذه برفق حتى لا يشعر فإذا أخذ بذلك أنس لما يجد فيه من اللذة لأنه لا عن مشاهدة تفنيه ولذلك أضرب بأداة بل عن الأول فقال بَلْ هُوَ قُرْآنٌ مَجِيدٌ أي جمع شريف يعني ما هو عليه من الأسماء والنعوت في لَوْحٍ مَحْفُوظٍ وهو أنت إشارة واعتبار أو أنت لست منك في جهة وإن كانت الجهات فيك وما ثم سواك فانتفى الوراء لهذا الإضراب ولم ينتف بوجه فإنه عينك وما بقي في الوجود سوى عين واحدة وهو أنت فتنبه لما أومأنا إليه في هذا الإضراب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 553: Concerning the Knowledge of the State of a Pole Whose Station Was: \"And Allah is encompassing them from behind\"\n\nIndeed, the encompassing (الإحاطة) attributed to the All-Merciful (الرحمن) is a limitation when coupled with 'behind' (الوراء), and this state necessitates abstraction (تجريد).\n\nSo whoever is abstracted from the supports of his origination (نشأته) does not decree in his intellect any limitation (تحديد) for God.\n\nAllah is too exalted to be decreed upon by anything that would diminish the praise (تحميد) due to the Majesty (جلال) of Allah.\n\nHis perfection, from all aspects of the entire cosmos (الكون), is glorification (تسبيح), praise (حمد), affirmation of oneness (تهليل), and magnification (تمجيد).\n\n### [Indeed, The Real is the very Essence of Existence]\n\nAllah Almighty said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing except that it glorifies Him with praise). Since The Real (الحق) is the very Essence of Existence (الوجود), He is therefore characterized by encompassing (الإحاطة) the cosmos (العالم). Allah only designated the encompassing to be 'from behind' (بالوراء) for the sake of Divine Preservation (الحفظ الإلهي). This is because He created for man two eyes and placed them in his face, which is his front (الإمام) and his sides. All of this was the conventionally named reality. There was no cause for the 'behind' (الوراء) by which preservation could occur for this mentioned being. Thus, Allah preserved him by His Essence (بذاته) and did not appoint for him any cause other than Himself by which to preserve him.\n\nThe origination (نشأة) of man thus occurred between his front and the front of The Real (إمام الحق). What faced him was the witnessed realm (شهادة), and what was behind him was the Unseen (غيبا) for him. Therefore, he is preserved from his front by himself, and preserved from his back by his Lord. There is no aim beyond Allah. Had The Real (الحق) not been encompassing them from behind, man would have taken from his back, thus feeling safe from what he feared and relying on his preservation through what he witnessed from his front. Security was achieved for him from his front, both as Unseen and as witnessed, and security was achieved for him from his behind through faith (إيمانا). If Allah takes him from any direction, He takes him from his place of security. <<وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ>> (And thus is the grasp of your Lord when He grasps the towns while they are doing wrong). He grasps them from behind.\n\nAs for the general encompassing (الإحاطة العامة), it is the total grasp (الأخذ الكلي), which is His saying: <<وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ>> (And Allah is encompassing the disbelievers), without restriction to a specific direction. However, it is a grasp restricted by an attribute, which is disbelief (الكفر), and this is nothing but veiling (الستر). So it resembles the 'behind' (الوراء) because man does not perceive it. We have never seen the grasp of encompassing occur through witnessing (شهود) wherever it is mentioned.\n\nSo when Allah takes one of His friends (أوليائه), He only takes him from behind so that He does not startle him. He takes him gently so that he does not perceive it. When he is taken in this manner, he feels intimacy due to the delight he finds in it, because it is not through a witnessing (مشاهدة) that annihilates him (تفنيه). For that reason, He struck away the first [concept] with the particle 'but' (بل), saying: <<بَلْ هُوَ قُرْآنٌ مَجِيدٌ>> (But it is a glorious Qur'an). Meaning, a noble collection—that is, what it contains of the Names (الأسماء) and Attributes (النعوت)—in a Preserved Tablet (لَوْحٍ مَحْفُوظٍ), which is you, by way of indication and consideration. Or, you are not from yourself in a direction, even though the directions are within you. And there is nothing there but you, so the 'behind' (الوراء) was negated by this striking away, yet it was not negated entirely, for it is your very essence (عينك). And nothing remains in Existence (الوجود) except one single essence (عين واحدة), which is you. So pay attention to what we have alluded to regarding this striking away. And Allah says the Truth and He guides to the way.",
    "ur": "باب نمبر پانچ سو ترپن: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا کہ: \"اور اللہ ان کے پیچھے سے محیط ہے (وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ)\"\n\nبے شک رحمن کی احاطہ (الإحاطة) کرنا، پیچھے (وراء) کے ساتھ، ایک تحدید (تحدید) ہے، اور اس میں تجرید (تجريد) کا فیصلہ ہوتا ہے۔\nپس جو شخص اپنی نشأت (نشأۃ) کے کندھوں سے تجرد اختیار کر لے، وہ اپنے عقل میں اللہ کے لیے کوئی تحدید (تحدید) مقرر نہیں کرتا۔\nاللہ اس سے پاک ہے کہ اس پر کوئی ایسا حکم لگایا جائے جسے جلالِ الٰہی (جلال اللہ) کی طرف لوٹانا حمد (تحمید) ہے۔\nاس کا کمال تمام کائنات کے چہروں سے تسبیح، حمد، تہلیل، اور تمجید ہے۔\n\n### [بے شک الحق (الحق) عین الوجود (عین الوجود) ہے]\n\nاللہ تعالیٰ نے فرمایا: \"اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)\"۔ چونکہ الحق (الحق) عین الوجود (عین الوجود) ہے، اس لیے وہ عالم پر احاطہ (الإحاطة) کرنے کی صفت سے متصف ہوا۔ اور اللہ نے پیچھے (وراء) سے احاطہ (الإحاطة) کو صرف حفظِ الٰہی (الحفظ الإلهي) کے لیے بنایا۔ یہ اس لیے کہ جب اس نے اس کے لیے دو آنکھیں بنائیں اور انہیں اس کے چہرے میں رکھا جو اس کا امام (الإمام) اور اطراف ہیں، اور یہ سب وہ واقعہ تھا جسے عام طور پر نام دیا جاتا ہے۔ اور اس مذکورہ چیز کے لیے پیچھے (وراء) کوئی ایسا سبب نہیں تھا جس سے حفظ واقع ہوتا، لہٰذا اللہ نے اسے اپنی ذات سے محفوظ رکھا اور اس کے سوا کوئی سبب نہیں بنایا جس سے وہ اسے محفوظ رکھتا۔ پس انسان کی نشأت (نشأۃ) اس کے امام اور امام الحق کے درمیان واقع ہوئی۔\n\nپس جو کچھ اس کے سامنے تھا وہ شہود (شہادۃ) تھا، اور جو اس کے پیچھے تھا وہ اس کے لیے غیب (غیب) تھا۔ لہٰذا وہ اپنے سامنے سے اپنی ذات سے محفوظ ہے اور اپنے پیچھے سے اپنے رب سے محفوظ ہے۔ اور اللہ کے پیچھے کوئی ٹھکانہ نہیں۔ اور اگر الحق (الحق) ان کے پیچھے سے محیط (محیط) نہ ہوتا تو انسان اپنے پیچھے سے لے لیا جاتا، پس وہ اس چیز سے محفوظ ہو جاتا جس سے وہ ڈرتا ہے، اور اپنے امام (الإمام) سے جو کچھ اس نے مشاہدہ کیا اس کے ذریعے اپنے حفظ پر بھروسہ کرتا۔ پس اسے اپنے امام سے غیب (غیب) اور شہود (شہادۃ) میں امان حاصل ہوئی، اور اسے اپنے پیچھے سے ایمان کے ذریعے امان حاصل ہوئی۔\n\nپس اگر اللہ اسے کسی بھی سمت سے پکڑے گا تو اسے اس کے مأمن (امن کی جگہ) سے پکڑے گا۔ اور اسی طرح تیرے رب کی پکڑ ہے جب وہ بستیوں کو پکڑتا ہے جبکہ وہ ظالم ہوں (وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَىٰ وَهِيَ ظَالِمَةٌ)، تو وہ انہیں ان کے پیچھے سے پکڑتا ہے۔ اور جہاں تک احاطہ عامہ (الإحاطة العامۃ) کا تعلق ہے، وہ کلی پکڑ ہے، اور یہ اس کا قول ہے: \"اور اللہ کافروں کو گھیرے ہوئے ہے (وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ)\"، بغیر کسی خاص جہت کی قید کے۔ لیکن یہ صفت کی قید کے ساتھ پکڑ ہے، اور وہ کفر ہے۔ اور یہ ستر (پردہ) کے سوا کچھ نہیں، لہٰذا یہ پیچھے (وراء) سے مشابہ ہوا کیونکہ انسان اسے ادراک نہیں کر سکتا۔\n\nپس ہم نے نہیں دیکھا کہ احاطہ (الإحاطة) کی پکڑ جہاں بھی وارد ہو، وہ شہود (شہود) کے ذریعے ہو۔ لہٰذا جب اللہ اپنے اولیاء میں سے کسی کو پکڑتا ہے تو اسے صرف اس کے پیچھے (وراء) سے پکڑتا ہے تاکہ وہ اچانک نہ آئے۔ پس وہ اسے نرمی سے پکڑتا ہے یہاں تک کہ اسے احساس بھی نہیں ہوتا۔ اور جب وہ اس طرح پکڑا جاتا ہے تو وہ اس لذت کی وجہ سے مانوس ہو جاتا ہے جو اسے اس میں ملتی ہے، کیونکہ یہ ایسی مشاہدہ (مشاہدۃ) نہیں جو اسے فنا (فنا) کر دے۔ اور اسی لیے اس نے پہلے جملے سے \"بل\" کے ذریعے اعراض کیا اور فرمایا: \"بلکہ وہ قرآن مجید ہے (بَلْ هُوَ قُرْآنٌ مَجِيدٌ)\"، یعنی ایک شریف مجموعہ، مراد یہ ہے کہ جو کچھ اس پر اسماء و نعوت ہیں وہ \"لوح محفوظ میں (فِي لَوْحٍ مَّحْفُوظٍ)\" ہیں۔ اور وہ (لوح محفوظ) تم ہو، اشارے اور اعتبار کے طور پر۔ یا تم اپنی طرف سے کسی جہت میں نہیں ہو، اگرچہ جہات تمہارے اندر ہیں، اور وہاں تمہارے سوا کوئی نہیں۔ پس اس اعراض (إضراب) کی وجہ سے پیچھے (وراء) کی نفی ہو گئی، لیکن مکمل طور پر نفی نہیں ہوئی، کیونکہ وہ تمہاری عین (عین) ہے۔ اور وجود (الوجود) میں ایک عین (عین) کے سوا کچھ باقی نہیں رہا، اور وہ تم ہو۔ پس اس اعراض میں جس کی طرف ہم نے اشارہ کیا ہے، اس پر غور کرو۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و پنجاه و سوم در معرفت حال قطبی که منزلگاهش این آیه بود: «و خداوند از پشت سرشان احاطه دارد» (وَاللهُ مِنْ وَرَائِهِمْ مُحِيطٌ).\n\nهمانا احاطه برای رحمان، همراه با «وراء» (پشت سر) نوعی تحدید است، و در آن حکم به تجرید (تجريد) می‌شود.\nپس هر کس از شانه‌های نشأت خود تجرید یابد، در عقل خود برای خداوند تحدیدی قائل نمی‌شود.\nخداوند منزه‌تر از آن است که بر او حکمی رانده شود که حمد (تحمید) او را به جلالش بازگرداند.\nکمال او از جمیع وجوه هستی (الکون)، تسبیح، حمد، تهلیل و تمجید است.\n\n### [همانا حق (الحق) عین هستی (الوجود) است]\n\nخداوند متعال فرمود: «و هیچ چیز نیست مگر آنکه با حمد او تسبیح می‌گوید» (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ). از آنجا که حق (الحق) عین هستی (الوجود) است، به همین دلیل به صفت احاطه بر عالم متصف شد. و خداوند احاطه را از طریق «وراء» (پشت سر) برای حفظ الهی قرار داد، و این بدان سبب بود که برای او دو چشم قرار داد و آن دو را در وجه او که امام (پیش‌رو) او و جوانب اوست، قرار داد. و همه اینها واقعیت معمول نامیده شده بود، و برای «وراء» (پشت سر) سببی نبود که حفظ این مذکور به واسطه آن واقع شود. پس خداوند او را به ذات خود حفظ کرد و جز خود، سببی برای حفظ او قرار نداد.\n\nپس نشأت انسان میان امام (پیش‌رو) خود و امام حق (الحق) حاصل شد. آنچه در مقابل او بود، شهود (شهادة) بود و آنچه پشت سر او بود، غیب برای او بود. پس او از پیش‌رو به نفس خود محفوظ است و از پشت سر به پروردگارش محفوظ است، و ورای خداوند هیچ هدف و مقصدی نیست. و اگر حق (الحق) از پشت سرشان احاطه نداشت، انسان از پشت سر خود گرفته می‌شد، پس از آنچه می‌ترسید ایمن می‌شد و بر حفظ خود به واسطه آنچه از امام (پیش‌رو) خود مشاهده کرده بود، اعتماد می‌کرد. پس برای او از امامش، امان به صورت غیب و شهود (شهادة) حاصل شد، و از پشت سرش، امان به صورت ایمان حاصل شد.\n\nپس اگر خداوند او را از هر سمتی بگیرد، از مأمنش گرفته است. «و این‌چنین است گرفتن پروردگارت، هنگامی که شهرها را در حالی که ستمکارند، می‌گیرد» (وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ)؛ آنها را از پشت سرشان گرفت. و اما احاطه عامه، همان گرفتن کلی است، و آن قول خداوند است: «و خداوند بر کافران احاطه دارد» (وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ)، بدون تقیید به جهت خاصی. اما این گرفتن با تقیید صفت است و آن کفر است، و کفر چیزی جز ستر (پوشاندن) نیست. پس شبیه «وراء» (پشت سر) است، زیرا انسان آن را درک نمی‌کند.\n\nپس ما ندیده‌ایم که گرفتن احاطه، هر جا که وارد شده باشد، از طریق شهود (شهود) باشد. پس اگر خداوند کسی از اولیای خود را بگیرد، او را نمی‌گیرد مگر از پشت سرش، تا او را غافلگیر نکند. پس او را با نرمی می‌گیرد تا احساس نکند. پس چون بدین طریق گرفته شود، انس می‌گیرد به آنچه از لذت در آن می‌یابد، زیرا این گرفتن از مشاهده‌ای نیست که او را فانی سازد. و به همین دلیل، با ادات «بل» (بلکه) از اولی (گرفتن از شهود) اعراض کرد و فرمود: «بلکه آن قرآنی مجید است» (بَلْ هُوَ قُرْآنٌ مَجِيدٌ)؛ یعنی جمعی شریف است، منظور همان چیزی است که از اسماء و نُعوت بر آن است، «در لوح محفوظ» (فِي لَوْحٍ مَحْفُوظٍ)، و آن لوح محفوظ تو هستی، از باب اشاره و اعتبار. یا اینکه تو از خودت در جهتی نیستی، اگرچه جهات در تو هستند، و در آنجا جز تو کسی نیست. پس «وراء» (پشت سر) به خاطر این اعراض (اضراب) منتفی شد، اما به وجهی منتفی نشد، زیرا آن عین توست. و در هستی (الوجود) جز یک عین باقی نمانده است و آن تو هستی. پس به آنچه در این اعراض به آن اشاره کردیم، توجه کن. «و خداوند حق (الحق) را می‌گوید و اوست که راه را می‌نمایاند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 1
}