{
  "id": 533,
  "title": {
    "ar": "الباب الثالث والثلاثون وخمسمائة في معرفة حال قطب كان منزله وإِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ",
    "en": "Chapter Five Hundred and Thirty-Three: Concerning the Gnosis of the State of a Pole (*Qutb*) Whose Station Was: <<وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ>> (And when My servants ask you concerning Me, then indeed I am near. I answer the call of the caller when he calls upon Me.)",
    "ur": "پانچ سو تینتیسواں باب: ایک قطب (قطب) کے حال کی معرفت کے بیان میں جس کا روحانی مقام (منزل) یہ تھا:\n\"وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ\"\n(اور جب میرے بندے آپ سے میرے بارے میں پوچھیں، تو میں یقیناً قریب ہوں، میں پکارنے والے کی پکار کا جواب دیتا ہوں جب وہ مجھے پکارتا ہے۔)",
    "fa": "باب پانصد و سی و سوم در معرفت حال قطبی که منزل او این است: «و هنگامی که بندگانم از من درباره من بپرسند، پس من نزدیکم، دعای دعا کننده را هنگامی که مرا بخواند اجابت می‌کنم» (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ)."
  },
  "content": {
    "ar": "## «الباب الثالث والثلاثون وخمسمائة في معرفة حال قطب كان منزله وإِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ»\n\n\n> إن الدعاء حجاب من لا يشهد *** هذا هو الحق الذي لا يجحد\n\n\n> وهو القريب بعلمه وبعينه *** وهو الذي في كل حال يشهد\n\n\n> لكنه لما دعاك دعوته *** من قبل ذا أعطاك هذا المشهد\n\n\n> فإذا علمت بأنه عين الذي *** يدعو فمن تدعوه أو من تقصد\n\n\n> فادعوه أمرا لا تكن ممن يرى *** أن الدعاء هو الحجاب الأبعد\n\n\n### [وجه تقرب العبد من الله وبعده‏]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن الله تعالى ما أخبر نبيه صَلَّى اللهُ عَليهِ وسَلَّم بقربه من السائلين من عباده بالإجابة فيما يسألونه فيه إلا وقد ساوانا في العلم بالله من هذا الوجه ولو كان هذا القرب الإلهي في الإجابة قربه في المسافة التي ذكر عنها أنه أقرب إلى الإنسان من حَبْلِ الْوَرِيدِ لاكتفى وذلك لأنه لا يلزم من هذا القرب السماع كما لا يلزم من السماع في السؤال الإجابة فحصل من الفائدة بهذا التعريف ثلاثة أمور القرب والسماع والإجابة فلم يترك لعبده حجة عليه بل لله الْحُجَّةُ الْبالِغَةُ فإذا أقيم العبد في هذا الذكر فأول ما ينتج له الزهد فيما سوى الله فلا يتوسل إليه بغيره فإن التوسل إنما هو طلب القرب منه فقد أخبرنا الله تعالى أنه قريب فلا فائدة لهذا الطلب وخبره صدق ثم أخبر أنه يجيب سؤال السائلين فهو إخبار بأن بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ وأخبر بالإجابة ليتحفظ السائل ويراقب ما يسأل فيه لأنه لا بد من الإجابة فقد يسأل العبد فيما لا خير له فيه لجهله بالمصالح فهو تنبيه من الله وتحذير أن لا يسأل إلا فيما يعلم أن له فيه الخير الوافر عند الله في الدنيا والآخرة فمن أخذ هذا الذكر على جهة التنبيه فلم يسأل الله تعالى في حاجة من حوائج الدنيا على التعيين ولكن يسأل فيما له فيه خير مما يعلمه الله مبهما لا يعين فإذا عين ولا بد فليسأل فيه الخيرة وسلامة الدين وأما تعيينه في السؤال فيما يرجع إلى أمر الدين فليعين ما شاء ولا مكر فيه ولا غائلة الإجابة لاكثر الناس فيما يسألون فيه ربهم‏\n\n\n### [الدعاء نداء وهو تأيه بالله‏]\n\n\nفاعلم إن الله أخبر أنه يجيب دعوة الداع إذا دعاه وما دعاؤه إياه إلا عين قوله حين يناديه باسم من أسمائه فيقول يا الله أو يا رب أو رب أو يا ذا المجد والكرم وما أشبه ذلك فالدعاء نداء وهو تأيه بالله فإجابة هذا القدر الذي هو الدعوة وبها سمي داعيا أن يلبيه الحق فيقول لبيك فهذا لا بد منه من الله في حق كل سائل ثم ما يأتي بعد هذا النداء فهو خارج عن الدعاء وقد وقعت الإجابة كما قال فيوصل بعد النداء من الحوائج ما قام في خاطره مما شاءه فلم يضمن في هذا الذكر إجابته فيما سأل فيه ودعاه من أجله فهو إن شاء قضى حاجته وإن شاء لم يفعل ولهذا ما كل مسئول فيه يقضيه الله لعبده وذلك رحمة به فإنه قد يسأل فيما لا خير له فيه فلو ضمن الإجابة في ذلك لوقع ويكون فيه هلاكه في دينه وآخرته وربما في دنياه من حيث لا يشعر فمن كرمه أنه ما ضمن الإجابة فيما يسأل فيه وإنما ضمن الإجابة في الدعاء خاصة كما بيناه وهذا غاية الكرم من السيد في حق عبده حيث أبقى عليهم ثم إن هذا الذكر إذا أنتج له سماع الإجابة الإلهية فإنه لا بد لصاحب هذا الذكر أن يسمع الإجابة ولكن ذوقهم في السماع مختلف فقد يكون إسماع واحد غير إسماع الآخر ولكن لا بد من علامة يعطيها الله لهذا الذاكر يعلم بها أنه قد أجاب دعاءه ومعلوم أنه أجاب دعاءه وإنما أريد أنه يعلمه أن الذي سأل فيه قد قضى وإن تأخر وأعطى بدله على طريق العوض لما له في البدل من الخير وقد يكشف له عن خواص الأحوال والأزمنة والأمكنة التي توجب قضاء حاجة الداعي فيما سأل فيه وإن لم يكن له فيه‏\nخير ويعود وباله عليه فيكون ممن جنى على نفسه فإذا كشف الله له مثل هذا يتحرز في الدعاء وفيما يدعو فيه وكذلك يكشف له بخاصية ما يدعو به من الأسماء والكلمات‏\n\n\n### [قصة بلعم مع موسى ع‏]\n\n\nأ لا ترى ابن باعورا وكان قد آتاه الله العلم بخاصية آية من آياته فدعا بها على موسى عليه السلام وقومه فأجابه الله فيما دعا فيه وشقي هو في نفسه وسلب الله عنه علم ذلك وهو قوله تعالى واتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْناهُ آياتِنا فَانْسَلَخَ مِنْها الآيات وجعل مثله كَمَثَلِ الْكَلْبِ فيكشف الله لصاحب هذا الذكر علم هذا عناية منه به فإن في ذلك مكرا إليها من حيث لا يشعر ولا سيما والنفس مجبولة على حب الشفوف على أبناء الجنس وإظهار قدرها عند الله ولهذا أكابر الأولياء أخفياء أبرياء لا ترى عليهم من أثر المكانة والتقريب ما تحتد من أجله أبصار الخلق إليهم بل لا فرق بينهم وبين العامة والذين ملكتهم الأحوال لهم خرق العوائد والظهور ولكن لا يفي ذلك بما فيه من المكر والاستدراج فإنه في غير موطنه ظهر ممن لا يجب عليه الظهور به وهو الولي وأصعب ما في الأمر أن يذوق في ذلك طعم نفسه فإن صاحبه لا يفلح أبدا ولو صرف الكون والعالم على حكمه فإذا سألتم الله فاسألوه التوفيق والعافية والعناية في تحصيل السعادة وقُلْ رَبِّ زِدْنِي عِلْماً فإن العلم يأبى إلا السعادة فإن الله ما أمر نبيه بطلب الزيادة منه إلا وقد علم إن عين حصول العلم المطلوب هو عين السعادة ما فيه مكر ولا استدراج أصلا وما هو إلا العلم بالله خاصة لا العلم بالحساب والهندسة والنجوم ولو علم ذلك لكان علم دلالة على علم بالله فلم يعطه الله ذلك للوقوف عنده فهذا ذكر عظيم الفائدة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Five Hundred and Thirty-Three: Concerning the Knowledge of the State of a Pole (قطب) Whose Station is Defined by the Verse: <<وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ>> (And when My servants ask you concerning Me, then indeed I am near; I answer the call of the caller when he calls upon Me)\n\n> Indeed, supplication (الدعاء) is a veil for him who does not witness (يشهد),\n> This is the Truth (الحق) which cannot be denied.\n> And He is the Near One (القريب) by His Knowledge and His very Essence (عينه),\n> And He is the One who witnesses in every state.\n> But when He called you, you made your call,\n> Before that, He granted you this station of witnessing (المشهد).\n> So if you know that He is the very Essence (عين) of the one who calls,\n> Then whom do you call or whom do you intend?\n> So call upon Him as a command (أمرا), do not be among those who believe\n> That supplication is the furthest veil (الحجاب الأبعد).\n\n### [The Aspect of the Servant's Proximity to God and Distance from Him]\n\nKnow, may God support us and you with a Spirit from Him (بِرُوحٍ مِنْهُ), that God Almighty did not inform His Prophet (PBUH) of His proximity to His servants who ask, by responding to what they seek, except that He has made us equal in the Knowledge (العلم) of God from this perspective. If this Divine Proximity (القرب الإلهي) in the response (الإجابة) were merely His proximity in distance, which He mentioned as being closer to man than the jugular vein (حَبْلِ الْوَرِيدِ), that would have been sufficient. This is because hearing (السماع) is not necessarily implied by this proximity, just as the response is not necessarily implied by hearing the question.\n\nThus, the benefit derived from this definition yields three matters: Proximity (القرب), Hearing, and Response. So He left His servant no argument against Him; rather, to God belongs the conclusive argument (الْحُجَّةُ الْبَالِغَةُ).\n\nWhen the servant is established in this remembrance (الذكر), the first thing produced for him is detachment (الزهد) from everything other than God. Thus, he does not seek means (يتوسل) to Him through anything else. For seeking means is merely seeking proximity to Him, and God Almighty has already informed us that He is Near (قريب). Therefore, there is no benefit in this seeking, and His news is true.\n\nThen He informed us that He answers the request of the seekers, which is an affirmation that the dominion of all things (مَلَكُوتُ كُلِّ شَيْءٍ) is in His Hand. He informed us of the response so that the seeker may be cautious and monitor what he asks for, because the response is inevitable. The servant may ask for something that holds no good for him due to his ignorance of what is beneficial. This is an admonition and a warning from God not to ask except for what he knows contains abundant good (الخير الوافر) for him with God in this world and the Hereafter.\n\nWhoever takes up this remembrance as an admonition should not ask God Almighty for a specific need of this world, but rather ask vaguely for what is good for him, which God knows, without specifying. If he must specify, then he should ask for the best choice (الخيرة) in it and the safety of his religion (سلامة الدين). As for specifying in a request related to religious matters (أمر الدين), he may specify whatever he wishes, for there is no deceit (مكر) in it, nor is there the peril (غائلة) of the response that affects most people in what they ask their Lord.\n\n### [Supplication is a Call, and it is a Deification of God]\n\nKnow that God informed us that He answers the call (دعوة) of the caller (الداع) when he calls upon Him. His calling upon Him is nothing but the very Essence (عين) of his utterance when he calls Him by one of His Names, saying, \"O Allah,\" or \"O Lord,\" or \"Lord,\" or \"O Possessor of Glory and Generosity,\" and the like. Thus, supplication (الدعاء) is a call (نداء), and it is a deification of God (تأيه بالله).\n\nThe response (إجابة) to this specific measure, which is the call and by which he is named a caller, is that the Real (الحق) answers him, saying, \"Here I am (لبيك).\" This is inevitable from God for every seeker.\n\nThen, whatever comes after this call is outside the scope of the supplication, and the response has already occurred, just as He stated. After the call, He grants the needs (الحوائج) that arose in his mind, according to His Will. However, He did not guarantee in this remembrance (الذكر) the response regarding the specific thing he asked for and called Him concerning. Thus, if He wills, He fulfills his need, and if He wills, He does not. This is why God does not fulfill every requested matter for His servant.\n\nThis is a mercy (رحمة) to him, for he may ask for something that holds no good for him. If the response were guaranteed in that case, it would occur, leading to his destruction (هلاك) in his religion and his Hereafter, and perhaps in his worldly life without him realizing it. It is part of His generosity (كرمه) that He did not guarantee the response regarding the specific request, but rather guaranteed the response to the call specifically, as we have explained. This is the ultimate generosity (غاية الكرم) from the Master toward His servant, as He preserves them.\n\nFurthermore, when this remembrance produces for him the hearing (سماع) of the Divine Response (الإجابة الإلهية), the practitioner of this remembrance must hear the response, but their spiritual taste (ذوقهم) in hearing differs. The hearing of one may be different from the hearing of another, but God must give this rememberer a sign (علامة) by which he knows that his call has been answered.\n\nIt is known that He answered his call, but what is meant is that He informs him that the specific thing he asked for has been fulfilled, even if delayed, or that He has given him a substitute (بدله) as compensation (العوض) due to the good contained in the substitute. He may also unveil to him the specific properties (خواص) of states, times, and places that necessitate the fulfillment of the caller's need, even if there is no good in it for him, and its misfortune (وباله) returns upon him, making him one who has wronged himself. When God unveils such things to him, he becomes cautious in his supplication and in what he asks for. Likewise, He unveils to him the specific property (خاصية) of the Names and words by which he supplicates.\n\n### [The Story of Bal'am with Moses, peace be upon him]\n\nDo you not see the case of Bal'am ibn Ba'ura, whom God had given Knowledge (العلم) of the specific property of one of His signs? He supplicated with it against Moses (peace be upon him) and his people, and God answered him in what he asked for, but he became wretched (شقي) himself, and God stripped him of that knowledge. This is referred to in His saying: <<وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانْسَلَخَ مِنْهَا>> (And recite to them the news of him to whom We gave Our signs, but he slipped away from them) [Quran 7:175], and He made his likeness <<كَمَثَلِ الْكَلْبِ>> (like the likeness of a dog) [Quran 7:176].\n\nGod unveils the knowledge of this to the practitioner of this remembrance (الذكر) as a special care (عناية) from Him, for there is deceit (مكر) in it that approaches him without him realizing it, especially since the soul (النفس) is naturally inclined to love superiority (حب الشفوف) over its peers and to display its status with God. For this reason, the greatest of the Friends of God (الأولياء) are hidden and innocent; you do not see upon them any trace of status or proximity (التقريب) that would cause the eyes of creation to sharpen toward them. Rather, there is no difference between them and the common people.\n\nAs for those who are mastered by the spiritual states (الأحوال), they exhibit the breaking of norms (خرق العوائد) and outward manifestation (الظهور), but this does not compensate for the deceit and gradual enticement (الاستدراج) contained within it, for it appears in an inappropriate place from one who ought not to manifest it, namely the Friend. The most difficult aspect of the matter is that he tastes the flavor of his own self (طعم نفسه) in that manifestation, for its possessor will never succeed, even if he were to command the cosmos and the world according to his will.\n\nTherefore, when you ask God, ask Him for Divine Aid (التوفيق), well-being (العافية), and care in achieving felicity (السعادة), and say: <<قُلْ رَبِّ زِدْنِي عِلْماً>> (Say: My Lord, increase me in knowledge) [Quran 20:114], for Knowledge (العلم) refuses anything but felicity. God only commanded His Prophet to seek increase in it because He knew that the very Essence (عين) of attaining the desired Knowledge is the very Essence of felicity, containing absolutely no deceit or gradual enticement. And this is specifically the Knowledge of God (العلم بالله), not the knowledge of calculation, geometry, or astronomy. Even if one knew those, they would only be knowledge indicating the Knowledge of God. God did not grant them so that one should stop at them.\n\nThis, then, is a remembrance of immense benefit. And God <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way) [Quran 33:4].",
    "ur": "باب نمبر پانچ سو تینتیس: اس قطب کے حال کی معرفت میں جس کا مقام یہ آیت تھی: \"اور جب میرے بندے آپ سے میرے بارے میں پوچھیں تو (بتا دیں کہ) میں یقیناً قریب ہوں، میں پکارنے والے کی پکار کا جواب دیتا ہوں جب وہ مجھے پکارتا ہے۔\" (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ)\n\n> بے شک دعا اس شخص کے لیے حجاب ہے جو (حق کا) شہود (الشہود) نہیں کرتا،\n> یہی وہ حق (الحق) ہے جس کا انکار نہیں کیا جا سکتا۔\n> اور وہ اپنے علم اور اپنی ذات کے ساتھ قریب ہے،\n> اور وہی ہے جو ہر حال میں شہود (الشہود) کرتا ہے۔\n> لیکن جب اس نے تجھے پکارا تو تو نے اسے پکارا،\n> اس سے پہلے اس نے تجھے یہ مشاہدہ عطا کیا۔\n> پس جب تو نے جان لیا کہ وہ ہی عین ہے جو پکارتا ہے،\n> تو پھر تو کسے پکارتا ہے یا کس کا قصد کرتا ہے؟\n> پس اسے ایک حکم کے طور پر پکار، ان لوگوں میں سے نہ ہو جو یہ سمجھتے ہیں\n> کہ دعا سب سے بڑا حجاب ہے۔\n\n### [بندے کے اللہ سے قرب اور بعد کا پہلو]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی طرف سے ایک روح کے ذریعے تائید بخشے، کہ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو اپنے بندوں میں سے سوال کرنے والوں سے جواب دینے کے ذریعے اپنے قرب کی خبر نہیں دی مگر اس حال میں کہ اس پہلو سے اس نے ہمیں اللہ کی معرفت (المعرفۃ) میں برابر کر دیا۔ اور اگر یہ قربِ الٰہی جواب دینے میں وہی قرب ہوتا جس کا ذکر اس فاصلے کے اعتبار سے کیا گیا ہے کہ وہ انسان سے شہ رگ (حَبْلِ الْوَرِيدِ) سے بھی زیادہ قریب ہے، تو یہ کافی ہوتا۔ اور یہ اس لیے کہ اس قرب سے سننا لازم نہیں آتا، جیسا کہ سوال میں سننے سے جواب دینا لازم نہیں آتا۔ پس اس تعریف سے تین چیزوں کا فائدہ حاصل ہوا: قرب، سننا، اور جواب دینا۔ پس اس نے اپنے بندے کے لیے اپنے اوپر کوئی حجت نہیں چھوڑی، بلکہ اللہ ہی کے لیے کامل حجت (الْحُجَّةُ الْبَالِغَةُ) ہے۔\n\nپس جب بندہ اس ذکر میں قائم ہو جاتا ہے تو سب سے پہلے جو چیز اس کے لیے پیدا ہوتی ہے وہ اللہ کے سوا ہر چیز سے بے رغبتی (زہد) ہے، لہٰذا وہ اس کے سوا کسی اور کے ذریعے اس تک وسیلہ نہیں ڈھونڈتا۔ کیونکہ توسل درحقیقت اس سے قرب کا طلب کرنا ہے، جبکہ اللہ تعالیٰ نے ہمیں خبر دی ہے کہ وہ قریب ہے، لہٰذا اس طلب کا کوئی فائدہ نہیں، اور اس کی خبر سچی ہے۔ پھر اس نے خبر دی کہ وہ سوال کرنے والوں کے سوال کا جواب دیتا ہے، پس یہ اس بات کی خبر ہے کہ ہر چیز کا ملکوت (بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ) اسی کے ہاتھ میں ہے۔ اور اس نے جواب دینے کی خبر اس لیے دی تاکہ سوال کرنے والا محتاط ہو جائے اور اس چیز کی نگرانی کرے جس کا وہ سوال کر رہا ہے، کیونکہ جواب ملنا لازمی ہے۔ بسا اوقات بندہ ان چیزوں کا سوال کر بیٹھتا ہے جن میں اس کے لیے کوئی بھلائی نہیں ہوتی، کیونکہ وہ مصلحتوں سے ناواقف ہوتا ہے۔ پس یہ اللہ کی طرف سے تنبیہ اور تحذیر ہے کہ وہ صرف اسی چیز کا سوال کرے جس میں وہ جانتا ہو کہ دنیا اور آخرت میں اللہ کے ہاں اس کے لیے وافر بھلائی ہے۔\n\nپس جس نے اس ذکر کو تنبیہ کے طور پر لیا، وہ دنیا کی کسی بھی حاجت میں خاص طور پر اللہ سے سوال نہیں کرتا، بلکہ وہ اس چیز کا سوال کرتا ہے جس میں اس کے لیے بھلائی ہو، جسے اللہ جانتا ہے، مبہم طور پر، وہ اسے متعین نہیں کرتا۔ اور اگر اسے متعین کرنا ضروری ہو تو وہ اس میں خیر اور دین کی سلامتی کا سوال کرے۔ اور جہاں تک دین کے معاملے سے متعلق سوال میں تعین کا تعلق ہے، تو وہ جو چاہے متعین کرے، اس میں کوئی مکر نہیں اور نہ ہی اکثر لوگوں کے لیے اس سوال کے جواب میں کوئی آفت ہے جو وہ اپنے رب سے کرتے ہیں۔\n\n### [دعا ایک پکار ہے اور یہ اللہ کے ساتھ تالہ (تأیہ) ہے]\n\nپس جان لو کہ اللہ نے خبر دی ہے کہ وہ پکارنے والے کی پکار کا جواب دیتا ہے جب وہ اسے پکارتا ہے۔ اور اس کا اسے پکارنا عین اس کے اس قول کے ہے جب وہ اسے اس کے کسی نام سے پکارتا ہے، پس وہ کہتا ہے: یا اللہ، یا رب، یا رب، یا ذوالجلال والاکرام، یا اس سے ملتے جلتے الفاظ۔ پس دعا ایک پکار (نداء) ہے اور یہ اللہ کے ساتھ تالہ (تأیہ) ہے۔ پس اس قدر کا جواب جو کہ دعا ہے اور جس کی وجہ سے وہ پکارنے والا کہلاتا ہے، یہ ہے کہ ذات حق (الحق) اسے لبیک کہے، پس یہ ہر سوال کرنے والے کے حق میں اللہ کی طرف سے لازمی ہے۔ پھر جو کچھ اس پکار کے بعد آتا ہے وہ دعا سے خارج ہے، اور جواب واقع ہو چکا ہے جیسا کہ اس نے فرمایا۔ پس وہ پکار کے بعد ان حاجات کو پہنچاتا ہے جو اس کے دل میں آئیں، جنہیں وہ چاہتا ہے، لیکن اس ذکر میں اس چیز کے جواب کی ضمانت نہیں دی گئی جس کا اس نے سوال کیا اور جس کے لیے اس نے دعا کی۔ پس اگر وہ چاہے تو اس کی حاجت پوری کر دیتا ہے اور اگر چاہے تو نہیں کرتا۔ اور اسی لیے ہر وہ چیز جس کا سوال کیا جاتا ہے، اللہ اسے اپنے بندے کے لیے پورا نہیں کرتا، اور یہ اس پر رحمت ہے۔ کیونکہ وہ بسا اوقات ایسی چیز کا سوال کر بیٹھتا ہے جس میں اس کے لیے کوئی بھلائی نہیں ہوتی، پس اگر اس میں جواب کی ضمانت دی جاتی تو وہ واقع ہو جاتا اور اس میں اس کی دین اور آخرت کی ہلاکت ہوتی، اور شاید دنیا میں بھی، جہاں سے اسے شعور بھی نہ ہوتا۔ پس اس کی کرم نوازی میں سے یہ ہے کہ اس نے اس چیز کے جواب کی ضمانت نہیں دی جس کا سوال کیا جاتا ہے، بلکہ اس نے صرف دعا کے جواب کی ضمانت دی ہے، جیسا کہ ہم نے بیان کیا۔ اور یہ آقا کی طرف سے اپنے بندے کے حق میں کرم کی انتہا ہے کہ اس نے ان پر باقی رکھا۔\n\nپھر جب یہ ذکر اس کے لیے جوابِ الٰہی کے سننے کو پیدا کرتا ہے، تو اس ذکر والے کے لیے جواب سننا لازمی ہے، لیکن سننے میں ان کا ذوق مختلف ہوتا ہے۔ پس ایک کا سننا دوسرے کے سننے سے مختلف ہو سکتا ہے، لیکن اللہ کی طرف سے اس ذاکر کو ایک علامت دینا لازمی ہے جس سے وہ جان لے کہ اس نے اس کی دعا قبول کر لی ہے۔ اور یہ معلوم ہے کہ اس نے اس کی دعا قبول کر لی ہے، لیکن مراد یہ ہے کہ وہ اسے یہ جاننے دے کہ جس چیز کا اس نے سوال کیا تھا وہ پوری ہو گئی ہے، اگرچہ تاخیر سے، یا اس کے بدلے میں کوئی اور چیز عطا کی گئی ہے، بطورِ عوض، اس بھلائی کی وجہ سے جو اس بدل میں ہے۔ اور بسا اوقات اس کے لیے احوال، زمانوں اور جگہوں کی خصوصیات کا کشف (الکشف) کیا جاتا ہے جو پکارنے والے کی حاجت کو پورا کرنا واجب کرتی ہیں، اس چیز میں جس کا اس نے سوال کیا، اگرچہ اس میں اس کے لیے کوئی بھلائی نہ ہو اور اس کا وبال اسی پر لوٹ آئے، پس وہ ان لوگوں میں سے ہو جاتا ہے جنہوں نے اپنی جان پر ظلم کیا۔ پس جب اللہ اس کے لیے اس طرح کا کشف (الکشف) کرتا ہے تو وہ دعا کرنے میں اور جس چیز کے لیے دعا کرتا ہے اس میں احتیاط کرتا ہے، اور اسی طرح اس کے لیے ان اسماء اور کلمات کی خاصیت کا کشف (الکشف) بھی کیا جاتا ہے جن کے ذریعے وہ دعا کرتا ہے۔\n\n### [بلعم بن باعورا کا قصہ موسیٰ علیہ السلام کے ساتھ]\n\nکیا تم ابن باعورا کو نہیں دیکھتے، جسے اللہ نے اپنی آیات میں سے ایک آیت کی خاصیت کا علم عطا کیا تھا، پس اس نے اس کے ذریعے موسیٰ علیہ السلام اور ان کی قوم کے خلاف دعا کی، تو اللہ نے اس چیز میں اس کی دعا قبول کر لی جس کے لیے اس نے دعا کی تھی، اور وہ خود بدبخت ہو گیا، اور اللہ نے اس سے وہ علم چھین لیا۔ اور یہ اللہ تعالیٰ کا قول ہے: \"اور انہیں اس شخص کی خبر پڑھ کر سنائیے جسے ہم نے اپنی آیات عطا کی تھیں، پھر وہ ان سے نکل گیا...\" (وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانْسَلَخَ مِنْهَا) (آیات)، اور اس کی مثال کتے کی مثال (كَمَثَلِ الْكَلْبِ) جیسی بنا دی۔\n\nپس اللہ اس ذاکر کے لیے اس علم کا کشف (الکشف) کرتا ہے، یہ اس کی طرف سے اس پر عنایت ہے، کیونکہ اس میں ایک مکر ہے جس کا اسے شعور نہیں ہوتا۔ خاص طور پر جب کہ نفس اپنی جنس کے لوگوں پر برتری حاصل کرنے اور اللہ کے ہاں اپنی قدر و منزلت ظاہر کرنے کی محبت پر جبلت کیا گیا ہے۔ اور اسی لیے بڑے اولیاء پوشیدہ اور بے گناہ ہوتے ہیں، تم ان پر مقام اور قربت کا کوئی ایسا اثر نہیں دیکھو گے جس کی وجہ سے مخلوق کی نگاہیں ان کی طرف تیز ہو جائیں، بلکہ ان میں اور عام لوگوں میں کوئی فرق نہیں ہوتا۔ اور وہ لوگ جن پر احوال غالب آ جاتے ہیں، ان کے لیے خرقِ عادات اور ظہور ہوتا ہے، لیکن یہ اس مکر اور استدراج کے مقابلے میں کافی نہیں ہوتا جو اس میں ہے۔ کیونکہ یہ اس شخص سے ظاہر ہوا جو اس کا مستحق نہیں تھا، اور وہ ولی ہے۔ اور اس معاملے میں سب سے مشکل بات یہ ہے کہ وہ اس میں اپنے نفس کا ذائقہ چکھ لے، کیونکہ اس کا ساتھی کبھی کامیاب نہیں ہو سکتا، اگرچہ وہ کائنات اور عالم کو اپنے حکم پر چلا لے۔\n\nپس جب تم اللہ سے سوال کرو تو اس سے توفیق، عافیت اور سعادت کے حصول میں عنایت کا سوال کرو۔ اور کہو: \"اے میرے رب! میرے علم میں اضافہ فرما۔\" (وَقُل رَّبِّ زِدْنِي عِلْمًا) کیونکہ علم سعادت کے سوا کسی چیز کو قبول نہیں کرتا۔ کیونکہ اللہ نے اپنے نبی کو اس سے زیادتی طلب کرنے کا حکم نہیں دیا مگر اس حال میں کہ وہ جانتا تھا کہ مطلوبہ علم کا حصول عین سعادت ہے، اس میں قطعاً کوئی مکر یا استدراج نہیں ہے۔ اور یہ صرف خاص طور پر اللہ کی معرفت (المعرفۃ) کا علم ہے، نہ کہ حساب، ہندسہ (جیومیٹری) اور ستاروں کا علم۔ اور اگر وہ یہ علم جانتا تو یہ اللہ کی معرفت (المعرفۃ) کے علم پر دلالت کرنے والا علم ہوتا، پس اللہ نے اسے یہ علم اس لیے نہیں دیا کہ وہ اس پر رک جائے۔ پس یہ ذکر عظیم فائدے والا ہے، اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب پانصد و سی و سوم در معرفت حال قطبی که منزل او این آیه بود: «و چون بندگانم از من درباره من بپرسند، پس [بدانند] که من نزدیکم؛ دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم.» (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ)\n\nهمانا دعا حجاب کسی است که شهود (الشهود) ندارد\nاین همان حقی (الحق) است که انکار نمی‌شود\n\nو اوست که به علم و به عین خود نزدیک است\nو اوست که در هر حالی شهود می‌کند\n\nاما چون تو را خواند، تو نیز او را خواندی\nپیش از این، این مشهد (صحنه شهود) را به تو عطا کرد\n\nپس اگر دانستی که او عین همان کسی است که\nدعا می‌کند، پس چه کسی را می‌خوانی یا چه کسی را قصد می‌کنی؟\n\nپس او را به عنوان یک امر (دستور) بخوان، و از کسانی مباش که\nمی‌پندارند دعا دورترین حجاب است\n\n### [وجه تقرب بنده به خدا و دوری او]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که خداوند متعال پیامبرش (صلی الله علیه و سلم) را از نزدیکی خود به بندگان سائلش در اجابت آنچه می‌خواهند، آگاه نساخت مگر آنکه ما را نیز از این جهت در معرفت (المعرفة) به خدا مساوی قرار داده است. و اگر این نزدیکی الهی در اجابت، همان نزدیکی در مسافتی بود که درباره‌اش ذکر شده که او به انسان از رگ گردن (حَبْلِ الْوَرِيدِ) نزدیک‌تر است، کفایت می‌کرد. و این بدان سبب است که از این نزدیکی، شنیدن (سماع) لازم نمی‌آید، همان‌طور که از شنیدن در سؤال، اجابت لازم نمی‌آید. پس از این تعریف، سه امر به دست آمد: نزدیکی، شنیدن و اجابت. بنابراین، برای بنده‌اش حجتی باقی نگذاشت، بلکه حجت رسا (الْحُجَّةُ الْبَالِغَةُ) از آنِ خداست.\n\nپس هنگامی که بنده در این ذکر (یادآوری) اقامت گزیند، اولین نتیجه‌ای که برای او حاصل می‌شود، زهد در غیر خداست، پس به غیر او متوسل نمی‌شود. زیرا توسل چیزی جز طلب نزدیکی به او نیست، در حالی که خداوند متعال به ما خبر داده که او نزدیک است، پس این طلب فایده‌ای ندارد و خبر او راست است. سپس خبر داد که سؤال سائلان را اجابت می‌کند، و این خبری است مبنی بر اینکه ملکوت هر چیزی (مَلَكُوتُ كُلِّ شَيْءٍ) به دست اوست. و به اجابت خبر داد تا سائل احتیاط کند و مراقب باشد که چه چیزی را می‌خواهد، زیرا اجابت حتمی است. چه بسا بنده به دلیل جهل به مصالح، چیزی را بخواهد که خیری در آن نیست. پس این تنبیهی از جانب خدا و هشداری است که جز در مورد آنچه می‌داند خیر فراوان در دنیا و آخرت نزد خدا برای او در آن است، سؤال نکند.\n\nپس هر کس این ذکر را از جهت تنبیه دریافت کند، در هیچ یک از حوائج دنیا به طور معین از خداوند سؤال نمی‌کند، بلکه به طور مبهم و نامعین، آنچه را که خدا می‌داند برای او خیر است، می‌خواهد. و اگر ناچار به تعیین شد، باید در آن خیر و سلامت دین را بخواهد. اما تعیین در سؤالاتی که به امر دین بازمی‌گردد، هر چه می‌خواهد تعیین کند، زیرا در آن مکر و خطر اجابت برای اکثر مردم در آنچه از پروردگارشان می‌خواهند، وجود ندارد.\n\n### [دعا، ندا و تأله (تأیه) به خداست]\n\nپس بدان که خداوند خبر داده است که دعای دعا کننده را هنگامی که او را بخواند، اجابت می‌کند. و دعای او به حق، چیزی جز عین کلام او نیست هنگامی که او را با یکی از نام‌هایش ندا می‌دهد و می‌گوید: یا الله، یا رب، یا رب، یا ذا المجد و الکرم (ای صاحب بزرگی و کرم) و مانند آن. پس دعا، ندا و تأله (تأیه) به خداست.\n\nپس اجابت این مقدار که همان دعاست و بنده به واسطه آن داعی نامیده می‌شود، این است که حق (الحق) او را لبیک گوید و بگوید: «لبیک». این امر از جانب خدا در حق هر سائل حتمی است. سپس آنچه پس از این ندا می‌آید، خارج از دعاست و اجابت همان‌طور که فرمود، واقع شده است. پس بعد از ندا، از حوائجی که در خاطرش آمده و خواسته است، به او می‌رسد. پس در این ذکر، اجابت آنچه را که بنده به خاطر آن سؤال کرده و دعا نموده، تضمین نکرده است. پس اگر بخواهد، حاجتش را برآورده می‌کند و اگر بخواهد، انجام نمی‌دهد. به همین دلیل، هر آنچه از خدا خواسته می‌شود، برای بنده‌اش برآورده نمی‌کند.\n\nو این از روی رحمت به اوست، زیرا چه بسا چیزی را بخواهد که خیری در آن نیست. اگر اجابت در آن تضمین می‌شد، واقع می‌گشت و در آن هلاکت دین و آخرت و شاید دنیای او بود، در حالی که خود نمی‌دانست. پس از کرم اوست که اجابت آنچه را که در آن سؤال می‌شود، تضمین نکرده، بلکه اجابت را فقط در خودِ دعا تضمین کرده است، همان‌طور که بیان کردیم. و این نهایت کرم از سوی سَرور در حق بنده‌اش است، زیرا بر آنان باقی ماند.\n\nسپس، اگر این ذکر برای او شنیدن اجابت الهی را به بار آورد، صاحب این ذکر ناگزیر باید اجابت را بشنود، اما ذوق (تجربه) آنان در شنیدن مختلف است. چه بسا شنیدن یکی غیر از شنیدن دیگری باشد، اما ناگزیر باید علامتی باشد که خداوند به این ذاکر می‌دهد و با آن می‌داند که دعایش اجابت شده است. و معلوم است که دعای او را اجابت کرده است، اما منظور این است که به او بفهماند آنچه را که خواسته، برآورده شده است، هرچند به تأخیر افتد، یا به جای آن، به طریق عوض، چیزی دیگر به او داده شود، به دلیل خیری که در آن بدل برای او هست.\n\nو چه بسا برای او خواص احوال، زمان‌ها و مکان‌هایی کشف (الکشف) شود که موجب برآورده شدن حاجت داعی در آنچه خواسته است، می‌گردد، حتی اگر خیری در آن نباشد و وبال آن به خودش بازگردد، و از کسانی باشد که بر خود ستم کرده است. پس هنگامی که خداوند چنین چیزی را برای او کشف کند، در دعا و آنچه در آن دعا می‌کند، احتیاط می‌ورزد. همچنین خاصیت اسم‌ها و کلماتی را که با آن‌ها دعا می‌کند، برای او کشف می‌نماید.\n\n### [داستان بلعم با موسی (علیه السلام)]\n\nآیا ابن باعورا را نمی‌بینی که خداوند علم به خاصیت آیه‌ای از آیاتش را به او داده بود، پس با آن بر موسی (علیه السلام) و قومش دعا کرد؟ خداوند او را در آنچه دعا کرد، اجابت نمود، اما او خود شقی شد و خداوند آن علم را از او سلب کرد. و این همان قول خداوند متعال است: «و بر آنان خبر کسی را بخوان که آیات خود را به او دادیم، پس از آن‌ها بیرون رفت...» (وَاتْلُ عَلَيْهِمْ نَبَأَ الَّذِي آتَيْنَاهُ آيَاتِنَا فَانسَلَخَ مِنْهَا) [تا آخر آیات] و مَثَل او را مانند سگ (كَمَثَلِ الْكَلْبِ) قرار داد.\n\nپس خداوند علم این امر را برای صاحب این ذکر کشف می‌کند، از باب عنایت به او؛ زیرا در آن مکر (الهی) وجود دارد، در حالی که او متوجه نمی‌شود، به ویژه که نفس بر دوست داشتن برتری بر هم‌نوعان و آشکار ساختن قدر و منزلت خود نزد خدا سرشته شده است. به همین دلیل، بزرگان اولیا پنهان و بی‌ریا هستند و هیچ اثری از مقام و تقرب بر آنان دیده نمی‌شود که به خاطر آن چشم‌های خلق به سوی آنان تیز شود، بلکه تفاوتی بین آنان و مردم عادی نیست. و کسانی که احوال بر آنان غلبه کرده است، خرق عادات و ظهور دارند، اما این امر به آنچه از مکر و استدراج در آن است، وفا نمی‌کند؛ زیرا در غیر موضع خود از کسی که ظهور بر او واجب نیست، یعنی ولی، ظاهر شده است.\n\nو سخت‌ترین چیز در این امر آن است که در آن طعم نفس خود را بچشد، زیرا صاحب آن هرگز رستگار نمی‌شود، حتی اگر کائنات و عالم را بر حکم خود بگرداند. پس هرگاه از خدا خواستید، توفیق، عافیت و عنایت در به دست آوردن سعادت را بخواهید و بگو: «پروردگارا، علم مرا زیاد کن.» (قُل رَّبِّ زِدْنِي عِلْمًا) زیرا علم جز سعادت را نمی‌پذیرد. خداوند پیامبرش را به طلب افزایش آن امر نکرد مگر آنکه می‌دانست که عین حصول علم مطلوب، عین سعادت است و اصلاً در آن مکر و استدراجی نیست. و آن علم چیزی نیست جز علم به خدا (الله) به طور خاص، نه علم حساب و هندسه و نجوم. اگرچه دانستن آن علوم می‌تواند دلالتی بر علم به خدا باشد، اما خداوند آن را برای توقف در آن علوم به او نداد. پس این ذکری است با فایده‌ای عظیم، و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}