{
  "id": 192,
  "title": {
    "ar": "الباب الثاني والتسعون ومائة في معرفة الحال",
    "en": "Chapter One Hundred and Ninety-Two: Concerning the Knowledge of the Spiritual State (الحال)",
    "ur": "ایک سو بانوے واں باب: حال کی معرفت (المعرفۃ) میں",
    "fa": "باب صد و نود و دوم در معرفت حال"
  },
  "content": {
    "ar": "## (الباب الثاني والتسعون ومائة في معرفة الحال)\n\n\n> الحال مليهب الرحمن من منح *** عناية منه لا كسب ولا طلب‏\n\n\n> تغير الوصف برهان عليه فكن *** على ثبات فإن الحال تنقلب‏\n\n\n> ولا تقولن إن الحال دائمة *** فإن قوما إلى ما قلته ذهبوا\n\n\n> أبو عقال إمام سيد سند *** في الحال كان له في حاله عجب‏\n\n\n> دامت عليه إلى وقت البدور من *** المئين أيامها ما أسدلت حجب‏\n\n\n> وزاد ميقات موسى في إقامته *** على المئين كذا جاءت به الكتب‏\n\n\n### [الحال ما يرد على القلب‏]\n\n\nالحال عند الطائفة ما يرد على القلب من غير تعمل ولا اجتلاب فتتغير صفات صاحبه له واختلف في دوامه فمنهم من قال بدوامه ومنهم من منع دوامه وإنه لا بقاء له سوى زمان وجوده كالعرض عند المتكلمين ثم يعقبه الأمثال فيتخيل أنه دائم وليس كذلك وهو الصحيح لكنه يتوالى من غير أن يتخلل الأمثال ما يخرجه عنه فمنهم من أخذه من الحلول فقال بدوامه وجعله نعتا دائما غير زائل فإذا زال لم يكن حالا وهذا قول من يقول بدوامه قال بعضهم ما أقامني الله منذ أربعين سنة في أمر فكرهته قال الإمام أشار إلى دوام الرضي وهو من جملة الأحوال هذا الذي قاله الإمام يحتمل ولكنه في طريق الله بعيد وإنما الذي ينبغي أن يقال في قول هذا السيد إنه أقام أربعين سنة ما أقامه الله في ظاهره ولا في باطنه في حال مذموم شرعا بل لم تزل أوقاته عليه محفوظة بالطاعات وما يرضى الله ولقد لقيت شخصا صدوقا صاحب حال على قدم أبي يزيد البسطامي بل أمكن في شغله له إدلال في أدب فقال لي يوما لي خمسون سنة ما خطر لي في نفسي خاطر سوء يكرهه الشرع فهذه عصمة إلهية فيكون كلام ذلك السيد من هذا القبيل والأحوال مواهب لا مكاسب‏\n\n\n### [الحال من جملة نعوت إلهى‏]\n\n\nاعلم أن الحال نعت إلهي من حيث أفعاله وتوجهاته على كائناته وإن كان واحد العين لا يعقل فيه زائد عليه قال تعالى عن نفسه كُلَّ يَوْمٍ هُوَ في شَأْنٍ وأصغر الأيام الزمن الفرد الذي لا يقبل القسمة فهو فيه في شئون على عدد ما في الوجود من أجزاء العالم الذي لا ينقسم كل جزء منه بهذا الشرط فهو في شأن مع كل جزء من العالم بأن يخلق فيه ما يبقيه سوى ما يحدثه مما هو قائم بنفسه في كل زمان فرد وتلك الشئون أحوال المخلوقين وهم المحال لوجودها فيهم فإنه فيهم يخلق تلك الشئون دائما فلا يصح بقاء الحال زمانين لأنه لو بقي زمانين لم يكن الحق في حق من بقي عليه الحال خلاقا ولا فقيرا إليه وكان يتصف بالغنى عن الله وهذا محال وما يؤدي إلى المحال محال وهذا مثل قول القائلين‏\nبأن العرض لا يبقى زمانين وهو الصحيح والأحوال أعراض تعرض للكائنات من الله يخلقها فيهم عبر عنها بالشأن الذي هو فيه دنيا وآخرة هذا أصل الأحوال الذي يرجع إليه في الإلهيات فإذا خلق الله الحال لم يكن له محل إلا الذي يخلقه فيه فيحل فيه زمان وجوده فلهذا اعتبره من اعتبره من الحلول وهو النزول في المحل وقد وجد ثم إنه ليس من حقيقته أن يبقى زمانين فلا بد أن ينعدم في الزمان الثاني من زمان وجوده لنفسه لا ينعدم بفاعل يفعل فيه العدم لأن العدم لا ينفعل لأنه ليس شيئا وجوديا ولا بانعدام شرط ولا بضد لما في ذلك كله من المحال فلا بد أن ينعدم لنفسه أي العدم له في الزمان الثاني من زمان وجوده حكم لازم والمحل لا بقاء له دونه أو مثله أو ضده فيفتقر في كل زمان إلى ربه في بقائه فيوجد له الأمثال أو الأضداد فإذا أوجد الأمثال يتخيل أن ذلك الأول هو على أصله باق وليس كذلك وإذا كان الحق كل يوم في شأن وكل شأن عن توجه إلهي والحق قد عرفنا بنفسه أنه يتحول في الصور فلكل شأن يخلقه بصورة إلهية فلهذا ظهر العالم على صورة الحق ومن هنا نقول إن الحق علم نفسه فعلم العالم فمثل هذا اعتبر من اعتبر الحال من التحول والاستحالة فقال بعدم الدوام فلا يزال العالم مذ خلقه الله إلى غير نهاية في الآخرة والوجود في أحوال تتوالى عليه الله خالقها دائما بتوجهات إرادية تصحبها كلمة الحضرة المعبر عنها بكن فلا تزال الإرادة متعلقة وهو المتوجه ولا تزال كن ولا يزال التكوين هكذا هو الأمر في نفسه حقا وخلقا وقد يطلقون الحال ويريدون به ظهور العبد بصفة الحق في التكوين ووجود الآثار عن همته وهو التشبه بالله المعبر عنه بالتخلق بالأسماء وهو الذي يريده أهل زماننا اليوم بالحال ونحن نقول به ولكن لا نقول بأثره لكن نقول إنه يكون العبد متمكنا منه بحيث لو شاء ظهوره لظهر به لكن الأدب يمنعه لكونه يريد أن يتحقق بعبوديته ويستتر بعبادته فلا ينكر عليه أمر بحيث إذا رى‏ء في غاية الضعف ذكر الله عند رؤيته فذلك عندنا ولي الله فيكون في الكون مرحمة وهوقول النبي صلى الله عليه وسلم في أولياء الله إنهم الذين إذا رأوا ذكر الله‏\n\n\nمن صبرهم على البلاء ومحنة الله لهم الظاهرة فلا يرفعون رءوسهم لغير الله في أحوالهم فإذا رى‏ء منهم مثل هذه الصفة ذكر الله بكونه اختصهم لنفسه ومن لا علم له بما قلناه يقول الولي صاحب الحال الذي إذا رى‏ء ذكر الله هو الذي يكون له التكوين والفعل بالهمة والتحكم في العالم والقهر والسلطان وهذه كلها أوصاف الحق فهؤلاء هم الذين إذا رأوا ذكر الله وهذا قول من لا علم له بالأمور وإن مقصود الشارع إنما هو ما ذكرناه وأما هذا القول الآخر فقد ينال التحكم في العالم بالهمة من لا وزن له عند الله ولا قيمة وليس بولي وإنما سئل النبي وأجاب بهذا عن أولياء الله فقيل له من أولياء الله فقال الذين إذا رأوا ذكر الله‏\n\n\nلما طحنتهم البلايا وشملتهم الرزايا فلا يتزلزلون ولا يلجئون لغير الله رضي بما أجراه الله فيهم وأراده بهم فإذا رأتهم العامة على مثل هذا الصبر والرضي وعدم الشكوى للمخلوقين ذكرت العامة الله وعلمت أن لله بهم عناية وأصحاب الآثار قد يكونون أولياء وقد تكون تلك الآثار التكوينية عن موازين معلومة عندنا وعند من يعرف همم النفوس وقوتها وانفعال أجرام العالم لها ومن خالط العزابية ورأى ما هم عليه من عدم التوفيق مع كونهم يقتلون بالهمة ويعزلون ويتحكمون لقوة هممهم وأيضا لما في العالم من خواص الأسماء التي تكون عنها الآثار التكوينيات عند من يكون عنده علم ذلك مع كون ذلك الشخص مشركا بالله فما هو من خصائص أولياء الله تعالى التأثير في الكون فما بقي إلا ما ذكرناه‏\n\n",
    "en": "## Chapter One Hundred and Ninety-Two: Concerning the Knowledge of the Spiritual State (الحال)\n\nThe Spiritual State (الحال) is a gift bestowed by the All-Merciful, a grant of His care, not achieved through acquisition or seeking.\n\nThe alteration of the attribute is proof of its nature, so remain steadfast, for the Spiritual State (الحال) is subject to reversal.\n\nAnd do not assert that the Spiritual State is permanent, for indeed, some people have adopted that view.\n\nAbu Uqal, an Imam, a master, a reliable authority regarding the State (الحال), had a wondrous experience in his own state.\n\nIt lasted upon him for hundreds of days until the time of the full moons, during which no veils were drawn.\n\nAnd its duration exceeded the appointed time of Moses, surpassing the hundreds, as the scriptures have related.\n\n### [The State is what comes upon the Heart]\n\nThe Spiritual State (الحال), according to the Sufi community (الطائفة), is that which descends upon the heart without deliberate effort (تعمل) or seeking (اجتلاب), causing the attributes of its possessor to change. There is disagreement regarding its permanence. Some assert its permanence, while others deny its permanence, holding that it has no subsistence beyond the moment of its existence, like the accident (العرض) according to the theologians (المتكلمين).\n\nThen, similar instances (الأمثال) follow it, leading one to imagine that it is permanent, but this is not the case. This latter view is the sound one. However, it occurs in continuous succession without any intervening instances that would remove the person from that state.\n\nSome derived their understanding from the concept of indwelling (الحلول) and thus asserted its permanence, making it a permanent, non-vanishing attribute. If it vanishes, they argue, it was not a true Spiritual State (حال). This is the position of those who affirm its permanence.\n\nOne of them said, \"For forty years, Allah has not established me in a matter that I disliked.\" The Imam said that this indicates the permanence of contentment (الرضي), which is one of the Spiritual States (الأحوال). What the Imam said is plausible, but in the path of Allah, it is remote.\n\nRather, what should be said concerning the statement of this master is that for forty years, Allah did not establish him, neither outwardly nor inwardly, in a state that is legally reprehensible. Instead, his times were continuously preserved by acts of obedience and that which pleases Allah. I met a truthful person, a possessor of the Spiritual State (صاحب حال), who followed the path of Abu Yazid al-Bistami, and who, in his occupation, even showed a certain boldness within the bounds of propriety. He told me one day, \"For fifty years, no evil thought (خاطر سوء) that the Law (الشرع) dislikes has ever crossed my mind.\" This is a divine preservation (عصمة إلهية). Thus, the statement of that master falls under this category. The Spiritual States (الأحوال) are gifts (مواهب), not acquisitions (مكاسب).\n\n### [The State is one of the Divine Attributes]\n\nKnow that the Spiritual State (الحال) is a Divine Attribute (نعت إلهي) in terms of His Acts (أفعاله) and His orientations (توجهاته) toward His creatures (كائناته), even though the Essence (الذات) is one and no addition can be conceived therein. Allah the Exalted said concerning Himself: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in [some] affair). The smallest of days is the singular, indivisible moment of time (الزمن الفرد). In that moment, He is engaged in affairs (شئون) corresponding to the number of indivisible parts of the world (أجزاء العالم) that exist.\n\nThus, He is in an affair (شأن) with every part of the world by creating in it that which sustains it, apart from what He originates that subsists by itself in every singular moment of time. And those affairs (الشئون) are the Spiritual States (أحوال) of the created beings, and they are the loci (المحال) for the existence of these states within them. For He continuously creates those affairs within them. Therefore, the subsistence of the Spiritual State (الحال) for two moments of time is invalid.\n\nThis is because if it subsisted for two moments, The Real (الحق) would not be the Creator (خلاقا) for the one upon whom the State remained, nor would that person be in need of Him, and he would be characterized by independence (الغنى) from Allah. This is impossible, and whatever leads to the impossible is impossible.\n\nThis is similar to the assertion of those who say that the accident (العرض) does not subsist for two moments, which is the sound view. The Spiritual States (الأحوال) are accidents that occur to created beings, which Allah creates within them, and which are expressed by the \"affair\" (الشأن) He is in, both in this world and the Hereafter.\n\nThis is the foundation of the Spiritual States (الأحوال) to which one refers in Divine Matters (الإلهيات). When Allah creates the State (الحال), it has no locus (محل) except the one in which He creates it, and it indwells (يحل) therein for the duration of its existence. For this reason, those who considered it an instance of indwelling (الحلول) regarded it as the descent into the locus, and this has occurred.\n\nFurthermore, it is not inherent to its reality that it should subsist for two moments. It must necessarily cease to exist (ينعدم) in the second moment of its existence by itself. It does not cease to exist through an agent that effects non-existence in it, because non-existence (العدم) cannot be acted upon, as it is not an existent thing (شيئا وجوديا). Nor does it cease through the absence of a condition or through an opposite, due to the impossibility inherent in all those explanations.\n\nRather, it must cease to exist by itself; meaning, non-existence is a necessary ruling for it in the second moment of its existence. The locus (المحل) has no subsistence without it, or without its like, or without its opposite. Thus, in every moment, it is in need of its Lord for its subsistence, and He creates for it similar instances (الأمثال) or opposites (الأضداد).\n\nWhen He creates similar instances, one imagines that the first state remains upon its original nature, but this is not so. Since The Real (الحق) is every day in an affair (شأن), and every affair arises from a Divine orientation (توجه إلهي), and The Real has made Himself known to us as transforming in forms (الصور), then for every affair He creates, He does so in a Divine form. For this reason, the World (العالم) appeared upon the form of The Real. From this perspective, we say that The Real knew Himself, and thereby knew the World. It is based on this transformation (التحول) and transmutation (الاستحالة) that those who deny the permanence of the Spiritual State (الحال) have based their view.\n\nThus, the World, since Allah created it until endlessness in the Hereafter, and Existence (الوجود) itself, is in continuously succeeding Spiritual States (أحوال) which Allah perpetually creates through volitional orientations (توجهات إرادية) accompanied by the word of the Divine Presence (الحضرة) expressed as \"Be\" (كن). The Will (الإرادة) remains attached, He remains oriented, \"Be\" remains, and the bringing into existence (التكوين) remains. This is the reality of the matter, both in The Real (حقا) and in Creation (خلقا).\n\nSometimes they use the term Spiritual State (الحال) intending the manifestation of the servant with a Divine Attribute (صفة الحق) in the act of bringing into existence (التكوين), and the appearance of effects resulting from his spiritual resolve (همته). This is the imitation of Allah (التشبه بالله), expressed as being characterized by the Divine Names (التخلق بالأسماء), and this is what the people of our time mean today by the Spiritual State (الحال).\n\nWe affirm this, but we do not affirm its effect (i.e., the active use of power). Rather, we say that the servant is empowered by it, such that if he wished for its manifestation, it would appear through him. However, propriety (الأدب) prevents him, because he desires to realize his servitude (عبوديته) and conceal himself through his worship (عبادته). No matter is denied to him, such that when he is seen in the utmost weakness, Allah is remembered upon seeing him. That person, in our view, is the Friend of Allah (ولي الله), and he is a mercy in the cosmos. This is the saying of the Prophet, peace and blessings be upon him, concerning the Friends of Allah: \"They are those who, when they are seen, Allah is remembered.\"\n\nThis is due to their patience (صبرهم) in the face of tribulation (البلاء) and the manifest trial (محنة) Allah imposes upon them. They do not raise their heads to anyone other than Allah in their states. When such an attribute is seen in them, Allah is remembered because He has chosen them for Himself.\n\nBut he who has no knowledge of what we have said asserts that the Friend of Allah (الولي), the possessor of the Spiritual State (صاحب الحال), who, when seen, causes Allah to be remembered, is the one who possesses the power of creation (التكوين), action through spiritual resolve (الفعل بالهمة), control over the world (التحكم في العالم), subjugation (القهر), and authority (السلطان). These are all Attributes of The Real (أوصاف الحق). Thus, they claim that these are the ones who, when seen, cause Allah to be remembered. This is the assertion of one who has no knowledge of these matters.\n\nThe intent of the Lawgiver (الشارع) is only what we have mentioned. As for that other assertion, control over the world through spiritual resolve (التحكم في العالم بالهمة) may be attained by one who has no weight or value with Allah, and he is not a Friend of Allah (ولي). The Prophet was asked about the Friends of Allah and answered with this statement. When asked, \"Who are the Friends of Allah?\" he replied, \"Those who, when they are seen, Allah is remembered.\"\n\nThis is because tribulations (البلايا) have crushed them and calamities (الرزايا) have encompassed them, yet they neither waver nor seek refuge in anyone other than Allah, content with what Allah has decreed for them and willed for them. When the common people see them exhibiting such patience, contentment (الرضي), and lack of complaint to creatures, the common people remember Allah and know that Allah has a special care (عناية) for them.\n\nAs for the possessors of effects (أصحاب الآثار), they may sometimes be Friends of Allah, but those creative effects (الآثار التكوينية) may also result from known balances (موازين معلومة) understood by us and by those who know the spiritual resolves (همم) of souls, their power, and the susceptibility of the world's bodies to them. Whoever has associated with the *Azzabiyya* and seen their lack of divine success (عدم التوفيق), despite their ability to kill, depose, and control through spiritual resolve (الهمة) due to the strength of their resolves—and also due to the properties of the Names (خواص الأسماء) inherent in the world, which produce creative effects for those who possess knowledge of them, even if that person is associating partners with Allah (مشركا بالله)—[knows that] influencing the cosmos is not exclusive to the Friends of Allah the Exalted. Therefore, nothing remains but what we have mentioned.",
    "ur": "## باب ایک سو بانوے: حال (الحال) کی معرفت میں\n\nحال (الحال) رحمن کی طرف سے عطا کردہ بخشش ہے،\nجو اس کی عنایت سے ملتی ہے، نہ کہ کسب یا طلب سے۔\n\nوصف کا بدل جانا اس پر دلیل ہے، لہٰذا تم ثبات پر قائم رہو،\nکیونکہ حال (الحال) پلٹ جاتا ہے۔\n\nاور یہ ہرگز نہ کہنا کہ حال (الحال) دائمی ہے،\nکیونکہ کچھ لوگ اس بات کی طرف گئے ہیں جو تم نے کہی ہے۔\n\nابو عقال ایک امام، سید اور سند تھے،\nحال (الحال) میں ان کے حال (الحال) میں تعجب تھا۔\n\nان پر یہ حال (الحال) سینکڑوں دنوں تک قائم رہا،\nجب تک کہ اس کے پردے نہ ہٹائے گئے۔\n\nاور اس کے قیام میں موسیٰ علیہ السلام کے میقات سے بھی زیادہ اضافہ ہوا،\nجیسا کہ کتب میں آیا ہے۔\n\n### [حال (الحال) وہ ہے جو قلب پر وارد ہوتا ہے]\n\nصوفیاء (الطائفۃ) کے نزدیک حال (الحال) وہ ہے جو قلب پر بغیر کسی کوشش یا کھینچ تان کے وارد ہوتا ہے، جس سے اس کے صاحب کی صفات بدل جاتی ہیں۔ اس کے دوام (دائمی ہونے) میں اختلاف کیا گیا ہے۔ بعض نے اس کے دوام کا قول کیا، اور بعض نے اس کے دوام سے منع کیا اور کہا کہ اس کی بقا صرف اس کے وجود کے وقت تک ہے، جیسا کہ متکلمین کے نزدیک عرض (عارضی صفت) کا معاملہ ہے۔ پھر اس کے بعد اس کی مثالیں (الأمثال) آتی ہیں، تو یہ گمان ہوتا ہے کہ وہ دائمی ہے، حالانکہ ایسا نہیں ہے۔ اور یہی صحیح قول ہے، لیکن یہ مثالیں اس طرح پے در پے آتی ہیں کہ ان کے درمیان کوئی ایسی چیز حائل نہیں ہوتی جو اسے اس حال (الحال) سے خارج کر دے۔\n\nچنانچہ بعض نے اسے حلول (حلول) سے لیا اور اس کے دوام کا قول کیا اور اسے ایک دائمی، نہ زائل ہونے والی صفت قرار دیا، اور کہا کہ جب وہ زائل ہو جائے تو وہ حال (الحال) نہیں رہتا۔ یہ ان لوگوں کا قول ہے جو اس کے دوام کے قائل ہیں۔ بعض نے کہا کہ اللہ نے مجھے چالیس سال سے کسی ایسے کام میں قائم نہیں کیا جسے میں نے ناپسند کیا ہو۔ امام نے کہا کہ اس نے دوامِ رضا (الرضی) کی طرف اشارہ کیا ہے، جو احوال (الأحوال) میں سے ہے۔ امام کا یہ قول ممکن ہے، لیکن طریقِ حق (طریق اللہ) میں یہ بعید ہے۔\n\nبلکہ اس سید کے قول کے بارے میں جو بات کہی جانی چاہیے وہ یہ ہے کہ چالیس سال تک اللہ نے اسے ظاہری یا باطنی طور پر کسی ایسے حال (الحال) میں قائم نہیں کیا جو شرعاً مذموم ہو، بلکہ اس کے اوقات ہمیشہ طاعات اور اللہ کی رضا والی چیزوں سے محفوظ رہے۔ اور میں ایک سچے شخص سے ملا جو صاحبِ حال (صاحب حال) تھے اور ابو یزید بسطامی کے قدم پر تھے، بلکہ ان کے شغل میں انہیں ادب کے ساتھ ناز کرنے کی گنجائش بھی تھی۔ انہوں نے ایک دن مجھ سے کہا: \"مجھے پچاس سال ہو گئے ہیں، میرے دل میں کوئی ایسا برا خیال (خاطر سوء) نہیں آیا جسے شریعت ناپسند کرتی ہو۔\" پس یہ ایک الٰہی عصمت ہے، لہٰذا اس سید کا کلام اسی قبیل سے ہوگا۔ اور احوال (الأحوال) عطیات ہیں، نہ کہ اکتسابات۔\n\n### [حال (الحال) الٰہی صفات میں سے ہے]\n\nجان لو کہ حال (الحال) ایک الٰہی صفت (نعت إلهی) ہے، اس کے افعال اور اپنی مخلوقات پر اس کی توجہات کے اعتبار سے، اگرچہ عینِ واحد (واحد العین) میں اس پر کوئی زائد چیز معقول نہیں ہے۔ اللہ تعالیٰ نے اپنے بارے میں فرمایا:\n**كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ**\n(ہر دن وہ ایک نئی شان (شأن) میں ہوتا ہے) [الرحمن: ۲۹]۔\nاور دنوں میں سب سے چھوٹا وہ فردی زمانہ ہے جو تقسیم قبول نہیں کرتا۔ پس وہ اس میں اتنی شانوں (شئون) میں ہوتا ہے جتنے کہ عالم کے وہ اجزاء وجود میں ہیں جن میں سے ہر جزو اس شرط کے ساتھ غیر منقسم ہے۔ پس وہ عالم کے ہر جزو کے ساتھ ایک شان (شأن) میں ہوتا ہے، اس طرح کہ وہ اس میں وہ چیز پیدا کرتا ہے جو اسے باقی رکھتی ہے، علاوہ اس کے جو وہ ہر فردی زمانے میں خود قائم ہونے والی چیزوں میں پیدا کرتا ہے۔ اور یہ شانیں (الشئون) مخلوقات کے احوال (الأحوال) ہیں، اور وہ ان احوال کے محل (المحال) ہیں کیونکہ یہ ان میں موجود ہوتے ہیں۔\n\nکیونکہ وہ ان میں ان شانوں (الشئون) کو ہمیشہ پیدا کرتا رہتا ہے۔ لہٰذا حال (الحال) کا دو زمانوں تک باقی رہنا درست نہیں، کیونکہ اگر وہ دو زمانوں تک باقی رہے تو جس پر وہ حال (الحال) باقی رہا، اس کے حق میں حق (الحق) خالق نہیں رہے گا اور نہ ہی وہ حق کا محتاج رہے گا، اور وہ اللہ سے بے نیازی کی صفت سے متصف ہو جائے گا، اور یہ محال ہے۔ اور جو چیز محال کی طرف لے جائے وہ محال ہے۔ اور یہ ان لوگوں کے قول کی طرح ہے جو کہتے ہیں کہ عرض (العرض) دو زمانوں تک باقی نہیں رہتا، اور یہی صحیح ہے۔ اور احوال (الأحوال) وہ اعراض (أعراض) ہیں جو اللہ کی طرف سے کائنات کو لاحق ہوتے ہیں، وہ انہیں ان میں پیدا کرتا ہے، اور انہیں اس شان (الشأن) سے تعبیر کیا گیا ہے جس میں وہ دنیا اور آخرت میں ہوتا ہے۔\n\nیہ احوال (الأحوال) کی وہ اصل ہے جس کی طرف الٰہیات میں رجوع کیا جاتا ہے۔ پس جب اللہ حال (الحال) کو پیدا کرتا ہے تو اس کے لیے کوئی محل (محل) نہیں ہوتا سوائے اس کے جس میں وہ اسے پیدا کرتا ہے، پس وہ اپنے وجود کے زمانے میں اس میں حلول (حلول) کرتا ہے۔ اسی لیے جس نے اسے حلول (حلول) سے سمجھا، اس نے اسے محل میں نزول (النزول) سمجھا، اور یہ پایا گیا ہے۔\n\nپھر یہ کہ اس کی حقیقت میں یہ شامل نہیں کہ وہ دو زمانوں تک باقی رہے۔ لہٰذا ضروری ہے کہ وہ اپنے وجود کے دوسرے زمانے میں خود بخود معدوم ہو جائے، نہ کہ کسی فاعل کے ذریعے جو اس میں عدم (العدم) پیدا کرے۔ کیونکہ عدم (العدم) متاثر نہیں ہوتا، اس لیے کہ وہ کوئی وجودی شے نہیں ہے، اور نہ ہی کسی شرط کے معدوم ہونے سے یا کسی ضد کے ذریعے، کیونکہ ان سب میں محال پایا جاتا ہے۔ پس ضروری ہے کہ وہ خود بخود معدوم ہو جائے، یعنی اس کے وجود کے دوسرے زمانے میں عدم (العدم) اس کے لیے ایک لازمی حکم ہے۔ اور محل (المحل) کو اس کے بغیر، یا اس کی مثال (مثل) کے بغیر، یا اس کی ضد (ضد) کے بغیر بقا حاصل نہیں ہوتی۔ پس وہ ہر زمانے میں اپنی بقا کے لیے اپنے رب کا محتاج ہوتا ہے، تو وہ اس کے لیے مثالیں (الأمثال) یا اضداد (الأضداد) پیدا کرتا ہے۔\n\nپس جب وہ مثالیں (الأمثال) پیدا کرتا ہے تو یہ گمان ہوتا ہے کہ وہ پہلا حال (الحال) اپنی اصل پر باقی ہے، حالانکہ ایسا نہیں ہے۔ اور جب حق (الحق) ہر دن ایک شان (شأن) میں ہے، اور ہر شان ایک الٰہی توجہ سے ہے، اور حق (الحق) نے ہمیں اپنے بارے میں بتایا ہے کہ وہ صورتوں میں تبدیل ہوتا ہے، تو وہ ہر شان کو ایک الٰہی صورت کے ساتھ پیدا کرتا ہے۔ اسی لیے عالم حق (الحق) کی صورت پر ظاہر ہوا۔ اور اسی بنا پر ہم کہتے ہیں کہ حق (الحق) نے اپنے آپ کو جانا، پھر عالم کو جانا۔ اسی طرح جس نے حال (الحال) کو تحول (تبدیلی) اور استحالت (پلٹ جانے) سے سمجھا، اس نے عدمِ دوام (دائمی نہ ہونے) کا قول کیا۔ پس جب سے اللہ نے عالم کو پیدا کیا ہے، وہ آخرت میں لامتناہی طور پر وجود میں ایسے احوال (الأحوال) میں ہے جو اس پر پے در پے آتے رہتے ہیں، اور اللہ انہیں ہمیشہ ارادی توجہات کے ساتھ پیدا کرتا ہے، جن کے ساتھ حضرت (الحضرۃ) کا وہ کلمہ ہوتا ہے جسے \"کن\" (ہو جا) سے تعبیر کیا جاتا ہے۔ پس ارادہ (الإرادۃ) ہمیشہ متعلق رہتا ہے، اور وہی متوجہ ہوتا ہے، اور \"کن\" (ہو جا) ہمیشہ جاری رہتا ہے، اور تکوین (التکوین) ہمیشہ جاری رہتی ہے۔ حق (الحق) اور خلق (الخلق) کے اعتبار سے معاملہ بذاتِ خود ایسا ہی ہے۔\n\nاور کبھی وہ حال (الحال) کا اطلاق کرتے ہیں اور اس سے مراد بندے کا تکوین (التکوین) میں حق (الحق) کی صفت کے ساتھ ظاہر ہونا اور اس کی ہمت (ہمۃ) سے آثار کا وجود میں آنا لیتے ہیں، اور یہ اللہ سے مشابہت ہے جسے اخلاقِ الٰہیہ (التخلق بالأسماء) سے تعبیر کیا جاتا ہے، اور یہی وہ ہے جسے ہمارے زمانے کے لوگ آج حال (الحال) سے مراد لیتے ہیں۔ اور ہم اس کے قائل ہیں، لیکن ہم اس کے اثر کے قائل نہیں، بلکہ ہم کہتے ہیں کہ بندہ اس پر اس طرح متمکن ہوتا ہے کہ اگر وہ اس کا ظہور چاہے تو وہ اس کے ذریعے ظاہر ہو جائے، لیکن ادب اسے روکتا ہے، کیونکہ وہ اپنی عبودیت (عبودیتہ) کو متحقق کرنا چاہتا ہے اور اپنی عبادت (عبادتہ) میں مستور رہنا چاہتا ہے۔\n\nپس اس پر کسی امر کا انکار نہیں کیا جاتا، یہاں تک کہ جب وہ انتہائی ضعف کی حالت میں دیکھا جائے تو اسے دیکھ کر اللہ یاد آ جائے، تو وہ ہمارے نزدیک ولی اللہ (ولی اللہ) ہے، اور وہ کائنات میں رحمت ہوتا ہے۔ اور یہ نبی اکرم صلی اللہ علیہ وسلم کا اولیاء اللہ کے بارے میں قول ہے کہ \"وہ لوگ ہیں جنہیں دیکھ کر اللہ یاد آ جائے۔\" یہ ان کے بلاء پر صبر اور اللہ کی طرف سے ان کے لیے ظاہر ہونے والی آزمائش کی وجہ سے ہے، پس وہ اپنے احوال (أحوال) میں اللہ کے سوا کسی کے سامنے سر نہیں اٹھاتے ہیں۔ پس جب ان میں ایسی صفت دیکھی جاتی ہے تو اللہ یاد آتا ہے کہ اس نے انہیں اپنے لیے خاص کر لیا ہے۔\n\nاور جسے ہماری کہی ہوئی باتوں کا علم نہیں، وہ کہتا ہے کہ ولی (الولی) صاحبِ حال (صاحب الحال) جسے دیکھ کر اللہ یاد آ جائے، وہ ہے جسے ہمت (الہمۃ) کے ذریعے تکوین (التکوین) اور فعل حاصل ہو، اور جو عالم میں تصرف، قہر اور سلطنت رکھتا ہو۔ اور یہ سب حق (الحق) کی صفات ہیں۔ پس یہی وہ لوگ ہیں جنہیں دیکھ کر اللہ یاد آ جاتا ہے۔ اور یہ ان لوگوں کا قول ہے جنہیں امور کا علم نہیں، حالانکہ شارع کا مقصود وہی ہے جو ہم نے بیان کیا۔ اور رہا یہ دوسرا قول، تو عالم میں ہمت (الہمۃ) کے ذریعے تصرف اسے بھی حاصل ہو سکتا ہے جس کا اللہ کے نزدیک کوئی وزن اور کوئی قدر نہیں، اور وہ ولی (ولی) نہیں ہوتا۔\n\nدرحقیقت نبی اکرم صلی اللہ علیہ وسلم سے اولیاء اللہ کے بارے میں پوچھا گیا اور آپ نے اس کا جواب دیا، آپ سے کہا گیا: \"اولیاء اللہ کون ہیں؟\" تو آپ نے فرمایا: \"وہ جنہیں دیکھ کر اللہ یاد آ جائے۔\" اس لیے کہ مصیبتوں نے انہیں پیس ڈالا ہو اور آفتوں نے انہیں گھیر لیا ہو، پھر بھی وہ متزلزل نہیں ہوتے اور اللہ کے سوا کسی کی طرف رجوع نہیں کرتے، اس پر راضی رہتے ہیں جو اللہ نے ان پر جاری کیا اور ان کے لیے ارادہ کیا۔ پس جب عام لوگ انہیں اس طرح کے صبر، رضا (الرضی) اور مخلوق سے شکایت نہ کرنے کی حالت میں دیکھتے ہیں، تو عام لوگ اللہ کو یاد کرتے ہیں اور جان لیتے ہیں کہ اللہ کی ان پر خاص عنایت ہے۔ اور آثار (الآثار) والے لوگ ولی (أولیاء) ہو بھی سکتے ہیں، اور یہ تکوینی آثار (الآثار التکوینیۃ) ہمارے نزدیک اور ان لوگوں کے نزدیک جو نفوس کی ہمتوں (ہمم النفوس) کی قوت اور عالم کے اجسام کے ان سے متاثر ہونے کو جانتے ہیں، معلوم میزانوں کے مطابق بھی ہو سکتے ہیں۔\n\nاور جس نے عزابیہ (العزابیۃ) سے میل جول رکھا اور دیکھا کہ وہ عدمِ توفیق پر ہیں، باوجود اس کے کہ وہ اپنی ہمت (الہمۃ) کی قوت کی وجہ سے قتل کرتے ہیں، معزول کرتے ہیں اور تصرف کرتے ہیں۔ اور نیز، عالم میں اسماء (الأسماء) کی وہ خواص بھی ہیں جن سے تکوینی آثار (الآثار التکوینیات) ظاہر ہوتے ہیں، ان لوگوں کے نزدیک جنہیں اس کا علم ہوتا ہے، باوجود اس کے کہ وہ شخص اللہ کے ساتھ شرک کرنے والا ہو۔ لہٰذا، کائنات میں تاثیر پیدا کرنا اللہ تعالیٰ کے اولیاء (أولیاء اللہ) کی خصوصیات میں سے نہیں ہے۔ پس وہی باقی رہا جو ہم نے ذکر کیا۔",
    "fa": "## باب صد و نود و دوم در معرفت حال (الحال)\n\nحال (الحال) موهبتی است از بخشش‌های رحمان، *** از عنایتی که نه کسب است و نه طلب.\nتغییر وصف، برهان بر آن است، پس بر *** ثبات باش، زیرا حال (الحال) دگرگون می‌شود.\nو هرگز مگو که حال (الحال) دائمی است، *** زیرا قومی به آنچه گفتی رفته‌اند (معتقد شده‌اند).\nابوعقال، امامی، سیدی، و تکیه‌گاهی بود، *** که در حال (الحال) او شگفتی بود.\nحال بر او تا زمان بدر شدن (کامل شدن) *** صدها روز، بدون آنکه حجاب‌ها فرو افتند، دوام یافت.\nو مدت اقامت موسی (در میقات) *** بر صدها روز افزون شد، چنانکه کتب به آن آمده‌اند.\n\n### [حال (الحال) چیزی است که بر قلب وارد می‌شود]\n\nحال (الحال) نزد این طایفه (صوفیه) چیزی است که بدون تکلف و طلب بر قلب وارد می‌شود، و صفات صاحبش به واسطه‌ی آن تغییر می‌یابد. در دوام آن اختلاف شده است؛ برخی قائل به دوام آن هستند و برخی دوامش را منع کرده‌اند و گفته‌اند که بقایی جز زمان وجودش ندارد، مانند عَرَض نزد متکلمین. سپس امثال (نظایر) آن پی در پی می‌آیند و شخص گمان می‌کند که آن حال دائمی است، در حالی که چنین نیست و این قول صحیح است. اما این حالات پی در پی می‌آیند بدون آنکه چیزی در میان امثال فاصله شود که آن را از حال خارج سازد.\n\nپس برخی آن را از حلول (النزول) گرفته و قائل به دوامش شده‌اند و آن را صفتی دائمی و زوال‌ناپذیر دانسته‌اند، به طوری که اگر زائل شود، دیگر حال (الحال) نیست. این قول کسانی است که به دوام آن معتقدند. برخی گفته‌اند: «خداوند مرا چهل سال در کاری قرار نداد که آن را ناخوش بدارم.» امام (ابن عربی) می‌گوید: این اشاره به دوام رضایت (الرضی) است که از جمله‌ی احوال (الأحوال) است. این سخن امام محتمل است، اما در طریق خدا بعید است. آنچه شایسته است در مورد سخن این سید گفته شود این است که او چهل سال در ظاهر و باطن در حالی که شرعاً مذموم باشد، قرار نگرفت، بلکه اوقاتش همواره با طاعات و آنچه خدا را خشنود می‌سازد، محفوظ بوده است.\n\nو من شخصی راستگو و صاحب حال (الحال) را ملاقات کردم که بر قدم ابویزید بسطامی بود، بلکه در کار خود به حدی تمکن داشت که در ادب، ناز و دلال می‌نمود. روزی به من گفت: «پنجاه سال است که هیچ خاطر سوئی که شرع آن را ناپسند دارد، در نفس من خطور نکرده است.» این عصمت الهی است، و سخن آن سید نیز از این قبیل است. و احوال (الأحوال) موهبت‌هایی هستند نه کسب‌ها.\n\n### [حال (الحال) از جمله‌ی صفات الهی است]\n\nبدان که حال (الحال) صفتی الهی است از حیث افعال و توجهات او بر موجوداتش، اگرچه ذات او واحد است و در او زیاده‌ای (بر ذات) تصور نمی‌شود. خداوند متعال درباره‌ی خود می‌فرماید: «كُلَّ يَوْمٍ هُوَ في شَأْنٍ» (هر روز او در کاری است - سوره الرحمن، آیه ۲۹). و کوچک‌ترین روزها، زمان فردی است که تقسیم نمی‌پذیرد. پس او در آن (زمان فرد) در شئون (کارها) است به تعداد اجزای عالم که در وجود هستند و هر جزء از آن به این شرط تقسیم نمی‌پذیرد. پس او با هر جزء از عالم در شأنی است، به این صورت که در آن چیزی را خلق می‌کند که آن را باقی نگه می‌دارد، علاوه بر آنچه که در هر زمان فردی به خودی خود حادث می‌شود. و آن شئون، احوال (الأحوال) مخلوقات هستند و مخلوقات محل‌های وجود آن احوال در خود می‌باشند. زیرا خداوند دائماً آن شئون را در آن‌ها خلق می‌کند. بنابراین، بقای حال (الحال) در دو زمان صحیح نیست؛ زیرا اگر در دو زمان باقی بماند، حق (الحق) در حق کسی که حال بر او باقی مانده، خالق نخواهد بود و آن شخص نیازمند به او نخواهد بود و به صفت بی‌نیازی از خدا متصف می‌شد، و این محال است، و آنچه به محال بینجامد، محال است. و این مانند قول کسانی است که می‌گویند: عَرَض در دو زمان باقی نمی‌ماند، و این صحیح است.\n\nو احوال (الأحوال)، اعراضی هستند که از جانب خدا بر موجودات عارض می‌شوند و خداوند آن‌ها را در ایشان خلق می‌کند. این احوال با «شأن»ی که خداوند در آن است، در دنیا و آخرت تعبیر شده‌اند. این اصل احوال (الأحوال) است که در الهیات به آن بازگشت می‌شود. پس هنگامی که خداوند حال (الحال) را خلق می‌کند، محلی برای آن نیست مگر همان که در آن خلق می‌شود، و در زمان وجودش در آن حلول می‌کند. به همین دلیل است که کسی که آن را از حلول (النزول) در محل در نظر گرفته، آن را چنین دانسته است، و این حلول واقع شده است. سپس، از حقیقت حال این نیست که در دو زمان باقی بماند، پس ناگزیر است که در زمان دوم از زمان وجودش، به خودی خود معدوم شود. نه اینکه به واسطه‌ی فاعلی که عدم را در آن ایجاد کند، معدوم شود، زیرا عدم منفعل نمی‌شود چون شیء وجودی نیست، و نه به واسطه‌ی از بین رفتن شرط یا به واسطه‌ی ضد، زیرا در همه‌ی این‌ها محال وجود دارد. پس ناگزیر است که به خودی خود معدوم شود؛ یعنی عدم برای آن در زمان دوم از زمان وجودش، حکمی لازم است. و محل (مخلوق) بدون آن (حال)، یا مثل آن، یا ضد آن، بقایی ندارد. پس در هر زمان برای بقای خود به پروردگارش نیازمند است. پس خداوند برای او امثال یا اضداد را ایجاد می‌کند. هنگامی که امثال را ایجاد می‌کند، گمان می‌شود که آن حال اولی بر اصل خود باقی است، در حالی که چنین نیست.\n\nو چون حق (الحق) هر روز در شأنی است و هر شأنی از توجه الهی ناشی می‌شود، و حق (الحق) خود را به ما شناسانده که در صور (تجلیات) متحول می‌شود، پس هر شأنی را که خلق می‌کند، با صورتی الهی است. به همین دلیل است که عالم بر صورت حق (الحق) ظاهر شده است. و از اینجاست که می‌گوییم حق (الحق) خود را شناخت، پس عالم را شناخت. کسی که حال (الحال) را از تحول و استحاله (دگرگونی) در نظر گرفته، به همین دلیل قائل به عدم دوام شده است. پس عالم از زمانی که خداوند آن را خلق کرده تا بی‌نهایت در آخرت، همواره در احوالی است که پی در پی بر آن وارد می‌شود و خداوند دائماً آن‌ها را با توجهات ارادی که کلمه‌ی حضرت (الحضرة) که با «کُن» (باش) تعبیر می‌شود، همراه است، خلق می‌کند. پس اراده همواره متعلق است و او همواره متوجه است و «کُن» همواره هست و تکوین همواره هست. امر در نفس خود، حقاً و خلقاً، چنین است.\n\nو گاهی حال (الحال) را اطلاق می‌کنند و منظورشان ظهور بنده به صفت حق (الحق) در تکوین و وجود آثار از همت اوست، که همان تشبه به خداست که با «تخلق به اسماء» (متصف شدن به صفات الهی) تعبیر می‌شود. این همان چیزی است که اهل زمان ما امروز از حال (الحال) اراده می‌کنند. ما نیز به آن قائل هستیم، اما نه به اثر آن، بلکه می‌گوییم بنده از آن متمکن است، به طوری که اگر بخواهد ظهور کند، با آن ظاهر می‌شود، اما ادب او را باز می‌دارد، زیرا می‌خواهد به عبودیت خود تحقق یابد و با عبادت خود مستور بماند. پس هیچ امری بر او انکار نمی‌شود، به طوری که وقتی در نهایت ضعف دیده می‌شود، با دیدن او خدا یاد می‌شود. چنین کسی نزد ما ولیّ الله است و در هستی مایه‌ی رحمت است. و این قول پیامبر (صلی الله علیه و سلم) درباره‌ی اولیای خداست که: «آنان کسانی هستند که چون دیده شوند، خدا یاد می‌شود.»\n\n(این یاد خدا به سبب) صبرشان بر بلا و محنت آشکار الهی برای آن‌هاست. پس در احوال خود سرشان را برای غیر خدا بلند نمی‌کنند. هنگامی که چنین صفتی از آن‌ها دیده می‌شود، خدا یاد می‌شود به این دلیل که او آن‌ها را برای خود اختصاص داده است. و کسی که به آنچه گفتیم علم ندارد، می‌گوید: ولیّ صاحب حالی که چون دیده شود خدا یاد می‌شود، کسی است که تکوین و فعل با همت و تسلط بر عالم و قهر و سلطنت دارد، و این‌ها همه اوصاف حق (الحق) هستند. پس اینان کسانی هستند که چون دیده شوند، خدا یاد می‌شود. این قول کسی است که به امور علم ندارد، و مقصود شارع (پیامبر) همان است که ما ذکر کردیم. اما این قول دیگر (درباره‌ی تسلط بر عالم)، ممکن است تسلط بر عالم با همت را کسی به دست آورد که نزد خدا وزن و ارزشی ندارد و ولیّ نیست. بلکه از پیامبر (صلی الله علیه و سلم) سؤال شد و او در پاسخ به این سؤال درباره‌ی اولیای خدا فرمود: «اولیای خدا چه کسانی هستند؟» فرمود: «آنان که چون دیده شوند، خدا یاد می‌شود.»\n\n(این یاد خدا به سبب آن است) که بلاها آن‌ها را در هم کوبیده و مصیبت‌ها آن‌ها را فرا گرفته است، اما متزلزل نمی‌شوند و به غیر خدا پناه نمی‌برند، و به آنچه خدا در حقشان جاری کرده و برایشان خواسته، راضی هستند. پس هنگامی که مردم عادی چنین صبر و رضایت و عدم شکایت به مخلوق را از آن‌ها می‌بینند، خدا را یاد می‌کنند و می‌دانند که خداوند به آن‌ها عنایت دارد. و صاحبان آثار (کسانی که قدرت تکوینی دارند) ممکن است ولیّ باشند، و ممکن است آن آثار تکوینی از موازین معلومی نزد ما و نزد کسی که همت‌های نفوس و قوت آن‌ها و انفعال اجرام عالم نسبت به آن‌ها را می‌شناسد، ناشی شود. و کسی که با عزابیه (گروهی از صوفیان) معاشرت کرده و دیده است که آن‌ها با وجود عدم توفیق، به واسطه‌ی همت، می‌کشند و عزل می‌کنند و تسلط می‌یابند، به دلیل قوت همتشان (این را می‌داند). همچنین به دلیل خواص اسماء در عالم که آثار تکوینی از آن‌ها حاصل می‌شود، نزد کسی که علم آن را دارد، با وجود اینکه آن شخص ممکن است مشرک به خدا باشد. پس تأثیر در کون از خصائص اولیای الله تعالی نیست. بنابراین، جز آنچه ذکر کردیم، باقی نمی‌ماند."
  },
  "page_count": 2
}