{
  "id": 521,
  "title": {
    "ar": "الباب الأحد والعشرون وخمسمائة في معرفة حال قطب كان منزله وتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوى‏ واتَّقُونِ يا أُولِي الْأَلْبابِ",
    "en": "Chapter Five Hundred and Twenty-One: Concerning the knowledge of the spiritual state (حال) of a Pole (قطب) whose station (منزل) was: <<وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوى‏>> (And take provision, for indeed the best provision is piety), and <<وَاتَّقُونِ يَا أُولِي الْأَلْبَابِ>> (And fear Me, O people of understanding).",
    "ur": "باب پانچ سو اکیس: ایک قطب (Qutb) کے حال کی معرفت کے بارے میں جس کا منزل (Manzil) یہ تھا: \"اور زادِ راہ لو، پس بے شک بہترین زادِ راہ تقویٰ (Taqwā) ہے (وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوىٰ) اور اے صاحبانِ عقل و دانش! مجھ سے ڈرو (وَاتَّقُونِ يَا أُولِي الْأَلْبَابِ)۔\"",
    "fa": "باب پانصد و بیست و یکم در معرفت حال قطبی که منزل او بود: «و توشه برگیرید، که بهترین توشه پرهیزگاری است، و ای خردمندان، از من پروا کنید.» (وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَى وَاتَّقُونِ يَا أُولِي الْأَلْبَابِ)"
  },
  "content": {
    "ar": "## «الباب الأحد والعشرون وخمسمائة في معرفة حال قطب كان منزله وتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوى‏ واتَّقُونِ يا أُولِي الْأَلْبابِ»\n\n\n> اتقوا الله يا أولي الألباب *** من علوم علامها في تباب‏\n\n\n> لا تفكر في ذاته فهو جهل *** والتزم ما تراه خلف الباب‏\n\n\n> من نعوت تبدو به وصفات *** هن حجابها وعين الحجاب‏\n\n\n> ما دري من يقول بالفكر فيها *** إنها لا تنال بالألباب‏\n\n\n> فالذي قال إنه قد حواه *** لم يزل منه تائها في إياب‏\n\n\n### [التقوى يمنع العبد أن يسأل لغير الله‏]\n\n\nاعلم وفقنا الله وإياك أن مثل هذا قوله ولِباسُ التَّقْوى‏ ذلِكَ خَيْرٌ وهو الذي يواري من اللباس ما يستر ويمنع من الضرر وهو ما زاد على الريش فالتقوى في اللباس وفي الزاد ما يقي به الرجل وجهه عن السؤال غير الله وكذلك في اللباس ما يقي به الإنسان برد الهواء وحره ويكون سترا لعورته وهو قوله يُوارِي سَوْآتِكُمْ وليس إلا ما يسوءكم ما ينظر إليه منكم هذا الذكر جاء بلفظ الزاد وورد الأمر به فأعلمنا أنا قوم سفر نقطع المناهل بالأنفاس رِحْلَةَ الشِّتاءِ والصَّيْفِ لنطعم من جوع ونأمن من خوف لأنه ما زاد على وقايتك فما هو لك وما ليس لك لا تحمل ثقله فتتعب به وأقل التعب فيه حسابك على ما لا يحتاج إليه فلما ذا تحاسب عليه هذا لا يفعله عاقل ناصح لنفسه فما ثم عاقل لأنه ما ثم إلا من يمسك الفضل ويمنع البذل والمسافر وما له على قلة فإنه ما من منهلة يقطعها ولا مسافة إلا وقطاع الطريق على مدرجته من الجنة والناس ويدخل في الجنة الخواطر النفسية فتقطع بهذا المسافر عن معالي الأمور وأصغر المسافات وأقربها أشقها عليه وهو ما بين النفسين فمن كانت مسافاته أنفاسه كان في أشق سفر لكنه إذا سلم عظمت أرباحه وأمن الخسارة في تجارته فإنهم في سفر تجارة منجية من عذاب أليم بضائعهم الايمان والجهاد فالإيمان بضاعة تعم النفائس المضنون بها والجهاد يعم جميع ما جهزنا الله به من بضائع التكليف والرسل عليه السلام هم السماسرة في البيع والشراء والصحف والكتب المنزلة هي الوثائق المكتوبة بين البائع والمشتري وأخبر الله تعالى أنه اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ يعني إلا نفس الحيوانية هي التي اشتراها من النفوس الناطقة المكلفة بالإيمان وأَمْوالَهُمْ وهو شري البرنامج فالمشتري بالخيار عند حضور البضائع فإن وافقت ما في البرنامج مضى‏\nالبيع وصح الشراء وإن لم يوافق فالمشتري بالخيار إن شاء وإن شاء فإن هلك في سفره في الطريق كان في كيس البائع لا في كيس المشتري وهذا السوق نفاق إلا أن الطريق خطر جد الكثرة القطاع فيه فقطاع طريق السفر في المعقولات الشبه وقطاع طريق السفر في المشروعات التأويل لا سيما في المتشابهات ولا يخلو المسافر أن يكون في هذين الطريقين أو في أحدهما فمن لا تأويل له ولا شبهة فليس بمسافر بل هو في المنزل من أول قدم فيمر عليه المسافرون وهو ما يعرض الله عليه من أحوال عباده فهو كتاجر الدكان تأتيه البضائع من كل جانب كما هم أهل مكة تجبى إليهم ثَمَراتُ كُلِّ شَيْ‏ءٍ رِزْقاً من لدنه سبحانه وأَكْثَرَهُمْ لا يَعْلَمُونَ ذلك فتاجر الدكان لا يحتاج إلى زاد لأنه يسافر إليه ولا يسافر وليس إلا العارفون ترد عليهم الأنفاس ثم تخرج عنهم تلك الأنفاس فهي لهم كعرض المتاع على تاجر الدكان فيأخذ منها ما شاء ويترك ما شاء لأن الأنفاس قد ترد على العارف بما هو محمود وهي البضائع التي لا عيب فيها المثمنة خيار المتاع ونقاوته ومذموم وهي البضائع المعيبة التي نقص ما فيها من العيب ما كانت تستحقه من الثمن لو سلمت منه وهي البضائع الوخش شر المتاع فانظر أي تاجر تريد أن تكون ثم إن المسافرين من التجار الذين أمرهم الله بالزاد الذي لا يفضل عنهم بعد انقضاء سفرهم منه شي‏ء بل يكون على قدر المسافة فهم على ثلاثة أصناف صنف منهم يسافر برا وآخر يسافر بحرا وآخر يسافر برا وبحرا بحسب طريقه فمسافر البحر بين عدوين نفس الطريق وما فيه ومسافر البر ذو عدو واحد والجامع بينهما في سفره ذو ثلاثة أعداء فمسافر البحر أهل النظر في المعقولات ومن النظر في المعقولات النظر في المشروعات فهم بين عدو شبهة وهو عين البحر وبين عدو تأويل وهو العدو الذي يقطع في البحر ومسافر البر المقتصرون على الشرع خاصة وهم أهل الظاهر والمسافر الجامع بين البر والبحر هم أهل الله المحققون من الصوفية أصحاب الجمع والوجود والشهود وأعداؤهم ثلاثة عدو برهم صور التجلي وعدو بحرهم قصورهم على ما تجلى لهم أو تأويل ما تجلى لهم لا بد من ذلك فمن\n\n\nسلم من حكم التجلي الصوري ومن القصور الذي يناقض المزيد ومن التأويل فيما تجلى لهم فقد سلم من الأعداء وحمد طريقه وربحت تجارته وكان من المهتدين فهذا وأمثاله يعطيه هذا الذكر وهو ذكر الالتباس من أجل ذكر التقوى لما في ذلك من تخيل تقوى الله ولهذا أبان الله عن تلك التقوى ما هي وفصل بينها وبين تقوى الله فقال في تمام الآية واتَّقُونِ يا أُولِي الْأَلْبابِ وجعل المجاور لهم في تقوى الله لَيْسَ عَلَيْكُمْ جُناحٌ برفع الحرج والسؤال فيما تزودوه في سفرهم من التقوى فإنه فضل على تقوى الله فإن الأصل تقوى الله فقال لَيْسَ عَلَيْكُمْ جُناحٌ أَنْ تَبْتَغُوا فَضْلًا من رَبِّكُمْ وهو التجارة مع علمك بأنه زاد التقوى وهذا القدر كاف فإن المجال فيه واسع والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Twenty-One: Concerning the Knowledge of the State of a Pole [Qutb] Whose Station Was: <<And take provision, for indeed the best provision is piety [taqwa]>>, and <<Fear Me, O people of understanding [ulī al-albāb]>>\n\nFear Allah, O people of understanding [ulī al-albāb],\nFrom sciences whose knower is in ruin.\n\nDo not contemplate His Essence [Dhāt], for that is ignorance,\nBut adhere to what you see behind the veil [Bāb].\n\nOf attributes [Nu‘ūt] that appear through Him and qualities [Ṣifāt],\nThey are its veil [Ḥijāb] and the very essence of the veil.\n\nHe who speaks of them through mere thought has not known\nThat they are not attained by intellects [Albāb].\n\nSo he who claimed that he encompassed Him\nRemains lost from Him, even in return.\n\n### [Piety [Taqwa] prevents the servant from asking other than Allah]\n\nKnow—may Allah grant us and you success—that the like of this is His saying: <<And the garment of piety [taqwa], that is better>> [Quran 7:26]. This garment is that which covers what conceals and prevents harm, and it is what is in addition to the plumage. Thus, piety [taqwa] in clothing, and in provision [Zād], is that by which a man protects his face from asking other than Allah. Likewise, in clothing, it is what protects the human from the cold and heat of the air, and serves as a covering for his nakedness, which is His saying: <<It covers your private parts [saw’ātikum]>> [Quran 7:26]. And this is nothing but what displeases you when it is looked upon by others.\n\nThis mention came with the word provision [Zād], and the command for it was given. Thus, He informed us that we are a people of travel, traversing the stages [manāhil] by breaths [anfās], the <<journey of winter and summer>> [Quran 106:2], so that we may be fed from hunger and secured from fear. Because whatever exceeds your protection is not yours. And what is not yours, do not carry its weight and become weary by it. The least of the weariness in this is your accountability for what is not needed. Why then should you be held accountable for it? No rational person [‘āqil] who advises himself would do this.\n\nThere is no rational person there, because there is none there except he who withholds the surplus and prevents giving. The traveler, despite his meager possessions, traverses no stage and no distance without highwaymen [quṭṭā‘ al-ṭarīq] being on his path, whether from the Jinn or from humans. And into the Jinn enter the psychic thoughts [khawāṭir nafsiyya], which thereby cut off the traveler from lofty matters. The smallest and nearest of distances is the most difficult for him, which is the distance between the two souls [nafsayn]. So, whoever has his breaths [anfās] as his distances is on the most arduous journey. But if he is safe, his profits are great, and he is secure from loss in his trade.\n\nFor they are on a journey of trade that saves from a painful punishment. Their merchandise is faith [īmān] and striving [jihād]. Faith is merchandise that encompasses the precious things that are guarded jealously, and striving encompasses all the merchandise of obligation [taklīf] with which Allah has equipped us. And the Messengers, peace be upon them, are the brokers [samāsira] in the buying and selling. The scriptures and revealed Books are the written documents between the Seller and the Buyer. And Allah Almighty informed us that He <<has purchased from the believers their souls [anfusahum]>> [Quran 9:111]—meaning, excluding the animal soul [nafs al-ḥayawāniyya]; it is the rational souls [nufūs al-nāṭiqa] obligated by faith that He purchased—<<and their wealth [amwālahum]>>, which is the program of the Law [Sharī‘ al-Barnāmaj].\n\nThe Buyer has the option [khiyār] when the merchandise is presented. If it conforms to what is in the program, the sale proceeds and the purchase is valid. If it does not conform, the Buyer still has the option, if He wills, and if He wills [He accepts or rejects]. If the merchandise perishes on the journey, it is in the Seller's bag, not the Buyer's bag.\n\nThis market is profitable, but the path is extremely dangerous due to the multitude of highwaymen. The highwaymen of the journey in intellectual matters [ma‘qūlāt] are doubts [shubah], and the highwaymen of the journey in prescribed matters [mashrū‘āt] are interpretive readings [ta’wīl], especially concerning the ambiguous verses [mutashābihāt]. The traveler is inevitably on one of these two paths or both. But he who has neither interpretive readings nor doubts is not a traveler; rather, he is at the destination [manzil] from the very first step. Travelers pass by him, and this is what Allah presents to him concerning the states of His servants.\n\nHe is like the shopkeeper to whom merchandise comes from every direction, just as the people of Mecca, to whom <<the fruits of every kind are gathered, as a provision [rizqan]>> [Quran 28:57] from His Presence, glory be to Him, though <<most of them do not know>> that. The shopkeeper does not need provision [Zād] because the journey is made to him, and he does not travel. These are none other than the Gnostics [‘Ārifūn]. The breaths [anfās] come to them, and then those breaths depart from them. They are like the display of goods to the shopkeeper, who takes what he wills and leaves what he wills. Because the breaths may come to the Gnostic with what is praiseworthy—which is the flawless, valuable merchandise, the best and purest of goods—or with what is blameworthy—which is the defective merchandise whose flaw reduces the price it would have deserved had it been sound; this is the inferior, worst of goods. So, consider which type of merchant you wish to be.\n\nFurthermore, the traveling merchants whom Allah commanded to take provision [Zād]—provision of which nothing remains after the completion of their journey, but is exactly commensurate with the distance—are of three types: one type travels by land, another travels by sea, and another travels by both land and sea, according to his path. The sea traveler is between two enemies: the path itself and what is in it. The land traveler has one enemy. And the one who combines both in his journey has three enemies.\n\nThe sea travelers are the people of speculation in intellectual matters [ma‘qūlāt], and included in speculation in intellectual matters is speculation in prescribed matters [mashrū‘āt]. They are between the enemy of doubt [shubha], which is the sea itself, and the enemy of interpretive reading [ta’wīl], which is the enemy that cuts off the path in the sea. The land travelers are those who restrict themselves solely to the Law [Shar‘], and they are the people of the apparent [Ahl al-Ẓāhir]. The traveler who combines land and sea are the verified People of Allah [Ahl Allāh] among the Sufis, the masters of Gathering [Jam‘], Being [Wujūd], and Witnessing [Shuhūd]. Their enemies are three: the enemy of their land is the forms of Theophany [ṣuwar al-Tajallī]; and the enemy of their sea is their limitation [quṣūr] to what has been disclosed to them, or their interpretive reading [ta’wīl] of what has been disclosed to them—this is inevitable.\n\nSo, whoever is safe from the judgment of the formal Theophany [al-Tajallī al-ṣūrī], and from the limitation that contradicts increase, and from interpretive reading concerning what has been disclosed to them, has been saved from the enemies, his path is praiseworthy, his trade has profited, and he is among the guided.\n\nThis and its like is granted by this mention, which is the mention of ambiguity [iltibās] because of the mention of piety [taqwa], due to the imagination of the fear of Allah [taqwa Allāh] contained therein. For this reason, Allah clarified what that piety is and distinguished it from the fear of Allah, saying at the end of the verse: <<And fear Me, O people of understanding [ulī al-albāb]>>. And He made adjacent to their fear of Allah the phrase <<There is no blame upon you>> [Quran 2:198], lifting the constraint and the question regarding what they take as provision [Zād] in their journey of piety, for this is a bounty [faḍl] beyond the fear of Allah, since the foundation is the fear of Allah. So He said: <<There is no blame upon you that you seek bounty [faḍlan] from your Lord>> [Quran 2:198], which is the trade, even while knowing that it is the provision of piety. This much is sufficient, for the field is vast. And <<Allah speaks the Truth, and He guides to the way>> [Quran 33:4].",
    "ur": "باب نمبر پانچ سو اکیس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور زادِ راہ لے لو، پس بہترین زادِ راہ تقویٰ ہے، اور اے عقل والو! مجھ سے ڈرو۔\" (قرآن ۲:۱۹۷)\n\nاللہ سے ڈرو اے عقل والو،\nان علوم سے جن کا جاننے والا تباہی میں ہے۔\nاس کی ذات میں غور نہ کرو، کیونکہ یہ جہالت ہے،\nاور اس چیز کو لازم پکڑو جسے تم دروازے کے پیچھے دیکھتے ہو۔\nان صفات اور نعتوں میں سے جو اس کے ذریعے ظاہر ہوتی ہیں،\nوہ اس کا حجاب بھی ہیں اور عین حجاب بھی۔\nجس نے ان میں فکر کے ذریعے بات کی، وہ نہیں جانتا\nکہ یہ عقلوں کے ذریعے حاصل نہیں ہوتیں۔\nپس جس نے کہا کہ اس نے اسے گھیر لیا ہے،\nوہ ہمیشہ اس سے واپسی میں بھٹکتا رہا۔\n\n### [تقویٰ بندے کو غیر اللہ سے سوال کرنے سے روکتا ہے]\n\nجان لو، اللہ ہمیں اور تمہیں توفیق دے، کہ اس (قطب) کا قول اس آیت کی مانند ہے: \"اور تقویٰ کا لباس، وہ سب سے بہتر ہے۔\" (قرآن ۷:۲۶) اور یہ وہ لباس ہے جو ستر کو چھپاتا ہے اور نقصان سے بچاتا ہے، اور یہ وہ ہے جو پروں (ریش) سے زیادہ ہے۔ پس لباس میں تقویٰ اور زادِ راہ میں تقویٰ وہ ہے جس کے ذریعے آدمی غیر اللہ سے سوال کرنے سے اپنا چہرہ بچاتا ہے۔ اسی طرح لباس میں تقویٰ وہ ہے جس کے ذریعے انسان ہوا کی سردی اور گرمی سے بچتا ہے اور اس کی شرمگاہ کو چھپاتا ہے، اور یہ اللہ کا قول ہے: \"تمہاری شرمگاہوں کو چھپاتا ہے۔\" (قرآن ۷:۲۶) اور یہ صرف وہ چیز ہے جس کا تم میں سے دیکھا جانا تمہیں ناگوار گزرتا ہے۔\n\nیہ ذکر زادِ راہ کے لفظ کے ساتھ آیا ہے اور اس کا حکم وارد ہوا ہے، پس اس نے ہمیں آگاہ کیا کہ ہم سفر کرنے والی قوم ہیں جو سانسوں کے ذریعے منزلیں طے کرتے ہیں، \"سردی اور گرمی کا سفر\" (قرآن ۱۰۶:۲) تاکہ ہم بھوک سے کھائیں اور خوف سے امن پائیں۔ کیونکہ جو چیز تمہاری حفاظت سے زیادہ ہے، وہ تمہاری نہیں ہے، اور جو تمہاری نہیں ہے، اس کا بوجھ مت اٹھاؤ کہ اس سے تھک جاؤ۔ اور اس میں سب سے کم تھکاوٹ یہ ہے کہ تم اس چیز کا حساب دو جس کی تمہیں ضرورت نہیں ہے۔ تو تم اس کا حساب کیوں دیتے ہو؟ یہ کام کوئی عاقل جو اپنی ذات کا خیر خواہ ہو، نہیں کرتا۔ پس وہاں کوئی عاقل نہیں ہے، کیونکہ وہاں صرف وہی ہے جو فضل کو روکتا ہے اور بخشش سے منع کرتا ہے۔\n\nمسافر اور اس کا مال قلت پر ہوتا ہے، کیونکہ وہ کوئی منزل یا مسافت طے نہیں کرتا مگر یہ کہ اس کے راستے پر جنوں اور انسانوں میں سے راہزن موجود ہوتے ہیں۔ اور نفسانی خیالات (الخواطر النفسية) بھی راہزنوں میں داخل ہیں، جو اس مسافر کو بلند امور سے کاٹ دیتے ہیں۔ اور سب سے چھوٹی اور قریب ترین مسافت اس پر سب سے زیادہ شاق ہے، اور وہ دو سانسوں کے درمیان کی مسافت ہے۔ پس جس کی مسافتیں اس کی سانسیں ہوں، وہ سب سے مشکل سفر میں ہوتا ہے، لیکن جب وہ سلامت رہتا ہے تو اس کے منافع عظیم ہو جاتے ہیں اور وہ اپنی تجارت میں خسارے سے محفوظ ہو جاتا ہے۔\n\nکیونکہ وہ ایک ایسی تجارتی سفر میں ہیں جو انہیں دردناک عذاب سے نجات دلاتا ہے، ان کا سامانِ تجارت ایمان اور جہاد ہے۔ پس ایمان وہ سامان ہے جو ان نفیس اور قیمتی چیزوں کو شامل ہے جنہیں چھپا کر رکھا جاتا ہے، اور جہاد ان تمام چیزوں کو شامل ہے جن سے اللہ نے ہمیں تکالیف (التکلیف) کے سامان کے طور پر لیس کیا ہے۔ اور رسول (علیہم السلام) خرید و فروخت میں دلال (سماسرة) ہیں، اور صحیفے اور نازل شدہ کتابیں بیچنے والے اور خریدار کے درمیان لکھی ہوئی دستاویزات ہیں۔\n\nاور اللہ تعالیٰ نے خبر دی کہ اس نے \"مؤمنوں سے ان کی جانوں کو خرید لیا\" (قرآن ۹:۱۱۱)، یعنی حیوانی نفس کے علاوہ، یہ وہ نفس ہے جسے اس نے ناطق اور مکلف نفوس سے ایمان کے بدلے خریدا ہے، \"اور ان کے مالوں کو\" (قرآن ۹:۱۱۱)، اور یہ پروگرام کی شرط ہے۔ پس خریدار کو سامان کی موجودگی پر اختیار ہوتا ہے، اگر وہ پروگرام کے مطابق ہو تو بیع جاری ہو جاتی ہے اور خریداری درست ہو جاتی ہے، اور اگر وہ موافق نہ ہو تو خریدار کو اختیار ہے، چاہے تو (قبول کرے) اور چاہے تو (رد کر دے)۔ اگر وہ اپنے سفر میں راستے میں ہلاک ہو جائے تو وہ بیچنے والے کی تھیلی میں ہوتا ہے نہ کہ خریدار کی تھیلی میں۔\n\nیہ بازار نفع بخش ہے، مگر راستہ بہت خطرناک ہے کیونکہ اس میں راہزنوں کی کثرت ہے۔ پس معقولات (المعقولات) میں سفر کے راہزن شبہات (الشبه) ہیں، اور مشروعات (المشروعات) میں سفر کے راہزن تاویل (التأویل) ہیں، خاص طور پر متشابہات میں۔ اور مسافر ان دونوں راستوں میں سے کسی ایک یا دونوں میں ہونے سے خالی نہیں ہوتا۔\n\nپس جس کے پاس نہ تاویل ہو اور نہ شبہہ، وہ مسافر نہیں ہے، بلکہ وہ پہلے قدم سے ہی منزل پر ہے۔ مسافر اس کے پاس سے گزرتے ہیں، اور یہ وہ ہے جو اللہ اپنے بندوں کے احوال میں اس پر ظاہر کرتا ہے۔ پس وہ دکان دار تاجر کی طرح ہے جس کے پاس ہر طرف سے سامان آتا ہے، جیسا کہ اہل مکہ ہیں جن کی طرف \"ہر چیز کے پھل رزق کے طور پر کھینچ کر لائے جاتے ہیں\" (قرآن ۲۸:۵۷) اس کی طرف سے، سبحانہ و تعالیٰ، اور \"ان میں سے اکثر نہیں جانتے\" (قرآن ۲۸:۵۷)۔\n\nپس دکان دار تاجر کو زادِ راہ کی ضرورت نہیں ہوتی کیونکہ سفر اس کی طرف آتا ہے اور وہ سفر نہیں کرتا۔ اور یہ صرف عارفین ہیں جن پر سانسیں وارد ہوتی ہیں، پھر وہ سانسیں ان سے نکل جاتی ہیں، پس وہ ان کے لیے دکان دار تاجر پر سامان پیش کرنے کی مانند ہیں، وہ ان میں سے جو چاہے لے لیتا ہے اور جو چاہے چھوڑ دیتا ہے۔ کیونکہ سانسیں عارف پر اس حال میں وارد ہو سکتی ہیں جو محمود ہو، اور یہ وہ سامان ہے جس میں کوئی عیب نہیں، جو قیمتی، بہترین اور خالص مال ہے۔ اور مذموم بھی وارد ہو سکتی ہیں، اور یہ وہ عیب دار سامان ہے جس میں موجود عیب نے اس قیمت کو کم کر دیا جو وہ اس سے محفوظ رہنے کی صورت میں مستحق ہوتا، اور یہ گھٹیا سامان ہے جو بدترین مال ہے۔ پس دیکھو تم کون سا تاجر بننا چاہتے ہو۔\n\nپھر وہ مسافر تاجر جنہیں اللہ نے زادِ راہ کا حکم دیا ہے، وہ زادِ راہ جو ان کے سفر کے اختتام کے بعد ان سے کچھ بھی زیادہ نہ ہو، بلکہ مسافت کے مطابق ہو۔ وہ تین اقسام پر ہیں: ایک قسم خشکی میں سفر کرتی ہے، دوسری سمندر میں، اور تیسری اپنے راستے کے مطابق خشکی اور سمندر دونوں میں سفر کرتی ہے۔\n\nپس سمندر کا مسافر دو دشمنوں کے درمیان ہوتا ہے: خود راستہ اور جو کچھ اس میں ہے۔ اور خشکی کا مسافر ایک دشمن والا ہوتا ہے۔ اور جو اپنے سفر میں دونوں کو جمع کرتا ہے، وہ تین دشمنوں والا ہوتا ہے۔\n\nسمندر کا مسافر معقولات (المعقولات) میں غور کرنے والے ہیں، اور معقولات میں غور کرنے میں مشروعات (المشروعات) میں غور کرنا شامل ہے۔ پس وہ دو دشمنوں کے درمیان ہیں: شبہہ کا دشمن جو عین سمندر ہے، اور تاویل کا دشمن جو سمندر میں راہزنی کرتا ہے۔\n\nاور خشکی کا مسافر وہ ہیں جو خاص طور پر شریعت پر اکتفا کرتے ہیں، اور وہ اہل ظاہر ہیں۔\n\nاور خشکی اور سمندر کو جمع کرنے والا مسافر صوفیاء میں سے اہل اللہ المحققون (تحقیق کرنے والے) ہیں، جو جمع، ہستی (الوجود)، اور شہود (الشہود) کے حامل ہیں۔ اور ان کے تین دشمن ہیں: ان کی خشکی کا دشمن ظہور الٰہی (التجلی) کی صورتیں (صور التجلی)، اور ان کے سمندر کا دشمن ان کا اس پر قُصور (کوتاہی) کرنا جو ان پر ظاہر ہوا، یا جو ان پر ظاہر ہوا اس کی تاویل کرنا، یہ ناگزیر ہے۔\n\nپس جو شخص ظاہری ظہور (التجلی الصوری) کے حکم سے، اور اس قُصور سے جو مزید (ترقی) کے منافی ہے، اور جو کچھ ان پر ظاہر ہوا اس کی تاویل سے محفوظ رہا، تو وہ دشمنوں سے محفوظ رہا، اس کا راستہ قابل تعریف ہوا، اس کی تجارت نفع بخش ہوئی، اور وہ ہدایت یافتہ لوگوں میں سے ہوا۔\n\nپس یہ اور اس جیسے احوال یہ ذکر عطا کرتا ہے، اور یہ تقویٰ کے ذکر کی وجہ سے التباس (الالتباس) کا ذکر ہے، کیونکہ اس میں تقویٰ اللہ کا تصور پایا جاتا ہے۔ اسی لیے اللہ نے واضح کیا کہ وہ تقویٰ کیا ہے اور اس کے اور تقویٰ اللہ کے درمیان فرق کیا، پس آیت کے آخر میں فرمایا: \"اور اے عقل والو! مجھ سے ڈرو۔\" (قرآن ۲:۱۹۷) اور اس نے تقویٰ اللہ میں ان کے پڑوس میں یہ بات رکھی: \"تم پر کوئی گناہ نہیں\" (قرآن ۲:۱۹۸) اس حرج اور سوال کو اٹھا کر جو انہوں نے اپنے سفر میں تقویٰ کے طور پر زادِ راہ لیا، کیونکہ یہ تقویٰ اللہ پر فضیلت ہے۔ اصل تو تقویٰ اللہ ہی ہے۔ پس فرمایا: \"تم پر کوئی گناہ نہیں کہ تم اپنے رب کا فضل تلاش کرو\" (قرآن ۲:۱۹۸)، اور یہ تجارت ہے، اس علم کے ساتھ کہ یہ زادِ تقویٰ ہے۔\n\nاور یہ مقدار کافی ہے، کیونکہ اس میں میدان وسیع ہے، اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "باب پانصد و بیست و یکم در معرفت حال قطبی که منزل او بود و [آیه] «و زاد برگیرید که بهترین زاد، پرهیزگاری است» (تَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوى‏) و [آیه] «و از من پروا کنید ای خردمندان» (واتَّقُونِ يا أُولِي الْأَلْبابِ).\n\nای خردمندان، از خدا پروا کنید\nاز علومی که دانای آن در هلاکت است\n\nدر ذات او نیندیشید که این جهل است\nو به آنچه پشت در می‌بینید، ملتزم باشید\n\nاز نعت‌ها و صفاتی که از او آشکار می‌شود\nکه آن‌ها حجاب او و عین (ذات) حجاب هستند\n\nکسی که می‌گوید با فکر به آن‌ها دست می‌یابد، ندانسته است\nکه آن‌ها با خردها (الألباب) به دست نمی‌آیند\n\nپس کسی که گفت او را در بر گرفته است\nپیوسته از او در بازگشت (ایاب) سرگردان بوده است\n\n[پرهیزگاری (التقوی) بنده را از درخواست از غیر خدا باز می‌دارد]\n\nبدان، خداوند ما و تو را توفیق دهد، که مَثَل این [سخن]، کلام اوست: «و لباس پرهیزگاری (التقوی)، آن بهتر است» (وَلِباسُ التَّقْوى‏ ذلِكَ خَيْرٌ). و آن لباسی است که می‌پوشاند و از ضرر جلوگیری می‌کند، و آن چیزی است که بر پر و بال (ریش) افزوده می‌شود. پس پرهیزگاری (التقوی) در لباس و در زاد، چیزی است که انسان با آن روی خود را از درخواست از غیر خدا حفظ می‌کند. همچنین در لباس، چیزی است که انسان را از سرمای هوا و گرمای آن حفظ می‌کند و پوششی برای عورت اوست، و این همان سخن اوست: «زشتی‌های شما را می‌پوشاند» (يُوارِي سَوْآتِكُمْ). و زشتی‌ها چیزی نیست جز آنچه از شما دیده شود و شما را ناخوش آید. این ذکر با لفظ زاد آمده و امر به آن وارد شده است، پس به ما خبر داده که ما قومی مسافریم که منزل‌ها را با نفس‌ها طی می‌کنیم، «سفر زمستان و تابستان» (رِحْلَةَ الشِّتاءِ والصَّيْفِ) تا از گرسنگی سیر شویم و از ترس ایمن گردیم. زیرا آنچه بر وقایه (حفاظت) تو افزوده شود، از آنِ تو نیست. و آنچه از آنِ تو نیست، سنگینی‌اش را بر دوش نکش تا به سبب آن خسته شوی. و کمترین خستگی در آن، حسابرسی تو بر چیزی است که به آن نیازی نیست. پس چرا باید بر آن حسابرسی کنی؟ این کار را هیچ عاقلی که خیرخواه نفس خود باشد، انجام نمی‌دهد. پس در آنجا عاقلی نیست، زیرا در آنجا نیست مگر کسی که فضل را نگه می‌دارد و بخشش را منع می‌کند. و مسافر با وجود کمی مالش، هیچ منزلی را طی نمی‌کند و هیچ مسافتی را نمی‌برد مگر اینکه راهزنان از جن و انس بر مسیر او هستند. و در جن، خواطر نفسانی (الخواطر النفسية) وارد می‌شوند و بدین وسیله این مسافر را از امور عالی باز می‌دارند. و کوچک‌ترین و نزدیک‌ترین مسافت‌ها، دشوارترین آن‌ها برای اوست، و آن فاصله میان دو نفس است. پس کسی که مسافت‌هایش همان نفس‌هایش باشد، در دشوارترین سفر است، اما اگر سالم بماند، سودهایش بزرگ می‌شود و از زیان در تجارتش ایمن می‌گردد. زیرا آنان در سفر تجارتی هستند که از عذاب دردناک نجات‌بخش است. کالاهایشان ایمان و جهاد است. پس ایمان کالایی است که نفایس گرانبها را در بر می‌گیرد، و جهاد شامل تمام کالاهای تکلیف است که خداوند ما را با آن‌ها تجهیز کرده است. و پیامبران (علیهم السلام) دلالان (سماسره) در خرید و فروش هستند، و صحیفه‌ها و کتاب‌های نازل شده، اسناد مکتوب بین فروشنده و خریدارند. و خداوند متعال خبر داده است که «از مؤمنان، جان‌هایشان را خریده است» (اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ)؛ یعنی جز نفس حیوانی، آن نفسی است که از نفوس ناطقه مکلّف به ایمان خریده است، و «اموالشان را» (وَأَمْوالَهُمْ) که همان شرح برنامه است. پس خریدار هنگام حضور کالاها اختیار دارد؛ اگر با آنچه در برنامه است موافقت کند، معامله انجام می‌شود و خرید صحیح است. و اگر موافقت نکند، خریدار مختار است که [معامله را فسخ کند]. و اگر در سفرش در راه هلاک شود، [ضرر] در کیسه فروشنده است نه در کیسه خریدار. این بازار، بازاری پررونق است، اما راه آن بسیار خطرناک است و راهزنان در آن بسیارند. راهزنان سفر در معقولات، شبهات هستند و راهزنان سفر در مشروعات، تأویل است، به ویژه در متشابهات. و مسافر از اینکه در این دو راه یا یکی از آن‌ها باشد، خالی نیست. پس کسی که نه تأویل دارد و نه شبهه، مسافر نیست، بلکه از همان قدم اول در منزل است و مسافران از کنار او می‌گذرند. و این همان چیزی است که خداوند از احوال بندگانش بر او عرضه می‌دارد. پس او مانند تاجر دکان است که کالاها از هر سو به او می‌رسد، همان‌گونه که برای اهل مکه «ثمرات هر چیزی به عنوان روزی» (ثَمَراتُ كُلِّ شَيْ‏ءٍ رِزْقاً) از جانب او سبحانه جمع‌آوری می‌شود، «و بیشترشان نمی‌دانند» (وَأَكْثَرَهُمْ لا يَعْلَمُونَ) این را. پس تاجر دکان نیازی به زاد ندارد، زیرا سفر به سوی او می‌آید و او سفر نمی‌کند. و اینان جز عارفان (العارفون) نیستند که نفس‌ها بر آن‌ها وارد می‌شود و سپس آن نفس‌ها از آن‌ها خارج می‌گردد. پس این نفس‌ها برای آن‌ها مانند عرضه کالا بر تاجر دکان است؛ هر چه را بخواهد برمی‌دارد و هر چه را بخواهد رها می‌کند. زیرا نفس‌ها ممکن است بر عارف با آنچه ستوده است وارد شوند، و آن‌ها کالاهایی هستند که عیبی ندارند، گرانبها، بهترین و خالص‌ترین کالاها. و [ممکن است با آنچه] نکوهیده است [وارد شوند]، و آن‌ها کالاهای معیوبی هستند که نقص عیبشان، بهای شایسته آن‌ها را اگر سالم بودند، کم کرده است، و آن‌ها کالاهای پست و بدترین متاع هستند. پس بنگر که می‌خواهی چه تاجری باشی. سپس مسافران از تجاری که خداوند آن‌ها را به زادی امر کرده که پس از پایان سفرشان چیزی از آن اضافه نیاید، بلکه به اندازه مسافت باشد، بر سه دسته‌اند: دسته‌ای از آن‌ها در خشکی سفر می‌کنند، و دسته‌ای دیگر در دریا، و دسته‌ای دیگر بسته به راهشان، در خشکی و دریا سفر می‌کنند. پس مسافر دریا میان دو دشمن است: خود راه و آنچه در آن است. و مسافر خشکی یک دشمن دارد. و کسی که در سفرش هر دو را جمع می‌کند، سه دشمن دارد. مسافر دریا، اهل نظر در معقولات هستند، و از نظر در معقولات، نظر در مشروعات [نیز هست]. پس آن‌ها میان دشمن شبهه که عین دریاست، و دشمن تأویل که دشمنی است که در دریا راه می‌زند، قرار دارند. و مسافر خشکی، کسانی هستند که تنها به شریعت اکتفا می‌کنند و آن‌ها اهل ظاهرند. و مسافر جامع میان خشکی و دریا، اهل الله محقق (المحققون) از صوفیه، صاحبان جمع و هستی (الوجود) و شهود (الشهود) هستند. و دشمنان آن‌ها سه تا هستند: دشمن خشکی آن‌ها، صور (اشکال) تجلی (التجلی) است، و دشمن دریای آن‌ها، قصور (کوتاهی) آن‌ها در آنچه بر ایشان تجلی (التجلی) کرده است، یا تأویل آنچه بر ایشان تجلی (التجلی) کرده است. این امر ناگزیر است. پس کسی که از حکم تجلی (التجلی) صوری و از قصوری که با فزونی (مزید) منافات دارد، و از تأویل در آنچه بر ایشان تجلی (التجلی) کرده است، سالم بماند، از دشمنان رهایی یافته و راهش ستوده و تجارتش سودمند بوده و از هدایت‌شدگان خواهد بود. پس این [باب] و امثال آن، این ذکر را به او می‌دهد، و آن ذکر التباس است به خاطر ذکر پرهیزگاری (التقوی)، به دلیل آنچه در آن از تخیل پرهیزگاری (التقوی) از خدا وجود دارد. و به همین دلیل، خداوند بیان کرد که آن پرهیزگاری (التقوی) چیست و میان آن و پرهیزگاری (التقوی) از خدا فرق گذاشت و در ادامه آیه فرمود: «و از من پروا کنید ای خردمندان» (واتَّقُونِ يا أُولِي الْأَلْبابِ). و آنچه را که در پرهیزگاری (التقوی) از خدا در کنار آن‌ها قرار داد، [این بود که فرمود:] «بر شما گناهی نیست» (لَيْسَ عَلَيْكُمْ جُناحٌ)؛ با رفع حرج و سؤال در مورد آنچه در سفرشان از پرهیزگاری (التقوی) زاد برداشته‌اند، زیرا آن [زاد] فضلی بر پرهیزگاری (التقوی) از خداست، چرا که اصل، پرهیزگاری (التقوی) از خداست. پس فرمود: «بر شما گناهی نیست که فضلی از پروردگارتان بجویید» (لَيْسَ عَلَيْكُمْ جُناحٌ أَنْ تَبْتَغُوا فَضْلًا من رَبِّكُمْ)، و آن تجارت است، با علم به اینکه آن زاد پرهیزگاری (التقوی) است. و این مقدار کافی است، زیرا میدان در آن وسیع است. و خداوند «حق را می‌گوید و او راه را می‌نمایاند» (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}