{
  "id": 411,
  "title": {
    "ar": "الباب الأحد عشر وأربعمائة في معرفة منازلة فيسبق عليه الكتاب فيدخل النار من حضرة كاد لا يدخل النار",
    "en": "Chapter Four Hundred and Eleven: Concerning the knowledge of his station, whereby the Decree (الكتاب) overtakes him, and he enters the Fire from a Presence (حضرة) that almost did not enter the Fire.",
    "ur": "باب چار سو گیارہ: اس کی منازل (Manāzil) کی معرفت (Ma'rifah) کے بیان میں، پس اس پر کتاب (الکتاب) سبقت لے جاتی ہے اور وہ اس حضرت (Ḥaḍra) سے دوزخ میں داخل ہوتا ہے جہاں وہ تقریباً دوزخ میں داخل نہیں ہوتا تھا۔",
    "fa": "باب چهارصد و یازدهم در معرفت منازل او، که کتاب (تقدیر) بر او پیشی می‌گیرد و از محضری که نزدیک بود وارد آتش (جهنم) نشود، وارد آن می‌شود."
  },
  "content": {
    "ar": "## «الباب الأحد عشر وأربعمائة في معرفة منازلة فيسبق عليه الكتاب فيدخل النار من حضرة كاد لا يدخل النار»\n\n\nفخافوا الكتاب ولا تخافوني فإني وإياكم على السواء في مثل هذا قال تعالى ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ لحكم الكتاب على الجميع وعليهم أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ فما أصعب الأمر عند العاقل الخبير\n\n\n> إن خوف الكتاب شر ذنوبي *** إذ له الحكم في الوجود وفينا\n\n\n> وقرأناه في الكتاب صريحا *** ورأيناه فيه حقا يقينا\n\n\n> لا يخاف الإله إلا لكون *** حادث منه حل بالعالمينا\n\n\n### [إن الرجل إذا عمل عمل أهل الجنة ليس بينه وبين الجنة إلا شبرا]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الصحيح عنه إن الرجل ليعمل بعمل أهل الجنة فيما يبدو للناس حتى ما يبقى بينه وبين الجنة إلا شبر فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخل النار وكذلك قال في أهل الجنة ثم قال وإنما الأعمال بالخواتيم وهي على حكم السوابق‏\n\n\nفلا يقضي الله قضاء إلا بما سبق الكتاب به أن يقضي فعلمه في الأشياء عين قوله في تكوينه فما يبدل القول لديه فلا حكم لخالق ولا مخلوق إلا بما سبق به الكتاب الإلهي ولذا قال وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ فما نجري عليهم إلا ما سبق به العلم ولا أحكم فيهم إلا بما سبق به فهذا موقف السواء الذي يوقف فيه العبد\n\n\n> إذا كان علم الحق في الحق يحكم *** ففي خلقه أحرى فمن يتحكم‏\n\n\n> وليس بمختار إذا كان هكذا *** فكل إلى سبق الكتاب مسلم‏\n\n\n> فما الخوف إلا من كتاب تقدمت *** له سور فينا وآي وأنجم‏\n\n\n> فلو كان مختارا أمناه أنه *** رءوف رحيم بالعباد وأرحم‏\n\n\n> وأخبر في البشرى برحمته التي *** يكون لها السبق الكريم المقدم‏\n\n\n> على غضب أبداه فعل عبيده *** يزول محمد الله عنه وعنهم‏\n> وليس كتابي غير ذاتي فافهموا *** فما مثله إياي فأفشوا واكتموا\n\n\nبَلِ الْإِنْسانُ عَلى‏ نَفْسِهِ بَصِيرَةٌ فانظر أيها الولي الحميم إلى ما يحوك في صدرك لا تنظر إلى العوارض فإنك بحسب ما يحوك فإن حاك الايمان فأنت مؤمن وإن حاك صرف ما وجب به الايمان إلى ما لا يقتضيه ظاهر الحكم فأنت بحسب ذلك وبه يختم لك ولا تنظر إلى ما يبدو للناس منك ولا تعول إلا على ما يحوك فإنه لا يحوك في صدرك إلا ما سبق في الكتاب أن يختم به لك إلا إن الناس في غفلة عما نبهتهم عليه ولا راد لأمره ولا مُعَقِّبَ لِحُكْمِهِ وذلك الذي يحوك في صدرك هو عين تجلى الأمر الذي لك وقسمك من الوجود الحق قال بعضهم في باب الورع ما رأيت شيئا أسهل علي من الورع كل ما حاك له شي‏ء في نفسي تركته يؤيده‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم دع ما يريبك إلى ما لا يريبك‏\n\n\nوقال استفت قلبك وإن أفتاك المفتون‏\n\n\n### [علم الله بالأشياء معدومها وموجودها وواجبها وممكنها ومحالها]\n\n\nواعلم أن الله تعالى ما كتب إلا ما علم ولا علم إلا ما شهد من صور المعلومات على ما هي عليه في أنفسها ما يتغير منها وما لا يتغير فيشهدها كلها في حال عدمها على تنوعات تغييراتها إلى ما لا يتناهى فلا يوجدها إلا كما هي عليه في نفسها فمن هنا تعلم علم الله بالأشياء معدومها وموجودها وواجبها وممكنها ومحالها فما ثم على ما قررناه كتاب يسبق إلا بإضافة الكتاب إلى ما يظهر به ذلك الشي‏ء في الوجود على ما شهده الحق في حال عدمه فهو سبق الكتاب على الحقيقة والكتاب سبق وجود ذلك الشي‏ء ويعلم ذوق ذلك من علم الكوائن قبل تكوينها فهي له مشهودة في حال عدمها ولا وجود لها فمن كان له ذلك علم معنى سبق الكتاب فلا يخف سبق الكتاب عليه وإنما يخاف نفسه فإنه ما سبق الكتاب عليه ولا العلم إلا بحسب ما كان هو عليه من الصورة التي ظهر في وجوده عليها فلم نفسك لا تعترض على الكتاب ومن هنا إن عقلت وصف الحق نفسه بأن له الحجة البالغة لو نوزع فإنه من المحال أن يتعلق العلم إلا بما هو المعلوم عليه في نفسه فلو أحتج أحد على الله بأن يقول له علمك سبق في بأن أكون على كذا فلم تؤاخذني يقول له الحق هل علمتك إلا بما أنت عليه فلو كنت على غير ذلك لعلمتك على ما تكون عليه ولذلك قال حتى نعلم فارجع إلى نفسك وأنصف في كلامك فإذا رجع العبد على نفسه ونظر في الأمر كما ذكرناه علم أنه محجوج وأن الحجة لله تعالى عليه أ ما سمعته تعالى يقول وما ظَلَمَهُمُ الله وما ظَلَمْناهُمْ وقال ولكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ كما قال ولكِنْ كانُوا هُمُ الظَّالِمِينَ يعني أنفسهم فإنهم ما ظهروا لنا حتى علمناهم وهم معدومون إلا بما ظهروا به في الوجود من الأحوال والعلم تابع للمعلوم ما هو المعلوم تابع للعلم فافهمه وهذه مسألة عظيمة دقيقة ما في علمي أن أحدا نبه عليها إلا إن كان وما وصل إلينا وما من أحد إذا تحققها يمكن له إنكارها وفرق يا أخي بين كون الشي‏ء موجودا فيتقدم العلم وجوده وبين كونه على هذه الصور في حال عدمه الأزلي له فهو مساوق للعلم الإلهي به ومتقدم عليه بالرتبة لأنه لذاته أعطاه العلم به فاعلم ما ذكرناه فإنه ينفعك ويقويك في باب التسليم والتفويض للقضاء والقدر الذي قصاه حالك ولو لم يكن في هذا الكتاب إلا هذه المسألة لكانت كافية لكل صاحب نظر سديد وعقل سليم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 411: Concerning the Knowledge of the Station of the One Whom the Decree Precedes, Causing Him to Enter the Fire from a State Where He Almost Did Not Enter It\n\nSo fear the Decree (الكتاب) and do not fear Me, for I and you are equal in a matter such as this. Allah the Exalted said: <<The Word is not changed with Me, nor am I unjust to the servants>> (Q 50:29). This is due to the ruling of the Decree upon everyone, including them. <<Is he then, against whom the word of punishment has been justified?>> (Q 39:19). How difficult is the matter for the intelligent and experienced person!\n\n> Indeed, the fear of the Decree is the worst of my sins,\n> Since it holds the ruling over Existence (الوجود) and over us.\n> We read it clearly in the Book,\n> And we saw it therein as certain Truth (حقاً يقينا).\n> The God (الإله) is not feared except for a state (كون)\n> That occurs from Him and settles upon the worlds.\n\n### [When a man performs the deeds of the people of Paradise, and there is but a span between him and Paradise]\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said in the authentic tradition concerning him: \"Indeed, a man performs the deeds of the people of Paradise, as it appears to people, until there remains but a span between him and Paradise, then the Decree (الكتاب) precedes him, so he performs the deeds of the people of the Fire and enters the Fire.\" And likewise, he spoke concerning the people of Paradise. Then he said, \"Verily, deeds are judged by their conclusions (الخواتيم), and these conclusions are subject to the ruling of the Precedences (السوابق).\"\n\nThus, Allah does not decree any decree except by what the Decree has already preceded concerning that decree. For His Knowledge (العلم) concerning things is the very essence (عين) of His Word in their creation (تكوينه). So the Word is not changed with Him. Therefore, there is no ruling for Creator nor creature except by what the Divine Decree (الكتاب الإلهي) has preceded. And for this reason, He said, <<Nor am I unjust to the servants>>. For We only execute upon them what the Knowledge has preceded, and I only rule concerning them by what has preceded. This is the station of equality (موقف السواء) where the servant is made to stand.\n\n> If the Knowledge of the Real (علم الحق) rules within the Real (الحق),\n> Then in His creation (خلقه) it is even more fitting; so who then controls?\n> And he is not one who chooses (مختار) if the matter is thus,\n> For everyone is surrendered (مسلم) to the precedence of the Decree.\n> The fear is only from a Decree that has preceded,\n> For which there are chapters, verses, and stars within us.\n> If he were one who chooses, we would trust that He\n> Is Compassionate, Merciful to the servants, and Most Merciful.\n> And He informed in the glad tidings of His Mercy (رحمته) which\n> Has the noble and foremost precedence (السبق الكريم المقدم),\n> Over a wrath manifested by the actions of His servants,\n> Which the praise of Allah (محمد الله) removes from Him and from them.\n> And My Decree (كتابي) is not other than My Essence (ذاتي), so understand!\n> For nothing resembles Me; so disclose and conceal!\n\n<<Nay, but man is a clear witness against himself>> (Q 75:14). Look, O intimate friend (الولي الحميم), at what is woven (يحوك) in your breast. Do not look at the incidental occurrences (العوارض). For you are according to what is woven. If faith (الايمان) is woven, then you are a believer. And if what is woven is the turning away of that by which faith is necessitated toward what the apparent ruling does not require, then you are according to that, and by it shall your life be sealed (يختم لك). Do not look at what appears from you to people, and rely only upon what is woven, for nothing is woven in your breast except what has preceded in the Decree (الكتاب) that your life shall be sealed by it. Except that people are heedless of what I have alerted them to. There is no repeller of His command, nor any reviewer of His judgment. And that which is woven in your breast is the very essence (عين) of the theophany (تجلى) of the matter appointed for you and your portion (قسمك) of the True Existence (الوجود الحق). Some of them said concerning the chapter of scrupulousness (الورع): \"I have not seen anything easier for me than scrupulousness; everything that caused doubt (حاك) in my soul, I abandoned it.\" This is supported by the saying of the Prophet, may Allah bless him and grant him peace: \"Leave that which causes you doubt for that which causes you no doubt.\" And he said: \"Consult your heart, even if the jurists (المفتون) give you a ruling.\"\n\n### [Allah's Knowledge (علم الله) of things: their non-existent, their existent, their necessary, their possible, and their impossible]\n\nKnow that Allah the Exalted did not decree (كتب) except what He Knew (علم). And He did not Know except what He witnessed of the forms of the known things (المعلومات) exactly as they are in themselves: that which changes among them and that which does not change. He witnesses all of them in their state of non-existence (عدمها), with the varieties of their changes extending to infinity. Thus, He does not bring them into existence (يوجدها) except exactly as they are in themselves. From this, you understand Allah's Knowledge of things: their non-existent, their existent, their necessary, their possible, and their impossible.\n\nTherefore, according to what we have established, there is no Decree (كتاب) that precedes, except by attributing the Decree to that by which the thing manifests in Existence (الوجود), according to what the Real (الحق) witnessed in its state of non-existence. This is the precedence of the Decree (سبق الكتاب) in reality, and the Decree precedes the existence of that thing. The taste (ذوق) of this is known by whoever knows the entities (الكوائن) before their formation (تكوينها). For they are witnessed by Him in their state of non-existence, having no existence. Whoever possesses this knowledge understands the meaning of the precedence of the Decree, and thus does not fear the precedence of the Decree upon him, but rather fears his own self. For neither the Decree nor the Knowledge (العلم) preceded him except according to the form (الصورة) he was upon, by which he appeared in his existence. So blame your own self, and do not object to the Decree.\n\nFrom this, if you understand, the Real describes Himself as possessing the conclusive argument (الحجة البالغة) if He were to be disputed. For it is impossible for Knowledge to relate to anything except what the known thing (المعلوم) is in itself. If someone were to argue against Allah, saying, \"Your Knowledge preceded that I would be such-and-such, so why do You hold me accountable?\" The Real would say to him, \"Did I know you except as you are? Had you been otherwise, I would have known you according to what you would be.\" And for this reason, He said, <<until We know>>. So return to your self and be fair in your speech.\n\nWhen the servant returns to his self and looks at the matter as we have mentioned, he knows that he is refuted (محجوج) and that the conclusive argument belongs to Allah the Exalted against him. Have you not heard Him the Exalted say, <<And Allah did not wrong them>> and <<We did not wrong them>> and He said, <<But they were wronging themselves>> (Q 16:33) just as He said, <<But they were the wrongdoers>> (Q 43:44), meaning their own selves? For they did not manifest to Us—even though We knew them while they were non-existent (معدومون)—except by the states (الأحوال) by which they manifested in Existence. And Knowledge follows the known thing, not the known thing following the Knowledge, so understand this!\n\nThis is a great and subtle matter (مسألة عظيمة دقيقة). To my knowledge, no one has drawn attention to it, unless they did and the information did not reach us. And there is no one who, having realized it, can deny it. And distinguish, O my brother, between a thing being existent, and Knowledge preceding its existence, and its being upon these forms in its eternal state of non-existence (عدمه الأزلي). For it is concomitant (مساوق) with the Divine Knowledge (العلم الإلهي) concerning it, yet preceding it in rank (الرتبة), because it is by its own Essence (لذاته) that it gave Him the Knowledge of it. So know what we have mentioned, for it will benefit you and strengthen you in the chapter of submission (التسليم) and entrustment (التفويض) to the Divine Decree and Destiny (القضاء والقدر) which your state has necessitated. Even if there were nothing in this book except this single issue, it would be sufficient for every person of sound insight and healthy intellect. <<And Allah speaks the Truth, and He guides to the way>> (Q 33:4).",
    "ur": "باب چار سو گیارہ: اس شخص کے مقام کی معرفت میں جس پر نوشتہ (الکتاب) سبقت لے جاتا ہے، پس وہ اس مقام سے جہنم میں داخل ہو جاتا ہے جہاں وہ تقریباً جہنم میں داخل نہیں ہونے والا تھا۔\n\nپس تم نوشتہ (الکتاب) سے ڈرو، مجھ سے نہ ڈرو، کیونکہ میں اور تم اس معاملے میں برابر ہیں۔ اللہ تعالیٰ فرماتا ہے:\nما يُبَدَّلُ الْقَوْلُ لَدَيَّ وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ (ق: 29)\n\"میرے ہاں بات بدلی نہیں جاتی اور میں بندوں پر ظلم کرنے والا نہیں ہوں۔\"\nکیونکہ نوشتہ (الکتاب) کا حکم سب پر اور ان پر بھی نافذ ہے۔\nأَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ (الزمر: 19)\n\"تو کیا وہ شخص جس پر عذاب کا فرمان ثابت ہو چکا ہے (اسے کوئی بچا سکتا ہے؟)\"\nپس دانا اور باخبر شخص کے نزدیک یہ معاملہ کتنا مشکل ہے۔\n\n> بے شک نوشتہ (الکتاب) کا خوف میرے گناہوں میں سب سے بڑا ہے\n>\n> کیونکہ اسی کا حکم ہستی (الوجود) میں اور ہم میں نافذ ہے۔\n>\n> اور ہم نے اسے نوشتہ (الکتاب) میں واضح طور پر پڑھا ہے\n>\n> اور ہم نے اسے اس میں حق اور یقین کے ساتھ دیکھا ہے۔\n>\n> اللہ سے خوف صرف اس لیے کیا جاتا ہے کہ\n>\n> کوئی ایسا حادثہ جو اس کی طرف سے ہو، جہانوں میں نازل ہو جائے۔\n\n### [جب کوئی شخص جنتیوں کا عمل کرتا ہے اور اس کے اور جنت کے درمیان صرف ایک بالشت کا فاصلہ رہ جاتا ہے]\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے صحیح حدیث میں فرمایا: \"بے شک ایک شخص لوگوں کی نظر میں جنتیوں کے سے عمل کرتا رہتا ہے، یہاں تک کہ اس کے اور جنت کے درمیان صرف ایک بالشت کا فاصلہ رہ جاتا ہے، پھر نوشتہ (الکتاب) اس پر سبقت لے جاتا ہے، پس وہ دوزخیوں کے سے عمل کرتا ہے اور دوزخ میں داخل ہو جاتا ہے۔\" اور اسی طرح آپ نے جنتیوں کے بارے میں فرمایا۔ پھر فرمایا: \"اور اعمال کا دار و مدار انجام پر ہے، اور یہ انجام سابقہ تقدیر (السوابق) کے حکم کے مطابق ہوتا ہے۔\"\n\nپس اللہ کوئی فیصلہ نہیں کرتا مگر اسی کے مطابق جو نوشتہ (الکتاب) میں پہلے سے لکھا جا چکا ہوتا ہے کہ وہ فیصلہ کرے گا۔ پس اشیاء کے بارے میں اس کا علم ہی ان کی تخلیق میں اس کا قول ہے۔ پس اس کے ہاں بات بدلی نہیں جاتی۔ پس خالق یا مخلوق کے لیے کوئی حکم نہیں مگر اسی کے مطابق جو الٰہی نوشتہ (الکتاب) میں پہلے سے موجود ہے۔ اور اسی لیے اس نے فرمایا: وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ \"اور میں بندوں پر ظلم کرنے والا نہیں ہوں۔\" پس ہم ان پر وہی جاری کرتے ہیں جو علم میں پہلے سے موجود ہے، اور میں ان کے بارے میں کوئی حکم نہیں دیتا مگر اسی کے مطابق جو پہلے سے موجود ہے۔ پس یہ برابری کا وہ مقام ہے جہاں بندے کو کھڑا کیا جاتا ہے۔\n\n> جب ذات حق (الحق) کا علم خود حق میں حکم کرتا ہے،\n>\n> تو اس کی مخلوق میں تو بدرجہ اولیٰ حکم کرے گا، پس کون ہے جو حکم چلا سکتا ہے؟\n>\n> اگر معاملہ ایسا ہے تو وہ (بندہ) مختار نہیں ہے،\n>\n> پس ہر کوئی نوشتہ (الکتاب) کی سبقت کے سامنے سر تسلیم خم کیے ہوئے ہے۔\n>\n> پس خوف صرف اس نوشتہ (الکتاب) سے ہے جو مقدم ہو چکا ہے،\n>\n> جس کی سورتیں، آیات اور ستارے ہم میں موجود ہیں۔\n>\n> اگر وہ (بندہ) مختار ہوتا تو ہم اسے امان دیتے کہ وہ\n>\n> بندوں پر رؤف، رحیم اور سب سے زیادہ رحم کرنے والا ہے۔\n>\n> اور اس نے خوشخبری میں اپنی اس رحمت کی خبر دی ہے،\n>\n> جسے سبقت اور کرم حاصل ہے اور جو مقدم ہے۔\n>\n> اس غضب پر جو اس کے بندوں کے فعل نے ظاہر کیا،\n>\n> اللہ کی حمد سے وہ غضب اس سے اور ان سے زائل ہو جاتا ہے۔\n>\n> اور میرا نوشتہ (الکتاب) میری ذات کے سوا کچھ نہیں، پس سمجھو۔\n>\n> پس اس کی مثال میں ہی ہوں، لہٰذا اسے ظاہر کرو اور چھپاؤ۔\n\nبَلِ الْإِنْسانُ عَلى‏ نَفْسِهِ بَصِيرَةٌ (القیامہ: 14)\n\"بلکہ انسان اپنے نفس پر خود گواہ ہے۔\"\nپس اے میرے قریبی ولی! اس چیز کو دیکھو جو تمہارے سینے میں کھٹکتی ہے۔ عارضی چیزوں کو نہ دیکھو، کیونکہ تم اسی کے مطابق ہو جو کھٹکتا ہے۔ اگر ایمان کھٹکتا ہے تو تم مؤمن ہو، اور اگر وہ چیز کھٹکتی ہے جو ایمان کو اس طرف پھیر دے جس کا ظاہری حکم تقاضا نہیں کرتا، تو تم اسی کے مطابق ہو۔ اور اسی پر تمہارا خاتمہ ہوگا۔ لوگوں کو تم سے جو کچھ ظاہر ہوتا ہے اسے نہ دیکھو، اور صرف اسی پر بھروسہ کرو جو تمہارے سینے میں کھٹکتا ہے، کیونکہ تمہارے سینے میں وہی کھٹکتا ہے جو نوشتہ (الکتاب) میں تمہارے لیے خاتمے کے طور پر پہلے سے لکھا جا چکا ہے۔ مگر لوگ اس چیز سے غفلت میں ہیں جس پر میں نے انہیں متنبہ کیا ہے۔ اور اس کے حکم کو کوئی رد کرنے والا نہیں اور نہ کوئی اس کے فیصلے کو بدلنے والا ہے۔ اور وہ چیز جو تمہارے سینے میں کھٹکتی ہے، وہ عین اس امر کا ظہور (التجلی) ہے جو تمہارے لیے ہے اور ہستی حق (الوجود الحق) میں تمہارا حصہ ہے۔ بعض نے ورع (پرہیزگاری) کے باب میں کہا: \"میں نے ورع سے زیادہ آسان کوئی چیز نہیں دیکھی، جب بھی میرے دل میں کوئی چیز کھٹکی، میں نے اسے چھوڑ دیا۔\" اس کی تائید نبی صَلَّى اللهُ عَليهِ وسَلَّم کے اس قول سے ہوتی ہے:\nدع ما يريبك إلى ما لا يريبك‏\n\"اس چیز کو چھوڑ دو جو تمہیں شک میں ڈالے، اور اسے اختیار کرو جو تمہیں شک میں نہ ڈالے۔\"\nاور فرمایا:\nاستفت قلبك وإن أفتاك المفتون‏\n\"اپنے دل سے فتویٰ لو، اگرچہ مفتی تمہیں فتویٰ دے چکے ہوں۔\"\n\n### [اللہ کا اشیاء کے بارے میں علم، ان کے معدوم، موجود، واجب، ممکن اور محال ہونے کی حالت میں]\n\nاور جان لو کہ اللہ تعالیٰ نے وہی لکھا جو اس نے جانا، اور اس نے وہی جانا جو اس نے معلومات کی صورتوں میں دیکھا، جیسا کہ وہ اپنی ذات میں ہیں۔ ان میں سے جو بدلتی ہیں اور جو نہیں بدلتیں۔ پس وہ ان سب کو ان کے عدم (معدوم) کی حالت میں، ان کی لامتناہی تبدیلیوں کے تنوعات کے ساتھ دیکھتا ہے۔ پس وہ انہیں وجود (الوجود) میں نہیں لاتا مگر اسی طرح جیسے وہ اپنی ذات میں ہیں۔ پس یہاں سے تم اشیاء کے بارے میں اللہ کا علم، ان کے معدوم، موجود، واجب، ممکن اور محال ہونے کی حالت میں جانتے ہو۔ پس جو کچھ ہم نے طے کیا ہے، اس کے مطابق کوئی نوشتہ (الکتاب) سبقت نہیں لے جاتا مگر اس نوشتہ (الکتاب) کو اس چیز کی طرف منسوب کرنے سے جو وجود (الوجود) میں اس صورت پر ظاہر ہوتی ہے جسے ذات حق (الحق) نے اس کے عدم کی حالت میں دیکھا تھا۔ پس حقیقت میں یہ نوشتہ (الکتاب) کی سبقت ہے، اور نوشتہ (الکتاب) اس چیز کے وجود پر سبقت رکھتا ہے۔ اس کا ذوق وہی جانتا ہے جو مخلوقات (الکوائن) کو ان کی تخلیق سے پہلے جانتا ہے۔ پس وہ مخلوقات اس کے لیے ان کے عدم کی حالت میں مشہود ہیں، حالانکہ ان کا کوئی وجود نہیں ہے۔ پس جسے یہ حاصل ہو، وہ نوشتہ (الکتاب) کی سبقت کا معنی جانتا ہے، پس وہ نوشتہ (الکتاب) کی سبقت سے نہیں ڈرتا، بلکہ صرف اپنے نفس سے ڈرتا ہے۔ کیونکہ نوشتہ (الکتاب) یا علم نے اس پر سبقت نہیں لی مگر اسی صورت کے مطابق جو وہ تھا، جس پر وہ اپنے وجود (الوجود) میں ظاہر ہوا۔ پس اپنے نفس کو ملامت کرو، نوشتہ (الکتاب) پر اعتراض نہ کرو۔\n\nاور اگر تم نے یہ سمجھ لیا تو تم ذات حق (الحق) کے اس وصف کو سمجھو گے کہ اگر اس سے جھگڑا کیا جائے تو اس کے پاس کامل دلیل (الحجۃ البالغۃ) ہے۔ کیونکہ یہ محال ہے کہ علم کا تعلق اس چیز سے نہ ہو جس پر معلوم اپنی ذات میں ہے۔ پس اگر کوئی اللہ پر یہ دلیل لائے کہ \"تیرا علم مجھ پر اس طرح ہونے میں سبقت لے گیا، تو پھر تو مجھے کیوں مؤاخذہ کرتا ہے؟\" تو ذات حق (الحق) اسے فرمائے گا: \"کیا میں نے تجھے اسی طرح نہیں جانا جس طرح تو ہے؟ اگر تو اس کے علاوہ کسی اور حالت پر ہوتا تو میں تجھے اسی طرح جانتا جس طرح تو ہوتا۔\" اور اسی لیے اس نے فرمایا: \"یہاں تک کہ ہم جان لیں۔\" پس اپنے نفس کی طرف رجوع کرو اور اپنی بات میں انصاف کرو۔ پس جب بندہ اپنے نفس کی طرف رجوع کرتا ہے اور معاملے کو اس طرح دیکھتا ہے جیسا کہ ہم نے ذکر کیا، تو وہ جان لیتا ہے کہ اس پر دلیل قائم ہو چکی ہے اور دلیل اللہ تعالیٰ کی ہے اس کے خلاف۔ کیا تم نے اسے یہ فرماتے ہوئے نہیں سنا: وما ظَلَمَهُمُ الله وما ظَلَمْناهُمْ \"اور اللہ نے ان پر ظلم نہیں کیا\" اور \"اور ہم نے ان پر ظلم نہیں کیا۔\" اور فرمایا: ولكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ \"بلکہ وہ خود اپنے نفسوں پر ظلم کرتے تھے۔\" جیسا کہ فرمایا: ولكِنْ كانُوا هُمُ الظَّالِمِينَ \"بلکہ وہی ظالم تھے۔\" یعنی اپنے نفسوں پر۔ کیونکہ وہ ہمارے لیے ظاہر نہیں ہوئے، یہاں تک کہ ہم نے انہیں جان لیا، اور وہ معدوم تھے مگر ان احوال کے ساتھ جن کے ساتھ وہ وجود (الوجود) میں ظاہر ہوئے۔ اور علم معلوم کے تابع ہے، معلوم علم کے تابع نہیں ہے، پس اسے سمجھو۔\n\nاور یہ ایک عظیم اور دقیق مسئلہ ہے، میرے علم میں نہیں کہ کسی نے اس پر متنبہ کیا ہو، سوائے اس کے کہ کسی نے کیا ہو اور ہم تک نہ پہنچا ہو۔ اور کوئی بھی شخص جب اس کی حقیقت کو پا لیتا ہے تو اس کے لیے اس کا انکار ممکن نہیں رہتا۔ اور اے میرے بھائی! اس میں فرق کرو کہ کوئی چیز موجود ہو اور علم اس کے وجود سے پہلے ہو، اور اس میں فرق کرو کہ وہ چیز اپنی ازلی عدم کی حالت میں ان صورتوں پر ہو۔ پس وہ (معلوم) الٰہی علم کے ساتھ ساتھ ہے، اور مرتبے میں اس پر مقدم ہے، کیونکہ اس نے اپنی ذات کی وجہ سے علم کو اپنے بارے میں علم دیا۔ پس جو کچھ ہم نے ذکر کیا ہے اسے جان لو، کیونکہ یہ تمہیں فائدہ دے گا اور قضا و قدر کے سامنے تسلیم و تفویض کے باب میں تمہیں مضبوط کرے گا، جس کا فیصلہ تمہاری حالت نے کیا ہے۔ اور اگر اس کتاب میں صرف یہی مسئلہ ہوتا تو یہ ہر صاحبِ نظر سدید اور عقل سلیم کے لیے کافی ہوتا۔ واللّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏ (الأحزاب: 4) \"اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے۔\"",
    "fa": "باب چهارصد و یازدهم در معرفت منزلتی که تقدیر (الکتاب) بر او سبقت می‌گیرد، پس از مقامی که نزدیک بود وارد آتش نشود، وارد آتش می‌شود.\n\nپس از تقدیر (الکتاب) بترسید و از من نترسید، زیرا من و شما در چنین امری برابر هستیم. خداوند متعال می‌فرماید: «سخن نزد من دگرگون نمی‌شود و من هرگز به بندگان ستمکار نیستم» (ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ). این به دلیل حاکمیت تقدیر بر همگان است، و بر آنان نیز حاکم است. «آیا کسی که فرمان عذاب بر او محقق شده است [مانند کسی است که به او وعده نیکو داده شده؟]» (أَ فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ). پس این امر نزد خردمند آگاه چقدر دشوار است.\n\n> همانا ترس از تقدیر (الکتاب) بدترین گناهان من است، *** زیرا حکم در هستی (الوجود) و در ما از آنِ اوست.\n> و آن را در کتاب به صراحت خواندیم، *** و آن را در آن، حق و یقینی دیدیم.\n> از خداوند نمی‌ترسد مگر به دلیل امری *** حادث که از او صادر شده و در عالمیان فرود آمده است.\n\n[همانا مردی که عمل اهل بهشت را انجام می‌دهد، میان او و بهشت جز یک وجب فاصله نیست]\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در حدیث صحیح فرمودند: «همانا مردی عمل اهل بهشت را انجام می‌دهد، در آنچه برای مردم آشکار است، تا جایی که میان او و بهشت جز یک وجب باقی نمی‌ماند، پس تقدیر (الکتاب) بر او سبقت می‌گیرد و عمل اهل آتش را انجام می‌دهد و وارد آتش می‌شود.» و همچنین در مورد اهل بهشت فرمودند. سپس فرمودند: «همانا اعمال به پایان‌ها (خواتیم) بستگی دارند و این پایان‌ها تابع حکم سوابق (تقدیرات ازلی) هستند.»\n\nپس خداوند هیچ قضایی را جاری نمی‌کند مگر به آنچه تقدیر (الکتاب) پیشتر حکم کرده است که جاری شود. پس علم او در اشیاء، عین قول او در تکوین (ایجاد) آنهاست. سخن نزد او دگرگون نمی‌شود. پس هیچ حکمی برای خالق و مخلوق نیست مگر به آنچه تقدیر الهی (الکتاب الإلهي) به آن سبقت گرفته است. و به همین دلیل فرمود: «و من هرگز به بندگان ستمکار نیستم» (وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ). زیرا ما بر آنان جاری نمی‌کنیم مگر آنچه علم به آن سبقت گرفته است، و در مورد آنان حکم نمی‌کنم مگر به آنچه پیشتر بوده است. پس این همان موضع برابری است که بنده در آن متوقف می‌شود.\n\n> اگر علم حق (الحق) در حق (الحق) حکم می‌کند، *** پس در خلق او سزاوارتر است؛ پس چه کسی می‌تواند حکم کند؟\n> و اگر چنین باشد، او مختار نیست، *** پس همه تسلیم سبقت تقدیر (الکتاب) هستند.\n> پس ترس نیست مگر از کتابی که پیشی گرفته است، *** که در ما سوره‌ها و آیات و ستارگانی دارد.\n> اگر مختار بود، ما به او اطمینان می‌کردیم که *** مهربان و رحیم و بخشنده‌ترین نسبت به بندگان است.\n> و در بشارت، از رحمت خود خبر داد که *** سبقت کریمانه و مقدم از آنِ اوست.\n> بر خشمی که فعل بندگانش آشکار ساخت، *** که ستایش خداوند آن را از او و از ایشان برطرف می‌سازد.\n> و تقدیر (کتاب) من غیر از ذات من نیست، پس بفهمید، *** پس چیزی مانند آن، من نیستم، پس آشکار کنید و پنهان دارید.\n\n«بلکه انسان بر نفس خود بیناست» (بَلِ الْإِنْسانُ عَلى‏ نَفْسِهِ بَصِيرَةٌ). پس ای ولیّ صمیمی، به آنچه در سینه‌ات می‌گردد (حاک) بنگر، نه به عوارض بیرونی. زیرا تو بر اساس آنچه در تو می‌گردد هستی؛ اگر ایمان در تو بگردد، تو مؤمن هستی، و اگر صرف آنچه ایمان به آن واجب شده است به سوی چیزی بگردد که ظاهر حکم آن را اقتضا نمی‌کند، تو بر اساس آن هستی و با همان برایت ختم می‌شود. به آنچه از تو برای مردم آشکار می‌شود نگاه نکن و جز بر آنچه در تو می‌گردد تکیه مکن، زیرا در سینه‌ات نمی‌گردد مگر آنچه در تقدیر (الکتاب) سبقت گرفته است که با آن برایت ختم شود. مگر اینکه مردم از آنچه شما را به آن آگاه ساختم در غفلت هستند. و امر او را بازگرداننده‌ای نیست و حکم او را تعقیب‌کننده‌ای (تغییردهنده‌ای) نیست (لا مُعَقِّبَ لِحُكْمِهِ). و آنچه در سینه‌ات می‌گردد، عین تجلی (التجلی) امری است که برای توست و سهم تو از هستی حق (الوجود الحق) است. برخی در باب ورع گفته‌اند: «چیزی را آسان‌تر از ورع ندیدم؛ هرگاه چیزی در نفسم می‌گشت، آن را ترک می‌کردم.» این قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) آن را تأیید می‌کند: «آنچه تو را به شک می‌اندازد رها کن و به آنچه تو را به شک نمی‌اندازد روی آور.» و فرمود: «از قلبت فتوا بخواه، هرچند مفتیان به تو فتوا دهند.»\n\n[علم خداوند به اشیاء، اعم از معدوم و موجود، واجب و ممکن و محال]\n\nو بدان که خداوند متعال چیزی را ننوشت مگر آنچه را که می‌دانست، و چیزی را ندانست مگر آنچه را که از صور معلومات، بر همان حالتی که در ذات خود دارند، مشاهده کرد؛ چه آنچه تغییر می‌کند و چه آنچه تغییر نمی‌کند. پس خداوند همه آنها را در حال عدمشان، با تنوع تغییراتشان تا بی‌نهایت، مشاهده می‌کند و آنها را ایجاد نمی‌کند مگر همان‌گونه که در ذات خود هستند. از اینجاست که علم خداوند به اشیاء، اعم از معدوم و موجود، واجب و ممکن و محال را درمی‌یابی. پس بر اساس آنچه مقرر کردیم، تقدیر (الکتاب) سبقت نمی‌گیرد مگر با نسبت دادن تقدیر به آنچه آن شیء با آن در هستی (الوجود) ظاهر می‌شود، بر اساس آنچه حق (الحق) در حال عدم آن مشاهده کرده است. پس این سبقت تقدیر (الکتاب) بر حقیقت است، و تقدیر، سبقت وجود آن شیء است. و کسی که کوائن (موجودات) را پیش از تکوینشان (ایجادشان) می‌داند، ذوق این امر را درک می‌کند، زیرا آنها در حال عدمشان برای او مشهودند و وجودی ندارند. پس هر کس این را بداند، معنای سبقت تقدیر را می‌فهمد و از سبقت تقدیر بر خود نمی‌ترسد، بلکه از نفس خود می‌ترسد. زیرا تقدیر و علم بر او سبقت نگرفته است مگر بر اساس صورتی که او بر آن بوده و در هستی (وجود) با آن ظاهر شده است. پس خود را ملامت کن و بر تقدیر اعتراض مکن. و از اینجاست، اگر تعقل کنی، وصف حق (الحق) از خود را درمی‌یابی که اگر با او منازعه شود، حجت بالغه از آن اوست. زیرا محال است که علم تعلق گیرد مگر به آنچه معلوم در ذات خود بر آن است. پس اگر کسی بر خداوند احتجاج کند و بگوید: «علم تو بر این سبقت گرفته که من چنین باشم، پس چرا مرا مؤاخذه می‌کنی؟» حق (الحق) به او می‌گوید: «آیا تو را جز بر آنچه هستی دانستم؟ اگر بر غیر آن بودی، تو را بر آنچه می‌بودی می‌دانستم.» و به همین دلیل فرمود: «تا بدانیم» (حتی نعلم). پس به خود بازگرد و در سخنت انصاف داشته باش. هنگامی که بنده به خود بازگردد و در امر بنگرد، همان‌گونه که ذکر کردیم، می‌داند که او محکوم است و حجت برای خداوند متعال بر اوست. آیا نشنیدی که خداوند متعال می‌فرماید: «و خداوند به آنان ستم نکرد» (وما ظَلَمَهُمُ الله) و «و ما به آنان ستم نکردیم» (وما ظَلَمْناهُمْ) و فرمود: «بلکه آنان به خودشان ستم می‌کردند» (ولكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ) همان‌گونه که فرمود: «بلکه آنان ستمکار بودند» (ولكِنْ كانُوا هُمُ الظَّالِمِينَ) یعنی به خودشان. زیرا آنان برای ما ظاهر نشدند تا ما آنان را در حال معدوم بودنشان بدانیم، مگر به آنچه با آن در هستی (الوجود) از احوال ظاهر شدند. و علم تابع معلوم است، نه معلوم تابع علم. پس این را بفهم. و این مسئله‌ای عظیم و دقیق است که در علم من کسی بر آن تنبیه نکرده است، مگر اینکه بوده و به ما نرسیده باشد. و هیچ کس نیست که اگر به آن تحقق یابد، بتواند آن را انکار کند. و ای برادر، فرق بگذار میان اینکه شیئی موجود باشد و علم بر وجود آن پیشی گیرد، و میان اینکه آن شیء در حال عدم ازلی خود بر این صور باشد. پس آن (صورت ازلی) همگام با علم الهی به آن است و از نظر رتبه بر آن مقدم است، زیرا ذات آن شیء، علم به خود را به خداوند داده است. پس آنچه را ذکر کردیم بدان، زیرا در باب تسلیم و تفویض به قضا و قدری که حال تو آن را حکم کرده است، به تو سود می‌رساند و تو را تقویت می‌کند. و اگر در این کتاب جز این مسئله نبود، برای هر صاحب نظر درست و عقل سلیم کافی بود. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}