{
  "id": 283,
  "title": {
    "ar": "الباب الثالث والثمانون ومائتان في معرفة منزل القواصم وأسرارها من الحضرة المحمدية",
    "en": "Chapter Two Hundred and Eighty-Third: Concerning the Gnosis of the Station of the Decisive Realities (القواصم) and their Mysteries from the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب دو سو تراسی (۲۸۳): قواصم کے منزل اور اس کے اسرار کی معرفت کے بیان میں، جو حضرت محمدیہ (الحضرة المحمدية) سے ہیں۔",
    "fa": "باب دویست و هشتاد و سوم در شناخت منزلگاه قواصم (القواصم) و اسرار آن از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## (الباب الثالث والثمانون ومائتان في معرفة منزل القواصم وأسرارها من الحضرة المحمدية)\n\n\n> إذا كنت مشغوفا بحب المعاصم *** تذكر من الآيات آي القواصم‏\n\n\n> فإن لها عن ذاك زجرا وعصمة *** وأفلح من تحييه آي العواصم‏\n\n\n> وهذي أمور لم أنلها بفكرة *** ولكنها جاءت على يد قاسم‏\n\n\n> ويعطي إله الخلق عدلا ومنة *** بقصمة قهار وعصمة عاصم‏\n\n\n> فكم بين شخص بالملائك ملحق *** وبين شخيص ملحق بالبهائم‏\n\n\nاعلم أنه لما وصلت إلى هذا المنزل في وقت معراجي الذي عرج بي ليريني من آياته سبحانه ما شاء ومعي الملك قرعت بابه فسمعت من خلف الباب قائلا يقول من ذا الذي يقرع باب هذا المنزل المجهول الذي لا يعرف إلا بتعريف الله فقال الملك عبد الحضرة عبدك محمد بن نور ففتح فدخلت فيه فعرفني الحق جميع ما فيه ولكن بعد سنين من شهودي إياه فكان ذلك شهودا صوريا من غير تعريف ثم بعد ذلك وقع التعريف به ولما عرفني بأنه منزل مجهول قصم ظهري ولما وقع التعريف به رأيته كله قواصم إلا أن يعصم الله مما رأيت فخفت فسكن الله روعي بما جلى لي فرأيت في هذا المنزل تحول الصور الحسية في الصور الجسمية كما يتشكل الروحانيون في الصور فتخيلت إن تلك الصور الأول ذهبت فحققت النظر فيها فلم أدركها حتى أعطيت القوة عليها فتحولت فأدركت المطلوب فإذا هو على نوعين في التحول النوع الواحد أن تعطي قوة تؤثر بها في عين الرائي ما شئته من الصور التي تحب أن تظهر له فيها فلا يراك إلا عليها وأنت في نفسك على‏\nصورتك ما تغيرت لا في جوهرك ولا في صورتك إلا أنه لا بد أن تحضر تلك الصورة التي تريد أن تظهر للرائي فيها في خيالك فيدركها بصر الرائي في خيالك كما تخيلتها ويحجبه ذلك النظر في الوقت عن إدراك صورتك المعهودة هذا طريق وطريقة أخرى يتضمنها هذا المنزل وذلك أن الصورة التي أنت عليها عرض في جوهرك فيزيل الله ذلك العرض ويلبسك ما أردت أن تظهر به من صور الأعراض من حية أو أسد أو شخص آخر إنساني وجوهرك باق وروحك المدبر جوهرك على ما هو عليه من العقل وجميع القوي فالصورة صورة حيوان أو نبات أو جماد والعقل عقل إنسان وهو متمكن من النطق والكلام فإن شاء تكلم وإن شاء لم يتكلم بأي لسان شاء الحق أن ينطقه به فحكمه حكم عين الصورة في المعهود ومن هذا الباب يعرف نطق الجمادات والنبات والحيوان وهي على صورها وتسمعها كنطق الإنسان كما إن الروح إذا تجسد في صورة البشر تكلم بكلام البشر لحكم الصورة عليه وليس في قوة الروحاني أن يتكلم بكلام غير الصورة التي يظهر فيها بخلاف الإنسان وهو في غير صورة الإنسان وهذا منزل الممسوخ من هذه الحضرة تمسخ الصورة الحسية في الدنيا والآخرة ومن هذا المنزل تمسخ البواطن فترى الصورة أناسا وفي الباطن غير تلك الصورة من ملك أو شيطان بصورة حيوان مناسب لما هو باطنه عليه من كلب أو خنزير أو قرد أو أسد وكل ذلك يخالف ما تطلبه إنسانيته إما عال وإما دون ومسلخ البواطن قد كثر في هذا الزمان كما ظهر المسخ في الصورة الظاهرة في بنى إسرائيل حين جعلهم الله قردة وخنازير ولا بد في آخر الزمان أن يظهر المسخ في هذه الأمة ولكن في اليهود منها لا في المسلمين فإن الايمان يحفظهم فما يمسخ من هذه الأمة إلا يهودي أو منافق يظهر الإسلام ويخفى اليهودية وإنما ألحقنا اليهود بهذه الأمة لأن أمة النبي ليست قبيلته وإنما أمته جميع من بعث إليهم ومحمد صلى الله عليه وسلم بعث إلى الناس عامة فجميع الناس أمته من جميع الملل فمنهم من آمن ومنهم من كفر ومنهم من أسلم وأما دخول الجن في دينه صلى الله عليه وسلم فكان دخولهم في دينه مثل ما كان دخول من لم يبعث إليه نبي في وقته في دين نبي وقته ثم إن ذلك النبي الذي ما بعث إليه إذا لم يكن ذلك الداخل ممن بعث إليه نبي آخر تجري أحكامه على من بعث إليه بما بعث به فإن لكل نبي شِرْعَةً ومِنْهاجاً فهكذا كان إيمان الجن برسول الله صلى الله عليه وسلم وأما ما ذكرناه من مسخ البواطن‏\n\n\nفقول النبي صلى الله عليه وسلم يخبر عن ربه في صفة قوم من أمته أنهم إخوان العلانية أعداء السريرة ألسنتهم أحلى من العسل وقلوبهم قلوب الذئاب يلبسون للناس جلود الضأن من اللين‏\n\n\nفهذا هو مسخ البواطن أن يكون قلبه قلب ذئب وصورته صورة إنسان فالله العاصم من هذه القواصم وطريقة أخرى في التحول في الصورة وهي أن تبقي صورة هذا الشخص على ما كانت عليه ويلبس نفسه صورة روحاني يجد ذلك الروحاني في أي صورة شاء هذا الشخص أن يظهر للرائي فيها ويغيب هذا الشخص في تلك الصورة وهي عليه كالهواء الحاف به فتقع عين الرائي على تلك الصورة الأسدية أو الكلبية أو القردية أو ما كانت كل ذلك بتقدير العزيز العليم وطريقة أخرى وهي أن يشكل الهواء الحاف به على أي صورة شاء ويكون الشخص باطن تلك الصورة فيقع الإدراك على تلك الصورة الهوائية المشكلة في الصورة التي أراد أن يظهر فيها ولكن إن وقع من تلك الصورة نطق فلا يقع إلا بلسانه المعروف عند الرائي فيسمع النعمة فيعرفها ويرى الصورة فينكرها لا يتمكن لمن هذه حالته أن يزول عن نغمته وهذه قوة الجن لمن يعرفهم فإنهم يظهرون فيما شاءوه من الصور والنغمة منهم نغمة جن لا يقدرون على أكثر من ذلك ومن لا معرفة له بهذا القدر فلا معرفة له بالجن إلا إن ثم أقواما تلعب الجن بعقولهم فتخيل لهم في عيونهم صورا مثل ما يخيل الساحر الحبال في صورة حيات ساعية فيحسبون أنهم يرون الجن وليسوا بجن وتكلمهم تلك الصور فيما يخيل إليهم وليست الصور بمتكلمة بخلاف تجسد الجن في أنفسهم فمن عرف من العارفين نغمات كل طائفة عرف ما رأى ولم يطرأ عليه تلبيس فيما رآه وقد رأينا جماعة بالأندلس ممن يرون الجن من غير تشكل وفي تشكلهم منهم فاطمة بنت ابن المثنى من أهل قرطبة وكانت عارفة بهم من غير تلبيس ورأيت طائفة بمدينة فاس ممن كانت الجن تخيل لهم صورا في أعينهم وتخاطبهم بما شاءوا لتفتنهم وليسوا بجن ولا بشكل جن منهم أبو العباس الزقاق بمدينة فاس وكان قد لبس عليه الأمر في ذلك فكان يخيل إليه أن الأرواح الجنية تخاطبه‏\nويقطع بذلك وسبب ذلك الجهل بنغمتهم فكان إذا قعد عندي وحضر مجلسي يبهت ثم يصف ما يرى فاعلم أنه يخيل له فكان يصل في ذلك إلى حد الملاعبة والمصاحبة والمحادثة وربما يقع بينه وبين ذلك الذي شاهده مخاصمة في أمور ومناكرة فتضره الجن من طريق آخر وهو يتخيل أن تلك الصور منها صدر الضرر وغلب عليه ذلك رحمه الله وكان أبو العباس الدهان وجميع أصحابنا يشاهدون ذلك منه فمن عرف النغمات لم تلتبس عليه صورة أصلا وقليل من يعرف ذلك ويغترون بصدق ما يظهر من تلك الصور في أوقات فهذا قد بينا لك مراتب التحول في الصور من هذا المنزل وفيه من هذا الظهور في الصور عجائب جمة تنهر العقول وأعظمها تغير المزاج إلى مزاج آخر مع بقاء الجوهر لا بد منه الحامل لهذه الصورة فإن لم يبق الجوهر فما تحول قط ولكن هذا جوهر آخر في صورته ما تبدل ولا هو ذلك كما إن زيدا ليس عمرا ومن هذا المنزل أيضا وزن أبي بكر الصديق بالأمة فرجح هذا منزل حضرة الوزن بين المخلوقين من كل ما سوى الله ومن عرف ما في هذا المنزل وشاهد حكمه ورفعت له موازين الخلق على ما وضعهم الله عليه من الحال والمقام عرف فضل الملائكة بعضهم على بعض وفضل الناس بعضهم على بعض وفضل الجن بعضهم على بعض وفضل الحيوان بعضه على بعض وفضل النبات بعضه على بعض وفضل الجماد بعضه على بعض والمفاضلة بين الملائكة والبشر وبين الجن والبشر وبين الجماد والنبات والبشر ويعرف مفاضلة كل جنس مع غير جنسه ومن هنا يعرف فضل الحجر الأسود مع كونه جمادا وهو يمين الله فانظر هذه الرتبة وهو جماد وانظر في فرعون وأبي جهل وهو إنسان ومن هذا المنزل إذا وقفت على هذه المفاضلات رأيت الجنة فيمن تسري من هؤلاء الأجناس وأنواع الأجناس وأنواع الأنواع إلى آخر درجة وهي أشخاص النوع الأخير ويشاهد أيضا سريان النار في الأجناس بين حر وزمهرير وفي أنواع الأجناس وأنواع الأنواع حتى تنتهي إلى أشخاص النوع الأخير فتحكم على كل من تشاهده بما تشاهده فإنك إنما تشاهده بما له لا بوقته وهنا يقع تلبيس من حضرة خيالية في مقابلة هذه الحضرة فيشاهد ما يعطيه شاهد الوقت فيحكم عليه بالمال وهو تلبيس شيطاني من الصفة التي ذكرناها آنفا من كون الجن والشياطين تخيل للناس صورا عنهم وعن غيرهم وليس بحقيقة وهذه المسألة التبس الأمر فيها على أبي حامد الغزالي وغيره وممن التبس عليه الأمر في ذلك من الشيوخ الذين أدركناهم أبو أحمد بن سيد بون بوادي أشت فكان يقول هو وأمثاله إن الإنسان إنما يطرأ عليه التلبيس ما دام في عالم العناصر فإذا ارتقى عنها وفتحت له أبواب السماء عصم من التلبيس فإنه في عالم الحفظ والعصمة من المردة والشياطين فكل ما يراه هنالك حق فلنبين لك الحق في ذلك ما هو وذلك أن الذي ذهبت إليه هذه الطائفة القائلون بما حكيناه عنهم من رفع التلبيس فيما يرونه لكونهم في محال لا تدخلها الشياطين فهي محال مقدسة مطهرة كما وصفها الله وذلك صحيح إن الأمر كما زعموه ولكن إذا كان المعراج فيها جسما وروحا كمعراج رسول الله صلى الله عليه وسلم وأما من عرج به بخاطره وروحانيته بغير انفصال موت بل بفناء أو قوة نظر يعطي إياها وجسده في بيته وهو غائب عنه بفناء أو حاضر معه لقوة هو عليها فلا بد من التلبيس إن لم يكن لهذا الشخص علامة إلهية بينه وبين الله يكون فيها عَلى‏ بَيِّنَةٍ من رَبِّهِ فيما يراه ويشاهده ويخاطب به فإن كان له علامة يكون بها عَلى‏ بَيِّنَةٍ من رَبِّهِ وإلا فالتلبيس يحصل له وعدم القطع بالعلم في ذلك إن كان منصفا وقد يكون الذي شاهده حقا ويكون معصوما محفوظا في نفس الأمر ولكن لا علم له بذلك فإذا كان عَلى‏ بَيِّنَةٍ من رَبِّهِ حينئذ يأمن التلبيس كما أمنته الأنبياء عليهم السلام فيما يلقى إليهم من الوحي في بيوتهم وذلك أن الشيطان لا يزال مراقبا لحال هذا المريد المكاشف سواء كان من أهل العلامات أو لم يكن فإن له حرصا على الإغواء والتلبيس ولعلمه بأن الله قد يخذل عبده بعد عصمته مما يلقي إليه فيقول عسى ويعيش بالترجي والتوقع وإن عصم باطن الإنسان منه ورأى أنوار الملائكة قد حفت بهذا العبد انتقل إلى حسه فيظهر له في صورة الحس أمورا عسى يأخذه بها عما هو بسبيله مع الله في باطنه وهذا فعله مع كل معصوم محفوظ بأنوار الملائكة حسا في باطنه وأما إن كان معصوما في نفس الأمر وليس على باطنه حفظة من الملائكة فإن الشيطان يأتي إلى قلبه وهذا الشخص بكونه معصوما في نفس الأمر بالبينة التي هو عليها من ربه لا يقبل منه ما يلقى إليه هذا إن لم يكن متبحرا في العلم ويكون‏\nصاحب مقام مقصور عليه وأما إن كان صاحب تمكين وتبحر في العلم الإلهي أخذ ذلك منه فإنه رسول من الله إليه فإن كان محمودا فقلب عينه في مجرد الأخذ حيث أخذه عن الله ولم يلتفت إلى الواسطة لعلمه بمحلها عند الله من الطرد والبعد فينقلب خاسئا حيث أراد أمرا فلم يتم له بل كان فيه زيادة سعادة لهذا الشخص ولكن من حرصه على الإغواء يعود إليه المرة بعد المرة وإن كان الذي أتاه به مذموما قلب عينه فصار محمودا في حقه بأن يصرفه على المصرف المرضى فينقلب خاسئا حيث أراد أمرا فلم يتم له بل كان فيه سعادة لهذا الشخص فإن كان حال هذا الشخص الأخذ من الأرض أقام له الشيطان أرضا ليأخذ منها فأما إن يرده خاسئا ويفرق بين الأرضين وإما أن يكون متبحرا فيشكر الله حيث أعطاه أيضا أرضا متخيلة كما أعطاه أرضا محسوسة وينظر سر الله فيها ويأخذ منها ما أودع الله فيها من الأسرار التي لم تخطر ببال إبليس ويردها الله لهذا الشخص زيادة في ملكه وإن كان حاله السماء فإن الشيطان يقيم له سماء مثل السماء التي يأخذ منها ويدرج له من السموم القاتلة ما يقدر عليه فيعامله العارف بما ذكرناه في معاملته له بالأرض وإن لم يكن في هذا المقام لبس عليه وتجرع تلك السموم القاتلة ولحق بِالْأَخْسَرِينَ أَعْمالًا وإن كان حاله في سدرة المنتهى أو في ملك من الملائكة جلى له صورة سدرة مثلها أو صورة مثل صورة ذلك الملك وتسمى له باسمه ثم ألقى إليه ما عرف أنه يلقى إليه من ذلك المقام الذي هو فيه ليلبس عليه فإن كان من أهل التلبيس فقد ظفر به عدوه وإن كان معصوما حفظ منه فيطرده ويرمي ما جاء به أو يأخذه من الله دونه ويشكر الله على ما أولاه وما زاده ثم يرتقي هذا الشخص إلى حال هو أعلى فإن كان حاله العرش أو العماء أو الأسماء الإلهية ألقى إليه الشيطان بحسب حاله ميزانا بميزان فإن كان من أهل التلبيس كان كما ذكرناه وإن لم يكن انقسم أمره إلى ما ذكرناه فقد أعلمتك أن الشيطان لا يجلي للشخص إلا على ما هي عليه حالته في صورة ذلك على السواء وعلى ما استقر في ذهنه مما قررته الشريعة أ لا ترى ابن صياد لما أظهر له إبليسه العرش إذ كان حاله وأبصر ذلك العرش على البحر لأنه رأى الله تعالى يقول وكانَ عَرْشُهُ عَلَى الْماءِ فجلى له العرش على البحر وهو قاعد عليه يأخذ عنه ابن صياد ويتخيل أنه يأخذ عن الله‏\n\n\nفإن الله قد قال على ما أخبره به رسول الله صلى الله عليه وسلم في قوله وكانَ عَرْشُهُ عَلَى الْماءِ فقال له رسول الله صلى الله عليه وسلم ما ذا ترى قال أرى العرش قال أين قال على البحر فقال له رسول الله صلى الله عليه وسلم ذلك عرش إبليس وخبا له رسول الله صلى الله عليه وسلم سورة الدخان من القرآن فقال له رسول الله صلى الله عليه وسلم ما خبأت لك فقال الدخ والدخ هي لغة في الدخان فقال له رسول الله صلى الله عليه وسلم اخسأ فلن تعدو قدرك‏\n\n\nيعني إنك ممن لبس عليه الأمر فإنه صلى الله عليه وسلم ما خبا له إلا سورة الدخان وهي تحوي على الدخان وعلى غيره فما خبا له الدخان فأتاه باسم السورة لا بما خبا له وما قال سورة الدخان وإنما قال الدخ ولم يأت في هذه السورة إلا الدخان لا الدخ وإن كان هو بعينه فلم يفرق ابن صياد بين سورة الدخان وبين الدخان فجهل فلهذا قال له رسول الله صلى الله عليه وسلم اخسأ فلن تعدو قدرك حيث جاءه من هذه السورة بما يناسب إبليس الذي عرفه بذلك وهو أن الشيطان مخلوق من النار فما رأى من تلك الخبيئة إلا ما يناسبه وما عرف أنها سورة الدخان فالقى إلى ابن الصياد في روعة هذا القدر وذلك أن النبي صلى الله عليه وسلم تلفظ باسم السورة عند ما عينها في نفسه فسرقها الشيطان واختطفها من لفظه ولو أضمرها رسول الله صلى الله عليه وسلم في نفسه ما عرفها إبليس فإنه ليس له على قلبه صلى الله عليه وسلم اطلاع ولا استشراف بخلاف قلب الولي ولهذا إن النبي معصوم من الوسوسة في حال نزول الوحي وفي غيرها لا فرق أ لا ترى الشيطان لما علم إن رسول الله صلى الله عليه وسلم بهذه المثابة والعناية من الله في عصمة قلبه من استشراف إبليس عليه جاءه في الصلاة في قبلته بشعلة نار مخيلة فرمى بها في وجهه وغرضه أن يحول بينه وبين الصلاة لما يرى له فيها من الخير فإنه يحسده بالطبع فتأخر النبي صلى الله عليه وسلم إلى خلف ولم يقطع صلاته وأخبر بذلك أصحابه وأما الولي فقد يلقى إليه في قلبه وقد يسمع منه ما يحدث به نفسه فيطمع أن يلبس عليه حاله كما ذكرناه فمن كان على بينة من ربه فقد سعد وارتفع الإشكال ولا بد للبينة التي يكون عليها أن تكون بينة له وإن لم تكن بينة فلا يقدر أن يحكم بها فإنه قد تكون علامة لا بينة فيتخيل إن العلامة هي‏\nالبينة وليس كذلك فإن العلامة إذا لم تكن بينة وهو التحقق بها وبها يقطع النبيون والأولياء فيما يرد عليهم من الله ولقد أخبرني أبو البدر التماشكي البغدادي وهو من الفقراء الصادقين من أنظفهم ثوبا وأحسنهم عبارة قال لي جمع بيني وبين الشيخ رغيب الرحبي مجلس وكان من العارفين غير أنه لم يبلغ فيما نقل إلينا مبلغ العارفين المكملين في شغلهم أنه قال له عن رجل الوقت إنه رأى خلعة قد خرجت له من الحضرة وقد أعطى علامة في ذلك الرجل وإلى الآن فما رآه لأنه لم ير تلك العلامة فقال له أبو البدر رضي الله عن جميعهم يا شيخ أ لم تر بعد ذلك رجالا كثيرة فقال له نعم قال وكانوا من الأكابر قال نعم ولكن ما رأيت تلك العلامة في واحد منهم فقال له أبو البدر وما يدريك أن واحدا من أولئك الرجال الذين رأيتهم كان هو المقصود بتلك الخلعة وتغرب عليك حتى لا تعرفه فقال له رغيب قد يكون ذلك فهذا صاحب علامة ولكن ما هو على بينة في علامته فإن العلامة إنما هي في الباطن لا تزول عنه وهو الذي يكون بها على بينة من ربه في نفسه فإذا جعلت له العلامة في غيره كان ذلك الغير حاكما لها إن شاء ظهر له فيها وإن شاء لم يظهر فلذلك قال رغيب ما قال في العلامة ولم يبين من كان محل العلامة هل هو أو ذلك الرجل فلما أقر\n\n\nبوقوع ما قال له أبو البدر في الدخول عليه في علامته علمنا قطعا إذا صدقنا رغيبا في دعواه أن العلامة كانت في غيره فإنه ما هو عَلى‏ بَيِّنَةٍ من رَبِّهِ فعلامته فيه ما يكون في غيره فلذلك قد يمكن أن يصح ما قال أبو البدر أن يكون الرجل قد دخل عليه فيمن رأى من الرجال وتغرب عليه فاعتراض أبي البدر على هذا العارف اعتراض صحيح محرر في الطريق وإقرار رغيب في ذلك إقرار صادق يدل على صدق دعواه إلا أنه قد يكون هذا الشيخ ممن ليس على بينة وقد يكون من أهل البينة إذ لم يقع في دعواه لفظ البينة وعدل إلى العلامة التي يدخلها الاشتراك وأما الشيخ أبو السعود ابن الشبل شيخ أبي البدر المذكور فالموصوف من أحواله أنه كان على بينة من ربه إلا أنه كان أعقل أهل زمانه ولو لا ما حكى عنه أبو البدر المذكور أنه انتهر شخصا في ذكر عبد القادر بغيظ لا بسكون وهدو وعرفه إنه يعرف عبد القادر كيف كان حاله في أهله وحاله في قبره لكان عبدا محضا ولكن عاش بعد هذا فقد يمكن أنه صار عبدا محضا لأنه لم ينتهر هذا الشخص لكونه أتى أمرا محرما في الشرع وإنما وصف أحوال عبد القادر وعظم منزلته فلو أنه وقع في محظور شرعي وانتهره وغضب عليه لم يخرجه ذلك عن إن يكون عبدا محضا فسبحان من أعطى أبا السعود ما أعطاه فلقد كان واحد زمانه في شأنه نعم لو كان هذا الذاكر تلميذا له لتعين عليه انتهاره إياه لأن انتهاره من تربيته فإن كان من تلامذته فذلك الانتهار لا يخرجه عن عبوديته فإن كان ذلك الانتهار من أبي السعود عن أمر إلهي خوطب به في نفسه لمصلحة الوقت في حق من كان أو لغيرة من الله على مقام قد أساء هذا المتكلم فيه الأدب فانتهاره ذلك مما يحقق عبوديته لا يخرجه عنها وهذا هو الظن بحال أبي السعود لا الذي ذكرناه أولا وإنما ذكرنا ذلك وهذا وما بينهما لنستوفي الكلام على المقام بما يقتضيه من الوجوه على كمالها فلا بد أن يكون هذا الشيخ على واحد منها ولم يحكم عليه بواحد منها فأفدنا الواقف على هذا الكتاب معرفة هذا المقام وأحواله وإن الله ما أخبرني بحال من أحوال أبي السعود حتى نلحقه بمنزلته والله أعلم أي ذلك كان إلا أني أقطع أن ميزانه بين الشيوخ كان راجحا نفعنا الله بمحبته وبمحبة أهل الله وقد أوردنا من هذا المنزل بعض ما يحوبه من القواصم فإنها كلها مخوفة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Eighty-Three: On the Knowledge of the Station of the Crushers and their Secrets, Derived from the Muhammadan Presence (الحضرة المحمدية)\n\n> If you are passionately devoted to the love of the protectors (المعاصم),\n> Remember among the signs (الآيات) the signs of the crushers (القواصم).\n>\n> For they contain a restraint and a safeguard (عصمة) from that,\n> And successful is he whom the signs of the safeguards (العواصم) revive.\n>\n> These are matters I did not attain through reflection (فكرة),\n> But they came upon the hand of a divider (قاسم).\n>\n> And the God of Creation gives justice and grace,\n> Through the crushing (قصمة) of the Overpowering (Qahhar) and the safeguarding (عصمة) of the Protector (Asim).\n>\n> How great is the difference between a person joined to the angels,\n> And a small person joined to the beasts.\n\nKnow that when I reached this station (منزل) during my spiritual ascent (معراجي)—in which I was raised so that He, glory be to Him, might show me whatever Signs (آياته) He willed—and the Angel was with me, I knocked upon its door. I heard a voice from behind the door saying: \"Who is it that knocks upon the door of this unknown station, which is known only through the definition of Allah?\" The Angel said: \"The servant of the Presence (عبد الحضرة), your servant Muhammad, son of Light (ابن نور).\" So it opened, and I entered.\n\nThe Real (الحق) made known to me all that was within it, but only after years of my witnessing (شهودي) it. That witnessing was merely formal (صوريا), without definition. Then, after that, the definition of it occurred. When He made known to me that it was an unknown station, it crushed my back (قصم ظهري). When the definition occurred, I saw that it was entirely composed of crushers (قواصم), unless Allah grants protection from what I saw. I became afraid, but Allah calmed my terror by what He disclosed (جلى) to me.\n\nIn this station, I saw the transformation (تحول) of sensory forms (الصور الحسية) into bodily forms (الصور الجسمية), just as spiritual beings (الروحانيون) take shape in forms. I imagined that those initial forms had vanished, so I scrutinized them closely, but I did not grasp them until I was given the power over them. Then they transformed, and I grasped what was sought. I found that transformation is of two types.\n\nThe first type is that you are given a power by which you affect the eye of the beholder (الرائي) with whatever forms you wish to appear in, so he sees you only in that form, while you yourself remain in your own form, unchanged, neither in your substance (جوهرك) nor in your appearance. However, you must necessarily bring forth the form you wish to appear in to the beholder within your imagination (خيالك). The beholder's sight then perceives it in your imagination just as you conceived it, and that perception simultaneously veils him from perceiving your customary form. This is one way.\n\nAnother way contained within this station is that the form you possess is an accident (عرض) in your substance. Allah removes that accident and clothes you in whatever form of accidents you wished to appear in—whether a snake, a lion, or another human person. Your substance remains, and your spirit (روحك) governing your substance remains as it is, possessing intellect (العقل) and all faculties. Thus, the form is the form of an animal, a plant, or an inanimate object (جماد), but the intellect is the intellect of a human, capable of speech and articulation. If he wills, he speaks; if he wills, he does not speak, using whatever tongue The Real wills him to speak with. Its ruling is the ruling of the form itself in common understanding. It is through this chapter that the speech of inanimate objects, plants, and animals is known, while they remain in their forms, and you hear them speaking like human speech. Just as the spirit, when embodied (تجسد) in the form of a human, speaks with human speech due to the ruling of the form upon it. It is not within the power of the spiritual being to speak with the speech of a form other than the one in which it appears, unlike the human who is in a non-human form. This is the station of the Transformed (الممسوخ) from this Presence (الحضرة).\n\nThe sensory form (الصورة الحسية) is transformed in this world and the Hereafter. From this station, the inner realities (البواطن) are transformed. Thus, you see the form as human, but the inner reality (الباطن) is something other than that form—an angel or a devil—in the shape of an animal appropriate to its inner state, such as a dog, a pig, a monkey, or a lion. All of this contradicts what his humanity demands, whether high or low. The transformation of inner realities (مسلخ البواطن) has become widespread in this time, just as physical transformation (المسخ) appeared openly among the Children of Israel when Allah turned them into apes and swine. In the End of Time, transformation must appear in this Community (الأمة), but among the Jews within it, not among the Muslims, for faith protects them. Therefore, none of this Community will be transformed except a Jew or a hypocrite (منافق) who outwardly professes Islam but conceals Judaism. We only include the Jews within this Community because the Prophet's Community is not merely his tribe, but all those to whom he was sent. Muhammad (may Allah bless him and grant him peace) was sent to mankind generally, so all people of all faiths (الملل) are his Community. Among them are those who believed, those who disbelieved, and those who submitted (أسلم).\n\nAs for the jinn entering his religion, their entry was like the entry of someone to whom a prophet was not sent in his time, into the religion of the prophet of his time. Then, if that person to whom a prophet was not sent is not among those to whom another prophet was sent, the rulings of that prophet apply to those to whom he was sent, according to what he was sent with, for every prophet has a Law (شِرْعَة) and a Way (مِنْهاج). Thus was the faith of the Jinn in the Messenger of Allah (may Allah bless him and grant him peace).\n\nRegarding the transformation of inner realities (مسخ البواطن), the saying of the Prophet (may Allah bless him and grant him peace), reporting from his Lord concerning the description of a group within his Community, is: \"They are brothers in public, enemies in secret. Their tongues are sweeter than honey, but their hearts are the hearts of wolves. They wear the skins of sheep for people out of softness.\" This is the transformation of inner realities: that his heart is the heart of a wolf, while his form is the form of a human. May Allah be the Protector (العاصم) from these Crushers (القواصم).\n\nAnother method of transformation in form is that the form of this person remains as it was, but he clothes himself in the form of a spiritual being (روحاني). That spiritual being finds itself in whatever form this person wishes to appear in to the beholder. This person is concealed within that form, which surrounds him like the air. The eye of the beholder falls upon that leonine, canine, or simian form, or whatever it may be, all by the decree of the Almighty, the All-Knowing (العزيز العليم).\n\nAnother method is that the air surrounding him takes shape in whatever form he wishes, and the person is the inner reality (باطن) of that form. Perception falls upon that airy form (الصورة الهوائية) shaped into the image he intended to appear in. However, if speech (نطق) issues from that form, it only occurs with his voice (لسانه) known to the beholder. The beholder hears the tone (النغمة) and recognizes it, but sees the form and denies it. It is impossible for one in this state to change his tone. This is the power of the Jinn (الجن) for those who know them. They appear in whatever forms they wish, but their tone is the tone of the Jinn; they cannot achieve more than that. Whoever lacks knowledge of this degree has no knowledge of the Jinn, except that there are people whose minds the Jinn play with, causing them to imagine forms in their eyes, just as the sorcerer makes ropes appear as moving snakes. They assume they are seeing Jinn, but they are not Jinn. Those forms speak to them in what is imagined, but the forms themselves are not speaking, unlike the actual embodiment (تجسد) of the Jinn. Whoever among the Gnostics (العارفين) knows the tones of every group knows what he has seen, and no delusion (تلبيس) occurs regarding what he perceives.\n\nWe have seen a group in Al-Andalus who see the Jinn without them taking shape, and also when they do take shape. Among them was Fatima bint Ibn al-Muthanna from Cordoba, who had gnosis of them without delusion. I saw a group in the city of Fez whose eyes the Jinn caused to imagine forms, addressing them with whatever they wished in order to tempt them. These were neither Jinn nor Jinn-shapes. Among them was Abu al-Abbas al-Zaqqaq in Fez, who had been deluded in this matter. He imagined that the Jinn spirits were addressing him and was certain of it. The reason for this was ignorance of their tone. When he sat with me and attended my gathering, he would be astonished, then describe what he saw. I knew that it was merely imagination. He reached the point of playing, companionship, and conversation with them. Sometimes, disputes and disagreements would occur between him and what he witnessed, and the Jinn would harm him in another way, while he imagined that the harm originated from those forms. This state overcame him, may Allah have mercy on him. Abu al-Abbas al-Dahhan and all our companions witnessed this from him. Whoever knows the tones will never be confused by a form. Few know this, and they are deceived by the apparent truthfulness of what those forms reveal at times.\n\nThus, we have explained to you the degrees of transformation in forms within this station. In it, there are many wonders of appearance in forms that overwhelm the intellects. The greatest of these is the change of temperament (المزاج) to another temperament, while the necessary substance (الجوهر) carrying this form remains. For if the substance does not remain, there is no transformation at all; rather, this is another substance in its form, which has not changed, nor is it the same, just as Zayd is not Amr.\n\nAlso, from this station is the weighing (وزن) of Abu Bakr al-Siddiq against the entire Community, where he outweighed them. This is the station of the Presence of Weighing (حضرة الوزن) among all created beings other than Allah. Whoever knows what is in this station, witnesses its ruling, and has the scales (موازين) of creation raised for him according to the state (الحال) and station (المقام) upon which Allah placed them, knows the superiority (فضل) of angels over one another, and the superiority of humans over one another, of Jinn over one another, of animals over one another, of plants over one another, and of inanimate objects over one another. And the comparison (المفاضلة) between angels and humans, between Jinn and humans, and between inanimate objects, plants, and humans. He knows the comparison of every genus with a non-genus. From here, the superiority of the Black Stone (الحجر الأسود) is known, despite its being inanimate (جماد), for it is the Right Hand of Allah. Look at this rank, and it is inanimate, and look at Pharaoh and Abu Jahl, and they are human.\n\nFrom this station, if you stand upon these comparisons, you see Paradise (الجنة) flowing through those genera, types of genera, and types of types, down to the last degree, which are the individuals of the final type. He also witnesses the flow of the Fire (النار) through the genera, between heat and bitter cold (زمهرير), and through the types of genera and types of types, until it reaches the individuals of the final type. You judge everyone you witness by what you witness, for you only witness him by what belongs to him, not by his time.\n\nHere, delusion (تلبيس) occurs from an Imaginal Presence (حضرة خيالية) opposite this Presence. He witnesses what the witness of the time grants him, and he judges based on the outcome (المال). This is a satanic delusion (تلبيس شيطاني) stemming from the characteristic we mentioned earlier: that the Jinn and devils cause people to imagine forms of themselves and others, which are not real.\n\nThis issue confused Abu Hamid al-Ghazali and others. Among the Shaykhs we met who were confused by this matter was Abu Ahmad ibn Saydabun in Wadi Asht. He and his peers used to say that delusion only affects a person as long as he is in the elemental world (عالم العناصر). If he ascends beyond it and the gates of heaven are opened to him, he is protected (عصم) from delusion, for he is in the world of preservation and protection (عصمة) from the rebellious devils (المردة والشياطين). Thus, everything he sees there is true. Let us explain to you what the truth is in this matter.\n\nWhat this group asserts—those who claim the removal of delusion in what they see because they are in places that devils cannot enter, places that are sanctified and purified as Allah described—is correct. The matter is indeed as they claim. However, this is only true if the ascent (المعراج) is physical and spiritual (جسما وروحا), like the ascent of the Messenger of Allah (may Allah bless him and grant him peace). But for one who ascends merely with his thought (خاطره) and spirituality (روحانيته), without the separation of death—rather, through annihilation (فناء) or a power of vision granted to him—while his body is in his house, either absent from it through annihilation or present with it due to a power he possesses, delusion is inevitable, unless this person possesses a divine sign (علامة إلهية) between himself and Allah, by which he is <<upon a clear proof from his Lord>> (عَلى‏ بَيِّنَةٍ من رَبِّهِ) regarding what he sees, witnesses, and is addressed with. If he has a sign by which he is <<upon a clear proof from his Lord>>, then he is safe; otherwise, delusion will occur, and he will lack certainty in knowledge, if he is fair-minded. What he witnesses may indeed be true, and he may be protected and preserved in reality, but he has no knowledge of this. When he is <<upon a clear proof from his Lord>>, then he is safe from delusion, just as the Prophets (peace be upon them) were safe regarding the revelation (الوحي) delivered to them in their homes.\n\nThis is because Satan (الشيطان) constantly monitors the state of this aspirant (المريد) who receives unveiling (المكاشف), whether he is among the people of signs or not. He is eager for misguidance (الإغواء) and delusion, and knowing that Allah may abandon His servant even after protecting him, he casts suggestions, saying \"Perhaps,\" and lives by hope and expectation. If the inner reality (باطن) of the human is protected from him, and he sees the lights of the angels surrounding this servant, he moves to his senses (حسه) and manifests things to him in sensory form, hoping to distract him from his path with Allah in his inner reality. This is what he does with every protected one (معصوم) preserved by the lights of the angels in his inner reality. But if he is protected in reality, yet there are no guardian angels over his inner reality, Satan comes to his heart. Since this person is protected in reality by the clear proof he holds from his Lord, he does not accept what is cast upon him. This is if he is not deeply versed in knowledge (متبحرا في العلم) and is merely the possessor of a limited station (مقام مقصور عليه).\n\nBut if he is a possessor of establishment (تمكين) and deep knowledge (تبحر) in Divine Science, he takes that suggestion from him, for it is a messenger from Allah to him. If the suggestion is praiseworthy (محمودا), he turns his eye to the mere taking, since he takes it from Allah, and does not pay attention to the intermediary (الواسطة), knowing its place with Allah is one of expulsion and distance. Thus, Satan returns disappointed (خاسئا), having intended one thing which was not completed for him; rather, it resulted in increased felicity for this person. But due to his eagerness for misguidance, he returns again and again. If what he brought was blameworthy (مذموما), the Gnostic turns his eye, and it becomes praiseworthy in his regard by directing it toward a pleasing outcome. Thus, Satan returns disappointed, having intended one thing which was not completed for him; rather, it resulted in felicity for this person.\n\nIf the state of this person is to receive from the Earth, Satan establishes an earth for him to receive from. Either the Gnostic sends him back disappointed and distinguishes between the two earths, or he is deeply versed in knowledge and thanks Allah for granting him an imagined earth (أرضا متخيلة) just as He granted him a sensory earth (أرضا محسوسة). He looks at the secret of Allah within it and takes from it the secrets Allah deposited there, which never occurred to Iblis's mind. Allah returns it to this person as an increase in his dominion. If his state is the Heaven, Satan establishes a heaven for him, similar to the heaven from which he receives, and introduces into it whatever deadly poisons he can. The Gnostic treats him as we mentioned regarding his treatment of him concerning the Earth. If he is not established in this station, he is deluded and swallows those deadly poisons, joining <<those whose deeds are the greatest losers>> (بِالْأَخْسَرِينَ أَعْمالًا).\n\nIf his state is at the Lote-Tree of the Utmost Boundary (سدرة المنتهى) or in an angel, Satan discloses to him an image of a Lote-Tree like it, or an image like the form of that angel, naming it by its name. Then he casts upon him what he knows is cast upon him from that station he is in, in order to delude him. If he is among the people of delusion, his enemy has triumphed over him. If he is protected, he is preserved from him, drives him away, and rejects what he brought, or takes it from Allah without him, and thanks Allah for what He bestowed and increased upon him. Then this person ascends to a higher state. If his state is the Throne (العرش), the Cloud ('Amā'), or the Divine Names (الأسماء الإلهية), Satan casts upon him, according to his state, a scale for a scale (a counterfeit). If he is among the people of delusion, the result is as we mentioned. If not, his affair is divided into the categories we mentioned.\n\nI have informed you that Satan only discloses himself to a person exactly according to his current state, in the form of that state, and according to what has settled in his mind from what the Sacred Law (الشريعة) has established. Do you not see Ibn Sayyad, when his devil (إبليسه) manifested the Throne to him, since that was his state? He saw that Throne upon the sea because he had seen Allah the Exalted say: <<And His Throne was upon the water>> (وَكَانَ عَرْشُهُ عَلَى الْمَاءِ). So, the Throne was disclosed to him upon the sea, and he was sitting upon it, receiving from it, while Ibn Sayyad imagined he was receiving from Allah.\n\nIndeed, Allah said, as the Messenger of Allah (may Allah bless him and grant him peace) informed him in His saying: <<And His Throne was upon the water>>. The Messenger of Allah (may Allah bless him and grant him peace) asked him, \"What do you see?\" He replied, \"I see the Throne.\" He asked, \"Where?\" He replied, \"Upon the sea.\" The Messenger of Allah (may Allah bless him and grant him peace) said to him, \"That is the throne of Iblis.\" The Messenger of Allah (may Allah bless him and grant him peace) concealed the Surah of Smoke (سورة الدخان) from the Quran for him. The Messenger of Allah (may Allah bless him and grant him peace) asked him, \"What have I concealed for you?\" He replied, \"Al-Dukh.\" *Al-Dukh* is a dialectal variation of *Al-Dukhān* (Smoke). The Messenger of Allah (may Allah bless him and grant him peace) said to him, \"Be off! You will not exceed your measure.\"\n\nMeaning, \"You are one whose affair has been confused.\" For the Prophet (may Allah bless him and grant him peace) only concealed the Surah of Smoke, which contains *al-Dukhān* (smoke) and other things. He did not conceal *al-Dukhān* itself, yet Ibn Sayyad came with the name of the Surah, not what was concealed for him, and he did not say *Surat al-Dukhān*, but rather *Al-Dukh*. And in this Surah, only *al-Dukhān* appears, not *Al-Dukh*, even if it is the same thing. Ibn Sayyad failed to distinguish between the Surah of Smoke and the smoke itself, so he was ignorant. For this reason, the Messenger of Allah (may Allah bless him and grant him peace) said to him, \"Be off! You will not exceed your measure,\" since he came from this Surah with what suited Iblis, who informed him of it—namely, that Satan is created from fire. He saw nothing of that concealed item except what was appropriate to him, and he did not know that it was the Surah of Smoke. Thus, he cast this much into Ibn Sayyad's heart in his terror.\n\nThis is because the Prophet (may Allah bless him and grant him peace) uttered the name of the Surah when he designated it in his mind, and Satan stole it and snatched it from his utterance. Had the Messenger of Allah (may Allah bless him and grant him peace) merely kept it secret in his mind, Iblis would not have known it, for he has no access to or view of the Prophet's heart (may Allah bless him and grant him peace), unlike the heart of the saint (الولي). For this reason, the Prophet is protected (معصوم) from whispering (الوسوسة), whether during the descent of revelation or otherwise—there is no difference. Do you not see that when Satan knew the Messenger of Allah (may Allah bless him and grant him peace) held this rank and divine care in the protection of his heart from Iblis's view, he came to him during prayer, in the direction of his *qibla*, with an imagined flame of fire and threw it in his face? His goal was to obstruct him from prayer due to the good he saw in it, for he naturally envies him. The Prophet (may Allah bless him and grant him peace) stepped back without breaking his prayer and informed his companions of this. As for the saint, suggestions may be cast into his heart, and Satan may hear what he speaks to himself, hoping to confuse his state, as we mentioned.\n\nWhoever is <<upon a clear proof from his Lord>> is felicitous, and the ambiguity is removed. The clear proof (البينة) upon which he stands must be a clear proof *for him*. If it is not a clear proof, he cannot judge by it. For there may be a sign (علامة) that is not a clear proof, and he imagines that the sign is the clear proof, but this is not the case. For the sign, if it is not a clear proof—which is the verification (التحقق) of it, and by which the Prophets and saints make definitive judgments regarding what comes to them from Allah—is insufficient.\n\nAbu al-Badr al-Tamashki al-Baghdadi, one of the truthful poor (الفقراء الصادقين), the cleanest in dress and the most eloquent in expression, informed me. He told me: \"A gathering brought me together with Shaykh Raghib al-Rahbi. He was one of the Gnostics, though he did not reach the rank of the perfected Gnostics (العارفين المكملين) in their work, according to what was conveyed to us. He told me concerning the Man of the Time (رجل الوقت) that he had seen a robe of honor (خلعة) issued for him from the Presence, and a sign had been given concerning that man. Yet, he had not seen him until now because he had not seen that sign.\" Abu al-Badr (may Allah be pleased with all of them) said to him: \"O Shaykh, have you not seen many men since then?\" He replied, \"Yes.\" Abu al-Badr asked, \"Were they among the great ones (الأكابر)?\" He replied, \"Yes, but I did not see that sign in any one of them.\" Abu al-Badr said to him, \"And what makes you know that one of those men you saw was not the one intended for that robe of honor, and that he concealed himself from you so that you would not recognize him?\" Raghib replied, \"That may be so.\"\n\n[Ibn Arabi comments:] This man possesses a sign, but he is not <<upon a clear proof>> regarding his sign. For the sign is only in the inner reality (الباطن) and does not depart from him, and it is by this that he is <<upon a clear proof from his Lord>> in himself. If the sign is placed in another person for him, that other person is the ruler of it: if he wills, he appears in it to him, and if he wills, he does not appear. For this reason, Raghib said what he said about the sign, and he did not clarify who was the locus of the sign, whether it was himself or that man. When he admitted the possibility of what Abu al-Badr said—that the man might have appeared to him in his sign—we knew with certainty, if we accept Raghib's claim, that the sign was in someone else. For he is not <<upon a clear proof from his Lord>>, so his sign is in another person. Therefore, what Abu al-Badr said may be correct: that the man may have appeared to him among the men he saw and concealed himself from him. Abu al-Badr's objection to this Gnostic is a correct and verified objection in the Path, and Raghib's admission of it is a truthful admission that indicates the sincerity of his claim. However, this Shaykh may be one who is not <<upon a clear proof>>, or he may be one of the people of clear proof, since the word *bayyina* (clear proof) did not occur in his claim, and he resorted instead to the *‘alāma* (sign), which allows for ambiguity.\n\nAs for Shaykh Abu al-Su'ud ibn al-Shibl, the Shaykh of the aforementioned Abu al-Badr, it is described of his states that he was <<upon a clear proof from his Lord>>, yet he was the most intelligent person of his time. Were it not for what the aforementioned Abu al-Badr related about him—that he rebuked a person who mentioned Abd al-Qadir, doing so with anger (بغيظ) and not with calmness and tranquility, and informed him that he knew Abd al-Qadir's state among his family and his state in his grave—he would have been a pure servant (عبدا محضا). However, he lived after this, so it is possible that he became a pure servant, because he did not rebuke this person for committing something forbidden by the Sacred Law; rather, the person was describing the states of Abd al-Qadir and the greatness of his station. Had the person committed a legal prohibition and Abu al-Su'ud rebuked him and became angry, that would not have removed him from being a pure servant. Glory be to Him who granted Abu al-Su'ud what He granted him! He was indeed the unique one of his time in his affair. Yes, if this speaker had been his disciple, it would have been incumbent upon him to rebuke him, because his rebuke is part of his spiritual training (تربيته). If he was one of his disciples, that rebuke does not remove him from his servitude (عبوديته).\n\nIf that rebuke from Abu al-Su'ud was based on a divine command addressed to him inwardly, for the benefit of the time regarding whoever it concerned, or out of divine jealousy (غيرة من الله) over a station concerning which this speaker had behaved improperly, then that rebuke confirms his servitude and does not remove him from it. This is the assumption regarding Abu al-Su'ud's state, not what we mentioned first. We only mentioned that, this, and what lies between them, so that we might fully cover the discussion of the station (المقام) with all the aspects it requires. This Shaykh must have been upon one of these aspects, though we have not definitively judged him to be upon one specific one. Thus, we have benefited the reader of this book with knowledge of this station and its states. Allah has not informed me of any of Abu al-Su'ud's states so that we might assign him to his station. Allah knows best which of these was the case, though I am certain that his scale among the Shaykhs was weighty. May Allah benefit us through his love and the love of the People of Allah (أهل الله). We have presented from this station some of the Crushers (القواصم) it contains, for they are all terrifying. <<And Allah speaks the Truth, and He guides to the Way>> (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).",
    "ur": "(باب نمبر دو سو تراسی: منزل القواصم (توڑنے والی چیزوں کی منزل) کی معرفت اور اس کے اسرار، جو الحضرة المحمدية (محمدی حضور) سے متعلق ہیں)\n\nاگر تم معاصم (بچانے والی چیزوں) کی محبت میں سرشار ہو، تو (قرآنی) آیات میں سے قواصم (توڑنے والی چیزوں) کی آیات کو یاد کرو۔\nکیونکہ ان (قواصم) میں اس (محبت) سے روک اور عصمت (بچاؤ) ہے، اور وہ کامیاب ہوا جسے عواصم (بچانے والی چیزوں) کی آیات زندہ کرتی ہیں۔\nاور یہ وہ امور ہیں جو میں نے فکر (سوچ) سے حاصل نہیں کیے، بلکہ یہ ایک قاسم (تقسیم کرنے والے) کے ہاتھ پر آئے۔\nاور خالقِ مخلوق عدل اور احسان عطا کرتا ہے، قہار (غالب) کی قصمہ (توڑ) اور عاصم (بچانے والے) کی عصمت (حفاظت) کے ذریعے سے۔\nپس کتنا فرق ہے اس شخص میں جو فرشتوں کے ساتھ ملحق ہے، اور اس چھوٹے شخص میں جو بہائم (چوپایوں) کے ساتھ ملحق ہے۔\n\nجان لو کہ جب میں اپنے معراج کے وقت اس منزل (منزل) پر پہنچا، جس میں مجھے عروج دیا گیا تاکہ اللہ سبحانہ اپنی آیات میں سے جو چاہے مجھے دکھائے، اور میرے ساتھ فرشتہ تھا، تو میں نے اس کے دروازے پر دستک دی۔ میں نے دروازے کے پیچھے سے ایک کہنے والے کو سنا جو کہہ رہا تھا: \"کون ہے جو اس مجہول منزل کا دروازہ کھٹکھٹا رہا ہے، جسے اللہ کے تعارف کے بغیر نہیں جانا جا سکتا؟\" تو فرشتے نے کہا: \"حضور (الحضرة) کا بندہ، آپ کا بندہ محمد بن نور۔\" پس دروازہ کھل گیا اور میں اس میں داخل ہوا۔ الحق (ذات حق) نے مجھے وہ سب کچھ بتا دیا جو اس میں تھا، لیکن میرے اس کے مشاہدے (الشہود) کے کئی سال بعد۔ پس وہ ایک صوری مشاہدہ تھا بغیر کسی تعریف (شناخت) کے، پھر اس کے بعد اس کا تعارف واقع ہوا۔ جب اس نے مجھے یہ بتایا کہ یہ ایک مجہول منزل ہے، تو میری کمر ٹوٹ گئی (قصم ظهري)۔ اور جب اس کا تعارف واقع ہوا، تو میں نے اسے مکمل طور پر قواصم (توڑنے والی چیزیں) پایا، سوائے اس کے کہ اللہ اس سے بچائے جو میں نے دیکھا۔ پس میں ڈر گیا، تو اللہ نے میرے خوف کو اس چیز سے تسکین دی جو اس نے مجھ پر ظاہر (تجلی) کی۔\n\nمیں نے اس منزل میں حسی صورتوں کا جسمانی صورتوں میں تبدیل ہونا دیکھا، جیسا کہ روحانی ہستیاں مختلف صورتوں میں متشکل ہوتی ہیں۔ میں نے تصور کیا کہ وہ پہلی صورتیں ختم ہو گئیں، تو میں نے ان پر غور کیا، لیکن میں انہیں سمجھ نہ سکا یہاں تک کہ مجھے ان پر قوت عطا کی گئی، پس وہ تبدیل ہو گئیں اور میں نے مطلوب کو پا لیا۔ یہ تحول (تبدیلی) دو قسم کا ہے۔ پہلی قسم یہ ہے کہ تمہیں ایسی قوت دی جائے جس کے ذریعے تم دیکھنے والے کی آنکھ میں جو چاہو اثر انداز ہو جاؤ، ان صورتوں میں جن میں تم اس کے سامنے ظاہر ہونا چاہتے ہو، تو وہ تمہیں صرف اسی صورت میں دیکھتا ہے، جبکہ تم خود اپنی ذات میں اپنی اصل صورت پر ہو، نہ تمہارے جوہر میں کوئی تبدیلی آئی ہے اور نہ تمہاری صورت میں۔ البتہ، یہ ضروری ہے کہ تم اس صورت کو اپنے خیال (خيال) میں حاضر کرو جس میں تم دیکھنے والے کے سامنے ظاہر ہونا چاہتے ہو، تو دیکھنے والے کی بصارت اسے تمہارے خیال میں اسی طرح پاتی ہے جس طرح تم نے اس کا تصور کیا ہے۔ اور یہ نظر اس وقت اسے تمہاری جانی پہچانی صورت کے ادراک سے روک دیتی ہے۔ یہ ایک طریقہ ہے۔\n\nاور دوسرا طریقہ جو یہ منزل اپنے اندر رکھتی ہے، وہ یہ ہے کہ وہ صورت جس پر تم ہو، تمہارے جوہر میں ایک عرض (عارضی صفت) ہے۔ پس اللہ اس عرض کو زائل کر دیتا ہے اور تمہیں وہ صورت پہنا دیتا ہے جس میں تم ظاہر ہونا چاہتے ہو، جیسے سانپ، شیر، یا کوئی اور انسانی شخص۔ اور تمہارا جوہر (جوہر) باقی رہتا ہے، اور تمہاری روح جو تمہارے جوہر کو تدبیر کرتی ہے، وہ عقل اور تمام قوتوں کے لحاظ سے اسی حالت پر رہتی ہے۔ پس صورت تو کسی حیوان، نبات یا جماد کی ہوتی ہے، لیکن عقل انسان کی ہوتی ہے، اور وہ بولنے اور کلام کرنے پر قادر ہوتی ہے۔ اگر وہ چاہے تو کلام کرے، اور اگر چاہے تو کلام نہ کرے، جس زبان میں بھی الحق (ذات حق) اسے ناطق کرنا چاہے۔ پس اس کا حکم وہی ہوتا ہے جو جانی پہچانی صورت کا حکم ہے۔ اسی باب سے جمادات، نباتات اور حیوانات کے نطق (بولنے) کی معرفت (المعرفۃ) ہوتی ہے، جبکہ وہ اپنی صورتوں پر ہوتے ہیں، اور تم ان کی آواز کو انسان کے کلام کی طرح سنتے ہو۔ جیسا کہ جب روح بشر کی صورت میں مجسم ہوتی ہے، تو وہ بشر کا کلام کرتی ہے، کیونکہ صورت کا حکم اس پر غالب ہوتا ہے۔ روحانی ہستی میں یہ قوت نہیں ہوتی کہ وہ اس صورت کے علاوہ کسی اور کلام میں بات کرے جس میں وہ ظاہر ہوئی ہے، برخلاف انسان کے جو انسان کی صورت میں نہیں ہوتا۔\n\nیہ منزل (منزل) اس حضرہ (حضور) سے مسخ (صورت بدلنے) کی منزل ہے۔ حسی صورت دنیا اور آخرت میں مسخ ہو جاتی ہے۔ اور اسی منزل سے باطن (بواطن) مسخ ہوتے ہیں، تو تم صورت کو انسانوں کی دیکھتے ہو، لیکن باطن میں وہ صورت مختلف ہوتی ہے، جیسے فرشتہ یا شیطان جو کسی مناسب حیوان کی صورت میں ہوتا ہے، جیسا کہ کتا، خنزیر، بندر یا شیر، جو اس کے باطن کے مطابق ہو۔ اور یہ سب کچھ اس کے انسانی تقاضوں کے خلاف ہوتا ہے، خواہ وہ اعلیٰ ہو یا ادنیٰ۔ اور باطن کا مسخ اس زمانے میں بہت زیادہ ہو گیا ہے، جیسا کہ بنی اسرائیل میں ظاہری صورت کا مسخ ظاہر ہوا تھا جب اللہ نے انہیں بندر اور خنزیر بنا دیا تھا۔ اور آخر زمانے میں اس امت میں بھی مسخ کا ظاہر ہونا ضروری ہے، لیکن ان میں سے صرف یہودیوں میں، نہ کہ مسلمانوں میں۔ کیونکہ ایمان ان کی حفاظت کرتا ہے۔ پس اس امت میں سے صرف یہودی یا منافق ہی مسخ ہوگا جو اسلام ظاہر کرتا ہے اور یہودیت چھپاتا ہے۔ ہم نے یہودیوں کو اس امت کے ساتھ اس لیے ملحق کیا ہے کہ نبی کی امت صرف ان کا قبیلہ نہیں ہے، بلکہ ان کی امت وہ تمام لوگ ہیں جن کی طرف انہیں مبعوث کیا گیا ہے۔ اور محمد صلی اللہ علیہ وسلم تمام لوگوں کی طرف عام طور پر مبعوث کیے گئے، پس تمام مذاہب کے لوگ ان کی امت ہیں، ان میں سے کچھ ایمان لائے، کچھ نے کفر کیا، اور کچھ نے اسلام قبول کیا۔ جہاں تک جنات کا آپ صلی اللہ علیہ وسلم کے دین میں داخل ہونا ہے، تو ان کا آپ کے دین میں داخل ہونا ایسا ہی تھا جیسا کہ اس شخص کا داخل ہونا جس کی طرف اس کے وقت میں کوئی نبی مبعوث نہیں ہوا تھا، اس کے وقت کے نبی کے دین میں۔ پھر اگر وہ نبی جس کی طرف وہ مبعوث نہیں ہوا، اگر وہ داخل ہونے والا ان میں سے نہ ہو جن کی طرف کوئی دوسرا نبی مبعوث ہوا ہے، تو اس کے احکام ان پر جاری ہوں گے جن کی طرف وہ مبعوث ہوا ہے، کیونکہ ہر نبی کے لیے ایک شِرْعَةً (شریعت) اور مِنْهاجاً (طریقہ) ہے۔ پس جنات کا رسول اللہ صلی اللہ علیہ وسلم پر ایمان اسی طرح تھا۔\n\nاور جہاں تک باطن کے مسخ کا تعلق ہے جس کا ہم نے ذکر کیا ہے، تو وہ نبی صلی اللہ علیہ وسلم کا قول ہے، جس میں آپ اپنے رب کی طرف سے اپنی امت کے ایک گروہ کی صفت بیان کرتے ہیں:\n**حدیث:** \"وہ اپنے رب کی طرف سے اپنی امت کے ایک گروہ کی صفت بیان کرتے ہیں کہ وہ علانیہ طور پر بھائی ہیں، لیکن باطن کے دشمن ہیں۔ ان کی زبانیں شہد سے زیادہ میٹھی ہیں اور ان کے دل بھیڑیوں کے دل ہیں۔ وہ لوگوں کے لیے نرمی کی وجہ سے بھیڑوں کی کھالیں پہنتے ہیں۔\"\nپس یہی باطن کا مسخ ہے کہ اس کا دل بھیڑیے کا دل ہو اور اس کی صورت انسان کی صورت ہو۔ پس اللہ ہی ان قواصم (توڑنے والی چیزوں) سے بچانے والا (العاصم) ہے۔\n\nاور صورت میں تحول (تبدیلی) کا ایک اور طریقہ یہ ہے کہ اس شخص کی صورت اسی طرح باقی رہے جیسی وہ تھی، اور وہ اپنے آپ کو ایک روحانی (روحانی) کی صورت پہنا دے۔ وہ روحانی اس شخص کی مرضی کے مطابق کسی بھی صورت میں ظاہر ہو سکتا ہے جس میں وہ دیکھنے والے کے سامنے ظاہر ہونا چاہتا ہے۔ اور یہ شخص اس صورت میں غائب ہو جاتا ہے، اور وہ صورت اس کے گرد گھیرنے والی ہوا کی طرح ہوتی ہے۔ پس دیکھنے والے کی آنکھ اس شیری، کتّی، یا بندری صورت پر پڑتی ہے، یا جو بھی وہ ہو، اور یہ سب کچھ العزیز العلیم (غالب، جاننے والے) کی تقدیر سے ہوتا ہے۔\n\nاور ایک اور طریقہ یہ ہے کہ اس کے گرد گھیرنے والی ہوا کو کسی بھی صورت میں متشکل کر دیا جائے جو وہ چاہے، اور وہ شخص اس صورت کے باطن میں ہو۔ پس ادراک اس ہوائی صورت پر پڑتا ہے جو اس صورت میں متشکل ہوئی ہے جس میں وہ ظاہر ہونا چاہتا تھا۔ لیکن اگر اس صورت سے کوئی نطق (بول) واقع ہو، تو وہ صرف اس کی جانی پہچانی آواز (نغمة) میں ہی واقع ہوگا جو دیکھنے والے کے نزدیک معروف ہے۔ پس وہ آواز کو سنتا ہے اور اسے پہچانتا ہے، لیکن صورت کو دیکھتا ہے اور اس کا انکار کرتا ہے۔ جس شخص کی یہ حالت ہو، اس کے لیے اپنی آواز سے ہٹنا ممکن نہیں ہے۔ یہ جنات کی قوت ہے، ان لوگوں کے لیے جو انہیں جانتے ہیں۔ کیونکہ وہ جس صورت میں چاہیں ظاہر ہوتے ہیں، لیکن ان کی آواز جن کی آواز (نغمة جن) ہوتی ہے، وہ اس سے زیادہ پر قادر نہیں ہوتے۔ اور جو شخص اس حد تک معرفت (المعرفۃ) نہیں رکھتا، تو اسے جنات کی کوئی معرفت نہیں، سوائے اس کے کہ کچھ لوگ ایسے ہیں جن کے عقلوں سے جنات کھیلتے ہیں، تو ان کی آنکھوں میں صورتیں پیدا کر دیتے ہیں، جیسا کہ جادوگر رسیوں کو چلتے ہوئے سانپوں کی صورت میں دکھاتا ہے۔ پس وہ سمجھتے ہیں کہ وہ جنات کو دیکھ رہے ہیں، حالانکہ وہ جنات نہیں ہوتے، اور وہ صورتیں ان سے بات کرتی ہیں جو ان کے خیال میں ڈالی جاتی ہیں، حالانکہ وہ صورتیں خود کلام کرنے والی نہیں ہوتیں، برخلاف اس کے جب جنات خود اپنے آپ میں مجسم ہوتے ہیں۔\n\nپس عارفین (العارفين) میں سے جو شخص ہر گروہ کی آوازوں (نغمات) کو پہچانتا ہے، وہ جان لیتا ہے کہ اس نے کیا دیکھا، اور جو کچھ اس نے دیکھا اس میں اس پر کوئی تلبيس (دھوکہ) نہیں ہوتا۔ ہم نے اندلس میں ایک گروہ کو دیکھا جو جنات کو بغیر تشکل کے بھی دیکھتے تھے اور ان کے تشکل میں بھی۔ ان میں قرطبہ کی فاطمہ بنت ابن المثنیٰ بھی تھیں، جو بغیر کسی تلبيس کے انہیں جانتی تھیں۔ اور میں نے فاس شہر میں ایک گروہ کو دیکھا جن کی آنکھوں میں جنات صورتیں پیدا کر دیتے تھے اور ان سے جو چاہتے تھے بات کرتے تھے تاکہ انہیں فتنے میں ڈالیں، حالانکہ وہ نہ جنات تھے اور نہ جنات کی شکل میں۔ ان میں فاس شہر کے ابو العباس الزقاق بھی تھے، جن پر اس معاملے میں دھوکہ (لبس) ڈالا گیا تھا۔ وہ یہ تصور کرتے تھے کہ جناتی ارواح ان سے مخاطب ہیں اور وہ اس پر یقین رکھتے تھے۔ اس کی وجہ ان کی آواز (نغمتهم) سے ناواقفیت تھی۔ جب وہ میرے پاس بیٹھتے اور میری مجلس میں حاضر ہوتے تو حیران رہ جاتے، پھر جو کچھ دیکھتے تھے بیان کرتے۔ پس میں جانتا تھا کہ ان کے لیے صرف خیال پیدا کیا جا رہا ہے۔ وہ اس میں ملاعبت (کھیل)، مصاحبت اور گفتگو کی حد تک پہنچ گئے تھے۔ اور بعض اوقات ان کے اور اس شخص کے درمیان جو وہ دیکھتے تھے، امور میں جھگڑا اور انکار بھی واقع ہوتا تھا، تو جنات انہیں دوسرے طریقے سے نقصان پہنچاتے تھے، اور وہ یہ تصور کرتے تھے کہ نقصان ان صورتوں سے صادر ہوا ہے۔ اللہ ان پر رحم کرے، یہ حالت ان پر غالب آ گئی تھی۔ ابو العباس الدہان اور ہمارے تمام ساتھی یہ سب ان سے دیکھتے تھے۔ پس جو شخص آوازوں کو پہچانتا ہے، اس پر صورت کبھی بھی مشتبہ نہیں ہوتی۔ اور بہت کم لوگ ہیں جو یہ جانتے ہیں، اور وہ ان صورتوں کے بعض اوقات ظاہر ہونے والی سچائی سے دھوکہ کھا جاتے ہیں۔\n\nپس ہم نے تمہیں اس منزل (منزل) سے صورتوں میں تحول (تبدیلی) کے مراتب بیان کر دیے، اور اس میں صورتوں کے ظہور کے بہت سے عجائبات ہیں جو عقلوں کو حیران کر دیتے ہیں۔ اور ان میں سب سے بڑا مزاج کا دوسرے مزاج میں تبدیل ہونا ہے، جبکہ اس صورت کو اٹھانے والا جوہر (جوہر) باقی رہتا ہے، جو ضروری ہے۔ اگر جوہر باقی نہ رہے، تو پھر کوئی تحول نہیں ہوا، بلکہ یہ ایک دوسرا جوہر ہے جو اپنی صورت میں تبدیل نہیں ہوا، اور نہ ہی وہ پہلا جوہر ہے۔ جیسا کہ زید، عمر نہیں ہے۔ اور اسی منزل (منزل) سے ابوبکر صدیق رضی اللہ عنہ کا پوری امت کے ساتھ وزن کیا جانا ہے، تو وہ غالب آ گئے۔ یہ مخلوقات کے درمیان وزن (الوزن) کی حضرہ (حضور) کی منزل ہے۔ اور جو شخص اس منزل میں موجود چیزوں کو جانتا ہے اور اس کے حکم کا مشاہدہ کرتا ہے، اور اس کے لیے مخلوقات کے میزان (موازین) کو اس حال اور مقام پر اٹھا دیا جاتا ہے جس پر اللہ نے انہیں رکھا ہے، تو وہ فرشتوں کے ایک دوسرے پر فضیلت، لوگوں کے ایک دوسرے پر فضیلت، جنات کے ایک دوسرے پر فضیلت، حیوانات کے ایک دوسرے پر فضیلت، نباتات کے ایک دوسرے پر فضیلت، اور جمادات کے ایک دوسرے پر فضیلت کو جانتا ہے۔ اور فرشتوں اور بشر کے درمیان، جنات اور بشر کے درمیان، اور جمادات، نباتات اور بشر کے درمیان فضیلت کو بھی جانتا ہے۔ اور ہر جنس کی دوسری جنس پر فضیلت کو بھی جانتا ہے۔ اور یہیں سے حجر اسود کی فضیلت معلوم ہوتی ہے، باوجود اس کے کہ وہ جماد ہے، اور وہ اللہ کا دایاں ہاتھ ہے۔ پس اس رتبے کو دیکھو، حالانکہ وہ جماد ہے، اور فرعون اور ابو جہل کو دیکھو، حالانکہ وہ انسان ہیں۔\n\nاور اسی منزل سے، جب تم ان فضیلتوں پر کھڑے ہوتے ہو، تو تم جنت کو ان اجناس میں سرایت کرتے ہوئے دیکھتے ہو جو ان اجناس میں سے گزرتے ہیں، اور انواع کی انواع میں، آخری درجے تک، جو آخری نوع کے اشخاص ہیں۔ اور تم آگ کو بھی اجناس میں سرایت کرتے ہوئے دیکھتے ہو، گرم اور زمہریر (سخت سردی) کے درمیان، اور انواع کی انواع میں، یہاں تک کہ وہ آخری نوع کے اشخاص تک پہنچتی ہے۔ پس تم ہر اس شخص پر حکم لگاتے ہو جس کا تم مشاہدہ کرتے ہو، اس چیز کے مطابق جو تم مشاہدہ کرتے ہو، کیونکہ تم اس کا مشاہدہ اس کے انجام کے لحاظ سے کرتے ہو، نہ کہ اس کے وقت کے لحاظ سے۔ اور یہاں اس حضرہ (حضور) کے مقابلے میں ایک خیالی حضرہ (حضرة خيالية) سے تلبيس (دھوکہ) واقع ہوتا ہے، تو وہ اس چیز کا مشاہدہ کرتا ہے جو وقت کا شاہد اسے دیتا ہے، اور وہ اس پر انجام کا حکم لگا دیتا ہے۔ اور یہ ایک شیطانی تلبيس ہے، اس صفت سے جو ہم نے ابھی ذکر کی ہے کہ جنات اور شیاطین لوگوں کے لیے ان کے بارے میں اور دوسروں کے بارے میں صورتیں پیدا کرتے ہیں، حالانکہ وہ حقیقت نہیں ہوتیں۔ اور یہ وہ مسئلہ ہے جس میں ابو حامد الغزالی اور دیگر لوگ الجھ گئے تھے۔ اور ان شیوخ میں سے جنہیں ہم نے پایا، جن پر یہ معاملہ مشتبہ ہوا، وادی اشْت کے ابو احمد بن سید بون تھے۔ وہ اور ان جیسے لوگ کہتے تھے کہ انسان پر تلبيس (دھوکہ) صرف اس وقت تک طاری ہوتا ہے جب تک وہ عالم العناصر (عناصر کی دنیا) میں ہوتا ہے۔ پس جب وہ ان سے اوپر اٹھ جاتا ہے اور اس کے لیے آسمان کے دروازے کھول دیے جاتے ہیں، تو وہ تلبيس سے محفوظ ہو جاتا ہے، کیونکہ وہ ماردین (سرکش شیاطین) اور شیاطین سے حفظ (حفاظت) اور عصمت (بچاؤ) کے عالم میں ہوتا ہے۔ پس جو کچھ وہ وہاں دیکھتا ہے وہ حق ہوتا ہے۔\n\nپس ہم تمہارے لیے اس میں حق کو واضح کرتے ہیں کہ وہ کیا ہے۔ وہ یہ ہے کہ جس بات کی طرف یہ گروہ گیا ہے، جو ہم نے ان سے نقل کی ہے کہ وہ جو کچھ دیکھتے ہیں اس میں تلبيس کا اٹھ جانا، اس وجہ سے کہ وہ ایسی جگہوں پر ہیں جہاں شیاطین داخل نہیں ہو سکتے، اور وہ جگہیں مقدس اور پاکیزہ ہیں جیسا کہ اللہ نے ان کی صفت بیان کی ہے، یہ صحیح ہے کہ معاملہ ویسا ہی ہے جیسا انہوں نے گمان کیا، لیکن جب معراج جسم اور روح کے ساتھ ہو، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم کا معراج تھا۔ لیکن جس شخص کو اس کے خاطر (خیال) اور روحانیت کے ساتھ عروج دیا گیا ہو، بغیر موت کے انفصال کے، بلکہ فنا (الفناء) یا ایسی قوتِ نظر کے ساتھ جو اسے عطا کی گئی ہو، اور اس کا جسم اس کے گھر میں ہو، اور وہ اس سے فنا کی وجہ سے غائب ہو، یا اس قوت کی وجہ سے اس کے ساتھ حاضر ہو جو اس پر ہے، تو تلبيس (دھوکہ) کا ہونا ضروری ہے، اگر اس شخص کے پاس اللہ اور اس کے درمیان کوئی الٰہی علامت (علامة إلهية) نہ ہو، جس میں وہ اپنے رب کی طرف سے جو کچھ دیکھتا، مشاہدہ کرتا اور جس سے مخاطب ہوتا ہے، اس پر بَيِّنَةٍ (واضح دلیل) پر ہو۔ پس اگر اس کے پاس کوئی علامت ہو جس سے وہ اپنے رب کی طرف سے بَيِّنَةٍ پر ہو، ورنہ اسے تلبيس حاصل ہو جائے گا، اور اگر وہ منصف ہو تو اس علم میں قطعیت حاصل نہیں کر سکتا۔ اور ہو سکتا ہے کہ جو کچھ اس نے مشاہدہ کیا ہو وہ حق ہو، اور وہ فی نفسہ معصوم اور محفوظ ہو، لیکن اسے اس کا علم نہ ہو۔ پس جب وہ اپنے رب کی طرف سے بَيِّنَةٍ پر ہوتا ہے، تب وہ تلبيس سے محفوظ ہو جاتا ہے، جیسا کہ انبیاء علیہم السلام اپنے گھروں میں وحی کے القاء کے معاملے میں محفوظ رہے۔\n\nیہ اس لیے کہ شیطان اس مریدِ مکاشف (الکشف) کے حال کی مسلسل نگرانی کرتا رہتا ہے، خواہ وہ اہل علامات میں سے ہو یا نہ ہو۔ کیونکہ اسے گمراہ کرنے اور دھوکہ دینے (الإغواء والتلبيس) کی حرص ہوتی ہے، اور اس علم کی وجہ سے کہ اللہ اپنے بندے کو اس کی عصمت کے بعد بھی چھوڑ سکتا ہے، تو وہ کہتا ہے: \"شاید\" اور امید اور توقع پر جیتا ہے۔ اور اگر انسان کا باطن اس سے محفوظ ہو جائے اور وہ فرشتوں کے انوار کو اس بندے کے گرد گھیرے ہوئے دیکھے، تو وہ اس کے حس (حواس) کی طرف منتقل ہو جاتا ہے، اور اس کے لیے حسی صورت میں ایسے امور ظاہر کرتا ہے کہ شاید وہ اسے اس راستے سے ہٹا دے جس پر وہ اپنے باطن میں اللہ کے ساتھ ہے۔ اور یہ اس کا فعل ہر اس معصوم محفوظ کے ساتھ ہے جس کے باطن میں فرشتوں کے انوار کی حفاظت ہو۔\n\nلیکن اگر وہ فی نفسہ معصوم ہو اور اس کے باطن پر فرشتوں کی حفاظت نہ ہو، تو شیطان اس کے دل کی طرف آتا ہے۔ اور یہ شخص فی نفسہ معصوم ہونے کی وجہ سے، اس بَيِّنَةٍ کی وجہ سے جو اسے اپنے رب کی طرف سے حاصل ہے، اس کی طرف سے القاء کی گئی چیز کو قبول نہیں کرتا۔ یہ تب ہے جب وہ علم میں گہرائی نہ رکھتا ہو اور صرف ایک مخصوص مقام کا مالک ہو۔ لیکن اگر وہ تمکین (استحکام) اور علم الٰہی میں گہرائی (تبحر) کا مالک ہو، تو وہ اسے شیطان سے لے لیتا ہے، کیونکہ وہ اللہ کی طرف سے اس کے لیے ایک رسول (پیغام رساں) ہے۔ اگر وہ (القاء) قابل تعریف ہو، تو وہ صرف لینے کے وقت اپنی نظر کو پلٹ دیتا ہے، جہاں اس نے اسے اللہ سے لیا، اور واسطے کی طرف توجہ نہیں کرتا، کیونکہ وہ اللہ کے نزدیک اس کے مقام کو جانتا ہے کہ وہ دھتکارا ہوا اور دور ہے۔ پس وہ ذلیل ہو کر پلٹ جاتا ہے، جہاں اس نے ایک کام کا ارادہ کیا تھا لیکن وہ پورا نہ ہوا، بلکہ اس شخص کے لیے سعادت میں اضافہ ہوا۔ لیکن گمراہ کرنے کی حرص کی وجہ سے وہ بار بار اس کی طرف لوٹتا ہے۔ اور اگر وہ (القاء) قابل مذمت ہو، تو وہ اپنی نظر کو پلٹ دیتا ہے، تو وہ اس کے حق میں قابل تعریف ہو جاتا ہے، اس طرح کہ وہ اسے پسندیدہ مصرف پر خرچ کرتا ہے۔ پس وہ ذلیل ہو کر پلٹ جاتا ہے، جہاں اس نے ایک کام کا ارادہ کیا تھا لیکن وہ پورا نہ ہوا، بلکہ اس شخص کے لیے سعادت کا باعث بنا۔\n\nپس اگر اس شخص کا حال زمین سے لینا ہو، تو شیطان اس کے لیے ایک زمین کھڑی کر دیتا ہے تاکہ وہ اس سے لے۔ پس یا تو وہ اسے ذلیل کر کے لوٹا دیتا ہے اور دونوں زمینوں میں فرق کر دیتا ہے، یا پھر وہ گہرائی رکھنے والا ہوتا ہے، تو وہ اللہ کا شکر ادا کرتا ہے کہ اس نے اسے ایک خیالی زمین بھی عطا کی، جیسا کہ اسے محسوس زمین عطا کی، اور وہ اس میں اللہ کے راز کو دیکھتا ہے اور اس میں سے وہ اسرار لے لیتا ہے جو ابلیس کے وہم و گمان میں بھی نہیں آئے تھے، اور اللہ اسے اس شخص کے لیے اس کی بادشاہت میں اضافہ کر دیتا ہے۔ اور اگر اس کا حال آسمان ہو، تو شیطان اس کے لیے ایک آسمان کھڑا کر دیتا ہے، جیسا کہ وہ آسمان جس سے وہ لیتا ہے، اور اس میں وہ زہریلے مادے ڈال دیتا ہے جو وہ کر سکتا ہے۔ تو عارف اس کے ساتھ وہی معاملہ کرتا ہے جو ہم نے زمین کے معاملے میں اس کے ساتھ کرنے کا ذکر کیا ہے۔ اور اگر وہ اس مقام پر نہ ہو، تو وہ اس پر دھوکہ ڈال دیتا ہے اور وہ زہریلے مادے پی لیتا ہے اور **الْأَخْسَرِينَ أَعْمَالًا** (اعمال میں سب سے زیادہ خسارہ پانے والوں) میں شامل ہو جاتا ہے۔ اور اگر اس کا حال سدرۃ المنتہیٰ (سدرة المنتهى) میں ہو یا کسی فرشتے کے ملک میں ہو، تو وہ اس کے لیے اس جیسی سدرہ کی صورت یا اس فرشتے جیسی صورت ظاہر کرتا ہے، اور اسے اس کے نام سے پکارتا ہے، پھر اس پر وہ چیز القاء کرتا ہے جو وہ جانتا ہے کہ اسے اس مقام سے القاء کی جائے گی جس میں وہ ہے، تاکہ اس پر دھوکہ ڈالے۔ پس اگر وہ اہل تلبيس میں سے ہو، تو اس کے دشمن نے اسے پا لیا۔ اور اگر وہ معصوم ہو، تو وہ اس سے محفوظ رہتا ہے، پس وہ اسے دھتکار دیتا ہے اور جو کچھ وہ لایا ہے اسے پھینک دیتا ہے، یا اسے اللہ سے لیتا ہے، نہ کہ اس کے ذریعے، اور اللہ کا شکر ادا کرتا ہے کہ اس نے اسے نوازا اور مزید عطا کیا۔ پھر یہ شخص ایک اعلیٰ حال کی طرف ترقی کرتا ہے۔ اگر اس کا حال عرش (العرش) یا عماء (العماء) یا اسماء الٰہیہ (الأسماء الإلهية) میں ہو، تو شیطان اس کے حال کے مطابق میزان کے مقابلے میں ایک میزان القاء کرتا ہے۔ اگر وہ اہل تلبيس میں سے ہو، تو وہی ہوگا جو ہم نے ذکر کیا، اور اگر نہ ہو، تو اس کا معاملہ اس میں تقسیم ہو جائے گا جو ہم نے ذکر کیا ہے۔ پس میں نے تمہیں بتا دیا کہ شیطان شخص کے لیے صرف اسی صورت میں ظاہر ہوتا ہے جو اس کے حال کے مطابق ہو، اور اس کے ذہن میں جو کچھ شریعت نے مقرر کیا ہے، اس کے مطابق ہو۔ کیا تم ابن صیاد کو نہیں دیکھتے، جب اس کے شیطان نے اس کے لیے عرش ظاہر کیا، کیونکہ اس کا حال یہی تھا، اور اس نے اس عرش کو سمندر پر دیکھا، کیونکہ اس نے اللہ تعالیٰ کو یہ فرماتے ہوئے دیکھا تھا: **وَكَانَ عَرْشُهُ عَلَى الْمَاءِ** (اور اس کا عرش پانی پر تھا)۔ [ہود: 7] پس اس نے اس کے لیے عرش کو سمندر پر ظاہر کیا، اور وہ اس پر بیٹھا ہوا تھا، اور ابن صیاد اس سے لے رہا تھا اور یہ تصور کر رہا تھا کہ وہ اللہ سے لے رہا ہے۔\n\nکیونکہ اللہ نے فرمایا، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے خبر دی، آپ کے اس قول میں: **وَكَانَ عَرْشُهُ عَلَى الْمَاءِ**۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا: \"تم کیا دیکھتے ہو؟\" اس نے کہا: \"میں عرش دیکھتا ہوں۔\" آپ نے پوچھا: \"کہاں؟\" اس نے کہا: \"سمندر پر۔\" تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: \"وہ ابلیس کا عرش ہے۔\" اور رسول اللہ صلی اللہ علیہ وسلم نے اس کے لیے قرآن کی سورۃ الدخان کو چھپا رکھا تھا۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا: \"میں نے تمہارے لیے کیا چھپایا ہے؟\" اس نے کہا: \"الدخ۔\" اور الدخ، الدخان (دھواں) کی ایک لغت ہے۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: \"اخسأ فلن تعدو قدرك\" (دھتکارا جا، تو اپنی حد سے آگے نہیں بڑھ سکتا)۔\n\nیعنی تم ان لوگوں میں سے ہو جن پر معاملہ مشتبہ ہو گیا ہے۔ کیونکہ آپ صلی اللہ علیہ وسلم نے اس کے لیے صرف سورۃ الدخان چھپائی تھی، اور وہ الدخان اور اس کے علاوہ پر مشتمل ہے۔ پس آپ نے اس کے لیے الدخان نہیں چھپایا تھا، بلکہ وہ سورۃ کے نام سے آیا، نہ کہ اس چیز سے جو آپ نے چھپائی تھی۔ اور اس نے سورۃ الدخان نہیں کہا، بلکہ صرف الدخ کہا۔ اور اس سورت میں صرف الدخان آیا ہے، نہ کہ الدخ، اگرچہ وہ بعینہ وہی ہے۔ پس ابن صیاد نے سورۃ الدخان اور الدخان کے درمیان فرق نہیں کیا، اور وہ جاہل رہا۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: \"اخسأ فلن تعدو قدرك\" (دھتکارا جا، تو اپنی حد سے آگے نہیں بڑھ سکتا)، کیونکہ وہ اس چھپی ہوئی چیز میں سے صرف وہی لایا جو اس ابلیس کے مناسب تھا جس نے اسے یہ معرفت دی تھی، اور وہ یہ کہ شیطان آگ سے پیدا کیا گیا ہے۔ پس اس نے اس چھپی ہوئی چیز میں سے صرف وہی دیکھا جو اس کے مناسب تھا، اور اسے یہ معلوم نہ ہوا کہ یہ سورۃ الدخان ہے۔ پس شیطان نے ابن صیاد کے دل میں یہ مقدار القاء کر دی۔ اور یہ اس لیے ہوا کہ نبی صلی اللہ علیہ وسلم نے جب اس سورت کو اپنے دل میں متعین کیا تو اس کے نام کا تلفظ کیا، تو شیطان نے اسے چرا لیا اور آپ کے لفظ سے اچک لیا۔ اگر رسول اللہ صلی اللہ علیہ وسلم اسے اپنے دل میں چھپا لیتے تو ابلیس اسے نہ جان پاتا، کیونکہ اسے آپ صلی اللہ علیہ وسلم کے قلب پر کوئی اطلاع یا جھانکنے کی قدرت نہیں، برخلاف ولی کے قلب کے۔\n\nاسی لیے نبی (صلی اللہ علیہ وسلم) وحی کے نزول کے وقت اور اس کے علاوہ بھی وسوسے سے معصوم ہیں۔ کوئی فرق نہیں۔ کیا تم نہیں دیکھتے کہ جب شیطان نے جان لیا کہ رسول اللہ صلی اللہ علیہ وسلم اس مقام پر ہیں اور اللہ کی طرف سے ان کے قلب کی عصمت میں ابلیس کے جھانکنے سے حفاظت ہے، تو وہ نماز میں آپ کے قبلے کی طرف ایک خیالی آگ کا شعلہ لے کر آیا اور اسے آپ کے چہرے پر پھینک دیا۔ اس کا مقصد یہ تھا کہ آپ کو نماز سے روک دے، کیونکہ وہ اس میں آپ کے لیے خیر دیکھتا تھا، اور طبعاً حسد کرتا تھا۔ تو نبی صلی اللہ علیہ وسلم پیچھے ہٹ گئے اور اپنی نماز نہیں توڑی، اور اپنے اصحاب کو اس کی خبر دی۔ لیکن ولی کے دل میں القاء کیا جا سکتا ہے، اور وہ اس سے وہ کچھ سن سکتا ہے جو وہ اپنے دل میں سوچتا ہے، تو وہ طمع کرتا ہے کہ اس کے حال پر دھوکہ ڈال دے، جیسا کہ ہم نے ذکر کیا۔ پس جو شخص اپنے رب کی طرف سے بَيِّنَةٍ پر ہو، وہ کامیاب ہوا اور اشکال دور ہو گیا۔\n\nاور اس بَيِّنَةٍ کا ہونا ضروری ہے جس پر وہ ہو، کہ وہ اس کے لیے بَيِّنَةٍ ہو۔ اور اگر وہ بَيِّنَةٍ نہ ہو، تو وہ اس کے ذریعے حکم نہیں لگا سکتا۔ کیونکہ ہو سکتا ہے کہ وہ علامت (علامة) ہو، بَيِّنَةٍ نہ ہو۔ تو وہ تصور کرتا ہے کہ علامت ہی بَيِّنَةٍ ہے، حالانکہ ایسا نہیں ہے۔ کیونکہ علامت اگر بَيِّنَةٍ نہ ہو، جو کہ اس کے ساتھ تحقق (تحقق) ہے، اور اسی کے ذریعے انبیاء اور اولیاء اللہ کی طرف سے آنے والی چیزوں میں قطعیت حاصل کرتے ہیں۔ اور مجھے ابو البدر التماشکی البغدادی نے خبر دی، جو سچے فقراء میں سے تھے، سب سے صاف لباس والے اور بہترین عبارت والے۔ انہوں نے مجھے بتایا کہ شیخ رغیب الرحبی کے ساتھ میری ایک مجلس ہوئی، اور وہ عارفین میں سے تھے، اگرچہ جو کچھ ہمیں ان کے بارے میں نقل کیا گیا، اس میں وہ اپنے کام میں کامل عارفین کے درجے کو نہیں پہنچے تھے۔ انہوں نے ان سے وقت کے ایک شخص کے بارے میں کہا کہ انہوں نے ایک خلعت (خاص لباس) دیکھی ہے جو اس کے لیے حضور (الحضرة) سے نکلی ہے، اور اس شخص میں ایک علامت دی گئی ہے۔ اور اب تک انہوں نے اسے نہیں دیکھا، کیونکہ انہوں نے وہ علامت نہیں دیکھی۔ تو ابو البدر رضی اللہ عنہم نے ان سے کہا: \"اے شیخ! کیا آپ نے اس کے بعد بہت سے مردوں کو نہیں دیکھا؟\" انہوں نے کہا: \"ہاں۔\" انہوں نے کہا: \"اور کیا وہ اکابر میں سے تھے؟\" انہوں نے کہا: \"ہاں۔\" \"لیکن میں نے ان میں سے کسی میں بھی وہ علامت نہیں دیکھی۔\" تو ابو البدر نے ان سے کہا: \"اور آپ کو کیسے معلوم کہ ان مردوں میں سے کوئی ایک وہ مقصود شخص نہیں تھا جس کے لیے وہ خلعت تھی، اور وہ آپ پر اجنبی بن گیا تاکہ آپ اسے نہ پہچان سکیں؟\" تو رغیب نے ان سے کہا: \"ہو سکتا ہے ایسا ہو۔\"\n\nپس یہ صاحبِ علامت ہیں، لیکن اپنی علامت میں بَيِّنَةٍ پر نہیں ہیں۔ کیونکہ علامت تو باطن میں ہوتی ہے، جو اس سے زائل نہیں ہوتی، اور وہی ہے جس کے ذریعے وہ اپنے رب کی طرف سے اپنے نفس میں بَيِّنَةٍ پر ہوتا ہے۔ پس جب علامت اس کے علاوہ کسی اور میں رکھی جائے، تو وہ دوسرا شخص اس علامت کا حاکم ہوتا ہے، اگر وہ چاہے تو اس کے لیے ظاہر ہو، اور اگر وہ چاہے تو ظاہر نہ ہو۔ اسی لیے رغیب نے علامت کے بارے میں وہ کہا جو کہا، اور یہ واضح نہیں کیا کہ علامت کا محل وہ خود تھے یا وہ شخص۔ پس جب انہوں نے ابو البدر کی بات کو تسلیم کر لیا کہ وہ شخص ان کی علامت میں ان پر داخل ہو سکتا ہے، تو ہم نے قطعیت کے ساتھ جان لیا، اگر ہم رغیب کو ان کے دعوے میں سچا مانیں، کہ علامت ان کے علاوہ کسی اور میں تھی، کیونکہ وہ اپنے رب کی طرف سے بَيِّنَةٍ پر نہیں تھے۔ پس ان کی علامت ان میں نہیں ہو سکتی جو کسی اور میں ہو۔ اسی لیے ابو البدر کی بات صحیح ہو سکتی ہے کہ وہ شخص ان مردوں میں سے کسی میں داخل ہو گیا ہو جو انہوں نے دیکھے، اور وہ ان پر اجنبی بن گیا ہو۔ پس اس عارف پر ابو البدر کا اعتراض صحیح اور اس راہ میں محرر (تحقیق شدہ) ہے۔ اور رغیب کا اس کا اقرار کرنا ایک سچا اقرار ہے جو ان کے دعوے کی سچائی پر دلالت کرتا ہے، سوائے اس کے کہ یہ شیخ ان میں سے ہو جو بَيِّنَةٍ پر نہیں ہیں، یا ہو سکتا ہے کہ وہ اہل بَيِّنَةٍ میں سے ہوں، کیونکہ ان کے دعوے میں بَيِّنَةٍ کا لفظ نہیں آیا اور انہوں نے علامت کی طرف رجوع کیا جس میں اشتراک داخل ہو سکتا ہے۔\n\nاور جہاں تک شیخ ابو السعود ابن الشبل کا تعلق ہے، جو مذکورہ ابو البدر کے شیخ تھے، تو ان کے احوال کی صفت یہ بیان کی جاتی ہے کہ وہ اپنے رب کی طرف سے بَيِّنَةٍ پر تھے، اگرچہ وہ اپنے زمانے کے سب سے زیادہ عقل مند تھے۔ اگر ابو البدر نے ان کے بارے میں یہ نقل نہ کیا ہوتا کہ انہوں نے ایک شخص کو عبدالقادر (گیلانی) کے ذکر پر غصے سے ڈانٹا تھا، نہ کہ سکون اور ٹھہراؤ سے، اور اسے بتایا تھا کہ وہ عبدالقادر کے حال کو ان کے اہل میں اور ان کی قبر میں جانتے ہیں، تو وہ ایک خالص بندہ (عبدا محضا) ہوتے۔ لیکن وہ اس کے بعد زندہ رہے، تو ہو سکتا ہے کہ وہ خالص بندہ بن گئے ہوں۔ کیونکہ انہوں نے اس شخص کو اس لیے نہیں ڈانٹا تھا کہ اس نے شرع میں کوئی حرام کام کیا تھا، بلکہ اس نے عبدالقادر کے احوال اور ان کے مقام کی عظمت بیان کی تھی۔ اگر وہ کسی شرعی ممنوع کام میں پڑتا اور انہوں نے اسے ڈانٹا اور غصہ کیا ہوتا، تو یہ چیز انہیں خالص بندہ ہونے سے خارج نہ کرتی۔ پس پاک ہے وہ ذات جس نے ابو السعود کو وہ عطا کیا جو عطا کیا۔ وہ اپنے معاملے میں اپنے زمانے کے واحد تھے۔ ہاں، اگر یہ ذکر کرنے والا ان کا شاگرد ہوتا، تو ان پر اسے ڈانٹنا ضروری تھا، کیونکہ ان کا ڈانٹنا ان کی تربیت کا حصہ ہے۔ پس اگر وہ ان کے شاگردوں میں سے تھا، تو وہ ڈانٹ انہیں ان کی عبودیت سے خارج نہیں کرتی۔ اور اگر ابو السعود کا وہ ڈانٹنا کسی الٰہی حکم کی وجہ سے تھا جس سے انہیں مخاطب کیا گیا تھا، وقت کی مصلحت کے لیے، خواہ وہ کسی کے حق میں ہو، یا اللہ کی طرف سے کسی مقام پر غیرت کی وجہ سے ہو جس میں اس کلام کرنے والے نے بے ادبی کی ہو، تو ان کا وہ ڈانٹنا ان کی عبودیت کو ثابت کرتا ہے، نہ کہ اس سے خارج کرتا ہے۔ اور ابو السعود کے حال کے بارے میں یہی گمان ہے، نہ کہ وہ جو ہم نے پہلے ذکر کیا۔ اور ہم نے یہ اور وہ اور ان کے درمیان کی بات اس لیے ذکر کی تاکہ ہم اس مقام پر اس کے تمام پہلوؤں کے ساتھ مکمل کلام کر سکیں۔ پس اس شیخ کا ان میں سے کسی ایک پر ہونا ضروری ہے، اور ہم نے ان میں سے کسی ایک پر بھی ان کے بارے میں حکم نہیں لگایا۔ پس ہم نے اس کتاب کے پڑھنے والے کو اس مقام اور اس کے احوال کی معرفت سے فائدہ پہنچایا۔ اور اللہ نے مجھے ابو السعود کے احوال میں سے کسی حال کی خبر نہیں دی، یہاں تک کہ ہم انہیں ان کے مقام کے ساتھ ملحق کر دیں۔ اور اللہ بہتر جانتا ہے کہ ان میں سے کون سا حال تھا، سوائے اس کے کہ میں قطعیت کے ساتھ کہتا ہوں کہ شیوخ کے درمیان ان کا میزان غالب تھا۔ اللہ ہمیں ان کی محبت اور اہل اللہ کی محبت سے نفع دے۔\n\nاور ہم نے اس منزل (منزل) میں سے کچھ چیزیں بیان کی ہیں جو قواصم (توڑنے والی چیزوں) پر مشتمل ہیں، کیونکہ وہ سب خوفناک ہیں۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ [الاحزاب: 4]",
    "fa": "(باب دویست و هشتاد و سوم در شناخت منزل قواصم و اسرار آن از حضرت محمدیه (الحضرة المحمدیة))\n\nاگر شیفته دوست داشتن محافظان (معاصم) هستی *** آیات قواصم (شکننده‌ها) را به یاد آور.\nزیرا آن‌ها (قواصم) از آن (معاصم) بازدارندگی و عصمت دارند *** و رستگار است کسی که آیات عواصم (محافظان) او را زنده کند.\nو این‌ها اموری نیستند که با فکر به دست آورده باشم *** بلکه بر دست قاسم (تقسیم‌کننده) آمده‌اند.\nو خدای خلق با عدل و منت عطا می‌کند *** با شکستن قهار و عصمت عاصم (محافظ).\nپس چقدر فاصله است میان شخصی که به فرشتگان ملحق شده *** و میان شخیصی که به چهارپایان ملحق شده است.\n\nبدانید که چون در وقت معراجم که مرا عروج داد تا آنچه را که سبحانه از آیاتش می‌خواست به من بنمایاند، به این منزل رسیدم، در حالی که فرشته با من بود، درِ آن را کوبیدم. از پشت در صدایی شنیدم که می‌گفت: کیست که درِ این منزل مجهول را می‌کوبد، منزلی که جز با تعریف خداوند شناخته نمی‌شود؟ فرشته گفت: بنده حضرت، بنده تو محمد پسر نور. پس در باز شد و من وارد آن شدم. حق (الحق) همه آنچه را که در آن بود به من شناساند، اما پس از سال‌ها شهود من نسبت به آن. آن شهود، شهودی صوری (صوریا) و بدون تعریف بود، سپس پس از آن تعریف نسبت به آن واقع شد. هنگامی که به من شناساند که این منزل مجهول است، کمرم شکست (قصم ظهری). و چون تعریف نسبت به آن واقع شد، دیدم که تمام آن قواصم (شکننده‌ها) است، مگر آنکه خداوند از آنچه دیدم عصمت دهد. پس ترسیدم، و خداوند با آنچه بر من تجلی (التجلی) کرد، ترس مرا تسکین داد.\n\nپس در این منزل دیدم که صور حسی در صور جسمی دگرگون می‌شوند، همان‌گونه که روحانیون در صور مختلف شکل می‌گیرند. گمان کردم که آن صور اولیه از بین رفته‌اند، پس در آن‌ها دقیق شدم و آن‌ها را درک نکردم تا اینکه قدرت بر آن به من داده شد. پس دگرگون شدم و مطلوب را درک کردم. دیدم که این تحول بر دو نوع است: نوع اول آن است که به تو قدرتی داده شود که با آن در چشم بیننده هر صورتی را که می‌خواهی در آن ظاهر شوی، تأثیر بگذاری. پس او تو را جز بر آن صورت نمی‌بیند، در حالی که تو در ذات خود بر صورت خودت هستی و نه در جوهرت و نه در صورتت تغییری نکرده‌ای. جز اینکه لازم است آن صورتی را که می‌خواهی برای بیننده در آن ظاهر شوی، در خیال خود حاضر کنی، پس چشم بیننده آن را در خیال تو درک می‌کند، همان‌گونه که آن را تخیل کرده‌ای. و آن نگاه در آن لحظه او را از درک صورت معهود تو باز می‌دارد. این یک راه است.\n\nو روش دیگری که این منزل در بر دارد این است که صورتی که تو بر آن هستی، عرضی در جوهر توست. پس خداوند آن عرض را زایل می‌کند و آنچه را که می‌خواهی در آن ظاهر شوی، از صور اعراض، مانند مار یا شیر یا شخص انسانی دیگر، بر تو می‌پوشاند، در حالی که جوهر تو باقی است و روح مدبر جوهر تو بر همان حال عقل و تمام قوا باقی است. پس صورت، صورت حیوان یا نبات یا جماد است و عقل، عقل انسان است و او بر نطق و کلام تواناست. اگر بخواهد سخن می‌گوید و اگر بخواهد سخن نمی‌گوید، به هر زبانی که حق (الحق) بخواهد او را به آن گویا کند. پس حکم او در معهود، حکم عین صورت است. و از این باب است که نطق جمادات و نباتات و حیوانات شناخته می‌شود، در حالی که بر صور خود هستند و تو آن را مانند نطق انسان می‌شنوی. همان‌گونه که روح اگر در صورت بشر تجسد یابد، به کلام بشر سخن می‌گوید، به دلیل حکم صورت بر او. و در توان روحانی نیست که به کلامی غیر از صورتی که در آن ظاهر می‌شود سخن بگوید، برخلاف انسان در حالی که در غیر صورت انسان است.\n\nو این منزل ممسوخ (مسخ شده) از این حضرت است که صورت حسی در دنیا و آخرت مسخ می‌شود. و از این منزل است که بواطن مسخ می‌شوند، پس صورت را انسان‌ها می‌بینی و در باطن غیر از آن صورت است، از فرشته یا شیطان به صورت حیوانی مناسب با آنچه باطن او بر آن است، مانند سگ یا خوک یا میمون یا شیر. و همه این‌ها مخالف چیزی است که انسانیت او طلب می‌کند، یا عالی و یا پست. و مسخ بواطن در این زمان زیاد شده است، همان‌گونه که مسخ در صورت ظاهر در بنی‌اسرائیل ظاهر شد، هنگامی که خداوند آن‌ها را بوزینه و خوک قرار داد. و ناگزیر در آخرالزمان مسخ در این امت نیز ظاهر خواهد شد، اما در یهودیانِ از این امت، نه در مسلمانان. زیرا ایمان آن‌ها را حفظ می‌کند. پس از این امت مسخ نمی‌شود مگر یهودی یا منافقی که اسلام را آشکار می‌کند و یهودیت را پنهان می‌دارد. و ما یهود را به این امت ملحق کردیم، زیرا امت پیامبر قبیله او نیست، بلکه امت او همه کسانی هستند که به سوی آن‌ها مبعوث شده است. و محمد (صلی الله علیه و سلم) به سوی عموم مردم مبعوث شد، پس همه مردم از جمیع ملت‌ها امت او هستند. برخی از آن‌ها ایمان آوردند و برخی کفر ورزیدند و برخی اسلام آوردند. اما ورود جن در دین او (صلی الله علیه و سلم)، ورود آن‌ها در دین او مانند ورود کسی بود که در زمانش پیامبری به سوی او مبعوث نشده بود، در دین پیامبر زمان خود. سپس اگر آن پیامبری که به سوی او مبعوث نشده بود، از کسانی نباشد که پیامبر دیگری به سوی او مبعوث شده باشد، احکام او بر کسانی که به سوی آن‌ها مبعوث شده است، جاری می‌شود، زیرا برای هر پیامبری شِرْعَةً (شریعت) و مِنْهاجاً (راه و روش) است. پس ایمان جن به رسول خدا (صلی الله علیه و سلم) این‌گونه بود.\n\nو اما آنچه درباره مسخ بواطن ذکر کردیم، پس سخن پیامبر (صلی الله علیه و سلم) است که از پروردگارش در وصف قومی از امتش خبر می‌دهد که:\n«آشکارا برادرند و در نهان دشمن (إخوان العلانية أعداء السريرة)، زبان‌هایشان شیرین‌تر از عسل و دل‌هایشان دل‌های گرگان است، برای مردم از نرمی، پوست گوسفندان را می‌پوشند.»\nاین همان مسخ بواطن است که قلب او قلب گرگ باشد و صورتش صورت انسان. پس خداوند نگهدارنده (العاصم) از این قواصم (شکننده‌ها) است.\n\nو روش دیگری در تحول در صورت این است که صورت این شخص بر همان حال که بوده باقی بماند و خود را در صورت یک روحانی (روحانی) بپوشاند. آن روحانی را در هر صورتی که این شخص بخواهد برای بیننده ظاهر شود، می‌یابد. و این شخص در آن صورت پنهان می‌شود، در حالی که آن صورت مانند هوای اطراف اوست. پس چشم بیننده بر آن صورت شیری یا سگی یا میمونی یا هرچه که باشد، می‌افتد. همه این‌ها به تقدیر عزیز علیم است.\n\nو روش دیگری این است که هوای اطراف او به هر صورتی که بخواهد شکل می‌گیرد و شخص باطن آن صورت است. پس ادراک بر آن صورت هوایی شکل‌گرفته در صورتی که می‌خواست در آن ظاهر شود، واقع می‌شود. اما اگر از آن صورت نطقی واقع شود، جز با زبان شناخته شده او نزد بیننده واقع نمی‌شود. پس نغمه (نعمه) را می‌شنود و آن را می‌شناسد و صورت را می‌بیند و آن را انکار می‌کند. برای کسی که حالش این‌گونه است، ممکن نیست که از نغمه خود زایل شود. و این قدرت جن است برای کسانی که آن‌ها را می‌شناسند، زیرا آن‌ها در هر صورتی که بخواهند ظاهر می‌شوند و نغمه آن‌ها نغمه جن است و نمی‌توانند بیش از آن انجام دهند. و کسی که به این اندازه معرفت (المعرفة) ندارد، معرفتی به جن ندارد، مگر اینکه اقوامی هستند که جن با عقل‌هایشان بازی می‌کند و در چشم‌هایشان صورت‌هایی را تخیل می‌کند، مانند آنچه ساحر طناب‌ها را به صورت مارهای رونده تخیل می‌کند. پس گمان می‌کنند که جن را می‌بینند، در حالی که جن نیستند. و آن صورت‌ها با آن‌ها سخن می‌گویند در آنچه به آن‌ها تخیل می‌شود، در حالی که آن صورت‌ها سخن‌گو نیستند، برخلاف تجسد جن در خودشان. پس هر کس از عارفان نغمه‌های هر طایفه‌ای را بشناسد، آنچه را دیده است می‌شناسد و هیچ‌گونه تلبیسی (اشتباهی) در آنچه دیده است بر او عارض نمی‌شود. ما جماعتی را در اندلس دیدیم که جن را بدون شکل‌گیری و در شکل‌گیری آن‌ها می‌دیدند، از جمله فاطمه دختر ابن المثنی از اهل قرطبه که عارفی به آن‌ها بود بدون تلبیس. و طایفه‌ای را در شهر فاس دیدم که جن برای آن‌ها صورت‌هایی را در چشم‌هایشان تخیل می‌کرد و با آن‌ها به هرچه می‌خواستند سخن می‌گفت تا آن‌ها را فریب دهد، در حالی که نه جن بودند و نه به شکل جن. از جمله آن‌ها ابوالعباس الزقاق در شهر فاس بود که امر بر او مشتبه شده بود. به او تخیل می‌شد که ارواح جنی با او سخن می‌گویند و او به این امر یقین داشت. و سبب آن، جهل به نغمه آن‌ها بود. او هرگاه نزد من می‌نشست و در مجلس من حاضر می‌شد، مبهوت می‌شد، سپس آنچه را می‌دید وصف می‌کرد. پس می‌دانستم که به او تخیل می‌شود. او در این امر به حد بازی و مصاحبت و گفت‌وگو می‌رسید و چه بسا میان او و آن کسی که مشاهده می‌کرد، در اموری خصومت و مناکره واقع می‌شد. پس جن از راه دیگری به او ضرر می‌رساند، در حالی که او تخیل می‌کرد که آن ضرر از آن صورت‌ها صادر شده است. و این امر بر او غلبه کرده بود، خدا او را رحمت کند. و ابوالعباس الدهان و همه اصحاب ما این حالت را از او مشاهده می‌کردند. پس کسی که نغمه‌ها را بشناسد، هیچ صورتی بر او مشتبه نمی‌شود. و اندکی هستند که این را می‌دانند و به صدق آنچه از آن صورت‌ها در اوقاتی ظاهر می‌شود، مغرور می‌شوند.\n\nاینک مراتب تحول در صور را از این منزل برای تو بیان کردیم. و در این ظهور در صور، عجایب بسیاری است که عقل‌ها را مبهوت می‌کند. و بزرگ‌ترین آن‌ها تغییر مزاج به مزاجی دیگر است، با بقای جوهر که حامل این صورت است، که ناگزیر است. زیرا اگر جوهر باقی نماند، اصلاً تحولی رخ نداده است، بلکه این جوهر دیگری است در صورت خود که تبدیل نشده و آن نیست، همان‌گونه که زید، عمرو نیست. و از این منزل است همچنین وزن ابوبکر صدیق با امت که برتری یافت. این منزل، منزل حضرت وزن میان مخلوقات است، از هر آنچه غیر خداست. و کسی که آنچه در این منزل است بشناسد و حکم آن را مشاهده کند و موازین خلق بر او آشکار شود، بر آنچه خداوند آن‌ها را بر آن قرار داده است از حال (حال) و مقام (مقام)، فضل فرشتگان را بر یکدیگر، و فضل مردم را بر یکدیگر، و فضل جن را بر یکدیگر، و فضل حیوان را بر یکدیگر، و فضل نبات را بر یکدیگر، و فضل جماد را بر یکدیگر می‌شناسد. و همچنین برتری میان فرشتگان و بشر، و میان جن و بشر، و میان جماد و نبات و بشر را می‌شناسد. و برتری هر جنس را با غیر جنس خود می‌شناسد. و از اینجا فضل حجرالأسود (سنگ سیاه) شناخته می‌شود، با وجود اینکه جماد است و آن یمین الله (دست راست خدا) است. پس به این رتبه بنگر، در حالی که جماد است، و به فرعون و ابی‌جهل بنگر، در حالی که انسان هستند.\n\nو از این منزل، هنگامی که بر این برتری‌ها وقوف یابی، بهشت را در کسانی از این اجناس که جریان دارند، و انواع اجناس و انواع انواع، تا آخرین درجه که اشخاص نوع اخیر هستند، می‌بینی. و همچنین جریان آتش را در اجناس، میان حرارت و زمهرير (سرمای شدید)، و در انواع اجناس و انواع انواع مشاهده می‌کنی تا به اشخاص نوع اخیر منتهی شود. پس بر هر کس که مشاهده می‌کنی، به آنچه مشاهده می‌کنی حکم می‌کنی، زیرا تو او را به آنچه برای اوست مشاهده می‌کنی، نه به وقت او. و در اینجا تلبیس (اشتباه) از جانب یک حضرت خیالی (خیالیه) در مقابل این حضرت واقع می‌شود. پس آنچه را که شاهد وقت به او می‌دهد، مشاهده می‌کند و بر اساس مال (سرانجام) حکم می‌کند، در حالی که این تلبیسی شیطانی است از صفتی که اندکی پیش ذکر کردیم، مبنی بر اینکه جن و شیاطین برای مردم صورت‌هایی را از خودشان و از غیر خودشان تخیل می‌کنند و این حقیقت ندارد.\n\nو این مسئله بر ابوحامد غزالی و دیگران مشتبه شده است. و از شیوخی که ما آن‌ها را درک کردیم و امر بر آن‌ها مشتبه شد، ابواحمد بن سید بون در وادی اشت بود. او و امثال او می‌گفتند که تلبیس (اشتباه) تنها تا زمانی بر انسان عارض می‌شود که در عالم عناصر است. پس چون از آن بالا رود و درهای آسمان بر او گشوده شود، از تلبیس مصون می‌ماند، زیرا او در عالم حفظ و عصمت از مَرَدَه (شیاطین سرکش) و شیاطین است. پس هرچه در آنجا ببیند حق است. پس حق را در این باره برای تو بیان می‌کنیم. و آن این است که آنچه این طایفه به آن معتقدند، یعنی کسانی که آنچه را از آن‌ها حکایت کردیم مبنی بر رفع تلبیس در مشاهداتشان، به دلیل اینکه در محل‌هایی هستند که شیاطین به آن وارد نمی‌شوند و آن محل‌ها مقدس و مطهرند، همان‌گونه که خداوند وصف کرده است، صحیح است. اما اگر معراج در آنجا جسم و روح باشد، مانند معراج رسول خدا (صلی الله علیه و سلم). اما کسی که با خاطر و روحانیت خود عروج داده شود، بدون انفصال مرگ، بلکه با فنا (الفناء) یا نیروی نظری که به او داده می‌شود، و جسدش در خانه‌اش است و او به واسطه فنا از آن غایب است یا به دلیل قدرتی که بر آن است، با آن حاضر است، ناگزیر تلبیس رخ می‌دهد، مگر اینکه این شخص علامتی الهی میان خود و خدا داشته باشد که در آنچه می‌بیند و مشاهده می‌کند و با آن مخاطب می‌شود، «بر بینه‌ای از پروردگارش» (عَلى‏ بَيِّنَةٍ من رَبِّهِ) باشد. اگر علامتی داشته باشد که با آن «بر بینه‌ای از پروردگارش» باشد، در غیر این صورت تلبیس برای او حاصل می‌شود و عدم قطع به علم در آن، اگر منصف باشد. و چه بسا آنچه مشاهده کرده حق باشد و در نفس‌الامر معصوم و محفوظ باشد، اما علم به آن نداشته باشد. پس هنگامی که «بر بینه‌ای از پروردگارش» باشد، در آن هنگام از تلبیس ایمن می‌شود، همان‌گونه که انبیا (علیهم السلام) در آنچه از وحی در خانه‌هایشان به آن‌ها القا می‌شد، ایمن بودند.\n\nو آن این است که شیطان پیوسته مراقب حال این مرید مکاشف است، چه از اهل علامات باشد و چه نباشد، زیرا او حرص بر اغوا و تلبیس دارد. و به دلیل علمش به اینکه خداوند ممکن است بنده‌اش را پس از عصمت، خوار کند، آنچه را که به او القا می‌کند، می‌گوید: «شاید» و با امید و انتظار زندگی می‌کند. و اگر باطن انسان از او مصون بماند و انوار فرشتگان را ببیند که این بنده را احاطه کرده‌اند، به حس او منتقل می‌شود و در صورت حس، اموری را برای او ظاهر می‌کند، شاید او را از آنچه در باطنش با خدا در آن است، باز دارد. و این کار او با هر معصوم و محفوظی است که با انوار فرشتگان در باطنش محفوظ است. اما اگر در نفس‌الامر معصوم باشد و بر باطن او حافظانی از فرشتگان نباشند، شیطان به قلب او می‌آید. و این شخص به دلیل معصوم بودن در نفس‌الامر، به واسطه بینه‌ای که از پروردگارش بر آن است، آنچه را که به او القا می‌شود، نمی‌پذیرد. این در صورتی است که در علم متبحر نباشد و صاحب مقام مقصور بر خود باشد. اما اگر صاحب تمکین و تبحر در علم الهی باشد، آن را از او می‌گیرد، زیرا او فرستاده‌ای از جانب خدا به سوی اوست. اگر آنچه آورده ستوده باشد، چشم خود را در صرف گرفتن (اخذ) می‌گرداند، زیرا آن را از خدا گرفته است و به واسطه توجه نمی‌کند، به دلیل علمش به جایگاه واسطه نزد خدا از طرد و دوری. پس شیطان خاسئا (رانده و ناامید) باز می‌گردد، زیرا امری را اراده کرد و برایش تمام نشد، بلکه در آن سعادت بیشتری برای این شخص بود. اما اگر آنچه آورده مذموم باشد، چشم خود را می‌گرداند و آن را در حق خود ستوده می‌سازد، به این صورت که آن را بر مصرفی که مورد رضایت است، صرف می‌کند. پس شیطان خاسئا باز می‌گردد، زیرا امری را اراده کرد و برایش تمام نشد، بلکه در آن سعادتی برای این شخص بود.\n\nاگر حال این شخص، گرفتن از زمین باشد، شیطان زمینی برای او برپا می‌کند تا از آن بگیرد. پس یا او را خاسئا (رانده) باز می‌گرداند و میان دو زمین تفرقه می‌اندازد، یا اینکه متبحر است و خدا را شکر می‌کند که زمینی تخیلی (متخیلة) نیز به او داده است، همان‌گونه که زمین محسوس به او داده است. و راز خدا را در آن می‌نگرد و اسراری را که خداوند در آن به ودیعه نهاده و به ذهن ابلیس خطور نکرده است، از آن می‌گیرد. و خداوند آن را برای این شخص، افزایشی در مُلک او قرار می‌دهد. و اگر حال او آسمان باشد، شیطان آسمانی مانند آسمانی که او از آن می‌گیرد، برایش برپا می‌کند و از سموم کشنده آنچه را که می‌تواند، در آن می‌گنجاند. عارف با او همان‌گونه رفتار می‌کند که در برخورد با زمین ذکر کردیم. و اگر در این مقام نباشد، شیطان بر او تلبیس می‌کند و آن سموم کشنده را می‌نوشد و به «زیانکارترین مردم در عمل» (بِالْأَخْسَرِينَ أَعْمالًا) ملحق می‌شود. و اگر حال او در سدرة المنتهى (سدرة المنتهی) یا در فرشته‌ای از فرشتگان باشد، شیطان صورتی از سدره‌ای مانند آن یا صورتی مانند صورت آن فرشته را بر او آشکار می‌کند و او را به نامش می‌خواند، سپس آنچه را که می‌داند از آن مقام که در آن است، به او القا می‌کند تا بر او تلبیس کند. اگر از اهل تلبیس باشد، دشمنش بر او پیروز شده است. و اگر معصوم باشد، از او محفوظ می‌ماند، پس او را طرد می‌کند و آنچه را آورده دور می‌اندازد، یا آن را از خدا می‌گیرد بدون واسطه او، و خدا را بر آنچه به او عطا کرده و افزوده است، شکر می‌کند. سپس این شخص به حالی بالاتر ارتقا می‌یابد. اگر حال او عرش یا عماء (عماء) یا اسماء الهی باشد، شیطان بر حسب حال او، میزانی را در مقابل میزان به او القا می‌کند. اگر از اهل تلبیس باشد، همان‌گونه خواهد بود که ذکر کردیم. و اگر نباشد، امر او به آنچه ذکر کردیم تقسیم می‌شود.\n\nبه تو خبر دادم که شیطان جز بر حسب حالتی که شخص بر آن است، در صورت آن حالت، به طور مساوی، و بر آنچه در ذهن او از آنچه شریعت مقرر کرده است، مستقر شده، تجلی نمی‌کند. آیا نمی‌بینی که ابن صیاد هنگامی که ابلیسش عرش را برای او ظاهر کرد، چون حال او این بود و آن عرش را بر دریا دید، زیرا او دید که خداوند می‌فرماید:\n«و عرش او بر آب بود» (وَكَانَ عَرْشُهُ عَلَى الْمَاءِ)\nپس عرش را بر دریا برای او آشکار کرد، در حالی که او بر آن نشسته بود و ابن صیاد از او می‌گرفت و تخیل می‌کرد که از خدا می‌گیرد.\nزیرا خداوند بر اساس آنچه رسول خدا (صلی الله علیه و سلم) به او خبر داد، در قولش:\n«و عرش او بر آب بود» (وَكَانَ عَرْشُهُ عَلَى الْمَاءِ)\nفرمود. پس رسول خدا (صلی الله علیه و سلم) به او فرمود: چه می‌بینی؟ گفت: عرش را می‌بینم. فرمود: کجا؟ گفت: بر دریا. پس رسول خدا (صلی الله علیه و سلم) به او فرمود: آن عرش ابلیس است. و رسول خدا (صلی الله علیه و سلم) سوره دخان از قرآن را برای او پنهان کرد. پس رسول خدا (صلی الله علیه و سلم) به او فرمود: چه چیزی برای تو پنهان کردم؟ گفت: الدخ. و الدخ لغتی در دخان (دود) است. پس رسول خدا (صلی الله علیه و سلم) به او فرمود:\n«اخسأ فلن تعدو قدرك» (دور شو! از حد خود تجاوز نخواهی کرد)\nیعنی تو از کسانی هستی که امر بر او مشتبه شده است. زیرا او (صلی الله علیه و سلم) جز سوره دخان را برای او پنهان نکرده بود و آن سوره شامل دخان و غیر آن است. پس دخان را برای او پنهان نکرده بود، بلکه او به نام سوره آمد، نه به آنچه برای او پنهان شده بود. و سوره دخان نگفت، بلکه گفت: الدخ. و در این سوره جز الدخان نیامده است، نه الدخ، اگرچه عین آن باشد. پس ابن صیاد میان سوره دخان و دخان فرق نگذاشت و جاهل بود. به همین دلیل رسول خدا (صلی الله علیه و سلم) به او فرمود: «اخسأ فلن تعدو قدرك» (دور شو! از حد خود تجاوز نخواهی کرد)، زیرا از این سوره چیزی را آورد که مناسب ابلیس بود که او را به آن آگاه کرده بود، و آن این است که شیطان از آتش آفریده شده است. پس از آن خبیئه (چیز پنهان شده) جز آنچه مناسب او بود، ندید و ندانست که آن سوره دخان است. پس شیطان در آن لحظه این مقدار را به ابن صیاد القا کرد. و آن این است که پیامبر (صلی الله علیه و سلم) هنگام تعیین سوره در نفس خود، نام آن را بر زبان آورد. پس شیطان آن را دزدید و از لفظ او ربود. و اگر رسول خدا (صلی الله علیه و سلم) آن را در نفس خود پنهان می‌کرد، ابلیس آن را نمی‌دانست، زیرا او بر قلب پیامبر (صلی الله علیه و سلم) اطلاع و اشرافی ندارد، برخلاف قلب ولی.\n\nو به همین دلیل است که پیامبر در حال نزول وحی و در غیر آن، معصوم از وسوسه (وسوسه) است و فرقی نیست. آیا نمی‌بینی که شیطان چون دانست که رسول خدا (صلی الله علیه و سلم) با این مرتبه و عنایت از جانب خدا در عصمت قلبش از اشراف ابلیس بر آن است، در نماز در قبله او با شعله‌ای از آتش تخیلی آمد و آن را به صورت او پرتاب کرد؟ و هدفش این بود که میان او و نماز حائل شود، به دلیل خیری که در آن می‌دید، زیرا او طبعاً به او حسادت می‌ورزد. پس پیامبر (صلی الله علیه و سلم) به عقب رفت و نمازش را قطع نکرد و اصحابش را از آن خبر داد. اما ولی، چه بسا در قلبش به او القا شود و چه بسا از او بشنود آنچه را که با خود می‌گوید. پس طمع می‌کند که حال او را مشتبه سازد، همان‌گونه که ذکر کردیم. پس کسی که «بر بینه‌ای از پروردگارش» باشد، رستگار شده و اشکال برطرف شده است. و لازم است که بینه‌ای که بر آن است، بینه برای او باشد. و اگر بینه نباشد، نمی‌تواند با آن حکم کند. زیرا ممکن است علامتی باشد که بینه نیست. پس تخیل می‌کند که علامت همان بینه است، در حالی که چنین نیست. زیرا علامت اگر بینه نباشد، و بینه همان تحقق به آن است، و پیامبران و اولیا در آنچه از جانب خدا بر آن‌ها وارد می‌شود، با آن قطعیت می‌یابند.\n\nو ابوالبدر تماشکی بغدادی که از فقیران صادق و از پاکیزه‌ترین آن‌ها در لباس و نیکوترین آن‌ها در بیان بود، به من خبر داد و گفت: مجلسی میان من و شیخ رغیب الرحبی جمع شد. او از عارفان بود، هرچند در آنچه به ما منتقل شد، به مرتبه عارفان کامل در کارشان نرسیده بود. او به ابوالبدر گفت: درباره مرد زمان، او خلعت (خلعه)ی را دیده است که از حضرت برای او خارج شده و علامتی در آن مرد به او داده شده است، اما تا کنون او را ندیده است، زیرا آن علامت را ندیده است. ابوالبدر (رضی الله عن جمیعهم) به او گفت: ای شیخ، آیا پس از آن مردان بسیاری را ندیدی؟ گفت: بله. گفت: و آیا آن‌ها از بزرگان بودند؟ گفت: بله. گفت: اما من آن علامت را در هیچ یک از آن‌ها ندیدم. ابوالبدر به او گفت: از کجا می‌دانی که یکی از آن مردانی که دیدی، همان مقصود به آن خلعت نبوده و بر تو پنهان مانده است تا او را نشناسی؟ رغیب به او گفت: ممکن است چنین باشد. پس این شخص صاحب علامت است، اما بر بینه در علامت خود نیست. زیرا علامت تنها در باطن است و از او زایل نمی‌شود و او کسی است که با آن «بر بینه‌ای از پروردگارش» در نفس خود است. پس اگر علامت برای او در غیر او قرار داده شود، آن غیر، حاکم بر آن است. اگر بخواهد برای او در آن ظاهر می‌شود و اگر نخواهد ظاهر نمی‌شود. به همین دلیل رغیب آنچه را که درباره علامت گفت، بیان کرد و مشخص نکرد که محل علامت کیست، آیا خودش است یا آن مرد. پس چون اقرار کرد به وقوع آنچه ابوالبدر به او گفت، مبنی بر ورود بر او در علامت خود، قطعاً دانستیم، اگر رغیب را در ادعایش تصدیق کنیم، که علامت در غیر او بوده است، زیرا او «بر بینه‌ای از پروردگارش» نیست. پس علامت او در او نیست که در غیر او باشد. به همین دلیل ممکن است آنچه ابوالبدر گفت صحیح باشد که آن مرد در میان مردانی که دیده است، بر او وارد شده و بر او پنهان مانده است. پس اعتراض ابوالبدر بر این عارف، اعتراضی صحیح و محقق در طریقت است. و اقرار رغیب در این باره، اقراری صادق است که بر صدق ادعای او دلالت دارد، جز اینکه ممکن است این شیخ از کسانی باشد که بر بینه نیستند، و ممکن است از اهل بینه باشد، زیرا در ادعای او لفظ بینه واقع نشد و به علامت روی آورد که اشتراک در آن راه دارد.\n\nاما شیخ ابوالسعود ابن الشبل، شیخ ابوالبدر مذکور، از احوال او وصف شده است که «بر بینه‌ای از پروردگارش» بود، جز اینکه عاقل‌ترین اهل زمان خود بود. و اگر آنچه ابوالبدر مذکور از او حکایت کرد که شخصی را در ذکر عبدالقادر (گیلانی) با غیظ و نه با سکون و آرامش سرزنش کرد و به او فهماند که حال عبدالقادر در میان اهلش و حال او در قبرش چگونه بوده است، نبود، او بنده‌ای محض (عبداً محضاً) بود. اما او پس از این زندگی کرد، پس ممکن است که بنده محض شده باشد، زیرا او این شخص را به دلیل انجام دادن امری حرام در شرع سرزنش نکرد، بلکه او احوال عبدالقادر و عظمت منزلت او را وصف می‌کرد. پس اگر در محظور شرعی واقع می‌شد و او را سرزنش می‌کرد و بر او خشم می‌گرفت، این امر او را از بنده محض بودن خارج نمی‌کرد. پس منزه است خدایی که به ابوالسعود آنچه را که عطا کرد، عطا نمود. او در شأن خود یگانه زمانش بود. بله، اگر این ذاکر شاگرد او بود، سرزنش او بر او واجب بود، زیرا سرزنش او از تربیت اوست. پس اگر از شاگردان او بود، آن سرزنش او را از عبودیتش خارج نمی‌کند. و اگر آن سرزنش از ابوالسعود به امر الهی بود که در نفس خود برای مصلحت وقت در حق هر کس که بود، یا از غیرت خداوند بر مقامی بود که این متکلم در آن بی‌ادبی کرده بود، آن سرزنش او از اموری است که عبودیت او را محقق می‌سازد و او را از آن خارج نمی‌کند. و این همان گمان درباره حال ابوالسعود است، نه آنچه در ابتدا ذکر کردیم. و ما آن و این و آنچه میان آن دو است را ذکر کردیم تا کلام را بر مقام، با وجوهی که مقتضی آن است، به کمال برسانیم. پس ناگزیر این شیخ بر یکی از آن‌ها بوده است و ما بر هیچ یک از آن‌ها حکم نکردیم. پس به کسی که بر این کتاب وقوف می‌یابد، معرفت این مقام و احوال آن را فایده رساندیم. و خداوند حال هیچ یک از احوال ابوالسعود را به من خبر نداد تا او را به منزلتش ملحق سازم. و خداوند داناتر است که کدام یک از این‌ها بوده است، جز اینکه من قطع دارم که میزان او در میان شیوخ، راجح (برتر) بوده است. خداوند ما را به محبت او و به محبت اهل الله بهره‌مند سازد. و ما از این منزل برخی از آنچه را که از قواصم (شکننده‌ها) در بر دارد، آوردیم، زیرا همه آن‌ها ترسناک هستند. و خداوند «حق را می‌گوید و او راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}