{
  "id": 124,
  "title": {
    "ar": "الباب الرابع والعشرون ومائة في معرفة مقام الصبر وتفاصيله وأسراره",
    "en": "Chapter 124: Concerning the Gnosis (معرفة) of the Station of Patience (مقام الصبر), its Particulars, and its Mysteries.",
    "ur": "باب ایک سو چوبیس: مقام صبر (مقام الصبر) کی معرفت، اس کی تفصیلات اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و بیست و چهارم در معرفت مقام صبر و تفصیلات و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الرابع والعشرون ومائة في معرفة مقام الصبر وتفاصيله وأسراره)\n\n\n> تنوع شرب الصبر في كل مشرب *** بعن وعلى أو في وبالباء واللام‏\n\n\n> وليس يكون الصبر إلا على أذى *** وجودا وتقديرا بأنواع آلام‏\n\n\n> وعين للحق الصبور أذى أتى *** بمحكم آيات الكتاب لإعلام‏\n\n\n> فلا صبر في النعماء إن كنت عالما *** بقول إمام صادق الحكم علام‏\n\n\n### [الصبر حبس النفس عن الشكوى إلى غير الله‏]\n\n\nاعلم وفقك الله أن الله تعالى يقول إِنَّ الَّذِينَ يُؤْذُونَ الله ورَسُولَهُ فأخبر أنه يؤذي فتسمى سبحانه بالصبور على أذى خلقه وكما سأل عباده رفع الأذى مع استحقاقه اسم الصبور كذلك لا يرفع اسم الصبر عن العبد إذا حل به بلاء فسأل الله تعالى في رفع ذلك البلاء كما فعل أيوب عليه السلام فقال مَسَّنِيَ الضُّرُّ وأَنْتَ أَرْحَمُ الرَّاحِمِينَ وأثنى الله عليه فقال مع هذا السؤال إِنَّا وَجَدْناهُ صابِراً فليس الصبر حبس النفس عن الشكوى إلى الله في رفع البلاء أو دفعه وإنما الصبر حبس النفس عن الشكوى إلى غير الله والركون إلى ذلك الغير وقد أبنت لك أن الله طلب من عباده رفع الأذى الذي آذوه به مع قدرته على إن لا يخلق فيهم ما خلق من الأذى فتفطن لسر هذا الصبر فإنه من أحسن الأسرار وقد ورد أنه لا أحد أصبر على أذى من الله‏\n\n\n### [الصبر من المقامات التي تنقطع إذا دخل أهل النار وأهل الجنة الجنة]\n\n\nوهو من المقامات التي تنقطع وتزول إذا دخل أهل النار النار وأهل الجنة الجنة وتميز الفريقان تميز الانقطاع أن لا يلحق أحد بغير الدار التي هو فيها والصبر الإلهي يزول حكمه بزوال الدنيا وهذه بشرى بإزالة اسم المنتقم والشديد العقاب إذ قد رأينا إزالة الصبور ورحمته سبقت غضبه‏\n\n\n### [حكمة زوال الدنيا رفع الأذى عن الله وشمول الرحمة جميع عباد الله‏]\n\n\nفحكمة زوال الدنيا رفع الأذى عن الله إذ لا يكون إلا فيها فأبشروا عباد الله بشمول الرحمة واتساعها وانسحابها على كل مخلوق سوى الله ولو بعد حين فإنه بإزالة الدنيا زال الأذى عن كل من أوذى وبزوال الأذى زال الصبر ومن أسباب العقاب الأذى والأذى قد زال فلا بد من الرحمة وارتفاع الغضب فلا بد من الرحمة أن تعم الجميع بفضل الله إن شاء الله هذا ظننا في الله‏\n\n\nفإن الله وهو الصادق يقول أنا عند ظن عبدي بي فليظن بي خيرا\n\n\nفأخبر وأمر ولم يقيد في حق الظان ولا في غيره ولهذا\nسمي عذابا ما يقع به الآلام بشرى من الله لعباده أن الذي تتألمون به لا بد إذا شملتكم الرحمة أن تستعذبوه وأنتم في النار كما يستعذب المقرور حرارة النار والمحرور برودة الزمهرير ولهذا جمعت جهنم النار والزمهرير لاختلاف المزاج فما يقع به الألم لمزاج مخصوص يقع به النعيم في مزاج آخر يضاده فلا تتعطل الحكمة ويبقي الله على أهل جهنم الزمهرير على المحرورين والنار على المقرورين فينعمون في جهنم فهم على مزاج لو دخلوا به الجنة تعذبوا بها لاعتدالها\n\n\n### [الصبر يتنوع بتنوع الأدوات‏]\n\n\nثم اعلم أن الصبر يتنوع بتنوع الأدوات فالصبر في الله إذا أوذى فيه والصبر مع الله رؤية المعذب في العذاب والصبر على الله حال فقده لربه بوجود نفسه غير مقترنة بوجود ربه والصبر بالله أن يكون الحق عين صبره كما هو سمعه وبصره والصبر من الله حال رفع الحول والقوة منك فلا تقول لا حول ولا قوة إلا بالله فيزول بالاستعانة والصبر عن الله وهو أعظمها مقاما وهو الصبر الذي يزول بالموت ولا يوجد في الآخرة فإن صاحب هذا الصبر ينسب الصبر إليه نسبة الاسم الصبور إلى الله ولهذا يرتفع بزوال الدنيا وفي العبد بزواله عن الدنيا ومن زلت عنه فقد زال عنك فهؤلاء أخذوا الصبر عن الله كما تقول أخذت هذا العلم عن فلان فأنت فيه كهو\n\n\n### [حب الخير وذكر الرب‏]\n\n\nكذلك قول سليمان عليه السلام أَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي لأنه سماه خيرا والخير منسوب إلى الله فقال عن ذكر ربي إياه بالخيرية أحببته فطفق يمسح بيده على أعرافها وسوقها فرحا وإعجابا بخير ربه فإنه أحب حب الخير وحب الخير إما أن يريد حب الله إياه أو حب الخير من حيث وصف الخير بالحب والخير لا يحب إلا الأخيار فإنهم محل وجود عينه فكذلك سليمان عليه السلام قال أَحْبَبْتُ حُبَّ الْخَيْرِ أي أنا في حبي كالخير في حبه ولهذا لما تَوارَتْ بِالْحِجابِ أعني الصافنات الجياد اشتاق إليها لأنه فقد المحل الذي أوجب له هذه الصفة الملذوذة فإنها كانت مجلى له فقال رُدُّوها عَلَيَ‏\n\n\n### [حكايات اليهود في تفسير القرآن الإسرائيليات‏]\n\n\nوأما المفسرون الذين جعلوا التواري للشمس فليس للشمس هنا ذكر ولا للصلاة التي يزعمون ثم إنهم يأخذون في ذلك حكايات اليهود في تفسير القرآن وقد أمرنا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن لا نصدق أهل الكتاب ولا نكذبهم‏\n\n\nفمن فسر القرآن برواية اليهود فقد رد أمر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ومن رد أمر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقد رد أمر الله فإنه أمر أن نطيع الرسول وأن نأخذ ما أتانا به وأن ننتهي عما نهانا عنه إذ لا يوصلنا إلى أخبار هؤلاء الأنبياء الاسرائيليين إلا نبي فنصدقه أو أهل كتاب فنقف عند أخبارهم إذا لم يكن في كتابنا ولا قول رسولنا صَلَّى اللهُ عَليهِ وسَلَّم ولا في أدلة العقول ما يرده ولا يثبته ولا نقضي فيه بشي‏ء وأما مساق الآية فلا يدل على ما قالوه بوجه ظاهر البتة\n\n\n### [حب سليمان عليه السلام للخيل عن ذكر ربه إياها]\n\n\nوأما استرواحهم فيما فسروه بقوله ولَقَدْ فَتَنَّا سُلَيْمانَ فليس تلك الفتنة وهو الاختبار إذا كان متعلقة الخيل ولا بد فيكون اختباره إذا رآها هل يحبها عن ذكري لها أو هل يحبها لعينها\n\n\nفأخبر صَلَّى اللهُ عَليهِ وسَلَّم أنه أحبها عن ذكر ربه إياها لا نفسها مع حسنها وجمالها وحاجته إليها وهي جزء من الملك الذي طلب أن لا ينبغي لأحد من بعده فأجابه الحق إلى ما سأل في المجموع ورفع الحرج عنه‏\n\n\nوقال له هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ وإِنَّ لَهُ عِنْدَنا يعني في الآخرة لَزُلْفى‏ وحُسْنَ مَآبٍ أي ما ينقصه هذا الملك من ملك الآخرة شي‏ء كما يفعله مع غيره حيث أنقصه من نعيم الآخرة على قدر ما تنعم به في الدنيا قال الله تعالى في حق قوم أَذْهَبْتُمْ طَيِّباتِكُمْ في حَياتِكُمُ الدُّنْيا واسْتَمْتَعْتُمْ بِها\n\n\n### [الصبر عن الله أعظم أنواع الصبر]\n\n\nفالصبر عن الله بهذا التفسير أعظم أنواع الصبر وأما الصبر عن الله على ما يتخيله العامة من الصبر عن كذا لمفارقته إياه فليس ذلك من شأن أهل الله والشبلي لما غشى عليه من قول الشاب إن الصبر عن الله أعظم الصبر غشى عليه لعظم المقام الذي لا يناله إلا الكمل من الرجال فلما لاح للشبلي من كلام الشاب كان وارده أقوى من محل الشبلي فلذلك أثر فيه الغشي وهكذا كل وارد يكون أقوى من قوة المحل فإنه يفعل فيه الغشي والصعق وليس لأهل الله قدم في الصبر عن الله على تفسير العامة\n\n\n### [درجات الصبر عند العارفين‏]\n\n\nوللصبر درجات عند العارفين من أهل الأنوار ثلاثمائة وثلاث وعشرون درجة وعند أهل الأسرار منهم مائتان وثلاث وتسعون درجة وعند الملامية من أهل الأنوار مائتان واثنتان وتسعون وعند أهل الأسرار منهم مائتان واثنتان وستون درجة\n\n",
    "en": "## Chapter 124: On the Knowledge of the Station of Patience (مقام الصبر), its Details, and its Secrets\n\nThe drinking of patience varies in every draught,\n[Patience] *‘an* (from), *‘ala* (upon), or *fi* (in), and with *bi* and *li*.\n\nAnd patience does not exist except upon harm,\nWhether actual or conceptual, involving various kinds of pain.\n\nAnd the Patient Real (الحق الصبور) is designated as receiving harm,\nWhich came through the decisive verses of the Book for notification.\n\nSo there is no patience in prosperity if you are knowledgeable\nof the saying of a truthful, decisive, and knowing Imam.\n\n### [Patience is restraining the soul from complaining to other than Allah]\n\nKnow, may Allah grant you success, that Allah the Exalted says: <<إِنَّ الَّذِينَ يُؤْذُونَ الله ورَسُولَهُ>> (Indeed, those who harm Allah and His Messenger). Thus, He informed us that He is harmed, and He named Himself *al-Sabur* (The Patient One) regarding the harm caused by His creation. Just as He asked His servants to remove the harm, despite His deserving the Name *al-Sabur*, similarly, the Name of patience (الصبر) is not removed from the servant if an affliction (بلاؤ) befalls him and he asks Allah the Exalted to remove that affliction, as Job (Ayyub), peace be upon him, did when he said: <<مَسَّنِيَ الضُّرُّ وأَنْتَ أَرْحَمُ الرَّاحِمِينَ>> (Affliction has touched me, and You are the most Merciful of the merciful). And Allah praised him, despite this supplication, saying: <<إِنَّا وَجَدْناهُ صابِراً>> (Indeed, We found him patient). Therefore, patience is not restraining the soul from complaining to Allah regarding the removal or repulsion of affliction. Rather, patience is restraining the soul from complaining to other than Allah (غير الله) and relying upon that other. I have already made clear to you that Allah requested His servants to remove the harm they caused Him, despite His ability not to create in them what He created of harm. So, reflect upon the secret of this patience, for it is one of the finest secrets. It has been reported that no one is more patient regarding harm than Allah.\n\n### [Patience is one of the stations that cease when the people of the Fire and the people of Paradise enter their respective dwellings]\n\nIt [Patience] is one of the stations (المقامات) that cease and vanish when the people of the Fire enter the Fire and the people of Paradise enter Paradise, and the two parties are distinguished by a distinction of cessation, meaning that no one will join the dwelling of the other. The ruling of Divine Patience (الصبر الإلهي) ceases with the cessation of the world (الدنيا). This is good news (بشرى) regarding the removal of the Name *al-Muntaqim* (The Avenger) and *Shadid al-Iqab* (Severe in Punishment), since we have seen the removal of *al-Sabur*, and His Mercy preceded His Wrath.\n\n### [The wisdom of the world’s cessation is the removal of harm from Allah and the encompassing of all servants of Allah by Mercy]\n\nThe wisdom of the world’s cessation is the removal of harm (الأذى) from Allah, since harm only exists within it. So, rejoice, O servants of Allah, in the universality and breadth of Mercy (الرحمة) and its extension to every creature (مخلوق) other than Allah, even if after a time. For with the cessation of the world, harm is removed from everyone who was harmed, and with the removal of harm, patience ceases. Since harm is one of the causes of punishment, and harm has ceased, Mercy must prevail and Wrath must be lifted. Therefore, Mercy must encompass everyone by the grace of Allah, if He wills. This is our positive expectation (ظننا) of Allah.\n\nFor Allah, who is the Truthful One, says: \"I am as My servant thinks of Me (أنا عند ظن عبدي بي), so let him think good of Me.\" He informed and commanded, without restricting this to the one who thinks or to anyone else. For this reason, what causes pain (الآلام) is called punishment, yet it is good news (بشرى) from Allah to His servants that what causes you pain must, when Mercy encompasses you, become sweet to you (تستعذبوه) even while you are in the Fire, just as the freezing person finds the heat of the Fire sweet, and the feverish person finds the cold of *al-Zamharir* (extreme cold) sweet. This is why Hell (جهنم) combines Fire and *Zamharir*, due to the difference in temperaments (المزاج). What causes pain to a specific temperament causes bliss (النعيم) in another opposing temperament. Thus, wisdom is not nullified. Allah keeps the *Zamharir* for the feverish people of Hell and the Fire for the freezing people, so they are in bliss in Hell. They possess a temperament such that if they entered Paradise, they would be tormented by its equilibrium.\n\n### [Patience varies according to the variation of the instruments]\n\nThen know that patience (الصبر) varies according to the variation of the instruments [prepositions]. Patience *fi* Allah (الصبر في الله) is when one is harmed for His sake. Patience *ma‘a* Allah (الصبر مع الله) is the witnessing (رؤية) of the Tormentor in the torment. Patience *‘ala* Allah (الصبر على الله) is the state of losing one's Lord (ربه) by finding one's own existence (وجود نفسه) not coupled with the existence of one's Lord. Patience *bi* Allah (الصبر بالله) is when the Real (الحق) is the very essence of one's patience, just as He is one's hearing and sight. Patience *min* Allah (الصبر من الله) is the state of the lifting of power and strength from you, so you do not say, \"There is no power or strength except with Allah (لا حول ولا قوة إلا بالله),\" for it is removed by seeking assistance. Patience *‘an* Allah (الصبر عن الله) is the greatest of these stations (مقاما). It is the patience that ceases with death and does not exist in the Hereafter. The possessor of this patience attributes patience to himself, just as the Name *al-Sabur* is attributed to Allah. This is why it is lifted with the cessation of the world, and in the servant, by his departure from the world. Whoever has departed from it, it has departed from you. These individuals took patience *‘an* Allah (from Allah), just as you say, \"I took this knowledge *‘an* (from) so-and-so,\" meaning you are like him in it.\n\n### [The love of good and the remembrance of the Lord]\n\nSimilarly, the saying of Solomon (Sulayman), peace be upon him: <<أَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي>> (I loved the love of good, by means of the remembrance of my Lord). Because he named it \"good\" (خيرا), and good is attributed to Allah, he said, *‘an dhikri Rabbi* (by means of the remembrance of my Lord), meaning: I loved it because my Lord mentioned it as good. Then he began stroking their necks and hocks with his hand, out of joy and admiration for the goodness of his Lord. For he loved the love of good. The love of good either means desiring Allah’s love for it, or loving the good in terms of the attribute of goodness being loved. Goodness only loves the good people (الأخيار), for they are the locus of the existence of its essence. Likewise, Solomon, peace be upon him, said: <<أَحْبَبْتُ حُبَّ الْخَيْرِ>> (I loved the love of good), meaning: I am in my love like the Good is in its love. This is why, when they vanished behind the veil (تَوارَتْ بِالْحِجابِ)—meaning the swift steeds (الصافنات الجياد)—he longed for them because he lost the locus (المحل) that necessitated this delightful attribute for him, for they were a manifestation (مجلى) for him. Thus, he said: <<رُدُّوها عَلَيَ>> (Bring them back to me).\n\n### [The narratives of the Jews in Quranic exegesis (Isra'iliyyat)]\n\nAs for the exegetes (المفسرون) who claimed that the vanishing was of the sun, there is no mention of the sun here, nor of the prayer they claim. Furthermore, they rely on the narratives of the Jews (حكايات اليهود) in interpreting the Quran. The Messenger of Allah, may Allah bless him and grant him peace, commanded us neither to confirm the People of the Book nor to deny them.\n\nWhoever interprets the Quran based on Jewish narratives has rejected the command of the Messenger of Allah, may Allah bless him and grant him peace. And whoever rejects the command of the Messenger of Allah, may Allah bless him and grant him peace, has rejected the command of Allah, for He commanded us to obey the Messenger, to take what he brought us, and to desist from what he forbade us. We can only receive news of these Israelite prophets either through a Prophet, whom we confirm, or through the People of the Book, in which case we pause at their reports if they are not found in our Book, nor in the saying of our Messenger, may Allah bless him and grant him peace, nor in rational proofs (أدلة العقول) that refute or confirm them, and we pass no judgment on them. However, the context of the verse (مساق الآية) does not support what they claimed in any apparent way whatsoever.\n\n### [Solomon’s love for the horses by means of his Lord’s remembrance of them]\n\nAs for their reliance on the verse <<وَلَقَدْ فَتَنَّا سُلَيْمانَ>> (And We certainly tried Solomon) for their interpretation, that trial (فتنة)—which is the test (الاختبار)—if it necessarily relates to the horses, then his test was whether he loved them by means of My remembrance of them, or whether he loved them for their own essence (لعيّنها). He, peace be upon him, informed us that he loved them *‘an dhikri Rabbi* (by means of the remembrance of his Lord) of them, not for their own sake, despite their beauty, elegance, and his need for them, as they were part of the kingdom (الملك) he requested—that it should not belong to anyone after him. The Real (الحق) answered him regarding the totality of what he asked and removed the constraint (الحرج) from him. He said to him: <<هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ>> (This is Our gift; so grant or withhold without reckoning). And <<وَإِنَّ لَهُ عِنْدَنا>> (And indeed, for him with Us)—meaning in the Hereafter—<<لَزُلْفى‏ وحُسْنَ مَآبٍ>> (is nearness and a good return). Meaning that this kingdom does not diminish his share of the kingdom of the Hereafter at all, unlike what He does with others, where He diminishes their bliss in the Hereafter according to what they enjoyed in the world. Allah the Exalted says concerning a group of people: <<أَذْهَبْتُمْ طَيِّباتِكُمْ في حَياتِكُمُ الدُّنْيا واسْتَمْتَعْتُمْ بِها>> (You have exhausted your good things in your worldly life and enjoyed them).\n\n### [Patience ‘an Allah is the greatest type of patience]\n\nThus, patience *‘an* Allah (الصبر عن الله), according to this interpretation, is the greatest type of patience. As for patience *‘an* Allah based on the common conception—meaning patience due to separation from Him—that is not the concern of the People of Allah (أهل الله). When al-Shibli fainted upon hearing the young man say that patience *‘an* Allah is the greatest patience, he fainted due to the magnitude of the station (المقام) which only the most perfect men (الكمل من الرجال) attain. When the young man’s words dawned upon al-Shibli, the spiritual influx (وارده) was stronger than al-Shibli’s capacity (محل), which is why the fainting affected him. Similarly, every spiritual influx that is stronger than the capacity of its locus causes fainting or swooning (الصعق). The People of Allah have no standing in patience *‘an* Allah according to the common interpretation.\n\n### [Degrees of Patience according to the Gnostics]\n\nPatience has degrees (درجات) among the Gnostics (العارفين) from the People of Lights (أهل الأنوار): three hundred and twenty-three degrees. Among the People of Secrets (أهل الأسرار) among them: two hundred and ninety-three degrees. Among the Malamiyya (ملاّمية) from the People of Lights: two hundred and ninety-two degrees. And among the People of Secrets among them: two hundred and sixty-two degrees.",
    "ur": "## (باب ایک سو چوبیس: مقام صبر، اس کی تفصیلات اور اس کے اسرار کی معرفت میں)\n\nصبر کا پینا ہر مشرب میں مختلف ہوا،\n'عن'، 'علی'، 'او'، 'فی'، 'با' اور 'لام' کے ساتھ۔\nاور صبر نہیں ہوتا مگر تکلیف پر،\nخواہ وہ حقیقی ہو یا مختلف قسم کے دکھوں کا تخمینہ ہو۔\nاور ذات حق (الحق) نے، جو صبور ہے، اس تکلیف کو واضح کیا جو آئی،\nکتاب کی محکم آیات میں آگاہ کرنے کے لیے۔\nپس نعمتوں میں کوئی صبر نہیں، اگر تم جاننے والے ہو،\nایک سچے، حکیم اور علیم امام کے قول کو۔\n\n### (صبر غیر اللہ سے شکایت کرنے سے نفس کو روکنا ہے)\n\nاللہ تمہیں توفیق دے، جان لو کہ اللہ تعالیٰ فرماتا ہے: إِنَّ الَّذِينَ يُؤْذُونَ الله ورَسُولَهُ (بیشک وہ لوگ جو اللہ اور اس کے رسول کو تکلیف دیتے ہیں)۔ پس اس نے خبر دی کہ اسے تکلیف دی جاتی ہے، اور اس نے خود کو اپنے مخلوق کی تکلیف پر صبور (الصبور) نام دیا۔ اور جس طرح اس نے اپنے بندوں سے تکلیف کو دور کرنے کا سوال کیا، باوجود اس کے کہ وہ اسم صبور (الصبور) کا مستحق ہے، اسی طرح بندے سے بھی صبر کا نام نہیں ہٹتا اگر اس پر کوئی بلا نازل ہو اور وہ اللہ تعالیٰ سے اس بلا کو دور کرنے کا سوال کرے۔ جیسا کہ ایوب علیہ السلام نے کیا، جب انہوں نے کہا: مَسَّنِيَ الضُّرُّ وأَنْتَ أَرْحَمُ الرَّاحِمِينَ (مجھے تکلیف پہنچی ہے اور تو رحم کرنے والوں میں سب سے زیادہ رحم کرنے والا ہے)۔ اور اللہ نے اس سوال کے باوجود ان کی تعریف کی اور فرمایا: إِنَّا وَجَدْناهُ صابِراً (بیشک ہم نے اسے صابر پایا)۔ پس صبر یہ نہیں ہے کہ نفس کو بلا کو دور کرنے یا دفع کرنے کے لیے اللہ سے شکایت کرنے سے روکا جائے، بلکہ صبر یہ ہے کہ نفس کو غیر اللہ سے شکایت کرنے اور اس غیر کی طرف مائل ہونے سے روکا جائے۔ میں نے تمہارے لیے واضح کر دیا ہے کہ اللہ نے اپنے بندوں سے اس تکلیف کو دور کرنے کا مطالبہ کیا جو انہوں نے اسے دی، حالانکہ وہ اس بات پر قادر تھا کہ ان میں وہ تکلیف پیدا ہی نہ کرتا۔ پس تم اس صبر کے راز پر غور کرو، کیونکہ یہ بہترین اسرار میں سے ہے۔ اور یہ بات وارد ہوئی ہے کہ اللہ سے زیادہ کوئی بھی اپنی تکلیف پر صابر نہیں ہے۔\n\n### (صبر ان مقامات میں سے ہے جو اس وقت ختم ہو جاتے ہیں جب اہل دوزخ دوزخ میں اور اہل جنت جنت میں داخل ہو جائیں گے)\n\nاور یہ ان مقامات میں سے ہے جو ختم ہو جاتے ہیں اور زائل ہو جاتے ہیں جب اہل دوزخ دوزخ میں اور اہل جنت جنت میں داخل ہو جائیں گے، اور دونوں فریقوں کا امتیاز انقطاع کے ساتھ ہو جائے گا، یعنی کوئی بھی اس گھر کے علاوہ کسی اور گھر میں شامل نہیں ہو گا جس میں وہ ہے۔ اور الٰہی صبر (الصبر الإلهي) کا حکم دنیا کے زوال کے ساتھ زائل ہو جائے گا۔ اور یہ ایک خوشخبری ہے کہ اسم المنتقم (انتقام لینے والا) اور شدید العقاب (سخت سزا دینے والا) زائل ہو جائیں گے، کیونکہ ہم نے صبور (الصبور) کے زائل ہونے کو دیکھا ہے، اور اس کی رحمت اس کے غضب پر سبقت لے گئی ہے۔\n\n### (دنیا کے زوال کی حکمت اللہ سے تکلیف کا دور ہونا اور اللہ کے تمام بندوں پر رحمت کا عام ہونا ہے)\n\nپس دنیا کے زوال کی حکمت اللہ سے تکلیف کو دور کرنا ہے، کیونکہ تکلیف صرف اسی (دنیا) میں ہوتی ہے۔ پس اے اللہ کے بندو! رحمت کے عام ہونے، اس کے وسیع ہونے اور اللہ کے سوا ہر مخلوق پر، خواہ کچھ دیر بعد ہی سہی، اس کے چھا جانے کی خوشخبری سنو۔ کیونکہ دنیا کے زائل ہونے سے ہر اس شخص سے تکلیف زائل ہو گئی جسے تکلیف دی گئی تھی، اور تکلیف کے زائل ہونے سے صبر زائل ہو گیا، اور سزا کے اسباب میں سے ایک تکلیف ہے، اور تکلیف زائل ہو چکی ہے، لہٰذا رحمت کا ہونا ضروری ہے اور غضب کا اٹھ جانا ضروری ہے۔ پس اللہ کے فضل سے رحمت کا سب کو عام ہونا ضروری ہے، ان شاء اللہ۔ اللہ کے بارے میں ہمارا یہی گمان ہے۔\n\nکیونکہ اللہ، جو سچا ہے، فرماتا ہے: \"میں اپنے بندے کے گمان کے مطابق ہوتا ہوں، پس وہ مجھ سے اچھا گمان رکھے\"۔\n\nپس اس نے خبر دی اور حکم دیا، اور گمان کرنے والے کے حق میں یا کسی اور کے حق میں کوئی قید نہیں لگائی۔ اور اسی وجہ سے، جس چیز سے تکلیفیں پہنچتی ہیں، اسے عذاب کہا گیا ہے، یہ اللہ کی طرف سے اپنے بندوں کے لیے خوشخبری ہے کہ جس چیز سے تم تکلیف محسوس کرتے ہو، جب رحمت تمہیں گھیر لے گی تو تم اسے دوزخ میں بھی میٹھا سمجھو گے، جیسا کہ سردی سے ٹھٹھرنے والا آگ کی حرارت کو میٹھا سمجھتا ہے اور گرمی سے جلنے والا زمہریر (شدید ٹھنڈک) کی ٹھنڈک کو میٹھا سمجھتا ہے۔ اور اسی لیے جہنم میں آگ اور زمہریر دونوں کو جمع کیا گیا ہے تاکہ مزاجوں کا اختلاف ہو۔ پس جس چیز سے ایک مخصوص مزاج کو تکلیف پہنچتی ہے، وہی چیز دوسرے مخالف مزاج میں نعمت کا سبب بنتی ہے۔ پس حکمت معطل نہیں ہوتی، اور اللہ اہل جہنم کے لیے گرمی سے جلنے والوں پر زمہریر اور سردی سے ٹھٹھرنے والوں پر آگ باقی رکھے گا، پس وہ جہنم میں نعمت پائیں گے۔ وہ ایسے مزاج پر ہوں گے کہ اگر وہ اس مزاج کے ساتھ جنت میں داخل ہوتے تو اس کے اعتدال کی وجہ سے انہیں وہاں تکلیف ہوتی۔\n\n### (صبر آلات کے تنوع سے متنوع ہوتا ہے)\n\nپھر جان لو کہ صبر آلات کے تنوع سے متنوع ہوتا ہے۔ پس صبر فی اللہ (صبر في الله) جب اس (اللہ) کی خاطر تکلیف دی جائے، اور صبر مع اللہ (صبر مع الله) عذاب میں معذب کو دیکھنا ہے، اور صبر علی اللہ (صبر على الله) اپنے رب کو کھو دینے کی حالت ہے، جب اس کا اپنا وجود اس کے رب کے وجود سے منسلک نہ ہو۔ اور صبر باللہ (صبر بالله) یہ ہے کہ ذات حق (الحق) ہی اس کا صبر ہو، جیسا کہ وہ اس کی سماعت اور بصارت ہے۔ اور صبر من اللہ (صبر من الله) یہ ہے کہ جب تم سے حول اور قوت اٹھا لی جائے، پس تم یہ نہ کہو کہ لا حول ولا قوة إلا بالله (اللہ کے سوا کوئی طاقت اور قوت نہیں ہے)، کیونکہ یہ استعانت سے زائل ہو جاتا ہے۔ اور صبر عن اللہ (صبر عن الله)، اور یہ مقام کے لحاظ سے سب سے بڑا ہے، اور یہ وہ صبر ہے جو موت کے ساتھ زائل ہو جاتا ہے اور آخرت میں موجود نہیں ہو گا۔ کیونکہ اس صبر کا حامل صبر کو اپنی طرف اسی طرح منسوب کرتا ہے جس طرح اسم صبور (الصبور) کی نسبت اللہ کی طرف ہے۔ اور اسی لیے یہ دنیا کے زوال کے ساتھ ختم ہو جاتا ہے، اور بندے میں دنیا سے اس کے زائل ہونے کے ساتھ۔ اور جو تم سے زائل ہو گیا، وہ تم سے ختم ہو گیا۔ پس ان لوگوں نے صبر عن اللہ (صبر عن الله) کو اس طرح لیا، جیسے تم کہتے ہو کہ میں نے یہ علم فلاں سے لیا، پس تم اس میں اس کی طرح ہو۔\n\n### (خیر کی محبت اور رب کا ذکر)\n\nاسی طرح سلیمان علیہ السلام کا قول ہے: أَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي (میں نے خیر کی محبت کو اپنے رب کے ذکر سے پسند کیا)۔ کیونکہ انہوں نے اسے خیر کا نام دیا، اور خیر اللہ کی طرف منسوب ہے، پس انہوں نے کہا: \"عن ذكر ربي\" (اپنے رب کے ذکر سے) یعنی اس کے خیر ہونے کے وصف کی وجہ سے میں نے اسے پسند کیا۔ پس وہ خوشی اور اپنے رب کی خیر پر تعجب کے ساتھ ان کے ایالوں اور پنڈلیوں پر ہاتھ پھیرنے لگے۔ کیونکہ انہوں نے خیر کی محبت کو پسند کیا، اور خیر کی محبت یا تو یہ ہے کہ وہ اللہ کی محبت کا ارادہ کریں، یا خیر کی محبت اس لحاظ سے کہ خیر کو محبت کے وصف سے متصف کیا گیا ہے۔ اور خیر صرف نیک لوگوں سے ہی محبت کرتا ہے، کیونکہ وہ اس کی عین ہستی (وجود) کا محل ہیں۔ پس اسی طرح سلیمان علیہ السلام نے کہا: أَحْبَبْتُ حُبَّ الْخَيْرِ (میں نے خیر کی محبت کو پسند کیا)، یعنی میں اپنی محبت میں خیر کی محبت کی طرح ہوں۔ اور اسی لیے جب وہ (صافنات الجياد) پردے میں چھپ گئیں، تو انہیں ان کا اشتیاق ہوا، کیونکہ انہوں نے وہ محل کھو دیا تھا جس نے ان کے لیے یہ لذیذ صفت واجب کر دی تھی، کیونکہ وہ ان کے لیے ایک جلوہ گاہ (مجلی) تھیں۔ پس انہوں نے کہا: رُدُّوها عَلَيَ‏ (انہیں مجھ پر واپس لاؤ)۔\n\n### (قرآن کی تفسیر میں یہودیوں کی حکایات: اسرائیلیات)\n\nاور رہے وہ مفسرین جنہوں نے پردے میں چھپ جانے کو سورج سے منسوب کیا، تو یہاں نہ سورج کا کوئی ذکر ہے اور نہ اس نماز کا جس کا وہ دعویٰ کرتے ہیں۔ پھر وہ اس سلسلے میں قرآن کی تفسیر میں یہودیوں کی حکایات (الإسرائيليات) کو لیتے ہیں۔ حالانکہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے ہمیں حکم دیا ہے کہ ہم اہل کتاب کی نہ تصدیق کریں اور نہ تکذیب کریں۔\n\nپس جس نے قرآن کی تفسیر یہودیوں کی روایت سے کی، اس نے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے حکم کو رد کر دیا، اور جس نے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے حکم کو رد کیا، اس نے اللہ کے حکم کو رد کر دیا، کیونکہ اس نے حکم دیا ہے کہ ہم رسول کی اطاعت کریں، اور جو کچھ وہ ہمیں دیں اسے لے لیں، اور جس سے وہ ہمیں منع کریں اس سے باز آ جائیں۔ کیونکہ ان اسرائیلی انبیاء کی خبروں تک ہمیں صرف نبی ہی پہنچا سکتا ہے، تو ہم اس کی تصدیق کریں، یا اہل کتاب، تو ہم ان کی خبروں پر رک جائیں، اگر وہ ہماری کتاب میں یا ہمارے رسول صَلَّى اللهُ عَليهِ وسَلَّم کے قول میں نہ ہوں، اور نہ ہی عقلی دلائل میں کوئی ایسی چیز ہو جو اسے رد کرے یا ثابت کرے، اور ہم اس بارے میں کوئی فیصلہ نہ کریں۔ اور آیت کا سیاق و سباق ان کی کہی ہوئی بات پر کسی بھی ظاہری پہلو سے بالکل دلالت نہیں کرتا۔\n\n### (سلیمان علیہ السلام کا گھوڑوں سے محبت کرنا اپنے رب کے ان کے ذکر کی وجہ سے تھا)\n\nاور رہے ان کا اس بات سے سکون حاصل کرنا جو انہوں نے اس قول کی تفسیر میں بیان کیا ہے: ولَقَدْ فَتَنَّا سُلَيْمانَ (اور بیشک ہم نے سلیمان کو آزمایا)، تو وہ فتنہ (آزمائش) گھوڑوں سے متعلق نہیں تھی، بلکہ اگر یہ گھوڑوں سے متعلق ہو بھی، تو ان کا امتحان یہ تھا کہ جب وہ انہیں دیکھیں تو کیا وہ ان سے محبت میرے (رب کے) ذکر کی وجہ سے کرتے ہیں یا ان کی اپنی ذات کی وجہ سے؟\n\nپس انہوں نے صَلَّى اللهُ عَليهِ وسَلَّم نے خبر دی کہ انہوں نے ان سے محبت اپنے رب کے ان کے ذکر کی وجہ سے کی، نہ کہ ان کی خوبصورتی اور جمال کی وجہ سے، اور نہ ہی اپنی ضرورت کی وجہ سے، حالانکہ وہ اس بادشاہت کا ایک حصہ تھیں جس کے بارے میں انہوں نے سوال کیا تھا کہ ان کے بعد کسی اور کے لیے مناسب نہ ہو۔ پس ذات حق (الحق) نے مجموعی طور پر ان کے سوال کا جواب دیا اور ان سے حرج کو اٹھا لیا۔\n\nاور ان سے فرمایا: هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ (یہ ہماری بخشش ہے، پس تو احسان کر یا روک رکھ، کوئی حساب نہیں ہے)۔ اور إِنَّ لَهُ عِنْدَنا (اور بیشک اس کے لیے ہمارے پاس)، یعنی آخرت میں، لَزُلْفى‏ وحُسْنَ مَآبٍ (قرب اور بہترین ٹھکانہ ہے)۔ یعنی یہ بادشاہت آخرت کی بادشاہت میں کوئی کمی نہیں کرے گی، جیسا کہ وہ دوسروں کے ساتھ کرتا ہے، جہاں وہ ان کے لیے آخرت کی نعمتوں میں کمی کرتا ہے اس قدر جتنی انہوں نے دنیا میں نعمتیں حاصل کیں۔ اللہ تعالیٰ نے ایک قوم کے حق میں فرمایا: أَذْهَبْتُمْ طَيِّباتِكُمْ في حَياتِكُمُ الدُّنْيا واسْتَمْتَعْتُمْ بِها (تم نے اپنی پاکیزہ چیزیں اپنی دنیاوی زندگی میں ختم کر دیں اور ان سے لطف اندوز ہو گئے)۔\n\n### (صبر عن اللہ صبر کی سب سے بڑی قسم ہے)\n\nپس اس تفسیر کے مطابق صبر عن اللہ (صبر عن الله) صبر کی سب سے بڑی قسم ہے۔ اور رہا صبر عن اللہ (صبر عن الله) اس مفہوم میں جو عام لوگ سمجھتے ہیں کہ کسی چیز سے اس کی جدائی کی وجہ سے صبر کرنا، تو یہ اہل اللہ کا شیوہ نہیں ہے۔ اور شبلی (الشبلي) پر جب ایک نوجوان کے اس قول سے غشی طاری ہوئی کہ صبر عن اللہ (صبر عن الله) سب سے بڑا صبر ہے، تو انہیں اس مقام کی عظمت کی وجہ سے غشی آئی جو صرف کامل مردوں کو ہی حاصل ہوتا ہے۔ پس جب شبلی کے سامنے نوجوان کی بات سے یہ مقام ظاہر ہوا، تو ان کا وارد (روحانی اثر) شبلی کے محل (قابلیت) سے زیادہ قوی تھا، اسی لیے اس نے ان پر غشی کا اثر کیا۔ اور اسی طرح ہر وہ وارد جو محل کی قوت سے زیادہ قوی ہو، وہ اس میں غشی اور صعق (بے ہوشی) پیدا کرتا ہے۔ اور اہل اللہ کے لیے عام لوگوں کی تفسیر کے مطابق صبر عن اللہ (صبر عن الله) میں کوئی قدم نہیں ہے۔\n\n### (عارفین کے نزدیک صبر کے درجات)\n\nاور عارفین (العارفين) کے نزدیک صبر کے درجات ہیں: اہل انوار (اہل الأنوار) کے نزدیک تین سو تئیس (323) درجات، اور ان میں سے اہل اسرار (اہل الأسرار) کے نزدیک دو سو ترانوے (293) درجات، اور اہل انوار میں سے ملامیہ (الملامية) کے نزدیک دو سو بانوے (292) درجات، اور ان میں سے اہل اسرار کے نزدیک دو سو باسٹھ (262) درجات ہیں۔",
    "fa": "(باب صد و بیست و چهارم در معرفت مقام صبر و جزئیات و اسرار آن)\n\nتنوع شرب الصبر في كل مشرب *** بعن وعلى أو في وبالباء واللام‏\nنوشیدن صبر در هر مشربی متنوع است *** با «عن»، «علی»، «او»، «فی»، «باء» و «لام».\n\nوليس يكون الصبر إلا على أذى *** وجودا وتقديرا بأنواع آلام‏\nو صبر جز بر آزار و اذیت نیست *** چه در وجود و چه در تقدیر، با انواع دردها.\n\nوعين للحق الصبور أذى أتى *** بمحكم آيات الكتاب لإعلام‏\nو حق (الحق) صبور، آزار و اذیتی را که به او رسید، مشخص کرد *** با آیات محکم کتاب برای آگاهی دادن.\n\nفلا صبر في النعماء إن كنت عالما *** بقول إمام صادق الحكم علام‏\nپس اگر به قول امامی راستگو، حکیم و دانا آگاه باشی *** در نعمت‌ها صبری وجود ندارد.\n\n[صبر، بازداشتن نفس از شکایت به غیر خداست]\n\nبدان، خداوند تو را توفیق دهد، که خدای تعالی می‌فرماید: «إِنَّ الَّذِينَ يُؤْذُونَ الله ورَسُولَهُ» (همانا کسانی که خدا و پیامبرش را آزار می‌دهند). پس خبر داد که آزار می‌بیند، و خود را سبحانه به «صبور» نامید بر آزار خلقش. همان‌طور که از بندگانش خواست که آزار را برطرف کنند، با وجود استحقاقش برای نام صبور (الصبور)، همچنین نام صبر از بنده برداشته نمی‌شود اگر بلایی بر او نازل شود و از خداوند بخواهد که آن بلا را برطرف کند. چنانکه ایوب (علیه السلام) انجام داد و گفت: «مَسَّنِيَ الضُّرُّ وأَنْتَ أَرْحَمُ الرَّاحِمِينَ» (به من آسیب رسیده و تو مهربان‌ترین مهربانانی). و خداوند با وجود این درخواست، او را ستود و فرمود: «إِنَّا وَجَدْناهُ صابِراً» (ما او را صابر یافتیم). پس صبر، بازداشتن نفس از شکایت به خدا برای رفع بلا یا دفع آن نیست، بلکه صبر، بازداشتن نفس از شکایت به غیر خدا و تکیه کردن به آن غیر است. و من برای تو روشن ساختم که خداوند از بندگانش خواست که آزار و اذیتی را که به او رسانده‌اند، برطرف کنند، با وجود قدرتش بر اینکه آنچه را که از آزار در آن‌ها خلق کرده، خلق نکند. پس به راز این صبر توجه کن، که از بهترین اسرار است. و وارد شده است که هیچ‌کس بر آزار و اذیت صبورتر از خدا نیست.\n\n[صبر از مقاماتی است که با ورود اهل دوزخ به دوزخ و اهل بهشت به بهشت منقطع می‌شود]\n\nو صبر از مقاماتی (المقامات) است که با ورود اهل دوزخ به دوزخ و اهل بهشت به بهشت، منقطع و زائل می‌شود. و این دو گروه به طور کامل از هم جدا می‌شوند، به گونه‌ای که هیچ‌کس به غیر از سرایی که در آن است، ملحق نمی‌شود. و حکم صبر الهی با زوال دنیا از بین می‌رود. و این مژده‌ای است به از بین رفتن نام‌های «منتقم» و «شدید العقاب» (سخت‌کیفر)، زیرا ما زوال نام صبور (الصبور) را دیدیم و رحمت او بر غضبش پیشی گرفته است.\n\n[حکمت زوال دنیا، رفع آزار از خدا و فراگیری رحمت بر همه بندگان خداست]\n\nپس حکمت زوال دنیا، رفع آزار از خداست، زیرا آزار جز در دنیا وجود ندارد. پس ای بندگان خدا، به فراگیری و وسعت رحمت و گسترش آن بر هر مخلوقی جز خدا، بشارت دهید، ولو پس از مدتی. زیرا با از بین رفتن دنیا، آزار از هر کسی که آزار دیده، برطرف می‌شود، و با زوال آزار، صبر نیز زائل می‌شود. و از اسباب عقاب، آزار است، و آزار زائل شده است. پس ناگزیر رحمت خواهد بود و غضب مرتفع می‌شود. پس ناگزیر رحمت به فضل خدا همه را فرا خواهد گرفت، ان‌شاءالله. این گمان ما به خداست.\n\nزیرا خداوند که صادق است، می‌فرماید: «أنا عند ظن عبدي بي فليظن بي خيرا» (من نزد گمان بنده خود هستم، پس باید به من گمان نیک ببرد).\n\nپس خبر داد و امر کرد و در حق گمان‌کننده و غیر او قیدی نگذاشت. و به همین دلیل، آنچه که با آن دردها واقع می‌شود، عذاب نامیده شده است، که مژده‌ای است از جانب خدا به بندگانش که آنچه با آن متألم می‌شوید، ناگزیر است که وقتی رحمت شما را فرا گرفت، آن را شیرین بیابید، حتی در حالی که در آتش هستید. همان‌طور که فرد سرمازده، گرمای آتش را شیرین می‌یابد و فرد گرمازده، سرمای زمهریر را. و به همین دلیل، جهنم آتش و زمهریر را برای اختلاف مزاج‌ها جمع کرده است. پس آنچه که برای مزاجی خاص دردآور است، برای مزاجی دیگر که متضاد آن است، نعمت‌آور خواهد بود. بنابراین، حکمت تعطیل نمی‌شود و خداوند زمهریر را برای گرمازدگان و آتش را برای سرمازدگان بر اهل جهنم باقی می‌گذارد، پس آن‌ها در جهنم متنعم می‌شوند. آن‌ها بر مزاجی هستند که اگر با آن وارد بهشت شوند، به دلیل اعتدال بهشت، در آن عذاب می‌بینند.\n\n[صبر با تنوع ابزارها متنوع می‌شود]\n\nسپس بدان که صبر با تنوع ابزارها متنوع می‌شود. پس «صبر فی الله» (صبر در خدا) زمانی است که در راه او آزار ببیند. و «صبر مع الله» (صبر با خدا) دیدن عذاب‌دهنده در عذاب است. و «صبر علی الله» (صبر بر خدا) حالتی است که بنده پروردگارش را گم می‌کند، به این معنا که وجود نفسش با وجود پروردگارش همراه نیست. و «صبر بالله» (صبر به واسطه خدا) این است که حق (الحق) عین صبر او باشد، همان‌طور که شنوایی و بینایی اوست. و «صبر من الله» (صبر از خدا) حالتی است که حول و قوه از تو برداشته شود، پس نمی‌گویی «لا حول ولا قوة إلا بالله» (هیچ حول و قوه‌ای جز به خدا نیست)، و این با استعانت زائل می‌شود. و «صبر عن الله» (صبر از خدا) که عظیم‌ترین مقام‌هاست و صبری است که با مرگ زائل می‌شود و در آخرت وجود ندارد. زیرا صاحب این صبر، صبر را به خود نسبت می‌دهد، همان‌طور که اسم صبور (الصبور) به خدا نسبت داده می‌شود. و به همین دلیل، با زوال دنیا مرتفع می‌شود و در بنده با زوال او از دنیا. و هر کس که این صبر از او زائل شود، از تو نیز زائل شده است. پس اینان صبر را «عن الله» (از خدا) گرفته‌اند، همان‌طور که می‌گویی: این علم را از فلان شخص گرفتم، پس تو در آن مانند او هستی.\n\n[دوست داشتن خیر و ذکر پروردگار]\n\nهمچنین است سخن سلیمان (علیه السلام) که فرمود: «أَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي» (دوست داشتن خیر را به سبب یاد پروردگارم دوست داشتم). زیرا او آن را خیر نامید و خیر منسوب به خداست. پس گفت: «عن ذكر ربي» (به سبب یاد پروردگارم) که آن را به خیریت وصف کرده است، من آن را دوست داشتم. پس شروع کرد به دست کشیدن بر گردن‌ها و ساق‌های آن‌ها، از روی شادی و شگفتی به خیر پروردگارش. زیرا او دوست داشتن خیر را دوست داشت. و دوست داشتن خیر یا به معنای دوست داشتن خداست که آن را دوست دارد، یا دوست داشتن خیر از آن جهت که خیر به صفت حب (دوست داشتن) وصف شده است. و خیر جز نیکان را دوست ندارد، زیرا آن‌ها محل وجود عین آن هستند. همچنین سلیمان (علیه السلام) فرمود: «أَحْبَبْتُ حُبَّ الْخَيْرِ» (دوست داشتن خیر را دوست داشتم)، یعنی من در دوست داشتنم مانند خیر در دوست داشتنش هستم. و به همین دلیل، هنگامی که آن اسبان اصیل (الصافنات الجياد) «تَوارَتْ بِالْحِجابِ» (پشت پرده پنهان شدند)، مشتاق آن‌ها شد، زیرا محلی را که این صفت لذت‌بخش را برای او واجب کرده بود، از دست داد. زیرا آن‌ها تجلی‌گاه (مجلی) او بودند. پس گفت: «رُدُّوها عَلَيَ» (آن‌ها را به من بازگردانید).\n\n[حکایات یهود در تفسیر قرآن (اسرائیلیات)]\n\nاما مفسرانی که پنهان شدن (التواري) را به خورشید نسبت داده‌اند، در اینجا نه ذکری از خورشید است و نه از نمازی که گمان می‌کنند. سپس آن‌ها در این باره به حکایات یهود در تفسیر قرآن می‌پردازند، در حالی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به ما امر فرمود که اهل کتاب را نه تصدیق کنیم و نه تکذیب.\n\nپس هر کس قرآن را با روایت یهود تفسیر کند، امر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را رد کرده است. و هر کس امر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را رد کند، امر خدا را رد کرده است. زیرا خداوند امر فرموده که از رسول اطاعت کنیم و آنچه را که برای ما آورده بگیریم و از آنچه ما را نهی کرده، بازایستیم. چرا که ما را به اخبار این پیامبران اسرائیلی نمی‌رساند مگر پیامبری که او را تصدیق کنیم، یا اهل کتابی که در برابر اخبارشان توقف کنیم، اگر در کتاب ما و قول رسول ما (صَلَّى اللهُ عَليهِ وسَلَّم) و در ادله عقول ما چیزی نباشد که آن را رد یا اثبات کند، و در آن هیچ قضاوتی نکنیم. اما سیاق آیه به هیچ وجه ظاهر بر آنچه آن‌ها گفته‌اند، دلالت نمی‌کند.\n\n[دوست داشتن سلیمان (علیه السلام) اسب‌ها را به سبب یاد پروردگارش از آن‌ها]\n\nو اما استدلال آن‌ها در تفسیرشان به این قول که «ولَقَدْ فَتَنَّا سُلَيْمانَ» (و ما سلیمان را آزمودیم)، آن فتنه (آزمایش) اگر مربوط به اسب‌ها باشد، این نیست. بلکه آزمایش او این بود که وقتی آن‌ها را دید، آیا آن‌ها را به سبب یاد من از آن‌ها دوست می‌دارد یا به خاطر خودشان؟\n\nپس (سلیمان) خبر داد که آن‌ها را به سبب ذکر پروردگارش از آن‌ها دوست داشته است، نه به خاطر خودشان، با وجود زیبایی و جمالشان و نیاز او به آن‌ها، در حالی که آن‌ها جزئی از مُلکی بودند که او درخواست کرده بود پس از او برای هیچ‌کس شایسته نباشد. پس حق (الحق) به آنچه در مجموع درخواست کرده بود، پاسخ داد و حرج را از او برداشت.\n\nو به او فرمود: «هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ» (این عطای ماست، پس بی‌حساب ببخش یا نگه دار). و «إِنَّ لَهُ عِنْدَنا» (همانا برای او نزد ما)، یعنی در آخرت، «لَزُلْفى‏ وحُسْنَ مَآبٍ» (قرب و بازگشت نیکویی است). یعنی این مُلک چیزی از مُلک آخرت او کم نمی‌کند، برخلاف آنچه با دیگران انجام می‌دهد، که از نعمت آخرتشان به اندازه آنچه در دنیا بهره‌مند شده‌اند، کم می‌کند. خداوند تعالی در حق قومی فرمود: «أَذْهَبْتُمْ طَيِّباتِكُمْ في حَياتِكُمُ الدُّنْيا واسْتَمْتَعْتُمْ بِها» (شما پاکی‌های خود را در زندگی دنیای خود از بین بردید و از آن‌ها بهره‌مند شدید).\n\n[صبر عن الله (صبر از خدا) عظیم‌ترین انواع صبر است]\n\nپس «صبر عن الله» (صبر از خدا) با این تفسیر، عظیم‌ترین انواع صبر است. اما «صبر عن الله» بر اساس آنچه عوام از صبر بر دوری از چیزی به دلیل مفارقت آن تصور می‌کنند، از شأن اهل الله نیست. و شبلی (رحمه الله) هنگامی که از سخن آن جوان که گفت: «صبر عن الله عظیم‌ترین صبر است»، غش کرد، به دلیل عظمت مقامی بود که جز کاملان از مردان به آن نمی‌رسند. پس چون آنچه از کلام جوان بر شبلی آشکار شد، وارد (تجلی) او قوی‌تر از محل (ظرفیت) شبلی بود، از این رو غش در او تأثیر گذاشت. و این‌گونه است هر واردی که از قدرت محل قوی‌تر باشد، در آن غش و صعق (بیهوشی) ایجاد می‌کند. و اهل الله بر تفسیر عوام، قدمی در «صبر عن الله» ندارند.\n\n[درجات صبر نزد عارفان]\n\nو برای صبر نزد عارفان (العارفين) از اهل انوار (الأنوار)، سیصد و بیست و سه درجه است. و نزد اهل اسرار (الأسرار) از ایشان، دویست و نود و سه درجه است. و نزد ملامیه از اهل انوار، دویست و نود و دو درجه است. و نزد اهل اسرار از ایشان، دویست و شصت و دو درجه است."
  },
  "page_count": 2
}