{
  "id": 295,
  "title": {
    "ar": "الباب الخامس والتسعون ومائتان في معرفة منزل الأعداد المشرفة من الحضرة المحمدية",
    "en": "Chapter Two Hundred and Ninety-Five: Concerning the Gnosis of the Station of the Noble Numbers from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب دو سو پچانوے: الحضرة المحمدیۃ (الحضرة المحمدية) سے شرف یافتہ اعداد کے مقام کی معرفت (المعرفة) کے بیان میں۔",
    "fa": "باب دویست و نود و پنجم در معرفت جایگاه اعداد شریف از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## (الباب الخامس والتسعون ومائتان في معرفة منزل الأعداد المشرفة من الحضرة المحمدية)\n\n\n> تفجرت الأنهار من ذات أحجار *** وغاصت بأرضي في خزائن أسراري‏\n\n\n> فعشر من العلم اللدني ظاهر *** وما كتمت منه فتسعة أعشار\n\n\n> تطالبني نفسي بمثنى وجودها *** ويطلبني وترى المصاب بأوتار\n\n\n> فحصنت نفسي في مدينة سيد *** بناها من الماء المركب والنار\n\n\n> فلم ير حصن مثله في ارتفاعه *** تحصنت فيه خلف سبعة أسوار\n\n\n> مكانتها ما بين ذل وعزة *** يعاملني فيها على حد مقداري‏\n\n\n> إلى أن يكون النفخ في صور حسه *** إلى صور تخييل ببرزخ أغياري‏\n\n\n> ويبقى دوام الأمر فيه مخلدا *** إلى أن يكون البعث من قبر أفكاري‏\n\n\n> فأشهده علما وعينا وحالة *** بمشهد أنوار ومشهد أسراري‏\n\n\n> منوعة تلك المظاهر عندنا *** برؤية أفكار ورؤية أبصار\n\n\n### [علم اللوائح وهي منزلة عجيبة لا تقبل الغفلة والنسيان‏]\n\n\nفهرست ما يتضمنه هذا المنزل من العلوم وذلك علم اللوائح وهي مقدمات الذوق وهي منزلة عجيبة لا تقبل الغفلة والنسيان وفيه علم دخول التأنيث في العدد وهو مذكر وفيه علم المانية من أين ضلت وما وجه الحق الذي عندها حتى قادها إلى هذا الاعتقاد وهل لها عذر مقبول في ذلك يوم القيامة أم لا وفيه علم الدخول وهو طلب الأوتار ولما ذا تطلب ولمن يرجع فضلها وهل المغصوب على نفسه بالقتل هل يرضى بذلك أم لا ولاية حكمة جعل ذلك للولي وهل إذا عفا الولي عن الدم هل يسقط حق المقتول يوم القيامة أم مثل الحوالة في الدين إذا قبلها صاحب الحق لم يبق له رجوع على الأول إن أعسر المرجوع إليه عنه بعد رضاء صاحب الدين بالحوالة وفيه علم قرار الغيب حتى لا يشهد ولما ذا يقر وفيه علم الغيب الذي يجب أن يشهد وطلبه لذلك من الله وفيه علم العقل ومرتبة صاحبه وفيه علم الاعتبار وفيه علم الانتقال في الأحوال والمقامات وفيه علم الكيفيات والكميات وفيه علم التعالي ولما ذا يؤدي وإنه مخصوص بأهل البلادة دون الأذكياء وفيه علم الصلاح والفساد وفيه علم ما يترتب على الأعمال سواء وقع التكليف أو لم يقع وفيه من أين أخذ علم أهل النجوم الحاكمون بها الواقفون على ما أودع الله فيها من الأحكام من العلوم الإلهية وشرفه على سائر العلوم وذكر الحيوان الذي إذا أكل أعلاه أعطى بالخاصية لمن أكله علم النجوم وإذا أكل وسطه أعطى علم النبات وإذا أكل عجزه وهو ما يلي ذنبه أعطى علم المياه المغيبة في الأرض فيعرف إذا أتى أرضا لا ماء فيها على كم ذراع يكون الماء فيها وهذا الحيوان حية ليست بالكبيرة ولا بالصغيرة لا يوجد إلا بأحواز شلب من غرب الأندلس وكان قد وقع بها عندنا عبد الله بن عبدون كاتب أمير المسلمين فقطع رأسها وذنبها بسكين ذي شعبتين في ضربة واحدة وقسمها ثلاث قطع وكانوا ثلاثة إخوة فأكل عبد الله أعلاها فكان في علم القضاء بالنجوم آية من غير مطالعة كتاب أو توقيف إمام وأكل أخوه عبد المجيد الوسط منها فكان آية في علم النبات وخواصه وتركيباته من غير مطالعة كتاب ولا توقيف أخبرني ولده المنجنيقي بذلك بقونية وأكل الأخ الثالث القطعة الاخيرة التي تلي الذنب منها فكان آية في استخراج المياه من جوف الأرض فسبحان من أودع أسراره في خلقه وفيه علم الفرق في خرق العوائد بين الكرامة والاستدراج وفيه علم السبب الذي أوجب أن يحب العالم الحيواني الإنساني غير الله وسبب الحب أمران النسبة والإحسان والنسبة إلى الله أقرب فإنه مخلوق على الصورة والإحسان من الله فهو المنعم عليه بإيجاد عينه ثم لكل ما هو فيه فكيف يحب غيره ويفنى فيه وفيه‏\nعلم الآخرة وما يتعلق بها من حين وقوف الناس على الجسر دون الظلمة إلى أن يدخلوا منازلهم من الشقاء والسعادة فهذا جميع ما يتضمنه هذا المنزل من العلوم قد نبهتك عليها لترتفع الهمة إلى طلبها فلنذكر منها مسألة أو أكثر على قدر ما يتسع الكلام مع الاختصار دون الإطالة والإكثار فأقول والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n### [خلق الأرواح الملكية المهيمة والكروبيون‏]\n\n\nاعلم أن الله لما خلق الأرواح الملكية المهيمة وهم الذين لا علم لهم بغير الله لا يعلمون أن الله خلق شيئا سواهم وهم الكروبيون المقربون المعتكفون المفردون المأخوذون عن أنفسهم بما أشهدهم الحق من جلاله اختص منهم المسمى بالعقل الأول والأفراد منا على مقامهم فجلال الله في قلوب الأفراد على مثل ذلك فلا يشهدون سوى الحق وهم خارجون عن حكم القطب الذي هو الإمام وهو واحد منهم ولكنه يكون مادته من العقل الأول الذي هو أول موجود من عالم التدوين والتسطير وهو الموجود الإبداعي ثم بعد ذلك من غير بعدية زمان انبعث عن هذا العقل موجود انبعاثي وهو النفس وهو اللوح المحفوظ المكتوب فيه كل كائن في هذه الدار إلى يوم القيامة وذلك علم الله في خلقه وهو دون القلم الذي هو العقل في النورية والمرتبة الضيائية فهو كالزمردة الخضراء لانبعاث الجوهر الهبائي الذي في قوة هذه النفس فانبعث عن النفس الجوهر الهبائي وهو جوهر مظلم لا نور فيه وجعل الله مرتبة الطبيعة بين النفس والهباء مرتبة معقولة لا موجودة ثم بما أعطى الله من وضع الأسباب والحكم ورتب في العالم من وجود الأنوار والظلم لما يقتضيه الظاهر والباطن كما جعل الابتداء في الأشياء والانتهاء في مقاديرها بأجل معلوم وذلك إلى غير نهاية فما ثم إلا ابتداءات وانتهاءات دائمة من اسميه الأول والآخر فعن تينك الحقيقتين كان الابتداء والانتهاء دائما فالكون جديد دائما فالبقاء السرمدي في التكوين فأعطى لهذه النفس لما ذكرناه قوة عملية عن تلك القوة أوجد الله سبحانه بضرب من التجلي الجسم الكل صورة في الجوهر الهبائي وما من موجود خلقه الله عند سبب إلا بتجل إلهي خاص لذلك الموجود لا يعرفه السبب فيتكون هذا الموجود عن ذلك التجلي الإلهي والتوجه الرباني عند توجه السبب لا عن السبب ولو لا ذلك لم يكن ذلك الموجود وهو قوله سبحانه وتعالى فينفخ فيه فلم يكن للسبب غير النفخ فيكون طائرا بإذن الله فالطائر إنما كان لتوجه أمر الله عليه بالكون وهو قوله تعالى كُنْ بالأمر الذي يليق بجلاله فلما أوجد هذا الجسم الأول لزمه الشكل إذ كانت الأشكال من لوازم الأجسام فأول شكل ظهر في الجسم الشكل المستدير وهو أفضل الأشكال وهو للاشكال بمنزلة الألف للحروف يعم جميع الأشكال كما إن حرف الألف يعم جميع الحروف بمروره هواء من الصدر على مخارجه إلى أن يجوز الشفتين فهو يظهر ذوات الحروف في المخارج فإذا وقف في الصدر ظهر حرف الهاء والهمزة في أعيانهما عن حرف الألف فإذا انتقل من الصدر إلى الحلق ووقف في مراتب معينة في الحلق أظهر في ذلك الوقوف وجود الحاء المهملة ثم العين المهملة ثم الخاء المعجمة ثم الغين المعجمة ثم القاف المعقودة ثم الكاف وأما القاف التي هي غير معقودة فهي حرف بين حرفين بين الكاف والقاف المعقودة ما هي كاف خالصة ولا قاف خالصة ولهذا ينكرها أهل اللسان فأما شيوخنا في القراءة فإنهم لا يعقدون القاف ويزعمون أنهم هكذا أخذوها عن شيوخهم وشيوخهم عن شيوخهم في الأداء إلى أن وصلوا إلى العرب أهل ذلك اللسان وهم الصحابة إلى النبي صلى الله عليه وسلم كل ذلك أداء وأما العرب الذين لقيناهم ممن بقي على لسانه ما تغير كبني فهم فإني رأيتهم يعقدون القاف وهكذا جميع العرب فما أدري من أين دخل على أصحابنا ببلاد المغرب ترك عقدها في القرآن وهكذا حديث سائر الحروف إلى آخرها وهو الواو وليس وراء الواو مرتبة لحرف أصلا وليس للاشكال في الأجسام حد ينتهي إليه يوقف عنده لأنه تابع للعدد والعدد في نفسه غير متناه فكذلك الأشكال فأول شكل ظهر بعد الاستدارة المثلث ومن المثلث المتساوي الأضلاع والزوايا تمشي الأشكال في المجسمات إلى غير نهاية وأفضل الأشكال وأحكمها المسدس وكلما اتسع الجسم وعظم قبل الكثير من الأشكال ثم أمسك الله الصورة الجسمية في الهباء بما أعطته الطبيعة من مرتبتها التي جعلناها بين النفس والهباء ولو لم يكن هنالك مرتبتها لما ظهر الجسم في هذا الجوهر ولا كان له فيه ثبوت فكانت الطبيعة للنفس كالآلة للصانع التي يفتح بها الصور الصناعية في المواد فظهر الجسم الكل في هذا الجوهر عن النفس بآلة الحرارة وظهرت الحياة فيه بمصاحبة\nالحرارة الرطوبة وثبتت صورته في الهباء بالبرودة واليبوسة وجعله أعني هذا الجسم الكري على هيأة السرير وخلق له حملة أربعة بالفعل ما دامت الدنيا وأربعة أخر بالقوة يجمع بين هؤلاء الأربعة والأربعة الآخر يوم القيامة فيكون المجموع ثمانية وسماه العرش وجعله معدن الرحمة فاستوى عليه باسمه الرحمن وجعله محيطا بجميع ما يحوي عليه من الملك متحيزا يقبل الاتصال والانفصال وعمر الأينية الظرفية المكانية وكان مرتبة ما فوقه بينه وبين العماء الذي ما فوقه هواء وما تحته هواء وهو للاسم الرب والله هو الاسم الجامع المهيمن على جميع الأسماء الإلهية فصفته المهيمنية وتوحدت الكلمة في العرش فهي أول الموجودات التي قبلها عالم الأجسام ثم أوجد جسما آخر في جوهر هذا الهباء فإن جوهر هذا الهباء هو الذي عمر الخلأ فكل ما ظهر من الصور المتحيزة الجسمية والجسمانية فهذا الجوهر هو القابل لها وإنما قلنا هذا لئلا يتخيل أن الكرسي صورة في العرش وليس كذلك وإنما هو صورة أخرى في الهباء قبلها كما قبل صورة العرش على حد واحد ولكن بنسب مختلفة فسمى هذا الموجود الآخر كرسيا ودلى إليه القدمين من العرش فانفلقت الرحمة انفلاق الحب فتنوعت الرحمة في الصفة إلى إطلاق وتقييد فظهرت الرحمة المقيدة وهي القدم الواحدة وتيمزت الرحمة المطلقة بظهور هذه القدم الأخرى فظهر في هذه القدم انقسام الكلمة الواحدة العرشية التي لم يظهر لها انقسام في العرش إلى خبر وحكم وانقسم الحكم إلى أمر ونهي وانقسم الأمر إلى وجوب وندب وإباحة وانقسم النهي إلى حظر وكراهة وانقسم الخبر إلى هذه الأقسام وزيادة من استفهام وتقرير ودعاء وإنكار وقصص وتعليم فتنوعت الألسن وظهرت الملاحن في الكرسي فظهر تفصيل النغمات التي كانت مجملة في العرش فهو أول طرب ظهر في عالم الأجسام من السماع ومن هنالك سرى في عالم الأفلاك والسموات والأركان والمولدات ثم أوجد الحق أيضا جسما آخر مستديرا دون الكرسي في الرتبة وجعله مستديرا فلكيا غير مكوكب قدر فيه سبحانه أثنى عشر تقديرا مقادير معينة سمي كل مقدار منها باسم لم يسم به الآخر وهي المعروفة بالبروج وأظهر منها سلطان الطبيعة فجعل منها ثلاثة من اجتماع الحرارة واليبوسة وجعل أحكامها مختلفة وإن كانت على طبيعة واحدة ولكن المكان المعين من هذا الفلك لما اختلف اختلفت أحكامها من ذلك الوجه وبما هي على طبيعة واحدة من الحر واليبس اتفقت أحكامها فتعمل بالاتفاق من وجه وبالاختلاف من وجه ولهذا ظهر عنها الكون والفساد والتغيير والاستحالات ولست أعني بالفساد الشرور المعتادة عندنا هنا وإنما أعني بالفساد زوال نظم مخصوص يقال فيه فسد ذلك النظام أي زال كما تأكل التفاحة أو تشقها بالسكين إلى أقسام فقد فسد نظامها فذهبت تلك الصورة بظهور صورة أخرى فيها وعن\n\n\nهذا الفلك يتكون جميع ما في الجنة وعنه يكون الشهوة لأهلها وهو عرش التكوين ثم إن الله تعالى أوجد في جوف هذا الفلك الأطلس الذي هو محل لهذه الطبائع التي هي آلة النفس العملية فلكا آخر في جوهر الهباء كما ذكرنا وبالتجلي الإلهي كما ذكرنا إذ لا يكون التكوين الإله سبحانه وهذا الفلك هو فلك الكواكب الثابتة والمنازل التي يقدر بها تقسيم البروج المقدرة في الأطلس إذ كان الأطلس متشابه الأجزاء وهي ثمانية وعشرون منزلة وهي النطح والبطين والثريا والدبران والهنعة والهقعة والذراع والنثرة والطرف والجبهة والزبرة والصرفة والعوا والسماك والغفر والزبايا والإكليل والقلب والشولة والنعائم والبلدة وسعد الذابح وسعد بلع وسعد السعود وسعد الأخبية والفرع المقدم والفرع المؤخر والرساء فهذه ثمان وعشرون منزلة معروفة مسماة يحكم لها بطبائع البروج وهي الحمل والثور والجوزاء والسرطان والأسد والسنبلة والميزان والعقرب والقوس والجدي والدلو والحوت ولهذا الفلك المكوكب أعني فلك المنازل قطع في الفلك الأطلس فلك البروج وجعل لكل تقدير في فلك البروج منزلتين وثلث من المنازل المذكورة ولمنازله وجميع كواكبه سباحة في أفلاك لها بطيئة لا يحس بها البصر إلا بعد آلاف من السنين كما ذكر عن أهرام مصر أنها بنيت‏\n\n\nوالنسر في الأسد وهو اليوم في الجدي ونحن في سنة أربع وثلاثين وستمائة ثم أوجد على سطح هذا الفلك المكوكب الجنة بما فيها بطالع الأسد وهو برج ثابت فلهذا كان لها الدوام فإن أصحاب هذا الفن قد سموا هذه البروج بالأسماء التي ذكرناها ونعتوها بأمور على حسب ما أطلعهم الله عليه‏\nمن آثارها العجيبة في حركاتها فعرفوا منها الثابت والمنقلب وذا الجسدين وغير ذلك وإلى الفلك الأطلس ينتهي علم أهل الإرصاد وعلى الحقيقة إنما ينتهي إلى الكوكب فإن حركات الكواكب والكواكب تعين أفلاكها ولو لا ذلك ما عرف عددها وأما الفلك الأطلس فما استدلوا عليه من حيث أدركوه حسا كما أدركوا أفلاك لكواكب وإنما علموا إن هذه الأفلاك لا تقطع إلا في أمر وجودي فلكي مثلها فأثبتوه عقلا لا حسا وسموه أطلس لكونه لا كوكب فيه يعينه للحس ويبطل عليهم هذا الدليل بحركة أقصى الأفلاك فإن حركتها موجودة ولا تقطع في شي‏ء عندهم أصلا فما يدريك يا صاحب الرصد لعل هذا الفلك المكوكب يقطع في لا شي‏ء والحكماء لم يمنعوا أن يكون فوق الفلك الأطلس أفلاك أخر إلا أن الراصد لم يبلغ إليها لأنه ما ثم ما يدل عليها بل هي في حكم الجواز عندهم لكن قالوا إن كان هنالك فلك فلا بد أن يكون له نفس وعقل ومع ذلك لا بد من الانتهاء ومن هذا الفلك وقع الخلاف بيننا وبين الحكماء من الفلاسفة في ترتيب التكوين وما نازعونا فيما فوق الأطلس الذي هو الكرسي والعرش وقالوا بالجواز فيه فترتيب الأمر عندنا بعد الفلك المكوكب ولم يكن مكوكبا عند خلقه وإنما ظهرت الكواكب بعد هذا فيه وفي غيره من السموات فيها كانت حركة ما ذكرناه من هذه الأفلاك الموجودة الأربعة التي كملت فيها الطبيعة وظهر سلطانها حسا بعد ما كان معقولا فإن المعاني هي أصل الأشياء فهي في أنفسها معان معقولة غيبية ثم تظهر في حضرة الحس محسوسة وفي حضرة الخيال متخيلة وهي هي إلا أنها تنقلب في كل حضرة بحسبها كالحرباء تقبل الألوان التي تكون عليها فأول ما أوجد الأرض وهي نهاية الخلأ وهو أقصى الكثائف والظلم وهو نازل إلى الآن دائما والخلأ لا نهاية له فإنه امتداد متوهم لا في جسم فالعالم كله بأسره نازل أبدا في طلب المركز وهذا الطلب طلب معرفة ومركزه هو الذي يستقر عليه أمره فلا يكون له بعد ذلك طلب وهذا غير كائن فنزوله للطلب دائم مستمر وهو المعبر عنه بطلب الحق فالحق هو مطلوبه وأثر فيه هذا الطلب التجلي الذي حصل له تعشق به فهو يطلبه بحركة عشقية وهكذا سائر المتحركات إنما حركتها المحبة والعشق لا يصح إلا هذا ومن لا يعشق ذلك التجلي وهو المنعوت بالجمال والجمال معشوق لذاته ولو لا ما تجلى سبحانه في صورة الجمال لما ظهر العالم فكان خروج العالم إلى الوجود بذلك العشق صل حركته عشقية واستمر الحال فحركة العالم دائمة لا نهاية لها ولو كان ثم أمر ينتهي إليه يسمى المركز يكون إليه النهاية لسكن العالم بعضه على بعض بالضرورة وبطلت الحركة فبطل الإمداد فادى ذلك إلى فناء العالم وذهاب عينه والأمر على خلاف هذا وإنما الناس وأكثر الخلق لا يشعرون بحركة العالم ولأنه بكله متحرك فيبقى الترتيب المشهود من البعد والقرب على حاله فلهذا الشهود يتخيلون سكون الأرض حول المركز ثم أوجد ركن الماء وهو كان الموجود الأول من الأركان وإنما ذكرنا الأرض مقدمة من أجل السفل والماء كان أول العناصر فما كثف منه كان أرضا وما سخف منه كان هواء ثم ما سخف منه كان نارا وهو كرة الأثير فأصل العناصر عندنا الماء ووافقنا على ذلك بعض الناس من النظار في هذا الفن لكن مستندنا الكشف فيما ندعيه من هذا وغيره من العلوم وقد تكون تلك العلوم مما تدرك بالنظر الفكري فمن أصاب في نظره وافق أهل الكشف ومن أخطأ في نظره خالف أهل الكشف والحكماء في هذه المسألة على ستة مذاهب خمسة منها خطأ والواحد منها صواب وهو الذي وافق الكشف والتعريف الإلهي لأهل خطابه من ملك ونبي وولي وكان وجود هذه العناصر ببرج السرطان وما من برج إلا وقد جعل له الله مدة في الولاية معلومة مع المشاركة لغيره في مدته فلجميعها مدة معلومة عندنا نسميها أعني الجملة عمر العالم فإذا انتهت المدد عاد الأمر ابتداء على حاله من الدوام فلا عدم يلحقه أبدا من حيث جوهره ولا يبقى صورة أبدا زمانين فالخلق لا يزال والأعيان قابلة للخلع عنها وعليها فالعالم في كل نفس من حيث الصورة في خلق جديد لا\n\n\nتكرار فيه فلو شاهدته لرأيت أمرا عظيما يهولك منظره ويورثك خوفا على جوهر ذاتك ولو لا ما يؤيد الله أهل الكشف بالعلم لتاهوا خوفا فلما حصلت العناصر وهي الأركان الأربعة محلا مهيئا أنوثيا لقبول التناسل والولادة وظهرت الاحتراقات من عنصر النار في رطوبات الهواء والماء صعد منها دخان يطلب الأعظم الذي هو الفلك الأعلى الأقصى فوجد فلك الكواكب يمنعه من الرقي إلى الفلك الأعلى فعاد ذلك الدخان يتموج بعضه في بعض متراكم فريق‏\nففتق الله رتقه بسبع سماوات ثم إنه تتطايرت الشرر من كرة الأثير في ذلك الدخان فقبلت من السموات ومن الفلك المكوكب أماكن فيها رطوبات طبيعية فتعلقت بها تلك الشرر فانقدت تلك الأماكن لما فيها من الرطوبات فحدثت الكواكب فأضاء الجو كما يضي‏ء البيت بالسراج أ لا ترى القادح للزناد يعلق الشرر الحراق بما فيه من الرطوبة فيتقد فيكون منه المصباح ولهذا قال تعالى وجعلنا الشمس سراجا يضي‏ء به العالم وتبصر به الأشياء التي كان يسترها الظلام فحدث الليل والنهار بحدوث كوكب الشمس والأرض فالليل ظلمة الأرض الحجابية عن انبساط نور الشمس والكواكب عندنا كلها مستنيرة لا تستمد من الشمس كما يراه بعضهم والقمر على أصله لا نور له البتة قد محا الله نوره وذلك النور الذي ينسب إليه هو ما يتعلق به البصر من الشمس في مرآة القمر على حسب مواجهة الأبصار منه فالقمر مجلى الشمس وليس فيه من نور الشمس لا قليل ولا كثير ثم إن الله رتب في كل فلك وسماء عالما من جنس طبيعة ذلك الفلك سماهم ملائكة على مقامات فطرهم الله عليها من التسبيح والتهليل وكل ثناء على الله تعالى وجعل منهم ملائكة مسخرين لمصالح ما يخلقه في عالم العناصر من المولدات وهي ثلاثة عوالم طبيعية ويسرى في كل عالم مولد من هذه الثلاثة من النفس الكلية صاحبة الآلات أرواح هي نفوس هذه المولدات بها تعلم خالقها ومنشئها وبها سرت الحياة فيها كلها وبها خاطبها الحق وكلفها وهو رسول الحق إليها وداع كل شخص منه إلى ربه فما بطنت حياته سمي جمادا ونباتا وانفصل هذان المولدان وتميزا بالنمو والغذاء فقيل في النامي منه نبات وفي غير النامي جماد وما ظهرت حياته وحسه سمي حيوانا والكل قد عمته الحياة فنطق بالثناء على خالقه من حيث لا نسمع وعلمهم الله الأمور بالفطرة من حيث لا نعلم فلم يبق رطب ولا يابس ولا حار ولا بارد ولا جماد ولا نبات ولا حيوان إلا وهو مسبح لله تعالى بلسان خاص بذلك الجنس وخلق الجان من لهب النار والإنسان مما قيل لنا ونفخ الأرواح في الكل وقدر الأقوات التي هي الأغذية لهذه المولدات من الإنس والجن والحيوان البحري والبري والهوائي وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها بما أودع الله في حركات هذه الكواكب واقتراناتها وهبوطها وصعودها في بيوت نحوسها وسعودها وعن حركاتها وحركات ما فوقها من الأفلاك حدثت المولدات وعن حركات الأفلاك الأربعة حدثت الأركان وهذا خلاف ما ذهب إليه غير أهل الكشف من المتكلمين في هذا الشأن فأودع الله في خزائن هذه الكواكب التي في الأفلاك علوم ما يكون من الآثار في العالم العنصري من التقليب والتغيير فهي أسرار إلهية قد جعل الله لها أهلا يعرفون ذلك ولكن لا على العلم بل على التقريب والأمر في نفسه صحيح غير إن الناظر من أهل هذا الشأن قد لا يستوفي النظر حقه لأمر فإنه من غفلة أو غلط في عدد ومقدار لم يشعر بذلك فيحكم فيخطئ فوقع الخطاء من نظره لا من نفس الأمر وقد يوافق النظر العلم فيقع ما يقوله ولكن ما هو على بصيرة فيه من حيث تعيين مسألة بعينها وهذا العلم لا تفي الأعمار بإدراكه فيعلم أصله من النبوات فكان أول من شرع في تعليم الناس هذا العلم إدريس عليه السلام عن الله فأعلمه ما أوحى في كل سماء وما جعل في حركة كل كوكب وبين له اقترانات الكواكب ومقادير الاقترانات وما يحدث عنها من الأمور المختلفة بحسب الأقاليم وأمزجة القوابل ومساقط نطفه في أشخاص الحيوان فيكون القرآن واحدا ويكون أثره في العالم العنصري مختلفا بحسب الإقليم وما يعطيه طبيعته فشروطه كثيرة يعلمها أهل ذلك الشأن فلما أعطتهم الأنبياء الموازين وعلمتهم المقادير علموا ما يحدث الله من الأمور والشئون في الزمان البعيد وعن الزمان البعيد الذي لو وكلهم الله فيه إلى نفوسهم بالحكم المعتاد حتى يتكرر ذلك عليهم تكرار يوجب القطع عادة ورب أمر لا يظهر تكراره الذي يوجب القطع الظني به إلا بعد آلاف من السنين فهذا كان سبب التعريف الإلهي على السنة الأنبياء عليهم السلام فأعلمت الناس بما أوحى الله إليها ما أمن الله عليها هذه الكواكب المسخرة من الحوادث ولو عرف الجهال‏\n\n\nالمنكرون هذا العلم قوله تعالى والنُّجُومَ مُسَخَّراتٍ بِأَمْرِهِ لما قالوا شيئا مما قالوه فما علموا تسخيرها وإنها كما قال تعالى ورَفَعْنا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضاً سُخْرِيًّا كما سخر الرياح والبحار والفلك هكذا سخر الكواكب وهل في هذه المسخرات من الكواكب والأفلاك والرياح والبحار والدواب وكل مسخر عالم بما هو له مسخر أم لا هذا لا يعرفه‏\nإلا أهل طريقنا خاصة حكى القشيري أن رجلا رأى شخصا راكبا على حمار وهو يضرب رأس الحمار فنهاه عن ذلك فقال له الحمار دعه فإنه على رأسه يضرب فمن عرف الجزاء كيف لا يعرف ما سخر له وقد رأينا من مثل هذا كثيرا من الجمادات والحيوانات وقد طال الكلام وهذا القدر كاف في معرفة ترتيب العالم الذي هو أحد أقسام ما يحتوي عليه هذا المنزل من العلوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Ninety-Five: Concerning the Knowledge of the Station of the Honored Numbers from the Muhammadan Presence (الحضرة المحمدية)\n\nRivers burst forth from the essence of stones,\nAnd plunged into my earth, into the treasuries of my secrets.\n\nA tenth of the Divinely Imparted Knowledge (العلم اللدني) is manifest,\nAnd what I have concealed of it is nine-tenths.\n\nMy soul demands of me the duality of its existence,\nWhile the Single (وتر) demands me, and the afflicted one seeks the Singles (أوتار).\n\nSo I fortified my soul within the city of a Master,\nWhich he built from compounded water and fire.\n\nNo fortress like it has been seen in its height,\nI fortified myself within it behind seven walls.\n\nIts station lies between abasement and might,\nWherein He deals with me according to the limit of my measure.\n\nUntil the blowing into the trumpet of its sensation occurs,\nInto the forms of imagination (تخييل) within the Isthmus (برزخ) of my others.\n\nAnd the permanence of the matter remains therein, eternal,\nUntil the Resurrection from the grave of my thoughts takes place.\n\nThen I witness Him through knowledge (علما), direct vision (عينا), and spiritual state (حالة),\nIn the witnessing of lights and the witnessing of my secrets.\n\nThose manifestations (مظاهر) are diversified with us,\nThrough the vision of thoughts and the vision of sights.\n\n### [The Science of Flashes (علم اللوائح): A Wondrous Station that Does Not Accept Negligence or Forgetfulness]\n\nThe index of sciences contained within this station includes the Science of Flashes (علم اللوائح), which are the preliminaries of spiritual taste (الذوق). It is a wondrous station that does not accept negligence or forgetfulness. It contains the science of the entry of femininity into number, which is masculine. It contains the science of Manichaeism (المانية): from where they erred, and what aspect of the Truth (الحق) they possessed that led them to this belief, and whether they have an acceptable excuse for it on the Day of Resurrection or not. It contains the science of entry, which is the seeking of the Singles (الأوتار), why they are sought, and to whom their merit returns. It includes whether the one compelled to kill himself is satisfied with that or not, and the wisdom of granting that authority to the saint (ولي). And whether, if the saint pardons the blood, the right of the slain person falls on the Day of Resurrection, or if it is like the transfer of debt (الحوالة في الدين): if the creditor accepts it, he has no recourse against the original debtor if the transferee becomes insolvent after the creditor’s acceptance of the transfer. It contains the science of the settling of the Unseen (الغيب) so that it is not witnessed, and why it settles. It contains the science of the Unseen that must be witnessed, and the seeking of it from Allah. It contains the science of the Intellect (العقل) and the rank of its possessor. It contains the science of contemplation (الاعتبار). It contains the science of transition between spiritual states (الأحوال) and stations (المقامات). It contains the science of qualities (الكيفيات) and quantities (الكميات). It contains the science of transcendence (التعالي) and why it leads to what it does, and that it is specific to the dull-witted (أهل البلادة) rather than the intelligent (الأذكياء). It contains the science of soundness and corruption (الصلاح والفساد). It contains the science of what results from actions, whether the obligation (التكليف) occurred or not. It contains the source from which the astrologers (أهل النجوم) derived their science—those who rule by the stars and are aware of the judgments Allah has deposited within them—from the Divine Sciences (العلوم الإلهية), and its honor over all other sciences. It mentions the animal which, if its upper part is eaten, grants the eater, by its specific property, the science of the stars; if its middle part is eaten, it grants the science of plants; and if its lower part (the part near its tail) is eaten, it grants the science of hidden waters in the earth, so that if one comes to a land without water, he knows how many cubits deep the water lies. This animal is a serpent, neither large nor small, found only in the environs of Silves (شلب) in Western Andalusia. Abdullah ibn Abdun, the scribe of the Commander of the Muslims, encountered one there and cut off its head and tail with a two-pronged knife in a single strike, dividing it into three pieces. They were three brothers. Abdullah ate the upper part, and he became a sign (آية) in the science of judicial astrology without studying a book or being taught by a master. His brother, Abdul Majid, ate the middle part, and he became a sign in the science of plants, their properties, and their compounds, without studying a book or being taught. His son, Al-Manjaniqi, informed me of this in Konya. The third brother ate the last piece, near the tail, and he became a sign in extracting water from the depths of the earth. Glory be to Him who deposited His secrets in His creation. It contains the science of the difference in the breaking of norms (خرق العوائد) between Divine Favor (الكرامة) and Gradual Enticement (الاستدراج). It contains the science of the reason that necessitates the human animal loving something other than Allah. The cause of love is two things: relation (النسبة) and beneficence (الإحسان). The relation to Allah is closer, for man is created upon the Divine Form (الصورة), and beneficence comes from Allah, for He is the Benefactor who brought his essence (عين) into existence, and then everything he possesses. So how can he love anything other than Him and become annihilated (يفنى) in it? And it contains the science of the Hereafter (الآخرة) and what relates to it, from the moment people stand upon the Bridge (الجسر) below the darkness until they enter their dwellings of misery or felicity. This is the totality of the sciences contained within this station. I have alerted you to them so that your aspiration may rise to seek them. Let us mention one issue or more, according to what the discourse allows, with brevity, avoiding prolixity and excess. So I say, and Allah speaks the Truth (الحق) and guides the way.\n\n### [The Creation of the Overwhelmed Angelic Spirits (الأرواح الملكية المهيمة) and the Cherubim (الكروبيون)]\n\nKnow that when Allah created the Overwhelmed Angelic Spirits (الأرواح الملكية المهيمة)—who have no knowledge of anything other than Allah, not knowing that Allah created anything besides them—they are the Cherubim (الكروبيون), the Near Ones, the secluded, the isolated, taken away from themselves by the Majesty (جلال) of the Real (الحق) that He witnessed them. From among them, He singled out the one named the First Intellect (العقل الأول). The Solitaries (الأفراد) among us are upon their station; thus, the Majesty of Allah in the hearts of the Solitaries is like that, so they witness nothing but the Real (الحق). They are outside the rule of the Pole (القطب), who is the Imam, though he is one of them. However, his substance comes from the First Intellect, which is the first existent being of the World of Recording and Writing (عالم التدوين والتسطير), and it is the Creative Existence (الوجود الإبداعي).\n\nThen, following this, without temporal distance, an existent being emanated from this Intellect—an emanative existent—which is the Soul (النفس). This is the Preserved Tablet (اللوح المحفوظ) upon which everything that will exist in this abode until the Day of Resurrection is inscribed. This is Allah’s Knowledge (علم) in His creation. It is inferior to the Pen (القلم), which is the Intellect, in luminosity and radiant rank. It is like a green emerald due to the emanation of the Hylé Substance (الجوهر الهبائي) that is potentially within this Soul.\n\nFrom the Soul, the Hylé Substance (الجوهر الهبائي) emanated, which is a dark substance containing no light. Allah placed the rank of Nature (الطبيعة) between the Soul and the Hylé, a rank that is intelligible, not existent. Then, by what Allah granted in the establishment of causes and judgments, and what He ordered in the world concerning the existence of lights and darknesses, according to what the manifest and the hidden require—just as He made the beginning of things and the end of their measures (مقادير) subject to a known term (أجل معلوم), and that is without end. Thus, there are only perpetual beginnings and endings, derived from His Names, the First (الأول) and the Last (الآخر). From those two Realities (الحقيقتين) came the perpetual beginning and end. The cosmos (الكون) is perpetually new; thus, eternal subsistence (البقاء السرمدي) is in the formation (التكوين).\n\nHe granted this Soul, as we mentioned, an operative power. Through that power, Allah Almighty, by a type of Theophany (تجلي), brought the Total Body (الجسم الكل) into existence as a form within the Hylé Substance. No existent being created by Allah through a cause comes into being except through a specific Divine Theophany (تجلي إلهي) for that existent, which the cause does not know. This existent being is formed by that Divine Theophany and the Lordly Attention (التوجه الرباني) at the moment the cause attends, not *by* the cause. Were it not for that, that existent would not be. This is His saying, exalted is He: *and He breathed into him*. The cause had nothing but the breathing, so it became a bird by Allah’s permission. The bird only came into being due to the attention of Allah’s command upon it to *Be!* (كُنْ), by the command appropriate to His Majesty.\n\nWhen He brought this First Body into existence, shape became necessary for it, since shapes are necessary concomitants of bodies. The first shape to appear in the body was the circular shape (الشكل المستدير), which is the best of shapes. It is to shapes as the letter *alif* is to letters: it encompasses all shapes, just as the letter *alif* encompasses all letters by passing air from the chest over the points of articulation until it passes the lips. It manifests the essences of the letters in the points of articulation. If it stops in the chest, the letters *hā’* and *hamza* appear in their essences from the letter *alif*. If it moves from the chest to the throat and stops at specific ranks in the throat, that stopping manifests the existence of the unpointed *ḥā’*, then the unpointed *‘ayn*, then the dotted *khā’*, then the dotted *ghayn*, then the constricted *qāf* (قاف معقودة), and then the *kāf*. As for the *qāf* that is not constricted (غير معقودة), it is a letter between two letters, between the *kāf* and the constricted *qāf*; it is neither a pure *kāf* nor a pure *qāf*. This is why the masters of language reject it. However, our masters in recitation (القراءة) do not constrict the *qāf*, claiming that they received it this way from their masters, who received it from their masters in performance, until it reached the Arabs who possessed that language—the Companions—from the Prophet, peace and blessings be upon him. All of this is performance. As for the Arabs we met who remained upon their unchanged language, such as the Banu Fahm, I saw them constricting the *qāf*. This is the case for all Arabs. I do not know how the omission of its constriction entered upon our companions in the lands of the Maghreb when reciting the Quran. The same applies to the rest of the letters until the last one, which is the *wāw*. There is absolutely no rank for a letter beyond the *wāw*.\n\nThere is no limit to the shapes in bodies that can be reached and stopped at, because shape is dependent on number, and number itself is infinite. Likewise, shapes are infinite. The first shape to appear after circularity was the triangle, and from the equilateral triangle, shapes proceed in solids infinitely. The best and most perfect of shapes is the hexagon. The wider and greater the body, the more shapes it accepts.\n\nThen Allah held the corporeal form (الصورة الجسمية) within the Hylé (الهباء) by what Nature (الطبيعة) granted it from its rank, which we placed between the Soul and the Hylé. Had its rank not been there, the body would not have appeared in this substance, nor would it have stability within it. Thus, Nature was to the Soul like the tool to the craftsman, with which he opens up industrial forms in materials.\n\nThe Total Body (الجسم الكل) appeared in this substance from the Soul by the instrument of heat. Life appeared in it through the companionship of heat and moisture. Its form was stabilized in the Hylé by coldness and dryness.\n\nHe made this spherical body (الجسم الكري) in the form of a couch (السرير) and created for it four bearers in actuality for the duration of the world, and four others potentially. He will gather these four and the other four on the Day of Resurrection, making the total eight. He named it the Throne (العرش) and made it the source of Mercy (الرحمة). He established Himself upon it by His Name, the All-Merciful (الرحمن). He made it encompassing all that it contains of the dominion (الملك), localized, accepting connection and separation, and it populated the spatial dimension (الأينية الظرفية المكانية). The rank above it, between it and the Cloud (العماء)—which has air above it and air below it—is for the Name the Lord (الرب). And Allah is the Comprehensive Name (الاسم الجامع), the Dominant (المهيمن) over all Divine Names (الأسماء الإلهية). Its attribute is Dominance (المهيمنية). The Word (الكلمة) was unified in the Throne. It is the first of the existents that the world of bodies accepted.\n\nThen He brought another body into existence within the substance of this Hylé. For the substance of this Hylé is what populated the Void (الخلأ). Everything that appeared of localized corporeal and bodily forms, this substance is the recipient of them. We say this so that it is not imagined that the Footstool (الكرسي) is a form within the Throne (العرش). That is not the case. Rather, it is another form in the Hylé, which accepted it just as it accepted the form of the Throne, on the same level, but with different proportions.\n\nHe named this other existent the Footstool (الكرسي) and let down the two Feet (القدمين) to it from the Throne. Mercy split open like the splitting of a seed, and Mercy diversified in attribute into absolute (إطلاق) and restricted (تقييد). The restricted Mercy appeared, which is one Foot, and the absolute Mercy was distinguished by the appearance of the other Foot.\n\nIn this Foot appeared the division of the single Throne-Word (الكلمة الواحدة العرشية)—which had not shown division in the Throne—into report (خبر) and judgment (حكم). The judgment divided into command (أمر) and prohibition (نهي). The command divided into obligation (وجوب), recommendation (ندب), and permissibility (إباحة). The prohibition divided into prohibition (حظر) and dislike (كراهة). The report divided into these sections plus additions: interrogation, confirmation, supplication, denial, narration, and teaching. Thus, the tongues diversified, and the melodies (الملاحن) appeared in the Footstool. The detailed articulation of the notes (النغمات) that were summarized in the Throne appeared. It is the first ecstasy (طرب) that appeared in the world of bodies from audition (السماع). From there, it flowed into the world of the spheres (الأفلاك), the heavens (السموات), the pillars (الأركان), and the generated beings (المولدات).\n\nThen the Real (الحق) also brought into existence another spherical body, inferior to the Footstool in rank, and made it a spherical, non-stellar sphere (فلكيا غير مكوكب). In it, He decreed twelve specific measures (مقادير معينة), each named differently from the others. These are known as the Zodiacal Signs (البروج). He manifested the authority of Nature (الطبيعة) from them. He made three of them from the combination of heat and dryness, and their judgments are different, even though they are of a single nature. However, because the specific location (المكان المعين) in this sphere differed, their judgments differed from that perspective. And because they are of a single nature (heat and dryness), their judgments agreed. Thus, they operate by agreement from one perspective and by difference from another. This is why generation and corruption (الكون والفساد), change, and transformations appeared from them. I do not mean by corruption (الفساد) the evils commonly understood by us here, but rather the disappearance of a specific order, where it is said that order is corrupted (فسد), meaning it has ceased—just as when you eat an apple or cut it into pieces with a knife, its order is corrupted, and that form vanishes with the appearance of another form within it.\n\nFrom this sphere, everything in Paradise (الجنة) is formed, and from it comes the desire (الشهوة) for its inhabitants. It is the Throne of Formation (عرش التكوين).\n\nThen Allah Almighty created within the interior of this Atlas Sphere (الفلك الأطلس)—which is the locus for these natures that are the instruments of the Operative Soul (النفس العملية)—another sphere in the substance of the Hylé, as we mentioned, and by Divine Theophany, as we mentioned, since formation (التكوين) is only by Allah Almighty. This sphere is the Sphere of the Fixed Stars (فلك الكواكب الثابتة) and the Mansions (المنازل) by which the division of the decreed Zodiacal Signs in the Atlas Sphere is measured, since the Atlas Sphere has similar parts.\n\nThese are twenty-eight Mansions (منزلة): Al-Nath, Al-Butayn, Al-Thurayya, Al-Dabaran, Al-Han’a, Al-Haq’a, Al-Dhirā‘, Al-Nathra, Al-Ṭarf, Al-Jabhah, Al-Zubra, Al-Ṣarfa, Al-‘Awwā’, Al-Simāk, Al-Ghafr, Al-Zubānā, Al-Iklīl, Al-Qalb, Al-Shawla, Al-Na‘ā’im, Al-Balda, Sa‘d al-Dhābiḥ, Sa‘d Bul‘, Sa‘d al-Su‘ūd, Sa‘d al-Akhbiya, Al-Far‘ al-Muqaddam, Al-Far‘ al-Mu’akhkhar, and Al-Risā’. These are twenty-eight known, named Mansions, whose judgments are governed by the natures of the Zodiacal Signs: Aries, Taurus, Gemini, Cancer, Leo, Virgo, Libra, Scorpio, Sagittarius, Capricorn, Aquarius, and Pisces.\n\nThis stellar sphere (الفلك المكوكب)—meaning the Sphere of the Mansions—has sections within the Atlas Sphere (the Sphere of the Zodiacal Signs). He made for every measure in the Zodiacal Sphere two and one-third Mansions of the aforementioned Mansions. Its Mansions and all its stars have a slow movement in their spheres, which the sight does not perceive except after thousands of years, as mentioned regarding the pyramids of Egypt, which were built when the Vulture (النسر) was in Leo, and today it is in Capricorn, and we are in the year 634 AH.\n\nThen, upon the surface of this stellar sphere, He created Paradise (الجنة) with everything in it, under the rising sign of Leo, which is a fixed sign. This is why it has permanence. The practitioners of this art have named these signs with the names we mentioned and described them with characteristics according to what Allah revealed to them concerning their wondrous effects in their movements. From this, they knew the fixed, the mutable, the double-bodied, and so on.\n\nThe knowledge of the observers (أهل الإرصاد) ends at the Atlas Sphere. In reality, it only ends at the star, for the movements of the stars and the stars themselves define their spheres. Were it not for that, their number would not be known. As for the Atlas Sphere, they did not deduce it by perceiving it sensually, as they perceived the spheres of the stars. Rather, they knew that these spheres must intersect with an existent, spherical entity like themselves, so they established it intellectually, not sensually, and named it Atlas because it has no star to define it sensually.\n\nThis proof is invalidated for them by the movement of the outermost sphere, for its movement exists, yet it does not intersect with anything at all, according to them. How do you know, O observer, perhaps this stellar sphere intersects with nothingness? The philosophers (الحكماء) did not deny that there might be other spheres above the Atlas Sphere, except that the observer has not reached them because there is nothing to indicate them. Rather, they are considered possible (في حكم الجواز) by them. But they said that if there is a sphere there, it must have a soul and an intellect, and yet there must be an end.\n\nIt is from this sphere that the disagreement arose between us and the philosophers (الحكماء) regarding the order of formation (ترتيب التكوين). They did not dispute what is above the Atlas, which is the Footstool and the Throne, and they accepted the possibility of their existence.\n\nThe order of the matter, according to us, after the stellar sphere—which was not stellar when created, but the stars appeared in it and in the other heavens afterward—is that the movement of the four existing spheres we mentioned, in which Nature was perfected and its authority appeared sensually after being intelligible, occurred. For meanings (المعاني) are the origin of things; in themselves, they are intelligible, unseen meanings, then they appear in the presence of sensation (حضرة الحس) as sensible things, and in the presence of imagination (حضرة الخيال) as imagined things. They are the same, but they transform in each presence according to its nature, like the chameleon accepting the colors it rests upon.\n\nThe first thing He brought into existence was the Earth (الأرض), which is the end of the Void (الخلأ) and the furthest extent of density and darkness. It is perpetually descending until now, and the Void has no end, for it is an imagined extension, not in a body. The entire cosmos (العالم كله) is perpetually descending in search of the Center (المركز). This search is a search for gnosis (معرفة), and its Center is that upon which its affair settles, so that it no longer has any search after that. This is not possible. Its descent for the search is perpetual and continuous, and this is expressed as the seeking of the Real (طلب الحق). The Real is its object of desire, and the Theophany (التجلي) that occurred in it affected it, so it seeks Him with a movement of love (حركة عشقية). Likewise, all moving things, their movement is only due to love and passion (‘ishq). Nothing else is correct. And whoever does not love that Theophany, which is described as Beauty (الجمال)—and Beauty is loved for its own sake—were it not for the fact that He disclosed Himself (تجلى سبحانه) in the form of Beauty, the world would not have appeared. Thus, the world’s emergence into existence was by that love, and the root of its movement is love, and the state continued. The movement of the world is perpetual and endless. If there were an end point called the Center, to which the end would lead, the world would necessarily settle upon itself, and movement would cease, and thus sustenance (الإمداد) would cease, leading to the annihilation (فناء) of the world and the disappearance of its essence (عين). The matter is contrary to this.\n\nHowever, people and most of creation do not perceive the movement of the world because it is moving in its entirety, so the witnessed arrangement of distance and proximity remains as it is. Because of this witnessing, they imagine the Earth’s stillness around the Center.\n\nThen He brought into existence the pillar of Water (ركن الماء), which was the first existent of the pillars (الأركان). We only mentioned the Earth first because of its lowness. Water was the first of the elements. What condensed from it became Earth, and what rarefied from it became Air, and then what rarefied from that became Fire, which is the sphere of the Aether (كرة الأثير). Thus, the origin of the elements, according to us, is Water. Some speculative thinkers (النظار) in this art agreed with us on this, but our basis for what we claim, in this and other sciences, is Unveiling (الكشف). Those sciences may also be grasped by intellectual speculation. Whoever is correct in his speculation agrees with the People of Unveiling (أهل الكشف), and whoever errs in his speculation contradicts the People of Unveiling. The philosophers (الحكماء) hold six doctrines on this issue, five of which are wrong, and one is correct, which agrees with Unveiling and the Divine Definition (التعريف الإلهي) given to the recipients of His address, whether angel, prophet, or saint (ولي).\n\nThe existence of these elements occurred under the sign of Cancer (برج السرطان). Every sign has been given a known duration of authority by Allah, along with sharing its duration with others. All of them together have a known duration with us, which we call the lifespan of the world (عمر العالم). When the durations end, the matter returns to its beginning state of permanence. No non-existence (عدم) ever afflicts it in terms of its substance (جوهر), nor does a form remain for two moments. The creation (الخلق) is ceaseless, and the Immutable Essences (الأعيان) are receptive to forms being stripped from them and placed upon them. Thus, the world, in terms of form, is in a new creation (خلق جديد) at every breath, without repetition. If you were to witness this, you would see a tremendous matter whose sight would terrify you and cause you fear for the substance of your essence (ذاتك). Were it not for the fact that Allah supports the People of Unveiling with Knowledge (العلم), they would wander in fear.\n\nWhen the elements—the four pillars—were established as a prepared, feminine locus for accepting procreation and birth, and the combustions from the element of Fire appeared in the moistures of Air and Water, smoke ascended from them, seeking the Greatest (الأعظم), which is the highest, outermost sphere. It found the Sphere of the Stars preventing it from ascending to the Highest Sphere. That smoke returned, surging within itself, accumulating layer upon layer.\n\nAllah split its compactness into seven heavens (سبع سماوات). Then sparks flew from the Sphere of the Aether (كرة الأثير) into that smoke. They were accepted by the heavens and the stellar sphere in places that contained natural moistures. Those sparks clung to them, and those places ignited due to the moistures within them, and the stars came into being. The atmosphere was illuminated, just as a house is illuminated by a lamp. Do you not see that the striker of the flint causes the burning spark to cling to the moisture within it, so it ignites, and the lamp is formed? For this reason, He, exalted is He, said: <<وَجَعَلْنَا الشَّمْسَ سِرَاجًا>> (And We made the sun a lamp), by which the world is illuminated and by which things hidden by darkness are seen. Night and day occurred with the existence of the Sun star and the Earth. Night is the darkness of the Earth, acting as a veil against the spread of the light of the Sun.\n\nThe stars, according to us, are all self-luminous (مستنيرة) and do not derive light from the Sun, as some believe. The Moon, in its origin, has absolutely no light; Allah has erased its light. That light attributed to it is what the sight perceives from the Sun reflected in the mirror of the Moon, according to the facing of the eyes toward it. Thus, the Moon is a manifestation (مجلى) of the Sun, and it contains neither little nor much of the Sun’s light.\n\nThen Allah arranged in every sphere and heaven a world (عالم) of the nature of that sphere, naming them angels (ملائكة) upon the stations He created them for, consisting of glorification (تسبيح), declaration of oneness (تهليل), and all praise of Allah Almighty. He made some of them angels subservient (مسخرين) to the interests of what He creates in the world of the elements, namely the generated beings (المولدات), which are three natural worlds.\n\nIn each of these three generated worlds, spirits flow from the Universal Soul (النفس الكلية), the possessor of the instruments. These spirits are the souls (نفوس) of these generated beings. By them, they know their Creator and Originator, and by them, life flowed into all of them, and by them, the Real addressed them and obligated them. He is the Messenger of the Real to them, calling every individual among them to his Lord.\n\nWhat concealed its life is called inanimate (جماد) and plant (نبات). These two generated beings separated and were distinguished by growth and nourishment. The growing one was called plant, and the non-growing one was called inanimate. What manifested its life and sensation is called animal (حيوان). All of them are encompassed by life, and they speak with the praise of their Creator in a way we do not hear. Allah taught them things by instinct (بالفطرة) in a way we do not know.\n\nThus, there remains nothing wet or dry, hot or cold, inanimate, plant, or animal, but that it glorifies Allah Almighty with a tongue specific to that genus.\n\nHe created the Jinn from the flame of fire and Man from what was told to us. He breathed the spirits (الأرواح) into all of them and decreed the provisions (الأقوات)—which are the nourishments—for these generated beings: humans, jinn, and marine, terrestrial, and aerial animals.\n\n<<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command) through what Allah deposited in the movements of these stars, their conjunctions, their descents, and their ascents in the houses of their misfortunes and fortunes. From their movements and the movements of the spheres above them, the generated beings came into existence. From the movements of the four spheres, the pillars (الأركان) came into existence. This contradicts what non-People of Unveiling among the theologians (المتكلمين) have concluded regarding this matter.\n\nAllah deposited in the treasuries of these stars in the spheres the sciences of the effects that occur in the elemental world, such as transformation and change. These are Divine Secrets (أسرار إلهية) for which Allah has appointed people who know them, but not with certainty (على العلم), only by approximation. The matter itself is correct, except that the observer among the practitioners of this art may not fulfill the right of observation due to some matter—such as negligence or an error in number or measure that he does not perceive—so he makes a judgment and errs. Thus, the error comes from his observation, not from the matter itself. Sometimes the observation agrees with the Knowledge (العلم), and what he says occurs, but he is not upon insight regarding the designation of a specific issue.\n\nThis science is one that lifetimes are insufficient to grasp. Its origin is known from the Prophecies (النبوات). The first to begin teaching this science to people was Idris, peace be upon him, from Allah. He informed him of what He revealed in every heaven and what He placed in the movement of every star. He explained to him the conjunctions of the stars and the measures of the conjunctions, and what events arise from them, varying according to the regions (الأقاليم), the temperaments of the recipients (القوابل), and the places where their drops fall in animal individuals. Thus, the Quran (the decree/conjunction) is one, but its effect in the elemental world differs according to the region and what its nature grants. Its conditions are numerous, known to the practitioners of that art.\n\nWhen the prophets gave them the balances (الموازين) and taught them the measures (المقادير), they knew what Allah brings forth of matters and affairs in the distant future. This was necessary because if Allah had left them to their own souls to judge by habitual observation until repetition occurred frequently enough to necessitate customary certainty, some matters would not show the repetition that necessitates presumptive certainty except after thousands of years. This was the reason for the Divine Definition (التعريف الإلهي) through the tongues of the prophets, peace be upon them. They informed people of what Allah revealed to them, what Allah entrusted to these subservient stars (الكواكب المسخرة) concerning events.\n\nIf the ignorant deniers of this science knew His saying, exalted is He: <<وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ>> (And the stars are subservient by His command), they would not have said anything they said. They did not know their subservience, and that they are as He, exalted is He, said: <<وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضاً سُخْرِيّاً>> (And We raised some of them above others in degrees, so that some may take others into service). Just as He made the winds, the seas, and the ships subservient, so too did He make the stars subservient.\n\nDo these subservient things—the stars, the spheres, the winds, the seas, the beasts, and everything subservient—know what they are subservient to or not? This is known only by the People of our Path (أهل طريقنا) specifically.\n\nAl-Qushayri narrated that a man saw someone riding a donkey and hitting the donkey’s head. He forbade him from doing so, but the donkey said to him, \"Leave him, for he is hitting his own head.\" Whoever knows the recompense, how can he not know what he is subservient to? We have seen much of this from inanimate objects and animals.\n\nThe discourse has become lengthy, but this much is sufficient for the knowledge of the arrangement of the cosmos (ترتيب العالم), which is one of the sections of the sciences contained within this station. And Allah speaks the Truth (الحق) and guides the way.",
    "ur": "(باب نمبر دو سو پچانوے: حضرت محمدیہ (الحضرة المحمدية) سے مشرف اعداد کی منزل کی معرفت میں)\n\nپتھروں کی ذات سے نہریں پھوٹ پڑیں،\nاور میری زمین میں میرے رازوں کے خزانوں میں غوطہ زن ہو گئیں۔\n\nپس علم لدنی کا دسواں حصہ ظاہر ہے،\nاور جو میں نے چھپایا وہ نو دسواں حصہ ہے۔\n\nمیرا نفس مجھ سے اپنے وجود کے جوڑے کا مطالبہ کرتا ہے،\nاور مجھے طاق (وتر) طلب کرتا ہے، اور مصیبت طاقوں کے ذریعے آتی ہے۔\n\nپس میں نے اپنے نفس کو ایک سردار کے شہر میں محفوظ کر لیا،\nجسے اس نے مرکب پانی اور آگ سے بنایا۔\n\nاس کی بلندی میں اس جیسا کوئی قلعہ نہیں دیکھا گیا،\nمیں نے اس میں سات دیواروں کے پیچھے پناہ لی۔\n\nاس کا مقام ذلت اور عزت کے درمیان ہے،\nوہ اس میں میرے ساتھ میری مقدار کے مطابق معاملہ کرتا ہے۔\n\nیہاں تک کہ اس کے حس کے صور میں پھونکا جائے گا،\nمیرے غیروں کے برزخ میں تخیل کی صورتوں تک۔\n\nاور اس میں امر کا دوام ہمیشہ باقی رہے گا،\nیہاں تک کہ میری افکار کی قبر سے بعث (اٹھنا) ہو گا۔\n\nپس میں اس کا مشاہدہ علم، عین اور حالت کے ذریعے کرتا ہوں،\nانوار کے مشہد اور اسرار کے مشہد کے ساتھ۔\n\nہمارے نزدیک یہ مظاہر متنوع ہیں،\nافکار کے دیکھنے اور آنکھوں کے دیکھنے کے ذریعے سے۔\n\n### [علم لوائح (اللوائح) اور یہ ایک عجیب منزل ہے جو غفلت اور نسیان کو قبول نہیں کرتی]\n\nفہرست ان علوم کی جو اس منزل میں شامل ہیں، اور وہ علم لوائح (اللوائح) ہے، جو ذوق کی تمہیدات ہیں، اور یہ ایک عجیب منزل ہے جو غفلت اور نسیان کو قبول نہیں کرتی۔ اس میں عدد میں تانیث کے داخل ہونے کا علم ہے، حالانکہ وہ مذکر ہے۔ اس میں مانیت (ثنویت کے قائل) کا علم ہے کہ وہ کہاں سے گمراہ ہوئے، اور ان کے پاس حق کا کون سا پہلو تھا جس نے انہیں اس اعتقاد کی طرف رہنمائی کی، اور کیا قیامت کے دن ان کے لیے کوئی قابل قبول عذر ہو گا یا نہیں؟ اس میں دخول کا علم ہے، جو طاق (اوتار) کا مطالبہ ہے، اور وہ کیوں طلب کیے جاتے ہیں، اور ان کی فضیلت کس کی طرف لوٹتی ہے؟ اور کیا وہ شخص جس پر قتل کا غصب کیا گیا ہو، وہ اس پر راضی ہو گا یا نہیں؟ اور یہ حکمت کی ولایت ہے کہ یہ ولی کے لیے کیوں مقرر کی گئی؟ اور کیا اگر ولی خون معاف کر دے تو مقتول کا حق قیامت کے دن ساقط ہو جائے گا، یا یہ دین میں حوالہ (حوالة) کی طرح ہے کہ اگر صاحب حق اسے قبول کر لے تو پہلے شخص پر اس کا رجوع باقی نہیں رہتا، اگر وہ شخص جس پر حوالہ کیا گیا ہے، صاحب دین کی رضامندی کے بعد تنگ دست ہو جائے؟ اس میں غیب کے قرار کا علم ہے، تاکہ اس کا شہود (الشہود) نہ ہو، اور وہ کیوں قرار پکڑتا ہے؟ اور اس میں اس غیب کا علم ہے جس کا شہود (الشہود) ضروری ہے، اور اس کے لیے اللہ سے اس کا طلب کرنا۔ اس میں عقل کا علم اور اس کے صاحب کا مرتبہ ہے۔ اس میں اعتبار کا علم ہے۔ اس میں احوال اور مقامات میں انتقال کا علم ہے۔ اس میں کیفیات اور کمیات کا علم ہے۔ اس میں تعلی (بلندی) کا علم ہے، اور وہ کیوں ادا ہوتی ہے، اور یہ صرف کند ذہن لوگوں کے لیے مخصوص ہے نہ کہ ذہین لوگوں کے لیے۔ اس میں صلاح اور فساد کا علم ہے۔ اس میں ان اعمال پر مرتب ہونے والے نتائج کا علم ہے، خواہ تکلیف واقع ہو یا نہ ہو۔ اس میں یہ علم ہے کہ نجوم کے ماہرین، جو ان کے ذریعے حکم لگاتے ہیں اور جو احکام اللہ نے ان میں ودیعت رکھے ہیں، انہوں نے اپنا علم الٰہی علوم سے کہاں سے حاصل کیا، اور اس کی فضیلت دیگر علوم پر بیان کی گئی ہے۔ اور اس میں اس حیوان کا ذکر ہے کہ اگر اس کا اوپری حصہ کھایا جائے تو وہ کھانے والے کو خاصیت کے طور پر علم نجوم عطا کرتا ہے، اور اگر اس کا درمیانی حصہ کھایا جائے تو علم نباتات عطا کرتا ہے، اور اگر اس کا نچلا حصہ، جو اس کی دم کے قریب ہے، کھایا جائے تو زمین میں پوشیدہ پانیوں کا علم عطا کرتا ہے، چنانچہ اگر وہ کسی ایسی زمین پر آئے جہاں پانی نہ ہو تو وہ جان لیتا ہے کہ پانی کتنے ہاتھ نیچے ہو گا۔ یہ حیوان ایک سانپ ہے جو نہ بڑا ہے نہ چھوٹا، اور یہ صرف اندلس کے مغرب میں شلب کے نواحی میں پایا جاتا ہے۔ ہمارے ہاں امیر المسلمین کے کاتب عبداللہ بن عبدون کا وہاں گزر ہوا، تو انہوں نے ایک ہی ضرب میں دو شاخہ چھری سے اس کا سر اور دم کاٹ دی اور اسے تین ٹکڑوں میں تقسیم کر دیا۔ وہ تین بھائی تھے، تو عبداللہ نے اس کا اوپری حصہ کھایا، چنانچہ وہ علم قضا بالنجوم میں ایک آیت (نشان) بن گئے، بغیر کسی کتاب کے مطالعہ یا کسی امام کی رہنمائی کے۔ اور ان کے بھائی عبدالمجید نے درمیانی حصہ کھایا، تو وہ علم نباتات، اس کی خواص اور اس کی ترکیبوں میں ایک آیت بن گئے، بغیر کسی کتاب کے مطالعہ یا رہنمائی کے۔ ان کے بیٹے المنجنیقی نے قونیہ میں مجھے یہ بات بتائی۔ اور تیسرے بھائی نے آخری ٹکڑا کھایا جو دم کے قریب تھا، تو وہ زمین کے اندر سے پانی نکالنے میں ایک آیت بن گئے، پس پاک ہے وہ ذات جس نے اپنی مخلوق میں اپنے اسرار ودیعت رکھے۔ اور اس میں کرامت اور استدراج کے درمیان خرق عادات میں فرق کا علم ہے۔ اور اس میں اس سبب کا علم ہے جس نے حیوانی انسانی عالم کو غیر اللہ سے محبت کرنے پر مجبور کیا، اور محبت کے دو سبب ہیں: نسبت اور احسان۔ اور نسبت اللہ سے زیادہ قریب ہے، کیونکہ وہ صورت پر پیدا کیا گیا ہے، اور احسان اللہ کی طرف سے ہے، وہی اسے اس کی عین (ذات) کے وجود سے نوازنے والا ہے، پھر ہر اس چیز سے جو اس میں ہے، تو وہ کسی اور سے کیسے محبت کر سکتا ہے اور اس میں فنا (الفناء) ہو سکتا ہے؟ اور اس میں آخرت کا علم ہے، اور اس سے متعلقہ امور، جب سے لوگ پل (صراط) پر ظلمت کے بغیر کھڑے ہوں گے، یہاں تک کہ وہ شقاوت یا سعادت کی اپنی منزلوں میں داخل ہو جائیں گے۔ یہ وہ تمام علوم ہیں جو اس منزل میں شامل ہیں، میں نے آپ کو ان سے آگاہ کر دیا ہے تاکہ آپ کی ہمت ان کے طلب کی طرف بلند ہو۔ اب ہم ان میں سے ایک یا زیادہ مسائل کا ذکر کریں گے، جتنا کہ اختصار کے ساتھ کلام میں گنجائش ہو، بغیر طوالت اور زیادتی کے۔ پس میں کہتا ہوں، اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے)۔\n\n### [ارواح ملکیہ مہیمہ اور کروبیون (الكروبيون) کی تخلیق]\n\nجان لو کہ جب اللہ نے ارواح ملکیہ مہیمہ کو پیدا کیا، اور وہ وہ ہیں جنہیں اللہ کے سوا کسی چیز کا علم نہیں، وہ نہیں جانتے کہ اللہ نے ان کے سوا کوئی چیز پیدا کی ہے، اور وہ کروبیون (الكروبيون) مقربین، معتکفین، مفردین ہیں، جو حق کے جلال کے مشاہدے میں اپنے آپ سے بے خبر ہیں۔ اللہ نے ان میں سے جسے عقل اول (العقل الأول) کہا جاتا ہے، اسے خاص کر لیا، اور ہم میں سے افراد ان کے مقام پر ہیں۔ پس افراد کے دلوں میں اللہ کا جلال اسی طرح ہے، چنانچہ وہ حق کے سوا کسی چیز کا شہود (الشہود) نہیں کرتے، اور وہ قطب کے حکم سے باہر ہیں جو امام ہے، اور وہ ان میں سے ایک ہے، لیکن اس کا مادہ عقل اول (العقل الأول) سے ہوتا ہے، جو عالم تدوین اور تسطیر میں پہلا موجود ہے، اور وہ ابداعی موجود ہے۔ پھر اس کے بعد، بغیر زمانی بعد کے، اس عقل سے ایک انبعاثی موجود ظاہر ہوا، اور وہ نفس (النفس) ہے، اور وہ لوح محفوظ ہے جس میں اس دنیا میں قیامت تک ہونے والی ہر چیز لکھی ہوئی ہے۔ اور یہ اللہ کا علم ہے اپنی مخلوق میں، اور یہ قلم (جو کہ عقل ہے) سے نوری اور ضیائی مرتبے میں کم ہے۔ پس یہ سبز زمرد کی طرح ہے، اس جوہر ہبائی (الجوهر الهبائي) کے انبعاث کی وجہ سے جو اس نفس کی قوت میں ہے۔ پھر نفس سے جوہر ہبائی (الجوهر الهبائي) ظاہر ہوا، اور وہ ایک تاریک جوہر ہے جس میں کوئی نور نہیں ہے۔ اور اللہ نے طبیعت کا مرتبہ نفس اور ہباء کے درمیان ایک معقول مرتبہ بنایا، نہ کہ موجود۔ پھر اللہ نے اسباب اور احکام کے وضع کرنے اور عالم میں انوار اور ظلمت کے وجود کو مرتب کرنے سے، جیسا کہ ظاہر اور باطن کا تقاضا ہے، جیسا کہ اس نے چیزوں میں ابتداء اور ان کی مقداروں میں انتہا کو ایک معلوم مدت کے ساتھ مقرر کیا، اور یہ لامتناہی تک ہے۔ پس وہاں صرف دائمی ابتداء اور انتہاء ہیں، جو اس کے ناموں الاول اور الآخر سے ہیں۔ پس ان دو حقیقتوں سے ابتداء اور انتہا ہمیشہ ہوتی رہی، چنانچہ کائنات ہمیشہ نئی ہے، پس تکوین میں بقائے سرمدی ہے۔ پس اس نفس کو، جیسا کہ ہم نے ذکر کیا، ایک عملی قوت عطا کی گئی، اس قوت سے اللہ سبحانہ نے ایک خاص ظہور الٰہی (التجلی) کے ذریعے جوہر ہبائی (الجوهر الهبائي) میں جسم کل کی صورت کو وجود بخشا۔ اور کوئی بھی موجود جسے اللہ نے کسی سبب کے ساتھ پیدا کیا، وہ اس موجود کے لیے ایک خاص ظہور الٰہی (التجلی) کے بغیر نہیں ہوتا، جسے سبب نہیں جانتا۔ پس یہ موجود اس ظہور الٰہی (التجلی) اور ربانی توجہ سے، سبب کی توجہ کے وقت، وجود میں آتا ہے، نہ کہ سبب سے۔ اگر ایسا نہ ہوتا تو وہ موجود نہ ہوتا۔ اور یہی اس کا قول ہے: **فَيَنفُخُ فِيهِ** (پس وہ اس میں پھونکتا ہے)۔ پس سبب کے لیے پھونکنے کے سوا کچھ نہ تھا، چنانچہ وہ اللہ کے حکم سے پرندہ بن جاتا ہے۔ پس پرندہ اللہ کے امر کی توجہ سے ہوا، اور وہ اس کا قول ہے: **كُن** (ہو جا) اس امر کے ساتھ جو اس کے جلال کے لائق ہے۔ جب اس نے اس پہلے جسم کو وجود بخشا تو شکل اس کے لیے لازم ہو گئی، کیونکہ اشکال اجسام کے لوازم میں سے ہیں۔ پس جسم میں سب سے پہلی شکل جو ظاہر ہوئی وہ گول شکل ہے، اور یہ بہترین اشکال ہے، اور یہ اشکال کے لیے الف کی طرح ہے حروف کے لیے، یہ تمام اشکال کو شامل ہے، جیسا کہ حرف الف تمام حروف کو شامل کرتا ہے، سینے سے اس کے مخارج پر ہوا کے گزرنے سے یہاں تک کہ وہ ہونٹوں سے گزر جائے۔ پس یہ مخارج میں حروف کی ذاتوں کو ظاہر کرتا ہے۔ جب یہ سینے میں رکتا ہے تو حرف ہاء اور ہمزہ اپنی عینوں میں حرف الف سے ظاہر ہوتے ہیں۔ جب یہ سینے سے حلق کی طرف منتقل ہوتا ہے اور حلق میں مخصوص مراتب پر رکتا ہے، تو اس رکنے میں حاء مہملہ، پھر عین مہملہ، پھر خاء معجمہ، پھر غین معجمہ، پھر قاف معقودہ، پھر کاف کا وجود ظاہر کرتا ہے۔ اور رہی وہ قاف جو معقودہ نہیں ہے، تو وہ دو حروف کے درمیان ہے، کاف اور قاف معقودہ کے درمیان، نہ وہ خالص کاف ہے اور نہ خالص قاف۔ اور اسی وجہ سے اہل لسان اس کا انکار کرتے ہیں۔ لیکن ہمارے شیوخ قراءت میں قاف کو معقود نہیں کرتے، اور ان کا خیال ہے کہ انہوں نے اپنے شیوخ سے اسی طرح لیا ہے، اور ان کے شیوخ نے اپنے شیوخ سے، ادا میں، یہاں تک کہ وہ اس لسان کے اہل عرب یعنی صحابہ تک پہنچے، نبی صلی اللہ علیہ وسلم تک، یہ سب ادا ہے۔ اور رہے وہ عرب جن سے ہم ملے جو اپنی زبان پر باقی رہے اور تبدیل نہیں ہوئے، جیسے بنی فہم، تو میں نے انہیں قاف کو معقود کرتے ہوئے دیکھا۔ اور تمام عرب اسی طرح ہیں۔ پس میں نہیں جانتا کہ ہمارے اصحاب مغرب کے علاقوں میں قرآن میں اس کے عقد کو ترک کرنا کہاں سے داخل ہوا۔ اور اسی طرح باقی تمام حروف کا معاملہ ہے، یہاں تک کہ آخر میں واؤ ہے، اور واؤ کے بعد حرف کے لیے کوئی مرتبہ نہیں ہے۔ اور اجسام میں اشکال کی کوئی حد نہیں ہے جہاں وہ رک جائیں، کیونکہ یہ عدد کے تابع ہے، اور عدد بذات خود لامتناہی ہے، اسی طرح اشکال بھی۔ پس استدائرہ کے بعد پہلی شکل جو ظاہر ہوئی وہ مثلث ہے، اور متساوی الاضلاع اور متساوی الزوایا مثلث سے مجسمات میں اشکال لامتناہی تک چلتی ہیں۔ اور بہترین اور سب سے زیادہ محکم شکل مسدس (چھ کونوں والی) ہے۔ اور جب جسم وسیع اور بڑا ہوتا ہے تو وہ بہت سی اشکال کو قبول کرتا ہے۔ پھر اللہ نے جسمانی صورت کو ہباء میں روک لیا، اس مرتبے کے ذریعے جو طبیعت نے اسے دیا، جسے ہم نے نفس اور ہباء کے درمیان بنایا۔ اور اگر وہاں اس کا مرتبہ نہ ہوتا تو جسم اس جوہر میں ظاہر نہ ہوتا اور نہ ہی اس میں اس کا ثبوت ہوتا۔ پس طبیعت نفس کے لیے اس کاریگر کے آلے کی طرح تھی جس سے وہ مواد میں صنعتی صورتیں کھولتا ہے۔ پس جسم کل اس جوہر میں نفس سے حرارت کے آلے کے ذریعے ظاہر ہوا، اور زندگی اس میں حرارت کے ساتھ رطوبت کے ملنے سے ظاہر ہوئی، اور اس کی صورت ہباء میں ٹھنڈک اور خشکی سے ثابت ہوئی، اور اس نے اسے، یعنی اس کروی جسم کو، تخت کی شکل پر بنایا، اور اس کے لیے چار حاملین بالفعل پیدا کیے جب تک دنیا باقی ہے، اور چار دیگر بالقوہ، ان چاروں اور دوسرے چاروں کو قیامت کے دن جمع کیا جائے گا، تو مجموعہ آٹھ ہو گا۔ اور اس کا نام عرش رکھا، اور اسے رحمت کا معدن بنایا۔ پس وہ اپنے نام الرحمن کے ساتھ اس پر مستوی ہوا، اور اسے اس تمام ملک پر محیط بنایا جو اس کے اندر ہے، وہ متحیز ہے، اتصال اور انفصال کو قبول کرتا ہے، اور مکانی ظرفی اینیت (کون کہاں ہے) کو آباد کرتا ہے۔ اور اس کے اوپر کا مرتبہ اس کے اور عماء (بادل) کے درمیان ہے، جس کے اوپر ہوا ہے اور جس کے نیچے ہوا ہے، اور یہ اسم رب کے لیے ہے، اور اللہ وہ اسم جامع ہے جو تمام الٰہی اسماء پر مہیمن ہے۔ پس اس کی صفت مہیمنیت ہے۔ اور عرش میں کلمہ واحد ہو گئی، پس یہ اجسام کے عالم کی پہلی موجودات ہے جس نے اسے قبول کیا۔ پھر اس نے اس ہباء کے جوہر میں ایک اور جسم کو وجود بخشا، کیونکہ اس ہباء کا جوہر ہی وہ ہے جس نے خلا کو آباد کیا ہے۔ پس جو بھی متحیز جسمی اور جسمانی صورتیں ظاہر ہوئی ہیں، یہ جوہر ہی ان کا قابل ہے۔ اور ہم نے یہ اس لیے کہا تاکہ یہ خیال نہ کیا جائے کہ کرسی عرش میں ایک صورت ہے، اور ایسا نہیں ہے، بلکہ یہ ہباء میں ایک اور صورت ہے جسے اس نے قبول کیا، جیسا کہ اس نے عرش کی صورت کو قبول کیا، ایک ہی حد پر لیکن مختلف نسبتوں کے ساتھ۔ پس اس دوسرے موجود کا نام کرسی رکھا، اور عرش سے دو قدم اس کی طرف لٹکائے گئے، پس رحمت اس طرح پھٹ پڑی جیسے دانہ پھٹتا ہے، چنانچہ رحمت صفت میں اطلاق اور تقیید میں متنوع ہو گئی، پس مقید رحمت ظاہر ہوئی، اور وہ ایک قدم ہے، اور مطلق رحمت اس دوسرے قدم کے ظاہر ہونے سے ممتاز ہو گئی، پس اس قدم میں عرشی واحد کلمہ کا انقسام ظاہر ہوا، جس کا انقسام عرش میں ظاہر نہیں ہوا تھا، خبر اور حکم میں، اور حکم امر اور نہی میں تقسیم ہوا، اور امر وجوب، ندب اور اباحت میں تقسیم ہوا، اور نہی حظر اور کراہت میں تقسیم ہوئی، اور خبر ان اقسام میں اور استفہام، تقریر، دعا، انکار اور قصص اور تعلیم کی زیادتی کے ساتھ تقسیم ہوئی۔ پس زبانیں متنوع ہو گئیں اور کرسی میں لحن (آوازیں) ظاہر ہوئیں، پس نغمات کی تفصیل ظاہر ہوئی جو عرش میں مجمل تھیں، پس یہ اجسام کے عالم میں سماع سے ظاہر ہونے والا پہلا طرب ہے۔ اور وہیں سے یہ افلاک، آسمانوں، ارکان اور مولدات کے عالم میں سرایت کر گیا۔ پھر حق نے ایک اور جسم کو بھی وجود بخشا، جو مرتبے میں کرسی سے نیچے ہے، اور اسے گول، فلکی، غیر مکوكب (ستاروں کے بغیر) بنایا۔ اس میں اس نے بارہ مخصوص تقدیریں مقرر کیں، ہر مقدار کا نام ایک ایسا نام رکھا جو دوسرے کا نہیں تھا، اور یہ بروج کے نام سے معروف ہیں۔ اور اس میں طبیعت کا سلطان ظاہر کیا، پس اس میں سے تین کو حرارت اور خشکی کے اجتماع سے بنایا، اور ان کے احکام مختلف رکھے، اگرچہ وہ ایک ہی طبیعت پر تھے، لیکن اس فلک میں مخصوص مقام کے مختلف ہونے کی وجہ سے ان کے احکام اس پہلو سے مختلف ہو گئے، اور چونکہ وہ حرارت اور خشکی کی ایک ہی طبیعت پر ہیں، اس لیے ان کے احکام متفق ہو گئے، پس وہ ایک پہلو سے اتفاق کے ساتھ عمل کرتے ہیں اور دوسرے پہلو سے اختلاف کے ساتھ۔ اور اسی وجہ سے ان سے کون و فساد، تغیر اور استحالات (تبدیلیاں) ظاہر ہوئیں۔ اور فساد سے میری مراد وہ شرور نہیں ہیں جو ہمارے ہاں یہاں عام ہیں، بلکہ فساد سے میری مراد ایک مخصوص نظام کا زوال ہے، جسے کہا جاتا ہے کہ وہ نظام بگڑ گیا، یعنی زائل ہو گیا۔ جیسا کہ جب آپ سیب کھاتے ہیں یا اسے چاقو سے ٹکڑوں میں کاٹتے ہیں، تو اس کا نظام بگڑ جاتا ہے، پس وہ صورت کسی دوسری صورت کے ظاہر ہونے سے چلی جاتی ہے۔ اور اس فلک سے جنت میں موجود ہر چیز کی تکوین ہوتی ہے، اور اسی سے اہل جنت کے لیے شہوت ہوتی ہے، اور یہ تکوین کا عرش ہے۔ پھر اللہ تعالیٰ نے اس فلک اطلس کے اندر، جو ان طبائع کا محل ہے جو نفس عملیہ کا آلہ ہیں، ایک اور فلک کو جوہر ہباء میں وجود بخشا، جیسا کہ ہم نے ذکر کیا، اور ظہور الٰہی (التجلی) کے ذریعے، جیسا کہ ہم نے ذکر کیا، کیونکہ اللہ سبحانہ کے بغیر تکوین نہیں ہوتی۔ اور یہ فلک کواکب ثابتہ اور منازل کا فلک ہے، جن سے اطلس میں مقرر کردہ بروج کی تقسیم کا اندازہ لگایا جاتا ہے، کیونکہ اطلس کے اجزاء متشابہ ہیں۔ اور یہ اٹھائیس منازل ہیں، اور وہ ہیں: النطح، البطین، الثریا، الدبران، الہنعة، الہقعة، الذراع، النثرة، الطرف، الجبہة، الزبرة، الصرفة، العوا، السماک، الغفر، الزبایا، الاکلیل، القلب، الشولة، النعائم، البلدة، سعد الذابح، سعد بلع، سعد السعود، سعد الاخبية، الفرع المقدم، الفرع المؤخر، اور الرساء۔ یہ اٹھائیس معروف اور نامزد منازل ہیں، جن پر بروج کی طبائع کا حکم لگایا جاتا ہے، اور وہ ہیں: الحمل، الثور، الجوزاء، السرطان، الاسد، السنبلة، المیزان، العقرب، القوس، الجدی، الدلو، اور الحوت۔ اور اس مکوكب فلک، یعنی منازل کے فلک، کی فلک اطلس (فلک بروج) میں کٹاؤ (قطع) ہے۔ اور فلک بروج میں ہر تقدیر کے لیے مذکورہ منازل میں سے دو منزلیں اور ایک تہائی مقرر کی گئی ہیں۔ اور اس کی منازل اور تمام کواکب کی اپنے افلاک میں سست رفتار تیراکی ہے، جسے ہزاروں سالوں کے بعد ہی بصارت محسوس کر سکتی ہے، جیسا کہ مصر کے اہرام کے بارے میں ذکر کیا گیا ہے کہ وہ اس وقت بنائے گئے تھے جب نسر (عقاب) برج اسد میں تھا، اور آج وہ برج جدی میں ہے، اور ہم چھ سو چونتیس (۶۳۴) ہجری میں ہیں۔ پھر اس نے اس مکوكب فلک کی سطح پر جنت کو اس میں موجود ہر چیز کے ساتھ، برج اسد کے طالع کے ساتھ وجود بخشا، اور یہ ایک ثابت برج ہے، اسی لیے اس کے لیے دوام ہے۔ کیونکہ اس فن کے ماہرین نے ان بروج کو ان ناموں سے موسوم کیا ہے جن کا ہم نے ذکر کیا، اور ان کی حرکات میں ان کے عجیب و غریب آثار پر اللہ نے انہیں جو مطلع کیا، اس کے مطابق ان کی صفات بیان کیں، چنانچہ انہوں نے ان میں سے ثابت، منقلب اور ذو الجسدین وغیرہ کو پہچانا۔ اور علم رصد رکھنے والوں کا علم فلک اطلس پر ختم ہوتا ہے، اور حقیقت میں یہ صرف کواکب پر ختم ہوتا ہے، کیونکہ کواکب کی حرکات ان کے افلاک کو متعین کرتی ہیں، اگر ایسا نہ ہوتا تو ان کی تعداد معلوم نہ ہوتی۔ اور جہاں تک فلک اطلس کا تعلق ہے، تو انہوں نے اس پر حسی طور پر ادراک کر کے استدلال نہیں کیا، جیسا کہ انہوں نے کواکب کے افلاک کا ادراک کیا، بلکہ انہوں نے یہ جانا کہ یہ افلاک صرف ایک وجودی، فلکی امر میں ہی کٹاؤ کر سکتے ہیں، چنانچہ انہوں نے اسے عقلی طور پر ثابت کیا نہ کہ حسی طور پر، اور اسے اطلس کا نام دیا کیونکہ اس میں کوئی ستارہ نہیں ہے جو اسے حس کے لیے متعین کرے۔ اور یہ دلیل ان پر افلاک کے آخری فلک کی حرکت سے باطل ہو جاتی ہے، کیونکہ ان کے نزدیک اس کی حرکت موجود ہے اور وہ کسی چیز میں کٹاؤ نہیں کرتی۔ پس اے صاحب رصد، آپ کو کیا معلوم، شاید یہ مکوكب فلک کسی لاشے میں کٹاؤ کرتا ہو۔ اور حکماء نے فلک اطلس کے اوپر دوسرے افلاک ہونے سے منع نہیں کیا، سوائے اس کے کہ راصد وہاں تک نہیں پہنچ سکا، کیونکہ وہاں کوئی چیز نہیں ہے جو ان پر دلالت کرے، بلکہ وہ ان کے نزدیک جواز کے حکم میں ہیں۔ لیکن انہوں نے کہا کہ اگر وہاں کوئی فلک ہے تو اس کے لیے نفس اور عقل کا ہونا ضروری ہے، اور اس کے باوجود ایک انتہا کا ہونا ضروری ہے۔ اور اسی فلک سے ہمارے اور فلاسفہ حکماء کے درمیان تکوین کی ترتیب میں اختلاف واقع ہوا، اور انہوں نے اطلس سے اوپر، جو کہ کرسی اور عرش ہے، کے بارے میں ہم سے کوئی جھگڑا نہیں کیا، اور اس میں جواز کے قائل ہوئے۔ پس ہمارے نزدیک مکوكب فلک کے بعد امر کی ترتیب ہے، اور وہ اپنی تخلیق کے وقت مکوكب نہیں تھا، بلکہ کواکب اس کے بعد اس میں اور دیگر آسمانوں میں ظاہر ہوئے، جن میں ان موجودہ چار افلاک کی حرکت تھی جن میں طبیعت مکمل ہوئی اور اس کا سلطان حسی طور پر ظاہر ہوا، بعد اس کے کہ وہ معقول تھا۔ کیونکہ معانی ہی چیزوں کی اصل ہیں، پس وہ بذات خود معقول، غیبی معانی ہیں، پھر وہ حضرت حس میں محسوس ہو کر ظاہر ہوتی ہیں، اور حضرت خیال میں متخیل ہو کر، اور وہ وہی ہیں، سوائے اس کے کہ وہ ہر حضرت میں اس کے مطابق تبدیل ہو جاتی ہیں، جیسے گرگٹ جو ان رنگوں کو قبول کرتا ہے جن پر وہ ہوتا ہے۔ پس سب سے پہلے اس نے زمین کو وجود بخشا، اور یہ خلا کی انتہا ہے، اور یہ کثافتوں اور ظلمتوں کی انتہا ہے، اور یہ اب تک ہمیشہ نیچے کی طرف جا رہی ہے، اور خلا کی کوئی انتہا نہیں ہے، کیونکہ یہ ایک وہمی پھیلاؤ ہے جو کسی جسم میں نہیں ہے۔ پس سارا عالم ہمیشہ مرکز کی تلاش میں نیچے جا رہا ہے۔ اور یہ طلب، طلب معرفت (المعرفۃ) ہے، اور اس کا مرکز وہ ہے جس پر اس کا امر مستقر ہو جائے، پس اس کے بعد اس کے لیے کوئی طلب نہ ہو، اور یہ ممکن نہیں ہے۔ پس اس کا طلب کے لیے نیچے جانا دائمی اور مسلسل ہے۔ اور اسی کو طلب حق سے تعبیر کیا جاتا ہے۔ پس حق (الحق) ہی اس کا مطلوب ہے، اور اس طلب نے اس ظہور الٰہی (التجلی) میں اثر کیا جو اسے حاصل ہوا، اس نے اس سے عشق کیا، پس وہ اسے ایک عشقی حرکت سے طلب کرتا ہے۔ اور اسی طرح باقی تمام متحرکات کی حرکت صرف محبت اور عشق کی وجہ سے ہے، اور اس کے سوا کوئی چیز درست نہیں ہے۔ اور جو اس ظہور الٰہی (التجلی) سے عشق نہیں کرتا، جو جمال سے موسوم ہے، اور جمال اپنی ذات کے لیے معشوق ہے، اور اگر اللہ سبحانہ جمال کی صورت میں ظہور الٰہی (التجلی) نہ کرتا تو عالم ظاہر نہ ہوتا۔ پس عالم کا وجود (الوجود) میں آنا اس عشق کی وجہ سے تھا، اس کی حرکت عشقی ہے۔ اور حال مسلسل رہا، پس عالم کی حرکت دائمی ہے اور اس کی کوئی انتہا نہیں ہے۔ اور اگر وہاں کوئی امر ہوتا جو مرکز کہلاتا اور جس پر انتہا ہوتی، تو عالم کا بعض حصہ بعض پر ضرورتاً ساکن ہو جاتا اور حرکت باطل ہو جاتی، پس امداد باطل ہو جاتی، جس سے عالم کی فنا (الفناء) اور اس کی عین (ذات) کا خاتمہ ہو جاتا۔ اور معاملہ اس کے برعکس ہے۔ اور لوگ اور اکثر مخلوق عالم کی حرکت کو محسوس نہیں کرتے، اور چونکہ وہ مکمل طور پر متحرک ہے، اس لیے بعد اور قرب کا مشہود (الشہود) ترتیب اپنی حالت پر باقی رہتی ہے۔ اسی شہود (الشہود) کی وجہ سے وہ زمین کے مرکز کے گرد سکون کا وہم کرتے ہیں۔ پھر اس نے پانی کے رکن کو وجود بخشا، اور یہ ارکان میں سے پہلا موجود تھا۔ اور ہم نے زمین کا ذکر پہلے اس لیے کیا کہ وہ سب سے نیچے ہے۔ اور پانی پہلا عنصر تھا، پس جو اس میں سے کثیف ہوا وہ زمین بن گیا، اور جو اس میں سے لطیف ہوا وہ ہوا بن گیا، پھر جو اس میں سے لطیف ہوا وہ آگ بن گیا، اور وہ کرہ اثیر ہے۔ پس ہمارے نزدیک عناصر کی اصل پانی ہے، اور اس فن کے بعض نظریاتی ماہرین نے اس پر ہماری موافقت کی ہے۔ لیکن ہمارا مستند کشف (الکشف) ہے اس میں جو ہم اس اور دیگر علوم میں دعویٰ کرتے ہیں۔ اور ہو سکتا ہے کہ وہ علوم فکری نظر سے بھی ادراک کیے جا سکیں، پس جس نے اپنی نظر میں درستگی کی اس نے اہل کشف (الکشف) کی موافقت کی، اور جس نے اپنی نظر میں غلطی کی اس نے اہل کشف (الکشف) کی مخالفت کی۔ اور حکماء اس مسئلے میں چھ مذاہب پر ہیں، جن میں سے پانچ غلط ہیں اور ایک صحیح ہے، اور وہ وہی ہے جس نے کشف (الکشف) اور اہل خطاب (فرشتہ، نبی اور ولی) کے لیے الٰہی تعریف کی موافقت کی۔ اور ان عناصر کا وجود برج سرطان سے ہوا، اور کوئی برج ایسا نہیں ہے جس کے لیے اللہ نے ولایت میں ایک معلوم مدت مقرر نہ کی ہو، دوسروں کے ساتھ اس کی مدت میں شراکت کے ساتھ۔ پس ان سب کے لیے ہمارے نزدیک ایک معلوم مدت ہے جسے ہم عالم کی عمر کہتے ہیں۔ پس جب مدتیں ختم ہو جائیں گی تو امر ابتداء کی حالت پر لوٹ آئے گا، دوام کے ساتھ۔ پس اس کی ذات کو کبھی عدم لاحق نہیں ہو گا، اور کوئی صورت دو زمانوں تک باقی نہیں رہے گی۔ پس مخلوق ہر سانس میں صورت کے لحاظ سے ایک نئی تخلیق میں ہے جس میں تکرار نہیں ہے۔ اگر آپ اس کا مشاہدہ کریں تو آپ ایک عظیم امر دیکھیں گے جو آپ کو اس کے منظر سے خوفزدہ کر دے گا اور آپ کی ذات کے جوہر پر خوف پیدا کرے گا۔ اور اگر اللہ اہل کشف (الکشف) کی علم کے ذریعے تائید نہ کرتا تو وہ خوف سے بھٹک جاتے۔ پس جب عناصر، جو کہ چار ارکان ہیں، تناسل اور ولادت کو قبول کرنے کے لیے ایک تیار، انوثی محل بن گئے، اور عنصر نار سے ہوا اور پانی کی رطوبتوں میں احتراقات (جلن) ظاہر ہوئیں، تو ان سے دھواں اوپر اٹھا جو سب سے بڑے، یعنی سب سے اونچے فلک کو طلب کر رہا تھا۔ پس اس نے کواکب کے فلک کو پایا جو اسے سب سے اونچے فلک تک جانے سے روک رہا تھا۔ پس وہ دھواں واپس لوٹا اور بعض بعض میں متراکم ہو کر موجیں مارنے لگا۔ پس اللہ نے اس کی بندش کو سات آسمانوں سے کھول دیا۔ پھر کرہ اثیر سے چنگاریاں اس دھوئیں میں اڑیں، پس انہوں نے آسمانوں اور مکوكب فلک سے ایسے مقامات کو قبول کیا جن میں قدرتی رطوبتیں تھیں، پس وہ چنگاریاں ان سے چمٹ گئیں، اور ان مقامات نے اپنی رطوبتوں کی وجہ سے آگ پکڑ لی، پس کواکب وجود میں آئے، اور فضا روشن ہو گئی، جیسا کہ چراغ سے گھر روشن ہوتا ہے۔ کیا آپ نہیں دیکھتے کہ چقماق کو رگڑنے والا جلتی ہوئی چنگاری کو اس میں موجود رطوبت سے چمٹاتا ہے، تو وہ بھڑک اٹھتی ہے اور اس سے چراغ بنتا ہے۔ اور اسی لیے اللہ تعالیٰ نے فرمایا: **وَجَعَلْنَا الشَّمْسَ سِرَاجًا** (اور ہم نے سورج کو چراغ بنایا) جس سے عالم روشن ہوتا ہے اور وہ چیزیں نظر آتی ہیں جنہیں اندھیرا چھپاتا تھا۔ پس سورج اور زمین کے کواکب کے وجود میں آنے سے رات اور دن وجود میں آئے۔ پس رات زمین کی حجابی ظلمت ہے سورج کے نور کے پھیلاؤ سے۔ اور ہمارے نزدیک تمام کواکب مستنیر ہیں، وہ سورج سے مدد نہیں لیتے جیسا کہ بعض کا خیال ہے۔ اور چاند اپنی اصل پر ہے، اس میں بالکل کوئی نور نہیں ہے، اللہ نے اس کے نور کو مٹا دیا ہے۔ اور وہ نور جو اس کی طرف منسوب کیا جاتا ہے، وہ وہی ہے جو آنکھوں کو سورج سے چاند کے آئینے میں، آنکھوں کے اس کی طرف رخ کرنے کے مطابق، متعلق ہوتا ہے۔ پس چاند سورج کا مجلیٰ (ظہور گاہ) ہے، اور اس میں سورج کے نور کا نہ تھوڑا حصہ ہے نہ زیادہ۔ پھر اللہ نے ہر فلک اور آسمان میں اس فلک کی طبیعت کی جنس سے ایک عالم کو مرتب کیا، انہیں فرشتے نام دیا، ان مقامات پر جن پر اس نے انہیں تسبیح اور تہلیل اور اللہ تعالیٰ کی ہر تعریف کے لیے فطرت دی ہے۔ اور ان میں سے ایسے فرشتے بنائے جو عناصر کے عالم میں مولدات (پیدا ہونے والی چیزیں) کی مصلحتوں کے لیے مسخر ہیں، اور وہ تین طبعی عالم ہیں۔ اور ان تینوں مولد عالموں میں سے ہر ایک میں نفس کلیہ، جو آلات کی مالک ہے، کی ارواح سرایت کرتی ہیں، جو ان مولدات کے نفوس ہیں، جن کے ذریعے وہ اپنے خالق اور منشئ کو جانتے ہیں، اور جن کے ذریعے ان سب میں زندگی سرایت کی، اور جن کے ذریعے حق نے ان سے خطاب کیا اور انہیں مکلف کیا، اور وہ ان میں سے ہر شخص کا اپنے رب کی طرف رسول اور داعی ہے۔ پس جس کی زندگی باطنی رہی اسے جماد اور نبات کہا گیا، اور یہ دونوں مولدات نمو اور غذا کے ذریعے الگ اور ممتاز ہو گئے، پس بڑھنے والے کو نبات اور نہ بڑھنے والے کو جماد کہا گیا۔ اور جس کی زندگی اور حس ظاہر ہوئی اسے حیوان کہا گیا۔ اور سب کو زندگی نے عام کیا، پس وہ اپنے خالق کی تعریف میں بولتے ہیں جہاں سے ہم نہیں سنتے، اور اللہ نے انہیں فطرت کے ذریعے امور کا علم دیا جہاں سے ہم نہیں جانتے۔ پس کوئی تر یا خشک، گرم یا ٹھنڈا، جماد یا نبات یا حیوان باقی نہیں رہا مگر وہ اللہ تعالیٰ کی تسبیح کر رہا ہے، اس جنس کی خاص زبان سے۔ اور جنات کو آگ کے شعلے سے پیدا کیا، اور انسان کو اس چیز سے جو ہمیں بتائی گئی، اور ارواح کو سب میں پھونکا، اور ان مولدات (انسان، جن، بحری، بری اور ہوائی حیوان) کے لیے قوتیں مقرر کیں جو ان کی غذائیں ہیں۔ اور **وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا** (اور اس نے ہر آسمان میں اس کا امر وحی کیا) اس علم کے ساتھ جو اللہ نے ان کواکب کی حرکات، ان کے اقترانات، ان کے ہبوط اور ان کے سعود میں، ان کے نحوست اور سعادت کے گھروں میں ودیعت رکھا ہے۔ اور ان کی حرکات اور ان کے اوپر کے افلاک کی حرکات سے مولدات وجود میں آئیں، اور چار افلاک کی حرکات سے ارکان وجود میں آئے۔ اور یہ اس سے خلاف ہے جس کی طرف اس فن کے متکلمین میں سے اہل کشف (الکشف) کے علاوہ دوسرے لوگ گئے ہیں۔ پس اللہ نے ان کواکب کے خزانوں میں، جو افلاک میں ہیں، عنصری عالم میں ہونے والے آثار کے علوم کو ودیعت رکھا ہے، تقلیب اور تغیر کے۔ پس یہ الٰہی اسرار ہیں جن کے لیے اللہ نے اہل مقرر کیے ہیں جو اسے جانتے ہیں، لیکن علم کی بنیاد پر نہیں بلکہ تقریب (قیاس) کی بنیاد پر۔ اور امر بذات خود صحیح ہے، سوائے اس کے کہ اس فن کا ناظر کسی وجہ سے اپنی نظر کا حق پورا نہیں کر پاتا، کیونکہ وہ غفلت یا عدد اور مقدار میں غلطی کرتا ہے جسے وہ محسوس نہیں کرتا، پس وہ حکم لگاتا ہے اور غلطی کرتا ہے، چنانچہ غلطی اس کی نظر سے واقع ہوئی نہ کہ نفس امر سے۔ اور کبھی نظر علم کے موافق ہو جاتی ہے، تو جو وہ کہتا ہے وہ واقع ہو جاتا ہے، لیکن وہ اس میں بصیرت پر نہیں ہوتا، کسی مخصوص مسئلے کی تعیین کے لحاظ سے۔ اور یہ علم ایسا ہے کہ عمریں اس کے ادراک کے لیے کافی نہیں ہیں، پس اس کی اصل نبوتوں سے معلوم ہوتی ہے۔ پس سب سے پہلے جس نے لوگوں کو اس علم کی تعلیم دینا شروع کی وہ ادریس علیہ السلام تھے، اللہ کی طرف سے، پس اللہ نے انہیں وہ سب کچھ سکھایا جو اس نے ہر آسمان میں وحی کیا، اور جو کچھ اس نے ہر ستارے کی حرکت میں رکھا، اور انہیں کواکب کے اقترانات اور اقترانات کی مقداریں، اور ان سے مختلف امور کا پیدا ہونا، اقلیموں اور قابلوں کے مزاجوں اور حیوانوں کے اشخاص میں ان کے نطفوں کے گرنے کے مطابق، بیان کیا۔ پس قرآن ایک ہوتا ہے اور عنصری عالم میں اس کا اثر اقلیم اور اس کی طبیعت کے عطا کردہ کے مطابق مختلف ہوتا ہے۔ پس اس کی بہت سی شرائط ہیں جنہیں اس فن کے ماہرین جانتے ہیں۔ پس جب انبیاء نے انہیں میزانیں دیں اور انہیں مقداریں سکھائیں، تو انہوں نے وہ امور جان لیے جو اللہ دور کے زمانے میں پیدا کرتا ہے، اور دور کے زمانے کے بارے میں، اگر اللہ انہیں ان کے نفوس پر چھوڑ دیتا معمول کے حکم کے ساتھ، یہاں تک کہ وہ ان پر تکرار ہوتا، جو عادتاً قطعی یقین کا موجب ہوتا، اور بعض امر ایسے ہوتے ہیں جن کی تکرار جو ظنی قطع کا موجب ہو، ہزاروں سالوں کے بعد ہی ظاہر ہوتی ہے۔ پس یہ الٰہی تعریف کا سبب تھا انبیاء علیہم السلام کی زبانوں پر، پس انہوں نے لوگوں کو وہ سب کچھ بتایا جو اللہ نے ان پر وحی کیا، جو اللہ نے ان مسخر کواکب کو حوادث سے امان دی۔ اور اگر اس علم کے منکر جاہل لوگ اللہ تعالیٰ کا یہ قول جانتے: **وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ** (اور ستارے اس کے حکم سے مسخر ہیں) تو وہ وہ کچھ نہ کہتے جو انہوں نے کہا۔ پس انہوں نے ان کے مسخر ہونے کو نہیں جانا، اور یہ کہ وہ ایسے ہی ہیں جیسا کہ اللہ تعالیٰ نے فرمایا: **وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِّيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا** (اور ہم نے ان میں سے بعض کو بعض پر درجات میں بلند کیا تاکہ ان میں سے بعض بعض کو خدمت میں لے آئیں)۔ جیسا کہ اس نے ہواؤں، سمندروں اور کشتیوں کو مسخر کیا، اسی طرح اس نے کواکب کو مسخر کیا۔ اور کیا ان مسخرات میں سے کواکب، افلاک، ہوائیں، سمندر اور چوپائے، اور ہر مسخر چیز، اس چیز کو جانتی ہے جس کے لیے وہ مسخر ہے یا نہیں؟ یہ صرف ہمارے طریقہ کے اہل ہی جانتے ہیں۔ قشیری نے روایت کی ہے کہ ایک شخص نے ایک شخص کو گدھے پر سوار دیکھا اور وہ گدھے کے سر پر مار رہا تھا، تو اس نے اسے اس سے منع کیا، تو گدھے نے اس سے کہا: اسے چھوڑ دو، وہ اپنے سر پر مار رہا ہے۔ پس جس نے جزا کو جانا وہ اس چیز کو کیسے نہیں جانے گا جس کے لیے وہ مسخر ہے۔ اور ہم نے اس طرح کی بہت سی چیزیں جمادات اور حیوانات سے دیکھی ہیں۔ اور کلام طویل ہو گیا ہے، اور یہ مقدار عالم کی ترتیب کی معرفت کے لیے کافی ہے، جو ان علوم کے حصوں میں سے ایک ہے جو اس منزل میں شامل ہیں۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے)۔",
    "fa": "باب دویست و نود و پنجم در معرفت منزل اعداد شریفه از حضرت محمدیه\n\nنهرها از ذات سنگ‌ها جوشیدند *** و در زمین من در خزانه‌های اسرارم فرو رفتند.\nده یک از علم لدنی آشکار است *** و آنچه از آن کتمان شده، نُه دهم است.\nنفسم مرا به مثنای (دوگانگی) هستی‌اش می‌خواند *** و مرا می‌طلبد و مصیبت را با اوتار (تک‌ها) می‌بیند.\nپس خویشتن را در شهر سروری حصار کردم *** که آن را از آب مرکب و آتش بنا نهاد.\nحصاری مانند آن در بلندی دیده نشد *** در آن پشت هفت دیوار پناه گرفتم.\nجایگاهش میان خواری و عزت است *** در آنجا با من بر اساس حد و اندازه‌ام رفتار می‌شود.\nتا آنکه در صور حسّش دمیده شود *** به سوی صور تخیل در برزخ اغیار (دیگران).\nو دوام امر در آن جاودانه باقی می‌ماند *** تا آنکه برانگیختن از گور افکارم باشد.\nپس آن را به علم و عین و حال شهود می‌کنم *** در مشهد انوار و مشهد اسرار.\nآن مظاهر نزد ما گوناگون‌اند *** با رؤیت افکار و رؤیت ابصار (دیده‌ها).\n\n### [علم لوایح (اللوائح) و آن منزلتی شگفت است که غفلت و فراموشی را نمی‌پذیرد]\n\nفهرست آنچه این منزل از علوم در بر دارد، علم لوایح (اللوائح) است که مقدمات ذوق (الذوق) عرفانی است. و آن منزلتی شگفت است که غفلت و فراموشی را نمی‌پذیرد. در آن علم دخول تأنیث در عدد وجود دارد، در حالی که عدد مذکر است. و در آن علم مانیّه (پیروان مانی) وجود دارد که از کجا گمراه شدند و وجه حقی که نزدشان بود تا آنان را به این اعتقاد سوق داد چیست؟ و آیا در روز قیامت عذری مقبول برای این کار دارند یا خیر؟ و در آن علم دخول وجود دارد که طلب اوتار (تک‌ها) است و چرا طلب می‌شوند و فضلشان به چه کسی باز می‌گردد؟ و آیا کسی که به ناحق کشته شده، به آن راضی می‌شود یا خیر؟ و ولایت حکمتی که این امر را برای ولی قرار داده است. و آیا اگر ولی از خون درگذرد، حق مقتول در روز قیامت ساقط می‌شود؟ یا مانند حواله در دین است که اگر صاحب حق آن را بپذیرد، دیگر حق رجوع به اولی را ندارد، اگر مرجوع‌الیه پس از رضایت صاحب دین به حواله، دچار تنگدستی شود؟ و در آن علم قرار گرفتن غیب وجود دارد تا شهود نشود و چرا قرار می‌گیرد؟ و در آن علم غیبی وجود دارد که واجب است شهود شود و طلب آن از خداوند. و در آن علم عقل و مرتبه صاحب آن. و در آن علم اعتبار. و در آن علم انتقال در احوال و مقامات. و در آن علم کیفیات و کمیات. و در آن علم تعالی (برتری) و اینکه چرا حاصل می‌شود و اینکه مخصوص اهل بلادت (کندذهنی) است نه زیرکان. و در آن علم صلاح و فساد. و در آن علم آنچه بر اعمال مترتب می‌شود، چه تکلیف واقع شود و چه واقع نشود. و در آن علم اینکه اهل نجوم که بر اساس آن حکم می‌کنند و بر آنچه خداوند از احکام در آن به ودیعه نهاده آگاهند، علم خود را از کجا گرفته‌اند؟ و شرافت آن بر سایر علوم. و ذکر حیوانی که اگر بالای آن خورده شود، به خاصیت خود به خورنده علم نجوم می‌دهد، و اگر وسط آن خورده شود، علم نبات می‌دهد، و اگر عجز (دنباله) آن که نزدیک دمش است خورده شود، علم آب‌های پنهان در زمین را می‌دهد، به طوری که اگر به زمینی بی‌آب رود، می‌داند که آب در چند ذراع آنجاست. این حیوان ماری است نه بزرگ و نه کوچک، که فقط در نواحی شلب در غرب اندلس یافت می‌شود. عبدالله بن عبدون، کاتب امیرالمؤمنین، در آنجا به آن برخورد کرد و سر و دم آن را با یک ضربه با کاردی دو شاخه قطع کرد و آن را سه تکه نمود. آنان سه برادر بودند. عبدالله قسمت بالای آن را خورد و در علم قضاوت با نجوم، بدون مطالعه کتاب یا تعلیم استادی، آیت و نشانه‌ای شد. برادرش عبدالمجید وسط آن را خورد و در علم نباتات و خواص و ترکیبات آن‌ها، بدون مطالعه کتاب یا تعلیم، آیت شد. فرزندش منجنیقی این را در قونیه به من خبر داد. و برادر سوم تکه آخر که نزدیک دم بود را خورد و در استخراج آب‌ها از دل زمین آیت شد. پس منزه است آنکه اسرار خود را در خلقش به ودیعه نهاده است. و در آن علم فرق میان کرامت و استدراج در خرق عادات. و در آن علم سببی که موجب شده است عالم حیوانی انسانی غیر خدا را دوست بدارد. و سبب حب دو چیز است: نسبت و احسان. و نسبت به خداوند نزدیک‌تر است، زیرا او بر صورت (الهی) آفریده شده است. و احسان از جانب خداوند است، زیرا اوست که با ایجاد عین (ذات) او و سپس هر آنچه در آن است، نعمت بخشیده است. پس چگونه غیر او را دوست بدارد و در آن فانی شود؟ و در آن\nعلم آخرت و آنچه به آن مربوط است، از هنگام توقف مردم بر پل (صراط) بدون تاریکی تا ورودشان به منازل شقاوت و سعادت. اینها تمام علومی است که این منزل در بر دارد. من شما را بر آن‌ها آگاه ساختم تا همت‌ها برای طلب آن‌ها بالا رود. پس به اندازه گنجایش کلام، با اختصار و بدون اطاله و زیاده‌گویی، یک یا چند مسئله از آن‌ها را ذکر می‌کنیم. پس می‌گویم: و خداوند حق می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ).\n\n### [آفرینش ارواح ملکی مهیمه (المهيمة) و کروبیون (الكروبيون)]\n\nبدان که چون خداوند ارواح ملکی مهیمه (المهيمة) را آفرید، آنان کسانی هستند که به غیر حق (الحق) علمی ندارند و نمی‌دانند که خداوند چیزی جز خودشان آفریده است. آنان کروبیون (الكروبيون) مقرب، معتکف و منفرد هستند که به واسطه آنچه حق از جلال خود به آنان شهود داده، از خودشان گرفته شده‌اند. خداوند از میان آنان، آنکه را عقل اول (العقل الأول) نامیده می‌شود، برگزید. و افراد (الأفراد) از ما بر مقام آنان هستند. پس جلال خداوند در قلوب افراد نیز چنین است و جز حق را شهود نمی‌کنند. و آنان خارج از حکم قطب (القطب) هستند که امام است و او یکی از ایشان است، اما ماده وجودی او از عقل اول است که اولین موجود از عالم تدوین و تسطیر (نوشتن) است و آن موجود ابداعی است. سپس، بدون فاصله زمانی، از این عقل، موجودی انبعاثی (برخاسته) پدید آمد و آن نفس (النفس) است و آن لوح محفوظ است که هر آنچه در این سرا تا روز قیامت خواهد بود، در آن نوشته شده است. و آن علم خداوند در خلق اوست. و این نفس در نورانیت و مرتبه ضیائی (درخشندگی) پایین‌تر از قلم (العقل) است. پس مانند زمرّد سبز است، به دلیل انبعاث جوهر هبائی (غبارآلود) که در قوه این نفس است. پس از نفس، جوهر هبائی (الهباء) برخاست و آن جوهری تاریک و بدون نور است. و خداوند مرتبه طبیعت (الطبيعة) را میان نفس و هباء، مرتبه‌ای معقول (قابل درک) قرار داد نه موجود (حسی). سپس، به واسطه آنچه خداوند از وضع اسباب و احکام عطا کرد و در عالم از وجود انوار و ظلمت‌ها بر اساس اقتضای ظاهر و باطن مرتب نمود، همان‌گونه که ابتدا را در اشیاء و انتها را در مقادیر آن‌ها با اجلی معلوم قرار داد، و این تا بی‌نهایت است. پس جز ابتداها و انتهاهای دائمی از دو اسم او، اول (الأول) و آخر (الآخر)، وجود ندارد. پس از آن دو حقیقت بود که ابتدا و انتها همیشه وجود داشت. پس کون (هستی) همیشه جدید است و بقای سرمدی در تکوین است. پس خداوند به این نفس، به دلیل آنچه ذکر کردیم، نیرویی عملی عطا کرد. از آن نیرو، خداوند سبحان با نوعی از تجلی (التجلی) جسم کل (الجسم الكل) را به صورت در جوهر هبائی ایجاد کرد. و هیچ موجودی نیست که خداوند آن را به واسطه سببی خلق کرده باشد، مگر با تجلی الهی خاص برای آن موجود که سبب آن را نمی‌شناسد. پس این موجود از آن تجلی الهی و توجه ربانی، هنگام توجه سبب، پدید می‌آید، نه از خود سبب. و اگر چنین نبود، آن موجود وجود نمی‌یافت. و این همان قول خداوند سبحان و تعالی است: (فَيَنفُخُ فِيهِ) [اشاره به آیه]، پس برای سبب جز دمیدن نبود، و آن (موجود) به اذن خداوند پرنده می‌شود. پس پرنده شدن تنها به دلیل توجه امر خداوند بر آن به «کُن» (باش) بود، با امری که شایسته جلال اوست. چون این جسم اول را ایجاد کرد، شکل (الشكل) برای آن لازم شد، زیرا اشکال از لوازم اجسام هستند. اولین شکلی که در جسم ظاهر شد، شکل مستدیر (دایره‌ای) بود و آن بهترین اشکال است. و برای اشکال به منزله الف برای حروف است، که همه اشکال را در بر می‌گیرد، همان‌گونه که حرف الف همه حروف را در بر می‌گیرد، با عبور هوایی از سینه بر مخارج حروف تا از لب‌ها بگذرد. پس ذات حروف را در مخارج آشکار می‌سازد. اگر در سینه متوقف شود، حرف هاء و همزه در اعیان خود از حرف الف ظاهر می‌شوند. اگر از سینه به حلق منتقل شود و در مراتب معینی در حلق توقف کند، در آن توقف وجود حاء مهمله، سپس عین مهمله، سپس خاء معجمه، سپس غین معجمه، سپس قاف معقوده (گره‌خورده) و سپس کاف را آشکار می‌سازد. اما قافی که معقوده نیست، حرفی است میان دو حرف، میان کاف و قاف معقوده؛ نه کاف خالص است و نه قاف خالص. و به همین دلیل اهل زبان آن را انکار می‌کنند. اما شیوخ ما در قرائت، قاف را عقد نمی‌کنند و گمان می‌کنند که آن را این‌گونه از شیوخ خود گرفته‌اند و شیوخشان از شیوخشان در اداء، تا به عرب‌های اهل آن زبان رسیده‌اند که صحابه تا پیامبر (صلی الله علیه و سلم) هستند. همه اینها اداء است. اما عرب‌هایی که ما با آنان ملاقات کردیم و زبانشان تغییر نکرده بود، مانند بنی فهم، دیدم که قاف را عقد می‌کنند. و همه عرب‌ها چنین هستند. پس نمی‌دانم از کجا ترک عقد آن در قرآن به اصحاب ما در بلاد مغرب وارد شده است. و همین‌گونه است حدیث سایر حروف تا آخر آن که واو است. و اصلاً مرتبه‌ای برای حرف پس از واو نیست. و برای اشکال در اجسام حدی نیست که به آن پایان یابد و در آن متوقف شود، زیرا تابع عدد است و عدد فی‌نفسه نامتناهی است، پس اشکال نیز چنین‌اند. اولین شکلی که پس از استداره (دایره) ظاهر شد، مثلث بود. و از مثلث متساوی‌الاضلاع و متساوی‌الزوایا، اشکال در مجسمات تا بی‌نهایت پیش می‌روند. و بهترین و محکم‌ترین اشکال، مسدس (شش‌ضلعی) است. و هرچه جسم گسترده‌تر و بزرگ‌تر شود، اشکال بیشتری را می‌پذیرد. سپس خداوند صورت جسمی را در هباء (الهباء) نگه داشت، به واسطه آنچه طبیعت (الطبيعة) از مرتبه‌اش به آن عطا کرد، که آن را میان نفس و هباء قرار دادیم. و اگر مرتبه طبیعت در آنجا نبود، جسم در این جوهر ظاهر نمی‌شد و ثباتی در آن نداشت. پس طبیعت برای نفس مانند ابزار برای صنعتگر بود که با آن صور صنعتی را در مواد می‌گشاید. پس جسم کل (الجسم الكل) در این جوهر از نفس، به واسطه ابزار حرارت، ظاهر شد. و حیات در آن به واسطه همراهی حرارت با رطوبت ظاهر شد. و صورت آن در هباء با برودت و یبوست (خشکی) ثابت شد. و آن را، یعنی این جسم کروی، به هیئت تخت (السرير) قرار داد و برای آن چهار حامل بالفعل آفرید تا زمانی که دنیا باقی است، و چهار حامل دیگر بالقوه که این چهار و آن چهار دیگر در روز قیامت جمع می‌شوند و مجموعاً هشت می‌شوند. و آن را عرش (العرش) نامید و آن را معدن رحمت قرار داد. پس با اسم خود، الرحمن (الرحمن)، بر آن استوا یافت. و آن را محیط بر تمام آنچه از مُلک در بر دارد، قرار داد؛ متحیّز (دارای حیز و مکان) که اتصال و انفصال را می‌پذیرد و عمر اَینیّت (ظرفیت مکانی) را آباد کرد. و مرتبه مافوق آن، میان آن و عماء (العماء) که بالای آن هوا و زیر آن هواست، برای اسم رب (الرب) بود. و الله (الله) اسم جامع و مهیمن (المهيمن) بر تمام اسماء الهی است. پس صفت آن مهیمنیت است. و کلمه در عرش توحید یافت. پس آن اولین موجوداتی است که عالم اجسام آن را پذیرفت. سپس جسم دیگری را در جوهر این هباء (الهباء) ایجاد کرد. زیرا جوهر این هباء همان است که خلأ (الخلأ) را آباد کرد. پس هر آنچه از صور متحیّز جسمی و جسمانی ظاهر شده، این جوهر پذیرنده آن است. و این را گفتیم تا کسی خیال نکند که کرسی (الكرسي) صورتی در عرش است، در حالی که چنین نیست. بلکه آن صورتی دیگر در هباء است که آن را پذیرفت، همان‌گونه که صورت عرش را پذیرفت، بر یک حد، اما با نسبت‌های متفاوت. پس این موجود دیگر را کرسی نامید و دو قدم (القدمين) را از عرش به سوی آن آویخت. پس رحمت مانند شکافته شدن دانه شکافته شد. و رحمت در صفت به اطلاق و تقیید متنوع شد. پس رحمت مقید (محدود) ظاهر شد و آن یک قدم بود. و رحمت مطلق با ظهور این قدم دیگر متمایز شد. پس در این قدم، انقسام کلمه واحد عرشی که انقسام آن در عرش ظاهر نشده بود، به خبر و حکم ظاهر شد. و حکم به امر و نهی تقسیم شد. و امر به وجوب، ندب (استحباب) و اباحه تقسیم شد. و نهی به حظر (حرام بودن) و کراهت تقسیم شد. و خبر به این اقسام و افزون بر آن، از استفهام، تقریر، دعا، انکار و قصص و تعلیم تقسیم شد. پس زبان‌ها متنوع شدند و لحن‌ها در کرسی ظاهر شدند. پس تفصیل نغمه‌هایی که در عرش مجمل بودند، ظاهر شد. پس کرسی اولین طربی است که در عالم اجسام از سماع ظاهر شد. و از آنجا در عالم افلاک، سماوات، ارکان و مولدات (موجودات متولد شده) سرایت کرد. سپس حق (الحق) جسم دیگری را نیز آفرید، مستدیر (دایره‌ای) و در رتبه پایین‌تر از کرسی. و آن را فلکی مستدیر و غیر مکوكب (بدون ستاره) قرار داد. خداوند در آن دوازده تقدیر معین مقدر کرد که هر مقداری را به نامی نامید که دیگری به آن نامیده نشد. و اینها همان بروج (البروج) معروف هستند. و سلطان طبیعت را از آن‌ها آشکار ساخت. پس سه تا از آن‌ها را از اجتماع حرارت و یبوست قرار داد و احکام آن‌ها را متفاوت ساخت، اگرچه بر یک طبیعت بودند. اما چون مکان معین از این فلک متفاوت بود، احکام آن‌ها از آن جهت متفاوت شد. و به دلیل اینکه بر یک طبیعت از حرارت و خشکی هستند، احکام آن‌ها متفق شد. پس از یک جهت با اتفاق عمل می‌کنند و از جهتی با اختلاف. و به همین دلیل کون و فساد، تغییر و استحالات (دگرگونی‌ها) از آن‌ها ظاهر شد. و منظورم از فساد، شرور معمول نزد ما در اینجا نیست، بلکه منظورم از فساد، زوال نظم مخصوصی است که درباره آن گفته می‌شود: آن نظم فاسد شد، یعنی زائل شد. مانند اینکه سیبی را بخوری یا آن را با چاقو به قسمت‌هایی تقسیم کنی، نظم آن فاسد شده و آن صورت با ظهور صورتی دیگر در آن از بین رفته است. و از\nاین فلک است که تمام آنچه در بهشت است، تکوین می‌یابد و شهوت اهل بهشت از آن است. و آن عرش تکوین است. سپس خداوند تعالی در درون این فلک اطلس، که محل این طبایع است که ابزار نفس عملی هستند، فلک دیگری را در جوهر هباء (الهباء) ایجاد کرد، همان‌گونه که ذکر کردیم و با تجلی الهی (التجلي الإلهي) همان‌گونه که ذکر کردیم، زیرا تکوین جز از خداوند سبحان نیست. و این فلک، فلک کواکب ثابته و منازلی است که تقسیم بروج مقدر در اطلس با آن‌ها اندازه‌گیری می‌شود، زیرا اطلس اجزای متشابهی دارد. و اینها بیست و هشت منزل هستند: نطح، بطین، ثریا، دبران، هنعه، هقعه، ذراع، نثره، طرف، جبهه، زبره، صرفه، عوا، سماک، غفر، زبایا، اکلیل، قلب، شوله، نعائم، بلده، سعد ذابح، سعد بلع، سعد السعود، سعد الاخبيه، فرع مقدم، فرع مؤخر و رساء. اینها بیست و هشت منزل معروف و نامگذاری شده هستند که احکام بروج بر آن‌ها حاکم است، یعنی حمل، ثور، جوزاء، سرطان، اسد، سنبله، میزان، عقرب، قوس، جدی، دلو و حوت. و این فلک مکوكب، یعنی فلک منازل، در فلک اطلس (فلک بروج) برش‌هایی دارد. و برای هر تقدیر در فلک بروج، دو منزل و یک سوم از منازل مذکور قرار داده است. و منازل و تمام کواکب آن در افلاکی برای خود شناورند که حرکتشان کند است و چشم آن را جز پس از هزاران سال حس نمی‌کند، چنانکه درباره اهرام مصر ذکر شده که بنا شدند\nدر حالی که نسر (عقاب) در برج اسد بود و امروز در برج جدی است. و ما در سال ششصد و سی و چهار هستیم. سپس خداوند بر سطح این فلک مکوكب، بهشت را با آنچه در آن است، با طالع اسد (برج ثابت) ایجاد کرد. به همین دلیل است که بهشت دوام دارد. زیرا اصحاب این فن، این بروج را به نام‌هایی که ذکر کردیم نامیده‌اند و آن‌ها را با اموری بر اساس آنچه خداوند از آثار شگفت‌انگیز آن‌ها در حرکاتشان به آنان اطلاع داده، وصف کرده‌اند. پس از آن‌ها ثابت و منقلب و ذوالجسدین و غیره را شناختند. و علم اهل رصد به فلک اطلس ختم می‌شود. و در حقیقت، تنها به کواکب ختم می‌شود، زیرا حرکات کواکب و کواکب، افلاک خود را معین می‌کنند و اگر چنین نبود، تعداد آن‌ها شناخته نمی‌شد. اما فلک اطلس را از آن جهت که حساً درک کرده باشند، مانند درک افلاک کواکب، استدلال نکرده‌اند، بلکه دانسته‌اند که این افلاک جز در امری وجودی و فلکی مانند خودشان برش نمی‌خورند. پس آن را عقلاً اثبات کردند نه حساً. و آن را اطلس نامیدند، زیرا هیچ کوکبی در آن نیست که آن را برای حس معین کند. و این دلیل بر آنان با حرکت دورترین افلاک باطل می‌شود، زیرا حرکت آن موجود است و نزد آنان اصلاً در چیزی برش نمی‌خورد. پس ای صاحب رصد، چه می‌دانی، شاید این فلک مکوكب در «لا شیء» (هیچ) برش می‌خورد؟ و حکما منع نکرده‌اند که افلاک دیگری بالای فلک اطلس باشد، جز اینکه رصدگر به آن‌ها نرسیده است، زیرا چیزی نیست که بر آن‌ها دلالت کند، بلکه نزد آنان در حکم جواز هستند. اما گفتند: اگر فلکی در آنجا باشد، حتماً باید نفس و عقل داشته باشد. با این حال، ناگزیر باید انتهایی وجود داشته باشد. و از این فلک است که اختلاف میان ما و حکمای فلاسفه در ترتیب تکوین (آفرینش) رخ داده است. و آنان در مورد آنچه بالای اطلس است، یعنی کرسی و عرش، با ما نزاع نکردند و به جواز آن قائل شدند. پس ترتیب امر نزد ما پس از فلک مکوكب است. و این فلک هنگام خلق، مکوكب نبود، بلکه کواکب پس از آن در آن و در سایر سماوات ظاهر شدند. در آنجا بود که حرکت آنچه ذکر کردیم از این افلاک موجود چهارگانه که طبیعت در آن‌ها کامل شد و سلطان آن حساً ظاهر شد، پس از آنکه معقول بود، وجود داشت. زیرا معانی اصل اشیاء هستند. پس آن‌ها فی‌نفسه معانی معقول و غیبی هستند، سپس در حضرت حس، محسوس و در حضرت خیال، متخیّل ظاهر می‌شوند. و همان‌ها هستند، جز اینکه در هر حضرت بر حسب آن دگرگون می‌شوند، مانند آفتاب‌پرست که رنگ‌هایی را که بر آن قرار می‌گیرد، می‌پذیرد. اولین چیزی که ایجاد شد، زمین بود و آن نهایت خلأ (الخلأ) و دورترین کثافت‌ها و ظلمت‌هاست. و آن تا کنون همیشه در حال نزول است. و خلأ را پایانی نیست، زیرا امتدادی موهوم است نه در جسم. پس عالم به تمامه همیشه در حال نزول است در طلب مرکز. و این طلب، طلب معرفت است و مرکز آن چیزی است که امرش بر آن مستقر می‌شود و پس از آن طلبی نخواهد داشت. و این امر واقع نمی‌شود. پس نزول آن برای طلب، دائمی و مستمر است و از آن به طلب حق (الحق) تعبیر می‌شود. پس حق مطلوب اوست. و این طلب، تجلی (التجلي) را در آن اثر گذاشته که به آن عاشق شده است. پس او را با حرکتی عشقی می‌طلبد. و همین‌گونه است سایر متحرکات؛ حرکت آن‌ها تنها محبت و عشق است. و جز این صحیح نیست. و کسی که عاشق آن تجلی نباشد، که به جمال (الجمال) وصف شده است، و جمال معشوق بالذات است، اگر خداوند سبحان در صورت جمال تجلی نمی‌کرد، عالم ظاهر نمی‌شد. پس خروج عالم به هستی (الوجود) به واسطه آن عشق بود. اصل حرکت آن عشقی است و حال استمرار یافته است. پس حرکت عالم دائمی و بی‌نهایت است. و اگر امری وجود داشت که به آن پایان یابد و مرکز نامیده شود و نهایت به سوی آن باشد، عالم به ضرورت بر روی یکدیگر ساکن می‌شد و حرکت باطل می‌گشت. پس امداد باطل می‌شد و این به فنای عالم و از بین رفتن عین آن می‌انجامید. و امر بر خلاف این است. و تنها مردم و بیشتر خلق از حرکت عالم بی‌خبرند، زیرا عالم به تمامه متحرک است و ترتیب مشهود از دوری و نزدیکی بر حال خود باقی می‌ماند. به همین دلیل، این شهود باعث می‌شود که سکون زمین حول مرکز را تخیل کنند. سپس رکن آب را ایجاد کرد. و آن اولین موجود از ارکان بود. و ما زمین را به دلیل سفلی بودن مقدم ذکر کردیم. و آب اولین عناصر بود. آنچه از آن غلیظ شد، زمین بود. و آنچه از آن رقیق شد، هوا بود. سپس آنچه از آن رقیق‌تر شد، آتش بود و آن کره اثیر است. پس اصل عناصر نزد ما آب است. و برخی از اهل نظر در این فن با ما موافق بودند. اما مستند ما در آنچه ادعا می‌کنیم، از این و سایر علوم، کشف (الکشف) است. و ممکن است آن علوم از چیزهایی باشند که با نظر فکری درک می‌شوند. پس هر کس در نظر خود به صواب رسد، با اهل کشف موافق است و هر کس در نظر خود خطا کند، با اهل کشف مخالف است. و حکما در این مسئله بر شش مذهب هستند که پنج تای آن‌ها خطا و یکی صواب است و آن همان است که با کشف و تعریف الهی برای اهل خطاب او، از ملک و نبی و ولی، موافق است. و وجود این عناصر در برج سرطان بود. و هیچ برجی نیست مگر اینکه خداوند برای آن مدتی معلوم در ولایت قرار داده است، با مشارکت غیر در مدت آن. پس برای همه آن‌ها مدتی معلوم نزد ما وجود دارد که آن را عمر عالم می‌نامیم. پس چون مدت‌ها به پایان رسد، امر دوباره به حال خود از دوام باز می‌گردد. پس هرگز از حیث جوهر، عدم به آن نمی‌رسد و هیچ صورتی هرگز دو زمان باقی نمی‌ماند. پس خلق از حیث صورت در هر نفس در خلق جدیدی است که\nتکرار در آن نیست. اگر آن را شهود می‌کردی، امری عظیم می‌دیدی که منظره‌اش تو را به وحشت می‌انداخت و خوفی بر جوهر ذاتت به ارث می‌گذاشت. و اگر خداوند اهل کشف را با علم تأیید نمی‌کرد، از ترس سرگردان می‌شدند. پس چون عناصر، که ارکان چهارگانه هستند، محلی مهیا و مؤنث برای پذیرش تناسل و ولادت شدند، و احتراقات (سوختن‌ها) از عنصر آتش در رطوبات هوا و آب ظاهر شد، دودی از آن‌ها بالا رفت که اعظم (بزرگ‌تر) را می‌طلبید که فلک اعلی و اقصی است. پس فلک کواکب را یافت که مانع صعود آن به فلک اعلی می‌شود. پس آن دود بازگشت و برخی در برخی دیگر موج زد و متراکم شد.\nپس خداوند شکاف آن را با هفت آسمان باز کرد. سپس جرقه‌هایی از کره اثیر در آن دود پراکنده شدند. و آن جرقه‌ها مکان‌هایی را در آسمان‌ها و فلک مکوكب که دارای رطوبات طبیعی بودند، پذیرفتند. پس آن مکان‌ها به دلیل رطوباتی که در آن‌ها بود، به آن جرقه‌ها آویختند و مشتعل شدند. پس کواکب پدید آمدند. و جو روشن شد، همان‌گونه که خانه با چراغ روشن می‌شود. آیا نمی‌بینی که کسی که آتش‌زنه را می‌زند، جرقه سوزان را به آنچه از رطوبت در آن است، می‌آویزد و آن مشتعل می‌شود و از آن چراغ پدید می‌آید؟ به همین دلیل خداوند تعالی فرمود: (وَجَعَلْنَا الشَّمْسَ سِرَاجًا) [النبأ: ۱۳] (و خورشید را چراغی قرار دادیم) که عالم با آن روشن می‌شود و اشیائی که تاریکی آن‌ها را می‌پوشاند، با آن دیده می‌شوند. پس شب و روز با پدید آمدن کوکب خورشید و زمین پدید آمد. پس شب، تاریکی زمین است که حجاب نور خورشید است. و کواکب نزد ما همگی نورانی هستند و از خورشید مدد نمی‌گیرند، چنانکه برخی می‌پندارند. و ماه بر اصل خود هیچ نوری ندارد. خداوند نور آن را محو کرده است. و آن نوری که به آن نسبت داده می‌شود، همان چیزی است که بصر (چشم) از خورشید در آینه ماه، بر حسب مواجهه دیده‌ها با آن، به آن تعلق می‌گیرد. پس ماه، مجلای (محل تجلی) خورشید است و نه کم و نه زیاد از نور خورشید در آن نیست. سپس خداوند در هر فلک و آسمانی، عالمی از جنس طبیعت آن فلک مرتب کرد و آنان را ملائکه نامید، بر مقاماتی که خداوند آنان را بر آن آفریده است، از تسبیح و تهلیل و هرگونه ثنا بر خداوند تعالی. و از میان آنان ملائکه‌ای را مسخر کرد برای مصالح آنچه در عالم عناصر از مولدات (موجودات متولد شده) خلق می‌کند. و اینها سه عالم طبیعی هستند. و در هر عالم مولد از این سه، از نفس کلیه صاحب آلات، ارواحی جاری می‌شود که نفوس این مولدات هستند. با آن‌ها خالق و منشئ خود را می‌شناسند و با آن‌ها حیات در همه آن‌ها جاری شده است. و حق (الحق) با آن‌ها سخن گفته و آن‌ها را مکلف کرده است. و او رسول حق به سوی آن‌ها و دعوت‌کننده هر شخص از آن‌ها به سوی پروردگارش است. پس آنچه حیاتش پنهان است، جماد و نبات نامیده شد. و این دو مولد از هم جدا شدند و با نمو و غذا متمایز گشتند. پس در نامی (رشدکننده) آن نبات و در غیر نامی آن جماد گفته شد. و آنچه حیات و حسش ظاهر شد، حیوان نامیده شد. و حیات همه را فرا گرفته است. پس با زبانی خاص به آن جنس، به ثنای خالق خود نطق می‌کنند، از جایی که ما نمی‌شنویم. و خداوند امور را به فطرت به آنان آموخته است، از جایی که ما نمی‌دانیم. پس هیچ تر و خشکی، گرم و سردی، جماد و نباتی، و حیوانی نمانده است، مگر اینکه خداوند تعالی را با زبان خاص آن جنس تسبیح می‌گوید. و جن را از شعله آتش و انسان را از آنچه به ما گفته شده، خلق کرد. و ارواح را در همه دمید. و قوت‌ها (روزی‌ها) را که غذاهای این مولدات از انس و جن و حیوان دریایی و خشکی و هوایی هستند، مقدر کرد. و (وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا) [فصلت: ۱۲] (و در هر آسمانی امر آن را وحی کرد)، به واسطه آنچه خداوند در حرکات این کواکب و اقترانات (نزدیک شدن‌ها) و هبوط (پایین آمدن) و صعود (بالا رفتن) آن‌ها در خانه‌های نحوس و سعودشان به ودیعه نهاده است. و از حرکات آن‌ها و حرکات مافوق آن‌ها از افلاک، مولدات پدید آمدند. و از حرکات افلاک چهارگانه، ارکان پدید آمدند. و این خلاف چیزی است که غیر اهل کشف از متکلمین در این شأن به آن رفته‌اند. پس خداوند در خزانه‌های این کواکب که در افلاک هستند، علوم آنچه از آثار در عالم عنصری از تقلیب و تغییر رخ می‌دهد، به ودیعه نهاده است. پس آن‌ها اسرار الهی هستند که خداوند برای آن‌ها اهلی قرار داده است که آن را می‌شناسند، اما نه بر اساس علم قطعی، بلکه بر اساس تقریب. و امر فی‌نفسه صحیح است، جز اینکه ناظر از اهل این شأن ممکن است حق نظر را به طور کامل ادا نکند، به دلیل امری، خواه غفلت باشد یا غلط در عدد و مقدار که متوجه آن نشده است. پس حکم می‌کند و خطا می‌کند. پس خطا از نظر اوست نه از نفس امر. و گاهی نظر با علم موافق می‌شود و آنچه می‌گوید واقع می‌شود، اما او در آن بصیرت ندارد از حیث تعیین مسئله‌ای خاص. و عمرها برای درک این علم کافی نیست. پس اصل آن از نبوات (پیامبری‌ها) دانسته می‌شود. پس اولین کسی که شروع به تعلیم این علم به مردم کرد، ادریس (علیه السلام) بود از جانب خداوند. پس خداوند به او آموخت آنچه را که در هر آسمانی وحی کرده و آنچه را که در حرکت هر کوکبی قرار داده است. و اقترانات کواکب و مقادیر اقترانات و آنچه از امور مختلف بر حسب اقلیم‌ها و مزاج‌های قوابل (پذیرندگان) و مساقط نطفه‌های آن‌ها در اشخاص حیوان از آن‌ها پدید می‌آید، برای او بیان کرد. پس قرآن (تقدیر) یکی است و اثر آن در عالم عنصری بر حسب اقلیم و آنچه طبیعت آن می‌دهد، متفاوت است. پس شروط آن بسیار است که اهل آن شأن آن را می‌دانند. پس چون انبیاء میزان‌ها را به آنان دادند و مقادیر را به آنان آموختند، آنچه خداوند از امور و شئون در زمان دور پدید می‌آورد، دانستند. و از زمان دوری که اگر خداوند آنان را در آن به نفوسشان واگذار می‌کرد با حکم معتاد، تا آنکه تکراری بر آنان رخ دهد که عادتاً موجب قطع شود، و چه بسا امری که تکرار آن که موجب قطع ظنی به آن می‌شود، جز پس از هزاران سال ظاهر نمی‌شود. پس این سبب تعریف الهی بر زبان انبیاء (علیهم السلام) بود. پس مردم را به آنچه خداوند به آنان وحی کرده بود، آگاه ساختند، آنچه خداوند این کواکب مسخر را از حوادث بر آن امین قرار داده است. و اگر جاهلان\nمنکر این علم، قول خداوند تعالی را می‌دانستند: (وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ) [النحل: ۱۲] (و ستارگان مسخر به فرمان اویند)، چیزی از آنچه گفتند، نمی‌گفتند. پس آنان تسخیر (مسخر بودن) آن‌ها را ندانستند و اینکه آن‌ها همان‌گونه هستند که خداوند تعالی فرمود: (وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا) [الزخرف: ۳۲] (و برخی از آنان را بر برخی دیگر به درجاتی برتری دادیم تا برخی، برخی دیگر را به خدمت گیرند)، همان‌گونه که بادها، دریاها و کشتی‌ها را مسخر کرد، کواکب را نیز مسخر کرد. و آیا در این مسخرات از کواکب، افلاک، بادها، دریاها و جنبندگان و هر مسخری، عالمی به آنچه برای آن مسخر شده است، وجود دارد یا خیر؟ این را\nجز اهل طریق ما به طور خاص نمی‌دانند. قشیری حکایت کرده است که مردی شخصی را دید که بر الاغی سوار است و بر سر الاغ می‌زند. پس او را از این کار نهی کرد. الاغ به او گفت: او را واگذار، او بر سر خودش می‌زند. پس کسی که جزا را می‌شناسد، چگونه آنچه برای آن مسخر شده را نمی‌شناسد؟ و ما از این قبیل در جمادات و حیوانات بسیار دیده‌ایم. و کلام طولانی شد. و این مقدار در معرفت ترتیب عالم، که یکی از بخش‌های علوم این منزل است، کافی است. و خداوند حق می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 6
}