{
  "id": 486,
  "title": {
    "ar": "الباب السادس والثمانون وأربعمائة في معرفة حال قطب كان منزله ومن يَعْصِ الله ورَسُولَهُ فَقَدْ ضَلَّ ضَلالًا مُبِيناً",
    "en": "Chapter Four Hundred and Eighty-Six: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station (منزل) was: <<And whoever disobeys Allah and His Messenger has certainly strayed with a clear straying>>.",
    "ur": "باب چار سو چھیاسی (۴۸۶): ایک قطب (قطب) کے حال کی معرفت (معرفۃ) کے بیان میں جس کا روحانی منزل (منزل) یہ تھا: \"اور جو کوئی اللہ اور اس کے رسول کی نافرمانی کرے تو وہ یقیناً کھلی گمراہی میں بھٹک گیا\" (وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُّبِينًا)۔",
    "fa": "باب چهارصد و هشتاد و ششم در معرفت حال قطبی که منزل او این بود: «و هر کس خدا و پیامبرش را نافرمانی کند، قطعاً به گمراهی آشکاری دچار شده است.» (ومن يَعْصِ الله ورَسُولَهُ فَقَدْ ضَلَّ ضَلالًا مُبِيناً)"
  },
  "content": {
    "ar": "## «الباب السادس والثمانون وأربعمائة في معرفة حال قطب كان منزله ومن يَعْصِ الله ورَسُولَهُ فَقَدْ ضَلَّ ضَلالًا مُبِيناً»\n\n\n> ألا إن الرسول هو الذي قد *** حباه الله بالشرف التليد\n\n\n> فمن يعص الرسول فقد عصاه *** وحيره بتفصيل الوجود\n\n\n> فرام به فلم يقدر عليه *** لما في الرب من نعت العبيد\n\n\n> فلم يعلم به إذ لم يجده *** يميزه له حال الشهود\n\n\n> فيركب تارة متن اعتراف *** ويركب تارة متن الجحود\n\n\n> فسبحان المخصص كل حزب *** بآلام ولذات المزيد\n\n\n### [عصيان الرسول عصيان الله‏]\n\n\nقال الله تعالى من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله لأنه لا ينطق إلا عن الله بل لا ينطق إلا بالله بل لا ينطق إلا لله منه فإنه صورته وما ورد ومن يعص الرسول فقد عصى الله كما أنزله في الطاعة لأن طاعة المخلوق لله ذاتية وعصيانه بالواسطة فلو أنزل هنا الرسول كما أنزله في الطاعة لم يكن إلها وهو إله فلا يعصى الا بحجاب وليس الحجاب سوى عين الرسول ونحن اليوم أبعد في المعصية للرسول من أصحابه إلى من دونهم إلينا فنحن ما عصينا إلا أولي أمرنا في وقتنا وهم العلماء منا بما أمر الله به ونهى عنه فنحن أقل مؤاخذة وأعظم أجرا لأن للواحد منا أجر خمسين ممن يعمل بعمل الصحابة\n\n\nيقول صَلَّى اللهُ عَليهِ وسَلَّم للواحد منهم أجر خمسين يعملون مثل عملكم‏\n\n\nفاجعل بالك لكونه لم يقل منكم ثم قال تعالى أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ فذكر الله تعالى وذكر الرسول وذكرنا أعني أولي الأمر منا وهم الذين قدمهم الله علينا وجعل زمامنا بأيديهم ولم يكن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقدم في السرايا وغيرها إلا من هو أعلمهم وما كان أعلمهم إلا من كان أكثرهم قرآنا فكان يقدمه على الجيش ويجعله أميرا وما خص الاسم الله من غيره من الأسماء في قوله فَقَدْ أَطاعَ الله إذ كان الله هو الاسم الجامع فله معاني جميع الأسماء الإلهية كما هو للتجلي جميع الصور كذلك الخليفة وهو الرسول وأولو الأمر منا لا بد أن يظهروا في جميع الصور التي تحتاج إليها الرعايا فمن بايع الإمام فإنما يبايع الله تعالى ولا تصح المعصية إلا بعد العقد وقد وقع في أخذ الميثاق والعهد في قوله تعالى أَ لَسْتُ بِرَبِّكُمْ ثم ألقمه الحجر الأسود وأمر بتقبيله تذكرة وأخبر بلسان الرسول أن الحجر يمينه فأمر ببيعة محمد صَلَّى اللهُ عَليهِ وسَلَّم وقال في الذين يبايعونه إِنَّما يُبايِعُونَ الله فأنزله منزلته ولم ينزل الحجر منزلته بالذكر فعظم قدر ابن آدم‏\n\n\n> قبل فإن يمين العهد في الحجر *** وأين رتبته من رتبة البشر\n\n\n> إن المبايع من تعنو الوجوه له *** الواحد الأحد القيوم بالصور\n\n\n> إن شاء في ملك إن شاء في بشر *** إن شاء في شجر إن شاء في حجر\n\n\n> فما تقيده ذات ولا عرض *** وما له في وجود الكون من أثر\n\n\n> بل الوجود هو الحق الصريح فلا *** تروه غيرا فيدعوكم إلى الغير\n\n\n> هو المؤثر والآثار قائمة *** بالحق فيما يراه فيه ذو بصر\n\n\n> إن لم يكن هكذا أمر الوجود وما *** تضمن الكون من نفع ومن ضرر\n\n\n> فما تكون لحق صورة أبدا *** ولا تضاف إليه آخر العمر\n\n\n> هو المطاع فما تعصى أوامره *** والخلق والأمر في الأنثى وفي الذكر\n\n\n> بالشمس يظهر ما في البدر من صفة *** فأنت شمس وعين الحق في القمر\n\n\n> وليس في البدر ما الأبصار تدركه *** لكنه هكذا تدركه في النظر\n\n\n> فكوننا في وجود الحق مغلطة *** فالأمر أغمض بالبرهان والخبر\nسُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وسَلامٌ عَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ ف لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ وذلك هو الفضل المبين أقول له أنت يقول لي أنت أقول له فإنا يقول لي لا بل أنا فأقول له فكيف الأمر فيقول كما رأيت فأقول فما رأيت إلا الحيرة فلا تحصيل مني ولا توصيل منك فيقول قد أوصلتك فأقول فما بيدي شي‏ء فيقول هو ذاك الذي أوصلت فعليه فاعتمد وبالله فاتئد\n\n\n> فما في الكون من يدري سواه *** ومن يدرك سواه فما دراه‏\n\n\n> ومن يدرك مع الخلاق خلقا *** فإن الله من جهل حماه‏\n\n\n> ومن يدرك مع المخلوق حقا *** يراه وما يراه فما تراه‏\n\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 486, Concerning the Gnosis of the State of a Pole (قطب) whose station was: \"And whoever disobeys Allah and His Messenger has certainly strayed into manifest error.\"\n\nBehold, the Messenger is indeed the one whom\nAllah has endowed with ancient, inherited nobility.\n\nSo whoever disobeys the Messenger has disobeyed Him,\nAnd confused Him by detailing Existence (الوجود).\n\nHe sought Him through him but could not grasp Him,\nDue to what the Lord possesses of the attributes of the servants (العبيد).\n\nSo he did not know Him, since he did not find Him\nDistinguishing Him for him in the state of Witnessing (الشهود).\n\nThus, sometimes he rides the path of affirmation (اعتراف),\nAnd sometimes he rides the path of denial (الجحود).\n\nGlory be to the One who specifies every faction\nWith pains and with increasing pleasures.\n\n[Disobedience to the Messenger is Disobedience to Allah]\n\nAllah the Exalted said: <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله>> (Whoever obeys the Messenger has obeyed Allah). This is because he does not speak except from Allah, rather he does not speak except by Allah, rather he does not speak except for Allah, from Him, for he is His form (صورته). And what has been revealed is: \"And whoever disobeys the Messenger has disobeyed Allah,\" just as He revealed it concerning obedience. This is because the obedience of the creature to Allah is essential (ذاتية), while his disobedience is through an intermediary (الواسطة). If the Messenger had been mentioned here (in the verse about disobedience) just as he was mentioned in the verse about obedience, He (Allah) would not have been God (إلها), yet He is God. Therefore, He is not disobeyed except by a veil (حجاب). And the veil is none other than the very essence (عين) of the Messenger.\n\nAnd we today are further removed in disobedience to the Messenger than his Companions, down through those who followed them, until us. Thus, we have only disobeyed those in authority (أولي أمرنا) in our time, who are the scholars (العلماء) among us regarding what Allah has commanded and forbidden. Therefore, we are less accountable and greater in reward, because the reward for one of us is equal to fifty of those who performed the deeds of the Companions.\n\nThe Prophet, peace and blessings be upon him, said: \"The reward for one of them is equal to fifty who perform deeds like yours.\"\n\nPay attention to the fact that he did not say, \"fifty of you.\" Then Allah the Exalted said: <<أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ>> (Obey Allah and obey the Messenger and those in authority among you). So He mentioned Allah the Exalted, and He mentioned the Messenger, and He mentioned us—meaning those in authority (أولي الأمر) among us—who are those whom Allah has placed ahead of us and put our reins in their hands. The Messenger of Allah, peace and blessings be upon him, would not appoint anyone to lead expeditions (السرايا) or other matters except the one who was most knowledgeable among them. And the most knowledgeable among them was none other than the one who had the most Quran, so he would place him in command of the army and make him the leader (أميرا).\n\nThe Name Allah was not specified apart from the other Names in His saying, \"has obeyed Allah,\" since Allah is the Comprehensive Name (الاسم الجامع), possessing the meanings of all the Divine Names (الأسماء الإلهية). Just as He (Allah) is the Theophany (التجلي) of all forms, so too must the Vicegerent (الخليفة)—who is the Messenger and those in authority among us—manifest in all the forms required by the subjects.\n\nThus, whoever pledges allegiance (بايع) to the Imam is only pledging allegiance to Allah the Exalted. Disobedience is not valid except after the covenant (العقد). This occurred when the covenant (الميثاق) and pledge (العهد) were taken in His saying: <<أَ لَسْتُ بِرَبِّكُمْ>> (Am I not your Lord?). Then He made the Black Stone (الحجر الأسود) swallow it (the covenant) and commanded that it be kissed as a reminder. He informed us through the tongue of the Messenger that the Stone is His right hand. So He commanded the pledge of allegiance to Muhammad, peace and blessings be upon him, and said concerning those who pledge allegiance to him: <<إِنَّما يُبايِعُونَ الله>> (Indeed, they are only pledging allegiance to Allah). Thus, He placed him (Muhammad) in His station, but He did not place the Stone in His station by mentioning it (in the same way). Therefore, the status of the son of Adam is magnified.\n\nSay: Indeed, the right hand of the covenant is in the Stone,\nBut where is its rank compared to the rank of humanity (البشر)?\n\nThe One to whom the pledge is made, before whom faces bow,\nIs the One, the Unique, the Self-Subsisting (القيوم) through the forms.\n\nIf He wills, in an angel; if He wills, in a human;\nIf He wills, in a tree; if He wills, in a stone.\n\nNo essence (ذات) confines Him, nor accident (عرض),\nAnd He has no trace in the existence of the cosmos.\n\nRather, Existence (الوجود) is the manifest Reality (الحق الصريح), so do not\nSee Him as other, lest He call you to the other.\n\nHe is the Effector, and the effects subsist\nBy the Real (الحق) in what the insightful one sees therein.\n\nIf the matter of Existence were not thus, and what\nThe cosmos contains of benefit and harm,\n\nThen there would never be a form for the Real,\nNor would it be attributed to Him until the end of time.\n\nHe is the One obeyed, whose commands are not disobeyed,\nAnd creation (الخلق) and command (الأمر) reside in the female and the male.\n\nBy the sun, what is in the full moon of attribute (صفة) is manifested,\nSo you are the sun, and the essence (عين) of the Real is in the moon.\n\nThere is nothing in the full moon that the eyes perceive,\nBut this is how they perceive it in contemplation (النظر).\n\nThus, our being in the Existence of the Real is a fallacy (مغلطة),\nFor the matter is more subtle, by proof and by report.\n\n<<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ * وسَلامٌ عَلَى الْمُرْسَلِينَ * والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (Exalted is your Lord, the Lord of Might, above what they describe. And peace be upon the Messengers. And praise be to Allah, Lord of the worlds). And <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ>> (There is nothing like unto Him, and He is the All-Hearing, the All-Seeing). And that is the manifest grace.\n\nI say to Him, \"You.\" He says to me, \"You.\" I say to Him, \"Then we.\" He says to me, \"No, rather I.\" So I say to Him, \"Then how is the matter?\" He says, \"As you have seen.\" So I say, \"I have seen nothing but confusion (الحيرة). There is no attainment from me, nor conveyance from You.\" He says, \"I have indeed conveyed you.\" So I say, \"I have nothing in my hand.\" He says, \"That is precisely what I conveyed. Therefore, rely upon it, and be patient through Allah.\"\n\nThere is none in the cosmos who knows other than Him,\nAnd whoever perceives other than Him has not known Him.\n\nAnd whoever perceives a creature alongside the Creator,\nThen Allah has protected him from ignorance.\n\nAnd whoever perceives the Real (الحق) alongside the creature (المخلوق),\nHe sees Him, and what he does not see, you do not see.\n\n<<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو چھیاسی: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور جو اللہ اور اس کے رسول کی نافرمانی کرے تو وہ کھلی گمراہی میں پڑ گیا\" (وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُّبِينًا)۔\n\nخبردار! رسول ہی وہ ہستی ہے، جسے اللہ نے قدیم شرف سے نوازا ہے۔\nپس جو رسول کی نافرمانی کرتا ہے، اس نے ذات حق (الحق) کی نافرمانی کی، اور اسے ہستی (الوجود) کی تفصیل میں حیران کر دیا۔\nاس نے اس کے ذریعے ذات حق کو چاہا مگر اس پر قادر نہ ہو سکا، کیونکہ رب میں بندوں کی صفت موجود ہے۔\nپس اس نے ذات حق کو نہ جانا جب اسے نہ پایا، جو شہود (الشہود) کی حالت میں اس کے لیے امتیاز کرے۔\nتو وہ کبھی اقرار کی راہ پر سوار ہوتا ہے، اور کبھی انکار کی راہ پر سوار ہوتا ہے۔\nپس پاک ہے وہ ذات جس نے ہر گروہ کو مزید دکھوں اور لذتوں کے ساتھ خاص کیا۔\n\n### رسول کی نافرمانی، اللہ کی نافرمانی ہے (عصيان الرسول عصيان الله‏)\n\nاللہ تعالیٰ نے فرمایا: \"جس نے رسول کی اطاعت کی، اس نے درحقیقت اللہ کی اطاعت کی\" (مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ)۔ کیونکہ وہ صرف اللہ کی طرف سے ہی نہیں بولتا، بلکہ وہ صرف اللہ کے ذریعے ہی بولتا ہے، بلکہ وہ صرف اللہ کے لیے ہی بولتا ہے، اسی کی طرف سے۔ پس وہ (رسول) ذات حق (الحق) کی صورت ہے۔ اور جو بات وارد ہوئی ہے کہ \"اور جو رسول کی نافرمانی کرے، اس نے اللہ کی نافرمانی کی\" (وَمَن يَعْصِ الرَّسُولَ فَقَدْ عَصَى اللَّهَ)، جیسا کہ اسے اطاعت میں نازل کیا گیا، اس کی وجہ یہ ہے کہ مخلوق کی اللہ کے لیے اطاعت ذاتی ہے، اور اس کی نافرمانی واسطے کے ذریعے ہوتی ہے۔ اگر یہاں رسول کو اسی طرح نازل کیا جاتا جیسے اطاعت میں نازل کیا گیا، تو وہ معبود نہ ہوتا، حالانکہ وہ معبود ہے۔ پس اس کی نافرمانی صرف حجاب کے ذریعے ہی کی جاتی ہے، اور حجاب رسول کی عین ذات کے سوا کچھ نہیں۔ اور ہم آج رسول کی نافرمانی میں ان کے صحابہ سے لے کر ان کے بعد والوں تک، اور ان سے لے کر ہم تک، زیادہ دور ہیں۔ پس ہم نے صرف اپنے وقت کے اولی الامر کی نافرمانی کی ہے، اور وہ ہم میں سے وہ علماء ہیں جو اللہ کے امر و نہی کو جانتے ہیں۔ پس ہم پر مؤاخذہ کم ہے اور اجر زیادہ ہے، کیونکہ ہم میں سے ایک شخص کے لیے پچاس ایسے لوگوں کا اجر ہے جو صحابہ جیسا عمل کرتے ہیں۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"ان میں سے ایک کے لیے پچاس کا اجر ہے جو تمہارے جیسا عمل کرتے ہیں\" (لِلْوَاحِدِ مِنْهُمْ أَجْرُ خَمْسِينَ يَعْمَلُونَ مِثْلَ عَمَلِكُمْ)۔\n\nپس اس بات پر توجہ دو کہ آپ صلی اللہ علیہ وسلم نے \"تم میں سے\" نہیں فرمایا۔ پھر اللہ تعالیٰ نے فرمایا: \"اللہ کی اطاعت کرو، اور رسول کی اطاعت کرو، اور اپنے میں سے اولی الامر کی\" (أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ)۔ پس اللہ تعالیٰ نے اپنا ذکر کیا، اور رسول کا ذکر کیا، اور ہمارا ذکر کیا، یعنی ہم میں سے اولی الامر کا۔ اور وہ وہی ہیں جنہیں اللہ نے ہم پر مقدم کیا اور ہماری باگ ڈور ان کے ہاتھ میں دی۔ اور رسول اللہ صلی اللہ علیہ وسلم سریوں اور دیگر معاملات میں صرف اسی کو آگے بڑھاتے تھے جو ان میں سب سے زیادہ عالم ہوتا تھا، اور ان میں سب سے زیادہ عالم وہی ہوتا تھا جو سب سے زیادہ قرآن جانتا تھا۔ پس آپ صلی اللہ علیہ وسلم اسے لشکر پر مقدم کرتے اور امیر بناتے تھے۔ اور اللہ نے اپنے قول \"تو اس نے درحقیقت اللہ کی اطاعت کی\" (فَقَدْ أَطَاعَ اللَّهَ) میں اسم \"اللہ\" کو دوسرے اسماء سے خاص نہیں کیا، کیونکہ \"اللہ\" اسم جامع ہے، پس اس میں تمام الٰہی اسماء کے معانی شامل ہیں، جس طرح ظہور الٰہی (التجلی) کے لیے تمام صورتیں ہیں۔ اسی طرح خلیفہ، جو کہ رسول ہے، اور ہم میں سے اولی الامر، ان کا بھی ضروری ہے کہ وہ ان تمام صورتوں میں ظاہر ہوں جن کی رعایا کو ضرورت ہے۔ پس جس نے امام کی بیعت کی، اس نے درحقیقت اللہ تعالیٰ کی بیعت کی۔ اور نافرمانی (المعصيۃ) عقد کے بعد ہی صحیح ہوتی ہے۔ اور یہ میثاق اور عہد لینے میں واقع ہوا، اللہ تعالیٰ کے اس قول میں: \"کیا میں تمہارا رب نہیں ہوں؟\" (أَلَسْتُ بِرَبِّكُمْ)۔ پھر اس نے حجر اسود کو وہ (عہد) پہنا دیا اور یاد دہانی کے طور پر اسے چومنے کا حکم دیا۔ اور رسول کی زبان سے خبر دی کہ حجر اسود اس کا دایاں ہاتھ ہے۔ پس محمد صلی اللہ علیہ وسلم کی بیعت کا حکم دیا، اور ان لوگوں کے بارے میں جو آپ کی بیعت کرتے ہیں، فرمایا: \"وہ صرف اللہ کی بیعت کرتے ہیں\" (إِنَّمَا يُبَايِعُونَ اللَّهَ)۔ پس اللہ نے آپ کو اپنا مقام عطا کیا، لیکن حجر اسود کو ذکر کے ذریعے اپنا مقام عطا نہیں کیا۔ پس ابن آدم کا مرتبہ عظیم ہوا۔\n\nکہو! بے شک عہد کا دایاں ہاتھ حجر اسود میں ہے، مگر اس کا مرتبہ بشر کے مرتبے سے کہاں؟\nجس کی بیعت کی جاتی ہے، وہ ہے جس کے سامنے چہرے جھکتے ہیں، وہ واحد، احد، جو صورتوں کے ساتھ قائم ہے۔\nاگر چاہے تو فرشتے میں، اگر چاہے تو بشر میں، اگر چاہے تو درخت میں، اگر چاہے تو پتھر میں۔\nپس اسے نہ کوئی ذات مقید کرتی ہے اور نہ کوئی عرض، اور ہستی (الوجود) میں اس کا کوئی اثر نہیں۔\nبلکہ ہستی (الوجود) ہی ذات حق (الحق) صریح ہے، پس اسے غیر نہ دیکھو، ورنہ وہ تمہیں غیر کی طرف بلائے گا۔\nوہ مؤثر ہے اور آثار قائم ہیں، ذات حق (الحق) کے ساتھ اس میں جسے صاحب بصیرت دیکھتا ہے۔\nاگر ہستی (الوجود) کا معاملہ ایسا نہ ہو، اور جو کچھ کائنات نفع و نقصان سے گھیرے ہوئے ہے،\nتو ذات حق (الحق) کے لیے کبھی کوئی صورت نہ ہو گی، اور نہ ہی وہ آخر عمر تک اس کی طرف منسوب ہو گی۔\nوہ مطاع ہے، پس اس کے احکام کی نافرمانی نہیں کی جاتی، اور خلق اور امر مؤنث اور مذکر میں ہے۔\nسورج کے ذریعے وہ صفت ظاہر ہوتی ہے جو چاند میں ہے، پس تو سورج ہے اور ذات حق (الحق) کی عین چاند میں ہے۔\nاور چاند میں وہ نہیں ہے جسے آنکھیں ادراک کرتی ہیں، لیکن نظر میں اسے اسی طرح ادراک کرتی ہیں۔\nپس ذات حق (الحق) کی ہستی (الوجود) میں ہمارا ہونا ایک مغالطہ ہے، لہٰذا یہ معاملہ دلیل اور خبر کے ذریعے زیادہ پوشیدہ ہے۔\n\n\"پاک ہے تیرا رب، عزت کا رب، ان چیزوں سے جو وہ بیان کرتے ہیں، اور سلام ہو رسولوں پر، اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے\" (سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وَسَلَامٌ عَلَى الْمُرْسَلِينَ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)۔ \"اس جیسی کوئی چیز نہیں، اور وہ سننے والا، دیکھنے والا ہے\" (لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ)۔ اور یہی وہ کھلا فضل ہے۔ میں اس سے کہتا ہوں: \"تو\"، وہ مجھ سے کہتا ہے: \"تو\"۔ میں اس سے کہتا ہوں: \"تو پھر ہم؟\" وہ مجھ سے کہتا ہے: \"نہیں، بلکہ میں\"۔ میں اس سے کہتا ہوں: \"تو پھر معاملہ کیسا ہے؟\" وہ کہتا ہے: \"جیسا تو نے دیکھا\"۔ میں کہتا ہوں: \"میں نے تو صرف حیرت دیکھی ہے، نہ مجھ سے کوئی حصول ہے اور نہ تیری طرف سے کوئی ایصال\"۔ وہ کہتا ہے: \"میں نے تجھے پہنچا دیا ہے\"۔ میں کہتا ہوں: \"تو میرے ہاتھ میں کچھ نہیں\"۔ وہ کہتا ہے: \"یہی وہ ہے جو میں نے پہنچایا ہے، پس اسی پر بھروسہ کر اور اللہ کے ساتھ ٹھہرا رہ۔\"\n\nپس کائنات میں اس کے سوا کوئی نہیں جانتا، اور جو اس کے سوا کسی کو ادراک کرتا ہے، اس نے اسے نہیں جانا۔\nاور جو خالق کے ساتھ مخلوق کو ادراک کرتا ہے، تو بے شک اللہ نے اسے جہالت سے بچا لیا ہے۔\nاور جو مخلوق کے ساتھ ذات حق (الحق) کو ادراک کرتا ہے، وہ اسے دیکھتا ہے، اور جسے وہ نہیں دیکھتا، تو وہ اسے نہیں دیکھتا۔\n\n\"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و هشتاد و ششم در معرفت حال قطبی که منزلگاه او این آیه بود: «و هر کس خدا و پیامبرش را نافرمانی کند، قطعاً به گمراهی آشکاری دچار شده است.» (وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُّبِينًا)\n\nبدانید که رسول، اوست که خداوند او را به شرف دیرینه بخشیده است.\nپس هر که رسول را نافرمانی کند، او را نافرمانی کرده و او را با تفصیل هستی (الوجود) متحیر ساخته است.\nپس قصد او کرد، اما نتوانست بر او دست یابد، به سبب آنچه در پروردگار از وصف بندگان است.\nپس او را نشناخت، زیرا او را نیافت که حال شهود (الشهود) برایش تمایز قائل شود.\nپس گاهی بر مرکب اعتراف سوار می‌شود و گاهی بر مرکب انکار سوار می‌شود.\nپس منزه است آنکه هر گروهی را به دردها و لذت‌های فزون‌تر اختصاص داده است.\n\n### [نافرمانی رسول، نافرمانی خداست]\n\nخداوند متعال فرمود: «هر کس از پیامبر اطاعت کند، قطعاً از خدا اطاعت کرده است» (مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ). زیرا او سخن نمی‌گوید مگر از جانب خدا، بلکه سخن نمی‌گوید مگر به واسطه خدا، بلکه سخن نمی‌گوید مگر برای خدا و از او؛ چرا که او صورت حق است و آنچه وارد شده است [همین را تأیید می‌کند]. و هر کس پیامبر را نافرمانی کند، قطعاً خدا را نافرمانی کرده است، همان‌گونه که در باب اطاعت نازل فرموده است. زیرا اطاعت مخلوق برای خدا ذاتی است و نافرمانی او با واسطه است. پس اگر در اینجا [در آیه نافرمانی] رسول را همان‌گونه که در آیه اطاعت نازل کرد، نازل می‌کرد، او خدا نبود، در حالی که او [خدا] اله است و نافرمانی نمی‌شود مگر به حجاب، و حجاب چیزی جز عین رسول نیست.\n\nو ما امروز در نافرمانی رسول، دورتر از اصحاب او تا کسانی که پایین‌تر از ایشان هستند و به ما می‌رسند، هستیم. پس ما نافرمانی نکردیم مگر اولی‌الامر خود در زمانمان را، و آنان علمای ما هستند در آنچه خداوند به آن امر کرده و از آن نهی نموده است. پس ما کمتر مورد مؤاخذه قرار می‌گیریم و پاداش بزرگ‌تری داریم، زیرا برای هر یک از ما پاداش پنجاه نفر از کسانی است که عمل صحابه را انجام می‌دهند.\n\nپیامبر (صلی الله علیه و سلم) می‌فرماید: «برای یکی از ایشان پاداش پنجاه نفر است که مانند عمل شما کار می‌کنند.»\n\nپس توجه کن که او نگفت: «از شما». سپس خداوند متعال فرمود: «از خدا اطاعت کنید و از پیامبر و اولی‌الامر خودتان اطاعت کنید» (أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ). پس خداوند متعال را ذکر کرد و رسول را ذکر کرد و ما را ذکر کرد، یعنی اولی‌الامر ما را، و آنان کسانی هستند که خداوند ایشان را بر ما مقدم داشته و زمام ما را به دست آنان قرار داده است. و رسول خدا (صلی الله علیه و سلم) در سریه‌ها و غیر آن، جز کسی که داناترینشان بود، کسی را مقدم نمی‌داشت، و داناترینشان کسی نبود جز آنکه بیشترین قرآن را حفظ داشت، پس او را بر سپاه مقدم می‌داشت و امیر قرار می‌داد.\n\nو اسم «الله» را از دیگر اسماء در قول خود: «فَقَدْ أَطَاعَ اللَّهَ» (قطعاً از خدا اطاعت کرده است) تخصیص نداد، زیرا «الله» اسم جامع است و معانی همه اسماء الهی را در بر دارد. همان‌گونه که برای تجلی (التجلی) همه صور است، خلیفه نیز که رسول و اولی‌الامر ماست، ناگزیر باید در همه صورت‌هایی که رعایا به آن نیاز دارند، ظاهر شود. پس هر کس با امام بیعت کند، در حقیقت با خداوند متعال بیعت کرده است، و نافرمانی صحیح نیست مگر پس از پیمان.\n\nو این [پیمان] در گرفتن میثاق و عهد در قول خداوند متعال واقع شده است: «آیا من پروردگار شما نیستم؟» (أَلَسْتُ بِرَبِّكُمْ). سپس آن را به حجرالأسود القا کرد و به بوسیدن آن امر نمود به عنوان یادآوری، و به زبان رسول خبر داد که حجر، دست راست اوست. پس به بیعت محمد (صلی الله علیه و سلم) امر کرد و درباره کسانی که با او بیعت می‌کنند فرمود: «در حقیقت با خدا بیعت می‌کنند» (إِنَّمَا يُبَايِعُونَ اللَّهَ). پس او را در منزلت خود نازل کرد و حجر را با ذکر [این منزلت] نازل نکرد. پس قدر و منزلت فرزند آدم بزرگ داشته شد.\n\nبگو: دست راست عهد در حجر است، اما رتبه آن کجا و رتبه بشر کجا؟\nبیعت‌شونده کسی است که چهره‌ها برای او خضوع می‌کنند، یگانه، یکتا، قیوم به واسطه صورت‌ها.\nاگر بخواهد در فرشته است، اگر بخواهد در بشر است، اگر بخواهد در درخت است، اگر بخواهد در سنگ است.\nپس نه ذاتی او را محدود می‌کند و نه عرضی، و او در هستی (الوجود) کائنات اثری ندارد.\nبلکه هستی (الوجود) همان حق (الحق) صریح است، پس او را غیر نبینید که شما را به سوی غیر فرا می‌خواند.\nاوست مؤثر و آثار به واسطه حق (الحق) در آنچه صاحب بصیرت در آن می‌بیند، قائم هستند.\nاگر امر هستی (الوجود) و آنچه کائنات از نفع و ضرر در بر دارند، این‌گونه نباشد،\nپس هرگز صورتی برای حق (الحق) نخواهد بود و تا پایان عمر به او نسبت داده نخواهد شد.\nاوست که اطاعت می‌شود و اوامرش نافرمانی نمی‌شود، و خلق و امر در مؤنث و مذکر است.\nبا خورشید آنچه در ماه از صفت است، ظاهر می‌شود؛ پس تو خورشیدی و عین حق (الحق) در ماه است.\nو در ماه آنچه دیده‌ها درک می‌کنند، نیست، اما در نظر این‌گونه درک می‌شود.\nپس بودن ما در هستی (الوجود) حق (الحق) یک مغالطه است، و امر با برهان و خبر پیچیده‌تر است.\n\n«منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند، و سلام بر فرستادگان، و ستایش از آنِ خداست که پروردگار جهانیان است.» (سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وسَلامٌ عَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ). پس «چیزی مانند او نیست و او شنوای بیناست» (لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ). و این همان فضل آشکار است. به او می‌گویم: تو، او به من می‌گوید: تو. به او می‌گویم: پس ما، او به من می‌گوید: نه، بلکه من. پس می‌گویم: پس امر چگونه است؟ می‌گوید: همان‌گونه که دیدی. پس می‌گویم: جز حیرت ندیدم، نه تحصیلی از جانب من است و نه توصیلی از جانب تو. می‌گوید: تو را رساندم. پس می‌گویم: چیزی در دست من نیست. می‌گوید: همان است که رساندم، پس بر آن اعتماد کن و به خدا آرام گیر.\n\nپس در کائنات کسی نیست که جز او بداند، و هر کس جز او را درک کند، او را نشناخته است.\nو هر کس با خالق، مخلوقی را درک کند، خداوند او را از جهل حفظ کرده است.\nو هر کس با مخلوق، حق (الحق) را درک کند، او را می‌بیند، و آنچه را نمی‌بیند، تو نمی‌بینی.\n\nو خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}