{
  "id": 237,
  "title": {
    "ar": "الباب السابع والثلاثون ومائتان في الوجود",
    "en": "Chapter 237: On Being",
    "ur": "باب نمبر دو سو سینتیس: ہستی (الوجود) کے بیان میں۔",
    "fa": "باب دویست و سی و هفتم در هستی (الوجود)"
  },
  "content": {
    "ar": "## «الباب السابع والثلاثون ومائتان في الوجود»\n\n\n> وجود الحق عين وجود وجدي *** فإني بالوجود فنيت عنه‏\n\n\n> وحكم الوجد أفنى الكل عني *** ولا يدرى لعين الوجد كنه‏\n\n\n> ووجدان الوجود بكل وجه *** بحال أو بلا حال فمنه‏\n### [أن الوجود عند القوم وجدان الحق في الوجد]\n\n\nاعلم أن الوجود عند القوم وجدان الحق في الوجد يقولون إذا كنت صاحب وجد ولم يكن في تلك الحال الحق مشهودا لك وشهوده هو الذي يفنيك عن شهودك وعن شهودك الحاضرين فلست بصاحب وجد إذ لم تكن صاحب وجود للحق فيه واعلم أن وجود الحق في الوجد ما هو معلوم فإن الوجد مصادفة ولا يدرى بما تقع المصادفة وقد يجي‏ء بأمر آخر فلما كان حكمه غير مرتبط بما يقع به السماع كان وجود الحق فيه على نعت مجهول فإذا رأيتم من يقرر الوجد على حكم ما عينه السماع المقيد والمطلق فما عنده خبر بصورة الوجد وإنما هو صاحب قياس في الطريق وطريق الله لا تدرك بالقياس فإنه كل يوم في شأن وكل نفس في استعداد فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ إِنَّ الله يَعْلَمُ وأَنْتُمْ لا تَعْلَمُونَ واعلم أنه إنما اختلف وجود الحق في الوجد عند الواجدين لحكم الأسماء الإلهية ولحكم الاستعدادات الكونية فكل نفس من الكون له استعداد لا يكون لغيره وصاحب النفس بفتح الفاء هو الموصوف بالوجد فيكون وجده بحسب استعداده والأسماء الإلهية ناظرة رقيبة وليس بيد الكون من الله إلا نسب أسمائه ونسب عنايته فوجود الحق في الوجد بحسب الاسم الإلهي الذي ينظر إليه والأسماء الإلهية راجعة إلى نفس الحق وقد شهد روح الله بشهادة تعم الكون في الله فقال تَعْلَمُ ما في نَفْسِي ولا أَعْلَمُ ما في نَفْسِكَ على الوجهين الوجه الواحد أن تكون النفس هنا نفس عيسى عينه أو تكون نفس الحق فإذا جهل العبد ما هي عليه نفسه من حكم الاستعداد الذي به يقبل الوجود الحق الخاص فهو بما ينظر إليه من الأسماء الإلهية في المستأنف أجهل فإذا ظهر لصاحب الوجد وجود الحق عند ذلك الظهور يعلم ما تجلى له من الأسماء فيخبر عند رجوعه عن وجود معين وشهود محقق وأما غير صاحب الوجد فحكمه بحسب الحال التي يقام فيها والضابط لباب العلم بالله أنه لا يعلم شي‏ء من ذلك إلا بإعلام الله في المستأنف وأما في الحال والماضي فإعلام الله به وقوعه مشهود المن وقع به عن ذوق لا عن نقل إلا أن يكون الناقل مقطوعا بصدقه ويكون القول أيضا في الباب نصا جليا لا يحتمل إن لم يكن بهذه المثابة وإلا فلا يعلم أصلا وإن وقع العلم به من شخص في وقت فبحكم المصادفة ومثل هذا لا يسمى علما عند أحد من أهل النظر وإن كان الشارع قد سماه علما في قصة ابن عمر أو من كان من الصحابة في حديث الفاتحة فقال ليهنك العلم مع كونه مصادفة\n\n\n### [الوجد ليس بمعلوم الورود لمن ورد عليه الوجد]\n\n\nواعلم أن الذي يتقيد به وجود الحق في صاحب الوجد إنما هو بحسب الوجد والوجد ليس بمعلوم وروده لمن ورد عليه حتى ينزل به فوجود الحق في كل صاحب وجد بحسب وجده ثم إن الوجد عند العارفين يخرج عن حكم الاصطلاح بل يرسلونه في العموم فما عندهم صاحب وجد صحيح كان فيمن كان إلا وللحق في ذلك الوجد وجود يعرفه العارفون بالله فيأخذون عن كل صاحب وجد ما يأتي به في وجده من وجوده وإن كان صاحب ذلك الوجد لا يعرف أن ذلك وجود الحق فإن العارف يعرفه فيأخذ منه ما يأتي به صاحب كل وجد من وجود وأن الحق تجلى في ذلك الوجد بصورة ما قيده به هذا المخبر عن وجود ما وجده في وجده وهذا ذوق عزيز هو حق في نفس الأمر معتبر مقطوع به عند أرباب هذا الشأن لا عند كلهم وقد أنبأ الحق عن نفسه في ذلك بتغير الصور والنعوت عليه لتغير أحوال العباد ومعلوم أنه ما تغيرت أحوال الكون في الثقلين إلا لتغير حكم الأسماء وتغيرت الصور والتجليات لتغير أحوال الكون فالأمر منه بدأ وإليه يعود فللعبد أثر بوجه ما قرره الحق له فلا يرفع عنه حكم ما قرره الحق ومن فعل ذلك فقد نازع الحق وهو القهار في مقابلة المنازعين فالعلماء بالله يقهرون بالله ولا يتجلى لهم الله في اسم قاهر ولا قهار في نفوسهم وإنما يرونه في هذا الاسم في صورة الأغيار فيعرفونه منهم لا من نفوسهم لأنهم محفوظون من المنازعة بينهم وبين أشكالهم فكيف بينهم وبين الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Thirty-Seven: On Existence [الوجود]\n\nThe Existence of the Real [الحق] is the very essence of my spiritual finding [وجدي];\nFor through Existence, I was annihilated [فنيت] from Him.\n\nAnd the ruling of Ecstasy [الوجد] annihilated all things from me,\nAnd the true nature of the Ecstasy’s essence is not known.\n\nAnd the finding of Existence [الوجود] in every aspect,\nWhether with a spiritual state [حال] or without one, is from Him.\n\n### That Existence, according to the People, is the finding of the Real in Ecstasy\n\nKnow that Existence [الوجود], according to the People [القوم], is the finding of the Real [الحق] within Ecstasy [الوجد]. They say: If you are a person of Ecstasy [صاحب وجد] and the Real is not witnessed [مشهودا] by you in that state—and His witnessing is that which annihilates you from your own witnessing and from the witnessing of those present with you—then you are not a person of Ecstasy, since you do not possess the Existence of the Real within it.\n\nKnow that the Existence of the Real in Ecstasy is not a known thing, for Ecstasy is a sudden encounter [مصادفة], and one does not know what the encounter will bring. It may come with something else entirely. Since its ruling is not tied to what is received through audition [السماع], the Existence of the Real within it occurs in an unknown manner. If you see someone who defines Ecstasy according to a ruling specified by restricted or absolute audition, then he has no knowledge of the true form of Ecstasy. Rather, he is merely a person of analogy [قياس] on the Path, and the Path of Allah is not grasped by analogy, for He is every day in a [new] affair, and every soul is in a [new] preparedness. <<فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ إِنَّ الله يَعْلَمُ وأَنْتُمْ لا تَعْلَمُونَ>> (So do not coin similitudes for Allah. Indeed, Allah knows, and you do not know.)\n\nKnow that the Existence of the Real in Ecstasy differs among those who experience it [الواجدين] due to the ruling of the Divine Names [الأسماء الإلهية] and the ruling of the cosmic preparednesses [الاستعدادات الكونية]. Every individual soul in the cosmos has a preparedness that no other possesses. The person of the soul is the one described by Ecstasy, so his Ecstasy is according to his preparedness. The Divine Names are watchful and observant, and the cosmos possesses nothing from Allah except the relation of His Names and the relation of His Providence. Thus, the Existence of the Real in Ecstasy is according to the Divine Name that looks upon that person. The Divine Names refer back to the very Essence [نفس] of the Real. The Spirit of Allah (Jesus) bore witness to a witnessing that encompasses the cosmos in Allah when he said: <<تَعْلَمُ ما في نَفْسِي ولا أَعْلَمُ ما في نَفْسِكَ>> (You know what is in my self, and I do not know what is in Your Self). This statement has two interpretations: one, that the 'Self' [النفس] here is the self of Jesus himself; or two, that it is the Self of the Real [نفس الحق]. If the servant is ignorant of the state of his own self regarding the ruling of preparedness by which he accepts the specific Existence of the Real, then he is even more ignorant of the Divine Names that look upon him in the future.\n\nWhen the Existence of the Real appears to the person of Ecstasy [صاحب الوجد] at the moment of that manifestation, he knows which of the Names has disclosed itself [تجلى] to him. He then reports, upon his return, about a specific Existence and a verified Witnessing [شهود محقق]. As for the one who is not a person of Ecstasy, his ruling is according to the state [الحال] in which he is established. The principle governing the door of Knowledge of Allah is that nothing of this is known except by Allah's future notification. As for the present and the past, Allah's notification concerning it is its occurrence, witnessed by the one upon whom it occurred, through direct tasting [ذوق], not through transmission, unless the transmitter is definitively truthful and the statement itself is a clear, unambiguous text in this domain. If it is not of this caliber, then it is not known at all. Even if knowledge of it occurs to a person at a certain time, it is by way of coincidence [المصادفة], and such a thing is not called 'knowledge' by any of the people of contemplation, even though the Lawgiver (the Prophet) called it knowledge in the story of Ibn Umar or whichever Companion it was, regarding the Hadith of Al-Fatiha, when he said, \"May this knowledge be pleasing to you,\" despite it being a coincidence.\n\n### Ecstasy is not known in its arrival to the one upon whom Ecstasy arrives\n\nKnow that what restricts the Existence of the Real in the person of Ecstasy is only according to the Ecstasy itself, and the arrival of Ecstasy [الوجد] is not known to the one upon whom it arrives until it descends upon him. Therefore, the Existence of the Real in every person of Ecstasy is according to his Ecstasy.\n\nFurthermore, Ecstasy among the Gnostics [العارفين] goes beyond the ruling of technical terminology; rather, they apply it generally. They hold that there is no true person of Ecstasy, whoever he may be, except that the Real has an Existence in that Ecstasy, which the Gnostics of Allah recognize. Thus, they take from every person of Ecstasy whatever he brings forth in his Ecstasy concerning Existence, even if the person of that Ecstasy does not know that it is the Existence of the Real. The Gnostic knows it and takes from him whatever the person of every Ecstasy brings forth of Existence, and that the Real has disclosed Himself [تجلى] in that Ecstasy in a form restricted by what this reporter relates concerning the Existence he found in his Ecstasy.\n\nThis is a precious tasting [ذوق عزيز], which is true in reality and is considered definitive and certain by the masters of this discipline, though not by all of them. The Real has informed about Himself in this regard by the changing of forms and descriptions upon Him, due to the changing states of the servants. It is known that the states of the cosmos in the two weighty groups (humans and jinn) only changed due to the changing ruling of the Names, and the forms and Theophanies [التجليات] changed due to the changing states of the cosmos. The matter began from Him and returns to Him. The servant has an effect in a certain aspect that the Real has decreed for him, so the ruling that the Real has decreed cannot be lifted from him. Whoever attempts to do that has contended with the Real, and He is the Subduer [القهار] in confrontation with those who contend. The scholars of Allah are subdued by Allah, and Allah does not disclose Himself to them in the Name *Al-Qahir* (The Subduer) or *Al-Qahhar* (The Overpowering) within their own selves. Rather, they see Him in this Name in the form of others [الأغيار], and they recognize Him through them, not through their own selves, because they are protected from contention among themselves and their peers. How then could they contend with Allah? <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (And Allah speaks the Truth, and He guides to the Way.)",
    "ur": "## «باب نمبر دو سو سینتیس: الوجود (ہستی) کے بیان میں»\n\n> ذات حق (الحق) کی ہستی میری وجدانی ہستی کا عین ہے،\n> کیونکہ میں ہستی (الوجود) کے ذریعے اس سے فنا (الفناء) ہو گیا۔\n> اور وجد (وجد) کے حکم نے سب کو مجھ سے فنا کر دیا،\n> اور عین وجد (عین الوجد) کی حقیقت کوئی نہیں جانتا۔\n> اور ہر صورت میں ہستی (الوجود) کا وجدان،\n> خواہ حال کے ساتھ ہو یا بغیر حال کے، وہ اسی (ذات حق) کی طرف سے ہے۔\n\n### [یہ کہ صوفیاء کے نزدیک الوجود (ہستی) وجد (وجد) میں الحق (ذات حق) کا وجدان ہے]\n\nجان لو کہ صوفیاء کے نزدیک الوجود (ہستی) وجد (وجد) میں الحق (ذات حق) کا وجدان ہے۔ وہ کہتے ہیں کہ اگر تم صاحبِ وجد ہو اور اس حال میں الحق (ذات حق) تمہارے لیے مشہود نہ ہو، اور اس کا شہود (الشہود) ہی تمہیں تمہارے اپنے شہود اور تمہارے حاضرین کے شہود سے فنا (الفناء) کر دے، تو تم صاحبِ وجد نہیں ہو، کیونکہ تم اس میں الحق (ذات حق) کی ہستی (الوجود) کے مالک نہیں بنے۔\n\nاور جان لو کہ وجد (وجد) میں الحق (ذات حق) کی ہستی (الوجود) معلوم نہیں ہے۔ کیونکہ وجد (وجد) ایک مصادفت (اچانک ملاقات) ہے، اور یہ معلوم نہیں ہوتا کہ یہ مصادفت کس چیز کے ساتھ واقع ہو گی۔ اور کبھی یہ کسی اور امر کے ساتھ بھی آ سکتا ہے۔ چونکہ اس کا حکم اس چیز سے منسلک نہیں ہے جس کے ذریعے سماع واقع ہوتا ہے، اس لیے اس میں الحق (ذات حق) کی ہستی (الوجود) ایک نامعلوم انداز میں ہوتی ہے۔\n\nپس جب تم کسی کو دیکھو جو وجد (وجد) کو اس حکم پر قائم کرتا ہے جسے مقید اور مطلق سماع نے متعین کیا ہے، تو اسے وجد کی صورت کی خبر نہیں ہے۔ بلکہ وہ راہِ سلوک میں قیاس کرنے والا ہے، اور اللہ کی راہ قیاس سے نہیں پائی جا سکتی، کیونکہ وہ ہر دن ایک نئی شان میں ہے اور ہر نفس ایک نئے استعداد میں ہے۔ **\"پس اللہ کے لیے مثالیں نہ گھڑو، بے شک اللہ جانتا ہے اور تم نہیں جانتے۔\"** (النحل: ۷۴)\n\nاور جان لو کہ الحق (ذات حق) کی ہستی (الوجود) کا وجد (وجد) میں واجدین کے ہاں مختلف ہونا اسماءِ الٰہیہ (الأسماء الإلهية) کے حکم اور کونی استعدادات (الاستعدادات الکونیۃ) کے حکم کی وجہ سے ہے۔ پس کائنات (الکون) کا ہر نفس ایک ایسا استعداد رکھتا ہے جو کسی دوسرے کے لیے نہیں ہوتا۔ اور صاحبِ نفس (نفس کا مالک) ہی وجد (وجد) سے متصف ہوتا ہے، پس اس کا وجد اس کے استعداد کے مطابق ہوتا ہے۔ اور اسماءِ الٰہیہ (الأسماء الإلهية) نگہبان اور نگران ہیں۔ اور کائنات کے ہاتھ میں اللہ کی طرف سے اس کے اسماء کی نسبتوں اور اس کی عنایت کی نسبتوں کے سوا کچھ نہیں ہے۔ پس وجد (وجد) میں الحق (ذات حق) کی ہستی (الوجود) اس اسمِ الٰہی کے مطابق ہوتی ہے جو اس پر نگاہ رکھتا ہے۔ اور اسماءِ الٰہیہ (الأسماء الإلهية) خود الحق (ذات حق) کی طرف لوٹتے ہیں۔\n\nاور روح اللہ (عیسیٰ علیہ السلام) نے ایک ایسی شہادت دی جو کائنات کو اللہ کے بارے میں عام کرتی ہے، پس انہوں نے فرمایا: **\"تو جانتا ہے جو میرے نفس میں ہے اور میں نہیں جانتا جو تیرے نفس میں ہے۔\"** (المائدہ: ۱۱۶) یہ دو صورتوں پر ہے: ایک صورت یہ کہ یہاں نفس سے مراد عیسیٰ کا اپنا نفس ہو، یا یہ الحق (ذات حق) کا نفس ہو۔\n\nپس جب بندہ اس استعداد کے حکم سے جاہل ہو جس پر اس کا نفس قائم ہے اور جس کے ذریعے وہ خاص وجودِ حق (الوجود الحق الخاص) کو قبول کرتا ہے، تو وہ ان اسماءِ الٰہیہ (الأسماء الإلهية) سے جو آئندہ میں اس پر نگاہ رکھیں گے، زیادہ جاہل ہے۔ پس جب صاحبِ وجد (صاحب الوجد) کے لیے الحق (ذات حق) کی ہستی (الوجود) ظاہر ہوتی ہے، تو وہ اس ظہور کے وقت جانتا ہے کہ کون سا اسم اس پر متجلی ہوا ہے، پس وہ ایک معین وجود اور محقق شہود (الشہود المحقق) سے واپسی پر خبر دیتا ہے۔\n\nاور غیر صاحبِ وجد (غیر صاحب الوجد) کا حکم اس حال کے مطابق ہوتا ہے جس میں اسے قائم کیا جاتا ہے۔ اور علم باللہ (العلم باللہ) کے باب کا ضابطہ یہ ہے کہ اس میں سے کوئی چیز معلوم نہیں ہوتی مگر اللہ کے آئندہ میں مطلع کرنے سے۔ اور حال اور ماضی میں، اللہ کا اس سے مطلع کرنا اس کا وقوع ہے جو اس شخص کے لیے مشہود ہو جس پر وہ ذوق (ذوق) کے ذریعے واقع ہوا ہو، نہ کہ نقل کے ذریعے۔ مگر یہ کہ نقل کرنے والے کی سچائی یقینی ہو اور وہ قول بھی اس باب میں ایک واضح نص ہو جو احتمال نہ رکھتی ہو۔ اگر یہ اس معیار پر نہ ہو تو وہ بالکل معلوم نہیں ہوتا۔ اور اگر کسی شخص کو کسی وقت اس کا علم ہو بھی جائے تو وہ مصادفت (اچانک ملاقات) کے حکم سے ہوتا ہے۔ اور اہل نظر میں سے کوئی بھی اسے علم نہیں کہتا، اگرچہ شارع (نبی اکرم ﷺ) نے اسے ابن عمر یا کسی اور صحابی کے قصے میں سورۃ الفاتحہ کی حدیث میں علم کہا، جب آپ نے فرمایا: \"یہ علم تمہیں مبارک ہو\"، باوجود اس کے کہ وہ مصادفت تھی۔\n\n### [وجد (وجد) کا ورود اس شخص کے لیے معلوم نہیں ہوتا جس پر وہ وارد ہوتا ہے]\n\nاور جان لو کہ الحق (ذات حق) کی ہستی (الوجود) جس چیز سے صاحبِ وجد (صاحب الوجد) میں مقید ہوتی ہے، وہ وجد (وجد) کے مطابق ہوتی ہے، اور وجد کا ورود اس شخص کے لیے معلوم نہیں ہوتا جس پر وہ وارد ہوتا ہے، یہاں تک کہ وہ اس پر نازل ہو جائے۔ پس الحق (ذات حق) کی ہستی (الوجود) ہر صاحبِ وجد میں اس کے وجد کے مطابق ہوتی ہے۔\n\nپھر یہ کہ عارفین (العارفین) کے نزدیک وجد (وجد) اصطلاح کے حکم سے باہر نکل جاتا ہے، بلکہ وہ اسے عموم میں جاری کرتے ہیں۔ پس ان کے نزدیک کوئی بھی صحیح صاحبِ وجد نہیں ہے، خواہ وہ کوئی بھی ہو، مگر یہ کہ اس وجد میں الحق (ذات حق) کی ایک ہستی (الوجود) ہوتی ہے جسے اللہ کے عارفین (العارفون باللہ) جانتے ہیں۔ پس وہ ہر صاحبِ وجد سے وہ کچھ لیتے ہیں جو وہ اپنے وجد میں اپنی ہستی (الوجود) سے لاتا ہے، اگرچہ اس وجد کا مالک یہ نہ جانتا ہو کہ یہ الحق (ذات حق) کی ہستی (الوجود) ہے۔ کیونکہ عارف اسے جانتا ہے، پس وہ اس سے وہ کچھ لیتا ہے جو ہر صاحبِ وجد ہستی (الوجود) سے لاتا ہے، اور یہ کہ الحق (ذات حق) اس وجد میں اس صورت میں متجلی ہوا جس سے اس مخبر نے اپنے وجد میں پائی گئی ہستی (الوجود) کی خبر دی ہے۔\n\nاور یہ ایک نایاب ذوق (ذوق) ہے جو نفس الامر میں حق ہے، اور اس شان کے ارباب کے نزدیک معتبر اور یقینی ہے، اگرچہ ان سب کے نزدیک نہیں۔ اور الحق (ذات حق) نے اس بارے میں اپنے آپ سے خبر دی ہے کہ اس پر صورتوں اور صفات کا تغیر ہوتا ہے، بندوں کے احوال کے تغیر کی وجہ سے۔ اور یہ معلوم ہے کہ دونوں جہانوں (الثقلین) میں کائنات کے احوال صرف اسماء کے حکم کے تغیر کی وجہ سے بدلے ہیں، اور صورتیں اور تجلیات (التجلیات) کائنات کے احوال کے تغیر کی وجہ سے بدلی ہیں۔ پس امر اسی سے شروع ہوا اور اسی کی طرف لوٹتا ہے۔\n\nپس بندے کے لیے ایک اثر ہے اس صورت میں جو الحق (ذات حق) نے اس کے لیے مقرر کر دی ہے، پس وہ اس حکم کو اپنے سے دور نہیں کر سکتا جو الحق (ذات حق) نے اس کے لیے مقرر کیا ہے۔ اور جو ایسا کرتا ہے، وہ الحق (ذات حق) سے جھگڑا کرتا ہے، اور وہ جھگڑا کرنے والوں کے مقابلے میں القہار (زبردست) ہے۔ پس علماء باللہ (العلماء باللہ) اللہ کے ذریعے مغلوب کیے جاتے ہیں، اور اللہ ان پر ان کے نفوس میں اسمِ قاہر یا قہار میں تجلی نہیں کرتا، بلکہ وہ اسے اس اسم میں اغیار (دوسروں) کی صورت میں دیکھتے ہیں، پس وہ اسے ان سے پہچانتے ہیں نہ کہ اپنے نفوس سے، کیونکہ وہ اپنے اور اپنے ہم شکلوں کے درمیان جھگڑے سے محفوظ ہیں، تو پھر ان کے اور اللہ کے درمیان کیسے جھگڑا ہو سکتا ہے؟ اور **\"اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے۔\"** (الاحزاب: ۴)",
    "fa": "باب دویست و سی و هفتم در هستی (الوجود)\n\nهستی (الوجود) حق، عین هستی (الوجود) وجد من است *** زیرا من به واسطه هستی (الوجود) از او فانی شدم‏\nو حکم وجد، همه را از من فانی ساخت *** و کنه عین وجد دانسته نمی‌شود\nو یافتن هستی (الوجود) به هر روی *** چه با حال و چه بی‌حال، از اوست‏\n\n### [اینکه هستی (الوجود) نزد این طایفه، یافتن حق در وجد است]\n\nبدان که هستی (الوجود) نزد این طایفه، یافتن حق در وجد است. می‌گویند: اگر صاحب وجد باشی و در آن حال، حق برای تو مشهود نباشد، و شهود (الشهود) او همان چیزی است که تو را از شهود خودت و از شهود حاضران فانی می‌سازد، پس تو صاحب وجد نیستی، زیرا صاحب هستی (الوجود) حق در آن نبودی. و بدان که هستی (الوجود) حق در وجد، معلوم نیست؛ زیرا وجد یک مصادفه (برخورد) است و دانسته نمی‌شود که این مصادفه به چه چیزی واقع می‌شود و ممکن است به امر دیگری بیاید. پس چون حکم آن غیر مرتبط با آنچه با شنیدن (سماع) واقع می‌شود، بود، هستی (الوجود) حق در آن بر وصفی مجهول است. پس اگر کسی را دیدید که وجد را بر حکمی که سماع مقید و مطلق آن را تعیین کرده است، مقرر می‌دارد، او از صورت وجد خبری ندارد. بلکه او صاحب قیاس در این راه است، و راه خدا با قیاس درک نمی‌شود، زیرا او هر روز در شأنی است و هر نفس در استعدادی. پس برای خدا مَثَل‌ها نزنید، زیرا خدا می‌داند و شما نمی‌دانید. (فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ إِنَّ الله يَعْلَمُ وأَنْتُمْ لا تَعْلَمُونَ)\n\nو بدان که هستی (الوجود) حق در وجد نزد واجدین (یابندگان) تنها به سبب حکم اسماء الهی و حکم استعدادهای کونی متفاوت است. پس هر نفس از هستی (الکون) استعدادی دارد که برای دیگری نیست، و صاحب نفس (با فتح فاء) کسی است که به وجد وصف می‌شود، پس وجد او بر حسب استعدادش خواهد بود. و اسماء الهی ناظر و مراقب هستند، و در دست هستی (الکون) از جانب خدا جز نسبت‌های اسماء او و نسبت‌های عنایت او نیست. پس هستی (الوجود) حق در وجد بر حسب اسم الهی است که به آن نظر می‌کند. و اسماء الهی به نفس حق باز می‌گردند. و روح الله (عیسی) به شهادتی که هستی (الکون) را در خدا فرا می‌گیرد، شهادت داد و گفت: تو آنچه در نفس من است می‌دانی و من آنچه در نفس تو است نمی‌دانم. (تَعْلَمُ ما في نَفْسِي ولا أَعْلَمُ ما في نَفْسِكَ) این بر دو وجه است: وجه اول اینکه نفس در اینجا عین نفس عیسی باشد، یا نفس حق باشد. پس اگر بنده نداند که نفس او بر چه حکم استعدادی است که به واسطه آن هستی (الوجود) حق خاص را می‌پذیرد، پس نسبت به آنچه از اسماء الهی در آینده به آن نظر می‌کند، جاهل‌تر است. پس هنگامی که هستی (الوجود) حق برای صاحب وجد ظاهر شود، در آن ظهور می‌داند که کدام یک از اسماء بر او تجلی (التجلی) کرده است، و هنگام بازگشت از آن، از هستی (الوجود) معین و شهود (الشهود) محقق خبر می‌دهد. اما حکم غیر صاحب وجد بر حسب حالی است که در آن قرار داده می‌شود. و ضابطه باب علم به خدا این است که هیچ چیز از این امور دانسته نمی‌شود مگر با اعلام خدا در آینده. و اما در حال و گذشته، اعلام خدا به آن، وقوع مشهود کسی است که آن را با ذوق (چشیدن) یافته است نه با نقل، مگر اینکه صدق ناقل قطعی باشد و آن قول نیز در این باب نصّی آشکار و غیر قابل تأویل باشد. اگر چنین نباشد، اصلاً دانسته نمی‌شود. و اگر علم به آن از شخصی در زمانی واقع شود، به حکم مصادفه (برخورد) است، و چنین چیزی نزد هیچ یک از اهل نظر، علم نامیده نمی‌شود، اگرچه شارع در داستان ابن عمر یا هر یک از صحابه در حدیث فاتحه، آن را علم نامیده و فرموده است: «علم بر تو گوارا باد»، با وجود اینکه مصادفه بوده است.\n\n### [وجد برای کسی که وجد بر او وارد می‌شود، معلوم الورود نیست]\n\nو بدان که آنچه هستی (الوجود) حق در صاحب وجد به آن مقید می‌شود، تنها بر حسب وجد است، و وجد برای کسی که بر او وارد می‌شود، معلوم الورود نیست تا اینکه بر او نازل شود. پس هستی (الوجود) حق در هر صاحب وجدی بر حسب وجد اوست. سپس وجد نزد عارفان (العارفین) از حکم اصطلاح خارج می‌شود، بلکه آن را در عموم رها می‌کنند. نزد آنان هیچ صاحب وجد صحیحی، در هر کس که باشد، نیست مگر اینکه حق در آن وجد، هستی (الوجود) دارد که عارفان (العارفون) به خدا آن را می‌شناسند. پس از هر صاحب وجدی، آنچه را که در وجد خود از هستی (الوجود) می‌آورد، می‌گیرند. و اگرچه صاحب آن وجد نداند که آن هستی (الوجود) حق است، عارف آن را می‌شناسد و از او آنچه را که صاحب هر وجدی از هستی (الوجود) می‌آورد، می‌گیرد، و اینکه حق در آن وجد به صورتی تجلی (التجلی) کرده است که این خبردهنده از هستی (الوجود) یافته شده در وجدش، آن را مقید کرده است. و این یک ذوق (چشیدن) گرانبهاست که در نفس امر حق است و نزد ارباب این شأن، نه همه آنها، معتبر و قطعی است. و حق در این باره از خود خبر داده است به تغییر صور و اوصاف بر او، به دلیل تغییر احوال بندگان. و معلوم است که احوال هستی (الکون) در دو جهان (جن و انس) تغییر نکرده است مگر به دلیل تغییر حکم اسماء، و صور و تجلیات (التجلیات) به دلیل تغییر احوال هستی (الکون) تغییر کرده‌اند. پس امر از او آغاز شده و به سوی او باز می‌گردد. پس بنده را اثری است به وجهی که حق برای او مقرر کرده است، و نباید حکم آنچه را که حق مقرر کرده است، از او بردارد. و هر کس چنین کند، با حق منازعه کرده است، و او در مقابل منازعه‌کنندگان، قهار است. پس عالمان به خدا به واسطه خدا مقهور می‌شوند، و خدا در اسم قاهر و قهار بر نفوس آنان تجلی (التجلی) نمی‌کند، بلکه او را در این اسم در صورت اغیار (دیگران) می‌بینند و او را از طریق آنان می‌شناسند نه از نفوس خودشان، زیرا آنان از منازعه بین خود و امثالشان محفوظ هستند، پس چگونه بین خود و خدا منازعه کنند؟ و خدا حق را می‌گوید و او راه را هدایت می‌کند. (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)"
  },
  "page_count": 2
}