{
  "id": 382,
  "title": {
    "ar": "الباب الثاني والثمانون وثلاثمائة في معرفة منزل الخواتم وعدد الأعراس الإلهية والأسرار الأعجمية",
    "en": "Chapter Three Hundred and Eighty-Two: Concerning the Gnosis (معرفة) of the Station of the Seals (منزل الخواتم), the Number of the Divine Nuptials (الأعراس الإلهية), and the Non-Arabic Secrets (الأسرار الأعجمية)",
    "ur": "باب تین سو بیاسی: خواتم (مہروں/اختتاموں) کے مقام کی معرفت، اور الٰہی اعراس (نکاحوں) کی تعداد، اور عجمی اسرار کے بیان میں۔",
    "fa": "باب سیصد و هشتاد و دوم در معرفت منزل خاتم‌ها (پایان‌ها)، و تعداد عروسی‌های الهی، و اسرار غیرعربی (الأسرار الأعجمية)"
  },
  "content": {
    "ar": "## «الباب الثاني والثمانون وثلاثمائة» في معرفة منزل الخواتم وعدد الأعراس الإلهية والأسرار الأعجمية\n\n\nموسوية لزومية\n\n\n> علم البرازخ علم ليس يدركه *** إلا الذي جمع الأطراف والوسطا\n\n\n> له النفوذ به في كل نازلة *** كونية فبه في العالمين سطا\n\n\n> فإن أراد بشخص نقمة قبضا *** وإن أراد بشخص نعمة بسطا\n\n\n> إن أقسط الخلق في ميزان رحمته *** في العالمين تراه فيه قد قسطا\n\n\n### [إن الوجود في الصور دائرة انعطف أبدها على أزلها]\n\n\nاعلم أنه لما كانت الخواتم أعيان السوابق علمنا إن الوجود في الصور دائرة انعطف أبدها على أزلها فلم يعقل إله إلا وعقل المألوه ولا عقل رب إلا وعقل المربوب ولكل معقول رتبة ليست عين الأخرى كما نعلم أن بين الخاتمة والسابقة\nتميزا معقولا به يقال عن الواحدة سابقة وعن الأخرى خاتمة وإنما قلنا إن الخاتمة عين السابقة إنما ذلك في الحكم على المحكوم عليه وبالمحكوم عليه تبينت الخاتمة من السابقة\n\n\n### [الأعراس على قسمين‏]\n\n\nواعلم أن الأعراس على قسمين عرس لعقد وعرس لعقد ودخول وعرس بدخول ولا عقد والعقد عبارة عما يقع عليه رضي الزوجين والدخول وطء لوجود لذة أو لإيجاد عين ودخول بلا عقد عرس الإماء ولما لم يكن في الأنكحة أفضل من نكاح الهبة لأنه لا عن عوض كالاسم الواهب الذي يعطي لينعم اختص به لفظه أفضل الخلق وهو محمد صَلَّى اللهُ عَليهِ وسَلَّم قال تعالى وامْرَأَةً مُؤْمِنَةً إِنْ وَهَبَتْ نَفْسَها لِلنَّبِيِّ إِنْ أَرادَ النَّبِيُّ أَنْ يَسْتَنْكِحَها خالِصَةً لَكَ من دُونِ الْمُؤْمِنِينَ وكل نكاح خارج عما ذكرناه فهو سفاح لا نكاح أي هو بمنزلة الشي‏ء السائل الذي لا ثبات له لأنه لا عقد فيه ولا رباط ولا وثاق ثم نرجع ونقول فأما الخواتم فتعينها الآجال ولو لا ذلك ما كان لشي‏ء خاتمة لأن الخاتمة انتهاء في الموصوف بها ولكل خاتمة سابقة ولا ينعكس فمن نظر إلى دوام تنزيل الأمر الإلهي واسترساله قال ما ثم خاتمة ومن نظر إلى الفصل بين الأشياء في التنزل قال بالخواتم في الأشياء لكون الفصول تبينها مثال ذلك ولكن كل هذا في عالم الانقسام والتركيب فإذا نظرت في القرآن مثلا بين الكلمتين والآيتين والسورتين فتقول عند وجود الفصل المميز بين الأمرين فإن وقع بين كلمتين فخاتمة الأولى حرف معين وإن كان آيتان فخاتمة الأولى كلمة معينة وإن كان سورتان فخاتمة الأولى آية معينة وإن كان أمر حادث قيل أجله كذا في الدنيا لأن كل ما في الدنيا يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى فتنتهي فيه المدة بالأجل فخاتمة ذلك الشي‏ء ما ينتهي إليه حكمه فانتهاء الأنفاس في الحيوان آخر نفس يكون منه عند انتقاله إلى البرزخ ثم تنتهي المدة في البرزخ إلى الفصل بينه وبين البعث ثم تنتهي المدة في القيامة إلى الفصل بينها وبين دخول الدارين ثم تنتهي المدة في النار في حق من هو فيها من أهل الجنة إلى الفصل الذي بين الإقامة فيها والخروج منها بالشفاعة والمنة ثم تنتهي المدة في عذاب أهل النار الذين لا يخرجون منها إلى الفصل بين حال العذاب وبين حصول حكم الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فهم يتنعمون في النار باختلاف أمزجتهم كما قد ذكرناه ثم لا يبقى بعد ذلك أجل ظاهر بالمدة ولكن آجال خفية دقيقة وذلك أن المحدث الدائم العين من شأنه تقلب الأحوال عليه ليلزمه الافتقار إلى دوام الوجود له دائما فلا تفارق أحواله الآجال فلا يزال في أحواله بين سابقة وخاتمة وأما الايمان فسابقته لا إله إلا الله وخاتمته إماطة الأذى عن الطريق فعبر الشارع عن السابقة بالأعلى وعن الخاتمة بالأدون فلا أعلى في الايمان من التوحيد ولا أدنى فيه من إماطة الأذى عن الطريق ومن ذلك طريق التوحيد فإن الأذى الذي في طريقه الشرك الجلي والخفي فالخفي الأسباب وهي بين خفي وأخفى فالأخفى الأسباب الباطنة والخفي الأسباب الظاهرة والجلي نسبة الألوهة إلى المحدثات فيميط الموحد هذه كلها عن قلبه وقلب غيره فإنها أذى في طريق التوحيد وكل أذى في طريق من طرق الايمان بحسب الصفة التي تسمى إيمانا فما يضادها يسمى أذى في طريقها فالذي يزال به الأذى من تلك الصفة المعينة هو خاتمة تلك الصفة كان ما كان ولا خاتمة لحكم الله في عباده بالجملة والإطلاق ولا سابقة فإن العدم الذي للممكن المتقدم على وجوده لم يزل مرجحا له بفرض الوجود الإمكانى له فلا سابقة له وهو علم دقيق خفي تصوره سهل ممتنع لأنه سريع التفلت من الذهن عند التصور فليس الحدوث للممكن إلا من حيث وجوده خاصة عند جميع الأنظار وعندنا ليس كذلك وإنما الحدوث عندنا في حقه كون عدمه ووجوده لم يزل مرجحا على كل حال لأنه ممكن لذاته وإن كان بعض النظار قد قال حدوثه ليس سوى إمكانه ولكن ما بين هذا البيان الذي بينته في ذلك يتطرق الاحتمال إلى كلام هذا الحاكم فإنه يحتمل أن يكون عند من أسماء الترادف فيكون كونه يسمى حادثا كونه يسمى ممكنا ويحتمل أن يريد ما أردناه من كون العدم الذي يحكم عليه به أنه لذاته هو عندنا مرجح لم يزل فإن توسعنا في العبارة مع النظار لم نقل إن عدم الممكن لنفسه لأنه لو كان العدم له صفة نفس لاستحال وجوده كما يستحيل وجود المحال ولكن كما نقول تقدم العدم له على الوجود لذاته لا العلم وبينهما فرقان عظيم ولكن ليس مذهبنا فيه إلا إن عدمه لم يزل مرجحا فوجود الممكن له سابقة لكونه لم يكن ثم كان ولكن من حيث عينه إذا كان قائما بنفسه لا من حيث صورته فلا خاتمة له في عينه وله الخواتم في صورته بالأمثال والأضداد فكل حادث سوى الأعيان القائمة بأنفسها فله سابقة وخاتمة لكن‏\nسابقته عين خاتمته لأنه ليس له في كونه غير زمان كونه خاصة ثم ينعدم لنفسه وإنما تتميز السابقة فيه من الخاتمة بالحكم فتحكم عليه بالوجود في السابقة وبالعدم في الخاتمة وفي عين سابقته عين خاتمته لأنه ليس له وجود في الزمان الثاني من زمان وجوده فافهم‏\n\n\n### [خاتمة السالكين‏]\n\n\nواعلم أن السالك إذا وصل إلى الباب الذي يصل إليه كل سالك بالاكتساب فأخر قدم في\n\n\nالسلوك هو خاتمة السالكين ثم يفتح الباب وتخرج العطايا والمواهب الإلهية بحكم العناية والاختصاص لا بحكم الاكتساب وهذا الباب الإلهي قبول كله لا رد فيه البتة بخلاف أبواب المحدثات وفيه أقول‏\n\n\n> كل باب إذا وصلت إليه *** أمكن الرد والقبول جميعا\n\n\n> غير باب الإله فهو قبول *** للذي جاءه سميعا مطيعا\n\n\n> والذي رد إذ تخيل فيه *** أنه الباب خر ثم صريعا\n\n\n> فيناديه ربه ليس بابي *** إن بابي لمن يريد خشوعا\n\n\n> لو تفطنت حين جئت إليه *** كنت عاينت فيك أمرا بديعا\n\n\n> أنت ما أنت لست أنت سوانا *** فاسكب إن شئت للفراق دموعا\n\n\nولما وصلت في جماعة الواصلين من أهل زماني إلى هذا الباب الإلهي وجدته مفتوحا ما عليه حاجب ولا بواب فوقفت عنده إلى أن خلع على خلعة الوراثة النبوية ورأيت خوخة مغلقة فأردت قرعها فقيل لي لا تقرع فإنها لا تفتح فقلت فلأي شي‏ء وضعت قيل لي هذه الخوخة التي اختص بها الأنبياء والرسل عليه السلام ولما كمل الدين أغلقت ومن هذا الباب كانت تخلع على الأنبياء خلع الشرائع ثم إني التفت في الباب فرأيته جسما شفافا يكشف ما وراءه فرأيت ذلك الكشف عين الفهم الذي للورثة في الشرائع وما يؤدي إليه اجتهاد المجتهدين في الأحكام فلازمت تلك الخوخة والنظر فيما وراء ذلك الباب فجليت لي من خلفه صور المعلومات على ما هي عليه فذلك عين الفتح الذي يجده العلماء في بواطنهم ولا يعلمون من أين حصل لهم إلا إن كوشفوا على ما كشف لنا فالنبوة العامة لا تشريع معها النبوة الخاصة التي بابها تلك الخوخة هي نبوة الشرائع فبابها مغلق والعلم بما فيها محقق فلا رسول ولا نبي فشكرت الله على ما منح من المتن في السر والعلن فلما اطلعت من الباب الأول الذي يصل إليه السالكون الذي منه تخرج الخلع إليهم رأيت منه شكر الشاكرين كالصور التي تجلت لنا خلف الخوخة والظاهر من الشكر كالخوخة فلم أر شاكرا إلا لواحد من خلف الكلمات الظاهرة فلم أجد في تلك الحالة مساعد إلى على الشكر فقلت أخاطب ربي تعالى عز وجل‏\n\n\n> إذا رمت شكرا لم أجد لك شاكرا *** وإن أنا لم أشكر أكون كفورا\n\n\n> سترت عقول الخلق بالسبب الذي *** وضعت فلم آنس عليك غيورا\n\n\n> وقد بلغت عنك التراجم غيرة *** أمرت بها عبدا بتلك خبيرا\n\n\n> لذلك لم تشهد ولم تك ظاهرا *** ولو كنت مشهودا لكنت غفورا\n\n\n> وقد قلت بالتلبيس في الملك الذي *** بعثت شخيصا للأنام بصيرا\n\n\n> وكيف لنا بالعلم والأمر لم يزل *** على حالة الإمكان منك ظهيرا\n\n\nفكان محمد صَلَّى اللهُ عَليهِ وسَلَّم عين سابقة النبوة البشرية\n\n\nبقوله معرفا إيانا كنت نبيا وآدم بين الماء والطين‏\n\n\nوهو عين خاتم النبيين بقوله تعالى ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ لما ادعى فيه أنه أبو زيد نفى الله تعالى عنه أن يكون أبا لأحد من رجالنا لرفع المناسبة وتمييز المرتبة أ لا تراه صَلَّى اللهُ عَليهِ وسَلَّم ما عاش له ولد ذكر من ظهره تشرع تفأله لكونه سبق في علم الله أنه خاتم النبيين وقال صَلَّى اللهُ عَليهِ وسَلَّم إن الرسالة يعني البعثة إلى الناس بالتشريع لهم والنبوة قد انقطعت‏\n\n\nأي ما بقي من يشرع له من عند الله حكم يكون عليه ليس هو شرعنا الذي جئنا به فلا رسول بعدي يأتي بشرع يخالف شرعي إلى الناس ولا نبي يكون على شرع ينفرد به من عند ربه يكون عليه فصرح أنه خاتم نبوة التشريع ولو أراد غير ما ذكرناه لكان معارضا\n\n\nلقوله إن عيسى عليه السلام ينزل فينا حكما مقسطا يؤمنا بنا\n\n\nأي بالشرع الذي نحن عليه‏\nولا نشك فيه أنه رسول ونبي فعلمنا أنه صَلَّى اللهُ عَليهِ وسَلَّم أراد أنه لا شرع بعده ينسخ شرعه ودخل بهذا القول كل إنسان في العالم من زمان بعثته إلى يوم القيامة في أمته فالخضر والياس وعيسى من أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم الظاهرة ومن آدم إلى زمان بعثة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من أمته الباطنة فهو النبي بالسابقة وهو النبي بالخاتمة فظهر في رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن السابقة عين الخاتمة في النبوة وأما خاتمية عيسى عليه السلام فله ختام دورة الملك فهو آخر رسول ظهر وظهر بصورة آدم في نشئه حيث لم يكن عن أب بشري ولم يشبه الأبناء أعني ذرية آدم في النش‏ء فإنه لم يلبث في البطن اللبث المعتاد فإنه لم ينتقل في أطوار النشأة الطبيعية بمرور الأزمان المعتادة بل كان انتقاله يشبه البعث أعني إحياء الموتى يوم القيامة في الزمان القليل على صورة من جاءوا عليها في الزمان الكثير فإنه داخل تحت عموم قوله كَما بَدَأَكُمْ تَعُودُونَ في التناسل والتنقل في الأطوار ثم إن عيسى إذا نزل إلى الأرض في آخر الزمان أعطاه ختم الولاية الكبرى من آدم إلى آخر نبي تشريفا لمحمد صَلَّى اللهُ عَليهِ وسَلَّم حيث لم يختم الله الولاية العامة في كل أمة إلا برسول تابع إياه صَلَّى اللهُ عَليهِ وسَلَّم وحينئذ فله ختم دورة الملك وختم الولاية أعني الولاية العامة فهو من الخواتم في العالم وأما خاتم الولاية المحمدية وهو الختم الخاص لولاية أمة محمد الظاهرة فيدخل في حكم ختميته عيسى عليه السلام وغيره كإلياس والخضر وكل ولي لله تعالى من ظاهر الأمة فعيسى عليه السلام وإن كان ختما فهو مختوم تحت ختم هذا الخاتم المحمدي وعلمت حديث هذا الخاتم المحمدي بفأس من بلاد المغرب سنة أربع وتسعين وخمسمائة عرفني به الحق وأعطاني علامته ولا أسميه ومنزلته من رسول الله صَلَّى اللهُ عَليهِ وسَلَّم شعرة واحدة من جسده صَلَّى اللهُ عَليهِ وسَلَّم ولهذا يشعر به إجمالا ولا يعلم به تفصيلا إلا من أعلمه الله به أو من صدقه إن عرفه بنفسه في دعواه ذلك فلذلك عرف بأنه شعرة من الشعور ومثال الشعور أن ترى بابا مغلقا على ميت أو صندوقا مغلقا فتحس فيه بحركة توذن أن في ذلك البيت حيوانا ولكن لا يعلم أي نوع هو من أنواع الحيوان أو يشعر أنه إنسان ولا يعرف له عينا فيفصله من غيره كما نعلم بثقل الصندوق أنه يحتوي على شي‏ء أثقله لا يعلم ما هو عين ذلك الشي‏ء المختزن في ذلك الصندوق فمثل هذا يسمى شعورا لهذا الخفاء وأما ختم الأسماء الإلهية فهو عين سابقتها وهو الهو وهو مثل قوله هُوَ الله الَّذِي لا إِلهَ إِلَّا هُوَ فبدأ بهو وأتى بالاسم الله المحيط بجميع الأسماء التي تأتي مفصلة ثم بالنفي فنفى إن يكون هذه المرتبة لغيره ثم أوجبها لنفسه بقوله إِلَّا هُوَ فبدأ بهو وختم بهو فكل ما جاء من تفصيل أعيان الأسماء الإلهية فقد دخل تحت الاسم الله أتى بعد قوله هو فإن كلمة هو أعم من كلمة الله فإنها تدل على الله وعلى كل غائب وكل من له هوية وما ثم إلا من له هوية سواء كان المعلوم أو المذكور موجود أو معدوما وأما الخواتم التي على القلوب فهي خواتم الغيرة الإلهية فما ختم بها إلا الاسم الغيور وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم في الله إنه أغير مني ومن غيرته حرم الفواحش وجعل الفواحش ظاهرة وباطنة\n\n\nفقال تعالى لمحمد صَلَّى اللهُ عَليهِ وسَلَّم قُلْ إِنَّما حَرَّمَ رَبِّيَ الْفَواحِشَ ما ظَهَرَ مِنْها وما بَطَنَ فختم على كل قلب إن تدخله ربوبية الحق فتكون نعتا له فما من أحد يجد في قلبه أنه رب إله بل يعلم كل أحد من نفسه أنه فقير محتاج ذليل قال تعالى كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ فلا يدخله كبرياء إلهي أصلا فجعل البواطن كلها في كل فرد فرد مختوما عليه إن لا يدخلها تأله ولم يعصم الألسنة إن تتلفظ بالدعوى بالألوهة ولا عصم النفوس أن تعتقد الألوهة في غيرها بل هي معصومة أن تعتقدها في نفسها لا في أمثالها لأنه ما كل أحد عالم بالأمور على ما هي عليه ولا يعلم كل أحد أن الأمثال كلها حكمها في الماهية واحد فهذه الخواتم قد انحصرت في تفصيل ما ذكرناه من أنواعها وأما الأعراس الإلهية على تفصيل ما ذكرناه في أول الباب فهي مشتقة من التعريس وهو نزول المسافر في منزلة معلومة في سفره والأسفار معنوية وحسية فالسفر المحسوس معلوم والسفر المعنوي ما يظهر للقلب من المعاني دائما أبدا على التالي والتتابع فإذا مرت بهذا القلب عرست به فكان منزلا لتعريسها وإنما عرست به لتفيده حقيقة ما جاءت به وإنما نسبت إلى الله لأن الله هو الذي أسفرها وأظهرها لهذا القلب وجعله منزلا لها تعرس فيه وهي الشئون التي قال الحق عن نفسه إنه فيها جل جلاله في كل يوم فالعالم في سفر على الدوام دنيا وآخرة لأن الحق في شئون الخلق على الدوام دنيا وآخرة والقلوب محل‏\nلتعريس هذه المعاني التي يسفرها الحق لقلوب عباده فتعرس فيها ليطلعه الله على ما أراد أن يعلمه ذلك القلب فما من نفس إلا وللقلب خاطر إلهي قد نزل به على أي طريق سلك لكن بعض القلوب تعرف من عرس بها من الخواطر وقد لا تعرف من أي طريق جاء لأنها ما شعرت به حتى نزل ذلك الخاطر بالقلب وبعض الناس لهم استشراف على أفواه السكك التي تأتي عليها هذه الخواطر التي تنزل بهذا القلب وتعرف كل طريق وتميزه عن صاحبه فإذا أقبل الخاطر عرف من أي طريق أقبل فإذا نزل به يقابله من الكرامة به على قدر ما يعرفه فإنه لكل طريق حكم ليس للطريق الآخر وهذا كله أعني الذي ذكرناه من المراعاة إنما ذلك في زمان التكليف فإنه الذي وضع الطريق وأوجب الأحكام فإذا ارتفع التكليف في النشأة الآخرة توحدت الطريق فلم يكون غير طريق واحدة فلا يحتاج في النازل عليه من الله المعرس بقلبه إلى تمييز أصلا فإنه ماثم عمن يتميز لأحدية الطريق فلا يكون العرس بالعقد وبما فصلناه في ذلك في أول الباب إلا في زمان التكليف وهو زمان الحياة الدنيا في أول وجوب التكليف فاعلم ذلك فإذا كان الحق منزل تعريسنا وهو ما ذكر عن نفسه إن العبد يتحرك بحركة يضحك بها ربه ويتعجب منها ربه ويتبشبش له من أجلها ربه ويفرح بها ربه ويرضي بها ربه ويسخط بها ربه ويغضب بها ربه فلما قال هذا عن نفسه وعين هذه الحركات وأمثالها حتى عرفناها من كتابه على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم وعرفنا إن العبد عنده بحسب ما أنزل به من هذه الحركات الموجبة لهذه الأحكام التي وصف الحق بها نفسه أنه يظهر بها إذا أتى بها العبد وهذا حكم أثبته الحق ونفاه دليل العقل فعرفنا إن العقل قاصر عما ينبغي لله عز وجل وأنه لو ألزم نفسه الإنصاف للزم حكم الايمان والتلقي وجعل النظر والاستدلال في الموضع الذي جعله الله ولا يعدل به عن طريقه الذي جعله الله له وهو الطريق الموصل إلى كونه إلها واحدا لا شريك له في ألوهيته ولا يتعرض لها لما هو عليه في نفسه وأما استدلاله القاصر الذي يريد أن يحكم به على ربه بقوله إنه ما لا يخلو عن الحوادث فهو حادث بتقسيمه في ذلك فإذا سلمناه لم يقدح فيما نريده فإنا نقول له من قال لك إن الحق بهذه المثابة وهو قولك كل ما لا يخلو عن الحوادث في نفسه فمن قال لك إن هذه في الموجودات منحصرة إنما ذلك حكم فيما لا يخلو عن الحوادث لا فيمن\n\n\nيخلو عن الحوادث وأما تقسيمك الآخر على هذا الجواب وهو قولك إنه إذا خلا عنها ثم قبلها فلا يخلو إما أن يقبلها لنفسه أو لأمر آخر ما هو نفسه فإن قبلها لنفسه فلا يخلو عنها وإذا لم يخل عنها فهو حادث مثلها ونقول له أما الحوادث كلها فيستحيل دخولها في الوجود لأنها لا تتناهى وأنت تعلم أن الذي يقبل الحوادث قد كان خليا عنها أي عن حادث معين مع وجود نفسه ثم قبل ذلك الحادث لنفسه لأنه لو لا ما هو على صفة يقبله ما قبله فقد عرا وخلا عن ذلك الحادث بعينه مع وجود نفسه فما من حادث تفرضه إلا ويعقل وجود نفس القابل له وذلك الحادث غير موجود وإن لم يخل عن الحوادث فلا يلزم أن يكون حادثا مثلها مع قبوله لها لنفسه فالحق قد أخبر عن نفسه أنه يجيب عبده إذا سأله ويرضى عنه إذا أرضاه ويفرح بتوبة عبده إذا تاب فانظر يا عقل لمن تنازع ومن المحال أن نصدقك ونكذب ربك ونأخذ عنك الحكم عليه وأنت عبد مثلي ونترك الأخذ عن الله وهو أعلم بنفسه فهو الذي نعت نفسه بهذا كله ونعلم حقيقة هذا كله بحده وماهيته ولكن نجهل النسبة إلى الله في ذلك لجهلنا بذاته وقد منعنا وحذرنا وحجر علينا التفكر في ذاته وأنت يا عقل بنظرك تريد أن تعلم حقيقة ذات خالقك لا تسبح في غير ميدانك ولا تتعد في نظرك معرفة المرتبة لا تتعرض للذات جملة واحدة فإن الله قد أبان لنا أنه محل أو منزل لتعريس حركات عباده في أسفارهم بأحوالهم فتفطن إن كنت ذا عقل سليم ثم إنه ما يلزم إذا كان الأمر عندك قد حدث أن‏\n\n\nيكون ذلك الأمر حادثا في نفسه لا عقلا ولا عرفا ولا شرعا فإنك تقول قد حدث عندنا اليوم ضعيف وهو صحيح حدوثه عندكم لا حدوثه في نفسه في ذلك الوقت بل قد كانت عينه موجودة منذ خمسين سنة ومع هذا فلا يحتاج إليه لبيانه وظهوره فمن أراد الدخول على الله فليترك عقله ويقدم بين يديه شرعه فإن الله لا يقبل التقييد والعقل تقييد بل له التجلي في كل صورة كما له أن يركبك في أي صورة شاء فالحمد لله الذي ركبنا في الصورة التي لم تقيده سبحانه بصورة معينة ولا حصرته فيها بل جعلت له ما هو له بتعريفه أنه له وهو تحوله في الصور فما قدر الله حق قدره إلا الله ومن وقف مع الله‏\nفيما وصف به نفسه لم يدخله تحت حكم عقله من حيث نفسه تعالى الله عن ذلك علوا كبيرا واعلم أن مسمى النكاح قد يكون عقد الوطء وقد يكون عقدا ووطأ معا وقد يكون وطأ ويكون نفس الوطء عين العقد لأن الوطء لا يصح إلا بعقد الزوجين ومنه إلهي وروحاني وطبيعي وقد يكون مرادا للتناسل أعني للولادة وقد يكون لمجرد الالتذاذ فأما الإلهي فهو توجه الحق على الممكن في حضرة الإمكان بالإرادة الحبية ليكون معها الابتهاج فإذا توجه الحق عليه بما ذكرناه أظهر من هذا الممكن التكوين فكان الذي يولد عن هذا الاجتماع الوجود للممكن فعين الممكن هو المسمى أهلا والتوجه الإرادي الحي نكاحا والإنتاج إيجادا في عين ذلك الممكن ووجودا إن شئت والأعراس الفرح الذي يقوم بالأسماء الحسنى لما في هذا النكاح من الإيجاد الظاهر في أعيان الممكنات لظهور آثار الأسماء فيه إذ لا يصح لها أثر في نفسها ولا في مسماها وإنما أثرها وسلطانها في عين الممكن لما فيه من الافتقار والحاجة إلى ما بيد الأسماء فيظهر سلطانها فيه فلهذا نسبنا الفرح والسرور وإقامة الأعراس إليها وهذا النكاح مستمر دائم الوجود لا يصح فيه انقطاع والطلاق لهذا العقد النكاحي لا يقع في الأعيان القابلة للاعراض والصور وإنما يقع في الصور والأعراض وهو عدمها لنفسها في الزمان الثاني من زمان وجودها وهو خلع لأنه رد الوجود الذي أعطاها عليه لأنه بمنزلة الصداق لعين هذا الممكن الخاص فإن قلت فالحق لا يتصف بالوجود الحادث فمن قبل هذا المردود وأين خزانته ولا بد له من محل قلنا تجلى الحق في الصور وتحوله الذي جاء به الشرع إلينا ورأيناه كشفا عموما وخصوصا هو عين ما ردته الممكنات الصورية والعرضية من الوجود حين انعدمت فالحق له نسبتان في الوجود نسبة الوجود النفسي الواجب له ونسبة الوجود الصوري وهو الذي يتجلى فيه لخلقه إذ من المحال أن يتجلى في الوجود النفسي الواجب له لأنه لا عين لنا ندركه بها إذ نحن في حال عدمنا ووجودنا مرجحين لم يزل عنا حكم الإمكان فلا نراه إلا بنا أي من حيث تعطيه حقائقنا فلا بد أن يكون تجليه في الوجود الصوري وهو الذي يقبل التحول والتبدل فتارة يوصف به الممكن الذي يختلع به وتارة يظهر به الحق في تجليه فانظر يا ولي في هذا الموطن فإنه موطن خفي جدا ولو لا لسان الشرع الذي أومأ إليه ونبه عليه ما أفصحنا عنه لأهل طريقنا فإن الكثير من أهل طريق الله وإن شهدوا تجلى الحق لكن لا معرفة لهم بذلك ولا بما رأوه ولا صورة ما هو الأمر عليه ومن علم ما قررناه من بيان قصد الشرع فيه علم كيف صدور العالم وما هو العالم وما يبقى عينه من العالم وما يفنى منه وما يرثه الحق من العالم فإنه القائل إِنَّا نَحْنُ نَرِثُ الْأَرْضَ ومن عَلَيْها وإِلَيْنا يُرْجَعُونَ وما ورث على الحقيقة إلا الوجود الذي يتجلى فيه لمن ظهر من خلقه الذي اختلعت فيه صور الممكنات وأعراضها لأن الوارث لا يكون مع وجود الموروث عنه وبقائه وإنما يكون بعد انتقاله وعدمه من هذا الموطن وهو اتصافه بالعدم وليس ذلك إلا للصور والأعراض فهو وارث على الدوام والاختلاع واقع على الدوام والقبول حاصل على الدوام والنكاح لازم على الدوام وهذا معنى الديمومة المنسوبة إلى الحق فهو تعالى يعمل مع كونه لم يزل موجدا للعالم ولم يزل العالم محدثا فالعالم له حكم الحدوث في عين القدم فلا يعقل له طرف ينتهي إليه لأنه من ذاته لم يزل تحت حكم الترجيح الإلهي له إما بالعدم أو بالوجود وإذا تقرر هذا في النسبة الإلهية فلنذكر حكم النسبة الروحانية في هذه المسألة وذلك أن الوجود الذي ذكرناه في النسبة الإلهية هو الوجه الخاص الذي لكل ممكن من الله سواء كان هناك سبب وضعي أو لم يكن فالله الإيجاد على كل حال وبكل وجه علوا وسفلا وأما النكاح الروحاني فحضرته الطبيعة وهي الأهل الأصلي في النكاح الإلهي فإذا ولدت في النكاح الأول صورة من الصور كانت تلك الصورة أهلا لهذا الروح الكل فانكحه الحق إياها فبنى بها فلما واقعها ظهر عن ذلك الوقاع ولد وهو الروح الجزئي فحييت به تلك الصورة وصار هذا الولد\n\n\nيقوم بها ويدبرها ويسعى عليها ويسافر ويقتحم الأخطار ليكتسب ما يجود به عليها حسا ومعنى أي من الأرزاق المحسوسة والمعنوية والعرس الذي يكون لهذا النكاح الروحاني إنما تقيمه القوي التي لا ظهور لها إلا في هذه الصورة الطبيعية بوجود هذا النكاح فيقع لها الالتذاذ والفرح بما يحصل لها من الأثر بوجود هذا البناء وأما النكاح الطبيعي فهو ما تطلبه هذه الأرواح الجزئية المدبرة لهذه الصور من اجتماع الصورتين الطبيعية بالالتحام‏\nوالابتناء المسمى في عالم الحس نكاحا فيتولد عن هذا النكاح أمثال الزوجين من كل حيوان ونبات فيظهر إنسان من إنسانين وفرس من فرسين وقد يقع الالتحام من غير المثلين فيتولد بينهما شكل غريب ما يشبه عين واحد من الزوجين كالبغل بين الحمار والفرس وكل مولد بين شكلين مختلفين لا يولد أبدا فإنه عقيم فهو الذي يولد ولا يلد فنكاح مثل هذا النوع ليس لولادة ولكن لمجرد الشهوة والالتذاذ فيشبه النكاح الأول هذا النكاح الذي حرج عنه غير جنس الزوجين من كونه نكاحا في غير الجنس فيتولد بينهما الشكل الغريب ما يشبه واحدا منهما أعني من الزوجين فافهم وتلقيح الشجر بالرياح اللواقح من النكاح الطبيعي وأما الريح العقيم فيشبه نكاحها نكاح الشكل الغريب الذي لا يتولد عنه شي‏ء وأعراس هذا النكاح الطبيعي ما هو المشهود في العرف المسمى عرسا في الشاهد من الولائم والضرب بالدفوف وأما ما يتولد من النكاح الطبيعي في الشجر فهو ما يعطيه من الثمر عند هذا الحمل وصورة وقع نكاح الأشجار زمان جرى الماء في العود وهو عند طلوع السعود فهو نكاح سعيد في طالع سعيد وما قبل ذلك فهو زمان خطبة ورسل تمشي بين الزوجين الرجل والمرأة ووقوع الولادة على قدر زمان حمل هذين النوعين من الشجر فمنه ما يولد في الربيع ومنه ما يولد في الصيف كما يكون حمل الحيوان يختلف زمانه باختلاف طبيعته فإنه لا يقبل من تأثير الزمان فيه إلا بقدر ما يعطيه مزاجه وطبعه فإذا نكح الجو الأرض وأنزل الماء ودبرته في رحمها آثار الأنوار الفلكية ضحكت الأرض بالأزهار وأَنْبَتَتْ من كُلِّ زَوْجٍ بَهِيجٍ وإنما كان زوجا من أجل ما يطلبه من النكاح إذ لا يكون إلا بين الزوجين فعين عرسه هو ما تبرزه من الأزهار والمخلقة في النبات هو ما سلم من الجوائح وغير المخلقة ما نزلت به الجائحة والله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ فهذا قد ذكرنا طرفا من الخواتم والأعراس مجملا من غير تفصيل لكن حصرنا الأمهات في ذلك وأما الأسرار الأعجمية فإنما سمينها أعجمية لأن العربية من الأسرار هي التي يدركها عين الفهم صورا كالآيات المحكمات في الكتب المنزلة والأسرار الأعجمية ما تدرك بالتعريف لا بالتأويل وهي كالآيات المتشابهات في الكتب المنزلة فلا يعلم تأويلها إلا الله أو من أعلمه الله ليس للفكر في العلم بها دخول ولا له فيها قدم وما يتبع استخراج السر فيها إلا الذي ذكره الله تعالى وهو الذي في قلبه زيغ أي ميل عن الحق باتباعه ما قد ذكر الله فيه أنه لا يعلم تأويله إلا الله فمن أراد أن يعلم ذلك فلا يخض في تلك الأسرار وليتعمل في الطريق الموصلة إلى الله وهو العمل بما شرع الله له بالتقوى فإنه قال تعالى إنه ينتج لصاحبه علم الفرقان فإذا عمل به تولى الله تعليمه تلك الأسرار الأعجمية فإذا أنالها إياه صارت في حقه عربية فيعلم ما أراد الله بها ويزول عنه فيها حكم التشابه الذي كانت توصف به قبل العلم بها لأن الله جلاها متشابهة لها طرفان في الشبه فلا يدري صاحب النظر ما أراد منزلها بها في ذلك التشابه فإنه لا بد من تخليصه إلى أحد الطرفين من وجه خاص وإن جمعت بين الطرفين فلكل طرف منهما ما ليس للآخر من ذلك المخلوق أو من ذلك المنزل إن كان من صور كلام الله فالمنزل كقوله تعالى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ وكقوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ وكقوله ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ وكقوله وهُوَ الله في السَّماواتِ وفي الْأَرْضِ وكقوله هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ الله في ظُلَلٍ من الْغَمامِ وكقوله وجاءَ رَبُّكَ والْمَلَكُ صَفًّا صَفًّا وأمثال هذا في الكتب المنزلة وأما أخبار الرسل المترجمين عن الحق ما أوحى به على ألسنتهم إلينا فلا تحصى كثرة من الأمور المتشابهة فلا يتبع ذلك بعد التعريف إلا من في قلبه زيغ وأما من يتبع الطرق الموصلة إلى الكشف عنها فما هو من أهل الزيغ بل هو من أهل الاستقامة فالمحمدي هو المحكم من الآيات لأنه عربي والمتشابه موسوي لأنه أعجمي فالعجمية عند أهل العجمية عربية والعربية عند الأعاجم عجمة وفي الألفاظ هي مستورة بالاصطلاح وما ثم عجمة إلا\n\n\nفي الاصطلاح والألفاظ والصور الظاهرة وأما في المعاني فكلها عربية لا عجمة فيها فمن ادعى‏\n\n\nعلم المعاني وقال بالشبه فلا علم له أصلا بما ادعاه أنه علمه من ذلك فإن المعاني كالنصوص عند أهل الألفاظ لأنها بسائط لا تركيب فيها ولو لا التركيب ما ظهر للعجمة صورة في الوجود وفي هذا المنزل من العلوم ما لا يحصى كثرة إن ذكرناها طال الأمر فيها ولهذا المنزل السيادة على كل منزل من منازل الجمع والوجود وقد ذكرنا حصر هذه المنازل في هذا الكتاب فيما تقدم‏\nفي هذا الباب فاعلم إن هذا المنزل هو منزل البرزخ الحقيقي فإن البرزخ يتوسع فيه الناس وما هو كما يظنون بما هو كما عرفنا الله به في كتابه في قوله في البحرين بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ فحقيقة البرزخ أن لا يكون فيه برزخ وهو الذي يلتقي ما بينهما بذاته فإن التقى الواحد منهما بوجه غير الوجه الذي يلقى به الآخر فلا بد أن يكون بين الوجهين في نفسه برزخ يفرق بين الوجهين حتى لا يلتقيان فإذا ليس ببرزخ فإذا كان عين الوجه الذي يلتقي به أحد الأمرين الذي هو بينهما عين الوجه الذي يلتقي به الآخر فذلك هو البرزخ الحقيقي فيكون بذاته عن كل ما يلتقي به فيظهر الفصل بين الأشياء والفاصل واحد العين وإذا علمت هذا علمت البرزخ ما هو ومثاله بياض كل أبيض هو في كل أبيض بذاته ما هو في أبيض ما بوجه منه ولا في أبيض آخر بوجه آخر بل هو بعينه في كل أبيض وقد تميز الأبيضان أحد هما عن الآخر وما قابلهما البياض إلا بذاته فعين البياض واحد في الأمرين والأمران ما هو كل واحد عين الآخر فهذا مثال البرزخ الحقيقي وكذلك الإنسانية في كل إنسان بذاتها الواحد هو البرزخ الحقيقي وما ينقسم لا يكون واحدا والواحد يقسم ولا يقسم أي ولا ينقسم في نفسه فإنه إن قبل القسمة في عينه فليس بواحد وإذا لم يكن واحدا لم يقابل كل شي‏ء من الأمرين الذي يكون بينهما بذاته والواحد معلوم أنه ثم واحد بلا شك والبرزخ يعلم ولا يدرك ويعقل ولا يشهد ثم إن الناس جعلوا كل شي‏ء بين شيئين برزخا توسعا وإن كان ذلك الشي‏ء المسمى عندهم برزخا جسما كبيرا أو صغيرا لكنه لما منع أن يلتقي الأمران اللذان هو بينهما سموه برزخا فالجوهران اللذان يتجاوران ولا ينقسم كل واحد منهما عقلا ولا حسا لا بد من برزخ يكون بينهما وتجاور الجوهرين تجاور أحيازهما وليس بين أحيازهما حيز ثالث ليس فيه جوهر وبين الحيزين والجوهرين برزخ معقول بلا شك هو المانع أن يكون عين كل جوهر عين الآخر وعين كل حيز عين الآخر فهو قد قابل كل جوهر وكل حيز بذاته من عرف هذا عرف حكم الشارع‏\n\n\nإذ قال إن الله خلق الماء طهورا لا ينجسه شي‏ء\n\n\nمع حصول النجاسة فيه بلا شك ولكن لما كانت النجاسة متميزة عن الماء بقي الماء طاهرا على أصله إلا أنه يعسر إزالة النجاسة منه فما أباح الشارع من استعمال الماء الذي فيه النجاسة استعملناه وما منع من ذلك امتنعنا منه لأمر الشرع مع عقلنا أن النجاسة في الماء وعقلنا أن الماء طهور في ذاته لا ينجسه شي‏ء فما منعنا الشارع من استعمال الماء الذي فيه النجاسة لكونه نجسا أو تنجس وإنما منعنا من استعمال الشي‏ء النجس لكوننا لا نقدر على فصل أجزائه من أجزاء الماء الطاهر فبين النجاسة والماء برزخ مانع لا يلتقيان لأجله ولو التقيا لتنجس الماء فاعلم ذلك أ لا ترى الصور التي في سوق الجنة كلها برازخ تأتي أهل الجنة إلى هذا السوق من أجل هذه الصور وهي التي تتقلب فيها أعيان أهل الجنة فإذا دخلوا هذا السوق فمن اشتهى صورة دخل فيها وانصرف بها إلى أهله كما ينصرف بالحاجة يشتريها من السوق فقد يرى جماعة صورة واحدة من صور ذلك السوق فيشتهيها كل واحد من تلك الجماعة فعين شهوته فيها التبس بها ودخل فيها وحازها فيحوزها كل واحد من تلك الجماعة ومن لا يشتهيها بعينه واقف ينظر إلى كل واحد من تلك الجماعة قد دخل في تلك الصورة وانصرف بها إلى أهله والصورة كما هي في السوق ما خرجت منه فلا يعلم حقيقة هذا الأمر الذي نص عليه الشرع ووجب به الايمان إلا من علم نشأة الآخرة وحقيقة البرزخ وتجلى الحق في صور متعددة يتحول فيهن من صورة إلى صورة والعين واحدة فيشهد بصرا تحوله في صور ويعلم عقلا أنها ما تحولت قط فكل قوة أدركت بحسب ما أعطتها ذاتها والحق في نفسه صدق العقل في حكمه وصدق البصر في حكمه ثم له علم بنفسه ما هو عين ما حكم به العقل عليه ولا هو عين ما حكم به شهود البصر عليه ولا هو غير هذين بل هو عين ما حكما به وهو ما علمه الحق من نفسه مما لم يعلمه هذان الحاكمان فسبحان العليم القدير قدر وقضى وحكم وأمضى وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ في كل معبود وأين أبين من تحوله في صور المعبودات ولكن أكثر الناس لا يعلمون ثم شرع لنا أن لا نعبده في شي‏ء منها وإن علمنا أنه عينها وعصى من عبده في تلك الصور وجعله مشركا وحرم على نفسه المغفرة فوجبت المؤاخذة في المشرك ولا بد ثم بعد ذلك ترتفع المؤاخذة وما ارتفعت إلا لجهله بصورة ما عنده في الشريك بنفي تلك الصفة في الآخرة عن الشريك فلذلك عوقب ولذلك شملته الرحمة بعد العقوبة وإن‏\nلم يخرج من النار والعالم منا هنا بصورة ما عبده المشرك ما نزحزح عن علمه في الدنيا ولا في الآخرة لأنه لم تقع عينه في الدنيا ولا تعلق علمه إلا على المعبود في تلك الصورة والمشرك لم يكن حاله كذلك وإنما كان حاله شهودا لصورة فرجع المشرك عنها في الآخرة ولم يرجع العالم فلو رجع لكان من الجاحدين فلا يصح له أن يرجع‏\n\n\n> فالشرك باق ولكن ليس يعلمه *** إلا الذي شاهد الأعيان والصورا\n\n\n> فمن يقول بتوحيد أصاب ومن *** يقول بالشرك فيه صدق الخبرا\n\n\n> إن الشريك لمعدوم وليس له *** في عين عابدة عين ولا أثرا\n\n\nوفي هذا المنزل من العلوم لا يعلمه نبي ولا ولي كان قبل هذه الأمة اختص بعلمه هذا الرسول محمد صَلَّى اللهُ عَليهِ وسَلَّم وهذه الأمة المحمدية فالكامل من هذه الأمة حصل له هذا المقام ظاهرا وباطنا وغير الكامل حصل له ظاهرا أو باطنا ولم يكمل له ولكن شمله لكونه من الأمة أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم ولا يكاثر من أمته إلا بالمؤمنين منهم صغيرا كان المؤمن أو كبيرا فإن الذرية تابعة للآباء في الايمان ولا يتبعونهم في الكفر إن كان الآباء كفارا ولكن تعزل كفار كل أمة بمعزل عن كفار الأمة الأخرى فإن العقوبة تعظم بعظم من كفر به هذا هو المعهود إلا كفار هذه الأمة فإنهم أخف الناس عذابا لكون من كفرت برسالته التي أرسله الله بها رَحْمَةً لِلْعالَمِينَ وقد أبان الله ذلك في الدنيا وجعله عنوان حكم الآخرة وذلك‏\n\n\nأن رسول الله محمدا صَلَّى اللهُ عَليهِ وسَلَّم لما اشتد قيامه في الله وغيرته على الحق في قصة رعل وذكوان وعصية جعل يدعو عليهم في كل صلاة شهرا كاملا وهو القنوت‏\n\n\nفأوحى الله تعالى إليه في ذلك لما علم من إجابته إياه إذا دعاه في أمر فنهاه عن الدعاء عليهم إبقاء لهم ورحمة بهم فقال وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ أي لترحمهم فإنه مرسل إلى جميع الناس كافة ليرحمهم بأنواع وجوه الرحمة ومن وجوه الرحمة أن يدعو لهم بالتوفيق والهداية وقد صح عنه صَلَّى اللهُ عَليهِ وسَلَّم أنه كان يقول اللهم اهد قومي فإنهم لا يعلمون ونهى عن الدعاء عليهم‏\n\n\nفإذا كان من أشرك به يعتب رسوله صَلَّى اللهُ عَليهِ وسَلَّم في الدعاء عليهم فكيف يكون فعله فيهم إذا تولى سبحانه الحكم فيهم بنفسه وقد علمنا أنه تعالى ما ندبنا إلى خلق كريم إلا كان هو أولى به فمن هنا يعلم ما حكمه في المشركين يوم القيامة من أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم وإن أخذهم الله بالشرك في الآخرة إذ لا بد من المؤاخذة ولكن مؤاخذته إياهم فيها لطف إلهي لا يستوي فيه مشرك غير هذه الأمة بمشركها أعرف ذلك اللطف ولا أصرح به كما ذكر صَلَّى اللهُ عَليهِ وسَلَّم فيمن أصابتهم النار من هذه الأمة بذنوبهم بل من الأمم إن الله يميتهم فيها أمانة الحديث وقد مر في هذا الكتاب خرجه مسلم في صحيحه وقد رميت بك على الطريق لتعلم حكم الله في هذه الأمة المحمدية مؤمنها والكافر بها فإن كفر الكافر منها لا يخرجه عن الدعوة فله أو عليه حكمها ولا بد فهم خير أمة أُخْرِجَتْ لِلنَّاسِ المؤمن منهم بإيمانه والكافر منهم بكفره هما خير من كل مؤمن من غير هذه الأمة وكافر وهذا الذي ذكرناه في هذا المنزل بالنظر إلى ما يحويه من العلوم جزء من ألف جزء بل من آلاف والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Eighty-Two: Concerning the Knowledge of the Station of the Seals (الخواتم), the Number of the Divine Halting Places (الأعراس الإلهية), and the Non-Arabic Secrets (الأسرار الأعجمية).\n\nMosaic and Necessary (موسوية لزومية)\n\nThe science of the Isthmuses (علم البرازخ) is a knowledge none grasps,\nSave he who gathers the extremities and the middle.\nThrough it, he has penetration in every cosmic event,\nAnd by it, he holds sway over the worlds.\nIf he wills vengeance upon a person, he contracts,\nAnd if he wills grace upon a person, he expands.\nIf the most just of creation in the balance of His Mercy,\nYou see him in the worlds having dealt justly therein.\n\n### [Indeed, Existence in the forms is a circle whose eternity bends back upon its pre-eternity]\n\nKnow that since the Seals (الخواتم) are the very essences (أعيان) of the Precedents (السوابق), we know that Existence (الوجود) in the forms is a circle whose eternity (أبد) bends back upon its pre-eternity (أزل). Thus, no God (إله) is conceived without conceiving the worshipped (المألوه), nor is any Lord (رب) conceived without conceiving the lorded-over (المربوب). Every intelligible concept has a level (رتبة) that is not the essence of the other. Just so, we know that between the Seal (الخاتمة) and the Precedent (السابقة) there is an intelligible distinction (تميزا معقولا) by which one is called a Precedent and the other a Seal. Our statement that the Seal is the very essence of the Precedent is only true regarding the judgment upon the subject of the judgment; and it is through the subject of the judgment that the Seal is distinguished from the Precedent.\n\n### [The Nuptials (الأعراس) are of two types]\n\nKnow that the Nuptials (الأعراس) are of two types: a nuptial for a contract (عقد), a nuptial for a contract and consummation (دخول), and a nuptial by consummation without a contract. The contract is the expression of the mutual consent of the spouses. Consummation is intercourse, either for the sake of pleasure or for the creation of an essence (عين). Consummation without a contract is the nuptial of slave-women. Since there is no marriage (نكاح) superior to the marriage of a gift (نكاح الهبة)—because it is without compensation, like the Name The Giver (الواهب) who gives to bestow grace—its specific wording was reserved for the best of creation, Muhammad, peace and blessings be upon him. The Almighty said: <<وامْرَأَةً مُؤْمِنَةً إِنْ وَهَبَتْ نَفْسَها لِلنَّبِيِّ إِنْ أَرادَ النَّبِيُّ أَنْ يَسْتَنْكِحَها خالِصَةً لَكَ من دُونِ الْمُؤْمِنِينَ>> (And a believing woman if she gives herself to the Prophet, if the Prophet desires to marry her—[this is] exclusively for you, excluding the [other] believers). Every marriage outside of what we have mentioned is fornication (سفاح), not a marriage; that is, it is like a fluid thing that has no stability because it lacks a contract, a bond, or a tie.\n\nThen we return and say: As for the Seals (الخواتم), they are determined by fixed terms (الآجال). Were it not for this, nothing would have a seal, because the Seal is the termination of that which is described by it. Every Seal has a Precedent (سابقة), but the reverse is not true. Whoever looks at the permanence and continuous flow of the Divine Command (الأمر الإلهي) says there is no Seal. But whoever looks at the distinction between things in the descent (التنزل) affirms Seals in things, because the distinctions make them manifest. An example of this is found entirely within the world of division and composition (عالم الانقسام والتركيب). If you look at the Qur’an, for instance, between two words, two verses, or two chapters, you say, upon finding the distinguishing separation between the two matters: If it occurs between two words, the Seal of the first is a specific letter. If it is two verses, the Seal of the first is a specific word. If it is two chapters, the Seal of the first is a specific verse. If it is an ephemeral event (أمر حادث), its term (أجل) in this world is said to be such-and-such, because everything in this world <<يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى>> (runs to a specified term). The duration ends with the term, so the Seal of that thing is the point where its ruling terminates.\n\nThe termination of breaths in an animal is the last breath it takes upon its transition to the Isthmus (البرزخ). Then the duration in the Isthmus ends at the separation between it and the Resurrection (البعث). Then the duration in the Resurrection ends at the separation between it and the entry into the two Abodes (الدارين). Then the duration in the Fire, for those of the People of Paradise who are in it, ends at the separation between their residence therein and their exit from it by intercession and grace. Then the duration of the punishment for the People of the Fire who will not leave it ends at the separation between the state of punishment and the realization of the ruling of Mercy (الرحمة) which <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompassed all things). They will then enjoy bliss in the Fire according to the variation of their temperaments, as we have mentioned.\n\nAfter this, there remains no manifest term defined by duration, but rather subtle, hidden terms (آجال خفية دقيقة). This is because the ephemeral entity (المحدث) whose essence (عين) is permanent is subject to the constant fluctuation of states, necessitating its perpetual need (الافتقار) for the permanence of Existence (الوجود) for it always. Thus, its states never depart from fixed terms, and it remains perpetually between a Precedent and a Seal.\n\nAs for faith (الإيمان), its Precedent is *Lā ilāha illā Allāh* (There is no god but Allah), and its Seal is the removal of harm from the path. The Lawgiver (الشارع) expressed the Precedent by the highest and the Seal by the lowest. There is nothing higher in faith than Unity (التوحيد), and nothing lower than removing harm from the path. This includes the path of Unity, where the harm in its path is manifest and hidden polytheism (الشرك الجلي والخفي). The hidden polytheism is reliance on means (الأسباب), which is divided into hidden and more hidden. The more hidden are the inner means, and the hidden are the apparent means. The manifest polytheism is attributing divinity (الألوهة) to ephemeral entities (المحدثات). The Monotheist (الموحد) removes all of these from his heart and the heart of others, for they are harm in the path of Unity. Every harm in the path of any path of faith is according to the specific quality called faith; thus, what opposes it is called harm in its path. That by which the harm is removed from that specific quality is the Seal of that quality, whatever it may be.\n\nHowever, there is no Seal for the ruling of Allah over His servants in totality and absolute terms, nor is there a Precedent. This is because the non-existence (العدم) of the contingent (الممكن) preceding its existence has always been preferred for it by the supposition of its contingent existence. Thus, it has no Precedent. This is a subtle and hidden knowledge (علم دقيق خفي), easy to conceive yet impossible to grasp, because it quickly slips away from the mind during conception. The temporality (الحدوث) of the contingent is only from the perspective of its existence, according to all views. But according to us, it is not so. Rather, temporality, in its regard, is that its non-existence and its existence have always been preferred in every state, because it is contingent by its Essence (لذاته). Although some thinkers have said that its temporality is nothing but its contingency, the explanation I have given allows for ambiguity in the statement of that judge. It is possible that he uses synonyms, so that its being called temporal is the same as its being called contingent. It is also possible that he means what we mean: that the non-existence which is judged upon it as belonging to its Essence is, in our view, perpetually preferred. If we expand our expression with the thinkers, we do not say that the non-existence of the contingent belongs to its self, because if non-existence were an essential attribute (صفة نفس) for it, its existence would be impossible, just as the existence of the impossible is impossible. Rather, we say that the precedence of non-existence for it over existence is due to its Essence, not to Knowledge (لا العلم), and there is a great difference between the two. However, our doctrine concerning it is only that its non-existence has always been preferred. The existence of the contingent has a Precedent because it was not, and then it was. But this is only from the perspective of its essence (عينه) when it subsists by itself, not from the perspective of its form (صورته). Thus, it has no Seal in its essence, but it has Seals in its form through similitudes and opposites. Every ephemeral entity (حادث) other than the essences subsisting by themselves has a Precedent and a Seal. Yet, its Precedent is the very essence of its Seal, because its duration of being is nothing other than the time of its being, specifically, and then it ceases to exist by itself. The Precedent is only distinguished from the Seal by the ruling: you rule upon it with existence in the Precedent, and with non-existence in the Seal. Yet, the essence of its Precedent is the essence of its Seal, because it has no existence in the second time-frame of its existence. Understand this.\n\n### [The Seal of the Seekers (خاتمة السالكين)]\n\nKnow that when the seeker (السالك) reaches the door that every seeker reaches through acquisition (الاكتساب), the last step in the spiritual journey (السلوك) is the Seal of the Seekers. Then the door opens, and the Divine gifts and graces (العطايا والمواهب الإلهية) emerge by virtue of Divine care (العناية) and specialization (الاختصاص), not by virtue of acquisition. This Divine Door is entirely acceptance; there is absolutely no rejection in it, unlike the doors of ephemeral entities (المحدثات). Concerning this, I say:\n\nEvery door, when you reach it,\nAllows both rejection and acceptance.\nExcept the Door of the God, which is acceptance\nFor him who comes to Him, hearing and obedient.\nAnd he who was rejected, when he imagined\nThat it was the Door, fell down prostrate and slain.\nHis Lord calls out to him: \"That is not My Door!\nMy Door is for him who desires humility (خشوعا).\"\n\"Had you been discerning when you came to it,\nYou would have witnessed a wondrous matter within yourself.\"\n\"You are not what you are; you are not other than Us,\nSo pour forth tears for separation, if you wish.\"\n\nWhen I reached this Divine Door, among the company of the Attained (الواصلين) of my time, I found it open, with neither gatekeeper nor doorkeeper. I stood there until I was invested with the robe of Prophetic Inheritance (الوراثة النبوية). I saw a small, closed window (خوخة مغلقة) and wanted to knock on it. I was told: \"Do not knock, for it will not open.\" I asked, \"Then why was it placed there?\" I was told: \"This is the window reserved exclusively for the Prophets and Messengers, peace be upon them. When the Religion was perfected, it was closed. It was from this door that the robes of the Divine Laws (الشرائع) were bestowed upon the Prophets.\"\n\nThen I looked closely at the Door and saw that it was a transparent body (جسما شفافا) that revealed what was behind it. I saw that this Unveiling (الكشف) was the very essence of the understanding (الفهم) possessed by the inheritors regarding the Divine Laws, and the result of the independent reasoning (اجتهاد) of the jurists concerning the rulings. So I remained close to that window, gazing at what was beyond that Door. The forms of the known things (صور المعلومات) were revealed to me from behind it, exactly as they are. That is the very essence of the Opening (الفتح) that scholars find in their inner beings, yet they do not know whence it came to them, unless they are unveiled (كوشفوا) as we were unveiled. General prophecy (النبوة العامة) is without legislation (تشريع). The specific prophecy (النبوة الخاصة), whose door is that window, is the prophecy of the Divine Laws. Its door is closed, and the knowledge of what is within it is confirmed: there is no Messenger (رسول) and no Prophet (نبي) [after Muhammad].\n\nI thanked Allah for the strength He granted me, secretly and openly. When I looked out from the first Door, which the seekers reach and from which the robes are bestowed upon them, I saw the gratitude of the thankful (شكر الشاكرين) as the forms that were revealed to us behind the window. The manifest aspect of gratitude was like the window. I saw no one giving thanks except for one person from behind the manifest words. In that state, I found no helper for my gratitude, so I spoke, addressing my Lord, the Almighty and Glorious:\n\nIf I seek to give thanks, I find no one to thank You,\nAnd if I do not give thanks, I would be ungrateful.\nYou veiled the minds of creation by the means\nYou established, so I found no one jealous over You.\nYet, the translations have conveyed jealousy on Your behalf,\nWhich You commanded a servant, expert in that, to deliver.\nTherefore, You were not witnessed, nor were You manifest,\nAnd had You been witnessed, You would have been Forgiving.\nYou spoke through confusion (التلبيس) in the dominion (الملك)\nWhere You sent a personage (شخيصا) as a seer for mankind.\nHow can we attain knowledge when the matter has always\nBeen manifest from You in the state of contingency (الإمكان)?\n\nThus, Muhammad, peace and blessings be upon him, was the very essence (عين) of the Precedent of human prophecy (النبوة البشرية), by his statement informing us: \"I was a Prophet while Adam was between water and clay.\" And he is the very essence of the Seal of the Prophets (خاتم النبيين), by the Almighty’s saying: <<ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ>> (But [he is] the Messenger of Allah and the Seal of the Prophets). When it was claimed that he was the father of Zayd, Allah negated that he was the father of any of our men, in order to elevate his suitability and distinguish his rank. Do you not see that he, peace and blessings be upon him, had no male child from his loins who lived long enough to be legislated for? This was because it was predetermined in Allah’s Knowledge that he was the Seal of the Prophets.\n\nHe, peace and blessings be upon him, said: \"The Messengership (الرسالة)—meaning the sending forth to people with legislation (التشريع) for them—and Prophecy (النبوة) have been cut off.\" That is, there remains no one for whom Allah legislates a ruling that he must follow, which is not our Law (شرعنا) that we brought. So, there is no Messenger after me who will bring a Law that contradicts my Law to the people, nor a Prophet who will follow a Law unique to him from his Lord. Thus, he explicitly stated that he is the Seal of legislative prophecy (نبوة التشريع). Had he intended otherwise than what we have mentioned, it would contradict his saying that Jesus, peace be upon him, will descend among us as a just judge, praying behind us—meaning, according to the Law that we follow. We do not doubt that Jesus is a Messenger and a Prophet. Thus, we know that he, peace and blessings be upon him, meant that there is no Law after him that abrogates his Law.\n\nBy this statement, every human being in the world, from the time of his mission until the Day of Resurrection, entered into his Community (أمته). Al-Khidr, Elias, and Jesus are part of the manifest Community of Muhammad, peace and blessings be upon him, and those from Adam until the time of the Messenger of Allah’s mission are part of his inner Community. He is the Prophet by Precedent and he is the Prophet by Seal. Thus, it became manifest in the Messenger of Allah, peace and blessings be upon him, that the Precedent is the very essence of the Seal in prophecy.\n\nAs for the sealing role of Jesus, peace be upon him, he is the Seal of the cycle of dominion (دورة الملك). He is the last Messenger to appear, and he appeared in the form of Adam in his genesis, as he was not born of a human father and did not resemble the sons—meaning the progeny of Adam—in his development. He did not remain in the womb for the customary duration; rather, his transition through the stages of natural development did not follow the passage of customary time, but resembled the Resurrection (البعث)—meaning the quickening of the dead on the Day of Resurrection in a short time, in the form they came upon in a long time. He falls under the generality of the saying: <<كَما بَدَأَكُمْ تَعُودُونَ>> (As He originated you, you will return) in procreation and transition through stages.\n\nFurthermore, when Jesus descends to Earth at the end of time, he will be given the Seal of the Greater Sainthood (ختم الولاية الكبرى) from Adam to the last Prophet, as an honor to Muhammad, peace and blessings be upon him, since Allah did not seal the general sainthood (الولاية العامة) in any community except with a Messenger who followed him. Therefore, Jesus holds the Seal of the cycle of dominion and the Seal of Sainthood—meaning general sainthood—making him one of the Seals in the World (العالم).\n\nAs for the Seal of the Muhammadan Sainthood (خاتم الولاية المحمدية), which is the specific Seal for the sainthood of the manifest Community of Muhammad, Jesus, peace be upon him, and others like Elias and Al-Khidr, and every saint of Allah from the manifest Community, fall under the ruling of his sealing role. Thus, even though Jesus is a Seal, he is sealed beneath the Seal of this Muhammadan Seal. I learned the account of this Muhammadan Seal in Fez, in the lands of the Maghrib, in the year 594 AH. The Real (الحق) informed me of him and gave me his sign, but I will not name him. His rank in relation to the Messenger of Allah, peace and blessings be upon him, is a single hair (شعرة واحدة) from his body. For this reason, he is perceived generally (إجمالا) but not known in detail, except by one whom Allah informs, or one who believes him if he introduces himself and claims it. Therefore, he is known as a hair of perception (شعرة من الشعور). The example of perception (الشعور) is when you see a door closed upon a dead person or a closed box, and you sense a movement within, indicating that there is an animal in that house, but you do not know what type of animal it is. Or you perceive that it is a human but cannot identify his essence (عينا) to distinguish him from others. Similarly, we know by the weight of a box that it contains something that makes it heavy, but we do not know the exact essence of the thing stored in that box. Such a thing is called perception due to this hiddenness.\n\nAs for the Seal of the Divine Names (ختم الأسماء الإلهية), it is the very essence of its Precedent, which is *Huwa* (He). This is like His saying: <<هُوَ الله الَّذِي لا إِلهَ إِلَّا هُوَ>> (He is Allah, other than whom there is no god). He began with *Huwa*, then brought the Name Allah, which encompasses all the Names that follow in detail, and then negated [divinity for others], denying that this rank belongs to anyone else. Then He affirmed it for Himself by His saying: <<إِلَّا هُوَ>> (except He). Thus, He began with *Huwa* and sealed with *Huwa*. Everything that came in the detailed specification of the essences of the Divine Names has entered under the Name Allah, which follows His saying *Huwa*. The word *Huwa* is more general than the word Allah, for it refers to Allah and to every unseen entity, and to everyone who possesses identity (هوّية). And there is nothing except that which possesses identity, whether the known or the mentioned is existent or non-existent.\n\nAs for the Seals upon the hearts (الخواتم التي على القلوب), they are the Seals of Divine Jealousy (الغيرة الإلهية). Nothing seals them except the Name The Jealous (الغيور), which is expressed in his, peace and blessings be upon him, saying concerning Allah: \"He is more jealous than I am.\" And out of His jealousy, He forbade indecencies (الفواحش), making them manifest and hidden. The Almighty said to Muhammad, peace and blessings be upon him: <<قُلْ إِنَّما حَرَّمَ رَبِّيَ الْفَواحِشَ ما ظَهَرَ مِنْها وما بَطَنَ>> (Say, \"My Lord has only forbidden indecencies—what is apparent of them and what is concealed\"). Thus, He sealed every heart against the entry of the Lordship (ربوبية) of the Real (الحق) to become an attribute of that heart. No one finds in his heart that he is a Lord God (رب إله); rather, everyone knows himself to be poor, needy, and abased. The Almighty said: <<كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ>> (Thus does Allah seal over every heart of an arrogant tyrant). Therefore, no Divine arrogance (كبرياء إلهي) enters it at all. He made all inner beings (البواطن) in every single individual sealed against the entry of divinity (تأله). He did not protect tongues from uttering claims of divinity, nor did He protect souls from believing in divinity in others. Rather, they are protected from believing in divinity in themselves, but not in their likes, because not everyone knows things as they truly are, nor does everyone know that the ruling of all likes is one in terms of quiddity (الماهية). These Seals are thus confined to the detailed types we have mentioned.\n\nAs for the Divine Halting Places (الأعراس الإلهية), according to the detail we mentioned at the beginning of the chapter, they are derived from *al-Ta'rīs* (التعريس), which is the traveler stopping at a known station during his journey. Journeys are conceptual (معنوية) and sensory (حسية). The sensory journey is known, and the conceptual journey is what appears to the heart of meanings, perpetually and continuously, following one another. When these meanings pass by the heart, they halt (عرست) there, making it a station for their halting. They halt there only to impart to the heart the reality of what they brought. They are attributed to Allah because Allah is the one who sends them forth and manifests them to this heart, making it a station for them to halt in. These are the Affairs (الشئون) concerning which the Real (الحق) said of Himself that He is in them, exalted is His Majesty, every day. Thus, the World (العالم) is in perpetual journey, both in this world and the Hereafter, because the Real is perpetually in the affairs of creation, both in this world and the Hereafter.\n\nHearts are the locus for the halting of these meanings that the Real sends forth to the hearts of His servants. They halt therein so that Allah may inform the heart of what He willed it to know. There is no soul except that the heart has a Divine thought (خاطر إلهي) that has descended upon it, regardless of the path it took. However, some hearts recognize which thoughts have halted with them, yet they may not know from which path they came, because they did not perceive it until that thought descended upon the heart. Some people have an outlook upon the mouths of the paths (أفواه السكك) by which these thoughts descend upon the heart. They know every path and distinguish it from its companion. When the thought approaches, they know from which path it came. When it descends upon them, they meet it with honor (الكرامة) commensurate with their knowledge of it, for every path has a ruling that the other path does not possess.\n\nAll of this—meaning what we have mentioned concerning observance—is only during the time of obligation (زمان التكليف), for it is the time that established the path and necessitated the rulings. When obligation is lifted in the Next Life (النشأة الآخرة), the path becomes unified, and there is only one path. Thus, the one upon whom something descends from Allah, halting in his heart, requires no distinction whatsoever, for there is no one to distinguish from, due to the Oneness (أحدية) of the path. Therefore, the Nuptial (العرس) with a contract, and what we detailed concerning it at the beginning of the chapter, occurs only during the time of obligation, which is the time of this worldly life, at the beginning of the necessity of obligation. Know this.\n\nSince the Real is the station of our halting, this is what He mentioned about Himself: that the servant performs a movement by which his Lord laughs, by which his Lord is astonished, by which his Lord shows affection, by which his Lord rejoices, by which his Lord is pleased, by which his Lord is displeased, and by which his Lord is angered. Since He said this about Himself and specified these movements and their likes, so that we know them from His Book through the tongue of His Messenger, peace and blessings be upon him, we know that the servant is with Him according to what has descended upon him of these movements that necessitate these rulings by which the Real described Himself as manifesting when the servant performs them.\n\nThis is a ruling affirmed by the Real, yet negated by the evidence of the intellect (دليل العقل). Thus, we know that the intellect is deficient concerning what is proper for Allah, the Mighty and Glorious. If the intellect were to compel itself to be fair, it would adhere to the ruling of faith and reception (التلقي), and place consideration and inference in the position Allah assigned it, without deviating from the path Allah established for it—which is the path leading to the knowledge that He is one God, having no partner in His divinity—and not expose itself to what He is in Himself.\n\nAs for the deficient inference of the intellect, by which it seeks to judge its Lord, claiming that He who is not free from temporal events (الحوادث) is temporal, according to its division in this matter: even if we concede this, it does not undermine what we intend. For we say to the intellect: Who told you that the Real is in this state? Your statement, \"Everything that is not free from temporal events in itself,\" who told you that this is confined to existent things? That ruling applies only to what is not free from temporal events, not to Him who is free from temporal events.\n\nAs for your other division in response to this, which is your saying that if He was free from them and then accepted them, He must either accept them for Himself or for another matter that is not Himself. If He accepts them for Himself, He is not free from them, and if He is not free from them, He is temporal like them. We say to the intellect: All temporal events are impossible to enter into Existence (الوجود) because they are infinite. You know that He who accepts temporal events had previously been empty of them—that is, empty of a specific temporal event while His Self existed—and then accepted that temporal event for Himself. Had He not possessed an attribute by which He accepts it, He would not have accepted it. Thus, He was bare and empty of that specific temporal event while His Self existed. There is no temporal event you can hypothesize without conceiving the existence of the self of the acceptor, while that temporal event is non-existent. Even if He is not free from temporal events, it is not necessary that He be temporal like them, despite His acceptance of them for Himself.\n\nThe Real has informed us about Himself that He answers His servant when he asks Him, is pleased with him when he pleases Him, and rejoices at the repentance of His servant when he repents. Look, O intellect, with whom are you disputing? It is impossible for us to believe you and disbelieve your Lord, and to take the ruling concerning Him from you, who are a servant like me, and abandon taking it from Allah, who knows Himself best. He is the one who described Himself with all of this. We know the reality of all of this by its definition and quiddity (ماهيته), but we are ignorant of the attribution of this to Allah due to our ignorance of His Essence (ذاته). We have been forbidden, warned, and restricted from contemplating His Essence. Yet you, O intellect, by your consideration, seek to know the reality of the Essence of your Creator! Do not swim outside your own field, and do not exceed in your consideration the knowledge of the Rank (المرتبة); do not expose yourself to the Essence (الذات) at all. For Allah has made clear to us that He is the locus or station for the halting of the movements of His servants in their journeys through their states. Be discerning if you possess a sound intellect.\n\nFurthermore, it is not necessary that if a matter has occurred *for you* (عندك), that matter is temporal *in itself*, neither rationally, customarily, nor legally. For you say, \"A weak person occurred to us today,\" and its occurrence *for you* is correct, but not its occurrence *in itself* at that time. Rather, its essence (عينه) has existed for fifty years. Despite this, there is no need for this to be explained or manifested. Therefore, whoever desires to enter upon Allah must abandon his intellect and put his Law (شرعه) forward, for Allah does not accept restriction (التقييد), and the intellect is a restriction. Rather, He has the right to manifest (التجلي) in every form, just as He has the right to compose you in any form He wills. Praise be to Allah who composed us in the form that did not restrict Him, exalted is He, to a specific form, nor confine Him therein. Rather, He established for Him what belongs to Him by His definition that it belongs to Him, which is His transformation in forms. None estimates Allah with His true measure except Allah. Whoever stands with Allah in what He described Himself with does not subject Him to the ruling of his intellect concerning His Self. Exalted is Allah far above that with great exaltation.\n\nKnow that the designation *nikāḥ* (marriage/nuptial) may refer to the contract for intercourse, or the contract and intercourse together, or intercourse alone, where the intercourse itself is the contract, because intercourse is not valid except by the contract of the two spouses. It is divided into Divine (إلهي), Spiritual (روحاني), and Natural (طبيعي). It may be intended for procreation—meaning childbirth—or merely for pleasure.\n\nAs for the Divine Nuptial (الإلهي), it is the turning of the Real (الحق) toward the contingent (الممكن) in the Presence of Contingency (حضرة الإمكان) with the Will of Love (الإرادة الحبية), accompanied by delight. When the Real turns toward it as mentioned, He manifests the formation (التكوين) from this contingent entity. Thus, what is born from this union is the Existence (الوجود) for the contingent. The essence (عين) of the contingent is called the spouse (*ahl*), the living Volitional Turning is the *nikāḥ*, and the production is the bringing into existence (إيجادا) in the essence of that specific contingent, or existence, if you wish. The Nuptials (الأعراس) are the joy that arises in the Beautiful Names (الأسماء الحسنى) due to the manifest bringing into existence in the essences of the contingent entities resulting from this *nikāḥ*, because the effects of the Names appear therein. The Names cannot have an effect in themselves or in their designated referent; rather, their effect and dominion are in the essence of the contingent entity, due to its poverty (الافتقار) and need for what is in the hands of the Names, so their dominion manifests in it. For this reason, we attribute joy, happiness, and the establishment of Nuptials to them.\n\nThis *nikāḥ* is continuous and perpetually existent; no cessation is possible in it. Divorce (الطلاق) for this marital contract does not occur in the essences (الأعيان) that accept accidents (الأعراض) and forms (الصور); rather, it occurs in the forms and accidents, which is their non-existence by themselves in the second time-frame of their existence. This is *khulʿ* (divestiture), because it is the return of the Existence that was given to them, as it is equivalent to the dowry for the essence of that specific contingent entity.\n\nIf you say: \"The Real is not described by temporal existence (الوجود الحادث), so who accepts this returned existence, and where is its treasury? It must have a locus.\" We say: The Theophany (تجلي) of the Real in the forms and His transformation (تحوله), which the Law brought to us and which we witnessed through unveiling (كشفا), generally and specifically, is the very essence of the Existence that the formal and accidental contingent entities returned when they ceased to exist. The Real has two relations to Existence (الوجود): the relation of Necessary Essential Existence (الوجود النفسي الواجب له), and the relation of Formal Existence (الوجود الصوري), which is that in which He manifests to His creation. It is impossible for Him to manifest in the Necessary Essential Existence, because we have no essence by which to perceive Him, as we are perpetually under the ruling of contingency (الإمكان), whether in our state of non-existence or existence. Thus, we only see Him through ourselves—that is, according to what our realities (حقائقنا) grant Him. Therefore, His Theophany must be in Formal Existence, which accepts transformation and change. Sometimes it is described by the contingent entity that divests itself of it, and sometimes the Real appears through it in His Theophany.\n\nLook, O saint, at this station, for it is an extremely hidden station. Were it not for the tongue of the Law (لسان الشرع) that alluded to it and drew attention to it, we would not have disclosed it to the people of our path. For many people of Allah’s path, even if they witness the Theophany of the Real, have no gnosis (معرفة) of it, nor of what they saw, nor of the true nature of the matter. Whoever knows what we have established concerning the intent of the Law will know how the World originated, what the World is, what part of the World remains in its essence, what perishes from it, and what the Real inherits from the World. For He is the one who said: <<إِنَّا نَحْنُ نَرِثُ الْأَرْضَ ومن عَلَيْها وإِلَيْنا يُرْجَعُونَ>> (Indeed, We are the ones who will inherit the earth and whoever is on it, and to Us they will be returned). What He truly inherits is only the Existence in which He manifests to those of His creation who appear, and in which the forms and accidents of the contingent entities divest themselves. This is because the heir does not exist simultaneously with the existence and permanence of the inherited one; rather, it occurs after the latter’s transition and non-existence from that station, which is its description by non-existence. This applies only to forms and accidents. Thus, He is the perpetual Heir, the divestiture is perpetual, the acceptance is perpetual, and the *nikāḥ* is perpetually necessary. This is the meaning of the Perpetuity (الديمومة) attributed to the Real. He, the Exalted, acts while having always been the Originator of the World, and the World has always been temporal (محدثا). Thus, the World has the ruling of temporality (الحدوث) within the very essence of pre-eternity (القدم). No end point can be conceived for it, because by its Essence (ذاته), it has always been under the ruling of Divine preference (الترجيح الإلهي) for it, either by non-existence or by existence.\n\nIf this is established concerning the Divine relation, let us mention the ruling of the Spiritual relation (النسبة الروحانية) in this matter. This is because the Existence we mentioned in the Divine relation is the specific aspect (الوجه الخاص) that every contingent entity has from Allah, whether there is a conventional cause or not. Allah is the source of bringing into existence (الإيجاد) in every state and in every aspect, high and low.\n\nAs for the Spiritual Nuptial (النكاح الروحاني), its presence is Nature (الطبيعة), which is the original spouse (*ahl*) in the Divine Nuptial. When a form (صورة) is born in the first *nikāḥ*, that form becomes the spouse for the Universal Spirit (الروح الكل). The Real marries it to the Spirit, and the Spirit builds with it. When the Spirit unites with it, a child emerges from that union, which is the Particular Spirit (الروح الجزئي). That form is then brought to life by this child, and this child sustains it, governs it, strives for it, travels, and faces dangers to acquire what he bestows upon it, sensually and conceptually—that is, from perceptible and conceptual provisions (الأرزاق). The Nuptial celebration (العرس) that occurs for this Spiritual Nuptial is established by the Powers (القوي) that only manifest in this natural form through the existence of this *nikāḥ*. They experience pleasure and joy from the effect produced by the existence of this building.\n\nAs for the Natural Nuptial (النكاح الطبيعي), it is the demand of these Particular Spirits (الأرواح الجزئية) that govern these forms for the union of the two natural forms through fusion and construction, which is called *nikāḥ* in the sensory world. From this *nikāḥ* are born the likes of the two spouses from every animal and plant. Thus, a human appears from two humans, and a horse from two horses. Sometimes, fusion occurs between non-likes, and a strange form is born between them that does not resemble the essence of either spouse, such as the mule born of a donkey and a horse. Every offspring born between two different forms never reproduces; it is sterile (عقيم). It is that which is born but does not give birth. The *nikāḥ* of this type is not for procreation but merely for desire and pleasure. This resembles the first *nikāḥ* from which a non-species of the spouses emerged, in that it is a *nikāḥ* between non-species, resulting in the strange form that resembles neither of them—meaning, neither of the spouses. Understand this.\n\nThe pollination of trees by fertilizing winds (الرياح اللواقح) is part of the Natural Nuptial. As for the sterile wind (الريح العقيم), its *nikāḥ* resembles the *nikāḥ* of the strange form from which nothing is born. The Nuptial celebrations (أعراس) of this Natural Nuptial are what is customarily witnessed and called a wedding in the sensory world, such as feasts and the beating of drums. As for what is born from the Natural Nuptial in trees, it is the fruit they yield during this pregnancy. The form in which the *nikāḥ* of trees occurs is the time when water flows in the branch, which is during the rising of the auspicious stars (السعود). It is a blessed *nikāḥ* in a blessed ascendant. What precedes that is the time of courtship and messengers walking between the two spouses, the male and the female. The occurrence of birth is according to the gestation period of these two types of trees; some give birth in the spring, and some in the summer, just as the gestation period of animals varies according to their nature. It accepts the influence of time only to the extent that its temperament and nature allow. When the atmosphere marries the earth and sends down water, and the earth manages it in its womb through the effects of the celestial lights, the earth smiles with flowers and <<أَنْبَتَتْ من كُلِّ زَوْجٍ بَهِيجٍ>> (causes to grow every beautiful pair). It is called a pair because of its need for *nikāḥ*, as it only occurs between two spouses. The very essence of its Nuptial celebration is what it brings forth in flowers. The formed (المخلقة) in the plant is what is safe from calamities, and the unformed is what the calamity has struck. <<والله عَلى‏ كُلِّ شَيْءٍ قَدِيرٌ>> (And Allah is over all things competent).\n\nWe have thus mentioned a summary of the Seals and the Nuptials, without going into detail, but we have confined ourselves to the fundamental principles (الأمهات) therein.\n\nAs for the Non-Arabic Secrets (الأسرار الأعجمية), we only named them Non-Arabic because the Arabic secrets are those which the eye of understanding (عين الفهم) perceives as forms, like the clear verses (الآيات المحكمات) in the revealed Books. The Non-Arabic Secrets are those that are grasped through direct instruction (التعريف), not through interpretation (التأويل). They are like the ambiguous verses (الآيات المتشابهات) in the revealed Books, whose interpretation is known only to Allah or to him whom Allah informs. Intellect (الفكر) has no entry into the knowledge of them, nor does it have a footing therein. No one pursues the extraction of the secret within them, after the definition is given, except the one whom Allah mentioned: he who has deviation (زيغ) in his heart—meaning a deviation from the Real (الحق) by following that concerning which Allah mentioned that none knows its interpretation save Allah.\n\nTherefore, whoever wishes to know that should not delve into those secrets, but should strive on the path leading to Allah, which is acting upon what Allah has legislated for him through piety (التقوى). For the Almighty said that it yields for its possessor the knowledge of the Criterion (علم الفرقان). If he acts upon it, Allah takes charge of teaching him those Non-Arabic Secrets. When Allah grants them to him, they become Arabic in his regard, and he knows what Allah intended by them, and the ruling of ambiguity (التشابه) that described them before the knowledge of them is removed. This is because Allah revealed them as ambiguous, having two sides of resemblance, so the observer does not know what the Revealer intended by them in that ambiguity. It is necessary to resolve it to one of the two sides from a specific perspective. Even if you combine the two sides, each side has something that the other does not, whether it is from that created thing or from that revealed text, if it is from the forms of Allah’s speech.\n\nExamples of the revealed texts are His saying: <<الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏>> (The Most Merciful ascended the Throne), and His saying: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are), and His saying: <<ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ>> (And We are nearer to him than the jugular vein), and His saying: <<وهُوَ الله في السَّماواتِ وفي الْأَرْضِ>> (And He is Allah in the heavens and in the earth), and His saying: <<هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ الله في ظُلَلٍ من الْغَمامِ>> (Do they await but that Allah should come to them in the shadows of clouds?), and His saying: <<وجاءَ رَبُّكَ والْمَلَكُ صَفًّا صَفًّا>> (And your Lord has come, and the angels, rank upon rank), and similar examples in the revealed Books. As for the reports of the Messengers who conveyed to us what the Real revealed through their tongues, the ambiguous matters are countless. No one pursues this after the definition is given except him who has deviation in his heart.\n\nBut he who follows the paths leading to the unveiling (الكشف) of them is not among the people of deviation; rather, he is among the people of rectitude (الاستقامة). The Muhammadan is the clear (المحكم) of the verses because it is Arabic, and the ambiguous (المتشابه) is Mosaic because it is Non-Arabic (أعجمي). The Non-Arabic is Arabic to the people of Non-Arabic, and the Arabic is Non-Arabic to the non-Arabs. In terms of words, it is veiled by convention (الاصطلاح). There is no Non-Arabic nature except in convention, words, and manifest forms. But in terms of meanings (المعاني), they are all Arabic; there is no Non-Arabic nature in them. Whoever claims knowledge of meanings and speaks of resemblance (الشبه) has no knowledge whatsoever of what he claimed to know of it, for meanings are like explicit texts (النصوص) to the people of words, because they are simple entities (بسائط) with no composition. Were it not for composition, the form of Non-Arabic nature would not appear in Existence. In this station, there are countless sciences; if we were to mention them, the matter would be prolonged. This station holds supremacy over every station of Gathering (الجمع) and Existence (الوجود). We have already mentioned the confinement of these stations in this Book previously.\n\nKnow that this station is the station of the True Isthmus (البرزخ الحقيقي). People use the term Isthmus (البرزخ) broadly, but it is not as they imagine; rather, it is as Allah defined it for us in His Book, in His saying concerning the two seas: <<بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ>> (Between them is an Isthmus (Barzakh) which they do not transgress). The reality of the Isthmus is that there is no Isthmus within it, and it is that which meets what is between the two things by its very Essence (بذاته). If one of the two things meets it with an aspect (وجه) different from the aspect by which the other meets it, then there must be an Isthmus between the two aspects in itself, separating the two aspects so that they do not meet. In that case, it is not the Isthmus. But if the very essence of the aspect by which one of the two matters—which is between them—meets it, is the very essence of the aspect by which the other meets it, then that is the True Isthmus. Thus, by its Essence, it is distinct from everything it meets, and the separation between things appears, while the separator is one in essence (واحد العين).\n\nIf you know this, you know what the Isthmus is. An example of this is the whiteness of every white thing: it is in every white thing by its Essence. It is not in one white thing by one aspect of it, nor in another white thing by another aspect. Rather, it is by its very essence in every white thing, yet the two white things are distinguished from one another, and the whiteness only confronts them by its Essence. Thus, the essence of whiteness is one in both matters, yet the two matters are not the essence of each other. This is an example of the True Isthmus. Likewise, humanity (الإنسانية) in every human being, by its single Essence, is the True Isthmus. That which is divisible is not one, and the One divides but is not divided—that is, it is not divisible in itself. For if it accepted division in its essence, it would not be One. If it is not One, it cannot confront every single thing of the two matters that are between it by its Essence. It is known that the One is undoubtedly there. The Isthmus is known but not perceived, and it is conceived by the intellect but not witnessed.\n\nFurthermore, people have broadly designated everything between two things as an Isthmus, even if that thing they call an Isthmus is a large or small body. But because it prevents the two matters between which it lies from meeting, they call it an Isthmus. The two substances (الجوهران) that are adjacent, and neither of which is divisible rationally or sensually, must have an Isthmus between them. The adjacency of the two substances is the adjacency of their spaces (أحيازهما), and there is no third space between their spaces that contains no substance. Between the two spaces and the two substances, there is undoubtedly an intelligible Isthmus (برزخ معقول) which prevents the essence of each substance from being the essence of the other, and the essence of each space from being the essence of the other. Thus, it confronts every substance and every space by its Essence.\n\nWhoever knows this understands the ruling of the Lawgiver when He said: \"Indeed, Allah created water pure (طهورا); nothing makes it impure,\" despite the presence of impurity (النجاسة) in it, without a doubt. But because the impurity is distinct from the water, the water remains pure according to its origin, except that it is difficult to remove the impurity from it. What the Lawgiver permitted of using water containing impurity, we use; and what He forbade, we abstain from, due to the command of the Law, even though we understand rationally that the impurity is in the water, and we understand rationally that the water is pure in its Essence (ذاته); nothing makes it impure. The Lawgiver did not forbid us from using water containing impurity because it is impure or has become impure. Rather, He forbade us from using the impure thing because we are unable to separate its particles from the particles of the pure water. Thus, between the impurity and the water is a preventing Isthmus, due to which they do not meet. If they were to meet, the water would become impure. Know this.\n\nDo you not see that the forms (الصور) in the market of Paradise are all Isthmuses? The people of Paradise come to this market for the sake of these forms, which are those in which the essences of the people of Paradise transform. When they enter this market, whoever desires a form enters into it and returns with it to his family, just as one returns with a necessity purchased from the market. A group may see a single form in that market, and every one of that group desires it. The very essence of his desire for it attaches to it, and he enters into it and possesses it. Thus, every person in that group possesses it. And the one who does not desire it stands by, watching every person in that group enter that form and return with it to his family, while the form remains in the market, having not left it.\n\nThe reality of this matter, which the Law explicitly stated and which faith necessitates, is known only by him who knows the nature of the Next Life (نشأة الآخرة), the reality of the Isthmus, and the Theophany of the Real (تجلى الحق) in multiple forms, transforming from one form to another, while the Essence (العين) is one. Thus, the sight witnesses His transformation in forms, and the intellect knows rationally that He has never transformed at all. Every faculty perceives according to what its essence grants it. The Real, in Himself, confirms the ruling of the intellect and confirms the ruling of the sight. Then He has a knowledge of Himself that is neither the essence of what the intellect ruled upon Him, nor the essence of what the witnessing of the sight ruled upon Him, nor is it other than these two. Rather, it is the very essence of what they both ruled, and it is what the Real knows of Himself that these two judges do not know. Glory be to the All-Knowing, the All-Powerful, who decreed, ordained, judged, and executed. <<وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ>> (And your Lord has decreed that you worship none but Him) in every object of worship. What could be clearer than His transformation in the forms of the worshipped things? But most people do not know.\n\nThen He legislated for us that we should not worship Him in any of those forms, even though we know that He is their very essence. He who worships Him in those forms has disobeyed and is made a polytheist (مشركا), and has forbidden forgiveness upon himself. Thus, accountability (المؤاخذة) is necessary for the polytheist. Then, after that, the accountability is lifted. It is only lifted because of his ignorance of the form of what he possesses in the partner (الشريك), by the negation of that attribute from the partner in the Hereafter. For this reason, he was punished, and for this reason, Mercy encompassed him after the punishment, even if he does not leave the Fire. The Gnostic (العالم) among us here, concerning the form of what the polytheist worshipped, does not deviate from his knowledge, neither in this world nor in the Hereafter, because his eye did not fall, nor did his knowledge attach, except to the Worshipped in that form. The polytheist’s state was not like that; rather, his state was the witnessing of a form, and the polytheist retracts from it in the Hereafter, while the Gnostic does not. If the Gnostic were to retract, he would be among the deniers, and it is not valid for him to retract.\n\nPolytheism remains, but none knows it,\nExcept he who witnesses the Essences (الأعيان) and the Forms (الصورا).\nSo he who speaks of Unity (توحيد) is correct, and he\nWho speaks of polytheism (شرك) therein has spoken the truth.\nIndeed, the partner is non-existent, and it has\nNo essence or trace in the eye of the worshipper.\n\nAmong the sciences in this station is knowledge that no Prophet or saint before this Community (الأمة) possessed. This knowledge was reserved exclusively for this Messenger, Muhammad, peace and blessings be upon him, and this Muhammadan Community. The Perfect Human (الكامل) from this Community attains this station outwardly and inwardly. The non-Perfect attains it outwardly or inwardly, but does not perfect it, yet it encompasses him because he belongs to the Community of Muhammad, peace and blessings be upon him. He will only boast of the multitude of his Community through the believers among them, whether the believer is young or old, for the progeny follows the fathers in faith, but they do not follow them in disbelief if the fathers are disbelievers. However, the disbelievers of every community are isolated from the disbelievers of other communities, for the punishment is magnified by the greatness of the one who is disbelieved in. This is the established norm, except for the disbelievers of this Community, for they are the lightest of people in punishment, because the one whose message they disbelieved is He whom Allah sent <<رَحْمَةً لِلْعالَمِينَ>> (as a mercy to the worlds). Allah made this clear in this world and made it the title of the ruling in the Hereafter.\n\nThis occurred when the Messenger of Allah, Muhammad, peace and blessings be upon him, intensified his standing for Allah and his jealousy for the Real (الحق) in the story of Ri’l, Dhakwān, and ‘Uṣayya, and began to supplicate against them in every prayer for a full month—which is the *qunūt* supplication. Allah Almighty revealed to him concerning this, knowing that He would answer him if he supplicated in a matter, and forbade him from supplicating against them, preserving them and showing mercy to them. He said: <<وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ>> (And We have not sent you except as a mercy to the worlds)—meaning, so that you may have mercy on them. For he was sent to all mankind universally, to show them mercy through various aspects of mercy. One aspect of mercy is that he should supplicate for them for success and guidance. It is authentically reported that he, peace and blessings be upon him, used to say: \"O Allah, guide my people, for they do not know,\" and he was forbidden from supplicating against them.\n\nIf the one who associates partners with Him is reproached by His Messenger, peace and blessings be upon him, for supplicating against them, then what will be His action toward them when He, the Exalted, takes charge of judging them Himself? We know that the Almighty never urged us toward a noble character trait except that He was more deserving of it. From this, one knows His ruling concerning the polytheists of the Community of Muhammad, peace and blessings be upon him, on the Day of Resurrection. Even if Allah holds them accountable for polytheism in the Hereafter—for accountability is necessary—His accountability of them contains a Divine subtlety (لطف إلهي) in which the polytheist of this Community is not equal to the polytheist of any other community. I know that subtlety, but I will not disclose it explicitly, just as he, peace and blessings be upon him, mentioned concerning those of this Community who are afflicted by the Fire due to their sins—or rather, those of the communities—that Allah will cause them to die therein (the *amāna* hadith), which has passed in this Book and was narrated by Muslim in his *Ṣaḥīḥ*. I have placed you on the path so that you may know Allah’s ruling concerning this Muhammadan Community, both its believer and its disbeliever. For the disbelief of the disbeliever among them does not exclude him from the call; he is subject to its ruling, for or against him, necessarily. They are the best community <<أُخْرِجَتْ لِلنَّاسِ>> (brought forth for mankind). The believer among them, by his faith, and the disbeliever among them, by his disbelief, are both better than every believer and disbeliever from outside this Community. What we have mentioned in this station, when viewed against the sciences it contains, is but a part of a thousand parts, indeed, of thousands. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب تین سو بیاسی: خواتم (اختتام) کے مقام، اعراس الٰہیہ (الٰہی شادیاں) کی تعداد اور اسرار اعجمیہ (غیر عربی/باطنی راز) کی معرفت میں۔\n\nموسوی لزومیت (موسوية لزومية)\n\n> علم برزخ وہ علم ہے جسے کوئی نہیں پا سکتا\n> سوائے اس کے جس نے اطراف اور وسط کو جمع کر لیا\n> اس کے لیے ہر کونی حادثے میں اس کے ذریعے نفوذ ہے\n> پس اسی کے ذریعے وہ جہانوں میں غالب ہوا\n> اگر وہ کسی شخص کے لیے انتقام چاہے تو قبض کرتا ہے\n> اور اگر وہ کسی شخص کے لیے نعمت چاہے تو بسط کرتا ہے\n> اگر وہ مخلوق میں اپنی میزان رحمت میں سب سے زیادہ انصاف کرنے والا ہے\n> تو تم اسے جہانوں میں اس میں انصاف کرتے دیکھو گے۔\n\n[بے شک ہستی (الوجود) صورتوں میں ایک دائرہ ہے جس کا ابد اس کے ازل پر پلٹ آیا ہے]\n\nجان لو کہ چونکہ خواتم (اختتام) سوابق (ابتداء) کی عین ذات ہیں، اس لیے ہم نے جانا کہ ہستی (الوجود) صورتوں میں ایک دائرہ ہے جس کا ابد اس کے ازل پر پلٹ آیا ہے۔ پس کسی معبود (إله) کا تصور نہیں کیا گیا مگر اس کے ساتھ جس کی عبادت کی جائے (المألوه) کا تصور بھی کیا گیا، اور نہ کسی رب کا تصور کیا گیا مگر اس کے ساتھ جس کی تربیت کی جائے (المربوب) کا تصور بھی کیا گیا۔ اور ہر معقول کی ایک رتبہ ہے جو دوسرے کی عین نہیں ہے، جیسا کہ ہم جانتے ہیں کہ خاتمہ اور سابقہ کے درمیان ایک معقول امتیاز ہے جس کے ذریعے ایک کو سابقہ اور دوسرے کو خاتمہ کہا جاتا ہے۔ اور ہم نے جو کہا کہ خاتمہ عین سابقہ ہے، تو یہ صرف اس حکم میں ہے جو محکوم علیہ پر لگایا جاتا ہے، اور محکوم علیہ کے ذریعے ہی خاتمہ سابقہ سے ممتاز ہوتا ہے۔\n\n[اعراس (شادیاں) دو قسم پر ہیں]\n\nجان لو کہ اعراس (شادیاں) دو قسم پر ہیں: ایک عقد (نکاح) کے لیے عرس، دوسرا عقد اور دخول (ہم بستری) کے لیے عرس، اور تیسرا دخول بلا عقد کے لیے عرس۔ عقد سے مراد وہ ہے جس پر میاں بیوی کی رضامندی واقع ہو، اور دخول سے مراد لذت کے حصول یا کسی ذات (عین) کو وجود میں لانے کے لیے وطی کرنا ہے۔ اور دخول بلا عقد لونڈیوں کا عرس ہے۔ چونکہ نکاحوں میں نکاح ہبہ (بغیر عوض کے تحفہ) سے افضل کوئی نہیں، کیونکہ یہ بغیر کسی عوض کے ہوتا ہے، جیسے اسم الواہب (عطا کرنے والا) جو نعمت دینے کے لیے عطا کرتا ہے، اس لیے یہ لفظ افضل الخلق محمد صَلَّى اللهُ عَليهِ وسَلَّم کے لیے خاص کیا گیا۔ ذات حق (الحق) فرماتا ہے: \"وَامْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ إِنْ أَرَادَ النَّبِيُّ أَن يَسْتَنكِحَهَا خَالِصَةً لَّكَ مِن دُونِ الْمُؤْمِنِينَ\" (اور کوئی بھی مومن عورت جو اپنی جان نبی کو ہبہ کر دے، اگر نبی اسے نکاح میں لانا چاہے، یہ خاص آپ کے لیے ہے، دوسرے مومنوں کے لیے نہیں)۔ ہر وہ نکاح جو ہم نے ذکر کیا اس سے خارج ہو، وہ سفاح (زنا) ہے، نکاح نہیں، یعنی وہ بہتے ہوئے سیال کی مانند ہے جسے کوئی ثبات نہیں، کیونکہ اس میں نہ عقد ہے، نہ رباط اور نہ ہی کوئی مضبوط بندھن۔ پھر ہم پلٹتے ہیں اور کہتے ہیں: جہاں تک خواتم (اختتام) کا تعلق ہے، تو ان کا تعین آجال (مدتوں) سے ہوتا ہے، اگر ایسا نہ ہوتا تو کسی چیز کا کوئی خاتمہ نہ ہوتا، کیونکہ خاتمہ اس چیز میں انتہا ہے جس کے ساتھ وہ موصوف ہو۔ اور ہر خاتمہ کے لیے ایک سابقہ (ابتداء) ہوتی ہے، لیکن اس کا الٹ نہیں ہوتا۔ پس جو شخص امر الٰہی کے دوام تنزیل اور اس کے مسلسل جاری رہنے کو دیکھتا ہے، وہ کہتا ہے کہ کوئی خاتمہ نہیں ہے۔ اور جو شخص تنزل میں اشیاء کے درمیان فصل کو دیکھتا ہے، وہ اشیاء میں خواتم کا قائل ہوتا ہے، کیونکہ فصول (جدائیاں) ان کو واضح کرتی ہیں۔ اس کی مثال یہ ہے، لیکن یہ سب عالم انقسام اور ترکیب میں ہے۔ پس جب تم قرآن میں دیکھتے ہو، مثال کے طور پر، دو کلمات، دو آیات یا دو سورتوں کے درمیان، تو جب تم دو امور کے درمیان ممتاز کرنے والی فصل پاتے ہو تو کہتے ہو: اگر دو کلمات کے درمیان واقع ہو تو پہلے کا خاتمہ ایک معین حرف ہے، اور اگر دو آیات ہوں تو پہلے کا خاتمہ ایک معین کلمہ ہے، اور اگر دو سورتیں ہوں تو پہلے کا خاتمہ ایک معین آیت ہے۔ اور اگر کوئی حادث امر ہو تو کہا جاتا ہے کہ دنیا میں اس کی مدت اتنی ہے، کیونکہ دنیا میں ہر چیز \"يَجْرِي إِلَى أَجَلٍ مُّسَمًّى\" (ایک مقررہ مدت تک چلتی ہے)۔ پس اس میں مدت اجل کے ساتھ ختم ہو جاتی ہے۔ تو اس چیز کا خاتمہ وہ ہے جہاں اس کا حکم ختم ہوتا ہے۔ حیوان میں سانسوں کا اختتام وہ آخری سانس ہے جو اس سے برزخ (البرزخ) کی طرف منتقل ہوتے وقت نکلتا ہے۔ پھر برزخ میں مدت اس کے اور بعث (دوبارہ اٹھائے جانے) کے درمیان فصل تک ختم ہوتی ہے۔ پھر قیامت میں مدت دارین (جنت و دوزخ) میں داخل ہونے کے درمیان فصل تک ختم ہوتی ہے۔ پھر آگ میں ان لوگوں کے حق میں جو اہل جنت میں سے ہیں، مدت اس فصل تک ختم ہوتی ہے جو اس میں قیام اور شفاعت و احسان کے ذریعے اس سے نکلنے کے درمیان ہے۔ پھر اہل نار کے عذاب کی مدت جو اس سے نہیں نکلیں گے، اس فصل تک ختم ہوتی ہے جو عذاب کی حالت اور اس رحمت کے حکم کے حصول کے درمیان ہے جو \"وَسِعَتْ كُلَّ شَيْءٍ\" (ہر چیز پر محیط ہے)، پس وہ آگ میں اپنے مزاجوں کے اختلاف کے مطابق نعمتیں پائیں گے جیسا کہ ہم نے ذکر کیا ہے۔ اس کے بعد کوئی ظاہر اجل مدت کے ساتھ باقی نہیں رہتی، بلکہ آجال خفّیہ (پوشیدہ مدتیں) اور دقیق ہوتی ہیں۔ اور وہ یہ ہے کہ محدث (حادث ہونے والی چیز) جو دائمی ذات رکھتی ہے، اس کی شان یہ ہے کہ اس پر احوال پلٹتے رہتے ہیں تاکہ اس کے لیے ہمیشہ دوام ہستی (الوجود) کی محتاجی لازم رہے۔ پس اس کے احوال آجال سے جدا نہیں ہوتے، اور وہ اپنے احوال میں ہمیشہ سابقہ اور خاتمہ کے درمیان رہتا ہے۔ جہاں تک ایمان کا تعلق ہے، تو اس کی سابقہ \"لا إله إلا الله\" ہے اور اس کا خاتمہ راستے سے تکلیف دہ چیز کو ہٹانا (إماطة الأذى عن الطريق) ہے۔ پس شارع نے سابقہ کو اعلیٰ سے اور خاتمہ کو ادنیٰ سے تعبیر کیا۔ پس ایمان میں توحید سے اعلیٰ کوئی چیز نہیں اور راستے سے تکلیف دہ چیز کو ہٹانے سے ادنیٰ کوئی چیز نہیں۔ اور اسی میں سے توحید کا راستہ ہے، پس اس کے راستے میں تکلیف دہ چیز شرک جلی اور شرک خفی ہے۔ شرک خفی اسباب ہیں، اور وہ خفی اور اخفیٰ (زیادہ پوشیدہ) کے درمیان ہیں۔ اخفیٰ باطنی اسباب ہیں اور خفی ظاہری اسباب ہیں، اور جلی محدثات کی طرف الوہیت کی نسبت دینا ہے۔ پس موحد ان سب کو اپنے دل اور دوسروں کے دل سے ہٹا دیتا ہے، کیونکہ یہ توحید کے راستے میں تکلیف دہ چیزیں ہیں۔ اور ایمان کے راستوں میں سے ہر راستے میں تکلیف دہ چیز اس صفت کے مطابق ہوتی ہے جسے ایمان کہا جاتا ہے، پس جو اس کی ضد ہو وہ اس کے راستے میں تکلیف دہ چیز کہلاتی ہے۔ پس جس سے اس معین صفت کی تکلیف دہ چیز دور کی جاتی ہے، وہ اس صفت کا خاتمہ ہے، جو بھی ہو۔ اور ذات حق (الحق) کے حکم کے لیے اس کے بندوں میں بالجملہ اور بالاطلاق کوئی خاتمہ نہیں اور نہ کوئی سابقہ، کیونکہ ممکن کا وہ عدم جو اس کے وجود پر مقدم ہے، وہ ہمیشہ اس کے لیے وجود امکانی کے فرض کے ساتھ مرجح (ترجیح دیا گیا) رہا ہے، پس اس کے لیے کوئی سابقہ نہیں۔ اور یہ ایک دقیق اور پوشیدہ علم ہے، جس کا تصور آسان ہے مگر ممتنع ہے، کیونکہ تصور کے وقت یہ ذہن سے تیزی سے نکل جاتا ہے۔ پس ممکن کے لیے حدوث صرف اس کے وجود کی جہت سے ہے، خاص طور پر تمام اہل نظر کے نزدیک، اور ہمارے نزدیک ایسا نہیں ہے۔ بلکہ ہمارے نزدیک اس کے حق میں حدوث یہ ہے کہ اس کا عدم اور وجود ہر حال میں ہمیشہ مرجح رہا ہے، کیونکہ وہ لذاتہ ممکن ہے۔ اگرچہ بعض اہل نظر نے کہا ہے کہ اس کا حدوث اس کے امکان کے سوا کچھ نہیں، لیکن جو بیان میں نے اس بارے میں کیا ہے، اس کے درمیان اس حاکم کے کلام میں احتمال کی گنجائش پیدا ہوتی ہے۔ کیونکہ یہ احتمال ہے کہ وہ مترادف اسماء میں سے ہو، تو اس کا حادث کہلانا اس کا ممکن کہلانا ہو۔ اور یہ احتمال بھی ہے کہ وہ وہی مراد لے جو ہم نے مراد لی ہے کہ وہ عدم جس کا حکم اس پر لگایا جاتا ہے کہ وہ لذاتہ ہے، وہ ہمارے نزدیک ہمیشہ مرجح رہا ہے۔ اگر ہم اہل نظر کے ساتھ عبارت میں وسعت اختیار کریں تو ہم یہ نہیں کہیں گے کہ ممکن کا عدم اس کی نفس کے لیے ہے، کیونکہ اگر عدم اس کے لیے صفت نفس ہوتا تو اس کا وجود محال ہو جاتا، جیسا کہ محال کا وجود محال ہے۔ لیکن جیسا کہ ہم کہتے ہیں کہ اس کے لیے عدم کا وجود پر تقدم لذاتہ ہے نہ کہ علم کے لیے، اور ان دونوں کے درمیان بڑا فرق ہے۔ لیکن اس میں ہمارا مذہب صرف یہ ہے کہ اس کا عدم ہمیشہ مرجح رہا ہے۔ پس ممکن کا وجود اس کے لیے سابقہ ہے، کیونکہ وہ نہیں تھا پھر ہو گیا۔ لیکن اس کی ذات کی جہت سے، جب وہ بذات خود قائم ہو، نہ کہ اس کی صورت کی جہت سے۔ پس اس کی ذات میں اس کے لیے کوئی خاتمہ نہیں، اور اس کی صورت میں اس کے لیے امثال اور اضداد کے ذریعے خواتم ہیں۔ پس ہر حادث جو بذات خود قائم اعیان کے علاوہ ہے، اس کے لیے سابقہ اور خاتمہ ہے، لیکن اس کی سابقہ عین اس کی خاتمہ ہے، کیونکہ اس کے وجود کے زمانے کے علاوہ اس کے لیے کوئی دوسرا زمانہ نہیں ہے، پھر وہ اپنی نفس کے لیے معدوم ہو جاتا ہے۔ اور اس میں سابقہ خاتمہ سے صرف حکم کے ذریعے ممتاز ہوتی ہے، پس تم سابقہ میں اس پر وجود کا حکم لگاتے ہو اور خاتمہ میں عدم کا۔ اور اس کی سابقہ کی عین میں اس کی خاتمہ کی عین ہے، کیونکہ اس کے وجود کے زمانے کے دوسرے زمانے میں اس کا کوئی وجود نہیں ہے۔ پس سمجھ لو۔\n\n[سالکین کا خاتمہ]\n\nجان لو کہ جب سالک اس دروازے تک پہنچ جاتا ہے جہاں ہر سالک اکتساب (کوشش) کے ذریعے پہنچتا ہے، تو سلوک میں اس کا آخری قدم ہی سالکین کا خاتمہ ہے۔ پھر دروازہ کھلتا ہے اور عطایا اور مواہب الٰہیہ (الٰہی بخششیں) عنایت اور اختصاص کے حکم سے نکلتی ہیں، نہ کہ اکتساب کے حکم سے۔ اور یہ الٰہی دروازہ سراسر قبولیت ہے، اس میں قطعاً کوئی رد نہیں، برخلاف محدثات (حادث ہونے والی چیزوں) کے دروازوں کے۔ اور اس بارے میں میں کہتا ہوں:\n\n> ہر دروازہ جب تم اس تک پہنچتے ہو\n> تو رد اور قبول دونوں ممکن ہوتے ہیں\n> سوائے ذات حق (الإله) کے دروازے کے، وہ قبولیت ہے\n> اس کے لیے جو اس کے پاس سنتا اور اطاعت کرتا ہوا آیا\n> اور جس نے رد کیا جب اس نے اس میں گمان کیا\n> کہ یہ دروازہ ہے، وہ وہیں گرا اور ہلاک ہو گیا\n> پس اس کا رب اسے پکارتا ہے: یہ میرا دروازہ نہیں\n> میرا دروازہ تو اس کے لیے ہے جو خشوع چاہتا ہے\n> اگر تم نے غور کیا ہوتا جب تم اس کے پاس آئے\n> تو تم نے اپنے اندر ایک عجیب امر کا مشاہدہ کیا ہوتا\n> تم وہ نہیں ہو جو تم ہو، تم ہمارے سوا نہیں ہو\n> پس اگر تم چاہو تو فراق کے لیے آنسو بہاؤ\n\nاور جب میں اپنے زمانے کے واصلین کی جماعت میں اس الٰہی دروازے تک پہنچا تو اسے کھلا ہوا پایا، اس پر نہ کوئی دربان تھا اور نہ کوئی چوکیدار۔ پس میں اس کے پاس کھڑا رہا یہاں تک کہ مجھے وراثت نبویہ کی خلعت پہنائی گئی۔ اور میں نے ایک بند کھڑکی (خوخہ) دیکھی، تو میں نے اسے کھٹکھٹانا چاہا، تو مجھ سے کہا گیا: اسے نہ کھٹکھٹاؤ، کیونکہ یہ نہیں کھلے گی۔ میں نے کہا: تو پھر یہ کس لیے رکھی گئی ہے؟ مجھے کہا گیا: یہ وہ کھڑکی ہے جو انبیاء اور رسولوں علیہم السلام کے لیے خاص تھی، اور جب دین مکمل ہو گیا تو اسے بند کر دیا گیا۔ اور اسی دروازے سے انبیاء کو شرائع کی خلعتیں پہنائی جاتی تھیں۔ پھر میں نے دروازے میں جھانکا تو اسے ایک شفاف جسم پایا جو اپنے پیچھے کی چیزوں کو ظاہر کرتا ہے۔ پس میں نے دیکھا کہ وہ کشف (الکشف) عین وہ فہم ہے جو ورثاء کو شرائع میں حاصل ہوتا ہے اور جس کی طرف احکام میں مجتہدین کا اجتہاد لے جاتا ہے۔ پس میں اس کھڑکی کے ساتھ اور اس دروازے کے پیچھے کی چیزوں کو دیکھنے کے ساتھ لازم ہو گیا۔ پس اس کے پیچھے سے معلومات کی صورتیں مجھ پر اسی طرح ظاہر ہو گئیں جیسی کہ وہ ہیں۔ پس یہ عین وہ فتح ہے جسے علماء اپنے باطن میں پاتے ہیں اور نہیں جانتے کہ یہ انہیں کہاں سے حاصل ہوا، مگر یہ کہ ان پر وہی کشف (الکشف) ہو جو ہم پر ہوا ہے۔ پس نبوت عامہ جس کے ساتھ کوئی تشریع نہیں، اور نبوت خاصہ جس کا دروازہ وہ کھڑکی ہے، وہ شرائع کی نبوت ہے۔ پس اس کا دروازہ بند ہے اور اس میں موجود علم محقق ہے، لہٰذا نہ کوئی رسول ہے اور نہ کوئی نبی۔ پس میں نے ذات حق کا شکر ادا کیا اس پر جو اس نے مجھے ظاہر اور باطن میں قوت عطا فرمائی۔ پس جب میں پہلے دروازے سے مطلع ہوا جہاں سالک پہنچتے ہیں اور جہاں سے خلعتیں ان کی طرف نکلتی ہیں، تو میں نے اس میں شکر کرنے والوں کا شکر ان صورتوں کی مانند دیکھا جو کھڑکی کے پیچھے ہم پر ظاہر ہوئیں۔ اور شکر کا ظاہر اس کھڑکی کی مانند ہے۔ پس میں نے کسی شکر کرنے والے کو نہیں دیکھا مگر ظاہر کلمات کے پیچھے ایک کے لیے۔ پس میں نے اس حالت میں شکر پر اپنا کوئی مددگار نہیں پایا۔ پس میں نے اپنے رب تعالیٰ عزوجل سے مخاطب ہو کر کہا:\n\n> جب میں نے شکر کا ارادہ کیا تو تیرے لیے کوئی شکر کرنے والا نہ پایا\n> اور اگر میں شکر نہ کروں تو ناشکرا ہو جاؤں\n> تو نے مخلوق کی عقلوں کو اس سبب سے چھپا دیا\n> جو تو نے رکھا، پس میں نے تجھ پر کوئی غیرت کرنے والا نہ پایا\n> اور تو نے ترجمانوں کے ذریعے غیرت کو پہنچایا\n> جس کا تو نے ایک ایسے بندے کو حکم دیا جو اس کا ماہر تھا\n> اس لیے تو مشہود (دیکھا جانے والا) نہیں ہوا اور نہ ہی ظاہر ہوا\n> اور اگر تو مشہود ہوتا تو تو غفور (بخشنے والا) ہوتا\n> اور ہمیں علم کیسے حاصل ہو جبکہ امر ہمیشہ سے\n> تیری طرف سے امکان کی حالت پر ظاہر ہے\n\nپس محمد صَلَّى اللهُ عَليهِ وسَلَّم نبوت بشریہ کی سابقہ (ابتداء) کی عین ذات تھے، جیسا کہ آپ نے ہمیں یہ بتا کر آگاہ فرمایا: \"میں نبی تھا جبکہ آدم پانی اور مٹی کے درمیان تھے\"۔ اور آپ خاتم النبیین کی عین ذات ہیں، ذات حق (الحق) کے اس فرمان کے مطابق: \"وَلَكِن رَّسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ\" (لیکن اللہ کے رسول اور نبیوں کے ختم کرنے والے ہیں)۔ جب آپ کے بارے میں یہ دعویٰ کیا گیا کہ آپ زید کے والد ہیں، تو اللہ تعالیٰ نے آپ سے ہمارے مردوں میں سے کسی کے والد ہونے کی نفی کر دی، تاکہ مناسبت کو ختم کیا جائے اور مرتبے کو ممتاز کیا جائے۔ کیا تم نہیں دیکھتے کہ آپ صَلَّى اللهُ عَليهِ وسَلَّم کی پشت سے کوئی نرینہ اولاد زندہ نہیں رہی، یہ اس بات کی فال ہے کہ اللہ کے علم میں یہ بات پہلے سے تھی کہ آپ خاتم النبیین ہیں۔ اور آپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"رسالت، یعنی لوگوں کی طرف تشریع کے ساتھ مبعوث ہونا، اور نبوت منقطع ہو چکی ہے\"۔ یعنی اب کوئی ایسا شخص باقی نہیں رہا جس کے لیے اللہ کی طرف سے کوئی ایسا حکم مشروع ہو جس پر وہ عمل کرے، جو ہمارے لائے ہوئے شرع کے علاوہ ہو۔ پس میرے بعد کوئی ایسا رسول نہیں آئے گا جو میرے شرع کے خلاف کوئی شرع لوگوں کے لیے لائے، اور نہ کوئی ایسا نبی ہو گا جو اپنے رب کی طرف سے کسی ایسے شرع پر ہو جو اس کے لیے خاص ہو۔ پس آپ نے واضح فرمایا کہ آپ تشریعی نبوت کے خاتم ہیں۔ اگر آپ کی مراد اس کے علاوہ کچھ اور ہوتی تو یہ آپ کے اس قول کے معارض ہوتا کہ عیسیٰ علیہ السلام ہم میں ایک منصف حاکم بن کر نازل ہوں گے اور ہماری امامت کریں گے، یعنی اس شرع کے مطابق جس پر ہم ہیں۔ اور ہمیں اس میں کوئی شک نہیں کہ وہ رسول اور نبی ہیں۔ پس ہم نے جانا کہ آپ صَلَّى اللهُ عَليهِ وسَلَّم کی مراد یہ تھی کہ آپ کے بعد کوئی ایسا شرع نہیں ہو گا جو آپ کے شرع کو منسوخ کرے۔ اور اس قول کے ذریعے دنیا کا ہر انسان آپ کی بعثت کے زمانے سے لے کر قیامت تک آپ کی امت میں داخل ہو گیا۔ پس خضر، الیاس اور عیسیٰ محمد صَلَّى اللهُ عَليهِ وسَلَّم کی ظاہری امت میں سے ہیں، اور آدم سے لے کر رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی بعثت کے زمانے تک آپ کی باطنی امت میں سے ہیں۔ پس آپ سابقہ (ابتداء) کے اعتبار سے بھی نبی ہیں اور خاتمہ (اختتام) کے اعتبار سے بھی نبی ہیں۔ پس رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم میں یہ ظاہر ہوا کہ نبوت میں سابقہ عین خاتمہ ہے۔ جہاں تک عیسیٰ علیہ السلام کی خاتمیت کا تعلق ہے، تو ان کے لیے دورہ ملک کا اختتام ہے، پس وہ آخری رسول ہیں جو ظاہر ہوئے، اور وہ اپنی نشو و نما میں آدم کی صورت میں ظاہر ہوئے، کیونکہ وہ کسی بشری باپ سے نہیں تھے، اور وہ بیٹوں، یعنی آدم کی ذریت، کی نشو و نما میں مشابہ نہیں تھے، کیونکہ وہ رحم میں معمول کے مطابق نہیں ٹھہرے، بلکہ وہ طبعی نشو و نما کے مراحل میں معمول کے زمانوں کے گزرنے کے ساتھ منتقل نہیں ہوئے، بلکہ ان کی منتقلی بعث (دوبارہ اٹھائے جانے) سے مشابہ تھی، یعنی قیامت کے دن مردوں کو زندہ کرنا، جو تھوڑے وقت میں اس صورت پر آتے ہیں جس پر وہ زیادہ وقت میں آئے تھے۔ کیونکہ وہ ذات حق کے اس عمومی فرمان کے تحت داخل ہیں: \"كَمَا بَدَأَكُمْ تَعُودُونَ\" (جیسے اس نے تمہیں شروع کیا تھا، تم لوٹو گے) تناسل اور اطوار میں منتقلی کے لحاظ سے۔ پھر جب عیسیٰ آخر زمانے میں زمین پر نازل ہوں گے، تو انہیں آدم سے لے کر آخری نبی تک کی ولایت کبریٰ کی مہر عطا کی جائے گی، یہ محمد صَلَّى اللهُ عَليهِ وسَلَّم کی تشریف کے لیے ہے، کیونکہ اللہ نے ہر امت میں ولایت عامہ کو صرف ایک ایسے رسول پر ختم کیا جو آپ صَلَّى اللهُ عَليهِ وسَلَّم کا پیروکار تھا۔ اور اس وقت ان کے لیے دورہ ملک کا ختم اور ولایت کا ختم، یعنی ولایت عامہ، ہو گا۔ پس وہ عالم میں خواتم (اختتام کرنے والوں) میں سے ہیں۔ جہاں تک ولایت محمدیہ کے خاتم کا تعلق ہے، جو محمد کی ظاہری امت کی ولایت کے لیے خاص مہر ہے، تو اس کی ختمیت کے حکم میں عیسیٰ علیہ السلام اور دیگر جیسے الیاس اور خضر اور امت ظاہرہ میں سے اللہ کا ہر ولی داخل ہے۔ پس عیسیٰ علیہ السلام اگرچہ ختم ہیں، لیکن وہ اس خاتم محمدی کی مہر کے تحت مختوم ہیں۔ اور میں نے اس خاتم محمدی کا حال مغرب کے شہر فاس میں پانچ سو چورانوے (۵۹۴) ہجری میں جانا، ذات حق (الحق) نے مجھے اس کی معرفت کرائی اور اس کی علامت عطا کی، اور میں اس کا نام نہیں لوں گا۔ اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم سے اس کا مرتبہ آپ صَلَّى اللهُ عَليهِ وسَلَّم کے جسم کے ایک بال کے برابر ہے۔ اور اسی لیے اس کا احساس اجمالی طور پر ہوتا ہے اور اس کا تفصیلی علم صرف اسے ہوتا ہے جسے اللہ اس سے آگاہ کرے، یا جو اسے سچا مانے اگر وہ خود اپنے دعوے میں اس کی معرفت کرائے۔ اس لیے اسے شعور (احساس) کے بالوں میں سے ایک بال کے طور پر پہچانا گیا۔ اور شعور کی مثال یہ ہے کہ تم کسی مردہ پر بند دروازہ یا بند صندوق دیکھو، تو اس میں ایک حرکت محسوس کرو جو یہ بتائے کہ اس گھر میں کوئی حیوان ہے، لیکن یہ معلوم نہ ہو کہ وہ حیوان کی کون سی قسم ہے، یا یہ احساس ہو کہ وہ انسان ہے لیکن اس کی ذات کو نہ پہچانا جائے تاکہ اسے دوسروں سے ممتاز کیا جا سکے، جیسا کہ ہم صندوق کے وزن سے جانتے ہیں کہ اس میں کوئی چیز ہے جس نے اسے وزنی کر دیا ہے، لیکن یہ معلوم نہیں ہوتا کہ اس صندوق میں چھپی ہوئی چیز کی عین ذات کیا ہے۔ پس اس طرح کی چیز کو اس پوشیدگی کی وجہ سے شعور کہا جاتا ہے۔\n\nجہاں تک اسماء الٰہیہ (الٰہی ناموں) کی مہر کا تعلق ہے، تو وہ عین اس کی سابقہ (ابتداء) ہے، اور وہ \"ھو\" ہے۔ اور یہ ذات حق کے اس فرمان کی مانند ہے: \"هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ\" (وہ اللہ ہے جس کے سوا کوئی معبود نہیں)۔ پس اس نے \"ھو\" سے شروع کیا اور پھر اسم \"اللہ\" لایا جو تمام اسماء پر محیط ہے جو تفصیل سے آتے ہیں، پھر نفی کے ذریعے اس نے اس مرتبے کے غیر کے لیے ہونے کی نفی کی، پھر اپنے قول \"إِلَّا هُوَ\" (مگر وہ) کے ذریعے اسے اپنے لیے واجب قرار دیا۔ پس اس نے \"ھو\" سے شروع کیا اور \"ھو\" پر ختم کیا۔ پس اسماء الٰہیہ کی ذاتوں کی تفصیل میں جو کچھ بھی آیا ہے، وہ اسم \"اللہ\" کے تحت داخل ہے جو اس کے قول \"ھو\" کے بعد آیا ہے۔ کیونکہ کلمہ \"ھو\" کلمہ \"اللہ\" سے زیادہ عام ہے، کیونکہ یہ اللہ پر اور ہر غائب پر اور ہر اس ذات پر دلالت کرتا ہے جس کی ہویت (ذات) ہو، اور وہاں صرف وہی ہے جس کی ہویت ہو، خواہ وہ معلوم ہو یا مذکور، موجود ہو یا معدوم۔\n\nجہاں تک ان خواتم (مہروں) کا تعلق ہے جو دلوں پر ہیں، تو وہ غیرت الٰہیہ (الٰہی غیرت) کی خواتم ہیں۔ پس ان پر صرف الاسم الغیور (غیرت والا نام) کی مہر لگائی گئی ہے۔ اور وہ آپ صَلَّى اللهُ عَليهِ وسَلَّم کا اللہ کے بارے میں یہ فرمان ہے کہ \"وہ مجھ سے زیادہ غیرت مند ہے\"۔ اور اس کی غیرت کی وجہ سے اس نے فواحش (بے حیائیوں) کو حرام قرار دیا اور فواحش کو ظاہر اور باطن بنا دیا۔ پس ذات حق (الحق) نے محمد صَلَّى اللهُ عَليهِ وسَلَّم سے فرمایا: \"قُلْ إِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ\" (کہہ دیجیے کہ میرے رب نے تو صرف بے حیائیوں کو حرام کیا ہے، جو ان میں سے ظاہر ہیں اور جو پوشیدہ ہیں)۔ پس اس نے ہر دل پر مہر لگا دی کہ اس میں ذات حق (الحق) کی ربوبیت داخل نہ ہو اور وہ اس کی صفت نہ بن جائے۔ پس کوئی شخص اپنے دل میں یہ نہیں پاتا کہ وہ رب یا معبود ہے، بلکہ ہر شخص اپنے نفس سے جانتا ہے کہ وہ فقیر، محتاج اور ذلیل ہے۔ ذات حق (الحق) فرماتا ہے: \"كَذَلِكَ يَطْبَعُ اللَّهُ عَلَى كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ\" (اسی طرح اللہ ہر متکبر، سرکش کے دل پر مہر لگا دیتا ہے)۔ پس اس میں کوئی الٰہی تکبر داخل نہیں ہوتا۔ پس اس نے ہر فرد کے تمام باطنوں پر مہر لگا دی کہ ان میں تألہ (معبود ہونے کا دعویٰ) داخل نہ ہو۔ اور اس نے زبانوں کو الوہیت کے دعوے کے ساتھ تلفظ کرنے سے نہیں بچایا، اور نہ ہی نفوس کو یہ عقیدہ رکھنے سے بچایا کہ الوہیت ان کے غیر میں ہے، بلکہ وہ اس بات سے معصوم ہیں کہ وہ اسے اپنے نفس میں اعتقاد کریں، نہ کہ اپنے امثال میں۔ کیونکہ ہر شخص امور کو ان کی حقیقت کے مطابق جاننے والا نہیں ہے، اور نہ ہی ہر شخص یہ جانتا ہے کہ تمام امثال کا حکم ماہیت میں ایک ہے۔ پس یہ خواتم ان اقسام کی تفصیل میں منحصر ہو گئیں جو ہم نے ذکر کی ہیں۔\n\nجہاں تک اعراس الٰہیہ (الٰہی شادیاں) کا تعلق ہے، جیسا کہ ہم نے باب کے شروع میں تفصیل سے ذکر کیا، تو یہ تعریس سے مشتق ہے، اور وہ مسافر کا اپنے سفر میں کسی معلوم منزل پر ٹھہرنا ہے۔ اور اسفار (سفر) معنوی اور حسی ہوتے ہیں۔ پس سفر محسوس معلوم ہے، اور سفر معنوی وہ ہے جو دل پر ہمیشہ مسلسل معانی کی صورت میں ظاہر ہوتا ہے۔ پس جب وہ اس دل سے گزرتے ہیں تو اس میں تعریس (ٹھہرتے) ہیں، اور وہ اس کے تعریس کی منزل بن جاتا ہے۔ اور وہ اس میں اس لیے ٹھہرتے ہیں تاکہ اسے اس حقیقت سے فائدہ پہنچائیں جو وہ لائے ہیں۔ اور ان کی نسبت اللہ کی طرف اس لیے کی گئی کہ اللہ ہی ہے جس نے انہیں اس دل کے لیے ظاہر کیا اور اسے ان کے ٹھہرنے کی منزل بنایا۔ اور یہ وہ شؤون (شانیں) ہیں جن کے بارے میں ذات حق (الحق) نے اپنے بارے میں فرمایا کہ وہ ہر دن ان میں جلوہ گر ہوتا ہے، جل جلالہ۔ پس عالم دنیا اور آخرت میں ہمیشہ سفر میں ہے، کیونکہ ذات حق (الحق) دنیا اور آخرت میں ہمیشہ مخلوق کے شؤون میں ہے۔ اور دل ان معانی کے تعریس کا مقام ہیں جنہیں ذات حق (الحق) اپنے بندوں کے دلوں کے لیے ظاہر کرتا ہے، پس وہ ان میں ٹھہرتے ہیں تاکہ اللہ اس دل کو اس چیز پر مطلع کرے جو وہ اسے سکھانا چاہتا ہے۔ پس کوئی نفس نہیں مگر دل کے لیے ایک الٰہی خاطر (خیال) ہے جو اس پر نازل ہوا ہے، خواہ وہ کسی بھی راستے پر چلا ہو۔ لیکن بعض دل ان خواطر کو پہچانتے ہیں جو ان میں ٹھہرے ہیں، اور بعض نہیں جانتے کہ وہ کس راستے سے آئے، کیونکہ انہیں اس کا احساس نہیں ہوا یہاں تک کہ وہ خاطر دل پر نازل ہو گیا۔ اور بعض لوگ ان راستوں کے دہانوں پر جھانکتے ہیں جن سے یہ خواطر آتے ہیں جو اس دل پر نازل ہوتے ہیں، اور وہ ہر راستے کو جانتے ہیں اور اسے اس کے ساتھی سے ممتاز کرتے ہیں۔ پس جب خاطر آتا ہے تو وہ جانتا ہے کہ وہ کس راستے سے آیا، اور جب وہ اس پر نازل ہوتا ہے تو وہ اس کی معرفت کے مطابق اس کا اکرام کرتا ہے، کیونکہ ہر راستے کا ایک حکم ہے جو دوسرے راستے کا نہیں ہے۔ اور یہ سب، یعنی جو ہم نے ذکر کیا ہے، اس کا لحاظ صرف زمان تکلیف (شرعی ذمہ داری کا زمانہ) میں ہے، کیونکہ اسی نے راستہ مقرر کیا اور احکام کو واجب کیا۔ پس جب آخرت کی نشأة میں تکلیف اٹھ جائے گی، تو راستہ یکتا ہو جائے گا، اور ایک ہی راستہ ہو گا، پس اللہ کی طرف سے نازل ہونے والے اور دل میں ٹھہرنے والے کو کسی امتیاز کی ضرورت نہیں ہو گی، کیونکہ راستے کی احدیت (یکتائی) کی وجہ سے کسی سے امتیاز نہیں ہو گا۔ پس عرس عقد کے ساتھ اور اس تفصیل کے ساتھ جو ہم نے باب کے شروع میں بیان کی، صرف زمان تکلیف میں ہو گا، اور وہ دنیاوی زندگی کا زمانہ ہے جب تکلیف کا وجوب شروع ہوتا ہے۔ پس یہ جان لو۔ پس جب ذات حق (الحق) ہماری تعریس کی منزل ہے، اور یہ وہ ہے جو اس نے اپنے بارے میں ذکر کیا کہ بندہ ایک ایسی حرکت کرتا ہے جس پر اس کا رب ہنستا ہے، اور جس پر اس کا رب تعجب کرتا ہے، اور جس کی وجہ سے اس کا رب اس سے خوش ہوتا ہے، اور جس سے اس کا رب خوش ہوتا ہے، اور جس سے اس کا رب راضی ہوتا ہے، اور جس سے اس کا رب ناراض ہوتا ہے، اور جس پر اس کا رب غضبناک ہوتا ہے۔ پس جب اس نے اپنے بارے میں یہ کہا اور ان حرکات اور ان کی مثالوں کو معین کیا، یہاں تک کہ ہم نے انہیں اس کی کتاب سے اس کے رسول صَلَّى اللهُ عَليهِ وسَلَّم کی زبان سے جانا، اور ہم نے جانا کہ بندہ اس کے نزدیک ان حرکات کے مطابق ہے جو ان احکام کو واجب کرتی ہیں جن کے ساتھ ذات حق (الحق) نے اپنے آپ کو موصوف کیا ہے کہ جب بندہ انہیں بجا لاتا ہے تو وہ ان کے ذریعے ظاہر ہوتا ہے۔ اور یہ ایک ایسا حکم ہے جسے ذات حق (الحق) نے ثابت کیا ہے اور دلیل عقل نے اس کی نفی کی ہے۔ پس ہم نے جانا کہ عقل اس چیز سے قاصر ہے جو اللہ عزوجل کے لیے شایان شان ہے، اور اگر وہ اپنے آپ کو انصاف کا پابند کرتی تو ایمان اور تلقین کے حکم کو لازم کرتی اور نظر اور استدلال کو اس جگہ رکھتی جو اللہ نے اس کے لیے مقرر کی ہے، اور اسے اس راستے سے نہ ہٹاتی جو اللہ نے اس کے لیے بنایا ہے، اور وہ راستہ ہے جو اسے ایک معبود ہونے کی طرف لے جاتا ہے جس کی الوہیت میں کوئی شریک نہیں، اور وہ اس چیز سے تعرض نہ کرے جو وہ اپنی ذات میں ہے۔ جہاں تک اس کے قاصر استدلال کا تعلق ہے جس کے ذریعے وہ اپنے رب پر حکم لگانا چاہتا ہے، اس قول کے ساتھ کہ جو چیز حوادث سے خالی نہیں وہ حادث ہے، اس کی اس تقسیم کے ساتھ، تو اگر ہم اسے تسلیم بھی کر لیں تو یہ ہمارے مطلوب میں کوئی نقص پیدا نہیں کرے گا۔ کیونکہ ہم اس سے کہتے ہیں: تمہیں کس نے کہا کہ ذات حق (الحق) اس مرتبے پر ہے؟ اور تمہارا یہ قول کہ ہر وہ چیز جو اپنے نفس میں حوادث سے خالی نہیں، تو تمہیں کس نے کہا کہ یہ موجودات میں منحصر ہے؟ یہ تو صرف اس چیز میں حکم ہے جو حوادث سے خالی نہیں، نہ کہ اس میں جو حوادث سے خالی ہے۔ جہاں تک اس جواب پر تمہاری دوسری تقسیم کا تعلق ہے، اور وہ تمہارا یہ قول ہے کہ اگر وہ ان سے خالی ہو اور پھر انہیں قبول کرے، تو وہ یا تو انہیں اپنے نفس کے لیے قبول کرے گا یا کسی دوسرے امر کے لیے جو اس کا نفس نہیں ہے۔ اگر وہ انہیں اپنے نفس کے لیے قبول کرے گا تو وہ ان سے خالی نہیں ہو گا، اور جب وہ ان سے خالی نہیں ہو گا تو وہ ان کی طرح حادث ہو گا۔ اور ہم اس سے کہتے ہیں: جہاں تک تمام حوادث کا تعلق ہے، تو ان کا وجود میں داخل ہونا محال ہے، کیونکہ وہ لامتناہی ہیں۔ اور تم جانتے ہو کہ جو حوادث کو قبول کرتا ہے، وہ ان سے خالی تھا، یعنی ایک معین حادث سے، اپنے نفس کے وجود کے ساتھ، پھر اس نے اس حادث کو اپنے نفس کے لیے قبول کیا۔ کیونکہ اگر وہ اس صفت پر نہ ہوتا جو اسے قبول کرتی ہے تو وہ اسے قبول نہ کرتا۔ پس وہ اس حادث بعینہ سے خالی اور عاری تھا، اپنے نفس کے وجود کے ساتھ۔ پس تم جو بھی حادث فرض کرو، اس کے لیے قبول کرنے والے کے نفس کا وجود معقول ہے، اور وہ حادث غیر موجود ہے۔ اور اگر وہ حوادث سے خالی نہ ہو، تو یہ لازم نہیں آتا کہ وہ ان کی طرح حادث ہو، اس کے باوجود کہ وہ انہیں اپنے نفس کے لیے قبول کرتا ہے۔ پس ذات حق (الحق) نے اپنے بارے میں خبر دی ہے کہ وہ اپنے بندے کو جواب دیتا ہے جب وہ اس سے سوال کرتا ہے اور راضی ہوتا ہے جب وہ اسے راضی کرتا ہے، اور اپنے بندے کی توبہ پر خوش ہوتا ہے جب وہ توبہ کرتا ہے۔ پس اے عقل! دیکھو تم کس سے جھگڑ رہی ہو؟ اور یہ محال ہے کہ ہم تمہیں سچا مانیں اور اپنے رب کو جھٹلائیں، اور تم سے اس پر حکم لیں، جبکہ تم میری طرح ایک بندے ہو، اور اللہ سے لینا چھوڑ دیں، جبکہ وہ اپنے آپ کو سب سے زیادہ جاننے والا ہے۔ پس وہی ہے جس نے اپنے آپ کو ان سب کے ساتھ موصوف کیا ہے۔ اور ہم ان سب کی حقیقت کو اس کی حد اور ماہیت کے ساتھ جانتے ہیں، لیکن ہم اس میں اللہ کی طرف نسبت کو نہیں جانتے، کیونکہ ہم اس کی ذات سے ناواقف ہیں۔ اور ہمیں اس کی ذات میں غور و فکر کرنے سے منع کیا گیا ہے، خبردار کیا گیا ہے اور روک دیا گیا ہے۔ اور تم اے عقل! اپنی نظر سے اپنے خالق کی ذات کی حقیقت جاننا چاہتی ہو۔ اپنے میدان کے علاوہ کسی اور میں مت تیرو، اور اپنی نظر میں مرتبے کی معرفت سے تجاوز مت کرو، ذات سے بالکل تعرض مت کرو۔ کیونکہ اللہ نے ہمارے لیے واضح کر دیا ہے کہ وہ اپنے بندوں کی حرکات کے لیے ان کے اسفار میں ان کے احوال کے ذریعے تعریس کا محل یا منزل ہے۔ پس اگر تم سلیم عقل والے ہو تو غور کرو۔ پھر یہ لازم نہیں آتا کہ اگر کوئی امر تمہارے نزدیک حادث ہوا ہے تو وہ امر اپنے نفس میں حادث ہو، نہ عقلی طور پر، نہ عرفی طور پر اور نہ شرعی طور پر۔ کیونکہ تم کہتے ہو کہ آج ہمارے پاس ایک ضعیف (کمزور) حادث ہوا ہے، اور یہ تمہارے نزدیک اس کا حادث ہونا صحیح ہے، نہ کہ اس وقت اس کا اپنے نفس میں حادث ہونا، بلکہ اس کی ذات پچاس سال سے موجود تھی۔ اور اس کے باوجود اس کے بیان اور ظہور کے لیے اس کی ضرورت نہیں ہے۔ پس جو شخص اللہ تک رسائی چاہتا ہے، اسے چاہیے کہ اپنی عقل کو چھوڑ دے اور اپنے شرع کو اپنے آگے پیش کرے، کیونکہ اللہ تقیید (محدودیت) کو قبول نہیں کرتا، اور عقل تقیید ہے۔ بلکہ اس کے لیے ہر صورت میں ظہور الٰہی (التجلی) ہے، جیسا کہ اس کے لیے یہ ہے کہ وہ تمہیں جس صورت میں چاہے مرکب کرے۔ پس تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں اس صورت میں مرکب کیا جس نے اسے سبحانہ و تعالیٰ کسی معین صورت کے ساتھ مقید نہیں کیا اور نہ ہی اس میں محصور کیا، بلکہ اس کے لیے وہ بنایا جو اس کے لیے ہے، اس کی تعریف کے ذریعے کہ وہ اس کے لیے ہے، اور وہ اس کا صورتوں میں تبدیل ہونا ہے۔ پس اللہ کی قدر اس طرح نہیں کی گئی جس طرح اس کی قدر ہونی چاہیے، سوائے اللہ کے۔ اور جو شخص اللہ کے ساتھ اس چیز میں کھڑا رہا جس کے ساتھ اس نے اپنے آپ کو موصوف کیا، اس نے اسے اپنی عقل کے حکم کے تحت داخل نہیں کیا، اس کی ذات کی جہت سے۔ اللہ اس سے بہت بلند و بالا ہے۔\n\nاور جان لو کہ نکاح کا مسمیٰ کبھی وطی کا عقد ہو سکتا ہے، اور کبھی عقد اور وطی دونوں ایک ساتھ ہو سکتے ہیں، اور کبھی صرف وطی ہو سکتی ہے اور نفس وطی ہی عین عقد ہو، کیونکہ وطی زوجین کے عقد کے بغیر صحیح نہیں ہوتی۔ اور اس میں الٰہی، روحانی اور طبعی نکاح ہوتا ہے۔ اور کبھی اس کا مقصد تناسل، یعنی ولادت، ہوتا ہے، اور کبھی صرف لذت کا حصول ہوتا ہے۔ جہاں تک الٰہی نکاح کا تعلق ہے، تو وہ حضرۃ الامکان میں ممکن پر ارادہ حبیہ (محبت بھرے ارادے) کے ساتھ ذات حق (الحق) کا متوجہ ہونا ہے، تاکہ اس کے ساتھ ابتهاج (خوشی) ہو۔ پس جب ذات حق (الحق) اس پر اس طرح متوجہ ہوتا ہے جیسا کہ ہم نے ذکر کیا، تو وہ اس ممکن سے تکوین (پیدا کرنا) کو ظاہر کرتا ہے۔ پس اس اجتماع سے جو چیز پیدا ہوتی ہے وہ ممکن کے لیے وجود (الوجود) ہے۔ پس عین ممکن کو اہل (بیوی) کہا جاتا ہے، اور ارادی حی توجہ کو نکاح، اور پیداوار کو اس ممکن کی ذات میں ایجاد اور اگر تم چاہو تو وجود (الوجود) کہہ سکتے ہو۔ اور اعراس (شادیاں) وہ خوشی ہے جو اسماء حسنیٰ میں قائم ہوتی ہے، اس نکاح میں ممکنات کی ذاتوں میں ظاہر ہونے والے ایجاد کی وجہ سے، کیونکہ اسماء کے آثار ان میں ظاہر ہوتے ہیں، جبکہ ان کے لیے اپنے نفس میں اور نہ ہی اپنے مسمیٰ میں کوئی اثر صحیح ہے۔ بلکہ ان کا اثر اور ان کی سلطنت عین ممکن میں ہوتی ہے، کیونکہ اس میں اسماء کے پاس موجود چیز کی طرف افتقار اور حاجت ہوتی ہے، پس ان کی سلطنت اس میں ظاہر ہوتی ہے۔ اسی لیے ہم نے خوشی، مسرت اور اعراس کے قیام کی نسبت ان کی طرف کی۔ اور یہ نکاح مسلسل اور دائمی الوجود ہے، اس میں انقطاع صحیح نہیں ہے۔ اور اس نکاحی عقد کی طلاق اعراض اور صورتوں کو قبول کرنے والی اعیان میں واقع نہیں ہوتی، بلکہ یہ صورتوں اور اعراض میں واقع ہوتی ہے، اور وہ ان کا اپنے وجود کے زمانے کے دوسرے زمانے میں اپنے نفس کے لیے معدوم ہو جانا ہے۔ اور یہ خلع (علیحدگی) ہے، کیونکہ یہ اس وجود کو واپس کرنا ہے جو اسے عطا کیا گیا تھا، کیونکہ یہ اس خاص ممکن کی ذات کے لیے مہر (صداق) کے درجے میں ہے۔ اگر تم کہو کہ ذات حق (الحق) وجود حادث کے ساتھ متصف نہیں ہوتا، تو اس مردود کو کس نے قبول کیا اور اس کا خزانہ کہاں ہے، اور اس کے لیے کوئی محل ہونا ضروری ہے؟ ہم کہیں گے: ذات حق (الحق) کا صورتوں میں ظہور الٰہی (التجلی) اور اس کا تبدیل ہونا جو شرع ہمارے پاس لایا ہے اور جسے ہم نے کشف (الکشف) کے ذریعے عموماً اور خصوصاً دیکھا ہے، وہ عین وہی ہے جو صوری اور عرضی ممکنات نے معدوم ہوتے وقت وجود سے واپس کر دیا تھا۔ پس ذات حق (الحق) کے لیے وجود میں دو نسبتیں ہیں: وجود نفسی کی نسبت جو اس کے لیے واجب ہے، اور وجود صوری کی نسبت، اور وہ وہی ہے جس میں وہ اپنی مخلوق کے لیے ظہور الٰہی (التجلی) کرتا ہے۔ کیونکہ اس کے لیے محال ہے کہ وہ وجود نفسی واجب میں ظہور الٰہی (التجلی) کرے، کیونکہ ہمارے پاس کوئی ذات نہیں ہے جس کے ذریعے ہم اسے ادراک کر سکیں، کیونکہ ہم اپنی عدم اور وجود کی حالت میں مرجح ہیں، اور ہم سے امکان کا حکم کبھی زائل نہیں ہوا۔ پس ہم اسے صرف اپنے ذریعے ہی دیکھتے ہیں، یعنی اس جہت سے جو ہماری حقائق اسے دیتی ہیں۔ پس ضروری ہے کہ اس کا ظہور الٰہی (التجلی) وجود صوری میں ہو، اور وہ وہی ہے جو تحول اور تبدل کو قبول کرتا ہے۔ پس کبھی اس ممکن کے ساتھ موصوف ہوتا ہے جو اس سے خلع کرتا ہے، اور کبھی ذات حق (الحق) اپنے ظہور الٰہی (التجلی) میں اس کے ذریعے ظاہر ہوتا ہے۔ پس اے ولی! اس مقام پر غور کرو، کیونکہ یہ بہت ہی پوشیدہ مقام ہے۔ اور اگر شرع کی زبان نہ ہوتی جس نے اس کی طرف اشارہ کیا اور تنبیہ کی، تو ہم اپنے اہل طریق کے لیے اسے واضح نہ کرتے۔ کیونکہ اللہ کے راستے کے بہت سے اہل اگرچہ ذات حق (الحق) کے ظہور الٰہی (التجلی) کا شہود (الشہود) کرتے ہیں، لیکن انہیں اس کی معرفت (المعرفۃ) نہیں ہوتی، اور نہ ہی اس کی جو انہوں نے دیکھا، اور نہ ہی اس امر کی صورت کی جو اس پر ہے۔ اور جس نے اس بیان کو جانا جو ہم نے اس میں شرع کے مقصد کے بارے میں مقرر کیا، اس نے جانا کہ عالم کا صدور کیسے ہوا، اور عالم کیا ہے، اور عالم میں سے کیا باقی رہتا ہے اور کیا فنا ہوتا ہے، اور عالم میں سے ذات حق (الحق) کس چیز کا وارث ہوتا ہے، کیونکہ وہی فرماتا ہے: \"إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا وَإِلَيْنَا يُرْجَعُونَ\" (بے شک ہم ہی زمین اور جو کچھ اس پر ہے، اس کے وارث ہوں گے اور ہماری طرف ہی وہ لوٹائے جائیں گے)۔ اور حقیقت میں اس نے صرف اس وجود کا وارث ہوا جس میں وہ اپنی مخلوق میں سے اس کے لیے ظہور الٰہی (التجلی) کرتا ہے جس میں ممکنات کی صورتیں اور اعراض خلع کر دی گئیں، کیونکہ وارث موروث عنہ کے وجود اور بقاء کے ساتھ نہیں ہوتا، بلکہ اس کے اس مقام سے منتقل ہونے اور معدوم ہونے کے بعد ہوتا ہے، اور وہ اس کا عدم کے ساتھ متصف ہونا ہے۔ اور یہ صرف صورتوں اور اعراض کے لیے ہے۔ پس وہ ہمیشہ وارث ہے، اور خلع ہمیشہ واقع ہے، اور قبول ہمیشہ حاصل ہے، اور نکاح ہمیشہ لازم ہے۔ اور یہی وہ دوام ہے جس کی نسبت ذات حق (الحق) کی طرف کی جاتی ہے۔ پس وہ تعالیٰ عمل کرتا ہے، اس کے باوجود کہ وہ ہمیشہ سے عالم کو وجود دینے والا ہے، اور عالم ہمیشہ سے محدث ہے۔ پس عالم کے لیے قدم (ازل) کی عین میں حدوث کا حکم ہے، پس اس کے لیے کوئی انتہا کا کنارہ معقول نہیں، کیونکہ وہ اپنی ذات سے ہمیشہ اس کے لیے الٰہی ترجیح کے حکم کے تحت رہا ہے، یا تو عدم کے ذریعے یا وجود کے ذریعے۔ اور جب یہ الٰہی نسبت میں مقرر ہو گیا، تو اب ہم اس مسئلے میں روحانی نسبت کا حکم ذکر کرتے ہیں۔ اور وہ یہ ہے کہ وہ وجود (الوجود) جو ہم نے الٰہی نسبت میں ذکر کیا، وہ ہر ممکن کے لیے اللہ کی طرف سے خاص چہرہ ہے، خواہ وہاں کوئی وضعی سبب ہو یا نہ ہو، پس اللہ ہر حال میں اور ہر چہرے سے، اوپر اور نیچے، ایجاد کرنے والا ہے۔ جہاں تک روحانی نکاح کا تعلق ہے، تو اس کی حضرۃ طبیعت ہے، اور وہ الٰہی نکاح میں اصلی اہل (بیوی) ہے۔ پس جب پہلے نکاح میں صورتوں میں سے کوئی صورت پیدا ہوئی، تو وہ صورت اس روح کل کے لیے اہل تھی، پس ذات حق (الحق) نے اس کا نکاح اس سے کر دیا، پس اس نے اس کے ساتھ بنا کی۔ پس جب اس نے اس سے وطی کی، تو اس وطی سے ایک بچہ ظاہر ہوا، اور وہ روح جزئی ہے۔ پس اس صورت کو اس کے ذریعے زندگی ملی، اور یہ بچہ اس کے ساتھ قائم ہو گیا اور اس کی تدبیر کرنے لگا، اور اس پر کوشش کرنے لگا، اور سفر کرنے لگا اور خطرات میں کود پڑا تاکہ وہ اس پر حسی اور معنوی طور پر جو کچھ عطا کرتا ہے، اسے کمائے، یعنی محسوس اور معنوی رزقوں میں سے۔ اور اس روحانی نکاح کا عرس (شادی) صرف وہ قوتیں قائم کرتی ہیں جن کا ظہور اس طبعی صورت میں اس نکاح کے وجود کے ذریعے ہی ہوتا ہے، پس انہیں اس بنا کے وجود سے حاصل ہونے والے اثر سے لذت اور خوشی حاصل ہوتی ہے۔ جہاں تک طبعی نکاح کا تعلق ہے، تو وہ وہ ہے جسے یہ جزئی ارواح جو ان صورتوں کی تدبیر کرتی ہیں، حسی عالم میں نکاح کہلانے والے التحام اور ابتناء کے ذریعے دو طبعی صورتوں کے اجتماع سے طلب کرتی ہیں۔ پس اس نکاح سے ہر حیوان اور نبات میں زوجین کی مثالیں پیدا ہوتی ہیں، پس دو انسانوں سے ایک انسان اور دو گھوڑوں سے ایک گھوڑا ظاہر ہوتا ہے۔ اور کبھی غیر مماثلوں کے درمیان التحام واقع ہوتا ہے، تو ان کے درمیان ایک عجیب شکل پیدا ہوتی ہے جو زوجین میں سے کسی ایک کی عین سے مشابہ نہیں ہوتی، جیسے گدھے اور گھوڑے کے درمیان خچر۔ اور ہر وہ مولود جو دو مختلف شکلوں کے درمیان پیدا ہو، وہ کبھی اولاد پیدا نہیں کرتا، کیونکہ وہ بانجھ ہوتا ہے، پس وہ پیدا ہوتا ہے مگر اولاد پیدا نہیں کرتا۔ پس اس طرح کی نوع کا نکاح ولادت کے لیے نہیں ہوتا، بلکہ صرف شہوت اور لذت کے لیے ہوتا ہے۔ پس یہ نکاح پہلے نکاح سے مشابہت رکھتا ہے، یہ وہ نکاح ہے جس سے زوجین کی جنس کے علاوہ کوئی چیز خارج ہوئی، اس لحاظ سے کہ یہ غیر جنس میں نکاح ہے، پس ان کے درمیان عجیب شکل پیدا ہوتی ہے جو ان دونوں میں سے کسی ایک سے مشابہ نہیں ہوتی، یعنی زوجین میں سے۔ پس سمجھ لو۔ اور درختوں کو بار آور ہواؤں کے ذریعے بار آور کرنا طبعی نکاح میں سے ہے۔ جہاں تک بانجھ ہوا کا تعلق ہے، تو اس کا نکاح اس عجیب شکل کے نکاح سے مشابہ ہے جس سے کوئی چیز پیدا نہیں ہوتی۔ اور اس طبعی نکاح کے اعراس (شادیاں) وہ ہیں جو عرف میں عرس کہلاتے ہیں، جو مشاہدے میں ولیمہ اور دف بجانے کی صورت میں ہوتے ہیں۔ جہاں تک درختوں میں طبعی نکاح سے پیدا ہونے والی چیز کا تعلق ہے، تو وہ وہ ہے جو وہ اس حمل کے وقت پھل کی صورت میں دیتا ہے۔ اور درختوں کے نکاح کے واقع ہونے کی صورت وہ زمانہ ہے جب پانی لکڑی میں چلتا ہے، اور یہ سعود (نیک ستارے) کے طلوع کے وقت ہوتا ہے، پس یہ ایک سعید طالع میں سعید نکاح ہے۔ اور اس سے پہلے کا زمانہ خطبہ اور رسولوں کا زمانہ ہے جو زوجین، مرد اور عورت، کے درمیان چلتے ہیں۔ اور ولادت کا واقع ہونا ان دونوں قسم کے درختوں کے حمل کے زمانے کے مطابق ہوتا ہے۔ پس ان میں سے کچھ موسم بہار میں پیدا ہوتے ہیں اور کچھ موسم گرما میں، جیسا کہ حیوان کے حمل کا زمانہ اس کی طبیعت کے اختلاف سے مختلف ہوتا ہے، کیونکہ وہ زمانے کے اثر کو صرف اسی قدر قبول کرتا ہے جو اس کا مزاج اور طبیعت اسے دیتی ہے۔ پس جب فضا زمین سے نکاح کرتی ہے اور پانی نازل کرتی ہے، اور فلکی انوار کے آثار اس کے رحم میں اس کی تدبیر کرتے ہیں، تو زمین پھولوں سے ہنس پڑتی ہے اور \"وَأَنبَتَتْ مِن كُلِّ زَوْجٍ بَهِيجٍ\" (اور ہر خوبصورت جوڑے کو اگایا)۔ اور وہ جوڑا اس لیے تھا کہ وہ نکاح کا طالب تھا، کیونکہ یہ صرف زوجین کے درمیان ہی ہوتا ہے۔ پس اس کا عرس (شادی) کی عین وہ ہے جو وہ پھولوں کی صورت میں ظاہر کرتی ہے۔ اور نباتات میں المخلقة (پیدا شدہ) وہ ہے جو آفات سے محفوظ رہا، اور غیر المخلقة وہ ہے جس پر آفت نازل ہوئی۔ اور \"وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\" (اور اللہ ہر چیز پر قادر ہے)۔ پس یہ ہم نے خواتم (اختتام) اور اعراس (شادیاں) کا ایک حصہ ذکر کیا ہے، بغیر تفصیل کے، لیکن ہم نے اس میں امہات (بنیادی اقسام) کو محدود کر دیا ہے۔\n\nجہاں تک اسرار اعجمیہ (غیر عربی/باطنی راز) کا تعلق ہے، تو ہم نے انہیں اعجمیہ (غیر عربی) اس لیے کہا کہ اسرار میں سے عربیہ وہ ہیں جنہیں عین فہم صورتوں میں ادراک کرتا ہے، جیسے نازل شدہ کتابوں میں آیات محکمات۔ اور اسرار اعجمیہ وہ ہیں جنہیں تعریف (شناخت) کے ذریعے ادراک کیا جاتا ہے نہ کہ تاویل کے ذریعے، اور وہ نازل شدہ کتابوں میں آیات متشابہات کی مانند ہیں۔ پس ان کی تاویل اللہ کے سوا کوئی نہیں جانتا یا وہ جسے اللہ نے سکھا دیا ہو۔ فکر کا ان کے علم میں کوئی دخل نہیں اور نہ ہی اس میں اس کا کوئی قدم ہے۔ اور ان میں راز نکالنے کی پیروی صرف وہی کرتا ہے جس کا اللہ تعالیٰ نے ذکر کیا ہے، اور وہ وہ ہے جس کے دل میں زیغ (کجی) ہے، یعنی حق سے انحراف، اس چیز کی پیروی کے ذریعے جس کے بارے میں اللہ نے ذکر کیا ہے کہ اس کی تاویل اللہ کے سوا کوئی نہیں جانتا۔ پس جو شخص یہ جاننا چاہتا ہے، اسے چاہیے کہ ان اسرار میں نہ گھسے، اور اس راستے پر عمل کرے جو اللہ تک پہنچاتا ہے، اور وہ ہے تقویٰ کے ساتھ اس پر عمل کرنا جو اللہ نے اس کے لیے مشروع کیا ہے۔ کیونکہ ذات حق (الحق) نے فرمایا کہ یہ اپنے صاحب کے لیے علم فرقان پیدا کرتا ہے۔ پس جب وہ اس پر عمل کرتا ہے تو اللہ اسے ان اسرار اعجمیہ کی تعلیم خود سنبھال لیتا ہے۔ پس جب وہ اسے یہ عطا کرتا ہے تو وہ اس کے حق میں عربیہ بن جاتے ہیں، پس وہ جانتا ہے کہ اللہ نے ان سے کیا ارادہ کیا ہے، اور ان میں سے اس پر تشابہ کا حکم زائل ہو جاتا ہے جس کے ساتھ وہ علم سے پہلے موصوف تھے۔ کیونکہ اللہ نے انہیں متشابہ ظاہر کیا ہے، ان میں شبہ کے دو کنارے ہیں۔ پس صاحب نظر نہیں جانتا کہ نازل کرنے والے نے اس تشابہ میں ان سے کیا ارادہ کیا ہے، کیونکہ اسے ایک خاص چہرے سے دونوں کناروں میں سے کسی ایک کی طرف خالص کرنا ضروری ہے۔ اور اگر تم دونوں کناروں کو جمع بھی کر لو، تو ان میں سے ہر کنارے کے لیے وہ ہے جو دوسرے کے لیے نہیں ہے، اس مخلوق میں سے یا اس منزل میں سے، اگر وہ اللہ کے کلام کی صورتوں میں سے ہو۔ پس منزل جیسے ذات حق کا یہ فرمان: \"الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَىٰ\" (رحمن عرش پر مستوی ہوا)، اور اس کا یہ فرمان: \"وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ\" (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)، اور اس کا یہ فرمان: \"وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ\" (اور ہم اس کی شہ رگ سے بھی زیادہ قریب ہیں)، اور اس کا یہ فرمان: \"وَهُوَ اللَّهُ فِي السَّمَاوَاتِ وَفِي الْأَرْضِ\" (اور وہی اللہ آسمانوں میں اور زمین میں ہے)، اور اس کا یہ فرمان: \"هَلْ يَنظُرُونَ إِلَّا أَن يَأْتِيَهُمُ اللَّهُ فِي ظُلَلٍ مِّنَ الْغَمَامِ\" (کیا وہ اس کے سوا کسی چیز کا انتظار کر رہے ہیں کہ اللہ بادلوں کے سائے میں ان کے پاس آ جائے)، اور اس کا یہ فرمان: \"وَجَاءَ رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا\" (اور تمہارا رب آ جائے گا اور فرشتے صف در صف ہوں گے)۔ اور اس طرح کی مثالیں نازل شدہ کتابوں میں ہیں۔ جہاں تک رسولوں کی خبروں کا تعلق ہے جو ذات حق (الحق) کی طرف سے اس چیز کا ترجمہ کرتے ہیں جو اس نے ان کی زبانوں پر ہماری طرف وحی کی، تو وہ متشابہ امور کی کثرت کی وجہ سے شمار نہیں کی جا سکتیں۔ پس اس تعریف کے بعد اس کی پیروی صرف وہی کرتا ہے جس کے دل میں زیغ (کجی) ہو۔ جہاں تک اس شخص کا تعلق ہے جو ان کے کشف (الکشف) تک پہنچنے والے راستوں کی پیروی کرتا ہے، تو وہ اہل زیغ میں سے نہیں، بلکہ وہ اہل استقامت میں سے ہے۔ پس محمدی آیات محکمات ہیں، کیونکہ وہ عربی ہیں، اور متشابہ موسوی ہیں، کیونکہ وہ اعجمی (غیر عربی) ہیں۔ پس اعجمیوں کے نزدیک اعجمیت عربیت ہے، اور اعاجم کے نزدیک عربیت عجمیت ہے۔ اور الفاظ میں یہ اصطلاح کے ذریعے پوشیدہ ہے۔ اور وہاں کوئی عجمیت نہیں ہے مگر اصطلاح، الفاظ اور ظاہری صورتوں میں۔ جہاں تک معانی کا تعلق ہے، تو وہ سب عربی ہیں، ان میں کوئی عجمیت نہیں۔ پس جس نے علم معانی کا دعویٰ کیا اور شبہ کا قائل ہوا، تو اسے اس چیز کا کوئی علم نہیں جس کا اس نے دعویٰ کیا کہ اس نے اسے جانا ہے۔ کیونکہ معانی اہل الفاظ کے نزدیک نصوص کی مانند ہیں، کیونکہ وہ بسیط ہیں، ان میں کوئی ترکیب نہیں۔ اور اگر ترکیب نہ ہوتی تو عجمیت کی کوئی صورت وجود میں ظاہر نہ ہوتی۔ اور اس منزل میں علوم میں سے وہ ہیں جو کثرت کی وجہ سے شمار نہیں کیے جا سکتے، اگر ہم انہیں ذکر کریں تو بات لمبی ہو جائے گی۔ اور اس منزل کو جمع اور وجود کی تمام منازل پر سیادت حاصل ہے۔ اور ہم نے ان منازل کے انحصار کو اس کتاب میں پہلے ذکر کیا ہے۔ پس جان لو کہ یہ منزل برزخ حقیقی (البرزخ الحقیقی) کی منزل ہے۔ کیونکہ لوگ برزخ میں وسعت اختیار کرتے ہیں، اور وہ ایسا نہیں ہے جیسا وہ گمان کرتے ہیں، بلکہ جیسا اللہ نے ہمیں اپنی کتاب میں اس کی معرفت کرائی ہے، اس کے اس فرمان میں جو دو سمندروں کے بارے میں ہے: \"بَيْنَهُمَا بَرْزَخٌ لَّا يَبْغِيَانِ\" (ان دونوں کے درمیان ایک برزخ ہے کہ وہ تجاوز نہیں کرتے)۔ پس برزخ کی حقیقت یہ ہے کہ اس میں برزخ نہ ہو، اور وہ وہ ہے جو ان دونوں کے درمیان اپنی ذات کے ذریعے ملتا ہے۔ پس اگر ان میں سے ایک اس چہرے کے علاوہ کسی چہرے سے ملے جس سے دوسرا ملتا ہے، تو ضروری ہے کہ دونوں چہروں کے درمیان اس کے نفس میں ایک برزخ ہو جو دونوں چہروں کو الگ کرے تاکہ وہ نہ ملیں۔ پس اگر ایسا ہو تو وہ برزخ نہیں ہے۔ پس اگر اس چہرے کی عین جس سے دو امور میں سے ایک ملتا ہے، جو ان کے درمیان ہے، عین وہ چہرہ ہو جس سے دوسرا ملتا ہے، تو وہ برزخ حقیقی (البرزخ الحقیقی) ہے۔ پس وہ اپنی ذات کے ذریعے ہر اس چیز سے ہوتا ہے جس سے وہ ملتا ہے، پس اشیاء کے درمیان فصل ظاہر ہوتا ہے، اور فاصل ایک ذات ہے۔ اور جب تم یہ جان لو گے تو تم جان لو گے کہ برزخ کیا ہے۔ اور اس کی مثال ہر سفید چیز کی سفیدی ہے، جو ہر سفید چیز میں اپنی ذات کے ذریعے ہے، نہ کہ کسی سفید چیز میں اس کے کسی چہرے سے، اور نہ ہی کسی دوسری سفید چیز میں کسی دوسرے چہرے سے، بلکہ وہ بعینہ ہر سفید چیز میں ہے۔ اور دونوں سفید چیزیں ایک دوسرے سے ممتاز ہو چکی ہیں، اور سفیدی نے ان دونوں کا مقابلہ صرف اپنی ذات کے ذریعے کیا ہے۔ پس سفیدی کی ذات دونوں امور میں ایک ہے، اور دونوں امور میں سے ہر ایک دوسرے کی عین نہیں ہے۔ پس یہ برزخ حقیقی (البرزخ الحقیقی) کی مثال ہے۔ اور اسی طرح ہر انسان میں انسانیت اپنی واحد ذات کے ذریعے برزخ حقیقی (البرزخ الحقیقی) ہے۔ اور جو تقسیم ہوتا ہے وہ واحد نہیں ہوتا، اور واحد تقسیم کرتا ہے مگر تقسیم نہیں ہوتا، یعنی اپنے نفس میں تقسیم نہیں ہوتا۔ کیونکہ اگر وہ اپنی ذات میں تقسیم کو قبول کرے تو وہ واحد نہیں ہے، اور جب وہ واحد نہیں ہو گا تو وہ ان دونوں امور میں سے ہر چیز کا مقابلہ اپنی ذات کے ذریعے نہیں کرے گا جو ان کے درمیان ہے۔ اور واحد معلوم ہے کہ وہ بلاشک واحد ہے۔ اور برزخ کو جانا جاتا ہے مگر ادراک نہیں کیا جاتا، اور اسے عقل سے سمجھا جاتا ہے مگر اس کا شہود (الشہود) نہیں کیا جاتا۔ پھر لوگوں نے ہر اس چیز کو جو دو چیزوں کے درمیان ہو، برزخ بنا دیا، وسعت اختیار کرتے ہوئے، اگرچہ وہ چیز جسے وہ برزخ کہتے ہیں، بڑا یا چھوٹا جسم ہو، لیکن چونکہ اس نے ان دو امور کو ملنے سے روکا جو اس کے درمیان ہیں، اس لیے انہوں نے اسے برزخ کہا۔ پس وہ دو جوہر جو ایک دوسرے کے ساتھ متصل ہوتے ہیں اور ان میں سے ہر ایک عقلی یا حسی طور پر تقسیم نہیں ہوتا، ان کے درمیان ایک برزخ کا ہونا ضروری ہے۔ اور دو جوہروں کا اتصال ان کے احیاز (جگہوں) کا اتصال ہے، اور ان کے احیاز کے درمیان کوئی تیسرا حیز نہیں ہے جس میں جوہر نہ ہو۔ اور دو حیزوں اور دو جوہروں کے درمیان بلاشک ایک معقول برزخ ہے، جو اس بات کو روکتا ہے کہ ہر جوہر کی ذات دوسرے جوہر کی ذات ہو، اور ہر حیز کی ذات دوسرے حیز کی ذات ہو۔ پس اس نے ہر جوہر اور ہر حیز کا مقابلہ اپنی ذات کے ذریعے کیا ہے۔ جس نے یہ جانا، اس نے شارع کا حکم جانا، جب اس نے فرمایا: \"بے شک اللہ نے پانی کو پاک پیدا کیا ہے، اسے کوئی چیز ناپاک نہیں کرتی\"۔ اس کے باوجود کہ اس میں نجاست بلاشک موجود ہوتی ہے، لیکن چونکہ نجاست پانی سے ممتاز تھی، اس لیے پانی اپنی اصل پر پاک رہا، مگر یہ کہ اس سے نجاست کو دور کرنا مشکل ہوتا ہے۔ پس شارع نے جس پانی کے استعمال کی اجازت دی جس میں نجاست ہو، ہم نے اسے استعمال کیا، اور جس سے منع کیا، ہم نے شرع کے حکم کی وجہ سے اس سے پرہیز کیا، اس کے باوجود کہ ہماری عقل جانتی ہے کہ نجاست پانی میں ہے، اور ہماری عقل جانتی ہے کہ پانی اپنی ذات میں پاک ہے، اسے کوئی چیز ناپاک نہیں کرتی۔ پس شارع نے ہمیں اس پانی کے استعمال سے منع نہیں کیا جس میں نجاست ہو، اس لیے کہ وہ نجس ہے یا ناپاک ہو گیا ہے، بلکہ ہمیں نجس چیز کے استعمال سے منع کیا، اس لیے کہ ہم اس کے اجزاء کو پاک پانی کے اجزاء سے الگ کرنے پر قادر نہیں ہیں۔ پس نجاست اور پانی کے درمیان ایک مانع برزخ ہے، جس کی وجہ سے وہ نہیں ملتے، اور اگر وہ مل جاتے تو پانی ناپاک ہو جاتا۔ پس یہ جان لو۔ کیا تم نہیں دیکھتے کہ جنت کے بازار میں موجود صورتیں سب برازخ ہیں؟ اہل جنت ان صورتوں کی وجہ سے اس بازار میں آتے ہیں، اور یہ وہ ہیں جن میں اہل جنت کی ذاتیں تبدیل ہوتی ہیں۔ پس جب وہ اس بازار میں داخل ہوتے ہیں، تو جو شخص کسی صورت کی خواہش کرتا ہے، وہ اس میں داخل ہو جاتا ہے اور اسے لے کر اپنے اہل کی طرف لوٹ جاتا ہے، جیسا کہ وہ بازار سے خریدی ہوئی ضرورت کی چیز لے کر لوٹتا ہے۔ پس ایک جماعت اس بازار کی صورتوں میں سے ایک صورت کو دیکھ سکتی ہے، اور اس جماعت میں سے ہر ایک اس کی خواہش کرتا ہے۔ پس اس میں اس کی خواہش کی عین اس سے مل جاتی ہے اور وہ اس میں داخل ہو جاتا ہے اور اسے حاصل کر لیتا ہے، پس اس جماعت میں سے ہر ایک اسے حاصل کر لیتا ہے۔ اور جو شخص اس کی خواہش نہیں کرتا، وہ اپنی ذات کے ساتھ کھڑا دیکھتا ہے کہ اس جماعت میں سے ہر ایک اس صورت میں داخل ہو گیا ہے اور اسے لے کر اپنے اہل کی طرف لوٹ گیا ہے، اور صورت بازار میں ویسی ہی ہے، اس سے باہر نہیں نکلی۔ پس اس امر کی حقیقت جس پر شرع نے نص کیا ہے اور جس پر ایمان واجب ہوا ہے، صرف وہی جانتا ہے جس نے نشأة آخرہ اور برزخ (البرزخ) کی حقیقت کو جانا، اور ذات حق (الحق) کا متعدد صورتوں میں ظہور الٰہی (التجلی) کو جانا، جس میں وہ ایک صورت سے دوسری صورت میں تبدیل ہوتا ہے، اور ذات ایک ہے۔ پس وہ بصارت سے اس کے صورتوں میں تبدیل ہونے کا شہود (الشہود) کرتا ہے، اور عقل سے جانتا ہے کہ وہ کبھی تبدیل نہیں ہوئی۔ پس ہر قوت نے اس کے مطابق ادراک کیا جو اس کی ذات نے اسے عطا کیا۔ اور ذات حق (الحق) اپنے نفس میں عقل کے حکم کو سچا مانتا ہے اور بصارت کے حکم کو بھی سچا مانتا ہے۔ پھر اسے اپنے نفس کا وہ علم ہے جو نہ تو عین وہ ہے جس کا حکم عقل نے اس پر لگایا، اور نہ ہی عین وہ ہے جس کا حکم بصارت کے شہود (الشہود) نے اس پر لگایا، اور نہ ہی وہ ان دونوں کے علاوہ ہے، بلکہ وہ عین وہ ہے جس کا حکم ان دونوں نے لگایا، اور وہ وہ ہے جو ذات حق (الحق) نے اپنے نفس سے جانا جو ان دونوں حاکموں نے نہیں جانا۔ پس سبحان العلیم القدیر (پاک ہے وہ جاننے والا، قدرت والا) جس نے تقدیر کی، فیصلہ کیا، حکم دیا اور نافذ کیا، اور \"وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ\" (اور تمہارے رب نے فیصلہ کر دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو) ہر معبود میں۔ اور معبودات کی صورتوں میں اس کے تبدیل ہونے سے زیادہ واضح کیا ہے؟ لیکن اکثر لوگ نہیں جانتے۔ پھر اس نے ہمارے لیے یہ مشروع کیا کہ ہم ان میں سے کسی چیز میں اس کی عبادت نہ کریں، اگرچہ ہم جانتے ہیں کہ وہ ان کی عین ذات ہے۔ اور جس نے ان صورتوں میں اس کی عبادت کی، اس نے نافرمانی کی اور اسے مشرک قرار دیا، اور اپنے اوپر مغفرت کو حرام کر لیا، پس مشرک پر مؤاخذہ واجب ہے اور ضروری ہے۔ پھر اس کے بعد مؤاخذہ اٹھ جائے گا، اور وہ صرف اس لیے اٹھا کہ وہ اس صورت سے ناواقف تھا جو اس کے پاس شریک میں تھی، اس صفت کی آخرت میں شریک سے نفی کے ذریعے، اس لیے اسے سزا دی گئی اور اسی لیے سزا کے بعد رحمت نے اسے شامل کر لیا، اگرچہ وہ آگ سے نہ نکلے۔ اور ہم میں سے جو عالم یہاں اس صورت سے واقف ہے جس کی مشرک نے عبادت کی، وہ دنیا میں اور نہ ہی آخرت میں اپنے علم سے ہٹا، کیونکہ اس کی نظر دنیا میں نہیں پڑی اور نہ ہی اس کا علم اس صورت میں معبود کے سوا کسی اور سے متعلق ہوا، اور مشرک کا حال ایسا نہیں تھا۔ بلکہ اس کا حال ایک صورت کا شہود (الشہود) تھا، پس مشرک آخرت میں اس سے پلٹ گیا، اور عالم نہیں پلٹا۔ اگر وہ پلٹ جاتا تو منکرین میں سے ہوتا، پس اس کے لیے پلٹنا صحیح نہیں ہے۔\n\n> پس شرک باقی ہے لیکن اسے کوئی نہیں جانتا\n> سوائے اس کے جس نے اعیان (ذاتوں) اور صورتوں کا مشاہدہ کیا\n> پس جو توحید کا قائل ہے اس نے درست کہا، اور جو\n> اس میں شرک کا قائل ہے اس نے خبر کو سچا جانا\n> بے شک شریک معدوم (نہ ہونے والا) ہے اور اس کے لیے\n> عبادت کرنے والے کی ذات میں نہ کوئی ذات ہے اور نہ کوئی اثر\n\nاور اس منزل کے علوم میں سے وہ ہیں جنہیں اس امت سے پہلے کسی نبی یا ولی نے نہیں جانا، اس کے علم کے ساتھ رسول محمد صَلَّى اللهُ عَليهِ وسَلَّم اور یہ امت محمدیہ خاص ہیں۔ پس اس امت کے کامل کو یہ مقام ظاہر اور باطن میں حاصل ہوا، اور غیر کامل کو ظاہر یا باطن میں حاصل ہوا اور اس کے لیے مکمل نہیں ہوا، لیکن یہ اسے شامل ہے کیونکہ وہ امت محمد صَلَّى اللهُ عَليهِ وسَلَّم میں سے ہے۔ اور آپ اپنی امت میں صرف ان مومنوں کی کثرت پر فخر کریں گے، خواہ وہ مومن چھوٹا ہو یا بڑا، کیونکہ ذریت ایمان میں آباء کے تابع ہوتی ہے، اور وہ کفر میں ان کے تابع نہیں ہوتے اگر آباء کافر ہوں۔ لیکن ہر امت کے کافروں کو دوسری امت کے کافروں سے الگ رکھا جائے گا، کیونکہ سزا اس کی عظمت کے مطابق بڑھتی ہے جس کے ساتھ کفر کیا گیا ہو۔ یہ معمول ہے، سوائے اس امت کے کافروں کے، کیونکہ وہ عذاب میں سب سے ہلکے ہوں گے، اس لیے کہ جس کی رسالت کے ساتھ انہوں نے کفر کیا، اسے اللہ نے \"رَحْمَةً لِّلْعَالَمِينَ\" (تمام جہانوں کے لیے رحمت) بنا کر بھیجا تھا۔ اور اللہ نے دنیا میں اس بات کو واضح کر دیا اور اسے آخرت کے حکم کا عنوان بنا دیا۔ اور وہ یہ ہے کہ جب رسول اللہ محمد صَلَّى اللهُ عَليهِ وسَلَّم کا اللہ کے لیے قیام اور حق پر غیرت رعل، ذکوان اور عصیہ کے قصے میں شدید ہوئی، تو آپ ہر نماز میں ایک مہینے تک ان پر بددعا کرتے رہے، اور وہ قنوت ہے۔ پس اللہ تعالیٰ نے اس بارے میں آپ پر وحی نازل کی، جب اس نے جانا کہ آپ جب کسی معاملے میں دعا کرتے ہیں تو وہ اسے قبول کرتا ہے، پس اس نے انہیں باقی رکھنے اور ان پر رحمت کرنے کے لیے ان پر بددعا کرنے سے منع فرمایا۔ پس اس نے فرمایا: \"وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ\" (اور ہم نے آپ کو تمام جہانوں کے لیے رحمت بنا کر ہی بھیجا ہے)۔ یعنی تاکہ آپ ان پر رحم کریں۔ پس آپ تمام لوگوں کی طرف بھیجے گئے ہیں تاکہ وہ ان پر رحمت کے مختلف طریقوں سے رحم کریں، اور رحمت کے طریقوں میں سے یہ ہے کہ آپ ان کے لیے توفیق اور ہدایت کی دعا کریں۔ اور آپ صَلَّى اللهُ عَليهِ وسَلَّم سے صحیح ثابت ہے کہ آپ کہتے تھے: \"اے اللہ! میری قوم کو ہدایت دے، کیونکہ وہ نہیں جانتے\"۔ اور آپ کو ان پر بددعا کرنے سے منع کیا گیا۔ پس جب جس کے ساتھ شرک کیا گیا، وہ اپنے رسول صَلَّى اللهُ عَليهِ وسَلَّم کو ان پر بددعا کرنے پر عتاب کرتا ہے، تو جب وہ سبحانہ و تعالیٰ خود ان کے بارے میں حکم سنبھالے گا تو اس کا فعل ان میں کیسا ہو گا؟ اور ہم جانتے ہیں کہ اللہ تعالیٰ نے ہمیں کسی بھی عمدہ خلق کی طرف مائل نہیں کیا مگر وہ خود اس کا زیادہ حقدار ہے۔ پس یہاں سے معلوم ہوتا ہے کہ قیامت کے دن محمد صَلَّى اللهُ عَليهِ وسَلَّم کی امت کے مشرکوں کے بارے میں اس کا کیا حکم ہو گا، اگرچہ اللہ انہیں آخرت میں شرک کی وجہ سے پکڑے گا، کیونکہ مؤاخذہ ضروری ہے، لیکن ان کا مؤاخذہ اس میں ایک الٰہی لطف ہو گا جس میں اس امت کا مشرک کسی دوسری امت کے مشرک کے برابر نہیں ہو گا۔ میں اس لطف کو جانتا ہوں مگر اسے واضح نہیں کرتا، جیسا کہ آپ صَلَّى اللهُ عَليهِ وسَلَّم نے ان لوگوں کے بارے میں ذکر کیا جنہیں اس امت میں سے ان کے گناہوں کی وجہ سے آگ پہنچی، بلکہ امتوں میں سے، کہ اللہ انہیں اس میں امانت کے طور پر موت دے دے گا۔ یہ حدیث اس کتاب میں گزر چکی ہے جسے مسلم نے اپنی صحیح میں روایت کیا ہے۔ اور میں نے تمہیں راستے پر ڈال دیا ہے تاکہ تم اس امت محمدیہ کے مومن اور کافر کے بارے میں اللہ کا حکم جان لو۔ کیونکہ اس کے کافر کا کفر اسے دعوت سے خارج نہیں کرتا، پس اس پر یا اس کے لیے اس کا حکم ضروری ہے۔ اور وہ بہترین امت ہیں جو لوگوں کے لیے نکالی گئی ہیں، ان کا مومن اپنے ایمان کی وجہ سے اور ان کا کافر اپنے کفر کی وجہ سے، وہ اس امت کے علاوہ ہر مومن اور کافر سے بہتر ہیں۔ اور یہ جو ہم نے اس منزل میں ذکر کیا ہے، اس میں موجود علوم کے لحاظ سے ہزار حصے کا ایک حصہ ہے، بلکہ ہزاروں کا۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و هشتاد و دوم: در معرفت منزل خاتمه‌ها، و شمار عروسی‌های الهی و اسرار غیرعربی (اعجمی)\n\nموسوی لزومی\n\n> علم البرازخ علم ليس يدركه *** إلا الذي جمع الأطراف والوسطا\n> له النفوذ به في كل نازلة *** كونية فبه في العالمين سطا\n> فإن أراد بشخص نقمة قبضا *** وإن أراد بشخص نعمة بسطا\n> إن أقسط الخلق في ميزان رحمته *** في العالمين تراه فيه قد قسطا\n\n> علم برزخ‌ها دانشی است که آن را درنیابد *** مگر آنکه اطراف و وسط را جمع کرده باشد\n> او را در هر حادثه *** کیهانی نفوذی است، پس به واسطه آن در جهان‌ها سلطه یافته است\n> اگر برای کسی عذابی بخواهد، قبض کند *** و اگر برای کسی نعمتی بخواهد، بسط دهد\n> اگر عادل‌ترین خلق در ترازوی رحمتش باشد *** او را در جهان‌ها ببینی که در آن به عدالت رفتار کرده است\n\n### [همانا هستی (الوجود) در صورت‌ها دایره‌ای است که ابدش بر ازلش بازگشته است]\n\nبدان که چون خاتمه‌ها (خواتم) عین سابقه‌ها (سوابق) هستند، دانستیم که هستی (الوجود) در صورت‌ها دایره‌ای است که ابدش بر ازلش بازگشته است. پس هیچ معبودی (إله) تعقل نشد مگر آنکه پرستیده‌شده‌ای (المألوه) تعقل شد، و هیچ پروردگاری (رب) تعقل نشد مگر آنکه پرورده‌ای (المربوب) تعقل شد. و برای هر معقولی مرتبه‌ای است که عین دیگری نیست، چنانکه می‌دانیم میان خاتمه و سابقه تمایزی معقول وجود دارد که به واسطه آن به یکی سابقه و به دیگری خاتمه گفته می‌شود. و اینکه گفتیم خاتمه عین سابقه است، تنها در حکم بر محكوم‌علیه است، و به واسطه محكوم‌علیه است که خاتمه از سابقه متمایز می‌شود.\n\n### [عروسی‌ها (الأعراس) بر دو قسم‌اند]\n\nو بدان که عروسی‌ها (الأعراس) بر دو قسم‌اند: عروسی برای عقد، و عروسی برای عقد و دخول، و عروسی با دخول بدون عقد. و عقد عبارت است از آنچه رضایت زوجین بر آن واقع شود. و دخول، همبستری است برای یافتن لذت یا برای ایجاد عین (فرزند). و دخول بدون عقد، عروسی کنیزان است. و چون در ازدواج‌ها (أنکحه) هیچ چیز بهتر از نکاح هبه نیست، زیرا بدون عوض است، مانند اسم «الواهب» (بخشنده) که می‌بخشد تا نعمت دهد، این لفظ به بهترین خلق، یعنی محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، اختصاص یافت. خداوند متعال می‌فرماید: (وَامْرَأَةً مُؤْمِنَةً إِنْ وَهَبَتْ نَفْسَها لِلنَّبِيِّ إِنْ أَرادَ النَّبِيُّ أَنْ يَسْتَنْكِحَها خالِصَةً لَكَ من دُونِ الْمُؤْمِنِينَ) [و زن مؤمنی که خود را به پیامبر ببخشد، اگر پیامبر بخواهد او را به زنی گیرد، این حکم مخصوص توست نه دیگر مؤمنان]. و هر نکاحی که خارج از آنچه ذکر کردیم باشد، سفاح (زنا) است نه نکاح؛ یعنی به منزله شیء سیالی است که ثباتی ندارد، زیرا در آن نه عقدی است و نه پیوندی و نه وثاقی. سپس باز می‌گردیم و می‌گوییم: اما خاتمه‌ها (خواتم) را اجل‌ها معین می‌کنند، وگرنه هیچ چیزی خاتمه‌ای نداشت، زیرا خاتمه، انتهای موصوف به آن است. و برای هر خاتمه‌ای، سابقه‌ای است، اما عکس آن صادق نیست. پس کسی که به دوام تنزیل امر الهی و استمرار آن بنگرد، می‌گوید: خاتمه‌ای در کار نیست. و کسی که به فصل میان اشیاء در تنزل بنگرد، به خاتمه‌ها در اشیاء قائل می‌شود، زیرا فصل‌ها آنها را آشکار می‌سازند. مثال آن این است، اما همه اینها در عالم انقسام و ترکیب است. پس اگر در قرآن بنگری، مثلاً میان دو کلمه، دو آیه، و دو سوره، می‌گویی: هنگام یافتن فصل ممیز میان دو امر، اگر میان دو کلمه واقع شود، خاتمه اولی حرف معینی است؛ و اگر دو آیه باشد، خاتمه اولی کلمه معینی است؛ و اگر دو سوره باشد، خاتمه اولی آیه معینی است. و اگر امری حادث باشد، گفته می‌شود اجلش در دنیا چنین است، زیرا هر آنچه در دنیاست (يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى) [تا سرآمدی معین جریان دارد]. پس مدت در آن به اجل پایان می‌یابد. خاتمه آن شیء همان است که حکمش به آن منتهی می‌شود. انتهای نفس‌ها در حیوان، آخرین نفسی است که از او صادر می‌شود هنگام انتقال به برزخ. سپس مدت در برزخ به فصل میان آن و بعث (رستاخیز) پایان می‌یابد. سپس مدت در قیامت به فصل میان آن و دخول در دو سرا (بهشت و دوزخ) پایان می‌یابد. سپس مدت در آتش، در حق کسانی از اهل بهشت که در آن هستند، به فصلی که میان اقامت در آن و خروج از آن به شفاعت و منت است، پایان می‌یابد. سپس مدت در عذاب اهل دوزخ که از آن خارج نمی‌شوند، به فصلی میان حال عذاب و حصول حکم رحمتی که (وَسِعَتْ كُلَّ شَيْ‏ءٍ) [همه چیز را فرا گرفته است]، پایان می‌یابد. پس آنان در آتش به واسطه اختلاف مزاج‌هایشان متنعم می‌شوند، چنانکه ذکر کردیم. سپس پس از آن، اجل ظاهری با مدت باقی نمی‌ماند، بلکه اجل‌های پنهان و دقیقی باقی می‌ماند. و آن این است که محدَثِ دائم‌العین، شأنش تقلب احوال بر اوست تا نیازمندی به دوام هستی (الوجود) برای او همیشه لازم آید. پس احوالش از اجل‌ها جدا نمی‌شود، و پیوسته در احوالش میان سابقه و خاتمه است. و اما ایمان، سابقه آن (لا إله إلا الله) است و خاتمه آن (إماطة الأذى عن الطريق) [دور کردن آزار از راه] است. پس شارع از سابقه به بالاترین و از خاتمه به پایین‌ترین تعبیر کرده است. پس در ایمان بالاتر از توحید نیست و پایین‌تر از دور کردن آزار از راه نیست. و از جمله آن، راه توحید است؛ زیرا آزار در راه آن، شرک آشکار و پنهان است. شرک پنهان، اسباب است، و آن میان پنهان و پنهان‌تر است. پنهان‌تر، اسباب باطنی است و پنهان، اسباب ظاهری است. و آشکار، نسبت دادن الوهیت به محدَثات است. پس موحد همه اینها را از قلب خود و قلب دیگری دور می‌کند، زیرا اینها آزار در راه توحید هستند. و هر آزاری در راهی از راه‌های ایمان، به حسب صفتی است که ایمان نامیده می‌شود. پس آنچه با آن منافات دارد، آزار در راه آن نامیده می‌شود. و آنچه به واسطه آن آزار از آن صفت معین برطرف می‌شود، خاتمه آن صفت است، هر چه که باشد. و برای حکم حق (الحق) در بندگانش به طور کلی و مطلق، نه خاتمه‌ای است و نه سابقه‌ای. زیرا عدمی که برای ممکن، مقدم بر وجودش است، پیوسته آن را به فرض وجود امکانی‌اش ترجیح داده است. پس برای آن سابقه نیست. و این دانشی دقیق و پنهان است که تصورش آسان و ممتنع است، زیرا هنگام تصور به سرعت از ذهن می‌گریزد. پس حدوث برای ممکن نیست مگر از جهت وجودش به طور خاص، نزد همه اهل نظر. و نزد ما چنین نیست. بلکه حدوث نزد ما در حق او این است که عدم و وجودش پیوسته در هر حال مرجح بوده است، زیرا او ممکن بالذات است. اگرچه برخی از اهل نظر گفته‌اند که حدوث او چیزی جز امکان او نیست. اما میان این بیانی که من در این باره ارائه دادم، احتمال به کلام این حکم‌کننده راه می‌یابد. زیرا محتمل است که نزد او از اسماء مترادف باشد، پس حادث نامیده شدن او، همان ممکن نامیده شدن او باشد. و محتمل است که منظور او همان باشد که ما اراده کردیم، یعنی اینکه عدمی که بر او حکم می‌شود که بالذات است، نزد ما مرجح بوده است و پیوسته هست. اگر در عبارت با اهل نظر توسعه دهیم، نمی‌گوییم که عدم ممکن برای نفس اوست، زیرا اگر عدم برای او صفت نفس بود، وجودش محال می‌شد، چنانکه وجود محال، محال است. اما همانطور که می‌گوییم تقدم عدم برای او بر وجود، بالذات است نه بالعلم، و میان این دو فرق بزرگی است. اما مذهب ما در این باره تنها این است که عدم او پیوسته مرجح بوده است. پس وجود ممکن برای او سابقه دارد، زیرا نبوده و سپس بوده است. اما از حیث عینش، اگر قائم به نفس خود باشد، نه از حیث صورتش، پس در عینش خاتمه‌ای ندارد. و در صورتش به واسطه امثال و اضداد، خاتمه‌ها دارد. پس هر حادثی غیر از اعیان قائم به نفس خود، سابقه و خاتمه دارد. اما سابقه آن عین خاتمه آن است، زیرا در هستی‌اش (الوجود) زمانی جز زمان هستی‌اش به طور خاص ندارد، سپس برای نفس خود معدوم می‌شود. و سابقه در آن از خاتمه به واسطه حکم متمایز می‌شود. پس در سابقه بر آن به وجود حکم می‌کنی و در خاتمه به عدم. و در عین سابقه آن، عین خاتمه آن است، زیرا در زمان دوم از زمان وجودش، وجودی ندارد. پس بفهم.\n\n### [خاتمه سالکان]\n\nو بدان که سالک هنگامی که به بابی می‌رسد که هر سالکی با اکتساب به آن می‌رسد، آخرین قدم در سلوک، خاتمه سالکان است. سپس باب گشوده می‌شود و عطایا و مواهب الهی به حکم عنایت و اختصاص خارج می‌شوند، نه به حکم اکتساب. و این باب الهی تماماً قبول است و ابداً ردی در آن نیست، برخلاف ابواب محدَثات. و در این باره می‌گویم:\n\n> كل باب إذا وصلت إليه *** أمكن الرد والقبول جميعا\n> غير باب الإله فهو قبول *** للذي جاءه سميعا مطيعا\n> والذي رد إذ تخيل فيه *** أنه الباب خر ثم صريعا\n> فيناديه ربه ليس بابي *** إن بابي لمن يريد خشوعا\n> لو تفطنت حين جئت إليه *** كنت عاينت فيك أمرا بديعا\n> أنت ما أنت لست أنت سوانا *** فاسكب إن شئت للفراق دموعا\n\n> هر بابی که به آن رسی *** هم رد و هم قبول در آن ممکن است\n> جز باب الهی که آن قبول است *** برای کسی که شنوا و مطیع نزد او آید\n> و آنکه رد شد، چون در آن گمان کرد *** که آن باب است، در آنجا بر زمین افتاد و هلاک شد\n> پس پروردگارش او را ندا می‌دهد که این باب من نیست *** همانا باب من برای کسی است که خشوع می‌خواهد\n> اگر هنگام آمدن به آن، متوجه می‌شدی *** امری شگفت در خود مشاهده می‌کردی\n> تو آنچه نیستی، تو غیر ما نیستی *** پس اگر خواهی، برای فراق اشک بریز\n\nو هنگامی که در جمع واصلان زمان خود به این باب الهی رسیدم، آن را گشوده یافتم که نه حاجب و نه دربانی بر آن بود. پس نزد آن ایستادم تا اینکه خلعت وراثت نبوی بر من پوشانده شد. و روزنه‌ای (خوخه) بسته دیدم. خواستم آن را بکوبم، به من گفته شد: نکوب، زیرا گشوده نمی‌شود. گفتم: پس برای چه قرار داده شده است؟ گفته شد: این روزنه‌ای است که به انبیاء و رسولان (علیهم السلام) اختصاص داشت و چون دین کامل شد، بسته شد. و از این باب بود که خلعت‌های شرایع بر انبیاء پوشانده می‌شد. سپس در باب نگریستم و آن را جسمی شفاف دیدم که آنچه را پشت آن است آشکار می‌سازد. پس آن کشف (الکشف) را عین فهمی یافتم که برای وارثان در شرایع است و آنچه اجتهاد مجتهدان در احکام به آن می‌انجامد. پس ملازم آن روزنه شدم و به آنچه پشت آن باب بود نگریستم. پس صورت معلومات، آنگونه که هستند، از پشت آن بر من متجلی شد. و این عین فتحی است که علما در بواطن خود می‌یابند و نمی‌دانند از کجا برایشان حاصل شده است، مگر اینکه بر آنچه برای ما کشف شد، بر آنان نیز کشف شود. پس نبوت عامه که تشریعی با آن نیست، همان نبوت خاصه است که بابش آن روزنه است، و آن نبوت شرایع است. پس باب آن بسته است و علم به آنچه در آن است محقق است. پس نه رسولی هست و نه پیامبری. پس خدا را بر آنچه از قوت در نهان و آشکار به من بخشید، شکر کردم. هنگامی که از باب اول که سالکان به آن می‌رسند و خلعت‌ها از آنجا به سوی آنان خارج می‌شود، مطلع شدم، شکر شاکران را مانند صورت‌هایی دیدم که پشت آن روزنه بر ما تجلی یافت، و ظاهر شکر مانند آن روزنه است. پس هیچ شاکری را ندیدم مگر برای یکی از پشت کلمات ظاهری. پس در آن حال، یاوری برای شکر نیافتم. پس گفتم، پروردگارم (تعالی عز وجل) را خطاب می‌کنم:\n\n> إذا رمت شكرا لم أجد لك شاكرا *** وإن أنا لم أشكر أكون كفورا\n> سترت عقول الخلق بالسبب الذي *** وضعت فلم آنس عليك غيورا\n> وقد بلغت عنك التراجم غيرة *** أمرت بها عبدا بتلك خبيرا\n> لذلك لم تشهد ولم تك ظاهرا *** ولو كنت مشهودا لكنت غفورا\n> وقد قلت بالتلبيس في الملك الذي *** بعثت شخيصا للأنام بصيرا\n> وكيف لنا بالعلم والأمر لم يزل *** على حالة الإمكان منك ظهيرا\n\n> اگر قصد شکر کنم، شاکری برای تو نیابم *** و اگر شکر نکنم، کافر خواهم بود\n> عقول خلق را با سببی که *** قرار دادی پوشاندی، پس بر تو غیوری نیافتم\n> و همانا ترجمه‌ها (پیام‌ها) از جانب تو غیرتی را رساندند *** که بنده‌ای آگاه به آن را به آن امر کردی\n> از این رو مشهود نشدی و آشکار نبودی *** و اگر مشهود بودی، آمرزنده (غفور) می‌بودی\n> و همانا با پوشاندن (تلبيس) در مُلکی که *** شخصیتی بینا برای مردمان فرستادی، سخن گفتی\n> و چگونه ما را به علم راهی است، در حالی که امر پیوسته *** بر حالت امکان از جانب تو آشکار است؟\n\nپس محمد (صَلَّى اللهُ عَليهِ وسَلَّم) عین سابقه نبوت بشری بود، به واسطه سخن خود که ما را آگاه ساخت: (كنت نبيا وآدم بين الماء والطين) [من پیامبر بودم در حالی که آدم میان آب و گِل بود]. و او عین خاتم پیامبران است به واسطه سخن خداوند متعال: (ولكِنْ رَسُولَ الله وخاتَمَ النَّبِيِّينَ) [ولی فرستاده خدا و خاتم پیامبران است]. هنگامی که ادعا شد که او پدر زید است، حق (الحق) متعال از او نفی کرد که پدر هیچ یک از مردان ما باشد، برای رفع مناسبت و تمایز مرتبه. آیا نمی‌بینی که برای او (صَلَّى اللهُ عَليهِ وسَلَّم) هیچ فرزند پسری از صلبش زنده نماند تا به بلوغ برسد؟ این به دلیل آن بود که در علم خدا سبقت یافته بود که او خاتم پیامبران است. و او (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: (إن الرسالة يعني البعثة إلى الناس بالتشريع لهم والنبوة قد انقطعت) [همانا رسالت - یعنی مبعوث شدن به سوی مردم با تشریع برای آنان - و نبوت منقطع شده است]. یعنی کسی باقی نمانده است که حکمی از جانب خدا برای او تشریع شود که بر او واجب باشد و آن حکم، شرع ما نباشد که ما آورده‌ایم. پس بعد از من رسولی نمی‌آید که شریعتی مخالف شریعت من برای مردم بیاورد، و نه پیامبری که بر شریعتی باشد که به تنهایی از جانب پروردگارش بر او واجب شود. پس تصریح کرد که او خاتم نبوت تشریعی است. و اگر منظورش غیر از آنچه ذکر کردیم بود، با سخن او در تعارض بود که: (إن عيسى عليه السلام ينزل فينا حكما مقسطا يؤمنا بنا) [همانا عیسی (علیه السلام) در میان ما به عنوان حاکمی عادل نازل می‌شود و با ما نماز می‌خواند]، یعنی بر شریعتی که ما بر آن هستیم. و ما شک نداریم که او رسول و نبی است. پس دانستیم که منظور او (صَلَّى اللهُ عَليهِ وسَلَّم) این بوده است که بعد از او شریعتی نیست که شریعت او را نسخ کند. و با این سخن، هر انسانی در جهان از زمان بعثت او تا روز قیامت، در امت او داخل شد. پس خضر و الیاس و عیسی از امت ظاهری محمد (صَلَّى اللهُ عَليهِ وسَلَّم) هستند، و از آدم تا زمان بعثت رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از امت باطنی او هستند. پس او پیامبر به واسطه سابقه است و پیامبر به واسطه خاتمه. پس در رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آشکار شد که سابقه عین خاتمه در نبوت است. و اما خاتمیت عیسی (علیه السلام)، برای او ختم دوره مُلک است. پس او آخرین رسولی است که ظاهر شد و در نشأت خود به صورت آدم ظاهر شد، زیرا از پدر بشری نبود و در نشأت شبیه فرزندان - یعنی ذریه آدم - نبود. زیرا او در رحم، توقف معمول را نداشت. او در اطوار نشأت طبیعی با گذشت زمان‌های معمول منتقل نشد، بلکه انتقال او شبیه بعث (رستاخیز) بود، یعنی زنده کردن مردگان در روز قیامت در زمان اندک، بر صورتی که در زمان بسیار بر آن آمده بودند. زیرا او تحت عموم سخن خداوند قرار می‌گیرد: (كَما بَدَأَكُمْ تَعُودُونَ) [همانگونه که شما را آغاز کرد، باز می‌گردید] در تناسل و انتقال در اطوار. سپس عیسی هنگامی که در آخرالزمان به زمین نازل می‌شود، ختم ولایت کبری را از آدم تا آخرین نبی به او می‌دهد، برای تشریف محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، زیرا خداوند ولایت عامه را در هر امتی ختم نکرد مگر به رسولی که تابع او (صَلَّى اللهُ عَليهِ وسَلَّم) باشد. و در این هنگام، او ختم دوره مُلک و ختم ولایت - یعنی ولایت عامه - را دارد. پس او از خاتمه‌ها در جهان است. و اما خاتم ولایت محمدیه، که ختم خاص برای ولایت امت ظاهری محمد است، عیسی (علیه السلام) و دیگران مانند الیاس و خضر و هر ولی خدا از امت ظاهری، در حکم خاتمیت او داخل می‌شوند. پس عیسی (علیه السلام) اگرچه ختم است، اما مختوم تحت ختم این خاتم محمدی است. و من حدیث این خاتم محمدی را در فاس از بلاد مغرب در سال پانصد و نود و چهار هجری دانستم. حق (الحق) او را به من شناساند و نشانه‌اش را به من داد، و نامش را نمی‌برم. و منزلت او نسبت به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) یک تار مو از بدن او (صَلَّى اللهُ عَليهِ وسَلَّم) است. و به همین دلیل، به طور اجمالی از او آگاه می‌شوند و به طور تفصیلی از او خبر ندارند، مگر کسی که خدا او را آگاه سازد یا کسی که او را تصدیق کند اگر خودش او را در ادعایش بشناساند. از این رو، او به عنوان «تار مویی از شعورها» شناخته شد. و مثال شعور این است که بابی بسته بر مرده‌ای یا صندوقی بسته را ببینی، پس در آن حرکتی را حس کنی که نشان می‌دهد در آن خانه حیوانی هست، اما ندانی که از کدام نوع حیوان است، یا حس کنی که انسان است اما عین او را نشناسی تا او را از دیگری جدا کنی. همانطور که از سنگینی صندوق می‌دانیم که حاوی چیزی است که آن را سنگین کرده، اما نمی‌دانیم عین آن شیء ذخیره‌شده در آن صندوق چیست. چنین چیزی «شعور» نامیده می‌شود به دلیل این خفا. و اما ختم اسماء الهی، عین سابقه آن است و آن «هو» است. و این مانند سخن خداوند است: (هُوَ الله الَّذِي لا إِلهَ إِلَّا هُوَ) [او خدایی است که جز او معبودی نیست]. پس با «هو» آغاز کرد و اسم «الله» را آورد که محیط بر تمام اسم‌هایی است که به تفصیل می‌آیند، سپس با نفی، نفی کرد که این مرتبه برای غیر او باشد، سپس آن را برای خود واجب ساخت با سخن خود: (إِلَّا هُوَ). پس با «هو» آغاز کرد و با «هو» ختم کرد. پس هر آنچه از تفصیل اعیان اسماء الهی آمده است، تحت اسم «الله» که بعد از سخن «هو» آمده، داخل شده است. زیرا کلمه «هو» عام‌تر از کلمه «الله» است. زیرا بر خدا و بر هر غایبی و بر هر کسی که هویت دارد دلالت می‌کند. و در آنجا جز کسی که هویت دارد نیست، خواه معلوم باشد یا مذکور، موجود باشد یا معدوم. و اما خاتمه‌هایی که بر قلب‌ها هستند، خاتمه‌های غیرت الهی هستند. پس با آن ختم نشده است مگر اسم «غیور». و آن سخن او (صَلَّى اللهُ عَليهِ وسَلَّم) درباره خداست که: (إنه أغير مني) [او از من غیورتر است]. و از غیرت اوست که فواحش را حرام کرد و فواحش را آشکار و پنهان قرار داد. پس خداوند متعال به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: (قُلْ إِنَّما حَرَّمَ رَبِّيَ الْفَواحِشَ ما ظَهَرَ مِنْها وما بَطَنَ) [بگو: پروردگار من فقط کارهای زشت را، چه آشکار و چه پنهان، حرام کرده است]. پس بر هر قلبی ختم کرد که ربوبیت حق (الحق) در آن داخل نشود تا نعت آن قلب باشد. پس هیچ کس در قلب خود نمی‌یابد که او رب و إله است، بلکه هر کس از نفس خود می‌داند که فقیر، محتاج و ذلیل است. خداوند متعال می‌فرماید: (كَذلِكَ يَطْبَعُ الله عَلى‏ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ) [اینچنین خداوند بر قلب هر متکبر و گردنکشی مهر می‌زند]. پس کبریاء الهی اصلاً در آن داخل نمی‌شود. پس همه بواطن را در هر فرد فرد، مختوم قرار داد که تأله (خدایی کردن) در آنها داخل نشود. و زبان‌ها را از تلفظ به ادعای الوهیت معصوم نساخت، و نفس‌ها را از اعتقاد به الوهیت در غیر خود معصوم نساخت، بلکه آنها معصوم هستند که آن را در نفس خود اعتقاد کنند، نه در امثال خود. زیرا همه مردم به امور آنگونه که هستند عالم نیستند، و همه نمی‌دانند که حکم همه امثال در ماهیت یکی است. پس این خاتمه‌ها در تفصیل آنچه از انواع آنها ذکر کردیم، محصور شده‌اند. و اما عروسی‌های الهی، بر تفصیل آنچه در ابتدای باب ذکر کردیم، از «التعریس» (توقف و منزل گرفتن مسافر) مشتق شده‌اند، و آن فرود آمدن مسافر در منزلی معلوم در سفرش است. و سفرها معنوی و حسی هستند. سفر محسوس معلوم است، و سفر معنوی آن است که معانی پیوسته و متوالی برای قلب آشکار می‌شود. پس هنگامی که از این قلب عبور کنند، در آن منزل می‌گیرند (عرّست به)، پس آن منزلگاه توقف آنها می‌شود. و تنها به این دلیل در آن منزل می‌گیرند که حقیقت آنچه را آورده‌اند به آن بفهمانند. و تنها به خدا نسبت داده شده‌اند، زیرا خداست که آنها را به سفر فرستاده و برای این قلب آشکار ساخته و آن را منزلگاهی برای توقف آنها قرار داده است. و اینها همان شؤوناتی هستند که حق (الحق) (جل جلاله) درباره خود فرموده است که در هر روز در آنهاست. پس عالم پیوسته در سفر است، دنیا و آخرت، زیرا حق (الحق) پیوسته در شؤون خلق است، دنیا و آخرت. و قلب‌ها محل توقف این معانی هستند که حق (الحق) آنها را برای قلب‌های بندگانش به سفر می‌فرستد، پس در آن منزل می‌گیرند تا خدا او را بر آنچه خواسته است آن قلب بداند، مطلع سازد. پس هیچ نفسی نیست مگر اینکه برای قلبش خاطر الهی نازل شده است، بر هر راهی که سلوک کند. اما برخی قلب‌ها می‌دانند که چه خاطری در آنها منزل گرفته است، و ممکن است ندانند از کدام راه آمده است، زیرا تا آن خاطر در قلب نازل نشده، آن را حس نکرده‌اند. و برخی مردم بر دهانه راه‌هایی که این خواطر از آنها می‌آیند و بر این قلب نازل می‌شوند، اشراف دارند و هر راهی را می‌شناسند و آن را از صاحبش تمییز می‌دهند. پس هنگامی که خاطر روی می‌آورد، می‌داند از کدام راه آمده است. پس هنگامی که در آن منزل می‌گیرد، به اندازه معرفتی که از آن دارد، با کرامت با آن برخورد می‌کند. زیرا برای هر راهی حکمی است که برای راه دیگر نیست. و همه اینها - یعنی آنچه از مراعات ذکر کردیم - تنها در زمان تکلیف است، زیرا آن زمان است که راه را قرار داده و احکام را واجب کرده است. پس هنگامی که تکلیف در نشأت آخرت برداشته شود، راه واحد می‌شود و جز یک راه نخواهد بود. پس در مورد آنچه از جانب خدا بر او نازل می‌شود و در قلبش منزل می‌گیرد، اصلاً نیازی به تمییز نیست. زیرا به دلیل احدیت راه، کسی نیست که از او تمییز داده شود. پس عروسی با عقد و آنچه در ابتدای باب تفصیل دادیم، تنها در زمان تکلیف است، و آن زمان حیات دنیا در ابتدای وجوب تکلیف است. پس این را بدان. پس هنگامی که حق (الحق)، منزل توقف ما باشد، و آن همان است که درباره خود فرموده است که بنده با حرکتی حرکت می‌کند که پروردگارش به واسطه آن می‌خندد، و پروردگارش از آن تعجب می‌کند، و پروردگارش به خاطر آن با او خوش‌رویی می‌کند، و پروردگارش به واسطه آن شاد می‌شود، و پروردگارش به واسطه آن راضی می‌شود، و پروردگارش به واسطه آن خشمگین می‌شود، و پروردگارش به واسطه آن غضب می‌کند. پس هنگامی که این را درباره خود فرمود و این حرکات و امثال آنها را معین کرد تا آنها را از کتابش بر زبان رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) شناختیم، و دانستیم که بنده نزد او به حسب آنچه از این حرکات که موجب این احکام هستند و حق (الحق) خود را به آنها وصف کرده است، بر او نازل شده است، ظاهر می‌شود هنگامی که بنده آنها را انجام دهد. و این حکمی است که حق (الحق) آن را اثبات کرده و دلیل عقل آن را نفی می‌کند. پس دانستیم که عقل از آنچه برای خدا (عز وجل) شایسته است، قاصر است. و اگر خود را ملزم به انصاف می‌کرد، حکم ایمان و تلقی را لازم می‌گرفت و نظر و استدلال را در موضعی قرار می‌داد که خدا قرار داده است، و از راهی که خدا برای آن قرار داده است، منحرف نمی‌شد. و آن راهی است که به یگانگی او به عنوان إلهی واحد می‌رساند که در الوهیتش شریکی ندارد، و به آنچه او در نفس خود بر آن است، تعرض نمی‌کند. و اما استدلال قاصر او که می‌خواهد با آن بر پروردگارش حکم کند، با سخن خود که: «او چیزی است که از حوادث خالی نیست، پس به واسطه تقسیم او در این باره، حادث است.» اگر این را بپذیریم، در آنچه ما می‌خواهیم خللی وارد نمی‌کند. زیرا به او می‌گوییم: چه کسی به تو گفته است که حق (الحق) در این مرتبه است؟ و این سخن تو که «هر آنچه در نفس خود از حوادث خالی نباشد»، چه کسی به تو گفته است که این در موجودات منحصر است؟ این تنها حکمی است در مورد کسی که از حوادث خالی نیست، نه در مورد کسی که از حوادث خالی است. و اما تقسیم دیگر تو بر این پاسخ، و آن سخن توست که: «اگر از آنها خالی باشد، سپس آنها را بپذیرد، پس یا آنها را برای نفس خود می‌پذیرد یا برای امر دیگری که نفس او نیست. اگر آنها را برای نفس خود بپذیرد، پس از آنها خالی نیست، و اگر از آنها خالی نباشد، پس مانند آنها حادث است.» و ما به او می‌گوییم: اما همه حوادث، محال است که در هستی (الوجود) داخل شوند، زیرا نامتناهی هستند. و تو می‌دانی کسی که حوادث را می‌پذیرد، از آنها خالی بوده است، یعنی از حادث معینی، با وجود نفس خود، سپس آن حادث را برای نفس خود پذیرفته است. زیرا اگر بر صفتی نبود که آن را بپذیرد، آن را نمی‌پذیرفت. پس او از آن حادث معین، با وجود نفس خود، عاری و خالی بوده است. پس هیچ حادثی را فرض نمی‌کنی مگر اینکه وجود نفس پذیرنده آن تعقل می‌شود، در حالی که آن حادث موجود نیست. و اگر از حوادث خالی نباشد، لازم نیست که مانند آنها حادث باشد، با پذیرش آنها برای نفس خود. پس حق (الحق) از نفس خود خبر داده است که بنده خود را اجابت می‌کند اگر از او سؤال کند، و از او راضی می‌شود اگر او را راضی کند، و از توبه بنده خود شاد می‌شود اگر توبه کند. پس ای عقل، بنگر که با چه کسی نزاع می‌کنی. و محال است که ما تو را تصدیق کنیم و پروردگارمان را تکذیب کنیم، و حکم را از تو بگیریم، در حالی که تو بنده‌ای مانند من هستی، و گرفتن از خدا را ترک کنیم، در حالی که او به نفس خود داناتر است. اوست که نفس خود را به همه اینها وصف کرده است. و ما حقیقت همه اینها را با حد و ماهیتش می‌دانیم، اما نسبت دادن آن به خدا را نمی‌دانیم، به دلیل جهل ما به ذات او. و ما از تفکر در ذات او منع و برحذر داشته شده‌ایم و بر ما حجر شده است. و تو ای عقل، با نظر خود می‌خواهی حقیقت ذات خالق خود را بدانی. در میدانی جز میدان خود شنا نکن، و در نظر خود از معرفت مرتبه فراتر مرو، و اصلاً به ذات تعرض مکن. زیرا خدا برای ما آشکار ساخته است که او محل یا منزل توقف حرکات بندگانش در سفرهایشان با احوالشان است. پس اگر عقل سلیمی داری، متوجه شو. سپس لازم نیست که اگر امری نزد تو حادث شده است، آن امر در نفس خود حادث باشد، نه عقلاً، نه عرفاً و نه شرعاً. زیرا تو می‌گویی: امروز نزد ما ضعیفی حادث شد، و این صحیح است که حدوث آن نزد شماست، نه حدوث آن در نفس خود در آن زمان، بلکه عین آن از پنجاه سال پیش موجود بوده است. با این حال، برای بیان و ظهور آن نیازی به آن نیست. پس هر کس می‌خواهد بر خدا وارد شود، باید عقل خود را رها کند و شریعت خود را پیشاپیش بفرستد. زیرا خدا تقیید را نمی‌پذیرد و عقل تقیید است. بلکه برای او تجلی (التجلی) در هر صورتی ممکن است، همانطور که برای او ممکن است تو را در هر صورتی که بخواهد مرکب سازد. پس حمد خدایی را که ما را در صورتی مرکب ساخت که او را (سبحانه) به صورت معینی مقید نکرد و او را در آن محصور نساخت، بلکه آنچه را که برای اوست، به واسطه تعریف او که برای اوست، قرار داد، و آن تحول او در صورت‌هاست. پس خدا را آنگونه که شایسته اوست، نشناخت مگر خدا. و کسی که با خدا در آنچه خود را به آن وصف کرده است، توقف کند، او را تحت حکم عقل خود از حیث نفس او داخل نمی‌کند. (تعالى الله عن ذلك علوا كبيرا) [خداوند از این بسیار برتر است]. و بدان که مسمای نکاح ممکن است عقد وطی باشد، و ممکن است عقد و وطی با هم باشد، و ممکن است وطی باشد و نفس وطی عین عقد باشد، زیرا وطی صحیح نیست مگر با عقد زوجین. و از آن، الهی، روحانی و طبیعی است. و ممکن است برای تناسل - یعنی برای ولادت - اراده شود، و ممکن است فقط برای التذاذ باشد. اما الهی، توجه حق (الحق) بر ممکن در حضرت امکان با اراده محبّی است تا ابتهاج با آن باشد. پس هنگامی که حق (الحق) با آنچه ذکر کردیم بر او توجه کند، تکوین را از این ممکن آشکار می‌سازد. پس آنچه از این اجتماع متولد می‌شود، هستی (الوجود) برای ممکن است. پس عین ممکن، «اهل» نامیده می‌شود، و توجه ارادی حی، «نکاح»، و تولید، «ایجاد» در عین آن ممکن و «وجود» اگر بخواهی. و عروسی‌ها، شادی‌ای است که برای اسماء حسنی به دلیل آنچه در این نکاح از ایجاد ظاهر در اعیان ممکنات است، به وجود می‌آید، برای ظهور آثار اسماء در آن. زیرا برای آنها اثری در نفس خود و نه در مسمای خود صحیح نیست، بلکه اثر و سلطنت آنها در عین ممکن است، به دلیل نیازمندی و حاجتی که در آن به آنچه در دست اسماء است، وجود دارد. پس سلطنت آنها در آن آشکار می‌شود. به همین دلیل، شادی و سرور و برپایی عروسی‌ها را به آنها نسبت دادیم. و این نکاح مستمر و دائم‌الوجود است و انقطاع در آن صحیح نیست. و طلاق برای این عقد نکاحی در اعیان پذیرنده اعراض و صور واقع نمی‌شود، بلکه در صور و اعراض واقع می‌شود، و آن عدم آنها برای نفس خود در زمان دوم از زمان وجودشان است. و آن «خلع» است، زیرا بازگرداندن وجودی است که به آنها داده شده بود، زیرا به منزله صداق برای عین این ممکن خاص است. اگر بگویی: پس حق (الحق) به وجود حادث متصف نمی‌شود، چه کسی این بازگردانده‌شده را پذیرفت و خزانه آن کجاست، و حتماً باید محلی برای آن باشد؟ می‌گوییم: تجلی (التجلی) حق (الحق) در صورت‌ها و تحول او که شرع آن را برای ما آورده است و ما آن را کشفاً (الکشف) به طور عموم و خصوص دیده‌ایم، عین همان چیزی است که ممکنات صوری و عرضی از وجود بازگرداندند هنگامی که معدوم شدند. پس حق (الحق) دو نسبت در هستی (الوجود) دارد: نسبت وجود نفسی که برای او واجب است، و نسبت وجود صوری، و آن همان است که در آن برای خلقش تجلی (التجلی) می‌کند. زیرا محال است که در وجود نفسی واجب خود تجلی کند، چون ما عینی نداریم که او را با آن درک کنیم، زیرا ما در حال عدم و وجود خود پیوسته مرجح هستیم و حکم امکان از ما زائل نشده است. پس او را نمی‌بینیم مگر به واسطه خودمان، یعنی از حیثی که حقایق ما آن را به او می‌دهند. پس حتماً باید تجلی (التجلی) او در وجود صوری باشد، و آن همان است که تحول و تبدل را می‌پذیرد. پس گاهی ممکن که به واسطه آن خلع می‌شود، به آن وصف می‌شود، و گاهی حق (الحق) در تجلی (التجلی) خود به واسطه آن ظاهر می‌شود. پس ای ولی، در این موطن بنگر، زیرا موطنی بسیار پنهان است. و اگر زبان شرع که به آن اشاره کرده و بر آن تنبیه نموده، نبود، ما آن را برای اهل راه خود آشکار نمی‌ساختیم. زیرا بسیاری از اهل راه خدا، اگرچه تجلی (التجلی) حق (الحق) را مشاهده می‌کنند، اما معرفتی (المعرفة) به آن ندارند و نه به آنچه دیده‌اند و نه به صورت آنچه امر بر آن است. و کسی که آنچه را ما از بیان قصد شرع در آن مقرر کردیم، بداند، می‌داند که عالم چگونه صادر شده است و عالم چیست، و چه چیزی از عالم عینش باقی می‌ماند و چه چیزی از آن فانی می‌شود، و چه چیزی را حق (الحق) از عالم به ارث می‌برد. زیرا اوست که می‌فرماید: (إِنَّا نَحْنُ نَرِثُ الْأَرْضَ ومن عَلَيْها وإِلَيْنا يُرْجَعُونَ) [همانا ما وارث زمین و هر که بر آن است هستیم و به سوی ما بازگردانده می‌شوند]. و در حقیقت، چیزی را به ارث نبرد مگر وجودی که در آن برای خلق ظاهرشده‌اش که صور و اعراض ممکنات در آن خلع شده‌اند، تجلی (التجلی) می‌کند. زیرا وارث با وجود و بقای مورّث عنه، وارث نیست، بلکه پس از انتقال و عدم او از این موطن است، و آن اتصاف او به عدم است. و این تنها برای صور و اعراض است. پس او پیوسته وارث است، و خلع پیوسته واقع می‌شود، و قبول پیوسته حاصل است، و نکاح لازم بر دوام است. و این معنای دیمومتی است که به حق (الحق) نسبت داده می‌شود. پس او (تعالی) عمل می‌کند، با وجود اینکه پیوسته ایجادکننده عالم بوده است و عالم پیوسته محدَث بوده است. پس عالم حکم حدوث در عین قدم دارد. پس طرفی برای آن تعقل نمی‌شود که به آن منتهی شود، زیرا از ذات خود پیوسته تحت حکم ترجیح الهی برای آن بوده است، یا به عدم یا به وجود. و هنگامی که این در نسبت الهی مقرر شد، حکم نسبت روحانی را در این مسئله ذکر می‌کنیم. و آن این است که وجودی که در نسبت الهی ذکر کردیم، وجه خاصی است که برای هر ممکنی از خداست، خواه سبب وضعی در آنجا باشد یا نباشد. پس خدا در هر حال و به هر وجهی، بالا و پایین، ایجادکننده است. و اما نکاح روحانی، حضرت آن طبیعت است، و آن اهل اصلی در نکاح الهی است. پس هنگامی که در نکاح اول، صورتی از صورت‌ها متولد شد، آن صورت اهل برای این روح کلی بود. پس حق (الحق) او را به نکاح او درآورد، پس با او بنا کرد. پس هنگامی که با او همبستر شد، فرزندی از آن همبستری ظاهر شد، و آن روح جزئی است. پس آن صورت به واسطه او زنده شد و این فرزند بر آن قیام می‌کند و آن را تدبیر می‌کند و برای آن تلاش می‌کند و سفر می‌کند و به خطرها می‌افتد تا آنچه را که به واسطه آن بر آن جود می‌کند، حساً و معناً کسب کند، یعنی از روزی‌های محسوس و معنوی. و عروسی که برای این نکاح روحانی است، تنها توسط قوایی برپا می‌شود که ظهور آنها نیست مگر در این صورت طبیعی، به واسطه وجود این نکاح. پس برای آنها التذاذ و شادی حاصل می‌شود به واسطه اثری که از وجود این بنا برای آنها حاصل می‌شود. و اما نکاح طبیعی، آن چیزی است که این ارواح جزئی که مدبر این صورت‌ها هستند، از اجتماع دو صورت طبیعی با التیام و بنا که در عالم حس «نکاح» نامیده می‌شود، طلب می‌کنند. پس از این نکاح، امثال زوجین از هر حیوان و نباتی متولد می‌شود. پس انسان از دو انسان و اسب از دو اسب ظاهر می‌شود. و ممکن است التیام میان غیر دو مثل واقع شود، پس شکلی غریب میان آنها متولد شود که شبیه عین هیچ یک از زوجین نیست، مانند قاطر میان الاغ و اسب. و هر مولودی که میان دو شکل مختلف باشد، هرگز تولید نمی‌کند، زیرا عقیم است. او کسی است که متولد می‌شود و نمی‌زاید. پس نکاح چنین نوعی برای ولادت نیست، بلکه فقط برای شهوت و التذاذ است. پس این نکاح شبیه نکاح اول است که غیر جنس زوجین از آن خارج شد، از این جهت که نکاح در غیر جنس است، پس شکل غریب میان آنها متولد می‌شود که شبیه هیچ یک از آن دو - یعنی زوجین - نیست. پس بفهم. و تلقیح درختان با بادهای بارورکننده (لواقح) از نکاح طبیعی است. و اما باد عقیم، نکاح آن شبیه نکاح شکل غریبی است که چیزی از آن متولد نمی‌شود. و عروسی‌های این نکاح طبیعی، همان چیزی است که در عرف مشهود است و در عالم شهود «عرس» نامیده می‌شود، از ولیمه‌ها و دف زدن‌ها. و اما آنچه از نکاح طبیعی در درخت متولد می‌شود، همان میوه‌ای است که هنگام این حمل می‌دهد. و صورت وقوع نکاح درختان، زمانی است که آب در چوب جریان می‌یابد، و آن هنگام طلوع سعدهاست. پس آن نکاحی سعید در طالعی سعید است. و قبل از آن، زمان خواستگاری و فرستادگانی است که میان زوجین، مرد و زن، راه می‌روند. و وقوع ولادت به اندازه زمان حمل این دو نوع از درخت است. پس برخی در بهار متولد می‌شوند و برخی در تابستان، همانطور که حمل حیوان زمانش با اختلاف طبیعتش متفاوت است. زیرا از تأثیر زمان در آن نمی‌پذیرد مگر به اندازه‌ای که مزاج و طبعش به آن می‌دهد. پس هنگامی که جوّ با زمین نکاح کند و آب را نازل کند و آثار انوار فلکی آن را در رحمش تدبیر کند، زمین با گل‌ها می‌خندد و (أَنْبَتَتْ من كُلِّ زَوْجٍ بَهِيجٍ) [از هر جفت زیبایی می‌رویاند]. و تنها به این دلیل جفت بود که نکاح را طلب می‌کرد، زیرا جز میان زوجین واقع نمی‌شود. پس عین عروسی آن، همان چیزی است که از گل‌ها آشکار می‌سازد. و آنچه در گیاه خلق شده است، همان است که از آفات سالم مانده است، و آنچه خلق نشده است، همان است که آفت به آن رسیده است. و (والله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ) [و خدا بر هر چیزی تواناست]. پس ما بخشی از خاتمه‌ها و عروسی‌ها را به طور اجمالی ذکر کردیم، بدون تفصیل، اما مادران (اصول) را در آن محصور ساختیم. و اما اسرار غیرعربی (الأسرار الأعجمية)، تنها به این دلیل غیرعربی نامیده شدند که اسرار عربی آنهایی هستند که عین فهم، آنها را به صورت‌هایی درک می‌کند، مانند آیات محکمات در کتاب‌های نازل‌شده. و اسرار غیرعربی آنهایی هستند که با تعریف درک می‌شوند نه با تأویل. و آنها مانند آیات متشابهات در کتاب‌های نازل‌شده هستند. پس تأویل آنها را جز خدا یا کسی که خدا او را آگاه سازد، نمی‌داند. و فکر را در علم به آنها دخلی نیست و قدمی در آن ندارد. و کسی در استخراج سرّ در آنها پیروی نمی‌کند مگر کسی که خدا متعال ذکر کرده است، و او کسی است که در قلبش زیغ (انحراف) است، یعنی تمایل از حق (الحق) به واسطه پیروی از آنچه خدا در آن ذکر کرده است که تأویل آن را جز خدا نمی‌داند. پس هر کس می‌خواهد آن را بداند، نباید در آن اسرار فرو رود، بلکه باید در راهی که به خدا می‌رساند، عمل کند، و آن عمل به آنچه خدا برای او تشریع کرده است با تقواست. زیرا خداوند متعال فرموده است که برای صاحبش علم فرقان را نتیجه می‌دهد. پس هنگامی که به آن عمل کند، خدا تعلیم آن اسرار غیرعربی را بر عهده می‌گیرد. پس هنگامی که آن را به او عطا کند، در حق او عربی می‌شود. پس می‌داند که خدا چه چیزی را با آن اراده کرده است و حکم تشابهی که قبل از علم به آن، به آن وصف می‌شد، از او زائل می‌شود. زیرا خدا آنها را متشابه متجلی ساخت که دو طرف در شبه دارند. پس صاحب نظر نمی‌داند که نازل‌کننده آن چه چیزی را در آن تشابه اراده کرده است. زیرا حتماً باید آن را به یکی از دو طرف از وجه خاصی خالص کند. و اگر میان دو طرف جمع کنی، برای هر طرفی از آن، چیزی است که برای دیگری نیست، از آن مخلوق یا از آن نازل‌شده، اگر از صور کلام خدا باشد. پس نازل‌شده مانند سخن خداوند متعال است: (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏) [رحمان بر عرش استیلا یافت]، و مانند سخن او: (وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ) [و او با شماست هر کجا که باشید]، و مانند سخن او: (ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ) [و ما از رگ گردن به او نزدیک‌تریم]، و مانند سخن او: (وهُوَ الله في السَّماواتِ وفي الْأَرْضِ) [و او خدا در آسمان‌ها و در زمین است]، و مانند سخن او: (هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ الله في ظُلَلٍ من الْغَمامِ) [آیا جز این انتظار دارند که خدا در سایه‌هایی از ابر نزد آنان آید؟]، و مانند سخن او: (وجاءَ رَبُّكَ والْمَلَكُ صَفًّا صَفًّا) [و پروردگارت و فرشتگان صف در صف آیند]. و امثال اینها در کتاب‌های نازل‌شده. و اما اخبار رسولانی که از حق (الحق) آنچه را به زبان‌هایشان بر ما وحی شده، ترجمه کرده‌اند، از امور متشابه، از کثرت قابل شمارش نیستند. پس از تعریف، کسی از آن پیروی نمی‌کند مگر کسی که در قلبش زیغ باشد. و اما کسی که از راه‌هایی که به کشف (الکشف) آنها می‌رساند، پیروی می‌کند، او از اهل زیغ نیست، بلکه از اهل استقامت است. پس محمدی، محکم از آیات است، زیرا عربی است. و متشابه، موسوی است، زیرا غیرعربی (اعجمی) است. پس غیرعربی بودن نزد اهل غیرعربی، عربی است، و عربی بودن نزد غیرعرب، عجمه (غیرعربی بودن) است. و در الفاظ، با اصطلاح پوشیده شده است. و در آنجا عجمه‌ای نیست مگر در اصطلاح و الفاظ و صورت‌های ظاهری. اما در معانی، همه آنها عربی هستند و عجمه‌ای در آنها نیست. پس کسی که ادعای علم معانی کند و به شبه قائل شود، اصلاً به آنچه ادعا کرده که دانسته، علم ندارد. زیرا معانی مانند نصوص نزد اهل الفاظ هستند، چون بسیط هستند و ترکیبی در آنها نیست. و اگر ترکیب نبود، صورتی برای عجمه در هستی (الوجود) ظاهر نمی‌شد. و در این منزل از علوم، چیزی است که از کثرت قابل شمارش نیست. اگر آنها را ذکر کنیم، امر طولانی می‌شود. و به همین دلیل، این منزل بر هر منزلی از منازل جمع و هستی (الوجود) سیادت دارد. و ما حصر این منازل را در این کتاب در آنچه پیشتر آمد، ذکر کردیم. پس بدان که این منزل، منزل برزخ حقیقی است. زیرا مردم در برزخ توسعه می‌دهند، در حالی که آنگونه که گمان می‌کنند نیست، بلکه آنگونه است که خدا ما را در کتابش به آن شناساند، در سخن او درباره دو دریا: (بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ) [میان آن دو برزخی است که تجاوز نمی‌کنند]. پس حقیقت برزخ این است که در آن برزخی نباشد، و آن چیزی است که آنچه میان آن دو است، به ذات خود با هم ملاقات می‌کند. پس اگر یکی از آن دو با وجهی غیر از وجهی که دیگری با آن ملاقات می‌کند، ملاقات کند، حتماً باید میان دو وجه در نفس خود برزخی باشد که میان دو وجه جدایی اندازد تا با هم ملاقات نکنند. پس آن برزخ نیست. پس هنگامی که عین وجهی که یکی از دو امر که میان آنهاست با آن ملاقات می‌کند، عین وجهی باشد که دیگری با آن ملاقات می‌کند، آن برزخ حقیقی است. پس به ذات خود از هر آنچه با آن ملاقات می‌کند، برزخ است. پس فصل میان اشیاء ظاهر می‌شود و فاصل، واحدالعین است. و هنگامی که این را دانستی، دانستی که برزخ چیست. و مثال آن، سفیدی هر سفیدی است که در هر سفیدی به ذات خود است، نه در سفیدی‌ای با وجهی از آن، و نه در سفیدی دیگری با وجهی دیگر، بلکه به عین خود در هر سفیدی است. و دو سفیدی از یکدیگر متمایز شده‌اند، و سفیدی با آنها ملاقات نکرده است مگر به ذات خود. پس عین سفیدی در دو امر یکی است، و دو امر، هیچ یک عین دیگری نیست. پس این مثال برزخ حقیقی است. و همچنین انسانیت در هر انسانی به ذات واحد خود، برزخ حقیقی است. و آنچه تقسیم می‌شود، واحد نیست. و واحد تقسیم می‌کند و تقسیم نمی‌شود، یعنی در نفس خود تقسیم نمی‌شود. زیرا اگر در عین خود قسمت را بپذیرد، واحد نیست. و هنگامی که واحد نباشد، با هر چیزی از دو امری که میان آنهاست، به ذات خود ملاقات نمی‌کند. و معلوم است که واحد بدون شک وجود دارد. و برزخ دانسته می‌شود و درک نمی‌شود، و تعقل می‌شود و شهود (الشهود) نمی‌شود. سپس مردم هر چیزی را که میان دو چیز باشد، برزخ قرار داده‌اند، از روی توسعه، اگرچه آن شیء که نزد آنها برزخ نامیده می‌شود، جسمی بزرگ یا کوچک باشد. اما چون مانع از ملاقات دو امری است که میان آنهاست، آن را برزخ نامیده‌اند. پس دو جوهری که با هم مجاورت دارند و هر یک از آنها عقلاً و حساً تقسیم نمی‌شود، حتماً باید برزخی میان آنها باشد. و مجاورت دو جوهر، مجاورت حیزهای آنهاست. و میان حیزهای آنها حیز سومی نیست که در آن جوهری نباشد. و میان دو حیز و دو جوهر، برزخی معقول بدون شک وجود دارد که مانع از آن است که عین هر جوهری عین دیگری باشد و عین هر حیزی عین دیگری باشد. پس او به ذات خود با هر جوهر و هر حیز ملاقات کرده است. کسی که این را بداند، حکم شارع را می‌داند، هنگامی که فرمود: (إن الله خلق الماء طهورا لا ينجسه شي‏ء) [خداوند آب را پاک‌کننده آفرید و چیزی آن را نجس نمی‌کند]، با وجود حصول نجاست در آن بدون شک. اما چون نجاست از آب متمایز بود، آب بر اصل خود پاک باقی ماند، جز اینکه زدودن نجاست از آن دشوار است. پس آنچه شارع از استعمال آبی که در آن نجاست است، مباح کرد، استعمال کردیم، و آنچه را منع کرد، از آن خودداری کردیم، به دلیل امر شرع، با تعقل ما که نجاست در آب است و تعقل ما که آب در ذات خود پاک‌کننده است و چیزی آن را نجس نمی‌کند. پس شارع ما را از استعمال آبی که در آن نجاست است، منع نکرد به دلیل نجس بودن یا نجس شدن آن، بلکه ما را از استعمال شیء نجس منع کرد، به دلیل اینکه نمی‌توانیم اجزای آن را از اجزای آب پاک جدا کنیم. پس میان نجاست و آب، برزخی مانع وجود دارد که به خاطر آن با هم ملاقات نمی‌کنند. و اگر ملاقات می‌کردند، آب نجس می‌شد. پس این را بدان. آیا نمی‌بینی صورت‌هایی که در بازار بهشت هستند، همه برزخ‌ها هستند؟ اهل بهشت به خاطر این صورت‌ها به این بازار می‌آیند، و اینها همان‌هایی هستند که اعیان اهل بهشت در آنها متقلب می‌شوند. پس هنگامی که وارد این بازار می‌شوند، هر کس صورتی را بخواهد، در آن داخل می‌شود و با آن به سوی اهل خود باز می‌گردد، همانطور که با حاجتی که از بازار می‌خرد، باز می‌گردد. پس ممکن است گروهی یک صورت واحد از صورت‌های آن بازار را ببینند و هر یک از آن گروه آن را بخواهد. پس عین شهوت او در آن، با آن درآمیخته و در آن داخل شده و آن را حیازت کرده است. پس هر یک از آن گروه آن را حیازت می‌کند. و کسی که آن را نمی‌خواهد، با عین خود ایستاده و به هر یک از آن گروه می‌نگرد که در آن صورت داخل شده و با آن به سوی اهل خود بازگشته است، در حالی که صورت همانطور که در بازار است، از آن خارج نشده است. پس حقیقت این امر را که شرع بر آن تصریح کرده و ایمان به آن واجب شده است، نمی‌داند مگر کسی که نشأت آخرت و حقیقت برزخ و تجلی (التجلی) حق (الحق) در صورت‌های متعدد را بداند که در آنها از صورتی به صورتی تحول می‌یابد، در حالی که عین یکی است. پس بصر، تحول او را در صورت‌ها شهود (الشهود) می‌کند و عقل می‌داند که او هرگز تحول نیافته است. پس هر قوه‌ای به حسب آنچه ذاتش به آن داده است، درک کرده است. و حق (الحق) در نفس خود، حکم عقل را در حکم خود تصدیق کرده است و حکم بصر را در حکم خود تصدیق کرده است. سپس او به نفس خود علمی دارد که نه عین آنچه عقل بر او حکم کرده است، و نه عین آنچه شهود (الشهود) بصر بر او حکم کرده است، و نه غیر این دو است، بلکه عین همان چیزی است که آن دو حکم کرده‌اند، و آن چیزی است که حق (الحق) از نفس خود دانسته است و این دو حکم‌کننده آن را ندانسته‌اند. پس منزه است دانای توانا که تقدیر کرد و قضا نمود و حکم کرد و امضا نمود. و (قَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ) [و پروردگارت حکم کرد که جز او را نپرستید] در هر معبودی. و چه چیزی آشکارتر از تحول او در صورت‌های معبودات است؟ اما بیشتر مردم نمی‌دانند. سپس برای ما تشریع کرد که او را در هیچ یک از آنها نپرستیم، اگرچه می‌دانیم که او عین آنهاست. و کسی که او را در آن صورت‌ها پرستید، نافرمانی کرد و او را مشرک قرار داد و مغفرت را بر خود حرام کرد. پس مؤاخذه در مورد مشرک حتماً واجب شد. سپس پس از آن، مؤاخذه برداشته می‌شود. و تنها به دلیل جهل او به صورت آنچه نزد او در شریک است، برداشته شد، با نفی آن صفت در آخرت از شریک. به همین دلیل مجازات شد و به همین دلیل رحمت پس از عقوبت او را فرا گرفت، اگرچه از آتش خارج نشود. و عالم از ما در اینجا به صورت آنچه مشرک آن را پرستیده است، نه در دنیا و نه در آخرت از علم خود دور نشد، زیرا چشم او در دنیا واقع نشد و علم او تعلق نگرفت مگر به معبود در آن صورت. و حال مشرک چنین نبود، بلکه حال او شهود (الشهود) صورت بود. پس مشرک در آخرت از آن بازگشت و عالم بازنگشت. و اگر باز می‌گشت، از منکران بود. پس برای او صحیح نیست که بازگردد.\n\n> فالشرك باق ولكن ليس يعلمه *** إلا الذي شاهد الأعيان والصورا\n> فمن يقول بتوحيد أصاب ومن *** يقول بالشرك فيه صدق الخبرا\n> إن الشريك لمعدوم وليس له *** في عين عابدة عين ولا أثرا\n\n> پس شرک باقی است، اما آن را نمی‌داند *** مگر کسی که اعیان و صورت‌ها را مشاهده کرده باشد\n> پس هر کس به توحید قائل شود، به صواب رفته است و هر کس به شرک قائل شود، در آن خبر را تصدیق کرده است\n> همانا شریک معدوم است و برای او *** در عین پرستنده، نه عینی است و نه اثری\n\nو در این منزل از علوم، چیزی است که هیچ پیامبر و ولی‌ای که قبل از این امت بوده، آن را نمی‌داند. این علم به این رسول، محمد (صَلَّى اللهُ عَليهِ وسَلَّم) و این امت محمدیه اختصاص یافته است. پس کامل از این امت، این مقام را ظاهراً و باطناً به دست آورده است. و غیر کامل، آن را ظاهراً یا باطناً به دست آورده است و برای او کامل نشده است، اما به دلیل اینکه از امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است، او را فرا گرفته است. و او (صَلَّى اللهُ عَليهِ وسَلَّم) تنها با مؤمنان از امتش، چه مؤمن کوچک باشد یا بزرگ، فخر می‌کند. زیرا ذریه در ایمان تابع پدران هستند و در کفر تابع آنها نیستند اگر پدران کافر باشند. اما کافران هر امتی از کافران امت دیگر جدا می‌شوند، زیرا عقوبت با عظمت کسی که به او کفر ورزیده شده، بزرگ می‌شود. این همان چیزی است که معهود است، مگر کافران این امت، زیرا آنها سبک‌ترین عذاب را دارند، به دلیل اینکه کسی که به رسالت او کفر ورزیده‌اند، کسی است که خدا او را (رَحْمَةً لِلْعالَمِينَ) [رحمتی برای جهانیان] فرستاده است. و خدا این را در دنیا آشکار ساخت و آن را عنوان حکم آخرت قرار داد. و آن این است که رسول خدا محمد (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که قیامش در راه خدا و غیرتش بر حق (الحق) در قصه رعل و ذکوان و عُصَیّه شدت یافت، یک ماه کامل در هر نماز بر آنها دعا می‌کرد، و آن قنوت است. پس خدا متعال در این باره به او وحی کرد، هنگامی که می‌دانست اگر در امری دعا کند، او را اجابت می‌کند، پس او را از دعا کردن بر آنها نهی کرد، برای باقی ماندن آنها و رحمت بر آنها. پس فرمود: (وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ) [و ما تو را نفرستادیم مگر رحمتی برای جهانیان]، یعنی تا بر آنها رحم کنی. زیرا او به سوی همه مردم فرستاده شده است تا بر آنها با انواع وجوه رحمت، رحم کند. و از وجوه رحمت این است که برای آنها به توفیق و هدایت دعا کند. و از او (صَلَّى اللهُ عَليهِ وسَلَّم) صحیح است که می‌فرمود: (اللهم اهد قومي فإنهم لا يعلمون) [خدایا قوم مرا هدایت کن، زیرا آنها نمی‌دانند]. و از دعا کردن بر آنها نهی شد. پس اگر کسی که به او شرک ورزیده است، رسول او (صَلَّى اللهُ عَليهِ وسَلَّم) را در دعا کردن بر آنها عتاب می‌کند، پس فعل او در مورد آنها چگونه خواهد بود هنگامی که او (سبحانه) خود، حکم در مورد آنها را بر عهده گیرد؟ و ما می‌دانیم که او متعال ما را به هیچ خلق کریمی ترغیب نکرده است مگر اینکه خودش به آن سزاوارتر است. پس از اینجا دانسته می‌شود که حکم او در مورد مشرکان روز قیامت از امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) چیست، اگرچه خدا آنها را به واسطه شرک در آخرت مؤاخذه کند، زیرا مؤاخذه حتماً لازم است. اما مؤاخذه او در مورد آنها، لطفی الهی دارد که مشرک غیر این امت با مشرک این امت در آن برابر نیست. من آن لطف را می‌شناسم و آن را آشکار نمی‌کنم، همانطور که او (صَلَّى اللهُ عَليهِ وسَلَّم) درباره کسانی از این امت که به واسطه گناهانشان آتش به آنها رسیده است، فرمود، بلکه از امت‌ها فرمود که خدا آنها را در آن می‌میراند (أمانة الحديث) [امانت حدیث]. و این در این کتاب گذشته است که مسلم در صحیح خود آن را آورده است. و من تو را بر سر راه قرار دادم تا حکم خدا را در مورد این امت محمدیه، مؤمن و کافر آن، بدانی. زیرا کفر کافر آن، او را از دعوت خارج نمی‌کند، پس حکم آن برای او یا علیه او حتماً لازم است. آنها بهترین امتی هستند که (أُخْرِجَتْ لِلنَّاسِ) [برای مردم بیرون آورده شده‌اند]. مؤمن آنها به واسطه ایمانش و کافر آنها به واسطه کفرش، بهتر از هر مؤمنی از غیر این امت و کافر آن هستند. و آنچه در این منزل ذکر کردیم، با توجه به علومی که در بر دارد، جزئی از هزار جزء، بلکه از هزاران جزء است. و (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ) [و خدا حق را می‌گوید و او راه را هدایت می‌کند]."
  },
  "page_count": 9
}